// При вызове возможно задать параметры:
// Действие - выполняемое действие:
//		registration - регистрация пользователя
//		userUpdate - редактирование данных пользователя
//		userRestore - восстановление данных регистрации -
//			отправляется письмо на email пользователя
//			содержащая пароль, и если пользователь не
//			прошел подтверждение регистрации - ссылку подтверждения
//		userDelete - удаление регистрации пользователя
//		licenseQuery - запросы лицензий, здесь можно запросить
//			лицензию и посмотреть наличие запросов,
//			при необходимости скорректировать данные запроса
//		licenseActive - активные лицензии, здесь можно посмотреть
//			все свои активные лицензии, сроки их действия,
//			и на какое количество пользователей,
//			список активных сеансов, и при необходимости
//			завершить какие то сеансы.
//	Логин - логин пользователя
//	Пароль - пароль пользователя
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	urlAPI=Параметры.urlAPI;
	Server=Параметры.Server;
	Логин=?(Параметры.Свойство("Логин"),Параметры.Логин,"");
	Пароль=?(Параметры.Свойство("Пароль"),Параметры.Пароль,"");
	Если Параметры.Свойство("idSession") Тогда
		КодСеанса=Параметры.idSession;
	Иначе
		ИмяПользователя=ПолноеИмяПользователя();
		СисИнфо = Новый СистемнаяИнформация;
		Софт=Метаданные.Имя+" v."+Метаданные.Версия+", 1C: "+СисИнфо.ВерсияПриложения;	
	КонецЕсли;
	
	Если Параметры.Свойство("Действие") Тогда
		Действие=Параметры.Действие;
	ИначеЕсли КодСеанса<>0 Тогда
		Действие="licenseQuery";
	ИначеЕсли ПустаяСтрока(Логин) Тогда
		Действие="registration";
	Иначе
		Действие="userUpdate";
	КонецЕсли;
	
	Попытка
		//Сначала смотрим наличие в хранилище записей Авторизации
		Данные=ХранилищеОбщихНастроек.Загрузить("Ниракс-Лицензирование","Авторизация",,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
		Если ТипЗнч(Данные)=Тип("Структура") Тогда 
			Если Не ПустаяСтрока(Данные.Логин) Тогда
				СохранятьПароль=Истина;
				ВходБезЗапроса=?(Данные.Свойство("ВходБезЗапроса"),Данные.ВходБезЗапроса,Ложь);
				Элементы.ВходБезЗапроса.Доступность=Истина;
				Если ПустаяСтрока(Логин) Тогда 
					Логин=Данные.Логин;
					Пароль=Данные.Пароль;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ПустаяСтрока(Логин) Тогда
			// Берем данные из хранилища программного обеспечения /не обязательно/	
			Данные=ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","ОбъектMySQL",,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
			Если ТипЗнч(Данные)=Тип("Структура") Тогда
				Логин=Данные.ОрганизацияДляЗаявки;
				Пароль=Данные.КлючПО;
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Версия=ЭтаФорма.Заголовок;
	ЭтаФорма.Заголовок="Личный Кабинет: Версия - "+Версия;
	ДействиеПриИзменении(Неопределено);
	Если КодСеанса<>0 Тогда
		Элементы.Действие.СписокВыбора.Очистить();
		Элементы.Действие.СписокВыбора.Добавить("licenseQuery","Запросы лицензий");
		Элементы.Действие.СписокВыбора.Добавить("licenseActive","Активные лицензии");
	Иначе
		ЭтаФорма.ТекущийЭлемент=Элементы.Логин;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Если КодСеанса<>0 Тогда
		Запрос=Новый Структура("action, idSession", "sessionClose", КодСеанса);
		Ответ=ВыполнитьЗапрос(Запрос);
		Если ответ.result=Ложь Тогда
			ПоказатьПредупреждение(,"При закрытии сеанса произошли ошибки:"+символы.ПС+Ответ.comment,,"Закрытие сеанса");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЛогинПриИзменении(Элемент)
	Если СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Логин," ",""),"""",""),"'",""),",","")<>Логин Тогда
		ЛогинПроверен=Ложь;
		Элементы.Логин.ЦветТекстаЗаголовка = Новый Цвет(255,0,0);
		ПоказатьПредупреждение(,"Логин не может содержать пробелы и спец.символы",,"Проверка регистрации пользователя");
		ПроверкаЗаполненияПриИзменении(Элемент);
 		Возврат;
	КонецЕсли;	
	Запрос=новый Структура("action,login","isRegistration",Логин);
	Ответ=ВыполнитьЗапрос(Запрос);
	Если Ответ.result=Ложь тогда
		ЛогинПроверен=Ложь;
		Элементы.Логин.ЦветТекстаЗаголовка = Новый Цвет(255,0,0);
		ПоказатьПредупреждение(,"Проблемы доступа к серверу."+символы.ПС+Ответ.comment,,"Проверка регистрации пользователя");
	ИначеЕсли Действие="registration" Тогда
		Если Ответ.isRegistration=Истина Тогда
			ПоказатьПредупреждение(,"Пользователь с таким Логином уже существует.",,"Проверка регистрации пользователя");
			ЛогинПроверен=Ложь;
			Элементы.Логин.ЦветТекстаЗаголовка = Новый Цвет(255,0,0);
		Иначе
			ЛогинПроверен=Истина;
			Элементы.Логин.ЦветТекстаЗаголовка = Новый Цвет(0,0,0);
		КонецЕсли;
	ИначеЕсли Действие="userUpdate" или Действие="userDelete" 
		или Действие="licenseQuery" или Действие="licenseActive" Тогда
		Если Ответ.isRegistration=Истина Тогда
			ЛогинПроверен=Истина;
			Элементы.Логин.ЦветТекстаЗаголовка = Новый Цвет(0,0,0);
			Элементы.Требуется.Видимость=Ответ.role=0;
			Если Ответ.role=0 И (Действие="licenseQuery" или Действие="licenseActive") Тогда
				ЛогинПроверен=Ложь;
				Элементы.ЗаписатьИВыйти.Доступность=Ложь;
			иначе
			    Элементы.ЗаписатьИВыйти.Доступность=Истина;
			КонецЕсли;
			Если ЗначениеЗаполнено(Пароль) Тогда
				ПарольПриИзменении(Элемент);
				Возврат;
			КонецЕсли;
		Иначе
			ПоказатьПредупреждение(,"Пользователь с таким Логином не существует.",,"Проверка регистрации пользователя");
			ЛогинПроверен=Ложь;
			Элементы.Логин.ЦветТекстаЗаголовка = Новый Цвет(255,0,0);
		КонецЕсли;	
	ИначеЕсли Действие="userRestore" тогда
		Если Ответ.isRegistration=Истина Тогда
			ЛогинПроверен=Истина;
			Элементы.Логин.ЦветТекстаЗаголовка = Новый Цвет(0,0,0);
			Если Ответ.Свойство("role") Тогда
				Элементы.Требуется.Видимость=Ответ.role=0;
			КонецЕсли;
			Если ЗначениеЗаполнено(Email) Тогда
				EmailПриИзменении(Элемент);
				Возврат;
			КонецЕсли;
		Иначе
			ПоказатьПредупреждение(,"Пользователь с таким Логином не существует.",,"Проверка регистрации пользователя");
			ЛогинПроверен=Ложь;
			Элементы.Логин.ЦветТекстаЗаголовка = Новый Цвет(255,0,0);
		КонецЕсли;	
	КонецЕсли;
	ПроверкаЗаполненияПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	Если Действие="userUpdate" Тогда
		Если Элементы.Логин.Доступность=Ложь Тогда
			Элементы.ЗаписатьИВыйти.Доступность=Истина;
		ИначеЕсли ЛогинПроверен И не пустаястрока(Пароль) Тогда
			Запрос=новый Структура("action,login,password","userView",Логин,Пароль);
			Ответ=ВыполнитьЗапрос(Запрос);
			Если Ответ.result=Истина Тогда
				ПарольПроверен=Истина;
				Элементы.Пароль.ЦветТекстаЗаголовка = Новый Цвет(0,0,0);
				Фамилия=Ответ.surname;
				Имя=Ответ.name;
				Отчество=Ответ.middleName;
				Email=Ответ.email;
				Телефон=Ответ.phone;
				НаименованиеПредприятия=Ответ.companyName;
				ПарольБыл=Пароль;
				Элементы.Логин.Доступность=Ложь;
				Элементы.Фамилия.Доступность=Истина;
				Элементы.Email.Доступность=Истина;
				Элементы.Имя.Доступность=Истина;
				Элементы.Фамилия.Доступность=Истина;
				Элементы.Отчество.Доступность=Истина;
				Элементы.Телефон.Доступность=Истина;
				Элементы.НаименованиеПредприятия.Доступность=Истина;
				Элементы.СохранятьПароль.Доступность=Истина;		
				ЭтаФорма.ТекущийЭлемент=Элементы.Фамилия;
			Иначе
				ПарольПроверен=Ложь;
				Элементы.Пароль.ЦветТекстаЗаголовка = Новый Цвет(255,0,0);
				ЭтаФорма.ТекущийЭлемент=Элементы.Пароль;
				ПоказатьПредупреждение(,Ответ.comment,,"Проверка регистрации пользователя");
			КонецЕсли;
		Иначе
			ПарольПроверен=Ложь;
			Если ПустаяСтрока(Пароль) Тогда
				Элементы.Пароль.ЦветТекстаЗаголовка = Новый Цвет(0,0,0);
			Иначе
				Элементы.Пароль.ЦветТекстаЗаголовка = Новый Цвет(255,0,0);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Действие="userDelete" Тогда
		Если ЛогинПроверен И не ПустаяСтрока(Пароль) Тогда
			Запрос=новый Структура("action,login,password","isRegistration",Логин,Пароль);
			Ответ=ВыполнитьЗапрос(Запрос);
			Если Ответ.result=Истина и Ответ.isRegistration = Истина Тогда
				Элементы.ЗаписатьИВыйти.Доступность = Истина;
			Иначе
				Элементы.ЗаписатьИВыйти.Доступность = Ложь;
				ПоказатьПредупреждение(,"Не верен пароль");
			КонецЕсли;
		Иначе
			Элементы.ЗаписатьИВыйти.Доступность = Ложь;			
		КонецЕсли;
	ИначеЕсли Действие="licenseQuery" или Действие="licenseActive" Тогда 
		Если  ПустаяСтрока(Пароль) или не ЛогинПроверен Тогда
			Элементы.ЗаписатьИВыйти.Доступность = Ложь;
		Иначе
			Запрос=новый Структура("action,login,password","isRegistration",Логин,Пароль);
			Ответ=ВыполнитьЗапрос(Запрос);
			Элементы.ЗаписатьИВыйти.Доступность = Ответ.result=Истина и Ответ.isRegistration = Истина 
			И Ответ.role<>0;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаПриИзменении(Элемент)
	Если Действие="userUpdate" и Элементы.Email.Доступность=Истина тогда
		Элементы.ЗаписатьИВыйти.Доступность=Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура EmailПриИзменении(Элемент)
	Если Email<>"" Тогда
		Поз1=Найти(Email,"@");
		Поз3=Найти(Прав(Email,5),".");
		Если Поз1<2 или Поз3=0 Тогда
			Элементы.Email.ЦветТекстаЗаголовка=Новый Цвет(255,0,0);
			EmailПроверен=Ложь;
			ПоказатьПредупреждение(,"Ошибочное имя электронной почты.",,"Проверка регистрации пользователя");
		ИначеЕсли Действие="userRestore" и ЛогинПроверен тогда
			Запрос=новый Структура("action,login,email","isRegistration",Логин,Email);
			Ответ=ВыполнитьЗапрос(Запрос);
			Если Ответ.result=Истина и Ответ.isRegistration=Истина тогда
				Элементы.Email.ЦветТекстаЗаголовка=Новый Цвет(0,0,0);
				EmailПроверен=Истина;
				Элементы.ЗаписатьИВыйти.Доступность=Истина;
				ЭтаФорма.ТекущийЭлемент=Элементы.Email;
			Иначе
				Элементы.Email.ЦветТекстаЗаголовка=Новый Цвет(255,0,0);
				EmailПроверен=Ложь;
				Элементы.ЗаписатьИВыйти.Доступность=Ложь;
				ПоказатьПредупреждение(,?(Ответ.Свойство("comment"),ответ.comment,"Не верное имя электронной почты."),,"Проверка регистрации пользователя");
			КонецЕсли;
		Иначе
			Элементы.Email.ЦветТекстаЗаголовка=Новый Цвет(0,0,0);
			EmailПроверен=Истина;
		КонецЕсли;
	Иначе
		Элементы.Email.ЦветТекстаЗаголовка=Новый Цвет(0,0,0);
		EmailПроверен=Ложь;
	КонецЕсли;
	ПроверкаЗаполненияПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СохранятьПарольПриИзменении(Элемент)
	Если Действие="userUpdate" и Элементы.Email.Доступность=Истина тогда
		Элементы.ЗаписатьИВыйти.Доступность=Истина;
	КонецЕсли;
	Если СохранятьПароль=Истина Тогда
		Элементы.ВходБезЗапроса.Доступность=Истина;
	Иначе
		Элементы.ВходБезЗапроса.Доступность=Ложь;
		ВходБезЗапроса=Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЗаполненияПриИзменении(Элемент)
	Если Действие="registration" Тогда	
		ЕстьДоступ=Не (ПустаяСтрока(Логин) или Пустаястрока(Пароль) 
		или ПустаяСтрока(Имя) или Пустаястрока(Email) или Пустаястрока(Телефон)) И ЛогинПроверен И EmailПроверен;
		Элементы.ЗаписатьИВыйти.Доступность=ЕстьДоступ;
	ИначеЕсли Действие="userUpdate" и Элементы.Email.Доступность=Истина тогда
		Элементы.ЗаписатьИВыйти.Доступность=Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДействиеПриИзменении(Элемент)
	Если ПустаяСтрока(Действие) Тогда 
		Действие="registration";
	КонецЕсли;
	Если КодСеанса=0 Тогда
		Элементы.Страницы.ТекущаяСтраница=Элементы.Регистрация;
		Элементы.ЗаписатьИВыйти.Доступность=Ложь;
		ЛогинПроверен=Ложь;
		ЭтаФорма.ТекущийЭлемент=Элементы.Логин;			
		Если Действие="registration" Тогда
			Элементы.Логин.Доступность=Истина;
			Элементы.Пароль.Доступность=Истина;
			Элементы.Email.Доступность=Истина;
			Элементы.Имя.Доступность=Истина;
			Элементы.Фамилия.Доступность=Истина;
			Элементы.Отчество.Доступность=Истина;
			Элементы.Телефон.Доступность=Истина;
			Элементы.НаименованиеПредприятия.Доступность=Истина;
			Элементы.СохранятьПароль.Доступность=Истина;
			Если ЗначениеЗаполнено(Логин) Тогда
				ЛогинПриИзменении(Элемент);
				Возврат;
			КонецЕсли;
		ИначеЕсли Действие="userUpdate" или Действие="userDelete"
			или Действие="licenseQuery" или Действие="licenseActive" Тогда
			Элементы.Логин.Доступность=Истина;
			Элементы.Пароль.Доступность=Истина;
			Элементы.Email.Доступность=Ложь;
			Элементы.Имя.Доступность=Ложь;
			Элементы.Фамилия.Доступность=Ложь;
			Элементы.Отчество.Доступность=Ложь;
			Элементы.Телефон.Доступность=Ложь;
			Элементы.НаименованиеПредприятия.Доступность=Ложь;
			Элементы.СохранятьПароль.Доступность=Ложь;
			Если ЗначениеЗаполнено(Логин) Тогда
				ЛогинПриИзменении(Элемент);
				Возврат;
			КонецЕсли;
		ИначеЕсли Действие="userRestore" Тогда
			Элементы.Логин.Доступность=Истина;
			Элементы.Пароль.Доступность=Ложь;
			Элементы.Email.Доступность=Истина;
			Элементы.Имя.Доступность=Ложь;
			Элементы.Фамилия.Доступность=Ложь;
			Элементы.Отчество.Доступность=Ложь;
			Элементы.Телефон.Доступность=Ложь;
			Элементы.НаименованиеПредприятия.Доступность=Ложь;
			Элементы.СохранятьПароль.Доступность=Ложь;
			Если ЗначениеЗаполнено(Логин) Тогда
				ЛогинПриИзменении(Элемент);
				Возврат;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Действие="licenseQuery" Тогда
		ПоказатьЗапросыЛицензий();
	ИначеЕсли Действие="licenseActive" Тогда
		ПоказатьАктивныеЛицензии();
	КонецЕсли;
	ПроверкаЗаполненияПриИзменении(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИВыйти(Команда)
	Завершить=Новый ОписаниеОповещения("ЗавершениеРаботы",ЭтаФорма,Неопределено);
	Запрос=новый Структура("action,login",Действие,Логин);
	
	Если Действие="registration" Тогда 
		Запрос.Вставить("password",Пароль);
		Запрос.Вставить("surname",Фамилия);
		Запрос.Вставить("name",Имя);
		Запрос.Вставить("middleName",Отчество);
		Запрос.Вставить("email",Email);
		Запрос.Вставить("phone",Телефон);
		Запрос.Вставить("companyName",НаименованиеПредприятия);
		Ответ=ВыполнитьЗапрос(Запрос);
		Если Ответ.result=Истина Тогда
			Если СохранятьПароль Тогда 
				Данные=Новый Структура("Логин,Пароль,ВходБезЗапроса",Логин,Пароль,ВходБезЗапроса);
			Иначе
				Данные=Новый Структура("Логин,Пароль,ВходБезЗапроса","","",Ложь);
			КонецЕсли;
			ЗаписатьВХранилище(Данные);
			ПоказатьПредупреждение(Завершить,"Вам отправлено письмо. Для подтверждения регистрации перейдите по ссылке, указаной в письме.",,"Регистрация пользователя");			
		Иначе
			ПоказатьПредупреждение(,"Регистрация не произведена. Ошибки:"+символы.ПС+Ответ.comment,,"Регистрация пользователя");
		КонецЕсли;
	ИначеЕсли Действие="userRestore" Тогда
		Запрос.Вставить("email",Email);
		Ответ=ВыполнитьЗапрос(Запрос);
		Если Ответ.result=Истина Тогда
			ПоказатьПредупреждение(Завершить,"Вам отправлено письмо с данными персонализации",,"Восстановление данных регистрации");
		Иначе
			ПоказатьПредупреждение(,"Ошибки при восстановлении данных регистрации:"+Символы.ПС+Ответ.comment,,"Восстановление данных регистрации");
		КонецЕсли;
	ИначеЕсли Действие="userUpdate" Тогда
		Запрос.Вставить("passwordOld",ПарольБыл);		
		Запрос.Вставить("password",Пароль);
		Запрос.Вставить("surname",Фамилия);
		Запрос.Вставить("name",Имя);
		Запрос.Вставить("middleName",Отчество);
		Запрос.Вставить("email",Email);
		Запрос.Вставить("phone",Телефон);
		Запрос.Вставить("companyName",НаименованиеПредприятия);
		Ответ=ВыполнитьЗапрос(Запрос);
		Если Ответ.result=Истина Тогда
			Если СохранятьПароль Тогда 
				Данные=Новый Структура("Логин,Пароль,ВходБезЗапроса",Логин,Пароль,ВходБезЗапроса);
			Иначе
				Данные=Новый Структура("Логин,Пароль,ВходБезЗапроса","","",Ложь);
			КонецЕсли;
			ЗаписатьВХранилище(Данные);
			ПоказатьПредупреждение(Завершить,"Изменение данных регистрации выполнено успешно.",,"Регистрация пользователя");			
		Иначе
			ПоказатьПредупреждение(,"Изменение данных регистрации не произведено. Ошибки:"+символы.ПС+Ответ.comment,,"Регистрация пользователя");
		КонецЕсли;
	ИначеЕсли Действие="userDelete" Тогда
		Оповещение=Новый ОписаниеОповещения("УдалениеПользователя",ЭтаФорма);
		ПоказатьВопрос(Оповещение,"Вы действительно хотите удалить пользователя: "+Логин+"?",РежимДиалогаВопрос.ДаНет);
	иначеЕсли Действие="licenseQuery" или Действие="licenseActive" Тогда
		Запрос.Вставить("password",Пароль);
		Запрос.action="sessionOpen";
		Запрос.Вставить("keySoftware","registration");
		Запрос.Вставить("userName",ИмяПользователя);
		//Запрос.Вставить("workstation",ИмяКомпьютера());  //Глухов 300618
		#Если НЕ ВебКлиент Тогда
			Запрос.Вставить("workstation",ИмяКомпьютера());
		#Иначе
			Запрос.Вставить("workstation","Веб-клиент");
		#КонецЕсли	
		Запрос.Вставить("softwareVersion",Версия);
		Запрос.Вставить("userSoft",Софт);
		Ответ=ВыполнитьЗапрос(Запрос);
		Если Ответ.result=ложь или Ответ.idSession=0 Тогда
			ПоказатьПредупреждение(,"При при открытии сеанса произошли ошибки:"+символы.ПС+Ответ.comment,,"Открытие сеанса");
		Иначе
			КодСеанса=Ответ.idSession;
			Элементы.Действие.СписокВыбора.Очистить();
			Элементы.Действие.СписокВыбора.Добавить("licenseQuery","Запросы лицензий");
			Элементы.Действие.СписокВыбора.Добавить("licenseActive","Активные лицензии");
			Если Действие="licenseQuery" Тогда
				ПоказатьЗапросыЛицензий();
			Иначе
				ПоказатьАктивныеЛицензии();
		    КонецЕсли
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВХранилище(Данные)
	 ХранилищеОбщихНастроек.Сохранить("Ниракс-Лицензирование","Авторизация",Данные,,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
 КонецПроцедуры
 
&НаСервере
Процедура УдалитьВХранилище()
	ХранилищеОбщихНастроек.Удалить("Ниракс-Лицензирование","Авторизация",ИмяПользователя(),,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
КонецПроцедуры
 
&НаКлиенте
Процедура ПоказатьЗапросыЛицензий(Команда=Неопределено)
	Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаЗапросов; 
	ЭтаФорма.Заголовок="Запросы лицензий";
	ТекДан=Элементы.ЗапросыЛицензий.ТекущиеДанные;
	Если ТекДан<>Неопределено Тогда
		ТекДан=Новый Структура("idLicenseQuery",ТекДан.idLicenseQuery);
	КонецЕсли;
	Запрос=Новый Структура("action, idSession","licenseQuery", КодСеанса);
	Ответ=ВыполнитьЗапрос(Запрос);
	Если Ответ.result=Истина Тогда
		ЗапросыЛицензий.Очистить();
		Для Каждого Стр из Ответ.Data Цикл
			ЗаполнитьЗначенияСвойств(ЗапросыЛицензий.Добавить(),Стр);
		КонецЦикла;
		Если ТекДан <> Неопределено Тогда
			МТекСтр=ЗапросыЛицензий.НайтиСтроки(ТекДан);
			Если МТекСтр.Количество()>0 Тогда
				Элементы.ЗапросыЛицензий.ТекущаяСтрока=МТекСтр[0].ПолучитьИдентификатор();
			КонецЕсли;
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(,"При чтении данных произошли ошибки:"+символы.ПС+Ответ.comment,,"Запросы лицензий");
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ПоказатьАктивныеЛицензии(Команда=Неопределено)
	Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаЛицензий;
	ЭтаФорма.Заголовок="Активные лицензии";
	Запрос=Новый Структура("action, idSession","licenseActive", КодСеанса);
	Ответ=ВыполнитьЗапрос(Запрос);
	Если Ответ.result=Истина Тогда
		Лицензии.Очистить();
		Для Каждого Стр из Ответ.Data Цикл
			ЗаполнитьЗначенияСвойств(Лицензии.Добавить(),Стр);
		КонецЦикла;
	Иначе
		ПоказатьПредупреждение(,"При чтении данных произошли ошибки:"+символы.ПС+Ответ.comment,,"Активные лицензии");
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура УдалениеПользователя(Рез,Доп) Экспорт
	Если Рез=Неопределено или Рез=КодВозвратаДиалога.Нет тогда 
		возврат;
	КонецЕсли;
	Запрос=Новый Структура("action,login,password",Действие,Логин,Пароль);
	Ответ=ВыполнитьЗапрос(Запрос);
	Если Ответ.result=Истина Тогда
		УдалитьВХранилище();
		Завершить=Новый ОписаниеОповещения("ЗавершениеРаботы",ЭтаФорма);
		ПоказатьПредупреждение(Завершить,"Пользователь "+Логин+" успешно удален",,"Регистрация пользователя");
	Иначе
		ПоказатьПредупреждение(,"Ошибки при удалении пользователя:"+Символы.ПС+Ответ.comment,,"Регистрация пользователя");
	КонецЕсли;
Конецпроцедуры

&НаКлиенте
Процедура ЗавершениеРаботы(доп) Экспорт
	ЭтаФорма.Закрыть(Новый Структура("Логин,Пароль",Логин,Пароль));
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьЛицензию(Команда)
	// Запрашиваем список программ, запросы на которые не активны или отсутствуют
	Запрос=Новый Структура("action,idSession","softwareUserView",КодСеанса);
	Ответ=ВыполнитьЗапрос(Запрос);
	Если Ответ.result=ЛОжь Тогда
		ПоказатьПредупреждение(,"При чтении данных произошли ошибки:"+символы.ПС+Ответ.comment,,"Программная продукция");
	КонецЕсли;
	// заносим его в список значений для выбора и начального заполнения. 
	Список=Новый СписокЗначений;
	КолСтр=Ответ.data.Количество()-1;
	Если КолСтр<0 Тогда
		ПоказатьПредупреждение(,"Продукция для запроса отсутствует",,"Программная продукция");
		Возврат;
	КонецЕсли;
	Для Инд=0 по КолСтр Цикл
		Список.Добавить(Инд,Ответ.data[Инд].name);
	КонецЦикла;
	Оповещение=Новый ОписаниеОповещения("ДобавлениеЗапросаЛицензии",ЭтаФорма,Ответ.data);
	Список.ПоказатьВыборЭлемента(Оповещение,"Произведите выбор программной продукции");
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеЗапросаЛицензии(Выбор,Данные) Экспорт
	Если Выбор=Неопределено тогда Возврат;КонецЕсли;
	Стр=Данные[Выбор.Значение];
	// Добавляем в запросы лицензий новый запрос
	Запрос=Новый Структура("action, idSession, idSoftware","licenseQueryAdd",КодСеанса,стр.idSoftware);
	Ответ=ВыполнитьЗапрос(Запрос);
	Если Ответ.result=Ложь Тогда
		ПоказатьПредупреждение(,"При создании запроса лицензии произошли ошибки:"+символы.ПС+Ответ.comment,,"Запрос лицензии");
		Возврат;
	КонецЕсли;
	Нов=ЗапросыЛицензий.Добавить();
	Нов.idLicenseQuery=Ответ.idLicenseQuery;
	Элементы.ЗапросыЛицензий.ТекущаяСтрока=Нов.ПолучитьИдентификатор();
	Запрос=Новый Структура("action, idSession, idLicenseQuery","licenseQuery",КодСеанса,Ответ.idLicenseQuery);
	Ответ=ВыполнитьЗапрос(Запрос);
	Если Ответ.result=Ложь Тогда
		ПоказатьПредупреждение(,"При чтении созданного запроса произошли ошибки:"+символы.ПС+Ответ.comment,,"Запрос лицензии");
		ПоказатьЗапросыЛицензий();
	Иначе
		ЗаполнитьЗначенияСвойств(Нов,Ответ,"name,maxSessions,leaseTerm,queryDate");
		Нов.isDay=Число(Ответ.isDay)<>0;
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ЗапросыЛицензийПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если Не НоваяСтрока Тогда
		ТекДан=Элементы.ЗапросыЛицензий.ТекущиеДанные;
		Запрос=Новый Структура("action, idSession, idLicenseQuery, maxSessions, leaseTerm, isDay", 
		"licenseQueryUpdate", КодСеанса, ТекДан.idLicenseQuery, Формат(ТекДан.maxSessions,"ЧГ=0;ЧН="), 
		ТекДан.leaseTerm, ТекДан.isDay);
		Ответ=ВыполнитьЗапрос(Запрос);
		Если ответ.result=Ложь Тогда
			ПоказатьПредупреждение(,"При изменении запроса лицензии произошли ошибки:"+символы.ПС+Ответ.comment,,"Изменение запроса лицензии");
			ОтменаРедактирования=Истина;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗапросыЛицензийПередУдалением(Элемент, Отказ)
	ТекДан=Элементы.ЗапросыЛицензий.ТекущиеДанные;
	Запрос=Новый Структура("action, idSession, idLicenseQuery","licenseQueryDelete", КодСеанса, ТекДан.idLicenseQuery);
	Ответ=ВыполнитьЗапрос(Запрос);
	Если ответ.result=Ложь Тогда
		ПоказатьПредупреждение(,"При изменении запроса лицензии произошли ошибки:"+символы.ПС+Ответ.comment,,"Изменение запроса лицензии");
		Отказ=Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьВводКлюча(Команда)
	Оповещение=Новый ОписаниеОповещения("АктивацияЛицензии",ЭтаФорма);
	ПоказатьВводСтроки(Оповещение,"","Введите ключ продукта");
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьВыборФайла(Команда)
	Оповещение=Новый ОписаниеОповещения("АктивацияЛицензииИзФайла",ЭтаФорма);	
	Диалог=Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Ключ лицензирования(*.key)|*.key";
	Диалог.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура АктивацияЛицензии(Ключ, Доп=Неопределено) Экспорт
	Если Ключ=Неопределено Тогда Возврат;КонецЕсли;
	Запрос=Новый Структура("action, idSession, unikey","licenseActivateKey", КодСеанса, Ключ);
	Ответ=ВыполнитьЗапрос(Запрос);
	Если Ответ.result=Ложь Тогда
		ПоказатьПредупреждение(,"Ошибки активации лицензии: "+Ответ.comment,,"Активация лицензии");
	Иначе
		ПоказатьПредупреждение(,"Лицензия успешно активирована. Приятной работы.",,"Активация лицензии");
		
		ПоказатьАктивныеЛицензии();
		МСтр=Лицензии.НайтиСтроки(Новый Структура("idLicense",Ответ.idLicense));
		Если МСтр.Количество()>0 Тогда
			Элементы.Лицензии.ТекущаяСтрока=МСтр[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;		
КонецПроцедуры
	
&НаКлиенте
Процедура АктивацияЛицензииИзФайла(Файл, КодЗапроса) Экспорт
	Если Файл=Неопределено Тогда Возврат;КонецЕсли;
	ТекДок=Новый ТекстовыйДокумент;
	Оповещение=Новый ОписаниеОповещения("ЧтениеЛицензииИзФайла",ЭтаФорма,ТекДок);
	ТекДок.НачатьЧтение(Оповещение,Файл[0]);
КонецПроцедуры

&НаКлиенте
Процедура ЧтениеЛицензииИзФайла(ТекДок) Экспорт
	Текст=ТекДок.ПолучитьТекст();
	Поз=Найти(Текст,"key='");
	Текст=Сред(Текст,Поз+5,24);
	Поз=Найти(Текст,"'");
	Ключ=Лев(Текст,Поз-1);
	АктивацияЛицензии(Ключ);
КонецПроцедуры

&НаКлиенте
Процедура ЛицензииПриАктивизацииСтроки(Элемент)
	ЕстьДанные=Элементы.Лицензии.ТекущиеДанные<>Неопределено;
	Элементы.ТекущиеСеансы.Доступность=ЕстьДанные;
КонецПроцедуры

&НаКлиенте
Процедура ТекущиеСеансы(Команда)
	ТекДан=Элементы.Лицензии.ТекущиеДанные;
	Если ТекДан=Неопределено Тогда Возврат;КонецЕсли;
	Запрос=Новый Структура("action,idSession,idLicense","licenseSessions",КодСеанса,ТекДан.idLicense);
	Ответ=ВыполнитьЗапрос(Запрос);
	Если Ответ.result=Ложь Тогда
		ПоказатьПредупреждение(,Ответ.comment);Возврат;
	КонецЕсли;
	Сеансы.Очистить();
	Для Каждого Стр Из Ответ.data Цикл
		Нов=Сеансы.Добавить();
		ЗаполнитьЗначенияСвойств(Нов,Стр);
	КонецЦикла;
	Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаСеансы;
	ЭтаФорма.Заголовок="Активные сеансы";
КонецПроцедуры

&НаКлиенте
Процедура СеансыПриАктивизацииСтроки(Элемент)
	ЕстьДанные=Элементы.Сеансы.ТекущиеДанные<>Неопределено;
	Элементы.ЗавершитьСеанс.Доступность=ЕстьДанные;
	Элементы.ОтладкуВключить.Доступность=ЕстьДанные;
	Элементы.ОтладкуВыключить.Доступность=ЕстьДанные;
КонецПроцедуры

&НаКлиенте
Процедура ОтладкуВключить(Команда)
	ТекДан=Элементы.Сеансы.ТекущиеДанные;
	Если ТекДан=Неопределено Тогда Возврат;КонецЕсли;
	Ответ=ВыполнитьЗапрос(Новый Структура("idSession,action,debug",ТекДан.idSession,"sessionDebug",1));
	Если Ответ.result=Истина Тогда
		ПоказатьПредупреждение(,"Отладка включена");
	Иначе
		ПоказатьПредупреждение(,"Ошибки при включении отладки: "+Ответ.comment);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтладкуВыключить(Команда)
	ТекДан=Элементы.Сеансы.ТекущиеДанные;
	Если ТекДан=Неопределено Тогда Возврат;КонецЕсли;
	Ответ=ВыполнитьЗапрос(Новый Структура("idSession,action,debug",ТекДан.idSession,"sessionDebug",0));
	Если Ответ.result=Истина Тогда
		ПоказатьПредупреждение(,"Отладка отключена");
	Иначе
		ПоказатьПредупреждение(,"Ошибки при отключении отладки: "+Ответ.comment);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьСеанс(Команда)
	ТекДан=Элементы.Сеансы.ТекущиеДанные;
	Если ТекДан=Неопределено Тогда Возврат;КонецЕсли;
	Оповещение=Новый ОписаниеОповещения("ЗавершениеСеанса",ЭтаФорма,ТекДан);
	ПоказатьВопрос(Оповещение,"Вы дествительно хотите завершить сеанс работы с модулем
	|"""+ТекДан.nameSoftware+""",
	|выполняемый пользователем """+ТекДан.userName+""",
	|начатый "+ТекДан.beginDate+",
	|последнее обращение к серверу: "+ТекДан.EndDate,
	РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеСеанса(Рез,ТекДан) Экспорт
	Если Рез=Неопределено или Рез=КодВозвратаДиалога.Нет Тогда Возврат;КонецЕсли;
	Запрос=Новый Структура("action,idSession","sessionClose",ТекДан.idSession);
	Ответ=ВыполнитьЗапрос(Запрос);
	Если Ответ.result=Ложь Тогда
		ПоказатьПредупреждение(,Ответ.comment);Возврат;
	КонецЕсли;
	Сеансы.Удалить(Сеансы.Индекс(ТекДан));
	Элементы.Лицензии.ТекущиеДанные.countSessions=Сеансы.Количество();
КонецПроцедуры	

&НаКлиенте
Процедура ВЛицензии(Команда)
	Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаЛицензий;
	ЭтаФорма.Заголовок="Активные лицензии";
КонецПроцедуры

&НаСервере
Функция ВыполнитьЗапрос(ПараметрыЗапроса)
	Попытка
		ТекстЗапроса="";
		Если ТипЗнч(ПараметрыЗапроса)=Тип("Структура") Тогда
			Для каждого Эл Из ПараметрыЗапроса Цикл
				Тип=ТипЗнч(Эл.Значение);
				Значение=?(Тип=Тип("Число"),Формат(Эл.Значение,"ЧГ=0;ЧН="),
				?(Тип<>Тип("Булево"), КодироватьСтроку(Строка(Эл.Значение), СпособКодированияСтроки.КодировкаURL), //КодироватьURL(Строка(Эл.Значение)),
				?(Эл.Значение=Истина,1,0)));
				ТекстЗапроса=ТекстЗапроса+"&"+Эл.Ключ+"="+Значение;
			КонецЦикла
		КонецЕсли;
		
		Соединение = Новый HTTPСоединение(Server);
		Заголовки = Новый Соответствие();
		Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
		Запрос = Новый HTTPЗапрос(urlAPI, Заголовки);
		Запрос.УстановитьТелоИзСтроки(ТекстЗапроса);		
		Ответ = Соединение.ОтправитьДляОбработки(Запрос);
		ОтветТекст = Ответ.ПолучитьТелоКакСтроку();
		Если Ответ.КодСостояния=200 Тогда
			Если лев(ОтветТекст,1)="<" Тогда
				Возврат Новый Структура("result,comment",Ложь,"Не выполнен запрос: "+символы.ПС+
				"получен ответ: "+Символы.ПС+ОтветТекст);
			КонецЕсли;
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ОтветТекст);
			Рез = ПрочитатьJSON(ЧтениеJSON, Ложь);
			Если ЗначениеЗаполнено(Рез) Тогда
				Возврат Рез;
			Иначе
				Возврат Новый Структура("result,comment",Ложь,"Не выполнен запрос: "+символы.ПС+
				"получен ответ: "+Символы.ПС+ОтветТекст);
			КонецЕсли;
		Иначе
			Возврат Новый Структура("result,comment",Ложь,"Ошибка подключения при авторизации, статус ответа =  "+Строка(Ответ.КодСостояния));
		КонецЕсли;
	Исключение
		Возврат Новый Структура("result,comment",Ложь,"Ошибка при подключении: "+ОписаниеОшибки());
	Конецпопытки; 
КонецФункции




