
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
	//Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КолФлНачало=0;
	Для каждого СтрТелоСценария Из ТелоСценария Цикл
		Если СтрТелоСценария.ФлНачалоСценария Тогда
			КолФлНачало=КолФлНачало+1;
		КонецЕсли;
		//Если СокрЛП(СтрТелоСценария.ИДСледующегоЭлементаКоммуникации)<>"" и Не СтрТелоСценария.Результат.Пустая() Тогда
		//	Сообщить("В строке "+Строка(СтрТелоСценария.НомерСтроки)+" одновременно указан ИД следующего элемента коммуникации и выбран результат! Необходимо задать либо то, либо другое.",СтатусСообщения.Важное);
		//	Отказ=Истина;
		Если СокрЛП(СтрТелоСценария.ИДСледующегоЭлементаКоммуникации)="" и СтрТелоСценария.Результат.Пустая() Тогда
		    Сообщить("В строке "+Строка(СтрТелоСценария.НомерСтроки)+" не указан ИД следующего элемента коммуникации и не выбран результат! Необходимо либо задать ИД следующего элемента, либо выбрать результат.",СтатусСообщения.Важное);
			Отказ=Истина;
		КонецЕсли; 
	КонецЦикла;
	Если Отказ=Истина Тогда
		Возврат;
	КонецЕсли;
	Если КолФлНачало=0 Тогда
		
		#Если Клиент Тогда
		
	    	Предупреждение("Не отмечена строка начала сценария!");
		
		#КонецЕсли
		
		Отказ=Истина;
		Возврат;
	ИначеЕсли КолФлНачало>1 Тогда
		
		#Если Клиент Тогда

		
	    	Предупреждение("Отмечено несколько строк начала сценария! Требуется отметить только одну.");
		#КонецЕсли
		
		Отказ=Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры 

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры
