Перем Док;
 
Процедура СформироватьЗаказыКлиентовСсайтаАБЦП() Экспорт;
 	ВыполнитьGETЗапросМодуль();
	ОбработатьФайлJSONМодуль();
КонецПроцедуры
 
Процедура ВыполнитьGETЗапросМодуль() Экспорт
   //==================== Это образец 
   //https://demo.public.api.abcp.ru/cp/orders?userlogin=username&userpsw=md5pass&dateUpdatedStart=2013-08-02 00:00:00&statusCode=56233
   //==================== 
   
   //ТекстДляЗапросаCRWL = "/api/rest/latest/get_ads/?api_key=771d2ceed16425ee413c01aee622d444&region=2451&last=24&source=auto.ru,trucks.auto.ru,am.ru,irr.ru,mail.ru,avito.ru,drom.ru,chance.ru,autonavigator.ru,avtobizon.ru,bibika.ru";
   
   //URL    = "id23632.public.api.abcp.ru";
   //Логин  = "api@id23632";
   //Пароль = "4ccaad1b07bb89c470bb9afde1001bf2";
   
    //СерверДляЗапросаABCP = "abcp.ru";
	
	Если обЗначениеНеЗаполнено(ПутьКфайлу) Тогда
		ПутьКфайлу = КаталогВременныхФайлов()+"CustomerOrdersFromABCP.json";	
 	КонецЕсли; 
	
	Если обЗначениеНеЗаполнено(СкладКомпании) Тогда
		СкладКомпании = Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000359");
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(ПериодОбработки.ДатаНачала) Тогда
		ПериодОбработки.ДатаНачала = НачалоДня(НачалоДня(ТекущаяДата())-86400); 
	КонецЕсли;
 	
	СерверДляЗапросаABCP = "id23632.public.api.abcp.ru";
	UserLogin = "api@id23632";
	UserPSW = "4ccaad1b07bb89c470bb9afde1001bf2"; 
	
	// =========================== Образец =========++++++++++============================
	// http://id23632.public.api.abcp.ru/cp/orders?userlogin=api@id23632&userpsw=4ccaad1b07bb89c470bb9afde1001bf2
	// =========================== окончание образца =====================================
	
	// СерверДляЗапросаABCP = "id23632.public.api.abcp.ru";
	// UserLogin = "popov_ie@sokolmotors.ru";
	// UserPSWold = "bmlcozwu";
	// Хеш = Новый ХешированиеДанных(ХешФункция.MD5);
	// Хеш.Добавить(UserPSWold);
	// UserPSW = Хеш.ХешСумма; 
	
	DateUpdatedStart1 = Формат(ПериодОбработки.ДатаНачала,"ДФ=yyyy-MM-dd"); //дата-день
 	DateUpdatedStart2 = Формат(ПериодОбработки.ДатаНачала,"ДЛФ=T");         //дата-время
	
	DateUpdatedStart = DateUpdatedStart1 +" 0"+DateUpdatedStart2;
	
	ТекстДляЗапросаABCP = "http://"+СерверДляЗапросаABCP+"/cp/orders?userlogin="+UserLogin+"&userpsw="+UserPSW;
	//ТекстДляЗапросаABCP = "/api/cp/orders/?userlogin="+UserLogin+"&userpsw="+UserPSW+"&dateUpdatedStart="+DateUpdatedStart;
	
	//Если обЗначениеНеЗаполнено(ПериодОбработки.ДатаОкончания) Тогда
	//	ТекстДляЗапросаABCP = ТекстДляЗапросаABCP+СокрЛП(КонецДня(ТекстДляЗапросаABCP));
	// КонецЕсли; 
		
	Соединение = Новый HTTPСоединение(СерверДляЗапросаABCP);     
	
	Запрос = Новый HTTPзапрос("/cp/orders?userlogin="+UserLogin+"&userpsw="+UserPSW);
	
	Если НЕ обЗначениеНеЗаполнено(ПериодОбработки.ДатаНачала) Тогда
		Запрос = Новый HTTPзапрос("/cp/orders?userlogin="+UserLogin+"&userpsw="+UserPSW+"&dateUpdatedStart="+DateUpdatedStart);
	 КонецЕсли; 

 
	Соединение.Получить(Запрос,ПутьКФайлу);      
	#Если Клиент Тогда
	Сообщить("Удачно выполнен GET запрос!");
	#КонецЕсли
  
КонецПроцедуры
            
Процедура  ОбработатьФайлJSONМодуль() Экспорт
	
	//СерверДляЗапросаCRWL = "crwl.ru";
	//ТекстДляЗапросаCRWL = "/api/rest/latest/get_ads/?api_key=771d2ceed16425ee413c01aee622d444&region=729&last=24&source=auto.ru,trucks.auto.ru,am.ru,irr.ru,mail.ru,avito.ru,drom.ru,chance.ru,autonavigator.ru,avtobizon.ru,bibika.ru";
	// Соединение = Новый HTTPСоединение(СерверДляЗапросаCRWL);     
	
	ФайлСтрокой = ПутьКФайлу;
	
	//Соединение.Получить(ТекстДляЗапросаCRWL, ФайлСтрокой);      
	#Если Клиент Тогда
	//	Сообщить("Удачно выполнен GET запрос!");
	#КонецЕсли
	
	Состав.Очистить();
	
	ЧтениеИзJSON(ПутьКФайлу);
	
	//Попытка
	//	УдалитьФайлы(ФайлСтрокой,"*.json");
	//Исключение
	//	#Если Клиент Тогда
	//		Сообщить(ОписаниеОшибки());
	//	#КонецЕсли
	//КонецПопытки;
   	
КонецПроцедуры

Процедура ЧтениеИзJSON(ИмяФайла) Экспорт
	
	Перем НовСтр;
	
	НомерЗаказаСайта = "";
	
 	ДокОбъект = Документы.ЗаказПокупателя.ПустаяСсылка();
	
	тЧтение = Новый ЧтениеJSON;
	//тЧтение.ОткрытьФайл("C:\test.json");
	тЧтение.ОткрытьФайл(ИмяФайла);
	Пока тЧтение.Прочитать() Цикл
		ОбработкаПрерыванияПользователя();
		Если Отладка Тогда
			#Если Клиент Тогда
			Сообщить("Тип текущего элемента " + тЧтение.ТипТекущегоЗначения);
			#КонецЕсли
		КонецЕсли; 
		Если тЧтение.ТипТекущегоЗначения = ТипЗначенияJSON.ИмяСвойства Тогда
			Имя  = тЧтение.ТекущееЗначение;
			Если Отладка Тогда
				#Если Клиент Тогда 
				Сообщить("Имя = " + Имя );
				#КонецЕсли
			КонецЕсли; 
		КонецЕсли;
		Если тЧтение.ТипТекущегоЗначения = ТипЗначенияJSON.Булево ИЛИ
			тЧтение.ТипТекущегоЗначения = ТипЗначенияJSON.Строка ИЛИ 
			тЧтение.ТипТекущегоЗначения = ТипЗначенияJSON.Число ИЛИ 
			тЧтение.ТипТекущегоЗначения = ТипЗначенияJSON.Комментарий Тогда
			ТекущееЗначение = тЧтение.ТекущееЗначение;
			Если Отладка Тогда
				#Если Клиент Тогда 
				Сообщить("Значение = " + ТекущееЗначение);
				#КонецЕсли
			КонецЕсли;
			
			Если Имя = "number" Тогда
				НомерЗаказаСайта = ТекущееЗначение;
			КонецЕсли;	
			
 			Если Имя = "internalNumber" Тогда
				
 				ДокОбъект = НайтиСоздатьЗаказПокупателя(НомерЗаказаСайта);
				
				Если НЕ обЗначениеНеЗаполнено(ДокОбъект) Тогда
					ДокОбъект.ДублиНоменклатурыДопустимы=Истина;
					ДокОбъект.Товары.Очистить();
					Попытка
						ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
 					Исключение
						//					
					КонецПопытки; 
  				КонецЕсли; 
 				
   			КонецЕсли;
			Если НЕ обЗначениеНеЗаполнено(ДокОбъект) Тогда
  				
				//Бондаренко++ 20180312
				Если Имя = "userId" Тогда
					НайденныйКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("UIDсайта",СокрЛП(ТекущееЗначение));
					
					//======================================================================================================
					Если НайденныйКонтрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
						//Созданим Контрагента, которого нет
						НайденныйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
						НайденныйКонтрагент.УстановитьНовыйКод();
						НайденныйКонтрагент.Наименование = "Новый контрагент "+СокрЛП(ТекущееЗначение);
						НайденныйКонтрагент.НаименованиеПолное = "Новый контрагент "+СокрЛП(ТекущееЗначение);
						НайденныйКонтрагент.GUIDСайта = СокрЛП(ТекущееЗначение);
						НайденныйКонтрагент.Автор = ПараметрыСеанса.Пользователь;
						НайденныйКонтрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель; 
						НайденныйКонтрагент.ВидОтношений = Справочники.ВидыВзаимоотношений.ПустаяСсылка();
						НайденныйКонтрагент.ФормаСобственности = Перечисления.ФормыСобственности.Прочее;
						НайденныйКонтрагент.ДатаРождения = НачалоГода(ТекущаяДата());
						НайденныйКонтрагент.ОсновнойТелефон = "+7, 1111111111";
 						НайденныйКонтрагент.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да;
						НайденныйКонтрагент.СогласиеНаОбработкуПерсональныхДанныхДата = ТекущаяДата();
						НайденныйКонтрагент.Комментарий = "Создан автоматически "+Формат(Текущаядата(),"ДЛФ=DDT")+" пользователем "+ПараметрыСеанса.Пользователь;
                        НайденныйКонтрагент.ДатаРегистрации = ТекущаяДата();
 						НайденныйКонтрагент.РекламныйИсточник = Справочники.ИсточникиИнформации.ОбщениеСМОПВИнтернет;
						НайденныйКонтрагент.Родитель=Справочники.Контрагенты.Оптовики;
  						Попытка
							НайденныйКонтрагент.Записать();
						Исключение
							#Если Клиент Тогда 
							Сообщить("ОШИБКА! Не удалось записать нового контрагента с UID сайта: "+СокрЛП(ТекущееЗначение));
							#КонецЕсли
							Продолжить;
						КонецПопытки;
						НайденныйКонтрагент = НайденныйКонтрагент.Ссылка;
					КонецЕсли;					
					//======================================================================================================
					
					Если НЕ обЗначениеНеЗаполнено(НайденныйКонтрагент) Тогда
	 						ДокОбъект.Контрагент = НайденныйКонтрагент; 
							ДокОбъект.Заказчик = НайденныйКонтрагент; 
 							ДокОбъект.ДоговорВзаиморасчетов = НайтиСоздатьДоговор(ДокОбъект.Контрагент,СкладКомпании.Подразделение.Организация,СкладКомпании.Подразделение);
						Иначе
							#Если Клиент Тогда 
							Сообщить("ОШИБКА! Не найден контрагент с "+СокрЛП(ТекущееЗначение),СтатусСообщения.ОченьВажное);
							#КонецЕсли
							Прервать;
						КонецЕсли; 
   				КонецЕсли;
				
				Если Имя = "date" Тогда
 						СтроковаяДата = СтрЗаменить(ТекущееЗначение,"-","");
						СтроковаяДата = СтрЗаменить(СтроковаяДата,":","");
						СтроковаяДата = СтрЗаменить(СтроковаяДата," ","");
						ДокОбъект.Дата = Дата(СтроковаяДата);
						ДокОбъект.Записать();
  				КонецЕсли;
				
				Если Имя = "numberFix" Тогда
					НайтиНоменклатуру = Справочники.Номенклатура.НайтиПоРеквизиту("АртикулАЦ",СокрЛП(ТекущееЗначение));
					//======================================================================================================
 					Если НайтиНоменклатуру=Справочники.Номенклатура.ПустаяСсылка() тогда
 						//Созданим Номенклатуру которой нет
						НайтиНоменклатуру = Справочники.Номенклатура.СоздатьЭлемент();
						НайтиНоменклатуру.УстановитьНовыйКод();
  						НайтиНоменклатуру.Производитель = Справочники.Производители.Неизвестен;
						НайтиНоменклатуру.Родитель = Справочники.Номенклатура.Загруженно;
						НайтиНоменклатуру.Наименование = "Новый товар";
						НайтиНоменклатуру.НаименованиеПолное = "Новый товар";
 						НайтиНоменклатуру.НаименованиеИностранное = "Новый товар";
						НайтиНоменклатуру.Артикул = СокрЛП(ТекущееЗначение);
						НайтиНоменклатуру.АртикулАЦ = СокрЛП(ТекущееЗначение);
						НайтиНоменклатуру.АртикулДляПоиска = СокрЛП(ТекущееЗначение);
						НайтиНоменклатуру.ТипНоменклатуры = Справочники.ТипыНоменклатуры.Штучный;
						НайтиНоменклатуру.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар;
						НайтиНоменклатуру.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.шт;
						НайтиНоменклатуру.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
						НайтиНоменклатуру.ВалютаУчета = Справочники.Валюты.НайтиПоКоду("643");
						Попытка
							НайтиНоменклатуру.Записать();
						Исключение
							//Сообщить(стр);
							Продолжить;
						КонецПопытки;
 						НайтиНоменклатуру = НайтиНоменклатуру.Ссылка.ПолучитьОбъект();
						НайтиНоменклатуру.ОсновнаяЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию("шт");
						Попытка
							НайтиНоменклатуру.Записать();
						Исключение
							//Сообщить(стр);
							Продолжить;
						КонецПопытки;
						НайтиНоменклатуру = НайтиНоменклатуру.Ссылка;
					КонецЕсли;					
					//======================================================================================================
					Если НЕ обЗначениеНеЗаполнено(НайтиНоменклатуру) Тогда
 						НовСтр.Номенклатура = НайтиНоменклатуру;  
 						НовСтр.Количество = 1;
						НовСтр.ЕдиницаИзмерения = НовСтр.Номенклатура.ОсновнаяЕдиницаИзмерения;
						НовСтр.Коэффициент = НовСтр.ЕдиницаИзмерения.Коэффициент;
	 					НовСтр.Сумма = НовСтр.Цена*НовСтр.Количество*НовСтр.Коэффициент;
						НовСтр.СуммаВсего = НовСтр.Сумма;
						НовСтр.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
						НовСтр.СуммаНДС = НовСтр.СуммаВсего*НовСтр.СтавкаНДС.Ставка/(100+НовСтр.СтавкаНДС.Ставка);
						ДокОбъект.Записать();
					Иначе
						#Если Клиент Тогда 
					    Сообщить("ОШИБКА! Не найдена номенклатура с артикулом "+СокрЛП(ТекущееЗначение),СтатусСообщения.ОченьВажное);
						#КонецЕсли
						Прервать;
 					КонецЕсли; 
  				КонецЕсли;
 				
				Если Имя = "quantityFinal" Тогда
					Попытка
						НовСтр.Количество = Число(СокрЛП(ТекущееЗначение));
						ДокОбъект.Записать();
 					Исключение
						//					
					КонецПопытки; 
					Если Состав.Количество() = 0  Тогда
						ТекЗаказ = Документы.ЗаказПокупателя.ПустаяСсылка();
 					Иначе
 						ТекЗаказ = Состав[Состав.Количество()-1].ЗаказПокупателя;	
	 				КонецЕсли; 
					Если ДокОбъект.Ссылка <> ТекЗаказ Тогда
	 				    СтрокаТЧ = Состав.Добавить();
					    СтрокаТЧ.ЗаказПокупателя = ДокОбъект.Ссылка;
					КонецЕсли; 		 
      			КонецЕсли;
				
				Если Имя = "priceInSiteCurrency" Тогда
					НовСтр = ДокОбъект.Товары.Добавить();
		 			НовСтр.Цена = Число(СокрЛП(ТекущееЗначение));
 					НовСтр.Сумма = НовСтр.Цена*НовСтр.Количество*НовСтр.Коэффициент;
					НовСтр.СуммаВсего = НовСтр.Сумма;
					НовСтр.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
					НовСтр.СуммаНДС = НовСтр.СуммаВсего*НовСтр.СтавкаНДС.Ставка/(100+НовСтр.СтавкаНДС.Ставка);
					//ДокОбъект.Записать();
  				КонецЕсли;
				
  			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	//Попытка
	//	ДокОбъект.Записать();
	//	Попытка
	//		Сообщить("Записан документ "+ДокОбъект);
	// 	Исключение
	//		//		
	//	КонецПопытки; 
	// 	 
	// Исключение
	//	//
	//КонецПопытки; 
	 	
	тЧтение.Закрыть(); 	   
	
КонецПроцедуры

Функция НайтиСоздатьЗаказПокупателя(Идент)
 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Комментарий,
		|	ЗаказПокупателя.Ссылка,
		|	ЗаказПокупателя.Дата,
		|	ЗаказПокупателя.ПометкаУдаления,
		|	ЗаказПокупателя.UIDсайта
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.ПометкаУдаления = ЛОЖЬ
		|	И ЗаказПокупателя.UIDсайта = &Идент";
	
 	Запрос.УстановитьПараметр("Идент",Идент);
	//Запрос.УстановитьПараметр("ДатаНач",НачалоДня(ПериодОбработки.ДатаНачала   ));
	//Запрос.УстановитьПараметр("ДатаКон", КонецДня(ПериодОбработки.ДатаОкончания));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		#Если Клиент Тогда 
		Сообщить("Найден документ "+ВыборкаДетальныеЗаписи.Ссылка+" c UIDсайта = "+Идент);
		#КонецЕсли
		Возврат ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	КонецЦикла;
	
	НовДок = Документы.ЗаказПокупателя.СоздатьДокумент();
	
	НовДок.UIDсайта = Идент;
	
	НовДок.Дата = ТекущаяДата();
	НовДок.Автор = ПараметрыСеанса.Пользователь;
	НовДок.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций;
	НовДок.КурсДокумента = 1.0;
	НовДок.КурсВалютыУпр = 1.0;
	НовДок.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	НовДок.ДатаСоздания = ТекущаяДата();
	НовДок.Комментарий = Идент+" ,Создан обработкой пользователем: "+ПараметрыСеанса.Пользователь+" "+Формат(ТекущаяДата(),"ДЛФ=DDT");
	НовДок.Контрагент=Справочники.Контрагенты.ОсновнойПокупатель;
	
	НовДок.ДоговорВзаиморасчетов=НайтиСоздатьДоговор(Справочники.Контрагенты.ОсновнойПокупатель,СкладКомпании.Подразделение.Организация,СкладКомпании.Подразделение);
	
	НовДок.ТипЗаказа=Справочники.ТипыЗаказов.КлиентскийЗаказ;
	НовДок.Заказчик=Справочники.Контрагенты.ОсновнойПокупатель;
	НовДок.ТипЦен=Справочники.ТипыЦен.ОптоваяЦена;
	НовДок.ХозОперация=Справочники.ХозОперации.ЗаказПокупателя;
	НовДок.СрокПоставки=ТекущаяДата()+5*24*3600;
	НовДок.ВидОплаты=Перечисления.ВидыОплаты.БезналичныйРасчет;
	НовДок.СкладКомпании=СкладКомпании;
 		
 	НовДок.ПодразделениеКомпании = СкладКомпании.Подразделение;
	НовДок.Организация = СкладКомпании.Подразделение.Организация;
	НовДок.Менеджер = ПараметрыСеанса.Пользователь.Сотрудник;
  	НовДок.Комментарий = СокрЛП(Идент);
	
	 // Попытка
	 //   НовДок.Записать();
	 //	Сообщить("Записан новый документ "+НовДок);
	 //Исключение
	 //	Сообщить("ОШИБКА! Не удалось записать новый документ ЗаказПокупателя с UIDсайта = "+Идент,СтатусСообщения.ОченьВажное);	
	 //	НовДок = Документы.ЗаказПокупателя.ПустаяСсылка();
	 //КонецПопытки; 
	
	Возврат НовДок;
 
КонецФункции // НайтиСоздатьЗаказПокупателя()

Функция НайтиСоздатьДоговор(ТекКонтрагент,ТекОрганизация,ТекПодразделение)
	
	НовДог = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыВзаиморасчетов.Ссылка,
	               |	ДоговорыВзаиморасчетов.Владелец,
	               |	ДоговорыВзаиморасчетов.Организация,
	               |	ДоговорыВзаиморасчетов.ВидДоговора
	               |ИЗ
	               |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	               |ГДЕ
	               |	ДоговорыВзаиморасчетов.Владелец = &Владелец
	               |	И ДоговорыВзаиморасчетов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.Продажа)
	               |	И ДоговорыВзаиморасчетов.Организация = &Организация";
	 
	Запрос.УстановитьПараметр("Владелец",ТекКонтрагент);
 	Запрос.УстановитьПараметр("Организация",ТекОрганизация);
 	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	НовДог = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
	НовДог.УстановитьНовыйКод();
	НовДог.ВидДоговора=Перечисления.ВидыДоговоров.Продажа;
	НовДог.Владелец = ТекКонтрагент;
	НовДог.Организация = ТекОрганизация;
	НовДог.Подразделение = ТекПодразделение;
	НовДог.Владелец = ТекКонтрагент;
	НовДог.ДатаНачала = ТекущаяДата();
 	НовДог.Наименование = СокрЛП(НовДог.ВидДоговора)+" от "+Формат(НовДог.ДатаНачала,"ДЛФ=D"); 
	НовДог.Автор = ПараметрыСеанса.Пользователь;
	НовДог.ДатаСоздания = ТекущаяДата();
	НовДог.ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
	НовДог.Комментарий = "Договор создан обработкой пользователем: "+ПараметрыСеанса.Пользователь+" "+Формат(ТекущаяДата(),"ДЛФ=DDT");
	НовДог.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	
	Попытка
		НовДог.Записать();
		#Если Клиент Тогда 
		Сообщить("Записан новый договор "+НовДог);
		#КонецЕсли
	Исключение
		#Если Клиент Тогда 
		Сообщить("ОШИБКА! Не удалось записать новый договор ЗаказПокупателя ",СтатусСообщения.ОченьВажное);	
		#КонецЕсли
	  //Форма = НовДог.ПолучитьФорму("ФормаЭлемента");
	  //Если Не Форма.Открыта() Тогда
	  //      Форма.Открыть();
	  //КонецЕсли; 
  	КонецПопытки; 
	
	Возврат НовДог.Ссылка;

КонецФункции // НайтиСоздатьДоговор(Справочники.Контрагенты.ОсновнойПокупатель,ПараметрыСеанса.ПодразделениеКомпании.Организация);()

Функция НайтиПравильноеПодразделение(Орг,Подр)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияКомпании.Ссылка,
		|	ПодразделенияКомпании.Организация,
		|	ПодразделенияКомпании.Родитель
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|ГДЕ
		|	ПодразделенияКомпании.Родитель = &Родитель
		|	И ПодразделенияКомпании.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Родитель", Подр);
	Запрос.УстановитьПараметр("Организация", Орг);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Подр
 
КонецФункции // НайтиПравильноеПодразделение()
 
 


