&НаКлиенте
Процедура СоздатьОткрытьЗаявкуНаСогласование(Команда)
	
	Записать();
	Форма = ПолучитьФорму("Задача.DMS_ЗаявкаНаСогласование.ФормаОбъекта");
	ДанныеФормы = Форма.Объект; // Получаем объект формы в переменную
	ЗаполнитьДокументНаСервере(ДанныеФормы,Объект.Ссылка); // Заполняем документ на сервере
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект); // копируем наш объект в объект формы и далее открываем ее
	Форма.Открыть();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьДокументНаСервере(ДанныеФормы,Договор);

	//Заявка = ДанныеФормыВЗначение(ДанныеФормы, Тип("ЗадачаОбъект.DMS_ЗаявкаНаСогласование")); // Получаем объект из данных формы ИЛИ
	Заявка = Задачи.DMS_ЗаявкаНаСогласование.СоздатьЗадачу();
	Заявка.Заполнить(Договор);
	ЗначениеВДанныеФормы(Заявка,ДанныеФормы); // Кладем обратно в объект формы уже созданный документ

КонецФункции