/////////////////////////////////////////////////////////////////////////////События формы//////////////////////////////////////////////////////////////
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Массив=Новый Массив;
	Массив.Добавить(Элементы.ДекорацияДилерскийЦентр);
	Renault_ОбщиеФункции.МультибрендЗадатьОформление(Массив,"Картинка","Логотип_mini");

	Если ЗначениеЗаполнено(Объект.Автор) Тогда
		Элементы.Автор.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПериодаПриИзменении(Элемент)
	
	Объект.Период = ПолучитьЗначениеПериода(ТекущаяДата());
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Объект.Период = ПолучитьЗначениеПериода(Объект.Период);
	
КонецПроцедуры

&НаКлиенте
Процедура ДилерскийЦентрПриИзменении(Элемент)
	
	Объект.ДанныеПоОтделам.Очистить();
	Объект.ДанныеПоМенеджерам.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоМенеджерамМенеджерПриИзменении(Элемент)
	
	Строка = Элементы.ДанныеПоМенеджерам.ТекущиеДанные;
	
	Отбор = Новый Структура("Менеджер", Строка.Менеджер);
	Строки = Объект.ДанныеПоМенеджерам.НайтиСтроки(Отбор);
	
	Если Строки.Количество() > 1 Тогда
		Сообщить("Такой менеджер уже есть в табличной части!");
		
		Строка.Менеджер = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
	Иначе
		Строка.Отдел = ПолучитьОтделМенеджера(Строка.Менеджер);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоОтделамОтделПриИзменении(Элемент)
	
	Строка = Элементы.ДанныеПоОтделам.ТекущиеДанные;
	
	Отбор = Новый Структура("Отдел", Строка.Отдел); 
	Строки = Объект.ДанныеПоОтделам.НайтиСтроки(Отбор);
	
	Если Строки.Количество() > 1 Тогда
		Сообщить("Такой отдел уже есть в табличной части!");
		Строка.Отдел = ПредопределенноеЗначение("Справочник.CRM_Отделы.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоОтделамОтделНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДилерскийЦентр = Объект.ДилерскийЦентр;
	
	Если ЗначениеЗаполнено(ДилерскийЦентр) Тогда
		СтандартнаяОбработка = Ложь;
		ФормаВыбора = Справочники.CRM_Отделы.ПолучитьФормуВыбора(, Элемент);
		ФормаВыбора.Отбор.ДилерскийЦентр.ВидСравнения = ВидСравнения.Равно;
		ФормаВыбора.Отбор.ДилерскийЦентр.Значение = ДилерскийЦентр;
		ФормаВыбора.Отбор.ДилерскийЦентр.Использование = Истина;
		ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.ДилерскийЦентр.Доступность = Ложь;
		ФормаВыбора.Открыть();
	КонецЕсли;
	
КонецПроцедуры
////////////////////////////////////////////////////////////////////////////Команды формы////////////////////////////////////////////////////////////////
&НаКлиенте
Процедура ЗаполнитьОтделы(Команда)
	
	ДилерскийЦентр = Объект.ДилерскийЦентр;
	
	Если ЗначениеЗаполнено(ДилерскийЦентр) Тогда
		Отделы = ПолучитьОтделы(ДилерскийЦентр);
		
		ТаблицаДанныеПоОтделам = Объект.ДанныеПоОтделам;
		ТаблицаДанныеПоОтделам.Очистить();
		
		Для Каждого Отдел Из Отделы Цикл
			Строка = ТаблицаДанныеПоОтделам.Добавить();
			Строка.Отдел = Отдел;
		КонецЦикла;
	Иначе
		Сообщить("Не заполнено поле ""Дилерский центр""!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМенеджеров(Команда)
	
	ЗаполнитьТаблицуСМенеджерами(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсеСтрокиМенеджеры(Команда)
	
	ЗаполнитьВсеСтрокиНайстройкой(ОбщаяНастройкаПланированияМенеджеры, "ДанныеПоМенеджерам");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсеСтрокиОтделы(Команда)
	
	ЗаполнитьВсеСтрокиНайстройкой(ОбщаяНастройкаПланированияОтделы, "ДанныеПоОтделам");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМенеджеровИзДанныхПоОтделам(Команда)
	
	ЗаполнитьТаблицуСМенеджерами(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПланПродажАвтосервиса(Команда)
	
	Отбор = Новый Структура("Регистратор", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("РегистрСведений.Renault_ПланПродажАвтосервиса.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры
////////////////////////////////////////////////////////////////////////////Различные процедуры и функции////////////////////////////////////////////////
&НаКлиенте
Процедура ЗаполнитьВсеСтрокиНайстройкой(Настройка, ИмяТабличнойЧасти)
	
	Если ЗначениеЗаполнено(Настройка) Тогда
		ТаблицаДанных = Объект[ИмяТабличнойЧасти];
		Для Каждого Строка Из ТаблицаДанных Цикл
			Строка.НастройкаПланирования = Настройка;
		КонецЦикла;
	Иначе
		Сообщить("Не заполнено поле ""Общая настройка планирования""!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
функция ПолучитьЗначениеПериода(ДатаПериода)
	
	ВидПериода = Объект.ВидПериода;
	ЗначениеПериода = '0001-01-01';
	
	Если ВидПериода = ПредопределенноеЗначение("Перечисление.Renault_ТипыПериода.Неделя") Тогда 
		ЗначениеПериода = НачалоНедели(ДатаПериода);
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.Renault_ТипыПериода.Месяц") Тогда
		ЗначениеПериода = НачалоМесяца(ДатаПериода);
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.Renault_ТипыПериода.Квартал") Тогда
		ЗначениеПериода = НачалоКвартала(ДатаПериода);
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.Renault_ТипыПериода.Год") Тогда
		ЗначениеПериода = НачалоГода(ДатаПериода);  
	КонецЕсли;
	
	Возврат ЗначениеПериода;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОтделы(ДилерскийЦентр)
	
	Отделы = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CRM_Отделы.Ссылка КАК Отдел
		|ИЗ
		|	Справочник.CRM_Отделы КАК CRM_Отделы
		|ГДЕ
		|	НЕ CRM_Отделы.ПометкаУдаления
		|	И CRM_Отделы.ДилерскийЦентр = &ДилерскийЦентр";
	Запрос.УстановитьПараметр("ДилерскийЦентр", ДилерскийЦентр);
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Отделы.Добавить(Выборка.Отдел);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Отделы;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТаблицуСМенеджерами(ЗаполнятьПоОтделам)
	
	Перем ДилерскийЦентр, Отделы;
	
	Если ЗаполнятьПоОтделам Тогда
		Отделы = Новый Массив;
		
		ТаблицаДанныеПоОтделам = Объект.ДанныеПоОтделам;
		
		Для Каждого Строка Из ТаблицаДанныеПоОтделам Цикл
			Отделы.Добавить(Строка.Отдел);
		КонецЦикла;
		
		Если Отделы.Количество() = 0 Тогда
			Сообщить("В табличной части ""Данные по отделам"", нет данных!");
			Возврат;
		КонецЕсли;
	Иначе
		ДилерскийЦентр = Объект.ДилерскийЦентр;
		
		Если НЕ ЗначениеЗаполнено(ДилерскийЦентр) Тогда
			Сообщить("Не заполнено поле ""Дилерский центр""!");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ОтделыИМенеджеры = ПолучитьОтделыИМенеджеров(ДилерскийЦентр, Отделы);
	
	ТаблицаДанныеПоМенеджерам = Объект.ДанныеПоМенеджерам;
	ТаблицаДанныеПоМенеджерам.Очистить();
	
	Для Каждого ОтделИМенеджер Из ОтделыИМенеджеры Цикл
		Строка = ТаблицаДанныеПоМенеджерам.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, ОтделИМенеджер);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОтделыИМенеджеров(ДилерскийЦентр, Отделы)
	
	ОтделыИМенеджеры = Новый Массив;
	
	Запрос = Новый Запрос;
	Если Отделы <> Неопределено Тогда
		Запрос.УстановитьПараметр("Отделы", Отделы);
		ДопУсловие = " И Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.Отдел В (&Отделы)";
	Иначе
		ДопУсловие = "";
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь.Сотрудник КАК Сотрудник,
		|	МАКСИМУМ(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.Отдел) КАК Отдел
		|ИЗ
		|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(&ДилерскийЦентр) = ТИП(Справочник.CRM_ДилерскиеЦентры)
		|				ТОГДА Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ДилерскийЦентр = &ДилерскийЦентр
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ" + ДопУсловие + "
		|
		|СГРУППИРОВАТЬ ПО
		|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь.Сотрудник";
	Запрос.УстановитьПараметр("ДилерскийЦентр", ДилерскийЦентр);
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ОтделИМенеджер = Новый Структура("Отдел, Менеджер", Выборка.Отдел, Выборка.Сотрудник);
			ОтделыИМенеджеры.Добавить(ОтделИМенеджер);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ОтделыИМенеджеры;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОтделМенеджера(Менеджер)
	
	Отдел = Справочники.CRM_Отделы.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(Менеджер) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.Отдел КАК Отдел
			|ИЗ
			|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
			|ГДЕ
			|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь.Сотрудник = &Менеджер";
		Запрос.УстановитьПараметр("Менеджер", Менеджер);
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			Отдел = Выборка.Отдел;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Отдел;
	
КонецФункции





