
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не Копирование Тогда
		Отказ = Истина;
		//@++Васильев ВА
		Форма = ПолучитьФорму("Справочник.Renault_КорпоративныеКлиенты.Форма.Renault_ФормаКорпоративногоКлиента");
		Форма.СправочникОбъект = Справочники.Контрагенты.СоздатьЭлемент(); 
		Форма.Открыть();
		//@++		
	КонецЕсли;
	
КонецПроцедуры
