
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда 
		Объект.ДилерскийЦентр=ПараметрыСеанса.Renault_ПраваПользователя.ДилерскийЦентр;
	КонецЕсли;
	
	Если Параметры.Свойство("Клиент") Тогда 
		Объект.ФизическоеЛицо = Параметры.Клиент;
	КонецЕсли;		
	
	//ОбновитьДанныеПоКлиенту = Истина;
	
	//контакты
	Эл=КонтактнаяИнформация.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	Эл.Использование=Истина;
	Эл.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	Эл.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Объект");
	Эл.ПравоеЗначение=Объект.ФизическоеЛицо;
	
	//тачки
	Эл=Автомобили.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	Эл.Использование=Истина;
	Эл.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	Эл.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Значение");
	Эл.ПравоеЗначение=Объект.ФизическоеЛицо;
	
	//сканы
	Эл=СканыДокументов.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	Эл.Использование=Истина;
	Эл.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	Эл.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Объект");
	Эл.ПравоеЗначение=Объект.ФизическоеЛицо;
	
	Если НЕ Объект.Ссылка.Пустая() Тогда 
		ОбновитьДанныеПоКлиенту = Истина; //Сергеев В. Н. DMSREN-1020
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ПрочитатьДанные());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ОбновитьДанныеПоКлиенту Тогда 
		Перезаполнить("");	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		ЗаполнитьСогласияИОтображениеСогласий();
	КонецЕсли;
	
	ОбновитьДоступностьПечати();
КонецПроцедуры

&НаКлиенте
Процедура Перезаполнить(Элемент)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма,ПрочитатьДанные());
	
	ЗаполнитьСогласияИОтображениеСогласий();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСогласияИОтображениеСогласий()
	
	Если ТипЗнч(Объект.ФизическоеЛицо) = Тип("СправочникСсылка.Контрагенты") Тогда 
		//Элементы.ГруппаКоммуникация.Видимость = Истина;
		//Элементы.ГруппаОПД.Видимость = Истина;
		Элементы.ГруппаСервисы.Видимость = Истина;
		
		Если Объект.СогласиеНаКоммуникацию <> Объект.ФизическоеЛицо.СогласиеНаПолучениеSMS или
			Объект.СогласиеНаОбработкуПерсональныхДанных <> Объект.ФизическоеЛицо.СогласиеНаОбработкуПерсональныхДанных Тогда 
			ЭтаФорма.Модифицированность = Истина;
			Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
				ПоказатьПредупреждение(,"Данные в документе по согласию были изменены по карточке контрагента");
			КонецЕсли;
		КонецЕсли;
		
		Объект.СогласиеНаОбработкуПерсональныхДанных = Объект.ФизическоеЛицо.СогласиеНаОбработкуПерсональныхДанных;
		Объект.СогласиеНаКоммуникацию = Объект.ФизическоеЛицо.СогласиеНаПолучениеSMS;
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
			Объект.СогласиеНаПодключаемыеСервисы = Ложь;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Объект.ФизическоеЛицо) = Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты") Тогда
		Элементы.ГруппаСервисы.Видимость = Ложь;
		
		Если Объект.СогласиеНаКоммуникацию <> Объект.ФизическоеЛицо.СогласенНаКоммуникацию или
			Объект.СогласиеНаОбработкуПерсональныхДанных <> Объект.ФизическоеЛицо.СогласиеНаОбработкуПерсональныхДанных Тогда 
			ЭтаФорма.Модифицированность = Истина;
			Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
				ПоказатьПредупреждение(,"Данные в документе по согласию были изменены по карточке клиента");
			КонецЕсли;		
		КонецЕсли;
		
		Объект.СогласиеНаОбработкуПерсональныхДанных = Объект.ФизическоеЛицо.СогласиеНаОбработкуПерсональныхДанных;
		Объект.СогласиеНаКоммуникацию = Объект.ФизическоеЛицо.СогласенНаКоммуникацию;
		Объект.СогласиеНаПодключаемыеСервисы = Ложь;
	КонецЕсли;

КонецПроцедуры

Функция ПрочитатьДанные()
	
	Возврат Документы.DMS_СогласиеНаОбработкуПерсональныхДанных.ПрочитатьДанные(Объект);
	
КонецФункции

&НаКлиенте
Процедура кнОбновитьДанныеКлиента(Команда)
	
	Перезаполнить("");
	
КонецПроцедуры

//#Область Печать
&НаКлиенте
Процедура кнПечать(Команда)
	
	Макет=Печать();
	Если Макет=Ложь Тогда Возврат КонецЕсли;
	Форма=ПолучитьФорму("ОбщаяФорма.ПечатнаяФормаДокументов",,УникальныйИдентификатор);
	Форма.Объект=Объект.Ссылка;
	Форма.ЭлементыФормы.ТабличныйДокумент.Вывести(Макет);
	Форма.ИзменятьСпособОтображенияОкна=ИзменениеСпособаОтображенияОкна.Разрешить;
	Форма.Открыть();
	
КонецПроцедуры

Функция Печать()
	
	Возврат Документы.DMS_СогласиеНаОбработкуПерсональныхДанных.Печать(Объект.Ссылка);
	
КонецФункции

&НаКлиенте
Процедура кнПечатьСкана(Команда)
	
	ИмяФайла = "";
	Если ПолучитьСкан(ИмяФайла) Тогда
		ЗапуститьПриложение(ИмяФайла);
	Иначе
		Предупреждение("Необходимо провести документ!");
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСкан(ИмяФайла)
	
	Если НЕ Объект.Проведен Тогда Возврат Ложь КонецЕсли;
	ИмяФайла = ПолучитьИмяВременногоФайла(Объект.ТипФайла);
	Если АдресСкана <> "" Тогда
		ПолучитьИзВременногоХранилища(АдресСкана).Записать(ИмяФайла);
	Иначе
		Объект.Ссылка.ПолучитьОбъект().СканКопия.Получить().Записать(ИмяФайла);
	КонецЕсли;
	Возврат Истина;
	
КонецФункции
//#КонецОбласти

//#Область ЗагрузитьФайл
&НаКлиенте
Процедура кнПрикрепитьСкан(Команда)
	
	#Если ВебКлиент Тогда
	Если не ПодключитьРасширениеРаботыСФайлами() Тогда  //если подключить не удалось - требуется установить его (в первый раз)
		УстановитьРасширениеРаботыСФайлами();
		//если не удалось установить - то повторный вызов подключения будет неудачный
		Если не ПодключитьРасширениеРаботыСФайлами() Тогда
			ВызватьИсключение "Ошибка. Ваш браузер не поддерживает работу с файлами :(";
		КонецЕсли;
	КонецЕсли;
	#КонецЕсли
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ОбработкаВыборФайла",ЭтотОбъект),,,Истина,УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыборФайла(Результат,Адрес,ВыбранноеИмяФайла,ДопПараметры) Экспорт 
	
	Если Результат Тогда 
		АдресСкана=Адрес;
		Файл=Новый Файл(ВыбранноеИмяФайла); Объект.ТипФайла=Сред(Файл.Расширение,2); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	
	//Если ПустаяСтрока(АдресСкана) Тогда
	//	Отказ=Истина;
	//	Сообщить("Не приложен скан соглашения", СтатусСообщения.Внимание);
	//	Возврат
	//КонецЕсли;
	//            
	//Если ЭтоАдресВременногоХранилища(АдресСкана) Тогда
	//	ТекущийОбъект.СканКопия=Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресСкана));
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ=Истина;
	ОткрытьФорму("Справочник.КонтактныеЛица.ФормаОбъекта",Новый Структура("Ключ",Объект.ФизическоеЛицо),ЭтаФорма,УникальныйИдентификатор,,,);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСогласияНаОПДИКоммуникации(Команда)
	
	Если Не Объект.Проведен Тогда 
		Сообщить("Необходимо провести документ");
		Возврат;	
	КонецЕсли;
	
	Если ТипЗнч(Объект.ФизическоеЛицо) = Тип("СправочникСсылка.Контрагенты") Тогда 
		ПечатьОПДДляКонтрагента("ПерсональныеДанные",Истина);
	Иначе
		ПечатьОПДДляПотеницальногоКонтрагента("ПерсональныеДанные",Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПечатьОПДДляКонтрагента(ВидСогласия,Согласие)
	Ошибка = Ложь;
	Попытка
		СтруктураПараметровОПД = ЗаполнитьДанныеПоКонтрагенту(ВидСогласия,Согласие);
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	МассивФайловОПД = DMS_ОбщегоНазначенияСервер.ПолучитьДанныеОПД(СтруктураПараметровОПД,Объект.ФизическоеЛицо);
	
	Если МассивФайловОПД = Неопределено Тогда 
		ПоказатьПредупреждение(,"Не удалось получить печатную форму");
	Иначе 
		Для каждого Файл Из МассивФайловОПД Цикл
			НачатьПолучениеФайлаССервера(ПоместитьВоВременноеХранилище(Base64Значение(Файл["ДанныеФайла"])), Файл["ИмяФайла"], Новый ПараметрыДиалогаПолученияФайлов());
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьОПДДляПотеницальногоКонтрагента(ВидСогласия,Согласие)
	Ошибка = Ложь;
	
	СтруктураПараметровОПД = ЗаполнитьДанныеПоПотенциальномуКлиенту(ВидСогласия,Согласие);
	
	МассивФайловОПД = DMS_ОбщегоНазначенияСервер.ПолучитьДанныеОПД(СтруктураПараметровОПД,Объект.ФизическоеЛицо);
	
	Если МассивФайловОПД = Неопределено Тогда 
		ПоказатьПредупреждение(,"Не удалось получить печатную форму");
	Иначе 
		Для каждого Файл Из МассивФайловОПД Цикл
			НачатьПолучениеФайлаССервера(ПоместитьВоВременноеХранилище(Base64Значение(Файл["ДанныеФайла"])), Файл["ИмяФайла"], Новый ПараметрыДиалогаПолученияФайлов());
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьОПДДляПотенциальногоКонтрагента()
	Ошибка = Ложь;
	Попытка
		СтруктураПараметровОПД = ЗаполнитьДанныеПоПотенциальномуКлиенту("ПерсональныеДанные",Истина);
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	МассивФайловОПД = DMS_ОбщегоНазначенияСервер.ПолучитьДанныеОПД(СтруктураПараметровОПД,Объект.ФизическоеЛицо);
	
	Если МассивФайловОПД = Неопределено Тогда 
		ПоказатьПредупреждение(,"Не удалось получить печатную форму обработки персональных данных");
	Иначе 
		Для каждого Файл Из МассивФайловОПД Цикл
			НачатьПолучениеФайлаССервера(ПоместитьВоВременноеХранилище(Base64Значение(Файл["ДанныеФайла"])), Файл["ИмяФайла"], Новый ПараметрыДиалогаПолученияФайлов());
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьДанныеПоКонтрагенту(ВидСогласия,Согласие)
	
	СтруктураОбъекта = Новый Структура;
	СтруктураКлиента = Новый Структура;
	СтруктураДокумента = Новый Структура;
	СтруктураАвтомобиля = Новый Структура;
	СтруктураСогласия = Новый Структура;
	СтруктураОтвветсвенный = Новый Структура;
	
	Если Не Объект.Паспорт.Текущий Тогда 
		ВызватьИсключение("Нет данных актуального паспорта");
	КонецЕсли;
	
	СтруктураДокумента.Вставить("passportnumber",Объект.Паспорт.Номер);
	СтруктураДокумента.Вставить("passportseries",Объект.Паспорт.Серия);
	СтруктураДокумента.Вставить("passportissued",Объект.Паспорт.КемВыдан); 
	СтруктураДокумента.Вставить("passportday",День(Объект.Паспорт.ДатаВыдачи));
	СтруктураДокумента.Вставить("passportmonth",Месяц(Объект.Паспорт.ДатаВыдачи));
	СтруктураДокумента.Вставить("passportyear",Год(Объект.Паспорт.ДатаВыдачи));
	
	СтруктураДанных = Документы.DMS_СогласиеНаОбработкуПерсональныхДанных.ПрочитатьДанные(Объект);
	
	СтруктураКлиента.Вставить("lastname",Объект.ФизическоеЛицо.Фамилия);
	СтруктураКлиента.Вставить("firstname",Объект.ФизическоеЛицо.Имя);
	СтруктураКлиента.Вставить("middlename",Объект.ФизическоеЛицо.Отчество);
	СтруктураКлиента.Вставить("birthday",Объект.ФизическоеЛицо.ДатаРождения);
	СтруктураКлиента.Вставить("gender",?(Объект.ФизическоеЛицо.Пол=Перечисления.ПолФизическихЛиц.НеУказан,"",""+Объект.ФизическоеЛицо.Пол));
	СтруктураКлиента.Вставить("address",СтруктураДанных.Адрес);
	СтруктураКлиента.Вставить("tel",СтруктураДанных.Телефоны);
	СтруктураКлиента.Вставить("email",СтруктураДанных.Email);
	СтруктураКлиента.Вставить("company",?(Объект.ФизическоеЛицо.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо,Истина,Ложь));
	СтруктураКлиента.Вставить("document",СтруктураДокумента);
	СтруктураОбъекта.Вставить("client",СтруктураКлиента);
	
	СтруктураАвтомобиля.Вставить("mark","");
	СтруктураАвтомобиля.Вставить("vin","");
	СтруктураАвтомобиля.Вставить("daybuycar",Дата('00010101'));
	СтруктураОбъекта.Вставить("auto",СтруктураАвтомобиля);
	
	СтруктураСогласия.Вставить("form",ВидСогласия);
	СтруктураСогласия.Вставить("agree",Согласие);
	СтруктураОбъекта.Вставить("consent",СтруктураСогласия);
	
	СтруктураОтвветсвенный.Вставить("name",""+ПараметрыСеанса.Пользователь.Сотрудник);
	СтруктураОтвветсвенный.Вставить("from","Форма документа согласия на опд");
	СтруктураОбъекта.Вставить("responsible",СтруктураОтвветсвенный);
	
	Возврат СтруктураОбъекта;
	
КонецФункции

&НаСервере
Функция ЗаполнитьДанныеПоПотенциальномуКлиенту(ВидСогласия,Согласие)
	СтруктураОбъекта = Новый Структура;
	СтруктураКлиента = Новый Структура;
	СтруктураДокумента = Новый Структура;
	СтруктураАвтомобиля = Новый Структура;
	СтруктураСогласия = Новый Структура;
	СтруктураОтвветсвенный = Новый Структура;
		
	СтруктураДанных = Документы.DMS_СогласиеНаОбработкуПерсональныхДанных.ПрочитатьДанные(Объект);

	СтруктураДокумента.Вставить("passportnumber",ПаспортСерия);
	СтруктураДокумента.Вставить("passportseries",ПаспортНомер);
	СтруктураДокумента.Вставить("passportissued",ПаспортОрганВыдачи); 
	СтруктураДокумента.Вставить("passportday",День(ПаспортДатаВыдачи));
	СтруктураДокумента.Вставить("passportmonth",Месяц(ПаспортДатаВыдачи));
	СтруктураДокумента.Вставить("passportyear",Год(ПаспортДатаВыдачи));

	СтруктураКлиента.Вставить("lastname",Объект.ФизическоеЛицо.Фамилия);
	СтруктураКлиента.Вставить("firstname",Объект.ФизическоеЛицо.Имя);
	СтруктураКлиента.Вставить("middlename",Объект.ФизическоеЛицо.Отчество);
	СтруктураКлиента.Вставить("birthday",Объект.ФизическоеЛицо.ДатаРождения);
	СтруктураКлиента.Вставить("gender",?(Объект.ФизическоеЛицо.Пол=Перечисления.ПолФизическихЛиц.НеУказан,"",""+Объект.ФизическоеЛицо.Пол));
	СтруктураКлиента.Вставить("address",СтруктураДанных.Адрес);
	СтруктураКлиента.Вставить("tel",СтруктураДанных.Телефоны);
	СтруктураКлиента.Вставить("email",СтруктураДанных.Email);
	СтруктураКлиента.Вставить("company",?(Объект.ФизическоеЛицо.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо,Истина,Ложь));
	СтруктураКлиента.Вставить("document",СтруктураДокумента);
	СтруктураОбъекта.Вставить("client",СтруктураКлиента);

	СтруктураАвтомобиля.Вставить("mark","");
	СтруктураАвтомобиля.Вставить("vin","");
	СтруктураАвтомобиля.Вставить("daybuycar",Дата('00010101'));
	СтруктураОбъекта.Вставить("auto",СтруктураАвтомобиля);
	
	СтруктураСогласия.Вставить("form",ВидСогласия);
	СтруктураСогласия.Вставить("agree",Согласие);
	СтруктураОбъекта.Вставить("consent",СтруктураСогласия);
	
	СтруктураОтвветсвенный.Вставить("name",""+ПараметрыСеанса.Пользователь.Сотрудник);
	СтруктураОтвветсвенный.Вставить("from","Форма документа согласия на опд");
	СтруктураОбъекта.Вставить("responsible",СтруктураОтвветсвенный);
	
	Возврат СтруктураОбъекта;

	
КонецФункции

&НаКлиенте
Процедура ПечатьСогласияНаКоммуникацию(Команда)
	
	Если Не Объект.Проведен Тогда 
		Сообщить("Необходимо провести документ");
		Возврат;	
	КонецЕсли;
	
	Если ТипЗнч(Объект.ФизическоеЛицо) = Тип("СправочникСсылка.Контрагенты") Тогда 
		ПечатьОПДДляКонтрагента("Коммуникация",Истина);
	Иначе
		ПечатьОПДДляПотеницальногоКонтрагента("Коммуникация",Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСогласияНаСервисы(Команда)
	
	Если Не Объект.Проведен Тогда 
		Сообщить("Необходимо провести документ");
		Возврат;	
	КонецЕсли;
	
	Попытка
		СтруктураПараметровСервисы = ЗаполнитьДанныеПоКонтрагенту("Сервисы",Истина);
		
		ДанныеСервисы = DMS_ОбщегоНазначенияСервер.ПолучитьДанныеОПД(СтруктураПараметровСервисы,Объект.ФизическоеЛицо);
		
		Если ДанныеСервисы = Неопределено Тогда 
			ПоказатьПредупреждение(,"Не удалось получить печатную форму на подключение сервисов");
		Иначе 
			Для каждого Файл Из ДанныеСервисы Цикл
				НачатьПолучениеФайлаССервера(ПоместитьВоВременноеХранилище(Base64Значение(Файл["ДанныеФайла"])), Файл["ИмяФайла"], Новый ПараметрыДиалогаПолученияФайлов());
			КонецЦикла;	
		КонецЕсли;
	Исключение
		Сообщить(ОписаниеОшибки());	
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура СогласиеОПДПриИзменении(Элемент)
	
	Если Объект.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да Тогда
		Элементы.ПечатьОПД.Доступность = Истина;
		Возврат;
	Иначе 
		Элементы.ПечатьОПД.Доступность = Ложь;
		Если Объект.СогласиеНаКоммуникацию Тогда 
			Объект.СогласиеНаКоммуникацию = Ложь;
			СогласиеКоммуникацияПриИзменении(Неопределено);
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Объект.ФизическоеЛицо) = Тип("СправочникСсылка.Контрагенты") Тогда 
		ОтозватьОПДПоКонтрагенту("ПерсональныеДанные","Согласие на обработку персональных данных будет отозвано. Продолжить?");
	Иначе
		ОтозватьОпдДляПотенциальногоКонтрагента("ПерсональныеДанные","Согласие на обработку персональных данных будет отозвано. Продолжить?");
	КонецЕсли;

	ОбновитьДоступностьПечати();
КонецПроцедуры

&НаКлиенте
Процедура СогласиеКоммуникацияПриИзменении(Элемент)
	
	Если Объект.СогласиеНаКоммуникацию Тогда
		Объект.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да;
		ОбновитьДоступностьПечати();
		Возврат;
	Иначе 
		Элементы.ПечатьСогласияНаКоммуникацию.Доступность = Ложь;
	КонецЕсли;

	Если ТипЗнч(Объект.ФизическоеЛицо) = Тип("СправочникСсылка.Контрагенты") Тогда 
		ОтозватьОПДПоКонтрагенту("Коммуникация","Согласие на коммуникацию будет отозвано. Продолжить?");
	Иначе
		ОтозватьОпдДляПотенциальногоКонтрагента("Коммуникация","Согласие на коммуникацию будет отозвано. Продолжить?");
	КонецЕсли;

	ОбновитьДоступностьПечати();
	
КонецПроцедуры

&НаКлиенте
Процедура СогласиеСервисыПриИзменении(Элемент)

	Если Объект.СогласиеНаПодключаемыеСервисы Тогда
		Элементы.ПечатьСервисы.Доступность = Истина;
		Возврат;
	Иначе 
		Элементы.ПечатьСервисы.Доступность = Ложь;
	КонецЕсли;

	ОтозватьОПДПоКонтрагенту("Сервисы","Согласие на подключаемые сервисы данных будет отозвано. Продолжить?");
	
	ОбновитьДоступностьПечати();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтозватьОПДПоКонтрагенту(ВидСогласия,ТекстВопроса)
	
	Ответ = Вопрос(ТекстВопроса,РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Нет);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Попытка
			СтруктураПараметровОПД = ЗаполнитьДанныеПоКонтрагенту(ВидСогласия,Ложь);
			
			ДанныеОПД = DMS_ОбщегоНазначенияСервер.ПолучитьДанныеОПД(СтруктураПараметровОПД,Объект.ФизическоеЛицо);
			
			Если ДанныеОПД = Неопределено Тогда 
				ПоказатьПредупреждение(,"Не удалось отозвать согласие.");
			Иначе
				ПоказатьПредупреждение(,ДанныеОПД["answer"]);
			КонецЕсли;
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;		
	Иначе
		Если ВидСогласия = "ПерсональныеДанные" Тогда 
			Объект.СогласиеНаОбработкуПерсональныхДанных = СохранениеСогласияОПД;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтозватьОпдДляПотенциальногоКонтрагента(ВидСогласия,ТекстВопроса)

	Ответ = Вопрос(ТекстВопроса,РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Нет);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		СтруктураПараметровОПД = ЗаполнитьДанныеПоПотенциальномуКлиенту("ПерсональныеДанные",Ложь);
		
		ДанныеОПД = DMS_ОбщегоНазначенияСервер.ПолучитьДанныеОПД(СтруктураПараметровОПД,Объект.ФизическоеЛицо);
		
		Если ДанныеОПД = Неопределено Тогда 
			ПоказатьПредупреждение(,"Не удалось отозвать согласие.");
		Иначе
			ПоказатьПредупреждение(,ДанныеОПД["answer"]);
		КонецЕсли;
	Иначе 
		Если ВидСогласия = "ПерсональныеДанные" Тогда 
			Объект.СогласиеНаОбработкуПерсональныхДанных = СохранениеСогласияОПД;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СогласиеОПДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СохранениеСогласияОПД = Объект.СогласиеНаОбработкуПерсональныхДанных;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьПечати()
	
	Если Объект.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да Тогда
		Элементы.ПечатьОПД.Доступность = Истина;
	Иначе 
		Элементы.ПечатьОПД.Доступность = Ложь;
	КонецЕсли;
	
	Элементы.ПечатьСогласияНаКоммуникацию.Доступность = Объект.СогласиеНаКоммуникацию;
	Элементы.ПечатьСервисы.Доступность = Объект.СогласиеНаПодключаемыеСервисы;

КонецПроцедуры

//#КонецОбласти
