&НаСервере
Процедура ЗаписатьМакет(АдресФайлаМакетаВоВременномХранилище)
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаМакетаВоВременномХранилище);
	
	Запись = РегистрыСведений.Renault_ПользовательскиеМакетыПечати.СоздатьМенеджерЗаписи();
	Запись.Объект = Объект;
	Запись.ИмяМакета = ИмяМакета;
	Запись.ТипМакета = ТипМакета;
	//Если Найти(ВРег(ФайлМакета), ".MXL")>0 Тогда
	//	ТипМакета = "MXL"; 
	//	Запись.ТипМакета ="MXL";
	//Иначе
	//	Если Найти(ВРег(ФайлМакета),".DOC")>0 Тогда
	//		Запись.ТипМакета ="DOC";
	//	иначе
	//		//*//*//Другие типы макетов, тип макета не заполняем
	//	КонецЕсли;
	//	
	//КонецЕсли;

	Запись.Использование = Истина;
	Запись.Макет = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
	Запись.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Файл = Новый Файл(ФайлМакета);
	Если Файл.Существует() Тогда
		ДвоичныеДанные = Новый ДвоичныеДанные(ФайлМакета);
		АдресФайлаМакетаВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		
		ЗаписатьМакет(АдресФайлаМакетаВоВременномХранилище);
		
		ЭтаФорма.Закрыть();
	Иначе
		Сообщить("Не обнаружен файл макета!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// список выбора
	ЭтаФорма.Элементы.Объект.СписокВыбора.Очистить();
	Для Каждого выбДок Из Метаданные.Документы Цикл
		ЭтаФорма.Элементы.Объект.СписокВыбора.Добавить(выбДок.ПолноеИмя(), выбДок.Синоним);	
		Если выбДок.ПолноеИмя() = "Документ.Renault_Договор" Тогда 
			ЭтаФорма.Элементы.Объект.СписокВыбора.Добавить(выбДок.ПолноеИмя()+" TCM 15m+", выбДок.Синоним +" TCM 15m+");	
		КонецЕсли;			
	КонецЦикла;
	Для Каждого выбДок Из Метаданные.Справочники Цикл
		ЭтаФорма.Элементы.Объект.СписокВыбора.Добавить(выбДок.ПолноеИмя(), выбДок.Синоним);			
	КонецЦикла;
	
	ЭтаФорма.Элементы.Объект.СписокВыбора.СортироватьПоПредставлению(НаправлениеСортировки.Возр);
КонецПроцедуры

&НаКлиенте
Процедура ФайлМакетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл с макетом";
	Диалог.ПолноеИмяФайла = ФайлМакета;
	
	Диалог.Фильтр = "Документы Word (*.docx)|*.docx*|Документы OpenOffice|*.odt*|Документы MXL|*.mxl*|Все файлы|*.*";
	Если Диалог.Выбрать() Тогда
		ФайлМакета = Диалог.ПолноеИмяФайла;
		Если Найти(ВРег(ФайлМакета), ".MXL")>0 Тогда
			ТипМакета = "MXL"; 
		ИначеЕсли Найти(ВРег(ФайлМакета),".DOCX")>0 Тогда
			ТипМакета ="DOCX";
		ИначеЕсли Найти(ВРег(ФайлМакета),".ODT")>0 Тогда
			ТипМакета ="ODT";
		Иначе
			//Другие типы макетов, тип макета не заполняем	
		КонецЕсли;
		Файл = Новый Файл(ФайлМакета);
		Если Файл.Существует() Тогда
			ДвоичныеДанные = Новый ДвоичныеДанные(ФайлМакета);
			АдресФайлаМакетаВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
