
//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли; 
		
	Если Параметры.Свойство("ДилерскийЦентр") Тогда
		ДилерскийЦентр = Параметры.ДилерскийЦентр;
	//Иначе 
	//	Контрагент = ЗначениеНастроекПовтИсп.ПолучитьКонтрагентаПользователяПоУмолчанию(ПараметрыСеанса.ТекущийПользователь);	
	КонецЕсли; 
	
	МассивВыбора = ЗаполнитьСписокУровнейДетализацииПоГодам();
	
	Элементы.ГодСтрока.СписокВыбора.ЗагрузитьЗначения(МассивВыбора);
	Элементы.ГодСтрока.СписокВыбора.СортироватьПоЗначению(НаправлениеСортировки.Возр);	
	
	Год = НачалоГода(ТекущаяДатаСеанса());
	
	ДатаНачала    = Год;
	ДатаОкончания = КонецГода(Год);
	
	Квартал = НачалоКвартала(ТекущаяДатаСеанса());
	
	ГодСтрока 	  = Формат(Год,"ДФ='yyyy ''год'''; ДП=-");
	КварталСтрока = "ВесьГод";
	
	ВидОтчета = "КалендарьКампаний";
	ЦветТекстаОформления = Новый Цвет(62,79,145);
	
	//ВидОперации = ПараметрыСеанса.ВидОперацииРекламнойКампании;
	
	Элементы.ГруппаШапка.Видимость = Элементы.ФормаОтбор.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СформироватьОтчет();	
	
	Элементы["Форма"+СокрЛП(ВидОтчета)].Пометка = Истина;
	
	Если СокрЛП(ВидОтчета) = "КалендарьКампаний" Тогда
	
		ЦветТекстаОформления = Новый Цвет(62,79,145);
	
	ИначеЕсли СокрЛП(ВидОтчета) = "КалендарьКампанийБезОформления" Тогда
	
		ЦветТекстаОформления = Новый Цвет(0,0,0);
	
	ИначеЕсли СокрЛП(ВидОтчета) = "КалендарьКампанийЗеленый" Тогда
	
		ЦветТекстаОформления = Новый Цвет(72,125,72);
	
	ИначеЕсли СокрЛП(ВидОтчета) = "КалендарьКампанийЯркий" Тогда
	
		ЦветТекстаОформления = Новый Цвет(255,255,255);
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_РекламнаяКампания" Тогда
		СформироватьОтчет();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СтандартныйПериод") Тогда
		ОповещениеПослеВыбораПериода(ВыбранноеЗначение,ПутьКФайлу);
	КонецЕсли; 
		
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийКомандФормы

&НаКлиенте
Процедура ОбновитьОтчет(Команда)
	СформироватьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКампанию(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.DMS_ВидыОперацийРекламнойКампании.СозданиеШаблона") Тогда
		ОткрытьФорму("Документ.DMS_РекламнаяКампания.Форма.ФормаДокумента",ПараметрыФормы,ЭтаФорма);
	Иначе 	
		ОткрытьФорму("Документ.DMS_РекламнаяКампания.Форма.ФормаПомощникСоздания",ПараметрыФормы,ЭтаФорма);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	ПараметрыФормы = Новый Структура("ТабличныйДокумент,Заголовок", ТабличныйДокумент,"Календарь кампаний");
	ОткрытьФорму("Обработка.DMS_КалендарьРекламныхКампаний.Форма.ПечатнаяФормаДокументов", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМакет(Команда)
	
	Если Не ЗначениеЗаполнено(ТекущаяРекламнаяКампания) Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура("РекламнаяКампания",ТекущаяРекламнаяКампания);
	ОткрытьФорму("Справочник.DMS_МакетыРекламнойКампании.Форма.ФормаЭлемента",ПараметрыФормы,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОтчет(Команда)
	
	Если Не ЗначениеЗаполнено(ТекущаяРекламнаяКампания) Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура("РекламнаяКампания",ТекущаяРекламнаяКампания);
	ОткрытьФорму("Документ.DMS_ОтчетПоРекламнойКампании.Форма.ФормаДокумента",ПараметрыФормы,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура МоиЗадачи(Команда)
	ОткрытьФорму("Задача.DMS_ЗадачаИсполнителя.Форма.МоиЗадачи",,ЭтаФорма);		
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВCSV(Команда)
	
	АдресФайла 			  = "";
	ДатаНачалаВыгрузки	  = "";
	ДатаОкончанияВыгрузки = "";
	Режим = РежимДиалогаВыбораФайла.Открытие;
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	
	ДиалогОткрытияФайла.ПолноеИмяФайла  = "";
	Фильтр = "Файл выгрузки(*,csv)|*.csv";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок   = "Выберите файл";
	
	ПутьКФайлу = "";  
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;	
	
	Если ПустаяСтрока(ПутьКФайлу) Тогда
		Предупреждение("Файл не выбран!",15,"Внимание");
		Возврат;
	КонецЕсли; 
		
	ПараметрыФормы = Новый Структура("Заголовок","Выберите дату выгрузки");
	
	ОткрытьФорму("Обработка.DMS_КалендарьРекламныхКампаний.Форма.ФормаВыбораПериода",ПараметрыФормы,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КалендарьКампаний(Команда)
	
	ИмяМакета = СтрЗаменить(Команда.Имя,"Форма","");
	
	ВидОтчета = ИмяМакета;
	ЦветТекстаОформления = Новый Цвет(62,79,145);
	
	СформироватьОтчет();
	
	Элементы.ФормаКалендарьКампаний.Пометка 			 = Истина;
	Элементы.ФормаКалендарьКампанийБезОформления.Пометка = Ложь;
	Элементы.ФормаКалендарьКампанийЗеленый.Пометка 		 = Ложь;
	Элементы.ФормаКалендарьКампанийЯркий.Пометка 		 = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура КалендарьКампанийБезОформления(Команда)
	
	ИмяМакета = СтрЗаменить(Команда.Имя,"Форма","");
	
	ВидОтчета = ИмяМакета;
	ЦветТекстаОформления = Новый Цвет(0,0,0);
	
	СформироватьОтчет();
	
	Элементы.ФормаКалендарьКампаний.Пометка 			 = Ложь;
	Элементы.ФормаКалендарьКампанийБезОформления.Пометка = Истина;
	Элементы.ФормаКалендарьКампанийЗеленый.Пометка 		 = Ложь;
	Элементы.ФормаКалендарьКампанийЯркий.Пометка 		 = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура КалендарьКампанийЗеленый(Команда)
	
	ИмяМакета = СтрЗаменить(Команда.Имя,"Форма","");
	
	ВидОтчета = ИмяМакета;
	ЦветТекстаОформления = Новый Цвет(72,125,72);
	
	СформироватьОтчет();
	
	Элементы.ФормаКалендарьКампаний.Пометка 			 = Ложь;
	Элементы.ФормаКалендарьКампанийБезОформления.Пометка = Ложь;
	Элементы.ФормаКалендарьКампанийЗеленый.Пометка 		 = Истина;
	Элементы.ФормаКалендарьКампанийЯркий.Пометка 		 = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура КалендарьКампанийЯркий(Команда)
	
	ИмяМакета = СтрЗаменить(Команда.Имя,"Форма","");
	
	ВидОтчета = ИмяМакета;
	ЦветТекстаОформления = Новый Цвет(255,255,255);
	
	СформироватьОтчет();
	
	Элементы.ФормаКалендарьКампаний.Пометка 			 = Ложь;
	Элементы.ФормаКалендарьКампанийБезОформления.Пометка = Ложь;
	Элементы.ФормаКалендарьКампанийЗеленый.Пометка 		 = Ложь;
	Элементы.ФормаКалендарьКампанийЯркий.Пометка 		 = Истина;
	
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементаФормыТабличныйДокумент

&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Область.Расшифровка) И ТипЗнч(Область.Расшифровка) = Тип("СправочникСсылка.DMS_СтатусыМакетовРекламнойКампании") Тогда  
		
		НомерСтроки  = Число(СтрЗаменить(Лев(Область.Имя,Найти(Область.Имя,"C")-1),"R",""));
		мКампания = ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧЦ=10; ЧГ=")+"C3:R"+Формат(НомерСтроки,"ЧЦ=10; ЧГ=")+"C3").Расшифровка;
		
		Если ТипЗнч(мКампания) = Тип("ДокументСсылка.DMS_РекламнаяКампания") 
			И Область.Расшифровка = ПредопределенноеЗначение("Справочник.DMS_СтатусыМакетовРекламнойКампании.БезМакета") Тогда
			
			ПараметрыФормы = Новый Структура("Ключ",мКампания);
			ОткрытьФорму("Документ.DMS_РекламнаяКампания.Форма.ФормаПомощникСоздания",ПараметрыФормы,ЭтаФорма);
			
			СтандартнаяОбработка = Ложь;
			
		ИначеЕсли ТипЗнч(мКампания) = Тип("ДокументСсылка.DMS_РекламнаяКампания") Тогда  
			
			ПараметрыФормы = Новый Структура("Отбор",Новый Структура("РекламнаяКампания",мКампания));
			ОткрытьФорму("Справочник.DMS_МакетыРекламнойКампании.ФормаСписка",ПараметрыФормы,ЭтаФорма);
			
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли; 
		
	ИначеЕсли ЗначениеЗаполнено(Область.Расшифровка) И ТипЗнч(Область.Расшифровка) = Тип("СправочникСсылка.DMS_СтатусыОтчетовПоРекламнойКампании") Тогда  
		
		НомерСтроки  = Число(СтрЗаменить(Лев(Область.Имя,Найти(Область.Имя,"C")-1),"R",""))-1;
		мКампания = ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧЦ=10; ЧГ=")+"C3:R"+Формат(НомерСтроки,"ЧЦ=10; ЧГ=")+"C3").Расшифровка;
		
		Если ТипЗнч(мКампания) = Тип("ДокументСсылка.DMS_РекламнаяКампания") 
			И Область.Расшифровка = ПредопределенноеЗначение("Справочник.DMS_СтатусыОтчетовПоРекламнойКампании.БезОтчета") Тогда
			
			ПараметрыФормы = Новый Структура("Ключ",мКампания);
			ОткрытьФорму("Документ.DMS_РекламнаяКампания.Форма.ФормаПомощникСоздания",ПараметрыФормы,ЭтаФорма);
			
			СтандартнаяОбработка = Ложь;
			
		ИначеЕсли ТипЗнч(мКампания) = Тип("ДокументСсылка.DMS_РекламнаяКампания") Тогда  
			
			ПараметрыФормы = Новый Структура("Отбор",Новый Структура("РекламнаяКампания",мКампания));
			ОткрытьФорму("Документ.DMS_ОтчетПоРекламнойКампании.ФормаСписка",ПараметрыФормы,ЭтаФорма);
			
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли; 
		
	ИначеЕсли ЗначениеЗаполнено(Область.Расшифровка) И ТипЗнч(Область.Расшифровка) = Тип("ДокументСсылка.DMS_РекламнаяКампания") Тогда  
		
		ПараметрыФормы = Новый Структура("Ключ",Область.Расшифровка);
		ОткрытьФорму("Документ.DMS_РекламнаяКампания.Форма.ФормаПомощникСоздания",ПараметрыФормы,ЭтаФорма);
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли; 
	
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредставительПриИзменении(Элемент)
	СформироватьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ГодСтрокаПриИзменении(Элемент)
	
	ВыбранныйГод = СокрЛП(СтрЗаменить(ГодСтрока," год",""));
	
	СтрокаГода = ВыбранныйГод+"0101";
	
	Год = Дата(СтрокаГода);
	
	Если ФинансовыйГод Тогда
		ДатаНачала 	  = Дата(ВыбранныйГод+"0401");
		ДатаОкончания = ДобавитьМесяц(ДатаНачала,11);
		Квартал 	  = ДатаНачала;
	Иначе 
		ДатаНачала    = Год;
		ДатаОкончания = КонецГода(Год);
		Квартал 	  = НачалоГода(Год);
	КонецЕсли; 
	
	КварталСтрока = "ВесьГод";
	
	СформироватьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура КварталСтрокаПриИзменении(Элемент)
	
	НачалоФинансовогоГода = Формат(Год,"ДФ=yyyy")+"0401";
	
	ГодФинансовый = Дата(НачалоФинансовогоГода);
	
	Если КварталСтрока = "ВесьГод" Тогда
		
		Если ФинансовыйГод Тогда
			
			ДатаНачала    = НачалоГода(ГодФинансовый);
			ДатаОкончания = КонецГода(ГодФинансовый);
			Квартал 	  = ГодФинансовый;
			
			СтрокаКвартала = Формат(ДатаНачала,"ДФ=yyyyMMdd");
			
		Иначе 
			
			ДатаНачала    = НачалоГода(Год);
			ДатаОкончания = КонецГода(Год);
			Квартал 	  = ДатаНачала;
			
		КонецЕсли; 
		
		Элементы.МесяцСтрока.Видимость = Ложь;
		
		СформироватьЗаКвартал = Ложь;
		СформироватьЗаМесяц   = Ложь;
		
	ИначеЕсли КварталСтрока = "ПервыйКвартал" Тогда 
		
		Если ФинансовыйГод Тогда
			
			ДатаНачала    = ГодФинансовый;
			ДатаОкончания = ДобавитьМесяц(ДатаНачала,2);
			Квартал 	  = ДатаНачала;
			
			СтрокаКвартала = Формат(ДатаНачала,"ДФ=yyyyMMdd");
			
		Иначе 
			
			ДатаНачала     = НачалоГода(Год);
			СтрокаКвартала = Формат(Год,"ДФ=yyyy")+"0101";
			ДатаОкончания  = КонецКвартала(Дата(СтрокаКвартала));
			Квартал = Дата(СтрокаКвартала);
			
		КонецЕсли; 
		
		Элементы.МесяцСтрока.Видимость = ФинансовыйГод;
		ЗаполнитьМесяц(Дата(СтрокаКвартала));
		
		СформироватьЗаКвартал = Истина;
		
	ИначеЕсли КварталСтрока = "ВторойКвартал" Тогда 
		
		Если ФинансовыйГод Тогда
			
			ДатаНачала    = ДобавитьМесяц(ГодФинансовый,3);
			ДатаОкончания = ДобавитьМесяц(ДатаНачала,2);
			Квартал 	  = ДатаНачала;
			
			СтрокаКвартала = Формат(ДатаНачала,"ДФ=yyyyMMdd");
			
		Иначе 
			
			СтрокаКвартала = Формат(Год,"ДФ=yyyy")+"0401";
			
			ДатаНачала     = НачалоКвартала(Дата(СтрокаКвартала));
			ДатаОкончания  = КонецКвартала(Дата(СтрокаКвартала));
			Квартал 	   = Дата(СтрокаКвартала);
			
		КонецЕсли; 
		
		Элементы.МесяцСтрока.Видимость = ФинансовыйГод;
		ЗаполнитьМесяц(Дата(СтрокаКвартала));
		
		СформироватьЗаКвартал = Истина;
		
	ИначеЕсли КварталСтрока = "ТретийКвартал" Тогда 
		
		Если ФинансовыйГод Тогда
			
			ДатаНачала    = ДобавитьМесяц(ГодФинансовый,6);
			ДатаОкончания = ДобавитьМесяц(ДатаНачала,2);
			Квартал 	  = ДатаНачала;
			
			СтрокаКвартала = Формат(ДатаНачала,"ДФ=yyyyMMdd");
			
		Иначе 
			
			СтрокаКвартала = Формат(Год,"ДФ=yyyy")+"0701";
			
			ДатаНачала     = НачалоКвартала(Дата(СтрокаКвартала));
			ДатаОкончания  = КонецКвартала(Дата(СтрокаКвартала));
			Квартал 	   = Дата(СтрокаКвартала);
			
		КонецЕсли; 
		
		Элементы.МесяцСтрока.Видимость = ФинансовыйГод;
		ЗаполнитьМесяц(Дата(СтрокаКвартала));
		
		СформироватьЗаКвартал = Истина;
		
	ИначеЕсли КварталСтрока = "ЧетвертыйКвартал" Тогда 
		
		Если ФинансовыйГод Тогда
			
			ДатаНачала    = ДобавитьМесяц(ГодФинансовый,9);
			ДатаОкончания = ДобавитьМесяц(ДатаНачала,2);
			Квартал 	  = ДатаНачала;
			
			СтрокаКвартала = Формат(ДатаНачала,"ДФ=yyyyMMdd");
			
		Иначе 
			
			СтрокаКвартала = Формат(Год,"ДФ=yyyy")+"1001";
			
			ДатаНачала     = НачалоКвартала(Дата(СтрокаКвартала));
			ДатаОкончания  = КонецКвартала(Дата(СтрокаКвартала));
			Квартал 	   = Дата(СтрокаКвартала);
			
		КонецЕсли; 
		
		Элементы.МесяцСтрока.Видимость = ФинансовыйГод;
		ЗаполнитьМесяц(Дата(СтрокаКвартала));
		
		СформироватьЗаКвартал = Истина;
		
	КонецЕсли;		
	
	СформироватьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура ДилерскийЦентрПриИзменении(Элемент)
	СформироватьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура МодельПриИзменении(Элемент)
	СформироватьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ТипМедиаПриИзменении(Элемент)
	СформироватьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура РекламнаяКампанияПриИзменении(Элемент)
	СформироватьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ТипКампанииПриИзменении(Элемент)
	СформироватьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ТипРазмещенияКампанииПриИзменении(Элемент)
	СформироватьОтчет();	
КонецПроцедуры

&НаКлиенте
Процедура ВидРекламыПриИзменении(Элемент)
	СформироватьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйГодПриИзменении(Элемент)
	
	Если ФинансовыйГод Тогда
		
		ПериодФинансовогоПериода = ПолучитьФинансовыйГод(Год);
		
		ДатаНачала 	  = ПериодФинансовогоПериода.ДатаНачала;
		ДатаОкончания = ПериодФинансовогоПериода.ДатаОкончания;
		
		СформироватьЗаКвартал = Ложь;
		СформироватьЗаМесяц = Ложь;
		
	Иначе 
		
		ДатаНачала 	  = НачалоГода(Год);
		ДатаОкончания = КонецГода(Год);
		
		СформироватьЗаКвартал 		   = Ложь;
		СформироватьЗаМесяц 		   = Ложь;
		Элементы.МесяцСтрока.Видимость = Ложь;
		
	КонецЕсли;
	
	КварталСтрока = "ВесьГод";
	
	Квартал = ДатаНачала;
	
	СформироватьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура ПланФактДельтаПриИзменении(Элемент)
	СформироватьОтчет();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМесяц(НачалоКвартала)
	
	МесяцСтрока = "ВесьКвартал";
	
	Элементы.МесяцСтрока.СписокВыбора.Очистить();
	
	Элементы.МесяцСтрока.СписокВыбора.Добавить(0,"Весь квартал");	
	Элементы.МесяцСтрока.СписокВыбора.Добавить(Месяц(НачалоКвартала),Формат(НачалоКвартала,"ДФ=MMMM"));	
	Элементы.МесяцСтрока.СписокВыбора.Добавить(Месяц(ДобавитьМесяц(НачалоКвартала,1)),Формат(ДобавитьМесяц(НачалоКвартала,1),"ДФ=MMMM"));	
	Элементы.МесяцСтрока.СписокВыбора.Добавить(Месяц(ДобавитьМесяц(НачалоКвартала,2)),Формат(ДобавитьМесяц(НачалоКвартала,2),"ДФ=MMMM"));	
	
КонецПроцедуры // ЗаполнитьМесяц()

&НаКлиенте
Процедура МесяцСтрокаПриИзменении(Элемент)
	
	Если МесяцСтрока = 0 Тогда
		
		ПериодФинансовогоПериода = ПолучитьФинансовыйГод(Год);
		
		ДатаНачала 	  = ПериодФинансовогоПериода.ДатаНачала;
		ДатаОкончания = ПериодФинансовогоПериода.ДатаОкончания;
		
		СформироватьЗаМесяц = Ложь;
		
		КварталСтрокаПриИзменении(Неопределено);
		
		Возврат;
		
	Иначе 
		
		Если МесяцСтрока >= 1 И МесяцСтрока <= 3 Тогда
			
			мДатаСтрокой = Формат(ДобавитьМесяц(Год,12),"ДФ=yyyy")+Формат(МесяцСтрока,"ЧЦ=2; ЧВН=; ЧГ=")+"01";
			
			ДатаНачала	  = НачалоМесяца(мДатаСтрокой);
			ДатаОкончания = КонецМесяца(мДатаСтрокой);
			
		Иначе 
			
			мДатаСтрокой = Формат(Год,"ДФ=yyyy")+Формат(МесяцСтрока,"ЧЦ=2; ЧВН=; ЧГ=")+"01";
			
			ДатаНачала	  = НачалоМесяца(мДатаСтрокой);
			ДатаОкончания = КонецМесяца(мДатаСтрокой);
			
		КонецЕсли; 
		
		СформироватьЗаМесяц = Истина;
		
	КонецЕсли; 
	
	СформироватьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура Отбор(Команда)
	
	Элементы.ФормаОтбор.Пометка    = Не Элементы.ФормаОтбор.Пометка;
	
	Элементы.ФормаОтбор.Заголовок = ?(Элементы.ФормаОтбор.Пометка,"Скрыть отбор","Установить отбор");
	
	Элементы.ГруппаШапка.Видимость = Элементы.ФормаОтбор.Пометка;
	
КонецПроцедуры

//#КонецОбласти

//#Область ФормированиеОтчета

&НаСервере
Процедура СформироватьОтчет()
	
	Если СформироватьЗаМесяц Тогда
		СформироватьОтчетЗаМесяцНаСервере();
	ИначеЕсли СформироватьЗаКвартал Тогда
		СформироватьОтчетЗаКварталНаСервере();
	Иначе 
		СформироватьОтчетЗаГодНаСервере();
	КонецЕсли;	
	
КонецПроцедуры // СформироватьОтчет()

&НаСервере
Функция ПолучитьПараметрыЗапроса(ЭтоВыгрузка = Ложь)
	
	ПараметрыЗапроса = Новый Структура;
	
	Если ЭтоВыгрузка Тогда	
		
		ПараметрыГраницы = Новый Массив(2);
		ПараметрыГраницы[0] = КонецДня(ДатаОкончанияВыгрузки);
		ПараметрыГраницы[1] = ВидГраницы.Включая;
		ГраницаОкочания = Новый(Тип("Граница"),ПараметрыГраницы);	
		
		ПараметрыЗапроса.Вставить("ДатаНачала", 		  ДатаНачалаВыгрузки); 
		ПараметрыЗапроса.Вставить("ДатаОкончанияВывода",  ДатаОкончанияВыгрузки);
		ПараметрыЗапроса.Вставить("ДатаОкончания",  	  ГраницаОкочания);
		ПараметрыЗапроса.Вставить("РекламнаяКампания",    Документы.DMS_РекламнаяКампания.ПустаяСсылка());
		ПараметрыЗапроса.Вставить("ДилерскийЦентр",       Справочники.CRM_ДилерскиеЦентры.ПустаяСсылка());
		ПараметрыЗапроса.Вставить("Модель",  			  Справочники.Модели.ПустаяСсылка());
		ПараметрыЗапроса.Вставить("МедиаРесурс",  		  Справочники.DMS_МедиаРесурсы.ПустаяСсылка());
		ПараметрыЗапроса.Вставить("ТипРазмещения",  	  Перечисления.DMS_ТипыРазмещенияМедиа.ПустаяСсылка());
		ПараметрыЗапроса.Вставить("ВидРекламы", 		  0);
		ПараметрыЗапроса.Вставить("ПланФактДельта", 	  0);
		ПараметрыЗапроса.Вставить("Представитель", 		  Справочники.DMS_Представители.ПустаяСсылка());
		
	Иначе 
		
		ПараметрыГраницы = Новый Массив(2);
		ПараметрыГраницы[0] = КонецДня(ДатаОкончания);
		ПараметрыГраницы[1] = ВидГраницы.Включая;
		ГраницаОкочания = Новый(Тип("Граница"),ПараметрыГраницы);	
		
		ПараметрыЗапроса.Вставить("ДатаНачала", 		  ДатаНачала); 
		ПараметрыЗапроса.Вставить("ДатаОкончанияВывода",  ДатаОкончания);
		ПараметрыЗапроса.Вставить("ДатаОкончания",  	  ГраницаОкочания);
		ПараметрыЗапроса.Вставить("РекламнаяКампания",    РекламнаяКампания);
		ПараметрыЗапроса.Вставить("ДилерскийЦентр",       ДилерскийЦентр);
		ПараметрыЗапроса.Вставить("Модель",  			  Модель);
		ПараметрыЗапроса.Вставить("МедиаРесурс",  		  ТипМедиа);
		ПараметрыЗапроса.Вставить("ТипРазмещения",  	  ТипРазмещенияКампании);
		ПараметрыЗапроса.Вставить("ВидРекламы", 		  ВидРекламы);
		ПараметрыЗапроса.Вставить("ПланФактДельта", 	  ПланФактДельта);
		ПараметрыЗапроса.Вставить("Представитель", 		  Представитель);
		
	КонецЕсли; 
		
	Возврат ПараметрыЗапроса;
	
КонецФункции // ПолучитьПараметрыЗапроса()

&НаСервере
Процедура СформироватьОтчетЗаГодНаСервере()
	
	ТабличныйДокумент.Очистить();
	
	Объект = РеквизитФормыВЗначение("ЭтаОбработка");
	Макет = Объект.ПолучитьМакет(СокрЛП(ВидОтчета));
	Объект = Неопределено;
	
	ПараметрыЗапроса = ПолучитьПараметрыЗапроса();
	
	ПакетЗапросов = СформироватьЗапрос(ПараметрыЗапроса);
	
	ВыборкаОбщий = ПакетЗапросов[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщий.Следующий();
	
	План_Данные   = ВыборкаОбщий.План;
	Факт_Данные   = ВыборкаОбщий.Факт;
	Дельта_Данные = ВыборкаОбщий.Дельта;
	
	ОбластьШапка 				   = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьСтрокаРекламныхКампаний = Макет.ПолучитьОбласть("ОбластьСтрокаРекламныхКампаний");
	
	Если ФинансовыйГод Тогда
		ОбластьШапкаГод = Макет.ПолучитьОбласть("ОбластьШапкаФинансовыйГод");
	Иначе 	
		ОбластьШапкаГод = Макет.ПолучитьОбласть("ОбластьШапкаГод");
	КонецЕсли; 
	
	ОбластьКонтрагент = Макет.ПолучитьОбласть("ОбластьКонтрагент");
	
	ОбластьМедиаРесурсГод = Макет.ПолучитьОбласть("ОбластьМедиаРесурсГод");
	ОбластьИтогГод		  = Макет.ПолучитьОбласть("ОбластьИтогГод");	
	
	ОбластьЕстьМакетИОтчет  = Макет.ПолучитьОбласть("ОбластьЕстьМакетИОтчет");
	ОбластьНетМакетаИОтчета = Макет.ПолучитьОбласть("ОбластьНетМакетаИОтчета");
	
	ОбластьЧерта = Макет.ПолучитьОбласть("ОбластьЧерта");
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Если ФинансовыйГод Тогда
		ОбластьШапкаГод.Параметры.ДатаНачала    = ДатаНачала;
		ОбластьШапкаГод.Параметры.ДатаОкончания = ДатаОкончания;
	Иначе 
		ОбластьШапкаГод.Параметры.Год = Год;
	КонецЕсли;
	
	ТабличныйДокумент.Присоединить(ОбластьШапкаГод);
	
	ВыборкаДилерскихЦентров = ВыборкаОбщий.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДилерскихЦентров.Следующий() Цикл
		
		ОбластьКонтрагент.Параметры.Заполнить(ВыборкаДилерскихЦентров);
		
		ТабличныйДокумент.Вывести(ОбластьКонтрагент);
		ТабличныйДокумент.НачатьГруппуСтрок();		
		
		ВыборкаМедиаРесурс = ВыборкаДилерскихЦентров.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаМедиаРесурс.Следующий() Цикл
			
			ОбластьМедиаРесурсГод.Параметры.Заполнить(ВыборкаМедиаРесурс);
			ТабличныйДокумент.Вывести(ОбластьМедиаРесурсГод);
			ТабличныйДокумент.НачатьГруппуСтрок();
			
			ТабличныйДокумент.Вывести(ОбластьЧерта);
			
			ВыборкаКампании = ВыборкаМедиаРесурс.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаКампании.Следующий() Цикл
				
				ОбластьСтрокаРекламныхКампаний.Параметры.Заполнить(ВыборкаКампании);
				ОбластьСтрокаРекламныхКампаний.Параметры.ДатаНачала    = ВыборкаКампании.РекламнаяКампания.ДатаНачала;
				ОбластьСтрокаРекламныхКампаний.Параметры.ДатаОкончания = ВыборкаКампании.РекламнаяКампания.ДатаОкончания;
				ТабличныйДокумент.Вывести(ОбластьСтрокаРекламныхКампаний);
				
				мГод = Формат(Год,"ДФ=yyyy");
				
				МесяцЗаполнения = НачалоМесяца(ДатаНачала);
				
				Пока МесяцЗаполнения <= НачалоМесяца(ДатаОкончания) Цикл 
					
					Если МесяцЗаполнения >= НачалоМесяца(ВыборкаКампании.РекламнаяКампания.ДатаНачала) И МесяцЗаполнения <= НачалоМесяца(ВыборкаКампании.РекламнаяКампания.ДатаОкончания) Тогда
						ОбластьЕстьМакетИОтчет.Параметры.Заполнить(ВыборкаКампании);
						ТабличныйДокумент.Присоединить(ОбластьЕстьМакетИОтчет);
					Иначе 
						ТабличныйДокумент.Присоединить(ОбластьНетМакетаИОтчета);
					КонецЕсли;
					
					МесяцЗаполнения = ДобавитьМесяц(МесяцЗаполнения,1);
					
				КонецЦикла;  
				
				ТабличныйДокумент.Вывести(ОбластьЧерта);
				
			КонецЦикла; 
			
			ТабличныйДокумент.ЗакончитьГруппуСтрок();
			
		КонецЦикла;
		
		ТабличныйДокумент.ЗакончитьГруппуСтрок();
		
	КонецЦикла; 
	
	ВыборкаСтатусов = ПакетЗапросов[6].Выбрать();
	
	Пока ВыборкаСтатусов.Следующий() Цикл
		ОбъединитьЯчейкиПоСтатусам(ВыборкаСтатусов.Статус);
	КонецЦикла; 
	
	ОбластьИтогГод.Параметры.Заполнить(ВыборкаОбщий);
	
	ТабличныйДокумент.Вывести(ОбластьИтогГод);
	
	ТабличныйДокумент.Вывести(ОбластьЧерта);
	
	ВывестиОбозначенияСтатусов(Макет);
	
	ТабличныйДокумент.ФиксацияСверху = 2;
	//ТабличныйДокумент.ФиксацияСлева  = 4;
	ТабличныйДокумент.АвтоМасштаб    = Истина;
	
КонецПроцедуры // СформироватьОтчетЗаГодНаСервере()

&НаСервере
Процедура СформироватьОтчетЗаКварталНаСервере()
	
	ТабличныйДокумент.Очистить();
	
	Объект = РеквизитФормыВЗначение("ЭтаОбработка");
	Макет = Объект.ПолучитьМакет(СокрЛП(ВидОтчета));
	Объект = Неопределено;
	
	ПараметрыЗапроса = ПолучитьПараметрыЗапроса();
	
	ПакетЗапросов = СформироватьЗапрос(ПараметрыЗапроса);
	
	ВыборкаОбщий = ПакетЗапросов[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщий.Следующий();
	
	План_Данные   = ВыборкаОбщий.План;
	Факт_Данные   = ВыборкаОбщий.Факт;
	Дельта_Данные = ВыборкаОбщий.Дельта;
	
	//ВыборкаМедиаРесурс = ВыборкаОбщий.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбластьШапкаВерх 			   = Макет.ПолучитьОбласть("ОбластьШапкаВерх");
	ОбластьШапка 				   = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьСтрокаРекламныхКампаний = Макет.ПолучитьОбласть("ОбластьСтрокаРекламныхКампаний");
	ОбластьМесяц				   = Макет.ПолучитьОбласть("ОбластьМесяц");
	ОбластьНеделя				   = Макет.ПолучитьОбласть("ОбластьНеделя");
	ОбластьЧерта 				   = Макет.ПолучитьОбласть("ОбластьЧерта");
	ОбластьДопЧерта				   = Макет.ПолучитьОбласть("ОбластьДопЧерта");	
	ОбластьДопПоле 				   = Макет.ПолучитьОбласть("ОбластьДопПоле");
	
	СоответствиеКвартал.Очистить();
	
	мТекущийМесяц = ДатаНачала;
	
	МесяцНедели = НачалоМесяца(НачалоНедели(мТекущийМесяц));
	
	НачатьСоСледующейНедели = Ложь;	
	
	СписокНедель = Новый СписокЗначений;
	
	Если мТекущийМесяц <> МесяцНедели Тогда
		
		МассивНедель  = Новый Массив;
		мНачалоНедели = НачалоНедели(НачалоНедели(мТекущийМесяц));
		мКонецНедели  = КонецНедели(НачалоНедели(мТекущийМесяц));
		
		СписокНедель.Добавить(мНачалоНедели);
		
		МассивНедель.Добавить(Новый Структура("ДатаНачалаНедели,ДатаОкончанияНедели",мНачалоНедели,мКонецНедели));
		
		НоваяСтрока = СоответствиеКвартал.Добавить();
		НоваяСтрока.ТекущийМесяц = МесяцНедели;
		НоваяСтрока.Недели.ЗагрузитьЗначения(МассивНедель);
		
		НачатьСоСледующейНедели = Истина;
		
	КонецЕсли; 
	
	Пока мТекущийМесяц <= ДатаОкончания Цикл
		
		МассивНедель = Новый Массив;
		
		Если НачатьСоСледующейНедели Тогда
			мНачалоНедели = НачалоНедели(КонецНедели(мТекущийМесяц)+24*60*60);
			мКонецНедели  = КонецНедели(мНачалоНедели);
		Иначе 
			мНачалоНедели = НачалоНедели(мТекущийМесяц);
			мКонецНедели  = КонецНедели(мТекущийМесяц);
		КонецЕсли; 
		
		Пока мНачалоНедели <= КонецМесяца(мТекущийМесяц) Цикл
			
			СписокНедель.Добавить(мНачалоНедели);
			
			МассивНедель.Добавить(Новый Структура("ДатаНачалаНедели,ДатаОкончанияНедели",мНачалоНедели,мКонецНедели));
			
			мНачалоНедели = НачалоНедели(мКонецНедели+24*60*60);
			мКонецНедели  = КонецНедели(мНачалоНедели);
			
		КонецЦикла; 
		
		НоваяСтрока = СоответствиеКвартал.Добавить();
		НоваяСтрока.ТекущийМесяц = мТекущийМесяц;
		НоваяСтрока.Недели.ЗагрузитьЗначения(МассивНедель);
		
		мТекущийМесяц = ДобавитьМесяц(мТекущийМесяц,1);
		
	КонецЦикла; 
	
	ТабличныйДокумент.Вывести(ОбластьШапкаВерх);
	
	НачалоКолонки = 5;
	КонецКолонки  = 4;
	
	Для каждого ПараметрМесяца Из СоответствиеКвартал Цикл
		
		мТекущийМесяц = ПараметрМесяца.ТекущийМесяц;
		
		мНедели = ПараметрМесяца.Недели.ВыгрузитьЗначения();
		
		Для мНеделя = 1 По мНедели.Количество() Цикл
			
			ОбластьМесяц.Параметры.Месяц = мТекущийМесяц;
			ТабличныйДокумент.Присоединить(ОбластьМесяц);
			
		КонецЦикла; 
		
		КонецКолонки = КонецКолонки + ?(мНедели.Количество() = 1, 1, мНедели.Количество()-1);
		
		ОбластьЯчейки = ТабличныйДокумент.Область("R1C"+Формат(НачалоКолонки,"ЧЦ=10; ЧГ=")+":R1C"+Формат(КонецКолонки,"ЧЦ=10; ЧГ=")+"");
		ОбластьЯчейки.Объединить();
		
		КонецКолонки = КонецКолонки+1;
		
		НачалоКолонки = КонецКолонки;
		
	КонецЦикла; 
	
	ПерваяНеделя = Истина;
	
	Для каждого ПараметрМесяца Из СоответствиеКвартал Цикл
		
		мНедели = ПараметрМесяца.Недели.ВыгрузитьЗначения();
		
		Для каждого мНеделя Из мНедели Цикл
			
			Если ПерваяНеделя Тогда
				
				ТабличныйДокумент.Вывести(ОбластьШапка);
				
				ПерваяНеделя = Ложь;
				
			КонецЕсли; 
			
			ОбластьНеделя.Параметры.Заполнить(мНеделя); 
			ТабличныйДокумент.Присоединить(ОбластьНеделя);
			
		КонецЦикла; 
		
	КонецЦикла; 
	
	ОбластьЯчейки = ТабличныйДокумент.Область("R1C1:R3C2");
	ОбластьЯчейки.Объединить();
	ОбластьЯчейки.Текст = "Модель";
	ОбластьЯчейки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ОбластьЯчейки.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
	                                  
	ОбластьЯчейки.ЦветТекста = ЦветТекстаОформления;	
	ОбластьЯчейки.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	
	ОбластьЯчейки = ТабличныйДокумент.Область("R1C3:R3C3");
	ОбластьЯчейки.Объединить();
	ОбластьЯчейки.Текст = "Кампания";
	ОбластьЯчейки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ОбластьЯчейки.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
	ОбластьЯчейки.ЦветТекста = ЦветТекстаОформления;	
	ОбластьЯчейки.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	
	ОбластьЯчейки = ТабличныйДокумент.Область("R1C4:R3C4");
	ОбластьЯчейки.Объединить();
	ОбластьЯчейки.Текст = "Затраты";
	ОбластьЯчейки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ОбластьЯчейки.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
	ОбластьЯчейки.ЦветТекста = ЦветТекстаОформления;	
	ОбластьЯчейки.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	
	ОбластьЯчейки = ТабличныйДокумент.Область("R1C5:R3C5");
	ОбластьЯчейки.Объединить();
	ОбластьЯчейки.Текст = "Дата нач/кон акции";
	ОбластьЯчейки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ОбластьЯчейки.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
	ОбластьЯчейки.ЦветТекста = ЦветТекстаОформления;	
	ОбластьЯчейки.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	
	ОбластьМедиаРесурсГод = Макет.ПолучитьОбласть("ОбластьМедиаРесурсГод");
	ОбластьИтогГод		  = Макет.ПолучитьОбласть("ОбластьИтогГод");	
	ОбластьКонтрагент	  = Макет.ПолучитьОбласть("ОбластьКонтрагент");
	
	ОбластьЕстьМакетИОтчет  = Макет.ПолучитьОбласть("ОбластьЕстьМакетИОтчет");
	ОбластьНетМакетаИОтчета = Макет.ПолучитьОбласть("ОбластьНетМакетаИОтчета");
	
	СписокНедель.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	
	ВыборкаДилерскихЦентров = ВыборкаОбщий.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДилерскихЦентров.Следующий() Цикл
		
		ОбластьКонтрагент.Параметры.Заполнить(ВыборкаДилерскихЦентров);
		ОбластьКонтрагент.Области.ОбластьКонтрагент.ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
		ОбластьКонтрагент.Области.ОбластьКонтрагент.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
		
		ТабличныйДокумент.Вывести(ОбластьКонтрагент);
		ТабличныйДокумент.НачатьГруппуСтрок();		
		
		Для А = 13 По СписокНедель.Количество() Цикл
			
			ОбластьДопПоле.Области.ОбластьДопПоле.ГраницаСлева  = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
			ОбластьДопПоле.Области.ОбластьДопПоле.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
			
			Если А = СписокНедель.Количество() Тогда
				ОбластьДопПоле.Области.ОбластьДопПоле.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
			КонецЕсли; 
			
			ТабличныйДокумент.Присоединить(ОбластьДопПоле);
			
		КонецЦикла; 
		
		ТабличныйДокумент.Вывести(ОбластьЧерта);
		
		Для А = 13 По СписокНедель.Количество() Цикл
			ТабличныйДокумент.Присоединить(ОбластьДопЧерта);
		КонецЦикла; 
		
		ВыборкаМедиаРесурс = ВыборкаДилерскихЦентров.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаМедиаРесурс.Следующий() Цикл
			
			ОбластьМедиаРесурсГод.Области.ОбластьМедиаРесурсГод.ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
			ОбластьМедиаРесурсГод.Области.ОбластьМедиаРесурсГод.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
			ОбластьМедиаРесурсГод.Параметры.Заполнить(ВыборкаМедиаРесурс);
			
			ТабличныйДокумент.Вывести(ОбластьМедиаРесурсГод);
			
			Для А = 13 По СписокНедель.Количество() Цикл
				
				ОбластьДопПоле.Области.ОбластьДопПоле.ГраницаСлева  = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
				ОбластьДопПоле.Области.ОбластьДопПоле.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
				
				Если А = СписокНедель.Количество() Тогда
					ОбластьДопПоле.Области.ОбластьДопПоле.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
				КонецЕсли; 
				
				ТабличныйДокумент.Присоединить(ОбластьДопПоле);
				
			КонецЦикла; 
			
			ТабличныйДокумент.НачатьГруппуСтрок();
			
			ТабличныйДокумент.Вывести(ОбластьЧерта);
			
			Для А = 13 По СписокНедель.Количество() Цикл
				ТабличныйДокумент.Присоединить(ОбластьДопЧерта);
			КонецЦикла; 
			
			ВыборкаКампании = ВыборкаМедиаРесурс.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаКампании.Следующий() Цикл
				
				ОбластьСтрокаРекламныхКампаний.Параметры.Заполнить(ВыборкаКампании);
				ОбластьСтрокаРекламныхКампаний.Параметры.ДатаНачала    = ВыборкаКампании.РекламнаяКампания.ДатаНачала;
				ОбластьСтрокаРекламныхКампаний.Параметры.ДатаОкончания = ВыборкаКампании.РекламнаяКампания.ДатаОкончания;
				ТабличныйДокумент.Вывести(ОбластьСтрокаРекламныхКампаний);
				
				Для каждого ЗначениеСписка Из СписокНедель Цикл
					
					мНеделя = ЗначениеСписка.Значение;
					
					Если мНеделя >= НачалоНедели(ВыборкаКампании.РекламнаяКампания.ДатаНачала) И мНеделя <= НачалоНедели(ВыборкаКампании.РекламнаяКампания.ДатаОкончания) Тогда
						ОбластьЕстьМакетИОтчет.Параметры.Заполнить(ВыборкаКампании);
						ТабличныйДокумент.Присоединить(ОбластьЕстьМакетИОтчет);
					Иначе 
						ТабличныйДокумент.Присоединить(ОбластьНетМакетаИОтчета);
					КонецЕсли;
					
				КонецЦикла; 
				
				ТабличныйДокумент.Вывести(ОбластьЧерта);
				
				Для А = 13 По СписокНедель.Количество() Цикл
					ТабличныйДокумент.Присоединить(ОбластьДопЧерта);
				КонецЦикла; 
				
			КонецЦикла; 
			
			ТабличныйДокумент.ЗакончитьГруппуСтрок();
			
		КонецЦикла;
		
		ТабличныйДокумент.ЗакончитьГруппуСтрок();
		
	КонецЦикла;	
	
	ВыборкаСтатусов = ПакетЗапросов[6].Выбрать();
	
	Пока ВыборкаСтатусов.Следующий() Цикл
		ОбъединитьЯчейкиПоСтатусам(ВыборкаСтатусов.Статус);
	КонецЦикла; 
	
	ОбластьИтогГод.Параметры.Заполнить(ВыборкаОбщий);
	
	ОбластьИтогГод.Области.ОбластьИтогГод.ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
	ОбластьИтогГод.Области.ОбластьИтогГод.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
	
	ТабличныйДокумент.Вывести(ОбластьИтогГод);
	
	Для А = 13 По СписокНедель.Количество() Цикл
		
		ОбластьДопПоле.Области.ОбластьДопПоле.ГраницаСлева  = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
		ОбластьДопПоле.Области.ОбластьДопПоле.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
		
		Если А = СписокНедель.Количество() Тогда
			ОбластьДопПоле.Области.ОбластьДопПоле.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
		КонецЕсли; 
		
		ТабличныйДокумент.Присоединить(ОбластьДопПоле);
		
	КонецЦикла; 
	
	ТабличныйДокумент.Вывести(ОбластьЧерта);
	
	Для А = 13 По СписокНедель.Количество() Цикл
		ТабличныйДокумент.Присоединить(ОбластьДопЧерта);
	КонецЦикла; 
	
	ВывестиОбозначенияСтатусов(Макет);
	
	ТабличныйДокумент.ФиксацияСверху = 3;
	ТабличныйДокумент.ФиксацияСлева  = 4;
	ТабличныйДокумент.АвтоМасштаб    = Истина;
	
КонецПроцедуры // СформироватьОтчетНаКварталСервере()

&НаСервере
Процедура СформироватьОтчетЗаМесяцНаСервере()
	
	ТабличныйДокумент.Очистить();
	
	Объект = РеквизитФормыВЗначение("ЭтаОбработка");
	Макет = Объект.ПолучитьМакет(СокрЛП(ВидОтчета));
	Объект = Неопределено;
	
	ПараметрыЗапроса = ПолучитьПараметрыЗапроса();
	
	ПакетЗапросов = СформироватьЗапрос(ПараметрыЗапроса);
	
	ВыборкаОбщий = ПакетЗапросов[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщий.Следующий();
	
	План_Данные   = ВыборкаОбщий.План;
	Факт_Данные   = ВыборкаОбщий.Факт;
	Дельта_Данные = ВыборкаОбщий.Дельта;
	
	ОбластьШапкаВерх 			   = Макет.ПолучитьОбласть("ОбластьШапкаВерх");
	ОбластьШапка 				   = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьСтрокаРекламныхКампаний = Макет.ПолучитьОбласть("ОбластьСтрокаРекламныхКампаний");
	ОбластьМесяцГод				   = Макет.ПолучитьОбласть("ОбластьМесяцГод_День");
	ОбластьДень				  	   = Макет.ПолучитьОбласть("ОбластьДень");
	ОбластьЧерта 				   = Макет.ПолучитьОбласть("ОбластьЧерта");
	ОбластьДопЧерта				   = Макет.ПолучитьОбласть("ОбластьДопЧерта_День");	
	ОбластьДопПоле 				   = Макет.ПолучитьОбласть("ОбластьДопПоле_День");
	
	ТабличныйДокумент.Вывести(ОбластьШапкаВерх);
	
	НачалоКолонки = 5;
	КонецКолонки  = 4;
	
	КоличествоДней = ?(ПакетЗапросов[5].Пустой(),ПолучитьРазностьДат(ДатаНачала,ДатаОкончания),ВыборкаОбщий.КоличествоДней);
	
	Для мДень = 1 По КоличествоДней Цикл
		
		ОбластьМесяцГод.Параметры.Месяц = ДатаНачала;
		ОбластьМесяцГод.Области.ОбластьМесяцГод_День.ГраницаСлева  = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
		ОбластьМесяцГод.Области.ОбластьМесяцГод_День.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
		
		Если мДень = КоличествоДней Тогда
			ОбластьМесяцГод.Области.ОбластьМесяцГод_День.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
		КонецЕсли; 
		
		ТабличныйДокумент.Присоединить(ОбластьМесяцГод);
		
	КонецЦикла; 
	
	ОбластьЯчейки = ТабличныйДокумент.Область("R1C6:R1C"+Формат(КоличествоДней+5,"ЧЦ=10; ЧГ=")+"");
	ОбластьЯчейки.Объединить();
	
	ОбластьЯчейки.Текст = Формат(ДатаНачала,"ДФ='MMMM yyyy ''года'''");
	
	ОбластьЯчейки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Для мДень = 1 По КоличествоДней Цикл
		
		ОбластьДень.Параметры.мДень = мДень;
		ТабличныйДокумент.Присоединить(ОбластьДень);
		
	КонецЦикла; 
	
	ОбластьЯчейки = ТабличныйДокумент.Область("R1C1:R3C2");
	ОбластьЯчейки.Объединить();
	ОбластьЯчейки.Текст = "Модель";
	ОбластьЯчейки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ОбластьЯчейки.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
	                                  
	ОбластьЯчейки.ЦветТекста = ЦветТекстаОформления;	
	ОбластьЯчейки.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	
	ОбластьЯчейки = ТабличныйДокумент.Область("R1C3:R3C3");
	ОбластьЯчейки.Объединить();
	ОбластьЯчейки.Текст = "Кампания";
	ОбластьЯчейки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ОбластьЯчейки.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
	ОбластьЯчейки.ЦветТекста = ЦветТекстаОформления;	
	ОбластьЯчейки.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	
	ОбластьЯчейки = ТабличныйДокумент.Область("R1C4:R3C4");
	ОбластьЯчейки.Объединить();
	ОбластьЯчейки.Текст = "Затраты";
	ОбластьЯчейки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ОбластьЯчейки.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
	ОбластьЯчейки.ЦветТекста = ЦветТекстаОформления;	
	ОбластьЯчейки.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	
	ОбластьЯчейки = ТабличныйДокумент.Область("R1C5:R3C5");
	ОбластьЯчейки.Объединить();
	ОбластьЯчейки.Текст = "Дата нач/кон акции";
	ОбластьЯчейки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ОбластьЯчейки.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
	ОбластьЯчейки.ЦветТекста = ЦветТекстаОформления;	
	ОбластьЯчейки.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	
	ОбластьМедиаРесурсГод = Макет.ПолучитьОбласть("ОбластьМедиаРесурсГод");
	ОбластьИтогГод		  = Макет.ПолучитьОбласть("ОбластьИтогГод");	
	ОбластьКонтрагент  	  = Макет.ПолучитьОбласть("ОбластьКонтрагент");	
	
	ОбластьЕстьМакетИОтчет  = Макет.ПолучитьОбласть("ОбластьЕстьМакетИОтчет_День");
	ОбластьНетМакетаИОтчета = Макет.ПолучитьОбласть("ОбластьНетМакетаИОтчета_День");
	
	ВыборкаДилерскихЦентров = ВыборкаОбщий.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДилерскихЦентров.Следующий() Цикл
		
		ОбластьКонтрагент.Параметры.Заполнить(ВыборкаДилерскихЦентров);
		ОбластьКонтрагент.Области.ОбластьКонтрагент.ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
		ОбластьКонтрагент.Области.ОбластьКонтрагент.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
		
		ТабличныйДокумент.Вывести(ОбластьКонтрагент);
		ТабличныйДокумент.НачатьГруппуСтрок();		
		
		Для А = 13 По КоличествоДней Цикл
			
			ОбластьДопПоле.Области.ОбластьДопПоле_День.ГраницаСлева  = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
			ОбластьДопПоле.Области.ОбластьДопПоле_День.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
			
			Если А = КоличествоДней Тогда
 				ОбластьДопПоле.Области.ОбластьДопПоле_День.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
			КонецЕсли; 
			
			ТабличныйДокумент.Присоединить(ОбластьДопПоле);
		КонецЦикла; 
		
		ТабличныйДокумент.Вывести(ОбластьЧерта);
		
		Для А = 13 По КоличествоДней Цикл
			ТабличныйДокумент.Присоединить(ОбластьДопЧерта);
		КонецЦикла; 
		
		ВыборкаМедиаРесурс = ВыборкаДилерскихЦентров.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаМедиаРесурс.Следующий() Цикл
			
			ОбластьМедиаРесурсГод.Параметры.Заполнить(ВыборкаМедиаРесурс);
			ОбластьМедиаРесурсГод.Области.ОбластьМедиаРесурсГод.ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
			ОбластьМедиаРесурсГод.Области.ОбластьМедиаРесурсГод.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
			ТабличныйДокумент.Вывести(ОбластьМедиаРесурсГод);
			
			Для А = 13 По КоличествоДней Цикл
				
				ОбластьДопПоле.Области.ОбластьДопПоле_День.ГраницаСлева  = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
				ОбластьДопПоле.Области.ОбластьДопПоле_День.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
				
				Если А = КоличествоДней Тогда
					ОбластьДопПоле.Области.ОбластьДопПоле_День.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
				КонецЕсли; 
				
				ТабличныйДокумент.Присоединить(ОбластьДопПоле);
			КонецЦикла; 
			
			ТабличныйДокумент.НачатьГруппуСтрок();
			
			ТабличныйДокумент.Вывести(ОбластьЧерта);
			
			Для А = 13 По КоличествоДней Цикл
				ТабличныйДокумент.Присоединить(ОбластьДопЧерта);
			КонецЦикла; 
			
			ВыборкаКампании = ВыборкаМедиаРесурс.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаКампании.Следующий() Цикл
				
				ОбластьСтрокаРекламныхКампаний.Параметры.Заполнить(ВыборкаКампании);
				ОбластьСтрокаРекламныхКампаний.Параметры.ДатаНачала    = ВыборкаКампании.РекламнаяКампания.ДатаНачала;
				ОбластьСтрокаРекламныхКампаний.Параметры.ДатаОкончания = ВыборкаКампании.РекламнаяКампания.ДатаОкончания;
				ТабличныйДокумент.Вывести(ОбластьСтрокаРекламныхКампаний);
				
				Для ДеньМесяца = 1 По КоличествоДней Цикл
					
					мДень = НачалоДня(Дата(Формат(ДатаНачала,"ДФ=yyyyMM")+Формат(ДеньМесяца,"ЧЦ=2; ЧН=01; ЧВН=; ЧГ=")));
					
					Если мДень >= НачалоДня(ВыборкаКампании.РекламнаяКампания.ДатаНачала) И мДень <= НачалоДня(ВыборкаКампании.РекламнаяКампания.ДатаОкончания) Тогда
						ОбластьЕстьМакетИОтчет.Параметры.Заполнить(ВыборкаКампании);
						ТабличныйДокумент.Присоединить(ОбластьЕстьМакетИОтчет);
					Иначе 
						ТабличныйДокумент.Присоединить(ОбластьНетМакетаИОтчета);
					КонецЕсли;
					
				КонецЦикла; 
				
				ТабличныйДокумент.Вывести(ОбластьЧерта);
				
				Для А = 13 По КоличествоДней Цикл
					ТабличныйДокумент.Присоединить(ОбластьДопЧерта);
				КонецЦикла; 
				
			КонецЦикла; 
			
			ТабличныйДокумент.ЗакончитьГруппуСтрок();
		КонецЦикла;
		ТабличныйДокумент.ЗакончитьГруппуСтрок();
	КонецЦикла;
	
	ВыборкаСтатусов = ПакетЗапросов[6].Выбрать();
	
	Пока ВыборкаСтатусов.Следующий() Цикл
		ОбъединитьЯчейкиПоСтатусам(ВыборкаСтатусов.Статус);
	КонецЦикла; 
	
	ОбластьИтогГод.Параметры.Заполнить(ВыборкаОбщий);
	ОбластьИтогГод.Области.ОбластьИтогГод.ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
	ОбластьИтогГод.Области.ОбластьИтогГод.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
	ТабличныйДокумент.Вывести(ОбластьИтогГод);
	
	Для А = 13 По КоличествоДней Цикл
		
		ОбластьДопПоле.Области.ОбластьДопПоле_День.ГраницаСлева  = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
		ОбластьДопПоле.Области.ОбластьДопПоле_День.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
		
		Если А = КоличествоДней Тогда
			ОбластьДопПоле.Области.ОбластьДопПоле_День.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
		КонецЕсли; 
		
		ТабличныйДокумент.Присоединить(ОбластьДопПоле);
		
	КонецЦикла; 
	
	ТабличныйДокумент.Вывести(ОбластьЧерта);
	
	Для А = 13 По КоличествоДней Цикл
		ТабличныйДокумент.Присоединить(ОбластьДопЧерта);
	КонецЦикла; 
	
	ВывестиОбозначенияСтатусов(Макет);
	
	ТабличныйДокумент.ФиксацияСверху = 3;
	ТабличныйДокумент.ФиксацияСлева  = 4;
	ТабличныйДокумент.АвтоМасштаб    = Истина;
	
КонецПроцедуры // СформироватьОтчетНаКварталСервере()

&НаСервере
Функция СформироватьЗапрос(ПараметрыЗапроса)
		
	Запрос = Новый Запрос;
	
	Для каждого ТекущийПараметр Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(ТекущийПараметр.Ключ,ТекущийПараметр.Значение);
	КонецЦикла; 
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РекламныеКампании.РекламнаяКампания КАК РекламнаяКампания,
	|	РекламныеКампании.ДилерскийЦентр КАК ДилерскийЦентр,
	|	РекламныеКампании.ТипКампании КАК ТипКампании,
	|	РекламныеКампании.Модель КАК Модель,
	|	РекламныеКампании.РекламнаяКампания.ДатаНачала КАК ДатаНачала,
	|	РекламныеКампании.РекламнаяКампания.ДатаОкончания КАК ДатаОкончания,
	|	РекламныеКампании.РекламнаяКампания.МедиаРесурс КАК МедиаРесурс,
	|	СУММА(РекламныеКампании.СуммаФактОборот) КАК СуммаФакт,
	|	СУММА(РекламныеКампании.СуммаПланОборот) КАК СуммаПлан
	|ПОМЕСТИТЬ ТаблицаКампаний
	|ИЗ
	|	РегистрНакопления.DMS_РекламныеКампании.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			,
	|			РекламнаяКампания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.DMS_ВидыОперацийРекламнойкампании.РазмещениеКампании)
	|				И (РекламнаяКампания = &РекламнаяКампания
	|					ИЛИ &РекламнаяКампания = ЗНАЧЕНИЕ(Документ.DMS_РекламнаяКампания.пустаяСсылка))
	|				И (ДилерскийЦентр = &ДилерскийЦентр
	|					ИЛИ &ДилерскийЦентр = ЗНАЧЕНИЕ(Справочник.CRM_ДилерскиеЦентры.пустаяСсылка))
	|				И (Модель = &Модель
	|					ИЛИ &Модель = ЗНАЧЕНИЕ(Справочник.Модели.пустаяСсылка))
	|				И (РекламнаяКампания.МедиаРесурс = &МедиаРесурс
	|					ИЛИ &МедиаРесурс = ЗНАЧЕНИЕ(Справочник.DMS_МедиаРесурсы.ПустаяСсылка))
	|				И (РекламнаяКампания.МедиаРесурс.ТипРазмещения = &ТипРазмещения
	|					ИЛИ &ТипРазмещения = ЗНАЧЕНИЕ(Перечисление.DMS_ТипыРазмещенияМедиа.ПустаяСсылка))
	|				И (Представитель = &Представитель
	|					ИЛИ &Представитель = ЗНАЧЕНИЕ(Справочник.DMS_Представители.пустаяссылка))
	|				И (РекламнаяКампания.КооперативнаяРеклама = ИСТИНА
	|						И &ВидРекламы = 1
	|					ИЛИ РекламнаяКампания.КооперативнаяРеклама = ЛОЖЬ
	|						И &ВидРекламы = 2
	|					ИЛИ &ВидРекламы = 0)) КАК РекламныеКампании
	|
	|СГРУППИРОВАТЬ ПО
	|	РекламныеКампании.Модель,
	|	РекламныеКампании.ТипКампании,
	|	РекламныеКампании.ДилерскийЦентр,
	|	РекламныеКампании.РекламнаяКампания,
	|	РекламныеКампании.РекламнаяКампания.ДатаОкончания,
	|	РекламныеКампании.РекламнаяКампания.ДатаНачала,
	|	РекламныеКампании.РекламнаяКампания.МедиаРесурс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаКампаний.РекламнаяКампания КАК РекламнаяКампания,
	|	ТаблицаКампаний.ДилерскийЦентр КАК ДилерскийЦентр,
	|	ТаблицаКампаний.ТипКампании КАК ТипКампании,
	|	ТаблицаКампаний.Модель КАК Модель,
	|	НАЧАЛОПЕРИОДА(ТаблицаКампаний.ДатаНачала, МЕСЯЦ) КАК ДатаНачала,
	|	НАЧАЛОПЕРИОДА(ТаблицаКампаний.ДатаОкончания, МЕСЯЦ) КАК ДатаОкончания,
	|	ТаблицаКампаний.МедиаРесурс КАК МедиаРесурс,
	|	ВЫБОР
	|		КОГДА &ПланФактДельта = 0
	|			ТОГДА ЕСТЬNULL(ТаблицаКампаний.СуммаПлан, 0)
	|		КОГДА &ПланФактДельта = 1
	|			ТОГДА ЕСТЬNULL(ТаблицаКампаний.СуммаФакт, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаКампаний.СуммаПлан, 0) - ЕСТЬNULL(ТаблицаКампаний.СуммаФакт, 0)
	|	КОНЕЦ КАК СуммаФакт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СтатусыМакетов.Статус, ЗНАЧЕНИЕ(Справочник.DMS_СтатусыМакетовРекламнойКампании.БезМакета)) = ЗНАЧЕНИЕ(Справочник.DMS_СтатусыМакетовРекламнойКампании.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьМакет,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СтатусыОтчетов.Статус, ЗНАЧЕНИЕ(Справочник.DMS_СтатусыОтчетовПоРекламнойКампании.БезОтчета)) = ЗНАЧЕНИЕ(Справочник.DMS_СтатусыОтчетовПоРекламнойКампании.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьОтчет,
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ТаблицаКампаний.ДатаНачала, ДЕНЬ), НАЧАЛОПЕРИОДА(ТаблицаКампаний.ДатаОкончания, ДЕНЬ), МЕСЯЦ) КАК КоличествоМесяцев,
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаНачала, МЕСЯЦ), КОНЕЦПЕРИОДА(&ДатаОкончанияВывода, МЕСЯЦ), ДЕНЬ) + 1 КАК КоличествоДней,
	|	ЕСТЬNULL(СтатусыМакетов.Статус, ЗНАЧЕНИЕ(Справочник.DMS_СтатусыМакетовРекламнойКампании.БезМакета)) КАК СтатусМакета,
	|	ЕСТЬNULL(СтатусыОтчетов.Статус, ЗНАЧЕНИЕ(Справочник.DMS_СтатусыОтчетовПоРекламнойКампании.Безотчета)) КАК СтатусОтчета,
	|	ЕСТЬNULL(СтатусыМакетов.Статус, ЗНАЧЕНИЕ(Справочник.DMS_СтатусыМакетовРекламнойКампании.Безмакета)) КАК КоличествоСтатусовМакета,
	|	ЕСТЬNULL(СтатусыОтчетов.Статус, ЗНАЧЕНИЕ(Справочник.DMS_СтатусыОтчетовПоРекламнойКампании.Безотчета)) КАК КоличествоСтатусовОтчета,
	|	ЕСТЬNULL(СтатусыМакетов.Статус.Вес, ВЫРАЗИТЬ(ЗНАЧЕНИЕ(Справочник.DMS_СтатусыМакетовРекламнойКампании.БезМакета) КАК Справочник.DMS_СтатусыМакетовРекламнойКампании).Вес) КАК СтатусМакетаВес,
	|	ЕСТЬNULL(СтатусыОтчетов.Статус.Вес, ВЫРАЗИТЬ(ЗНАЧЕНИЕ(Справочник.DMS_СтатусыОтчетовПоРекламнойКампании.БезОтчета) КАК Справочник.DMS_СтатусыОтчетовПоРекламнойКампании).Вес) КАК СтатусОтчетаВес,
	|	ЕСТЬNULL(ТаблицаКампаний.СуммаФакт, 0) КАК Факт,
	|	ЕСТЬNULL(ТаблицаКампаний.СуммаПлан, 0) КАК План,
	|	ЕСТЬNULL(ТаблицаКампаний.СуммаПлан, 0) - ЕСТЬNULL(ТаблицаКампаний.СуммаФакт, 0) КАК Дельта
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	ТаблицаКампаний КАК ТаблицаКампаний
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.DMS_СтатусыМакетовРекламныхКампаний.СрезПоследних КАК СтатусыМакетов
	|		ПО ТаблицаКампаний.РекламнаяКампания = СтатусыМакетов.РекламнаяКампания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.DMS_СтатусыОтчетовПоРекламнойКампании.СрезПоследних КАК СтатусыОтчетов
	|		ПО ТаблицаКампаний.РекламнаяКампания = СтатусыОтчетов.РекламнаяКампания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаКампаний
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Данные.РекламнаяКампания,
	|	Данные.Модель,
	|	Данные.МедиаРесурс,
	|	МАКСИМУМ(ЕСТЬNULL(Данные.СтатусМакетаВес, 0)) КАК СтатусМакетаВес,
	|	МАКСИМУМ(ЕСТЬNULL(Данные.СтатусОтчетаВес, 0)) КАК СтатусОтчетаВес
	|ПОМЕСТИТЬ ВесыСтатусов
	|ИЗ
	|	Данные КАК Данные
	|
	|СГРУППИРОВАТЬ ПО
	|	Данные.РекламнаяКампания,
	|	Данные.Модель,
	|	Данные.МедиаРесурс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Данные.СтатусМакета КАК Статус
	|ПОМЕСТИТЬ Статусы
	|ИЗ
	|	Данные КАК Данные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Данные.СтатусОтчета
	|ИЗ
	|	Данные КАК Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Данные.РекламнаяКампания КАК РекламнаяКампания,
	|	Данные.ДилерскийЦентр КАК ДилерскийЦентр,
	|	Данные.ТипКампании КАК ТипКампании,
	|	Данные.Модель КАК Модель,
	|	Данные.ДатаНачала,
	|	Данные.ДатаОкончания,
	|	Данные.МедиаРесурс КАК МедиаРесурс,
	|	Данные.СуммаФакт КАК СуммаФакт,
	|	Данные.ЕстьМакет КАК ЕстьМакет,
	|	Данные.ЕстьОтчет КАК ЕстьОтчет,
	|	Данные.КоличествоМесяцев КАК КоличествоМесяцев,
	|	Данные.КоличествоДней КАК КоличествоДней,
	|	ВЫБОР
	|		КОГДА Данные.СтатусМакета.Вес = ВесыСтатусов.СтатусМакетаВес
	|			ТОГДА Данные.СтатусМакета
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.DMS_СтатусыМакетовРекламнойКампании.ПустаяСсылка)
	|	КОНЕЦ КАК СтатусМакета,
	|	ВЫБОР
	|		КОГДА Данные.СтатусОтчета.Вес = ВесыСтатусов.СтатусОтчетаВес
	|			ТОГДА Данные.СтатусОтчета
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.DMS_СтатусыОтчетовПоРекламнойКампании.ПустаяСсылка)
	|	КОНЕЦ КАК СтатусОтчета,
	|	Данные.КоличествоСтатусовМакета КАК КоличествоСтатусовМакета,
	|	Данные.КоличествоСтатусовОтчета КАК КоличествоСтатусовОтчета,
	|	Данные.Модель КАК КоличествоМоделей,
	|	Данные.Факт КАК Факт,
	|	Данные.План КАК План,
	|	Данные.Дельта КАК Дельта,
	|	Данные.ДилерскийЦентр.Код КАК КодДилерскогоЦентра,
	|	НЕОПРЕДЕЛЕНО КАК БизнесРегион,
	|	Данные.РекламнаяКампания.ФорматМедиаРесурса КАК ФорматМедиаРесурса,
	|	Данные.РекламнаяКампания.КооперативнаяРеклама КАК КооперативнаяРеклама,
	|	Данные.РекламнаяКампания.Наименование КАК РекламнаяКампанияНаименование
	|ИЗ
	|	Данные КАК Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВесыСтатусов КАК ВесыСтатусов
	|		ПО Данные.РекламнаяКампания = ВесыСтатусов.РекламнаяКампания
	|			И Данные.Модель = ВесыСтатусов.Модель
	|			И Данные.МедиаРесурс = ВесыСтатусов.МедиаРесурс
	|			И Данные.СтатусМакетаВес = ВесыСтатусов.СтатусМакетаВес
	|			И Данные.СтатусОтчетаВес = ВесыСтатусов.СтатусОтчетаВес
	|
	|УПОРЯДОЧИТЬ ПО
	|	МедиаРесурс,
	|	Модель,
	|	РекламнаяКампания
	|ИТОГИ
	|	МАКСИМУМ(ТипКампании),
	|	ВЫБОР
	|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КоличествоМоделей) > 1
	|			ТОГДА ""Несколько моделей""
	|		ИНАЧЕ МАКСИМУМ(Модель)
	|	КОНЕЦ КАК Модель,
	|	СУММА(СуммаФакт),
	|	МАКСИМУМ(ЕстьМакет),
	|	МАКСИМУМ(ЕстьОтчет),
	|	МАКСИМУМ(КоличествоМесяцев),
	|	МАКСИМУМ(КоличествоДней),
	|	МАКСИМУМ(СтатусМакета),
	|	МАКСИМУМ(СтатусОтчета),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КоличествоСтатусовМакета),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КоличествоСтатусовОтчета),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КоличествоМоделей),
	|	СУММА(Факт),
	|	СУММА(План),
	|	СУММА(Дельта),
	|	МАКСИМУМ(КодДилерскогоЦентра),
	|	МАКСИМУМ(БизнесРегион),
	|	МАКСИМУМ(ФорматМедиаРесурса),
	|	МАКСИМУМ(КооперативнаяРеклама),
	|	МАКСИМУМ(РекламнаяКампанияНаименование)
	|ПО
	|	ОБЩИЕ,
	|	ДилерскийЦентр,
	|	МедиаРесурс,
	|	РекламнаяКампания
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Статусы.Статус КАК Статус
	|ИЗ
	|	Статусы КАК Статусы
	|ГДЕ
	|	Статусы.Статус <> ЗНАЧЕНИЕ(Справочник.DMS_СтатусыМакетовРекламнойКампании.ПустаяСсылка)
	|	И Статусы.Статус <> ЗНАЧЕНИЕ(Справочник.DMS_СтатусыОтчетовПоРекламнойКампании.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Статусы.Статус
	|
	|УПОРЯДОЧИТЬ ПО
	|	Статус
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	//Если Не ОтображенияДляПредставителя Тогда
	//
	//	Схема = Новый СхемаЗапроса;
	//	
	//	Схема.УстановитьТекстЗапроса(Запрос.Текст);
	//	
	//	ЗапросВыбора = Схема.ПакетЗапросов[7];
	//			
	//	ЗапросВыбора.КонтрольныеТочкиИтогов.Удалить(0);
	//	
	//КонецЕсли; 
	
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции // СформироватьЗапрос()

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОповещениеПослеВыбораПериода(Результат,ПутьКФайлу) Экспорт
	
	Если ТипЗнч(Результат) = Тип("СтандартныйПериод") Тогда
		ДатаНачалаВыгрузки 	  = Результат.ДатаНачала;
		ДатаОкончанияВыгрузки = Результат.ДатаОкончания;
	Иначе 
		Возврат;
	КонецЕсли; 
	
	Состояние("Начало выгрузки файла",,,БиблиотекаКартинок.ФорматExcel);
	
	ВыгрузитьВCSVНаСервере();
	
	Если СокрЛП(АдресФайла) <> "" Тогда
	
		ФайлВыгрузки = ПолучитьИзВременногоХранилища(АдресФайла);
		
		ФайлВыгрузки.Получить().Записать(ПутьКФайлу);
	
	КонецЕсли;
	
	Состояние("Выгрузка завершена",,,БиблиотекаКартинок.ФорматExcel);
	
КонецПроцедуры // ОповещениеПослеВыбора()
 
&НаСервереБезКонтекста
Функция ЗаполнитьСписокУровнейДетализацииПоГодам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РекламныеКампанииОбороты.ПериодГод КАК ПериодГод
	|ИЗ
	|	РегистрНакопления.DMS_РекламныеКампании.Обороты(, , Авто, ) КАК РекламныеКампанииОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодГод";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаГод = РезультатЗапроса.Выбрать();
	
	МассивВыбора = Новый Массив;
	
	Пока ВыборкаГод.Следующий() Цикл
		МассивВыбора.Добавить(Формат(ВыборкаГод.ПериодГод,"ДФ='yyyy ''год'''; ДП=-"));
	КонецЦикла;
	
	Возврат МассивВыбора;
	
КонецФункции // ЗаполнитьСписокУровнейДетализацииПоГодам()

&НаСервереБезКонтекста
Функция ПолучитьФинансовыйГод(Год)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Год", Год);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Год, ГОД), КВАРТАЛ, 1) КАК ДатаНачала,
	|	ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(НАЧАЛОПЕРИОДА(&Год, ГОД), КВАРТАЛ), ГОД, 1) КАК ДатаОкончания";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ФинансовыйГодПериод = Новый Структура("ДатаНачала,ДатаОкончания");
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ФинансовыйГодПериод,ВыборкаДетальныеЗаписи);	
		
	КонецЕсли; 
	
	Возврат ФинансовыйГодПериод;
	
КонецФункции // ПолучитьФинансовыйГод()

&НаСервереБезКонтекста
Функция ПолучитьРазностьДат(ДатаНачала,ДатаОкончания,Тип = "День")
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", 	ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",  ДатаОкончания);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РАЗНОСТЬДАТ(&ДатаНачала, &ДатаОкончания, "+Тип+")+1 КАК Разность";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Разность;
	
КонецФункции // ПолучитьРазностьДат()

&НаСервере
Процедура ОбъединитьЯчейкиПоСтатусам(Статус)
	
	ИмяСтатуса = СокрЛП(Статус);
	
	ТаблицаЯчеек = Новый ТаблицаЗначений;
	ТаблицаЯчеек.Колонки.Добавить("НомерСтроки",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10)));
	ТаблицаЯчеек.Колонки.Добавить("НомерКолонки",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10)));
	ТаблицаЯчеек.Колонки.Добавить("Текст",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100)));
	
	мОбласть = ТабличныйДокумент.НайтиТекст(ИмяСтатуса,,,,Истина);
	
	МассивИсключений = Новый Соответствие;
	
	Пока мОбласть <> Неопределено Цикл
		
		ОбозначениеСтроки = Лев(мОбласть.Имя,Найти(мОбласть.Имя,"C")-1);
		
		ОбозначениеКолонки = СтрЗаменить(мОбласть.Имя,ОбозначениеСтроки,"");
		
		НомерСтрока  = Число(СтрЗаменить(ОбозначениеСтроки,"R",""));
		НомерКолонки = Число(СтрЗаменить(ОбозначениеКолонки,"C",""));
		
		Если мОбласть.Расшифровка = Статус Тогда
			НоваяЗапись = ТаблицаЯчеек.Добавить();
			НоваяЗапись.НомерСтроки  = НомерСтрока;
			НоваяЗапись.НомерКолонки = НомерКолонки;
			НоваяЗапись.Текст 		 = мОбласть.Текст;
		Иначе 
			МассивИсключений.Вставить(мОбласть,мОбласть.Текст);
		КонецЕсли; 
		
		мОбласть.Текст = "";
		
		мОбласть = ТабличныйДокумент.НайтиТекст(ИмяСтатуса);		
		
	КонецЦикла; 
	
	Для каждого ЭлементИсключения Из МассивИсключений Цикл
		ЭлементИсключения.Ключ.Текст = ЭлементИсключения.Значение;
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаЯчеек",ТаблицаЯчеек);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаЯчеек.НомерСтроки,
	|	ТаблицаЯчеек.НомерКолонки,
	|	ТаблицаЯчеек.Текст
	|ПОМЕСТИТЬ мТаблицаЯчеек
	|ИЗ
	|	&ТаблицаЯчеек КАК ТаблицаЯчеек
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	мТаблицаЯчеек.НомерСтроки КАК НомерСтроки,
	|	МАКСИМУМ(мТаблицаЯчеек.НомерКолонки) КАК НомерКолонкиКонец,
	|	МАКСИМУМ(мТаблицаЯчеек.Текст) КАК Текст,
	|	МИНИМУМ(мТаблицаЯчеек.НомерКолонки) КАК НомерКолонкиНачало
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	мТаблицаЯчеек КАК мТаблицаЯчеек
	|
	|СГРУППИРОВАТЬ ПО
	|	мТаблицаЯчеек.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.НомерСтроки КАК НомерСтроки,
	|	ВТ.НомерКолонкиКонец КАК НомерКолонкиКонец,
	|	ВТ.Текст,
	|	ВТ.НомерКолонкиНачало КАК НомерКолонкиНачало
	|ИЗ
	|	ВТ КАК ВТ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	НомерКолонкиНачало,
	|	НомерКолонкиКонец";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ИмяОбласти = "R"+Формат(ВыборкаДетальныеЗаписи.НомерСтроки,"ЧЦ=10; ЧГ=")+"C"+Формат(ВыборкаДетальныеЗаписи.НомерКолонкиНачало,"ЧЦ=10; ЧГ=")+":"+"R"+Формат(ВыборкаДетальныеЗаписи.НомерСтроки,"ЧЦ=10; ЧГ=")+"C"+Формат(ВыборкаДетальныеЗаписи.НомерКолонкиКонец,"ЧЦ=10; ЧГ=");
		
		мОбласть = ТабличныйДокумент.Область(ИмяОбласти);
		
		мОбласть.Объединить();
		
		мОбласть.Текст 					 = СокрЛП(Статус.ПредставлениеВОтчете);
		мОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		мОбласть.ВертикальноеПоложение 	 = ВертикальноеПоложение.Центр;
		мОбласть.Гиперссылка = Истина;
		Если ТипЗнч(мОбласть.Расшифровка) = Тип("СправочникСсылка.DMS_СтатусыМакетовРекламнойКампании") 
			Или ТипЗнч(мОбласть.Расшифровка) = Тип("СправочникСсылка.DMS_СтатусыОтчетовПоРекламнойКампании") Тогда
			
			мЦветФона = мОбласть.Расшифровка.ЦветФона.Получить();
			
			Если мЦветФона <> Неопределено Тогда
				мОбласть.ЦветФона = мЦветФона;
			КонецЕсли; 
			
			мЦветТекста = мОбласть.Расшифровка.ЦветТекста.Получить();
			
			Если мЦветТекста <> Неопределено Тогда
				мОбласть.ЦветТекста = мЦветТекста;
			КонецЕсли; 
			
			мШрифтТекста = мОбласть.Расшифровка.ШрифтТекста.Получить();
			
			Если мШрифтТекста <> Неопределено Тогда
				мОбласть.Шрифт = мШрифтТекста;
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры // ОбъединитьЯчейкиПоСтатусам()

&НаСервере
Функция ПоместитьТабличныеДокументыВоВременноеХранилище(НастройкиСохранения)
	Перем ЗаписьZipФайла, ИмяАрхива;
	
	Результат = Новый Массив;
	
	// подготовка архива
	Если НастройкиСохранения.УпаковатьВАрхив Тогда
		ИмяАрхива = ПолучитьИмяВременногоФайла("zip");
		ЗаписьZipФайла = Новый ЗаписьZipФайла(ИмяАрхива);
	КонецЕсли;
	
	// подготовка временной папки
	ИмяВременнойПапки = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(ИмяВременнойПапки);
	ИспользованныеИменаФайлов = Новый Соответствие;
	
	ВыбранныеФорматыСохранения = НастройкиСохранения.ФорматыСохранения;
	ТаблицаФорматов = Renault_УправлениеПечатью.НастройкиФорматовСохраненияТабличногоДокумента();
	
	// сохранение печатных форм
	ОбработанныеПечатныеФормы = Новый Массив;
		
	ПечатнаяФорма = ТабличныйДокумент;
	
	Если ВычислитьИспользованиеВывода(ПечатнаяФорма) = ИспользованиеВывода.Запретить Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ПечатнаяФорма.Защита Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ПечатнаяФорма.ВысотаТаблицы = 0 Тогда
		Возврат Результат;
	КонецЕсли;
			
	Для Каждого ТипФайла Из ВыбранныеФорматыСохранения Цикл
		НастройкиФормата = ТаблицаФорматов.НайтиСтроки(Новый Структура("ТипФайлаТабличногоДокумента", ТипФайла))[0];
		
		ИмяФайла = ПолучитьИмяВременногоФайлаДляПечатнойФормы("КалендарьРекламныхКампаний",НастройкиФормата.Расширение,ИспользованныеИменаФайлов);
		
		ПолноеИмяФайла = УникальноеИмяФайла(Renault_ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяВременнойПапки) + ИмяФайла);
		ПечатнаяФорма.Записать(ПолноеИмяФайла, ТипФайла);
		
		Если ТипФайла = ТипФайлаТабличногоДокумента.HTML Тогда
			ВставитьКартинкиВHTML(ПолноеИмяФайла);
		КонецЕсли;
		
		Если ЗаписьZipФайла <> Неопределено Тогда 
			ЗаписьZipФайла.Добавить(ПолноеИмяФайла);
		Иначе
			ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
			ПутьВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
			ОписаниеФайла = Новый Структура;
			ОписаниеФайла.Вставить("Представление", ИмяФайла);
			ОписаниеФайла.Вставить("АдресВоВременномХранилище", ПутьВоВременномХранилище);
			Если ТипФайла = ТипФайлаТабличногоДокумента.ANSITXT Тогда
				ОписаниеФайла.Вставить("Кодировка", "windows-1251");
			КонецЕсли;
			Результат.Добавить(ОписаниеФайла);
		КонецЕсли;
	КонецЦикла;
	
	// Если архив подготовлен, записываем и помещаем его во временное хранилище.
	Если ЗаписьZipФайла <> Неопределено Тогда 
		ЗаписьZipФайла.Записать();
		ФайлАрхива = Новый Файл(ИмяАрхива);
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяАрхива);
		ПутьВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
		ОписаниеФайла = Новый Структура;
		ОписаниеФайла.Вставить("Представление", ПолучитьИмяФайлаДляАрхива());
		ОписаниеФайла.Вставить("АдресВоВременномХранилище", ПутьВоВременномХранилище);
		Результат.Добавить(ОписаниеФайла);
	КонецЕсли;
	
	УдалитьФайлы(ИмяВременнойПапки);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СохранитьПечатныеФормыВПапку(СписокФайловВоВременномХранилище, Знач Папка = "")
	
	#Если ВебКлиент Тогда
		Для Каждого ФайлДляЗаписи Из СписокФайловВоВременномХранилище Цикл
			ПолучитьФайл(ФайлДляЗаписи.АдресВоВременномХранилище, ФайлДляЗаписи.Представление);
		КонецЦикла;
		Возврат;
	#КонецЕсли
	
	Папка = Renault_ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(Папка);
	Для Каждого ФайлДляЗаписи Из СписокФайловВоВременномХранилище Цикл
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФайлДляЗаписи.АдресВоВременномХранилище);
		ДвоичныеДанные.Записать(УникальноеИмяФайла(Папка + ФайлДляЗаписи.Представление));
	КонецЦикла;
	
	Состояние(НСтр("ru='Сохранение успешно завершено';en='Save completed successfully'"), , НСтр("ru='в папку:';en='in folder:'") + " " + Папка);
	
КонецПроцедуры

&НаСервере
Функция ВычислитьИспользованиеВывода(мТабличныйДокумент)
	
	Если мТабличныйДокумент.Вывод = ИспользованиеВывода.Авто Тогда
		Возврат ?(ПравоДоступа("Вывод", Метаданные), ИспользованиеВывода.Разрешить, ИспользованиеВывода.Запретить);
	Иначе
		Возврат мТабличныйДокумент.Вывод;
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция УникальноеИмяФайла(ИмяФайла)
	
	Файл = Новый Файл(ИмяФайла);
	ИмяБезРасширения = Файл.ИмяБезРасширения;
	Расширение = Файл.Расширение;
	Папка = Файл.Путь;
	
	Счетчик = 1;
	Пока Файл.Существует() Цикл
		Счетчик = Счетчик + 1;
		Файл = Новый Файл(Папка + ИмяБезРасширения + " (" + Счетчик + ")" + Расширение);
	КонецЦикла;
	
	Возврат Файл.ПолноеИмя;

КонецФункции

&НаСервере
Функция ИмяФайлаПечатнойФормыПоУмолчанию(ОбъектПечати, НазваниеПечатнойФормы)
	
	ПараметрыДляВставки = Новый Структура;
	ПараметрыДляВставки.Вставить("НазваниеПечатнойФормы",НазваниеПечатнойФормы);
	ПараметрыДляВставки.Вставить("ПредставлениеОбъекта", Renault_ОбщегоНазначения.ПредметСтрокой(ОбъектПечати));
	ПараметрыДляВставки.Вставить("ТекущаяДата",Формат(ТекущаяДатаСеанса(), "ДЛФ=D"));
	Шаблон = НСтр("ru='[НазваниеПечатнойФормы] - [ПредставлениеОбъекта] - [ТекущаяДата]';en='[NazvaniePechatnoyFormy] - [PredstavlenieObekta] - [TekuschayaData]'");
	
	Возврат Renault_СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, ПараметрыДляВставки);
	
КонецФункции

&НаСервере
Функция ИмяФайлаПечатнойФормыОбъекта(ОбъектПечати, ИмяФайлаПечатнойФормы)
	Если ТипЗнч(ИмяФайлаПечатнойФормы) = Тип("Соответствие") Тогда
		Возврат Строка(ИмяФайлаПечатнойФормы[ОбъектПечати]);
	ИначеЕсли ТипЗнч(ИмяФайлаПечатнойФормы) = Тип("Строка") И Не ПустаяСтрока(ИмяФайлаПечатнойФормы) Тогда
		Возврат ИмяФайлаПечатнойФормы;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПолучитьИмяВременногоФайлаДляПечатнойФормы(ИмяМакета, Расширение, ИспользованныеИменаФайлов)
	
	ШаблонИмениФайла = "%1%2.%3";
	
	ИмяВременногоФайла = Renault_ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(
		Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонИмениФайла, ИмяМакета, "", Расширение));
		
	НомерИспользования = ?(ИспользованныеИменаФайлов[ИмяВременногоФайла] <> Неопределено,
							ИспользованныеИменаФайлов[ИмяВременногоФайла] + 1,
							1);
	
	ИспользованныеИменаФайлов.Вставить(ИмяВременногоФайла, НомерИспользования);
	
	// Если имя уже было ранее использовано, прибавляем счетчик в конце имени.
	Если НомерИспользования > 1 Тогда
		ИмяВременногоФайла = Renault_ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(
			Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонИмениФайла,
				ИмяМакета,
				" (" + НомерИспользования + ")",
				Расширение));
	КонецЕсли;
	
	Возврат ИмяВременногоФайла;
	
КонецФункции

&НаСервере
Процедура ВставитьКартинкиВHTML(ИмяФайлаHTML)
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент();
	ТекстовыйДокумент.Прочитать(ИмяФайлаHTML, КодировкаТекста.UTF8);
	ТекстHTML = ТекстовыйДокумент.ПолучитьТекст();
	
	ФайлHTML = Новый Файл(ИмяФайлаHTML);
	
	ИмяПапкиКартинок = ФайлHTML.ИмяБезРасширения + "_files";
	ПутьКПапкеКартинок = СтрЗаменить(ФайлHTML.ПолноеИмя, ФайлHTML.Имя, ИмяПапкиКартинок);
	
	// Ожидается, что в папке будут только картинки.
	ФайлыКартинок = НайтиФайлы(ПутьКПапкеКартинок, "*");
	
	Для Каждого ФайлКартинки Из ФайлыКартинок Цикл
		КартинкаТекстом = Base64Строка(Новый ДвоичныеДанные(ФайлКартинки.ПолноеИмя));
		КартинкаТекстом = "data:image/" + Сред(ФайлКартинки.Расширение,2) + ";base64," + Символы.ПС + КартинкаТекстом;
		
		ТекстHTML = СтрЗаменить(ТекстHTML, ИмяПапкиКартинок + "\" + ФайлКартинки.Имя, КартинкаТекстом);
	КонецЦикла;
		
	ТекстовыйДокумент.УстановитьТекст(ТекстHTML);
	ТекстовыйДокумент.Записать(ИмяФайлаHTML, КодировкаТекста.UTF8);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяФайлаДляАрхива()
	
	Результат = "";
	
	ПечатнаяФорма = ТабличныйДокумент;
	
	Если ВычислитьИспользованиеВывода(ПечатнаяФорма) = ИспользованиеВывода.Запретить Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = НСтр("ru='Документы';en='Documentation'");
	
	Возврат Результат + ".zip";
	
КонецФункции

&НаСервере
Процедура ВывестиОбозначенияСтатусов(Макет)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СтатусыМакетов.Ссылка КАК СтатусМакета,
		|	СтатусыМакетов.Вес КАК Вес,
		|	СтатусыМакетов.Наименование КАК Статус
		|ИЗ
		|	Справочник.DMS_СтатусыМакетовРекламнойКампании КАК СтатусыМакетов
		|
		|УПОРЯДОЧИТЬ ПО
		|	Вес УБЫВ,
		|	СтатусМакета";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОбластьЗаголовокОбозначенияСтатусаМакета = Макет.ПолучитьОбласть("ОбластьЗаголовокОбозначенияСтатусаМакета");
	ОбластьСтатусМакета 					 = Макет.ПолучитьОбласть("ОбластьСтатусМакета");
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовокОбозначенияСтатусаМакета);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ОбластьСтатусМакета.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ТабличныйДокумент.Вывести(ОбластьСтатусМакета);
		
		УстановитьПримерЗаполненияСтатусов("СтатусМакета",ВыборкаДетальныеЗаписи.СтатусМакета);
		
	КонецЦикла;
	
	//
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СтатусыОтчетов.Ссылка КАК СтатусОтчета,
		|	СтатусыОтчетов.Вес КАК Вес,
		|	СтатусыОтчетов.Наименование КАК Отчет
		|ИЗ
		|	Справочник.DMS_СтатусыОтчетовПоРекламнойКампании КАК СтатусыОтчетов
		|
		|УПОРЯДОЧИТЬ ПО
		|	Вес УБЫВ,
		|	СтатусОтчета";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОбластьЗаголовокОбозначенияСтатусаОтчета = Макет.ПолучитьОбласть("ОбластьЗаголовокОбозначенияСтатусаОтчета");
	ОбластьСтатусОтчета 					 = Макет.ПолучитьОбласть("ОбластьСтатусОтчета");
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовокОбозначенияСтатусаОтчета);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ОбластьСтатусОтчета.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ТабличныйДокумент.Вывести(ОбластьСтатусОтчета);
		
		УстановитьПримерЗаполненияСтатусов("СтатусОтчета",ВыборкаДетальныеЗаписи.СтатусОтчета);
		
	КонецЦикла;
	
КонецПроцедуры // ВывестиОбозначенияСтатусов()	

&НаСервере
Процедура УстановитьПримерЗаполненияСтатусов(ТекстПоиска,Статус)
		
	мОбласть = ТабличныйДокумент.НайтиТекст(ТекстПоиска,,,,Истина);
				
	мОбласть.Текст 					 = СокрЛП(Статус.ПредставлениеВОтчете);
	мОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	мОбласть.ВертикальноеПоложение 	 = ВертикальноеПоложение.Центр;
	
	Если ТипЗнч(мОбласть.Расшифровка) = Тип("СправочникСсылка.DMS_СтатусыМакетовРекламнойКампании") 
		Или ТипЗнч(мОбласть.Расшифровка) = Тип("СправочникСсылка.DMS_СтатусыОтчетовПоРекламнойКампании") Тогда
		
		мЦветФона = мОбласть.Расшифровка.ЦветФона.Получить();
		
		Если мЦветФона <> Неопределено Тогда
			мОбласть.ЦветФона = мЦветФона;
		КонецЕсли; 
		
		мЦветТекста = мОбласть.Расшифровка.ЦветТекста.Получить();
		
		Если мЦветТекста <> Неопределено Тогда
			мОбласть.ЦветТекста = мЦветТекста;
		КонецЕсли; 
		
		мШрифтТекста = мОбласть.Расшифровка.ШрифтТекста.Получить();
		
		Если мШрифтТекста <> Неопределено Тогда
			мОбласть.Шрифт = мШрифтТекста;
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры // ОбъединитьЯчейкиПоСтатусам()

&НаКлиенте
Процедура ТабличныйДокументПриАктивизацииОбласти(Элемент)
	
	ПодключитьОбработчикОжидания("ТабличныйДокументПриАктивизацииОбластиОжидание",0.1,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриАктивизацииОбластиОжидание()
	
	ТекущаяОбласть = Элементы.ТабличныйДокумент.ТекущаяОбласть;
	
	Если ТекущаяОбласть = Неопределено Тогда
		ТекущаяРекламнаяКампания = Неопределено;
		Возврат;
	КонецЕсли; 
	
	ИмяОбласти = ТекущаяОбласть.Имя;
	
	Попытка
		
		НомерСтроки  = Число(СтрЗаменить(Лев(ИмяОбласти,Найти(ИмяОбласти,"C")-1),"R",""));
		мКампания    = ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧЦ=10; ЧН=1; ЧГ=")+"C3:R"+Формат(НомерСтроки,"ЧЦ=10; ЧН=1; ЧГ=")+"C3").Расшифровка;
		
		Если мКампания = Неопределено Тогда
			НомерСтроки  = Число(СтрЗаменить(Лев(ИмяОбласти,Найти(ИмяОбласти,"C")-1),"R",""))-1;
			мКампания    = ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧЦ=10; ЧН=1; ЧГ=")+"C3:R"+Формат(НомерСтроки,"ЧЦ=10; ЧН=1; ЧГ=")+"C3").Расшифровка;
		КонецЕсли;
		
	Исключение
		Возврат;	
	КонецПопытки;
	
	Если ТипЗнч(мКампания) = Тип("ДокументСсылка.DMS_РекламнаяКампания")  Тогда
		ТекущаяРекламнаяКампания = мКампания;
		Элементы.ТабличныйДокументКонтекстноеМенюДобавитьМакет.Видимость = Истина;
		Элементы.ТабличныйДокументКонтекстноеМенюДобавитьОтчет.Видимость = Истина;
	Иначе 
		ТекущаяРекламнаяКампания = Неопределено;
		Элементы.ТабличныйДокументКонтекстноеМенюДобавитьМакет.Видимость = Ложь;
		Элементы.ТабличныйДокументКонтекстноеМенюДобавитьОтчет.Видимость = Ложь;
	КонецЕсли; 
	
КонецПроцедуры // ТабличныйДокументПриАктивизацииОбластиОжидание()

&НаСервере
Процедура ВыгрузитьВCSVНаСервере()
	
	Разделитель = ";";
	
	ПолноеИмяФайла = ПолучитьИмяВременногоФайла(".csv");
	
	ПараметрыЗапроса = ПолучитьПараметрыЗапроса(Истина);
	
	ПакетЗапросов = СформироватьЗапрос(ПараметрыЗапроса);
	
	ВыборкаОбщий = ПакетЗапросов[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщий.Следующий();
	
	ТекстВыгрузки = "";
	
	ТекстВыгрузки = ТекстВыгрузки + "N п/п"+Разделитель
	+"Dlr ID"+Разделитель
	+"Dealer"+Разделитель
	+"City"+Разделитель
	+"Модель"+Разделитель
	+"Тип компании"+Разделитель
	+"Кооп"+Разделитель
	+"Тип медиа"+Разделитель
	+"Медиа"+Разделитель
	+"Площадка размещения"+Разделитель
	+"Кампания"+Разделитель
	+"Дата начала"+Разделитель
	+"Дата окончания"+Разделитель
	+"ЦБ план"+Разделитель
	+"БД план"+Разделитель
	+"БД факт"+Разделитель
	+"БД факт неутвержденный"+Символы.ПС;

	НомерСтроки = 1;
	
	ВыборкаДилерскихЦентров = ВыборкаОбщий.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДилерскихЦентров.Следующий() Цикл
				
		ВыборкаМедиаРесурс = ВыборкаДилерскихЦентров.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаМедиаРесурс.Следующий() Цикл
						
			ВыборкаКампании = ВыборкаМедиаРесурс.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаКампании.Следующий() Цикл
				
				ТекстВыгрузки = ТекстВыгрузки + Формат(НомерСтроки,"ЧЦ=10; ЧН=0; ЧГ=") + Разделитель
				 + УдалитьЛидирующиеНулиИзНомераОбъекта(СокрЛП(ВыборкаКампании.КодДилерскогоЦентра)) + Разделитель
				 + СокрЛП(ВыборкаКампании.ДилерскийЦентр)     + Разделитель
				 + СокрЛП(ВыборкаКампании.БизнесРегион)   + Разделитель
				 + СокрЛП(ВыборкаКампании.Модель)   	  + Разделитель
				 + СокрЛП(ВыборкаКампании.ТипКампании)    + Разделитель
				 + Формат(ВыборкаКампании.КооперативнаяРеклама,"БЛ=Самостоятельная; БИ=КООП") + Разделитель
				 + СокрЛП(ВыборкаКампании.МедиаРесурс.ТипРазмещения) + Разделитель
				 + СокрЛП(ВыборкаКампании.МедиаРесурс)    + Разделитель
				 + СокрЛП(ВыборкаКампании.ФорматМедиаРесурса) + Разделитель
				 + СокрЛП(ВыборкаКампании.РекламнаяКампания)  + Разделитель
				 + ВыборкаКампании.РекламнаяКампания.ДатаНачала + Разделитель
				 + ВыборкаКампании.РекламнаяКампания.ДатаОкончания + Разделитель
				 //+ 0 					+ Разделитель
				 //+ ВыборкаКампании.План + Разделитель
				 //+ ВыборкаКампании.Факт + Разделитель
				 //+ 0    	  			+ Символы.ПС;
				 //+ Формат(ВыборкаКампании.ДатаНачала,"ДФ=dd.MM.yyyy; ДП=01.01.0001") + Разделитель
				 //+ Формат(ВыборкаКампании.ДатаОкончания,"ДФ=dd.MM.yyyy; ДП=01.01.0001") + Разделитель
				 + Формат(0,"ЧЦ=15; ЧДЦ=2; ЧН=0; ЧГ=")    + Разделитель
				 + Формат(ВыборкаКампании.План,"ЧЦ=15; ЧДЦ=2; ЧН=0; ЧГ=") + Разделитель
				 + Формат(ВыборкаКампании.Факт,"ЧЦ=15; ЧДЦ=2; ЧН=0; ЧГ=") + Разделитель
				 + Формат(0,"ЧЦ=15; ЧДЦ=2; ЧН=0; ЧГ=")    	  			  + Символы.ПС;
				 
			 КонецЦикла; 
			
		КонецЦикла;
		
	КонецЦикла; 
	
	ФайлВыгрузки = Новый ЗаписьТекста(ПолноеИмяФайла,КодировкаТекста.ANSI,Разделитель,Ложь);
		
	ФайлВыгрузки.ЗаписатьСтроку(ТекстВыгрузки);
	
	ФайлВыгрузки.Закрыть();
	
	Файл = Новый Файл(ПолноеИмяФайла);
	
	Если Файл.Существует() Тогда
		
		ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
		
		ХранилищеФайла = Новый ХранилищеЗначения(ДвоичныеДанные,Новый СжатиеДанных(9));
		
		АдресФайла = ПоместитьВоВременноеХранилище(ХранилищеФайла);
		
		УдалитьФайлы(ПолноеИмяФайла);
		
	Иначе 
		ЗаписьЖурналаРегистрации("Сохранение файла CSV",УровеньЖурналаРегистрации.Ошибка,,,"Не найден сохраненный файл");
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция УдалитьЛидирующиеНулиИзНомераОбъекта(Знач НомерОбъекта) Экспорт
	
	ПрефиксИнформационнойБазы = Лев(НомерОбъекта, 2);
	
	НомерОбъекта = СтрЗаменить(НомерОбъекта,ПрефиксИнформационнойБазы,"");
	
	Префикс = "";
	Номер = Сред(НомерОбъекта, 1);
	
	// Удаляем лидирующие нули слева в номере.
	Номер = Renault_СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(Номер, "0");
	
	Возврат Номер;
	
КонецФункции

//#КонецОбласти


