&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("ДилерскийЦентр", ДилерскийЦентр);
	Параметры.Свойство("ВидСообщения", ВидСообщения);  
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МассивМенеджеров = Renault_ОнлайнКонсультант.НастройкиАдресатовОнлайнКонсультант(ВидСообщения, ДилерскийЦентр);
	
	Для Каждого ЭлементМассива ИЗ МассивМенеджеров Цикл
		Стр = Сотрудники.Добавить();
		Стр.Сотрудник = ЭлементМассива;
	КонецЦикла;   	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Закрыть(ВыбраннаяСтрока.Сотрудник);  
КонецПроцедуры

&НаКлиенте
Процедура ОтделыПриИзменении(Элемент)
	МассивМенеджеров = Renault_ОнлайнКонсультант.НастройкиАдресатовОнлайнКонсультант(ВидСообщения, ДилерскийЦентр, Отдел);
	
	Сотрудники.Очистить();
	Для Каждого ЭлементМассива ИЗ МассивМенеджеров Цикл
		Стр = Сотрудники.Добавить();
		Стр.Сотрудник = ЭлементМассива;
	КонецЦикла;
КонецПроцедуры




