
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДоИзмененийЗначениеПриемника = ?(ЗначениеЗаполнено(Запись.ЗначениеПриемника),Запись.ЗначениеПриемника,Запись.УникальныйИдентификаторИсточника);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Сопоставлен = ЗначениеЗаполнено(ТекущийОбъект.ЗначениеПриемника);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ДоИзмененийЗначениеПриемника <> Запись.ЗначениеПриемника
		И ЗначениеЗаполнено(Запись.ЗначениеПриемника) Тогда
		
		Если ЗначениеЗаполнено(ТекущийОбъект.ЗначениеПриемника) Тогда
			
			Ссылка = ДоИзмененийЗначениеПриемника;
			ПравильныйЭлемент = ТекущийОбъект.ЗначениеПриемника;
			
			МассивПоиска = Новый Массив;
			МассивПоиска.Добавить(Ссылка);
			ТаблицаОбъектов = НайтиПоСсылкам(МассивПоиска);
						
			Для каждого СтрокаТаблицы Из ТаблицаОбъектов Цикл
				
				Если Не Метаданные.Подсистемы.DMS_СистемаДилерскогоМедиапланирования.Состав.Содержит(СтрокаТаблицы.Метаданные) Тогда
					Продолжить;
				КонецЕсли; 
				
				Если Метаданные.Документы.Содержит(СтрокаТаблицы.Метаданные) Тогда
					                                 //ТипЗНч(СтрокаТаблицы.Данные) = Тип("ДокументСсылка.DMS_РекламнаяКампания")
					ОбъектДанных = СтрокаТаблицы.Данные.ПолучитьОбъект();
					
					Для Каждого Реквизит Из СтрокаТаблицы.Метаданные.Реквизиты Цикл
						Если Реквизит.Тип.СодержитТип(ТипЗнч(Ссылка)) И ОбъектДанных[Реквизит.Имя] = Ссылка Тогда
							ОбъектДанных[Реквизит.Имя] = ПравильныйЭлемент;
						КонецЕсли;
					КонецЦикла;
					
					Для Каждого ТЧ ИЗ СтрокаТаблицы.Метаданные.ТабличныеЧасти Цикл
						Для Каждого Реквизит Из ТЧ.Реквизиты Цикл
							Если Реквизит.Тип.СодержитТип(ТипЗнч(Ссылка)) Тогда
								СтрокаТабЧасти = ОбъектДанных[ТЧ.Имя].Найти(Ссылка, Реквизит.Имя);
								Пока СтрокаТабЧасти <> Неопределено Цикл
									СтрокаТабЧасти[Реквизит.Имя] = ПравильныйЭлемент;
									СтрокаТабЧасти = ОбъектДанных[ТЧ.Имя].Найти(Ссылка, Реквизит.Имя);
								КонецЦикла;
							КонецЕсли;
						КонецЦикла;
					КонецЦикла;
					
					//Если СтрокаТаблицы.ПровестиДокумент Тогда
						
						Если ОбъектДанных.Проведен Тогда
							РежимЗаписи = РежимЗаписиДокумента.Проведение; 
						Иначе
							РежимЗаписи = РежимЗаписиДокумента.Запись;
						КонецЕсли;
						
						Попытка
							ОбъектДанных.Записать(РежимЗаписи);
						Исключение
							БылиИсключения = Истина;
						КонецПопытки;
						
					//КонецЕсли;
					
					ОбъектДанных = Неопределено;
					
				ИначеЕсли Метаданные.Справочники.Содержит(СтрокаТаблицы.Метаданные) Тогда
					
					ОбъектДанных = СтрокаТаблицы.Данные.ПолучитьОбъект();
					
					Если ОбъектДанных = Неопределено Тогда
						ОбъектДанных = СтрокаТаблицы.Данные.ПолучитьОбъект();
					КонецЕсли;
					
					Если СтрокаТаблицы.Метаданные.Владельцы.Содержит(Ссылка.Метаданные()) И ОбъектДанных.Владелец = Ссылка Тогда
						ОбъектДанных.Владелец = ПравильныйЭлемент;
					КонецЕсли;
					
					Если СтрокаТаблицы.Метаданные.Иерархический И ОбъектДанных.Родитель = Ссылка Тогда
						ОбъектДанных.Родитель = ПравильныйЭлемент;
					КонецЕсли;
					
					Для Каждого Реквизит Из СтрокаТаблицы.Метаданные.Реквизиты Цикл
						Если Реквизит.Тип.СодержитТип(ТипЗнч(Ссылка)) И ОбъектДанных[Реквизит.Имя] = Ссылка Тогда
							ОбъектДанных[Реквизит.Имя] = ПравильныйЭлемент;
						КонецЕсли;
					КонецЦикла;
					
					Для Каждого ТЧ ИЗ СтрокаТаблицы.Метаданные.ТабличныеЧасти Цикл
						Для Каждого Реквизит Из ТЧ.Реквизиты Цикл
							Если Реквизит.Тип.СодержитТип(ТипЗнч(Ссылка)) Тогда
								СтрокаТабЧасти = ОбъектДанных[ТЧ.Имя].Найти(Ссылка, Реквизит.Имя);
								Пока СтрокаТабЧасти <> Неопределено Цикл
									СтрокаТабЧасти[Реквизит.Имя] = ПравильныйЭлемент;
									СтрокаТабЧасти = ОбъектДанных[ТЧ.Имя].Найти(Ссылка, Реквизит.Имя);
								КонецЦикла;
							КонецЕсли;
						КонецЦикла;
					КонецЦикла;
					
					Попытка
						ОбъектДанных.Записать(РежимЗаписи);
					Исключение
						БылиИсключения = Истина;
					КонецПопытки;
						
				ИначеЕсли Метаданные.ПланыВидовХарактеристик.Содержит(СтрокаТаблицы.Метаданные)
					ИЛИ Метаданные.ПланыСчетов.Содержит(СтрокаТаблицы.Метаданные)
					ИЛИ Метаданные.ПланыВидовРасчета.Содержит(СтрокаТаблицы.Метаданные)
					ИЛИ Метаданные.Задачи.Содержит(СтрокаТаблицы.Метаданные)
					ИЛИ Метаданные.БизнесПроцессы.Содержит(СтрокаТаблицы.Метаданные) Тогда
					
					ОбъектДанных = СтрокаТаблицы.Данные.ПолучитьОбъект();
					
					Если ОбъектДанных = Неопределено Тогда
						ОбъектДанных = СтрокаТаблицы.Данные.ПолучитьОбъект();
					КонецЕсли;
					
					Для Каждого Реквизит Из СтрокаТаблицы.Метаданные.Реквизиты Цикл
						Если Реквизит.Тип.СодержитТип(ТипЗнч(Ссылка)) И ОбъектДанных[Реквизит.Имя] = Ссылка Тогда
							ОбъектДанных[Реквизит.Имя] = ПравильныйЭлемент;
						КонецЕсли;
					КонецЦикла;
					
					Для Каждого ТЧ ИЗ СтрокаТаблицы.Метаданные.ТабличныеЧасти Цикл
						Для Каждого Реквизит Из ТЧ.Реквизиты Цикл
							Если Реквизит.Тип.СодержитТип(ТипЗнч(Ссылка)) Тогда
								СтрокаТабЧасти = ОбъектДанных[ТЧ.Имя].Найти(Ссылка, Реквизит.Имя);
								Пока СтрокаТабЧасти <> Неопределено Цикл
									СтрокаТабЧасти[Реквизит.Имя] = ПравильныйЭлемент;
									СтрокаТабЧасти = ОбъектДанных[ТЧ.Имя].Найти(Ссылка, Реквизит.Имя);
								КонецЦикла;							
							КонецЕсли;
						КонецЦикла;
					КонецЦикла;
					
					Если Метаданные.Задачи.Содержит(СтрокаТаблицы.Метаданные) Тогда
						Для Каждого РеквизитАдресации Из СтрокаТаблицы.Метаданные.РеквизитыАдресации Цикл
							Если РеквизитАдресации.Тип.СодержитТип(ТипЗнч(Ссылка)) И ОбъектДанных[РеквизитАдресации.Имя] = Ссылка Тогда
								ОбъектДанных[РеквизитАдресации.Имя] = ПравильныйЭлемент;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					
					Попытка
						ОбъектДанных.Записать(РежимЗаписи);
					Исключение
						БылиИсключения = Истина;
					КонецПопытки;
						
				ИначеЕсли Метаданные.Константы.Содержит(СтрокаТаблицы.Метаданные) Тогда
					
					Константы[СтрокаТаблицы.Метаданные.Имя].Установить(ПравильныйЭлемент);
					
				ИначеЕсли Метаданные.РегистрыСведений.Содержит(СтрокаТаблицы.Метаданные) Тогда	
					
					Если СтрокаТаблицы.Метаданные = Метаданные.РегистрыСведений.DMS_СоответствияОбъектовИнформационныхБаз Тогда
						Продолжить;
					КонецЕсли; 
					
					СтруктураИзмерений = Новый Структура;
					НаборЗаписей = РегистрыСведений[СтрокаТаблицы.Метаданные.Имя].СоздатьНаборЗаписей();
					Для Каждого Измерение ИЗ СтрокаТаблицы.Метаданные.Измерения Цикл
						НаборЗаписей.Отбор[Измерение.Имя].Установить(СтрокаТаблицы.Данные[Измерение.Имя]);
						СтруктураИзмерений.Вставить(Измерение.Имя);
					КонецЦикла;
					Если СтрокаТаблицы.Метаданные.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
						НаборЗаписей.Отбор["Период"].Установить(СтрокаТаблицы.Данные.Период);
					КонецЕсли;
					НаборЗаписей.Прочитать();
					ТаблицаНабора = НаборЗаписей.Выгрузить();
					НаборЗаписей.Очистить();
					
					Попытка
						
						НаборЗаписей.Записать();
						
						Для Каждого Колонка ИЗ ТаблицаНабора.Колонки Цикл
							Если ТаблицаНабора[0][Колонка.Имя] = Ссылка Тогда
								ТаблицаНабора[0][Колонка.Имя] = ПравильныйЭлемент;
								Если СтруктураИзмерений.Свойство(Колонка.Имя) Тогда
									НаборЗаписей.Отбор[Колонка.Имя].Установить(ПравильныйЭлемент);
								КонецЕсли;
								
							КонецЕсли;
						КонецЦикла;
						
						НаборЗаписей.Загрузить(ТаблицаНабора);
						
						НаборЗаписей.Записать();
						
					Исключение
						БылиИсключения = Истина;
						ОтменитьТранзакцию();
						Продолжить;
					КонецПопытки;
					
				Иначе
					Сообщить("Ссылки типа "+СтрокаТаблицы.Метаданные+" не заменяются!!");
				КонецЕсли;
				
			КонецЦикла; 	
			
			ДоИзмененийЗначениеПриемника = ПравильныйЭлемент;	
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры
