
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
	//Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Функция СформироватьНаименование() Экспорт
	Строка = "";

	Если ЗначениеЗаполнено(НомерДоверенности) Тогда
		Строка = Строка + НомерДоверенности;
	КонецЕсли;

	Если ЗначениеЗаполнено(ДатаВыдачи) Тогда
		Строка = Строка + " от " + Формат(ДатаВыдачи,"ДФ=""дд.ММ.гггг""");
	КонецЕсли;

	Если ЗначениеЗаполнено(СрокДействия) Тогда
		Строка = Строка +" до " + Формат(СрокДействия,"ДФ=""дд.ММ.гггг""");
	КонецЕсли;

	Возврат Строка;
КонецФункции
