Процедура НормализоватьНомера() Экспорт

	ТекстЗапроса = "";
	Для каждого Вид Из Метаданные.Документы Цикл 
		Если Вид.Имя = "РабочийЛист" ИЛИ
			Вид.Имя = "Событие" ИЛИ
			Вид.Имя = "SMS" ИЛИ
			Вид.Имя = "Выписка" ИЛИ
 			Вид.Имя = "ПлатежноеПоручение" Тогда
 			Продолжить; 	
 		КонецЕсли;
 		Если ТекстЗапроса<>"" Тогда
			ТекстЗапроса=ТекстЗапроса+"
			|ОБЪЕДИНИТЬ ВСЕ";
		КонецЕсли; 
		ТекстЗапроса = ТекстЗапроса+"
		|ВЫБРАТЬ Ссылка
		|ИЗ Документ."+Вид.Имя+"
		|ГДЕ ПОДСТРОКА(Ссылка.Номер, 1, 10) <> СОКРЛП(Ссылка.Номер) И
		|Ссылка.Дата Между &ДатаНачала И &ДатаОкончания";
	КонецЦикла;
	
 	//ТекстЗапроса = ТекстЗапроса+"|УПОРЯДОЧИТЬ ПО Ссылка.Дата";
 	
	Запрос = Новый Запрос(ТекстЗапроса);

	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(ТекущаяДата()));

	ТЗ = Запрос.Выполнить().Выгрузить();
	
	//Бондаренко++ 20260124
 	ТЗ.Колонки.Добавить("Удалить", Новый ОписаниеТипов("Число"),"Удалить",10);
	
	Для каждого Стр Из ТЗ Цикл
		Если Сред(СокрЛП(Стр.Ссылка.Номер),5,1) = "V" Тогда
			Если СтрДлина(СокрЛП(Стр.Ссылка.Номер)) = 11 Тогда
 				Стр.Удалить = 1;
			КонецЕсли;	
 		КонецЕсли;	
 	КонецЦикла;
	
	СтруктураДляПоиска = Новый Структура("Удалить", 1);
 	МассивПустыхСтрок = ТЗ.НайтиСтроки(СтруктураДляПоиска);
	Для каждого Строка Из МассивПустыхСтрок Цикл
		ТЗ.Удалить(Строка);
	КонецЦикла;
	//Бондаренко-- 20260124
	
  	НомерСтроки = 0;
	Всего = ТЗ.Количество();
 	
	Для каждого Стр Из ТЗ Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
 		Док = Стр.Ссылка.ПолучитьОбъект();
		
  		Для жи = 1 По СтрДлина(Док.Номер) Цикл
			Если Найти("0123456789",Сред(Док.Номер,жи,1)) > 0 Тогда
				БуквеннаяЧасть = Сред(Док.Номер,1,жи-1);
				ЦифроваяЧасть  = Сред(Док.Номер,жи);
 				Прервать;
			КонецЕсли;   
		КонецЦикла;
		
		ЦифроваяЧасть  = СокрЛП(ЦифроваяЧасть);
		ЦифроваяЧастьЧ  = Число(ЦифроваяЧасть);
		ЦифроваяЧасть  = СтрЗаменить(ЦифроваяЧастьЧ,Символы.НПП,"");				
		ЦифроваяЧасть  = СМ_Ниссан.ДополнитьСтрокуЛ(ЦифроваяЧасть,10-СтрДлина(БуквеннаяЧасть),"0");
		
 		НовНомер = БуквеннаяЧасть+ЦифроваяЧасть;
		                                                              
 		Док.Комментарий = Док.Номер+" "+СокрЛП(Док.Комментарий);
		Док.Номер = НовНомер;
		
		Попытка
			Док.Записать(РежимЗаписиДокумента.Запись);
  		Исключение
 		КонецПопытки; 
  		
  	КонецЦикла;
	
КонецПроцедуры