
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Автомобиль  	= ?(Параметры.Свойство("Автомобиль"),	Параметры.Автомобиль,	Справочники.Автомобили.ПустаяСсылка());
	Нота		  	= РегистрыСведений.Renault_ЖурналПроверкиАКБ.ПолучитьЗначениеНоты(Автомобиль.VIN);
	
	МенеджерЗаписи = РегистрыСведений.Renault_ЖурналПроверкиАКБ.СоздатьМенеджерЗаписи();
	
	Если ЗначениеЗаполнено(Автомобиль) Тогда 
		
		МенеджерЗаписи.Автомобиль = Автомобиль;
		МенеджерЗаписи.Прочитать();
		
		ЗначениеВРеквизитФормы(МенеджерЗаписи, "Запись");
		ЕстьЗапись	= НЕ Запись.Автомобиль.Пустая();
		Запись.Автомобиль         		     	= Автомобиль;
		Запись.Нота		            		  	= МенеджерЗаписи.Нота;
		Запись.ДатаПроверкиПриПриеме		  	= МенеджерЗаписи.ДатаПроверкиПриПриеме;
		Запись.ДатаПроверки40Дней  		  		= МенеджерЗаписи.ДатаПроверки40Дней;
		Запись.ДатаПроверки80Дней  		  		= МенеджерЗаписи.ДатаПроверки80Дней;
		Запись.ДатаПроверки120Дней  		  	= МенеджерЗаписи.ДатаПроверки120Дней;
		Запись.ДатаПроверки160Дней	      		= МенеджерЗаписи.ДатаПроверки160Дней;
		Запись.НапряжениеПриПриеме   		  	= МенеджерЗаписи.НапряжениеПриПриеме;
		Запись.НапряжениеПриПроверке40Дней	  	= МенеджерЗаписи.НапряжениеПриПроверке40Дней;
		Запись.НапряжениеПриПроверке80Дней  	= МенеджерЗаписи.НапряжениеПриПроверке80Дней;
		Запись.НапряжениеПриПроверке120Дней  	= МенеджерЗаписи.НапряжениеПриПроверке120Дней;
		Запись.НапряжениеПриПроверке160Дней 	= МенеджерЗаписи.НапряжениеПриПроверке160Дней;

	КонецЕсли;
		 
	
	//НаборПроверок = РегистрыСведений.пац_ЖурналПроверкиАКБ.СоздатьНаборЗаписей();
	//НаборПроверок.Отбор.Автомобиль.Установить(Автомобиль);
	//НаборПроверок.Прочитать();
	
	
	
	
	//Если ЗначениеЗаполнено(Автомобиль) Тогда 
	//	
	//	МенеджерЗаписи.Автомобиль = Автомобиль;
	//	
	//	МенеджерЗаписи.Прочитать();
	//	
	//		//	
	//	
	//КонецЕсли;	
	
КонецПроцедуры
