
&НаКлиенте
Процедура кнОК(Команда)
	Если Не ЗначениеЗаполнено(ПричинаУпущенногоКлиента) Тогда
		Предупреждение("Не заполнено поле Причина упущенного клиента");
		Возврат;
	КонецЕсли;
	
	Если ВводПримечанияОбязателен(ПричинаУпущенногоКлиента) И Не ЗначениеЗаполнено(Текст) Тогда
		Предупреждение("Ввод комментария по данной причине является обязательным");
		Возврат;
	КонецЕсли;
	
	Ответ = Новый Структура;
	Ответ.Вставить("ТекстКомментарияУпущен", Текст);
	Ответ.Вставить("ПричинаУпущенногоКлиента", ПричинаУпущенногоКлиента);
	Закрыть(Ответ);
КонецПроцедуры

&НаКлиенте
Процедура кнОчистить(Команда)
	Текст = "";
	ПричинаУпущенногоКлиента = ПолучитьПустуюПричину();
	Ответ = Новый Структура;
	Ответ.Вставить("ТекстКомментарияУпущен", Текст); 
	Ответ.Вставить("ПричинаУпущенногоКлиента", ПричинаУпущенногоКлиента); 
	Закрыть(Ответ);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПустуюПричину()
	Возврат Справочники.CRM_ПричиныУпущенныхКлиентов.ПустаяСсылка();
КонецФункции

&НаСервереБезКонтекста
Функция ВводПримечанияОбязателен(ПричинаУпущенногоКлиента)
	Возврат ПричинаУпущенногоКлиента.ВводПримечанияОбязателен;
КонецФункции

&НаКлиенте
Процедура кнОтмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Контейнер.Заголовок = Заголовок;
КонецПроцедуры

&НаКлиенте
Процедура ПричинаУпущенногоКлиентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВыбора = Renault_CRM.ПолучитьПричиныУпущенныхКлиентов();
	
	ВыбранныйЭлемент = ВыбратьИзСписка(СписокВыбора, Элемент, СписокВыбора.НайтиПоЗначению(ПричинаУпущенногоКлиента));
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ПричинаУпущенногоКлиента = ВыбранныйЭлемент.Значение;
	КонецЕсли;

КонецПроцедуры
