
&НаКлиенте
Процедура Ок(Команда)
	ЕСли Не ЭтаФорма.Модифицированность Тогда
		ЭтаФорма.Закрыть();
		Возврат;
	КонецЕсли;
	ЕстьОшибки=Истина;
	Для Каждого Стр Из Статусы Цикл
		Если Стр.Пометка=Истина Тогда
			ЕстьОшибки=Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ЕстьОшибки Тогда 
		ПоказатьПредупреждение(,"Должен быть выбран хотябы один статус");
	Иначе	
		ЗаполнитьЗначенияСвойств(ЭтаФорма.ВладелецФормы.ЗаказыКлиентовОтбор,ЭтаФорма);
		ЭтаФорма.Закрыть(Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьЗначенияСвойств(ЭтаФорма,ЭтаФорма.ВладелецФормы.ЗаказыКлиентовОтбор);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииФормы(Элемент)
	ЭтаФорма.Модифицированность=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОтбор(Команда)
	ДатаЗаказаС='00010101';
	ДатаЗаказаПо='00010101';
	ДатаОтгрузкиС='00010101';
	ДатаОтгрузкиПо='00010101';
	Контрагент=?(ТипЗнч(Контрагент)=Тип("Строка"),"",ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"));
	Статусы.ЗаполнитьПометки(Истина);
	ЗаполнитьЗначенияСвойств(ЭтаФорма.ВладелецФормы.ЗаказыКлиентовОтбор,ЭтаФорма);
	ЭтаФорма.Закрыть(Истина);
	
КонецПроцедуры
