&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.РежимВыбора Тогда Элементы.Список.РежимВыбора=Истина КонецЕсли;
	ОтборСсылок();
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Реквизиты.Параметры.Элементы[0].Значение=?(Элементы.Список.ТекущаяСтрока=Неопределено,ВнешниеИсточникиДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблицы.Ссылки.ПустаяСсылка(),Элементы.Список.ТекущаяСтрока);
	Реквизиты.Параметры.Элементы[0].Использование=Истина;
КонецПроцедуры
&НаКлиенте
Процедура СписокПриИзменении(Элемент) СписокПриАктивизацииСтроки(Элемент) КонецПроцедуры
&НаКлиенте
Процедура СписокПослеУдаления(Элемент) СписокПриАктивизацииСтроки(Элемент) КонецПроцедуры

&НаКлиенте
Процедура ОбъектМДПриИзменении(Элемент) ОтборСсылок() КонецПроцедуры
Процедура ОтборСсылок()
	Список.Отбор.Элементы.Очистить();
	Отбор=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование=Не ОбъектМД.Пустая();
	Отбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ОбъектМД");
	Отбор.ПравоеЗначение=ОбъектМД;
	
	Элементы.ОбъектМД_.Видимость=ОбъектМД.Пустая();
КонецПроцедуры

&НаКлиенте
Процедура кнОбновить(Команда)
	Элементы.Список.Обновить();
	Элементы.Реквизиты.Обновить();
КонецПроцедуры

