
// Централизованные акции

Процедура Renault_ЗагрузкаЦентрализованныхАкций(Параметр1 = Неопределено) Экспорт
	
	//ОбработкаОбъект = Обработки.Renault_ЗагрузкаЦентрализованныхАкций.Создать();
	//ОбработкаОбъект.ПолучитьОбновления();
	ПолучитьОбновления_Акции();
	
КонецПроцедуры

Процедура ПолучитьОбновления_Акции() Экспорт
	
	ВебСервис = ПолучитьВебСервис_Акции();
	
	ИдентификаторИБ = Константы.Renault_BIR_db.Получить();
	Если НЕ ЗначениеЗаполнено(ИдентификаторИБ) Тогда
		Возврат;
	КонецЕсли;
	СтрокаБИРов = "";
	ВыборкаДЦ = Справочники.CRM_ДилерскиеЦентры.Выбрать();
	Пока ВыборкаДЦ.Следующий() Цикл
		Если ВыборкаДЦ.BIR <> "" И ВыборкаДЦ.ПометкаУдаления = Ложь Тогда
			СтрокаБИРов = СтрокаБИРов + ВыборкаДЦ.BIR + ";";
		КонецЕсли;
	КонецЦикла;
	Если Прав(СтрокаБИРов, 1) = ";" Тогда
		СтрокаБИРов = Лев(СтрокаБИРов, СтрДлина(СтрокаБИРов)-1);
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("BaseID", ИдентификаторИБ);
	СтруктураПараметров.Вставить("BIRArr", СтрокаБИРов);
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураПараметров);
	СтрокаЗапроса = ЗаписьJSON.Закрыть();
	
	Настройки = Renault_ОбщиеФункцииСервер.ПолучитьНастройкиПодключенияПоБренду(ПараметрыСеанса.DMS_Бренд);
	HTTPЗапрос = Новый HTTPЗапрос();
	HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапроса);
	HTTPЗапрос.АдресРесурса = Настройки.Адрес2 + "/hs/Actions/Changes";
	ЗащищенноеСоединениеOpenSSL = ?(Настройки.Настройки.ИспользоватьЗащищенноеСоединение,Новый ЗащищенноеСоединениеOpenSSL,Неопределено);
	Соединение = Новый HTTPСоединение(Настройки.Адрес1,,Настройки.ЛогинWS,Настройки.ПарольWS,,,ЗащищенноеСоединениеOpenSSL);
                
	ОтветHTTP = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	Тело = ОтветHTTP.ПолучитьТелоКакСтроку();
	Если ОтветHTTP.КодСостояния = 200 Тогда			
		ТаблицаДанных = Renault_ОбщиеФункцииСервер.ПолучитьЗначениеИзJSON(Тело);
	Иначе
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаДанных ИЗ ТаблицаДанных Цикл
		
		Поиск = Справочники.Renault_ЦентрализованныеАкции.НайтиПоРеквизиту("ЦентральныйИдентификатор", СтрокаДанных.СсылкаИдентификатор);
		
		// если изменена имеющаяся акция
		Если ЗначениеЗаполнено(Поиск) Тогда
			Запись = РегистрыСведений.CRM_НовостиДилеров.СоздатьМенеджерЗаписи();
			Запись.ДилерскийЦентр = Поиск.ДилерскийЦентр;
			Запись.ДатаНачалаПоказа = ТекущаяДата();
			Запись.ДатаОкончанияПоказа = ДобавитьМесяц(Запись.ДатаНачалаПоказа, 1);
			СтрокаИзменений = "";
			Для Каждого СтрокаМодели ИЗ СтрокаДанных.Модели Цикл
				ИскомаяСтрока = Поиск.Модели.Найти(СтрокаМодели.УИД, "ЦентральныйУИД");
				Если ИскомаяСтрока <> Неопределено Тогда
					Если ИскомаяСтрока.СтоимостьВсего <> СтрокаМодели.СтоимостьВсего Тогда
						СтрокаИзменений = СтрокаИзменений + "<P> По модели " + ИскомаяСтрока.Модель + " изменена стоимость. Новая стоимость: " + СтрокаМодели.СтоимостьВсего + "</P>";
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			ТекстНовости = "<HTML> <HEAD> </HEAD> <BODY> В акцию " + Поиск.Наименование + " внесены изменения";
			Если СтрокаИзменений <> "" Тогда
				ТекстНовости = ТекстНовости + СтрокаИзменений;
			КонецЕсли;
			ТекстНовости = ТекстНовости + "</BODY></HTML>";
			Запись.ЗаголовокНовости = "Централизованные акции: " + Поиск.Наименование;
			Запись.ТекстНовости = ТекстНовости;
			Запись.ДоступнаСервису = Истина;
			Запись.ИдентификаторНовости = Новый УникальныйИдентификатор;
			Запись.Записать();
			
		// если добавлена новая акция
		Иначе
			Запись = РегистрыСведений.CRM_НовостиДилеров.СоздатьМенеджерЗаписи();
			Запись.ДатаНачалаПоказа = ТекущаяДата();
			Запись.ДатаОкончанияПоказа = ДобавитьМесяц(Запись.ДатаНачалаПоказа, 1);
			Запись.ЗаголовокНовости = "Централизованные акции:" + СтрокаДанных.Наименование;
			Запись.ТекстНовости = "<HTML> <HEAD> </HEAD> <BODY> Добавлена новая акция</BODY></HTML>";
			Запись.ДоступнаСервису = Истина;
			Запись.ИдентификаторНовости = Новый УникальныйИдентификатор;
			Запись.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаписатьДанныеВБазу(ТаблицаДанных);
	
КонецПроцедуры

Процедура ЗаписатьДанныеВБазу(ТаблицаДанных)
	
	ВыборкаДЦ = Справочники.CRM_ДилерскиеЦентры.Выбрать();
	
	Пока ВыборкаДЦ.Следующий() Цикл
		
		Для Каждого Строка ИЗ ТаблицаДанных Цикл
			
			Если Строка.BIR <> ВыборкаДЦ.BIR Тогда
				Продолжить;
			КонецЕсли;
			
			Отбор = Новый Структура;
			Отбор.Вставить("ЦентральныйИдентификатор", Строка.СсылкаИдентификатор);
			//Отбор.Вставить("ДилерскийЦентр", ВыборкаДЦ.Ссылка);
			ВыборкаСпр = Справочники.Renault_ЦентрализованныеАкции.Выбрать(, ВыборкаДЦ.Ссылка, Отбор);
			Если ВыборкаСпр.Следующий() Тогда
				СпрОбъект = ВыборкаСпр.ПолучитьОбъект();
			Иначе
				СпрОбъект = Справочники.Renault_ЦентрализованныеАкции.СоздатьЭлемент();
				СпрОбъект.Владелец = ВыборкаДЦ.Ссылка;
				СпрОбъект.ДилерскийЦентр = ВыборкаДЦ.Ссылка;
				СпрОбъект.ЦентральныйИдентификатор = Строка.СсылкаИдентификатор;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СпрОбъект, Строка);
			Если ЗначениеЗаполнено(Строка.ТипАкции) Тогда
				СпрОбъект.ТипАкции = Перечисления.Renault_ТипыЦентрализованныхАкций[Строка.ТипАкции];
			КонецЕсли;
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВнешняяТаб.КомпенсацияДилеру,
			|	ВнешняяТаб.МодельАртикул,
			|	ВнешняяТаб.СкидкаВПроцентах,
			|	ВнешняяТаб.СкидкаВРублях,
			|	ВнешняяТаб.СтоимостьВсего,
			|	ВнешняяТаб.СтоимостьЗЧВсего,
			|	ВнешняяТаб.УИД,
			|	ВнешняяТаб.Примечание
			|ПОМЕСТИТЬ Врем
			|ИЗ &ВнешняяТаб КАК ВнешняяТаб
			|;
			|ВЫБРАТЬ
			|	Врем.КомпенсацияДилеру,
			|	Врем.МодельАртикул,
			|	Врем.СкидкаВПроцентах,
			|	Врем.СкидкаВРублях,
			|	Врем.СтоимостьВсего,
			|	Врем.СтоимостьЗЧВсего,
			|	Врем.УИД КАК ЦентральныйУИД,
			|	Врем.Примечание,
			|	Модели.УИД
			|ИЗ Врем КАК Врем
			|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_ЦентрализованныеАкции.Модели КАК Модели
			|	ПО Модели.ЦентральныйУИД = Врем.УИД
			|	И Модели.Ссылка = &Ссылка";
			Запрос.УстановитьПараметр("ВнешняяТаб", Строка.Модели);
			Запрос.УстановитьПараметр("Ссылка", СпрОбъект.Ссылка);
			Результат = Запрос.Выполнить().Выгрузить();
			СпрОбъект.Модели.Очистить();
			Отбор = Новый Структура;
			Отбор.Вставить("ЭтоРаботаДилера", Истина);
			РаботыДилера = СпрОбъект.Работы.Выгрузить(Отбор);
			СпрОбъект.Работы.Очистить();
			СпрОбъект.ВариантыКомплектации.Очистить();
			СпрОбъект.Номенклатура.Очистить();
			
			Для Каждого СтрокаМодели ИЗ Результат Цикл
				НоваяСтрокаМодель = СпрОбъект.Модели.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаМодель, СтрокаМодели);
				//НоваяСтрока.ЦентральныйУИД = СтрокаМодели.УИД;
				Если НоваяСтрокаМодель.УИД = "" Тогда
					НоваяСтрокаМодель.УИД = Новый УникальныйИдентификатор();
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаМодели.МодельАртикул) Тогда
					НоваяСтрокаМодель.Модель = Справочники.Модели.НайтиПоРеквизиту("Артикул", СтрокаМодели.МодельАртикул);
				КонецЕсли;
				//Если ЗначениеЗаполнено(СтрокаМодели.ВариантКомплектацииАртикул) Тогда
				//	НоваяСтрокаМодель.ВариантКомплектации = Справочники.ВариантыКомплектации.НайтиПоРеквизиту("Артикул", СтрокаМодели.ВариантКомплектацииАртикул);
				//КонецЕсли;
				//Если ЗначениеЗаполнено(СтрокаМодели.ТипДвигателя) Тогда
				//	НоваяСтрокаМодель.ТипДвигателя = Справочники.ТипыДвигателей.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаМодели.ТипДвигателя));
				//КонецЕсли;
				СтоимостьВсегоРаботы = 0;
				СтоимостьВсегоЗЧ = 0;
				Отбор = Новый Структура();
				Отбор.Вставить("УИД", НоваяСтрокаМодель.ЦентральныйУИД);
				МассивСтрок = Строка.Работы.НайтиСтроки(Отбор);
				Для Каждого СтрокаРаботы ИЗ МассивСтрок Цикл
					НоваяСтрока = СпрОбъект.Работы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаботы);
					НоваяСтрока.Работа = Справочники.Автоработы.НайтиПоРеквизиту("Артикул", СтрокаРаботы.Работа);
					НоваяСтрока.УИД = НоваяСтрокаМодель.УИД;
					СтоимостьВсегоРаботы = СтоимостьВсегоРаботы + НоваяСтрока.СтоимостьРаботы;
				КонецЦикла;
				Отбор = Новый Структура();
				Отбор.Вставить("УИД", НоваяСтрокаМодель.УИД);
				МассивСтрок = РаботыДилера.НайтиСтроки(Отбор);
				Для Каждого СтрокаРаботы ИЗ МассивСтрок Цикл
					НоваяСтрока = СпрОбъект.Работы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаботы);
					//НоваяСтрока.Работа = Справочники.Автоработы.НайтиПоРеквизиту("Артикул", СтрокаРаботы.Работа);
					НоваяСтрока.УИД = НоваяСтрокаМодель.УИД;
					Если НЕ СпрОбъект.СтоимостьВключаетРаботы Тогда
						СтоимостьВсегоРаботы = СтоимостьВсегоРаботы + НоваяСтрока.СтоимостьРаботы;
					КонецЕсли;
				КонецЦикла;
				Отбор = Новый Структура();
				Отбор.Вставить("УИД", НоваяСтрокаМодель.ЦентральныйУИД);
				МассивСтрок = Строка.Номенклатура.НайтиСтроки(Отбор);
				Для Каждого СтрокаНоменклатура ИЗ МассивСтрок Цикл
					НоваяСтрока = СпрОбъект.Номенклатура.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНоменклатура);
					НоваяСтрока.Реферанс = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", СтрокаНоменклатура.РеферансАртикул);
					НоваяСтрока.Артикул = СтрокаНоменклатура.РеферансАртикул;
					НоваяСтрока.УИД = НоваяСтрокаМодель.УИД;
					СтоимостьВсегоЗЧ = СтоимостьВсегоЗЧ + НоваяСтрока.Стоимость;
				КонецЦикла;
				МассивСтрок = Строка.ВариантыКомплектации.НайтиСтроки(Отбор);
				Для Каждого СтрокаВариант ИЗ МассивСтрок Цикл
					НоваяСтрока = СпрОбъект.ВариантыКомплектации.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВариант);
					НоваяСтрока.ВариантКомплектации = Справочники.ВариантыКомплектации.НайтиПоРеквизиту("Артикул", СтрокаВариант.ВариантКомплектацииАртикул);
					Если ЗначениеЗаполнено(СтрокаВариант.ТипДвигателя) Тогда
						НоваяСтрока.ТипДвигателя = Справочники.ТипыДвигателей.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаВариант.ТипДвигателя));
					КонецЕсли;
					НоваяСтрока.УИД = НоваяСтрокаМодель.УИД;
				КонецЦикла;
				НоваяСтрокаМодель.СтоимостьВсего = СтоимостьВсегоРаботы + СтоимостьВсегоЗЧ;
			КонецЦикла;
			СпрОбъект.Записать();
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьВебСервис_Акции()
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	
	АдресWS	 = Настройки.АдресWsGate;
	ПарольWS = Настройки.ПарольДоступаКВебСервисам;
	ЛогинWS = Настройки.ЛогинДоступаКВебСервисам;
	
	АдресWS = СтрЗаменить(АдресWS, "ws/Actions.ws?wsdl", "");
	ВСОпределение = Новый WSОпределения(СокрЛП(АдресWS) + "ws/Actions.ws?wsdl",
									СокрЛП(ЛогинWS), СокрЛП(ПарольWS));
	ВебСервис = Новый WSПрокси(ВСОпределение, "http://renault-nissan.com/schema/actions", 
							   "Renault_Actions", "Renault_ActionsSoap12");
	ВебСервис.Пользователь	 = СокрЛП(ЛогинWS);
	ВебСервис.Пароль		 = СокрЛП(ПарольWS);
	
	Возврат ВебСервис;
	
КонецФункции

// Новости дилеров

Процедура Renault_ЗагрузкаНовостей(Параметр1 = Неопределено) Экспорт
	
	ОбработкаОбъект = Обработки.Renault_РаботаСНовостямиДилеров.Создать();
	ОбработкаОбъект.ОбработкаНаСервере();
	
	РегистрыСведений.DMS_МониторингРегламентныхЗаданий.ЗавершениеЗадания(
	ПредопределенноеЗначение("Справочник.DMS_НастройкаРегламентныхЗаданий.ЗагрузкаНовостей"),
	ТекущаяДатаСеанса());

КонецПроцедуры

// Кредитные предложения

Процедура Renault_ЗагрузкаКредитныхПредложений_old(Параметр1 = Неопределено) Экспорт
	РНБанк=Справочники.Renault_КредитныеПредложения.РНБанк();
	
	ВебСервис = ПолучитьВебСервис_RenaultCredit();
	
	СтрокаБИР = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_ДилерскиеЦентры.BIR
	|ИЗ
	|	Справочник.CRM_ДилерскиеЦентры КАК CRM_ДилерскиеЦентры
	|ГДЕ
	|	CRM_ДилерскиеЦентры.ПометкаУдаления = ЛОЖЬ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.BIR) Тогда
			СтрокаБИР = СтрокаБИР + Выборка.BIR + ";";
		КонецЕсли;
	КонецЦикла;
	
	Если Прав(СтрокаБИР, 1) = ";" Тогда
		СтрокаБИР = Лев(СтрокаБИР, СтрДлина(СтрокаБИР)-1);
	КонецЕсли;
	
	Данные = ВебСервис.GetCreditTarifs(СтрокаБИР);
	СервисФабрика = ВебСервис.ФабрикаXDTO;
	Сериализатор = Новый СериализаторXDTO(СервисФабрика);
	Результат = Сериализатор.ПрочитатьXDTO(Данные);
	
	ТаблицаТипыСервисов = Результат.Найти("ТаблицаТипыСервисов", "Имя").Значение;
	Для Каждого СтрокаТипСервиса ИЗ ТаблицаТипыСервисов Цикл
		НоваяСсылка = Справочники.CRM_ТипыКредитныхСервисов.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТипСервиса.СервисТипИдентификатор));
		Если НоваяСсылка.ПолучитьОбъект() = Неопределено Тогда
			НовОбъект = Справочники.CRM_ТипыКредитныхСервисов.СоздатьЭлемент();
			НовОбъект.УстановитьСсылкуНового(НоваяСсылка);
			ЗаполнитьЗначенияСвойств(НовОбъект, СтрокаТипСервиса);
			НовОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаСервисы = Результат.Найти("ТаблицаСервисы", "Имя").Значение;
	Для Каждого СтрокаСервиса ИЗ ТаблицаСервисы Цикл
		Попытка
			НоваяСсылка = Справочники.CRM_КредитныеСервисы.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаСервиса.СервисИдентификатор));
			Если НоваяСсылка.ПолучитьОбъект() = Неопределено Тогда
				НовОбъект = Справочники.CRM_КредитныеСервисы.СоздатьЭлемент();
				НовОбъект.УстановитьСсылкуНового(НоваяСсылка);
				ЗаполнитьЗначенияСвойств(НовОбъект, СтрокаСервиса);
				НовОбъект.Сервис_Тип = Справочники.CRM_ТипыКредитныхСервисов.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаСервиса.СервисТипИдентификатор));
				Если ЗначениеЗаполнено(НовОбъект.Сервис_Тип) Тогда
					Если НовОбъект.Сервис_Тип.Тип_Код = "payments_protection" Тогда
						Если Найти(НовОбъект.Сервис_Код, "FULL") <> 0 Тогда
							НовОбъект.ПакетЗащитыКредита = Перечисления.CRM_ПакетыЗащитыКредита.Полный;
						ИначеЕсли Найти(НовОбъект.Сервис_Код, "MIN") <> 0 Тогда
							НовОбъект.ПакетЗащитыКредита = Перечисления.CRM_ПакетыЗащитыКредита.Минимальный;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				НовОбъект.Записать();
			КонецЕсли;
			Если Найти(НоваяСсылка.Наименование, "Разумное") <> 0 Тогда
				Программа = Справочники.CRM_СтраховыеПрограммы.НайтиПоНаименованию(НоваяСсылка.Наименование);
				Если НЕ ЗначениеЗаполнено(Программа) Тогда
					ПрограммаОбъект = Справочники.CRM_СтраховыеПрограммы.СоздатьЭлемент();
					ПрограммаОбъект.КредитныйСервис = НоваяСсылка;
					ПрограммаОбъект.Наименование = НоваяСсылка.Наименование;
					ПрограммаОбъект.Владелец=Справочники.CRM_СтраховыеКомпании.ОсновнаяСтраховаяКомпания;
					//ПрограммаОбъект.Владелец= Справочники.CRM_СтраховыеКомпании.НайтиПоКоду("000000001");
					Поиск = Найти(НоваяСсылка.Сервис_Код, "_YEAR");
					Если Поиск <> 0 Тогда
						Срок = Сред(НоваяСсылка.Сервис_Код, Поиск-1, 1);
						ПрограммаОбъект.СрокСтрахования = Число(Срок);
					КонецЕсли;
					ПрограммаОбъект.Записать();
				КонецЕсли;
				//НовОбъект.ПоддерживаетРазумноеКАСКО = Истина;
			КонецЕсли;
		Исключение
			ЗаписьЖурналаРегистрации("Загрузка Кредитов", УровеньЖурналаРегистрации.Ошибка, , , НоваяСсылка.Сервис_Код + "-" + Срок);
		КонецПопытки;
	КонецЦикла;
	
	ТаблицаДанных = Результат.Найти("ТаблицаДанные", "Имя").Значение;
	
	Для Каждого СтрокаДанных ИЗ ТаблицаДанных Цикл
		
		НоваяСсылка=Справочники.Renault_КредитныеПредложения.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаДанных.СсылкаИдентификатор));
		Если НоваяСсылка.ПолучитьОбъект()=Неопределено Тогда
			
			НовОбъект = Справочники.Renault_КредитныеПредложения.СоздатьЭлемент();
			Если РНБанк <> Неопределено Тогда
				НовОбъект.Владелец = РНБанк;
			КонецЕсли;
			НовОбъект.УстановитьСсылкуНового(НоваяСсылка);
			//НовОбъект.ДатаНачалаПредложения = СтрокаДанных.ДатаНачалаПредложения;
			//НовОбъект.ДатаОкончанияПредложения = СтрокаДанных.ДатаОкончанияПредложения;
			//НовОбъект.ДляНовогоАвтомобиля = СтрокаДанных.ДляНовогоАвтомобиля;
			//НовОбъект.ДляНовогоАвтомобиля = СтрокаДанных.ДляНовогоАвтомобиля;
			ЗаполнитьЗначенияСвойств(НовОбъект, СтрокаДанных);
			
			Для Каждого СтрокаМодели ИЗ СтрокаДанных.Модели Цикл
				НоваяСтрока = НовОбъект.Модели.Добавить();
				НоваяСтрока.Выбрана = СтрокаМодели.Выбрана;
				НоваяСтрока.Модель = Справочники.Модели.НайтиПоРеквизиту("Артикул", СтрокаМодели.МодельАртикул);
				Комплектация = Справочники.ВариантыКомплектации.НайтиПоРеквизиту("Артикул", СтрокаМодели.КомплектацияАртикул);
				Если ЗначениеЗаполнено(Комплектация) Тогда
					НоваяСтрока.Комплектация = Комплектация;
					НоваяСтрока.КомплектацияНаименование = Комплектация.Наименование;
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого СтрокаСтавки ИЗ СтрокаДанных.КредитныеСтавки Цикл
				НоваяСтрока = НовОбъект.КредитныеСтавки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСтавки);
			КонецЦикла;
			
			Для Каждого Строка ИЗ СтрокаДанных.ДоступныеСервисы Цикл
				НоваяСтрока = НовОбъект.ДоступныеСервисы.Добавить();
				Сервис = Справочники.CRM_КредитныеСервисы.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.СсылкаИдентификатор));
				//СервисОбъект = Сервис.ПолучитьОбъект();
				//Если СервисОбъект = Неопределено Тогда
				//	СервисОбъект = Справочники.CRM_КредитныеСервисы.СоздатьЭлемент();
				//	СервисОбъект.УстановитьСсылкуНового(Сервис);
				//	СервисОбъект.Наименование = Строка.СервисНаименование;
				//	СервисОбъект.ИД = Строка.СервисИД;
				//	СервисОбъект.Сервис_Код = Строка.СервисСервис_Код;
				//	СервисТип = Справочники.CRM_ТипыКредитныхСервисов.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.ТипИдентификатор));
				//	//ТипСервисаОбъект = СервисТип.ПолучитьОбъект();
				//	СервисОбъект.Сервис_Тип = СервисТип;
				//	СервисОбъект.Записать();
					Если Найти(Строка.СервисНаименование, "Разумное") <> 0 Тогда
				//		Программа = Справочники.CRM_СтраховыеПрограммы.НайтиПоНаименованию(Строка.СервисНаименование);
				//		Если НЕ ЗначениеЗаполнено(Программа) Тогда
				//			ПрограммаОбъект = Справочники.CRM_СтраховыеПрограммы.СоздатьЭлемент();
				//			ПрограммаОбъект.КредитныйСервис = Сервис;
				//			ПрограммаОбъект.Наименование = Строка.СервисНаименование;
				//			ПрограммаОбъект.Владелец = Справочники.CRM_СтраховыеКомпании.НайтиПоКоду("000000001");
				//			Поиск = Найти(Строка.СервисСервис_Код, "_YEAR");
				//			Если Поиск <> 0 Тогда
				//				Срок = Сред(Строка.СервисСервис_Код, Поиск-1, 1);
				//				ПрограммаОбъект.СрокСтрахования = Число(Срок);
				//			КонецЕсли;
				//			ПрограммаОбъект.Записать();
				//		КонецЕсли;
						НовОбъект.ПоддерживаетРазумноеКАСКО = Истина;
					КонецЕсли;
				//КонецЕсли;
				НоваяСтрока.Сервис = Сервис;
			КонецЦикла;
			
			Для Каждого Строка ИЗ СтрокаДанных.НеобходимыеТипыСервиса Цикл
				НоваяСтрока = НовОбъект.НеобходимыеТипыСервиса.Добавить();
				ТипСервиса = Справочники.CRM_ТипыКредитныхСервисов.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.СсылкаИдентификатор));
				ТипСервисаОбъект = ТипСервиса.ПолучитьОбъект();
				//Если ТипСервисаОбъект = Неопределено Тогда
				//	ТипСервисаОбъект = Справочники.CRM_ТипыКредитныхСервисов.СоздатьЭлемент();
				//	ТипСервисаОбъект.УстановитьСсылкуНового(ТипСервиса);
				//	ТипСервисаОбъект.Наименование = Строка.ТипСервисаНаименование;
				//	ТипСервисаОбъект.ИД = Строка.ТипСервисаИД;
				//	ТипСервисаОбъект.Тип_Код = Строка.ТипСервисаТип_Код;
				//	ТипСервисаОбъект.Записать();
				//КонецЕсли;
				НоваяСтрока.ТипСервиса = ТипСервиса;
			КонецЦикла;
			НовОбъект.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаСтоимость = Результат.Найти("ТаблицаСтоимость", "Имя").Значение;
	
	//Данные = ВебСервис.GetPrices();
	//СервисФабрика = ВебСервис.ФабрикаXDTO;
	//Сериализатор = Новый СериализаторXDTO(СервисФабрика);
	//ТаблицаДанных = Сериализатор.ПрочитатьXDTO(Данные);
	//
	Для Каждого СтрокаЦен ИЗ ТаблицаСтоимость Цикл
		Запись = РегистрыСведений.CRM_КредитныеТарифы.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, СтрокаЦен);
		Сервис = Справочники.CRM_КредитныеСервисы.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаЦен.СервисИдентификатор));
		Модель = Справочники.Модели.НайтиПоРеквизиту("Артикул", СтрокаЦен.МодельАртикул);
		Запись.Сервис = Сервис;
		Запись.Модель = Модель;
		Запись.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьВебСервис_RenaultCredit()
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	
	ПарольWS = Настройки.ПарольДоступаКВебСервисам;
	ЛогинWS = Настройки.ЛогинДоступаКВебСервисам;
	
	АдресWS = Настройки.КЦАдресСервера;
	СообщениеОбОшибке = "";
	
	ВСОпределение = Новый WSОпределения(СокрЛП(АдресWS) + "ws/RenaultCredit.ws?wsdl",
									СокрЛП(ЛогинWS), СокрЛП(ПарольWS));
	
	ВебСервис = Новый WSПрокси(ВСОпределение, "http://renault-nissan.com/schema/RenaultCredit", 
								"Renault_Credit", "Renault_CreditSoap12",300);
	ВебСервис.Пользователь	 = СокрЛП(ЛогинWS);
	ВебСервис.Пароль		 = СокрЛП(ПарольWS);
	
	Возврат ВебСервис;
	
КонецФункции

// статусы СМС

Процедура Renault_СтатусыСМС(Параметр1 = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_SMS.MessageID КАК ИдентификаторСообщения
	|ИЗ
	|	РегистрСведений.Renault_SMS КАК Renault_SMS
	|ГДЕ
	|	Renault_SMS.Статус = &Статус";
	Запрос.УстановитьПараметр("Статус", Перечисления.Renault_СтатусыСМС.ОтправленоНаГейт);
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ВебСервис = ПолучитьВебСервисКЦ();
	СервисФабрика = ВебСервис.ФабрикаXDTO;
	Сериализатор = Новый СериализаторXDTO(СервисФабрика);
	Параметры = Сериализатор.ЗаписатьXDTO(Результат);
	Ответ = ВебСервис.GetSMSStatus(Параметры);
	ТаблицаКВозврату = Сериализатор.ПрочитатьXDTO(Ответ);
	Для Каждого Строка ИЗ ТаблицаКВозврату Цикл
		//Сообщить("ИД:" + Строка.ИдентификаторСообщения + " Статус:" + Строка.Статус);
		Запись = РегистрыСведений.Renault_SMS.СоздатьМенеджерЗаписи();
		Запись.MessageID = Строка.ИдентификаторСообщения;
		Запись.Прочитать();
		Запись.MessageID = Строка.ИдентификаторСообщения;
		Запись.Статус = ПредопределенноеЗначение("Перечисление.Renault_СтатусыСМС." + Строка.Статус);
		Запись.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьВебСервисКЦ()
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	
	ПарольWS = Настройки.ПарольДоступаКВебСервисам;
	ЛогинWS = Настройки.ЛогинДоступаКВебСервисам;
	
	АдресWS = Настройки.КЦАдресСервера;
	СообщениеОбОшибке = "";
	
	ВСОпределение = Новый WSОпределения(СокрЛП(АдресWS) + "ws/ContactCenter.ws?wsdl",
									СокрЛП(ЛогинWS), СокрЛП(ПарольWS));
	
	ВебСервис = Новый WSПрокси(ВСОпределение, "http://renault-nissan.com/schema/ContactCenter", 
							   "Renault_ContactCenter", "Renault_ContactCenterSoap12",300);
	ВебСервис.Пользователь	 = СокрЛП(ЛогинWS);
	ВебСервис.Пароль		 = СокрЛП(ПарольWS);
	
	Возврат ВебСервис;
	
КонецФункции

Процедура Renault_ПолучениеПараметровАвторегистрации(Параметр1 = Неопределено) Экспорт
	
	Если НЕ Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ИспользоватьHTTPСервисы Тогда
		
		ВебСервис = ПолучитьВебСервисАвторегистрации();
		
		ПараметрыАвторегистрацииXDTO = ВебСервис.GetRegistrationParams();
		Сериализатор = Новый СериализаторXDTO(ВебСервис.ФабрикаXDTO);
		ПараметрыАвторегистрации = Сериализатор.ПрочитатьXDTO(ПараметрыАвторегистрацииXDTO);
		
	Иначе
		
		ПараметрыАвторегистрации = Неопределено;
		СтруктураЗапроса = Новый Структура;
		Если Не DMS_DataExchange.sendMessage(DMS_ОбщиеПовторныеФункции.ПараметрыHTTPСоединения(),,"DMS_ВебСервисы.pingМетод",DMS_DataExchange.newPackage(СтруктураЗапроса),ПараметрыАвторегистрации) Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого СтрокаПараметров ИЗ ПараметрыАвторегистрации Цикл
		Если СтрокаПараметров.Поток = "Сервис" Тогда
			Узел = ПолучитьПланОбмена_Сервис();
			МассивДанных = CRM_Сервер.РазложитьСтрокуВМассивПодстрок(СтрокаПараметров.Данные, ";");
			Для Каждого Данные ИЗ МассивДанных Цикл
				МетОбъект = Метаданные.НайтиПоПолномуИмени(Данные);
				Если МетОбъект <> Неопределено Тогда
					ПланыОбмена.ЗарегистрироватьИзменения(Узел, МетОбъект);
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли СтрокаПараметров.Поток = "Продажи" Тогда
			Узел = ПолучитьПланОбмена_Продажи();
			МассивДанных = CRM_Сервер.РазложитьСтрокуВМассивПодстрок(СтрокаПараметров.Данные, ";");
			Для Каждого Данные ИЗ МассивДанных Цикл
				МетОбъект = Метаданные.НайтиПоПолномуИмени(Данные);
				Если МетОбъект <> Неопределено Тогда
					ПланыОбмена.ЗарегистрироватьИзменения(Узел, МетОбъект);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	РегистрыСведений.DMS_МониторингРегламентныхЗаданий.ЗавершениеЗадания(
	ПредопределенноеЗначение("Справочник.DMS_НастройкаРегламентныхЗаданий.ПолучениеПараметровАвторегистрации"),
	ТекущаяДатаСеанса());
	
КонецПроцедуры

Функция ПолучитьПланОбмена_Сервис()
		
	Выборка = ПланыОбмена.Renault_Автосервис.Выбрать();
	ЭтаБаза = ПланыОбмена.Renault_Автосервис.ЭтотУзел();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка <> ЭтаБаза Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция ПолучитьПланОбмена_Продажи()
		
	Выборка = ПланыОбмена.Renault_CRM.Выбрать();
	ЭтаБаза = ПланыОбмена.Renault_CRM.ЭтотУзел();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка <> ЭтаБаза Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция ПолучитьВебСервисАвторегистрации()
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	
	ПарольWS = Настройки.ПарольДоступаКВебСервисам;
	ЛогинWS = Настройки.ЛогинДоступаКВебСервисам;
	
	АдресWS = Настройки.КЦАдресСервера;
	СообщениеОбОшибке = "";
	
	ВСОпределение = Новый WSОпределения(СокрЛП(АдресWS) + "ws/AutoRegistration.ws?wsdl",
									СокрЛП(ЛогинWS), СокрЛП(ПарольWS));
	
	ВебСервис = Новый WSПрокси(ВСОпределение, "http://renault-nissan.com/schema/DealerAutoRegistration", 
							   "Renault_DealerAutoRegistration", "Renault_DealerAutoRegistrationSoap12",300);
	ВебСервис.Пользователь	 = СокрЛП(ЛогинWS);
	ВебСервис.Пароль		 = СокрЛП(ПарольWS);
	
	Возврат ВебСервис;
	
КонецФункции

// Программы лояльности

// точка входа регламентного задания загрузки "Централизованных" Программ лояльности
Процедура Renault_ЗагрузкаЦентрализованныхПрограммЛояльности(Параметр1 = Неопределено) Экспорт
	
	Настройки = Renault_ОбщиеФункцииСервер.ПолучитьНастройкиПодключенияПоБренду(ПараметрыСеанса.DMS_Бренд);

	HTTPЗапрос = Новый HTTPЗапрос();
	HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
	HTTPЗапрос.АдресРесурса = Настройки.Адрес2 + "/hs/Loyalty/Programs";
	ЗащищенноеСоединениеOpenSSL = ?(Настройки.Настройки.ИспользоватьЗащищенноеСоединение,Новый ЗащищенноеСоединениеOpenSSL,Неопределено);
	Соединение = Новый HTTPСоединение(Настройки.Адрес1,,Настройки.ЛогинWS,Настройки.ПарольWS,,,ЗащищенноеСоединениеOpenSSL);
                
	ОтветHTTP = Соединение.Получить(HTTPЗапрос);
                
	Тело = ОтветHTTP.ПолучитьТелоКакСтроку();
	Если ОтветHTTP.КодСостояния = 200 Тогда
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Тело);
		
		ПараметрыЗапроса = ПрочитатьJSON(ЧтениеJSON);
		Данные = Base64Значение(ПараметрыЗапроса);
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("XML");
		Данные.Записать(ИмяВременногоФайла);
		
		ТаблицаДанных = Renault_ОбщиеФункцииСервер.ПолучитьЗначениеИзХML(ИмяВременногоФайла);	
	Иначе
		ЗаписьЖурналаРегистрации(
			"Загрузка программ лояльности",
			УровеньЖурналаРегистрации.Ошибка,,,
			Тело);	
	КонецЕсли;
	
	Для Каждого СтрокаПрограммы ИЗ ТаблицаДанных Цикл
		
		ИДПрограммы = Новый УникальныйИдентификатор(СтрокаПрограммы.UID);
		Ссылка = Справочники.Renault_ПрограммыЛояльности.ПолучитьСсылку(ИДПрограммы);
		
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда // Если это новая программа
			
			НоваяПрограмма = Справочники.Renault_ПрограммыЛояльности.СоздатьЭлемент();
			НоваяПрограмма.УстановитьСсылкуНового(Ссылка);
			ЗаполнитьЗначенияСвойств(НоваяПрограмма, СтрокаПрограммы, , "Код");
			Для Каждого СтрокаЗЧ ИЗ СтрокаПрограммы.ИсключенияЗапчасти Цикл
				НоваяЗЧ = НоваяПрограмма.ИсключенияЗапчасти.Добавить();
				НоваяЗЧ.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаЗЧ.НоменклатураСсылка));
				НоваяЗЧ.ПрограммаЛояльности = Справочники.Renault_ПрограммыЛояльности.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаЗЧ.ПрограммаСсылка));
			КонецЦикла;
			Для Каждого СтрокаРабота ИЗ СтрокаПрограммы.ИсключенияРаботы Цикл
				НоваяРабота = НоваяПрограмма.ИсключенияРаботы.Добавить();
				НоваяРабота.Авторабота = Справочники.Автоработы.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаРабота.АвтоработаСсылка));
				НоваяРабота.ПрограммаЛояльности = Справочники.Renault_ПрограммыЛояльности.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаРабота.ПрограммаСсылка));
			КонецЦикла;
			НоваяПрограмма.Загруженная = Истина;
			НоваяПрограмма.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьВебСервисЛояльности()
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	
	ПарольWS = Настройки.ПарольДоступаКВебСервисам;
	ЛогинWS = Настройки.ЛогинДоступаКВебСервисам;
	
	АдресWS = Настройки.АдресWsGate;
	СообщениеОбОшибке = "";
	
	ВСОпределение = Новый WSОпределения(СокрЛП(АдресWS) + "ws/Loyalty.ws?wsdl",
									СокрЛП(ЛогинWS), СокрЛП(ПарольWS));
	
	ВебСервис = Новый WSПрокси(ВСОпределение, "http://renault-nissan.com/schema/RenaultLoyalty", 
							   "Renault_Loyalty", "Renault_LoyaltySoap12",300);
	ВебСервис.Пользователь	 = СокрЛП(ЛогинWS);
	ВебСервис.Пароль		 = СокрЛП(ПарольWS);
	
	Возврат ВебСервис;
	
КонецФункции

Процедура ОбновитьСоответствияКодовКомплекаРабот(ТаблицаСоответствий)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.Артикул,
	               |	ТЗ.КодРабот
	               |ПОМЕСТИТЬ ТЗ
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Renault_СоответствиеАртикуловКодамРабот.Ссылка,
	               |	ТЗ.Артикул,
	               |	ТЗ.КодРабот,
	               |	ВЫБОР
	               |		КОГДА Renault_СоответствиеАртикуловКодамРабот.КодРабот ЕСТЬ NULL
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Создавать
	               |ИЗ
	               |	ТЗ КАК ТЗ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_СоответствиеАртикуловКодамРабот КАК Renault_СоответствиеАртикуловКодамРабот
	               |		ПО ТЗ.Артикул = Renault_СоответствиеАртикуловКодамРабот.Артикул";
	ЗАпрос.УстановитьПараметр("ТЗ",ТаблицаСоответствий);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл
		Если Выборка.Создавать тогда
			Об = Справочники.Renault_СоответствиеАртикуловКодамРабот.СоздатьЭлемент();			
			Об.Артикул = Выборка.Артикул;
		Иначе
			Об = Выборка.Ссылка.ПолучитьОбъект();
		КонецЕсли;	
		Об.КодРабот = Выборка.КодРабот;
		Об.Записать();
	КонецЦикла;	
КонецПроцедуры	

Процедура Renault_ЗагрузкаКомплексСервисов(Знач СтруктураПараметров) Экспорт	
	
	Попытка	
	ПолныйОбмен = Ложь;
	Если ТипЗнч(СтруктураПараметров) = Тип("Структура") Тогда
		Если НЕ СтруктураПараметров.Свойство("ПолныйОбмен",ПолныйОбмен) Тогда
			ПолныйОбмен = Ложь;
		КонецЕсли;
	КонецЕсли;

	Настройки = Renault_ОбщиеФункцииСервер.ПолучитьНастройкиПодключенияПоБренду(ПараметрыСеанса.DMS_Бренд);
	
	Если Настройки.Настройки.ИспользоватьHTTPСервисы Тогда
		HTTPЗапрос = Новый HTTPЗапрос();
		HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		HTTPЗапрос.АдресРесурса = 
		Настройки.Адрес2 + "/hs/AutoworkPrices/AdditionalOffers";
		ЗащищенноеСоединениеOpenSSL = ?(Настройки.Настройки.ИспользоватьЗащищенноеСоединение,Новый ЗащищенноеСоединениеOpenSSL,Неопределено);
		Соединение = Новый HTTPСоединение(Настройки.Адрес1,,Настройки.ЛогинWS,Настройки.ПарольWS,,,ЗащищенноеСоединениеOpenSSL);
		ОтветHTTP = Соединение.Получить(HTTPЗапрос); 
		ТабДопПредложения = Renault_ОбщиеФункцииСервер.ПолучитьЗначениеИзJSON(ОтветHTTP.ПолучитьТелоКакСтроку());
	Иначе 
		ВебСервис =  ПолучитьПроксиАвторабот();
		ТабДопПредложения_XDTO = ВебСервис.GetAdditionalOffers();
		ТабДопПредложения = СериализаторXDTO.ПрочитатьXDTO(ТабДопПредложения_XDTO);
	КонецЕсли;	
	ЗаполнитьДополнительныеПредложения(ТабДопПредложения);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_КомплексСервисыАвторабот.Артикул,
		|	Renault_КомплексСервисыАвторабот.ДатаИзменения,
		|	Renault_КомплексСервисыАвторабот.Ссылка
		|ИЗ
		|	Справочник.Renault_КомплексСервисыАвторабот КАК Renault_КомплексСервисыАвторабот
		|ГДЕ
		|	Renault_КомплексСервисыАвторабот.ЭтоГруппа = ЛОЖЬ
		|	И Renault_КомплексСервисыАвторабот.ПометкаУдаления = ЛОЖЬ";
	
	КомплексСервисы = Запрос.Выполнить().Выгрузить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ПредложенияКомплексСервисов.ДатаИзменения,
		|	Renault_ПредложенияКомплексСервисов.Код,
		|	Renault_ПредложенияКомплексСервисов.Ссылка
		|ИЗ
		|	Справочник.Renault_ПредложенияКомплексСервисов КАК Renault_ПредложенияКомплексСервисов
		|ГДЕ
		|	Renault_ПредложенияКомплексСервисов.ЭтоГруппа = ЛОЖЬ
		|	И Renault_ПредложенияКомплексСервисов.ПометкаУдаления = ЛОЖЬ";
	
	ПредложенияДилера = Запрос.Выполнить().Выгрузить();
	
	Если ПолныйОбмен Тогда
		КомплексСервисы.ЗаполнитьЗначения(ТекущаяДата(),"ДатаИзменения");
		ПредложенияДилера.ЗаполнитьЗначения(ТекущаяДата(),"ДатаИзменения");
		Для каждого стрКС из КомплексСервисы Цикл
			КС = стрКС.Ссылка.ПолучитьОбъект();
			КС.ПометкаУдаления = Истина;
			КС.ДатаИзменения = ТекущаяДата() - 60*60*24*3;
			КС.Записать();
		КонецЦикла;
		Для каждого стрПд из ПредложенияДилера Цикл
			ПД = стрПд.Ссылка.ПолучитьОбъект();
			ПД.ДатаИзменения = ТекущаяДата() - 60*60*24*3;
			ПД.ПометкаУдаления = Истина;
			ПД.Записать();
		КонецЦикла;
	КонецЕсли;
	
	КомплексСервисы.Колонки.Удалить("Ссылка");
	ПредложенияДилера.Колонки.Удалить("Ссылка");

	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Комплексы",КомплексСервисы);
	СтруктураДанных.Вставить("Предложения",ПредложенияДилера);
	
	Если Настройки.Настройки.ИспользоватьHTTPСервисы Тогда
		ТелоЗапроса = ПолучитьСтрокуJSONИзXDTO(СериализаторXDTO.ЗаписатьXDTO(СтруктураДанных));
		HTTPЗапрос = Новый HTTPЗапрос();
		HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
		HTTPЗапрос.АдресРесурса = 
		Настройки.Адрес2 + "/hs/AutoworkPrices/ServiceComplexes";
		ЗащищенноеСоединениеOpenSSL = ?(Настройки.Настройки.ИспользоватьЗащищенноеСоединение,Новый ЗащищенноеСоединениеOpenSSL,Неопределено);
		Соединение = Новый HTTPСоединение(Настройки.Адрес1,,Настройки.ЛогинWS,Настройки.ПарольWS,,,ЗащищенноеСоединениеOpenSSL);
		ОтветHTTP = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		СтруктураОтвет = Renault_ОбщиеФункцииСервер.ПолучитьЗначениеИзJSON(ОтветHTTP.ПолучитьТелоКакСтроку());  	
	Иначе
		СтруктураДанныхXDTO = СериализаторXDTO.ЗаписатьXDTO(СтруктураДанных);
		ОтветXDTO = ВебСервис.GetServiceComplexes(СтруктураДанныхXDTO);
		СтруктураОтвет = СериализаторXDTO.ПрочитатьXDTO(ОтветXDTO);  	
	КонецЕсли;
	
	Если СтруктураОтвет.Свойство("ТаблицаСоответствийКодовРабот") тогда
		ОбновитьСоответствияКодовКомплекаРабот(ЗначениеИзСтрокиВнутр(СтруктураОтвет.ТаблицаСоответствийКодовРабот));
	КонецЕсли;	
	
	//Создание и заполнение авторабот
	DMS_Renault = Справочники.Автоработы.НайтиПоНаименованию("DMS Renault",,Справочники.Автоработы.ПустаяСсылка());
	Если НЕ ЗначениеЗаполнено(DMS_Renault) Тогда
		НоваяАвторабота = Справочники.Автоработы.СоздатьГруппу();
		НоваяАвторабота.Наименование = "DMS Renault"; 
		НоваяАвторабота.УстановитьНовыйКод();
		НоваяАвторабота.Записать();
		DMS_Renault = НоваяАвторабота.Ссылка;
	КонецЕсли;	
	
	ГруппаАвторабот = Справочники.Автоработы.НайтиПоНаименованию("Комплекс-Сервисы",,DMS_Renault);
	Если НЕ ЗначениеЗаполнено(ГруппаАвторабот) Тогда
		нгр = Справочники.Автоработы.СоздатьГруппу();
		нгр.ОбменДанными.Загрузка = Истина;
		нгр.Наименование = "Комплекс-Сервисы";
		нгр.УстановитьНовыйКод();
		нгр.Родитель = DMS_Renault;
		нгр.Записать();
		ГруппаАвторабот = нгр.Ссылка;
	КонецЕсли;   
	
	СтрокиРабот = ЗначениеИзСтрокиВнутр(СтруктураОтвет.ТаблицаАвторабот).Строки;
	ЗагрузкаДереваРабот(СтрокиРабот,Справочники.Автоработы.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка,
	|	Номенклатура.Артикул
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = Ложь
	|	И Номенклатура.ПометкаУдаления = Ложь";
	ТЗЗапчасти = Запрос.Выполнить().Выгрузить();
	Для каждого СтрЗЧ из ТЗЗапчасти Цикл
		СтрЗЧ.Артикул = СокрЛП(СтрЗЧ.Артикул);
	КонецЦикла;
	ТЗЗапчасти.Индексы.Добавить("Артикул");

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КритерииАвтомобилей.Ссылка,
	|	КритерииАвтомобилей.КодОбъекта,
	|	КритерииАвтомобилей.КодКритерия,
	|	КритерииАвтомобилей.ОписаниеКритерия,
	|	КритерииАвтомобилей.ОписаниеЗначенияКритерия
	|ИЗ
	|	Справочник.Renault_КритерииАвтомобилей КАК КритерииАвтомобилей";
	ТаблицаКритериевАвто = Запрос.Выполнить().Выгрузить();
	ТаблицаКритериевАвто.Индексы.Добавить("КодОбъекта");
	ТаблицаКритериевАвто.Индексы.Добавить("КодКритерия");

	Параметры = Новый Структура;
	Параметры.Вставить("ТаблицаКритериев",ЗначениеИзСтрокиВнутр(СтруктураОтвет.ТаблицаКритериев).Строки);
	Параметры.Вставить("ГруппаАвторабот",ГруппаАвторабот);
	Параметры.Вставить("ТаблицаСостава",ЗначениеИзСтрокиВнутр(СтруктураОтвет.ТаблицаСостава));
	Параметры.Вставить("ТаблицаЗапчастей",ТЗЗапчасти);
	Параметры.Вставить("ТаблицаКритериевАвто",ТаблицаКритериевАвто);
	ЗагрузкаКомплексов(Параметры);

	ЗагрузкаПредложений(ЗначениеИзСтрокиВнутр(СтруктураОтвет.ТаблицаПредложений));

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_КомплексСервисыАвторабот.Ссылка
		|ИЗ
		|	Справочник.Renault_КомплексСервисыАвторабот КАК Renault_КомплексСервисыАвторабот
		|ГДЕ
		|	Renault_КомплексСервисыАвторабот.ПометкаУдаления = ИСТИНА
		|	И Renault_КомплексСервисыАвторабот.ДатаИзменения < &ДатаИзменения";

	Запрос.УстановитьПараметр("ДатаИзменения", ТекущаяДата() - 60*60*24*2);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 Эл = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		 Эл.Удалить();
	 КонецЦикла;
		 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ПредложенияКомплексСервисов.Ссылка
		|ИЗ
		|	Справочник.Renault_ПредложенияКомплексСервисов КАК Renault_ПредложенияКомплексСервисов
		|ГДЕ
		|	Renault_ПредложенияКомплексСервисов.ПометкаУдаления = ИСТИНА
		|	И Renault_ПредложенияКомплексСервисов.ДатаИзменения < &ДатаИзменения";

	Запрос.УстановитьПараметр("ДатаИзменения", ТекущаяДата() - 60*60*24*2);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 Эл = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		 Эл.Удалить();
	КонецЦикла;

	Исключение 
		Ошибка = ОписаниеОшибки(); 
		ВызватьИсключение Ошибка;
	КонецПопытки;

	РегистрыСведений.DMS_МониторингРегламентныхЗаданий.ЗавершениеЗадания(
	ПредопределенноеЗначение("Справочник.DMS_НастройкаРегламентныхЗаданий.ЗагрузкаКомплексСервисов"),
	ТекущаяДатаСеанса());

КонецПроцедуры

Функция ПолучитьСтрокуJSONИзXDTO(ОбъектXDTO) Экспорт
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайла, "UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("Message");
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектXDTO);

	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.Закрыть();
	ДвоичныеДанныеСообщения = Новый ДвоичныеДанные(ИмяВременногоФайла);

	СтрокаДанные = Base64Строка(ДвоичныеДанныеСообщения);

	УдалитьФайлы(ИмяВременногоФайла);

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтрокаДанные);
	СтрокаДляОтвета = ЗаписьJSON.Закрыть();		
	
	Возврат СтрокаДляОтвета;
	
КонецФункции

Функция ПолучитьПроксиАвторабот()
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	ПарольWS = Настройки.ПарольДоступаКВебСервисам;
	ЛогинWS = Настройки.ЛогинДоступаКВебСервисам;
	Адрес = Настройки.АдресWsGate;
	ОпределениеСервиса = Новый WSОпределения(СокрЛП(Адрес) + "ws/Renault_AutoworkPrices.1cws?wsdl", ЛогинWS, ПарольWS);
	ВебСервис = Новый WSПрокси(
	ОпределениеСервиса, 
	"http://renault-nissan.com/schema/Renault_AutoworkPrices", 
	"Renault_AutoworkPrices",
	"Renault_AutoworkPricesSoap12",
	3600);
	ВебСервис.Пользователь  = ЛогинWS;
	ВебСервис.Пароль   = ПарольWS;

	Возврат ВебСервис;
	
КонецФункции

Процедура ЗаполнитьДополнительныеПредложения(ТабДопПредложения)
	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	Таб.ДополнительноеПредложениеКод КАК ДополнительноеПредложениеКод,
	|	Таб.ДополнительноеПредложение КАК ДополнительноеПредложение
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&Таб КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_ДополнительныеПредложения.Ссылка КАК ДополнительноеПердложениеСсылка,
	|	Renault_ДополнительныеПредложения.КодДополнительныеПредложенияDictionary КАК КодДополнительныеПредложенияDictionary
	|ПОМЕСТИТЬ ДопПредлДанные
	|ИЗ
	|	Справочник.Renault_ДополнительныеПредложения КАК Renault_ДополнительныеПредложения
	|ГДЕ
	|	Renault_ДополнительныеПредложения.КодДополнительныеПредложенияDictionary В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВТ.ДополнительноеПредложениеКод
	|			ИЗ
	|				ВТ КАК ВТ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КодДополнительныеПредложенияDictionary
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ДополнительноеПредложениеКод КАК Код,
	|	ВТ.ДополнительноеПредложение КАК Наименование,
	|	ДопПредлДанные.ДополнительноеПердложениеСсылка КАК Ссылка
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДопПредлДанные КАК ДопПредлДанные
	|		ПО ВТ.ДополнительноеПредложениеКод = ДопПредлДанные.КодДополнительныеПредложенияDictionary";
	Запрос.УстановитьПараметр("Таб", ТабДопПредложения);	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
	    Возврат;	
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка = NULL Тогда
			ЭлДопПредложение = Справочники.Renault_ДополнительныеПредложения.СоздатьЭлемент();
		Иначе
			ЭлДопПредложение = Выборка.Ссылка.ПолучитьОбъект();			
		КонецЕсли;
		
		ЭлДопПредложение.КодДополнительныеПредложенияDictionary = Выборка.Код;
		ЭлДопПредложение.Наименование = Выборка.Наименование;
		ЭлДопПредложение.Записать();
	КонецЦикла; 		
КонецПроцедуры

Процедура ЗагрузкаДереваРабот(Строки, Родитель = Неопределено)
	
	Для Каждого Строка из Строки Цикл		
		Если НЕ ЗначениеЗаполнено(Строка.Наименование) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если Строка.ЭтоГруппа Тогда
			Ссылка = Справочники.Автоработы.НайтиПоНаименованию(Строка.Наименование,Истина,Родитель);
		Иначе
			Ссылка = Справочники.Автоработы.НайтиПоРеквизиту("Артикул",Строка.Код, Родитель);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Ссылка) Тогда
			Если Строка.ЭтоГруппа Тогда
				НоваяАвторабота = Справочники.Автоработы.СоздатьГруппу();
			Иначе
				НоваяАвторабота = Справочники.Автоработы.СоздатьЭлемент();
				НоваяАвторабота.Заполнить(Неопределено);
				НоваяАвторабота.Номенклатура = Справочники.Номенклатура.Авторабота;
			КонецЕсли;
			НоваяАвторабота.УстановитьНовыйКод();
		Иначе
			НоваяАвторабота = Ссылка.ПолучитьОбъект();
		КонецЕсли;
		
		Записывать = Ложь;
		Если ЗначениеЗаполнено(НоваяАвторабота.ВерсияДанных) Тогда //Объект найден. Если название/артикул не менялись, то перезаписывать не будем
			Если НоваяАвторабота.ПометкаУдаления Тогда
				НоваяАвторабота.УстановитьПометкуУдаления(Ложь); // снимем пометку если была установлена
			КонецЕсли;
			Если НоваяАвторабота.Наименование <> Строка.Наименование
				ИЛИ НоваяАвторабота.Артикул <> Строка.Код Тогда
				Записывать = Истина;
			КонецЕсли;
		Иначе //Создается новый объект в базе
			Записывать = Истина;
		КонецЕсли;
		Если Записывать Тогда
			НоваяАвторабота.Артикул = Строка.Код;
			НоваяАвторабота.ОбменДанными.Загрузка = Истина;
			НоваяАвторабота.Наименование = Строка.Наименование;
			НоваяАвторабота.Родитель = Родитель; 
			НоваяАвторабота.Записать();
		КонецЕсли;
		Ссылка = НоваяАвторабота.Ссылка;
		
		ЗагрузкаДереваРабот(Строка.Строки, Ссылка);
		
	КонецЦикла;  
	
КонецПроцедуры

Процедура ЗагрузкаКомплексов(Параметры)//(Строки, Родитель, ГруппаАвторабот, ЗаполняемКритерии, ТаблицаСостава, ТаблицаЗапчастей)
	
	Для Каждого Строка из Параметры.ТаблицаКритериев Цикл		
		Если НЕ ЗначениеЗаполнено(Строка.Наименование) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если НЕ Строка.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		Группа = Справочники.Renault_КомплексСервисыАвторабот.НайтиПоНаименованию(Строка.Наименование, Истина, Справочники.Renault_КомплексСервисыАвторабот.ПустаяСсылка());
		
		Если Не ЗначениеЗаполнено(Группа) Тогда	//Необходимо создать новый элемент или группу			
			НовыйКомплекс = Справочники.Renault_КомплексСервисыАвторабот.СоздатьГруппу();
			НовыйКомплекс.Наименование = Строка.Наименование;	
			НовыйКомплекс.Артикул = Строка.Артикул;
			НовыйКомплекс.ОбменДанными.Загрузка = Истина;
			НовыйКомплекс.УстановитьНовыйКод();
			НовыйКомплекс.Записать();
			Группа = НовыйКомплекс.Ссылка; 
		КонецЕсли;
		
		Для Каждого СтрокаГруппы из Строка.Строки Цикл
			Если СтрокаГруппы.ЭтоГруппа Тогда
				Продолжить;
			КонецЕсли;
			
			КомплексСсылка = Справочники.Renault_КомплексСервисыАвторабот.НайтиПоРеквизиту("Артикул",СтрокаГруппы.Артикул, Группа);
			Если ЗначениеЗаполнено(КомплексСсылка) Тогда
				Комплекс = КомплексСсылка.ПолучитьОбъект();
				Комплекс.ПометкаУдаления = СтрокаГруппы.ПометкаУдаления;
			Иначе
				Комплекс = Справочники.Renault_КомплексСервисыАвторабот.СоздатьЭлемент();
				Комплекс.УстановитьНовыйКод();
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(Комплекс,СтрокаГруппы);
			Комплекс.Родитель = Группа;
			Если Комплекс.Авторабота.Артикул <> СтрокаГруппы.АвтоработаАртикул Тогда
				Авторабота = Справочники.Автоработы.НайтиПоРеквизиту("Артикул",СтрокаГруппы.АвтоработаАртикул,Параметры.ГруппаАвторабот);
				Если Авторабота.Пустая() Тогда
					НоваяРабота = Справочники.Автоработы.СоздатьЭлемент();
					НоваяРабота.Родитель = Параметры.ГруппаАвторабот;
					НоваяРабота.Артикул  = СтрокаГруппы.АвтоработаАртикул;
					НоваяРабота.Наименование = СтрокаГруппы.Наименование;
					НоваяРабота.Заполнить(Неопределено);
					НоваяРабота.Номенклатура = Справочники.Номенклатура.Авторабота;
					НоваяРабота.УстановитьНовыйКод(); // DMSREN-774 
					НоваяРабота.Записать();
					Авторабота = НоваяРабота.Ссылка;
				КонецЕсли;
				Комплекс.Авторабота = Авторабота;
			КонецЕсли;
			
			Комплекс.ОбменДанными.Загрузка = Истина;
			Комплекс.КритерииКомплекса.Очистить();
			Для Каждого Строка из СтрокаГруппы.Строки Цикл		
				НовСтр = Комплекс.КритерииКомплекса.Добавить();
				НовСтр.Критерий = НайтиСоздатьКритерий(Строка, Параметры.ТаблицаКритериевАвто);			
			КонецЦикла;
			//Заполняем состав 
			СтрокиСоставаКС = Параметры.ТаблицаСостава.Скопировать(Новый Структура("АртикулКомплекса",Комплекс.Артикул));	
			Комплекс.СоставКомплекса.Очистить();
			Для Каждого Стр из СтрокиСоставаКС Цикл	
				Если ЗначениеЗаполнено(СокрЛП(Стр.АртикулЗапчасти)) Тогда
					НовСостав =  Комплекс.СоставКомплекса.Добавить();
					НовСостав.Артикул = СокрЛП(Стр.АртикулЗапчасти);
					Запчасть = Параметры.ТаблицаЗапчастей.Найти(НовСостав.Артикул,"Артикул");
					Если Запчасть <> Неопределено Тогда
						НовСостав.Номенклатура = Запчасть.Ссылка;
					Иначе
						НовСостав.Номенклатура = Renault_ЗапчастиСервер.ПолучитьНоменклатуруПоКаталогу(Стр.АртикулЗапчасти, Истина);
						Если ЗначениеЗаполнено(НовСостав.Номенклатура) Тогда
							СтрЗч = Параметры.ТаблицаЗапчастей.Добавить();
							СтрЗч.Артикул = Стр.АртикулЗапчасти;
							СтрЗч.Ссылка = НовСостав.Номенклатура;
						КонецЕсли;
					КонецЕсли;
					НовСостав.Количество = Стр.Количество;
					НовСостав.Кратность = Стр.Кратность;
					НовСостав.ЦенаPCL = Стр.ЦенаPCL;
					НовСостав.ЦенаPNC = Стр.ЦенаPNC;
					// { DMSREN-382 Болдарев Д.Е. от 10.03.2020  
					НовСостав.УчетМаслаВБочках = Стр.УчетМаслаВБочках;
					// } DMSREN-382 Болдарев Д.Е. от 10.03.2020. 
				КонецЕсли;
			КонецЦикла;
			Комплекс.Записать();
			
		КонецЦикла;  
	КонецЦикла; 		

КонецПроцедуры

Процедура ЗагрузкаПредложений(ТаблицаПредложений)
	
	Для каждого Строка из ТаблицаПредложений.Строки Цикл //перебор групп
		Ссылка = Справочники.Renault_ПредложенияКомплексСервисов.НайтиПоКоду(Строка.УсловияПредложенияКСКод);
		Если ЗначениеЗаполнено(Ссылка) Тогда
			 НоваяГруппаПредложения = Ссылка.ПолучитьОбъект();
			 НоваяГруппаПредложения.Наименование = Строка.УсловияПредложенияКСНаименование;
			 НоваяГруппаПредложения.Код = Строка.УсловияПредложенияКСКод;
			 НоваяГруппаПредложения.ПорядковыйНомер = Строка.ПорядковыйНомер;
			 НоваяГруппаПредложения.Записать();
			 ГруппаПредложения = Ссылка;
		Иначе	//ЗначениеЗаполнено(Ссылка) Тогда
			 НоваяГруппаПредложения = Справочники.Renault_ПредложенияКомплексСервисов.СоздатьГруппу();
			 НоваяГруппаПредложения.Наименование = Строка.УсловияПредложенияКСНаименование;
			 НоваяГруппаПредложения.Код = Строка.УсловияПредложенияКСКод;
			 НоваяГруппаПредложения.ПорядковыйНомер = Строка.ПорядковыйНомер;
			 НоваяГруппаПредложения.Записать();
			 ГруппаПредложения = НоваяГруппаПредложения.Ссылка;
		КонецЕсли;	
		
		Для каждого Стр из Строка.Строки Цикл //перебор предложений группы
			ПредложениеСсылка = Справочники.Renault_ПредложенияКомплексСервисов.НайтиПоКоду(Стр.УсловияПредложенияКСКод);
			Если ЗначениеЗаполнено(ПредложениеСсылка) Тогда
				Предложение = ПредложениеСсылка.ПолучитьОбъект();
				Предложение.ПометкаУдаления = Стр.ПометкаУдаления;
			Иначе	//ЗначениеЗаполнено(Ссылка) Тогда
				Предложение = Справочники.Renault_ПредложенияКомплексСервисов.СоздатьЭлемент();
			КонецЕсли;	
			ЗаполнитьЗначенияСвойств(Предложение,стр);
			Предложение.Родитель = ГруппаПредложения;
			Предложение.Наименование = Стр.УсловияПредложенияКСНаименование;
			Предложение.ДополнительныеПредложения = Справочники.Renault_ДополнительныеПредложения.НайтиПоРеквизиту("КодДополнительныеПредложенияDictionary",Стр.ДополнительныеПредложенияКод);
			Предложение.Код = Стр.УсловияПредложенияКСКод;
			Предложение.Записать();
		КонецЦикла;
		
		
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиСоздатьКритерий(Строка, ТаблицаКритериевАвто)

	МассивСтрок = ТаблицаКритериевАвто.НайтиСтроки(Новый Структура("КодОбъекта,КодКритерия",Строка.КодОбъекта,Строка.КодКритерия));
	Если МассивСтрок.Количество()>0 Тогда
		//Если Выборка.Следующий() Тогда
		СтрокаМассива = МассивСтрок[0];
		Критерий = СтрокаМассива.Ссылка;
		Если СтрокаМассива.ОписаниеКритерия <> Строка.ОписаниеКритерия или СтрокаМассива.ОписаниеЗначенияКритерия <> Строка.ОписаниеЗначенияКритерия Тогда
			Эл = Критерий.ПолучитьОбъект();
			Эл.ОписаниеКритерия = Строка.ОписаниеКритерия;
			Эл.ОписаниеЗначенияКритерия = Строка.ОписаниеЗначенияКритерия;
			Эл.Записать();
		КонецЕсли;
	Иначе
		НовыйКритерий = Справочники.Renault_КритерииАвтомобилей.СоздатьЭлемент();
		НовыйКритерий.УстановитьНовыйКод();
		НовыйКритерий.КодОбъекта = Строка.КодОбъекта;
		НовыйКритерий.КодКритерия = Строка.КодКритерия;
		НовыйКритерий.ОписаниеКритерия = Строка.ОписаниеКритерия;
		НовыйКритерий.ОписаниеЗначенияКритерия = Строка.ОписаниеЗначенияКритерия;
		
		Если НЕ ЗначениеЗаполнено(Строка.ОписаниеЗначенияКритерия) Тогда
			НовыйКритерий.ОписаниеЗначенияКритерия = Строка.КодКритерия;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Строка.ОписаниеКритерия) Тогда
			НовыйКритерий.ОписаниеКритерия = Строка.КодОбъекта;
		КонецЕсли;
		НовыйКритерий.Наименование = НовыйКритерий.ОписаниеКритерия+ " - "+ НовыйКритерий.ОписаниеЗначенияКритерия;
		НовыйКритерий.Записать();
		
		НовКрит = ТаблицаКритериевАвто.Добавить();
		ЗаполнитьЗначенияСвойств(НовКрит,НовыйКритерий);
		Критерий =  НовыйКритерий.Ссылка;
		
	КонецЕсли;
	
	Возврат Критерий;
	
КонецФункции	

Процедура ОбойтиУровеньДерева(Строки, ТаблицаЗаписанныхАвторабот, Родитель, НовыйДопРеквизиты, ПолныйОбмен)
	Для Каждого Строка из Строки Цикл		
		Если НЕ ЗначениеЗаполнено(Строка.Наименование) Тогда
			Продолжить;
		КонецЕсли; 
		
		Стр = ТаблицаЗаписанныхАвторабот.Найти(Строка.Артикул, "Артикул");
		
		Если Стр = Неопределено Тогда

			Если НЕ Строка.ЭтоГруппа Тогда
				Ссылка = Справочники.Автоработы.НайтиПоРеквизиту("Артикул", Строка.Артикул,Родитель);
			Иначе
				Ссылка = Справочники.Автоработы.НайтиПоНаименованию(Строка.Наименование, Истина, Родитель);
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Ссылка) Тогда				
				Если Строка.ЭтоГруппа Тогда
					НоваяАвторабота = Справочники.Автоработы.СоздатьГруппу();
				Иначе
					НоваяАвторабота = Справочники.Автоработы.СоздатьЭлемент();
					НоваяАвторабота.Артикул = Строка.Артикул;	
					НоваяАвторабота.Заполнить(Неопределено);
					НоваяАвторабота.Номенклатура = Справочники.Номенклатура.Авторабота;
				КонецЕсли;
				НоваяАвторабота.ОбменДанными.Загрузка = Истина;
				НоваяАвторабота.УстановитьНовыйКод();
				НоваяАвторабота.Наименование = Строка.Наименование;				
				НоваяАвторабота.Родитель = Родитель; 
				НоваяАвторабота.Записать();
				Ссылка = НоваяАвторабота.Ссылка; 				
			КонецЕсли;
			
			Если Не Строка.ЭтоГруппа Тогда  				
				НовыйДопРеквизиты.Добавить(Строка.Артикул); 			
			КонецЕсли;			
		Иначе
			Ссылка = Стр.Авторабота;
			Если ПолныйОбмен Тогда
				НовыйДопРеквизиты.Добавить(Строка.Артикул); 
			КонецЕсли;
		КонецЕсли;
		
		ОбойтиУровеньДерева(Строка.Строки, ТаблицаЗаписанныхАвторабот, Ссылка, НовыйДопРеквизиты, ПолныйОбмен);		
	КонецЦикла;  	
КонецПроцедуры

Процедура ЗаполнитьРегистрАвтоработыЦены(ДатаЗаписи, ТабАвтоработы, ПолныйОбмен)
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	таб.АвтоработаАртикул,
	|	таб.ИтогоНЧ,
	|	таб.СтоимостьНормоЧасаСНДС1,
	|	таб.СтоимостьНормоЧасаСНДС2,
	|	таб.Цена1ТЗ,
	|	таб.Цена2ТЗ
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&таб КАК таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(Автоработы.Ссылка) КАК Авторабота,
	|	Автоработы.Артикул КАК Артикул
	|ПОМЕСТИТЬ АвтоработыДанные
	|ИЗ
	|	Справочник.Автоработы КАК Автоработы
	|ГДЕ
	|	Автоработы.Артикул В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВТ.АвтоработаАртикул
	|			ИЗ
	|				ВТ КАК ВТ)
	|	И НЕ Автоработы.ЭтоГруппа
	|
	|СГРУППИРОВАТЬ ПО
	|	Автоработы.Артикул
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Артикул
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ.ИтогоНЧ) КАК ИтогоНЧ,
	|	МАКСИМУМ(ВТ.СтоимостьНормоЧасаСНДС1) КАК СтоимостьНормоЧасаСНДС1,
	|	МАКСИМУМ(ВТ.СтоимостьНормоЧасаСНДС2) КАК СтоимостьНормоЧасаСНДС2,
	|	МАКСИМУМ(ВТ.Цена1ТЗ) КАК Цена1ТЗ,
	|	МАКСИМУМ(ВТ.Цена2ТЗ) КАК Цена2ТЗ,
	|	АвтоработыДанные.Авторабота,
	|	МАКСИМУМ(&Период) КАК Период,
	|	АвтоработыДанные.Авторабота.ВремяВыполнения КАК ВремяВыполнения
	|ИЗ
	|	ВТ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АвтоработыДанные КАК АвтоработыДанные
	|		ПО ВТ.АвтоработаАртикул = АвтоработыДанные.Артикул
	|
	|СГРУППИРОВАТЬ ПО
	|	АвтоработыДанные.Авторабота,
	|	АвтоработыДанные.Авторабота.ВремяВыполнения";

	Запрос.УстановитьПараметр("таб", ТабАвтоработы);
	Запрос.УстановитьПараметр("Период", НачалоДня(ДатаЗаписи));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
	    Возврат;	
	КонецЕсли;
	
	ВыгрузкаДляНабора = РезультатЗапроса.Выгрузить();
	
	Для каждого стр Из ВыгрузкаДляНабора Цикл
	    Если стр.ВремяВыполнения = 0 Тогда
		    АвтоработаОбъект = стр.Авторабота.ПолучитьОбъект();
			АвтоработаОбъект.ОбменДанными.Загрузка = истина;
			АвтоработаОбъект.ВремяВыполнения = стр.ИтогоНЧ;
		    АвтоработаОбъект.Записать();
		КонецЕсли;	
	КонецЦикла;
	
	Если ПолныйОбмен Тогда
		наборЗаписей = РегистрыСведений.Renault_АвтоработыЦены.СоздатьНаборЗаписей();
		наборЗаписей.Прочитать();
		наборЗаписей.Очистить();
		наборЗаписей.Записать();
	КонецЕсли;
	

	наборЗаписей = РегистрыСведений.Renault_АвтоработыЦены.СоздатьНаборЗаписей();
	наборЗаписей.Отбор.Период.Установить(НачалоДня(ДатаЗаписи));
	наборЗаписей.Загрузить(ВыгрузкаДляНабора);
	Попытка
	    наборЗаписей.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("Renault_ЗагрузкаДанных.ЗаполнитьРегистрАвтоработыЦены",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьРегистрАвтоработыЦеныЗапчасти(ДатаЗаписи, ТабАвтоработыЗапчасти, ПолныйОбмен)
	
	Запрос = Новый Запрос;
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	таб.АвтоработаАртикул,
	|	таб.PCL,
	|	таб.PNC,
	|	таб.ЗапчастьАртикул,
	|	таб.ЗапчастьПредставление,
	|	ВЫБОР
	|		КОГДА таб.Количество = 0
	|			ТОГДА 1
	|		ИНАЧЕ таб.Количество
	|	КОНЕЦ КАК Количество
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&таб КАК таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(Автоработы.Ссылка) КАК Авторабота,
	|	Автоработы.Артикул КАК АвтоработаАртикул
	|ПОМЕСТИТЬ АвтоработыДанные
	|ИЗ
	|	Справочник.Автоработы КАК Автоработы
	|ГДЕ
	|	Автоработы.Артикул В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВТ.АвтоработаАртикул
	|			ИЗ
	|				ВТ КАК ВТ)
	|	И НЕ Автоработы.ЭтоГруппа
	|
	|СГРУППИРОВАТЬ ПО
	|	Автоработы.Артикул
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Автоработы.Артикул
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Номенклатура.Ссылка) КАК Запчасть,
	|	ВТ.ЗапчастьАртикул,
	|	ВТ.ЗапчастьПредставление
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ВТ.ЗапчастьАртикул = Номенклатура.Артикул
	|			И (ВТ.ЗапчастьАртикул <> """")
	|ГДЕ
	|	Номенклатура.Ссылка ЕСТЬ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ЗапчастьАртикул,
	|	ВТ.ЗапчастьПредставление";

	Запрос.УстановитьПараметр("таб", ТабАвтоработыЗапчасти);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда  		
		Номенклатура = Справочники.Номенклатура;
		RENAULT_DMS = Справочники.Номенклатура.НайтиПоНаименованию("RENAULT_DMS");
		КомплексыРабот = Справочники.Номенклатура.НайтиПоНаименованию("Комплексы работ",,RENAULT_DMS);
		Если не ЗначениеЗаполнено(КомплексыРабот) Тогда
			нгр = Номенклатура.СоздатьГруппу();
			нгр.ОбменДанными.Загрузка = Истина;
			нгр.Наименование = "Комплексы работ";
			нгр.Родитель = RENAULT_DMS;
			нгр.Записать();
			КомплексыРабот = нгр.Ссылка;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл 			
			НовЭл = Номенклатура.СоздатьЭлемент();		 
			НовЭл.ОбменДанными.Загрузка = Истина;
			НовЭл.Наименование = Выборка.ЗапчастьПредставление;
			НовЭл.Артикул = Выборка.ЗапчастьАртикул;
			НовЭл.Родитель = КомплексыРабот; 
			НовЭл.Записать();				
		КонецЦикла;  		
	КонецЕсли;	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ.PCL,
	|	ВТ.PNC,
	|	ВТ.Количество,
	|	АвтоработыДанные.Авторабота,
	|	&Период,
	|	МАКСИМУМ(Номенклатура.Ссылка) КАК Запчасть
	|ИЗ
	|	ВТ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АвтоработыДанные КАК АвтоработыДанные
	|		ПО ВТ.АвтоработаАртикул = АвтоработыДанные.АвтоработаАртикул
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ВТ.ЗапчастьАртикул = Номенклатура.Артикул
	|			И (Номенклатура.Артикул <> """")
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.PCL,
	|	ВТ.PNC,
	|	ВТ.Количество,
	|	АвтоработыДанные.Авторабота
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Количество,
	|	АвтоработыДанные.Авторабота,
	|	Номенклатура.Ссылка КАК Запчасть
	|ПОМЕСТИТЬ СвзанныеРаботы
	|ИЗ
	|	ВТ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АвтоработыДанные КАК АвтоработыДанные
	|		ПО ВТ.АвтоработаАртикул = АвтоработыДанные.АвтоработаАртикул
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ВТ.ЗапчастьАртикул = Номенклатура.Артикул
	|			И (Номенклатура.Артикул <> """")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СвзанныеРаботы.Авторабота,
	|	СвзанныеРаботы.Запчасть КАК СвязаннаяРабота,
	|	СвзанныеРаботы.Количество
	|ИЗ
	|	СвзанныеРаботы КАК СвзанныеРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеРаботы КАК СвязанныеРаботы
	|		ПО СвзанныеРаботы.Авторабота = СвязанныеРаботы.Авторабота
	|			И СвзанныеРаботы.Запчасть = СвязанныеРаботы.СвязаннаяРабота
	|ГДЕ
	|	СвязанныеРаботы.Авторабота ЕСТЬ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|	СвзанныеРаботы.Авторабота,
	|	СвзанныеРаботы.Запчасть,
	|	СвзанныеРаботы.Количество";
	
	Запрос.УстановитьПараметр("Период", НачалоДня(ДатаЗаписи));
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Если РезультатЗапроса[0].Пустой() Тогда
	    Возврат;	
	КонецЕсли;
	
	Если ПолныйОбмен Тогда
		наборЗаписей = РегистрыСведений.Renault_АвтоработыЦеныЗапчастей.СоздатьНаборЗаписей();
		наборЗаписей.Прочитать();
		наборЗаписей.Очистить();
		наборЗаписей.Записать();
	КонецЕсли;

	
	наборЗаписей = РегистрыСведений.Renault_АвтоработыЦеныЗапчастей.СоздатьНаборЗаписей();
	наборЗаписей.Отбор.Период.Установить(НачалоДня(ДатаЗаписи));
	наборЗаписей.Загрузить(РезультатЗапроса[0].Выгрузить());
	Попытка
	    наборЗаписей.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("Renault_ЗагрузкаДанных.ЗаполнитьРегистрАвтоработыЦеныЗапчасти",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
	КонецПопытки;
	
	наборЗаписей = РегистрыСведений.СвязанныеРаботы.СоздатьНаборЗаписей();
	наборЗаписей.Загрузить(РезультатЗапроса[2].Выгрузить());
	Попытка
	    наборЗаписей.Записать(Ложь);
	Исключение
	    ЗаписьЖурналаРегистрации("Renault_ЗагрузкаДанных.ЗаполнитьРегистрАвтоработыЦеныЗапчасти",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

Процедура ОбновитьКритерий(КритерийСсылка,СтрокаКритерииАвтомобилей)
						
	Если КритерийСсылка.Наименование <> СтрокаКритерииАвтомобилей.КритерииАвтомобилей
		ИЛИ КритерийСсылка.КодОбъекта <> СтрокаКритерииАвтомобилей.КодОбъекта
		ИЛИ КритерийСсылка.КодКритерия <> СтрокаКритерииАвтомобилей.КодКритерия
		ИЛИ КритерийСсылка.ОписаниеКритерия <> СтрокаКритерииАвтомобилей.ОписаниеКритерия
		ИЛИ КритерийСсылка.ОписаниеЗначенияКритерия <> СтрокаКритерииАвтомобилей.ОписаниеЗначенияКритерия
		ИЛИ КритерийСсылка.ДопАртикул <> СтрокаКритерииАвтомобилей.ДопАртикул Тогда
		
		ЭлКритерийАвтомобиля = КритерийСсылка.ПолучитьОбъект();
		ЭлКритерийАвтомобиля.Наименование = СтрокаКритерииАвтомобилей.КритерииАвтомобилей;
		ЭлКритерийАвтомобиля.КодОбъекта = СтрокаКритерииАвтомобилей.КодОбъекта;
		ЭлКритерийАвтомобиля.КодКритерия = СтрокаКритерииАвтомобилей.КодКритерия;
		ЭлКритерийАвтомобиля.ОписаниеКритерия = СтрокаКритерииАвтомобилей.ОписаниеКритерия;
		ЭлКритерийАвтомобиля.ОписаниеЗначенияКритерия = СтрокаКритерииАвтомобилей.ОписаниеЗначенияКритерия;
		ЭлКритерийАвтомобиля.ДопАртикул = СтрокаКритерииАвтомобилей.ДопАртикул;
		ЭлКритерийАвтомобиля.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиКритерий(КодОбъекта, КодКритерия)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_КритерииАвтомобилей.Ссылка
		|ИЗ
		|	Справочник.Renault_КритерииАвтомобилей КАК Renault_КритерииАвтомобилей
		|ГДЕ
		|	Renault_КритерииАвтомобилей.КодОбъекта = &КодОбъекта
		|	И Renault_КритерииАвтомобилей.КодКритерия = &КодКритерия";
	
	Запрос.УстановитьПараметр("КодКритерия", КодКритерия);
	Запрос.УстановитьПараметр("КодОбъекта", КодОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	 	Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

// загрузка номенклатуры и цен из Dictionary
Процедура DMS_ЗагрузкаНоменклатурыЦен(Параметр = Неопределено,Интерактивно=Ложь,ВариантПолученияДанных="update") Экспорт
	
	Ответ="";
	ИмяФункции="Renault_Открытый.ПолучитьНоменклатуру";
	МассивМД=Новый Массив;
	МассивМД.Добавить("Номенклатура");
	МассивМД.Добавить("Цены");
	
	ВыборкаДилеров = Справочники.CRM_ДилерскиеЦентры.Выбрать();
	Пока ВыборкаДилеров.Следующий() Цикл
		Если ВыборкаДилеров.ПометкаУдаления Тогда Продолжить; КонецЕсли;
		BIR = ВыборкаДилеров.BIR;
		Бренд = ВыборкаДилеров.Бренд.Наименование;
		//передача данных DMS->Dictionary      			
		Package=DMS_DataExchange.newPackage(Новый Структура("ВариантПолученияДанных,МассивМД,ПолныйBIR",ВариантПолученияДанных,МассивМД,BIR));
		Если НЕ DMS_DataExchange.sendMessage(DMS_ОбщиеПовторныеФункции.ПараметрыHTTPСоединения(),"DictionaryHTTP",ИмяФункции,Package,Ответ) Тогда 
			Если Интерактивно Тогда 
			Сообщить(Ответ,СтатусСообщения.Внимание) Иначе 
				ЗаписьЖурналаРегистрации(ИмяФункции,УровеньЖурналаРегистрации.Ошибка,,,Ответ) 
			КонецЕсли;
			Ошибка=Истина;
			Продолжить //Возврат Ложь 
		КонецЕсли;
		ОсновнаяГруппа = Справочники.Номенклатура.НайтиПоНаименованию("Номенклатура "+Бренд,Истина);
		Если ОсновнаяГруппа.Пустая() Тогда
			ОсновнаяГруппаОбъект = Справочники.Номенклатура.СоздатьГруппу();
			ОсновнаяГруппаОбъект.Наименование = "Номенклатура "+Бренд;
			ОсновнаяГруппаОбъект.Записать();
			ОсновнаяГруппа = ОсновнаяГруппаОбъект.Ссылка;
		КонецЕсли;
		
		//обработать ответ Dictionary
		Валюта = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		НомерПакета=Ответ.НомерПакета;
		Для Каждого Стр Из Ответ.Данные.Номенклатура Цикл
			
			Родитель = Справочники.Номенклатура.НайтиПоНаименованию(Стр.РодительНаименование,Истина,ОсновнаяГруппа);
			Если Родитель.Пустая() Тогда
				РодительОбъект = Справочники.Номенклатура.СоздатьГруппу();
				РодительОбъект.Наименование = Стр.РодительНаименование;
				РодительОбъект.Родитель = ОсновнаяГруппа;
				РодительОбъект.Записать();
				Родитель = РодительОбъект.Ссылка;
			КонецЕсли;
			
			//поиск ссылки
			Запрос=Новый Запрос("Выбрать Ссылка Из Справочник.Номенклатура ГДЕ Артикул=&Артикул");
			Запрос.УстановитьПараметр("Артикул",Стр.Артикул);
			Выборка=Запрос.Выполнить().Выбрать();
			СпрОбъект=?(Выборка.Следующий(),Выборка.Ссылка.ПолучитьОбъект(),Справочники.Номенклатура.СоздатьЭлемент());
			ЗаполнитьЗначенияСвойств(СпрОбъект,Стр);
			СпрОбъект.Родитель = Родитель;
			//дополнительные поля
			СпрОбъект.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.шт;	
			СпрОбъект.ТипНоменклатуры = Справочники.ТипыНоменклатуры.Штучный;
			СпрОбъект.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар;
			СпрОбъект.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
			СпрОбъект.ВалютаУчета = Валюта;
			СпрОбъект.ОбменДанными.Загрузка = Истина;
			СпрОбъект.Записать();
			
			//постобработка - связанные данные
			СсылкаЕИ =Справочники.ЕдиницыИзмерения.НайтиПоНаименованию("шт",Истина,,СпрОбъект.Ссылка);
			Если СсылкаЕИ.Пустая() Тогда
				ОбъектЕИ=Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
				ОбъектЕИ.ЕдиницаПоКлассификатору = Справочники.КлассификаторЕдиницИзмерения.шт;
				ОбъектЕИ.Коэффициент = 1;
				ОбъектЕИ.Владелец=СпрОбъект.Ссылка;
				ОбъектЕИ.Наименование="шт";
				ОбъектЕИ.ОбменДанными.Загрузка = Истина;
				ОбъектЕИ.Записать();
				СпрОбъект.ОсновнаяЕдиницаИзмерения = ОбъектЕИ.Ссылка;
				СпрОбъект.ОбменДанными.Загрузка = Истина;
				СпрОбъект.Записать();
			КонецЕсли;
			
		КонецЦикла;
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Артикулы.Артикул КАК Артикул
		|ПОМЕСТИТЬ Артикулы
		|ИЗ
		|	&Артикулы КАК Артикулы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Артикулы.Артикул КАК Артикул,
		|	Номенклатура.Ссылка КАК Номенклатура
		|ИЗ
		|	Артикулы КАК Артикулы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО Артикулы.Артикул = Номенклатура.Артикул";
		
		Запрос.УстановитьПараметр("Артикулы",Ответ.Данные.Цены);
		ТаблицаНоменклатуры = Запрос.Выполнить().Выгрузить();
		ТаблицаНоменклатуры.Индексы.Добавить("Артикул");
		//Загрузка цен номенклатуры 
		ТипЦены = Справочники.ТипыЦен.ОсновнойТипЦенПродажи;
		Если Ответ.Данные.Цены.Количество() > 0 Тогда
			//В регистр
			Набор = РегистрыСведений.Renault_ТарифЦен.СоздатьНаборЗаписей();
			Для Каждого Стр Из Ответ.Данные.Цены Цикл
				Запись = Набор.Добавить();
				Запись.Артикул = Стр.Артикул; 
				Запись.ТипЦены = ТипЦены;
				Запись.ДатаТарифа = Стр.ДатаТарифа;
				Запись.Цена = Стр.Цена;
				Запись.КодВалюты = "RUB";
			КонецЦикла;
			Если Набор.Количество() > 0 Тогда
				Набор.Записать();
			КонецЕсли;
			
			//в документ
			Док = Документы.ИзменениеЦен.СоздатьДокумент();
			Док.ТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенПродажи;
			Док.ВалютаДокумента = Валюта;
			Док.КурсДокумента = 1;
			Док.БазовыйТипЦен = ТипЦены;
			Если Док.ТипЦен.ЦенаВключаетНДС Тогда
				Множитель = 1 + Справочники.СтавкиНДС.ОсновнаяСтавкаНДС.Ставка/100;
				//Множитель = 1.18;
			Иначе
				Множитель = 1;
			КонецЕсли;
			Док.Организация = ВыборкаДилеров.Организация;
			Док.Автор = ПараметрыСеанса.Пользователь;
			Док.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
			Док.ХозОперация = Справочники.ХозОперации.УстановкаЦенКомпании;
			Док.ПодразделениеКомпанииПолучатель = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
			Док.ОбработкаРеквизита("ТипЦен");
			Для Каждого Стр Из Ответ.Данные.Цены Цикл
				Док.Дата = Стр.ДатаТарифа;
				ДокСтр = Док.Товары.Добавить();
				ДокСтр.Номенклатура = ТаблицаНоменклатуры.Найти(Стр.Артикул,"Артикул").Номенклатура;
				Док.ОбработкаРеквизита("Товары.Номенклатура", ДокСтр);
				ДокСтр.Цена = Стр.Цена * Множитель;
				Док.ОбработкаРеквизита("Товары.Цена", ДокСтр); 
			КонецЦикла;
			Док.ОбменДанными.Загрузка = Истина;
			Док.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;     
		
		//удалить регистрацию объектов
		Ответ="";
		ИмяФункции="Renault_Открытый.ЗафиксироватьУспешнуюОтправкуПакетаНоменклатуры";
		Package=DMS_DataExchange.newPackage(Новый Структура("МассивМД,ПолныйBIR,Бренд",МассивМД,BIR,Бренд));
		Если НЕ DMS_DataExchange.sendMessage(DMS_ОбщиеПовторныеФункции.ПараметрыHTTPСоединения(),"DictionaryHTTP",ИмяФункции,Package,Ответ) Тогда
			Если Интерактивно Тогда 
				Сообщить(Ответ,СтатусСообщения.Внимание) 
			Иначе 
				ЗаписьЖурналаРегистрации(ИмяФункции,УровеньЖурналаРегистрации.Ошибка,,,Ответ) 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры




