Процедура ЗаполнитьРасчет(Настройки) Экспорт

	Запрос = Новый Запрос;
			
	Запрос.УстановитьПараметр("Ссылка", СкладКомпании.Подразделение); 
			
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПодразделенияКомпании.Ссылка КАК Подразделение,
	               |	0 КАК Приоритет
	               |ИЗ
	               |	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	               |ГДЕ
	               |	ПодразделенияКомпании.Ссылка = &Ссылка
	               |ИТОГИ ПО
	               |	Ссылка ТОЛЬКО ИЕРАРХИЯ";
	
	ТабПодразд = Запрос.Выполнить().Выгрузить();
	
	// Самый высокий приоритет - с максимальным числом
	Для каждого стр Из ТабПодразд Цикл
		стр.Приоритет = ТабПодразд.Индекс(стр)+1;
	КонецЦикла;

	СКД = ЭтотОбъект.ПолучитьМакет("ЗапросРасчет");

	Если ЗначениеЗаполнено(ТипЦен) Тогда
		пТипыЦены = ТипЦен;
	Иначе	
		пТипыЦены = Справочники.Renault_ОбщиеНастройкиБазыДанных.ЭтаБаза.PNCЗакупСкладская;
	    НастройкиЗЧ = Renault_CRM.ПолучитьНастройкиЗапчастей();
		пТипыЦены = НастройкиЗЧ.ТипЦенPNC;
	КонецЕсли;

    ПараметрыДанных = Настройки.Настройки.ПараметрыДанных;
    ПараметрыДанных.УстановитьЗначениеПараметра("ГруппаАнализа",     ГруппаАнализаПродаж);
	ПараметрыДанных.УстановитьЗначениеПараметра("ГруппаДоступности", ГруппаДоступностиСкладов);
    ПараметрыДанных.УстановитьЗначениеПараметра("Подразделение",     СкладКомпании.Подразделение);
    ПараметрыДанных.УстановитьЗначениеПараметра("СкладКомпании",     СкладКомпании);
    ПараметрыДанных.УстановитьЗначениеПараметра("ПериодДата",        КонецДня(ДатаАнализа));
    ПараметрыДанных.УстановитьЗначениеПараметра("ПериодГраница",     Новый Граница(КонецДня(ДатаАнализа), ВидГраницы.Включая));
    ПараметрыДанных.УстановитьЗначениеПараметра("ТипЦены",           пТипыЦены);
	ПараметрыДанных.УстановитьЗначениеПараметра("ТекущаяДата",       НачалоДня(ТекущаяДата()));

    КомпоновщикМакета   = Новый КомпоновщикМакетаКомпоновкиДанных;
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорВывода     = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;

    МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, Настройки.Настройки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);

    Таблица = Новый ТаблицаЗначений;

    ПроцессорВывода.УстановитьОбъект(Таблица);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	Если ЗначениеЗаполнено(ТипЦен) Тогда
	
		Запрос = Новый Запрос;
				
		Запрос.УстановитьПараметр("ТЗ",            Таблица); 
		Запрос.УстановитьПараметр("Подразделения", ТабПодразд); 
		Запрос.УстановитьПараметр("Период",        КонецДня(ДатаАнализа));
		Запрос.УстановитьПараметр("ТипЦены",       ТипЦен);
				
		Запрос.Текст = "ВЫБРАТЬ
		               |	*
		               |ПОМЕСТИТЬ ВТ_ТЗ
		               |ИЗ
		               |	&ТЗ КАК ТЗ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Подразделения.Подразделение,
		               |	Подразделения.Приоритет
		               |ПОМЕСТИТЬ ВТ_Подразделения
		               |ИЗ
		               |	&Подразделения КАК Подразделения
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
		               |	ЦеныСрезПоследних.Цена,
		               |	ВТ_Подразделения.Приоритет
		               |ПОМЕСТИТЬ ВТ_ЦеныПодготовка
		               |ИЗ
		               |	РегистрСведений.Цены.СрезПоследних(
		               |			&Период,
		               |			Номенклатура В (ВЫБРАТЬ ВТ_ТЗ.Номенклатура ИЗ ВТ_ТЗ КАК ВТ_ТЗ) 
					   |			И ТипЦен = &ТипЦены
		               |				И ПодразделениеКомпании В (&Подразделения)) КАК ЦеныСрезПоследних
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Подразделения КАК ВТ_Подразделения
		               |		ПО ЦеныСрезПоследних.ПодразделениеКомпании = ВТ_Подразделения.Подразделение
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ЦеныПодготовка.Номенклатура,
		               |	ВТ_ЦеныПодготовка.Цена
		               |ПОМЕСТИТЬ ВТ_Цены
		               |ИЗ
		               |	ВТ_ЦеныПодготовка КАК ВТ_ЦеныПодготовка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			ВТ_ЦеныПодготовка.Номенклатура КАК Номенклатура,
		               |			МАКСИМУМ(ВТ_ЦеныПодготовка.Приоритет) КАК Приоритет
		               |		ИЗ
		               |			ВТ_ЦеныПодготовка КАК ВТ_ЦеныПодготовка
		               |		
		               |		СГРУППИРОВАТЬ ПО
		               |			ВТ_ЦеныПодготовка.Номенклатура) КАК MAXПриоритет
		               |		ПО ВТ_ЦеныПодготовка.Номенклатура = MAXПриоритет.Номенклатура
		               |			И ВТ_ЦеныПодготовка.Приоритет = MAXПриоритет.Приоритет
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	*
		               |ИЗ
		               |	ВТ_ТЗ КАК ВТ_ТЗ
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
		               |		ПО ВТ_ТЗ.Номенклатура = ВТ_Цены.Номенклатура";
		
		Таблица = Запрос.Выполнить().Выгрузить();	
		
		Таблица.Колонки.Удалить("ЦенаPNC");
		
		КолЦена = Таблица.Колонки.Найти("Цена");
		КолЦена.Имя = "ЦенаPNC";

	КонецЕсли;
	
    Для каждого Выборка Из Таблица Цикл

		// Не смог определить откуда появляются такие строки
		Если Выборка.Номенклатура = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
        Стр = Товары.Добавить();                   
        ЗаполнитьЗначенияСвойств(Стр, Выборка);

        Стр.Заказ = Стр.СредниеПродажи * ПериодЗаказа / 30; // Потребление на период заказа
        Стр.Заказ = Окр(Стр.Заказ + 0.5, 0, 0);             // Окр. в большую
        Стр.Заказ = Стр.Заказ + Стр.ТочкаЗаказа - Стр.Итог; // Поправка на точку и остаток
        Стр.Заказ = ?(Стр.Заказ > 0, Стр.Заказ, 0);         // Убираем отрицетельные

        Если Стр.ABCКласс = Перечисления.Renault_ABCКлассификация.DКласс        // Неликвид
                ИЛИ Стр.XYZКласс = Перечисления.Renault_XYZКлассификация.ZКласс // Непредсказуем
                ИЛИ Стр.Статус = Справочники.Renault_СтатусыНоменклатуры.OFF    // Устаревший реферанс
                ИЛИ Стр.Статус = Справочники.Renault_СтатусыНоменклатуры.KEY    // Кодовая запчасть
                    Тогда
            Стр.КЗаказу = 0;
        ИначеЕсли Стр.Итог > Стр.ТочкаЗаказа Тогда // Не достигли точки заказа
            Стр.КЗаказу = 0;
        Иначе
            Стр.КЗаказу = Стр.Заказ;
        КонецЕсли;

		Если ТипЗнч(Стр.ЦенаPNC) = Тип("Null") Тогда
			Стр.КЗаказу = 0;
		Иначе	
        	Стр.СтоимостьЗаказа = Стр.КЗаказу * Стр.ЦенаPNC;
		КонецЕсли;

    КонецЦикла;

    Товары.Сортировать("КЗаказу УБЫВ, Заказ УБЫВ, ABCКласс");

КонецПроцедуры