
&НаКлиенте
Процедура ОформитьКарточку(Команда)
	ОткрытьФорму("Справочник.DMS_КарточкиКлиентов.Форма.ФормаОформленияКарты");
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПоVIN(Команда)
	
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить(КодВозвратаДиалога.Да,"по VIN");
	СписокКнопок.Добавить(КодВозвратаДиалога.Нет,"по автомобилю");
	СписокКнопок.Добавить(КодВозвратаДиалога.Отмена,"Отмена");
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ВыполнитьПроверкуКраточки",ЭтаФорма),"Выполнить проверку наличия карточки",СписокКнопок,30,КодВозвратаДиалога.Да,"Выберите способо проверки",КодВозвратаДиалога.Отмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкуКраточки(РезультатВопроса, ПараметрыЗаписи) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		VIN = "";
		ВвестиСтроку(VIN,"Введите VIN");
		Если ЗначениеЗаполнено(VIN) Тогда
			СозданиеКарточкиПоVin(VIN);
		КонецЕсли;

	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		
		Автомобиль = ОткрытьФормуМодально("Справочник.Автомобили.ФормаВыбора");
		Если Автомобиль <> Неопределено Тогда
			VIN = Автомобиль.VIN;
			Если ЗначениеЗаполнено(VIN) Тогда
				СозданиеКарточкиПоVin(VIN);
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;	

	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеКарточкиПоVin(VIN) 
	
	Если Справочники.DMS_КарточкиКлиентов.НайтиПоРеквизиту("VIN",VIN).Пустая() Тогда
		ТаблицаРезультат = Справочники.DMS_КарточкиКлиентов.НайтиДанныеПоVINАвтомобиля(VIN);
		Если ЗначениеЗаполнено(ТаблицаРезультат) Тогда
			//СозданиеКарточки
			СтрокаТаблицы = Неопределено;
			
			Если ТаблицаРезультат.Количество()>1 Тогда
				СтрокаТаблицы = ТаблицаРезультат.ВыбратьСтроку("Выберите набор данных для создания карточки"); 
				
			ИначеЕсли ТаблицаРезультат.Количество() = 1 тогда
				СтрокаТаблицы = ТаблицаРезультат.Получить(0);	
			КонецЕсли;	
			
			Если СтрокаТаблицы = Неопределено Тогда 
				Возврат;
			КонецЕсли;
			Карта = Справочники.DMS_КарточкиКлиентов.СоздатьКарточкуКлиента(СтрокаТаблицы);
			ЭтаФорма.ОбновитьОтображениеДанных(); 		
			ПоказатьПредупреждение(Новый ОписаниеОповещения("ОткрытьКарточку", ЭтаФорма, Новый Структура("Карта", Карта)), "Загружена новая карточка клиента по данному VIN автомобиля");
		Иначе	
			
			ПоказатьПредупреждение(,"Нет данных по VIN: " + Строка(VIN),,"Внимание!");
			
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ОткрытьКарточку", ЭтаФорма, Новый Структура("VIN", VIN)), "Уже есть карточка клиента по данному VIN автомобиля");
	КонецЕсли;
	
	
				
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточку(ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.Свойство("Карта") Тогда
		ОткрытьЗначение(ДополнительныеПараметры.Карта);
		Возврат;
	КонецЕсли;
	 
	VIN = ДополнительныеПараметры.VIN;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	DMS_КарточкиКлиентов.Ссылка,
		|	DMS_КарточкиКлиентов.ВидКарты,
		|	DMS_КарточкиКлиентов.Клиент,
		|	DMS_КарточкиКлиентов.Автомобиль,
		|	DMS_КарточкиКлиентов.ДатаНачалаГарантии,
		|	DMS_КарточкиКлиентов.ДатаОкончанияГарантии
		|ИЗ
		|	Справочник.DMS_КарточкиКлиентов КАК DMS_КарточкиКлиентов
		|ГДЕ
		|	DMS_КарточкиКлиентов.VIN = &VIN";
	
	Запрос.УстановитьПараметр("VIN", VIN);
	
	Карточки = Запрос.Выполнить().Выгрузить();
	Если Карточки.Количество() = 1 Тогда
		Карточка = Карточки.Получить(0).Ссылка;
	Иначе
		СтрокаТЗ = Карточки.ВыбратьСтроку("Выберите карточку для открытия");
		Если СтрокаТЗ = Неопределено Тогда
			Возврат;
		КонецЕсли;  
		Карточка = СтрокаТЗ.Ссылка;
	КонецЕсли;
	
	ОткрытьЗначение(Карточка);	

КонецПроцедуры

//&НаКлиенте
//Процедура НапечататьАктПередачи(Команда)
//	
//	
//	
//	ТабДок = Новый ТабличныйДокумент;
//	ПечатьАктаПередачи(ТабДок);
//	ТабДок.Показать("Акт передачи");
//	
//		
//КонецПроцедуры


//&НаСервере
//Процедура Печать(ТабДок)
//	
//	ИмяМакета = Справочники.DMS_ВидыКарточекКлиента.ПолучитьИмяПредопределенного(ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока.ВидКарты);
//	
//	Справочники.DMS_КарточкиКлиентов.Печать(ТабДок, ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока,ИмяМакета);
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПечатьАктаПередачи(ТабДок)

//	Справочники.DMS_КарточкиКлиентов.ПечатьАктаПередачи(ТабДок, ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура НапечататьДоговор(Команда)
//	
//	ТабДок = Новый ТабличныйДокумент;
//	Печать(ТабДок);
//	ТабДок.Показать("Договор");
//	
//КонецПроцедуры
