Функция ВернутьСписокПроизводителей() 
	Запрос = Новый ЗАпрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_ДилерскиеЦентры.Бренд КАК Производитель
	               |ИЗ
	               |	Справочник.CRM_ДилерскиеЦентры КАК CRM_ДилерскиеЦентры
	               |ГДЕ
	               |	НЕ CRM_ДилерскиеЦентры.ПометкаУдаления
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	CRM_ДилерскиеЦентры.Бренд";
	МассивПроизводителей = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Производитель");
	СписокПроизводителей = Новый СписокЗначений;
	СписокПроизводителей.ЗагрузитьЗначения(МассивПроизводителей);
	Возврат СписокПроизводителей; 
КонецФункции	

Функция ВернутьПроизводителя(ФормаВладелец)
	
	спПроизводители = ВернутьСписокПроизводителей();
	
	Если спПроизводители.Количество() = 1 Тогда 
		МассивПроизводителей = Новый Массив;
		МассивПроизводителей.Добавить(спПроизводители[0].Значение);
		
		Возврат МассивПроизводителей; 
	КонецЕсли;
	
	Парам = Новый Структура;
	Парам.Вставить("Список", спПроизводители);
	Парам.Вставить("Заголовок", "Производитель");
	Парам.Вставить("МножественныйВыбор", Ложь);
	Парам.Вставить("КоличествоЭлементовВСтроке", 4);
	Парам.Вставить("ШиринаЭлемента", 12);
	Парам.Вставить("ВысотаЭлемента", 2);
	Производитель =  ОткрытьФормуМодально("ОбщаяФорма.Renault_ДиалогВыбораСпискаЗначений", Парам, ФормаВладелец);
	
	
	Если Не ЗначениеЗаполнено(Производитель) тогда
		МассивПроизводителей = спПроизводители.ВыгрузитьЗначения();
	Иначе
		МассивПроизводителей = Новый Массив;
		МассивПроизводителей.Добавить(Производитель);
	КонецЕСли;	
	Возврат МассивПроизводителей;
КонецФункции	

Процедура ЗагрузитьИнтернетЗаказы(ФормаВладелец) Экспорт
	МассивПроизводителей = ВернутьПроизводителя(ФормаВладелец);
	
	#Если Клиент тогда		
		Сообщить("Запущена синхронизация "+ТекущаяДата());
	#КонецЕсли
	//ОчиститьДанные();
	ИнтернетЗаказы(МассивПроизводителей,Истина);
	
	#Если Клиент тогда
		Сообщить("Синхронизация завершена "+ТекущаяДата());	
	#КонецЕсли
КонецПроцедуры	

function DataBaseId() export
	ComputerName=Lower(ComputerName());
	str=Lower(InfoBaseConnectionString());
	str=StrReplace(str,"localhost",ComputerName);
	str=StrReplace(str,"127.0.0.1",ComputerName);
	return str
endfunction	

Функция ИнтернетЗаказы(МассивПроизводителей,Интерактивно=Ложь) Экспорт
	Ошибка=Ложь;
	АдресСервера=DataBaseId();
	
	//цикл по производителям, а значит по разным Gate с разными параметрами подключения
	Для Каждого Производитель Из МассивПроизводителей Цикл
		Если Интерактивно Тогда Сообщить("Производитель "+Производитель) КонецЕсли;

		//получить данные по синхронизации внешних источников
		ДанныеВнИсточников=РегистрыСведений.DMS_СинхронизацияВнешнихИсточниковДанных.ПолучитьДанныеСинхронизации(Производитель);
		МассивBIR=DMS_ОбщиеПовторныеФункции.BIRs(); //массив BIR по производителю, короткий BIR для RENAULT
		
		Ответ="";
		ИмяФункции="DMS_ИнтернетЗаказы.ЗапросИнтернетЗаказов";
		Пакет=DMS_DataExchange.newPackage(Новый Структура("АдресСервера,BIRs,ДанныеВнИсточников",АдресСервера,МассивBIR,ДанныеВнИсточников));
		Если НЕ DMS_DataExchange.sendMessage(DMS_ОбщиеПовторныеФункции.ПараметрыHTTPСоединения(,Производитель),,ИмяФункции,Пакет,Ответ) Тогда 
			Если Интерактивно Тогда Сообщить(Ответ,СтатусСообщения.Внимание) Иначе ЗаписьЖурналаРегистрации(ИмяФункции,УровеньЖурналаРегистрации.Ошибка,,,Ответ) КонецЕсли;
			Ошибка=Истина;
			Продолжить	//Возврат Ложь
		КонецЕсли;
		
		//загрузка интернет заказов
		Если ТипЗнч(Ответ)=Тип("ТаблицаЗначений") Тогда
			СтруктураСинхронизацииВнДанных=Новый Структура;
			КолВоОбработанныхИнтернетЗаказов=0;
			ЕстьОшибки=Ложь;
			Для Каждого ДанныеИнтернетЗаказа Из Ответ Цикл
				Если ДанныеИнтернетЗаказа.STATUS=2 Тогда //подтвержденный заказ
					Если СоздатьИнтернетЗаказ(ДанныеИнтернетЗаказа,Производитель,Интерактивно) Тогда
						КолВоОбработанныхИнтернетЗаказов=КолВоОбработанныхИнтернетЗаказов+1;
						Если НЕ ЕстьОшибки Тогда СтруктураСинхронизацииВнДанных.Вставить(ДанныеИнтернетЗаказа.ИмяВнешнегоИсточника,ДанныеИнтернетЗаказа.ДатаЗаписи)	КонецЕсли;	
					Иначе
						ЕстьОшибки=Истина;
					КонецЕсли;	
				ИначеЕсли ДанныеИнтернетЗаказа.STATUS=9 Тогда //удалить заказ
					Если УдалитьИнтернетЗаказ(ДанныеИнтернетЗаказа,Производитель,Интерактивно) Тогда
						КолВоОбработанныхИнтернетЗаказов=КолВоОбработанныхИнтернетЗаказов+1;
						Если НЕ ЕстьОшибки Тогда СтруктураСинхронизацииВнДанных.Вставить(ДанныеИнтернетЗаказа.ИмяВнешнегоИсточника,ДанныеИнтернетЗаказа.ДатаЗаписи)	КонецЕсли;	
					Иначе
						ЕстьОшибки=Истина;
					КонецЕсли	
				Иначе //STATUS=1 - не обрабатываем предварительные заказы
				КонецЕсли;	
			КонецЦикла;
			
			//установить данные по синхронизации внешних источников
			РегистрыСведений.DMS_СинхронизацияВнешнихИсточниковДанных.УстановитьДанныеСинхронизации(Производитель,СтруктураСинхронизацииВнДанных);
			Если Интерактивно Тогда Сообщить("Обработано "+КолВоОбработанныхИнтернетЗаказов+" из "+Ответ.Количество()+" позиций интернет заказов") КонецЕсли;
		Иначе
			Если Интерактивно Тогда Сообщить("Не верный ответ сервера") КонецЕсли;
			ЕстьОшибки=Истина;
			Продолжить
		КонецЕсли;	
		
	КонецЦикла;
	
	Если Интерактивно Тогда Сообщить("Загрузка "+?(Ошибка,"не выполнена","выполнена успешно")) КонецЕсли;
	Возврат Не Ошибка
КонецФункции

//программное создание Трафик+РЛ+КП+Договор+Резерв
//где ДанныеИнтернетЗаказа поля: DEALER_BIR_CODE,VIN,WEB_NO,WEB_DATE,CUSTOMER_FIO,CUSTOMER_PHONE,CUSTOMER_EMAIL,STATUS 
Функция СоздатьИнтернетЗаказ(ДанныеИнтернетЗаказа,Производитель,Интерактивно)
	//
	//СвВаДЦ=DMS_ДилерскиеЦентры.ДилерскийЦентр(Производитель,"Ссылка,Организация");
	//
	//Автомобиль=DMS_Автомобили.АвтомобильПоVIN(ДанныеИнтернетЗаказа.VIN);
	//Если Автомобиль.Пустая() Тогда 
	//	Если Интерактивно Тогда Сообщить("Не найден автомобиль VIN "+ДанныеИнтернетЗаказа.VIN+" по интернет заказу № "+Формат(ДанныеИнтернетЗаказа.WEB_NO,"ЧГ=0")) КонецЕсли;
	//	Возврат Ложь
	//КонецЕсли;	
	//
	////СуммаЗаказа=ДанныеИнтернетЗаказа.... так должно быть
	////актуальныю сумму должны передать из источника данных VAZ, а пока база
	//СуммаЗаказа=DMS_Автомобили.ПолучитьСтоимостьБазы(DMS_Автомобили.АвтомобильПоVIN(ДанныеИнтернетЗаказа.VIN)); //*это костыль
	//Если СуммаЗаказа=0 Тогда 
	//	Если Интерактивно Тогда Сообщить("Не определена стоимость автомобиля VIN "+ДанныеИнтернетЗаказа.VIN+" по интернет заказу № "+Формат(ДанныеИнтернетЗаказа.WEB_NO,"ЧГ=0")+", резервирование не возможно") КонецЕсли;
	//	Возврат Ложь
	//КонецЕсли;	
	//
	////Трафик
	//Трафик=DMS_Трафик.НайтиИнтернетТрафик(СвВаДЦ.Ссылка,ДанныеИнтернетЗаказа.WEB_NO); //поиск существующего трафика
	//Трафик=?(Трафик=Неопределено,Задачи.DMS_Трафик.ПолучитьСсылку(Новый УникальныйИдентификатор),Трафик);
	//
	//Контрагент=DMS_CRM.НовыйКонтрагент(ДанныеИнтернетЗаказа.CUSTOMER_FIO,ДанныеИнтернетЗаказа.CUSTOMER_PHONE,ДанныеИнтернетЗаказа.CUSTOMER_EMAIL,Трафик);
	//
	//ТрафикОбъект=Трафик.ПолучитьОбъект();
	//Если ТрафикОбъект=Неопределено Тогда
	//	ТрафикОбъект=Задачи.DMS_Трафик.СоздатьЗадачу();
	//	ТрафикОбъект.УстановитьСсылкуНового(Трафик);
	//КонецЕсли;	
	//
	//ТрафикОбъект.Дата=ДанныеИнтернетЗаказа.WEB_DATE;
	//ТрафикОбъект.weborder_no=ДанныеИнтернетЗаказа.WEB_NO;
	//ТрафикОбъект.ТипТрафика=Перечисления.DMS_ТипыТрафика.ИнтернетЗаказ;
	//ТрафикОбъект.ДилерскийЦентр=СвВаДЦ.Ссылка;
	//ТрафикОбъект.Организация=СвВаДЦ.Организация;
	//
	//ТрафикОбъект.Администратор=ПараметрыСеанса.ТекущийПользователь;
	//ТрафикОбъект.Клиент=Контрагент.Партнер; //ДанныеИнтернетЗаказа.CUSTOMER_FIO;
	////ТрафикОбъект.НомерЛида
	////ТрафикОбъект.Повторный
	////ТрафикОбъект.ПредыдущийТрафик
	////ТрафикОбъект.Пол
	//ТрафикОбъект.Комментарий="Создан автоматически";;
	////ТрафикОбъект.КонтактнаяИнформацияЗначенияПолей
	//ТрафикОбъект.КонтактнаяИнформацияПредставление=ДанныеИнтернетЗаказа.CUSTOMER_EMAIL;
	//ТрафикОбъект.КонтактнаяИнформацияТип=Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	//ТрафикОбъект.КонтактнаяИнформацияВид=Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
	//
	//ТрафикОбъект.Подразделение=ПараметрыСеанса.DMS_ТекущееПодразделение;
	//ТрафикОбъект.Менеджер=ПараметрыСеанса.ТекущийПользователь;
	//ТрафикОбъект.ПервичныйИнтерес=DMS_Автомобили.Автомобиль(Автомобиль,"ВариантКомплектации.Модель Модель");
	//ТрафикОбъект.ИсточникИнформации=Справочники.DMS_ИсточникиИнформации.ЛМТ;
	//ТрафикОбъект.Приоритет=Перечисления.Приоритеты.Средний;
	////ТрафикОбъект.Выполнена=Истина; //-устанавливается автоматически
	//ТрафикОбъект.Комментарий="Загружен по данным производителя";
	//
	////Если ТрафикОбъект.Состояние<>Справочники.DMS_Состояния.Обработан Тогда
	////	ТрафикОбъект.Состояние=Справочники.DMS_Состояния.Обработан;
	////	Стр=ТрафикОбъект.Состояния.Добавить();
	////	Стр.Дата=ТрафикОбъект.Дата;
	////	Стр.Пользователь=ПараметрыСеанса.ТекущийПользователь;
	////	Стр.Состояние=Справочники.DMS_Состояния.Обработан;
	////	Стр.Комментарий="Создан автоматически";
	////	//Стр.ПричинаИзменения
	////КонецЕсли;	
	//
	//Попытка ТрафикОбъект.Записать()
	//Исключение
	//	Если Интерактивно Тогда Сообщить("Не удалось записать трафик по интернет заказу № "+Формат(ДанныеИнтернетЗаказа.WEB_NO,"ЧГ=0")+", "+ОписаниеОшибки()) КонецЕсли;
	//	Возврат Ложь
	//КонецПопытки;
	//
	//ТаблАвтомобилей=Новый ТаблицаЗначений;
	//ТаблАвтомобилей.Колонки.Добавить("Номенклатура");
	//ТаблАвтомобилей.Колонки.Добавить("Сумма");
	//Строка=ТаблАвтомобилей.Добавить();
	//Строка.Номенклатура=Автомобиль;
	//Строка.Сумма=СуммаЗаказа;
	//
	////договор контрагента
	//Запрос=Новый Запрос("Выбрать Ссылка Из Справочник.ДоговорыКонтрагентов ГДЕ Контрагент=&Контрагент И Организация=&Организация И Номер=&Номер");
	//Запрос.УстановитьПараметр("Контрагент",Контрагент);
	//Запрос.УстановитьПараметр("Организация",СвВаДЦ.Организация);
	//Запрос.УстановитьПараметр("Номер",ДанныеИнтернетЗаказа.WEB_NO);
	//Выборка=Запрос.Выполнить().Выбрать();
	//ДоговорПродажи=?(Выборка.Следующий(),Выборка.Ссылка.ПолучитьОбъект(),Справочники.ДоговорыКонтрагентов.СоздатьЭлемент());
	//ЗаполнитьЗначенияСвойств(ДоговорПродажи,
	//	DMS_CRM.СтруктураДоговораКонтрагента(
	//		ДанныеИнтернетЗаказа.WEB_DATE,
	//		ДанныеИнтернетЗаказа.WEB_NO, //DMS_CRM.НовыйНомерДоговора(СвВаДЦ.Организация),
	//		"",
	//		Перечисления.ТипыДоговоров.СПокупателем,
	//		СвВаДЦ.Организация,
	//		ПараметрыСеанса.DMS_ТекущееПодразделение,
	//		Контрагент.Партнер,
	//		Контрагент,
	//		ПараметрыСеанса.ТекущийПользователь,
	//		СуммаЗаказа,
	//		DMS_ДилерскиеЦентры.ОсновнаяСтавкаНДС(СвВаДЦ.Организация)
	//	)
	//);
	//Попытка ДоговорПродажи.Записать()
	//Исключение
	//	Если Интерактивно Тогда Сообщить("Не удалось записать договор по интернет заказу № "+Формат(ДанныеИнтернетЗаказа.WEB_NO,"ЧГ=0")+", "+ОписаниеОшибки()) КонецЕсли;
	//	Возврат Ложь
	//КонецПопытки;
	//
	//Резерв=DMS_CRM.СоздатьЗаказКлиента(
	//	Трафик,
	//	ДанныеИнтернетЗаказа.WEB_DATE,
	//	СвВаДЦ.Организация,
	//	Производитель,
	//	Контрагент.Партнер,
	//	Контрагент,
	//	ДоговорПродажи,
	//	ТаблАвтомобилей);
	//	
	//Если Резерв=Неопределено Или Не Резерв.Проведен Тогда
	//	Если Интерактивно Тогда Сообщить("Не удалось создать резерв по интернет заказу № "+Формат(ДанныеИнтернетЗаказа.WEB_NO,"ЧГ=0")+", "+Символы.ПС+ОписаниеОшибки()) КонецЕсли;
	//	Возврат Ложь
	//КонецЕсли;	
	//	
	//Возврат Истина
КонецФункции

Функция УдалитьИнтернетЗаказ(ДанныеИнтернетЗаказа,Производитель,Интерактивно) //Трафик упущен, Резерв отменен...
	//СвВаДЦ=DMS_ДилерскиеЦентры.ДилерскийЦентр(Производитель,"Ссылка,Организация");
	////НомерЛида="e"+Формат(ДанныеИнтернетЗаказа.WEB_NO,"ЧГ=0"); //номер заказа с префиксом
	//
	//Трафик=DMS_Трафик.НайтиИнтернетТрафик(СвВаДЦ.Ссылка,ДанныеИнтернетЗаказа.WEB_NO);
	//Если Трафик=Неопределено Тогда Возврат Истина КонецЕсли; //ошибка, трафик не найден, удалять нечего
	//
	////трафик упущен
	//Если Трафик.Состояние<>Справочники.DMS_Состояния.Упущен Тогда
	//	ТрафикОбъект=Трафик.ПолучитьОбъект();
	//	ТрафикОбъект.Выполнена=Истина; //-устанавливается автоматически
	//	ТрафикОбъект.Состояние=Справочники.DMS_Состояния.Упущен;
	//	Стр=ТрафикОбъект.Состояния.Добавить();
	//	Стр.Дата=ТекущаяДата();
	//	Стр.Пользователь=ПараметрыСеанса.ТекущийПользователь;
	//	Стр.Состояние=Справочники.DMS_Состояния.Упущен;
	//	Стр.Комментарий="Отмена интернет-заказа";
	//	Стр.ПричинаИзменения=Справочники.DMS_ПричиныИзмененияСостояния.Прочее;
	//	
	//	Попытка ТрафикОбъект.Записать()
	//	Исключение
	//		Если Интерактивно Тогда Сообщить("Не удалось отменить трафик по интернет заказу № "+Формат(ДанныеИнтернетЗаказа.WEB_NO,"ЧГ=0")+", "+ОписаниеОшибки()) КонецЕсли;
	//		Возврат Ложь
	//	КонецПопытки;	
	//КонецЕсли;	
	//
	////отмена резерва
	//ЗаказКлиента=DMS_CRM.ЗаказКлиентаПоТрафик(Трафик);
	//Если ЗаказКлиента.Пустая() ИЛИ Не ЗаказКлиента.Проведен Тогда Возврат Истина КонецЕсли;	//ошибка, резерв не найден, удалять нечего
	//Док=ЗаказКлиента.ПолучитьОбъект();
	//Док.ДополнительныеСвойства.Вставить("СозданиеИнтернетЗаказа"); //отключить защиту от редактирования для интернет заказов
	//
	//Попытка Док.Записать(РежимЗаписиДокумента.ОтменаПроведения)
	//Исключение
	//	Если Интерактивно Тогда Сообщить("Не удалось отменить резерв по интернет заказу № "+Формат(ДанныеИнтернетЗаказа.WEB_NO,"ЧГ=0")+", "+ОписаниеОшибки()) КонецЕсли;
	//	Возврат Ложь
	//КонецПопытки;	
	//
	//Возврат Истина
КонецФункции

