///////////////////////////////////////////////////////////////////////////////
// Модуль формы комментария регистра "Обращения CRM"
//
///////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийЭлементовФормы  

&НаКлиенте
Процедура КомментарийОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Список = ПолучитьСписокКомментариевПоПодстроке(Текст);
	Если Список.Количество() = 0 Тогда         
		Комментарий = Текст;
		Возврат;
	КонецЕсли;
	
	ВыбранныйЭлемент = ВыбратьИзСписка(Список,Элемент);	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Комментарий = ВыбранныйЭлемент.Значение;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокКомментариевПоПодстроке(ПодстрокаПоиска)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Инфотек_Комментарии.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Инфотек_Комментарии КАК Инфотек_Комментарии
	|ГДЕ
	|	Инфотек_Комментарии.Комментарий ПОДОБНО &ПодстрокаПоиска";
	Запрос.УстановитьПараметр("ПодстрокаПоиска", "%" + ПодстрокаПоиска + "%");
	
	Список = Новый СписокЗначений;	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Список.Добавить(СокрЛП(Выборка.Ссылка.Комментарий));
	КонецЦикла;
		
	Возврат Список;
	
КонецФункции

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ОткрытьФорму("Справочник.Инфотек_Комментарии.Форма.ФормаВыбора",ПараметрыФормы,,,,, Новый ОписаниеОповещения("КомментарийНачалоВыбораЗавершение", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры
  
&НаКлиенте
Процедура КомментарийНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	РезультатОткрытия = Результат;
	
	Если РезультатОткрытия = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	ОбработатьРезультатНаСервере(РезультатОткрытия);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатНаСервере(РезультатОткрытия)

	Комментарий = РезультатОткрытия.Комментарий;

КонецПроцедуры
	
	
#КонецОбласти

#Область ОбработчикиСобытийКомандФормы  

&НаКлиенте
Процедура ЗаписатьИзменения(Команда)  
	
	ЗаписатьИзмененияНаСервере();   
	ЭтаФорма.Закрыть();	

КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияНаСервере() 
	
	МенеджерЗаписи = РегистрыСведений.Инфотек_ОбращенияCRM.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Идентификатор = Параметры.Идентификатор;
	МенеджерЗаписи.НастройкаПодключения = Параметры.НастройкаПодключения;  
	МенеджерЗаписи.Статус = Параметры.Статус;
	МенеджерЗаписи.Прочитать();   
	Если МенеджерЗаписи.Выбран() Тогда  
		Если МенеджерЗаписи.Статус = Перечисления.Инфотек_СтатусыОбращений.НеВзятВРаботу Тогда
			Инфотек_ИнтеграцияCRM.ВзятьОбращениеВРаботу(МенеджерЗаписи,Параметры.НастройкаПодключения);
		КонецЕсли;
		МенеджерЗаписи.Комментарий = Комментарий;    
		Если Параметры.Отмена = Истина Тогда
			МенеджерЗаписи.Статус = Перечисления.Инфотек_СтатусыОбращений.ВОтказе;
		Иначе
			МенеджерЗаписи.Статус = Перечисления.Инфотек_СтатусыОбращений.Завершён; 
		КонецЕсли;	
		МенеджерЗаписи.Записать();
	КонецЕсли;  
	Если Параметры.Отмена = Истина Тогда 
		Инфотек_ИнтеграцияCRM.ЗавершитьОбращениеОтменой(МенеджерЗаписи,Параметры.НастройкаПодключения);
	Иначе
		Инфотек_ИнтеграцияCRM.ЗавершитьОбращениеКонсультацией(МенеджерЗаписи,Параметры.НастройкаПодключения);
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти
