
&НаСервере
Процедура ЗаписатьНаСервере()
	
	Для Каждого Строка ИЗ ТаблицаНаЗапись Цикл
		Запись = РегистрыСведений.CRM_ПрочитанныеНовости.СоздатьМенеджерЗаписи();
		Запись.ИдентификаторНовости = Новый УникальныйИдентификатор(Строка.ИдентификаторНовости);
		Запись.Прочитана = Истина;
		Запись.Сотрудник = ПараметрыСеанса.Пользователь.Сотрудник;
		Запись.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	ЗаписатьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНовостьНаСервере(ИндексНовости)
	
	СтрокаНовости = ТаблицаНовостей.Найти(Число(ИндексНовости), "ИндексСтроки");
	Если СтрНайти(СтрокаНовости.ТекстНовости,"<html>")<>0 тогда
		ТекстНовости = СтрокаНовости.ТекстНовости;
	Иначе
		ТекстНовости = "<html><body><h1>"+СтрокаНовости.ТекстНовости+"</h1></body></html>";
	КонецЕсли;	
	Элементы.ТекстНовости.Заголовок = СтрокаНовости.ЗаголовокНовости;
	Если ЭтаФорма.ТекущийЭлемент.ЦветТекста = Новый Цвет(0, 0, 255) Тогда
		НоваяЗапись = ТаблицаНаЗапись.Добавить();
		НоваяЗапись.НовостьПрочитана = Истина;
		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаНовости);
		ЭтаФорма.ТекущийЭлемент.ЦветТекста = Новый Цвет(255, 0, 255);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТаблицаНовостей = Параметры.Параметр;
	ТаблицаНовостей.Колонки.Добавить("ИндексСтроки");
	Индекс = 0;
	Для Каждого Строка ИЗ ТаблицаНовостей Цикл
		Индекс = Индекс+1;
		Декорация = Элементы.Добавить("Декорация"+Индекс, Тип("КнопкаФормы"), Элементы.ГруппаСписокНовостей);
		Строка.ИндексСтроки = Индекс;
		Декорация.Заголовок = Строка.ЗаголовокНовости;
		Декорация.ИмяКоманды = "ДекорацияНажатие";
		Декорация.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		Декорация.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет; 
		Декорация.ЦветТекста = Новый Цвет(0, 0, 255);
		Декорация.ЦветРамки = Новый Цвет(252, 250, 235);
		Декорация.ЦветФона = Новый Цвет(252, 250, 235);
		Декорация.Ширина = 20;
	КонецЦикла;
	
	ПерваяСтрока = ТаблицаНаЗапись.Добавить();
	ЗаполнитьЗначенияСвойств(ПерваяСтрока, ТаблицаНовостей[0]);
	ПерваяСтрока.НовостьПрочитана = Истина;
	ТекстНовости = ПерваяСтрока.ТекстНовости;
	Элементы.ТекстНовости.Заголовок = ПерваяСтрока.ЗаголовокНовости;
	Если Элементы.Найти("Декорация1") <> Неопределено Тогда
		Элементы.Найти("Декорация1").ЦветТекста = Новый Цвет(255, 0, 255);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНажатие(Команда)
	
	ТекущаяНовость = ЭтаФорма.ТекущийЭлемент.Имя;
	ИндексНовости = Сред(ТекущаяНовость, 10);
	ПрочитатьНовостьНаСервере(ИндексНовости);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьАрхив(Команда)
	
	Форма = ПолучитьФорму("Обработка.Renault_РаботаСНовостямиДилеров.Форма.АрхивНовостей");
	Форма.Открыть();
	
КонецПроцедуры


