// Функция возвращает массив идентификаторов записей телефонного разговора, доступных для прослушивания текущим пользователем
//
// Параметры:
//	ИдентификаторЗвонка	- Число	- Идентификатор звонка
//	ДатаНачало			- Дата	- Дата начала записи
//
// Возвращаемое значение:
//	Массив	- Массив идентификаторов записей телефонного разговора
//
Функция сфпПолучитьСписокЗаписейТелефонногоРазговора(ИдентификаторЗвонка, ДатаНачало) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторЗвонка",	ИдентификаторЗвонка);
	Запрос.УстановитьПараметр("НачалоЗаписи",			НачалоДня(ДатаНачало));
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	сфпЗаписиТелефонныхПереговоров.ИдентификаторЗвонка,
	|	сфпЗаписиТелефонныхПереговоров.ИдентификаторЗаписи,
	|	сфпЗаписиТелефонныхПереговоров.НачалоЗаписи,
	|	сфпЗаписиТелефонныхПереговоров.Пользователь,
	|	сфпЗаписиТелефонныхПереговоров.НомерВнТелефона,
	|	сфпЗаписиТелефонныхПереговоров.Контакт,
	|	сфпЗаписиТелефонныхПереговоров.НомерТелефона,
	|	сфпЗаписиТелефонныхПереговоров.ПродолжительностьЗаписи,
	|	сфпЗаписиТелефонныхПереговоров.ИмяЛинии
	|ИЗ
	|	РегистрСведений.сфпЗаписиТелефонныхПереговоров КАК сфпЗаписиТелефонныхПереговоров
	|ГДЕ
	|	сфпЗаписиТелефонныхПереговоров.ИдентификаторЗвонка = &ИдентификаторЗвонка
	|	И сфпЗаписиТелефонныхПереговоров.НачалоЗаписи >= &НачалоЗаписи";
	ТаблицаЗаписей = Запрос.Выполнить().Выгрузить();
	Возврат сфпСофтФонПроСервер.сфпТаблицаЗначенийВМассив(ТаблицаЗаписей);
КонецФункции // сфпСофтФонПроСервер.ПолучитьСписокЗаписейТелефонногоРазговора()

// Функция создает документ "Телефонный звонок"
//
// Параметры:
//	СтруктураЗвонка	- Структура	- Структура данных звонка
//
Функция сфпСоздатьТелефонныйЗвонок(СтруктураЗвонка, ДанныеЗаполнения) Экспорт
	НовыйЗвонок	= Документы["ТелефонныйЗвонок"].СоздатьДокумент();
	НовыйЗвонок["Дата"]						= сфпСофтФонПроСервер.сфпТекущаяДата();
	НовыйЗвонок["Входящий"]					= СтруктураЗвонка.ВходящийЗвонок;
	НовыйЗвонок["АбонентКакСвязаться"]		= СтруктураЗвонка.НомерТелефона; 
	НовыйЗвонок["Автор"]					= сфпСофтФонПроСервер.сфпТекущийПользователь();
	НовыйЗвонок["Важность"]					= Перечисления["Важность"].Средняя;
	НовыйЗвонок["Ответственный"]			= НовыйЗвонок["Автор"];
	НовыйЗвонок["сфпИдентификаторЗвонка"]	= СтруктураЗвонка.hCall;
	НовыйЗвонок["сфпИдентификаторЗаписи"]	= "";
	НовыйЗвонок["сфпДлительностьЗвонка"]	= 0;
	НовыйЗвонок["Тема"]						= сфпСофтФонПроСервер.сфпЗаполнитьТемуТелефонногоЗвонка(НовыйЗвонок["Входящий"], НовыйЗвонок["Дата"]);
	НовыйЗвонок["Описание"]					= сфпСофтФонПроСервер.сфпЗаполнитьОписаниеТелефонногоЗвонка(НовыйЗвонок["сфпДлительностьЗвонка"]);		
	// +АА5
	НовыйЗвонок["ХозОперация"]				= ПредопределенноеЗначение("Справочник.ХозОперации.ТелефонныйЗвонок");
	// -АА5	
	Если НЕ ЗначениеЗаполнено(СтруктураЗвонка.Контакт) Тогда
		Если ЗначениеЗаполнено(СтруктураЗвонка.ContactID) Тогда
			СтруктураЗвонка.Контакт	= сфпСофтФонПроСервер.сфпНайтиКонтактПоGUID(СтруктураЗвонка.ContactID);
		КонецЕсли;
	КонецЕсли;
	НастройкаПриВходящемЗвонке = сфпСофтФонПроСервер.сфпПолучитьЗначениеНастройкиПользователя("сфпДействиеПриВходящемЗвонке");
	НастройкаПриИсходящемЗвонке = сфпСофтФонПроСервер.сфпПолучитьЗначениеНастройкиПользователя("сфпДействиеПриИсходящемЗвонке");				
	Если НЕ ЗначениеЗаполнено(СтруктураЗвонка.Контакт) Тогда
		Если НЕ (СтруктураЗвонка.МассивЗвонящих = Неопределено) Тогда
			// по новому алгоритму мы всегда в телефонный звонок подставляем первый элемент из массива звонящих
			// если только не стоит настройка "Открывать телефонный звонок"
			Если (СтруктураЗвонка.ВходящийЗвонок И НастройкаПриВходящемЗвонке = Нстр("ru='Открыть телефонный звонок'")) 
				ИЛИ (НЕ СтруктураЗвонка.ВходящийЗвонок И НастройкаПриИсходящемЗвонке = Нстр("ru='Открыть телефонный звонок'")) Тогда
				Если СтруктураЗвонка.МассивЗвонящих.Количество() = 1 Тогда
					СтруктураЗвонка.Контакт	= СтруктураЗвонка.МассивЗвонящих[0];
				КонецЕсли;				
			Иначе
				Если СтруктураЗвонка.МассивЗвонящих.Количество() > 0 Тогда
					СтруктураЗвонка.Контакт	= СтруктураЗвонка.МассивЗвонящих[0];
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтруктураЗвонка.Контакт) Тогда
		НовыйЗвонок["АбонентКонтакт"]	= СтруктураЗвонка.Контакт;
		ВладелецКонтакт					= сфпСофтФонПроСервер.сфпПолучитьВладельцаКонтакта(СтруктураЗвонка.Контакт);
		НовыйЗвонок["АбонентПредставление"]	= сфпСофтФонПроСервер.сфпПолучитьНаименованиеКонтакта(СтруктураЗвонка.Контакт);			
		Если Найти(Строка(СтруктураЗвонка.Контакт), НСтр("ru = '<Объект не найден>'")) > 0 Тогда
			НовыйЗвонок["Комментарий"]	= Строка(ТипЗнч(СтруктураЗвонка.Контакт)) + ": "
					+ сфпСофтФонПроСервер.сфпПолучитьНаименованиеКонтакта(СтруктураЗвонка.Контакт) + НСтр("ru = ', номер: '") 
					+ сфпСофтФонПроСервер.сфпПолучитьПредставлениеНомераТелефона(СтруктураЗвонка.Контакт, СтруктураЗвонка.НомерТелефона)
					+ Символы.ПС + НСтр("ru='К данному абоненту в доступе отказано.'")
					+ НСтр("ru=' Для разрешения работы с абонентом обратитесь к руководителю или администратору.'");
		КонецЕсли;	
	ИначеЕсли СтруктураЗвонка.ВнешнийЗвонок Тогда
		Если СтруктураЗвонка.МассивЗвонящих = Неопределено Тогда
			Если ПустаяСтрока(СтруктураЗвонка.CallerInfoName) Тогда
				НовыйЗвонок["АбонентПредставление"]	= НСтр("ru='!!!Не определен!!!'");
			ИначеЕсли Найти(СтруктураЗвонка.CallerInfoName, СтруктураЗвонка.НомерТелефона) = 0 Тогда
				НовыйЗвонок["АбонентПредставление"]	= СтруктураЗвонка.CallerInfoName;
			Иначе	
				НовыйЗвонок["АбонентПредставление"]	= НСтр("ru='!!!Не определен!!!'");
			КонецЕсли;	
		ИначеЕсли СтруктураЗвонка.МассивЗвонящих.Количество() = 0 Тогда
			Если ПустаяСтрока(СтруктураЗвонка.CallerInfoName) Тогда
				НовыйЗвонок["АбонентПредставление"]	= НСтр("ru='!!!Не определен!!!'");
			ИначеЕсли Найти(СтруктураЗвонка.CallerInfoName, СтруктураЗвонка.НомерТелефона) = 0 Тогда
				НовыйЗвонок["АбонентПредставление"]	= СтруктураЗвонка.CallerInfoName;
			Иначе	
				НовыйЗвонок["АбонентПредставление"]	= НСтр("ru='!!!Не определен!!!'");
			КонецЕсли;		
		КонецЕсли;	
	Иначе	
		Если ПустаяСтрока(СтруктураЗвонка.CalledInfoName) Тогда
			НовыйЗвонок["АбонентПредставление"]	= НСтр("ru='!!!Не определен!!!'");
		Иначе
			НовыйЗвонок["АбонентПредставление"]	= СтруктураЗвонка.CalledInfoName;
		КонецЕсли;	
	КонецЕсли;	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Если ДанныеЗаполнения.Свойство("Основание") Тогда
			НовыйЗвонок["ВзаимодействиеОснование"] = ДанныеЗаполнения.Основание;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("сфпСтруктураCoMagic") Тогда
			сфпСтруктураВнешнихДанных	= ДанныеЗаполнения.сфпСтруктураCoMagic;
			НовыйЗвонок["сфпCoMagicID"]	= сфпСтруктураВнешнихДанных.comagic_context.visitor_id;
			НовыйЗвонок["Описание"]		= НовыйЗвонок["Описание"] + ?(НовыйЗвонок["Описание"], "", Символы.ПС) 
				+ НСтр("ru='Кампания: '") + сфпСтруктураВнешнихДанных.comagic_context.campaign + Символы.ПС 
				+ НСтр("ru='Сайт: '") + сфпСтруктураВнешнихДанных.comagic_context.site + Символы.ПС
				+ НСтр("ru='Ключевые слова: '") + сфпСтруктураВнешнихДанных.comagic_context.search_query; 
		КонецЕсли;	
	КонецЕсли;	
	Попытка
		НовыйЗвонок.Записать();
		ЗвонокЗаписан	= Истина;
	Исключение
		Сообщить(ОписаниеОшибки());
		ЗвонокЗаписан	= Ложь;
	КонецПопытки;
	Возврат НовыйЗвонок.Ссылка;
КонецФункции // сфпСоздатьТелефонныйЗвонок()

/////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЕЙСТВИЙ

// Процедура добавляет в массив структуру действий
//
// Параметры:
//	МассивДействий	- Массив	- Массив доступных действий
//	Наименование	- Строка	- Наименование действия
//	Действие		- Строка	- Имя процедуры-обработчика действия, процедура должна располагаться в этом модуле
//
Процедура сфпДобавитьДействие(МассивДействий, Наименование, Действие)
	СтруктураДействия = Новый Структура;
	СтруктураДействия.Вставить("Наименование",	Наименование);
	СтруктураДействия.Вставить("Действие",		Действие);
	МассивДействий.Добавить(СтруктураДействия);
КонецПроцедуры // сфпДобавитьДействие()

// Функция возвращает массив структур доступных действий при звонке
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	Массив	- Массив структур доступных действий
//
Функция сфпПолучитьМассивДоступныхДействий() Экспорт
	МассивДействий = Новый Массив;
	сфпДобавитьДействие(МассивДействий,	Нстр("ru='Нет действий'"), "");
	сфпДобавитьДействие(МассивДействий,	Нстр("ru='Открыть телефонный звонок'"), "сфпОткрытьТелефонныйЗвонок");
	сфпДобавитьДействие(МассивДействий,	Нстр("ru='Открыть карточку клиента'"), "сфпОткрытьКарточкуКонтакта");
	Если НЕ (Метаданные.Документы.Найти("Событие") = Неопределено) Тогда        
		сфпДобавитьДействие(МассивДействий,	Нстр("ru='Открыть событие'"), "сфпОткрытьСобытие");
	КонецЕсли;	
	Если НЕ (Метаданные.Документы.Найти("ЗаказПокупателя") = Неопределено) Тогда
		сфпДобавитьДействие(МассивДействий,	Нстр("ru='Открыть заказ покупателя'"), "сфпОткрытьЗаказПокупателя");
	КонецЕсли;	
	Если НЕ (Метаданные.Документы.Найти("ЗаказКлиента") = Неопределено) Тогда
		сфпДобавитьДействие(МассивДействий,	Нстр("ru='Открыть заказ клиента'"), "сфпОткрытьЗаказКлиента");
	КонецЕсли;	
	Если НЕ (Метаданные.Документы.Найти("ЗаказПоставщику") = Неопределено) Тогда
		сфпДобавитьДействие(МассивДействий,	Нстр("ru='Открыть заказ поставщику'"), "сфпОткрытьЗаказПоставщику");
	КонецЕсли;	
	Если НЕ (Метаданные.Обработки.Найти("ПомощникПродаж") = Неопределено) Тогда
		сфпДобавитьДействие(МассивДействий,	Нстр("ru='Открыть помощник продаж'"), "сфпОткрытьПомощникПродаж");
	КонецЕсли;	
	Если НЕ (Метаданные.Отчеты.Найти("ДебиторскаяЗадолженность") = Неопределено) Тогда
		сфпДобавитьДействие(МассивДействий,	Нстр("ru='Открыть дебиторскую задолженность'"),	"сфпОткрытьДебиторскаяЗадолженность");
	КонецЕсли;	
	Если НЕ (Метаданные.Отчеты.Найти("Взаиморасчеты") = Неопределено) Тогда
		сфпДобавитьДействие(МассивДействий,	Нстр("ru='Открыть ведомость взаиморасчётов'"), "сфпОткрытьВзаиморасчеты");
	КонецЕсли;	
	Если НЕ (Метаданные.Отчеты.Найти("РасчетыСПартнерами") = Неопределено) Тогда
		сфпДобавитьДействие(МассивДействий,	Нстр("ru='Открыть ведомость расчётов с партнёрами'"), "сфпОткрытьРасчетыСПартнерами");
	КонецЕсли;	
	Если НЕ (Метаданные.Отчеты.Найти("КарточкаКлиента") = Неопределено) Тогда
		сфпДобавитьДействие(МассивДействий,	Нстр("ru='Открыть досье клиента'"), "сфпОткрытьКарточкаРасчетовСКлиентами");
	КонецЕсли;	
	Возврат МассивДействий;
КонецФункции // сфпПолучитьМассивДоступныхДействий()

/////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ COMAGIC

// Функция возвращает идентификатор CoMagic
//
// Парамеры:
//	Ссылка	- ДокументСсылка	- Документ
//
// Возвращаемое значение:
//	Строка	- Идентификатор CoMagic
//
Функция сфпПолучитьCoMagicID(Ссылка) Экспорт
	CoMagicID = "";
	// В этой конфигурации CoMagic не используется
	//Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ТелефонныйЗвонок") Тогда
	//	Если ТипЗнч(Ссылка.АбонентКонтакт) = Тип("СправочникСсылка.КонтактныеЛицаКонтрагентов") Тогда
	//		Если ПустаяСтрока(Ссылка.АбонентКонтакт.сфпCoMagicID) Тогда
	//			Если ПустаяСтрока(Ссылка.АбонентКонтакт.Владелец.сфпCoMagicID) Тогда
	//				CoMagicID	= Ссылка.сфпCoMagicID;
	//			Иначе	
	//				CoMagicID	= Ссылка.АбонентКонтакт.Владелец.сфпCoMagicID;
	//			КонецЕсли;
	//	    Иначе
	//			CoMagicID	= Ссылка.АбонентКонтакт.сфпCoMagicID;
	//		КонецЕсли;
	//	ИначеЕсли ТипЗнч(Ссылка.АбонентКонтакт) = Тип("СправочникСсылка.Контрагенты") Тогда
	//		Если ПустаяСтрока(Ссылка.АбонентКонтакт.сфпCoMagicID) Тогда
	//			CoMagicID	= Ссылка.сфпCoMagicID;
	//	    Иначе
	//			CoMagicID	= Ссылка.АбонентКонтакт.сфпCoMagicID;
	//		КонецЕсли;
	//	ИначеЕсли ТипЗнч(Ссылка.АбонентКонтакт) = Тип("СправочникСсылка.КонтактныеЛица") Тогда
	//		Если ПустаяСтрока(Ссылка.АбонентКонтакт.сфпCoMagicID) Тогда
	//			Если ПустаяСтрока(Ссылка.АбонентКонтакт.Владелец.сфпCoMagicID) Тогда
	//				CoMagicID	= Ссылка.сфпCoMagicID;
	//			Иначе	
	//				CoMagicID	= Ссылка.АбонентКонтакт.Владелец.сфпCoMagicID;
	//			КонецЕсли;
	//	    Иначе
	//			CoMagicID	= Ссылка.АбонентКонтакт.сфпCoMagicID;
	//		КонецЕсли;
	//	Иначе
	//		CoMagicID	= Ссылка.сфпCoMagicID;
	//	КонецЕсли;
	//Иначе
	//	CoMagicID	= Ссылка.сфпCoMagicID;
	//КонецЕсли;	
	//Возврат CoMagicID;
КонецФункции // сфпПолучитьCoMagicID(()	
