
////@+ Процедура ОбработатьНаСервере()
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Процедура ТипПроцедуры=""
//           ИнструкцииПрепроцессору="&НаСервере"
//           ДатаCоздания="10.06.2013 11:04:44" Автор="Администратор Nissan">
// <Имя>ОбработатьНаСервере()</Имя>
//
// <Описание>
//  <!-- Вставить описание -->
// </Описание>
// </Параметры>
//  <!-- Без параметров -->
//</Процедура>
//</xml>
//@-
&НаСервере
Процедура ОбработатьНаСервере()
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ОбработкаНаСервере();
	
	ЗначениеВРеквизитФормы(Обработка, "Объект");
	
КонецПроцедуры // ОбработатьНаСервере()

&НаКлиенте
Процедура ПолучитьДанные(Команда)
	ОбработатьНаСервере();
КонецПроцедуры
