//Получаем данные из регистра по Модели Версии в ДанныеПТС
//КонецОписания
Функция ПолучитьДанныеПТС(Модель,Версия,ДанныеПТС)  экспорт
	
	Ответ = Ложь;
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Модель.Установить(Модель);
	Набор.Отбор.Версия.Установить(Версия);	
	Набор.Прочитать();
	Если Набор.Количество() > 0 Тогда
		Попытка
			ДанныеПТС = СформироватьСтруктуруДанныхПТС(Набор[0]);
			Ответ = истина;

		исключение
			Ответ = Ложь;
		КонецПопытки;
	КонецЕсли;
	Возврат Ответ;	
	
КонецФункции

//Формируем структуру данных птс из объекта 
//КонецОписания
Функция СформироватьСтруктуруДанныхПТС(Объект) Экспорт
	
	Ответ = Новый Структура();
	Набор = СоздатьНаборЗаписей();
	Для Каждого Ресурс ИЗ Набор.Метаданные().Ресурсы Цикл
		Ответ.Вставить(Ресурс.Имя,Объект[Ресурс.Имя]);
	КонецЦикла;
	Для Каждого Реквизит ИЗ Набор.Метаданные().Реквизиты Цикл
		Ответ.Вставить(Реквизит.Имя,Объект[Реквизит.Имя]);
	КонецЦикла;
    Возврат Ответ;
	
КонецФункции
//Сохраняем(перезаписываем если есть данныеПТС в регистре по Модели и Версии 
//КонецОписания
Функция СохранитьДанныеПТС(Модель,Версия,ДанныеПТС)  экспорт
	Ответ = Ложь;
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Модель.Установить(Модель);
	Набор.Отбор.Версия.Установить(Версия);	
	Набор.Прочитать();
	
	Если Набор.Количество() = 0 Тогда
		 НовыйПТС = Набор.Добавить();
	 Иначе
		 НовыйПТС = Набор[0];
	КонецЕсли;
		
    Попытка
		    НовыйПтс.Модель = Модель;
			НовыйПтс.Версия = Версия;
			ЗаполнитьЗначенияСвойств(НовыйПТС,ДанныеПТС);
			Набор.Записать(Истина);
			Ответ = Истина;
  	Исключение
			Ответ = Ложь;
	КонецПопытки;
    Возврат Ответ;
	
КонецФункции
