

&НаКлиенте
Процедура ЦветПоRGB()
	
	color = Элементы.Палитра.Документ.parentWindow.eval("Starter.setRGB(" + Строка(R) + "," + Строка(G) + "," + Строка(B) + ");");
	
	H = color.h;
	S = color.s;
	V = color.v;
	
	HEX = color.hex;
	
	РедактируемыйЦвет = Новый Цвет(R, G, B);
	Элементы.ОтображениеЦветов.Документ.parentWindow.eval("setNewColor(" + Строка(R) + "," + Строка(G) + "," + Строка(B) + ")");
	
КонецПроцедуры


&НаКлиенте
Процедура ЦветПоHSV()
	
	color = Элементы.Палитра.Документ.parentWindow.eval("Starter.setHSV(" + Строка(H) + "," + Строка(S) + "," + Строка(V) + ");");
	
	R = color.r;
	G = color.g;
	B = color.b;
	
	HEX = color.hex;
	
	РедактируемыйЦвет = Новый Цвет(R, G, B);
	Элементы.ОтображениеЦветов.Документ.parentWindow.eval("setNewColor(" + Строка(R) + "," + Строка(G) + "," + Строка(B) + ")");
	
КонецПроцедуры


&НаКлиенте
Процедура ЦветПоHEX()
	
	color = Элементы.Палитра.Документ.parentWindow.eval("Starter.setHEX('" + HEX + "');");
	
	R = color.r;
	G = color.g;
	B = color.b;
	
	H = color.h;
	S = color.s;
	V = color.v;
	
	РедактируемыйЦвет = Новый Цвет(R, G, B);
	Элементы.ОтображениеЦветов.Документ.parentWindow.eval("setNewColor(" + Строка(R) + "," + Строка(G) + "," + Строка(B) + ")");
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("РедактируемыйЦвет") Тогда 
		РедактируемыйЦвет = Параметры.РедактируемыйЦвет;
	Иначе
		РедактируемыйЦвет = Новый Цвет(255, 255, 255);
	КонецЕсли;
	
	МассивАдресов = Новый Массив;
	МассивАдресов.Добавить("ПалитраЦветов");
	МассивАдресов.Добавить("Градиент");
	МассивАдресов.Добавить("КурсорПалитры");
	МассивАдресов.Добавить("КурсорКрестом");
	МассивАдресов.Добавить("ПустаяКартинка10x10");
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	
	HTML = ЭтотОбъект.ПолучитьМакет("HTML").ПолучитьТекст();
	Ресурсы = ЗначениеИзСтрокиВнутр(ЭтотОбъект.ПолучитьМакет("Ресурсы").ПолучитьТекст());
	ТаблицаWebЦветов = ЗначениеИзСтрокиВнутр(ЭтотОбъект.ПолучитьМакет("ТаблицаWebЦветов").ПолучитьТекст());
	ОтображениеЦветов = ЭтотОбъект.ПолучитьМакет("ОтображениеЦветов").ПолучитьТекст();

	Для Каждого Стр Из МассивАдресов Цикл
		Адрес = ПоместитьВоВременноеХранилище(Новый Картинка(Ресурсы[Стр]));
		HTML = СтрЗаменить(HTML, "%"+Стр+"%", Адрес);
	КонецЦикла;
	
	Палитра = HTML;
	
	Соотв = ТаблицаWebЦветов.Найти(РедактируемыйЦвет, "WebЦвет");
	Если Соотв <> Неопределено Тогда
		РедактируемыйЦвет = Соотв.Цвет;
	КонецЕсли;
	
	R = РедактируемыйЦвет.Красный;
	G = РедактируемыйЦвет.Зеленый;
	B = РедактируемыйЦвет.Синий;
	
КонецПроцедуры


&НаКлиенте
Процедура ПалитраДокументСформирован(Элемент)
	
	color = Элементы.Палитра.Документ.parentWindow.eval("Starter.initialize(" + Строка(R) + "," + Строка(G) + "," + Строка(B) + ");");
	
	H = color.h;
	S = color.s;
	V = color.v;
	
	HEX = color.hex;
	
КонецПроцедуры


&НаКлиенте
Процедура ОтображениеЦветовДокументСформирован(Элемент)
	
	Элементы.ОтображениеЦветов.Документ.parentWindow.eval("setOldColor(" + Строка(R) + "," + Строка(G) + "," + Строка(B) + ")");
	Элементы.ОтображениеЦветов.Документ.parentWindow.eval("setNewColor(" + Строка(R) + "," + Строка(G) + "," + Строка(B) + ")");
	
КонецПроцедуры


&НаКлиенте
Процедура ПалитраПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	color = Элементы.Палитра.Документ.parentWindow.eval("Starter.getColor();");
	
	R = color.r;
	G = color.g;
	B = color.b;
	
	H = color.h;
	S = color.s;
	V = color.v;
	
	HEX = color.hex;
	
	РедактируемыйЦвет = Новый Цвет(R, G, B);
	Элементы.ОтображениеЦветов.Документ.parentWindow.eval("setNewColor(" + Строка(R) + "," + Строка(G) + "," + Строка(B) + ")");

КонецПроцедуры


&НаКлиенте
Процедура ТолькоWebЦветаПриИзменении(Элемент)
	
	Элементы.Палитра.Документ.parentWindow.eval("Starter.onlyWebColors("+?(ТолькоWebЦвета, "true", "false")+");");
	
КонецПроцедуры


&НаКлиенте
Процедура RПриИзменении(Элемент)

	Если R>255 Тогда 
		R = 255;
	КонецЕсли;
	
	ЦветПоRGB();
	
КонецПроцедуры


&НаКлиенте
Процедура GПриИзменении(Элемент)

	Если G>255 Тогда 
		G = 255;
	КонецЕсли;

	ЦветПоRGB();
	
КонецПроцедуры


&НаКлиенте
Процедура BПриИзменении(Элемент)

	Если B>255 Тогда 
		B = 255;
	КонецЕсли;

	ЦветПоRGB();
	
КонецПроцедуры


&НаКлиенте
Процедура HПриИзменении(Элемент)

	Если H>360 Тогда 
		H = 360;
	КонецЕсли;

	ЦветПоHSV();
	
КонецПроцедуры


&НаКлиенте
Процедура SПриИзменении(Элемент)

	Если S>100 Тогда 
		S = 100;
	КонецЕсли;

	ЦветПоHSV();
	
КонецПроцедуры


&НаКлиенте
Процедура VПриИзменении(Элемент)

	Если V>100 Тогда 
		V = 100;
	КонецЕсли;

	ЦветПоHSV();
	
КонецПроцедуры


&НаКлиенте
Процедура HEXПриИзменении(Элемент)

	HEX = НРег(HEX);
	ЦветПоHEX();
	
КонецПроцедуры


&НаСервере
Функция ЦветВWebЦветСервер()
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	ТаблицаWebЦветов = ЗначениеИзСтрокиВнутр(ЭтотОбъект.ПолучитьМакет("ТаблицаWebЦветов").ПолучитьТекст());
	
	Соотв = ТаблицаWebЦветов.Найти(РедактируемыйЦвет, "Цвет");
	
	Если Соотв <> Неопределено Тогда
		Результат = Соотв.WebЦвет;
	Иначе
		Результат = РедактируемыйЦвет;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
	

&НаКлиенте
Процедура Выбрать(Команда)

	ОповеститьОВыборе(ЦветВWebЦветСервер());
	
КонецПроцедуры
