
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.Модель) И ЗначениеЗаполнено(Запись.Идентификатор) Тогда
		ОбновитьАдресКартинки()
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Если Диалог.Выбрать() Тогда
		Попытка
			Картинка = Новый Картинка(Диалог.ПолноеИмяФайла);
			ЗаписатьКартинку(Картинка);
			Элементы.АдресКартинки.Обновить();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	Если Вопрос("Удалить фотографию?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		УдалитьКартинку();
		Элементы.АдресКартинки.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКартинку(Картинка)
	
	МенеджерКартинки = РегистрыСведений.КартинкиИФайлы.СоздатьМенеджерЗаписи();
	МенеджерКартинки.Объект = Запись.Модель;
	МенеджерКартинки.Идентификатор = Запись.Идентификатор;
	МенеджерКартинки.Данные = Новый ХранилищеЗначения(Картинка);
	МенеджерКартинки.Записать(Истина);
	ОбновитьАдресКартинки()
	
КонецПроцедуры

&НаСервере
Процедура УдалитьКартинку()
	
	МенеджерКартинки = РегистрыСведений.КартинкиИФайлы.СоздатьМенеджерЗаписи();
	МенеджерКартинки.Объект = Запись.Модель;
	МенеджерКартинки.Идентификатор = Запись.Идентификатор;
	МенеджерКартинки.Удалить();
	ОбновитьАдресКартинки()
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьАдресКартинки()
	
	АдресКартинки = "";
	КлючЗаписиРег = РегистрыСведений.КартинкиИФайлы.СоздатьКлючЗаписи(Новый Структура("Объект,Идентификатор", Запись.Модель, Запись.Идентификатор)); 
	Если НЕ КлючЗаписиРег.Пустой() Тогда
		АдресКартинки = ПолучитьНавигационнуюСсылку(КлючЗаписиРег, "Данные")
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Изменена картинка авто");
	
КонецПроцедуры

