////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	// 0 без огранчений, 1 - за квартал, 2 - за месяц, 3 - за неделю, 4 за день, 5 за час
	Элементы.ДавностьПросмотраВЖурналеПоУмолчанию.СписокВыбора.Добавить("Без ограничений");
	Элементы.ДавностьПросмотраВЖурналеПоУмолчанию.СписокВыбора.Добавить("За последний квартал");
	Элементы.ДавностьПросмотраВЖурналеПоУмолчанию.СписокВыбора.Добавить("За последний месяц");
	Элементы.ДавностьПросмотраВЖурналеПоУмолчанию.СписокВыбора.Добавить("За последнюю неделю");
	Элементы.ДавностьПросмотраВЖурналеПоУмолчанию.СписокВыбора.Добавить("За последний день");
	Элементы.ДавностьПросмотраВЖурналеПоУмолчанию.СписокВыбора.Добавить("За последний час");
	
	ЭтаФорма.Заголовок = "Настройка журнала регистрации. Версия " + Renault_внОбщийМодульПовтИсп.глВНЗначениеПеременной("Версия");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ПанельОбщая.ОтображениеСтраниц			= ОтображениеСтраницФормы.Нет;
	Элементы.ПанельОбщая.ТекущаяСтраница			= Элементы.НастройкиИстории;
	СнятьВыделениеКнопки();
	ПрочитатьНастройки();
	Элементы.ОткрытьНастройкиИстории.Шрифт			= Новый Шрифт(,,Истина);
		
	Элементы.ГруппаСерверКаталог.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "внПрогрессСжатия" Тогда
		ИндикаторСжатия = Параметр;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ


&НаКлиенте
Процедура НачЗаполнениеИспользованиеПриИзменении(Элемент)
	
	ТекущиеДанные = ТекущийЭлемент.ТекущиеДанные;
	Если ТекущиеДанные.Использование = 2 Тогда
		ТекущиеДанные.Использование = 0;
	КонецЕсли;
	ПометитьВложенныеЭлементы(ТекущиеДанные);
	ПометитьЭлементыРодителей(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПараметрУникальностиИБПриИзменении(Элемент)
		
	ДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ПометитьЭлементыРодителейНаСервере(Элемент)

	Родитель = Элемент.ПолучитьРодителя();
	
	Если Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Родитель.ПолучитьРодителя() = Неопределено Тогда
	
		ЭлементыРодителя = Родитель.ПолучитьЭлементы();
		Если ЭлементыРодителя.Количество() = 0 Тогда
			Родитель.Использование = 0;
		ИначеЕсли Элемент.Использование = 2 Тогда
			Родитель.Использование = 2;
		Иначе
			Родитель.Использование = ЗначениеПометкиЭлементовНаСервере(ЭлементыРодителя);
		КонецЕсли;

	КонецЕсли;
	
	ПометитьЭлементыРодителейНаСервере(Родитель);

КонецПроцедуры

&НаКлиенте
Процедура ВестиИсториюИзмененийПриИзменении(Элемент)
	
	ДоступностьЭлементов();
	
КонецПроцедуры

// Процедура рекурсивно устанавливает/снимает пометку для вложенных элементов начиная
// с передаваемого элемента.
//
// Параметры:
// Элемент      - ДанныеФормыКоллекцияЭлементовДерева 
//
&НаКлиенте
Процедура ПометитьВложенныеЭлементы(Элемент)

	ВложенныеЭлементы = Элемент.ПолучитьЭлементы();
	
	Если ВложенныеЭлементы.Количество() = 0 Тогда
		Если НЕ Элемент.ПолучитьРодителя() <> Неопределено Тогда
			Элемент.Использование = 0;
		КонецЕсли;		
	Иначе
		Для Каждого ВложенныйЭлемент ИЗ ВложенныеЭлементы Цикл
			ВложенныйЭлемент.Использование = Элемент.Использование;
			ПометитьВложенныеЭлементы(ВложенныйЭлемент);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПометитьВложенныеЭлементыСервер(Элемент)

	ВложенныеЭлементы = Элемент.Строки;
	
	Если ВложенныеЭлементы.Количество() = 0 Тогда
		Если НЕ Элемент.Родитель <> Неопределено Тогда
			Элемент.Использование = 0;
		КонецЕсли;		
	Иначе
		Для Каждого ВложенныйЭлемент ИЗ ВложенныеЭлементы Цикл
			ВложенныйЭлемент.Использование = Элемент.Использование;
			ПометитьВложенныеЭлементыСервер(ВложенныйЭлемент);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Процедура рекурсивно устанавливает/снимает пометку для родителей передаваемого элемента.
//
// Параметры:
// Элемент      - ДанныеФормыКоллекцияЭлементовДерева 
//
&НаКлиенте
Процедура ПометитьЭлементыРодителей(СтрокаРодитель)

	Если СтрокаРодитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Использование = СтрокаРодитель.Использование;
	
	Если СтрокаРодитель.ПолучитьЭлементы().Количество() > 0 Тогда
		НайденыВключенные  = Ложь;
		НайденыВыключенные = Ложь;
		Для Каждого Строка Из СтрокаРодитель.ПолучитьЭлементы() Цикл
			Если Строка.Использование = 0 Тогда
				НайденыВыключенные = Истина;
			ИначеЕсли Строка.Использование = 1 Тогда
				НайденыВключенные  = Истина;
			ИначеЕсли Строка.Использование = 2 Тогда
				НайденыВыключенные = Истина;
				НайденыВключенные  = Истина;
			КонецЕсли;
			
			Если НайденыВключенные И НайденыВыключенные Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НайденыВключенные И НЕ НайденыВыключенные Тогда
			Использование = 1;
		ИначеЕсли НЕ НайденыВключенные И НайденыВыключенные Тогда
			Использование = 0;
		Иначе
			Использование = 2;
		КонецЕсли;
	КонецЕсли; 

	СтрокаРодитель.Использование = Использование;
	ПометитьЭлементыРодителей(СтрокаРодитель.ПолучитьРодителя());

КонецПроцедуры

&НаСервере
Процедура ПометитьЭлементыРодителейСервер(СтрокаРодитель)

	Если СтрокаРодитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Использование = СтрокаРодитель.Использование;
	
	Если СтрокаРодитель.Строки.Количество() > 0 Тогда
		НайденыВключенные  = Ложь;
		НайденыВыключенные = Ложь;
		Для Каждого Строка Из СтрокаРодитель.Строки Цикл
			Если Строка.Использование = 0 Тогда
				НайденыВыключенные = Истина;
			ИначеЕсли Строка.Использование = 1 Тогда
				НайденыВключенные  = Истина;
			ИначеЕсли Строка.Использование = 2 Тогда
				НайденыВыключенные = Истина;
				НайденыВключенные  = Истина;
			КонецЕсли;
			
			Если НайденыВключенные И НайденыВыключенные Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НайденыВключенные И НЕ НайденыВыключенные Тогда
			Использование = 1;
		ИначеЕсли НЕ НайденыВключенные И НайденыВыключенные Тогда
			Использование = 0;
		Иначе
			Использование = 2;
		КонецЕсли;
	КонецЕсли; 

	СтрокаРодитель.Использование = Использование;
	ПометитьЭлементыРодителейСервер(СтрокаРодитель.Родитель);

КонецПроцедуры

&НаКлиенте
Процедура НадписьИсторияИзмененийНажатие(Элемент)
	
	ТД = ПолучитьИсториюИзменений();
	ТД.Показать("История изменения журнала регистрации");
	
КонецПроцедуры

&НаКлиенте
Процедура ОчищатьЖурналРегистрацииАвтоматическиПриИзменении(Элемент)
	
	ДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодАвтоматическойОчисткиЖурналаРегистрацииПриИзменении(Элемент)
	
	Если ПериодАвтоматическойОчисткиЖурналаРегистрации	= 0 Тогда
		ДатаОчистки	= Дата(1, 1, 1);
	Иначе
		ДатаОчистки = НачалоДня(ТекущаяДата()) - 86400 * ПериодАвтоматическойОчисткиЖурналаРегистрации;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОчисткиПриИзменении(Элемент)
	
	Если ДатаОчистки = Дата(1, 1, 1) Тогда
		ПериодАвтоматическойОчисткиЖурналаРегистрации = 0;
	Иначе 
		ПериодАвтоматическойОчисткиЖурналаРегистрации = Окр((НачалоДня(ТекущаяДата()) - ДатаОчистки) / 86400);
		Если ПериодАвтоматическойОчисткиЖурналаРегистрации < 0 Тогда
			ПериодАвтоматическойОчисткиЖурналаРегистрации = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Применить(Команда)
	
	ЗаписатьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура OK(Команда)
	
	ЗаписатьНастройки();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоединение(Команда)
	ЗаписатьНастройки();
	Удачно = ТестСоединения();
	
	Если Удачно Тогда
		Предупреждение("Все параметры подключения установлены правильно!");
		Renault_внОбщийМодуль.ПриНачалеРаботыСистемы();
	Иначе
		Предупреждение("Подключение не может быть установлено...");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НажатиеКнопкаПараметрУникальностиТекущейИБ(Команда)
	
	ПУ									= Renault_внОбщийМодуль.ПараметрУникальностиИБ();
	ПараметрУникальностиСписокСерверов	= ПУ.Сервер;
	ПараметрУникальностиИмяБазы			= ПУ.ИмяБазы;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлагПользователь(Команда)
	
	УстановитьФлагиВКолонкеПользователей("ФлагПользователь", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлагПользователь(Команда)
	
	УстановитьФлагиВКолонкеПользователей("ФлагПользователь", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлагПросмотр(Команда)
	
	УстановитьФлагиВКолонкеПользователей("ФлагПросмотр", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлагАдминистратор(Команда)
	
	УстановитьФлагиВКолонкеПользователей("ФлагАдминистратор", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлагАдминистратор(Команда)
	
	УстановитьФлагиВКолонкеПользователей("ФлагАдминистратор", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиИстории(Команда)
	
	Элементы.ПанельОбщая.ТекущаяСтраница = Элементы.НастройкиИстории;
	СнятьВыделениеКнопки();
	Элементы.ОткрытьНастройкиИстории.Шрифт	= Новый Шрифт(,,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРегистрируемыеОбъекты(Команда)
	
	Если РегистрируемыеОбъекты.ПолучитьЭлементы().Количество() = 0 Тогда
		ЗаполнитьРегистрируемыеОбъекты();
	КонецЕсли;	
	Элементы.ПанельОбщая.ТекущаяСтраница = Элементы.РегистрируемыеОбъекты;
	СнятьВыделениеКнопки();
	Элементы.ОткрытьРегистрируемыеОбъекты.Шрифт	= Новый Шрифт(,,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРолиИстории(Команда)
	
	Если Пользователи.Количество() = 0 Тогда
		// Выводим всех пользователей сисемы
		ОбновитьСписокПользователейИРолей();
	КонецЕсли;

	Элементы.ПанельОбщая.ТекущаяСтраница = Элементы.РолиИстории;
	СнятьВыделениеКнопки();
	Элементы.ОткрытьРолиИстории.Шрифт	= Новый Шрифт(,,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОчисткаИСжатие(Команда)
	
	Элементы.ПанельОбщая.ТекущаяСтраница = Элементы.ОчисткаИСжатие;
	СнятьВыделениеКнопки();
	Элементы.ОткрытьОчисткаИСжатие.Шрифт	= Новый Шрифт(,,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДополнительно(Команда)
	
	Элементы.ПанельОбщая.ТекущаяСтраница = Элементы.Дополнительно;
	СнятьВыделениеКнопки();
	Элементы.ОткрытьДополнительно.Шрифт	= Новый Шрифт(,,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНачальноеЗаполнение(Команда)
	МассивОбъектов = ВыполнитьНачальноеЗаполнениеНаСервере();
	
	// Проверка согласованности параметров процесса
	Если МассивОбъектов.Количество() = 0 Тогда
		Предупреждение("Выберите объекты для начального заполнения!", , "Начальное заполнение");
		Возврат;
	КонецЕсли;
	
	Renault_внОбщийМодуль.СозданиеПервоначальногоОбраза(НеРегистрироватьОбъектыСтарше, ПериодРегистрацииОбъектовНачальногоЗаполнения, МассивОбъектов);
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Текст = "ru = 'Образы объектов созданы. Произвести сжатие кэша?
             |Внимание! Операция может быть длительной, сжатие кэша так же производится регламентным заданием, так что этот шаг можно пропустить, он все равно будет выполнен либо сейчас вручную, либо позже регламентным заданием.'";
	Ответ = Вопрос(НСтр(Текст), Режим, 0);
	Если Ответ = КодВозвратаДиалога.Да Тогда
	    СжатьИсториюНажатие(Команда, Ложь);
	КонецЕсли;
	Оповестить("внОбновитьИсторию");
	Предупреждение("Первоначальный образ создан!");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьБДНажатие(Команда)
	Форма = ПолучитьФорму("Обработка.Renault_внНастройкаЖурналаРегистрации.Форма.ФормаСозданияБДУправляемая");
	Если Форма.ОткрытьМодально() = Истина Тогда	
		// Перечитываем настройки
		ПриОткрытии(Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДействиеУстановитьФлагиНачЗаполнения(Команда)
	
	УстановитьФлагиНачальноеЗаполнениеОбъекты(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДействиеСнятьФлагиНачЗаполнения(Команда)
	
	УстановитьФлагиНачальноеЗаполнениеОбъекты(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ДействиеУстановитьФлагиРегистрируемыхОбъектов(Команда)
	
	УстановитьФлагиРегистрируемыхОбъектов(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДействиеСнятьФлагиРегистрируемыхОбъектов(Команда)
	
	УстановитьФлагиРегистрируемыхОбъектов(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлагПросмотр(Команда)
	
	УстановитьФлагиВКолонкеПользователей("ФлагПросмотр", Ложь);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ЗаписатьРегистрируемыеОбъекты(НаборЗаписей, СтрокаОбъекта)
	
	// Запишем только регистрируемые объекты, все остальные удалим
	
	Для Каждого Стр Из СтрокаОбъекта.Строки Цикл
		
		Если НЕ ПустаяСтрока(Стр.ПолноеИмя) И Стр.Использование = 0 Тогда
			
			НоваяЗапись						= НаборЗаписей.Добавить();
			НоваяЗапись.МетаданныеОбъекта	= Стр.ПолноеИмя;
			НоваяЗапись.ИмяТЧ				= Стр.ИмяТЧ;
			НоваяЗапись.ИмяРеквизита		= Стр.Имя;
			НоваяЗапись.НеРегистрировать	= Истина;
			
		КонецЕсли;
		
		// Если есть флажок, дальше рекурсия
		Если Стр.СодержитЭлементы И Стр.Использование <> 1 И НЕ (Стр.ЭтоОбъект И Стр.Использование = 0) Тогда
			ЗаписатьРегистрируемыеОбъекты(НаборЗаписей, Стр);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройки()
	
	ВестиИсториюИзменений	= Renault_внОбщийМодуль.ПолучитьНастройкуЖурналаРегистрации("ВестиИсториюИзменений");
	РегистрироватьВходыИВыходыПользователей = Renault_внОбщийМодуль.ПолучитьНастройкуЖурналаРегистрации("РегистрироватьВходыИВыходыПользователей");	
	
	СерверВнешнейИБ 								= Renault_внОбщийМодуль.ПолучитьНастройкуЖурналаРегистрации("СерверВнешнейИБ");
	ИмяВнешнейИБ	 								= Renault_внОбщийМодуль.ПолучитьНастройкуЖурналаРегистрации("ИмяВнешнейИБ");
	ПользовательВнешнейИБ							= Renault_внОбщийМодуль.ПолучитьНастройкуЖурналаРегистрации("ПользовательВнешнейИБ");
	ПарольВнешнейИБ 								= Renault_внОбщийМодуль.ПолучитьНастройкуЖурналаРегистрации("ПарольВнешнейИБ");			
	ИспользоватьПараметрУникальностиИБ				= Renault_внОбщийМодуль.ПолучитьНастройкуЖурналаРегистрации("ИспользоватьПараметрУникальностиИБ");
	ОчищатьЖурналРегистрацииАвтоматически			= Renault_внОбщийМодуль.ПолучитьНастройкуЖурналаРегистрации("ОчищатьЖурналРегистрацииАвтоматически");
	ПериодАвтоматическойОчисткиЖурналаРегистрации	= Renault_внОбщийМодуль.ПолучитьНастройкуЖурналаРегистрации("ПериодАвтоматическойОчисткиЖурналаРегистрации");
	ТаймаутСоединенияИБ								= Renault_внОбщийМодуль.ПолучитьНастройкуЖурналаРегистрации("ТаймаутСоединенияИБ");
	ИдентификаторИБ									= Renault_внОбщийМодуль.ПолучитьНастройкуЖурналаРегистрации("ИдентификаторИБ");
	ТекущийУзелРИБ									= Renault_внОбщийМодуль.ПолучитьНастройкуЖурналаРегистрации("ТекущийУзелРИБ");
	ИнтервалПроверкиПодпискиНаСобытия				= Renault_внОбщийМодуль.ПолучитьНастройкуЖурналаРегистрации("ИнтервалПроверкиПодпискиНаСобытия");
	ТипОбменаРИБ									= Renault_внОбщийМодуль.ПолучитьНастройкуЖурналаРегистрации("ТипОбменаРИБ");
	ТипБД											= Renault_внОбщийМодуль.ПолучитьНастройкуЖурналаРегистрации("ТипБД");
	ПараметрУникальностиСписокСерверов				= Renault_внОбщийМодуль.ПолучитьНастройкуЖурналаРегистрации("ПараметрУникальностиСписокСерверов");
	ПараметрУникальностиИмяБазы						= Renault_внОбщийМодуль.ПолучитьНастройкуЖурналаРегистрации("ПараметрУникальностиИмяБазы");
	ФиксироватьПерепроведенияДокументов				= Renault_внОбщийМодуль.ПолучитьНастройкуЖурналаРегистрации("ФиксироватьПерепроведенияДокументов");
	
	Если ПериодАвтоматическойОчисткиЖурналаРегистрации = 0 Тогда
		ДатаОчистки									= Дата(1, 1, 1);
	Иначе
		ДатаОчистки									= НачалоДня(ТекущаяДата()) - 86400 * ПериодАвтоматическойОчисткиЖурналаРегистрации;
	КонецЕсли;
	
	/////////////////////////////////////
	
	Если ПустаяСтрока(ПараметрУникальностиИмяБазы) Тогда
		ПУ									= Renault_внОбщийМодуль.ПараметрУникальностиИБ();
		ПараметрУникальностиСписокСерверов	= ПУ.Сервер;
		ПараметрУникальностиИмяБазы			= ПУ.ИмяБазы;
	КонецЕсли;
	
	// В обычном ВестиИсториюИзмененийПриИзменении(Неопределено);
	ДоступностьЭлементов();
	
	ДавностьПросмотраВЖурналеПоУмолчанию = Элементы.ДавностьПросмотраВЖурналеПоУмолчанию.СписокВыбора.Получить(Renault_внОбщийМодуль.ПолучитьНастройкуЖурналаРегистрации("ДавностьПросмотраВЖурналеПоУмолчанию"));
	НеРегистрироватьОбъектыСтарше					= Истина;
	ПериодРегистрацииОбъектовНачальногоЗаполнения	= 60;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройки()
	
	Renault_внОбщийМодуль.УстановитьНастройкуЖурналаРегистрации("ВестиИсториюИзменений",						ВестиИсториюИзменений);
	Renault_внОбщийМодуль.УстановитьНастройкуЖурналаРегистрации("РегистрироватьВходыИВыходыПользователей", 		РегистрироватьВходыИВыходыПользователей);
	Renault_внОбщийМодуль.УстановитьНастройкуЖурналаРегистрации("СерверВнешнейИБ", 								СерверВнешнейИБ);
	Renault_внОбщийМодуль.УстановитьНастройкуЖурналаРегистрации("ИмяВнешнейИБ", 								ИмяВнешнейИБ);
	Renault_внОбщийМодуль.УстановитьНастройкуЖурналаРегистрации("ПользовательВнешнейИБ", 						ПользовательВнешнейИБ);
	Renault_внОбщийМодуль.УстановитьНастройкуЖурналаРегистрации("ПарольВнешнейИБ", 								ПарольВнешнейИБ);	
	Renault_внОбщийМодуль.УстановитьНастройкуЖурналаРегистрации("ИспользоватьПараметрУникальностиИБ",			ИспользоватьПараметрУникальностиИБ);
	Renault_внОбщийМодуль.УстановитьНастройкуЖурналаРегистрации("ОчищатьЖурналРегистрацииАвтоматически",		ОчищатьЖурналРегистрацииАвтоматически);
	Renault_внОбщийМодуль.УстановитьНастройкуЖурналаРегистрации("ПериодАвтоматическойОчисткиЖурналаРегистрации",ПериодАвтоматическойОчисткиЖурналаРегистрации);
	Renault_внОбщийМодуль.УстановитьНастройкуЖурналаРегистрации("ТаймаутСоединенияИБ",							ТаймаутСоединенияИБ);
	Renault_внОбщийМодуль.УстановитьНастройкуЖурналаРегистрации("ИдентификаторИБ",								ИдентификаторИБ);
	Renault_внОбщийМодуль.УстановитьНастройкуЖурналаРегистрации("ТекущийУзелРИБ",								ТекущийУзелРИБ);
	Renault_внОбщийМодуль.УстановитьНастройкуЖурналаРегистрации("ИнтервалПроверкиПодпискиНаСобытия",			ИнтервалПроверкиПодпискиНаСобытия);
	Renault_внОбщийМодуль.УстановитьНастройкуЖурналаРегистрации("ТипОбменаРИБ",									ТипОбменаРИБ);
	Renault_внОбщийМодуль.УстановитьНастройкуЖурналаРегистрации("ТипБД",										ТипБД);
	Renault_внОбщийМодуль.УстановитьНастройкуЖурналаРегистрации("ПараметрУникальностиСписокСерверов",			ПараметрУникальностиСписокСерверов);
	Renault_внОбщийМодуль.УстановитьНастройкуЖурналаРегистрации("ПараметрУникальностиИмяБазы",					ПараметрУникальностиИмяБазы);
	Renault_внОбщийМодуль.УстановитьНастройкуЖурналаРегистрации("ФиксироватьПерепроведенияДокументов",			ФиксироватьПерепроведенияДокументов);
	
	///////////////////////////////
	// Записываем НеРегистрируемыеОбъекты	
	// Не регистрируемые объекты
	Если РегистрируемыеОбъекты.ПолучитьЭлементы().Количество() <> 0 Тогда
		Дерево = ДанныеФормыВЗначение(РегистрируемыеОбъекты, Тип("ДеревоЗначений"));		
		НаборЗаписей = РегистрыСведений.Renault_внНеРегистрируемыеОбъекты.СоздатьНаборЗаписей();
		ЗаписатьРегистрируемыеОбъекты(НаборЗаписей, Дерево);
		НаборЗаписей.Записать(Истина);
	КонецЕсли;	
		
	// Сохраняем права
	Для Каждого Строки Из Пользователи Цикл
		УИД = Новый УникальныйИдентификатор(Строки.УникальныйИдентификатор);
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(УИД);
		
		мРоль = Метаданные.Роли.Renault_внПросмотрЖурналаРегистрации;
		СодержитРоль = ПользовательИБ.Роли.Содержит(мРоль);		
		Если СодержитРоль И Не Строки.ФлагПросмотр Тогда
			ПользовательИБ.Роли.Удалить(мРоль);
		ИначеЕсли Не СодержитРоль И Строки.ФлагПросмотр Тогда
			ПользовательИБ.Роли.Добавить(мРоль);
		КонецЕсли; 
		
		мРоль = Метаданные.Роли.Renault_внПользовательИсторииИзменений;
		СодержитРоль = ПользовательИБ.Роли.Содержит(мРоль);		
		Если СодержитРоль И Не Строки.ФлагПользователь Тогда
			ПользовательИБ.Роли.Удалить(мРоль);
		ИначеЕсли Не СодержитРоль И Строки.ФлагПользователь Тогда
			ПользовательИБ.Роли.Добавить(мРоль);
		КонецЕсли;
		
		мРоль = Метаданные.Роли.Renault_внАдминистраторЖурналаРегистрации;
		СодержитРоль = ПользовательИБ.Роли.Содержит(мРоль);		
		Если СодержитРоль И Не Строки.ФлагАдминистратор Тогда
			ПользовательИБ.Роли.Удалить(мРоль);
		ИначеЕсли Не СодержитРоль И Строки.ФлагАдминистратор Тогда
			ПользовательИБ.Роли.Добавить(мРоль);
		КонецЕсли;		
		
		ПользовательИБ.Записать();
	КонецЦикла;
	
	Зн = 0;
	Если ДавностьПросмотраВЖурналеПоУмолчанию = "За последний квартал" Тогда
		Зн = 1;
	ИначеЕсли ДавностьПросмотраВЖурналеПоУмолчанию = "За последний месяц" Тогда
		Зн = 2;
	ИначеЕсли ДавностьПросмотраВЖурналеПоУмолчанию = "За последнюю неделю" Тогда
		Зн = 3;
	ИначеЕсли ДавностьПросмотраВЖурналеПоУмолчанию = "За последний день" Тогда
		Зн = 4;
	ИначеЕсли ДавностьПросмотраВЖурналеПоУмолчанию = "За последний час" Тогда
		Зн = 5;
	КонецЕсли;
	Renault_внОбщийМодуль.УстановитьНастройкуЖурналаРегистрации("ДавностьПросмотраВЖурналеПоУмолчанию", Зн);
	
	///////////////////////////////
	ОбновитьПовторноИспользуемыеЗначения();
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьНеРегистрируемое(СтрокаОбъекта, НеРегистрируемыеОбъекты, НеРегистрируемыеРеквизиты)
	Для Каждого Стр Из СтрокаОбъекта.Строки Цикл
		Если Стр.Уровень() = 1 Тогда
			Если НЕ Стр.Использование Тогда
				Если НЕ ПустаяСтрока(НеРегистрируемыеОбъекты) Тогда
					НеРегистрируемыеОбъекты = НеРегистрируемыеОбъекты + Символы.ПС;
				КонецЕсли;
				НеРегистрируемыеОбъекты = НеРегистрируемыеОбъекты + Стр.Имя;
			КонецЕсли;
		ИначеЕсли Стр.Уровень() > 1 Тогда
			Если НЕ Стр.Использование Тогда
				Если Стр.Строки.Количество() = 0 Тогда
					Если НЕ ПустаяСтрока(НеРегистрируемыеРеквизиты) Тогда
						НеРегистрируемыеРеквизиты = НеРегистрируемыеРеквизиты + Символы.ПС;
					КонецЕсли;
					НеРегистрируемыеРеквизиты = НеРегистрируемыеРеквизиты + Стр.Имя;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ПолучитьНеРегистрируемое(Стр, НеРегистрируемыеОбъекты, НеРегистрируемыеРеквизиты);
	КонецЦикла;
КонецПроцедуры

// В зависимости от того включена или нет подсистема доступны элементы настройки
&НаСервере
Процедура ДоступностьЭлементов()
	
	Элементы.ГруппаПодключение.Доступность							= ВестиИсториюИзменений;
	Элементы.ГруппаПараметрУникальности.Доступность					= ВестиИсториюИзменений;
	Элементы.РегистрироватьВходыИВыходыПользователей.Доступность	= ВестиИсториюИзменений;
	Элементы.НажатиеКнопкаПараметрУникальностиТекущейИБ.Доступность	= ИспользоватьПараметрУникальностиИБ;
	Элементы.ГруппаПараметрыУникальности.Доступность				= ИспользоватьПараметрУникальностиИБ;
	
	Элементы.ОчищатьЖурналРегистрацииАвтоматически.Доступность		= ВестиИсториюИзменений;
	Элементы.ПериодАвтоматическойОчисткиЖурналаРегистрации.Доступность = ВестиИсториюИзменений И ОчищатьЖурналРегистрацииАвтоматически;
	Элементы.ИспользоватьПараметрУникальностиИБ.Доступность			= ВестиИсториюИзменений;
	Элементы.ГруппаИдентификаторИБ.Доступность						= ВестиИсториюИзменений;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьВсеФлагиРегистрируемыхОбъектов(СтрокиРегистрируемыеОбъекты, Флаг)
	
	Для Каждого Стр Из СтрокиРегистрируемыеОбъекты.Строки Цикл
		Стр.Использование = Флаг;                   
		УстановитьВсеФлагиРегистрируемыхОбъектов(Стр, Флаг);
	КонецЦикла;
	
КонецПроцедуры // УстановитьВсеФлагиРегистрируемыхОбъектов

&НаСервереБезКонтекста
Процедура ПолучитьСтрокуРегистрируемогоОбъекта(СтрокиРегистрируемыеОбъекты, СтрокаРегОбъекта, Результат)
	
	Если Результат <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Стр Из СтрокиРегистрируемыеОбъекты.Строки Цикл
		Если ВРег(Стр.Имя) = ВРег(СтрокаРегОбъекта) Тогда
			Результат = Стр;
			Прервать;
		КонецЕсли;
		
		ПолучитьСтрокуРегистрируемогоОбъекта(Стр, СтрокаРегОбъекта, Результат);
	КонецЦикла;
	
КонецПроцедуры // ПолучитьСтрокуРегистрируемогоОбъекта
	
// Обновляет флаги в дереве регистрируемых объектов
&НаСервере
Процедура ОбновитьФлагиРегистрируемыхОбъектов()
	
	Дерево = ДанныеФормыВЗначение(РегистрируемыеОбъекты, Тип("ДеревоЗначений"));
	
	// Сначала установим все флаги рекурсивно
	УстановитьВсеФлагиРегистрируемыхОбъектов(Дерево, Истина);
	
	///////////////////////////////////
	// Загрузка НеРегистрируемыеОбъекты	
	
	ТЗНеРегистрируемые = Renault_внОбщийМодуль.ПолучитьНеРегистрируемыеОбъекты();
	НачальнаяПометкаКоллекций(ТЗНеРегистрируемые, Дерево);
	
	ЗначениеВРеквизитФормы(Дерево, "РегистрируемыеОбъекты");
		
КонецПроцедуры // ОбновитьФлагиРегистрируемыхОбъектов

// Процедура НачальнаяПометкаКоллекций устанавливает пометку для коллекций
//
&НаСервере
Процедура НачальнаяПометкаКоллекций(ТЗНеРегистрируемые, ТекСтрока)

	ПараметрыОтбора = Новый Структура;
	
	Для каждого Строки Из ТекСтрока.Строки Цикл
				
		ПараметрыОтбора.Вставить("МетаданныеОбъекта", 	Строки.ПолноеИмя);
		ПараметрыОтбора.Вставить("ИмяТЧ", 				Строки.ИмяТЧ);
		ПараметрыОтбора.Вставить("ИмяРеквизита", 		Строки.Имя);
		НайденныеСтроки = ТЗНеРегистрируемые.НайтиСтроки(ПараметрыОтбора);				
		Если НайденныеСтроки.Количество() > 0 Тогда
			Строки.Использование = 0;
			ПометитьВложенныеЭлементыСервер(Строки);
			ПометитьЭлементыРодителейСервер(Строки.Родитель);				
		КонецЕсли;
		
		// Рекурсия
		Если Строки.Строки.Количество() > 0 Тогда
			НачальнаяПометкаКоллекций(ТЗНеРегистрируемые, Строки)
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // НачальнаяПометкаКоллекций

&НаСервере
Функция ЗначениеПометкиЭлементовНаСервере(ЭлементыРодителя)
	
	ЕстьПомеченные    = Ложь;
	ЕстьНепомеченные = Ложь;
	
	Для каждого ЭлементРодителя Из ЭлементыРодителя Цикл
		
		Если ЭлементРодителя.Использование = 2 ИЛИ (ЕстьПомеченные И ЕстьНепомеченные) Тогда
			ЕстьПомеченные    = Истина;
			ЕстьНепомеченные = Истина;
			Прервать;
		ИначеЕсли ЭлементРодителя.ПолучитьРодителя() <> Неопределено Тогда
			ЕстьПомеченные    = ЕстьПомеченные    ИЛИ    ЭлементРодителя.Использование;
			ЕстьНепомеченные = ЕстьНепомеченные ИЛИ НЕ ЭлементРодителя.Использование;
		Иначе
			ВложенныеЭлементы = ЭлементРодителя.ПолучитьЭлементы();
			Если ВложенныеЭлементы.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			ЗначениеПометкиВложенныхЭлементов = ЗначениеПометкиЭлементовНаСервере(ВложенныеЭлементы);
			ЕстьПомеченные    = ЕстьПомеченные    ИЛИ    ЭлементРодителя.Использование ИЛИ    ЗначениеПометкиВложенныхЭлементов;
			ЕстьНепомеченные = ЕстьНепомеченные ИЛИ НЕ ЭлементРодителя.Использование ИЛИ НЕ ЗначениеПометкиВложенныхЭлементов;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ?(ЕстьПомеченные И ЕстьНепомеченные, 2, ?(ЕстьПомеченные, 1, 0));
	
КонецФункции

&НаСервере
Процедура УстановитьФлагиРегистрируемыхОбъектов(Флаг)
	Дерево = ДанныеФормыВЗначение(РегистрируемыеОбъекты, Тип("ДеревоЗначений"));
	
	УстановитьВсеФлагиРегистрируемыхОбъектов(Дерево, Флаг);	
	ЗначениеВРеквизитФормы(Дерево, "РегистрируемыеОбъекты");
КонецПроцедуры

&НаСервере
Процедура УстановитьФлагиНачальноеЗаполнениеОбъекты(Флаг)
	Дерево = ДанныеФормыВЗначение(НачальноеЗаполнениеОбъекты, Тип("ДеревоЗначений"));
	
	УстановитьВсеФлагиРегистрируемыхОбъектов(Дерево, Флаг);	
	ЗначениеВРеквизитФормы(Дерево, "НачальноеЗаполнениеОбъекты");
КонецПроцедуры
         
&НаСервере
Процедура ЗаполнитьРегистрируемыеОбъекты()
	
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("Представление",	Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("Имя",				Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("ИмяТЧ",			Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("ИндексКартинки",	Новый ОписаниеТипов("Число"));
	Дерево.Колонки.Добавить("Использование");	
	Дерево.Колонки.Добавить("ПолноеИмя");
	Дерево.Колонки.Добавить("СодержитЭлементы");
	Дерево.Колонки.Добавить("ЭтоОбъект");
	
	
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.Константы, 					"Константы", 				"", 			2);
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.Справочники, 				"Справочники", 				"", 			3);
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.Документы, 					"Документы", 				"", 			4);
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.ПланыВидовХарактеристик, 	"Планы видов характеристик","", 			5);
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.ПланыСчетов, 				"Планы счетов", 			"", 			6);
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.ПланыВидовРасчета, 			"Планы видов расчета", 		"", 			7);
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.ПланыОбмена, 				"Планы обмена", 			"", 			8);
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.РегистрыСведений, 			"Регистры сведений", 		"", 			11);
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.БизнесПроцессы, 				"Бизнесс-процессы", 		"", 			10);
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.Задачи, 						"Задачи", 					"", 			9);
	
	ЗначениеВРеквизитФормы(Дерево, "РегистрируемыеОбъекты");
	
	ОбновитьФлагиРегистрируемыхОбъектов();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНачальноеЗаполнение()
	Дерево = РеквизитФормыВЗначение("НачальноеЗаполнениеОбъекты", Тип("ДеревоЗначений"));
	
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.Константы, 					"Константы", 				"Константа", 				2, Ложь);
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.Справочники, 				"Справочники", 				"Справочник", 				3, Ложь);
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.Документы, 					"Документы", 				"Документ", 				4, Ложь);
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.ПланыВидовХарактеристик, 	"Планы видов характеристик","ПланВидовХарактеристик", 	5, Ложь);
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.ПланыСчетов, 				"Планы счетов", 			"ПланСчетов", 				6, Ложь);
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.ПланыВидовРасчета, 			"Планы видов расчета", 		"ПланВидовРасчета", 		7, Ложь);
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.ПланыОбмена, 				"Планы обмена", 			"ПланОбмена", 				8, Ложь);
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.РегистрыСведений, 			"Регистры сведений", 		"РегистрСведений", 			11, Ложь);
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.БизнесПроцессы, 				"Бизнесс-процессы", 		"БизнесПроцесс", 			10, Ложь);
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.Задачи, 						"Задачи", 					"Задача", 					9, Ложь);	
	
	УстановитьВсеФлагиРегистрируемыхОбъектов(Дерево, Истина);	
	
	ЗначениеВРеквизитФормы(Дерево, "НачальноеЗаполнениеОбъекты");
	
КонецПроцедуры

&НаСервере
Процедура СнятьВыделениеКнопки()
	
	мНовыйШрифт									= Новый Шрифт();
	Элементы.ОткрытьДополнительно.Шрифт			= мНовыйШрифт;
	Элементы.ОткрытьНастройкиИстории.Шрифт		= мНовыйШрифт;
	Элементы.ОткрытьОчисткаИСжатие.Шрифт		= мНовыйШрифт;
	Элементы.ОткрытьРегистрируемыеОбъекты.Шрифт	= мНовыйШрифт;
	Элементы.ОткрытьРолиИстории.Шрифт			= мНовыйШрифт;
	Элементы.ОткрытьНачальноеЗаполнение.Шрифт	= мНовыйШрифт;
	Элементы.ОткрытьРИБ.Шрифт					= мНовыйШрифт;
	Элементы.ОткрытьПодпискаНаСобытия.Шрифт		= мНовыйШрифт;
	
КонецПроцедуры // СнятьВыделениеКнопки

&НаСервере
Процедура ОбновитьСписокПользователейИРолей()
	Пользователи.Очистить();
	
	НаличиеПраваНаРедактированиеПользователейИБ = ПравоДоступа("Администрирование", Метаданные);
	
	Если НаличиеПраваНаРедактированиеПользователейИБ Тогда
		Для Каждого ПользовательИБ Из ПользователиИнформационнойБазы.ПолучитьПользователей() Цикл			
			НоваяСтрока = Пользователи.Добавить();
			НоваяСтрока.Пользователь = ПользовательИБ.Имя;
			НоваяСтрока.УникальныйИдентификатор = Строка(ПользовательИБ.УникальныйИдентификатор);
			                                                      
			НоваяСтрока.ФлагПросмотр 		= ПользовательИБ.Роли.Содержит(Метаданные.Роли.Renault_внПросмотрЖурналаРегистрации);
			НоваяСтрока.ФлагПользователь	= ПользовательИБ.Роли.Содержит(Метаданные.Роли.Renault_внПользовательИсторииИзменений);
			НоваяСтрока.ФлагАдминистратор	= ПользовательИБ.Роли.Содержит(Метаданные.Роли.Renault_внАдминистраторЖурналаРегистрации);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ТестСоединения()
	
	внСоединение = Renault_внОбщийМодуль.ПодключитьSQL(Renault_внОбщийМодуль.ПолучитьПараметрыДоступаКБазеДанных());

	Удачно = Истина;
	Если внСоединение = Неопределено Тогда
		Удачно = Ложь;
	КонецЕсли;
	
	Возврат Удачно;
	
КонецФункции

&НаСервере
Процедура УстановитьФлагиВКолонкеПользователей(ИмяКолонки, Флаг)
	Для Каждого Строки Из Пользователи Цикл
		Строки[ИмяКолонки] = Флаг;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура НайтиСтрокуДереваПоИмени(Строки, Имя, ТекущиеДанные)
	
	Если ТекущиеДанные <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Стр Из Строки Цикл
		Если Стр.Имя = Имя Тогда
			ТекущиеДанные = Стр;
			Возврат;
		КонецЕсли;
		НайтиСтрокуДереваПоИмени(Стр.Строки, Имя, ТекущиеДанные);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ЗначениеПометкиЭлементов(ЭлементыРодителя)
	
	ЕстьПомеченные    = Ложь;
	ЕстьНепомеченные = Ложь;
	
	Для каждого ЭлементРодителя Из ЭлементыРодителя Цикл
		
		Если ЭлементРодителя.Использование = 2 ИЛИ (ЕстьПомеченные И ЕстьНепомеченные) Тогда
			ЕстьПомеченные    = Истина;
			ЕстьНепомеченные = Истина;
			Прервать;
		ИначеЕсли ЭлементРодителя.ПолучитьРодителя() <> Неопределено Тогда
			ЕстьПомеченные    = ЕстьПомеченные    ИЛИ    ЭлементРодителя.Использование;
			ЕстьНепомеченные = ЕстьНепомеченные ИЛИ НЕ ЭлементРодителя.Использование;
		Иначе
			ВложенныеЭлементы = ЭлементРодителя.ПолучитьЭлементы();
			Если ВложенныеЭлементы.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			ЗначениеПометкиВложенныхЭлементов = ЗначениеПометкиЭлементов(ВложенныеЭлементы);
			ЕстьПомеченные    = ЕстьПомеченные    ИЛИ    ЭлементРодителя.Использование ИЛИ    ЗначениеПометкиВложенныхЭлементов;
			ЕстьНепомеченные = ЕстьНепомеченные ИЛИ НЕ ЭлементРодителя.Использование ИЛИ НЕ ЗначениеПометкиВложенныхЭлементов;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ?(ЕстьПомеченные И ЕстьНепомеченные, 2, ?(ЕстьПомеченные, 1, 0));
	
КонецФункции

&НаКлиенте
Процедура РегистрируемыеОбъектыФормаИспользованиеПриИзменении(Элемент)
	
	ТекущиеДанные = ТекущийЭлемент.ТекущиеДанные;
	Если ТекущиеДанные.Использование = 2 Тогда
		ТекущиеДанные.Использование = 0;
	КонецЕсли;
	ПометитьВложенныеЭлементы(ТекущиеДанные);
	ПометитьЭлементыРодителей(ТекущиеДанные.ПолучитьРодителя());
	
КонецПроцедуры

&НаСервере
Функция НеобходимоСжатиеПередОчисткой()
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	внКэшЖурналаРегистрации.ДатаИзменения КАК ДатаИзменения
		|ИЗ
		|	Справочник.Renault_внКэшЖурналаРегистрации КАК внКэшЖурналаРегистрации
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаИзменения"	
	);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ДатаОчистки > Выборка.ДатаИзменения Тогда
			Возврат Истина;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПрогрессОчистки()
	
	ПодключитьОбработчикОжидания("ОбновитьПрогрессОчистки", 1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьИсториюНажатие(Команда)
	
	ЗаполнитьТаблицы = Ложь;
	Если ДатаОчистки > ТекущаяДата() Тогда 
		Предупреждение("Указана неправильная дата!");
		Возврат
	КонецЕсли;

	Если ДатаОчистки = Дата (1, 1, 1) Тогда 
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("Вы действительно хотите ПОЛНОСТЬЮ очистить журнал?", Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
		    Возврат;
		КонецЕсли;
		
		Удачно = Renault_внОбщийМодуль.ОчиститьЖурналРегистрацииПолностью();
		ЗаполнитьТаблицы = Истина;
	Иначе
		
		Если НеобходимоСжатиеПередОчисткой() Тогда
			Если Вопрос("Перед очисткой журнала регистрации необхожимо его сжать. Произвести сжатие сейчас?", РежимДиалогаВопрос.ДаНет, 0) = КодВозвратаДиалога.Да Тогда
				СжатьИсториюНажатие(Команда, Ложь);
			Иначе 
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ПодключитьОбработчикОжидания("ОбновитьПрогрессОчистки", 1, Истина);
		Удачно = Renault_внОбщийМодуль.ОчиститьЖурналРегистрацииНаДату(Истина, ДатаОчистки);
		
	КонецЕсли;
	
	Если Удачно Тогда
		Оповестить("внОбновитьИсторию");
		Предупреждение("История очищена!");
		Если ЗаполнитьТаблицы Тогда 
			Renault_внОбщийМодуль.ПриНачалеРаботыСистемы();
		КонецЕсли;
	Иначе
		Предупреждение("Подключение не может быть установлено...");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СжатьИсториюНажатие(Команда, Оповещать = Истина)
	
	Удачно = Renault_внОбщийМодуль.СжатьИсториюИзменений(Истина, Ложь);
	Если Удачно Тогда
		Оповестить("внОбновитьИсторию");
		Если НЕ Оповещать = Ложь Тогда 
			Предупреждение("История сжата!");
		КонецЕсли;
	Иначе
		Предупреждение("Подключение не может быть установлено...");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНачальноеЗаполнение(Команда)
	
	Если НачальноеЗаполнениеОбъекты.ПолучитьЭлементы().Количество() = 0 Тогда
		ЗаполнитьНачальноеЗаполнение();
	КонецЕсли;	
	Элементы.ПанельОбщая.ТекущаяСтраница = Элементы.НачальноеЗаполнениеВлкадка;
	СнятьВыделениеКнопки();
	Элементы.ОткрытьНачальноеЗаполнение.Шрифт	= Новый Шрифт(,,Истина);
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьНачальноеЗаполнениеНаСервере()
	
	// Получение списка объектов для создания начального образа
	МассивОбъектов = Новый Массив;
	
	НЗ = ДанныеФормыВЗначение(НачальноеЗаполнениеОбъекты, Тип("ДеревоЗначений"));
	
	Для Каждого СтрокаКласса Из НЗ.Строки Цикл		
		Если СтрокаКласса.Использование = 0 Тогда
			Продолжить;
		КонецЕсли;		
		Для Каждого СтрокаОбъекта Из СтрокаКласса.Строки Цикл
			Если СтрокаОбъекта.Использование = 1 Тогда
				МассивОбъектов.Добавить(СтрокаОбъекта.ПолноеИмя);
			КонецЕсли;			
		КонецЦикла;
	КонецЦикла;	
	
	Возврат МассивОбъектов;
КонецФункции

&НаСервере
Функция ПолучитьИсториюИзменений()
	
	Макет						= ПолучитьОбщийМакет("Renault_внОписаниеИзменений");
	ТД							= Новый ТабличныйДокумент;
	ТД.ТолькоПросмотр			= Истина;
	ТД.ОтображатьГруппировки	= Истина;
	ТД.ОтображатьСетку			= Ложь;
	ТД.ОтображатьЗаголовки		= Ложь;
	ТД.Вывести(Макет);	
	Возврат ТД;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьИдентификаторИБ(Команда)
	ЗаписатьНастройки();	
	Ошибка = "";
	Если НЕ Renault_внОбщийМодуль.ПроверитьИдентификаторИБНаУникальность(ИдентификаторИБ, Ошибка) Тогда
		Предупреждение(Ошибка);
	Иначе
		Предупреждение("Идентификатор ИБ уникален!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРИБ(Команда)
	
	Элементы.ПанельОбщая.ТекущаяСтраница = Элементы.РИБ;
	СнятьВыделениеКнопки();
	Элементы.ОткрытьРИБ.Шрифт	= Новый Шрифт(,,Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьИдентификаторИБ(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Текст = 
		"Идентификатор журнала отличает информационную базу в журнале от других информационных баз.
		|Не рекомендуется изменять идентификатор, если он уже был задан ранее, т.к. пропадут все данные журанала введенные ранее.
		|Вы действительно хотите назначить новый идентификатор?";
	Ответ = Вопрос(Текст, Режим, 0);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
	    Возврат;
	КонецЕсли;
	
	Стр = ИдентификаторИБ;
	Если ВвестиСтроку(Стр, "Идентфикатор должен быть уникален в БД MS SQL") Тогда
		
		Ошибка = "";
		Если НЕ Renault_внОбщийМодуль.ПроверитьИдентификаторИБНаУникальность(Стр, Ошибка) Тогда
			
			Текст = Ошибка + "
			|Продолжить?";
			Ответ = Вопрос(Текст, Режим, 0);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
			    Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
		ИдентификаторИБ = Стр;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодпискаНаСобытия(Команда)
	
	Элементы.ПанельОбщая.ТекущаяСтраница = Элементы.ПодпискаНаСобытия;
	СнятьВыделениеКнопки();
	Элементы.ОткрытьПодпискаНаСобытия.Шрифт	= Новый Шрифт(,,Истина);	

КонецПроцедуры

// Обновляет флаги в дереве регистрируемых объектов
&НаСервере
Процедура ОбновитьФлагиУстановитьПоРегистрируемым()
	
	ЗаполнитьРегистрируемыеОбъекты();
	Дерево = ДанныеФормыВЗначение(НачальноеЗаполнениеОбъекты, Тип("ДеревоЗначений"));
	
	// Сначала установим все флаги рекурсивно
	УстановитьВсеФлагиРегистрируемыхОбъектов(Дерево, Истина);
	
	///////////////////////////////////
	// Загрузка НеРегистрируемыеОбъекты	
	
	ТЗНеРегистрируемые = Renault_внОбщийМодуль.ПолучитьНеРегистрируемыеОбъекты();
	НачальнаяПометкаКоллекций(ТЗНеРегистрируемые, Дерево);
	
	ЗначениеВРеквизитФормы(Дерево, "НачальноеЗаполнениеОбъекты");
		
КонецПроцедуры // ОбновитьФлагиРегистрируемыхОбъектов

&НаКлиенте
Процедура УстановитьПоРегистрируемым(Команда)
	
	ОбновитьФлагиУстановитьПоРегистрируемым();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипБДОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры


