
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ОпределениеДЦВЗН = Справочники.Renault_ОбщиеНастройкиБазыДанных.ЭтаБаза.ОпределениеДЦВЗН;
	
	Если ОпределениеДЦВЗН = 0 Тогда
		СтрокаДляЗамены = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДЦПодразделения.Ссылка КАК ДилерскийЦентр,
		|	ДЦПодразделения.Подразделение КАК ПодразделениеЦех
		|ПОМЕСТИТЬ ПодразделенияЦеха
		|ИЗ Справочник.CRM_ДилерскиеЦентры.ПодразделенияОрганизации КАК ДЦПодразделения
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(Работы.Ссылка КАК Документ.ЗаказНаряд) КАК СсылкаЗН,
		|	ПодразделенияЦеха.ДилерскийЦентр КАК ДилерскийЦентр
		|ПОМЕСТИТЬ ВсеЗНСРаботами
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК Работы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПодразделенияЦеха КАК ПодразделенияЦеха
		|		ПО Работы.Ссылка.ПодразделениеКомпании = ПодразделенияЦеха.ПодразделениеЦех
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_СоответствияВидовРемонта КАК Renault_СоответствияВидовРемонта
		|		ПО Renault_СоответствияВидовРемонта.ВидРемонта = Работы.Ссылка.ВидРемонта
		|		И (Renault_СоответствияВидовРемонта.КлассификацияRenault = ЗНАЧЕНИЕ(Перечисление.Renault_КлассификацияВидовРемонта.КузовнойРемонт)
		|			ИЛИ Renault_СоответствияВидовРемонта.КлассификацияRenault = ЗНАЧЕНИЕ(Перечисление.Renault_КлассификацияВидовРемонта.ГарантияКузовнойЦех))
		|ГДЕ
		|	Работы.Ссылка.ДатаЗакрытия >= &ДатаНачала
		|	И Работы.Ссылка.ДатаЗакрытия < &ДатаОкончания
		|	И Renault_СоответствияВидовРемонта.ВидРемонта ЕСТЬ NULL 
		|	И ПодразделенияЦеха.ДилерскийЦентр.ПометкаУдаления = ЛОЖЬ";
	Иначе
		СтрокаДляЗамены = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДЦПодразделения.Ссылка КАК ДилерскийЦентр,
		|	ВЫБОР КОГДА ДЦПодразделения.Цех.Родитель = ЗНАЧЕНИЕ(Справочник.Цеха.ПустаяСсылка) ТОГДА
		|		ДЦПодразделения.Цех
		|	ИНАЧЕ
		|		ДЦПодразделения.Цех.Родитель
		|	КОНЕЦ КАК ПодразделениеЦех
		|ПОМЕСТИТЬ ПодразделенияЦеха
		|ИЗ Справочник.CRM_ДилерскиеЦентры.АвтосервисЦеха КАК ДЦПодразделения
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(Работы.Ссылка КАК Документ.ЗаказНаряд) КАК СсылкаЗН,
		|	ПодразделенияЦеха.ДилерскийЦентр КАК ДилерскийЦентр
		|ПОМЕСТИТЬ ВсеЗНСРаботами
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК Работы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПодразделенияЦеха КАК ПодразделенияЦеха
		|		ПО Работы.Ссылка.Цех = ПодразделенияЦеха.ПодразделениеЦех
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_СоответствияВидовРемонта КАК Renault_СоответствияВидовРемонта
		|		ПО Renault_СоответствияВидовРемонта.ВидРемонта = Работы.Ссылка.ВидРемонта
		|		И (Renault_СоответствияВидовРемонта.КлассификацияRenault = ЗНАЧЕНИЕ(Перечисление.Renault_КлассификацияВидовРемонта.КузовнойРемонт)
		|			ИЛИ Renault_СоответствияВидовРемонта.КлассификацияRenault = ЗНАЧЕНИЕ(Перечисление.Renault_КлассификацияВидовРемонта.ГарантияКузовнойЦех))
		|ГДЕ
		|	Работы.Ссылка.ДатаЗакрытия >= &ДатаНачала
		|	И Работы.Ссылка.ДатаЗакрытия < &ДатаОкончания
		|	И Renault_СоответствияВидовРемонта.ВидРемонта ЕСТЬ NULL 
		|	И ПодразделенияЦеха.ДилерскийЦентр.ПометкаУдаления = ЛОЖЬ";
	КонецЕсли;
	
	СтрокаПоиска = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(Работы.Ссылка КАК Документ.ЗаказНаряд) КАК СсылкаЗН,
	|	ДЦ.Ссылка КАК ДилерскийЦентр
	|ПОМЕСТИТЬ ВсеЗНСРаботами
	|ИЗ
	|	Документ.ЗаказНаряд.Работы КАК Работы
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_ДилерскиеЦентры КАК ДЦ
	|	ПО ЛОЖЬ
	|ГДЕ
	|	Работы.Ссылка.ДатаЗакрытия >= &ДатаНачала
	|	И Работы.Ссылка.ДатаЗакрытия < &ДатаОкончания
	|	И ДЦ.Ссылка.ПометкаУдаления = ЛОЖЬ";
	
	СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос = СтрЗаменить(СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос, СтрокаПоиска, СтрокаДляЗамены);
	
КонецПроцедуры
