&НаСервере
Процедура УСтановитьДаты()
	для Каждого ст из Список.Отбор.Элементы Цикл
		Если Строка(Ст.ЛевоеЗначение) = "Дата" Тогда
			Если Ст.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
				Ст.ПравоеЗначение = Период.ДатаОкончания;
				Ст.Использование = Истина;
			ИначеЕсли  Ст.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
				Ст.ПравоеЗначение = Период.ДатаНачала;
				Ст.Использование = Истина;
			КонецЕсли;
		КонецЕсли;
		Элементы.Отборы.Обновить();
	Элементы.Список.Обновить();	
	КонецЦикла;

КонецПроцедуры  
&НаСервере
Процедура УбратьДаты()
	для Каждого ст из Список.Отбор.Элементы Цикл
		Если Строка(Ст.ЛевоеЗначение) = "Дата" Тогда
			Если Ст.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
				Ст.Использование = Ложь;
			ИначеЕсли  Ст.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
				Ст.Использование = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Элементы.Отборы.Обновить();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПериод(Команда)
	УбратьДаты();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод(Команда)
	// Вставить содержимое обработчика.
	УСтановитьДаты();
КонецПроцедуры
