Процедура ВыполнитьКодНаСервере (ТекстМодуля,СтруктураПараметров = Неопределено, СтруктураЗапросов = Неопределено, ДопПараметры = Неопределено) Экспорт
	Выполнить(ТекстМодуля);
КонецПроцедуры

Функция ОбновитьДанныеРегламентногоЗадания (Отказ, РасписаниеРегламентногоЗадания, Ссылка, Наименование, ИспользоватьРегламентноеЗадание, РегламентноеЗаданиеGUID) Экспорт 
	РегламентноеЗаданиеОбъект = СоздатьРегламентноеЗаданиеПриНеобходимости(Отказ, РегламентноеЗаданиеGUID);
	
	Если Отказ Тогда
		Возврат РегламентноеЗаданиеGUID;
	КонецЕсли;
	
	// обновляем свойства РЗ
	УстановитьПараметрыРегламентногоЗадания(РегламентноеЗаданиеОбъект, ЗначениеИзСтрокиВнутр(РасписаниеРегламентногоЗадания), Ссылка, Наименование, ИспользоватьРегламентноеЗадание);
	
	// записываем измененное задание
	ЗаписатьРегламентноеЗадание(Отказ, РегламентноеЗаданиеОбъект);
	
	// Возвращаем GUID регл. задания в реквизит объекта (РегламентноеЗаданиеGUID)
	Возврат Строка(РегламентноеЗаданиеОбъект.УникальныйИдентификатор);
КонецФункции

Процедура УстановитьПараметрыРегламентногоЗадания(РегламентноеЗаданиеОбъект, РасписаниеРегламентногоЗадания, Ссылка, Наименование, ИспользоватьРегламентноеЗадание)
	
	ПараметрыРегламентногоЗадания = Новый Массив;
	ПараметрыРегламентногоЗадания.Добавить(Ссылка);
	
	НаименованиеРегламентногоЗадания =
	"Выполнение: " + ТипЗнч(Ссылка) + ", Наименование: " + СокрЛП(Наименование) + ", Код: " + СокрЛП(Ссылка.Код);
	
	РегламентноеЗаданиеОбъект.Наименование	= Лев(НаименованиеРегламентногоЗадания, 120);
	РегламентноеЗаданиеОбъект.Использование	= ИспользоватьРегламентноеЗадание;
	РегламентноеЗаданиеОбъект.Параметры		= ПараметрыРегламентногоЗадания;
	
	// обновляем расписание, если оно было изменено
	Если РасписаниеРегламентногоЗадания <> Неопределено Тогда
		РегламентноеЗаданиеОбъект.Расписание = РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	Попытка 
		РегламентноеЗаданиеОбъект.Записать();
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьРасписаниеВыполненияОбменаДанными (Ссылка) Экспорт
	РасписаниеРегламентногоЗадания = Неопределено;
	
	РегламентноеЗаданиеОбъект = НайтиРегламентноеЗаданиеПоПараметру(Ссылка.РегламентноеЗаданиеGUID);
	
	Если РегламентноеЗаданиеОбъект <> Неопределено Тогда
		
		РасписаниеРегламентногоЗадания = РегламентноеЗаданиеОбъект.Расписание;
		
	КонецЕсли;
	
	Возврат ЗначениеВСтрокуВнутр(РасписаниеРегламентногоЗадания);
КонецФункции

Процедура ЗаписатьРегламентноеЗадание(Отказ, РегламентноеЗаданиеОбъект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		// записываем задание
		РегламентноеЗаданиеОбъект.Записать();
		
	Исключение
		
		СтрокаСообщения =
		"Произошла ошибка при сохранении расписания выполнения внешней обработки. Возможно данные расписания были изменены.
		|Подробное описание ошибки: " + ОписаниеОшибки();
		
		ЗаписьЖурналаРегистрации("Сообщение", УровеньЖурналаРегистрации.Примечание, , ,СтрокаСообщения);
		
	КонецПопытки;
	
КонецПроцедуры

Функция СоздатьРегламентноеЗаданиеПриНеобходимости(Отказ, РегламентноеЗаданиеGUID)
	
	РегламентноеЗаданиеОбъект = НайтиРегламентноеЗаданиеПоПараметру(РегламентноеЗаданиеGUID);
	
	// при необходимости создаем регл. задание
	Если РегламентноеЗаданиеОбъект = Неопределено Тогда
		
		РегламентноеЗаданиеОбъект = РегламентныеЗадания.СоздатьРегламентноеЗадание("Renault_ВыполнениеВнешнихОбработок");
		
	КонецЕсли;
	
	Возврат РегламентноеЗаданиеОбъект;
	
КонецФункции

Функция НайтиРегламентноеЗаданиеПоПараметру(УникальныйНомерЗадания) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		Если НЕ ПустаяСтрока(УникальныйНомерЗадания) Тогда
			
			УникальныйИдентификаторЗадания = Новый УникальныйИдентификатор(УникальныйНомерЗадания);
			ТекущееРегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(УникальныйИдентификаторЗадания);
			
		Иначе
			
			ТекущееРегламентноеЗадание = Неопределено;
			
		КонецЕсли;
		
	Исключение
		
		ТекущееРегламентноеЗадание = Неопределено;
		
	КонецПопытки;
	
	Возврат ТекущееРегламентноеЗадание;
	
КонецФункции