
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
	//Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПараметрыСеанса.Renault_ПраваПользователя.Скидка Тогда
		Сообщить("Не достаточно прав на установку",СтатусСообщения.Важное);
		Отказ=Истина;
	КонецЕсли;	
	
	Если ПредоставляетсяНаЗаказНаряд>0 Тогда
		Если Не ЗаписьКорректна(ЭтотОбъект) Тогда Отказ=Истина КонецЕсли;
		Запчасти.Очистить();
		Работы.Очистить();
	КонецЕсли;	
	
	Для Каждого Стр Из Запчасти Цикл Если НЕ ЗаписьКорректна(Стр) Тогда Отказ=Истина КонецЕсли КонецЦикла;
	Для Каждого Стр Из Работы Цикл Если НЕ ЗаписьКорректна(Стр) Тогда Отказ=Истина КонецЕсли КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Функция ЗаписьКорректна(Запись)
	ИдентификаторЗаписи=?(ПредоставляетсяНаЗаказНаряд,""," по артикулу "+Запись.Элемент.Артикул);
	Если Запись.СкидкаВПроцентах=0 И Запись.СкидкаВРублях=0 И Запись.КомпенсацияВРублях=0 Тогда
		Сообщить("Не заданы парамеры скидки"+ИдентификаторЗаписи,СтатусСообщения.Внимание);
		Возврат Ложь
	ИначеЕсли ( ?(Запись.СкидкаВПроцентах>0,1,0)+?(Запись.СкидкаВРублях>0,1,0)+?(Запись.КомпенсацияВРублях>0,1,0) )>1 Тогда
		Сообщить("Нельзя указывать более одного параметра скидки"+ИдентификаторЗаписи,СтатусСообщения.Внимание);
		Возврат Ложь
	КонецЕсли;
	Возврат Истина
КонецФункции	
