
Функция ПолучитьСписокАктивныхНастроек()

	ЗапросНастроек = Новый Запрос;
	ЗапросНастроек.Текст = "ВЫБРАТЬ
	                       |	Renault_НастройкиОбменаСРеноПартс.Ссылка КАК Настройка
	                       |ИЗ
	                       |	Справочник.Renault_НастройкиОбменаСРеноПартс КАК Renault_НастройкиОбменаСРеноПартс
	                       |ГДЕ
	                       |	Renault_НастройкиОбменаСРеноПартс.Активная";
	
	Возврат ЗапросНастроек.Выполнить().Выгрузить().ВыгрузитьКолонку("Настройка");

КонецФункции


Процедура Renault_PartsВыгрузкаОстатка(Параметр=Неопределено) Экспорт

	СписокНастроек = ПолучитьСписокАктивныхНастроек();

	Обработка = Обработки.Renault_ОбменРеноПартс.Создать();

	Для Каждого Настройка Из СписокНастроек Цикл

		Обработка.НастройкаОбмена = Настройка;
		Обработка.ВыгрузитьОстатки();

	КонецЦикла;

КонецПроцедуры

Процедура Renault_PartsЗагрузкаЗаказов(Параметр=Неопределено) Экспорт

	СписокНастроек = ПолучитьСписокАктивныхНастроек();

	Обработка = Обработки.Renault_ОбменРеноПартс.Создать();
	Обработка.ДатаНачала    = ТекущаяДата() - 24*60*60;
	Обработка.ДатаОкончания = ТекущаяДата() + 24*60*60;

	Для Каждого Настройка Из СписокНастроек Цикл

		Обработка.НастройкаОбмена = Настройка;
		Обработка.ПолучитьЗаказы();

	КонецЦикла;

КонецПроцедуры
