
// процедура заполнения предопределенных элементов справочника
//
// Параметры:
// ЗаполнятьВсе - Булево - Признак заполнение всей информации
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	
	//Заполнение кодов маркировки
	
	// Для меха код маркировки "00 02"
	ТекущийТипМаркировки = Справочники.ТипыМаркировки.ИзделияИзМеха.ПолучитьОбъект();
	
	Если ТекущийТипМаркировки.КодМаркировки = 0 Тогда
		ТекущийТипМаркировки.КодМаркировки = 2;
	КонецЕсли;
	
	НовыйЭлемент = ТекущийТипМаркировки.ЭтоНовый();
	Если ТекущийТипМаркировки.Модифицированность() Тогда
		Попытка
			ТекущийТипМаркировки.Записать();
			#Если Клиент Тогда
			Сообщить("Справочник ""Типы маркировки"". "+?(НовыйЭлемент,"Создан","Обновлен")+" элемент """+СокрЛП(ТекущийТипМаркировки.Наименование)+"""");
			#КонецЕсли
		Исключение КонецПопытки;
	КонецЕсли;
	
	// Для лекарств код маркировки "00 03"
	ТекущийТипМаркировки = Справочники.ТипыМаркировки.ЛекарственныеПрепараты.ПолучитьОбъект();
	
	Если ТекущийТипМаркировки.КодМаркировки = 0 Тогда
		ТекущийТипМаркировки.КодМаркировки = 3;
	КонецЕсли;
	
	НовыйЭлемент = ТекущийТипМаркировки.ЭтоНовый();
	Если ТекущийТипМаркировки.Модифицированность() Тогда
		Попытка
			ТекущийТипМаркировки.Записать();
			#Если Клиент Тогда
			Сообщить("Справочник ""Типы маркировки"". "+?(НовыйЭлемент,"Создан","Обновлен")+" элемент """+СокрЛП(ТекущийТипМаркировки.Наименование)+"""");
			#КонецЕсли
		Исключение КонецПопытки;
	КонецЕсли;
	
	// Для табак код маркировки "00 05"
	ТекущийТипМаркировки = Справочники.ТипыМаркировки.ТабачнаяПродукция.ПолучитьОбъект();
	
	Если ТекущийТипМаркировки.КодМаркировки = 0 Тогда
		ТекущийТипМаркировки.КодМаркировки = 5;
	КонецЕсли;
	
	НовыйЭлемент = ТекущийТипМаркировки.ЭтоНовый();
	Если ТекущийТипМаркировки.Модифицированность() Тогда
		Попытка
			ТекущийТипМаркировки.Записать();
			#Если Клиент Тогда
			Сообщить("Справочник ""Типы маркировки"". "+?(НовыйЭлемент,"Создан","Обновлен")+" элемент """+СокрЛП(ТекущийТипМаркировки.Наименование)+"""");
			#КонецЕсли
		Исключение КонецПопытки;
	КонецЕсли;
	
	// Для обуви код маркировки "15 20"
	ТекущийТипМаркировки = Справочники.ТипыМаркировки.ОбувныеТовары.ПолучитьОбъект();
	
	Если ТекущийТипМаркировки.КодМаркировки = 0 Тогда
		ТекущийТипМаркировки.КодМаркировки = 5408;
	КонецЕсли;
	
	НовыйЭлемент = ТекущийТипМаркировки.ЭтоНовый();
	Если ТекущийТипМаркировки.Модифицированность() Тогда
		Попытка
			ТекущийТипМаркировки.Записать();
			#Если Клиент Тогда
			Сообщить("Справочник ""Типы маркировки"". "+?(НовыйЭлемент,"Создан","Обновлен")+" элемент """+СокрЛП(ТекущийТипМаркировки.Наименование)+"""");
			#КонецЕсли
		Исключение КонецПопытки;
	КонецЕсли;
	
	// Для шин код маркировки "22 11"
	ТекущийТипМаркировки = Справочники.ТипыМаркировки.ШиныИАвтопокрышки.ПолучитьОбъект();
	
	Если ТекущийТипМаркировки.КодМаркировки = 0 Тогда
		ТекущийТипМаркировки.КодМаркировки = 8721;
	КонецЕсли;
	
	НовыйЭлемент = ТекущийТипМаркировки.ЭтоНовый();
	Если ТекущийТипМаркировки.Модифицированность() Тогда
		Попытка
			ТекущийТипМаркировки.Записать();
			#Если Клиент Тогда
			Сообщить("Справочник ""Типы маркировки"". "+?(НовыйЭлемент,"Создан","Обновлен")+" элемент """+СокрЛП(ТекущийТипМаркировки.Наименование)+"""");
			#КонецЕсли
		Исключение КонецПопытки;
	КонецЕсли;
	
	
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()
