
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МассивОтветов") Тогда
		
		МассивОтветов = Параметры.МассивОтветов;
		
		Для каждого эл Из МассивОтветов Цикл
			
			Нстр = Автомобили.Добавить();		
			ЗаполнитьЗначенияСвойств(Нстр, эл);
			Если эл.Свойство("Ответ") Тогда
				сОтвет = эл.Ответ;
				Если ЗначениеЗаполнено(сОтвет) И сОтвет.Свойство("Модель") Тогда // DMSREN-1183
					Нстр.Модель = Справочники.Модели.НайтиПоРеквизиту("Артикул", сОтвет.Модель);
					Если сОтвет.Свойство("Версия") Тогда
						Нстр.Версия = Справочники.ВариантыКомплектации.НайтиПоРеквизиту("Артикул",сОтвет.Версия,,Нстр.Модель);   // DMSREN-785
					КонецЕсли;
					Нстр.Цвет = Справочники.Цвета.НайтиПоРеквизиту("Артикул",сОтвет.Цвет);
					ЦветСалона = Справочники.DMS_ЦветаСалона.НайтиПоРеквизиту("Артикул",сОтвет.ЦветСалона);
					Если ЦветСалона = Справочники.DMS_ЦветаСалона.ПустаяСсылка() и ЗначениеЗаполнено(сОтвет.ЦветСалона) тогда
						НовыйЦветСалона = Справочники.DMS_ЦветаСалона.СоздатьЭлемент();
						НовыйЦветСалона.Артикул = сОтвет.ЦветСалона;
						НовыйЦветСалона.Наименование = сОтвет.ЦветСалонаНаименование;
						НовыйЦветСалона.Записать();
						ЦветСалона = НовыйЦветСалона.Ссылка;
					КонецЕсли; 
					Нстр.ЦветСалона = ЦветСалона;
					ВариантСалона = Справочники.DMS_ВариантыСалона.НайтиПоРеквизиту("Артикул",сОтвет.ВариантСалона);
					Если ВариантСалона = Справочники.DMS_ВариантыСалона.ПустаяСсылка() и ЗначениеЗаполнено(сОтвет.ВариантСалона) тогда
						НовыйВариант = Справочники.DMS_ВариантыСалона.СоздатьЭлемент();
						НовыйВариант.Артикул = сОтвет.ВариантСалона;
						НовыйВариант.Наименование = сОтвет.ВариантСалонаНаименование;
						НовыйВариант.Записать();
						ВариантыСалона = НовыйВариант.Ссылка;
					КонецЕсли; 
					Нстр.ВариантСалона = ВариантСалона;
					Нстр.ТипАвтомобиля = Перечисления.DMS_ТипыАвтомобилей.VP;
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

	Если Параметры.Свойство("ДилерскийЦентр") Тогда
		ДилерскийЦентр = Параметры.ДилерскийЦентр;
	КонецЕсли;
	
	Если Параметры.Свойство("Автор") Тогда
		Автор = Параметры.Автор;
		Продавец = Параметры.Автор;
	КонецЕсли;
	
	Если Параметры.Свойство("Счет") Тогда
		Счет = Параметры.Счет;
	КонецЕсли;
	
	Если Параметры.Свойство("ДилерскийЦентр") Тогда
		ДилерскийЦентр = Параметры.ДилерскийЦентр;
	КонецЕсли;
	
	ЗаполнитьСписокКоммерческихАкцийНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокКоммерческихАкцийНаСервере()

	ТабАкций = Новый ТаблицаЗначений;
	ТабАкций.Колонки.Добавить("Акция");	
	ТабАкций.Колонки.Добавить("Количество");
	
	Для каждого стр Из Автомобили Цикл
	
		СписокДоступныхКоммерческихАкций = DMS_ОбменДаннымиСДилерскимПорталом.ВернутьСписокДоступныхКоммерческихАкций(стр.VIN);
		
		Для каждого эл Из СписокДоступныхКоммерческихАкций Цикл
		    нстр = ТабАкций.Добавить();
			нстр.Акция = эл.Значение;
		    нстр.Количество = 1;
		КонецЦикла;
		
	КонецЦикла;
	
	ТабАкций.Свернуть("Акция","Количество");
	
	КоличествоАвто = Автомобили.Количество();
	
	МассивОдинаковыхАкций = Новый Массив;
	
	Для каждого стр Из ТабАкций Цикл
	    Если стр.Количество = КоличествоАвто Тогда
		    МассивОдинаковыхАкций.Добавить(стр.Акция);		
		КонецЕсли;	
	КонецЦикла;
	
	ЭтаФорма.Элементы.КоммерческаяАкция1.СписокВыбора.ЗагрузитьЗначения(МассивОдинаковыхАкций);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаявкиНаСервере()
	
	CRM_КлиентскаяЗаявка = Документы.DMS_ЗаявкаНаАвтомобиль; 
	
	Для каждого стр Из Автомобили Цикл
		если ЗначениеЗаполнено(стр.ЗаявкаНаАвтомобиль) тогда // DMSREN-1183
			Продолжить;
		КонецЕсли;
			
		ДокОбъект 						= CRM_КлиентскаяЗаявка.СоздатьДокумент();
		ДокОбъект.Дата 					= ТекущаяДата();
		ДокОбъект.Автор 				= Автор;
		ДокОбъект.Продавец 				= Продавец;
		ДокОбъект.КоммерческаяАкция1	= КоммерческаяАкция1;
		ДокОбъект.ДатаЖелаемойПоставки 	= ДатаЖелаемойПоставки;
		ДокОбъект.Счет 					= Счет;
		ДокОбъект.ДилерскийЦентр 		= ДилерскийЦентр;
		ДокОбъект.ТипЗаявки 			= ТипЗаявки;
		ДокОбъект.ОбычнаяСделка 		= ОбычнаяСделка;
		ДокОбъект.Конверсия 			= Конверсия;
		ДокОбъект.Лизинг 				= Лизинг;

		ДокОбъект.VIN 					= стр.VIN;
	    ДокОбъект.Модель				= стр.Модель;
		ДокОбъект.Версия 				= стр.Версия;
		ДокОбъект.Цвет 					= стр.Цвет;
		ДокОбъект.ВариантСалона 		= стр.ВариантСалона;
		ДокОбъект.ЦветСалона 			= стр.ЦветСалона;
		ДокОбъект.ТипАвтомобиля 		= стр.ТипАвтомобиля;
		ДокОбъект.ДоговорКП 			= стр.ДоговорКП;
		ДокОбъект.Клиент 				= стр.Клиент;
		попытка
			ДокОбъект.Записать();
		исключение
			Продолжить;
		КонецПопытки;
		стр.ЗаявкаНаАвтомобиль = ДокОбъект.Ссылка;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявки(Команда)
	СоздатьЗаявкиНаСервере();
КонецПроцедуры
