Процедура ОбновитьСтатусыПисем(СхемаОбзвона) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	Renault_CommunicationCenter_Обзвон.Ссылка,
	|	Renault_CommunicationCenter_Обзвон.СтатусЭлПисьма,
	|	Renault_CommunicationCenter_Обзвон.Email_ID КАК ИдентификаторСообщения,
	|	Renault_CommunicationCenter_Обзвон.ПисьмоПрочитано КАК Прочитано
	|ИЗ
	|	Документ.Renault_CommunicationCenter_Обзвон КАК Renault_CommunicationCenter_Обзвон
	|ГДЕ
	|	Renault_CommunicationCenter_Обзвон.СхемаОбзвона = &СхемаОбзвона
	|	И Renault_CommunicationCenter_Обзвон.Проведен";
	
	Запрос.УстановитьПараметр("СхемаОбзвона", СхемаОбзвона);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаИдентификаторов = Результат.Скопировать(, "ИдентификаторСообщения");
	
	ВебСервис     = ПолучитьВебСервисКЦ();
	СервисФабрика = ВебСервис.ФабрикаXDTO;
	Сериализатор  = Новый СериализаторXDTO(СервисФабрика);
	Параметры     = Сериализатор.ЗаписатьXDTO(ТаблицаИдентификаторов);
	Ответ         = ВебСервис.Renault_CommunicationCenter_GetMailStatus(Параметры);
	                          
	ТаблицаКВозврату = Сериализатор.ПрочитатьXDTO(Ответ);
	
	Для Каждого Строка ИЗ ТаблицаКВозврату Цикл
		
		СтрДокументОбзвона = Результат.Найти(Строка.ИдентификаторСообщения, "ИдентификаторСообщения");
		
		Если СтрДокументОбзвона <> Неопределено Тогда
			
			Статус = ПредопределенноеЗначение("Перечисление.Renault_СтатусыОтправкиПисем." + Строка.Статус); 
			
			Если СтрДокументОбзвона.СтатусЭлПисьма <> Статус 
				или СтрДокументОбзвона.Прочитано <> Строка.Прочитано Тогда

				ДокументОбзвона                      = СтрДокументОбзвона.Ссылка.ПолучитьОбъект();
			    ДокументОбзвона.СтатусЭлПисьма       = Статус;
				ДокументОбзвона.ПисьмоПрочитано      = Строка.Прочитано; 
				ДокументОбзвона.Записать(РежимЗаписиДокумента.Проведение);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ОбновитьСтатусыСМС(СхемаОбзвона) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	Renault_CommunicationCenter_Обзвон.Ссылка,
	|	Renault_CommunicationCenter_Обзвон.SMS_ID КАК ИдентификаторСообщения,
	|	Renault_CommunicationCenter_Обзвон.СтатусСМС
	|ИЗ
	|	Документ.Renault_CommunicationCenter_Обзвон КАК Renault_CommunicationCenter_Обзвон
	|ГДЕ
	|	Renault_CommunicationCenter_Обзвон.СхемаОбзвона = &СхемаОбзвона
	|	И Renault_CommunicationCenter_Обзвон.Проведен";
	
	Запрос.УстановитьПараметр("СхемаОбзвона", СхемаОбзвона);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаИдентификаторов = Результат.Скопировать(, "ИдентификаторСообщения");
	
	ВебСервис     = ПолучитьВебСервисКЦ();
	СервисФабрика = ВебСервис.ФабрикаXDTO;
	Сериализатор  = Новый СериализаторXDTO(СервисФабрика);
	Параметры     = Сериализатор.ЗаписатьXDTO(ТаблицаИдентификаторов);
	Ответ         = ВебСервис.GetSMSStatus(Параметры);
	
	ТаблицаКВозврату = Сериализатор.ПрочитатьXDTO(Ответ);
	
	Для Каждого Строка ИЗ ТаблицаКВозврату Цикл
		
		СтрДокументОбзвона = Результат.Найти(Строка.ИдентификаторСообщения, "ИдентификаторСообщения");
		
		Если СтрДокументОбзвона <> Неопределено Тогда
			
			Статус = ПредопределенноеЗначение("Перечисление.Renault_СтатусыСМС." + Строка.Статус); 
			
			Если СтрДокументОбзвона.СтатусСМС <> Статус Тогда

				ДокументОбзвона        = СтрДокументОбзвона.Ссылка.ПолучитьОбъект();
			    ДокументОбзвона.СтатусСМС = Статус;
				
				ДокументОбзвона.Записать(РежимЗаписиДокумента.Проведение);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьВебСервисКЦ()
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	
	ПарольWS = Настройки.ПарольДоступаКВебСервисам;
	ЛогинWS = Настройки.ЛогинДоступаКВебСервисам;
	
	АдресWS = Настройки.КЦАдресСервера;
	СообщениеОбОшибке = "";
	
	ВСОпределение = Новый WSОпределения(СокрЛП(АдресWS) + "ws/ContactCenter.ws?wsdl",
									СокрЛП(ЛогинWS), СокрЛП(ПарольWS));
	
	ВебСервис = Новый WSПрокси(ВСОпределение, "http://renault-nissan.com/schema/ContactCenter", 
							   "Renault_ContactCenter", "Renault_ContactCenterSoap12",300);
	ВебСервис.Пользователь	 = СокрЛП(ЛогинWS);
	ВебСервис.Пароль		 = СокрЛП(ПарольWS);
	
	Возврат ВебСервис;
	
КонецФункции

