
#Область ОбработчикСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	ОпределитьИменаРеквизитов();
	Если Параметры.Свойство(КодПользователя) Тогда
		КодПользователя=Параметры.КодПользователя;
	КонецЕсли;
	
	Если Не Параметры.Свойство("Отчет") Тогда
		Сообщить("Не определена схема компоновки для отчета");
		Отказ=Истина;
		Возврат;
	КонецЕсли;
	Попытка
		СхемаКомпоновкиДанных = ОтчетОбъект.ПолучитьМакет(Параметры.Отчет);
		СхемаКомпоновки = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
		Элементы.Вариант.СписокВыбора.Очистить();
		Для Каждого Стр Из СхемаКомпоновкиДанных.ВариантыНастроек Цикл
			Элементы.Вариант.СписокВыбора.Добавить(Стр.Имя,Стр.Представление);
		КонецЦикла;
		Если Параметры.Свойство("Вариант") Тогда
			Стр=Элементы.Вариант.СписокВыбора.НайтиПоЗначению(Параметры.Вариант);
		Иначе
			Стр=Неопределено;
		КонецЕсли;
		Если Стр=Неопределено Тогда
			Вариант=Элементы.Вариант.СписокВыбора[0].Значение;
			ИмяФормыОтчета = Элементы.Вариант.СписокВыбора[0].Представление;
		Иначе
			Вариант=Стр.Значение;
			ИмяФормыОтчета = Стр.Представление;
		КонецЕсли;               
		
	Исключение
		Сообщить(ОписаниеОшибки());
		Отказ=Истина;
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьИменаРеквизитов()
	// Произодитель и Артикул
	имяРеквизита=Новый Структура;
	метаНом = Метаданные.Справочники.Номенклатура.Реквизиты;
	Имена=Новый Структура("ор_Производитель,асПроизводитель,Производитель,Поставщик,ор_Поставщик");
	Для Каждого Стр Из Имена Цикл
		Если метаНом.Найти(Стр.Ключ)<>Неопределено Тогда
			имяРеквизита.Вставить("Производитель",Стр.Ключ);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Имена=Новый Структура("ор_НомерПоКаталогу,НомерПоКаталогу,АртикулПроизводителя,Артикул,АртикулДляПоиска");
	Для Каждого Стр Из Имена Цикл
		Если метаНом.Найти(Стр.Ключ)<>Неопределено Тогда
			имяРеквизита.Вставить("Артикул",Стр.Ключ);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если метаНом.Найти("АртикулДляПоиска")<>Неопределено Тогда
		имяРеквизита.Вставить("АртикулДляПоиска","АртикулДляПоиска");
		ЕстьДляПоиска=Истина;
	Иначе
		имяРеквизита.Вставить("АртикулДляПоиска",имяРеквизита.Артикул);
		ЕстьДляПоиска=Ложь;
	КонецЕсли;
	Если метаНом.Найти("Родитель")<>Неопределено Тогда
		ИмяРеквизита.Вставить("Родитель","Родитель");
	КонецЕсли;
	ИмяРеквизита.Вставить("Запрос",
	"ВЫБРАТЬ
	 |	Номенклатура.Ссылка КАК Номенклатура
	 |ИЗ
	 |	Справочник.Номенклатура КАК Номенклатура
	 |ГДЕ
	 |	Номенклатура."+имяРеквизита.Производитель+" = &Производитель "+?(ЕстьДляПоиска," 
	 |  И (Номенклатура."+имяРеквизита.Артикул+" = &Артикул 
	 |	ИЛИ Номенклатура."+имяРеквизита.АртикулДляПоиска+" = &Артикул)","
	 |  И Номенклатура."+имяРеквизита.Артикул+" = &Артикул")); 
	
КонецПроцедуры

&НаСервере
Процедура ВариантПриИзмененииНаСервере(Индекс)
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(СхемаКомпоновки);
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.ВариантыНастроек[Индекс].Настройки);
КонецПроцедуры

&НаКлиенте
Процедура ВариантПриИзменении(Элемент=Неопределено)
	Стр=Элементы.Вариант.СписокВыбора.НайтиПоЗначению(Вариант);
	Индекс=Элементы.Вариант.СписокВыбора.Индекс(Стр);
	ВариантПриИзмененииНаСервере(Индекс);
	ЭтаФорма.Заголовок=ПолучитьНаименованиеОтчета();
	Если Элементы.ТабличныйДокумент.ОтображениеСостояния.Видимость = Ложь Тогда
		УправлениеДиалогом(Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВладелецФормы.ФормыПАВставить("ОтчетУФ",ЭтаФорма);
	//создадим компоновщик настроек и загрузим настройки по умолчанию, вместо настроек по умолчанию можно использовать восстановленные настройки
    КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
	ВариантПриИзменении();
	
	Если КодПользователя=0 Тогда КодПользователя=ВладелецФормы.КодПользователя;КонецЕсли;
	Период.ДатаОкончания=КонецДня(ТекущаяДата());
	Период.ДатаНачала=Макс('20210601',НачалоМесяца(ДобавитьМесяц(Период.ДатаОкончания,-12)));
	СформироватьЗапрос();
	Если ВладелецФормы.Объект.ipКлиента="62.152.56.32" или ВладелецФормы.КодПользователя=4 Тогда
		Элементы.СменитьПользователя.Видимость=Истина;
	КонецЕсли;
	Элементы.ТабличныйДокумент.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.НеОтображать;
	УправлениеДиалогом(Истина, "Сформируйте отчет");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНажатие(Элемент, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСправка(Команда)
	
	ОткрытьСправкуФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если НЕ ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Событие = "ПорядокОтчета" Тогда
		
		Если НЕ РезультатЗакрытия.Папка Тогда
			ТекущиеДанные = КомпоновщикНастроек.Настройки.Порядок.ПолучитьОбъектПоИдентификатору(ДополнительныеПараметры.ТекущаяСтрока);
			ТекущиеДанные.Поле          = РезультатЗакрытия.Поле;
			ТекущиеДанные.Использование = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиПорядокПолеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.КомпоновщикНастроекНастройкиПорядок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("СхемаКомпоновки", СхемаКомпоновки);
	ПараметрыВыбора.Вставить("Событие",         "Ресурсы");
	ПараметрыВыбора.Вставить("ТекущееПоле",     ТекущиеДанные.Поле);
	ПараметрыВыбора.Вставить("НастройкиОтчета", КомпоновщикНастроек.ПолучитьНастройки());
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекущаяСтрока", Элементы.КомпоновщикНастроекНастройкиПорядок.ТекущаяСтрока);
	ДополнительныеПараметры.Вставить("Событие",       "ПорядокОтчета");
	
	ОписаниеОповещенияВыбораПоля = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", ЭтаФорма, ДополнительныеПараметры);
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораПолейОтчета", ПараметрыВыбора, ЭтаФорма,,,,ОписаниеОповещенияВыбораПоля, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОбработчикОжиданияКомпоновщикНастроекНастройкиОтборПриАктивизацииСтроки",0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборЛевоеЗначениеПриИзменении(Элемент)
	
	ОбработчикОжиданияКомпоновщикНастроекНастройкиОтборПриАктивизацииСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияКомпоновщикНастроекНастройкиОтборПриАктивизацииСтроки()
	
	ТекущиеДанные = Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено ИЛИ ТекущиеДанные.ЛевоеЗначение = Неопределено ИЛИ СокрЛП(ТекущиеДанные.ЛевоеЗначение) = "" Тогда
		Возврат;
	КонецЕсли;
	
	Если ИдентификаторОтбора = Строка(Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущаяСтрока) Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторОтбора = Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущаяСтрока;
	
	ДоступноеПолеОтбора = КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.НайтиПоле(ТекущиеДанные.ЛевоеЗначение);
	
	Если ДоступноеПолеОтбора = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТипЗначенияОтбора = ДоступноеПолеОтбора.ТипЗначения.Типы()[0];
	СписокВладельцев  = Новый СписокЗначений; //+- ОтчетыСервер.ПолучитьСписокВладельцев(КомпоновщикНастроек.ПолучитьНастройки(), ТипЗначенияОтбора);
	
	Если СписокВладельцев.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", СписокВладельцев[0].Значение);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	Элементы.КомпоновщикНастроекНастройкиОтборПравоеЗначение.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПравоеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = КомпоновщикНастроек.Настройки.Отбор.ПолучитьОбъектПоИдентификатору(ТекущаяСтрока);
	
	Если ОтборПоСписку(ТекущиеДанные.ВидСравнения) И Элемент.ПараметрыВыбора.Количество()>0 Тогда
		
		ЗначениеВладельца = Неопределено;
		Для Каждого ЭлементМассива Из Элемент.ПараметрыВыбора Цикл
			Если ЭлементМассива.Имя = "Отбор.Владелец" Тогда
				ЗначениеВладельца = ЭлементМассива.Значение;
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеВладельца = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
		Если ТекущиеДанные.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии ИЛИ
			ТекущиеДанные.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
			ТолькоГруппы = Истина;
		Иначе
			ТолькоГруппы = Ложь;
		КонецЕсли;
		
		ДоступноеПолеОтбора = КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.НайтиПоле(ТекущиеДанные.ЛевоеЗначение);
		
		СтруктураПараметров = Новый Структура("СписокВыбора, ТипЗначения, ДоступныеЗначения, ТолькоГруппы, ПараметрОтборПоВладельцу", ТекущиеДанные.ПравоеЗначение, ДоступноеПолеОтбора.ТипЗначения, ДоступноеПолеОтбора.ДоступныеЗначения, ТолькоГруппы, ЗначениеВладельца);
		
		ФормаВыбора = ПолучитьФорму("ОбщаяФорма.ОтчетВыборЗначенияОтбораИзСписка", СтруктураПараметров, Элемент);
		Рез = ФормаВыбора.ОткрытьМодально();
		
		Если НЕ Рез = Неопределено Тогда
			ТекущиеДанные.ПравоеЗначение = Рез;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбщегоНазначения
///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ СЕРВЕР

&НаСервере
Процедура УдалитьЭлементыГруппы(ПодчиненныеЭлементы) Экспорт
	
	КоличествоПодчиненных = ПодчиненныеЭлементы.Количество()-1;
	Пока КоличествоПодчиненных >= 0 Цикл
		Элементы.Удалить(ПодчиненныеЭлементы[КоличествоПодчиненных]);
		КоличествоПодчиненных = КоличествоПодчиненных - 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеДиалогом(ВзвестиМодифицированностьОтчета = Ложь, ТекстСообщения = "Настройки отчета были изменены. Необходимо переформировать отчет.")
	
	Если ВзвестиМодифицированностьОтчета Тогда
		Элементы.ТабличныйДокумент.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
		Элементы.ТабличныйДокумент.ОтображениеСостояния.Текст     = ТекстСообщения;
		Элементы.ТабличныйДокумент.ОтображениеСостояния.Видимость = Истина;
	Иначе
		Элементы.ТабличныйДокумент.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
		Элементы.ТабличныйДокумент.ОтображениеСостояния.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПользователя()
	
	Возврат ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПраво(ИмяПрава)
	
	Возврат Истина; //+- обПраво(ИмяПрава);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ КЛИЕНТ


&НаКлиенте
Функция ПолучитьНаименованиеОтчета()
	
	НаименованиеОтчета = "Отчет - "+ИмяФормыОтчета;
	
	Если Период.ДатаНачала<>'00010101' И Период.ДатаОкончания<>'00010101' Тогда
		ПериодСтрокой = ПредставлениеПериода(Период.ДатаНачала, КонецДня(Период.ДатаОкончания), "ФП=Истина");
		НаименованиеОтчета = НаименованиеОтчета + " (" + ПериодСтрокой + ")";
	ИначеЕсли Период.ДатаОкончания<>'00010101' Тогда
		ПериодСтрокой = Формат(Период.ДатаОкончания, "ДЛФ=DD");
		НаименованиеОтчета =  НаименованиеОтчета + " (" + ПериодСтрокой + ")";
	Иначе
		НаименованиеОтчета = НаименованиеОтчета;
	КонецЕсли;
	
	Возврат НаименованиеОтчета;
	
КонецФункции

&НаКлиенте
Функция НайтиОтборПоИмени(ИмяОтбора)
	
	Отборы = КомпоновщикНастроек.Настройки.Отбор.Элементы;
	
	РезультатПоиска = Неопределено;
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяОтбора);
	Для Каждого ТекОтбор Из Отборы Цикл
		Если ТипЗнч(ТекОтбор) = Тип("ЭлементОтбораКомпоновкиДанных") И ТекОтбор.ЛевоеЗначение = ПолеКомпоновки Тогда
			РезультатПоиска = ТекОтбор;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезультатПоиска;
	
КонецФункции

#Конецобласти

#Область КомандыПанелейФормы

////////////////////////////////////////////////////////////////////////////////
// КОМАНДЫ ПАНЕЛЕЙ ФОРМЫ

&НаСервере
Процедура ПоказатьОшибкиФормирования(СообщениеОбОшибке)
	
	Если ТипЗнч(СообщениеОбОшибке) = Тип("ИнформацияОбОшибке") Тогда
		ОписаниеОшибки = КраткоеПредставлениеОшибкиФормированияОтчета(СообщениеОбОшибке);
		ПодробноеПредставлениеОшибки = НСтр("ru = 'Ошибка при формировании:'") + Символы.ПС + ПодробноеПредставлениеОшибки(СообщениеОбОшибке);
		Если ПустаяСтрока(ОписаниеОшибки) Тогда
			ОписаниеОшибки = ПодробноеПредставлениеОшибки;
		КонецЕсли;
	Иначе
		ОписаниеОшибки = СообщениеОбОшибке;
	КонецЕсли;
	
	ОтображениеСостояния = Элементы.ТабличныйДокумент.ОтображениеСостояния;
	ОтображениеСостояния.Видимость                      = Истина;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	ОтображениеСостояния.Картинка                       = Новый Картинка;
	ОтображениеСостояния.Текст                          = ОписаниеОшибки;
	
КонецПроцедуры

&НаСервере
Процедура СкомпоноватьРезультат(ДокументРезультат)
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(СхемаКомпоновки);
	
    КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
    Настройки = КомпоновщикНастроек.Настройки;

	ВнешнийНабор = Новый Структура("ТаблицаДанных", ТаблицаДанных.Выгрузить());
	
	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки);
	
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешнийНабор);
	
	//Очищаем поле табличного документа
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	СообщениеОбОшибке = Неопределено;
	
	Попытка
		СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(СхемаКомпоновки);
		
		КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("ВыводитьЗаголовок").Значение        = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
		КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("ВыводитьЗаголовок").Использование   = Истина;
		
		КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("Заголовок").Значение                = Вариант;
		КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("Заголовок").Использование           = Истина;
		
		КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("ВыводитьОтбор").Значение            = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
		КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("ВыводитьОтбор").Использование       = Истина;
		
		КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("ВыводитьПараметрыДанных").Значение      = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
		КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("ВыводитьПараметрыДанных").Использование = Истина;
		
		СкомпоноватьРезультат(ТабличныйДокумент);
		
	Исключение
		СообщениеОбОшибке = ИнформацияОбОшибке();
	КонецПопытки;
	
	Если НЕ СообщениеОбОшибке = Неопределено Тогда
		ПоказатьОшибкиФормирования(СообщениеОбОшибке);
		Возврат;
	КонецЕсли;
	
	Элементы.ТабличныйДокумент.Защита              = Истина;
	ТабличныйДокумент.ВерхнийКолонтитул.ТекстСлева = "Отчет сформирован [&Дата]-[&Время], "+ПолучитьПользователя();
	ТабличныйДокумент.ВерхнийКолонтитул.Шрифт      = Новый Шрифт(ТабличныйДокумент.ВерхнийКолонтитул.Шрифт,,6);
	ТабличныйДокумент.ВерхнийКолонтитул.Выводить   = ПолучитьПраво("ПодписьПриПечатиОтчетов");
	//ТабличныйДокумент.НижнийКолонтитул.ТекстСлева  = ЭтаФорма.Заголовок;
	ТабличныйДокумент.НижнийКолонтитул.ТекстСправа = "[&НомерСтраницы]";
	ТабличныйДокумент.НижнийКолонтитул.Выводить    = Истина;
	ТабличныйДокумент.НижнийКолонтитул.Шрифт       = Новый Шрифт(ТабличныйДокумент.ВерхнийКолонтитул.Шрифт,,6);
	
	УдалитьЭлементыГруппы(Элементы.ГруппаУровниГруппировок.ПодчиненныеЭлементы);
	
	Для Счетчик = 1 По ТабличныйДокумент.КоличествоУровнейГруппировокСтрок() Цикл
		Уровень = Строка(Счетчик);
		
		НоваяКоманда = Команды.Найти("КомандаУровень"+Уровень);
		Если НоваяКоманда = Неопределено Тогда
			НоваяКоманда = Команды.Добавить("КомандаУровень"+Уровень);
			НоваяКоманда.Действие  = "КомандаУровень";
			НоваяКоманда.Подсказка = "Открытие группировок до уровня " + Уровень;
		КонецЕсли;
		
		НовыйУровень = Элементы.Добавить("Уровень"+Уровень, Тип("КнопкаФормы"), Элементы.ГруппаУровниГруппировок);
		НовыйУровень.ИмяКоманды = НоваяКоманда.Имя;
		НовыйУровень.Заголовок  = "Уровень "+Уровень;
		НовыйУровень.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	КонецЦикла;
	
	УправлениеДиалогом();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформировать(Команда)
	
	СформироватьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПанельНастроек(Команда)
	
	Элементы.ФормаКнопкаПанель.Пометка = (НЕ Элементы.ФормаКнопкаПанель.Пометка);
	Элементы.ГруппаНастройки.Видимость = Элементы.ФормаКнопкаПанель.Пометка;
	
КонецПроцедуры

&НаКлиенте
// Обработчик нажатия кнопки "Печать"
Процедура КомандаПечать(Команда)
	
	ЭкземпляровНаСтранице = ПолучитьПраво("КоличествоСтраницНаЛисте");
	
	Если ЭкземпляровНаСтранице<>0 И ЭкземпляровНаСтранице<>1 И ЭкземпляровНаСтранице<>2 Тогда
		ЭкземпляровНаСтранице=0;
	КонецЕсли;
	
	ТабличныйДокумент.ВерхнийКолонтитул.ТекстСлева = "Отчет сформирован [&Дата]-[&Время], "+ПолучитьПользователя();
	ТабличныйДокумент.ВерхнийКолонтитул.Шрифт      = Новый Шрифт(ТабличныйДокумент.ВерхнийКолонтитул.Шрифт,,6);
	ТабличныйДокумент.ВерхнийКолонтитул.Выводить   = ПолучитьПраво("ПодписьПриПечатиОтчетов");
	ТабличныйДокумент.НижнийКолонтитул.ТекстСлева  = ЭтаФорма.Заголовок;
	ТабличныйДокумент.НижнийКолонтитул.ТекстСправа = "[&НомерСтраницы]";
	ТабличныйДокумент.НижнийКолонтитул.Выводить    = ПолучитьПраво("НумерацияСтраницОтчетов");
	ТабличныйДокумент.НижнийКолонтитул.Шрифт       = Новый Шрифт(ТабличныйДокумент.ВерхнийКолонтитул.Шрифт,,6);
	
	// печать табличного документа
	ТабличныйДокумент.ЭкземпляровНаСтранице      = ЭкземпляровНаСтранице;
	ТабличныйДокумент.Напечатать();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОформление(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаТипДиаграммы(Команда)
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// КОМАНДЫ ПОДМЕНЮ "ДЕЙСТВИЯ" ОСНОВНОЙ ПАНЕЛИ ФОРМЫ

&НаКлиенте
// Процедура сохраняет табличный документ в формате HTML под введенным пользователем именем файла
Процедура КомандаСохранитьКакHTML(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок      = "Сохранение веб-страницы";
	Диалог.Фильтр         = "Веб-страница (*.html)|*.html";
	Диалог.ПолноеИмяФайла = ПолучитьНаименованиеОтчета();
	
	Если Диалог.Выбрать() Тогда
		Если НЕ ПустаяСтрока(Диалог.ПолноеИмяФайла) Тогда
			ТабличныйДокумент.Записать(Диалог.ПолноеИмяФайла, ТипФайлаТабличногоДокумента.HTML);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКакPDF(ИмяФайла)
	
	ТабличныйДокумент.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.PDF);
	
КонецПроцедуры

&НаКлиенте
// Процедура сохраняет табличный документ 
Процедура СохранитьФайл(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок  = "Сохранение файла";
	Диалог.Расширение = "xlsx";
	Диалог.Фильтр = "Excel(*.xlsx)|*.xlsx|Табличный документ(*.mxl)|*.mxl|PDF(*.pdf)|*.pdf|WORD(*.docx)|*.docx|ODS(*.ods)|*.ods|Текстовый(*.txt)|*.txt|WEB(*.html)|*.html";
	Диалог.ПолноеИмяФайла = ПолучитьНаименованиеОтчета();
	ОО = Новый ОписаниеОповещения("СохранениеФайла",ЭтаФорма);
	Диалог.Показать(ОО);
КонецПроцедуры

&НаКлиенте
Процедура СохранениеФайла(Файлы) Экспорт
	Если Файлы=Неопределено Тогда возврат;КонецЕсли;
	ПолноеИмяФайла=Файлы[0];
	Поз=СтрНайти(ПолноеИмяФайла,".",НаправлениеПоиска.СКонца);
	Расширение=ВРег(Сред(ПолноеИмяФайла,Поз+1));
	ТипФайла=ТипФайлаТабличногоДокумента[Расширение];
	ТабличныйДокумент.Записать(ПолноеИмяФайла,ТипФайла);
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКаталогВременныхФайлов()
	
	#Если ВебКлиент Тогда
		Возврат "";
	#Иначе
		Возврат КаталогВременныхФайлов();
	#КонецЕсли
	
КонецФункции

&НаКлиенте
// Процедура открывает в Microsoft Excel табличный документ или сводную таблицу
Процедура КомандаОткрытьВExcel(Команда)
	
	Если ТабличныйДокумент.ВысотаТаблицы = 0 Тогда
		ПоказатьПредупреждение(,"Нужно сформировать отчет.");
		Возврат;
	КонецЕсли;
	
	ВывестиМакетMSExcel(ТабличныйДокумент);
	
КонецПроцедуры

&НаКлиенте
// Процедура открывает в Open Office Calc табличный документ или сводную таблицу
Процедура КомандаОткрытьВOpenOffice(Команда)
	
	ВывестиМакетOpenOffice(ТабличныйДокумент);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьХранилищеЗначений(Файл)
	
	Возврат Новый ХранилищеЗначения(Файл, Новый СжатиеДанных());
	
КонецФункции

&НаКлиенте
// Процедура управляет отображением уровня группировки табличного документа
Процедура КомандаУровень(Команда)
	
	НомерГруппировки = Число(СтрЗаменить(Команда.Имя, "КомандаУровень", ""));
	ТабличныйДокумент.ПоказатьУровеньГруппировокСтрок(НомерГруппировки - 1);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаСобытийРеквизитов

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ФОРМЫ ОТЧЕТА

&НаКлиенте
Процедура КомандаПараметрПриИзменении(Команда)
	
	Если ТипЗнч(Команда) = Тип("Строка") Тогда
		ИмяКоманды = Команда;
	Иначе
		ИмяКоманды = Команда.Имя;
	КонецЕсли;
	
	ЗначениеПараметра = ЭтаФорма[ИмяКоманды];
	ИмяПараметра = СтрЗаменить(ИмяКоманды, "Параметр", "");
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ИмяПараметра, ЗначениеПараметра);
	Если Элементы.ТабличныйДокумент.ОтображениеСостояния.Видимость = Ложь Тогда
		УправлениеДиалогом(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИзменитьВидСравнения(Команда)
	
	ИмяОтбора    = СтрЗаменить(Команда.Имя, Команда.Действие, "");
	КнопкаФормы  = Элементы["ОтборВидСравнения"+ИмяОтбора];
	СтрокаОтбора = СтруктураОтборов[ИмяОтбора];
	ПолеПоиска   = КомпоновщикНайтиОтбор(СтрокаОтбора.ЛевоеЗначение, КомпоновщикНастроек.Настройки.Отбор);
	
	ОписаниеОтбора    = КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.НайтиПоле(ПолеПоиска.ЛевоеЗначение);
	ТекПозиция        = ОписаниеОтбора.ДоступныеВидыСравнения.НайтиПоЗначению(ПолеПоиска.ВидСравнения);
	НовыйВидСравнения = ВыбратьИзСписка(ОписаниеОтбора.ДоступныеВидыСравнения, Команда, ТекПозиция);
	
	Если НЕ НовыйВидСравнения = Неопределено Тогда
		ПолеПоиска.ВидСравнения = НовыйВидСравнения.Значение;
		КнопкаФормы.Заголовок   = Строка(НовыйВидСравнения.Значение);
		
		Если ОтборПоСписку(ПолеПоиска.ВидСравнения) Тогда
			
			СписокВыбора = Неопределено;
			Если ТипЗнч(ПолеПоиска.ПравоеЗначение) = Тип("СписокЗначений") Тогда
				СписокВыбора = ПолеПоиска.ПравоеЗначение;
			Иначе
				СписокВыбора = Новый СписокЗначений;
				Если ЗначениеЗаполнено(ПолеПоиска.ПравоеЗначение) Тогда
					СписокВыбора.Добавить(ПолеПоиска.ПравоеЗначение);
				КонецЕсли;
			КонецЕсли;
			Элементы["ОтборЗначение" + ИмяОтбора].ОграничениеТипа = Новый ОписаниеТипов("СписокЗначений");
			ПолеПоиска.ПравоеЗначение                             = СписокВыбора;
			ЭтаФорма["ОтборЗначение" + ИмяОтбора]                 = СписокВыбора;
		ИначеЕсли ПолеПоиска.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено ИЛИ 
				ПолеПоиска.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
			ЭтаФорма["ОтборЗначение" + ИмяОтбора]                 = Неопределено;
		Иначе
			ЗначениеПоля = Неопределено;
			Если ТипЗнч(ПолеПоиска.ПравоеЗначение) = Тип("СписокЗначений") Тогда
				Если ПолеПоиска.ПравоеЗначение.Количество()>0 Тогда
					ЗначениеПоля = ПолеПоиска.ПравоеЗначение[0].Значение;
				КонецЕсли;
			Иначе
				ЗначениеПоля = ПолеПоиска.ПравоеЗначение;
			КонецЕсли;
			
			Элементы["ОтборЗначение" + ИмяОтбора].ОграничениеТипа = ОписаниеОтбора.ТипЗначения;
			ПолеПоиска.ПравоеЗначение                             = ЗначениеПоля;
			ЭтаФорма["ОтборЗначение" + ИмяОтбора]                 = ЗначениеПоля;
		КонецЕсли;
	КонецЕсли;
	Если Элементы.ТабличныйДокумент.ОтображениеСостояния.Видимость = Ложь Тогда
		УправлениеДиалогом(Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтборПриИзмененииИспользования(Команда)
	
	ДоступностьОтбора = ЭтаФорма[Команда.Имя];
	
	ИмяОтбора    = СтрЗаменить(Команда.Имя, "ОтборИспользование", "");
	СтрокаОтбора = СтруктураОтборов[ИмяОтбора];
	ПолеПоиска   = КомпоновщикНайтиОтбор(СтрокаОтбора.ЛевоеЗначение, КомпоновщикНастроек.Настройки.Отбор);
	ПолеПоиска.Использование = ДоступностьОтбора;
	Если Элементы.ТабличныйДокумент.ОтображениеСостояния.Видимость = Ложь Тогда
		УправлениеДиалогом(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтборЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИмяОтбора    = СтрЗаменить(Элемент.Имя, "ОтборЗначение", "");
	СтрокаОтбора = СтруктураОтборов[ИмяОтбора];
	ПолеПоиска   = КомпоновщикНайтиОтбор(СтрокаОтбора.ЛевоеЗначение, КомпоновщикНастроек.Настройки.Отбор);
	
	Если ПолеПоиска.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено ИЛИ 
		ПолеПоиска.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
		СтандартнаяОбработка = Истина;
	КонецЕсли;
	
	Если ОтборПоСписку(ПолеПоиска.ВидСравнения) Тогда
		
		СтандартнаяОбработка = Ложь;
		ОписаниеОтбора       = КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.НайтиПоле(ПолеПоиска.ЛевоеЗначение);
		
		Если ПолеПоиска.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии ИЛИ
			 ПолеПоиска.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
			ТолькоГруппы = Истина;
		Иначе
			ТолькоГруппы = Ложь;
		КонецЕсли;
		
		СтруктураПараметров = Новый Структура("СписокВыбора, ТипЗначения, ДоступныеЗначения, ТолькоГруппы", ПолеПоиска.ПравоеЗначение, ОписаниеОтбора.ТипЗначения, ОписаниеОтбора.ДоступныеЗначения, ТолькоГруппы);
		
		ФормаВыбора = ПолучитьФорму("ОбщаяФорма.ОтчетВыборЗначенияОтбораИзСписка", СтруктураПараметров, Элемент);
		Рез = ФормаВыбора.ОткрытьМодально();
		
		Если НЕ Рез = Неопределено Тогда
			ПолеПоиска.ПравоеЗначение = Рез;
			ЭтаФорма[Элемент.Имя]     = Рез;
			Если Элементы.ТабличныйДокумент.ОтображениеСостояния.Видимость = Ложь Тогда
				УправлениеДиалогом(Истина);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ПолеПоиска.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии ИЛИ 
				ПолеПоиска.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
		Элемент.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
	Иначе
		Элемент.ВыборГруппИЭлементов = ГруппыИЭлементы.ГруппыИЭлементы;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтборЗначениеПриИзменении(Команда)
	
	ЗначениеОтбора = ЭтаФорма[Команда.Имя];
	ИмяОтбора    = СтрЗаменить(Команда.Имя, "ОтборЗначение", "");
	СтрокаОтбора = СтруктураОтборов[ИмяОтбора];
	ПолеПоиска   = КомпоновщикНайтиОтбор(СтрокаОтбора.ЛевоеЗначение, КомпоновщикНастроек.Настройки.Отбор);
	ПолеПоиска.ПравоеЗначение = ЗначениеОтбора;
	
	Если ЗначениеЗаполнено(ЗначениеОтбора) Тогда
		ЭтаФорма["ОтборИспользование"+ИмяОтбора] = Истина;
		ПолеПоиска.Использование = Истина;
	КонецЕсли;
	Если Элементы.ТабличныйДокумент.ОтображениеСостояния.Видимость = Ложь Тогда
		УправлениеДиалогом(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписокПолей(Поля)
	
	СписокПолей = Новый Массив;
	Для Каждого ТекПоле Из Поля Цикл
		
		НоваяСтрока = Новый Структура("Использование, Поле, Заголовок, ТипГруппировки");
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекПоле);
		СписокПолей.Добавить(НоваяСтрока);
	КонецЦикла;
	
	Возврат СписокПолей;
	
КонецФункции

&НаКлиенте
Процедура НастройкиКомпоновщикаНажатие(Элемент, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ИзментьГруппировки(Элемент, ИмяТаблицы)
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИзментьГруппировки(Элемент, "Строки");
	
КонецПроцедуры

&НаКлиенте
Процедура КолонкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИзментьГруппировки(Элемент, "Колонки");
	
КонецПроцедуры

#КонецОбласти

#Область ОтчетыКлиентСервер

&НаКлиентеНаСервереБезКонтекста
// Формирует краткое представление ошибки.
//
// Параметры:
//   ИнформацияОбОшибке - ИнформацияОбОшибке - Информация об ошибке.
//
// Возвращаемое значение:
//   Строка - Краткое представление ошибки.
//
Функция КраткоеПредставлениеОшибкиФормированияОтчета(ИнформацияОбОшибке)
	
	ОписаниеОшибки = ИнформацияОбОшибке.Описание;
	ПричинаОшибки = ИнформацияОбОшибке.Причина;
	Пока ПричинаОшибки <> Неопределено Цикл
		ОписаниеОшибки = ПричинаОшибки.Описание;
		ПричинаОшибки = ПричинаОшибки.Причина;
	КонецЦикла;
	
	Возврат ОписаниеОшибки;
	
КонецФункции

#Конецобласти

#Область ОтчетыСервер

&НаСервере
Функция ОтборПоСписку(ВидСравненияОтбора)
	
	ТекРезультат = Ложь;
	Если ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВСписке ИЛИ 
		ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии ИЛИ
		ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.НеВСписке ИЛИ 
		ВидСравненияОтбора= ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
		ТекРезультат = Истина;
	КонецЕсли;
	
	Возврат ТекРезультат;
	
КонецФункции

&НаСервере
Функция ПроверитьКорректность(ОтчетОбъект, КомпоновщикНастроек)
	
	Результат = Истина;
	
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция КомпоновщикПолучитьЗначениеПараметра(Знач ПараметрКомпоновки, Настройки)
	
	Результат = Неопределено;
	
	Если НЕ ТипЗнч(ПараметрКомпоновки) = Тип("ПараметрКомпоновкиДанных") Тогда
		ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных(СокрЛП(ПараметрКомпоновки));
	КонецЕсли;
	
	ЗначениеПараметра = Настройки.ПараметрыДанных.Элементы.Найти(ПараметрКомпоновки);
	
	Если ЗначениеПараметра = Неопределено Тогда
		Возврат Результат;
	ИначеЕсли ТипЗнч(ЗначениеПараметра.Значение) = Тип("СтандартныйПериод") Тогда
		Результат = Новый Структура;
		Результат.Вставить("ДатаНачала",    ЗначениеПараметра.Значение.ДатаНачала);
		Результат.Вставить("ДатаОкончания", ЗначениеПараметра.Значение.ДатаОкончания);
	ИначеЕсли ТипЗнч(ЗначениеПараметра.Значение) = Тип("СтандартнаяДатаНачала") Тогда
		Результат = ЗначениеПараметра.Значение.Дата;
	ИначеЕсли ТипЗнч(ЗначениеПараметра.Значение) = Тип("СписокЗначений") И ЗначениеПараметра.Значение.Количество()=1 Тогда
		Результат = ЗначениеПараметра.Значение[0].Значение;
	ИначеЕсли ТипЗнч(ЗначениеПараметра.Значение) = Тип("Граница") Тогда
		Результат = ЗначениеПараметра.Значение.Значение;
	Иначе
		Результат = ЗначениеПараметра.Значение;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция КомпоновщикПолучитьПолеКомпоновки(ПолеКомопоновки)
	
	Результат = Неопределено;
	Если ТипЗнч(ПолеКомопоновки) = Тип("Строка") Тогда
		Результат = Новый ПолеКомпоновкиДанных(ПолеКомопоновки);
	ИначеЕсли ТипЗнч(ПолеКомопоновки) = Тип("ПолеКомпоновкиДанных") Тогда
		Результат = ПолеКомопоновки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция КомпоновщикНайтиОтбор(Знач ПолеПоиска, Отборы, ВИерархии = Ложь, ПоискВГруппе = Ложь)
	
	Если НЕ ПоискВГруппе Тогда
		ПолеПоиска = КомпоновщикПолучитьПолеКомпоновки(ПолеПоиска);
	КонецЕсли;
	
	РезультатПоиска = Неопределено;
	Для Каждого ТекОтбор Из Отборы.Элементы Цикл
		
		Если ТипЗнч(ТекОтбор) = Тип("ЭлементОтбораКомпоновкиДанных") И ТекОтбор.ЛевоеЗначение = ПолеПоиска Тогда
			РезультатПоиска = ТекОтбор;
		ИначеЕсли ВИерархии И ТипЗнч(ТекОтбор) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			РезультатПоиска = КомпоновщикНайтиОтбор(ПолеПоиска, ТекОтбор, Истина, Истина);
		КонецЕсли;
		
		Если НЕ РезультатПоиска = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РезультатПоиска;
	
КонецФункции


#КонецОбласти

// Открывает структуру с макетом печатной формы
//
// Параметры:
// ДвоичныеДанныеМакета - ДвоичныеДанные - двоичные данные макета
// ИмяВременногоФайла - Строка - имя файла для записи макета
// Возвращаемое значение:
// Результат - признак успешного выполнения операции
//
&НаКлиенте
Функция ВывестиМакетMSExcel(знач ДвоичныеДанныеШаблона, ИмяВременногоФайла=Неопределено)
	
	Попытка
		Если ДвоичныеДанныеШаблона.ВысотаТаблицы = 0 Тогда
			Сообщить("ОШИБКА! Пустой табличный документ!");
			Возврат Ложь;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
	Исключение
		Сообщить("ОШИБКА! Приложение MS Excel отсутствует или недостаточно прав доступа!
		|	- " + ОписаниеОшибки(), СтатусСообщения.ОченьВажное);
		Возврат Ложь;
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ИмяВременногоФайла) Тогда
		ВременныйФайлXLS = ИмяВременногоФайла;
	Иначе
		#Если ВебКлиент Тогда
			Excel = "";
			Возврат Ложь;
		#Иначе
			ВременныйФайл = ПолучитьИмяВременногоФайла();
			ВременныйФайлXLS = ВременныйФайл + ".xls";
		#КонецЕсли
	КонецЕсли;
	
	// Откроем табличный документ
	ДвоичныеДанныеШаблона.Записать(ВременныйФайлXLS, ТипФайлаТабличногоДокумента.XLS);
	Excel.Workbooks.Open(ВременныйФайлXLS);
	tmpBook = Excel.Workbooks.Item(Excel.Workbooks.Count); 
	
	КнигаExcel = Excel.Workbooks.Add(); 
	КнигаExcel.Colors = tmpBook.Colors;
	
	tmpBook.Sheets(1).Copy(КнигаExcel.WorkSheets(1));
	ЛистExcel = КнигаExcel.WorkSheets.Item(1);
	tmpBook.Close();
	КнигаExcel.Activate();
	ЛистExcel.Activate(); 
	Excel.Visible = 1;
	Excel = "";
	
	Возврат Истина;
	
КонецФункции

// Открывает структуру с макетом печатной формы
//
// Параметры:
// ДвоичныеДанныеМакета - ДвоичныеДанные - двоичные данные макета
// ИмяВременногоФайла - Строка - имя файла для записи макета
// Возвращаемое значение:
// Результат - признак успешного выполнения операции
//
&НаКлиенте
Функция ВывестиМакетOpenOffice(знач ДвоичныеДанныеШаблона, ИмяВременногоФайла=Неопределено)
	
	// Пытаемся создать COM объект
	Попытка
		ServiceManager = Новый COMОбъект("com.sun.star.ServiceManager");
		Desktop = ServiceManager.createInstance("com.sun.star.frame.Desktop");
		Params = ServiceManager.Bridge_GetStruct("com.sun.star.beans.PropertyValue");
	Исключение
		Сообщить("ОШИБКА! Приложение Open Office (версии не ниже 2.0) отсутствует или недостаточно прав доступа!
		|	- " + ОписаниеОшибки(), СтатусСообщения.ОченьВажное);
		Возврат Ложь;
	КонецПопытки;	
	
	Если ЗначениеЗаполнено(ИмяВременногоФайла) Тогда
		ВременныйФайлXLS = ИмяВременногоФайла;	
	Иначе
		#Если ВебКлиент Тогда
			Excel = "";
			Возврат Ложь;
		#Иначе
			ВременныйФайл = ПолучитьИмяВременногоФайла();
			ВременныйФайлXLS = ВременныйФайл + ".xls";
		#КонецЕсли
	КонецЕсли;
	
	ДвоичныеДанныеШаблона.Записать(ВременныйФайлXLS, ТипФайлаТабличногоДокумента.XLS);
	Params.Name = "Hidden";
	Params.Value = Ложь;
	Args = Новый COMSafeArray("VT_DISPATCH", 1);
	Args.SetValue(0,Params);
	
	ВременныйФайлXLS_какУРЛ = "file:///" + СтрЗаменить(ВременныйФайлXLS, "\", "/"); // приводим путь к файлу к формату OpenOffice
	Document = Desktop.LoadComponentFromURL(ВременныйФайлXLS_какУРЛ, "_blank", 0, Args);
	
	#Если ВебКлиент Тогда
		Document.getCurrentController().getFrame().getContainerWindow().setVisible(Ложь);
	#КонецЕсли
	
	Document = Неопределено;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура СменитьПользователя(Команда)
	ОО=Новый ОписаниеОповещения("ЗапроситьДанныеПользователя",ЭтаФорма);
	ПоказатьВводЧисла(ОО,КодПользователя,"Введите код пользователя");
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьДанныеПользователя(Код,Доп) Экспорт
	Если Код=Неопределено Тогда Возврат;конецЕсли;
	КодПользователя=Код;
	СформироватьЗапрос();
	Если Элементы.ТабличныйДокумент.ОтображениеСостояния.Видимость = Ложь Тогда
		УправлениеДиалогом(Истина);
	КонецЕсли;
КонецПроцедуры
	
&НаКлиенте
Процедура СформироватьЗапрос()
	Условие="idUser="+Формат(КодПользователя,"ЧГ=");
	Если Период.ДатаНачала>='20200101' Тогда 
		Условие=Условие+" AND date>='"+Формат(Период.ДатаНачала,"ДФ=""гггг-ММ-дд ЧЧ:мм:сс""")+"'";
	КонецЕсли;
	Если Период.ДатаОкончания<>'00010101' Тогда 
		Условие=Условие+" AND date<='"+Формат(Период.ДатаОкончания,"ДФ=""гггг-ММ-дд ЧЧ:мм:сс""")+"'";
	КонецЕсли;
	Запрос=Новый Структура("action, table, select, where, order ", "load", "analytics.primary", 
	"date as Дата, article as Артикул, manufacturer as Производитель, articleName as Номенклатура, 
	|supplierName as Поставщик, supplierStore as СкладПоставщика, deliveryDay as СрокПоставки, 
	|count as Количество, count*priceIn as СуммаПоставки, count*priceOut as СуммаПродажи,count*(priceOut-priceIn) as Прибыль,
	|company as Организация, userName as Менеджер, stockAvailability as Наличие",
	Условие, "manufacturer, article");
	ВладелецФормы.СендерОтправить(Запрос);
	Элементы.Сформировать.Доступность=Ложь;
	Элементы.Сформировать.ЦветФона=Новый Цвет(200,200,200);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьТаблицу(Данные) Экспорт
	Перем Производитель,Артикул;
	Товар=Новый Структура("Номенклатура,Группа","","");
	ТаблицаДанных.Очистить();
	Для Каждого Стр Из Данные Цикл
		Нов=ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(Нов,Стр);
		Если Артикул<>Стр.Артикул или Производитель<>Стр.Производитель Тогда
			Артикул=Стр.Артикул; Производитель=Стр.Производитель;
			Товар.Номенклатура=Артикул+" "+Стр.Номенклатура+" *"+Производитель;
			//ЗаполнитьТовар(Артикул, Производитель,Товар);
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Нов,Товар);
	КонецЦикла;
	Элементы.Сформировать.Доступность=Истина;
	Элементы.Сформировать.ЦветФона=Новый Цвет(255,255,0);
	//СкомпоноватьРезультат(ТабличныйДокумент);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТовар(Артикул, Производитель,Товар)
	Запрос=Новый Запрос(имяРеквизита.Запрос);
	Запрос.УстановитьПараметр("Артикул",Артикул);
	Запрос.УстановитьПараметр("Производитель",Производитель);
	Выб=Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		Товар.Номенклатура=Выб.Номенклатура;
		Товар.Группа=?(имяРеквизита.Свойство("Родитель"),Товар.Номенклатура.Родитель,Справочники.Номенклатура.ПустаяСсылка());
	Иначе
		Товар.Группа=Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ЭтаФорма.Заголовок=ПолучитьНаименованиеОтчета();
	СформироватьЗапрос();
	Если Элементы.ТабличныйДокумент.ОтображениеСостояния.Видимость = Ложь Тогда
		УправлениеДиалогом(Истина);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура КомпоновщикНастроекНастройкиПриИзменении(Элемент)
	Если Элементы.ТабличныйДокумент.ОтображениеСостояния.Видимость = Ложь Тогда
		УправлениеДиалогом(Истина);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура КомпоновщикНастроекНастройкиПослеУдаления(Элемент)
	Если Элементы.ТабличныйДокумент.ОтображениеСостояния.Видимость = Ложь Тогда
		УправлениеДиалогом(Истина);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии()
	ВладелецФормы.ФормыПАУдалить("ОтчетУФ");
КонецПроцедуры
	
