 
Функция ПолучитьФайлИзХранилища (ИмяФайла) Экспорт
	Попытка
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла) ;
		Хранилище = Новый ХранилищеЗначения (ДвоичныеДанные); 
		Возврат  Хранилище;
	Исключение
		Возврат ""; 
	КонецПопытки;	
	//ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла) ;
	//Хранилище = Новый ХранилищеЗначения (ДвоичныеДанные); 
	//Возврат  ДвоичныеДанные.Получить();
	
КонецФункции 
 
Функция УбратьЗапрещенныеСимволыВИменифайла (Имя) Экспорт 
	  Имя = СтрЗаменить(Имя,"*",""); 
	  Имя = СтрЗаменить(Имя,"|",""); 
	  Имя = СтрЗаменить(Имя,"\",""); 
	  Имя = СтрЗаменить(Имя,":",""); 
	  Имя = СтрЗаменить(Имя,"""",""); 
	  Имя = СтрЗаменить(Имя,"<",""); 
	  Имя = СтрЗаменить(Имя,">",""); 
	  Имя = СтрЗаменить(Имя,"?",""); 
	  Имя = СтрЗаменить(Имя,"/",""); 
	  Имя = СтрЗаменить(Имя,".",""); 
	  
	  Возврат Имя;
  КонецФункции	
  
Процедура УдалитьФайлИзХранилища(АдресВременногоХранилища) Экспорт
	Попытка  
		УдалитьФайлы(АдресВременногоХранилища);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;	
КонецПроцедуры

Процедура ВыполнитьКомандуНаСервере(ИмяКоманды,ОписаниеОшибки) Экспорт
	Попытка
		ЗапуститьПриложение(ИмяКоманды,,Истина);
	Исключение	
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;	
КонецПроцедуры
 
Функция ПолучитьРасширениеФайла(ИмяФайла) Экспорт

	ПозицияПоследнейТочки = 0;
	РасширениеФайла = ИмяФайла;

	Пока 1 = 1 Цикл
	
		ПозицияПоследнейТочки = Найти(РасширениеФайла, ".");

		Если ПозицияПоследнейТочки = 0 Тогда

			Прервать;

		Иначе

			РасширениеФайла = Сред(РасширениеФайла, ПозицияПоследнейТочки + 1)

		КонецЕсли;

	КонецЦикла;

	Возврат ?(РасширениеФайла = ИмяФайла, "", РасширениеФайла);

КонецФункции 

Функция ПолучитьОбрезанноеФото (Путь)  Экспорт 
	 Расшир = ПолучитьРасширениеФайла(Путь);
	 ИмяБезРасшир = СтрЗаменить(Путь,Расшир,"");
 	 Возврат ИмяБезРасшир + "_thumb"+Расшир;
 КонецФункции	

 //Бондаренко++ 20220322
Функция СМГ_ПолучитьДвоичныеДанныеИзФайла(ПутьКФайлу) Экспорт
    ДвДанные = Новый ДвоичныеДанные(ПутьКФайлу);
	Возврат ДвДанные;
КонецФункции // СМГ_ПолучитьДвоичныеДанныеФайла(ПутьКФайлу)
//Бондаренко++ 20220322 

//Бондаренко++ 20220323
 Функция СкопироватьНаСервер(Категория,МояКартинка,Расширение,ОписаниеОшибки) Экспорт 
	
	ДвоичныеДанные = МояКартинка.Получить();
 	
	ТекНомер = Строка(Новый УникальныйИдентификатор());
	
	Хранилище = Константы.ПустьКХранилищюСканов.Получить();
 	ГодМесяц = Формат(ТекущаяДата(),"ДФ=yyyy-MM");
 	ПолныйПуть = Хранилище+"\"+ОбщиеСервер.ПолучитьИмяИБ()+"\"+Категория+"\"+ГодМесяц;
	
	КаталогНаДиске = Новый Файл(ПолныйПуть);
	
	Если  НЕ КаталогНаДиске.Существует() Тогда
		СоздатьКаталог(КаталогНаДиске.ПолноеИмя);
	КонецЕсли;	
	
	ИмяфайлаДляКопирования=Константы.ПрефиксБазы.Получить()+ТекНомер+Расширение;
	ПолноеИмяФайла = КаталогНаДиске.ПолноеИмя+"\"+ИмяфайлаДляКопирования;
	
	Если ПустаяСтрока(ПолноеИмяФайла) Тогда Возврат Неопределено; КонецЕсли;
	Попытка
		ДвоичныеДанные.Записать(ПолноеИмяФайла);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Возврат Неопределено;
	КонецПопытки;
	
	//Если Найти(",.BMP,.DIB,.RLE,.JPG,.JPEG,.TIF,.GIF,.PNG,.ICO,.WMF,.EMF,", "," + Врег(Расширение) + ",") > 0 Тогда
	//	
	//	ПолныйПутьКпрограмме = "C:\Program Files\ImageMagick\convert.exe";		
	//	ИмяФайлаПрограммыНаДиске = Новый Файл(ПолныйПутьКпрограмме);
	//	
	//	Если   ИмяФайлаПрограммыНаДиске.Существует() Тогда
	//		
	//		ИмяФайлаМиниатюры = КаталогНаДиске.ПолноеИмя+"\"+Константы.ПрефиксБазы.Получить()+ТекНомер+"_thumb"+Расширение;
	//		
	//		ИмяФайлаUTF = КаталогВременныхФайлов()+"tmpfile"+СокрЛП(СтрЗаменить(ТекущаяУниверсальнаяДатаВМиллисекундах(),Символы.НПП,""))+".jpg"; 
	//		КопироватьФайл(ПолноеИмяФайла,ИмяФайлаUTF);
	//		
	//		ИмяКоманды = """C:\Program Files\ImageMagick\convert.exe"""+" """+ИмяФайлаUTF+""" -thumbnail 250x200 "+ИмяФайлаМиниатюры;
	//		
	//		Попытка
	//			ОбщиеСервер.ВыполнитьКомандуНаСервере(ИмяКоманды,ОписаниеОшибки);
	//			УдалитьФайлы(ИмяФайлаUTF);
	//		Исключение
	//			ОписаниеОшибки = ОписаниеОшибки();
	//		КонецПопытки;	
	//		
	//	Иначе			
	//		ОписаниеОшибки = "ОШИБКА! Файл '"+ПолныйПутьКпрограмме+"' не существует.";			
	//	КонецЕсли; 
	//	
	//КонецЕсли; 

	Если Найти(",.BMP,.DIB,.RLE,.JPG,.JPEG,.TIF,.GIF,.PNG,.ICO,.WMF,.EMF,", "," + Врег(Расширение) + ",") > 0 Тогда
  	 	ИмяФайлаМиниатюры = КаталогНаДиске.ПолноеИмя+"\"+Константы.ПрефиксБазы.Получить()+ТекНомер+"_thumb"+Расширение;
		Разрешение = "250x200";                                                  
   		ОписаниеОшибки = СМГ_СжатьИзображение(ПолноеИмяФайла,Разрешение,ИмяФайлаМиниатюры);			
 	КонецЕсли; 
 	
	Возврат   ПолноеИмяФайла;
	
КонецФункции //СкопироватьНаСервер()	
 
Функция СМГ_СжатьИзображение(ИмяИсходногоФайла,Разрешение,ИмяРезультирующегоФайла) Экспорт
	
	ОписаниеОшибки = "";
  	
 	ИмяКоманды = """C:\Program Files\ImageMagick\magick.exe"""+" """+ИмяИсходногоФайла+""" -resize "+Разрешение+" "+ИмяРезультирующегоФайла;
	
	Попытка
		ОбщиеСервер.ВыполнитьКомандуНаСервере(ИмяКоманды,ОписаниеОшибки);
 	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Ошибка конвертора", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки);
 	КонецПопытки;	
	
	Возврат ОписаниеОшибки;		
 
КонецФункции // СжатьИзображение()
 //Бондаренко-- 20220323
 
 //Бондаренко++ 20220324
Функция СохранитьФотоАвтомобиля(ДвоичныеДанныеФайла,Вин,Гуид) Экспорт 
	
	ОписаниеОшибки = "";
	
	ДвоичныеДанные = ДвоичныеДанныеФайла.Получить(); 
 	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	
	Если ПустаяСтрока(ИмяВременногоФайла) Тогда Возврат Неопределено; КонецЕсли;
	
	Попытка
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Возврат Неопределено;
	КонецПопытки;
	
 	КаталогНаДиске = Новый Файл(Константы.ПустьКХранилищюСканов.Получить()+"\"+ОбщиеСервер.ПолучитьИмяИБ()+"\carphoto\"+Вин);
	
	Если  НЕ КаталогНаДиске.Существует() Тогда
		СоздатьКаталог(КаталогНаДиске.ПолноеИмя);
	КонецЕсли;	
	
 	ИмяФайлаАвто = КаталогНаДиске.ПолноеИмя+"\"+Гуид+".jpg"; 
	
	Если ПустаяСтрока(ИмяФайлаАвто) Тогда Возврат Неопределено; КонецЕсли;
	
    ОписаниеОшибки = СМГ_СжатьИзображение(ИмяВременногоФайла,"1920x1920",ИмяФайлаАвто);			
	
 	Попытка	УдалитьФайлы(ИмяВременногоФайла); Исключение КонецПопытки;          
 	
	Возврат ИмяФайлаАвто;
	
КонецФункции //СкопироватьНаСервер()	
//Бондаренко-- 20220324 

//Бондаренко++ 20220325 
Функция УдалитьФотоАвтомобиля(Вин,Гуид) Экспорт

	ПолноеИмяУдаляемогоФайла = СокрЛП(Константы.ПустьКХранилищюСканов.Получить())+"\"+СокрЛП(ОбщиеСервер.ПолучитьИмяИБ())+"\carphoto\"+СокрЛП(Вин)+"\"+СокрЛП(Гуид)+".jpg";
	УдаляемыйФайл = Новый Файл(ПолноеИмяУдаляемогоФайла);
	
	ОписаниеОшибки = "";
	
	Если УдаляемыйФайл.Существует() Тогда
  		Попытка
 			УдалитьФайлы(УдаляемыйФайл.Путь,УдаляемыйФайл.Имя);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;
	КонецЕсли;
	
	Возврат ОписаниеОшибки;

КонецФункции // УдалитьФотоАвтомобиля(Вин,Гуид)

Функция ПолучитьФотоАвтомобиля(Вин,Гуид) Экспорт

	ПолноеИмяФайла = СокрЛП(Константы.ПустьКХранилищюСканов.Получить())+"\"+СокрЛП(ОбщиеСервер.ПолучитьИмяИБ())+"\carphoto\"+СокрЛП(Вин)+"\"+СокрЛП(Гуид)+".jpg";
	ПолучаемыйФайл = Новый Файл(ПолноеИмяФайла);
	
	ОписаниеОшибки = "";
	
	Если ПолучаемыйФайл.Существует() Тогда
  		Возврат СМГ_ПолучитьДвоичныеДанныеИзФайла(ПолучаемыйФайл.ПолноеИмя);
 	КонецЕсли;
	
	Возврат "";

КонецФункции // ПолучитьФотоАвтомобиля(Вин,Гуид)
//Бондаренко-- 20220325 

//Бондаренко++ 20220328
Функция УдалениеФотоАвтоПоРеквизитуURLудалить(URLудалить) Экспорт
	
	ИмяБазыДанных = СокрЛП(ОбщиеСервер.ПолучитьИмяИБ());
	
	Если ИмяБазыДанных <> "ALFAAUTO" Тогда
		ИмяБазыДанных = "ALFAAUTO";	
 	КонецЕсли;
	
	ПолнИмяУдаляемогоФайла = СокрЛП(Константы.ПустьКХранилищюСканов.Получить())+"\"+ИмяБазыДанных+"\"+СокрЛП(URLудалить);
	УдФайл = Новый Файл(ПолнИмяУдаляемогоФайла);
 	
	ОписаниеОшибки = "";
	
	Если УдФайл.Существует() Тогда 
		УдФайлПуть = СокрЛП(УдФайл.Путь);
		УдФайлИмя = СокрЛП(УдФайл.Имя);	
		Если НЕ обЗначениеНеЗаполнено(УдФайлИмя) Тогда
			Если НЕ обЗначениеНеЗаполнено(УдФайлПуть) Тогда		
				Попытка
					УдалитьФайлы(УдФайл.Путь,УдФайл.Имя);
				Исключение
					ОписаниеОшибки = ОписаниеОшибки();
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОписаниеОшибки;

КонецФункции // УдалениеФотоАвтоПоРеквизитуURLудалить(URLудалить)
//Бондаренко-- 20220328 

