Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Записи = РегистрыСведений.Renault_АвтосервисПланРабот.СоздатьНаборЗаписей();
	Записи.Отбор.РабочийДокумент.Установить(ЭтотОбъект.Ссылка);
	
	Записи.Прочитать();
	Для Каждого Запись Из Записи Цикл
		Записи.Удалить(Запись);
	КонецЦикла;
	
	Записи.Записать();
	
	Записи = Неопределено;
	Записи = РегистрыСведений.Renault_АвтосервисСтатусыРабот.СоздатьНаборЗаписей();
	Записи.Отбор.РабочийДокумент.Установить(ЭтотОбъект.Ссылка);
	
	Записи.Прочитать();
	Для Каждого Запись Из Записи Цикл
		Записи.Удалить(Запись);
	КонецЦикла;
	
	Записи.Записать();
	
	Запись = РегистрыСведений.CRM_СтатусыЗанятостиСотрудников.СоздатьМенеджерЗаписи();
	Запись.Сотрудник = Сотрудник;
	Запись.Период = ВремяНачала;
	Запись.ПримерноеВремяОкончания = ВремяОкончания;
	Запись.Прочитать();
	Запись.Удалить();
	
КонецПроцедуры

Процедура ЗаписатьВРегистр(Исполнитель, План, Факт, Авторабота, Цех, IDЭтапа)
	
	Запись = РегистрыСведений.Renault_АвтосервисФактПоИсполнителям.СоздатьМенеджерЗаписи();
					
			Норма = 0;
			IDРаботы = 0;
	
	Запись.Исполнитель = Исполнитель;
	Запись.Период = ТекущаяДата();
	Запись.План = План;
	Запись.Факт = Факт;
	Запись.Цех = Цех;
	Запись.IDЭтапа = IDЭтапа;
	Запись.РабочийДокумент = ЭтотОбъект.Ссылка;
	Запись.Работа = Авторабота;
	Запись.Норма = Норма;
	Запись.IDРаботы = IDРаботы;
	Запись.НепродуктивноеВремя = Истина;
								
	Запись.Записать(ИСТИНА);
	
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Факт = ЭтотОбъект.ВремяОкончания - ЭтотОбъект.ВремяНачала;
	
	//Временно
	Возврат;
	
	Если ЭтотОбъект.НепродуктивноеВремя Тогда
		
		 ЗаписатьВРегистр(Сотрудник, 0, Факт, Справочники.Автоработы.ПустаяСсылка(), Цех, 1);
		
	КонецЕсли;

КонецПроцедуры

