// Воробьев Д.А. 04.10.2016 11:01:43 +++
Перем мПробег Экспорт;

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Если Не Renault_РаботаСПравамиПользователя.ЕстьПравоОткрытияОтчетапродаж(ПараметрыСеанса.Пользователь,"Renault_ОтчетПоКлиентамЗаписанныхНаТекущуюДату") тогда
		Сообщить("Недостаточно прав доступа.");
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	СтандартнаяОбработка = Ложь;
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	Для каждого ЭлОтбора Из НастройкиОтчета.Отбор.Элементы Цикл
		Если ЭлОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Пробег") Тогда
			ЭлОтбора.Использование = Истина;
			ЭлОтбора.ПравоеЗначение = мПробег.Значение;
			Если мПробег.ВидСравнения = "Больше" Тогда
				ЭлОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;	
			ИначеЕсли мПробег.ВидСравнения = "Меньше" Тогда
				ЭлОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;	
			КонецЕсли;
		КонецЕсли; 	
	КонецЦикла;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
		
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,, ДанныеРасшифровки, Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры

Процедура мСоздатьЗадачу(Клиент, ДокументОснование, Автомобиль) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Проверяем, возможно уже другой пользователь взял в работу клиента
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	ПРЕДСТАВЛЕНИЕ(Renault_Задачи.Автор)
	               |ИЗ
	               |	Документ.Renault_Задачи КАК Renault_Задачи
	               |ГДЕ
	               |	Renault_Задачи.ДокументОснование = &ДокументОснование
	               |	И Renault_Задачи.ЗаменаАвто
	               |	И НЕ Renault_Задачи.ПометкаУдаления";
	
				   
	РезультатЗапроса = Запрос.Выполнить();			   
				   
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Сообщить("Клиент уже в работе у пользователя " + Выборка.АвторПредставление);
		
		Возврат;
		
	КонецЕсли;
	
	Задача = Документы.Renault_Задачи.СоздатьДокумент();
	Задача.Дата = ТекущаяДатаСеанса();
	Задача.Автор = ПараметрыСеанса.Пользователь;
	Задача.ВидЗадачи = Справочники.Renault_ТипыЗадач.СвязатьсяСКлиентом;
	Задача.Приоритет = Перечисления.DMS_ВариантыВажностиЗадачи.Обычная;
	Задача.Содержание = "Предложить клиенту " + ДокументОснование.Клиент + " замену автомобиля: " + Автомобиль;
	Задача.ДокументОснование = ДокументОснование;
	Задача.ЗаменаАвто = Истина;
	
	стрТЧ = Задача.Пользователи.Добавить();
	стрТЧ.Пользователь = ПараметрыСеанса.Пользователь;
	стрТЧ.СостояниеЗадачи = Перечисления.СостоянияСобытий.Выполняется;
	стрТЧ.ДатаНачалаПлан = ТекущаяДатаСеанса();
	стрТЧ.ДатаНачала = ТекущаяДатаСеанса();
	стрТЧ.ДатаОкончанияПлан = КонецДня(ТекущаяДатаСеанса());
	
	Задача.Записать(РежимЗаписиДокумента.Запись);
	
КонецПроцедуры

// Воробьев Д.А. 04.10.2016 11:01:43 --- 
