#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда

Функция ДобавитьКомментарий(ТекстКомментария,IDK,ИдентификаторКомментарияРодителя=Неопределено) Экспорт

	ЗаписьКоментарий = РегистрыСведений.CRM_Комментарии.СоздатьМенеджерЗаписи();
	ЗаписьКоментарий.Дата = ТекущаяДата();
	ЗаписьКоментарий.IDK = IDK;
	ЗаписьКоментарий.Идентификатор = СокрЛП(Новый УникальныйИдентификатор);
	Если ЗначениеЗаполнено(ИдентификаторКомментарияРодителя) Тогда
		ЗаписьКоментарий.ИдентификаторРодителя = ИдентификаторКомментарияРодителя;
	КонецЕсли;
	
	ЗаписьКоментарий.Автор = ПараметрыСеанса.Пользователь.Сотрудник;
	ЗаписьКоментарий.ТекстКомментария = СокрЛП(ТекстКомментария);
	Попытка ЗаписьКоментарий.Записать(); Исключение Сообщить(ОписаниеОшибки()); Возврат Ложь; КонецПопытки;
	
	Возврат Истина;

КонецФункции

#КонецЕсли