// Модуль документа

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования
Перем ИмяРеквизитаКода Экспорт;     // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/атрикула в ТЧ

Перем ТекущаяВалютаДокумента Экспорт;
Перем ТекущийКурсДокумента Экспорт;
Перем ФормаОткрыта Экспорт;			//Добавил Шульц

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	// Обязательные поля таблицы товаров
	ОбязательныеАвтомобили=Новый Структура();
	ОбязательныеАвтомобили.Вставить("Автомобиль",3);
	ОбязательныеАвтомобили.Вставить("ВариантКомплектации",2);
	ОбязательныеАвтомобили.Вставить("Цена",1);

	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("ВалютаДокумента",1);
	ОбязательныеРеквизиты.Вставить("КурсДокумента",1);
	ОбязательныеРеквизиты.Вставить("ТипЦен",1);
	ОбязательныеРеквизиты.Вставить("Автор",1);
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	ОбязательныеРеквизиты.Вставить("Автомобили",ОбязательныеАвтомобили);
	
	Возврат ОбязательныеРеквизиты;
КонецФункции

// Проверяет корректность заполнения объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
//	// Здесь могут быть определены дополнительные к стандартным обязательным реквизитам условия проверки
//	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
//	
//	// проверять на корректность реквизитов по организации будем только в случае если все нормально с остальными рекизитами
//	//Чтение значения для определения способа ведения баланса
//	СпособВеденияБаланса = Константы.СпособВеденияБаланса.Получить();
//	
//	// способ ведения не по организации или не прошла предыдущая проверка то и проверять ничего не будем
//	Если  Результат и СпособВеденияБаланса = Перечисления.СпособВеденияБаланса.ПоОрганизации Тогда
//		КонтролируемыеРеквизиты = Новый Структура();
//	
//		Результат = дкПроверитьКорректностьПоОрганизации(ЭтотОбъект,КонтролируемыеРеквизиты,Ошибки) и Результат;
//	КонецЕсли;	

//	Возврат Результат
//КонецФункции
 
// Функция проверяет, допустимо ли изменение объекта
// Возвращает Истина, если изменения возможны, ложь иначе
// Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов,
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции

// Возвращает список возможных хозяйственных операций документа
// Вовращаемое значение: СписокЗначений. 
// Строка списка: Значение - имя предопределенного элемента; 
//				  Представление - красивое его представление
// 				  "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("ИзменениеСкидокНаАвтомобили","Изменение скидок на автомобили",Истина);

	Возврат СписокХозОпераций;
КонецФункции

//Заполнения базового типа цен в зависимости от источника базовых цен
Процедура ЗаполнитьБазовуюЦену(СтрокаАвтомобилей) Экспорт
КонецПроцедуры

//Заполнения базового типа цен в зависимости от источника базовых цен
Процедура ЗаполнитьБазовыеЦены() Экспорт
КонецПроцедуры

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка			– Имя реквизита документа с полным путем (например Тавары.Номенклатура).
//  ЭтаФорма	– Форма				– Ссылка на форму документа. Если значение неопределено, производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Стркутура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	Результат=Истина;
	
	Если Имя="ВалютаДокумента" Тогда
		Попытка
			ТребуетсяПересчет=ДопПараметры.ТребуетсяПересчет;
		Исключение
			ТребуетсяПересчет=Ложь;
		КонецПопытки; 
		Если ТребуетсяПересчет И (НЕ обЗначениеНеЗаполнено(ТекущаяВалютаДокумента)) Тогда
			Для каждого СтрокаТЧ Из Автомобили Цикл
				НоваяЦена=обПересчет(СтрокаТЧ.Цена,ТекущаяВалютаДокумента,ТекущийКурсДокумента,ВалютаДокумента,КурсДокумента);
				Если НоваяЦена<>СтрокаТЧ.Цена Тогда
					СтрокаТЧ.Цена=НоваяЦена;
					Результат=ОбработкаРеквизита("Автомобили.Цена",СтрокаТЧ,ЭтаФорма,ДопПараметры) И Результат;
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли; 
		ТекущаяВалютаДокумента=ВалютаДокумента;
		ТекущийКурсДокумента=КурсДокумента;
		Возврат Результат;
		
	// ОБРАБОТКА РЕКВИЗИТОВ ТАБЛИЧНОЙ ЧАСТИ "АВТОМОБИЛИ"
	ИначеЕсли Имя="Автомобили.Автомобиль" ИЛИ Имя="Автомобили.ВариантКомплектации" Тогда
		Если обЗначениеНеЗаполнено(ТекСтрока.Автомобиль) Тогда Возврат Ложь; КонецЕсли;
		Если ТипЗнч(ТекСтрока.Автомобиль)=Тип("СправочникСсылка.Автомобили") Тогда
			ТекСтрока.ВариантКомплектации=Неопределено;
		ИначеЕсли ТипЗнч(ТекСтрока.Автомобиль)=Тип("СправочникСсылка.Модели") И
			(НЕ обЗначениеНеЗаполнено(ТекСтрока.ВариантКомплектации)) И
			(ТекСтрока.ВариантКомплектации.Владелец<>ТекСтрока.Автомобиль) Тогда
			ТекСтрока.ВариантКомплектации=Неопределено;
		КонецЕсли; 
		////получим базовую цену
		//ЗаполнитьБазовуюЦену(ТекСтрока);
		//Если ПроцентНаценки<>0 Тогда
		//	ТекСтрока.ПроцентНаценки = ПроцентНаценки;
		//Иначе
		//	ТекСтрока.ПроцентНаценки = БазовыйТипЦен.ПроцентСкидкиНаценки;
		//КонецЕсли;
		//ТекСтрока.Цена = ТекСтрока.ЦенаБазовая+((ТекСтрока.ЦенаБазовая*ТекСтрока.ПроцентНаценки)/100);
		//Возврат Истина;
		//
	ИначеЕсли Имя="Автомобили.Цена" Тогда	
		Если ТекСтрока.ЦенаБазовая>0 Тогда 
			ТекСтрока.ПроцентНаценки=?(ТекСтрока.ЦенаБазовая=0,0,((ТекСтрока.Цена-ТекСтрока.ЦенаБазовая)/ТекСтрока.ЦенаБазовая)*100);
		КонецЕсли;
		Возврат Истина;

	Иначе Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

#Если Клиент Тогда

// Формирует печатную форму "ИзменениеЦенАвтомобилей"
// Возвращает сформированный табличный документ:
Функция ПечатьИзменениеЦенАвтомобилей(ТабДокумент) Экспорт
	//Макет = ПолучитьМакет("ИзменениеЦенАвтомобилей");
	//
	//МассивАвтомобилей = Автомобили.ВыгрузитьКолонку("Автомобиль");
	//ТипАвтомобиль = Тип("СправочникСсылка.Автомобили");
	//ЕстьАвтомобили = Ложь;
	//Для Каждого СтрокаАвтомобиль Из МассивАвтомобилей Цикл
	//	ЕстьАвтомобили = ТипЗнч(СтрокаАвтомобиль)=ТипАвтомобиль;
	//	Если ЕстьАвтомобили Тогда
	//		Прервать;			
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Если НЕ ЕстьАвтомобили Тогда
	//	ОбластьАвтомобиль = Макет.Область("Товар");
	//	ОбластьVIN = Макет.Область("VIN");
	//	ОбластьАвтомобиль.ШиринаКолонки = ОбластьАвтомобиль.ШиринаКолонки + ОбластьVIN.ШиринаКолонки;
	//	Макет.УдалитьОбласть(ОбластьVIN,ТипСмещенияТабличногоДокумента.ПоВертикали);
	//КонецЕсли;
	//
	////для начала настроим макет
	//ОбластьШапкаТаблицы = орПривестиМакетПечатнойФормы(ЭтотОбъект,Макет);
	//
	//ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права);
	//
	////вывод заголовка документа
	//ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	//ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
	//ТекстЗаголовка = дкПолучитьПредставление(ЭтотОбъект);
	//ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	//ОбластьМакета.Параметры.ПредставлениеОрганизации	= спПолучитьПредставление(Организация);
	//ОбластьМакета.Параметры.ПредставлениеТипаЦен		= спПолучитьНаименование(ТипЦен);
	//
	////вывод свойств
	//СтрокаСвойств = дкПолучитьСтрокуСвойствДокумента(ЭтотОбъект);
	//ОбластьМакета.Параметры.СтрокаСвойств = СтрокаСвойств;
	//ТабДокумент.Вывести(ОбластьМакета);
	//
	//НомерСтраницы = 2;
	//НомерСтраницыПред = НомерСтраницы;
	//
	////теперь выводим шапку
	//ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	//
	////готовим области строки
	//ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	//
	//ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
	//
	////заполним параметры шапки таблицы для следующего листа
	//ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	//ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
	//	
	////перебор строк
	//ВыборкаТабличнойЧасти = ЭтотОбъект.Автомобили.Выгрузить();	
	//Для каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
	//	//заполняем данные строки
	//	СтруктураСтроки = орПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТабличнойЧасти,Права);
	//	// найдём старую цену
	//	СтруктураОтбора=Новый Структура("ТипЦен,Автомобиль,ВариантКомплектации",ТипЦен,СтрокаТабличнойЧасти.Автомобиль,СтрокаТабличнойЧасти.ВариантКомплектации);
	//	МоментВремени=?(Ссылка.Пустая(),Новый МоментВремени(КонецДня(Дата)),Новый Граница(Ссылка.МоментВремени(),ВидГраницы.Исключая));
	//	СтрукрураЦен=РегистрыСведений.ЦеныАвтомобилей.ПолучитьПоследнее(МоментВремени,СтруктураОтбора);
	//	ЦенаСтарая=СтрукрураЦен.Цена;
	//	
	//	ВалютаТипаЦены = обВалютаТипаЦены(СтрокаТабличнойЧасти.Автомобиль, ТипЦен);
	//	Если Не ВалютаТипаЦены = ВалютаДокумента Тогда
	//		ЦенаСтарая=обПересчет(ЦенаСтарая,ВалютаТипаЦены,Дата,ВалютаДокумента,КурсДокумента);	
	//	КонецЕсли;
	//	СтруктураСтроки.Вставить("ЦенаСтарая",Формат(ЦенаСтарая,ФорматВыводаСуммы));
	//	Если ТипЗнч(СтрокаТабличнойЧасти.Автомобиль)=ТипАвтомобиль Тогда
	//		СтруктураСтроки.Вставить("ВариантКомплектации",СтрокаТабличнойЧасти.Автомобиль.ВариантКомплектации);								
	//	Иначе 	
	//		СтруктураСтроки.Вставить("ВариантКомплектации",СтрокаТабличнойЧасти.ВариантКомплектации);
	//		Если ЕстьАвтомобили Тогда ОбластьМакета.Параметры.VIN = "";	КонецЕсли;
	//	КонецЕсли;
	//	
	//	ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);
	//	
	//	//выводим строку, делая проверку попадания на лист
	//	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице, НомерСтраницы,,Права);
	//	
	//	//инициализация итогов по странице
	//	Если НомерСтраницы <> НомерСтраницыПред Тогда
	//		НомерСтраницыПред = НомерСтраницы;
	//		ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
	//	КонецЕсли;
	//КонецЦикла;

	////итоги
	//ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	//ОбластьМакета.Параметры.СуммаПрописью = "Всего наименований "+ВыборкаТабличнойЧасти.Количество();
	//
	//// Выводим представления и расшифровки подписей
	//ПредседательКомиссии = дкОтветственноеЛицо(ЭтотОбъект,"ПредседательКомиссии");
	//ПредседательКомиссии.ПредседательКомиссииПредставление = ?(обЗначениеНеЗаполнено(ПредседательКомиссии.ПредседательКомиссии),"","/ "+ ПредседательКомиссии.ПредседательКомиссииПредставление);
	//ОбластьМакета.Параметры.Заполнить(ПредседательКомиссии);
	//ГлавныйБухгалтер = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер);
	//ГлавныйБухгалтер.ГлавныйБухгалтерПредставление = ?(обЗначениеНеЗаполнено(ГлавныйБухгалтер.ГлавныйБухгалтер),"","/ "+ ГлавныйБухгалтер.ГлавныйБухгалтерПредставление);
	//ОбластьМакета.Параметры.Заполнить(ГлавныйБухгалтер);
	//
	//НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, , , НомерСтраницы,,Права);
	//
	//Возврат ТабДокумент;
КонецФункции

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
// Параметры: НазваниеМакета - строка, название макета, если пусто - то по умолчанию,
//   Документ - сюда можно передать уже созданный табличный документ для заполнения
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=1, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	// Вызов конкретно печатной формы и печать результата прописано в общем модуле
	// здесь могут быть вставлены дополнительные механизмы
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции

// Возвращает доступные варианты печати документа
// Вовращаемое значение: Струткура, каждая строка которой
// соответствует одному из вариантов печати
// Рервый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм(ДокументСсылка = Неопределено) Экспорт
	СтруктураМакетов=Новый Структура();
	СтруктураМакетов.Вставить("ИзменениеЦенАвтомобилей", "Изменение цен на автомобили");
   	Возврат СтруктураМакетов;
КонецФункции

#КонецЕсли
// Если Клиент Тогда - завершена клиентская часть

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
	//Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание) Экспорт
	Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ОкруглятьДо=1.00;
	КонецЕсли; 
	
	Если Основание<>Неопределено И ТипЗнч(Основание)=Тип("ДокументСсылка.ПоступлениеАвтомобилей") Тогда
		ТипЦен=обПраво("ОсновнойТипЦенПродажи",Права);
		Если ТипЦен.Рассчитывается Тогда
			ПроцентНаценки=ТипЦен.ПроцентСкидкиНаценки;
		КонецЕсли; 
		РасчетЦенОт=1;
		БазовыйТипЦен=Основание.ТипЦен;
		ЗаполнитьБазовыеЦены();
		Для Каждого СтрокаАвтомобилей Из Автомобили Цикл
			СтрокаАвтомобилей.Цена=обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль,ВариантКомплектации",СтрокаАвтомобилей.Автомобиль,СтрокаАвтомобилей.ВариантКомплектации),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
			СтрокаАвтомобилей.ПроцентНаценки=?(СтрокаАвтомобилей.ЦенаБазовая=0,0,((СтрокаАвтомобилей.Цена*100)/СтрокаАвтомобилей.ЦенаБазовая)-100);
		КонецЦикла;
		
	КонецЕсли;
	
	ТекущаяВалютаДокумента=ВалютаДокумента;
	ТекущийКурсДокумента=КурсДокумента;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	//Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	Организация=ДилерскийЦентр.Организация;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
//	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
//	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Для Каждого ТекСтрокаАвтомобили Из Автомобили Цикл
		Движение=Движения.Renault_СкидкиНаАвтомобили.Добавить();
		Движение.Период=Дата;
		Движение.Автомобиль=ТекСтрокаАвтомобили.Автомобиль;
		Движение.ДатаНачала=ДатаНачала;
		Движение.ДатаКонца=ДатаКонца;
		// НАЧАЛО DMSCOR-1030
		Движение.ПроцентСкидки = ТекСтрокаАвтомобили.ПроцентСкидки;
		// КОНЕЦ DMSCOR-1030 		
		Движение.СуммаСкидки=ТекСтрокаАвтомобили.СуммаСкидки;
		Движение.ВариантКомплектации=ТекСтрокаАвтомобили.ВариантКомплектации;   
		Движение.ДилерскийЦентр=ДилерскийЦентр;
		Движение.ТипСкидки=ТипСкидки;
		//Движение.ТолькоВНаличии = ТолькоВНаличии;
		//Движение.BIR = Организация.НомерДилерскогоДоговораПеречисление;
		Движение.СтатусАвтомобиля=ТекСтрокаАвтомобили.СтатусАвтомобиля;
		Движение.ГодВыпуска=ГодВыпуска;
		Движение.КоличествоДнейНаСкладе=КоличествоДнейНаСкладе;
		//Андрианова Начало 11.10.2016
		Движение.НаличиеПТС = ТекСтрокаАвтомобили.НаличиеПТС;
		Движение.ОтсутствиеКлиента = ТекСтрокаАвтомобили.ОтсутствиеКлиента;
		//Андрианова Начало 11.10.2016
	КонецЦикла;

КонецПроцедуры 

Процедура ДвижениеПоРегиструСведенийAOC_Комплектации()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзменениеЦенАвтомобилейАвтомобили.Автомобиль КАК МодельСпр,
		|	ИзменениеЦенАвтомобилейАвтомобили.ВариантКомплектации КАК ВариантКомплектацииСпр,
		|	ИзменениеЦенАвтомобилейАвтомобили.Цена КАК ЦенаКлиентская,
		|	ИзменениеЦенАвтомобилейАвтомобили.ВариантКомплектации.ТипДвигателя.ОбъемДвигателя КАК ДвигательОбъем,
		|	ИзменениеЦенАвтомобилейАвтомобили.ВариантКомплектации.ТипДвигателя.МощностьКВТ КАК Двигатель_кВт,
		|	ИзменениеЦенАвтомобилейАвтомобили.ВариантКомплектации.ТипДвигателя.СтандартЕвро КАК Двигатель_НормаЕвро,
		|	ИзменениеЦенАвтомобилейАвтомобили.ВариантКомплектации.МассаСнаряженного КАК МассаMax,
		|	ИзменениеЦенАвтомобилейАвтомобили.ВариантКомплектации.МаксимальноДопустимая КАК МассаMin,
		|	ИзменениеЦенАвтомобилейАвтомобили.Автомобиль.Родитель.Наименование КАК Гамма,
		|	ИзменениеЦенАвтомобилейАвтомобили.Ссылка.ТипЦен.Наименование КАК НаименованиеТарифа,
		|	ИзменениеЦенАвтомобилейАвтомобили.Автомобиль.Артикул + "" "" + ИзменениеЦенАвтомобилейАвтомобили.ВариантКомплектации.Артикул КАК Тариф,
		|	ИзменениеЦенАвтомобилейАвтомобили.Автомобиль.Артикул КАК КодМодели,
		|	ИзменениеЦенАвтомобилейАвтомобили.ВариантКомплектации.Артикул КАК КодКомплектации
		|ИЗ
		|	Документ.ИзменениеЦенАвтомобилей.Автомобили КАК ИзменениеЦенАвтомобилейАвтомобили
		|ГДЕ
		|	ИзменениеЦенАвтомобилейАвтомобили.Ссылка.Ссылка = &Ссылка
		|	И ИзменениеЦенАвтомобилейАвтомобили.Автомобиль ССЫЛКА Справочник.Модели
		|	И ИзменениеЦенАвтомобилейАвтомобили.Ссылка.ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.AOC_Комплектации.Добавить();
		Движение.Период = Дата;
		ЗаполнитьЗначенияСвойств(Движение,ВыборкаДетальныеЗаписи);
		Движение.Идентификатор = Новый УникальныйИдентификатор();
	КонецЦикла;
	
	//Для Каждого ТекСтрокаАвтомобили Из Автомобили Цикл
	//	Если ТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенПродажи И ТекСтро Тогда
	//		Движение = Движения.AOC_Комплектации.Добавить();
	//		Движение.Период = Дата;
	//		Движение.КодМодели = ТекСтрокаАвтомобили.Автомоби.Артикул
	//		Движение.КодКомплектации = ТекСтрокаАвтомобили.ВариантКомплектации.Артикул;
	//		Движение.МодельСпр = ТекСтрокаАвтомобили.Автомобиль.Модель;
	//		Движение.ВариантКомплектацииСпр = ТекСтрокаАвтомобили.ВариантКомплектации;
	//		Движение.ЦенаКлиентская = ТекСтрокаАвтомобили.Цена;
	//	КонецЕсли;
	//	//Движение.ЦенаДилерская = ТекСтрокаАвтомобили.ЦенаБазовая;
	//КонецЦикла;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли
ФормаОткрыта=Ложь; //Добавил Шульц
