
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Renault_СтатусыБСО
	Движения.Renault_СтатусыБСО.Записывать = Истина;
	Движения.Renault_СтатусыБСО.Очистить();
	Для Каждого ТекСтрокаБСО Из БСО Цикл
		Движение = Движения.Renault_СтатусыБСО.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.СтраховаяКомпания = ТекСтрокаБСО.СтраховаяКомпания;
		Движение.ТипБСО = ТекСтрокаБСО.ТипБСО;
		Движение.СерияБСО = ТекСтрокаБСО.СерияБСО;
		Движение.НомерБСО = ТекСтрокаБСО.НомерБСО;
		Движение.Статус = ТекСтрокаБСО.Статус;
	КонецЦикла;

	//// регистр Renault_БСОНаТочкеПродаж Приход
	//Движения.Renault_БСОНаТочкеПродаж.Записывать = Истина;
	//Движения.Renault_БСОНаТочкеПродаж.Очистить();
	//Для Каждого ТекСтрокаБСО Из БСО Цикл
	//	Движение = Движения.Renault_БСОНаТочкеПродаж.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//	Движение.Период = Дата;
	//	Движение.Организация = Организация;
	//	Движение.ТочкаПродаж = ТочкаПродаж;
	//	Движение.СтраховаяКомпания = ТекСтрокаБСО.СтраховаяКомпания;
	//	Движение.ТипБСО = ТекСтрокаБСО.ТипБСО;
	//	Движение.СерияБСО = ТекСтрокаБСО.СерияБСО;
	//	Движение.НомерБСО = ТекСтрокаБСО.НомерБСО;
	//	Движение.Количество = 1;
	//КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура Печать() Экспорт
	
	//Если НЕ ЭтотОбъект.Проведен Тогда
	//	Сообщить("Печать возможна только после проведения документа!");
	//	Возврат;
	//КонецЕсли;	
	//
	//ТабДок = Новый ТабличныйДокумент;
	//Макет = ПолучитьМакет("АктПриемаПередачи");	
	//
	//Область = Макет.ПолучитьОбласть("Шапка");
	//Область.Параметры.Заголовок = "АКТ ПРИЕМА-ПЕРЕДАЧИ БЛАНКОВ СТРОГОЙ ОТЧЕТНОСТИ № " + Номер;
	//Область.Параметры.Передал = Ответственный;
	//Область.Параметры.Принял = ?(ПодписьАдеррайтера, Адеррайтер, "");
	//Область.Параметры.ДатаСозданияАкта = Дата;
	//ТабДок.Вывести(Область);
	//
	//Область = Макет.ПолучитьОбласть("ШапкаТаблицы");
	//ТабДок.Вывести(Область);
	//
	//Выборка = ПолучитьВыборкуБСО();
	//
	//НомерСтроки = 1;
	//Пока Выборка.Следующий() Цикл
	//	
	//	Область = Макет.ПолучитьОбласть("Строка");
	//	
	//	ЗаполнитьЗначенияСвойств(Область.Параметры, Выборка);
	//	Область.Параметры.НомерДоговора = "" + СокрЛП(Выборка.СерияБСО) + " " + СокрЛП(Выборка.НомерБСО);
	//	Область.Параметры.НомерКвитанции = "" + СокрЛП(Выборка.СерияБСОКвитанция) + " " + СокрЛП(Выборка.НомерБСОКвитанция);
	//	Область.Параметры.Номер = НомерСтроки;
	//	
	//	ТабДок.Вывести(Область);
	//	
	//	НомерСтроки = НомерСтроки + 1;
	//	
	//КонецЦикла;
	//
	//Область = Макет.ПолучитьОбласть("Подвал");
	//Область.Параметры.Передал = Ответственный;
	//Область.Параметры.Принял = ?(ПодписьАдеррайтера, Адеррайтер, "");;
	//ТабДок.Вывести(Область);
	//
	//ТабДок.Показать();
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	//Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	//	
	//	//ЕстьБСОВОрганизации = ложь;
	//	//ЕстьБСОНаТочке = ложь;
	//	
	//	ТаблицаБСО = Renault_УчетБСО.ПолучитьТаблицуБСОПоТабЧасти(БСО, Организация, неопределено, ТочкаПродаж, ложь);
	//	
	//	ЕстьБСОВОрганизации = Renault_УчетБСО.ПроверитьНаличиеБСО(Дата, ТаблицаБСО, Организация, неопределено, неопределено, истина);
	//	
	//	ЕстьБСОНаТочке = Renault_УчетБСО.ПроверитьНаличиеБСО(Дата, ТаблицаБСО, Организация, неопределено, ТочкаПродаж, истина);
	//	
	//	Отказ = (НЕ ЕстьБСОВОрганизации) ИЛИ (НЕ ЕстьБСОНаТочке);
	//	
	//КонецЕсли;
	
КонецПроцедуры      

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьВыборкуБСО()
	
	//Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	БСО.СтраховаяКомпания,
	//			   |	БСО.ТипБСО,
	//			   |	БСО.СерияБСО,
	//			   |	БСО.НомерБСО,
	//			   |	БСО.НомерСтроки
	//			   |ПОМЕСТИТЬ ВТ_БСО
	//			   |ИЗ
	//			   |	Документ.Renault_ВозвратБСОВОрганизацию.БСО КАК БСО
	//			   |ГДЕ
	//			   |	БСО.Ссылка = &Ссылка
	//			   |;
	//			   |
	//			   |////////////////////////////////////////////////////////////////////////////////
	//			   |ВЫБРАТЬ
	//			   |	ВТ_БСО.СтраховаяКомпания,
	//			   |	ВТ_БСО.ТипБСО КАК ТипБСОКвитанция,
	//			   |	ВТ_БСО.СерияБСО КАК СерияБСОКвитанция,
	//			   |	ВТ_БСО.НомерБСО КАК НомерБСОКвитанция,
	//			   |	Renault_КвитанцииКПолисам.СтраховойПолис,
	//			   |	Renault_СтраховыеПолисы.ТипБСО КАК ТипБСОПолис,
	//			   |	Renault_СтраховыеПолисы.СерияБСО КАК СерияБСОПолис,
	//			   |	Renault_СтраховыеПолисы.НомерБСО КАК НомерБСОПолис,
	//			   |	ВТ_БСО.НомерСтроки
	//			   |ПОМЕСТИТЬ ВТ_Квитанции
	//			   |ИЗ
	//			   |	ВТ_БСО КАК ВТ_БСО
	//			   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КвитанцииКПолисам КАК Renault_КвитанцииКПолисам
	//			   |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Renault_СтраховыеПолисы КАК Renault_СтраховыеПолисы
	//			   |			ПО Renault_КвитанцииКПолисам.СтраховойПолис = Renault_СтраховыеПолисы.Регистратор
	//			   |		ПО ВТ_БСО.СтраховаяКомпания = Renault_КвитанцииКПолисам.СтраховаяКомпания
	//			   |			И ВТ_БСО.ТипБСО = Renault_КвитанцииКПолисам.ТипБСО
	//			   |			И ВТ_БСО.СерияБСО = Renault_КвитанцииКПолисам.СерияБСО
	//			   |			И ВТ_БСО.НомерБСО = Renault_КвитанцииКПолисам.НомерБСО
	//			   |ГДЕ
	//			   |	НЕ Renault_КвитанцииКПолисам.СтраховойПолис ЕСТЬ NULL 
	//			   |;
	//			   |
	//			   |////////////////////////////////////////////////////////////////////////////////
	//			   |ВЫБРАТЬ
	//			   |	ВТ_БСО.СтраховаяКомпания,
	//			   |	ВТ_БСО.ТипБСО КАК ТипБСО,
	//			   |	ВТ_БСО.СерияБСО КАК СерияБСО,
	//			   |	ВТ_БСО.НомерБСО КАК НомерБСО,
	//			   |	ВТ_БСО.НомерСтроки
	//			   |ПОМЕСТИТЬ ВТ_НеКвитанции
	//			   |ИЗ
	//			   |	ВТ_БСО КАК ВТ_БСО
	//			   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КвитанцииКПолисам КАК Renault_КвитанцииКПолисам
	//			   |		ПО ВТ_БСО.СтраховаяКомпания = Renault_КвитанцииКПолисам.СтраховаяКомпания
	//			   |			И ВТ_БСО.ТипБСО = Renault_КвитанцииКПолисам.ТипБСО
	//			   |			И ВТ_БСО.СерияБСО = Renault_КвитанцииКПолисам.СерияБСО
	//			   |			И ВТ_БСО.НомерБСО = Renault_КвитанцииКПолисам.НомерБСО
	//			   |ГДЕ
	//			   |	Renault_КвитанцииКПолисам.СтраховойПолис ЕСТЬ NULL 
	//			   |;
	//			   |
	//			   |////////////////////////////////////////////////////////////////////////////////
	//			   |ВЫБРАТЬ
	//			   |	ВТ_НеКвитанции.СтраховаяКомпания,
	//			   |	ВЫБОР
	//			   |		КОГДА Renault_ТипыБСО.ЭтоКвитанция
	//			   |			ТОГДА ЗНАЧЕНИЕ(Справочник.Renault_ТипыБСО.ПустаяСсылка)
	//			   |		ИНАЧЕ ВТ_НеКвитанции.ТипБСО
	//			   |	КОНЕЦ КАК ТипБСО,
	//			   |	ВЫБОР
	//			   |		КОГДА Renault_ТипыБСО.ЭтоКвитанция
	//			   |			ТОГДА ЗНАЧЕНИЕ(Справочник.Renault_СерииБСО.ПустаяСсылка)
	//			   |		ИНАЧЕ ВТ_НеКвитанции.СерияБСО
	//			   |	КОНЕЦ КАК СерияБСО,
	//			   |	ВЫБОР
	//			   |		КОГДА Renault_ТипыБСО.ЭтоКвитанция
	//			   |			ТОГДА """"
	//			   |		ИНАЧЕ ВТ_НеКвитанции.НомерБСО
	//			   |	КОНЕЦ КАК НомерБСО,
	//			   |	ВЫБОР
	//			   |		КОГДА НЕ Renault_ТипыБСО.ЭтоКвитанция
	//			   |			ТОГДА ВТ_Квитанции.ТипБСОКвитанция
	//			   |		ИНАЧЕ ВТ_НеКвитанции.ТипБСО
	//			   |	КОНЕЦ КАК ТипБСОКвитанция,
	//			   |	ВЫБОР
	//			   |		КОГДА НЕ Renault_ТипыБСО.ЭтоКвитанция
	//			   |			ТОГДА ВТ_Квитанции.СерияБСОКвитанция
	//			   |		ИНАЧЕ ВТ_НеКвитанции.СерияБСО
	//			   |	КОНЕЦ КАК СерияБСОКвитанция,
	//			   |	ВЫБОР
	//			   |		КОГДА НЕ Renault_ТипыБСО.ЭтоКвитанция
	//			   |			ТОГДА ВТ_Квитанции.НомерБСОКвитанция
	//			   |		ИНАЧЕ ВТ_НеКвитанции.НомерБСО
	//			   |	КОНЕЦ КАК НомерБСОКвитанция,
	//			   |	Renault_СтраховыеПолисы.Страхователь,
	//			   |	ЕСТЬNULL(Renault_СтраховыеПолисы.ВидСтрахования, Renault_ТипыБСО.ВидСтрахования) КАК ВидСтрахования,
	//			   |	ВТ_НеКвитанции.НомерСтроки
	//			   |ПОМЕСТИТЬ ВТ_НеКвитанцииДляПечати
	//			   |ИЗ
	//			   |	ВТ_НеКвитанции КАК ВТ_НеКвитанции
	//			   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Квитанции КАК ВТ_Квитанции
	//			   |		ПО ВТ_НеКвитанции.СтраховаяКомпания = ВТ_Квитанции.СтраховаяКомпания
	//			   |			И ВТ_НеКвитанции.ТипБСО = ВТ_Квитанции.ТипБСОПолис
	//			   |			И ВТ_НеКвитанции.СерияБСО = ВТ_Квитанции.СерияБСОПолис
	//			   |			И ВТ_НеКвитанции.НомерБСО = ВТ_Квитанции.НомерБСОПолис
	//			   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Renault_СтраховыеПолисы КАК Renault_СтраховыеПолисы
	//			   |		ПО ВТ_НеКвитанции.СтраховаяКомпания = Renault_СтраховыеПолисы.СтраховаяКомпания
	//			   |			И ВТ_НеКвитанции.ТипБСО = Renault_СтраховыеПолисы.ТипБСО
	//			   |			И ВТ_НеКвитанции.СерияБСО = Renault_СтраховыеПолисы.СерияБСО
	//			   |			И ВТ_НеКвитанции.НомерБСО = Renault_СтраховыеПолисы.НомерБСО
	//			   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_ТипыБСО КАК Renault_ТипыБСО
	//			   |		ПО ВТ_НеКвитанции.ТипБСО = Renault_ТипыБСО.Ссылка
	//			   |;
	//			   |
	//			   |////////////////////////////////////////////////////////////////////////////////
	//			   |ВЫБРАТЬ
	//			   |	ВТ_Квитанции.СтраховаяКомпания,
	//			   |	ВТ_Квитанции.ТипБСОКвитанция,
	//			   |	ВТ_Квитанции.СерияБСОКвитанция,
	//			   |	ВТ_Квитанции.НомерБСОКвитанция,
	//			   |	ВТ_НеКвитанцииДляПечати.Страхователь,
	//			   |	ВТ_НеКвитанцииДляПечати.ВидСтрахования,
	//			   |	ВТ_Квитанции.НомерСтроки
	//			   |ПОМЕСТИТЬ ВТ_КвитанцииДляПечати
	//			   |ИЗ
	//			   |	ВТ_Квитанции КАК ВТ_Квитанции
	//			   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НеКвитанцииДляПечати КАК ВТ_НеКвитанцииДляПечати
	//			   |		ПО ВТ_Квитанции.СтраховаяКомпания = ВТ_НеКвитанцииДляПечати.СтраховаяКомпания
	//			   |ГДЕ
	//			   |	ВТ_НеКвитанцииДляПечати.СтраховаяКомпания ЕСТЬ NULL 
	//			   |;
	//			   |
	//			   |////////////////////////////////////////////////////////////////////////////////
	//			   |ВЫБРАТЬ
	//			   |	ВложенныйЗапрос.СтраховаяКомпания,
	//			   |	ВложенныйЗапрос.Страхователь,
	//			   |	ВложенныйЗапрос.ВидСтрахования,
	//			   |	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
	//			   |	ВложенныйЗапрос.ТипБСОКвитанция,
	//			   |	ВложенныйЗапрос.СерияБСОКвитанция,
	//			   |	ВложенныйЗапрос.НомерБСОКвитанция,
	//			   |	ВложенныйЗапрос.ТипБСО,
	//			   |	ВложенныйЗапрос.СерияБСО,
	//			   |	ВложенныйЗапрос.НомерБСО
	//			   |ИЗ
	//			   |	(ВЫБРАТЬ
	//			   |		ВТ_НеКвитанцииДляПечати.СтраховаяКомпания КАК СтраховаяКомпания,
	//			   |		ВТ_НеКвитанцииДляПечати.Страхователь КАК Страхователь,
	//			   |		ВТ_НеКвитанцииДляПечати.ВидСтрахования КАК ВидСтрахования,
	//			   |		ВТ_НеКвитанцииДляПечати.НомерСтроки КАК НомерСтроки,
	//			   |		NULL КАК ТипБСОКвитанция,
	//			   |		ВТ_НеКвитанцииДляПечати.СерияБСОКвитанция КАК СерияБСОКвитанция,
	//			   |		ВТ_НеКвитанцииДляПечати.НомерБСОКвитанция КАК НомерБСОКвитанция,
	//			   |		ВТ_НеКвитанцииДляПечати.ТипБСО КАК ТипБСО,
	//			   |		ВТ_НеКвитанцииДляПечати.СерияБСО КАК СерияБСО,
	//			   |		ВТ_НеКвитанцииДляПечати.НомерБСО КАК НомерБСО
	//			   |	ИЗ
	//			   |		ВТ_НеКвитанцииДляПечати КАК ВТ_НеКвитанцииДляПечати
	//			   |	
	//			   |	ОБЪЕДИНИТЬ ВСЕ
	//			   |	
	//			   |	ВЫБРАТЬ
	//			   |		ВТ_КвитанцииДляПечати.СтраховаяКомпания,
	//			   |		ВТ_КвитанцииДляПечати.Страхователь,
	//			   |		ВТ_КвитанцииДляПечати.ВидСтрахования,
	//			   |		ВТ_КвитанцииДляПечати.НомерСтроки,
	//			   |		ВТ_КвитанцииДляПечати.ТипБСОКвитанция,
	//			   |		ВТ_КвитанцииДляПечати.СерияБСОКвитанция,
	//			   |		ВТ_КвитанцииДляПечати.НомерБСОКвитанция,
	//			   |		NULL,
	//			   |		NULL,
	//			   |		NULL
	//			   |	ИЗ
	//			   |		ВТ_КвитанцииДляПечати КАК ВТ_КвитанцииДляПечати) КАК ВложенныйЗапрос
	//			   |
	//			   |УПОРЯДОЧИТЬ ПО
	//			   |	НомерСтроки
	//			   |АВТОУПОРЯДОЧИВАНИЕ";
	//
	//Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции	