
Функция ЗарегистрироватьОткрытиеФормы(вхПользователь, вхИмя, вхКомпьютер, вхПолноеИмя = Неопределено) Экспорт
	
	Менеджер = СоздатьМенеджерЗаписи();
	Если вхПолноеИмя = Неопределено Тогда
		вхПолноеИмя = вхИмя;
	КонецЕсли;
	
	Менеджер.Компьютер = вхКомпьютер;
	Менеджер.ИмяФормы = вхИмя;
	Менеджер.Пользователь = вхПользователь;
	Менеджер.ПолноеИмяФормы = вхПолноеИмя;
	Менеджер.Записать();
	
КонецФункции

Функция ЗарегистрироватьЗакрытиеФормы(вхПользователь, вхИмя, вхКомпьютер, вхПолноеИмя = Неопределено) Экспорт
	
	Если вхПолноеИмя = Неопределено Тогда
		вхПолноеИмя = вхИмя;
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Renault_ОткрытыеФормы.Пользователь,
	                      |	Renault_ОткрытыеФормы.ИмяФормы,
	                      |	Renault_ОткрытыеФормы.Компьютер,
	                      |	Renault_ОткрытыеФормы.ПолноеИмяФормы
	                      |ИЗ
	                      |	РегистрСведений.Renault_ОткрытыеФормы КАК Renault_ОткрытыеФормы
	                      |ГДЕ
	                      |	Renault_ОткрытыеФормы.ПолноеИмяФормы ПОДОБНО &ПолноеИмяФормы
	                      |	И Renault_ОткрытыеФормы.ИмяФормы = &ИмяФормы
	                      |	И Renault_ОткрытыеФормы.Пользователь = &Пользователь
	                      |	И Renault_ОткрытыеФормы.Компьютер = &Компьютер");
	Запрос.УстановитьПараметр("ПолноеИмяФормы",вхПолноеИмя);
	Запрос.УстановитьПараметр("Компьютер",вхКомпьютер);
	Запрос.УстановитьПараметр("Пользователь",вхПользователь);
	Запрос.УстановитьПараметр("ИмяФормы",вхИмя);
	Выборка = запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Менеджер = СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Менеджер,Выборка);
		Менеджер.Прочитать();
		Если Менеджер.Выбран() Тогда
			//ЗаполнитьЗначенияСвойств(Менеджер,Выборка);
			Менеджер.Удалить();
		КонецЕсли;
	КонецЕсли;
	
КонецФункции
