
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	ВОбработке = ПолучитьСтатусВОбработке (ТекущаяСтрока.Ссылка);
	
	ФормаДокумента = ПолучитьФорму("ОбщаяФорма.Renault_ФормаДокументаЗаказПоставшику");
	ФормаДокумента.ДокументОбъект = ТекущаяСтрока.Ссылка.ПолучитьОБъект();
	Если ВОбработке Тогда
		ФормаДокумента.ТолькоПросмотр = Истина;
	Иначе
		ФормаДокумента.ЭлементыФормы.ТипЗаказа.ТолькоПросмотр = Истина;
		ФормаДокумента.УчитыватьКратность = Истина;
		ФормаДокумента.ЭлементыФормы.Контрагент.ТолькоПросмотр = Истина;
	КонецЕсли;
	ФормаДокумента.ЭлементыФормы.КоманднаяПанельТовары.Кнопки.Renault.Доступность = Истина;
	ФормаДокумента.Открыть();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтатусВОбработке (Заявка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ИсторияВыгрузкиЗаказов.ЗаказПоставщику
	|ИЗ
	|	РегистрСведений.Renault_ИсторияВыгрузкиЗаказов КАК Renault_ИсторияВыгрузкиЗаказов
	|ГДЕ
	|	Renault_ИсторияВыгрузкиЗаказов.ВОбработке
	|	И Renault_ИсторияВыгрузкиЗаказов.ЗаказПоставщику = &ЗаказПоставщику";
	Запрос.УстановитьПараметр("ЗаказПоставщику", Заявка);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ИсправитьКоличество(Команда)
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		Отказ = ПроверитьДоступность(ТекущаяСтрока.Ссылка);
		Если Не Отказ и (ТекущаяСтрока.ОтправленВСАП или ТекущаяСтрока.ОтправленВРено) Тогда
			сПараметры = Новый Структура;
			сПараметры.Вставить("Заказ", ТекущаяСтрока.Ссылка);
			ОткрытьФорму("Обработка.Renault_ARM_Запчасти.Форма.ФормаРедКоличества",сПараметры);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьДоступность (Заявка)
	
	Если Заявка.ТипЗаказа = Справочники.ТипыЗаказов.ZMP2Срочный
		или Заявка.ТипЗаказа = Справочники.ТипыЗаказов.ZMP2Гарантийный Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура ИсторияЗапросовИзменений(Команда)
	ОткрытьФорму("Обработка.Renault_ARM_Запчасти.Форма.ФормаСпискаИзменений");
КонецПроцедуры


&НаСервере
Процедура УстаноыитьДЦВЗаявке(ДЦСсылка, ДокСсылка)
	ДокОбъект = ДокСсылка.ПолучитьОбъект();
	ДокОбъект.ДилерскийЦентр = ДЦСсылка;
	ДокОбъект.Записать();
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ЗАПОЛНЕНИЯ НА ОСНОВАНИИ

&НаСервере 
Процедура ВвестиЗаказНаСервере (Основание,ДокОбъект)
	
	Если ЗначениеЗаполнено(Основание.ЗаказПокупателя) Тогда 
		ДокОбъект = Основание.ЗаказПокупателя.ПолучитьОбъект();
		Возврат;
	КонецЕсли;
	
	ДокОбъект.ОбработкаРасчетСкидок = Обработки.РасчетСкидок.Создать();
	
	ДокОбъект.ХозОперация = Справочники.ХозОперации.ЗаказРезервированиеПокупателя;
	
	Настройка = Справочники.Renault_ОбщиеНастройкиБазыДанных.ЭтаБаза;
	
	ДокОбъект.Контрагент                = Основание.Клиент.Контрагент;
	ДокОбъект.ДоговорВзаиморасчетов     = Основание.Клиент.ОсновнойДоговор;
	ДокОбъект.Организация               = Основание.ДилерскийЦентр.Организация;
	
	Если Основание.ДилерскийЦентр.ПодразделенияОрганизации.Количество() Тогда
		ДокОбъект.ПодразделениеКомпании = Основание.ДилерскийЦентр.ПодразделенияОрганизации[0].Подразделение;
	Иначе
		ДокОбъект.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
	КонецЕсли;
	
	ДокОбъект.ТипЦен                    = Настройка.ОптоваяЦена;
	ДокОбъект.СкладКомпании             = Настройка.ОсновнойСкладРеализации;
	ДокОбъект.ПроцентПредоплаты         = 0;
	
	Для Каждого СтрокаТЧЗаявки из Основание.Запчасти Цикл
		
		СтрокаТЧЗаказ = ДокОбъект.Товары.Добавить();
		
        СтрокаТЧЗаказ.Номенклатура        = СтрокаТЧЗаявки.Номенклатура;
        ДокОбъект.ОбработкаРеквизита("Товары.Номенклатура", СтрокаТЧЗаказ);
		
		СтрокаТЧЗаказ.Цена                = СтрокаТЧЗаявки.Цена;
        СтрокаТЧЗаказ.Количество          = СтрокаТЧЗаявки.Количество;
		ДокОбъект.ОбработкаРеквизита("Товары.Количество", СтрокаТЧЗаказ);
		
		СкидкаПромо = СтрокаТЧЗаявки.Промо.Значение;
		Если СтрокаТЧЗаявки.Скидка = "-" Тогда
			СкидкаБарем = СтрокаТЧЗаявки.Коэффициент;
		Иначе
			СкидкаБарем = -1 * СтрокаТЧЗаявки.Коэффициент;
		КонецЕсли;
		ОбщаяСкидка = СкидкаБарем + ((100 - СкидкаБарем) * СкидкаПромо / 100);
		СтрокаТЧЗаказ.СкидкаНаТовар       = Renault_ЗапчастиСкидки.Reanult_НайтиСоздатьТиповуюСкидку();
		СтрокаТЧЗаказ.ПроцентСкидкиСтроки = ОбщаяСкидка;
		
		ДокОбъект.ОбработкаРеквизита("Товары.ПроцентСкидкиСтроки", СтрокаТЧЗаказ);
		ДокОбъект.ОбработкаРеквизита("Товары.СуммаСкидкиСтроки",   СтрокаТЧЗаказ);
        ДокОбъект.ОбработкаРеквизита("Товары.СтавкаНДС",           СтрокаТЧЗаказ);
		
	КонецЦикла;
	
	ДокОбъект.Записать();
	
	ЗаявкаОбъект = Основание.ПолучитьОбъект();
	ЗаявкаОбъект.ЗаказПокупателя = ДокОбъект.Ссылка;
	ЗаявкаОбъект.Записать();
	
КонецПроцедуры

&НаСервере 
Функция ВвестиЗаменуНаСервере(Основание)
	
	ДокОбъект = Документы.ЗаменаВЗаказеПокупателя.СоздатьДокумент();
	ДокОбъект.ОбработкаРасчетСкидок = Обработки.РасчетСкидок.Создать();
	ДокОбъект.Заполнить(Основание);
	
	Возврат ДокОбъект;
	
КонецФункции

&НаСервере 
Функция ВвестиРеализациюНаСервере(Основание)
	
	ДокОбъект = Документы.РеализацияТоваров.СоздатьДокумент();
	ДокОбъект.ОбработкаРасчетСкидок = Обработки.РасчетСкидок.Создать();
	ДокОбъект.Заполнить(Основание);
	
	Возврат ДокОбъект;
	
КонецФункции


&НаКлиенте
Процедура СоздатьДокумент(Команда)
	Перем ТипЗаявки;
	Отказ = Истина;

	Если ВвестиЗначение(ТипЗаявки, "Выберите тип поставки",Новый ОписаниеТипов("СправочникСсылка.ТипыЗаказов")) Тогда
		ФормаДокумента = ПолучитьФорму("ОбщаяФорма.Renault_ФормаДокументаЗаказПоставшику");
		ФормаДокумента.Контрагент = Справочники.Renault_ОбщиеНастройкиБазыДанных.ЭтаБаза.ОсновнойПоставщик;
		ФормаДокумента.УчитыватьКратность = Истина;
		ФормаДокумента.ЭлементыФормы.Контрагент.ТолькоПросмотр = Истина;
		ФормаДокумента.ТипЗаказа = ТипЗаявки;
		ФормаДокумента.СрокПоставки = НачалоДня(ТекущаяДата())+ 86400;
		ФормаДокумента.ЭлементыФормы.ТипЗаказа.ТолькоПросмотр = Истина;
		ФормаДокумента.ЭлементыФормы.КоманднаяПанельТовары.Кнопки.Renault.Доступность = Истина;
		Если ТипЗаявки = Справочники.ТипыЗаказов.ZMP2Гарантийный или 
				ТипЗаявки = Справочники.ТипыЗаказов.ZMP2Срочный или 
					ТипЗаявки = Справочники.ТипыЗаказов.ZMP1PVI или 
						ТипЗаявки = Справочники.ТипыЗаказов.ZMP2Кодовые Тогда
			ФормаДокумента.ТипЦен = Справочники.Renault_ОбщиеНастройкиБазыДанных.ЭтаБаза.PNCЗакупСрочная;
		ИначеЕсли ТипЗаявки = Справочники.ТипыЗаказов.ZMP4Складской или 
						ТипЗаявки = Справочники.ТипыЗаказов.ZMP9Промо или 
							ТипЗаявки = Справочники.ТипыЗаказов.ZMP4ПрямаяПоставка Тогда
			ФормаДокумента.ТипЦен = Справочники.Renault_ОбщиеНастройкиБазыДанных.ЭтаБаза.PNCЗакупСкладская;
		КонецЕсли;
		ФормаДокумента.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументыРПартс.Параметры.УстановитьЗначениеПараметра("Заказ", Неопределено);
	ОстаткиРПартс.Параметры.УстановитьЗначениеПараметра("Заказ", Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиРПартсПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ЗаявкиРПартсПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиРПартсПриАктивизацииСтрокиОбработчикОжидания()
	
	Если ЗаявкиРПартсТекущаяСтрока <> Элементы.ЗаявкиРПартс.ТекущаяСтрока Тогда
		ОбновитьДанныеПоЗаявке();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоЗаявке()
	
	ТекущиеДанные = Элементы.ЗаявкиРПартс.ТекущаяСтрока;
	
	ДокументыРПартс.Параметры.УстановитьЗначениеПараметра("Заказ", ТекущиеДанные.ЗаказПокупателя);
	ОстаткиРПартс.Параметры.УстановитьЗначениеПараметра("Заказ", ТекущиеДанные.ЗаказПокупателя);
	
	Контрагент = ТекущиеДанные.Клиент.Контрагент;
	
	ЗаявкиРПартсТекущаяСтрока = ТекущиеДанные;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыРПартсВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьЗначение(Элемент.ТекущиеДанные.Документ);

КонецПроцедуры

&НаСервере
Функция ПолучитьФормуДокументаРПартс(ДокументСсылка)
	
	Форма = Неопределено;
	
    Возврат Форма;
	
КонецФункции


///////////////////////////////////////////////////////////////////////////////
// УПРАВЛЕНИЕ СТРАНИЦАМИ

&НаКлиенте
Процедура ЗакладкаРеноПартс(Команда)
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРеноПартс;
КонецПроцедуры

&НаКлиенте
Процедура ЗакладкаСклад(Команда)
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСклад;
КонецПроцедуры

&НаКлиенте
Процедура ЗакладкаРекламации(Команда)
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРекламации;
КонецПроцедуры

&НаКлиенте
Процедура ЗакладкаЗаказЗапчастей(Команда)
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗаказЗапчастей;
КонецПроцедуры

&НаКлиенте
Процедура ЗакладкаКаталог(Команда)
    Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаКаталог;
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ТАБЛИЦЫ РПартсЗаявки

&НаКлиенте
Процедура РПартсВвестиЗаказ(Команда)

	ТекСтрока = Элементы.ЗаявкиРПартс.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда

		Если РегистрыСведений.Renault_Промоакции.ЕстьПромоакции(
			ТекСтрока.Ссылка.Дата,
			ТекСтрока.Ссылка.Запчасти.ВыгрузитьКолонку("Номенклатура")) Тогда
			Если Вопрос("Для заказа есть активные промоакции, они корректно проставлены? Продолжить?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекСтрока.Ссылка.ДилерскийЦентр) Тогда
			Предупреждение("Не заполенен дилерский центр");
			ФормаДЦ = ПолучитьФорму("Справочник.CRM_ДилерскиеЦентры.ФормаВыбора");
			ДЦСсылка = ФормаДЦ.Открытьмодально();
			Если ЗначениеЗаполнено(ДЦСсылка) Тогда
				УстаноыитьДЦВЗаявке(ДЦСсылка, ТекСтрока.Ссылка);
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
		ФормаНовогоДокумента = ПолучитьФорму("Документ.ЗаказПокупателя.ФормаОбъекта");
		ВвестиЗаказНаСервере(ТекСтрока.Ссылка, ФормаНовогоДокумента.ДокументОбъект);
		ФормаНовогоДокумента.Открыть();

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РПартсВвестиЗамену(Команда)
	
	ТекСтрока = Элементы.ЗаявкиРПартс.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		
		Если Не ЗначениеЗаполнено(ТекСтрока.ЗаказПокупателя) Тогда
			Предупреждение("На основании заявки не введен заказ покупателя");
			Возврат;
		КонецЕсли;
		
		Замена = ВвестиЗаменуНаСервере(ТекСтрока.ЗаказПокупателя);
		ФормаНовогоДокумента = ПолучитьФорму(
			"Документ.ЗаменаВЗаказеПокупателя.ФормаОбъекта",
				Новый Структура("Ключ", Замена));
		ФормаНовогоДокумента.Открыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РПартсВвестиРеализацию(Команда)
	
	ТекСтрока = Элементы.ЗаявкиРПартс.ТекущиеДанные;

	Если ТекСтрока <> Неопределено Тогда

		Если Не ЗначениеЗаполнено(ТекСтрока.ЗаказПокупателя) Тогда
			Предупреждение("На основании заявки не введен заказ покупателя");
			Возврат;
		КонецЕсли;
		
		Реализация = ВвестиРеализациюНаСервере(ТекСтрока.ЗаказПокупателя);
		ФормаНовогоДокумента = ПолучитьФорму(
			"Документ.РеализацияТоваров.ФормаОбъекта",
				Новый Структура("Ключ", Реализация));
		ФормаНовогоДокумента.Открыть();

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РПартсЗакрытьЗаявку(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

