&НаКлиенте
Перем РезультатПолученияДопИнформации;
&НаКлиенте
Перем ФормаДлительнойОперации;
&НаКлиенте
Перем ПараметрыОбработчика;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьНаборПравПользователя();   
	НастройкаДоступностиФормы(Отказ);

	//Начальное заполнение
	Если Объект.Ссылка.Пустая() тогда
		ЗаполнитьРеквизитыФормыПоУмолчанию();
	иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_CRM_ЗаявкаНаСервис.ЗаказНаряд,
		|	Renault_CRM_ЗаявкаНаСервис.Ссылка
		|ИЗ
		|	Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ОбращениеВАвтоСервис КАК Renault_CRM_ОбращениеВАвтоСервис
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.DMS_ОбращениеКлиента КАК DMS_ОбращениеКлиента
		|			ПО Renault_CRM_ОбращениеВАвтоСервис.ЖалобаКлиента = DMS_ОбращениеКлиента.Ссылка
		|		ПО Renault_CRM_ЗаявкаНаСервис.Обращение = Renault_CRM_ОбращениеВАвтоСервис.Ссылка
		|ГДЕ
		|	DMS_ОбращениеКлиента.ЗКП = &ЗКП";
		Запрос.УстановитьПараметр("ЗКП", Объект.Ссылка);
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			Если ЗначениеЗаполнено(Выборка.ЗаказНаряд) Тогда
				ТекущийЗаказНаряд = Выборка.ЗаказНаряд;
			Иначе
				ТекущийЗаказНаряд = ВЫборка.ССылка;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	СписокЗаказНарядов.Параметры.УстановитьЗначениеПараметра("Автомобиль", Объект.Автомобиль);
	ЗаполнитьКонтактнуюИнформациюНаФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКартинкиИФайлы(Команда)
	
	Если Объект.Ссылка.Пустая() тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "Для продолжения ввода необходимо записать документ, 
		|Записать?";
		Ответ = Вопрос(Текст, Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			ЭтаФорма.Записать();
		КонецЕсли;
	КонецЕсли;
	
	ПриложитьФайлКДокументу();

КонецПроцедуры

&НаКлиенте
Процедура ПриложитьФайлКДокументу()
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		 ВыполнитьЗаписьДокумента();
	КонецЕсли;
	Отбор = Новый Структура();
	Отбор.Вставить("Объект", Объект.Ссылка);
	//Отбор.Вставить("Идентификатор", "");
	ФормаКартинок=РегистрыСведений.Renault_КартинкиИФайлы.ПолучитьФормуСписка(,ЭтаФорма);
	ФормаКартинок.ПараметрОтборПоИзмерению=Отбор;
	ФормаКартинок.Открыть();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗаписьДокумента()
	 ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	 ТекущийОбъект.Записать(РежимЗаписиДокумента.Запись);
	 ЗначениеВреквизитФормы(ТекущийОбъект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте()
	Результат = Новый Структура;
	Результат.Вставить("ФоновоеЗаданиеВыполнено", Ложь);
	Результат.ФоновоеЗаданиеВыполнено = Renault_ДлительныеОперации.ЗаданиеВыполнено(РезультатПолученияДопИнформации.ФоновоеЗаданиеИдентификатор);

	Если Результат.ФоновоеЗаданиеВыполнено Тогда
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = РезультатПолученияДопИнформации.ФоновоеЗаданиеИдентификатор Тогда
				Renault_ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		КонецЕсли;
		ОбработатьРезультатВыполненияЗадания();
		Иначе
		Renault_ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте", ПараметрыОбработчика.ТекущийИнтервал, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатВыполненияЗадания()
	сОтвет = ПолучитьИзВременногоХранилища(РезультатПолученияДопИнформации.АдресХранилища);
	Объект.ТранспортнаяКомпания = сОтвет.Контрагент;
	Объект.ДоговорПеревозчика = сОтвет.Договор;
	Элементы.ГруппаПеревозчики.ТекущаяСтраница = Элементы.ГруппаВводаПеревозчика;
КонецПроцедуры


&НаСервереБезКонтекста
Функция ДоступнаРоль(Роль);
	Возврат РольДоступна(Роль);
КонецФункции

&НаКлиенте
Процедура АвтомобильПриИзменении(Элемент)
	
	ЗаполнитьЗначенияСвойств(Объект,ПолучитьДанныеПоАвтомобилюНаСервере(Объект.Автомобиль, Объект.Дата));
	ОбновитьЗаказНаряды();
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаказНаряды ()
	СписокЗаказНарядов.Параметры.УстановитьЗначениеПараметра("Автомобиль", Объект.Автомобиль);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоАвтомобилюНаСервере(Автомобиль,ДатаДок)
	
	СтруктураДанных = Новый Структура();
	
	Если НачалоДня(Автомобиль.ДатаОкончанияГарантии) > ДатаДок тогда
		СтруктураДанных.Вставить("Гарантия",Истина);
	Иначе
		СтруктураДанных.Вставить("Гарантия",Ложь);
	КонецЕсли;
	
	СтруктураДанных.Вставить("Пробег",Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег));
	СтруктураДанных.Вставить("ГосНомер",Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер));
	СтруктураДанных.Вставить("VIN",Автомобиль.VIN);
	СтруктураДанных.Вставить("КомплектацияАвто",Автомобиль.ВариантКомплектации);
	СтруктураДанных.Вставить("Модель",Автомобиль.Модель);
	СтруктураДанных.Вставить("ДатаПродажиАвто",Автомобиль.ДатаНачалаГарантии);
	
	Возврат СтруктураДанных;
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиАвтомобильПоVINНаСервере(VIN)
	
	Возврат Справочники.Автомобили.НайтиПоРеквизиту("VIN",VIN);
	
КонецФункции

&НаКлиенте
Процедура VINПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Автомобиль) и ЗначениеЗаполнено(Объект.VIN) тогда
		Объект.Автомобиль = НайтиАвтомобильПоVINНаСервере(Объект.VIN);
		Если ЗначениеЗаполнено(Объект.Автомобиль) тогда
		 	ЗаполнитьЗначенияСвойств(Объект,ПолучитьДанныеПоАвтомобилюНаСервере(Объект.Автомобиль, Объект.Дата));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТелефонПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.Контрагент) и ЗначениеЗаполнено(Объект.Телефон)  тогда
		Объект.Контрагент = НайтиКлиентаПоТелефонуНаСервере(Объект.Телефон);
		ПриИзмененииКонтрагента();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
функция ПроверкаВыполнениеПросрочено(Действие,ДатаПланируемая, ДатаВыполнения)
	
	Если ЗначениеЗаполнено(Действие.ДлительностьДействия) тогда
	
		ДатаОкончания = ДатаПланируемая + Час(Действие.ДлительностьДействия) * 60 * 60 + Минута(Действие.ДлительностьДействия) * 60 + Секунда(Действие.ДлительностьДействия);	
		
		Если ДатаОкончания < ДатаВыполнения тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;	
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиКлиентаПоТелефонуНаСервере(Телефон)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	 Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ОсновнойТелефон ПОДОБНО &Телефон";
	
	Запрос.УстановитьПараметр("Телефон", "%"+Прав(Телефон,6)+"%");  // поиск по последним 6 цифрам номера
	
	Выборка= Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	иначе 
		//поищем в регистре контактная информация 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Объект
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Представление ПОДОБНО &Телефон
		|	И КонтактнаяИнформация.Тип = &Тип";
		
		Запрос.УстановитьПараметр("Телефон", "%"+Прав(Телефон,6)+"%");  // поиск по последним 6 цифрам номера
		Запрос.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.Телефон);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() тогда
			Возврат Выборка.Объект;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста 
Функция ВернутьСсылкуНаПраво(ИмяПрава)
	Возврат Справочники.DMS_ПраваРолейПоОбращениям[ИмяПрава];
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтатусОбращенияДляДействия(Действие, ТекСтатус)
	
	Если Действие = Справочники.DMS_ДействияПоОбращениям.НазначитьВизитКлиента 
		или Действие = Справочники.DMS_ДействияПоОбращениям.СвязатьсяСКлиентом
		или Действие = Справочники.DMS_ДействияПоОбращениям.РешитьВопросПоОбращению
		или Действие = Справочники.DMS_ДействияПоОбращениям.Согласовано
		тогда
		Возврат Перечисления.DMS_СтатусыОбращения.ВРаботе;
	ИначеЕсли Действие = Справочники.DMS_ДействияПоОбращениям.ЗакрытьОбращение тогда
		Возврат Перечисления.DMS_СтатусыОбращения.Решено;
	ИначеЕсли Действие = Справочники.DMS_ДействияПоОбращениям.СогласоватьОбращение тогда
		Возврат Перечисления.DMS_СтатусыОбращения.НаСогласовании;
	ИначеЕсли Действие = Справочники.DMS_ДействияПоОбращениям.НазначитьИсполнителя
		или Действие = Справочники.DMS_ДействияПоОбращениям.ВзятьВРаботу тогда
		Возврат Перечисления.DMS_СтатусыОбращения.Открыто;
	КонецЕсли;
	
	Возврат ТекСтатус;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьНаВозможностьИзмененияСтроки(НомерСтроки,Ссылка)
	
	Если НомерСтроки <= Ссылка.ДействияПоОбращению.Количество() тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;
 
КонецФункции

&НаСервереБезКонтекста
Функция ВернутьТекущегоСотрудника();
	
	Возврат Справочники.Пользователи.НайтиПоКоду(ПользователиИнформационнойБазы.ТекущийПользователь().Имя).Сотрудник;
	
КонецФункции

&НаСервере
Функция ПроверкаПрав()
		
	Возврат Ложь;	
	
КонецФункции

&НаСервере
Функция ДоступноПраво(НазваниеПрава) Экспорт
	
	ПараметрОтбора = Новый Структура("ИмяПрава","ПолныеПрава");
	Если НаборПравПользователя.НайтиСтроки(ПараметрОтбора).Количество() > 0 тогда 
		Возврат Истина;
	Иначе
		ПараметрОтбора = Новый Структура("ИмяПрава",НазваниеПрава);
		Если НаборПравПользователя.НайтиСтроки(ПараметрОтбора).Количество() > 0 тогда 
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура НастройкаДоступностиФормы(Отказ)
	
	Если ДоступноПраво("ПолныеПрава") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ДоступноПраво("ПравоНаПросмотр")
		и НЕ ДоступноПраво("ПравоНаРедактирование")
		тогда
		Сообщить("Недостаточно прав для создания и просмотра обращения клиента!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ДоступноПраво("ПравоНаПросмотр")
		и НЕ ДоступноПраво("ПравоНаРедактирование")
		тогда
		Если Объект.Ссылка.Пустая() тогда
			Сообщить("Недостаточно прав для создания обращения клиента");
 		 	Отказ = Истина;
			Возврат;
		иначе
			ЭтаФорма.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЭтаФорма.ТолькоПросмотр Тогда
	   Если Объект.СтатусЗапроса = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.Закрыто и НЕ ДоступноПраво("ПравоНаЗакрытие") тогда
			ЭтаФорма.ТолькоПросмотр = Истина;
			Элементы.ДействияПоОбращениюАРМ_Автосервис.Доступность = Ложь;
		КонецЕсли;   
	КонецЕсли;
	
	Элементы.ФормаОтправитьЗапрос.Доступность = ДоступноПраво("ПравоНаСогласование");
	
	//Если Не ЭтаФорма.ТолькоПросмотр Тогда
	//	Если Объект.ТипОбращения = Справочники.DMS_ТипыОбращений.Гарантия тогда
	//		ЭтаФорма.ТолькоПросмотр = НЕ ДоступноПраво("ТипОбращенияГарантия");
	//	ИначеЕсли Объект.ТипОбращения = Справочники.DMS_ТипыОбращений.Сервис тогда
	//		ЭтаФорма.ТолькоПросмотр = НЕ ДоступноПраво("ТипОбращенияСервис");
	//	ИначеЕсли Объект.ТипОбращения = Справочники.DMS_ТипыОбращений.Продажа тогда
	//		ЭтаФорма.ТолькоПросмотр = НЕ ДоступноПраво("ТипОбращенияПродажа");
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаборПравПользователя()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	DMS_ПраваИНастройкиПользователейОбращенияКлиентов.Право,
		|	DMS_ПраваИНастройкиПользователейОбращенияКлиентов.Право.Код КАК ИмяПрава
		|ИЗ
		|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК DMS_ПользователиИШаблоныПравИНастроек
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_ПраваИНастройкиПользователей.ОбращенияКлиентов КАК DMS_ПраваИНастройкиПользователейОбращенияКлиентов
		|		ПО DMS_ПользователиИШаблоныПравИНастроек.ПраваИНастройки = DMS_ПраваИНастройкиПользователейОбращенияКлиентов.Ссылка
		|			И (DMS_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь)
		|			И (DMS_ПраваИНастройкиПользователейОбращенияКлиентов.Доступность = ИСТИНА)
		|ГДЕ
		|	DMS_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Справочники.Пользователи.НайтиПоКоду(ПользователиИнформационнойБазы.ТекущийПользователь().Имя));
	
	НаборПравПользователя.Загрузить(Запрос.Выполнить().Выгрузить());
	Для Каждого стр из НаборПравПользователя цикл
		Стр.ИмяПрава = Справочники.DMS_ПраваРолейПоОбращениям.ПолучитьИмяПредопределенного(Стр.Право);
	КонецЦикла;

КонецПроцедуры


&НаСервереБезКонтекста
Функция ВернутьСписокКлиентовКонтрагента(Контрагент)
	
	СписокКлиентов = Новый СписокЗначений;
	СписокКлиентов.Добавить(Контрагент);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Renault_ПрофилиКлиентовКлиенты1.Клиент КАК Контрагент
		|ИЗ
		|	Справочник.Renault_ПрофилиКлиентов.Клиенты КАК Renault_ПрофилиКлиентовКлиенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_ПрофилиКлиентов.Клиенты КАК Renault_ПрофилиКлиентовКлиенты1
		|		ПО Renault_ПрофилиКлиентовКлиенты.Ссылка = Renault_ПрофилиКлиентовКлиенты1.Ссылка
		|ГДЕ
		|	Renault_ПрофилиКлиентовКлиенты.Клиент = &Клиент";
	
	Запрос.УстановитьПараметр("Клиент", Контрагент);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокКлиентов.Добавить(Выборка.Контрагент);
	КонецЦикла;
	
Возврат СписокКлиентов;	
	
КонецФункции

&НаКлиенте
Процедура АвтомобильНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Клиент", Объект.Контрагент);
	ОткрытьФорму("Документ.DMS_ОбращениеКлиента.Форма.ФормаВыбораАвтомобиля", ПараметрыОткрытия);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьКоличествоАвтомобилейКонтрагента(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АвтомобилиСрезПоследних.Автомобиль.Ссылка КАК Автомобиль
	               |ИЗ
	               |	РегистрСведений.Автомобили.СрезПоследних(, ) КАК АвтомобилиСрезПоследних
	               |ГДЕ
	               |	АвтомобилиСрезПоследних.ВидЗначения = &ВидЗначения
	               |	И АвтомобилиСрезПоследних.Значение В(&СписокКлиентов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	АвтомобилиСрезПоследних.Период УБЫВ";
				   
				   
	Запрос.УстановитьПараметр("СписокКлиентов", ВернутьСписокКлиентовКонтрагента(Контрагент));
	Запрос.УстановитьПараметр("ВидЗначения", Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин);
	
	
	Количество = Запрос.Выполнить().Выгрузить().Количество();
	Возврат Количество;
	

КонецФункции

&НаКлиенте
Процедура ЗаполнитьКоличествоАвтомобилейКонтрагента()
	Если ЗначениеЗаполнено(Объект.Контрагент) тогда
		КоличествоАвтомобилей = ВернутьКоличествоАвтомобилейКонтрагента(Объект.Контрагент);
		Если КоличествоАвтомобилей>0 тогда
			ЭтаФорма.Элементы.Автомобиль.Заголовок = "Автомобиль (" + Строка(КоличествоАвтомобилей)+") ";
		КонецЕсли;
	КонецЕсли;     	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКонтрагента()
	
	//Если ЗначениеЗаполнено(Объект.Контрагент) тогда
	//	ЗаполнитьЗначенияСвойств(Объект,ПолучитьДанныеКонтрагента(Объект.Контрагент));
	//	ЗаполнитьКоличествоАвтомобилейКонтрагента();
	//КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеКонтрагента(Контрагент)
	Возврат DMS_ОбращенияКлиентов.ПолучитьДанныеКонтрагентаНаСервере(Контрагент)
КонецФункции

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КлиентТелефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(Объект.Контрагент);
	КлиентEmail = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(Объект.Контрагент);
	КлиентАдрес = Renault_УправлениеКонтактнойИнформацией.АдресКлиента(Объект.Контрагент);

	ПриИзмененииКонтрагента();
	
КонецПроцедуры

&НаКлиенте
Функция ДоступноПравоНаКлиенте(НазваниеПрава);
	
	ПараметрОтбора = Новый Структура("ИмяПрава","ПолныеПрава");
	Если НаборПравПользователя.НайтиСтроки(ПараметрОтбора).Количество() = 1 тогда 
		Возврат Истина;
	Иначе
		ПараметрОтбора = Новый Структура("ИмяПрава",НазваниеПрава);
		Если НаборПравПользователя.НайтиСтроки(ПараметрОтбора).Количество() = 1 тогда 
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДействиеПоОбращениюНаСеревере(ИмяДействия);
	Возврат Справочники.DMS_ДействияПоОбращениям[ИмяДействия];
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыбранАвтомобиль" тогда
		Объект.Автомобиль = Параметр.Автомобиль;
		ЗаполнитьЗначенияСвойств(Объект,ПолучитьДанныеПоАвтомобилюНаСервере(Объект.Автомобиль, Объект.Дата));
	ИначеЕсли ИмяСобытия = "АвтомобильИзменен" тогда
		Если Объект.Автомобиль = Параметр тогда
			Объект.Автомобиль = Параметр;
			ЗаполнитьЗначенияСвойств(Объект,ПолучитьДанныеПоАвтомобилюНаСервере(Объект.Автомобиль, Объект.Дата));
		КонецЕсли;
		ЗаполнитьКоличествоАвтомобилейКонтрагента();	
	ИначеЕсли ИмяСобытия = "ОбновитьКИ_КЛ" тогда
		 ПриИзмененииКонтрагента();
	 ИначеЕсли ИмяСобытия = "ОбновитьСтатусЗКП" Тогда 
		  ЭтаФорма.ОбновитьОтображениеДанных();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	ЗаполнитьКоличествоАвтомобилейКонтрагента();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМаксСтоимость()
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	DMS_ПраваИНастройкиПользователей.Обращения_ПределСуммыОбращения КАК МаксСтоимость
	//	|ИЗ
	//	|	РегистрСведений.DMS_ПользователиИШаблоныПравИНастроек КАК DMS_ПользователиИШаблоныПравИНастроек
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.DMS_ПраваИНастройкиПользователей КАК DMS_ПраваИНастройкиПользователей
	//	|		ПО DMS_ПользователиИШаблоныПравИНастроек.ПраваИНастройки = DMS_ПраваИНастройкиПользователей.Ссылка
	//	|			И (DMS_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь)
	//	|ГДЕ
	//	|	DMS_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	//
	//Запрос.УстановитьПараметр("Пользователь", Справочники.Пользователи.НайтиПоКоду(ПользователиИнформационнойБазы.ТекущийПользователь().Имя));
	//
	//выборка = Запрос.Выполнить().Выбрать();
	//Если выборка.Следующий() тогда
	//	Возврат Выборка.МаксСтоимость;
	//КонецЕсли;
	//
	//Возврат 0;
	
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьПрофильКлиента(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	DMS_ПрофилиКлиентовКлиенты.Ссылка
		|ИЗ
		|	Справочник.DMS_ПрофилиКлиентов.Клиенты КАК DMS_ПрофилиКлиентовКлиенты
		|ГДЕ
		|	DMS_ПрофилиКлиентовКлиенты.Клиент = &Клиент";
	
	Запрос.УстановитьПараметр("Клиент", Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		НовыйПрофиль = Справочники.DMS_ПрофилиКлиентов.СоздатьЭлемент();
		Клиент = НовыйПрофиль.Клиенты.Добавить();
		Клиент.Клиент = Контрагент;
		НовыйПрофиль.Записать();
		Возврат	НовыйПрофиль.Ссылка;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПрофильКлиента(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОткрытьЗначение(ПолучитьПрофильКлиента(Объект.Контрагент));
 	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурналСобытий(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) тогда
		Отбор = новый Структура("РегистраторСобытия",Объект.Ссылка);
	 	П = Новый Структура();
		П.Вставить("Отбор",Отбор);
		ОткрытьФорму("РегистрСведений.dms_ЖурналСобытий.ФормаСписка",П);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьНаПодробности(Команда)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаПодробности;
КонецПроцедуры

&НаКлиенте
Процедура ИсторияОбщенияПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Сотрудник) тогда
		Элемент.ТекущиеДанные.Сотрудник = ВернутьТекущегоСотрудника();
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДатаСообщения) тогда
		Элемент.ТекущиеДанные.ДатаСообщения = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

//@++

&НаСервере
Процедура ЗаполнитьРеквизитыФормыПоУмолчанию()
	
	//BIRКод = Renault_ОбщийМодуль.ПолучитьBIRБазыДанных();
	Объект.Дата = ТекущаяДата();
	Объект.ТипКлиента = Перечисления.Renault_ТипыКлиентов.РозничныйКлиент;
	Объект.Приоритет = Справочники.DMS_Приоритет.Нормальный;
	Объект.СтатусЗапроса = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.ПодготовкаДилером;

	Объект.Ответственный = ПараметрыСеанса.Пользователь;
	ДЦ = Renault_CRM.ПолучитьДилерскийЦентрПользователя(ПараметрыСеанса.Пользователь);
	Объект.БизнесРегион = ДЦ.DMS_БизнесРегион;
		
	Если Объект.ЗапросДилераСумма > Объект.РекомендованнаяКоммерческаяПомощь Тогда
		Элементы.КоментарийПричинаУвелеченияСкидки.Видимость = Истина;
	КонецЕсли;
		
Конецпроцедуры

&НаСервере
Процедура ЗаполнитьКонтактнуюИнформациюНаФорме();

	Если ЗначениеЗаполнено(Объект.Контрагент) тогда
		КлиентТелефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(Объект.Контрагент);
		КлиентEmail = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(Объект.Контрагент);
		КлиентАдрес = Renault_УправлениеКонтактнойИнформацией.АдресКлиента(Объект.Контрагент);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СпециалистРено) тогда
		СпециалистРеноТелефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(Объект.СпециалистРено);
		СпециалистРеноEmail = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(Объект.СпециалистРено);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) тогда
		Объект.Ответственный =  ПараметрыСеанса.Пользователь
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.Ответственный.Сотрудник) тогда
		ОтветственныйТелефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(Объект.Ответственный.Сотрудник);
		ОтветственныйEmail = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(Объект.Ответственный.Сотрудник);
	КонецЕсли;
	
	ДЦ = Renault_CRM.ПолучитьДилерскийЦентрПользователя(ПараметрыСеанса.Пользователь);
	BIRКод = Лев(ДЦ.BIR,8);
	АдресДЦ = ДЦ.ОсновнойАдрес;	
	
Конецпроцедуры

&НаСервере
Функция СформироватьТекстСообщения()
	
	//ЗКП_<НомерДокументаОбращение>_<BIR Дилера>_<НазваниеДилера>_<ФИО_Клиента>
	//Символы.НПП разрыв
	
	//BIR = Renault_ОбщийМодуль.ПолучитьBIRБазыДанных();
	ДЦ = Renault_CRM.ПолучитьДилерскийЦентрПользователя(ПараметрыСеанса.Пользователь);
	BIR = ДЦ.BIR; 	
	ЗаголовокПисьма  = НСтр("ru='DMS_TEST_ЗКП_'")+"_"+Объект.Номер+"_"+BIR+"_"+ДЦ+"_"+Объект.Контрагент+"";
	СтрокаПисьма = Символы.ПС;
	СтрокаПисьма = СтрокаПисьма + "-----------------------------" + Символы.ПС;
	СтрокаПисьма = СтрокаПисьма + "Номер запроса: " + Объект.Номер + Символы.ПС;
	СтрокаПисьма = СтрокаПисьма + "Дата запроса: " + Объект.Дата + Символы.ПС;
	СтрокаПисьма = СтрокаПисьма + "Основание: " + Объект.ПричинаОбращения + Символы.ПС;
	СтрокаПисьма = СтрокаПисьма + "Регион: " + Объект.БизнесРегион + Символы.ПС;
	СтрокаПисьма = СтрокаПисьма + "BIR код: " + BIRКод + Символы.ПС;
	СтрокаПисьма = СтрокаПисьма + "Адрес ДЦ: " + АдресДЦ + Символы.ПС;
	
	СтрокаПисьма = СтрокаПисьма + "-----------------------------" + Символы.ПС;
	
	СтрокаПисьма = СтрокаПисьма + "Ответственный: " + Объект.Ответственный + Символы.ПС;
	СтрокаПисьма = СтрокаПисьма + "Ответственный телефон: " + ОтветственныйТелефон + Символы.ПС;
	СтрокаПисьма = СтрокаПисьма + "Ответственный email: " + ОтветственныйEmail + Символы.ПС;
	
	СтрокаПисьма = СтрокаПисьма + "-----------------------------" + Символы.ПС;
	
	СтрокаПисьма = СтрокаПисьма + "Клиент: " + Объект.Контрагент + Символы.ПС;
	СтрокаПисьма = СтрокаПисьма + "Клиент телефон: " + КлиентТелефон + Символы.ПС;
	СтрокаПисьма = СтрокаПисьма + "Клиент адрес: " + КлиентАдрес + Символы.ПС;
	СтрокаПисьма = СтрокаПисьма + "Клиент Email: " + КлиентEmail + Символы.ПС;
	СтрокаПисьма = СтрокаПисьма + "Адрес ДЦ: " + АдресДЦ + Символы.ПС;
	
	СтрокаПисьма = СтрокаПисьма + "-----------------------------" + Символы.ПС;

	СтрокаПисьма = СтрокаПисьма + "Автомобиль: " + Объект.Автомобиль + Символы.ПС;
	СтрокаПисьма = СтрокаПисьма + "VIN: " + Объект.VIN + Символы.ПС;
	СтрокаПисьма = СтрокаПисьма + "Модель: " + Объект.Модель + Символы.ПС;
	СтрокаПисьма = СтрокаПисьма + "Государственный номер: " + Объект.ГосНомер + Символы.ПС;
	
	СтрокаПисьма = СтрокаПисьма + "-----------------------------" + Символы.ПС;
	
	СтрокаПисьма = СтрокаПисьма + "Запрос дилера: " + Объект.ЗапросДилераСумма + Символы.ПС;
	
	ТекстСообщения = ЗаголовокПисьма  + СтрокаПисьма;
	Возврат ТекстСообщения;
	
КонецФункции

&НаСервере
Функция СформироватьТЗДляОтправки(Ссылка)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ЗапросНаКоммерческуюПомощь.Ссылка КАК Ссылка,
		|	Renault_ЗапросНаКоммерческуюПомощь.Номер КАК Number,
		|	Renault_ЗапросНаКоммерческуюПомощь.Дата КАК Datetime,
		|	Renault_ЗапросНаКоммерческуюПомощь.Контрагент.Наименование КАК Partner,
		|	Renault_ЗапросНаКоммерческуюПомощь.Автомобиль.Наименование КАК Auto,
		|	Renault_ЗапросНаКоммерческуюПомощь.ПричинаОбращения.Наименование КАК ReasonPetition,
		|	Renault_ЗапросНаКоммерческуюПомощь.Гарантия КАК Guarantee,
		|	Renault_ЗапросНаКоммерческуюПомощь.Пробег КАК Mileage,
		|	Renault_ЗапросНаКоммерческуюПомощь.ГосНомер КАК GovNumber,
		|	ПРЕДСТАВЛЕНИЕ(Renault_ЗапросНаКоммерческуюПомощь.ТипКлиента) КАК СustomerType,
		|	Renault_ЗапросНаКоммерческуюПомощь.Приоритет.Наименование КАК Priority,
		|	Renault_ЗапросНаКоммерческуюПомощь.VIN КАК VIN,
		|	ПРЕДСТАВЛЕНИЕ(Renault_ЗапросНаКоммерческуюПомощь.ОбращениеКлиента) КАК CustomerAppeal,
		|	Renault_ЗапросНаКоммерческуюПомощь.Модель.Наименование КАК Model,
		|	Renault_ЗапросНаКоммерческуюПомощь.КомплектацияАвто.Наименование КАК CarAccessories,
		|	Renault_ЗапросНаКоммерческуюПомощь.ЗапросДилераСумма КАК CostSolution,
		|	Renault_ЗапросНаКоммерческуюПомощь.Комментарий КАК Comment,
		|	Renault_ЗапросНаКоммерческуюПомощь.ПлатныеРемонты КАК PaidRepair,
		|	Renault_ЗапросНаКоммерческуюПомощь.ДатаПродажиАвто КАК DataCarSale,
		|	Renault_ЗапросНаКоммерческуюПомощь.СостояниеАвто КАК CarCondition,
		|	Renault_ЗапросНаКоммерческуюПомощь.ДатаОбращенияВДЦ КАК DateRefDealerCenter,
		|	Renault_ЗапросНаКоммерческуюПомощь.ФункциональныйКод КАК FuncCode,
		|	Renault_ЗапросНаКоммерческуюПомощь.РепутационныеРиски КАК RepRisks,
		|	Renault_ЗапросНаКоммерческуюПомощь.ЮридическиеРиски КАК LegRisks,
		|	Renault_ЗапросНаКоммерческуюПомощь.СпециалистРено.Наименование КАК RenaultSpecialist,
		|	Renault_ЗапросНаКоммерческуюПомощь.БизнесРегион.Наименование КАК BusinessRegion,
		|	ПРЕДСТАВЛЕНИЕ(Renault_ЗапросНаКоммерческуюПомощь.ПрохождениеТО) КАК PassingTO,
		|	Renault_ЗапросНаКоммерческуюПомощь.НаличиеДопОборудования КАК OptionalEquip,
		|	Renault_ЗапросНаКоммерческуюПомощь.ПовтороноеПриобретенияАвтоRenault КАК ReAcquisitionAuto,
		|	Renault_ЗапросНаКоммерческуюПомощь.СтоимостьРешенияПоГарантийнымРасценкам КАК CostSolutionGuarantee,
		|	Renault_ЗапросНаКоммерческуюПомощь.СтоимостьРешенияПоКоммерческимРасценкам КАК CostSolutionCommercial,
		|	Renault_ЗапросНаКоммерческуюПомощь.РекомендованнаяКоммерческаяПомощь КАК RecommendedCommercialAssistance,
		|	ПРЕДСТАВЛЕНИЕ(Renault_ЗапросНаКоммерческуюПомощь.СтатусЗапроса) КАК StatusRequest
		|ИЗ
		|	Документ.Renault_ЗапросНаКоммерческуюПомощь КАК Renault_ЗапросНаКоммерческуюПомощь
		|ГДЕ
		|	Renault_ЗапросНаКоммерческуюПомощь.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
	ПараметрыЗапроса = Новый Структура("TZ",Запрос.Выполнить().Выгрузить());
	//служебные параметры
	ПараметрыЗапроса.Вставить("BIR",BIRКод);
	ПараметрыЗапроса.Вставить("DatabaseUID", "" + ИмяКомпьютера() + "" + СтрокаСоединенияИнформационнойБазы() + "");   
	ПараметрыЗапроса.Вставить("GUID",Строка(Ссылка.УникальныйИдентификатор()));
	//контактная информация
	ПараметрыЗапроса.Вставить("PartnerEmail",КлиентТелефон);
	ПараметрыЗапроса.Вставить("PartnerTel", КлиентEmail);   		

	Возврат УпаковатьДанные(ПараметрыЗапроса);
	
КонецФункции

&Наклиенте
Функция ОтправитьHTTPЗапрос(Ответ,Сервер="localhost",ТипПакета, ПараметрыЗапроса, ЗащищенноеСоединение) 
	
	//Пользователь=Справочники.DMS_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ЛогинДоступаКВебСервисам;
	//Пароль=Справочники.DMS_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ПарольДоступаКВебСервисам;
	//
	//ЗаписьJSON=Новый ЗаписьJSON;
	//ЗаписьJSON.УстановитьСтроку();
	//ЗаписатьJSON(ЗаписьJSON,Значение);
	//value=ЗаписьJSON.Закрыть();

	//параметры в URL нельзя использовать из-за ограничения на длину URL
	//имя базы = dev3_gate
	//имя веб сервиса = traffic
	URL="/dev3_gate/hs/traffic/"+Сервер+"/"+ТипПакета+"/v1/msg";//+?(ПараметрыСтрокой()="","","?"+ПараметрыСтрокой());
	Заголовки=Новый Соответствие;
	Заголовки.Вставить("Content-Type","text/html; charset=UTF-8");
	
	//вычисление и создание объектов для защищенного соединения
	//User="Админ";
	//Pass="Админ";
	//Соединение=Новый HTTPСоединение("localhost",80,User,Pass,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Если ЗащищенноеСоединение Тогда
		Порт = 443;
		Защита = Новый ЗащищенноеСоединениеOpenSSL(
			Новый СертификатКлиентаWindows(СпособВыбораСертификатаWindows.Выбирать),
			Новый СертификатыУдостоверяющихЦентровWindows());
	Иначе
		Порт = 8080;
		Защита = Неопределено;
	КонецЕсли;

	Соединение = Новый HTTPСоединение("localhost",Порт,,,,,Защита); //89.108.111.89:55890
	
	Запрос = Новый HTTPЗапрос(URL,Заголовки);
	
	Запрос.УстановитьТелоИзСтроки(УпаковатьДанные(ПараметрыЗапроса));
	
	Попытка 
		ОтветСервера  = Соединение.ОтправитьДляОбработки(Запрос);
		Ответ = ОтветСервера.ПолучитьТелоКакСтроку();
	Исключение
		Сообщить("Не установлено соединение с сервисом "+ОписаниеОшибки(),СтатусСообщения.Информация);
		Возврат Ложь
	КонецПопытки;	
	
	Если ОтветСервера.КодСостояния=200 Тогда 
		Ответ=РаспаковатьДанные(Ответ); 
		Возврат Истина
	ИначеЕсли ОтветСервера.КодСостояния=400 Тогда Ответ="Не верный запрос. "+Ответ
	ИначеЕсли ОтветСервера.КодСостояния=404 Тогда Ответ="Ошибка при работе с ресурсом. "+Ответ
	ИначеЕсли ОтветСервера.КодСостояния=401 Тогда Ответ="Не авторизован. "+Ответ
	ИначеЕсли ОтветСервера.КодСостояния=500 Тогда Ответ="Внутренняя ошибка сервера. "+Ответ
	Иначе Ответ="Не удалось установить соединение с сервисом"
	КонецЕсли;
	
	Сообщить(Ответ,СтатусСообщения.Внимание);
	Возврат Ложь
КонецФункции	

&НаСервереБезКонтекста
Функция УпаковатьДанные(ПараметрыЗапроса)
	Если ПараметрыЗапроса.Свойство("zip") Тогда
		Возврат  "arc"+ЗначениеВСтрокуВнутр(Новый ХранилищеЗначения(ПараметрыЗапроса,Новый СжатиеДанных(ПараметрыЗапроса.zip)));
	Иначе //сжатие не применяется
		Возврат  ЗначениеВСтрокуВнутр(ПараметрыЗапроса);
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция РаспаковатьДанные(Ответ) 
	Возврат ЗначениеИзСтрокиВнутр(Ответ); 
КонецФункции

&НаСервере
Процедура ОтправитьEmailToCase()
	//@++ emailToCase
	ТекстСообщения = СформироватьТекстСообщения();
			
	BIR = Renault_ОбщийМодуль.ПолучитьBIRБазыДанных();

	ТаблицаСообщений = Новый ТаблицаЗначений;
	ТаблицаСообщений.Колонки.Добавить("Получатели");
	ТаблицаСообщений.Колонки.Добавить("ТекстСообщения");
	ТаблицаСообщений.Колонки.Добавить("BIR");
	ТаблицаСообщений.Колонки.Добавить("Тема");

					
	НоваяСтрока = ТаблицаСообщений.Добавить();
	НоваяСтрока.BIR = ?(ЗначениеЗаполнено(BIR),BIR,"99999999");
	НоваяСтрока.ТекстСообщения = ТекстСообщения;
	НоваяСтрока.Тема = "DMS_TEST";

		
	Получатели = Новый ТаблицаЗначений;
		
	Получатели.Колонки.Добавить("Адрес");	
	//СтрокаПолучатели = Получатели.Добавить();
	//СтрокаПолучатели.Адрес = "feedback-sf.russia@renault.com"; 

	//СтрокаПолучатели = Получатели.Добавить();
	//СтрокаПолучатели.Адрес = "anton.malanov@renault.com"; 
	//
	//СтрокаПолучатели = Получатели.Добавить();
	//СтрокаПолучатели.Адрес = "nikolay.dmitriev@renault.com"; 
	
	СтрокаПолучатели = Получатели.Добавить();
	СтрокаПолучатели.Адрес = "orfos_it@mail.ru"; 
	
	НоваяСтрока.Получатели = Получатели;
	
	Ответ = DMS_ВзаимодействияСКлиентом.ВыполнитьРассылкуПисем(ТаблицаСообщений);

	Объект.СтатусЗапроса = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.ЗапросОтправлен;

КонецПроцедуры

Функция ПолучитьВебСервис()
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	
	ПарольWS = Настройки.ПарольДоступаКВебСервисам;
	ЛогинWS = Настройки.ЛогинДоступаКВебСервисам;
	
	АдресWS = Настройки.КЦАдресСервера;
	СообщениеОбОшибке = "";
	
	ВСОпределение = Новый WSОпределения(СокрЛП(АдресWS) + "ws/ContactCenter.ws?wsdl",
									СокрЛП(ЛогинWS), СокрЛП(ПарольWS));
	
	ВебСервис = Новый WSПрокси(ВСОпределение, "http://renault-nissan.com/schema/ContactCenter", 
							   "Renault_ContactCenter", "Renault_ContactCenterSoap12",300);
	ВебСервис.Пользователь	 = СокрЛП(ЛогинWS);
	ВебСервис.Пароль		 = СокрЛП(ПарольWS);
	
	Возврат ВебСервис;
	
КонецФункции

&НаКлиенте
Процедура ОтправитьЗапросВКлиентскуюСлужбу(Команда)
	
	ОтправитьЗапросВКлиентскуюСлужбуНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ПроверитьНаОшибки ()
	
	Ответ = Истина;
	Если Не ЗначениеЗаполнено(КлиентEmail) ТОгда
		Сообщить("Не указан e-mail клиента, отправка невозможна");
		Возврат Ложь;
	КонецЕсли;
	
	Если не Объект.Проведен Тогда
		Сообщить("Перед отправкой ЗКП необходимо провести");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

&НаСервере
Процедура ОтправитьЗапросВКлиентскуюСлужбуНаСервере()
	Если не ПроверитьНаОшибки () Тогда
		Возврат;
	КонецЕсли;
	
	ОтветСервера="";
	
	ПараметрыЗапроса = СформироватьПараметрыЗапроса(Объект.Ссылка);
	
	ВремяНачала=ТекущаяДата();	
	
	Если не DMS_DataExchange.sendMessage(DMS_ОбщиеПовторныеФункции.ПараметрыHTTPСоединения(),,"ECARE_serv.addZKP",DMS_DataExchange.newPackage(ПараметрыЗапроса)) Тогда
		Сообщить("Ошибка при отправке ЗКП",СтатусСообщения.Внимание);
	КонецЕсли;
	
	Сообщить("Время выполнения "+(ТекущаяДата()-ВремяНачала)+" сек.");	
	Если НЕ ЗначениеЗаполнено(Объект.CaseStatus) Тогда
		Объект.СтатусЗапроса = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.ЗапросОтправлен;
	Иначе
		ОбновитьСтатусЗапросаНаСервере()
		//			ОбновитьЗначениеСтатусаЗапроса(ОтветСервера);
	КонецЕсли;
	Записать();
		
КонецПроцедуры

&НаСервере
Функция СформироватьПараметрыЗапроса(Ссылка)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ЗапросНаКоммерческуюПомощь.Номер КАК Number,
		|	Renault_ЗапросНаКоммерческуюПомощь.Дата КАК Datetime,
		|	Renault_ЗапросНаКоммерческуюПомощь.Контрагент.Наименование КАК Partner,
		|	Renault_ЗапросНаКоммерческуюПомощь.Автомобиль.Наименование КАК Auto,
		|	ПРЕДСТАВЛЕНИЕ(Renault_ЗапросНаКоммерческуюПомощь.ПричинаОбращения) КАК ReasonPetition,
		|	Renault_ЗапросНаКоммерческуюПомощь.Гарантия КАК Guarantee,
		|	Renault_ЗапросНаКоммерческуюПомощь.Пробег КАК Mileage,
		|	Renault_ЗапросНаКоммерческуюПомощь.ГосНомер КАК GovNumber,
		|	ПРЕДСТАВЛЕНИЕ(Renault_ЗапросНаКоммерческуюПомощь.ТипКлиента) КАК CustomerType,
		|	Renault_ЗапросНаКоммерческуюПомощь.Приоритет.Наименование КАК Priority,
		|	ВЫРАЗИТЬ(Renault_ЗапросНаКоммерческуюПомощь.VIN КАК СТРОКА(19)) КАК VIN,
		|	ПРЕДСТАВЛЕНИЕ(Renault_ЗапросНаКоммерческуюПомощь.ОбращениеКлиента) КАК CustomerAppeal,
		|	Renault_ЗапросНаКоммерческуюПомощь.Модель.Наименование КАК Model,
		|	Renault_ЗапросНаКоммерческуюПомощь.КомплектацияАвто.Наименование КАК CarAccessories,
		|	Renault_ЗапросНаКоммерческуюПомощь.ЗапросДилераСумма КАК CostSolution,
		|	Renault_ЗапросНаКоммерческуюПомощь.Комментарий КАК Comment,
		|	Renault_ЗапросНаКоммерческуюПомощь.ПлатныеРемонты КАК PaidRepair,
		|	Renault_ЗапросНаКоммерческуюПомощь.ДатаПродажиАвто КАК DataCarSale,
		|	Renault_ЗапросНаКоммерческуюПомощь.СостояниеАвто КАК CarCondition,
		|	Renault_ЗапросНаКоммерческуюПомощь.ДатаОбращенияВДЦ КАК DateRefDealerCenter,
		|	Renault_ЗапросНаКоммерческуюПомощь.ФункциональныйКод КАК FuncCode,
		|	Renault_ЗапросНаКоммерческуюПомощь.РепутационныеРиски КАК RepRisks,
		|	Renault_ЗапросНаКоммерческуюПомощь.ЮридическиеРиски КАК LegRisks,
		|	Renault_ЗапросНаКоммерческуюПомощь.СпециалистРено.Наименование КАК RenaultSpecialist,
		|	Renault_ЗапросНаКоммерческуюПомощь.БизнесРегион.Наименование КАК BusinessRegion,
		|	ПРЕДСТАВЛЕНИЕ(Renault_ЗапросНаКоммерческуюПомощь.ПрохождениеТО) КАК PassingTO,
		|	Renault_ЗапросНаКоммерческуюПомощь.НаличиеДопОборудования КАК OptionalEquip,
		|	Renault_ЗапросНаКоммерческуюПомощь.ПовтороноеПриобретенияАвто КАК ReAcquisitionAuto,
		|	Renault_ЗапросНаКоммерческуюПомощь.СтоимостьРешенияПоГарантийнымРасценкам КАК CostSolutionGuarantee,
		|	Renault_ЗапросНаКоммерческуюПомощь.СтоимостьРешенияПоКоммерческимРасценкам КАК CostSolutionCommercial,
		|	Renault_ЗапросНаКоммерческуюПомощь.РекомендованнаяКоммерческаяПомощь КАК RecommendedCommercialAssistance,
		|	ПРЕДСТАВЛЕНИЕ(Renault_ЗапросНаКоммерческуюПомощь.СтатусЗапроса) КАК StatusRequest,
		|	ПРЕДСТАВЛЕНИЕ(Renault_ЗапросНаКоммерческуюПомощь.ОщущениеКлиента) КАК CustomerExperience,
		|	ПРЕДСТАВЛЕНИЕ(Renault_ЗапросНаКоммерческуюПомощь.ПроблемнаяСистемаАвто) КАК CauseOfMalfunction,
		|	Renault_ЗапросНаКоммерческуюПомощь.ПроцентСкидкиICM КАК ICMDiscount,
		|	ПРЕДСТАВЛЕНИЕ(Renault_ЗапросНаКоммерческуюПомощь.ПожеланиеКлиента) КАК ClinentWish,
		|	Renault_ЗапросНаКоммерческуюПомощь.ЗапросДилераСумма КАК DealerRequset,
		|	Renault_ЗапросНаКоммерческуюПомощь.СогласованиеСТекЛайн КАК TechLineNegotiation
		|ИЗ
		|	Документ.Renault_ЗапросНаКоммерческуюПомощь КАК Renault_ЗапросНаКоммерческуюПомощь
		|ГДЕ
		|	Renault_ЗапросНаКоммерческуюПомощь.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
	ПараметрыЗапроса = Новый Структура("TZ",Запрос.Выполнить().Выгрузить());
	
	//!обязательный параметр	
	ПараметрыЗапроса.Вставить("zip", 9); 
	//служебные параметры
	ПараметрыЗапроса.Вставить("BIR",BIRКод);
	ПараметрыЗапроса.Вставить("DatabaseUID", "" + ИмяКомпьютера() + ";" + СтрокаСоединенияИнформационнойБазы() + "");   
	ПараметрыЗапроса.Вставить("GUID",Строка(Ссылка.УникальныйИдентификатор()));
	//контактная информация
	ПараметрыЗапроса.Вставить("PartnerEmail",КлиентEmail);
	ПараметрыЗапроса.Вставить("PartnerTel", КлиентТелефон);  
	//Вложение
	Attaches = Новый ТаблицаЗначений;
	Attaches.Колонки.Добавить("GUID_FILE");
	Attaches.Колонки.Добавить("FILENAME");
	Attaches.Колонки.Добавить("DESCRIPTION");
	Attaches.Колонки.Добавить("Data");
	
	Запрос = новый Запрос(
	"ВЫБРАТЬ
	|	КартинкиИФайлы.Идентификатор,
	|	КартинкиИФайлы.ИмяФайла,
	|	КартинкиИФайлы.ДатаСохранения,
	|	КартинкиИФайлы.Комментарий,
	|	КартинкиИФайлы.Данные КАК ХранилищеДанных,
	|	КартинкиИФайлы.Объект,
	|	КартинкиИФайлы.ИдентификаторФайла
	|ИЗ
	|	РегистрСведений.Renault_КартинкиИФайлы КАК КартинкиИФайлы
	|ГДЕ
	|	КартинкиИФайлы.Объект = &Объект"
	);
	Запрос.УстановитьПараметр("Объект", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		newRow = Attaches.Добавить();
		newRow.GUID_FILE = Строка(Выборка.ИдентификаторФайла);
		СтруктураИмениФайла = Renault_ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(Выборка.ИмяФайла);
		newRow.FILENAME = СтруктураИмениФайла.Имя;
		newRow.DESCRIPTION = Выборка.Комментарий;
		newRow.Data = Выборка.ХранилищеДанных;
	КонецЦикла;
	
	ТабДокумент = СформироватьТабличныйДокументЗКПНаСервере();

	ПрефиксБланка =  "Бланк_ЗКП_№";
	ИимяБланка = ПрефиксБланка + Ссылка.Номер+".XLS";
	ВременноеИмяФайла = КаталогВременныхФайлов()+ИимяБланка;	
	ТабДокумент.Записать(ВременноеИмяФайла,ТипФайлаТабличногоДокумента.XLS);
	ФайлXLS = Новый Файл(ВременноеИмяФайла);

	newRow = Attaches.Добавить();
	newRow.GUID_FILE = Строка(Ссылка.УникальныйИдентификатор());
	СтруктураИмениФайла = Renault_ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ФайлXLS.ПолноеИмя);
	newRow.FILENAME = СтруктураИмениФайла.Имя;
	newRow.DESCRIPTION = ИимяБланка;
	newRow.Data = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ФайлXLS.ПолноеИмя), Новый СжатиеДанных(9));

	
	ПараметрыЗапроса.Вставить("Attaches", Attaches); 

	Возврат ПараметрыЗапроса;
	
КонецФункции


&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	
	ОтветственныйТелефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(Объект.Ответственный.Сотрудник);
	ОтветственныйEmail = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(Объект.Ответственный.Сотрудник);

КонецПроцедуры

&НаКлиенте
Процедура СпециалистРеноПриИзменении(Элемент)
	СпециалистРеноТелефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(Объект.СпециалистРено);
	СпециалистРеноEmail = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(Объект.СпециалистРено);

КонецПроцедуры

&НаКлиенте
Процедура МодельНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТаблицаМоделей = Renault_CRM.ПолучитьТаблицуМоделей();
	Ответ = ТаблицаМоделей.ВыбратьСтроку("Выбор модели автомобиля");
	Если Ответ <> Неопределено Тогда
		Объект.Модель = Ответ.Модель;
		//ПриИзмененииМодели();
	КонецЕсли;
	

КонецПроцедуры


&НаКлиенте
Процедура ОбновитьСтатусЗапроса(Команда)
	ОбновитьСтатусЗапросаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусЗапросаНаСервере()
	
	ОтветСервера="";
	
	GUID_TZ = Новый ТаблицаЗначений;
	GUID_TZ.Колонки.Добавить("GUID");
	СтрокаТЗ = GUID_TZ.Добавить();
	СтрокаТЗ.GUID = Строка(Объект.Ссылка.УникальныйИдентификатор());
	
	ПараметрыЗапроса = Новый Структура("GUID_TZ,zip",GUID_TZ,9);
		
	ВремяНачала=ТекущаяДата();
		
	Ответ = Неопределено;
	Если  DMS_DataExchange.sendMessage(DMS_ОбщиеПовторныеФункции.ПараметрыHTTPСоединения(),,"ECARE_serv.readJournal",DMS_DataExchange.newPackage(ПараметрыЗапроса),Ответ) Тогда
		Если Ответ <> Неопределено Тогда
			
			ЗаполнитьЗначенияСвойств(Объект,Ответ,"CaseNumber,CaseStatus,DATE_MODIFIED");
			
			//Объект.СтатусЗапроса = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.РешениеПредоставлено;
			ОбновитьЗначениеСтатусаЗапроса(Ответ);
			
			Сообщить("Номер досье в системе RForce: "+Строка(Ответ.CaseNumber) ,СтатусСообщения.Информация);
			Сообщить("Статус досье в системе RForce: "+Строка(Ответ.CaseStatus) ,СтатусСообщения.Информация);
		Иначе
			Сообщить("Ответ от RForce не получен",СтатусСообщения.Информация);
		КонецЕсли;
	Иначе	
		Сообщить("Ошибка при обновлении информации по ЗКП",СтатусСообщения.Внимание);
	КонецЕсли;	
	
	Сообщить("Время выполнения "+(ТекущаяДата()-ВремяНачала)+" сек.");

КонецПроцедуры

&НаСервере
Процедура ОбновитьЗначениеСтатусаЗапроса(ОтветСервера);
	
	CaseStatus = ОтветСервера.CaseStatus;
	DealerProactivityExpected = ОтветСервера.DealerProactivityExpected;
	
	Если CaseStatus = "New" Тогда
		Объект.СтатусЗапроса = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.ЗапросОтправлен;
	ИначеЕсли CaseStatus = "Open" Тогда
		Если не ЗначениеЗаполнено(Объект.ДатаОткрытияДосье) Тогда
			Объект.ДатаОткрытияДосье = ТекущаяДата();
		КонецЕсли;
		Объект.СтатусЗапроса = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.ЗапросНаРассмотренииSRC;
	ИначеЕсли CaseStatus = "Waiting for reply" Тогда
		Объект.СтатусЗапроса = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.ВОжиданииОтветаДилера;
	ИначеЕсли CaseStatus = "Answered" Тогда
		Объект.СтатусЗапроса = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.ЗапросНаРассмотренииSRC;
	ИначеЕсли CaseStatus = "Resolved" Тогда
		Если ЗначениеЗаполнено(DealerProactivityExpected) Тогда
			Если DealerProactivityExpected Тогда
				Объект.DateResolved = ТекущаяДата();
				Объект.СтатусЗапроса = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.Одобрено;
			Иначе
				Объект.СтатусЗапроса = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.НеОдобрено;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли CaseStatus = "Closed" Тогда
		Если не ЗначениеЗаполнено(Объект.ДатаЗакрытияДосье) Тогда
			Объект.ДатаЗакрытияДосье = ТекущаяДата();
		КонецЕсли;
		Объект.СтатусЗапроса = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.Закрыто;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Отказ = ПроверитьКорректностьЗаполненияДокумента();
	//автоматически прикрепить бланк ЗКП к документу
	//ТабДокумент = СформироватьТабличныйДокументЗКПНаСервере();
	//СохранитьИПрикрепитьКДокументу(ТабДокумент);
КонецПроцедуры

&НаКлиенте
Функция ПроверитьКорректностьЗаполненияДокумента()
	
	Отказ = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.VIN) Тогда
		 Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле "+Символ(34)+"VIN"+Символ(34)+" не заполнено",,"VIN","Объект",Отказ);
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Модель) Тогда
		 Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле "+Символ(34)+"Модель"+Символ(34)+" не заполнено",,"Модель","Объект",Отказ);	 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Пробег) Тогда
		 Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле "+Символ(34)+"Пробег"+Символ(34)+" не заполнено",,"Пробег","Объект",Отказ);	 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ДатаПродажиАвто) Тогда
		 Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле "+Символ(34)+"Дата продажи авто"+Символ(34)+" не заполнено",,"ДатаПродажиАвто","Объект",Отказ);	 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ПричинаОбращения) Тогда
		 Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле "+Символ(34)+"Основание"+Символ(34)+" не заполнено",,"ПричинаОбращения","Объект",Отказ);	 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ОщущениеКлиента) Тогда
		 Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле "+Символ(34)+"Ощущение клиента (жалоба)"+Символ(34)+" не заполнено",,"ОщущениеКлиента","Объект",Отказ);	 
 	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ПроблемнаяСистемаАвто) Тогда
		 Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле "+Символ(34)+"Причина неисправности а/м"+Символ(34)+" не заполнено",,"ПроблемнаяСистемаАвто","Объект",Отказ);	 
 	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ПрохождениеТО) Тогда
		 Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле "+Символ(34)+"Прохождение ТО"+Символ(34)+" не заполнено",,"ПрохождениеТО","Объект",Отказ);	 
	
	//ИначеЕсли ЗначениеЗаполнено(Объект.СтоимостьРешения) Тогда
	//	 Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле "+Символ(34)+"Стоимость решения"+Символ(34)+" не заполнено",,,"ПричинаОбращения",Отказ);	 	 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.СтоимостьРешенияПоГарантийнымРасценкам) Тогда
		 Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле "+Символ(34)+"Стоимость решения по гарантийным расценкам"+Символ(34)+" не заполнено",,"СтоимостьРешенияПоГарантийнымРасценкам","Объект",Отказ);	 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.СтоимостьРешенияПоКоммерческимРасценкам) Тогда
		 Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле "+Символ(34)+"Стоимость решения по коммерческим расценкам"+Символ(34)+" не заполнено",,"СтоимостьРешенияПоКоммерческимРасценкам","Объект",Отказ);	 
		  		 
	КонецЕсли;
		
	Возврат Отказ;

	
КонецФункции

&НаСервере
Процедура СохранитьИПрикрепитьКДокументу(ТабДокумент)
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	БланкЗКПСохранен = ДокументОбъект.СохранитьИПрикрепитьКДокументу(ТабДокумент,Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПрохождениеТООбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Перечисления.Renault_ПрохождениеТО.ТОПроводилосьВДилерскойСети Тогда
		Если Вопрос("Необходимо приложить копии страниц о прохождении 2 последних ТО ",РежимДиалогаВопрос.ОКОтмена,15,КодВозвратаДиалога.ОК) = КодВозвратаДиалога.Отмена Тогда
			Элементы.ПрохождениеТО.ОтображениеПодсказки=ОтображениеПодсказки.ОтображатьСнизу;
			Элементы.ПрохождениеТО.Подсказка = "Проверьте вложения на наличие копий страниц о прохождении 2 последних ТО";
		Иначе
			ПриложитьФайлКДокументу()		
		КонецЕсли;

	Иначе
		Элементы.ПрохождениеТО.ОтображениеПодсказки=ОтображениеПодсказки.Нет;
		Элементы.ПрохождениеТО.Подсказка = "";
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПлатныеРемонтыПриИзменении(Элемент)

	Если Объект.ПлатныеРемонты Тогда
		Если Вопрос("Необходимо приложить подтверждающие документы ",РежимДиалогаВопрос.ОКОтмена,15,КодВозвратаДиалога.ОК) = КодВозвратаДиалога.Отмена Тогда
			Элементы.ПлатныеРемонты.ОтображениеПодсказки=ОтображениеПодсказки.ОтображатьСправа;
			Элементы.ПлатныеРемонты.Подсказка = "Проверьте вложения на наличие подтверждающих документов проведения платных ремонтов";
		Иначе
			ПриложитьФайлКДокументу()		
		КонецЕсли;

	Иначе
		Элементы.ПлатныеРемонты.ОтображениеПодсказки=ОтображениеПодсказки.Нет;
		Элементы.ПлатныеРемонты.Подсказка = "";
	КонецЕсли;
	
	 ОпределитьПроцентРекомендованнойКоммерческойПомощи();


КонецПроцедуры

&НаКлиенте
Процедура ЮридическиеРискиПриИзменении(Элемент)
	
	
	Если Объект.ЮридическиеРиски Тогда
		Если Вопрос("Необходимо приложить заключение юриста",РежимДиалогаВопрос.ОКОтмена,15,КодВозвратаДиалога.ОК) = КодВозвратаДиалога.Отмена Тогда
				Элементы.ЮридическиеРиски.ОтображениеПодсказки=ОтображениеПодсказки.ОтображатьСправа;
				Элементы.ЮридическиеРиски.Подсказка = "Проверьте вложения на наличие заключения юриста";
		Иначе
			ПриложитьФайлКДокументу()		
		КонецЕсли;

	Иначе
		Элементы.ЮридическиеРиски.ОтображениеПодсказки=ОтображениеПодсказки.Нет;
		Элементы.ЮридическиеРиски.Подсказка = "";
	КонецЕсли;
	
	ОпределитьПроцентРекомендованнойКоммерческойПомощи();


КонецПроцедуры

&НаКлиенте
Процедура СогласованиеСТекЛайнПриИзменении(Элемент)
	
	Если Объект.СогласованиеСТекЛайн Тогда
			Если Вопрос("Необходимо приложить скан КН из системы Актис",РежимДиалогаВопрос.ОКОтмена,15,КодВозвратаДиалога.ОК) = КодВозвратаДиалога.Отмена Тогда
				Элементы.СогласованиеСТекЛайн.ОтображениеПодсказки=ОтображениеПодсказки.ОтображатьСправа;
				Элементы.СогласованиеСТекЛайн.Подсказка = "Проверьте вложения на наличие скана КН из системы Актис";
			Иначе
				ПриложитьФайлКДокументу()
					
			КонецЕсли;
		//Элементы.СогласованиеСТекЛайн.ОтображениеПодсказки=ОтображениеПодсказки.ОтображатьСправа;
		//Элементы.СогласованиеСТекЛайн.Подсказка = "Приложите скан КН из системы Актис";
	Иначе
		Элементы.СогласованиеСТекЛайн.ОтображениеПодсказки=ОтображениеПодсказки.Нет;
		Элементы.СогласованиеСТекЛайн.Подсказка = "";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтоимостьРешенияПоКоммерческимРасценкамПриИзменении(Элемент)

	Если Объект.СтоимостьРешенияПоКоммерческимРасценкам < Объект.СтоимостьРешенияПоГарантийнымРасценкам Тогда
		Объект.СтоимостьРешенияПоКоммерческимРасценкам = 0;
        Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("«Стоимость ремонта по коммерческим расценкам» не может быть меньше «Стоимость ремонта по гарантийным расценкам».",,,"СтоимостьРешенияПоКоммерческимРасценкам");	 
		//Элементы.СтоимостьРешенияПоКоммерческимРасценкам.ОтображениеПодсказки=ОтображениеПодсказки.ОтображатьСнизу;
		//Элементы.СтоимостьРешенияПоКоммерческимРасценкам.Подсказка = "«Стоимость ремонта по коммерческим расценкам» не может быть меньше «Стоимость ремонта по гарантийным расценкам».";
	Иначе
		Элементы.СтоимостьРешенияПоКоммерческимРасценкам.ОтображениеПодсказки=ОтображениеПодсказки.Нет;
		//Элементы.СтоимостьРешенияПоКоммерческимРасценкам.Подсказка = "";
	КонецЕсли;

	 ОпределитьПроцентРекомендованнойКоммерческойПомощи();
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетСкидки(Команда)
	
	ОпределитьПроцентРекомендованнойКоммерческойПомощи();
		
КонецПроцедуры     

&НаСервере
Процедура ОпределитьПроцентРекомендованнойКоммерческойПомощи()
	
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаПродажиАвто) Тогда
		Отказ = Истина;
	    Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле "+Символ(34)+"Дата продажи"+Символ(34)+" не заполнено",,,"ДатаПродажиАвто",Отказ);	 
	КонецЕсли;
	
	Гарантия = Объект.Гарантия;	
	
	Если Гарантия Тогда
		МаксРазмерСкидки = 50;
	Иначе 
		МаксРазмерСкидки = 100;
	КонецЕсли;
			
	ВозрастАвто = (НачалоДня(ТекущаяДата()) - НачалоДня(Объект.ДатаПродажиАвто)) / (60 * 60 * 24);   // ОпределитьВозврастАвто(Объект.ДатаПродажиАвто,ТекущаяДата());
	ПробегАвто = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Объект.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег,ТекущаяДата());
	
	БаллыВозрастАвто = 0;
	БаллыПробегАвто = 0;
	БаллыДополнительные = 0;
	
	Если Гарантия Тогда
		
		Если ВозрастАвто >=0 И  ВозрастАвто <= 122 Тогда
			БаллыВозрастАвто = 50;	
		ИначеЕсли ВозрастАвто > 122 И ВозрастАвто <= 213.5 Тогда
			БаллыВозрастАвто = 45;
		ИначеЕсли ВозрастАвто > 213.5 И ВозрастАвто <= 305 Тогда
			БаллыВозрастАвто = 40;
	    ИначеЕсли ВозрастАвто > 305 И ВозрастАвто <= 395.5 Тогда
			БаллыВозрастАвто = 35;
		ИначеЕсли ВозрастАвто > 395.5 И ВозрастАвто <= 487 Тогда
			БаллыВозрастАвто = 30;
		ИначеЕсли ВозрастАвто > 395.5 И ВозрастАвто <= 609 Тогда
			БаллыВозрастАвто = 25;
		ИначеЕсли ВозрастАвто > 609 И ВозрастАвто <= 730 Тогда
			БаллыВозрастАвто = 20;
		ИначеЕсли ВозрастАвто > 730 И ВозрастАвто <= 852 Тогда
			БаллыВозрастАвто = 15;
		ИначеЕсли ВозрастАвто > 852 И ВозрастАвто <= 974 Тогда
			БаллыВозрастАвто = 10;
		ИначеЕсли ВозрастАвто > 974 Тогда
			БаллыВозрастАвто = 5;
		КонецЕсли;
		
	Иначе
		
		Если ВозрастАвто <= 1247.5 Тогда
			БаллыВозрастАвто = 100;
		ИначеЕсли ВозрастАвто > 1247.5 И ВозрастАвто <= 1369.5 Тогда
			БаллыВозрастАвто = 90;
		ИначеЕсли ВозрастАвто > 1369.5 И ВозрастАвто <= 1582 Тогда
			БаллыВозрастАвто = 80;
	    ИначеЕсли ВозрастАвто > 1582 И ВозрастАвто <= 1704 Тогда
			БаллыВозрастАвто = 70;
 		ИначеЕсли ВозрастАвто > 1704 И ВозрастАвто <= 1825 Тогда
			БаллыВозрастАвто = 60;
		ИначеЕсли ВозрастАвто > 1825 И ВозрастАвто <= 1947 Тогда
			БаллыВозрастАвто = 50;
		ИначеЕсли ВозрастАвто > 1947 И ВозрастАвто <= 2038.5 Тогда
			БаллыВозрастАвто = 40;
		ИначеЕсли ВозрастАвто > 2038.5 И ВозрастАвто <= 2130 Тогда
			БаллыВозрастАвто = 30;
		ИначеЕсли ВозрастАвто > 2130 И ВозрастАвто <= 2190 Тогда
			БаллыВозрастАвто = 20;
		ИначеЕсли ВозрастАвто > 2190 Тогда
			БаллыВозрастАвто = 10;
		КонецЕсли;

	КонецЕсли;
	
	Если Гарантия Тогда
		
		Если ПробегАвто <> Неопределено Тогда
			Если ПробегАвто <= 20000 Тогда
				БаллыПробегАвто = 50;
			ИначеЕсли ПробегАвто > 20000 И ПробегАвто <= 30000 Тогда
				БаллыПробегАвто = 45;
		    ИначеЕсли ПробегАвто > 30000 И ПробегАвто <= 40000 Тогда
				БаллыПробегАвто = 40;
			ИначеЕсли ПробегАвто > 40000 И ПробегАвто <= 50000 Тогда
				БаллыПробегАвто = 35;
			ИначеЕсли ПробегАвто > 50000 И ПробегАвто <= 60000 Тогда
				БаллыПробегАвто = 30;
			ИначеЕсли ПробегАвто > 60000 И ПробегАвто <= 70000 Тогда
				БаллыПробегАвто = 25;
			ИначеЕсли ПробегАвто > 70000 И ПробегАвто <= 80000 Тогда
				БаллыПробегАвто = 20;
			ИначеЕсли ПробегАвто > 80000 И ПробегАвто <= 90000 Тогда
				БаллыПробегАвто = 15;
			ИначеЕсли ПробегАвто > 90000 И ПробегАвто <= 100000 Тогда
				БаллыПробегАвто = 10;
			ИначеЕсли ПробегАвто > 100000 Тогда
				БаллыПробегАвто = 5;
			КонецЕсли;
		КонецЕсли;
			
	Иначе
		
		Если ПробегАвто <> Неопределено Тогда

			Если ПробегАвто <= 20000 Тогда
				БаллыПробегАвто = 100;
			ИначеЕсли ПробегАвто > 20000 И ПробегАвто <= 30000 Тогда
				БаллыПробегАвто = 90;
		    ИначеЕсли ПробегАвто > 30000 И ПробегАвто <= 40000 Тогда
				БаллыПробегАвто = 80;
			ИначеЕсли ПробегАвто > 40000 И ПробегАвто <= 50000 Тогда
				БаллыПробегАвто = 70;
			ИначеЕсли ПробегАвто > 50000 И ПробегАвто <= 60000 Тогда
				БаллыПробегАвто = 60;
			ИначеЕсли ПробегАвто > 60000 И ПробегАвто <= 70000 Тогда
				БаллыПробегАвто = 50;
			ИначеЕсли ПробегАвто > 70000 И ПробегАвто <= 80000 Тогда
				БаллыПробегАвто = 40;
			ИначеЕсли ПробегАвто > 80000 И ПробегАвто <= 90000 Тогда
				БаллыПробегАвто = 30;
			ИначеЕсли ПробегАвто > 90000 И ПробегАвто <= 100000 Тогда
				БаллыПробегАвто = 20;
			ИначеЕсли ПробегАвто > 100000 Тогда
				БаллыПробегАвто = 10;
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;
	
	Если Гарантия Тогда
		
		Если Объект.ПрохождениеТО = Перечисления.Renault_ПрохождениеТО.ТОПроводилосьВДилерскойСети Тогда			
			БаллыДополнительные = БаллыДополнительные + 20;
		ИначеЕсли  Объект.ПовтороноеПриобретенияАвто  Тогда
			БаллыДополнительные = БаллыДополнительные + 20;
		ИначеЕсли  Объект.НаличиеДопОборудования  Тогда
			БаллыДополнительные = БаллыДополнительные + 20;
		ИначеЕсли  Объект.НаличиеДопОборудования  Тогда
			БаллыДополнительные = БаллыДополнительные + 20;
		ИначеЕсли  Объект.ПлатныеРемонты  Тогда
			БаллыДополнительные = БаллыДополнительные + 20;
		ИначеЕсли  найти(Строка(Объект.Модель),"Megane")>0 
				   или найти(Строка(Объект.Модель),"Koleos")>0 
				   или найти(Строка(Объект.Модель),"Clio")>0       
				   или найти(Строка(Объект.Модель),"Latitude")>0 
				   или найти(Строка(Объект.Модель),"Scenic")>0  Тогда 
			БаллыДополнительные = БаллыДополнительные + 20;
		КонецЕсли;
		
	Иначе
		
		Если Объект.ПрохождениеТО = Перечисления.Renault_ПрохождениеТО.ТОПроводилосьВДилерскойСети Тогда			
			БаллыДополнительные = БаллыДополнительные + 10;
		ИначеЕсли  Объект.ПовтороноеПриобретенияАвто  Тогда
			БаллыДополнительные = БаллыДополнительные + 10;
		ИначеЕсли  Объект.НаличиеДопОборудования  Тогда
			БаллыДополнительные = БаллыДополнительные + 10;
		ИначеЕсли  Объект.НаличиеДопОборудования  Тогда
			БаллыДополнительные = БаллыДополнительные + 10;
		ИначеЕсли  Объект.ПлатныеРемонты  Тогда
			БаллыДополнительные = БаллыДополнительные + 10;
		ИначеЕсли  Найти(Объект.Модель,"Megane")>0 
				   или Найти(Объект.Модель,"Koleos")>0 
				   или Найти(Объект.Модель,"Clio")>0       
				   или Найти(Объект.Модель,"Latitude")>0 
				   или Найти(Объект.Модель,"Scenic")>0  Тогда 
			БаллыДополнительные = БаллыДополнительные + 10;
		КонецЕсли;
	
	КонецЕсли;

	ПроцентСкидки = (БаллыВозрастАвто + БаллыПробегАвто + БаллыДополнительные) /300;
	ПроцентРекомендованноцКоммерческойПомощи = ПроцентСкидки*100;
	

	Если Объект.СтоимостьРешенияПоКоммерческимРасценкам <> 0 Тогда
		Объект.РекомендованнаяКоммерческаяПомощь = ПроцентСкидки * Объект.СтоимостьРешенияПоГарантийнымРасценкам;
		Объект.СкидкаКлиента =  ((ПроцентСкидки * Объект.СтоимостьРешенияПоГарантийнымРасценкам)/Объект.СтоимостьРешенияПоКоммерческимРасценкам)*100;
		
	Иначе
	    Объект.РекомендованнаяКоммерческаяПомощь = 0;
		Объект.СкидкаКлиента = 0;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ОпределитьВозврастАвто(Дата1, Дата2)
	
	ДатаНач = ?(Дата1<Дата2, Дата1,Дата2);
	ДатаКон = ?(Дата1<Дата2, Дата2,Дата1);
	Годы = Год(ДатаКон) - Год(ДатаНач);
	Месяцы = Месяц(ДатаКон) - Месяц(ДатаНач);
	Если Месяцы <> 0 Тогда
		Разность = (Месяцы * 30.5) + (Годы * 12);
	Иначе
		Разность = (Месяцы + Годы * 12)*30.5;
	КонецЕсли;

	Возврат Разность;
 
КонецФункции

&НаКлиенте
Процедура СтоимостьРешенияПоГарантийнымРасценкамПриИзменении(Элемент)

	ОпределитьПроцентРекомендованнойКоммерческойПомощи();

	Если Объект.СтоимостьРешенияПоГарантийнымРасценкам <> 0 Тогда
		Если Вопрос("Необходимо приложить или обновить смету по гарантийным расценкам",РежимДиалогаВопрос.ОКОтмена,15,КодВозвратаДиалога.ОК) = КодВозвратаДиалога.Отмена Тогда
			Элементы.СтоимостьРешенияПоГарантийнымРасценкам.ОтображениеПодсказки=ОтображениеПодсказки.ОтображатьСправа;
			Элементы.СтоимостьРешенияПоГарантийнымРасценкам.Подсказка = "Проверьте вложения на наличие сметы по гарантийным расценкам";
		Иначе
			ПриложитьФайлКДокументу()
					
		КонецЕсли;
		//Элементы.СогласованиеСТекЛайн.ОтображениеПодсказки=ОтображениеПодсказки.ОтображатьСправа;
		//Элементы.СогласованиеСТекЛайн.Подсказка = "Приложите скан КН из системы Актис";
	Иначе
		Элементы.СтоимостьРешенияПоГарантийнымРасценкам.ОтображениеПодсказки=ОтображениеПодсказки.Нет;
		Элементы.СтоимостьРешенияПоГарантийнымРасценкам.Подсказка = "";
	КонецЕсли;

	//Если Объект.СтоимостьРешенияПоГарантийнымРасценкам > Объект.СтоимостьРешенияПоКоммерческимРасценкам Тогда
	//	Объект.СтоимостьРешенияПоГарантийнымРасценкам = 0;
	//    Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("«Стоимость ремонта по гарантийным расценкам» не может быть больше «Стоимости ремонта по коммерческим расценкам» .",,,"СтоимостьРешенияПоГарантийнымРасценкам");	 
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ГарантияПриИзменении(Элемент)
	 ОпределитьПроцентРекомендованнойКоммерческойПомощи()

КонецПроцедуры

&НаКлиенте
Процедура ПробегПриИзменении(Элемент)

	ОпределитьПроцентРекомендованнойКоммерческойПомощи()

КонецПроцедуры

&НаКлиенте
Процедура ПрохождениеТОПриИзменении(Элемент)

	ОпределитьПроцентРекомендованнойКоммерческойПомощи();

КонецПроцедуры

&НаКлиенте
Процедура ПовтороноеПриобретенияАвтоRenaultПриИзменении(Элемент)

	ОпределитьПроцентРекомендованнойКоммерческойПомощи();

КонецПроцедуры

&НаКлиенте
Процедура РепутационныеРискиПриИзменении(Элемент)

	ОпределитьПроцентРекомендованнойКоммерческойПомощи();

КонецПроцедуры

&НаКлиенте
Процедура НаличиеДопОборудованияПриИзменении(Элемент)

	ОпределитьПроцентРекомендованнойКоммерческойПомощи();

КонецПроцедуры

&НаКлиенте
Процедура МодельПриИзменении(Элемент)
	 ОпределитьПроцентРекомендованнойКоммерческойПомощи();

КонецПроцедуры

&НаКлиенте
Процедура ДатаПродажиАвтоПриИзменении(Элемент)

	ОпределитьПроцентРекомендованнойКоммерческойПомощи();

КонецПроцедуры

&НаКлиенте
Процедура СтоимостьРешенияПриИзменении(Элемент)
	Если Объект.ЗапросДилераСумма > Объект.РекомендованнаяКоммерческаяПомощь  Тогда
		 Элементы.КоментарийПричинаУвелеченияСкидки.Видимость = Истина;
		 Если НЕ Объект.СогласованиеСТекЛайн Тогда 
			Элементы.ЗапросДилераСумма.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
         Иначе
			Элементы.ЗапросДилераСумма.ОтображениеПодсказки=ОтображениеПодсказки.Нет;
		 КонецЕсли;
	Иначе
		 Элементы.КоментарийПричинаУвелеченияСкидки.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СформироватьТабличныйДокументЗКПНаСервере()
	//Возврат РеквизитФормыВЗначение("Объект").СформироватьТабличныйДокументЗКП(Объект.Ссылка);
	Возврат Документы.Renault_ЗапросНаКоммерческуюПомощь.СформироватьТабличныйДокументЗКП(Объект.Ссылка);
КонецФункции

&НаКлиенте
Процедура ПечатьБланкаЗКП(Команда)
	ТабДокумент = СформироватьТабличныйДокументЗКПНаСервере();
	НастроитьКолонтитулы(ТабДокумент);
	НастроитьПараметрыПечати(ТабДокумент);
	ТабДокумент.Показать("Бланк запроса на коммерческую помощь № " + Объект.Номер + " от " + Объект.Дата+"");
КонецПроцедуры

&НаКлиенте
Процедура НастроитьКолонтитулы(ПечатнаяФорма)
 
    ПечатнаяФорма.ВерхнийКолонтитул.Выводить = Истина;
    ПечатнаяФорма.ВерхнийКолонтитул.НачальнаяСтраница = 1;
    ПечатнаяФорма.ВерхнийКолонтитул.ТекстВЦентре = "Бланк запроса на коммерческую помощь";
    ПечатнаяФорма.ВерхнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
 
    ПечатнаяФорма.НижнийКолонтитул.Выводить = Истина;
    ПечатнаяФорма.НижнийКолонтитул.ТекстСправа = "[&НомерСтраницы] из [&СтраницВсего]";        
    ПечатнаяФорма.НижнийКолонтитул.ТекстВЦентре = "[&Дата][&Время]";
  
КонецПроцедуры
 
&НаКлиенте
Процедура НастроитьПараметрыПечати(ПечатнаяФорма)
 
    ПечатнаяФорма.МасштабПечати = 60; // 60%
    ПечатнаяФорма.АвтоМасштаб = Истина;
 
    ПечатнаяФорма.ПолеСлева = 10;
    ПечатнаяФорма.ПолеСверху = 10;
    ПечатнаяФорма.ПолеСправа = 10;
    ПечатнаяФорма.ПолеСнизу = 10;
 
    ПечатнаяФорма.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
    ПечатнаяФорма.ДвусторонняяПечать = ТипДвустороннейПечати.Нет;
    ПечатнаяФорма.ЭкземпляровНаСтранице = 1;
    ПечатнаяФорма.КоличествоЭкземпляров = 1;    
    ПечатнаяФорма.РазборПоКопиям = Истина;
    ПечатнаяФорма.ОтображатьСетку = Ложь;
    ПечатнаяФорма.ТолькоПросмотр = Истина;
    ПечатнаяФорма.ФиксацияСверху = 4;
    ПечатнаяФорма.ФиксацияСлева = 0;    
 
КонецПроцедуры

//@++ emailToCase
//ТекстСообщения = СформироватьТекстСообщения();
//			
//BIR = DMS_ОбщийМодуль.ПолучитьBIRБазыДанных();
//
//ТаблицаСообщений = Новый ТаблицаЗначений;
//ТаблицаСообщений.Колонки.Добавить("Получатели");
//ТаблицаСообщений.Колонки.Добавить("ТекстСообщения");
//ТаблицаСообщений.Колонки.Добавить("BIR");
//					
//НоваяСтрока = ТаблицаСообщений.Добавить();
//НоваяСтрока.BIR = ?(ЗначениеЗаполнено(BIR),BIR,"99999999");
//НоваяСтрока.ТекстСообщения = ТекстСообщения;
//		
//Получатели = Новый ТаблицаЗначений;
//		
//Получатели.Колонки.Добавить("Адрес");	
//СтрокаПолучатели = Получатели.Добавить();
//СтрокаПолучатели.Адрес = "orfos_it@mail.ru";
//НоваяСтрока.Получатели = Получатели;
//	
//DMS_ВзаимодействияСКлиентом.ВыполнитьРассылкуПисем(ТаблицаСообщений);
