Перем ДрайверОбъект Экспорт;
Перем ДрайверFTPОбъект Экспорт;
Перем ДрайверTDFa_Объект Экспорт;

Перем ДрайверWEB_Объект Экспорт;

Перем ВрФайлыДрайверов Экспорт;
Перем ВремИмяФайла;
Перем ВремИмяФайла_RCV;

Перем АвтоДокВерсия Экспорт;

#Если наКлиенте тогда
Процедура ПолучитьДрайвер(Драйвер, Маркер) 
	
	Если Драйвер = Неопределено тогда
		//Нужно получить драйвер из макета и создать объект
		
		ИмяМакета = "Драйвер" + Маркер;
		ДвоичныеДанныеДрайвера = ЭтотОбъект.ПолучитьМакет(ИмяМакета);
		
		//Сохраняем во временный файл
		ИмяВрФайлаДрайвера = ПолучитьИмяВременногоФайла("epf");
		ДвоичныеДанныеДрайвера.Записать(ИмяВрФайлаДрайвера);
		
		//Теперь подключаем обработку к системе
		Драйвер = ВнешниеОбработки.Создать(ИмяВрФайлаДрайвера);
		
		ВрФайлыДрайверов.Добавить(ИмяВрФайлаДрайвера);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыFTP()
	
	ДрайверFTPОбъект.ПутьКФайлу		= ВремИмяФайла;
	ДрайверFTPОбъект.ПутьКФайлу_RCV	= ВремИмяФайла_RCV;
	
	ДрайверFTPОбъект.МаскаФайла		= Настройка.МаскаФайла;
	ДрайверFTPОбъект.FTPСервер		= Настройка.FTPСервер;
	ДрайверFTPОбъект.FTPКаталог		= Настройка.FTPКаталог;
	ДрайверFTPОбъект.FTPЛогин		= Настройка.FTPЛогин;
	ДрайверFTPОбъект.FTPПароль		= Настройка.FTPПароль;
	ДрайверFTPОбъект.FTPПорт		= Настройка.FTPПорт;
	
	ДрайверFTPОбъект.ИспользоватьПрокси	= Настройка.ИспользоватьПрокси;
	ДрайверFTPОбъект.АдресПрокси		= Настройка.АдресПрокси;
	ДрайверFTPОбъект.ПортПрокси			= Настройка.ПортПрокси;
	ДрайверFTPОбъект.ЛогинПрокси		= Настройка.ЛогинПрокси;
	ДрайверFTPОбъект.ПарольПрокси		= Настройка.ПарольПрокси;
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыWEB()
	
	ДрайверWEB_Объект.АдресWEBСервиса	= Настройка.АдресWEBСервиса;
	ДрайверWEB_Объект.ЛогинWEBСервиса	= Настройка.ЛогинWEBСервиса;
	ДрайверWEB_Объект.ПарольWEBСервиса	= Настройка.ПарольWEBСервиса;
	ДрайверWEB_Объект.BIRДилера			= Настройка.BIRДилера;
	ДрайверWEB_Объект.ИдентификаторИБ	= Настройка.ИдентификаторИБ;
	
КонецПроцедуры

Процедура СоздатьТипФактуры(ТипФактурыСтр)
	
	СпрТипФактуры = Справочники.Renault_ТипыФактурFacturon.СоздатьЭлемент();
	
	СпрТипФактуры.УстановитьНовыйКод();
	СпрТипФактуры.Наименование = СокрЛП(ТипФактурыСтр.FactureType);
	СпрТипФактуры.Записать();
	
	ТипФактурыСтр.ТипФактуры = СпрТипФактуры.Ссылка;
	
КонецПроцедуры

Функция ПолучитьДанныеИзНастройки()
	
	//Получим двоичные данные из настройки
	ДДанные = Настройка.ФайлДанных.Получить();
	
	//Запишем во временный файл
	ДДанные.Записать(ВремИмяФайла);
	
	//Получим двоичные данные из настройки
	ДДанные = Настройка.ФайлДанных_RCV.Получить();
	
	//Запишем во временный файл
	ДДанные.Записать(ВремИмяФайла_RCV);
	
	
	//Передадим имя временного файла в файловый драйвер
	СтруктураОтвет = Новый Структура;
	СтруктураОтвет.Вставить("ПутьКФайлу", ВремИмяФайла);
	СтруктураОтвет.Вставить("ПутьКФайлу_RCV", ВремИмяФайла_RCV);
	
	Возврат СтруктураОтвет;

КонецФункции

Функция ПолучитьДанныеИзДрайвера() Экспорт
	
	Результат = Истина;
	
	Если Настройка = Справочники.Renault_НастройкиFacturon.ПустаяСсылка() тогда 
		Сообщить("Не выбрана настройка для получения данных.");
		возврат Ложь;
	КонецЕсли;
	
		
	//Основная обработка данных производится в файловом драйвере
	//остальные драйвера только получают файл с данными из спец. источника
	Попытка
		ПолучитьДрайвер(ДрайверWEB_Объект, "WEB");
		ЗаполнитьПараметрыWEB();
		Ответ = ДрайверWEB_Объект.ПолучитьДанные();
	Исключение 
		Сообщить(ОписаниеОшибки());
		Результат = Ложь;
		Возврат Результат;
	КонецПопытки;
	
	//Общее
	Если Результат тогда
				
		//Предварительно очистим таблицы 
		СообщенияОтRenault.Очистить();
		КомплектыДок.Очистить();
		Долги.Очистить();
		Лимиты.Очистить();
		Риски.Очистить();
		Претензии.Очистить();
		Пени.Очистить();
		ПениДетали.Очистить();
		ОтправленныеДокументы.Очистить();
		
		//Зполним таблицы из драйвера
		СообщенияОтRenault.Загрузить(ДрайверWEB_Объект.СообщенияRenault.Выгрузить());
		КомплектыДок.Загрузить(ДрайверWEB_Объект.КомплектыДок.Выгрузить());
		Долги.Загрузить(ДрайверWEB_Объект.Долги.Выгрузить());
		Лимиты.Загрузить(ДрайверWEB_Объект.Лимиты.Выгрузить());
		Риски.Загрузить(ДрайверWEB_Объект.Риски.Выгрузить());
		Претензии.Загрузить(ДрайверWEB_Объект.Претензии.Выгрузить());
		Пени.Загрузить(ДрайверWEB_Объект.Пени.Выгрузить());
		ПениДетали.Загрузить(ДрайверWEB_Объект.ПениДетали.Выгрузить());
		ОтправленныеДокументы.Загрузить(ДрайверWEB_Объект.ОтправленныеДокументы.Выгрузить());
				
		//Данные получили, теперь проверим оплаты 
		//Пересчет таблиц
		Для каждого строкаДолги Из Долги Цикл
			
			Если НЕ ЗначениеЗаполнено(СтрокаДолги.СуммаКОплате) тогда
				СтрокаДолги.СуммаКОплате = СтрокаДолги.AmountDue;
			КонецЕсли;
			
		КонецЦикла;
		
		ПроставитьОплаты();
		
		// Проставим виды фактур по справочнику.
		ТипыФактур = Долги.Выгрузить(,"FactureType,ТипФактуры");
		ТипыФактур.Свернуть("FactureType,ТипФактуры");
		
		Для каждого ТипФактурыСтр Из ТипыФактур Цикл
			ТипФактурыСпр = Справочники.Renault_ТипыФактурFacturon.НайтиПоНаименованию(СокрЛП(ТипФактурыСтр.FactureType), Ложь);
			Если ЗначениеЗаполнено(ТипФактурыСпр) тогда
				ТипФактурыСтр.ТипФактуры = ТипФактурыСпр;
			Иначе
				СоздатьТипФактуры(ТипФактурыСтр);
			КонецЕсли;
		КонецЦикла; 
		
		//Теперь проставляем типы Фактуры в табличную часть
		Для Каждого ТипФактурыСтр Из ТипыФактур Цикл
			Отбор = Новый Структура("FactureType", ТипФактурыСтр.FactureType);
			ВрТЗ = Долги.НайтиСтроки(Отбор);		
			Если НЕ ВрТЗ.Количество() = 0 тогда
				Для каждого строкаТЗ Из ВрТЗ Цикл
					СтрокаТЗ.ТипФактуры = ТипФактурыСтр.ТипФактуры;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Функция ЗаписатьИзмененияВНастройку()
	
	Результат = ложь;
	
	//Как показала практика, из ftp может возвращаться страница с ошибкой в качестве файла
	//Поэтому перед записью нужно проверить тип файла.
	ТекстовыйДок = Новый ТекстовыйДокумент;
	
	ТекстовыйДок.Прочитать(ВремИмяФайла);
	ТекстСтрока = ТекстовыйДок.ПолучитьТекст();
	
	//Если есть *S* значит все нормально
	Если Найти(ВРег(ТекстСтрока), "*S*") > 0 тогда
		//Получим двоичные данные файла источника
		Дданные = Новый ДвоичныеДанные(ВремИмяФайла);
		
		НастройкаОбъект = Настройка.ПолучитьОбъект();
		
		Сжатие = Новый СжатиеДанных(9);
		ВремХранилище = Новый ХранилищеЗначения(Дданные, Сжатие);
		
		//Запишем двоичные данные в настройку 
		НастройкаОбъект.ФайлДанных = ВремХранилище;
		
		//и дату загрузки
		НастройкаОбъект.ДатаПоследнейЗагрузки = ТекущаяДата();
		
		НастройкаОбъект.Записать();
		
		//Теперь нужно обновить Ссылку на измененную настройку
		Настройка = НастройкаОбъект.Ссылка;
		
		Результат = Истина;
	Иначе
		
		ФормаОшибки = ПолучитьФорму("ФормаОшибкиHtml");
		ФормаОшибки.Текстhtml = ТекстСтрока;
		ФормаОшибки.Открыть();
		
		Результат = Ложь;
	КонецЕсли;
	
	ТекстовыйДок.Прочитать(ВремИмяФайла_RCV);
	ТекстСтрока = ТекстовыйДок.ПолучитьТекст();
	
	//Если есть *S* значит все нормально
	Если Найти(ВРег(ТекстСтрока), "*S*") > 0 тогда
		//Получим двоичные данные файла источника
		Дданные = Новый ДвоичныеДанные(ВремИмяФайла_RCV);
		
		НастройкаОбъект = Настройка.ПолучитьОбъект();
		
		Сжатие = Новый СжатиеДанных(9);
		ВремХранилище = Новый ХранилищеЗначения(Дданные, Сжатие);
		
		//Запишем двоичные данные в настройку 
		НастройкаОбъект.ФайлДанных_RCV = ВремХранилище;
		
		//и дату загрузки
		НастройкаОбъект.ДатаПоследнейЗагрузкиRcv = ТекущаяДата();
		
		НастройкаОбъект.Записать();
		
		//Теперь нужно обновить Ссылку на измененную настройку
		Настройка = НастройкаОбъект.Ссылка;
		
		Результат = Истина;
	Иначе
		
		ФормаОшибки = ПолучитьФорму("ФормаОшибкиHtml");
		ФормаОшибки.Текстhtml = ТекстСтрока;
		ФормаОшибки.Открыть();
		
		Результат = Ложь;
	КонецЕсли;
	

	Возврат Результат;
	
КонецФункции

Процедура ПроставитьОплаты()
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Долги", Долги);
	
	//Долги во временные таблицы
	Запрос.Текст = "Выбрать * Поместить ВрДолги из &Долги как Долги";
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВрДолги.NumDoc,
	|	ВрДолги.VIN_PRinvoice,
	|	ВрДолги.DateFacture
	|ПОМЕСТИТЬ ВремТаб
	|ИЗ
	|	ВрДолги КАК ВрДолги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТаб.NumDoc КАК NumDoc,
	|	ВремТаб.VIN_PRinvoice КАК VIN_PRinvoice,
	|	ОплатыВАФМ.ПлатежноеПоручение,
	|	СУММА(ОплатыВАФМ.СуммаПлатежа) КАК СуммаОплаченная
	|ИЗ
	|	ВремТаб КАК ВремТаб
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ОплатыВАФМ КАК ОплатыВАФМ
	|		ПО ВремТаб.NumDoc = ОплатыВАФМ.НомерДокумента
	|			И ВремТаб.DateFacture = ОплатыВАФМ.ДатаДокумента
	|			И ВремТаб.VIN_PRinvoice = ОплатыВАФМ.VIN
	|ГДЕ
	|	(НЕ ОплатыВАФМ.ПлатежноеПоручение ЕСТЬ NULL )
	|	И ОплатыВАФМ.ПлатежноеПоручение.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыВАФМ.ПлатежноеПоручение,
	|	ВремТаб.VIN_PRinvoice,
	|	ВремТаб.NumDoc
	|ИТОГИ
	|	СУММА(СуммаОплаченная)
	|ПО
	|	NumDoc,
	|	VIN_PRinvoice
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремТаб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВрДолги";
	
	Результат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Для Каждого СтрокаНомерДок из Результат.Строки Цикл //Уровень - Номер документа
		Для каждого СтрокаVIN из СтрокаНомерДок.Строки Цикл //Уровень - VIN
			
			Отбор = Новый Структура;
			Отбор.Вставить("NumDoc",СтрокаVIN.NumDoc);
			Отбор.Вставить("VIN_PRinvoice",СтрокаVIN.VIN_PRinvoice);
			
			//По сути, отобранная строка должна быть только одна
			ОтобранныеСтроки = Долги.НайтиСтроки(Отбор);
			
			Для Каждого ОтобраннаяСтрока из ОтобранныеСтроки Цикл
				ОтобраннаяСтрока.СуммаОплаченная = СтрокаVIN.СуммаОплаченная;
				ОтобраннаяСтрока.ПлатежноеПоручение = СтрокаVin.Строки[0].ПлатежноеПоручение;
				//Нужно просчитать сумму к оплате
				ОтобраннаяСтрока.СуммаКОплате = 
							ОтобраннаяСтрока.AmountTotal - (ОтобраннаяСтрока.СуммаОплаченная + ОтобраннаяСтрока.Payed_amount);
				
				//Установим признак нескольких платежей
				ОтобраннаяСтрока.СписокПлатежей = СтрокаVIN.Строки.Количество() > 1;
				
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
	// Комментарий 
	//Дата создания - 28.04.2012 10:47:02; Автор - Администратор
	//Теперь проставим оплаты в таблицу Пеней
	//
	
	Запрос.Текст = "Выбрать * поместить ВрПени из &Пени как Пени";
	Запрос.УстановитьПараметр("Пени", Пени);
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВрПени.Invoice,
	|	ВрПени.OperationType,
	|	ВрПени.PeriodFrom,
	|	ВрПени.PeriodTo,
	|	ВрПени.Amount,
	|	ВрПени.InvoiceDate,
	|	ВрПени.PeriodAccount,
	|	ВрПени.FineTaxed,
	|	ВрПени.FineDetaxed,
	|	ВрПени.ПлатежноеПоручение,
	|	ВрПени.СуммаКОплате,
	|	ВрПени.NumberInvoice,
	|	ВрПени.Оплачено
	|ПОМЕСТИТЬ ВремТаб
	|ИЗ
	|	ВрПени КАК ВрПени
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОплатыПенейВАФМ.ПлатежноеПоручение,
	|	ОплатыПенейВАФМ.НомерДокумента
	|ПОМЕСТИТЬ ВремРегистр
	|ИЗ
	|	РегистрСведений.Renault_ОплатыПенейВАФМ КАК ОплатыПенейВАФМ
	|ГДЕ
	|	ОплатыПенейВАФМ.ПлатежноеПоручение.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТаб.Invoice,
	|	ВремТаб.OperationType,
	|	ВремТаб.PeriodFrom,
	|	ВремТаб.PeriodTo,
	|	ВремТаб.Amount,
	|	ВремТаб.InvoiceDate,
	|	ВремТаб.PeriodAccount,
	|	ВремТаб.FineTaxed,
	|	ВремТаб.FineDetaxed,
	|	ВремТаб.СуммаКОплате,
	|	ВремТаб.NumberInvoice,
	|	ВЫБОР
	|		КОГДА ВремРегистр.ПлатежноеПоручение ЕСТЬ NULL 
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ПлатежноеПоручение.ПустаяСсылка)
	|		ИНАЧЕ ВремРегистр.ПлатежноеПоручение
	|	КОНЕЦ КАК ПлатежноеПоручение,
	|	ВЫБОР
	|		КОГДА ВремРегистр.ПлатежноеПоручение ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Оплачено
	|ИЗ
	|	ВремТаб КАК ВремТаб
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремРегистр КАК ВремРегистр
	|		ПО ВремТаб.Invoice = ВремРегистр.НомерДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремРегистр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремТаб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВрПени";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Пени.Загрузить(Результат);
КонецПроцедуры

Функция ПолучитьСписокНеЗаполненныхРеквизитов() Экспорт
	
	СтруктураНеЗаполненныхРеквизитов = Новый Структура;
	
	Для каждого Реквизит Из ЭтотОбъект.Метаданные().Реквизиты Цикл
	
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект[Реквизит.Имя]) ТОгда
			СтруктураНеЗаполненныхРеквизитов.Вставить(Реквизит.Имя, Реквизит.Синоним);
		КонецЕсли;
	КонецЦикла; 
	
	Возврат СтруктураНеЗаполненныхРеквизитов;
КонецФункции

Функция СформироватьТаблицуПлатежей() Экспорт
	
	ОплатаЗЧ		 = ложь;
	ОплатаДокументов = Ложь;
	ОплатаМашин		 = Ложь;
	ДокументовБольшеОдного = Ложь;
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.Текст = "ВЫБРАТЬ *
	|	
	|ПОМЕСТИТЬ ВремДолги
	|ИЗ
	|	&Долги КАК Долги";
	
	Запрос.УстановитьПараметр("Долги", Долги);
	
	//Долги во временную таблицу
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ *
	|	
	|ПОМЕСТИТЬ ВремПени
	|ИЗ
	|	&Пени КАК Пени";
	
	Запрос.УстановитьПараметр("Пени", Пени);
	
	//Пени во временную таблицу
	Запрос.Выполнить();
	
	//Теперь отбираем данные по документам - каждый документ это отдельная платежка
	Запрос.Текст = "ВЫБРАТЬ
	|	НастройкиFacturonТабПараметрыПлатежа.ТипФактуры,
	|	НастройкиFacturonТабПараметрыПлатежа.ПараметрыПлатежа
	|ПОМЕСТИТЬ параметры
	|ИЗ
	|	Справочник.Renault_НастройкиFacturon.ТабПараметрыПлатежа КАК НастройкиFacturonТабПараметрыПлатежа
	|ГДЕ
	|	НастройкиFacturonТабПараметрыПлатежа.Ссылка.Ссылка = &Настройка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремДолги.NumDoc КАК НомерДокумента,
	|	ВремДолги.DateFacture КАК ДатаДокумента,
	|	МАКСИМУМ(ВремДолги.ТипФактуры) КАК ТипФактуры,
	|	СУММА(ВремДолги.СуммаКОплате) КАК СуммаПлатежа,
	|	ВЫБОР
	|		КОГДА ВремДолги.VinModel = ""НД""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоЗЧ,
	|	параметры.ПараметрыПлатежа
	|ИЗ
	|	ВремДолги КАК ВремДолги
	|		ЛЕВОЕ СОЕДИНЕНИЕ параметры КАК параметры
	|		ПО ВремДолги.ТипФактуры = параметры.ТипФактуры
	|ГДЕ
	|	ВремДолги.ОплатаДокумента = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ВремДолги.NumDoc,
	|	ВремДолги.DateFacture,
	|	ВЫБОР
	|		КОГДА ВремДолги.VinModel = ""НД""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	параметры.ПараметрыПлатежа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ параметры";
	
	Запрос.УстановитьПараметр("Настройка", Настройка);
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	ОплатаДокументов = ТаблицаДокументов.Количество() > 0;
	ДокументовБольшеОдного = ТаблицаДокументов.Количество() > 1;
	
	Отбор = Новый Структура("ЭтоЗЧ", Истина);
	ДокументыЗЧ = ТаблицаДокументов.НайтиСтроки(Отбор);
	
	ОплатаЗЧ = ДокументыЗЧ.Количество() > 0;
	
	//Отбтираем строки
	Запрос.Текст = "ВЫБРАТЬ
	|	НастройкиFacturonТабПараметрыПлатежа.ТипФактуры,
	|	НастройкиFacturonТабПараметрыПлатежа.ПараметрыПлатежа
	|ПОМЕСТИТЬ параметры
	|ИЗ
	|	Справочник.Renault_НастройкиFacturon.ТабПараметрыПлатежа КАК НастройкиFacturonТабПараметрыПлатежа
	|ГДЕ
	|	НастройкиFacturonТабПараметрыПлатежа.Ссылка.Ссылка = &Настройка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремДолги.VIN_PRinvoice КАК VIN,
	|	ВремДолги.NumDoc КАК НомерДокумента,
	|	ВремДолги.DateFacture КАК ДатаДокумента,
	|	ВремДолги.ТипФактуры КАК ТипФактуры,
	|	СУММА(ВремДолги.СуммаКОплате) КАК СуммаПлатежа,
	|	параметры.ПараметрыПлатежа КАК ПараметрыПлатежа
	|ИЗ
	|	ВремДолги КАК ВремДолги
	|		ЛЕВОЕ СОЕДИНЕНИЕ параметры КАК параметры
	|		ПО ВремДолги.ТипФактуры = параметры.ТипФактуры
	|ГДЕ
	|	ВремДолги.ОплатаСтроки = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ВремДолги.VIN_PRinvoice,
	|	ВремДолги.NumDoc,
	|	ВремДолги.DateFacture,
	|	параметры.ПараметрыПлатежа,
	|	ВремДолги.ТипФактуры
	|ИТОГИ
	|	МАКСИМУМ(ТипФактуры),
	|	СУММА(СуммаПлатежа)
	|ПО
	|	НомерДокумента,
	|	ПараметрыПлатежа,
	|	VIN
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ параметры";
	
	Запрос.УстановитьПараметр("Настройка", Настройка);
	ДеревоМашин = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОплатаМашин = ДеревоМашин.Строки.Количество() > 0;
	
	//Формируем платежи по документам
	ТаблицаПлатежей = ТаблицаДокументов;
	СформироватьПлатежныеПорученияПоДокументам(ТаблицаПлатежей, Истина, Истина);
	
	//Формируем платежи по строкам
	ДеревоПлатежей = ДеревоМашин;
	СформироватьПлатежныеПорученияПоСтрокам(ДеревоПлатежей, Истина, Истина);
	
	//Уничтожаем временные таблицы
	Запрос.Текст = "Уничтожить ВремДолги; Уничтожить ВремПени";
	Запрос.Выполнить();
	
	МВТ = Неопределено;
	
	//После формирования документов нужно обновить отображение таблиц
	ПолучитьДанныеИзДрайвера();
	
КонецФункции

// Функция получает таблицу платежей и формирует платежное поручение
//
// Параметры
//  ТаблицаПлатежей  - ТаблицаЗначений - Таблица с собранными платежами
//
//  НесколькоПлатежей  - Булево - Флаг нескольких платежей
//
//  СписокНазначений - СписокЗначений - Список назначений платежей.
//   По этому списку подбираются макеты назначений платежей
//
// Возвращаемое значение:
//   Ссылка на платежное поручение
//
Функция СформироватьПлатежныеПорученияПоДокументам(ТаблицаПлатежей, НесколькоПлатежей = Ложь, СписокНазначений = Неопределено)

	ЭтоДокументы = НЕ ТаблицаПлатежей.Колонки.Найти("ЭтоЗЧ") = неопределено;
	
	Для каждого Платеж Из ТаблицаПлатежей Цикл
		
		
		//Проверка на наличие параметров платежа
		//Если НЕ ЗначениеЗаполнено(ПараметрыПлатежа) тогда
		//	Сообщить("Для типа фактурирования """ + Платеж.ТипФактуры + " не указаны параметры платежа! Документ пропущен." );
		//	Продолжить;
		//КонецЕсли;
		
		//ПлПоручение = Документы.ПлатежноеПоручение.СоздатьДокумент();
		
		//Получаем новый документ платежное поручение
		ПлПоручение = СформироватьНовоеПлатежноеПоручение(Платеж);
		// { DMSREN-1318
		если ПлПоручение = Неопределено тогда
			Продолжить;
		КонецЕсли;
		// DMSREN-1318 }
		ПараметрыПлатежа = ?(Настройка.ОплатаПоУсловиям, Платеж.ПараметрыПлатежа,Настройка.ПараметрыПлатежа);
		
		//Заполняем реквизиты
		//ПлПоручение.Организация			 = ПараметрыПлатежа.ОрганизацияПлательщик;
		//ПлПоручение.ИННПлательщика		 = ПараметрыПлатежа.ОрганизацияПлательщик.ИНН;
		//ПлПоручение.КПППлательщика		 = ПараметрыПлатежа.ОрганизацияПлательщик.КПП;
		//ПлПоручение.СчетОрганизации		 = ПараметрыПлатежа.РасчетныйСчетОрганизации;
		//
		//ПлПоручение.Контрагент			 = ПараметрыПлатежа.ПолучательПлатежа;
		//ПлПоручение.ИННПолучателя			 = ПараметрыПлатежа.ПолучательПлатежа.ИНН;
		//ПлПоручение.КПППолучателя			 = ПараметрыПлатежа.ПолучательПлатежа.КПП;
		//ПлПоручение.СчетКонтрагента		 = ПараметрыПлатежа.РасчетныйСчетПолучателя;
		//ПлПоручение.ДоговорКонтрагента	 = ПараметрыПлатежа.ДоговорПолучателя;
		//
		//ПлПоручение.СтатьяДвиженияДенежныхСредств = ПараметрыПлатежа.СтатьяДДС;
		//
		//ПлПоручение.ВидПлатежа			 = "Электронно";
		//ПлПоручение.ОчередностьПлатежа	 = 6;
		
		ПлПоручение.СуммаДокумента		 = Платеж.СуммаПлатежа;
		ПлПоручение.СтавкаНДС			 = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
		//Расчитаем НДС
		//ПлПоручение.ПересчитатьСуммуНДС();
		
		//Формируем назначение платежа
		ТекстНазначения = Новый ТекстовыйДокумент;
		//Получаем соответствующий макет
		
		Макет = ?(ЭтоДокументы, 
					?(Платеж.ЭтоЗЧ, 
						ЭтотОбъект.ПолучитьМакет("НазначениеЗЧ"), 
						ЭтотОбъект.ПолучитьМакет("НазначениеДокументАвтомобиль")),
					ЭтотОбъект.ПолучитьМакет("НазначениеАвтомобильСтрока"));
		
		Если Платеж.ЭтоЗЧ тогда //Макет Запчати
			Макет.Параметры.НомерДоговора = СокрЛП(ПараметрыПлатежа.НомерДилерскогоДоговора);
			Макет.Параметры._ДатаДог	  = СокрЛП(Формат(ПараметрыПлатежа.ДатаДилерскогоДоговора, "ДФ=dd.MM.yyyy"));
			Макет.Параметры.СуммаНДС	  = ПлПоручение.СуммаНДС;
			ТекстНазначения.Вывести(Макет);
		Иначе
			
			НомерДок = Платеж.НомерДокумента;
			
			//Для отфактурованных автомобилей нужно поменять номер документа 
			//Признак фактуры буква F
			
			//%+ Дата изменения - 03.05.2012 17:20:53; Автор - Администратор
			//
			// Описание изменений
			//  Изменен формат номера документа
			//
			//%-
			//Если Найти(ВРег(НомерДок),"F") тогда НомерДок = "F-" + СтрЗаменить(ВРег(НомерДок),"F",""); КонецЕсли;
			
			Макет.Параметры.МаскаНомерДок = "##"+НомерДок;
			Макет.Параметры.ДатаДок = Формат(Платеж.ДатаДокумента,"ДФ=dd.MM.yyyy");
			Макет.Параметры.СуммаНДС	  = ПлПоручение.СуммаНДС;
			ТекстНазначения.Вывести(Макет);
		КонецЕсли;
		
		ТекстНазначения = ТекстНазначения.ПолучитьТекст();
		
		Пока Найти(ТекстНазначения, "  ") > 0 Цикл
			ТекстНазначения = СтрЗаменить(ТекстНазначения, "  ", "");
		КонецЦикла;
		
		//в некоторых местах может не быть пробела, добавим.
		ТекстНазначения = СтрЗаменить(ТекстНазначения, ")", ") ");
		ТекстНазначения = СтрЗаменить(ТекстНазначения, "от", " от ");
		
		ТекстНазначения = СтрЗаменить(ТекстНазначения, "  ", " ");
		
		ПлПоручение.НазначениеПлатежа = ТекстНазначения;
		
		ПлПоручение.СформироватьНазначениеПлатежа();
		
		ПлПоручение.Дата = ТекущаяДата();
		
		ПлПоручение.Записать();
		
		Отбор = Новый Структура("NumDoc", Платеж.НомерДокумента);
		СтрокиДокумента = Долги.НайтиСтроки(Отбор);
		
		ЗаписатьДанныеВРегистр(СтрокиДокумента, ПлПоручение.Ссылка);
		
		ПлПоручение.ПолучитьФорму("формаДокумента").Открыть();

	КонецЦикла; 
	
	//Флаг успешного завершения
	Возврат Истина;
	
КонецФункции // СформироватьПлатежныеПорученияПоДокументам()

Функция СформироватьПлатежныеПорученияПоСтрокам(ДеревоПлатежей, НесколькоПлатежей = Ложь, СписокНазначений = Неопределено)
	
	Для Каждого СтрокаДокумента из ДеревоПлатежей.Строки Цикл //Первый уровень - Документ
		
		СтрокаПараметрыПлатежа = СтрокаДокумента.Строки[0];
		
		//Получаем новый документ платежное поручение
		ПлПоручение = СформироватьНовоеПлатежноеПоручение(СтрокаПараметрыПлатежа);
		
		// { DMSREN-1318
		если ПлПоручение = Неопределено тогда
			Продолжить;
		КонецЕсли;
		// DMSREN-1318 }

		
		/////////////////////////////////////////////////////////////////
		//Формируем назначение платежа, тут же делаем контроль, что VIN'ов не больше двух.
		
		//Получаем соответствующий макет
		Макет = ?(СтрокаДокумента.Строки.Количество() > 1,
				ЭтотОбъект.ПолучитьМакет("НазначениеАвтомобилиСтроки"),
				ЭтотОбъект.ПолучитьМакет("НазначениеАвтомобильСтрока"));
			
		СуммаПлатежа = 0;
		СписокVIN = "";
		
		Сч_Vin = 0;
		
		МассивСтрокVIN = Новый Массив;
		Для Каждого СтрокаVIN из СтрокаПараметрыПлатежа.Строки Цикл //Второй уровень
			
			НомерДок = СтрокаVIN.НомерДокумента;
			
			//%+ Дата изменения - 03.05.2012 17:20:53; Автор - Администратор
			//
			// Описание изменений
			//  Изменен формат номера документа
			//
			//%-
			//Если Найти(ВРег(НомерДок),"F") тогда НомерДок = "F-" + СтрЗаменить(ВРег(НомерДок),"F",""); КонецЕсли;
			
			СписокVIN = СписокVIN + "#"+Прав(СокрЛП(СтрокаVIN.VIN),7);
			
			//%+ Дата изменения - 20.07.2012 10:17:08; Автор - Администратор
			//
			// Описание изменений
			//  Добавлен контроль только на два VIN'а и расчет суммы в цикле.
			//
			//%-
			СуммаПлатежа = СуммаПлатежа + СтрокаVIN.СуммаПлатежа;

			Сч_Vin = Сч_Vin + 1;
			//Сч_Vin = 1;
			МассивСтрокVIN.Добавить(СтрокаVIN);
			
			Если Сч_Vin = 2 тогда
				
				//Теперь проставим сумму
				ПлПоручение.СуммаДокумента		 = СуммаПлатежа;
				ПлПоручение.СтавкаНДС			 = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
				
				//Расчитаем НДС
				//ПлПоручение.ПересчитатьСуммуНДС();
				
				СуммаБезНДС=(100*ПлПоручение.СуммаДокумента)/(100+ПлПоручение.СтавкаНДС.Ставка);
				ПлПоручение.СуммаНДС=ПлПоручение.СуммаДокумента-СуммаБезНДС;
				
				Макет.Параметры.НомерДокумента = НомерДок;
				Макет.Параметры.ДатаДокумента = Формат(СтрокаVIN.Строки[0].ДатаДокумента,"ДФ=dd.MM.yyyy");
				Макет.Параметры.СуммаНДС	  = ПлПоручение.СуммаНДС;
				
				ТекстНазначения = Новый ТекстовыйДокумент;
				ТекстНазначения.Вывести(Макет);
				
				ТекстНазначения = ТекстНазначения.ПолучитьТекст();
				
				ТекстНазначения = НормализоватьТекстНазначения(ТекстНазначения, СписокVIN);
				ПлПоручение.НазначениеПлатежа = ТекстНазначения;
				
				////ПлПоручение.СформироватьНазначениеПлатежа();
				
				ПлПоручение.Дата = ТекущаяДата();
				ПлПоручение.УстановитьНовыйНомер("0");
				
				ПлПоручение.Записать();
				
				ПлПоручение.ПолучитьФорму("формаДокумента").Открыть();
				
				//Еще раз по строкам VIN пробегаемся
				//и записываем номер платежа в регистр оплат
				ЗаписатьНомерПлатежаВРегистр(МассивСтрокVIN, ПлПоручение.Ссылка);
				
				//Переинициализируем массив
				МассивСтрокVIN = Новый Массив;
				
				//Создадим новое поручение
				ПлПоручение = СформироватьНовоеПлатежноеПоручение(СтрокаПараметрыПлатежа);
				
				СписокVIN = "";
				СуммаПлатежа = 0;
				
				Сч_Vin = 0;
				
			КонецЕсли;
			
		КонецЦикла;
		
		//Если Сч_Vin = 0 значит документы уже сформированы и записаны. Можно переходить к другой СФ.
		Если Сч_Vin = 0 Тогда Продолжить;КонецЕсли;
		
		//Теперь проставим сумму
		ПлПоручение.СуммаДокумента		 = СуммаПлатежа;
		ПлПоручение.СтавкаНДС			 = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
		
		//Расчитаем НДС
		//ПлПоручение.ПересчитатьСуммуНДС();

		ПлПоручение.Дата = ТекущаяДата();
		ПлПоручение.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
		СуммаБезНДС=(100*ПлПоручение.СуммаДокумента)/(100+ПлПоручение.СтавкаНДС.Ставка);
		ПлПоручение.СуммаНДС=ПлПоручение.СуммаДокумента-СуммаБезНДС;

		ТекстНазначения = Новый ТекстовыйДокумент;
		
		Макет.Параметры.НомерДокумента = НомерДок;
		Макет.Параметры.ДатаДокумента = Формат(СтрокаVIN.Строки[0].ДатаДокумента,"ДФ=dd.MM.yyyy");
		Макет.Параметры.СуммаНДС	  = ПлПоручение.СуммаНДС;
		
		ТекстНазначения.Вывести(Макет);
		
		ТекстНазначения = ТекстНазначения.ПолучитьТекст();
		ТекстНазначения = НормализоватьТекстНазначения(ТекстНазначения, СписокVIN);
		
		ПлПоручение.НазначениеПлатежа = ТекстНазначения;
		
		ПлПоручение.Записать();
		
		ПлПоручение.ПолучитьФорму("формаДокумента").Открыть();
		
		//Еще раз по строкам VIN пробегаемся
		//и записываем номер платежа в регистр оплат
		ЗаписатьНомерПлатежаВРегистр(МассивСтрокVIN,ПлПоручение.Ссылка);
		
	КонецЦикла;
	
КонецФункции

////@+ Функция (СтрокаПараметрыПлатежа)
// Дата создания - 20.07.2012 10:12:29;
// Автор - Администратор
//
// Описание функции
// <Вставить описание>
//
// Параметры
//  Парам1 СтрокаПараметрыПлатежа - СтрокаВыборки
//
// Возвращаемое значение
//  ПлПоручение - ДокументОбъект.ПлатежноеПоручение
//
//@-
Функция СформироватьНовоеПлатежноеПоручение(СтрокаПараметрыПлатежа)
	
	ПараметрыПлатежа = ?(Настройка.ОплатаПоУсловиям, СтрокаПараметрыПлатежа.ПараметрыПлатежа,Настройка.ПараметрыПлатежа);
	//Проверка на наличие параметров платежа
	Если НЕ ЗначениеЗаполнено(ПараметрыПлатежа) тогда
		Сообщить("Для типа фактурирования """ + СтрокаПараметрыПлатежа.ТипФактуры + " не указаны параметры платежа! Документ пропущен." );
		Возврат Неопределено;
	КонецЕсли;
	
	ПлПоручение = Документы.ПлатежноеПоручение.СоздатьДокумент();
	
	//Заполняем реквизиты
	ПлПоручение.Организация			 = ПараметрыПлатежа.ОрганизацияПлательщик;
	ПлПоручение.ИННПлательщика		 = ПараметрыПлатежа.ОрганизацияПлательщик.ИНН;
	ПлПоручение.КПППлательщика		 = ПараметрыПлатежа.ОрганизацияПлательщик.КПП;
	ПлПоручение.СчетОрганизации		 = ПараметрыПлатежа.РасчетныйСчетОрганизации;
	
	ПлПоручение.Контрагент			 = ПараметрыПлатежа.ПолучательПлатежа;
	ПлПоручение.ИННПолучателя		 = ПараметрыПлатежа.ПолучательПлатежа.ИНН;
	ПлПоручение.КПППолучателя		 = ПараметрыПлатежа.ПолучательПлатежа.КПП;
	ПлПоручение.СчетКонтрагента		 = ПараметрыПлатежа.РасчетныйСчетПолучателя;
	//ПлПоручение.ДоговорКонтрагента	 = ПараметрыПлатежа.ДоговорПолучателя;
	
	//ПлПоручение.СтатьяДвиженияДенежныхСредств = ПараметрыПлатежа.СтатьяДДС;
	ПлПоручение.ДоговорВзаиморасчетов = ПараметрыПлатежа.ПолучательПлатежа.ОсновнойДоговорВзаиморасчетов;
	ПлПоручение.ХозОперация  =Справочники.ХозОперации.ПлатежноеПоручение;
	ПлПоручение.ВидПлатежа			 = "Электронно";
	ПлПоручение.ОчередностьПлатежа	 = 5;
	
	// Комментарий 
	//Дата создания - 09.08.2012 10:13:50; Автор - Окипний Андрей Евгеньевич
	//Теперь разберемся с наименованием плательщика и наименованием получателя
	//
	АвтоЗначенияРеквизитов = Renault_ФормированиеПечатныхФорм.СформироватьАвтоЗначенияРеквизитовПлательщикаПолучателя(
										 ПлПоручение.Организация, ПлПоручение.СчетОрганизации, ПлПоручение.Контрагент,
										 ПлПоручение.СчетКонтрагента);
	
	
	ПлПоручение.ТекстПлательщика = АвтоЗначенияРеквизитов.ТекстПлательщика;
	ПлПоручение.ИННПлательщика   = АвтоЗначенияРеквизитов.ИННПлательщика;
	ПлПоручение.КПППлательщика   = АвтоЗначенияРеквизитов.КПППлательщика;
	
	ПлПоручение.ТекстПолучателя  = АвтоЗначенияРеквизитов.ТекстПолучателя;
	ПлПоручение.ИННПолучателя    = АвтоЗначенияРеквизитов.ИННПолучателя;
	ПлПоручение.КПППолучателя    = АвтоЗначенияРеквизитов.КПППолучателя;
	
	ПлПоручение.СформироватьНазначениеПлатежа();
	
	Возврат ПлПоручение;
	
КонецФункции //СформироватьНовоеПлатежноеПоручение(, , )

////@+ Функция НормализоватьТекстНазначения(Знач ТекстНазначения, СписокVin)
// Дата создания - 20.07.2012 10:36:38;
// Автор - Администратор
//
// Описание функции
// Производит подстановку значений в шаблон текста и удаляет лишние символы
//
// Параметры
//  Парам1 ТекстНазначения  - текстовый шаблон - текстовый шаблон назначения платежа
//
//  Парам2 СписокVin  - Строка - Список VIN кодов, которые нужно подставить в шаблон
//
// Возвращаемое значение
//  ТекстНазначения  - Текст - Приведенный в божеский вид текст назначения платежа
//
//@-
Функция НормализоватьТекстНазначения(Знач ТекстНазначения, СписокVin) 
	
	ТекстНазначения = СтрЗаменить(ТекстНазначения, "VIN", СписокVIN);
	
	Пока Найти(ТекстНазначения, "  ") > 0 Цикл
		
		ТекстНазначения = СтрЗаменить(ТекстНазначения, "  ", " ");
		
	КонецЦикла;
	
	//в некоторых местах может не быть пробела, добавим.
	ТекстНазначения = СтрЗаменить(ТекстНазначения, ")", ") ");
	ТекстНазначения = СтрЗаменить(ТекстНазначения, "от", " от ");
	
	ТекстНазначения = СтрЗаменить(ТекстНазначения, "  ", " ");

	Возврат ТекстНазначения;
	
КонецФункции // // НормализоватьТекстНазначения(Знач ТекстНазначения, СписокVin)

////@+ Процедура ЗаписатьНомерПлатежаВРегистр(МассивСтрокVIN, ПлПоручение)
// Дата создания - 20.07.2012 10:33:08;
// Автор - Администратор
// 
// Описание процедуры
//  Процедура по переданному массиву строк с VIN номерами производит 
//  запись в регистр сведений Renault_ОплатыВАФМ
//
// Параметры
//  Парам1 МассивVin  - Массив - Содержит строки дерева значений с vin кодами
//
//  Парам2 ПлПоручение - ДокументСсылка.ПлатежноеПоручение
//
//@-
Процедура ЗаписатьНомерПлатежаВРегистр(МассивСтрокVIN, ПлПоручение)

	Для Каждого СтрокаВИН из МассивСтрокVIN Цикл
		
		Отбор = Новый Структура("VIN_PRinvoice", СтрокаВИН.VIN);
		СтрокиДокумента = Долги.НайтиСтроки(Отбор);
		
		НЗ = РегистрыСведений.Renault_ОплатыВАФМ.СоздатьНаборЗаписей();
		
		НЗ.Отбор.VIN.Установить(СтрокаВИН.VIN);
		НЗ.Прочитать();
		НЗ.Очистить();
		
		Для каждого СтрокаДокумента Из СтрокиДокумента Цикл
			
			НС = НЗ.Добавить();
			НС.НомерДокумента	  = СтрокаДокумента.NumDoc;
			НС.ДатаДокумента	  = СтрокаДокумента.DateFacture;
			НС.СуммаПлатежа		  = СтрокаДокумента.СуммаКОплате;
			НС.VIN				  = СтрокаДокумента.VIN_PRinvoice;
			НС.ПлатежноеПоручение = ПлПоручение;
			НС.ДатаПлатежа		  = ПлПоручение.Дата;
			
		КонецЦикла; 
		
		НЗ.Записать();
		
	КонецЦикла;

КонецПроцедуры // ЗаписатьНомерПлатежаВРегистр(МассивСтрокVIN, ПлПоручение)


///////////////////////////////////////////////////////////////
//			Печать Счета и письма

Функция СформироватьПисьмо(ТекСчет) Экспорт
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.УстановитьПараметр("ПениДетали", ПениДетали);
	Запрос.УстановитьПараметр("ТабПени", Пени);
	Запрос.УстановитьПараметр("ТекСчет", ТекСчет);
	
	//Получим таблицу детализации
	ТекстЗапроса =  "ВЫБРАТЬ ПЕРВЫЕ 1 *
	|ПОМЕСТИТЬ Детализация
	|ИЗ
	|	&ПениДетали КАК ПениДетали
	|ГДЕ
	|	ПениДетали.NUM_CCHET = &ТекСчет";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	//Получим таблицу Пеней
	ТекстЗапроса = "ВЫБРАТЬ *
	|ПОМЕСТИТЬ Пени
	|ИЗ
	|	&ТабПени КАК ТабПени
	|ГДЕ
	|	ТабПени.NumberInvoice = &ТекСчет";

	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	//Начинаем собирать данные
	ТекстЗапроса = "ВЫБРАТЬ
	|	Детализация.DEALER_NAME_FULL КАК НаименованиеДилера,
	|	Пени.NumberInvoice КАК НомерСчета,
	|	Пени.InvoiceDate КАК ДатаСчета,
	|	Детализация.NUMERO_ANNEXE КАК ДоговорНомер,
	|	Детализация.DATE_ANNEXE КАК ДоговорДата,
	|	Пени.PeriodFrom КАК НачалоПериода,
	|	Пени.PeriodTo КАК КонецПериода,
	|	Пени.FineTaxed КАК СуммаПени
	|ИЗ
	|	Пени КАК Пени
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Детализация КАК Детализация
	|		ПО Пени.NumberInvoice = Детализация.NUM_CCHET
	|ГДЕ
	|	Пени.NumberInvoice = &ТекСчет";
	
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() тогда
		Попытка
			
			Письмо = ПолучитьМакет("МакетПисьма");
			Word = Письмо.Получить();
			Word.Application.Visible= 0;
			
			//Заполнение полей
			Word.Variables.Item("НаименованиеДилера").Value = Выборка.НаименованиеДилера;
			Word.Variables.Item("ДатаСчета").Value			= Выборка.ДатаСчета;
			Word.Variables.Item("НомерСчета").Value			= Строка(Выборка.НомерСчета) + "/П";
			Word.Variables.Item("НачалоПериода").Value		= Выборка.НачалоПериода;
			Word.Variables.Item("КонецПериода").Value		= Выборка.КонецПериода;
			Word.Variables.Item("ДоговорНомер").Value		= Выборка.ДоговорНомер;
			Word.Variables.Item("ДоговорДата").Value		= Формат(Выборка.ДоговорДата,"ДФ=dd.MM.yyyy");
			Word.Variables.Item("СуммаПени").Value			= Формат(Выборка.СуммаПени,"ЧДЦ=2; ЧРД=,; ЧРГ=' '; ЧГ=3,0");
			Word.Fields.Update();

			//Возвращаем объект с письмом
			Возврат Word;
			
		Исключение
			
			Сообщить(ОписаниеОшибки());
			Возврат неопределено;
			
		КонецПопытки;
	Иначе
		
		Сообщить("Детальных данных для счета №" + ТекСчет + " не найдено.");
		Возврат неопределено;
		
	КонецЕсли;
	
КонецФункции

Функция ПечатьСчета(ТекСчет) Экспорт
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.УстановитьПараметр("ПениДетали", ПениДетали);
	Запрос.УстановитьПараметр("ТабПени", Пени);
	Запрос.УстановитьПараметр("ТекСчет", ТекСчет);
	
	//Получим таблицу детализации
	ТекстЗапроса =  "ВЫБРАТЬ *
	|ПОМЕСТИТЬ Детализация
	|ИЗ
	|	&ПениДетали КАК ПениДетали
	|ГДЕ
	|	ПениДетали.NUM_CCHET = &ТекСчет";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	//Получим таблицу Пеней
	ТекстЗапроса = "ВЫБРАТЬ *
	|ПОМЕСТИТЬ Пени
	|ИЗ
	|	&ТабПени КАК ТабПени
	|ГДЕ
	|	ТабПени.NumberInvoice = &ТекСчет";

	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	//Начинаем собирать шапку
	ТекстЗапроса = "ВЫБРАТЬ
	|	Пени.NumberInvoice КАК СчетНомер,
	|	Пени.InvoiceDate КАК СчетДата,
	|	Пени.PeriodFrom КАК НачалоПериода,
	|	Пени.PeriodTo КАК КонецПериода,
	|	Детализация.DEALER_NAME_FULL КАК НаименованиеДилера,
	|	Детализация.INN КАК ИНН,
	|	Детализация.KPP КАК КПП,
	|	Детализация.ADR_CODE_POSTAL КАК Индекс,
	|	Детализация.ADR_VILLE КАК Город,
	|	Детализация.ADR КАК Адрес
	|ИЗ
	|	Пени КАК Пени
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Детализация КАК Детализация
	|		ПО Пени.NumberInvoice = Детализация.NUM_CCHET
	|ГДЕ
	|	Пени.NumberInvoice = &ТекСчет";

	Запрос.Текст = ТекстЗапроса;
	Шапка = Запрос.Выполнить().Выбрать();
	
	Если НЕ Шапка.Следующий() тогда
		
		Сообщить("Детальных данных для счета № " + ТекСчет + " не найдено.");
		Возврат Неопределено;
		
	КонецЕсли;
	
	//Начинаем собирать данные по табличной части
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Детализация.NUMERO_ANNEXE КАК ДоговорНомер,
	|	Детализация.DATE_ANNEXE КАК ДоговорДата,
	|	Детализация.NUM_FAC КАК НомерТТН,
	|	Детализация.VIN,
	|	Детализация.date_f КАК ДатаОтгрузки,
	|	Детализация.DATE_R КАК СрокОплаты,
	|	Детализация.DATE_P КАК ДатаОплаты,
	|	Детализация.DAY_R КАК Просрочка,
	|	Детализация.PRICE_F КАК СтоимостьАвто,
	|	Детализация.PENI КАК Пени
	|ИЗ
	|	Пени КАК Пени
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Детализация КАК Детализация
	|		ПО Пени.NumberInvoice = Детализация.NUM_CCHET
	|ГДЕ
	|	Пени.NumberInvoice = &ТекСчет
	|	И (НЕ Детализация.NUMERO_ANNEXE = """")";
	
	Запрос.Текст = ТекстЗапроса;
	ТабЧасть = Запрос.Выполнить().Выгрузить();

	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказПокупателя_СчетЗаказ";

	Макет = ПолучитьМакет("Счет");
	
	/////////////////////////////////////////////////////////////
	//			Вывод таблицы с банковскими реквизитами
	ОбластьМакета       = Макет.ПолучитьОбласть("ЗаголовокСчета");
	ТабДокумент.Вывести(ОбластьМакета);

	/////////////////////////////////////////////////////////////
	//			Вывод заголовка документа
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = "Счет №" + Шапка.СчетНомер + "/П от " + Формат(Шапка.СчетДата,"ДФ=dd.MM.yyyy") + 
					" за период с " + Формат(Шапка.НачалоПериода, "ДФ=dd.MM.yyyy") + " по " + Формат(Шапка.КонецПериода, "ДФ=dd.MM.yyyy");

	ТабДокумент.Вывести(ОбластьМакета);
	
	/////////////////////////////////////////////////////////////
	//			Вывод строки Поставщик
	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ТабДокумент.Вывести(ОбластьМакета);
	
	/////////////////////////////////////////////////////////////
	//			Вывод строки Покупатель
	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	
	//Заголовок ИНН/КПП
	ИННКПП = "";
	Если ЗначениеЗаполнено(Шапка.ИНН) тогда
		ИННКПП = "ИНН";
		
		//Если нет ИНН то нет и КПП
		Если ЗначениеЗаполнено(Шапка.КПП) тогда
			ИННКПП = ИННКПП + "/КПП";
		КонецЕсли;
		
		//Значение ИНН/КПП
		ИННКПП = ИННКПП + ": " + Шапка.ИНН;
		
		//Если нет ИНН то нет и КПП
		Если ЗначениеЗаполнено(Шапка.КПП) тогда
			ИННКПП = ИННКПП + " / " + Шапка.КПП;
		КонецЕсли;
		
	Иначе
		
		ИННКПП = "";
		
	КонецЕсли;
	
	ОбластьМакета.Параметры.ПредставлениеПокупателя = Шапка.НаименованиеДилера + 
				", Адрес: " + Шапка.Индекс + ", " + Шапка.Город + ", " + Шапка.Адрес +
				", " + ?(ЗначениеЗаполнено(Шапка.ИНН), ИННКПП,".");
	ТабДокумент.Вывести(ОбластьМакета);
	
	/////////////////////////////////////////////////////////////
	//			Вывод шапки таблицы
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ОбластьМакета);
	
	/////////////////////////////////////////////////////////////
	//			Вывод строк таблицы
	
	ИтогоСуммаДокумента = 0;
	
	Для каждого строка из ТабЧасть Цикл
		
		ИтогоСуммаДокумента = ИтогоСуммаДокумента + строка.Пени;

		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		ОбластьМакета.Параметры.Заполнить(строка);
		
		ОбластьМакета.Параметры.НомерДатаДоговора = "Прил.№11 к Дог." + Строка.ДоговорНомер + Символы.ПС + 
				" от " + Формат(Строка.ДоговорДата,"ДФ=dd.MM.yyyy");
		
		ТабДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;
	
	/////////////////////////////////////////////////////////////
	//			Вывод строки Итого
	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	ОбластьМакета.Параметры.Всего = ИтогоСуммаДокумента;
	ТабДокумент.Вывести(ОбластьМакета);
	
	/////////////////////////////////////////////////////////////
	//			Вывод Итого к оплате
	ОбластьМакета = Макет.ПолучитьОбласть("ИтогоКОплате");
	ОбластьМакета.Параметры.ИтогоКОплате = ИтогоСуммаДокумента;
	ТабДокумент.Вывести(ОбластьМакета);

	/////////////////////////////////////////////////////////////
	//			Вывод Суммы прописью
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
	ОбластьМакета.Параметры.ИтоговаяСтрока = "Всего наименований " + ТабЧасть.Количество() + ", на сумму " + 
			ИтогоСуммаДокумента + " руб.";
		
	ОбластьМакета.Параметры.СуммаПрописью = СформироватьСуммуПрописью(ИтогоСуммаДокумента);
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	/////////////////////////////////////////////////////////////
	//			Вывод подвала с печатью и подписью
	ОбластьМакета = Макет.ПолучитьОбласть("ПодвалСчета");
	ТабДокумент.Вывести(ОбластьМакета);
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ПолеСверху = 5;
	ТабДокумент.ПолеСлева = 2;
	ТабДокумент.ПолеСправа = 2;
	ТабДокумент.ПолеСнизу = 2;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатьДетализации(ТекСчет) Экспорт
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.УстановитьПараметр("ПениДетали", ПениДетали);
	Запрос.УстановитьПараметр("ТабПени", Пени);
	Запрос.УстановитьПараметр("ТекСчет", ТекСчет);
	
	//Получим таблицу детализации
	ТекстЗапроса =  "ВЫБРАТЬ *
	|ПОМЕСТИТЬ Детализация
	|ИЗ
	|	&ПениДетали КАК ПениДетали
	|ГДЕ
	|	ПениДетали.NUM_CCHET = &ТекСчет";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	//Получим таблицу Пеней
	ТекстЗапроса = "ВЫБРАТЬ *
	|ПОМЕСТИТЬ Пени
	|ИЗ
	|	&ТабПени КАК ТабПени
	|ГДЕ
	|	ТабПени.NumberInvoice = &ТекСчет";

	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	//Начинаем собирать данные по табличной части
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Детализация.NUM_FAC КАК НомерТТН,
	|	Детализация.VIN,
	|	Детализация.date_f КАК ДатаОтгрузки,
	|	Детализация.DATE_R КАК СрокОплаты,
	|	Детализация.DATE_P КАК ДатаОплаты,
	|	Детализация.DAY_R КАК Просрочка,
	|	Детализация.PRICE_F КАК СтоимостьАвто,
	|	Детализация.PENI КАК Пени,
	|	Детализация.PENI_NDS КАК НДСПени
	|ИЗ
	|	Пени КАК Пени
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Детализация КАК Детализация
	|		ПО Пени.NumberInvoice = Детализация.NUM_CCHET
	|ГДЕ
	|	Пени.NumberInvoice = &ТекСчет";
	
	Запрос.Текст = ТекстЗапроса;
	ТабЧасть = Запрос.Выполнить().Выгрузить();

	Если ТабЧасть.Количество() = 0 тогда
		
		Сообщить("Детальных данных для счета № " + ТекСчет + " не найдено.");
		Возврат Неопределено;
		
	КонецЕсли;
	
	ТабДокумент = Новый ТабличныйДокумент;

	Макет = ПолучитьМакет("ДетализацияПени");
	
	////////////////////////////////////////////////////
	//			Заголовок
	ТекстЗаголовка = "Детализация к счету № " +  ТекСчет;
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	ТабДокумент.Вывести(ОбластьМакета);
	
	////////////////////////////////////////////////////
	//			Шапка таблицы
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ОбластьМакета);
	
	СуммаИтого = 0;
	НДСИтого   = 0;
	
	////////////////////////////////////////////////////
	//			Строки таблицы
	Для Каждого строка из ТабЧасть Цикл
		
		СуммаИтого = СуммаИтого + Строка.Пени;
		НДСИтого   = НДСИтого + Строка.НДСПени;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		ОбластьМакета.Параметры.Заполнить(Строка);
		ТабДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;
	
	////////////////////////////////////////////////////
	//			Итоги
	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	ОбластьМакета.Параметры.Всего = СуммаИтого;
	ТабДокумент.Вывести(ОбластьМакета);
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ПолеСверху = 5;
	ТабДокумент.ПолеСлева = 2;
	ТабДокумент.ПолеСправа = 2;
	ТабДокумент.ПолеСнизу = 2;
	
	Возврат ТабДокумент;
	
КонецФункции

////////////////////////////////////////////////////////////////
Процедура ЗаписатьДанныеВРегистр(СтрокиДокумента, ПлПоручение)
	
	НЗ = РегистрыСведений.Renault_ОплатыВАФМ.СоздатьНаборЗаписей();
	
	НЗ.Отбор.ПлатежноеПоручение.Установить(ПлПоручение);
	НЗ.Прочитать();
	НЗ.Очистить();
	
	Для каждого СтрокаДокумента Из СтрокиДокумента Цикл
	
		НС = НЗ.Добавить();
		НС.НомерДокумента	  = СтрокаДокумента.NumDoc;
		НС.ДатаДокумента	  = СтрокаДокумента.DateFacture;
		НС.СуммаПлатежа		  = СтрокаДокумента.СуммаКОплате;
		НС.VIN				  = СтрокаДокумента.VIN_PRinvoice;
		НС.ПлатежноеПоручение = ПлПоручение;
		НС.ДатаПлатежа		  = ПлПоручение.Дата;
	КонецЦикла;
	
	НЗ.Записать();
	
КонецПроцедуры

Функция СформироватьСуммуПрописью(Сумма)

	ПараметрыПрописиНаРусском = "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
	
	Если НЕ Метаданные.Справочники.Найти("Валюты") = Неопределено тогда
		
		ВалютаРубль = Справочники["Валюты"].НайтиПоКоду("643");
		
		Если ЗначениеЗаполнено(ВалютаРубль) тогда
			ПараметрыПрописиНаРусском = ВалютаРубль.ПараметрыПрописиНаРусском;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЧислоПрописью(Сумма, ,ПараметрыПрописиНаРусском);
	
КонецФункции // СформироватьСуммуПрописью()

#КонецЕсли

Процедура НапечататьДокумент(ПечДокумент, КоличествоЭкземпляров = 1, НаПринтер = Ложь, Заголовок = "", НепосредственнаяПечать = Ложь, Ссылка = Неопределено, ИмяМакета = "") Экспорт

	Если ПечДокумент = Неопределено тогда
		Возврат;
	КонецЕсли;

	// Получить необходимое количество копий
	Если КоличествоЭкземпляров > 0 Тогда
		ПечДокумент.КоличествоЭкземпляров = КоличествоЭкземпляров;
	КонецЕсли;

	Если НЕ ПечДокумент.АвтоМасштаб
	   И НЕ ЗначениеЗаполнено(ПечДокумент.ИмяПринтера) Тогда
		ПечДокумент.АвтоМасштаб = Истина;
	КонецЕсли;

	Если НаПринтер Тогда

		ПечДокумент.Напечатать(НепосредственнаяПечать = Истина);

	Иначе

		// Отобразить печатный документ на экране
		//ФормаПечати = ПолучитьОбщуюФорму("ФормаПечати",, Новый УникальныйИдентификатор);
		ФормаПечати = ПолучитьОбщуюФорму("ФормаПечати",, Заголовок + ИмяМакета + Ссылка);
		ФормаПечати.Документ = Ссылка;
		ФормаПечати.Заголовок = Заголовок;
		ФормаПечати.ИмяМакета = ИмяМакета;
		ФормаПечати.ПечатныйДокумент = ПечДокумент;
		ФормаПечати.Открыть();

	КонецЕсли;

КонецПроцедуры // НапечататьДокумент()

ВрФайлыДрайверов = Новый Массив;

//Получим имя временного файла для записи данных
//из источника
ВремИмяФайла = ПолучитьИмяВременногоФайла("csv");
ВремИмяФайла_RCV = ПолучитьИмяВременногоФайла("rcv.csv");

ВрФайлыДрайверов.Добавить(ВремИмяФайла);

АвтоДокВерсия = "2.3.0.3";