
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Scheduler=Параметры.Scheduler;
	ПараметрыДанных=ПолучитьИзВременногоХранилища(Scheduler.DynamicData.ПараметрыДанных);
	resourceName=Scheduler.resourceName;
	Для Каждого Эл Из ПараметрыДанных.Groups.СписокГруппировок Цикл 
		Элементы.resourceName.СписокВыбора.Добавить(Эл.Ключ, Эл.Значение) 
	КонецЦикла;
	ЗаполнитьРесурсы();
КонецПроцедуры

Процедура ЗаполнитьРесурсы()
	Если ПараметрыДанных.Свойство("СКД") Тогда
	ИначеЕсли ПараметрыДанных.Свойство("Запрос") Тогда
		
		Запрос = Новый Запрос(ПараметрыДанных.Groups.Значения[resourceName].ТекстЗапроса
			+ ";Выбрать * Из Группировка Упорядочить ПО Ссылка.Наименование");
		Для Каждого Параметр Из ПараметрыДанных.Groups.Значения[resourceName].ПараметрыЗапроса Цикл 
			Запрос.УстановитьПараметр(Параметр.Ключ,Параметр.Значение); 
		КонецЦикла;
		СписокРесурсов.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		Если ПараметрыДанных.ResourceSelection.Количество() > 0 Тогда
			Для Каждого Эл Из СписокРесурсов Цикл 
				Эл.Пометка = ПараметрыДанных.ResourceSelection.Найти(Эл.Значение) <> Неопределено; 
			КонецЦикла;
		Иначе
			Для Каждого Эл Из СписокРесурсов Цикл 
				Эл.Пометка = Истина; 
			КонецЦикла;
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура кнОк(Команда)
	Массив = Новый Массив;
	Для Каждого Эл Из СписокРесурсов Цикл
		Если Эл.Пометка Тогда 
			Массив.Добавить(Эл.Значение); 
		КонецЕсли;
	КонецЦикла;
	Закрыть(Новый Структура("resourceName,ResourceSelection", resourceName, Массив))
КонецПроцедуры

&НаКлиенте
Процедура кнФлаги(Команда) 
	Для Каждого Эл Из СписокРесурсов Цикл 
		Эл.Пометка = Команда.Имя = "кнВкл";
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура resourceNameПриИзменении(Элемент) 
	ЗаполнитьРесурсы(); 
КонецПроцедуры
