 // Модуль документа

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования
Перем ИмяРеквизитаКода Экспорт;     // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/артикула в ТЧ
Перем ОбработкаРасчетСкидокНаАвтомобиль Экспорт; // Переменная для хранения ссылки на обработку "Расчет скидок". Данная обработка содержит необходимые
                                     // свойства и методы для расчета скидок документа.
Перем ОбработкаРасчетСкидок Экспорт; // Переменная для хранения ссылки на обработку "Расчет скидок". Данная обработка содержит необходимые
                                     // свойства и методы для расчета скидок документа.

Перем ТекущаяВалютаДокумента Экспорт; // Текущая валюта документа
Перем ТекущийКурсДокумента Экспорт;   // Текущий курс валюты документа
Перем НеЗаполнятьКонтрагента Экспорт;	// Отказ от заполнения контрагента значением по умолчанию
//Перем ДокументыДляПерепроведения;     // Список документов для проведения

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает соответствие в котором перечислены виды номенклатуры, которые нельзя вводить
// в таблицу товаров. Если таких нет, то возвращает неопределено
//
Функция ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры() Экспорт
	Результат=Новый Соответствие();
	Результат.Вставить(Перечисления.ВидыНоменклатуры.Услуга,0);
	Возврат Результат;
КонецФункции // ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры()

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	ОбязательныеРеквизиты.Вставить("Автор",1);
	ОбязательныеРеквизиты.Вставить("ВалютаДокумента",1);
	ОбязательныеРеквизиты.Вставить("КурсДокумента",1);
	ОбязательныеРеквизиты.Вставить("ТипЦен",1);
	ОбязательныеРеквизиты.Вставить("ХозОперация",1);
		
	ОбязательныеРеквизиты.Вставить("Автомобиль",   1);
	ОбязательныеРеквизиты.Вставить("Контрагент",   1);
	ОбязательныеРеквизиты.Вставить("ЦенаАвтомобиля",   1);
	//Бондаренко++ 20230117
	//ОбязательныеРеквизиты.Вставить("СтоимостьВР",   1);
	//Бондаренко-- 20230117
	
	Возврат ОбязательныеРеквизиты;
КонецФункции

// Проверяет корректность заполнения объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	// Здесь могут быть определены дополнительные к стандартным обязательным реквизитам условия проверки
	//Если ДопРеквизиты=Неопределено Тогда
	//	ДопРеквизиты = Новый Структура;
	//КонецЕсли; 
	//ДопРеквизиты.Вставить("Автомобиль",1);
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	
	// Проведем проверку соответствия организации документа организациям некоторых реквизитов документа.
	// Такую проверку необходимо осуществлять, если баланс в системе ведется по организации,
	// или если установлен способ контроля корректности
	// договора и склада документа. Причем, если способ контроля выбран "Контроль по организации и подразделению", то
	// дополнительно осуществляется проверка соответствия подразделений.
	Если Результат Тогда
		СпособКонтроляКорректности = обПраво("КонтрольКорректностиДоговораИСкладаДокумента", Права,,ЭтотОбъект);
		КонтрольОтсутствует        = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольОтсутствует);
		БалансВедетсяПоОрганизации = (Константы.СпособВеденияБаланса.Получить()=Перечисления.СпособВеденияБаланса.ПоОрганизации);
		
		Если БалансВедетсяПоОрганизации ИЛИ НЕ КонтрольОтсутствует Тогда
			КонтрольПоПодразделению = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольПоОрганизацииИПодразделению);
			
			КонтролируемыеРеквизиты = Новый Структура();
			
			КонтролируемыеРеквизитыШапки = Новый Структура();
			КонтролируемыеРеквизитыШапки.Вставить("ДоговорВзаиморасчетов", КонтрольПоПодразделению);
			КонтролируемыеРеквизиты.Вставить("КонтролируемыеРеквизитыШапки",КонтролируемыеРеквизитыШапки);
			
			Результат = дкПроверитьКорректностьПоОрганизации(ЭтотОбъект,КонтролируемыеРеквизиты,Ошибки) И Результат;
		КонецЕсли;  		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Проверяет корректность заполнения табличных частей объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
Функция ПроверитьЗаполненностьТЧ(Ошибки="", ДопРеквизиты=Неопределено) Экспорт
	//Документ считаем корректно заполненным, независимо от заполненности табличных частей
	Возврат Истина;
КонецФункции

// Возвращает список возможных хозяйственных операций документа
// Возвращаемое значение: СписокЗначений. 
// Строка списка: Значение - имя предопределенного элемента; 
//				  Представление - красивое его представление
// 				  "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("ЗаказНаВыкупАвтомобиля", "Заказ на выкуп автомобиля", Истина);
	
	Возврат СписокХозОпераций;	
КонецФункции

// Расчет суммы документа
Функция РассчитатьСуммуВсего() Экспорт
	Возврат СуммаДокумента;
КонецФункции

// пересчет цены на авто при изменении флага цена включает НДС
Процедура ПересчитатьЦеныДляНовогоТипаЦен() Экспорт
	ОбработкаРеквизита("ЦенаАвтомобиля");
КонецПроцедуры

// Расчет суммы НДС
Функция РассчитатьСуммуНДСВсего() Экспорт
	Возврат СуммаНДСНаАвтомобиль;
КонецФункции

// Получение суммы без скидки для расчета новой скидки
//
// Параметры
//  ОбработкаРасчетСкидок	– Обработка.РасчетСкидок – Обработка расчета скидок
//
// Возвращаемое значение:
//   Число   – Сумма автомобиля и опций без скидки
//
Функция ПолучитьБазуДляРасчетаСкидки(ОбработкаРасчетСкидок) Экспорт
	БазаДляРасчетаСкидки=Неопределено;
	
	Если ОбработкаРасчетСкидок.ИмяТабличнойЧасти="Опции" Тогда
		БазаДляРасчетаСкидки = орПолучитьСуммуДокументаБезСкидки(ЭтотОбъект, "Автомобиль");
	КонецЕсли;
	
	Возврат БазаДляРасчетаСкидки;
КонецФункции // ПолучитьБазуДляРасчетаСкидки() 

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка			– Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	– Форма				– Ссылка на форму документа. Если значение неопределено,
//									  производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	Результат=Истина;
	//
	НДС20 = Справочники.СтавкиНДС.НайтиПоНаименованию("НДС 20%"); 
	//Иванченко 20260105 ++
	НДС22 = Справочники.СтавкиНДС.НДС22Процента; 		
	//Иванченко 20260105 --	
	//
	// ОБРАБОТКА РЕКВИЗИТОВ ДОКУМЕНТА
	
	Если Имя = "ХозОперация" Тогда
		
	ИначеЕсли Имя = "Дата" Тогда
		Результат = дкОбработкаРеквизита(ЭтотОбъект, Имя, ТекСтрока, ЭтаФорма, ДопПараметры);
		Результат = ОбработкаРеквизита("РассчитатьСкидкиНаАвтомобиль", ТекСтрока, ЭтаФорма, ДопПараметры) И Результат;
		
	ИначеЕсли Имя = "ТипЦен" Тогда
		Результат = дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		ТекущаяВалютаДокумента = ВалютаДокумента;
		ТекущийКурсДокумента   = КурсДокумента;
		Возврат Результат;
		
	ИначеЕсли Имя="ВалютаДокумента" Тогда
		Попытка
			ТребуетсяПересчет = ДопПараметры.ТребуетсяПересчет;
		Исключение
			ТребуетсяПересчет = Ложь;
		КонецПопытки; 
		Результат = дкОбработкаРеквизита(ЭтотОбъект, Имя, ТекСтрока, ЭтаФорма, ДопПараметры);
		Если ТребуетсяПересчет И (НЕ обЗначениеНеЗаполнено(ТекущаяВалютаДокумента)) Тогда
			ЦенаАвтомобиля=обПересчет(ЦенаАвтомобиля,ТекущаяВалютаДокумента,ТекущийКурсДокумента,ВалютаДокумента,КурсДокумента);
			ОбработкаРеквизита("ЦенаАвтомобиля",ТекСтрока,ЭтаФорма,ДопПараметры);
			Результат=ОбработкаРеквизита("ПроцентПредоплаты",ТекСтрока,ЭтаФорма,ДопПараметры) И Результат;
		КонецЕсли;
		ТекущаяВалютаДокумента = ВалютаДокумента;
		ТекущийКурсДокумента   = КурсДокумента;
		
	ИначеЕсли Имя="Организация" Тогда
		Результат = дкОбработкаРеквизита(ЭтотОбъект, Имя, ТекСтрока, ЭтаФорма, ДопПараметры);
		// Организация может являются плательщиком НДС, а может и нет.. надо обработать ТЧ
		ОсвобожденОтНДС=ПодразделениеКомпании.ОсвобожденОтНДС ИЛИ Организация.ОсвобожденОтНДС;
		Если ОсвобожденОтНДС Тогда
			СтавкаНДСНаАвтомобиль=Справочники.СтавкиНДС.БезНДС;
		Иначе
			СтавкаНДСНаАвтомобиль = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
		КонецЕсли;
		Результат=ОбработкаРеквизита("СтавкаНДСНаАвтомобиль",,ЭтаФорма,ДопПараметры) И Результат;
		
	ИначеЕсли Имя="ПодразделениеКомпании" Тогда
		Результат=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		// Подразделение может являются плательщиком НДС, а может и нет.. надо обработать ТЧ
		ОсвобожденОтНДС=ПодразделениеКомпании.ОсвобожденОтНДС ИЛИ Организация.ОсвобожденОтНДС;
		Если ОсвобожденОтНДС Тогда
			СтавкаНДСНаАвтомобиль=Справочники.СтавкиНДС.БезНДС;
		Иначе
			//Иванченко 20260105 ++
			//СтавкаНДСНаАвтомобиль = НДС20;//Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;  
			СтавкаНДСНаАвтомобиль = НДС22;//Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;	
			//Иванченко 20260105 --
		КонецЕсли;
		Результат=ОбработкаРеквизита("СтавкаНДСНаАвтомобиль",,ЭтаФорма,ДопПараметры) И Результат;
		// Изменение подразделения приводит к необходимости пересчета скидок документа (как "шапочных", так и товарных).
		Результат=ЭтотОбъект.ОбработкаРеквизита("РассчитатьСкидкиНаАвтомобиль",ТекСтрока,ЭтаФорма,ДопПараметры) И Результат;
		
	ИначеЕсли Имя="Контрагент" Тогда
		Результат=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="ДоговорВзаиморасчетов" Тогда
		дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		//// Если у документа есть реквизит СкидкаНаценка, заполним его из Договора 
		//Если (НЕ обЗначениеНеЗаполнено(ДоговорВзаиморасчетов.ТипСкидкиНаценки)) И 
		//	(СкидкаНаценкаНаАвтомобиль<>ДоговорВзаиморасчетов.ТипСкидкиНаценки) Тогда
		//	СкидкаНаценкаНаАвтомобиль=ДоговорВзаиморасчетов.ТипСкидкиНаценки;
		//	Результат=ОбработкаРеквизита("СкидкаНаценкаНаАвтомобиль",,ЭтаФорма,ДопПараметры);		
		
	ИначеЕсли Имя="Карточка" Тогда
		Результат = дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Результат = ОбработкаРеквизита("РассчитатьСкидкуНаАвтомобиль",ТекСтрока,ЭтаФорма,ДопПараметры) И Результат;
		
	ИначеЕсли Имя="Заказчик" Тогда
		Если НЕ обЗначениеНеЗаполнено(Заказчик) И (Заказчик<>Контрагент) Тогда
			Контрагент=Заказчик;
			Результат=ОбработкаРеквизита("Контрагент",ТекСтрока,ЭтаФорма,ДопПараметры) И Результат;
		КонецЕсли; 
		
	ИначеЕсли Имя="ПроцентПредоплаты" Тогда
		Результат=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		СуммаСоСкидкой=РассчитатьСуммуВсего();
		СуммаПредоплаты=(СуммаСоСкидкой*ПроцентПредоплаты)/100;
		
	ИначеЕсли Имя="СуммаПредоплаты" Тогда
		Результат=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		СуммаСоСкидкой=РассчитатьСуммуВсего();
		Если СуммаСоСкидкой=0 Тогда ПроцентПредоплаты=0;
		Иначе
			ВремПроцентПредоплаты = (СуммаПредоплаты*100)/СуммаСоСкидкой;
			ВремПроцентПредоплаты = Цел(ВремПроцентПредоплаты*100)/100;
			ПроцентПредоплаты = ВремПроцентПредоплаты;
		КонецЕсли; 
		
	ИначеЕсли Имя="СрокПоставки" Тогда
		Результат=ОбработкаРеквизита("ОтображениеСрокаПоставки",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="СрокСнятияРезерва" Тогда
		Возврат ОбработкаРеквизита("ОтображениеСрокаСнятияРезерва",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	// ОБРАБОТКА РЕКВИЗИТОВ АВТОМОБИЛЯ
	ИначеЕсли Имя="Автомобиль" Тогда
		Результат = Истина;
		Если ЗначениеЗаполнено(Автомобиль) Тогда
			Если ДопПараметры = Неопределено Тогда
				ДопПараметры = Новый Структура;
			КонецЕсли;
			ДопПараметры.Вставить("НеИзменятьЦенуАвтомобиля",Истина);
			Модель = Автомобиль.Модель;
			//ВариантКомплектации = Автомобиль.ВариантКомплектации;
			//Результат = ОбработкаРеквизита("Модель", ТекСтрока, ЭтаФорма, ДопПараметры);
			//Результат = ОбработкаРеквизита("ВариантКомплектации", ТекСтрока, ЭтаФорма, ДопПараметры);
			ДопПараметры.Удалить("НеИзменятьЦенуАвтомобиля");
			Цвет      = Автомобиль.Цвет;
			ЦветКод   = Автомобиль.ЦветКод;
			ТипСалона = Автомобиль.ТипСалона;
			//НоваяЦенаАвтомобиля = обПолучитьЦену(ТипЦен, Новый Структура("Автомобиль, ВариантКомплектации", Автомобиль, Справочники.ВариантыКомплектации.ПустаяСсылка()),?(Ссылка.Пустая(), Дата, МоментВремени()),,ВалютаДокумента,КурсДокумента);
			//#Если Клиент Тогда
			//Если НоваяЦенаАвтомобиля<>ЦенаАвтомобиля Тогда
			//	Если ЭтаФорма<>Неопределено Тогда
			//		ТекстВопроса="Цена выбранного автомобиля составляет "+Формат(НоваяЦенаАвтомобиля,"ЧДЦ=2; ЧН=0,00")+" "+СокрЛП(ВалютаДокумента)+".
			//			|Цена автомобиля по заказу "+Формат(ЦенаАвтомобиля,"ЧДЦ=2; ЧН=0,00")+" "+СокрЛП(ВалютаДокумента)+".
			//			|
			//			|Изменить цену автомобиля в заказе?";
			//		Ответ=Вопрос(ТекстВопроса,РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да,"Изменение цены");
			//		Если Ответ<>КодВозвратаДиалога.Да Тогда
			//			НоваяЦенаАвтомобиля=ЦенаАвтомобиля;
			//		КонецЕсли;
			//	КонецЕсли; 
			//КонецЕсли;
			//Если ЭтаФорма<>Неопределено Тогда
			//	ЭтаФорма.СМГ_ПолучитьОборудованиеАвтомобиля();
			//	дкВывестиЗаголовокСуммаДокумента(ЭтаФорма);
			//КонецЕсли;
			//#КонецЕсли
			//Если НоваяЦенаАвтомобиля<>ЦенаАвтомобиля Тогда
			//	ЦенаАвтомобиля = НоваяЦенаАвтомобиля;
			//	Результат = ОбработкаРеквизита("ЦенаАвтомобиля", ТекСтрока, ЭтаФорма, ДопПараметры);
			//КонецЕсли;
			//Резервировать = ПроверитьОстаткиАвтомобилей();
		КонецЕсли;
		#Если Клиент Тогда
			дкСообщитьОЗаметках(ЭтотОбъект,ЭтотОбъект["Автомобиль"],ЭтаФорма);
		#КонецЕсли

		#Если Клиент Тогда
		Если ЭтаФорма<>Неопределено Тогда
			ЭтаФорма.УправлениеДиалогом();
		КонецЕсли; 
		#КонецЕсли
		
	ИначеЕсли Имя="Модель" Тогда
		ВариантКомплектацииИзменен=Ложь;
		Если ВариантКомплектации.Владелец<>Модель Тогда
			ВариантКомплектации=Неопределено;
			ВариантКомплектацииИзменен=Истина;
		КонецЕсли;
		#Если Клиент Тогда
		Если ЭтаФорма<>Неопределено Тогда
			ЭтаФорма.ОтключитьОбработчикИзмененияДанных("АвтомобильЗаказа");
			АвтомобильИзменен=Ложь;
			Если Модель<>ЭтаФорма.АвтомобильЗаказа.Модель Тогда
				ЭтаФорма.АвтомобильЗаказа.Модель=Модель;
				АвтомобильИзменен=Истина;
			КонецЕсли; 
			Если ВариантКомплектации<>ЭтаФорма.АвтомобильЗаказа.ВариантКомплектации Тогда
				ЭтаФорма.АвтомобильЗаказа.ВариантКомплектации=ВариантКомплектации;
				АвтомобильИзменен=Истина;
			КонецЕсли;
			Если АвтомобильИзменен Тогда
				ЭтаФорма.АвтомобильЗаказа.ФормированиеНаименованияАвтомобиля("");
			КонецЕсли; 
			//ЭтаФорма.ПодключитьОбработчикИзмененияДанных("АвтомобильЗаказа","АвтомобильЗаказаПриИзменении",Истина);
		КонецЕсли; 
		#КонецЕсли
	    Если ВариантКомплектацииИзменен Тогда
			Результат=ОбработкаРеквизита("ВариантКомплектации",ТекСтрока,ЭтаФорма,ДопПараметры);
		КонецЕсли;
		
	ИначеЕсли Имя="ВариантКомплектации" Тогда
		//Если Автомобиль.ВариантКомплектации<>ВариантКомплектации Тогда
		//	Автомобиль = Неопределено;
		//	Результат = ОбработкаРеквизита("Автомобиль", ТекСтрока, ЭтаФорма, ДопПараметры);
		//КонецЕсли;
		Если НЕ обЗначениеНеЗаполнено(ВариантКомплектации) Тогда
			Если ВариантКомплектации.Владелец<>Модель Тогда
				Модель=ВариантКомплектации.Владелец;
				Результат=ОбработкаРеквизита("Модель",ТекСтрока,ЭтаФорма,ДопПараметры) И Результат;
			КонецЕсли;
		КонецЕсли;
		НеИзменятьЦенуАвтомобиля = Ложь;
		Если ДопПараметры<>Неопределено Тогда
			Если НЕ ДопПараметры.Свойство("НеИзменятьЦенуАвтомобиля",НеИзменятьЦенуАвтомобиля) Тогда
				НеИзменятьЦенуАвтомобиля=Ложь;
			КонецЕсли;
		КонецЕсли;
		Если НЕ НеИзменятьЦенуАвтомобиля Тогда
			Если ЗначениеЗаполнено(Автомобиль) Тогда
				ЦенаАвтомобиля = обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль, ВариантКомплектации", Автомобиль, Справочники.ВариантыКомплектации.ПустаяСсылка()),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
			Иначе
				ЦенаАвтомобиля = обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль, ВариантКомплектации", Модель, ВариантКомплектации),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
			КонецЕсли;
			Результат = ОбработкаРеквизита("ЦенаАвтомобиля",ТекСтрока,ЭтаФорма,ДопПараметры) И Результат;
		КонецЕсли;
		#Если Клиент Тогда
		Если ЭтаФорма<>Неопределено Тогда
			ЭтаФорма.СМГ_ПолучитьОборудованиеАвтомобиля();
			дкВывестиЗаголовокСуммаДокумента(ЭтаФорма);
			Если ВариантКомплектации<>ЭтаФорма.АвтомобильЗаказа.ВариантКомплектации Тогда
				ЭтаФорма.АвтомобильЗаказа.ВариантКомплектации=ВариантКомплектации;
			КонецЕсли;
		КонецЕсли; 
		#КонецЕсли
		Результат = ОбработкаРеквизита("ПроцентПредоплаты",,ЭтаФорма) И Результат;
		
	ИначеЕсли Имя="Цвет" ИЛИ Имя="ЦветКод" ИЛИ Имя="ТипСалона" Тогда
		#Если Клиент Тогда
		Если ЭтаФорма<>Неопределено Тогда
			Если ЭтотОбъект[Имя]<>ЭтаФорма.АвтомобильЗаказа[Имя] Тогда
				ЭтаФорма.АвтомобильЗаказа[Имя]=ЭтотОбъект[Имя];
			КонецЕсли;
			Если Имя="Цвет" Тогда
				ЭтаФорма.ОтключитьОбработчикИзмененияДанных("АвтомобильЗаказа");
				ЭтаФорма.АвтомобильЗаказа.ФормированиеНаименованияАвтомобиля("");
				//ЭтаФорма.ПодключитьОбработчикИзмененияДанных("АвтомобильЗаказа","АвтомобильЗаказаПриИзменении",Истина);
			КонецЕсли;
		КонецЕсли; 
		#КонецЕсли
	    Результат = Истина;
		
	ИначеЕсли Имя="ЦенаАвтомобиля" Тогда
		// Определим включают ли в себя НДС цены документа
		ЦенаВключаетНДС=(обЗначениеНеЗаполнено(ТипЦен) ИЛИ ТипЦен.ЦенаВключаетНДС);
		Если ЦенаВключаетНДС Тогда
			СуммаНДСНаАвтомобиль = Окр((ЦенаАвтомобиля*СтавкаНДСНаАвтомобиль.Ставка)/(100+СтавкаНДСНаАвтомобиль.Ставка),2);
			ЦенаСНДС = ЦенаАвтомобиля;
		Иначе
			СуммаНДСНаАвтомобиль =Окр(ЦенаАвтомобиля*СтавкаНДСНаАвтомобиль.Ставка/100,2);
			ЦенаСНДС = ЦенаАвтомобиля + СуммаНДСНаАвтомобиль;
		КонецЕсли;
		СуммаДокумента = ЦенаСНДС + СтоимостьВР;
		Результат = Истина;
		
	ИначеЕсли Имя="СтоимостьВР" Тогда
		// Определим включают ли в себя НДС цены документа
		ЦенаВключаетНДС=(обЗначениеНеЗаполнено(ТипЦен) ИЛИ ТипЦен.ЦенаВключаетНДС);
		Если ЦенаВключаетНДС Тогда
			ЦенаСНДС = ЦенаАвтомобиля;
		Иначе
			СуммаНДСНаАвтомобиль =Окр(ЦенаАвтомобиля*СтавкаНДСНаАвтомобиль.Ставка/100,2);
			ЦенаСНДС = ЦенаАвтомобиля + СуммаНДСНаАвтомобиль;
		КонецЕсли;
		СуммаДокумента = ЦенаСНДС + СтоимостьВР;
		Результат = Истина;
		
	ИначеЕсли Имя="СтавкаНДСНаАвтомобиль" Тогда
		// Семенихин 14.12.2018 +++++
		// Расчет СуммаНДСНаАвтомобиль и СуммаВсегоНаАвтомобиль		
		БазаНДС  = ЦенаАвтомобиля; // База для расчета НДС
		
		ЦенаВключаетНДС = (обЗначениеНеЗаполнено(ТипЦен) ИЛИ ТипЦен.ЦенаВключаетНДС);
		СтавкаНДС = СтавкаНДСНаАвтомобиль.Ставка;
		Если ЦенаВключаетНДС Тогда
			СуммаНДСНаАвтомобиль = Окр((БазаНДС * СтавкаНДС)/(100 + СтавкаНДС), 2);
			ЦенаСНДС = ЦенаАвтомобиля;
		Иначе
			СуммаНДСНаАвтомобиль =  Окр(БазаНДС * СтавкаНДС / 100, 2);
			ЦенаСНДС = ЦенаАвтомобиля + СуммаНДСНаАвтомобиль;
		КонецЕсли;
		СуммаДокумента = ЦенаСНДС + СтоимостьВР;
		// Семенихин 14.12.2018 -----
		Результат = Истина;
		
	ИначеЕсли Имя="СуммаНДСНаАвтомобиль" Тогда
		Возврат Результат;
		
	ИначеЕсли Имя="СуммаВсегоНаАвтомобиль" Тогда
		СкидкаНаАвтомобильАбсолютная = (СкидкаНаценкаНаАвтомобиль.СпособВычисления=Перечисления.СкидкиСпособВычисления.Абсолютная);
		Если СкидкаНаАвтомобильАбсолютная Тогда
			ЗначениеСкидкиНаАвтомобиль = СуммаСкидкиНаАвтомобиль;
		Иначе
			ЗначениеСкидкиНаАвтомобиль = ПроцентСкидкиНаАвтомобиль;
		КонецЕсли;
		// Определим включают ли в себя НДС цены документа
		ЦенаВключаетНДС=(обЗначениеНеЗаполнено(ТипЦен) ИЛИ ТипЦен.ЦенаВключаетНДС);
		Если ЦенаВключаетНДС Тогда
			Если СкидкаНаАвтомобильАбсолютная Тогда
				ЦенаАвтомобиля = Окр((СуммаВсегоНаАвтомобиль-ЗначениеСкидкиНаАвтомобиль)/(1-ПроцентСкидкиНаАвтомобиль/100),2);
			Иначе
				ЦенаАвтомобиля = Окр(СуммаВсегоНаАвтомобиль/(1-ПроцентСкидкиНаАвтомобиль/100-ЗначениеСкидкиНаАвтомобиль/100),2);
			КонецЕсли;
		Иначе
			Если СкидкаНаАвтомобильАбсолютная Тогда
				Сумма = СуммаВсегоНаАвтомобиль*100/(100+СтавкаНДСНаАвтомобиль.Ставка)+ЗначениеСкидкиНаАвтомобиль;
				ЦенаАвтомобиля = Окр(Сумма/(1-ПроцентСкидкиНаАвтомобиль/100),2);
			Иначе
				Сумма=СуммаВсегоНаАвтомобиль/(1-ПроцентСкидкиНаАвтомобиль/100-ЗначениеСкидкиНаАвтомобиль/100);
				ЦенаАвтомобиля=Окр(Сумма*100/(СтавкаНДСНаАвтомобиль.Ставка+100),2); // Учитываем, что НДС сверху.
			КонецЕсли;
		КонецЕсли;
		СуммаСкидкиНаАвтомобиль=Окр(ЦенаАвтомобиля*ПроцентСкидкиНаАвтомобиль/100,2);
		// Рассчитываем новую сумму НДС.
		СуммаАвтомобиляБезСкидки=ЦенаАвтомобиля-СуммаСкидкиНаАвтомобиль;
		Если ЦенаВключаетНДС Тогда
			СуммаНДСНаАвтомобиль = Окр((СуммаАвтомобиляБезСкидки*СтавкаНДСНаАвтомобиль.Ставка)/(100+СтавкаНДСНаАвтомобиль.Ставка),2);
		Иначе
			СуммаНДСНаАвтомобиль =Окр(СуммаАвтомобиляБезСкидки*СтавкаНДСНаАвтомобиль.Ставка/100,2);
		КонецЕсли;
	//Бондаренко-- 20250313	
	ИначеЕсли Имя="РассчитатьСкидки" Тогда
		Результат = Истина;
	//Бондаренко++ 20250313
	Иначе 
		Результат=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции // ОбработкаРеквизита()

// Функция возвращает документ поступления автомобиля
Функция ПолучитьTradeIn() Экспорт
	
	Если Ссылка=Документы.ЗаказНаАвтомобиль.ПустаяСсылка() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	             |	ЗначенияСвойствОбъектов.Объект КАК ПоступлениеАвтомобилей,
	             |	ЕСТЬNULL(ЗначенияСвойствОбъектов.Объект.Дата, ДАТАВРЕМЯ(1, 1, 1, 1, 1, 1)) КАК Дата
	             |ИЗ
	             |	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	             |ГДЕ
	             |	ЗначенияСвойствОбъектов.Объект ССЫЛКА Документ.ПоступлениеАвтомобилей
	             |	И ЗначенияСвойствОбъектов.Свойство = &Свойство
	             |	И ЗначенияСвойствОбъектов.Значение = &Значение
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Дата УБЫВ";
	Запрос.УстановитьПараметр("Свойство",ПланыВидовХарактеристик.СвойстваОбъектов.ЗаказНаАвтомобиль);
	Запрос.УстановитьПараметр("Значение",Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если НЕ Выборка.ПоступлениеАвтомобилей.Организация = Справочники.Организации.НайтиПоКоду("ЦБ000005") Тогда
			ПоступлениеАвтомобилей = Выборка.ПоступлениеАвтомобилей;
		Иначе
			ПоступлениеАвтомобилей = Неопределено;
		КонецЕсли;	
	Иначе
		ПоступлениеАвтомобилей = Неопределено;
	КонецЕсли;
	
	Возврат ПоступлениеАвтомобилей;
	
КонецФункции

//Открывает отчет по оборудованию
Процедура ВывестиОтчетОборудования() Экспорт
	
	Если ЗначениеЗаполнено(Автомобиль) Тогда
		Автомобиль.ПолучитьОбъект().ОтчетОборудованиеАвтомобиля();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

#Если Клиент Тогда

// Формирует печатную форму "ЗаказНаАвтомобиль"
// Возвращает сформированный табличный документ:
Функция ПечатьЗаказНаАвтомобиль(ТабДокумент) Экспорт
	// Предварительные обработки данных
	
	//валюта печати
	ВалютаПечатногоДокумента = зфВыборВалютыПечатногоДокумента(ЭтотОбъект);
	Если ВалютаПечатногоДокумента = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	КоэффициентПересчета = обПересчет(1, ЭтотОбъект.ВалютаДокумента, ЭтотОбъект.КурсДокумента, ВалютаПечатногоДокумента, ЭтотОбъект.Дата);
	
	// приступим к печати
	Макет = ПолучитьМакет("ЗаказНаАвтомобиль");
	
	//для начала настроим макет
	ОбластьТовар = Макет.Область("Товар");
		
	ЕстьКод = обПраво("ВыводитьКодВПечатныхФормах",Права,,ЭтотОбъект);
	//если код не выводим
	Если НЕ ЕстьКод Тогда
		ОбластьКод = Макет.Область("Код");
		ОбластьТовар.ШиринаКолонки = ОбластьТовар.ШиринаКолонки + ОбластьКод.ШиринаКолонки;
		Макет.УдалитьОбласть(ОбластьКод,ТипСмещенияТабличногоДокумента.ПоВертикали);		
	КонецЕсли;
		
	//теперь запишем параметры шапки
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	Если ЕстьКод Тогда
		КолонкаКода = дкПолучитьПараметрыРежимаВыводаКодаВДокументах(,ЭтотОбъект);
		ОбластьШапкаТаблицы.Параметры.ИмяКолонкиКод = КолонкаКода.Синоним;
	КонецЕсли;
	
	//заполняем заголовок колонки НДС по типу цен
	ОбластьШапкаТаблицы.Параметры.НДС = "НДС";
	Если ТипЦен.ЦенаВключаетНДС Тогда	// Если НДС включен
		Если НЕ (ПодразделениеКомпании.ОсвобожденОтНДС ИЛИ Организация.ОсвобожденОтНДС) Тогда	// Однако не все организации - плательщики НДС
			ОбластьШапкаТаблицы.Параметры.НДС = "в т.ч. НДС";
		КонецЕсли; 
	КонецЕсли;
	
	ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");	
	ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
	
	//вывод заголовка документа
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
	ОбластьМакета.Параметры.ВалютаДокумента = ВалютаПечатногоДокумента;
	ТекстЗаголовка = дкПолучитьПредставление(ЭтотОбъект);
	ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
    ОбластьМакета.Параметры.ОрганизацияПредставление	= спПолучитьПредставление(Организация);
	//заказчик	
	ОбластьМакета.Параметры.ЗаказчикПредставление	= спПолучитьНаименование(Заказчик);
	ОбластьМакета.Параметры.ЗаказчикПочтовыйАдрес	= спПолучитьПредставление(Заказчик, Новый Структура("АдресФактический",""));
	ОбластьМакета.Параметры.ЗаказчикТелефоны		= спПолучитьПредставление(Заказчик, Новый Структура("ТелефонРабочий",""));
	//контрагент
	ОбластьМакета.Параметры.КонтрагентПредставление	= спПолучитьПредставление(Контрагент);
	ОбластьМакета.Параметры.СрокПоставки			= Формат(СрокПоставки,"ДФ='dd.ММММ.yyyy'; ДП=""Неопределен""");
	ОбластьМакета.Параметры.СуммаПредоплаты			= Формат(СуммаПредоплаты * КоэффициентПересчета,  ?(НЕ ПустаяСтрока(ФорматВыводаСуммы),ФорматВыводаСуммы,ФорматВыводаСуммы + "ЧДЦ=2; ЧН=0,00"));
	//автомобиль
	ОбластьМакета.Параметры.Заполнить(ВариантКомплектации);	
	ОбластьМакета.Параметры.АвтомобильМодель		= спПолучитьНаименование(Модель);
	ОбластьМакета.Параметры.АвтомобильВариантКомплектации = спПолучитьНаименование(ВариантКомплектации);
	ОбластьМакета.Параметры.АвтомобильЦвет			= спПолучитьНаименование(Цвет);
	ОбластьМакета.Параметры.АвтомобильЦветКод		= ЦветКод;
	ОбластьМакета.Параметры.АвтомобильТипКузова		= спПолучитьНаименование(ВариантКомплектации.ТипКузова);
	ОбластьМакета.Параметры.АвтомобильТипДвигателя	= спПолучитьНаименование(ВариантКомплектации.ТипДвигателя);
	ОбластьМакета.Параметры.АвтомобильТипКПП		= спПолучитьНаименование(ВариантКомплектации.ТипКПП);
	ОбластьМакета.Параметры.АвтомобильТипСалона		= спПолучитьНаименование(ТипСалона);
	
	ОбластьМакета.Параметры.АвтомобильЦена			= Формат(ЦенаАвтомобиля * КоэффициентПересчета,  ?(НЕ ПустаяСтрока(ФорматВыводаСуммы),ФорматВыводаСуммы,ФорматВыводаСуммы + "ЧДЦ=2; ЧН=0,00"));
	ОбластьМакета.Параметры.ПредставлениеНДС		= ?(ТипЦен.ЦенаВключаетНДС,"В т.ч. ","")+"НДС" + " (" + СтавкаНДСНаАвтомобиль.Ставка + "%)" + ": "+Формат(СуммаНДСНаАвтомобиль * КоэффициентПересчета,  ?(НЕ ПустаяСтрока(ФорматВыводаСуммы),ФорматВыводаСуммы,ФорматВыводаСуммы + "ЧДЦ=2; ЧН=0,00"));
	ОбластьМакета.Параметры.ПредставлениеСкидки		= ?(СкидкаНаценкаНаАвтомобиль.СпособВычисления = Перечисления.СкидкиСпособВычисления.Абсолютная, "", " (" + Формат(СкидкаНаценкаНаАвтомобиль.ЗначениеСкидки,"ЧДЦ=2; ЧН=0,00") + "%): ") + Формат(СуммаСкидкиНаАвтомобиль * КоэффициентПересчета, ?(НЕ ПустаяСтрока(ФорматВыводаСуммы),ФорматВыводаСуммы,ФорматВыводаСуммы + "ЧДЦ=2; ЧН=0,00"));
	ОбластьМакета.Параметры.СуммаВсегоНаАвтомобиль	= Формат(СуммаВсегоНаАвтомобиль * КоэффициентПересчета, ?(НЕ ПустаяСтрока(ФорматВыводаСуммы),ФорматВыводаСуммы,ФорматВыводаСуммы + "ЧДЦ=2; ЧН=0,00"));
	
	//базовое оборудование автомобиля
	ТекстЗапроса = "ВЫБРАТЬ
	|	ОпцииВариантовКомплектации.Опция КАК Опция,
	|	ОпцииВариантовКомплектации.Количество КАК Количество
	|ИЗ
	|	РегистрСведений.ОпцииВариантовКомплектации КАК ОпцииВариантовКомплектации
	|ГДЕ
	|	ОпцииВариантовКомплектации.ВариантКомплектации = &ВариантКомплектации
	|	И ОпцииВариантовКомплектации.ВидВключения = &ВидВключения";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ВариантКомплектации", ВариантКомплектации);
	Запрос.УстановитьПараметр("ВидВключения", 2);
	
	Выборка = Запрос.Выполнить().Выбрать();	СтрокаДопОборудования = "";
	Пока Выборка.Следующий() Цикл
		СтрокаДопОборудования = СтрокаДопОборудования + спПолучитьНаименование(Выборка.Опция) + ?(Выборка.Количество = 0,"","("+Выборка.Количество+")") + " ,";
	КонецЦикла;
	ОбластьМакета.Параметры.СписокБазовогоОборудования = Лев(СтрокаДопОборудования, СтрДлина(СтрокаДопОборудования) - 2);
	
	//вывод свойств
	СтрокаСвойств = дкПолучитьСтрокуСвойствДокумента(ЭтотОбъект);
	ОбластьМакета.Параметры.СтрокаСвойств = СтрокаСвойств;
	ТабДокумент.Вывести(ОбластьМакета);
	
	//сразу два, т.к. выводим на второй странице только
	НомерСтраницы = 2;
	НомерСтраницыПред = НомерСтраницы;
	
	//готовим области строки
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
	СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента,СуммаСкидки,СуммаНДС,СуммаВсего",ВалютаПечатногоДокумента,0,0,0);
	
	//заполним параметры шапки таблицы для следующего листа
	ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
	
	// Выводим представления и расшифровки подписей
	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	
	ОбластьМакета.Параметры.ВалютаДокумента	= ВалютаПечатногоДокумента;
	ОбластьМакета.Параметры.СуммаДокумента	= Формат(СуммаДокумента * КоэффициентПересчета,  ?(НЕ ПустаяСтрока(ФорматВыводаСуммы),ФорматВыводаСуммы,ФорматВыводаСуммы + "ЧДЦ=2; ЧН=0,00"));
	ОбластьМакета.Параметры.СуммаДокументаПрописью = обЧислоПрописью(СуммаДокумента*КоэффициентПересчета,ВалютаПечатногоДокумента);
	СуммаНДС = СуммаНДСНаАвтомобиль;
	ОбластьМакета.Параметры.СуммаНДС		= Формат(СуммаНДС * КоэффициентПересчета,  ?(НЕ ПустаяСтрока(ФорматВыводаСуммы),ФорматВыводаСуммы,ФорматВыводаСуммы + "ЧДЦ=2; ЧН=0,00"));
	
	Исполнитель = дкОтветственноеЛицо(ЭтотОбъект,"Исполнитель");
	Исполнитель.ИсполнительПредставление = ?(обЗначениеНеЗаполнено(Исполнитель.Исполнитель),"","/ "+ Исполнитель.ИсполнительПредставление);
	ОбластьМакета.Параметры.Заполнить(Исполнитель);
	ОЛЗаказчик	= дкОтветственноеЛицо(ЭтотОбъект,"Заказчик");
	ОЛЗаказчик.ЗаказчикПредставление = ?(обЗначениеНеЗаполнено(ОЛЗаказчик.Заказчик),"","/ "+ ОЛЗаказчик.ЗаказчикПредставление);
	ОбластьМакета.Параметры.Заполнить(ОЛЗаказчик);
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабДокумент;
КонецФункции

// Функция печати договора продажи
Функция ПечатьДоговорПродажи(ТабДокумент) Экспорт
	//валюта печати
	ВалютаПечатногоДокумента = зфВыборВалютыПечатногоДокумента(ЭтотОбъект);
	Если ВалютаПечатногоДокумента = Неопределено Тогда Возврат Неопределено; КонецЕсли;
	
	НомерДляПечати=дкПолучитьНомерДляПечати(ЭтотОбъект);
	
	//макет
	Макет = ПолучитьМакет("ДоговорПродажи");
	//заголовок документа
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.НомерДоговора = НомерДляПечати;
	ОбластьМакета.Параметры.ДатаДоговора = Формат(Дата,"ДФ=dd.MM.yyyy");
	
	ОбластьМакета.Параметры.ПредставлениеОрганизации = спПолучитьНаименование(ЭтотОбъект.Организация);
	ОбластьМакета.Параметры.ФирмаАдрес = киПолучитьПредставлениеКИ(Организация,Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	ОбластьМакета.Параметры.ФирмаТелефоны = киПолучитьПредставлениеКИ(Организация,Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	
	ОбластьМакета.Параметры.ЗаказчикПолноеНаименование = спПолучитьНаименование(Заказчик);
	ОбластьМакета.Параметры.ЗаказчикПочтовыйАдрес = киПолучитьПредставлениеКИ(Заказчик,Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
	ОбластьМакета.Параметры.ЗаказчикТелефоны = киПолучитьПредставлениеКИ(Заказчик,Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "	
		|ВЫБРАТЬ
		|	ПодтверждающиеДокументы.Ссылка КАК Документ,
		|	ПодтверждающиеДокументы.КемВыдан КАК ДокументКемВыдан,
		|	ПодтверждающиеДокументы.ДатаВыдачи КАК ДокументДатаВыдачи,
		|	ПодтверждающиеДокументы.ВидПодтверждающегоДокумента КАК ВидДокумента
		|ИЗ
		|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
		|ГДЕ
		|	ПодтверждающиеДокументы.Владелец = &Владелец
		|	И ПодтверждающиеДокументы.Текущий = ИСТИНА
		|";
	Запрос.УстановитьПараметр("Владелец", ЭтотОбъект.Заказчик);		
	ВыборкаДокументов = Запрос.Выполнить().Выбрать();
	Если ВыборкаДокументов.Количество()=0 Тогда
		ОбластьМакета.Параметры.ЗаказчикДокумент				= "_________________";
		ОбластьМакета.Параметры.ЗаказчикДокументКемВыдан		= "___________";
		ОбластьМакета.Параметры.ЗаказчикДокументДатаВыдачи		= "___________";
	Иначе 
		ВыборкаДокументов.Следующий();
		ОбластьМакета.Параметры.ЗаказчикДокумент				= Строка(ВыборкаДокументов.ВидДокумента) + ": " + ВыборкаДокументов.Документ;
		ОбластьМакета.Параметры.ЗаказчикДокументКемВыдан		= ВыборкаДокументов.ДокументКемВыдан;
		ОбластьМакета.Параметры.ЗаказчикДокументДатаВыдачи		= Формат(ВыборкаДокументов.ДокументДатаВыдачи,"ДФ='dd MMMM yyyy'");
	КонецЕсли;
	
	Руководитель = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.Руководитель);
	ОбластьМакета.Параметры.РуководительДолжность 		= Руководитель.РуководительДолжность;
	ОбластьМакета.Параметры.РуководительПредставление 	= Руководитель.РуководительПредставление;
	
	СуммаПредоплатыПечать=обПересчет(СуммаПредоплаты,ВалютаДокумента,Дата,ВалютаПечатногоДокумента,Дата,РежимОкругления.Окр15как20);
	ОбластьМакета.Параметры.СуммаПредоплаты 		= СуммаПредоплатыПечать;
	ОбластьМакета.Параметры.СуммаПредоплатыПрописью = обЧислоПрописью(СуммаПредоплатыПечать,ВалютаПечатногоДокумента);
	//ОбластьМакета.Параметры.ВалютаДокумента 		= ВалютаПечатногоДокумента;
	ОбластьМакета.Параметры.СрокПоставки    		= Формат(СрокПоставки,"ДФ=dd MMMM yyyy");
	ОбластьМакета.Параметры.ПредставлениеАвтомобиля = " модель """+спПолучитьНаименование(Модель)+?(обЗначениеНеЗаполнено(ВариантКомплектации),"",""" в комплектации """+спПолучитьНаименование(ВариантКомплектации)+"""");
	
	СуммаВсегоНаАвтомобильПечать = РассчитатьСуммуВсего();
	СуммаВсегоНаАвтомобильПечать = обПересчет(СуммаВсегоНаАвтомобильПечать,ВалютаДокумента,Дата,ВалютаПечатногоДокумента,Дата,РежимОкругления.Окр15как20);
	ОбластьМакета.Параметры.СуммаВсегоНаАвтомобиль 			= СуммаВсегоНаАвтомобильПечать;
	ОбластьМакета.Параметры.СуммаВсегоНаАвтомобильПрописью 	= обЧислоПрописью(СуммаВсегоНаАвтомобильПечать,ВалютаПечатногоДокумента);
	
	ОбластьМакета.Параметры.СтавкаНДСНаАвтомобиль 			= СтавкаНДСНаАвтомобиль.Ставка;
	СуммаНДСНаАвтомобильПечать = обПересчет(РассчитатьСуммуНДСВсего(),ВалютаДокумента,Дата,ВалютаПечатногоДокумента,Дата,РежимОкругления.Окр15как20);
	ОбластьМакета.Параметры.СуммаНДСНаАвтомобиль 			= СуммаНДСНаАвтомобильПечать;
	ОбластьМакета.Параметры.СуммаНДСНаАвтомобильПрописью 	= обЧислоПрописью(СуммаНДСНаАвтомобильПечать,ВалютаПечатногоДокумента);
	
	ОбластьМакета.Параметры.ПроцентПредоплаты 				= ПроцентПредоплаты;
	ОбластьМакета.Параметры.ПроцентПредоплатыПрописью 		= ЧислоПрописью(ПроцентПредоплаты);
	СуммаПредоплатыПечать = обПересчет(СуммаПредоплаты,ВалютаДокумента,Дата,ВалютаПечатногоДокумента,Дата,РежимОкругления.Окр15как20);
	ОбластьМакета.Параметры.СуммаПредоплаты   				= СуммаПредоплатыПечать;
	ОбластьМакета.Параметры.СуммаПредоплатыПрописью   		= обЧислоПрописью(СуммаПредоплатыПечать,ВалютаПечатногоДокумента);
	СуммаНДСПредоплатыПечать = обПересчет(РассчитатьСуммуНДСВсего()*ПроцентПредоплаты/100,ВалютаДокумента,Дата,ВалютаПечатногоДокумента,Дата,РежимОкругления.Окр15как20);
	ОбластьМакета.Параметры.СуммаНДСПредоплаты   			= СуммаНДСПредоплатыПечать;
	ОбластьМакета.Параметры.СуммаНДСПредоплатыПрописью   	= обЧислоПрописью(СуммаНДСПредоплатыПечать,ВалютаПечатногоДокумента);
	
	ПроцентДоплаты = 100 - ПроцентПредоплаты;
	СуммаДоплаты = СуммаВсегоНаАвтомобильПечать - СуммаПредоплатыПечать;
	ОбластьМакета.Параметры.ПроцентДоплаты 					= ПроцентДоплаты;
	ОбластьМакета.Параметры.ПроцентДоплатыПрописью 			= ЧислоПрописью(ПроцентДоплаты);
	ОбластьМакета.Параметры.СуммаДоплаты   					= СуммаДоплаты;
	ОбластьМакета.Параметры.СуммаДоплатыПрописью   			= обЧислоПрописью(СуммаДоплаты,ВалютаПечатногоДокумента);
	СуммаНДСВсегоПечать = Окр(обПересчет(РассчитатьСуммуНДСВсего(),ВалютаДокумента,Дата,ВалютаПечатногоДокумента,Дата,РежимОкругления.Окр15как20),2,РежимОкругления.Окр15как20);
	СуммаНДСДоплаты = СуммаНДСВсегоПечать - СуммаНДСПредоплатыПечать;
	ОбластьМакета.Параметры.СуммаНДСДоплаты		   			= СуммаНДСДоплаты;
	ОбластьМакета.Параметры.СуммаНДСДоплатыПрописью   		= обЧислоПрописью(СуммаНДСДоплаты,ВалютаПечатногоДокумента);
	
	ОбластьМакета.Параметры.ИННКПП 							= "ИНН " + Организация.ИНН + " / КПП " + Организация.КПП;
	
	ОбластьМакета.Параметры.НомерСчетаПолучателя	= ЭтотОбъект.Организация.ОсновнойБанковскийСчет.НомерСчета;
	ОбластьМакета.Параметры.БанкПолучателя			= ЭтотОбъект.Организация.ОсновнойБанковскийСчет.Банк;
	ОбластьМакета.Параметры.БИКБанкаПолучателя		= ЭтотОбъект.Организация.ОсновнойБанковскийСчет.Банк.Код;
	ОбластьМакета.Параметры.СчетБанкаПолучателя		= ЭтотОбъект.Организация.ОсновнойБанковскийСчет.Банк.КоррСчет;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ПриложениеШапка");
	ОбластьМакета.Параметры.НомерДоговора = НомерДляПечати;
	ОбластьМакета.Параметры.ДатаДоговора = Формат(Дата,"ДФ=dd.MM.yyyy");
	ТабДокумент.Вывести(ОбластьМакета);
	
	//базовое доп. оборудование
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОпцииВариантовКомплектации.Опция КАК Опция
	|ИЗ
	|	РегистрСведений.ОпцииВариантовКомплектации КАК ОпцииВариантовКомплектации
	|ГДЕ
	|	ОпцииВариантовКомплектации.ВариантКомплектации = &ВариантКомплектации
	|	И ОпцииВариантовКомплектации.ВидВключения = &ВидВключения";
	Запрос.УстановитьПараметр("ВариантКомплектации", ВариантКомплектации);
	Запрос.УстановитьПараметр("ВидВключения", 2);
	СписокДопОборудования = Запрос.Выполнить().Выгрузить();
	
	Если СписокДопОборудования.Количество() > 0 Тогда
		//Шапка таблицы
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыОборудование");
		ТабДокумент.Вывести(ОбластьМакета);
		//Таблица
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаОборудование");
		НомерСтроки = 1;
		Для каждого ТекДопОб Из СписокДопОборудования Цикл
			ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
			ОбластьМакета.Параметры.ОборудованиеНаименование = спПолучитьНаименование(ТекДопОб.Опция);
			ОбластьМакета.Параметры.Оборудование = ТекДопОб.Опция;
			НомерСтроки = НомерСтроки + 1;
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
	КонецЕсли; 

	Возврат ТабДокумент;
КонецФункции

// Формирует печатную форму "Акт приема"
// Возвращает сформированный табличный документ:
Функция ПечатьАктПриема(ТабДокумент) Экспорт
	
	СвойствоМодель = обПолучитьЗначениеСвойства(ЭтотОбъект,"Модель");
	
	Если НЕ ЗначениеЗаполнено(СвойствоМодель) Тогда
		Предупреждение("Акт осмотра автомобиля может быть напечатан, если указана модель автомобиля для поступления по Trade-In!");		
		Возврат Неопределено;
	КонецЕсли;
	
	Макет = Документы.ПоступлениеАвтомобилей.ПолучитьМакет("АктПриема");
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	
	НомерДляПечати=дкПолучитьНомерДляПечати(ЭтотОбъект,Истина);
	
	ОбластьМакета.Параметры.ЗаголовокПФ = "осмотра автомобиля с пробегом";
	ОбластьМакета.Параметры.Номер = НомерДляПечати;
	ОбластьМакета.Параметры.Дата = Формат(ЭтотОбъект.Дата,"ДЛФ=DD");
	ОбластьМакета.Параметры.МодельНаименование = спПолучитьНаименование(СвойствоМодель);
	ОбластьМакета.Параметры.Модель = СвойствоМодель;
	ОбластьМакета.Параметры.ГодВыпуска = Формат(обПолучитьЗначениеСвойства(ЭтотОбъект,"ГодВыпуска"),"ДФ=гггг");
	ОбластьМакета.Параметры.Цвет = обПолучитьЗначениеСвойства(ЭтотОбъект,"Цвет");
	ОбластьМакета.Параметры.Пробег = ?(ЗначениеЗаполнено(обПолучитьЗначениеСвойства(ЭтотОбъект,"Пробег")),СокрЛП(обПолучитьЗначениеСвойства(ЭтотОбъект,"Пробег")),"");
	
	Комплектация = обПолучитьЗначениеСвойства(ЭтотОбъект,"ВариантКомплектации");
	ОбластьМакета.Параметры.Комплектация = Комплектация;
	Если ЗначениеЗаполнено(Комплектация) Тогда 
		ОбластьМакета.Параметры.ТипКПП = Комплектация.ТипКПП;
		Если НЕ Комплектация.ТипДвигателя.Пустая() Тогда
			ОбластьМакета.Параметры.ОбъемДвигателя = Комплектация.ТипДвигателя.ОбъемДвигателя;
		КонецЕсли;
	КонецЕсли;	
	
	ОбластьМакета.Параметры.ОписаниеКомитента = Контрагент.НаименованиеПолное;
	ОбластьМакета.Параметры.ОписаниеКомиссионера = Организация.НаименованиеПолное;
	
	ТабДокумент.Вывести(ОбластьМакета);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	Возврат ТабДокумент;
	
КонецФункции

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
// Параметры: НазваниеМакета - строка, название макета, если пусто - то по умолчанию,
//   Документ - сюда можно передать уже созданный табличный документ для заполнения
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=1, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	// Вызов конкретно печатной формы и печать результата прописано в общем модуле
	// здесь могут быть вставлены дополнительные механизмы
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции

// Возвращает доступные варианты печати документа
// Возвращаемое значение: Структура, каждая строка которой
// соответствует одному из вариантов печати
// Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм() Экспорт
	СтруктураМакетов=Новый Структура();
	//Гэндальф+++
	//СтруктураМакетов.Вставить("ЗаказНаАвтомобиль", "Заказ на автомобиль");
	//СтруктураМакетов.Вставить("ДоговорПродажи","Договор продажи");
	//СтруктураМакетов.Вставить("АктПриема", "Акт осмотра автомобиля с пробегом");
	//Гэндальф---
	Возврат СтруктураМакетов;
КонецФункции

//ШАБЛОНЫ ОФИСНЫХ ДОКУМЕНТОВ

// Формирует структуру с данными объекта, которые необходимы для заполнения шаблона
Функция ПолучитьДанныеОбъекта() Экспорт
		
	//валюта печати
	ВалютаПечатногоДокумента = зфВыборВалютыПечатногоДокумента(ЭтотОбъект);
	Если ВалютаПечатногоДокумента = Неопределено Тогда Возврат Неопределено; КонецЕсли;
	
	НомерДляПечати=дкПолучитьНомерДляПечати(ЭтотОбъект);
	
	ДанныеОбъекта = Новый Структура;
	
	ДанныеОбъекта.Вставить("НомерДоговора", НомерДляПечати);
	ДанныеОбъекта.Вставить("ДатаДоговора", Формат(Дата,"ДФ=dd.MM.yyyy"));
	ДанныеОбъекта.Вставить("ПредставлениеОрганизации", спПолучитьНаименование(ЭтотОбъект.Организация));
	ДанныеОбъекта.Вставить("ФирмаАдрес", киПолучитьПредставлениеКИ(Организация,Справочники.ВидыКонтактнойИнформации.АдресЮридический));
	ДанныеОбъекта.Вставить("ФирмаТелефоны", киПолучитьПредставлениеКИ(Организация,Справочники.ВидыКонтактнойИнформации.ТелефонРабочий));
	ДанныеОбъекта.Вставить("ЗаказчикПолноеНаименование", спПолучитьНаименование(Заказчик));
	ДанныеОбъекта.Вставить("ЗаказчикПочтовыйАдрес", киПолучитьПредставлениеКИ(Заказчик,Справочники.ВидыКонтактнойИнформации.АдресПочтовый));
	ДанныеОбъекта.Вставить("ЗаказчикТелефоны", киПолучитьПредставлениеКИ(Заказчик,Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "	
		|ВЫБРАТЬ
		|	ПодтверждающиеДокументы.Ссылка КАК Документ,
		|	ПодтверждающиеДокументы.КемВыдан КАК ДокументКемВыдан,
		|	ПодтверждающиеДокументы.ДатаВыдачи КАК ДокументДатаВыдачи,
		|	ПодтверждающиеДокументы.ВидПодтверждающегоДокумента КАК ВидДокумента
		|ИЗ
		|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
		|ГДЕ
		|	ПодтверждающиеДокументы.Владелец = &Владелец
		|	И ПодтверждающиеДокументы.Текущий = ИСТИНА
		|";
	Запрос.УстановитьПараметр("Владелец", ЭтотОбъект.Заказчик);		
	ВыборкаДокументов = Запрос.Выполнить().Выбрать();
	Если ВыборкаДокументов.Количество()=0 Тогда
		ДанныеОбъекта.Вставить("ЗаказчикДокумент", "_________________");
		ДанныеОбъекта.Вставить("ЗаказчикДокументКемВыдан", "___________");
		ДанныеОбъекта.Вставить("ЗаказчикДокументДатаВыдачи", "___________");
	Иначе 
		ВыборкаДокументов.Следующий();
		ДанныеОбъекта.Вставить("ЗаказчикДокумент", Строка(ВыборкаДокументов.ВидДокумента) + ": " + ВыборкаДокументов.Документ);
		ДанныеОбъекта.Вставить("ЗаказчикДокументКемВыдан", ВыборкаДокументов.ДокументКемВыдан);
		ДанныеОбъекта.Вставить("ЗаказчикДокументДатаВыдачи", Формат(ВыборкаДокументов.ДокументДатаВыдачи,"ДФ='dd MMMM yyyy'"));
	КонецЕсли;
	
	Руководитель = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.Руководитель);
	ДанныеОбъекта.Вставить("РуководительДолжность", Руководитель.РуководительДолжность);
	ДанныеОбъекта.Вставить("РуководительПредставление", Руководитель.РуководительПредставление);
	
	СуммаПредоплатыПечать=обПересчет(СуммаПредоплаты,ВалютаДокумента,Дата,ВалютаПечатногоДокумента,Дата,РежимОкругления.Окр15как20);
	ДанныеОбъекта.Вставить("СуммаПредоплаты", СуммаПредоплатыПечать);
	ДанныеОбъекта.Вставить("СуммаПредоплатыПрописью", обЧислоПрописью(СуммаПредоплатыПечать,ВалютаПечатногоДокумента));
	ДанныеОбъекта.Вставить("СрокПоставки", Формат(СрокПоставки,"ДФ=dd MMMM yyyy"));
	ДанныеОбъекта.Вставить("ПредставлениеАвтомобиля", " модель """+спПолучитьНаименование(Модель)+?(обЗначениеНеЗаполнено(ВариантКомплектации),"",""" в комплектации """+спПолучитьНаименование(ВариантКомплектации)+""""));
	
	СуммаВсегоНаАвтомобильПечать = РассчитатьСуммуВсего();
	СуммаВсегоНаАвтомобильПечать = обПересчет(СуммаВсегоНаАвтомобильПечать,ВалютаДокумента,Дата,ВалютаПечатногоДокумента,Дата,РежимОкругления.Окр15как20);
	ДанныеОбъекта.Вставить("СуммаВсегоНаАвтомобиль", СуммаВсегоНаАвтомобильПечать);
	ДанныеОбъекта.Вставить("СуммаВсегоНаАвтомобильПрописью", обЧислоПрописью(СуммаВсегоНаАвтомобильПечать,ВалютаПечатногоДокумента));	
	
	ДанныеОбъекта.Вставить("СтавкаНДСНаАвтомобиль", СтавкаНДСНаАвтомобиль.Ставка);
	СуммаНДСНаАвтомобильПечать = обПересчет(РассчитатьСуммуНДСВсего(),ВалютаДокумента,Дата,ВалютаПечатногоДокумента,Дата,РежимОкругления.Окр15как20);
	ДанныеОбъекта.Вставить("СуммаНДСНаАвтомобиль", СуммаНДСНаАвтомобильПечать);
	ДанныеОбъекта.Вставить("СуммаНДСНаАвтомобильПрописью", обЧислоПрописью(СуммаНДСНаАвтомобильПечать,ВалютаПечатногоДокумента));
	
	ДанныеОбъекта.Вставить("ПроцентПредоплаты", ПроцентПредоплаты);
	ДанныеОбъекта.Вставить("ПроцентПредоплатыПрописью", ЧислоПрописью(ПроцентПредоплаты));
	
	СуммаПредоплатыПечать = обПересчет(СуммаПредоплаты,ВалютаДокумента,Дата,ВалютаПечатногоДокумента,Дата,РежимОкругления.Окр15как20);
	ДанныеОбъекта.Вставить("СуммаПредоплаты", СуммаПредоплатыПечать);
	ДанныеОбъекта.Вставить("СуммаПредоплатыПрописью", обЧислоПрописью(СуммаПредоплатыПечать,ВалютаПечатногоДокумента));
	
	СуммаНДСПредоплатыПечать = обПересчет(РассчитатьСуммуНДСВсего()*ПроцентПредоплаты/100,ВалютаДокумента,Дата,ВалютаПечатногоДокумента,Дата,РежимОкругления.Окр15как20);
	ДанныеОбъекта.Вставить("СуммаНДСПредоплаты", СуммаНДСПредоплатыПечать);
	ДанныеОбъекта.Вставить("СуммаНДСПредоплатыПрописью", обЧислоПрописью(СуммаНДСПредоплатыПечать,ВалютаПечатногоДокумента));
	
	ПроцентДоплаты = 100 - ПроцентПредоплаты;
	СуммаДоплаты = СуммаВсегоНаАвтомобильПечать - СуммаПредоплатыПечать;
	ДанныеОбъекта.Вставить("ПроцентДоплаты", ПроцентДоплаты);
	ДанныеОбъекта.Вставить("ПроцентДоплатыПрописью", ЧислоПрописью(ПроцентДоплаты));
	ДанныеОбъекта.Вставить("СуммаДоплаты", СуммаДоплаты);
	ДанныеОбъекта.Вставить("СуммаДоплатыПрописью", обЧислоПрописью(СуммаДоплаты,ВалютаПечатногоДокумента));
	
	СуммаНДСДоплаты = СуммаНДСНаАвтомобильПечать - СуммаНДСПредоплатыПечать;
	ДанныеОбъекта.Вставить("СуммаНДСДоплаты", СуммаНДСДоплаты);
	ДанныеОбъекта.Вставить("СуммаНДСДоплатыПрописью", обЧислоПрописью(СуммаНДСДоплаты,ВалютаПечатногоДокумента));
	
	ДанныеОбъекта.Вставить("ИННКПП", "ИНН " + Организация.ИНН + " / КПП " + Организация.КПП);
	
	ДанныеОбъекта.Вставить("НомерСчетаПолучателя", ЭтотОбъект.Организация.ОсновнойБанковскийСчет.НомерСчета);
	ДанныеОбъекта.Вставить("БанкПолучателя", ЭтотОбъект.Организация.ОсновнойБанковскийСчет.Банк);
	ДанныеОбъекта.Вставить("БИКБанкаПолучателя", ЭтотОбъект.Организация.ОсновнойБанковскийСчет.Банк.Код);
	ДанныеОбъекта.Вставить("СчетБанкаПолучателя", ЭтотОбъект.Организация.ОсновнойБанковскийСчет.Банк.КоррСчет);
	
	//заголовок--
	
	//ДанныеОбъекта.Вставить("НомерДоговора", НомерДляПечати);
	//ДанныеОбъекта.Вставить("ДатаДоговора", Формат(Дата,"ДФ=dd.MM.yyyy");	
	
	//базовое доп. оборудование
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОпцииВариантовКомплектации.Опция КАК Опция
	|ИЗ
	|	РегистрСведений.ОпцииВариантовКомплектации КАК ОпцииВариантовКомплектации
	|ГДЕ
	|	ОпцииВариантовКомплектации.ВариантКомплектации = &ВариантКомплектации
	|	И ОпцииВариантовКомплектации.ВидВключения = &ВидВключения";
	Запрос.УстановитьПараметр("ВариантКомплектации", ВариантКомплектации);
	Запрос.УстановитьПараметр("ВидВключения", 2);
	СписокДопОборудования = Запрос.Выполнить().Выгрузить();

	
	ДанныеОбъекта.Вставить("ТаблицаДопОборудования", Новый Структура);		
	Если СписокДопОборудования.Количество() > 0 Тогда

		//Шапка таблицы
		
		//Таблица
		ДанныеОбъекта.ТаблицаДопОборудования.Вставить("Строки", Новый Массив);		
		
		НомерСтрокиПоПорядку = 0;
		
		Для каждого СтрокаДопОб Из СписокДопОборудования Цикл
			НомерСтрокиПоПорядку = НомерСтрокиПоПорядку + 1;
			СтрокаТаблицы = Новый Структура;
			СтрокаТаблицы.Вставить("НомерСтроки",		НомерСтрокиПоПорядку);
			СтрокаТаблицы.Вставить("ОборудованиеНаименование",		спПолучитьНаименование(СтрокаДопОб.Опция));
			СтрокаТаблицы.Вставить("Оборудование",		СтрокаДопОб.Опция);
			
			ДанныеОбъекта.ТаблицаДопОборудования.Строки.Добавить(СтрокаТаблицы);
		КонецЦикла;
	КонецЕсли; 
	
	Возврат ДанныеОбъекта;
	
КонецФункции

// Формирует структуру с описанием областей шаблона
Функция ПолучитьОписаниеОбластейМакетаОфисногоДокумента() Экспорт
	
	ОписаниеОбластей = Новый Структура;
	
	пчДобавитьОписаниеОбласти(ОписаниеОбластей, "ВерхнийКолонтитул",	"ВерхнийКолонтитул");
	пчДобавитьОписаниеОбласти(ОписаниеОбластей, "НижнийКолонтитул",		"НижнийКолонтитул");
	пчДобавитьОписаниеОбласти(ОписаниеОбластей, "Заголовок",	"Общая");
	пчДобавитьОписаниеОбласти(ОписаниеОбластей, "Приложение",		"Общая");
	пчДобавитьОписаниеОбласти(ОписаниеОбластей, "ШапкаТаблицы",		"Общая");
	пчДобавитьОписаниеОбласти(ОписаниеОбластей, "Строка",	"СтрокаТаблицы");
	пчДобавитьОписаниеОбласти(ОписаниеОбластей, "ШапкаТаблицыОборудование",		"Общая");
	пчДобавитьОписаниеОбласти(ОписаниеОбластей, "СтрокаОборудование",			"СтрокаТаблицы");
	пчДобавитьОписаниеОбласти(ОписаниеОбластей, "Подвал",	"Общая");
		
	Возврат ОписаниеОбластей;
	
КонецФункции

// Формирует печатную форму "ЗаказНаряд"
// Возвращает сформированный табличный документ:
Функция ПечатьШаблонаЗаказНаАвтомобильДоговорПродажи(ТабДокумент,ДвоичныеДанныеМакета,ИмяМакета) Экспорт
	
	Области = ПолучитьОписаниеОбластейМакетаОфисногоДокумента();
	ДанныеОбъекта = ПолучитьДанныеОбъекта();

	Попытка
		
		Если пчПроверитьCOMСоединениеMSWord() Тогда
			ТипМакета = "MS";
		ИначеЕсли пчПроверитьCOMСоединениеOOWriter() Тогда
			ТипМакета = "OO";
		Иначе
			Сообщить("Ошибка при попытке установки соединения. 
			|Для вывода печатных форм требуется, чтобы на компьютере был установлен пакет Microsoft Office или Open Office.");
			Возврат Ложь;	
		КонецЕсли;
		
		//Если Вопрос("WORD - ДА, OpenOffice - НЕТ",РежимДиалогаВопрос.ДаНет,5,КодВозвратаДиалога.Да) = КодВозвратаДиалога.Да Тогда
		//	ТипМакета = "MS";
		//Иначе
		//	ТипМакета = "OO";
		//КонецЕсли;
		
		Макет		   = пчИнициализироватьМакет(ДвоичныеДанныеМакета, ТипМакета);
 		ПечатнаяФорма  = пчИнициализироватьПечатнуюФорму(ТипМакета, Макет.НастройкиСтраницыМакета);
		
		Если ПечатнаяФорма <> Неопределено И Макет <> Неопределено Тогда
			
			// Вывод колонтитулов документа.
			Область = пчПолучитьОбласть(Макет, Области["ВерхнийКолонтитул"]);
			пчПрисоединитьОбласть(ПечатнаяФорма, Область);
			
			Область = пчПолучитьОбласть(Макет, Области["НижнийКолонтитул"]);
			пчПрисоединитьОбласть(ПечатнаяФорма, Область);
			
			Область = пчПолучитьОбласть(Макет, Области["Заголовок"]);
			пчПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта);
			
			Область = пчПолучитьОбласть(Макет, Области["Приложение"]);
			пчПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
			
			пчПоказатьДокумент(ПечатнаяФорма);
		КонецЕсли;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Сообщить(ИнформацияОбОшибке);
		пчОчиститьСсылки(ПечатнаяФорма,Ложь);
		пчОчиститьСсылки(Макет);
		Возврат Ложь;
	КонецПопытки;
	
	пчОчиститьСсылки(ПечатнаяФорма,Ложь);
	пчОчиститьСсылки(Макет);
	
	Возврат ТабДокумент;
	
КонецФункции

#КонецЕсли
// Если Клиент Тогда - завершена клиентская часть

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Процедура - обработчик ввода на основании
Процедура ОбработкаЗаполнения(Основание) Экспорт
	Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда
		Возврат;
	КонецЕсли;
	ХозОперация = Справочники.ХозОперации.ЗаказНаВыкупАвтомобиля;
	СтавкаНДСНаАвтомобиль = Справочники.СтавкиНДС.БезНДС;
	
	Если ТипЗнч(Основание) = Тип("СправочникСсылка.Автомобили") И (НЕ Основание.ЭтоГруппа) Тогда
 		Автомобиль = Основание;
 		ОбработкаРеквизита("Автомобиль");
 	КонецЕсли; 
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.РабочийЛист") Тогда
 		Контрагент = Основание.СобственникТрейдИн;                                                                 
		ПодразделениеКомпании = СМ_ФормированиеНовыхОбъектов.СМГ_НайтиПодразделениеПоРодителю(Основание.Организация,Основание.ПОдразделениеКомпании);
 		Организация = Основание.Организация;
		//Бондаренко++ 20250130
		//ДоговорВзаиморасчетов = СМ_ФормированиеНовыхОбъектов.НайтиСоздатьДоговор(Контрагент,Организация,ПодразделениеКомпании,Перечисления.ВидыДоговоров.Продажа);        
 		ДоговорВзаиморасчетов = СМ_ФормированиеНовыхОбъектов.НайтиСоздатьДоговорНеИстекший(Контрагент,Организация,ПодразделениеКомпании,Перечисления.ВидыДоговоров.Продажа,ТекущаяДата());
		//Бондаренко-- 20250130
 		ЦенаАвтомобиля = Основание.ЦенаДКПТрейдИн;
		СуммаДокумента = Основание.ЦенаДКПТрейдИн;
 		ТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенЗакупки;
		ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		КурсДокумента = 1;
		СтоимостьВР = 0;                         
		РабочийЛист = Основание.Ссылка;
		ДокументОснование = Основание.Ссылка;
		Автомобиль = Основание.АвтомобильТрейдИн;
		ОбработкаРеквизита("Автомобиль");
 	КонецЕсли; 
	
	Если обЗначениеНеЗаполнено(Основание) Тогда
		НоваяСуммаДокумента = РассчитатьСуммуВсего();
		Если СуммаДокумента<>НоваяСуммаДокумента Тогда
			СуммаДокумента = НоваяСуммаДокумента;
		КонецЕсли; 
		//Заполнение предоплаты
		Если ДоговорВзаиморасчетов.ПроцентПредоплаты = 0 Тогда
			ПроцентПредоплаты = обПраво("МинимальныйПроцентПредоплаты", Права,,ЭтотОбъект);
		Иначе
			ПроцентПредоплаты = ДоговорВзаиморасчетов.ПроцентПредоплаты;
		КонецЕсли;
		//ОбработкаРеквизита("ПроцентПредоплаты");
	КонецЕсли;
	
	ТекущаяВалютаДокумента = ВалютаДокумента;
	ТекущийКурсДокумента   = КурсДокумента;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаказНарядВР = Документы.ЗаказНаряд.ПустаяСсылка();
	Автомобиль = Справочники.Автомобили.ПустаяСсылка();
	ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	ОбработкаРеквизита("Автомобиль");
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	//Бондаренко++ 20180426
	Если РольДоступна("СМ_Разработчик1С") ИЛИ РольДоступна("ПолныеПрава") ИЛИ РольДоступна("СМ_Бухгалтер") Тогда
		//Этим можно
	Иначе	
		Попытка
			Сообщить("ОШИБКА! Вместо отмены проведения текущего документа 'Заказ клиента на автомобиль' введите на его основании новый документ 'Снятие резервов автомобилей', перенесите этот новый документ в начало дня и проведите его.",СтатусСообщения.Важное); 
		Исключение
			//			
		КонецПопытки;
		//Отказ=Истина;
		//Возврат;
	КонецЕсли; 
	//Бондаренко-- 20180426
	
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	//Если НЕ Отказ Тогда
	//	//Выведем сообщения о необходимости перепроведения будущих документов
	//	СообщитьОПерепроведении();
	//КонецЕсли;
	
КонецПроцедуры

// Проверка наличия других заказов на автомобиль
//
// Параметры
//  VINАвтомобиля  – <Строка> – VIN автомобиля, заказы на который проверяются
//  ОбъектПроверки  – <ДокументОбъект> – Документ, который проверяет наличие заказов
//
// Возвращаемое значение:
//   <Булево>   – Заказов на данный автомобиль нет
//
Функция ПроверитьЗаказыНаАвтомобиль(АвтомобильПроверки,ОбъектПроверки)
	ДокументОбъектСтруктура=Новый Структура();
	ДокументОбъектСтруктура.Вставить("Ссылка",Ссылка);
	ДокументОбъектСтруктура.Вставить("МоментВремени",МоментВремени());
	Если ТипЗнч(РезультатОбработки) = Тип("ОбработкаОбъект.ИнформационноеПоле") Тогда
		СтрокаСообщений="";
		Рез=зфЗащищенныеФункцииСервер.ЗаказНаАвтомобильПроверитьЗаказыНаАвтомобиль(ДокументОбъектСтруктура,АвтомобильПроверки,СтрокаСообщений);
		Если НЕ ПустаяСтрока(СтрокаСообщений) Тогда
			Для НомерСтроки=1 По СтрЧислоСтрок(СтрокаСообщений) Цикл
				СообщениеПользователю=СтрПолучитьСтроку(СтрокаСообщений,НомерСтроки);
				РезультатОбработки.ДобавитьСтрокуСообщения(СообщениеПользователю,"Важное",Неопределено,Неопределено);
			КонецЦикла; 
		КонецЕсли; 
	Иначе
		Рез=зфЗащищенныеФункцииСервер.ЗаказНаАвтомобильПроверитьЗаказыНаАвтомобиль(ДокументОбъектСтруктура,АвтомобильПроверки,РезультатОбработки);
	КонецЕсли;
	Возврат Рез;
КонецФункции // ПроверитьЗаказыНаАвтомобиль()

// Проверка наличия автомобиля на складах
//
// Параметры
//
// Возвращаемое значение:
//   <Булево>   – Заказов на данный автомобиль нет
//
Функция ПроверитьОстаткиАвтомобилей() Экспорт
	ДокументОбъектСтруктура=Новый Структура();
	ДокументОбъектСтруктура.Вставить("Ссылка",Ссылка);
	ДокументОбъектСтруктура.Вставить("Дата",Дата);
	ДокументОбъектСтруктура.Вставить("МоментВремени",МоментВремени());
	ДокументОбъектСтруктура.Вставить("Автомобиль",Автомобиль);
	Возврат зфЗащищенныеФункцииСервер.ЗаказНаАвтомобильПроверитьОстаткиАвтомобилей(ДокументОбъектСтруктура);
КонецФункции // ПроверитьОстаткиАвтомобилей()

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда
		Возврат;
	КонецЕсли;
			
	//// двигаем границу последовательности автомобилей
	//ДвигаемГраницу = (Режим<>РежимПроведенияДокумента.Оперативный И Движения.ОстаткиАвтомобилей.Количество()>0);
	//Если ДвигаемГраницу ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.АвтомобильСкладКомпанииБыл) Тогда
	//	// двигаем границу последовательности автомобилей
	//	НаборЗаписейГраницыАвтомобили = РегистрыСведений.ГраницыАвтомобили.СоздатьНаборЗаписей();
	//	Если ДвигаемГраницу Тогда
	//		ТаблицаСкладов = Движения.ОстаткиАвтомобилей.Выгрузить();
	//		ТаблицаСкладов.Свернуть("СкладКомпании","");
	//		НаборЗаписейГраницыАвтомобили.СкладКомпании		= ТаблицаСкладов.ВыгрузитьКолонку("СкладКомпании");
	//		НаборЗаписейГраницыАвтомобили.МоментВремени		= Дата;
	//		НаборЗаписейГраницыАвтомобили.СкладКомпанииБыл	= ДополнительныеСвойства.АвтомобильСкладКомпанииБыл;
	//		НаборЗаписейГраницыАвтомобили.МоментВремениБыл	= ДополнительныеСвойства.МоментВремениБыл;
	//	Иначе
	//		НаборЗаписейГраницыАвтомобили.СкладКомпании		= ДополнительныеСвойства.АвтомобильСкладКомпанииБыл;
	//		НаборЗаписейГраницыАвтомобили.МоментВремени		= ДополнительныеСвойства.МоментВремениБыл;
	//		НаборЗаписейГраницыАвтомобили.СкладКомпанииБыл	= Неопределено;
	//		НаборЗаписейГраницыАвтомобили.МоментВремениБыл	= Неопределено;
	//	КонецЕсли;
	//	НаборЗаписейГраницыАвтомобили.ДокументСсылка = Ссылка;
	//	НаборЗаписейГраницыАвтомобили.ИзменитьГраницу();
	//КонецЕсли;
	
	// выведем сообщения об ошибках и предупреждениях
	дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
	
	//Если НЕ Отказ Тогда
	//	//Выведем сообщения о необходимости перепроведения будущих документов
	//	СообщитьОПерепроведении();
	//КонецЕсли;
	
		
КонецПроцедуры // ОбработкаПроведения

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли

ОбработкаРасчетСкидок=Обработки.РасчетСкидок.Создать();
//ОбработкаРасчетСкидок.НеРассчитыватьАвтоматическиеСкидки=Истина;

ОбработкаРасчетСкидокНаАвтомобиль=Обработки.РасчетСкидок.Создать();
ОбработкаРасчетСкидокНаАвтомобиль.ИмяРеквизитаСкидкаНаценка="СкидкаНаценкаНаАвтомобиль";
ОбработкаРасчетСкидокНаАвтомобиль.ИмяРеквизитаЗначениеСкидкиНаценки="ЗначениеСкидкиНаценкиНаАвтомобиль";
ОбработкаРасчетСкидокНаАвтомобиль.ИмяРеквизитаСуммаСкидкиНаценки="СуммаСкидкиНаценкиНаАвтомобиль";
ОбработкаРасчетСкидокНаАвтомобиль.НеРассчитыватьСтрочныеСкидки=Истина;
ОбработкаРасчетСкидокНаАвтомобиль.ИмяТабличнойЧасти="Опции";
ОбработкаРасчетСкидокНаАвтомобиль.НеРассчитыватьАвтоматическиеСкидки=Истина;

НеЗаполнятьКонтрагента	= Ложь;
