
Процедура УстановитьЦены() Экспорт

    Если УстанавливатьPCL Тогда
        Док = Документы.ИзменениеЦен.СоздатьДокумент();
        Док.ТипЦен = PCLЛокальная;
		// Трояновский К.Е. 14.02.2019 15:27:47 {
		//Закомментировано по DMSCOR-1087
		//Если PCLЛокальная.ЦенаВключаетНДС Тогда
		//	Множитель = 1.18;
		//Иначе
		//    Множитель = 1;
		//КонецЕсли;		
		// Трояновский К.Е. 14.02.2019 15:27:47 }
		
        Док.ОбработкаРеквизита("ТипЦен");
        Для Каждого Стр Из Цены Цикл
            Если Стр.Устанавливать И Стр.PCL > 0 И Стр.PCL <> Стр.PCLЛокальная Тогда
                ДокСтр = Док.Товары.Добавить();
                ДокСтр.Номенклатура = Стр.Номенклатура;
                Док.ОбработкаРеквизита("Товары.Номенклатура", ДокСтр);
				// Трояновский К.Е. 14.02.2019 15:36:04 {
				//Закомментировано по DMSCOR-1087
				//ДокСтр.Цена = Стр.PCL * Множитель;
				Если PCLЛокальная.ЦенаВключаетНДС Тогда
					ДокСтр.Цена = Стр.PCL * (1 + Стр.Номенклатура.СтавкаНДС.Ставка / 100);
				Иначе
					ДокСтр.Цена = Стр.PCL;
				КонецЕсли;
				// Трояновский К.Е. 14.02.2019 15:36:04 }
				
                Док.ОбработкаРеквизита("Товары.Цена", ДокСтр);
            КонецЕсли;
        КонецЦикла;
        Док.ПолучитьФорму("ФормаДокумента").Открыть();
    КонецЕсли;

    Если УстанавливатьPNC Тогда
        Док = Документы.ИзменениеЦен.СоздатьДокумент();
        Док.ТипЦен = PNCЛокальная;
 		// Трояновский К.Е. 14.02.2019 15:28:39 {
		//Закомментировано по DMSCOR-1087
		//Если PNCЛокальная.ЦенаВключаетНДС Тогда
		//	Множитель = 1.18;
		//Иначе
		//	Множитель = 1;
		//КонецЕсли;
		// Трояновский К.Е. 14.02.2019 15:28:39 }
        Док.ОбработкаРеквизита("ТипЦен");
        Для Каждого Стр Из Цены Цикл
            Если Стр.Устанавливать И Стр.PNC > 0 И Стр.PNC <> Стр.PNCЛокальная Тогда
                ДокСтр = Док.Товары.Добавить();
                ДокСтр.Номенклатура = Стр.Номенклатура;
                Док.ОбработкаРеквизита("Товары.Номенклатура", ДокСтр);
				// Трояновский К.Е. 14.02.2019 15:40:26 {
				//Закомментировано по DMSCOR-1087
				//ДокСтр.Цена = Стр.PNC * Множитель;
				Если PNCЛокальная.ЦенаВключаетНДС Тогда
					ДокСтр.Цена = Стр.PNC * (1 + Стр.Номенклатура.СтавкаНДС.Ставка / 100);
				Иначе
					ДокСтр.Цена = Стр.PNC;
				КонецЕсли;
				// Трояновский К.Е. 14.02.2019 15:40:26 }
                Док.ОбработкаРеквизита("Товары.Цена", ДокСтр);
            КонецЕсли;
        КонецЦикла;
        Док.ПолучитьФорму("ФормаДокумента").Открыть();
    КонецЕсли;

    Если УстанавливатьPNCU Тогда
        Док = Документы.ИзменениеЦен.СоздатьДокумент();
        Док.ТипЦен = PNCUЛокальная;
		// Трояновский К.Е. 14.02.2019 15:31:49 {
		//Закомментировано по DMSCOR-1087
		//Если PNCUЛокальная.ЦенаВключаетНДС Тогда
		//    Множитель = 1.18;
		//Иначе
		//    Множитель = 1;
		//КонецЕсли;		
		// Трояновский К.Е. 14.02.2019 15:31:49 }		
        Док.ОбработкаРеквизита("ТипЦен");
        Для Каждого Стр Из Цены Цикл
            Если Стр.Устанавливать И Стр.PNCU > 0 И Стр.PNCU <> Стр.PNCUЛокальная Тогда
                ДокСтр = Док.Товары.Добавить();
                ДокСтр.Номенклатура = Стр.Номенклатура;
                Док.ОбработкаРеквизита("Товары.Номенклатура", ДокСтр);
                // Трояновский К.Е. 14.02.2019 15:44:21 {
				//Закомментировано по DMSCOR-1087
				//ДокСтр.Цена = Стр.PNCU * Множитель;
				Если PNCUЛокальная.ЦенаВключаетНДС Тогда
					ДокСтр.Цена = Стр.PNCU * (1 + Стр.Номенклатура.СтавкаНДС.Ставка / 100);
				Иначе
					ДокСтр.Цена = Стр.PNCU;
				КонецЕсли;
				// Трояновский К.Е. 14.02.2019 15:44:21 }
                Док.ОбработкаРеквизита("Товары.Цена", ДокСтр);
            КонецЕсли;
        КонецЦикла;
        Док.ПолучитьФорму("ФормаДокумента").Открыть();
    КонецЕсли;

КонецПроцедуры

// +++ Кудинов И.  30.08.2016
Процедура ЗаполнитьЦены(Настройки) Экспорт

	СхемаКомпоновкиДанных = ПолучитьМакет("СКД");

    ПараметрыДанных = Настройки.Настройки.ПараметрыДанных;

    ПараметрыДанных.УстановитьЗначениеПараметра("УстанавливатьPCL",  УстанавливатьPCL);
    ПараметрыДанных.УстановитьЗначениеПараметра("PCL",               PCL);
    ПараметрыДанных.УстановитьЗначениеПараметра("PCLЛокальная",      PCLЛокальная);

    ПараметрыДанных.УстановитьЗначениеПараметра("УстанавливатьPNC",  УстанавливатьPNC);
    ПараметрыДанных.УстановитьЗначениеПараметра("PNC",               PNC);
    ПараметрыДанных.УстановитьЗначениеПараметра("PNCЛокальная",      PNCЛокальная);

    ПараметрыДанных.УстановитьЗначениеПараметра("УстанавливатьPNCU", УстанавливатьPNCU);
    ПараметрыДанных.УстановитьЗначениеПараметра("PNCU",              PNCU);
    ПараметрыДанных.УстановитьЗначениеПараметра("PNCUЛокальная",     PNCUЛокальная);

    ПараметрыДанных.УстановитьЗначениеПараметра("Порог",             Порог);

    ДанныеРасшифровки         = Новый ДанныеРасшифровкиКомпоновкиДанных;
    КомпоновщикМакета         = Новый КомпоновщикМакетаКомпоновкиДанных;
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;

    МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки.Настройки, ДанныеРасшифровки,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,,ДанныеРасшифровки);

    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;

    ТаблицаДанных = ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

    Цены.Загрузить(ТаблицаДанных);

КонецПроцедуры
// --- Кудинов И.  30.08.2016



Процедура ЗаполнитьЦены_() Экспорт //Кудинов не используется

    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("PCL",               PCL);
    Запрос.УстановитьПараметр("PNC",               PNC);
    Запрос.УстановитьПараметр("PNCU",              PNCU);
    Запрос.УстановитьПараметр("PCLЛокальная",      PCLЛокальная);
    Запрос.УстановитьПараметр("PNCЛокальная",      PNCЛокальная);
    Запрос.УстановитьПараметр("PNCUЛокальная",     PNCUЛокальная);
    Запрос.УстановитьПараметр("УстанавливатьPCL",  УстанавливатьPCL);
    Запрос.УстановитьПараметр("УстанавливатьPNC",  УстанавливатьPNC);
    Запрос.УстановитьПараметр("УстанавливатьPNCU", УстанавливатьPNCU);

    Запрос.Текст = "ВЫБРАТЬ
                   |    Ном.Ссылка КАК Номенклатура
                   |ПОМЕСТИТЬ ВТ_НоменклатураРено
                   |ИЗ
                   |    Справочник.Номенклатура КАК Ном
                   |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КаталогРеферансов КАК Renault_КаталогРеферансов
                   |        ПО Ном.Артикул = Renault_КаталогРеферансов.Артикул
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |    ВТ_НоменклатураРено.Номенклатура,
                   |    ВЫБОР
                   |        КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС
                   |            ТОГДА ЦеныСрезПоследних.Цена / 1.18
                   |        ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0)
                   |    КОНЕЦ КАК PCLЛокальная,
                   |    ВЫБОР
                   |        КОГДА ЦеныСрезПоследних1.ТипЦен.ЦенаВключаетНДС
                   |            ТОГДА ЦеныСрезПоследних1.Цена / 1.18
                   |        ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних1.Цена, 0)
                   |    КОНЕЦ КАК PNCЛокальная,
                   |    ВЫБОР
                   |        КОГДА ЦеныСрезПоследних2.ТипЦен.ЦенаВключаетНДС
                   |            ТОГДА ЦеныСрезПоследних2.Цена / 1.18
                   |        ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних2.Цена, 0)
                   |    КОНЕЦ КАК PNCUЛокальная,
                   |    ВЫБОР
                   |        КОГДА Renault_ТарифЦен.ТипЦены.ЦенаВключаетНДС
                   |            ТОГДА Renault_ТарифЦен.Цена / 1.18
                   |        ИНАЧЕ ЕСТЬNULL(Renault_ТарифЦен.Цена, 0)
                   |    КОНЕЦ КАК PCL,
                   |    ВЫБОР
                   |        КОГДА Renault_ТарифЦен1.ТипЦены.ЦенаВключаетНДС
                   |            ТОГДА Renault_ТарифЦен1.Цена / 1.18
                   |        ИНАЧЕ ЕСТЬNULL(Renault_ТарифЦен1.Цена, 0)
                   |    КОНЕЦ КАК PNC,
                   |    ВЫБОР
                   |        КОГДА Renault_ТарифЦен2.ТипЦены.ЦенаВключаетНДС
                   |            ТОГДА Renault_ТарифЦен2.Цена / 1.18
                   |        ИНАЧЕ ЕСТЬNULL(Renault_ТарифЦен2.Цена, 0)
                   |    КОНЕЦ КАК PNCU
                   |ПОМЕСТИТЬ ВТ_ЦеныСгруппированные
                   |ИЗ
                   |    ВТ_НоменклатураРено КАК ВТ_НоменклатураРено
                   |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(, ТипЦен = &PCLЛокальная) КАК ЦеныСрезПоследних
                   |        ПО ВТ_НоменклатураРено.Номенклатура = ЦеныСрезПоследних.Номенклатура
                   |            И (&УстанавливатьPCL)
                   |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(, ТипЦен = &PNCЛокальная) КАК ЦеныСрезПоследних1
                   |        ПО ВТ_НоменклатураРено.Номенклатура = ЦеныСрезПоследних1.Номенклатура
                   |            И (&УстанавливатьPNC)
                   |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(, ТипЦен = &PNCUЛокальная) КАК ЦеныСрезПоследних2
                   |        ПО ВТ_НоменклатураРено.Номенклатура = ЦеныСрезПоследних2.Номенклатура
                   |            И (&УстанавливатьPNCU)
                   |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ТарифЦен КАК Renault_ТарифЦен
                   |        ПО ВТ_НоменклатураРено.Номенклатура.Артикул = Renault_ТарифЦен.Артикул
                   |            И (Renault_ТарифЦен.ТипЦены = &PCL)
                   |            И (&УстанавливатьPCL)
                   |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ТарифЦен КАК Renault_ТарифЦен1
                   |        ПО ВТ_НоменклатураРено.Номенклатура.Артикул = Renault_ТарифЦен1.Артикул
                   |            И (Renault_ТарифЦен1.ТипЦены = &PNC)
                   |            И (&УстанавливатьPNC)
                   |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ТарифЦен КАК Renault_ТарифЦен2
                   |        ПО ВТ_НоменклатураРено.Номенклатура.Артикул = Renault_ТарифЦен2.Артикул
                   |            И (Renault_ТарифЦен2.ТипЦены = &PNCU)
                   |            И (&УстанавливатьPNCU)
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |    ВТ_ЦеныСгруппированные.Номенклатура КАК Номенклатура,
                   |    ВЫРАЗИТЬ(ВТ_ЦеныСгруппированные.PCLЛокальная КАК ЧИСЛО(14, 2)) КАК PCLЛокальная,
                   |    ВЫРАЗИТЬ(ВТ_ЦеныСгруппированные.PNCЛокальная КАК ЧИСЛО(14, 2)) КАК PNCЛокальная,
                   |    ВЫРАЗИТЬ(ВТ_ЦеныСгруппированные.PNCUЛокальная КАК ЧИСЛО(14, 2)) КАК PNCUЛокальная,
                   |    ВЫРАЗИТЬ(ВТ_ЦеныСгруппированные.PCL КАК ЧИСЛО(14, 2)) КАК PCL,
                   |    ВЫРАЗИТЬ(ВТ_ЦеныСгруппированные.PNC КАК ЧИСЛО(14, 2)) КАК PNC,
                   |    ВЫРАЗИТЬ(ВТ_ЦеныСгруппированные.PNCU КАК ЧИСЛО(14, 2)) КАК PNCU
                   |ПОМЕСТИТЬ ВТ_ЦеныОкругленные
                   |ИЗ
                   |    ВТ_ЦеныСгруппированные КАК ВТ_ЦеныСгруппированные
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |    ВТ_ЦеныОкругленные.Номенклатура,
                   |    ВТ_ЦеныОкругленные.PCLЛокальная,
                   |    ВТ_ЦеныОкругленные.PNCЛокальная,
                   |    ВТ_ЦеныОкругленные.PNCUЛокальная,
                   |    ВТ_ЦеныОкругленные.PCL,
                   |    ВТ_ЦеныОкругленные.PNC,
                   |    ВТ_ЦеныОкругленные.PNCU
                   |ИЗ
                   |    ВТ_ЦеныОкругленные КАК ВТ_ЦеныОкругленные
                   |ГДЕ
                   |    (ВТ_ЦеныОкругленные.PCL <> ВТ_ЦеныОкругленные.PCLЛокальная
                   |            ИЛИ ВТ_ЦеныОкругленные.PNCЛокальная <> ВТ_ЦеныОкругленные.PNC
                   |            ИЛИ ВТ_ЦеныОкругленные.PNCUЛокальная <> ВТ_ЦеныОкругленные.PNCU)";

    Цены.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры


Настройки = Справочники.Renault_НастройкиПодсистемыЗапчасти.ЭтаБаза;

PCL           = Настройки.ТипЦенPCL;
PCLЛокальная  = Настройки.ТипЦенPCL;
PNC           = Настройки.ТипЦенPNC;
PNCЛокальная  = Настройки.ТипЦенPNC;
PNCU          = Настройки.ТипЦенPNCU;
PNCUЛокальная = Настройки.ТипЦенPNCU;


