


//Регламентное задание "Рассылка оповещений" 
// выполняет отправку  различных оповещений по работе с обращениями клиентов
Процедура РассылкаОповещений(Параметр1 = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	dms_ЖурналСобытий.Подсистема,
	|	dms_ЖурналСобытий.Событие,
	|	dms_ЖурналСобытий.СпособОповещения,
	|	dms_ЖурналСобытий.РегистраторСобытия,
	|	dms_ЖурналСобытий.НомерСобытия,
	|	dms_ЖурналСобытий.ДатаОповещения КАК ДатаОповещения,
	|	dms_ЖурналСобытий.ДатаИсполнения,
	|	dms_ЖурналСобытий.ОбъектОповещения,
	|	dms_ЖурналСобытий.ТекстОповещения,
	|	dms_ЖурналСобытий.Приоритет
	|ИЗ
	|	РегистрСведений.dms_ЖурналСобытий КАК dms_ЖурналСобытий
	|ГДЕ
	|	dms_ЖурналСобытий.Подсистема = ЗНАЧЕНИЕ(Справочник.DMS_Подсистемы.ОбращенияКлиентов)
	|	И dms_ЖурналСобытий.ДатаИсполнения = ДАТАВРЕМЯ(1, 1, 1)
	|	И dms_ЖурналСобытий.ДатаОповещения <= &ТекущаяДата";
	
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		УспешноОбработано = Ложь;
		
		Если ТипЗнч(Выборка.ОбъектОповещения) <> Тип("СправочникСсылка.Сотрудники")
			и ТипЗнч(Выборка.ОбъектОповещения) <> Тип("СправочникСсылка.Контрагенты") 
			и ТипЗнч(Выборка.ОбъектОповещения) <> Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты")
			и ТипЗнч(Выборка.ОбъектОповещения) <> Тип("СправочникСсылка.CRM_Отделы") тогда
			// пропускаем оповещения с некорректным типом объекта оповещения.
			Продолжить;
		КонецЕсли;
		
		Если Выборка.СпособОповещения = Справочники.DMS_СпособыОповещения.Напоминание Тогда
			// формируем напоминание, только для сотрудников
			Если ТипЗнч(Выборка.ОбъектОповещения) = Тип("СправочникСсылка.Сотрудники")
				или ТипЗнч(Выборка.ОбъектОповещения) = Тип("СправочникСсылка.CRM_Отделы") тогда 	
				Напоминание = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
				Напоминание.Отправитель = "Система";
				Если ТипЗнч(Выборка.ОбъектОповещения) = Тип("СправочникСсылка.CRM_Отделы") тогда 	
					СписокСотрудниковОтдела = ПолучитьСписокСотрудниковОтдела(Выборка.ОбъектОповещения);
					Для каждого Стр из СписокСотрудниковОтдела цикл
						Напоминание.Адресаты.Добавить().Сотрудник = Стр.Сотрудник;
					КонецЦикла;
				Иначе
					Напоминание.Адресаты.Добавить().Сотрудник = Выборка.ОбъектОповещения;
				КонецЕсли;

				Напоминание.ДатаОтправки = ТекущаяДата();
				Напоминание.Комментарий = "";
				Напоминание.ВидСообщения = Справочники.Renault_ВидСообщения.ДействиеПоОбращению;
				Напоминание.ПоказыватьС = Выборка.ДатаОповещения;
				Напоминание.ПоказыватьПо = Выборка.ДатаОповещения+900;
				Напоминание.Наименование = "Действия по обращениям";
				Напоминание.Сообщение = Выборка.ТекстОповещения;
				Напоминание.ИдентификаторОбъекта = Строка(Выборка.РегистраторСобытия.УникальныйИдентификатор());
				Напоминание.Записать();
				УспешноОбработано = Истина;
			КонецЕсли;
			
		ИначеЕсли Выборка.СпособОповещения = Справочники.DMS_СпособыОповещения.ПоСМС 
			или Выборка.СпособОповещения = Справочники.DMS_СпособыОповещения.ПоПочте Тогда
			// формируем отправку письма или СМС
			
			ТаблицаСообщений = Новый ТаблицаЗначений;
			ТаблицаСообщений.Колонки.Добавить("Получатели");
			ТаблицаСообщений.Колонки.Добавить("ТекстСообщения");
			ТаблицаСообщений.Колонки.Добавить("BIR");
			
			
			НоваяСтрока = ТаблицаСообщений.Добавить();
			НоваяСтрока.BIR = "99999999";//"64306105";
			НоваяСтрока.ТекстСообщения = Выборка.ТекстОповещения;
			
			Получатели = Новый ТаблицаЗначений;
			Если Выборка.СпособОповещения = Справочники.DMS_СпособыОповещения.ПоСМС тогда
				Получатели.Колонки.Добавить("Телефон");
				СтрокаПолучатель = Получатели.Добавить();
				СтрокаПолучатель.Телефон =  ПолучитьТелефонОбъекта(Выборка.ОбъектОповещения);
				НоваяСтрока.Получатели = Получатели;
				DMS_ВзаимодействияСКлиентом.ВыполнитьРассылкуСМС(ТаблицаСообщений);
			иначе
				Получатели.Колонки.Добавить("Адрес");
				
				Если ТипЗнч(Выборка.ОбъектОповещения) = Тип("СправочникСсылка.CRM_Отделы") тогда
					СписокСотрудниковОтдела = ПолучитьСписокСотрудниковОтдела(Выборка.ОбъектОповещения);
					Для каждого Стр из СписокСотрудниковОтдела цикл
						СтрокаПолучатели = Получатели.Добавить();
						СтрокаПолучатели.Адрес = ПолучитьПочтуОбъекта(Стр.Сотрудник);
					КонецЦикла;
				Иначе
					СтрокаПолучатели = Получатели.Добавить();
					СтрокаПолучатели.Адрес = ПолучитьПочтуОбъекта(Выборка.ОбъектОповещения);
				КонецЕсли;
				
				НоваяСтрока.Получатели = Получатели;
				DMS_ВзаимодействияСКлиентом.ВыполнитьРассылкуПисем(ТаблицаСообщений);
				
			КонецЕсли;
			
			УспешноОбработано = Истина;
		Иначе
			// прочие виды оповещений пока не обрабатываем.
		КонецЕсли;
		
		
		Если УспешноОбработано тогда
			
			Подсистема_ОбащенияКлиентов = Справочники.DMS_Подсистемы.ОбращенияКлиентов;
			Набор = РегистрыСведений.dms_ЖурналСобытий.СоздатьНаборЗаписей();
			Набор.Отбор.Подсистема.Установить(Подсистема_ОбащенияКлиентов);
			Набор.Отбор.Событие.Установить(Выборка.Событие);
			Набор.Отбор.СпособОповещения.Установить(Выборка.СпособОповещения);
			Набор.Отбор.РегистраторСобытия.Установить(Выборка.РегистраторСобытия);
			Набор.Отбор.НомерСобытия.Установить(Выборка.НомерСобытия);
			
			Запись = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(Запись,Выборка);
			Запись.ДатаИсполнения = ТекущаяДата();
			Набор.Записать(Истина);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСписокСотрудниковОтдела(Отдел)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь.Сотрудник КАК Сотрудник
		|ИЗ
		|	Справочник.Renault_ПраваИНастройкиПользователей КАК Renault_ПраваИНастройкиПользователей
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
		|		ПО Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки = Renault_ПраваИНастройкиПользователей.Ссылка
		|ГДЕ
		|	Renault_ПраваИНастройкиПользователей.Отдел = &Отдел
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник";
	
	Запрос.УстановитьПараметр("Отдел", Отдел);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьНомерСобытия() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ЕСТЬNULL(dms_ЖурналСобытий.НомерСобытия, 1)) КАК НомерСобытия
	|ИЗ
	|	РегистрСведений.dms_ЖурналСобытий КАК dms_ЖурналСобытий
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСобытия УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() тогда
		
		Если Выборка.НомерСобытия = Null тогда
			Возврат 1;
		Иначе
			Возврат Выборка.НомерСобытия+1;	
		КонецЕсли;
	иначе
		Возврат 1;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТелефонОбъекта(Объект) Экспорт 
	
	Телефон = Renault_CRM.ПолучитьТелефонКлиент(Объект);
	Телефон = Стрзаменить(Телефон,"(","");
	Телефон = Стрзаменить(Телефон,")","");
	Телефон = Стрзаменить(Телефон," ","");
	Телефон = Стрзаменить(Телефон,".","");
	Телефон = Стрзаменить(Телефон,",","");
	Возврат Телефон;
	
КонецФункции

Функция ВернутьТекущегоСотрудника() экспорт
	
	Возврат Справочники.Пользователи.НайтиПоКоду(ПользователиИнформационнойБазы.ТекущийПользователь().Имя).Сотрудник;
	
КонецФункции


Функция ПолучитьПочтуОбъекта(Объект) Экспорт 
	
	Возврат Renault_CRM.ПолучитьЕмаилКлиент(Объект);
	
КонецФункции

//&НаСервереБезКонтекста
Функция ПолучитьДанныеКонтрагентаНаСервере(Контрагент) Экспорт
	
	СтруктураДанных = Новый Структура();
	СтруктураДанных.Вставить("EMail",Renault_CRM.ПолучитьЕмаилКлиент(Контрагент));
	СтруктураДанных.Вставить("Телефон",Renault_CRM.ПолучитьТелефонКлиент(Контрагент));
	СтруктураДанных.Вставить("Адрес",Renault_CRM.ПолучитьАдресКлиент(Контрагент));
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция Renault_ОформитьЖалобу(Клиент, Автомобиль, СуществующаяЖалоба = Неопределено, ПоказыватьДокумент = Истина, Дата = Неопределено) Экспорт

	
		Жалоба = Документы.DMS_ОбращениеКлиента.СоздатьДокумент();
		Жалоба.Контрагент = Клиент; 
		Жалоба.ТипКлиента = Перечисления.Renault_ТипыКлиентов.РозничныйКлиент; 
		Жалоба.Автомобиль = Автомобиль;
		Жалоба.КомплектацияАвто = Автомобиль.ВариантКомплектации;
		Жалоба.ПричинаОбращения = "";
		Жалоба.Дата = ТекущаяДата();
		Жалоба.ДатаОбращенияВДЦ = ?(Дата = Неопределено, '00010101', Дата);
		Жалоба.ГосНомер = Renault_АвтосервисОбщий.Renault_ПолучитьГосНомер(Автомобиль);
		Жалоба.Модель = Автомобиль.Модель;
		Жалоба.VIN = Автомобиль.VIN;
		Жалоба.EMail = Renault_CRM.ПолучитьЕмаилКлиент(Клиент);
		Жалоба.Телефон = Renault_CRM.ПолучитьТелефонКлиент(Клиент);
		Жалоба.Пробег = Renault_АвтосервисОбщий.Renault_ПолучитьПробег(Автомобиль);
		
		НоваяСтрока = Жалоба.ДействияПоОбращению.Добавить();
		НоваяСтрока.Действие = Справочники.DMS_ДействияПоОбращениям.НазначитьИсполнителя;
		НоваяСтрока.ДатаПланируемая = ТекущаяДата();
		
		Если ПоказыватьДокумент Тогда
		
		Попытка
			
			Жалоба.Записать(РежимЗаписиДокумента.Запись);
			
			#Если Клиент Тогда
				
				//pu0XXXX+
				ОткрытьЗначение(Жалоба.Ссылка);
				
				//Форма = ПолучитьФорму("Документ.DMS_ОбращениеКлиента.Форма.ФормаДокументаУпр");
				//Докма = ДанныеФормыВЗначение(Форма.Объект,Тип("ДокументОбъект.DMS_ОбращениеКлиента"));
				//ЗаполнитьЗначенияСвойств(Докма,Жалоба);
				//ЗначениеВДанныеФормы (Жалоба,Форма.Объект);
				//Форма.ОткрытьМодально();
				//
				//Жалоба = ДанныеФормыВЗначение(Форма.Объект, Тип("ДокументОбъект.DMS_ОбращениеКлиента"));
					
			
			#КонецЕсли
			
			Возврат Жалоба.Ссылка;
			
		Исключение
			
			#Если Клиент Тогда
						
				//ПараметрыФормы = Новый Структура("Ключ", Жалоба);
				//ПараметрыФормы.Вставить("Контрагент", Клиент);
				//ПараметрыФормы.Вставить("Автомобиль", Автомобиль);
				//		
				//ОткрытьФорму("Документ.DMS_ОбращениеКлиента.Форма.ФормаДокументаУпр", ПараметрыФормы);
				//
				Форма = ПолучитьФорму("Документ.DMS_ОбращениеКлиента.Форма.ФормаДокументаУпр");
				Докма = ДанныеФормыВЗначение(Форма.Объект,Тип("ДокументОбъект.DMS_ОбращениеКлиента"));
				ЗаполнитьЗначенияСвойств(Докма,Жалоба);
				ЗначениеВДанныеФормы (Жалоба,Форма.Объект);
				Форма.ОткрытьМодально();
				
				Жалоба = ДанныеФормыВЗначение(Форма.Объект, Тип("ДокументОбъект.DMS_ОбращениеКлиента"));
								
			#КонецЕсли
			
			Если НЕ Жалоба.ЭтоНовый() тогда
				
				Возврат Жалоба.Ссылка;
				
			Иначе
				
				Возврат Неопределено;
				
			КонецЕсли;
			
		КонецПопытки;
		
	Иначе
		
		Попытка
			
			Жалоба.Записать(РежимЗаписиДокумента.Запись);
			
			Возврат Жалоба.Ссылка;
			
		Исключение
		КонецПопытки;
		
	КонецЕсли;

			
КонецФункции

Функция НайтиКонтрагентаПоТелефону(Телефон) Экспорт
	
	// Текст запроса для построения временной таблицы
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_НормализованныеКонтактыДляПоиска.Объект КАК Контрагент,
	               |	Renault_НормализованныеКонтактыДляПоиска.Данные
	               |ИЗ
	               |	РегистрСведений.Renault_НормализованныеКонтактыДляПоиска КАК Renault_НормализованныеКонтактыДляПоиска
	               |ГДЕ
	               |	Renault_НормализованныеКонтактыДляПоиска.Данные ПОДОБНО &Фрагмент";
	
	Фрагмент = Телефон;
	
	Фрагмент = СтрЗаменить(Фрагмент, "+", "");
	Фрагмент = СтрЗаменить(Фрагмент, "-", "");
	Фрагмент = СтрЗаменить(Фрагмент, ".", "");
	Фрагмент = СтрЗаменить(Фрагмент, "*", "");
	Фрагмент = СтрЗаменить(Фрагмент, " ", "");
	Фрагмент = СтрЗаменить(Фрагмент, "(", "");
	Фрагмент = СтрЗаменить(Фрагмент, ")", "");
	
	Если Найти(Фрагмент, "7") = 1 ИЛИ Найти(Фрагмент, "8") = 1 Тогда
		Фрагмент = Прав(Фрагмент, СтрДлина(Фрагмент) - 1);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Фрагмент", "%" + Фрагмент + "%");
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Контрагент;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
