&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДЦ=Renault_CRM.ПолучитьДилерскийЦентрПользователя();
	Элементы.ГруппаСтраховка.Видимость=ДЦ.ОтображатьСтраховкуКредитВКП;
	Элементы.ГруппаКредитНовая.Видимость=ДЦ.ОтображатьСтраховкуКредитВКП;
	
	Если ДЦ.ЗапретитьРедактированиеКП Тогда
		ТолькоПросмотр=Истина;
		Элементы.ПерезаписатьКонфигурацию.Доступность=Ложь;
	КонецЕсли;
	
	// начало Зеленчук
	Бренд = ПараметрыСеанса.DMS_Бренд;
	Элементы.ТаблицаЦветаДоплатаЗаЦвет.Видимость = Ложь;
	Если Бренд = Справочники.CRM_МаркаАвтомобиля.LADA Тогда
		Элементы.ГруппаПродленнаяГарантия.Видимость = Ложь;
		Элементы.ТаблицаЦветаМеталлик.Видимость = Ложь;
		Элементы.ТаблицаЦветаДоплатаЗаЦвет.Видимость = Истина;
	КонецЕсли;
	ЦенаВыкупа = 0;
	// окончание Зеленчук
	ОбновитьДанныеПрикрепленныхФайлов();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПрикрепленныхФайлов()
	ПрикрепленныеФайлы.Параметры.УстановитьЗначениеПараметра("Объект", ТекущееКП);
КонецПроцедуры	

&НаСервере
Функция ПолучитьСрокДействия(ДилЦентр)
	
	ЭтоКорпКлиент = Ложь;
	РабочийЛист = ПолучитьРабочийЛист(ТекущийРабочийЛист);
	Если РабочийЛист <> Неопределено 
		И РабочийЛист.ТипКлиента = Перечисления.Renault_ТипыКлиентов.КорпоративныйКлиент Тогда
		
		ЭтоКорпКлиент = Истина;
		
	КонецЕсли;
	
	Если ДилЦентр <> неопределено И ЗначениеЗаполнено(ДилЦентр.СрокДействияКпПоУмолчанию) Тогда
		
		Если Не ЭтоКорпКлиент И ЗначениеЗаполнено(ДилЦентр.СрокДействияКпПоУмолчанию) Тогда
			Ответ = КонецДня(ТекущаяДата()) + ДилЦентр.СрокДействияКпПоУмолчанию*60*60*24;
		ИначеЕсли ЭтоКорпКлиент И ЗначениеЗаполнено(ДилЦентр.СрокДействияКпПоУмолчаниюКОРП) Тогда
			Ответ = КонецДня(ТекущаяДата()) + ДилЦентр.СрокДействияКпПоУмолчаниюКОРП*60*60*24;
		ИначеЕсли ЭтоКорпКлиент Тогда
			Ответ = КонецДня(ТекущаяДата() + 30*24*60*60);
		Иначе
			Ответ = КонецДня(ТекущаяДата());
		КонецЕсли;
		
	Иначе
		
		Если ЭтоКорпКлиент Тогда
			Ответ = КонецДня(ТекущаяДата() + 30*24*60*60);
		Иначе
			Ответ = КонецДня(ТекущаяДата());
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

&НаСервере
Функция ПолучитьРабочийЛист(НомерЛиста)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	|ГДЕ
	|	Renault_РабочиеЛисты.IDK = &IDK";
	Запрос.УстановитьПараметр("IDK", НомерЛиста);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции


&НаСервере
Процедура ПриОткрытииСервер()
	
	
	
	ЦветРено = Вычислить(Renault_ОбщиеФункцииСервер.МультибрендПараметрыОформления().ОсновнойЦвет); 
	
	Если ЭтоТрейдИН Тогда
		Элементы.ГруппаБазовыеОпции.Видимость = Ложь;
		Элементы.ГруппаАвтомобиль.Видимость = Ложь;
		Элементы.ОткрытьСклад.Видимость = Ложь;
		Элементы.ГруппаСклад.Видимость = Ложь;
	Иначе
		Элементы.ГруппаТрейдИнАвтомобиль.Видимость = Ложь; 
		Модель = Справочники.Модели.ПустаяСсылка();
		Версия = Справочники.ВариантыКомплектации.ПустаяСсылка();
		Цвет = Справочники.Цвета.ПустаяСсылка();
	КонецЕсли;
	Если ПараметрыСеанса.DMS_Бренд = Справочники.CRM_МаркаАвтомобиля.LADA Тогда
		Элементы.кнЛизинг.Видимость = Ложь;
		Элементы.кнОтказатьсяОтКонсультации.Видимость = Ложь;
		Элементы.кнПередатьВОтдел.Видимость = Ложь;
		Элементы.кнНазначитьИсполнителя.Видимость = Ложь;
	КонецЕсли;
	ТекДилерскийЦентр = Renault_РаботаСПравамиПользователя.ДилерскийЦентрПоУмолчанию(ПараметрыСеанса.Пользователь);
	ТипЦенКП = Renault_РаботаСПравамиПользователя.ПолучитьТипЦенКП(ТекДилерскийЦентр); 
	
	Если Автомобиль.Пустая() Тогда
		ТекущийТариф = Справочники.Renault_ТарифыНаАвтомобили.ПолучитьТарифДляРасчетаЦены();
	Иначе
		ТекущийТариф = Справочники.Renault_ТарифыНаАвтомобили.ПолучитьТарифДляРасчетаЦены(Год(Автомобиль.ГодВыпуска));		
	КонецЕсли;
	
	//РассылкаУчетнаяЗапись = Renault_РаботаСПравамиПользователя.ДилерскийЦентрПоУмолчанию(ПараметрыСеанса.Пользователь).ОсновнаяУчетнаяЗаписьЭлПочты;
	РассылкаТемаСообщения ="Коммерческое предложение";
	СуммаДоставки = ТекДилерскийЦентр.СтоимостьДоставкиПоУмолчанию;
	СрокДействия = ПолучитьСрокДействия(ТекДилерскийЦентр);
	
	ГодВыпуска = Renault_ОбщегоНазначения.ПолучитьГодВыпуска(Автомобиль);	
	Если ГодВыпуска = 0 Тогда
		ГодВыпуска = Год(ТекущаяДата());
	КонецЕсли;
	
	Если ТрейдИнГодВыпуска = 0 Тогда
		ТрейдИнГодВыпуска = Год(ТекущаяДата());
	КонецЕсли;
	
	Менеджер = ПараметрыСеанса.Пользователь.Сотрудник;
	
	ПрочитатьДанныеКлиентаСервер();
	ОбновитьСписокМоделей();
	
	//Если ЗначениеЗаполнено(КлючТаблицыСпискаСкидок) Тогда
	//	ПолучитьСписокСкидок(КлючТаблицыСпискаСкидок);
	//КонецЕсли; 
	
	СоставКП.Параметры.УстановитьЗначениеПараметра("Ссылка", ТекущееКП);
	СписокКП.Параметры.УстановитьЗначениеПараметра("РабочийЛист", ТекущийРабочийЛист);
	
	ЗагрузитьЗаявкуНаТрейдИн();
	//Козлов Е.А. Начало 14.07.2016
	ОбновитьДанныеПоПродуктам();
	//Козлов Е.А. Конец 15.07.2016
	
	Если Renault_РаботаСПравамиПользователя.ЗапрашиватьПодтверждениеИзмененийВКП(ПараметрыСеанса.Пользователь) Тогда	
		
		ДействияЭлементовПриИзменении = Новый Соответствие;	
		ДействияЭлементовНачалоВыбора = Новый Соответствие;
		Для каждого Эл Из Элементы Цикл
			Попытка      
				Если НЕ ПустаяСтрока(Эл.ПолучитьДействие("НачалоВыбора"))
					И ТипЗнч(Эл) = Тип("ПолеФормы") Тогда
					ДействияЭлементовНачалоВыбора.Вставить(Эл.Имя, Эл.ПолучитьДействие("НачалоВыбора"));
					Эл.УстановитьДействие("НачалоВыбора","ОбработкаНачалаВыбораДанных");	        
				КонецЕсли;
				Если НЕ ПустаяСтрока(Эл.ПолучитьДействие("ПриАктивизацииСтроки"))
					И ТипЗнч(Эл) = Тип("ТаблицаФормы") Тогда
					//ДействияЭлементов.Вставить(Эл.Имя, Эл.ПолучитьДействие("ПриАктивизацииСтроки"));
					//Эл.УстановитьДействие("ПриАктивизацииСтроки","ОбработкаИзмененияДанных");				
				Иначе	
					Если НЕ ПустаяСтрока(Эл.ПутьКДанным) 
						И Не ЭлементПринадлежитТаблицеФормы(Эл) 
						И Не ТипЗнч(Эл) = Тип("ГруппаФормы") 
						И Не ТипЗнч(Эл) = Тип("КнопкаФормы") 
						И Не ТипЗнч(Эл) = Тип("ДекорацияФормы") Тогда
						ДействияЭлементовПриИзменении.Вставить(Эл.Имя, Эл.ПолучитьДействие("ПриИзменении"));
						Эл.УстановитьДействие("ПриИзменении","ОбработкаПриИзмененииДанных");
					КонецЕсли;
				КонецЕсли;     
			Исключение
			КонецПопытки;
		КонецЦикла;	   	
		АдресХранилищаПриИзменении = ПоместитьВоВременноеХранилище(ДействияЭлементовПриИзменении, Этаформа.УникальныйИдентификатор);	   	
		АдресХранилищаНачалоВыбора = ПоместитьВоВременноеХранилище(ДействияЭлементовНачалоВыбора, Этаформа.УникальныйИдентификатор);
		
	КонецЕсли;
		
КонецПроцедуры

// ++ Ковалев ЕС от 23.08.2018
&НаСервере
Функция ЗаполнитьДатыПередачиАвтомобиляПоVIN(АвтомобильСсылка);
	
	ДНПередачи = Дата(1,1,1);
	ДКПередачи = Дата(1,1,1);

	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("РасчетнаяДатаПередачи",     ДНПередачи);                  
	СтруктураВозврата.Вставить("ДатаНачалаПередачиАвто",    ДНПередачи);  
	СтруктураВозврата.Вставить("ДатаОкончанияПередачиАвто", ДКПередачи);
									
	Если ЗначениеЗаполнено(АвтомобильСсылка) И ЗначениеЗаполнено(АвтомобильСсылка.VIN) Тогда
		Попытка
			// Данные по датам находятся по пути:
			// https://rdwapp.renault.ru/api/v1/dates2/VF1RZG00261314000
			HTTPЗапрос = Новый HTTPЗапрос();
			HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
			HTTPЗапрос.АдресРесурса = "/dates2/" + СокрЛП(АвтомобильСсылка.VIN);
			Соединение = Новый HTTPСоединение("rdw-app.prod.digital-hub.rnlt.ru/api/v1",,,,,,Новый ЗащищенноеСоединениеOpenSSL);
			ОтветHTTP = Соединение.Получить(HTTPЗапрос);
			
			ТелоЗапроса = ОтветHTTP.ПолучитьТелоКакСтроку();
			Если ОтветHTTP.КодСостояния = 200 Тогда
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(ТелоЗапроса);
				Результат = ПрочитатьJSON(ЧтениеJSON);
				ЧтениеJSON.Закрыть();
				
				Если ТипЗнч(Результат) = Тип("Структура") Тогда
					Если Результат.Свойство("data") Тогда
						Для Каждого СтрокаМ Из Результат.data Цикл
							Если СтрокаМ.Свойство("attributes") Тогда
								//Пример формата даты: 2018-11-28T00:00:00+00:00
								Если СтрокаМ.attributes.Свойство("plandt") Тогда
									ПланДата = ПрочитатьДатуJSON(СтрокаМ.attributes.plandt, ФорматДатыJSON.ISO);
								КонецЕсли;	
								Если СтрокаМ.attributes.Свойство("realdt") Тогда
									РеалДата = ПрочитатьДатуJSON(СтрокаМ.attributes.realdt, ФорматДатыJSON.ISO);
								КонецЕсли;   
								
								//++DMSREN-95
								Если ПланДата <> Дата(1,1,1) И РеалДата <> Дата(1,1,1) Тогда
								//	МаксДата = ?(ПланДата > РеалДата, ПланДата, РеалДата);
								//	МинДата  = ?(ПланДата > РеалДата, РеалДата, ПланДата);
								//	
								//	Если (МаксДата - МинДата) / 86400 > 15 Тогда
								//		ДНПередачи = МаксДата - 15 * 86400;
								//		ДКПередачи = МаксДата;
								//	Иначе
								//		ДНПередачи = МинДата;
								//		ДКПередачи = МаксДата;
								//	КонецЕсли;	
									
									//// КовалевЕС от 04.06.19 { DMSCOR-1319
									//Если ДНПередачи <> Дата(1,1,1) И НачалоДня(ДКПередачи) <= НачалоДня(ТекущаяДата()) Тогда
									//	ДНПередачи = ДНПередачи + 86400 * 3;	
									//	ДКПередачи = ДКПередачи + 86400 * 5;			
									//КонецЕсли;
									//// КовалевЕС от 04.06.19 }
									
									МинДата = Мин(ПланДата, РеалДата);
									МаксДата = Макс(ПланДата,РеалДата);
									
									ПроверяемаяДНПередачи = ТекущаяДата() + 3 * 86400;
									ПроверяемаяДКПередачи = ТекущаяДата() + 5 * 86400;
									
									Если (МаксДата - МинДата) / 86400 > 15 Тогда
										ДНПередачи = МаксДата - 15 * 86400;
										Если ДНПередачи <= ПроверяемаяДНПередачи Тогда
											ДНПередачи = ПроверяемаяДНПередачи;
											ДКПередачи = ?(МаксДата < ПроверяемаяДКПередачи, ПроверяемаяДКПередачи, МаксДата)
										Иначе
											ДНПередачи = ?(МинДата < ТекущаяДата(), ПроверяемаяДНПередачи, ДНПередачи);
											ДКПередачи = МаксДата
										КонецЕсли
									Иначе
										ДНПередачи = МинДата;
										Если ДНПередачи <= КонецДня(ТекущаяДата()) Тогда
											ДНПередачи = ПроверяемаяДНПередачи;
											ДКПередачи = ?(МаксДата < ПроверяемаяДКПередачи, ПроверяемаяДКПередачи, МаксДата)
										Иначе
											ДНПередачи = МинДата;
											ДКПередачи = МаксДата
										КонецЕсли
									КонецЕсли;
									
									СтруктураВозврата.Вставить("РасчетнаяДатаПередачи",     ДНПередачи);                  
									СтруктураВозврата.Вставить("ДатаНачалаПередачиАвто",    ДНПередачи);  
									СтруктураВозврата.Вставить("ДатаОкончанияПередачиАвто", ДКПередачи);
								КонецЕсли;
								//--DMSREN-95
							КонецЕсли;								
						КонецЦикла;
					КонецЕсли;	
				КонецЕсли;				
			КонецЕсли;
		Исключение
			Сообщить("Не удалось получить значения дат передачи автомобиля!" 
			+ Символы.ПС + "По причине: " + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;	
	
	Возврат СтруктураВозврата;
	
КонецФункции 

&НаСервере
Функция ЗаполнитьДатыПередачиАвтомобиляБезVIN(ДилерЦентСсылка, МодельСсылка, IDКРабочийЛист);
	
	РДПередачи = Дата(1,1,1);
	ДНПередачи = Дата(1,1,1);
	ДКПередачи = Дата(1,1,1);
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("РасчетнаяДатаПередачи",     РДПередачи);                  
	СтруктураВозврата.Вставить("ДатаНачалаПередачиАвто",    ДНПередачи);  
	СтруктураВозврата.Вставить("ДатаОкончанияПередачиАвто", ДКПередачи); 
		
	Если ЗначениеЗаполнено(ДилерЦентСсылка) И ЗначениеЗаполнено(МодельСсылка) Тогда
		
		КодМоделиП   = СокрЛП(МодельСсылка.Артикул);
		НеделяМесяца = Цел(День(ТекущаяДата()) / 7) + 1;
		
		// Трояновский К.Е. 12.08.2019 10:21:30 {
		//РабочийЛистЗапись = Renault_CRM.ПолучитьЗаписьРЛПоIDK(IDКРабочийЛист);
		РабочийЛистЗапись = Renault_CRM.докПолучитьЗаписьРЛПоIDK(IDКРабочийЛист);		
		// Трояновский К.Е. 12.08.2019 10:21:30 }
		КорпКлиент   = ?(РабочийЛистЗапись.ТипКлиента = Перечисления.Renault_ТипыКлиентов.КорпоративныйКлиент, Истина, Ложь); 
		
		СрокДоставкиПередачи = ПолучитьСрокДоставки(Лев(ДилерЦентСсылка.BIR, 8), КодМоделиП); 
		
		// Определяем 15 число текущего месяца или следующего
		Если НеделяМесяца = 1 ИЛИ НеделяМесяца = 2 Тогда
			РДПередачи = Дата(Год(ТекущаяДата()), Месяц(ТекущаяДата()), 15);                   
		ИначеЕсли НеделяМесяца = 3 ИЛИ НеделяМесяца = 4 Тогда
			РДПередачи = ДобавитьМесяц(Дата(Год(ТекущаяДата()), Месяц(ТекущаяДата()), 15), 1); 
		КонецЕсли;
		
		// Варианты определения даты начала передачи автомобиля, исходя из кода модели
		Если   (КодМоделиП = "KQ2" ИЛИ КодМоделиП = "MAU" ИЛИ КодМоделиП = "MRO" 
			ИЛИ КодМоделиП = "TWZ" ИЛИ КодМоделиП = "67F" ИЛИ КодМоделиП = "67P") Тогда 
			КолвоДней  =  (62 + 35 + 7 + ?(КорпКлиент, 14, 5) + СрокДоставкиПередачи) * 86400;
			ДНПередачи = РДПередачи + КолвоДней;
			
		ИначеЕсли КодМоделиП = "ZGH" Тогда
			КолвоДней  = (62 + 70 + 7 + ?(КорпКлиент, 14, 5) + СрокДоставкиПередачи) * 86400;
			ДНПередачи = РДПередачи + КолвоДней;
			
		Иначе
			КолвоДней  = (93 + 7  + ?(КорпКлиент, 7 , 5) + СрокДоставкиПередачи) * 86400;
			ДНПередачи = РДПередачи + КолвоДней;
		КонецЕсли;	
		
		ДКПередачи = ДНПередачи + 7 * 86400;
		
		СтруктураВозврата.Вставить("РасчетнаяДатаПередачи",     РДПередачи);                  
		СтруктураВозврата.Вставить("ДатаНачалаПередачиАвто",    ДНПередачи);  
		СтруктураВозврата.Вставить("ДатаОкончанияПередачиАвто", ДКПередачи); 
	КонецЕсли;	
	
	Возврат СтруктураВозврата;
	
КонецФункции 
	
&НаСервере
Функция ПолучитьСрокДоставки(BIR_ID, КодМоделиП)
		
	Если КодМоделиП = "46L" ИЛИ КодМоделиП =  "46B" ТОГДА
		ПараметрПоискаСклад = "TLT";
	ИначеЕсли КодМоделиП = "79H" ИЛИ КодМоделиП = "HAH" ТОГДА
		ПараметрПоискаСклад = "CLE";
	Иначе
		ПараметрПоискаСклад = "PLP";
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	DMS_АдресаРазгрузкиДилеров.СрокДоставки
		|ИЗ
		|	РегистрСведений.DMS_АдресаРазгрузкиДилеров КАК DMS_АдресаРазгрузкиДилеров
		|ГДЕ
		|	DMS_АдресаРазгрузкиДилеров.BIR = &BIR
		|	И DMS_АдресаРазгрузкиДилеров.SKLAD_CODE = &SKLAD_CODE
		|
		|УПОРЯДОЧИТЬ ПО
		|	DMS_АдресаРазгрузкиДилеров.idТочка";
	
	Запрос.УстановитьПараметр("BIR",        BIR_ID);
	Запрос.УстановитьПараметр("SKLAD_CODE", ПараметрПоискаСклад);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.СрокДоставки;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ДатаНачалаПередачиАвтоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ИзменитьДатуНачалаПередачи = Истина;
	
	Если ЗначениеЗаполнено(РасчетнаяДатаПередачи) Тогда
		Если ЗначениеЗаполнено(Автомобиль) И ЗначениеЗаполнено(VIN) Тогда
			Если ВыбранноеЗначение < РасчетнаяДатаПередачи Тогда
				Сообщить("Дата начала передачи автомобиля " + Формат(ДатаНачалаПередачиАвто, "ДЛФ=Д")
				+ ", не может быть меньше расчетной даты " + Формат(РасчетнаяДатаПередачи, "ДЛФ=Д") + "!", СтатусСообщения.Внимание);
				ИзменитьДатуНачалаПередачи = Ложь;
			ИначеЕсли ВыбранноеЗначение = РасчетнаяДатаПередачи	Тогда
				ИзменитьДатуНачалаПередачи = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	Если ИзменитьДатуНачалаПередачи Тогда
		ДатаНачалаПередачиАвто = ВыбранноеЗначение;
		ДатаОкончанияПередачиАвто = ДатаНачалаПередачиАвто + 86400 * 7;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПередачиАвтоОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ИзменитьДатуНачалаПередачи = Истина;
	
	ДатаСтрокой = Текст;
	ГодСтрокой   = Прав(ДатаСтрокой,4);
	МесяцСтрокой = Сред(ДатаСтрокой,4,2);
	ДеньСтрокой  = Лев(ДатаСтрокой,2);
	
	ВведенноеЗначение = Дата(ГодСтрокой, МесяцСтрокой, ДеньСтрокой);

	Если ЗначениеЗаполнено(РасчетнаяДатаПередачи) Тогда
		Если ЗначениеЗаполнено(Автомобиль) И ЗначениеЗаполнено(VIN) Тогда
			Если ВведенноеЗначение < РасчетнаяДатаПередачи Тогда
				Сообщить("Дата начала передачи автомобиля " + Формат(ДатаНачалаПередачиАвто, "ДЛФ=Д")
				+ ", не может быть меньше расчетной даты " + Формат(РасчетнаяДатаПередачи, "ДЛФ=Д") + "!", СтатусСообщения.Внимание);
				ИзменитьДатуНачалаПередачи = Ложь;
			ИначеЕсли ВведенноеЗначение = РасчетнаяДатаПередачи Тогда
				ИзменитьДатуНачалаПередачи = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	Если ИзменитьДатуНачалаПередачи Тогда
		Если Не ЗначениеЗаполнено(ГодСтрокой + МесяцСтрокой + ДеньСтрокой) Тогда
			ДатаНачалаПередачиАвто = Дата(1,1,1);
		Иначе
			ДатаНачалаПередачиАвто = Дата(ГодСтрокой, МесяцСтрокой, ДеньСтрокой);
		КонецЕсли;
		
		ДатаОкончанияПередачиАвто = ДатаНачалаПередачиАвто + 86400 * 7;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПередачиАвтоПриИзменении(Элемент)

	Если ДатаОкончанияПередачиАвто < ДатаНачалаПередачиАвто Тогда
		Сообщить("Дата окончания передачи автомобиля " + Формат(ДатаОкончанияПередачиАвто, "ДЛФ=Д") 
		+ ", не может быть меньше даты начала передачи " + Формат(ДатаНачалаПередачиАвто, "ДЛФ=Д") + "!", СтатусСообщения.Внимание);
		ДатаОкончанияПередачиАвто = ДатаНачалаПередачиАвто;
	КонецЕсли;
	
КонецПроцедуры  
// -- Ковалев ЕС от 23.08.2018

Функция ЭлементПринадлежитТаблицеФормы(Элемент)
	
	Если ТипЗнч(Элемент.Родитель) = Тип("ТаблицаФормы") Тогда
		Возврат Истина;
	ИначеЕсли ТипЗнч(Элемент.Родитель) = Тип("УправляемаяФорма") Тогда
		Возврат Ложь;
	Иначе	
		Возврат ЭлементПринадлежитТаблицеФормы(Элемент.Родитель);
	КонецЕсли;
	
КонецФункции 

&НаКлиенте
Процедура ОбработкаПриИзмененииДанных(Элемент)
	
	ДействияЭлементов = ПолучитьИзВременногоХранилища(АдресХранилищаПриИзменении);
	
	Действие = ДействияЭлементов.Получить(Элемент.Имя);
	Если ЗначениеЗаполнено(Действие) Тогда
		Попытка
			Выполнить(Строка(Действие) + "(Элемент)");     
		Исключение
		КонецПопытки;	
	КонецЕсли;
	
	ОбработкаИзмененияДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНачалаВыбораДанных(Элемент,ДанныеВыбора=Неопределено,СтандартнаяОбработка=Ложь)
	
	ДействияЭлементов = ПолучитьИзВременногоХранилища(АдресХранилищаНачалоВыбора);
	
	Действие = ДействияЭлементов.Получить(Элемент.Имя);
	Если ЗначениеЗаполнено(Действие) Тогда
		Попытка
			Выполнить(Строка(Действие) + "(Элемент, ДанныеВыбора, СтандартнаяОбработка)");     
		Исключение
		КонецПопытки;	
	КонецЕсли;
	
	ОбработкаИзмененияДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияДанных()
	
	
	ЭтаФорма.Модифицированность = Истина;
	
	Если ЗначениеЗаполнено(ТекущееКП) 
		И ТипЗнч(ТекущееКП) =  Тип("ДокументСсылка.CRM_КоммерческоеПредложение") Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("Перезаписать?",Режим,0) ;
		Если Ответ = КодВозвратаДиалога.Да Тогда
			КонфигурацияПерезаписать();
		КонецЕсли ;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Массив=Новый Массив;
	
	Массив.Добавить(Элементы.ДекорацияЛоготип);
	Массив.Добавить(Элементы.Закрыть);
	Массив.Добавить(Элементы.ОткрытьСклад);
	Массив.Добавить(Элементы.ПоказатьЗаполненныйТекст);
	
	Renault_ОбщиеФункции.МультибрендОсновноеОформление(Массив);
	
	НастройкиОтправки = Renault_CRM.ПолучитьНастройкиОтправкиКП(ПараметрыСеанса.Пользователь.Сотрудник);
	РассылкаУчетнаяЗапись = НастройкиОтправки.УчетнаяЗапись;
	РассылкаТемаСообщения = НастройкиОтправки.Тема;
	РассылкаТекстСоообщения = НастройкиОтправки.Текст;
	Если ЗначениеЗаполнено( НастройкиОтправки.УчетнаяЗапись) Тогда
		РассылкаПредставление = НастройкиОтправки.УчетнаяЗапись.Наименование;
	КонецЕсли;
	
	НеОбновлятьПриАктивизацииСтроки = Истина;
	
	ПриОткрытииСервер();
	
	Если Не ТекущееКП.Пустая() Тогда
		//Загрузим коммерческое предложение при открытии
		ЗагрузитьКоммерческоеПредложение(ТекущееКП, Истина);
		
		//оборудование
		ВыбранноеОборудование.Очистить();
		Для Каждого Стр Из ТекущееКП.Оборудование Цикл
			нСтр=ВыбранноеОборудование.Добавить();
			ЗаполнитьЗначенияСвойств(нСтр,Стр);
			нСтр.Номенклатура=Стр.Оборудование;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ТекущееКП.ПолисОСАГО) Тогда
			
			СтраховкаОСАГОВключать = Истина;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущееКП.ПолисКАСКО) Тогда
			
			СтраховкаКАСКОВключать = Истина;
			
		КонецЕсли;
		Возраст = ТекущееКП.Возраст;
		СтажВождения = ТекущееКП.СтажВождения;
		
		//ОбновитьТаблицыСклад();
		ОбновитьРежимРедактирования();
	ИначеЕсли Не Автомобиль.Пустая() Тогда
		//Загрузим автомобиль при открытии
		ЗагрузитьАвтомобильВКонфигураторКлиент(Автомобиль);
		//ОбновитьТаблицыСклад();
	Иначе	
		//Пустой конфигуратор
		Если НЕ ЭтоКорпКлиент Тогда
			ИнтересовалсяКредитом = Истина;
		Иначе
			ИнтересовалсяКорпЛизингом = Истина;
		КонецЕсли;
		ОбновитьСписокКонфигураций(Модель);
		ОбновитьСписокЦветов(Модель);
		ПриИзмененииВерсииАвто();
		ОбновитьВидимостьЭлементов();
		ОбновитьЗаголовки();
	КонецЕсли;
	
	ПроверитьПервичнуюМодель();
	ЗаполнитьОпцииНаСервере();
	ЗаполнитьДвигателиНаСервере();
	ЗаполнитьКППНаСервере();
	ПодключитьОбработчикОжидания("ОбновитьКартинкуМоделиКлиент", 0.2, Истина);
	ПриИзмененииМоделиАвто();
	
	УстановитьЦенуРОП();
	НеОбновлятьПриАктивизацииСтроки = Ложь;
	ЗаявкаНаКредитОчисткаСервер();
	ЗаявкаНаОборудованиеОчисткаСервер();
	//ЗаявкаНаСтраховкуОчисткаСервер();
	ОбновитьОтображениеГруппПоЗаявкам();
	ПересчитатьЦенуАвто();
	ТипДвигателяОтбор = 1;
	ПредупредитьОбОтсутствииТарифа();
	Если УстановитьРасчетнуюПоЦенеРоп Тогда УстановитьРасчетнуюПоЦенеРопПриИзменении(Элементы.УстановитьРасчетнуюПоЦенеРоп); КонецЕсли;
	
	УправлениеКнопкамиОФУ();
	ЗакрытьФорму = Ложь;
	
	
	
	Если ЗначениеЗаполнено(Версия) Тогда
		Для Каждого Строка Из ТаблицаКомплектации цикл
			Если Строка.Ссылка=Версия Тогда Элементы.ТаблицаКомплектации.ТекущаяСТрока=Строка.ПолучитьИдентификатор(); Прервать КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ОбновитьТаблицыСалон();
	
	Если ЗначениеЗаполнено(ТекущийВариантСалона) Тогда
		Для Каждого Строка Из Таблица_ВариантыСалона цикл
			Если Строка.Ссылка=ТекущийВариантСалона Тогда Элементы.ТаблицаВариантыСалона.ТекущаяСТрока=Строка.ПолучитьИдентификатор(); Прервать КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийЦветСалона) Тогда
		Для Каждого Строка Из Таблица_ЦветаСалона цикл
			Если Строка.Ссылка=ТекущийЦветСалона Тогда Элементы.ТаблицаЦветаСалона.ТекущаяСТрока=Строка.ПолучитьИдентификатор(); Прервать КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	
	
	Если ЗначениеЗаполнено(Цвет) Тогда                             
		Для Каждого Строка Из ТаблицаЦвета Цикл
			Если Строка.Цвет=Цвет Тогда Элементы.ТаблицаЦвета.ТекущаяСТрока=Строка.ПолучитьИдентификатор(); Прервать КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ИнтересовалсяУтилизацией И ИнтересовалсяТрейдИн Тогда
		ИнтересовалсяУтилизацией = Ложь;
	КонецЕсли;
	
	Элементы.ИнтересовалсяТрейдИн.Доступность = НЕ ИнтересовалсяУтилизацией;
	
	Элементы.ИнтересовалсяУтилизацией.Доступность = НЕ ИнтересовалсяТрейдИн;	
	
	Если ПоказатьСтраницуОборудования Тогда
		Элементы.ГруппаСтраницыКонфигурирование.ТекущаяСтраница = Элементы.ГруппаСтраницыКонфигурирование.ПодчиненныеЭлементы.ГруппаОпции;
		Элементы.ГруппаПараметрыКонфигурации.ТекущаяСтраница    = Элементы.ГруппаПараметрыКонфигурации.ПодчиненныеЭлементы.ГруппаЗакладкаОборудование;
	КонецЕсли; 
	
	Если СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да Тогда 
		Элементы.ПечатьСогласиеНаОПД.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИнтервалПроверкиНапоминаний(Команда)
	
	ОткрытьФорму("ОбщаяФорма.CRM_ФормаИнтервалаНапоминаний");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПлановыеРезультатыКонтактов(Команда)
	
	ОткрытьФорму("Справочник.CRM_ПлановыеРезультатыКонтактов.Форма.ФормаСпискаУпр", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМакетыПечатныхФорм(Команда)
	
	ОткрытьФорму("РегистрСведений.Renault_ПользовательскиеМакетыПечати.Форма.МакетыПечатныхФорм", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиКП(Команда)
	
	ОткрытьФорму("ОбщаяФорма.CRM_НастройкаКП", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПрограммыЗащитыКредита(Команда)
	
	ОткрытьФорму("Справочник.CRM_ПрограммыЗащитыКредита.Форма.ФормаСпискаУпр", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтоимостьПродленнойГарантии(Команда)
	
	ОткрытьФорму("РегистрСведений.CRM_СтоимостьПродленнойГарантии.Форма.ФормаСпискаУпр", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоКоммерческимПредложениям(Команда)
	
	ОткрытьФорму("Отчет.CRM_ОтчетПоКоммерческимПредложениям.Форма.ФормаОтчета", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	//Если ИмяСобытия = "ЗагрузитьВКонфигуратор" Тогда
	//	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Автомобили") Тогда
	//		ЗагрузитьАвтоВКонфигуратор(Параметр);
	//		ПересчитатьЦенуАвто();
	//		Элементы.Разделыы.ТекущаяСтраница = Элементы.Конфигуратор;
	//	КонецЕсли
	//КонецЕсли;
	Если ИмяСобытия = "ОбновитьДанныеКоммерческогоПредложения" тогда
		Элементы.ПрикрепленныеФайлы.Обновить();
	КонецЕСли;	
КонецПроцедуры

&НаКлиенте
Процедура МодельПриИзменении(Элемент)
	
	ПриИзмененииВерсииАвто();
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьЦенуВариантаКомплектации()
	
	ЦенаВариантаКомплектации = 0;
	
	Если ТипКП = Перечисления.Renault_ТипКП.НовыйАвтомобиль Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("VIN", Автомобиль.VIN);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	CRM_СостояниеАвтомобилейПроизводителя_v2.ЦенаПродажиБаза
		|ИЗ
		|	РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
		|ГДЕ
		|	CRM_СостояниеАвтомобилейПроизводителя_v2.VIN = &VIN";
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЦенаВариантаКомплектации = Выборка.ЦенаПродажиБаза;
		Иначе
			ЦенаВариантаКомплектации = 0;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЦенаВариантаКомплектации = 0 Тогда
		
		Запрос = Новый Запрос;
		Если ЭтоТрейдИН Тогда
			//Запрос.Текст = 
			//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			//|	ОстаткиАвтомобилей.Автомобиль КАК Автомобиль,
			//|	ЕСТЬNULL(ОстаткиАвтомобилей.СуммаОстаток, 0) / ЕСТЬNULL(ОстаткиАвтомобилей.КоличествоОстаток, 0) КАК ЦенаКлиентская
			//|ИЗ
			//|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(
			//|			,
			//|			СкладКомпании В
			//|					(ВЫБРАТЬ
			//|						Renault_РеквизитыСкладовКомпании.СкладКомпании
			//|					ИЗ
			//|						РегистрСведений.Renault_РеквизитыСкладовКомпании КАК Renault_РеквизитыСкладовКомпании
			//|					ГДЕ
			//|						Renault_РеквизитыСкладовКомпании.СкладПодержанныхАвто = ИСТИНА
			//|						И Renault_РеквизитыСкладовКомпании.СкладКомпании В (&МассивСкладовДилера))
			//|				И Автомобиль = &Автомобиль) КАК ОстаткиАвтомобилей";
			//ДилерскийЦентрПользователя = Renault_РаботаСПравамиПользователя.ДилерскийЦентрПоУмолчанию(ПараметрыСеанса.Пользователь);
			//МассивСкладовДилера = ДилерскийЦентрПользователя.СкладыДилера.ВыгрузитьКолонку("Склад");
			//Запрос.УстановитьПараметр("МассивСкладовДилера", МассивСкладовДилера);
			//Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЦеныАвтомобилейСрезПоследних.Цена как ЦенаКлиентская
			|ИЗ
			|	РегистрСведений.ЦеныАвтомобилей.СрезПоследних(
			|			,
			|			ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)
			|				И Автомобиль = &Автомобиль) КАК ЦеныАвтомобилейСрезПоследних";
			Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
		Иначе
			
			Запрос.УстановитьПараметр("Модель", Модель);
			Запрос.УстановитьПараметр("ВариантКомплектации", Версия);
			Запрос.УстановитьПараметр("Тариф", ТекущийТариф);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	Renault_ТарифНаКомплектацииАвтомобилей.ЦенаКлиентская
			|ИЗ
			|	РегистрСведений.Renault_ТарифНаКомплектацииАвтомобилей.СрезПоследних(, Тариф = &Тариф) КАК Renault_ТарифНаКомплектацииАвтомобилей
			|ГДЕ
			|	Renault_ТарифНаКомплектацииАвтомобилей.Модель = &Модель
			|	И Renault_ТарифНаКомплектацииАвтомобилей.ВариантКомплектации = &ВариантКомплектации
			|
			|УПОРЯДОЧИТЬ ПО
			|	Renault_ТарифНаКомплектацииАвтомобилей.Период УБЫВ";
		КонецЕсли;
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЦенаВариантаКомплектации = Выборка.ЦенаКлиентская;
		Иначе
			ЦенаВариантаКомплектации = 0;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьКартинкуМодели()
	АдресКартинки = "";
	МенеджерИдентификатор = РегистрыСведений.CRM_ИдентификаторыКартинок.СоздатьМенеджерЗаписи();
	МенеджерИдентификатор.Модель = Модель;
	МенеджерИдентификатор.Цвет = Цвет;
	МенеджерИдентификатор.ВариантКомплектации = Версия;
	МенеджерИдентификатор.Прочитать();
	Если НЕ МенеджерИдентификатор.Выбран() Тогда
		МенеджерИдентификатор.Модель = Модель;
		МенеджерИдентификатор.ВариантКомплектации = Версия;
		МенеджерИдентификатор.Прочитать();
	КонецЕсли;
	Если НЕ МенеджерИдентификатор.Выбран() Тогда
		МенеджерИдентификатор.Модель = Модель;
		МенеджерИдентификатор.Цвет = Цвет;
		МенеджерИдентификатор.Прочитать();
	КонецЕсли;
	Если НЕ МенеджерИдентификатор.Выбран() Тогда
		МенеджерИдентификатор.Модель = Модель;
		МенеджерИдентификатор.Прочитать();
	КонецЕсли;
	Если НЕ МенеджерИдентификатор.Выбран() Тогда
		Возврат
	КонецЕсли;
	КлючЗаписиРег = РегистрыСведений.КартинкиИФайлы.СоздатьКлючЗаписи(Новый Структура("Объект, Идентификатор", Модель, МенеджерИдентификатор.Идентификатор)); 
	Если НЕ КлючЗаписиРег.Пустой() Тогда
		АдресКартинки = ПолучитьНавигационнуюСсылку(КлючЗаписиРег, "Данные")
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВерсияПриИзменении(Элемент)
	
	ПриИзмененииВерсииАвто();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьЦенуАвто()
	
	ЦенаДопОпций = 0;
	Для Каждого ДопОпция Из ВыбранныеНебазовыеОпции Цикл
		ЦенаДопОпций = ЦенаДопОпций + ?(ДопОпция.Выбран, ДопОпция.Цена, 0);
	КонецЦикла;
		
	Если ИнтересовалсяУтилизацией Тогда
		СуммаУтилизации = Renault_ОбщегоНазначения.ПолучитьСуммуСкидкиПоУтилизации(Автомобиль.VIN,Автомобиль.Модель,Автомобиль.ВариантКомплектации,Автомобиль.ГодВыпуска);
	Иначе
		СуммаУтилизации = 0;
	КонецЕсли;
	
	ЦенаОборудования = ВыбранноеОборудование.Итог("Сумма");
	ЦенаАвторабот = ВыбранныеАвтоработы.Итог("Сумма");
	ПересчитатьСкидки();
	ПересчитатьСуммуКредита();
	ЦенаИТОГО = ЦенаВариантаКомплектации + ЦенаДопОпций - ЦенаВыкупа + СуммаДоставки + ЦенаОборудования + ЦенаАвторабот + ?(СтраховкаОСАГОВключать = Истина, СтраховкаОСАГОСумма, 0) + ГарантияСумма + СервисныеКонтрактыСумма + ПомощьНаДорогахСумма - СуммаСкидки - СуммаУтилизации;
	Если Не(ЦенаРОП = 0) Тогда
		Если УстановитьРасчетнуюПоЦенеРоп Тогда
			НаценкаРОП = ЦенаРОП - (ЦенаИТОГО - ЦенаОборудования - ЦенаАвторабот); //временно
			Если НаценкаРОП > 0 Тогда
				СуммаДоставки = СуммаДоставки + НаценкаРОП;
				ЦенаИТОГО = ЦенаВариантаКомплектации + ЦенаДопОпций - ЦенаВыкупа + СуммаДоставки + ЦенаОборудования + ЦенаАвторабот + СтраховкаОСАГОСумма + СтраховкаКАСКОСумма + ГарантияСумма + СервисныеКонтрактыСумма + ПомощьНаДорогахСумма - СуммаСкидки - СуммаУтилизации;
			ИначеЕсли НаценкаРОП < 0 Тогда
				СуммаСкидки = - НаценкаРОП;
				ЦенаИТОГО = ЦенаВариантаКомплектации + ЦенаДопОпций - ЦенаВыкупа + СуммаДоставки + ЦенаОборудования + ЦенаАвторабот + СтраховкаОСАГОСумма + СтраховкаКАСКОСумма + ГарантияСумма + СервисныеКонтрактыСумма + ПомощьНаДорогахСумма - СуммаСкидки - СуммаУтилизации;
			КонецЕсли;
		Иначе
			//Не меняем	
		КонецЕсли;
	КонецЕсли;
	
	ПересчитатьСкидки();
	
	ОбновитьНадписьЦена();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьЦена()
	
	Разделитель = "--------------------------";
	ШиринаРазделителя = СтрДлина(Разделитель); // символов
	
	НадписьЦена = 
	"Комплектация: " + Строка(ЦенаВариантаКомплектации) + Символы.ПС +
	"Опции:        " + Строка(ЦенаДопОпций) + Символы.ПС +
	"Оборудование: " + Строка(ЦенаОборудования) + Символы.ПС +
	//"Автоработы:   " + Строка(ЦенаАвторабот) + Символы.ПС +
	//"Доставка:     " + Строка(СуммаДоставки) + Символы.ПС +
	"Утилизация:   " + Строка(СуммаУтилизации) + Символы.ПС +
	"Трейд-ин:     " + Строка(ЦенаВыкупа) + Символы.ПС +
	"Пр.гарантия:  " + Строка(ГарантияСумма) + Символы.ПС +
	"Помощь на дорогах:  " + Строка(ПомощьНаДорогахСумма) + Символы.ПС +
	"Сервисные контракты:  " + Строка(СервисныеКонтрактыСумма) + Символы.ПС +

	"Страховка:    " + Строка(СтраховкаОСАГОСумма + СтраховкаКАСКОСумма ) + Символы.ПС ;
	//?(СуммаСкидки > 0,	"СКИДКА:       " + Строка(СуммаСкидки) + Символы.ПС, "") +
	//"--------------------------" + Символы.ПС +
	//"ИТОГО:        " + Строка(ЦенаИТОГО) + " р.";
	
	Если СуммаСкидки > 0 Тогда
		Массив = Новый Массив();
		
		Для Каждого ТекСтр Из СписокСкидок Цикл
			ИмяСкидкиСтр = ?(ЗначениеЗаполнено(ТекСтр.Акция), Строка(ТекСтр.Акция),
				?(ЗначениеЗаполнено(ТекСтр.ТипСкидки), Строка(ТекСтр.ТипСкидки), "Скидка")) + ":";
			СуммаСкидкиСтр = " " + Формат(ТекСтр.СуммаСкидки, "ЧДЦ=0; ЧН=0; ЧГ=3,0");
			ДопустимоСимволов = ШиринаРазделителя - СтрДлина(СуммаСкидкиСтр);
			
			Пока Истина Цикл
				Если ДопустимоСимволов < СтрДлина(ИмяСкидкиСтр) Тогда
					Массив.Добавить(Лев(ИмяСкидкиСтр, ШиринаРазделителя));
					ИмяСкидкиСтр = Сред(ИмяСкидкиСтр, ШиринаРазделителя + 1);
				Иначе
					Заполнитель = Лев("                                       ", ДопустимоСимволов - СтрДлина(ИмяСкидкиСтр));					
					Массив.Добавить(СтрШаблон("%1%2%3", ИмяСкидкиСтр, Заполнитель, СуммаСкидкиСтр));
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		НадписьЦена = НадписьЦена + СтрСоединить(Массив, Символы.ПС) + Символы.ПС;
	КонецЕсли;
	
	НадписьЦена = НадписьЦена + Разделитель + Символы.ПС +
	"ИТОГО:        " + Строка(ЦенаИТОГО) + " р.";
	
	НадписьРасчетнаяЦена = "Расчетная цена " + Строка(ЦенаИтого) + " р.";
	НадписьЦенаРуководителя = "Цена руководителя " + Строка(ЦенаРОП) + " р.";
	
	Элементы.ГруппаЦена.Заголовок = НадписьРасчетнаяЦена;
	Элементы.ДекорацияЦенаРОП.Заголовок = НадписьЦенаРуководителя;
	Элементы.ДекорацияЦенаРОП.Видимость = ЗначениеЗаполнено(ЦенаРОП);
	Элементы.УстановитьРасчетнуюПоЦенеРоп.Видимость = ЗначениеЗаполнено(ЦенаРОП);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуКредита()
	
	Возврат;
	
	СуммаКредита = ЦенаВариантаКомплектации - ЦенаВыкупа + СуммаДоставки;
	Если ДопОборудованиеВКредит Тогда
		СуммаКредита = СуммаКредита + ЦенаДопОпций + ЦенаОборудования + ЦенаАксессуаров;
	КонецЕсли;
	Если ВключитьСтраховкуВКредит Тогда
		СуммаКредита = СуммаКредита + СтраховкаКАСКОСумма;
	КонецЕсли;
	Если ВключитьПродленнуюГарантиюВКредит Тогда
		СуммаКредита = СуммаКредита + ГарантияСумма;
	КонецЕсли;
	Если УчитыватьСкидкуПриРасчетеСуммыКредита Тогда
		СуммаКредита = СуммаКредита - СуммаСкидки;
	КонецЕсли;
	ПересчитатьКредит();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСпискиОборудованияАксессуаров()
	
	Запрос = Новый Запрос;
	
	Если ЭтоТрейдИН Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ОпцииАвтомобилей.Опция КАК Опция,
		|	Renault_ОпцииАвтомобилей.Цена КАК Цена,
		|	Renault_ОпцииАвтомобилей.Код КАК КодОпции,
		|	Renault_ОпцииАвтомобилей.Наименование КАК НаименованиеОпции,
		|	ИСТИНА КАК Выбран
		|ИЗ
		|	РегистрСведений.Renault_ОпцииАвтомобилей КАК Renault_ОпцииАвтомобилей
		|ГДЕ
		|	Renault_ОпцииАвтомобилей.VIN = &VIN";
		Запрос.УстановитьПараметр("VIN", Автомобиль.VIN);
		
	Иначе
		
		Запрос.УстановитьПараметр("Тариф", ТекущийТариф);
		//Андрианова Начало 23.12.2016
		Если НЕ ЗначениеЗаполнено(ТекущаяКонфигурация) Тогда
			СтрокиВыбранные = ВыбранныеНебазовыеОпции.НайтиСтроки(Новый Структура("Выбран", Истина));
			Если СтрокиВыбранные.Количество() > 0 Тогда
				ТЗСтрокиВыбранные = Новый ТаблицаЗначений;
				ТЗСтрокиВыбранные.Колонки.Добавить("Опция", Новый ОписаниеТипов("СправочникСсылка.Опции"));
				ТЗСтрокиВыбранные.Колонки.Добавить("Выбран",Новый ОписаниеТипов("Булево"));
				Для Каждого Стр Из СтрокиВыбранные Цикл
					НовСтрока = ТЗСтрокиВыбранные.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрока,Стр);
				КонецЦикла;
				Запрос.УстановитьПараметр("УжеВыбрано", ТЗСтрокиВыбранные);
			Иначе
				Запрос.УстановитьПараметр("УжеВыбрано", ТекущаяКонфигурация.Опции.Выгрузить());
			КонецЕсли;
		Иначе
			//Андрианова Конец 23.12.2016
			Запрос.УстановитьПараметр("УжеВыбрано", ТекущаяКонфигурация.Опции.Выгрузить());
			//Андрианова Начало 23.12.2016
		КонецЕсли;
		//Андрианова Конец 23.12.2016
		Запрос.УстановитьПараметр("Модель", Модель.Артикул);
		Запрос.УстановитьПараметр("ВариантКомплектации", Версия.Артикул);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Модели.Ссылка
		|ПОМЕСТИТЬ Модели
		|ИЗ
		|	Справочник.Модели КАК Модели
		|ГДЕ
		|	Модели.Артикул = &Модель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВариантыКомплектации.Ссылка
		|ПОМЕСТИТЬ Варианты
		|ИЗ
		|	Справочник.ВариантыКомплектации КАК ВариантыКомплектации
		|ГДЕ
		|	ВариантыКомплектации.Артикул = &ВариантКомплектации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИСТИНА КАК Выбран,
		|	УжеВыбрано.Опция
		|ПОМЕСТИТЬ ВТ_УжеВыбрано
		|ИЗ
		|	&УжеВыбрано КАК УжеВыбрано
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Renault_ТарифНаОпцииАвтомобилей.Опция КАК ОпцияСпр,
		|	Renault_ТарифНаОпцииАвтомобилей.НаименованиеОпции КАК НаименованиеОпции,
		|	Renault_ТарифНаОпцииАвтомобилей.ЦенаКлиентская,
		|	Renault_ТарифНаОпцииАвтомобилей.Опция.Артикул КАК КодОпции
		|ПОМЕСТИТЬ ВТ_Опции
		|ИЗ
		|	РегистрСведений.Renault_ТарифНаОпцииАвтомобилей.СрезПоследних(
		|			,
		|			Тариф = &Тариф
		|				И Базовая = ЛОЖЬ
		|				И Модель В
		|					(ВЫБРАТЬ
		|						Модели.Ссылка
		|					ИЗ
		|						Модели КАК Модели)
		|				И ВариантКомплектации В
		|					(ВЫБРАТЬ
		|						Варианты.Ссылка
		|					ИЗ
		|						Варианты КАК Варианты)) КАК Renault_ТарифНаОпцииАвтомобилей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(ВТ_Опции.ОпцияСпр, ВТ_УжеВыбрано.Опция) КАК Опция,
		|	ЕСТЬNULL(ВТ_Опции.НаименованиеОпции, ПРЕДСТАВЛЕНИЕ(ВТ_УжеВыбрано.Опция)) КАК НаименованиеОпции,
		|	ВТ_Опции.ЦенаКлиентская КАК Цена,
		|	ВТ_Опции.КодОпции КАК КодОпции,
		|	ВЫБОР
		|		КОГДА ВТ_УжеВыбрано.Опция ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Выбран
		|ИЗ
		|	ВТ_УжеВыбрано КАК ВТ_УжеВыбрано
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Опции КАК ВТ_Опции
		|		ПО (ВТ_Опции.ОпцияСпр = ВТ_УжеВыбрано.Опция)";
	КонецЕсли;
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	ВыбранныеНебазовыеОпции.Загрузить(ТаблицаРезультат);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКартинку(Картинка)
	
	//Удалим старую картинку
	МенеджерИдент = РегистрыСведений.CRM_ИдентификаторыКартинок.СоздатьМенеджерЗаписи();
	МенеджерИдент.Модель = Модель;
	МенеджерИдент.ВариантКомплектации = Версия;
	МенеджерИдент.Цвет = Цвет;
	МенеджерИдент.Прочитать();
	Если МенеджерИдент.Выбран() Тогда
		МенеджерКартинки = РегистрыСведений.КартинкиИФайлы.СоздатьМенеджерЗаписи();
		МенеджерКартинки.Объект = Модель;
		МенеджерКартинки.Идентификатор = МенеджерИдент.Идентификатор;
		МенеджерКартинки.Удалить();
	КонецЕсли;
	МенеджерИдент.Модель = Модель;
	МенеджерИдент.ВариантКомплектации = Версия;
	МенеджерИдент.Цвет = Цвет;
	Идентификатор = Строка(Новый УникальныйИдентификатор);
	МенеджерИдент.Идентификатор = Идентификатор;
	МенеджерИдент.Записать(Истина);
	
	МенеджерКартинки = РегистрыСведений.КартинкиИФайлы.СоздатьМенеджерЗаписи();
	МенеджерКартинки.Объект = Модель;
	МенеджерКартинки.Идентификатор = Идентификатор;
	МенеджерКартинки.Данные = Новый ХранилищеЗначения(Картинка);
	МенеджерКартинки.Записать(Истина);
	КлючЗаписиРег = РегистрыСведений.КартинкиИФайлы.СоздатьКлючЗаписи(Новый Структура("Объект,Идентификатор", Модель, Идентификатор)); 
	Если НЕ КлючЗаписиРег.Пустой() Тогда
		АдресКартинки = ПолучитьНавигационнуюСсылку(КлючЗаписиРег, "Данные")
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьКартинкуСервер()
	
	АдресКартинки = "";
	МенеджерИдент = РегистрыСведений.CRM_ИдентификаторыКартинок.СоздатьМенеджерЗаписи();
	МенеджерИдент.Модель = Модель;
	МенеджерИдент.ВариантКомплектации = Версия;
	МенеджерИдент.Цвет = Цвет;
	МенеджерИдент.Прочитать();
	Если МенеджерИдент.Выбран() Тогда
		МенеджерКартинки = РегистрыСведений.КартинкиИФайлы.СоздатьМенеджерЗаписи();
		МенеджерКартинки.Объект = Модель;
		МенеджерКартинки.Идентификатор = МенеджерИдент.Идентификатор;
		МенеджерКартинки.Удалить();
		МенеджерИдент.Удалить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВвозСтраховой ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_Отделы.Ссылка
	|ИЗ
	|	Справочник.CRM_Отделы КАК CRM_Отделы
	|ГДЕ
	|	CRM_Отделы.КлассификацияRenault = ЗНАЧЕНИЕ(Перечисление.CRM_КлассификацияОтделов.ОФУ)
	|	И CRM_Отделы.ДилерскийЦентр = &ДилерскийЦентр
	|	И НЕ CRM_Отделы.ПометкаУдаления";
	Запрос.УстановитьПараметр("ДилерскийЦентр", Renault_CRM.ПолучитьДилерскийЦентрПользователя());
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 1 Тогда
		ОтделОФУ = Результат[0].Ссылка;
	ИначеЕсли Результат.Количество() > 1 Тогда
		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("Ссылка"));
		ФормаВыбора = ПолучитьФорму("Обработка.CRM_АРМ_Конфигуратор.Форма.ФормаВыбораСписка");
		ФормаВыбора.СписокВыбора = СписокВыбора;
		ОтделОФУ = ФормаВыбора.ОткрытьМодально();
	Иначе
		ОтделОФУ = Справочники.CRM_Отделы.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СохранитьСтраховыеПолисы(ПолисОСАГО = неопределено, ПолисКАСКО = неопределено)
	
	СтруктураВозврата = Новый Структура;
	
	Если НЕ ЗначениеЗаполнено(ПолисОСАГО) тогда
		ПолисОСАГО = Документы.Renault_СтраховойПолис.ПустаяСсылка();
	КонецЕсли;
	
	Если СтраховкаОСАГОВключать Тогда
		
		Если ЗначениеЗаполнено(ПолисОСАГО) тогда
			ПолисОСАГООбъект = ПолисОСАГО.ПолучитьОбъект();
		иначе
			ПолисОСАГООбъект = Документы.Renault_СтраховойПолис.СоздатьДокумент();
		КонецЕсли;
		
		ПолисОСАГООбъект.Дата = ТекущаяДата();
		ПолисОСАГООбъект.ВидСтрахования = Справочники.DMS_ВидыФинансовыхУслуг.ОСАГО;
		ПолисОСАГООбъект.Автомобиль = Автомобиль;
		Если ТипЗнч(ТекущийКлиент) = Тип("СправочникСсылка.Контрагенты") и ЗначениеЗаполнено(ТекущийКлиент) тогда
			ПолисОСАГООбъект.Контрагент = ТекущийКлиент;
			ПолисОСАГООбъект.Плательщик = ТекущийКлиент;
		КонецЕсли;
		ПолисОСАГООбъект.Организация = ДЦ.Организация;
		ПолисОСАГООбъект.Записать();
		
		ПолисОСАГО = ПолисОСАГООбъект.Ссылка;
	КонецЕсли;
	
	СтруктураВозврата.Вставить("ПолисОСАГО", ПолисОСАГО.Ссылка);
	
	Если НЕ ЗначениеЗаполнено(ПолисКАСКО) тогда
		ПолисКАСКО = Документы.Renault_СтраховойПолис.ПустаяСсылка();
	КонецЕсли;
	
	Если СтраховкаКАСКОВключать Тогда
		
		Если ЗначениеЗаполнено(ПолисКАСКО) тогда
			ПолисКАСКООбъект = ПолисКАСКО.ПолучитьОбъект();
		иначе
			ПолисКАСКООбъект = Документы.Renault_СтраховойПолис.СоздатьДокумент();
		КонецЕсли;		
		
		ПолисКАСКООбъект.Дата = ТекущаяДата();
		ПолисКАСКООбъект.ВидСтрахования = Справочники.DMS_ВидыФинансовыхУслуг.КАСКО;
		ПолисКАСКООбъект.Автомобиль = Автомобиль;
		Если ТипЗнч(ТекущийКлиент) = Тип("СправочникСсылка.Контрагенты") и ЗначениеЗаполнено(ТекущийКлиент) тогда
			ПолисКАСКООбъект.Контрагент = ТекущийКлиент;
			ПолисКАСКООбъект.Плательщик = ТекущийКлиент;
		КонецЕсли;
		ПолисКАСКООбъект.Организация = ДЦ.Организация;
		ПолисКАСКООбъект.Записать();
		
		ПолисКАСКО = ПолисКАСКООбъект.Ссылка;
	КонецЕсли;
	
	СтруктураВозврата.Вставить("ПолисКАСКО", ПолисКАСКО.Ссылка);
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура СоздатьКПНажатие(Команда)
	
	Если Не ЗначениеЗаполнено(Версия) ИЛИ Не ЗначениеЗаполнено(Цвет) Тогда
		Предупреждение("Не указана версия или цвет автомобиля");
		Возврат;
	КонецЕсли;
	
	ВозможноСохранить = ПроверитьКредитСтраховку();
	Если НЕ ВозможноСохранить Тогда
		Предупреждение("Неверно подобрана кредитная программа");
		Возврат;
	КонецЕсли;
	
	//v+
	ЗадачиОФУ=ЗадачиОФУ();
	СуществуетКонсультацияОФУ=СоздатьЗадачу_ОФУ_Наличные ИЛИ ЗадачиОФУ.НайтиСтроки(Новый Структура("ВидСобытия",Справочники.CRM_ВидыСобытий.КонсультацияОФУ)).Количество()>0;
	СуществуетКредит=СоздатьЗадачу_ОФУ_Кредит ИЛИ ЗадачиОФУ.НайтиСтроки(Новый Структура("ВидСобытия",Справочники.CRM_ВидыСобытий.Кредит)).Количество()>0;
	СуществуетЛизинг=СоздатьЗадачу_ОФУ_Лизинг ИЛИ ЗадачиОФУ.НайтиСтроки(Новый Структура("ВидСобытия",Справочники.CRM_ВидыСобытий.Лизинг)).Количество()>0;
	Если НЕ ОтказОтКонсультацииОФУ И НЕ СуществуетКонсультацияОФУ И НЕ СуществуетКредит И НЕ СуществуетЛизинг Тогда
		Если Вопрос("Не выбран способ покупки автомобиля, продожить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
			Возврат
		КонецЕсли;
	КонецЕсли;
	//v-
	
	НеОбновлятьПриАктивизацииСтроки = Истина;
	
	ТекущаяКонфигурация = ЗаписатьКонфигурацию(Истина);
	
	Если ЗначениеЗаполнено(ТекущаяКонфигурация) Тогда
		
		ТекущееКП = Документы.CRM_КоммерческоеПредложение.ПустаяСсылка();
		
		ТипКП=ТипКП();
		// +++ ВалиховГА 21.10.2021 DMSREN-1364
		//ДобавитьКП(ТекущаяКонфигурация,ТипКП);
		Попытка
			ДобавитьКП(ТекущаяКонфигурация,ТипКП);
		Исключение
			Предупреждение("Не удалось провести коммерческое предложение!", 30);
			
			ЗаписьЖурналаРегистрации("Запись ком. предложения при блокировке", УровеньЖурналаРегистрации.Ошибка, , , 
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Возврат;
		КонецПопытки;
		// --- ВалиховГА 21.10.2021 DMSREN-1364
		
		Элементы.СписокКП.Обновить();
		Элементы.СписокКП.ТекущаяСтрока = ТекущееКП;
		
		ОткрытьСтраницуСоставКП();
		
		ОбновитьВидимостьЭлементов();
		ОбновитьЗаголовки();
		
	КонецЕсли;
	
	НеОбновлятьПриАктивизацииСтроки = Ложь;
	ЗагрузитьЗаявкуНаСтраховку();
	ОбновитьОтображениеГруппПоЗаявкам();
	
	//v+ 
	ОтложенноеСозданиеЗадачОФУ();
	//v-
	УправлениеКнопкамиОФУ();
	Оповестить("ОбновитьРабочийЛист",,ВладелецФормы);
	
	ЭтаФорма.Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовки()
	
	ОбновитьЗаголовокФормы();
	ОбновитьЗаголовокКлиент();
	ОбновитьЗаголовокКП();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокКлиент()
	
	Если ЗначениеЗаполнено(ФИО) Тогда
		ИмяКлиента = ФИО 
	Иначе
		ИмяКлиента = "<ФИО клиента не заполнено>";
	КонецЕсли;
	
	Если СтрДлина(ИмяКлиента) > 43 Тогда
		ИмяКлиента1 = Лев(ИмяКлиента, 42) + "...";
	Иначе
		ИмяКлиента1 = ИмяКлиента;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущееКП) Тогда
		//Козлов Е.А. Начало 30.01.2017
		Элементы.ДекорацияЗаголовок.Заголовок = "Коммерческое предложение №" + ТекущееКП.Номер + " от " + Формат(ТекущееКП.Дата, "ДФ=dd.MM.yyyy") + " - " + ИмяКлиента1 + " (РЛ №" + ТекущийРабочийЛист + ")"; 
		//Элементы.ДекорацияЗаголовок.Заголовок = "Коммерческое предложение - " + ИмяКлиента1 + " (РЛ №" + ТекущийРабочийЛист + ")"; 
		//Козлов Е.А. Конец
	Иначе
		Если ТекущийРабочийЛист = 0 Тогда
			Элементы.ДекорацияЗаголовок.Заголовок = "Коммерческое предложение* - " + ИмяКлиента1;
		Иначе
			Элементы.ДекорацияЗаголовок.Заголовок = "Коммерческое предложение* - " + ИмяКлиента1 + " (РЛ №" + ТекущийРабочийЛист + ")";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокФормы()
	
	Заголовок = "Конфигуратор";
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокКП()
	
	Элементы.ГруппаКоммерческиеПредложенияСостав.Заголовок = "Состав текущего коммерческого предложения №" + НомерКП + " от " + Формат(ДатаКП, "ДЛФ=Д");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииМоделиАвто()
	
	ПриИзмененииВерсииАвтоСервер();
	ПриИзмененииВерсииАвтоКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииВерсииАвто()
	
	ПриИзмененииВерсииАвтоСервер();
	ПриИзмененииВерсииАвтоКлиент();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииВерсииАвтоСервер()
	
	ПолучитьСуммуДоставки();
	ОбновитьТТХИБазовыеОпции();
	ОбновитьКартинкуМодели();
	ПересчитатьЦенуВариантаКомплектации(); //Цена версии
	ОбновитьСпискиОборудованияАксессуаров(); //Дополнительные опции
	Если ИнтересовалсяКредитом Тогда
		Если НЕ ЗначениеЗаполнено(КредитноеПредложение) Тогда
			ПолучитьОптимальноеПредложение();
		Иначе
			
		КонецЕсли;
	КонецЕсли;
	//ОбновитьТаблицыСклад();
	
	//v+
	ДобавитьДопОпции();
	//v-
	
	ОбновитьТаблицыСалон();
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицыСалон()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	DMS_ЦветаСалона.ЦветСалона
	               |ИЗ
	               |	РегистрСведений.DMS_ЦветаСалона КАК DMS_ЦветаСалона
	               |ГДЕ
	               |	DMS_ЦветаСалона.ВариантКомплектации = &ВариантКомплектации";
	ЗАпрос.УстановитьПараметр("ВариантКомплектации",Версия);
	Таблица_ЦветаСалона.Загрузить(ЗАпрос.Выполнить().Выгрузить());
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	DMS_ВариантыСалона.ВариантСалона
	               |ИЗ
	               |	РегистрСведений.DMS_ВариантыСалона КАК DMS_ВариантыСалона
	               |ГДЕ
	               |	DMS_ВариантыСалона.ВариантКомплектации = &ВариантКомплектации";
	ЗАпрос.УстановитьПараметр("ВариантКомплектации",Версия);
	Таблица_ВариантыСалона.Загрузить(ЗАпрос.Выполнить().Выгрузить());
	
КонецПроцедуры 	

&НаСервере
Процедура ПолучитьСуммуДоставки()
	
	СтоимостьДоставки = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕСТЬNULL(ЕСТЬNULL(ПоВерсиям.СтоимостьДоставки, ПоМоделям.СтоимостьДоставки), 0) КАК СтоимостьДоставки
	|ИЗ
	|	(ВЫБРАТЬ
	|		Renault_СтоимостьДоставкиАвтомобилей.СтоимостьДоставки КАК СтоимостьДоставки
	|	ИЗ
	|		РегистрСведений.Renault_СтоимостьДоставкиАвтомобилей КАК Renault_СтоимостьДоставкиАвтомобилей
	|	ГДЕ
	|		Renault_СтоимостьДоставкиАвтомобилей.Версия = &Версия) КАК ПоВерсиям
	|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Renault_СтоимостьДоставкиАвтомобилей.СтоимостьДоставки КАК СтоимостьДоставки
	|		ИЗ
	|			РегистрСведений.Renault_СтоимостьДоставкиАвтомобилей КАК Renault_СтоимостьДоставкиАвтомобилей
	|		ГДЕ
	|			Renault_СтоимостьДоставкиАвтомобилей.Модель = &Модель) КАК ПоМоделям
	|		ПО (ИСТИНА)";
	Запрос.УстановитьПараметр("Версия", Версия);
	Запрос.УстановитьПараметр("Модель", Модель);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтоимостьДоставки = Выборка.СтоимостьДоставки;
	КонецЕсли;
	Если СтоимостьДоставки = 0 ИЛИ Не ЗначениеЗаполнено(СтоимостьДоставки) Тогда
		СтоимостьДоставки = ТекДилерскийЦентр.СтоимостьДоставкиПоУмолчанию;;
	КонецЕсли;
	
	СуммаДоставки = СтоимостьДоставки;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицыСклад()
	
	ТекущийДЦ = Renault_РаботаСПравамиПользователя.ДилерскийЦентрПоУмолчанию(ПараметрыСеанса.Пользователь);
	BIR_Distri = СокрЛП(ТекущийДЦ.BIR_Distri);
	МассивСкладовДилера = ТекущийДЦ.СкладыДилера.ВыгрузитьКолонку("Склад");
	// начало добавление Зеленчук
	МассивВариантовКомплектаций = Новый Массив;
	Если Не ЗначениеЗаполнено(Версия) Тогда
		Для Каждого ТекСтрока Из ТаблицаКомплектации Цикл
			Если ЗначениеЗаполнено(ТекСтрока.Ссылка) Тогда
				МассивВариантовКомплектаций.Добавить(ТекСтрока.Ссылка);
			КонецЕсли;
		КонецЦикла;
	Иначе
		МассивВариантовКомплектаций.Добавить(Версия);
	КонецЕсли;
	// окончание добавление Зеленчук
	// начало изменение Зеленчук
	//ТаблицаСклад.Загрузить(CRM_Сервер.Автосклад_ПолучитьТаблицуПоСостояниюАвтомобилей("", МассивСкладовДилера, BIR_Distri, Ложь, Ложь, Ложь, Ложь, Модель, Версия, Цвет, Ложь,, ТекущийДЦ.ДатаНеПоказыватьВыданныеАвтомобили));
	ТаблицаСклад.Загрузить(CRM_Сервер.Автосклад_ПолучитьТаблицуПоСостояниюАвтомобилей("", МассивСкладовДилера, BIR_Distri, Ложь, Ложь, Ложь, Ложь, Модель, МассивВариантовКомплектаций, Цвет, Ложь,, ТекущийДЦ.ДатаНеПоказыватьВыданныеАвтомобили));
	// окончание изменение Зеленчук
	ТаблицаСклад.Сортировать("КоличествоДнейНаСкладеДилера Убыв, ПТСПолученДилером Возр");
	
	//Андрианова Начало 26.12.2016
	//если данных по выбранной модели нет, то предупредим пользователя о наличии модели с таким же названием
	Если ТаблицаСклад.Количество() = 0 И ЗначениеЗаполнено(Модель) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Модели.Ссылка
		|ИЗ
		|	Справочник.Модели КАК Модели
		|ГДЕ
		|	Модели.НаименованиеПолное ПОДОБНО &НаименованиеПолное
		|	И Модели.Ссылка <> &Модель";
		
		Запрос.УстановитьПараметр("НаименованиеПолное", Модель.НаименованиеПолное);
		Запрос.УстановитьПараметр("Модель", Модель);
		
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			Если ЗначениеЗаполнено(Версия) Тогда
				Сообщить("В автоскладе нет данных по выбранной комплектации");
			Иначе
				Сообщить("В автоскладе нет данных по выбранной модели"); 
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
	//Андрианова Конец 26.12.2016	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТТХИБазовыеОпции()
	
	ТТХ.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Версия", Версия);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Renault_ДопИнформацияПоВерсиям.ОбъемДвигателя КАК ДвигательОбъем,
	|	Renault_ДопИнформацияПоВерсиям.ТипТоплива КАК ДвигательТипТоплива,
	|	Renault_ДопИнформацияПоВерсиям.МощностьЛС КАК ДвигательЛС,
	|	Renault_ДопИнформацияПоВерсиям.МощностьКВТ КАК Двигатель_кВт,
	|	Renault_ДопИнформацияПоВерсиям.СтандартЕвро КАК Двигатель_НормаЕвро,
	|	Renault_ДопИнформацияПоВерсиям.МаксимальнаяМасса КАК МассаMax,
	|	Renault_ДопИнформацияПоВерсиям.МинимальнаяМасса КАК МассаMin
	|ИЗ
	|	РегистрСведений.Renault_ДопИнформацияПоВерсиям КАК Renault_ДопИнформацияПоВерсиям
	|ГДЕ
	|	Renault_ДопИнформацияПоВерсиям.ВариантКомплектации = &Версия";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Стр = ТТХ.Добавить();
		Стр.Показатель = "Объём двигателя";
		Стр.Значение = Выборка.ДвигательОбъем;
		Стр = ТТХ.Добавить();
		Стр.Показатель = "Тип топлива";
		Стр.Значение = Выборка.ДвигательТипТоплива;
		Стр = ТТХ.Добавить();
		Стр.Показатель = "Мощность (л.с.)";
		Стр.Значение = Выборка.ДвигательЛС;
		Стр = ТТХ.Добавить();
		Стр.Показатель = "Мощность (кВт)";
		Стр.Значение = Выборка.Двигатель_кВт;
		Стр = ТТХ.Добавить();
		Стр.Показатель = "Норма ЕВРО";
		Стр.Значение = Выборка.Двигатель_НормаЕвро;
		Стр = ТТХ.Добавить();
		Стр.Показатель = "Максимальная масса";
		Стр.Значение = Выборка.МассаMax;
		Стр = ТТХ.Добавить();
		Стр.Показатель = "Минимальная масса";
		Стр.Значение = Выборка.МассаMin;
	Иначе
		ТекущийИдентификатор = ""
	КонецЕсли;
	
	БазовыеОпции.Параметры.УстановитьЗначениеПараметра("Тариф", ТекущийТариф); 
	БазовыеОпции.Параметры.УстановитьЗначениеПараметра("Модель", Модель);
	БазовыеОпции.Параметры.УстановитьЗначениеПараметра("ВариантКомплектации", Версия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииВерсииАвтоКлиент()
	
	ПересчитатьЦенуАвто();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКоммерческоеПредложение(КоммерческоеПредложениеСсылка, ПриОткрытии)
	
	НеОбновлятьПриАктивизацииСтроки = Истина;
	
	ПрочитатьДанныеКП();
	
	Если Не ТекущееКП.Пустая() Тогда
		
		Элементы.СписокКП.ТекущаяСтрока = ТекущееКП;
		ОткрытьСтраницуСоставКП();
		ЗагрузитьКонфигурациюВКонфигураторКлиент(ТекущаяКонфигурация);
		
	КонецЕсли;
	
	ОбновитьЗаголовки();
	ОбновитьВидимостьЭлементов();
	
	//Козлов Е.А. Начало 02.02.2017
	Если Не ПриОткрытии И НЕ ЭтоКорпКлиент Тогда
		//РассчитатьСкидкиПоАвтомобилю();
		ПересчитатьСтоимость();
		СуммаСкидки = СписокСкидок.Итог("СуммаСкидки");
		
		ПересчитатьЦенуАвто();
	КонецЕсли;	
	//Козлов Е.А. Конец
	
	ТекущийЦветСалона = КоммерческоеПредложениеСсылка.ЦветСалона;
	ТекущийВариантСалона = КоммерческоеПредложениеСсылка.ВариантСалона;
	НеОбновлятьПриАктивизацииСтроки = Ложь;
	
	ОбновитьДанныеПрикрепленныхФайлов();
	
	СоздаватьЗаявкуНаСтраховку = ИнтересовалсяСтраховкой;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьАвтомобильВКонфигураторКлиент(АвтомобильСсылка)
	
	ТекущийТариф = Renault_CRM.ПолучитьПоследнийТарифНаАвтомобиль(АвтомобильСсылка.ВариантКомплектации);
	
	НеОбновлятьПриАктивизацииСтроки = Истина;
	
	Автомобиль = АвтомобильСсылка;
	если ЗначениеЗаполнено(Автомобиль) Тогда
		vin = Автомобиль.VIN;
	КонецЕсли;
	
	УстановитьЦенуРОП();
	Если не ЭтоТрейдИН Тогда
		
		ИндексыСтрок = ЗагрузитьАвтомобильВКонфигураторСервер(АвтомобильСсылка);
		ОбновитьТаблицыПоДаннымРеквизитов(ИндексыСтрок); 
		
	КонецЕсли;    
	ПересчитатьЦенуВариантаКомплектации(); //Плохо. Необходимо устанавливать в соответствии с авто
	ОбновитьТТХИБазовыеОпции();
	ОбновитьКартинкуМодели();
	
	ОбновитьСпискиОборудованияАксессуаров(); //Дополнительные опции
	ЗагрузитьОпцииИзАвтомобиля(АвтомобильСсылка);
	
	ПриИзмененииВерсииАвтоКлиент();
	
	ОбновитьЗаголовки();
	ОбновитьВидимостьЭлементов();
	ОбновитьРежимРедактирования();
	
	НеОбновлятьПриАктивизацииСтроки = Ложь;
	
	ГодВыпуска = Renault_ОбщегоНазначения.ПолучитьГодВыпуска(Автомобиль);	
	Если ГодВыпуска = 0 Тогда
		ГодВыпуска = Год(ТекущаяДата());
	КонецЕсли;
	
	//Козлов Е.А. Начало 02.02.2017
	Если НЕ ЭтоКорпКлиент Тогда
		//РассчитатьСкидкиПоАвтомобилю();
		ПересчитатьСтоимость();
		СуммаСкидки = СписокСкидок.Итог("СуммаСкидки");
		
		ПересчитатьЦенуАвто();
	КонецЕсли;	
	//Козлов Е.А. Конец
	
	// ++ Ковалев ЕС от 23.08.2018
	ДанныеПередачиСтруктура = ЗаполнитьДатыПередачиАвтомобиляПоVIN(Автомобиль);
	РасчетнаяДатаПередачи     = ДанныеПередачиСтруктура.РасчетнаяДатаПередачи;
	ДатаНачалаПередачиАвто	  = ДанныеПередачиСтруктура.ДатаНачалаПередачиАвто;
	ДатаОкончанияПередачиАвто = ДанныеПередачиСтруктура.ДатаОкончанияПередачиАвто;
	// -- Ковалев ЕС от 23.08.2018
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьАвтомобильВКонфигураторСервер(АвтомобильСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.Автомобиль,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.Модель,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.Версия,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.Цвет,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.OPTIONS,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.VIN
	|ИЗ
	|	РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
	|ГДЕ
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.Автомобиль = &Автомобиль";
	Запрос.УстановитьПараметр("Автомобиль", АвтомобильСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	VIN = "";
	Модель = Справочники.Модели.ПустаяСсылка();
	Версия = Справочники.ВариантыКомплектации.ПустаяСсылка();
	Цвет = Справочники.Цвета.ПустаяСсылка();
	
	Если Выборка.Следующий() Тогда
		
		VIN = Выборка.VIN;
		Модель = Выборка.Модель;
		Версия = Выборка.Версия;
		Цвет = Выборка.Цвет;
		
		ОбновитьДОПоАвтомобилю(АвтомобильСсылка);
		
	КонецЕсли;
	
	ОбновитьСписокКонфигураций(Модель);
	ОбновитьСписокЦветов(Модель);
	
	ИндексыСтрок = ПолучитьИндексыСтрокТаблиц(Модель, Версия, Цвет);
	
	Если ИндексыСтрок.ИндексМодель = Неопределено Тогда
		Элементы.ПолеМодель.Видимость = Истина;
	Иначе
		Элементы.ПолеМодель.Видимость = Ложь;
	КонецЕсли;
	
	Если ИндексыСтрок.ИндексВерсия = Неопределено Тогда
		Элементы.ПолеКомплектация.Видимость = Истина;
	Иначе
		Элементы.ПолеКомплектация.Видимость = Ложь;
	КонецЕсли;
	
	Если ИндексыСтрок.ИндексЦвет = Неопределено Тогда
		Элементы.ПолеЦвет.Видимость = Истина;
	Иначе
		Элементы.ПолеЦвет.Видимость = Ложь;
	КонецЕсли;
	
	Возврат ИндексыСтрок;
	
КонецФункции

&НаСервере
Процедура ОбновитьДОПоАвтомобилю(АвтомобильСсылка)
	//Козлов Е.А. Начало 26.01.2017
	НастройкиБазы = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];		
	ТиповойУчетДО = НастройкиБазы.ИспользоватьТиповойУчетДО;
	
	Запрос = Новый Запрос;
	
	Если ТиповойУчетДО Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Renault_ТарифНаОпцииАвтомобилейСрезПоследних.Опция
		|ПОМЕСТИТЬ ВТ_Опции
		|ИЗ
		|	РегистрСведений.Renault_ТарифНаОпцииАвтомобилей.СрезПоследних КАК Renault_ТарифНаОпцииАвтомобилейСрезПоследних
		|ГДЕ
		|	Renault_ТарифНаОпцииАвтомобилейСрезПоследних.ВариантКомплектации = &ВариантКомплектации
		|	И Renault_ТарифНаОпцииАвтомобилейСрезПоследних.Модель = &Модель
		|	И Renault_ТарифНаОпцииАвтомобилейСрезПоследних.Тариф = &Тариф
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КомплектацияАвтомобилейОстатки.Номенклатура,
		|	КомплектацияАвтомобилейОстатки.КоличествоОстаток КАК Количество,
		|	ЦеныСрезПоследних.Цена,
		|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * ЕСТЬNULL(КомплектацияАвтомобилейОстатки.КоличествоОстаток, 0) КАК Сумма
		|ИЗ
		|	РегистрНакопления.КомплектацияАвтомобилей.Остатки(
		|			,
		|			Автомобиль.Ссылка = &Автомобиль
		|				И НЕ Номенклатура В
		|						(ВЫБРАТЬ
		|							ВТ_Опции.Опция
		|						ИЗ
		|							ВТ_Опции КАК ВТ_Опции)) КАК КомплектацияАвтомобилейОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(, ТипЦен = &ТипЦен) КАК ЦеныСрезПоследних
		|		ПО КомплектацияАвтомобилейОстатки.Номенклатура = ЦеныСрезПоследних.Номенклатура";
		Запрос.УстановитьПараметр("Модель", АвтомобильСсылка.Модель);
		Запрос.УстановитьПараметр("ВариантКомплектации", АвтомобильСсылка.ВариантКомплектации);
		Запрос.УстановитьПараметр("Тариф", ТекущийТариф);
		//Запрос.УстановитьПараметр("ТипЦен", ТекДилерскийЦентр.ТипЦенПродажиДО);
		Запрос.УстановитьПараметр("ТипЦен", ТекДилерскийЦентр.ТипЦенДО);
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Renault_УстановленноеОборудованиеАвтомобилейОстатки.Оборудование КАК Номенклатура,
		|	Renault_УстановленноеОборудованиеАвтомобилейОстатки.КоличествоОстаток КАК Количество,
		|	ВЫБОР
		|		КОГДА Renault_УстановленноеОборудованиеАвтомобилейОстатки.КоличествоОстаток = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(Renault_УстановленноеОборудованиеАвтомобилейОстатки.СтоимостьОстаток / Renault_УстановленноеОборудованиеАвтомобилейОстатки.КоличествоОстаток КАК ЧИСЛО(15, 2))
		|	КОНЕЦ КАК Цена,
		|	Renault_УстановленноеОборудованиеАвтомобилейОстатки.СтоимостьОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.Renault_УстановленноеОборудованиеАвтомобилей.Остатки(, Автомобиль = &Автомобиль) КАК Renault_УстановленноеОборудованиеАвтомобилейОстатки";
	КонецЕсли;
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	Renault_ТарифНаОпцииАвтомобилейСрезПоследних.Опция
	//|ПОМЕСТИТЬ ВТ_Опции
	//|ИЗ
	//|	РегистрСведений.Renault_ТарифНаОпцииАвтомобилей.СрезПоследних КАК Renault_ТарифНаОпцииАвтомобилейСрезПоследних
	//|ГДЕ
	//|	Renault_ТарифНаОпцииАвтомобилейСрезПоследних.ВариантКомплектации = &ВариантКомплектации
	//|	И Renault_ТарифНаОпцииАвтомобилейСрезПоследних.Модель = &Модель
	//|	И Renault_ТарифНаОпцииАвтомобилейСрезПоследних.Тариф = &Тариф
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	КомплектацияАвтомобилейОстатки.Номенклатура,
	//|	КомплектацияАвтомобилейОстатки.КоличествоОстаток КАК Количество,
	//|	ЦеныСрезПоследних.Цена,
	//|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * ЕСТЬNULL(КомплектацияАвтомобилейОстатки.КоличествоОстаток, 0) КАК Сумма
	//|ИЗ
	//|	РегистрНакопления.КомплектацияАвтомобилей.Остатки(
	//|			,
	//|			Автомобиль.Ссылка = &Автомобиль
	//|				И НЕ Номенклатура В
	//|						(ВЫБРАТЬ
	//|							ВТ_Опции.Опция
	//|						ИЗ
	//|							ВТ_Опции КАК ВТ_Опции)) КАК КомплектацияАвтомобилейОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(, ТипЦен = &ТипЦен) КАК ЦеныСрезПоследних
	//|		ПО КомплектацияАвтомобилейОстатки.Номенклатура = ЦеныСрезПоследних.Номенклатура"; 	
	Запрос.УстановитьПараметр("Автомобиль", АвтомобильСсылка);
	//Запрос.УстановитьПараметр("Модель", АвтомобильСсылка.Модель);
	//Запрос.УстановитьПараметр("ВариантКомплектации", АвтомобильСсылка.ВариантКомплектации);
	//Запрос.УстановитьПараметр("Тариф", ТекущийТариф);
	//Запрос.УстановитьПараметр("ТипЦен", ТекДилерскийЦентр.ТипЦенПродажиДО);
	//Козлов Е.А. Конец
	
	ВыбранноеОборудование.Загрузить(Запрос.Выполнить().Выгрузить());
	Для каждого Аксессуар из ТекущаяКонфигурация.Аксессуары Цикл
		ЗаполнитьЗначенияСвойств(ВыбранноеОборудование.Добавить(),Аксессуар);
	КонецЦикла; 	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьОпцииИзАвтомобиля(АвтомобильСсылка)
	
	ТаблицаОпцийАвто = Renault_CRM.ПолучитьТаблицуОпцийПоВин(АвтомобильСсылка.VIN, "Ссылка");
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	CRM_СостояниеАвтомобилейПроизводителя_v2.VIN,
	//			   |	CRM_СостояниеАвтомобилейПроизводителя_v2.Автомобиль,
	//			   |	CRM_СостояниеАвтомобилейПроизводителя_v2.OPTIONS
	//			   |ИЗ
	//			   |	РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
	//			   |ГДЕ
	//			   |	CRM_СостояниеАвтомобилейПроизводителя_v2.Автомобиль = &Автомобиль";
	//Запрос.УстановитьПараметр("Автомобиль", АвтомобильСсылка);
	//Выборка = Запрос.Выполнить().Выбрать();
	//Выборка.Следующий(); //Плохо, нет проверки на ошибку
	//
	//МассивПодстрок = CRM_Сервер.РазложитьСтрокуВМассивПодстрок(Выборка.OPTIONS, " ");
	
	Для Каждого Стр Из ВыбранныеНебазовыеОпции Цикл
		Отбор = Новый структура();
		Отбор.Вставить("ОпцияСсылка", Стр.Опция);
		Поиск = ТаблицаОпцийАвто.НайтиСтроки(Отбор);
		Если Поиск.Количество()> 0 Тогда
			Стр.Выбран = Истина;
		Иначе
			Стр.Выбран = Ложь;
		КонецЕсли;
		
		//Если МассивПодстрок.Найти(СокрЛП(Стр.КодОпции)) <> Неопределено Тогда
		//	Стр.Выбран = Истина;
		//Иначе
		//	Стр.Выбран = Ложь;
		//КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьЭлементов()
	
	//Элементы.ГруппаРасчетКредита.Видимость = Кредит;
	//Элементы.ГруппаКоммерческиеПредложенияСостав.Видимость = Не ТекущееКП.Пустая();
	//Элементы.ДобавитьКонфигурациюВКП.Видимость = Не ТекущееКП.Пустая();
	Элементы.СоздатьКП.Видимость = ТекущееКП.Пустая();
	Элементы.ПечатьКП.Видимость = Не ТекущееКП.Пустая();
	Элементы.ПерезаписатьКонфигурацию.Видимость = Не ТекущееКП.Пустая();
	ОбновитьОтображениеГруппПоЗаявкам();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтраницуСоставКП()
	
	Если НЕ Элементы.ГруппаКоммерческиеПредложенияСостав.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	СоставКП.Параметры.УстановитьЗначениеПараметра("Ссылка", ТекущееКП);
	Элементы.СоставКП.Обновить();
	Элементы.СоставКП.ТекущаяСтрока = ТекущаяКонфигурация;
	Элементы.ГруппаКоммерческиеПредложения.ТекущаяСтраница = Элементы.ГруппаКоммерческиеПредложения.ПодчиненныеЭлементы.ГруппаКоммерческиеПредложенияСостав;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеНебазовыеОпцииПриИзменении(Элемент)
	
	ПересчитатьЦенуАвто();
	
КонецПроцедуры

&НаКлиенте
Процедура ТрейдИнСуммаПриИзменении(Элемент)
	
	ПересчитатьЦенуАвто();
	
КонецПроцедуры

&НаКлиенте
Процедура КонфигурацииАвтомобилейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Копирование Тогда Возврат КонецЕсли;
	
	Отказ = Истина;
	
	ЗаписатьКонфигурацию();
	
КонецПроцедуры

&НаКлиенте
Функция ЗаписатьКонфигурацию(КП = Ложь)
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Клиент",					ТекущийКлиент);
	ПараметрыФормы.Вставить("Модель",					Модель);
	ПараметрыФормы.Вставить("Версия",					Версия);
	ПараметрыФормы.Вставить("Цвет",						Цвет);
	ПараметрыФормы.Вставить("ГодВыпуска",				ГодВыпуска);
	ПараметрыФормы.Вставить("VIN",						VIN);
	ПараметрыФормы.Вставить("Автомобиль",				Автомобиль);
	ПараметрыФормы.Вставить("Комментарий",				Комментарий);
	ПараметрыФормы.Вставить("ВыбранныеНебазовыеОпции",	ВыбранныеНебазовыеОпции);
	ПараметрыФормы.Вставить("ВыбранноеОборудование",	ВыбранноеОборудование);
	ПараметрыФормы.Вставить("ВыбранныеАвтоработы",		ВыбранныеАвтоработы);
	ПараметрыФормы.Вставить("ЦенаВерсии",				ЦенаВариантаКомплектации);
	ПараметрыФормы.Вставить("РабочийЛист",				ТекущийРабочийЛист);
	ПараметрыФормы.Вставить("КП",						КП);
	
	// Трейд-ин
	ПараметрыФормы.Вставить("ТрейдИнВерсия",			ТрейдИнВерсия);
	ПараметрыФормы.Вставить("ТрейдИнМодель",			ТрейдИнМодель);
	ПараметрыФормы.Вставить("ТрейдИнМарка",				ТрейдИнМарка);
	ПараметрыФормы.Вставить("ТрейдИнЦвет",				ТрейдИнЦвет);
	ПараметрыФормы.Вставить("ТрейдИнГодВыпуска",		ТрейдИнГодВыпуска);
	ПараметрыФормы.Вставить("ТрейдИнСумма",				ТрейдИнСумма);
	ПараметрыФормы.Вставить("ТрейдИнПробег",			ТрейдИнПробег);
	ПараметрыФормы.Вставить("ТрейдИнКомментарий",		ТрейдИнКомментарий);
	
	// Гарантия
	ПараметрыФормы.Вставить("ГарантияСумма",			ГарантияСумма);
	ПараметрыФормы.Вставить("ПродленнаяГарантия",		ПродленнаяГарантия);
	// Доп. продукты DMSREN-1156
	ПараметрыФормы.Вставить("СервисныеКонтрактыСумма",	СервисныеКонтрактыСумма);
	ПараметрыФормы.Вставить("ПомощьНаДорогахСумма",		ПомощьНаДорогахСумма);

	
	
	// Страховка
	//ПараметрыФормы.Вставить("СтраховкаСумма",			СтраховкаОСАГОСумма);
	//ПараметрыФормы.Вставить("СтраховкаВид",				СтраховкаВид);
	//ПараметрыФормы.Вставить("СтраховкаКомпания",		СтраховкаОСАГОКомпания);
	ПараметрыФормы.Вставить("СтраховкаКомментарий",		СтраховкаКомментарий);
	
	ПараметрыФормы.Вставить("СуммаСкидки", СуммаСкидки);
	ПараметрыФормы.Вставить("СуммаДоставки", СуммаДоставки);
	
	// Кредит
	ПараметрыФормы.Вставить("Банк", Банк);
	ПараметрыФормы.Вставить("СуммаКредита", СуммаКредита);
	ПараметрыФормы.Вставить("СрокКредита", СрокКредита);
	ПараметрыФормы.Вставить("СтавкаБанка", СтавкаБанка);
	ПараметрыФормы.Вставить("ЕжемесячныйПлатеж", ЕжемесячныйПлатеж);
	ПараметрыФормы.Вставить("ПервоначальныйВзносСумма", ПервоначальныйВзносСумма);
	ПараметрыФормы.Вставить("ВключитьПродленнуюГарантиюВКредит",	ВключитьПродленнуюГарантиюВКредит);
	ПараметрыФормы.Вставить("УчитыватьСкидкуПриРасчетеСуммыКредита",	УчитыватьСкидкуПриРасчетеСуммыКредита);
	
	Форма = ПолучитьФорму("Справочник.CRM_КонфигурацииАвтомобилей.Форма.ФормаЭлементаУпр", ПараметрыФормы, ЭтаФорма);
	Форма.Записать();
	Возврат Форма.Объект.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура ВыбранноеОборудованиеПриИзменении(Элемент)
	
	ТекДанные = Элементы.ВыбранноеОборудование.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		
		Если ТекДанные.Количество = 0 Тогда
			ТекДанные.Количество = 1
		КонецЕсли;
		ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена;
		
	КонецЕсли;
	
	ПересчитатьЦенуАвто();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеАвтоработыПриИзменении(Элемент)
	
	ТекДанные = Элементы.ВыбранныеАвтоработы.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		
		Если ТекДанные.Количество = 0 Тогда
			ТекДанные.Количество = 1
		КонецЕсли;
		ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена;
		
	КонецЕсли;
	
	ПересчитатьЦенуАвто();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКонфигурациюВКонфигураторКлиент(Конфигурация)
	
	ИндексыСтрок = ЗагрузитьКонфигурациюВКонфигураторСервер(Конфигурация);
	ОбновитьТаблицыПоДаннымРеквизитов(ИндексыСтрок);
	
	ОбновитьТТХИБазовыеОпции();
	ОбновитьКартинкуМодели();
	ПересчитатьЦенуВариантаКомплектации(); //Плохо. Необходимо устанавливать в соответствии с КП!
	
	ОбновитьСпискиОборудованияАксессуаров(); //Дополнительные опции
	ЗагрузитьОпцииИзКонфигурации(ТекущаяКонфигурация);
	ПриИзмененииВерсииАвтоКлиент();
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьКонфигурациюВКонфигураторСервер(Конфигурация)
	
	Если Конфигурация = Неопределено Тогда
		Если ТекущееКП.Состав.Количество() > 0 Тогда
			Конфигурация = ТекущееКП.Состав[0].Конфигурация;			
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	//Козлов Е.А. Начало 20.01.2017
	ОбновитьСкидкиПоКонфигурации(Конфигурация);
	//Козлов Е.А. Конец
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Конфигурация);
	УстановитьЦенуРОП();
	
	ОбновитьСписокКонфигураций(Модель);
	ОбновитьСписокЦветов(Модель);
	
	ИндексыСтрок = ПолучитьИндексыСтрокТаблиц(Модель, Версия, Цвет);
	
	Возврат ИндексыСтрок;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьОпцииИзКонфигурации(Конфигурация)
	
	Для Каждого Стр Из ВыбранныеНебазовыеОпции Цикл
		
		Если НЕ Конфигурация.Опции.Найти(Стр.Опция, "Опция") = Неопределено Тогда
			Стр.Выбран = Истина;
		Иначе
			Стр.Выбран = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	ВыбранноеОборудование.Загрузить(Конфигурация.Оборудование.Выгрузить());
	ВыбранныеАвтоработы.Загрузить(Конфигурация.Автоработы.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКПНажатие(Команда)
	
	Если ЗначениеЗаполнено(Элементы.СписокКП.ТекущаяСтрока) Тогда
		ТекущееКП = Элементы.СписокКП.ТекущаяСтрока;
	Иначе
		Возврат;
	КонецЕсли;
	
	ЗагрузитьКоммерческоеПредложение(ТекущееКП, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицыПоДаннымРеквизитов(ИндексыСтрок)
	
	Если ИндексыСтрок.ИндексМодель <> Неопределено Тогда
		Элементы.ТаблицаМодели.ТекущаяСтрока = ТаблицаМодели[ИндексыСтрок.ИндексМодель].ПолучитьИдентификатор();
	КонецЕсли;
	
	Если ИндексыСтрок.ИндексВерсия <> Неопределено Тогда
		Элементы.ТаблицаКомплектации.ТекущаяСтрока = ТаблицаКомплектации[ИндексыСтрок.ИндексВерсия].ПолучитьИдентификатор();
	КонецЕсли;
	
	Если ИндексыСтрок.ИндексЦвет <> Неопределено Тогда
		Элементы.ТаблицаЦвета.ТекущаяСтрока = ТаблицаЦвета[ИндексыСтрок.ИндексЦвет].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИндексыСтрокТаблиц(Модель, Версия, Цвет)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Модель", Модель);
	Строки = ТаблицаМодели.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество() > 0 Тогда
		ИндексМодель = ТаблицаМодели.Индекс(Строки[0]);
	Иначе
		ИндексМодель = Неопределено;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Ссылка", Версия);
	Строки = ТаблицаКомплектации.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество() > 0 Тогда
		ИндексВерсия = ТаблицаКомплектации.Индекс(Строки[0]);
	Иначе
		ИндексВерсия = Неопределено;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Цвет", Цвет);
	Строки = ТаблицаЦвета.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество() > 0 Тогда
		ИндексЦвет = ТаблицаЦвета.Индекс(Строки[0]);
	Иначе
		ИндексЦвет = Неопределено;
	КонецЕсли;
	
	Ответ = Новый Структура;
	Ответ.Вставить("ИндексМодель", ИндексМодель);
	Ответ.Вставить("ИндексВерсия", ИндексВерсия);
	Ответ.Вставить("ИндексЦвет", ИндексЦвет);
	
	Возврат Ответ;
	
КонецФункции

&НаКлиенте
Процедура КонфигурацияДобавитьВКПНажатие(Команда)
	
	//Если Не ЗначениеЗаполнено(Версия) ИЛИ Не ЗначениеЗаполнено(Цвет) Тогда
	//	Предупреждение("Не указана версия или цвет автомобиля");
	//	Возврат;
	//КонецЕсли;
	//
	//НеОбновлятьПриАктивизацииСтроки = Истина;
	//
	//ТекущаяКонфигурация = ЗаписатьКонфигурацию(Истина);
	//
	//Если ЗначениеЗаполнено(ТекущаяКонфигурация) Тогда		
	//	ДобавитьКП(ТекущаяКонфигурация);
	//	ОткрытьСтраницуСоставКП();
	//КонецЕсли;
	//
	//НеОбновлятьПриАктивизацииСтроки = Ложь;
	//ОбновитьОтображениеГруппПоЗаявкам();
	//Оповестить("ОбновитьРабочийЛист");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКП(Конфигурация,ТипКП)
	
	Если НЕ ЗначениеЗаполнено(ТекущееКП) Тогда
		ОбКП = Документы.CRM_КоммерческоеПредложение.СоздатьДокумент();
		ОбКП.Дата			= ТекущаяДата();
		ОбКП.СрокДействия   = СрокДействия;
		ОбКП.ДатаНачалаПередачиАвто    = ДатаНачалаПередачиАвто;
		ОбКП.ДатаОкончанияПередачиАвто = ДатаОкончанияПередачиАвто;
		ОбКП.Автор			= ПараметрыСеанса.Пользователь;
		ОбКП.Клиент			= ТекущийКлиент;
		обКП.МенеджерОбслуживания = ПолучитьМенеджераОбслуживания(ТекущийКлиент);
		ОбКП.ТрейдИн 		= ЭтоТрейдИН;
		ОбКП.РабочийЛист	= ТекущийРабочийЛист;
		ОбКП.ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
		ОбКП.ЗаявкаНаТрейдИн = ЗаявкаНаТрейдИн;
		обКП.ИнтересовалсяТрейдИн = ИнтересовалсяТрейдИн;
		ОбКП.ЗаявкаНаГарантию = СоздатьНайтиЗаявкуНаГарантию();
		СоздатьНайтиЗаявкуНаОборудование(ОбКП);
		обКП.ИнтересовалсяКредитом = ИнтересовалсяКредитом;
		обКП.ИнтересовалсяОборудованием = ИнтересовалсяОборудованием;
		обКП.ТипКП=ТипКП;
		ОбКП.Renaut_ЦенаРОП = ?(УстановитьРасчетнуюПоЦенеРоп И ЦенаРОП <> 0, ЦенаРОП, 0);
		ОбКП.Записать();
		
		ТекущееКП = ОбКП.Ссылка;
		
	Иначе
		
		ОбКП = ТекущееКП.ПолучитьОбъект();
		
	КонецЕсли;
	
	СтрКонф = ОбКП.Состав.Добавить();
	СтрКонф.Конфигурация = Конфигурация;
	СтрКонф.Сумма = ЦенаИТОГО;
	СтрКонф.СуммаДоставки = СуммаДоставки;
	СтрКонф.СуммаСкидки = СуммаСкидки;
	
	НомерКП = ОбКП.Номер;
	ДатаКП = ОбКП.Дата;
	
	// КовалевЕС от 30.05.19 {
	ОбКП.ВычетПоТрейдИн = ТрейдИнСумма;
	// КовалевЕС от 30.05.19 } 
	
	ОбКП.Сумма = ОбКП.Состав.Итог("Сумма");
	обКП.ЗаявканаТрейдИн = ЗаявкаНаТрейдИн;
	обКП.ИнтересовалсяТрейдИн = ИнтересовалсяТрейдИн;
	обКП.ИнтересовалсяКредитом = ИнтересовалсяКредитом;
	ОбКП.интересовалсяСтраховкой = ИнтересовалсяСтраховкой;
	обКП.ИнтересовалсяОборудованием = ИнтересовалсяОборудованием;
	обКП.ИнтересовалсяУтилизацией = ИнтересовалсяУтилизацией;
	
	ТабСкидкиОбКП = ОбКП.СкидкиКонфигурации;	
	
	УИДКонфигурации = Строка(Конфигурация.УникальныйИдентификатор());
	Отбор = Новый Структура("ИдентификаторКонфигурации", УИДКонфигурации);
	НайденныеСтрокиСкидок = ТабСкидкиОбКП.НайтиСтроки(Отбор);
	
	Для Каждого Эл Из НайденныеСтрокиСкидок Цикл
		ТабСкидкиОбКП.Удалить(Эл);	
	КонецЦикла;
	
	Для Каждого Эл Из СписокСкидок Цикл
		Стр = ТабСкидкиОбКП.Добавить();
		Стр.ИдентификаторКонфигурации = УИДКонфигурации;
		ЗаполнитьЗначенияСвойств(Стр, Эл);
	КонецЦикла;		
	ОбКП.Renaut_ЦенаРОП = ?(УстановитьРасчетнуюПоЦенеРоп И ЦенаРОП <> 0, ЦенаРОП, 0);
	
	Если ИнтересовалсяСтраховкой Тогда
		
		//Если Не ЗначениеЗаполнено(Возраст) Тогда
		//	Предупреждение("Не заполнен возраст водителя");
		//	Возврат;
		//КонецЕсли;
		//Если Не ЗначениеЗаполнено(СтажВождения) Тогда
		//	Предупреждение("Не заполнен стаж вождения");
		//	Возврат;
		//КонецЕсли;
		//ОбработатьВвозСтраховой();
		СтруктураПолисы = СохранитьСтраховыеПолисы();
		ОбКП.ПолисОСАГО = СтруктураПолисы.ПолисОСАГО;
		ОбКП.ПолисКАСКО = СтруктураПолисы.ПолисКАСКО;
		ОбКП.Возраст = Возраст;
		ОбКП.СтажВождения = СтажВождения;
		
	КонецЕсли;
	
	ОбКП.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

&НаКлиенте
Процедура БазовыеОпцииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКонфигурациюИзКПНажатие(Команда)
	
	//НеОбновлятьПриАктивизацииСтроки = Истина;
	//
	//Если Элементы.СоставКП.ТекущиеДанные <> Неопределено Тогда
	//	
	//	ТекущаяКонфигурация = Элементы.СоставКП.ТекущиеДанные.Конфигурация;
	//	ЗагрузитьКонфигурациюВКонфигураторКлиент(ТекущаяКонфигурация);
	//	
	//КонецЕсли;
	//
	//НеОбновлятьПриАктивизацииСтроки = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКонфигурациюИзКПНажатие(Команда)
	
	Если Элементы.СоставКП.ТекущиеДанные <> Неопределено Тогда
		
		Если ОсталасьОднаКонфигурация() Тогда
			Предупреждение("В коммерческом предложении должна быть хотя бы одна конфигурация!");
			Возврат;
		КонецЕсли;
		
		УдалитьКонфигурацию(Элементы.СоставКП.ТекущиеДанные.Конфигурация);
		Элементы.СоставКП.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОсталасьОднаКонфигурация()
	
	КПОбъект = ТекущееКП.ПолучитьОбъект();
	Возврат КПОбъект.Состав.Количество() = 1;
	
КонецФункции

&НаСервере
Процедура УдалитьКонфигурацию(Конфигурация)
	
	ОбКП = ТекущееКП.ПолучитьОбъект();
	Строки = ОбКП.Состав.НайтиСтроки(Новый Структура("Конфигурация", Конфигурация));
	Для Каждого Стр Из Строки Цикл
		ОбКП.Состав.Удалить(Стр);
	КонецЦикла;
	
	ОбКП.Сумма = ОбКП.Состав.Итог("Сумма");
	
	ОбКП.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКПВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//Если НЕ Неопределено = Элементы.СоставКП.ТекущиеДанные Тогда
	//	ОткрытьЗначение(Элементы.СоставКП.ТекущиеДанные.Конфигурация);
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКП1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если НЕ Неопределено = Элементы.СоставКП.ТекущиеДанные Тогда
		ОткрытьЗначение(Элементы.СоставКП1.ТекущиеДанные.Конфигурация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьДополнительнуюИнформациюВКонфигураторе()
	
	Элементы.ГруппаКонфигурацияСкладКП.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура VINОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Обработка.CRM_РабочийСтол.Форма.ФормаОстаткиАвтомобилей", Новый Структура("Модель, Версия", Модель, Версия), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТекущееКПНажатие(Команда)
	
	Если ЗначениеЗаполнено(ТекущееКП) Тогда
		ОткрытьЗначение(ТекущееКП);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КредитПриИзменении(Элемент)
	
	//Элементы.ГруппаРасчетКредита.Видимость = Кредит;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаСтраховкиПриИзменении(Элемент)
	
	ПересчитатьЦенуАвто();
	
КонецПроцедуры

&НаКлиенте
Процедура КредитнаяПрограммаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(КредитнаяПрограмма) Тогда
		
		СтараяПГ = ПродленнаяГарантия;
		ОбновитьДанныеКредита();
		Если ПродленнаяГарантия <> СтараяПГ Тогда
			Предупреждение("Выбрана бесплатная продлённая гарантия: " + Строка(ПродленнаяГарантия), 30);
			ПересчитатьЦенуАвто();
		КонецЕсли;
		ПересчитатьКредит();
		Элементы.ДопустимыеСрокиКредита.Заголовок = "(" + Строка(МинимальныйСрокКредита) + " - " + Строка(МаксимальныйСрокКредита) + " мес.)";
		//Элементы.ДекорацияПроцент.Заголовок = "% (" + Строка(МинимальныйПервоначальныйВзнос) + " - " + Строка(МаксимальныйПервоначальныйВзнос) + " %)";
		
	Иначе
		
		Элементы.ДопустимыеСрокиКредита.Заголовок = "";
		//Элементы.ДекорацияПроцент.Заголовок = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеКредита()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КредитнаяПрограмма", КредитнаяПрограмма);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	CRM_ПараметрыКредитныхПрограмм.МинимальныйСрокКредита,
	|	CRM_ПараметрыКредитныхПрограмм.МаксимальныйСрокКредита,
	|	CRM_ПараметрыКредитныхПрограмм.МинимальныйПервоначальныйВзнос,
	|	CRM_ПараметрыКредитныхПрограмм.МаксимальныйПервоначальныйВзнос,
	|	CRM_ПараметрыКредитныхПрограмм.СтавкаБанка,
	|	CRM_ПараметрыКредитныхПрограмм.МаркетинговаяСтавка
	|ИЗ
	|	РегистрСведений.CRM_ПараметрыКредитныхПрограмм КАК CRM_ПараметрыКредитныхПрограмм
	|ГДЕ
	|	CRM_ПараметрыКредитныхПрограмм.КредитнаяПрограмма = &КредитнаяПрограмма";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		МинимальныйСрокКредита 				= Выборка.МинимальныйСрокКредита;
		МаксимальныйСрокКредита 			= Выборка.МаксимальныйСрокКредита;
		МинимальныйПервоначальныйВзнос 		= Выборка.МинимальныйПервоначальныйВзнос;
		МаксимальныйПервоначальныйВзнос 	= Выборка.МаксимальныйПервоначальныйВзнос;
		СтавкаБанка 						= Выборка.СтавкаБанка;
		МаркетинговаяСтавка 				= Выборка.МаркетинговаяСтавка;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Модель", Модель);
	Запрос.УстановитьПараметр("Версия", Версия);
	Запрос.УстановитьПараметр("ГодПроизводства", ГодВыпуска);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(CRM_СтоимостьПродленнойГарантии.ПредложениеПГ, ЗНАЧЕНИЕ(Справочник.CRM_ПредложенияПродленнойГарантии.ПустаяСсылка)) КАК ПГ,
	|	ЕСТЬNULL(CRM_СтоимостьПродленнойГарантии.Сумма, 0) КАК Сумма
	|ИЗ
	|	РегистрСведений.CRM_ПрименениеКредитныхПрограмм КАК CRM_ПрименениеКредитныхПрограмм
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СтоимостьПродленнойГарантии КАК CRM_СтоимостьПродленнойГарантии
	|		ПО CRM_ПрименениеКредитныхПрограмм.ПГВПодарок = CRM_СтоимостьПродленнойГарантии.ПредложениеПГ
	|			И CRM_ПрименениеКредитныхПрограмм.Модель = CRM_СтоимостьПродленнойГарантии.Модель
	|ГДЕ
	|	CRM_ПрименениеКредитныхПрограмм.Модель = &Модель
	|	И CRM_ПрименениеКредитныхПрограмм.Версия = &Версия
	|	И CRM_ПрименениеКредитныхПрограмм.ГодПроизводства = &ГодПроизводства
	|	И CRM_ПрименениеКредитныхПрограмм.КредитнаяПрограмма = &КредитнаяПрограмма";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ГарантияСумма < Выборка.Сумма Тогда
			ПродленнаяГарантия = Выборка.ПГ;
			ГарантияСумма = Выборка.Сумма;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьКредит()
	
	Если ЗначениеЗаполнено(СтавкаБанка) И ЗначениеЗаполнено(СрокКредита) Тогда
		Для Каждого Строка ИЗ ВыбранноеОборудование Цикл
			Строка.СуммаВКредит = РассчитатьПлатеж(СтавкаБанка, Строка.Сумма, СрокКредита);
		КонецЦикла;
	КонецЕсли;
	
	ПервоначальныйВзносСумма = (ПервоначальныйВзносПроцент/100) * (ЦенаВариантаКомплектации + СуммаДоставки + ЦенаДопОпций) - ?(ИнтересовалсяТрейдИн, ТрейдИнСумма, 0);
	Если (ПервоначальныйВзносПроцент/100) * (ЦенаВариантаКомплектации + СуммаДоставки + ЦенаДопОпций) - ?(ИнтересовалсяТрейдИн, ТрейдИнСумма, 0) < 0 Тогда
		Если (ЦенаВариантаКомплектации + СуммаДоставки + ЦенаДопОпций) = 0 Тогда
			
			ПервоначальныйВзносПроцент = 0;
			
		Иначе
			
			ПервоначальныйВзносПроцент = ?(ИнтересовалсяТрейдИн, ТрейдИнСумма, 0) / (ЦенаВариантаКомплектации + СуммаДоставки + ЦенаДопОпций) * 100;
			
		КонецЕсли;
		
	КонецЕсли;
	ПервоначальныйВзносСуммаИтого = ПервоначальныйВзносСумма + ?(ИнтересовалсяТрейдИн, ТрейдИнСумма, 0);
	СуммаКредита = (ЦенаВариантаКомплектации + СуммаДоставки + ЦенаДопОпций + СуммаДопОпцийСумма + ?(ИнтересовалсяТрейдИн, ТрейдИнРефинансирование, 0)) - ПервоначальныйВзносСуммаИтого + (?((КАСКОВКредит И СтраховкаКАСКОВключать И ИнтересовалсяСтраховкой), СтраховкаКАСКОСумма, 0)) + ?(ПГВКредит, ГарантияСумма, 0);
	
	Если ЗначениеЗаполнено(КредитноеПредложение) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаркетинговаяСтавка,
		|	БанковскаяСтавка СтавкаБанка
		|ИЗ Справочник.Renault_КредитныеПредложения.КредитныеСтавки
		|ГДЕ Ссылка=&Ссылка
		|	И ПервоначальныйВзносОт<=&ПервоначальныйВзносПроцент
		|	И ПервоначальныйВзносДо >= &ПервоначальныйВзносПроцент
		|	И СрокКредитаОт <= &СрокКредита
		|	И СрокКредитаДо >= &СрокКредита";
		Запрос.УстановитьПараметр("Ссылка", КредитноеПредложение);
		Запрос.УстановитьПараметр("ПервоначальныйВзносПроцент", ПервоначальныйВзносПроцент);
		Запрос.УстановитьПараметр("СрокКредита", СрокКредита);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			МаркетинговаяСтавка = Выборка.МаркетинговаяСтавка;
			СтавкаБанка = Выборка.СтавкаБанка;
			
			Если ИспользуетсяРазумноеКАСКО Тогда
				МаркетинговаяСтавка = МаркетинговаяСтавка - КредитноеПредложение.СубсидияПоСтавке;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Если СрокКредита <> 0 Тогда
		
		Если СтавкаБанка <> 0 Тогда
			
			//ИсходнаяСуммаКредита = СуммаКредита - ПервоначальныйВзносСумма;
			ЦенаАвтомобиляДляРасчетаСубсидии = ЦенаВариантаКомплектации + СуммаДоставки + ГарантияСумма + СуммаДопОпцийСумма + ЦенаДопОпций + ЦенаОборудования + ЦенаАксессуаров;
			ИсходнаяСуммаКредита = ЦенаАвтомобиляДляРасчетаСубсидии - ПервоначальныйВзносСуммаИтого;
			
			Если МаркетинговаяСтавка = 0 Тогда
				СубсидияПоКредитнойПрограмме = ИсходнаяСуммаКредита * (1-(1/СрокКредита)*(Pow((1+СтавкаБанка/1200), СрокКредита)-1)/((СтавкаБанка/1200)*Pow((1+СтавкаБанка/1200), СрокКредита)));
			Иначе
				СубсидияПоКредитнойПрограмме = ИсходнаяСуммаКредита * (1-(МаркетинговаяСтавка/СтавкаБанка)*Pow(((1+МаркетинговаяСтавка/1200)/(1+СтавкаБанка/1200)),СрокКредита)*((Pow(1+СтавкаБанка/1200, СрокКредита)-1)/(Pow(1+МаркетинговаяСтавка/1200, СрокКредита)-1)));
			КонецЕсли;
			
			ЦенаАвтомобиляПослеСубсидирования = ЦенаАвтомобиляДляРасчетаСубсидии - СубсидияПоКредитнойПрограмме - ГарантияСуммаДляКлиента;
			
			Если ДопОборудованиеВКредит Тогда
				СтоимостьДопОборудованияВКредит = ЦенаДопОпций + ЦенаОборудования + ЦенаАксессуаров;
			Иначе
				СтоимостьДопОборудованияВКредит =  0;
			КонецЕсли;
			
			ЦенаАвтомобиляИтоговая = ЦенаАвтомобиляПослеСубсидирования + СтоимостьДопОборудованияВКредит + ГарантияСумма;
			
			//СуммаКредитаИтоговая = ИсходнаяСуммаКредита + (?(КАСКОВКредит И СтраховкаКАСКОВключать И ИнтересовалсяСтраховкой, СтраховкаКАСКОСумма, 0));
			
			СуммаКредитаПослеСубсидирования = ИсходнаяСуммаКредита - СубсидияПоКредитнойПрограмме - ГарантияСуммаДляКлиента + ГарантияСумма;
			Если ВключитьЗащитуКредита Тогда
				СуммаЗащитыКредита = СуммаКредитаПослеСубсидирования*СтавкаЗащитыКредита/100*СрокКредита + ФиксированнаяЧастьЗащитыКредита*(1+СтавкаЗащитыКредита/100*СрокКредита);
			Иначе
				СуммаЗащитыКредита = 0;
			КонецЕсли;
			СуммаКредита = СуммаКредита + СуммаЗащитыКредита;
			СуммаКредитаИтоговая = СуммаКредитаПослеСубсидирования + СуммаЗащитыКредита;
			
			СуммаКредитаИтоговая = СуммаКредитаИтоговая + (?(КАСКОВКредит И СтраховкаКАСКОВключать И ИнтересовалсяСтраховкой, СтраховкаКАСКОСумма, 0)) + ?(ПГВКредит, ГарантияСумма, 0) + ?(ИнтересовалсяТрейдИн, ТрейдИнРефинансирование, 0);
			
			ЕжемесячныйПлатеж = РассчитатьПлатеж(СтавкаБанка, СуммаКредитаИтоговая, СрокКредита);
			
		Иначе
			
			ЕжемесячныйПлатеж = СуммаКредита / СрокКредита;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СрокКредитаПриИзменении(Элемент)
	
	Проверка = ПроверитьПоПрограмме();
	Если Проверка = Ложь Тогда
		Ответ = ПолучитьДоступныеЗначения(, (СрокКредита*12));
		Если Ответ.Количество() = 0 Тогда
			//ПервоначальныйВзносПроцент = (ПервоначальныйВзносСумма / СуммаКредита) * 100;
			Предупреждение("Значение не подходит по кредитной программе.");
			СрокКредита = КредитноеПредложение.СрокПоУмолчанию / 12;
			НеобходимоСменитьКредитнуюПрограмму = Истина;
		Иначе
			Если Ответ.Количество() = 1 Тогда
				Строка = Ответ[0];
			Иначе
				Строка = Ответ.ВыбратьСтроку("Выберите подходящее условие");
				//СрокКредита = Строка.МаксСрок;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ПересчитатьКредит();
	ОбновитьНадписьСубсидии();
	
КонецПроцедуры

&НаКлиенте
Процедура ПервоначальныйВзносПроцентПриИзменении(Элемент)
	
	Проверка = ПроверитьПоПрограмме();
	Если Проверка = Ложь Тогда
		Ответ = ПолучитьДоступныеЗначения(ПервоначальныйВзносПроцент);
		Если Ответ.Количество() = 0 Тогда
			//ПервоначальныйВзносПроцент = (ПервоначальныйВзносСумма / СуммаКредита) * 100;
			Предупреждение("Значение не подходит по кредитной программе.");
			ПервоначальныйВзносПроцент = КредитноеПредложение.ПервоначальныйВзносПоУмолчанию;
			НеобходимоСменитьКредитнуюПрограмму = Истина;
		Иначе
			Если Ответ.Количество() = 1 Тогда
				Строка = Ответ[0];
			Иначе
				Строка = Ответ.ВыбратьСтроку("Выберите подходящее условие");
				СрокКредита = Строка.МаксСрок / 12;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ПервоначальныйВзносСумма = СуммаКредита * ПервоначальныйВзносПроцент / 100;
	ПересчитатьКредит();
	
КонецПроцедуры

&НаСервере
Функция ПроверитьПоПрограмме()
	
	Результат = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БанковскаяСтавка Ставка_Банк
	|ИЗ Справочник.Renault_КредитныеПредложения.КредитныеСтавки
	|ГДЕ Ссылка=&Ссылка
	|	И СрокКредитаОт <= &СрокКредита
	|	И СрокКредитаДо >= &СрокКредита
	|	И ПервоначальныйВзносОт <= &ПервоначальныйВзносПроцент
	|	И ПервоначальныйВзносДо >= &ПервоначальныйВзносПроцент
	|	И МаркетинговаяСтавка <= &МаркетинговаяСтавка";
	Запрос.УстановитьПараметр("Ссылка", КредитноеПредложение);
	Запрос.УстановитьПараметр("ПервоначальныйВзносПроцент", ПервоначальныйВзносПроцент);
	Запрос.УстановитьПараметр("СрокКредита", СрокКредита);
	Запрос.УстановитьПараметр("МаркетинговаяСтавка", МаркетинговаяСтавка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьНадписьСубсидии()
	
	Если СубсидияПоКредитнойПрограмме <> 0 Тогда
		Элементы.ДекорацияСубсидияПоКредитнойПрограмме.Заголовок = "Субсидия по кредитной программе: " + СубсидияПоКредитнойПрограмме + " руб.";
	Иначе
		Элементы.ДекорацияСубсидияПоКредитнойПрограмме.Заголовок = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПервоначальныйВзносСуммаПриИзменении(Элемент)
	
	ПервоначальныйВзносПроцент = ПервоначальныйВзносСумма / СуммаКредита * 100;
	Проверка = ПроверитьПоПрограмме();
	Если Проверка = Ложь Тогда
		Ответ = ПолучитьДоступныеЗначения(ПервоначальныйВзносПроцент);
		Если Ответ.Количество() = 0 Тогда
			Предупреждение("Значение не подходит по кредитной программе.");
			НеобходимоСменитьКредитнуюПрограмму = Истина;
		Иначе
			Если Ответ.Количество() = 1 Тогда
				Строка = Ответ[0];
			Иначе
				Строка = Ответ.ВыбратьСтроку("Выберите подходящее условие");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ПересчитатьКредит();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрограммаЗащитыКредитаПриИзменении(Элемент)
	
	ЗаполнитьПараметрыЗащитыКредита();
	ПересчитатьКредит();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыЗащитыКредита()
	
	Если ЗначениеЗаполнено(ПрограммаЗащитыКредита) Тогда
		СтавкаЗащитыКредита = ПрограммаЗащитыКредита.Ставка;
		ФиксированнаяЧастьЗащитыКредита = ПрограммаЗащитыКредита.Фикс;
	Иначе
		СтавкаЗащитыКредита = 0;
		ФиксированнаяЧастьЗащитыКредита = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродленнаяГарантияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ФормаПараметры = Новый Структура;
	ФормаПараметры.Вставить("РежимВыбора", Истина);
	ФормаПараметры.Вставить("UsedCar", ЭтоТрейдИН);
	ФормаПараметры.Вставить("Модель", Модель);
	ФормаПараметры.Вставить("Владелец", Справочники.Renault_КредитныеПредложения.РНБанк());
	Форма = ПолучитьФорму("Справочник.DMS_ФинансовыеУслуги.Форма.ФормаСписка", ФормаПараметры, ЭтаФорма);	
	
	Ответ = Форма.ОткрытьМодально();
	Если ЗначениеЗаполнено(Ответ) Тогда
		ПродленнаяГарантия = Ответ;
	КонецЕсли;
	
	ПродленнаяГарантияПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "РегистрСведений.CRM_СтоимостьПродленнойГарантии.Форма.ФормаВыбораУпр" Тогда
		ПродленнаяГарантия = ВыбранноеЗначение.ПГ;
		ГарантияСумма = ВыбранноеЗначение.Сумма;
	КонецЕсли;
	ПересчитатьЦенуАвто();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродленнаяГарантияОчистка(Элемент, СтандартнаяОбработка)
	
	ГарантияСумма = 0;
	ЗаявкаНаГарантию = Документы.Renault_CRM_ЗаявкаНаГарантию.ПустаяСсылка();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКП(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура ОпцииДилераДобавитьИзСправочника(Команда)
	
	НоваяОпция = Справочники.Номенклатура.ПолучитьФормуВыбора().ОткрытьМодально();
	
	Если ЗначениеЗаполнено(НоваяОпция) И Не НоваяОпция.ЭтоГруппа Тогда
		
		//Проверим наличие данной опции в списке
		Отбор = Новый Структура("Номенклатура", НоваяОпция);
		МассивСтрок = ВыбранноеОборудование.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() > 0 Тогда
			//Данная строка уже есть в списке, увеличим количество
			НовСтрока = МассивСтрок[0];
			НовСтрока.Количество = НовСтрока.Количество + 1;
		Иначе
			
			//Добавим в список
			НовСтрока = ВыбранноеОборудование.Добавить();
			НовСтрока.Номенклатура = НоваяОпция;
			НовСтрока.Количество = 1;
			
			//Подставим цену //Доделать
			//На текущий момент подставляется чистая цена из регистра, без учета скидок
			//Вопрос автоматических скидок необходимо проработать
			//Renault Е.А. 
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ТипЦен", ТипЦенКП);
			Запрос.УстановитьПараметр("Номенклатура", НоваяОпция);
			Запрос.Текст = "ВЫБРАТЬ
			|	ЦеныСрезПоследних.Цена
			|ИЗ
			|	РегистрСведений.Цены.СрезПоследних(
			|			,
			|			ТипЦен = &ТипЦен
			|				И Номенклатура = &Номенклатура) КАК ЦеныСрезПоследних";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				НовСтрока.Цена = Выборка.Цена;
			КонецЕсли;
			
		КонецЕсли;
		
		//Расчитаем сумму строки
		НовСтрока.Сумма = НовСтрока.Цена * НовСтрока.Количество;
		
		ПересчитатьЦенуАвто();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОпцииДилераДобавитьПроизвольные(Команда)
	
	Перем НоваяОпция;
	Перем ЦенаОпции;
	
	Если ВвестиСтроку(НоваяОпция, "Введите название опции", 100, Ложь) Тогда
		
		Если ВвестиЧисло(ЦенаОпции, "Введите цену опции", 10, 2) Тогда
			
			//Добавим в список
			НовСтрока = ВыбранноеОборудование.Добавить();
			НовСтрока.Номенклатура = НоваяОпция;
			НовСтрока.Количество = 1;
			НовСтрока.Цена = ЦенаОпции;
			НовСтрока.Сумма = ЦенаОпции;
			
		КонецЕсли;
		
		//Расчитаем сумму строки
		
		ПересчитатьЦенуАвто();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоработыДобавитьИзСправочника(Команда)
	
	НоваяОпция = Справочники.Автоработы.ПолучитьФормуВыбора().ОткрытьМодально();
	
	Если ЗначениеЗаполнено(НоваяОпция) Тогда
		
		//Проверим наличие данной опции в списке
		Отбор = Новый Структура("Номенклатура", НоваяОпция);
		МассивСтрок = ВыбранноеОборудование.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() > 0 Тогда
			//Данная строка уже есть в списке, увеличим количество
			НовСтрока = МассивСтрок[0];
			НовСтрока.Количество = НовСтрока.Количество + 1;
		Иначе
			
			//Добавим в список
			НовСтрока = ВыбранноеОборудование.Добавить();
			НовСтрока.Номенклатура = НоваяОпция;
			НовСтрока.Количество = 1;
			
			//Подставим цену //Доделать
			//На текущий момент подставляется чистая цена из регистра, без учета скидок
			//Вопрос автоматических скидок необходимо проработать
			//Renault Е.А. 
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ТипЦен", ТипЦенКП);
			Запрос.УстановитьПараметр("Авторабота", НоваяОпция);
			Запрос.Текст = "ВЫБРАТЬ
			|	ЦеныАвтоработСрезПоследних.Цена
			|ИЗ
			|	РегистрСведений.ЦеныАвторабот.СрезПоследних(
			|			,
			|			Авторабота = &Авторабота) КАК ЦеныАвтоработСрезПоследних";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				НовСтрока.Цена = Выборка.Цена;
			КонецЕсли;
			
		КонецЕсли;
		
		//Расчитаем сумму строки
		НовСтрока.Сумма = НовСтрока.Цена * НовСтрока.Количество;
		
		ПересчитатьЦенуАвто();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоработыДобавитьПроизвольные(Команда)
	
	Перем НоваяОпция;
	Перем ЦенаОпции;
	
	Если ВвестиСтроку(НоваяОпция, "Введите название автоработы", 100, Ложь) Тогда
		
		Если ВвестиЧисло(ЦенаОпции, "Введите цену автоработы", 10, 2) Тогда
			
			//Добавим в список
			НовСтрока = ВыбранныеАвтоработы.Добавить();
			НовСтрока.Номенклатура = НоваяОпция;
			НовСтрока.Количество = 1;
			НовСтрока.Цена = ЦенаОпции;
			НовСтрока.Сумма = ЦенаОпции;
			
		КонецЕсли;
		
		//Расчитаем сумму строки
		
		ПересчитатьЦенуАвто();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоработыУдалить(Команда)
	
	ТекСтрока = Элементы.ВыбранноеОборудование.ТекущаяСтрока;
	
	Если ТекСтрока <> Неопределено Тогда
		ВыбранныеАвтоработы.Удалить(ТекСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОпцииДилераУдалить(Команда)
	
	ТекущаяСтрока = ВыбранноеОборудование.Индекс(Элементы.ВыбранноеОборудование.ТекущиеДанные);
	ВыбранноеОборудование.Удалить(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОсновноеКПНажатие(Команда)
	
	Если ЗначениеЗаполнено(Элементы.СписокКП.ТекущаяСтрока) Тогда
		УстановитьКПОсновным(Элементы.СписокКП.ТекущаяСтрока);
	Иначе
		Возврат;
	КонецЕсли;
	Элементы.СписокКП.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКПОсновным(КПСсылка)
	
	УстановитьКПОсновнымСервер(КПСсылка);
	Элементы.СписокКП.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКПОсновнымСервер(КПСсылка)
	//+/Блинков// Реализовано в рамках заявки  DMSREN-742 
	Если ЗначениеЗаполнено(КПСсылка.РабочийЛист) и ЗначениеЗаполнено(КПСсылка.ДилерскийЦентр) Тогда 
		ЗаписьРС = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
		ЗаписьРС.IDK = КПСсылка.РабочийЛист;
		ЗаписьРС.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.КоммерческоеПредложение;
		ЗаписьРС.ДилерскийЦентр = КПСсылка.ДилерскийЦентр;
		ЗаписьРС.Объект = КПСсылка;
		ЗаписьРС.ДатаВыполнения = КПСсылка.Дата;
		ЗаписьРС.Записать(Истина);
	КонецЕсли;
	//-/Блинков// Реализовано в рамках заявки  DMSREN-742 

КонецПроцедуры

&НаКлиенте
Процедура УстановкаСкидокНажатие(Команда)
	////Козлов Е.А. Начало 23.01.2017
	//РассчитатьСкидкиПоАвтомобилю();
	////Козлов Е.А. Конец
	ПересчитатьСтоимость();
	
	ФормаСкидок = ПолучитьФорму("Обработка.CRM_АРМ_Конфигуратор.Форма.ФормаУстановкиСкидок");
	СуммаОбщ = 	ЦенаВариантаКомплектации + ЦенаДопОпций - ЦенаВыкупа + ЦенаОборудования + ЦенаАвторабот + СтраховкаОСАГОСумма + СтраховкаКАСКОСумма + ГарантияСумма;
	ФормаСкидок.СуммаКонфигурации = СуммаОбщ;
	ФормаСкидок.СуммаСкидки = СуммаСкидки;
	ФормаСкидок.СуммаДоставки = СуммаДоставки;
	ФормаСкидок.СуммаКонечная = ЦенаИтого;
	ФормаСкидок.Модель = Модель;
	ФормаСкидок.Версия = Версия;
	ФормаСкидок.Автомобиль = Автомобиль;
	ФормаСкидок.ДилерскийЦентр = ТекДилерскийЦентр;
	ФормаСкидок.Кредит = ИнтересовалсяКредитом;
	ФормаСкидок.TradeIn = ИнтересовалсяТрейдИн;
	ФормаСкидок.Утилизация = ИнтересовалсяУтилизацией;
	ЗадачиОФУ=ЗадачиОФУ();
	СуществуетКредит=СоздатьЗадачу_ОФУ_Кредит ИЛИ ЗадачиОФУ.НайтиСтроки(Новый Структура("ВидСобытия",Справочники.CRM_ВидыСобытий.Кредит)).Количество()>0;
	СуществуетЛизинг=СоздатьЗадачу_ОФУ_Лизинг ИЛИ ЗадачиОФУ.НайтиСтроки(Новый Структура("ВидСобытия",Справочники.CRM_ВидыСобытий.Лизинг)).Количество()>0;
	
	Если СуществуетКредит Тогда ФормаСкидок.СпособОплаты = Перечисления.Renault_СпособыОплаты.Кредит
	ИначеЕсли СуществуетЛизинг Тогда ФормаСкидок.СпособОплаты = Перечисления.Renault_СпособыОплаты.Лизинг
	Иначе ФормаСкидок.СпособОплаты = Перечисления.Renault_СпособыОплаты.НаличнаяОплата
	КонецЕсли; 
	
	// НАЧАЛО DMSCOR-1030
	ФормаСкидок.Дата = ДатаКП;
	ФормаСкидок.ЭтоКорпоративныйКлиент = ЭтоКорпКлиент;
	// КОНЕЦ
	//@++ Васильев ВА
	ФормаСкидок.КлючТаблицыСпискаСкидок = ПоместитьСписокСкидокВоВременноеХранилище(); 
	//@++
	Ответ = ФормаСкидок.ОткрытьМодально();
	Если ЗначениеЗаполнено(Ответ) Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Ответ);
		СуммаДоставки = Ответ.СуммаДоставки;
		ЦенаИтого = Ответ.СуммаКонечная;  
		//++Васильев ВА
		ПолучитьСписокСкидок(Ответ.КлючТаблицыСпискаСкидок);
		//@++
	КонецЕсли;
	
	ПересчитатьЦенуАвто();	
	
КонецПроцедуры

//@++ Васильев ВА
&НаСервере
Процедура ПолучитьСписокСкидок(КлючТаблицыСпискаСкидок)
	Если КлючТаблицыСпискаСкидок <> Неопределено Тогда
		СписокСкидок.Загрузить(ПолучитьИзВременногоХранилища(КлючТаблицыСпискаСкидок)); 
	КонецЕсли;
КонецПроцедуры

&НаСервере 
Функция ПоместитьСписокСкидокВоВременноеХранилище() 
	Если НЕ ЗначениеЗаполнено(КлючТаблицыСпискаСкидок) Тогда
		Возврат ПоместитьВоВременноеХранилище(СписокСкидок.Выгрузить(), Новый УникальныйИдентификатор()); 	
	Иначе
		Возврат ПоместитьВоВременноеХранилище(СписокСкидок.Выгрузить(), КлючТаблицыСпискаСкидок); 	
	КонецЕсли;		
КонецФункции 

//@++

&НаКлиенте
Процедура ПересчитатьСкидки()
	
	//Если СуммаСкидки = 0 Тогда
	//	Элементы.СкидкаНаценка.Заголовок = "Установка скидок";
	//Иначе
	//	Элементы.СкидкаНаценка.Заголовок = "Скидка " + Строка(СуммаСкидки) + " р.";
	//КонецЕсли;
	СуммаСкидки = 0;
	Для каждого Стр Из СписокСкидок Цикл
		СуммаСкидки = СуммаСкидки + Стр.СуммаСкидки;	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ФИОПриИзменении(Элемент)
	
	СохранитьДанныеКлиента(ФИО, Телефон, Email);
	ОбновитьЗаголовокКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ТелефонПриИзменении(Элемент)
	
	СохранитьДанныеКлиента(ФИО, Телефон, Email);
	
КонецПроцедуры

&НаКлиенте
Процедура EmailПриИзменении(Элемент)
	
	СохранитьДанныеКлиента(ФИО, Телефон, Email);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеКлиента(ФИО, Телефон, Email)
	
	КлиентОбъект = ТекущийКлиент.ПолучитьОбъект();
	КлиентОбъект.Наименование = ФИО;
	КлиентОбъект.НаименованиеПолное = ФИО;
	КлиентОбъект.Записать();
	
	Renault_УправлениеКонтактнойИнформацией.ЗаписатьОсновнойТелефонКлиента(Телефон, ТекущийКлиент);
	
	Renault_УправлениеКонтактнойИнформацией.ЗаписатьОсновнойEmailКлиента(Email, ТекущийКлиент);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеКлиентаСервер()
	
	Телефон = "";
	Email = "";
	ФИО = "";
	
	Если ЗначениеЗаполнено(ТекущийКлиент) Тогда
		
		Телефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(ТекущийКлиент);		
		Email = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(ТекущийКлиент);		
		ФИО = ТекущийКлиент.НаименованиеПолное;
		СогласиеНаОбработкуПерсональныхДанных = ТекущийКлиент.СогласиеНаОбработкуПерсональныхДанных;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеКП()
	
	НомерКП = "";
	ДатаКП = Неопределено;
	
	Если ЗначениеЗаполнено(ТекущееКП) Тогда
		НомерКП = ТекущееКП.Номер;
		ДатаКП = ТекущееКП.Дата;
		СрокДействия = ТекущееКП.СрокДействия;
		ДатаНачалаПередачиАвто    = ТекущееКП.ДатаНачалаПередачиАвто;
		ДатаОкончанияПередачиАвто = ТекущееКП.ДатаОкончанияПередачиАвто;
		Если ТекущееКП.Состав.Количество()>0 Тогда
			ТекущаяКонфигурация = ТекущееКП.Состав[0].Конфигурация;
		КонецЕсли;
		ИнтересовалсяТрейдИн = ТекущееКП.ИнтересовалсяТрейдИн;
		ИнтересовалсяСтраховкой = ТекущееКП.ИнтересовалсяСтраховкой;
		ИнтересовалсяУтилизацией = ТекущееКП.ИнтересовалсяУтилизацией;
		ТипКП=ТекущееКП.ТипКП;
		//ЗаявкаНаКредит = ТекущееКп.ЗаявкаНаКредит;
		//ЗаявкаНаСтраховку = ТекущееКП.ЗаявкаНаСтраховку;
		ЗаявкаНаГарантию = ТекущееКП.ЗаявкаНаГарантию;
		ИнтересовалсяКредитом = ТекущееКП.ИнтересовалсяКредитом;
		ИнтересовалсяОборудованием = ТекущееКП.ИнтересовалсяОборудованием;
		ЗаявкаНаОборудование = ТекущееКП.ЗаявкаНаОборудование;
		ЗагрузитьЗаявкуНаТрейдИн();
		ЗагрузитьЗаявкуНаКредит();
		ЗагрузитьЗаявкуНаГарантию();
		ЗагрузитьЗаявкуНаОборудование();
		ЗагрузитьЗаявкуНаСтраховку();
		ЗагрузитьСписокСкидок();
	КонецЕсли;
	
КонецПроцедуры


Процедура ЗагрузитьСписокСкидок()	
	УИДКонфигурации = Строка(ТекущаяКонфигурация.УникальныйИдентификатор());
	Отбор = Новый Структура("ИдентификаторКонфигурации", УИДКонфигурации);
	НайденныеСтрокиСкидок = ТекущееКП.СкидкиКонфигурации.НайтиСтроки(Отбор);
	
	Для Каждого Эл Из НайденныеСтрокиСкидок Цикл
		Строка = СписокСкидок.Добавить();
		Строка.ТипСкидки = Эл.ТипСкидки;
		Строка.СуммаСкидки = Эл.СуммаСкидки;
		Строка.Акция = Эл.Акция;	
	КонецЦикла;
КонецПроцедуры	

&НаСервере
Процедура ЗагрузитьЗаявкуНаТрейдИн()
	
	ИнтересовалсяТрейдИн = Ложь;
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("РабочийЛист", ТекущийРабочийЛист);
	//Выборка = Документы.Renault_ЗаявкаНаТрейдИн.Выбрать(,, СтруктураОтбора);
	//Если Выборка.Следующий() Тогда
	//	ЗаявкаНаТрейдИн = Выборка.Ссылка;
	//	ИнтересовалсяТрейдИн = Истина;
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн) Тогда
		ТрЗаявка = ЗаявкаНаТрейдИн;
	Иначе
		ТрЗаявка = НайтиЗаявкуТрейдИн();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТрЗаявка) тогда
		
		ЗаявкаНаТрейдИн = ТрЗаявка;
		ИнтересовалсяТрейдИн = Истина;
		
		// начало добавление Зеленчук
		Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн.ЦенаВыкупа) Тогда
			ЦенаВыкупа = ЗаявкаНаТрейдИн.ЦенаВыкупа;
		ИначеЕсли ЗначениеЗаполнено(ЗаявкаНаТрейдИн.ОриентировочнаяЦена) Тогда
			ЦенаВыкупа = ЗаявкаНаТрейдИн.ОриентировочнаяЦена;
		КонецЕсли;
		// окончание добавление Зеленчук
		ТрейдИнСумма = ЦенаВыкупа;
		ТрейдИнМодель = ЗаявкаНаТрейдИн.Автомобиль.Модель;
		ТрейдИнВерсия = ЗаявкаНаТрейдИн.Автомобиль.ВариантКомплектации;
		ТрейдИнМарка = ЗаявкаНаТрейдИн.ПроизводительКод;
		ТрейдИнЦвет =  ЗаявкаНаТрейдИн.Автомобиль.Цвет;
		ТрейдИнГодВыпуска = ЗаявкаНаТрейдИн.ГодВыпуска;
		ТрейдИнПробег = ЗаявкаНаТрейдИн.Пробег;	
		
		// КовалевЕС от 30.05.19 {
		ПолученнаяСуммаТрейдИн = ПолучитьЦенуВыкупленногоАвто(ЗаявкаНаТрейдИн.Автомобиль);
		Если ПолученнаяСуммаТрейдИн <> 0 Тогда
			ТрейдИнСумма = ПолученнаяСуммаТрейдИн;		
		КонецЕсли;	
		// КовалевЕС от 30.05.19 } 
		
	КонецЕсли;
		
	Элементы.ОстальноеТрейдИн.Видимость = ИнтересовалсяТрейдИн;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуВыкупленногоАвто(Автомобиль)

	ЦенаВыкупа = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОстаткиАвтомобилейОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль
	|ПОМЕСТИТЬ ВТОстатки
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(, Автомобиль = &Автомобиль) КАК ОстаткиАвтомобилейОстатки
	|ГДЕ
	|	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеАвтомобилейАвтомобили.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ПоступлениеАвтомобилейАвтомобили.Renault_СуммаЗачет <> 0
	|			ТОГДА ПоступлениеАвтомобилейАвтомобили.Renault_СуммаЗачет
	|		ИНАЧЕ ПоступлениеАвтомобилейАвтомобили.СуммаВсего
	|	КОНЕЦ КАК СуммаВсего
	|ИЗ
	|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОстатки КАК ВТОстатки
	|		ПО ПоступлениеАвтомобилейАвтомобили.Автомобиль = ВТОстатки.Автомобиль
	|ГДЕ
	|	ПоступлениеАвтомобилейАвтомобили.Автомобиль = &Автомобиль
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();	
		
		ЦенаВыкупа = Выборка.СуммаВсего;
	КонецЕсли;
	
	Возврат ЦенаВыкупа;
	
КонецФункции

&НаСервере
Функция НайтиЗаявкуТрейдИн()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Renault_РабочиеЛисты.СвязаныйIDK,
	|	Renault_РабочиеЛисты.IDK
	|ИЗ
	|	Документ.Renault_РабочийЛист КАК Renault_РабочиеЛисты
	|ГДЕ
	//|	Renault_РабочиеЛисты.ТипРабочегоЛиста = &ТипРабочегоЛиста
	|	Renault_РабочиеЛисты.СвязаныйIDK = &СвязаныйIDK";
	Запрос.УстановитьПараметр("ТипРабочегоЛиста", Перечисления.Renault_ТипыРабочихЛистов.TradeIn);
	Запрос.УстановитьПараметр("СвязаныйIDK", ТекущийРабочийЛист);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Renault_ЗаявкаНаТрейдИн.Ссылка
		|ИЗ
		|	Документ.Renault_ЗаявкаНаТрейдИн КАК Renault_ЗаявкаНаТрейдИн
		|ГДЕ
		|	Renault_ЗаявкаНаТрейдИн.РабочийЛист = &РабочийЛист
		|	И Renault_ЗаявкаНаТрейдИн.ПометкаУдаления = ЛОЖЬ";
		Запрос.УстановитьПараметр("РабочийЛист", Выборка.idk);
		Выб = Запрос.Выполнить().Выбрать();
		
		Если Выб.Следующий() Тогда
			
			Возврат Выб.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ОбновитьСписокЦветов(ТекМодель)
	
	Металлик = Ложь;
	Для Каждого Стр Из ВыбранныеНебазовыеОпции Цикл
		Если Стр.Выбран Тогда
			Если Найти(Стр.Опция.Наименование, "металлик")>0 или Найти(Стр.Опция.Наименование, "Металлик")>0 Тогда
				Металлик = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	мИсключаемых = Новый Массив;
	мВыбранных = Новый Массив;
	
	Если ОтборПоЦветам и ЗначениеЗаполнено(ТекНаборЦветов) Тогда
		Для Каждого СтрокаТЗ из ТекНаборЦветов.Цвета Цикл
			Если СтрокаТЗ.Исключаемый Тогда
				мИсключаемых.Добавить(СтрокаТЗ.Цвет);
			Иначе
				мВыбранных.Добавить(СтрокаТЗ.Цвет);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ
	|	&ПустаяСтрока КАК Цвет,
	|	"""" КАК Код,
	|	"""" КАК ЦветНаименование,
	|	ЛОЖЬ КАК Металлик,
	|	0 КАК ДоплатаЗаЦвет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Renault_ЦветаМоделей.Цвет,
	|	Renault_ЦветаМоделей.Цвет.Артикул,
	|	Renault_ЦветаМоделей.Цвет.Наименование,
	|	ВЫБОР
	|		КОГДА Renault_ЦветаМоделей.Цвет = &Цвет
	|			ТОГДА &Металлик
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	Renault_ЦветаМоделей.ДоплатаЗаЦвет
	|ИЗ
	|	РегистрСведений.Renault_ЦветаМоделей КАК Renault_ЦветаМоделей
	|ГДЕ
	|	Renault_ЦветаМоделей.Модель = &Модель" +
	
	?(мИсключаемых.Количество() = 0,"", " И НЕ Renault_ЦветаМоделей.Цвет В (&ЦветаИсключаемые) ")+   
	?(мВыбранных.Количество() = 0,"", " И Renault_ЦветаМоделей.Цвет В (&ЦветаВыбраны) ")+
	
	" УПОРЯДОЧИТЬ ПО
	|	ЦветНаименование";
	
	Запрос.УстановитьПараметр("Модель", Модель);
	Запрос.УстановитьПараметр("ЦветаИсключаемые", мИсключаемых);
	Запрос.УстановитьПараметр("ЦветаВыбраны", мВыбранных);
	Запрос.УстановитьПараметр("ПустаяСтрока", Справочники.Цвета.ПустаяСсылка());
	Запрос.УстановитьПараметр("Цвет", Цвет);
	Запрос.УстановитьПараметр("Металлик", Металлик);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Если Таблица.Количество() = 1 Тогда
		Таблица.Очистить();
	КонецЕсли;
	
	ТаблицаЦвета.Загрузить(Таблица);
	//Цвет = Справочники.Цвета.ПустаяСсылка();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокМоделей()
	
	Бренд = ПараметрыСеанса.DMS_Бренд;
	
	Если ЗначениеЗаполнено(Бренд) Тогда
		МаркаРено = Бренд;
	Иначе
		МаркаРено = CRM_Сервер.ПолучитьМаркуRenault();
	КонецЕсли;
	
	МассивМарок = Новый Массив;
	Если Не МаркаРено.Пустая() Тогда
		Если Не ЗначениеЗаполнено(Автомобиль) Тогда
			МассивМарок = МаркаРено.МоделиАвтомобилейКоммерческоеПредложение.ВыгрузитьКолонку("Модель");
		Иначе
			МассивМарок = МаркаРено.МоделиАвтомобилей.ВыгрузитьКолонку("Модель");
		КонецЕсли;
	КонецЕсли;
	
	Элементы.Модель1.СписокВыбора.ЗагрузитьЗначения(МассивМарок);
	
	Для Каждого Элемент Из МассивМарок Цикл
		Если Не Элемент.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Элемент1 Из Элементы.Модель1.СписокВыбора Цикл
			Если Элемент1.Значение = Элемент Тогда
				Элементы.Модель1.СписокВыбора.Удалить(Элемент1);
				Прервать;
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокКонфигураций(ТекМодель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&ПустаяСтрока КАК Ссылка
	|ПОМЕСТИТЬ ВТКомплектации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ВариантКомплектации
	|ИЗ
	|	РегистрСведений.Renault_ТарифНаКомплектацииАвтомобилей.СрезПоследних(
	|			,
	|			Тариф = &Тариф
	|				И Модель = &Модель) КАК Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних
	|ГДЕ
	|	(Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ДоступноКЗаказуВПроизводство = ИСТИНА
	|			ИЛИ НЕ &СкрыватьНедоступныеКЗаказу)
	|	И Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.Модель.ПометкаУдаления = ЛОЖЬ
	|	И Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ВариантКомплектации.ПометкаУдаления = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(
	|			,
	|			СкладКомпании В (&СкладыДилера)
	|				И Автомобиль.Модель = &Модель) КАК ОстаткиАвтомобилейОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ЗаконтрактованныеАвтомобили.СрезПоследних КАК Renault_ЗаконтрактованныеАвтомобилиСрезПоследних
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = Renault_ЗаконтрактованныеАвтомобилиСрезПоследних.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_УтвержденныеРезервы КАК Renault_УтвержденныеРезервы
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = Renault_УтвержденныеРезервы.Автомобиль
	|ГДЕ
	|	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0
	|	И Renault_ЗаконтрактованныеАвтомобилиСрезПоследних.Автомобиль ЕСТЬ NULL
	|	И Renault_УтвержденныеРезервы.Автомобиль ЕСТЬ NULL
	|	И НЕ &ТолькоДоступныеКЗаказуВерсии
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Renault_ОстаткиАвтомобилейДругихТочек.Автомобиль.ВариантКомплектации
	|ИЗ
	|	РегистрСведений.Renault_ОстаткиАвтомобилейДругихТочек КАК Renault_ОстаткиАвтомобилейДругихТочек
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ЗаконтрактованныеАвтомобили.СрезПоследних КАК Renault_ЗаконтрактованныеАвтомобилиСрезПоследних
	|		ПО Renault_ОстаткиАвтомобилейДругихТочек.Автомобиль = Renault_ЗаконтрактованныеАвтомобилиСрезПоследних.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_УтвержденныеРезервы КАК Renault_УтвержденныеРезервы
	|		ПО Renault_ОстаткиАвтомобилейДругихТочек.Автомобиль = Renault_УтвержденныеРезервы.Автомобиль
	|ГДЕ
	|	Renault_ЗаконтрактованныеАвтомобилиСрезПоследних.Автомобиль ЕСТЬ NULL
	|	И Renault_УтвержденныеРезервы.Автомобиль ЕСТЬ NULL
	|	И Renault_ОстаткиАвтомобилейДругихТочек.Автомобиль.Модель = &Модель
	|	И НЕ &ТолькоДоступныеКЗаказуВерсии
	|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	Renault_ДоговорСоставДоговора.Автомобиль.ВариантКомплектации
	//|ИЗ
	//|	РегистрСведений.Renault_ЗаказыВПроизводствоПодКлиентов КАК Renault_ЗаказыВПроизводствоПодКлиентов
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_Договор.СоставДоговора КАК Renault_ДоговорСоставДоговора
	//|		ПО Renault_ЗаказыВПроизводствоПодКлиентов.Договор = Renault_ДоговорСоставДоговора.Ссылка
	//|			И Renault_ЗаказыВПроизводствоПодКлиентов.ИдентификаторСтрокиДоговора = Renault_ДоговорСоставДоговора.Идентификатор
	//|ГДЕ
	//|	Renault_ЗаказыВПроизводствоПодКлиентов.Модель = &Модель
	//|	И НЕ Renault_ДоговорСоставДоговора.Автомобиль ЕСТЬ NULL
	//|	И НЕ &ТолькоДоступныеКЗаказуВерсии
	//|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СостояниеАвтомобилей.Автомобиль.ВариантКомплектации
	|ИЗ
	|	РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК СостояниеАвтомобилей
	|ГДЕ
	|	СостояниеАвтомобилей.Автомобиль <> ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка)
	|	И СостояниеАвтомобилей.Модель = &Модель
	|	И СостояниеАвтомобилей.Статус = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыАвтомобилей.ВпутиКДилеру)
	|	И НЕ &ТолькоДоступныеКЗаказуВерсии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТКомплектации.Ссылка КАК Ссылка,
	|	ВТКомплектации.Ссылка.Артикул КАК Код,
	|	ВЫРАЗИТЬ(ВТКомплектации.Ссылка.НаименованиеПолное КАК СТРОКА(150)) КАК Комплектация
	|ИЗ
	|	ВТКомплектации КАК ВТКомплектации
	|ГДЕ
	|	НЕ ВТКомплектации.Ссылка ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	Комплектация";
	
	ДЦ =Renault_CRM.ПолучитьДилерскийЦентрПользователя();
	Запрос.УстановитьПараметр("Модель", ТекМодель);
	Запрос.УстановитьПараметр("Тариф", ТекущийТариф);
	Запрос.УстановитьПараметр("СкладыДилера", ДЦ.СкладыДилера.ВыгрузитьКолонку("Склад"));
	Запрос.УстановитьПараметр("ПустаяСтрока", Справочники.ВариантыКомплектации.ПустаяСсылка());
	Запрос.УстановитьПараметр("СкрыватьНедоступныеКЗаказу", Не ЗначениеЗаполнено(Автомобиль) ИЛИ ТолькоДоступныеКЗаказуВерсии);
	Запрос.УстановитьПараметр("ТолькоДоступныеКЗаказуВерсии",ТолькоДоступныеКЗаказуВерсии);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Если Таблица.Количество() = 1 Тогда
		Таблица.Очистить();
	КонецЕсли;
	
	ТаблицаКомплектации.Загрузить(Таблица);
	
	Если ЗначениеЗаполнено(Версия) Тогда
		Если Версия.Владелец <> ТекМодель Тогда
			Версия = Справочники.ВариантыКомплектации.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМоделиПриАктивизацииСтроки(Элемент)
	
	//ПодключитьОбработчикОжидания("ОбработкаАктивизацииМодели", 0.2, Истина);
	ОбработкаАктивизацииМодели();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизацииМодели()
	
	Если НеОбновлятьПриАктивизацииСтроки Или Модель = Элементы.ТаблицаМодели.ТекущиеДанные.Модель Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.ТаблицаМодели.ТекущаяСтрока <> Неопределено Тогда
		Модель = Элементы.ТаблицаМодели.ТекущиеДанные.Модель;
	Иначе
		Модель = Неопределено;
	КонецЕсли;
	
	ОбновитьСписокКонфигураций(Модель);
	ОбновитьСписокЦветов(Модель);
	ПодключитьОбработчикОжидания("ОбновитьКартинкуМоделиКлиент", 0.2, Истина);
	ПриИзмененииМоделиАвто();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКартинкуМоделиКлиент()
	
	ОбновитьКартинкуМодели();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКомплектацииПриАктивизацииСтроки(Элемент)
	
	//ПодключитьОбработчикОжидания("ОбработкаАктивацииКомплектации", 0.2, Истина);
	ОбработкаАктивацииКомплектации();
	//@++
	//ЭтаФорма.Модифицированность = Истина;
	//@--
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивацииКомплектации()
	
	Если НеОбновлятьПриАктивизацииСтроки Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущийЭлемент <> Элементы.ТаблицаКомплектации Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.ТаблицаКомплектации.ТекущиеДанные = Неопределено Тогда
		Версия = Неопределено;
	ИначеЕсли Версия = Элементы.ТаблицаКомплектации.ТекущиеДанные.Комплектация Тогда
		Возврат;
	Иначе
		Версия = Элементы.ТаблицаКомплектации.ТекущиеДанные.Ссылка;
	КонецЕсли;
	
	ПриИзмененииВерсииАвто();
	//VIN = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦветаПриАктивизацииСтроки(Элемент)
	
	//ПодключитьОбработчикОжидания("ОбработкаАктивизацииЦвета", 0.2, Истина);
	ОбработкаАктивизацииЦвета();
	//@++
	//ЭтаФорма.Модифицированность = Истина;
	//@--
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизацииЦвета()
	
	Если НеОбновлятьПриАктивизацииСтроки Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущийЭлемент <> Элементы.ТаблицаЦвета Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.ТаблицаЦвета.ТекущиеДанные = Неопределено Тогда
		Цвет = Неопределено;
	ИначеЕсли Цвет = Элементы.ТаблицаЦвета.ТекущиеДанные.Цвет Тогда
		Возврат;
	Иначе
		Цвет = Элементы.ТаблицаЦвета.ТекущиеДанные.Цвет;
	КонецЕсли;
	
	ПроверитьОкраскуМеталлик();
	
	ПодключитьОбработчикОжидания("ОбновитьКартинкуМоделиКлиент", 0.2, Истина);
	
	//VIN = "";	
	//ОбновитьТаблицыСклад();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаКредитаПриИзменении(Элемент)
	
	ПересчитатьКредит();
	
КонецПроцедуры

&НаКлиенте
Процедура МаркетинговаяСтавкаПриИзменении(Элемент)
	
	ПересчитатьКредит();
	
КонецПроцедуры

&НаКлиенте
Процедура ЕжемесячныйПлатежПриИзменении(Элемент)
	
	ПересчитатьКредит();
	
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьПГПриИзменении(Элемент)
	
	ПересчитатьЦенуАвто();
	
КонецПроцедуры

&НаКлиенте
Процедура КонфигурацияПерезаписать(Команда=неопределено)
	
	Если Не ЗначениеЗаполнено(Версия) ИЛИ Не ЗначениеЗаполнено(Цвет) Тогда
		Предупреждение("Не указана версия или цвет автомобиля");
		Возврат;
	КонецЕсли;
	
	Если ИнтересовалсяСтраховкой Тогда
		Если Не ЗначениеЗаполнено(Возраст) Тогда
			Предупреждение("Не заполнен возраст водителя");
			Возврат;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтажВождения) Тогда
			Предупреждение("Не заполнен стаж вождения");
			Возврат;
		КонецЕсли;
		ОбработатьВвозСтраховой();
	КонецЕсли;
	
	НеОбновлятьПриАктивизацииСтроки = Истина;
	
	ЗаявкаНаКредит = СоздатьНайтиЗаявкуНаКредит();
	ЗаявкаНаСтраховку = СоздатьНайтиЗаявкуНаСтраховку();
	ЗаявкаНаГарантию = СоздатьНайтиЗаявкуНаГарантию();
	
	ТекущаяКонфигурация = ЗаписатьКонфигурацию(Истина);
	
	//v+
	ЗадачиОФУ=ЗадачиОФУ();
	СуществуетКонсультацияОФУ=СоздатьЗадачу_ОФУ_Наличные ИЛИ ЗадачиОФУ.НайтиСтроки(Новый Структура("ВидСобытия",Справочники.CRM_ВидыСобытий.КонсультацияОФУ)).Количество()>0;
	СуществуетКредит=СоздатьЗадачу_ОФУ_Кредит ИЛИ ЗадачиОФУ.НайтиСтроки(Новый Структура("ВидСобытия",Справочники.CRM_ВидыСобытий.Кредит)).Количество()>0;
	СуществуетЛизинг=СоздатьЗадачу_ОФУ_Лизинг ИЛИ ЗадачиОФУ.НайтиСтроки(Новый Структура("ВидСобытия",Справочники.CRM_ВидыСобытий.Лизинг)).Количество()>0;
	Если НЕ СуществуетКонсультацияОФУ И НЕ СуществуетКредит И НЕ СуществуетЛизинг Тогда
		Если Вопрос("Не выбран способ покупки автомобиля, продожить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
			Возврат
		КонецЕсли;	
	КонецЕсли;	
	ОтложенноеСозданиеЗадачОФУ();
	Перезаписать(ТекущаяКонфигурация,ТипКП());
	//v-
	
	НеОбновлятьПриАктивизацииСтроки = Ложь;
	
	Оповестить("ОбновитьРабочийЛист",,ВладелецФормы);
	ОбновитьОтображениеГруппПоЗаявкам();
	ЭтаФорма.Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура Перезаписать(Конфигурация,ТипКП)
	
	Если НЕ ЗначениеЗаполнено(ТекущееКП) Тогда
		
		ОбКП = Документы.CRM_КоммерческоеПредложение.СоздатьДокумент();
		ОбКП.Дата			= ТекущаяДата();
		ОбКП.Автор			= ПараметрыСеанса.Пользователь;
		ОбКП.СрокДействия	= СрокДействия;
		ОбКП.ДатаНачалаПередачиАвто    = ДатаНачалаПередачиАвто;
		ОбКП.ДатаОкончанияПередачиАвто = ДатаОкончанияПередачиАвто;
		//ОбКП.СрокПоставки	= ТекущаяДата() + 86400 * Константы.CRM_СрокПоставки.Получить();
		ОбКП.Клиент			= ТекущийКлиент;
		ОбКП.РабочийЛист	= ТекущийРабочийЛист;
		ОбКП.ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
		ОбКП.ЗаявкаНаТрейдИн = ЗаявкаНаТрейдИн;
		обКП.ИнтересовалсяТрейдИн = ИнтересовалсяТрейдИн;
		ОбКП.ЗаявкаНаКредит = СоздатьНайтиЗаявкуНаКредит();
		ОбКП.ЗаявкаНаГарантию = СоздатьНайтиЗаявкуНаГарантию();
		СоздатьНайтиЗаявкуНаОборудование(ОбКП);
		обКП.ИнтересовалсяКредитом = ИнтересовалсяКредитом;
		обКП.ИнтересовалсяОБорудованием = ИнтересовалсяОборудованием;
		Обкп.ИнтересовалсяСтраховкой = ИнтересовалсяСтраховкой;
		ОбКП.ЗаявкаНаСтраховку = СоздатьНайтиЗаявкуНаСтраховку();
		Обкп.ИнтересовалсяСтраховкой = ИнтересовалсяСтраховкой;
		ОбКП.ТипКП=ТипКП;
		ОбКП.Renaut_ЦенаРОП = ?(УстановитьРасчетнуюПоЦенеРоп И ЦенаРОП <> 0, ЦенаРОП, 0);
		ОбКП.ИнтересовалсяУтилизацией = ИнтересовалсяУтилизацией;
		ОбКП.ВариантСалона = ТекущийВариантСалона;
		ОбКП.ЦветСалона = ТекущийЦветСалона;
		ОбКП.Записать();
		
		ТекущееКП = ОбКП.Ссылка;
		
	Иначе
		
		ОбКП = ТекущееКП.ПолучитьОбъект();
		ОбКП.ТипКП=ТипКП;
		ОбКП.СрокДействия	= СрокДействия;
		ОбКП.ДатаНачалаПередачиАвто    = ДатаНачалаПередачиАвто;
		ОбКП.ДатаОкончанияПередачиАвто = ДатаОкончанияПередачиАвто;
		ОбКП.ЗаявкаНаТрейдИн = ЗаявкаНаТрейдИн;
		обКП.ИнтересовалсяТрейдИн = ИнтересовалсяТрейдИн;
		ОбКП.ЗаявкаНаГарантию = СоздатьНайтиЗаявкуНаГарантию();
		СоздатьНайтиЗаявкуНаОборудование(ОбКП);
		обКП.ИнтересовалсяКредитом = ИнтересовалсяКредитом;
		ОбКП.ИнтересовалсяОборудованием = ИнтересовалсяОборудованием;
		Обкп.ИнтересовалсяСтраховкой = ИнтересовалсяСтраховкой;
		ОбКП.ИнтересовалсяУтилизацией = ИнтересовалсяУтилизацией;
		ОбКП.Renaut_ЦенаРОП = ?(УстановитьРасчетнуюПоЦенеРоп И ЦенаРОП <> 0, ЦенаРОП, 0);
		ОбКП.ВариантСалона = ТекущийВариантСалона;
		ОбКП.ЦветСалона = ТекущийЦветСалона;
		
		ОбКП.Записать();
		
	КонецЕсли;
	
	СтрКонф = ОбКП.Состав[0];
	СтрКонф.Конфигурация = Конфигурация;
	СтрКонф.Сумма = ЦенаИТОГО;
	СтрКонф.СуммаДоставки = СуммаДоставки;
	СтрКонф.СуммаСкидки = СуммаСкидки;
	
	НомерКП = ОбКП.Номер;
	ДатаКП = ОбКП.Дата;
	
	// КовалевЕС от 30.05.19 {
	ОбКП.ВычетПоТрейдИн = ТрейдИнСумма;
	// КовалевЕС от 30.05.19 } 
	
	ОбКП.Сумма = ОбКП.Состав.Итог("Сумма");
	ОбКП.ЗаявкаНаТрейдИн = ЗаявкаНаТрейдИн;
	ОбКП.ЗаявкаНаГарантию = СоздатьНайтиЗаявкуНаГарантию();
	обКП.ИнтересовалсяКредитом = ИнтересовалсяКредитом;
	обКП.ИнтересовалсяОборудованием = ИнтересовалсяОборудованием;
	Обкп.ИнтересовалсяСтраховкой = ИнтересовалсяСтраховкой;
	ТабСкидкиОбКП = ОбКП.СкидкиКонфигурации;	
	
	УИДКонфигурации = Строка(Конфигурация.УникальныйИдентификатор());
	Отбор = Новый Структура("ИдентификаторКонфигурации", УИДКонфигурации);
	НайденныеСтрокиСкидок = ТабСкидкиОбКП.НайтиСтроки(Отбор);
	
	Для Каждого Эл Из НайденныеСтрокиСкидок Цикл
		ТабСкидкиОбКП.Удалить(Эл);	
	КонецЦикла;
	
	СкидкаRenault = Справочники.ТипыСкидок.НайтиПоКоду("RenltCA");
	
	мСкидки = ТабСкидкиОбКП.НайтиСтроки(Новый Структура("ТипСкидки", СкидкаRenault));
		Для Каждого СтрУдаления из мСкидки Цикл
			ТабСкидкиОбКП.Удалить(СтрУдаления);
		КонецЦикла; 
	
	Для Каждого Эл Из СписокСкидок Цикл
		Стр = ТабСкидкиОбКП.Добавить();
		Стр.ИдентификаторКонфигурации = УИДКонфигурации;
		Стр.ТипСкидки = СкидкаRenault;
		ЗаполнитьЗначенияСвойств(Стр, Эл);
	КонецЦикла;
	
	Если ИнтересовалсяСтраховкой Тогда
		
		СтруктураПолисы = СохранитьСтраховыеПолисы(ОбКП.ПолисОСАГО, ОбКП.ПолисКАСКО);
		ОбКП.ПолисОСАГО = СтруктураПолисы.ПолисОСАГО;
		ОбКП.ПолисКАСКО = СтруктураПолисы.ПолисКАСКО;
		ОбКП.Возраст = Возраст;
		ОбКП.СтажВождения = СтажВождения;
		
	КонецЕсли;
	
	ОбКП.Записать(РежимЗаписиДокумента.Проведение);
	ЭтаФорма.Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаТрейдИнНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Форма = Документы.Renault_ЗаявкаНаТрейдИн.ПолучитьФорму("Документ.Renault_ЗаявкаНаТрейдИн.ФормаВыбора");
	Форма.Отбор.Клиент.ВидСравнения = ВидСравнения.Равно;
	Форма.Отбор.Клиент.Значение = ТекущийКлиент;
	Форма.Отбор.Клиент.Использование = Истина;
	Форма.Отбор.Черновик.ВидСравнения = ВидСравнения.Равно;
	Форма.Отбор.Черновик.Значение = ложь;
	Форма.Отбор.Черновик.Использование = Истина;
	Форма.Отбор.Закрыта.ВидСравнения = ВидСравнения.Равно;
	Форма.Отбор.Закрыта.Значение = ложь;
	Форма.Отбор.Закрыта.Использование = Истина;
	Форма.Отбор.ПометкаУдаления.Значение = Ложь;
	Форма.Отбор.ПометкаУдаления.Использование = Истина;
	Форма.РежимВыбора = истина;
	
	Итог = Форма.ОткрытьМодально();
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура КПЗагрузитьИзПредложения(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура КПЗагрузитьИзСклада(Команда)
	//Козлов Е.А. Начало 26.01.2017
	ТекущаяСтрока = Элементы.ТаблицаСклад.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда	
		ЗагрузитьАвтомобильВКонфигураторКлиент(ТекущаяСтрока.Автомобиль);
	КонецЕсли;
	
	//ЗагрузитьАвтомобильВКонфигураторКлиент(Элементы.ТаблицаСклад.ТекущиеДанные.Автомобиль); 
	//Козлов Е.А. Конец		
КонецПроцедуры

&НаКлиенте
Процедура СкладРасширенныйПодбор(Команда)
	
КонецПроцедуры

//&НаКлиенте
//Процедура СоздатьРабочийЛистНаПрием()
//	
//		
//	
//КонецПроцедуры


&НаКлиенте
Процедура ИнтересовалсяТрейдИнПриИзменении(Элемент)
	
	ЭтаФорма.Модифицированность = Истина;
	
	Если ИнтересовалсяТрейдИн Тогда
		Если НЕ ЗначениеЗаполнено(ТекущийКлиент) Тогда
			Сообщить("Не выбран клиент");
			Возврат;
		КонецЕсли;	
		//создание рабочего листа на прием
		Если Вопрос("Хотите создать заявку на трейд-ин?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда	
			ДилерскийЦентр = ТекДилерскийЦентр;
			Клиент = ТекущийКлиент;
			IDK = ТекущийРабочийЛист;
			ТипТрафика = 	Справочники.CRM_ТипТрафика.ПосещениеАвтосалона;
			Клиент_ФИО = Клиент.НаименованиеПолное;
			
			
			СессияТрейдИн = Renault_РаботаСРабочимиЛистамиПовтИсп.СессияДляТрейдИн();
			
			// Трояновский К.Е. 12.08.2019 10:35:28 {
			//ЗаписьРЛ = Renault_CRM.ПолучитьЗаписьРЛПоIDK(ТекущийРабочийЛист);
			РЛСсылка = Renault_CRM.докПолучитьЗаписьРЛПоIDK(ТекущийРабочийЛист);
			ЗаписьРЛ = РЛСсылка.ПолучитьОбъект();
			// Трояновский К.Е. 12.08.2019 10:35:28 }
			Сотрудник = ЗаписьРЛ.Сотрудник;
			ТекСотрудник = ЗаписьРЛ.Сотрудник;
			Отдел = ЗаписьРЛ.Отдел;
			ТекОтдел = ЗаписьРЛ.Отдел;
			ПервичныйИнтересМодель = ЗаписьРЛ.ПервичныйИнтересМодель;
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	CRM_Отделы.Ссылка
			|ИЗ
			|	Справочник.CRM_Отделы КАК CRM_Отделы
			|ГДЕ
			|	CRM_Отделы.КлассификацияRenault = ЗНАЧЕНИЕ(Перечисление.CRM_КлассификацияОтделов.ОтделТрейдИн)
			|	И CRM_Отделы.ДилерскийЦентр = &ДилерскийЦентр
			|	И НЕ CRM_Отделы.ПометкаУдаления";
			Запрос.УстановитьПараметр("ДилерскийЦентр", ДилерскийЦентр);
			Результат = Запрос.Выполнить();
			
			ОтделТрейдИн = Справочники.CRM_Отделы.ПустаяСсылка();
			
			Если НЕ Результат.Пустой() Тогда
				Выборка = Результат.Выбрать();		
				Выборка.Следующий();
				
				ОтделТрейдИн = Выборка.Ссылка;				
			КонецЕсли;
			
			Список = Renault_CRM.ПолучитьСписокСотрудниковПоОтделу(ОтделТрейдИн);
			Список.Добавить(?(ЗначениеЗаполнено(ОтделТрейдИн), ОтделТрейдИн, Отдел));
			
			ФормаСписка = Обработки.Renault_ARM_Администратор.ПолучитьФорму("ФормаВыбораИзСпискаПлиткой");
			ФормаСписка.Список = Список;
			ФормаСписка.Заголовок = "Выбор менеджера или отдела";
			
			ФормаСписка.ЭтоВыборСотрудника = Истина;
			ФормаСписка.КнопокВСтроке = 2;
			ФормаСписка.ВысотаКнопки = 40;
			Ответ = ФормаСписка.ОткрытьМодально();
			Если ЗначениеЗаполнено(Ответ) Тогда
				СотрудникВыбор = Ответ;
			Иначе
				Сообщить("Необходимо выбрать менеджера или отдел.");
				ИнтересовалсяТрейдИн = Ложь;
				Возврат;
			КонецЕсли;
			
			// Закоментировано. Т.к не нужно создавать трафик, т.к уже есть трафик исходящий.
			///////////////////////////////////////
			
			
			//ЗаписьТрафик = РегистрыСведений.Renault_Трафик.СоздатьМенеджерЗаписи();
			//ЗаписьТрафик.Период = ТекущаяДата();
			//ЗаписьТрафик.ТипТрафика = ТипТрафика;
			//ЗаписьТрафик.Идентификатор = Идентификатор;
			//Если ТипЗнч(СотрудникВыбор)=Тип("СправочникСсылка.Сотрудники") Тогда
			//	ЗаписьТрафик.Менеджер = СотрудникВыбор;
			//Иначе
			//	ЗаписьТрафик.Отдел = СотрудникВыбор;
			//КонецЕсли;		
			//ЗаписьТрафик.Администратор = Сотрудник;
			//ЗаписьТрафик.ПервичныйПовторный = Перечисления.CRM_ПервичныйПовторный.Первичный;
			//ЗаписьТрафик.Представление = Клиент_ФИО;
			//ЗаписьТрафик.Обработан = Истина;
			//ЗаписьТрафик.ДилерскийЦентр = ДилерскийЦентр;
			//ЗаписьТрафик.Клиент = Клиент;	
			//ЗаписьТрафик.Записать();
			
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			// Трояновский К.Е. 12.08.2019 10:47:09 {
			//"ВЫБРАТЬ
			//|	*
			//|ИЗ
			//|	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
			//|ГДЕ
			//|	Renault_РабочиеЛисты.СвязаныйIDK = &IDK
			//|	И Renault_РабочиеЛисты.ТипРабочегоЛиста = Значение(Перечисление.Renault_ТипыРабочихЛистов.TradeIn)";
			"ВЫБРАТЬ
			|	Renault_РабочиеЛисты.Ссылка
			|ИЗ
			|	Документ.Renault_РабочийЛист КАК Renault_РабочиеЛисты
			|ГДЕ
			|	Renault_РабочиеЛисты.СвязаныйIDK = &IDK
			|	И Renault_РабочиеЛисты.ТипРабочегоЛиста = Значение(Перечисление.Renault_ТипыРабочихЛистов.TradeIn)";			
			// Трояновский К.Е. 12.08.2019 10:47:09 }
			
			Запрос.УстановитьПараметр("IDK", IDK);
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				// Трояновский К.Е. 12.08.2019 10:47:55 {
				//Запись = РегистрыСведений.Renault_РабочиеЛисты.СоздатьМенеджерЗаписи();
				//ЗаполнитьЗначенияСвойств(Запись, Выборка);
				//Запись.Прочитать();
				//ТекущийРабочийЛистПрием = Запись.IDK;
				Запись = Выборка.Ссылка.ПолучитьОбъект();
				ТекущийРабочийЛистПрием = Выборка.Ссылка.IDK;
				// Трояновский К.Е. 12.08.2019 10:47:55 }
			Иначе
				Идентификатор = Новый УникальныйИдентификатор();
				// Трояновский К.Е. 12.08.2019 10:46:10 {
				//Запись = Renault_CRM.СоздатьРабочийЛистПоТрафику(Строка(ЗаписьРЛ.IDТрафика));
				Запись = Renault_CRM.докСоздатьРабочийЛистПоТрафику(Строка(ЗаписьРЛ.IDТрафика));
				// Трояновский К.Е. 12.08.2019 10:46:10 }
				// НАЧАЛО DMSREN-282 18.09.2019
				Если Запись.IDK = IDK Тогда
					
					ЗаписьТрафик = РегистрыСведений.Renault_Трафик.СоздатьМенеджерЗаписи();
					
					ЗаписьТрафик.Период = ТекущаяДата();
					Идентификатор = Идентификатор;
					ЗаписьТрафик.ТипТрафика = ТипТрафика;
					ЗаписьТрафик.Идентификатор = Идентификатор;
					Если ТипЗнч(СотрудникВыбор)=Тип("СправочникСсылка.Сотрудники") Тогда
						ЗаписьТрафик.Менеджер = СотрудникВыбор;
						ЗаписьТрафик.Отдел = ОтделТрейдИн;
					Иначе
						ЗаписьТрафик.Отдел = СотрудникВыбор;
					КонецЕсли;
					ЗаписьТрафик.Администратор = Сотрудник;
					ЗаписьТрафик.ПервичныйПовторный = Перечисления.CRM_ПервичныйПовторный.Первичный;
					ЗаписьТрафик.Представление = Клиент_ФИО;
					ЗаписьТрафик.Обработан = Истина;
					ЗаписьТрафик.ДилерскийЦентр = ДилерскийЦентр;
					ЗаписьТрафик.Клиент = Клиент;	
					
					ЗаписьТрафик.Записать();
					
					ЗаписьСсылка = Renault_CRM.докСоздатьРабочийЛистПоТрафику(ЗаписьТрафик.Идентификатор);
					Запись = ЗаписьСсылка.ПолучитьОбъект();
					//Запись = Renault_CRM.докСоздатьРабочийЛистПоТрафику(ЗаписьТрафик.Идентификатор);
					
					Запись.ТипРабочегоЛиста = Перечисления.Renault_ТипыРабочихЛистов.TradeIn;
					Запись.СвязаныйIDK = IDK;
					Запись.Записать();
					
				КонецЕсли;
				// КОНЕЦ DMSREN-282 18.09.2019
				
			КонецЕсли;
			
			//НАЧАЛО DMSREN-442 09.01.2020
			Запись.ТипРабочегоЛиста = Перечисления.Renault_ТипыРабочихЛистов.TradeIn;
			Запись.СвязаныйIDK = IDK;
			Запись.ПервичныйИнтересМодель = ПервичныйИнтересМодель;
			Запись.ДилерскийЦентр = ТекДилерскийЦентр;
			Запись.Отдел = ?(ЗначениеЗаполнено(ОтделТрейдИн), ОтделТрейдИн, ТекОтдел);
			Запись.Записать();	
			ТекущийРабочийЛистПрием = Запись.IDK;
			//КОНЕЦ DMSREN-442 09.01.2020
			
			ЗаписьРЛ.СвязаныйIDK = Запись.IDK;
			//ЭлементыФормы.НадписьСоздатьРабочийЛистТрейдИн.Заголовок = "Открыть связаный рабочий лист";
			
			
			Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
			Запись.IDK = ЗаписьРЛ.СвязаныйIDK;
			Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ИнтересКТрейдИн;
			Запись.Прочитать();
			Если Запись.Выбран() Тогда
				//ОткрытьЗначение(Запись.Объект);
			Иначе
				
				Запись.ДилерскийЦентр = ДилерскийЦентр;
				Запись.ДатаВыполнения = ТекущаяДата();
				Запись.Объект = Документы.Renault_ЗаявкаНаТрейдИн.НайтиПоРеквизиту("РабочийЛист", IDK)
				
			КонецЕсли;
			
			ЗаписьРЛ.Записать();
			
			//создание заявки на трейд-ин
			СтруктураОтбора = Новый Структура();
			СтруктураОтбора.Вставить("РабочийЛист", ТекущийРабочийЛист);
			Выборка = Документы.Renault_ЗаявкаНаТрейдИн.Выбрать(,, СтруктураОтбора);
			Если Не Выборка.Следующий() Тогда
				//Если Вопрос("Хотите создать заявку на трейд-ин?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда	
				Существуют = ПроверитьСозданныеЗаявкиТрейдИн();
				Если Не Существуют Тогда
					//открыть форму выбора менеджера
					// Трояновский К.Е. 12.08.2019 10:48:56 {
					//ФормаАвто = ПолучитьФорму("РегистрСведений.Renault_РабочиеЛисты.Форма.АвтомобильTradeIN", , ЭтаФорма, ЭтаФорма.КлючУникальности);
					ФормаАвто = ПолучитьФорму("Документ.Renault_РабочийЛист.Форма.АвтомобильTradeIN", , ЭтаФорма, ЭтаФорма.КлючУникальности);
					// Трояновский К.Е. 12.08.2019 10:48:56 }
					ФормаАвто.ПоложениеОкна = ВариантПоложенияОкна.Центрировать;
					ФормаАвто.ДилерскийЦентр = ДилерскийЦентр;
					ФормаАвто.СессияТрейдИн = СессияТрейдИн;
					ФормаАвто.IDK = ТекущийРабочийЛистПрием;
					ФормаАвто.Исполнитель = СотрудникВыбор;
					Ответ = ФормаАвто.ОткрытьМодально();
					Если Ответ <> Неопределено Тогда
						ЗаявкаНаТрейдИн = Ответ;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		Иначе 
			ИнтересовалсяТрейдИн = Ложь;
			Возврат;
		КонецЕсли;
		
	Иначе 
		Если НЕ ЗаявкаНаТрейдИн.Пустая() И Вопрос("Пометить на удаление заявку на трейд-ин?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда	
			ЗаявкаНаТрейдИнОбъект = ЗаявкаНаТрейдИн.ПолучитьОбъект();
			ЗаявкаНаТрейдИнОбъект.УстановитьПометкуУдаления(Истина);
			ИнтересовалсяТрейдИн = Ложь;
			ЦенаВыкупа = 0;
		Иначе
			ИнтересовалсяТрейдИн = Истина;	
		КонецЕсли;	
	КонецЕсли;
	
	Элементы.ИнтересовалсяУтилизацией.Доступность = НЕ ИнтересовалсяТрейдИн;	
	
	ОбновитьОтображениеГруппПоЗаявкам(); //ИнтересовалсяТрейдИн 
	
	Если НЕ ЭтоКорпКлиент Тогда
		//РассчитатьСкидкиПоАвтомобилю();
		ПересчитатьСтоимость();
		СуммаСкидки = СписокСкидок.Итог("СуммаСкидки");
	КонецЕсли;
	
	ПересчитатьСтоимость();
	
	ПересчитатьЦенуАвто();
	ОбновитьНадписьЦена();
	
КонецПроцедуры

&НаСервере
Функция ПроверитьСозданныеЗаявкиТрейдИн()
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТипОперацииTradeIn", Перечисления.Renault_ТипыОперацийТрейдИн.TradeIn);
	Запрос.УстановитьПараметр("РабочийЛист", ТекущийРабочийЛистПрием);
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Renault_ЗаявкаНаТрейдИн.Ссылка
	|ИЗ
	|	Документ.Renault_ЗаявкаНаТрейдИн КАК Renault_ЗаявкаНаТрейдИн
	|ГДЕ
	|	НЕ Renault_ЗаявкаНаТрейдИн.ПометкаУдаления
	|	И Renault_ЗаявкаНаТрейдИн.ТипОперацииTradeIn = &ТипОперацииTradeIn
	|	И Renault_ЗаявкаНаТрейдИн.РабочийЛист = &РабочийЛист";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции // ПроверитьСозданныеЗаявкиТрейдИн()

&НаКлиенте
Процедура СоздатьЗаявкуНаТрейдИн()
	
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтересовалсяКредитомПриИзменении(Элемент)
	
	СоздаватьЗаявкуНаКредит = ИнтересовалсяКредитом;
	Если Не ИнтересовалсяКредитом Тогда
		ЗаявкаНаКредит = Документы.Renault_CRM_ЗаявкаНаКредит.ПустаяСсылка();
	КонецЕсли;
	// Серверная часть
	Если ИнтересовалсяКредитом Тогда
		Если НЕ ЗначениеЗаполнено(КредитноеПредложение) Тогда
			ПолучитьОптимальноеПредложение();
		Иначе
			
		КонецЕсли;
		ПересчитатьСтоимость();
		
		ПересчитатьЦенуАвто();
		ОбновитьНадписьЦена();
	КонецЕсли;
	// Клиентская часть
	ОбновитьОтображениеГруппПоЗаявкам();
	
КонецПроцедуры

&НаСервере 
Функция СоздатьНайтиЗаявкуНаКредит()
	
	ЗначениеПустое = Ложь;
	Если ЗначениеЗаполнено(ЗаявкаНаКредит) Тогда
		ДокОб = ЗаявкаНаКредит.Ссылка.ПолучитьОбъект();
	ИначеЕсли  СоздаватьЗаявкуНаКредит Тогда
		ДокОб = Документы.Renault_CRM_ЗаявкаНаКредит.СоздатьДокумент();
		ДокОб.Статус = Перечисления.Renault_CRM_СтатусЗаявокНаКредит.Черновик;
	Иначе
		ДокОб = Документы.Renault_CRM_ЗаявкаНаКредит.ПустаяСсылка();
		ЗначениеПустое= Истина;
	КонецЕсли;
	
	Если Не(ЗначениеПустое)Или СоздаватьЗаявкуНаКредит Тогда
		МожноСохранить = Ложь;
		Если НЕ ДокОб.ЭтоНовый() Тогда
			Если Не ДокОб.ВыполненаУспешно Тогда
				МожноСохранить = Истина;
			КонецЕсли;
		Иначе
			МожноСохранить = Истина;
		КонецЕсли;
		Если МожноСохранить тогда
			ДокОб.Версия = Версия;
			ДокОб.Дата = ТекущаяДата();
			ДокОб.Клиент = Метаданные.Документы.Renault_CRM_ЗаявкаНаКредит.Реквизиты.Клиент.Тип.ПривестиЗначение( ТекущийКлиент);
			//ДокОб.Комментарий = ТрейдИнКомментарий;
			ДокОб.Модель = Модель;
			ДокОб.РабочийЛист = ТекущийРабочийЛист;
			ДокОб.Сумма = СуммаКредита;
			ДокОб.Цвет = Цвет;
			ДокОб.БанкПредоставляющийКредит = Банк;
			ДокОб.ЕжемесячныйПлатеж = ЕжемесячныйПлатеж;
			ДокОб.ПервоночальныйВзносПроцент = ПервоначальныйВзносПроцент;
			ДокОб.ПервоночальныйВзнос = ПервоначальныйВзносСумма;
			ДокОб.Срок = СрокКредита;
			ДокОб.Ставка = МаркетинговаяСтавка;
			ДокОб.ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
			ДокОб.КредитноеПредложение = КредитноеПредложение;
			ДокОб.Записать(РежимЗаписиДокумента.Проведение);
			ЗаявкаНаКредит = ДокОб.Ссылка;
			ИнтересовалсяКредитом = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДокОб.Ссылка;
	
КонецФункции

&НаСервере
процедура ЗагрузитьЗаявкуНаКредит()
	
	Если ЗначениеЗаполнено(ЗаявкаНаКредит) тогда
		
		Банк = ЗаявкаНаКредит.БанкПредоставляющийКредит;
		СуммаКредита = ЗаявкаНаКредит.Сумма;
		МаркетинговаяСтавка = ЗаявкаНаКредит.Ставка;
		ЕжемесячныйПлатеж = ЗаявкаНаКредит.ЕжемесячныйПлатеж;
		СрокКредита = ЗаявкаНаКредит.Срок;
		ПервоначальныйВзносСумма = ЗаявкаНаКредит.ПервоночальныйВзнос;
		ПервоначальныйВзносПроцент = ЗаявкаНаКредит.ПервоночальныйВзносПроцент;
		КредитноеПредложение = ЗаявкаНаКредит.КредитноеПредложение;
		
		ИнтересовалсяКредитом = истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаКредитПриИзменении(Элемент)
	
	ЗагрузитьЗаявкуНаКредит();
	ЗаявкаНаКредитОчисткаСервер();
	
КонецПроцедуры

&НаСервере
процедура ЗаявкаНаКредитОчисткаСервер() экспорт
	
	Если НЕ ЗначениеЗаполнено(ЗаявкаНаКредит) Тогда
		
		СоздаватьЗаявкуНаКредит = Ложь;
		Элементы.СоздаватьЗаявкуНаКредит.Доступность = Истина;
		
	иначе
		
		ИнтересовалсяКредитом = истина;
		
		Элементы.СоздаватьЗаявкуНаКредит.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаКредитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Форма = Документы.Renault_CRM_ЗаявкаНаКредит.ПолучитьФорму("Документ.Renault_CRM_ЗаявкаНаКредит.ФормаВыбора");
	Форма.Отбор.Клиент.ВидСравнения = ВидСравнения.Равно;
	Форма.Отбор.Клиент.Значение = ТекущийКлиент;
	Форма.Отбор.Клиент.Использование = Истина;
	Форма.Отбор.Черновик.ВидСравнения = ВидСравнения.Равно;
	Форма.Отбор.Черновик.Значение = ложь;
	Форма.Отбор.Черновик.Использование= Истина;
	Форма.Отбор.Закрыта.ВидСравнения = ВидСравнения.Равно;
	Форма.Отбор.Закрыта.Значение = ложь;
	Форма.Отбор.Закрыта.Использование = Истина;
	Форма.Отбор.ПометкаУдаления.Значение = Ложь;
	Форма.Отбор.ПометкаУдаления.Использование = Истина;
	Форма.РежимВыбора = истина;
	
	Итог = Форма.ОткрытьМодально();
	ЗаявкаНаКредитВыборСервер(Итог);
	ЗаявкаНаКредитОчисткаСервер();
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаСервере
процедура ЗаявкаНаКредитВыборСервер(Значение) экспорт
	
	ЗаявкаНаКредит = Значение;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаявкаНаКредитОчистка(Элемент, СтандартнаяОбработка)
	ЗаявкаНаКредитОчисткаСервер();
КонецПроцедуры

&НаСервере 
Функция СоздатьНайтиЗаявкуНаГарантию()
	
	ЗначениеПустое = Ложь;
	Если ЗначениеЗаполнено(ЗаявкаНаГарантию) Тогда
		ДокОб = ЗаявкаНаГарантию.Ссылка.ПолучитьОбъект();
	ИначеЕсли ЗначениеЗаполнено(ПродленнаяГарантия)Или ЗначениеЗаполнено(ГарантияСумма) Тогда
		ДокОб = Документы.Renault_CRM_ЗаявкаНаГарантию.СоздатьДокумент();
		ДокОб.Статус = Перечисления.Renault_CRM_СтатусЗаявокНаГарантию.Черновик;
	Иначе
		ДокОб = Документы.Renault_CRM_ЗаявкаНаГарантию.ПустаяСсылка();
		ЗначениеПустое = Истина;
	КонецЕсли;
	
	Если Не(ЗначениеПустое) И (не(ДокОб = неопределено)) Тогда
		МожноСохранить = Ложь;
		Если НЕ ДокОб.ЭтоНовый() Тогда
			Если Не ДокОб.ВыполненаУспешно Тогда
				МожноСохранить = Истина;
			КонецЕсли;
		Иначе
			МожноСохранить = Истина;
		КонецЕсли;
		Если МожноСохранить тогда
			ДокОб.Версия = Версия;
			ДокОб.Дата = ТекущаяДата();
			ДокОб.Клиент = Метаданные.Документы.Renault_CRM_ЗаявкаНаГарантию.Реквизиты.Клиент.Тип.ПривестиЗначение(ТекущийКлиент);
			//ДокОб.Комментарий = ТрейдИнКомментарий;
			ДокОб.Модель = Модель;
			ДокОб.РабочийЛист = ТекущийРабочийЛист;
			ДокОб.Сумма = ГарантияСумма;
			ДокОб.Цвет = Цвет;
			ДокОб.ПродленнаяГарантия = ПродленнаяГарантия;
			ДокОб.ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
			ДокОб.Записать(РежимЗаписиДокумента.Проведение);
			ЗаявкаНаГарантию = ДокОб.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДокОб.Ссылка;
	
КонецФункции

&НаСервере
процедура ЗагрузитьЗаявкуНаГарантию()
	
	Если ЗначениеЗаполнено(ЗаявкаНаГарантию) Тогда
		
		ПродленнаяГарантия = ЗаявкаНаГарантию.ПродленнаяГарантия;
		ГарантияСумма = ЗаявкаНаГарантию.Сумма;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьНайтиЗаявкуНаОборудование(ОбъектКП)
	
	//Заявку не создаем, сохраняем данные в КП
	
	ОбъектКП.Оборудование.Очистить();
	
	Для Каждого Строка Из ВыбранноеОборудование Цикл
		НовСтр = ОбъектКП.Оборудование.Добавить();
		НовСтр.Оборудование = Строка.Номенклатура;
		НовСтр.Количество = Строка.Количество;
		НовСтр.Цена = Строка.Цена;
		НовСтр.Сумма = Строка.Сумма;
		НовСтр.Обязательное=Строка.Обязательное;
	КонецЦикла;
	
	Для Каждого Строка Из ВыбранныеАвтоработы Цикл
		НовСтр = ОбъектКП.Оборудование.Добавить();
		НовСтр.Оборудование = Строка.Номенклатура;
		НовСтр.Количество = Строка.Количество;
		НовСтр.Цена = Строка.Цена;
		НовСтр.Сумма = Строка.Сумма;
	КонецЦикла;
	
	////В предыдущей версии создавали заявку
	//
	//ЗначениеПустое = Ложь;
	//Если ЗначениеЗаполнено(ЗаявкаНаОборудование) Тогда
	//	ДокОб = ЗаявкаНаОборудование.Ссылка.ПолучитьОбъект();
	//ИначеЕсли ВыбранноеОборудование.Количество() > 0
	//	ИЛИ ВыбранныеАвтоработы.Количество() > 0 Тогда
	//	ДокОб = Документы.CRM_ЗаявкаНаДилерскиеОпции.СоздатьДокумент();
	//	ДокОб.Статус = Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.Черновик;
	//Иначе
	//	ДокОб = Документы.CRM_ЗаявкаНаДилерскиеОпции.ПустаяСсылка();
	//	ЗначениеПустое = Истина;
	//КонецЕсли;
	//
	//Если Не(ЗначениеПустое) И (Не(ДокОб = неопределено)) Тогда
	//	МожноСохранить = Ложь;
	//	Если НЕ ДокОб.ЭтоНовый() Тогда
	//		//Если Не ДокОб.ВыполненаУспешно Тогда
	//		   МожноСохранить = Истина;
	//		//КонецЕсли;
	//	Иначе
	//		МожноСохранить = Истина;
	//	КонецЕсли;
	//	Если МожноСохранить И СоздаватьЗаявкуНаОборудование тогда
	//		
	//		ДокОб.Комплектация = Версия;
	//		ДокОб.Дата = ТекущаяДата();
	//		ДокОб.Клиент = Метаданные.Документы.CRM_ЗаявкаНаДилерскиеОпции.Реквизиты.Клиент.Тип.ПривестиЗначение(ТекущийКлиент);
	//		ДокОб.Автомобиль = Автомобиль;
	//		//ДокОб.Комментарий = ТрейдИнКомментарий;
	//		ДокОб.Модель = Модель;
	//		ДокОб.РабочийЛист = ТекущийРабочийЛист;
	//		//ДокОб.Сумма = ГарантияСумма;
	//		ДокОб.Цвет = Цвет;
	//		//ДокОб.ПродленнаяГарантия = ПродленнаяГарантия;
	//		ДокОб.ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
	//		ДокОб.ДопОпции.Очистить();
	//		ДокОб.Автоработы.Очистить();
	//		
	//		Для Каждого Оборудование Из ВыбранноеОборудование Цикл
	//			
	//			НовСтрока = ДокОб.ДопОпции.Добавить();
	//			ЗаполнитьСтрокуТЧЗаявкиНаОборудование(НовСтрока, Оборудование);
	//			
	//		КонецЦикла;
	//		
	//		Для Каждого Авторабота Из ВыбранныеАвтоработы Цикл
	//			
	//			НовСтрока = ДокОб.Автоработы.Добавить();
	//			ЗаполнитьСтрокуТЧЗаявкиНаОборудование(НовСтрока, Авторабота);
	//			
	//		КонецЦикла;
	//		
	//		ДокОб.Записать(РежимЗаписиДокумента.Проведение);
	//		ЗаявкаНаОборудование = ДокОб.Ссылка;
	//		
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Возврат ДокОб.Ссылка;
	
КонецФункции

&НаСервере
процедура ЗагрузитьЗаявкуНаОборудование()
	
	Если ИнтересовалсяОборудованием тогда
		
		ВыбранноеОборудование.Очистить();
		
		Для Каждого Стр Из ТекущееКП.Оборудование Цикл
			
			НовСтрока  = ВыбранноеОборудование.Добавить();
			НовСтрока.Номенклатура = Стр.Оборудование;
			НовСтрока.Количество = Стр.Количество;
			НовСтрока.Сумма = Стр.Цена;
			НовСтрока.Цена = Стр.Сумма;
			НовСтрока.Обязательное = Стр.Обязательное;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуТЧЗаявкиНаОборудование(НовСтрока, Данные)
	
	НовСтрока.Выбрана = истина;
	Если ТипЗнч(Данные.Номенклатура) = Тип("Строка") Тогда
		Если ТипЗнч(НовСтрока) = Тип("ДокументТабличнаяЧастьСтрока.CRM_ЗаявкаНаДилерскиеОпции.ДопОпции") Тогда
			НовСтрока.ПсевдоОпция = Данные.Номенклатура;
		Иначе
			НовСтрока.ПсевдоАвторабота = Данные.Номенклатура;
		КонецЕсли;
		НовСтрока.ПсевдоСумма = Данные.Сумма;
		НовСтрока.Сумма = НовСтрока.ПсевдоСумма;
		НовСтрока.ПсевдоКоличество = Данные.Количество;
		НовСтрока.Цена = Данные.Цена;
		Если ЗначениеЗаполнено(НовСтрока.ПсевдоКоличество) Тогда
			НовСтрока.Количество = НовСтрока.ПсевдоКоличество;
		Иначе
			НовСтрока.Количество = 1;
		КонецЕсли;
	Иначе
		Если ТипЗнч(НовСтрока) = Тип("ДокументТабличнаяЧастьСтрока.CRM_ЗаявкаНаДилерскиеОпции.ДопОпции") Тогда
			НовСтрока.ПсевдоОпция = Строка(Данные.Номенклатура);
		Иначе
			НовСтрока.ПсевдоАвторабота = Строка(Данные.Номенклатура);
		КонецЕсли;
		НовСтрока.ПсевдоСумма = Данные.Сумма;
		НовСтрока.ПсевдоКоличество = Данные.Количество;
		Если ТипЗнч(НовСтрока) = Тип("ДокументТабличнаяЧастьСтрока.CRM_ЗаявкаНаДилерскиеОпции.ДопОпции") Тогда
			НовСтрока.Опция = Данные.Номенклатура;
		Иначе
			НовСтрока.Авторабота = Данные.Номенклатура;
		КонецЕсли;
		НовСтрока.Цена = Данные.Цена;
		НовСтрока.Сумма = Данные.Сумма;
		НовСтрока.Количество = Данные.Количество;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
процедура ЗаявкаНаОборудованиеОчисткаСервер() экспорт
	
	Если НЕ ЗначениеЗаполнено(ЗаявкаНаОборудование)  Тогда
		
		СоздаватьЗаявкуНаОборудование = Ложь;
		Элементы.СоздаватьЗаявкуНаОборудование.Доступность = Истина;
		
	Иначе
		
		ИнтересовалсяОборудованием = Истина;
		
		Элементы.СоздаватьЗаявкуНаОборудование.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаОборудованиеПриИзменении(Элемент)
	
	//ЗагрузитьЗаявкуНаОборудование();
	//ЗаявкаНаОборудованиеОчисткаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаОборудованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//Форма = Документы.CRM_ЗаявкаНаДилерскиеОпции.ПолучитьФорму("Документ.CRM_ЗаявкаНаДилерскиеОпции.Форма.ФормаСпискаДокументов");
	//Форма.Отбор.Клиент.ВидСравнения = ВидСравнения.Равно;
	//Форма.Отбор.Клиент.Значение = ТекущийКлиент;
	//Форма.Отбор.Клиент.Использование = Истина;
	//Форма.Отбор.Черновик.ВидСравнения = ВидСравнения.Равно;
	//Форма.Отбор.Черновик.Значение = ложь;
	//Форма.Отбор.Черновик.Использование = Истина;
	//Форма.Отбор.Закрыта.ВидСравнения = ВидСравнения.Равно;
	//Форма.Отбор.Закрыта.Значение = ложь;
	//Форма.Отбор.Закрыта.Использование = Истина;
	//Форма.Отбор.ПометкаУдаления.Значение = Ложь;
	//Форма.Отбор.ПометкаУдаления.Использование = Истина;
	//Форма.РежимВыбора = истина;
	//
	//Итог = Форма.ОткрытьМодально();
	//ЗаявкаНаОборудованиеВыборСервер(Итог);
	//ЗагрузитьЗаявкуНаОборудование();
	//ЗаявкаНаОборудованиеОчисткаСервер();
	//
	//СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаОборудованиеОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаявкаНаОборудованиеОчисткаСервер();
	
КонецПроцедуры

&НаСервере
процедура ЗаявкаНаОборудованиеВыборСервер(Значение) экспорт
	
	ЗаявкаНаОборудование = Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКомплекты(Команда)
	
	Перем Список;
	//Cписок = ПолучитьСписокЗначенийКомплектов();
	Перем Массив;
	Массив = ПолучитьСписокЗначенийКомплектов();
	Если Массив.Количество() = 0 Тогда
		Предупреждение("Для выбранной комплектации автомобиля не назначены комплекты!");
	Иначе
		Список = Новый СписокЗначений;
		Для Каждого Элемент Из Массив Цикл
			Список.Добавить(Элемент.Значение, Элемент.Ключ);
		КонецЦикла;
		Список.ОтметитьЭлементы("Отметьте нужные опции");
		ЗаполнитьпоСписку(Список);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокЗначенийКомплектов()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ОпцииВариантовКомплектации.Опция,
	|	ОпцииВариантовКомплектации.Количество,
	|	ОпцииВариантовКомплектации.ЦенаЗакупки
	|ИЗ
	|	РегистрСведений.ОпцииВариантовКомплектации КАК ОпцииВариантовКомплектации
	|ГДЕ
	|	ОпцииВариантовКомплектации.ВариантКомплектации = &ВариантКомплектации
	|	И ОпцииВариантовКомплектации.ВидВключения = 0");
	Запрос.УстановитьПараметр("ВариантКомплектации", Версия);
	Таблица = Запрос.Выполнить().Выгрузить();
	//СписокВыбора = Новый СписокЗначений;
	МассивВыбора = Новый Массив;
	
	Для каждого Опция из Таблица Цикл
		ТекЦена = 0;
		Оп = Новый Структура();
		Если ТипЗнч(Опция.Опция) = Тип("СправочникСсылка.Опции") Тогда
			Оп.Вставить("Номенклатура", Строка(Опция.Опция));
			
		Иначе
			Оп.Вставить("Номенклатура", Опция.Опция);
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ТипЦен", ТипЦенКП);
			Запрос.УстановитьПараметр("Номенклатура", Опция.Опция);
			Запрос.Текст = "ВЫБРАТЬ
			|	ЦеныСрезПоследних.Цена
			|ИЗ
			|	РегистрСведений.Цены.СрезПоследних(
			|			,
			|			ТипЦен = &ТипЦен
			|				И Номенклатура = &Номенклатура) КАК ЦеныСрезПоследних";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Оп.Вставить("Цена", Выборка.Цена);
				ТекЦена = Выборка.цена;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Опция.Количество > 1 Тогда
			Оп.Вставить("Количество", Опция.Количество);
			Оп.Вставить("Сумма",Опция.Количество * ТекЦена);
		Иначе
			Оп.Вставить("Количество", 1);
			Оп.Вставить("Сумма", ТекЦена);
		КонецЕсли;
		
		//СписокВыбора.Добавить(Оп, Опция.Опция.Наименование);
		ЭлементВыбора = Новый Структура;
		ЭлементВыбора.Вставить("Ключ", Опция.Опция.Наименование);
		ЭлементВыбора.Вставить("Значение", Оп);
		МассивВыбора.Добавить(ЭлементВыбора);
		
		
	КонецЦикла;
	
	//Возврат СписокВыбора;
	Возврат МассивВыбора;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьпоСписку(Список)
	
	Для каждого Эл из Список Цикл
		Если Эл.Пометка Тогда
			
			Если ТипЗнч(Эл.Значение.Номенклатура) <> Тип("Строка") Тогда
				Состав = Эл.Значение.Номенклатура.СоставНабора;
				Если Состав.Количество() Тогда
					Для Каждого ЭлементНабора ИЗ Состав Цикл
						НовСтрока = ВыбранноеОборудование.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтрока, ЭлементНабора);
						
						Запрос = Новый Запрос;
						Запрос.УстановитьПараметр("ТипЦен", ТипЦенКП);
						Запрос.УстановитьПараметр("Номенклатура", НовСтрока.Номенклатура);
						Запрос.Текст = "ВЫБРАТЬ
						|	ЦеныСрезПоследних.Цена
						|ИЗ
						|	РегистрСведений.Цены.СрезПоследних(
						|			,
						|			ТипЦен = &ТипЦен
						|				И Номенклатура = &Номенклатура) КАК ЦеныСрезПоследних";
						Выборка = Запрос.Выполнить().Выбрать();
						Если Выборка.Следующий() Тогда
							НовСтрока.Цена = Выборка.цена;
							НовСтрока.Сумма = НовСтрока.Цена * НовСтрока.Количество;
						КонецЕсли;
						
					КонецЦикла;
				Иначе
					НовСтрока = ВыбранноеОборудование.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрока, Эл.Значение);
				КонецЕсли;
			Иначе
				НовСтрока = ВыбранноеОборудование.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрока, Эл.Значение);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСклад(Команда)
	//Корзюков начало

	ДилерскийЦентрПользователя = Renault_РаботаСПравамиПользователя.ДилерскийЦентрПоУмолчанию(ПараметрыСеанса.Пользователь);
		
		Если Не ЗначениеЗаполнено(ДилерскийЦентрПользователя) Тогда
			#Если Клиент Тогда
				Предупреждение("Для пользователя не задан дилерский центр!");
			#конецЕсли
			Возврат;
		КонецЕсли;
		
		// Беседин 17.11.21 изменил условие обратно заявка 1389
		Если ДилерскийЦентрПользователя.Автосклад_ИспользоватьНовуюФормуСклада = Истина Тогда  //Блинков  Если Стоит использование Новой формы но при этом запускается в режимеобычного приложения выходит ошибка
		//Если  ТекущийРежимЗапуска() = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение Тогда	 //Блинков Следовательно было изменено условие DMSREN-739
			//Обр = Обработки.Renault_АРМ_Автосклад_Упр.Создать();
			//Обр.Клиент = ТекущийКлиент;
			//Обр.НомерРабочегоЛиста = ТекущийРабочийЛист;    
			//Обр.ПолучитьФорму("ФормаДинамическийСписок").Открыть();
			ПараметрыФормы = Новый Структура("Клиент, НомерРабочегоЛиста", ТекущийКлиент, ТекущийРабочийЛист);
			ОткрытьФорму("Обработка.Renault_АРМ_Автосклад_Упр.Форма.ФормаДинамическийСписок", ПараметрыФормы);
			
		Иначе
			Обр = Обработки.Renault_АРМ_Автосклад.Создать();
			Обр.Клиент = ТекущийКлиент;
			Обр.НомерРабочегоЛиста = ТекущийРабочийЛист;
			Обр.ПолучитьФорму().Открыть();
		КонецЕсли;
     //Корзюков конец

	//Обр = Обработки.Renault_АРМ_Автосклад.Создать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВРежимСвободногоРедактирования(Команда)
	Автомобиль = Неопределено;
	ПриОткрытииСервер();
	Элементы.ПолеМодель.Видимость = Ложь;
	Элементы.ПолеКомплектация.Видимость = Ложь;
	Элементы.ПолеЦвет.Видимость = Ложь;
	VIN = "";
	ОбновитьРежимРедактирования();
КонецПроцедуры

&НаКлиенте 
Процедура ОбновитьРежимРедактирования()
	
	Если ЗначениеЗаполнено(Автомобиль) Тогда
		//Нет свободного редактирования		
		
		//ограничение доступности
		Элементы.ГруппаКомплектация.Доступность = Ложь;
		//Элементы.ВыбранныеНебазовыеОпции.Доступность = Ложь;
		Элементы.ВыбранныеНебазовыеОпции.ТолькоПросмотр = Истина;
		
		//видимость элементов
		Элементы.КнопкаПерейтиВРежимСвободногоРедактирования.Видимость = Истина;
		
		//выделение цветом
		Элементы.ТаблицаКомплектации.ЦветФона = Новый Цвет(248, 242, 216);
		Элементы.ТаблицаМодели.ЦветФона = Новый Цвет(248, 242, 216);
		Элементы.ТаблицаЦвета.ЦветФона = Новый Цвет(248, 242, 216);
		Элементы.ВыбранныеНебазовыеОпции.ЦветФона = Новый Цвет(248, 242, 216);
		
	Иначе
		//Свободное редактирование		
		
		//ограничение доступности
		Элементы.ГруппаКомплектация.Доступность = Истина;
		//Элементы.ВыбранныеНебазовыеОпции.Доступность = Истина;
		Элементы.ВыбранныеНебазовыеОпции.ТолькоПросмотр = Ложь;
		
		//видимость элементов
		Элементы.КнопкаПерейтиВРежимСвободногоРедактирования.Видимость = Истина;
		
		//выделение цветом
		Элементы.ТаблицаКомплектации.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ТаблицаМодели.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ТаблицаЦвета.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ВыбранныеНебазовыеОпции.ЦветФона = Новый Цвет(255, 255, 255);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция РазослатьСообщение(ТемаСообщения, ТекстСообщения, МассивАдресовРассылки, УчетнаяЗапись,ПредставлениеОтправителя, МассивПутейКПрикрепляемымФайлам) Экспорт
	
	Для Каждого АдресРассылки Из МассивАдресовРассылки Цикл
		
		Попытка
			
			Профиль = Новый ИнтернетПочтовыйПрофиль;		
			
			Профиль.АдресСервераPOP3   = УчетнаяЗапись.POP3Сервер;
			Профиль.ПортPOP3           = УчетнаяЗапись.ПортPOP3;
			Профиль.АутентификацияPOP3 = эпПреобразоватьВСпособPOP3Аутентификации(УчетнаяЗапись.АутентификацияPOP3);
			Профиль.Пользователь       = УчетнаяЗапись.Логин;
			Профиль.Пароль             = УчетнаяЗапись.Пароль;
			Профиль.ИспользоватьSSLPOP3 = УчетнаяЗапись.ИспользоватьPOPSSL;
			
			Профиль.АдресСервераSMTP   = УчетнаяЗапись.SMTPСервер;
			Профиль.ПортSMTP           = УчетнаяЗапись.ПортSMTP;
			Профиль.АутентификацияSMTP = эпПреобразоватьВСпособSMTPАутентификации(УчетнаяЗапись.АутентификацияSMTP);
			Профиль.ПользовательSMTP   = УчетнаяЗапись.ЛогинSMTP;
			Профиль.ПарольSMTP         = УчетнаяЗапись.ПарольSMTP;
			Профиль.POP3ПередSMTP      = УчетнаяЗапись.POP3ПередSMTP;
			Профиль.ИспользоватьSSLSMTP = УчетнаяЗапись.ИспользоватьSMTPSSL;
			
			Если УчетнаяЗапись.ВремяОжиданияСервера > 0 Тогда
				Профиль.ВремяОжидания = УчетнаяЗапись.ВремяОжиданияСервера;
			КонецЕсли; 
			
			ИнтернетПочта = Новый ИнтернетПочта;  		
			
			Попытка
				ИнтернетПочта.Подключиться(Профиль);
				Письмо =  СоздатьПисьмо(ТемаСообщения, ТекстСообщения, АдресРассылки, УчетнаяЗапись,ПредставлениеОтправителя, МассивПутейКПрикрепляемымФайлам);
				ИнтернетПочта.Послать(Письмо);
			Исключение
				//Сообщить(элРазобратьОшибкуПочтовогоСоединения(), СтатусСообщения.Важное);
				//Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
				//Предупреждение("Произошли ошибки при проверке настроек учетной записи.
				//|Описание ошибки приведено в окне сообщения.");
				Возврат Ложь;
				
			КонецПопытки; 		
			
			//РежимОбмена = Новый Структура();
			//РежимОбмена.Вставить("Получить",Ложь);
			//РежимОбмена.Вставить("Отправить",Истина);
			//ПочтовыйЯщик = эпПодключитьсяКПочтовомуСерверу(УчетнаяЗапись,РежимОбмена);
			//  
			//УчетнаяЗапись= Справочники.УчетныеЗаписиЭлектроннойПочты.СоздатьЭлемент().
			//ПочтовыйЯщик.Послать(Письмо);
		Исключение
			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;
	Возврат истина;
	
КонецФункции

&НаСервере

Функция ВернутьВыгружаемыеФайлы(ТекущееКП)
	Запрос = Новый ЗАпрос;
	ЗАпрос.Текст = "ВЫБРАТЬ
	               |	Renault_КартинкиИФайлы.Наименование,
	               |	Renault_КартинкиИФайлы.ИмяФайла,
	               |	Renault_КартинкиИФайлы.Данные,
	               |	Renault_КартинкиИФайлы.ДанныеВоВнешнемФайле
	               |ИЗ
	               |	РегистрСведений.Renault_КартинкиИФайлы КАК Renault_КартинкиИФайлы
	               |ГДЕ
	               |	Renault_КартинкиИФайлы.Объект = &Объект
	               |	И Renault_КартинкиИФайлы.ВыгружатьПоЭлектроннойПочте";
	Запрос.УстановитьПараметр("Объект",ТекущееКП);
	Выборка = ЗАпрос.Выполнить().Выбрать();
	Рез = Новый Массив;
	Пока Выборка.Следующий() цикл
		СтрокаРез = Новый Структура("Наименование,ИмяФайла,Данные,ДанныеВоВнешнемФайле");
		ЗаполнитьЗначенияСвойств(СтрокаРез,Выборка);
		Рез.Добавить(СтрокаРез);
	КонецЦикла;	
	Возврат Рез;
КонецФункции

&НаКлиенте

Функция ВернутьРасшиерениеИзИмениФайла(ИмяФайла)
	ПозицияТочки = СтрНайти(ИмяФайла,".",НаправлениеПоиска.СКонца);
	Если ПозицияТочки<>0 тогда
		Возврат Сред(ИмяФайла,ПозицияТочки);
	КонецЕсли;
	Возврат "";
КонецФункции	
	
&НаКлиенте
Функция СоздатьПисьмо(Тема, ТекстСообщения, Получатель, Отправитель,ПредставлениеОтправителя, ПутиКФайлам) Экспорт
	Сообщение = новый ИнтернетПочтовоеСообщение;
	//Сообщение.ДатаОтправления =ТекущаяДата();
	Сообщение.Тема = Тема;
	Сообщение.Тексты.Добавить(ТекстСообщения);
	Сообщение.Получатели.Добавить(Получатель);	
	Сообщение.Отправитель.Адрес = Отправитель.АдресЭлектроннойПочты;
	Сообщение.Отправитель.ОтображаемоеИмя =ПредставлениеОтправителя;// "Рассылка комерческих предложений(автомат)";
	Для Каждого ПутьКФайлу Из ПутиКФайлам Цикл
		Сообщение.Вложения.Добавить(ПутьКФайлу,"Комерческое предложение");
	КонецЦикла;
	Рег 	= ВернутьВыгружаемыеФайлы(ТекущееКП);
	Филе 	= Новый Файл;
	Для Каждого ТекФайл из Рег цикл
		ИмяФайла = ПолучитьИмяВременногоФайла(ВернутьРасшиерениеИзИмениФайла(ИмяФайла));
		Если ТекФайл.ДанныеВоВнешнемФайле тогда
			Сообщение.Вложения.Добавить(ИмяФайла,ТекФайл.Наименование);
		Иначе
			Файл = ТекФайл.Данные.Получить();
			Если ТипЗнч(Файл) = Тип("Картинка") Тогда
				Файл.Записать(ИмяФайла);
			ИначеЕсли ТипЗнч(Файл) = Тип("ДвоичныеДанные") Тогда
				Файл.Записать(ИмяФайла);
			Иначе
				ЗначениеВФайл(ИмяФайла, Файл);
			КонецЕсли;
			Сообщение.Вложения.Добавить(ПутьКФайлу,ТекФайл.Наименование);
		КонецЕсли;		
	КонецЦикла;	
	Возврат Сообщение;
	
КонецФункции

&НаКлиенте
Процедура ОтправитьКП(Команда)
	
	//Если ЗначениеЗаполнено(ТекущееКП)И ЗначениеЗаполнено(Email)И ЗначениеЗаполнено(РассылкаУчетнаяЗапись) Тогда
	Если ЗначениеЗаполнено(ТекущееКП) Тогда
		
		МассивПутейКФайламКп = Новый Массив();
		ТабДок = Новый ТабличныйДокумент();
		МассивДок = Новый Массив();
		МассивДок.Добавить(ТекущееКП.Ссылка);
		Документы.CRM_КоммерческоеПредложение.Печать(МассивДок, ТабДок, "ПФ_MXL_КП");
		ИмяФайла = ПолучитьИмяВременногоФайла("PDF");
		ТабДок.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.PDF);
		МассивПутейКФайламКп.Добавить(ИмяФайла); 
		Адресаты = Новый Массив();
		Адресаты.Добавить(Email);
		ЗаполненныйТекстСообщения = ЗаполнитьТекстЕмаилаПараметрами(РассылкаТекстСоообщения);
		Ответ =	РазослатьСообщение(РассылкаТемаСообщения,ЗаполненныйТекстСообщения,Адресаты,
		РассылкаУчетнаяЗапись,РассылкаПредставление,МассивПутейКФайламКп);
		
		Если Ответ = Истина Тогда
			Предупреждение("Сообщение отправлено");
		Иначе
			Предупреждение("Не удалось отправить сообщение, обратитесь в поддержку");
		КонецЕсли;
		
	Иначе
		Предупреждение("Необходимо сохранить предложение, заполнить email и указать учетную запись электронной почты");	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаявкаНаСтраховкуОчисткаСервер() Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЗаявкаНаСтраховку)  Тогда
		
		СоздаватьЗаявкуНаСтраховку = Ложь;
		
	Иначе
		
		ИнтересовалсяСтраховкой = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаСтраховкуОчистка(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ЗаявкаНаСтраховкуОчисткаСервер();
КонецПроцедуры

&НаСервере
процедура ЗагрузитьЗаявкуНаСтраховку()
	
	Если ЗначениеЗаполнено(ЗаявкаНаСтраховку) тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_CRM_ЗаявкаНаСтраховку.ВидСтраховойПрограммы,
		//|	Renault_CRM_ЗаявкаНаСтраховку.СтраховаяПрограмма КАК СтраховаяПрограмма,
		|	Renault_CRM_ЗаявкаНаСтраховку.Ссылка.Комментарий КАК Комментарий,
		|	Renault_CRM_ЗаявкаНаСтраховку.Сумма КАК Сумма
		|ИЗ
		|	Документ.Renault_CRM_ЗаявкаНаСтраховку КАК Renault_CRM_ЗаявкаНаСтраховку
		|ГДЕ
		|	Renault_CRM_ЗаявкаНаСтраховку.Ссылка = &Ссылка
		//|	И Renault_CRM_ЗаявкаНаСтраховку.ВидСтраховойПрограммы = ЗНАЧЕНИЕ(Справочник.Удалить_CRM_ВидыСтраховыхПрограмм.Каско)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Renault_CRM_ЗаявкаНаСтраховку.ВидСтраховойПрограммы,
		//|	Renault_CRM_ЗаявкаНаСтраховку.СтраховаяПрограмма,
		|	Renault_CRM_ЗаявкаНаСтраховку.Ссылка.Комментарий,
		|	Renault_CRM_ЗаявкаНаСтраховку.Сумма
		|ИЗ
		|	Документ.Renault_CRM_ЗаявкаНаСтраховку КАК Renault_CRM_ЗаявкаНаСтраховку
		|ГДЕ
		|	Renault_CRM_ЗаявкаНаСтраховку.Ссылка = &Ссылка
		|	И Renault_CRM_ЗаявкаНаСтраховку.ВидСтраховойПрограммы = ЗНАЧЕНИЕ(Справочник.Удалить_CRM_ВидыСтраховыхПрограмм.Осаго)";
		Запрос.УстановитьПараметр("Ссылка", ЗаявкаНаСтраховку);
		
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл
			Если Результат.ВидСтраховойПрограммы = Справочники.CRM_ВидыСтраховыхПрограмм.Осаго Тогда
				СтраховкаОСАГОВключать = Истина;
				//СтраховкаОСАГОПрограмма = Результат.СтраховаяПрограмма;
				СтраховкаОСАГОСумма = Результат.Сумма;
			ИначеЕсли Результат.ВидСтраховойПрограммы = Справочники.CRM_ВидыСтраховыхПрограмм.Каско Тогда
				СтраховкаКАСКОВключать = Истина;
				//СтраховкаКАСКОПрограмма = Результат.СтраховаяПрограмма;
				СтраховкаКАСКОСумма = Результат.Сумма;
			КонецЕсли;
		КонецЦикла;
		СтажВождения = ЗаявкаНаСтраховку.СтажВождения;
		Возраст = ЗаявкаНаСтраховку.ВозрастКлиента;
	КонецЕсли;
	
КонецПроцедуры

Функция СоздатьНайтиЗаявкуНаСтраховку()
	
	ЗначениеПустое = Ложь;
	Если ЗначениеЗаполнено(ЗаявкаНаСтраховку) Тогда
		ДокОб = ЗаявкаНаСтраховку.Ссылка.ПолучитьОбъект();
	ИначеЕсли СоздаватьЗаявкуНаСтраховку Тогда
		ДокОб = Документы.Renault_CRM_ЗаявкаНаСтраховку.СоздатьДокумент();
		ДокОб.Статус = Перечисления.Renault_CRM_СтатусЗаявокНаСтраховку.Черновик;
	Иначе
		ДокОб = Документы.Renault_CRM_ЗаявкаНаСтраховку.ПустаяСсылка();
		ЗначениеПустое = Истина;
	КонецЕсли;
	
	Если Не(ЗначениеПустое)Или ИнтересовалсяСтраховкой Тогда
		МожноСохранить = Ложь;
		Если ТипЗнч(ДокОб) = Тип("ДокументОбъект.Renault_CRM_ЗаявкаНаСтраховку") И НЕ ДокОб.ЭтоНовый() Тогда
			Если ДокОб.Статус = Перечисления.Renault_CRM_СтатусЗаявокНаСтраховку.Черновик Тогда
				МожноСохранить = Истина;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ДокОб) = Тип("ДокументОбъект.Renault_CRM_ЗаявкаНаСтраховку") Тогда 
			МожноСохранить = Истина;
		КонецЕсли;
		Если МожноСохранить тогда
			ДокОб.Версия = Версия;
			ДокОб.Комментарий = СтраховкаКомментарий;
			ДокОб.Дата = ТекущаяДата();
			ДокОб.Клиент = Метаданные.Документы.Renault_CRM_ЗаявкаНаСтраховку.Реквизиты.Клиент.Тип.ПривестиЗначение( ТекущийКлиент);
			//ДокОб.Комментарий = ТрейдИнКомментарий;
			ДокОб.Модель = Модель;
			ДокОб.РабочийЛист = ТекущийРабочийЛист;
			ДокОб.ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
			ДокОб.Статус = Перечисления.Renault_CRM_СтатусЗаявокНаСтраховку.Черновик;
			//ДокОб.Автомобиль = Автомобиль;
			//ДокОб.ЦенаАвтомобиля = ЦенаИТОГО;
			//ДокОб.НадписьЦена = ПолучитьОписаниеЦены ();
			ДокОб.ХозОперация = Справочники.ХозОперации.ПрочиеДокументы;
			//ДокОб.Автор = ПараметрыСеанса.Пользователь;
			//ДокОб.Операция = Перечисления.Renault_ВидыОперацийСтрахования.ПервичныйРасчет;
			ДокОб.ВозрастКлиента = Возраст;
			ДокОб.СтажВождения = СтажВождения;
			Если СтраховкаОСАГОВключать Тогда
				СтрокаТЗ = ДокОб.ВариантыСтрахования.Найти(Перечисления.ВидыСтрахования.ОСАГО);
				Если СтрокаТЗ = Неопределено Тогда
					СтрокаТЗ = ДокОб.ВариантыСтрахования.Добавить();
					СтрокаТЗ.ВидСтраховойПрограммы = Перечисления.ВидыСтрахования.ОСАГО;
				КонецЕсли;
			иначе
				СтрокаТЗ = ДокОб.ВариантыСтрахования.Найти(Перечисления.ВидыСтрахования.ОСАГО);
				Если СтрокаТЗ <> Неопределено Тогда
					ДокОб.ВариантыСтрахования.Удалить(СтрокаТЗ);
				КонецЕсли;
			КонецЕсли;
			Если СтраховкаКАСКОВключать Тогда
				СтрокаТЗ = ДокОб.ВариантыСтрахования.Найти(Перечисления.ВидыСтрахования.КАСКО);
				Если СтрокаТЗ = Неопределено Тогда
					СтрокаТЗ = ДокОб.ВариантыСтрахования.Добавить();
					СтрокаТЗ.ВидСтраховойПрограммы = Перечисления.ВидыСтрахования.КАСКО;
				КонецЕсли;
			иначе
				СтрокаТЗ = ДокОб.ВариантыСтрахования.Найти(Перечисления.ВидыСтрахования.КАСКО);
				Если СтрокаТЗ <> Неопределено Тогда
					ДокОб.ВариантыСтрахования.Удалить(СтрокаТЗ);
				КонецЕсли;
			КонецЕсли;
			
			//Сергеев DMSREN-1084
			//Если СтраховкаОСАГОВключать Тогда
			//	ДокОб.ВидСтраховойПрограммы = Справочники.CRM_ВидыСтраховыхПрограмм.Осаго;
			//КонецЕсли;
			//Если СтраховкаКАСКОВключать Тогда
			//	ДокОб.ВидСтраховойПрограммы = Справочники.CRM_ВидыСтраховыхПрограмм.Каско;
			//КонецЕсли;
			//--------------------
			
			ДокОб.Записать(РежимЗаписиДокумента.Проведение);
			ЗаявкаНаСтраховку = ДокОб.Ссылка;
			
			Запрос = Новый Запрос("Выбрать 1 Из Задача.Renault_События ГДЕ Объект=&Ссылка");
			Запрос.УстановитьПараметр("Ссылка", ДокОб.Ссылка);
			Результат = Запрос.Выполнить();
			Если Результат.Пустой() Тогда
				Задача = Задачи.Renault_События.СоздатьНовую(ДокОб.Ссылка ,Справочники.CRM_ВидыСобытий.Страховка, Строка(ДокОб.Ссылка));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДокОб.Ссылка;
	
КонецФункции

&НаСервере
Функция ПолучитьОписаниеЦены ()
	
	Возврат 
	"Комплектация: " + Строка(ЦенаВариантаКомплектации) + Символы.ПС +
	"Опции:        " + Строка(ЦенаДопОпций) + Символы.ПС +
	"Оборудование: " + Строка(ЦенаОборудования) + Символы.ПС +
	"Доставка:     " + Строка(СуммаДоставки) + Символы.ПС +
	"Трейд-ин:     " + Строка(ЦенаВыкупа) + Символы.ПС +
	"Пр.гарантия:  " + Строка(ГарантияСумма) + Символы.ПС +
	"Страховка:    " + Строка(СтраховкаОСАГОСумма + СтраховкаКАСКОСумма ) + Символы.ПС +
	?(СуммаСкидки > 0,	"СКИДКА:       " + Строка(СуммаСкидки) + Символы.ПС, "");
	
КонецФункции

&НаКлиенте
Процедура ЗаявкаНаСтраховкуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Форма = Документы.Renault_CRM_ЗаявкаНаСтраховку.ПолучитьФормуВыбора(, Элемент);
	
	Форма.Отбор.Клиент.ВидСравнения = ВидСравнения.Равно;
	Форма.Отбор.Клиент.Значение = ТекущийКлиент;
	Форма.Отбор.Клиент.Использование = Истина;
	
	Форма.Отбор.Закрыта.ВидСравнения = ВидСравнения.Равно;
	Форма.Отбор.Закрыта.Значение = ложь;
	Форма.Отбор.Закрыта.Использование = Истина;
	
	Форма.Отбор.ПометкаУдаления.ВидСравнения = ВидСравнения.Равно;
	Форма.Отбор.ПометкаУдаления.Значение = Ложь;
	Форма.Отбор.ПометкаУдаления.Использование = Истина;
	
	//Козлов Е.А. Начало 14.07.2016
	//Форма.Отбор.Черновик.ВидСравнения = ВидСравнения.Равно;
	//Форма.Отбор.Черновик.Значение = ложь;
	//Форма.Отбор.Черновик.Использование = Истина;
	
	Форма.Отбор.ВидСтраховойПрограммы.ВидСравнения = ВидСравнения.Равно;
	Форма.Отбор.ВидСтраховойПрограммы.Значение = Справочники.Удалить_CRM_ВидыСтраховыхПрограмм.Осаго;
	Форма.Отбор.ВидСтраховойПрограммы.Использование = Истина;
	
	Форма.Отбор.РабочийЛист.ВидСравнения = ВидСравнения.Равно;
	Форма.Отбор.РабочийЛист.Значение = ТекущийРабочийЛист;
	Форма.Отбор.РабочийЛист.Использование = Истина;
	
	Форма.Открыть();
	
	//Форма.РежимВыбора = истина;
	//
	//Итог = Форма.ОткрытьМодально();
	//ЗаявкаНаСтраховкуВыборСервер(Итог);
	//ЗаявкаНаСтраховкуОчисткаСервер();
	//Козлов Е.А. Конец
	
	
КонецПроцедуры

&НаСервере
процедура ЗаявкаНаСтраховкуВыборСервер(Значение) экспорт
	
	ЗаявкаНаСтраховку = Значение;
	
КонецПроцедуры

&НаКлиенте 
Процедура ОбновитьОтображениеГруппПоЗаявкам()
	
	Элементы.ОстальноеКредит.Видимость = ИнтересовалсяКредитом;
	Элементы.ОстальноеСтраховка.Видимость = ИнтересовалсяСтраховкой;
	Элементы.ОстальноеТрейдИн.Видимость = ИнтересовалсяТрейдИн;
	Элементы.ОстальноеДопОборудование.Видимость = ИнтересовалсяОборудованием;
	Элементы.СтажВождения.Видимость = ИнтересовалсяСтраховкой;
	Элементы.Возраст.Видимость = ИнтересовалсяСтраховкой;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтересовалсяОборудованиемПриИзменении(Элемент)
	СоздаватьЗаявкуНаОборудование = ИнтересовалсяОборудованием;	
	ОбновитьОтображениеГруппПоЗаявкам();
КонецПроцедуры

&НаКлиенте
Процедура СоздаватьЗаявкуНаСтраховкуПриИзменении(Элемент)
	ИнтересовалсяСтраховкой = Истина;
	ОбновитьОтображениеГруппПоЗаявкам();
КонецПроцедуры

&НаКлиенте
Процедура СоздаватьЗаявкуНаКредитПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ИнтересовалсяКредитом = Истина;
	ОбновитьОтображениеГруппПоЗаявкам();
КонецПроцедуры

&НаКлиенте
Процедура ИнтересовалсяСтраховкойПриИзменении(Элемент)
	
	СоздаватьЗаявкуНаСтраховку = ИнтересовалсяСтраховкой;
	Если Не ИнтересовалсяСтраховкой Тогда
		ЗаявкаНаСтраховку = Документы.Renault_CRM_ЗаявкаНаСтраховку.ПустаяСсылка();
	КонецЕсли;
	ОбновитьОтображениеГруппПоЗаявкам();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздаватьЗаявкуНаОборудованиеПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ИнтересовалсяОборудованием = Истина;
	ОбновитьОтображениеГруппПоЗаявкам();
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаСтраховкуПриИзменении(Элемент)
	//Козлов Е.А. Начало 14.07.2016
	//// Вставить содержимое обработчика.
	//ЗагрузитьЗаявкуНаСтраховку();
	//ЗаявкаНаСтраховкуОчисткаСервер();
	ОбновитьДанныеПоСтраховке(Истина, Ложь);
	
	ПересчитатьЦенуАвто();
	//Козлов Е.А. Конец
КонецПроцедуры

&НаКлиенте
Процедура СкорректироватьИтоговуюСтоимость(Разница) Экспорт
	
	Если (Разница) > 0 Тогда
		СуммаДоставки = СуммаДоставки+разница;
	ИначеЕсли  (Разница) < 0 Тогда
		СуммаСкидки = -Разница; 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЦенуРОП()
	
	// [ВОРОБЬЕВ]] 01.03.2017 +++
	Если ЗначениеЗаполнено(ТекущееКП) И ТекущееКП.Renaut_ЦенаРОП <> 0 Тогда
		ЦенаРОП = ТекущееКП.Renaut_ЦенаРОП;
		УстановитьРасчетнуюПоЦенеРоп = Истина;
		
		Возврат;
	КонецЕсли;
	// [[ВОРОБЬЕВ]] --- 
	
	Если ЗначениеЗаполнено(Автомобиль) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	CRM_ДополнительнаяИнформацияПоАвтомобилям.ЦенаПродажиРОП
		|ИЗ
		|	РегистрСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям КАК CRM_ДополнительнаяИнформацияПоАвтомобилям
		|ГДЕ
		|	CRM_ДополнительнаяИнформацияПоАвтомобилям.Автомобиль = &Автомобиль");
		Запрос.УстановитьПараметр("Автомобиль",Автомобиль);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЦенаРОП = Выборка.ЦенаПродажиРОП;
		Иначе
			ЦенаРОП = 0;
		КонецЕсли;
		
	Иначе
		ЦенаРОП = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявкуНаПодбор(Команда)
	
	ДокОбъект = СоздатьЗаявкуНаСервере();
	Форма = ДокОбъект.ПолучитьФорму("ФормаДокумента_Менеджер");
	Форма.Открыть();
	
КонецПроцедуры

&НаСервере
Функция СоздатьЗаявкуНаСервере()
	
	// создаем новую заявку
	ЗаявкаДок = Документы.CRM_ЗаявкаНаПодборАвтомобиля.СоздатьДокумент();
	ЗаявкаДок.Менеджер = ПараметрыСеанса.Пользователь.Сотрудник;
	ЗаявкаДок.Модель = Модель;
	ЗаявкаДок.Комплектация = Версия;
	ЗаявкаДок.Цвет = Цвет;
	ЗаявкаДок.РабочийЛист = ТекущийРабочийЛист;
	ЗаявкаДок.Статус = Перечисления.CRM_СтатусыЗаявокАвтосклад.НеПринятаКРаботе;
	Для Каждого СтрокаДоп ИЗ ВыбранныеНебазовыеОпции Цикл
		Если СтрокаДоп.Выбран Тогда
			НоваяДоп = ЗаявкаДок.ДопОпции.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяДоп, СтрокаДоп);
			НоваяДоп.Количество = 1;
			НоваяДоп.Сумма = НоваяДоп.Цена * НоваяДоп.Количество;
		КонецЕсли;
	КонецЦикла;
	Возврат ЗаявкаДок;
	
КонецФункции

// вставка для "Кредитного калькулятора"

&НаСервере
Процедура ПолучитьОптимальноеПредложение()
	
	// получим оптимальное кредитное предложение
	Если ИнтересовалсяКредитом Тогда
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	CRM_КредитныеПредложенияМодели.Ссылка
		//|ПОМЕСТИТЬ Предложения
		//|ИЗ
		//|	Справочник.CRM_КредитныеПредложения.Модели КАК CRM_КредитныеПредложенияМодели
		//|ГДЕ
		//|	
		//|	CRM_КредитныеПредложенияМодели.Модель = &Модель
		//|	И CRM_КредитныеПредложенияМодели.Комплектация = &Комплектация
		//|	И CRM_КредитныеПредложенияМодели.Ссылка.ДляПовторногоКлиента = &ЭтоПовторныйКлиентБанка
		//|	И CRM_КредитныеПредложенияМодели.Ссылка.КлиентCRM = &ЭтоКлиентCRM
		//|	И CRM_КредитныеПредложенияМодели.Выбрана = Истина
		//|	И CRM_КредитныеПредложенияМодели.Ссылка.ДатаНачалаПредложения < &ТекДата
		//|	И CRM_КредитныеПредложенияМодели.Ссылка.ДатаОкончанияПредложения > &ТекДата
		//|
		//|;
		//|
		//|ВЫБРАТЬ ПЕРВЫЕ 10000
		//|	CRM_КредитныеПредложенияСтавки.Ставка_Маркетинговая
		//|ПОМЕСТИТЬ Ставки
		//|ИЗ Справочник.CRM_КредитныеПредложения.КредитныеСтавки КАК CRM_КредитныеПредложенияСтавки
		//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Предложения КАК Предложения
		//|	ПО Предложения.Ссылка = CRM_КредитныеПредложенияСтавки.Ссылка
		//|УПОРЯДОЧИТЬ ПО CRM_КредитныеПредложенияСтавки.Ставка_Маркетинговая ВОЗР
		//|
		//|;
		//|
		//|ВЫБРАТЬ ПЕРВЫЕ 1
		//|	Ставки.Ставка_Маркетинговая
		//|ПОМЕСТИТЬ Ставка
		//|ИЗ Ставки КАК Ставки
		//|
		//|;
		//|
		//|ВЫБРАТЬ ПЕРВЫЕ 10000
		//|	CRM_КредитныеПредложенияСтавки.ПервоначальныйВзносОт
		//|ПОМЕСТИТЬ Взносы
		//|ИЗ Справочник.CRM_КредитныеПредложения.КредитныеСтавки КАК CRM_КредитныеПредложенияСтавки
		//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Предложения КАК Предложения
		//|	ПО Предложения.Ссылка = CRM_КредитныеПредложенияСтавки.Ссылка
		//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Ставка КАК Ставка
		//|	ПО Ставка.Ставка_Маркетинговая = CRM_КредитныеПредложенияСтавки.Ставка_Маркетинговая
		//|УПОРЯДОЧИТЬ ПО CRM_КредитныеПредложенияСтавки.ПервоначальныйВзносОт ВОЗР
		//|
		//|;
		//|
		//|ВЫБРАТЬ ПЕРВЫЕ 1
		//|	Взносы.ПервоначальныйВзносОт
		//|ПОМЕСТИТЬ Взнос
		//|ИЗ Взносы КАК Взносы
		//|
		//|;
		//|
		//|ВЫБРАТЬ ПЕРВЫЕ 10000
		//|	CRM_КредитныеПредложенияСтавки.МаксимальныйСрокМес,
		//|	CRM_КредитныеПредложенияСтавки.МинимальныйСрокМес
		//|ПОМЕСТИТЬ Сроки
		//|ИЗ Справочник.CRM_КредитныеПредложения.КредитныеСтавки КАК CRM_КредитныеПредложенияСтавки
		//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Предложения КАК Предложения
		//|	ПО Предложения.Ссылка = CRM_КредитныеПредложенияСтавки.Ссылка
		//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Ставка КАК Ставка
		//|	ПО Ставка.Ставка_Маркетинговая = CRM_КредитныеПредложенияСтавки.Ставка_Маркетинговая
		//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Взнос КАК Взнос
		//|	ПО Взнос.ПервоначальныйВзносОт = CRM_КредитныеПредложенияСтавки.ПервоначальныйВзносОт
		//|УПОРЯДОЧИТЬ ПО CRM_КредитныеПредложенияСтавки.МаксимальныйСрокМес УБЫВ
		//|
		//|;
		//|
		//|ВЫБРАТЬ ПЕРВЫЕ 1
		//|	Сроки.МаксимальныйСрокМес,
		//|	Сроки.МинимальныйСрокМес
		//|ПОМЕСТИТЬ Срок
		//|ИЗ Сроки КАК Сроки
		//|
		//|;
		//|
		//|ВЫБРАТЬ
		//|	CRM_КредитныеПредложенияСтавки.Ссылка,
		//|	Ставка.Ставка_Маркетинговая КАК Ставка,
		//|	Взнос.ПервоначальныйВзносОт КАК ПервоначальныйВзнос,
		//|	Срок.МаксимальныйСрокМес КАК МаксимальныйСрок,
		//|	Срок.МинимальныйСрокМес КАК МинимальныйСрок
		//|ИЗ Справочник.CRM_КредитныеПредложения.КредитныеСтавки КАК CRM_КредитныеПредложенияСтавки
		//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Предложения КАК Предложения
		//|	ПО Предложения.Ссылка = CRM_КредитныеПредложенияСтавки.Ссылка
		//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Ставка КАК Ставка
		//|	ПО Ставка.Ставка_Маркетинговая = CRM_КредитныеПредложенияСтавки.Ставка_Маркетинговая
		//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Взнос КАК Взнос
		//|	ПО Взнос.ПервоначальныйВзносОт = CRM_КредитныеПредложенияСтавки.ПервоначальныйВзносОт
		//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Срок КАК Срок
		//|	ПО Срок.МаксимальныйСрокМес = CRM_КредитныеПредложенияСтавки.МаксимальныйСрокМес";
		//Запрос.УстановитьПараметр("Модель", Модель);
		//Запрос.УстановитьПараметр("Комплектация", Версия);
		//Запрос.УстановитьПараметр("ЭтоПовторныйКлиентБанка", ЭтоПовторныйКлиентБанка);
		//Запрос.УстановитьПараметр("ЭтоКлиентCRM", ЭтоКлиентCRM);
		//Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
		//Результат = Запрос.Выполнить().Выгрузить();
		//КредитноеПредложение = Неопределено;
		//ПервоначальныйВзнос = Неопределено;
		//МаксимальныйСрок = Неопределено;
		//Если Результат.Количество() = 1 Тогда
		//	КредитноеПредложение = Результат[0].Ссылка;
		//	ПервоначальныйВзнос = Результат[0].ПервоначальныйВзнос;
		//	МаксимальныйСрок = Результат[0].МаксимальныйСрок;
		//	МинимальныйСрок = Результат[0].МинимальныйСрок;
		//	ЗаполнитьДанныеПГ();
		//	РазницаЛет = (МаксимальныйСрок - МинимальныйСрок) / 12;
		//	СписокВыбора = Новый СписокЗначений;
		//	Для Индекс = 0 По РазницаЛет Цикл
		//		Элементы.СрокКредита.СписокВыбора.Добавить((МинимальныйСрок + Индекс*12) / 12);
		//		//Элементы.СрокКредита.СписокВыбора.Добавить(2);
		//		//Элементы.СрокКредита.СписокВыбора.Добавить(3);
		//		//Элементы.СрокКредита.СписокВыбора.Добавить(4);
		//		//Элементы.СрокКредита.СписокВыбора.Добавить(5);
		//		//Элементы.СрокКредита.СписокВыбора.Добавить(6);
		//		//Элементы.СрокКредита.СписокВыбора.Добавить(7);
		//	КонецЦикла;
		//КонецЕсли;
		
		КредитноеПредложение=Справочники.Renault_КредитныеПредложения.ОптимальноеКредитноеПредложение(,Автомобиль,,ЭтоПовторныйКлиентБанка,ЭтоКлиентCRM);
		ПервоначальныйВзнос=КредитноеПредложение.ПервоначальныйВзносПоУмолчанию;
		МаксимальныйСрок=КредитноеПредложение
		
		//ЗаполнитьКредитныеДанные(КредитноеПредложение, ПервоначальныйВзнос, МаксимальныйСрок);
		//ВключитьЗащитуКредита = Истина;
		//ПакетЗащитыКредита = Перечисления.CRM_ПакетыЗащитыКредита.Полный;
		//ИзменитьЗащитуКредита();
	КонецЕсли;
	
КонецПроцедуры

//Процедура ЗаполнитьКредитныеДанные(КредитноеПредложение = Неопределено, ПервоначальныйВзнос = Неопределено, СрокКредитаМес = Неопределено)
//	
//	Если ЗначениеЗаполнено(КредитноеПредложение) Тогда
//		
//		Если КредитноеПредложение.БесплатнаяПГ Тогда
//			Элементы.НадписьПГ.Заголовок = "Бесплатная продленная гарантия";
//			НеУчитыватьПГ = Истина;
//			ГарантияВычет = ГарантияСумма;
//		Иначе
//			Элементы.НадписьПГ.Заголовок = "";
//			ГарантияВычет = 0;
//		КонецЕсли;
//		Если ПервоначальныйВзнос = Неопределено Тогда
//			ПервоначальныйВзносПроцент = КредитноеПредложение.ПервоначальныйВзносПоУмолчанию;
//		Иначе
//			ПервоначальныйВзносПроцент = ПервоначальныйВзнос;
//		КонецЕсли;
//		ПервоначальныйВзносСумма = (ЦенаИтого - ГарантияВычет) * ПервоначальныйВзносПроцент / 100;
//		Если СрокКредитаМес = Неопределено Тогда
//			СрокКредита = КредитноеПредложение.СрокПоУмолчанию / 12;
//		Иначе
//			СрокКредита = СрокКредитаМес / 12;
//		КонецЕсли;
//		
//		
//		//ТребуетсяКАСКО = КредитноеПредложение.ТребуетсяКАСКО;
//		//Если ТребуетсяКАСКО Тогда
//		//	СтраховкаКАСКОВключать = Истина;
//		//	Элементы.ВключатьКАСКО.Доступность = Ложь;
//		//	ИнтересовалсяСтраховкой = Истина;
//		//	Элементы.ИнтересовалсяСтраховкой.Доступность = Ложь;
//		//	Элементы.СуммаКАСКО.Видимость = СтраховкаКАСКОВключать;
//		//	Элементы.КАСКОКомпания.Видимость = СтраховкаКАСКОВключать;
//		//	Элементы.ЗаявкаНаСтраховкуКАСКО.Видимость = СтраховкаКАСКОВключать;
//		//	Элементы.СтраховкаКАСКОПрограмма.Видимость = СтраховкаКАСКОВключать;
//		//Иначе
//		//	Элементы.ВключатьКАСКО.Доступность = Истина;
//		//	Элементы.ИнтересовалсяСтраховкой.Доступность = Истина;
//		//КонецЕсли;
//		
//		// проверим необходимость защиты платежей
//		Запрос = Новый Запрос;
//		Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ДоступныеСервисы.Сервис,
//		|	ДоступныеСервисы.Сервис.ПакетЗащитыКредита КАК ПакетЗащиты,
//		|	CRM_КредитныеТарифы.fix_cost,
//		|	CRM_КредитныеТарифы.dkp_prcnt_cost,
//		|	CRM_КредитныеТарифы.credit_prcnt_cost,
//		|	CRM_КредитныеТарифы.fix_grant,
//		|	CRM_КредитныеТарифы.dkp_p_grant,
//		|	CRM_КредитныеТарифы.credit_sumt_p_grant,
//		|	CRM_КредитныеТарифы.mrkt_rate_p_grant
//		|ИЗ
//		|	Справочник.CRM_КредитныеПредложения.НеобходимыеТипыСервиса КАК НеобходимыеТипыСервиса
//		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_КредитныеПредложения.ДоступныеСервисы КАК ДоступныеСервисы
//		|	ПО ДоступныеСервисы.Ссылка = НеобходимыеТипыСервиса.Ссылка
//		|		И НеобходимыеТипыСервиса.ТипСервиса = ДоступныеСервисы.Сервис.Сервис_Тип
//		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_КредитныеТарифы КАК CRM_КредитныеТарифы
//		|	ПО CRM_КредитныеТарифы.Сервис = ДоступныеСервисы.Сервис
//		|		И CRM_КредитныеТарифы.Модель = &Модель
//		|ГДЕ
//		|	НеобходимыеТипыСервиса.Ссылка = &КредитноеПредложение
//		|	И НеобходимыеТипыСервиса.ТипСервиса.Тип_Код = &payments_protection";
//		Запрос.УстановитьПараметр("КредитноеПредложение", КредитноеПредложение);
//		Запрос.УстановитьПараметр("payments_protection", "payments_protection");
//		Запрос.УстановитьПараметр("Модель", Модель);
//		ТабЗащиты = Запрос.Выполнить().Выгрузить();
//		Если ТабЗащиты.Количество() Тогда
//			ВключитьЗащитуКредита = Истина;
//			СтрокаПоиска = ТабЗащиты.Найти(Перечисления.CRM_ПакетыЗащитыКредита.Полный, "ПакетЗащиты");
//			Если СтрокаПоиска <> Неопределено Тогда
//				СтрокаЗащиты = СтрокаПоиска;
//			Иначе
//				СтрокаЗащиты = ТабЗащиты[0];
//			КонецЕсли;
//			ПакетЗащитыКредита = СтрокаЗащиты.ПакетЗащиты;
//			СтавкаЗащитыКредита = СтрокаЗащиты.credit_prcnt_cost;
//			ФиксированнаяЧастьЗащитыКредита = СтрокаЗащиты.fix_cost;
//			Элементы.ВключитьЗащитуКредита.Доступность = Ложь;
//		Иначе
//			Элементы.ГруппаЗащитаКредита.Видимость = Ложь;
//			Элементы.ВключитьЗащитуКредита.Доступность = Истина;
//		КонецЕсли;
//		
//		// проверим необходимость КАСКО
//		Запрос = Новый Запрос;
//		Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ДоступныеСервисы.Сервис КАК Сервис,
//		|	ДоступныеСервисы.Сервис.Сервис_Код КАК СервисКод,
//		|	CRM_КредитныеТарифы.fix_cost,
//		|	CRM_КредитныеТарифы.dkp_prcnt_cost,
//		|	CRM_КредитныеТарифы.credit_prcnt_cost,
//		|	CRM_КредитныеТарифы.fix_grant,
//		|	CRM_КредитныеТарифы.dkp_p_grant,
//		|	CRM_КредитныеТарифы.credit_sumt_p_grant,
//		|	CRM_КредитныеТарифы.mrkt_rate_p_grant,
//		|	CRM_СтраховыеПрограммы.Ссылка КАК СтраховаяПрограмма
//		|ИЗ
//		|	Справочник.CRM_КредитныеПредложения.НеобходимыеТипыСервиса КАК НеобходимыеТипыСервиса
//		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_КредитныеПредложения.ДоступныеСервисы КАК ДоступныеСервисы
//		|	ПО ДоступныеСервисы.Ссылка = НеобходимыеТипыСервиса.Ссылка
//		|		И НеобходимыеТипыСервиса.ТипСервиса = ДоступныеСервисы.Сервис.Сервис_Тип
//		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_КредитныеТарифы КАК CRM_КредитныеТарифы
//		|	ПО CRM_КредитныеТарифы.Сервис = ДоступныеСервисы.Сервис
//		|		И CRM_КредитныеТарифы.Модель = &Модель
//		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_СтраховыеПрограммы КАК CRM_СтраховыеПрограммы
//		|	ПО CRM_СтраховыеПрограммы.КредитныйСервис = ДоступныеСервисы.Сервис
//		|ГДЕ
//		|	НеобходимыеТипыСервиса.Ссылка = &КредитноеПредложение
//		|	И НеобходимыеТипыСервиса.ТипСервиса.Тип_Код = &mini_kasko_1";
//		Запрос.УстановитьПараметр("КредитноеПредложение", КредитноеПредложение);
//		Запрос.УстановитьПараметр("mini_kasko_1", "mini_kasko_1");
//		Запрос.УстановитьПараметр("Модель", Модель);
//		ТабКАСКО = Запрос.Выполнить().Выгрузить();
//		Строка1 = Неопределено;
//		Строка2 = Неопределено;
//		Строка3 = Неопределено;
//		Строка4 = Неопределено;
//		Строка5 = Неопределено;
//		Если ТабКАСКО.Количество() Тогда
//			
//			Для Каждого СтрокаКАСКО ИЗ ТабКАСКО Цикл
//				Если Найти(СтрокаКАСКО.СервисКод, "5") <> 0 Тогда
//					Строка5 = СтрокаКАСКО;
//				ИначеЕсли Найти(СтрокаКАСКО.СервисКод, "4") <> 0 Тогда
//					Строка4 = СтрокаКАСКО;
//				ИначеЕсли Найти(СтрокаКАСКО.СервисКод, "3") <> 0 Тогда
//					Строка3 = СтрокаКАСКО;
//				ИначеЕсли Найти(СтрокаКАСКО.СервисКод, "2") <> 0 Тогда
//					Строка2 = СтрокаКАСКО;
//				ИначеЕсли Найти(СтрокаКАСКО.СервисКод, "1") <> 0 Тогда
//					Строка1 = СтрокаКАСКО;
//				КонецЕсли;
//			КонецЦикла;
//			
//			Если Строка5 <> Неопределено Тогда
//				СтрокаПоиска = Строка5;
//			ИначеЕсли Строка4 <> Неопределено Тогда
//				СтрокаПоиска = Строка4;
//			ИначеЕсли Строка3 <> Неопределено Тогда
//				СтрокаПоиска = Строка3;
//			ИначеЕсли Строка2 <> Неопределено Тогда
//				СтрокаПоиска = Строка2;
//			ИначеЕсли Строка1 <> Неопределено Тогда
//				СтрокаПоиска = Строка1;
//			КонецЕсли;
//			
//			Если СтрокаПоиска = Неопределено Тогда
//				СтрокаПоиска = ТабКАСКО[0];
//			КонецЕсли;
//			ИнтересовалсяСтраховкой = Истина;
//			СтраховкаКАСКОВключать = Истина;
//			ТребуетсяКАСКО = Истина;
//			//ВключатьКАСКОПриИзменении();
//			СтраховкаКАСКОПрограмма = СтрокаПоиска.СтраховаяПрограмма;
//			СтавкаКАСКО = СтрокаПоиска.Dkp_prcnt_cost;
//			
//			//СтраховкаКАСКОПрограммаПриИзменении();
//			//ФиксированнаяЧастьЗащитыКредита = СтрокаПоиска.fix_cost;
//			//Элементы.ВключитьЗащитуКредита.Доступность = Ложь;
//		Иначе
//			//Элементы.ВключитьЗащитуКредита.Доступность = Истина;
//			Элементы.ГруппаСтраховкаИзПредложения.Видимость = Ложь;
//		КонецЕсли;
//		
//		
//		// проверим необходимость Renault Extra
//		Запрос = Новый Запрос;
//		Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ДоступныеСервисы.Сервис КАК Сервис,
//		|	ДоступныеСервисы.Сервис.Сервис_Код КАК СервисКод,
//		|	CRM_КредитныеТарифы.fix_cost,
//		|	CRM_КредитныеТарифы.dkp_prcnt_cost,
//		|	CRM_КредитныеТарифы.credit_prcnt_cost,
//		|	CRM_КредитныеТарифы.fix_grant,
//		|	CRM_КредитныеТарифы.dkp_p_grant,
//		|	CRM_КредитныеТарифы.credit_sumt_p_grant,
//		|	CRM_КредитныеТарифы.mrkt_rate_p_grant
//		|ИЗ
//		|	Справочник.CRM_КредитныеПредложения.НеобходимыеТипыСервиса КАК НеобходимыеТипыСервиса
//		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_КредитныеПредложения.ДоступныеСервисы КАК ДоступныеСервисы
//		|	ПО ДоступныеСервисы.Ссылка = НеобходимыеТипыСервиса.Ссылка
//		|		И НеобходимыеТипыСервиса.ТипСервиса = ДоступныеСервисы.Сервис.Сервис_Тип
//		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_КредитныеТарифы КАК CRM_КредитныеТарифы
//		|	ПО CRM_КредитныеТарифы.Сервис = ДоступныеСервисы.Сервис
//		|		И CRM_КредитныеТарифы.Модель = &Модель
//		|ГДЕ
//		|	НеобходимыеТипыСервиса.Ссылка = &КредитноеПредложение
//		|	И НеобходимыеТипыСервиса.ТипСервиса.Тип_Код = &extended_guarantee";
//		Запрос.УстановитьПараметр("КредитноеПредложение", КредитноеПредложение);
//		Запрос.УстановитьПараметр("extended_guarantee", "extended_guarantee");
//		Запрос.УстановитьПараметр("Модель", Модель);
//		ТабExtra = Запрос.Выполнить().Выгрузить();
//		Строка1 = Неопределено;
//		Строка2 = Неопределено;
//		Строка3 = Неопределено;
//		Строка4 = Неопределено;
//		Строка5 = Неопределено;
//		Если ТабExtra.Количество() Тогда
//			
//			Для Каждого СтрокаExtra ИЗ ТабExtra Цикл
//				Если Найти(СтрокаExtra.СервисКод, "5") <> 0 Тогда
//					Строка5 = СтрокаExtra;
//				ИначеЕсли Найти(СтрокаExtra.СервисКод, "4") <> 0 Тогда
//					Строка4 = СтрокаExtra;
//				ИначеЕсли Найти(СтрокаExtra.СервисКод, "3") <> 0 Тогда
//					Строка3 = СтрокаExtra;
//				ИначеЕсли Найти(СтрокаExtra.СервисКод, "2") <> 0 Тогда
//					Строка2 = СтрокаExtra;
//				ИначеЕсли Найти(СтрокаExtra.СервисКод, "1") <> 0 Тогда
//					Строка1 = СтрокаExtra;
//				КонецЕсли;
//			КонецЦикла;
//			
//			Если Строка5 <> Неопределено Тогда
//				СтрокаПоиска = Строка5;
//			ИначеЕсли Строка4 <> Неопределено Тогда
//				СтрокаПоиска = Строка4;
//			ИначеЕсли Строка3 <> Неопределено Тогда
//				СтрокаПоиска = Строка3;
//			ИначеЕсли Строка2 <> Неопределено Тогда
//				СтрокаПоиска = Строка2;
//			ИначеЕсли Строка1 <> Неопределено Тогда
//				СтрокаПоиска = Строка1;
//			КонецЕсли;
//			
//			//ВключитьЗащитуКредита = Истина;
//			Если СтрокаПоиска = Неопределено Тогда
//				СтрокаПоиска = ТабExtra[0];
//			КонецЕсли;
//			РасширеннаяГарантия = СтрокаПоиска.Сервис;
//			СтавкаКАСКО = СтрокаПоиска.Dkp_prcnt_cost;
//			
//			//СтраховкаКАСКОПрограммаПриИзменении();
//			//ФиксированнаяЧастьЗащитыКредита = СтрокаПоиска.fix_cost;
//			//Элементы.ВключитьЗащитуКредита.Доступность = Ложь;
//		Иначе
//			//Элементы.ВключитьЗащитуКредита.Доступность = Истина;
//			Элементы.ГруппаРасширеннаяГарантия.Видимость = Ложь;
//		КонецЕсли;
//		
//		Банк = Справочники.Банки.НайтиПоНаименованию("РН Банк");		//хрень, заменить на что то адекватное
//		
//		СуммаДопОпцийСумма = ?(ДопОборудованиеВКредит, ВыбранноеОборудование.Итог("Сумма"), 0);
//		
//		Если (ЦенаИтого - ГарантияВычет) > 0 Тогда
//		
//			СуммаДопОпцийПроцент = (СуммаДопОпцийСумма / (ЦенаИтого - ГарантияВычет)) * 100;
//			
//		Иначе
//			
//			СуммаДопОпцийПроцент = 0;
//			
//		КонецЕсли;
//		
//	Иначе
//		
//		Элементы.ВключатьКАСКО.Доступность = Истина;
//		Элементы.ИнтересовалсяСтраховкой.Доступность = Истина;
//		
//	КонецЕсли;
//	
//КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокКредитныхПредложений() //устарело
	
	//Если ИнтересовалсяКредитом Тогда
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	CRM_КредитныеПредложенияМодели.Ссылка
	//	|ИЗ
	//	|	Справочник.CRM_КредитныеПредложения.Модели КАК CRM_КредитныеПредложенияМодели
	//	|ГДЕ
	//	|	
	//	|	CRM_КредитныеПредложенияМодели.Модель = &Модель
	//	|	И CRM_КредитныеПредложенияМодели.Комплектация = &Комплектация
	//	|	И CRM_КредитныеПредложенияМодели.Ссылка.ДляПовторногоКлиента = &ЭтоПовторныйКлиентБанка
	//	|	И CRM_КредитныеПредложенияМодели.Ссылка.КлиентCRM = &ЭтоКлиентCRM
	//	|	И CRM_КредитныеПредложенияМодели.Выбрана = Истина
	//	|	И CRM_КредитныеПредложенияМодели.Ссылка.ДатаНачалаПредложения < &ТекДата
	//	|	И CRM_КредитныеПредложенияМодели.Ссылка.ДатаОкончанияПредложения > &ТекДата";
	//	Запрос.УстановитьПараметр("Модель", Модель);
	//	Запрос.УстановитьПараметр("Комплектация", Версия);
	//	Запрос.УстановитьПараметр("ЭтоПовторныйКлиентБанка", ЭтоПовторныйКлиентБанка);
	//	Запрос.УстановитьПараметр("ЭтоКлиентCRM", ЭтоКлиентCRM);
	//	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	//	Результат = Запрос.Выполнить().Выгрузить();
	//	Если Результат.Количество() = 1 Тогда
	//		КредитноеПредложение = Результат[0].Ссылка;
	//		ЗаполнитьДанныеПГ();
	//	КонецЕсли;
	//	ЗаполнитьКредитныеДанные();
	//	ВключитьЗащитуКредита = Истина;
	//	ПакетЗащитыКредита = Перечисления.CRM_ПакетыЗащитыКредита.Полный;
	//	ИзменитьЗащитуКредита();
	//КонецЕсли;
	
КонецПроцедуры

Функция РассчитатьПлатеж(Ставка, ОбъемКредита, Период)
	
	Если Период <> 0 Тогда
		Если Ставка <> 0 Тогда
			Возврат (Ставка/1200*ОбъемКредита*Pow(1+Ставка/1200, Период)) / (Pow(1+Ставка/1200, Период)-1);
		Иначе
			Возврат ОбъемКредита/Период;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура КредитноеПредложениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Форма = ПолучитьФорму("Справочник.CRM_КредитныеПредложения.ФормаВыбора");
	Форма.Модель = Модель;
	Форма.Комплектация = Версия;
	Форма.ДляПовторногоКлиентаБанка = ЭтоПовторныйКлиентБанка;
	Форма.ДляКлиентаCRM = ЭтоКлиентCRM;
	Ответ = Форма.ОткрытьМодально();
	Если ЗначениеЗаполнено(Ответ) Тогда
		КредитноеПредложение = Ответ;
		КредитноеПредложениеПриИзменении(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КредитноеПредложениеПриИзменении(Элемент)
	
	//ЗаполнитьДанныеПГ();
	//ПересчитатьЦенуАвто();
	//ЗаполнитьКредитныеДанные();
	//ВключитьЗащитуКредитаПриИзменении(Элементы.ВключитьЗащитуКредита);
	//ПересчитатьКредит();
	//ОбновитьНадписьСубсидии();
	//
	//ПроверитьКредитнуюПрограмму();
	//
	//ОбновитьОтображениеГруппПоЗаявкам();
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПГ()
	
	Если ЗначениеЗаполнено(КредитноеПредложение) Тогда
		Если КредитноеПредложение.БесплатнаяПГ И ЗначениеЗаполнено(КредитноеПредложение.ПродленнаяГарантия) Тогда
			БесплатнаяПГ = Истина;
			Набор = РегистрыСведений.CRM_СтоимостьПродленнойГарантии.СоздатьНаборЗаписей();
			Набор.Отбор.Модель.Установить(Модель);
			Набор.Отбор.ПредложениеПГ.Установить(КредитноеПредложение.ПродленнаяГарантия);
			Набор.Прочитать();
			
			ПродленнаяГарантия = КредитноеПредложение.ПродленнаяГарантия;
			Если Набор.Количество() Тогда
				ГарантияСумма = Набор[0].Сумма;
				Элементы.ДекорацияСубсидияПоПГ.Заголовок = "Субсидия по ПГ: " + Набор[0].Сумма;
				Элементы.ПГВКредит.Видимость = Ложь;
				ГарантияСуммаДляКлиента = Набор[0].Сумма;
			КонецЕсли;
		Иначе
			БесплатнаяПГ = Ложь;
			ГарантияСумма = 0;
			Элементы.ДекорацияСубсидияПоПГ.Заголовок = "";
			Элементы.ПГВКредит.Видимость = Истина;
		КонецЕсли;
	Иначе
		ГарантияСумма = 0;
		Элементы.ДекорацияСубсидияПоПГ.Заголовок = "";
		Элементы.ПГВКредит.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаКарточкуКлиентаНажатие(Элемент)
	
	Форма = ПолучитьФорму("ОбщаяФорма.CRM_ФормаКарточкиКлиента");
	Форма.Клиент = ТекущийКлиент;
	Форма.ЭлементыФормы.ПанельОсновная.ТекущаяСтраница = Форма.ЭлементыФормы.ПанельОсновная.Страницы.СтраницаФинансовыеУслуги;
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключатьКАСКОПриИзменении(Элемент)
	
	ПересчитатьКредит();
	ОбновитьНадписьСубсидии();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключатьОСАГОПриИзменении(Элемент)
	
	ПересчитатьКредит();
	ОбновитьНадписьСубсидии();
	
КонецПроцедуры

&НаСервере
Функция ЭтоПовторныйКлиентБанка()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_CRM_ЗаявкаНаКредит.Статус КАК Статус,
	|	Renault_CRM_ЗаявкаНаКредит.Дата КАК ДатаНачала,
	|	Renault_CRM_ЗаявкаНаКредит.Ссылка
	|ИЗ
	|	Документ.Renault_CRM_ЗаявкаНаКредит КАК Renault_CRM_ЗаявкаНаКредит
	|ГДЕ
	|	Renault_CRM_ЗаявкаНаКредит.Клиент = &Клиент
	|	И Renault_CRM_ЗаявкаНаКредит.РабочийЛист <> &ТекущийРабочийЛист";
	Запрос.УстановитьПараметр("Клиент", ТекущийКлиент);
	Запрос.УстановитьПараметр("ТекущийРабочийЛист", ТекущийРабочийЛист);
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции

&НаКлиенте
Процедура ВключитьЗащитуКредитаПриИзменении(Элемент)
	
	Элементы.ПолеВыбораПакетаЗащиты.Видимость = ВключитьЗащитуКредита;
	Если ВключитьЗащитуКредита Тогда
		СуммаКредита = СуммаКредита + СуммаЗащитыКредита;
	Иначе
		СуммаКредита = СуммаКредита - СуммаЗащитыКредита;
	КонецЕсли;
	ИзменитьЗащитуКредита();
	//ЕжемесячныйПлатеж = РассчитатьПлатеж(МаркетинговаяСтавка, СуммаКредита, СрокКредита);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеВыбораПакетаЗащитыПриИзменении(Элемент)
	
	ИзменитьЗащитуКредита();
	//СуммаЗащитыКредита = (СуммаКредита*(ПроцентЗащиты/100)*СрокКредита + ЗащитаФикс*(1+(ПроцентЗащиты/100)*СрокКредита));
	//СуммаКредита = СуммаКредита + СуммаЗащитыКредита;
	//ЕжемесячныйПлатеж = РассчитатьПлатеж(МаркетинговаяСтавка, СуммаКредита, СрокКредита);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьЗащитуКредита() //механизм устарел
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	CRM_КредитныеТарифы.fix_cost,
	//|	CRM_КредитныеТарифы.dkp_prcnt_cost,
	//|	CRM_КредитныеТарифы.credit_prcnt_cost,
	//|	CRM_КредитныеТарифы.fix_grant,
	//|	CRM_КредитныеТарифы.dkp_p_grant,
	//|	CRM_КредитныеТарифы.credit_sumt_p_grant,
	//|	CRM_КредитныеТарифы.mrkt_rate_p_grant
	//|ИЗ
	//|	РегистрСведений.CRM_КредитныеТарифы КАК CRM_КредитныеТарифы
	//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_КредитныеПредложения.ДоступныеСервисы КАК ДоступныеСервисы
	//|		ПО ДоступныеСервисы.Сервис = CRM_КредитныеТарифы.Сервис
	//|ГДЕ
	//|	CRM_КредитныеТарифы.Модель = &Модель
	//|	И CRM_КредитныеТарифы.Сервис.ПакетЗащитыКредита = &ПакетЗащитыКредита
	//|	И ДоступныеСервисы.Ссылка = &КредитноеПредложение";
	//Запрос.УстановитьПараметр("Модель", Модель);
	//Запрос.УстановитьПараметр("ПакетЗащитыКредита", ПакетЗащитыКредита);
	//Запрос.УстановитьПараметр("КредитноеПредложение", КредитноеПредложение);
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Если Выборка.Следующий() Тогда
	//	СтавкаЗащитыКредита = Выборка.credit_prcnt_cost;
	//	ФиксированнаяЧастьЗащитыКредита = Выборка.fix_cost;
	//Иначе
	//	СтавкаЗащитыКредита = 0;
	//	ФиксированнаяЧастьЗащитыКредита = 0;
	//КонецЕсли;
	//
	////ПрограммаЗащитыКредита = Справочники.CRM_ЗащитаКредита.НайтиПоРеквизиту("Банк", Банк);
	////СтавкаЗащитыКредита = 0;
	////ФиксированнаяЧастьЗащитыКредита = 0;
	////СуммаКредита = СуммаКредита + СуммаЗащитыКредита;
	////Если ПакетЗащитыКредита = Перечисления.CRM_ПакетыЗащитыКредита.Минимальный Тогда
	////	СтавкаЗащитыКредита = Справочники.CRM_ЗащитаКредита.НайтиПоРеквизиту("Банк", Банк).МинимальныйПакет;
	////	ФиксированнаяЧастьЗащитыКредита = Справочники.CRM_ЗащитаКредита.НайтиПоРеквизиту("Банк", Банк).МинимальныйПакетФикс;
	////ИначеЕсли ПакетЗащитыКредита = Перечисления.CRM_ПакетыЗащитыКредита.Полный Тогда
	////	СтавкаЗащитыКредита = Справочники.CRM_ЗащитаКредита.НайтиПоРеквизиту("Банк", Банк).ПолныйПакет;
	////	ФиксированнаяЧастьЗащитыКредита = Справочники.CRM_ЗащитаКредита.НайтиПоРеквизиту("Банк", Банк).ПолныйПакетФикс;
	////КонецЕсли;
	//
	//ПересчитатьКредит();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоПовторныйКлиентБанкаПриИзменении(Элемент)
	
	ПроверитьКредитнуюПрограмму();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоКлиентCRMПриИзменении(Элемент)
	
	ПроверитьКредитнуюПрограмму();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКредитнуюПрограмму()
	
	Элементы.СсылкаНаКарточкуКлиента.Видимость = ЭтоПовторныйКлиентБанка;
	Если ЗначениеЗаполнено(КредитноеПредложение) Тогда
		Если КредитноеПредложение.ДляПовторногоКлиента <> ЭтоПовторныйКлиентБанка
			ИЛИ КредитноеПредложение.КлиентCRM <> ЭтоКлиентCRM Тогда
			Элементы.НадписьДляПовторногоКлиента.Заголовок = "Необходимо сменить программу!!";
			НеобходимоСменитьКредитнуюПрограмму = Истина;
		Иначе
			Элементы.НадписьДляПовторногоКлиента.Заголовок = "";
			НеобходимоСменитьКредитнуюПрограмму = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТрейдИнРефинансированиеПриИзменении(Элемент)
	
	ПересчитатьКредит();
	ОбновитьНадписьСубсидии();
	
КонецПроцедуры

&НаКлиенте
Процедура КАСКОВКредитПриИзменении(Элемент)
	
	ПересчитатьКредит();
	ОбновитьНадписьСубсидии();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаКАСКОПриИзменении(Элемент)
	
	Если ИнтересовалсяКредитом Тогда
		ПересчитатьКредит();
		ОбновитьНадписьСубсидии();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПГВКредитПриИзменении(Элемент)
	
	ПересчитатьКредит();
	ОбновитьНадписьСубсидии();
	
КонецПроцедуры

&НаКлиенте
Процедура СтраховкаКАСКОПрограммаПриИзменении(Элемент)
	
	ИзменитьПрограммуКАСКО();
	ОбновитьНадписьСубсидии();
	Если ИспользуетсяРазумноеКАСКО = Истина Тогда
		Элементы.СуммаКАСКО.Доступность = Ложь;
	Иначе
		Элементы.СуммаКАСКО.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьПрограммуКАСКО()
	
	Если СтраховкаКАСКОПрограмма.Владелец = Справочники.CRM_СтраховыеКомпании.НайтиПоКоду("000000001") Тогда
		Если КредитноеПредложение.ПоддерживаетРазумноеКАСКО Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	CRM_КредитныеТарифы.fix_cost,
			|	CRM_КредитныеТарифы.dkp_prcnt_cost,
			|	CRM_КредитныеТарифы.credit_prcnt_cost,
			|	CRM_КредитныеТарифы.fix_grant,
			|	CRM_КредитныеТарифы.dkp_p_grant,
			|	CRM_КредитныеТарифы.credit_sumt_p_grant,
			|	CRM_КредитныеТарифы.mrkt_rate_p_grant
			|ИЗ
			|	РегистрСведений.CRM_КредитныеТарифы КАК CRM_КредитныеТарифы
			|ГДЕ
			|	CRM_КредитныеТарифы.Сервис = &Сервис
			|	И CRM_КредитныеТарифы.Модель = &Модель";
			Запрос.УстановитьПараметр("Сервис", СтраховкаКАСКОПрограмма.КредитныйСервис);
			Запрос.УстановитьПараметр("Модель", Модель);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Коэффициент = Выборка.dkp_prcnt_cost;
				СтраховкаКАСКОСумма = (Коэффициент * СтраховкаКАСКОПрограмма.СрокСтрахования / 100) * (ЦенаВариантаКомплектации + СуммаДоставки + ЦенаДопОпций + СуммаДопОпцийСумма - ГарантияВычет);
			КонецЕсли;
			//СтраховкаКАСКОСумма = (3.5 * СтраховкаКАСКОПрограмма.СрокСтрахования / 100) * (ЦенаВариантаКомплектации + СуммаДоставки + ЦенаДопОпций + СуммаДопОпцийСумма - ГарантияВычет);
			ИспользуетсяРазумноеКАСКО = Истина;
			
		Иначе
			//	СтраховкаКАСКОСумма = 0;
		КонецЕсли;
	Иначе
		СтраховкаКАСКОСумма = 0;
		ИспользуетсяРазумноеКАСКО = Ложь;
	КонецЕсли;
	ПересчитатьКредит();
	
КонецПроцедуры


&НаКлиенте
Процедура ДопОборудованиеВКредитПриИзменении(Элемент)
	
	СуммаДопОпцийСумма = ?(ДопОборудованиеВКредит, ВыбранноеОборудование.Итог("Сумма"), 0);
	СуммаДопОпцийПроцент = (СуммаДопОпцийСумма / (ЦенаИтого - ГарантияВычет)) * 100;
	ПересчитатьКредит();
	
КонецПроцедуры


// конец вставки для "Кредитного калькулятора"

&НаСервере 
Функция ПолучитьЗначенияПараметровШаблонаЕмаил()
	
	ПараметрыЕмаил = Новый СписокЗначений();
	Если ЗначениеЗаполнено(ТекущийКлиент) Тогда
		ПараметрыЕмаил.Добавить(ТекущийКлиент.Наименование,"{Клиент}");
	Иначе
		ПараметрыЕмаил.Добавить(" ","{Клиент}");
	КонецЕсли;
	ДЦ =Renault_CRM.ПолучитьДилерскийЦентрПользователя();
	Если ЗначениеЗаполнено(ДЦ) Тогда
		ПараметрыЕмаил.Добавить(ДЦ.Наименование,"{Дилер}");
		Если ЗначениеЗаполнено(Дц.Организация) Тогда
			Мен = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
			Мен.Вид = Справочники.ВидыКонтактнойИнформации.АдресФактический;
			Мен.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
			Мен.Объект = Дц.Организация;
			Мен.Прочитать();
			Если Мен.Выбран() Тогда
				ПараметрыЕмаил.Добавить(Мен.Поле4,"{Город}");
			Иначе
				ПараметрыЕмаил.Добавить(" ","{Город}");
				
			КонецЕсли;
			
		КонецЕсли;
		
		
	Иначе
		ПараметрыЕмаил.Добавить(" ","{Дилер}");
		ПараметрыЕмаил.Добавить(" ","{Город}");
	КонецЕсли;
	Если ЗначениеЗаполнено(Менеджер)Или ЗначениеЗаполнено(ПараметрыСеанса.Пользователь.Сотрудник) Тогда
		ПараметрыЕмаил.Добавить(?(ЗначениеЗаполнено(Менеджер),Менеджер.Наименование,ПараметрыСеанса.Пользователь.Сотрудник.Наименование),"{Менеджер}");
		ПараметрыЕмаил.Добавить(Renault_CRM.ПолучитьТелефонКлиент(?(ЗначениеЗаполнено(Менеджер),Менеджер,ПараметрыСеанса.Пользователь.Сотрудник)),"{Телефон}");
	Иначе
		ПараметрыЕмаил.Добавить(" ","{Менеджер}");
		ПараметрыЕмаил.Добавить(" ","{Телефон}");
	КонецЕсли;
	Если ЗначениеЗаполнено(Модель) Тогда
		ПараметрыЕмаил.Добавить(Модель.Наименование,"{Модель}");
	Иначе
		ПараметрыЕмаил.Добавить(" ","{Модель}");
	КонецЕсли;
	
	Возврат ПараметрыЕмаил;
	
	
КонецФункции

&НаКлиенте
Функция ЗаполнитьТекстЕмаилаПараметрами(ШаблонТекстаЕмаил)
	ПараметрыЕмаил = ПолучитьЗначенияПараметровШаблонаЕмаил();
	Ответ = ШаблонТекстаЕмаил;
	Для Каждого Пар из ПараметрыЕмаил Цикл
		Ответ = СтрЗаменить(Ответ,Пар.Представление,Пар.Значение);
	КонецЦикла;
	Возврат Ответ;	
	
КонецФункции

&НаКлиенте
Процедура ПоказатьЗаполненныйТекстСообщения(Команда)
	// Вставить содержимое обработчика.
	ЗначКПоказу = ЗаполнитьТекстЕмаилаПараметрами(РассылкаТекстСоообщения);
	ОткрытьЗначение(ЗначКПоказу);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСклад(Команда)
	ОбновитьТаблицыСклад();
КонецПроцедуры

&НаКлиенте
Процедура ПродленнаяГарантияПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(ПродленнаяГарантия) Тогда
		ЗаявкаНаГарантию = Документы.Renault_CRM_ЗаявкаНаГарантию.ПустаяСсылка();
	Иначе
		ГарантияСумма = ПродленнаяГарантия.ФиксированнаяЧастьТарифа;// * ?(ТекущееКП.Сумма = 0, ЦенаВариантаКомплектации, ТекущееКП.Сумма) / 100;
	КонецЕсли;
	
	ПересчитатьЦенуАвто();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРасчетнуюПоЦенеРопПриИзменении(Элемент)
	СуммаСкидки = 0;
	ПолучитьСуммуДоставки();
	ПересчитатьЦенуАвто();
КонецПроцедуры

&НаКлиенте
Процедура ОпцииДилераДобавитьИзДопов(Команда)
	
	//Андрианова Начало 23.11.2016	
	//Ответ = Справочники.Renault_СписокДопов.ПолучитьФормуВыбора().ОткрытьМодально();
	ФормаОтвета = Справочники.Renault_СписокДопов.ПолучитьФормуВыбора();
	ФормаОтвета.Модель = Модель;
	ФормаОтвета.Версия = Версия; 
	Ответ = ФормаОтвета.ОткрытьМодально();
	//Андрианова Конец 23.11.2016
	
	Если ЗначениеЗаполнено(Ответ) Тогда
		
		Для Каждого ВыбранныеДопы Из Ответ Цикл
			
			НовСтрока = ВыбранноеОборудование.Добавить();
			НовСтрока.Номенклатура = ВыбранныеДопы.Ссылка;
			НовСтрока.Количество = 1;
			НовСтрока.Цена = ВыбранныеДопы.Стоимость;
			НовСтрока.Сумма = НовСтрока.Цена * НовСтрока.Количество;
			
			ПересчитатьЦенуАвто();
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОткрытьЗаявкуНаТрейдИн(Команда)
	
	
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("РабочийЛист", ТекущийРабочийЛист);
	Выборка = Документы.Renault_ЗаявкаНаТрейдИн.Выбрать(,, СтруктураОтбора);
	Если Не Выборка.Следующий() Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РабочийЛист", ТекущийРабочийЛист);
		ПараметрыФормы.Вставить("Клиент", ТекущийКлиент);
		ПараметрыФормы.Вставить("МенеджерЗаявитель", Менеджер);
		ОткрытьФорму("Документ.Renault_ЗаявкаНаТрейдИн.Форма.ФормаДокументаУпр", ПараметрыФормы);
		
	Иначе
		ЗаявкаНаТрейдИн = Выборка.Ссылка;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", ЗаявкаНаТрейдИн); 
		ОткрытьФормуМодально("Документ.Renault_ЗаявкаНаТрейдИн.Форма.ФормаДокументаУпр", ПараметрыФормы);
		ЗагрузитьЗаявкуНаТрейдИн();
		ПересчитатьЦенуАвто();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраховкаКАСКОПрограммаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ИнтересовалсяКредитом = Истина Тогда
		СтандартнаяОбработка = Ложь;
		СписокЗнач = НайтиДоступныеПрограммыКАСКО();
		Прогр = СписокЗнач.ВыбратьЭлемент();
		Если Прогр <> Неопределено Тогда
			СтраховкаКАСКОПрограмма = Прогр.Значение;
			СтраховкаКАСКОПрограммаПриИзменении(Элемент)
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиДоступныеПрограммыКАСКО()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_СтраховыеПрограммы.Ссылка КАК Программа
	|ИЗ
	|	Справочник.CRM_СтраховыеПрограммы КАК CRM_СтраховыеПрограммы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_КредитныеПредложения.ДоступныеСервисы КАК CRM_КредитныеПредложенияДоступныеСервисы
	|	ПО CRM_КредитныеПредложенияДоступныеСервисы.Сервис = CRM_СтраховыеПрограммы.КредитныйСервис
	|ГДЕ CRM_КредитныеПредложенияДоступныеСервисы.Сервис.Наименование ПОДОБНО &Текст
	|	И CRM_КредитныеПредложенияДоступныеСервисы.Ссылка = &Предложение
	|	И CRM_СтраховыеПрограммы.Владелец = &Компания";
	Запрос.УстановитьПараметр("Текст", "%КАСКО%");
	Запрос.УстановитьПараметр("Предложение", КредитноеПредложение);
	Запрос.УстановитьПараметр("Компания", СтраховкаКАСКОКомпания);
	Результат = Запрос.Выполнить().Выгрузить();
	Массив = Результат.ВыгрузитьКолонку("Программа");
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения(Массив);
	
	Возврат Список;
	
КонецФункции

&НаСервере
Функция ПолучитьДоступныеЗначения(Процент = Неопределено, Срок = Неопределено)
	
	Результат = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ";
	Если Процент = Неопределено Тогда
		Запрос.Текст = Запрос.Текст + Символы.ПС + 
		"	CRM_КредитныеПредложенияКредитныеСтавки.ПервоначальныйВзносОт КАК МинВзнос,
		|	CRM_КредитныеПредложенияКредитныеСтавки.ПервоначальныйВзносДо КАК МаксВзнос,";
	КонецЕсли;
	Если Срок = Неопределено Тогда
		Запрос.Текст = Запрос.Текст + Символы.ПС + 
		"	CRM_КредитныеПредложенияКредитныеСтавки.МинимальныйСрокМес КАК МинСрок,
		|	CRM_КредитныеПредложенияКредитныеСтавки.МаксимальныйСрокМес КАК МаксСрок,";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + Символы.ПС + 
	"	CRM_КредитныеПредложенияКредитныеСтавки.Ставка_Банк
	|ИЗ
	|	Справочник.CRM_КредитныеПредложения.КредитныеСтавки КАК CRM_КредитныеПредложенияКредитныеСтавки
	|ГДЕ CRM_КредитныеПредложенияКредитныеСтавки.Ссылка = &Ссылка
	|	И ВЫБОР КОГДА &Срок <> НЕОПРЕДЕЛЕНО ТОГДА
	|		(CRM_КредитныеПредложенияКредитныеСтавки.МинимальныйСрокМес <= &Срок
	|		И CRM_КредитныеПредложенияКредитныеСтавки.МаксимальныйСрокМес >= &Срок)
	|	ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР КОГДА &ПервоначальныйВзносПроцент <> НЕОПРЕДЕЛЕНО ТОГДА
	|		(CRM_КредитныеПредложенияКредитныеСтавки.ПервоначальныйВзносОт <= &ПервоначальныйВзносПроцент
	|		И CRM_КредитныеПредложенияКредитныеСтавки.ПервоначальныйВзносДо >= &ПервоначальныйВзносПроцент)
	|	ИНАЧЕ ИСТИНА
	|	КОНЕЦ";
	Запрос.УстановитьПараметр("Ссылка", КредитноеПредложение);
	Запрос.УстановитьПараметр("ПервоначальныйВзносПроцент", Процент);
	Запрос.УстановитьПараметр("Срок", Срок);
	Результат = Запрос.Выполнить().Выгрузить();
	//Если НЕ Выборка.Следующий() Тогда
	//	Результат = Ложь;
	//КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПроверитьКредитСтраховку()
	
	Возврат Истина;
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ 
	//              |	CRM_Отделы.Ссылка
	//              |ИЗ
	//              |	Справочник.CRM_Отделы КАК CRM_Отделы
	//              |ГДЕ
	//              |	CRM_Отделы.КлассификацияRenault = ЗНАЧЕНИЕ(Перечисление.CRM_КлассификацияОтделов.ОФУ)
	//              |	И CRM_Отделы.ДилерскийЦентр = &ДилерскийЦентр
	//              |	И НЕ CRM_Отделы.ПометкаУдаления";
	//Запрос.УстановитьПараметр("ДилерскийЦентр", Renault_CRM.ПолучитьДилерскийЦентрПользователя());
	//Резульат = Запрос.Выполнить().Выгрузить();
	//Если Резульат.Количество() > 1 Тогда
	//	СписокВыборка = Новый СписокЗначений;
	//	СписокВыборка.ЗагрузитьЗначения(Резульат.ВыгрузитьКолонку("Ссылка"));
	//	ВыбранноеЗначение = ВыбратьИзСписка(СписокВыборка);  
	//КонецЕсли;
	
КонецФункции

//Козлов Е.А. Начало 14.07.2016
&НаКлиенте
Процедура ЗаявкаНаГарантиюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ФормаВыбора = Документы.Renault_CRM_ЗаявкаНаГарантию.ПолучитьФормуВыбора(, Элемент);
	
	ФормаВыбора.Отбор.ПометкаУдаления.ВидСравнения = ВидСравнения.Равно;
	ФормаВыбора.Отбор.ПометкаУдаления.Значение = Ложь;
	ФормаВыбора.Отбор.ПометкаУдаления.Использование = Истина;
	ФормаВыбора.ЭлементыФормы.ДокументСписок.НастройкаОтбора.ПометкаУдаления.Доступность = Ложь;
	
	ФормаВыбора.Отбор.РабочийЛист.ВидСравнения = ВидСравнения.Равно;
	ФормаВыбора.Отбор.РабочийЛист.Значение = ТекущийРабочийЛист;
	ФормаВыбора.Отбор.РабочийЛист.Использование = Истина;
	ФормаВыбора.ЭлементыФормы.ДокументСписок.НастройкаОтбора.РабочийЛист.Доступность = Ложь;	
	
	ФормаВыбора.Открыть();	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаявкаНаГарантиюПриИзменении(Элемент)
	ОбновитьДанныеПоГарантии();
	
	ПересчитатьЦенуАвто();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоПродуктам()
	ОбновитьДанныеПоГарантии();
	ОбновитьДанныеПоСтраховке(Истина, Истина);
	ОбновитьДанныеПоКредиту();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоГарантии()
	Если ЗначениеЗаполнено(ЗаявкаНаГарантию) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_CRM_ЗаявкаНаГарантию.Сумма,
		|	Renault_CRM_ЗаявкаНаГарантию.ПродленнаяГарантия
		|ИЗ
		|	Документ.Renault_CRM_ЗаявкаНаГарантию КАК Renault_CRM_ЗаявкаНаГарантию
		|ГДЕ
		|	Renault_CRM_ЗаявкаНаГарантию.Ссылка = &ЗаявкаНаГарантию";		
		Запрос.УстановитьПараметр("ЗаявкаНаГарантию", ЗаявкаНаГарантию); 		
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();		
		Выборка.Следующий();
		
		ГарантияСумма = Выборка.Сумма;
		ПродленнаяГарантия = Выборка.ПродленнаяГарантия;
	Иначе
		ГарантияСумма = 0;
		ПродленнаяГарантия = Справочники.CRM_ПредложенияПродленнойГарантии.ПустаяСсылка();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоСтраховке(ЭтоОСАГО, ЭтоКАСКО)
	Если ЭтоОСАГО Тогда
		Если ЗначениеЗаполнено(ЗаявкаНаСтраховку) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Renault_CRM_ЗаявкаНаСтраховку.Сумма,
			|	Renault_CRM_ЗаявкаНаСтраховку.СтраховаяКомпания,
			|	Renault_CRM_ЗаявкаНаСтраховку.ВидСтраховойПрограммы
			|ИЗ
			|	Документ.Renault_CRM_ЗаявкаНаСтраховку.ВариантыСтрахования КАК Renault_CRM_ЗаявкаНаСтраховку
			|ГДЕ
			|	Renault_CRM_ЗаявкаНаСтраховку.Ссылка = &ЗаявкаНаСтраховку
			|	И Renault_CRM_ЗаявкаНаСтраховку.ВидСтраховойПрограммы = ЗНАЧЕНИЕ(Справочник.Удалить_CRM_ВидыСтраховыхПрограмм.Осаго)";		
			Запрос.УстановитьПараметр("ЗаявкаНаСтраховку", ЗаявкаНаСтраховку); 
			Результат = Запрос.Выполнить();
			
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			
			ИнтересовалсяСтраховкой = Истина;
			СтраховкаОСАГОВключать = Истина;
		Иначе
			СтраховкаОСАГОВключать = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоКАСКО Тогда
		Если ЗначениеЗаполнено(ЗаявкаНаСтраховкуКАСКО) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Renault_CRM_ЗаявкаНаСтраховку.Сумма,
			|	Renault_CRM_ЗаявкаНаСтраховку.СтраховаяКомпания
			|ИЗ
			|	Документ.Renault_CRM_ЗаявкаНаСтраховку.ВариантыСтрахования КАК Renault_CRM_ЗаявкаНаСтраховку
			|ГДЕ
			|	Renault_CRM_ЗаявкаНаСтраховку.Ссылка = &ЗаявкаНаСтраховкуКАСКО
			|	И Renault_CRM_ЗаявкаНаСтраховку.ВидСтраховойПрограммы = ЗНАЧЕНИЕ(Справочник.Удалить_CRM_ВидыСтраховыхПрограмм.Каско)";
			Запрос.УстановитьПараметр("ЗаявкаНаСтраховкуКАСКО", ЗаявкаНаСтраховкуКАСКО); 		
			Результат = Запрос.Выполнить();
			
			Выборка = Результат.Выбрать();		
			Выборка.Следующий();
			
			ИнтересовалсяСтраховкой = Истина;
			СтраховкаКАСКОВключать = Истина;
		Иначе
			СтраховкаКАСКОВключать = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ОстальноеСтраховка.Видимость = ИнтересовалсяСтраховкой;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоКредиту()
	Если ЗначениеЗаполнено(ЗаявкаНаКредит) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_CRM_ЗаявкаНаКредит.Сумма КАК СуммаКредита,
		|	Renault_CRM_ЗаявкаНаКредит.БанкПредоставляющийКредит КАК Банк,
		|	Renault_CRM_ЗаявкаНаКредит.Ставка КАК СтавкаБанка,
		|	Renault_CRM_ЗаявкаНаКредит.Срок,
		|	Renault_CRM_ЗаявкаНаКредит.ПервоночальныйВзнос,
		|	Renault_CRM_ЗаявкаНаКредит.ЕжемесячныйПлатеж
		|ИЗ
		|	Документ.Renault_CRM_ЗаявкаНаКредит КАК Renault_CRM_ЗаявкаНаКредит
		|ГДЕ
		|	Renault_CRM_ЗаявкаНаКредит.Ссылка = &ЗаявкаНаГарантию";		
		Запрос.УстановитьПараметр("ЗаявкаНаГарантию", ЗаявкаНаКредит); 		
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();		
		Выборка.Следующий();
		
		Банк = Выборка.Банк;
		СтавкаБанка = Выборка.СтавкаБанка;
		СрокКредита = Выборка.Срок;
		ПервоначальныйВзносСумма = Выборка.ПервоночальныйВзнос;
		ЕжемесячныйПлатеж = Выборка.ЕжемесячныйПлатеж;
		СуммаКредита = Выборка.СуммаКредита;
	Иначе
		Банк = Справочники.Банки.ПустаяСсылка();
		СтавкаБанка = 0;
		СрокКредита = 0;
		ПервоначальныйВзносСумма = 0;
		ЕжемесячныйПлатеж = 0;
		СуммаКредита = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаСтраховкуКАСКОПриИзменении(Элемент)
	ОбновитьДанныеПоСтраховке(Ложь, Истина);
	
	ПересчитатьЦенуАвто();
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаСтраховкуКАСКОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Форма = Документы.Renault_CRM_ЗаявкаНаСтраховку.ПолучитьФормуВыбора(, Элемент);
	
	Форма.Отбор.Закрыта.ВидСравнения = ВидСравнения.Равно;
	Форма.Отбор.Закрыта.Значение = ложь;
	Форма.Отбор.Закрыта.Использование = Истина;
	
	Форма.Отбор.ПометкаУдаления.ВидСравнения = ВидСравнения.Равно;
	Форма.Отбор.ПометкаУдаления.Значение = Ложь;
	Форма.Отбор.ПометкаУдаления.Использование = Истина;
	
	//Форма.Отбор.Черновик.ВидСравнения = ВидСравнения.Равно;
	//Форма.Отбор.Черновик.Значение = ложь;
	//Форма.Отбор.Черновик.Использование = Истина;
	
	Форма.Отбор.ВидСтраховойПрограммы.ВидСравнения = ВидСравнения.Равно;
	Форма.Отбор.ВидСтраховойПрограммы.Значение = Справочники.Удалить_CRM_ВидыСтраховыхПрограмм.Каско;
	Форма.Отбор.ВидСтраховойПрограммы.Использование = Истина;
	
	Форма.Отбор.РабочийЛист.ВидСравнения = ВидСравнения.Равно;
	Форма.Отбор.РабочийЛист.Значение = ТекущийРабочийЛист;
	Форма.Отбор.РабочийЛист.Использование = Истина;
	
	Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаКредит1ПриИзменении(Элемент)
	ОбновитьДанныеПоКредиту();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМенеджераОбслуживания(КлиентКП)
	МенеджерОбслуживания = Справочники.Сотрудники.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_РабочиеЛисты.ДилерскийЦентр.КонтактЛицоОбслуживанияКорпКлиента КАК МенеджерОбслуживания
	|ИЗ
	|	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	|ГДЕ
	|	Renault_РабочиеЛисты.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.Renault_ТипыКлиентов.КорпоративныйКлиент)
	|	И Renault_РабочиеЛисты.Клиент = &Клиент"; 	
	Запрос.УстановитьПараметр("Клиент", КлиентКП); 	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда	
		Выборка = Результат.Выбрать();		
		Выборка.Следующий();
		
		МенеджерОбслуживания = Выборка.МенеджерОбслуживания;
	КонецЕсли;
	
	Возврат МенеджерОбслуживания;
КонецФункции

&НаКлиенте
Процедура ОбновитьДанныеПоСтраховки(Команда)
	ЗагрузитьЗаявкуНаСтраховку();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОпцииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ТарифНаОпцииАвтомобилейСрезПоследних.НаименованиеОпции КАК Опция,
	|	Renault_ТарифНаОпцииАвтомобилейСрезПоследних.Базовая
	|ИЗ
	|	РегистрСведений.Renault_ТарифНаОпцииАвтомобилей.СрезПоследних КАК Renault_ТарифНаОпцииАвтомобилейСрезПоследних
	|ГДЕ
	|	Renault_ТарифНаОпцииАвтомобилейСрезПоследних.Модель = &Модель
	|	И Renault_ТарифНаОпцииАвтомобилейСрезПоследних.Тариф = &Тариф
	|
	|СГРУППИРОВАТЬ ПО
	|	Renault_ТарифНаОпцииАвтомобилейСрезПоследних.НаименованиеОпции,
	|	Renault_ТарифНаОпцииАвтомобилейСрезПоследних.Базовая
	|
	|УПОРЯДОЧИТЬ ПО
	|	Renault_ТарифНаОпцииАвтомобилейСрезПоследних.НаименованиеОпции";
	
	Запрос.УстановитьПараметр("Модель", Модель);
	Запрос.УстановитьПараметр("Тариф", ТекущийТариф);
	ОпцииОтбора.Загрузить(Запрос.Выполнить().Выгрузить());
	СписокОпцийОтбора.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКППНаСервере()
	
	КППОтбора.Очистить();
	
	ТипКппОтбор = Справочники.ТипыКПП.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(Версия) Тогда
		СписокКомплектаций = Новый СписокЗначений;
		СписокКомплектаций.Добавить(Версия);
	Иначе
		СписокКомплектаций = ТаблицаКомплектации.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВариантыКомплектации.ТипКПП КАК ТипКПП
	|ИЗ
	|	Справочник.ВариантыКомплектации КАК ВариантыКомплектации
	|ГДЕ
	|	ВариантыКомплектации.Ссылка В(&Комплектация)
	|	И ВариантыКомплектации.ТипКПП <> ЗНАЧЕНИЕ(Справочник.ТипыКПП.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипКПП";
	
	Запрос.УстановитьПараметр("Комплектация", СписокКомплектаций);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество()>0 Тогда
		КППОтбора.Загрузить(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДвигателиНаСервере()
	
	ДвигательОтбора.Очистить();
	ТипДвигателяОтбор = "";
	
	Если ЗначениеЗаполнено(Версия) Тогда
		СписокКомплектаций = Новый СписокЗначений;
		СписокКомплектаций.Добавить(Версия);
	Иначе
		СписокКомплектаций = ТаблицаКомплектации.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Renault_ДопИнформацияПоВерсиям.ТипТоплива КАК Двигатель
	|ИЗ
	|	РегистрСведений.Renault_ТарифНаКомплектацииАвтомобилей.СрезПоследних(
	|			,
	|			Тариф = &Тариф) КАК Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ДопИнформацияПоВерсиям КАК Renault_ДопИнформацияПоВерсиям
	|		ПО Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ВариантКомплектации = Renault_ДопИнформацияПоВерсиям.ВариантКомплектации
	|		
	//|	РегистрСведений.Renault_ДопИнформацияПоВерсиям КАК Renault_ДопИнформацияПоВерсиям
	|ГДЕ
	|	Renault_ДопИнформацияПоВерсиям.ВариантКомплектации В(&Комплектация)
	|	И НЕ Renault_ДопИнформацияПоВерсиям.ТипТоплива = """"";
	
	Запрос.УстановитьПараметр("Комплектация", СписокКомплектаций);
	Запрос.УстановитьПараметр("Тариф", ТекущийТариф);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ДвигательОтбора.Загрузить(Результат);
	
	Если ДвигательОтбора.Количество()=1 Тогда
		Элементы.ГруппаДвигатели.Видимость = Ложь;
	Иначе
		Элементы.ГруппаДвигатели.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Модель1ПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Модель) Тогда
		ПроверитьПервичнуюМодель();
		ЗаполнитьОпцииНаСервере();
		ОбновитьСписокКонфигураций(Модель);
		ЗаполнитьДвигателиНаСервере();
		ЗаполнитьКППНаСервере();
		ОбновитьСписокЦветов(Модель);
		ПодключитьОбработчикОжидания("ОбновитьКартинкуМоделиКлиент", 0.2, Истина);
		ПриИзмененииМоделиАвто();
		
		// ++ Ковалев ЕС от 23.08.2018
		ДанныеПередачиСтруктура = ЗаполнитьДатыПередачиАвтомобиляБезVIN(ДЦ, Модель, ТекущийРабочийЛист);
		РасчетнаяДатаПередачи     = ДанныеПередачиСтруктура.РасчетнаяДатаПередачи;
		ДатаНачалаПередачиАвто	  = ДанныеПередачиСтруктура.ДатаНачалаПередачиАвто;
		ДатаОкончанияПередачиАвто = ДанныеПередачиСтруктура.ДатаОкончанияПередачиАвто;
		// -- Ковалев ЕС от 23.08.2018
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьПервичнуюМодель ()
	
	ТекРЛ = Renault_CRM.ПолучитьЗаписьРЛПоIDK(ТекущийРабочийЛист);
	Если ТекРЛ <> Неопределено И Модель = ТекРЛ.МодельАвтомобиля Тогда
		ОтборПоЦветам = Истина;
		ТекНаборЦветов = ТекРЛ.Цвет;
	иначе
		ОтборПоЦветам = Ложь;
		ТекНаборЦветов = Справочники.Renault_НаборЦветов.ПустаяСсылка();
	КонецЕсли;
	Если ОтборПоЦветам Тогда 
		Элементы.ТекНаборЦветов.ТолькоПросмотр = Ложь;
	Иначе 
		Элементы.ТекНаборЦветов.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ВыполнитьОтборКомплектацийПоОпциям()
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОпцииОтбораПриИзменении(Элемент)
	
	//СтандартнаяОбработка = Ложь;
	//Элемент.ТекущиеДанные.Выбрана = НЕ Элемент.ТекущиеДанные.Выбрана;
	СписокОпцийОтбора = Новый СписокЗначений;
	Для каждого стр из ОпцииОтбора Цикл
		Если Стр.Выбрана Тогда
			Если СписокОпцийОтбора.НайтиПоЗначению(Стр.Опция) = Неопределено Тогда
				СписокОпцийОтбора.Добавить(Стр.Опция);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	//Если СписокОпцийОтбора.Количество() = 0 Тогда
	//	ОбновитьСписокКонфигураций(Модель);
	//Иначе	
	ОбновитьСписокКонфигурацийПоОпциям();
	//КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокКонфигурацийПоОпциям()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ДопИнформацияПоВерсиям.ВариантКомплектации
	|ПОМЕСТИТЬ КонфигурацииПоДвигателюКПП
	|ИЗ
	|	РегистрСведений.Renault_ДопИнформацияПоВерсиям КАК Renault_ДопИнформацияПоВерсиям
	|ГДЕ
	|	(&НеОтбиратьПоТопливу
	|			ИЛИ Renault_ДопИнформацияПоВерсиям.ТипТоплива ПОДОБНО &ТипТоплива)
	|	И (&НеОтбиратьПоКПП
	|			ИЛИ Renault_ДопИнформацияПоВерсиям.ВариантКомплектации.ТипКПП В (&ТипКппОтбор)
	|			ИЛИ Renault_ДопИнформацияПоВерсиям.Трансмиссия В (&ТипКппОтбор))
	//|			ИЛИ Renault_ДопИнформацияПоВерсиям.ВариантКомплектации.ТипКПП = &ТипКппОтбор
	//|			ИЛИ Renault_ДопИнформацияПоВерсиям.Трансмиссия = &ТипКппОтбор)
	|
	|СГРУППИРОВАТЬ ПО
	|	Renault_ДопИнформацияПоВерсиям.ВариантКомплектации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_ТарифНаОпцииАвтомобилейСрезПоследних.ВариантКомплектации,
	|	СУММА(1) КАК КоличествоОпций
	|ПОМЕСТИТЬ КомплектацииПоОпциям
	|ИЗ
	|	РегистрСведений.Renault_ТарифНаОпцииАвтомобилей.СрезПоследних(
	|			,
	|			Тариф = &Тариф
	|				И Модель = &Модель
	|				И (&НеОтбиратьПООпциям
	|					ИЛИ Опция.Наименование В (&СписокОпцийОтбора))) КАК Renault_ТарифНаОпцииАвтомобилейСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	Renault_ТарифНаОпцииАвтомобилейСрезПоследних.ВариантКомплектации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	"""""""" КАК Комплектация,
	|	&ПустаяСтрока КАК Ссылка,
	|	"""""""" КАК Код,
	|	"""""""" КАК Наименование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ВариантКомплектации.НаименованиеПолное,
	|	Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ВариантКомплектации.Ссылка,
	|	Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ВариантКомплектации.Артикул,
	|	ПОДСТРОКА(Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ВариантКомплектации.НаименованиеПолное, 0, 150)
	|ИЗ
	|	РегистрСведений.Renault_ТарифНаКомплектацииАвтомобилей.СрезПоследних(
	|			,
	|			Тариф = &Тариф
	|				И Модель = &Модель) КАК Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КонфигурацииПоДвигателюКПП КАК КонфигурацииПоДвигателюКПП
	|		ПО Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ВариантКомплектации = КонфигурацииПоДвигателюКПП.ВариантКомплектации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КомплектацииПоОпциям КАК КомплектацииПоОпциям
	|		ПО Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ВариантКомплектации = КомплектацииПоОпциям.ВариантКомплектации
	|			И (&НеОтбиратьПООпциям
	|				ИЛИ КомплектацииПоОпциям.КоличествоОпций = &КоличествоОпций)
	|ГДЕ
	|	(Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ДоступноКЗаказуВПроизводство = ИСТИНА
	|			ИЛИ НЕ &СкрыватьНедоступныеКЗаказу)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ДопИнформацияПоВерсиям.ВариантКомплектации КАК ВариантКомплектации
	|ПОМЕСТИТЬ КонфигурацииПоДвигателюКПП
	|ИЗ
	|	РегистрСведений.Renault_ДопИнформацияПоВерсиям КАК Renault_ДопИнформацияПоВерсиям
	|ГДЕ
	|	(&НеОтбиратьПоТопливу
	|			ИЛИ Renault_ДопИнформацияПоВерсиям.ТипТоплива ПОДОБНО &ТипТоплива)
	|	И (&НеОтбиратьПоКПП
	|			ИЛИ Renault_ДопИнформацияПоВерсиям.ВариантКомплектации.ТипКПП В (&ТипКппОтбор)
	|			ИЛИ Renault_ДопИнформацияПоВерсиям.Трансмиссия В (&ТипКппОтбор))
	|
	|СГРУППИРОВАТЬ ПО
	|	Renault_ДопИнформацияПоВерсиям.ВариантКомплектации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПустаяСтрока КАК Ссылка
	|ПОМЕСТИТЬ ВТКомплектации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ВариантКомплектации
	|ИЗ
	|	РегистрСведений.Renault_ТарифНаКомплектацииАвтомобилей.СрезПоследних(
	|			,
	|			Тариф = &Тариф
	|				И Модель = &Модель) КАК Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних
	|ГДЕ
	|	(Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ДоступноКЗаказуВПроизводство = ИСТИНА
	|			ИЛИ НЕ &СкрыватьНедоступныеКЗаказу)
	|	И Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.Модель.ПометкаУдаления = ЛОЖЬ
	|	И Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ВариантКомплектации.ПометкаУдаления = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(
	|			,
	|			СкладКомпании В (&СкладыДилера)
	|				И Автомобиль.Модель = &Модель) КАК ОстаткиАвтомобилейОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ЗаконтрактованныеАвтомобили.СрезПоследних КАК Renault_ЗаконтрактованныеАвтомобилиСрезПоследних
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = Renault_ЗаконтрактованныеАвтомобилиСрезПоследних.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_УтвержденныеРезервы КАК Renault_УтвержденныеРезервы
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = Renault_УтвержденныеРезервы.Автомобиль
	|ГДЕ
	|	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0
	|	И Renault_ЗаконтрактованныеАвтомобилиСрезПоследних.Автомобиль ЕСТЬ NULL
	|	И Renault_УтвержденныеРезервы.Автомобиль ЕСТЬ NULL
	|	И НЕ &ТолькоДоступныеКЗаказуВерсии
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Renault_ОстаткиАвтомобилейДругихТочек.Автомобиль.ВариантКомплектации
	|ИЗ
	|	РегистрСведений.Renault_ОстаткиАвтомобилейДругихТочек КАК Renault_ОстаткиАвтомобилейДругихТочек
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ЗаконтрактованныеАвтомобили.СрезПоследних КАК Renault_ЗаконтрактованныеАвтомобилиСрезПоследних
	|		ПО Renault_ОстаткиАвтомобилейДругихТочек.Автомобиль = Renault_ЗаконтрактованныеАвтомобилиСрезПоследних.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_УтвержденныеРезервы КАК Renault_УтвержденныеРезервы
	|		ПО Renault_ОстаткиАвтомобилейДругихТочек.Автомобиль = Renault_УтвержденныеРезервы.Автомобиль
	|ГДЕ
	|	Renault_ЗаконтрактованныеАвтомобилиСрезПоследних.Автомобиль ЕСТЬ NULL
	|	И Renault_УтвержденныеРезервы.Автомобиль ЕСТЬ NULL
	|	И Renault_ОстаткиАвтомобилейДругихТочек.Автомобиль.Модель = &Модель
	|	И НЕ &ТолькоДоступныеКЗаказуВерсии
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СостояниеАвтомобилей.Автомобиль.ВариантКомплектации
	|ИЗ
	|	РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК СостояниеАвтомобилей
	|ГДЕ
	|	СостояниеАвтомобилей.Автомобиль <> ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка)
	|	И СостояниеАвтомобилей.Модель = &Модель
	|	И СостояниеАвтомобилей.Статус = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыАвтомобилей.ВпутиКДилеру)
	|	И НЕ &ТолькоДоступныеКЗаказуВерсии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_ТарифНаОпцииАвтомобилейСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
	|	СУММА(1) КАК КоличествоОпций
	|ПОМЕСТИТЬ КомплектацииПоОпциям
	|ИЗ
	|	РегистрСведений.Renault_ТарифНаОпцииАвтомобилей.СрезПоследних(
	|			,
	|			Тариф = &Тариф
	|				И Модель = &Модель
	|				И (&НеОтбиратьПООпциям
	|					ИЛИ Опция.Наименование В (&СписокОпцийОтбора))) КАК Renault_ТарифНаОпцииАвтомобилейСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	Renault_ТарифНаОпцииАвтомобилейСрезПоследних.ВариантКомплектации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТКомплектации.Ссылка КАК Ссылка,
	|	ВТКомплектации.Ссылка.Артикул КАК Код,
	|	ВЫРАЗИТЬ(ВТКомплектации.Ссылка.НаименованиеПолное КАК СТРОКА(150)) КАК Комплектация
	|ИЗ
	|	ВТКомплектации КАК ВТКомплектации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КомплектацииПоОпциям КАК КомплектацииПоОпциям
	|		ПО (ВТКомплектации.Ссылка.Ссылка = КомплектацииПоОпциям.ВариантКомплектации
	|				И (&НеОтбиратьПООпциям
	|					ИЛИ КомплектацииПоОпциям.КоличествоОпций = &КоличествоОпций))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КонфигурацииПоДвигателюКПП КАК КонфигурацииПоДвигателюКПП
	|		ПО ВТКомплектации.Ссылка = КонфигурацииПоДвигателюКПП.ВариантКомплектации
	|ГДЕ
	|	НЕ ВТКомплектации.Ссылка ЕСТЬ NULL
	|	И (&НеОтбиратьПООпциям
	|			ИЛИ КомплектацииПоОпциям.КоличествоОпций = &КоличествоОпций)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Комплектация";

	
	
	Запрос.УстановитьПараметр("НеОтбиратьПоТопливу",?(ЗначениеЗаполнено(ТипДвигателяОтбор),Ложь,Истина));
	Запрос.УстановитьПараметр("ТипТоплива", ТипДвигателяОтбор);
	
	//Запрос.УстановитьПараметр("НеОтбиратьПоКПП",?(ЗначениеЗаполнено(ТипКппОтбор),Ложь,Истина));
	//Запрос.УстановитьПараметр("ТипКппОтбор",ТипКппОтбор);
	
	//
	МассивТипКппОтбор = Новый Массив;
	Для Каждого Стр Из КППОтбора Цикл		
		Если Стр.Выбрана Тогда
			МассивТипКппОтбор.Добавить(Стр.ТипКПП);
		КонецЕсли;		
	КонецЦикла;	
	Запрос.УстановитьПараметр("ТипКппОтбор",МассивТипКппОтбор);
	Запрос.УстановитьПараметр("НеОтбиратьПоКПП",?(МассивТипКппОтбор.Количество()>0,Ложь,Истина));
	//
	
	Запрос.УстановитьПараметр("НеОтбиратьПООпциям",?(СписокОпцийОтбора.Количество()=0,Истина,Ложь));
	Запрос.УстановитьПараметр("КоличествоОпций",СписокОпцийОтбора.Количество());
	Запрос.УстановитьПараметр("СписокОпцийОтбора",СписокОпцийОтбора);
	Запрос.УстановитьПараметр("Модель", Модель);
	Запрос.УстановитьПараметр("Тариф", ТекущийТариф);
	Запрос.УстановитьПараметр("ПустаяСтрока", Справочники.ВариантыКомплектации.ПустаяСсылка());
	Запрос.УстановитьПараметр("СкрыватьНедоступныеКЗаказу", Не ЗначениеЗаполнено(Автомобиль) ИЛИ ТолькоДоступныеКЗаказуВерсии);
	Запрос.УстановитьПараметр("ТолькоДоступныеКЗаказуВерсии",ТолькоДоступныеКЗаказуВерсии);
	
	ДЦ =Renault_CRM.ПолучитьДилерскийЦентрПользователя();
	Запрос.УстановитьПараметр("СкладыДилера", ДЦ.СкладыДилера.ВыгрузитьКолонку("Склад"));
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Если Таблица.Количество() = 1 Тогда
		Таблица.Очистить();
	Иначе
	КонецЕсли;
	
	ТаблицаКомплектации.Загрузить(Таблица);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипДвигателяОтборПриИзменении(Элемент)
	
	ОбновитьСписокКонфигурацийПоОпциям();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКомплектацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьЗначение(Элемент.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкиОтбораОпций(Команда)
	
	Для каждого стр из ОпцииОтбора Цикл
		стр.выбрана = Ложь;
	КонецЦикла;
	СписокОпцийОтбора = Новый СписокЗначений;
	ОбновитьСписокКонфигурацийПоОпциям();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоЦветамПриИзменении(Элемент)
	Если ОтборПоЦветам Тогда 
		Элементы.ТекНаборЦветов.ТолькоПросмотр = Ложь;
	Иначе
		ТекНаборЦветов = Справочники.Renault_НаборЦветов.ПустаяСсылка();
		Элементы.ТекНаборЦветов.ТолькоПросмотр = Истина;
	КонецЕсли;
	ОбновитьСписокЦветов(Модель);
КонецПроцедуры

&НаКлиенте
Процедура ТекНаборЦветовПриИзменении(Элемент)
	
	Если ОтборПоЦветам Тогда 
		Элементы.ТекНаборЦветов.ТолькоПросмотр = Ложь;
	Иначе
		ТекНаборЦветов = Справочники.Renault_НаборЦветов.ПустаяСсылка();
		Элементы.ТекНаборЦветов.ТолькоПросмотр = Истина;
	КонецЕсли;
	ОбновитьСписокЦветов(Модель);
КонецПроцедуры

&НаКлиенте
Процедура ТекНаборЦветовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Не ЗначениеЗаполнено(Модель) Тогда    
		Предупреждение("Предварительно необходимо выбрать модель");
		Возврат;
	КонецЕсли;
	ФормаЦвета = Справочники.Renault_НаборЦветов.ПолучитьФормуВыбора("ФормаВыбора");
	ФормаЦвета.СправочникСписок.Отбор.Владелец.Значение = Модель;
	ФормаЦвета.СправочникСписок.Отбор.Владелец.Использование = Истина;
	ответ = ФормаЦвета.ОткрытьМодально();
	Если ответ <> Неопределено Тогда
		ТекНаборЦветов = ответ;
	КонецЕсли;
	ОбновитьСписокЦветов(Модель);
КонецПроцедуры

//Козлов Е.А. Начало 25.10.2016
&НаКлиенте
Процедура Модель1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ФормаВыбора = ПолучитьФорму("Обработка.CRM_АРМ_Конфигуратор.Форма.ФормаВыбораМоделиОбычная");
	ФормаВыбора.ВыбМодель = Модель;
	ВыбМодель = ФормаВыбора.ОткрытьМодально();
	// начало изменение Зеленчук 2017.12.13
	// Инициатор Михаил. п. 87
	Если ЗначениеЗаполнено(ВыбМодель) И ВыбМодель <> Модель Тогда
		Модель = ВыбМодель;
		Модель1ПриИзменении(Неопределено);	
	КонецЕсли;
	// окончание изменение Зеленчук 2017.12.13
	
КонецПроцедуры
//Козлов Е.А. Конец

&НаКлиенте
Процедура ОткрытьРабочийЛистПриема(Команда)
	
	// Трояновский К.Е. 12.08.2019 10:58:15 {
	//ЗаписьРЛ = Renault_CRM.ПолучитьЗаписьРЛПоIDK(ТекущийРабочийЛист);
	ЗаписьРЛ = Renault_CRM.докПолучитьЗаписьРЛПоIDK(ТекущийРабочийЛист);	
	// Трояновский К.Е. 12.08.2019 10:58:15 }
	
	Если ЗначениеЗаполнено(ЗаписьРЛ.СвязаныйIDK) И ЗаписьРЛ.СвязаныйIDK <> ЗаписьРЛ.IDK Тогда
		
		// Трояновский К.Е. 12.08.2019 11:39:44 {
		//ЗаписьСвязанного = Renault_CRM.ПолучитьЗаписьРЛПоIDK(ЗаписьРЛ.СвязаныйIDK);
		РЛСсылка = Renault_CRM.докПолучитьЗаписьРЛПоIDK(ЗаписьРЛ.СвязаныйIDK);
		ЗаписьСвязанного = РЛСсылка.ПолучитьОбъект();
		// Трояновский К.Е. 12.08.2019 11:39:44 }
		
		Если Не ЗначениеЗаполнено(ЗаписьСвязанного.СвязаныйIDK) Тогда
			
			ЗаписьСвязанного.СвязаныйIDK = ЗаписьРЛ.IDK;
			ЗаписьСвязанного.Записать();
			
		КонецЕсли;
		
		// Трояновский К.Е. 12.08.2019 11:40:08 {
		//Renault_CRM.ОткрытьФормуРЛ(ЗаписьРЛ.СвязаныйIDK);
		Renault_CRM.докОткрытьФормуРЛ(ЗаписьРЛ.СвязаныйIDK);
		// Трояновский К.Е. 12.08.2019 11:40:08 }
		
		Возврат;
		
	КонецЕсли;
	
	
КонецПроцедуры

//v+
&НаКлиенте
Функция ТипКП()
	Если ЗначениеЗаполнено(ТипКП) Тогда Возврат ТипКП КонецЕсли;
	
	Сп=Новый СписокЗначений;
	Сп.Добавить(Перечисления.Renault_ТипКП.НовыйАвтомобиль);
	Сп.Добавить(Перечисления.Renault_ТипКП.АвтомобильСПробегом);
	Парам=Новый Структура;
	Парам.Вставить("Список",Сп);
	Парам.Вставить("Заголовок","Тип коммерческого предожения");
	//Парам.Вставить("МножественныйВыбор",Ложь);
	Парам.Вставить("КоличествоЭлементовВСтроке",2);
	Парам.Вставить("ШиринаЭлемента",17);
	Парам.Вставить("ВысотаЭлемента",2);
	ТипКП=ОткрытьФормуМодально("ОбщаяФорма.Renault_ДиалогВыбораСпискаЗначений",Парам,ЭтаФорма);
	Возврат ?(ТипКП=Неопределено,Перечисления.Renault_ТипКП.НовыйАвтомобиль,ТипКП);
КонецФункции

&НаКлиенте
Процедура ОткрытьКалькулятор(Команда)
	
	Парам=Новый Структура;
	Парам.Вставить("Клиент",ТекущийКлиент);
	Парам.Вставить("Автомобиль", Автомобиль); //DMSREN-439 было "Модель"
	//Парам.Вставить("Версия",Объект.Версия);
	Парам.Вставить("ТипКП",Перечисления.Renault_ТипКП.НовыйАвтомобиль);
	Парам.Вставить("СтоимостьАвтомобиля",ЦенаВариантаКомплектации+ЦенаДопОпций+ЦенаОборудования+ЦенаВыкупа+СуммаСкидки);
	
	//Данные=ОткрытьФормуМодально("Документ.Renault_РабочийЛистОФУ.Форма.РасчетКредита",Парам,ЭтаФорма,УникальныйИдентификатор);
	Если Renault_ОбщиеФункции.СтараяПлатформа() Тогда
		Данные=ОткрытьФормуМодально("Документ.Renault_РабочийЛистОФУ.Форма.РасчетКредита",Парам,ЭтаФорма)
	Иначе
		Выполнить("Данные=ОткрытьФормуМодально(""Документ.Renault_РабочийЛистОФУ.Форма.РасчетКредита"",Парам,ЭтаФорма,УникальныйИдентификатор)")
	КонецЕсли;	
	
	Если Данные<>Неопределено Тогда
		Банк=Данные.КредитноеПредложение.Владелец;
		КредитноеПредложение=Данные.КредитноеПредложение;
		СтавкаБанка=Данные.СтавкаБанка;
		СрокКредита=Данные.СрокКредита;
		ЕжемесячныйПлатеж=Данные.ЕжемесячныйПлатеж;
		ПервоначальныйВзносСумма=Данные.ПервоначальныйВзнос;
	КонецЕсли;	
	
	ПересчитатьЦенуАвто();	
	
	//Обработка = Обработки.Renault_КредитныйКалькулятор.Создать();
	//Обработка.АннуитетныеПлатежи = Истина;
	//Обработка.Стоимость = ЦенаИТОГО;
	//Обработка.ПолучитьФорму().Открыть();
КонецПроцедуры

Процедура ДобавитьДопОпции()
	
	СтрокиУдалить = Новый Массив;
	//очистим предыдущие обязательные
	Для Каждого Стр Из ВыбранноеОборудование.НайтиСтроки(Новый Структура("Обязательное",Истина)) Цикл
		СтрокиУдалить.Добавить(Стр);
	КонецЦикла;
	
	Пока СтрокиУдалить.Количество() > 0 Цикл
		ВыбранноеОборудование.Удалить(СтрокиУдалить[0]);
		СтрокиУдалить.Удалить(0);
	КонецЦикла;
	
	//добавляем обязательное допоборудование	
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("ДилерскийЦентр",Renault_CRM.ПолучитьДилерскийЦентрПользователя(ПараметрыСеанса.Пользователь));
	Запрос.УстановитьПараметр("Модель",Модель);
	Запрос.УстановитьПараметр("Версия",Версия);
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	Запрос.Текст="
	|Выбрать
	|	Истина Обязательное,
	|	ДопОборудование Номенклатура,
	|	Количество,
	|	Цена,
	|	Количество*Цена Сумма
	|Из РегистрСведений.Renault_ОбязательноеДопОборудования
	|ГДЕ ДилерскийЦентр=&ДилерскийЦентр И Модель=&Модель И Версия=&Версия 
	|	И ПериодНачало<=&ТекущаяДата
	|	И Выбор Когда ПериодОкончание=ДатаВремя(1,1,1) Тогда Истина Иначе ПериодОкончание>=&ТекущаяДата Конец 
	|";
	//ВыбранноеОборудование.Загрузить(Запрос.Выполнить().Выгрузить());
	Для Каждого Стр Из Запрос.Выполнить().Выгрузить() Цикл ЗаполнитьЗначенияСвойств(ВыбранноеОборудование.Добавить(),Стр) КонецЦикла;
	
	ИнтересовалсяОборудованием=ВыбранноеОборудование.Количество()>0;
	Элементы.ОстальноеДопОборудование.Видимость=ИнтересовалсяОборудованием;
	
КонецПроцедуры

&НаКлиенте
Процедура кнЗадачаОФУ(Команда) 
	Если ТекущийЭлемент.Имя="кнНаличные" или ТекущийЭлемент.Имя="кнКредит" Тогда //нал/кредит - создание задач
		СоздатьЗадачуОФУ(?(ТекущийЭлемент.Имя="кнНаличные",Справочники.CRM_ВидыСобытий.КонсультацияОФУ,Справочники.CRM_ВидыСобытий.Кредит));
	ИначеЕсли ТекущийЭлемент.Имя="кнЛизинг" Тогда
		СоздатьЗадачуОФУ(Справочники.CRM_ВидыСобытий.Лизинг)
	Иначе //остальные кнопки
		
		//многих задач быть не должно..., однако
		ЗадачиОФУ=ЗадачиОФУ();
		ЗадачиНал=ЗадачиОФУ.НайтиСтроки(Новый Структура("ВидСобытия",Справочники.CRM_ВидыСобытий.КонсультацияОФУ));
		ЗадачиКредит=ЗадачиОФУ.НайтиСтроки(Новый Структура("ВидСобытия",Справочники.CRM_ВидыСобытий.Кредит));
		ЗадачиЛизинг=ЗадачиОФУ.НайтиСтроки(Новый Структура("ВидСобытия",Справочники.CRM_ВидыСобытий.Лизинг));
		
		Если ТекущийЭлемент.Имя="кнНазначитьИсполнителя" Тогда //новый исполнитель
			//Если ЗадачиНал.Количество()=0 И ЗадачиКредит.Количество()=0 Тогда Возврат КонецЕсли;
			Ответ=Renault_ОбщиеФункции.ПолучитьМенеджераОФУ(ЭтаФорма, ?(ЗадачиОФУ.Количество()=0,СотрудникОФУ,ЗадачиОФУ[0].Ссылка.Сотрудник) );
			Если Ответ=Неопределено Тогда Возврат Иначе СотрудникОФУ=Ответ КонецЕсли; //для отложенной записи
			
			Для Каждого Стр Из ЗадачиНал Цикл Задачи.Renault_События.УстановитьАдресацию(Стр.Ссылка,СотрудникОФУ) КонецЦикла;
			Для Каждого Стр Из ЗадачиКредит Цикл Задачи.Renault_События.УстановитьАдресацию(Стр.Ссылка,СотрудникОФУ) КонецЦикла;
			Для Каждого Стр Из ЗадачиЛизинг Цикл Задачи.Renault_События.УстановитьАдресацию(Стр.Ссылка,СотрудникОФУ) КонецЦикла;
			
		ИначеЕсли ТекущийЭлемент.Имя="кнПередатьВОтдел" Тогда //новый исполнитель 
			Ответ=Renault_ОбщиеФункции.ПолучитьОтделОФУ(ЭтаФорма,?(ЗадачиОФУ.Количество()=0,ОтделОФУ,ЗадачиОФУ[0].Ссылка.Отдел));
			Если Ответ=Неопределено Тогда Возврат Иначе ОтделОФУ=Ответ КонецЕсли; //для отложенной записи
			
			Для Каждого Стр Из ЗадачиНал Цикл Задачи.Renault_События.УстановитьАдресацию(Стр.Ссылка,,ОтделОФУ) КонецЦикла;
			Для Каждого Стр Из ЗадачиКредит Цикл Задачи.Renault_События.УстановитьАдресацию(Стр.Ссылка,,ОтделОФУ) КонецЦикла;
			Для каждого Стр Из ЗадачиЛизинг Цикл Задачи.Renault_События.УстановитьАдресацию(Стр.Ссылка,,ОтделОФУ) КонецЦикла;
			
		ИначеЕсли ТекущийЭлемент.Имя="кнОтказатьсяОтКонсультации" Тогда //удалить задачу
			ОтказОтКонсультацииОФУ=Не ОтказОтКонсультацииОФУ;
			Если ОтказОтКонсультацииОФУ Тогда
				СоздатьЗадачу_ОФУ_Наличные=Ложь;
				СоздатьЗадачу_ОФУ_Кредит=Ложь;
				СоздатьЗадачу_ОФУ_Лизинг=Ложь;
			КонецЕсли;	
			
			Для Каждого Стр Из ЗадачиНал Цикл Задачи.Renault_События.УдалитьЗадачу(Стр.Ссылка) КонецЦикла;
			Для Каждого Стр Из ЗадачиКредит Цикл Задачи.Renault_События.УдалитьЗадачу(Стр.Ссылка) КонецЦикла;
			Для каждого Стр Из ЗадачиЛизинг Цикл Задачи.Renault_События.УдалитьЗадачу(Стр.Ссылка) КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	ПерекраситьКнопкиОФУ(ТекущийЭлемент.Имя);
	УправлениеКнопкамиОФУ();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерекраситьКнопкиОФУ(ИмяЭлемента);
	
	Если Элементы[ИмяЭлемента].ЦветФона = ЦветРено Тогда
		Элементы[ИмяЭлемента].ЦветФона = Новый Цвет(212, 212, 212);
	Иначе
		Элементы[ИмяЭлемента].ЦветФона = ЦветРено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадачуОФУ(ВидЗадачи)	
	
	//Если ПараметрыСеанса.DMS_Бренд = Справочники.CRM_МаркаАвтомобиля.LADA Тогда
	//	Возврат;
	//КонецЕсли;
	
	//если задача существует - открываем
	Задача=Задачи.Renault_События.НайтиЗадачуОФУ(ТекущееКП,ВидЗадачи); 
	
	Если ТекущееКП.Пустая() Тогда //отложенное создание при записи КП
		Если ТекущийЭлемент.Имя="кнНаличные" Тогда 
			СоздатьЗадачу_ОФУ_Наличные=Не СоздатьЗадачу_ОФУ_Наличные;
			СоздатьЗадачу_ОФУ_Кредит=Не СоздатьЗадачу_ОФУ_Наличные;
			СоздатьЗадачу_ОФУ_Лизинг=Не СоздатьЗадачу_ОФУ_Наличные;
		ИначеЕсли ТекущийЭлемент.Имя="кнКредит" Тогда 
			СоздатьЗадачу_ОФУ_Кредит=Не СоздатьЗадачу_ОФУ_Кредит;
			СоздатьЗадачу_ОФУ_Наличные=Не СоздатьЗадачу_ОФУ_Кредит;
			СоздатьЗадачу_ОФУ_Лизинг=Не СоздатьЗадачу_ОФУ_Кредит;
		Иначе //Лизинг
			СоздатьЗадачу_ОФУ_Лизинг=Не СоздатьЗадачу_ОФУ_Лизинг;
			СоздатьЗадачу_ОФУ_Наличные=Не СоздатьЗадачу_ОФУ_Лизинг;
			СоздатьЗадачу_ОФУ_Кредит=Не СоздатьЗадачу_ОФУ_Лизинг;
		КонецЕсли;
	Иначе //иначе создаем новую
		Если Не ЗначениеЗаполнено(Задача) Тогда
			Если ПараметрыСеанса.DMS_Бренд = Справочники.CRM_МаркаАвтомобиля.LADA Тогда
				ОтделОФУ = Renault_CRM.ПолучитьОтделАвтосалона();
			Иначе
				Если Не ЗначениеЗаполнено(ОтделОФУ) Тогда
					ОтделОФУ = Renault_ОбщиеФункции.ПолучитьОтделОФУ(ЭтаФорма);
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(ОтделОФУ) Тогда
				Задачи.Renault_События.СоздатьНовую(ТекущееКП,ВидЗадачи,,,,ОтделОФУ,СотрудникОФУ);
				Если ПараметрыСеанса.DMS_Бренд = Справочники.CRM_МаркаАвтомобиля.RENAULT Тогда
					Сообщить("Создана задача ОФУ",СтатусСообщения.Важное);
				КонецЕсли;
			Иначе
				Если ПараметрыСеанса.DMS_Бренд = Справочники.CRM_МаркаАвтомобиля.RENAULT Тогда
					Сообщить("Не выбран отдел ОФУ, задача не создана", СтатусСообщения.Важное);
				Иначе
					Сообщить("Не задан отдел продаж для дилерского центра, задача не создана", СтатусСообщения.Важное);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура УправлениеКнопкамиОФУ()
	
	ЦветКнопкиВоронкиСерый=Новый Цвет(212, 212, 212);
	ЦветСерый=Новый Цвет(156, 166, 178);
	
	ЗадачиОФУ=ЗадачиОФУ();
	СуществуетКонсультацияОФУ=(СоздатьЗадачу_ОФУ_Наличные и ТекущееКП.Пустая())ИЛИ ЗадачиОФУ.НайтиСтроки(Новый Структура("ВидСобытия",Справочники.CRM_ВидыСобытий.КонсультацияОФУ)).Количество()>0;
	//ВыполненаКонсультацияОФУ=ЗадачиОФУ.НайтиСтроки(Новый Структура("Состояние,ВидСобытия",Справочники.Renault_Состояния.ЗавершеноУспешно,Справочники.CRM_ВидыСобытий.КонсультацияОФУ)).Количество()>0;
	СуществуетКредит=(СоздатьЗадачу_ОФУ_Кредит и ТекущееКП.Пустая()) ИЛИ ЗадачиОФУ.НайтиСтроки(Новый Структура("ВидСобытия",Справочники.CRM_ВидыСобытий.Кредит)).Количество()>0;
	СуществуетЛизинг=(СоздатьЗадачу_ОФУ_Лизинг и ТекущееКП.Пустая()) ИЛИ ЗадачиОФУ.НайтиСтроки(Новый Структура("ВидСобытия",Справочники.CRM_ВидыСобытий.Лизинг)).Количество()>0;
	//ВыполненКредит=ЗадачиОФУ.НайтиСтроки(Новый Структура("Состояние,ВидСобытия",Справочники.Renault_Состояния.ЗавершеноУспешно,Справочники.CRM_ВидыСобытий.Кредит)).Количество()>0;
	
	Если ЗадачиОФУ.Количество()>0 Тогда
		Элементы.ОписаниеЗадачи.Заголовок = "Создана задача ОФУ ("+ЗадачиОФУ[0].Ссылка.Номер+" "+ЗадачиОФУ[0].ВидСобытия+")";		
	ИначеЕсли (СоздатьЗадачу_ОФУ_Наличные или СоздатьЗадачу_ОФУ_Кредит или СоздатьЗадачу_ОФУ_Лизинг) и ТекущееКП.Пустая() Тогда
		Элементы.ОписаниеЗадачи.Заголовок = "Задача ОФУ будет создана после записи ком. предложения";
	Иначе
		Элементы.ОписаниеЗадачи.Заголовок = "Задача ОФУ не создана";
	КонецЕсли;
	Элементы.кнКредит.ЦветФона=?(СуществуетКредит,ЦветРено,ЦветКнопкиВоронкиСерый);
	Элементы.кнКредит.ЦветРамки=?(СуществуетКредит,ЦветРено,ЦветСерый);
	
	Элементы.кнНаличные.ЦветФона=?(СуществуетКонсультацияОФУ,ЦветРено,ЦветКнопкиВоронкиСерый);
	Элементы.кнНаличные.ЦветРамки=?(СуществуетКонсультацияОФУ,ЦветРено,ЦветСерый);
	
	Элементы.кнОтказатьсяОтКонсультации.ЦветФона=?(ОтказОтКонсультацииОФУ,ЦветРено,ЦветКнопкиВоронкиСерый);
	Элементы.кнОтказатьсяОтКонсультации.ЦветРамки=?(ОтказОтКонсультацииОФУ,ЦветРено,ЦветКнопкиВоронкиСерый);
	
	Элементы.кнНаличные.Доступность=Не ОтказОтКонсультацииОФУ;
	Элементы.кнКредит.Доступность=Не ОтказОтКонсультацииОФУ;
	
	Элементы.кнОтказатьсяОтКонсультации.Доступность=ОтказОтКонсультацииОФУ или СуществуетКонсультацияОФУ или СуществуетКредит;
	Элементы.кнПередатьВОтдел.Доступность=НЕ ОтказОтКонсультацииОФУ И (СуществуетКонсультацияОФУ или СуществуетКредит);
	Элементы.кнНазначитьИсполнителя.Доступность=НЕ ОтказОтКонсультацииОФУ И (СуществуетКонсультацияОФУ или СуществуетКредит);
	Элементы.кнОтказатьсяОтКонсультации.ЦветФона = ЦветСерый;
	Элементы.кнНазначитьИсполнителя.ЦветФона = ЦветСерый;
	Элементы.кнПередатьВОтдел.ЦветФона = ЦветСерый;
	
	Если ОтказОтКонсультацииОФУ Тогда
		
		Элементы.кнОтказатьсяОтКонсультации.ЦветФона = ЦветРено;
		
	ИначеЕсли СуществуетКонсультацияОФУ или СуществуетКредит Тогда
		
		Для Каждого Стр Из ЗадачиОФУ Цикл
			
			Если Стр.ВидСобытия = Справочники.CRM_ВидыСобытий.КонсультацияОФУ
				ИЛИ Стр.ВидСобытия = Справочники.CRM_ВидыСобытий.Кредит Тогда
				
				Если ЗначениеЗаполнено(Стр.Ссылка.Сотрудник) Тогда
					Элементы.кнНазначитьИсполнителя.ЦветФона = ЦветРено;
				ИначеЕсли ЗначениеЗаполнено(Стр.Ссылка.Отдел) Тогда
					Элементы.кнПередатьВОтдел.ЦветФона = ЦветРено;
				КонецЕсли;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Элементы.ГруппаКредитНовая.Видимость = СуществуетКредит;
	
	//pu0XXXX+ КорпКлиенты и Кнопка Лизинг
	//Если КорпКлиент тогда вместо кнопки Кредит кнопка Лизинг
	// Трояновский К.Е. 12.08.2019 10:16:39 {
	//Если Renault_CRM.ПолучитьЗаписьРЛПоIDK(ТекущийРабочийЛист).ТипКлиента = Перечисления.Renault_ТипыКлиентов.КорпоративныйКлиент Тогда
	ЗаписьРЛ = Renault_CRM.докПолучитьЗаписьРЛПоIDK(ТекущийРабочийЛист);
	Если ЗаписьРЛ = Неопределено Тогда
		ЗаписьРЛ = Renault_CRM.ПолучитьЗаписьРЛПоIDK(ТекущийРабочийЛист);
	КонецЕсли;
	Если ЗаписьРЛ.ТипКлиента = Перечисления.Renault_ТипыКлиентов.КорпоративныйКлиент Тогда
	// Трояновский К.Е. 12.08.2019 10:16:39 }
		Элементы.кнКредит.Видимость = Ложь;
		Элементы.кнКредит.Доступность = Ложь;
		Элементы.кнЛизинг.Видимость = Истина;
		Элементы.кнЛизинг.Доступность = Истина;
		//Цвет кнопки Лизинг
		//СуществуетЛизинг = ?(ЕстьЛизингКорпКлиента(), Истина, Ложь);
		Элементы.кнЛизинг.ЦветФона=?(СуществуетЛизинг, ЦветРено, ЦветКнопкиВоронкиСерый);
		Элементы.кнЛизинг.ЦветРамки=?(СуществуетЛизинг, ЦветРено, ЦветСерый);
		//Если покупка в Лизинг, то другие кнопки сделаем недоступными
		Элементы.кнНаличные.Доступность 				= Не СуществуетЛизинг;
		Элементы.кнОтказатьсяОтКонсультации.Доступность = Не СуществуетЛизинг;
		Элементы.кнПередатьВОтдел.Доступность 			= Не СуществуетЛизинг;
		Элементы.кнНазначитьИсполнителя.Доступность 	= Не СуществуетЛизинг;	
	КонецЕсли;
	//pu0XXXX-	
	
КонецПроцедуры

&НаСервере
Функция ЕстьЛизингКорпКлиента()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_СтатистикаВыполненияЭтаповПродаж.Объект
	|ИЗ
	|	РегистрСведений.Renault_СтатистикаВыполненияЭтаповПродаж КАК Renault_СтатистикаВыполненияЭтаповПродаж
	|ГДЕ
	|	Renault_СтатистикаВыполненияЭтаповПродаж.IDK = &IDK
	|	И Renault_СтатистикаВыполненияЭтаповПродаж.ЭтапПродаж = &ЭтапПродаж";
	
	Запрос.УстановитьПараметр("IDK", ТекущееКП.РабочийЛист);
	Запрос.УстановитьПараметр("ЭтапПродаж", Справочники.CRM_ЭтапыПродаж.ЗаявкаНаЛизинг);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Возврат ?(ВыборкаДетальныеЗаписи.Следующий(), Истина, Ложь);
	
КонецФункции

Функция ЗадачиОФУ()
	Запрос=Новый Запрос("Выбрать Ссылка,Состояние,ВидСобытия Из Задача.Renault_События ГДЕ НЕ ПометкаУдаления И Объект=&ТекущееКП 
	|И Состояние НЕ В (Значение(Справочник.Renault_Состояния.Отклонено),Значение(Справочник.Renault_Состояния.ОтмененоВыполнение))");
	Запрос.УстановитьПараметр("ТекущееКП",ТекущееКП);
	Возврат Запрос.Выполнить().Выгрузить()
КонецФункции

&НаКлиенте
Процедура ОтложенноеСозданиеЗадачОФУ()
	Если СоздатьЗадачу_ОФУ_Кредит Тогда СоздатьЗадачуОФУ(Справочники.CRM_ВидыСобытий.Кредит) КонецЕсли;
	Если СоздатьЗадачу_ОФУ_Наличные Тогда СоздатьЗадачуОФУ(Справочники.CRM_ВидыСобытий.КонсультацияОФУ) КонецЕсли;
	Если СоздатьЗадачу_ОФУ_Лизинг  Тогда СоздатьЗадачуОФУ(Справочники.CRM_ВидыСобытий.Лизинг) КонецЕсли;
КонецПроцедуры	
//v-

//Андрианова Начало 26.12.2016
&НаКлиенте
Процедура ПредупредитьОбОтсутствииТарифа()
	//К+ 
	Если НЕ ЗначениеЗаполнено(ТекущееКП) И НЕ ЗначениеЗаполнено(Автомобиль) Тогда
		Возврат;
	КонецЕсли;
	//К-
	
	Если ЦенаВариантаКомплектации = 0 Тогда
		Если ЭтоТрейдИН Тогда
			Сообщить("Необходимо обратиться к администратору для проверки установки цен");
		Иначе
			Сообщить("Необходимо обратиться к администратору для проверки настройки тарифов");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
//Андрианова Конец 26.12.2016

//Козлов Е.А. Начало 20.01.2017
&НаСервере
Процедура ОбновитьСкидкиПоКонфигурации(Конфигурация)
	Если ЗначениеЗаполнено(Конфигурация) Тогда
		УИДКонфигурации = Строка(Конфигурация.УникальныйИдентификатор());
		Отбор = Новый Структура("ИдентификаторКонфигурации", УИДКонфигурации);
		
		СтрокиСкидок = ТекущееКП.СкидкиКонфигурации.НайтиСтроки(Отбор);
		
		Если СтрокиСкидок.Количество() > 0 Тогда
			СписокСкидок.Очистить();
			Для Каждого Строка Из СтрокиСкидок Цикл
				Стр = СписокСкидок.Добавить();
				ЗаполнитьЗначенияСвойств(Стр, Строка);
			КонецЦикла;			
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСкидкиПоАвтомобилю()
	Перем ПрименятьАкции, мТипСкидки, мТипАвтомобиля, мСкидки, ВидыУсловийПредоставления;
	
	Если ЭтоКорпКлиент Тогда
		Возврат;
	КонецЕсли; 	
	
	тГодВыпуска = Renault_ОбщегоНазначения.ПолучитьГодВыпуска(Автомобиль);	
	Если тГодВыпуска = 0 Тогда
		тГодВыпуска = Год(ТекущаяДата());
	КонецЕсли;
	
	ПараметрыРасчета = Новый Структура("ДилерскийЦентр, VIN, Модель, Версия, ГодВыпуска", ТекДилерскийЦентр, VIN, Модель, Версия, тГодВыпуска);
	
	мТипАвтомобиля = Renault_ЗагрузкаКоммерческихАкций.УстановитьТипАвтомобиля(VIN, ТекДилерскийЦентр);
	
	ПолучитьДанныеДляРассчетаСкидок(ПрименятьАкции, мТипСкидки, мТипАвтомобиля, мСкидки, ВидыУсловийПредоставления, ПараметрыРасчета);
	
	Если НЕ ПрименятьАкции ИЛИ НЕ ЗначениеЗаполнено(мТипСкидки) Тогда
		Возврат;
	КонецЕсли;
	
	// Очистка рассчитанных скидок
	Отбор = Новый Структура("ТипСкидки", мТипСкидки);
	Найдено = СписокСкидок.НайтиСтроки(Отбор);  
	
	Если  Найдено.Количество() > 0 Тогда
		Для Каждого Эл Из Найдено Цикл
			СписокСкидок.Удалить(Эл);
		КонецЦикла;
	КонецЕсли; 		
	
	мСкидкиКоличество = мСкидки.Количество();
	СуммаСкидокRenault = 0;
	Для Счетчик = 1 По мСкидкиКоличество Цикл 		
		СтруктураСкидки = мСкидки["КлючСтроки" + Счетчик];  		
		
		Если СтруктураСкидки.ВариантСкидки = "Процент" Тогда
			Продолжить; // уточнить как обрабатывать процентные скидки, от какой суммы считать процент // доработать
		КонецЕсли;
		
		// Проверка соответствия договора условиям предоставления скидки
		ОтказПредоставления = Ложь;
		Для каждого стрУсловие Из СтруктураСкидки.СписокУсловий Цикл
			ПроверитьСоответствиеДоговораУсловиюСкидки(ОтказПредоставления, стрУсловие, ВидыУсловийПредоставления);
			Если ОтказПредоставления Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ОтказПредоставления Тогда
			СуммаСкидокRenault = СуммаСкидокRenault + СтруктураСкидки.ЗначениеСкидки;
		КонецЕсли;				
	КонецЦикла;	
	
	Если СуммаСкидокRenault > 0 Тогда		
		НС = СписокСкидок.Добавить();
		НС.ТипСкидки = мТипСкидки;
		НС.СуммаСкидки = СуммаСкидокRenault;			
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоответствиеДоговораУсловиюСкидки(ОтказПредоставления, стрУсловие, ВидыУсловийПредоставления)
	Если ИнтересовалсяТрейдИн Тогда
		Если стрУсловие.ВидУсловия = ВидыУсловийПредоставления.Утилизация Тогда
			ОтказПредоставления = Истина;
		КонецЕсли;
	ИначеЕсли НЕ ИнтересовалсяТрейдИн И
		стрУсловие.ВидУсловия = ВидыУсловийПредоставления.ТрейдИн Тогда  
		ОтказПредоставления = Истина;
	ИначеЕсли стрУсловие.ВидУсловия = ВидыУсловийПредоставления.Утилизация Тогда
		ОтказПредоставления = Истина;		
	КонецЕсли;		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьДанныеДляРассчетаСкидок(ПрименятьАкции, ТипСкидки, ТипАвтомобиля, Скидки, ВидыУсловийПредоставления, ПараметрыРасчета)
	ДилерскийЦентр = ПараметрыРасчета.ДилерскийЦентр;
	VIN = ПараметрыРасчета.VIN;
	Модель = ПараметрыРасчета.Модель;
	Версия = ПараметрыРасчета.Версия;
	тГодВыпуска = ПараметрыРасчета.ГодВыпуска;
	
	ПрименятьАкции = ДилерскийЦентр.ПрименятьКоммерческиеАкцииRenault И ЗначениеЗаполнено(Модель) И ЗначениеЗаполнено(Версия);
	
	Если НЕ ПрименятьАкции Тогда
		Возврат;
	КонецЕсли;
	
	ТипСкидки = ПолучитьТипСкидки();
	
	Если НЕ ЗначениеЗаполнено(ТипСкидки) Тогда
		Возврат;
	КонецЕсли;	
	
	ВидыУсловийПредоставления = ПолучитьВидыУсловийПредоставленияСкидок(); 	
	
	Скидки = Renault_ЗагрузкаКоммерческихАкций.ПолучитьВсеСкидки(VIN, Модель, Версия, ТипАвтомобиля, тГодВыпуска, ТекущаяДата());
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипСкидки()
	УстановитьПривилегированныйРежим(Истина);
	
	ТипСкидки = Справочники.ТипыСкидок.НайтиПоКоду("RenltCA");
	
	Если ТипСкидки.Пустая() Тогда		
		ТипСкидкиОб = Справочники.ТипыСкидок.СоздатьЭлемент();	
		ТипСкидкиОб.ОбменДанными.Загрузка = Истина;
		ТипСкидкиОб.Код = "RenltCA";
		ТипСкидкиОб.Наименование = "Скидки по коммерческим акциям Renault";
		
		Попытка
			ТипСкидкиОб.Записать();
			ТипСкидки = ТипСкидкиОб.Ссылка;
		Исключение
			Сообщить("Не удалось автоматически создать тип скидки. Создайте элемент справочника ""Типы скидок и наценок"" с кодом ""RenltCA"" (тип скидки по коммерческим акциям Renault)");
			Возврат ТипСкидки;
		КонецПопытки;		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТипСкидки;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВидыУсловийПредоставленияСкидок()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.Renault_ВидыУсловийПредоставленияСкидок.ТрейдИн) КАК ТрейдИн,
	|	ЗНАЧЕНИЕ(Перечисление.Renault_ВидыУсловийПредоставленияСкидок.Утилизация) КАК Утилизация";	
	Результат = Запрос.Выполнить(); 	
	Выборка = Результат.Выбрать();	
	Выборка.Следующий();
	
	ВидыУсловийПредоставления = Новый Структура("ТрейдИн, Утилизация");
	ЗаполнитьЗначенияСвойств(ВидыУсловийПредоставления, Выборка);
	
	Возврат ВидыУсловийПредоставления;
КонецФункции 

//Козлов Е.А. Конец

//@++ ВасильевВА
&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если ЗакрытьФорму Тогда
		// ничего делать не надо
	Иначе
		Если ЭтаФорма.Модифицированность Тогда
			Отказ = Истина;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияОповещения",ЭтаФорма);
			ПоказатьВопрос(Оповещение,
			"На форме имеются не сохраненные данные. Сохранить данные?",
			РежимДиалогаВопрос.ДаНет,
			0,
			КодВозвратаДиалога.Да,
			"Предупреждение");
		Иначе
			// ничего делать не надо         
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияОповещения(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ЗакрытьФорму = Истина;
		Закрыть();
	Иначе
		КонфигурацияПерезаписать();
		ЗакрытьФорму = Истина;
		Закрыть();
	КонецЕсли;	
КонецПроцедуры

Функция ПолучитьДанныеПоКонфигурации(ДокументКП)
	
	ДанныеПоКонфигурацииОбщие = Новый Соответствие();
	ДанныеПоКонфигурации = Новый Соответствие();
	
	ДилерскийЦентр = ДокументКП.ДилерскийЦентр;
	
	Если ЗначениеЗаполнено(ДокументКП) И ДилерскийЦентр.ПрименятьКоммерческиеАкцииRenault Тогда
		СоставДокКП = ДокументКП.Состав;
		Для Каждого Эл Из СоставДокКП Цикл
			VIN = Эл.Конфигурация.VIN;
			УИДСтрока = Строка(Эл.Конфигурация.УникальныйИдентификатор());
			ДанныеПоКонфигурации.Вставить(УИДСтрока, VIN);
		КонецЦикла;
	КонецЕсли;
	
	ДанныеПоКонфигурацииОбщие.Вставить(ДилерскийЦентр, ДанныеПоКонфигурации); 
	
	Возврат ДанныеПоКонфигурацииОбщие;
	
КонецФункции

&НаКлиенте
Функция ПолучитьТипыАвтомобилей(ПараметрыКонфигурацииОбщие)
	
	ТипыАвтомобилей = Новый Соответствие();
	Если ПараметрыКонфигурацииОбщие <> Неопределено И ПараметрыКонфигурацииОбщие.Количество() > 0 Тогда
		Для Каждого ПараметрКонфигурацииОбщие Из ПараметрыКонфигурацииОбщие Цикл
			ДилерскийЦентр = ПараметрКонфигурацииОбщие.Ключ;
			ПараметрыКонфигурации = ПараметрКонфигурацииОбщие.Значение;
			
			Если ПараметрыКонфигурации <> Неопределено И ПараметрыКонфигурации.Количество() > 0 Тогда
				Для Каждого Эл Из ПараметрыКонфигурации Цикл
					VIN = Эл.Значение;
					ТипАвтомобиля = Renault_ЗагрузкаКоммерческихАкций.УстановитьТипАвтомобиля(VIN, ДилерскийЦентр); 
					
					ТипыАвтомобилей.Вставить(Эл.Ключ, ТипАвтомобиля);
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТипыАвтомобилей;
	
КонецФункции

&НаКлиенте
Процедура ПечатьКП(Команда)
	// Вставить содержимое обработчика.
	КонфигурацияПерезаписать();
	
	КлючУникальности	= Новый УникальныйИдентификатор();
	ФормаПечати			= ПолучитьОбщуюФорму("ПечатнаяФормаДокументов",,КлючУникальности);
	ТабличныйДокумент	= ФормаПечати.ЭлементыФормы.ТабличныйДокумент;
	ТабличныйДокумент.ПолеСверху = 5;
	ТабличныйДокумент.ПолеСлева = 5;
	ТабличныйДокумент.ПолеСнизу = 5;
	ТабличныйДокумент.ПолеСправа = 0;
	
	ТабДок = Новый ТабличныйДокумент;
	
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСлева = 5;
	ТабДок.ПолеСнизу = 5;
	ТабДок.ПолеСправа = 0;
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ТекущееКП);
	ПараметрыКонфигурацииОбщие = ПолучитьДанныеПоКонфигурации(МассивОбъектов[0]);
	ТипыАвтомобилей = ПолучитьТипыАвтомобилей(ПараметрыКонфигурацииОбщие);
	
	Документы.CRM_КоммерческоеПредложение.Печать(МассивОбъектов, ТабДок, 0, ТипыАвтомобилей);
	
	ТабличныйДокумент.Вывести(ТабДок);
	ТабличныйДокумент.Автомасштаб = Истина;
	
	ФормаПечати.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	ФормаПечати.Объект = МассивОбъектов[0];
	ФормаПечати.ОбъектПредставление = Строка(МассивОбъектов[0]);
	ФормаПечати.Открыть()
	
КонецПроцедуры
//@--

&НаКлиенте
Процедура КППОтбораВыбранаПриИзменении(Элемент)
	
	ТипКппОтбор = Справочники.ТипыКПП.ПустаяСсылка();
	
	ТекДанныеТипКПП = Элементы.КППОтбора.ТекущиеДанные;
	
	//Если ТекДанныеТипКПП <> Неопределено Тогда
	//	
	//	Если ТекДанныеТипКПП.Выбрана Тогда
	//		
	//		Для Каждого Стр Из КППОтбора Цикл
	//			
	//			Если Стр.ТипКПП <> ТекДанныеТипКПП.ТипКПП Тогда
	//				Стр.Выбрана = Ложь;
	//			КонецЕсли;
	//			
	//		КонецЦикла;
	//	
	//		ТипКппОтбор = ТекДанныеТипКПП.ТипКПП;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	ОбновитьСписокКонфигурацийПоОпциям();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтересовалсяУтилизациейПриИзменении(Элемент)
	
	ЭтаФорма.Модифицированность = Истина;
	Если ИнтересовалсяУтилизацией Тогда
		Элементы.ИнтересовалсяТрейдИн.Доступность = Ложь;
	Иначе
		Элементы.ИнтересовалсяТрейдИн.Доступность = Истина;
	КонецЕсли;
	
	ПересчитатьСтоимость();
	
	ПересчитатьЦенуАвто();
	ОбновитьНадписьЦена();
	
КонецПроцедуры


&НаКлиенте
Процедура ДвигательОтбораВыбранаПриИзменении(Элемент)
	
	ТипДвигателяОтбор = "";
	
	ТекДанныеТипДвигателя = Элементы.ДвигательОтбора.ТекущиеДанные;
	
	Если ТекДанныеТипДвигателя <> Неопределено Тогда
		
		Если ТекДанныеТипДвигателя.Выбрана Тогда
			
			Для Каждого Стр Из ДвигательОтбора Цикл
				
				Если Стр.Двигатель <> ТекДанныеТипДвигателя.Двигатель Тогда
					Стр.Выбрана = Ложь;
				КонецЕсли;
				
			КонецЦикла;
			
			ТипДвигателяОтбор = ТекДанныеТипДвигателя.Двигатель;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьСписокКонфигурацийПоОпциям();
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаЦветаМеталликПриИзменении(Элемент)
	
	ПроверитьОкраскуМеталлик();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОкраскуМеталлик()
	
	Если ПараметрыСеанса.DMS_Бренд = Справочники.CRM_МаркаАвтомобиля.LADA Тогда
		
		Если Элементы.ТаблицаЦвета.ТекущиеДанные<>Неопределено Тогда
			Артикул = Элементы.ТаблицаЦвета.ТекущиеДанные.Код;
			
			Для Каждого Стр Из ВыбранныеНебазовыеОпции Цикл
				Стр.Выбран = (Стр.КодОпции = Артикул);
			КонецЦикла;
			
			ПересчитатьЦенуАвто();
		КонецЕсли;
	Иначе
		Если Элементы.ТаблицаЦвета.ТекущиеДанные<>Неопределено Тогда
			Металлик = Элементы.ТаблицаЦвета.ТекущиеДанные.Металлик;
			
			Для Каждого Стр Из ВыбранныеНебазовыеОпции Цикл
				Если Найти(Стр.Опция.Наименование, "металлик")>0 или Найти(Стр.Опция.Наименование, "Металлик")>0 Тогда
					Стр.Выбран = Металлик;
				КонецЕсли;
			КонецЦикла;
			
			ПересчитатьЦенуАвто();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СогласиеНаОбработкуПерсональныхДанныхПриИзмененииНаСервере(ТекущийКлиент, СогласиеНаОбработкуПерсональныхДанных)
	Если ЗначениеЗаполнено(ТекущийКлиент) Тогда
		КлиентОбъект = ТекущийКлиент.ПолучитьОбъект();
		КлиентОбъект.СогласиеНаОбработкуПерсональныхДанных = СогласиеНаОбработкуПерсональныхДанных;
		КлиентОбъект.Записать();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СогласиеНаОбработкуПерсональныхДанныхПриИзменении(Элемент)
	СогласиеНаОбработкуПерсональныхДанныхПриИзмененииНаСервере(ТекущийКлиент, СогласиеНаОбработкуПерсональныхДанных);
КонецПроцедуры

//вызывается при всех событиях влияющих на стоимость
Процедура ПересчитатьСтоимость()	
	
	ОбновитьСписокАкций();
	
КонецПроцедуры

Функция ОбновитьСписокАкций()
	//запомним не автоакции
	МассивНеАвтоАкций=Новый Массив;
	Для Каждого Стр Из СписокСкидок Цикл
		Если Не ЗначениеЗаполнено(Стр.Акция) Или Не Стр.Акция.Автовыбор	Тогда МассивНеАвтоАкций.Добавить(Новый Структура("Акция,СуммаСкидки,ТипСкидки,ПроцентСкидки,Документ,ДатаНачала,ДатаКонца",Стр.Акция,Стр.СуммаСкидки,Справочники.ТипыСкидок.НайтиПоКоду("RenltCA"),Стр.ПроцентСкидки,Стр.Документ,Стр.ДатаНачала,Стр.ДатаКонца)); КонецЕсли;
	КонецЦикла;
	
	//добавим автоакции
	Запрос=Новый Запрос("
	|Выбрать
	|	Спр.Ссылка Акция,
	|	Выбор 
	|		Когда ТЧ.Ссылка Есть NULL Тогда 0
	|		Иначе 
	|			Выбор Когда ТЧ.ВариантСкидки=Значение(Перечисление.DMS_ВариантыСкидки.Процент) Тогда &СуммаБазы*ТЧ.ЗначениеСкидки/100 Иначе ТЧ.ЗначениеСкидки Конец 
	|	Конец СуммаСкидки,
	|   &ТипСкидки КАК ТипСкидки
	|ИЗ Справочник.DMS_КоммерческиеАкции Спр
	|Полное Соединение Справочник.DMS_КоммерческиеАкции.Условия ТЧ По Спр.Ссылка=ТЧ.Ссылка
	|ГДЕ Спр.Активность 
	|	И Спр.Автовыбор 
	
	//проверка периода
	|	И НачалоПериода(&ТекДата,День) Между Спр.НачалоДействия И Спр.ОкончаниеДействия //период в шапке
	|	И Выбор //проверка периода в ТЧ
	|		Когда ТЧ.Ссылка Есть NULL Тогда Истина
	|		Иначе ТЧ.НачалоДействия=ДатаВремя(1,1,1,0,0,0) ИЛИ НачалоПериода(&ТекДата,День) Между ТЧ.НачалоДействия И ТЧ.ОкончаниеДействия
	|	Конец	
	
	// проверка на флаги Кредит, TradeIn, Утилизция
	|	И( Спр.ТипАкции=0 
	|		ИЛИ Спр.ТипАкции=1
	//		ИЛИ (Спр.ТипАкции=1 И &Кредит)
	|		ИЛИ (Спр.ТипАкции=2 И &TradeIn)
	|		ИЛИ (Спр.ТипАкции=3 И &Утилизация)
	|	)
	
	//годы
	|	И Спр.Ссылка В(
	|		Выбрать Ссылка Из Справочник.DMS_КоммерческиеАкции ГДЕ Ссылка НЕ В(Выбрать Ссылка Из Справочник.DMS_КоммерческиеАкции.ГодыВыпуска)		
	|		Объединить
	|		Выбрать Ссылка Из Справочник.DMS_КоммерческиеАкции.ГодыВыпуска ГДЕ Год=&Год
	|	)
	
	//дилерские центры
	|	И Спр.Ссылка В(
	|		Выбрать Ссылка Из Справочник.DMS_КоммерческиеАкции ГДЕ Ссылка НЕ В(Выбрать Ссылка Из Справочник.DMS_КоммерческиеАкции.ДилерскиеЦентры)		
	|		Объединить
	|		Выбрать Ссылка Из Справочник.DMS_КоммерческиеАкции.ДилерскиеЦентры ГДЕ ДилерскийЦентр=&ДилерскийЦентр
	|	)	
	
	//все акции Контрагентов но отбор акций Автомобиля
	|	И Выбор 
	|		Когда Спр.ВладелецАкции=Значение(Перечисление.DMS_ВладельцыСервисов.Контрагент) Тогда Истина 
	|		Иначе &БезОтбора ИЛИ ТЧ.Объект=&ВариантКомплектации ИЛИ ТЧ.Объект=&Модель ИЛИ ТЧ.Объект=&VIN
	|	Конец");	
	
	СтоимостьБазовойКомплектации = ЦенаВариантаКомплектации + ЦенаДопОпций - ЦенаВыкупа + ЦенаОборудования + ЦенаАвторабот + СтраховкаОСАГОСумма + СтраховкаКАСКОСумма + ГарантияСумма;
	
	Запрос.УстановитьПараметр("СуммаБазы",СтоимостьБазовойКомплектации);
	Запрос.УстановитьПараметр("АкцияДилера",Ложь);
	Запрос.УстановитьПараметр("БезОтбора",Ложь);
	Запрос.УстановитьПараметр("ДилерскийЦентр",ТекДилерскийЦентр);
	Запрос.УстановитьПараметр("ТипСкидки",Справочники.ТипыСкидок.НайтиПоКоду("RenltCA")); 
	
	Запрос.УстановитьПараметр("ВариантКомплектации",Версия);
	Запрос.УстановитьПараметр("Модель",Модель);
	Запрос.УстановитьПараметр("VIN",VIN);
	Запрос.УстановитьПараметр("Год",ГодВыпуска);	
	
	Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
	Запрос.УстановитьПараметр("Кредит",ИнтересовалсяКредитом);
	Запрос.УстановитьПараметр("TradeIn",ИнтересовалсяТрейдИн);
	Запрос.УстановитьПараметр("Утилизация",ИнтересовалсяУтилизацией);
	
	СписокСкидок.Загрузить(Запрос.Выполнить().Выгрузить());
	
	//добавим не автоакции
	Для Каждого Стр Из МассивНеАвтоАкций Цикл ЗаполнитьЗначенияСвойств(СписокСкидок.Добавить(),Стр) КонецЦикла;	
	
КонецФункции

&НаКлиенте
Процедура ДоступныеАкции(Команда)
	СтоимостьБазовойКомплектации = ЦенаВариантаКомплектации + ЦенаДопОпций - ЦенаВыкупа + ЦенаОборудования + ЦенаАвторабот + СтраховкаОСАГОСумма + СтраховкаКАСКОСумма + ГарантияСумма;
	
	УсловияОтбора  = Новый Структура;		
	УсловияОтбора.Вставить("СуммаБазы",СтоимостьБазовойКомплектации);
	УсловияОтбора.Вставить("ДилерскийЦентр",ТекДилерскийЦентр); 
	
	УсловияОтбора.Вставить("ВариантКомплектации",Версия);
	УсловияОтбора.Вставить("Модель",Модель);
	УсловияОтбора.Вставить("VIN",VIN);
	УсловияОтбора.Вставить("Год",ГодВыпуска);	
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", УсловияОтбора, Истина);
	ОткрытьФорму("Отчет.DMS_ПрименимыеКоммерческиеАкции.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПрикрепленныеФайлыВыборЗначенияНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепленныеФайлыВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ПрикрепленныеФайлыВыборЗначенияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрикрепленныеФайлыВыборНаСервере(ИдентификаторСтроки)
	Рег = РегистрыСведений.Renault_КартинкиИФайлы.СоздатьНаборЗаписей();
	ОтборКартинки = Рег.Отбор.Идентификатор;
	ОтборКартинки.ВидСравнения = ВидСравнения.Равно;
	ОтборКартинки.Использование = Истина;
	ОтборКартинки.Значение = ИдентификаторСтроки;
	
	ОтборКартинки = Рег.Отбор.Объект;
	ОтборКартинки.ВидСравнения = ВидСравнения.Равно;
	ОтборКартинки.Использование = Истина;
	ОтборКартинки.Значение = ТекущееКП;
	
	Рег.Прочитать();	
	Рег[0].ВыгружатьПоЭлектроннойПочте = Не Рег[0].ВыгружатьПоЭлектроннойПочте;
		
	Рег.Записать(Истина);
	Элементы.ПрикрепленныеФайлы.Обновить();
КонецПроцедуры


&НаКлиенте
Процедура ПрикрепленныеФайлыВыборОкончание(Результат, Параметры) Экспорт
 
    Если Результат = КодВозвратаДиалога.Да Тогда
        ПрикрепленныеФайлыВыборНаСервере(Параметры);
    КонецЕсли;	
 
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепленныеФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Родитель.ТекущиеДанные.ВыгружатьПоЭлектроннойПочте тогда
		
    Оповещение = Новый ОписаниеОповещения("ПрикрепленныеФайлыВыборОкончание",ЭтотОбъект,ВыбраннаяСтрока.Идентификатор);	
 
    ПоказатьВопрос(Оповещение,
        "Если снять галочку, клиент получит письмо без вложения. Вы уверены, что хотите продолжить?",
        РежимДиалогаВопрос.ДаНет,0, КодВозвратаДиалога.Нет, "Вы уверены?");    
	Иначе	
		ПрикрепленныеФайлыВыборНаСервере(ВыбраннаяСтрока.Идентификатор);
	КонецЕсли;	
	СтандартнаяОбработка = ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепленныеФайлыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если не ЗначениеЗаполнено(ТекущееКП) тогда
		Предупреждение("Необходимо записать коммерческое предложение.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	ФормаКартинки = ПолучитьФорму("РегистрСведений.Renault_КартинкиИФайлы.ФормаЗаписи");
	ФормаКартинки.Объект = ТекущееКП;
	ФормаКартинки.фВыгружатьПоЭлектроннойПочте = Истина;
	ФормаКартинки.Открыть();
	ОбновитьДанныеПрикрепленныхФайлов();
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВариантыСалонаПриАктивизацииСтроки(Элемент)
	Если Элементы.ТаблицаВариантыСалона.ТекущиеДанные<>Неопределено тогда
		ТекущийВариантСалона = Элементы.ТаблицаВариантыСалона.ТекущиеДанные.ВариантСалона;
	Иначе	
		ТекущийВариантСалона = ПредопределенноеЗначение("Справочник.DMS_ВариантыСалона.ПустаяСсылка");
	КонецЕСли;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦветаСалонаПриАктивизацииСтроки(Элемент)
	Если Элементы.ТаблицаЦветаСалона.ТекущиеДанные<>Неопределено тогда
		ТекущийЦветСалона = Элементы.ТаблицаЦветаСалона.ТекущиеДанные.ЦветСалона;
	Иначе	
		ТекущийЦветСалона = ПредопределенноеЗначение("Справочник.DMS_ЦветаСалона.ПустаяСсылка");
	КонецЕСли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	//Блинков обновление спискаКП в Рабочем листе DMSREN-742
	Оповестить("ОбновитьСписокКП");
КонецПроцедуры

//DMSREN-867 +++
&НаКлиенте
Процедура ПечатьСогласиеНаОПД(Команда)
	Ошибка = Ложь;
	Попытка
		СтруктураПараметровОПД = СофрмироватьПараметрыДляПФ("ПерсональныеДанные");
		МассивФайловОПД = DMS_ОбщегоНазначенияСервер.ПолучитьДанныеОПД(СтруктураПараметровОПД,ТекущийКлиент);
		
		Если МассивФайловОПД = Неопределено Тогда 
			ПоказатьПредупреждение(,"Не удалось получить печатную форму");
		Иначе 
			Для каждого Файл Из МассивФайловОПД Цикл
				НачатьПолучениеФайлаССервера(ПоместитьВоВременноеХранилище(Base64Значение(Файл["ДанныеФайла"])), Файл["ИмяФайла"], Новый ПараметрыДиалогаПолученияФайлов());
			КонецЦикла;
		КонецЕсли;
		
		Если ТипЗнч(ТекущийКлиент) = Тип("СправочникСсылка.Контрагенты") Тогда
			Если Не ТекущийКлиент.СогласиеНаПолучениеSMS Тогда 
				Возврат;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ТекущийКлиент) = Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты") Тогда 
			Если Не ТекущийКлиент.СогласенНаКоммуникацию Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;

		СтруктураПараметровКоммуникация = СофрмироватьПараметрыДляПФ("Коммуникация");		
		
		Если СтруктураПараметровКоммуникация = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		
		МассивФайловКоммуникация = DMS_ОбщегоНазначенияСервер.ПолучитьДанныеОПД(СтруктураПараметровОПД,ТекущийКлиент);

		Если МассивФайловКоммуникация = Неопределено Тогда 
			ПоказатьПредупреждение(,"Не удалось получить печатную форму");
		Иначе 
			Для каждого Файл Из МассивФайловКоммуникация Цикл
				НачатьПолучениеФайлаССервера(ПоместитьВоВременноеХранилище(Base64Значение(Файл["ДанныеФайла"])), Файл["ИмяФайла"], Новый ПараметрыДиалогаПолученияФайлов());
			КонецЦикла;	
		КонецЕсли;
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Функция СофрмироватьПараметрыДляПФ(ВидСогласия)
	
	СтруктураОбъекта = Новый Структура;
	СтруктураКлиента = Новый Структура;
	СтруктураДокумента = Новый Структура;
	СтруктураАвтомобиля = Новый Структура;
	СтруктураСогласия = Новый Структура;
	СтруктураОтвветсвенный = Новый Структура;
	
	Если ТипЗнч(ТекущийКлиент) = Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат ЗаполнитьДанныеПоКонтрагенту(ТекущийКлиент,Автомобиль,ДатаНачалаПередачиАвто,ВидСогласия);
	ИначеЕсли ТипЗнч(ТекущийКлиент) = Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты") Тогда 
		Возврат ЗаполнитьДанныеПоПотенциальномуКлиенту(ВидСогласия);	
	КонецЕсли;

	Возврат СтруктураОбъекта;
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьВФайл(Файл)
	
	выборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	выборФайла.ПолноеИмяФайла = Файл["ИмяФайла"];
	Если выборФайла.Выбрать() Тогда
		//ИмяФайла = Файл["ИмяФайла"];
		ДанныеФайла = Base64Значение(Файл["ДанныеФайла"]);	
		ДанныеФайла.записать(выборФайла.ПолноеИмяФайла);
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьДанныеПоКонтрагенту(Контрагент,Автомобиль,ДатаНачалаПередачиАвто,ВидСогласия)
	
	СтруктураОбъекта = Новый Структура;
	СтруктураКлиента = Новый Структура;
	СтруктураДокумента = Новый Структура;
	СтруктураАвтомобиля = Новый Структура;
	СтруктураСогласия = Новый Структура;
	СтруктураОтвветсвенный = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодтверждающиеДокументы.Серия КАК Серия,
		|	ПодтверждающиеДокументы.Номер КАК Номер,
		|	ПодтверждающиеДокументы.ДатаВыдачи КАК ДатаВыдачи,
		|	ПодтверждающиеДокументы.КемВыдан КАК КемВыдан,
		|	ПодтверждающиеДокументы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
		|ГДЕ
		|	ПодтверждающиеДокументы.Владелец = &Контрагент
		|	И ПодтверждающиеДокументы.Текущий = ИСТИНА";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Количество() = 0 Тогда 
		ВызватьИсключение("Нет данных актуального паспорта");
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		СтруктураДокумента.Вставить("passportnumber",Выборка.Номер);
		СтруктураДокумента.Вставить("passportseries",Выборка.Серия);
		СтруктураДокумента.Вставить("passportissued",Выборка.КемВыдан); 
		СтруктураДокумента.Вставить("passportday",День(Выборка.ДатаВыдачи));
		СтруктураДокумента.Вставить("passportmonth",Месяц(Выборка.ДатаВыдачи));
		СтруктураДокумента.Вставить("passportyear",Год(Выборка.ДатаВыдачи));
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК Представление
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект
		|	И КонтактнаяИнформация.Тип = &Тип
		|	И КонтактнаяИнформация.Вид = &Вид";
	
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний);
	Запрос.УстановитьПараметр("Объект", Контрагент);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Почта = "";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Почта = ВыборкаДетальныеЗаписи.Представление;
	КонецЦикла;

	Адрес = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК Представление
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Тип = &ТипАдрес
		|	И КонтактнаяИнформация.Вид = &ВидАдрес";
	
	Запрос.УстановитьПараметр("ВидАдрес", Справочники.ВидыКонтактнойИнформации.АдресФактический);
	Запрос.УстановитьПараметр("ТипАдрес", Перечисления.ТипыКонтактнойИнформации.Адрес);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Адрес = ВыборкаДетальныеЗаписи.Представление;
	КонецЦикла;

	СтруктураКлиента.Вставить("lastname",Контрагент.Фамилия);
	СтруктураКлиента.Вставить("firstname",Контрагент.Имя);
	СтруктураКлиента.Вставить("middlename",Контрагент.Отчество);
	СтруктураКлиента.Вставить("birthday",Контрагент.ДатаРождения);
	СтруктураКлиента.Вставить("gender",?(Контрагент.Пол=Перечисления.ПолФизическихЛиц.НеУказан,"",""+Контрагент.Пол));
	СтруктураКлиента.Вставить("address",Адрес);
	СтруктураКлиента.Вставить("tel",Контрагент.ОсновнойТелефон);
	СтруктураКлиента.Вставить("email",Почта);
	СтруктураКлиента.Вставить("company",?(Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо,Истина,Ложь));
	СтруктураКлиента.Вставить("document",СтруктураДокумента);
	СтруктураОбъекта.Вставить("client",СтруктураКлиента);
	
	СтруктураАвтомобиля.Вставить("mark",""+Модель);
	СтруктураАвтомобиля.Вставить("vin",VIN);
	СтруктураАвтомобиля.Вставить("daybuycar",Дата('00010101'));
	СтруктураОбъекта.Вставить("auto",СтруктураАвтомобиля);
	
	СтруктураСогласия.Вставить("form",ВидСогласия);
	СтруктураСогласия.Вставить("agree",Истина);
	СтруктураОбъекта.Вставить("consent",СтруктураСогласия);
	
	СтруктураОтвветсвенный.Вставить("name",""+ПараметрыСеанса.Пользователь.Сотрудник);
	СтруктураОтвветсвенный.Вставить("from","Форма конфигуратора из КП");
	СтруктураОбъекта.Вставить("responsible",СтруктураОтвветсвенный);
	
	Возврат СтруктураОбъекта;
	
КонецФункции

&НаСервере
Функция ЗаполнитьДанныеПоПотенциальномуКлиенту(ВидСогласия)
	
	СтруктураОбъекта = Новый Структура;
	СтруктураКлиента = Новый Структура;
	СтруктураДокумента = Новый Структура;
	СтруктураАвтомобиля = Новый Структура;
	СтруктураСогласия = Новый Структура;
	СтруктураОтвветсвенный = Новый Структура;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ТекущийКлиент);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Поле4,
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Ссылка
	|	И КонтактнаяИнформация.Вид = &Вид";
	
	МобильныйТелефон = "";
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонСотовый);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		МобильныйТелефон = Выборка.Представление;
	КонецЕсли;
	
	ЭлектронныйАдрес = "";
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЭлектронныйАдрес = Выборка.Представление;
	КонецЕсли;
	
	Адрес = "";
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.АдресФактический);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Город = Выборка.Поле4;
		Адрес = Выборка.Представление;
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПодтверждающиеДокументы.Серия,
	|	ПодтверждающиеДокументы.Номер,
	|	ПодтверждающиеДокументы.ДатаВыдачи,
	|	ПодтверждающиеДокументы.КемВыдан
	|ИЗ
	|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|ГДЕ
	|	ПодтверждающиеДокументы.Владелец = &Ссылка
	|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = &Вид";
	
	Запрос.УстановитьПараметр("Вид", Перечисления.ВидыДокументов.Паспорт);
	Выборка = Запрос.Выполнить().Выбрать();
	ПаспортСерия = "";
	ПаспортНомер = "";
	ПаспортКемВыдан = "";
	ПаспортДатаВыдачи = Дата('00010101');

	Если Выборка.Следующий() Тогда
		ПаспортСерия = Выборка.Серия;
		ПаспортНомер = Выборка.Номер;
		ПаспортДатаВыдачи = Выборка.ДатаВыдачи;
		ПаспортКемВыдан = Выборка.КемВыдан;
	КонецЕсли;

	СтруктураДокумента.Вставить("passportnumber",ПаспортСерия);
	СтруктураДокумента.Вставить("passportseries",ПаспортНомер);
	СтруктураДокумента.Вставить("passportissued",ПаспортКемВыдан); 
	СтруктураДокумента.Вставить("passportday",День(ПаспортДатаВыдачи));
	СтруктураДокумента.Вставить("passportmonth",Месяц(ПаспортДатаВыдачи));
	СтруктураДокумента.Вставить("passportyear",Год(ПаспортДатаВыдачи));

	СтруктураКлиента.Вставить("lastname",ТекущийКлиент.Фамилия);
	СтруктураКлиента.Вставить("firstname",ТекущийКлиент.Имя);
	СтруктураКлиента.Вставить("middlename",ТекущийКлиент.Отчество);
	СтруктураКлиента.Вставить("birthday",ТекущийКлиент.ДатаРождения);
	СтруктураКлиента.Вставить("gender",?(ТекущийКлиент.Пол=Перечисления.ПолФизическихЛиц.НеУказан,"",""+ТекущийКлиент.Пол));
	СтруктураКлиента.Вставить("address",Адрес);
	СтруктураКлиента.Вставить("tel",МобильныйТелефон);
	СтруктураКлиента.Вставить("email",ЭлектронныйАдрес);
	СтруктураКлиента.Вставить("company",?(ТекущийКлиент.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо,Истина,Ложь));
	СтруктураКлиента.Вставить("document",СтруктураДокумента);
	СтруктураОбъекта.Вставить("client",СтруктураКлиента);

	СтруктураАвтомобиля.Вставить("mark","");
	СтруктураАвтомобиля.Вставить("vin","");
	СтруктураАвтомобиля.Вставить("daybuycar",Дата('00010101'));
	СтруктураОбъекта.Вставить("auto",СтруктураАвтомобиля);
	
	СтруктураСогласия.Вставить("form",ВидСогласия);
	СтруктураСогласия.Вставить("agree",Истина);
	СтруктураОбъекта.Вставить("consent",СтруктураСогласия);
	
	СтруктураОтвветсвенный.Вставить("name",""+ПараметрыСеанса.Пользователь.Сотрудник);
	СтруктураОтвветсвенный.Вставить("from","Форма конфигуратора из КП");
	СтруктураОбъекта.Вставить("responsible",СтруктураОтвветсвенный);
	
	Возврат СтруктураОбъекта;

	
КонецФункции

&НаКлиенте
Процедура СервисныеКонтрактыСуммаПриИзменении(Элемент)
	ПересчитатьЦенуАвто();
КонецПроцедуры

&НаКлиенте
Процедура ПомощьНаДорогахСуммаПриИзменении(Элемент)
	ПересчитатьЦенуАвто();
КонецПроцедуры

&НаКлиенте
Процедура ТолькоДоступныеКЗаказуВерсииПриИзменении(Элемент)
	если ЗначениеЗаполнено(Модель) тогда
		ОбновитьСписокКонфигураций(Модель);
	КонецЕсли;
КонецПроцедуры

//DMSREN-867 ---

//&НаСервереБезКонтекста

//Процедура ИнициироватьДанныеКартинкиИФайлы(ОбъектФормы,ОснованиеДляЗаполнения)
//	ОбъектРС = ДанныеФормыВЗначение(ОбъектФормы, Тип("РегистрСведений.Renault_КартинкиИФайлы"));
//	
//	ЗначениеВДанныеФормы(ОбъектРС, ОбъектФормы);
//КонецПроцедуры	

