Перем АвтодокВерсия Экспорт;

Перем РезультатВыбораИнцидента Экспорт;
Перем РезультатВыбораСчета Экспорт;
Перем ЕстьИзменения Экспорт; //Определяем в модуле объекта, потому что часть процедур могут его изменять из модуля

//Различные проверки на корректность данных

//Таблица соответствий категорий инвойса статье расходов
Перем ТаблицаСоответствийКатегорий Экспорт;
Перем ТаблицаПараметровВидовРасходов Экспорт;


//Ссылка на форму прогресса. 
Перем ФормаПрогресса;

Перем ПаттернЛитераловНомеров;

Перем ТаблицаОшибок;

///////////////////////////////

////@+ Процедура ЗаполнитьТаблицы()
// Дата создания - 14.06.2012 15:34:39; 
// Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Процедура производит выборку информации из регистров 
//  и заполняет табличные части АРМа
//
// Параметры
//  Без параметров
//@-
Процедура ЗаполнитьТаблицы() Экспорт
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	EDR_ЗаказНаряды.ЗаказНаряд КАК ЗаказНаряд,
	|	EDR_ЗаказНаряды.ОтправленВСистему_GCM КАК Отправлен,
	|	EDR_ЗаказНаряды.OTS,
	|	EDR_ЗаказНаряды.ДатаОткрытия КАК ДатаОткрытия,
	|	EDR_ЗаказНаряды.ДатаЗакрытия КАК ДатаЗакрытия,
	|	EDR_ЗаказНаряды.ЗаказНаряд.Автомобиль КАК Автомобиль,
	|	EDR_ЗаказНаряды.СемействоАвтомобиля КАК СемействоАвтомобиля,
	|	EDR_ЗаказНаряды.ПробегАвтомобиля,
	|	EDR_ЗаказНаряды.РангАвторабот,
	|	EDR_ЗаказНаряды.ЗаказНаряд.СуммаДокумента КАК СуммаДокумента,
	|	EDR_ЗаказНаряды.ГотовностьКОтправке,
	|	EDR_ЗаказНаряды.ПовторнаяОтправка,
	|	Renault_ВидыРемонтаДопРеквизиты.EDR_ЛКМ КАК ЛКМ
	|ИЗ
	|	РегистрСведений.EDR_ЗаказНаряды КАК EDR_ЗаказНаряды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ВидыРемонтаДопРеквизиты КАК Renault_ВидыРемонтаДопРеквизиты
	|		ПО EDR_ЗаказНаряды.ЗаказНаряд.ВидРемонта = Renault_ВидыРемонтаДопРеквизиты.ВидРемонта
	|ГДЕ
	|	EDR_ЗаказНаряды.ЗаказНаряд.Организация В(&Организация)
	|	И EDR_ЗаказНаряды.ДатаЗакрытия МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И EDR_ЗаказНаряды.Гарантия = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказНаряд,
	|	ДатаОткрытия,
	|	ДатаЗакрытия"
	);
	
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ДатаНачала",ПериодВыборки.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",ПериодВыборки.ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ТаблицаЗаказов.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		НС = ТаблицаЗаказов.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Выборка);
		
	КонецЦикла;
	
	//Теперь получаем список заказ нарядов
	МассивЗаказов = ТаблицаЗаказов.ВыгрузитьКолонку("ЗаказНаряд");
	
	//По этому массиву получаем таблицы 
	//ТоварыДоп:
	ЗаполнитьТоварыПоОтбору(МассивЗаказов);
	
	//РаботыДоп:
	ЗаполнитьРаботыПоОтбору(МассивЗаказов);
	
	//Счета (Инвойсы):
	ЗаполнитьСчетаПоОтбору(МассивЗаказов);
	
	//Соответствия:
	ЗаполнитьСоответствияПоОтбору(МассивЗаказов);

	//Формируем таблицу параметров по видам расходов
	ОбновитьТаблицуПараметровВидовРасходов();

	//Инциденты:
	ЗаполнитьИнцидентыПоОтбору(МассивЗаказов);
	
		
	
КонецПроцедуры // ЗаполнитьТаблицы()

///////////////////////////////
//Служебные процедуры


////@+ Процедура ЗаполнитьТоварыПоОтбору(ЗаказНаряды)
// Дата создания - 14.06.2012 15:36:20;
// Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Процедура производит отбор товаров по списку заказ-нарядов
//
// Параметры
//  Парам1 ЗаказНаряды  - Массив - Массив ссылок на заказ - наряды 
//
//@-
Процедура ЗаполнитьТоварыПоОтбору(ЗаказНаряды)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	EDR_ТоварыДоп.ЗаказНаряд,
	|	ВЫБОР
	|		КОГДА EDR_ТоварыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА EDR_ТоварыДоп.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|						ТОГДА EDR_ТоварыДоп.DiversCode.Наименование
	|					ИНАЧЕ EDR_ТоварыДоп.Номенклатура
	|				КОНЕЦ
	|		ИНАЧЕ ЗаказНарядТовары.Номенклатура
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА EDR_Interventions.Intervention ЕСТЬ NULL 
	|			ТОГДА ""-""
	|		ИНАЧЕ EDR_Interventions.Intervention
	|	КОНЕЦ КАК Инцидент,
	|	ВЫБОР
	|		КОГДА EDR_ТоварыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА EDR_ТоварыДоп.Количество
	|		ИНАЧЕ ЗаказНарядТовары.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА EDR_ТоварыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА 1
	|		ИНАЧЕ ЗаказНарядТовары.Коэффициент
	|	КОНЕЦ КАК Коэффициент,
	|	ВЫБОР
	|		КОГДА EDR_ТоварыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА EDR_ТоварыДоп.Цена
	|		ИНАЧЕ ЗаказНарядТовары.Цена
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА EDR_ТоварыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА 0
	|		ИНАЧЕ ЗаказНарядТовары.СуммаСкидки
	|	КОНЕЦ КАК СуммаСкидки,
	|	ВЫБОР
	|		КОГДА EDR_ТоварыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА EDR_ТоварыДоп.СуммаНДС
	|		ИНАЧЕ ЗаказНарядТовары.СуммаНДС
	|	КОНЕЦ КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА EDR_ТоварыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА EDR_ТоварыДоп.СуммаВсего
	|		ИНАЧЕ ЗаказНарядТовары.СуммаВсего
	|	КОНЕЦ КАК СуммаВсего,
	|	EDR_ТоварыДоп.ПричинаОбращения,
	|	EDR_ТоварыДоп.NotInvoiced КАК НеВключатьВСчет,
	|	EDR_ТоварыДоп.GUID_Товара КАК ИдентификаторТовара,
	|	ВЫБОР
	|		КОГДА EDR_Interventions.Intervention ЕСТЬ NULL 
	|			ТОГДА """"
	|		ИНАЧЕ EDR_ТоварыДоп.GUID_Инцидента
	|	КОНЕЦ КАК ИдентификаторИнцидента,
	|	ВЫБОР
	|		КОГДА EDR_ТоварыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА EDR_ТоварыДоп.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|						ТОГДА EDR_ТоварыДоп.DiversCode.Код
	|					ИНАЧЕ EDR_ТоварыДоп.Номенклатура.Артикул
	|				КОНЕЦ
	|		ИНАЧЕ ЗаказНарядТовары.Номенклатура.Артикул
	|	КОНЕЦ КАК Артикул,
	|	ВЫБОР
	|		КОГДА EDR_ТоварыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА EDR_ТоварыДоп.СтавкаНДС
	|		ИНАЧЕ ЗаказНарядТовары.СтавкаНДС
	|	КОНЕЦ КАК СтавкаНДС,
	|	EDR_ТоварыДоп.СтрокаИзЗаказНаряда,
	|	EDR_ТоварыДоп.DiversCode,
	|	ВЫБОР
	|		КОГДА EDR_ТоварыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|				И EDR_ТоварыДоп.ПричинаОбращения = ИСТИНА
	|				И EDR_ТоварыДоп.NotInvoiced = ИСТИНА
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗапретСнятияПричины
	|ИЗ
	|	РегистрСведений.EDR_ТоварыДоп КАК EDR_ТоварыДоп
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.EDR_Interventions КАК EDR_Interventions
	|		ПО EDR_ТоварыДоп.GUID_Инцидента = EDR_Interventions.GUID
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
	|		ПО EDR_ТоварыДоп.ЗаказНаряд = ЗаказНарядТовары.Ссылка
	|			И EDR_ТоварыДоп.Номенклатура = ЗаказНарядТовары.Номенклатура
	|ГДЕ
	|	EDR_ТоварыДоп.ЗаказНаряд В(&ЗаказНаряды)"
	);
	Запрос.УстановитьПараметр("ЗаказНаряды", ЗаказНаряды);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТаблицаТоваров.Очистить();
	Пока Выборка.Следующий() Цикл
		НС = ТаблицаТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Выборка);
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьТоварыПоОтбору(ЗаказНаряды)

////@+ Процедура ЗаполнитьРаботыПоОтбору(ЗаказНаряды)
// Дата создания - 14.06.2012 15:38:24;
// Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Процедура производит отбор работ по списку заказ-нарядов
//
// Параметры
//  Парам1 ЗаказНаряды  - Массив - Массив ссылок на заказ - наряды 
//
//@-
Процедура ЗаполнитьРаботыПоОтбору(ЗаказНаряды)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	EDR_РаботыДоп.ЗаказНаряд,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА EDR_РаботыДоп.АртикулНестандартнойОперации = """"
	|						ТОГДА EDR_РаботыДоп.DiversCode.Наименование
	|					ИНАЧЕ EDR_РаботыДоп.НаименованиеНеСтандартнойОперации
	|				КОНЕЦ
	|		ИНАЧЕ ЗаказНарядРаботы.Работа
	|	КОНЕЦ КАК Работа,
	|	ВЫБОР
	|		КОГДА EDR_Interventions.Intervention ЕСТЬ NULL 
	|			ТОГДА ""-""
	|		ИНАЧЕ EDR_Interventions.Intervention
	|	КОНЕЦ КАК Инцидент,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА EDR_РаботыДоп.Количество
	|		ИНАЧЕ ЗаказНарядРаботы.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА EDR_РаботыДоп.Коэффициент = 0
	|							ИЛИ EDR_РаботыДоп.Коэффициент ЕСТЬ NULL 
	|						ТОГДА 1
	|					ИНАЧЕ EDR_РаботыДоп.Коэффициент
	|				КОНЕЦ
	|		ИНАЧЕ ЗаказНарядРаботы.Коэффициент
	|	КОНЕЦ КАК Коэффициент,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА EDR_РаботыДоп.СуммаСкидки
	|		ИНАЧЕ ЗаказНарядРаботы.СуммаСкидки
	|	КОНЕЦ КАК СуммаСкидки,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА EDR_РаботыДоп.СуммаНДС
	|		ИНАЧЕ ЗаказНарядРаботы.СуммаНДС
	|	КОНЕЦ КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА EDR_РаботыДоп.СуммаВсего
	|		ИНАЧЕ ЗаказНарядРаботы.СуммаВсего
	|	КОНЕЦ КАК СуммаВсего,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА EDR_РаботыДоп.Нормочас
	|		ИНАЧЕ ЗаказНарядРаботы.Нормочас
	|	КОНЕЦ КАК Нормочас,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА EDR_РаботыДоп.Сумма
	|		ИНАЧЕ ЗаказНарядРаботы.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА EDR_Interventions.Intervention ЕСТЬ NULL 
	|			ТОГДА """"
	|		ИНАЧЕ EDR_РаботыДоп.GUID_Инцидента
	|	КОНЕЦ КАК ИдентификаторИнцидента,
	|	EDR_РаботыДоп.GUID_Работы КАК ИдентификаторРаботы,
	|	EDR_РаботыДоп.ПричинаОбращения,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА EDR_РаботыДоп.АртикулНестандартнойОперации = """"
	|						ТОГДА EDR_РаботыДоп.DiversCode.Код
	|					ИНАЧЕ EDR_РаботыДоп.АртикулНестандартнойОперации
	|				КОНЕЦ
	|		ИНАЧЕ ЗаказНарядРаботы.Работа.Артикул
	|	КОНЕЦ КАК Артикул,
	|	EDR_РаботыДоп.РаботаПоЛКМ,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА EDR_РаботыДоп.СтавкаНДС
	|		ИНАЧЕ ЗаказНарядРаботы.СтавкаНДС
	|	КОНЕЦ КАК СтавкаНДС,
	|	EDR_РаботыДоп.СтрокаИзЗаказНаряда,
	|	EDR_РаботыДоп.DiversCode,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.АртикулНестандартнойОперации = """"
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК НеСтандартнаяОперация,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.Цена = 0
	|			ТОГДА ВЫБОР
	|					КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда
	|						ТОГДА ЗаказНарядРаботы.Цена
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ EDR_РаботыДоп.Цена
	|	КОНЕЦ КАК Цена
	|ИЗ
	|	РегистрСведений.EDR_РаботыДоп КАК EDR_РаботыДоп
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.EDR_Interventions КАК EDR_Interventions
	|		ПО EDR_РаботыДоп.GUID_Инцидента = EDR_Interventions.GUID
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
	|		ПО EDR_РаботыДоп.ЗаказНаряд = ЗаказНарядРаботы.Ссылка
	|			И EDR_РаботыДоп.GUID_Работы = ЗаказНарядРаботы.ИдентификаторРаботы
	|ГДЕ
	|	EDR_РаботыДоп.ЗаказНаряд В(&ЗаказНаряды)"
	);
	Запрос.УстановитьПараметр("ЗаказНаряды", ЗаказНаряды);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТаблицаРабот.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		НС = ТаблицаРабот.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Выборка);
		
	КонецЦикла;
	
КонецПроцедуры //ЗаполнитьРаботыПоОтбору(ЗаказНаряды)

////@+ Процедура ЗаполнитьСчетаПоОтбору(ЗаказНаряды)
// Дата создания - 14.06.2012 15:40:05;
// Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Процедура производит отбор счетов(заявок) по списку заказ-нарядов
//
// Параметры
//  Парам1 ЗаказНаряды  - Массив - Массив ссылок на заказ - наряды 
//
//@-
Процедура ЗаполнитьСчетаПоОтбору(ЗаказНаряды)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	EDR_Invoices.ЗаказНаряд,
	|	EDR_Invoices.Invoice КАК Счет,
	|	EDR_Invoices.GUID КАК ИдентификаторСчета,
	|	EDR_Invoices.Категория,
	|	EDR_Invoices.ДатаИнвойса,
	|	EDR_Invoices.Expense_code КАК ВидРасходов,
	|	EDR_Invoices.СчетФактура
	|ИЗ
	|	РегистрСведений.EDR_Invoices КАК EDR_Invoices
	|ГДЕ
	|	EDR_Invoices.ЗаказНаряд В(&ЗаказНаряды)"
	);
	Запрос.УстановитьПараметр("ЗаказНаряды", ЗаказНаряды);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТаблицаСчетов.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		НС = ТаблицаСчетов.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Выборка);
		
	КонецЦикла;
	
КонецПроцедуры //ЗаполнитьСчетаПоОтбору(ЗаказНаряды)

////@+ Процедура ЗаполнитьИнцидентыПоОтбору(ЗаказНаряды)
// Дата создания - 14.06.2012 15:41:38;
// Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Процедура производит отбор инцидентов по списку заказ-нарядов
//
// Параметры
//  Парам1 ЗаказНаряды  - Массив - Массив ссылок на заказ - наряды 
//
//@-
Процедура ЗаполнитьИнцидентыПоОтбору(ЗаказНаряды)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	EDR_Interventions.ЗаказНаряд,
	|	EDR_Interventions.Intervention КАК Инцидент,
	|	EDR_Interventions.GUID КАК ИдентификаторИнцидента,
	|	EDR_Interventions.RC_code КАК КодОщущенияКлиента,
	|	EDR_Interventions.Function_Code КАК ФункциональныйКод,
	|	EDR_Interventions.OTS_number КАК ОтзывнаяНота,
	|	EDR_Interventions.НомерСФ,
	|	EDR_Interventions.ДатаСФ,
	|	EDR_Interventions.ПробегПриУстановке,
	|	EDR_Interventions.ОписаниеОперации,
	|	EDR_Interventions.ОписаниеЖалобы,
	|	EDR_Interventions.КомментарийОперации,
	|	EDR_Interventions.РезультатДиагностики,
	|	EDR_Interventions.НомерСогласования
	|ИЗ
	|	РегистрСведений.EDR_Interventions КАК EDR_Interventions
	|ГДЕ
	|	EDR_Interventions.ЗаказНаряд В(&ЗаказНаряды)"
	);
	Запрос.УстановитьПараметр("ЗаказНаряды", ЗаказНаряды);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТаблицаИнцидентов.Очистить();
	Пока Выборка.Следующий() Цикл
		НС = ТаблицаИнцидентов.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Выборка);
		Control_EC = ПолучитьПараметр_Булево_ExpenceCode(НС.ЗаказНаряд,,НС.ИдентификаторИнцидента,"Control_EC");   
		Если Не Control_EC Тогда 
			НС.КодОщущенияКлиента = Справочники.EDR_КодыОщущенийКлиента.ПустаяСсылка();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры //ЗаполнитьИнцидентыПоОтбору(ЗаказНаряды)

////@+ Процедура ЗаполнитьСоответствияПоОтбору(ЗаказНаряды)
// Дата создания - 14.06.2012 15:41:52;
// Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Процедура производит отбор записей соответствий заявок и инцидентов по списку заказ-нарядов
//
// Параметры
//  Парам1 ЗаказНаряды  - Массив - Массив ссылок на заказ - наряды 
//
//@-
Процедура ЗаполнитьСоответствияПоОтбору(ЗаказНаряды)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	EDR_СоответствияИнвойсов.ЗаказНаряд,
	|	EDR_СоответствияИнвойсов.Intervention КАК ИдентификаторИнцидента,
	|	EDR_СоответствияИнвойсов.Invoice КАК ИдентификаторСчета,
	|	EDR_Invoices.Invoice КАК Счет,
	|	EDR_Invoices.Категория,
	|	EDR_Invoices.Expense_code КАК ВидРасходов,
	|	EDR_Interventions.Intervention КАК Инцидент,
	|	EDR_СоответствияИнвойсов.Процент,
	|	EDR_СоответствияИнвойсов.GUID КАК Идентификатор
	|ИЗ
	|	РегистрСведений.EDR_СоответствияИнвойсов КАК EDR_СоответствияИнвойсов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.EDR_Invoices КАК EDR_Invoices
	|		ПО EDR_СоответствияИнвойсов.Invoice = EDR_Invoices.GUID
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.EDR_Interventions КАК EDR_Interventions
	|		ПО EDR_СоответствияИнвойсов.Intervention = EDR_Interventions.GUID
	|ГДЕ
	|	EDR_СоответствияИнвойсов.ЗаказНаряд В(&ЗаказНаряды)"
	);
	Запрос.УстановитьПараметр("ЗаказНаряды", ЗаказНаряды);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТаблицаСоответствий.Очистить();
	Пока Выборка.Следующий() Цикл
		НС = ТаблицаСоответствий.Добавить(); 
		ЗаполнитьЗначенияСвойств(НС, Выборка);
		
		Отбор = Новый Структура;
		Отбор.Вставить("ИдентификаторСчета",Выборка.ИдентификаторСчета);
		
		НайденныеСчета = ТаблицаСчетов.НайтиСтроки(Отбор);
		Если НайденныеСчета.Количество() тогда 	
			НС.Категория = НайденныеСчета[0].Категория;
			НС.ВидРасходов = НайденныеСчета[0].ВидРасходов;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры //ЗаполнитьСоответствияПоОтбору(ЗаказНаряды)

////@+ Процедура ОбновитьТаблицуПараметровВидовРасходов()Экспорт
// Дата создания - 14.06.2012 15:42:22; 
// Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Процедура производит формирование таблицы с параметрами 
//  кода статьи расходов с привязкой к каждому инциденту.
//  По этой таблице в дальнейшем настраивается логика обязательности колонок
//
// Параметры
//  Без параметров
//@-
Процедура ОбновитьТаблицуПараметровВидовРасходов() Экспорт
	
	Запрос = Новый Запрос;
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	//Счета в МВТ
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаСчетов.ЗаказНаряд,
	|	ТаблицаСчетов.ИдентификаторСчета,
	|	ТаблицаСчетов.ВидРасходов
	|ПОМЕСТИТЬ ТаблицаСчетов
	|ИЗ
	|	&ТаблицаСчетов КАК ТаблицаСчетов"
	;
	Запрос.УстановитьПараметр("ТаблицаСчетов", ТаблицаСчетов);
	Запрос.Выполнить();
	
	//Соответствия в МВТ
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаСоответствий.ЗаказНаряд,
	|	ТаблицаСоответствий.ИдентификаторСчета,
	|	ТаблицаСоответствий.ИдентификаторИнцидента
	|ПОМЕСТИТЬ ТаблицаСоответствий
	|ИЗ
	|	&ТаблицаСоответствий КАК ТаблицаСоответствий"
	;
	Запрос.УстановитьПараметр("ТаблицаСоответствий", ТаблицаСоответствий);
	Запрос.Выполнить();
	
	//В запросе заглушены проверки Control_Comm#
	//по требованию гарантийного департамента
	//Для всех видов расходов, кроме 91 OTS, комментарий обязателен!
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаСчетов.ЗаказНаряд КАК ИдентификаторЗаказа,
	|	ТаблицаСчетов.ИдентификаторСчета,
	|	ТаблицаСоответствий.ИдентификаторИнцидента,
	|	ТаблицаСчетов.ВидРасходов,
	|	ТаблицаСчетов.ВидРасходов.Type КАК Type,
	|	ТаблицаСчетов.ВидРасходов.MinAgeDay КАК MinAgeDay,
	|	ТаблицаСчетов.ВидРасходов.MaxAgeDay КАК MaxAgeDay,
	|	ТаблицаСчетов.ВидРасходов.Control_TAPV КАК Control_TAPV,
	|	ТаблицаСчетов.ВидРасходов.Control_NewV КАК Control_NewV,
	|	ТаблицаСчетов.ВидРасходов.Control_EC КАК Control_EC,
	|	ТаблицаСчетов.ВидРасходов.Control_Part КАК Control_Part,
	|	ТаблицаСчетов.ВидРасходов.Control_MD КАК Control_MD,
	|	ВЫБОР
	|		КОГДА ТаблицаСчетов.ВидРасходов = ЗНАЧЕНИЕ(Справочник.EDR_ВидыРасходов.Ex91)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Control_Comm1,
	|	ВЫБОР
	|		КОГДА ТаблицаСчетов.ВидРасходов = ЗНАЧЕНИЕ(Справочник.EDR_ВидыРасходов.Ex91)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Control_Comm2,
	|	ВЫБОР
	|		КОГДА ТаблицаСчетов.ВидРасходов = ЗНАЧЕНИЕ(Справочник.EDR_ВидыРасходов.Ex91)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Control_Comm3,
	|	ТаблицаСчетов.ВидРасходов.Control_Indicator КАК Control_Indicator,
	|	ТаблицаСчетов.ВидРасходов.Control_DiverPart КАК Control_DiverPart,
	|	ТаблицаСчетов.ВидРасходов.Control_DiverOper КАК Control_DiverOper,
	|	ТаблицаСчетов.ВидРасходов.Control_CustomerReq КАК Control_CustomerReq
	|ИЗ
	|	ТаблицаСчетов КАК ТаблицаСчетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСоответствий КАК ТаблицаСоответствий
	|		ПО ТаблицаСчетов.ЗаказНаряд = ТаблицаСоответствий.ЗаказНаряд
	|			И ТаблицаСчетов.ИдентификаторСчета = ТаблицаСоответствий.ИдентификаторСчета
	|ГДЕ
	|	ТаблицаСчетов.ВидРасходов <> ЗНАЧЕНИЕ(Справочник.EDR_ВидыРасходов.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСоответствий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСчетов"
	;
	ТаблицаПараметровВидовРасходов = Запрос.Выполнить().Выгрузить();
	
	//Уничтожаем менеджер
	МВТ = Неопределено; 
	//
КонецПроцедуры // ОбновитьТаблицуПараметровВидовРасходов()

////@+ Функция ПолучитьСледующийНомерСчета(ТекущийЗаказ)
// Дата создания - 14.06.2012 15:45:07;
// Автор - Окипний Андрей Евгеньевич
//
// Описание функции
// <Вставить описание>
//
// Параметры
//  Парам1 ТекущийЗаказ  - ДокументСсылка.ЗаказНаряд - Ссылка на заказ наряд
//
// Возвращаемое значение
//  НомерДокумента  - Строка(6) - Номер документа для заявки 
//  пять цифр от номера ЗН + один символ литерал
//  Пример 00010A, 00010B ...
//
//@-
Функция ПолучитьСледующийНомерСчета(ТекущийЗаказ) Экспорт
	
	Отбор = Новый Структура("ЗаказНаряд", ТекущийЗаказ);
	
	СчетаЗаказа = ТаблицаСчетов.НайтиСтроки(Отбор);
	
	ПаттернСозданныхСчетов = "";
	
	СвободныеЛитералы = Строка(ПаттернЛитераловНомеров);
	
	Для каждого ТекСчет из СчетаЗаказа Цикл
		СвободныеЛитералы = СтрЗаменить(СвободныеЛитералы, Прав(ТекСчет.Счет, 1),"");
	КонецЦикла;
	
	ТекущийЛитерал = Лев(СвободныеЛитералы, 1);
	
	НомерДокумента = "" + EDR_КешируемыеЗначения.ПолучитьНомерДляПечати(ТекущийЗаказ) + ТекущийЛитерал;
	
	Возврат НомерДокумента;
	
КонецФункции //ПолучитьСледующийНомерСчета(ТекущийЗаказ)

////@+ Функция ПолучитьСледующийНомерИнцидента(ТекущийЗаказ)
// Дата создания - 14.06.2012 15:48:34;
// Автор - Окипний Андрей Евгеньевич
//
// Описание функции
// По текущему ЗН функция выбирает первый свободный литерал для инцидента
// инциденты маркируются 1 символом английского алфавита. По алфавиту.
//
// Параметры
//  Парам1 ТекущийЗаказ  - ДокументСсылка.ЗаказНаряд - Ссылка на ЗН для которого создаем инцидент
//
// Возвращаемое значение
//  ТекущийЛитерал  - Строка(1) - Свободный номер Инцидента
//
//@-
Функция ПолучитьСледующийНомерИнцидента(ТекущийЗаказ) Экспорт
	
	//Первоначальная инициализация
	ТекущийЛитерал = неопределено;
		
	Отбор = Новый Структура("ЗаказНаряд", ТекущийЗаказ);
	
	ИнцидентыЗаказа = ТаблицаИнцидентов.НайтиСтроки(Отбор);
	
	СвободныеЛитералы = Строка(ПаттернЛитераловНомеров);
	
	Для каждого ТекИнцидент из ИнцидентыЗаказа Цикл
		
		СвободныеЛитералы = СтрЗаменить(СвободныеЛитералы, ТекИнцидент.Инцидент, "");
		
	КонецЦикла;
	
	ТекущийЛитерал = Лев(СвободныеЛитералы, 1);
	
	Возврат ТекущийЛитерал;
	
КонецФункции // ПолучитьСледующийНомерИнцидента(ТекущийЗаказ)

Функция ДополнитьТаблицуСоответствийКатегорий(Категория) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	EDR_КатегорииСчетовВидыРасходов.Ссылка КАК Категория,
	|	EDR_КатегорииСчетовВидыРасходов.Ссылка.Наименование,
	|	EDR_КатегорииСчетовВидыРасходов.КодСтатьиРасходов КАК ExpenceCode
	|ИЗ
	|	Справочник.EDR_КатегорииСчетов.ВидыРасходов КАК EDR_КатегорииСчетовВидыРасходов
	|ГДЕ
	|	EDR_КатегорииСчетовВидыРасходов.Ссылка = &Категория");
	
	Запрос.УстановитьПараметр("Категория", Категория);
	Выборка = Запрос.Выполнить().Выбрать();
	
	//Дополняем таблицу
	Пока Выборка.Следующий() Цикл
		НС = ТаблицаСоответствийКатегорий.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Выборка);
	КонецЦикла;
	
	//Теперь повторяем отбор
	Отбор = Новый Структура("Категория", Категория);
	Возврат ТаблицаСоответствийКатегорий.НайтиСтроки(Отбор);
	
КонецФункции

////@+ Процедура РасчитатьЛКМ()
// Дата создания - 29.06.2012 10:06:08; 
// Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Производит поиск заказов с ЛКМ и расчитывает для них количество возмещаемого ЛКМ.
//
// Параметры
//  Без параметров
//@-
Процедура РасчитатьЛКМ() Экспорт
	
	//Нужно добавить строки по расчету ЛКМ
	Отбор = Новый Структура("ЛКМ", Истина);
	ЗаказыСЛКМ = ТаблицаЗаказов.Выгрузить(Отбор);
		
	//Есть заказы, тогда нужно добавить строки с краской
	Если ЗаказыСЛКМ.Количество() > 0 Тогда
		
		Для каждого стрЗаказа из ЗаказыСЛКМ Цикл
			
			
			//получим стоимость окраски
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Renault_ВидыРемонтаДопРеквизиты.ЦенаЛКМ
			|ИЗ
			|	РегистрСведений.Renault_ВидыРемонтаДопРеквизиты КАК Renault_ВидыРемонтаДопРеквизиты
			|ГДЕ
			|	Renault_ВидыРемонтаДопРеквизиты.ВидРемонта = &ВидРемонта";
			
			
			Запрос.УстановитьПараметр("ВидРемонта", стрЗаказа.ЗаказНаряд.ВидРемонта);
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				
				Если ЗначениеЗаполнено(Выборка.ЦенаЛКМ) Тогда
					
					ЦенаКраски = Выборка.ЦенаЛКМ;
					
				Иначе 
					
					ЦенаКраски = 490;
					
				КонецЕсли;
				
			Иначе
				
				ЦенаКраски = 490;
					
			КонецЕсли;

			
			// Комментарий 
			//Дата создания - 13.06.2012 16:47:48; Автор - Окипний Андрей Евгеньевич
			//Необходимо отобрать все работы из заказа и проверить их на малярные работы 
			//по регистру OPERACODE
			//Все малярные работы отметим галочками
			Запрос = Новый Запрос;
			ТекстЗапроса = "ВЫБРАТЬ
			|	ТаблицаРабот.ИдентификаторРаботы,
			|	ТаблицаРабот.ЗаказНаряд,
			|	ТаблицаРабот.Работа
			|ПОМЕСТИТЬ ТЗРабот
			|ИЗ
			|	&ТаблицаРабот КАК ТаблицаРабот
			|ГДЕ
			|	ТаблицаРабот.ЗаказНаряд = &ЗаказНаряд
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТЗРабот.ИдентификаторРаботы,
			|	ТЗРабот.ЗаказНаряд,
			|	ТЗРабот.Работа,
			|	Автоработы.Артикул
			|ПОМЕСТИТЬ ВремТЗ
			|ИЗ
			|	ТЗРабот КАК ТЗРабот
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Автоработы КАК Автоработы
			|		ПО ТЗРабот.Работа = Автоработы.Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ТЗРабот
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВремТЗ.ИдентификаторРаботы,
			|	ВремТЗ.Работа
			|ИЗ
			|	РегистрСведений.OPERACODE_НормыРабот.СрезПоследних(&ТекДата, ВидРабот = ЗНАЧЕНИЕ(Перечисление.OPERACODE_ВидыРабот.P)) КАК OPERACODE_НормыРаботСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремТЗ КАК ВремТЗ
			|		ПО OPERACODE_НормыРаботСрезПоследних.КодПоКаталогу = ВремТЗ.Артикул
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВремТЗ"
			;
			
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
			Запрос.УстановитьПараметр("ЗаказНаряд",стрЗаказа.ЗаказНаряд);
			Запрос.УстановитьПараметр("ТаблицаРабот",ТаблицаРабот);
			ТЗМалярныхРабот = Запрос.Выполнить().Выгрузить();
			
			Для каждого стрТаблицы Из ТЗМалярныхРабот Цикл
			
				НайденнаяРабота = ТаблицаРабот.Найти(стрТаблицы.ИдентификаторРаботы, "ИдентификаторРаботы");
				
				Если НЕ НайденнаяРабота = Неопределено тогда // такого случая быть не должно. но проверку все равно ставим
					
					НайденнаяРабота.РаботаПоЛКМ = Истина;
					
				КонецЕсли;
				
			КонецЦикла;
			
			//отберем строки работ для расчета ЛКМ
			//Расчет количества ЛКМ расчитывается по формуле
			//Количество ЛКМ = сумма длительности всех работ по окраске
			//Стоимость ЛКМ = сумма стоимостей всех работ по ЛКМ * на коэффициент (1,78)
			Отбор = Новый Структура("ЗаказНаряд", стрЗаказа.ЗаказНаряд);
			Отбор.Вставить("РаботаПоЛКМ", Истина);
			
			СтрокиРаботЛКМ = ТаблицаРабот.Выгрузить(Отбор);
			
			//Работ может не быть - забыли отметить
			Если СтрокиРаботЛКМ.Количество() > 0 тогда
				
				//Проверяем количество Инцидентов //должен быть только один
				//т.е. все работы по окраске выполнялись одним инцидентом.
				//К этому же инциденту приписываем краску.
				ВР_Инцидент = СтрокиРаботЛКМ.Скопировать();
				ВР_Инцидент.Свернуть("ИдентификаторИнцидента,Инцидент");
				
				Если ВР_Инцидент.Количество() > 1 Тогда
					Сообщить("По Заказ-наряду " + стрЗаказа.ЗаказНаряд.Номер + " от " + стрЗаказа.ЗаказНаряд.Дата + Символы.ПС
					+"Работы для расчета количества ЛКМ распределены на несколько инцидентов." + Символы.ПС +"Запись изменений прервана.");
					//прерываем выполнение записи
					Возврат;
				КонецЕсли;
				
				ВР_НДС = СтрокиРаботЛКМ.Скопировать();
				ВР_НДС.Свернуть("СтавкаНДС");
				
				Если ВР_НДС.Количество() > 1 Тогда
					Сообщить("По Заказ-наряду " + стрЗаказа.ЗаказНаряд.Номер + " от " + стрЗаказа.ЗаказНаряд.Дата + Символы.ПС
					+"Работы для расчета количества ЛКМ распределены на несколько ставок НДС." + Символы.ПС +"Запись изменений прервана.");
					//прерываем выполнение записи
					Возврат;
				КонецЕсли;
				
				СтрокиРаботЛКМ.Колонки.Добавить("Длительность");
				Для каждого стрРабота из СтрокиРаботЛКМ Цикл
					стрРабота.Длительность = стрРабота.Количество * стрРабота.Коэффициент;
				КонецЦикла;
				
				КоличествоКраски = СтрокиРаботЛКМ.Итог("Длительность");
				
				СтавкаЧ = ВР_НДС[0].СтавкаНДС.Ставка;
				
				//СтоимостьКраски  = СтрокиРаботЛКМ.Итог("СуммаВсего") * 1.78;
				СтоимостьКраски = КоличествоКраски * ЦенаКраски * (1 + СтавкаЧ/100);
				НДСКраски		 = КоличествоКраски * ЦенаКраски * СтавкаЧ/100;
				
				//ЦенаКраски		 = (СтоимостьКраски - НДСКраски) / КоличествоКраски;
				
				//Добавляем строку с краской в ТаблицаТоваров, если её еще нет.
				Отбор = Новый Структура("ЗаказНаряд", стрЗаказа.ЗаказНаряд);
				Отбор.Вставить("Артикул","IP");
				
				СтрокиСКраской = ТаблицаТоваров.НайтиСтроки(Отбор);
				
				//Если строка уже существует продолжаем.
				Если СтрокиСКраской.Количество() > 0 тогда //эти строки нужно пометить на удаление
					
					Краска = СтрокиСКраской[0];
					
				Иначе
					
					Краска = ТаблицаТоваров.Добавить();
					
				КонецЕсли;
				
				
				Краска.ЗаказНаряд			  = стрЗаказа.ЗаказНаряд;
				Краска.ИдентификаторИнцидента = ВР_Инцидент[0].ИдентификаторИнцидента;
				Краска.Инцидент				  = ВР_Инцидент[0].Инцидент;
				Краска.ИдентификаторТовара	  = Строка(Новый УникальныйИдентификатор());
				Краска.Артикул				  = Справочники.EDR_DiversCode.IP.Код;
				Краска.DiversCode			  = Справочники.EDR_DiversCode.IP;
				Краска.Номенклатура			  = Справочники.EDR_DiversCode.IP.Наименование;
				Краска.Количество			  = КоличествоКраски;
				Краска.СуммаВсего			  = СтоимостьКраски;
				Краска.СтавкаНДС			  = ВР_НДС[0].СтавкаНДС;
				//Краска.СуммаНДС				  = НДСКраски;
				Краска.Цена					  = ЦенаКраски;
				
			Иначе
				Сообщить("По Заказ-наряду " + стрЗаказа.ЗаказНаряд.Номер + " от " + стрЗаказа.ЗаказНаряд.Дата + Символы.ПС
						+"Не указаны работы для расчета количества ЛКМ." + Символы.ПС +"Запись изменений прервана.");
				//прерываем выполнение записи
				Возврат;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // РасчитатьЛКМ()

/////////////////////////////////////////////////////////////////
//Процедуры проверок и интерактивной настройки системы

//Делаем проверку по использованию Инцидента
Функция ПроверитьИспользованиеИнцидента(ИдентификаторИнцидента) Экспорт
	
	СтруктураРезультата = Новый Структура;
	
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	//Таблицы в Менеджер
	//Товары
	ТекстЗапроса = "ВЫБРАТЬ * ПОМЕСТИТЬ ВТТовары
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТаблицаТоваров",ТаблицаТоваров);
	Запрос.Выполнить();
	
	//Работы
	ТекстЗапроса = "ВЫБРАТЬ * ПОМЕСТИТЬ ВТРаботы
	|ИЗ
	|	&ТаблицаРабот КАК ТаблицаРабот";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТаблицаРабот",ТаблицаРабот);
	Запрос.Выполнить();

	//Соответствия
	ТекстЗапроса = "ВЫБРАТЬ * ПОМЕСТИТЬ ВТСоответствия
	|ИЗ
	|	&ТаблицаСоответствий КАК ТаблицаСоответствий";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТаблицаСоответствий",ТаблицаСоответствий);
	Запрос.Выполнить();
	
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТТовары.ИдентификаторТовара,
	|	ВТТовары.Номенклатура,
	|	ВТТовары.ИдентификаторИнцидента
	|ИЗ
	|	ВТТовары КАК ВТТовары
	|ГДЕ
	|	ВТТовары.ИдентификаторИнцидента = &ИдентификаторИнцидента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТТовары";
	Запрос.УстановитьПараметр("ИдентификаторИнцидента",ИдентификаторИнцидента);
	ВремТовары = Запрос.Выполнить().Выгрузить();
	СтруктураРезультата.Вставить("Товары",ВремТовары);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТРаботы.ИдентификаторРаботы,
	|	ВТРаботы.Работа,
	|	ВТРаботы.ИдентификаторИнцидента
	|ИЗ
	|	ВТРаботы КАК ВТРаботы
	|ГДЕ
	|	ВТРаботы.ИдентификаторИнцидента = &ИдентификаторИнцидента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТРаботы";
	Запрос.УстановитьПараметр("ИдентификаторИнцидента",ИдентификаторИнцидента);
	ВремРаботы = Запрос.Выполнить().Выгрузить();
	СтруктураРезультата.Вставить("Работы",ВремРаботы);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТСоответствия.Идентификатор,
	|	ВТСоответствия.ИдентификаторИнцидента
	|ИЗ
	|	ВТСоответствия КАК ВТСоответствия
	|ГДЕ
	|	ВТСоответствия.ИдентификаторИнцидента = &ИдентификаторИнцидента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСоответствия";
	Запрос.УстановитьПараметр("ИдентификаторИнцидента",ИдентификаторИнцидента);
	ВремСоответствия = Запрос.Выполнить().Выгрузить();
	СтруктураРезультата.Вставить("Соответствия",ВремСоответствия);
	
	Если ВремТовары.Количество() > 0 
	 или ВремРаботы.Количество() > 0 
	 или ВремСоответствия.Количество() > 0 тогда
		СтруктураРезультата.Вставить("ЕстьИспользование", Истина);
	Иначе
		СтруктураРезультата.Вставить("ЕстьИспользование", Ложь);
	КонецЕсли;
	
	Возврат СтруктураРезультата;
КонецФункции

//Делаем проверку по использованию Инцидента
Функция ПроверитьИспользованиеСчета(ИдентификаторСчета) Экспорт
	
	СтруктураРезультата = Новый Структура;
	
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	//Таблицы в Менеджер
	//Соответствия
	ТекстЗапроса = "ВЫБРАТЬ * ПОМЕСТИТЬ ВТСоответствия
	|ИЗ
	|	&ТаблицаСоответствий КАК ТаблицаСоответствий";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТаблицаСоответствий",ТаблицаСоответствий);
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТСоответствия.Идентификатор,
	|	ВТСоответствия.ИдентификаторСчета
	|ИЗ
	|	ВТСоответствия КАК ВТСоответствия
	|ГДЕ
	|	ВТСоответствия.ИдентификаторСчета = &ИдентификаторСчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСоответствия";
	Запрос.УстановитьПараметр("ИдентификаторСчета",ИдентификаторСчета);
	ВремСоответствия = Запрос.Выполнить().Выгрузить();
	СтруктураРезультата.Вставить("Соответствия",ВремСоответствия);
	
	Если ВремСоответствия.Количество() > 0 тогда
		СтруктураРезультата.Вставить("ЕстьИспользование", Истина);
	Иначе
		СтруктураРезультата.Вставить("ЕстьИспользование", Ложь);
	КонецЕсли;
	
	Возврат СтруктураРезультата;
КонецФункции

//Процедуры Записи изменений в регистры
Процедура ЗаписьИзмененийПоСчетам()
	
	//нужно отработать номер заявки при повторной отправке.
	ОтборПовторнаяОтправка = Новый Структура("ПовторнаяОтправка", Истина);
	ТЗПовторнаяОтправка = ТаблицаЗаказов.Выгрузить(ОтборПовторнаяОтправка);
	
	Для Каждого стрЗаказНаряд из ТЗПовторнаяОтправка Цикл
		
		//Пройдемся по заявкам
		ОтборЗаявок = Новый Структура;
		ОтборЗаявок.Вставить("Удален", Ложь);
		ОтборЗаявок.Вставить("ЗаказНаряд",стрЗаказНаряд.ЗаказНаряд);
		
		НайденныеЗаявки = ТаблицаСчетов.НайтиСтроки(ОтборЗаявок);
		
		Для Каждого Заявка из НайденныеЗаявки Цикл
			
			НомерЗаявкиПаттерн = EDR_КешируемыеЗначения.ПолучитьНомерДляПечати(стрЗаказНаряд.ЗаказНаряд);
			НовыйНомер = Прав(НомерЗаявкиПаттерн, 4) + "P";
			
			Заявка.Счет = СтрЗаменить(Заявка.Счет, НомерЗаявкиПаттерн, НовыйНомер);
			
		КонецЦикла;
	КонецЦикла;
	//Измененные строки
	Отбор = Новый Структура("Удален", Ложь);
	ВремТЗ = ТаблицаСчетов.НайтиСтроки(Отбор);

	Для Каждого СтрокаТЗ из ВремТЗ Цикл
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ЗаказНаряд",СтрокаТЗ.ЗаказНаряд);
		СтруктураПараметров.Вставить("Invoice",СтрокаТЗ.Счет);
		СтруктураПараметров.Вставить("GUID",СтрокаТЗ.ИдентификаторСчета);
		СтруктураПараметров.Вставить("Категория",СтрокаТЗ.Категория);
		СтруктураПараметров.Вставить("ДатаИнвойса",СтрокаТЗ.ДатаИнвойса);
		СтруктураПараметров.Вставить("Expense_code",СтрокаТЗ.ВидРасходов);
		СтруктураПараметров.Вставить("СчетФактура",СтрокаТЗ.СчетФактура);
		
		РегистрыСведений.EDR_Invoices.ОбновитьИнвойс(СтруктураПараметров);
		
	КонецЦикла;
	
	//Удаленные строки
	Отбор = Новый Структура("Удален", Истина);
	ВремТЗ = ТаблицаСчетов.НайтиСтроки(Отбор);

	Для Каждого СтрокаТЗ из ВремТЗ Цикл
		РегистрыСведений.EDR_Invoices.УдалитьИнвойс(СтрокаТЗ.ИдентификаторСчета);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписьИзмененийПоИнцидентам()
	
	//Измененные строки
	Отбор = Новый Структура("Удален", Ложь);
	ВремТЗ = ТаблицаИнцидентов.НайтиСтроки(Отбор);
	
	Для каждого СтрокаТЗ из ВремТЗ Цикл
		Если СтрокаТЗ.Удален тогда Продолжить; КонецЕсли;
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ЗаказНаряд", СтрокаТЗ.ЗаказНаряд);
		СтруктураПараметров.Вставить("GUID", СтрокаТЗ.ИдентификаторИнцидента);
		СтруктураПараметров.Вставить("Intervention", СтрокаТЗ.Инцидент);
		СтруктураПараметров.Вставить("RC_code", СтрокаТЗ.КодОщущенияКлиента);
		СтруктураПараметров.Вставить("Function_Code", СтрокаТЗ.ФункциональныйКод);
		СтруктураПараметров.Вставить("OTS_number", СтрокаТЗ.ОтзывнаяНота);
		СтруктураПараметров.Вставить("НомерСогласования", СтрокаТЗ.НомерСогласования);
		СтруктураПараметров.Вставить("НомерСФ", СтрокаТЗ.НомерСФ);
		СтруктураПараметров.Вставить("ДатаСФ", СтрокаТЗ.ДатаСФ);
		СтруктураПараметров.Вставить("ПробегПриУстановке", СтрокаТЗ.ПробегПриУстановке);
		СтруктураПараметров.Вставить("ОписаниеОперации", СтрокаТЗ.ОписаниеОперации);
		СтруктураПараметров.Вставить("ОписаниеЖалобы", СокрЛП(СтрокаТЗ.ОписаниеЖалобы));
		СтруктураПараметров.Вставить("КомментарийОперации", СтрокаТЗ.КомментарийОперации);
		СтруктураПараметров.Вставить("РезультатДиагностики", СтрокаТЗ.РезультатДиагностики);
		
		РегистрыСведений.EDR_Interventions.ОбновитьИнцидент(СтруктураПараметров);
		
	КонецЦикла;
	
	//Теперь Удаляем удаленные
	Отбор = Новый Структура("Удален", Истина);
	ВремТЗ = ТаблицаИнцидентов.НайтиСтроки(Отбор);
	Для каждого СтрокаТЗ Из ВремТЗ Цикл
		
		РегистрыСведений.EDR_Interventions.УдалитьИнцидент(СтрокаТЗ.ИдентификаторИнцидента);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписьИзмененийПоТоварам()
	
	Для каждого стрТЗ из ТаблицаЗаказов Цикл
		
		Отбор = Новый Структура("ЗаказНаряд",СтрТЗ.ЗаказНаряд);
		//записываем только не помеченные на удаление
		Отбор.Вставить("Удален", ложь);
		
		ТЗТоваров = ТаблицаТоваров.Выгрузить(Отбор); //Тут нужно работать с таблицей значений
		
		ТЗТоваров.Колонки.ИдентификаторТовара.Имя = "GUID_Товара";
		ТЗТоваров.Колонки.ИдентификаторИнцидента.Имя = "GUID_Инцидента";
		ТЗТоваров.Колонки.НеВключатьВСчет.Имя = "NotInvoiced";
		
		РегистрыСведений.EDR_ТоварыДоп.ОбновитьТовары(ТЗТоваров, СтрТЗ.ЗаказНаряд);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписьИзмененийПоРаботам()
	
	Для каждого стрТЗ из ТаблицаЗаказов Цикл
		
		Отбор = Новый Структура("ЗаказНаряд",СтрТЗ.ЗаказНаряд);
		
		//записываем только не помеченные на удаление
		Отбор.Вставить("Удален", ложь);
		
		ТЗРабот = ТаблицаРабот.Выгрузить(Отбор); //Тут нужно работать с таблицей значений
		
		ТЗРабот.Колонки.ИдентификаторРаботы.Имя = "GUID_Работы";
		ТЗРабот.Колонки.ИдентификаторИнцидента.Имя = "GUID_Инцидента";
		
		ТЗРабот.Колонки.Добавить("АртикулНестандартнойОперации");
		ТЗРабот.Колонки.Добавить("НаименованиеНеСтандартнойОперации");
		
		Для Каждого СтрокаТЗ из ТЗРабот Цикл
			
			СтрокаТЗ.АртикулНестандартнойОперации = ?(СтрокаТЗ.НеСтандартнаяОперация,СтрокаТЗ.Артикул,"");
			СтрокаТЗ.НаименованиеНеСтандартнойОперации = ?(СтрокаТЗ.НеСтандартнаяОперация,СтрокаТЗ.Работа,"");
			
		КонецЦикла;
		
		РегистрыСведений.EDR_РаботыДоп.ОбновитьРаботы(ТЗРабот, СтрТЗ.ЗаказНаряд);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписьИзмененийПоСоответствиям()
	
	//Измененные строки
	Отбор = Новый Структура("Удален", Ложь);
	ВремТЗ = ТаблицаСоответствий.Выгрузить(Отбор);
	ВремТЗ.Колонки.Удалить("НомерСтроки");
	ВремТЗ.Колонки.Удалить("Удален");
	
	ВремТЗ.Колонки.Идентификатор.Имя = "GUID";
	ВремТЗ.Колонки.ИдентификаторИнцидента.Имя = "intervention";
	ВремТЗ.Колонки.ИдентификаторСчета.Имя = "Invoice";
	
	Колонки = ВремТЗ.Колонки;
	Для каждого стрТЗ из ВремТЗ Цикл
		СтруктураПараметров = Новый Структура;
		Для каждого Колонка из Колонки Цикл
			СтруктураПараметров.Вставить(Колонка.Имя,СтрТЗ[Колонка.Имя]);
		КонецЦикла;
		РегистрыСведений.EDR_СоответствияИнвойсов.ОбновитьСоответствие(СтруктураПараметров);
		
	КонецЦикла;
	
	//Удаленные строки
	Отбор = Новый Структура("Удален", Истина);
	ВремТЗ = ТаблицаСоответствий.Выгрузить(Отбор);
	
	Для каждого СтрокаТЗ из ВремТЗ Цикл 
		РегистрыСведений.EDR_СоответствияИнвойсов.УдалитьСоответствие(СтрокаТЗ.Идентификатор);
	КонецЦикла;

КонецПроцедуры

Процедура ЗаписьИзмененийПоЗаказНарядам()
	
	Для каждого СтрокаТЗ из ТаблицаЗаказов Цикл
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ЗаказНаряд",СтрокаТЗ.ЗаказНаряд);
		СтруктураПараметров.Вставить("ПробегАвтомобиля",СтрокаТЗ.ПробегАвтомобиля);
		СтруктураПараметров.Вставить("ДатаЗакрытия",СтрокаТЗ.ДатаЗакрытия);
		СтруктураПараметров.Вставить("OTS",СтрокаТЗ.OTS);
		СтруктураПараметров.Вставить("Гарантия",Истина); //Тут только гарантия
		СтруктураПараметров.Вставить("ДатаОткрытия",СтрокаТЗ.ДатаОткрытия);
		СтруктураПараметров.Вставить("ОтправленВСистему_GCM",СтрокаТЗ.Отправлен);
		СтруктураПараметров.Вставить("СемействоАвтомобиля",СтрокаТЗ.СемействоАвтомобиля);
		СтруктураПараметров.Вставить("РангАвторабот",СтрокаТЗ.РангАвторабот);
		СтруктураПараметров.Вставить("ГотовностьКОтправке",СтрокаТЗ.ГотовностьКОтправке);
		СтруктураПараметров.Вставить("ПовторнаяОтправка",СтрокаТЗ.ПовторнаяОтправка);
		
		РегистрыСведений.EDR_ЗаказНаряды.ОбновиитьЗаказНарядВРегистре(СтруктураПараметров);
		
	КонецЦикла;
	
КонецПроцедуры

Функция СохранитьИзмененияВРегистры() Экспорт
	//Все изменения регистров должны производиться одним пакетом.
	//Либо все, либо ничего, иначе будет разрушена целостность.
	
	НачатьТранзакцию();
	Попытка
		ЗаписьИзмененийПоСчетам();
		ЗаписьИзмененийПоИнцидентам();
		ЗаписьИзмененийПоРаботам();
		ЗаписьИзмененийПоТоварам();
		ЗаписьИзмененийПоСоответствиям();
		ЗаписьИзмененийПоЗаказНарядам();
		Результат = Истина;
		//Ошибок нет - фиксируем транзакцию
		ЗафиксироватьТранзакцию();
	Исключение
		
		Сообщить(ОписаниеОшибки());
		//Были ошибки - транзакцию отменяем.
		
		ОтменитьТранзакцию();
		Результат = Ложь;
	КонецПопытки;
	
	ЗаполнитьТаблицы();
	
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////
// Процедуры графического отображения структуры

Функция ПолучитьСписокТоваровПоИнвойсу(Инвойс)
	
	ЗаказНаряд = Инвойс.Ссылка;
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	EDR_Invoices.Invoice КАК Счет,
	|	EDR_Interventions.Intervention,
	|	ВЫБОР
	|		КОГДА EDR_ТоварыДоп.СтрокаИзЗаказНаряда
	|			ТОГДА ЗаказНарядТовары.Номенклатура
	|		ИНАЧЕ EDR_ТоварыДоп.DiversCode.Наименование
	|	КОНЕЦ КАК Номенклатура,
	|	&Invoice,
	|	ВЫБОР
	|		КОГДА EDR_ТоварыДоп.СтрокаИзЗаказНаряда
	|			ТОГДА ЗаказНарядТовары.Номенклатура.Артикул
	|		ИНАЧЕ EDR_ТоварыДоп.DiversCode.Код
	|	КОНЕЦ КАК Код,
	|	EDR_Interventions.GUID КАК GUID_События
	|ИЗ
	|	РегистрСведений.EDR_ТоварыДоп КАК EDR_ТоварыДоп
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.EDR_Interventions КАК EDR_Interventions
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.EDR_СоответствияИнвойсов КАК EDR_СоответствияИнвойсов
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.EDR_Invoices КАК EDR_Invoices
	|				ПО EDR_СоответствияИнвойсов.Invoice = EDR_Invoices.GUID
	|			ПО (EDR_СоответствияИнвойсов.Intervention = EDR_Interventions.GUID)
	|		ПО EDR_ТоварыДоп.GUID_Инцидента = EDR_Interventions.GUID
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
	|		ПО EDR_ТоварыДоп.Номенклатура = ЗаказНарядТовары.Номенклатура
	|			И EDR_ТоварыДоп.ЗаказНаряд = ЗаказНарядТовары.Ссылка
	|ГДЕ
	|	EDR_ТоварыДоп.ЗаказНаряд = &Ссылка
	|	И EDR_СоответствияИнвойсов.Invoice = &Invoice"
	);
	Запрос.УстановитьПараметр("Ссылка", ЗаказНаряд);
	Запрос.УстановитьПараметр("Invoice",Инвойс.GUID_Инвойса);
	
	ТабТоваров = Запрос.Выполнить().Выгрузить();
	
	Возврат ТабТоваров;
КонецФункции

Функция ПолучитьСписокРаботПоИнвойсу(Инвойс)
	
	ЗаказНаряд = Инвойс.Ссылка;
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	EDR_Invoices.Invoice КАК Счет,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда
	|			ТОГДА ЗаказНарядРаботы.Работа
	|		ИНАЧЕ EDR_РаботыДоп.DiversCode.Наименование
	|	КОНЕЦ КАК Работа,
	|	EDR_Interventions.GUID КАК GUID_События,
	|	&Invoice,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда
	|			ТОГДА ЗаказНарядРаботы.Работа.Артикул
	|		ИНАЧЕ EDR_РаботыДоп.DiversCode.Код
	|	КОНЕЦ КАК Код
	|ИЗ
	|	РегистрСведений.EDR_РаботыДоп КАК EDR_РаботыДоп
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
	|		ПО (ЗаказНарядРаботы.ИдентификаторРаботы = EDR_РаботыДоп.GUID_Работы)
	|			И (ЗаказНарядРаботы.Ссылка = EDR_РаботыДоп.ЗаказНаряд)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.EDR_Interventions КАК EDR_Interventions
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.EDR_СоответствияИнвойсов КАК EDR_СоответствияИнвойсов
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.EDR_Invoices КАК EDR_Invoices
	|				ПО EDR_СоответствияИнвойсов.Invoice = EDR_Invoices.GUID
	|			ПО (EDR_СоответствияИнвойсов.Intervention = EDR_Interventions.GUID)
	|		ПО EDR_РаботыДоп.GUID_Инцидента = EDR_Interventions.GUID
	|ГДЕ
	|	EDR_РаботыДоп.ЗаказНаряд = &Ссылка
	|	И EDR_СоответствияИнвойсов.Invoice = &Invoice
	|
	|СГРУППИРОВАТЬ ПО
	|	EDR_Interventions.GUID,
	|	EDR_Invoices.Invoice,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда
	|			ТОГДА ЗаказНарядРаботы.Работа.Артикул
	|		ИНАЧЕ EDR_РаботыДоп.DiversCode.Код
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда
	|			ТОГДА ЗаказНарядРаботы.Работа
	|		ИНАЧЕ EDR_РаботыДоп.DiversCode.Наименование
	|	КОНЕЦ"
	);
	Запрос.УстановитьПараметр("Ссылка", ЗаказНаряд);
	Запрос.УстановитьПараметр("Invoice",Инвойс.GUID_Инвойса);
	
	ТабРабот = Запрос.Выполнить().Выгрузить();
	
	Возврат ТабРабот;
КонецФункции

/////////////////////////////////////////////////
//	проверка на корректность введенных данных.

Функция ПроверитьНаКорректность(ЭтоОшибкиРаботыТовары = Ложь) Экспорт
	
	ВсеНормально = Истина;
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	ФормаПрогресса = ПолучитьОбщуюФорму("DMS_ФормаПроцессаОбщая");
	ФормаПрогресса.МаксимальноеЗначение = 20;
	
	ФормаПрогресса.Открыть();
	
	ФормаПрогресса.СтрокаСостоянияПрогрессора = "Проверка данных на корректность.";
	
	//Для начала собираем паттерн заказ-нарядов. Какие просрочены а какие нет.
	//Паралельно добавляем поле нужно согласование или нет.
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("ЗаказНаряды", ТаблицаЗаказов);
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Заявки", ТаблицаСчетов);
	Запрос.УстановитьПараметр("Инциденты", ТаблицаИнцидентов);
	Запрос.УстановитьПараметр("СоответсвияСчетов", ТаблицаСоответствий);
	Запрос.УстановитьПараметр("ТабНоменклатура", ТаблицаТоваров);
	Запрос.УстановитьПараметр("Работы", ТаблицаРабот);
	
	ФормаПрогресса.НадписьСостоянияПрогрессора = "Формирование паттерна Заказ-нарядов";

	//Отбираем только те заказы, которые готовы к отправке или повторно отправляются
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗаказНаряды.ЗаказНаряд,
	|	ЗаказНаряды.OTS,
	|	ЗаказНаряды.ГотовностьКОтправке,
	|	ЗаказНаряды.ПовторнаяОтправка,
	|	ЗаказНаряды.Отправлен,
	|	ЗаказНаряды.ДатаОткрытия,
	|	ЗаказНаряды.СемействоАвтомобиля,
	|	ЗаказНаряды.ЛКМ,
	|	ЗаказНаряды.ПробегАвтомобиля,
	|	ВЫБОР
	|		КОГДА ЗаказНаряды.Отправлен = ИСТИНА
	|				И ЗаказНаряды.ПовторнаяОтправка = ИСТИНА
	|			ТОГДА ИСТИНА
	|		КОГДА ЗаказНаряды.Отправлен = ИСТИНА
	|				И ЗаказНаряды.ПовторнаяОтправка = ЛОЖЬ
	|			ТОГДА ЛОЖЬ
	|		КОГДА ЗаказНаряды.Отправлен = ЛОЖЬ
	|				И ЗаказНаряды.ПовторнаяОтправка = ЛОЖЬ
	|				И ЗаказНаряды.ГотовностьКОтправке = ИСТИНА
	|			ТОГДА ИСТИНА
	|	КОНЕЦ КАК ПризнакОтбора
	|ПОМЕСТИТЬ ЗаказНаряды
	|ИЗ
	|	&ЗаказНаряды КАК ЗаказНаряды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказНаряды.ЗаказНаряд,
	|	ЗаказНаряды.OTS,
	|	ЗаказНаряды.ГотовностьКОтправке,
	|	ЗаказНаряды.ПовторнаяОтправка,
	|	ЗаказНаряды.Отправлен,
	|	ЗаказНаряды.ДатаОткрытия,
	|	ЗаказНаряды.СемействоАвтомобиля,
	|	ЗаказНаряды.ЛКМ,
	|	ЗаказНаряды.ПробегАвтомобиля,
	|	&ТекущаяДата,
	|	ВЫБОР
	|		КОГДА ЗаказНаряды.ПовторнаяОтправка
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РАЗНОСТЬДАТ(&ТекущаяДата, ЗаказНаряды.ДатаОткрытия, ДЕНЬ) < 30
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|	КОНЕЦ КАК ТребоватьСогласование
	|ПОМЕСТИТЬ ПаттерныЗН
	|ИЗ
	|	ЗаказНаряды КАК ЗаказНаряды
	|ГДЕ
	|	ЗаказНаряды.ПризнакОтбора = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ЗаказНаряды"
	;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	ФормаПрогресса.ЗначениеИндикатора = 1;
	ФормаПрогресса.НадписьСостоянияПрогрессора = "Формирование паттерна Заявок";
	
	//Получаем паттерн Заявок в менеджер ВТ
	ТекстЗапроса = "ВЫБРАТЬ
	|	Заявки.ЗаказНаряд,
	|	Заявки.Счет,
	|	Заявки.ИдентификаторСчета,
	|	Заявки.Категория,
	|	Заявки.ДатаИнвойса,
	|	Заявки.ВидРасходов,
	|	Заявки.Удален,
	|	Заявки.СчетФактура
	|ПОМЕСТИТЬ Заявки
	|ИЗ
	|	&Заявки КАК Заявки
	|ГДЕ
	|	Заявки.Удален = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Заявки.ЗаказНаряд КАК ЗаказНаряд,
	|	Заявки.Счет,
	|	Заявки.ИдентификаторСчета,
	|	Заявки.Категория,
	|	Заявки.ДатаИнвойса,
	|	Заявки.ВидРасходов,
	|	Заявки.Удален,
	|	Заявки.СчетФактура
	|ПОМЕСТИТЬ ПаттерныЗаявок
	|ИЗ
	|	Заявки КАК Заявки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПаттерныЗН КАК ПаттерныЗН
	|		ПО Заявки.ЗаказНаряд = ПаттерныЗН.ЗаказНаряд
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Заявки"
	;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	ФормаПрогресса.ЗначениеИндикатора = 2;
	ФормаПрогресса.НадписьСостоянияПрогрессора = "Формирование паттерна Распределения инцидентов по заявкам";
	
	//Получаем паттерн соответсвий в менеджер ВТ
	//Из соответсвия потом получим какие инциденты нам нужны.
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СоответсвияСчетов.ЗаказНаряд,
	|	СоответсвияСчетов.ИдентификаторСчета,
	|	СоответсвияСчетов.ИдентификаторИнцидента,
	|	СоответсвияСчетов.Процент,
	|	СоответсвияСчетов.ВидРасходов,
	|	СоответсвияСчетов.Категория
	|ПОМЕСТИТЬ Распределения
	|ИЗ
	|	&СоответсвияСчетов КАК СоответсвияСчетов
	|ГДЕ
	|	СоответсвияСчетов.Удален = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПаттерныРаспределения.ЗаказНаряд,
	|	ПаттерныРаспределения.ИдентификаторСчета,
	|	ПаттерныРаспределения.ИдентификаторИнцидента,
	|	ПаттерныРаспределения.Процент,
	|	ПаттерныРаспределения.ВидРасходов,
	|	ПаттерныРаспределения.Категория
	|ПОМЕСТИТЬ ПаттерныРаспределения
	|ИЗ
	|	Распределения КАК ПаттерныРаспределения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПаттерныЗН КАК ПаттерныЗН
	|		ПО ПаттерныРаспределения.ЗаказНаряд = ПаттерныЗН.ЗаказНаряд
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Распределения"
	;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	ФормаПрогресса.ЗначениеИндикатора = 3;
	ФормаПрогресса.НадписьСостоянияПрогрессора = "Формирование паттерна Инцидентов";
	
	//Получаем паттерн инцидентов в менеджер ВТ
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Инциденты.Инцидент,
	|	Инциденты.ИдентификаторИнцидента,
	|	Инциденты.КодОщущенияКлиента,
	|	Инциденты.ФункциональныйКод,
	|	Инциденты.НомерСогласования,
	|	Инциденты.ОтзывнаяНота,
	|	Инциденты.НомерСФ,
	|	Инциденты.ДатаСФ,
	|	Инциденты.ПробегПриУстановке,
	|	Инциденты.ОписаниеОперации,
	|	Инциденты.ОписаниеЖалобы,
	|	Инциденты.КомментарийОперации,
	|	Инциденты.ЗаказНаряд
	|ПОМЕСТИТЬ Инциденты
	|ИЗ
	|	&Инциденты КАК Инциденты
	|ГДЕ
	|	Инциденты.Удален = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПаттерныРаспределения.ИдентификаторИнцидента,
	|	ПаттерныРаспределения.ВидРасходов.Control_Indicator КАК ТребоватьПричину,
	|	ПаттерныРаспределения.ВидРасходов
	|ПОМЕСТИТЬ ВТТребоватьПричину
	|ИЗ
	|	ПаттерныРаспределения КАК ПаттерныРаспределения
	|ГДЕ
	|	(ПаттерныРаспределения.ВидРасходов.Control_Indicator = ИСТИНА
	|			ИЛИ ПаттерныРаспределения.ВидРасходов = ЗНАЧЕНИЕ(Справочник.EDR_ВидыРасходов.Ex91))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Инциденты.ЗаказНаряд,
	|	Инциденты.Инцидент,
	|	Инциденты.ИдентификаторИнцидента,
	|	Инциденты.КодОщущенияКлиента,
	|	Инциденты.ФункциональныйКод,
	|	Инциденты.НомерСогласования,
	|	Инциденты.ОтзывнаяНота,
	|	Инциденты.НомерСФ,
	|	Инциденты.ДатаСФ,
	|	Инциденты.ПробегПриУстановке,
	|	Инциденты.ОписаниеОперации,
	|	Инциденты.ОписаниеЖалобы,
	|	Инциденты.КомментарийОперации,
	|	ВЫБОР
	|		КОГДА ВТТребоватьПричину.ТребоватьПричину = ИСТИНА
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТребоватьПричину,
	|	ВЫБОР
	|		КОГДА ВТТребоватьПричину.ВидРасходов = ЗНАЧЕНИЕ(Справочник.EDR_ВидыРасходов.Ex91)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТребоватьЖалобуКомментарий,
	|	ВТТребоватьПричину.ВидРасходов
	|ПОМЕСТИТЬ ПаттерныИнцидентов
	|ИЗ
	|	Инциденты КАК Инциденты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПаттерныЗН КАК ПаттерныЗН
	|		ПО Инциденты.ЗаказНаряд = ПаттерныЗН.ЗаказНаряд
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТребоватьПричину КАК ВТТребоватьПричину
	|		ПО Инциденты.ИдентификаторИнцидента = ВТТребоватьПричину.ИдентификаторИнцидента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТТребоватьПричину
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Инциденты"
	;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	ФормаПрогресса.ЗначениеИндикатора = 4;
	ФормаПрогресса.НадписьСостоянияПрогрессора = "Формирование паттернов деталей и работ";

	ТекстЗапроса = "
	|Выбрать * 
	|ПОМЕСТИТЬ ПаттерныНоменклатуры
	|Из
	|  &ТабНоменклатура как ТабНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|Выбрать * 
	|ПОМЕСТИТЬ ПаттерныРабот
	|Из
	|  &Работы как ТабРаботы"
	;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	ФормаПрогресса.ЗначениеИндикатора = 5;
	ФормаПрогресса.НадписьСостоянияПрогрессора = "Подготовка таблицы для результатов проверки";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	EDR_ЗаказНаряды.ЗаказНаряд,
	|	EDR_Invoices.Invoice как Заявка,
	|	EDR_Interventions.Intervention как Инцидент,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК Объект,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(255)) КАК ОписаниеОшибки
	|ИЗ
	|	РегистрСведений.EDR_ЗаказНаряды КАК EDR_ЗаказНаряды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.EDR_Invoices КАК EDR_Invoices
	|		ПО EDR_ЗаказНаряды.ЗаказНаряд = EDR_Invoices.ЗаказНаряд
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.EDR_Interventions КАК EDR_Interventions
	|		ПО EDR_ЗаказНаряды.ЗаказНаряд = EDR_Interventions.ЗаказНаряд
	|ГДЕ
	|	EDR_ЗаказНаряды.ЗаказНаряд.Проведен = ЛОЖЬ"
	;
	
	Запрос.Текст = ТекстЗапроса;
	
	ТаблицаОшибок = Запрос.Выполнить().Выгрузить();
	ТаблицаОшибок.Очистить();
	
	ТаблицаОшибокРаботыТовары = ТаблицаОшибок.СкопироватьКолонки();
	
	/////////////////////////////////
	//	Начинаем проверки
	
	ФормаПрогресса.ЗначениеИндикатора = 6;
	ФормаПрогресса.НадписьСостоянияПрогрессора = "Проверка даты релиза/кода валют по ISO/производителей.";
	
	////$+ Комментарий 
	// Дата создания - 02.07.2012 13:36:46;
	// Автор - Окипний Андрей Евгеньевич
	//
	//Проверяем заполнение даты релиза - это константа. если пустая - ошибка
	//
	//$-
	ДатаРелиза = Константы.EDR_ДатаРелиза.Получить();
	Если НЕ ЗначениеЗаполнено(ДатаРелиза) тогда
		НС = ТаблицаОшибок.Добавить();
		НС.ЗаказНаряд	  = "-";
		НС.Заявка		  = "-";
		НС.Инцидент		  = "-";
		НС.Объект		  = "Константа ""Дата релиза""";
		НС.ОписаниеОшибки = "Не заполнена константа Дата релиза.";
	КонецЕсли;
	
	ПроверитьВалюты(МВТ, ТаблицаОшибок);
	
	ПроверитьПробег(МВТ, ТаблицаОшибок);
	
	ПроверитьПроизводителей(МВТ, ТаблицаОшибок);
	
	//Проверяем необходимость указания номера согласования
	ФормаПрогресса.ЗначениеИндикатора = 7;
	ФормаПрогресса.НадписьСостоянияПрогрессора = "Проверка наличия номеров согласований.";
	
	ПроверитьНомераСогласования(МВТ, ТаблицаОшибок);
	
	// Комментарий 
	//Дата создания - 10.04.2012 10:32:20; Автор - Окипний Андрей Евгеньевич
	//Проверяем корректность заполнения жалоб клиента и комментариев
	//
	ФормаПрогресса.ЗначениеИндикатора = 8;
	ФормаПрогресса.НадписьСостоянияПрогрессора = "Проверка заполнения жалоб клиента и комментариев.";
	
	ПроверитьПустыеКомментарии(МВТ, ТаблицаОшибок);
	
	// Комментарий 
	//Дата создания - 10.04.2012 10:32:20; Автор - Окипний Андрей Евгеньевич
	//Проверка корректности заполнения полей Функциональный код, код ощущения
	//и OTS
	
	ФормаПрогресса.ЗначениеИндикатора = 9;
	ФормаПрогресса.НадписьСостоянияПрогрессора = "Проверка заполнения полей Функциональный код," + 
												 Символы.ПС + "код ощущения и OTS.";
	ПроверитьЗаполнениеПолейИнцидентов(МВТ, ТаблицаОшибок);
	
	// Комментарий 
	//Дата создания - 10.04.2012 13:08:17; Автор - Окипний Андрей Евгеньевич
	//Проверка полей "Категория заявок"
	//
	ФормаПрогресса.ЗначениеИндикатора = 10;
	ФормаПрогресса.НадписьСостоянияПрогрессора = "Проверка заполнения полей ""Категория"" для заявок.";
	
	ПроверитьЗаполнениеКатегорииЗаявок(МВТ, ТаблицаОшибок);
	
	//Комментарий 
	//Дата создания - 11.04.2012 10:53:05; Автор - Окипний Андрей Евгеньевич
	//Проверка полей "Вид расходов"
	//
	ФормаПрогресса.ЗначениеИндикатора = 11;
	ФормаПрогресса.НадписьСостоянияПрогрессора = "Проверка заполнения полей ""Вид расходов"" для заявок.";
	
	ПроверитьЗаполнениеКодСтатьиРасходовЗаявок(МВТ, ТаблицаОшибок);
	
	// Комментарий 
	//Дата создания - 11.04.2012 11:23:46; Автор - Окипний Андрей Евгеньевич
	//Теперь проверим все ли заявки имеют инциденты
	//
	ФормаПрогресса.ЗначениеИндикатора = 12;
	ФормаПрогресса.НадписьСостоянияПрогрессора = "Поиск пустых заявок";
	
	ПроверитьПустыеЗаявки(МВТ, ТаблицаОшибок);
	
	// Комментарий 
	//Дата создания - 11.04.2012 11:40:06; Автор - Окипний Андрей Евгеньевич
	//Теперь обратная операция, будем искать не привязанные инциденты
	//
	ФормаПрогресса.ЗначениеИндикатора = 13;
	ФормаПрогресса.НадписьСостоянияПрогрессора = "Поиск ""потерянных"" инцидентов";
	
	ПроверитьПотерянныеИнциденты(МВТ, ТаблицаОшибок);
	
	// Комментарий 
	//Дата создания - 13.06.2012 16:35:09; Автор - Окипний Андрей Евгеньевич
	//Проверка правильности заполнения вида расходов - 19
	//
	ФормаПрогресса.ЗначениеИндикатора = 14;
	ФормаПрогресса.НадписьСостоянияПрогрессора = "Проверка кода статьи расходов 19";
	
	ПроверитьКодРасходов_19(МВТ, ТаблицаОшибок);
	
	// Комментарий 
	//Дата создания - 14.06.2012 10:26:22; Автор - Окипний Андрей Евгеньевич
	//Проверка Номенклатуры и работ на принадлежность Renault.
	//Для этого делаем проверку работ и номенклатуры по регистрам Tarif PR и OPERACODE
	//
	
	ФормаПрогресса.ЗначениеИндикатора = 15;
	ФормаПрогресса.НадписьСостоянияПрогрессора = "Проверка номенклатуры и авторабот по каталогам RENAULT";
	
	ПроверитьНоменклатуруИАвтоработыНаСоответствие(МВТ, ТаблицаОшибок, ТаблицаОшибокРаботыТовары);
	
	
	// Комментарий 
	//Дата создания - 14.06.2012 15:05:55; Автор - Окипний Андрей Евгеньевич
	//Проверка количества установленных причин обращения. для каждого инцидента возможна только одна
	//инцидентов без причин обращения так же не должно быть
	//
	ФормаПрогресса.ЗначениеИндикатора = 16;
	ФормаПрогресса.НадписьСостоянияПрогрессора = "Проверка количество причин обращения по инцидентам";
	
	ПроверитьПричиныОбращения(МВТ, ТаблицаОшибок);
	
	ФормаПрогресса.ЗначениеИндикатора = 20;
	
	Если ТаблицаОшибок.Количество() > 0 тогда //Есть ошибки
		
		ВсеНормально = Ложь;
		
		Если ТаблицаОшибокРаботыТовары.Количество() = ТаблицаОшибок.Количество() Тогда
			ЭтоОшибкиРаботыТовары = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	ФормаПрогресса.Закрыть();
	
	//Удаляем все временные таблицы
	МВТ = Неопределено;
	
	Возврат ВсеНормально;
	
КонецФункции

////@+ Процедура ПроверитьВалюты(МВТ, ТаблицаОшибок)
// Дата создания - 02.07.2012 13:45:55;
// Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Процедура проверяет заполненность реквизита КодВалютыПоISO
//
// Параметры
//  Парам1 МВТ  - Менеджер временных таблиц - МВТ с временными таблицами АРМа
//
//  Парам2 ТаблицаОшибок  - Типизированная таблица значений- в этой таблице
//                 собирается список всех выявленных в ходе проверки ошибок заполнения
//@-
Процедура ПроверитьВалюты(МВТ, ТаблицаОшибок) 

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ПаттерныЗН.ЗаказНаряд.ВалютаДокумента КАК Валюта
	|ПОМЕСТИТЬ ОшибкиВалюты
	|ИЗ
	|	ПаттерныЗН КАК ПаттерныЗН
	|ГДЕ
	|	""RUB"" = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""-"" КАК ЗаказНаряд,
	|	""-"" КАК Заявка,
	|	""-"" КАК Инцидент,
	|	""Валюта "" + ОшибкиВалюты.Валюта.Наименование КАК Объект,
	|	""Не заполнен код валюты по ISO"" КАК ОписаниеОшибки
	|ИЗ
	|	ОшибкиВалюты КАК ОшибкиВалюты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОшибкиВалюты"
	;
	Запрос.Текст = ТекстЗапроса;
	
	СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок);
	
КонецПроцедуры // ПроверитьВалюты(МВТ, ТаблицаОшибок)


////@+ Процедура ПроверитьПроизводителей(МВТ, ТаблицаОшибок)
// Дата создания - 02.07.2012 14:17:01;
// Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Процедура получает список заказов в которых у автомобилей нет производителя
//
// Параметры
//  Парам1 МВТ  - Менеджер временных таблиц - Содержит менеджер временных таблиц
//                 
//  Парам2 ТаблицаОшибок  - Типизированная таблица значений- в этой таблице
//                 собирается список всех выявленных в ходе проверки ошибок заполнения
//@-
Процедура ПроверитьПроизводителей(МВТ, ТаблицаОшибок) 

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ПаттерныЗН.ЗаказНаряд,
	|	ПаттерныЗН.ЗаказНаряд.Автомобиль КАК Автомобиль
	|ПОМЕСТИТЬ ВТПроизводители
	|ИЗ
	|	ПаттерныЗН КАК ПаттерныЗН
	|ГДЕ
	|	ПаттерныЗН.ЗаказНаряд.Автомобиль.Модель.Производитель = ЗНАЧЕНИЕ(Справочник.Производители.ПустаяСсылка)
	//Добавлена проверка на Марку MO 2015.01.12
	| И ПаттерныЗН.ЗаказНаряд.Автомобиль.Модель НЕ В (&МоделиМарки)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПаттерныЗН.ЗаказНаряд.Автомобиль,
	|	ПаттерныЗН.ЗаказНаряд
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПроизводители.ЗаказНаряд,
	|	""-"" КАК Заявка,
	|	""-"" КАК Инцидент,
	|	ВТПроизводители.Автомобиль КАК Объект,
	|	""У модели автомобиля не указан производитель"" КАК ОписаниеОшибки
	|ИЗ
	|	ВТПроизводители КАК ВТПроизводители
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПроизводители"
	;
	
	//Добавлена проверка на Марку MO 2015.01.12
	Запрос.УстановитьПараметр("МоделиМарки", Справочники.CRM_МаркаАвтомобиля.RENAULT.МоделиАвтомобилей.ВыгрузитьКолонку("Модель"));	
	
	Запрос.Текст = ТекстЗапроса;
	
	СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок);
	
КонецПроцедуры // ПроверитьПроизводителей(МВТ, ТаблицаОшибок)

Процедура ПроверитьНомераСогласования(МВТ, ТаблицаОшибок)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПаттерныЗН.ЗаказНаряд КАК ЗаказНаряд,
	|	ПаттерныЗН.ТребоватьСогласование
	|ПОМЕСТИТЬ Заказы
	|ИЗ
	|	ПаттерныЗН КАК ПаттерныЗН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПаттерныРаспределения.ИдентификаторСчета,
	|	ПаттерныРаспределения.ИдентификаторИнцидента,
	|	ПаттерныРаспределения.ЗаказНаряд,
	|	ПаттерныРаспределения.ВидРасходов
	|ПОМЕСТИТЬ Распределение
	|ИЗ
	|	ПаттерныРаспределения КАК ПаттерныРаспределения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Заказы КАК Заказы
	|		ПО ПаттерныРаспределения.ЗаказНаряд = Заказы.ЗаказНаряд
	|ГДЕ
	|	ПаттерныРаспределения.ВидРасходов = ЗНАЧЕНИЕ(Справочник.EDR_ВидыРасходов.Ex57)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПаттерныИнцидентов.ЗаказНаряд,
	|	ПаттерныИнцидентов.Инцидент,
	|	ПаттерныИнцидентов.НомерСогласования
	|ПОМЕСТИТЬ ИнцидентыБезСогласования
	|ИЗ
	|	ПаттерныИнцидентов КАК ПаттерныИнцидентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Распределение КАК Распределение
	|		ПО ПаттерныИнцидентов.ИдентификаторИнцидента = Распределение.ИдентификаторИнцидента
	|ГДЕ
	|	ПаттерныИнцидентов.НомерСогласования = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Заказы.ЗаказНаряд
	|ПОМЕСТИТЬ ЗаказыСОбязательнымСогласованием
	|ИЗ
	|	Заказы КАК Заказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Распределение КАК Распределение
	|		ПО Заказы.ЗаказНаряд = Распределение.ЗаказНаряд
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Заказы.ЗаказНаряд
	|ИЗ
	|	Заказы КАК Заказы
	|ГДЕ
	|	Заказы.ТребоватьСогласование = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Заказы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Распределение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыСОбязательнымСогласованием.ЗаказНаряд КАК ЗаказНаряд,
	|	ИнцидентыБезСогласования.Инцидент КАК Инцидент,
	|	""-"" КАК Заявка,
	|	""Номер согласования"" КАК Объект,
	|	""Не заполнен номер согласования"" КАК ОписаниеОшибки
	|ИЗ
	|	ЗаказыСОбязательнымСогласованием КАК ЗаказыСОбязательнымСогласованием
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИнцидентыБезСогласования КАК ИнцидентыБезСогласования
	|		ПО ЗаказыСОбязательнымСогласованием.ЗаказНаряд = ИнцидентыБезСогласования.ЗаказНаряд
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ЗаказыСОбязательнымСогласованием
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ИнцидентыБезСогласования"
	;
	
	Запрос.Текст = ТекстЗапроса;
	
	СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок);
	
КонецПроцедуры

Процедура ПроверитьПустыеКомментарии(МВТ, ТаблицаОшибок)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	// Комментарий 
	//Дата создания - 09.04.2012 16:31:25; Автор - Окипний Андрей Евгеньевич
	//
	//Выполним поиск пустых комментариев и жалоб клиента
	//Всю проверку сделаем одним пакетным запросом. 
	//
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПаттерныИнцидентов.ИдентификаторИнцидента,
	|	ПаттерныИнцидентов.ЗаказНаряд,
	|	ПаттерныИнцидентов.Инцидент,
	|	ПаттерныИнцидентов.КодОщущенияКлиента,
	|	ПаттерныИнцидентов.ФункциональныйКод,
	|	ПаттерныИнцидентов.НомерСогласования,
	|	ПаттерныИнцидентов.ОтзывнаяНота,
	|	ПаттерныИнцидентов.НомерСФ,
	|	ПаттерныИнцидентов.ДатаСФ,
	|	ПаттерныИнцидентов.ПробегПриУстановке,
	|	ПаттерныИнцидентов.ОписаниеОперации,
	|	ПаттерныИнцидентов.ОписаниеЖалобы,
	|	ПаттерныИнцидентов.КомментарийОперации,
	|	ПаттерныИнцидентов.ТребоватьЖалобуКомментарий,
	|	ПаттерныИнцидентов.ВидРасходов
	|ПОМЕСТИТЬ ВремИнциденты
	|ИЗ
	|	ПаттерныИнцидентов КАК ПаттерныИнцидентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремИнциденты.ЗаказНаряд,
	|	ВремИнциденты.Инцидент,
	|	""-"" КАК Заявка,
	|	""Комментарий"" КАК Объект,
	|	""Не указан комментарий"" КАК ОписаниеОшибки
	|ПОМЕСТИТЬ ОшибкиКомментарии
	|ИЗ
	|	ВремИнциденты КАК ВремИнциденты
	|ГДЕ
	|	ВремИнциденты.КомментарийОперации = """"
	|	И ВремИнциденты.ТребоватьЖалобуКомментарий = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремИнциденты.ЗаказНаряд,
	|	ВремИнциденты.Инцидент,
	|	""-"" КАК Заявка,
	|	""Жалоба клиента"" КАК Объект,
	|	""Не указана жалоба клиента"" КАК ОписаниеОшибки
	|ПОМЕСТИТЬ ОшибкиЖалобы
	|ИЗ
	|	ВремИнциденты КАК ВремИнциденты
	|ГДЕ
	|	ВремИнциденты.ОписаниеЖалобы = """"
	|	И ВремИнциденты.ТребоватьЖалобуКомментарий = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОшибкиКомментарии.ЗаказНаряд КАК ЗаказНаряд,
	|	ОшибкиКомментарии.Инцидент КАК Инцидент,
	|	ОшибкиКомментарии.Заявка КАК Заявка,
	|	ОшибкиКомментарии.Объект КАК Объект,
	|	ОшибкиКомментарии.ОписаниеОшибки КАК ОписаниеОшибки
	|ИЗ
	|	ОшибкиКомментарии КАК ОшибкиКомментарии
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОшибкиЖалобы.ЗаказНаряд,
	|	ОшибкиЖалобы.Инцидент,
	|	ОшибкиЖалобы.Заявка,
	|	ОшибкиЖалобы.Объект,
	|	ОшибкиЖалобы.ОписаниеОшибки
	|ИЗ
	|	ОшибкиЖалобы КАК ОшибкиЖалобы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОшибкиКомментарии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОшибкиЖалобы"
	;
	
	Запрос.Текст = ТекстЗапроса;
	
	СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок);
	
КонецПроцедуры

////@+ Процедура ПроверитьЗаполнениеПолейИнцидентов(МВТ, ТаблицаОшибок)
// Дата создания - 10.04.2012 10:36:40
// Автор - Окипний Андрей Евгеньевич
// 
//
// Описание процедуры
//  Проверяет заполнение полей инцидентов:
//  OTS - может быть пустым
//  Функциональный код - указывается всегда
//  Код ощущения клиента - может быть пустым. 
//               Зависит от категории заявки и кода видов расходов
//
// Параметры
//  Парам1 МВТ  - Менеджер временных таблиц - Содержит менеджер временных таблиц
//                 
//  Парам2 ТаблицаОшибок  - Типизированная таблица значений- в этой таблице
//                 собирается список всех выявленных в ходе проверки ошибок заполнения
//@-
Процедура ПроверитьЗаполнениеПолейИнцидентов(МВТ, ТаблицаОшибок) 

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	// Комментарий 
	//Дата создания - 10.04.2012 10:41:41; Автор - Окипний Андрей Евгеньевич
	//Выполним поиск пустых комментариев и жалоб клиента
	//Всю проверку сделаем одним пакетным запросом. 
	//
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВремИнциденты.ИдентификаторИнцидента,
	|	ВремИнциденты.ЗаказНаряд,
	|	ВремИнциденты.Инцидент,
	|	ВремИнциденты.КодОщущенияКлиента,
	|	ВремИнциденты.ФункциональныйКод,
	|	ВремИнциденты.ОтзывнаяНота
	|ПОМЕСТИТЬ ВремТЗ_OTS_ФК_КОК
	|ИЗ
	|	ВремИнциденты КАК ВремИнциденты
	|ГДЕ
	|	ВремИнциденты.ВидРасходов <> &ВидРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТЗ_OTS_ФК_КОК.ЗаказНаряд,
	|	ВремТЗ_OTS_ФК_КОК.Инцидент,
	|	""-"" КАК Заявка,
	|	""Функциональный код"" КАК Объект,
	|	""Не заполнен функциональный код"" КАК ОписаниеОшибки
	|ПОМЕСТИТЬ ОшибкиФК
	|ИЗ
	|	ВремТЗ_OTS_ФК_КОК КАК ВремТЗ_OTS_ФК_КОК
	|ГДЕ
	|	ВремТЗ_OTS_ФК_КОК.ФункциональныйКод = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказНаряды.ЗаказНаряд
	|ПОМЕСТИТЬ Заказы_с_OTS
	|ИЗ
	|	ПаттерныЗН КАК ЗаказНаряды
	|ГДЕ
	|	ЗаказНаряды.OTS = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТЗ_OTS_ФК_КОК.ЗаказНаряд,
	|	ВремТЗ_OTS_ФК_КОК.Инцидент,
	|	""-"" КАК Заявка,
	|	""Отзывная нота"" КАК Объект,
	|	""Не указана отзывная компания"" КАК ОписаниеОшибки
	|ПОМЕСТИТЬ ОшибкиOTS
	|ИЗ
	|	ВремТЗ_OTS_ФК_КОК КАК ВремТЗ_OTS_ФК_КОК
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Заказы_с_OTS КАК Заказы_с_OTS
	|		ПО ВремТЗ_OTS_ФК_КОК.ЗаказНаряд = Заказы_с_OTS.ЗаказНаряд
	|ГДЕ
	|	ВремТЗ_OTS_ФК_КОК.ОтзывнаяНота = ЗНАЧЕНИЕ(Справочник.СервисныеКампании.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Заказы_с_OTS
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПроверкиКОК.ИдентификаторИнцидента
	|ПОМЕСТИТЬ ТаблицаПроверкиКОК
	|ИЗ
	|	&ТаблицаПроверкиКОК КАК ТаблицаПроверкиКОК
	|ГДЕ
	|	ТаблицаПроверкиКОК.Control_EC = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТЗ_OTS_ФК_КОК.ЗаказНаряд,
	|	ВремТЗ_OTS_ФК_КОК.Инцидент,
	|	""-"" КАК Заявка,
	|	""Код ощущения/жалобы клиента"" КАК Объект,
	|	""Не заполнено поле """"Код ощущения\жалобы клиента"""""" КАК ОписаниеОшибки
	|ПОМЕСТИТЬ ОшибкиКОК
	|ИЗ
	|	ВремТЗ_OTS_ФК_КОК КАК ВремТЗ_OTS_ФК_КОК
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПроверкиКОК КАК ТаблицаПроверкиКОК
	|		ПО ВремТЗ_OTS_ФК_КОК.ИдентификаторИнцидента = ТаблицаПроверкиКОК.ИдентификаторИнцидента
	|ГДЕ
	|	ВремТЗ_OTS_ФК_КОК.КодОщущенияКлиента = ЗНАЧЕНИЕ(Справочник.EDR_КодыОщущенийКлиента.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаПроверкиКОК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОшибкиФК.ЗаказНаряд,
	|	ОшибкиФК.Инцидент,
	|	ОшибкиФК.Заявка,
	|	ОшибкиФК.Объект,
	|	ОшибкиФК.ОписаниеОшибки
	|ИЗ
	|	ОшибкиФК КАК ОшибкиФК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОшибкиOTS.ЗаказНаряд,
	|	ОшибкиOTS.Инцидент,
	|	ОшибкиOTS.Заявка,
	|	ОшибкиOTS.Объект,
	|	ОшибкиOTS.ОписаниеОшибки
	|ИЗ
	|	ОшибкиOTS КАК ОшибкиOTS
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОшибкиКОК.ЗаказНаряд,
	|	ОшибкиКОК.Инцидент,
	|	ОшибкиКОК.Заявка,
	|	ОшибкиКОК.Объект,
	|	ОшибкиКОК.ОписаниеОшибки
	|ИЗ
	|	ОшибкиКОК КАК ОшибкиКОК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОшибкиOTS
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОшибкиКОК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОшибкиФК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремТЗ_OTS_ФК_КОК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремИнциденты"
	;

	Запрос.УстановитьПараметр("ТаблицаПроверкиКОК", ТаблицаПараметровВидовРасходов);
	Запрос.УстановитьПараметр("ВидРасходов", Справочники.EDR_ВидыРасходов.Ex91);
	Запрос.Текст = ТекстЗапроса;
	
	СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок);
	
КонецПроцедуры // ПроверитьЗаполнениеПолейИнцидентов(МВТ, ТаблицаОшибок)

////@+ Процедура ПроверитьЗаполнениеКатегорииЗаявок(МВТ, ТаблицаОшибок)
// Дата создания - 10.04.2012 13:10:27
// Автор - Окипний Андрей Евгеньевич
// 
//
// Описание процедуры
//  Процедура производит поиск заявок с не заполненым полем "Категория"
//
// Параметры
//  Парам1 МВТ  - Менеджер временных таблиц - Содержит менеджер временных таблиц
//                 
//  Парам2 ТаблицаОшибок  - Типизированная таблица значений- в этой таблице
//                 собирается список всех выявленных в ходе проверки ошибок заполнения
//@-
Процедура ПроверитьЗаполнениеКатегорииЗаявок(МВТ, ТаблицаОшибок) 

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	// Комментарий 
	//Дата создания - 10.04.2012 13:19:03; Автор - Окипний Андрей Евгеньевич
	//Выполним поиск пустых категорий в таблице заявок
	//Всю проверку сделаем одним пакетным запросом. 
	//
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПаттерныЗаявок.ЗаказНаряд,
	|	ПаттерныЗаявок.Счет КАК Заявка,
	|	""-"" КАК Инцидент,
	|	""Категория"" КАК Объект,
	|	""Не заполнено поле """"Категория"""""" КАК ОписаниеОшибки
	|ИЗ
	|	ПаттерныЗаявок КАК ПаттерныЗаявок
	|ГДЕ
	|	ПаттерныЗаявок.Категория = ЗНАЧЕНИЕ(Справочник.EDR_КатегорииСчетов.ПустаяСсылка)"
	;
	Запрос.Текст = ТекстЗапроса;
	
	СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок);
	
КонецПроцедуры // ПроверитьЗаполнениеКатегорииЗаявок(МВТ, ТаблицаОшибок)

////@+ Процедура ПроверитьЗаполнениеКодСтатьиРасходовЗаявок(МВТ, ТаблицаОшибок)
// Дата создания - 10.04.2012 13:10:27
// Автор - Окипний Андрей Евгеньевич
// 
//
// Описание процедуры
//  Процедура производит поиск заявок с не заполненым полем "Вид расходов"
//  при этом учитывается возможность пустого поля 
//  из таблицы "ТаблицаСоответствийКатегорий"
//  Для этого производим поиск 
//
// Параметры
//  Парам1 МВТ  - Менеджер временных таблиц - Содержит менеджер временных таблиц
//                 
//  Парам2 ТаблицаОшибок  - Типизированная таблица значений- в этой таблице
//                 собирается список всех выявленных в ходе проверки ошибок заполнения
//@-
Процедура ПроверитьЗаполнениеКодСтатьиРасходовЗаявок(МВТ, ТаблицаОшибок) 

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	// Комментарий 
	//Дата создания - 10.04.2012 13:19:03; Автор - Окипний Андрей Евгеньевич
	//Выполним поиск пустых Кодов статей расходов в таблице заявок
	//Всю проверку сделаем одним пакетным запросом. 
	//
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПаттерныЗаявок.ЗаказНаряд,
	|	ПаттерныЗаявок.Счет,
	|	ПаттерныЗаявок.Категория,
	|	ПаттерныЗаявок.ВидРасходов
	|ПОМЕСТИТЬ ВремЗаявки
	|ИЗ
	|	ПаттерныЗаявок КАК ПаттерныЗаявок
	|ГДЕ
	|	ПаттерныЗаявок.ВидРасходов = ЗНАЧЕНИЕ(Справочник.EDR_ВидыРасходов.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСоответствийКатегорий.ExpenceCode,
	|	ТаблицаСоответствийКатегорий.Категория
	|ПОМЕСТИТЬ ВремТабПрименяемости
	|ИЗ
	|	&ТаблицаСоответствийКатегорий КАК ТаблицаСоответствийКатегорий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТабПрименяемости.Категория,
	|	ВремТабПрименяемости.ExpenceCode
	|ПОМЕСТИТЬ ВсеСоответствия
	|ИЗ
	|	ВремТабПрименяемости КАК ВремТабПрименяемости
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	EDR_КатегорииСчетовВидыРасходов.КодСтатьиРасходов,
	|	EDR_КатегорииСчетовВидыРасходов.Ссылка
	|ИЗ
	|	Справочник.EDR_КатегорииСчетов.ВидыРасходов КАК EDR_КатегорииСчетовВидыРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеСоответствия.Категория,
	|	ВсеСоответствия.ExpenceCode
	|ПОМЕСТИТЬ НеПустыеСоответствия
	|ИЗ
	|	ВсеСоответствия КАК ВсеСоответствия
	|ГДЕ
	|	(НЕ ВсеСоответствия.ExpenceCode = НЕОПРЕДЕЛЕНО)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеСоответствия.ExpenceCode,
	|	ВсеСоответствия.Категория
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВсеСоответствия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НеПустыеСоответствия.Категория КАК СоответствиеКатегория,
	|	КОЛИЧЕСТВО(НеПустыеСоответствия.ExpenceCode) КАК КоличествоСоответсвий
	|ПОМЕСТИТЬ ПодсчитанныеВхождения
	|ИЗ
	|	НеПустыеСоответствия КАК НеПустыеСоответствия
	|
	|СГРУППИРОВАТЬ ПО
	|	НеПустыеСоответствия.Категория
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремТабПрименяемости
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НеПустыеСоответствия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремЗаявки.ЗаказНаряд,
	|	ВремЗаявки.Счет КАК Заявка,
	|	""-"" КАК Инцидент,
	|	""Вид расходов"" КАК Объект,
	|	""Не заполнено обязательное поле """"Вид расходов"""""" КАК ОписаниеОшибки
	|ИЗ
	|	ВремЗаявки КАК ВремЗаявки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПодсчитанныеВхождения КАК ПодсчитанныеВхождения
	|		ПО ВремЗаявки.Категория = ПодсчитанныеВхождения.СоответствиеКатегория
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремЗаявки"
	;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТаблицаСоответствийКатегорий", ТаблицаСоответствийКатегорий);
	
	СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок);
	
КонецПроцедуры // ПроверитьЗаполнениеКодСтатьиРасходовЗаявок(МВТ, ТаблицаОшибок)

////@+ Процедура ПроверитьПустыеЗаявки(МВТ, ТаблицаОшибок)
// Дата создания - 11.04.2012 11:26:13
// Автор - Окипний Андрей Евгеньевич
// 
//
// Описание процедуры
//  Производит поиск пустых заявок. 
//  Т.е. выбираем те заявки у которых нет привязки в соответствиях.
//
// Параметры
//  Парам1 МВТ  - Менеджер временных таблиц - Содержит менеджер временных таблиц
//                 
//  Парам2 ТаблицаОшибок  - Типизированная таблица значений- в этой таблице
//                 собирается список всех выявленных в ходе проверки ошибок заполнения
//@-
Процедура ПроверитьПустыеЗаявки(МВТ, ТаблицаОшибок) 

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	// Комментарий 
	//Дата создания - 10.04.2012 13:19:03; Автор - Окипний Андрей Евгеньевич
	//Выполним поиск пустых Кодов статей расходов в таблице заявок
	//Всю проверку сделаем одним пакетным запросом. 
	//
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПаттерныЗаявок.ЗаказНаряд,
	|	ПаттерныЗаявок.Счет,
	|	ПаттерныЗаявок.ИдентификаторСчета
	|ПОМЕСТИТЬ ВремЗаявки
	|ИЗ
	|	ПаттерныЗаявок КАК ПаттерныЗаявок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПаттерныРаспределения.ИдентификаторСчета,
	|	ПаттерныРаспределения.ИдентификаторИнцидента
	|ПОМЕСТИТЬ ВремРаспределения
	|ИЗ
	|	ПаттерныРаспределения КАК ПаттерныРаспределения
	|ГДЕ
	|	(НЕ ПаттерныРаспределения.ИдентификаторИнцидента ЕСТЬ NULL )
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремЗаявки.ЗаказНаряд,
	|	ВремЗаявки.Счет КАК Заявка,
	|	""-"" КАК Инцидент,
	|	""Инцидент"" КАК Объект,
	|	""Для заявки не найдены инциденты"" КАК ОписаниеОшибки
	|ИЗ
	|	ВремЗаявки КАК ВремЗаявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремРаспределения КАК ВремРаспределения
	|		ПО ВремЗаявки.ИдентификаторСчета = ВремРаспределения.ИдентификаторСчета
	|ГДЕ
	|	ВремРаспределения.ИдентификаторСчета ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремЗаявки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремРаспределения"
	;
	Запрос.Текст = ТекстЗапроса;
	
	СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок);
	
КонецПроцедуры // ПроверитьПустыеЗаявки(МВТ, ТаблицаОшибок)

////@+ Процедура ПроверитьПотерянныеИнциденты(МВТ, ТаблицаОшибок)
// Дата создания - 11.04.2012 11:41:42
// Автор - Окипний Андрей Евгеньевич
//
// Описание процедуры
//  Производит поиск потерянных инцидентов,
//  Т.е. инцидентов, которые не имеют привязки к заявкам в соответствиях
//
// Параметры
//  Парам1 МВТ  - Менеджер временных таблиц - Содержит менеджер временных таблиц
//                 
//  Парам2 ТаблицаОшибок  - Типизированная таблица значений- в этой таблице
//                 собирается список всех выявленных в ходе проверки ошибок заполнения
//@-
Процедура ПроверитьПотерянныеИнциденты(МВТ, ТаблицаОшибок) 

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	// Комментарий 
	//Дата создания - 10.04.2012 13:19:03; Автор - Окипний Андрей Евгеньевич
	//Выполним поиск пустых Кодов статей расходов в таблице заявок
	//Всю проверку сделаем одним пакетным запросом. 
	//
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПаттерныИнцидентов.ИдентификаторИнцидента,
	|	ПаттерныИнцидентов.Инцидент,
	|	ПаттерныИнцидентов.ЗаказНаряд
	|ПОМЕСТИТЬ ВремИнциденты
	|ИЗ
	|	ПаттерныИнцидентов КАК ПаттерныИнцидентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПаттерныРаспределения.ИдентификаторСчета,
	|	ПаттерныРаспределения.ИдентификаторИнцидента
	|ПОМЕСТИТЬ ВремРаспределения
	|ИЗ
	|	ПаттерныРаспределения КАК ПаттерныРаспределения
	|ГДЕ
	|	(НЕ ПаттерныРаспределения.ИдентификаторИнцидента ЕСТЬ NULL )
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремИнциденты.ЗаказНаряд,
	|	""-"" КАК Заявка,
	|	ВремИнциденты.Инцидент КАК Инцидент,
	|	""Заявка"" КАК Объект,
	|	""Для инцидента не найдены заявки"" КАК ОписаниеОшибки
	|ИЗ
	|	ВремИнциденты КАК ВремИнциденты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремРаспределения КАК ВремРаспределения
	|		ПО ВремИнциденты.ИдентификаторИнцидента = ВремРаспределения.ИдентификаторИнцидента
	|ГДЕ
	|	ВремРаспределения.ИдентификаторСчета ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремИнциденты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремРаспределения"
	;
	Запрос.Текст = ТекстЗапроса;
	
	СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок);
	
КонецПроцедуры // ПроверитьПотерянныеИнциденты(МВТ, ТаблицаОшибок)

////@+ Процедура ПроверитьКодРасходов_19(МВТ, ТаблицаОшибок)
// Дата создания - 09.06.2012 11:19:38;
// Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Процедура проверяет заполненность полей 
//  1 - Номер заказ-наряда
//  2 - Дата заказ-наряда
//  3 - Пробег при установке 
//  у инцидентов с кодом расходов 19
//
// Параметры
//  Парам1 МВТ  - Менеджер временных таблиц - Содержит менеджер временных таблиц
//
//  Парам2 ТаблицаОшибок  - Типизированная таблица значений- в этой таблице
//                 собирается список всех выявленных в ходе проверки ошибок заполнения
//@-
Процедура ПроверитьКодРасходов_19(МВТ, ТаблицаОшибок) 

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ПаттерныРаспределения.ИдентификаторИнцидента,
	|	ПаттерныРаспределения.ВидРасходов
	|ПОМЕСТИТЬ Соответствия
	|ИЗ
	|	ПаттерныРаспределения КАК ПаттерныРаспределения
	|ГДЕ
	|	ПаттерныРаспределения.ВидРасходов = ЗНАЧЕНИЕ(Справочник.EDR_ВидыРасходов.Ex19)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПаттерныИнцидентов.ИдентификаторИнцидента,
	|	ПаттерныИнцидентов.НомерСФ,
	|	ПаттерныИнцидентов.ДатаСФ,
	|	ПаттерныИнцидентов.ПробегПриУстановке,
	|	ПаттерныИнцидентов.ЗаказНаряд,
	|	ПаттерныИнцидентов.Инцидент
	|ПОМЕСТИТЬ Инциденты_19
	|ИЗ
	|	ПаттерныИнцидентов КАК ПаттерныИнцидентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Соответствия КАК Соответствия
	|		ПО ПаттерныИнцидентов.ИдентификаторИнцидента = Соответствия.ИдентификаторИнцидента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Соответствия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Инциденты_19.ЗаказНаряд КАК ЗаказНаряд,
	|	""-"" КАК Заявка,
	|	Инциденты_19.Инцидент,
	|	""Номер Заказ-наряда установки детали"" КАК Объект,
	|	""Не указан номер заказ-наряда по установке гарантийной детали."" КАК ОписаниеОшибки
	|ИЗ
	|	Инциденты_19 КАК Инциденты_19
	|ГДЕ
	|	Инциденты_19.НомерСФ = """"
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Инциденты_19.ЗаказНаряд,
	|	""-"",
	|	Инциденты_19.Инцидент,
	|	""Дата Заказ-наряда установки детали"",
	|	""Не указана дата заказ-наряда по установке гарантийной детали.""
	|ИЗ
	|	Инциденты_19 КАК Инциденты_19
	|ГДЕ
	|	Инциденты_19.ДатаСФ = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Инциденты_19.ЗаказНаряд,
	|	""-"",
	|	Инциденты_19.Инцидент,
	|	""Пробег при установке детали"",
	|	""Не указан Пробег по заказ-наряду установки гарантийной детали.""
	|ИЗ
	|	Инциденты_19 КАК Инциденты_19
	|ГДЕ
	|	Инциденты_19.ПробегПриУстановке = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Инциденты_19"
	;
	Запрос.Текст = ТекстЗапроса;
	
	СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок);
	
КонецПроцедуры // ПроверитьКодРасходов_19(МВТ, ТаблицаОшибок)

////@+ Процедура ПроверитьНоменклатуруИАвтоработыНаСоответствие(МВТ, ТаблицаОшибок)
// Дата создания - 14.06.2012 10:31:45;
// Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Процедура проверяет номенклатуру и автоработы на наличие записей в регистрах 
//  OPERACODE и Tariff_PR. 
//
// Параметры
//  Парам1 МВТ  - Менеджер временных таблиц - Содержит менеджер временных таблиц
//
//  Парам2 ТаблицаОшибок  - Типизированная таблица значений- в этой таблице
//                 собирается список всех выявленных в ходе проверки ошибок заполнения
//@-
Процедура ПроверитьНоменклатуруИАвтоработыНаСоответствие(МВТ, ТаблицаОшибок, ТаблицаОшибокРаботыТовары) 

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ПаттерныНоменклатуры.ИдентификаторИнцидента,
	               |	ПаттерныНоменклатуры.Номенклатура,
	               |	ПаттерныНоменклатуры.Артикул,
	               |	ПаттерныНоменклатуры.DiversCode
	               |ПОМЕСТИТЬ ВремТЗТолькоНоменклатура
	               |ИЗ
	               |	ПаттерныНоменклатуры КАК ПаттерныНоменклатуры
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
	               |		ПО ПаттерныНоменклатуры.Номенклатура = спрНоменклатура.Ссылка
	               |ГДЕ
	               |	ПаттерныНоменклатуры.Удален = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВремТЗТолькоНоменклатура.ИдентификаторИнцидента,
	               |	ВремТЗТолькоНоменклатура.Номенклатура,
	               |	ВремТЗТолькоНоменклатура.Артикул,
	               |	ВЫБОР
	               |		КОГДА TariffPR_НоменклатураСрезПоследних.Реферанс ЕСТЬ NULL 
	               |				И EDR_DiversCode.Ссылка ЕСТЬ NULL 
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Реферанс_НЕ_Renault,
	               |	EDR_DiversCode.Ссылка КАК DiversCode
	               |ПОМЕСТИТЬ ВремТЗНоменклатура
	               |ИЗ
	               |	ВремТЗТолькоНоменклатура КАК ВремТЗТолькоНоменклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_TariffPR_Номенклатура.СрезПоследних(&ТекДата, ) КАК TariffPR_НоменклатураСрезПоследних
	               |		ПО ВремТЗТолькоНоменклатура.Артикул = TariffPR_НоменклатураСрезПоследних.Реферанс
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.EDR_DiversCode КАК EDR_DiversCode
	               |		ПО ВремТЗТолькоНоменклатура.DiversCode = EDR_DiversCode.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВремТЗТолькоНоменклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПаттерныРабот.ИдентификаторИнцидента,
	               |	ПаттерныРабот.Работа,
	               |	ПаттерныРабот.Артикул
	               |ПОМЕСТИТЬ ВремТЗТолькоАвтоработыРаботы
	               |ИЗ
	               |	ПаттерныРабот КАК ПаттерныРабот
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Автоработы КАК Автоработы
	               |		ПО ПаттерныРабот.Работа = Автоработы.Ссылка
	               |ГДЕ
	               |	ПаттерныРабот.Удален = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВремТЗТолькоАвтоработыРаботы.ИдентификаторИнцидента,
	               |	ВремТЗТолькоАвтоработыРаботы.Работа,
	               |	ВремТЗТолькоАвтоработыРаботы.Артикул,
	               |	ВЫБОР
	               |		КОГДА OPERACODE_НормыРаботСрезПоследних.КодПоКаталогу ЕСТЬ NULL 
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Реферанс_НЕ_Renault
	               |ПОМЕСТИТЬ ВремТЗРабота
	               |ИЗ
	               |	ВремТЗТолькоАвтоработыРаботы КАК ВремТЗТолькоАвтоработыРаботы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.OPERACODE_НормыРабот.СрезПоследних(&ТекДата, ) КАК OPERACODE_НормыРаботСрезПоследних
	               |		ПО ВремТЗТолькоАвтоработыРаботы.Артикул = OPERACODE_НормыРаботСрезПоследних.КодПоКаталогу
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВремТЗТолькоАвтоработыРаботы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВремТЗНоменклатура.Номенклатура КАК НоменклатураРабота,
	               |	ВремТЗНоменклатура.Артикул,
	               |	ВремТЗНоменклатура.ИдентификаторИнцидента
	               |ПОМЕСТИТЬ ВремТЗНоменклатураРабота
	               |ИЗ
	               |	ВремТЗНоменклатура КАК ВремТЗНоменклатура
	               |ГДЕ
	               |	ВремТЗНоменклатура.Реферанс_НЕ_Renault = ИСТИНА
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВремТЗРабота.Работа,
	               |	ВремТЗРабота.Артикул,
	               |	ВремТЗРабота.ИдентификаторИнцидента
	               |ИЗ
	               |	ВремТЗРабота КАК ВремТЗРабота
	               |ГДЕ
	               |	ВремТЗРабота.Реферанс_НЕ_Renault = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВремТЗНоменклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВремТЗРабота
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПаттерныИнцидентов.ЗаказНаряд,
	               |	"" - "" КАК Заявка,
	               |	ПаттерныИнцидентов.Инцидент,
	               |	ВЫБОР
	               |		КОГДА ВремТЗНоменклатураРабота.НоменклатураРабота ССЫЛКА Справочник.Автоработы
	               |			ТОГДА ""Работа  - № по каталогу ["" + ВремТЗНоменклатураРабота.Артикул + ""]""
	               |		ИНАЧЕ ""Номенклатура - реферанс ["" + ВремТЗНоменклатураРабота.Артикул + ""]""
	               |	КОНЕЦ КАК Объект,
	               |	ВЫБОР
	               |		КОГДА ВремТЗНоменклатураРабота.НоменклатураРабота ССЫЛКА Справочник.Автоработы
	               |			ТОГДА ""Работа Не акцептована RENAULT. Или не загружена в OPERACODE""
	               |		ИНАЧЕ ""Номенклатура Не акцептована RENAULT. Или не загружена в Tarif PR""
	               |	КОНЕЦ КАК ОписаниеОшибки
	               |ИЗ
	               |	ПаттерныИнцидентов КАК ПаттерныИнцидентов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремТЗНоменклатураРабота КАК ВремТЗНоменклатураРабота
	               |		ПО ПаттерныИнцидентов.ИдентификаторИнцидента = ВремТЗНоменклатураРабота.ИдентификаторИнцидента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВремТЗНоменклатураРабота"
	;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок, ТаблицаОшибокРаботыТовары);
	
КонецПроцедуры // ПроверитьНоменклатуруИАвтоработыНаСоответствие(МВТ, ТаблицаОшибок)

////@+ Процедура ПроверитьПричиныОбращения(МВТ, ТаблицаОшибок)
// Дата создания - 14.06.2012 14:08:26;
// Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Процедура проверяет установку флагов "Причина обращения". Для каждого инцидента должен быть установлен только 
//  один флажок.
//
// Параметры
//  Парам1 МВТ  - Менеджер временных таблиц - Содержит менеджер временных таблиц
//
//  Парам2 ТаблицаОшибок  - Типизированная таблица значений- в этой таблице
//                 собирается список всех выявленных в ходе проверки ошибок заполнения
//@-
Процедура ПроверитьПричиныОбращения(МВТ, ТаблицаОшибок)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ПаттерныНоменклатуры.Номенклатура КАК НоменклатураРабота,
	|	ПаттерныНоменклатуры.ИдентификаторИнцидента
	|ПОМЕСТИТЬ ВремТЗТоварыРаботы
	|ИЗ
	|	ПаттерныНоменклатуры КАК ПаттерныНоменклатуры
	|ГДЕ
	|	ПаттерныНоменклатуры.ПричинаОбращения = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПаттерныРабот.Работа,
	|	ПаттерныРабот.ИдентификаторИнцидента
	|ИЗ
	|	ПаттерныРабот КАК ПаттерныРабот
	|ГДЕ
	|	ПаттерныРабот.ПричинаОбращения = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПаттерныИнцидентов.Инцидент,
	|	ПаттерныИнцидентов.ИдентификаторИнцидента,
	|	ПаттерныИнцидентов.ЗаказНаряд,
	|	КОЛИЧЕСТВО(ВремТЗТоварыРаботы.НоменклатураРабота) КАК НоменклатураРабота
	|ПОМЕСТИТЬ ТЗПосчитаныхПричин
	|ИЗ
	|	ПаттерныИнцидентов КАК ПаттерныИнцидентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремТЗТоварыРаботы КАК ВремТЗТоварыРаботы
	|		ПО ПаттерныИнцидентов.ИдентификаторИнцидента = ВремТЗТоварыРаботы.ИдентификаторИнцидента
	|ГДЕ
	|	ПаттерныИнцидентов.ТребоватьПричину = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ПаттерныИнцидентов.Инцидент,
	|	ПаттерныИнцидентов.ИдентификаторИнцидента,
	|	ПаттерныИнцидентов.ЗаказНаряд
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремТЗТоварыРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗПосчитаныхПричин.ЗаказНаряд,
	|	""-"" КАК Заявка,
	|	ТЗПосчитаныхПричин.Инцидент,
	|	""Причина обращения"" КАК Объект,
	|	ВЫБОР
	|		КОГДА ТЗПосчитаныхПричин.НоменклатураРабота > 1
	|			ТОГДА ""больше""
	|		КОГДА ТЗПосчитаныхПричин.НоменклатураРабота < 1
	|			ТОГДА ""меньше""
	|		ИНАЧЕ ""норма""
	|	КОНЕЦ КАК Отклонение
	|ПОМЕСТИТЬ РасчетПоказателей
	|ИЗ
	|	ТЗПосчитаныхПричин КАК ТЗПосчитаныхПричин
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТЗПосчитаныхПричин
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетПоказателей.ЗаказНаряд,
	|	РасчетПоказателей.Заявка,
	|	РасчетПоказателей.Инцидент,
	|	РасчетПоказателей.Объект,
	|	ВЫБОР
	|		КОГДА РасчетПоказателей.Отклонение = ""меньше""
	|			ТОГДА ""У инцидента не указана причина обращения. Причина обращения обязательна.""
	|		КОГДА РасчетПоказателей.Отклонение = ""больше""
	|			ТОГДА ""У инцидента две или более причин обращения. Возможна только одна причина обращения.""
	|	КОНЕЦ КАК ОписаниеОшибки
	|ИЗ
	|	РасчетПоказателей КАК РасчетПоказателей
	|ГДЕ
	|	РасчетПоказателей.Отклонение <> ""норма""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РасчетПоказателей"
	;
	
	Запрос.Текст = ТекстЗапроса;
	
	СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок);
	
КонецПроцедуры // ПроверитьПричиныОбращения(МВТ, ТаблицаОшибок)

////@+ Процедура СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок)
// Дата создания - 14.06.2012 15:10:20;
// Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Процедура просто получает объект Запрос, выполняет его и перебирает результат
//  предназначена для простого рефакторинга. Очень много однотипного кода в проверках.
//
// Параметры
//  Парам1 Запрос  - Запрос - сконфигурированный объект "Запрос"
//  осталось только его выполнить и перебрать результат
//  Парам2 ТаблицаОшибок  - Типизированная таблица значений- в этой таблице
//                 собирается список всех выявленных в ходе проверки ошибок заполнения
//@-
Процедура СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок, ТаблицаОшибокРаботыТовары = Неопределено)
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НС = ТаблицаОшибок.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Выборка);
		
		Если ТаблицаОшибокРаботыТовары <> Неопределено Тогда
			НС = ТаблицаОшибокРаботыТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Выборка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок)

///////////////////////////////////////////////////////
//			Процедуры только на стороне клиента
	
//Из - за возможности распределения инцидентов по нескольким счетам
//принимаем, что, если параметр в одном из счетов разрешен, а в другом 
//запрещен, значит запрещен для обоих счетов. Кроме полей комментариев и кодов
//
Функция ПолучитьПараметр_Булево_ExpenceCode(ИдентификаторЗаказа = Неопределено, ИдентификаторСчета = Неопределено, ИдентификаторИнцидента = Неопределено, Параметр) Экспорт
	
	Отбор = Новый Структура;
	
	Если ЗначениеЗаполнено(ИдентификаторЗаказа) тогда
		
		Отбор.Вставить("ИдентификаторЗаказа", ИдентификаторЗаказа);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторСчета) тогда
		
		Отбор.Вставить("ИдентификаторСчета", ИдентификаторСчета);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторИнцидента) тогда
		
		Отбор.Вставить("ИдентификаторИнцидента", ИдентификаторИнцидента);
		
	КонецЕсли;
	
	ТекСтроки = ТаблицаПараметровВидовРасходов.НайтиСтроки(Отбор);
	
	Если ЗначениеЗаполнено(ИдентификаторЗаказа) тогда //Для заказа возвращаем истину, если Истина есть хоть в одной строке.
		Если ТекСтроки.Количество() > 1 тогда
			
			Для каждого ТекСтрока из ТекСтроки Цикл
				ТекЗначение = ТекСтрока[Параметр];
				
				//Если значение хоть раз принимает значение Истина
				//Возвращаем Истина
				Если ТекЗначение тогда  
					
					Возврат ТекЗначение;
					
				КонецЕсли;
				
			КонецЦикла;
			
			//Если все еще тут, значит в цикле истину не нашли возвращаем последнее знвачение
			Возврат ТекЗначение;
		
		ИначеЕсли ТекСтроки.Количество() = 0 тогда //Если строки еще нет - возвращаем ложь
			
			Возврат ложь;
			
		Иначе
			
			ТекСтрока = ТекСтроки[0];
			Возврат ТекСтрока[Параметр];
			
		КонецЕсли;
		
	Иначе //Для счета и инцидента наоборот, возвращаем ложь, если ложь есть хоть в одной строке
		
		//Несколько строк может быть только с несколькими счетами
		Если ТекСтроки.Количество() > 1 тогда
			
			Для каждого ТекСтрока из ТекСтроки Цикл
				ТекЗначение = ТекСтрока[Параметр];
				
				//Если значение хоть раз принимает значение ложь
				//Возвращаем ложь
				Если НЕ ТекЗначение тогда  
					
					Возврат ТекЗначение;
					
				КонецЕсли;
				
			КонецЦикла;
			
			//Если все еще тут, значит в цикле ложь не нашли возвращаем последнее знвачение
			Возврат ТекЗначение;
			
		ИначеЕсли ТекСтроки.Количество() = 0 тогда //Если строки еще нет - возвращаем ложь
			
			Возврат ложь;
			
		Иначе
			
			ТекСтрока = ТекСтроки[0];
			Возврат ТекСтрока[Параметр];
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДеревоЗаказНарядовДляОтправки(СписокЗаказов, ЭтаФорма) Экспорт
	Перем ТабТоваров;
	Перем ТабРабот;

	
	ДатаЗакрытияОТ = ПериодВыборки.ДатаНачала;
	ДатаЗакрытияПО = ПериодВыборки.ДатаОкончания;
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Макет = ПолучитьМакет("ГрафическоеПредставление");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	EDR_ЗаказНаряды.ЗаказНаряд КАК Ссылка,
	|	EDR_ЗаказНаряды.ОтправленВСистему_GCM,
	|	EDR_ЗаказНаряды.OTS КАК OTS,
	|	EDR_ЗаказНаряды.Гарантия КАК Гарантия,
	|	EDR_Invoices.Invoice КАК Invoice,
	|	EDR_Invoices.ДатаИнвойса КАК ДатаИнвойса,
	|	EDR_Invoices.Категория КАК Категория,
	|	EDR_Interventions.Intervention КАК Intervention,
	|	EDR_СоответствияИнвойсов.Процент КАК Процент,
	|	EDR_Interventions.RC_code КАК RC_code,
	|	EDR_Interventions.Function_Code КАК Function_Code,
	|	EDR_Invoices.Expense_code КАК Expense_code,
	|	EDR_Interventions.OTS_number КАК OTS_number,
	|	EDR_Invoices.GUID КАК GUID_Инвойса,
	|	EDR_Interventions.GUID КАК GUID_События,
	|	EDR_ЗаказНаряды.ДатаОткрытия КАК ДатаОткрытия,
	|	EDR_ЗаказНаряды.ДатаЗакрытия КАК ДатаЗакрытия,
	|	EDR_ЗаказНаряды.РангАвторабот КАК РангАвторабот,
	|	EDR_ЗаказНаряды.ПробегАвтомобиля КАК ПробегАвтомобиля,
	|	EDR_Interventions.ОписаниеОперации,
	|	EDR_Interventions.ОписаниеЖалобы,
	|	EDR_Interventions.КомментарийОперации,
	|	EDR_Interventions.РезультатДиагностики
	|ИЗ
	|	РегистрСведений.EDR_ЗаказНаряды КАК EDR_ЗаказНаряды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.EDR_Invoices КАК EDR_Invoices
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.EDR_СоответствияИнвойсов КАК EDR_СоответствияИнвойсов
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.EDR_Interventions КАК EDR_Interventions
	|				ПО EDR_СоответствияИнвойсов.Intervention = EDR_Interventions.GUID
	|			ПО EDR_Invoices.ЗаказНаряд = EDR_СоответствияИнвойсов.ЗаказНаряд
	|				И EDR_Invoices.GUID = EDR_СоответствияИнвойсов.Invoice
	|		ПО EDR_ЗаказНаряды.ЗаказНаряд = EDR_Invoices.ЗаказНаряд
	|ГДЕ
	|	EDR_ЗаказНаряды.ЗаказНаряд.Организация = &Организация
	|	И EDR_ЗаказНаряды.ДатаЗакрытия МЕЖДУ &ДатаЗакрытияОТ И &ДатаЗакрытияПО
	|	И EDR_ЗаказНаряды.ЗаказНаряд В(&СписокЗаказов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Invoice,
	|	Intervention
	|ИТОГИ
	|	МАКСИМУМ(OTS),
	|	МАКСИМУМ(Гарантия),
	|	МАКСИМУМ(ДатаИнвойса),
	|	МАКСИМУМ(Категория),
	|	СУММА(Процент),
	|	МАКСИМУМ(RC_code),
	|	МАКСИМУМ(Function_Code),
	|	МАКСИМУМ(Expense_code),
	|	МАКСИМУМ(OTS_number),
	|	МАКСИМУМ(GUID_Инвойса),
	|	МАКСИМУМ(GUID_События),
	|	МАКСИМУМ(ДатаОткрытия),
	|	МАКСИМУМ(ДатаЗакрытия),
	|	МАКСИМУМ(РангАвторабот),
	|	МАКСИМУМ(ПробегАвтомобиля)
	|ПО
	|	Ссылка,
	|	Invoice";

	Запрос.УстановитьПараметр("ДатаЗакрытияОТ", ДатаЗакрытияОТ);
	Запрос.УстановитьПараметр("ДатаЗакрытияПО", ДатаЗакрытияПО);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СписокЗаказов", СписокЗаказов);

	Результат = Запрос.Выполнить();

	ОбластьШапка	   = Макет.ПолучитьОбласть("ШапкаОтчета");
	ОбластьЗаказов	   = Макет.ПолучитьОбласть("СтрокаЗаказНаряд");
	ОбластьСчетов	   = Макет.ПолучитьОбласть("СтрокаИнвойс");
	ОбластьИнцидентов  = Макет.ПолучитьОбласть("СтрокаИнцидент");
	ОбластьОписание    = Макет.ПолучитьОбласть("СтрокаОписаниеОперации");
	ОбластьКомментарий = Макет.ПолучитьОбласть("СтрокаКомментарий");
	ОбластьЖалоба	   = Макет.ПолучитьОбласть("СтрокаЖалоба");
	ОбластьДиагностика = Макет.ПолучитьОбласть("СтрокаДиагностика");
	ОбластьРабот = Макет.ПолучитьОбласть("СтрокаРабота");
	ОбластьДеталей = Макет.ПолучитьОбласть("СтрокаДеталь");

	ТекКлюч = Строка(Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy"));
	ПечатнаяФормаДокументов = ПолучитьОбщуюФорму("ПечатнаяФормаДокументов",ЭтаФорма,ТекКлюч);
	
	ТабДок = ПечатнаяФормаДокументов.ЭлементыФормы.ТабличныйДокумент;
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьШапка);
	ТабДок.НачатьАвтогруппировкуСтрок();

	ВыборкаЗН = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаЗН.Следующий() Цикл
		
		ЗН = Строка(ВыборкаЗН.Ссылка) + ". модель: " + ВыборкаЗН.Ссылка.Автомобиль.Модель + ", VIN: " + ВыборкаЗН.Ссылка.Автомобиль.VIN;
		ОбластьЗаказов.Параметры.СтрокаЗаказНаряд = ЗН;
		ОбластьЗаказов.Параметры.ЗаказНаряд = ВыборкаЗН.Ссылка;
		
		ТабДок.Вывести(ОбластьЗаказов, ВыборкаЗН.Уровень());

		ВыборкаСчет = ВыборкаЗН.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Пока ВыборкаСчет.Следующий() Цикл
			Счет = "Счет № " + ВыборкаСчет.Invoice + " от "+Формат(ВыборкаСчет.ДатаИнвойса, "ДФ=dd.MM.yyyy") + ". Категория: " + ВыборкаСчет.Категория;
			ОбластьСчетов.Параметры.Инвойс = Счет;
			ТабДок.Вывести(ОбластьСчетов, ВыборкаСчет.Уровень());

			//Нужно получить работы
			ТабРабот = ПолучитьСписокРаботПоИнвойсу(ВыборкаСчет);
			
			//Нужно получить детали
			ТабТоваров = ПолучитьСписокТоваровПоИнвойсу(ВыборкаСчет);
			
			ВыборкаСобытия = ВыборкаСчет.Выбрать();

			Пока ВыборкаСобытия.Следующий() Цикл
				Инцидент = "Инцидент """ + ВыборкаСобытия.Intervention + """. Вид расходов: " + ?(ЗначениеЗаполнено(ВыборкаСобытия.Expense_code),ВыборкаСобытия.Expense_code, "0")
						+ " Функ. код: " + ВыборкаСобытия.Function_Code + " Процент: " + ВыборкаСобытия.Процент;
				ОбластьИнцидентов.Параметры.Инцидент = Инцидент;
				ТабДок.Вывести(ОбластьИнцидентов, ВыборкаСобытия.Уровень());
				
				//Описание операции
				//количество строк не ограниченно,
				Если ЗначениеЗаполнено(ВыборкаСобытия.ОписаниеОперации) тогда
					ТекстОписания = Строка(ВыборкаСобытия.ОписаниеОперации); // через преобразование в строку - для отвязки от Дерева Значений.
					ТекстОписания = СтрЗаменить(ТекстОписания, Символы.ПС, " ");
					ФорматированноеОписание = EDR_ОбщийМодуль.СформироватьТекстКомментария(ТекстОписания, 200);
					
					КоличествоСтрок = ФорматированноеОписание.КоличествоСтрок();
					Для Сч = 1 по КоличествоСтрок Цикл
						ТекОписание = ФорматированноеОписание.ПолучитьСтроку(Сч);
						Если НЕ ЗначениеЗаполнено(ТекОписание) тогда Продолжить; КонецЕсли;
						Описание = "Описание (" + Сч +"):";
						ОбластьОписание.Параметры.Описание = Описание;
						 ОбластьОписание.Параметры.ТекстОписания = ТекОписание;
						ТабДок.Вывести(ОбластьОписание, ВыборкаСобытия.Уровень()+2);
					КонецЦикла;
				КонецЕсли;
				
				//Комментарии к операции
				//количество строк не ограниченно,
				Если ЗначениеЗаполнено(ВыборкаСобытия.КомментарийОперации) тогда
					ТекстКомментария = Строка(ВыборкаСобытия.КомментарийОперации); // через преобразование в строку - для отвязки от Дерева Значений.
					ТекстКомментария = СтрЗаменить(ТекстКомментария, Символы.ПС, " ");
					ФорматированныйКомментарий = EDR_ОбщийМодуль.СформироватьТекстКомментария(ТекстКомментария, 120);
					
					КоличествоСтрок = ФорматированныйКомментарий.КоличествоСтрок();
					Для Сч = 1 по КоличествоСтрок Цикл
						ТекКомм = ФорматированныйКомментарий.ПолучитьСтроку(Сч);
						Если НЕ ЗначениеЗаполнено(ТекКомм) тогда Продолжить; КонецЕсли;
						Комментарий = "Комментарий (" + Сч + "):";
						ОбластьКомментарий.Параметры.Комментарий = Комментарий;
						ОбластьКомментарий.Параметры.ТекстКомментария = ТекКомм;
						ТабДок.Вывести(ОбластьКомментарий, ВыборкаСобытия.Уровень()+2);
					КонецЦикла;
				КонецЕсли;
				
				////Теперь формируем строку 030 Жалоба клиента. она только одна, длина 80 символов
				Если ЗначениеЗаполнено(ВыборкаСобытия.ОписаниеЖалобы) тогда
					ОбластьЖалоба.Параметры.ТекстЖалобы = ВыборкаСобытия.ОписаниеЖалобы;
					ТабДок.Вывести(ОбластьЖалоба, ВыборкаСобытия.Уровень()+2);
				КонецЕсли;
				
				//Теперь Результат диагностики строка 040
				Если ЗначениеЗаполнено(ВыборкаСобытия.РезультатДиагностики) тогда
					ОбластьДиагностика.Параметры.ТекстДиагностики = ВыборкаСобытия.РезультатДиагностики;
					ТабДок.Вывести(ОбластьДиагностика, ВыборкаСобытия.Уровень()+2);
				КонецЕсли;
				
				//Подготовка таблиц с товарами и работами
				Отбор = Новый Структура("GUID_События",ВыборкаСобытия.GUID_События);
				РаботыСобытия = ТабРабот.Скопировать(Отбор);
				ТоварыСобытия = ТабТоваров.Скопировать(Отбор);
				
				Для каждого стрРабота из РаботыСобытия Цикл
					Работа = "Работа: " + стрРабота.Работа+" код: " + стрРабота.Код;
					
					ОбластьРабот.Параметры.Работа = Работа;
					ОбластьРабот.Параметры.РабСсылка = стрРабота.Работа;
					
					ТабДок.Вывести(ОбластьРабот, ВыборкаСобытия.Уровень()+1);
				КонецЦикла;
				
				Для каждого стрДеталь из ТоварыСобытия Цикл
					Деталь = "Деталь: " + стрДеталь.Номенклатура+" код: " + стрДеталь.Код;
					
					ОбластьДеталей.Параметры.Деталь = Деталь;
					ОбластьДеталей.Параметры.ДетСсылка = стрДеталь.Номенклатура;
					
					ТабДок.Вывести(ОбластьДеталей, ВыборкаСобытия.Уровень()+1);
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку = Ложь;
	
	ПечатнаяФормаДокументов.ОбъектПредставление = "Структура распределения счетов и инцидентов по Заказ-Нарядам";
	ПечатнаяФормаДокументов.Открыть();
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецФункции

////@+ Процедура ВывестиОшибки()
//Дата создания - 11.04.2012 11:57:43; Автор - Окипний Андрей Евгеньевич
// 
//
// Описание процедуры
//  Процедура передает таблицу ошибок в построитель отчета
//  и визуализирует её
//
// Параметры
//
// Без параметров
//@-
Процедура ВывестиОшибки() Экспорт

	Построитель = Новый ПостроительОтчета;
	
	//Устанавливаем источник данных
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаОшибок);
	
	//Заполняем настройки по умолчанию
	Построитель.ЗаполнитьНастройки();
	
	//Устанавливаем расшифровки
	Построитель.ЗаполнениеРасшифровки = ВидЗаполненияРасшифровкиПостроителяОтчета.ЗначенияГруппировок;
	
	//Устанавливаем заголовок
	Построитель.ТекстЗаголовка = "Выявленные ошибки";
	
	//Добавляем представление колонок
	Построитель.ВыбранныеПоля[0].Представление = "Заказ наряд";
	Построитель.ВыбранныеПоля[4].Представление = "Описание ошибки";
	
	//Выполняем отбор
	Построитель.Выполнить();
	
	
	//Устанавливаем оформление по умолчанию
	Renault_Открытый.УстановитьМакетПостроителя(Построитель);
	
	//Получаем форму для ошибок
	ФормаОтчета = ПолучитьФорму("Отчет");
	Построитель.Вывести(ФормаОтчета.ЭлементыФормы.ПолеТабличногоДокумента);
	
	ФормаОтчета.Открыть();
	
КонецПроцедуры // ВывестиОшибки()

////@+ Процедура ОтрытьФормуДляВыбораПравильнойПричины(НайденныеСтрокиПричин)
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Процедура ТипПроцедуры="Экспорт"
//           ИнструкцииПрепроцессору=""
//           ДатаCоздания="14.03.2013 10:42:09" Автор="Окипний Андрей Евгеньевич">
// <Имя>ОтрытьФормуДляВыбораПравильнойПричины(НайденныеСтрокиПричин)</Имя>
//
// <Описание>
//  <!-- Вставить описание -->
// </Описание>
//
// <Параметры>
//  <Параметр>
//  <ИмяПараметра>НайденныеСтрокиПричин</ИмяПараметра>
//  	<ТипПараметра><!-- Укажите тип параметра --></ТипПараметра>
//  	<ОписаниеПараметра><!-- описание параметра -->
//                 <!-- продолжение описания параметра --></ОписаниеПараметра>
//  </Параметр>
// </Параметры>
//</Процедура>
//</Автодок>
//</xml>
//@-
Процедура ОтрытьФормуДляВыбораПравильнойПричины(НайденныеСтрокиПричин) Экспорт
	
	ФормаВыбораПричины = ПолучитьФорму("ФормаВыбораПричиннойДетали");
	ФормаВыбораПричины.НайденныеПричины = НайденныеСтрокиПричин;
	ФормаВыбораПричины.ОткрытьМодально();
	
КонецПроцедуры // ОтрытьФормуДляВыбораПравильнойПричины(НайденныеСтрокиПричин)

Процедура ПроверитьПробег(МВТ, ТаблицаОшибок) 

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПаттерныЗН.ПробегАвтомобиля КАК ПробегАвтомобиля,
	|	ПаттерныЗН.ЗаказНаряд
	|ПОМЕСТИТЬ ОшибкиПробег
	|ИЗ
	|	ПаттерныЗН КАК ПаттерныЗН
	|ГДЕ
	|	ПаттерныЗН.ПробегАвтомобиля = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОшибкиПробег.ЗаказНаряд КАК ЗаказНаряд,
	|	""-"" КАК Заявка,
	|	""-"" КАК Инцидент,
	|	""Пробег автомобиля "" КАК Объект,
	|	""Не заполнено обязательное поле """"Пробег автомобиля"""""" КАК ОписаниеОшибки
	|ИЗ
	|	ОшибкиПробег КАК ОшибкиПробег
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОшибкиПробег"
	;
	Запрос.Текст = ТекстЗапроса;
	
	СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок);
	
КонецПроцедуры // ПроверитьВалюты(МВТ, ТаблицаОшибок)

ОписаниеТипаКатегорий = Справочники.EDR_КатегорииСчетов.ПолучитьОписаниеТипов();
ОписаниеТипаРасходов = Справочники.EDR_ВидыРасходов.ПолучитьОписаниеТипов();

//Инициализация модуля АРМ
ТаблицаСоответствийКатегорий = Новый ТаблицаЗначений;
ТаблицаСоответствийКатегорий.Колонки.Добавить("Категория", ОписаниеТипаКатегорий );
ТаблицаСоответствийКатегорий.Колонки.Добавить("Наименование", ОписаниеТипаКатегорий);
ТаблицаСоответствийКатегорий.Колонки.Добавить("ExpenceCode", ОписаниеТипаРасходов);

//Заполняем таблицу соответствий категорий статьям расходов
Справочники.EDR_КатегорииСчетов.ЗаполнитьТаблицуПоказателей(ТаблицаСоответствийКатегорий);

ПаттернЛитераловНомеров = "ABCDEFGHIJKLMNOPQRSTUVWXYZ";

АвтодокВерсия = "01_00_12";