&НаКлиенте
Перем РезультатПолученияДопИнформации;
&НаКлиенте
Перем ФормаДлительнойОперации;
&НаКлиенте
Перем ПараметрыОбработчика;

&НаКлиенте
Процедура АвтомобильПриИзменении(Элемент)
	
	ЗаполнитьДанныеПоАвтомобилюНаСервере();
	ЗаполнитьВидыОперацийМесяцы();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоАвтомобилюНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Автомобиль) Тогда
		ЭтаФорма.Объект.VIN = ЭтаФорма.Объект.Автомобиль.VIN;
		ЭтаФорма.Объект.Цвет = ЭтаФорма.Объект.Автомобиль.Цвет;
		ЭтаФорма.Объект.Версия = ЭтаФорма.Объект.Автомобиль.ВариантКомплектации;
		ЭтаФорма.Объект.Модель = ЭтаФорма.Объект.Автомобиль.Модель;
		
		Запись=РегистрыСведений.CRM_СостояниеАвтомобилейПроизводителя_v2.СоздатьМенеджерЗаписи();
		Запись.VIN=Объект.Автомобиль.VIN;
		Запись.Прочитать();
		Объект.КодМагнитолы=Запись.CODE_RADIO;
	КонецЕсли;
	
	ОбновитьMADC(Объект.VIN, ДатаMADC);
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьНесоответствияНаСхеме(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	КлиентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КлиентПриИзмененииНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.Клиент) Тогда
		Возврат;	
	КонецЕсли;
		
	Если Объект.Клиент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
		Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		Запись.Вид = Справочники.ВидыКонтактнойИнформации.АдресФактический;
		Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		Запись.Объект = Объект.Клиент;
		Запись.Прочитать();
		Объект.АдресКлиента = Запись.Представление;
		
		Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		Запись.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый;
		Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
 		Запись.Объект = Объект.Клиент;
		Запись.Прочитать();
		Объект.ТелефонКлиента = Запись.Представление;
	ИначеЕсли Объект.Клиент.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда
		Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		Запись.Вид = Справочники.ВидыКонтактнойИнформации.АдресЮридический;
		Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		Запись.Объект = Объект.Клиент;
		Запись.Прочитать();
		Объект.АдресКлиента  = Запись.Представление;
			
		Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		Запись.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонРабочий;
		Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		Запись.Объект = Объект.Клиент;
		Запись.Прочитать();
		Объект.ТелефонКлиента = Запись.Представление;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ДефектыКузоваНажатие(Элемент)

	Форма = ПолучитьФорму("Документ.DMS_КартаКачестваПоставки.Форма.ФормаСхемыНесоответствийКузова"); 
	Форма.Объект = ЭтаФорма.Объект.Ссылка;
	Рез = Форма.ОткрытьМодально();
	Если Рез <> Неопределено Тогда
		ЭтаФорма.Объект.ДефектыКузова.Очистить();
		Для Каждого Стр из Рез Цикл
			ЗаполнитьЗначенияСвойств(ЭтаФорма.Объект.ДефектыКузова.Добавить(),Стр);
		КонецЦикла;
		Записать();
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ДефектыСалонаНажатие(Элемент)

	Форма = ПолучитьФорму("Документ.DMS_КартаКачестваПоставки.Форма.ФормаСхемыНесоответствийСалона"); 
	Форма.Объект = ЭтаФорма.Объект.Ссылка;
	Рез = Форма.ОткрытьМодально();
	Если Рез <> Неопределено Тогда
		ЭтаФорма.Объект.ДефектыСалона.Очистить();
		Для Каждого Стр из Рез Цикл
	    	ЗаполнитьЗначенияСвойств(ЭтаФорма.Объект.ДефектыСалона.Добавить(),Стр);
		КонецЦикла;
		Записать();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Документ не записан");
		Возврат;
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;
	Документы.DMS_КартаКачестваПоставки.Печать(ТабДок, Объект.Ссылка); 
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	
	//КлючУникальности = Новый УникальныйИдентификатор();
    ФормаПечати = ПолучитьОбщуюФорму("ПечатнаяФормаДокументов",,Новый УникальныйИдентификатор());
    ТабличныйДокумент = ФормаПечати.ЭлементыФормы.ТабличныйДокумент;
    ТабличныйДокумент.ИмяПараметровПечати = "ПечатьККП";
    ТабличныйДокумент.Вывести(ТабДок);
    ЗаполнитьЗначенияСвойств(ТабличныйДокумент,ТабДок,"ПолеСверху,ПолеСнизу,ПолеСлева,ПолеСправа,Автомасштаб,ОриентацияСтраницы");
	
	ФормаПечати.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
    ФормаПечати.Объект = Объект.Ссылка;
    ФормаПечати.ОбъектПредставление = Строка(Объект.Ссылка);
    ФормаПечати.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Если Параметры.Свойство("Автомобиль") Тогда  //Создание из 
			Объект.Автомобиль					= Параметры.Автомобиль;
			Объект.КоммерческийАдминистратор 	= ПараметрыСеанса.Пользователь.Сотрудник;
			МенеджерВДоговоре 					= ПолучитьМенеджераИЗДоговора(Параметры.Автомобиль);
			Объект.Менеджер 					= ?(ЗначениеЗаполнено(МенеджерВДоговоре), МенеджерВДоговоре, ПараметрыСеанса.Пользователь.Сотрудник);
			Объект.Автосалон 					= Renault_CRM.ПолучитьДилерскийЦентрПользователя(Объект.Менеджер);
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Renault_ДоговорСоставДоговора.Ссылка
			|ИЗ
			|	Документ.Renault_Договор.СоставДоговора КАК Renault_ДоговорСоставДоговора
			|ГДЕ
			|	Renault_ДоговорСоставДоговора.Автомобиль = &Автомобиль
			|
			|УПОРЯДОЧИТЬ ПО
			|	Renault_ДоговорСоставДоговора.Ссылка.Дата УБЫВ";
			
			Запрос.УстановитьПараметр("Автомобиль", Объект.Автомобиль);
			ВыборкаДоговоры = Запрос.Выполнить().Выбрать();
			Если ВыборкаДоговоры.Следующий() Тогда
				ДоговорКП = ВыборкаДоговоры.Ссылка;
				Объект.ДоговорКП = ДоговорКП;
				Объект.РабочийЛист= ДоговорКП.РабочийЛист;
				Объект.Клиент 	= ДоговорКП.КлиентДоговора;
			КонецЕсли;;
		КонецЕсли;	
		
		Если Параметры.Свойство("ЗаписьНаВыдачу") Тогда
			Объект.Автосалон 					= Параметры.ЗаписьНаВыдачу.ДилерскийЦентр;	
			Объект.Клиент 						= Параметры.ЗаписьНаВыдачу.Клиент;
			Объект.ДоговорКП 					= Параметры.ЗаписьНаВыдачу.ДоговорНаПродажуАвтомобиля;
			Объект.РабочийЛист 					= Параметры.ЗаписьНаВыдачу.IDK;
			
			СтрСостава = Параметры.ЗаписьНаВыдачу.ДоговорНаПродажуАвтомобиля.СоставДоговора.Найти(Параметры.Автомобиль,"Автомобиль");
			Если СтрСостава <> Неопределено Тогда
				ДопОпции = Параметры.ЗаписьНаВыдачу.ДоговорНаПродажуАвтомобиля.ДопОпцииАвтомобилей.НайтиСтроки(Новый Структура("Идентификатор",СтрСостава.Идентификатор));	
				Для каждого Стр из ДопОпции Цикл
					ЗаполнитьЗначенияСвойств(Объект.Опции.Добавить(),Стр);
				КонецЦикла;                                               				
			КонецЕсли;
		КонецЕсли;
		
		Если Параметры.Свойство("ТаблицаОпций") И Объект.Опции.Количество() = 0 Тогда		
			Для каждого Стр из Параметры.ТаблицаОпций Цикл
				НовСтр = Объект.Опции.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр,Стр);
				НовСтр.Цена = Стр.Сумма;
			КонецЦикла; 
		КонецЕсли;

		Если Параметры.Свойство("ТаблицаОпцийДилера") И Объект.Аксессуары.Количество() = 0 Тогда		
			Для каждого Стр из Параметры.ТаблицаОпцийДилера Цикл
				НовАкс = Объект.Аксессуары.Добавить();
				НовАкс.Номенклатура = Стр.Опция;
				НовАкс.Количество = Стр.Количество;
				НовАкс.Цена = Окр(Стр.Сумма/Стр.Количество,2);	
				НовАкс.Сумма = Стр.Сумма;
			КонецЦикла; 
		КонецЕсли;

		Если Параметры.Свойство("Договор") Тогда
			Объект.Автосалон 					= Параметры.Договор.ДилерскийЦентр;	
			Объект.Клиент 						= Параметры.Договор.КлиентДоговора;
			Объект.ДоговорКП 					= Параметры.Договор;
			Объект.РабочийЛист 					= Параметры.Договор.РабочийЛист;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.СтатусPVR) Тогда
			Объект.СтатусPVR = Перечисления.Renault_СтатусыPVR.Создан;
			Объект.ДатаСтатуса = ТекущаяДата();
		КонецЕсли;
	Иначе
		Если Параметры.Свойство("ТекущаяСтраница") Тогда		
			Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницыФормы.ПодчиненныеЭлементы[Параметры.ТекущаяСтраница];
		КонецЕсли;		
	КонецЕсли;
	Если Параметры.Свойство("Поступление") Тогда
		Поступление = Параметры.Поступление;
	КонецЕсли;
	Если Объект.СтатусPVR = Перечисления.Renault_СтатусыPVR.ОжидаетПроверки Тогда
		Элементы.ПриемкаАвтомобиля.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ЗаполнитьТаблицуДолгосрочногоХранения();
	ЗаполнитьВидыОперацийМесяцы();
	ОбновитьMADC(Объект.VIN, ДатаMADC);
	
	ЗаполнитьПричиныНеВыдачи ();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПричиныНеВыдачи ()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ПричиныНеВыдачи.Ссылка
	|ИЗ
	|	Справочник.Renault_ПричиныНеВыдачи КАК Renault_ПричиныНеВыдачи
	|ГДЕ
	|	Renault_ПричиныНеВыдачи.Активный = ИСТИНА";
	Выборка = Запрос.Выполнить().Выбрать();
	Элементы.ОтказВвыдаче.СписокВыбора.Очистить();

	Пока Выборка.Следующий() Цикл
		Элементы.ОтказВвыдаче.СписокВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КлиентПриИзменении(Неопределено);
	АвтомобильПриИзменении(Неопределено);
	Если не Объект.СостАвтоСоотвТребКачестваПримеки Тогда
		Элементы.ГруппаPVR.Доступность = Истина;
		//Элементы.ГруппаPVR.Поведение = ПоведениеОбычнойГруппы.Обычное;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ТранспортнаяКомпания) Тогда
		Элементы.ГруппаПеревозчики.ТекущаяСтраница = Элементы.ГруппаВводаПеревозчика;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	СохранитьТаблицуДолгосрочногоХранения(ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРабочийЛист(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.РабочийЛист) Тогда
		Сообщить("ККП не привязан к рабочему листу!");
		ВвестиЧисло(Объект.РабочийЛист,"Введите номер рабочего листа",15,0);
		Если НЕ ЗначениеЗаполнено(Объект.РабочийЛист) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	РабочийЛист = Объект.РабочийЛист;
	СтруктураОтбора = ПолучитьСтруктураОтбораРабочегоЛиста(РабочийЛист);
	// Сергеев В.Н. DMSREN-868
	КлючЛиста = ПолучитьКлючРабочегоЛиста(РабочийЛист);
	Если КлючЛиста = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", КлючЛиста);
	ОткрытьФорму("Документ.Renault_РабочийЛист.Форма.ФормаДокумента", ПараметрыФормы);
	//КлючЛиста = РегистрыСведений.Renault_РабочиеЛисты.СоздатьКлючЗаписи(СтруктураОтбора);
	//Если КлючЛиста = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("Ключ", КлючЛиста);
	//ОткрытьФорму("РегистрСведений.Renault_РабочиеЛисты.Форма.ФормаЗаписи", ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктураОтбораРабочегоЛиста(Ид)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_РабочиеЛисты.ID,
		|	Renault_РабочиеЛисты.IDK,
		|	Renault_РабочиеЛисты.Отдел,
		|	Renault_РабочиеЛисты.Подразделение,
		|	Renault_РабочиеЛисты.ДилерскийЦентр
		|ИЗ
		|	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
		|ГДЕ
		|	Renault_РабочиеЛисты.IDK = &IDK";
	Запрос.УстановитьПараметр("IDK", Ид);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ID", Выборка.ID);
	СтруктураОтбора.Вставить("IDK", Выборка.IDK);
	СтруктураОтбора.Вставить("Отдел", Выборка.Отдел);
	СтруктураОтбора.Вставить("Подразделение", Выборка.Подразделение);
	СтруктураОтбора.Вставить("ДилерскийЦентр", Выборка.ДилерскийЦентр);
	
	Возврат СтруктураОтбора;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьДоговорКП(Команда)
	
	ОткрытьЗначение(Объект.ДоговорКП);
	
КонецПроцедуры

&НаКлиенте
Процедура СостАвтоСоотвТребКачестваПримекиПриИзменении(Элемент)
	Если не Объект.СостАвтоСоотвТребКачестваПримеки Тогда
		Элементы.ГруппаPVR.Доступность = Истина;
	КонецЕсли;
	
	ОбновитьСтрокуХранения("Приемка");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСмету(Команда)
	Форма = ПолучитьФорму("Документ.DMS_КартаКачестваПоставки.Форма.ФормаСмета");
	ДанныеФормы = Форма.Объект;
	КопироватьДанныеФормы(Объект, ДанныеФормы);
	если Элементы.ПриемкаАвтомобиля.ТолькоПросмотр Тогда
		Форма.Доступность = ложь;
	КонецЕсли;
	Ответ = Форма.ОткрытьМодально();
	Если Ответ <> Неопределено Тогда
		КопироватьДанныеФормы(Ответ, Объект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Повреждения(Команда)
	Форма = ПолучитьФорму("Документ.DMS_КартаКачестваПоставки.Форма.ФормаПовреждения");
	ДанныеФормы = Форма.Объект;
	КопироватьДанныеФормы(Объект, ДанныеФормы);
	если Элементы.ПриемкаАвтомобиля.ТолькоПросмотр Тогда
		Форма.Доступность = ложь;
	КонецЕсли;
	Ответ = Форма.ОткрытьМодально();
	Если Ответ <> Неопределено Тогда
		КопироватьДанныеФормы(Ответ, Объект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайлы(Команда)
	Если Объект.Ссылка.Пустая() тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "Для продолжения ввода необходимо записать документ, 
		|Записать?";
		Ответ = Вопрос(Текст, Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			ЭтаФорма.Записать();
		КонецЕсли;
	КонецЕсли;
	
	отбор = Новый Структура();
	отбор.Вставить("Объект", Объект.Ссылка);
	//Отбор.Вставить("Идентификатор", "");
	ФормаКартинок=РегистрыСведений.Renault_КартинкиИФайлы.ПолучитьФормуСписка(,ЭтаФорма);
	если Элементы.ПриемкаАвтомобиля.ТолькоПросмотр Тогда
		ФормаКартинок.ТолькоПросмотр = истина;
	КонецЕсли;
	ФормаКартинок.ПараметрОтборПоИзмерению=Отбор;
	ФормаКартинок.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСмета(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) или Модифицированность Тогда
		Если Вопрос("Документ не записан. Выполнить запись?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Записать();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСнизу = 5;
	ТабДок.ПолеСлева = 5;
	ТабДок.ПолеСправа = 5;

	ТабДок.АвтоМасштаб = Истина;
	Документы.DMS_КартаКачестваПоставки.ПечатьСмета(ТабДок, Объект.Ссылка); 
	Форм = ПолучитьОбщуюФорму("ПечатнаяФормаДокументов");
	Форм.ЭлементыФормы.ТабличныйДокумент.Очистить();
	Форм.ЭлементыФормы.ТабличныйДокумент.Вывести(ТабДок);
	Форм.ЭлементыФормы.ТабличныйДокумент.Автомасштаб = Истина;
	Форм.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьРекламационныйАкт(Команда)
	Если НЕ ЗначениеЗаполнено(Поступление) Тогда
		Сообщить("Документ поступление автомобилей не найден");
	КонецЕсли;  
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) или Модифицированность Тогда
		Если Вопрос("Документ не записан. Выполнить запись?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Записать();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСнизу = 5;
	ТабДок.ПолеСлева = 5;
	ТабДок.ПолеСправа = 5;
	ТабДок.АвтоМасштаб = Истина;
	Документы.DMS_КартаКачестваПоставки.ПечатьРекАкт(ТабДок, Поступление); 
	Форм = ПолучитьОбщуюФорму("ПечатнаяФормаДокументов");
	Форм.ЭлементыФормы.ТабличныйДокумент.Очистить();
	Форм.ЭлементыФормы.ТабличныйДокумент.Вывести(ТабДок);
	Форм.ЭлементыФормы.ТабличныйДокумент.Автомасштаб = Истина;
	Форм.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьТорг2(Команда)
	Если НЕ ЗначениеЗаполнено(Поступление) Тогда
		Сообщить("Документ поступление автомобилей не найден");
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) или Модифицированность Тогда
		Если Вопрос("Документ не записан. Выполнить запись?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Записать();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСнизу = 5;
	ТабДок.ПолеСлева = 5;
	ТабДок.ПолеСправа = 5;

	ТабДок.АвтоМасштаб = Истина;
	Документы.DMS_КартаКачестваПоставки.ПечатьТорг2(ТабДок, Поступление); 
	Форм = ПолучитьОбщуюФорму("ПечатнаяФормаДокументов");
	Форм.ЭлементыФормы.ТабличныйДокумент.Очистить();
	Форм.ЭлементыФормы.ТабличныйДокумент.Вывести(ТабДок);
	Форм.ЭлементыФормы.ТабличныйДокумент.Автомасштаб = Истина;
	Форм.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыPVRОтправленыПриИзменении(Элемент)
	ДокументыPVRОтправленыПриИзмененииНаСервере(); 
КонецПроцедуры

&НаСервере
Процедура ДокументыPVRОтправленыПриИзмененииНаСервере ()
	
	Если Объект.ДокументыPVRОтправлены Тогда
		Объект.СтатусPVR = Перечисления.Renault_СтатусыPVR.ОжидаетПроверки;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ИсторияСтатусовPVRСрезПоследних.Статус
		|ИЗ
		|	РегистрСведений.Renault_ИсторияСтатусовPVR.СрезПоследних КАК Renault_ИсторияСтатусовPVRСрезПоследних
		|ГДЕ
		|	Renault_ИсторияСтатусовPVRСрезПоследних.Объект = &Объект";
		Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
		Результат = Запрос.Выполнить();
		Если не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			Объект.СтатусPVR = Выборка.Статус;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПротоколОсмотра(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) или Модифицированность Тогда
		Если Вопрос("Документ не записан. Выполнить запись?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Записать();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСнизу = 5;
	ТабДок.ПолеСлева = 5;
	ТабДок.ПолеСправа = 5;
	
	ТабДок.АвтоМасштаб = Истина;
	Документы.DMS_КартаКачестваПоставки.ПечатьПротоколОсмотра (ТабДок, Объект.Ссылка); 
	Форм = ПолучитьОбщуюФорму("ПечатнаяФормаДокументов");
	Форм.ЭлементыФормы.ТабличныйДокумент.Очистить();
	Форм.ЭлементыФормы.ТабличныйДокумент.Вывести(ТабДок);
	Форм.ЭлементыФормы.ТабличныйДокумент.Автомасштаб = Истина;
	Форм.Открыть();
КонецПроцедуры

&НаСервере
Процедура СформироватьНомерНаСервере()
	
	BIR = Объект.Автосалон.BIR;
	если СтрДлина(BIR) = 12 Тогда
		BIR_ID = Прав(Лев(BIR,8),4)+"-"+Прав(BIR,1);
	Иначе
		BIR_ID = Прав(Лев(BIR,8),4)+"-1";
	КонецЕсли;

	Объект.НомерPVR = BIR_ID +"-"+ СтрЗаменить(Объект.Номер,"0","");
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНомер(Команда)
	Если Не ЗначениеЗаполнено(Объект.Автосалон) Тогда
		Сообщить("Не заполнен автосалон, формирование номера не возможно");
		Возврат;
	КонецЕсли;
	если Элементы.ПриемкаАвтомобиля.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Номер) Тогда
		Если Вопрос("Документ не записан. Выполнить запись?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат
		КонецЕсли;
		Записать();
	КонецЕсли;
	
	СформироватьНомерНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПеревозчика(Команда)
	РезультатПолученияДопИнформации = ВыполнитьЗапрос ();
	Если РезультатПолученияДопИнформации.ФоновоеЗадание Тогда
		Renault_ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте", 1, Истина);
		ФормаДлительнойОперации = Renault_ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, РезультатПолученияДопИнформации.ФоновоеЗаданиеИдентификатор, "Выполняется получение данных."+Символы.ПС+"Пожалуйста, подождите...");
	Иначе
		ОбработатьРезультатВыполненияЗадания();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВыполнитьЗапрос ()
	сПараметры = Новый Структура;
	сПараметры.Вставить("vin", Объект.VIN);
	сПараметры.Вставить("BIR", Объект.Автосалон.BIR);
	РезультатФоновогоЗадания = Renault_ДлительныеОперации.ЗапуститьВыполнениеВФоне(УникальныйИдентификатор, 
	"Renault_PVRСерверСинхрСПланшетом.ПолучитьПеревозчикаВФоне", сПараметры);
	Результат = Новый Структура;
	Если РезультатФоновогоЗадания.ЗаданиеВыполнено Тогда
		Результат.Вставить("ФоновоеЗадание", Ложь);
		Результат.Вставить("АдресХранилища", РезультатФоновогоЗадания.АдресХранилища);
	Иначе 
		Результат.Вставить("ФоновоеЗадание", Истина);
		Результат.Вставить("ФоновоеЗаданиеИдентификатор", РезультатФоновогоЗадания.ИдентификаторЗадания);
		Результат.Вставить("АдресХранилища", РезультатФоновогоЗадания.АдресХранилища);
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатВыполненияЗадания()
	сОтвет = ПолучитьИзВременногоХранилища(РезультатПолученияДопИнформации.АдресХранилища);
	Объект.ТранспортнаяКомпания = сОтвет.Контрагент;
	Объект.ДоговорПеревозчика = сОтвет.Договор;
	Элементы.ГруппаПеревозчики.ТекущаяСтраница = Элементы.ГруппаВводаПеревозчика;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатПолучениеНомера()
	сОтвет = ПолучитьИзВременногоХранилища(РезультатПолученияДопИнформации.АдресХранилища);
	Объект.НомерPVR = сОтвет.НомерPVR;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте()
	Результат = Новый Структура;
	Результат.Вставить("ФоновоеЗаданиеВыполнено", Ложь);
	Результат.ФоновоеЗаданиеВыполнено = Renault_ДлительныеОперации.ЗаданиеВыполнено(РезультатПолученияДопИнформации.ФоновоеЗаданиеИдентификатор);

	Если Результат.ФоновоеЗаданиеВыполнено Тогда
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = РезультатПолученияДопИнформации.ФоновоеЗаданиеИдентификатор Тогда
				Renault_ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		КонецЕсли;
		ОбработатьРезультатВыполненияЗадания();
		Иначе
		Renault_ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте", ПараметрыОбработчика.ТекущийИнтервал, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФоновоеЗаданиеПолучитьНомер()
	Результат = Новый Структура;
	Результат.Вставить("ФоновоеЗаданиеВыполнено", Ложь);
	Результат.ФоновоеЗаданиеВыполнено = Renault_ДлительныеОперации.ЗаданиеВыполнено(РезультатПолученияДопИнформации.ФоновоеЗаданиеИдентификатор);

	Если Результат.ФоновоеЗаданиеВыполнено Тогда
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = РезультатПолученияДопИнформации.ФоновоеЗаданиеИдентификатор Тогда
				Renault_ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		КонецЕсли;
		ОбработатьРезультатПолучениеНомера();
		Иначе
		Renault_ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		ПодключитьОбработчикОжидания("ФоновоеЗаданиеПолучитьНомер", ПараметрыОбработчика.ТекущийИнтервал, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВручную(Команда)
	Элементы.ГруппаПеревозчики.ТекущаяСтраница = Элементы.ГруппаВводаПеревозчика;
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии()
	ПриЗакрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ИсторияСтатусовPVRСрезПоследних.Статус
	|ИЗ
	|	РегистрСведений.Renault_ИсторияСтатусовPVR.СрезПоследних КАК Renault_ИсторияСтатусовPVRСрезПоследних
	|ГДЕ
	|	Renault_ИсторияСтатусовPVRСрезПоследних.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Мендеджер = РегистрыСведений.Renault_ИсторияСтатусовPVR.СоздатьМенеджерЗаписи();
		Мендеджер.Период = ТекущаяДата();
		Мендеджер.Объект = Объект.Ссылка;
		Мендеджер.Статус = Объект.СтатусPVR;
		Мендеджер.Записать();
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Если Выборка.Статус <> Объект.СтатусPVR Тогда
		Мендеджер = РегистрыСведений.Renault_ИсторияСтатусовPVR.СоздатьМенеджерЗаписи();
		Мендеджер.Период = ТекущаяДата();
		Мендеджер.Объект = Объект.Ссылка;
		Мендеджер.Статус = Объект.СтатусPVR;
		Мендеджер.Записать();
	КонецЕсли;
	Если Объект.ДокументыPVRОтправлены и Выборка.Статус <> Перечисления.Renault_СтатусыPVR.ОжидаетПроверки Тогда
		ПланОбмена = ПолучитьПланОбмена();
		ПланыОбмена.ЗарегистрироватьИзменения(ПланОбмена, Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПланОбмена ()
	ВыбораПланаОбмена = ПланыОбмена.Renault_PVR.Выбрать();
	ЭтаБаза = ПланыОбмена.Renault_PVR.ЭтотУзел();
	ПланОбмена = ПланыОбмена.Renault_PVR.ПустаяСсылка();
	Пока ВыбораПланаОбмена.Следующий() цикл
		Если ВыбораПланаОбмена.Ссылка <> ЭтаБаза Тогда
			ПланОбмена = ВыбораПланаОбмена.Ссылка;
		КонецЕсли;
	КонецЦикла;
	Возврат ПланОбмена;
КонецФункции

&НаКлиенте
Процедура ПроведениеFlashAvesПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекущиеДанные = Элементы.ПроведениеFlashAves.ТекущиеДанные;
	
	Если НоваяСтрока Тогда
		ТекущиеДанные.Дата = ТекущаяДата();
		ТекущиеДанные.Сотрудник = СотрудникТекущегоПользователя();
		ТекущиеДанные.Состояние = "NOK";
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СотрудникТекущегоПользователя()
	Возврат Renault_ОбщиеФункции.СотрудникПользователя(ПараметрыСеанса.Пользователь);
КонецФункции

Процедура ОбновитьСтрокуХранения(ВидКонтроля)

	Если ВидКонтроля="Приемка" Тогда Отказ = Не Объект.ВыполненПриемкаАвтомобиля;
	ИначеЕсли ВидКонтроля="Выдача" Тогда Отказ = Не Объект.ВыполненТоржественнаяВыдача; КонецЕсли;
		
	Строки = Объект.ПроведениеFlashAves.НайтиСтроки(Новый Структура("ВидКонтроля",ВидКонтроля));
	
	Если Отказ Тогда
		Если Строки.Количество()>0 Тогда Объект.ПроведениеFlashAves.Удалить(Строки[0]); КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если Строки.Количество()=0 Тогда
		Строка = Объект.ПроведениеFlashAves.Добавить();
		Строка.ВидКонтроля = ВидКонтроля;
		Строка.Состояние = "NOK";
	Иначе Строка = Строки[0]; КонецЕсли;	
	
	Если ВидКонтроля="Приемка" Тогда
		Строка.Дата = Объект.ДатаПримеки;
		Строка.Сотрудник = Объект.ФИОПримещика;
		Строка.Состояние = ?(Объект.СостАвтоСоотвТребКачестваПримеки,"ОК","NOK");
		Строка.НаличиеОТС = Объект.НаличиеOTS_ПА;
		Строка.ОписаниеОТС = Объект.ОписаниеOTS_ПА;
	ИначеЕсли ВидКонтроля="Выдача" Тогда
		Строка.Дата = Объект.ДатаВыдачиАвто;
		Строка.Сотрудник = Объект.ФИОВыдавшегоАвто;
		Строка.Состояние = ?(Объект.АМСоответствуетВыдаче,"ОК","NOK");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеДанныхПриемки(Элемент)
	ОбновитьСтрокуХранения("Приемка");
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеДанныхВыдачи(Элемент)
	ОбновитьСтрокуХранения("Выдача");
	
	Если ПроверитьICM_Начало() тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаICM",ЭтотОбъект);	
 
    	ПоказатьВопрос(Оповещение,
        "Последняя проверка ICM проводилась более 24 часов назад. Проверить ICM заново?",
        РежимДиалогаВопрос.ДаНет,
        0, 
        КодВозвратаДиалога.Да, 
        "Внимание!" );    	
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗакрытияВопросаICM(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		 ПроверитьICM_Окончание();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПроверитьICM_Окончание()
	ТаблицаОТС = Renault_АвтосервисСервер.Renault_ОбработатьОТС(Объект.VIN);
	Для Каждого Строка из ТаблицаОТС Цикл
		СправочникСсылка = Справочники.СервисныеКампании.НайтиПоКоду(Строка.НомерОТС);
		
		Если НЕ ЗначениеЗаполнено(СправочникСсылка) Тогда
			Элемент = Справочники.СервисныеКампании.СоздатьЭлемент();
			Элемент.Код = Строка.НомерОТС;
			Элемент.Наименование = Строка.НаименованиеОТС + " (" + Строка.ИндексЦветОТС + ")";
			Элемент.Комментарий = Строка.ОписаниеОТС + Символы.ПС + "Номер технической ноты: " +Строка(Строка.НомерТехническойНоты);
			Элемент.Записать();
			СправочникСсылка = Элемент.Ссылка; 
		КонецЕсли;
		Запись = РегистрыСведений.ВыполнениеСервисныхКампаний.СоздатьМенеджерЗаписи();
		Запись.VIN = Объект.VIN;
		Запись.СервиснаяКампания = СправочникСсылка;
		Запись.Прочитать();
		Если не Запись.Выбран() Тогда
			Запись.Записать();	
		КонецЕсли;
	КонецЦикла;		
КонецФункции	

&НаСервере
Функция ПроверитьICM_Начало()
	
	Ответ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ВыполнениеСервисныхКампаний.ДатаВыполнения) КАК ДатаВыполнения
	               |ИЗ
	               |	РегистрСведений.ВыполнениеСервисныхКампаний КАК ВыполнениеСервисныхКампаний
	               |ГДЕ
	               |	ВыполнениеСервисныхКампаний.VIN = &VIN";
	Запрос.УстановитьПараметр("VIN",Объект.VIN);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Если ЗначениеЗаполнено(Выборка.ДатаВыполнения) Тогда
			Если Выборка.ДатаВыполнения+86400<ТекущаяДата() тогда
				Ответ = Истина;
			КонецЕсли;
		Иначе
			Ответ = Истина;
		КонецЕсли;
		
	Иначе 
		Ответ = Истина;
	КонецЕсли;	
	
	Возврат Ответ;
	
КонецФункции	
	
&НаКлиенте
Процедура ПроведениеFlashAvesПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные<>Неопределено Тогда
		Элементы.ПроведениеFlashAvesДата.ТолькоПросмотр = Не ПустаяСтрока(ТекущиеДанные.ВидКонтроля);
		Элементы.ПроведениеFlashAvesСостояние.ТолькоПросмотр = Не ПустаяСтрока(ТекущиеДанные.ВидКонтроля);
		Элементы.ПроведениеFlashAvesСотрудник.ТолькоПросмотр = Не ПустаяСтрока(ТекущиеДанные.ВидКонтроля);
		Элементы.ПроведениеFlashAvesНаличиеОТС.ТолькоПросмотр = ТекущиеДанные.ВидКонтроля="Приемка";
		Элементы.ПроведениеFlashAvesОписаниеОТС.ТолькоПросмотр = ТекущиеДанные.ВидКонтроля="Приемка";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроведениеFlashAvesПередУдалением(Элемент, Отказ)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные<>Неопределено Тогда
		Отказ = Не ПустаяСтрока(ТекущиеДанные.ВидКонтроля);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЧекЛиста(Команда)
	ТабДок = ПолучитьНаСервере("Документы.DMS_КартаКачестваПоставки.ПечатьЧекЛиста(Переменная)",Объект.Ссылка); 
	Форм = ПолучитьОбщуюФорму("ПечатнаяФормаДокументов");
	Форм.ЭлементыФормы.ТабличныйДокумент.Очистить();
	Форм.ЭлементыФормы.ТабличныйДокумент.ИмяПараметровПечати = "ПечатьЧекЛиста";
	Форм.ЭлементыФормы.ТабличныйДокумент.Вывести(ТабДок);
	ЗаполнитьЗначенияСвойств(Форм.ЭлементыФормы.ТабличныйДокумент,ТабДок,"ПолеСверху,ПолеСнизу,ПолеСлева,ПолеСправа,Автомасштаб,ОриентацияСтраницы");
	Форм.Объект = Объект.Ссылка;
	Форм.ОбъектПредставление = "Чек-лист подготовки Н/А " + Объект.VIN;
	Форм.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЧекЛистаFlashAves(Команда)
	ТабДок = ПолучитьНаСервере("Документы.DMS_КартаКачестваПоставки.ПечатьЧекЛистаFlashAves(Переменная)",Объект.Ссылка); 
	Форм = ПолучитьОбщуюФорму("ПечатнаяФормаДокументов");
	Форм.ЭлементыФормы.ТабличныйДокумент.Очистить();
	Форм.ЭлементыФормы.ТабличныйДокумент.ИмяПараметровПечати = "ПечатьЧекЛистаFlashAves";
	Форм.ЭлементыФормы.ТабличныйДокумент.Вывести(ТабДок);
	ЗаполнитьЗначенияСвойств(Форм.ЭлементыФормы.ТабличныйДокумент,ТабДок,"ПолеСверху,ПолеСнизу,ПолеСлева,ПолеСправа,Автомасштаб,ОриентацияСтраницы");
	Форм.Объект = Объект.Ссылка;
	Форм.ОбъектПредставление = "Чек-лист Flash AVES " + Объект.VIN;
	Форм.Открыть();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНаСервере(Выражение,Переменная)
	Возврат Вычислить(Выражение);
КонецФункции

&НаКлиенте
Процедура ЗаполнитьДолгосрочноеХранение(Команда)
	Если Не ЗначениеЗаполнено(ДатаMADC) Тогда Сообщить("Не заполнена дата MADC"); Возврат; КонецЕсли;
	//////////Если ДолгосрочноеХранение.Количество()>0 Тогда Сообщить("Таблица уже заполнена"); Возврат; КонецЕсли;
	ДолгосрочноеХранение.Очистить();
	//////////
	
	ЗаполнитьДолгосрочноеХранениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДолгосрочноеХранениеНаСервере()

	ВидыОпераций = Перечисления.Renault_ВидыОперацийДолгосрочногоХранения.ПолучитьВидыОпераций(,Объект.VIN);

	Для каждого ВидОперации Из ВидыОпераций Цикл
		
		Подробности = Перечисления.Renault_ВидыОперацийДолгосрочногоХранения.Подробности(ВидОперации);
		Для каждого стр Из Подробности Цикл
			НС = ДолгосрочноеХранение.Добавить();	
			НС.Операция = ВидОперации;
			НС.Подробности = стр;
			                                     
			Строки = ВидыОперацийМесяцы.НайтиСтроки(Новый Структура("Операция,Подробности",НС.Операция,НС.Подробности));
			Для каждого стрМесяц Из Строки Цикл
				НС["ДатаПлан"+стрМесяц.Месяц] = ДобавитьМесяц(ДатаMADC,стрМесяц.Месяц); 	
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
	ЗаполнитьТаблицуАКБ();
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЧекЛистДолгосрочногоХранения(Команда)
	ТабДок = ПолучитьНаСервере("Документы.DMS_КартаКачестваПоставки.ПечатьЧекЛистДолгосрочногоХранения(Переменная)",Объект.Ссылка); 
	Форм = ПолучитьОбщуюФорму("ПечатнаяФормаДокументов");
	Форм.ЭлементыФормы.ТабличныйДокумент.Очистить();
	Форм.ЭлементыФормы.ТабличныйДокумент.Вывести(ТабДок);
	ЗаполнитьЗначенияСвойств(Форм.ЭлементыФормы.ТабличныйДокумент,ТабДок,"ПолеСверху,ПолеСнизу,ПолеСлева,ПолеСправа,Автомасштаб,МасштабПечати,ОриентацияСтраницы");
	Форм.Объект = Объект.Ссылка;
	Форм.ОбъектПредставление = "Чек-лист долгосрочного хранения Н/А " + Объект.VIN;
	Форм.Открыть();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДолгосрочногоХранения()
	
	ТЗ = Объект.ЧекЛистХранения.Выгрузить(); 
	ТЗ.Свернуть("Операция,Подробности");
	Для каждого стрОперация Из ТЗ Цикл
		
		НоваяСтрока = ДолгосрочноеХранение.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,стрОперация);
		
		Строки = Объект.ЧекЛистХранения.НайтиСтроки(Новый Структура("Операция,Подробности",стрОперация.Операция,стрОперация.Подробности));
		Для каждого стр Из Строки Цикл
			НоваяСтрока["Ответственный"+стр.Месяц]=стр.Ответственный;	
			НоваяСтрока["ДатаПлан"+стр.Месяц]=стр.ДатаПлан;	
		    НоваяСтрока["ДатаФакт"+стр.Месяц]=стр.ДатаФакт;	
		КонецЦикла;
	
	КонецЦикла;

	ЗаполнитьТаблицуАКБ();
	
КонецПроцедуры
&НаСервере
Процедура СохранитьТаблицуДолгосрочногоХранения(ДокументОбъект)
	ДокументОбъект.ЧекЛистХранения.Очистить();
	
	ТЗ = РеквизитФормыВЗначение("ДолгосрочноеХранение");
	Мс = Новый Массив;
	Для каждого Колонка Из ТЗ.Колонки Цикл
		Если СтрЧислоВхождений(Колонка.Имя,"Ответственный")<>0 Тогда Мс.Добавить(Число(СтрЗаменить(Колонка.Имя,"Ответственный",""))); КонецЕсли;
	КонецЦикла;
	Для каждого стр Из ДолгосрочноеХранение Цикл
		Для каждого Сч Из Мс Цикл
			
			//Если заполнено по старой версии ККП запишем данные DMSCOR-1140
			Если Не ЗначениеЗаполнено(Стр["ДатаПлан"+Сч]) Тогда
				Продолжить
			КонецЕсли; 
			//Строки = ВидыОперацийМесяцы.НайтиСтроки(Новый Структура("Операция,Подробности,Месяц",стр.Операция,стр.Подробности,Сч));
			//Если Строки.Количество()=0 Тогда Продолжить; КонецЕсли;
				
			НоваяСтрока = ДокументОбъект.ЧекЛистХранения.Добавить();
			НоваяСтрока.Операция = стр.Операция;
			НоваяСтрока.Подробности = стр.Подробности;
			НоваяСтрока.Месяц = Сч;
			НоваяСтрока.Ответственный = стр["Ответственный"+Сч];
			НоваяСтрока.ДатаПлан = стр["ДатаПлан"+Сч];
			НоваяСтрока.ДатаФакт = стр["ДатаФакт"+Сч];
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидыОперацийМесяцы()

	ВидыОперацийМесяцы = Новый ТаблицаЗначений;
	ВидыОперацийМесяцы.Колонки.Добавить("Операция");
	ВидыОперацийМесяцы.Колонки.Добавить("Подробности");
	ВидыОперацийМесяцы.Колонки.Добавить("Месяц");
	
	ВидыОпераций = Перечисления.Renault_ВидыОперацийДолгосрочногоХранения.ПолучитьВидыОпераций(,Объект.VIN);
	
	Для каждого ВидОперации Из ВидыОпераций Цикл
		Подробности = Перечисления.Renault_ВидыОперацийДолгосрочногоХранения.Подробности(ВидОперации);
		Для каждого стр Из Подробности Цикл
			Месяцы = Перечисления.Renault_ВидыОперацийДолгосрочногоХранения.МесяцыПроверок(ВидОперации,стр);
			Для каждого стрМесяц Из Месяцы Цикл
				НоваяСтрока = ВидыОперацийМесяцы.Добавить();
				НоваяСтрока.Операция = ВидОперации;
				НоваяСтрока.Подробности = стр;
				НоваяСтрока.Месяц = стрМесяц;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ДолгосрочноеХранениеПриАктивизацииСтроки(Элемент)

	ТекущиеДанные = Элементы.ДолгосрочноеХранение.ТекущиеДанные;
	Если ТекущиеДанные<>Неопределено Тогда
		
		Месяцы = Новый Массив;
		Месяцы.Добавить(3);
		Месяцы.Добавить(6);
		Месяцы.Добавить(9);
		Месяцы.Добавить(12);
		
		Для каждого НомерМесяца Из Месяцы Цикл
			
			Строки = ВидыОперацийМесяцы.НайтиСтроки(Новый Структура("Операция,Подробности,Месяц",ТекущиеДанные.Операция,ТекущиеДанные.Подробности,НомерМесяца));
			
			РазрешеноРедактировать = Строки.Количество()<>0;
			
			Элементы["ДолгосрочноеХранениеОтветственный"+НомерМесяца].ТолькоПросмотр = Не РазрешеноРедактировать;
			Элементы["ДолгосрочноеХранениеДатаФакт"+НомерМесяца].ТолькоПросмотр = Не РазрешеноРедактировать;
			
			//Если заполнено по старой версии ККП разрешим редактирование DMSCOR-1083
			Если ЗначениеЗаполнено(ТекущиеДанные["ДатаПлан"+НомерМесяца]) Тогда
				Элементы["ДолгосрочноеХранениеОтветственный"+НомерМесяца].ТолькоПросмотр = Ложь;
				Элементы["ДолгосрочноеХранениеДатаФакт"+НомерМесяца].ТолькоПросмотр = Ложь;
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьMADC(VIN, ДатаMADC)
	Если ПустаяСтрока(VIN) Тогда ДатаMADC = Неопределено; Возврат; КонецЕсли;
	
	Запись = РегистрыСведений.CRM_СостояниеАвтомобилейПроизводителя_v2.СоздатьМенеджерЗаписи();
	Запись.VIN = VIN;
	Запись.Прочитать();
	
	ДатаMADC = ?(Запись.Выбран(),Запись.DATE_MADC,Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ДолгосрочноеХранениеДатаФактПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДолгосрочноеХранение.ТекущиеДанные;
	
	НомерМесяца = Число(СтрЗаменить(Элемент.Имя,"ДолгосрочноеХранениеДатаФакт",""));	
	
	Если НомерМесяца=12 Тогда Возврат; КонецЕсли;
	
	ДатаНачала = Неопределено;
	Для каждого стр Из ДолгосрочноеХранение Цикл
		Если Не ЗначениеЗаполнено(стр["ДатаФакт"+НомерМесяца]) Тогда Продолжить; КонецЕсли;
		Если ДатаНачала=Неопределено Тогда
			ДатаНачала = стр["ДатаФакт"+НомерМесяца];
		Иначе
			ДатаНачала = ?(ДатаНачала>стр["ДатаФакт"+НомерМесяца],стр["ДатаФакт"+НомерМесяца],ДатаНачала);
		КонецЕсли;
	КонецЦикла;
	Если ДатаНачала = Неопределено Тогда ДатаНачала = ТекущиеДанные["ДатаПлан"+НомерМесяца]; КонецЕсли;
	
	ПересчитатьПлановыеДаты_рекурсия(ДатаНачала,НомерМесяца+3);
	
	Если ЭтоСтрокаЗарядкиАКБ(ТекущиеДанные) Тогда
		ЗаполнитьТаблицуАКБ();
		
		СтрокаАКБ = ТаблицаАКБ.НайтиСтроки(Новый Структура("Месяц",НомерМесяца))[0];
	    Элементы.ТаблицаАКБ.ТекущаяСтрока = СтрокаАКБ.ПолучитьИдентификатор();
		Элементы.ТаблицаАКБ.ТекущийЭлемент = Элементы.ТаблицаАКБФактическаяДатаЗарядки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДолгосрочноеХранениеОтветственныйПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДолгосрочноеХранение.ТекущиеДанные;
	НомерМесяца = Число(СтрЗаменить(Элемент.Имя,"ДолгосрочноеХранениеОтветственный",""));
	
	Если ЭтоСтрокаЗарядкиАКБ(ТекущиеДанные) Тогда
		СтрокаАКБ = ТаблицаАКБ.НайтиСтроки(Новый Структура("Месяц",НомерМесяца))[0];
		СтрокаАКБ.Ответственный = ТекущиеДанные["Ответственный"+НомерМесяца];
		
		Элементы.ТаблицаАКБ.ТекущаяСтрока = СтрокаАКБ.ПолучитьИдентификатор();
		Элементы.ТаблицаАКБ.ТекущийЭлемент = Элементы.ТаблицаАКБОтветственный;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьПлановыеДаты_рекурсия(ДатаФактПрошл,НомерМесяца)

	ЕстьФакт = Ложь;
	
	Для каждого стр Из ДолгосрочноеХранение Цикл
		Если ВидыОперацийМесяцы.НайтиСтроки(Новый Структура("Операция,Подробности,Месяц",стр.Операция,стр.Подробности,НомерМесяца)).Количество()=0 Тогда Продолжить; КонецЕсли;
		стр["ДатаПлан"+НомерМесяца] = ДобавитьМесяц(ДатаФактПрошл,3);
		Если ЗначениеЗаполнено(стр["ДатаФакт"+НомерМесяца]) Тогда Естьфакт = Истина; КонецЕсли;
		ДатаПлан = стр["ДатаПлан"+НомерМесяца];
	КонецЦикла;
	
	Если Не ЕстьФакт И НомерМесяца<12 Тогда ПересчитатьПлановыеДаты_рекурсия(ДатаПлан,НомерМесяца+3); КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурнал(Команда)
	Если Объект.Ссылка.Пустая() ИЛИ Модифицированность Тогда Сообщить("Необходимо сохранить документ"); Возврат; КонецЕсли;
	
	Если Команда.Имя = "ОткрытьЖурналПроверок" Тогда 
		ИмяОткрываемойФормы = "ФормаЖурналПроверкиХраненияНА";
	Иначе 
		ИмяОткрываемойФормы = "ФормаЖурналЗарядкиАКБ"; 
	КонецЕсли;
	Если Объект.ЧекЛистХранения.Количество()=0 Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "ДолгосрочноеХранениеЗаполнитьДолгосрочноеХранение";
		Сообщение.Текст = "Необходимо заполнить чек-лист долгосрочного хранения Н/А";
		Сообщение.УстановитьДанные(Объект);
		Сообщение.Сообщить();
		Возврат; 
	КонецЕсли;

	ОткрытьФорму("Документ.DMS_КартаКачестваПоставки.Форма."+ИмяОткрываемойФормы,Новый Структура("ДокументККП",Объект.Ссылка),ЭтаФорма,ЭтаФорма.КлючУникальности);
КонецПроцедуры


&НаСервере
Функция ПолучитьДатуРеализации()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияАвтомобилейАвтомобили.Ссылка.Дата
	               |ИЗ
	               |	Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
	               |ГДЕ
	               |	РеализацияАвтомобилейАвтомобили.Автомобиль = &Автомобиль
	               |	И РеализацияАвтомобилейАвтомобили.Ссылка.Проведен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияАвтомобилейАвтомобили.Ссылка.Дата";
	Запрос.УстановитьПараметр("Автомобиль",Объект.Автомобиль);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Выборка.Дата;
	КонецЕсли;	
	Возврат Неопределено;
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуАКБ()

	ТаблицаАКБ.Очистить();
	
	Операция = Перечисления.Renault_ВидыОперацийДолгосрочногоХранения.АккумуляторнаяБатарея;
	Подробности = Перечисления.Renault_ВидыОперацийДолгосрочногоХранения.Подробности(Операция);
	Месяцы = Перечисления.Renault_ВидыОперацийДолгосрочногоХранения.МесяцыПроверок(Операция,Подробности[0]);
	
	Отбор = Новый Структура("Операция,Подробности", Операция,Подробности[0]);
	Строки = ДолгосрочноеХранение.НайтиСтроки(Отбор);
	
	Если Строки.Количество()=0 Тогда //Проверим Подробности на старый стандарт
        Отбор = Новый Структура("Операция,Подробности", Операция, "Заряжать в течении 6 часов (ATEQ)");
        Строки = ДолгосрочноеХранение.НайтиСтроки(Отбор);
        
        Если Строки.Количество() = 0 Тогда Возврат; КонецЕсли;
    КонецЕсли;
	
	СтрокаХранения = Строки[0];
	
	ДатаРеализации = ПолучитьДатуРеализации();
	
	Для Сч=0 По Месяцы.Количество()-1 Цикл
		НомерМесяца = Месяцы[Сч];
		// DMSREN-260 ++
		Если ДатаРеализации = неопределено или ДатаРеализации> СтрокаХранения["ДатаПлан"+Строка(НомерМесяца)] тогда
		// DMSREN-260 --	
			НоваяСтрока = ТаблицаАКБ.Добавить();
			
			Если НомерМесяца>3 Тогда
				НоваяСтрока.ПредыдущаяДатаЗарядки = СтрокаХранения["ДатаФакт"+Строка(НомерМесяца-3)];
			КонецЕсли;
			НоваяСтрока.ПлановаяДатаСледующейЗарядки = СтрокаХранения["ДатаПлан"+Строка(НомерМесяца)];
			НоваяСтрока.ФактическаяДатаЗарядки = СтрокаХранения["ДатаФакт"+Строка(НомерМесяца)];
			НоваяСтрока.Ответственный = СтрокаХранения["Ответственный"+Строка(НомерМесяца)];
			НоваяСтрока.Месяц = НомерМесяца;
		Иначе СтрокаХранения["ДатаПлан"+Строка(НомерМесяца)] = Дата(1,1,1);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаАКБПриИзмененииДанных(Элемент)
	ТекущиеДанные = Элементы.ТаблицаАКБ.ТекущиеДанные;
	
	НомерМесяца = ТекущиеДанные.Месяц;
	
	Операция = ПредопределенноеЗначение("Перечисление.Renault_ВидыОперацийДолгосрочногоХранения.АккумуляторнаяБатарея");
	Подробности = "Заряжать в течении 6 часов (ATEQ)";
	
	СтрокаХранения = ДолгосрочноеХранение.НайтиСтроки(Новый Структура("Операция,Подробности",Операция,Подробности))[0];
	Элементы.ДолгосрочноеХранение.ТекущаяСтрока = СтрокаХранения.ПолучитьИдентификатор();
	
	Если СтрЧислоВхождений(Элемент.Имя,"Ответственный")<>0 Тогда
		СтрокаХранения["Ответственный"+НомерМесяца] = ТекущиеДанные.Ответственный;
		Элементы.ДолгосрочноеХранение.ТекущийЭлемент = Элементы["ДолгосрочноеХранениеОтветственный"+НомерМесяца];
	Иначе
		Элементы.ДолгосрочноеХранение.ТекущийЭлемент = Элементы["ДолгосрочноеХранениеДатаФакт"+НомерМесяца];
		СтрокаХранения["ДатаФакт"+НомерМесяца] = ТекущиеДанные.ФактическаяДатаЗарядки;
		ДолгосрочноеХранениеДатаФактПриИзменении(Элементы["ДолгосрочноеХранениеДатаФакт"+ТекущиеДанные.Месяц]);
		
		СтрокаАКБ = ТаблицаАКБ.НайтиСтроки(Новый Структура("Месяц",НомерМесяца))[0];
		Элементы.ТаблицаАКБ.ТекущаяСтрока = СтрокаАКБ.ПолучитьИдентификатор();
		Элементы.ТаблицаАКБ.ТекущийЭлемент = Элемент;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ЭтоСтрокаЗарядкиАКБ(ТекущиеДанные)

	Операция = ПредопределенноеЗначение("Перечисление.Renault_ВидыОперацийДолгосрочногоХранения.АккумуляторнаяБатарея");
	Подробности = "Заряжать в течении 6 часов (ATEQ)";
	НовыеПодробности = "Заряжать ATEQ до полной зарядки (зеленый индикатор горит постоянно, не мигает)";
	
	Возврат ТекущиеДанные.Операция=Операция И (ТекущиеДанные.Подробности=Подробности ИЛИ ТекущиеДанные.Подробности = НовыеПодробности);

КонецФункции


&НаСервере
Процедура ЗаполнитьОпцииПоДоговоруКПНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(Renault_ДоговорСоставДоговора.Ссылка) КАК Ссылка
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.Renault_Договор.СоставДоговора КАК Renault_ДоговорСоставДоговора
		|ГДЕ
		|	Renault_ДоговорСоставДоговора.VIN = &VIN
		|	И НЕ Renault_ДоговорСоставДоговора.Ссылка.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Ссылка,
		|	Renault_ДоговорДопОпцииАвтомобилей.Опция,
		|	Renault_ДоговорДопОпцииАвтомобилей.Цена,
		|	Renault_ДоговорСоставДоговора.Идентификатор,
		|	Renault_ДоговорСоставДоговора.Автомобиль
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_Договор.СоставДоговора КАК Renault_ДоговорСоставДоговора
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_Договор.ДопОпцииАвтомобилей КАК Renault_ДоговорДопОпцииАвтомобилей
		|			ПО Renault_ДоговорСоставДоговора.Идентификатор = Renault_ДоговорДопОпцииАвтомобилей.Идентификатор
		|				И Renault_ДоговорСоставДоговора.Ссылка = Renault_ДоговорДопОпцииАвтомобилей.Ссылка
		|		ПО ВТ.Ссылка = Renault_ДоговорСоставДоговора.Ссылка
		|			И (Renault_ДоговорСоставДоговора.VIN = &VIN)";
	
	Запрос.УстановитьПараметр("VIN", Объект.VIN);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Объект.Опции.Очистить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Объект.Опции.Добавить(),Выборка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьОпцииПоДоговоруКП(Команда)
	ЗаполнитьОпцииПоДоговоруКПНаСервере();
КонецПроцедуры

// Обновление опций 
&НаКлиенте
Процедура ЗаполнитьОпции(Команда)

	Если Объект.Опции.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбновитьОпции", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, "Обновить опции?", Режим, 0);
	Иначе
		ОбновитьОпцииНаСервере();		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбновитьОпции(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьОпцииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОпцииНаСервере() 
		
	ТаблицаОпцийАвтомобиля = Renault_CRM.ПолучитьТаблицуОпцийПоВин(Объект.VIN);
	МассивОпцийАвтомобиля = ТаблицаОпцийАвтомобиля.ВыгрузитьКолонку("Опция");

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ТарифНаОпцииАвтомобилей.Опция КАК Опция,
	|	Renault_ТарифНаОпцииАвтомобилей.ЦенаКлиентская КАК Цена
	|ИЗ
	|	РегистрСведений.Renault_ТарифНаОпцииАвтомобилей.СрезПоследних(
	|			,
	|			Тариф = &Тариф
	|				И Модель = &Модель
	|				И ВариантКомплектации = &ВариантКомплектации
	|				И Опция В (&МассивОпцийАвтомобиля)) КАК Renault_ТарифНаОпцииАвтомобилей";
		
	Запрос.УстановитьПараметр("МассивОпцийАвтомобиля", МассивОпцийАвтомобиля);		
	Запрос.УстановитьПараметр("Тариф",                 Renault_CRM.ПолучитьПоследнийТарифНаАвтомобиль(Объект.Версия));
	Запрос.УстановитьПараметр("ВариантКомплектации",   Объект.Версия);
	Запрос.УстановитьПараметр("Модель",                Объект.Модель);		
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Объект.Опции.Очистить();
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Объект.Опции.Добавить();		
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Обновление опций дилера
&НаКлиенте
Процедура ЗаполнитьОпцииДилера(Команда)

	Если Объект.Аксессуары.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбновитьОпцииДилера", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, "Обновить опции дилера?", Режим, 0);
	Иначе
		ОбновитьОпцииДилераНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбновитьОпцииДилера(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьОпцииДилераНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОпцииДилераНаСервере() 
						
	НастройкиБазы = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	
	Запрос = Новый Запрос;	
	Если  НастройкиБазы.ИспользоватьТиповойУчетДО Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	КомплектацияАвтомобилейОстаткиИОбороты.Автомобиль,
		|	КомплектацияАвтомобилейОстаткиИОбороты.Номенклатура КАК Номенклатура,
		|	СУММА(КомплектацияАвтомобилейОстаткиИОбороты.СуммаПродажиПриход) КАК Сумма,
		|	СУММА(КомплектацияАвтомобилейОстаткиИОбороты.КоличествоПриход) КАК Количество
		|ИЗ
		|	РегистрНакопления.КомплектацияАвтомобилей.ОстаткиИОбороты(, , Регистратор, , Автомобиль = &Автомобиль) КАК КомплектацияАвтомобилейОстаткиИОбороты
		|ГДЕ
		|	КомплектацияАвтомобилейОстаткиИОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|
		|СГРУППИРОВАТЬ ПО
		|	КомплектацияАвтомобилейОстаткиИОбороты.Автомобиль,
		|	КомплектацияАвтомобилейОстаткиИОбороты.Номенклатура";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_УстановленноеОборудованиеАвтомобилейОстатки.Автомобиль,
		|	Renault_УстановленноеОборудованиеАвтомобилейОстатки.Оборудование КАК Номенклатура,
		|	Renault_УстановленноеОборудованиеАвтомобилейОстатки.СтоимостьОстаток КАК Сумма,
		|	Renault_УстановленноеОборудованиеАвтомобилейОстатки.СебестоимостьОстаток,
		|	Renault_УстановленноеОборудованиеАвтомобилейОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.Renault_УстановленноеОборудованиеАвтомобилей.Остатки(, Автомобиль = &Автомобиль) КАК Renault_УстановленноеОборудованиеАвтомобилейОстатки";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Автомобиль", Объект.Автомобиль);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Объект.Аксессуары.Очистить();
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Объект.Аксессуары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.Цена = Окр(Выборка.Сумма/Выборка.Количество, 2);	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЧекЛистДолгосрочногоХраненияЭлектроавтомобилей(Команда)
	ТабДок = ПолучитьНаСервере("Документы.DMS_КартаКачестваПоставки.ПечатьЧекЛистДолгосрочногоХраненияЭД(Переменная)",Объект.Ссылка); 
	Форм = ПолучитьОбщуюФорму("ПечатнаяФормаДокументов");
	Форм.ЭлементыФормы.ТабличныйДокумент.Очистить();
	Форм.ЭлементыФормы.ТабличныйДокумент.Вывести(ТабДок);
	ЗаполнитьЗначенияСвойств(Форм.ЭлементыФормы.ТабличныйДокумент,ТабДок,"ПолеСверху,ПолеСнизу,ПолеСлева,ПолеСправа,Автомасштаб,МасштабПечати,ОриентацияСтраницы");
	Форм.Объект = Объект.Ссылка;
	Форм.ОбъектПредставление = "Чек-лист долгосрочного хранения Н/А с электродвигателем" + Объект.VIN;
	Форм.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСертификатаКонтроля(Команда)
	ТабДок = ПолучитьНаСервере("Документы.DMS_КартаКачестваПоставки.ПечатьСертификатаКонтроля(Переменная)",Объект.Ссылка); 
	Форм = ПолучитьОбщуюФорму("ПечатнаяФормаДокументов");
	Форм.ЭлементыФормы.ТабличныйДокумент.Очистить();
	Форм.ЭлементыФормы.ТабличныйДокумент.Вывести(ТабДок);
	ЗаполнитьЗначенияСвойств(Форм.ЭлементыФормы.ТабличныйДокумент,ТабДок,"ПолеСверху,ПолеСнизу,ПолеСлева,ПолеСправа,Автомасштаб,МасштабПечати,ОриентацияСтраницы");
	Форм.Объект = Объект.Ссылка;
	Форм.ОбъектПредставление = "Сертификат контроля " + Объект.VIN;
	Форм.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПодготовкуКВыдаче(Команда)
	
	Если Не ЗначениеЗаполнено(ДатаMADC) Тогда Сообщить("Не заполнена дата MADC"); Возврат; КонецЕсли;
	////////Если Объект.ЧекЛистВыдача.Количество() > 0 Тогда Сообщить("Таблица уже заполнена"); Возврат; КонецЕсли;
	Объект.ЧекЛистВыдача.Очистить();
	////////
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	CRM_ЗаписьНаВыдачу.ДатаНачала
	|ИЗ
	|	Документ.CRM_ЗаписьНаВыдачу КАК CRM_ЗаписьНаВыдачу
	|ГДЕ
	|	CRM_ЗаписьНаВыдачу.VIN = &VIN
	|
	|УПОРЯДОЧИТЬ ПО
	|	CRM_ЗаписьНаВыдачу.Дата УБЫВ";
	Запрос.УстановитьПараметр("VIN", Объект.VIN);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		ДатаПланируемойВыдачи = РезультатЗапроса.ДатаНачала
	Иначе
		Сообщить("Не найдена запланированная выдача");
		Возврат
	КонецЕсли;
	
	//
	Если ДатаПланируемойВыдачи - ТекущаяДата() < 72 * 3600 Тогда
		ДатаПлан = ТекущаяДата()
	Иначе
		ДатаПлан = ДатаПланируемойВыдачи - 72 * 3600
	КонецЕсли; 
	
	Стр = Объект.ЧекЛистВыдача.Добавить();
	Стр.Операция = Перечисления.Renault_ВидыОперацийДолгосрочногоХранения.ДавлениеВШинах;
	Стр.Подробности = "При необходимости отрегулировать давление в соответствии с моделью";
	Стр.ДатаПлан = ДатаПлан;
	
	Стр = Объект.ЧекЛистВыдача.Добавить();
	Стр.Операция = Перечисления.Renault_ВидыОперацийДолгосрочногоХранения.АккумуляторнаяБатарея;
	Стр.Подробности = "Зарядить 30 мин ATEQ. Если на а/м сообщение о необходимости заряда АКБ, заряжать ATEQ до полной зарядки (зеленый индикатор горит постоянно, не мигает)";
	Стр.ДатаПлан = ДатаПлан;
	
	//Если автомобилю больше года, тогда замена аккумулятора
	Если ДобавитьМесяц(ДатаMADC, 12) < ДатаПланируемойВыдачи Тогда
		Стр = Объект.ЧекЛистВыдача.Добавить();
		Стр.Операция = Перечисления.Renault_ВидыОперацийДолгосрочногоХранения.АккумуляторнаяБатарея;
		Стр.Подробности = "Замена, если выдаваемый автомобиль > 12 мес от MADC";
	КонецЕсли;
	
	Стр = Объект.ЧекЛистВыдача.Добавить();
	Стр.Операция = Перечисления.Renault_ВидыОперацийДолгосрочногоХранения.СистемаВентиляции;
	Стр.Подробности = "Проверить, что отключен режим рециркуляции воздуха в салоне";
	Стр.ДатаПлан = ДатаПлан;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьICM(Команда)
	ПроверитьICMНаСервере("НаличиеOTS_ПА","ОписаниеOTS_ПА");
КонецПроцедуры

&НаСервере
Процедура ПроверитьICMНаСервере(НаличиеOTS,ОписаниеOTS)
	ТаблицаОТС = Renault_АвтосервисСервер.Renault_ОбработатьОТС(Объект.VIN);	
	СправочникСсылка = Неопределено;
	Если ТаблицаОТС.Количество()>0 тогда
		Для Каждого Строка из ТаблицаОТС Цикл
			СправочникСсылка = Справочники.СервисныеКампании.НайтиПоКоду(Строка.НомерОТС);
			
			Если НЕ ЗначениеЗаполнено(СправочникСсылка) Тогда
				Элемент = Справочники.СервисныеКампании.СоздатьЭлемент();
				Элемент.Код = Строка.НомерОТС;
				Элемент.Наименование = Строка.НаименованиеОТС + " (" + Строка.ИндексЦветОТС + ")";
				Элемент.Комментарий = Строка.ОписаниеОТС + Символы.ПС + "Номер технической ноты: " +Строка(Строка.НомерТехническойНоты);
				Элемент.Записать();
				СправочникСсылка = Элемент.Ссылка; 
			КонецЕсли;
			Запись = РегистрыСведений.ВыполнениеСервисныхКампаний.СоздатьМенеджерЗаписи();
			Запись.VIN = Объект.VIN;
			Запись.СервиснаяКампания = СправочникСсылка;
			Запись.Прочитать();
			Если не Запись.Выбран() Тогда
				Запись.Записать();	
			КонецЕсли;
			Renault_АвтосервисСервер.ЗарегистрироватьПроверкуICMВЖурнале(Объект.VIN,НаличиеOTS,СправочникСсылка);
		КонецЦикла;
	Иначе
		
		Renault_АвтосервисСервер.ЗарегистрироватьПроверкуICMВЖурнале(Объект.VIN,НаличиеOTS,СправочникСсылка);
	КонецЕсли;
	ОбновитьДатуICM(НаличиеOTS,ОписаниеOTS);
	
	РезультатПроверки = Renault_АвтосервисСервер.ПолучитьРезультатПоследнейПроверкиICM(Объект.VIN);
	Если РезультатПроверки.РезультатЗапроса = неопределено тогда
		Возврат;
	КонецЕСли;	
	
	Если РезультатПроверки.РезультатЗапроса = "Есть отзывные компании" тогда
		Сообщить(РезультатПроверки.ОписаниеOTS);
	Иначе
		Сообщить(РезультатПроверки.РезультатЗапроса);
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьДатуICM(НаличиеOTS,ОписаниеOTS)
	Запрос = Новый Запрос;
	ЗАпрос.Текст = "ВЫБРАТЬ
	|	ВыполнениеСервисныхКампаний.ДатаВыполнения,
	|	ВыполнениеСервисныхКампаний.СервиснаяКампания.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.ВыполнениеСервисныхКампаний КАК ВыполнениеСервисныхКампаний
	|ГДЕ
	|	ВыполнениеСервисныхКампаний.VIN = &VIN";
	Запрос.УстановитьПараметр("VIN",Объект.VIN);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Объект[НаличиеOTS] = Истина;
		Объект[ОписаниеOTS] = Выборка.Комментарий;
	КонецЕСли;	
КонецПроцедуры	

&НаКлиенте
Процедура ПроверитьICM_ППП(Команда)
	ПроверитьICMНаСервере("НаличиеOTS_ППП","ОписаниеOTS_ППП");
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьICMПП(Команда)
	ПроверитьICMНаСервере("НаличиеOTS_ПП","ОписаниеOTS_ПП");
КонецПроцедуры

// Сергеев В.Н. DMSREN-868
&НаСервере
Функция ПолучитьКлючРабочегоЛиста(Ид)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_РабочиеЛисты.Ссылка
	|ИЗ
	|	Документ.Renault_РабочийЛист КАК Renault_РабочиеЛисты
	|ГДЕ
	|	Renault_РабочиеЛисты.IDK = &IDK";
	Запрос.УстановитьПараметр("IDK", Ид);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Выборка.Ссылка;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМенеджераИЗДоговора(Автомобиль)  

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ДоговорСоставДоговора.Ссылка.Менеджер КАК Менеджер
		|ИЗ
		|	Документ.Renault_Договор.СоставДоговора КАК Renault_ДоговорСоставДоговора
		|ГДЕ
		|	Renault_ДоговорСоставДоговора.Автомобиль = &Автомобиль
		|	И Renault_ДоговорСоставДоговора.Ссылка.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Renault_ДоговорСоставДоговора.Ссылка.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	если ВыборкаДетальныеЗаписи.Следующий() тогда
		Возврат ВыборкаДетальныеЗаписи.Менеджер;
	Конецесли;
	
	
КонецФункции


