// Создает запись в РС "Архив расчета минимальной даты поставки"
//
// Параметры:
//  ДанныеДляЗаписи - Структура.
//
Процедура СоздатьЗаписьРасчетаМинДатыПоставки(ДанныеДляЗаписи) Экспорт

	Если ТипЗнч(ДанныеДляЗаписи) = Тип("Структура") 
		И ДанныеДляЗаписи.Свойство("ЗаявкаНаАвтомобиль") И ЗначениеЗаполнено(ДанныеДляЗаписи.ЗаявкаНаАвтомобиль) Тогда
		
		МенеджерЗаписи = РегистрыСведений.DMS_АрхивРасчетовМинДатыПоставки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ЗаявкаНаАвтомобиль = ДанныеДляЗаписи.ЗаявкаНаАвтомобиль;
		МенеджерЗаписи.VIN                = ДанныеДляЗаписи.VIN;
		
		МенеджерЗаписи.Прочитать();
		
		Если НЕ МенеджерЗаписи.Выбран() Тогда
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДанныеДляЗаписи);		

			Попытка
				МенеджерЗаписи.Записать();
			Исключение
				ЗаписьЖурналаРегистрации("Запись данных.Архив расчета минимальной даты поставки", УровеньЖурналаРегистрации.Ошибка,,, 
				"Возникла ошибка в обработке ""Ввод клиентов"", при создании записи в РС ""Архив расчета минимальной даты поставки""!" 
				+ Символы.ПС + ОписаниеОшибки());
			КонецПопытки;	
		КонецЕсли;	
	КонецЕсли;
		
КонецПроцедуры	

// Получить запись из РС "Архив расчета минимальной даты поставки"
//
// Параметры:
//  ЗаявкаНаАвтомобиль - Ссылка.
//  VIN - Строка (20).
//
Функция ПолучитьПараметрыРасчетаМинДатыПоставки(ЗаявкаНаАвтомобиль, VIN) Экспорт
	
	ПараметрыРасчета = Неопределено;
	
	Если ЗначениеЗаполнено(ЗаявкаНаАвтомобиль) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ 
		|	*
		|ИЗ
		|	РегистрСведений.DMS_АрхивРасчетовМинДатыПоставки КАК АрхивРасчетовМинДатыПоставки
		|ГДЕ
		|	АрхивРасчетовМинДатыПоставки.ЗаявкаНаАвтомобиль = &ЗаявкаНаАвтомобиль";
				
		Запрос.УстановитьПараметр("ЗаявкаНаАвтомобиль", ЗаявкаНаАвтомобиль);
		
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			
			ПараметрыРасчета = Новый Структура;
			ПараметрыРасчета.Вставить("ЗаявкаНаАвтомобиль",      ЗаявкаНаАвтомобиль);
			ПараметрыРасчета.Вставить("VIN",                     "");
			ПараметрыРасчета.Вставить("ДатаОтсчета",             Дата(1,1,1));
			ПараметрыРасчета.Вставить("НазваниеДаты",            "");
			ПараметрыРасчета.Вставить("СрокДоставки",            0);
			ПараметрыРасчета.Вставить("СрокНаСкладе",            0);
			ПараметрыРасчета.Вставить("СрокПодготовки",          0);
			ПараметрыРасчета.Вставить("ОписаниеРасчета",         "");
			ПараметрыРасчета.Вставить("МинимальнаяДатаПоставки", Дата(1,1,1));
			ПараметрыРасчета.Вставить("ЛокальноВДМС", 			 Ложь);
			
			ЗаполнитьЗначенияСвойств(ПараметрыРасчета, Выборка);
		КонецЕсли;
	КонецЕсли;

	Возврат ПараметрыРасчета;
	
КонецФункции	
