Перем BIR;
Перем СервисФабрика;

//Точка входа
Процедура ОбработкаНаСервере() Экспорт
	BIR =Renault_ОбщийМодуль.ПолучитьBIRБазыДанных();
	//*//СокрЛП(Renault_ОбщийМодуль.ПолучитьИдентификатор(Организация));
	ПолучитьДанныеИзЦентраль();		
КонецПроцедуры

Процедура ПолучитьДанныеИзЦентраль()Экспорт
	
	Адрес = АдресWS +"ws/colpic.ws";
	Адрес = СтрЗаменить(Адрес, "?wsdl", "");
	ВСОпределение = Новый WSОпределения(СокрЛП(Адрес) + "?wsdl",
									СокрЛП(ЛогинWS), СокрЛП(ПарольWS));
	ВебСервис = Новый WSПрокси(ВСОпределение, "http://renault-nissan.com/schema/colors", 
							   "ColorsAndPictures","ColorsAndPicturesSoap12",600);
	ВебСервис.Пользователь	 = СокрЛП(ЛогинWS);
	ВебСервис.Пароль		 = СокрЛП(ПарольWS);
	СервисФабрика = ВебСервис.ФабрикаXDTO;
	
	ЦветаМодели = ВебСервис.GetModelsColor(BIR);
	ПолучитьЦветаМодели(ЦветаМодели);
	
	Картинки = ВебСервис.GetPictures(BIR);
	ПолучитьКартинки(Картинки);		
	
	МаркиАвтомобилей =ВебСервис.GetBrandCars(BIR,Истина);
	ПолучитьПредопределенныеМарки(МаркиАвтомобилей);
	
	Инфа = СформироватьИнформацию(СервисФабрика);
	Итог = ВебСервис.SetDCData(BIR,Инфа);
	
КонецПроцедуры

Процедура ПолучитьЦветаМодели(Источник) экспорт
	
	Набор =  РегистрыСведений.Renault_ЦветаМоделей.СоздатьНаборЗаписей();
    Зап = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 0
                       |	Renault_ЦветаМоделей.Модель,
                       |	Renault_ЦветаМоделей.Цвет
                       |ИЗ
                       |	РегистрСведений.Renault_ЦветаМоделей КАК Renault_ЦветаМоделей");
	ТабЗнач = Зап.Выполнить().Выгрузить();
	Для Каждого ТекЗапись Из Источник.Строки Цикл
		Попытка
			Модель = ПолучитьСсылкуМодель(ТекЗапись.Модель);
			Цвет = ПолучитьСсылкуЦвет(ТекЗапись.Цвет);
			Если Не(Модель = Справочники.Модели.ПустаяСсылка())И  Не(Цвет = Справочники.Цвета.ПустаяСсылка())Тогда
				НовСтр = ТабЗнач.Добавить();
				НовСтр.Модель = Модель;
				НовСтр.Цвет = Цвет;						
			КонецЕсли;
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	Набор.Загрузить(ТабЗнач);
	Набор.Записать();
	
КонецПроцедуры

Процедура ПолучитьКартинки(Источник) экспорт
	
	Для Каждого ТекЗапись Из Источник.Строки Цикл
		Попытка
			Менеджер =  РегистрыСведений.CRM_ИдентификаторыКартинок.СоздатьМенеджерЗаписи();
			Модель = ПолучитьСсылкуМодель(ТекЗапись.Модель);
			ВариантКомплектации = ПолучитьСсылкуМодель(ТекЗапись.ВариантКомплектации);
			Идентификатор = ТекЗапись.Идентификатор;
			Данные = ТекЗапись.Картинка;
			Картинка = Новый Картинка(Данные);
			Цвет = ПолучитьСсылкуЦвет(ТекЗапись.Цвет);
			Если Не(Модель = Справочники.Модели.ПустаяСсылка())И (ЗначениеЗаполнено(Идентификатор))Тогда
				КартинкаСуществует =НайтиСоздатьКартинку(Идентификатор,Модель,Картинка);
				Если КартинкаСуществует Тогда
					Менеджер.Модель = Модель;
					Менеджер.Цвет = Цвет;
					Менеджер.ВариантКомплектации = ВариантКомплектации;
					Менеджер.Прочитать();
					Если НЕ Менеджер.Выбран() Тогда
						Менеджер.Модель = Модель;
						Менеджер.Цвет = Цвет;
						Менеджер.ВариантКомплектации= ВариантКомплектации;
					КонецЕсли;
					Менеджер.Идентификатор = Идентификатор;
					Менеджер.Записать();
                КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	
КонецПроцедуры

Функция НайтиСоздатьКартинку(Идентификатор,Модель,Картинка)
	Ответ = ложь;
	Зап = Новый Запрос("ВЫБРАТЬ
	                   |	КартинкиИФайлы.Данные
	                   |ИЗ
	                   |	РегистрСведений.КартинкиИФайлы КАК КартинкиИФайлы
	                   |ГДЕ
	                   |	КартинкиИФайлы.Объект = &Объект
	                   |	И КартинкиИФайлы.Идентификатор = &Идентификатор");	
	Зап.УстановитьПараметр("Объект",Модель);
	Зап.УстановитьПараметр("Идентификатор",Идентификатор);
	Рез= Зап.Выполнить();
	Если Рез.Пустой() Тогда
		Мен = РегистрыСведений.КартинкиИФайлы.СоздатьМенеджерЗаписи();
		Мен.Объект = Модель;
		Мен.Идентификатор = Идентификатор;
		Мен.Прочитать();
		Если НЕ Мен.Выбран() тогда
			Попытка
			  	Мен.Объект = Модель;
				Мен.Идентификатор = Идентификатор;
				Мен.Данные = Новый ХранилищеЗначения(Картинка);
				Мен.Картинка = Истина;
				Мен.ДатаСохранения = ТекущаяДата();
				Мен.ДанныеВоВнешнемФайле = Ложь;
				мен.Записать();
				Ответ = Истина;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	Иначе
		Ответ = Истина;
	КонецЕсли;
	Возврат Ответ;
		
КонецФункции

Функция ПолучитьСсылкуМодель(Артикул)
	Попытка
		Рез = Справочники.Модели.НайтиПоРеквизиту("Артикул",Артикул);
	Исключение
		Рез = Справочники.Модели.ПустаяСсылка();
	КонецПопытки;
	Возврат рез;
КонецФункции

Функция ПолучитьСсылкуЦвет(ДанныеЦвет)
	
	Если ЗначениеЗаполнено(ДанныеЦвет.Артикул) И (НЕ(ДанныеЦвет.Артикул ="-1")) Тогда
		ЦветСсылка = Справочники.Цвета.НайтиПоРеквизиту("Артикул", ДанныеЦвет.Артикул);
		Если ЦветСсылка = Справочники.Цвета.ПустаяСсылка()Тогда
			Попытка
				//Создадим новый элемент
				ЦветОбъект = Справочники.Цвета.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(ЦветОбъект, ДанныеЦвет);
				ЦветОбъект.УстановитьНовыйКод();
				ЦветОбъект.Записать();
				ЦветСсылка = ЦветОбъект.Ссылка;
			Исключение
				ЦветСсылка = Справочники.Цвета.ПустаяСсылка();
			КонецПопытки;
		Иначе
			Попытка
				//Дополним текущий
				ЦветОбъект = ЦветСсылка.ПолучитьОбъект();
				ЗаполнитьЗначенияСвойств(ЦветОбъект, ДанныеЦвет);
				ЦветОбъект.Записать();
				ЦветСсылка = ЦветОбъект.Ссылка;
			Исключение
				//Ничего
			КонецПопытки;
		КонецЕсли;
	Иначе
		ЦветСсылка = Справочники.Цвета.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ЦветСсылка;
	
КонецФункции

Функция ПолучитьСсылкуВариантКомплектации(Артикул)
	Попытка
		Рез = Справочники.ВариантыКомплектации.НайтиПоРеквизиту("Артикул",Артикул);
	Исключение
		Рез = Справочники.ВариантыКомплектации.ПустаяСсылка();
	КонецПопытки;
	Возврат рез;
	
КонецФункции

Процедура ПолучитьПредопределенныеМарки(Марки)экспорт
	ОбъектМарка = Справочники.CRM_МаркаАвтомобиля.RENAULT.ПолучитьОбъект();
	ОбъектМарка.МоделиАвтомобилей.Очистить();
	ОбъектМарка.МоделиАвтомобилейКоммерческоеПредложение.Очистить();
	ОбъектМарка.МоделиАвтомобилейПервичныйИнтерес.Очистить();

	Для Каждого Марка из Марки.Строки Цикл
		Для Каждого ТекМодель Из Марка.МоделиАвтомобилей Цикл
			Модель = ПолучитьСсылкуМодель(ТекМодель);
			Если НЕ(Модель = Справочники.Модели.ПустаяСсылка())Тогда
				НовСтр = ОбъектМарка.МоделиАвтомобилей.Добавить();
				новСтр.Модель = Модель;
			КонецЕсли;
		КонецЦикла;
		Для Каждого ТекМодель Из Марка.МоделиАвтомобилейКП Цикл
			Модель = ПолучитьСсылкуМодель(ТекМодель);
			Если НЕ(Модель = Справочники.Модели.ПустаяСсылка())Тогда
				НовСтр = ОбъектМарка.МоделиАвтомобилейКоммерческоеПредложение.Добавить();
				новСтр.Модель = Модель;
			КонецЕсли;
		КонецЦикла;
        Для Каждого ТекМодель Из Марка.МоделиАвтомобилейПИ Цикл
			Модель = ПолучитьСсылкуМодель(ТекМодель);
			Если НЕ(Модель = Справочники.Модели.ПустаяСсылка())Тогда
				НовСтр = ОбъектМарка.МоделиАвтомобилейПервичныйИнтерес.Добавить();
				новСтр.Модель = Модель;
			КонецЕсли;
		КонецЦикла;
        		
	КонецЦикла;
	ОбъектМарка.Записать();
КонецПроцедуры

Функция СформироватьИнформацию(Фабрика) экспорт
	Ответ  = Фабрика.Создать(Фабрика.Тип("http://renault-nissan.com/schema/colors","ИнформацияОДц"));
	Ответ.BIR = BIR;
	Ответ.ВерсияАА = Метаданные.Версия;
	Ответ.ВерсияCRM = Константы.CRM_Версия_Renault.Получить();
	Возврат Ответ;
КонецФункции

АдресWS	 =Константы.Renault_АдресWebСервисов.Получить();
//АдресWS	 ="http://test-dms-server/FROLOV-CENTRAL/";  //для тестирования в локальной центральной базе 
ЛогинWS	 = Константы.Renault_ЛогинВебСервиса.Получить();
ПарольWS = Константы.Renault_ПарольВебСервиса.Получить();
