&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Календарь.Сотрудник=ПараметрыСеанса.Пользователь.Сотрудник;
	Календарь.ВидКалендаря=2;
	
	Интервал=5;
	Календарь.ИнтервалСлота=30;
	ЗаголовокИнтервала();
	Календарь.ТочностьПланирования=Календарь.ИнтервалСлота;
	
	Календарь.ОтображатьВыходные=Истина;
	Календарь.ДатаКалендаря=ТекущаяДата();
	УстановитьПериод();
	Календарь.ПервыйЧас=Календарь.НачалоРабочегоВремени;
	Календарь.РежимПодбора=Ложь;
	Календарь.ТолькоЧтение=Ложь;
	
	Массив=Новый Массив; Массив.Добавить(Справочники.CRM_ВидыСобытий.Оплата);
	Календарь.ВидыСобытий.ЗагрузитьЗначения(Массив);
	
	ЦветАктивно = Вычислить(Renault_ОбщиеФункцииСервер.МультибрендПараметрыОформления().ОсновнойЦвет);	
	
	Если Параметры.Свойство("IDK") Тогда
		IDK = Параметры.IDK;
	КонецЕсли;
	
	Если Календарь.КоличествоСобытий = 0 Тогда
		Календарь.КоличествоСобытий = 30;	
	КонецЕсли;
	
	ДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	Если ИспользуетсяНовыйГрафикОплат() Тогда
		ОткрытьФорму("Обработка.Renault_КалендарьСобытий.Форма.ГрафикОплатНовый");
		Закрыть();
	КонецЕсли;
	
	Массив = Новый Массив;
	Массив.Добавить(Элементы.Декорация3);
	Renault_ОбщиеФункции.МультибрендЗадатьОформление(Массив, "Картинка", "Логотип");

	Массив=Новый Массив;
	Массив.Добавить(Элементы.кнПредыдущийПериод);
	Массив.Добавить(Элементы.кнСледующийПериод);
	Renault_ОбщиеФункции.МультибрендЗадатьОформление(Массив,"ЦветФона","ОсновнойЦвет");	
	Renault_ОбщиеФункции.МультибрендЗадатьОформление(Массив,"ЦветРамки","ОсновнойЦвет");	

	ОбновитьКалендарь();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКалендарь(Команда=Ложь) Экспорт ОбновитьHTML() КонецПроцедуры
Процедура ОбновитьHTML() СтрокаHTML=РеквизитФормыВЗначение("Календарь").ПолучитьHTML() КонецПроцедуры

&НаКлиенте
Процедура ВидКалендаря(Команда)
	Если Команда.Имя="День" Тогда Календарь.ВидКалендаря=1 //день
	ИначеЕсли Команда.Имя="Неделя" Тогда Календарь.ВидКалендаря=2 //неделя
	ИначеЕсли Команда.Имя="Месяц" Тогда Календарь.ВидКалендаря=3 //месяц
	//Иначе Календарь.ВидКалендаря=4 // повестка дня
	КонецЕсли;
	ДоступностьЭлементов();
	УстановитьПериод();
	ОбновитьКалендарь();
КонецПроцедуры

&НаКлиенте
Процедура кнТолькоСвои(Команда)
	Календарь.Сотрудник=?(Календарь.Сотрудник.Пустая(),ПараметрыСеанса.Пользователь.Сотрудник,Календарь.Сотрудник.Пустая()); 
	ДоступностьЭлементов();
	ОбновитьКалендарь();
КонецПроцедуры

Функция ДоступностьЭлементов()
	ЦветНеАктивно=Новый Цвет(231,231,231);
	//ЦветАктивно=Новый Цвет(255,207,0);
	ЦветРамки=Новый Цвет(156,166,178);
	
	Элементы.кнТолькоСвои.ЦветФона=?(Календарь.Сотрудник.Пустая(),ЦветНеАктивно,ЦветАктивно);
	Элементы.кнТолькоСвои.ЦветРамки=?(Календарь.Сотрудник.Пустая(),ЦветРамки,ЦветАктивно);
	
	Элементы.кнДень.ЦветФона=ЦветНеАктивно;
	Элементы.кнНеделя.ЦветФона=ЦветНеАктивно;
	Элементы.кнМесяц.ЦветФона=ЦветНеАктивно;
	Элементы.кнДень.ЦветРамки=ЦветРамки;
	Элементы.кнНеделя.ЦветРамки=ЦветРамки;
	Элементы.кнМесяц.ЦветРамки=ЦветРамки;
	
	Элементы.День.Доступность=Истина;
	Элементы.Неделя.Доступность=Истина;
	Элементы.Месяц.Доступность=Истина;
	//Элементы.ПовесткаДня.Доступность=Истина;
	
	Если Календарь.ВидКалендаря=1 Тогда
		Элементы.День.Доступность=Ложь;
		Элементы.кнДень.ЦветФона=ЦветАктивно;
		Элементы.кнДень.ЦветРамки=ЦветАктивно;
	ИначеЕсли Календарь.ВидКалендаря=2 Тогда
		Элементы.Неделя.Доступность=Ложь;
		Элементы.кнНеделя.ЦветФона=ЦветАктивно;
		Элементы.кнНеделя.ЦветРамки=ЦветАктивно;
	ИначеЕсли Календарь.ВидКалендаря=3 Тогда
		Элементы.Месяц.Доступность=Ложь;
		Элементы.кнМесяц.ЦветФона=ЦветАктивно;
		Элементы.кнМесяц.ЦветРамки=ЦветАктивно;
		//Элементы.ПовесткаДня.Доступность=Истина;
	//ИначеЕсли Календарь.ВидКалендаря=4 Тогда
	//	Элементы.ПовесткаДня.Доступность=Ложь;
	КонецЕсли;
КонецФункции	

&НаКлиенте
Процедура СдвинутьПериод(Команда)
	Если Команда.Имя="ПредыдущийПериод" Тогда
		Если Календарь.ВидКалендаря=2 Тогда 
			Сек=Календарь.ДатаКалендаря-НачалоНедели(Календарь.ДатаКалендаря);
			Календарь.ДатаКалендаря=НачалоНедели(НачалоНедели(Календарь.ДатаКалендаря)-1)+Сек;
		ИначеЕсли Календарь.ВидКалендаря=3 Тогда
			Календарь.ДатаКалендаря=ДобавитьМесяц(Календарь.ДатаКалендаря,-1);
		Иначе
			Календарь.ДатаКалендаря=Календарь.ДатаКалендаря-24*3600;
		КонецЕсли;	
	ИначеЕсли Команда.Имя="СледующийПериод" Тогда
		Если Календарь.ВидКалендаря=2 Тогда 
			Сек=Календарь.ДатаКалендаря-НачалоНедели(Календарь.ДатаКалендаря);
			Календарь.ДатаКалендаря=КонецНедели(Календарь.ДатаКалендаря)+1+Сек;
		ИначеЕсли Календарь.ВидКалендаря=3 Тогда
			Календарь.ДатаКалендаря=ДобавитьМесяц(Календарь.ДатаКалендаря,1);
		Иначе
			Календарь.ДатаКалендаря=Календарь.ДатаКалендаря+24*3600;
		КонецЕсли;	
	КонецЕсли;	
	УстановитьПериод();
	ОбновитьКалендарь();
КонецПроцедуры

&НаКлиенте
Процедура кнОтбор(Команда)
	Парам=Новый Структура;
	Парам.Вставить("Сотрудник",Календарь.Сотрудник);
	ОткрытьФорму("Обработка.Renault_КалендарьСобытий.Форма.ФормаОтбора",Парам,ЭтаФорма,УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура кнВыбратьПериод(Команда) ОткрытьФорму("Обработка.Renault_КалендарьСобытий.Форма.ВыборДаты",Новый Структура("Дата",Календарь.ДатаКалендаря),ЭтаФорма) КонецПроцедуры

Процедура УстановитьПериод()
	Обработки.Renault_КалендарьСобытий.УстановитьПериод(Календарь);
	Обработки.Renault_КалендарьСобытий.УстановитьИнтервалРабочегоВремени(Календарь);
	Элементы.кнПериод.Заголовок=Обработки.Renault_КалендарьСобытий.ПериодСтрокой(Календарь);
КонецПроцедуры	

&НаКлиенте
Процедура СтрокаHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка) 
	Если ТекущаяУниверсальнаяДатаВМиллисекундах() - ПрошлыйКликДата > 500 тогда // DMSREN-1307. Обходим двойное срабатываение события при клике в календаре.
		Обработки.Renault_КалендарьСобытий.ОбработкаСобытия(Элемент.Документ,ЭтаФорма, IDK);
	КонецЕсли;
	ПрошлыйКликДата = ТекущаяУниверсальнаяДатаВМиллисекундах();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник) Если ИмяСобытия="ОбновитьСобытия" Тогда ОбновитьКалендарь() КонецЕсли КонецПроцедуры

&НаКлиенте
Процедура кнПриличныйИнтерфейс(Команда)
	Элементы.ГруппаШапкаФормы.Видимость=Истина;
	Элементы.ПаненьКнопок.Видимость=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалСлотаПриИзменении(Элемент) 
	Соответствие=Новый Соответствие;
	Соответствие.Вставить(1,5);
	Соответствие.Вставить(2,10);
	Соответствие.Вставить(3,15);
	Соответствие.Вставить(4,20);
	Соответствие.Вставить(5,30);
	Соответствие.Вставить(6,60);
	Календарь.ИнтервалСлота=Соответствие.Получить(Интервал);
	ЗаголовокИнтервала();
	ОбновитьHTML();
КонецПроцедуры
Процедура ЗаголовокИнтервала() Элементы.Интервал.Заголовок="Интервал "+Календарь.ИнтервалСлота+" мин." КонецПроцедуры

&НаСервере
Функция ИспользуетсяНовыйГрафикОплат()
	Возврат Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ИспользоватьНовыйГрафикОплат;
КонецФункции
