
Процедура ОбменСБухгалтерией() Экспорт
	УзлыОбмена = ПланыОбмена.ОбменСБухгалтерией.Выбрать();
	
	Пока УзлыОбмена.Следующий() Цикл
		Если Не УзлыОбмена.Использовать Тогда
			Продолжить;
		КонецЕсли;	   
		
		Если УзелЗаполненКорректно(УзлыОбмена) Тогда
			ВыполнитьВыгрузкуДанныхПоУзлу(УзлыОбмена);
		КонецЕсли;     
		
	КонецЦикла;
КонецПроцедуры

Процедура ВыполнитьОбменПоДатам(ДатаНачала, ДатаОкончания) Экспорт
	УзлыОбмена = ПланыОбмена.ОбменСБухгалтерией.Выбрать();
	
	Пока УзлыОбмена.Следующий() Цикл
		Если Не УзлыОбмена.Использовать Тогда
			Продолжить;
		КонецЕсли;	   
		
		Если УзелЗаполненКорректно(УзлыОбмена) Тогда
			ВыполнитьВыгрузкуДанныхПоУзлу(УзлыОбмена, ДатаНачала, ДатаОкончания);
		КонецЕсли;     
		
	КонецЦикла;
		
КонецПроцедуры

Процедура ВыполнитьВыгрузкуДанныхПоУзлу(Узел, ДатаНачала = Неопределено, ДатаОкончания = Неопределено) Экспорт 

	Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
		ДатаНачала = НачалоДня(ТекущаяДата()) - 86400; //выгружаем вчерашний день
		ДатаОкончания = КонецДня(ДатаНачала);
	КонецЕсли;
	
	Обработка = Обработки.ВыгрузкаДанныхБП.Создать();
	Обработка.Организации.Очистить();
	нс = Обработка.Организации.Добавить();
	нс.Организация = Узел.Организация;
	нс.Пометка = Истина;
	Обработка.НачалоПериода = ДатаНачала;
	Обработка.КонецПериода = ДатаОкончания;
	Обработка.ВыбОрганизация = Узел.Организация;
	Обработка.ВыбКаталог = Узел.КаталогДляВременныхФайлов; 
	Обработка.ИнициализироватьВидыДокументов();
	Обработка.Выгрузить();      

	мФайлы = НайтиФайлы(Узел.КаталогДляВременныхФайлов, "*"+Узел.Организация.ИНН+"*.xml");
	Если мФайлы.Количество() > 0 Тогда
		стрКоманда = ПолучитьКомандуЗапуска1С(Узел);
		ЗапуститьПриложение(стрКоманда,,Ложь);
	КонецЕсли;
	
КонецПроцедуры

Функция УзелЗаполненКорректно(ПланОбмена)
	Результат = ЗначениеЗаполнено(ПланОбмена.АдресСервера)
				И ЗначениеЗаполнено(ПланОбмена.ИмяБазы)
				И ЗначениеЗаполнено(ПланОбмена.Пользователь)
				И ЗначениеЗаполнено(ПланОбмена.Пароль)
				И ЗначениеЗаполнено(ПланОбмена.ПутьКПлатформе)
				И ЗначениеЗаполнено(ПланОбмена.ПутьКОбработке)
				И ЗначениеЗаполнено(ПланОбмена.Организация)
				И ЗначениеЗаполнено(ПланОбмена.КаталогДляВременныхФайлов);
	
	Возврат Результат;
КонецФункции


Функция ПолучитьКомандуЗапуска1С(ПланОбмена, ПутьКПлатформе = "", ПутьКОбработке = "")
  
	
	ИмяСервера 		= ПланОбмена.АдресСервера;
	ИмяБазы 		= ПланОбмена.ИмяБазы;
	Пользователь 	= ПланОбмена.Пользователь;
	Пароль 			= ПланОбмена.Пароль;
	ПутьКПлатформе	= ПланОбмена.ПутьКПлатформе;
	ПутьКОбработке  = ПланОбмена.ПутьКОбработке;
	
	Если ПутьКПлатформе = "" Тогда
		ПутьКПлатформе = "C:\Program Files (x86)\1cv8\8.3.20.1674\bin\1cv8.exe";
	КонецЕсли;
	Если ПутьКОбработке = "" Тогда
		ПутьКОбработке = "C:\Users\nadtochiy_aa\Desktop\ExchangeAA\Exchange.epf";
	КонецЕсли;
	Шаблон = """%1"" ENTERPRISE /DisableStartupMessages /S ""%2/%3"" /N ""%4""  /P ""%5""  /Execute ""%6""";
	
	Возврат СтрШаблон(Шаблон, ПутьКПлатформе, ИмяСервера, ИмяБазы, Пользователь, Пароль, ПутьКОбработке);
КонецФункции
