&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого Рекв Из Метаданные.Обработки.Renault_АРМ_Автосклад_Упр.ТабличныеЧасти.Объявления.Реквизиты Цикл
		Попытка
			ЭтаФорма[Рекв.Имя] = Параметры[Рекв.Имя]
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура кнЗаписать(Команда)
	
	Ответ = Обработки.Renault_Ext.ExtDMS("upd",ПолучитьЗначение()); 
	Если Ответ = Неопределено Тогда
		Сообщить("Обновление не выполнено", СтатусСообщения.Внимание)
	Иначе
		Сообщить("Обновление выполнено", СтатусСообщения.Информация);
		ВладелецФормы.ОбновитьОпубликованныеVIN();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура кнУдалить(Команда)
	
	Если Вопрос("Удалить объявление?", РежимДиалогаВопрос.ДаНет)<>КодВозвратаДиалога.Да Тогда Возврат КонецЕсли;
	Ответ = Обработки.Renault_Ext.ExtDMS("del",Код); 
	Если Ответ = Неопределено Тогда
		Сообщить("Удаление не выполнено", СтатусСообщения.Внимание)
	Иначе
		Сообщить("Удаление выполнено", СтатусСообщения.Информация);
		ВладелецФормы.ОбновитьОпубликованныеVIN();
	КонецЕсли;
	Закрыть();
	
КонецПроцедуры

Функция ПолучитьЗначение()
	
	РеквизитыФормы = Новый Массив;
	Для Каждого Рекв Из ЭтаФорма.ПолучитьРеквизиты() Цикл
		РеквизитыФормы.Добавить(Рекв.Имя);
	КонецЦикла;
	
	ТЧ = Новый ТаблицаЗначений;
	Стр = ТЧ.Добавить();
	Для Каждого Рекв Из Метаданные.Обработки.Renault_АРМ_Автосклад_Упр.ТабличныеЧасти.Объявления.Реквизиты Цикл
		Если РеквизитыФормы.Найти(Рекв.Имя) = Неопределено Тогда Продолжить КонецЕсли;
		ТЧ.Колонки.Добавить(Рекв.Имя);
		Стр[Рекв.Имя] = СокрЛП(ЭтаФорма[Рекв.Имя])
	КонецЦикла;
	ТЧ.Колонки.Добавить("ДатаПубликации");
	Стр.ДатаПубликации = ТекущаяДата();
	Возврат ТЧ
	
КонецФункции

