//&НаКлиенте
//Процедура ОтправкаФайлаНаСервер()
//                    ДвоичныеДанные=Новый ДвоичныеДанные(ИмяФайла);
//                    АдресВХ = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
//КонецПроцедуры

//&НаСервере
//Процедура ПолучениеФайлаНаСервере(АдресВХ)
//                    ИмяВременногоФайла = ПолучитьИмяВременногоФайла(«xls»);
//                    ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХ);
//                    ДвоичныеДанные.Записать(ИмяВременногоФайла);
//КонецПроцедуры

Процедура ВыгрузитьКоммерческиеЗННаПортал() Экспорт
 	
	//ИмяФайла = "C:\Program Files\CheryServiceDataUploader\DataToSend\file1.txt";
	//ИмяФайлаСРаботами = "C:\Program Files\CheryServiceDataUploader\DataToSend\file2.txt"; 
	
	Дилер = Справочники.Организации.НайтиПоРеквизиту("ИНН","6168069282");
	КодДилера = "6125600";
	
	ГдеСоздавать = КаталогВременныхФайлов();
	ИмяФайла = ГдеСоздавать+"file1.txt";
	ИмяФайлаСРаботами = ГдеСоздавать+"file2.txt";

	//=========================== 1 часть ===
 	
 	ГарантияПроизводителя          = Справочники.ВидыРемонта.ГарантияПроизводителя;
	ГарантияПроизводителяЛКП       = Справочники.ВидыРемонта.ГарантияПроизводителяЛКП;
	ГарантияДистрибьютера          = Справочники.ВидыРемонта.ГарантияДистирибьютера;

	
	СзВидРемонта = Новый СписокЗначений;
 	СзВидРемонта.Добавить(ГарантияПроизводителя);
	СзВидРемонта.Добавить(ГарантияПроизводителяЛКП);
	СзВидРемонта.Добавить(ГарантияДистрибьютера);
 	
	сч = 0;
	
	ВсегоСтрок = Состав.Количество();
	ёё = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	" ";
	
 	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()-24*3600));
	Запрос.УстановитьПараметр("Марка", Справочники.Модели.НайтиПоКоду("ЦБ00003545"));
	Запрос.УстановитьПараметр("Организация", Дилер);
	Запрос.УстановитьПараметр("СзВидРемонта",СзВидРемонта);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	//ТЗ.ВыбратьСтроку();
	
	ЭтотОбъект.РаботыЗН.Загрузить(ТЗ);
	
	ТЗ.Свернуть("Ссылка,Номер,Дата");
	
	ТЗ.Сортировать("Дата,Номер");
	
	ЭтотОбъект.Состав.Загрузить(ТЗ);
	
	Для Каждого Строка Из Состав Цикл
		
		ОбработкаПрерыванияПользователя();
		ёё = ёё + 1;
		Состояние("Обработано "+ёё+" из "+ВсегоСтрок+"; ( "+?(ВсегоСтрок > 0,СокрЛП(Цел(100*ёё/ВсегоСтрок))+"% )",""));
		
		ТекЗН = Строка.Ссылка;
		ТекАвто = ТекЗН.Автомобиль;
		ТекЗаказчик = ТекЗН.Заказчик;
		ТекДатаЗН = ТекЗН.Дата;
		
		Строка.Дилер = Дилер.НаименованиеДляПечати;
		Строка.КодДилера = КодДилера;
		Строка.ФИОВладельца = ТекЗаказчик;
		Строка.ТелефонВладельца = Прав(Строка.ФИОВладельца.ОсновнойТелефон,10);
		Строка.VIN = ТекАвто.VIN;
		Строка.ГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ТекАвто , Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
		Если обЗначениеНеЗаполнено(Строка.ГосНомер) Тогда
			Строка.ГосНомер = "Б/Н";
		КонецЕсли; 
		Строка.Марка = ТекАвто.Модель.Марка;
		Строка.Модель = ТекАвто.Модель;
		Строка.Пробег = ТекЗН.Пробег;
		Если ТекЗаказчик.ФормаСобственности=Перечисления.ФормыСобственности.ЧастноеЛицо ИЛИ ТекЗаказчик.ФормаСобственности=Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
			Строка.ТипВладельца="ФЛ";
		Иначе
			Строка.ТипВладельца="ЮЛ";
		КонецЕсли; 
		Строка.КонтактноеЛицо = ТекЗаказчик;
		Строка.ТелефонКонтактногоЛица = Прав(ТекЗаказчик.ОсновнойТелефон,10);
		Строка.ДатаОбращения = ТекДатаЗН;
		
		Попытка
			Строка.ПричинаОбращения = ТекЗН.Работы[0].Работа;
		Исключение
			Строка.ПричинаОбращения = ТекЗН.ПричинаОбращения;
		КонецПопытки; 
		Строка.ДатаСозданияЗН     = ТекДатаЗН;
		Строка.ДатаНачалаРабот    = ТекДатаЗН;
		Строка.ДатаОкончанияРабот = ТекДатаЗН;
		Строка.ДатаЗакрытия       = ТекДатаЗН;
		
		Строка.ДобраяВоля         = "НЕТ";
		Строка.ТО                 = "НЕТ";
		Строка.СервиснаяКомпания  = "НЕТ";
		Строка.КузовнойРемонт     = "НЕТ";
		Строка.СлесарныйРемонт 	 = "НЕТ";
		Строка.Акция 	         = "НЕТ";
		
		Строка.ТипРемонта="Коммерческий";	
		
		Если ТекЗН.ВидРемонта = ГарантияПроизводителя ИЛИ ТекЗН.ВидРемонта = ГарантияПроизводителяЛКП ИЛИ ТекЗН.ВидРемонта = ГарантияДистрибьютера Тогда
			Строка.ТипРемонта="Гарантийный";	
		КонецЕсли; 
		
	КонецЦикла;
	
	//=========================== 2 часть ===
	
	ТекстЗН = Новый ТекстовыйДокумент; 
	
  	Для каждого Строка Из Состав Цикл
		ТекстЗН.ДобавитьСтроку(Строка.Дилер + ";"+
		Строка.КодДилера + ";"+
		Строка.Артикул + ";"+
		Строка.СвободныйОстаток + ";"+
		Строка.РозничнаяЦена); 
	КонецЦикла;
	
	Попытка
	   	ТекстЗН.Записать(ИмяФайла); 
 	Исключение
		//Сообщить("ОШИБКА! Не удалось записать файл с заголовками заказ-нарядов "+ИмяФайлаСработами);	
	КонецПопытки; 
 	
 
	//=========================== 3 часть ===
	
	Если Состав.Количество() > 0 Тогда
 			
		ДвоичныеДанныеЗН=Новый ДвоичныеДанные(ИмяФайла);
        АдресВХ_ЗН = ПоместитьВоВременноеХранилище(ДвоичныеДанныеЗН);
			
		ДвоичныеДанныеРабот=Новый ДвоичныеДанные(ИмяФайлаСРаботами);
        АдресВХ_Работ = ПоместитьВоВременноеХранилище(ДвоичныеДанныеРабот);

		СМ_CHERY.ВыгрузкаНаПорталЧери(АдресВХ_ЗН,АдресВХ_Работ);	
			
   	КонецЕсли; 
  	 
КонецПроцедуры

 
 