
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
	//Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Если Не НачислениеБалловОтТекущегоНакопления Тогда
		ШкалаНачисленияБаллов.Очистить();
	КонецЕсли; 
	
	Если ШкалаНачисленияБаллов.Количество() = 0 Тогда
		НачислениеБалловОтТекущегоНакопления = Ложь;
	КонецЕсли; 
	
	Если Не ИспользоватьСрокДействияБаллов Тогда
		СрокДействияБаллов 			= 0;
		ПериодичностьДействияБаллов = Неопределено;
	КонецЕсли; 
	
	Если ТипКарты <> Перечисления.DMS_ТипыКартЛояльности.Бонусная Тогда
		
		ПравилаЗаменыДисконтныхКарт.Очистить();
		ПравилаЗаменыБонусныхКарт.Очистить();
		ПравилаВыдачиКарт.Очистить();
		
	ИначеЕсли Не ЭтоНовый() Тогда  
		
		СтрокиУдаления = ПравилаЗаменыБонусныхКарт.НайтиСтроки(Новый Структура("ВидБонуснойКарты",Ссылка));
		                              
		Для каждого СтрокаУдаления Из СтрокиУдаления Цикл
			ПравилаЗаменыБонусныхКарт.Удалить(СтрокаУдаления);		
		КонецЦикла; 
		
	КонецЕсли; 
		
	ИспользоватьРегламентноеЗадание = (Не ПометкаУдаления И ИспользоватьСрокДействияБаллов И ТипКарты = Перечисления.DMS_ТипыКартЛояльности.Бонусная);
	
	Если (Не ИспользоватьСрокДействияБаллов 
		Или ТипКарты <> Перечисления.DMS_ТипыКартЛояльности.Бонусная)
		И Не ПометкаУдаления Тогда
		
		УдалитьРегламентноеЗадание(Отказ);
		
	КонецЕсли; 
	
	ИспользуетсяЗаменаБонусныхКарт   = (ПравилаЗаменыБонусныхКарт.Количество() > 0);
	ИспользуетсяЗаменаДисконтныхКарт = (ПравилаЗаменыДисконтныхКарт.Количество() > 0);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Удаляем регламентное задание при необходимости.
	Если ПометкаУдаления Тогда
		
		УдалитьРегламентноеЗадание(Отказ);
		
	КонецЕсли;
	
	// Обновляем кэш платформы для зачитывания актуальных настроек
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Уровень = 0;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	РегламентноеЗаданиеGUID = "";
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьРегламентноеЗадание(Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если Не ИспользоватьСрокДействияБаллов Тогда
				
		МассивНепроверяемыхРеквизитов.Добавить("СрокДействияБаллов");
		МассивНепроверяемыхРеквизитов.Добавить("ПериодичностьДействияБаллов");
		
	КонецЕсли; 
	
	Для каждого ТекущаяСтрока Из ПравилаЗаменыБонусныхКарт Цикл
	
		Если ТекущаяСтрока.ВидБонуснойКарты.Уровень >= Уровень Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В строке "+Формат(ТекущаяСтрока.НомерСтроки,"ЧЦ=10; ЧН=0; ЧГ=")+" таблицы замены бонусной карты указан вид карты с уровнем >= уровня текущего вида карт";
			Сообщение.Поле = "ПравилаЗаменыБонусныхКарт["+Формат(ТекущаяСтрока.НомерСтроки-1,"ЧЦ=10; ЧН=0; ЧГ=")+"].Количество";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			
			Отказ = Истина;
			
		КонецЕсли; 	
	
	КонецЦикла;
	
	УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

// Процедура удаляет из массива МассивРеквизитов элементы, соответствующие именам 
// реквизитов объекта из массива МассивНепроверяемыхРеквизитов.
// Для использования в обработчиках события ОбработкаПроверкиЗаполнения.
//
// Параметры:
//	МассивРеквизитов              - Массив - массив строк с именами реквизитов объекта.
//	МассивНепроверяемыхРеквизитов - Массив строк с именами реквизитов объекта, не требующих проверки.
//
Процедура УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов) Экспорт
	
	Для Каждого ЭлементМассива Из МассивНепроверяемыхРеквизитов Цикл
	
		ПорядковыйНомер = МассивРеквизитов.Найти(ЭлементМассива);
		Если ПорядковыйНомер <> Неопределено Тогда
			МассивРеквизитов.Удалить(ПорядковыйНомер);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

// Выполняет удаление регламентного задания.
//
// Параметры:
//  Отказ                     - Булево - флаг отказа. Если в процессе выполнения процедуры были обнаружены ошибки,
//                                       то флаг отказа устанавливается в значение Истина.
//  РегламентноеЗаданиеОбъект - объект регламентного задания, которое необходимо удалить.
// 
Процедура УдалитьРегламентноеЗадание(Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Определяем регламентное задание.
	РегламентноеЗаданиеОбъект = НайтиРегламентноеЗаданиеПоПараметру(РегламентноеЗаданиеGUID);
	
	Если РегламентноеЗаданиеОбъект <> Неопределено Тогда
		
		Попытка
			РегламентноеЗаданиеОбъект.Удалить();
		Исключение
			
			СтрокаСообщения = НСтр("ru='Ошибка при удалении регламентного задания: %1';en='Error deleting scheduled tasks: 1%'");
			СтрокаСообщения = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			Сообщить(СтрокаСообщения);
			
			Отказ = Истина;
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

// Находит регламентное задание по GUID.
//
// Параметры:
//  УникальныйНомерЗадания - Строка - строка с GUID регламентного задания.
// 
// Возвращаемое значение:
//  Неопределено        - если поиск регламентного задания по GUID не дал результатов или.
//  РегламентноеЗадание - найденное по GUID регламентное задание.
//
Функция НайтиРегламентноеЗаданиеПоПараметру(Знач УникальныйНомерЗадания) Экспорт
	
	Если ПустаяСтрока(УникальныйНомерЗадания) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(УникальныйНомерЗадания));
	
КонецФункции

#КонецЕсли
