&НаКлиенте
Перем МассивBIR, ФормаДлительнойОперации,
ПеретаскиваемаяСтрока;

/////////////////////////////////////////////////////////////////////События формы///////////////////////////////////////////////////////////////////
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЕстьПравоАдминистратора = Renault_РаботаСПравамиПользователя.ЕстьПравоИспользоватьАрмКонтактЦентрАдминистратор(ПараметрыСеанса.Пользователь);
	ЕстьПравоМенеджера = Renault_РаботаСПравамиПользователя.ЕстьПравоИспользоватьАрмКонтактЦентрМенеджер(ПараметрыСеанса.Пользователь);
	Отказ = НЕ (Renault_РаботаСПравамиПользователя.ЕстьПравоИспользоватьАрмКонтактЦентр(ПараметрыСеанса.Пользователь) И
			(ЕстьПравоАдминистратора ИЛИ ЕстьПравоМенеджера));
	Бренд = ПараметрыСеанса.DMS_Бренд;
	
	Если Бренд <> Справочники.CRM_МаркаАвтомобиля.RENAULT Тогда
		Элементы.кнОткрытьMyRenault.Видимость = Ложь;
		Элементы.кнОткрытьMyRenaultАтрибутыПисьма.Видимость = Ложь;
		Элементы.кнОткрытьMyRenaultЛид.Видимость = Ложь;
    КонецЕсли;
	
	БрендНаименование = Бренд.Наименование;
	Если БрендНаименование <> "" Тогда
		Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[БрендНаименование];
	Иначе
		Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных.RENAULT;
	КонецЕсли;
	
	ПарольWS = Настройки.ПарольДоступаКВебСервисам;
	ЛогинWS = Настройки.ЛогинДоступаКВебСервисам;
	
	ОтборПериод.ДатаНачала = НачалоДня(ТекущаяДата());
	ОтборПериод.ДатаОкончания = КонецДня(ТекущаяДата()); 
	
	Если Отказ тогда
		Сообщить("Пользователь не может работать с онлайн консультантом");
	иначе
		ПараметрыОК = Renault_ОнлайнКонсультант.ПолучитьНастройкиОнлайнКонсультант(Renault_РаботаСПравамиПользователя.ДилерскийЦентрПоУмолчанию(ПараметрыСеанса.Пользователь));
		Если (ПараметрыОК = Неопределено) ИЛИ 
			(ПараметрыОК  = Справочники.Renault_НастройкиОнлайнКонсультанта.ПустаяСсылка())Тогда
			Отказ = Истина;
			Сообщить("Нет настроек подключения к ОнлайнКонсультанту");
		КонецЕсли;
	КонецЕсли;
	
	//Порядок элементов списка должен соответствовать порядку кнопок в подразделе "грКнопкиМеню"
	ПунктыМеню.Добавить("ЧатОбщение");
	ПунктыМеню.Добавить("АтрибутыТрафика");
	ПунктыМеню.Добавить("ЛидРено");
	ПунктыМеню.Добавить("АтрибутыЛида");  	
	ПунктыМеню.Добавить("Письмо");
	ПунктыМеню.Добавить("АтрибутыПисьма");
	ПунктыМеню.Добавить("История");
	ПунктыМеню.Добавить("РабочиеЛисты");
	
	ТекущаяЗакладкаМеню = 0;
	
	ТаблицаСтатусыОформление();
	ТаблицаТрафикаОформление();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НачальноеОформлениеФормы();
	
	СтатусОператора = Ложь;
	
	Если ЕстьПравоАдминистратора Тогда
		ВыборТрафика = 1; 
	Иначе
		Элементы.кнОтобразитьОткрытыйТрафик.Видимость = Ложь;
		ВыборТрафика = 2;
	КонецЕсли;
	
	ПраваПользователя = ПараметрыСеанса.Renault_ПраваПользователя;
	// Изменение системы прав
	НастройкиКонтактЦентра = ПраваПользователя.ПраваИНастройки.КонтактЦентр.Выгрузить();
	
	// Настройка отображения списка
	СтруктураНастроекСписка = Новый Структура;
	ОтображаемыеТипыТрафика = Новый Структура;
	ОтображаемыеТипыТрафика.Вставить("ПоказыватьОК", Истина);
	ОтображаемыеТипыТрафика.Вставить("ПоказыватьПочту", Истина);
	ОтображаемыеТипыТрафика.Вставить("ПоказыватьЛиды", Истина);
	СтруктураНастроекСписка.Вставить("ОтображаемыеТипыТрафика", ОтображаемыеТипыТрафика);
	СтруктураНастроекСписка.Вставить("ВыводитьВсеНеобработанные", Истина);
	
	ПоказыватьУведомления = Ложь;
	ПоказыватьУведомления();
	ДатаПоследнегоСообшения = Неопределено;
	ИдетОбновлениеСпискаТрафика = Ложь;
	
	МассивBIR = Новый Массив;
	НастройкиПодключенияКОнлайнКонсультанту = Renault_ОнлайнКонсультант.ПолучитьПараметрыПоУмолчанию(Renault_КонтактЦентр_Общий.ПолучитьДилерскийЦентрПользователя());
	НастройкиОтправки = Renault_КонтактЦентр_Общий.ПолучитьНастройкиОтправкиКП(ПараметрыСеанса.Пользователь.Сотрудник);
	РассылкаУчетнаяЗапись = НастройкиОтправки.УчетнаяЗапись;
	
	Если ЗначениеЗаполнено(ПараметрыОК.ИмяОператора) Тогда
		НаименованиеОператора = ПараметрыОК.ИмяОператора;
	Иначе
		НаименованиеОператора = "Renault contact center";
	КонецЕсли;
	
	Если Объект.РежимРаботыОбработки = ПредопределенноеЗначение("Перечисление.Renault_ОнлайнКонсультант_РежимыРаботы.ЧатСКлиентом") Тогда
		ВыборТрафика = 2;
		Элементы.кнУстановитьОтделПродаж.Видимость = Ложь;
		Элементы.ТаблицаСтатусы.Видимость = Ложь;
	КонецЕсли;
	
	Если ПраваПользователя.РаботаетОнлайнКонсультант Тогда		
		Отбор = Новый Структура;
		Отбор.Вставить("ВидимостьОбщий", Истина);
		Отбор.Вставить("ТипТрафика", ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.OnlineКонсультант"));
		МассивСтрок = НастройкиКонтактЦентра.НайтиСтроки(Отбор);
		
		Для Каждого Элемент ИЗ МассивСтрок Цикл
			BIR = Renault_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент.ДилерскийЦентр, "BIR");
			Если ЗначениеЗаполнено(BIR) Тогда
				МассивBIR.Добавить(BIR);
			КонецЕсли;
		КонецЦикла;
		
		ПодключитьКонсультант(); 
		МодульОбъектаЗаполнитьНастройкиПодключения(); 
		
		ОбновитьСтатусСотрудника(ПредопределенноеЗначение("Перечисление.Renault_КонтактЦентр_СтатусыСотрудников.online"));		
	КонецЕсли; 
	
	КартинкаЛИД = БиблиотекаКартинок.Renault_lead;
	КартинкаПисьмо = БиблиотекаКартинок.Renault_mail_lead;
	КартинкаЧат = БиблиотекаКартинок.Renault_chat_lead;  
	
	ОтборОтдел = Renault_КонтактЦентр_Общий.ПолучитьОтделАвтосалона();
	ОбновитьСписокСотрудников(ОтборОтдел);
	ОбновитьСписокТрафика();
	ОтметитьТекущийВидТрафика(); 
	ОбновитьЧат(); 
	ПодключитьОбработчикОжидания("ОбновитьСписокТрафика", 5);
	
	//Позиционирование на нужной строке
	Если ЗначениеЗаполнено(Объект.вхИдТрафика) Тогда
		ПредСтрТрафика = ТаблицаТрафика.Найти(Объект.вхИдТрафика, "Идентификатор");
		Если ЗначениеЗаполнено(ПредСтрТрафика) Тогда
			Элементы.ТаблицаТрафика.ТекущаяСтрока = ПредСтрТрафика;
			ТипВыбранногоТрафика = ПредСтрТрафика.ТипТрафика;
			ТекущийДЦ = ПредСтрТрафика.ДилерскийЦентр;
			ВыбранныйКлиент = ПредСтрТрафика.Клиент;
		КонецЕсли;
		ВыбранныйТрафикID = Объект.вхИдТрафика;
		ТаблицаКлиентовВыбор(Неопределено, Неопределено, "", Неопределено);  
	КонецЕсли;
	
	ТаблицаПеренаправленногоТрафика = Новый ТаблицаЗначений;
	ТаблицаПеренаправленногоТрафика.Колонки.Добавить("ИдентификаторТрафика", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(40)));
	ТаблицаПеренаправленногоТрафика.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	
	Вложения = Новый ТаблицаЗначений;
	Вложения.Колонки.Добавить("ИмяФайлаНаКомпьютере");
	
	Если Переключатель = 0 Тогда
		Элементы.кнОтправитьОтветЛида.Видимость = Истина;
		Элементы.кнОтправитьОтветЛидаПоТелефону.Видимость = Ложь;
	Иначе
		Элементы.кнОтправитьОтветЛида.Видимость = Ложь;
		Элементы.кнОтправитьОтветЛидаПоТелефону.Видимость = Истина;
	Конецесли;    	
		
	УправлениеМеню();
	СформироватьЗаголовокФормы();
КонецПроцедуры   

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если ПраваПользователя.РаботаетОнлайнКонсультант Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("ВидимостьОбщий", Истина);
		Отбор.Вставить("ТипТрафика", ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.OnlineКонсультант"));
		МассивСтрок = НастройкиКонтактЦентра.НайтиСтроки(Отбор);
		
		Для Каждого Элемент ИЗ МассивСтрок Цикл
			BIR = Renault_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент.ДилерскийЦентр, "BIR");
			Если ЗначениеЗаполнено(BIR) Тогда
				Попытка
					Renault_ОнлайнКонсультант.ОтключитьКонсультантаВебСервис(BIR);
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
		ОбновитьСтатусСотрудника(ПредопределенноеЗначение("Перечисление.Renault_КонтактЦентр_СтатусыСотрудников.offline"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьЧатОнлайнКонсультанта" Тогда
		ОбновитьЧат();
	КонецЕсли;
КонецПроцедуры

//////////////////////////////////////////////////////////////////////Команды Формы///////////////////////////////////////////////////////////////
&НаКлиенте
Процедура НажатиеКнопкиШапки(Команда)
	ИмяТекущийЭлемент = ТекущийЭлемент.Имя;
	
	Если ИмяТекущийЭлемент = "кнУстановитьОтделПродаж" Тогда
		ВыбратьОтделПродаж(); 		
	ИначеЕсли ИмяТекущийЭлемент = "кнОткрытьНастройки" Тогда
		ОткрытьНастройки();	
	ИначеЕсли ИмяТекущийЭлемент = "кнПоказыватьУведомления" Тогда
		ПоказыватьУведомления();
	ИначеЕсли ИмяТекущийЭлемент = "кнПериодОтбора" Тогда
		ВыбратьПериод();
	ИначеЕсли ИмяТекущийЭлемент = "кнПодключитьОнлайн" Тогда
		ПодключитьОнлайн();
	ИначеЕсли ИмяТекущийЭлемент = "кнОбновитьСписокТрафика" Тогда
		кнОбновитьСписокТрафика();	
	ИначеЕсли ИмяТекущийЭлемент = "кнБлокировки" Тогда
		ОткрытьБлокировки();
	КонецЕсли; 
КонецПроцедуры  

&НаКлиенте
Процедура НажатиеКнопкиМенюСредняяЧасть(Команда)
	ПунктыМенюКоличество = ПунктыМеню.Количество();
	Для Н = 0 По ПунктыМенюКоличество - 1 Цикл
		Если Найти(ТекущийЭлемент.Имя, ПунктыМеню[Н].Значение) > 0 Тогда 
			ТекущаяЗакладкаМеню = Н;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Если ТекущаяЗакладкаМеню = 6 Тогда
		СформироватьИсторию();
	КонецЕсли;
	
	УправлениеМеню(); 
КонецПроцедуры

&НаКлиенте
Процедура НажатиеКнопкиСредняяЧасть(Команда)
	ИмяТекущийЭлемент = ТекущийЭлемент.Имя;
	
	Если ИмяТекущийЭлемент = "кнЗаполнитьЧат" Тогда
		ЗаполнитьЧат();
	ИначеЕсли ИмяТекущийЭлемент = "кнОтправитьВЧат" Тогда
		ОтправитьВЧат();
	ИначеЕсли ИмяТекущийЭлемент = "кнСоздатьРабочийЛист" Тогда
		СоздатьРабочийЛист();
	ИначеЕсли ИмяТекущийЭлемент = "кнЗавершитьРазговор" Тогда
		ЗавершитьРазговор();
	ИначеЕсли ИмяТекущийЭлемент = "кнЧатМенеджер" ИЛИ
		ИмяТекущийЭлемент = "кнЛидМенеджер" ИЛИ 
		ИмяТекущийЭлемент = "кнПисьмоМенеджер" Тогда
		НазначитьНаМенеджера();
	ИначеЕсли ИмяТекущийЭлемент = "кнНеВозвращатьТрафик" Тогда
		НеВозвращатьТрафикНажатие();
	ИначеЕсли ИмяТекущийЭлемент = "кнОткрытьMyRenault" ИЛИ
		ИмяТекущийЭлемент = "кнОткрытьMyRenaultЛид" ИЛИ
		ИмяТекущийЭлемент = "кнОткрытьMyRenaultАтрибутыПисьма" Тогда
		РегистрацияВMyRenault(); 
	ИначеЕсли ИмяТекущийЭлемент = "кнСохранить" Тогда
		СохранитьОтветНаЛидНажатие(); 	
	ИначеЕсли ИмяТекущийЭлемент = "кнСоздатьРЛ" Тогда
		СоздатьРабочийЛистЛид();
	ИначеЕсли ИмяТекущийЭлемент = "кнЗакрытьТрафик" Тогда
		ЗакрытьТрафикЛид();
	ИначеЕсли ИмяТекущийЭлемент = "кнВложения" Тогда
		ВложенияНажатие();
	ИначеЕсли ИмяТекущийЭлемент = "кнЗаполнить" Тогда
		ЗаполнитьЛид(); 
	ИначеЕсли ИмяТекущийЭлемент = "кнОтправитьОтветЛидаПоТелефону" Тогда
	    ОтправитьОтветЛидаПоТелефону();
	ИначеЕсли ИмяТекущийЭлемент = "кнОтправитьОтветЛида" Тогда
		ОтправитьОтветЛида();
	ИначеЕсли ИмяТекущийЭлемент = "кнСохранитьЛид" Тогда
	    СохранитьЛид();
	ИначеЕсли ИмяТекущийЭлемент = "кнЗаполнитьПисьмоПоШаблону" Тогда
	    ЗаполнитьПисьмоПоШаблону();
	ИначеЕсли ИмяТекущийЭлемент = "кнПрикрепитьВложение" Тогда
		ПрикрепитьВложениеНажатие();
	ИначеЕсли ИмяТекущийЭлемент = "кнСоздатьРЛПисьмо" Тогда
	    СоздатьРабочийЛистПисьмо();
	ИначеЕсли ИмяТекущийЭлемент = "кнЗакрытьТрафикПисьмо" Тогда
	    ЗакрытьТрафикПисьмо();
	ИначеЕсли ИмяТекущийЭлемент = "кнОтправитьОтветПисьмо" Тогда
	    ОтправитьОтветПисьмоНажатие();		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура НажатиеКнопкиДобавитьНапоминание(Команда)
	ТекСтрока = Элементы.ТаблицаТрафика.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		ПараметрыФормы = Новый Структура("Наименование, Идентификатор",
			"Напоминание в онлайн консультант", ТекСтрока.Идентификатор);
		
		ОткрытьФорму("Обработка.Renault_СозданиеБыстрогоНапоминания.Форма.ФормаСообщенияУпр", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НажатиеКнопкиОтобразитьЗакрытыйТрафик(Команда)
	ОтобразитьЗакрытыйТрафик();
КонецПроцедуры

&НаКлиенте
Процедура НажатиеКнопкиОтобразитьОткрытыйТрафик(Команда)
	ОтобразитьОткрытыйТрафик();
КонецПроцедуры

&НаКлиенте
Процедура НажатиеКнопкиОтобразитьОткрытыйТрафикМенеджеров(Команда)
	ОтобразитьОткрытыйТрафикМенеджеров();
КонецПроцедуры

////////////////////////////////////////////////////////////////////События элементов формы///////////////////////////////////
&НаКлиенте
Процедура ТаблицаСтатусыПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
	ПеретаскиваемаяСтрока = Строка;  
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТрафикаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ТаблицаТрафика.Количество() > 0 Тогда 		
		Если Элементы.ТаблицаТрафика.ТекущиеДанные <> Неопределено Тогда			
			//Выделили конкретную строку
			Объект.ИдПользователя = Элементы.ТаблицаТрафика.ТекущиеДанные.id_user;
			Клиент = Элементы.ТаблицаТрафика.ТекущиеДанные.Клиент;
			ВыбранныйТрафикID = Элементы.ТаблицаТрафика.ТекущиеДанные.Идентификатор;
			ТипВыбранногоТрафика = Элементы.ТаблицаТрафика.ТекущиеДанные.ТипТрафика;
			ТекущийДЦ = Элементы.ТаблицаТрафика.ТекущиеДанные.ДилерскийЦентр;
			ВыбранныйКлиент = Элементы.ТаблицаТрафика.ТекущиеДанные.Клиент; 			
		Иначе 			
			//Ничего не выделили, возьмем первую (теоретически, такого не может быть)
			Объект.ИдПользователя = ТаблицаТрафика[0].id_user;
			Клиент = ТаблицаТрафика[0].Клиент;
			ВыбранныйТрафикID = ТаблицаТрафика[0].Идентификатор;
			ТипВыбранногоТрафика = ТаблицаТрафика[0].ТипТрафика;
			ТекущийДЦ = ТаблицаТрафика[0].ДилерскийЦентр;
			ВыбранныйКлиент =  ТаблицаТрафика[0].Клиент;    			
		КонецЕсли;
		
		ОбновитьСписокТрафика();  		
		ПрочитатьДанныеКлиента();
		ОбновитьЧат();
		
		Вложения.Очистить();
		
		Элементы.НадписьПисьмоИнфо.Видимость = Ложь;
		Элементы.НадписьЛидИнфо.Видимость = Ложь;  
		
		Элементы.грЛеваяКолонка.Доступность = Истина;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТрафикаОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	Если ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование Тогда
		НазначитьТрафикНаМенеджера(ПараметрыПеретаскивания, ПеретаскиваемаяСтрока); 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаТекстСообщенияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Если ТипВыбранногоТрафика = ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.OnlineКонсультант") И
			ПраваПользователя.РаботаетОнлайнКонсультант Тогда 
		Попытка 			
			Renault_ОнлайнКонсультант.ОтправитьСообщениеКлиентуОКВебСервис(Текст, Объект.ИдПользователя, ТекущаяДата(), ТекущийДЦ);
			
			ЗаписатьСообщениеВременно(ВыбранныйТрафикID, Текст, Объект.ИдПользователя);
			
			СтандартнаяОбработка = Ложь;  
		Исключение
			Предупреждение("Не удалось отправить сообщение");
		КонецПопытки;
		
		ОбновитьЧат(); 		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	НаименованиеПриИзмененииСервер(ВыбранныйТрафикID, Наименование);	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныйПовторныйПриИзменении(Элемент)
	ПервичныйПовторныйИриИзмененииСервер(ВыбранныйТрафикID, ПервичныйПовторный);
КонецПроцедуры

&НаКлиенте
Процедура ИсточникИнформацииПриИзменении(Элемент)
	ИсточникИнформацииПриИзмененииСервер(ВыбранныйТрафикID, ИсточникИнформации);
КонецПроцедуры

&НаКлиенте
Процедура ОтделПриИзменении(Элемент)
	ОтделПриИзмененииСервер(ВыбранныйТрафикID, Отдел);
КонецПроцедуры

&НаКлиенте
Процедура ПервичныйИнтересПриИзменении(Элемент)
	ПервичныйИнтересПриИзмененииСервер(ВыбранныйТрафикID, ПервичныйИнтерес);
КонецПроцедуры

&НаКлиенте
Процедура EmailПриИзменении(Элемент)
	Шаблон = ".+@.+\..+";
	
	RegExp = Новый COMОбъект("VBScript.RegExp");
	RegExp.MultiLine = Ложь;
	RegExp.Global = Истина;
	RegExp.IgnoreCase = Истина;
	RegExp.Pattern = Шаблон;
	
	Если RegExp.Test(Email) ИЛИ Email = "" Тогда
		Если НЕ (Клиент = Неопределено) И НЕ (Клиент = ПредопределенноеЗначение("Справочник.CRM_ПотенциальныеКонтрагенты.ПустаяСсылка")) Тогда
			Renault_УправлениеКонтактнойИнформацией.ЗаписатьОсновнойEmailКлиента(Email, Клиент);
		КонецЕсли;
	Иначе 		
		Сообщить("Некорректный адрес E-Mail");
		
		ЭтаФорма.ТекущийЭлемент = Элементы.Email;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТелефонПриИзменении(Элемент)
	Если НЕ (Клиент = Неопределено) И 
		НЕ (Клиент = ПредопределенноеЗначение("Справочник.CRM_ПотенциальныеКонтрагенты.ПустаяСсылка")) Тогда
		Renault_УправлениеКонтактнойИнформацией.ЗаписатьОсновнойТелефонКлиента(Телефон, Клиент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПереключательПриИзменении(Элемент)
	Если Переключатель = 0 Тогда
		Элементы.кнОтправитьОтветЛида.Видимость = Истина;
		Элементы.кнОтправитьОтветЛидаПоТелефону.Видимость = Ложь;
	Иначе
		Элементы.кнОтправитьОтветЛида.Видимость = Ложь;
		Элементы.кнОтправитьОтветЛидаПоТелефону.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МенеджерПисьмоПриИзменении(Элемент)
	МенеджерПисьмоПриИзмененииСервер(ВыбранныйТрафикID, Менеджер, Отдел);
КонецПроцедуры

&НаКлиенте
Процедура ТЗРабочиеЛистыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Не(Элемент.ТекущиеДанные = Неопределено) Тогда
		СтандартнаяОбработка = Ложь;
		Запись = Renault_КонтактЦентр_Общий.ПолучитьЗаписьРЛПоIDK(Элемент.ТекущиеДанные.IDK);
		Форма = Запись.ПолучитьФорму("ФормаЗаписи");
		
		Если Форма.Открыта() тогда
			Форма.Активизировать();
		Иначе
			Форма.Открыть();
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

////////////////////////////////////////////////////////////////Разные процедуры и функции///////////////////////////////////////////////////
&НаКлиенте
Процедура СформироватьИсторию()
	ИсторияТекст = "";
	Если ТипВыбранногоТрафика = ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.ЛидRenault")
		ИЛИ ТипВыбранногоТрафика = ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.Email") Тогда
		ИсторияТекст = СформироватьТекстПоляИсторияТекст(ВыбранныйТрафикID, НаименованиеОператора);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьТекстПоляИсторияТекст(ИД, НаименованиеОператора)
	ОбработкаОК = Обработки.Renault_АРМ_ОнлайнКонсультант.Создать();
	
	ТекстПоля = ЗаполнитьШапкуПоляЧата(ОбработкаОК);
	Табл = ОбработкаОК.ПолучитьИсториюПоЛиду(ИД);
	ПредыдущаяДатаСообщения = Дата(1,1,1,0,0,0);
	ПредыдущийВывод = "-1";
	НачатаТаблица = Ложь;
	
	Для Каждого Выборка Из Табл Цикл  		
		Если Выборка.ВидСообщения = 1 Тогда
			//Сообщение отправил клиент
			СтрокаЧата = СформироватьСтрокуШтмлСообщенияЛиды(ОбработкаОК, ПредыдущаяДатаСообщения, ПредыдущийВывод, НачатаТаблица, Выборка, Ложь, НаименованиеОператора);
		Иначе	//Сообщение отправил оператор
			СтрокаЧата = СформироватьСтрокуШтмлСообщенияЛиды(ОбработкаОК, ПредыдущаяДатаСообщения, ПредыдущийВывод, НачатаТаблица, Выборка, Истина, НаименованиеОператора);
		КонецЕсли;
		ТекстПоля = ТекстПоля + СтрокаЧата;
	КонецЦикла;
	
	Если НачатаТаблица Тогда
		ОбработкаОК.ДобавитьТэгШтмл(ТекстПоля, "/TBODY", 3);
		ОбработкаОК.ДобавитьТэгШтмл(ТекстПоля, "/TABLE", 2);
	КонецЕсли;
	
	ОбработкаОК.ДобавитьТэгШтмл(ТекстПоля, "/BODY", 1);
	ОбработкаОК.ДобавитьТэгШтмл(ТекстПоля, "/HTML", 0);
	
	Возврат ТекстПоля;	
КонецФункции

&НаКлиенте
Процедура ОтправитьОтветПисьмоНажатие()
	Если ТипВыбранногоТрафика = ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.Email") Тогда
		Если ЗначениеЗаполнено(ОтветПисьмо) Тогда
			ОтправкаУспешна = Ложь;
			
			ДанныеОФайлах = Новый Массив;
			Для Каждого Вложение ИЗ Вложения Цикл
				Файл = Новый Файл(Вложение.ИмяФайлаНаКомпьютере);
				Расширение = Сред(Файл.Расширение, 2);
				Данные = Новый ДвоичныеДанные(Вложение.ИмяФайлаНаКомпьютере);
				
				ДанныеОФайлахСтрока = Новый Структура("Данные, Расширение", Данные, Расширение);
				ДанныеОФайлах.Добавить(ДанныеОФайлахСтрока);
			КонецЦикла;
			
			ОтправкаУспешна = ПолучитьЗначениеОтправкиПочта(ДанныеОФайлах, ВыбранныйТрафикID, ОтветПисьмо, ЯщикОтправки);		
			
			Если ОтправкаУспешна Тогда
				Элементы.НадписьОтветПисьмо.Заголовок = "Ответ: Ответ отправлен";
			Иначе
				Предупреждение("Не удалось отправить сообщение");
				Возврат;
			КонецЕсли;
			
			ЗаписатьОтветВТрафик(ВыбранныйТрафикID, ОтветПисьмо, ОтправкаУспешна);
			
			ОтветПисьмо = "";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеОтправкиПочта(ДанныеОФайлах, Ид, ОтветПисьмо, ЯщикОтправки)
	ТаблицаВложений = Новый ТаблицаЗначений;
	ТаблицаВложений.Колонки.Добавить("Данные");
	ТаблицаВложений.Колонки.Добавить("Расширение");
	Для Каждого СтрокаДанныеОФайлах ИЗ ДанныеОФайлах Цикл
		НоваяСтрокаВложения = ТаблицаВложений.Добавить();
		НоваяСтрокаВложения.Данные = СтрокаДанныеОФайлах.Данные;
		НоваяСтрокаВложения.Расширение = СтрокаДанныеОФайлах.Расширение;
	КонецЦикла;
	
	ОтправкаУспешна = Renault_ОнлайнКонсультант.ОтправитьПисьмоКлиентуОКВебСервис(ОтветПисьмо, Ид, ТаблицаВложений, ЯщикОтправки);

	Возврат ОтправкаУспешна;
КонецФункции

&НаКлиенте
Процедура ЗакрытьТрафикПисьмо()
	Если НЕ ТрафикЛМТПочтаОтвеченный(ВыбранныйТрафикID) Тогда 		
		ОпОповещения = Новый ОписаниеОповещения("ЗакрытьТрафикПисьмоЗавершение", ЭтаФорма);
		ОткрытьФорму("Справочник.Renault_РезультатОбработки.Форма.ФормаВыбораУпр",, ЭтаФорма,,,, ОпОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе		
		ЗакрытьТрафик(ВыбранныйТрафикID, ПредопределенноеЗначение("Справочник.Renault_РезультатОбработки.ОтветОтправлен"), ТипВыбранногоТрафика);
		
		НачальноеОтображаениеЧатаИДанныхКлиента();
	КонецЕсли;
	
	ОбновитьСписокТрафика(); 
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьТрафикПисьмоЗавершение(ВыбранноеЗначение, ДопПараметры) Экспорт
	Если ВыбранноеЗначение = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.Renault_РезультатОбработки.ОтветОтправлен") Тогда
		Если НЕ ТрафикЛМТПочтаОтвеченный(ВыбранныйТрафикID) Тогда
			Сообщить("Необходим ответ на лид/письмо");
			Возврат;
		КонецЕсли;
	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.Renault_РезультатОбработки.ПомеченКакСпам") Тогда
		Если НЕ ЗначениеЗаполнено(Email) Тогда
			Сообщить("У клиента отсутсвует электронная почта");
			Возврат;
		КонецЕсли;
		
		ЗаписатьЗаблокированныйТрафик(ВыбранныйТрафикID, Email);
	КонецЕсли;
	
	ЗакрытьТрафик(ВыбранныйТрафикID, ВыбранноеЗначение, ТипВыбранногоТрафика);
	
	НачальноеОтображаениеЧатаИДанныхКлиента();
	
	ОбновитьСписокТрафика();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРабочийЛистПисьмо()
	Если НЕ ТрафикЛМТПочтаОтвеченный(ВыбранныйТрафикID) Тогда
		Сообщить("Создание рабочего листа возможно только после отправки ответа");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Менеджер) Тогда
		Сообщить("Создание рабочего листа возможно после выбора менеджера");
		Возврат;
	КонецЕсли;
	
	Если РабочийЛистСуществует(ВыбранныйТрафикID) Тогда
		Сообщить("По данному трафику уже существует рабочий лист");
		Возврат;
	КонецЕсли;
	
	РЛ = Renault_КонтактЦентр_Общий.СоздатьРабочийЛистПоТрафику(ВыбранныйТрафикID);
	Если Не(РЛ = Неопределено) Тогда 
		Форм = РЛ.ПолучитьФорму("ФормаЗаписи", , "ФормаЗаписи" + Строка(РЛ.IDK));
		Если Форм.Открыта() Тогда
			Форм.Активизировать();
		Иначе
			Форм.Открыть();
		КонецЕсли;
		
		ЗакрытьТрафик(ВыбранныйТрафикID, ПредопределенноеЗначение("Справочник.Renault_РезультатОбработки.СозданРабочийЛист"), ТипВыбранногоТрафика);
		
		НачальноеОтображаениеЧатаИДанныхКлиента();
		
		ОбновитьСписокТрафика();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьВложениеНажатие()
	ДанныеДляЗаполнения = Новый Массив();
	
	Для Каждого Стр Из Вложения Цикл
		ДанныеДляЗаполнения.Добавить(Стр.ИмяФайлаНаКомпьютере);	
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура("ДанныеДляЗаполнения", ДанныеДляЗаполнения);
	ОпОповещения = Новый ОписаниеОповещения("ПрикрепитьВложениеНажатиеЗавершение", ЭтаФорма);
	ОткрытьФорму("Обработка.Renault_АРМ_ОнлайнКонсультант.Форма.ФормаВложенийУпр", ПараметрыФормы, ЭтаФорма,,,, ОпОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьВложениеНажатиеЗавершение(ДанныеОВложениях, ДопНастройки) Экспорт
	Если ДанныеОВложениях = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Вложения.Очистить();
	
	Для Каждого Эл Из ДанныеОВложениях Цикл
		Стр = Вложения.Добавить();
		Стр.ИмяФайлаНаКомпьютере = Эл; 
	КонецЦикла;	
	
	Если Вложения.Количество() <> 0 Тогда
		Элементы.НадписьПисьмоИнфо.Видимость = Истина;
	Иначе
		Элементы.НадписьПисьмоИнфо.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПисьмоПоШаблону()
	ОпОповещения = Новый ОписаниеОповещения("ЗаполнитьПисьмоПоШаблонуЗавершение", ЭтаФорма);
	ОткрытьФорму("Справочник.Renault_ШаблоныОтветов.Форма.ФормаВыбораУпр",, ЭтаФорма,,,, ОпОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПисьмоПоШаблонуЗавершение(ВыбранноеЗначение, ДопПараметры) Экспорт
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипВыбранногоТрафика = ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.ЛидRenault") Тогда
		ОтветЛиду = ЗаполнитьПоШаблону(ВыбранноеЗначение.ШаблонОтвета);
		ТемаПисьма = ВыбранноеЗначение.ШаблонЗаголовка;
	ИначеЕсли ТипВыбранногоТрафика = ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.Email") Тогда
		ОтветПисьмо = ЗаполнитьПоШаблону(ВыбранноеЗначение.ШаблонОтвета);
		ТемаПисьма = ВыбранноеЗначение.ШаблонЗаголовка;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьЛид()
	ДанныеДляСохранения = Новый Структура();
	ДанныеДляСохранения.Вставить("ВыбранныйТрафикID", ВыбранныйТрафикID);
	ДанныеДляСохранения.Вставить("ЛидVIN", ЛидVIN);
	ДанныеДляСохранения.Вставить("ЛидМодель", ЛидМодель);
	ДанныеДляСохранения.Вставить("ЛидПробег", ЛидПробег);
	ДанныеДляСохранения.Вставить("ЛидТипДвигателя", ЛидТипДвигателя);
	ДанныеДляСохранения.Вставить("Комментарий", Комментарий);
	ДанныеДляСохранения.Вставить("ЛидИсточник", ЛидИсточник);
	ДанныеДляСохранения.Вставить("ЛидАдрес", ЛидАдрес);
	ДанныеДляСохранения.Вставить("ЛидГород", ЛидГород);
	ДанныеДляСохранения.Вставить("ЛидСообщение", ЛидСообщение);

	СохранитьЛидСервер(ДанныеДляСохранения);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьЛидСервер(ДанныеДляСохранения)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_Лид.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Renault_Лид КАК Renault_Лид
	|ГДЕ
	|	Renault_Лид.Проведен
	|	И Renault_Лид.ТрафикИД = &ИД";
	Запрос.УстановитьПараметр("ИД", ДанныеДляСохранения.ВыбранныйТрафикID);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ОбъектДок = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектДок.VIN = ДанныеДляСохранения.ЛидVIN;
		ОбъектДок.Модель = ДанныеДляСохранения.ЛидМодель;
		ОбъектДок.Пробег = ДанныеДляСохранения.ЛидПробег;
		ОбъектДок.Мотор = ДанныеДляСохранения.ЛидТипДвигателя;
		ОбъектДок.Комментарий = ДанныеДляСохранения.Комментарий;
		ОбъектДок.ИсточникИнформации = ДанныеДляСохранения.ЛидИсточник;
		ОбъектДок.Адрес = ДанныеДляСохранения.ЛидАдрес;
		ОбъектДок.Город = ДанныеДляСохранения.ЛидГород;
		ОбъектДок.Сообщение = ДанныеДляСохранения.ЛидСообщение;
		ОбъектДок.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОтветЛида()
	Если ТипВыбранногоТрафика = ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.ЛидRenault") Тогда
		Если ЗначениеЗаполнено(ОтветЛиду) Тогда
			ОтправкаУспешна = Ложь;
			ЕмаилКлиента = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(ВыбранныйКлиент);
			Если ЗначениеЗаполнено(ЕмаилКлиента) Тогда
				Попытка
					ДанныеОФайлах = Новый Массив;
					Для Каждого Вложение ИЗ Вложения Цикл
						Файл = Новый Файл(Вложение.ИмяФайлаНаКомпьютере);
						Расширение = Сред(Файл.Расширение, 2);
						Данные = Новый ДвоичныеДанные(Вложение.ИмяФайлаНаКомпьютере);
						
						ДанныеОФайлахСтрока = Новый Структура("Данные, Расширение", Данные, Расширение);
						ДанныеОФайлах.Добавить(ДанныеОФайлахСтрока);
					КонецЦикла;

					ОтправкаУспешна = ПолучитьЗначениеОтправки(ДанныеОФайлах, ВыбранныйТрафикID, ОтветЛиду, ЕмаилКлиента, ТемаПисьма, ЯщикОтправки); 					
				Исключение
					ОтправкаУспешна = ПраваПользователя.РазрешитьФиктивнуюОтправку;
				КонецПопытки;
				
				Если ОтправкаУспешна Тогда
					Элементы.НадписьОтветОтправлен.Заголовок = "Ответ: Ответ отправлен";
				Иначе
					Предупреждение("Не удалось отправить сообщение!");
					Возврат;
				КонецЕсли;
				
				ЗаписатьОтветВТрафик(ВыбранныйТрафикID, ОтветЛиду, ?(ПраваПользователя.РазрешитьФиктивнуюОтправку, Истина, ОтправкаУспешна));
				
				Если ОтправкаУспешна Тогда
					ОтветЛиду = "";
				КонецЕсли;
				
				ОбновитьСписокТрафика();
				
				ОбновитьЧат(); 
			Иначе
				Предупреждение("Не указан потчтовый адрес клиента!");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеОтправки(ДанныеОФайлах, Ид, ОтветЛиду, ЕмаилКлиента, ТемаПисьма, ЯщикОтправки)
	ТаблицаВложений = Новый ТаблицаЗначений;
	ТаблицаВложений.Колонки.Добавить("Данные");
	ТаблицаВложений.Колонки.Добавить("Расширение");
	Для Каждого СтрокаДанныеОФайлах ИЗ ДанныеОФайлах Цикл
		НоваяСтрокаВложения = ТаблицаВложений.Добавить();
		НоваяСтрокаВложения.Данные = СтрокаДанныеОФайлах.Данные;
		НоваяСтрокаВложения.Расширение = СтрокаДанныеОФайлах.Расширение;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_Лид.НомерЛида КАК НомерЛида,
	               |	Renault_Лид.ДилерскийЦентр.Бир_ЛМТ КАК Бир_ЛМТ
	               |ИЗ
	               |	Документ.Renault_Лид КАК Renault_Лид
	               |ГДЕ
	               |	Renault_Лид.ТрафикИД = &ТрафикИД";
				   Запрос.УстановитьПараметр("ТрафикИД", Ид);
	Результат = Запрос.Выполнить();
	
	ДопПараметры = Новый Структура;
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ДопПараметры.Вставить("НомерЛида", Выборка.НомерЛида);
		ДопПараметры.Вставить("BIR_LMT", Выборка.Бир_ЛМТ);
	Иначе
		ДопПараметры.Вставить("НомерЛида", "");
		ДопПараметры.Вставить("BIR_LMT", "");
	КонецЕсли;
	
	ДопПараметры.Вставить("Сотрудник", Строка(ПараметрыСеанса.Пользователь.Сотрудник));
	
	ОтправкаУспешна = Renault_ОнлайнКонсультант.ОтправитьОтветНаЛидВебСервис(ОтветЛиду, Ид, ЕмаилКлиента, ТемаПисьма, ТаблицаВложений, ДопПараметры, ЯщикОтправки.АдресПочтовогоЯщика);
	
	Возврат ОтправкаУспешна;
КонецФункции

&НаКлиенте
Процедура ОтправитьОтветЛидаПоТелефону()
	Если ТипВыбранногоТрафика = ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.ЛидRenault") Тогда
		Если ЗначениеЗаполнено(ОтветЛиду) Тогда
			ЗаписатьОтветВТрафик(ВыбранныйТрафикID, ОтветЛиду, Истина, 5);      
			
			ОтветЛиду = "";
			
			ОбновитьСписокТрафика();
			
			ОбновитьЧат();
		КонецЕсли;
	КонецЕсли; 	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьОтветВТрафик(Ид, Текст, ОбработкаТрафика = Истина, вхВидСообщения = 2)
	ОбработкаОК = Обработки.Renault_АРМ_ОнлайнКонсультант.Создать();
	ОбработкаОК.ЗаписатьОтветВТрафик(Ид, Текст, ОбработкаТрафика, вхВидСообщения);
	ОбработкаОК.ОтметитьТрафикЛМТПочтаОтвеченным(Ид);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЛид()
	ОпОповещения = Новый ОписаниеОповещения("ЗаполнитьЛидЗавершение", ЭтаФорма);
	ОткрытьФорму("Справочник.Renault_ШаблоныОтветов.Форма.ФормаВыбораУпр",, ЭтаФорма,,,, ОпОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЛидЗавершение(ВыбранноеЗначение, ДопПараметры) Экспорт
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипВыбранногоТрафика = ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.ЛидRenault") Тогда
		ОтветЛиду = ЗаполнитьПоШаблону(ВыбранноеЗначение.ШаблонОтвета);  
		ТемаПисьма = ВыбранноеЗначение.ШаблонЗаголовка;
	ИначеЕсли ТипВыбранногоТрафика = ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.Email") Тогда
		ОтветПисьмо = ЗаполнитьПоШаблону(ВыбранноеЗначение.ШаблонОтвета);
		ТемаПисьма = ВыбранноеЗначение.ШаблонЗаголовка;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьПоШаблону(СтрокаШаблона)
	ПараметрыШаблона = ПолучитьЗначенияПараметров();   
	Ответ = СтрокаШаблона;
	
	Для Каждого Пар из ПараметрыШаблона Цикл
		Ответ = СтрЗаменить(Ответ, Пар.Представление, Пар.Значение);
	КонецЦикла;
	
	Возврат Ответ;
КонецФункции

&НаКлиенте
Функция ПолучитьЗначенияПараметров()
	
	ПараметрыШаблона = Новый СписокЗначений();
	Если ЗначениеЗаполнено(Клиент) Тогда
		ПараметрыШаблона.Добавить(Клиент.Наименование, "{Клиент}");
	Иначе
		ПараметрыШаблона.Добавить("клиент", "{Клиент}");
	КонецЕсли;
	
	ДЦ = Renault_КонтактЦентр_Общий.ПолучитьДилерскийЦентрПользователя();
	ДЦРеквизиты = Renault_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДЦ, "Организация, Наименование");
	
	Если ЗначениеЗаполнено(ДЦ) Тогда
		ПараметрыШаблона.Добавить(ДЦРеквизиты.Наименование, "{Дилер}");
		Если ЗначениеЗаполнено(ДЦРеквизиты.Организация) Тогда
			Мен = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
			Мен.Вид = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресФактический");
			Мен.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес");
			Мен.Объект = ДЦРеквизиты.Организация;
			Мен.Прочитать();
			Если Мен.Выбран() Тогда
				ПараметрыШаблона.Добавить(Мен.Поле4, "{Город}");
			Иначе
				ПараметрыШаблона.Добавить(" ", "{Город}");
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		ПараметрыШаблона.Добавить(" ", "{Дилер}");
		ПараметрыШаблона.Добавить(" ", "{Город}");
	КонецЕсли;
	
	МенеджерНаименование = Renault_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Менеджер, "Наименование");
	Сотрудник = Renault_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыСеанса.Пользователь, "Сотрудник");
	СотрудникНаименование = Renault_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "Наименование");

	Если ЗначениеЗаполнено(Менеджер) ИЛИ ЗначениеЗаполнено(Сотрудник) Тогда
		ПараметрыШаблона.Добавить(?(ЗначениеЗаполнено(Менеджер), МенеджерНаименование, СотрудникНаименование), "{Менеджер}");
		ПараметрыШаблона.Добавить(Renault_КонтактЦентр_Общий.ПолучитьТелефонКлиент(?(ЗначениеЗаполнено(Менеджер), Менеджер, Сотрудник)), "{Телефон}");
		ПараметрыШаблона.Добавить(Renault_КонтактЦентр_Общий.ПолучитьЕмаилКлиент(?(ЗначениеЗаполнено(Менеджер), Менеджер, Сотрудник)), "{Телефон}");
	Иначе
		ПараметрыШаблона.Добавить(" ", "{Менеджер}");
		ПараметрыШаблона.Добавить(" ", "{Телефон}");
		ПараметрыШаблона.Добавить(" ", "{Емаил}");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЛидМодель) Тогда
		ПараметрыШаблона.Добавить(ЛидМодель, "{Модель}");
	Иначе
		ПараметрыШаблона.Добавить(" ", "{Модель}");
	КонецЕсли;
	
	Возврат ПараметрыШаблона; 	
КонецФункции

&НаКлиенте
Процедура ВложенияНажатие()
	ДанныеДляЗаполнения = Новый Массив();
	
	Для Каждого Стр Из Вложения Цикл
		ДанныеДляЗаполнения.Добавить(Стр.ИмяФайлаНаКомпьютере);	
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура("ДанныеДляЗаполнения", ДанныеДляЗаполнения);
	ОпОповещения = Новый ОписаниеОповещения("ВложенияНажатиеЗавершение", ЭтаФорма);
	ОткрытьФорму("Обработка.Renault_АРМ_ОнлайнКонсультант.Форма.ФормаВложенийУпр", ПараметрыФормы, ЭтаФорма,,,, ОпОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВложенияНажатиеЗавершение(ДанныеОВложениях, ДопПараметры) Экспорт
	Если ДанныеОВложениях = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Вложения.Очистить();
	
	Для Каждого Эл Из ДанныеОВложениях Цикл
		Стр = Вложения.Добавить();
		Стр.ИмяФайлаНаКомпьютере = Эл; 
	КонецЦикла;	
	
	Если Вложения.Количество() <> 0 Тогда
		Элементы.НадписьЛидИнфо.Видимость = Истина;
	Иначе
		Элементы.НадписьЛидИнфо.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьТрафикЛид()
	 Если НЕ ТрафикЛМТПочтаОтвеченный(ВыбранныйТрафикID) Тогда   		
		ОпОповещения = Новый ОписаниеОповещения("ЗакрытьТрафикЛидЗавершение", ЭтаФорма);
		ОткрытьФорму("Справочник.Renault_РезультатОбработки.Форма.ФормаВыбораУпр",, ЭтаФорма,,,, ОпОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе  		
		ЗакрытьТрафик(ВыбранныйТрафикID, ПредопределенноеЗначение("Справочник.Renault_РезультатОбработки.ОтветОтправлен"), ТипВыбранногоТрафика);
		
		НачальноеОтображаениеЧатаИДанныхКлиента();
		
		ОбновитьСписокТрафика();
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьТрафикЛидЗавершение(ВыбранноеЗначение, ДопПараметры) Экспорт
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.Renault_РезультатОбработки.ОтветОтправлен") Тогда
		Если НЕ ТрафикЛМТПочтаОтвеченный(ВыбранныйТрафикID) Тогда
			Сообщить("Необходим ответ на лид/письмо");
			Возврат; 
		КонецЕсли;
	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.Renault_РезультатОбработки.ПомеченКакСпам") Тогда
		Если НЕ ЗначениеЗаполнено(Email) Тогда
			Сообщить("У клиента отсутсвует электронная почта");
			Возврат;
		КонецЕсли;
		
		ЗаписатьЗаблокированныйТрафик(ВыбранныйТрафикID, Email);
	КонецЕсли; 	
	
	ЗакрытьТрафик(ВыбранныйТрафикID, ВыбранноеЗначение, ТипВыбранногоТрафика);
	
	НачальноеОтображаениеЧатаИДанныхКлиента();	

	ОбновитьСписокТрафика();  
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьЗаблокированныйТрафик(ВыбранныйТрафикID, Email)
	Мен = РегистрыСведений.Renault_ЗаблокированныйТрафик.СоздатьМенеджерЗаписи();
	Мен.Идентификатор = Новый УникальныйИдентификатор;
	Мен.IDТрафика = ВыбранныйТрафикID;
	Мен.ЭлектронныйАдрес = Email;
	Мен.ПризнакБлокировки = 1;
	Мен.Записать();	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРабочийЛистЛид()
	Если НЕ ТрафикЛМТПочтаОтвеченный(ВыбранныйТрафикID) Тогда   //!1
		Сообщить("Создание рабочего листа возможно только после отправки ответа");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Менеджер) Тогда
		Сообщить("Создание рабочего листа возможно после выбора менеджера"); Возврат;
	КонецЕсли;
	
	Если РабочийЛистСуществует(ВыбранныйТрафикID) Тогда
		Сообщить("По данному трафику уже существует рабочий лист");
		Возврат;
	КонецЕсли;
	
	РЛ = Renault_КонтактЦентр_Общий.СоздатьРабочийЛистПоТрафику(ВыбранныйТрафикID);
	Если НЕ (РЛ = Неопределено) Тогда 
		Форм = РЛ.ПолучитьФорму("ФормаЗаписи", , "ФормаЗаписи" + Строка(РЛ.IDK));
		Если Форм.Открыта() Тогда
			Форм.Активизировать();
		Иначе
			Форм.Открыть();
		КонецЕсли;	
		          
		ЗакрытьТрафик(ВыбранныйТрафикID, ПредопределенноеЗначение("Справочник.Renault_РезультатОбработки.СозданРабочийЛист"), ТипВыбранногоТрафика);
		
		НачальноеОтображаениеЧатаИДанныхКлиента();
		
		ОбновитьСписокТрафика();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТрафикЛМТПочтаОтвеченный(ВыбранныйТрафикID)
	ОбработкаОК = Обработки.Renault_АРМ_ОнлайнКонсультант.Создать();
	Возврат ОбработкаОК.ТрафикЛМТПочтаОтвеченный(ВыбранныйТрафикID);
КонецФункции

&НаКлиенте
Процедура СохранитьОтветНаЛидНажатие()
	СохранитьОтветНаЛид(ВыбранныйТрафикID, ОтветЛиду);	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьОтветНаЛид(Ид, ТекстОтвета) Экспорт
	Менеджер = РегистрыСведений.Renault_ОтветыНаЛиды.СоздатьМенеджерЗаписи();
	Менеджер.ДатаОтвета = ТекущаяДата();
	Менеджер.ИдТрафика = Ид;
	Менеджер.Ответ = ТекстОтвета;
	Менеджер.ВидСообщения = 10;
	Менеджер.Записать();
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияВMyRenault()
	Renault_КонтактЦентр_Общий.РегистрацияВMyRenault(Клиент, Неопределено, Неопределено, Неопределено); 
КонецПроцедуры

&НаКлиенте
Процедура НеВозвращатьТрафикНажатие()
	НеВозвращатьТрафик = НЕ НеВозвращатьТрафик;
	
	Если НеВозвращатьТрафик Тогда
		Элементы.кнНеВозвращатьТрафик.ЦветФона = ЦветАктив;
		Элементы.кнНеВозвращатьТрафик.Картинка = БиблиотекаКартинок.Renault_Confirm_Square;
	Иначе
		Элементы.кнНеВозвращатьТрафик.ЦветФона = ЦветСерый;
		Элементы.кнНеВозвращатьТрафик.Картинка = БиблиотекаКартинок.Renault_Square_NEw;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьНаМенеджера()
	Если НЕ (ВыбранныйТрафикID = Неопределено) Тогда    		
		Если ТипВыбранногоТрафика = ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.OnlineКонсультант") Тогда
			Запись = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ВыбранныйТрафикID);

			ПараметрыФормы = Новый Структура("ДилерскийЦентр, ВидСообщения", Запись.ДилерскийЦентр, ПредопределенноеЗначение("Справочник.Renault_ВидСообщения.ОК_НовоеСообщение"));
			ОпОповещения = Новый ОписаниеОповещения("НазначитьНаМенеджераЗавершение", ЭтаФорма);
			ОткрытьФорму("Обработка.Renault_АРМ_ОнлайнКонсультант.Форма.ФормаВыбораСотрудникаУпр", ПараметрыФормы, ЭтаФорма,,,, ОпОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ИначеЕсли ТипВыбранногоТрафика = ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.ЛидRenault")
			ИЛИ ТипВыбранногоТрафика = ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.Email") Тогда
			Запись = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ВыбранныйТрафикID);
		
			Если ТипВыбранногоТрафика = ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.ЛидRenault") Тогда
				ВидСообщения = ПредопределенноеЗначение("Справочник.Renault_ВидСообщения.КЦ_НовыйЛид");
			Иначе
				ВидСообщения = ПредопределенноеЗначение("Справочник.Renault_ВидСообщения.КЦ_НовоеПисьмо");
			КонецЕсли;
			
			ПараметрыФормы = Новый Структура("ДилерскийЦентр, ВидСообщения", Запись.ДилерскийЦентр, ВидСообщения);
			ОпОповещения = Новый ОписаниеОповещения("НазначитьНаМенеджераЗавершение", ЭтаФорма);
			ОткрытьФорму("Обработка.Renault_АРМ_ОнлайнКонсультант.Форма.ФормаВыбораСотрудникаУпр", ПараметрыФормы, ЭтаФорма,,,, ОпОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьНаМенеджераЗавершение(ВыбранныйМенеджер, ДопПараметры) Экспорт
	Если ТипВыбранногоТрафика = ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.OnlineКонсультант") Тогда   
		Если НЕ (ВыбранныйМенеджер = Неопределено ИЛИ
			ВыбранныйМенеджер = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка")) Тогда  			 
			
			Менеджер = ВыбранныйМенеджер;
			Отдел = Renault_CRM.ПолучитьОтделСотрудника(Менеджер); 
			
			НазначитьНаМенеджераЗавершениеСерверOnlineКонсультант(Отдел, ВыбранныйТрафикID, ВыбранныйМенеджер, Телефон);
			
			Если НеВозвращатьТрафик = Ложь Тогда
				НоваяСтрока = ТаблицаПеренаправленногоТрафика.Добавить();
				НоваяСтрока.ИдентификаторТрафика = ВыбранныйТрафикID;
				НоваяСтрока.Дата = ТекущаяДата();
			КонецЕсли;
			
			ОбновитьЧат();
			ОбновитьСписокТрафика();
			ПрочитатьДанныеКлиента();
		КонецЕсли;
		
		Если НеВозвращатьТрафик = Истина Тогда
			НеВозвращатьТрафикНажатие();
		КонецЕсли; 	
	ИначеЕсли ТипВыбранногоТрафика = ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.ЛидRenault")
			ИЛИ ТипВыбранногоТрафика = ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.Email") Тогда
		Если Не (ВыбранныйМенеджер = Неопределено ИЛИ ВыбранныйМенеджер = Справочники.Сотрудники.ПустаяСсылка()) тогда
			Менеджер = ВыбранныйМенеджер;
			Отдел = Renault_CRM.ПолучитьОтделСотрудника(Менеджер);
			
			НазначитьНаМенеджераЗавершениеСерверЛидRenaultИлиEmail(Отдел, ВыбранныйТрафикID, ВыбранныйМенеджер, Телефон);

			ОбновитьЧат();
			ОбновитьСписокТрафика();
			ПрочитатьДанныеКлиента();  
		КонецЕсли; 		
	КонецЕсли;    	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура НазначитьНаМенеджераЗавершениеСерверOnlineКонсультант(Отдел, ВыбранныйТрафикID, ВыбранныйМенеджер, Телефон)
	Запись = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ВыбранныйТрафикID);
	Запись.Отдел = Отдел;
	Запись.Менеджер = ВыбранныйМенеджер;
	Запись.Записать();
	
	МенНовСообщ = РегистрыСведений.Renault_ОК_НовыйНеПросмотренныйТрафик.СоздатьМенеджерЗаписи();
	МенНовСообщ.Период = ТекущаяДата();
	МенНовСообщ.Идентификатор = Запись.Идентификатор;
	МенНовСообщ.Записать();		
		
	// Если назначаем на менеджера по сервису, то создадим обращение в сервис.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.Отдел
	|ИЗ
	|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|ГДЕ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь.Сотрудник = &Сотрудник
	|	И Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.Отдел.КлассификацияRenault = &ОтделСервиса";
	Запрос.УстановитьПараметр("Сотрудник", ВыбранныйМенеджер);
	Запрос.УстановитьПараметр("ОтделСервиса", Перечисления.CRM_КлассификацияОтделов.ОтделСервиса);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 			
		Поиск = Документы.Renault_CRM_ОбращениеВАвтоСервис.НайтиПоРеквизиту("ИдентификаторТрафика", ВыбранныйТрафикID);
		Если НЕ ЗначениеЗаполнено(Поиск) Тогда
			Документ = Документы.Renault_CRM_ОбращениеВАвтоСервис.СоздатьДокумент();
		Иначе
			Документ = Поиск.ПолучитьОбъект();
		КонецЕсли;
		
		Документ.Дата = ТекущаяДата();
		Документ.ВидОбращения = Справочники.Renault_ВидыОбращенийВАвтосервис.СРешепшен;
		Документ.ДилерскийЦентр = Запись.ДилерскийЦентр;
		Документ.Менеджер = Справочники.Пользователи.НайтиПоРеквизиту("Сотрудник", ВыбранныйМенеджер);
		Документ.Клиент = Запись.Клиент;
		Документ.Примечание = "Из контакт-центра";
		Документ.ПервичныйПовторный = Перечисления.CRM_ПервичныйПовторный.Первичный;
		Документ.ОбращениеОбработано = Ложь; 			
		Документ.ИдентификаторТрафика = ВыбранныйТрафикID;
		
		Попытка
			Документ.ТелефонПримечание = Телефон;
		Исключение
			Документ.Примечание = Документ.Примечание + " Телефон клиента: " + Телефон;
		КонецПопытки;
		
		Документ.Записать(); 			
	КонецЕсли; 	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура НазначитьНаМенеджераЗавершениеСерверЛидRenaultИлиEmail(Отдел, ВыбранныйТрафикID, ВыбранныйМенеджер, Телефон)
	Запись = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ВыбранныйТрафикID);
	Запись.Менеджер = ВыбранныйМенеджер;
	Запись.Отдел = Отдел;
	Запись.Записать();
	
	Если ЗначениеЗаполнено(Запись.Менеджер) Тогда
		МенеджерИстории = РегистрыСведений.Reneult_ИсторияИзмененийЛидов.СоздатьМенеджерЗаписи();
		МенеджерИстории.ИДТрафика = ВыбранныйТрафикID;
		МенеджерИстории.Период = ТекущаяДата();
		МенеджерИстории.Менеджер = Запись.Менеджер;
		МенеджерИстории.Записать();
	КонецЕсли;   				
				
	// Если назначаем на менеджера по сервису, то создадим обращение в сервис.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.Отдел
	|ИЗ
	|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|ГДЕ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь.Сотрудник = &Сотрудник
	|	И Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.Отдел.КлассификацияRenault = &ОтделСервиса";
	Запрос.УстановитьПараметр("Сотрудник", ВыбранныйМенеджер);
	Запрос.УстановитьПараметр("ОтделСервиса", Перечисления.CRM_КлассификацияОтделов.ОтделСервиса);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Поиск = Документы.Renault_CRM_ОбращениеВАвтоСервис.НайтиПоРеквизиту("ИдентификаторТрафика", ВыбранныйТрафикID);
		Если НЕ ЗначениеЗаполнено(Поиск) Тогда
			Документ = Документы.Renault_CRM_ОбращениеВАвтоСервис.СоздатьДокумент();
		Иначе
			Документ = Поиск.ПолучитьОбъект();
		КонецЕсли;
		
		Документ.Дата = ТекущаяДата();
		Документ.ВидОбращения = Справочники.Renault_ВидыОбращенийВАвтосервис.СРешепшен;
		Документ.ДилерскийЦентр = Запись.ДилерскийЦентр;
		Документ.Менеджер = Справочники.Пользователи.НайтиПоРеквизиту("Сотрудник", ВыбранныйМенеджер);
		Документ.Клиент = Запись.Клиент;
		Документ.Примечание = "Из контакт-центра";
		Документ.ПервичныйПовторный = Перечисления.CRM_ПервичныйПовторный.Первичный;
		Документ.ОбращениеОбработано = Ложь;
		
		Документ.ИдентификаторТрафика = ВыбранныйТрафикID;
		
		Попытка
			Документ.ТелефонПримечание = Телефон;
		Исключение
			Документ.Примечание = Документ.Примечание + " Телефон клиента: " + Телефон;
		КонецПопытки;
		
		Документ.Записать(); 		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРазговор()
	ОпОповещения = Новый ОписаниеОповещения("ЗавершитьРазговорЗавершение", ЭтаФорма);
	ОткрытьФорму("Справочник.Renault_РезультатОбработки.Форма.ФормаВыбораУпр",, ЭтаФорма,,,, ОпОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРазговорЗавершение(ВыбранноеЗначение, ДопПараметры) Экспорт
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗакрытьТрафик(ВыбранныйТрафикID, ВыбранноеЗначение, ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.OnlineКонсультант"));
	
	НачальноеОтображаениеЧатаИДанныхКлиента();
	
	ОбновитьСписокТрафика();	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРабочийЛист()
	Если НЕ ЗначениеЗаполнено(Менеджер) Тогда
		Сообщить("Создание рабочего листа возможно после выбора менеджера");
		Возврат;
	КонецЕсли;
	
	Если РабочийЛистСуществует(ВыбранныйТрафикID) Тогда 
		Сообщить("По данному трафику уже существует рабочий лист");
		Возврат;
	КонецЕсли;
	
	РЛ = Renault_КонтактЦентр_Общий.СоздатьРабочийЛистПоТрафику(ВыбранныйТрафикID);
	Если Не(РЛ = Неопределено) Тогда 
		Форм = РЛ.ПолучитьФорму("ФормаЗаписи", , "ФормаЗаписи" + Строка(РЛ.IDK));
		Если Форм.Открыта() Тогда
			Форм.Активизировать();
		Иначе
			Форм.Открыть();
		КонецЕсли;
		
		ЗакрытьТрафик(ВыбранныйТрафикID, ПредопределенноеЗначение("Справочник.Renault_РезультатОбработки.СозданРабочийЛист"), ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.OnlineКонсультант"));
		
		НачальноеОтображаениеЧатаИДанныхКлиента();
		
		ОбновитьСписокТрафика();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗакрытьТрафик(ИдТрафика, ПричинаЗакрытия, ТипТрафика)
	ОбработкаОК = Обработки.Renault_АРМ_ОнлайнКонсультант.Создать();
	ОбработкаОК.ЗакрытьТрафик(ИдТрафика, ПричинаЗакрытия, ТипТрафика);
КонецПроцедуры

&НаСервереБезКонтекста
Функция РабочийЛистСуществует(ВыбранныйТрафикID)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Renault_РабочиеЛисты.ID
	|ИЗ
	|	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	|ГДЕ
	|	Renault_РабочиеЛисты.IDТрафика = &ИдТрафика";
	Запрос.УстановитьПараметр("ИдТрафика", ВыбранныйТрафикID);
	
	Возврат Запрос.Выполнить().Выбрать().Количество() > 0;    	
КонецФункции

&НаКлиенте
Процедура ОтправитьВЧат()
	Текст = ПолеВводаТекстСообщения;
	Если ЗначениеЗаполнено(Текст) Тогда
		Попытка
			СтандартнаяОбработка = Ложь;
			
			Renault_ОнлайнКонсультант.ОтправитьСообщениеКлиентуОКВебСервис(Текст, Объект.ИдПользователя, ТекущаяДата(), ТекущийДЦ);
			
			ЗаписатьСообщениеВременно(ВыбранныйТрафикID, Текст, Объект.ИдПользователя);
		Исключение
			Предупреждение("Не удалось отправить сообщение");
		КонецПопытки;
	КонецЕсли;
	
	ТекущийЭлемент = Элементы.ПолеВводаТекстСообщения;   
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЧат()
	ОпОповещения = Новый ОписаниеОповещения("ЗаполнитьЧатЗавершение", ЭтаФорма);
	ОткрытьФорму("Справочник.Renault_ШаблоныОтветовЧат.Форма.ФормаВыбораУпр",, ЭтаФорма,,,, ОпОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЧатЗавершение(ВыбранноеЗначение, ДопПараметры)  Экспорт
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолеВводаТекстСообщения = ВыбранноеЗначение.ШаблонОтвета;		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьСообщениеВременно(ИД, Текст, ИдПользователя)
	ОбработкаОК = Обработки.Renault_АРМ_ОнлайнКонсультант.Создать();
	ОбработкаОК.ЗаписатьСообщениеВременно(ИД, Текст, ИдПользователя);
	
	ПолеВводаТекстСообщения = "";
	
	Запись = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ИД);
	Если Запись <> Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(Запись.Администратор) Тогда
			Запись.Администратор = ПараметрыСеанса.Пользователь.Сотрудник;
		КонецЕсли;
		Запись.Обработан = Истина;
		Запись.Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НазначитьТрафикНаМенеджера(ПараметрыПеретаскивания, Строка)
	Если ЗначениеЗаполнено(Строка) Тогда
		Если Строка.ЗанятостьСотрудника = ПредопределенноеЗначение("Перечисление.CRM_ЗанятостьСотрудника.Занят") Тогда
			Сообщить("Менеджер занят и не может принять трафик! Попробуйте перенаправить на другого.");
		Иначе
			НазначитьТрафикНаМенеджераСервер(ПараметрыПеретаскивания.Значение.Идентификатор, Строка.Сотрудник, Отдел);
			
			ОбновитьСписокТрафика();
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура НазначитьТрафикНаМенеджераСервер(Идентификатор, Сотрудник, Отдел)
	ЗаписьТрафик = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(Идентификатор);
	ЗаписьТрафик.Менеджер = Сотрудник;			
	Отдел = Renault_CRM.ПолучитьОтделСотрудника(ЗаписьТрафик.Менеджер);
	ЗаписьТрафик.Отдел = Отдел;			
	ЗаписьТрафик.Записать();	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьБлокировки()
	ОткрытьФорму("РегистрСведений.Renault_ЗаблокированныйТрафик.Форма.ФормаСпискаУпр",,ЭтаФорма);	
КонецПроцедуры

&НаКлиенте
Процедура кнОбновитьСписокТрафика()
	НачальноеОтображаениеЧатаИДанныхКлиента();
	
	ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
	
	мПараметры = Новый Массив;
	мПараметры.Добавить(" ");
	Задание = ФоновыеЗадания.Выполнить("Renault_ОнлайнКонсультант.Renault_КонтактЦентр_LMT", мПараметры); 	
	УникальныйИдентификаторЗадания = Задание.УникальныйИдентификатор;
	Ответ = ЗаданиеВыполнено(УникальныйИдентификаторЗадания, ОшибкаПолученияДанных); 
	Если ОшибкаПолученияДанных Тогда
		Если ФормаДлительнойОперации <> Неопределено И ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = УникальныйИдентификаторЗадания Тогда
			ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		КонецЕсли;
		ОткрытьФорму("Обработка.Renault_АРМ_ОнлайнКонсультант.Форма.ФормаОшибкиПолученияДанных");
	КонецЕсли;
	
	Если Ответ <> Неопределено и Ответ = Истина Тогда
		ОбновитьСписокТрафика();
		ОбновитьЧат();
		ПрочитатьДанныеКлиента(); 		
	ИначеЕсли НЕ ОшибкаПолученияДанных Тогда 
		ПодключитьОбработчикОжидания("ВыполнениеДлительнойОперацииLMT", 1, Истина);
		ФормаДлительнойОперации = ОткрытьФормуДлительнойОперации(ЭтаФорма, УникальныйИдентификаторЗадания, "LMT");
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Функция ОткрытьФормуДлительнойОперации(Знач ВладелецФормы, Знач ИдентификаторЗадания, ЗаголовокФормы)
	ФормаДлительнойОперации = ПолучитьФорму("Обработка.Renault_АРМ_ОнлайнКонсультант.Форма.ДлительнаяОперация");
	Если ФормаДлительнойОперации.Открыта() Тогда
		ФормаДлительнойОперации = ОткрытьФорму(
			"Обработка.Renault_АРМ_ОнлайнКонсультант.Форма.ДлительнаяОперация",
			Новый Структура("ИдентификаторЗадания, ЗаголовокФормы", ИдентификаторЗадания, ЗаголовокФормы), 
			ВладелецФормы);
	Иначе
		ФормаДлительнойОперации.ВладелецФормы        = ВладелецФормы;
		ФормаДлительнойОперации.ИдентификаторЗадания = ИдентификаторЗадания;
		ФормаДлительнойОперации.ЗаголовокФормы		 = ЗаголовокФормы;
		ФормаДлительнойОперации.Открыть();
	КонецЕсли;
	
	Возврат ФормаДлительнойОперации; 	
КонецФункции

&НаКлиенте
Процедура ВыполнениеДлительнойОперацииLMT()
	Ответ = ЗаданиеВыполнено(УникальныйИдентификаторЗадания, ОшибкаПолученияДанных);
	Если ОшибкаПолученияДанных Тогда
		Если ФормаДлительнойОперации <> Неопределено И ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = УникальныйИдентификаторЗадания Тогда
			ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		КонецЕсли;
		ОткрытьФорму("Обработка.Renault_АРМ_ОнлайнКонсультант.Форма.ФормаОшибкиПолученияДанных");
	КонецЕсли;
	
	Если Ответ <> Неопределено и Ответ = Истина Тогда
		Если ФормаДлительнойОперации <> Неопределено И ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = УникальныйИдентификаторЗадания Тогда
			ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		КонецЕсли;
		ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		мПараметры = Новый Массив;
		мПараметры.Добавить(" ");
		Задание = ФоновыеЗадания.Выполнить("Renault_ОнлайнКонсультант.Renault_КонтактЦентр_Почта", мПараметры);
		УникальныйИдентификаторЗадания = Задание.УникальныйИдентификатор;
		Ответ = ЗаданиеВыполнено(УникальныйИдентификаторЗадания, ОшибкаПолученияДанных);
		Если ОшибкаПолученияДанных Тогда
			Если ФормаДлительнойОперации <> Неопределено И ФормаДлительнойОперации.Открыта() 
				И ФормаДлительнойОперации.ИдентификаторЗадания = УникальныйИдентификаторЗадания Тогда
				ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			КонецЕсли;
			ОткрытьФорму("Обработка.Renault_АРМ_ОнлайнКонсультант.Форма.ФормаОшибкиПолученияДанных");
		КонецЕсли;
		
		Если Ответ <> Неопределено и Ответ = Истина Тогда
			ОбновитьСписокТрафика();
			ОбновитьЧат();
			ПрочитатьДанныеКлиента();
		ИначеЕсли не ОшибкаПолученияДанных Тогда
			ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);   
			ПодключитьОбработчикОжидания("ВыполнениеДлительнойОперацииПочта", ПараметрыОбработчика.ТекущийИнтервал, Истина);
			ФормаДлительнойОперации = ОткрытьФормуДлительнойОперации(ЭтаФорма, УникальныйИдентификаторЗадания, "почты");
		КонецЕсли;
	ИначеЕсли Не ОшибкаПолученияДанных Тогда
		ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		ПодключитьОбработчикОжидания("ВыполнениеДлительнойОперацииLMT", ПараметрыОбработчика.ТекущийИнтервал, Истина);
	КонецЕсли;  	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнениеДлительнойОперацииПочта()
	Ответ = ЗаданиеВыполнено(УникальныйИдентификаторЗадания, ОшибкаПолученияДанных);
	Если ОшибкаПолученияДанных Тогда
		Если ФормаДлительнойОперации <> Неопределено И ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = УникальныйИдентификаторЗадания Тогда
			ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		КонецЕсли;
		ОткрытьФорму("Обработка.Renault_АРМ_ОнлайнКонсультант.Форма.ФормаОшибкиПолученияДанных");
	КонецЕсли;
	
	Если Ответ <> Неопределено и Ответ = Истина Тогда
		Если ФормаДлительнойОперации <> Неопределено И ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = УникальныйИдентификаторЗадания Тогда
			ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		КонецЕсли;
		ОбновитьСписокТрафика();
		ОбновитьЧат();
		ПрочитатьДанныеКлиента();
	ИначеЕсли Не ОшибкаПолученияДанных Тогда
		ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчика);   
		ПодключитьОбработчикОжидания("ВыполнениеДлительнойОперацииПочта", ПараметрыОбработчика.ТекущийИнтервал, Истина);
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания)
	ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.ТекущийИнтервал * ПараметрыОбработчикаОжидания.КоэффициентУвеличенияИнтервала;
	Если ПараметрыОбработчикаОжидания.ТекущийИнтервал > ПараметрыОбработчикаОжидания.МаксимальныйИнтервал Тогда
		ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.МаксимальныйИнтервал;
	КонецЕсли; 		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(Знач ИдентификаторЗадания, ОшибкаПолученияДанных)
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	ОшибкаПолученияДанных = Ложь;
	Если Задание <> Неопределено
		И Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПоказатьПолныйТекстОшибки = Ложь;
	Если Задание = Неопределено Тогда
		ОшибкаПолученияДанных = Истина;
	Иначе
		Если Задание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
			ОшибкаПолученияДанных = Истина;
		ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;	 	
КонецФункции

&НаКлиенте
Процедура ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации)
	Если ТипЗнч(ФормаДлительнойОперации) = Тип("УправляемаяФорма") Тогда
		Если ФормаДлительнойОперации.Открыта() Тогда
			ФормаДлительнойОперации.Закрыть();
		КонецЕсли;
	КонецЕсли;
	ФормаДлительнойОперации = Неопределено;  	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания)
	
	ПараметрыОбработчикаОжидания = Новый Структура(
		"МинимальныйИнтервал,МаксимальныйИнтервал,ТекущийИнтервал,КоэффициентУвеличенияИнтервала", 1, 15, 1, 1.4);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОнлайн()
	Если ПраваПользователя.РаботаетОнлайнКонсультант Тогда  		
		Если СтатусОператора = Ложь Тогда		
			ОбновитьСтатусОператора(); 
			ПодключитьОбработчикОжидания("ОбновитьСтатусОператора", 180);
			
			Элементы.кнПодключитьОнлайн.ЦветФона = ЦветАктив;
			Элементы.кнПодключитьОнлайн.Картинка = БиблиотекаКартинок.Renault_Confirm_Square;
			Элементы.кнПодключитьОнлайн.Заголовок = "Отключить";
			
			СтатусОператора = Истина;			
		Иначе  			
			ОтключитьОбработчикОжидания("ОбновитьСтатусОператора");
			
			Отбор = Новый Структура;
			Отбор.Вставить("ВидимостьОбщий", Истина);
			Отбор.Вставить("ТипТрафика", ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.OnlineКонсультант"));
			МассивСтрок = НастройкиКонтактЦентра.НайтиСтроки(Отбор);
			
			Для Каждого ЭлементМассива ИЗ МассивСтрок Цикл
				BIR = Renault_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементМассива.ДилерскийЦентр, "BIR");
				Если ЗначениеЗаполнено(BIR) Тогда
					Renault_ОнлайнКонсультант.ОтключитьКонсультантаВебСервис(BIR);
				КонецЕсли;
			КонецЦикла;
			ОбновитьСтатусСотрудника(ПредопределенноеЗначение("Перечисление.Renault_КонтактЦентр_СтатусыСотрудников.offline"));
			
			Элементы.кнПодключитьОнлайн.Заголовок = "Подключить";
			Элементы.кнПодключитьОнлайн.ЦветФона = ЦветСерый;
			Элементы.кнПодключитьОнлайн.Картинка = БиблиотекаКартинок.Renault_Square_NEw; 
			
			СтатусОператора = Ложь; 			
		КонецЕсли;		
	КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусОператора() Экспорт	
	Для Каждого Элемент ИЗ МассивBIR Цикл
		Renault_ОнлайнКонсультант.ПодключитьКонсультантаВебСервис(Элемент);
	КонецЦикла; 	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод()
	ПараметрыФормы = Новый Структура("Дата1, Дата2", ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания);
	ОпОповещения = Новый ОписаниеОповещения("УстановкаДанныхПериода", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.Renault_ВыборПериода", ПараметрыФормы, ЭтаФорма,,,, ОпОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура УстановкаДанныхПериода(ДанныеПериода, ДополнительныеПараменты) Экспорт
	Если ДанныеПериода = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ОтборПериод.ДатаНачала = ДанныеПериода.Дата1;
	ОтборПериод.ДатаОкончания = ДанныеПериода.Дата2; 
	
	ОбновитьСписокТрафика();
	ОбновитьЧат();
	СформироватьЗаголовокФормы();
	НачальноеОтображаениеЧатаИДанныхКлиента();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьУведомления()
	ПоказыватьУведомления = НЕ ПоказыватьУведомления;
	
	Если ПоказыватьУведомления Тогда
		Элементы.кнПоказыватьУведомления.ЦветФона = ЦветАктив;
		Элементы.кнПоказыватьУведомления.Картинка = БиблиотекаКартинок.Renault_Confirm_Square;
	Иначе
		Элементы.кнПоказыватьУведомления.ЦветФона = ЦветСерый;
		Элементы.кнПоказыватьУведомления.Картинка = БиблиотекаКартинок.Renault_Square_NEw;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки()
	ПараметрыФормы = Новый Структура("СтруктураНастроекСписка", СтруктураНастроекСписка);
	
	ОпОповещения = Новый ОписаниеОповещения("ОткрытьНастройкиЗавершение", ЭтаФорма);
	
	ОткрытьФорму("Обработка.Renault_АРМ_ОнлайнКонсультант.Форма.ФормаНастройкиУпр", ПараметрыФормы, ЭтаФорма,,,, ОпОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиЗавершение(Ответ, ДопПараметры) Экспорт
	Если Ответ <> Неопределено Тогда
		СтруктураНастроекСписка = Ответ;
		ОбновитьСписокТрафика();
		НачальноеОтображаениеЧатаИДанныхКлиента();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьОткрытыйТрафик()
	Если НЕ ВыборТрафика = 1 Тогда
		ВыборТрафика = 1;
		ОбновитьСписокТрафика();
		ОтметитьТекущийВидТрафика();
		НачальноеОтображаениеЧатаИДанныхКлиента();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьЗакрытыйТрафик()
	Если НЕ ВыборТрафика = 0 Тогда
		ВыборТрафика = 0;
		ОбновитьСписокТрафика();
		ОтметитьТекущийВидТрафика();
		НачальноеОтображаениеЧатаИДанныхКлиента();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьОткрытыйТрафикМенеджеров()
	Если НЕ ВыборТрафика = 2 Тогда
		ВыборТрафика = 2;
		ОбновитьСписокТрафика();
		ОтметитьТекущийВидТрафика();
		НачальноеОтображаениеЧатаИДанныхКлиента();
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОтделПродаж()
	ОпОповещения = Новый ОписаниеОповещения("ВыбратьОтделЗавершение", ЭтаФорма);
	Форма = ОткрытьФорму("Справочник.CRM_Отделы.Форма.ФормаВыбораУпр",, ЭтаФорма,,,, ОпОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте 
Процедура ВыбратьОтделЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	ОтборОтдел = РезультатВыбора; 
	Если Не ЗначениеЗаполнено(ОтборОтдел) тогда
		ОтборОтдел = Renault_КонтактЦентр_Общий.ПолучитьОтделАвтосалона();
	КонецЕсли;
	СформироватьЗаголовокФормы();
	
	ОбновитьСписокСотрудников(ОтборОтдел);		
КонецПроцедуры  

&НаКлиенте
Процедура ОбновитьСписокСотрудников(ОтделДляСписка) Экспорт
	СписокСотрудников = ПолучитьСписокСотрудников(ОтделДляСписка);
	
	ТаблицаСтатусы.Очистить();
	Для Каждого Эл Из СписокСотрудников Цикл
		Стр = ТаблицаСтатусы.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, Эл);
	КонецЦикла; 	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокСотрудников(ОтделДляСписка = Неопределено)
	ОтделПродаж = ОтделДляСписка;
	Если ОтделПродаж = Неопределено Тогда
		ОтделПродаж = Renault_КонтактЦентр_Общий.ПолучитьОтделАвтосалона();
	КонецЕсли;
	ТаблицаСотрудников = Renault_РаботаСПравамиПользователя.ПолучитьТаблицуСсылокНаСотрудниковПоОтделу(ОтделПродаж);
	МассивСотрудников = ТаблицаСотрудников.ВыгрузитьКолонку("Ссылка");
	ТаблицаСтатусы = Renault_КонтактЦентр_Общий.ПолучитьСтатусыСотрудников(МассивСотрудников);
	
	СписокСотрудников = Новый Массив;
	Для Каждого Стр Из ТаблицаСтатусы Цикл
		СтрокаСотрудников = Новый Структура("Сотрудник, ЗанятостьСотрудника, Статус");
		ЗаполнитьЗначенияСвойств(СтрокаСотрудников, Стр);
		СтрокаСотрудников.Вставить("Статус", ?(Стр.АктивностьПользователя, "Online", "Offline"));
		
		СписокСотрудников.Добавить(СтрокаСотрудников);
	КонецЦикла; 
	
	Возврат СписокСотрудников; 
КонецФункции

&НаКлиенте
Процедура СформироватьЗаголовокФормы(НаименованиеКлиента = "")
	ТекстЗаголовка = ?(ЗначениеЗаполнено(ОтборОтдел), "Отдел: " + Строка(ОтборОтдел) + " ", "");
	ТекстЗаголовка = ТекстЗаголовка + ?(ЗначениеЗаполнено(НаименованиеКлиента), "Клиент: " + НаименованиеКлиента + " ", "");
	ТекстПериод = "Период: ";
	Если НЕ ЗначениеЗаполнено(ОтборПериод.ДатаНачала) И
		НЕ ЗначениеЗаполнено(ОтборПериод.ДатаОкончания) Тогда
		ТекстПериод = ТекстПериод + "За всё время ";
	ИначеЕсли НачалоДня(ОтборПериод.ДатаНачала) = НачалоДня(ОтборПериод.ДатаОкончания) И
		 НачалоДня(ОтборПериод.ДатаНачала) = НачалоДня(ТекущаяДата()) Тогда
		ТекстПериод = ТекстПериод + "За сегодня "; 
	Иначе
		Если ЗначениеЗаполнено(ОтборПериод.ДатаНачала) Тогда
			ТекстПериод = ТекстПериод + "С " + Формат(ОтборПериод.ДатаНачала, "ДФ=dd.MM.yyyy") + " ";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОтборПериод.ДатаОкончания) Тогда
			ТекстПериод = ТекстПериод + "По " + Формат(ОтборПериод.ДатаОкончания, "ДФ=dd.MM.yyyy") + " ";
		КонецЕсли;
	КонецЕсли;  	
	ТекстЗаголовка = ТекстЗаголовка + ТекстПериод;
	
	ЭтаФорма.Заголовок = ТекстЗаголовка;	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеМеню()
	ПунктыМенюКоличество = ПунктыМеню.Количество();
	Для Н = 0 По ПунктыМенюКоличество - 1 Цикл 
		Эл = Элементы.Найти("гр" + ПунктыМеню[Н]);
		Если Эл = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Эл.Видимость = Н = ТекущаяЗакладкаМеню;
	КонецЦикла;	
	
	ЭлементыКнопокМеню = Элементы.грКнопкиМеню.ПодчиненныеЭлементы; 
	КоличествоКнопокМеню = ЭлементыКнопокМеню.Количество();
	Для Н = 1 По КоличествоКнопокМеню Цикл
		Эл = ЭлементыКнопокМеню[Н - 1];
		Если НЕ Эл.Видимость Тогда
			Продолжить;
		КонецЕсли;
		ЭтоТекущаяЗакладка = Сред(Эл.Имя,3) = ПунктыМеню[ТекущаяЗакладкаМеню].Значение;
		Эл.ЦветФона = ?(ЭтоТекущаяЗакладка, ЦветАктив, ЦветПассив);  
		Эл.ЦветРамки= ?(ЭтоТекущаяЗакладка, ЦветАктив, ЦветПассив);
	КонецЦикла; 	
КонецПроцедуры	

&НаКлиенте
Процедура НачальноеОформлениеФормы()
	Парам = Renault_ОбщиеФункции.МультибрендПараметрыОформления();
	ЦветАктив = Вычислить(Парам.ОсновнойЦвет);
	ЦветПассив = Вычислить(Парам.ДопЦвет2);
	ЦветСерый = Вычислить(Парам.ДопЦвет1);

	МассивАктив = Новый Массив;
	МассивАктив.Добавить(Элементы.кнОбновитьСписокТрафика);
	МассивАктив.Добавить(Элементы.кнПериодОтбора);
	МассивАктив.Добавить(Элементы.кнОткрытьНастройки);  
	МассивАктив.Добавить(Элементы.Переключатель);
	МассивАктив.Добавить(Элементы.Logo);
	
	МассивПассив = Новый Массив;
	МассивПассив.Добавить(Элементы.кнУстановитьОтделПродаж);
	МассивПассив.Добавить(Элементы.кнОтобразитьОткрытыйТрафик);
	МассивПассив.Добавить(Элементы.кнОтобразитьЗакрытыйТрафик);
	МассивПассив.Добавить(Элементы.кнОтобразитьОткрытыйТрафикМенеджеров);
	МассивПассив.Добавить(Элементы.кнПоказыватьУведомления);
	МассивПассив.Добавить(Элементы.кнПодключитьОнлайн);
	МассивПассив.Добавить(Элементы.кнБлокировки);

	Renault_ОбщиеФункции.МультибрендОсновноеОформление(МассивАктив, МассивПассив);	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьКонсультант()
	Задержка = ПараметрыОК.ЗадержкаОбновленияЧата;
	Если ЗначениеЗаполнено(Задержка) Тогда
		Если Задержка > 0 Тогда
			ПодключитьОбработчикОжидания("Renault_OK_НаличиеНовыхСообщенийЛок", Задержка);  
		Иначе
			ТолькоОбновлятьТрафик = Истина;
			ПодключитьОбработчикОжидания("Renault_OK_НаличиеНовыхСообщенийЛок", 2); 
		КонецЕсли;
	КонецЕсли;  	
КонецПроцедуры

&НаКлиенте
Процедура Renault_OK_НаличиеНовыхСообщенийЛок() Экспорт
	ОбновитьСписокСотрудников(ОтборОтдел);	  		
КонецПроцедуры
	
&НаСервере
Процедура МодульОбъектаЗаполнитьНастройкиПодключения()
	ОбъектФормы = РеквизитФормыВЗначение("Объект");
	ОбъектФормы.МодульОбъектаЗаполнитьНастройкиПодключения();
	ЗначениеВРеквизитФормы(ОбъектФормы, "Объект");
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьСтатусСотрудника(Статус) Экспорт
	ТекДата = ТекущаяДата();
	ТекСотрудник = ПараметрыСеанса.Пользователь.Сотрудник;
	
	Набор = РегистрыСведений.Renault_КонтактЦентр_СтатусыСотрудников.СоздатьНаборЗаписей();
	Набор.Отбор.Период.Установить(ТекДата);
	Набор.Отбор.Сотрудник.Установить(ТекСотрудник);
	Набор.Очистить();
	
	Запись = Набор.Добавить();
	Запись.Период = ТекДата;
	Запись.Сотрудник = ТекСотрудник;
	Запись.Статус = Статус;
	Набор.Записать();  	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокТрафика() Экспорт
	ТекСтрокаТрафика = Элементы.ТаблицаТрафика.ТекущиеДанные;
	Если ТекСтрокаТрафика <> Неопределено Тогда
		ТекИдТрафика = ТекСтрокаТрафика.Идентификатор;
	Иначе
		ТекИдТрафика = Неопределено;
	КонецЕсли;
	//Обновление списка трафика
	
	ДанныеНКЦ = Новый Массив();
	КолонкиНастройкиКонтактЦентра = НастройкиКонтактЦентра.Колонки;
	Для Каждого Эл Из НастройкиКонтактЦентра Цикл
		СтрокаДанныхНКЦ = Новый Структура();
		Для Каждого Стр Из КолонкиНастройкиКонтактЦентра Цикл
			СтрИмя = Стр.Имя;
			СтрокаДанныхНКЦ.Вставить(СтрИмя, Эл[СтрИмя]); 			
		КонецЦикла;
		
		ДанныеНКЦ.Добавить(СтрокаДанныхНКЦ);
	КонецЦикла;
	
	Если ВыборТрафика = 1 Тогда		
		ДатаОбновления = ТекущаяДата();   
		ДанныеТрафика = ПолучитьТаблицуОткрытогоТрафика(СтруктураНастроекСписка, ДанныеНКЦ, ПраваПользователя,  НачалоДня(ОтборПериод.ДатаНачала), КонецДня(ОтборПериод.ДатаОкончания));
		
		ТаблицаТрафика.Очистить();
		Для Каждого Эл Из ДанныеТрафика Цикл
			Стр = ТаблицаТрафика.Добавить();
			ЗаполнитьЗначенияСвойств(Стр, Эл);
		КонецЦикла;
		
		ПроставитьКартинкиТаблицаТрафик();
		
		//Покажем сообщение, если нужно
		Если ПоказыватьУведомления И ТаблицаТрафика.Количество() > 0 Тогда  			
			ДатаПоследнегоСообщенияВТаблице = ПолучитьДатуПоследнегоСообщения(ДанныеТрафика);  		
			
			Если ДатаПоследнегоСообщения <> Неопределено И ДатаПоследнегоСообщенияВТаблице > ДатаПоследнегоСообщения Тогда
				ПоказатьУведомлениеОНовомСообщении();  
			КонецЕсли;
			ДатаПоследнегоСообщения = ДатаПоследнегоСообщенияВТаблице; 
		КонецЕсли;  		
	ИначеЕсли ВыборТрафика = 2 Тогда
		ДатаОбновления = ТекущаяДата();  
		ДанныеТрафика = ПолучитьТаблицуОткрытогоТрафикаПоМенеджерам(СтруктураНастроекСписка, ДанныеНКЦ, ПраваПользователя, НачалоДня(ОтборПериод.ДатаНачала), КонецДня(ОтборПериод.ДатаОкончания), Истина);
		
		ТаблицаТрафика.Очистить();
		Для Каждого Эл Из ДанныеТрафика Цикл
			Стр = ТаблицаТрафика.Добавить();
			ЗаполнитьЗначенияСвойств(Стр, Эл);
		КонецЦикла;
		
		ПроставитьКартинкиТаблицаТрафик();
	Иначе		
		ДанныеТрафика = ПолучитьТаблицуЗакрытогоТрафика(СтруктураНастроекСписка, ДанныеНКЦ, ПраваПользователя, НачалоДня(ОтборПериод.ДатаНачала), КонецДня(ОтборПериод.ДатаОкончания), ЕстьПравоАдминистратора, ЕстьПравоМенеджера);
		
		ТаблицаТрафика.Очистить();
		Для Каждого Эл Из ДанныеТрафика Цикл
			Стр = ТаблицаТрафика.Добавить();
			ЗаполнитьЗначенияСвойств(Стр, Эл);
		КонецЦикла;
		
		ПроставитьКартинкиТаблицаТрафик();
	КонецЕсли;
	
	ОбновитьЗаголовокКнопокТрафика(); 
	
	//Восстановим фокус на выделенной до обновления строке	
	Строки = ТаблицаТрафика.НайтиСтроки(Новый Структура("Идентификатор", ТекИдТрафика));	
	Если Строки.Количество() > 0 Тогда
		ПредСтрТрафика = Строки[0];   		
		Элементы.ТаблицаТрафика.ТекущаяСтрока = ПредСтрТрафика.ПолучитьИдентификатор();
	КонецЕсли;
	Элементы.ТаблицаТрафикаРезультатОбработки.Видимость = ВыборТрафика = 0; 	
КонецПроцедуры  

&НаКлиенте
Функция ПолучитьДатуПоследнегоСообщения(ДанныеТрафика)  	
	ДатаПС = ДанныеТрафика[0].Время;
	
	Для Каждого Эл Из ДанныеТрафика Цикл
		ДатаПС = Макс(Эл.Время, ДатаПС);
	КонецЦикла;
		
	Возврат  ДатаПС;   	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТаблицуОткрытогоТрафика(СтруктураНастроекСписка, ДанныеНКЦ, ПраваПользователя, НачалоПериода, КонецПериода, ПоказатьТрафикПоМенеджерам = Ложь)
	ТабДанныеНКЦ = Новый ТаблицаЗначений;
	СтрокаДанныеНКЦ = ДанныеНКЦ[0];
	
	Для Каждого Эл Из СтрокаДанныеНКЦ Цикл
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТипЗнч(Эл.Значение));
		ОпТипов = Новый ОписаниеТипов(МассивТипов);
		ТабДанныеНКЦ.Колонки.Добавить(Эл.Ключ, ОпТипов);	
	КонецЦикла;
	
	Для Каждого Эл Из ДанныеНКЦ Цикл
		Стр = ТабДанныеНКЦ.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, Эл);
	КонецЦикла;
	
	ОбработкаОК = Обработки.Renault_АРМ_ОнлайнКонсультант.Создать();
	ТабТрафика = ОбработкаОК.ПолучитьТаблицуОткрытогоТрафика(, СтруктураНастроекСписка, ТабДанныеНКЦ, ПраваПользователя, НачалоПериода, КонецПериода, ПоказатьТрафикПоМенеджерам);
	
	ДанныеТрафика = Новый Массив();
	КолонкиТабТрафика = ТабТрафика.Колонки;
	Для Каждого Эл Из ТабТрафика Цикл
		СтрокаДанныхТрафика = Новый Структура();
		Для Каждого Стр Из КолонкиТабТрафика Цикл
			СтрИмя = Стр.Имя;
			СтрокаДанныхТрафика.Вставить(СтрИмя, Эл[СтрИмя]); 			
		КонецЦикла;
		
		ДанныеТрафика.Добавить(СтрокаДанныхТрафика);
	КонецЦикла;
	
	Возврат ДанныеТрафика; 	
КонецФункции

&НаКлиенте
Процедура ПоказатьУведомлениеОНовомСообщении()
	Если глРарус_Компонента <> Неопределено Тогда
		Тема = обОбрезатьСтроку(Формат(ТекущаяДата(),"ДФ='дд.ММ.гг ЧЧ:мм'"), 62, "…");
		ТелоСообщения = обОбрезатьСтроку("Получены новые сообщения Online-consultant",88,"…") + " <BR>";
		глРарус_Компонента.ПоказатьБаннер(Тема, ТелоСообщения, "Необходимо ответить как можно скорее! :)", 3, 0, Ложь, "Баннер", Истина);
	КонецЕсли; 	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТаблицуОткрытогоТрафикаПоМенеджерам(СтруктураНастроекСписка = Неопределено, ДанныеНКЦ = Неопределено, ПраваПользователя, НачалоПериода, КонецПериода, ПоказатьТрафикПоМенеджерам = Ложь)
	ТабДанныеНКЦ = Новый ТаблицаЗначений;
	СтрокаДанныеНКЦ = ДанныеНКЦ[0];
	
	Для Каждого Эл Из СтрокаДанныеНКЦ Цикл
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТипЗнч(Эл.Значение));
		ОпТипов = Новый ОписаниеТипов(МассивТипов);
		ТабДанныеНКЦ.Колонки.Добавить(Эл.Ключ, ОпТипов);	
	КонецЦикла;
	
	Для Каждого Эл Из ДанныеНКЦ Цикл
		Стр = ТабДанныеНКЦ.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, Эл);
	КонецЦикла;
	
	ОбработкаОК = Обработки.Renault_АРМ_ОнлайнКонсультант.Создать();
	ТабТрафика = ОбработкаОК.ПолучитьТаблицуОткрытогоТрафикаПоМенеджерам(СтруктураНастроекСписка, ТабДанныеНКЦ, ПраваПользователя, НачалоПериода, КонецПериода, ПоказатьТрафикПоМенеджерам);
	
	ДанныеТрафика = Новый Массив();
	КолонкиТабТрафика = ТабТрафика.Колонки;
	Для Каждого Эл Из ТабТрафика Цикл
		СтрокаДанныхТрафика = Новый Структура();
		Для Каждого Стр Из КолонкиТабТрафика Цикл
			СтрИмя = Стр.Имя;
			СтрокаДанныхТрафика.Вставить(СтрИмя, Эл[СтрИмя]); 			
		КонецЦикла;
		
		ДанныеТрафика.Добавить(СтрокаДанныхТрафика);
	КонецЦикла;
	
	Возврат ДанныеТрафика; 	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТаблицуЗакрытогоТрафика(СтруктураНастроекСписка = Неопределено, ДанныеНКЦ = Неопределено, ПраваПользователя, НачалоПериода, КонецПериода, ЕстьПравоАдминистратора = Ложь, ЕстьПравоМенеджера = Ложь)
	ТабДанныеНКЦ = Новый ТаблицаЗначений;
	СтрокаДанныеНКЦ = ДанныеНКЦ[0];
	
	Для Каждого Эл Из СтрокаДанныеНКЦ Цикл
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТипЗнч(Эл.Значение));
		ОпТипов = Новый ОписаниеТипов(МассивТипов);
		ТабДанныеНКЦ.Колонки.Добавить(Эл.Ключ, ОпТипов);	
	КонецЦикла;
	
	Для Каждого Эл Из ДанныеНКЦ Цикл
		Стр = ТабДанныеНКЦ.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, Эл);
	КонецЦикла;
	
	ОбработкаОК = Обработки.Renault_АРМ_ОнлайнКонсультант.Создать();
	ТабТрафика = ОбработкаОК.ПолучитьТаблицуЗакрытогоТрафика(СтруктураНастроекСписка, ТабДанныеНКЦ, ПраваПользователя, НачалоПериода, КонецПериода, ЕстьПравоАдминистратора, ЕстьПравоМенеджера);
	
	ДанныеТрафика = Новый Массив();
	КолонкиТабТрафика = ТабТрафика.Колонки;
	Для Каждого Эл Из ТабТрафика Цикл
		СтрокаДанныхТрафика = Новый Структура();
		Для Каждого Стр Из КолонкиТабТрафика Цикл
			СтрИмя = Стр.Имя;
			СтрокаДанныхТрафика.Вставить(СтрИмя, Эл[СтрИмя]); 			
		КонецЦикла;
		
		ДанныеТрафика.Добавить(СтрокаДанныхТрафика);
	КонецЦикла;
	
	Возврат ДанныеТрафика; 		
КонецФункции

&НаКлиенте
Процедура ОбновитьЗаголовокКнопокТрафика()
	КолТрафика = ТаблицаТрафика.Количество();
	Если ВыборТрафика = 1 Тогда
		Элементы.КнОтобразитьОткрытыйТрафик.Заголовок = "("+КолТрафика+")";
		Элементы.КнОтобразитьЗакрытыйТрафик.Заголовок = "";
		Элементы.КнОтобразитьОткрытыйТрафикМенеджеров.Заголовок = "";
	ИначеЕсли ВыборТрафика = 2 Тогда
		Элементы.КнОтобразитьОткрытыйТрафик.Заголовок = "";
		Элементы.КнОтобразитьЗакрытыйТрафик.Заголовок = "";
		Элементы.КнОтобразитьОткрытыйТрафикМенеджеров.Заголовок = "("+КолТрафика+")";
	Иначе
		Элементы.КнОтобразитьОткрытыйТрафик.Заголовок = "";
		Элементы.КнОтобразитьЗакрытыйТрафик.Заголовок = "("+КолТрафика+")";
		Элементы.КнОтобразитьОткрытыйТрафикМенеджеров.Заголовок = "";
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьТекущийВидТрафика()
	Если ВыборТрафика = 1 Тогда
		Элементы.КнОтобразитьОткрытыйТрафик.ЦветФона = ЦветАктив;
		Элементы.КнОтобразитьЗакрытыйТрафик.ЦветФона = ЦветСерый;
		Элементы.КнОтобразитьОткрытыйТрафикМенеджеров.ЦветФона = ЦветСерый;
	ИначеЕсли ВыборТрафика = 0 Тогда
		Элементы.КнОтобразитьОткрытыйТрафик.ЦветФона = ЦветСерый;
		Элементы.КнОтобразитьЗакрытыйТрафик.ЦветФона = ЦветАктив;
		Элементы.КнОтобразитьОткрытыйТрафикМенеджеров.ЦветФона = ЦветСерый;
	ИначеЕсли ВыборТрафика = 2 Тогда
		Элементы.КнОтобразитьОткрытыйТрафик.ЦветФона = ЦветСерый;
		Элементы.КнОтобразитьЗакрытыйТрафик.ЦветФона = ЦветСерый;
		Элементы.КнОтобразитьОткрытыйТрафикМенеджеров.ЦветФона = ЦветАктив;
	КонецЕсли;  	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЧат()
	Если ЗначениеЗаполнено(ВыбранныйТрафикID) Тогда
		ОбновитьДоступностьКнопок(); 
		ОбновитьОкноОбработкиТрафика(); 
		УправлениеМеню();  		
	КонецЕсли;   	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьКнопок()
	Отбор = Новый Структура;
	Отбор.Вставить("ТипТрафика", ТипВыбранногоТрафика);
	Отбор.Вставить("ДилерскийЦентр", ТекущийДЦ);
	МассивСтрок = НастройкиКонтактЦентра.НайтиСтроки(Отбор);
	Если МассивСтрок.Количество() <> 0 Тогда
		СозданиеРЛ = МассивСтрок[0].СозданиеРЛ;
		ПереводТрафика = МассивСтрок[0].ПереводТрафика;
	Иначе
		СозданиеРЛ = Истина;
		ПереводТрафика = Истина;
	КонецЕсли;
	
	ЭтоМойТрафик = Ложь;
	СтрокиТрафика = ТаблицаТрафика.НайтиСтроки(Новый Структура("Идентификатор", ВыбранныйТрафикID));
	Если СтрокиТрафика.Количество() > 0 Тогда
		ЭтоМойТрафик = СтрокиТрафика[0].Менеджер = Renault_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыСеанса.Пользователь, "Сотрудник");
	КонецЕсли;
		
	Элементы.кнЗавершитьРазговор.Доступность 				= ВыборТрафика = 1 ИЛИ (ВыборТрафика = 2 И ЭтоМойТрафик);
	Элементы.кнЗакрытьТрафик.Доступность 					= ВыборТрафика = 1 ИЛИ (ВыборТрафика = 2 И ЭтоМойТрафик);
	Элементы.кнЗакрытьТрафикПисьмо.Доступность 				= ВыборТрафика = 1 ИЛИ (ВыборТрафика = 2 И ЭтоМойТрафик);
	Элементы.кнСоздатьРабочийЛист.Видимость 				= СозданиеРЛ;
	Элементы.кнСоздатьРЛПисьмо.Видимость 					= СозданиеРЛ;
	Элементы.кнСоздатьРабочийЛист.Доступность 				= СозданиеРЛ И ((ВыборТрафика = 1) ИЛИ (ВыборТрафика = 2 И ЭтоМойТрафик));
	Элементы.кнСоздатьРЛПисьмо.Доступность 					= СозданиеРЛ И ((ВыборТрафика = 1) ИЛИ (ВыборТрафика = 2 И ЭтоМойТрафик));
	Элементы.кнСоздатьРЛ.Видимость							= СозданиеРЛ И ((ВыборТрафика = 1) ИЛИ (ВыборТрафика = 2 И ЭтоМойТрафик));
	Элементы.кнЧатМенеджер.Видимость						= ПраваПользователя.ПраваИНастройки.ПраваКЦАдминистратор И ПереводТрафика;
	Элементы.кнНеВозвращатьТрафик.Видимость					= (ВыборТрафика = 1 ИЛИ (ВыборТрафика = 2 И ЭтоМойТрафик)) И ПереводТрафика;
	Элементы.кнЛидМенеджер.Видимость						= ПраваПользователя.ПраваИНастройки.ПраваКЦАдминистратор И ПереводТрафика;
	Элементы.кнПисьмоМенеджер.Видимость 					= ПраваПользователя.ПраваИНастройки.ПраваКЦАдминистратор И ПереводТрафика;
	Элементы.кнЗаполнить.Доступность						= ВыборТрафика = 1 ИЛИ (ВыборТрафика = 2 И ЭтоМойТрафик);
	Элементы.ПолеВводаТекстСообщения.Доступность 			= ВыборТрафика = 1 ИЛИ (ВыборТрафика = 2 И ЭтоМойТрафик);
	Элементы.ОтветПисьмо.Доступность 						= ВыборТрафика = 1 ИЛИ (ВыборТрафика = 2 И ЭтоМойТрафик);
	Элементы.кнЗаполнитьЧат.Доступность 					= ВыборТрафика = 1 ИЛИ (ВыборТрафика = 2 И ЭтоМойТрафик);
	Элементы.кнЗаполнитьПисьмоПоШаблону.Доступность 		= ВыборТрафика = 1 ИЛИ (ВыборТрафика = 2 И ЭтоМойТрафик);
	Элементы.кнОтправитьВЧат.Доступность 					= ВыборТрафика = 1 ИЛИ (ВыборТрафика = 2 И ЭтоМойТрафик);
	Элементы.кнОтправитьОтветЛида.Доступность 				= ВыборТрафика = 1 ИЛИ (ВыборТрафика = 2 И ЭтоМойТрафик);
	Элементы.кнОтправитьОтветЛидаПоТелефону.Доступность 	= ВыборТрафика = 1 ИЛИ (ВыборТрафика = 2 И ЭтоМойТрафик);
	Элементы.кнОтправитьОтветПисьмо.Доступность 			= ВыборТрафика = 1 ИЛИ (ВыборТрафика = 2 И ЭтоМойТрафик);
	Элементы.кнСохранить.Доступность 						= ВыборТрафика = 1 ИЛИ (ВыборТрафика = 2 И ЭтоМойТрафик);
	Элементы.кнСохранитьЛид.Доступность 					= ВыборТрафика = 1 ИЛИ (ВыборТрафика = 2 И ЭтоМойТрафик);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОкноОбработкиТрафика()
	Если Не ЗначениеЗаполнено(ВыбранныйТрафикID) Тогда
		ПолеЧата = "";
		ЧатЛида = "";
		Возврат;
	КонецЕсли;
	
	НастройкаВидимостиСтраницЧата(); 
	
	Если ТипВыбранногоТрафика = ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.ЛидRenault") Тогда
		НаименованиеКлиента = "";
		
		ДанныеДляЛида = Новый Структура();
		СформироватьЗакладкуДляЛида(ВыбранныйТрафикID, НаименованиеКлиента, ДанныеДляЛида, НаименованиеОператора);		
		
		ДанныеДляЛида.Свойство("ЛидVIN", ЛидVIN);
		ДанныеДляЛида.Свойство("ЛидМодель", ЛидМодель);
		ДанныеДляЛида.Свойство("ЛидПробег", ЛидПробег);
		ДанныеДляЛида.Свойство("ЛидТипДвигателя", ЛидТипДвигателя);
		ДанныеДляЛида.Свойство("ЛидОбъемДвигателя", ЛидОбъемДвигателя);
		ДанныеДляЛида.Свойство("ЛидИсточник", ЛидИсточник);
		ДанныеДляЛида.Свойство("ЛидАдрес", ЛидАдрес);
		ДанныеДляЛида.Свойство("ЛидГород", ЛидГород);
		ДанныеДляЛида.Свойство("ЛидСообщение", ЛидСообщение);
		ДанныеДляЛида.Свойство("ЧатЛида", ЧатЛида);
		ДанныеДляЛида.Свойство("КатегорияЛида", КатегорияЛида);
		ДанныеДляЛида.Свойство("ТипЛида", ТипЛида);
		ДанныеДляЛида.Свойство("ТемаПисьма", ТемаПисьма);

		ИспользуетсяНесколькоЯщиков = Ложь;
		ДанныеДляЛида.Свойство("ИспользуетсяНесколькоЯщиков", ИспользуетсяНесколькоЯщиков);
		Если ЗначениеЗаполнено(ИспользуетсяНесколькоЯщиков) Тогда
			Элементы.ЯщикОтправки.Видимость = ИспользуетсяНесколькоЯщиков;
			
			Если ИспользуетсяНесколькоЯщиков Тогда
				ДанныеДляЛида.Свойство("ОсновнойЯщик", ЯщикОтправки);			
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОтветЛиду) Тогда
			Элементы.НадписьОтветОтправлен.Заголовок = "Ответ: Ответ отправлен";
		Иначе
			Элементы.НадписьОтветОтправлен.Заголовок = "Ответ:";
		КонецЕсли; 
		
	ИначеЕсли ТипВыбранногоТрафика = ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.Email") Тогда
		ДанныеДляЗакладкиПисьма = СформироватьЗакладкуДляПисьма(ВыбранныйТрафикID);  
		
		ДанныеТрафикаПисьма = ДанныеДляЗакладкиПисьма.ДанныеТрафикаПисьма;
		ИспользуетсяНесколькоЯщиков = ДанныеДляЗакладкиПисьма.ИспользуетсяНесколькоЯщиков;
		ОсновнойЯщик = ДанныеДляЗакладкиПисьма.ОсновнойЯщик;
		ЕстьТрафик = ДанныеДляЗакладкиПисьма.ЕстьТрафик;
 
		ПолеHTMLДокументаПисьмо = "";
		ПолеТекстовогоДокументаПисьмо = "";

		Если ЕстьТрафик Тогда
			ЭтаФорма.Клиент = ДанныеТрафикаПисьма.Клиент;
			ЭтаФорма.ТемаПисьма = ДанныеТрафикаПисьма.ТемаПисьма;
			ЭтаФорма.Email = ДанныеТрафикаПисьма.Email;  
			
			Если ДанныеТрафикаПисьма.ФорматТекста = ПредопределенноеЗначение("Перечисление.ФорматТекста.HTML") Тогда
				Элементы.ПолеHTMLДокументаПисьмо.Видимость = Истина;
				Элементы.ПолеТекстовогоДокументаПисьмо.Видимость = Ложь; 
				ТекстПисьма = ДанныеТрафикаПисьма.ТекстПисьма;
				Если СтрЧислоВхождений(ТекстПисьма, "<html>") > 0 Тогда
					ПолеHTMLДокументаПисьмо = ТекстПисьма;
				Иначе
					ПолеHTMLДокументаПисьмо = "<html><body>" + ТекстПисьма + "</body></html>";
				КонецЕсли;
			Иначе
				Элементы.ПолеHTMLДокументаПисьмо.Видимость = Ложь;
				Элементы.ПолеТекстовогоДокументаПисьмо.Видимость = Истина;
				ПолеТекстовогоДокументаПисьмо = ДанныеТрафикаПисьма.ТекстПисьма;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДанныеТрафикаПисьма.BIR) Тогда
				Элементы.ЯщикОтправки.Видимость = ИспользуетсяНесколькоЯщиков;
				Если ИспользуетсяНесколькоЯщиков Тогда
					ЯщикОтправки = ОсновнойЯщик;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
	Иначе
		НаименованиеКлиента = "";
		ТекстПоля = СформироватьТекстПоляЧата(НаименованиеКлиента, ВыбранныйТрафикID, ДатаОбновления, НаименованиеОператора); 
		ПолеЧата = ТекстПоля;
		Renault_ОнлайнКонсультант.ОтметитьСообытияОНовомСообщенииВчатОбработаными(ВыбранныйТрафикID);
		СформироватьЗаголовокФормы(НаименованиеКлиента);		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаВидимостиСтраницЧата()
	ПодчиненныеЭлементыГрКнопкиМеню = Элементы.грКнопкиМеню.ПодчиненныеЭлементы;
	Для Каждого Эл Из ПодчиненныеЭлементыГрКнопкиМеню Цикл
		Эл.Видимость = Ложь;
	КонецЦикла;
	
	ПодчиненныеЭлементыгрЛеваяКолонкаОсновноеТело = Элементы.грЛеваяКолонкаОсновноеТело.ПодчиненныеЭлементы;
	Для Каждого Эл Из ПодчиненныеЭлементыгрЛеваяКолонкаОсновноеТело Цикл
		Эл.Видимость = Ложь;
	КонецЦикла;
	
	Если ТипВыбранногоТрафика = ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.ЛидRenault") Тогда
		ТекущаяЗакладкаМеню = 2;
		Элементы.кнЛидРено.Видимость = Истина;
		Элементы.грЛидРено.Видимость = Истина;
		Элементы.кнАтрибутыЛида.Видимость = Истина;		
		Элементы.кнИстория.Видимость = ИсторияСуществует();
	ИначеЕсли ТипВыбранногоТрафика = ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.Email") Тогда
		ТекущаяЗакладкаМеню = 4;
		Элементы.кнПисьмо.Видимость = Истина;
		Элементы.грПисьмо.Видимость = Истина;
		Элементы.кнАтрибутыПисьма.Видимость = Истина;
		Элементы.кнИстория.Видимость = ИсторияСуществует();
	ИначеЕсли ТипВыбранногоТрафика = ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.OnlineКонсультант") Тогда
		ТекущаяЗакладкаМеню = 0;
		Элементы.кнЧатОбщение.Видимость	= Истина;
		Элементы.грЧатОбщение.Видимость = Истина;
		Элементы.кнАтрибутыТрафика.Видимость = Истина;
	КонецЕсли;  	           	
	
	Элементы.кнРабочиеЛисты.Видимость = ТЗРабочиеЛисты.Количество() > 0;
КонецПроцедуры

&НаКлиенте
Функция ИсторияСуществует()
	Возврат Истина; ///Нужно доработать
КонецФункции

&НаСервереБезКонтекста
Процедура СформироватьЗакладкуДляЛида(ВыбранныйТрафикID, НаименованиеКлиента, ДанныеДляЛида, НаименованиеОператора)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_Трафик.ДилерскийЦентр.BIR КАК BIR,
	|	ПРЕДСТАВЛЕНИЕ(Renault_Лид.ВидУслуги) КАК Тема,
	|	ПРЕДСТАВЛЕНИЕ(Renault_Лид.ВидУслуги.Классификация) КАК Тип,
	|	ПРЕДСТАВЛЕНИЕ(Renault_Лид.ВидУслуги.Тип) КАК ПодТип,
	|	Renault_Лид.Модель КАК ЛидМодель,
	|	Renault_Лид.Мотор КАК ЛидТипДвигателя,
	|	Renault_Лид.ОбъемДвигателя КАК ЛидОбъемДвигателя,
	|	Renault_Лид.VIN КАК ЛидVIN,
	|	Renault_Лид.Пробег КАК ЛидПробег,
	|	Renault_Лид.ИсточникИнформации КАК ЛидИсточник,
	|	Renault_Лид.Адрес КАК ЛидАдрес,
	|	Renault_Лид.Город КАК ЛидГород,
	|	Renault_Лид.Сообщение КАК ЛидСообщение
	|ИЗ
	|	Документ.Renault_Лид КАК Renault_Лид
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_Трафик КАК Renault_Трафик
	|		ПО Renault_Лид.ТрафикИД = Renault_Трафик.Идентификатор
	|ГДЕ
	|	Renault_Трафик.Идентификатор = &ИдТрафика";
	Запрос.УстановитьПараметр("ИдТрафика", ВыбранныйТрафикID);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбработкаОК = Обработки.Renault_АРМ_ОнлайнКонсультант.Создать();
	ОбработкаОК.ОтметитьТрафикЛМТПоказанным(ВыбранныйТрафикID);   
	
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.Тип)Тогда
			ДанныеДляЛида.Вставить("КатегорияЛида", Выборка.ПодТип);
			ДанныеДляЛида.Вставить("ТипЛида", Выборка.Тип);
			ДанныеДляЛида.Вставить("ТемаПисьма",Выборка.Тип);
		КонецЕсли;

		ТекстПоляЧата = СформироватьТекстПоляЧатаЛиды(ОбработкаОК, ВыбранныйТрафикID, НаименованиеОператора); 		
		
		ДанныеДляЛида.Вставить("ЧатЛида", ТекстПоляЧата);
		ДанныеДляЛида.Вставить("ЛидVIN", Выборка.ЛидVIN);
		ДанныеДляЛида.Вставить("ЛидМодель", Выборка.ЛидМодель);
		ДанныеДляЛида.Вставить("ЛидПробег", Выборка.ЛидПробег);
		ДанныеДляЛида.Вставить("ЛидТипДвигателя", Выборка.ЛидТипДвигателя);
		ДанныеДляЛида.Вставить("ЛидОбъемДвигателя", Выборка.ЛидОбъемДвигателя);
		ДанныеДляЛида.Вставить("ЛидИсточник", Выборка.ЛидИсточник);
		ДанныеДляЛида.Вставить("ЛидАдрес", Выборка.ЛидАдрес);
		ДанныеДляЛида.Вставить("ЛидГород", Выборка.ЛидГород);
		ДанныеДляЛида.Вставить("ЛидСообщение", Выборка.ЛидСообщение);  
		
		Если ЗначениеЗаполнено(Выборка.BIR) Тогда
			ИспользуетсяНесколькоЯщиков = Renault_ОнлайнКонсультант.ИспользуетсяНесколькоЯщиковПоBIR(Выборка.BIR);
			ДанныеДляЛида.Вставить("ИспользуетсяНесколькоЯщиков",ИспользуетсяНесколькоЯщиков);  

			Если ИспользуетсяНесколькоЯщиков Тогда
				ОсновнойЯщик = Справочники.Renault_ДилерскиеПочтовыеЯщикиНаЦентральномСервере.ПолучитьОсновнойЯщикДляЛидов(Выборка.BIR);
				ДанныеДляЛида.Вставить("ОсновнойЯщик",ОсновнойЯщик); 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьТекстПоляЧатаЛиды(ОбработкаОК, ВыбранныйТрафикID, НаименованиеОператора)
	ТекстПоля = ЗаполнитьШапкуПоляЧата(ОбработкаОК);   
	Табл = ОбработкаОК.ПолучитьИсториюЛидов(ВыбранныйТрафикID); 
	ПредыдущаяДатаСообщения = Дата(1,1,1,0,0,0);
	ПредыдущийВывод = "-1";
	НачатаТаблица = Ложь;
	Для Каждого Выборка Из Табл Цикл		
		Если Выборка.ВидСообщения = 1 Тогда
			//Сообщение отправил клиент
			СтрокаЧата = СформироватьСтрокуШтмлСообщенияЛиды(ОбработкаОК, ПредыдущаяДатаСообщения, ПредыдущийВывод, НачатаТаблица, Выборка, Ложь, НаименованиеОператора);
		Иначе			//Сообщение отправил оператор
			СтрокаЧата = СформироватьСтрокуШтмлСообщенияЛиды(ОбработкаОК, ПредыдущаяДатаСообщения, ПредыдущийВывод, НачатаТаблица, Выборка, Ложь, НаименованиеОператора);
		КонецЕсли;
		ТекстПоля = ТекстПоля + СтрокаЧата;
	КонецЦикла;
	Если НачатаТаблица Тогда
		ОбработкаОК.ДобавитьТэгШтмл(ТекстПоля, "/TBODY", 3);
		ОбработкаОК.ДобавитьТэгШтмл(ТекстПоля, "/TABLE", 2);
	КонецЕсли;
	ОбработкаОК.ДобавитьТэгШтмл(ТекстПоля, "/BODY", 1);
	ОбработкаОК.ДобавитьТэгШтмл(ТекстПоля, "/HTML", 0);
	
	Возврат ТекстПоля;   	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаполнитьШапкуПоляЧата(ОбработкаОК)
	ТекстПоля = "";
	ОбработкаОК.ДобавитьТэгШтмл(ТекстПоля, "HTML");
	ОбработкаОК.ДобавитьТэгШтмл(ТекстПоля, "HEAD",1);
	ОбработкаОК.ДобавитьТэгШтмл(ТекстПоля, "META",2, ОбработкаОК.СтруктураПараметровМета("utf-8"));
	ОбработкаОК.ДобавитьТэгШтмл(ТекстПоля, "STYLE  type=text/css",2);
	ТекстПоля = ТекстПоля + Символы.ПС + ОбработкаОК.ОписаниеКласса("DateText", "COLOR: #000000; FONT-SIZE: 12px", 3);
	ТекстПоля = ТекстПоля + Символы.ПС + ОбработкаОК.ОписаниеКласса("IsFor", "COLOR: #000000; FONT-SIZE: 14px", 3);
	ТекстПоля = ТекстПоля + Символы.ПС + ОбработкаОК.ОписаниеКласса("IsFrom", "COLOR: #000000; FONT-SIZE: 14px", 3);
	ТекстПоля = ТекстПоля + Символы.ПС + ОбработкаОК.ОписаниеКласса("UserNick", "COLOR: #000000; FONT-SIZE: 14px; FONT-WEIGHT: 700", 3);
	ТекстПоля = ТекстПоля + Символы.ПС + ОбработкаОК.ОписаниеКласса("BodyStyle", "background-color: #F2F2F2", 3);
	ОбработкаОК.ДобавитьТэгШтмл(ТекстПоля, "/STYLE type=text/css", 2);
	ОбработкаОК.ДобавитьТэгШтмл(ТекстПоля, "/HEAD", 1);
	ОбработкаОК.ДобавитьТэгШтмл(ТекстПоля, "script", 1);
	ТекстПоля = ТекстПоля + Символы.ПС + ОбработкаОК.ОписаниеФункции("scrollBottom()", "document.body.scrollTop = document.body.scrollHeight", 2);
	ОбработкаОК.ДобавитьТэгШтмл(ТекстПоля, "/script", 1);
	ОбработкаОК.ДобавитьТэгШтмл(ТекстПоля, "BODY", 1, ОбработкаОК.СтруктураПараметровТелаДокумента("BodyStyle", """scrollBottom()"""));
	
	Возврат ТекстПоля;    	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьСтрокуШтмлСообщенияЛиды(ОбработкаОК, ПредДатаСообщения, ПредВывод, НачатаТаблица, Сообщение, ЭтоСообщениеОператора = Ложь, НаименованиеОператора)
	СсылкаНаКартинкуОнлайнКонсультанта = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.Renault_chat_lead);

	ТекстКВозврату = "";
	ПредыдущийГод = Год(ПредДатаСообщения);
	ПредыдущийМесяц = Месяц(ПредДатаСообщения);
	ПредыдущийДень = День(ПредДатаСообщения);
	ТекущийГод = Год(Сообщение.ДатаСообщения);
	ТекущийМесяц = Месяц(Сообщение.ДатаСообщения);
	ТекущийДень = День(Сообщение.ДатаСообщения);
	ЭтоНовыйДеньСоощений = НЕ((ПредыдущийДень = ТекущийДень) И (ПредыдущийМесяц = ТекущийМесяц) И (ПредыдущийГод = ТекущийГод));
	Если ЭтоНовыйДеньСоощений Тогда
		Если НачатаТаблица Тогда
			ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "/TBODY", 3);
			ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "/TABLE", 2);
			ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "HR", 2);
			НачатаТаблица = Ложь;
		КонецЕсли;
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TABLE", 2, ОбработкаОК.СтруктураПараметровТаблицы("100%"));
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TBODY", 3);
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TR", 4);
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TD", 5, ОбработкаОК.СтруктураПараметровЯчейки("", "", "DateText"), Формат(Сообщение.ДатаСообщения, "ДФ=""дд.ММ.гг"""), Истина);
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "/TR", 4);
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "/TBODY", 3);
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "/TABLE", 2);
		ПредДатаСообщения = Сообщение.ДатаСообщения;
	КонецЕсли;
	ИмяОтправителя = Сообщение.Отправитель;
	Если Не ЗначениеЗаполнено(ИмяОтправителя) Тогда
		ИмяОтправителя = НаименованиеОператора;
	КонецЕсли;
	имяКласса = "IsFor";
	
	ПродолжитьВыводСообщения = (ПредВывод = ИмяОтправителя) И (НЕ ЭтоНовыйДеньСоощений);
	Если Не ПродолжитьВыводСообщения Тогда
		Если НачатаТаблица Тогда
			ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "/TBODY", 3);
			ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "/TABLE", 2);
		КонецЕсли;
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TABLE", 2, ОбработкаОК.СтруктураПараметровТаблицы("100%"));
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TBODY", 3);
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TR", 4);
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TD", 5, ОбработкаОК.СтруктураПараметровЯчейки("25"));
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "IMG", 6, ОбработкаОК.СтруктураПараметровКартинки(СсылкаНаКартинкуОнлайнКонсультанта, "24", "24"));
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "/TD", 5);
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TD", 5, ОбработкаОК.СтруктураПараметровЯчейки("", "", "UserNick"), " > " + ИмяОтправителя + " ", Истина);
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "/TR", 4);
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "/TBODY", 3);
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "/TABLE", 2);
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TABLE", 2, ОбработкаОК.СтруктураПараметровТаблицы("100%"));
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TBODY", 3);
		НачатаТаблица = Истина;
		ПредВывод = ИмяОтправителя;
	КонецЕсли;
	ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TR", 4);
	ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TD", 5, ОбработкаОК.СтруктураПараметровЯчейки("45", "", "DateText", "right", "top"),
					Формат(Сообщение.ДатаСообщения, "ДФ=""ЧЧ:мм:сс"""), Истина);
	ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TD", 5, ОбработкаОК.СтруктураПараметровЯчейки("5", "", "UserNick", "right", "top"), ">", Истина);
	ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TD", 5, ОбработкаОК.СтруктураПараметровЯчейки("", "", ИмяКласса), Сообщение.Тип+" "+ Сообщение.ПодТип +" "+Сообщение.Сообщение, Истина);
	ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "/TR", 4);
	
	Возврат ТекстКВозврату; 	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьЗакладкуДляПисьма(ИД)
	ДанныеДляЗакладкиПисьма = Новый Структура("ДанныеТрафикаПисьма, ЕстьТрафик, ИспользуетсяНесколькоЯщиков, ОсновнойЯщик");
	ДанныеТрафикаПисьма = Новый Структура("Клиент, BIR, ДатаСообщения, ТемаПисьма, ТекстПисьма, ФорматТекста, ВидСообщения, Email, УчетнаяЗаписьПисьмо");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Renault_Трафик.Клиент КАК Клиент,
	|	Renault_Трафик.ДилерскийЦентр.BIR КАК BIR,
	|	Renault_ТрафикПисьма.ДатаПоступления КАК ДатаСообщения,
	|	Renault_ТрафикПисьма.ТемаПисьма КАК ТемаПисьма,
	|	Renault_ТрафикПисьма.ТекстПисьма КАК ТекстПисьма,
	|	Renault_ТрафикПисьма.ФорматТекста КАК ФорматТекста,
	|	1 КАК ВидСообщения,
	|	Renault_ТрафикПисьма.ПочтаКлиента КАК Email,
	|	Renault_ТрафикПисьма.УчетнаяЗапись КАК УчетнаяЗаписьПисьмо
	|ИЗ
	|	РегистрСведений.Renault_ТрафикПисьма КАК Renault_ТрафикПисьма
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_Трафик КАК Renault_Трафик
	|		ПО Renault_ТрафикПисьма.ИдТрафика = Renault_Трафик.Идентификатор
	|ГДЕ
	|	Renault_ТрафикПисьма.ИдТрафика = &ИдТрафика
	|УПОРЯДОЧИТЬ ПО
	|	Renault_ТрафикПисьма.ДатаПоступления УБЫВ";
	Запрос.УстановитьПараметр("ИдТрафика", ИД);
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ДанныеТрафикаПисьма, Выборка); 		
	КонецЕсли;  
	
	ОбработкаОК = Обработки.Renault_АРМ_ОнлайнКонсультант.Создать();
	ОбработкаОК.ОтметитьТрафикПисьмаПоказанным(ИД);
	
	ИспользуетсяНесколькоЯщиков = Ложь;
	ОсновнойЯщик = Неопределено;
	Если Выборка.Количество() > 0 Тогда
		Если ЗначениеЗаполнено(Выборка.BIR) Тогда
			ИспользуетсяНесколькоЯщиков = Renault_ОнлайнКонсультант.ИспользуетсяНесколькоЯщиковПоBIR(Выборка.BIR);
			Если ИспользуетсяНесколькоЯщиков Тогда
				ОсновнойЯщик = Справочники.Renault_ДилерскиеПочтовыеЯщикиНаЦентральномСервере.ПолучитьОсновнойЯщикДляПочты(Выборка.BIR);
			КонецЕсли;
		КонецЕсли; 	
	КонецЕсли;
	
	ДанныеДляЗакладкиПисьма.Вставить("ДанныеТрафикаПисьма", ДанныеТрафикаПисьма);
	ДанныеДляЗакладкиПисьма.Вставить("ЕстьТрафик", Выборка.Количество() > 0); 
	ДанныеДляЗакладкиПисьма.Вставить("ИспользуетсяНесколькоЯщиков", ИспользуетсяНесколькоЯщиков);
	ДанныеДляЗакладкиПисьма.Вставить("ОсновнойЯщик", ОсновнойЯщик);
	
	Возврат ДанныеДляЗакладкиПисьма;  	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьТекстПоляЧата(НаименованиеКлиента, ВыбранныйТрафикID, ДатаОбновления, НаименованиеОператора)
	ОбработкаОК = Обработки.Renault_АРМ_ОнлайнКонсультант.Создать();
	
	ТекстПоля = ЗаполнитьШапкуПоляЧата(ОбработкаОК);    
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ОК_Сообщения.id_mess,
	|	Renault_ОК_Сообщения.is_for КАК Кому,
	|	Renault_ОК_Сообщения.is_from КАК ОтКого,
	|	Renault_ОК_Сообщения.wr_date КАК ДатаСообщения,
	|	Renault_ОК_Сообщения.id_user КАК ИдПользователя,
	|	Renault_ОК_Сообщения.Клиент,
	|	Renault_ОК_Сообщения.Клиент КАК НаименованиеКлиента,
	|	Renault_ОК_Сообщения.IDТрафика,
	|	Renault_ОК_Сообщения.Обработано,
	|	Renault_ОК_Сообщения.messages КАК Сообщение,
	|	Renault_ОК_Сообщения.Внутренний,
	|	Renault_ОК_Сообщения.ИмяПользователя
	|ИЗ
	|	РегистрСведений.Renault_ОК_Сообщения КАК Renault_ОК_Сообщения
	|ГДЕ
	|	Renault_ОК_Сообщения.IDТрафика = &IDТрафика
	|
	|УПОРЯДОЧИТЬ ПО
	|	Renault_ОК_Сообщения.wr_date";
	Запрос.УстановитьПараметр("IDТрафика", ВыбранныйТрафикID);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбработкаОК.ОтметитьТрафикПоказаннымДо(ДатаОбновления, ВыбранныйТрафикID);
	
	ПредыдущаяДатаСообщения = Дата(1,1,1,0,0,0);
	ПредыдущийВывод = "-1";
	НачатаТаблица = Ложь;
	Пока Выборка.Следующий() Цикл
		НаименованиеКлиента = Выборка.НаименованиеКлиента;
		Если Выборка.ОтКого = 1 Тогда
			//Сообщение отправил клиент
			СтрокаЧата = СформироватьСтрокуШтмлСообщения(ОбработкаОК, ПредыдущаяДатаСообщения, ПредыдущийВывод, НачатаТаблица, Выборка, Ложь, НаименованиеОператора);
		Иначе
			//Сообщение отправил оператор
			СтрокаЧата = СформироватьСтрокуШтмлСообщения(ОбработкаОК, ПредыдущаяДатаСообщения, ПредыдущийВывод, НачатаТаблица, Выборка, Истина, НаименованиеОператора);
		КонецЕсли;
		ТекстПоля = ТекстПоля + СтрокаЧата;
	КонецЦикла;
	Если НачатаТаблица Тогда
		ОбработкаОК.ДобавитьТэгШтмл(ТекстПоля, "/TBODY", 3);
		ОбработкаОК.ДобавитьТэгШтмл(ТекстПоля, "/TABLE", 2);
	КонецЕсли;
	ОбработкаОК.ДобавитьТэгШтмл(ТекстПоля, "/BODY", 1);
	ОбработкаОК.ДобавитьТэгШтмл(ТекстПоля, "/HTML", 0);
	
	Возврат ТекстПоля;	
КонецФункции

&НаКлиенте
Процедура ТаблицаКлиентовВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	Если ТаблицаТрафика.Количество()>0 Тогда 
		
		Если Элементы.ТаблицаТрафика.ТекущиеДанные <> Неопределено Тогда
			
			//Выделили конкретную строку
			Объект.ИдПользователя = Элементы.ТаблицаТрафика.ТекущиеДанные.id_user;
			Клиент = Элементы.ТаблицаТрафика.ТекущиеДанные.Клиент;
			ВыбранныйТрафикID = Элементы.ТаблицаТрафика.ТекущиеДанные.Идентификатор;
			ТипВыбранногоТрафика = Элементы.ТаблицаТрафика.ТекущиеДанные.ТипТрафика;
			ТекущийДЦ = Элементы.ТаблицаТрафика.ТекущиеДанные.ДилерскийЦентр;
			ВыбранныйКлиент = Элементы.ТаблицаТрафика.ТекущиеДанные.Клиент;
			
		Иначе
			
			//Ничего не выделили, возьмем первую (теоретически, такого не может быть)
			Объект.ИдПользователя = ТаблицаТрафика[0].id_user;
			Клиент = ТаблицаТрафика[0].Клиент;
			ВыбранныйТрафикID = ТаблицаТрафика[0].Идентификатор;
			ТипВыбранногоТрафика = ТаблицаТрафика[0].ТипТрафика;
			ТекущийДЦ = ТаблицаТрафика[0].ДилерскийЦентр;
			ВыбранныйКлиент =  ТаблицаТрафика[0].Клиент; 			
		КонецЕсли;
		
		ОбновитьСписокТрафика();  
		ОбновитьЧат();
		ПрочитатьДанныеКлиента(); 
		
		Вложения.Очистить();
		
		Элементы.НадписьПисьмоИнфо.Видимость = Ложь;
		Элементы.НадписьЛидИнфо.Видимость = Ложь; 		
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьДанныеКлиента()
	ДанныеПоКлиенту = ПолучитьДанныеПоКлиенту(ВыбранныйТрафикID, ТипВыбранногоТрафика);
	ОбщиеДанные = ДанныеПоКлиенту.ОбщиеДанные;
	ДанныеТрафика = ДанныеПоКлиенту.ДанныеТрафика;
	ДанныеПоВзаимодействиям = ДанныеПоКлиенту.ДанныеПоВзаимодействиям;
	ДанныеПоРабочимЛистам = ДанныеПоКлиенту.ДанныеПоРабочимЛистам; 
	
	ДанныеТрафика.Свойство("Отдел", Отдел);
	ДанныеТрафика.Свойство("Менеджер", Менеджер);
	ДанныеТрафика.Свойство("Клиент", Клиент);
	ДанныеТрафика.Свойство("ПервичныйПовторный", ПервичныйПовторный);
	ДанныеТрафика.Свойство("Комментарий", Комментарий);
	ДанныеТрафика.Свойство("ПервичныйИнтерес", ПервичныйИнтерес);
	ДанныеТрафика.Свойство("ИсточникИнформации", ИсточникИнформации);
	ДанныеТрафика.Свойство("Наименование", Наименование);
	ДанныеТрафика.Свойство("БылаВыдача", БылаВыдача);  
	МодельАвтомобиля = Неопределено;
	ДанныеТрафика.Свойство("МодельАвтомобиля", МодельАвтомобиля); 
	
	Элементы.ПолеКартинкиВыдача.Доступность = БылаВыдача;
	Если ЗначениеЗаполнено(Наименование) Тогда
		Элементы.НадписьФИО.Заголовок = Наименование;
	Иначе
		Элементы.НадписьФИО.Заголовок = "<ФИО не указано>";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МодельАвтомобиля) Тогда
		Элементы.НадписьМодельАвтомобиля.Заголовок = "  " + МодельАвтомобиля;  		
	Иначе
		Элементы.НадписьМодельАвтомобиля.Заголовок = "  <Автомобиль неизвестен>";
	КонецЕсли;
	
	Взаимодействия.Очистить();
	Для Каждого Эл Из ДанныеПоВзаимодействиям Цикл
		Стр = Взаимодействия.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, Эл);
	КонецЦикла;
	
	ОбщиеДанные.Свойство("ОтветЛиду", ОтветЛиду);
	ОбщиеДанные.Свойство("Телефон", Телефон);
	ОбщиеДанные.Свойство("Email", Email);	

	ТЗРабочиеЛисты.Очистить();
	Элементы.ПолеЕстьРабочийЛист.Доступность = Ложь;

	Для Каждого Эл Из ДанныеПоРабочимЛистам Цикл
		Стр = ТЗРабочиеЛисты.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, Эл);
	КонецЦикла;
	
	Элементы.ПолеЕстьРабочийЛист.Доступность = ТЗРабочиеЛисты.Количество() > 0;
	Элементы.кнРабочиеЛисты.Видимость = ТЗРабочиеЛисты.Количество() > 0;   	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоКлиенту(ВыбранныйТрафикID, ТипВыбранногоТрафика)
	ОбщиеДанные = Новый Структура();
	ДанныеТрафика = Новый Структура();
	ДанныеПоВзаимодействиям = Новый Массив();
	ДанныеПоРабочимЛистам = Новый Массив(); 	
	
	//Прочитаем новые данные клиента
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_Трафик.Период,
	|	Renault_Трафик.Идентификатор,
	|	Renault_Трафик.ТипТрафика,
	|	Renault_Трафик.Обработан,
	|	Renault_Трафик.Отдел,   
	|	Renault_Трафик.Менеджер,     
	|	Renault_Трафик.Администратор,
	|	Renault_Трафик.Клиент,   
	|	Renault_Трафик.ПервичныйПовторный,   
	|	Renault_Трафик.ДилерскийЦентр,
	|	Renault_Трафик.Представление,
	|	Renault_Трафик.Комментарий,      
	|	Renault_Трафик.ПервичныйИнтерес,  
	|	Renault_Трафик.ИсточникИнформации,  
	|	Renault_Трафик.Клиент.Наименование КАК Наименование, 
	|	Renault_Трафик.Клиент.Пол,
	|	Renault_Трафик.Клиент.Ссылка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(CRM_ВоронкаПродаж.ЭтапПродаж, ИСТИНА) = ИСТИНА
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК БылаВыдача,
	|	Renault_РабочиеЛисты.МодельАвтомобиля
	|ИЗ
	|	РегистрСведений.Renault_Трафик КАК Renault_Трафик
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ВоронкаПродаж КАК CRM_ВоронкаПродаж
	|			ПО Renault_РабочиеЛисты.IDK = CRM_ВоронкаПродаж.IDK
	|				И (CRM_ВоронкаПродаж.ЭтапПродаж = ЗНАЧЕНИЕ(Справочник.CRM_ЭтапыПродаж.ВыдачаАвтомобиля))
	|		ПО Renault_Трафик.Клиент = Renault_РабочиеЛисты.Клиент
	|ГДЕ
	|	Renault_Трафик.Идентификатор = &Идентификатор";
	Запрос.УстановитьПараметр("Идентификатор", ВыбранныйТрафикID);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДанныеТрафика.Вставить("Отдел", Выборка.Отдел);
		ДанныеТрафика.Вставить("Менеджер", Выборка.Менеджер);
		ДанныеТрафика.Вставить("Клиент", Выборка.Клиент);
		ДанныеТрафика.Вставить("ПервичныйПовторный", Выборка.ПервичныйПовторный);
		ДанныеТрафика.Вставить("Комментарий", Выборка.Комментарий);
		ДанныеТрафика.Вставить("ПервичныйИнтерес", Выборка.ПервичныйИнтерес);
		ДанныеТрафика.Вставить("ИсточникИнформации", Выборка.ИсточникИнформации);
		ДанныеТрафика.Вставить("Наименование", Выборка.Наименование); 
		ДанныеТрафика.Вставить("БылаВыдача", Выборка.БылаВыдача);
		ДанныеТрафика.Вставить("МодельАвтомобиля", Выборка.МодельАвтомобиля);
	КонецЕсли;    	
	
	//Прочитаем события
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_СобытияПоРабочимЛистам.ВидСобытия КАК Событие,
	|	CRM_СобытияПоРабочимЛистам.Дата КАК Дата
	|ИЗ
	|	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
	|		ПО Renault_РабочиеЛисты.IDK = CRM_СобытияПоРабочимЛистам.IDK
	|ГДЕ
	|	CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
	|	И Renault_РабочиеЛисты.Клиент = &Клиент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	Запрос.УстановитьПараметр("Клиент", Выборка.Клиент);
	ТабВзаимодействия = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр Из ТабВзаимодействия Цикл
		СтрокаВзаимодействия = Новый Структура("Событие, Дата");
		ЗаполнитьЗначенияСвойств(СтрокаВзаимодействия, Стр);
		
		ДанныеПоВзаимодействиям.Добавить(СтрокаВзаимодействия);
	КонецЦикла; 	
	
	ОтветЛиду = НайтиСохраненныйОтвет(ВыбранныйТрафикID);	
	ОбщиеДанные.Вставить("ОтветЛиду", ОтветЛиду);
	
	//Если ТипВыбранногоТрафика <> Справочники.CRM_ТипТрафика.Email Тогда //Закоментировал, так как не ясно для чего это
		Телефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(Выборка.Клиент);
		ОбщиеДанные.Вставить("Телефон", Телефон);
	//КонецЕсли;
	//Если ТипВыбранногоТрафика <> Справочники.CRM_ТипТрафика.Email Тогда //Закоментировал, так как не ясно для чего это
		Email = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(Выборка.Клиент);
		ОбщиеДанные.Вставить("Email", Email);
	//КонецЕсли;
	
	ТЗКлиенты = НайтиКлиентов(Телефон, Email);
	
	Если ТЗКлиенты.Количество() > 0 Тогда  		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТЗКлиенты ИЗ &ТЗКлиенты КАК ТЗКлиенты";
		Запрос.УстановитьПараметр("ТЗКлиенты", ТЗКлиенты);
		Запрос.Выполнить();
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_РабочиеЛисты.ID,
		|	Renault_РабочиеЛисты.Клиент,
		|	Renault_РабочиеЛисты.Сотрудник,
		|	Renault_РабочиеЛисты.ЛистЗакрыт,
		|	ТЗКлиенты.Почта,
		|	ТЗКлиенты.Телефон,
		|	Renault_РабочиеЛисты.ДатаID КАК Дата,
		|	Renault_РабочиеЛисты.IDK
		|ИЗ
		|	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЗКлиенты КАК ТЗКлиенты
		|		ПО Renault_РабочиеЛисты.Клиент.Ссылка = ТЗКлиенты.Ссылка";
	Иначе		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_РабочиеЛисты.ID,
		|	Renault_РабочиеЛисты.Клиент,
		|	Renault_РабочиеЛисты.Сотрудник,
		|	Renault_РабочиеЛисты.ЛистЗакрыт,
		|	"""" КАК Почта,
		|	"""" КАК Телефон,
		|	Renault_РабочиеЛисты.ДатаID КАК Дата,
		|	Renault_РабочиеЛисты.IDK
		|ИЗ
		|	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
		|ГДЕ Renault_РабочиеЛисты.Клиент.Ссылка = &Клиент";
		Запрос.УстановитьПараметр("Клиент", Выборка.Клиент);  		 		
	КонецЕсли;
	ТабРабочиеЛисты = Запрос.Выполнить().Выгрузить();  	
	
	Для Каждого Эл Из ТабРабочиеЛисты Цикл
		СтрокаРЛ = Новый Структура("ID, Клиент, Сотрудник, ЛистЗакрыт, Почта, Телефон, Дата, IDK");
		ЗаполнитьЗначенияСвойств(СтрокаРЛ, Эл);
		
		ДанныеПоРабочимЛистам.Добавить(СтрокаРЛ);
	КонецЦикла; 
	
	ДанныеПоКлиенту = Новый Структура("ОбщиеДанные, ДанныеТрафика, ДанныеПоВзаимодействиям, ДанныеПоРабочимЛистам",
		ОбщиеДанные, ДанныеТрафика, ДанныеПоВзаимодействиям, ДанныеПоРабочимЛистам);
	
	Возврат ДанныеПоКлиенту; 
КонецФункции

&НаСервереБезКонтекста
Функция НайтиСохраненныйОтвет(ВыбранныйТрафикID)
	ОбработкаОК = Обработки.Renault_АРМ_ОнлайнКонсультант.Создать();   	
	ОтветЛиду = ОбработкаОК.ЗагрузитьСохраненныйОтвет(ВыбранныйТрафикID);
	
	Возврат ОтветЛиду;
КонецФункции

&НаСервереБезКонтекста
Функция НайтиКлиентов(Телефон, Почта)
	
	Запрос = Новый Запрос;
	ТЗКлиенты = Новый ТаблицаЗначений;
	Телефон = СокрЛП(Телефон);
	Почта = СокрЛП(Почта);
	Если СтрДлина(Телефон) < 6 Тогда Телефон = ""; КонецЕсли;
	Если СтрДлина(Почта) < 6 Тогда Почта = ""; КонецЕсли;
	Если Телефон = "" И Почта = "" Тогда Возврат ТЗКлиенты; КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КИПочта.Ссылка,
	|	КИПочта.Почта КАК Почта,
	|	"""" КАК Телефон
	|ПОМЕСТИТЬ КИ
	|ИЗ
	|	(ВЫБРАТЬ
	|		КИ_Почта.Объект.Ссылка КАК Ссылка,
	|		ВЫРАЗИТЬ(КИ_Почта.Представление КАК СТРОКА(100)) КАК Почта
	|	ИЗ
	|		РегистрСведений.КонтактнаяИнформация КАК КИ_Почта
	|	ГДЕ
	|		КИ_Почта.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|		И (ВЫРАЗИТЬ(КИ_Почта.Представление КАК СТРОКА(100))) = &Почта
	|		И НЕ &Почта = """") КАК КИПочта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КИТелефон.Ссылка,
	|	"""",
	|	КИТелефон.Телефон
	|ИЗ
	|	(ВЫБРАТЬ
	|		КИ_Телефон.Объект.Ссылка КАК Ссылка,
	|		ВЫРАЗИТЬ(КИ_Телефон.Представление КАК СТРОКА(100)) КАК Телефон,
	|		"""" КАК Почта
	|	ИЗ
	|		РегистрСведений.КонтактнаяИнформация КАК КИ_Телефон
	|	ГДЕ
	|		КИ_Телефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|		И (ВЫРАЗИТЬ(КИ_Телефон.Представление КАК СТРОКА(100))) = &Телефон
	|		И НЕ &Телефон = """") КАК КИТелефон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КИ.Ссылка,
	|	МАКСИМУМ(КИ.Почта) КАК Почта,
	|	МАКСИМУМ(КИ.Телефон) КАК Телефон
	|ИЗ
	|	КИ КАК КИ
	|
	|СГРУППИРОВАТЬ ПО
	|	КИ.Ссылка";
	Запрос.УстановитьПараметр("Почта", Почта);
	Запрос.УстановитьПараметр("Телефон", Телефон);
	ТЗКлиенты = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗКлиенты;
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьСтрокуШтмлСообщения(ОбработкаОК, ПредДатаСообщения, ПредВывод, НачатаТаблица, Сообщение, ЭтоСообщениеОператора = Ложь, НаименованиеОператора)
	СсылкаНаКартинкуОнлайнКонсультанта = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.Renault_OnlineCons_Grey);

	ТекстКВозврату = "";
	ПредыдущийГод = Год(ПредДатаСообщения);
	ПредыдущийМесяц = Месяц(ПредДатаСообщения);
	ПредыдущийДень = День(ПредДатаСообщения);
	ТекущийГод = Год(Сообщение.ДатаСообщения);
	ТекущийМесяц = Месяц(Сообщение.ДатаСообщения);
	ТекущийДень = День(Сообщение.ДатаСообщения);
	ЭтоНовыйДеньСоощений = НЕ((ПредыдущийДень = ТекущийДень) И (ПредыдущийМесяц = ТекущийМесяц) И (ПредыдущийГод = ТекущийГод));
	Если ЭтоНовыйДеньСоощений Тогда
		Если НачатаТаблица Тогда
			ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "/TBODY", 3);
			ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "/TABLE", 2);
			ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "HR", 2);
			НачатаТаблица = Ложь;
		КонецЕсли;
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TABLE", 2, ОбработкаОК.СтруктураПараметровТаблицы("100%"));
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TBODY", 3);
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TR", 4);
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TD", 5, ОбработкаОК.СтруктураПараметровЯчейки("", "", "DateText"), Формат(Сообщение.ДатаСообщения,"ДФ=""дд.ММ.гг"""), Истина);
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "/TR", 4);
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "/TBODY", 3);
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "/TABLE", 2);
		ПредДатаСообщения = Сообщение.ДатаСообщения;
	КонецЕсли;
	ИмяОтправителя = Сообщение.ИмяПользователя;
	имяКласса = "IsFor";
	Если ЭтоСообщениеОператора Тогда
		ИмяОтправителя = НаименованиеОператора;
		ИмяКласса ="IsFrom";
	КонецЕсли;
	ПродолжитьВыводСообщения = (ПредВывод = ИмяОтправителя) И (НЕ ЭтоНовыйДеньСоощений);
	Если Не ПродолжитьВыводСообщения Тогда
		Если НачатаТаблица Тогда
			ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "/TBODY", 3);
			ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "/TABLE", 2);
		КонецЕсли;
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TABLE", 2, ОбработкаОК.СтруктураПараметровТаблицы("100%"));
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TBODY", 3);
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TR", 4);
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TD", 5, ОбработкаОК.СтруктураПараметровЯчейки("25"));
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "IMG", 6, ОбработкаОК.СтруктураПараметровКартинки(СсылкаНаКартинкуОнлайнКонсультанта,"24", "24"));
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "/TD", 5);
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TD", 5, ОбработкаОК.СтруктураПараметровЯчейки("","","UserNick"), " > "+ИмяОтправителя+" ", Истина);
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "/TR", 4);
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "/TBODY", 3);
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "/TABLE", 2);
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TABLE", 2, ОбработкаОК.СтруктураПараметровТаблицы("100%"));
		ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TBODY", 3);
		НачатаТаблица = Истина;
		ПредВывод = ИмяОтправителя;
	КонецЕсли;
	ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TR", 4);
	ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TD", 5, ОбработкаОК.СтруктураПараметровЯчейки("45", "", "DateText", "right", "top"),
	Формат(Сообщение.ДатаСообщения,"ДФ=""ЧЧ:мм:сс"""), Истина);
	ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TD", 5, ОбработкаОК.СтруктураПараметровЯчейки("5", "", "UserNick", "right", "top"), ">", Истина);
	ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "TD", 5, ОбработкаОК.СтруктураПараметровЯчейки("", "" ,ИмяКласса), Сообщение.Сообщение, Истина);
	ОбработкаОК.ДобавитьТэгШтмл(ТекстКВозврату, "/TR", 4);
	Возврат ТекстКВозврату;
	
КонецФункции

&НаСервереБезКонтекста
Процедура НаименованиеПриИзмененииСервер(ВыбранныйТрафикID, Наименование)
	Если ЗначениеЗаполнено(ВыбранныйТрафикID) Тогда
		ЗаписьТрафика = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ВыбранныйТрафикID);
		ЗаписьТрафика.Наименование = Наименование;
		ЗаписьТрафика.Записать();
	КонецЕсли; 	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПервичныйПовторныйИриИзмененииСервер(ВыбранныйТрафикID, ПервичныйПовторный)
	Если ЗначениеЗаполнено(ВыбранныйТрафикID) Тогда
		ЗаписьТрафика = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ВыбранныйТрафикID);
		ЗаписьТрафика.ПервичныйПовторный = ПервичныйПовторный;
		ЗаписьТрафика.Записать();
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИсточникИнформацииПриИзмененииСервер(ВыбранныйТрафикID, ИсточникИнформации)
	Если ЗначениеЗаполнено(ВыбранныйТрафикID) Тогда
		ЗаписьТрафика = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ВыбранныйТрафикID);
		ЗаписьТрафика.ИсточникИнформации = ИсточникИнформации;
		ЗаписьТрафика.Записать();
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтделПриИзмененииСервер(ВыбранныйТрафикID, Отдел)
	Если ЗначениеЗаполнено(ВыбранныйТрафикID) Тогда
		ЗаписьТрафика = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ВыбранныйТрафикID);
		ЗаписьТрафика.Отдел = Отдел;
		ЗаписьТрафика.Записать();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПервичныйИнтересПриИзмененииСервер(ВыбранныйТрафикID, ПервичныйИнтерес)
	Если ЗначениеЗаполнено(ВыбранныйТрафикID) Тогда
		ЗаписьТрафика = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ВыбранныйТрафикID);
		ЗаписьТрафика.ПервичныйИнтерес = ПервичныйИнтерес;
		ЗаписьТрафика.Записать();
	КонецЕсли;   
КонецПроцедуры

&НаСервереБезКонтекста
Процедура МенеджерПисьмоПриИзмененииСервер(Ид, Менеджер, Отдел)
	Если ЗначениеЗаполнено(Ид) Тогда
		ЗаписьТрафика = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(Ид);
		ЗаписьТрафика.Менеджер = Менеджер;
		Отдел = Renault_CRM.ПолучитьОтделСотрудника(Менеджер);
		ЗаписьТрафика.Отдел = Отдел;
		ЗаписьТрафика.Записать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ТаблицаСтатусыОформление()
	ЦветФонаОффлайн = Новый Цвет(255, 210, 150);
	ЦветФонаОнлайн = Новый Цвет(206, 255, 206); 	
	
	ДобавитьОформлениеТаблицаСтатусы(ЦветФонаОффлайн, "Offline");
	ДобавитьОформлениеТаблицаСтатусы(ЦветФонаОнлайн, "Online"); 
КонецПроцедуры

&НаСервере
Процедура ДобавитьОформлениеТаблицаСтатусы(ЦветФона, Статус)
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Использование = Истина;
	
	ОформлениеУО = ЭлементУсловногоОформления.Оформление;
	ОтборУО = ЭлементУсловногоОформления.Отбор;
	ОформляемыеПоляУО = ЭлементУсловногоОформления.Поля;
	
	ОформлениеУО.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
	
	ЭлементОтбора = ОтборУО.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаСтатусы.Статус");	
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Статус;
	ЭлементОтбора.Использование  = Истина; 	
	
	ОформляемоеПоле = ОформляемыеПоляУО.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаСтатусыСтатус"); 	
КонецПроцедуры

&НаСервере
Процедура ТаблицаТрафикаОформление()
	ЦветФонаОбработан = Новый Цвет(230, 230, 230);
	ЦветФонаОнлайн = Новый Цвет(0, 255, 0);
	ЦветФонаЛидПросрочка = Новый Цвет(255, 130, 100);

	ШрифтЕстьНовыеСообщения = Новый Шрифт(Элементы.ТаблицаТрафика.Шрифт, , , Истина);
	                   
	ДобавитьОформлениеТаблицаТрафик("Шрифт", ШрифтЕстьНовыеСообщения, Новый Структура("ЕстьНовыеСообщения",  Истина), Ложь); 
	ДобавитьОформлениеТаблицаТрафик("ЦветФона", ЦветФонаОбработан, Новый Структура("ЕстьНовыеСообщения, Обработан",  Ложь, Истина), Ложь); 
	ДобавитьОформлениеТаблицаТрафик("ЦветФона", ЦветФонаОнлайн, Новый Структура("ПользовательОнлайн, Обработан",  Истина, Ложь), Истина); 
	ДобавитьОформлениеТаблицаТрафик("ЦветФона", ЦветФонаЛидПросрочка, Новый Структура("ТипТрафика, Обработан, ОбработатьДО", ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.ЛидRenault"), Ложь, ТекущаяДата()), Ложь); 
КонецПроцедуры

&НаСервере
Процедура ДобавитьОформлениеТаблицаТрафик(ПараметрОформления, ЗначениеПараметраОформления, Отборы, ТолькоДляЯчейки)
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Использование = Истина;
	
	ОформлениеУО = ЭлементУсловногоОформления.Оформление;
	ОтборУО = ЭлементУсловногоОформления.Отбор;
	ОформляемыеПоляУО = ЭлементУсловногоОформления.Поля;
	
	ОформлениеУО.УстановитьЗначениеПараметра(ПараметрОформления, ЗначениеПараметраОформления);
	
	Для Каждого Отбор Из Отборы Цикл 		
		ЭлементОтбора = ОтборУО.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаТрафика." + Отбор.Ключ);
		Если Отбор.Ключ = "ОбработатьДО" Тогда
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		Иначе
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		КонецЕсли;
		ЭлементОтбора.ПравоеЗначение = Отбор.Значение;
		ЭлементОтбора.Использование  = Истина;
	КонецЦикла;
	
	Если ТолькоДляЯчейки Тогда
		ОформляемоеПоле = ОформляемыеПоляУО.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаТрафикаПользовательОнлайн");  
	Иначе
		ПодЭлТаблицаТрафика = Элементы.ТаблицаТрафика.ПодчиненныеЭлементы;
		Для Каждого Эл Из ПодЭлТаблицаТрафика Цикл
			ЭлИмя = Эл.Имя;
			ОформляемоеПоле = ОформляемыеПоляУО.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ЭлИмя);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьКартинкиТаблицаТрафик()
	ТипТрафикаEmail = ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.Email");
	ТипТрафикаЛид = ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.ЛидRenault");
	ТипТрафикаOnlineКонсультант = ПредопределенноеЗначение("Справочник.CRM_ТипТрафика.OnlineКонсультант");
	
	Для Каждого Эл Из ТаблицаТрафика Цикл
		Если Эл.ТипТрафика = ТипТрафикаEmail Тогда
			Эл.ТипТрафикаКартинка = КартинкаПисьмо;
		ИначеЕсли Эл.ТипТрафика = ТипТрафикаЛид Тогда
			Эл.ТипТрафикаКартинка = КартинкаЛИД; 			
		ИначеЕсли Эл.ТипТрафика = ТипТрафикаOnlineКонсультант Тогда
			Эл.ТипТрафикаКартинка = КартинкаЧат;
		КонецЕсли;   		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НачальноеОтображаениеЧатаИДанныхКлиента()
	ТекущаяЗакладкаМеню = 0;
	
	ПодчиненныеЭлементыГрКнопкиМеню = Элементы.грКнопкиМеню.ПодчиненныеЭлементы;
	Для Каждого Эл Из ПодчиненныеЭлементыГрКнопкиМеню Цикл
		Если Эл.Имя = "кнРабочиеЛисты" Тогда
			Эл.Видимость = Ложь;
		Иначе
			Эл.Видимость = Истина;
		КонецЕсли;		
	КонецЦикла;
	
	ПодчиненныеЭлементыгрЛеваяКолонкаОсновноеТело = Элементы.грЛеваяКолонкаОсновноеТело.ПодчиненныеЭлементы;
	Для Каждого Эл Из ПодчиненныеЭлементыгрЛеваяКолонкаОсновноеТело Цикл
		Если Эл.Имя = "грЧатОбщение" Тогда
			Эл.Видимость = Истина;
		Иначе
			Эл.Видимость = Ложь;
		КонецЕсли;
	КонецЦикла;

	ПолеЧата = "";
	ПолеВводаТекстСообщения = "";
	Если НеВозвращатьТрафик Тогда
		НеВозвращатьТрафикНажатие();
	КонецЕсли;	
	
	ТЗРабочиеЛисты.Очистить();
	
	Вложения.Очистить();
		
	Элементы.НадписьПисьмоИнфо.Видимость = Ложь;
	Элементы.НадписьЛидИнфо.Видимость = Ложь;
	
	Взаимодействия.Очистить();
	
	Элементы.ПолеКартинкиВыдача.Доступность = Ложь;
	Элементы.ПолеЕстьРабочийЛист.Доступность = Ложь;	
	Элементы.НадписьФИО.Заголовок = "<ФИО не указано>";   	
	Элементы.НадписьМодельАвтомобиля.Заголовок = "  <Автомобиль неизвестен>";
	
	Объект.ИдПользователя = "";
	Клиент = "";
	ВыбранныйТрафикID = "";
	ТипВыбранногоТрафика = "";
	ТекущийДЦ = "";
	ВыбранныйКлиент = ""; 
	
	ИсторияТекст = "";

	Элементы.грЛеваяКолонка.Доступность = Ложь;	
	
	УправлениеМеню();
КонецПроцедуры

&НаКлиенте
Процедура кнСтараяФорма(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры











































