// Модуль документа ПеремещениеТоваров

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем тКэшСуммСписания Экспорт;		// Переменная для кэширования результатов вычисления суммы списания
Перем ФлагПерерасчет;               // Переменная для обозначения того, что ведется перерасчет суммы документа
Перем ИмяРеквизитаКода Экспорт;     // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/артикула в ТЧ
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

Функция СформироватьРезервированиеЗаказовПокупателя() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РезервированиеЗаказовПокупателя.Ссылка КАК РезЗакПокуп,
	|	РезервированиеЗаказовПокупателя.ДокументОснование,
	|	РезервированиеЗаказовПокупателя.ПометкаУдаления
	|ИЗ
	|	Документ.РезервированиеЗаказовПокупателя КАК РезервированиеЗаказовПокупателя
	|ГДЕ
	|	РезервированиеЗаказовПокупателя.ДокументОснование = &ДокументОснование
	|	И РезервированиеЗаказовПокупателя.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если ТЗ.Количество() = 0 Тогда
		РезервированиеЗаказовПокупателя = Документы.РезервированиеЗаказовПокупателя.СоздатьДокумент();
	Иначе
		РезервированиеЗаказовПокупателя=ТЗ[0].РезЗакПокуп.ПолучитьОбъект();
	КонецЕсли; 
	
	РезервированиеЗаказовПокупателя.ОбработкаЗаполнения(Ссылка);
	
	ЕстьОшибки = Ложь; 
	
	Попытка	
		РезервированиеЗаказовПокупателя.Записать(РежимЗаписиДокумента.Проведение);   
	Исключение	
		ЕстьОшибки = Истина; 
	КонецПопытки;
	
	Если ЕстьОшибки Тогда
		Сообщить("ОШИБКА! Документ 'Резервирование заказов покупателя' не сформирован.",СтатусСообщения.ОченьВажное);
	Иначе
		Если ТЗ.Количество() = 0 Тогда
			Сообщить("Сформирован новый документ: "+РезервированиеЗаказовПокупателя,СтатусСообщения.Информация);	
		Иначе
			Сообщить("Перезаполнен существующий документ: "+РезервированиеЗаказовПокупателя,СтатусСообщения.Информация);	
		КонецЕсли; 		
	КонецЕсли; 
	
	Возврат ЕстьОшибки;
	
	
КонецФункции // СформироватьРезервированиеЗаказовПокупателя()


// получает цену на товар из документа поставки
//
// Параметры:
//  ДокПоставки                - Характеристика - ТипыПартий,
//  Номенклатура               - СправочникСсылка - Номенклатура,
//  СтавкаНДС                  - СправочникСсылка - СтавкиНДС,
//  ХарактеристикаНоменклатуры - СправочникСсылка - ХарактеристикиНоменклатуры.
//
// Возвращаемое значение:
//  Цена - число - цена на товар из документа поставки.
//
Функция ПолучитьЦенуИзДокументаПоставки(ДокПоставки,Номенклатура,СтавкаНДС=Неопределено,ХарактеристикаНоменклатуры=Неопределено)
	// проверки
	Если обЗначениеНеЗаполнено(ДокПоставки) Тогда Возврат 0; КонецЕсли;
	Если обЗначениеНеЗаполнено(Номенклатура) Тогда Возврат 0; КонецЕсли;
	ДокПоставкиТовары=ДокПоставки.Метаданные().ТабличныеЧасти.Найти("Товары");
	Если ДокПоставкиТовары=Неопределено Тогда Возврат 0; КонецЕсли; 
	ЕстьЦена=(ДокПоставкиТовары.Реквизиты.Найти("Цена")<>Неопределено);
	ЕстьСтавкаНДС=(ДокПоставкиТовары.Реквизиты.Найти("СтавкаНДС")<>Неопределено);
	ЕстьТипЦен=(ДокПоставки.Метаданные().Реквизиты.Найти("ТипЦен")<>Неопределено);
	
	// получаем цены
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	"+?(ЕстьЦена,"ДокТовары.Цена","0")+" КАК Цена,
	|	"+?(ЕстьСтавкаНДС,"ДокТовары.СтавкаНДС","ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)")+" КАК СтавкаНДС,
	|	"+?(ЕстьТипЦен,"ДокТовары.Ссылка.ТипЦен","ЗНАЧЕНИЕ(Справочник.ТипыЦен.ПустаяСсылка)")+" КАК ТипЦен
	|ИЗ
	|	Документ."+ДокПоставки.Метаданные().Имя+".Товары КАК ДокТовары
	|ГДЕ
	|	ДокТовары.Ссылка=&Ссылка И ДокТовары.Номенклатура=&Номенклатура
	|"+?(обЗначениеНеЗаполнено(ХарактеристикаНоменклатуры),""," И ДокТовары.ХарактеристикаНоменклатуры=&ХарактеристикаНоменклатуры"));
	Запрос.УстановитьПараметр("Ссылка",ДокПоставки);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
	РезультатЦена=Запрос.Выполнить();
	Цена=0;
	Если НЕ РезультатЦена.Пустой() Тогда
		СтрокаДокумента = РезультатЦена.Выгрузить().Получить(0);
		Цена = дкПересчетЦены(СтрокаДокумента.Цена,СтрокаДокумента.ТипЦен,СтрокаДокумента.СтавкаНДС,ТипЦен,СтавкаНДС);
	КонецЕсли;
	
	Возврат Цена;
КонецФункции // ПолучитьЦенуИзДокументаПоставки()

// Заполняет резервами подразделения
//
// Параметры:
//  ЗаказВнутренний - ДокументСсылка - ДокументОснование.
//
Процедура ЗаполнитьРезервамиПодразделения(ЗаказВнутренний) Экспорт
	
	НДС20 = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
	Запрос = Новый Запрос;
	
	Если Ссылка.Пустая() Тогда
		Запрос.Текст= "ВЫБРАТЬ
		              |	ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
		              |	ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		              |	ЗаказыПокупателейОстатки.РезервОстаток КАК Количество,
		              |	ЗаказыПокупателейОстатки.Контрагент,
		              |	ЗаказыПокупателейОстатки.СкладКомпании КАК СкладыКомпании,
		              |	ЗаказыПокупателейОстатки.Заказ КАК ЗаказПокупателя,
		              |	ЗаказыПокупателейОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
		              |	ЗаказыПокупателейОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент КАК Коэффициент,
		              |	ЗаказыПокупателейОстатки.СуммаУпрОстаток КАК Сумма
		              |ИЗ
		              |	РегистрНакопления.ЗаказыПокупателей.Остатки(
		              |			,
		              |			Контрагент В ИЕРАРХИИ (&РодительПодразделенияПолучателя)
		              |				И СкладКомпании.Подразделение В ИЕРАРХИИ (&РодительПодразделенияОтправителя)
		              |				И ТИПЗНАЧЕНИЯ(Заказ) = ТИП(Документ.ЗаказВнутренний)) КАК ЗаказыПокупателейОстатки";
	Иначе
		Запрос.Текст= "ВЫБРАТЬ
		              |	ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
		              |	ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		              |	ЗаказыПокупателейОстатки.РезервОстаток КАК Количество,
		              |	ЗаказыПокупателейОстатки.Контрагент,
		              |	ЗаказыПокупателейОстатки.СкладКомпании КАК СкладыКомпании,
		              |	ЗаказыПокупателейОстатки.Заказ КАК ЗаказПокупателя,
		              |	ЗаказыПокупателейОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
		              |	ЗаказыПокупателейОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент КАК Коэффициент,
		              |	ЗаказыПокупателейОстатки.СуммаУпрОстаток КАК Сумма
		              |ИЗ
		              |	РегистрНакопления.ЗаказыПокупателей.Остатки(
		              |			&НаМомент,
		              |			Контрагент В ИЕРАРХИИ (&РодительПодразделенияПолучателя)
		              |				И СкладКомпании.Подразделение В ИЕРАРХИИ (&РодительПодразделенияОтправителя)
		              |				И ТИПЗНАЧЕНИЯ(Заказ) = ТИП(Документ.ЗаказВнутренний)) КАК ЗаказыПокупателейОстатки";
		Запрос.УстановитьПараметр("НаМомент",МоментВремени());
	КонецЕсли; 
	Запрос.УстановитьПараметр("РодительПодразделенияОтправителя", ПодразделениеОтправитель);
	Запрос.УстановитьПараметр("Заказ",ЗаказВнутренний);
	Запрос.УстановитьПараметр("РодительПодразделенияПолучателя",ПодразделениеПолучатель);
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Для каждого Стр Из Товары Цикл
	    Стр.КоличествоБазовое = Стр.Количество;
		Стр.СтавкаНДС = НДС20;
		Стр.СуммаВсего = Стр.Сумма;
		Стр.СуммаНДС = Стр.Сумма * ( НДС20.Ставка / (100 + НДС20.Ставка) );
		Стр.СкладыПолучатели=НайтиСкладЗапчастей(Стр.СкладыКомпании.Организация,ПодразделениеОтправитель);
		Стр.ПодразделенияПолучатели=НайтиПодразделениеЗапчастей(Стр.СкладыКомпании.Организация,ПодразделениеПолучатель);
		
		//Бондаренко++ 20200521   
		// Холышевская ++ 04.04.2026 #10598
		// БЫЛО
		//СкладСхемы = Справочники.СхемыИерархическихСкладов.НайтиПоРеквизиту("ДилерскийЦентр",ПодразделениеКомпании.ДилерскийЦентр);
		// СТАЛО   
		ДЦ = ПодразделениеКомпании.ДилерскийЦентр; 
		Если ДЦ = Справочники.ДилерскиеЦентры.Шолохова237 Тогда 
			ДЦ = Справочники.ДилерскиеЦентры.НайтиПоКоду("000000019");
		КонецЕсли;  
		СкладСхемы = Справочники.СхемыИерархическихСкладов.НайтиПоРеквизиту("ДилерскийЦентр", ДЦ);
		// Холышевская -- 04.04.2026
		Если Не обЗначениеНеЗаполнено(СкладСхемы.ОсновнойСкладСхемы) Тогда
			ЯчейкаСсылка=Стр.Номенклатура.ПолучитьОбъект().ПолучитьЯчейкуХранения(СкладСхемы.ОсновнойСкладСхемы);
			Стр.ЯчейкаОтправитель=ЯчейкаСсылка;
		КонецЕсли; 
		//Бондаренко-- 20200521
  
 	КонецЦикла; 
 	
КонецПроцедуры // ЗаполнитьРезервамиПодразделения()

Процедура ЗаполнитьОстаткамиЭкспедиторскихСкладов() Экспорт
	НДС20 = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
	Запрос = Новый Запрос;
	
	Если Ссылка.Пустая() Тогда
		Запрос.Текст= "ВЫБРАТЬ
		              |	ОстаткиЭкспедиторскихСкладов.Номенклатура КАК Номенклатура,
		              |	ОстаткиЭкспедиторскихСкладов.СкладКомпании КАК СкладыКомпании,
		              |	СУММА(ОстаткиЭкспедиторскихСкладов.КоличествоОстаток) КАК Количество
		              |ИЗ
		              |	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
		              |			,
		              |			СкладКомпании.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.Экспедитор)
		              |				И СкладКомпании.Подразделение В ИЕРАРХИИ (&РодительПодразделенияОтправителя)) КАК ОстаткиЭкспедиторскихСкладов
		              |
		              |СГРУППИРОВАТЬ ПО
		              |	ОстаткиЭкспедиторскихСкладов.Номенклатура,
		              |	ОстаткиЭкспедиторскихСкладов.СкладКомпании";
	Иначе
		Запрос.Текст= "ВЫБРАТЬ
		              |	ОстаткиЭкспедиторскихСкладов.Номенклатура КАК Номенклатура,
		              |	ОстаткиЭкспедиторскихСкладов.СкладКомпании КАК СкладыКомпании,
		              |	СУММА(ОстаткиЭкспедиторскихСкладов.КоличествоОстаток) КАК Количество
		              |ИЗ
		              |	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
		              |			&НаМомент,
		              |			СкладКомпании.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.Экспедитор)
		              |				И СкладКомпании.Подразделение В ИЕРАРХИИ (&РодительПодразделенияОтправителя)) КАК ОстаткиЭкспедиторскихСкладов
		              |
		              |СГРУППИРОВАТЬ ПО
		              |	ОстаткиЭкспедиторскихСкладов.Номенклатура,
		              |	ОстаткиЭкспедиторскихСкладов.СкладКомпании";
		Запрос.УстановитьПараметр("НаМомент",МоментВремени());
	КонецЕсли; 
	Запрос.УстановитьПараметр("РодительПодразделенияОтправителя", ПодразделениеОтправитель);
 	//Запрос.УстановитьПараметр("РодительПодразделенияПолучателя",ПодразделениеПолучатель);
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Для каждого Стр Из Товары Цикл
		Стр.ЕдиницаИзмерения = Стр.Номенклатура.ОсновнаяЕдиницаИзмерения;
		Стр.Коэффициент = Стр.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент;
	    Стр.КоличествоБазовое = Стр.Количество;
		Стр.СтавкаНДС = НДС20;
		Стр.СуммаВсего = Стр.Сумма;
		Стр.СуммаНДС = Стр.Сумма/6;
		Стр.СкладыПолучатели = НайтиСкладЗапчастей(Стр.СкладыКомпании.Организация,ПодразделениеПолучатель);
  	КонецЦикла; 
КонецПроцедуры

Функция НайтиСкладЗапчастей(ОрганизацияСкладаОтправителя,РодительПодразделенияПолучателя)
	 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкладыКомпании.Ссылка,
		|	СкладыКомпании.Подразделение.Родитель,
		|	СкладыКомпании.Организация,
		|	СкладыКомпании.Основной
		|ИЗ
		|	Справочник.СкладыКомпании КАК СкладыКомпании
		|ГДЕ
		|	СкладыКомпании.Подразделение В ИЕРАРХИИ(&Подразделение)
		|	И СкладыКомпании.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ВидыСкладов.Обычный)
		|	И СкладыКомпании.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.Экспедитор)
		|	И СкладыКомпании.Организация = &Организация
		|	И СкладыКомпании.Основной = ИСТИНА";
	
 	Запрос.УстановитьПараметр("Организация", ОрганизацияСкладаОтправителя);
 	Запрос.УстановитьПараметр("Подразделение", РодительПодразделенияПолучателя);
 	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Справочники.СкладыКомпании.ПустаяСсылка();

КонецФункции // НайтиСкладЗапчастей(ОрганизацияСкладаОтправителя,РодительПодразделенияПолучателя)

Функция НайтиПодразделениеЗапчастей(ОрганизацияСкладаОтправителя,РодительПодразделенияПолучателя)
	 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияКомпании.Ссылка КАК ТекущееПодразделениеПолучатель,
		|	ПодразделенияКомпании.Родитель,
		|	ПодразделенияКомпании.Организация
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|ГДЕ
		|	ПодразделенияКомпании.Ссылка В ИЕРАРХИИ(&РодительПодразделения)
		|	И ПодразделенияКомпании.Организация = &Организация";
	
 	Запрос.УстановитьПараметр("Организация", ОрганизацияСкладаОтправителя);
 	Запрос.УстановитьПараметр("РодительПодразделения", РодительПодразделенияПолучателя);
 	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ТекущееПодразделениеПолучатель;
	КонецЦикла;
	
	Возврат Справочники.СкладыКомпании.ПустаяСсылка();

КонецФункции // НайтиПодразделениеЗапчастей(ОрганизацияСкладаОтправителя,РодительПодразделенияПолучателя)

 
 

// Заполняет резервами под заказ покупателя
//
// Параметры:
//  ЗаказПокупателя - ДокументСсылка - ДокументОснование.
//
Процедура ЗаполнитьРезервамиПодЗаказ(ЗаказПокупателя = Неопределено) Экспорт
	// очистим таблицу товаров
	Товары.Очистить();
	Если НЕ обЗначениеНеЗаполнено(ЗаказПокупателя) Тогда
		ТоварыЗаказа = ЗаказПокупателя.Товары;
	Иначе
		ТоварыЗаказа = Неопределено;
	КонецЕсли;
	
	ЕстьЗаказ = ЗначениеЗаполнено(ЗаказПокупателя);
	Запрос = Новый Запрос;
	Запрос.Текст= "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЗаказыПокупателейОстатки.Заказ КАК ЗаказПокупателя,
	|	ЗаказыПокупателейОстатки.РезервОстаток КАК Количество,
	|	ЕСТЬNULL(ЗаказыПокупателей.ЗаказаноОстаток, 0) КАК Заказано,
	|	ЕСТЬNULL(ЗаказыПокупателей.СуммаОстаток,    0) КАК Сумма,
	|	ЕСТЬNULL(ЗаказыПокупателей.СуммаУпрОстаток, 0) КАК СуммаУпр
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки("+?(Ссылка.Пустая(),"","&НаМомент")+", " + ?(ЕстьЗаказ, "Заказ = &Заказ И ", "") + "СкладКомпании = &СкладКомпании) КАК ЗаказыПокупателейОстатки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки("+?(Ссылка.Пустая(),"","&НаМомент")+", " + ?(ЕстьЗаказ, "Заказ = &Заказ", "") + ") КАК ЗаказыПокупателей
	|ПО
	|	ЗаказыПокупателейОстатки.Заказ                      = ЗаказыПокупателей.Заказ И 
	|	ЗаказыПокупателейОстатки.Номенклатура               = ЗаказыПокупателей.Номенклатура И 
	|	ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры = ЗаказыПокупателей.ХарактеристикаНоменклатуры
	|";
	
	Запрос.УстановитьПараметр("НаМомент",      МоментВремени());
	Запрос.УстановитьПараметр("СкладКомпании", ПодразделениеОтправитель);
	Запрос.УстановитьПараметр("Заказ",         ЗаказПокупателя);
	
	ВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	Выборка   = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТоваров = Товары.Добавить();
		СтрокаТоваров.Номенклатура               = Выборка.Номенклатура;
		СтрокаТоваров.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
		СтрокаТоваров.ЗаказПокупателя            = Выборка.ЗаказПокупателя;
		СтрокаТоваров.Количество                 = Выборка.Количество;
		ОбработкаРеквизита("Товары.Номенклатура", СтрокаТоваров);
		
		Если Выборка.Заказано>0 Тогда
			СуммаСтроки    = 0;
			Если ТипЗнч(СтрокаТоваров.ЗаказПокупателя)=Тип("ДокументСсылка.ЗаказПокупателя") И СтрокаТоваров.ЗаказПокупателя.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов = ВалютаДокумента Тогда
				СуммаСтроки = Выборка.Сумма;
			Иначе
				СуммаСтроки = обПересчет(Выборка.СуммаУпр, ВалютаУпр, КурсВалютыУпр, ВалютаДокумента, КурсДокумента);
			КонецЕсли;
			Если СуммаСтроки > 0 Тогда
				СтрокаТоваров.СуммаВсего = СтрокаТоваров.Количество*СуммаСтроки/Выборка.Заказано;
				ОбработкаРеквизита("Товары.СуммаВсего", СтрокаТоваров);
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ обЗначениеНеЗаполнено(ТоварыЗаказа) Тогда
			МассивЯчеек = ТоварыЗаказа.НайтиСтроки(Новый Структура("Номенклатура,ХарактеристикаНоменклатуры",Выборка.Номенклатура,Выборка.ХарактеристикаНоменклатуры));
			Если МассивЯчеек.Количество() <> 0 Тогда
				СтрокаТоваров.ЯчейкаОтправитель = МассивЯчеек[0].Ячейка;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьРезервамиПодЗаказ()

// Возвращает соответствие в котором перечислены виды номенклатуры, которые нельзя вводить
// в таблицу товаров. Если таких нет, то возвращает неопределено
//
// Возвращаемое значение:
//  Результат - соответствие.
//
Функция ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры() Экспорт
	Результат=Новый Соответствие();
	Результат.Вставить(Перечисления.ВидыНоменклатуры.Услуга,0);
	Возврат Результат;
КонецФункции // ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры()

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	// Обязательные поля таблицы товаров
	ОбязательныеТовары=Новый Структура();
	ОбязательныеТовары.Вставить("Номенклатура",3);
	ОбязательныеТовары.Вставить("Количество",1);
	ОбязательныеТовары.Вставить("ЕдиницаИзмерения",3);
	ОбязательныеТовары.Вставить("Коэффициент",1);
	ОбязательныеТовары.Вставить("ЗаказПокупателя",2);
	ОбязательныеТовары.Вставить("ХарактеристикаНоменклатуры",2);
	ОбязательныеТовары.Вставить("СкладыКомпании",2);
	ОбязательныеТовары.Вставить("СкладыПолучатели",2);
	Если обПраво("ВыборочноеСписаниеПартий",Права,,ЭтотОбъект) Тогда
		ОбязательныеТовары.Вставить("Партия",2);
		ОбязательныеТовары.Вставить("ГТД",2);
	КонецЕсли;
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	ОбязательныеРеквизиты.Вставить("Автор",1);
	ОбязательныеРеквизиты.Вставить("ВалютаДокумента",1);
	ОбязательныеРеквизиты.Вставить("КурсДокумента",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеОтправитель",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеПолучатель",1);
	ОбязательныеРеквизиты.Вставить("ТипЦен",1);
	ОбязательныеРеквизиты.Вставить("ХозОперация",1);
	
	ОбязательныеРеквизиты.Вставить("Товары",ОбязательныеТовары);
	
	Возврат ОбязательныеРеквизиты;
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Проверяет корректность заполнения объекта.
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры:
//  Ошибки       - строка, в случае некорректного заполнения содержит описанием возникших ошибок, 
//  ДопРеквизиты - структура, на вход может быть передана структура с дополнительными реквизитами для проверки,
//  Заполнение   - булево, флаг проверки, 
//  Уникальность - булево, флаг проверки.
//
// Возвращаемое значение:
//  Булево - Возвращает Истина если все заполнено корректно и Ложь иначе.
// 
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	// Здесь могут быть определены дополнительные к стандартным обязательным реквизитам условия проверки
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	
	// Проведем проверку соответствия организации документа организациям некоторых реквизитов документа.
	// Такую проверку необходимо осуществлять, если баланс в системе ведется по организации,
	// или если установлен способ контроля корректности
	// договора и склада документа. Причем, если способ контроля выбран "Контроль по организации и подразделению", то
	// дополнительно осуществляется проверка соответствия подразделений.
	Если Результат Тогда
		СпособКонтроляКорректности = обПраво("КонтрольКорректностиДоговораИСкладаДокумента", Права,,ЭтотОбъект);	
		КонтрольОтсутствует        = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольОтсутствует);
		БалансВедетсяПоОрганизации = (Константы.СпособВеденияБаланса.Получить()=Перечисления.СпособВеденияБаланса.ПоОрганизации);
		
		Если БалансВедетсяПоОрганизации ИЛИ НЕ КонтрольОтсутствует Тогда
			КонтрольПоПодразделению = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольПоОрганизацииИПодразделению);
			
			КонтролируемыеРеквизиты = Новый Структура();
			
			//КонтролируемыеРеквизитыШапки = Новый Структура();
			//Если ТипЗнч(ПодразделениеОтправитель) = Тип("СправочникСсылка.СкладыКомпании") Тогда
			//	КонтролируемыеРеквизитыШапки.Вставить("СкладКомпании",   КонтрольПоПодразделению);
			//КонецЕсли;
			//Если ТипЗнч(ПодразделениеПолучатель) = Тип("СправочникСсылка.СкладыКомпании") Тогда
			//	КонтролируемыеРеквизитыШапки.Вставить("СкладПолучатель", КонтрольПоПодразделению);
			//КонецЕсли;
			//КонтролируемыеРеквизиты.Вставить("КонтролируемыеРеквизитыШапки",КонтролируемыеРеквизитыШапки); 			
			
			Если БалансВедетсяПоОрганизации И обПраво("ВыборочноеСписаниеПартий",Права,,ЭтотОбъект) Тогда
				КонтролируемыеРеквизитыТовары = Новый Структура();
				КонтролируемыеРеквизитыТовары.Вставить("Партия", Ложь);
				ТабличныеЧасти = Новый Структура();
				ТабличныеЧасти.Вставить("Товары",КонтролируемыеРеквизитыТовары);
				КонтролируемыеРеквизиты.Вставить("КонтролируемыеРеквизитыТабличныхЧастей",ТабличныеЧасти);
			КонецЕсли;		
			
			Результат = дкПроверитьКорректностьПоОрганизации(ЭтотОбъект,КонтролируемыеРеквизиты,Ошибки) И Результат;
		КонецЕсли;  		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции // ПроверитьКорректность()

// Функция проверяет, допустимо ли изменение объекта
//
// Параметры:
//  БлокироватьРеквизиты - структура, структура блокируемых на изменение реквизитов.
//
// Возвращаемое значение:
// Булево - Возвращает Истина, если изменения возможны, ложь иначе
//          Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
//
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
	// Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции // ДоступностьИзменения()

// Возвращает список возможных хозяйственных операций документа
// Возвращаемое значение: 
//  СписокЗначений. 
//  Строка списка: Значение - имя предопределенного элемента; 
//				   Представление - красивое его представление
// 				   "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("ПеремещениеТоваровОптНаЭкспедитора","Перемещение товаров Опт На Экспедитора",Истина);
	СписокХозОпераций.Добавить("ПеремещениеТоваровОптСЭкспедитора","Перемещение товаров Опт С Экспедитора",Истина);
	Возврат СписокХозОпераций;
КонецФункции // ПолучитьСписокХозОпераций()

// у нас не стандартная таблица, поэтому сформирует свой результат запроса по товарам
//
// Параметры:
//  ШапкаДокумента - выборка.
//
Функция ПолучитьРезультатЗапросаПоТоварам(ШапкаДокумента)
	ТекстЗапроса="
	|ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
	|	ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПеремещениеТоваровТовары.Партия КАК Партия,
	|	ПеремещениеТоваровТовары.ГТД КАК ГТД,
	|	СУММА(ПеремещениеТоваровТовары.КоличествоБазовое) КАК Количество,
	|	СРЕДНЕЕ(ПеремещениеТоваровТовары.ЦенаРозничная) КАК ЦенаНовая,
	|	СРЕДНЕЕ(ПеремещениеТоваровТовары.ЦенаРозничная) КАК ЦенаРозничная,
	|	СУММА("+?(ТипЗнч(ШапкаДокумента.СкладПолучатель)=Тип("СправочникСсылка.СкладыКомпании"), ?(ШапкаДокумента.СкладПолучатель.Розничный,"ПеремещениеТоваровТовары.ЦенаРозничная*ПеремещениеТоваровТовары.КоличествоБазовое","0"),"0")+") КАК СуммаРозн
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка=&Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры,
	|	ПеремещениеТоваровТовары.Партия,
	|	ПеремещениеТоваровТовары.ГТД
	|";
	
	Запрос=Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка",ШапкаДокумента.Ссылка);
	Запрос.Текст=ТекстЗапроса;
	
	Возврат Запрос.Выполнить();
КонецФункции // ПолучитьРезультатЗапросаПоТоварам()

// возвращает выборку по шапке
//
// Параметры:
//  ДокументСсылка - Документ.Ссылка - Ссылка на документ для которого получаем шапку
//
// Возвращаемое значение:
//  Выборка - возвращает выборку по шапке
//
Функция ПолучитьШапкуДокумента(ДокументСсылка)
	Если ТипЗнч(ДокументСсылка.СкладКомпании) = Тип("СправочникСсылка.СкладыКомпании") Тогда
		СтрокаПодразделениеОтправителя = "Док.СкладКомпании.Подразделение";
	Иначе
		СтрокаПодразделениеОтправителя = "Док.СкладКомпании";
	КонецЕсли;
	Если ТипЗнч(ДокументСсылка.СкладПолучатель) = Тип("СправочникСсылка.СкладыКомпании") Тогда
		СтрокаПодразделениеПолучателя = "Док.СкладПолучатель.Подразделение";
	Иначе
		СтрокаПодразделениеПолучателя = "Док.СкладПолучатель";
	КонецЕсли;
	
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата,
	|	Док.ВалютаДокумента КАК ВалютаДокумента,
	|	Док.КурсДокумента КАК КурсДокумента,
	|	Док.ТипЦен КАК ТипЦен,
	|	Док.ХозОперация КАК ХозОперация,
	|	Док.КурсВалютыУпр КАК КурсВалютыУпр,
	|	Док.МоментВремени КАК МоментВремени,
	|	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	Док.Проект КАК Проект,
	/////////// ПРИВАТ ////////////
	|	Док.СкладКомпании   КАК СкладКомпании,
	|	Док.СкладПолучатель КАК СкладПолучатель,
	|	"+СтрокаПодразделениеОтправителя+" КАК ПодразделениеОтправителя,
	|	"+СтрокаПодразделениеПолучателя+" КАК ПодразделениеПолучателя, 
	|	Док.ДокументОснование КАК ДокументОснование
	|
	|ИЗ
	|	Документ."+Метаданные().Имя+" КАК Док
	|ГДЕ
	|	Док.Ссылка=&Ссылка
	|");
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	Выборка=Запрос.Выполнить().Выбрать(); Выборка.Следующий();
	
	Возврат Выборка;
КонецФункции // ПолучитьШапкуДокумента()

// формирует движения документа по партионным регистрам
//
// Параметры:
//  Режим           - режим проведения (оперативный/неоперативный)
//  ДокументСсылка  - ссылка на документ который надо допровести по партиям
//
// Возвращаемое значение:
//  Возвращает Истина - все ОК, ложь - чего-то не так
//
Функция ПровестиПоПартиям(Режим,ДокументСсылка) Экспорт
	Отказ=Ложь;
	
	// получим шапку документа
	ШапкаДокумента=ПолучитьШапкуДокумента(ДокументСсылка);
	
	// проверим, если подразделение проводиться по партиям "отложенно", то дальше не идем
	НаборЗаписейДопроведениеПоПартиям=Движения.ДопроведениеПоПартиям;
	НаборЗаписейДопроведениеПоПартиям.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейДопроведениеПоПартиям.ШапкаДокумента=ШапкаДокумента;
	Отказ=НЕ НаборЗаписейДопроведениеПоПартиям.Зафиксировать() ИЛИ Отказ;
	Если НаборЗаписейДопроведениеПоПартиям.НеПроводитьПартии Тогда
		Возврат НЕ Отказ;
	КонецЕсли;
	
	// БАЛАНС: Если происходит перемещение товаров между складами подразделений, принадлежащих
	// различным балансовым "веткам", то возможен разрыв баланса.
	ДобавлятьКорректирующиеЗаписи = (Константы.СпособВеденияБаланса.Получить()=Перечисления.СпособВеденияБаланса.ПоПодразделению);
	ПодразделениеОтправителя      = обПолучитьБалансовоеПодразделение(ШапкаДокумента.ПодразделениеОтправителя);
	ПодразделениеПолучатель       = обПолучитьБалансовоеПодразделение(ШапкаДокумента.ПодразделениеПолучателя);
	ДобавлятьКорректирующиеЗаписи = ДобавлятьКорректирующиеЗаписи И (ПодразделениеОтправителя<>ПодразделениеПолучатель);
	ДобавлятьКорректирующиеЗаписи = ДобавлятьКорректирующиеЗаписи И (ХозОперация=Справочники.ХозОперации.ПеремещениеТоваров);
	
	НаборЗаписейПартии=Движения.ПартииТоваровКомпании;
	НаборЗаписейГТД=Движения.ГТДПартийТоваровКомпании;
	// если перемещаем из филиала, то оприходуем товар на склад получателя и все
	Если ШапкаДокумента.ХозОперация=Справочники.ХозОперации.ПеремещениеТоваровИзФилиала Тогда
		
		СтратегияСписанияПартийТоваровПоДатам=Константы.СтратегияСписанияПартийТоваровПоДатам.Получить();
		ПартияТоваровОтрицательныхОстатков=Константы.ПартияТоваровОтрицательныхОстатков.Получить();
		
		// товары документа
		ЗапросТовары=Новый Запрос("
		|ВЫБРАТЬ
		|	ДокТовары.Номенклатура КАК Номенклатура,
		|	ДокТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ДокТовары.СтавкаНДС КАК СтавкаНДС,
		|	"+?(СтратегияСписанияПартийТоваровПоДатам=Перечисления.СтратегияСписанияПартийТоваровПоДатам.Средняя,"&ПартияТоваровОтрицательныхОстатков","ДокТовары.Партия")+" КАК Партия,
		|	ДокТовары.ГТД КАК ГТД,
		|	Сумма(ДокТовары.СуммаНДС) КАК СуммаНДС,
		|	Сумма(ДокТовары.Сумма) КАК Сумма,
		|	Сумма(ДокТовары.СуммаВсего) КАК СуммаВсего,
		|	Сумма(ДокТовары.Количество*ДокТовары.Коэффициент) КАК Количество
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ДокТовары
		|ГДЕ
		|	  ДокТовары.Ссылка=&Ссылка
		|	И ДокТовары.Номенклатура.ВидНоменклатуры<>&Услуга
		|
		|СГРУППИРОВАТЬ ПО Номенклатура, ХарактеристикаНоменклатуры, СтавкаНДС, Партия, ГТД
		|");
		ЗапросТовары.УстановитьПараметр("Ссылка",ШапкаДокумента.Ссылка);
		ЗапросТовары.УстановитьПараметр("Услуга",Перечисления.ВидыНоменклатуры.Услуга);
		ЗапросТовары.УстановитьПараметр("ПартияТоваровОтрицательныхОстатков",ПартияТоваровОтрицательныхОстатков);
		РезультатЗапросаПоТоварам=ЗапросТовары.Выполнить();
		
		// партии документа отгрузки
		ЗапросПартии=Новый Запрос("
		|ВЫБРАТЬ
		|	ПартииТоваровКомпании.Номенклатура КАК Номенклатура,
		|	ПартииТоваровКомпании.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ПартииТоваровКомпании.СтатусПартии КАК СтатусПартии,
		|	"+?(СтратегияСписанияПартийТоваровПоДатам=Перечисления.СтратегияСписанияПартийТоваровПоДатам.Средняя,"&ПартияТоваровОтрицательныхОстатков","ПартииТоваровКомпании.Партия")+" КАК Партия,
		|	СУММА(ПартииТоваровКомпании.Количество) КАК Количество,
		|	СУММА(ПартииТоваровКомпании.Сумма) КАК Сумма,
		|	СУММА(ПартииТоваровКомпании.СуммаУпр) КАК СуммаУпр,
		|	СУММА(ПартииТоваровКомпании.СуммаНДС) КАК СуммаНДС
		|ИЗ
		|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
		|ГДЕ
		|	ПартииТоваровКомпании.Регистратор = &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	ПартииТоваровКомпании.Номенклатура,
		|	ПартииТоваровКомпании.ХарактеристикаНоменклатуры,
		|	ПартииТоваровКомпании.СтатусПартии,
		|	ПартииТоваровКомпании.Партия
		|");
		ЗапросПартии.УстановитьПараметр("Регистратор",ШапкаДокумента.ДокументОснование);
		ЗапросПартии.УстановитьПараметр("ПартияТоваровОтрицательныхОстатков",ПартияТоваровОтрицательныхОстатков);
		ТаблицаПартий=ЗапросПартии.Выполнить().Выгрузить();
		
		//ГТД партий товаров компании
		ЗапросГТД=Новый Запрос("
		|ВЫБРАТЬ
		|	ГТДПартийТоваровКомпании.Номенклатура КАК Номенклатура,
		|	ГТДПартийТоваровКомпании.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	"+?(СтратегияСписанияПартийТоваровПоДатам=Перечисления.СтратегияСписанияПартийТоваровПоДатам.Средняя,"&ПартияТоваровОтрицательныхОстатков","ГТДПартийТоваровКомпании.Партия")+" КАК Партия,
		|	ГТДПартийТоваровКомпании.ГТД КАК ГТД,
		|	СУММА(ГТДПартийТоваровКомпании.Количество) КАК Количество
		|ИЗ
		|	РегистрНакопления.ГТДПартийТоваровКомпании КАК ГТДПартийТоваровКомпании
		|ГДЕ
		|	ГТДПартийТоваровКомпании.Регистратор = &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	ГТДПартийТоваровКомпании.Номенклатура,
		|	ГТДПартийТоваровКомпании.ХарактеристикаНоменклатуры,
		|	ГТДПартийТоваровКомпании.Партия,
		|	ГТДПартийТоваровКомпании.ГТД
		|");
		ЗапросГТД.УстановитьПараметр("Регистратор",ШапкаДокумента.ДокументОснование);
		ЗапросГТД.УстановитьПараметр("ПартияТоваровОтрицательныхОстатков",ПартияТоваровОтрицательныхОстатков);
		ТаблицаГТД=ЗапросГТД.Выполнить().Выгрузить();
		
		// приходуем
		ВалютаРегл=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		СтруктураКурса = обКурсДляВалюты(ВалютаРегл,ШапкаДокумента.Дата);
		КурсРегл = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
		ВалютаУпр=Константы.ВалютаУправленческогоУчетаКомпании.Получить();
		Если обЗначениеНеЗаполнено(ШапкаДокумента.КурсВалютыУпр) Тогда
			СтруктураКурса = обКурсДляВалюты(ВалютаУпр,ШапкаДокумента.Дата);
			КурсУпр = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
		Иначе
			КурсУпр = ШапкаДокумента.КурсВалютыУпр;
		КонецЕсли;	
		ВыборкаТовары=РезультатЗапросаПоТоварам.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			НадоОприходовать=ВыборкаТовары.Количество;
			НадоОприходоватьГТД=ВыборкаТовары.Количество;
			СтруктураОтбора=Новый Структура("Номенклатура,ХарактеристикаНоменклатуры",ВыборкаТовары.Номенклатура,ВыборкаТовары.ХарактеристикаНоменклатуры);
			Если НЕ обЗначениеНеЗаполнено(ВыборкаТовары.ХарактеристикаНоменклатуры) Тогда
				СтруктураОтбора.ХарактеристикаНоменклатуры=ВыборкаТовары.ХарактеристикаНоменклатуры;
			Иначе
				СтруктураОтбора.ХарактеристикаНоменклатуры=Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
			КонецЕсли;
			Если НЕ обЗначениеНеЗаполнено(ВыборкаТовары.Партия) Тогда
				СтруктураОтбора.Вставить("Партия",ВыборкаТовары.Партия);
			КонецЕсли; 
			МассивНайденныхПартий=ТаблицаПартий.НайтиСтроки(СтруктураОтбора);
			Для Сч=0 По МассивНайденныхПартий.ВГраница() Цикл
				ТекСтрока=МассивНайденныхПартий[Сч];
				КоличествоПартииВсего=ТекСтрока.Количество;
				НоваяЗапись=НаборЗаписейПартии.Добавить();
				НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Приход;
				НоваяЗапись.Период=ШапкаДокумента.Дата;
				НоваяЗапись.Регистратор=ШапкаДокумента.Ссылка;
				НоваяЗапись.Партия = ТекСтрока.Партия;
				НоваяЗапись.СтатусПартии=ТекСтрока.СтатусПартии;
				НоваяЗапись.СкладКомпании=ШапкаДокумента.СкладПолучатель;
				НоваяЗапись.Номенклатура=ВыборкаТовары.Номенклатура;
				НоваяЗапись.ХарактеристикаНоменклатуры=ВыборкаТовары.ХарактеристикаНоменклатуры;
				НоваяЗапись.ХозОперация=ШапкаДокумента.ХозОперация;
				НоваяЗапись.СтавкаНДС = ВыборкаТовары.СтавкаНДС;
				НоваяЗапись.Количество=Мин(ТекСтрока.Количество,НадоОприходовать);
				НоваяЗапись.Сумма=Окр(ТекСтрока.Сумма*НоваяЗапись.Количество/КоличествоПартииВсего,2);
				НоваяЗапись.СуммаУпр=Окр(ТекСтрока.СуммаУпр*НоваяЗапись.Количество/КоличествоПартииВсего,2);
				НоваяЗапись.СуммаНДС=Окр(ТекСтрока.СуммаНДС*НоваяЗапись.Количество/КоличествоПартииВсего,2);
				//Уменьшаем приходуемое количество
				НадоОприходовать=НадоОприходовать-НоваяЗапись.Количество;
				НадоОприходоватьПоПартии=НоваяЗапись.Количество;
				//Оприходуем ГТД партий
				СтруктураОтбора.Вставить("Партия",ТекСтрока.Партия);
				Если НЕ обЗначениеНеЗаполнено(ВыборкаТовары.ГТД) Тогда
					СтруктураОтбора.Вставить("ГТД",ВыборкаТовары.ГТД);
				КонецЕсли; 
				МассивНайденныхГТД=ТаблицаГТД.НайтиСтроки(СтруктураОтбора);
				Для СчГТД=0 По МассивНайденныхГТД.ВГраница() Цикл
					Если НадоОприходоватьПоПартии=0 Тогда
						Прервать;
					КонецЕсли; 
					ТекСтрокаГТД=МассивНайденныхГТД[СчГТД];
					НоваяЗаписьГТД=НаборЗаписейГТД.Добавить();
					НоваяЗаписьГТД.ВидДвижения=ВидДвиженияНакопления.Приход;
					НоваяЗаписьГТД.Период=ШапкаДокумента.Дата;
					НоваяЗаписьГТД.Регистратор=ШапкаДокумента.Ссылка;
					НоваяЗаписьГТД.Партия=ТекСтрокаГТД.Партия;
					НоваяЗаписьГТД.ГТД=ТекСтрокаГТД.ГТД;
					НоваяЗаписьГТД.СкладКомпании=ШапкаДокумента.СкладПолучатель;
					НоваяЗаписьГТД.Номенклатура=ТекСтрокаГТД.Номенклатура;
					НоваяЗаписьГТД.ХарактеристикаНоменклатуры=ТекСтрокаГТД.ХарактеристикаНоменклатуры;
					НоваяЗаписьГТД.ХозОперация=ШапкаДокумента.ХозОперация;
					НоваяЗаписьГТД.Количество=Мин(ТекСтрокаГТД.Количество,НадоОприходоватьПоПартии);
					НадоОприходоватьПоПартии=НадоОприходоватьПоПартии-НоваяЗаписьГТД.Количество;
					НадоОприходоватьГТД=НадоОприходоватьГТД-НоваяЗаписьГТД.Количество;
					ТекСтрокаГТД.Количество=ТекСтрокаГТД.Количество-НоваяЗаписьГТД.Количество;
					Если ТекСтрокаГТД.Количество=0 Тогда
						// удалим за ненадобностью
						ТаблицаГТД.Удалить(ТекСтрокаГТД);
					КонецЕсли; 
				КонецЦикла;
				//Если указана ГТД, то оприходуем и ее
				Если (НЕ обЗначениеНеЗаполнено(ВыборкаТовары.ГТД)) И НадоОприходоватьПоПартии>0 Тогда
					НоваяЗаписьГТД=НаборЗаписейГТД.Добавить();
					НоваяЗаписьГТД.ВидДвижения=ВидДвиженияНакопления.Приход;
					НоваяЗаписьГТД.Период=ШапкаДокумента.Дата;
					НоваяЗаписьГТД.Регистратор=ШапкаДокумента.Ссылка;
					НоваяЗаписьГТД.Партия=ТекСтрока.Партия;
					НоваяЗаписьГТД.ГТД=ВыборкаТовары.ГТД;
					НоваяЗаписьГТД.СкладКомпании=ШапкаДокумента.СкладПолучатель;
					НоваяЗаписьГТД.Номенклатура=ВыборкаТовары.Номенклатура;
					НоваяЗаписьГТД.ХарактеристикаНоменклатуры=ВыборкаТовары.ХарактеристикаНоменклатуры;
					НоваяЗаписьГТД.ХозОперация=ШапкаДокумента.ХозОперация;
					НоваяЗаписьГТД.Количество=НадоОприходоватьПоПартии;
					НадоОприходоватьГТД=НадоОприходоватьГТД-НоваяЗаписьГТД.Количество;
				КонецЕсли; 
				ТекСтрока.Количество=ТекСтрока.Количество-НоваяЗапись.Количество;
				ТекСтрока.Сумма=ТекСтрока.Сумма - НоваяЗапись.Сумма;
				ТекСтрока.СуммаУпр=ТекСтрока.СуммаУпр - НоваяЗапись.СуммаУпр;
				ТекСтрока.СуммаНДС=ТекСтрока.СуммаНДС - НоваяЗапись.СуммаНДС;
				Если ТекСтрока.Количество=0 Тогда
					// удалим за ненадобностью
					ТаблицаПартий.Удалить(ТекСтрока);
				КонецЕсли; 
				// надо ли дальше приходовать
				Если НадоОприходовать<=0 Тогда Прервать; КонецЕсли;
			КонецЦикла;
			// Если остался не оприходованный товар, то оприходуем на себя или на указанную партию
			Если НадоОприходовать>0 Тогда
				НоваяЗапись=НаборЗаписейПартии.Добавить();
				НоваяЗапись.ВидДвижения   = ВидДвиженияНакопления.Приход;
				НоваяЗапись.Период        = ШапкаДокумента.Дата;
				НоваяЗапись.Регистратор   = ШапкаДокумента.Ссылка;
				НоваяЗапись.Партия        = ?(обЗначениеНеЗаполнено(ВыборкаТовары.Партия),ШапкаДокумента.Ссылка,ВыборкаТовары.Партия);
				Если обЗначениеНеЗаполнено(ВыборкаТовары.Партия) Тогда
					НоваяЗапись.СтатусПартии  = Перечисления.СтатусыПартий.ТоварКупленный;
				Иначе
					СтруктураОтбора=Новый Структура("Номенклатура,ХарактеристикаНоменклатуры,Партия");
					СтруктураОтбора.Номенклатура=ВыборкаТовары.Номенклатура; 
					СтруктураОтбора.Партия=ВыборкаТовары.Партия;
					Если НЕ обЗначениеНеЗаполнено(ВыборкаТовары.ХарактеристикаНоменклатуры) Тогда
						СтруктураОтбора.ХарактеристикаНоменклатуры=ВыборкаТовары.ХарактеристикаНоменклатуры;
					Иначе
						СтруктураОтбора.ХарактеристикаНоменклатуры=Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
					КонецЕсли;
					МассивНайденныхПартий=ТаблицаПартий.НайтиСтроки(СтруктураОтбора);
					Если МассивНайденныхПартий.Количество() > 0 Тогда
						НоваяЗапись.СтатусПартии = МассивНайденныхПартий[0].СтатусПартии;
					Иначе
						НоваяЗапись.СтатусПартии = Перечисления.СтатусыПартий.ТоварКупленный;
					КонецЕсли;
				КонецЕсли;
				НоваяЗапись.СкладКомпании = ШапкаДокумента.СкладПолучатель;
				НоваяЗапись.Номенклатура  = ВыборкаТовары.Номенклатура;
				НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаТовары.ХарактеристикаНоменклатуры;
				НоваяЗапись.ХозОперация = ШапкаДокумента.ХозОперация;
				НоваяЗапись.Количество  = НадоОприходовать;
				НоваяЗапись.СтавкаНДС   = ВыборкаТовары.СтавкаНДС;
				НоваяЗапись.Сумма       = Окр(обПересчет(ВыборкаТовары.СуммаВсего*НоваяЗапись.Количество/ВыборкаТовары.Количество,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаРегл,КурсРегл),2);
				НоваяЗапись.СуммаУпр    = Окр(обПересчет(ВыборкаТовары.СуммаВсего*НоваяЗапись.Количество/ВыборкаТовары.Количество,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,КурсУпр),2);
				НоваяЗапись.СуммаНДС    = Окр(обПересчет(ВыборкаТовары.СуммаНДС*НоваяЗапись.Количество/ВыборкаТовары.Количество,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаРегл,КурсРегл),2);
			КонецЕсли;
			//Если указана ГТД, то оприходуем и ее
			Если (НЕ обЗначениеНеЗаполнено(ВыборкаТовары.ГТД)) И НадоОприходоватьГТД>0 Тогда
				НоваяЗаписьГТД=НаборЗаписейГТД.Добавить();
				НоваяЗаписьГТД.ВидДвижения=ВидДвиженияНакопления.Приход;
				НоваяЗаписьГТД.Период=ШапкаДокумента.Дата;
				НоваяЗаписьГТД.Регистратор=ШапкаДокумента.Ссылка;
				НоваяЗаписьГТД.Партия=ВыборкаТовары.Партия;
				НоваяЗаписьГТД.ГТД=ВыборкаТовары.ГТД;
				НоваяЗаписьГТД.СкладКомпании=ШапкаДокумента.СкладПолучатель;
				НоваяЗаписьГТД.Номенклатура=ВыборкаТовары.Номенклатура;
				НоваяЗаписьГТД.ХарактеристикаНоменклатуры=ВыборкаТовары.ХарактеристикаНоменклатуры;
				НоваяЗаписьГТД.ХозОперация=ШапкаДокумента.ХозОперация;
				НоваяЗаписьГТД.Количество=НадоОприходоватьГТД;
				//НадоОприходоватьГТД=НадоОприходоватьГТД-НоваяЗаписьГТД.Количество;
			КонецЕсли; 
		КонецЦикла;
		
		// доходы и расходы
		НаборЗаписейДоходыРасходы=Движения.ДоходыИРасходы;
		НаборЗаписейДоходыРасходы.ДокументОбъект = ЭтотОбъект;
		НаборЗаписейДоходыРасходы.Подразделение  = ШапкаДокумента.ПодразделениеПолучателя;
		НаборЗаписейДоходыРасходы.ВУпрВалюте     = Истина;
		НаборЗаписейДоходыРасходы.ШапкаДокумента = ШапкаДокумента;
		НаборЗаписейДоходыРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.Себестоимость;
		НаборЗаписейДоходыРасходы.Доход			 = 0;
		Для Каждого ЗаписьПартий Из НаборЗаписейПартии Цикл
			Если ЗаписьПартий.СтатусПартии=Перечисления.СтатусыПартий.ТоварКупленный Тогда
				НаборЗаписейДоходыРасходы.Доход=НаборЗаписейДоходыРасходы.Доход+ЗаписьПартий.СуммаУпр;
			КонецЕсли;
		КонецЦикла;
		Отказ=НЕ НаборЗаписейДоходыРасходы.Приход() ИЛИ Отказ;
		//Корельский 1082{
		//В случае перемещения между подразделениями схема сложнее, т.к. нужно делать перемещения по партиям двумя раздельными проводками.
		//Сначала по расходу партий со склада отправителя, и только потом на склад получателя, в тот момент когда документ проводится с отметкой получения
	ИначеЕсли ШапкаДокумента.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровМеждуДЦ Тогда
		ТекстЗапроса="
		|ВЫБРАТЬ
		|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
		|	ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ПеремещениеТоваровТовары.Партия КАК Партия,
		|	ПеремещениеТоваровТовары.ГТД КАК ГТД,
		|	СУММА(ПеремещениеТоваровТовары.КоличествоБазовое) КАК Количество,
		|	СРЕДНЕЕ(ПеремещениеТоваровТовары.ЦенаРозничная) КАК ЦенаНовая,
		|	СРЕДНЕЕ(ПеремещениеТоваровТовары.ЦенаРозничная) КАК ЦенаРозничная,
		|	СУММА("+?(ТипЗнч(ШапкаДокумента.СкладПолучатель)=Тип("СправочникСсылка.СкладыКомпании"), ?(ШапкаДокумента.СкладПолучатель.Розничный,"ПеремещениеТоваровТовары.ЦенаРозничная*ПеремещениеТоваровТовары.КоличествоБазовое","0"),"0")+") КАК СуммаРозн
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|ГДЕ
		|	ПеремещениеТоваровТовары.Ссылка=&Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ПеремещениеТоваровТовары.Номенклатура,
		|	ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры,
		|	ПеремещениеТоваровТовары.Партия,
		|	ПеремещениеТоваровТовары.ГТД
		|";
		
		Запрос=Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка",ШапкаДокумента.Ссылка);
		Запрос.Текст=ТекстЗапроса;
		
		РезультатЗапросаПоТоварам = Запрос.Выполнить();
		
		НаборЗаписейПартии.ДокументОбъект       = ЭтотОбъект;
		НаборЗаписейПартии.СкладКомпании        = ШапкаДокумента.СкладКомпании;
		НаборЗаписейПартии.ИмяРеквизитаДокумент = ?(обПраво("ВыборочноеСписаниеПартий",Права,,ЭтотОбъект),"Партия","");
		НаборЗаписейПартии.ШапкаДокумента       = ШапкаДокумента;
		
		НаборЗаписейПартии.РезультатЗапросаПоТоварам=РезультатЗапросаПоТоварам;
		НаборЗаписейПартии.ПоБазовомуКоличеству=Истина;
		Отказ=НЕ НаборЗаписейПартии.Расход() ИЛИ Отказ;
		НаборЗаписейПартии.ГраницаРасчетаОстатков=Неопределено; // сбросим границу
		
		Если ВизаПолучил Тогда
			//Необходимо приходовать партии на склад получателя,
			//для этого выгрузим партии, с которых расходовали со склада отправителя и по ФИФО приходуем на количество которое указано в количество получено
			ТаблицаИзНабораЗаписейПартии = НаборЗаписейПартии.Выгрузить();
			ТаблицаИзНабораЗаписейГТД = Движения.ГТДПартийТоваровКомпании.Выгрузить();
			
			ЗапросПартийДляПрихода = Новый Запрос();
			ЗапросПартийДляПрихода.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			ЗапросПартийДляПрихода.Текст = "ВЫБРАТЬ
			|	ПартииРасхода.Номенклатура,
			|	ПартииРасхода.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ПартииРасхода.Партия,
			|	ПартииРасхода.Количество КАК КоличествоСписано,
			|	ПартииРасхода.Сумма КАК СуммаВсего,
			|	ПартииРасхода.СуммаНДС КАК СуммаНДСВсего,
			|	ПартииРасхода.СтатусПартии
			|ПОМЕСТИТЬ ПартииРасхода
			|ИЗ
			|	&ПартииРасхода КАК ПартииРасхода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ГТДРасхода.Номенклатура,
			|	ГТДРасхода.ХарактеристикаНоменклатуры,
			|	ГТДРасхода.Партия,
			|	ГТДРасхода.ГТД
			|ПОМЕСТИТЬ ГТДРасхода
			|ИЗ
			|	&ГТДРасхода КАК ГТДРасхода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
			|	ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	СУММА(ПеремещениеТоваровТовары.КоличествоПолучено * ПеремещениеТоваровТовары.Коэффициент) КАК Количество
			|ПОМЕСТИТЬ НоменклатураИзДокумента
			|ИЗ
			|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
			|ГДЕ
			|	ПеремещениеТоваровТовары.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ПеремещениеТоваровТовары.Номенклатура,
			|	ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НоменклатураИзДокумента.Номенклатура КАК Номенклатура,
			|	НоменклатураИзДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	НоменклатураИзДокумента.Количество КАК Количество,
			|	ПартииРасхода.Партия,
			|	ПартииРасхода.КоличествоСписано,
			|	ПартииРасхода.СуммаВсего,
			|	ПартииРасхода.СуммаНДСВсего КАК СуммаНДС,
			|	ПартииРасхода.СтатусПартии КАК СтатусПартии,
			|	ГТДРасхода.ГТД
			|ИЗ
			|	НоменклатураИзДокумента КАК НоменклатураИзДокумента
			|		ЛЕВОЕ СОЕДИНЕНИЕ ПартииРасхода КАК ПартииРасхода
			|			ЛЕВОЕ СОЕДИНЕНИЕ ГТДРасхода КАК ГТДРасхода
			|			ПО ПартииРасхода.Номенклатура = ГТДРасхода.Номенклатура
			|				И ПартииРасхода.ХарактеристикаНоменклатуры = ГТДРасхода.ХарактеристикаНоменклатуры
			|				И ПартииРасхода.Партия = ГТДРасхода.Партия
			|		ПО НоменклатураИзДокумента.Номенклатура = ПартииРасхода.Номенклатура
			|			И НоменклатураИзДокумента.ХарактеристикаНоменклатуры = ПартииРасхода.ХарактеристикаНоменклатуры
			|ИТОГИ
			|	МАКСИМУМ(Количество),
			|	МАКСИМУМ(СтатусПартии)
			|ПО
			|	Номенклатура,
			|	ХарактеристикаНоменклатуры";
			ЗапросПартийДляПрихода.УстановитьПараметр("Ссылка", Ссылка);
			ЗапросПартийДляПрихода.УстановитьПараметр("ПартииРасхода", ТаблицаИзНабораЗаписейПартии); 
			ЗапросПартийДляПрихода.УстановитьПараметр("ГТДРасхода", ТаблицаИзНабораЗаписейГТД);
			
			ВыборкаПоНоменклатуре = ЗапросПартийДляПрихода.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			РезультатЗапросаПоТоварамОприходование = Новый ТаблицаЗначений();
			РезультатЗапросаПоТоварамОприходование.Колонки.Добавить("Номенклатура");
			РезультатЗапросаПоТоварамОприходование.Колонки.Добавить("ХарактеристикаНоменклатуры");
			РезультатЗапросаПоТоварамОприходование.Колонки.Добавить("Партия");
			РезультатЗапросаПоТоварамОприходование.Колонки.Добавить("ГТД");
			РезультатЗапросаПоТоварамОприходование.Колонки.Добавить("Количество");
			РезультатЗапросаПоТоварамОприходование.Колонки.Добавить("СуммаВсего");
			РезультатЗапросаПоТоварамОприходование.Колонки.Добавить("СуммаНДС");
			
			
			СтатусПартии = Неопределено;
			Пока ВыборкаПоНоменклатуре.Следующий() Цикл
				ВыборкаПоХарактеристикам = ВыборкаПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				СтатусПартии = ?(ЗначениеЗаполнено(ВыборкаПоНоменклатуре.СтатусПартии), ВыборкаПоНоменклатуре.СтатусПартии, СтатусПартии);
				Пока ВыборкаПоХарактеристикам.Следующий() Цикл
					ОсталосьОприходовать = ВыборкаПоХарактеристикам.Количество;
					
					ВыборкаПоПартиям = ВыборкаПоХарактеристикам.Выбрать();
					Пока ВыборкаПоПартиям.Следующий() Цикл
						Если ОсталосьОприходовать > 0 Тогда
							СтрокаНоменклатурыПоПартиям = РезультатЗапросаПоТоварамОприходование.Добавить();
							СтрокаНоменклатурыПоПартиям.Номенклатура = ВыборкаПоПартиям.Номенклатура;
							СтрокаНоменклатурыПоПартиям.ХарактеристикаНоменклатуры = ВыборкаПоПартиям.ХарактеристикаНоменклатуры;
							СтрокаНоменклатурыПоПартиям.Партия = ВыборкаПоПартиям.Партия;
							СтрокаНоменклатурыПоПартиям.ГТД = ВыборкаПоПартиям.ГТД;
							СтрокаНоменклатурыПоПартиям.Количество = Мин(ОсталосьОприходовать, ВыборкаПоПартиям.КоличествоСписано);
							ОсталосьОприходовать = ОсталосьОприходовать - СтрокаНоменклатурыПоПартиям.Количество;
							
							СтрокаНоменклатурыПоПартиям.СуммаВсего = (ВыборкаПоПартиям.СуммаВсего/ВыборкаПоПартиям.КоличествоСписано)*СтрокаНоменклатурыПоПартиям.Количество;
							СтрокаНоменклатурыПоПартиям.СуммаНДС = (ВыборкаПоПартиям.СуммаНДС/ВыборкаПоПартиям.КоличествоСписано)*СтрокаНоменклатурыПоПартиям.Количество;
						КОнецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
			
			НаборЗаписейПартии.ДокументОбъект       = ЭтотОбъект;
			НаборЗаписейПартии.СкладКомпании        = ШапкаДокумента.СкладПолучатель;
			НаборЗаписейПартии.ИмяРеквизитаДокумент = ?(обПраво("ВыборочноеСписаниеПартий",Права,,ЭтотОбъект),"Партия","");
			НаборЗаписейПартии.ШапкаДокумента       = ШапкаДокумента;
			НаборЗаписейПартии.СтатусПартии			= СтатусПартии;
			
			НаборЗаписейПартии.РезультатЗапросаПоТоварам=РезультатЗапросаПоТоварамОприходование;
			НаборЗаписейПартии.ПоБазовомуКоличеству=Истина;
			Отказ=НЕ НаборЗаписейПартии.Приход() ИЛИ Отказ;
			НаборЗаписейПартии.ГраницаРасчетаОстатков=Неопределено; // сбросим границу
		КонецЕсли;
		
		// Доходы и расходы
		Если ДобавлятьКорректирующиеЗаписи ИЛИ (ХозОперация=Справочники.ХозОперации.ПеремещениеТоваровВФилиал) Тогда
			// У подразделения склада-отправителя возникает расход.
			// У подразделения склада-получателя - доход.
			// Если это перемещение в филиал, то движений "приход" не будет.
			ТаблицаПартий = НаборЗаписейПартии.Выгрузить();
			ТаблицаПартий.Свернуть("СтатусПартии, ВидДвижения","СуммаУпр");
			
			Для Каждого ТекСтрокаДвижения Из ТаблицаПартий Цикл  	
				Если ТекСтрокаДвижения.СтатусПартии=Перечисления.СтатусыПартий.ТоварПринятыйКомиссия Тогда
					Продолжить;
				КонецЕсли;
				
				СуммаДиР = ТекСтрокаДвижения.СуммаУпр;
				Если СуммаДиР<>0 Тогда
					Если ТекСтрокаДвижения.ВидДвижения=ВидДвиженияНакопления.Расход Тогда
						НаборЗаписейДоходыРасходы=Движения.ДоходыИРасходы;
						НаборЗаписейДоходыРасходы.ДокументОбъект = ЭтотОбъект;
						// Если способ ведения баланса не по подразделению то подразделение должно быть как у документа
						Если Константы.СпособВеденияБаланса.Получить() = Перечисления.СпособВеденияБаланса.ПоПодразделению Тогда
							НаборЗаписейДоходыРасходы.Подразделение = ШапкаДокумента.ПодразделениеОтправителя;
						Иначе
							НаборЗаписейДоходыРасходы.Подразделение = Неопределено;
						КонецЕсли;
						НаборЗаписейДоходыРасходы.ВУпрВалюте     = Истина;
						НаборЗаписейДоходыРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.Себестоимость;
						НаборЗаписейДоходыРасходы.ШапкаДокумента = ШапкаДокумента;
						НаборЗаписейДоходыРасходы.Расход         = СуммаДиР;
						Отказ = НЕ НаборЗаписейДоходыРасходы.Приход() ИЛИ Отказ;
					Иначе
						НаборЗаписейДоходыРасходы=Движения.ДоходыИРасходы;
						НаборЗаписейДоходыРасходы.ДокументОбъект = ЭтотОбъект;
						НаборЗаписейДоходыРасходы.Подразделение  = ШапкаДокумента.ПодразделениеПолучателя; 
						НаборЗаписейДоходыРасходы.ВУпрВалюте     = Истина;
						НаборЗаписейДоходыРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
						НаборЗаписейДоходыРасходы.ШапкаДокумента = ШапкаДокумента;
						НаборЗаписейДоходыРасходы.Доход          = СуммаДиР;
						Отказ = НЕ НаборЗаписейДоходыРасходы.Приход() ИЛИ Отказ;
					КонецЕсли;
				КонецЕсли;			
			КонецЦикла;			
		КонецЕсли;
		//}	
	Иначе
		// у нас не стандартная таблица, поэтому сформирует свой результат запроса по товарам
		РезультатЗапросаПоТоварам = ПолучитьРезультатЗапросаПоТоварам(ШапкаДокумента);
		//НаборЗаписейПартии        = Движения.ПартииТоваровКомпании;
		НаборЗаписейПартии.ДокументОбъект       = ЭтотОбъект;
		НаборЗаписейПартии.СкладКомпании        = ШапкаДокумента.СкладКомпании;
		НаборЗаписейПартии.ИмяРеквизитаДокумент = ?(обПраво("ВыборочноеСписаниеПартий",Права,,ЭтотОбъект),"Партия","");
		НаборЗаписейПартии.СкладКомпанииКуда    = ШапкаДокумента.СкладПолучатель;
		НаборЗаписейПартии.ШапкаДокумента       = ШапкаДокумента;
		
		// если перемещение в филиал, то не будем приходовать
		Если ШапкаДокумента.ХозОперация=Справочники.ХозОперации.ПеремещениеТоваровВФилиал Тогда
			НаборЗаписейПартии.СкладКомпанииКуда=Неопределено;
		КонецЕсли;
		НаборЗаписейПартии.РезультатЗапросаПоТоварам=РезультатЗапросаПоТоварам;
		НаборЗаписейПартии.ПоБазовомуКоличеству=Истина;
		Отказ=НЕ НаборЗаписейПартии.Расход() ИЛИ Отказ;
		НаборЗаписейПартии.ГраницаРасчетаОстатков=Неопределено; // сбросим границу
		
		// Доходы и расходы
		Если ДобавлятьКорректирующиеЗаписи ИЛИ (ХозОперация=Справочники.ХозОперации.ПеремещениеТоваровВФилиал) Тогда
			// У подразделения склада-отправителя возникает расход.
			// У подразделения склада-получателя - доход.
			// Если это перемещение в филиал, то движений "приход" не будет.
			ТаблицаПартий = НаборЗаписейПартии.Выгрузить();
			ТаблицаПартий.Свернуть("СтатусПартии, ВидДвижения","СуммаУпр");
			
			Для Каждого ТекСтрокаДвижения Из ТаблицаПартий Цикл  	
				Если ТекСтрокаДвижения.СтатусПартии=Перечисления.СтатусыПартий.ТоварПринятыйКомиссия Тогда
					Продолжить;
				КонецЕсли;
				
				СуммаДиР = ТекСтрокаДвижения.СуммаУпр;
				Если СуммаДиР<>0 Тогда
					Если ТекСтрокаДвижения.ВидДвижения=ВидДвиженияНакопления.Расход Тогда
						НаборЗаписейДоходыРасходы=Движения.ДоходыИРасходы;
						НаборЗаписейДоходыРасходы.ДокументОбъект = ЭтотОбъект;
						// Если способ ведения баланса не по подразделению то подразделение должно быть как у документа
						Если Константы.СпособВеденияБаланса.Получить() = Перечисления.СпособВеденияБаланса.ПоПодразделению Тогда
							НаборЗаписейДоходыРасходы.Подразделение = ШапкаДокумента.ПодразделениеОтправителя;
						Иначе
							НаборЗаписейДоходыРасходы.Подразделение = Неопределено;
						КонецЕсли;
						НаборЗаписейДоходыРасходы.ВУпрВалюте     = Истина;
						НаборЗаписейДоходыРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.Себестоимость;
						НаборЗаписейДоходыРасходы.ШапкаДокумента = ШапкаДокумента;
						НаборЗаписейДоходыРасходы.Расход         = СуммаДиР;
						Отказ = НЕ НаборЗаписейДоходыРасходы.Приход() ИЛИ Отказ;
					Иначе
						НаборЗаписейДоходыРасходы=Движения.ДоходыИРасходы;
						НаборЗаписейДоходыРасходы.ДокументОбъект = ЭтотОбъект;
						НаборЗаписейДоходыРасходы.Подразделение  = ШапкаДокумента.ПодразделениеПолучателя; 
						НаборЗаписейДоходыРасходы.ВУпрВалюте     = Истина;
						НаборЗаписейДоходыРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
						НаборЗаписейДоходыРасходы.ШапкаДокумента = ШапкаДокумента;
						НаборЗаписейДоходыРасходы.Доход          = СуммаДиР;
						Отказ = НЕ НаборЗаписейДоходыРасходы.Приход() ИЛИ Отказ;
					КонецЕсли;
				КонецЕсли;			
			КонецЦикла;			
		КонецЕсли; 	
	КонецЕсли;
	
	Если НЕ Отказ Тогда НаборЗаписейПартии.Записать(); КонецЕсли; 	
	
	// двигаем границу последовательности партий
	Если Режим<>РежимПроведенияДокумента.Оперативный ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.СкладКомпанииБыл) Тогда
		// если идет допроведение, то надо получить те значения которые были раньше
		Если Ссылка<>ДокументСсылка Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ СкладКомпании ИЗ РегистрНакопления.ПартииТоваровКомпании ГДЕ Регистратор=&Ссылка");
			Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
			Результат = Запрос.Выполнить(); СкладКомпанииБыл=Неопределено;
			Если НЕ Результат.Пустой() Тогда
				СкладКомпанииБыл = Результат.Выгрузить().ВыгрузитьКолонку("СкладКомпании");
			КонецЕсли;
			ДополнительныеСвойства.Вставить("СкладКомпанииБыл",СкладКомпанииБыл);
			ДополнительныеСвойства.МоментВремениБыл = ДокументСсылка.МоментВремени();
		КонецЕсли;
		
		НаборЗаписейГраницыПартий = РегистрыСведений.ГраницыПартий.СоздатьНаборЗаписей();
		Если Режим<>РежимПроведенияДокумента.Оперативный Тогда
			ТаблицаСкладов = Движения.ПартииТоваровКомпании.Выгрузить();
			ТаблицаСкладов.Свернуть("СкладКомпании");
			
			НаборЗаписейГраницыПартий.СкладКомпании		= ТаблицаСкладов.ВыгрузитьКолонку("СкладКомпании");;
			НаборЗаписейГраницыПартий.МоментВремени		= ШапкаДокумента.Дата;
			НаборЗаписейГраницыПартий.СкладКомпанииБыл	= ДополнительныеСвойства.СкладКомпанииБыл;
			НаборЗаписейГраницыПартий.МоментВремениБыл	= ДополнительныеСвойства.МоментВремениБыл;
		Иначе
			НаборЗаписейГраницыПартий.СкладКомпании		= ДополнительныеСвойства.СкладКомпанииБыл;
			НаборЗаписейГраницыПартий.МоментВремени		= ДополнительныеСвойства.МоментВремениБыл;
			НаборЗаписейГраницыПартий.СкладКомпанииБыл	= Неопределено;
			НаборЗаписейГраницыПартий.МоментВремениБыл	= Неопределено;
		КонецЕсли;
		НаборЗаписейГраницыПартий.ДокументСсылка	= ШапкаДокумента.Ссылка;
		НаборЗаписейГраницыПартий.ИзменитьГраницу();
	КонецЕсли;
	
	Возврат НЕ Отказ;
КонецФункции // ПровестиПоПартиям()

// Расчет суммы документа
//
// Возвращаемое значение:
//  СуммаВсего - число.
//
Функция РассчитатьСуммуВсего()Экспорт
	Если ХозОперация=Справочники.ХозОперации.ПеремещениеТоваровИзФилиала Тогда
		СуммаВсего = Товары.Итог("СуммаВсего");
	Иначе
		СуммаВсего = дкПолучитьСуммуСписания(ЭтотОбъект, "ПартииТоваровКомпании", тКэшСуммСписания);
	КонецЕсли;
	
	Возврат СуммаВсего;
КонецФункции // РассчитатьСуммуВсего()

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка – Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	– Форма	 – Ссылка на форму документа. Если значение неопределено,
//                         производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	Перем флПолучатель; // флаг изменения склада
	// ОБРАБОТКА РЕКВИЗИТОВ ДОКУМЕНТА
	Если Имя="СкладКомпании" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Если ТипЗнч(ДопПараметры) = Тип("Структура") Тогда
			ДопПараметры.Вставить("Получатель",Ложь);
		Иначе
			ДопПараметры = Новый Структура("Получатель",Ложь);
		КонецЕсли;
		ОбработкаРеквизита("ОчиститьЯчейки",,,ДопПараметры);
		Возврат ОбработкаРеквизита("ПроверкаСкладаКомпании",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
		
	ИначеЕсли Имя="СкладПолучатель" Тогда
		Если ТипЗнч(ПодразделениеПолучатель) = Тип("СправочникСсылка.СкладыКомпании") Тогда
			Рез=ОбработкаРеквизита("ПроверкаСкладаКомпании",ТекСтрока,ЭтаФорма,ДопПараметры);
			Если НЕ обЗначениеНеЗаполнено(ПодразделениеПолучатель) Тогда
				Если ПодразделениеПолучатель.Розничный Тогда
					Для Каждого СтрокаТЧ Из Товары Цикл
						СтрокаТЧ.ЦенаРозничная=обПолучитьЦену(ПодразделениеПолучатель.ТипЦенРозничнойТорговли,СтрокаТЧ.Номенклатура,?(Ссылка.Пустая(),Дата,МоментВремени()),,,, СтрокаТЧ.ХарактеристикаНоменклатуры, СтрокаТЧ.ЕдиницаИзмерения, ПодразделениеПолучатель.Подразделение);
						Рез=ОбработкаРеквизита("Товары.ЦенаРозничная",СтрокаТЧ,ЭтаФорма,ДопПараметры) И Рез;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Рез = Истина;
		КонецЕсли;
		Если ТипЗнч(ДопПараметры) = Тип("Структура") Тогда
			ДопПараметры.Вставить("Получатель",Истина);
		Иначе
			ДопПараметры = Новый Структура("Получатель",Истина);
		КонецЕсли;
		ОбработкаРеквизита("ОчиститьЯчейки",,,ДопПараметры);
		Возврат Рез;
		
	ИначеЕсли Имя="ПроверкаСкладаКомпании" Тогда
		//Проверка корректности значения реквизита "СкладКомпании" И "СкладПолучатель"
		Если НЕ ЗначениеЗаполнено(ПодразделениеОтправитель) И НЕ ЗначениеЗаполнено(ПодразделениеПолучатель) Тогда
		КонецЕсли;
		Возврат Истина;
	ИначеЕсли Имя="ОчиститьЯчейки" Тогда
		
		// очистим ячейки
		Если Товары.Количество() <> 0 Тогда
			Если НЕ ДопПараметры.Свойство("Получатель",флПолучатель) Тогда
				флПолучатель = Ложь;
			КонецЕсли;
			Если флПолучатель Тогда
				ВремСклад  = ПодразделениеПолучатель;
				ИмяКолонки = "ЯчейкаПолучатель";
			Иначе
				ВремСклад  = ПодразделениеОтправитель;
				ИмяКолонки = "ЯчейкаОтправитель";
			КонецЕсли;
			
			Для Каждого стрТовары Из Товары Цикл
				Если НЕ обЗначениеНеЗаполнено(стрТовары.Номенклатура) Тогда
					ВремНоменклатура = стрТовары.Номенклатура.ПолучитьОбъект();
					стрТовары[ИмяКолонки] = ВремНоменклатура.ПолучитьЯчейкуХранения(ВремСклад);
				Иначе
					стрТовары[ИмяКолонки] = Справочники.ЯчейкиХранения.ПустаяСсылка();
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Возврат Истина;
		
	ИначеЕсли Имя="ПодразделениеКомпании" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Если ЗначениеЗаполнено(ПодразделениеКомпании) Тогда
			Если обПолучитьПраваИНастройкиПользователя(ПодразделениеКомпании,"ЗакрытиеЗаказовПоПодразделению",ЭтотОбъект) Тогда
				ЗакрытиеЗаказовПоПодразделению=Перечисления.ВариантыОтветов.Да;
			Иначе
				ЗакрытиеЗаказовПоПодразделению=Перечисления.ВариантыОтветов.Нет;
			КонецЕсли;
			
			СпособКонтроляКорректностиДоговораИСклада = обПолучитьПраваИНастройкиПользователя(ПодразделениеКомпании, "КонтрольКорректностиДоговораИСкладаДокумента", ЭтотОбъект);
			//Гэндальф+++
			//ЗакрытиеЗаказовПоОрганизации = (НЕ СпособКонтроляКорректностиДоговораИСклада = Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольОтсутствует);
			ЗакрытиеЗаказовПоОрганизации = Ложь;
			//Гэндальф---
		КонецЕсли;
		Возврат Рез;
		
		// ОБРАБОТКА РЕКВИЗИТОВ ТАБЛИЧНОЙ ЧАСТИ "ТОВАРЫ"
	ИначеЕсли Имя="Товары.Номенклатура" Тогда
		// глобально
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Если НЕ обДопустимаяСтрока(ТекСтрока) Тогда Возврат Рез; КонецЕсли; //Это если это был набор и мы удалили эту строку
		Если (НЕ обЗначениеНеЗаполнено(ПодразделениеПолучатель) И ?(ТипЗнч(ПодразделениеПолучатель)=Тип("СправочникСсылка.СкладыКомпании"),ПодразделениеПолучатель.Розничный,Ложь)) И НЕ ХозОперация=Справочники.ХозОперации.ПеремещениеТоваровВФилиал Тогда
			ТекСтрока.ЦенаРозничная=обПолучитьЦену(ПодразделениеПолучатель.ТипЦенРозничнойТорговли,ТекСтрока.Номенклатура,?(Ссылка.Пустая(),Дата,МоментВремени()),,,, ТекСтрока.ХарактеристикаНоменклатуры, ТекСтрока.ЕдиницаИзмерения, ПодразделениеПолучатель.Подразделение);
		ИначеЕсли ХозОперация=Справочники.ХозОперации.ПеремещениеТоваровВФилиал И НЕ обЗначениеНеЗаполнено(ПодразделениеОтправитель) И ПодразделениеОтправитель.Розничный Тогда
			ТекСтрока.ЦенаРозничная=обПолучитьЦену(ПодразделениеОтправитель.ТипЦенРозничнойТорговли,ТекСтрока.Номенклатура,?(Ссылка.Пустая(),Дата,МоментВремени()),,,, ТекСтрока.ХарактеристикаНоменклатуры, ТекСтрока.ЕдиницаИзмерения, ПодразделениеОтправитель.Подразделение);
		КонецЕсли;
		Рез=ОбработкаРеквизита("Товары.ЦенаРозничная",ТекСтрока,ЭтаФорма) И Рез;
		#Если Клиент Тогда
			Если ЭтаФорма<>Неопределено Тогда
				// изменим сумму документа
				дкВывестиЗаголовокСуммаДокумента(ЭтаФорма);
			КонецЕсли;
			ОбработкаРеквизита("Товары.Ячейки",ТекСтрока,ЭтаФорма);
		#КонецЕсли
		Возврат Рез;
		
	ИначеЕсли Имя="Товары.КоличествоБазовое" Тогда
		// глобально
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Возврат ОбработкаРеквизита("Товары.ЦенаРозничная",ТекСтрока,ЭтаФорма) И Рез;
		
	ИначеЕсли Имя="Товары.Количество" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		//Корельский 1082{
		Если ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровМеждуДЦ Тогда
			Если Проведен Тогда
				Если ТекСтрока.Количество < ТекСтрока.КоличествоПолучено Тогда
					ТекСтрока.Количество = ТекСтрока.КоличествоПолучено
				КонецЕсли;
			Иначе
				ТекСтрока.КоличествоПолучено = ТекСтрока.Количество;
			КонецЕсли;
		Иначе
			ТекСтрока.КоличествоПолучено = 0;
		КонецЕсли;
		//}
		Возврат ОбработкаРеквизита("УстановитьРозничнуюСумму",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
	ИначеЕсли Имя="Товары.ЕдиницаИзмерения" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Возврат ОбработкаРеквизита("УстановитьРозничнуюСумму",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
		
	ИначеЕсли Имя="Товары.Цена" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Возврат ОбработкаРеквизита("УстановитьПроцентНаценки",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
		
	ИначеЕсли Имя="Товары.Сумма" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Возврат ОбработкаРеквизита("УстановитьПроцентНаценки",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
		
	ИначеЕсли Имя="Товары.СуммаВсего" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Возврат ОбработкаРеквизита("УстановитьПроцентНаценки",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
		
	ИначеЕсли Имя="Товары.ПроцентНаценки" Тогда
		ВалютаРегл  = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		СтруктураКурса = обКурсДляВалюты(ВалютаРегл,Дата);
		КурсРегл    = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
		ТекЦенаЗакупки = ?(ВалютаРегл = ВалютаДокумента,ТекСтрока.Цена,обПересчет(ТекСтрока.Цена,ВалютаДокумента,КурсДокумента,ВалютаРегл,КурсРегл)); 
		ТекСтрока.ЦенаРозничная=ТекЦенаЗакупки+(ТекЦенаЗакупки*ТекСтрока.ПроцентНаценки/100);
		Если НЕ ТипЦен.ЦенаВключаетНДС Тогда
			ТекСтрока.ЦенаРозничная=ТекСтрока.ЦенаРозничная*(1+(ТекСтрока.СтавкаНДС.Ставка/100));
		КонецЕсли; 
		//ОбработкаРеквизита("УстановитьПроцентНаценки", ТекСтрока, ЭтаФорма, ДопПараметры);		
		Возврат ОбработкаРеквизита("УстановитьРозничнуюСумму",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Товары.ЦенаРозничная" Тогда
		Рез=ОбработкаРеквизита("УстановитьРозничнуюСумму",ТекСтрока,ЭтаФорма,ДопПараметры);
		Возврат ОбработкаРеквизита("УстановитьПроцентНаценки",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
		
	ИначеЕсли Имя="Товары.СуммаРозничная" Тогда
		Если (ТекСтрока.Количество=0) Тогда
			ТекСтрока.ЦенаРозничная=0;
		Иначе
			ТекСтрока.ЦенаРозничная=?(ТекСтрока.КоличествоБазовое=0,0,ТекСтрока.СуммаРозничная/ТекСтрока.КоличествоБазовое);
		КонецЕсли;
		Возврат ОбработкаРеквизита("УстановитьПроцентНаценки",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Товары.Партия" Тогда
		Если ХозОперация=Справочники.ХозОперации.ПеремещениеТоваровВФилиал Тогда
			// попытаемся найти цену на этот товар в документе партии
			Цена=ПолучитьЦенуИзДокументаПоставки(ТекСтрока.Партия,ТекСтрока.Номенклатура,,ТекСтрока.ХарактеристикаНоменклатуры);
			Если Цена>0 Тогда
				ТекСтрока.Цена=Цена;
				ОбработкаРеквизита("Товары.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
			КонецЕсли;
		КонецЕсли;
		Возврат Истина;
	ИначеЕсли Имя = "Товары.Ячейки" Тогда
		// если это набор установим в попытку
		Попытка
			Если обЗначениеНеЗаполнено(ТекСтрока.Номенклатура) Тогда
				ТекСтрока.ЯчейкаОтправитель=Справочники.ЯчейкиХранения.ПустаяСсылка();
				ТекСтрока.ЯчейкаПолучатель=Справочники.ЯчейкиХранения.ПустаяСсылка();
				Возврат Истина;
			КонецЕсли;
			ЯчейкаСсылка=ТекСтрока.Номенклатура.ПолучитьОбъект().ПолучитьЯчейкуХранения(ПодразделениеОтправитель);
			ТекСтрока.ЯчейкаОтправитель=ЯчейкаСсылка;
			ЯчейкаСсылка=ТекСтрока.Номенклатура.ПолучитьОбъект().ПолучитьЯчейкуХранения(ПодразделениеПолучатель);
			ТекСтрока.ЯчейкаПолучатель=ЯчейкаСсылка;
			Возврат Истина;
		Исключение
		КонецПопытки;
		
	ИначеЕсли Имя="УстановитьПроцентНаценки" Тогда
		//Установка процента наценки
		Если ТекСтрока.Цена=0 Тогда
			ТекСтрока.ПроцентНаценки=0;
		Иначе
			ВалютаРегл  = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
			СтруктураКурса = обКурсДляВалюты(ВалютаРегл,Дата);
			КурсРегл    = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
			ТекЦенаЗакупки = ?(ВалютаРегл = ВалютаДокумента,ТекСтрока.Цена,обПересчет(ТекСтрока.Цена,ВалютаДокумента,КурсДокумента,ВалютаРегл,КурсРегл)); 
			ЦенаРозничная  = ТекСтрока.ЦенаРозничная;
			
			Если НЕ ТипЦен.ЦенаВключаетНДС Тогда
				ЦенаРозничная = ЦенаРозничная * 100 / (100 + ТекСтрока.СтавкаНДС.Ставка);
			КонецЕсли;
			
			ТекСтрока.ПроцентНаценки=((ЦенаРозничная-ТекЦенаЗакупки)/ТекЦенаЗакупки)*100;
		КонецЕсли;
		Возврат Истина;
		
	ИначеЕсли Имя="УстановитьРозничнуюЦену" Тогда
		//Заполним розничную цену (для розничного склада)
		Если (НЕ обЗначениеНеЗаполнено(ПодразделениеОтправитель)) И ТипЗнч(ПодразделениеОтправитель)=Тип("СправочникСсылка.СкладыКомпании") И (ПодразделениеОтправитель.Розничный) Тогда
			Если (НЕ обЗначениеНеЗаполнено(ТекСтрока.Номенклатура)) И (ТекСтрока.Номенклатура.ВидНоменклатуры<>Перечисления.ВидыНоменклатуры.Услуга) Тогда
				ТекСтрока.ЦенаРозничная=обПолучитьЦену(ПодразделениеОтправитель.ТипЦенРозничнойТорговли,ТекСтрока.Номенклатура,?(Ссылка.Пустая(),Дата,МоментВремени()),,,, ТекСтрока.ХарактеристикаНоменклатуры, ТекСтрока.ЕдиницаИзмерения, ПодразделениеОтправитель.Подразделение);
				Если обЗначениеНеЗаполнено(ТекСтрока.ЦенаРозничная) И НЕ обЗначениеНеЗаполнено(ТекСтрока.Номенклатура.ПроцентНаценки) Тогда
					ТекСтрока.ЦенаРозничная = ТекСтрока.Цена + ТекСтрока.Цена*ТекСтрока.Номенклатура.ПроцентНаценки/100;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
		Возврат ОбработкаРеквизита("УстановитьРозничнуюСумму",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="УстановитьРозничнуюСумму" Тогда
		//Заполним розничную цену (для розничного склада)
		ТекСтрока.СуммаРозничная=ТекСтрока.ЦенаРозничная*ТекСтрока.КоличествоБазовое;
		Возврат Истина;
		
	Иначе Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()

// заполнение свойств из документа основания
Процедура ЗаполнитьСвойстваНаОсновании(Основание) Экспорт
	//зарезервировано для описания заполнения свойств из свойств основания
КонецПроцедуры


#Если Клиент Тогда
	////////////////////////////////////////////////////////////////////////////////
	// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА
	
	//Функция печати этикеток и ценников
	// 
	// Параметры:
	//  ТабДокумент - табличный документ.
	//
	Функция ПечатьЭтикетокИЦенников(ТабДокумент) Экспорт
		СтруктураПараметров=Неопределено;
		Если НЕ обЗначениеНеЗаполнено(ПодразделениеПолучатель) И ?(ТипЗнч(ПодразделениеПолучатель) = Тип("СправочникСсылка.СкладыКомпании"),ПодразделениеПолучатель.Розничный,Ложь) Тогда
			СтруктураПараметров=Новый Структура("ИмяРеквизитаЦена,ТипЦен","ЦенаРозничная",ПодразделениеПолучатель.ТипЦенРозничнойТорговли);
		КонецЕсли;
		дкПечатьЭтикетокИЦенников(ЭтотОбъект,СтруктураПараметров);
	КонецФункции // ПечатьЭтикетокИЦенников()
	
	// Формирует печатную форму "Накладная"
	// 
	// Параметры:
	//  ТабДокумент - табличный документ.
	//
	// Возвращаемое значение:
	//  ТабДокумент - возвращает сформированный табличный документ.
	//
	Функция ПечатьПеремещениеТоваров(ТабДокумент) Экспорт
		Макет = ПолучитьМакет("ПеремещениеТоваров");
		ВыборкаТабличнойЧасти = ЭтотОбъект.Товары;
		
		//настройка макета отчета
		
		//Удаляем колонку "ЯчейкаХранения", если ни в одной из номенклатур этот реквизит не заполнен
		//Увеличиваем за её счёт колонку "Товар"
		ЕстьЯчейкиХранения=Ложь;
		Для Каждого СтрокаТЧ Из ВыборкаТабличнойЧасти Цикл
			
			Если НЕ обЗначениеНеЗаполнено(СтрокаТЧ.ЯчейкаОтправитель) ИЛИ НЕ обЗначениеНеЗаполнено(СтрокаТЧ.ЯчейкаПолучатель) Тогда
				ЕстьЯчейкиХранения = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ЕстьЯчейкиХранения Тогда
			ОбластьТовар = Макет.Область("Товар");
			ОбластьЯчейкаХранения = Макет.Область("ЯчейкаХранения");
			ОбластьТовар.ШиринаКолонки = ОбластьТовар.ШиринаКолонки + ОбластьЯчейкаХранения.ШиринаКолонки;
			Макет.УдалитьОбласть(ОбластьЯчейкаХранения,ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
		
		//Удаляем колонку с розничной ценой и увеличиваем ширину колонки "Товар" за счёт ширины удалённой колонки
		ПечататьРозничныеЦены = ?(ТипЗнч(ПодразделениеПолучатель) = Тип("СправочникСсылка.СкладыКомпании"), ПодразделениеПолучатель.Розничный,Ложь) И (ХозОперация<>Справочники.ХозОперации.ПеремещениеТоваровВФилиал);
		
		Если НЕ ПечататьРозничныеЦены Тогда
			ОбластьТовар = Макет.Область("Товар");
			ОбластьЦенаРозничная = Макет.Область("ЦенаРозничная");
			ОбластьТовар.ШиринаКолонки = ОбластьТовар.ШиринаКолонки + ОбластьЦенаРозничная.ШиринаКолонки;
			Макет.УдалитьОбласть(ОбластьЦенаРозничная,ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
		
		//для начала настроим макет
		ОбластьШапкаТаблицы = дкПривестиМакетПечатнойФормы(ЭтотОбъект,Макет);
		ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
		
		//вывод заголовка документа
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		ТекстЗаголовка = дкПолучитьПредставление(ЭтотОбъект);
		ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьМакета.Параметры.ПредставлениеСклада		= спПолучитьНаименование(ЭтотОбъект.ПодразделениеОтправитель);
		ОбластьМакета.Параметры.ПредставлениеСкладаПолучателя = спПолучитьНаименование(ЭтотОбъект.ПодразделениеПолучатель);
		
		// Розничные цены всегда идут в регламентированной валюте
		Если ПечататьРозничныеЦены Тогда
			ОбластьМакета.Параметры.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		КонецЕсли;
		
		//вывод свойств
		СтрокаСвойств = дкПолучитьСтрокуСвойствДокумента(ЭтотОбъект);
		ОбластьМакета.Параметры.СтрокаСвойств = СтрокаСвойств;
		ТабДокумент.Вывести(ОбластьМакета);
		
		НомерСтраницы = 2;
		НомерСтраницыПред = НомерСтраницы;
		
		//теперь выводим шапку
		ТабДокумент.Вывести(ОбластьШапкаТаблицы);
		
		//готовим области строки
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		
		ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		СтруктураИтоговПоСтранице = Новый Структура();
		//заполним параметры шапки таблицы для следующего листа
		ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		
		//перебор строк
		Для Каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
			//заполняем данные строки
			СтруктураСтроки 		= дкПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТабличнойЧасти,ЭтотОбъект);
			//В возвращаемой структуре нет ключа "Ячейка", создадим его
			СтруктураСтроки.Вставить("Ячейка");
			СтруктураСтроки.Вставить("ЯчейкаПолуч");
			СтруктураСтроки.Цена 	= Формат(СтрокаТабличнойЧасти.ЦенаРозничная,ФорматВыводаСуммы);
			//Если ЯчейкаХранения не определена для данной номенклатуры, то печатаем пробел
			ЯчейкаДляПечати = СокрЛП(СтрокаТабличнойЧасти.ЯчейкаОтправитель.Код);
			СтруктураСтроки.Ячейка 	= ?(обЗначениеНеЗаполнено(ЯчейкаДляПечати)," ",ЯчейкаДляПечати);
			ЯчейкаДляПечати = СокрЛП(СтрокаТабличнойЧасти.ЯчейкаПолучатель.Код);
			СтруктураСтроки.ЯчейкаПолуч = ?(обЗначениеНеЗаполнено(ЯчейкаДляПечати)," ",ЯчейкаДляПечати);
			ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);
			
			//выводим строку, делая проверку попадания на лист
			НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице, НомерСтраницы, СтруктураИтоговПоСтранице,ЭтотОбъект);
			
			//инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				СтруктураИтоговПоСтранице = Новый Структура();
				НомерСтраницыПред = НомерСтраницы;
				ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			КонецЕсли;
			//добавляем итоги
			дкДобавитьИтогиПоСтранице(СтрокаТабличнойЧасти,СтруктураИтоговПоСтранице);
			
		КонецЦикла;
		
		//выводим последний подвал, если страниц больше единицы
		Если НомерСтраницы > 2 Тогда
			дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьМакетаИтогоПоСтранице,СтруктураИтоговПоСтранице,ЭтотОбъект);
		КонецЕсли;
		
		//итоги
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ОбластьМакета.Параметры.СуммаПрописью = "Всего наименований "+ВыборкаТабличнойЧасти.Количество();
		
		// Выводим представления и расшифровки подписей
		Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
		Отпустил.ОтпустилПредставление = ?(обЗначениеНеЗаполнено(Отпустил.Отпустил),"","/ "+ Отпустил.ОтпустилПредставление);
		ОбластьМакета.Параметры.Заполнить(Отпустил);
		Получил  = дкОтветственноеЛицо(ЭтотОбъект,"Получил");
		Получил.ПолучилПредставление = ?(обЗначениеНеЗаполнено(Получил.Получил),"","/ "+ Получил.ПолучилПредставление);
		ОбластьМакета.Параметры.Заполнить(Получил);
		
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, , , НомерСтраницы,,ЭтотОбъект);
		
		Возврат ТабДокумент;
	КонецФункции // ПечатьПеремещениеТоваров()
	
	// Формирует печатную форму "ТОРГ13"
	// 
	// Параметры:
	//  ТабДокумент - табличный документ.
	//
	// Возвращаемое значение:
	//  ТабДокумент - возвращает сформированный табличный документ.
	//
	Функция ПечатьТОРГ13(ТабДокумент) Экспорт
		Макет = ПолучитьОбщийМакет("ТОРГ13");
		
		ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества",Права,,ЭтотОбъект);
		ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
		
		СтруктураПредставления=Новый Структура(
		"Наименование,ИНН,АдресЮридический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		"","ИНН ","","тел.: ","р/с ","в банке ","БИК ","к/с "
		);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		ОбластьМакета.Параметры.ОрганизацияПредставление	= спПолучитьПредставление(ЭтотОбъект.Организация,СтруктураПредставления);
		ОбластьМакета.Параметры.ОрганизацияПоОКПО			= ЭтотОбъект.Организация.КодПоОКПО;
		ОбластьМакета.Параметры.ОтправительПодразделение	= обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузоотправитель",ЭтотОбъект.ПодразделениеОтправитель);
		ОбластьМакета.Параметры.ПолучательПодразделение		= обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузополучатель",ЭтотОбъект.ПодразделениеПолучатель);
		ОбластьМакета.Параметры.Номер = дкПолучитьНомерДляПечати(ЭтотОбъект);
		ТабДокумент.Вывести(ОбластьМакета);
		
		Розничный		= ?(ТипЗнч(ПодразделениеПолучатель) = Тип("СправочникСсылка.СкладыКомпании"),ЭтотОбъект.ПодразделениеПолучатель.Розничный,Ложь) И (ХозОперация<>Справочники.ХозОперации.ПеремещениеТоваровВФилиал);
		ВалютаРегл		= Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		СтруктураКурса	= обКурсДляВалюты(ВалютаРегл, ЭтотОбъект.Дата);
		КурсРегл		= СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
		ВалютаУпр		= Константы.ВалютаУправленческогоУчетаКомпании.Получить();
		ВалютаОтчета	= ?(Розничный, ВалютаРегл, ВалютаДокумента);
		КурсОтчета		= ?(Розничный, КурсРегл, КурсДокумента);
		
		Если обЗначениеНеЗаполнено(КурсВалютыУпр) Тогда
			СтруктураКурса = обКурсДляВалюты(ВалютаУпр,ЭтотОбъект.Дата);
			КурсУпр = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
		Иначе
			КурсУпр = ЭтотОбъект.КурсВалютыУпр; 
		КонецЕсли; 
		
		СтрокНаСтранице = 25;
		СтрокШапки      = 12;
		СтрокПодвала    = 5;
		НомерСтраницы   = 1;
		
		// Выводим заголовок таблицы
		ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
		ЗаголовокТаблицы.Параметры.Валюта = ВалютаОтчета;
		ТабДокумент.Вывести(ЗаголовокТаблицы);
		
		ВыборкаСтрокТовары = ЭтотОбъект.Товары;
		
		КоличествоСтрок = ВыборкаСтрокТовары.Количество();
		Если КоличествоСтрок = 1 Тогда
			ПереноситьПоследнююСтроку	= 0;
		Иначе
			ЦелыхСтраницСПодвалом		= Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
			ЦелыхСтраницБезПодвала		= Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
			ПереноситьПоследнююСтроку	= ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
		КонецЕсли;
		
		// Определим, что показывать в колонке кода - код или артикул
		ИмяКолонкиКода = дкПолучитьПараметрыРежимаВыводаКодаВДокументах(,ЭтотОбъект).Имя;
		
		// инициализация итогов по странице
		ИтогКоличествоМестПоСтранице = 0;
		ИтогМассаБруттоПоСтранице    = 0;
		ИтогМассыНеттоПоСтранице     = 0;
		ИтогСуммыПоСтранице          = 0;
		
		// инициализация итогов по документу
		ИтогоКоличество  = 0;
		ИтогоМассаБрутто = 0;
		ИтогоМассаНетто  = 0;
		ИтогоСумма       = 0;
		Ном = 0;
		
		// Выводим многострочную часть документа
		ОбластьИтоговПоСтранице	= Макет.ПолучитьОбласть("ИтогиПоСтранице");
		ОбластьМакета			= Макет.ПолучитьОбласть("Строка");
		
		СтрокаКолонокСвертки = "Количество, КоличествоБазовое,СуммаНДС";
		Если Розничный Тогда
			ЕстьПартии = Ложь;
			ИмяРегистра = "ОстаткиТоваровКомпании";
			ИспользуемыеРесурсы = Новый Структура("СуммаРозн");
			СтрокаКолонокСвертки = СтрокаКолонокСвертки+",СуммаРозн";
		Иначе
			ЕстьПартии = Истина;
			ИмяРегистра = "ПартииТоваровКомпании";
			ИспользуемыеРесурсы = Новый Структура(",Сумма"+?(ВалютаОтчета=ВалютаУпр,"Упр","")+",СуммаНДС");
			СтрокаКолонокСвертки = СтрокаКолонокСвертки+",Сумма"+?(ВалютаОтчета=ВалютаУпр,"Упр","")+",СуммаНДС";
		КонецЕсли;
		
		ВидДвиженияПриход = ?(ЭтотОбъект.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровВФилиал, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
		// передаем свой текст запроса, т.к. нужна колонка СуммаНДС
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ДокТовары.Номенклатура КАК Номенклатура,
		|	ДокТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ДокТовары.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ДокТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК Сумма"+?(Розничный,"Розн",?(ВалютаОтчета=ВалютаУпр,"Упр",""))+",
		|	СУММА(ДокТовары.Количество) КАК Количество,
		|	СУММА(ДокТовары.КоличествоБазовое) КАК КоличествоБазовое,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
		|	ДокТовары.СтавкаНДС КАК СтавкаНДС,
		|	ДокТовары.Партия
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ДокТовары
		|ГДЕ
		|	ДокТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокТовары.Номенклатура,
		|	ДокТовары.ЕдиницаИзмерения,
		|	ДокТовары.ЗаказПокупателя,
		|	ДокТовары.ХарактеристикаНоменклатуры,
		|	ДокТовары.СтавкаНДС,
		|	ДокТовары.Партия
		|";
		
		ТаблицаСуммСписания = дкПолучитьТаблицуСуммСписания(Ссылка, ЕстьПартии, ИмяРегистра, ИспользуемыеРесурсы, ВидДвиженияПриход,ТекстЗапроса);
		
		ТаблицаСуммСписания.Свернуть("Номенклатура,ЕдиницаИзмерения,ХарактеристикаНоменклатуры,СтавкаНДС", СтрокаКолонокСвертки);
		
		Для Каждого ТекСтрока Из ТаблицаСуммСписания Цикл
			Ном = Ном + 1;
			ЦелаяСтраница	= (СтрокШапки + Ном - 1) / СтрокНаСтранице;
			
			Если (ЦелаяСтраница = Цел(ЦелаяСтраница))
				или ((ПереноситьПоследнююСтроку = 1) и (Ном = КоличествоСтрок)) Тогда
				ОбластьИтоговПоСтранице.Параметры.ИтогКоличествоМестПоСтранице = Формат(ИтогКоличествоМестПоСтранице,ФорматВыводаКоличества);
				ОбластьИтоговПоСтранице.Параметры.ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице;
				ОбластьИтоговПоСтранице.Параметры.ИтогМассыНеттоПоСтранице     = ИтогМассыНеттоПоСтранице;
				ОбластьИтоговПоСтранице.Параметры.ИтогСуммыПоСтранице          = Формат(ИтогСуммыПоСтранице,ФорматВыводаСуммы);
				ТабДокумент.Вывести(ОбластьИтоговПоСтранице);
				
				// инициализация итогов по странице
				ИтогКоличествоМестПоСтранице = 0;
				ИтогМассаБруттоПоСтранице    = 0;
				ИтогМассаНеттоПоСтранице     = 0;
				ИтогСуммыПоСтранице          = 0;
				
				НомерСтраницы = НомерСтраницы + 1;
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
				ТабДокумент.Вывести(ЗаголовокТаблицы);
			КонецЕсли;
			
			Если Розничный Тогда
				Сумма = ТекСтрока.СуммаРозн;
			Иначе
				Если ВалютаОтчета=ВалютаУпр Тогда
					Сумма = ТекСтрока.СуммаУпр-?(ТекСтрока.СуммаНДС<>0, обПересчет(ТекСтрока.СуммаНДС, ВалютаРегл, КурсРегл, ВалютаОтчета, КурсОтчета), 0);
				ИначеЕсли ВалютаОтчета=ВалютаРегл Тогда
					Сумма = ТекСтрока.Сумма-ТекСтрока.СуммаНДС;
				Иначе
					Сумма = обПересчет(ТекСтрока.Сумма, ВалютаРегл, КурсРегл, ВалютаОтчета, КурсОтчета)-?(ТекСтрока.СуммаНДС<>0, обПересчет(ТекСтрока.СуммаНДС, ВалютаРегл, КурсРегл, ВалютаОтчета, КурсОтчета),0);
				КонецЕсли; 
			КонецЕсли;
			
			ОбластьМакета.Параметры.Заполнить(ТекСтрока);
			Характеристика										= Строка(ТекСтрока.ХарактеристикаНоменклатуры);
			ОбластьМакета.Параметры.ТоварНаименование			= спПолучитьНаименование(ТекСтрока.Номенклатура) + ?(Характеристика = "", "",", " + Характеристика);
			ОбластьМакета.Параметры.ТоварКод					= дкПолучитьЗначениеКолонкиКода(ТекСтрока.Номенклатура,ИмяКолонкиКода,ЭтотОбъект);
			ОбластьМакета.Параметры.ЕдиницаИзмерения			= ТекСтрока.ЕдиницаИзмерения;
			ОбластьМакета.Параметры.ЕдиницаИзмеренияКодПоОКЕИ	= ТекСтрока.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;
			
			ОбластьМакета.Параметры.КоличествоВОдномМесте		= Формат(ТекСтрока.ЕдиницаИзмерения.Коэффициент,ФорматВыводаКоличества);
			ОбластьМакета.Параметры.КоличествоМест				= Формат(ТекСтрока.Количество,ФорматВыводаКоличества);
			МассаБрутто 										= ТекСтрока.Количество * ТекСтрока.ЕдиницаИзмерения.Вес;
			ОбластьМакета.Параметры.МассаБрутто					= МассаБрутто;
			ОбластьМакета.Параметры.Цена						= Формат(Сумма/ТекСтрока.Количество,ФорматВыводаСуммы);
			ОбластьМакета.Параметры.Сумма						= Формат(Сумма,ФорматВыводаСуммы);
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Обновим итоги по странице
			ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице + ТекСтрока.Количество;
			ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице    + МассаБрутто;
			ИтогМассыНеттоПоСтранице     = ИтогМассыНеттоПоСтранице     + 0;
			ИтогСуммыПоСтранице          = ИтогСуммыПоСтранице          + Сумма;
			
			// Обновим итоги по документу
			ИтогоКоличество  = ИтогоКоличество  + ТекСтрока.Количество;
			ИтогоМассаБрутто = ИтогоМассаБрутто + МассаБрутто;
			ИтогоМассаНетто  = ИтогоМассаНетто  + 0;
			ИтогоСумма       = ИтогоСумма       + Сумма;
		КонецЦикла;
		
		ОбластьИтоговПоСтранице.Параметры.ИтогКоличествоМестПоСтранице = Формат(ИтогКоличествоМестПоСтранице,ФорматВыводаКоличества);
		ОбластьИтоговПоСтранице.Параметры.ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице;
		ОбластьИтоговПоСтранице.Параметры.ИтогМассыНеттоПоСтранице     = ИтогМассыНеттоПоСтранице;
		ОбластьИтоговПоСтранице.Параметры.ИтогСуммыПоСтранице          = Формат(ИтогСуммыПоСтранице,ФорматВыводаСуммы);
		ТабДокумент.Вывести(ОбластьИтоговПоСтранице);
		
		// Выводим итоги по документу в целом
		ОбластьМакета = Макет.ПолучитьОбласть("Всего");
		ОбластьМакета.Параметры.ИтогоКоличествоМест = Формат(ИтогоКоличество,ФорматВыводаКоличества);
		ОбластьМакета.Параметры.ИтогоМассаБрутто    = ИтогоМассаБрутто;
		ОбластьМакета.Параметры.ИтогоМассаНетто     = ИтогоМассаНетто;
		ОбластьМакета.Параметры.ИтогоСумма          = Формат(ИтогоСумма,ФорматВыводаСуммы);
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Выводим подвал документа
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		// текст без копеек (не Сто 00   , а   просто Сто)
		// текст без копеек (не Сто 00   , а   просто Сто)
		ПараметрыПрописиНаРусскомОбщ = ВалютаОтчета.ПараметрыПрописиНаРусском;
		ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусскомОбщ, "1", "0");
		ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "2", "0");
		ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "3", "0");
		ОбластьМакета.Параметры.ИтогоСуммаПрописью = ЧислоПрописью(Цел(ИтогоСумма), "L=ru_RU; НП=Ложь; НД=Ложь", ПараметрыПрописиНаРусском);
		//ОбластьМакета.Параметры.ИтогоСуммаКоп      = Формат(Цел((ИтогоСумма-Цел(ИтогоСумма))*100), "ЧЦ=2; ЧН=00");
		ОбластьМакета.Параметры.Валюта = ВалютаОтчета;
		ОбщаяСумма = ЧислоПрописью(ИтогоСумма, "L=ru_RU; НП=Ложь; НД=Истина", ПараметрыПрописиНаРусскомОбщ);
		ОбластьМакета.Параметры.ИтогоСуммаКоп      = СокрЛП(СтрЗаменить(ОбщаяСумма,ОбластьМакета.Параметры.ИтогоСуммаПрописью,""));
		
		Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
		ОбластьМакета.Параметры.Заполнить(Отпустил);
		
		Получил = дкОтветственноеЛицо(ЭтотОбъект,"Получил");
		ОбластьМакета.Параметры.Заполнить(Получил);
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Зададим параметры макета
		ТабДокумент.ПолеСверху = 0;
		ТабДокумент.ПолеСлева  = 15;
		ТабДокумент.ПолеСнизу  = 0;
		ТабДокумент.ПолеСправа = 0;
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		Возврат ТабДокумент;
		
	КонецФункции // ПечатьТОРГ13()
	
	// Формирует печатную форму Т-1 "Товарно-транспортная накладная"
	// 
	// Параметры:
	//  ТабДокумент - табличный документ.
	//
	// Возвращаемое значение:
	//  ТабДокумент - возвращает сформированный табличный документ.
	//
	Функция ПечатьТ1(ТабДокумент) Экспорт
		
		ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы", Права,,ЭтотОбъект);
		ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества", Права,,ЭтотОбъект);
		
		НомерДляПечати=дкПолучитьНомерДляПечати(ЭтотОбъект);
		
		// Зададим параметры макета
		ТабДокумент.ПолеСверху = 0;
		ТабДокумент.ПолеСлева  = 0;
		ТабДокумент.ПолеСнизу  = 0;
		ТабДокумент.ПолеСправа = 0;
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		Макет = ПолучитьОбщийМакет("ТТН");
		
		//дальше заполнить Шапку
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		//ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		
		СтруктураПредставления2=Новый Структура(
		"Наименование,ИНН,КПП,АдресФактический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		"","ИНН ","КПП ","","тел.: ","р/с ","в банке ","БИК ","к/с ");
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.НомерДокумента                = НомерДляПечати;
		ОбластьМакета.Параметры.ДатаДокумента                 = Формат(Дата,"ДФ=dd.MM.yyyy");
		ОбластьМакета.Параметры.Грузоотправитель			  = обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузоотправитель",ЭтотОбъект.ПодразделениеОтправитель);
		ОбластьМакета.Параметры.Грузополучатель				  = обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузополучатель",ЭтотОбъект.ПодразделениеПолучатель);
		
		Если ТипЗнч(ОбластьМакета.Параметры.Грузоотправитель) = Тип("СправочникСсылка.СкладыКомпании") Тогда
			ОбластьМакета.Параметры.ГрузоотправительПредставление = спПолучитьПредставление(ОбластьМакета.Параметры.Грузоотправитель,СтруктураПредставления2);
			ОбластьМакета.Параметры.ГрузоотправительПоОКПО		  = ОбластьМакета.Параметры.Грузоотправитель.Организация.КодПоОКПО;
		Иначе
			ОбластьМакета.Параметры.ГрузоотправительПредставление = ОбластьМакета.Параметры.Грузоотправитель.Наименование;
		КонецЕсли;
		
		Если ТипЗнч(ОбластьМакета.Параметры.Грузополучатель) = Тип("СправочникСсылка.СкладыКомпании") Тогда
			ОбластьМакета.Параметры.ГрузополучательПредставление  = спПолучитьПредставление(ОбластьМакета.Параметры.Грузополучатель,СтруктураПредставления2);
			ОбластьМакета.Параметры.ГрузополучательПоОКПО		  = ОбластьМакета.Параметры.Грузополучатель.Организация.КодПоОКПО;
		Иначе
			ОбластьМакета.Параметры.ГрузополучательПредставление  = ОбластьМакета.Параметры.Грузополучатель.Наименование;
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Выводим заголовок таблицы
		ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ОбластьЗаголовокТаблицы.Параметры.валюта=ВалютаДокумента;
		ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
		
		НомерСтраницы	= 2;
		НомерСтраницыПред = НомерСтраницы;	
		
		ОбластьСтрока	= Макет.ПолучитьОбласть("Строка");
		ОбластьИтоги	= Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьВсего	= Макет.ПолучитьОбласть("Всего");
		ОбластьПодвал	= Макет.ПолучитьОбласть("Подвал");
		
		// инициализация итогов по странице
		СтруктураИтоговПоСтранице = Новый Структура("Количество, СуммаВсего",0,0);
		
		//заполним параметры шапки таблицы для следующего листа
		ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы  = "Страница: " + НомерСтраницы;
		ОбластьЗаголовокТаблицы.Параметры.ТекстЗаголовка = "Товарно-транспортная накладная товарный раздел";
		
		Розничный = ?(ТипЗнч(ПодразделениеПолучатель) = Тип("СправочникСсылка.СкладыКомпании"),ЭтотОбъект.ПодразделениеПолучатель.Розничный,Ложь) И (ХозОперация<>Справочники.ХозОперации.ПеремещениеТоваровВФилиал);
		
		// инициализация итогов по документу
		Ном             = 0;
		ИтогоМест       = 0;
		ИтогоКоличество = 0;
		ИтогоВес        = 0;
		ИтогоСумма      = 0;
		
		СтрокаКолонокСвертки = "Количество, КоличествоБазовое";
		Если Розничный Тогда
			ЕстьПартии = Ложь;
			ИмяРегистра = "ОстаткиТоваровКомпании";
			ИспользуемыеРесурсы = Новый Структура("СуммаРозн");
			СтрокаКолонокСвертки = СтрокаКолонокСвертки+",СуммаРозн";
		Иначе
			ЕстьПартии = Истина;
			ИмяРегистра = "ПартииТоваровКомпании";
			ИспользуемыеРесурсы = Новый Структура("Сумма");
			СтрокаКолонокСвертки = СтрокаКолонокСвертки+",Сумма";
		КонецЕсли;
		
		ВидДвиженияПриход = ?(ЭтотОбъект.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровВФилиал, ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);
		
		ТаблицаСуммСписания = дкПолучитьТаблицуСуммСписания(Ссылка, ЕстьПартии, ИмяРегистра, ИспользуемыеРесурсы, ВидДвиженияПриход);
		ТаблицаСуммСписания.Свернуть("Номенклатура,ЕдиницаИзмерения,ХарактеристикаНоменклатуры", СтрокаКолонокСвертки);
		КоличествоСтрок = ТаблицаСуммСписания.Количество();
		
		//доп. области
		мсвДопОбластиПодвала = Новый Массив;
		мсвДопОбластиПодвала.Добавить(ОбластьВсего);
		мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
		
		Для Каждого ТекСтрока Из ТаблицаСуммСписания Цикл
			//заполняем данные строки
			Ном = Ном + 1;
			ТоварНаименование = спПолучитьНаименование(ТекСтрока.Номенклатура);
			Характеристика = ТекСтрока.ХарактеристикаНоменклатуры;
			//характеристику выводим в строке с наименованием
			ТоварНаименование = ТоварНаименование + ?(НЕ обЗначениеНеЗаполнено(Характеристика),", " + спПолучитьНаименование(Характеристика),"");
			
			Сумма = ?(Розничный, ТекСтрока.СуммаРозн, ТекСтрока.Сумма);
			Цена=Сумма/ТекСтрока.КоличествоБазовое;
			МассаБрутто = ТекСтрока.Количество * ТекСтрока.ЕдиницаИзмерения.Вес;
			
			ОбластьСтрока.Параметры.КодПродукции				= ТекСтрока.Номенклатура.Код;
			//ОбластьСтрока.Параметры.НомерПрейскуранта
			ОбластьСтрока.Параметры.Артикул 					= ТекСтрока.Номенклатура.Артикул;
			ОбластьСтрока.Параметры.Количество					= Формат(ТекСтрока.КоличествоБазовое, ФорматВыводаКоличества);
			ОбластьСтрока.Параметры.Цена						= Формат(Цена, ФорматВыводаСуммы);
			ОбластьСтрока.Параметры.ТоварНаименование			= ТоварНаименование;
			ОбластьСтрока.Параметры.Номенклатура				= ТекСтрока.Номенклатура;
			ОбластьСтрока.Параметры.БазоваяЕдиницаНаименование	= спПолучитьНаименование(ТекСтрока.ЕдиницаИзмерения);
			ОбластьСтрока.Параметры.ВидУпаковки					= ТекСтрока.ЕдиницаИзмерения.ЕдиницаПоКлассификатору;
			ОбластьСтрока.Параметры.КоличествоМест				= Формат(ТекСтрока.Количество, ФорматВыводаКоличества);
			ОбластьСтрока.Параметры.Масса						= Формат(МассаБрутто, ФорматВыводаКоличества);
			ОбластьСтрока.Параметры.СуммаВсего					= Формат(Сумма, ФорматВыводаСуммы);
			//ОбластьСтрока.Параметры.НомерЗаписиВКартотеке		= 
			
			ИтогоМест		= ИтогоМест + ТекСтрока.Количество;
			ИтогоВес		= ИтогоВес + МассаБрутто;
			ИтогоКоличество	= ИтогоКоличество + ТекСтрока.КоличествоБазовое;
			ИтогоСумма		= ИтогоСумма + Сумма;
			
			//выводим строку, делая проверку попадания на лист		
			НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрока, ОбластьЗаголовокТаблицы, ОбластьИтоги, НомерСтраницы, СтруктураИтоговПоСтранице, ЭтотОбъект, ?(Ном=КоличествоСтрок,мсвДопОбластиПодвала,Неопределено));
			
			//инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				СтруктураИтоговПоСтранице = Новый Структура("Количество, СуммаВсего",0,0);
				НомерСтраницыПред = НомерСтраницы;
				ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			КонецЕсли;
			
			//обновим итоги по странице
			СтруктураИтоговПоСтранице.Количество = СтруктураИтоговПоСтранице.Количество + ТекСтрока.КоличествоБазовое;
			СтруктураИтоговПоСтранице.СуммаВсего = СтруктураИтоговПоСтранице.СуммаВсего + Сумма;
		КонецЦикла;
		
		//выводим последний подвал, если страниц больше единицы
		Если НомерСтраницы > 2 Тогда
			дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьИтоги,СтруктураИтоговПоСтранице,ЭтотОбъект);
		КонецЕсли;
		
		// Выводим итоги по документу в целом
		ОбластьВсего.Параметры.Количество = Формат(ИтогоКоличество, ФорматВыводаКоличества);
		ОбластьВсего.Параметры.СуммаВсего = Формат(ИтогоСумма, ФорматВыводаСуммы);
		
		ТабДокумент.Вывести(ОбластьВсего);
		
		// Выводим подвал документа
		Руководитель = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.Руководитель);
		ОбластьПодвал.Параметры.Заполнить(Руководитель);
		ГлавныйБухгалтер = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер);
		ОбластьПодвал.Параметры.Заполнить(ГлавныйБухгалтер);
		Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
		ОбластьПодвал.Параметры.Заполнить(Отпустил);
		Получил  = дкОтветственноеЛицо(ЭтотОбъект,"Получил");
		ОбластьПодвал.Параметры.Заполнить(Получил);
		ОбластьПодвал.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ЧислоПрописью(КоличествоСтрок,,",,,,,,,,0");
		ОбластьПодвал.Параметры.КоличествоСтрок         = КоличествоСтрок;
		ОбластьПодвал.Параметры.ОтпущеноНаСуммуПрописью = обЧислоПрописью(ИтогоСумма,ВалютаДокумента,,",,,,,,,,2");
		ОбластьПодвал.Параметры.ВсегоКОплате			 = Формат(ИтогоСумма, ФорматВыводаСуммы);
		Если НЕ Цел(ИтогоМест) = ИтогоМест Тогда
			ОбластьПодвал.Параметры.МассаГрузаБрутто		= ЧислоПрописью(ИтогоВес,,",,,,,,,,3");
			ОбластьПодвал.Параметры.ВсегоМестПрописью       = ЧислоПрописью(ИтогоМест,,",,,,,,,,3");
		Иначе
			ОбластьПодвал.Параметры.МассаГрузаБрутто		= ЧислоПрописью(ИтогоВес,,",,,,,,,,0");
			ОбластьПодвал.Параметры.ВсегоМестПрописью       = ЧислоПрописью(ИтогоМест,,",,,,,,,,0");
		КонецЕсли;
		ОбластьПодвал.Параметры.ВсегоНаименований       = ЧислоПрописью(КоличествоСтрок,,",,,,,,,,0");
		
		ТабДокумент.Вывести(ОбластьПодвал);
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ОбластьМакета   = Макет.ПолучитьОбласть("ТранспортныйРаздел");
		
		ЛицензионнаяКарточка 		= обПолучитьЗначениеСвойства(ЭтотОбъект, "ЛицензионнаяКарточка");
		СрокДоставки 				= обПолучитьЗначениеСвойства(ЭтотОбъект, "СрокДоставки");
		Перевозчик 					= обПолучитьЗначениеСвойства(ЭтотОбъект, "ОрганизацияПеревозчик");
		МаркаАвтомобиля     	    = обПолучитьЗначениеСвойства(ЭтотОбъект, "МаркаАвтомобиля");
		ГосНомерАвтомобиля	        = обПолучитьЗначениеСвойства(ЭтотОбъект, "ГосНомерАвтомобиля");
		Заказчик	 				= обПолучитьЗначениеСвойства(ЭтотОбъект, "ОрганизацияЗаказчик");
		Водитель					= обПолучитьЗначениеСвойства(ЭтотОбъект, "ФИОВодителя");
		ВодительскоеУдостоверение	= обПолучитьЗначениеСвойства(ЭтотОбъект, "ВодительскоеУдостоверение");
		ВидПеревозки	            = обПолучитьЗначениеСвойства(ЭтотОбъект, "ВидПеревозки");
		ПунктПогрузки             	= обПолучитьЗначениеСвойства(ЭтотОбъект, "ПунктПогрузки");
		ПунктРазгрузки            	= обПолучитьЗначениеСвойства(ЭтотОбъект, "ПунктРазгрузки");
		МаркаПрицепа 			  	= обПолучитьЗначениеСвойства(ЭтотОбъект, "Прицеп");
		ГосНомерПрицепа	           	= обПолучитьЗначениеСвойства(ЭтотОбъект, "ГосНомерПрицепа");
		
		Если ТипЗнч(ЛицензионнаяКарточка) = Тип("Булево") Тогда
			ШрифтСтандарт   = Новый Шрифт(ОбластьМакета.Области.Стандарт.Шрифт, , , , , , НЕ ЛицензионнаяКарточка);
			ШрифтОграничено = Новый Шрифт(ОбластьМакета.Области.Стандарт.Шрифт, , , , , , ЛицензионнаяКарточка);
			ОбластьМакета.Области.Стандарт.Шрифт   = ШрифтСтандарт;
			ОбластьМакета.Области.Ограничено.Шрифт = ШрифтОграничено;
		КонецЕсли;
		
		ОбластьМакета.Параметры.СрокДоставки              = СрокДоставки;
		ОбластьМакета.Параметры.Номер                     = НомерДляПечати;
		ОбластьМакета.Параметры.ОрганизацияПеревозчик     = Перевозчик;
		ОбластьМакета.Параметры.МаркаАвтомобиля           = МаркаАвтомобиля;
		ОбластьМакета.Параметры.ГосНомерАвтомобиля        = ГосНомерАвтомобиля;
		ОбластьМакета.Параметры.ОрганизацияЗаказчик       = Заказчик;
		ОбластьМакета.Параметры.ФИОВодителя               = Водитель;
		ОбластьМакета.Параметры.ВодительскоеУдостоверение = ВодительскоеУдостоверение;
		ОбластьМакета.Параметры.ВидПеревозки              = ВидПеревозки;
		ОбластьМакета.Параметры.ПунктПогрузки             = ПунктПогрузки;
		ОбластьМакета.Параметры.ПунктРазгрузки            = ПунктРазгрузки;
		ОбластьМакета.Параметры.Прицеп                    = МаркаПрицепа;
		ОбластьМакета.Параметры.ГосНомерПрицепа           = ГосНомерПрицепа;
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("СведенияОГрузе");
		ТабДокумент.Вывести(ОбластьМакета);
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалСведенийОГрузе");
		ТабДокумент.Вывести(ОбластьМакета);
		ОбластьМакета = Макет.ПолучитьОбласть("ПогрузочныеОперации");
		ТабДокумент.Вывести(ОбластьМакета);
		ОбластьМакета = Макет.ПолучитьОбласть("ПрочиеСведения");
		ОбластьМакета.Параметры.валюта=ВалютаДокумента;
		ТабДокумент.Вывести(ОбластьМакета);
		
		ТабДокумент.АвтоМасштаб = Истина;
		
		Возврат ТабДокумент;
		
	КонецФункции // ПечатьТ1()
	
	// Формирует печатную форму Приложение №4 "Транспортная накладная"
	// 
	// Параметры:
	//  ТабДокумент - табличный документ.
	//
	// Возвращаемое значение:
	//  ТабДокумент - возвращает сформированный табличный документ.
	//
	Функция ПечатьПриложение4(ТабДокумент) Экспорт
		ТабДокумент = дкПечатьНовойТТН(ЭтотОбъект,ТабДокумент);
		Возврат ТабДокумент;
	КонецФункции // ПечатьПриложение4()
	
	// Формирует печатную форму "М-11"
	// 
	// Параметры:
	//  ТабДокумент - табличный документ.
	//
	// Возвращаемое значение:
	//  ТабДокумент - возвращает сформированный табличный документ.
	//
	Функция ПечатьМ11(ТабДокумент) Экспорт
		Макет = ПолучитьОбщийМакет("М11");
		
		ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
		ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества",Права,,ЭтотОбъект);
		
		// выводим шапку
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		
		СтруктураПредставления=Новый Структура(
		"Наименование,ИНН,АдресЮридический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		"","ИНН ","","тел.: ","р/с ","в банке ","БИК ","к/с "
		);
		
		// Правим, что автоматом не заполнилось, или заполнилось неправильно
		ОбластьМакета.Параметры.Заголовок = "ТРЕБОВАНИЕ-НАКЛАДНАЯ № "+дкПолучитьНомерДляПечати(ЭтотОбъект);
		ОбластьМакета.Параметры.ОрганизацияПредставление = спПолучитьПредставление(ЭтотОбъект.Организация,СтруктураПредставления);
		ОбластьМакета.Параметры.КодОКПО		= Организация.КодПоОКПО;
		ОбластьМакета.Параметры.ДатаСоставления			= Формат(Дата, "ДФ = дд.ММ.гггг");
		ОбластьМакета.Параметры.СкладОтправитель	= обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузоотправитель",ЭтотОбъект.ПодразделениеОтправитель);
		ОбластьМакета.Параметры.СкладПолучатель			= обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузополучатель",ЭтотОбъект.ПодразделениеПолучатель);
		ТабДокумент.Вывести(ОбластьМакета);
		
		//переменные управляющие постраничным выводом
		СтрокНаСтранице = 25;
		СтрокШапки      = 10;
		СтрокПодвала    = 6;
		НомерСтраницы   = 1;		
		
		ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьСтрока           = Макет.ПолучитьОбласть("Строка");
		
		// выводим заголовок таблицы
		ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
		ОбластьЗаголовокТаблицы.Параметры.Валюта = ВалютаДокумента;
		ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
		
		ВыборкаСтрок = ЭтотОбъект.Товары;
		
		КоличествоСтрок = ВыборкаСтрок.Количество();
		Если КоличествоСтрок = 1 Тогда
			ПереноситьПоследнююСтроку = 0;
		Иначе
			ЦелыхСтраницСПодвалом     = Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
			ЦелыхСтраницБезПодвала    = Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
			ПереноситьПоследнююСтроку = ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
		КонецЕсли;
		
		// Определим имя показываемой колонки кода
		ИмяКолонкиКода = дкПолучитьПараметрыРежимаВыводаКодаВДокументах(,ЭтотОбъект).Имя;
		
		Ном = 0;
		
		// проверим, входит ли НДС в стоимость	
		ЦенаВключаетНДС = ТипЦен.ЦенаВключаетНДС;
		
		// Выводим многострочную часть документа
		Для Каждого СтрокаТабличнойЧасти Из ВыборкаСтрок Цикл
			Ном = Ном + 1;
			ЦелаяСтраница = (СтрокШапки + Ном - 1) / СтрокНаСтранице;
			
			Если (ЦелаяСтраница = Цел(ЦелаяСтраница))
				или ((ПереноситьПоследнююСтроку = 1) и (Ном = КоличествоСтрок)) Тогда
				
				НомерСтраницы = НомерСтраницы + 1;
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
				ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
			КонецЕсли;
			
			ОбластьСтрока.Параметры.Заполнить(СтрокаТабличнойЧасти);
			Характеристика											= Строка(СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
			ОбластьСтрока.Параметры.ТоварНаименование				= спПолучитьНаименование(СтрокаТабличнойЧасти.Номенклатура) + ?(Характеристика = "", "",", " + Характеристика);
			ОбластьСтрока.Параметры.НоменклатурныйНомер				= дкПолучитьЗначениеКолонкиКода(СтрокаТабличнойЧасти.Номенклатура,ИмяКолонкиКода,ЭтотОбъект);
			ОбластьСтрока.Параметры.ЕдиницаИзмеренияКод				= СтрокаТабличнойЧасти.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;
			ОбластьСтрока.Параметры.ЕдиницаИзмеренияНаименование	= СтрокаТабличнойЧасти.ЕдиницаИзмерения;
			ОбластьСтрока.Параметры.Количество						= Формат(СтрокаТабличнойЧасти.Количество,ФорматВыводаКоличества);
			Если ЦенаВключаетНДС Тогда
				ОбластьСтрока.Параметры.Цена		= Формат(СтрокаТабличнойЧасти.Цена,ФорматВыводаСуммы);
				ОбластьСтрока.Параметры.СуммаБезНДС	= Формат(СтрокаТабличнойЧасти.Сумма,ФорматВыводаСуммы);
			Иначе
				ОбластьСтрока.Параметры.Цена 		= Формат(СтрокаТабличнойЧасти.Цена,ФорматВыводаСуммы);
				ОбластьСтрока.Параметры.СуммаБезНДС	= Формат(СтрокаТабличнойЧасти.Сумма,ФорматВыводаСуммы);
			КонецЕсли;		
			ТабДокумент.Вывести(ОбластьСтрока);
			
		КонецЦикла;
		
		// выводим подвал
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		
		Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
		ОбластьМакета.Параметры.Заполнить(Отпустил);
		
		Получил = дкОтветственноеЛицо(ЭтотОбъект,"Получил");
		ОбластьМакета.Параметры.Заполнить(Получил);
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Зададим параметры макета
		
		ТабДокумент.ПолеСверху = 0;
		ТабДокумент.ПолеСлева  = 0;
		ТабДокумент.ПолеСнизу  = 0;
		ТабДокумент.ПолеСправа = 0;
		ТабДокумент.АвтоМасштаб=Истина;
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		Возврат ТабДокумент;
	КонецФункции // ПечатьМ11()
	
	// Функция осуществляет печать произвольного документа.
	// Можно направить печать на экран или принтер, а также распечатать необходимое количество копий.
	//
	// Параметры:
	//	ЭтотОбъект							- ДокументОбъект	- Документ для печати
	//	НазваниеПечатнойФормы 				- Строка			- Название печатной формы, если пусто, то по умолчанию
	//	КоличествоЭкземпляров				- Число				- Количество экземпляров документа
	//	НаПринтер							- Булево			- Признак отправки документа на принтер без отображения его на экране
	//  Документ 	  						- ТабличныйДокумент	- Макет печатной формы
	//
	// Возвращаемое значение:
	//   ТабличныйДокумент	- Сформированная печатная форма
	//
	Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
		Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
	КонецФункции // Печать()
	
	// Возвращает доступные варианты печати документа
	// Возвращаемое значение: 
	//  Структура, каждая строка которой
	//  соответствует одному из вариантов печати
	//  Первый элемент структуры - форма по умолчанию
	Функция ПолучитьСписокПечатныхФорм() Экспорт
		СтруктураМакетов=Новый Структура();
		//СтруктураМакетов.Вставить("ПеремещениеТоваров", "Перемещение товаров");
		СтруктураМакетов.Вставить("ТОРГ13", "ТОРГ-13 (накладная на внутреннее перемещение)");
		СтруктураМакетов.Вставить("Т1", "1-Т (Товарно-транспортная накладная)");
		СтруктураМакетов.Вставить("Приложение4", "Приложение №4 (Транспортная накладная)");
		СтруктураМакетов.Вставить("ЭтикетокИЦенников","Печать этикеток и ценников");
		СтруктураМакетов.Вставить("М11","М-11 (требование-накладная)");
		Возврат СтруктураМакетов;
	КонецФункции // ПолучитьСписокПечатныхФорм()
	
	//Формирует отчет "Распределение по заказам покупателей
	Процедура СформироватьОтчетПоРаспределению() Экспорт
		ДокСсылка = ЭтотОбъект.Ссылка;
		Если обЗначениеНеЗаполнено(ДокСсылка) Тогда 
			Сообщить("Для формирования отчета документ должен быть записан!", СтатусСообщения.Информация);
			Возврат;
		КонецЕсли;
		
		Отчет = Отчеты.РаспределениеПоЗаказамПокупателей.Создать();
		Отчет.ЗаполнитьНачальныеНастройки();
		
		МетаданныеОтчета  = Отчет.Метаданные();
		//ВариантОтчета     = ХранилищаНастроек.ХранилищеВариантовОтчетов.ПолучитьВариантОтчета(МетаданныеОтчета.ПолноеИмя(), "Основной");
		//НастройкиВарианта = ВариантОтчета.Настройки.Получить();
		ВариантОтчета     = Отчет.СхемаКомпоновкиДанных.ВариантыНастроек.Основной;
		НастройкиВарианта = ВариантОтчета.Настройки;
		
		НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала",    НачалоДня(ДокСсылка.Дата));
		НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", КонецДня(ДокСсылка.Дата));
		НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("Документ",      ДокСсылка);
		
		ИмяФормыОтчета = МетаданныеОтчета.ПолноеИмя() + ".Форма";
		
		СтруктураПараметров = Новый Структура();
		СтруктураПараметров.Вставить("Вариант",                 НастройкиВарианта);
		СтруктураПараметров.Вставить("ЗаполнитьНастроки",       Ложь);
		СтруктураПараметров.Вставить("КлючВарианта",            ВариантОтчета.Имя);
		СтруктураПараметров.Вставить("ПредставлениеВарианта",   ВариантОтчета.Представление);
		СтруктураПараметров.Вставить("СформироватьПриОткрытии", Истина);
		СтруктураПараметров.Вставить("ВариантЗагрузкиПериода",  "ВариантСтандартногоПериода.ПроизвольныйПериод");
		
		ОткрытьФорму(ИмяФормыОтчета, СтруктураПараметров);
		
	КонецПроцедуры
	
#КонецЕсли
// Если Клиент Тогда - завершена клиентская часть


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Процедура - обработчик ввода на основании
Процедура ОбработкаЗаполнения(Основание) Экспорт
	Перем ВремХран;
	ОбработкаЗаполненияОтказ = НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание);
	
	//Бондаренко++ 20200811
	ВизаОтправил = Ложь;
	ВизаПолучил  = Ложь;
	ПолучилСот   = "";
	ОтпустилСот  = "";
	Перевозчик   = "";
	//Бондаренко-- 20200811
 	
	Если ЗначениеЗаполнено(ПодразделениеКомпании) Тогда
		// контроль заказов по подразделению
		Если обПолучитьПраваИНастройкиПользователя(ПодразделениеКомпании,"ЗакрытиеЗаказовПоПодразделению",ЭтотОбъект) Тогда
			ЗакрытиеЗаказовПоПодразделению=Перечисления.ВариантыОтветов.Да;
		Иначе
			ЗакрытиеЗаказовПоПодразделению=Перечисления.ВариантыОтветов.Нет;
		КонецЕсли; 
		// контроль заказов по организации
		СпособКонтроляКорректностиДоговораИСклада = обПолучитьПраваИНастройкиПользователя(ПодразделениеКомпании, "КонтрольКорректностиДоговораИСкладаДокумента", ЭтотОбъект);
		//Гэндальф+++
		//ЗакрытиеЗаказовПоОрганизации = (НЕ СпособКонтроляКорректностиДоговораИСклада = Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольОтсутствует);
		ЗакрытиеЗаказовПоОрганизации = Ложь;
		//Гэндальф---
	КонецЕсли;
	
	Если ОбработкаЗаполненияОтказ Тогда Возврат; КонецЕсли;
	
	Если НЕ Основание = Неопределено Тогда
		Если (Основание.ХозОперация = Справочники.ХозОперации.ПриходныйСкладскойОрдер)
			ИЛИ (Основание.ХозОперация = Справочники.ХозОперации.РасходныйСкладскойОрдер) Тогда
			ПодразделениеОтправитель = Неопределено;
			ПодразделениеПолучатель = Неопределено;
			Если ТипЗнч(Основание.СкладКомпании)=Тип("СправочникСсылка.СкладыКомпании") И Основание.СкладКомпании.Розничный Тогда
				Если Основание.ХозОперация = Справочники.ХозОперации.ПриходныйСкладскойОрдер Тогда
					ПодразделениеПолучатель = Основание.СкладКомпании;
				Иначе
					ПодразделениеОтправитель = Основание.СкладКомпании;
				КонецЕсли;
			Иначе
				ХозОперация = Справочники.ХозОперации.ПеремещениеТоваров;
				Если Основание.ХозОперация = Справочники.ХозОперации.ПриходныйСкладскойОрдер Тогда
					ПодразделениеПолучатель = Основание.СкладКомпании;
				Иначе
					ПодразделениеОтправитель = Основание.СкладКомпании;
				КонецЕсли;
			КонецЕсли;
			Если обЗначениеНеЗаполнено(Дата) Тогда
				Дата = ТекущаяДата();
			КонецЕсли;
			Для Каждого СтрТовар Из Товары Цикл
				ОбработкаРеквизита("Товары.Номенклатура", СтрТовар);
			КонецЦикла;
			
			// заполняем ячейки
			Попытка
				Для Каждого стрТовар Из Товары Цикл
					Если стрТовар.Номенклатура = Основание.Товары[стрТовар.НомерСтроки-1].Номенклатура Тогда
						Если Основание.ХозОперация = Справочники.ХозОперации.ПриходныйСкладскойОрдер Тогда
							стрТовар.ЯчейкаПолучатель  = Основание.Товары[стрТовар.НомерСтроки-1].Ячейка;
						Иначе
							стрТовар.ЯчейкаОтправитель = Основание.Товары[стрТовар.НомерСтроки-1].Ячейка;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			Исключение
			КонецПопытки;
			
		ИначеЕсли ТипЗнч(Основание)=Тип("ДокументСсылка.ПоступлениеТоваров") ИЛИ
			ТипЗнч(Основание)=Тип("ДокументСсылка.АвансовыйОтчет") Тогда
			Если (НЕ обЗначениеНеЗаполнено(ПодразделениеОтправитель))И(ПодразделениеОтправитель.Розничный)И(ТипЦен <> ПодразделениеОтправитель.ТипЦенРозничнойТорговли) Тогда
				ТипЦен = ПодразделениеОтправитель.ТипЦенРозничнойТорговли;
				ВалютаДокумента = обВалютаТипаЦены(Неопределено,ТипЦен);
				СтруктураКурса = обКурсДляВалюты(ВалютаДокумента,Дата);
				КурсДокумента  = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
				Для Каждого СтрТовар Из Товары Цикл
					СтрТовар.Цена = обПолучитьЦену(ТипЦен,СтрТовар.Номенклатура,?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента, СтрТовар.ХарактеристикаНоменклатуры, СтрТовар.ЕдиницаИзмерения, ПодразделениеКомпании);
					ОбработкаРеквизита("Товары.Цена",СтрТовар);
				КонецЦикла;
			КонецЕсли;
			
			// заполняем ячейки
			Попытка
				Для Каждого стрТовар Из Товары Цикл
					Если стрТовар.Номенклатура = Основание.Товары[стрТовар.НомерСтроки-1].Номенклатура Тогда
						стрТовар.ЯчейкаОтправитель = Основание.Товары[стрТовар.НомерСтроки-1].Ячейка;
					КонецЕсли;
				КонецЦикла;
			Исключение
			КонецПопытки;
			
		ИначеЕсли ТипЗнч(Основание)=Тип("ДокументСсылка.ЗаказВнутренний") Тогда
			ЗаполнитьРезервамиПодразделения(Основание);
			
		ИначеЕсли ТипЗнч(Основание)=Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			Если обЗначениеНеЗаполнено(ПодразделениеОтправитель) Тогда
				ПодразделениеОтправитель=обПраво("ОсновнойСкладКомпании",Права,,ЭтотОбъект);
			КонецЕсли;
			ЗаполнитьРезервамиПодЗаказ(Основание);
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
			// заполняем ячейки
			Попытка
				Для Каждого стрТовар Из Товары Цикл
					Если стрТовар.Номенклатура = Основание.Товары[стрТовар.НомерСтроки-1].Номенклатура Тогда
						стрТовар.ЯчейкаОтправитель = Основание.Товары[стрТовар.НомерСтроки-1].Ячейка;
					КонецЕсли;
				КонецЦикла;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		// пересчитаем строки
		Для Каждого СтрТовар Из Товары Цикл
			Если СтрТовар.Количество=0 Тогда СтрТовар.Количество=1; КонецЕсли;
			ОбработкаРеквизита("Товары.Количество", СтрТовар);
		КонецЦикла;
		
		// если ввели на основании перемещения, то поменяем склады местами
		Если ТипЗнч(Основание)=Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			ПодразделениеОтправитель=Основание.СкладПолучатель;
			ПодразделениеПолучатель=Основание.СкладКомпании;
			
			Для Каждого стрТовары Из Товары Цикл
				ВремХран = стрТовары.ЯчейкаОтправитель;
				стрТовары.ЯчейкаОтправитель = стрТовары.ЯчейкаПолучатель;
				стрТовары.ЯчейкаПолучатель  = ВремХран;
			КонецЦикла;
		КонецЕсли;
		
		// если вводим на основании пересортицы, то ...
		Если ТипЗнч(Основание)=Тип("ДокументСсылка.ПересортицаТоваров") Тогда
			Товары.Очистить();
			Для Каждого СтрокаТЧ Из Основание.Товары Цикл
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Номенклатура = СтрокаТЧ.Номенклатура;
				НоваяСтрока.ХарактеристикаНоменклатуры = СтрокаТЧ.ХарактеристикаНоменклатуры;
				ОбработкаРеквизита("Товары.Номенклатура",НоваяСтрока);
				НоваяСтрока.КоличествоБазовое = СтрокаТЧ.Количество;
				ОбработкаРеквизита("Товары.КоличествоБазовое",НоваяСтрока);
				НоваяСтрока.ЦенаРозничная = СтрокаТЧ.ЦенаРозничная;
				ОбработкаРеквизита("Товары.ЦенаРозничная",НоваяСтрока);
			КонецЦикла;
			Товары.Свернуть("Номенклатура,ЕдиницаИзмерения,Коэффициент,ЦенаРозничная,ХарактеристикаНоменклатуры,Цена,СтавкаНДС","Количество,КоличествоБазовое,СуммаРозничная,Сумма,СуммаВсего,СуммаНДС");
		КонецЕсли;
	КонецЕсли;
	
	// Есть ли возможность укзания партии и ГТД
	ВыборочноеСписаниеПартий=обПраво("ВыборочноеСписаниеПартий",Права,,ЭтотОбъект);
	СтратегияСписанияПартийТоваровПоДатам=Константы.СтратегияСписанияПартийТоваровПоДатам.Получить();	
	Если НЕ ВыборочноеСписаниеПартий Тогда
		Для Каждого СтрокаТовар Из Товары Цикл
			СтрокаТовар.Партия=Неопределено;
			СтрокаТовар.ГТД=Неопределено;
		КонецЦикла;
		Товары.Свернуть("Номенклатура,ЕдиницаИзмерения,Коэффициент,ХарактеристикаНоменклатуры,СтавкаНДС,ЗаказПокупателя,ЯчейкаОтправитель,ЯчейкаПолучатель,СпособРаспределения","Количество,КоличествоБазовое,СуммаРозничная,Сумма,СуммаВсего,СуммаНДС");
		Для Каждого СтрокаТовар Из Товары Цикл
			СуммаНДС=СтрокаТовар.СуммаНДС;
			СуммаРозничная=СтрокаТовар.СуммаРозничная;
			ОбработкаРеквизита("Товары.СуммаВсего",СтрокаТовар);
			СтрокаТовар.СуммаРозничная=СуммаРозничная;
			ОбработкаРеквизита("Товары.СуммаРозничная",СтрокаТовар);
			СтрокаТовар.СуммаНДС=СуммаНДС;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
 	ЭтотОбъект.НомерПеремещения="";
	ЭтотОбъект.ДатаПеремещения=Дата(1,1,1);
	ЭтотОбъект.ДЦ_Перемещения=Справочники.ДилерскиеЦентры.ПустаяСсылка();
	ЭтотОбъект.БазаПеремещения=Перечисления.ИнформационныеБазы.ПустаяСсылка();
 	//Бондаренко++ 20200811
	ЭтотОбъект.ВизаОтправил = Ложь;
	ЭтотОбъект.ВизаПолучил  = Ложь;
	ЭтотОбъект.ПолучилСот   = "";
	ЭтотОбъект.ОтпустилСот  = "";
	ЭтотОбъект.Перевозчик   = "";
	//Бондаренко-- 20200811
КонецПроцедуры // ПриКопировании()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//Корельский 1082{
	Если Проведен И НЕ обПраво("РедактированиеПроведенныхДокументов",ЭтотОбъект.Права,,ЭтотОбъект) ТОгда
		Если ХозОперация <> Справочники.ХозОперации.ПеремещениеТоваровМеждуДЦ ИЛИ Ссылка.ВизаПолучил Тогда	
			Сообщить("Нет права на редактирование проведенных документов", СтатусСообщения.Важное);
			Отказ = истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения И НЕ обПраво("РедактированиеПроведенныхДокументов",ЭтотОбъект.Права,,ЭтотОбъект) Тогда
		Отказ = истина;
		Сообщить("Нет прав на отмену проведения документа");
		Возврат;
	КонецЕсли;
	//}
	
	//Бондаренко 20160628 #10147 ++
	Если Дата > Дата(2016,6,27) Тогда
		Если ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровМеждуДЦ Тогда
			Отказ = истина;
			Сообщить("Нет прав на хозоперацию "+Справочники.ХозОперации.ПеремещениеТоваровМеждуДЦ);
			Возврат;
		КонецЕсли; 
	КонецЕсли;	
	//Бондаренко 20160628 #10147 --
	
	
	// Почистим распределения товаров по заказам
	СтрокиУдаления = Новый Массив;
	СтруктураОтбора = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры");
	Для Каждого СтрокаРаспределения Из РаспределениеТовара Цикл
		СтруктураОтбора.Номенклатура               = СтрокаРаспределения.Номенклатура;
		СтруктураОтбора.ХарактеристикаНоменклатуры = СтрокаРаспределения.ХарактеристикаНоменклатуры;
		НайденныеСтроки = Товары.НайтиСтроки(СтруктураОтбора);
		УдалитьРаспределение = Истина;
		Для Каждого ТекСтрока Из НайденныеСтроки Цикл
			Если ТекСтрока.СпособРаспределения = 2 И (НЕ ЗначениеЗаполнено(СтрокаРаспределения.ЗаказПокупателя)) Тогда
				Продолжить;
			ИначеЕсли ТекСтрока.СпособРаспределения>0 Тогда
				УдалитьРаспределение = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если УдалитьРаспределение Тогда 
			СтрокиУдаления.Добавить(СтрокаРаспределения);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекСтрока Из СтрокиУдаления Цикл
		РаспределениеТовара.Удалить(ТекСтрока);
	КонецЦикла;
	
	Результат = Истина;
	ДополнительныеСвойства.Вставить("СкладКомпанииБыл");
	ДополнительныеСвойства.Вставить("ЗаказБыл");
	ДополнительныеСвойства.Вставить("МоментВремениБыл");
	
	Если НЕ ФлагПерерасчет Тогда
		// Обнулим не используемые колонки.   
		Если ТипЗнч(ПодразделениеПолучатель) = Тип("СправочникСсылка.СкладыКомпании") Тогда
			СкладПолучательРозничный = ПодразделениеПолучатель.Розничный;
		Иначе	
			СкладПолучательРозничный = Ложь;
		КонецЕсли; 
		НеобходимоОбнулить = (обЗначениеНеЗаполнено(ПодразделениеПолучатель) ИЛИ НЕ СкладПолучательРозничный) И (ХозОперация<>Справочники.ХозОперации.ПеремещениеТоваровВФилиал);
		Если НеобходимоОбнулить Тогда
			Для Каждого ТекСтрокаТЧ Из Товары Цикл  	
				ТекСтрокаТЧ.ЦенаРозничная  = 0;
				ТекСтрокаТЧ.СуммаРозничная = 0;
				ТекСтрокаТЧ.ПроцентНаценки = 0;
			КонецЦикла;	
		КонецЕсли;
		Результат = дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	КонецЕсли;
	ФлагПерерасчет = Ложь;
	Если НЕ Результат Тогда
		дкУстановитьЗначениеДополнительногоСвойства(ЭтотОбъект,Отказ);
		Возврат;
	КонецЕсли; 
	
	Если НЕ Отказ И Проведен И РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		
		БылиДвижения = Ложь;
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		// партии
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ СкладКомпании ИЗ РегистрНакопления.ПартииТоваровКомпании ГДЕ Регистратор=&Ссылка";
		Выборка = Запрос.Выполнить();
		Если НЕ Выборка.Пустой() Тогда
			БылиДвижения = Истина;
			ДополнительныеСвойства.Вставить("СкладКомпанииБыл", Выборка.Выгрузить().ВыгрузитьКолонку("СкладКомпании"));
		КонецЕсли;
		
		// Заказы
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Заказы.Заказ КАК Заказ
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗаказыПокупателей.Заказ КАК Заказ
		|	ИЗ
		|		РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателей
		|	ГДЕ
		|		ЗаказыПокупателей.Регистратор = &Ссылка
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		ЗаказыРаспределение.ЗаказПокупателя
		|	ИЗ
		|		РегистрНакопления.ЗаказыРаспределение КАК ЗаказыРаспределение
		|	ГДЕ
		|		ЗаказыРаспределение.Регистратор = &Ссылка
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		ЗаказыРаспределение.ЗаказПоставщика
		|	ИЗ
		|		РегистрНакопления.ЗаказыРаспределение КАК ЗаказыРаспределение
		|	ГДЕ
		|		ЗаказыРаспределение.Регистратор = &Ссылка) КАК Заказы";
		Выборка = Запрос.Выполнить();
		Если НЕ Выборка.Пустой() Тогда
			БылиДвижения = Истина;
			ДополнительныеСвойства.Вставить("ЗаказБыл", Выборка.Выгрузить().ВыгрузитьКолонку("Заказ"));
		КонецЕсли;
		
		// прошлый момент времени
		Если БылиДвижения Тогда
			Запрос.Текст = "ВЫБРАТЬ МоментВремени ИЗ Документ."+Метаданные().Имя+" ГДЕ Ссылка=&Ссылка";
			ДополнительныеСвойства.Вставить("МоментВремениБыл",Запрос.Выполнить().Выгрузить().Получить(0).МоментВремени);
		КонецЕсли;
		
	КонецЕсли;
	
	//Гэндальф+++
	#Если Клиент Тогда
		//Бондаренко++ 20190426	
		//Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если ((РежимЗаписи = РежимЗаписиДокумента.Проведение) Или (РежимЗаписи = РежимЗаписиДокумента.Запись И Проведен)) Тогда
			//Бондаренко-- 20190426		
			
			Если  (ПодразделениеОтправитель.ДилерскийЦентр <> ПодразделениеПолучатель.ДилерскийЦентр) Тогда
				
				Для каждого Стр Из Товары Цикл
					
					ТекСкладОтправитель  = Стр.СкладыКомпании;
					ТекСкладПолучатель = Стр.СкладыПолучатели;
					
					Если ТекСкладОтправитель.ТипСклада <> Перечисления.ТипыСкладов.Экспедитор И ТекСкладПолучатель.ТипСклада <> Перечисления.ТипыСкладов.Экспедитор Тогда
					  Отказ = Истина;
					  Сообщить("ОШИБКА! При перемещении между Дилерскими Центрами один из складов должен быть экспедитором. Строка "+Стр.НомерСтроки);
					  Возврат;
					КонецЕсли;
					
					Если НЕ РольДоступна("ПолныеПрава")   Тогда
					ТекущееПодразделениеПользователя = ?(обПраво("ПодразделениеДляПросмотраИОтбора",Права,,ЭтотОбъект)=Справочники.ПодразделенияКомпании.ПустаяСсылка(), ПараметрыСеанса.ПодразделениеКомпании,обПраво("ПодразделениеДляПросмотраИОтбора",Права,,));
				//Этот кусок переписал в связи с тем, что не проверялся склад-получатель. Написал дополнительные сообщения об ошибках для пользователя с полными правами
						БылиОшибкиСкладов = Ложь;
						Если ТекущееПодразделениеПользователя <> ПодразделениеКомпании.Родитель Тогда
							Если РольДоступна("ПолныеПрава") Тогда
								Сообщить("Текущее подразделение пользователя: "+ТекущееПодразделениеПользователя+" <> "+" ПодразделениеКомпании.Родитель: "+ПодразделениеКомпании.Родитель);
							КонецЕсли; 
							БылиОшибкиСкладов = Истина;
						КонецЕсли;	
						Если ТекСкладОтправитель.Подразделение.Родитель <> ПодразделениеКомпании.Родитель Тогда
							Если ПодразделениеОтправитель.ТипСклада <> Перечисления.ТипыСкладов.Экспедитор Тогда
								Если РольДоступна("ПолныеПрава") Тогда
									Сообщить("ТекСкладОтправитель.Подразделение.Родитель: "+ТекСкладОтправитель.Подразделение.Родитель+" <> "+" ПодразделениеКомпании.Родитель: "+ПодразделениеКомпании.Родитель+". Строка "+Стр.НомерСтроки);
								КонецЕсли; 
								БылиОшибкиСкладов = Истина;
							КонецЕсли; 
						КонецЕсли;	
						Если  ТекСкладПолучатель.Подразделение.Родитель <> ПодразделениеКомпании.Родитель Тогда
							Если ПодразделениеПолучатель.ТипСклада <> Перечисления.ТипыСкладов.Экспедитор Тогда
								Если РольДоступна("ПолныеПрава") Тогда
									Сообщить("ТекСкладПолучатель.Подразделение.Родитель: "+ТекСкладПолучатель.Подразделение.Родитель+" <> "+" ПодразделениеКомпании.Родитель: "+ПодразделениеКомпании.Родитель);
								КонецЕсли;		
								БылиОшибкиСкладов = Истина;
							КонецЕсли;		
						КонецЕсли;	
						Если БылиОшибкиСкладов Тогда
							Сообщить("ОШИБКА! Нельзя проводить перемещения других ДЦ.");
							Отказ = Истина;
						КонецЕсли; 
				КонецЕсли;  
 				КонецЦикла; 
			КонецЕсли;
			
			//Корельский 1082{
			Если ХозОперация <> Справочники.ХозОперации.ПеремещениеТоваровМеждуДЦ Тогда
				Если ОтпустилСот = Справочники.Сотрудники.ПустаяСсылка() тогда
					Сообщить("Не заполнено поле Отпустил");
					Отказ = Истина;
				КонецЕсли;	
				Если ПолучилСот = Справочники.Сотрудники.ПустаяСсылка() тогда
					Сообщить("Не заполнено поле Получил");
					Отказ = Истина;
				КонецЕсли;	
				Если Перевозчик = Справочники.Сотрудники.ПустаяСсылка() тогда
					Сообщить("Не заполнено поле Перевозчик");
					Отказ = Истина;
				КонецЕсли;
			Иначе
				Если Перевозчик = Справочники.Сотрудники.ПустаяСсылка() тогда
					Сообщить("Не заполнено поле Перевозчик");
					Отказ = Истина;
				КонецЕсли;
				
				Если ОтпустилСот = Справочники.Сотрудники.ПустаяСсылка() И ВизаОтправил тогда
					Сообщить("Не заполнено поле Отпустил");
					Отказ = Истина;
				КонецЕсли;
				
				Если ПолучилСот = Справочники.Сотрудники.ПустаяСсылка() И ВизаПолучил тогда
					Сообщить("Не заполнено поле Получил");
					Отказ = Истина;
				КонецЕсли;	
			КонецЕсли;			
		КонецЕсли;	
	#КонецЕсли
	//}
	//Гэндальф---
	
	
	//Корельский 1082{
	Если Отказ Тогда Возврат;КонецЕсли;
	//Если ХозОперация = Справочники.ХозОперации.ПеремещениеТоваров Тогда
	//	Если СкладКомпании.Подразделение.ДилерскийЦентр <> СкладПолучатель.Подразделение.ДилерскийЦентр Тогда
	//		Сообщить("Для перемещения между складами разных дилерских центров используйте другой вид перемещения");
	//		ОТказ = истина;
	//	КонецЕсли;
	//ИначеЕсли ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровМеждуДЦ Тогда
	//	Если СкладКомпании.Подразделение.ДилерскийЦентр = СкладПолучатель.Подразделение.ДилерскийЦентр Тогда
	//		Сообщить("Для перемещения мужду складами одного дилерского цен используйте другой вид перемещения");
	//		ОТказ = истина;
	//	КонецЕсли;
	//КонецЕсли;
	//}
	
	// +++++ Соколмоторс +++++
	Если ЭтоНовый() И НЕ Отказ Тогда
		НомерДляЖурнала = РегистрыСведений.НумерацияСкладскихДокументов.УстановитьНовыйНомер(ТекущаяДата());
	КонецЕсли;
	// ----- Соколмоторс -----
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриЗаписи()

Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()

Процедура ОбработкаУдаленияПроведения(Отказ)
	//Гэндальф++==
	Если НЕ РольДоступна("ПолныеПрава")   ТОгда
		ТекущиеПодразделениеПользователя = ?(обПраво("ПодразделениеДляПросмотраИОтбора",Права,,ЭтотОбъект)=Справочники.ПодразделенияКомпании.ПустаяСсылка(), ПараметрыСеанса.ПодразделениеКомпании,обПраво("ПодразделениеДляПросмотраИОтбора",Права,,));
		Если ТекущиеПодразделениеПользователя <> ПодразделениеКомпании.Родитель  или ПодразделениеОтправитель.Подразделение.Родитель <> ПодразделениеКомпании.Родитель тогда
			Сообщить("Нельзя отменять перемещения другого ДЦ.");
			Отказ = Истина;
		КонецЕсли;	
		
		
	КонецЕсли;
	
	//Гэндальф---
	
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	Если НЕ Отказ Тогда
		тКэшСуммСписания = Неопределено;
		СуммаДокумента = 0;
	КонецЕсли;	
КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ОбработкаПроведенияСтарая(Отказ, Режим)
	
 	Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда
		Возврат;
	КонецЕсли;
	
	//Корельский 1082{
	Если ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровОптНаЭкспедитора И НЕ ВизаОтправил Тогда
		Сообщить("Проведение этого типа перемещения без визы отправителя невозможно!", СтатусСообщения.Важное);
		Отказ = истина;
		Возврат;
	КОнецЕсли;
	//} 
	
	// проверим, а не равны ли подразделения
	Если ПодразделениеПолучатель = ПодразделениеОтправитель Тогда 
		Сообщить("Подразделение-отправитель равно подразделению-получателю ! Перемещение невозможно !"); Отказ=Истина;
		Возврат;
	КонецЕсли;
	
	ТаблицаСписанияСоСкладаОтправителя=Неопределено;
	ЭтоПодразделениеПолучатель = (ТипЗнч(ПодразделениеПолучатель)<>Тип("СправочникСсылка.СкладыКомпании"));
	
	//Корельский 1082{
	ЭтоПеремещениеМеждуДЦ = (ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровОптНаЭкспедитора);
	ЭтоПолучениеТовара = ЭтоПеремещениеМеждуДЦ И ВизаПолучил;
	//}	
	
	// если перемещение из филиала, то ничего с филиала не снимаем
	Если ХозОперация=Справочники.ХозОперации.ПеремещениеТоваровОптНаЭкспедитора Тогда
		//Закрытие внутреннего заказа
		РезультатЗапросаПоТоварам = Неопределено;
		//Закрываем внутренние заказы по FIFO
		Если ЭтоПолучениеТовара Тогда
			ТекстЗапроса = "ВЫБРАТЬ
			               |	ДокументТовары.Номенклатура КАК Номенклатура,
			               |	ДокументТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			               |	МАКСИМУМ(ДокументТовары.ЦенаРозничная) КАК ЦенаРозничная,
			               |	СУММА(ДокументТовары.КоличествоПолучено * ДокументТовары.Коэффициент) КАК Количество,
			               |	СУММА(ДокументТовары.Количество * ДокументТовары.Коэффициент) КАК КоличествоКСписанию,
			               |	СУММА(0) КАК Резерв,
			               |	СУММА(ДокументТовары.СуммаРозничная) КАК Сумма
			               |ИЗ
			               |	Документ.ПеремещениеТоваровОпт.Товары КАК ДокументТовары
			               |ГДЕ
			               |	ДокументТовары.Ссылка = &Ссылка
			               |	И ДокументТовары.ЗаказПокупателя В (ЗНАЧЕНИЕ(Документ.ЗаказВнутренний.ПустаяСсылка), ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка), НЕОПРЕДЕЛЕНО)
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ДокументТовары.Номенклатура,
			               |	ДокументТовары.ХарактеристикаНоменклатуры";
		Иначе
			ТекстЗапроса = "ВЫБРАТЬ
			               |	ДокументТовары.Номенклатура КАК Номенклатура,
			               |	СУММА(ДокументТовары.Количество * ДокументТовары.Коэффициент) КАК Количество,
			               |	СУММА(ДокументТовары.Количество * ДокументТовары.Коэффициент) КАК КоличествоКСписанию,
			               |	СУММА(ДокументТовары.Количество * ДокументТовары.Коэффициент) КАК Резерв,
			               |	ДокументТовары.ЗаказПокупателя КАК ЗаказПокупателя,
			               |	ДокументТовары.СкладыКомпании
			               |ИЗ
			               |	Документ.ПеремещениеТоваровОпт.Товары КАК ДокументТовары
			               |ГДЕ
			               |	ДокументТовары.Ссылка = &Ссылка
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ДокументТовары.Номенклатура,
			               |	ДокументТовары.ЗаказПокупателя,
			               |	ДокументТовары.СкладыКомпании";
		КонецЕсли; 
 		Запрос=Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		//Закрываем заказы
		НаборЗаписейЗаказыПокупателей = Движения.ЗаказыПокупателей;
		НаборЗаписейЗаказыПокупателей.РежимПроведения = Режим;
		НаборЗаписейЗаказыПокупателей.ДокументОбъект = ЭтотОбъект;
		НаборЗаписейЗаказыПокупателей.РезультатЗапросаПоТоварам = Запрос.Выполнить();
		НаборЗаписейЗаказыПокупателей.Контрагент = ПодразделениеПолучатель;
		НаборЗаписейЗаказыПокупателей.Заказ = "";
		НаборЗаписейЗаказыПокупателей.СкладКомпании = ПодразделениеОтправитель;
		НаборЗаписейЗаказыПокупателей.Заказывать = Истина;
		НаборЗаписейЗаказыПокупателей.Резервировать = Истина;
		НаборЗаписейЗаказыПокупателей.ПоБазовомуКоличеству=Истина;
		Отказ=НЕ НаборЗаписейЗаказыПокупателей.ЗакрытиеЗаказовПокупателя() ИЛИ Отказ;
		
		Если НЕ Отказ Тогда
			НаборЗаписейЗаказыПокупателей.Записать();
		КонецЕсли;
		
	//	//Если было списание резервов то таблица товаров содержит списанные резервы
	//	РезультатЗапросаПоТоварам=НаборЗаписейЗаказыПокупателей.РезультатЗапросаПоТоварам;
	//	
	//	//Снимаем распределение заказа покупателя
	//	НаборЗаписейРаспределениеЗаказов = Движения.ЗаказыРаспределение;
	//	НаборЗаписейРаспределениеЗаказов.РежимПроведения = Режим;
	//	НаборЗаписейРаспределениеЗаказов.ДокументОбъект = ЭтотОбъект;
	//	НаборЗаписейРаспределениеЗаказов.РезультатЗапросаПоТоварам = РезультатЗапросаПоТоварам;
	//	НаборЗаписейРаспределениеЗаказов.ЗаказПокупателя = Неопределено;
	//	НаборЗаписейРаспределениеЗаказов.ЗаказПоставщика = Неопределено;
	//	НаборЗаписейРаспределениеЗаказов.ПоБазовомуКоличеству=Истина;
	//	НаборЗаписейРаспределениеЗаказов.Контрагент = ?(ЭтоПодразделениеПолучатель,ПодразделениеПолучатель,ПодразделениеПолучатель.Подразделение);
	//	
	//	Отказ=НЕ НаборЗаписейРаспределениеЗаказов.ЗакрытиеЗаказовПокупателя() ИЛИ Отказ;
	//	
	//	//Корельский 1082{
	//	Если ЭтоПеремещениеМуждуДЦ Тогда
	//		//В результате запроса нужно подменить Количество на КоличествоКСписнаию (т.к. фактически прийти может меньше)
	//		РезультатЗапросаПоТоварам.Колонки.Удалить("Количество");
	//		РезультатЗапросаПоТоварам.Колонки.КоличествоКСписанию.Имя = "Количество";
	//	КОнецЕсли;
	//	//}
	//	
	//	// 1. Спишем товар со склада отправителя
	//	НаборЗаписейОстатки=Движения.ОстаткиТоваровКомпании;
	//	НаборЗаписейОстатки.РежимПроведения=Режим;
	//	НаборЗаписейОстатки.ДокументОбъект=ЭтотОбъект;
	//	НаборЗаписейОстатки.РезультатЗапросаПоТоварам=РезультатЗапросаПоТоварам;
	//	НаборЗаписейОстатки.СкладКомпании=ПодразделениеОтправитель;
	//	НаборЗаписейОстатки.Приходовать=Истина;
	//	НаборЗаписейОстатки.ПоБазовомуКоличеству=Истина;
	//	НаборЗаписейОстатки.ДвиженияПоРознице=ПодразделениеОтправитель.Розничный;
	//	НаборЗаписейОстатки.Резервировать=РезультатЗапросаПоТоварам<>Неопределено;
	//	Отказ=НЕ НаборЗаписейОстатки.Расход() ИЛИ Отказ;
	//	Если Отказ Тогда
	//		// выведем сообщения об ошибках и предупреждениях
	//		дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
	//		Возврат; // дальше смысла не имеет
	//	КонецЕсли;
	//	ТаблицаСписанияСоСкладаОтправителя = НаборЗаписейОстатки.Выгрузить();
	//	
	//	//ТаблицаСписанияСоСкладаОтправителя.Сортировать("Номенклатура, ХарактеристикаНоменклатуры УБЫВ");
	//	ТаблицаСписанияСоСкладаОтправителя.ЗаполнитьЗначения(0, "Резерв");
	//	ТаблицаСписанияСоСкладаОтправителя.Колонки.Добавить("ЦенаРозничная", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	//	ТаблицаСписанияСоСкладаОтправителя.Колонки.Добавить("СпособРаспределения", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(1, 0)));
	//	ПустаяХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	//	СтруктураОтбора = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры");
	//	Для Каждого СтрокаСписания Из ТаблицаСписанияСоСкладаОтправителя Цикл
	//		СтруктураОтбора.Номенклатура               = СтрокаСписания.Номенклатура;
	//		СтруктураОтбора.ХарактеристикаНоменклатуры = СтрокаСписания.ХарактеристикаНоменклатуры;
	//		СтрокиТаблицыТовары = Товары.НайтиСтроки(СтруктураОтбора);
	//		Если СтрокиТаблицыТовары.Количество() = 0 И (НЕ СтрокаСписания.ХарактеристикаНоменклатуры = ПустаяХарактеристика) Тогда
	//			СтруктураОтбора.ХарактеристикаНоменклатуры = ПустаяХарактеристика;
	//			СтрокиТаблицыТовары = Товары.НайтиСтроки(СтруктураОтбора);
	//			СпособРаспределения = 0;
	//			Для Каждого СтрокаТовары Из СтрокиТаблицыТовары Цикл
	//				СпособРаспределения = Макс(СпособРаспределения, СтрокаТовары.СпособРаспределения);
	//			КонецЦикла;
	//			СтрокаСписания.ЦенаРозничная       = СтрокиТаблицыТовары[0].ЦенаРозничная;
	//			СтрокаСписания.СпособРаспределения = СпособРаспределения;
	//		Иначе
	//			СпособРаспределения = 0;
	//			Для Каждого СтрокаТовары Из СтрокиТаблицыТовары Цикл
	//				СпособРаспределения = Макс(СпособРаспределения, СтрокаТовары.СпособРаспределения);
	//			КонецЦикла;
	//			СтрокаСписания.ЦенаРозничная       = СтрокиТаблицыТовары[0].ЦенаРозничная;
	//			СтрокаСписания.СпособРаспределения = СпособРаспределения;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	//
	//// если перемещение в филиал, то ничего в этот филиал не приходуем
	//Если ХозОперация<>Справочники.ХозОперации.ПеремещениеТоваровВФилиал И (НЕ ЭтоПеремещениеМуждуДЦ ИЛИ ЭтоПолучениеТовара) Тогда
	//	// Закрытие распределений внутренних заказов
	//	Если ТаблицаСписанияСоСкладаОтправителя = Неопределено ИЛИ ЭтоПолучениеТовара Тогда
	//		ТекстЗапроса = "ВЫБРАТЬ
	//		|	ДокументТовары.Номенклатура КАК Номенклатура,
	//		|	ДокументТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//		|	МАКСИМУМ(ДокументТовары.СпособРаспределения) КАК СпособРаспределения,
	//		|	МАКСИМУМ(ДокументТовары.ЦенаРозничная) КАК ЦенаРозничная,
	//		|	СУММА(ДокументТовары.Количество"+?(ЭтоПолучениеТовара,"Получено", "")+" * ДокументТовары.Коэффициент) КАК Количество,
	//		|	СУММА(0) КАК Резерв,
	//		|	СУММА(ДокументТовары.СуммаРозничная) КАК Сумма
	//		|ИЗ
	//		|	Документ.ПеремещениеТоваров.Товары КАК ДокументТовары
	//		|ГДЕ
	//		|	ДокументТовары.Ссылка = &Ссылка
	//		|	И ДокументТовары.ЗаказПокупателя В (ЗНАЧЕНИЕ(Документ.ЗаказВнутренний.ПустаяСсылка), ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка), НЕОПРЕДЕЛЕНО)
	//		|
	//		|СГРУППИРОВАТЬ ПО
	//		|	ДокументТовары.Номенклатура,
	//		|	ДокументТовары.ХарактеристикаНоменклатуры";
	//		Запрос=Новый Запрос(ТекстЗапроса);
	//		Запрос.УстановитьПараметр("Ссылка",Ссылка);
	//		ТаблицаСписанияСоСкладаОтправителя = Запрос.Выполнить();
	//	КонецЕсли;
	//	
	//	НаборЗаписейРаспределения=Движения.ЗаказыРаспределение;
	//	НаборЗаписейРаспределения.РежимПроведения=Режим;
	//	НаборЗаписейРаспределения.ДокументОбъект=ЭтотОбъект;
	//	НаборЗаписейРаспределения.РезультатЗапросаПоТоварам=ТаблицаСписанияСоСкладаОтправителя;
	//	НаборЗаписейРаспределения.ЗаказПокупателя=Неопределено;
	//	НаборЗаписейРаспределения.ЗаказПоставщика=Неопределено;
	//	Если ХозОперация = Справочники.ХозОперации.ПеремещениеТоваров Тогда
	//		НаборЗаписейРаспределения.СкладКомпании = ПодразделениеОтправитель;
	//	КонецЕсли;
	//	НаборЗаписейРаспределения.ПоБазовомуКоличеству=Истина;
	//	НаборЗаписейРаспределения.ДвиженияПоРознице=Истина;
	//	НаборЗаписейРаспределения.Контрагент=?(ЭтоПодразделениеПолучатель,ПодразделениеПолучатель,ПодразделениеПолучатель.Подразделение);
	//	Отказ=НЕ НаборЗаписейРаспределения.ЗакрытиеРаспределенийЗаказовПоставщику() ИЛИ Отказ;
	//	
	//	// 2. оприходуем на склад получатель
	//	НаборЗаписейОстатки=Движения.ОстаткиТоваровКомпании;
	//	НаборЗаписейОстатки.РежимПроведения=Режим;
	//	НаборЗаписейОстатки.ДокументОбъект=ЭтотОбъект;
	//	НаборЗаписейОстатки.РезультатЗапросаПоТоварам=НаборЗаписейРаспределения.РезультатЗапросаПоТоварам;
	//	НаборЗаписейОстатки.СкладКомпании=ПодразделениеПолучатель;
	//	НаборЗаписейОстатки.Приходовать=Истина;
	//	НаборЗаписейОстатки.Резервировать=Истина;
	//	НаборЗаписейОстатки.ДвиженияПоРознице=?(ЭтоПодразделениеПолучатель,Ложь,ПодразделениеПолучатель.Розничный);
	//	НаборЗаписейОстатки.ПоБазовомуКоличеству=Истина;
	//	Отказ = НЕ НаборЗаписейОстатки.Приход() ИЛИ Отказ;
	//	
	//	// Резервирование товаров по заказам покупателей
	//	НаборЗаписейЗаказыПокупателей=Движения.ЗаказыПокупателей;
	//	НаборЗаписейЗаказыПокупателей.РежимПроведения=Режим;
	//	НаборЗаписейЗаказыПокупателей.ДокументОбъект=ЭтотОбъект;
	//	НаборЗаписейЗаказыПокупателей.РезультатЗапросаПоТоварам=НаборЗаписейРаспределения.ТаблицаЗакрытияРаспределений;
	//	НаборЗаписейЗаказыПокупателей.Контрагент=Неопределено;
	//	НаборЗаписейЗаказыПокупателей.Заказ=Неопределено;
	//	НаборЗаписейЗаказыПокупателей.СкладКомпании=ПодразделениеПолучатель;
	//	НаборЗаписейЗаказыПокупателей.Заказывать=Ложь;
	//	НаборЗаписейЗаказыПокупателей.Резервировать=Истина;
	//	НаборЗаписейЗаказыПокупателей.ПоБазовомуКоличеству=Истина;
	//	Отказ=НЕ НаборЗаписейЗаказыПокупателей.Приход() ИЛИ Отказ;
	//	
	//	Если НЕ Отказ Тогда
	//		НаборЗаписейЗаказыПокупателей.Записать();
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	//// Блок перемещения по заказам, которые указаны в ТЧ
	//
	//// если перемещение из филиала, то ничего с филиала не снимаем
	//ТаблицаСписанияСоСкладаОтправителя=Неопределено;
	//Если ХозОперация<>Справочники.ХозОперации.ПеремещениеТоваровИзФилиала Тогда
	//	РезультатЗапросаПоТоварам=Неопределено;
	//	//Перемещение заказов, которые указаны в товарных строках
	//	ТекстЗапроса="ВЫБРАТЬ
	//	|	ДокументТовары.Номенклатура КАК Номенклатура,
	//	|	ДокументТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//	|	ДокументТовары.ЗаказПокупателя КАК Заказ,
	//	|	ВЫБОР
	//	|		КОГДА ДокументТовары.ЗаказПокупателя ССЫЛКА Документ.ЗаказВнутренний
	//	|			ТОГДА ДокументТовары.ЗаказПокупателя.ПодразделениеКомпании
	//	|		ИНАЧЕ ДокументТовары.ЗаказПокупателя.Контрагент
	//	|	КОНЕЦ КАК Контрагент,
	//	|	МАКСИМУМ(ДокументТовары.ЦенаРозничная) КАК ЦенаРозничная,
	//	|	СУММА(ДокументТовары.Количество"+?(ЭтоПолучениеТовара,"Получено", "")+" * ДокументТовары.Коэффициент) КАК Количество,
	//	|	СУММА(ДокументТовары.Количество * ДокументТовары.Коэффициент) КАК КоличествоКСписанию,
	//	|	0 КАК Резерв,
	//	|	СУММА(ДокументТовары.СуммаРозничная) КАК Сумма
	//	|ИЗ
	//	|	Документ.ПеремещениеТоваров.Товары КАК ДокументТовары
	//	|ГДЕ
	//	|	ДокументТовары.Ссылка = &Ссылка
	//	|	И (НЕ ДокументТовары.ЗаказПокупателя В (ЗНАЧЕНИЕ(Документ.ЗаказВнутренний.ПустаяСсылка), ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка), НЕОПРЕДЕЛЕНО))
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ДокументТовары.Номенклатура,
	//	|	ДокументТовары.ХарактеристикаНоменклатуры,
	//	|	ДокументТовары.ЗаказПокупателя,
	//	|	ВЫБОР
	//	|		КОГДА ДокументТовары.ЗаказПокупателя ССЫЛКА Документ.ЗаказВнутренний
	//	|			ТОГДА ДокументТовары.ЗаказПокупателя.ПодразделениеКомпании
	//	|		ИНАЧЕ ДокументТовары.ЗаказПокупателя.Контрагент
	//	|	КОНЕЦ";
	//	
	//	Запрос = Новый Запрос(ТекстЗапроса);
	//	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	//	
	//	//Снимаем Резерв с заказа
	//	НаборЗаписейЗаказыПокупателей = Движения.ЗаказыПокупателей;
	//	НаборЗаписейЗаказыПокупателей.РежимПроведения = Режим;
	//	НаборЗаписейЗаказыПокупателей.ДокументОбъект = ЭтотОбъект;
	//	НаборЗаписейЗаказыПокупателей.РезультатЗапросаПоТоварам = Запрос.Выполнить();
	//	НаборЗаписейЗаказыПокупателей.Контрагент = Неопределено;
	//	НаборЗаписейЗаказыПокупателей.Заказ = Неопределено;
	//	НаборЗаписейЗаказыПокупателей.СкладКомпании = ПодразделениеОтправитель;
	//	НаборЗаписейЗаказыПокупателей.Заказывать = Ложь;
	//	НаборЗаписейЗаказыПокупателей.Резервировать = Истина;
	//	НаборЗаписейЗаказыПокупателей.ПоБазовомуКоличеству=Истина;
	//	Отказ=НЕ НаборЗаписейЗаказыПокупателей.Расход() ИЛИ Отказ;
	//	//Если было списание резервов то таблица товаров содержит списанные резервы
	//	РезультатЗапросаПоТоварам = НаборЗаписейЗаказыПокупателей.РезультатЗапросаПоТоварам;
	//	
	//	//Корельский 1082{
	//	Если ЭтоПеремещениеМуждуДЦ Тогда
	//		РезультатЗапросаПоТоварам.Колонки.Удалить("Количество");
	//		РезультатЗапросаПоТоварам.Колонки.КоличествоКСписанию.Имя = "Количество";
	//	КонецЕсли;
	//	//}
	//	// 1. Спишем товар со склада отправителя
	//	НаборЗаписейОстатки=Движения.ОстаткиТоваровКомпании;
	//	НаборЗаписейОстатки.РежимПроведения=Режим;
	//	НаборЗаписейОстатки.ДокументОбъект=ЭтотОбъект;
	//	НаборЗаписейОстатки.РезультатЗапросаПоТоварам=РезультатЗапросаПоТоварам;
	//	НаборЗаписейОстатки.СкладКомпании=ПодразделениеОтправитель;
	//	НаборЗаписейОстатки.Приходовать=Истина;
	//	НаборЗаписейОстатки.ПоБазовомуКоличеству=Истина;
	//	НаборЗаписейОстатки.ДвиженияПоРознице=ПодразделениеОтправитель.Розничный;
	//	НаборЗаписейОстатки.Резервировать=РезультатЗапросаПоТоварам<>Неопределено;
	//	Отказ=НЕ НаборЗаписейОстатки.Расход() ИЛИ Отказ;
	//	
	//	Если Отказ Тогда
	//		// выведем сообщения об ошибках и предупреждениях
	//		дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
	//		Возврат; // дальше смысла не имеет
	//	КонецЕсли;
	//	ТаблицаСписанияСоСкладаОтправителя=НаборЗаписейОстатки.Выгрузить();
	//	ТаблицаСписанияСоСкладаОтправителя.Колонки.Добавить("ЦенаРозничная",Новый ОписаниеТипов("Число"));
	//	Для Каждого СтрокаСписания Из ТаблицаСписанияСоСкладаОтправителя Цикл
	//		СтрокаТовары = Товары.Найти(СтрокаСписания.Номенклатура,"Номенклатура");
	//		Если СтрокаТовары=Неопределено Тогда Продолжить; КонецЕсли;
	//		СтрокаСписания.ЦенаРозничная=СтрокаТовары.ЦенаРозничная;
	//	КонецЦикла;
	//КонецЕсли;
	//
	//// если перемещение в филиал, то ничего в этот филиал не приходуем
	//Если ХозОперация<>Справочники.ХозОперации.ПеремещениеТоваровВФилиал И (НЕ ЭтоПеремещениеМеждуДЦ ИЛИ ЭтоПолучениеТовара) Тогда
	//	ТекстЗапроса="ВЫБРАТЬ
	//	|	ДокументТовары.Номенклатура КАК Номенклатура,
	//	|	ДокументТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//	|	ДокументТовары.ЗаказПокупателя КАК Заказ,
	//	|	ВЫБОР
	//	|		КОГДА ДокументТовары.ЗаказПокупателя ССЫЛКА Документ.ЗаказВнутренний
	//	|			ТОГДА ДокументТовары.ЗаказПокупателя.ПодразделениеКомпании
	//	|		ИНАЧЕ ДокументТовары.ЗаказПокупателя.Контрагент
	//	|	КОНЕЦ КАК Контрагент,
	//	|	МАКСИМУМ(ДокументТовары.ЦенаРозничная) КАК ЦенаРозничная,
	//	|	СУММА(ДокументТовары.Количество"+?(ЭтоПолучениеТовара,"Получено", "")+" * ДокументТовары.Коэффициент) КАК Количество,
	//	|	СУММА(ДокументТовары.Количество"+?(ЭтоПолучениеТовара,"Получено", "")+" * ДокументТовары.Коэффициент) КАК Резерв,
	//	|	СУММА(ДокументТовары.СуммаРозничная) КАК Сумма
	//	|ИЗ
	//	|	Документ.ПеремещениеТоваров.Товары КАК ДокументТовары
	//	|ГДЕ
	//	|	ДокументТовары.Ссылка = &Ссылка
	//	|	И (НЕ ДокументТовары.ЗаказПокупателя В (ЗНАЧЕНИЕ(Документ.ЗаказВнутренний.ПустаяСсылка), ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка), НЕОПРЕДЕЛЕНО))
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ДокументТовары.Номенклатура,
	//	|	ДокументТовары.ХарактеристикаНоменклатуры,
	//	|	ДокументТовары.ЗаказПокупателя,
	//	|	ВЫБОР
	//	|		КОГДА ДокументТовары.ЗаказПокупателя ССЫЛКА Документ.ЗаказВнутренний
	//	|			ТОГДА ДокументТовары.ЗаказПокупателя.ПодразделениеКомпании
	//	|		ИНАЧЕ ДокументТовары.ЗаказПокупателя.Контрагент
	//	|	КОНЕЦ";
	//	Запрос = Новый Запрос(ТекстЗапроса);
	//	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	//	ТаблицаСписанияСоСкладаОтправителя=Запрос.Выполнить();
	//	
	//	// Резервирование товаров по заказам покупателей
	//	НаборЗаписейЗаказыПокупателей=Движения.ЗаказыПокупателей;
	//	НаборЗаписейЗаказыПокупателей.РежимПроведения=Режим;
	//	НаборЗаписейЗаказыПокупателей.ДокументОбъект=ЭтотОбъект;
	//	НаборЗаписейЗаказыПокупателей.РезультатЗапросаПоТоварам=ТаблицаСписанияСоСкладаОтправителя;
	//	НаборЗаписейЗаказыПокупателей.Контрагент=Неопределено;
	//	НаборЗаписейЗаказыПокупателей.Заказ=Неопределено;
	//	НаборЗаписейЗаказыПокупателей.СкладКомпании=ПодразделениеПолучатель;
	//	НаборЗаписейЗаказыПокупателей.Заказывать    = Ложь;
	//	НаборЗаписейЗаказыПокупателей.Резервировать = Истина;
	//	НаборЗаписейЗаказыПокупателей.ПоБазовомуКоличеству = Истина;
	//	Если ХозОперация = Справочники.ХозОперации.ПеремещениеТоваров Тогда
	//		НаборЗаписейЗаказыПокупателей.ВидОперации = Перечисления.ВидыОперацийЗаказов.ПеремещениеРезерва;
	//	КонецЕсли;
	//	Отказ = НЕ НаборЗаписейЗаказыПокупателей.Приход() ИЛИ Отказ;
	//	//Отказ=НЕ НаборЗаписейЗаказыПокупателей.КорректировкаЗаказаПокупателя() ИЛИ Отказ;
	//	
	//	// Оприходуем на склад получатель
	//	НаборЗаписейОстатки=Движения.ОстаткиТоваровКомпании;
	//	НаборЗаписейОстатки.РежимПроведения=Режим;
	//	НаборЗаписейОстатки.ДокументОбъект=ЭтотОбъект;
	//	НаборЗаписейОстатки.РезультатЗапросаПоТоварам=ТаблицаСписанияСоСкладаОтправителя;
	//	НаборЗаписейОстатки.СкладКомпании=ПодразделениеПолучатель;
	//	НаборЗаписейОстатки.Приходовать=Истина;
	//	НаборЗаписейОстатки.Резервировать=Истина;
	//	НаборЗаписейОстатки.ДвиженияПоРознице=?(ЭтоПодразделениеПолучатель,Ложь,ПодразделениеПолучатель.Розничный);
	//	НаборЗаписейОстатки.ПоБазовомуКоличеству=Истина;
	//	Отказ = НЕ НаборЗаписейОстатки.Приход() ИЛИ Отказ;
	//КонецЕсли;
	//
	//// проведем партии товаров
	//Отказ = НЕ ПровестиПоПартиям(Режим,Ссылка) ИЛИ Отказ;
	//
	//// если перемещение товаров в розницу, то установим розничные цены
	//Если НЕ Отказ И ?(ЭтоПодразделениеПолучатель,Ложь,ПодразделениеПолучатель.Розничный) Тогда
	//	Если ПодразделениеКомпании.УстановкаЦенДокументамиПоступления И НЕ ПодразделениеПолучатель.ТипЦенРозничнойТорговли.Рассчитывается Тогда
	//		НаборЗаписейЦены = Движения.Цены;
	//		НаборЗаписейЦены.ДокументОбъект = ЭтотОбъект;
	//		НаборЗаписейЦены.Контрагент     = Неопределено;  			
	//		НаборЗаписейЦены.ТипЦен         = ПодразделениеПолучатель.ТипЦенРозничнойТорговли;
	//		НаборЗаписейЦены.ПодразделениеКомпании     = ПодразделениеПолучатель.Подразделение;			
	//		НаборЗаписейЦены.РезультатЗапросаПоТоварам = Неопределено;        			
	//		Отказ = НЕ НаборЗаписейЦены.УстановитьЦены() ИЛИ Отказ;
	//	КонецЕсли;
	//	
	//	// если перемещаем товары из филиала, то установим цены на все товары
	//	Если НЕ Отказ И ХозОперация=Справочники.ХозОперации.ПеремещениеТоваровИзФилиала И НЕ ТипЦен.Рассчитывается Тогда
	//		НаборЗаписейЦены = Движения.Цены;
	//		НаборЗаписейЦены.ДокументОбъект = ЭтотОбъект;
	//		НаборЗаписейЦены.Контрагент     = Неопределено;
	//		НаборЗаписейЦены.ТипЦен         = ТипЦен;
	//		НаборЗаписейЦены.ПодразделениеКомпании     = ПодразделениеКомпании;
	//		НаборЗаписейЦены.РезультатЗапросаПоТоварам = Неопределено;
	//		Отказ = НЕ НаборЗаписейЦены.УстановитьЦены() ИЛИ Отказ;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//// двигаем границу последовательности заказов
	//ДвигаемГраницу = (Режим<>РежимПроведенияДокумента.Оперативный И (Движения.ЗаказыПокупателей.Количество()>0 ИЛИ Движения.ЗаказыРаспределение.Количество()>0));
	//Если ДвигаемГраницу ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.ЗаказБыл) Тогда
	//	НаборЗаписейГраницыЗаказы = РегистрыСведений.ГраницыЗаказы.СоздатьНаборЗаписей();
	//	Если ДвигаемГраницу Тогда
	//		ТаблицаЗаказов = Движения.ЗаказыПокупателей.Выгрузить();
	//		ТаблицаЗаказов.Колонки.Удалить("Заказ");
	//		ТаблицаЗаказов.Колонки.Добавить("Заказ",Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя,ДокументСсылка.ЗаказВнутренний,ДокументСсылка.ЗаказПоставщику"));
	//		ТаблицаЗаказов.ЗагрузитьКолонку(Движения.ЗаказыПокупателей.ВыгрузитьКолонку("Заказ"),"Заказ");
	//		Для Каждого СтрокаЗаказа Из Движения.ЗаказыРаспределение Цикл
	//			НоваяСтрока=ТаблицаЗаказов.Добавить();
	//			НоваяСтрока.Заказ=СтрокаЗаказа.ЗаказПокупателя;
	//			НоваяСтрока=ТаблицаЗаказов.Добавить();
	//			НоваяСтрока.Заказ=СтрокаЗаказа.ЗаказПоставщика;
	//		КонецЦикла; 
	//		ТаблицаЗаказов.Свернуть("Заказ","");
	//		НаборЗаписейГраницыЗаказы.Заказ = ТаблицаЗаказов.ВыгрузитьКолонку("Заказ");
	//		НаборЗаписейГраницыЗаказы.МоментВремени = Дата;
	//		НаборЗаписейГраницыЗаказы.ЗаказБыл = ДополнительныеСвойства.ЗаказБыл;
	//		НаборЗаписейГраницыЗаказы.МоментВремениБыл = ДополнительныеСвойства.МоментВремениБыл;
	//	Иначе
	//		НаборЗаписейГраницыЗаказы.Заказ = ДополнительныеСвойства.ЗаказБыл;
	//		НаборЗаписейГраницыЗаказы.МоментВремени = ДополнительныеСвойства.МоментВремениБыл;
	//		НаборЗаписейГраницыЗаказы.ЗаказБыл = Неопределено;
	//		НаборЗаписейГраницыЗаказы.МоментВремениБыл = Неопределено;
	//	КонецЕсли;
	//	НаборЗаписейГраницыЗаказы.ДокументСсылка = Ссылка;
	//	НаборЗаписейГраницыЗаказы.ИзменитьГраницу();
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		тКэшСуммСписания = Неопределено;
		СуммаДокумента = РассчитатьСуммуВсего();
		ФлагПерерасчет = Истина;
	КонецЕсли;
	
	// если модифицировали документ, то запишем его
	Если НЕ Отказ И Модифицированность() Тогда
		Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
	// выведем сообщения об ошибках и предупреждениях
	дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
	
КонецПроцедуры // ОбработкаПроведения()


//Бондаренко++ 20181101 

// <Описание функции>
//
// Параметры
//  ПараметрыДоговора  - Структура: Контрагент, Организация, ВидДоговора.
//
// Возвращаемое значение:
//   Справочники.ДоговорыВзаиморасчетов  или пустая ссылка этого же типа  
//
Функция НайтиДоговор(ПараметрыДоговора)
	
	ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	
	//Бондаренко++ 20180321
	//Если СокрЛП(ПараметрыДоговора.Организация.ИНН)<>"6167075244" Тогда
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//	|	ДоговорыВзаиморасчетов.Ссылка,
	//	|	ДоговорыВзаиморасчетов.ВидДоговора,
	//	|	ДоговорыВзаиморасчетов.Владелец,
	//	|	ДоговорыВзаиморасчетов.Организация,
	//	|	ДоговорыВзаиморасчетов.ДатаСоздания КАК ДатаСоздания,
	//	|	ДоговорыВзаиморасчетов.ПометкаУдаления,
	//	|	ДоговорыВзаиморасчетов.Владелец.ОсновнойДоговорВзаиморасчетов КАК ОснДоговор,
	//	|	ДоговорыВзаиморасчетов.ДляПерепродаж,
	//	|	ДоговорыВзаиморасчетов.ДляЗапчастей,
	//	|	ДоговорыВзаиморасчетов.Подразделение
	//	|ИЗ
	//	|	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	//	|ГДЕ
	//	|	ДоговорыВзаиморасчетов.Владелец = &ВыбВладелец
	//	|	И ДоговорыВзаиморасчетов.Организация = &ВыбОрганизация
	//	|	И ДоговорыВзаиморасчетов.ВидДоговора = &ВыбВидДоговора
	//	|	И ДоговорыВзаиморасчетов.Подразделение = &ВыбПодразделение
	//	|	И ДоговорыВзаиморасчетов.ПометкаУдаления = ЛОЖЬ
	//	|	И ДоговорыВзаиморасчетов.ДляЗапчастей = ИСТИНА
	//	|	И ДоговорыВзаиморасчетов.ДляПерепродаж = ИСТИНА
	//	|	И ДоговорыВзаиморасчетов.Подразделение = &ВыбПодразделение
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	ДатаСоздания";
	// 	Запрос.УстановитьПараметр("ВыбПодразделение", ПараметрыДоговора.Подразделение);
	//Иначе
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДоговорыВзаиморасчетов.Ссылка,
	|	ДоговорыВзаиморасчетов.ВидДоговора,
	|	ДоговорыВзаиморасчетов.Владелец,
	|	ДоговорыВзаиморасчетов.Организация,
	|	ДоговорыВзаиморасчетов.ДатаСоздания КАК ДатаСоздания,
	|	ДоговорыВзаиморасчетов.ПометкаУдаления,
	|	ДоговорыВзаиморасчетов.Владелец.ОсновнойДоговорВзаиморасчетов КАК ОснДоговор,
	|	ДоговорыВзаиморасчетов.ДляПерепродаж,
	|	ДоговорыВзаиморасчетов.ДляЗапчастей
	|ИЗ
	|	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|ГДЕ
	|	ДоговорыВзаиморасчетов.Владелец = &ВыбВладелец
	|	И ДоговорыВзаиморасчетов.Организация = &ВыбОрганизация
	|	И ДоговорыВзаиморасчетов.ВидДоговора = &ВыбВидДоговора
	|	И ДоговорыВзаиморасчетов.ПометкаУдаления = ЛОЖЬ
	|	И ДоговорыВзаиморасчетов.ДляЗапчастей = ИСТИНА
	|	И ДоговорыВзаиморасчетов.ДляПерепродаж = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСоздания";
	//КонецЕсли;
	//Бондаренко-- 20180321
	
	Запрос.УстановитьПараметр("ВыбВидДоговора", ПараметрыДоговора.ВидДоговора);
	Запрос.УстановитьПараметр("ВыбВладелец", ПараметрыДоговора.Контрагент);
	Запрос.УстановитьПараметр("ВыбОрганизация", ПараметрыДоговора.Организация);
	//Запрос.УстановитьПараметр("ВыбПодразделение", ПараметрыДоговора.Подразделение);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДоговорВзаиморасчетов = ВыборкаДетальныеЗаписи.Ссылка; 
		Если ВыборкаДетальныеЗаписи.ДляПерепродаж Тогда
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	
	Если обЗначениеНезаполнено(ДоговорВзаиморасчетов) Тогда
		Дог = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
		Дог.Автор=ПараметрыСеанса.Пользователь;
		Дог.ДатаСоздания=ТекущаяДата();
		Дог.ДатаНачала=ТекущаяДата();
		Дог.ВидДоговора=ПараметрыДоговора.ВидДоговора;
		Дог.Владелец = ПараметрыДоговора.Контрагент;
		Дог.Организация = ПараметрыДоговора.Организация;
		Дог.Подразделение = ПараметрыДоговора.Подразделение;
		Дог.ВалютаВзаиморасчетов=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		Дог.ВидОплаты=Перечисления.ВидыОплаты.ПроизвольнаяОплата;
		Дог.ДляЗапчастей=Истина;
		Дог.ДляПерепродаж=Истина;
		Дог.Наименование = СокрЛП(Строка(Дог.ВидДоговора))
		+ ?(ПустаяСтрока(Дог.НомерДоговора),""," № " + СокрЛП(Дог.НомерДоговора))
		+ " в " + Дог.ВалютаВзаиморасчетов.Наименование
		+ " от "+Формат(Дог.ДатаНачала,"ДФ=дд.ММ.гг");
		
		Попытка
			Дог.Записать();
			ДоговорВзаиморасчетов = Дог.Ссылка;
		Исключение
			Сообщить("ОШИБКА! Не удалось записать договор");		
		КонецПопытки;
		
	КонецЕсли; 
	
	Возврат ДоговорВзаиморасчетов;
	
	
КонецФункции // НайтиДоговор(ПараметрыДоговора)

Функция НайтиРозничнуюЦену(Номенклатура,ТипЦен,ЕдИзмерения,Подразделение)
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныСрезПоследних.Номенклатура,
	|	ЦеныСрезПоследних.ТипЦен,
	|	ЦеныСрезПоследних.ЕдиницаИзмерения,
	|	ЦеныСрезПоследних.ПодразделениеКомпании,
	|	ЦеныСрезПоследних.Цена,
	|	ЦеныСрезПоследних.Период КАК Период
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних КАК ЦеныСрезПоследних
	|ГДЕ
	|	ЦеныСрезПоследних.Номенклатура = &ВыбНомен
	|	И ЦеныСрезПоследних.ТипЦен = &ВыбТипЦен
	|	И ЦеныСрезПоследних.ЕдиницаИзмерения = &ВыбЕдИзмерен
	|	И ЦеныСрезПоследних.ПодразделениеКомпании = &ВыбПодразделение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Запрос.Параметры.Вставить("ВыбНомен",Номенклатура);
	Запрос.Параметры.Вставить("ВыбТипЦен",ТипЦен);
	Запрос.Параметры.Вставить("ВыбЕдИзмерен",ЕдИзмерения);
	Запрос.Параметры.Вставить("ВыбПодразделение",Подразделение);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Цена;
	КонецЦикла;
	
	Возврат 0;
	
	
КонецФункции // НайтиРозничнуюЦену()


Функция СоздатьДокументыПерепродажиПоЮрЛицам (ТоварыКПродаже,ТекСкладОтправитель) Экспорт 
	
	//Бондаренко++ 20190204
	СтавкаНДС20 = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
	//Бондаренко-- 20190204
	
	ЕстьОшибки=Ложь;
	
	РеализацияОбъект = Документы.РеализацияТоваров.СоздатьДокумент();
	РеализацияОбъект.РегламентированныйУчет = Истина;
	РеализацияОбъект.Дата = ТекущаяДата();
	РеализацияОбъект.УстановитьНовыйНомер();
	РеализацияОбъект.ХозОперация = Справочники.ХозОперации.РеализацияТоваров;
	
	РеализацияОбъект.ДокументОснование=Ссылка;
	
	РеализацияОбъект.Организация = ТекСкладОтправитель.Организация;
	РеализацияОбъект.ОбработкаРеквизита("Организация");
	
	РеализацияОбъект.ПодразделениеКомпании = ТекСкладОтправитель.Подразделение;
	//РеализацияОбъект.ОбработкаРеквизита("ПодразделениеКомпании");
	
	РеализацияОбъект.СкладКомпании = ТекСкладОтправитель;
	
	ДопПараметры = Новый Структура("НеРассчитыватьСкидки,ВозможностьИзмененияЦен",Истина,Ложь);
	РеализацияОбъект.ОбработкаРеквизита("СкладКомпании",,,ДопПараметры);
	
	
	Если РеализацияОбъект.ПодразделениеКомпании.ДилерскийЦентр=Справочники.ДилерскиеЦентры.Еврокар_Гамма Тогда
		Попытка
			РеализацияОбъект.ТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенЗакупки;
			РеализацияОбъект.ОбработкаРеквизита("ТипЦен");
		Исключение
			#Если НаКлиенте Тогда
				Сообщить("ОШИБКА! Не найден тип цен 'Основной тип цен закупки'. Обработка прервана.", СтатусСообщения.ОченьВажное);
			#КонецЕсли 
			ЕстьОшибки=Истина;
			Возврат ЕстьОшибки;
		КонецПопытки;	
	Иначе	
		Попытка
			РеализацияОбъект.ТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенЗакупки;
			РеализацияОбъект.ОбработкаРеквизита("ТипЦен");
		Исключение
			#Если НаКлиенте Тогда
				Сообщить("ОШИБКА! Не найден тип цен 'Основной тип цен закупки'. Обработка прервана.", СтатусСообщения.ОченьВажное);
			#КонецЕсли 
			ЕстьОшибки=Истина;
			Возврат ЕстьОшибки;
		КонецПопытки;	
	КонецЕсли; 
	
	РеализацияОбъект.КурсВалютыВзаиморасчетов=1;
	РеализацияОбъект.КурсВалютыУпр=1;
	РеализацияОбъект.КурсДокумента=1;
	
	РеализацияОбъект.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	РеализацияОбъект.ОбработкаРеквизита("ВалютаДокумента");
	
	РеализацияОбъект.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", ТоварыКПродаже[0].ИНН_Покупателя);
	РеализацияОбъект.ОбработкаРеквизита("Контрагент");
	
	//Договоры  = Справочники.ДоговорыВзаиморасчетов;
	//
	//Отбор1 = Новый Структура("Организация");
	//Отбор1.Организация = РеализацияОбъект.Организация;
	// 
	//Выборка = Справочники.ДоговорыВзаиморасчетов.Выбрать(,РеализацияОбъект.Контрагент);
	//
	//Пока Выборка.Следующий() Цикл
	//	Если Выборка.ВидДоговора <> Перечисления.ВидыДоговоров.Продажа Тогда
	//		Продолжить;
	//	КонецЕсли;  
	//	Если Выборка.Организация <> РеализацияОбъект.Организация Тогда
	//		Продолжить;
	//	КонецЕсли;  
	//   	РеализацияОбъект.ДоговорВзаиморасчетов=Выборка.ПолучитьОбъект().Ссылка;
	// 	Прервать;
	// КонецЦикла; 
	
	ПараметрыДоговора = Новый Структура;
	ПараметрыДоговора.Вставить("Контрагент",РеализацияОбъект.Контрагент);
	ПараметрыДоговора.Вставить("ВидДоговора",Перечисления.ВидыДоговоров.Продажа);
	ПараметрыДоговора.Вставить("Организация",РеализацияОбъект.Организация);
	ПараметрыДоговора.Вставить("Подразделение",РеализацияОбъект.ПодразделениеКомпании);
	
	
	РеализацияОбъект.ДоговорВзаиморасчетов = НайтиДоговор(ПараметрыДоговора);
	РеализацияОбъект.ОбработкаРеквизита("ДоговорВзаиморасчетов");	
	
	РеализацияОбъект.Автор = ПараметрыСеанса.Пользователь;
	РеализацияОбъект.Комментарий = "Создан автоматически "+ТекущаяДата()+" пользователем "+ПараметрыСеанса.Пользователь+" для перепродажи запасных частей между организациями";
	РеализацияОбъект.СформированАвтоматически=Истина;
	
	Для Каждого стр из ТоварыКПродаже цикл 
		Если стр.СкладОтправитель <> ТекСкладОтправитель Тогда
			Продолжить;
		КонецЕсли; 
		СтрокаРеализации = РеализацияОбъект.Товары.Добавить();
		СтрокаРеализации.Номенклатура = стр.Товар;
		
		СтрокаРеализации.Цена = обПолучитьЦену(РеализацияОбъект.ТипЦен,СтрокаРеализации.Номенклатура,РеализацияОбъект.Дата,,РеализацияОбъект.ВалютаДокумента,РеализацияОбъект.КурсДокумента, ,СтрокаРеализации.ЕдиницаИзмерения , РеализацияОбъект.ПодразделениеКомпании);
		
		//  Если СформированАвтоматически  Тогда
		//      СтрокаРеализации.Цена = стр.Цена;
		//  	СтрокаРеализации.СуммаВсего = стр.СуммаВсего;
		//КонецЕсли; 
		
		СтрокаРеализации.Количество = стр.Количество;
		СтрокаРеализации.ЕдиницаИзмерения = стр.ЕдиницаИзмерения;
		
		//Бондаренко++ 20190204
		//СтрокаРеализации.СтавкаНДС=Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
		Если ТекущаяДата() >= Дата(2019,1,1) Тогда
			СтрокаРеализации.СтавкаНДС=СтавкаНДС20;	
		Иначе
			СтрокаРеализации.СтавкаНДС=Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
		КонецЕсли; 
		//Бондаренко-- 20190204
		
		ДопПараметры = Новый Структура;
		
		ДопПараметры.Вставить("НеКонтролироватьЗамены",Истина);
		ДопПараметры.Вставить("ПересчитатьЦену",Истина);
		РеализацияОбъект.ОбработкаРеквизита("Товары.Номенклатура", СтрокаРеализации,, ДопПараметры);
		
		РеализацияОбъект.ОбработкаРеквизита("Товары.ХарактеристикаНоменклатуры", СтрокаРеализации,, ДопПараметры);
		РеализацияОбъект.ОбработкаРеквизита("Товары.ЕдиницаИзмерения", СтрокаРеализации,, ДопПараметры);
		РеализацияОбъект.ОбработкаРеквизита("Товары.Количество", СтрокаРеализации,, ДопПараметры);
		РеализацияОбъект.ОбработкаРеквизита("Товары.Коэффициент", СтрокаРеализации,, ДопПараметры);
		
		//Бондаренко 20160301 ++
		
		Если РеализацияОбъект.Организация.ОсвобожденОтНДС Тогда
			//Бондаренко++ 20180904
			Если РеализацияОбъект.Контрагент.НашаФирма Тогда
				//Бондаренко++ 20190204
				//СтрокаРеализации.СтавкаНДС=Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
				Если ТекущаяДата() >= Дата(2019,1,1) Тогда
					СтрокаРеализации.СтавкаНДС=СтавкаНДС20;	
				Иначе
					СтрокаРеализации.СтавкаНДС=Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
				КонецЕсли; 
				//Бондаренко-- 20190204
			Иначе
				СтрокаРеализации.СтавкаНДС=Справочники.СтавкиНДС.БезНДС;
			КонецЕсли; 
			//СтрокаРеализации.СтавкаНДС=Справочники.СтавкиНДС.БезНДС;
			//Бондаренко++ 20180904
		Иначе	
			//Бондаренко++ 20190204
			//СтрокаРеализации.СтавкаНДС=Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
			Если ТекущаяДата() >= Дата(2019,1,1) Тогда
				СтрокаРеализации.СтавкаНДС=СтавкаНДС20;	
			Иначе
				СтрокаРеализации.СтавкаНДС=Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
			КонецЕсли; 
			//Бондаренко-- 20190204
		КонецЕсли; 
		//Бондаренко 20160301 --
		
		РеализацияОбъект.ОбработкаРеквизита("Товары.СтавкаНДС", СтрокаРеализации,, ДопПараметры);
		
		СтрокаРеализации.СуммаВсего=СтрокаРеализации.Сумма;
		РеализацияОбъект.ОбработкаРеквизита("Товары.СуммаВсего", СтрокаРеализации,, ДопПараметры);
		
	КонецЦикла;
	
	РеализацияОбъект.ПересчитатьПоСебестоимости("");
	
	Если ЕстьОшибки Тогда
		#Если НаКлиенте Тогда
			Сообщить("ОШИБКА! Реализация для перепродажи не сформирована.",СтатусСообщения.ОченьВажное);
		#КонецЕсли 
		Возврат ЕстьОшибки;
	КонецЕсли;
	
	//Бондаренко++ 20180905
	Попытка
		РеализацияОбъект.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		#Если НаКлиенте Тогда
			Сообщить(ОписаниеОшибки());
		#КонецЕсли
		ЕстьОшибки=Истина;
	КонецПопытки;
	
	Попытка
		СвойствоАвто = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
		СвойствоАвто.Объект   = РеализацияОбъект.Ссылка;
		СвойствоАвто.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ДокументСозданАвтоматически;
		СвойствоАвто.Значение = Истина;
		СвойствоАвто.Записать(Истина);
	Исключение
		//
	Конецпопытки;	
	//Бондаренко++ 20180905
	
	Попытка
		РеализацияОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		#Если НаКлиенте Тогда
			Сообщить(ОписаниеОшибки());
		#КонецЕсли
		ЕстьОшибки=Истина;
	КонецПопытки;	
	
	ТЗ_Себест = РеализацияОбъект.Движения.ПартииТоваровКомпании.Выгрузить();
	//ТЗ_Себест.ВыбратьСтроку();
	//Бондаренко++ 20181004
	//ТЗ_Себест.Свернуть("Номенклатура","СуммаУпр");  
	ТЗ_Себест.Свернуть("Номенклатура","СуммаУпр,Количество");  
	
	ТЗ_Себест.Очистить();
	
	БылПовторныйПересчет = Ложь;
	
	Для Каждого СтрокаТовары Из РеализацияОбъект.Товары Цикл
		СуммаСписания = дкПолучитьСуммуСписания(РеализацияОбъект, "ПартииТоваровКомпании", , СтрокаТовары.Номенклатура,, СтрокаТовары.НомерСтроки);
		НовСтр = ТЗ_Себест.Добавить();
		НовСтр.Номенклатура = СтрокаТовары.Номенклатура;
		НовСтр.Количество = СтрокаТовары.Количество * СтрокаТовары.Коэффициент;
		НовСтр.СуммаУпр = СуммаСписания;
		//Бондаренко++ 20190426
		//Если СформированАвтоматически Тогда
		//	СуммаСписания = дкПолучитьСуммуСписания(РеализацияОбъект, "ПартииТоваровКомпании", тКэшСуммСписания, СтрокаТовары.Номенклатура,, СтрокаТовары.НомерСтроки);
		//	Отбор = Новый Структура();
		//	Отбор.Вставить("Номенклатура",СтрокаТовары.Номенклатура);
		//	СтрокаНоменклатурыОснования =  ЭтотОбъект.ДокументОснование.Товары.НайтиСтроки(Отбор); 
		//	Если СтрокаНоменклатурыОснования.Количество() > 0 Тогда
		//		ЦенаТовараОснования = СтрокаНоменклатурыОснования[0].Цена;
		//		СтрокаТовары.Цена = Мин(СтрокаТовары.Цена,ЦенаТовараОснования);
		//		Если Справочники.Контрагенты.НайтиПоРеквизиту("ИНН",РеализацияОбъект.Организация.ИНН).ФормаСобственности=Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
		//			СтрокаТовары.Цена = Мин(СтрокаТовары.Цена,ЦенаТовараОснования*0.05);
		//		КонецЕсли; 
		//		СтрокаТовары.СуммаВсего=СтрокаТовары.Цена*СтрокаТовары.КоличествоБазовое;
		//		СтрокаТовары.Сумма=СтрокаТовары.Цена*СтрокаТовары.КоличествоБазовое;
		//		РеализацияОбъект.ОбработкаРеквизита("Товары.СуммаВсего", СтрокаТовары,, ДопПараметры);
		//		БылПовторныйПересчет=Истина;
		//	КонецЕсли; 
		//КонецЕсли; 		
		//Бондаренко-- 20190425
	КонецЦикла;
	
	//Бондаренко++ 20190426
	Если БылПовторныйПересчет Тогда
		Попытка
			РеализацияОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			#Если НаКлиенте Тогда
				Сообщить(ОписаниеОшибки());
			#КонецЕсли
			ЕстьОшибки=Истина;
		КонецПопытки;
	КонецЕсли; 
	//Бондаренко-- 20190426
	
	//ТЗ_Себест.ВыбратьСтроку();
	//Бондаренко-- 20181004
	
	//ТЗ_Себест.ВыбратьСтроку();
	
	Если ЕстьОшибки Тогда
		#Если НаКлиенте Тогда
			Сообщить("ОШИБКА! Реализация для перепродажи не сформирована.",СтатусСообщения.ОченьВажное);
		#КонецЕсли 
		Возврат ЕстьОшибки;
	КонецЕсли; 
	
	//Бондаренко++ 20170905
	Попытка
		СвойствоАвто = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
		СвойствоАвто.Объект   = РеализацияОбъект.Ссылка;
		СвойствоАвто.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ДокументСозданАвтоматически;
		СвойствоАвто.Значение = Истина;
		СвойствоАвто.Записать(Истина);
	Исключение
		//
	Конецпопытки;	
	//Бондаренко-- 20170905
	
	Сообщить("Сформирован документ: "+РеализацияОбъект,СтатусСообщения.Информация);
	
	ТабДок  = Новый ТабличныйДокумент;
	//Бондаренко++ 20190222
	//РеализацияОбъект.ПечатьТОРГ12(ТабДок);
	РеализацияОбъект.ПечатьУПД(ТабДок);
	//Бондаренко-- 20190222
	
	ТабДок.АвтоМасштаб=Истина;
	ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	ТабДок.ТолькоПросмотр=Истина;
	ТабДок.Показать();
	
	ФормироватьСФ = Истина;
	
	Если ЗначениеЗаполнено(РеализацияОбъект.Организация) Тогда
		Если РеализацияОбъект.Организация.ОсвобожденОтНДС Тогда
			//Бондаренко-- 200180904
			Если РеализацияОбъект.Контрагент.НашаФирма Тогда
				ФормироватьСФ = Истина;
			Иначе
				ФормироватьСФ = Ложь;
			КонецЕсли; 
			//ФормироватьСФ = Ложь;
			//Бондаренко++ 20180904
		КонецЕсли; 
	КонецЕсли; 
	
	Если ФормироватьСФ Тогда
		
		СчетФактураОбъект = Документы.СчетФактураВыданный.СоздатьДокумент();
		
		//Бондаренко++ 20190502
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданный.Ссылка
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.ДокументОснование = &ДокументОснование";
		
		Запрос.УстановитьПараметр("ДокументОснование", РеализацияОбъект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СчетФактураОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		КонецЦикла;
		//Бондаренко-- 20190502
		
		СчетФактураОбъект.ОбработкаЗаполнения(РеализацияОбъект.Ссылка);
		СчетФактураОбъект.СформированАвтоматически=Истина;
		
		ЕстьОшибки=Ложь;
		
		Попытка
			СчетФактураОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Попытка
				СчетФактураОбъект.УстановитьНовыйНомер();
				СчетФактураОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Сообщить(ОписаниеОшибки());
				ЕстьОшибки=Истина;
			КонецПопытки;	
		КонецПопытки;	
		
		Если ЕстьОшибки Тогда
			Сообщить("ОШИБКА! СчетФактура выданный для перепродажи не сформирована.",СтатусСообщения.ОченьВажное);
			Возврат ЕстьОшибки;
		КонецЕсли; 
		
		Сообщить("Сформирован документ: "+СчетФактураОбъект,СтатусСообщения.Информация);
		
		ТабДок = Новый ТабличныйДокумент;
		
		СчетФактураОбъект.ПечатьСчетФактура(ТабДок);
		ТабДок.АвтоМасштаб=Истина;
		ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
		ТабДок.ТолькоПросмотр=Истина;
		ТабДок.Показать();
		
	КонецЕсли; 
	
	
	ПоступлениеОбъект = Документы.ПоступлениеТоваров.СоздатьДокумент();
	//ПоступлениеОбъект.ОбработкаЗаполнения(РеализацияОбъект.Ссылка);
	
	ПоступлениеОбъект.Автор = ПараметрыСеанса.Пользователь;
	ПоступлениеОбъект.РегламентированныйУчет = Истина;
	ПоступлениеОбъект.Дата = ТекущаяДата();
	ПоступлениеОбъект.УстановитьНовыйНомер();
	ПоступлениеОбъект.ХозОперация = Справочники.ХозОперации.ПоступлениеТоваров;
	ПоступлениеОбъект.ДокументОснование = РеализацияОбъект.Ссылка;
	
	ПоступлениеОбъект.Организация = Ссылка.ПодразделениеОтправитель.Организация;
	ПоступлениеОбъект.ОбработкаРеквизита("Организация");
	
	ПоступлениеОбъект.ВхДокДата = РеализацияОбъект.Дата;
	ПоступлениеОбъект.ВхДокНомер = РеализацияОбъект.Номер;
	ПоступлениеОбъект.ПодразделениеКомпании = Ссылка.ПодразделениеОтправитель.Подразделение;
	ПоступлениеОбъект.ОбработкаРеквизита("ПодразделениеКомпании");
	
	ПоступлениеОбъект.СкладКомпании = Ссылка.ПодразделениеОтправитель;
	ПоступлениеОбъект.ОбработкаРеквизита("СкладКомпании");
	
	//Бондаренко++ 20190425
	Если СформированАвтоматически Тогда
		ПоступлениеОбъект.СкладКомпании = Ссылка.ПодразделениеПолучатель;
		ПоступлениеОбъект.ОбработкаРеквизита("СкладКомпании");
		ПоступлениеОбъект.ПодразделениеКомпании = Ссылка.ПодразделениеОтправитель.Подразделение;
		ПоступлениеОбъект.Организация = Ссылка.ПодразделениеОтправитель.Организация;
	КонецЕсли; 
	//Бондаренко-- 20190425
	
	ПоступлениеОбъект.ТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенЗакупки;
	ПоступлениеОбъект.ОбработкаРеквизита("ТипЦен");
	
	ПоступлениеОбъект.КурсДокумента = 1;
	ПоступлениеОбъект.КурсВалютыВзаиморасчетов = 1;
	ПоступлениеОбъект.КурсВалютыУпр = 1;
	
	ПоступлениеОбъект.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	ПоступлениеОбъект.ОбработкаРеквизита("ВалютаДокумента");
	
	//Бондаренко++ 20181224
	//ПоступлениеОбъект.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН",ТоварыКПродаже[0].ИНН_Продавца);
	ПоступлениеОбъект.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН",РеализацияОбъект.Организация.ИНН);
	//Сообщить("ПоступлениеОбъект.Контрагент = "+ПоступлениеОбъект.Контрагент);
	//Бондаренко-- 20181224
	
	ПоступлениеОбъект.ОбработкаРеквизита("Контрагент");
	
	ПараметрыДоговора = Новый Структура;
	ПараметрыДоговора.Вставить("Контрагент",ПоступлениеОбъект.Контрагент);
	ПараметрыДоговора.Вставить("ВидДоговора",Перечисления.ВидыДоговоров.Покупка);
	ПараметрыДоговора.Вставить("Организация",ПоступлениеОбъект.Организация);
	ПараметрыДоговора.Вставить("Подразделение",ПоступлениеОбъект.ПодразделениеКомпании);
	
	ПоступлениеОбъект.ДоговорВзаиморасчетов = НайтиДоговор(ПараметрыДоговора);
	ПоступлениеОбъект.ОбработкаРеквизита("ДоговорВзаиморасчетов");	
	
	ПоступлениеОбъект.ВхДокДата  =РеализацияОбъект.Дата;
	ПоступлениеОбъект.ВхДокНомер = РеализацияОбъект.Номер;
	
	ПоступлениеОбъект.Автор = ПараметрыСеанса.Пользователь;
	ПоступлениеОбъект.Комментарий = "Создан автоматически "+ТекущаяДата()+" пользователем "+ПараметрыСеанса.Пользователь+" для перепродажи запасных частей между организациями";
	//Бондаренко++ 20190502
	ПоступлениеОбъект.СформированАвтоматически=Истина;
	//Бондаренко-- 20190502
	
	ВремТЗ=РеализацияОбъект.Товары.Выгрузить();
	
	//Бондаренко++ 20210809
	ЗаполнитьБазовоеКоличество = Ложь;
 	Если НЕ обЗначениеНеЗаполнено(СчетФактураОбъект) Тогда
 		ВремТЗ=СчетФактураОбъект.Товары.Выгрузить();
		ЗаполнитьБазовоеКоличество = Истина;
   	КонецЕсли; 
	//Бондаренко-- 20210809
 	
	ПоступлениеОбъект.Товары.Загрузить(ВремТЗ);
	
	//Бондаренко++ 20210809
 	Если ЗаполнитьБазовоеКоличество Тогда
		Для каждого Стр Из ПоступлениеОбъект.Товары Цикл
 			Стр.КоличествоБазовое = Стр.Количество * Стр.Коэффициент;
  		КонецЦикла; 
	КонецЕсли; 
	//Бондаренко-- 20210809
 	
	ЕстьОшибки=Ложь;
	
	Попытка
		ПоступлениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить(ОписаниеОшибки());
		ЕстьОшибки=Истина;
	КонецПопытки;
	
	Если ЕстьОшибки Тогда
		Сообщить("ОШИБКА! Поступление товаров для перепродажи не сформирована.",СтатусСообщения.ОченьВажное);
		Возврат ЕстьОшибки;
	КонецЕсли; 
	
	Сообщить("Сформирован документ: "+ПоступлениеОбъект,СтатусСообщения.Информация);
	
	
	//Бондаренко-- 20180830	 
	//==================================================================
	
	
	Если ПоступлениеОбъект.Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
		
		ЗафиксироватьТранзакцию();
		НачатьТранзакцию();
		
		КорректировкаПоступленияОбъект = Документы.КорректировкаПоступления.СоздатьДокумент();
		
		//Бондаренко++ 20181003
		КорректировкаПоступленияОбъект.ДублиНоменклатурыДопустимы = Истина;
		//Бондаренко-- 20181003
		
		КорректировкаПоступленияОбъект.Автор = ПараметрыСеанса.Пользователь;
		КорректировкаПоступленияОбъект.РегламентированныйУчет = Истина;
		КорректировкаПоступленияОбъект.Дата = ТекущаяДата();
		КорректировкаПоступленияОбъект.УстановитьНовыйНомер();
		КорректировкаПоступленияОбъект.ХозОперация = Справочники.ХозОперации.КорректировкаПоступленияИсправлениеВПервичныхДокументах;
		КорректировкаПоступленияОбъект.ДокументОснование = ПоступлениеОбъект.Ссылка;
		
		КорректировкаПоступленияОбъект.СкладКомпании=ПоступлениеОбъект.СкладКомпании;
		КорректировкаПоступленияОбъект.ОбработкаРеквизита("СкладКомпании");
		
		КорректировкаПоступленияОбъект.Организация = ПоступлениеОбъект.Организация;
		КорректировкаПоступленияОбъект.ОбработкаРеквизита("Организация");
		
		КорректировкаПоступленияОбъект.ПодразделениеКомпании = ПоступлениеОбъект.ПодразделениеКомпании;
		КорректировкаПоступленияОбъект.ОбработкаРеквизита("ПодразделениеКомпании");
		
		
		КорректировкаПоступленияОбъект.КурсДокумента = 1;
		КорректировкаПоступленияОбъект.КурсВалютыВзаиморасчетов = 1;
		КорректировкаПоступленияОбъект.КурсВалютыУпр = 1;
		
		КорректировкаПоступленияОбъект.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		КорректировкаПоступленияОбъект.ОбработкаРеквизита("ВалютаДокумента");
		
		//КорректировкаПоступленияОбъект.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН",ТоварыКПродаже[0].ИНН_Продавца);
		КорректировкаПоступленияОбъект.Контрагент = ПоступлениеОбъект.Контрагент;
		КорректировкаПоступленияОбъект.ОбработкаРеквизита("Контрагент");
		
		//ПараметрыДоговора = Новый Структура;
		//ПараметрыДоговора.Вставить("Контрагент",КорректировкаПоступленияОбъект.Контрагент);
		//ПараметрыДоговора.Вставить("ВидДоговора",Перечисления.ВидыДоговоров.Покупка);
		//ПараметрыДоговора.Вставить("Организация",КорректировкаПоступленияОбъект.Организация);
		//ПараметрыДоговора.Вставить("Подразделение",КорректировкаПоступленияОбъект.ПодразделениеКомпании);
		//
		//КорректировкаПоступленияОбъект.ДоговорВзаиморасчетов = НайтиДоговор(ПараметрыДоговора);
		КорректировкаПоступленияОбъект.ДоговорВзаиморасчетов = ПоступлениеОбъект.ДоговорВзаиморасчетов;
		КорректировкаПоступленияОбъект.ОбработкаРеквизита("ДоговорВзаиморасчетов");	
		
		КорректировкаПоступленияОбъект.Автор = ПараметрыСеанса.Пользователь;
		КорректировкаПоступленияОбъект.ТипЦен=ПоступлениеОбъект.ТипЦен;
		КорректировкаПоступленияОбъект.Комментарий = "Создан автоматически "+ТекущаяДата()+" пользователем "+ПараметрыСеанса.Пользователь+" для перепродажи запасных частей между организациями";
		//Бондаренко++ 20190502
		КорректировкаПоступленияОбъект.СформированАвтоматически=Истина;
		//Бондаренко-- 20190502
		
		ВремТЗ=РеализацияОбъект.Товары.Выгрузить();
		
		КорректировкаПоступленияОбъект.Товары.Загрузить(ВремТЗ);
		
		НомСтр = 0;
		
		Для каждого Стр Из КорректировкаПоступленияОбъект.Товары Цикл
			
			Стр.КоличествоПоДокументуРеализации = Стр.Количество;
			Стр.КоличествоДоКорректировки       = Стр.Количество;
			
			Стр.КоэффициентПоДокументуРеализации = Стр.Коэффициент;
			Стр.КоэффициентПоДокументуРеализации = Стр.Коэффициент;
			
			Стр.ЕдиницаИзмеренияПоДокументуРеализации = Стр.ЕдиницаИзмерения;
			
			Стр.СтавкаНДСПоДокументуРеализации = Стр.СтавкаНДС;
			
			Стр.СуммаВсегоДоКорректировки = Стр.СуммаВсего;
			Стр.СуммаВсегоПоДокументуРеализации = Стр.СуммаВсего;
			
			Отбор = Новый Структура();
			Отбор.Вставить("Номенклатура",Стр.Номенклатура);
			СтрокиСебест = ТЗ_Себест.НайтиСтроки(Отбор);
			
			//Бондаренко++ 20181004
			ЦенаСебест = ТЗ_Себест[НомСтр].СуммаУпр;
			Если ТЗ_Себест[НомСтр].Количество > 0 Тогда
				ЦенаСебест = ТЗ_Себест[НомСтр].СуммаУпр / ТЗ_Себест[НомСтр].Количество;
			КонецЕсли;
			
			//Бондаренко++ 20190426
			ЦенаРеал = 0;
			Отбор = Новый Структура();
			Отбор.Вставить("Номенклатура",Стр.Номенклатура);
			СтрокиСебест = ВремТЗ.НайтиСтроки(Отбор);
			ЦенаРеал = ВремТЗ[НомСтр].Цена*20;
			Если ЦенаРеал > 0 Тогда
				ЦенаСебест = Мин(ЦенаСебест,ЦенаРеал);
			КонецЕсли; 
			//Бондаренко-- 20190426
			
			НомСтр = НомСтр + 1;
			
			Если СтрокиСебест.Количество() > 0 Тогда
				Стр.Сумма = ЦенаСебест*Стр.Количество;
				Стр.СуммаВсего =  ЦенаСебест*Стр.Количество;
			Иначе
				Стр.Сумма = 100*Стр.СуммаВсего/5;
				Стр.СуммаВсего = 100*Стр.СуммаВсего/5;
			КонецЕсли; 
			//Бондаренко++ 20181004 
			
			Стр.СуммаВсегоРазница = Стр.СуммаВсего-Стр.СуммаВсегоПоДокументуРеализации;
			
			Если Стр.Коэффициент>0 Тогда
				Если Стр.Количество>0 Тогда
					Стр.Цена = Стр.СуммаВсего/(Стр.Количество*Стр.Коэффициент);
				Иначе
					Стр.Цена = (100*Стр.СуммаВсего/5);	
				КонецЕсли; 
			Иначе
				Стр.Цена = (100*Стр.СуммаВсего/5);	
			КонецЕсли;
			
			Стр.СуммаНДСПоДокументуРеализации = Стр.СуммаНДС;
			Стр.СуммаНДСДоКорректировки =  Стр.СуммаНДС;
			Стр.СуммаНДС =  Стр.СуммаВсего*Стр.СтавкаНДС.Ставка/(100+Стр.СтавкаНДС.Ставка);
			
		КонецЦикла; 
		
		//Форма = КорректировкаПоступленияОбъект.ПолучитьФорму("ФормаДокумента");
		//Если НЕ Форма.Открыта() Тогда
		//	Форма.ОткрытьМодально();
		//КонецЕсли;
		
		ЕстьОшибки=Ложь;
		
		Попытка
			КорректировкаПоступленияОбъект.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			#Если НаКлиенте Тогда
				Сообщить(ОписаниеОшибки());
			#КонецЕсли
			ЕстьОшибки=Истина;
		КонецПопытки;
		
		Попытка
			КорректировкаПоступленияОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			#Если НаКлиенте Тогда
				Сообщить(ОписаниеОшибки());
			#КонецЕсли
			ЕстьОшибки=Истина;
		КонецПопытки;
		
		Если ЕстьОшибки Тогда
			#Если НаКлиенте Тогда
				Сообщить("ОШИБКА! Корректировка поступления товаров для перепродажи не сформирована.",СтатусСообщения.ОченьВажное);
			#КонецЕсли 
			
			Попытка
				ПоступлениеОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Исключение
				Сообщить(ОписаниеОшибки());
				ЕстьОшибки=Истина;
			КонецПопытки;
			
			Попытка
				РеализацияОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Исключение
				Сообщить(ОписаниеОшибки());
				ЕстьОшибки=Истина;
			КонецПопытки;
			
			Попытка
				СчетФактураОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Исключение
				Сообщить(ОписаниеОшибки());
				ЕстьОшибки=Истина;
			КонецПопытки;
			
			Возврат ЕстьОшибки;
		КонецЕсли; 
		
		#Если НаКлиенте Тогда
			Сообщить("Сформирован документ: "+КорректировкаПоступленияОбъект,СтатусСообщения.Информация);
		#КонецЕсли
		
	КонецЕсли; 
	//==================================================================
	//Бондаренко-- 20180830	
	
	
	Если НЕ ФормироватьСФ Тогда
		Возврат ЕстьОшибки;
		// Если не было счет-фактуры выданной, то счет-фактуры полученнной также быть не должно;
	КонецЕсли;	
	
	//ФормироватьСФполуч = Истина;
	//
	//  Если ЗначениеЗаполнено(РеализацияОбъект.Организация) Тогда
	//	Если ПоступлениеОбъект.Организация.ОсвобожденОтНДС Тогда
	//		ФормироватьСФполуч = Ложь;
	//  	КонецЕсли; 
	//КонецЕсли; 
	
	Если ФормироватьСФ Тогда
		
		СчетФактураПолученныйОбъект = Документы.СчетФактураПолученный.СоздатьДокумент();
		СчетФактураПолученныйОбъект.ОбработкаЗаполнения(ПоступлениеОбъект.Ссылка);
		//Бондаренко++ 20190502
		СчетФактураПолученныйОбъект.СформированАвтоматически=Истина;
		//Бондаренко-- 20190502
		
		ЕстьОшибки=Ложь;
		Попытка
			СчетФактураПолученныйОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить(ОписаниеОшибки());
			ЕстьОшибки=Истина;
		КонецПопытки;	
		
		Если ЕстьОшибки Тогда
			Сообщить("ОШИБКА! СчетФактура полученный для перепродажи не сформирована.",СтатусСообщения.ОченьВажное);
			Возврат ЕстьОшибки;
		КонецЕсли; 
		
		Сообщить("Сформирован документ: "+СчетФактураПолученныйОбъект,СтатусСообщения.Информация);
		
	КонецЕсли;
	
	//Бондаренко++ 20190913
	Если Ссылка.ДокументОснование.ОптоваяПродажа Тогда
		Если Не обЗначениеНеЗаполнено(ПоступлениеОбъект) Тогда
			Попытка	
				ПоступлениеОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Исключение	
				ЕстьОшибки = Истина; 
			КонецПопытки;
		КонецЕсли;
		Если ФормироватьСФ Тогда
			Попытка	
				СчетФактураПолученныйОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);   
			Исключение	
				ЕстьОшибки = Истина; 
			КонецПопытки;
		КонецЕсли; 
		Если ПоступлениеОбъект.Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
			Попытка	
				КорректировкаПоступленияОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);   
			Исключение	
				ЕстьОшибки = Истина; 
			КонецПопытки;
		КонецЕсли; 
	КонецЕсли; 
	//Бондаренко-- 20190913
	
	Возврат ЕстьОшибки;
	
КонецФункции

Процедура СформироватьПерепродажу(ВопросОПеремещении=Истина,ВозврЗначение) Экспорт
	
	Если ВопросОПеремещении Тогда
		#Если НаКлиенте Тогда
			Если Вопрос("Сформировать перепродажу между юридическими лицами компании?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
				Возврат;
			КонецЕсли;
		#КонецЕсли
	КонецЕсли;
	
	ТоварыКПродаже = Новый ТаблицаЗначений;
	ТоварыКПродаже.Колонки.Добавить("Товар");
	ТоварыКПродаже.Колонки.Добавить("Количество");
	ТоварыКПродаже.Колонки.Добавить("Цена");
	ТоварыКПродаже.Колонки.Добавить("СуммаВсего");
	ТоварыКПродаже.Колонки.Добавить("ЕдиницаИзмерения");
	ТоварыКПродаже.Колонки.Добавить("ОрганизацияПоставщик");
	ТоварыКПродаже.Колонки.Добавить("ПодразделениеПоставщик");
	ТоварыКПродаже.Колонки.Добавить("СкладОтправитель");
	ТоварыКПродаже.Колонки.Добавить("ИНН_Покупателя");
	ТоварыКПродаже.Колонки.Добавить("ИНН_Продавца");
	
	СЗ_СкладовОтправителей = Новый СписокЗначений;
	
	Для Каждого стр из Товары Цикл
		
		Если обЗначениеНеЗаполнено(стр.СкладыКомпании) Тогда
			Продолжить;
		КонецЕсли; 
		
		СтрокаТоварыКПродаже = ТоварыКПродаже.Добавить();
		
		СтрокаТоварыКПродаже.Товар = стр.Номенклатура;
		СтрокаТоварыКПродаже.Количество = стр.Количество;
		
		СтрокаТоварыКПродаже.Цена = стр.Цена;
		СтрокаТоварыКПродаже.СуммаВсего = стр.СуммаВсего;
		
		//СтрокаТоварыКПродаже.ЗН = Ссылка.Ссылка;
		СтрокаТоварыКПродаже.ЕдиницаИзмерения = стр.ЕдиницаИзмерения;
		СтрокаТоварыКПродаже.ОрганизацияПоставщик = стр.СкладыКомпании.Организация;
		СтрокаТоварыКПродаже.ПодразделениеПоставщик = стр.СкладыКомпании.Подразделение;
		СтрокаТоварыКПродаже.СкладОтправитель = стр.СкладыКомпании;
		СтрокаТоварыКПродаже.ИНН_Покупателя = Ссылка.ПодразделениеОтправитель.Организация.ИНН;
		СтрокаТоварыКПродаже.ИНН_Продавца = стр.СкладыКомпании.Организация.ИНН; 
		
		Если СЗ_СкладовОтправителей.НайтиПоЗначению(стр.СкладыКомпании)=Неопределено Тогда
			СЗ_СкладовОтправителей.Добавить(стр.СкладыКомпании);
		КонецЕсли; 
		
	КонецЦикла;	
	
	//ТоварыКПродаже.ВыбратьСтроку();
	
	БылиОшибки = Истина;  
	
	Если ТоварыКПродаже.Количество() > 0 тогда
		НачатьТранзакцию();
		Для каждого ЗначениеСклада Из СЗ_СкладовОтправителей Цикл
			БылиОшибки = СоздатьДокументыПерепродажиПоЮрЛицам(ТоварыКПродаже,ЗначениеСклада.Значение);
		КонецЦикла; 
		ЗафиксироватьТранзакцию();
	КонецЕсли; 
	
	Если БылиОшибки Тогда
		Сообщить("Обработка по перепродаже завершена С ошибками",СтатусСообщения.ОченьВажное);
		ВозврЗначение=Ложь;
	Иначе	
		Сообщить("Обработка по перепродаже завершена БЕЗ ошибок.",СтатусСообщения.Обычное);	
		ВозврЗначение=Истина;
	КонецЕсли; 
	
КонецПроцедуры	
//Бондаренко--20181101

//Бондаренко++ 20200317
Процедура ОбработкаПроведения(Отказ, Режим)
	 
	// регистр ЗаказыПокупателей Расход
	Если ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровОптНаЭкспедитора Тогда
		Движения.ЗаказыПокупателей.Очистить();
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Движение = Движения.ЗаказыПокупателей.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Контрагент = ТекСтрокаТовары.ПодразделенияПолучатели;
			Движение.Заказ = ТекСтрокаТовары.ЗаказПокупателя;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
			Движение.СкладКомпании = ТекСтрокаТовары.СкладыКомпании;
			Движение.Заказано = ТекСтрокаТовары.Количество*ТекСтрокаТовары.Коэффициент;
			Движение.Резерв = ТекСтрокаТовары.Количество*ТекСтрокаТовары.Коэффициент;
			Движение.РезервСвободный = ТекСтрокаТовары.Количество*ТекСтрокаТовары.Коэффициент;
			Движение.Сумма = ТекСтрокаТовары.Сумма;
			Движение.ХозОперация = Справочники.ХозОперации.ЗаказРезервированиеВнутренние;
			Движение.ВидОперации=Перечисления.ВидыОперацийЗаказов.ЗаказСРезервированием;
		КонецЦикла;
	Иначе
		//Движения.ЗаказыРаспределение.Очистить();
		//Для каждого ТекСтрокаТовары Из Товары Цикл
		//    Движение = Движения.ЗаказыРаспределение.Добавить();
		//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		//	Движение.Период = Дата;
		//    Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		//    Движение.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
		//	Движение.ЗаказПокупателя=ТекСтрокаТовары.ЗаказПокупателя;
		//	Движение.ЗаказПоставщика=ТекСтрокаТовары.ЗаказПокупателя;
		//	Движение.Количество = ТекСтрокаТовары.Количество*ТекСтрокаТовары.Коэффициент;
		//	Движение.ХозОперация = Перечисления.ВидыОперацийЗаказов.ЗаказСРезервированием;
		//КонецЦикла; 
	КонецЕсли; 
 
	// регистр остатки Расход и Приход
	Движения.ОстаткиТоваровКомпании.Очистить();
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваровКомпании.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
  		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
 		Движение.СкладКомпании = ТекСтрокаТовары.СкладыКомпании;
 		Движение.Количество = ТекСтрокаТовары.Количество*ТекСтрокаТовары.Коэффициент;
		Движение.Резерв = ТекСтрокаТовары.Количество*ТекСтрокаТовары.Коэффициент;
 		Движение.ХозОперация = Хозоперация;
		
		Движение = Движения.ОстаткиТоваровКомпании.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
  		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
 		Движение.СкладКомпании = ТекСтрокаТовары.СкладыПолучатели;
 		Движение.Количество = ТекСтрокаТовары.Количество*ТекСтрокаТовары.Коэффициент;
		Если ХозОперация=Справочники.ХозОперации.ПеремещениеТоваровОптНаЭкспедитора Тогда
			Движение.Резерв = ТекСтрокаТовары.Количество*ТекСтрокаТовары.Коэффициент;
 		КонецЕсли; 
 		Движение.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровОптНаэкспедитора;
	КонецЦикла;
	
	//Движения.ПартииТоваровКомпании.Очистить();
	//Таблица_Товары = Товары.Выгрузить();
	//Таблица_Товары.Свернуть("Номенклатура,СкладыКомпании","КоличествоБазовое");
	
	Движения.ПартииТоваровКомпании.Очистить();
	Движения.Записать();
	СуммаДокумента = 0;
			
	ТЗ_ТоварыДока = Новый ТаблицаЗначений;
	ТЗ_ТоварыДока = ПолучитьТаблицуТоваров();
	//ТЗ_ТоварыДока.ВыбратьСтроку("Это таблица товаров");
	
	СЗ_Товаров = Новый СписокЗначений; 
	СЗ_Складов = Новый СписокЗначений;
	
	СЗ_Товаров.ЗагрузитьЗначения(Ссылка.Товары.ВыгрузитьКолонку("Номенклатура"));
	СЗ_Складов.ЗагрузитьЗначения(Ссылка.Товары.ВыгрузитьКолонку("СкладыКомпании"));
	
	ТЗ_партий = Новый ТаблицаЗначений;
	ТЗ_партий = ПолучитьТаблицуОстатковПартий(СЗ_Товаров,СЗ_Складов);
	//ТЗ_партий.ВыбратьСтроку("Это таблица партий");
	
	//ТЗ_ТоварыДока = Товары.Выгрузить();
	//ТЗ_ТоварыДока.Колонки.Добавить("КоличествоБазовое");
	//Для каждого Стр Из ТЗ_ТоварыДока Цикл
	//	Стр.КоличествоБазовое = Стр.Количество*Стр.Коэффициент;
	//КонецЦикла; 
	//ТЗ_ТоварыДока.Свернуть("Номенклатура","КоличествоБазовое");
	
	СуммаДокумента = 0;
	
	Для Каждого ТекСтрокаТовары Из ТЗ_ТоварыДока Цикл
		
		ТекНоменклатура = ТекСтрокаТовары.Номенклатура;
		ТекСкладКомпании = ТекСтрокаТовары.СкладКомпании;
		ТребуетсяКол = ТекСтрокаТовары.КоличествоБазовое;
		ТекСкладПолучатель = ТекСтрокаТовары.СкладПолучатель;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",ТекНоменклатура);
		Отбор.Вставить("СкладКомпании",ТекСкладКомпании);
		
		НайдСтроки = ТЗ_партий.НайтиСтроки(Отбор);
		
		ВсегоВналичии = 0;
		Для Каждого СтрокаМассива Из НайдСтроки Цикл
			ВсегоВналичии = ВсегоВналичии + СтрокаМассива.КоличествоОстаток;
		КонецЦикла;
		
		Если ТребуетсяКол > ВсегоВналичии Тогда
			Сообщить("Номенклатуры ["+ТекНоменклатура.Артикул+"] "+ТекНоменклатура+" cписывается по регистру 'Партии товаров' "+ТребуетсяКол+", а в наличии по этому регистру "+ВсегоВналичии);	
	 		Отказ = Истина;
			Прервать;
		КонецЕсли;	
		
		Для каждого Эл из НайдСтроки Цикл
			Движение = Движения.ПартииТоваровКомпании.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.ДокументПродажи = Ссылка;
			Движение.СкладКомпании = ТекСтрокаТовары.СкладКомпании;
 			Движение.Партия = Эл.Партия;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.ХозОперация = ХозОперация;
 			Движение.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
			Движение.Количество = Мин(ТребуетсяКол,Эл.КоличествоОстаток);
			//Движение.ДокументПродажи = Ссылка;
			Если ТребуетсяКол >= Эл.КоличествоОстаток Тогда
				Движение.Сумма = Эл.СуммаОстаток;
				Движение.СуммаУпр = Движение.Сумма;
				Движение.СуммаНДС = Движение.СтавкаНДС.Ставка*Движение.Сумма/(Движение.СтавкаНДС.Ставка+100);
			Иначе
				Если Эл.КоличествоОстаток > 0 Тогда
					Движение.Сумма = Эл.СуммаОстаток*Движение.Количество/Эл.КоличествоОстаток;
					Движение.СуммаУпр = Движение.Сумма;
					Движение.СуммаНДС = Движение.СтавкаНДС.Ставка*Движение.Сумма/(Движение.СтавкаНДС.Ставка+100);
 				Иначе
					Движение.Сумма = 0;
					Движение.СуммаУпр = 0;
					Движение.СуммаНДС = 0;
				КонецЕсли;
			КонецЕсли;
			
			Движение = Движения.ПартииТоваровКомпании.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.ДокументПродажи = Ссылка;
			Движение.СкладКомпании = ТекСтрокаТовары.СкладПолучатель;
 			Движение.Партия = Эл.Партия;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.ХозОперация = ХозОперация;
 			Движение.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
			Движение.Количество = Мин(ТребуетсяКол,Эл.КоличествоОстаток);
			//Движение.ДокументПродажи = Ссылка;
			Если ТребуетсяКол >= Эл.КоличествоОстаток Тогда
				Движение.Сумма = Эл.СуммаОстаток;
				Движение.СуммаУпр = Движение.Сумма;
				Движение.СуммаНДС = Движение.СтавкаНДС.Ставка*Движение.Сумма/(Движение.СтавкаНДС.Ставка+100);
			Иначе
				Если Эл.КоличествоОстаток > 0 Тогда
					Движение.Сумма = Эл.СуммаОстаток*Движение.Количество/Эл.КоличествоОстаток;
					Движение.СуммаУпр = Движение.Сумма;
					Движение.СуммаНДС = Движение.СтавкаНДС.Ставка*Движение.Сумма/(Движение.СтавкаНДС.Ставка+100);
 				Иначе
					Движение.Сумма = 0;
					Движение.СуммаУпр = 0;
					Движение.СуммаНДС = 0;
				КонецЕсли;
			КонецЕсли;

			
			СуммаДокумента = СуммаДокумента + Число(Эл.СуммаОстаток);
			ТребуетсяКол = ТребуетсяКол - Движение.Количество;
			Если ТребуетсяКол <= 0 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	//Если НЕ Отказ Тогда
	// 	тКэшСуммСписания = Неопределено;
	//	СуммаДокумента = РассчитатьСуммуВсего();
	//	//ЭтотОбъект.СуммаДокумента= СуммаДокумента;
	//	ФлагПерерасчет = Истина;
	//КонецЕсли;
	
	// если модифицировали документ, то запишем его
	Если НЕ Отказ И Модифицированность() Тогда
		Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
	// выведем сообщения об ошибках и предупреждениях
	//дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
	
КонецПроцедуры
//Бондаренко--20181101

//Бондаренко++ 20200317
Функция ПолучитьТаблицуТоваров()
	
	ТекстЗапроса="ВЫБРАТЬ
	             |	ПеремещениеТоваровОпт.Номенклатура КАК Номенклатура,
	             |	ПеремещениеТоваровОпт.КоличествоБазовое,
	             |	ПеремещениеТоваровОпт.СкладыКомпании КАК СкладКомпании,
	             |	ПеремещениеТоваровОпт.СкладыПолучатели КАК СкладПолучатель
	             |ИЗ
	             |	Документ.ПеремещениеТоваровОпт.Товары КАК ПеремещениеТоваровОпт
	             |ГДЕ
	             |	ПеремещениеТоваровОпт.Ссылка = &Ссылка";

	Запрос=Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст=ТекстЗапроса;

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьТаблицуОстатковПартий(СЗ_Товаров,СЗ_Складов)
	
	ТекстЗапроса="ВЫБРАТЬ
	             |	ПартииТоваров.Номенклатура КАК Номенклатура,
	             |	ПартииТоваров.Партия КАК Партия,
	             |	ПартииТоваров.КоличествоОстаток КАК КоличествоОстаток,
	             |	ПартииТоваров.СуммаОстаток КАК СуммаОстаток,
	             |	ПартииТоваров.Партия.Дата КАК ПартияДата,
	             |	ПартииТоваров.СкладКомпании КАК СкладКомпании
	             |ИЗ
	             |	РегистрНакопления.ПартииТоваровКомпании.Остатки(
	             |			&МоментВремени,
	             |			Номенклатура В (&ВыбСписокНоменклатура)
	             |				И СкладКомпании В (&ВыбСписокСкладов)) КАК ПартииТоваров
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ПартияДата";

	Запрос=Новый Запрос();
	Запрос.УстановитьПараметр("МоментВремени",?(обЗначениеНеЗаполнено(Ссылка.Дата),ТекущаяДата(),Ссылка.Дата));
	Запрос.УстановитьПараметр("ВыбСписокНоменклатура",СЗ_Товаров);
	Запрос.УстановитьПараметр("ВыбСписокСкладов",СЗ_Складов);
	Запрос.Текст=ТекстЗапроса;

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
//Бондаренко-- 20200317


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

Если ТипЗнч(ПодразделениеОтправитель) = Тип("СправочникСсылка.СкладыКомпании") Тогда
	ЭтоПодразделениеОтправитель = Ложь;
Иначе
	ЭтоПодразделениеОтправитель = Истина;
КонецЕсли;


// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
	Права = глПрава;
#КонецЕсли
ФлагПерерасчет = Ложь;