Процедура ЗаполнитьСервис4Плюс() Экспорт
	
	
	Элемент = Справочники.Renault_АкцииИСкидки.Сервис4Плюс.ПолучитьОбъект();
	Элемент.ВозрастАвтоОт = 48;
	Элемент.ДляВсехАвторабот = Истина;
	Элемент.ДляВсехМоделейАвто = Истина;
	Элемент.АкцияОтRenault = Истина;
	Элемент.АкцияАктуальна = Истина;
	Элемент.ВидАкции = Перечисления.Renault_ВидыАкций.Глобальная;
	Элемент.ПроцентСкидки = 20;
	Элемент.Записать();

	
КонецПроцедуры
	

Функция АкцияПрименимаКАвтоработе(АкцияСсылка,АвтоработаСсылка) Экспорт
	Рез = Истина;
	Если АкцияСсылка = Справочники.Renault_АкцииИСкидки.Сервис4Плюс.Ссылка Тогда
		// Для акций сервис 4+ скидка не применима к комплекс-сервисам Эконом и Motrio
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Renault_КомплексСервисыАвторабот.Ссылка,
		               |	Renault_КомплексСервисыАвторабот.Авторабота,
		               |	Renault_КомплексСервисыАвторабот.Артикул КАК Артикул,
		               |	Renault_КомплексСервисыАвторабот.Наименование КАК Наименование
		               |ИЗ
		               |	Справочник.Renault_КомплексСервисыАвторабот КАК Renault_КомплексСервисыАвторабот
		               |ГДЕ
		               |	Renault_КомплексСервисыАвторабот.Авторабота = &Авторабота
		               |	И Renault_КомплексСервисыАвторабот.ПометкаУдаления = ЛОЖЬ";
		Запрос.УстановитьПараметр("Авторабота", АвтоработаСсылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Найти(ВРег(Выборка.Артикул),"MOT")>0 Тогда
				Рез = Ложь;
			КонецЕсли;
			Если Найти(ВРег(Выборка.Наименование),"ЭКОНОМ")>0 Тогда
				Рез = Ложь;
			КонецЕсли;
			Если Найти(ВРег(Выборка.Наименование),"MOTRIO")>0 Тогда
				Рез = Ложь;
			КонецЕсли;

		КонецЦикла;
	
	КонецЕсли;
	
	Возврат Рез;
КонецФункции