
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
	//Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СтоимостьВсего = 0;
	
	Для Каждого Строка из Автоработы Цикл
		
		СтоимостьВсего = Строка.Стоимость * (100 - Строка.РазмерСкидки)/100 + СтоимостьВсего;
		
	КонецЦикла;
	
	Для Каждого Строка из Материалы Цикл
		
		СтоимостьВсего = Строка.Стоимость * (100 - Строка.РазмерСкидки)/100 + СтоимостьВсего;
		
	КонецЦикла;
	
	СтоимостьВсехРаботПоАкции = СтоимостьВсего;
	
	АкцияАктуальна = Истина;
	
	Если Не ЗначениеЗаполнено(ВидАкции) Тогда
		ВидАкции = Перечисления.Renault_ВидыАкций.Локальная;
	КонецЕсли;
	АкциюОставитьАктуальной = Истина;
	Если ЗначениеЗаполнено(ОкончаниеАкции) Тогда
		Если ТекущаяДата() > ОкончаниеАкции Тогда
			АкциюОставитьАктуальной = ложь;
		КонецЕсли;
	КонецЕсли;
	Если АкциюОставитьАктуальной = ложь Тогда
		АкцияАктуальна = Ложь;
	КонецЕсли;
	Если ВидАкции = Перечисления.Renault_ВидыАкций.Локальная Тогда
		Если Не ЗначениеЗаполнено(ДилерскийЦентр) Тогда
			ДилерскийЦентр = Renault_РаботаСПравамиПользователя.ДилерскийЦентрПоУмолчанию(ПараметрыСеанса.Пользователь);
		КонецЕсли;
		
	КонецЕсли;
	
	Наименование = СтрЗаменить(Наименование, "'", ""); 	
	Наименование = СтрЗаменить(Наименование,Символ(34), "");
	Наименование = СтрЗаменить(Наименование,"-", "");
	
	ОписаниеАкции = СтрЗаменить(ОписаниеАкции, "'", "");
	ОписаниеАкции = СтрЗаменить(ОписаниеАкции, Символ(34), "");
	ОписаниеАкции = СтрЗаменить(ОписаниеАкции, Символы.ПС, "");
	ОписаниеАкции = СтрЗаменить(ОписаниеАкции, "-", "");
	ОписаниеАкции = СтрЗаменить(ОписаниеАкции, ".", "");
	
	МаркетиноговоеНаименование = СтрЗаменить(МаркетиноговоеНаименование, "'", "");
	МаркетиноговоеНаименование = СтрЗаменить(МаркетиноговоеНаименование, Символ(34), "");
	
КонецПроцедуры  

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры