//Предназначена для выбора одного или нескольких значений из списка выбора
// представленный строкой, списком выбора или массивом
// Параметры:  - структура с элементами 
//	Список - тип: СписокЗначений
//	Групповой - признак того, что значение может содержать несколько строк
//  ТекущееЗначение 
//		Еели групповой - аналогичны СпискуЗначений, но не содержат представлений
//		Иначе - значение
//	Заголовок
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список=Параметры.СписокЗначений;

	Если Параметры.Свойство("Заголовок") Тогда 
		ЭтаФорма.Заголовок=Параметры.Заголовок;
	КонецЕсли;
	
	Если Параметры.Свойство("ТекущаяСтрока") Тогда
		Элементы.Список.ТекущаяСтрока=Параметры.Текущаястрока;
	КонецЕсли;
		
	Групповой=Параметры.Групповой;
	Если Не Групповой Тогда
		Список.ЗаполнитьПометки(Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не Групповой Тогда
		Элементы.СписокВкл.Видимость=Ложь;
		Элементы.ПанельКоманд.Видимость=Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗначения(Команда)
	Если Групповой Тогда
		ЭтаФорма.Закрыть(Список);
	Иначе
		ЭтаФорма.Закрыть(Элементы.Список.ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДан=Элемент.ТекущиеДанные;
	Если Групповой Тогда
		ТекДан.Пометка=Не ТекДан.Пометка;
	Иначе
		ЭтаФорма.Закрыть(ТекДан);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолеПоискаПриИзменении(Элемент)
	Для Каждого Стр Из Список Цикл
		Если Стр.Представление=ПолеПоиска Тогда
			Элементы.Список.ТекущаяСтрока=Стр.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПолеПоискаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Стандартнаяобработка=Ложь;
	Длина=СтрДлина(Текст);
	ТекстПоиска=ВРЕГ(Текст);
	ДанныеВыбора=Новый СписокЗначений;
	Для Каждого Стр из Список Цикл
		Если Лев(Стр.Представление,Длина)=ТекстПоиска Тогда
			ДанныеВыбора.Добавить(Стр.Представление);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

