Процедура УстановитьСтатусЗаявки(КлиентскаяЗаявка, Статус) Экспорт 
	
	НаборЗаписей = РегистрыСведений.CRM_СтатусыКлиентскихЗаявок.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.КлиентскаяЗаявка.Установить(КлиентскаяЗаявка);
	
	НаборЗаписей.Прочитать();
	
	НовЗапись = НаборЗаписей.Добавить();
	
	НовЗапись.Период = ТекущаяДата();
	НовЗапись.КлиентскаяЗаявка = КлиентскаяЗаявка;
	НовЗапись.Статус = Статус;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ПолучитьСтатусЗаявки(КлиентскаяЗаявка) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_СтатусыКлиентскихЗаявокСрезПоследних.Статус
	|ИЗ
	|	РегистрСведений.CRM_СтатусыКлиентскихЗаявок.СрезПоследних(, КлиентскаяЗаявка = &КлиентскаяЗаявка) КАК CRM_СтатусыКлиентскихЗаявокСрезПоследних";
	
	Запрос.УстановитьПараметр("КлиентскаяЗаявка", КлиентскаяЗаявка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда 
	
		Возврат	Выборка.Статус;
		
	Иначе 
		
		Возврат Неопределено;
	
	КонецЕсли;
	
КонецФункции