//// Регистрация документов в плане обмена ОбменСЛоджикСтарс
////////////////////////////////////////////////////////////

Процедура РегистрацияИзмененныхДокументов(Источник, Отказ) Экспорт
	//Если Не СМ_УправлениеДоступом.ЭтоРабочаяБаза() Тогда
	//	Возврат;
	//КонецЕсли;

	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказНаряд") Тогда
		РегистрацияЗаказНаряда(Источник);
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваров") Тогда
		РегистрацияРеализацииТоваров(Источник);	
	КонецЕсли;	
КонецПроцедуры

Процедура РегистрацияЗаказНаряда(ЗаказНаряд)
	УзелОбмена = НайтиУзелОбменаДляЗН(ЗаказНаряд);
	
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, ЗаказНаряд);
	КонецЕсли;
КонецПроцедуры

Процедура РегистрацияРеализацииТоваров(Реализация)
	Если Не Реализация.Проведен Тогда
		Возврат;
	КонецЕсли;
	
	Если Реализация.ХозОперация <> Справочники.ХозОперации.РеализацияТоваров Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоПойменнаяЭксид = Реализация.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000235"); //Атлант Моторс ООО Пойменная
	ЭтоМалиновскогоЭксид = Реализация.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001717"); //Атлант Моторс ООО РМ43(EXEED)
	ЭтоШолоховаЧери = Реализация.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001502"); //Престиж Моторс ООО Шолохова 235 (CHERY)
	ЭтоВолгодонскЧери = Реализация.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000109"); //Престиж Моторс ООО Волгодонск Чери
	ЭтоШахтыДжейку = Реализация.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001657"); //Автопарк ООО ШД290(JAECOO)
	ЭтоШахтыОмода = Реализация.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001663"); //Автопарк ООО ШД290(OMODA)
	ЭтоАксайДжейку = Реализация.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001773"); //Автопарк ООО АП13(JAECOO)
	ЭтоАксайОмода = Реализация.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001774"); //Автопарк ООО АП13(OMODA)
	ЭтоВавиловаТенет = Реализация.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001707"); //Престиж Моторс ООО РВ59К(CHERY)
	
	Если ЭтоПойменнаяЭксид Тогда
		УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ПойменнаяЭксидПродажи");
		
	ИначеЕсли ЭтоМалиновскогоЭксид Тогда
		УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("МалиновскогоЭксидПродажи");		
		
	ИначеЕсли ЭтоШолоховаЧери Тогда
		УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ШолоховаЧериПродажи");
		
	ИначеЕсли ЭтоВолгодонскЧери Тогда
		УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ВолгодонскЧериПродажи");
		
	ИначеЕсли ЭтоШахтыДжейку Тогда
		УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ШахтыДжейкуПродажи");
		
	ИначеЕсли ЭтоШахтыОмода Тогда
		УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ШахтыОмодаПродажи");
		
	ИначеЕсли ЭтоАксайДжейку Тогда
		УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("АксайДжейкуПродажи");
		
	ИначеЕсли ЭтоАксайОмода Тогда
		УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("АксайОмодаПродажи");
		
	ИначеЕсли ЭтоВавиловаТенет Тогда
		УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ВавиловаТенетПродажи");
		
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, Реализация);
	КонецЕсли;
КонецПроцедуры

Функция НайтиУзелОбменаДляЗН(ЗаказНаряд, Синхронно = Ложь)
	Если Не ЗаказНаряд.Проведен Тогда
		Возврат ПланыОбмена.ОбменСЛоджикСтарс.ПустаяСсылка();
	КонецЕсли;
	
	НужноВыгружать = ЗаказНаряд.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт
		Или ЗаказНаряд.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен И ЗаказНаряд.ВидРемонта.ГарантияЗавода;
	Если Не НужноВыгружать Тогда
		Возврат ПланыОбмена.ОбменСЛоджикСтарс.ПустаяСсылка();
	КонецЕсли;
		
	Марка = ЗаказНаряд.Автомобиль.Модель.Марка;
	ЭтоЭксид = Марка = Справочники.Марка.EXEED Или Марка = Справочники.Марка.ESTEO;
	ЭтоЧери = Марка = Справочники.Марка.CHERY Или Марка = Справочники.Марка.TENET;
	ЭтоДжейку = Марка = Справочники.Марка.JAECOO Или Марка = Справочники.Марка.OMODA Или Марка = Справочники.Марка.JELAND;
	ЭтоОмода = Марка = Справочники.Марка.OMODA;
	ЭтоТенетПлюс = Марка = Справочники.Марка.TENET_Plus;
	
	Если ЭтоЭксид И Не Синхронно И ЗаказНаряд.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен Тогда
		Возврат ПланыОбмена.ОбменСЛоджикСтарс.ПустаяСсылка();
	КонецЕсли;
	
	мВидыРемонта = Новый Массив();
	мВидыРемонта.Добавить(Справочники.ВидыРемонта.ТехническоеОбслуживание);
	мВидыРемонта.Добавить(Справочники.ВидыРемонта.ГарантияПроизводителя);
	мВидыРемонта.Добавить(Справочники.ВидыРемонта.ТО_ноль);
	мВидыРемонта.Добавить(Справочники.ВидыРемонта.КоммерческийРемонт);
	мВидыРемонта.Добавить(Справочники.ВидыРемонта.ПредпродажнаяПодготовка);
	мВидыРемонта.Добавить(Справочники.ВидыРемонта.ТехническоеОбслуживаниеБесплатное);
	мВидыРемонта.Добавить(Справочники.ВидыРемонта.ТО_нольПлатный);
	мВидыРемонта.Добавить(Справочники.ВидыРемонта.РемонтДляСотрудников);
	мВидыРемонта.Добавить(Справочники.ВидыРемонта.Текущий);
	Если мВидыРемонта.Найти(ЗаказНаряд.ВидРемонта) = Неопределено Тогда
		Возврат ПланыОбмена.ОбменСЛоджикСтарс.ПустаяСсылка();
	КонецЕсли;
	
	ЭтоПойменнаяЭксид = ЗаказНаряд.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000235"); //Атлант Моторс ООО Пойменная
	ЭтоМалиновскогоЭксид = ЗаказНаряд.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001717"); //Атлант Моторс ООО РМ43(EXEED)
	ЭтоШолоховаЧери = ЗаказНаряд.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001502"); //Престиж Моторс ООО Шолохова 235 (CHERY)
	ЭтоВолгодонскЧери = ЗаказНаряд.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000109"); //Престиж Моторс ООО Волгодонск Чери
	ЭтоВавиловаТенет = ЗаказНаряд.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001707"); //Престиж Моторс ООО РВ59К(CHERY)
	ЭтоШахтыДжейку = ЗаказНаряд.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001657"); //Автопарк ООО ШД290(JAECOO)
	ЭтоШахтыОмода = ЗаказНаряд.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001663"); //Автопарк ООО ШД290(OMODA)
	ЭтоШахтыОлимп = ЗаказНаряд.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000167"); //Автопарк ООО Олимп
	ЭтоАксайДжейку = ЗаказНаряд.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001773"); //Автопарк ООО АП13(JAECOO)
	ЭтоАксайОмода = ЗаказНаряд.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001774"); //Автопарк ООО АП13(OMODA)
	ЭтоАксайТенетПлюс = ЗаказНаряд.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001788"); //Престиж Моторс ООО АП13(TENET+)
	
	Если ЭтоЭксид И ЭтоПойменнаяЭксид Тогда
		Возврат ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ПойменнаяЭксидППО");
		
	ИначеЕсли ЭтоЭксид И ЭтоМалиновскогоЭксид Тогда
		Возврат ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("МалиновскогоЭксидППО");	
		
	ИначеЕсли ЭтоЧери И ЭтоШолоховаЧери Тогда
		Возврат ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ШолоховаЧериППО");
		
	ИначеЕсли ЭтоЧери И ЭтоВавиловаТенет Тогда
		Возврат ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ВавиловаТенетППО");
		
	ИначеЕсли ЭтоЧери И ЭтоВолгодонскЧери Тогда
		Возврат ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ВолгодонскЧериППО");
		
	ИначеЕсли ЭтоДжейку И (ЭтоШахтыОлимп Или ЭтоШахтыДжейку Или ЭтоШахтыОмода) Тогда
		Возврат ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ШахтыДжейкуППО");
		
	ИначеЕсли ЭтоДжейку И (ЭтоАксайДжейку Или ЭтоАксайОмода) Тогда
		Возврат ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("АксайДжейкуППО");	
		
	ИначеЕсли ЭтоТенетПлюс И ЭтоАксайТенетПлюс Тогда
		Возврат ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("АксайТенетПлюсППО");
	
	Иначе
		Возврат ПланыОбмена.ОбменСЛоджикСтарс.ПустаяСсылка();
	КонецЕсли;
КонецФункции

//// Общие процедуры / функции для выгрузки данных на портал ЛоджикСтарс
/////////////////////////////////////////////////////////////////////

Функция ПолучитьСоединениеHTTP(УзелОбмена)
	Таймаут = 120;
	SSL = Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows(), Новый СертификатыУдостоверяющихЦентровWindows());
	Возврат Новый HTTPСоединение(УзелОбмена.Хост, , , , , Таймаут, SSL);
КонецФункции

Функция ПолучитьЗапросHTTP(УзелОбмена)
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Type", "application/json; charset=utf-8");
	ЗаголовкиHTTP.Вставить("Accept", "application/json");
	ЗаголовкиHTTP.Вставить("Connection", "Keep-Alive");
	
	Если ЗначениеЗаполнено(УзелОбмена.Токен) Тогда
		ЗаголовкиHTTP.Вставить("Authorization", "Bearer " + УзелОбмена.Токен);
		
	Иначе
		ВременныйФайл = ПолучитьИмяВременногоФайла();   
	    Запись = Новый ЗаписьТекста(ВременныйФайл, КодировкаТекста.UTF8);
	    Запись.Записать(УзелОбмена.Логин + ":" + УзелОбмена.Пароль);
	    Запись.Закрыть();    
	    ДвДанные = Новый ДвоичныеДанные(ВременныйФайл);
	    УдалитьФайлы(ВременныйФайл);	
		ЗаголовкиHTTP.Вставить("Authorization", "Basic " + Base64Строка(ДвДанные));	
	КонецЕсли;
	
	ЗапросHTTP = Новый HTTPЗапрос();
	ЗапросHTTP.Заголовки = ЗаголовкиHTTP;
	Возврат ЗапросHTTP;
КонецФункции

Функция ПравильныйАртикул(Артикул)
	Длина = СтрДлина(Артикул);
	Если Длина < 7 Или Длина > 16 Тогда
		Возврат Ложь;
	КонецЕсли;
	// усеченный вариант "0123456789ABCDEFGHJKLMNPRSTUVWXYZ"
	Для сч = 1 По Длина Цикл
		Если Найти("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ", Сред(Артикул, сч, 1)) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
		
	Возврат Истина;
КонецФункции

Процедура Пауза(Секунд = 1)
    scr = Новый COMОбъект("WScript.Shell");
    scr.Run("ping 127.0.0.1 -n " + СокрЛП(Секунд + 1), 0, 1);
КонецПроцедуры

Функция УдалитьТочку(Артикул)
	Если ТипЗнч(Артикул) <> Тип("Строка") Тогда
		Возврат "";
	КонецЕсли;
	
	Длина = СтрДлина(Артикул);
	Если Длина = 0 Тогда
		Возврат Артикул;
	КонецЕсли;
	
	Если Длина = 1 Тогда
		Если Артикул = "." Тогда
			Возврат "";
		Иначе
			Возврат Артикул;
		КонецЕсли;
	КонецЕсли;
	
	ПоследнийСимвол = Прав(Артикул, 1);
	Если ПоследнийСимвол = "." Тогда
		Возврат Лев(Артикул, Длина - 1);
	Иначе
		Возврат Артикул;
	КонецЕсли;
КонецФункции

//// Процедуры / функции для выгрузки данных по остаткам партий и продажам товаров на портал ЛоджикСтарс
/////////////////////////////////////////////////////////////////////////////////////////////////////////

Функция ПолучитьОстатки(НаДату, УзелОбмена)
	мМаркиАвтомобилей = Новый Массив();
	мМаркиАвтомобилей.Добавить(Справочники.Марка.CHERY);
	мМаркиАвтомобилей.Добавить(Справочники.Марка.EXEED);
	мМаркиАвтомобилей.Добавить(Справочники.Марка.ESTEO);
	мМаркиАвтомобилей.Добавить(Справочники.Марка.OMODA);
	мМаркиАвтомобилей.Добавить(Справочники.Марка.JAECOO);
	мМаркиАвтомобилей.Добавить(Справочники.Марка.TENET);
	мМаркиАвтомобилей.Добавить(Справочники.Марка.TENET_Plus);
	
	ЗапросОстатки = Новый Запрос();
	ЗапросОстатки.УстановитьПараметр("ДатаВыборки", КонецДня(НаДату));
	
	мПодразделения = Новый Массив();
	мПодразделения.Добавить(УзелОбмена.Подразделение);
	Если УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("АксайДжейкуПродажи") Тогда
		мПодразделения.Добавить(ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("АксайОмодаППО").Подразделение);
	КонецЕсли;
	ЗапросОстатки.УстановитьПараметр("ГруппаПодразделений", мПодразделения);
	
	Если мМаркиАвтомобилей.Найти(УзелОбмена.МаркаАвтомобиля) = Неопределено Тогда
		ЗапросОстатки.УстановитьПараметр("ГруппаПроизводителей", УзелОбмена.ГруппаПроизводителей);

	Иначе
		мПроизводители = Новый Массив();
		мПроизводители.Добавить(Справочники.Производители.CHERY);
		мПроизводители.Добавить(Справочники.Производители.EXEED);
		мПроизводители.Добавить(Справочники.Производители.OMODA);
		мПроизводители.Добавить(Справочники.Производители.JAECOO);
		мПроизводители.Добавить(Справочники.Производители.TENET);
		мПроизводители.Добавить(Справочники.Производители.TENET_PLUS);
		ЗапросОстатки.УстановитьПараметр("ГруппаПроизводителей", мПроизводители);
	КонецЕсли;
	
	ЗапросОстатки.Текст = 
	"ВЫБРАТЬ
	|	ПартииТоваровКомпанииОстатки.Номенклатура.Артикул КАК Артикул,
	|	СУММА(ПартииТоваровКомпанииОстатки.КоличествоОстаток) КАК Количество,
	|	СРЕДНЕЕ(ВЫБОР
	|			КОГДА ПартииТоваровКомпанииОстатки.КоличествоОстаток > 0
	|				ТОГДА ПартииТоваровКомпанииОстатки.СуммаОстаток / ПартииТоваровКомпанииОстатки.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СтоимостьЗаЕд
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании.Остатки(
	|			&ДатаВыборки,
	|			СкладКомпании.Подразделение В ИЕРАРХИИ (&ГруппаПодразделений)
	|				И Номенклатура.Производитель В ИЕРАРХИИ (&ГруппаПроизводителей)) КАК ПартииТоваровКомпанииОстатки
	|ГДЕ
	|	ПартииТоваровКомпанииОстатки.КоличествоОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииТоваровКомпанииОстатки.Номенклатура.Артикул";
		
	Если УзелОбмена.Код = "ШахтыДжейкуПродажи"  Или УзелОбмена.Код = "ШахтыОмодаПродажи" Тогда
		мСкладыOMODA = Новый Массив();
		мСкладыOMODA.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000005")); //Автопарк ООО (Олимп) Зап части Основной
		мСкладыOMODA.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000084")); //Автопарк ООО (Олимп) Витрина
		мСкладыOMODA.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ002139")); //Автопарк ООО (Олимп) Зап части кузовные
		мСкладыOMODA.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ002524")); //Автопарк ООО (Олимп Jaecoo) Зап части Основной
		мСкладыOMODA.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ002567")); //Автопарк ООО (Олимп Jaecoo) Витрина
		ЗапросОстатки.УстановитьПараметр("СписокСкладов", мСкладыOMODA);
		
		ЗапросОстатки.Текст = 
		"ВЫБРАТЬ
		|	ПартииТоваровКомпанииОстатки.Номенклатура.Артикул КАК Артикул,
		|	СУММА(ПартииТоваровКомпанииОстатки.КоличествоОстаток) КАК Количество,
		|	СРЕДНЕЕ(ВЫБОР
		|			КОГДА ПартииТоваровКомпанииОстатки.КоличествоОстаток > 0
		|				ТОГДА ПартииТоваровКомпанииОстатки.СуммаОстаток / ПартииТоваровКомпанииОстатки.КоличествоОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СтоимостьЗаЕд
		|ИЗ
		|	РегистрНакопления.ПартииТоваровКомпании.Остатки(
		|			&ДатаВыборки,
		|			СкладКомпании В (&СписокСкладов)
		|				И Номенклатура.Производитель В ИЕРАРХИИ (&ГруппаПроизводителей)) КАК ПартииТоваровКомпанииОстатки
		|ГДЕ
		|	ПартииТоваровКомпанииОстатки.КоличествоОстаток > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ПартииТоваровКомпанииОстатки.Номенклатура.Артикул";
	КонецЕсли;
	
	мОстатки = Новый Массив();
	ТаблицаНевыгруженных = ЗапросОстатки.Выполнить().Выгрузить();	
	Для Каждого СтрокаТаблицы Из ТаблицаНевыгруженных Цикл
		//Если Не ПравильныйАртикул(СтрокаТаблицы.Артикул) Тогда
		//	Продолжить;
		//КонецЕсли;
		
		стОстаток = Новый Структура();
		стОстаток.Вставить("Item", УдалитьТочку(СтрокаТаблицы.Артикул));		
		стОстаток.Вставить("Qnt", Окр(СтрокаТаблицы.Количество, 2));	
		стОстаток.Вставить("Price", Окр(СтрокаТаблицы.СтоимостьЗаЕд, 2));
		
		мОстатки.Добавить(стОстаток);
	КонецЦикла;

	Если мОстатки.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	стТелоЗапроса = Новый Структура();
	стТелоЗапроса.Вставить("DealerPointId", УзелОбмена.КодТочкиДилера);
	стТелоЗапроса.Вставить("PartsStock", мОстатки);
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	Попытка
		ЗаписатьJSON(ЗаписьJSON, стТелоЗапроса);
	Исключение
	#Если Клиент Тогда	
		Сообщить("Не удалось записать JSON-данные для выгрузки отчёта по остаткам!", СтатусСообщения.Внимание);
	#КонецЕсли
		Возврат "";
	КонецПопытки;
	
	ТелоЗапроса = ЗаписьJSON.Закрыть();
	Возврат ТелоЗапроса;
КонецФункции

Функция ПолучитьТоварыРеализации(РеализацияТоваров, УзелОбмена)
	мМаркиАвтомобилей = Новый Массив();
	мМаркиАвтомобилей.Добавить(Справочники.Марка.CHERY);
	мМаркиАвтомобилей.Добавить(Справочники.Марка.EXEED);
	мМаркиАвтомобилей.Добавить(Справочники.Марка.ESTEO);
	мМаркиАвтомобилей.Добавить(Справочники.Марка.OMODA);
	мМаркиАвтомобилей.Добавить(Справочники.Марка.JAECOO);
	мМаркиАвтомобилей.Добавить(Справочники.Марка.TENET);
	мМаркиАвтомобилей.Добавить(Справочники.Марка.TENET_Plus);

	ЗапросТовары = Новый Запрос();
	ЗапросТовары.УстановитьПараметр("ДокументПродажи", РеализацияТоваров.Ссылка);
	
	Если мМаркиАвтомобилей.Найти(УзелОбмена.МаркаАвтомобиля) = Неопределено Тогда
		ЗапросТовары.УстановитьПараметр("ГруппаПроизводителей", УзелОбмена.ГруппаПроизводителей);

	Иначе
		мПроизводители = Новый Массив();
		мПроизводители.Добавить(Справочники.Производители.CHERY);
		мПроизводители.Добавить(Справочники.Производители.EXEED);
		мПроизводители.Добавить(Справочники.Производители.OMODA);
		мПроизводители.Добавить(Справочники.Производители.JAECOO);
		мПроизводители.Добавить(Справочники.Производители.TENET);
		мПроизводители.Добавить(Справочники.Производители.TENET_PLUS);
		ЗапросТовары.УстановитьПараметр("ГруппаПроизводителей", мПроизводители);
	КонецЕсли;
	
	ЗапросТовары.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровТовары.НомерСтроки КАК НомерСтроки,
	|	РеализацияТоваровТовары.Номенклатура.Артикул КАК Артикул,
	|	РеализацияТоваровТовары.Номенклатура.Наименование КАК Наименование,
	|	РеализацияТоваровТовары.Количество КАК Количество,
	|	РеализацияТоваровТовары.СуммаВсего КАК СуммаВсего
	|ИЗ
	|	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	|ГДЕ
	|	РеализацияТоваровТовары.Ссылка = &ДокументПродажи
	|	И РеализацияТоваровТовары.Номенклатура.Производитель В ИЕРАРХИИ(&ГруппаПроизводителей)";
	
	ВыборкаТовары = ЗапросТовары.Выполнить().Выбрать();
	Если ВыборкаТовары.Количество() > 0 Тогда
		Возврат ВыборкаТовары;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ПолучитьРеализацию(РеализацияТоваров, УзелОбмена)
	стТелоЗапроса = Новый Структура();
	стТелоЗапроса.Вставить("DealerCode", УзелОбмена.КодДилера);
	стТелоЗапроса.Вставить("DealerDescr", УзелОбмена.НаименованиеДилера);
	стТелоЗапроса.Вставить("DealerPointId", УзелОбмена.КодТочкиДилера);
	стТелоЗапроса.Вставить("DocumentTypeId", 2);
	стТелоЗапроса.Вставить("WorkorderNumber", Формат(РеализацияТоваров.Дата, "ДФ=""г""") + СокрЛП(РеализацияТоваров.Номер));
	
	стТелоЗапроса.Вставить("Vin", "");
	стТелоЗапроса.Вставить("CarBrand", "");
	стТелоЗапроса.Вставить("CarModel", "");
	стТелоЗапроса.Вставить("LicencePlate", "");
	стТелоЗапроса.Вставить("Odometer", 0);
	
	Контрагент = РеализацияТоваров.Контрагент;
	стТелоЗапроса.Вставить("ClientDescr", Контрагент.Наименование);
	ОсновнойТелефон = СтрЗаменить(Контрагент.ОсновнойТелефон, ",", "");
	Если Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
		стТелоЗапроса.Вставить("ClientType", 1);
		стТелоЗапроса.Вставить("ClientPhone", ОсновнойТелефон);
		стТелоЗапроса.Вставить("ClientInn", "");
		
	Иначе
		стТелоЗапроса.Вставить("ClientType", 2);
		стТелоЗапроса.Вставить("ClientPhone", ОсновнойТелефон);
		стТелоЗапроса.Вставить("ClientInn", Контрагент.ИНН);
	КонецЕсли;
	стТелоЗапроса.Вставить("ContactPersonDescr", "");
	стТелоЗапроса.Вставить("ContactPersonPhone", стТелоЗапроса.ClientPhone);
	стТелоЗапроса.Вставить("ContactPersonEmail", "");
	Если Контрагент.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да Тогда
		стТелоЗапроса.Вставить("IsContactPersonalDataAgreement", Истина);
	Иначе
		стТелоЗапроса.Вставить("IsContactPersonalDataAgreement", Ложь);
	КонецЕсли;
	стТелоЗапроса.Вставить("IsContactAgreementPhone", Ложь);
	стТелоЗапроса.Вставить("IsContactAgreementEmail", Ложь);
	стТелоЗапроса.Вставить("IsContactAgreementSms", Ложь);
	
	стТелоЗапроса.Вставить("Reason", "");
	стТелоЗапроса.Вставить("Recommendation", "");
	ДатаСтрока = Формат(РеализацияТоваров.Дата, "ДФ=dd.MM.yyyy");
	стТелоЗапроса.Вставить("DateAccess", ДатаСтрока);
	стТелоЗапроса.Вставить("DateOpen", ДатаСтрока);
	стТелоЗапроса.Вставить("DateStart", ДатаСтрока);
	стТелоЗапроса.Вставить("DateFinish", ДатаСтрока);
	стТелоЗапроса.Вставить("DateClose", ДатаСтрока);
	
	стТелоЗапроса.Вставить("RepairTypeId", 1);
	стТелоЗапроса.Вставить("HasMaintenance", Ложь);
	стТелоЗапроса.Вставить("HasServiceEvent", Ложь);
	стТелоЗапроса.Вставить("HasGoodwill", Ложь);
	стТелоЗапроса.Вставить("HasBenchRepair", Ложь);
	стТелоЗапроса.Вставить("HasBodyRepair", Ложь);
	стТелоЗапроса.Вставить("HasPromotion", Ложь);
	стТелоЗапроса.Вставить("HasAddEquip", Ложь);
	стТелоЗапроса.Вставить("IsPresale", Ложь);
	стТелоЗапроса.Вставить("IsCheck", Ложь);
	стТелоЗапроса.Вставить("IsCarWash", Ложь);
	
	стТелоЗапроса.Вставить("ExternalCodeEmpOpen");
	стТелоЗапроса.Вставить("ExternalCodeEmpWork");
	стТелоЗапроса.Вставить("ExternalCodeEmpClose");
	
	стТелоЗапроса.Вставить("WorkRows");
	ВыборкаТовары = ПолучитьТоварыРеализации(РеализацияТоваров, УзелОбмена);
	Если ВыборкаТовары = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	мТовары = Новый Массив();
	Пока ВыборкаТовары.Следующий() Цикл	
		//Если Не ПравильныйАртикул(ВыборкаТовары.Артикул) Тогда
		//	Продолжить;
		//КонецЕсли;

		стТовар = Новый Структура();
		стТовар.Вставить("PositionNumber", ВыборкаТовары.НомерСтроки);
		стТовар.Вставить("PostionCode", УдалитьТочку(ВыборкаТовары.Артикул));
		стТовар.Вставить("PostionDescr", ВыборкаТовары.Наименование);	
		стТовар.Вставить("ItemOrderNumber");
		стТовар.Вставить("Qnt", Окр(ВыборкаТовары.Количество, 2));	
		стТовар.Вставить("TotalGrossSum", Окр(ВыборкаТовары.СуммаВсего, 2));
		стТовар.Вставить("IsAdditional", Ложь);
		стТовар.Вставить("IsItemOnStock", Истина);
		мТовары.Добавить(стТовар);
	КонецЦикла;
	
	Если мТовары.Количество() > 0 Тогда
		стТелоЗапроса.Вставить("DetailsRows", мТовары);
	Иначе
		Возврат "";
	КонецЕсли;
	стТелоЗапроса.Вставить("SubcontractsRows");
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	Попытка
		ЗаписатьJSON(ЗаписьJSON, стТелоЗапроса);
	Исключение
	#Если Клиент Тогда	
		Сообщить("Не удалось записать JSON-данные продажи для " + Строка(РеализацияТоваров) + "!", СтатусСообщения.Внимание);
	#КонецЕсли
		Возврат "";
	КонецПопытки;
	
	ТелоЗапроса = ЗаписьJSON.Закрыть();
	Возврат ТелоЗапроса;
КонецФункции

Процедура ВыгрузитьОстатки(УзелОбмена)
	//Подразделение = УзелОбмена.Подразделение.Родитель;
	//Если Подразделение = Справочники.ПодразделенияКомпании.ОсновноеПодразделение Тогда
	//	Подразделение = УзелОбмена.Подразделение;
	//КонецЕсли;
	
	НаДату = ТекущаяДата();
	
	НТТР = ПолучитьСоединениеHTTP(УзелОбмена);
	ЗапросHTTP = ПолучитьЗапросHTTP(УзелОбмена);
	
	ТелоЗапроса = ПолучитьОстатки(НаДату, УзелОбмена);
	Если ЗначениеЗаполнено(ТелоЗапроса) Тогда	
		ЗапросHTTP.АдресРесурса = "/v1/Parts/UploadPartsStock";
		ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);		
		НТТРОтвет = НТТР.ОтправитьДляОбработки(ЗапросHTTP);
		Если НТТРОтвет.КодСостояния > 299 Тогда
			#Если Клиент Тогда
			ТелоОтвета = НТТРОтвет.ПолучитьТелоКакСтроку();
			Сообщить("Выгрузка данных по складским остаткам:" + Символы.ПС 
			+ "Код состояния: " + НТТРОтвет.КодСостояния  + Символы.ПС 
			+ "Тело ответа: " + ТелоОтвета, СтатусСообщения.Важное);
			#КонецЕсли
		
		Иначе
			#Если Клиент Тогда
			ТелоОтвета = НТТРОтвет.ПолучитьТелоКакСтроку();
			ЧтениеJSON = Новый ЧтениеJSON();
			ЧтениеJSON.УстановитьСтроку(ТелоОтвета);				
			стОтвет = ПрочитатьJSON(ЧтениеJSON);
			СообщениеОбОшибке = "";
			Если ТипЗнч(стОтвет) = Тип("Структура") Тогда
				Если стОтвет.Свойство("ErrorInfo", СообщениеОбОшибке) Тогда
					Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
						Сообщить("Выгрузка данных по складским остаткам: " + СообщениеОбОшибке, СтатусСообщения.Важное);
					КонецЕсли;
				КонецЕсли;
				СообщениеПользователю = "";
				Если стОтвет.Свойство("UserInfo", СообщениеПользователю) Тогда
					Если ЗначениеЗаполнено(СообщениеПользователю) Тогда
						Сообщить(СообщениеПользователю, СтатусСообщения.Информация);
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Сообщить("Выгрузка данных по складским остаткам: Сервер вернул неверный тип данных!", СтатусСообщения.Важное); 
			КонецЕсли;
			#КонецЕсли
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ВыгрузитьПродажу(РеализацияТоваров, УзелОбмена)
	ТелоЗапроса = ПолучитьРеализацию(РеализацияТоваров, УзелОбмена);
	Если ЗначениеЗаполнено(ТелоЗапроса) Тогда
		НТТР = ПолучитьСоединениеHTTP(УзелОбмена);
		ЗапросHTTP = ПолучитьЗапросHTTP(УзелОбмена);
		ЗапросHTTP.АдресРесурса = "/v1/Service/UploadRepairInfo";
		
		ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);		
		НТТРОтвет = НТТР.ОтправитьДляОбработки(ЗапросHTTP);
		Возврат НТТРОтвет;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Процедура ВыгрузитьПродажи(УзелОбмена)
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	ЗаписьСообщения.НачатьЗапись(Запись, УзелОбмена);
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(ЗаписьСообщения.Получатель, ЗаписьСообщения.НомерСообщения);
	Пока ВыборкаИзменений.Следующий() Цикл
	    РеализацияТоваров = ВыборкаИзменений.Получить();
		
		НТТРОтвет = ВыгрузитьПродажу(РеализацияТоваров, УзелОбмена);
		Если НТТРОтвет = Неопределено Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, РеализацияТоваров);
			
		ИначеЕсли НТТРОтвет.КодСостояния > 299 Тогда
			#Если Клиент Тогда
			ТелоОтвета = НТТРОтвет.ПолучитьТелоКакСтроку();
			Сообщить("Выгрузка данных по " + РеализацияТоваров + Символы.ПС 
			+ "Код состояния: " + НТТРОтвет.КодСостояния  + Символы.ПС 
			+ "Тело ответа: " + ТелоОтвета, СтатусСообщения.Важное);
			#КонецЕсли
			ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, РеализацияТоваров);
			
		Иначе
			#Если Клиент Тогда
			ТелоОтвета = НТТРОтвет.ПолучитьТелоКакСтроку();
			ЧтениеJSON = Новый ЧтениеJSON();
			ЧтениеJSON.УстановитьСтроку(ТелоОтвета);				
			стОтвет = ПрочитатьJSON(ЧтениеJSON);
			СообщениеОбОшибке = "";
			Если ТипЗнч(стОтвет) = Тип("Структура") И стОтвет.Свойство("ErrorInfo", СообщениеОбОшибке) Тогда
				Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
					Сообщить("Реализация товаров " + РеализацияТоваров.Номер + ": " + СообщениеОбОшибке, СтатусСообщения.Важное);
				КонецЕсли;
				
			Иначе
				Сообщить("Реализация товаров " + РеализацияТоваров.Номер + ": Сервер вернул неверный тип данных!", СтатусСообщения.Важное); 
			КонецЕсли;
			#КонецЕсли
			ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, РеализацияТоваров);
		КонецЕсли;
		Пауза();
	КонецЦикла;
	НомерСообщения = ЗаписьСообщения.НомерСообщения;
	ЗаписьСообщения.ЗакончитьЗапись();
	СтрокаСообщения = Запись.Закрыть();
КонецПроцедуры

//// Процедуры / функции для выгрузки данных по заказ-нарядам на портал ЛоджикСтарс
////////////////////////////////////////////////////////////////////////////////////

Функция ПолучитьТоварыЗН(ЗаказНаряд, УзелОбмена)
	мМаркиАвтомобилей = Новый Массив();
	мМаркиАвтомобилей.Добавить(Справочники.Марка.CHERY);
	мМаркиАвтомобилей.Добавить(Справочники.Марка.EXEED);
	мМаркиАвтомобилей.Добавить(Справочники.Марка.ESTEO);
	мМаркиАвтомобилей.Добавить(Справочники.Марка.OMODA);
	мМаркиАвтомобилей.Добавить(Справочники.Марка.JAECOO);

	ЗапросТовары = Новый Запрос();
	ЗапросТовары.УстановитьПараметр("ДокументПродажи", ЗаказНаряд.Ссылка);
	
	Если мМаркиАвтомобилей.Найти(УзелОбмена.МаркаАвтомобиля) = Неопределено Тогда
		ЗапросТовары.УстановитьПараметр("ГруппаПроизводителей", УзелОбмена.ГруппаПроизводителей);

	Иначе
		мПроизводители = Новый Массив();
		мПроизводители.Добавить(Справочники.Производители.CHERY);
		мПроизводители.Добавить(Справочники.Производители.EXEED);
		мПроизводители.Добавить(Справочники.Производители.OMODA);
		мПроизводители.Добавить(Справочники.Производители.JAECOO);
		ЗапросТовары.УстановитьПараметр("ГруппаПроизводителей", мПроизводители);
	КонецЕсли;
	
	ЗапросТовары.Текст =
	"ВЫБРАТЬ
	|	ЗаказНарядТовары.НомерСтроки КАК НомерСтроки,
	|	ЗаказНарядТовары.Номенклатура.Артикул КАК Артикул,
	|	ЗаказНарядТовары.Номенклатура.Наименование КАК Наименование,
	|	ЗаказНарядТовары.Количество КАК Количество,
	|	ЗаказНарядТовары.СуммаВсего КАК СуммаВсего,
	|	ЗаказНарядТовары.Основная КАК Основная
	|ИЗ
	|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
	|ГДЕ
	|	ЗаказНарядТовары.Ссылка = &ДокументПродажи
	|	И ЗаказНарядТовары.Номенклатура.Производитель В ИЕРАРХИИ(&ГруппаПроизводителей)";
	
	Возврат ЗапросТовары.Выполнить().Выбрать();
КонецФункции

Функция ПолучитьРаботыЗН(ЗаказНаряд, УзелОбмена)
	ЗапросТовары = Новый Запрос();
	ЗапросТовары.УстановитьПараметр("ДокументПродажи", ЗаказНаряд.Ссылка);
	ЗапросТовары.Текст =
	"ВЫБРАТЬ
	|	ЗаказНарядРаботы.НомерСтроки КАК НомерСтроки,
	|	ЗаказНарядРаботы.Работа.Код КАК Код,
	|	ЗаказНарядРаботы.Работа.Артикул КАК Артикул,
	|	ЗаказНарядРаботы.Работа.Наименование КАК Наименование,
	|	ЗаказНарядРаботы.Количество * ЗаказНарядРаботы.Коэффициент КАК КоличествоНормочасов,
	|	ЗаказНарядРаботы.СуммаВсего КАК СуммаВсего,
	|	ЗаказНарядРаботы.Основная КАК Основная
	|ИЗ
	|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
	|ГДЕ
	|	ЗаказНарядРаботы.Ссылка = &ДокументПродажи";
	
	Возврат ЗапросТовары.Выполнить().Выбрать();
КонецФункции

Функция ПолучитьЗаказНаряд(ЗаказНаряд, УзелОбмена)
	стТелоЗапроса = Новый Структура();
	стТелоЗапроса.Вставить("DealerCode", УзелОбмена.КодДилера);
	стТелоЗапроса.Вставить("DealerDescr", УзелОбмена.НаименованиеДилера);
	стТелоЗапроса.Вставить("DealerPointId", УзелОбмена.КодТочкиДилера);
	стТелоЗапроса.Вставить("DocumentTypeId", 1);
	стТелоЗапроса.Вставить("WorkorderNumber", СокрЛП(ЗаказНаряд.Номер));
	
	стТелоЗапроса.Вставить("Vin", ЗаказНаряд.Автомобиль.VIN);
	Модель = ЗаказНаряд.Автомобиль.Модель;
	Марка = Модель.Марка;
	стТелоЗапроса.Вставить("CarBrand", Строка(Марка));
	стТелоЗапроса.Вставить("CarModel", Строка(Модель));
	
	ГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ЗаказНаряд.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
	Если ЗначениеЗаполнено(ГосНомер) Тогда
		стТелоЗапроса.Вставить("LicencePlate", ГосНомер);
	Иначе
		стТелоЗапроса.Вставить("LicencePlate", "Б/Н");
	КонецЕсли;
	
	Пробег = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ЗаказНаряд.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
	Если ЗначениеЗаполнено(Пробег) Тогда
		стТелоЗапроса.Вставить("Odometer", Пробег);
	Иначе
		стТелоЗапроса.Вставить("Odometer", 0);
	КонецЕсли;
	
	Контрагент = ЗаказНаряд.Заказчик;
	стТелоЗапроса.Вставить("ClientDescr", Контрагент.Наименование);
	ОсновнойТелефон = СтрЗаменить(Контрагент.ОсновнойТелефон, ",", "");
	Если Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
		стТелоЗапроса.Вставить("ClientType", 1);
		стТелоЗапроса.Вставить("ClientPhone", ОсновнойТелефон);
		стТелоЗапроса.Вставить("ClientInn", "");
		Если Контрагент.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да Тогда
			стТелоЗапроса.Вставить("IsContactPersonalDataAgreement", Истина);
		Иначе
			стТелоЗапроса.Вставить("IsContactPersonalDataAgreement", Ложь);
		КонецЕсли;
		
	Иначе
		стТелоЗапроса.Вставить("ClientType", 2);
		стТелоЗапроса.Вставить("ClientPhone", ОсновнойТелефон);
		стТелоЗапроса.Вставить("ClientInn", Контрагент.ИНН);
		стТелоЗапроса.Вставить("IsContactPersonalDataAgreement", Истина);
	КонецЕсли;
	
	стТелоЗапроса.Вставить("ContactPersonDescr", "");
	стТелоЗапроса.Вставить("ContactPersonPhone", стТелоЗапроса.ClientPhone);
	стТелоЗапроса.Вставить("ContactPersonEmail", "");
	
	Если Марка = Справочники.Марка.JAECOO Или Марка = Справочники.Марка.OMODA Тогда
		стТелоЗапроса.Вставить("IsContactAgreementPhone", Истина);
		стТелоЗапроса.Вставить("IsContactAgreementEmail", Истина);
		стТелоЗапроса.Вставить("IsContactAgreementSms", Истина);
	Иначе
		стТелоЗапроса.Вставить("IsContactAgreementPhone", Ложь);
		стТелоЗапроса.Вставить("IsContactAgreementEmail", Ложь);
		стТелоЗапроса.Вставить("IsContactAgreementSms", Ложь);
	КонецЕсли;
	
	стТелоЗапроса.Вставить("Reason", ЗаказНаряд.ПричинаОбращения);
	стТелоЗапроса.Вставить("Recommendation", ЗаказНаряд.Рекомендации);
	стТелоЗапроса.Вставить("DateAccess", Формат(ЗаказНаряд.ДатаМашинозаезда, "ДФ=dd.MM.yyyy"));
	стТелоЗапроса.Вставить("DateOpen", Формат(ЗаказНаряд.ДатаСоздания, "ДФ=dd.MM.yyyy"));
	стТелоЗапроса.Вставить("DateStart", Формат(ЗаказНаряд.ДатаНачала, "ДФ=dd.MM.yyyy"));
	
	Если ЗаказНаряд.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
		стТелоЗапроса.Вставить("DateClose", Формат(ЗаказНаряд.ДатаЗакрытия, "ДФ=dd.MM.yyyy"));
		стТелоЗапроса.Вставить("DateFinish", Формат(ЗаказНаряд.ДатаОкончания, "ДФ=dd.MM.yyyy"));
		
	ИначеЕсли ЗаказНаряд.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен Тогда
		Если ЗначениеЗаполнено(ЗаказНаряд.ДатаОкончания) Тогда
			стТелоЗапроса.Вставить("DateFinish", Формат(ЗаказНаряд.ДатаОкончания, "ДФ=dd.MM.yyyy"));
		Иначе
			стТелоЗапроса.Вставить("DateFinish");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗаказНаряд.ДатаЗакрытия) Тогда
			стТелоЗапроса.Вставить("DateClose", Формат(ЗаказНаряд.ДатаЗакрытия, "ДФ=dd.MM.yyyy"));
			
		ИначеЕсли ЗначениеЗаполнено(ЗаказНаряд.ДатаОкончания) Тогда
			стТелоЗапроса.Вставить("DateClose", Формат(ЗаказНаряд.ДатаОкончания, "ДФ=dd.MM.yyyy"));
			
		Иначе
			стТелоЗапроса.Вставить("DateClose");
		КонецЕсли;
		
	Иначе
		стТелоЗапроса.Вставить("DateClose");
	КонецЕсли;
	
	Если ЗаказНаряд.ВидРемонта.ГарантияЗавода Тогда
		стТелоЗапроса.Вставить("RepairTypeId", 3);
		
	ИначеЕсли ЗаказНаряд.ВидРемонта.Коммерческий Тогда
		Если ЗаказНаряд.ВидРемонта = Справочники.ВидыРемонта.КузовнойРемонт Тогда
			стТелоЗапроса.Вставить("RepairTypeId", 2);
		ИначеЕсли ЗаказНаряд.ВидРемонта = Справочники.ВидыРемонта.ПредпродажнаяПодготовка Тогда
			стТелоЗапроса.Вставить("RepairTypeId", 4);
		Иначе
			стТелоЗапроса.Вставить("RepairTypeId", 1);
		КонецЕсли;
		
	Иначе
		стТелоЗапроса.Вставить("RepairTypeId", 4);
	КонецЕсли;
	
	Если ЗаказНаряд.ВидРемонта.ТехОбслуживание Тогда
		стТелоЗапроса.Вставить("HasMaintenance", Истина);
	Иначе
		стТелоЗапроса.Вставить("HasMaintenance", Ложь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаказНаряд.СервиснаяКампания) Тогда
		стТелоЗапроса.Вставить("HasServiceEvent", Истина);
	Иначе
		стТелоЗапроса.Вставить("HasServiceEvent", Ложь);
	КонецЕсли;
	
	Если ЗаказНаряд.ВидРемонта = Справочники.ВидыРемонта.ДобраяВоляКомпании Тогда
		стТелоЗапроса.Вставить("HasGoodwill", Истина);
	Иначе
		стТелоЗапроса.Вставить("HasGoodwill", Ложь);
	КонецЕсли;
	
	Если ЗаказНаряд.ВидРемонта = Справочники.ВидыРемонта.КузовнойРемонт
		Или ЗаказНаряд.ВидРемонта = Справочники.ВидыРемонта.КузовнойКоммерческий Тогда
		стТелоЗапроса.Вставить("HasBenchRepair", Ложь);
		стТелоЗапроса.Вставить("HasBodyRepair", Истина);
	Иначе
		стТелоЗапроса.Вставить("HasBenchRepair", Истина);
		стТелоЗапроса.Вставить("HasBodyRepair", Ложь);
	КонецЕсли;
	
	Если стрНайти(ЗаказНаряд.ВидРемонта.Наименование, "Акция") > 0 Тогда
		стТелоЗапроса.Вставить("HasPromotion", Истина);
	Иначе
		стТелоЗапроса.Вставить("HasPromotion", Ложь);
	КонецЕсли;
	
	Если ЗаказНаряд.ВидРемонта = Справочники.ВидыРемонта.ДопОборудованиеСогласованноеСДилером
		Или ЗаказНаряд.ВидРемонта = Справочники.ВидыРемонта.ДополнительноеОборудование Тогда
		стТелоЗапроса.Вставить("HasAddEquip", Истина);
	Иначе
		стТелоЗапроса.Вставить("HasAddEquip", Ложь);
	КонецЕсли;
	
	Если ЗаказНаряд.ВидРемонта = Справочники.ВидыРемонта.ПредпродажнаяПодготовка Тогда
		стТелоЗапроса.Вставить("IsPresale", Истина);
	Иначе
		стТелоЗапроса.Вставить("IsPresale", Ложь);
	КонецЕсли;
	
	Если ЗаказНаряд.ВидРемонта = Справочники.ВидыРемонта.КоммерческийРемонт
		Или ЗаказНаряд.ВидРемонта.ТехОбслуживание Тогда
		стТелоЗапроса.Вставить("IsCheck", Истина);
		стТелоЗапроса.Вставить("IsCarWash", Истина);
	Иначе
		стТелоЗапроса.Вставить("IsCheck", Ложь);
		стТелоЗапроса.Вставить("IsCarWash", Ложь);
	КонецЕсли;
	
	КодСотрудника = СокрЛП(ЗаказНаряд.Диспетчер.Код);
	//Если ЗначениеЗаполнено(КодСотрудника) Тогда
	//	стТелоЗапроса.Вставить("ExternalCodeEmpOpen", КодСотрудника);
	//	Если ЗаказНаряд.ВидРемонта.ТехОбслуживание Тогда
	//		стТелоЗапроса.Вставить("ExternalCodeEmpWork", КодСотрудника);
	//	Иначе
	//		стТелоЗапроса.Вставить("ExternalCodeEmpWork");
	//	КонецЕсли;
	//	стТелоЗапроса.Вставить("ExternalCodeEmpClose", КодСотрудника);
	//	
	//Иначе
		стТелоЗапроса.Вставить("ExternalCodeEmpOpen");
		стТелоЗапроса.Вставить("ExternalCodeEmpWork");
		стТелоЗапроса.Вставить("ExternalCodeEmpClose");
	//КонецЕсли;
	
	///////////////// Работы заказ-наряда
	ВыборкаРаботы = ПолучитьРаботыЗН(ЗаказНаряд, УзелОбмена);
	Если ВыборкаРаботы.Количество() = 0 Тогда /// без работ не выгружаем
		Возврат "";
	КонецЕсли;
	
	мРаботы = Новый Массив();
	Пока ВыборкаРаботы.Следующий() Цикл
		стРабота = Новый Структура();
		стРабота.Вставить("PositionNumber", ВыборкаРаботы.НомерСтроки);
		Если ЗначениеЗаполнено(ВыборкаРаботы.Артикул) Тогда
			стРабота.Вставить("PostionCode", СокрЛП(ВыборкаРаботы.Артикул));
		Иначе
			стРабота.Вставить("PostionCode", СокрЛП(ВыборкаРаботы.Код));
		КонецЕсли;
		
		стРабота.Вставить("PostionDescr", ВыборкаРаботы.Наименование);	
		стРабота.Вставить("ItemOrderNumber");
		стРабота.Вставить("Qnt", Окр(ВыборкаРаботы.КоличествоНормочасов, 2));	
		стРабота.Вставить("TotalGrossSum", Окр(ВыборкаРаботы.СуммаВсего, 2));
		Если ВыборкаРаботы.Основная Тогда
			стРабота.Вставить("IsAdditional", Ложь);
		Иначе
			стРабота.Вставить("IsAdditional", Истина);
		КонецЕсли;
		
		стРабота.Вставить("IsItemOnStock", Истина);
		мРаботы.Добавить(стРабота);
	КонецЦикла;
	
	Если мРаботы.Количество() > 0 Тогда
		стТелоЗапроса.Вставить("WorkRows", мРаботы);
	Иначе
		Возврат ""; /// без работ не выгружаем
	КонецЕсли;
	
	//////////////// Товары заказ-наряда
	ВыборкаТовары = ПолучитьТоварыЗН(ЗаказНаряд, УзелОбмена);
	мТовары = Новый Массив();
	Пока ВыборкаТовары.Следующий() Цикл	
		//Если Не ПравильныйАртикул(ВыборкаТовары.Артикул) Тогда
		//	Продолжить;
		//КонецЕсли;

		стТовар = Новый Структура();
		стТовар.Вставить("PositionNumber", ВыборкаТовары.НомерСтроки);
		стТовар.Вставить("PostionCode", УдалитьТочку(СокрЛП(ВыборкаТовары.Артикул)));
		стТовар.Вставить("PostionDescr", СокрЛП(ВыборкаТовары.Наименование));	
		стТовар.Вставить("ItemOrderNumber");
		стТовар.Вставить("Qnt", Окр(ВыборкаТовары.Количество, 2));	
		стТовар.Вставить("TotalGrossSum", Окр(ВыборкаТовары.СуммаВсего, 2));
		Если ВыборкаТовары.Основная Тогда
			стТовар.Вставить("IsAdditional", Ложь);
		Иначе
			стТовар.Вставить("IsAdditional", Истина);
		КонецЕсли;
		стТовар.Вставить("IsItemOnStock", Истина);
		мТовары.Добавить(стТовар);
	КонецЦикла;
	
	Если мТовары.Количество() > 0 Тогда
		стТелоЗапроса.Вставить("DetailsRows", мТовары);
	Иначе
		стТелоЗапроса.Вставить("DetailsRows");
	КонецЕсли;
	
	стТелоЗапроса.Вставить("SubcontractsRows"); // Субподряды
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	Попытка
		ЗаписатьJSON(ЗаписьJSON, стТелоЗапроса);
	Исключение
	#Если Клиент Тогда	
		Сообщить("Не удалось записать JSON-данные продажи для " + Строка(ЗаказНаряд) + "!", СтатусСообщения.Внимание);
	#КонецЕсли
		Возврат "";
	КонецПопытки;
	
	ТелоЗапроса = ЗаписьJSON.Закрыть();
	Возврат ТелоЗапроса;
КонецФункции

Процедура ВыгрузитьЗаказНаряд(ЗаказНаряд, УзелОбмена)
	ТелоЗапроса = ПолучитьЗаказНаряд(ЗаказНаряд, УзелОбмена);
	Если обЗначениеНеЗаполнено(ТелоЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	НТТР = ПолучитьСоединениеHTTP(УзелОбмена);
	ЗапросHTTP = ПолучитьЗапросHTTP(УзелОбмена);
	ЗапросHTTP.АдресРесурса = "/v1/Service/UploadRepairInfo";
	
	ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);		
	НТТРОтвет = НТТР.ОтправитьДляОбработки(ЗапросHTTP);
	Если НТТРОтвет.КодСостояния > 299 Тогда
		#Если Клиент Тогда
		ТелоОтвета = НТТРОтвет.ПолучитьТелоКакСтроку();
		Сообщить("Выгрузка данных по " + ЗаказНаряд + Символы.ПС 
		+ "Код состояния: " + НТТРОтвет.КодСостояния  + Символы.ПС 
		+ "Тело ответа: " + ТелоОтвета, СтатусСообщения.Важное);
		#КонецЕсли

	Иначе
		#Если Клиент Тогда
		ТелоОтвета = НТТРОтвет.ПолучитьТелоКакСтроку();
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(ТелоОтвета);				
		стОтвет = ПрочитатьJSON(ЧтениеJSON);
		СообщениеСервера = "";
		Если ТипЗнч(стОтвет) = Тип("Структура") Тогда
			Если стОтвет.Свойство("ErrorInfo", СообщениеСервера) И ЗначениеЗаполнено(СообщениеСервера) Тогда
				Сообщить("Заказ-наряд " + СокрЛП(ЗаказНаряд.Номер) + ", сообщение сервера LogicStars: " + СообщениеСервера, СтатусСообщения.Важное);
				
			ИначеЕсли стОтвет.Свойство("UserInfo", СообщениеСервера) И ЗначениеЗаполнено(СообщениеСервера) Тогда
				Сообщить("Заказ-наряд " + СокрЛП(ЗаказНаряд.Номер) + ", сообщение сервера LogicStars: " + СообщениеСервера, СтатусСообщения.Информация);
				
			Иначе
				Сообщить("Заказ-наряд " + СокрЛП(ЗаказНаряд.Номер) + ": Сервер вернул некорректную структуру данных!", СтатусСообщения.Важное);
			КонецЕсли;
			
		Иначе
			Сообщить("Заказ-наряд " + СокрЛП(ЗаказНаряд.Номер) + ": Сервер вернул неверный тип данных!", СтатусСообщения.Важное); 
		КонецЕсли;
		#КонецЕсли
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузитьДанныеППО(УзелОбмена)
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	ЗаписьСообщения.НачатьЗапись(Запись, УзелОбмена);
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(ЗаписьСообщения.Получатель, ЗаписьСообщения.НомерСообщения);
	Пока ВыборкаИзменений.Следующий() Цикл
	    ЗаказНаряд = ВыборкаИзменений.Получить();
		ВыгрузитьЗаказНаряд(ЗаказНаряд, УзелОбмена);
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, ЗаказНаряд);
		Пауза();
	КонецЦикла;
	
	НомерСообщения = ЗаписьСообщения.НомерСообщения;
	ЗаписьСообщения.ЗакончитьЗапись();
	СтрокаСообщения = Запись.Закрыть();
КонецПроцедуры


//// Процедуры регламентных заданий для выгрузки данных по остаткам партий,
//// продажам товаров и заказ-нарядам на портал ЛоджикСтарс
////////////////////////////////////////////////////////////////////////////

Процедура ВыгрузкаОстаткиПойменнаяЭксид(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ПойменнаяЭксидПродажи");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьОстатки(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузкаОстаткиМалиновскогоЭксид(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("МалиновскогоЭксидПродажи");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьОстатки(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузкаОстаткиШолоховаЧери(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ШолоховаЧериПродажи");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьОстатки(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузкаОстаткиВолгодонскЧери(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ВолгодонскЧериПродажи");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьОстатки(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузкаОстаткиШахтыДжейку(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ШахтыДжейкуПродажи");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьОстатки(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузкаОстаткиШахтыОмода(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ШахтыОмодаПродажи");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьОстатки(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузкаОстаткиАксайДжейку(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("АксайДжейкуПродажи");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьОстатки(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузкаОстаткиАксайОмода(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("АксайОмодаПродажи");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьОстатки(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузкаОстаткиВавиловаТенет(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ВавиловаТенетПродажи");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьОстатки(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузкаОстаткиАксайТенетПлюс(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("АксайТенетПлюсПродажи");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьОстатки(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////
Процедура ВыгрузкаПродажиПойменнаяЭксид(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ПойменнаяЭксидПродажи");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьПродажи(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузкаПродажиМалиновскогоЭксид(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("МалиновскогоЭксидПродажи");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьПродажи(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузкаПродажиШолоховаЧери(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ШолоховаЧериПродажи");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьПродажи(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузкаПродажиВолгодонскЧери(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ВолгодонскЧериПродажии");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьПродажи(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузкаПродажиВавиловаТенет(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ВавиловаТенетПродажи");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьПродажи(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузкаПродажиШахтыДжейку(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ШахтыДжейкуПродажи");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьПродажи(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузкаПродажиШахтыОмода(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ШахтыОмодаПродажи");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьПродажи(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузкаПродажиАксайДжейку(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("АксайДжейкуПродажи");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьПродажи(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузкаПродажиАксайОмода(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("АксайОмодаПродажи");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьПродажи(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузкаПродажиАксайТенетПлюс(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("АксайТенетПлюсПродажи");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьПродажи(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////
Процедура ВыгрузкаДанныхППОПойменнаяЭксид(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ПойменнаяЭксидППО");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьДанныеППО(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузкаДанныхППОМалиновскогоЭксид(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("МалиновскогоЭксидППО");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьДанныеППО(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузкаДанныхППОШолоховаЧери(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ШолоховаЧериППО");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьДанныеППО(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузкаДанныхППОВолгодонскЧери(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ВолгодонскЧериППО");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьДанныеППО(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузкаДанныхППОВавиловаТенет(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ВавиловаТенетППО");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьДанныеППО(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузкаДанныхППОШахтыДжейку(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ШахтыДжейкуППО");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьДанныеППО(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузкаДанныхППОШахтыОмода(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("ШахтыОмодаППО");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьДанныеППО(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузкаДанныхППОАксайДжейку(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("АксайДжейкуППО");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьДанныеППО(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузкаДанныхППОАксайОмода(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("АксайОмодаППО");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьДанныеППО(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузкаДанныхППОАксайТенетПлюс(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСЛоджикСтарс.НайтиПоКоду("АксайТенетПлюсППО");
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьДанныеППО(УзелОбмена);
	КонецЕсли;
КонецПроцедуры

//// Процедуры выгрузки заказ-наряда на портал ЛоджикСтарс
////////////////////////////////////////////////////////////

Процедура ВыгрузкаЗаказНаряда(ЗаказНарядСсылка) Экспорт
	ЗаказНаряд = ЗаказНарядСсылка.ПолучитьОбъект();
	УзелОбмена = НайтиУзелОбменаДляЗН(ЗаказНаряд, Истина);
	
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		ВыгрузитьЗаказНаряд(ЗаказНаряд, УзелОбмена)
	КонецЕсли;
КонецПроцедуры


///////////////// для Битрикс ///////////////////
Функция ПолучитьДанныеЗаказНаряда(ЗаказНаряд)
	стТелоЗапроса = Новый Структура();

	стТелоЗапроса.Вставить("department", СокрЛП(ЗаказНаряд.ПодразделениеКомпании));
	стТелоЗапроса.Вставить("repair_code", СокрЛП(ЗаказНаряд.Номер));
	стТелоЗапроса.Вставить("works_sum", Окр(ЗаказНаряд.СуммаРаботДокумента, 2));
	стТелоЗапроса.Вставить("spare_sum", Окр(ЗаказНаряд.СуммаНоменклатурыДокумента, 2));
	стТелоЗапроса.Вставить("repair_sum", Окр(ЗаказНаряд.СуммаДокумента, 2));
	стТелоЗапроса.Вставить("claim_code", СокрЛП(ЗаказНаряд.Рекламация));
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	Попытка
		ЗаписатьJSON(ЗаписьJSON, стТелоЗапроса);
	Исключение
	#Если Клиент Тогда	
		Сообщить("Не удалось записать JSON-данные продажи для " + Строка(ЗаказНаряд) + "!", СтатусСообщения.Внимание);
	#КонецЕсли
		Возврат "";
	КонецПопытки;
	
	ТелоЗапроса = ЗаписьJSON.Закрыть();
	Возврат ТелоЗапроса;
КонецФункции

Функция ПолучитьДанныеЗаказаПоставщику(ЗаказПоставщику)
	стТелоЗапроса = Новый Структура();

	стТелоЗапроса.Вставить("order_code", СокрЛП(ЗаказПоставщику.Номер));
	стТелоЗапроса.Вставить("employee_code", СокрЛП(ЗаказПоставщику.Согласовал.Сотрудник.Код));
	
	мТовары = Новый Массив();
	Для Каждого СтрокаТовар Из ЗаказПоставщику.Товары Цикл	
		//Если Не ПравильныйАртикул(ВыборкаТовары.Артикул) Тогда
		//	Продолжить;
		//КонецЕсли;

		стТовар = Новый Структура();
		стТовар.Вставить("postion_name", СокрЛП(СтрокаТовар.Номенклатура.Наименование));
		стТовар.Вставить("postion_code", СокрЛП(СтрокаТовар.Номенклатура.Артикул));		
		стТовар.Вставить("sum", Окр(СтрокаТовар.СуммаВсего, 2));
		мТовары.Добавить(стТовар);
	КонецЦикла;
	
	Если мТовары.Количество() > 0 Тогда
		стТелоЗапроса.Вставить("spare_list", мТовары);
	Иначе
		Возврат "";
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	Попытка
		ЗаписатьJSON(ЗаписьJSON, стТелоЗапроса);
	Исключение
	#Если Клиент Тогда	
		Сообщить("Не удалось записать JSON-данные продажи для " + Строка(ЗаказПоставщику) + "!", СтатусСообщения.Внимание);
	#КонецЕсли
		Возврат "";
	КонецПопытки;
	
	ТелоЗапроса = ЗаписьJSON.Закрыть();
	Возврат ТелоЗапроса;
КонецФункции