// Общий журнал

Перем Права Экспорт;



Функция ПолучитьСписокПечатныхФорм(ДокументСсылка = Неопределено) Экспорт
	Возврат Новый СписокЗначений();	
КонецФункции
//Конец необходимых для общих журналов

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДатаПроведения", ДатаПроведения);
		Запрос.УстановитьПараметр("Начало", Начало);
		Запрос.УстановитьПараметр("Конец", Начало + (Продолжительность-1)*60);
		Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаписьНаТестДрайв.Ссылка,
		|	ЗаписьНаТестДрайв.Начало,
		|	ДОБАВИТЬКДАТЕ(ЗаписьНаТестДрайв.Начало, МИНУТА, ЗаписьНаТестДрайв.Продолжительность) КАК Конец
		|ИЗ
		|	Документ.CRM_ЗаписьНаТестДрайв КАК ЗаписьНаТестДрайв
		|ГДЕ
		|	ЗаписьНаТестДрайв.ДатаПроведения = &ДатаПроведения
		|	И (ЗаписьНаТестДрайв.Начало МЕЖДУ &Начало И &Конец
		|			ИЛИ ДОБАВИТЬКДАТЕ(ЗаписьНаТестДрайв.Начало, МИНУТА, ЗаписьНаТестДрайв.Продолжительность - 1) МЕЖДУ &Начало И &Конец
		|			ИЛИ &Начало МЕЖДУ ЗаписьНаТестДрайв.Начало И ДОБАВИТЬКДАТЕ(ЗаписьНаТестДрайв.Начало, МИНУТА, ЗаписьНаТестДрайв.Продолжительность - 1)
		|			ИЛИ &Конец МЕЖДУ ЗаписьНаТестДрайв.Начало И ДОБАВИТЬКДАТЕ(ЗаписьНаТестДрайв.Начало, МИНУТА, ЗаписьНаТестДрайв.Продолжительность - 1))
		|	И ЗаписьНаТестДрайв.Автомобиль = &Автомобиль
		|	И ЗаписьНаТестДрайв.Ссылка <> &Ссылка
		|	И ЗаписьНаТестДрайв.ПометкаУдаления = ЛОЖЬ
		|	И НЕ ЗаписьНаТестДрайв.СтатусДокумента = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыТестДрайва.Отменено)";
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Имеются пересечения с уже ведёнными данными:";
			Пока Выборка.Следующий() Цикл
				Сообщение.Текст = Сообщение.Текст + Символы.ПС + Строка(Выборка.Ссылка) + " : " + Формат(Выборка.Начало, "ДФ=ЧЧ:мм") + " - " + Формат(Выборка.Конец, "ДФ=ЧЧ:мм");
			КонецЦикла;
			Сообщение.Текст = Сообщение.Текст + Символы.ПС + "Проведение документа невозможно.";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	
		Если СтатусДокумента = Перечисления.CRM_СтатусыТестДрайва.ЗавершеноДосрочно ИЛИ
			СтатусДокумента = Перечисления.CRM_СтатусыТестДрайва.Отменено Тогда
			
			//Если ПустаяСтрока(ПричинаОтмены) Тогда
			//	Сообщение = Новый СообщениеПользователю;
			//	Сообщение.Поле = "ПричинаОтмены";
			//	Сообщение.УстановитьДанные(ЭтотОбъект);
			//	Сообщение.Текст = "Не заполнена причина отмены";
			//	Сообщение.Сообщить();
			//	Отказ = Истина;
			//КонецЕсли;
			
		КонецЕсли;
	
		Если СтатусДокумента = Перечисления.CRM_СтатусыТестДрайва.Завершено 
			ИЛИ СтатусДокумента = Перечисления.CRM_СтатусыТестДрайва.ЗавершеноДосрочно Тогда
			
			//Если КодыКомментариев.Количество() = 0 И НЕ ОтказОтАнкетирования Тогда
			//	
			//	Отказ = Истина;
			//	Сообщение = Новый СообщениеПользователю;
			//	Сообщение.Поле = "ОтказОтАнкетирования";
			//	Сообщение.УстановитьДанные(ЭтотОбъект);
			//	Сообщение.Текст = "Для сохранения документа с данным статусом необходимо либо заполнить анкету либо проставить отказ от анкетирования";
			//	Сообщение.Сообщить();
			//	
			//КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры  

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.CRM_ЗаписиНаТестДрайв.Очистить();
	Движения.CRM_ПроведенныйТестДрайв.Очистить();
	Движения.CRM_РезультатыКонтактов.Очистить();
	
	Renault_CRM.Статистика_Снять(Справочники.CRM_ЭтапыПродаж.ТестДрайв, РабочийЛист, Ссылка);
	
	Движение = Движения.CRM_ЗаписиНаТестДрайв.Добавить();
	Движение.Регистратор = Ссылка;
	Движение.Статус = СтатусДокумента;
	Движение.ТестДрайв = Ссылка;
	ЗаполнитьЗначенияСвойств(Движение, ЭтотОбъект);
	ДатаВремяПроведения = ДатаПроведения + Час(Начало)*3600 + Минута(Начало)*60;
	Движение.ДатаНачала = ДатаВремяПроведения;
	Движение.ДатаЗавершения = Движение.ДатаНачала + Продолжительность*60;
	Движение.IDK = РабочийЛист;
	Движения.CRM_ЗаписиНаТестДрайв.Записывать = Истина;
	
	//Временно
	Если СтатусДокумента = Перечисления.CRM_СтатусыТестДрайва.Завершено Тогда
		
		Движение = Движения.CRM_ПроведенныйТестДрайв.Добавить();
		Движение.Регистратор = Ссылка;
		Движение.IDK = РабочийЛист;
		Движение.ID = Новый УникальныйИдентификатор();
		Движение.МодельАвтомобиля = Автомобиль.Модель;
		Движение.Сотрудник = Менеджер;
		Движение.Дата = ДатаВремяПроведения;
		Движение.Подразделение = Подразделение;
		Движение.Отдел = Отдел;
		Движение.ФИО = Клиент;
		Движения.CRM_ПроведенныйТестДрайв.Записывать = Истина;
		
		//Воронка продаж
		Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
		Запись.IDK = РабочийЛист;
		Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ТестДрайв;
		Запись.ДилерскийЦентр = ДилерскийЦентр;
		Запись.ДатаВыполнения = ДатаВремяПроведения;
		Запись.Объект = Ссылка;
		Запись.Записать();
		
		//Статистика продаж
		Renault_CRM.Статистика_Установить(Справочники.CRM_ЭтапыПродаж.ТестДрайв, РабочийЛист, Ссылка, , ДатаПроведения, Автомобиль.Модель);
		
		//Закроем соответствующее событие, если есть
		Запрос =  Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CRM_СобытияПоРабочимЛистам.Ссылка
		               |ИЗ
		               |	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
		               |ГДЕ
		               |	CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
		               |	И CRM_СобытияПоРабочимЛистам.Объект = &Объект";
		Запрос.УстановитьПараметр("Объект", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СобытиеОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СобытиеОбъект.Обработано = Истина;
			СобытиеОбъект.ЗавершеноУспешно = Истина;
			СобытиеОбъект.КомментарийЗакрытия = "Закрыто автоматически при выполнении тест-драйва";
			СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;
		
	ИначеЕсли СтатусДокумента = Перечисления.CRM_СтатусыТестДрайва.Отменено Тогда
		
		//Закроем соответствующее событие, если есть
		Запрос =  Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CRM_СобытияПоРабочимЛистам.Ссылка
		               |ИЗ
		               |	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
		               |ГДЕ
		               |	CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
		               |	И CRM_СобытияПоРабочимЛистам.Объект = &Объект";
		Запрос.УстановитьПараметр("Объект", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СобытиеОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СобытиеОбъект.Обработано = Истина;
			СобытиеОбъект.ЗавершеноУспешно = Ложь;
			СобытиеОбъект.КомментарийЗакрытия = "Закрыто автоматически при отмене тест-драйва";
			СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого Стр Из КодыКомментариев Цикл
		Движение = Движения.CRM_РезультатыКонтактов.Добавить();
		Движение.Период = Дата;
		Движение.Регистратор = Ссылка;
		Движение.Автомобиль = Автомобиль;
		Движение.Сотрудник = Менеджер;
		Движение.Показатель = Стр.Показатель;
		//Движение.УдалитьОценкаУдовлетворенности = Стр.Результат;
		Движение.ОценкаУдовлетворенности = Стр.Оценка;
	КонецЦикла;
	Если Движения.CRM_РезультатыКонтактов.Количество() > 0 Тогда
		Движения.CRM_РезультатыКонтактов.Записывать = Истина;
	КонецЕсли;
	
	//Очистим имеющиеся напоминания
	УдалитьИмеющиесяНапоминания();
	//Запишем напоминание
	Если ВыдатьНапоминание И СтатусДокумента <> Перечисления.CRM_СтатусыТестДрайва.Завершено И СтатусДокумента <> Перечисления.CRM_СтатусыТестДрайва.ЗавершеноДосрочно И (ДатаПроведения + Час(ВремяНапоминания)*3600 + Минута(ВремяНапоминания)*60) > ТекущаяДата() Тогда
		//РегМенеджер = РегистрыСведений.Напоминания.СоздатьМенеджерЗаписи();
		//РегМенеджер.Пользователь = ПользовательНапоминания;
		//РегМенеджер.Автор = Автор;
		//РегМенеджер.Объект = Ссылка;
		//РегМенеджер.Тема = "Тест-драйв";
		//РегМенеджер.Описание = "Начало в "+ Формат(Начало, "ДФ=ЧЧ:мм") + ", клиент " + Строка(Клиент) + ", тел.: " + Renault_УправлениеКонтактнойИнформацией.ТелефонКлиента(Клиент);
		//РегМенеджер.РеальнаяДатаОповещения = ДатаПроведения + Час(ВремяНапоминания)*3600 + Минута(ВремяНапоминания)*60;
		//РегМенеджер.Записать(Истина);		
		//
		//РегМенеджер = РегистрыСведений.CRM_СобытияПоРабочимЛистам.СоздатьМенеджерЗаписи();
		//РегМенеджер.Период = ТекущаяДата();
		//РегМенеджер.ID = Новый УникальныйИдентификатор();
		//РегМенеджер.IDK = РабочийЛист;
		//РегМенеджер.Подразделение = Подразделение;
		////РегМенеджер.Отдел = Renault_CRM.ПолучитьОтделАвтосалона();
		//РегМенеджер.Комментарий = "Запись на тест-драйв " + Строка(Автомобиль);
		//РегМенеджер.ДатаНапоминания = ДатаПроведения + Час(Начало)*3600 + Минута(Начало)*60;
		//РегМенеджер.Сотрудник = Менеджер;
		//РегМенеджер.Автор = ПараметрыСеанса.Пользователь.Сотрудник;
		//РегМенеджер.Записать(Истина);
		
	КонецЕсли;
	
	//Запишем изменение статуса
	ПредыдущийСтатус = РегистрыСведений.CRM_СтатусыТД.ПолучитьПоследнее(, Новый Структура("ТестДрайв", Ссылка));
	Если НЕ ПредыдущийСтатус.Статус = СтатусДокумента Тогда
		РегМенеджер = РегистрыСведений.CRM_СтатусыТД.СоздатьМенеджерЗаписи();
		РегМенеджер.Период = ТекущаяДата();
		РегМенеджер.ТестДрайв = Ссылка;
		РегМенеджер.Статус = СтатусДокумента;
		РегМенеджер.Записать(Истина)
	КонецЕсли;
	
	//Попытка
	//	мПараметры = Новый Массив;
	//	мПараметры.Добавить(Ссылка);
	//	ФоновыеЗадания.Выполнить("Renault_РаботаСSalesTablet.ОбновитьДанныеТестДрайв",мПараметры);
	//Исключение
	//КонецПопытки;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Движения.CRM_ЗаписиНаТестДрайв.Очистить();
	Движения.CRM_ПроведенныйТестДрайв.Очистить();
	
	//Воронка продаж
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = РабочийЛист;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ТестДрайв;
	Запись.ДилерскийЦентр = ДилерскийЦентр;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.Удалить();
	КонецЕсли;
	
	//Статистика
	Renault_CRM.Статистика_Снять(Справочники.CRM_ЭтапыПродаж.ТестДрайв, РабочийЛист, Ссылка);
	
	УдалитьИмеющиесяНапоминания();
		
КонецПроцедуры

Процедура УдалитьИмеющиесяНапоминания()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Напоминания.Пользователь,
	|	Напоминания.Автор,
	|	Напоминания.Завершено,
	|	Напоминания.РеальнаяДатаОповещения,
	|	Напоминания.Объект
	|ИЗ
	|	РегистрСведений.Напоминания КАК Напоминания
	|ГДЕ
	|	Напоминания.Объект = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		РегМенеджер 						= РегистрыСведений.Напоминания.СоздатьМенеджерЗаписи();
		РегМенеджер.Пользователь 			= Выборка.Пользователь;
		РегМенеджер.Автор 					= Выборка.Автор;
		РегМенеджер.Завершено 				= Выборка.Завершено;
		РегМенеджер.РеальнаяДатаОповещения	= Выборка.РеальнаяДатаОповещения;
		РегМенеджер.Объект 					= Выборка.Объект;
		РегМенеджер.Удалить();
	КонецЦикла;
		
КонецПроцедуры
