Процедура ОтчетВыработкаИсполнителейКЗарплате(ДатаНачала=Неопределено,ДатаКонца=Неопределено) Экспорт
	ОтчетОбъект = Отчеты.ВыработкаИсполнителейКЗарплате.Создать();
	КлючОтчета = ОтчетОбъект.Метаданные().ПолноеИмя();
	ОтчетОбъект.ЗаполнитьНачальныеНастройки();
	
	КлючТекущегоВарианта = "";
	СписокВариантов = ХранилищаНастроек.ХранилищеВариантовОтчетов.ПолучитьСписок(КлючОтчета);
	Для Каждого ТекЭлемент Из СписокВариантов Цикл
		Если СтрНайти(ВРег(ТекЭлемент.Представление), "АВТОЛИГА") > 0 Тогда
			КлючТекущегоВарианта = ТекЭлемент.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(КлючТекущегоВарианта) Тогда
		НастройкиАвтолига = ХранилищаНастроек.ХранилищеВариантовОтчетов.ПолучитьНастройки(КлючОтчета, КлючТекущегоВарианта);
	Иначе
		НастройкиАвтолига = Неопределено;
	КонецЕсли;
	
	ВариантОтчета     = ОтчетОбъект.СхемаКомпоновкиДанных.ВариантыНастроек.Найти("Основной");
	НастройкиВарианта = ВариантОтчета.Настройки;
	
	Если НастройкиАвтолига = Неопределено Тогда
		Автолига = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000117");
		ОтчетыСервер.КомпоновщикУстановитьОтбор(НастройкиВарианта, "ПодразделениеКомпании", Автолига, ВидСравненияКомпоновкиДанных.ВИерархии);
		
	Иначе
		ОтборыАвтолига = НастройкиАвтолига.Отбор;
		Для Каждого ТекОтбор Из ОтборыАвтолига.Элементы Цикл
			Если ТекОтбор.Использование Тогда
				ОтчетыСервер.КомпоновщикУстановитьОтбор(НастройкиВарианта, ТекОтбор.ЛевоеЗначение, ТекОтбор.ПравоеЗначение, ТекОтбор.ВидСравнения);
			КонецЕсли;
		КонецЦикла;
		
		ПоляАвтолига = НастройкиАвтолига.Выбор.Элементы;
		ПоляОтчета = НастройкиВарианта.Выбор.Элементы;
		инд = 0;
		Для Каждого ТекПоле Из ПоляАвтолига Цикл
			ПоляОтчета[инд].Использование = ТекПоле.Использование;
			инд = инд + 1;
		КонецЦикла;
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДата();
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала", НачалоМесяца(ТекущаяДата));
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", КонецДня(ТекущаяДата));
	
	ФормаОтчета = ОтчетОбъект.ПолучитьФорму();
	ОтчетОбъект.СкомпоноватьРезультат(ФормаОтчета.ЭлементыФормы.Результат);
	ФормаОтчета.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	Для Каждого Элемент Из ФормаОтчета.ЭлементыФормы.ДействияФормы.Кнопки Цикл
		Если Элемент.Текст = "Сформировать" Тогда
			Продолжить;
		ИначеЕсли Элемент.Текст = "Действия" Тогда
			ФормаОтчета.ЭлементыФормы.ДействияФормы.Кнопки.Удалить(Элемент);
		Иначе
			Элемент.Доступность = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ФормаОтчета.Открыта() Тогда
		ФормаОтчета.Открыть();
	КонецЕсли;
КонецПроцедуры

/////////////////////////////////////////////////
ОтчетВыработкаИсполнителейКЗарплате();