
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли; 
	
	Если Параметры.Отбор.Свойство("РекламнаяКампания") Тогда
		РекламнаяКампания = Параметры.Отбор.РекламнаяКампания;
	КонецЕсли; 
	
	Элементы.ФормаОтправитьНаСогласование.КнопкаПоУмолчанию = Не ЗначениеЗаполнено(РекламнаяКампания);
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОтправитьНаСогласование(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
		
	СсылкаБизнесПроцесс = ОтправитьНаСогласованиеНаСервере(ТекущаяСтрока);
	
	ПараметрыФормы = Новый Структура("Ключ",СсылкаБизнесПроцесс);	
	ОткрытьФорму("БизнесПроцесс.DMS_СогласованиеМакетовРекламнойКампании.Форма.ФормаБизнесПроцесса",ПараметрыФормы,ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтправитьНаСогласованиеНаСервере(Ссылка)
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Предмет", Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
		|	СогласованиеМакетов.Ссылка КАК Ссылка
		|ИЗ
		|	БизнесПроцесс.DMS_СогласованиеМакетовРекламнойКампании КАК СогласованиеМакетов
		|ГДЕ
		|	СогласованиеМакетов.Предмет = &Предмет
		|	И НЕ СогласованиеМакетов.ПометкаУдаления
		|	И НЕ СогласованиеМакетов.Стартован
		|	И НЕ СогласованиеМакетов.Завершен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли; 
	
	БизнесПроцесс = БизнесПроцессы.DMS_СогласованиеМакетовРекламнойКампании.СоздатьБизнесПроцесс();
	БизнесПроцесс.Заполнить(Ссылка);
	
	БизнесПроцессСсылка = БизнесПроцессы.DMS_СогласованиеМакетовРекламнойКампании.ПолучитьСсылку();
	БизнесПроцесс.УстановитьСсылкуНового(БизнесПроцессСсылка);
	БизнесПроцесс.ОбменДанными.Загрузка = Истина;
	БизнесПроцесс.Записать();
	
	Возврат БизнесПроцессСсылка;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	DMS_РекламныеКампанииСервер.УсловноеОформлениеСпискаМакетовРекламнойКампании(ЭтаФорма);
	                             
КонецПроцедуры // УстановитьУсловноеОформление()

