////////////////////////////////////////////////////////////////////////////////
// Подсистема "Работа с почтовыми сообщениями".
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает указан ли в учетной записи пароль или нет
//
// см. описание функции ЭлектроннаяПочта.ПарольЗадан.
//
Функция ПарольЗадан(УчетнаяЗапись) Экспорт
	
	Возврат DMS_ЭлектроннаяПочта.ПарольЗадан(УчетнаяЗапись);
	
КонецФункции

// Проверка учетной записи электронной почты.
//
// см. описание процедуры ЭлектроннаяПочта.ПроверитьВозможностьОтправкиИПолученияЭлектроннойПочты.
//
Процедура ПроверитьВозможностьОтправкиИПолученияЭлектроннойПочты(УчетнаяЗапись, ПарольПараметр, СообщениеОбОшибке, ДополнительноеСообщение) Экспорт
	
	DMS_ЭлектроннаяПочта.ПроверитьВозможностьОтправкиИПолученияЭлектроннойПочты(УчетнаяЗапись, ПарольПараметр, СообщениеОбОшибке, ДополнительноеСообщение);
	
КонецПроцедуры

// Возвращает Истина, если текущему пользователю доступна по меньшей мере одна учетная запись для отправки.
Функция ЕстьДоступныеУчетныеЗаписиДляОтправки() Экспорт
	Возврат DMS_ЭлектроннаяПочта.ПолучитьДоступныеУчетныеЗаписи(Истина).Количество() > 0;
КонецФункции