
Процедура ДобавитьЗапись(РабочийЛист)Экспорт 
	Если ТипЗнч(РабочийЛист) <> Тип("ДокументСсылка.РабочийЛист") И
		 ТипЗнч(РабочийЛист) <> Тип("ДокументОбъект.РабочийЛист")Тогда
		//
		Возврат;
	КонецЕсли;
	МенеджерЗаписи 				= СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период		= ТекущаяДата();
	МенеджерЗаписи.РабочийЛист	= РабочийЛист;
	МенеджерЗаписи.Прочитать();
	
	Если Не МенеджерЗаписи.Выбран() Тогда
		СтандартныеРеквизиты = Метаданные.Документы.РабочийЛист.СтандартныеРеквизиты;
		Реквизиты = Метаданные.Документы.РабочийЛист.Реквизиты;
		СтруктураОбъекта = Новый Структура;
		Для Каждого СтандартныйРеквизит Из СтандартныеРеквизиты Цикл
			СтруктураОбъекта.Вставить(СтандартныйРеквизит.Имя,РабочийЛист[СтандартныйРеквизит.Имя]);
		КонецЦикла;
		Для Каждого Реквизит Из Реквизиты Цикл
			СтруктураОбъекта.Вставить(Реквизит.Имя,РабочийЛист[Реквизит.Имя]);
		КонецЦикла;
		МенеджерЗаписи.Период					= ТекущаяДата();
		МенеджерЗаписи.РабочийЛист				= РабочийЛист;
		МенеджерЗаписи.ВсеДанныеРабочегоЛиста	= ЗначениеВСтрокуВнутр(СтруктураОбъекта);
		МенеджерЗаписи.Записать();
	КонецЕсли;	
КонецПроцедуры

Функция ПолучитьЗапись()Экспорт
	
КонецФункции