 
 Функция ВыводТаблицы() Экспорт 

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль,
		|	ОстаткиАвтомобилейОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.ДилерскийЦентр КАК ДилерскийЦентр,
		|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.Организация КАК Владелец,
		|	ЗНАЧЕНИЕ(Перечисление.ЛогистическийСтатус.Склад) КАК ЛогистическийСтатус,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN КАК VIN,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель КАК Модель,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.Марка КАК Марка,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации КАК ВариантКомплектации,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.Артикул КАК КодВариантаКомплектации,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.Наименование КАК Цвет,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.Артикул КАК КодЦветаКузова,
		|	ПОДСТРОКА(СТРОКА(ОстаткиАвтомобилейОстатки.Автомобиль.ГодВыпуска), 7, 4) КАК ГодВыпуска,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ТипСалона КАК ЦветСалонаАвтомобиля,
		|	NULL КАК ЗаказПоставщикуСтатусАвтомобиля,
		|	ВЫРАЗИТЬ(ОстаткиАвтомобилейОстатки.Автомобиль.Комментарий КАК СТРОКА(256)) КАК Комментарий,
		|	Фото.КоличествоФото КАК КоличествоФото,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СтоимостьДопОборудования КАК СтоимостьДО,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн КАК СкидкаПриПокупкеВТрейдИн,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриПокупкеВКредит КАК СкидкаПриПокупкеВКредит,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ДатаРитейла КАК ДатаРитейла,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Оплачен КАК ОплаченПоставщику,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ДатаОплаты КАК ДатаОплаты,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Отчитан КАК Отчитан,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.БлокировкаПродажи КАК БлокировкаПродажи,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ДатаФинансирования КАК ДатаФинансирования,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.БанкФинансирования КАК БанкФинансирования,
		|	ОстаткиАвтомобилейОстатки.СкладКомпании КАК СкладТекущий,
		|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение КАК ПодразделениеТекущее,
		|	ВЫРАЗИТЬ(ОстаткиАвтомобилейОстатки.Автомобиль.КомментарийЛогиста КАК СТРОКА(256)) КАК КомментарийЛогиста
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилейОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			АвтомобилиПутьКФото.Ссылка КАК Ссылка,
		|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АвтомобилиПутьКФото.ИмяФото) КАК КоличествоФото
		|		ИЗ
		|			Справочник.Автомобили.ПутьКФото КАК АвтомобилиПутьКФото
		|		
		|		СГРУППИРОВАТЬ ПО
		|			АвтомобилиПутьКФото.Ссылка) КАК Фото
		|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = Фото.Ссылка
		|ГДЕ
		|	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиАвтомобилейОстатки.Автомобиль,
		|	ОстаткиАвтомобилейОстатки.КоличествоОстаток,
		|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.ДилерскийЦентр,
		|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.Организация,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.Марка,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.Артикул,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.Наименование,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.Артикул,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ТипСалона,
		|	ПОДСТРОКА(СТРОКА(ОстаткиАвтомобилейОстатки.Автомобиль.ГодВыпуска), 7, 4),
		|	ВЫРАЗИТЬ(ОстаткиАвтомобилейОстатки.Автомобиль.Комментарий КАК СТРОКА(256)),
		|	Фото.КоличествоФото,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СтоимостьДопОборудования,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриПокупкеВКредит,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ДатаРитейла,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Оплачен,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ДатаОплаты,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Отчитан,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.БлокировкаПродажи,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ДатаФинансирования,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.БанкФинансирования,
		|	ОстаткиАвтомобилейОстатки.СкладКомпании,
		|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение,
		|	ВЫРАЗИТЬ(ОстаткиАвтомобилейОстатки.Автомобиль.КомментарийЛогиста КАК СТРОКА(256))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказыАвтомобилейОстатки.Автомобиль,
		|	ЗаказыАвтомобилейОстатки.КоличествоОстаток,
		|	ЗаказыАвтомобилейОстатки.ЗаказПоставщику.ПодразделениеКомпании.ДилерскийЦентр,
		|	ЗаказыАвтомобилейОстатки.ЗаказПоставщику.ПодразделениеКомпании.Организация,
		|	ЗНАЧЕНИЕ(Перечисление.ЛогистическийСтатус.Заказ),
		|	ЗаказыАвтомобилейОстатки.Автомобиль.VIN,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.Модель,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.Модель.Марка,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.ВариантКомплектации,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.ВариантКомплектации.Артикул,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.Цвет.Наименование,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.Цвет.Артикул,
		|	ПОДСТРОКА(СТРОКА(ЗаказыАвтомобилейОстатки.Автомобиль.ГодВыпуска), 7, 4),
		|	ЗаказыАвтомобилейОстатки.Автомобиль.ТипСалона,
		|	ЗаказыАвтомобилейОстатки.ЗаказПоставщику.СтатусАвтомобиля,
		|	ВЫРАЗИТЬ(ЗаказыАвтомобилейОстатки.Автомобиль.Комментарий КАК СТРОКА(100)),
		|	Фото.КоличествоФото,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.СтоимостьДопОборудования,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.СкидкаПриПокупкеВКредит,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.ДатаРитейла,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.Оплачен,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.ДатаОплаты,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.Отчитан,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.БлокировкаПродажи,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.ДатаФинансирования,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.БанкФинансирования,
		|	"""",
		|	"""",
		|	ВЫРАЗИТЬ(ЗаказыАвтомобилейОстатки.Автомобиль.КомментарийЛогиста КАК СТРОКА(256))
		|ИЗ
		|	РегистрНакопления.ЗаказыПоставщикамНаАвтомобили.Остатки КАК ЗаказыАвтомобилейОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			АвтомобилиПутьКФото.Ссылка КАК Ссылка,
		|			КОЛИЧЕСТВО(АвтомобилиПутьКФото.ИмяФото) КАК КоличествоФото
		|		ИЗ
		|			Справочник.Автомобили.ПутьКФото КАК АвтомобилиПутьКФото
		|		
		|		СГРУППИРОВАТЬ ПО
		|			АвтомобилиПутьКФото.Ссылка) КАК Фото
		|		ПО ЗаказыАвтомобилейОстатки.Автомобиль = Фото.Ссылка
		|ГДЕ
		|	ЗаказыАвтомобилейОстатки.КоличествоОстаток > 0
		|	И ЗаказыАвтомобилейОстатки.ЗаказПоставщику.СтатусАвтомобиля <> &СтатусАвтомобиляФейк
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыАвтомобилейОстатки.Автомобиль,
		|	ЗаказыАвтомобилейОстатки.КоличествоОстаток,
		|	ЗаказыАвтомобилейОстатки.ЗаказПоставщику.ПодразделениеКомпании.ДилерскийЦентр,
		|	ЗаказыАвтомобилейОстатки.ЗаказПоставщику.ПодразделениеКомпании.Организация,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.VIN,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.Модель,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.Модель.Марка,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.ВариантКомплектации,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.ВариантКомплектации.Артикул,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.Цвет.Наименование,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.Цвет.Артикул,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.ТипСалона,
		|	ЗаказыАвтомобилейОстатки.ЗаказПоставщику.СтатусАвтомобиля,
		|	ПОДСТРОКА(СТРОКА(ЗаказыАвтомобилейОстатки.Автомобиль.ГодВыпуска), 7, 4),
		|	ВЫРАЗИТЬ(ЗаказыАвтомобилейОстатки.Автомобиль.Комментарий КАК СТРОКА(100)),
		|	Фото.КоличествоФото,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.СтоимостьДопОборудования,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.СкидкаПриПокупкеВКредит,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.ДатаРитейла,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.Оплачен,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.ДатаОплаты,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.Отчитан,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.БлокировкаПродажи,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.ДатаФинансирования,
		|	ЗаказыАвтомобилейОстатки.Автомобиль.БанкФинансирования,
		|	ВЫРАЗИТЬ(ЗаказыАвтомобилейОстатки.Автомобиль.КомментарийЛогиста КАК СТРОКА(256))";
	
	Запрос.УстановитьПараметр("СтатусАвтомобиляФейк",Справочники.СтатусыАвтомобилей.Фейк);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	//Сообщить("Запрос завершён "+ТекущаяДата());
	
 	//Бондаренко++ 20230204
	МаркаСписокВыбора = Новый СписокЗначений;
 	ВремТЗ = Новый ТаблицаЗначений;
  	ВремТЗ = ТЗ.Скопировать(,"Марка");
	ВремТЗ.Свернуть("Марка");
	ВремТЗ.Сортировать("Марка Возр");
	МаркаСписокВыбора.ЗагрузитьЗначения(ВремТЗ.ВыгрузитьКолонку("Марка"));
	
	ДилерскийЦентрСписокВыбора = Новый СписокЗначений;
	ВремТЗ = Новый ТаблицаЗначений;
  	ВремТЗ = ТЗ.Скопировать(,"ДилерскийЦентр");
	ВремТЗ.Свернуть("ДилерскийЦентр");
	ВремТЗ.Сортировать("ДилерскийЦентр Возр");
	ДилерскийЦентрСписокВыбора.ЗагрузитьЗначения(ВремТЗ.ВыгрузитьКолонку("ДилерскийЦентр"));
	
	ЛогистическийСтатусСписокВыбора = Новый СписокЗначений;
	ВремТЗ = Новый ТаблицаЗначений;
	ВремТЗ = ТЗ.Скопировать(,"ЛогистическийСтатус");
	ВремТЗ.Свернуть("ЛогистическийСтатус");
	ВремТЗ.Сортировать("ЛогистическийСтатус Возр");
	ЛогистическийСтатусСписокВыбора.ЗагрузитьЗначения(ВремТЗ.ВыгрузитьКолонку("ЛогистическийСтатус"));
	
	МодельСписокВыбора = Новый СписокЗначений;
	ВремТЗ = Новый ТаблицаЗначений;
	ВремТЗ = ТЗ.Скопировать(,"Модель");
	ВремТЗ.Свернуть("Модель");
	ВремТЗ.Сортировать("Модель Возр");
	МодельСписокВыбора.ЗагрузитьЗначения(ВремТЗ.ВыгрузитьКолонку("Модель"));
	
	ВладелецСписокВыбора = Новый СписокЗначений;
	ВремТЗ = Новый ТаблицаЗначений;
	ВремТЗ = ТЗ.Скопировать(,"Владелец");
	ВремТЗ.Свернуть("Владелец");
	ВремТЗ.Сортировать("Владелец Возр");
	ВладелецСписокВыбора.ЗагрузитьЗначения(ВремТЗ.ВыгрузитьКолонку("Владелец"));
	
	//Бондаренко++ 20230207
	ГодВыпускаСписокВыбора = Новый СписокЗначений;
	ВремТЗ = Новый ТаблицаЗначений;
	ВремТЗ = ТЗ.Скопировать(,"ГодВыпуска");
	ВремТЗ.Свернуть("ГодВыпуска");
	ВремТЗ.Сортировать("ГодВыпуска Убыв");
	ГодВыпускаСписокВыбора.ЗагрузитьЗначения(ВремТЗ.ВыгрузитьКолонку("ГодВыпуска")); 

	//Бондаренко++ 20231209
	НайдЗнач = ГодВыпускаСписокВыбора.НайтиПоЗначению("0001");
	Если НайдЗнач <> Неопределено Тогда
		НайдЗнач.Значение = "----";
 	КонецЕсли;
	//Бондаренко++ 20231209
	
	//ВремТЗ = Новый ТаблицаЗначений;
	//ВремТЗ = ТЗ.Скопировать(,"ТипКузова");
	//ВремТЗ.Свернуть("ТипКузова");
	//ВремТЗ.Сортировать("ТипКузова Возр");
	//ТипКузоваСписокВыбора.ЗагрузитьЗначения(ВремТЗ.ВыгрузитьКолонку("ТипКузова"));
   	//Бондаренко-- 20230207
	
	СписокАвто = Новый СписокЗначений;
	СписокАвто.ЗагрузитьЗначения(ТЗ.ВыгрузитьКолонку("Автомобиль"));
	
	//Бондаренко++ 20230221
	ТаблицаКомплАвто = ПолучитьТаблицуКомплАвто(СписокАвто);
	//Бондаренко-- 20230221
 	
	ТаблицаРРЦ = ПолучитьТаблицуРРЦ(СписокАвто);
 	ТаблицаПТС = ПолучитьТаблицуПТС(СписокАвто);
 	ТаблицаЗаказовКлиентов = ПолучитьТаблицуЗаказовКлиентов(СписокАвто);
 	ТаблицаЗаказовПоставщику = ПолучитьТаблицуЗаказовПоставщику(СписокАвто);
 	ТаблицаОстатковАвто = ПолучитьТаблицуОстатковАвто(СписокАвто);
  	//ТаблицаОстатковАвто.ВыбратьСтроку(ТаблицаОстатковАвто.Количество());
	
	//Бондаренко++ 20241108
	ТаблицаЗаявокНаРемонтПредпродажнаяПодготовка =  ПолучитьТаблицуЗаявокНаРемонтПредпродажнаяПодготовка(СписокАвто);
	//Бондаренко-- 20241108

	//Бондаренко++ 20250311
	ТаблицаЗаявокНаРемонтКомплектацияАвтомобиля =  ПолучитьТаблицуЗаявокНаРемонтКомплектацияАвтомобиля(СписокАвто);
	//ТаблицаЗаявокНаРемонтКомплектацияАвтомобиля.ВыбратьСтроку();
	//Бондаренко-- 20250311
	
	//Бондаренко++ 20231214
	ТаблицаКорректировокПоступленияАвто = ПолучитьТаблицуКорректировокПоступленияАвто(СписокАвто);
	//ТаблицаКорректировокПоступленияАвто.ВыбратьСтроку(ТаблицаКорректировокПоступленияАвто.Количество());
	//Бондаренко-- 20231214
	
	Состав = Обработки.ОстаткиАвтоНаСкладеИВЗаказахПоставщикам.Создать().Состав;
	
	Состав.Загрузить(ТЗ);
	
	ТЗ_СтатусСобственности = ПолучитьТаблицуСтатусСобственности(ТЗ);
	//ТЗ_СтатусСобственности.ВыбратьСтроку(ТЗ_СтатусСобственности.Количество());
	
	//Бондаренко++ 20230713
	ТЗ_ПереходВСобственность = ПолучитьТаблицуПереходВСобственность(ТЗ);
	//ТЗ_ПереходВСобственность.ВыбратьСтроку(ТЗ_ПереходВСобственность.Количество());
	//Бондаренко-- 20230713
	
	//Бондаренко++ 20230630
	ТЗ_ОпцииПроизводителя = ПолучитьТаблицуОпцийПроизводителя(ТЗ);
	//Бондаренко++ 20230630 
	
	//Бондарекно++ 20230701
	ТЗ_ВидАвтомобиля = ПолучитьТаблицуВидАвтомобиля(ТЗ);
	//Бондарекно-- 20230701
	
	//Бондаренко++ 20230801
	ТЗ_ДатаОкончанияОтсрочкиОплаты = ПолучитьТаблицуДатаОкончанияОтсрочкиОплаты(ТЗ);
	//Бондаренко++ 20230801 
	
	//Бондаренко++ 20230831 
	ТЗ_ТаблицаНезакрЗНиКомпл = ПолучитьТаблицуНезакрЗНиКомпл(ТЗ);
	//Бондаренко-- 20230831 
	
	//Бондаренко++ 20241116 
	ТЗ_ТаблицаАвтоШоуРум = ПолучитьТаблицуАвтоШоуРум(ТЗ);
	//ТЗ_ТаблицаАвтоШоуРум.ВыбратьСтроку();
	//Бондаренко-- 20231116 
	
	//Бондаренко++ 20250412
	ТЗ_ТаблицаПериодовБесплатногоХранения=ПолучитьТаблицуПериодовБесплатногоХранения(СписокАвто);
	//Бондаренко-- 20250412
 	
	//ТЗ.ВыбратьСтроку(ТЗ.Количество());
	
	//ПереходВСобственность = 0;
	
	//Сообщить("Начало обработки таблицы "+ТекущаяДата());
		
	//Бондаренко++ 20240118
	ДневнаяСтавкаЗаКредит = Константы.СтавкаЗаКредит.Получить() / ( 100 * 365 ); 
	//Бондаренко-- 20240118
 	Для каждого Стр Из Состав Цикл
		
				
		СтрАвтомобиль = Стр.Автомобиль;
		
		Если обЗначениеНеЗаполнено(Стр.Автомобиль) Тогда
 			Продолжить;
		КонецЕсли; 
		
		//Бондаренко++ 20230718
		Стр.КолАвто = 1;       
		//Бондаренко-- 20230718
		
		//Бондаренко++ 20231209
		Если Стр.ГодВыпуска = "0001" Тогда
		    Стр.ГодВыпуска = "----";
		КонецЕсли;
		//Бондаренко-- 20231209
		
		//Бондаренко++ 20230831 
		ПарОтбора = Новый Структура;
		ПарОтбора.Вставить("Автомобиль",Стр.Автомобиль);
		НайдСтроки = ТЗ_ТаблицаНезакрЗНиКомпл.НайтиСтроки(ПарОтбора);
		Если НайдСтроки.Количество() > 0 Тогда
			Стр.ЕстьНезакрытыеЗНиКомпл = Истина;
		КонецЕсли;
		//Бондаренко-- 20230831 
			
		//Бондаренко++ 20230603
		//СтруктураПоступления = СМ_ФормированиеНовыхОбъектов.ВернутьСтруктуруПоступления(Стр.Автомобиль,ТекущаяДата());
		//Если СтруктураПоступления <> Неопределено Тогда
		//	Если СтруктураПоступления.ХозОперация=Справочники.ХозОперации.ПоступлениеАвтомобилей Тогда
		//		Стр.СтатусПоступления = Перечисления.СтатусПоступленияАвтомобиля.ВСобственности;	
		//	ИначеЕсли СтруктураПоступления.ХозОперация=Справочники.ХозОперации.ПоступлениеАвтомобилейКомиссия Тогда
		//		Стр.СтатусПоступления = Перечисления.СтатусПоступленияАвтомобиля.НаКомиссии;		
		// 	КонецЕсли;
		//КонецЕсли; 
		
		//Бондаренко++ 20241116  
		Отбор = Новый Структура();
		Отбор.Вставить("Автомобиль",СтрАвтомобиль);
		Отбор.Вставить("ДилерскийЦентр",Стр.ДилерскийЦентр);
		Строки = ТЗ_ТаблицаАвтоШоуРум.НайтиСтроки(Отбор);
		Если Строки.Количество() > 0 Тогда
    		Стр.АвтоВШоуРум = 1;
		Иначе
			Стр.АвтоВШоуРум = 0;	
		КонецЕсли;
		//Бондаренко-- 20241116  
		
		НайденнаяСтрока = ТЗ_СтатусСобственности.Найти(СтрАвтомобиль, "Автомобиль"); 
		Если НайденнаяСтрока <> Неопределено Тогда
			Если НайденнаяСтрока.ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилей Тогда
				Стр.СтатусПоступления = Перечисления.СтатусПоступленияАвтомобиля.ВСобственности; 
			ИначеЕсли НайденнаяСтрока.ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилейКомиссия Тогда
				Стр.СтатусПоступления = Перечисления.СтатусПоступленияАвтомобиля.НаКомиссии; 
			КонецЕсли;                                                                     
		//Бондаренко++ 20230713	
		Иначе
			НайденнаяСтрока = ТЗ_ПереходВСобственность.Найти(СтрАвтомобиль, "Автомобиль"); 
			Если НайденнаяСтрока <> Неопределено Тогда
				Стр.СтатусПоступления = Перечисления.СтатусПоступленияАвтомобиля.ВСобственности;
				//ПереходВСобственность = ПереходВСобственность + 1;
				//Сообщить(СокрЛП(ПереходВСобственность)+")."+СтрАвтомобиль+" перешёл в собственность");
			КонецЕсли;	
		//Бондаренко++ 20230713		
		КонецЕсли; 
 		//Бондаренко-- 20230603	
 		
		//Бондаренко++ 20230630
		//  ТекОпции = Стр.Автомобиль.ОпцииПроизводителя;
	  	//  Если ТекОпции.Количество() > 0 Тогда
	  	//  	Для каждого Эл Из ТекОпции Цикл
	  	//  		Если НЕ СокрЛП(Стр.СписокОпцийПроизводителя) = "" Тогда
	  	//  			Стр.СписокОпцийПроизводителя = 	Стр.СписокОпцийПроизводителя+";"+СокрЛП(Эл.Опция.Наименование);
	  	//  		Иначе	
	  	//  			Стр.СписокОпцийПроизводителя = 	СокрЛП(Эл.Опция.Наименование);
	  	//		КонецЕсли;
	  	//		КонецЦикла;
	  	//КонецЕсли; 
		НайденнаяСтрока = ТЗ_ОпцииПроизводителя.Найти(СтрАвтомобиль, "Автомобиль");
		Если НайденнаяСтрока <> Неопределено Тогда
  		  	Стр.СписокОпцийПроизводителя = НайденнаяСтрока.СтрокаОпций; 
		Иначе
			Стр.СписокОпцийПроизводителя = ""; 
  	    КонецЕсли; 
		 		
		//ТекущийКомментарий = СокрЛП(Стр.Автомобиль.Комментарий); 
		//Если ТекущийКомментарий <> "" Тогда
		//	Стр.Комментарий = ТекущийКомментарий;
		//КонецЕсли;
 		//Бондаренко-- 20230630

		
		//Бондаренко++ 20230701
		//Стр.КоличествоФото = СтрАвтомобиль.ПутьКФото.Количество();
		//
		//Попытка
		//	Стр.ВидАвтомобиля = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Стр.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля, ТекущаяДата());
		//Исключение
		//КонецПопытки; 
		НайденнаяСтрока = ТЗ_ВидАвтомобиля.Найти(СтрАвтомобиль, "Автомобиль");
		Если НайденнаяСтрока <> Неопределено Тогда
  		  	Стр.ВидАвтомобиля = НайденнаяСтрока.ВидАвтомобиля; 
		Иначе
			Стр.ВидАвтомобиля = ""; 
  	    КонецЕсли; 
		//Бондаренко++ 20230701
 		
		//Бондаренко++ 20230204
				//Бондаренко-- 20230204
		
		//Бондаренко++ 20230801
 		НайденнаяСтрока = ТЗ_ДатаОкончанияОтсрочкиОплаты.Найти(СтрАвтомобиль, "Автомобиль");
		Если НайденнаяСтрока <> Неопределено Тогда
  		  	Стр.ДатаОкончанияОтсрочкиОплаты = НайденнаяСтрока.ДатаОкончанияОтсрочкиОплаты; 
		Иначе
			Стр.ДатаОкончанияОтсрочкиОплаты = ""; 
  	    КонецЕсли; 
		//Бондаренко-- 20230801
		
		//Бондаренко++ 20241109
		НайденнаяСтрока = ТаблицаЗаявокНаРемонтПредпродажнаяПодготовка.Найти(СтрАвтомобиль, "Автомобиль");
		Если НайденнаяСтрока <> Неопределено Тогда
  		  	Стр.ПредпродажнаяПодготовкаЗаявкаНаРемонт = НайденнаяСтрока.ПредпродажнаяПодготовкаЗаявкаНаРемонт; 
		Иначе
			Стр.ПредпродажнаяПодготовкаЗаявкаНаРемонт = ""; 
  	    КонецЕсли; 
		//Бондаренко-- 20241109
		
		//Бондаренко++ 20250311
		НайденнаяСтрока = ТаблицаЗаявокНаРемонтКомплектацияАвтомобиля.Найти(СтрАвтомобиль, "Автомобиль");
		Если НайденнаяСтрока <> Неопределено Тогда
  		  	Стр.УстановкаДОЗаявкаНаРемонт = НайденнаяСтрока.УстановкаДОЗаявкаНаРемонт; 
		Иначе
			Стр.УстановкаДОЗаявкаНаРемонт = ""; 
  	    КонецЕсли; 
		//Бондаренко-- 20250311

		//Стр.СрокХранения = СрокХранения(Стр.Автомобиль);
		
		Если НЕ обЗначениеНеЗаполнено(Стр.ВариантКомплектации)  Тогда
			Стр.ТипКузова = Стр.ВариантКомплектации.ТипКузова;
			Стр.ТипКПП = Стр.ВариантКомплектации.ТипКПП;
			Стр.ТипПривода = Стр.ВариантКомплектации.Привод;
			Стр.ТипТоплива = Стр.ВариантКомплектации.ТипДвигателя.ТипТоплива;
		Иначе	
			Стр.ТипКузова = СтрАвтомобиль.ТипКузова;
 			Стр.ТипКПП = СтрАвтомобиль.ТипКПП;
			Стр.ТипПривода = СтрАвтомобиль.Привод;
			Стр.ТипТоплива = СтрАвтомобиль.ТипДвигателя.ТипТоплива;
		КонецЕсли;
		
  		//Бондаренко-- 20230207
  		
 		//Стр.СтоимостьДО = СтрАвтомобиль.СтоимостьДопОборудования;
		
		//Бондаренко++ 20230216
		//Стр.СкидкаПриПокупкеВТрейдИн = Стр.Автомобиль.СкидаПриПокупкеВТрейдИн;
		//Стр.СкидкаПриПокупкеВКредит = Стр.Автомобиль.СкидкаПриПокупкеВКредит;
		//Бондаренко-- 20230216
		
		//Бондаренко++ 20230302
		//Стр.ДатаРитейла = Стр.Автомобиль.ДатаРитейла;
		//Бондаренко-- 20230302
  		 		
		Стр.РРЦ = ОпределитьРРЦ(Стр.Автомобиль,ТаблицаРРЦ); 
		
		//Бондаренко++ 20230221
		Стр.СебестоимостьДО = Формат(ОпределитьСебестоимостьДО(Стр.Автомобиль,ТаблицаКомплАвто),"ЧЦ=15; ЧДЦ=2");
		//Бондаренко-- 20230221
 		
		Стр.НомерПТС = ОпределитьПТС(Стр.Автомобиль,ТаблицаПТС); 
		
		//Бондаренко++ 20230606
		Если Стр.ВидАвтомобиля = Перечисления.ВидАвтомобиля.ПараллельныйИмпорт Тогда
			ДатаВыдачиПТС = ОпределитьДатуВыдачиПТС(Стр.Автомобиль,ТаблицаПТС); 
			Если ДатаВыдачиПТС <> Неопределено Тогда
			    Если ( ( ТекущаяДата() - Дата(ДатаВыдачиПТС) ) / 86400 ) < 90 Тогда
					Стр.ГарантияПИ = Истина;
					Стр.РРЦ = Стр.РРЦ * 1.000; 
					//1.0228 было
 				КонецЕсли;
 			КонецЕсли;
 		КонецЕсли;
 		//Бондаренко++ 20230606
		
		ПарОтбора = Новый Структура();
		ПарОтбора.Вставить("Автомобиль",Стр.Автомобиль);                    
		
		НайдСтроки = ТаблицаЗаказовКлиентов.НайтиСтроки(ПарОтбора);
	
		Если НайдСтроки.Количество() > 0 Тогда
	   		Стр.ЗаказНаАвтомобиль = НайдСтроки[0].ЗаказНаАвтомобиль;                                   
			//Бондаренко++ 20240120
			Стр.РодительПодразделенияЗаказаНаАвтомобиль = НайдСтроки[0].ЗаказНаАвтомобиль.ПодразделениеКомпании.Родитель;
			//Бондаренко-- 20240120
			Стр.Клиент = НайдСтроки[0].Клиент;
			Стр.СуммаПредоплаты = НайдСтроки[0].СуммаПредоплаты;
			Стр.Менеджер = НайдСтроки[0].Менеджер;                    
			//Бондаренко++ 20230520
			Стр.ФактическиОплачено = НайдСтроки[0].ФактическиОплачено;
			//Бондаренко-- 20230520
 		КонецЕсли; 
		
		НайдСтроки = ТаблицаЗаказовПоставщику.НайтиСтроки(ПарОтбора);
	
		Если НайдСтроки.Количество() > 0 Тогда
			Если СокрЛП(Стр.ЛогистическийСтатус) <> "Склад" Тогда
		   		Стр.ЗаказПоставщикуНаАвтомобиль = НайдСтроки[0].ЗаказПоставщику;
				Стр.ДатаДоставки = НайдСтроки[0].СрокПоставки;
				//Бондаренко++ 20230701
				Стр.ВнешнийНомерЗаказа = НайдСтроки[0].ВнешнийНомерЗаказа;
  				Стр.Инвойс = НайдСтроки[0].Инвойс;
				//Бондаренко-- 20230701
			КонецЕсли;
		КонецЕсли;
		
		//Бондаренко++ 20231214
		НайдСтрокиКорректировок = ТаблицаКорректировокПоступленияАвто.НайтиСтроки(ПарОтбора);
		//Бондаренко-- 20231214
		
		НайдСтроки = ТаблицаОстатковАвто.НайтиСтроки(ПарОтбора);
		
		Если НайдСтроки.Количество() > 0 Тогда
			//Бондаренко++ 202040906
			Стр.Партия = НайдСтроки[0].Партия;
			//Бондаренко-- 202040906
			Если СокрЛП(Стр.ЛогистическийСтатус) = "Склад" Тогда
				Попытка
					Стр.Инвойс = НайдСтроки[0].Инвойс;
					Стр.СрокХранения = Цел ( ( НачалоДня(ТекущаяДата()) - НачалоДня(НайдСтроки[0].ДатаПоступления) ) / 86400 );
					//Бондаренко++ 20230817
					//Стр.ЦенаОферты = НайдСтроки[0].ЦенаОфертыПоступленияАвто;
					//Бондаренко-- 20230817
					//Бондаренко++ 20240528
					Стр.ПлощадкаПервоначальногоПоступления = НайдСтроки[0].ПлощадкаПервоначальногоПоступления;
					//Бондаренко-- 20240528
					Если НайдСтрокиКорректировок.Количество() > 0 Тогда
						Для каждого Эл Из НайдСтрокиКорректировок Цикл
							Если Эл.Дата < НайдСтроки[0].ДатаПоступления Тогда
								Продолжить;
							КонецЕсли;
							Стр.Инвойс = Стр.Инвойс + Эл.СуммаРазница;	
 						КонецЦикла;
 					КонецЕсли;
				Исключение
					Попытка
						Стр.Инвойс = НайдСтроки[0].Инвойс2;
						Стр.СрокХранения = Цел ( ( НачалоДня(ТекущаяДата()) - НачалоДня(НайдСтроки[0].ДатаПоступления2) ) / 86400 );
						//Бондаренко++ 20240528
						Стр.ПлощадкаПервоначальногоПоступления = НайдСтроки[0].ПлощадкаПервоначальногоПоступления2;
						//Бондаренко-- 20240528
 					Исключение
					КонецПопытки;
				КонецПопытки;
				//Бондаренко++ 20240118
				Если ДневнаяСтавкаЗаКредит > 0 Тогда
					Если Стр.СрокХранения > 0 Тогда
						Если Стр.Инвойс > 0 Тогда
							Стр.СтоимостьСуточногоХранения = ДневнаяСтавкаЗаКредит * Стр.Инвойс; 
							Стр.ОбщаяСтоимостьХранения = Стр.СтоимостьСуточногоХранения * Стр.СрокХранения;
							//Бондаренко++ 20250412
							Если Стр.Автомобиль.ДатаФинансирования <> Дата(1,1,1) Тогда
								Если Стр.ВидАвтомобиля = Перечисления.ВидАвтомобиля.Новый ИЛИ
									 Стр.ВидАвтомобиля = Перечисления.ВидАвтомобиля.ТестовыйАвтомобиль ИЛИ
									 Стр.ВидАвтомобиля = Перечисления.ВидАвтомобиля.ТехническийАвтомобиль Тогда
										БесплПериодВДнях = ОпределитьБесплатныйПериод(Стр.Автомобиль,ТЗ_ТаблицаПериодовБесплатногоХранения);											
										Если БесплПериодВДнях > 0 Тогда
											ДатаНачалаПлатногоХранения = Стр.Автомобиль.ДатаФинансирования + БесплПериодВДнях*86400;  
											Если НачалоДня(ДатаНачалаПлатногоХранения) > НачалоДня(ТекущаяДата()) Тогда
												Стр.ОбщаяСтоимостьХранения = 0;
												Если РольДоступна("СМ_Разработчик1С") Тогда
													СМГ_Сообщить("Обнулили стоимость хранения для "+Стр.Автомобиль+" т.к. ДатаНачалаПлатногоХранения "+ДатаНачалаПлатногоХранения);	
												КонецЕсли;
											Иначе
 												ДнейОплачиваемогоХранения= Цел( ( НачалоДня(ТекущаяДата()) - НачалоДня(Стр.ДатаФинансирования) ) / 86400 );
												Если ДнейОплачиваемогоХранения > 0 Тогда                           
													Если Стр.СрокХранения > 0 Тогда
														Если ДнейОплачиваемогоХранения < Стр.СрокХранения Тогда                           
															Если РольДоступна("СМ_Разработчик1С") Тогда
 																СМГ_Сообщить("Срок хранения уменьшается "+Стр.Автомобиль+" с "+Стр.СрокХранения+" до "+ ДнейОплачиваемогоХранения);		
															КонецЕсли;
															Стр.СрокХранения = ДнейОплачиваемогоХранения;
															Стр.ОбщаяСтоимостьХранения = Стр.СтоимостьСуточногоХранения * Стр.СрокХранения;
														КонецЕсли;
													КонецЕсли;	
 												КонецЕсли;
 											КонецЕсли;
 										КонецЕсли;
 								КонецЕсли;
 							КонецЕсли;
							//Бондаренко-- 20250412
 						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				//Бондаренко-- 20240118
			КонецЕсли;
		КонецЕсли;
		
		//Бондаренко++ 20240907
 		Если Стр.Марка = Справочники.Марка.CHANGAN Тогда
			Если Стр.ВидАвтомобиля = Перечисления.ВидАвтомобиля.Новый Тогда
				ИнвойсЧанган = 0;
				ИнвойсЧанган = ПолучитьИнвойсЧанган(Стр.Автомобиль);				
				Если ИнвойсЧанган > 0 Тогда
					Стр.Инвойс = ИнвойсЧанган;
 				КонецЕсли;
			КонецЕсли;
 		КонецЕсли;
 		//Бондаренко-- 20240907
		
		//Бондаренко++ 20230628
		//Стр.ОплаченПоставщику = Стр.Автомобиль.Оплачен;
		//Бондаренко-- 20230628
   		
	КонецЦикла; 
	
	Состав.Сортировать("СрокХранения Убыв");
	
	Возврат Состав;
	
КонецФункции 

//Бондаренко++ 20040907
Функция ПолучитьИнвойсЧанган(Авто)
	
	ИнвойсРассчетный_ = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РассчетныйИнвойсСрезПоследних.Автомобиль КАК Автомобиль,
		|	РассчетныйИнвойсСрезПоследних.ИнвойсРассчетный КАК ИнвойсРассчетный
		|ИЗ
		|	РегистрСведений.РассчетныйИнвойс.СрезПоследних КАК РассчетныйИнвойсСрезПоследних
		|ГДЕ
		|	РассчетныйИнвойсСрезПоследних.Автомобиль = &Авто";
	
	Запрос.УстановитьПараметр("Авто", Авто);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ИнвойсРассчетный_ = ВыборкаДетальныеЗаписи.ИнвойсРассчетный;
	КонецЦикла;
	
	Возврат ИнвойсРассчетный_;
 
КонецФункции // ПолучитьИнвойсЧанган(Авто) 

Функция ОпределитьБесплатныйПериод(Авто,ТЗ_ТаблицаПериодовБесплатногоХранения)
	
	НайдБесплПериод = 0;
	
	ПарОтбора = Новый Структура();
	ПарОтбора.Вставить("Автомобиль",Авто);
	НайдСтроки = ТЗ_ТаблицаПериодовБесплатногоХранения.НайтиСтроки(ПарОтбора);
	
	Если НайдСтроки.Количество() > 0 Тогда
	   	НайдБесплПериод = НайдСтроки[0].КоличествоДнейПоМодели;
		Если обЗначениеНеЗаполнено(НайдБесплПериод) Тогда
			НайдБесплПериод = НайдСтроки[0].КоличествоДнейПоМарке;
		КонецЕсли;	
	 КонецЕсли;
	
	Возврат НайдБесплПериод;

КонецФункции // ОпределитьРРЦ()
//Бондаренко-- 20250412
//Бондаренко++ 20230606
Функция ОпределитьДатуВыдачиПТС(Авто,ТЗ_ПТС)
	
	НайдДата = Неопределено;
	
	ПарОтбора = Новый Структура();
	ПарОтбора.Вставить("Автомобиль",Авто);                    
    НайдСтроки = ТЗ_ПТС.НайтиСтроки(ПарОтбора);
	
	Если НайдСтроки.Количество() > 0 Тогда
	   	НайдДата = СокрЛП(НайдСтроки[0].ДатаВыдачи);
 	КонецЕсли;
	
	Возврат НайдДата;

КонецФункции // ОпределитьДатуВыдачиПТС(Авто,ТЗ_ПТС)
//Бондаренко-- 20230       


//Бондаренко-- 20040907

//Бондаренко++ 20241109
Функция ПолучитьТаблицуЗаявокНаРемонтПредпродажнаяПодготовка(СпАвто)
	
	ТЗ = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;  

   	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаРемонт.Ссылка КАК ПредпродажнаяПодготовкаЗаявкаНаРемонт,
		|	ЗаявкаНаРемонт.Автомобиль КАК Автомобиль,
		|	ЗаявкаНаРемонт.ВидРемонта КАК ВидРемонта,
		|	ЗаявкаНаРемонт.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
		|ГДЕ
		|	ЗаявкаНаРемонт.Автомобиль В(&СпАвто)
		|	И НЕ ЗаявкаНаРемонт.ПометкаУдаления
		|	И ЗаявкаНаРемонт.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПредпродажнаяПодготовка)";
	
	Запрос.УстановитьПараметр("СпАвто", СпАвто);
 	
	ТЗ =  Запрос.Выполнить().Выгрузить();
	
 	Возврат ТЗ;
 
КонецФункции // ПолучитьТаблицуЗаявокНаРемонтПредпродажнаяПодготовка(СпАвто)
//Бондаренко-- 20241109

//Бондаренко++ 20250311
Функция ПолучитьТаблицуЗаявокНаРемонтКомплектацияАвтомобиля(СпАвто)
	
	ТЗ = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;  

   	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаРемонт.Ссылка КАК УстановкаДОЗаявкаНаРемонт,
		|	ЗаявкаНаРемонт.Автомобиль КАК Автомобиль,
		|	ЗаявкаНаРемонт.ВидРемонта КАК ВидРемонта,
		|	ЗаявкаНаРемонт.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
		|ГДЕ
		|	ЗаявкаНаРемонт.Автомобиль В(&СпАвто)
		|	И НЕ ЗаявкаНаРемонт.ПометкаУдаления
		|	И ЗаявкаНаРемонт.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.КомплектацияАвтомобиля)";
	
	Запрос.УстановитьПараметр("СпАвто", СпАвто);   
	
 	ТЗ =  Запрос.Выполнить().Выгрузить();
	
 	Возврат ТЗ;
 
КонецФункции // ПолучитьТаблицуЗаявокНаРемонтКомплектацияАвтомобиля(СпАвто)
//Бондаренко-- 20250311

Функция ПолучитьТаблицуОстатковАвто(СпАвто)
	
	ТЗ = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;  

  	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиАвтомобилей.Автомобиль КАК Автомобиль,
		|	ОстаткиАвтомобилей.Партия КАК Партия,
		|	ОстаткиАвтомобилей.СкладКомпании КАК СкладКомпании,
		|	ОстаткиАвтомобилей.КоличествоОстаток КАК КоличествоОстаток,
		|	ВложенныйЗапросПоступление.СуммаВсего КАК Инвойс,
		|	ВложенныйЗапросПоступление.Ссылка.Дата КАК ДатаПоступления,
		|	ВложенныйЗапросВводОстатков.СуммаВсего КАК Инвойс2,
		|	ВложенныйЗапросВводОстатков.Ссылка.Дата КАК ДатаПоступления2,
		|	ВложенныйЗапросПоступление.ЦенаОфертыПоступленияАвто КАК ЦенаОфертыПоступленияАвто,
		|	ВложенныйЗапросПоступление.ПлощадкаПервоначальногоПоступления КАК ПлощадкаПервоначальногоПоступления,
		|	ВложенныйЗапросВводОстатков.ПлощадкаПервоначальногоПоступления КАК ПлощадкаПервоначальногоПоступления2
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилей
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ПоступлениеАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
		|			ПоступлениеАвтомобилейАвтомобили.СуммаВсего КАК СуммаВсего,
		|			ПоступлениеАвтомобилейАвтомобили.Ссылка КАК Ссылка,
		|			ПоступлениеАвтомобилейАвтомобили.ЦенаОферты КАК ЦенаОфертыПоступленияАвто,
		|			ПоступлениеАвтомобилейАвтомобили.Ссылка.ПодразделениеКомпании.Родитель КАК ПлощадкаПервоначальногоПоступления
		|		ИЗ
		|			Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили) КАК ВложенныйЗапросПоступление
		|		ПО ОстаткиАвтомобилей.Автомобиль = ВложенныйЗапросПоступление.Автомобиль
		|			И ОстаткиАвтомобилей.Партия = ВложенныйЗапросПоступление.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ПоступлениеАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
		|			ПоступлениеАвтомобилейАвтомобили.СуммаВсего КАК СуммаВсего,
		|			ПоступлениеАвтомобилейАвтомобили.Ссылка КАК Ссылка,
		|			ПоступлениеАвтомобилейАвтомобили.Ссылка.ПодразделениеКомпании.Родитель КАК ПлощадкаПервоначальногоПоступления
		|		ИЗ
		|			Документ.ВводОстатковАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили) КАК ВложенныйЗапросВводОстатков
		|		ПО ОстаткиАвтомобилей.Автомобиль = ВложенныйЗапросВводОстатков.Автомобиль
		|			И ОстаткиАвтомобилей.Партия = ВложенныйЗапросВводОстатков.Ссылка
		|ГДЕ
		|	ОстаткиАвтомобилей.КоличествоОстаток > 0
		|	И ОстаткиАвтомобилей.Автомобиль В(&СпАвто)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЦенаОфертыПоступленияАвто УБЫВ"; 
  	
	Запрос.УстановитьПараметр("СпАвто", СпАвто);    
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;                                               
	
КонецФункции // ПолучитьТаблицуОстатковАвто(СпАвто)

Функция ПолучитьТаблицуЗаказовПоставщику(СпАвто)
	
	ТЗ = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос; 
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказыАвтомобилейОстатки.Автомобиль КАК Автомобиль,
		|	ЗаказыАвтомобилейОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
		|	ЗаказыАвтомобилейОстатки.ЗаказПоставщику.СрокПоставки КАК СрокПоставки,
		|	ЗаказыАвтомобилейОстатки.ЗаказПоставщику.СтатусАвтомобиля КАК СтатусАвтомобиля,
		|	ЗаказыАвтомобилейОстатки.ЗаказПоставщику.ВнешнийНомерЗаказа КАК ВнешнийНомерЗаказа,
		|	ЗаказыАвтомобилейОстатки.ЗаказПоставщику.СуммаВсегоНаАвтомобиль КАК Инвойс
		|ИЗ
		|	РегистрНакопления.ЗаказыПоставщикамНаАвтомобили.Остатки КАК ЗаказыАвтомобилейОстатки
		|ГДЕ
		|	ЗаказыАвтомобилейОстатки.КоличествоОстаток > 0
		|	И ЗаказыАвтомобилейОстатки.Автомобиль В(&СпАвто)
		|	И НЕ ЗаказыАвтомобилейОстатки.ЗаказПоставщику.СтатусАвтомобиля = &СтатусАвтомобиляФейк"; 
	
	Запрос.УстановитьПараметр("СтатусАвтомобиляФейк",Справочники.СтатусыАвтомобилей.Фейк);
	
	Запрос.УстановитьПараметр("СпАвто", СпАвто);    
	
 	ТЗ = Запрос.Выполнить().Выгрузить();
	
 	Возврат ТЗ;                                               
 
КонецФункции // ПолучитьТаблицуЗаказовПоставщику(СпАвто)
 
Функция ПолучитьТаблицуЗаказовКлиентов(СпАвто)
	
	ТЗ = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос; 
	
	//Бондаренко++ 20231213
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ЗаказыАвтомобилейОстатки.Автомобиль,
	//|	ЗаказыАвтомобилейОстатки.Заказ КАК ЗаказНаАвтомобиль,
	//|	ЗаказыАвтомобилейОстатки.КоличествоОстаток,
	//|	ЗаказыАвтомобилейОстатки.Заказ.Заказчик КАК Клиент,
	//|	ЗаказыАвтомобилейОстатки.Заказ.Менеджер КАК Менеджер,
	//|	ЗаказыАвтомобилейОстатки.Заказ.СуммаПредоплаты КАК СуммаПредоплаты,
	//|	-Взаиморасчеты.СуммаОстаток КАК ФактическиОплачено
	//|ИЗ
	//|	РегистрНакопления.ЗаказыАвтомобилей.Остатки КАК ЗаказыАвтомобилейОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			СУММА(ВзаиморасчетыКомпанииОстатки.СуммаОстаток) КАК СуммаОстаток,
	//|			ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов
	//|		ИЗ
	//|			РегистрНакопления.ВзаиморасчетыКомпании.Остатки КАК ВзаиморасчетыКомпанииОстатки
	//|		
	//|		СГРУППИРОВАТЬ ПО
	//|			ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов) КАК Взаиморасчеты
	//|		ПО ЗаказыАвтомобилейОстатки.Заказ.ДоговорВзаиморасчетов = Взаиморасчеты.ДоговорВзаиморасчетов
	//|ГДЕ
	//|	ЗаказыАвтомобилейОстатки.КоличествоОстаток > 0
	//|	И ЗаказыАвтомобилейОстатки.Автомобиль В(&СпАвто)"; 
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыАвтомобилейОстатки.Автомобиль,
	|	ЗаказыАвтомобилейОстатки.Заказ КАК ЗаказНаАвтомобиль,
	|	ЗаказыАвтомобилейОстатки.КоличествоОстаток,
	|	ЗаказыАвтомобилейОстатки.Заказ.Заказчик КАК Клиент,
	|	ЗаказыАвтомобилейОстатки.Заказ.Менеджер КАК Менеджер,
	|	ЗаказыАвтомобилейОстатки.Заказ.СуммаПредоплаты КАК СуммаПредоплаты,
	|	-Взаиморасчеты.СуммаОстаток КАК ФактическиОплачено
	|ИЗ
	|	РегистрНакопления.ЗаказыАвтомобилей.Остатки КАК ЗаказыАвтомобилейОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ВзаиморасчетыКомпанииОстатки.СуммаОстаток) КАК СуммаОстаток,
	|			ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|			ВзаиморасчетыКомпанииОстатки.Сделка КАК Сделка
	|		ИЗ
	|			РегистрНакопления.ВзаиморасчетыКомпании.Остатки КАК ВзаиморасчетыКомпанииОстатки
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов,
	|			ВзаиморасчетыКомпанииОстатки.Сделка) КАК Взаиморасчеты
	|		ПО ЗаказыАвтомобилейОстатки.Заказ = Взаиморасчеты.Сделка
	|ГДЕ
	|	ЗаказыАвтомобилейОстатки.КоличествоОстаток > 0
	|	И ЗаказыАвтомобилейОстатки.Автомобиль В(&СпАвто)";	
	//Бондаренко-- 20231213
	
	Запрос.УстановитьПараметр("СпАвто", СпАвто);    
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;                                               
	
КонецФункции // ПолучитьТаблицуЗаказовКлиентов(СпАвто)

Функция ПолучитьТаблицуПТС(СпАвто)
	
	ТЗ = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос; 
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодтверждающиеДокументы.Ссылка,
		|	ПодтверждающиеДокументы.Владелец КАК Автомобиль,
		|	ПодтверждающиеДокументы.Номер,
		|	ПодтверждающиеДокументы.Текущий,
		|	ПодтверждающиеДокументы.ВидПодтверждающегоДокумента,
		|	ПодтверждающиеДокументы.Серия,
		|	ПодтверждающиеДокументы.ДатаВыдачи
		|ИЗ
		|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
		|ГДЕ
		|	ПодтверждающиеДокументы.Владелец В(&СпАвто)
		|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента В(&СпВидПодтверждающегоДокумента)
		|	И ПодтверждающиеДокументы.Текущий";
	
	Запрос.УстановитьПараметр("СпАвто", СпАвто);    
	
	СпВидДок = Новый СписокЗначений;
	СпВидДок.Добавить(Перечисления.ВидыДокументов.ПТС);
	СпВидДок.Добавить(Перечисления.ВидыДокументов.ВыпискаИзЭлектронногоПаспорта);
	
	Запрос.УстановитьПараметр("СпВидПодтверждающегоДокумента",СпВидДок);
  	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
 	Возврат ТЗ;                                               
 
КонецФункции // ПолучитьТаблицуПТС(СпАвто)

Функция ОпределитьПТС(Авто,ТЗ_ПТС)
	
	НайдНомер = "";
	
	ПарОтбора = Новый Структура();
	ПарОтбора.Вставить("Автомобиль",Авто);                    
    НайдСтроки = ТЗ_ПТС.НайтиСтроки(ПарОтбора);
	
	Если НайдСтроки.Количество() > 0 Тогда
	   	НайдНомер = СокрЛП(НайдСтроки[0].Серия+" "+НайдСтроки[0].Номер);
 	КонецЕсли;
	
	Возврат НайдНомер;

КонецФункции // ОпределитьПТС(Авто,ТЗ_ПТС)

 
Функция ОпределитьРРЦ(Авто,ТЗ_РРЦ)
	
	НайдЦена = "";
	
	ПарОтбора = Новый Структура();
	ПарОтбора.Вставить("Автомобиль",Авто);
    НайдСтроки = ТЗ_РРЦ.НайтиСтроки(ПарОтбора);
	
	Если НайдСтроки.Количество() > 0 Тогда
	   	НайдЦена = НайдСтроки[0].Цена;
 	КонецЕсли;
	
	Возврат НайдЦена;

КонецФункции // ОпределитьРРЦ()

Функция ПолучитьТаблицуРРЦ(СпАвто)
	
	ТЗ = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос; 
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныАвтомобилейСрезПоследних.ТипЦен,
		|	ЦеныАвтомобилейСрезПоследних.Автомобиль,
		|	ЦеныАвтомобилейСрезПоследних.Цена
		|ИЗ
		|	РегистрСведений.ЦеныАвтомобилей.СрезПоследних КАК ЦеныАвтомобилейСрезПоследних
		|ГДЕ
		|	ЦеныАвтомобилейСрезПоследних.Автомобиль В(&СпАвто)
		|	И ЦеныАвтомобилейСрезПоследних.ТипЦен = &ТипЦен";
	
	Запрос.УстановитьПараметр("СпАвто", СпАвто);
	Запрос.УстановитьПараметр("ТипЦен", Справочники.ТипыЦен.ОсновнойТипЦенПродажи);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
 
КонецФункции // ПолучитьТаблицуРРЦ(СпАвто) 

//Бондаренко++ 20230221
Функция ПолучитьТаблицуКомплАвто(СпАвто)
	
	ТЗ = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос; 
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СМГ_КомплектацияАвтомобилейАвтоработыОстатки.Автомобиль,
		|	СМГ_КомплектацияАвтомобилейАвтоработыОстатки.СуммаУпрОстаток
		|ИЗ
		|	РегистрНакопления.СМГ_КомплектацияАвтомобилейАвтоработы.Остатки КАК СМГ_КомплектацияАвтомобилейАвтоработыОстатки
		|ГДЕ
		|	СМГ_КомплектацияАвтомобилейАвтоработыОстатки.Автомобиль В(&СпАвто)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КомплектацияАвтомобилейОстатки.Автомобиль,
		|	КомплектацияАвтомобилейОстатки.СуммаУпрОстаток
		|ИЗ
		|	РегистрНакопления.КомплектацияАвтомобилей.Остатки КАК КомплектацияАвтомобилейОстатки
		|ГДЕ
		|	КомплектацияАвтомобилейОстатки.Автомобиль В(&СпАвто)";
	    
	Запрос.УстановитьПараметр("СпАвто", СпАвто);
 	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	//Бондаренко++ 20240116
	ТЗ.Свернуть("Автомобиль","СуммаУпрОстаток");
	//Бондаренко-- 20240116
	
	//ТЗ.ВыбратьСтроку(ТЗ.Количество());
	
	Возврат ТЗ;
 
КонецФункции // ПолучитьТаблицуКомплАвто(СпАвто)

Функция ОпределитьСебестоимостьДО(Авто,ТЗ_КомплАвто)
	
	НайдСебес = "";
	
	ПарОтбора = Новый Структура();
	ПарОтбора.Вставить("Автомобиль",Авто);
    НайдСтроки = ТЗ_КомплАвто.НайтиСтроки(ПарОтбора);
	
	Если НайдСтроки.Количество() > 0 Тогда
	   	НайдСебес = НайдСтроки[0].СуммаУпрОстаток;
 	КонецЕсли;
	
	Возврат НайдСебес;

КонецФункции // ОпределитьСебестоимостьДО()

//Бондаренко-- 20230221
  
Функция ЭтоНовыйАвтомобиль(Автомобиль)
	
	ЭтоНовый = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвтомобилиСрезПоследних.Автомобиль,
		|	АвтомобилиСрезПоследних.ВидЗначения,
		|	АвтомобилиСрезПоследних.Значение
		|ИЗ
		|	РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
		|ГДЕ
		|	АвтомобилиСрезПоследних.Автомобиль = &Автомобиль
		|	И АвтомобилиСрезПоследних.ВидЗначения = &ВидЗначения
		|	И АвтомобилиСрезПоследних.Значение = &Значение";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("ВидЗначения", Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля);
	Запрос.УстановитьПараметр("Значение", Перечисления.ВидАвтомобиля.Новый);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЭтоНовый = Истина;
	КонецЦикла;

	Возврат ЭтоНовый;
 
КонецФункции // ЭтоНовыйАвтомобиль(Автомобиль) 

Функция ЭтоАвтомобильСПробегом(Автомобиль)
	
	ЭтоСПробегом = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвтомобилиСрезПоследних.Автомобиль,
		|	АвтомобилиСрезПоследних.ВидЗначения,
		|	АвтомобилиСрезПоследних.Значение
		|ИЗ
		|	РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
		|ГДЕ
		|	АвтомобилиСрезПоследних.Автомобиль = &Автомобиль
		|	И АвтомобилиСрезПоследних.ВидЗначения = &ВидЗначения
		|	И АвтомобилиСрезПоследних.Значение = &Значение";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("ВидЗначения", Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля);
	Запрос.УстановитьПараметр("Значение", Перечисления.ВидАвтомобиля.АвтомобильСПробегом);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЭтоСПробегом = Истина;
	КонецЦикла;

	Возврат ЭтоСПробегом;
 
КонецФункции // ЭтоАвтомобильСпробегом(Автомобиль)

Функция ЭтоПарИмпортАвтомобиль(Автомобиль)
	
	ЭтоПарИмпорт = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвтомобилиСрезПоследних.Автомобиль,
		|	АвтомобилиСрезПоследних.ВидЗначения,
		|	АвтомобилиСрезПоследних.Значение
		|ИЗ
		|	РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
		|ГДЕ
		|	АвтомобилиСрезПоследних.Автомобиль = &Автомобиль
		|	И АвтомобилиСрезПоследних.ВидЗначения = &ВидЗначения
		|	И АвтомобилиСрезПоследних.Значение = &Значение";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("ВидЗначения", Перечисления.ДополнительнаяИнформацияАвтомобилей.ПараллельныйИмпорт);
	Запрос.УстановитьПараметр("Значение", Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЭтоПарИмпорт = Истина;
	КонецЦикла;

	Возврат ЭтоПарИмпорт;
 
КонецФункции // ЭтоПарИмпортАвтомобиль(Автомобиль) 


//Бондаренко++ 20250412
Функция ПолучитьТаблицуПериодовБесплатногоХранения(СпАвто)
	
	ТЗ_ = Новый ТаблицаЗначений;

  	Запрос = Новый Запрос; 
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Автомобили.Ссылка КАК Автомобиль,
	               |	Автомобили.Модель КАК Модель,
	               |	Автомобили.Модель.Марка КАК Марка,
	               |	ЗапросПоМодели.Модель КАК МодельЗапросаПоМодели,
	               |	ЗапросПоМодели.КоличествоДнейПоМодели КАК КоличествоДнейПоМодели,
	               |	ЗапросПоМарке.Марка КАК МаркаЗапросаПоМарке,
	               |	ЗапросПоМарке.КоличествоДнейПоМарке КАК КоличествоДнейПоМарке,
	               |	Автомобили.VIN КАК АвтомобильVIN
	               |ИЗ
	               |	Справочник.Автомобили КАК Автомобили
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ПродолжительностьБесплатногоХраненияАвто.Модель КАК Модель,
	               |			ПродолжительностьБесплатногоХраненияАвто.КоличествоДней КАК КоличествоДнейПоМодели
	               |		ИЗ
	               |			РегистрСведений.ПродолжительностьБесплатногоХраненияАвто КАК ПродолжительностьБесплатногоХраненияАвто
	               |		ГДЕ
	               |			ПродолжительностьБесплатногоХраненияАвто.Марка <> ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)) КАК ЗапросПоМодели
	               |		ПО Автомобили.Модель = ЗапросПоМодели.Модель
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ПродолжительностьБесплатногоХраненияАвто.Марка КАК Марка,
	               |			ПродолжительностьБесплатногоХраненияАвто.КоличествоДней КАК КоличествоДнейПоМарке
	               |		ИЗ
	               |			РегистрСведений.ПродолжительностьБесплатногоХраненияАвто КАК ПродолжительностьБесплатногоХраненияАвто
	               |		ГДЕ
	               |			ПродолжительностьБесплатногоХраненияАвто.Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)) КАК ЗапросПоМарке
	               |		ПО Автомобили.Модель.Марка = ЗапросПоМарке.Марка
	               |ГДЕ
	               |	Автомобили.Ссылка В(&СпАвто)
	               |	И (ЗапросПоМарке.КоличествоДнейПоМарке > 0
	               |			ИЛИ ЗапросПоМодели.КоличествоДнейПоМодели > 0)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	АвтомобильVIN";
  	
  	Запрос.УстановитьПараметр("СпАвто", СпАвто);
 	
	ТЗ_ = Запрос.Выполнить().Выгрузить(); 
	
	//ТЗ_.ВыбратьСтроку(ТЗ_.Количество());
	
	Возврат ТЗ_;

КонецФункции // ПолучитьТаблицуПериодовБесплатногоХранения(СпАвто)


//Бондаренко++ 20241116 
Функция ПолучитьТаблицуАвтоШоуРум(ТЗ)
	
	ТЗ_Итог = Новый ТаблицаЗначений;
	
	СпАвтомобиль = ТЗ.ВыгрузитьКолонку("Автомобиль");
 	
  	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		 |	ШоуРум.Автомобиль КАК Автомобиль,
		 |	ШоуРум.ДилерскийЦентр КАК ДилерскийЦентр,
		 |	ШоуРум.АвтоВШоуРум КАК АвтоВШоуРум
		 |ИЗ
		 |	РегистрСведений.ШоуРум КАК ШоуРум
		 |ГДЕ
		 |	ШоуРум.Автомобиль В (&СпАвтомобиль)
 		 |	И ШоуРум.АвтоВШоуРум";
	
	Запрос.УстановитьПараметр("СпАвтомобиль",СпАвтомобиль);
 	
	ТЗ_Итог = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ_Итог;	

КонецФункции // ПолучитьТаблицуАвтоШоуРум(ТЗ)	
//Бондаренко-- 20231116 



//Бондаренко-- 20040907
    //Бондаренко++ 20230221
Функция ПолучитьТаблицуНезакрЗНиКомпл(СпАвто)
	
	ТЗ = Новый ТаблицаЗначений;

  	Запрос = Новый Запрос; 
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаряд.Проведен КАК Проведен1,
		|	ЗаказНаряд.Ссылка,
		|	ЗаказНаряд.Состояние,
		|	ЗаказНаряд.Автомобиль КАК Автомобиль,
		|	ЗаказНаряд.Проведен КАК Проведен,
		|	ЗаказНаряд.Автомобиль.VIN КАК АвтомобильVIN
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|ГДЕ
		|	ЗаказНаряд.Автомобиль В(&СпАвто)
		|	И НЕ ЗаказНаряд.Состояние В (&СпСостояний)
		|	И ЗаказНаряд.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КомплектацияАвтомобиля.Проведен,
		|	КомплектацияАвтомобиля.Ссылка,
		|	КомплектацияАвтомобиля.Состояние,
		|	КомплектацияАвтомобиля.Автомобиль,
		|	КомплектацияАвтомобиля.Проведен,
		|	КомплектацияАвтомобиля.Автомобиль.VIN
		|ИЗ
		|	Документ.КомплектацияАвтомобиля КАК КомплектацияАвтомобиля
		|ГДЕ
		|	КомплектацияАвтомобиля.Автомобиль В(&СпАвто)
		|	И НЕ КомплектацияАвтомобиля.Состояние В (&СпСостояний)
		|	И КомплектацияАвтомобиля.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	АвтомобильVIN";
 	
	СпСостояний = Новый СписокЗначений;
	СпСостояний.Добавить(Справочники.ВидыСостоянийЗаказНарядов.Закрыт);
	СпСостояний.Добавить(Справочники.ВидыСостоянийЗаказНарядов.Отказ);

	Запрос.УстановитьПараметр("СпСостояний", СпСостояний);
	
	Запрос.УстановитьПараметр("СпАвто", СпАвто);
 	
	ТЗ = Запрос.Выполнить().Выгрузить(); 
	
	//ТЗ.ВыбратьСтроку(ТЗ.Количество());
	
	Возврат ТЗ;
 
КонецФункции // ПолучитьТаблицуНезакрЗНиКомпл(СпАвто)

                  //Бондаренко++ 20230801
Функция ПолучитьТаблицуДатаОкончанияОтсрочкиОплаты(ТЗ)

	ТЗ_Итог = Новый ТаблицаЗначений;
	
	СпАвтомобиль = ТЗ.ВыгрузитьКолонку("Автомобиль");
 	
  	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвтомобилиСрезПоследних.Автомобиль,
		|	АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
		|	АвтомобилиСрезПоследних.Значение КАК ДатаОкончанияОтсрочкиОплаты
		|ИЗ
		|	РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
		|ГДЕ
		|	АвтомобилиСрезПоследних.Автомобиль В (&СпАвтомобиль)
		|	И АвтомобилиСрезПоследних.ВидЗначения = &ВидЗначения";
	
	Запрос.УстановитьПараметр("СпАвтомобиль",СпАвтомобиль);
	Запрос.УстановитьПараметр("ВидЗначения",Перечисления.ДополнительнаяИнформацияАвтомобилей.ДатаОкончанияОтсрочкиОплаты);
	
	ТЗ_Итог = Запрос.Выполнить().Выгрузить();
	
	//ТЗ_Итог.ВыбратьСтроку(ТЗ_Итог.Количество());
	
	Возврат ТЗ_Итог;
	
КонецФункции // ПолучитьТаблицуДатаОкончанияОтсрочкиОплаты(ТЗ)
//Бондаренко++ 20230801  


Функция ПолучитьТаблицуВидАвтомобиля(ТЗ)
	
	ТЗ_Итог = Новый ТаблицаЗначений;
	
	СпАвтомобиль = ТЗ.ВыгрузитьКолонку("Автомобиль");
 	
  	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвтомобилиСрезПоследних.Автомобиль,
		|	АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
		|	АвтомобилиСрезПоследних.Значение КАК ВидАвтомобиля
		|ИЗ
		|	РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
		|ГДЕ
		|	АвтомобилиСрезПоследних.Автомобиль В(&СпАвтомобиль)
		|	И АвтомобилиСрезПоследних.ВидЗначения = &ВидЗначения";
	
	Запрос.УстановитьПараметр("СпАвтомобиль",СпАвтомобиль);
	Запрос.УстановитьПараметр("ВидЗначения",Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля);
	
	ТЗ_Итог = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ_Итог;
 
КонецФункции // ПолучитьТаблицуВидАвтомобиля(ТЗ)

//Бондаренко++ 20230630
Функция ПолучитьТаблицуОпцийПроизводителя(ТЗ)
 
 	//СМГ_Сообщить("Начата: "+ТекущаяДата());
	
	СпАвтомобиль = ТЗ.ВыгрузитьКолонку("Автомобиль");
 	
	СоставОпций = Новый ТаблицаЗначений;
	СоставОпций.Колонки.Добавить("Автомобиль");
	СоставОпций.Колонки.Добавить("СтрокаОпций");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвтомобилиОпцииПроизводителя.Ссылка КАК Автомобиль,
		|	АвтомобилиОпцииПроизводителя.Опция.Наименование КАК СтрокаОпций
		|ИЗ
		|	Справочник.Автомобили.ОпцииПроизводителя КАК АвтомобилиОпцииПроизводителя
		|ГДЕ
		|	АвтомобилиОпцииПроизводителя.Ссылка В (&СпАвтомобиль)";
	
	Запрос.УстановитьПараметр("СпАвтомобиль",СпАвтомобиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПарОтбора = Новый Структура;
		ПарОтбора.Вставить("Автомобиль",ВыборкаДетальныеЗаписи.Автомобиль);
		НайдСтроки = СоставОпций.НайтиСтроки(ПарОтбора);
		Если НайдСтроки.Количество() = 0 Тогда
		    НовСтр = СоставОпций.Добавить();
			НовСтр.Автомобиль = ВыборкаДетальныеЗаписи.Автомобиль;
			НовСтр.СтрокаОпций = ВыборкаДетальныеЗаписи.СтрокаОпций;
 		Иначе
			НайдСтроки[0].Автомобиль = ВыборкаДетальныеЗаписи.Автомобиль;		
			НайдСтроки[0].СтрокаОпций = НайдСтроки[0].СтрокаОпций+";"+ВыборкаДетальныеЗаписи.СтрокаОпций;			
 		КонецЕсли;
	КонецЦикла;
	
	Возврат СоставОпций;

	//СМГ_Сообщить("Завершена: "+ТекущаяДата());
 
КонецФункции // ПолучитьТаблицуОпцийПроизводителя(ТЗ)
//Бондаренко-- 20230630

//Бондаренко++ 20230713
Функция ПолучитьТаблицуПереходВСобственность(ТЗ)
	
	ТЗ_итог = Новый ТаблицаЗначений;
	
	СпАвтомобиль = ТЗ.ВыгрузитьКолонку("Автомобиль");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль,
	               |	ОстаткиАвтомобилейОстатки.СкладКомпании КАК СкладКомпании,
	               |	ОстаткиАвтомобилейОстатки.СтатусПартии КАК СтатусПартии,
	               |	ОстаткиАвтомобилейОстатки.Партия КАК Партия,
	               |	ОстаткиАвтомобилейОстатки.ГТД КАК ГТД,
	               |	ЕСТЬNULL(ОстаткиАвтомобилейОстатки.КоличествоОстаток, 0) КАК Количество,
	               |	ЕСТЬNULL(ОстаткиАвтомобилейОстатки.СуммаОстаток, 0) КАК Сумма,
	               |	ЕСТЬNULL(ОстаткиАвтомобилейОстатки.СуммаУпрОстаток, 0) КАК СуммаУпр,
	               |	ЕСТЬNULL(ОстаткиАвтомобилейОстатки.СуммаНДСОстаток, 0) КАК СуммаНДС
	               |ПОМЕСТИТЬ ПартияАвто
	               |ИЗ
	               |	РегистрНакопления.ОстаткиАвтомобилей.Остатки(&Момент, Автомобиль В (&СпАвтомобиль)) КАК ОстаткиАвтомобилейОстатки
	               |
	               |ДЛЯ ИЗМЕНЕНИЯ
	               |	РегистрНакопления.ОстаткиАвтомобилей.Остатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоступлениеАвтомобилейАвтомобили.Ссылка.Организация,
	               |	ПоступлениеАвтомобилейАвтомобили.Ссылка.ХозОперация КАК ХозОперация,
	               |	ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата,
	               |	ПоступлениеАвтомобилейАвтомобили.Автомобиль
	               |ИЗ
	               |	ПартияАвто КАК ПартияАвто
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
	               |		ПО ПартияАвто.Партия.Ссылка = ПоступлениеАвтомобилейАвтомобили.Ссылка
	               |ГДЕ
	               |	ПоступлениеАвтомобилейАвтомобили.Ссылка.ХозОперация = &ХозОперацияПереходВСобственностьАвтомобилей";
		
		Запрос.УстановитьПараметр("Момент",ТекущаяДата());
		Запрос.УстановитьПараметр("СпАвтомобиль",СпАвтомобиль);
		Запрос.УстановитьПараметр("ХозОперацияПереходВСобственностьАвтомобилей",Справочники.ХозОперации.ПереходВСобственностьАвтомобилей);
 		
		ТЗ_итог = Запрос.Выполнить().Выгрузить();      
		
		Возврат ТЗ_итог;

КонецФункции // ПолучитьТаблицуПереходВСобственность(ТЗ)
//Бондаренко++ 20230713


Функция ПолучитьТаблицуСтатусСобственности(ТЗ)
	
	ТЗ_итог = Новый ТаблицаЗначений;
	
	СпАвтомобиль = ТЗ.ВыгрузитьКолонку("Автомобиль");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль,
	               |	ОстаткиАвтомобилейОстатки.СкладКомпании КАК СкладКомпании,
	               |	ОстаткиАвтомобилейОстатки.СтатусПартии КАК СтатусПартии,
	               |	ОстаткиАвтомобилейОстатки.Партия КАК Партия,
	               |	ОстаткиАвтомобилейОстатки.ГТД КАК ГТД,
	               |	ЕСТЬNULL(ОстаткиАвтомобилейОстатки.КоличествоОстаток, 0) КАК Количество,
	               |	ЕСТЬNULL(ОстаткиАвтомобилейОстатки.СуммаОстаток, 0) КАК Сумма,
	               |	ЕСТЬNULL(ОстаткиАвтомобилейОстатки.СуммаУпрОстаток, 0) КАК СуммаУпр,
	               |	ЕСТЬNULL(ОстаткиАвтомобилейОстатки.СуммаНДСОстаток, 0) КАК СуммаНДС
	               |ПОМЕСТИТЬ ПартияАвто
	               |ИЗ
	               |	РегистрНакопления.ОстаткиАвтомобилей.Остатки(&Момент, Автомобиль В (&СпАвтомобиль)) КАК ОстаткиАвтомобилейОстатки
	               |
	               |ДЛЯ ИЗМЕНЕНИЯ
	               |	РегистрНакопления.ОстаткиАвтомобилей.Остатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ПоступлениеАвтомобилейАвтомобили.АвтомобильБУ, ЛОЖЬ) КАК БУ,
	               |	ПоступлениеАвтомобилейАвтомобили.СуммаВсего,
	               |	ПоступлениеАвтомобилейАвтомобили.Ссылка.Организация,
	               |	ПоступлениеАвтомобилейАвтомобили.Ссылка.Организация.ФормаСобственности КАК ОрганизацияФормаСобственности,
	               |	ЕСТЬNULL(ПоступлениеАвтомобилейАвтомобили.ПараллельныйИмпорт, ЛОЖЬ) КАК ПараллельныйИмпорт,
	               |	ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент КАК Контрагент,
	               |	ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент.ОГРН КАК КонтрагентОГРН,
	               |	ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент.ИНН КАК КонтрагентИНН,
	               |	ПоступлениеАвтомобилейАвтомобили.Ссылка.ХозОперация КАК ХозОперация,
	               |	ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент.ФормаСобственности КАК КонтрагентФормаСобственности,
	               |	ПоступлениеАвтомобилейАвтомобили.ВидАвтомобиля КАК ВидАвтомобиля,
	               |	ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата,
	               |	ПоступлениеАвтомобилейАвтомобили.Автомобиль
	               |ИЗ
	               |	ПартияАвто КАК ПартияАвто
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
	               |		ПО ПартияАвто.Партия.Ссылка = ПоступлениеАвтомобилейАвтомобили.Ссылка
	               |ГДЕ
	               |	(ПоступлениеАвтомобилейАвтомобили.Ссылка.ХозОперация = &ХозОперацияПоступлениеАвтомобилейКомиссия
	               |			ИЛИ ПоступлениеАвтомобилейАвтомобили.Ссылка.ХозОперация = &ХозОперацияПоступлениеАвтомобилей)";
		
		Запрос.УстановитьПараметр("Момент",ТекущаяДата());
		Запрос.УстановитьПараметр("СпАвтомобиль",СпАвтомобиль);
		Запрос.УстановитьПараметр("ХозОперацияПоступлениеАвтомобилейКомиссия",Справочники.ХозОперации.ПоступлениеАвтомобилейКомиссия);
		Запрос.УстановитьПараметр("ХозОперацияПоступлениеАвтомобилей",Справочники.ХозОперации.ПоступлениеАвтомобилей);
		
		ТЗ_итог = Запрос.Выполнить().Выгрузить();      
		
		Возврат ТЗ_итог;

КонецФункции // ПолучитьТаблицуСтатусСобственности(ТЗ)

//Бондаренко++ 20231214                           
Функция ПолучитьТаблицуКорректировокПоступленияАвто(СпАвто)
	
	ТЗ = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;  

  	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиАвтомобилей.Автомобиль КАК Автомобиль,
		|	ОстаткиАвтомобилей.КоличествоОстаток,
		|	КорректировкиПоступления.СуммаРазница,
		|	КорректировкиПоступления.Ссылка,
		|	КорректировкиПоступления.Дата
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилей
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка КАК Ссылка,
		|			КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка.Дата КАК Дата,
		|			КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка.Проведен КАК Проведен,
		|			КорректировкаПоступленияАвтомобилейАвтомобили.СуммаРазница КАК СуммаРазница,
		|			КорректировкаПоступленияАвтомобилейАвтомобили.Автомобиль КАК Автомобиль
		|		ИЗ
		|			Документ.КорректировкаПоступленияАвтомобилей.Автомобили КАК КорректировкаПоступленияАвтомобилейАвтомобили
		|		ГДЕ
		|			КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка.Проведен) КАК КорректировкиПоступления
		|		ПО ОстаткиАвтомобилей.Автомобиль = КорректировкиПоступления.Автомобиль
		|ГДЕ
		|	ОстаткиАвтомобилей.КоличествоОстаток > 0
		|	И ОстаткиАвтомобилей.Автомобиль В(&СпАвто)
		|	И КорректировкиПоступления.СуммаРазница <> 0"; 
  	
	Запрос.УстановитьПараметр("СпАвто", СпАвто);    
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;                                               
	
КонецФункции // ПолучитьТаблицуКорректировокПоступленияАвто(СпАвто)




