Функция ТипыГрафика(Сп) Экспорт
	Сп.Очистить();
	Сп.Добавить("area","Область");
	Сп.Добавить("arearange","Диапазон областей");
	Сп.Добавить("areaspline","Сплайн область");
	Сп.Добавить("areasplinerange","Сплайн область диапазон");
	Сп.Добавить("bar","Полоса");
	Сп.Добавить("boxplot","График");
	Сп.Добавить("bubble","Пузырь");
	Сп.Добавить("column","Колонка");
	Сп.Добавить("columnrange","Диапазон колонок");
	Сп.Добавить("errorbar","errorbar");
	Сп.Добавить("funnel","Воронка");
	Сп.Добавить("gauge","Шаблон");
	Сп.Добавить("heatmap","Карта");
	Сп.Добавить("line","Линия");
	Сп.Добавить("pie","Пирог");
	Сп.Добавить("polygon","Полигон");
	Сп.Добавить("pyramid","Пирамида");
	Сп.Добавить("scatter","Разброс");
	Сп.Добавить("solidgauge","Твердый шаблон");
	Сп.Добавить("spline","Сплайн");
	Сп.Добавить("waterfall","Водопад");
	Возврат Сп
КонецФункции	

Функция НоваяТочка(ИмяСерии,ИмяТочки,Значение) Экспорт Возврат Новый Структура("ИмяСерии,ИмяТочки,Значение",ИмяСерии,ИмяТочки,Формат(Значение,"ЧРД=.;ЧН=0;ЧГ=0")) КонецФункции

Процедура УстановитьАктивнуюТочку(Highcharts,Точка) Экспорт Highcharts.АктивнаяТочка=ЗначениеВСтрокуВнутр(Точка) КонецПроцедуры //Точка-> НоваяТочка(ИмяСерии,ИмяТочки,Значение) 