Перем РМ Экспорт;
Перем РЖ Экспорт;
Перем РП Экспорт;
Перем РЗ Экспорт;
Перем РВК Экспорт;
Перем РС Экспорт;
Перем РКО Экспорт;
Перем РСОО Экспорт;
Перем РСО Экспорт;
Перем RLogo Экспорт;
Перем СПМесяцев Экспорт;
Перем СпДней Экспорт;

Перем Права Экспорт;


РМ       = БиблиотекаКартинок.STM_Муж;
РЖ       = БиблиотекаКартинок.STM_Жен;
РП       = БиблиотекаКартинок.STM_Посещение;
РЗ       = БиблиотекаКартинок.STM_Телефон;
РВК      = БиблиотекаКартинок.STM_comment;
РС       = БиблиотекаКартинок.STM_clock;
РКО      = БиблиотекаКартинок.STM_comment;
РСОО     = БиблиотекаКартинок.STM_mail;
РС       = БиблиотекаКартинок.STM_clock;
РКО      = БиблиотекаКартинок.STM_comment;
РСО      = БиблиотекаКартинок.STM_mail;
RLogo    = БиблиотекаКартинок.STM_RenaultLogoMin;

СПМесяцев = Новый СписокЗначений();
СПМесяцев.Добавить("Январь");
СПМесяцев.Добавить("Февраль");
СПМесяцев.Добавить("Март");
СПМесяцев.Добавить("Апрель");
СПМесяцев.Добавить("Май");
СПМесяцев.Добавить("Июнь");
СПМесяцев.Добавить("Июль");
СПМесяцев.Добавить("Август");
СПМесяцев.Добавить("Сентябрь");
СПМесяцев.Добавить("Октябрь");
СПМесяцев.Добавить("Ноябрь");
СПМесяцев.Добавить("Декабрь");

СпДней = новый СписокЗначений;
СпДней.Добавить("Понедельник");
СпДней.Добавить("Вторник");
СпДней.Добавить("Среда");
СпДней.Добавить("Четверг");
СпДней.Добавить("Пятница");
СпДней.Добавить("Суббота");
СпДней.Добавить("Воскресение");

Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли