// Общий журнал

Перем Права Экспорт;

Перем Организация Экспорт;

Функция ПолучитьСписокПечатныхФорм(ДокументСсылка = Неопределено) Экспорт
	Возврат Новый СписокЗначений();	
КонецФункции

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры
//Конец необходимых для общих журналов

Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли