
// Общий журнал
Перем Права Экспорт;
Перем Организация Экспорт;

Функция ПолучитьСписокПечатныхФорм(ДокументСсылка = Неопределено) Экспорт
	Возврат Новый СписокЗначений();	
КонецФункции
//Конец необходимых для общих журналов

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.CRM_Договор") Тогда
	//	// Заполнение шапки
	//	ДЦ =Renault_CRM .ПолучитьДилерскийЦентрПользователя();
	//	Комплектация = ДанныеЗаполнения.Версия;
	//	Модель = ДанныеЗаполнения.Модель;
	//	Основание = ДанныеЗаполнения.Ссылка;
	//ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.CRM_КоммерческоеПредложение") Тогда
	//	// Заполнение шапки
	//	ДЦ =Renault_CRM .ПолучитьДилерскийЦентрПользователя();
	//	Идк = ДанныеЗаполнения.РабочийЛист;
	//	Запись = Renault_CRM.ПолучитьЗаписьРЛПоIDK(Идк);
	//	Комплектация = Запись.Комплектация;

	//	Модель =Запись.МодельАвтомобиля;
	//	Основание = ДанныеЗаполнения.Ссылка;


	//ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.CRM_ЗаписьНаВыдачу") Тогда
	//	// Заполнение шапки
	//	ДЦ =Renault_CRM .ПолучитьДилерскийЦентрПользователя();
	//	Идк = ДанныеЗаполнения.IDK;
	//	Запись = Renault_CRM.ПолучитьЗаписьРЛПоIDK(Идк);
	//	Комплектация = Запись.Комплектация;

	//	Модель =Запись.МодельАвтомобиля;
	//	Основание = ДанныеЗаполнения.Ссылка;

	//КонецЕсли;
	//НачальноеЗаполнение();
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура НачальноеЗаполнение() Экспорт
	//ДЦ =Renault_CRM .ПолучитьДилерскийЦентрПользователя();
	ДопОпции.Очистить();
	Запрос = Новый Запрос();
	Запрос.Текст ="ВЫБРАТЬ
	              |	CRM_ДопОпцииОборудование.ДилерскийЦентр,
	              |	CRM_ДопОпцииОборудование.Модель,
	              |	CRM_ДопОпцииОборудование.Комплектация,
	              |	CRM_ДопОпцииОборудование.Номенклатура,
	              |	ЦеныСрезПоследних.Цена,
	              |	CRM_ДопОпцииОборудование.Количество
	              |ИЗ
	              |	РегистрСведений.CRM_ДопОпцииОборудование КАК CRM_ДопОпцииОборудование
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(&Период, ТипЦен = &ТипЦеныКП) КАК ЦеныСрезПоследних
	              |		ПО CRM_ДопОпцииОборудование.Номенклатура = ЦеныСрезПоследних.Номенклатура
	              |ГДЕ
	              |	CRM_ДопОпцииОборудование.ДилерскийЦентр = &ДЦ" ;
	Запрос.УстановитьПараметр("ДЦ",ДилерскийЦентр);
	Запрос.УстановитьПараметр("Период",ТекущаяДата());
    Запрос.УстановитьПараметр("ТипЦеныКп",Renault_РаботаСПравамиПользователя.ПолучитьТипЦенКП(ДилерскийЦентр));
	//Константы.CRM_ТипЦенКП.Получить());
	Результат = Запрос.Выполнить().Выгрузить();
	СписокОпций = Новый Массив();
	Отбор =	Новый Структура();
	Отбор.Вставить("ДилерскийЦентр",ДилерскийЦентр) ;
	Отбор.Вставить("Модель",Справочники.Модели.ПустаяСсылка()) ;
    Отбор.Вставить("Комплектация",Справочники.ВариантыКомплектации.ПустаяСсылка()) ;
	СписокОпцийДилера = Результат.НайтиСтроки(Отбор);
	для Каждого Опц Из СписокОпцийДилера Цикл
		СписокОпций.Добавить(Опц);
	КонецЦикла;
	Если ЗначениеЗаполнено(Модель) Тогда
		Отбор =	Новый Структура();
		Отбор.Вставить("ДилерскийЦентр",ДилерскийЦентр) ;
		Отбор.Вставить("Модель",Модель) ;
	    Отбор.Вставить("Комплектация",Справочники.ВариантыКомплектации.ПустаяСсылка()) ;
		СписокОпцийДилера = Результат.НайтиСтроки(Отбор);
		для Каждого опц Из СписокОпцийДилера Цикл
			СписокОпций.Добавить(Опц);
		КонецЦикла;
		Если ЗначениеЗаполнено(Комплектация) Тогда
			Отбор =	Новый Структура();
			Отбор.Вставить("ДилерскийЦентр",ДилерскийЦентр) ;
			Отбор.Вставить("Модель",Модель) ;
		    Отбор.Вставить("Комплектация",Комплектация) ;
			СписокОпцийДилера = Результат.НайтиСтроки(Отбор);
			Для Каждого опц Из СписокОпцийДилера Цикл
				СписокОпций.Добавить(Опц);
			КонецЦикла;
	     КонецЕсли;

     КонецЕсли;
	 Для Каждого Опция Из СписокОпций Цикл
		НовСтр =  ДопОпции.Добавить();
		НовСтр.Опция = Опция.Номенклатура;
		Если ЗначениеЗаполнено(Опция.Цена) Тогда
			НовСтр.Цена = Опция.Цена;
			НовСтр.Сумма = Опция.Цена*Опция.Количество;
		КонецЕсли;
		НовСтр.Количество= Опция.Количество;
		
		НовСтр.Выбрана = Истина;
	 КонецЦикла;
	
КонецПроцедуры

Функция СоздатьЗаказНаряд() Экспорт
		
	Если ЗначениеЗаполнено(ЗаказНаряд) тогда
		Заказ =  ЗаказНаряд.Ссылка.ПолучитьОбъект();
	Иначе
		Заказ = документы.ЗаказНаряд.СоздатьДокумент();
	КонецЕсли;
	
	Заказ.Автомобиль = Автомобиль;
	Заказ.ВидРемонта = Справочники.ВидыРемонта.КомплектацияАвтомобиля;
	Заказ.Дата = ТекущаяДата();
	Заказ.Товары.Очистить();
	Заказ.Работы.Очистить();
	
	//Заказ.УстановитьНовыйНомер();
	Заказ.Номер = "З"+Номер;
	Заказ.цех = Справочники.Цеха.ОсновнойЦех;
	Если ЗначениеЗаполнено(Клиент) и  (ТипЗнч(Клиент)= Тип("СправочникСсылка.Контрагенты")) тогда
		Заказ.Заказчик = Клиент;
	иначе
		Заказ.Заказчик = Справочники.Контрагенты.ОсновнойПокупатель;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Заказ.Состояние) Тогда
		Заказ.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Заявка;
	КонецЕсли;
	
	Для каждого Оборудование Из ДопОпции  Цикл
		
		Если Оборудование.Выбрана и ЗначениеЗаполнено(Оборудование.Опция) тогда
			
			НовСтрока = Заказ.Товары.Добавить();
			НовСтрока.Номенклатура = Оборудование.Опция;
			НовСтрока.Коэффициент = Оборудование.Опция.ОсновнаяЕдиницаИзмерения.Коэффициент;
			НовСтрока.ЕдиницаИзмерения = Оборудование.Опция.ОсновнаяЕдиницаИзмерения;
			НовСтрока.Количество = Оборудование.Количество;
			НовСтрока.Сумма = Оборудование.Сумма;
			НовСтрока.Цена = Оборудование.Цена;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого СтрокаАвтоработы Из Автоработы  Цикл
		
		Если СтрокаАвтоработы.Выбрана и ЗначениеЗаполнено(СтрокаАвтоработы.Авторабота) тогда
			
			НовСтрока = Заказ.Работы.Добавить();
			НовСтрока.Работа = СтрокаАвтоработы.Авторабота;
			//НовСтрока.Коэффициент = СтрокаАвтоработы.Авторабота.ОсновнаяЕдиницаИзмерения.Коэффициент;
			//НовСтрока.ЕдиницаИзмерения = СтрокаАвтоработы.Авторабота.ОсновнаяЕдиницаИзмерения;
			НовСтрока.Количество = СтрокаАвтоработы.Количество;
			НовСтрока.Сумма = СтрокаАвтоработы.Сумма;
			НовСтрока.Цена = СтрокаАвтоработы.Цена;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Попытка
		
		Заказ.Записать(РежимЗаписиДокумента.Запись);
		ЗаказНаряд = Заказ.Ссылка;
		Статус = Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.Выполнена;
		Записать(РежимЗаписиДокумента.Проведение);
		
	Исключение
		
		Инфа = ИнформацияОбОшибке();
		
	КонецПопытки;
	
	Возврат Заказ.Ссылка;
	
КонецФункции	

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ОтказУд = ложь;
	ОбработкаУдаленияПроведения(ОтказУд);
	НаборЗаявка = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьНаборЗаписей();
	НаборЗаявка.Отбор.IDK.Установить(РабочийЛист);
	НаборЗаявка.Отбор.ЭтапПродаж.Установить(Справочники.CRM_ЭтапыПродаж.ЗаявкаНаОборудование);
	НаборЗаявкаВыполнена = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьНаборЗаписей();
	НаборЗаявкаВыполнена.Отбор.IDK.Установить(РабочийЛист);
	НаборЗаявкаВыполнена.Отбор.ЭтапПродаж.Установить(Справочники.CRM_ЭтапыПродаж.ЗаявкаНаОборудованиеВыполнена);

    Если Статус = Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.Черновик Тогда
		//НаборЗаявка.Записать();
		Нов = НаборЗаявка.Добавить();
		Нов.IDK = РабочийЛист;
		Нов.Объект = ЭтотОбъект.Ссылка;
		Нов.ДатаВыполнения = ЭтотОбъект.Дата;
		Нов.ДилерскийЦентр = ЭтотОбъект.ДилерскийЦентр;
		Нов.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаОборудование;
		НаборЗаявка.Записать();
    	НаборЗаявкаВыполнена.Записать();
	Иначе 
		Нов = НаборЗаявка.Добавить();
		Нов.IDK = РабочийЛист;
		Нов.Объект = ЭтотОбъект.Ссылка;
		Нов.ДатаВыполнения = ЭтотОбъект.Дата;
		Нов.ДилерскийЦентр = ЭтотОбъект.ДилерскийЦентр;
		Нов.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаОборудование;
		НаборЗаявка.Записать();
		
		Если Статус = Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.Выполнена Тогда
			Нов = НаборЗаявкаВыполнена.Добавить();
			Нов.IDK = РабочийЛист;
			Нов.Объект = ЭтотОбъект.Ссылка;
			Нов.ДатаВыполнения = ЭтотОбъект.Дата;
			Нов.ДилерскийЦентр = ЭтотОбъект.ДилерскийЦентр;
			Нов.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаОборудованиеВыполнена;
			НаборЗаявкаВыполнена.Записать();

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_ВоронкаПродаж.IDK,
	               |	CRM_ВоронкаПродаж.ЭтапПродаж,
	               |	CRM_ВоронкаПродаж.ДатаВыполнения,
	               |	CRM_ВоронкаПродаж.Объект
	               |ИЗ
	               |	РегистрСведений.CRM_ВоронкаПродаж КАК CRM_ВоронкаПродаж
	               |ГДЕ
	               |	CRM_ВоронкаПродаж.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Запись.Удалить();
		КонецЕсли;
	КонецЦикла;
		//Оповестить("ОбновитьРабочийЛист");
	
КонецПроцедуры

Процедура УстановитьСтатус(вхСтатус) Экспорт
	
	Статус = вхСтатус;
	Если Статус = Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.Выполнена Тогда
		Черновик=Ложь;
		Закрыта = Истина;
		ВыполненаУспешно = Истина;
	ИначеЕсли  Статус = Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.НаРассмотрении Тогда
		Черновик=Ложь;
		Закрыта = Ложь;
		ВыполненаУспешно = Ложь;
	//ИначеЕсли  Статус = Перечисления.Renault_CRM_СтатусЗаявокНаКредит.Одобрена Тогда
	//	Черновик=Ложь;
	//	Одобрена = Истина;
	//	Закрыта = Ложь;
	//	ВыполненаУспешно = Ложь;
	ИначеЕсли  Статус = Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.Отменена Тогда
		Черновик=Ложь;
		//Одобрена = Ложь;
		Закрыта = Истина;
		ВыполненаУспешно = Ложь;
	ИначеЕсли  Статус = Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.Черновик Тогда
		Черновик=Истина;
		//Одобрена = Ложь;
		Закрыта = Ложь;
		ВыполненаУспешно = Ложь;
	Иначе
		Статус = Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.Черновик;
		Черновик=Истина;
		//Одобрена = Ложь;
		Закрыта = Ложь;
		ВыполненаУспешно = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры