функция ОпределениеTDFa (Адрес, ЛогинWS, ПарольWS) Экспорт 	
	WSОпределение = Новый WSОпределения(
		СокрЛП(Адрес),
		СокрЛП(ЛогинWS),
		СокрЛП(ПарольWS));
	Возврат WSОпределение;
КонецФункции

Функция Renault_Это83() Экспорт
	
	СисИнфо = Новый СистемнаяИнформация;
	
	Версия = СисИнфо.ВерсияПриложения;
	
	ДетальнаяВерсия = Renault_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Версия, ".");
	
	Если НЕ ЗначениеЗаполнено(ДетальнаяВерсия) ИЛИ ДетальнаяВерсия.Количество() < 3 Тогда
		
		СообщениеОбОшибке = "Не удалось определить версию платформы.";
		Возврат Ложь;
		
	КонецЕсли;
	
	Попытка
	
		Если ЧИСЛО(ДетальнаяВерсия[0]) >= 8 И ЧИСЛО(ДетальнаяВерсия[1]) > 2 Тогда 
			
			Возврат Истина;
			
		Иначе
			
			Возврат Ложь;
			
		КонецЕсли;
		
	Исключение
		
		Возврат Ложь;
		
		
	КонецПопытки;
		
КонецФункции