
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДТ_ВзаиморасчетыСотрудники Расход
	Движения.ДТ_ВзаиморасчетыСотрудники.Записывать = Истина;
	Движения.ДТ_ВзаиморасчетыСотрудники.Очистить();
	Для Каждого ТекСтрокаУдержания Из Удержания Цикл
		Движение = Движения.ДТ_ВзаиморасчетыСотрудники.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаУдержания.Сотрудник;
		Движение.Должность = ТекСтрокаУдержания.Должность;
		Движение.Подразделение = Подразделение;
		Движение.Сумма = ТекСтрокаУдержания.Сумма;
		Движение.ВидРасчета = Перечисления.ДТ_ВидыРасчетов.Управленческие;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
