//&НаСервере 
//Перем НастройкиСоед Экспорт;
//&НаСервере 
//Перем СообщениеНетСвязи Экспорт;
//&НаСервере
//Перем СообщениеНеАвторизован Экспорт;
//&НаСервере
//Перем ФлагБылаЗагрузкаССервера Экспорт;



&НаКлиенте
Перем КонтекстВыбора;


&НаСервере
Функция ПолучитьСтруктуруНастройкиСоед(НовНастройки=Неопределено) Экспорт
	Рез = Новый Структура;
	Рез.Вставить("АдресСервера", "");
	Рез.Вставить("АдресСервераПорт", 12346);
	Рез.Вставить("ЛокальныйТокен", "");
	Рез.Вставить("SSL", Неопределено);
	Рез.Вставить("НуженSSL", Ложь);
	Рез.Вставить("КоннектРазрешен", Ложь);
	Рез.Вставить("СтрокаОшибок", "");
	Рез.Вставить("ДилерскийЦентр" , Неопределено);
	Если НовНастройки<>Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Рез,НовНастройки);
	КонецЕсли;
	Возврат Рез;

КонецФункции


&НаСервере 
Функция ПолучитьКоннекты() Экспорт
	//  получаем адрес сервера и токен

	Рез = ПолучитьСтруктуруНастройкиСоед();
	
	Если НастройкиСоед=Неопределено ИЛИ НастройкиСоед.ДилерскийЦентр<>Объект.ДилерскийЦентр Тогда

		Рез = РеквизитФормыВЗначение("Объект").ПолучитьКоннекты(Истина);
		НастройкиСоед = ПолучитьСтруктуруНастройкиСоед();

		ЗаполнитьЗначенияСвойств(НастройкиСоед,Рез,,"SSL");

	Иначе
		ЗаполнитьЗначенияСвойств(Рез,НастройкиСоед);

	КонецЕсли;
	
	Если Рез.НуженSSL Тогда
			//НастройкиСоед.SSL = Новый ЗащищенноеСоединениеOpenSSL( Новый СертификатКлиентаWindows(СпособВыбораСертификатаWindows.Авто),
	    	//												Новый СертификатыУдостоверяющихЦентровWindows());
			Рез.SSL = Новый ЗащищенноеСоединениеOpenSSL( Новый СертификатКлиентаWindows(),
	    													Новый СертификатыУдостоверяющихЦентровWindows());
	КонецЕсли;

	
	Возврат Рез;
	
	//Рез = Новый Структура;
	//Рез.Вставить("АдресСервера", "");
	//Рез.Вставить("АдресСервераПорт", 12346);
	//Рез.Вставить("ЛокальныйТокен", "");
	//АдресСервера = "";
	//АдресСервераПорт = 12346;
	//ЛокальныйТокен = "";
	//Если Метаданные.НайтиПоПолномуИмени("Справочник.ПараметрыПодключенияКСервисам")<>Неопределено Тогда
	//	//Если Справочники[Определить"ПараметрыПодключенияКСервисам"].
	//	Попытка
	//		Если ЗначениеЗаполнено(Справочники["ПараметрыПодключенияКСервисам"]["OnlineQuotation"]["АдресСервера"]) Тогда
	//			АдресСервера = Справочники["ПараметрыПодключенияКСервисам"]["OnlineQuotation"]["АдресСервера"];
	//			Если Найти(АдресСервера,":")>1 Тогда
	//				
	//				АдресСервераПорт = Прав(АдресСервера,СтрДлина(АдресСервера)- Найти(АдресСервера,":"));
	//				АдресСервера = Лев(АдресСервера,Найти(АдресСервера,":")-1);
	//			КонецЕсли;
	//		КонецЕсли;
	//		Если ЗначениеЗаполнено(Справочники["ПараметрыПодключенияКСервисам"]["OnlineQuotation"]["Пароль"]) Тогда
	//			ЛокальныйТокен = Справочники["ПараметрыПодключенияКСервисам"]["OnlineQuotation"]["Пароль"];
	//		КонецЕсли;
	//	Исключение
	//	КонецПопытки;
	//	
	//КонецЕсли;
	//
	//// Если ничего не нашлось, ставим значения по умолчанию

	//Если АдресСервера = "" Тогда
	//	АдресСервера = "";
	//КонецЕсли;
	//
	////Если АдресСервераПорт = "" Тогда
	////	АдресСервераПорт = "12346";
	////КонецЕсли;
	//
	//Если ЛокальныйТокен = "" Тогда
	//	ЛокальныйТокен = "tst-tst-tst";
	//КонецЕсли;
	//
	//Рез.АдресСервера = АдресСервера;
	//Рез.АдресСервераПорт = АдресСервераПорт;
	//Рез.ЛокальныйТокен = ЛокальныйТокен;
	//
	//Возврат Рез;
КонецФункции


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФлагБылаЗагрузкаССервера = ложь;
	УстановитьУсловноеОформление();
	
	НастройкиСоед=Неопределено;
	СообщениеНетСвязи="";
	СообщениеНеАвторизован="";

	ДлинаЦикла = 7;
	Объект.МинДнейДоНачала = 2;
	Объект.ДатаНачалаПланирования = НачалоДня(ТекущаяДатаСеанса()+Объект.МинДнейДоНачала*24*3600);
	
	
	СформироватьШаблонЗаполнения(Объект.ШаблонЗаполнения, ДлинаЦикла, Объект.ДатаНачалаПланирования);
	ЗаполнитьПредставлениеРасписания();
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ШаблонЗаполненияПредставлениеРасписания.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ШаблонЗаполнения.ПредставлениеРасписания");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ШаблонЗаполнения.ДеньВключенВГрафик");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", ПредставлениеПустогоРасписания());

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ШаблонЗаполненияНомерСтроки.Имя);

	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ШаблонЗаполненияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаШаблона = Объект.ШаблонЗаполнения.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	КонтекстВыбора = Новый Структура;
	КонтекстВыбора.Вставить("Источник", "ШаблонЗаполненияВыбор");
	КонтекстВыбора.Вставить("НомерДня", СтрокаШаблона.НомерСтроки);
	КонтекстВыбора.Вставить("ПредставлениеРасписания", СтрокаШаблона.ПредставлениеРасписания);
	КонтекстВыбора.Вставить("ИдентификаторСтрокиШаблона", ВыбраннаяСтрока);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РасписаниеРаботы", РасписаниеРаботы(КонтекстВыбора.НомерДня));
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТолькоПросмотр);
	
	//ОткрытьФорму("ВнешняяОбработка.ПланированиеСервис.Форма.РасписаниеРаботы", ПараметрыФормы, ЭтаФорма);
	//ОткрытьФорму(СтрЗаменить(ЭтаФорма.ИмяФормы,".ФормаЭлемента",".ВыборДаты"),Новый Структура("Дата",Объект.ДатаКалендаря),ЭтаФорма);
	ОткрытьФорму(СтрЗаменить(ЭтаФорма.ИмяФормы,".ФормаЭлемента",".РасписаниеРаботы"), ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Функция РасписаниеРаботы(НомерДня)
	
	РасписаниеДня = Новый Массив;
	
	Для Каждого СтрокаРасписания Из Объект.РасписаниеРаботы Цикл
		Если СтрокаРасписания.НомерДня = НомерДня Тогда
			РасписаниеДня.Добавить(Новый Структура("ВремяНачала, ВремяОкончания", СтрокаРасписания.ВремяНачала, СтрокаРасписания.ВремяОкончания));
		КонецЕсли;
	КонецЦикла;
	
	Возврат РасписаниеДня;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьШаблонЗаполнения(ШаблонЗаполнения, Знач ДлинаЦикла, Знач ДатаОтсчета = Неопределено)
	
	// Формирует таблицу редактирования шаблона заполнения по дням.
	
	Пока ШаблонЗаполнения.Количество() > ДлинаЦикла Цикл
		ШаблонЗаполнения.Удалить(ШаблонЗаполнения.Количество() - 1);
	КонецЦикла;

	Пока ШаблонЗаполнения.Количество() < ДлинаЦикла Цикл
		ШаблонЗаполнения.Добавить();
	КонецЦикла;
	
	ШаблонЗаполнения[0].ПредставлениеДня = НСтр("ru = 'Понедельник'");
	ШаблонЗаполнения[1].ПредставлениеДня = НСтр("ru = 'Вторник'");
	ШаблонЗаполнения[2].ПредставлениеДня = НСтр("ru = 'Среда'");
	ШаблонЗаполнения[3].ПредставлениеДня = НСтр("ru = 'Четверг'");
	ШаблонЗаполнения[4].ПредставлениеДня = НСтр("ru = 'Пятница'");
	ШаблонЗаполнения[5].ПредставлениеДня = НСтр("ru = 'Суббота'");
	ШаблонЗаполнения[6].ПредставлениеДня = НСтр("ru = 'Воскресенье'");
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонЗаполненияДеньВключенВГрафикПриИзменении(Элемент)
	
	УстановитьСнятьПризнакСоответствияРезультатовШаблону(ЭтаФорма, Ложь);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСнятьПризнакСоответствияРезультатовШаблону(Форма, РезультатЗаполненПоШаблону)
	
	Форма.РезультатЗаполненПоШаблону = РезультатЗаполненПоШаблону;
	
	ЗаполнитьИнформационныйТекстРезультатаЗаполнения(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьИнформационныйТекстРезультатаЗаполнения(Форма)
	
	ИнформационныйТекст = "";
	ИнформационнаяКартинка = Новый Картинка;
	ДоступноЗаполнениеПоШаблону = Ложь;
	Если Форма.РучноеРедактирование Тогда
		ИнформационныйТекст = НСтр("ru = 'График работы на текущий год изменен вручную. 
                                    |Нажмите «Заполнить по шаблону» чтобы вернуться к автоматическому заполнению.'");
		ИнформационнаяКартинка = БиблиотекаКартинок.Предупреждение;
		ДоступноЗаполнениеПоШаблону = Истина;
	Иначе
		Если Форма.РезультатЗаполненПоШаблону Тогда
			Если ЗначениеЗаполнено(Форма.Объект.ПроизводственныйКалендарь) Тогда
				ИнформационныйТекст = НСтр("ru = 'График работы автоматически обновляется при изменении производственного календаря за текущий год.'");
				ИнформационнаяКартинка = БиблиотекаКартинок.Информация;
			КонецЕсли;
		Иначе
			ИнформационныйТекст = НСтр("ru = 'Отображаемый результат не соответствует настройке шаблона. 
                                        |Нажмите «Заполнить по шаблону», чтобы увидеть как выглядит график работы с учетом изменений шаблона.'");
			ИнформационнаяКартинка = БиблиотекаКартинок.Предупреждение;
			ДоступноЗаполнениеПоШаблону = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//Вспомогательные процедуры, функции
&НаСервере
Процедура ЗаполнитьПредставлениеРасписания()
	
	Для Каждого СтрокаШаблона Из Объект.ШаблонЗаполнения Цикл
		СтрокаШаблона.ПредставлениеРасписания = ПредставлениеРасписанияДня(ЭтаФорма, СтрокаШаблона.НомерСтроки);
	КонецЦикла;
	
	РасписаниеПредпраздничногоДня = ПредставлениеРасписанияДня(ЭтаФорма, 0);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеРасписанияДня(Форма, НомерДня)
	
	ПредставлениеИнтервалов = "";
	Секунд = 0;
	Для Каждого СтрокаРасписания Из Форма.Объект.РасписаниеРаботы Цикл
		Если СтрокаРасписания.НомерДня <> НомерДня Тогда
			Продолжить;
		КонецЕсли;
		ПредставлениеИнтервала = ПодставитьПараметрыВСтроку("%1-%2, ", Формат(СтрокаРасписания.ВремяНачала, "ДФ=ЧЧ:мм; ДП="), Формат(СтрокаРасписания.ВремяОкончания, "ДФ=ЧЧ:мм; ДП="));
		ПредставлениеИнтервалов = ПредставлениеИнтервалов + ПредставлениеИнтервала;
		Если Не ЗначениеЗаполнено(СтрокаРасписания.ВремяОкончания) Тогда
			СекундИнтервала = КонецДня(СтрокаРасписания.ВремяОкончания) - СтрокаРасписания.ВремяНачала + 1;
		Иначе
			СекундИнтервала = СтрокаРасписания.ВремяОкончания - СтрокаРасписания.ВремяНачала;
		КонецЕсли;
		Секунд = Секунд + СекундИнтервала;
	КонецЦикла;
	УдалитьПоследнийСимволВСтроке(ПредставлениеИнтервалов, 2);
	
	Если Секунд = 0 Тогда
		Возврат ПредставлениеПустогоРасписания();
	КонецЕсли;
	
	Часов = Окр(Секунд / 3600, 1);
	
	Возврат ПодставитьПараметрыВСтроку(НСтр("ru = '%1 ч. (%2)'"), Часов, ПредставлениеИнтервалов);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПодставитьПараметрыВСтроку(Знач СтрокаПодстановки,
	Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено)
	
	ИспользоватьАльтернативныйАлгоритм = 
		Найти(Параметр1, "%")
		Или Найти(Параметр2, "%")
		Или Найти(Параметр3, "%")
		Или Найти(Параметр4, "%")
		Или Найти(Параметр5, "%")
		Или Найти(Параметр6, "%")
		Или Найти(Параметр7, "%")
		Или Найти(Параметр8, "%")
		Или Найти(Параметр9, "%");
		
	Если ИспользоватьАльтернативныйАлгоритм Тогда
		СтрокаПодстановки = ПодставитьПараметрыВСтрокуАльтернативныйАлгоритм(СтрокаПодстановки, Параметр1,
			Параметр2, Параметр3, Параметр4, Параметр5, Параметр6, Параметр7, Параметр8, Параметр9);
	Иначе
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%1", Параметр1);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%2", Параметр2);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%3", Параметр3);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%4", Параметр4);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%5", Параметр5);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%6", Параметр6);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%7", Параметр7);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%8", Параметр8);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%9", Параметр9);
	КонецЕсли;
	
	Возврат СтрокаПодстановки;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПодставитьПараметрыВСтрокуАльтернативныйАлгоритм(Знач СтрокаПодстановки,
	Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено)
	
	Результат = "";
	Позиция = Найти(СтрокаПодстановки, "%");
	Пока Позиция > 0 Цикл 
		Результат = Результат + Лев(СтрокаПодстановки, Позиция - 1);
		СимволПослеПроцента = Сред(СтрокаПодстановки, Позиция + 1, 1);
		ПодставляемыйПараметр = "";
		Если СимволПослеПроцента = "1" Тогда
			ПодставляемыйПараметр =  Параметр1;
		ИначеЕсли СимволПослеПроцента = "2" Тогда
			ПодставляемыйПараметр =  Параметр2;
		ИначеЕсли СимволПослеПроцента = "3" Тогда
			ПодставляемыйПараметр =  Параметр3;
		ИначеЕсли СимволПослеПроцента = "4" Тогда
			ПодставляемыйПараметр =  Параметр4;
		ИначеЕсли СимволПослеПроцента = "5" Тогда
			ПодставляемыйПараметр =  Параметр5;
		ИначеЕсли СимволПослеПроцента = "6" Тогда
			ПодставляемыйПараметр =  Параметр6;
		ИначеЕсли СимволПослеПроцента = "7" Тогда
			ПодставляемыйПараметр =  Параметр7
		ИначеЕсли СимволПослеПроцента = "8" Тогда
			ПодставляемыйПараметр =  Параметр8;
		ИначеЕсли СимволПослеПроцента = "9" Тогда
			ПодставляемыйПараметр =  Параметр9;
		КонецЕсли;
		Если ПодставляемыйПараметр = "" Тогда
			Результат = Результат + "%";
			СтрокаПодстановки = Сред(СтрокаПодстановки, Позиция + 1);
		Иначе
			Результат = Результат + ПодставляемыйПараметр;
			СтрокаПодстановки = Сред(СтрокаПодстановки, Позиция + 2);
		КонецЕсли;
		Позиция = Найти(СтрокаПодстановки, "%");
	КонецЦикла;
	Результат = Результат + СтрокаПодстановки;
	
	Возврат Результат;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьПоследнийСимволВСтроке(Текст, ЧислоСимволов = 1) Экспорт
	
	Текст = Лев(Текст, СтрДлина(Текст) - ЧислоСимволов);
	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеПустогоРасписания()
	
	Возврат НСтр("ru = 'Заполнить расписание'");
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если Прав(ВРег(ИсточникВыбора.ИмяФормы),СтрДлина("РасписаниеРаботы")) = ВРег("РасписаниеРаботы") Тогда  //ВРег("ВнешняяОбработка.ПланированиеСервис.Форма.РасписаниеРаботы")
		
		Если ВыбранноеЗначение = Неопределено Или ТолькоПросмотр Тогда
			Возврат;
		КонецЕсли;
		
		Если ВыбранноеЗначение.Свойство("ДеньПланирования") Тогда
			
			
		Иначе
			
			// Удаляем ранее заполненное расписания для этого дня.
			СтрокиДня = Новый Массив;
			Для Каждого СтрокаРасписания Из Объект.РасписаниеРаботы Цикл
				Если СтрокаРасписания.НомерДня = КонтекстВыбора.НомерДня Тогда
					СтрокиДня.Добавить(СтрокаРасписания.ПолучитьИдентификатор());
				КонецЕсли;
			КонецЦикла;
			Для Каждого ИдентификаторСтроки Из СтрокиДня Цикл
				Объект.РасписаниеРаботы.Удалить(Объект.РасписаниеРаботы.НайтиПоИдентификатору(ИдентификаторСтроки));
			КонецЦикла;
			
			// Заполняем расписание работы на день.
			Для Каждого ОписаниеИнтервала Из ВыбранноеЗначение.РасписаниеРаботы Цикл
				НоваяСтрока = Объект.РасписаниеРаботы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеИнтервала);
				НоваяСтрока.НомерДня = КонтекстВыбора.НомерДня;
			КонецЦикла;
			
			//Если КонтекстВыбора.НомерДня = 0 Тогда
			//	РасписаниеПредпраздничногоДня = ПредставлениеРасписанияДня(ЭтотОбъект, 0);
			//КонецЕсли;
			
			УстановитьСнятьПризнакСоответствияРезультатовШаблону(ЭтаФорма, Ложь);
			
			Если КонтекстВыбора.Источник = "ШаблонЗаполненияВыбор" Тогда
				
				СтрокаШаблона = Объект.ШаблонЗаполнения.НайтиПоИдентификатору(КонтекстВыбора.ИдентификаторСтрокиШаблона);
				СтрокаШаблона.ДеньВключенВГрафик = ВыбранноеЗначение.РасписаниеРаботы.Количество() > 0; // расписание заполнено
				СтрокаШаблона.ПредставлениеРасписания = ПредставлениеРасписанияДня(ЭтаФорма, КонтекстВыбора.НомерДня);
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура кнВыбратьПериод(Команда)
	//ОткрытьФорму("ВнешняяОбработка.ПланированиеСервис.Форма.ВыборДаты",Новый Структура("Дата",Объект.ДатаКалендаря),ЭтаФорма);
	//ОткрытьФорму(СтрЗаменить(ЭтаФорма.ИмяФормы,".ФормаЭлемента",".ВыборДаты"),Новый Структура("Дата",Объект.ДатаКалендаря),ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьПериод(Команда)
	Если Команда.Имя="ПредыдущийПериод" Тогда
		Объект.ДатаКалендаря=ДобавитьМесяц(Объект.ДатаКалендаря,-1);
	ИначеЕсли Команда.Имя="СледующийПериод" Тогда
		Объект.ДатаКалендаря=ДобавитьМесяц(Объект.ДатаКалендаря,1);
	КонецЕсли;
	УстановитьПериод();
	ОбновитьКалендарь();
КонецПроцедуры

&НаКлиенте
Процедура кнОбновить(Команда)
	ОбновитьHTML();
КонецПроцедуры

&НаСервере
Процедура УстановитьПериод()
	Обработка = РеквизитФормыВЗначение("Объект");
	УстановитьПериодНачалаОкончания();
	УстановитьИнтервалРабочегоВремени();
	Элементы.кнПериод.Заголовок=ПериодСтрокой();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКалендарь(Команда=Ложь) Экспорт 
	ОбновитьHTML();
КонецПроцедуры

&НаСервере
Процедура ОбновитьHTML() 
	СтрокаHTML= РеквизитФормыВЗначение("Объект").ПолучитьHTML();
КонецПроцедуры

&НаСервере
Процедура ИинциализоратьСтрунуцуРезультат()
	Объект.ВидКалендаря=3;
	
	Интервал=5;
	Объект.ИнтервалСлота=60;
	Объект.ТочностьПланирования=Объект.ИнтервалСлота;
	
	Объект.ДатаКалендаря=ТекущаяДата();
	//Объект.ДатаКалендаря=Объект.ДатаНачалаПланирования;
	УстановитьПериод();
	Объект.ПервыйЧас=Объект.НачалоРабочегоВремени;
	Объект.РежимПодбора=Ложь;
	Объект.ТолькоЧтение=Ложь;
	УстановитьПериод();
	ОбновитьHTML();
	//Массив=Новый Массив; Массив.Добавить(Справочники.CRM_ВидыСобытий.Оплата);
	//Календарь.ВидыСобытий.ЗагрузитьЗначения(Массив);
КонецПроцедуры

&НаКлиенте
Процедура РезультатЗаполнения(Команда)
	Если Не ЗначениеЗаполнено(Объект.ДатаОкончанияПланирования) Тогда
		// Если дата окончания не указана, то заполняем до конца года.
		Объект.ДатаОкончанияПланирования = КонецМесяца(Объект.ДатаНачалаПланирования);
	КонецЕсли;
	Если Объект.ДатаОкончанияПланирования<Объект.ДатаНачалаПланирования Тогда
		Объект.ДатаОкончанияПланирования = КонецМесяца(Объект.ДатаНачалаПланирования);
	КонецЕсли;		
	
	Если Объект.ЦехаПланирования.Количество()=0 Тогда
		СообщитьПользователю("Необходимо заполнить цеха планирования!");
		Возврат;
	КонецЕсли;		
	
	Для Каждого Цех из Объект.ЦехаПланирования Цикл
		Если Не значениезаполнено(Цех.Цех) Тогда
			СообщитьПользователю("В списке цехов планирования не может быть пустых значений!");
			Возврат;	
		КонецЕсли;
	КонецЦикла;
	
	ДлинаСуток = 24 * 3600;
	ОтступСуток = ДлинаСуток*Объект.МинДнейДоНачала;
	Если Не ЗначениеЗаполнено(Объект.ДатаНачалаПланирования) 
				ИЛИ Объект.ДатаНачалаПланирования<НачалоДня(ТекущаяДата()+ОтступСуток) Тогда
		Объект.ДатаНачалаПланирования = НачалоДня(ТекущаяДата()+ОтступСуток);
	КонецЕсли;
	
	МаксЗагруженныйДень = НайтиПоследнийЗагруженныйДеньЛок();
	Если МаксЗагруженныйДень> Объект.ДатаНачалаПланирования Тогда
		
		Объект.ДатаНачалаПланирования = МаксЗагруженныйДень+ДлинаСуток;
		Если Объект.ДатаОкончанияПланирования <= Объект.ДатаНачалаПланирования Тогда
			Объект.ДатаОкончанияПланирования = Объект.ДатаНачалаПланирования + ДлинаСуток;
		КонецЕсли;
		СообщитьПользователю("На сервере уже есть загруженные слоты. Заполнение по расписанию доступно с даты: " + Формат(МаксЗагруженныйДень+ДлинаСуток,"ДФ=""дд.ММ.гггг"""));
		Возврат;
	КонецЕсли;

	
	ЭтаФорма.Заголовок = "График тайм слотов. " + Объект.СообщениеОкончаниеПланирования;
	
	ЗаполнитьПоШаблонуНаСервере();
	ИинциализоратьСтрунуцуРезультат();
	Элементы.Страницы.ПодчиненныеЭлементы.НастройкаЗаполненияСтраница.Видимость = Ложь;
	Элементы.Страницы.ТекущаяСтраница = Элементы.РезультатЗаполненияСтраница;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоШаблонуНаСервере()
	ДлинаСуток = 24 * 3600;
	
	ДатаДня = Объект.ДатаНачалаПланирования;
	МаксЗагруженныйДень = НайтиПоследнийЗагруженныйДеньЛок();
	Если МаксЗагруженныйДень> ДатаДня Тогда
		Объект.ДатаНачалаПланирования = МаксЗагруженныйДень+ДлинаСуток;
		Если Объект.ДатаОкончанияПланирования <= Объект.ДатаНачалаПланирования Тогда
			Объект.ДатаОкончанияПланирования = Объект.ДатаНачалаПланирования + ДлинаСуток;
		КонецЕсли;
	КонецЕсли;
	
	Пока ДатаДня <= Объект.ДатаОкончанияПланирования Цикл
		НомерДня = ДеньНедели(ДатаДня);
		СтрокаДня = Объект.ШаблонЗаполнения[НомерДня - 1];
		Если СтрокаДня.ДеньВключенВГрафик Тогда
			//ДняГУИД = Новый УникальныйИдентификатор();
			ДняГУИД = НайтиДняГуид(ДатаДня);

			Отбор = Новый Структура;
			Отбор.Вставить("НомерДня", НомерДня);
			СписокСлотов = Объект.РасписаниеРаботы.НайтиСтроки(Отбор);
			Для Каждого СтрСписокСлотов из СписокСлотов Цикл 
				
				Для Каждого стрЦех из Объект.ЦехаПланирования Цикл
					Если не ЗначениеЗаполнено(стрЦех.ЦехГУИД) или не ЗначениеЗаполнено(стрЦех.Цех) Тогда
						Продолжить;
					КонецЕсли;
					дтНачала = Дата (Формат(НачалоДня(ДатаДня), "ДФ=yyyyMMdd")+ Прав("00"+Час(СтрСписокСлотов.ВремяНачала),2)+Прав("00"+Минута(СтрСписокСлотов.ВремяНачала),2));
					// если слот уже есть, не перезаписывать его
					Отбор1 = Новый Структура;
					Отбор1.Вставить("ЦехГУИД", стрЦех.ЦехГУИД);
					Отбор1.Вставить("ДатаНачала", дтНачала);
					УжеЕсть = Объект.КалендариСервис.НайтиСтроки(Отбор1);
					Если УжеЕсть.Количество()=0  Тогда
						// ------
						СтрКалендариСервис = Объект.КалендариСервис.Добавить();
						СтрКалендариСервис.ГУИДзаписи = Новый УникальныйИдентификатор();
						СтрКалендариСервис.ЦехГУИД = стрЦех.ЦехГУИД;
						СтрКалендариСервис.ДняГуид = ДняГУИД;
						СтрКалендариСервис.ДатаНачала =дтНачала;
						СтрКалендариСервис.ДатаОкончания = Дата (Формат(НачалоДня(ДатаДня), "ДФ=yyyyMMdd")+ Прав("00"+Час(СтрСписокСлотов.ВремяОкончания),2)+Прав("00"+Минута(СтрСписокСлотов.ВремяОкончания),2));
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		ДатаДня = ДатаДня + ДлинаСуток;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УдалитьТаймСлотПоГУИД(ГУИД)
		Отбор = Новый Структура;
		Отбор.Вставить("ГУИДзаписи", ГУИД);
		СписокСлотов = Объект.КалендариСервис.НайтиСтроки(Отбор);
		Для Каждого СтрСписокСлотов из СписокСлотов Цикл  
			Объект.КалендариСервис.Удалить(СтрСписокСлотов);
				
		КонецЦикла;
КонецПроцедуры


//Календарь
//&НаКлиенте
//Функция ОбработкаСобытия(ДокументHTML,Форма) Экспорт
//	
//	Событие = ПолучитьПараметрыСобытияИзДокумента(ДокументHTML);
//	Если Событие.Имя = "select" Тогда
//		eventНовый(Событие.Параметры,Форма);
//	ИначеЕсли Событие.Имя = "eventClick" Тогда
//		eventВыбор(Событие.Параметры,Форма); 
//	ИначеЕсли Событие.Имя = "eventDrop" Тогда
//		eventПеремещение(Событие.Параметры, Форма)
//	ИначеЕсли Событие.Имя = "eventResize" Тогда
//		eventИзменениеРазмера(Событие.Параметры, Форма)
//	ИначеЕсли Событие.Имя = "eventOnContextMenu" Тогда
//		
//	ИначеЕсли Событие.Имя = "onViewChange" Тогда
//		
//	КонецЕсли;
//	
//	Возврат Событие;
//	
//КонецФункции

&НаКлиенте 
Функция ПолучитьПараметрыСобытияИзДокумента(ДокументHTML)
	
	//Имена событий:
	//	"select" - "создание нового"
	//	"eventClick" - "выбор существующего"
	//	"eventDrop" - "перемещение"
	//	"eventResize" - "изменение размера"
	//	"eventOnContextMenu" - "правая кнопка"
	//	"onViewChange" - "изменение вида календаря"
	
	ПустоеСобытие = Новый Структура("Имя,Параметры","","");
	
	
	Попытка
		ИмяСобытия = ДокументHTML.defaultView.eval("eventName");
		Количество = ДокументHTML.defaultView.eval("eventCount");
	Исключение
		ИмяСобытия = "";
		Количество = 0;
	КонецПопытки;
	
	// ----  new for WebKit
	вебкит = ложь;
	Если НЕ ЗначениеЗаполнено(ИмяСобытия) Тогда
		Попытка
			ИмяСобытия = ДокументHTML.defaultView.eventName;
			Количество = ДокументHTML.defaultView.eventCount;
			вебкит = истина;
		Исключение
			ИмяСобытия = "";
			Количество = 0;
		КонецПопытки;

	КонецЕсли;
	// -----
	
	Если НЕ ЗначениеЗаполнено(ИмяСобытия) Тогда
		Возврат ПустоеСобытие;
	КонецЕсли;
	
	// Из COMОбъекта переводим в массив
	ПараметрыСобытия = Новый Массив;
	Для Индекс = 1 По Количество Цикл
		Если вебкит Тогда
			ПараметрыСобытия.Добавить( ДокументHTML.defaultView.getEventParam(Формат(Индекс-1,"ЧН=0;ЧГ=")));
		Иначе
			ПараметрыСобытия.Добавить( ДокументHTML.defaultView.eval("getEventParam("+Формат(Индекс-1,"ЧН=0;ЧГ=")+")") );
		КонецЕсли;
	КонецЦикла;
	
	ОчиститьПараметрыСобытияИзДокумента(ДокументHTML);
	
	Событие = Новый Структура("Имя,Параметры", ИмяСобытия, ПараметрыСобытия);
	Если ИмяСобытия = "select" И Количество = 3 Тогда
		Возврат Событие;
	ИначеЕсли ИмяСобытия = "eventClick" И Количество = 1 Тогда
		Возврат Событие;
	ИначеЕсли ИмяСобытия = "eventDrop" И Количество = 4 Тогда
		Возврат Событие;
	ИначеЕсли ИмяСобытия = "eventResize" И Количество = 3 Тогда
		Возврат Событие;
	ИначеЕсли ИмяСобытия = "eventOnContextMenu" И Количество = 2 Тогда
		Возврат Событие;
	ИначеЕсли ИмяСобытия = "onViewChange" И Количество = 2 Тогда
		Возврат Событие;
	Иначе
		Возврат ПустоеСобытие;
	КонецЕсли;
	
КонецФункции

&НаКлиенте 
Процедура ОчиститьПараметрыСобытияИзДокумента(ДокументHTML)
	
	Попытка
		ДокументHTML.defaultView.eval("clearEventParam()");
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Функция СтруктураИдентификатора(Идентификатор)
	
	Возврат Новый Структура("Префикс,Номер", Лев(Идентификатор,2), Сред(Идентификатор,4));
	
КонецФункции

//Функция ТипОбъектаСобытия(ВидыСобытий)
//	
//	Массив = Новый Массив;
//	Массив.Добавить(Справочники.CRM_ВидыСобытий.ОтправкаДокументовВБанк);
//	Массив.Добавить(Перечисления.Renault_ОбластиПрименения.ОФУ);
//	Для Каждого Эл Из ВидыСобытий Цикл 
//		Если Массив.Найти(Эл.Значение)<>Неопределено Тогда
//			Возврат "ЗД";
//		КонецЕсли;
//	КонецЦикла;
//	Возврат "РЛ";
//	
//КонецФункции

&НаКлиенте 
Процедура eventНовый(Параметры, Форма)
	
КонецПроцедуры

&НаКлиенте
Процедура eventВыбор(Параметры, Форма)
	
КонецПроцедуры

&НаКлиенте
Процедура eventПеремещение(Параметры, Форма)
	
КонецПроцедуры

&НаКлиенте
Процедура eventИзменениеРазмера(Параметры, Форма)
	
КонецПроцедуры	
//-обработка событий браузера

//+ интерфейс
Функция ПериодСтрокой() Экспорт
	
	Возврат "с "+Формат(Объект.НачалоПериода,"ДЛФ=D")+Символы.ПС+"по "+Формат(Объект.ОкончаниеПериода,"ДЛФ=D")
	
КонецФункции

Процедура УстановитьПериодНачалаОкончания() Экспорт
	
	Объект.НачалоПериода=НачалоМесяца(Объект.ДатаКалендаря);
	Объект.ОкончаниеПериода=КонецДня(КонецМесяца(Объект.ДатаКалендаря));
	
КонецПроцедуры

Процедура УстановитьИнтервалРабочегоВремени() Экспорт  //продолжительность рабочего дня пользователя
	
	Объект.НачалоРабочегоВремени=Дата("00010101090000");
	Объект.ОкончаниеРабочегоВремени=Дата("00010101200000");
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	ОбработкаСобытия(Элемент.Документ,ЭтаФорма);
КонецПроцедуры
//- интерфейс

&НаКлиенте
Процедура ОбработкаСобытия(ДокументHTML,Форма) Экспорт
	Настройки=ПолучитьПараметрыСобытияИзДокумента(ДокументHTML);
	//СообщитьПользователю("Зашли в обр соб ");

	Если Настройки=Неопределено Тогда 
		Возврат  
	КонецЕсли;
	
	ИмяСобытия=Настройки.Имя;
	ПараметрыСобытия=Настройки.Параметры;
	Если ТипЗнч(ПараметрыСобытия)<>Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	КолПараметров=ПараметрыСобытия.Количество();
	//СообщитьПользователю("Имя события " + ИмяСобытия + " кол-во " + строка(КолПараметров));
	Если ИмяСобытия = "select" И КолПараметров = 3 Тогда 
		//НовоеСобытие(Форма, ПараметрыСобытия);
		СобытиеВыбор(Форма,ПараметрыСобытия); 
	ИначеЕсли ИмяСобытия = "eventClick" И КолПараметров = 1 Тогда 
		СобытиеВыбор(Форма,ПараметрыСобытия); 
	//ИначеЕсли ИмяСобытия = "ПланировщикСобытиеПриОкончанииПеретаскивания" И КолПараметров = 4 Тогда Перетаскивание(ПараметрыСобытия)
	//ИначеЕсли ИмяСобытия = "ПланировщикСобытиеПриОкончанииИзменениеРазмера" И КолПараметров = 3 Тогда ИзменениеРазмера(ПараметрыСобытия)
	//ИначеЕсли ИмяСобытия = "ПланировщикСобытиеПриКонтекстномМеню" И КолПараметров = 2 Тогда
		//ПланировщикСобытиеПриКонтекстномМеню(ПараметрыСобытия[0], ПараметрыСобытия[1]);
	//ИначеЕсли ИмяСобытия = "ПланировщикПриИзмененииВидаКалендаря" И КолПараметров = 2 Тогда
		//ПланировщикПриИзмененииВидаКалендаря(ПараметрыСобытия[0], ПараметрыСобытия[1]);
	КонецЕсли;
	ОчиститьПараметрыСобытияИзДокумента(ДокументHTML);
	
КонецПроцедуры

&НаКлиенте 
//Функция ПолучитьПараметрыСобытияИзДокумента(ДокументHTML)
//	Попытка
//		ИмяСобытия	= ДокументHTML.parentWindow.eval("eventName");
//		Количество	= ДокументHTML.parentWindow.eval("eventCount");
//	Исключение
//		ИмяСобытия	= "";
//		Количество	= 0;
//	КонецПопытки;
//	
//	Если НЕ ЗначениеЗаполнено(ИмяСобытия) Тогда
//		Возврат Неопределено;
//	КонецЕсли;
//	
//	// Имена событий формы
//	ИменаСобытий = Новый Соответствие;
//	ИменаСобытий.Вставить("select"				, "ПланировщикВыбор");
//	ИменаСобытий.Вставить("eventClick"			, "ПланировщикСобытиеВыбор");
//	ИменаСобытий.Вставить("eventDrop"			, "ПланировщикСобытиеПриОкончанииПеретаскивания");
//	ИменаСобытий.Вставить("eventResize"			, "ПланировщикСобытиеПриОкончанииИзменениеРазмера");
//	ИменаСобытий.Вставить("eventOnContextMenu"	, "ПланировщикСобытиеПриКонтекстномМеню");
//	ИменаСобытий.Вставить("onViewChange"		, "ПланировщикПриИзмененииВидаКалендаря");
//	
//	// Признак СтандартнаяОбработка
//	ПроверкаОбработки = Новый Массив;
//	ПроверкаОбработки.Добавить("eventResize");
//	
//	// Из COMОбъекта переводим в массив
//	ПараметрыПодстановки = Новый Массив;
//	Для Индекс = 1 По Количество Цикл
//		ЗначениеПараметра = ДокументHTML.parentWindow.eval("getEventParam(" + Формат(Индекс-1, "ЧН=0; ЧГ=") + ")");
//		ПараметрыПодстановки.Добавить(ЗначениеПараметра);
//	КонецЦикла;
//	
//	СтруктураСобытия = Новый Структура;
//	СтруктураСобытия.Вставить("Имя"			, ИменаСобытий.Получить(ИмяСобытия));
//	СтруктураСобытия.Вставить("Параметры"	, ПараметрыПодстановки);
//	СтруктураСобытия.Вставить("Количество"	, Количество);
//	
//	Возврат СтруктураСобытия;
//КонецФункции

//&НаКлиенте 
//Процедура ОчиститьПараметрыСобытияИзДокумента(ДокументHTML) 
//	Попытка 
//		ДокументHTML.parentWindow.eval("clearEventParam()"); 
//	Исключение 
//	КонецПопытки 
//КонецПроцедуры

&НаКлиенте 
Процедура НовоеСобытие(Форма,Параметры)
	
	//ДатаНачала=Параметры[0];
	//ДатаОкончания=Параметры[1];
	//ВесьДень=Параметры[2];
	//
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("РасписаниеРаботы", РасписаниеРаботы(ДеньНедели(Дата(ПараметрыСобытия[0]))));
	//ПараметрыФормы.Вставить("ДеньПланирования", Дата(ПараметрыСобытия[0]));
	//Объект.КалендариСервис
	//ОткрытьФорму(СтрЗаменить(ЭтаФорма.ИмяФормы,".ФормаЭлемента",".РасписаниеДня"), ПараметрыФормы, ЭтаФорма);
	//
	//ДопПараметры = Новый Структура;
	//ДопПараметры.Вставить("Форма"			, Форма);
	//ДопПараметры.Вставить("ДатаНачала"		, ДатаНачала);
	//ДопПараметры.Вставить("ДатаОкончания"	, ДатаОкончания);
	//ДопПараметры.Вставить("ВесьДень"		, ВесьДень);
	//
	////ОписаниеОповещения = Новый ОписаниеОповещения("ПланировщикВыборЗавершение", ЭтотОбъект, ДопПараметры);
	//НачалоСобытия=Дата(ДатаНачала);
	//ОкончаниеСобытия=Дата(ДатаОкончания);
	
КонецПроцедуры

&НаКлиенте
Процедура СобытиеВыбор(Форма, Параметры)
	СформироватьПредставлениеДня (Параметры);
	
	
	//Элементы.Страницы.ПодчиненныеЭлементы.НастройкаЗаполненияСтраница.Видимость = Ложь;	
	//Элементы.Страницы.ПодчиненныеЭлементы.ГруппаКалендарьДня.Видимость = Истина;	
	//ОбновитьHTML();
	//Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаКалендарьДня;
	ПоказатьЗакладкуГруппаКалендарьДня();

КонецПроцедуры

&НаСервере 
Функция СформироватьПредставлениеДня (Параметры)
	//ТЗ_Дня = Новый ТаблицаЗначений;
	//тз_Дня.Колонки.Добавить("ГУИДзаписи", новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки("40")));
	//тз_Дня.Колонки.Добавить("ЦехГУИД", новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки("40")));
	//тз_Дня.Колонки.Добавить("ДняГуид", новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки("40")));
	//тз_Дня.Колонки.Добавить("ГУИДзаписи", новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки("40")));
	ТекДняГУИД = Неопределено;
	
	Если Параметры.Количество()=1 Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("ДняГуид", Параметры[0]);
		ТЗ_Дня = Объект.КалендариСервис.НайтиСтроки(Отбор);
		ДатаДня = ТЗ_Дня[0].ДатаНачала;
		ТекДняГУИД = Параметры[0];

	ИначеЕсли Параметры.Количество()=3 Тогда
		ДатаДня = НачалоДня(Дата(Параметры[0]));
		ТекДняГУИД = Параметры[0];
		Для Каждого д1 из Объект.КалендариСервис Цикл
			Если НачалоДня(д1.ДатаНачала)=ДатаДня Тогда
				ТекДняГУИД = д1.ДняГуид;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	ТекДняНачало = НачалоДня(ДатаДня);
	
	Если ДеньСодержитЗагруженныеТаймСлоты(ТекДняГУИД) Тогда
		// -----------------------------------------------------
		//  слоты данного дня загружены на сервер, отобразить
		
		Отбор = Новый Структура;
		Отбор.Вставить("ДняГуид", ТекДняГУИД);
		м_Дня = Объект.КалендариСервис.НайтиСтроки(Отбор);
		Для Каждого дн из м_Дня Цикл
			СтрКалендаряДня = КалендарьДня.Добавить();
			ЗаполнитьЗначенияСвойств(СтрКалендаряДня, дн);
			СтрКалендаряДня.Цех = Справочники[ОпределитьНаименованиеСправочника("Цеха")].ПолучитьСсылку(Новый УникальныйИдентификатор(дн.ЦехГУИД));	
			СтрКалендаряДня.Флажок = Истина;
						
			Если дн.СтатусРезерва = 1 Тогда
				СтрКалендаряДня.СтатусРезерваСтрока = "ЗАПИСЬ";
			ИначеЕсли  дн.СтатусРезерва = 3 Тогда
				СтрКалендаряДня.СтатусРезерваСтрока = "ОТМЕНА ЗАПИСИ";
			Иначе
				СтрКалендаряДня.СтатусРезерваСтрока = "-";	
			КонецЕсли;
			
			Если дн.СтатусРезерва = 1 или  дн.СтатусРезерва = 3  Тогда
				Бронь = ПолучитьДанныеОЗаписи(СтрКалендаряДня.ГУИДзаписи,СтрКалендаряДня.БрониГУИД);
				СтрКалендаряДня.ИнформацияЗаписи = Бронь.ПолнаяСтрока;
				СтрКалендаряДня.ИнформацияКратко = Бронь.ФИО + " " + Бронь.Машина;
			КонецЕсли;

		КонецЦикла;
		
		//  --- оформление таблицы календарьдня -----
		// ================================================================
		//  -- зарезервированные слоты
		ЭлементОформления = УсловноеОформление.Элементы.Добавить();
		// условия при которых будет выполнено оформление
		ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение     = Новый ПолеКомпоновкиДанных("КалендарьДня.СтатусРезерва");
		ЭлементОтбора.ВидСравнения      = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение    = 1;
		ЭлементОтбора.Использование     = Истина;
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",WebЦвета.БледноЗеленый );      //  зеленый  WebЦвета.БледноЗеленый
		// какие поля (колонки) оформлять
		ПолеОформления      = ЭлементОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("КалендарьДня");
		ПолеОформления.Использование = Истина; 
		ЭлементОформления.Использование = Истина;
		// ================================================================
		//  -- слоты с отменой резерва
		ЭлементОформления = УсловноеОформление.Элементы.Добавить();
		// условия при которых будет выполнено оформление
		ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение     = Новый ПолеКомпоновкиДанных("КалендарьДня.СтатусРезерва");
		ЭлементОтбора.ВидСравнения      = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение    = 3;
		ЭлементОтбора.Использование     = Истина;
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(247, 119, 84));   //  красный
		// какие поля (колонки) оформлять
		ПолеОформления      = ЭлементОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("КалендарьДня");
		ПолеОформления.Использование = Истина; 
		ЭлементОформления.Использование = Истина;	
		// ================================================================

		//  -- конец оформления
		
	Иначе
		// -----------------------------------------------------
		// слоты данного дня еще не загружены на сервер, идет работа по расписанию
		Отбор = Новый Структура;
		Отбор.Вставить("НомерДня", ДеньНедели(ДатаДня));
		СписокСлотов = Объект.РасписаниеРаботы.НайтиСтроки(Отбор);
		Для Каждого СтрСписокСлотов из СписокСлотов Цикл 
			Для Каждого стрЦех из Объект.ЦехаПланирования Цикл
				Если не ЗначениеЗаполнено(стрЦех.ЦехГУИД) или не ЗначениеЗаполнено(стрЦех.Цех) Тогда
						Продолжить;
				КонецЕсли;
				ГУИДзаписи = Новый УникальныйИдентификатор();
				ЦехГУИД = стрЦех.ЦехГУИД;
				
				ДатаНачала =Дата (Формат(НачалоДня(ДатаДня), "ДФ=yyyyMMdd")+ Прав("00"+Час(СтрСписокСлотов.ВремяНачала),2)+Прав("00"+Минута(СтрСписокСлотов.ВремяНачала),2));
				ДатаОкончания = Дата (Формат(НачалоДня(ДатаДня), "ДФ=yyyyMMdd")+ Прав("00"+Час(СтрСписокСлотов.ВремяОкончания),2)+Прав("00"+Минута(СтрСписокСлотов.ВремяОкончания),2));
				Отбор = Новый Структура;
				Отбор.Вставить("ДняГуид", ТекДняГУИД);
				Отбор.Вставить("ДатаНачала", ДатаНачала);
				Отбор.Вставить("ЦехГУИД", ЦехГУИД);
				м_Дня = Объект.КалендариСервис.НайтиСтроки(Отбор);
				Если м_Дня.Количество() = 0 Тогда
					СтрКалендариСервис = КалендарьДня.Добавить();
					СтрКалендариСервис.ГУИДзаписи = Новый УникальныйИдентификатор();
					СтрКалендариСервис.ЦехГУИД = ЦехГУИД;
					СтрКалендариСервис.Цех = стрЦех.Цех;
					СтрКалендариСервис.ДатаНачала = ДатаНачала;
					СтрКалендариСервис.ДатаОкончания = ДатаОкончания;
				Иначе
					СтрКалендариСервис = КалендарьДня.Добавить();
					ЗаполнитьЗначенияСвойств(СтрКалендариСервис, м_Дня[0]);
					СтрКалендариСервис.Флажок = Истина;
					отбор = новый Структура;
					Отбор.Вставить("ЦехГУИД" ,м_Дня[0].ЦехГУИД);
					м_Цеха = Объект.ЦехаПланирования.НайтиСтроки(отбор);
					Если м_Цеха <> Неопределено Тогда
						СтрКалендариСервис.Цех = м_Цеха[0].Цех;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецФункции


&НаСервере
Функция ДеньСодержитЗагруженныеТаймСлоты(ДняГУИД) Экспорт
	Рез = Ложь;
	Отбор = Новый Структура;
	Отбор.Вставить("ДняГуид", ДняГУИД);
	Отбор.Вставить("ЗагруженНаСервер", Истина);
	м_Дня = Объект.КалендариСервис.НайтиСтроки(Отбор);	
	Если м_Дня.Количество() <> 0 Тогда
		Рез = Истина;
	КонецЕсли;
	Возврат Рез;
КонецФункции

&НаКлиенте
Процедура ПланировщикВыборЗавершение(Результат, ДопПараметры) Экспорт
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ДопПараметры.Свойство("Форма") Тогда
		Возврат;
	ИначеЕсли НЕ ТипЗнч(ДопПараметры.Форма) = Тип("УправляемаяФорма") Тогда
		Возврат;
	ИначеЕсли НЕ ДопПараметры.Форма.ИмяФормы = "Обработка.ПланировщикИнтерфейс.Форма.Форма" Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры.Форма.Обновить(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Перетаскивание(Параметры)
	Идентификатор=Параметры[0];
	КоличествоДней=Параметры[1];
	КоличествоМинут=Параметры[2];
	ВесьДень=Параметры[3];
	//Док=Документы.CRM_СобытияПоРабочимЛистам.НайтиПоНомеру(Идентификатор,ДатаКалендаря).ПолучитьОбъект();
	//Док.ДатаНапоминания=Док.ДатаНапоминания+КоличествоДней*86400+КоличествоМинут*60;
	//Док.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеРазмера(Параметры)
	Идентификатор=Параметры[0];
	КоличествоДней=Параметры[1];
	КоличествоМинут=Параметры[2];
	//Док=Документы.CRM_СобытияПоРабочимЛистам.НайтиПоНомеру(Идентификатор,ДатаКалендаря).ПолучитьОбъект();
	//Док.Длительность=Док.Длительность+КоличествоМинут;
	//Док.Записать();
КонецПроцедуры	

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	Если Объект.ДатаНачалаПланирования < НачалоДня(ТекущаяДата()) тогда
		СообщитьПользователю(
				НСтр("ru = 'Дата начала меньще текущей даты'"), ,
				"ДатаНачала");
		Объект.ДатаНачалаПланирования = НачалоДня(ТекущаяДата());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СообщитьПользователю(
		Знач ТекстСообщенияПользователю,
		Знач КлючДанных = Неопределено,
		Знач Поле = "",
		Знач ПутьКДанным = "",
		Отказ = Ложь) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.Поле = Поле;
	
	ЭтоОбъект = Ложь;
	
	Если ЭтоОбъект Тогда
		Сообщение.УстановитьДанные(КлючДанных);
	Иначе
		Сообщение.КлючДанных = КлючДанных;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПутьКДанным) Тогда
		Сообщение.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
		
	Сообщение.Сообщить();
	
	ПоказатьПредупреждение(, ТекстСообщенияПользователю);
	
	Отказ = Истина;
	
КонецПроцедуры


&НаСервере
Процедура СообщитьПользователюСерв(
		Знач ТекстСообщенияПользователю,
		Знач КлючДанных = Неопределено,
		Знач Поле = "",
		Знач ПутьКДанным = "",
		Отказ = Ложь) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.Поле = Поле;
	
	ЭтоОбъект = Ложь;
	
	Если ЭтоОбъект Тогда
		Сообщение.УстановитьДанные(КлючДанных);
	Иначе
		Сообщение.КлючДанных = КлючДанных;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПутьКДанным) Тогда
		Сообщение.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
		
	Сообщение.Сообщить();
	
	Отказ = Истина;
	
КонецПроцедуры


&НаКлиенте
Процедура Назад(Команда)
	//ОчиститьРасписаниеРаботы();
	Элементы.Страницы.ПодчиненныеЭлементы.НастройкаЗаполненияСтраница.Видимость = Истина;
	Элементы.Страницы.ТекущаяСтраница = Элементы.НастройкаЗаполненияСтраница;
	ЭтаФорма.Заголовок = "Планирование тайм слотов";
КонецПроцедуры

&НаСервере
Процедура ОчиститьРасписаниеРаботы ()
	Объект.КалендариСервис.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ЦехаПланированияПриИзменении(Элемент)
	ЦехаПланированияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЦехаПланированияПриИзмененииНаСервере ()
	Если Элементы.ЦехаПланирования.ТекущаяСтрока<>Неопределено Тогда
		ТекущиеДанные = Объект.ЦехаПланирования.НайтиПоИдентификатору(Элементы.ЦехаПланирования.ТекущаяСтрока);
		Если ТекущиеДанные <> Неопределено и ЗначениеЗаполнено(ТекущиеДанные.Цех) Тогда
			ТекущиеДанные.ЦехГУИД = ТекущиеДанные.Цех.УникальныйИдентификатор();
		КонецЕсли;
	КонецЕсли;
	ТЗ = Новый ТаблицаЗначений;
	ТЗ = Объект.ЦехаПланирования.Выгрузить();
	ТЗ.Свернуть("Цех","ЦехГУИД");
	Объект.ЦехаПланирования.Загрузить(ТЗ);

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьДень(Команда)
	КалендарьДня.Очистить();
	ОбновитьHTML();	
	//Элементы.Страницы.ТекущаяСтраница = Элементы.РезультатЗаполненияСтраница;
	ПоказатьЗакладкуРезультатЗаполненияСтраница();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДень(Команда)
	СохранитьДеньНаСервере();
	//Элементы.Страницы.ТекущаяСтраница = Элементы.РезультатЗаполненияСтраница;
	ПоказатьЗакладкуРезультатЗаполненияСтраница();
КонецПроцедуры

&НаСервере
Процедура СохранитьДеньНаСервере()
	Отбор = Новый Структура;
	Отбор.Вставить("ДняГуид", ТекДняГУИД);
	Отбор.Вставить("ЗагруженНаСервер", Ложь);
	м_Дня = Объект.КалендариСервис.НайтиСтроки(Отбор);
	
	Для Каждого стрДня из м_Дня Цикл
		Объект.КалендариСервис.Удалить(стрДня);
	КонецЦикла;
	
	Для Каждого СтрКалендарьДня из КалендарьДня Цикл
		Если СтрКалендарьДня.Флажок Тогда
			Отбор = Новый Структура;
			Отбор.Вставить("ДняГуид", ТекДняГУИД);
			Отбор.Вставить("ЗагруженНаСервер", Истина);
			Отбор.Вставить("ЦехГУИД", СтрКалендарьДня.ЦехГУИД);
			Отбор.Вставить("ДатаНачала", СтрКалендарьДня.ДатаНачала);
			тс1 = Объект.КалендариСервис.НайтиСтроки(Отбор);
			Если тс1.количество()=0 Тогда
				СтрокаТЗ = Объект.КалендариСервис.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЗ, СтрКалендарьДня);
				СтрокаТЗ.ЗагруженНаСервер = Ложь;
				СтрокаТЗ.ДняГуид = ТекДняГУИД;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	КалендарьДня.Очистить();
	ТекДняГУИД = Неопределено;
	ОбновитьHTML();
КонецПроцедуры

&НаКлиенте
Процедура КалендарьДняПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаСервере
Процедура ДилерскийЦентрПриИзмененииНаСервере(ТекстСообщения="") 
	ФлагБылаЗагрузкаССервера = Ложь;
	ТекстСообщения="";
	о1 = Объект;                                               	
	Если не ЗначениеЗаполнено(о1.ДилерскийЦентр["DMD"]) Или СтрДлина(сокрлп(о1.ДилерскийЦентр["DMD"]))<>8 Тогда
		//ПоказатьПредупреждение(,НСтр("ru = 'У выбранного дилерского центра не указан DMD код или указан код неверной длины!'"));
		ТекстСообщения=НСтр("ru = 'У выбранного дилерского центра не указан DMD код или указан код неверной длины!'");

		о1.BIRDMD = "";
		Возврат;
	КонецЕсли;
	о1.BIRDMD = сокрлп(о1.ДилерскийЦентр["DMD"]);
	ЗагрузитьсСервераНаСервере(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДилерскийЦентрПриИзменении(Элемент)
	ТекстСообщения="";

	ДилерскийЦентрПриИзмененииНаСервере(ТекстСообщения);
	ЭтаФорма.ОтобразитьИзменениеДанных(Объект.МинДнейДоНачала,ВидИзмененияДанных.Изменение);
	ЭтаФорма.ОтобразитьИзменениеДанных(Объект.СообщениеОкончаниеПланирования,ВидИзмененияДанных.Изменение);

	Если ТекстСообщения<>"" Тогда
		ПоказатьПредупреждение(,ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СтатусЗагрузкиССервера()
	Возврат ФлагБылаЗагрузкаССервера;
КонецФункции
	
	
&НаКлиенте
Процедура ВыгрузитьНаСервер(Команда)
	Если СтатусЗагрузкиССервера()=Ложь Тогда		 
		 ПоказатьПредупреждение(,НСтр("ru = 'Чтобы выгрузить тайм-слоты на сервер сначала необходимо загрузить с сервера текущие данные о тайм-слотах!'"));
		 Возврат;
	КонецЕсли;
	ВыгрузитьТаймСлоты();
	// сохраняем текущие слоты, чтобы удалить незагруженные резервы 
	СлотыДоЗагрузки = ПолучитьМассивГуидовТекущихСлотов();
	ЗагрузитьсСервераНаСервере();
	УдалитьНезагруженныеРезервы(СлотыДоЗагрузки);
	ОбновитьHTML();
КонецПроцедуры


&НаСервере
Процедура ОбновитьСтатусУспешноЗагруженных()
	Для каждого таймслот из Объект.КалендариСервис Цикл
		Рез = РеквизитФормыВЗначение("Объект").СинхронизироватьРезервПоСлотуКалендаря(таймслот.ГУИДзаписи);
	КонецЦикла;
КонецПроцедуры


&НаСервере
Процедура УдалитьНезагруженныеРезервы(СтарыйСписок)
	мс = Новый Массив;
	о1 = РеквизитФормыВЗначение("Объект");
	Для и1=0 по СтарыйСписок.ВГраница() Цикл
		ГУИДзаписи = СтарыйСписок[и1];
		Отбор1 = Новый Структура;
		Отбор1.Вставить("ГУИДзаписи", ГУИДзаписи);
		УжеЕсть = Объект.КалендариСервис.НайтиСтроки(Отбор1);
		Если УжеЕсть.Количество()=0  Тогда
			слот = о1.ПрочитатьСлотЛокальноПоГУИД(ГУИДзаписи);
			Если слот.ГУИДзаписи = ГУИДзаписи и слот.ЗагруженНаСервер=ложь Тогда
				удален = о1.УдалитьСлотПоГУИД(ГУИДзаписи);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры


&НаСервере
Функция ПолучитьМассивГуидовТекущихСлотов() Экспорт
	МассивТаймСлотов = Новый Массив;
	Для каждого таймслот из Объект.КалендариСервис Цикл
		МассивТаймСлотов.Добавить(таймслот.ГУИДзаписи);
	КонецЦикла;
	Возврат МассивТаймСлотов;
КонецФункции


&НаСервере
Процедура ВыгрузитьТаймСлоты()
	// Вставить содержимое обработчика.
	
	//МинДатаРезерва = НачалоДня(ТекущаяДата()) + (Объект.МинДнейДоНачала+1)*24*3600;
	
		
	МассивТаймСлотов = Новый Массив;
	Для каждого таймслот из Объект.КалендариСервис Цикл
		Если таймслот.ЗагруженНаСервер = Истина Тогда
			//  не загружаем уже загруженные
			Продолжить;
		КонецЕсли;
		
		ОписаниеОшибок="";
		Рез = РеквизитФормыВЗначение("Объект").СоздатьРезервПоСлотуКалендаря(таймслот.ГУИДзаписи,ОписаниеОшибок);
		ЦехСтр = Строка(Справочники.Цеха.ПолучитьСсылку(Новый УникальныйИдентификатор(таймслот.ЦехГУИД)));
		Если Рез=1 Тогда
			 СообщитьПользователюСерв("Слот для " + ЦехСтр + " время " + Формат(таймслот.ДатаНачала,"ДФ=""дд.ММ.гггг ЧЧ:мм""") + " зарезервирован!"); 
		ИначеЕсли 	Рез=2 Тогда
			 СообщитьПользователюСерв("Слот для " + ЦехСтр + " время " + Формат(таймслот.ДатаНачала,"ДФ=""дд.ММ.гггг ЧЧ:мм""") + " уже был зарезервирован ранее");
		ИначеЕсли 	Рез=3 Тогда
			 СообщитьПользователюСерв("Слот для " + ЦехСтр + " время " + Формат(таймслот.ДатаНачала,"ДФ=""дд.ММ.гггг ЧЧ:мм""") + " был в ДМС, резервы созданы");
		Иначе 
			 СообщитьПользователюСерв("Слот для " + ЦехСтр + " время " + Формат(таймслот.ДатаНачала,"ДФ=""дд.ММ.гггг ЧЧ:мм""") + " не может быть создан по причине: "+ ОписаниеОшибок + " код ошибки: "+Строка(Рез));
			 
			 //  не загружаем те слоты, где в ДМС не удалось создать резервы в графике сервиса
			 Продолжить;
		КонецЕсли;

		стр1 = Новый Структура;
		стр1.Вставить("timeslotid",Строка(таймслот.ГУИДзаписи));
		//стр1.Вставить("tsdate",таймслот.ДатаНачала);
		стр1.Вставить("timestart",таймслот.ДатаНачала);
		//стр1.Вставить("timeend",таймслот.);
		стр1.Вставить("workpostid",Строка(таймслот.ЦехГУИД));
		//стр1.Вставить("reservationid",);
		стр1.Вставить("commitbydealer",1);
		//стр1.Вставить("BIR",Объект.BIRDMD);
		//стр1.Вставить("createdate",);
		//стр1.Вставить("reservationstatus",);
		стр1.Вставить("tsdateyear",Год(таймслот.ДатаНачала));
		стр1.Вставить("tsdatemonth",Месяц(таймслот.ДатаНачала));
		стр1.Вставить("tsdateday",День(таймслот.ДатаНачала));
		стр1.Вставить("timestarth",Час(таймслот.ДатаНачала));
		стр1.Вставить("timeendh",Час(таймслот.ДатаОкончания));
		МассивТаймСлотов.Добавить(стр1);

	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	СтруктОтправки = Новый Структура;
	АдрСрв=ПолучитьКоннекты(); 
	Если АдрСрв.СтрокаОшибок<>"" Тогда
		//КодОшибки=1;
		СообщитьПользователюСерв(АдрСрв.СтрокаОшибок);
		Возврат;
	КонецЕсли;


	СтруктОтправки.Вставить("token",АдрСрв.ЛокальныйТокен);
	СтруктОтправки.Вставить("BIR",СокрЛП(Объект.BIRDMD));
	СтруктОтправки.Вставить("dealercenterid",СТРОКА(Объект.ДилерскийЦентр.УникальныйИдентификатор()));


	СтруктОтправки.Вставить("data",МассивТаймСлотов);
	
	тНастройкиСериализации = Новый НастройкиСериализацииJSON;
    тНастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	тНастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением;
	
	ЗаписатьJSON(ЗаписьJSON, СтруктОтправки,тНастройкиСериализации);
	
	СтрокаДляЗапроса = ЗаписьJSON.Закрыть();
	
	//сообщить(СтрокаДляЗапроса);
	
	Если АдрСрв.НуженSSL Тогда
		Попытка 
			HTTPСоединение = Новый HTTPСоединение(АдрСрв.АдресСервера,АдрСрв.АдресСервераПорт,,,,,АдрСрв.SSL);
		Исключение
			СообщитьПользователюСерв("Ошибка установки связи с сервером!");
			//КодОшибки =2;
			Возврат;

		КонецПопытки;
	Иначе
		HTTPСоединение = Новый HTTPСоединение(АдрСрв.АдресСервера,АдрСрв.АдресСервераПорт);
	КонецЕсли;

	HTTPЗапрос = Новый HTTPЗапрос("/committimeslotlist/"+СокрЛП(Объект.BIRDMD)); 
	HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json");
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаДляЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Попытка
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		//Сообщить("Выбранный дилерский центр пока не подключен к работе с онлайн-записью через DMS. Обратитесь в поддержку DMS.");
		ТекстСообщения = "Ошибка установки связи с сервером!";
		//КодОшибки = 3;
		Возврат;
	КонецПопытки;


	// Сообщить("Код результата: " + Ответ.КодСостояния);
	// Сообщить("Ответ: " + Ответ.ПолучитьТелоКакСтроку("UTF-8"));
	Если Ответ.КодСостояния=200 Тогда
		// Успешно загружено
		Для каждого таймслот из Объект.КалендариСервис Цикл
		    таймслот.ЗагруженНаСервер = Истина;
		КонецЦикла;
		СообщитьПользователюСерв("График успешно загружен на сервер!");
	Иначе 
		СообщитьПользователюСерв("Ошибка загрузки графика на сервер!");

	КонецЕсли;
		
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьсСервераНаСервере(ТекстСообщения="")
	КодОшибки=0;
	ФлагБылаЗагрузкаССервера = Ложь;
	ТекстСообщения="";
	о1 = РеквизитФормыВЗначение("Объект");
	о1.ЗагрузитьсСервераНаСервере(КодОшибки,ТекстСообщения);
	//ЭтаФорма.ОтобразитьИзменениеДанных(Объект.СообщениеОкончаниеПланирования,ВидИзмененияДанных.Изменение);
	//ОбновитьОтображениеДанных();
	ЗначениеВРеквизитФормы(о1,"Объект");
	//НастройкиСоед = ПолучитьСтруктуруНастройкиСоед(о1.НастройкиСоед);
	
	Объект.СообщениеОкончаниеПланирования = ТекстСообщения;
	//ЭтаФорма.Прочитать();
	Если КодОшибки=0 Тогда
			ФлагБылаЗагрузкаССервера = Истина;
			ОбновитьСтатусУспешноЗагруженных();
			о1.ОсвободитьРезервыНаДниМеньшеНачалаЗаписи();
			
			ЭтаФорма.Заголовок = "График тайм слотов. " + ТекстСообщения;
			ИинциализоратьСтрунуцуРезультат();
			Элементы.Страницы.ТекущаяСтраница = Элементы.РезультатЗаполненияСтраница;
			Элементы.Страницы.ПодчиненныеЭлементы.НастройкаЗаполненияСтраница.Видимость = Ложь;
			
	ИначеЕсли КодОшибки=4 или КодОшибки=5  Тогда
			// ТекстСообщения=Объект.СообщениеОкончаниеПланирования;
		    ФлагБылаЗагрузкаССервера = Истина;

			ОбновитьHTML();
	КонецЕсли;

	Если Объект.ШаблонЗаполнения.Количество()>0 Тогда
		Для и1=0 по Объект.ШаблонЗаполнения.Количество()-1 Цикл
			Объект.ШаблонЗаполнения[и1].ПредставлениеРасписания = ПредставлениеРасписанияДня(ЭтаФорма, и1+1);
		КонецЦикла;
	КонецЕсли;
	Объект.ШаблонЗаполнения[0].ПредставлениеДня = НСтр("ru = 'Понедельник'");
	Объект.ШаблонЗаполнения[1].ПредставлениеДня = НСтр("ru = 'Вторник'");
	Объект.ШаблонЗаполнения[2].ПредставлениеДня = НСтр("ru = 'Среда'");
	Объект.ШаблонЗаполнения[3].ПредставлениеДня = НСтр("ru = 'Четверг'");
	Объект.ШаблонЗаполнения[4].ПредставлениеДня = НСтр("ru = 'Пятница'");
	Объект.ШаблонЗаполнения[5].ПредставлениеДня = НСтр("ru = 'Суббота'");
	Объект.ШаблонЗаполнения[6].ПредставлениеДня = НСтр("ru = 'Воскресенье'");


	
	//Возврат;	
	
	//Объект.МинДнейДоНачала = ПолучитьМинСдвигДнейССервера();
	//АдрСрв=ПолучитьКоннекты();
	//HTTPСоединение = Новый HTTPСоединение(АдрСрв.АдресСервера,АдрСрв.АдресСервераПорт);
	//HTTPЗапрос = Новый HTTPЗапрос("/dmsrequesttimeslotslist/"+СокрЛП(Объект.BIRDMD)); 
	//HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json");
	//СтрокаДляЗапроса = "{}";
	//HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаДляЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	//
	//Попытка
	//	Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	//Исключение
	//	СообщитьПользователюСерв("Выбранный дилерский центр пока не подключен к работе с онлайн-записью через DMS. Обратитесь в поддержку DMS.");
	//	Возврат;
	//КонецПопытки;
	//

	////Сообщить("Код результата: " + Ответ.КодСостояния);
	////Сообщить("Ответ: " + Ответ.ПолучитьТелоКакСтроку("UTF-8"));
	//                           
	//
	//Если Ответ.КодСостояния=200 Тогда
	//	// Успешно загружено
	//	МинДата = Дата(2100,1,1,0,0,0);
	//	МаксДата = Дата(1,1,1,0,0,0);
	//	Объект.КалендариСервис.Очистить();
	//	Объект.ЦехаПланирования.Очистить();
	//	чт1 = Новый ЧтениеJSON();
	//	чт1.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку("UTF-8"));
	//	ответ1 = ПрочитатьJSON(чт1);
	//	чт1.Закрыть();
	//	Если ответ1.Slots=Неопределено Тогда
	//		Объект.СообщениеОкончаниеПланирования = "На сервере нет загруженных таймслотов!";
	//		СообщитьПользователюСерв("На сервере нет загруженных таймслотов!");
	//		ОбновитьHTML();
	//		Возврат;
	//	КонецЕсли;
	//	Для и1 = 0 По ответ1.Slots.Количество() - 1 Цикл
	//		// ищем даты
	//		ДатаНач = Дата(ответ1.Slots[и1].tsdateyear,
	//						ответ1.Slots[и1].tsdatemonth,
	//						ответ1.Slots[и1].tsdateday, 
	//						ответ1.Slots[и1].timestarth,0,0);
	//						
	//		ДатаКон = Дата(ответ1.Slots[и1].tsdateyear,
	//						ответ1.Slots[и1].tsdatemonth,
	//						ответ1.Slots[и1].tsdateday, 
	//						ответ1.Slots[и1].timeendh,0,0);							
	//		
	//		Если НачалоДня(ДатаНач)<НачалоДня(ТекущаяДата()) Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		Если НачалоДня(ДатаНач)<МинДата Тогда
	//			МинДата = НачалоДня(ДатаНач);
	//		КонецЕсли;
	//		Если НачалоДня(ДатаНач)>МаксДата Тогда
	//			МаксДата = НачалоДня(ДатаНач);
	//		КонецЕсли;
	//		
	//		//  добавляем цеха, если надо			
	//		Отбор = Новый Структура;
	//		Отбор.Вставить("ЦехГУИД", ответ1.Slots[и1].workpostid);
	//		ЕстьЦеха =  Объект.ЦехаПланирования.НайтиСтроки(Отбор);
	//		Если ЕстьЦеха.Количество()=0 Тогда
	//			НовыйGUID = Новый УникальныйИдентификатор(ответ1.Slots[и1].workpostid);
	//			СсылкаЦех = Справочники[ОпределитьНаименованиеСправочника("Цеха")].ПолучитьСсылку(НовыйGUID);		
	//			ДобЦех =  Объект.ЦехаПланирования.Добавить();
	//			ДобЦех.Цех =  СсылкаЦех;
	//			ДобЦех.ЦехГУИД = ответ1.Slots[и1].workpostid;
	//		КонецЕсли;
	//					
	//		н1 =  Объект.КалендариСервис.Добавить();
	//		н1.ГУИДзаписи =  ответ1.Slots[и1].timeslotid;
	//		н1.ДатаНачала =  ДатаНач;
	//		н1.ДатаОкончания = ДатаКон;
	//		н1.БрониГУИД =  ответ1.Slots[и1].reservationid;
	//		н1.ЦехГУИД =  ответ1.Slots[и1].workpostid;
	//		н1.ДняГуид =  НайтиДняГуид(ДатаНач);
	//		н1.ЗагруженНаСервер =  Истина;
	//		н1.СтатусРезерва =  ответ1.Slots[и1].reservationstatus;
	//		//  формируем шаблон
	//		// только первые 7 дней
	//		Первые7 = 3600*24*7;
	//		если НачалоДня(ДатаНач)-МинДата < Первые7 Тогда
	//			шНомерДня = ДеньНедели(ДатаНач);
	//			шВремяНач =  Дата(1,1,1,ответ1.Slots[и1].timestarth,0,0);
	//			шВремяКон =  Дата(1,1,1,ответ1.Slots[и1].timeendh,0,0);
	//			Отбор = Новый Структура;
	//			Отбор.Вставить("НомерДня", шНомерДня);
	//			Отбор.Вставить("ВремяНачала", шВремяНач);
	//			ЕстьШаблон = Объект.РасписаниеРаботы.НайтиСтроки(Отбор);
	//			Если ЕстьШаблон.количество()=0 Тогда
	//				НоваяСтрока = Объект.РасписаниеРаботы.Добавить();
	//				НоваяСтрока.НомерДня = шНомерДня;
	//				НоваяСтрока.ВремяНачала = шВремяНач;
	//				НоваяСтрока.ВремяОкончания  = шВремяКон;
	//				НоваяСтрока.ГУИД  =  Новый УникальныйИдентификатор();
	//				
	//				СтрокаШаблона = Объект.ШаблонЗаполнения.НайтиПоИдентификатору(шНомерДня-1);
	//				СтрокаШаблона.ДеньВключенВГрафик = Истина; // расписание заполнено
	//				СтрокаШаблона.ПредставлениеРасписания = ПредставлениеРасписанияДня(ЭтаФорма, шНомерДня);
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	Если МинДата <> Дата(2100,1,1,0,0,0) и 	МаксДата <> Дата(1,1,1,0,0,0) Тогда
	//		Объект.ДатаНачалаПланирования = МинДата;
	//		Объект.ДатаОкончанияПланирования = МаксДата;
	//		Объект.СообщениеОкончаниеПланирования = "Слоты загружены по: " + Формат(МаксДата,"ДФ=""дд.ММ.гггг""");
	//		
	//		ЭтаФорма.Заголовок = "График тайм слотов. " + Объект.СообщениеОкончаниеПланирования;
	//		ИинциализоратьСтрунуцуРезультат();
	//		Элементы.Страницы.ТекущаяСтраница = Элементы.РезультатЗаполненияСтраница;
	//		Элементы.Страницы.ПодчиненныеЭлементы.НастройкаЗаполненияСтраница.Видимость = Ложь;
	//	Иначе
	//		Объект.СообщениеОкончаниеПланирования = "Не загружены на сервер!";
	//		ОбновитьHTML();
	//	КонецЕсли;

	//	
	//	
	//Иначе 
	//	Объект.СообщениеОкончаниеПланирования = "Запросите сервер снова!";
	//КонецЕсли;

КонецПроцедуры


&НаСервере
Функция ПолучитьДанныеОЗаписи(гуидслота,гуидзаписи)
	Рез = Новый Структура; // -- 
	Рез.Вставить("ОтветТекст","");
	Рез.Вставить("Статус",0);
	Рез.Вставить("КодСостояния",0);
	Рез.Вставить("ФИО","");
	Рез.Вставить("Машина","");
	Рез.Вставить("VIN","");
	Рез.Вставить("НужноПозвонить",ложь);
	Рез.Вставить("ПолнаяСтрока","");
	Рез.Вставить("гуидслота",гуидслота);
	Рез.Вставить("гуидзаписи",гуидзаписи);
	Рез.Вставить("ДатаНач",Дата(1,1,1,0,0,0));
	Рез.Вставить("ДатаКон",Дата(1,1,1,0,0,0));
    АдрСрв=ПолучитьКоннекты();
	
	Если АдрСрв.НуженSSL Тогда
		Попытка 
			HTTPСоединение = Новый HTTPСоединение(АдрСрв.АдресСервера,АдрСрв.АдресСервераПорт,,,,,АдрСрв.SSL);
		Исключение
			//ТекстСообщения = "Ошибка установки связи с сервером!";
			//КодОшибки =2;
			Возврат Рез;

		КонецПопытки;
	Иначе
		HTTPСоединение = Новый HTTPСоединение(АдрСрв.АдресСервера,АдрСрв.АдресСервераПорт);
	КонецЕсли;

	HTTPЗапрос = Новый HTTPЗапрос("/dmsrequestreservationinfo/"+СокрЛП(Объект.BIRDMD)+"/"
					+СТРОКА(Объект.ДилерскийЦентр.УникальныйИдентификатор())+"/"
					 +гуидслота +"/" + гуидзаписи ); 
	HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json");
	СтрокаДляЗапроса = "{}";
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаДляЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Попытка
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		//ТекстСообщения = "Ошибка установки связи с сервером!";
		//КодОшибки = 3;
		Возврат Рез;
	КонецПопытки;

	
	//Сообщить("Код результата: " + Ответ.КодСостояния);
	//Сообщить("Ответ: " + Ответ.ПолучитьТелоКакСтроку("UTF-8"));
	Рез.КодСостояния = Ответ.КодСостояния;
	Если Ответ.КодСостояния=200 Тогда
		// Успешно загружено
		МинДата = Дата(2100,1,1,0,0,0);
		МаксДата = Дата(1,1,1,0,0,0);
		чт1 = Новый ЧтениеJSON();
		отвстрока = Ответ.ПолучитьТелоКакСтроку("UTF-8"); 
		чт1.УстановитьСтроку(отвстрока);
		ответ1 = ПрочитатьJSON(чт1);
		чт1.Закрыть();
		Рез.ОтветТекст = отвстрока;
		
		Если ответ1.reservationstatus=Неопределено Тогда
			//СообщитьПользователюСерв("На сервере нет загруженных таймслотов!");
			Возврат Рез;
		КонецЕсли;
		Рез.Статус = ответ1.reservationstatus;
		Рез.ФИО = ответ1.lastname+" "+ответ1.firstname+" "+ответ1.middlename;
		Рез.Машина = ответ1.ModelDesc.ModelCode+" "+ответ1.ModelDesc.EngineType+" "+ответ1.VIN;
		Рез.VIN = ответ1.VIN;
		Если СокрЛП(ответ1.contactclient)="yes" Тогда
			Рез.НужноПозвонить = Истина;
		КонецЕсли;
		Рез.ДатаНач = Дата(ответ1.tsdateyear,ответ1.tsdatemonth,ответ1.tsdateday, ответ1.timestarth,0,0);
		Рез.ДатаКон = Дата(ответ1.tsdateyear, ответ1.tsdatemonth, ответ1.tsdateday, ответ1.timeendh,0,0);
		Рез.ПолнаяСтрока = Рез.ПолнаяСтрока + "Запись на : " + Формат(Рез.ДатаНач,"ДФ=""дд.ММ.гггг ЧЧ:мм""") +  Символы.ПС + Символы.ПС;
		Рез.ПолнаяСтрока = Рез.ПолнаяСтрока + Рез.ФИО + Символы.ПС + Символы.ПС;
		Рез.ПолнаяСтрока = Рез.ПолнаяСтрока + "Перезвонить клиенту: " + ?(Рез.НужноПозвонить,"ДА","нет") +  Символы.ПС+ Символы.ПС;
		Рез.ПолнаяСтрока = Рез.ПолнаяСтрока + "Тел: " + ответ1.telephone +  Символы.ПС;
		Рез.ПолнаяСтрока = Рез.ПолнаяСтрока + "Email: " + ответ1.email +  Символы.ПС +  Символы.ПС;
		Рез.ПолнаяСтрока = Рез.ПолнаяСтрока + "Модель: " + ответ1.ModelDesc.ModelCode +  Символы.ПС;
		Рез.ПолнаяСтрока = Рез.ПолнаяСтрока + "Версия: " + ответ1.ModelDesc.VersionCode +  Символы.ПС;
		Рез.ПолнаяСтрока = Рез.ПолнаяСтрока + "Двигатель: " + ответ1.ModelDesc.EngineType+" " + ответ1.ModelDesc.FuelType+  Символы.ПС;
		
		//Рез.ПолнаяСтрока = Рез.ПолнаяСтрока +  ответ1.ModelDesc.ModelCode+" "+ответ1.ModelDesc.VersionCode+" "+ответ1.ModelDesc.EngineType+" " + ответ1.ModelDesc.FuelType + Символы.ПС;
		Рез.ПолнаяСтрока = Рез.ПолнаяСтрока + "VIN: "+ответ1.VIN + Символы.ПС;
		Рез.ПолнаяСтрока = Рез.ПолнаяСтрока + "Пробег: "+ ответ1.odometer + Символы.ПС;
		Рез.ПолнаяСтрока = Рез.ПолнаяСтрока + "Кондиционер: "+?(СокрЛП(ответ1.ModelDesc.AirConditioner)="yes","да","нет") + Символы.ПС;
		Рез.ПолнаяСтрока = Рез.ПолнаяСтрока + "ABS: "+?(СокрЛП(ответ1.ModelDesc.ABS)="yes","да","нет") + Символы.ПС;
		Рез.ПолнаяСтрока = Рез.ПолнаяСтрока + "ГУР: "+?(СокрЛП(ответ1.ModelDesc.PowerSteering)="yes","да","нет") + Символы.ПС;
		Рез.ПолнаяСтрока = Рез.ПолнаяСтрока + "Салонный фильтр: "+?(СокрЛП(ответ1.ModelDesc.CabinFilter)="yes","да","нет") + Символы.ПС +  Символы.ПС;
				
		Если ответ1.ComplexCodeList<>Неопределено и  ответ1.ComplexCodeList.Количество()>0 Тогда
			Рез.ПолнаяСтрока = Рез.ПолнаяСтрока + "Комплекс сервисы:" + Символы.ПС;
  
			Для и1 = 0 По ответ1.ComplexCodeList.Количество() - 1 Цикл
				Рез.ПолнаяСтрока = Рез.ПолнаяСтрока + ответ1.ComplexCodeList[и1] + Символы.ПС;
			КонецЦикла;
		КонецЕсли;
		Рез.ПолнаяСтрока = Рез.ПолнаяСтрока + Символы.ПС + "Комментарии:" + Символы.ПС;
		Рез.ПолнаяСтрока = Рез.ПолнаяСтрока + ответ1.comments + Символы.ПС;
		
	КонецЕсли;
	
	Возврат Рез;
КонецФункции



&НаКлиенте
Процедура ЗагрузитьсСервера(Команда)
	//ЗагрузитьсСервераНаСервере();
	ТекстСообщения="";

	ДилерскийЦентрПриИзмененииНаСервере(ТекстСообщения);
	ЭтаФорма.ОтобразитьИзменениеДанных(Объект.МинДнейДоНачала,ВидИзмененияДанных.Изменение);
	ЭтаФорма.ОтобразитьИзменениеДанных(Объект.СообщениеОкончаниеПланирования,ВидИзмененияДанных.Изменение);

	Если ТекстСообщения<>"" Тогда
		ПоказатьПредупреждение(,ТекстСообщения);
	КонецЕсли;

	
КонецПроцедуры

&НаСервере
Функция НайтиДняГуид(ДатаНач)
	Рез = Новый УникальныйИдентификатор();
	ДтПоиск = НачалоДня(ДатаНач);
	Для каждого стр1 из Объект.КалендариСервис Цикл
		Если НачалоДня(стр1.ДатаНачала)= ДтПоиск и стр1.ДняГуид<>"" Тогда
			Рез = стр1.ДняГуид;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Рез;
КонецФункции


&НаСервере
Функция НайтиПоследнийЗагруженныйДеньЛок()
	//  находит последний день, когда данные были загружены на сервер по локальным данным
	Рез = Дата(1,1,1,0,0,0);

	Для каждого стр1 из Объект.КалендариСервис Цикл
		Если НачалоДня(стр1.ДатаНачала)> Рез и стр1.ЗагруженНаСервер=Истина Тогда
			Рез = НачалоДня(стр1.ДатаНачала);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Рез;
КонецФункции

&НаКлиенте
Процедура КалендарьДняПриАктивизацииСтроки(Элемент)
	Попытка
		ТекОписаниеЗаписи = Элемент.ТекущиеДанные.ИнформацияЗаписи;
	Исключение
		
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура КалендарьДняПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если Элемент.ТекущиеДанные.Флажок=Ложь и Элемент.ТекущиеДанные.ЗагруженНаСервер=Истина Тогда
		//  попытка удалить загруженный на сервер таймслот
		//  !!! проверить статус слота / загружен или нет
		ТекстВопроса = НСтр("ru = 'Данный таймслот загружен на сервер. Вы действительно хотите удалить данный тайм-слот?'");
		пар = Новый Структура("ГУИДзаписи", Элемент.ТекущиеДанные.ГУИДзаписи);
		Попытка
			// ЭтотОбъект
	    	Оповещение = Новый ОписаниеОповещения("ВопросПередУдалениемСлота",  ЭтаФорма , пар);
	    	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		Исключение
			Ответ = Вопрос(ТекстВопроса,РежимДиалогаВопрос.ДаНетОтмена);
			ВопросПередУдалениемСлота(Ответ, пар);
		КонецПопытки;

	КонецЕсли;
КонецПроцедуры


&НаСервере 
Функция УдалитьРезервыСлотаПоГУИД(гуид) Экспорт
	удален = РеквизитФормыВЗначение("Объект").УдалитьСлотПоГУИД(гуид);
	Возврат удален;
КонецФункции

&НаКлиенте
Процедура ВопросПередУдалениемСлота(Результат, пар) Экспорт
	
	
	Отбор = Новый Структура;
	Отбор.Вставить("ГУИДзаписи", пар.ГУИДзаписи);
	ТекСтроки = КалендарьДня.НайтиСтроки(Отбор);
	Если ТекСтроки.Количество()=0 Тогда
		// что-то пошло не так
		Возврат;
	КонецЕсли;
	ТекСтр = ТекСтроки[0];
	
	Если Результат = КодВозвратаДиалога.Да Тогда
    	
		Если  ТекСтр.СтатусРезерва=1 или ТекСтр.СтатусРезерва=3 Тогда
			 ПоказатьПредупреждение(,НСтр("ru = 'Нельзя удалить зарезервированный тайм-слот!'"));
			 ТекСтр.Флажок = Истина;
		Иначе
			//  пытаемся удалить таймслот
			//сообщить("Удалить: " +  пар.ГУИДзаписи);
			СообщениеОбОшибке = "";
			Рез = УдалитьОдинТаймСлот(пар.ГУИДзаписи, СообщениеОбОшибке);
			Если Рез=Истина Тогда
				удален = УдалитьРезервыСлотаПоГУИД(пар.ГУИДзаписи);
				Для каждого стр1 из ТекСтроки Цикл
					КалендарьДня.Удалить(стр1);
				КонецЦикла;
				//ОбновитьHTML();				
			КонецЕсли;
		КонецЕсли;
			
			
	Иначе
		ТекСтр.Флажок = Истина;
	КонецЕсли;
        
КонецПроцедуры


&НаСервере
Функция УдалитьОдинТаймСлот(ГУИДзаписи, СообщениеОбОшибке = "") 
	Рез = Ложь;
	
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	бирдмд = СокрЛП(Объект.BIRDMD);
	дцгуид = СокрЛП(СТРОКА(Объект.ДилерскийЦентр.УникальныйИдентификатор()));
	юзер = "unknownunknown";
	юзергуид = "0000";
	Попытка
		юзер = СокрЛП(Строка(ПараметрыСеанса.Пользователь));
		юзергуид = СокрЛП(Строка(ПараметрыСеанса.Пользователь.УникальныйИдентификатор()));
	Исключение
	КонецПопытки;
		
	АдрСрв = ПолучитьКоннекты();

	СтруктОтправки = Новый Структура;
	СтруктОтправки.Вставить("token",АдрСрв.ЛокальныйТокен);
	СтруктОтправки.Вставить("userguid",юзергуид);
	СтруктОтправки.Вставить("username",юзер);
	
	тНастройкиСериализации = Новый НастройкиСериализацииJSON;
    тНастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	тНастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением;
	
	ЗаписатьJSON(ЗаписьJSON, СтруктОтправки,тНастройкиСериализации);
	
	СтрокаДляЗапроса = ЗаписьJSON.Закрыть();
	
	//сообщить(СтрокаДляЗапроса);
	// "/dmsdeletetimeslot/{birdmd}/{dcgьшырф	uid}/{tsuuid}"
	
	Если АдрСрв.НуженSSL Тогда
		Попытка 
			HTTPСоединение = Новый HTTPСоединение(АдрСрв.АдресСервера,АдрСрв.АдресСервераПорт,,,,,АдрСрв.SSL);
		Исключение
			//ТекстСообщения = "Ошибка установки связи с сервером!";
			//КодОшибки =2;
			Возврат Рез;

		КонецПопытки;
	Иначе
		HTTPСоединение = Новый HTTPСоединение(АдрСрв.АдресСервера,АдрСрв.АдресСервераПорт);
	КонецЕсли;

	HTTPЗапрос = Новый HTTPЗапрос("/dmsdeletetimeslot/"+бирдмд+"/"+дцгуид+"/"+СокрЛП(Строка(ГУИДзаписи))); 
	HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json");
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаДляЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Попытка
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		//Сообщить("Выбранный дилерский центр пока не подключен к работе с онлайн-записью через DMS. Обратитесь в поддержку DMS.");
		//ТекстСообщения = "Ошибка установки связи с сервером!";
		//КодОшибки = 3;
		Возврат Рез;
	КонецПопытки;

	// Сообщить("Код результата: " + Ответ.КодСостояния);
	// Сообщить("Ответ: " + Ответ.ПолучитьТелоКакСтроку("UTF-8"));
	Если Ответ.КодСостояния=200 Тогда
		// Успешно загружено
		// СообщитьПользователюСерв("Статус 200!");
		Рез = Истина;
		// удаляем таймслот на сервере
		УдалитьТаймСлотПоГУИД(ГУИДзаписи);
		
		
		
		// -------------------------------
		// чт1 = Новый ЧтениеJSON();
		// чт1.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку("UTF-8"));
		// ответ1 = ПрочитатьJSON(чт1);
		// чт1.Закрыть();
		// ТаймСлотУдален = Ложь;
		// Если ответ1.Status<>Неопределено Тогда
// 			Если ответ1.Status="Success" Тогда
// 				ТаймСлотУдален = Истина;
	// 			Рез = Истина;
		// 	ИначеЕсли ответ1.Status="NoRecord" Тогда
		// 		//  перезагрузить данные о слотах заново
		// 	ИначеЕсли ответ1.Status="Failed" Тогда
		// 		// ???
		// 	КонецЕсли;
		// КонецЕсли;
		
		


	КонецЕсли;

	
	
	Возврат Рез;
	
КонецФункции



&НаКлиенте
Процедура КалендарьДняПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СледДень(Команда)
	// Вставить содержимое обработчика.
	КалендарьДня.Очистить();
	
	ПараметрыСоб = Новый Массив;

	д1 = НачалоДня(ТекДняНачало+24*3600);
	ПараметрыСоб.Добавить(д1);
	ПараметрыСоб.Добавить(д1);
	ПараметрыСоб.Добавить(Истина);

	СформироватьПредставлениеДня(ПараметрыСоб);

	Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаКалендарьДня;
КонецПроцедуры

&НаКлиенте
Процедура ПредДень(Команда)
	// Вставить содержимое обработчика.
	КалендарьДня.Очистить();
	
	ПараметрыСоб = Новый Массив;

	д1 = НачалоДня(ТекДняНачало-24*3600);
	ПараметрыСоб.Добавить(д1);
	ПараметрыСоб.Добавить(д1);
	ПараметрыСоб.Добавить(Истина);

	СформироватьПредставлениеДня(ПараметрыСоб);

	Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаКалендарьДня;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьМинДеньНаСервере(Команда)
	// обновить данные о дне на сервере
	Если УстановитьМинСдвигДнейССервера() Тогда
		УстановитьЗначениеПолучитьМинСдвигДнейССервера();
		СообщитьПользователю("Минимальное количество дней от сегодняшнего дня, через которое можно записаться на сервис успешно загружено!");	
	Иначе
		СообщитьПользователю("Не удалось загрузить количество дней, через которое можно записаться на сервис, попробуйте позже!");
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция УстановитьМинСдвигДнейССервера()
	Рез = Ложь;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	бирдмд = СокрЛП(Объект.BIRDMD);
	дцгуид = СокрЛП(СТРОКА(Объект.ДилерскийЦентр.УникальныйИдентификатор()));
	юзер = "unknownunknown";
	юзергуид = "0000";
	Попытка
		юзер = СокрЛП(Строка(ПараметрыСеанса.Пользователь));
		юзергуид = СокрЛП(Строка(ПараметрыСеанса.Пользователь.УникальныйИдентификатор()));
	Исключение
	КонецПопытки;
		
	
	СтруктОтправки = Новый Структура;
	//СтруктОтправки.Вставить("token","tst-tst-tst");
	//СтруктОтправки.Вставить("userguid",юзергуид);
	//СтруктОтправки.Вставить("username",юзер);
	СтруктОтправки.Вставить("newoffset", Объект.МинДнейДоНачала);
	
	
	тНастройкиСериализации = Новый НастройкиСериализацииJSON;
    тНастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	тНастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением;
	
	ЗаписатьJSON(ЗаписьJSON, СтруктОтправки,тНастройкиСериализации);
	
	СтрокаДляЗапроса = ЗаписьJSON.Закрыть();
	
	//сообщить(СтрокаДляЗапроса);
	// "/dmsdeletetimeslot/{birdmd}/{dcguid}/{tsuuid}"
	АдрСрв=ПолучитьКоннекты();
	Если АдрСрв.НуженSSL Тогда
		Попытка 
			HTTPСоединение = Новый HTTPСоединение(АдрСрв.АдресСервера,АдрСрв.АдресСервераПорт,,,,,АдрСрв.SSL);
		Исключение
			//ТекстСообщения = "Ошибка установки связи с сервером!";
			//КодОшибки =2;
			Возврат Рез;

		КонецПопытки;
	Иначе
		HTTPСоединение = Новый HTTPСоединение(АдрСрв.АдресСервера,АдрСрв.АдресСервераПорт);
	КонецЕсли;

	HTTPЗапрос = Новый HTTPЗапрос("/dmssetdaysoffset/"+бирдмд+"/"+дцгуид); 
	HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json");
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаДляЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Попытка
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		//Сообщить("Выбранный дилерский центр пока не подключен к работе с онлайн-записью через DMS. Обратитесь в поддержку DMS.");
		//ТекстСообщения = "Ошибка установки связи с сервером!";
		//КодОшибки = 3;
		Возврат Рез;
	КонецПопытки;

	// Сообщить("Код результата: " + Ответ.КодСостояния);
	// Сообщить("Ответ: " + Ответ.ПолучитьТелоКакСтроку("UTF-8"));
	Если Ответ.КодСостояния=200 Тогда
		
		Рез = Истина; 
		//чт1 = Новый ЧтениеJSON();
		//чт1.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку("UTF-8"));
		//ответ1 = ПрочитатьJSON(чт1);
		//чт1.Закрыть();
		//Если ответ1.daysoffset<>Неопределено Тогда
		//	
			
		//КонецЕсли;
	
	КонецЕсли;	
	
	
	Возврат Рез;
КонецФункции


&НаСервере 
Процедура УстановитьЗначениеПолучитьМинСдвигДнейССервера()
	Объект.МинДнейДоНачала = ПолучитьМинСдвигДнейССервера();
	
КонеЦПроцедуры


&НаСервере
Функция ПолучитьМинСдвигДнейССервера()
	Рез = 2;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	бирдмд = СокрЛП(Объект.BIRDMD);
	дцгуид = СокрЛП(СТРОКА(Объект.ДилерскийЦентр.УникальныйИдентификатор()));
	юзер = "unknownunknown";
	юзергуид = "0000";
	Попытка
		юзер = СокрЛП(Строка(ПараметрыСеанса.Пользователь));
		юзергуид = СокрЛП(Строка(ПараметрыСеанса.Пользователь.УникальныйИдентификатор()));
	Исключение
	КонецПопытки;
		
	АдрСрв=ПолучитьКоннекты();	
	СтруктОтправки = Новый Структура;
	СтруктОтправки.Вставить("token",АдрСрв.ЛокальныйТокен);
	СтруктОтправки.Вставить("userguid",юзергуид);
	СтруктОтправки.Вставить("username",юзер);
	
	тНастройкиСериализации = Новый НастройкиСериализацииJSON;
    тНастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	тНастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением;
	
	ЗаписатьJSON(ЗаписьJSON, СтруктОтправки,тНастройкиСериализации);
	
	СтрокаДляЗапроса = ЗаписьJSON.Закрыть();
	
	//сообщить(СтрокаДляЗапроса);
	// "/dmsdeletetimeslot/{birdmd}/{dcguid}/{tsuuid}"
	
	Если АдрСрв.НуженSSL Тогда
		Попытка 
			HTTPСоединение = Новый HTTPСоединение(АдрСрв.АдресСервера,АдрСрв.АдресСервераПорт,,,,,АдрСрв.SSL);
		Исключение
			СообщитьПользователюСерв("Ошибка установки связи с сервером!");
			
			Возврат Рез;

		КонецПопытки;
	Иначе
		HTTPСоединение = Новый HTTPСоединение(АдрСрв.АдресСервера,АдрСрв.АдресСервераПорт);
	КонецЕсли;

	HTTPЗапрос = Новый HTTPЗапрос("/dmsgetdaysoffset/"+бирдмд+"/"+дцгуид); 
	HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json");
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаДляЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Попытка
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		СообщитьПользователюСерв("Ошибка связи с сервером или выбранный дилерский центр пока не подключен к работе с онлайн-записью через DMS. Обратитесь в поддержку DMS.");
		Возврат Рез;
	КонецПопытки;
	
	// Сообщить("Код результата: " + Ответ.КодСостояния);
	// Сообщить("Ответ: " + Ответ.ПолучитьТелоКакСтроку("UTF-8"));
	Если Ответ.КодСостояния=200 Тогда
		чт1 = Новый ЧтениеJSON();
		чт1.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку("UTF-8"));
		ответ1 = ПрочитатьJSON(чт1);
		чт1.Закрыть();
		Если ответ1.daysoffset<>Неопределено Тогда
			Рез = ответ1.daysoffset; 
			
		КонецЕсли;
	Иначе
		СообщитьПользователюСерв("Ошибка связи с сервером или выбранный дилерский центр пока не подключен к работе с онлайн-записью через DMS. Обратитесь в поддержку DMS.");
		Возврат Рез;
	КонецЕсли;	
	
	
	Возврат Рез;
КонецФункции

&НаКлиенте
Процедура ПерейтиНаГрафикТаймСлотов(Команда)
	//ЭтаФорма.Заголовок = "График тайм слотов. " + Объект.СообщениеОкончаниеПланирования;
	
	//ЗаполнитьПоШаблонуНаСервере();
	//ИинциализоратьСтрунуцуРезультат();
	//Элементы.Страницы.ПодчиненныеЭлементы.НастройкаЗаполненияСтраница.Видимость = Ложь;
	//Элементы.Страницы.ТекущаяСтраница = Элементы.РезультатЗаполненияСтраница;
	
	ПоказатьЗакладкуГруппаКалендарьДня();
	ПоказатьЗакладкуРезультатЗаполненияСтраница();
	
КонецПроцедуры


&НаСервере 
Функция ОпределитьНаименованиеСсылки(ИмяВидаОбъекта)
	Рез = Неопределено;	
	Если ИмяВидаОбъекта="ДилерскиеЦентры" Тогда
		Если Метаданные.НайтиПоПолномуИмени("Справочник.ДилерскиеЦентры")<>Неопределено Тогда
			рез = "СправочникСсылка.ДилерскиеЦентры";
		ИначеЕсли Метаданные.НайтиПоПолномуИмени("Справочник.CRM_ДилерскиеЦентры")<>Неопределено Тогда
		    рез = "СправочникСсылка.CRM_ДилерскиеЦентры";
		КонецЕсли;
	
	ИначеЕсли ИмяВидаОбъекта="Цеха" Тогда	
	     Если Метаданные.НайтиПоПолномуИмени("Справочник.ЦехаСервиса")<>Неопределено Тогда
			рез = "СправочникСсылка.ЦехаСервиса";
		ИначеЕсли Метаданные.НайтиПоПолномуИмени("Справочник.Цеха")<>Неопределено Тогда
		    рез = "СправочникСсылка.Цеха";
		КонецЕсли;

	КонецЕсли;

	
	Возврат Рез;
КонецФункции

&НаСервере  
//  ОпределитьНаименованиеСправочника("Цеха")
Функция ОпределитьНаименованиеСправочника(ИмяВидаОбъекта)
	Рез = ОпределитьНаименованиеСсылки(ИмяВидаОбъекта);	
	
	Если Рез<>Неопределено Тогда
		Рез = СтрЗаменить(Рез,"СправочникСсылка.","");
	КонецЕсли;

	
	Возврат Рез;
КонецФункции


&НаСервере 
Процедура ПереопределитьСвязиЦех()
	//Если ОпределитьНаименованиеСсылки("Цеха")="СправочникСсылка.ЦехаСервиса" Тогда	
	//	НовыйМассив = Новый Массив();
	//	НовыйМассив.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.ДилерскийЦентр"));
	//	НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
	//	Элементы.ЦехаПланирования.ПодчиненныеЭлементы.ЦехаПланированияЦех.СвязиПараметровВыбора = НовыеСвязи;
	//КонецЕсли;
КонецПроцедуры

&НаСервере 
Функция ПолучитьBIRПользователя()
	Рез = "";
	
	и1 = РегистрыСведений.НастройкиПользователей.ПолучитьЗначениеНастройки("BIR");
	если и1<>ложь Тогда
		Рез = и1;
	конецесли;
	
	Возврат Рез;
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	 // --порт
	 // ОписаниеТипов = Новый ОписаниеТипов(ОпределитьНаименованиеСсылки("ДилерскиеЦентры"));
	 // ЭтаФорма.Элементы.ДилерскийЦентр.ОграничениеТипа = ОписаниеТипов;
	 // ЭтаФорма.Элементы.ЦехаПланирования.ПодчиненныеЭлементы.ЦехаПланированияЦех.ОграничениеТипа = Новый ОписаниеТипов(ОпределитьНаименованиеСсылки("Цеха"));
	 // ПереопределитьСвязиЦех();
	
	//МассивПараметров = Новый Массив;
	//МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Бренд", Справочники.CRM_МаркаАвтомобиля.RENAULT));	
	//НовыеПараметрыВыбора =  Новый ФиксированныйМассив(МассивПараметров);
	//
	//ЭтаФорма.Элементы.ДилерскийЦентр.ПараметрыВыбора = НовыеПараметрыВыбора;
	Если Не Renault_РаботаСПравамиПользователя.ЕстьПравоОткрытияПодсистемыАвтосервиса(ПараметрыСеанса.Пользователь) тогда
		Сообщить("Недостаточно прав доступа.");
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаДень(Команда)
	//Элементы.Страницы.ПодчиненныеЭлементы.РезультатЗаполненияСтраница.Видимость = Ложь;
	//Элементы.Страницы.ПодчиненныеЭлементы.ГруппаКалендарьДня.Видимость = Истина;
	//Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаКалендарьДня;
	ПоказатьЗакладкуГруппаКалендарьДня();

КонецПроцедуры



&НаСервере
Процедура ПоказатьЗакладкуГруппаКалендарьДня()
	Элементы.Страницы.ПодчиненныеЭлементы.НастройкаЗаполненияСтраница.Видимость = Ложь;
	Элементы.Страницы.ПодчиненныеЭлементы.РезультатЗаполненияСтраница.Видимость = Ложь;
	Элементы.Страницы.ПодчиненныеЭлементы.ГруппаКалендарьДня.Видимость = Истина;
	Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаКалендарьДня;
КонецПроцедуры


&НаСервере
Процедура ПоказатьЗакладкуРезультатЗаполненияСтраница()
	Элементы.Страницы.ПодчиненныеЭлементы.НастройкаЗаполненияСтраница.Видимость = Ложь;
	Элементы.Страницы.ПодчиненныеЭлементы.ГруппаКалендарьДня.Видимость = Ложь;
	Элементы.Страницы.ПодчиненныеЭлементы.РезультатЗаполненияСтраница.Видимость = Истина;
	Элементы.Страницы.ТекущаяСтраница = Элементы.РезультатЗаполненияСтраница;
	ЭтаФорма.Заголовок = "График тайм слотов. " + Объект.СообщениеОкончаниеПланирования;

КонецПроцедуры

&НаКлиенте
Процедура ДилерскийЦентрОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДилерскийЦентрНачалоВыбораНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_ДилерскиеЦентры.Ссылка //,
	               |	//CRM_ДилерскиеЦентры.Наименование
	               |ИЗ
	               |	Справочник.CRM_ДилерскиеЦентры КАК CRM_ДилерскиеЦентры
	               |ГДЕ
	               |	CRM_ДилерскиеЦентры.Бренд = &Бренд";
		
	Запрос.УстановитьПараметр("Бренд", Справочники.CRM_МаркаАвтомобиля.RENAULT);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	
	Список = Новый СписокЗначений;	
	Список.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка"));
	Возврат Список;
КонецФункции

&НаКлиенте
Процедура ДилерскийЦентрНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    ДанныеВыбора = ДилерскийЦентрНачалоВыбораНаСервере();
   
КонецПроцедуры

&НаСервере
Функция ЦехаПланированияЦехНачалоВыбораНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_ДилерскиеЦентрыАвтосервисЦеха.Цех 
	               |ИЗ
	               |	Справочник.CRM_ДилерскиеЦентры.АвтосервисЦеха КАК CRM_ДилерскиеЦентрыАвтосервисЦеха
	               |ГДЕ
	               |	CRM_ДилерскиеЦентрыАвтосервисЦеха.Ссылка = &Ссылка";
	
	Если ЗначениеЗаполнено(Объект.ДилерскийЦентр) Тогда
		дц1 = Объект.ДилерскийЦентр;
	Иначе 
		дц1 = справочники.CRM_ДилерскиеЦентры.ПустаяСсылка();
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", дц1 );
		
	РезультатЗапроса = Запрос.Выполнить();
	
	
	Список = Новый СписокЗначений;	
	Список.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Цех"));
	Возврат Список;

КонецФункции

&НаКлиенте
Процедура ЦехаПланированияЦехНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
    ДанныеВыбора = ЦехаПланированияЦехНачалоВыбораНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Ответ = Вопрос("Вы уверены, что хотите закрыть окно?",РежимДиалогаВопрос.ДаНет,10,КодВозвратаДиалога.Нет);
	Если Ответ = КодВозвратаДиалога.Нет или Ответ=КодВозвратаДиалога.Таймаут Тогда
		Отказ = Истина;
    	Возврат;
	КонецЕсли;

КонецПроцедуры



	