
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПрочитатьДанные()
	Иначе
		ЗаполнитьЗначенияСвойств(Объект, Параметры);
		Объект.Наименование = Объект.Фамилия + " " + Объект.Имя + " " + Объект.Отчество;
		Если Параметры.Свойство("ЭлектронныйАдрес") Тогда
			ЭлектронныйАдрес = Параметры.ЭлектронныйАдрес;
		КонецЕсли;
		Если Параметры.Свойство("Телефон") Тогда
			МобильныйТелефон = Параметры.Телефон;
		КонецЕсли;
		Если Параметры.Свойство("Город") Тогда
			Город = Параметры.Город;
		КонецЕсли;
		Если Параметры.Свойство("Адрес") Тогда
			Адрес = Параметры.Адрес;
		КонецЕсли;
		Если Параметры.Свойство("ПаспортСерия") Тогда
			ПаспортСерия = Параметры.ПаспортСерия;
		КонецЕсли;
		Если Параметры.Свойство("ПаспортНомер") Тогда
			ПаспортНомер = Параметры.ПаспортНомер;
		КонецЕсли;
		Если Параметры.Свойство("ВУСерия") Тогда
			ВУСерия = Параметры.ВУСерия;
		КонецЕсли;
		Если Параметры.Свойство("ВУНомер") Тогда
			ВУНомер = Параметры.ВУНомер;
		КонецЕсли;
	КонецЕсли;
		
	СогласиеНаОПД();	
	
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьПечатиОПД();
КонецПроцедуры

Функция СогласиеНаОПД() ДокументСогласиеНаОбработкуПерсональныхДанных=Документы.DMS_СогласиеНаОбработкуПерсональныхДанных.СогласиеНаОбработку(Объект.Ссылка); Возврат ДокументСогласиеНаОбработкуПерсональныхДанных КонецФункции	

&НаСервере
Процедура ПрочитатьДанные()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Поле4,
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Ссылка
	|	И КонтактнаяИнформация.Вид = &Вид";
	
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонСотовый);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		МобильныйТелефон = Выборка.Представление;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонДомашний);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДомашнийТелефон = Выборка.Представление;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЭлектронныйАдрес = Выборка.Представление;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.АдресФактический);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Город = Выборка.Поле4;
		Адрес = Выборка.Представление;
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПодтверждающиеДокументы.Серия,
	|	ПодтверждающиеДокументы.Номер,
	|	ПодтверждающиеДокументы.ДатаВыдачи,
	|	ПодтверждающиеДокументы.КемВыдан
	|ИЗ
	|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|ГДЕ
	|	ПодтверждающиеДокументы.Владелец = &Ссылка
	|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = &Вид";
	
	Запрос.УстановитьПараметр("Вид", Перечисления.ВидыДокументов.Паспорт);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПаспортСерия = Выборка.Серия;
		ПаспортНомер = Выборка.Номер;
		ПаспортДатаВыдачи = Выборка.ДатаВыдачи;
		ПаспортКемВыдан = Выборка.КемВыдан;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Вид", Перечисления.ВидыДокументов.Удостоверение);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВУСерия = Выборка.Серия;
		ВУНомер = Выборка.Номер;
		ВУДатаВыдачи = Выборка.ДатаВыдачи;
		ВУКемВыдано = Выборка.КемВыдан;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьДанные();
	Если ТекущийОбъект.СогласиеНаОбработкуПерсональныхДанных=Перечисления.ВариантыОтветов.Да И СогласиеНаОПД().Пустая() Тогда
		//Отказ=Истина;
		Сообщить("Не оформлен документ согласия на обработку персональных данных. Ввести на основании");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанные()
	
	Менеджер = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	Менеджер.Объект = Объект.Ссылка;
	Менеджер.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	Менеджер.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый;
	Если ЗначениеЗаполнено(МобильныйТелефон) Тогда
		Менеджер.Представление = МобильныйТелефон;
		Менеджер.Записать(Истина);
	Иначе
		Менеджер.Удалить();
	КонецЕсли;
	
	Менеджер = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	Менеджер.Объект = Объект.Ссылка;
	Менеджер.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	Менеджер.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонДомашний;
	Если ЗначениеЗаполнено(ДомашнийТелефон) Тогда
		Менеджер.Представление = ДомашнийТелефон;
		Менеджер.Записать(Истина);
	Иначе
		Менеджер.Удалить();
	КонецЕсли;
	
	Менеджер = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	Менеджер.Объект = Объект.Ссылка;
	Менеджер.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	Менеджер.Вид = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний;
	Если ЗначениеЗаполнено(ЭлектронныйАдрес) Тогда
		Менеджер.Представление = ЭлектронныйАдрес;
		Менеджер.Записать(Истина);
	Иначе
		Менеджер.Удалить();
	КонецЕсли;
	
	Менеджер = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	Менеджер.Объект = Объект.Ссылка;
	Менеджер.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	Менеджер.Вид = Справочники.ВидыКонтактнойИнформации.АдресФактический;
	Если ЗначениеЗаполнено(Адрес) ИЛИ ЗначениеЗаполнено(Город) Тогда
		Менеджер.Представление = ?(ЗначениеЗаполнено(Адрес), Адрес, Город);
		Менеджер.Поле4 = Город;
		Менеджер.Записать(Истина);
	Иначе
		Менеджер.Удалить();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПодтверждающиеДокументы.Ссылка
	|ИЗ
	|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|ГДЕ
	|	ПодтверждающиеДокументы.Владелец = &Ссылка
	|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = &Вид";
	
	Запрос.УстановитьПараметр("Вид", Перечисления.ВидыДокументов.Паспорт);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Об = Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		Об = Справочники.ПодтверждающиеДокументы.СоздатьЭлемент();
	КонецЕсли;
	Если ЗначениеЗаполнено(ПаспортСерия) 
			ИЛИ ЗначениеЗаполнено(ПаспортНомер) 
			ИЛИ ЗначениеЗаполнено(ПаспортДатаВыдачи) 
			ИЛИ ЗначениеЗаполнено(ПаспортКемВыдан) Тогда
		Об.Наименование = "Паспорт";
		Об.Владелец = Объект.Ссылка;
		Об.Серия = ПаспортСерия;
		Об.Номер = ПаспортНомер;
		Об.ДатаВыдачи = ПаспортДатаВыдачи;
		Об.КемВыдан = ПаспортКемВыдан;
		Об.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.Паспорт;
		Об.Записать();
	ИначеЕсли НЕ Об.ЭтоНовый() Тогда
		Об.Удалить();
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Вид", Перечисления.ВидыДокументов.Удостоверение);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Об = Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		Об = Справочники.ПодтверждающиеДокументы.СоздатьЭлемент();
	КонецЕсли;
	Если ЗначениеЗаполнено(ВУСерия) 
			ИЛИ ЗначениеЗаполнено(ВУНомер) 
			ИЛИ ЗначениеЗаполнено(ВУДатаВыдачи) 
			ИЛИ ЗначениеЗаполнено(ВУКемВыдано) Тогда
		Об.Наименование = "Водительское удостоверение";
		Об.Владелец = Объект.Ссылка;
		Об.Серия = ВУСерия;
		Об.Номер = ВУНомер;
		Об.ДатаВыдачи = ВУДатаВыдачи;
		Об.КемВыдан = ВУКемВыдано;
		Об.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.Удостоверение;
		Об.Записать();
	ИначеЕсли НЕ Об.ЭтоНовый() Тогда
		Об.Удалить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	СформироватьФИОНаКлиенте();	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	СформироватьФИОНаКлиенте();	
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	СформироватьФИОНаКлиенте();	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьФИОНаКлиенте()  
	
	Объект.Наименование = СокрЛП(Объект.Фамилия) + ?(ПустаяСтрока(СокрЛП(Объект.Имя)),""," " + СокрЛП(Объект.Имя)) + ?(ПустаяСтрока(СокрЛП(Объект.Отчество)),""," " + СокрЛП(Объект.Отчество));
	
	Если ПустаяСтрока(Объект.НаименованиеПолное) Тогда
		Объект.НаименованиеПолное = СокрЛП(Объект.Наименование);
	КонецЕсли; 
	
КонецПроцедуры // СформироватьФИОНаКлиенте()

&НаСервере
Процедура ПечатьНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)

	Если ЭтаФорма.Модифицированность Тогда 
		Сообщить("Перед печатью документа, необходимо записать документ");
		Возврат;
	КонецЕсли;
	
	Если Объект.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да Тогда 
		СтруктураПараметров = СофрмироватьПараметрыДляПФ("ПерсональныеДанные",Истина);
		МассивФайлов = DMS_ОбщегоНазначенияСервер.ПолучитьДанныеОПД(СтруктураПараметров,Объект.Ссылка);
		Если МассивФайлов = Неопределено Тогда 
			ПоказатьПредупреждение(,"Не удалось получить печатную форму обработки персональных данных");
			Возврат;
		КонецЕсли;
		
		Для каждого Файл Из МассивФайлов Цикл
			НачатьПолучениеФайлаССервера(ПоместитьВоВременноеХранилище(Base64Значение(Файл["ДанныеФайла"])), Файл["ИмяФайла"], Новый ПараметрыДиалогаПолученияФайлов());
		КонецЦикла;
	КонецЕсли;
	
	Если Объект.СогласенНаКоммуникацию Тогда 
		СтруктураПараметров = СофрмироватьПараметрыДляПФ("Коммуникация",Истина);
		МассивФайлов = DMS_ОбщегоНазначенияСервер.ПолучитьДанныеОПД(СтруктураПараметров,Объект.Ссылка);
		Если МассивФайлов = Неопределено Тогда 
			ПоказатьПредупреждение(,"Не удалось получить печатную форму обработки персональных данных");
			Возврат;
		КонецЕсли;
		
		Для каждого Файл Из МассивФайлов Цикл
			НачатьПолучениеФайлаССервера(ПоместитьВоВременноеХранилище(Base64Значение(Файл["ДанныеФайла"])), Файл["ИмяФайла"], Новый ПараметрыДиалогаПолученияФайлов());
		КонецЦикла;
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Функция СофрмироватьПараметрыДляПФ(ВидСогласия,Согласие)
	
	СтруктураОбъекта = Новый Структура;
	СтруктураКлиента = Новый Структура;
	СтруктураДокумента = Новый Структура;
	СтруктураАвтомобиля = Новый Структура;
	СтруктураСогласия = Новый Структура;
	СтруктураОтвветсвенный = Новый Структура;
	
	СтруктураДокумента.Вставить("passportnumber",ПаспортНомер);
	СтруктураДокумента.Вставить("passportseries",ПаспортСерия);
	СтруктураДокумента.Вставить("passportissued",ПаспортКемВыдан); 
	СтруктураДокумента.Вставить("passportday",Формат(ПаспортДатаВыдачи,"ДФ=dd"));
	СтруктураДокумента.Вставить("passportmonth",Формат(ПаспортДатаВыдачи,"ДФ=MM"));
	СтруктураДокумента.Вставить("passportyear",Формат(ПаспортДатаВыдачи,"ДФ=yyyy"));

	СтруктураКлиента.Вставить("lastname",Объект.Фамилия);
	СтруктураКлиента.Вставить("firstname",Объект.Имя);
	СтруктураКлиента.Вставить("middlename",Объект.Отчество);
	СтруктураКлиента.Вставить("birthday",Объект.ДатаРождения);
	СтруктураКлиента.Вставить("gender",?(Объект.Пол=Перечисления.ПолФизическихЛиц.НеУказан,"",""+Объект.Пол));
	СтруктураКлиента.Вставить("address",Адрес);
	СтруктураКлиента.Вставить("tel",МобильныйТелефон);
	СтруктураКлиента.Вставить("email",ЭлектронныйАдрес);
	СтруктураКлиента.Вставить("company",?(Объект.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо,Истина,Ложь));
	СтруктураКлиента.Вставить("document",СтруктураДокумента);
	СтруктураОбъекта.Вставить("client",СтруктураКлиента);
	
	СтруктураАвтомобиля.Вставить("mark","");
	СтруктураАвтомобиля.Вставить("vin","");
	СтруктураАвтомобиля.Вставить("daybuycar",Дата("00010101"));
	СтруктураОбъекта.Вставить("auto",СтруктураАвтомобиля);
	
	СтруктураСогласия.Вставить("form",ВидСогласия);
	СтруктураСогласия.Вставить("agree",Согласие);
	СтруктураОбъекта.Вставить("consent",СтруктураСогласия);
	
	СтруктураОтвветсвенный.Вставить("name",""+ПараметрыСеанса.Пользователь.Сотрудник);
	СтруктураОтвветсвенный.Вставить("from","Форма потенциального контрагента");
	СтруктураОбъекта.Вставить("responsible",СтруктураОтвветсвенный);
	
	Возврат СтруктураОбъекта;
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьВФайл(Файл)
	
	выборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	выборФайла.ПолноеИмяФайла = Файл["ИмяФайла"];
	Если выборФайла.Выбрать() Тогда
		//ИмяФайла = Файл["ИмяФайла"];
		ДанныеФайла = Base64Значение(Файл["ДанныеФайла"]);	
		ДанныеФайла.записать(выборФайла.ПолноеИмяФайла);
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СогласиеНаОбработкуПерсональныхДанныхПриИзменении(Элемент)
	УстановитьДоступностьПечатиОПД();
	Если Объект.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да Тогда
		Возврат;
	КонецЕсли;
	
	Ответ = Вопрос("Согласие на обработку персональных данных будет отозвано. Продолжить?",РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Нет);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		СтруктураПараметров = СофрмироватьПараметрыДляПФ("ПерсональныеДанные",Ложь);
		ОтветСервера = DMS_ОбщегоНазначенияСервер.ПолучитьДанныеОПД(СтруктураПараметров,Объект.Ссылка);
		
		Если ОтветСервера = Неопределено Тогда 
			ПоказатьПредупреждение(,"Не удалось отозвать согласие.");
			Объект.СогласиеНаОбработкуПерсональныхДанных = СогласиеСохранение;
		Иначе 	
			ПоказатьПредупреждение(,ОтветСервера["answer"]);
		КонецЕсли;
	Иначе 
		Объект.СогласиеНаОбработкуПерсональныхДанных = СогласиеСохранение;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СогласенНаКоммуникациюПриИзменении(Элемент)
	УстановитьДоступностьПечатиОПД();
	
	Если Объект.СогласенНаКоммуникацию Тогда
		Возврат;
	КонецЕсли;
	
	Ответ = Вопрос("Согласие на коммуникацию будет отозвано. Продолжить?",РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Нет);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		СтруктураПараметров = СофрмироватьПараметрыДляПФ("Коммуникация",Ложь);
		ОтветСервера = DMS_ОбщегоНазначенияСервер.ПолучитьДанныеОПД(СтруктураПараметров,Объект.Ссылка);
		Если ОтветСервера = Неопределено Тогда 
			ПоказатьПредупреждение(,"Не удалось отозвать согласие.");
			Объект.СогласенНаКоммуникацию = Истина;
		Иначе 	
			ПоказатьПредупреждение(,ОтветСервера["answer"]);
		КонецЕсли;
		
	Иначе 
		Объект.СогласенНаКоммуникацию = Истина;
	КонецЕсли;
	

	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПечатиОПД()
	
	Если Объект.СогласиеНаОбработкуПерсональныхДанных <> Перечисления.ВариантыОтветов.Да И Не Объект.СогласенНаКоммуникацию Тогда 
		Элементы.Печать.Доступность = Ложь;
	Иначе 
		Элементы.Печать.Доступность = Истина;
	КонецЕсли;

	
КонецПроцедуры


&НаКлиенте
Процедура СогласиеНаОбработкуПерсональныхДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СогласиеСохранение = Объект.СогласиеНаОбработкуПерсональныхДанных;
КонецПроцедуры

