
//Козлов Е.А. Начало 06.02.2017
//Процедура DMS_ПоступлениеАвтомобилейПередЗаписьюПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
Процедура DMS_ПоступлениеАвтомобилейПриЗаписи(Источник, Отказ) Экспорт
//Козлов Е.А. Конец	
	Если Источник.ОбменДанными.Загрузка = Истина тогда 
		Возврат;
	КонецЕсли;

	#Если Клиент тогда
		Менеджер = РегистрыСведений.Renault_РеквизитыСкладовКомпании.СоздатьМенеджерЗаписи();
		Менеджер.СкладКомпании = Источник.СкладКомпании;
		Менеджер.Прочитать();
		Если Менеджер.СкладПодержанныхАвто = Ложь Тогда
			Отбор = Новый Структура("АвтомобильБУ",Истина);
			НайденныеСтроки = Источник.Автомобили.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда
				Сообщить("Поступление подержанного автомобиля должно выполняться только на склад подержанных автомобилей.");
				Отказ = Истина;
			КонецЕсли;
		Иначе
			ПланОбмена = ПолучитьПланОбмена();
			ПланыОбмена.ЗарегистрироватьИзменения(ПланОбмена, Источник);
		КонецЕсли;
	#КонецЕсли
	
	РежимДопОпераций = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ВключитьРежимДопОперацийДляПоступленияАвтомобилей;
	Если РежимДопОпераций Тогда
		Для Каждого СтрокаАвтомобиля из Источник.Автомобили Цикл
			Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(СтрокаАвтомобиля.Автомобиль, Источник.DMS_ВидАвтомобиля, Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля, Источник.Дата);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПланОбмена()
		
	Выборка = ПланыОбмена.Renault_CRM.Выбрать();
	ЭтаБаза = ПланыОбмена.Renault_CRM.ЭтотУзел();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка <> ЭтаБаза Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция ОформитьПокупкуАвтомобиля(Заявка, Ошибки = "") Экспорт
	
	Объект = Заявка;
	
	Если Не ЗначениеЗаполнено(Объект.Автомобиль.VIN) Тогда
		Ошибки = "Поле vin не заполнено. 
		|Ввод документа поступление автомобиля не возможно";
		Возврат Документы.ПоступлениеАвтомобилей.ПустаяСсылка();
	КонецЕсли;
	
	//СоздатьОбновитьАвтомобиль();
	//Записать(Новый Структура());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиАвтомобилейОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль
	|ПОМЕСТИТЬ ВТОстатки
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(, Автомобиль = &Автомобиль) КАК ОстаткиАвтомобилейОстатки
	|ГДЕ
	|	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеАвтомобилейАвтомобили.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОстатки КАК ВТОстатки
	|		ПО ПоступлениеАвтомобилейАвтомобили.Автомобиль = ВТОстатки.Автомобиль
	|ГДЕ
	|	ПоступлениеАвтомобилейАвтомобили.Автомобиль = &Автомобиль
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Автомобиль", Объект.Автомобиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();	
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыСеанса.Организация) Тогда
		ТекОрганизация = ПараметрыСеанса.Организация;
	ИначеЕсли ЗначениеЗаполнено(ПараметрыСеанса.ПодразделениеКомпании) И ЗначениеЗаполнено(ПараметрыСеанса.ПодразделениеКомпании.Организация) Тогда
		ТекОрганизация = ПараметрыСеанса.ПодразделениеКомпании.Организация;
	ИначеЕсли ЗначениеЗаполнено(Справочники.ПодразделенияКомпании.ОсновноеПодразделение.Организация) Тогда
		ТекОрганизация = Справочники.ПодразделенияКомпании.ОсновноеПодразделение.Организация;
	Иначе
		ТекОрганизация = Справочники.Организации.ОсновнаяОрганизация;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ДоговорыВзаиморасчетов.Ссылка
	|ИЗ
	|	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|ГДЕ
	|	ДоговорыВзаиморасчетов.Владелец = &Владелец
	|	И ДоговорыВзаиморасчетов.Организация = &Организация
	|	И ДоговорыВзаиморасчетов.ВидДоговора = &ВидДоговора");
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоров.Покупка);			   
	Запрос.УстановитьПараметр("Владелец", Объект.Клиент);
	Запрос.УстановитьПараметр("Организация", ТекОрганизация);
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		//Создаем договор с контрагентом
		ДогОбъект = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
		
		ДогОбъект.Владелец = Объект.Клиент;
		ДогОбъект.Организация = ТекОрганизация;
		ДогОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Покупка;
		ДогОбъект.УстановитьНовыйКод();
		ДогОбъект.Подразделение = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
		ДогОбъект.ВидОплаты = Перечисления.ВидыОплаты.НаличныйРасчет;
		ДогОбъект.ДатаНачала = НачалоГода(ТекущаяДата());
		ДогОбъект.ВалютаВзаиморасчетов = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
		ДогОбъект.НомерДоговора = ДогОбъект.Код;
		ДогОбъект.Наименование = "Договор №" + ДогОбъект.Код + " с " + Объект.Клиент.Наименование;
		ДогОбъект.ДляАвтосалона = Истина;
		ДогОбъект.ДляАвтосервиса = Истина;
		ДогОбъект.Внутренний = Истина;
		ДогОбъект.ТипДоговора = Перечисления.ТипыДоговоров.Договор;
		ДогОбъект.ЕдиницаИзмеренияАвтоработВПечатныхФормах = обПраво("ЕдиницаИзмеренияАвтоработВПечатныхФормах"); // DMSREN-1228
		Попытка 
			ДогОбъект.Записать();
		Исключение
			ДогОбъект.ПолучитьФорму().Открыть();
		КонецПопытки;
		
		ДоговорСсылка = ДогОбъект.Ссылка;
		
	иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ДоговорСсылка = Выборка.Ссылка;
	КонецЕсли;
	
	ДокументПоступления = Документы.ПоступлениеАвтомобилей.СоздатьДокумент();
	ДокументПоступления.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
	ДокументПоступления.ВалютаДокумента = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	ДокументПоступления.КурсВалютыВзаиморасчетов = 1;
	ДокументПоступления.КурсДокумента = 1;
	ДокументПоступления.ТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенЗакупки;
	ДокументПоступления.Дата = ТекущаяДата();
	ДокументПоступления.Автор = ПараметрыСеанса.Пользователь;
	ДокументПоступления.ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилей;
	ДокументПоступления.СкладКомпании = ПараметрыСеанса.Renault_ПраваПользователя.ДилерскийЦентр.Автосклад_СкладПодержанныхАвто;
	ДокументПоступления.Контрагент = Объект.Клиент;
	ДокументПоступления.Организация = ТекОрганизация;
	ДокументПоступления.ДоговорВзаиморасчетов = ДоговорСсылка;
	ДокументПоступления.Комментарий = "На основании " + Объект.Ссылка;
	ДокументПоступления.РегламентированныйУчет = Истина; //Сергеев В.Н. DMSREN-1029
	НовСтрока = ДокументПоступления.Автомобили.Добавить();
	НовСтрока.VIN = Объект.VIN;
	НовСтрока.Автомобиль = Объект.Автомобиль;
	НовСтрока.ИдентификаторАвтомобиля = Строка(Объект.Автомобиль.УникальныйИдентификатор());
	НовСтрока.АвтомобильБезЗаказа = Истина;
	НовСтрока.АвтомобильБУ = Истина; 	
	НовСтрока.Количество = 1;
	НовСтрока.Цена = Объект.ОриентировочнаяЦена;
	НовСтрока.Сумма = Объект.ОриентировочнаяЦена;
	НовСтрока.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
	НовСтрока.СуммаВсего = НовСтрока.Сумма;
	
	// Трояновский К.Е. 14.02.2019 17:08:22 {
	// Закоммментировано по DMSCOR-1087
	//Если ДокументПоступления.Дата >= '20190101' Тогда
	//	СуммаБезНДС = НовСтрока.СуммаВсего / 1.20;
	//Иначе
	//	СуммаБезНДС = НовСтрока.СуммаВсего / 1.18;
	//КонецЕсли;
	СуммаБезНДС = НовСтрока.СуммаВсего / (1 + Справочники.СтавкиНДС.ОсновнаяСтавкаНДС.Ставка / 100);
	// Трояновский К.Е. 14.02.2019 17:08:22 }
	НовСтрока.СуммаНДС = НовСтрока.СуммаВсего - СуммаБезНДС;
	//ЗаполнитьОпцииПоАвтомобилю (ДокументПоступления, НовСтрока);
	
	Попытка 
		ДокументПоступления.Записать();
	Исключение
		НовыйПоступлениеСсылка = Документы.ПоступлениеАвтомобилей.ПолучитьСсылку(Новый УникальныйИдентификатор);
		ДокументПоступления.УстановитьСсылкуНового(НовыйПоступлениеСсылка);
	КонецПопытки;
	
	Возврат ДокументПоступления;
	
КонецФункции

Процедура ЗаполнитьОпцииПоАвтомобилю (ДокументПоступления,ТекСтрока) 
	
	// запишем опции уже имеющиеся на регистре комплектации
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Renault_ОпцииАвтомобилей.Опция
	|ИЗ
	|	РегистрСведений.Renault_ОпцииАвтомобилей КАК Renault_ОпцииАвтомобилей
	|ГДЕ
	|	Renault_ОпцииАвтомобилей.VIN = &VIN";
	Запрос.УстановитьПараметр("VIN", ТекСтрока.Автомобиль.VIN);
	ОпцииЗаказа = Запрос.Выполнить().Выгрузить();
	
	Если ОпцииЗаказа.Количество() > 0 Тогда
		// очистим опции текущего автомобиля
		ОпцииТекущегоАвтомобиля = ДокументПоступления.Опции.НайтиСтроки(Новый Структура("ИдентификаторАвтомобиля", ТекСтрока.ИдентификаторАвтомобиля));
		Для Каждого СтрокаОпций Из ОпцииТекущегоАвтомобиля Цикл
			ДокументПоступления.Опции.Удалить(СтрокаОпций);
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого ОпцияЗаказа Из ОпцииЗаказа Цикл
		ОпцииТекущегоАвтомобиля=ДокументПоступления.Опции.Добавить();
		ОпцииТекущегоАвтомобиля.ИдентификаторАвтомобиля=ТекСтрока.ИдентификаторАвтомобиля;
		ОпцииТекущегоАвтомобиля.Опция=ОпцияЗаказа.Опция;
		ОпцииТекущегоАвтомобиля.Количество = 1;
	КонецЦикла;
КонецПроцедуры
