Процедура ОтправитьЗаявкуНаСогласование(Ссылка) Экспорт
	
	СтруктураДляОтправки = Новый Структура;
	
	СтруктураДляОтправки.Вставить("VIN", Ссылка.VIN);
	СтруктураДляОтправки.Вставить("DealerName", Ссылка.ДилерскийЦентр.НаименованиеДляПечати);
	СтруктураДляОтправки.Вставить("DealerAddress", Ссылка.ДилерскийЦентр.ОсновнойАдрес);
	СтруктураДляОтправки.Вставить("TransferDate", Ссылка.ДатаПродажи);
	СтруктураДляОтправки.Вставить("ClientName", Строка(Ссылка.Клиент));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтактнаяИнформация.Представление
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект
		|	И КонтактнаяИнформация.Тип = &Тип";
	Запрос.УстановитьПараметр("Объект", Ссылка.Клиент);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		ВызватьИсключение("Не указан почтовый адрес клиента");
	КонецЕсли;
	
	СтруктураДляОтправки.Вставить("ClientAddress", Выборка.Представление);

	ДанныеОтСервиса = Неопределено;
	ПакетДляПередачи = DMS_DataExchange.newPackage(СтруктураДляОтправки); 
	Результат = DMS_DataExchange.sendMessage
		(DMS_ОбщиеПовторныеФункции.ПараметрыHTTPСоединения(),
		"ConsolidationHTTP",
		"DMS_GuaranteeDocs.ЗаписатьЗаявку",
		ПакетДляПередачи,
		ДанныеОтСервиса);
		
	Если Результат <> Истина Тогда
		Сообщить(ДанныеОтСервиса);
		Возврат;
	КонецЕсли;		

	ЗаявкаОбъект = Ссылка.ПолучитьОбъект();
	ЗаявкаОбъект.Статус = Перечисления.DMS_СтатусыЗаявкиНаПовторнуюПечатьГТ.НаРассмотрении;	
КонецПроцедуры

Функция ПолучитьЗначениеИзJSON(Строка)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Строка);
	
	ПараметрыЗапроса = ПрочитатьJSON(ЧтениеJSON);
	Данные = Base64Значение(ПараметрыЗапроса);
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("XML");
	Данные.Записать(ИмяВременногоФайла);
	
	ТаблицаДанных = ПолучитьЗначениеИзХML(ИмяВременногоФайла);	
	
	Возврат ТаблицаДанных;
	
КонецФункции

Функция ПолучитьЗначениеИзХML(ИмяВременногоФайла)
		
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяВременногоФайла);
	ЧтениеXML.Прочитать();
 	ЧтениеXML.Прочитать(); // пропуск тэга Message
	Пока ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Цикл
		ТипXDTO = ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/core", ЧтениеXML.Имя);
		ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипXDTO);
	КонецЦикла;
	ЧтениеXML.Закрыть();
	УдалитьФайлы(ИмяВременногоФайла);
	
	Значение = СериализаторXDTO.ПрочитатьXDTO(ОбъектXDTO);
	
	Возврат Значение;
	
КонецФункции

Функция ПолучитьСтрокуJSONИзXDTO(ОбъектXDTO)
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайла, "UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("Message");
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектXDTO);

	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.Закрыть();
	ДвоичныеДанныеСообщения = Новый ДвоичныеДанные(ИмяВременногоФайла);

	СтрокаДанные = Base64Строка(ДвоичныеДанныеСообщения);

	УдалитьФайлы(ИмяВременногоФайла);

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтрокаДанные);
	СтрокаДляОтвета = ЗаписьJSON.Закрыть();		
	
	Возврат СтрокаДляОтвета;
	
КонецФункции
