Перем ТипЦенЗакупочная Экспорт;
Перем ВалютаУпр Экспорт;

Процедура ОбновитьТаблицы() Экспорт

	Товары.Очистить();
	СписокЗаказов.Очистить();
	
	СКД = ПолучитьМакет("СКД_ЗапросДанные");
	
	НастройкиКомпоновки = КомпоновщикНастроек.ПолучитьНастройки();
	
	Для каждого стрПар Из НастройкиКомпоновки.ПараметрыДанных.Элементы Цикл
		Если стрПар.Параметр = Новый ПараметрКомпоновкиДанных("ТекущаяДата") Тогда
			стрПар.Значение = НачалоДня(ТекущаяДата());
			стрПар.Использование = Истина;
		КонецЕсли;
	КонецЦикла;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, НастройкиКомпоновки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	Таблица = Новый ТаблицаЗначений;
	
	ПроцессорВывода.УстановитьОбъект(Таблица);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	СписокЗаказов.Загрузить(Таблица);
	
	Таблица.Свернуть("Артикул, Номенклатура, ХарактеристикаНоменклатуры, ОсновнойПоставщик, Промоакция", "Нераспределено, Заказано");
	Товары.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ЗаполнитьТовары() Экспорт

    

КонецПроцедуры

ВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();

ТипЦенЗакупочная = Справочники.Renault_ОбщиеНастройкиБазыДанных.ЭтаБаза.PNCЗакупСкладская;
