Перем АвтодокВерсия Экспорт;

Перем ws;
Перем ИнициализацияУспешна Экспорт;

Перем Результат Экспорт; // В этой переменной храним результат работы системы.
Перем ДанныеПолучены Экспорт;

////$+ Комментарий 
//Дата создания - 17.04.2012 12:57:05; Автор - Окипний Андрей Евгеньевич
//
//ОписаниеОшибки - Переменная в которой собираем информацию о возникших ошибках.
//
//$- 
Перем ОписаниеОшибки Экспорт;

////$+ Комментарий 
//Дата создания - 17.04.2012 12:56:10; Автор - Окипний Андрей Евгеньевич
//
//ДанныеДляПередачи - Переменная в которую помещаем запрос к Ap2Ap
//
//$-
Перем ДанныеДляПередачи Экспорт;

////$+ Комментарий 
//Дата создания - 17.04.2012 12:55:41; Автор - Окипний Андрей Евгеньевич
//
//РезультатЗапроса - Переменная в которой хранится результат запроса от Ap2Ap
//
//$-
Перем РезультатЗапроса;

Перем Тикет Экспорт;

////@+ Процедура Close()
// Дата создания - 13.04.2012 16:34:11;
// Автор - Окипний Андрей Евгеньевич
// 
//
// Описание процедуры
//  Разрывает активное подключение и закрывает канал.
//
// Параметры
//  Без параметров
//@-
Процедура Close()

	

КонецПроцедуры // Close()

////@+ Процедура Connect()
// Дата создания - 13.04.2012 16:34:35;
// Автор - Окипний Андрей Евгеньевич
// 
//
// Описание процедуры
//  Процедура обрабатывает событие Connect возникающее при соединении с сервером.
//
// Параметры
//  Без параметров
//@-
Процедура Connect() 

	WS.SendData(СокрЛП(ДанныеДляПередачи));

КонецПроцедуры // Connect()

////@+ Процедура DataArrival(data)
// Дата создания - 13.04.2012 16:35:37;
// Автор - Окипний Андрей Евгеньевич
// 
//
// Описание процедуры
//  Возникает при окончании получения сообщения. 
//
// Параметры
//  Парам1 bytesTotal  - Число - размер полученных данных в байтах
//@-
Процедура DataArrival(bytesTotal) 

	ТкстСообщения = "";
	ws.GetData(ТкстСообщения);
	
	РезультатЗапроса = РезультатЗапроса + ТкстСообщения;
	
	Если Найти(РезультатЗапроса, "</A2A>") > 0 тогда
		
		ЗаписатьТикет(РезультатЗапроса);
		
	КонецЕсли;

КонецПроцедуры // DataArrival(bytesTotal)

////@+ Процедура Error(Number, Description, Scode, Source, HelpFile, HelpContext, CancelDisplay)
// Дата создания - 13.04.2012 16:37:54; 
// Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Обработчик ошибок возникающих в компоненте Winsock.dll
//
// Параметры
//  Парам1 Number  - Число - числовой код ошибки
//
//  Парам2 Description  - Строка - Описание возникшей ошибки
//
//  Парам3 Scode  - Long - Код ошибки в формате HRESULT
//	описание http://msdn.microsoft.com/en-us/library/cc815308.aspx (En)
//
//  Парам4 Source  - Строка - описание источника ошибки
//
//  Парам5 HelpFile  - Ссылка - ссылка на Файл справки (НЕ 1С)
//
//   Парам6 HelpContext  - Строка - контекст файла справки (Если доступен)
//
//  Парам7 CancelDisplay  - Булево - флаг отмены отображения стандартного 
//  окна об ошибке. По умолчанию значение - Истина. Окно не выводится.
//
//@-
Процедура Error(Number, Description, Scode, Source, HelpFile, HelpContext, CancelDisplay) 

	CancelDisplay = Истина;
	
	//Если возникла какая нибудь ошибка
	//результат работы переводим в ложь, и код + описание ошибки загоняем в ОписаниеОшибки которое будем 
	//перехватывать в точке вызова.
	ОписаниеОшибки = "Код - " + Number + ". Описание - " + Description;

КонецПроцедуры // Error(Number, Description, Scode, Source, HelpFile, HelpContext, CancelDisplay)

////@+ Процедура SendComplete()
// Дата создания - 13.04.2012 16:41:56;
// Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Обработчик события возникающего при завершении передачи сообщения
//
// Параметры
//  Без параметров
//@-
Процедура SendComplete() 

КонецПроцедуры // SendComplete()

////@+ Процедура SendProgress(bytesSend, bytesRemaining)
// Дата создания - 13.04.2012 16:42:50;
// Автор - Окипний Андрей Евгеньевич
// 
//
// Описание процедуры
//  Событие возникающее при передаче сообщения.
//  событие наступает для каждого переданного байта
//
// Параметры
//  Парам1 bytesSend  - Число - байт переданно
//
//  Парам2 bytesRemaining  - Число - Байт Осталось
//
//@-
Процедура SendProgress(bytesSend, bytesRemaining) 

КонецПроцедуры // SendProgress(bytesSend, bytesRemaining)

////////////////////////////////////////////////////
//Стартовые процедуры

////@+ Процедура УстановитьАдресПортСервера()
// Дата создания - 13.04.2012 17:31:52; 
// Автор - Окипний Андрей Евгеньевич
// 
//
// Описание процедуры
//  Устанавливает в компоненте адрес и порт сервера Ap2Ap
//
// Параметры
//  Без параметров
//
//@-
Процедура УстановитьАдресПортСервера()
	
	Результат = Ложь;
	
	Порт = Константы.Renault_Ap2ApПорт.Получить();
	Если НЕ ЗначениеЗаполнено(Порт) тогда
		Порт = 8209;
	КонецЕсли;
	
	Адрес = Константы.Renault_Ap2ApАдресСервера.Получить();
	Если ЗначениеЗаполнено(Адрес) тогда 
		
		// Комментарий 
		//Дата создания - 13.04.2012 17:43:17; Автор - Окипний Андрей Евгеньевич
		//Проверим состояние компоненты, если не все нормально, (State <> 0) перезапустим
		//
		Если WS.State <> 0 тогда
			WS.Close();
		КонецЕсли;
		
		WS.RemoteHost = Адрес;
		WS.RemotePort = Порт;
		
		Результат = Истина;
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьАдресПортСервера()

////@+ Процедура УстановитьСоединение()
// Дата создания - 17.04.2012 11:39:30;
// Автор - Окипний Андрей Евгеньевич
//
// Описание процедуры
//  Процедура производит соединение с сервером A2A по указанным адресу и порту.
//  при этом функция учитывает необходимость переподключения на другой порт
//
// Параметры
//  Без параметров
//
//@-
Процедура УстановитьСоединение()
	
	//Первоначальная инициализация
	Результат = Истина;
	
	////$+ Комментарий 
	//Дата создания - 17.04.2012 11:46:03; Автор - Окипний Андрей Евгеньевич
	//
	// Событие Connect не возвращает результат выполнения. 
	// Нужно проверить реквизит State. И изменить результат
	// в событии Error, если возникнет ошибка.
	//
	//$-
	Если WS.State <> 0 Тогда
		WS.Close();
	КонецЕсли;
		
	WS.Connect();
	
КонецПроцедуры // УстановитьСоединение()

////////////////////////////////////////////////////
//Точка входа

////@+ Процедура ОтправитьДанные()
// Дата создания - 17.04.2012 18:02:06;
// Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Процедура производит отправку данных на порт Ap2Ap
//
// Параметры
//  Без параметров
//@-
Процедура ОтправитьДанные() Экспорт
	
	////$+ Комментарий 
	// Дата создания - 31.05.2012 14:16:47;
	// Автор - Окипний Андрей Евгеньевич
	//
	//В этой процедуре нет явной отправки данных.
	//все данные отправляются в обработчике события
	//Connect()
	//
	//$-
	УстановитьАдресПортСервера();
	
	УстановитьСоединение();
	
	ВремОкончанияОжидания = ТекущаяДата() + 5; //Ждем 5 сек. для установки соединения
	Пока ТекущаяДата() <= ВремОкончанияОжидания Цикл КонецЦикла;
	
КонецПроцедуры // ОтправитьДанные()

////////////////////////////////////////////////////
//	Обработка результата

////@+ Процедура ЗаписатьТикет(РезультатЗапроса)
// Дата создания - 19.04.2012 11:21:15;
// Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Процедура производит запись результата запроса в тикет A2A
//
// Параметры
//  Парам1 РезультатЗапроса  - Строка - XML ответа в строковой переменной
//
//@-
Процедура ЗаписатьТикет(РезультатЗапроса)

	РегистрыСведений.Renault_ТикетыAp2Ap.ЗаписатьРезультат(РезультатЗапроса, Тикет);

КонецПроцедуры // ЗаписатьТикет(РезультатЗапроса)


////////////////////////////////////////////////////
//Инициализация объектов

Попытка
	
	ws = Новый ComОбъект("mswinsock.winsock");
	
	ДобавитьОбработчик ws.Close, Close;
	ДобавитьОбработчик ws.Connect, Connect;
	ДобавитьОбработчик ws.DataArrival, DataArrival;
	ДобавитьОбработчик ws.Error, Error;
	ДобавитьОбработчик ws.SendComplete, SendComplete;
	ДобавитьОбработчик ws.SendProgress, SendProgress;
	
	ИнициализацияУспешна = Истина;
	
Исключение
	
	ИнициализацияУспешна = Ложь;
	
КонецПопытки;

РезультатЗапроса = "";
АвтодокВерсия = "1_00_01";