
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоЗаменаБонуснойКарты = (Объект.ВидОперации = Перечисления.DMS_ВидыОперацийКартЛояльности.ЗаменаБонуснойКарты); 
	ЭтоЗаменаКартыПриУтери = (Объект.ВидОперации = Перечисления.DMS_ВидыОперацийКартЛояльности.ЗаменаКартыПриУтери); 
	   
	Если Параметры.Свойство("ДанныеЗаменыКарты") Тогда
		
		ЗаполнитьЗначенияСвойств(Объект,Параметры.ДанныеЗаменыКарты);
		
		ЭтоЗаменаБонуснойКарты = (Объект.ВидОперации = Перечисления.DMS_ВидыОперацийКартЛояльности.ЗаменаБонуснойКарты); 
				
		НоваяСтрока = Объект.КартыПокупателей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Параметры.ДанныеЗаменыКарты);
		
		Если Не ЭтоЗаменаБонуснойКарты И Не ЭтоЗаменаКартыПриУтери Тогда
			
			Если ЗначениеЗаполнено(НоваяСтрока.КартаИсточник) 
				И ЗначениеЗаполнено(НоваяСтрока.КартаПриемник) Тогда
				
				ВидКартыИсточник = НоваяСтрока.КартаИсточник.DMS_ВидКартыЛояльности;
				ВидКартыПриемник = НоваяСтрока.КартаПриемник.DMS_ВидКартыЛояльности;
				
				НоваяСтрока.Номинал = ПолучитьНоминал(ВидКартыИсточник,ВидКартыПриемник);
				
			Иначе 
				НоваяСтрока.Номинал = 0;
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(НоваяСтрока.ВидКарты) Тогда
				НоваяСтрока.ПогаситьДо = ЗаполнитьДатуПогашения(НоваяСтрока.ВидКарты,ПолучитьЗначениеРеквизита(НоваяСтрока.КартаИсточник,"ПрограммаЛояльности"),Объект.Дата);
			КонецЕсли; 
			
		Иначе
			
			Если ЗначениеЗаполнено(НоваяСтрока.КартаИсточник) Тогда 
				НоваяСтрока.Номинал = ПолучитьОстатокПоКартеЛояльнсти(НоваяСтрока.КартаИсточник,Объект.Дата);
			Иначе 
				НоваяСтрока.Номинал = 0;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НоваяСтрока.ВидКарты) Тогда
				НоваяСтрока.ПогаситьДо = ЗаполнитьДатуПогашения(НоваяСтрока.ВидКарты,ПолучитьЗначениеРеквизита(НоваяСтрока.КартаИсточник,"ПрограммаЛояльности"),Объект.Дата);
			КонецЕсли; 
			
		КонецЕсли;
		
	ИначеЕсли Параметры.Свойство("ДанныеДляЗаменыДисконтнойКарты") Тогда 
		
		ЭтоЗаменаБонуснойКарты = Ложь; 
				
		ЗаполнитьЗначенияСвойств(Объект,Параметры.ДанныеДляЗаменыДисконтнойКарты);
		
		НоваяСтрока = Объект.КартыПокупателей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Параметры.ДанныеДляЗаменыДисконтнойКарты);
		
		Если ЗначениеЗаполнено(НоваяСтрока.ВидКарты) Тогда
			НоваяСтрока.ПогаситьДо = ЗаполнитьДатуПогашения(НоваяСтрока.ВидКарты,ПолучитьЗначениеРеквизита(НоваяСтрока.КартаИсточник,"ПрограммаЛояльности"),Объект.Дата);
		КонецЕсли; 
		
	КонецЕсли; 
	
	УстановитьПараметрыВыбораКартам();	
	
	УстановитьВидимость();
	
	Если Объект.Статус = Перечисления.DMS_СтатусЗаменыКарт.Согласован Тогда
		ТолькоПросмотр = Истина;
		Элементы.КартыПокупателейСоздатьНовыеКарты.Доступность = Ложь;
		Элементы.ФормаРедактироватьРеквизиты.Видимость = Истина;
		Элементы.Статус.ТолькоПросмотр = Ложь;
	ИначеЕсли ЭтоЗаменаКартыПриУтери Тогда 
		Элементы.Статус.ТолькоПросмотр = Ложь;
	Иначе 
		Элементы.КартыПокупателейСоздатьНовыеКарты.Доступность = Истина;
		Элементы.ФормаРедактироватьРеквизиты.Видимость = Ложь;
		Элементы.Статус.ТолькоПросмотр = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.Статус = Перечисления.DMS_СтатусЗаменыКарт.Согласован 
		И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Для каждого ТекущаяСтрока Из ТекущийОбъект.КартыПокупателей Цикл
			
			ОбъектКарта = ТекущаяСтрока.КартаИсточник.ПолучитьОбъект();
			ОбъектКарта.Недействительна 	  = Истина;
			ОбъектКарта.DMS_КартаЗамены 	  = ТекущаяСтрока.КартаПриемник;
			ОбъектКарта.ОбменДанными.Загрузка = Истина;
			ОбъектКарта.Записать();
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	Если ТекущийОбъект.Статус = Перечисления.DMS_СтатусЗаменыКарт.Согласован Тогда
		ТолькоПросмотр = Истина;
		Элементы.ФормаРедактироватьРеквизиты.Видимость = Истина;
		Элементы.Статус.ТолькоПросмотр = Ложь;
	ИначеЕсли ЭтоЗаменаКартыПриУтери Тогда 
		Элементы.Статус.ТолькоПросмотр = Ложь;
	Иначе 
		ТолькоПросмотр = Ложь;
		Элементы.ФормаРедактироватьРеквизиты.Видимость = Ложь;
		Элементы.Статус.ТолькоПросмотр = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Оповестить("Запись_ЗаменыКарты",ВладелецФормы);	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьРеквизиты(Команда)
	
	ТолькоПросмотр = Элементы.ФормаРедактироватьРеквизиты.Пометка;	
	Элементы.ФормаРедактироватьРеквизиты.Пометка = Не Элементы.ФормаРедактироватьРеквизиты.Пометка;
	Элементы.КартыПокупателейСоздатьНовыеКарты.Доступность = Элементы.ФормаРедактироватьРеквизиты.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	Элементы.ФормаСогласиеНаОбработкуДанных.Видимость = (Объект.Статус = Перечисления.DMS_СтатусЗаменыКарт.НаОзнакомлении) И Не ЭтоЗаменаКартыПриУтери;
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.DMS_СтатусЗаменыКарт.НаОзнакомлении") И Не ЭтоЗаменаКартыПриУтери Тогда
		Элементы.Статус.ТолькоПросмотр = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыеКарты(Команда)
	
	Если Вопрос("Создать новую/заменить карту клиента?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьНовыеКартыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	Объект.КартыПокупателей.Очистить();
	
	ЭтоЗаменаБонуснойКарты = (Объект.ВидОперации = Перечисления.DMS_ВидыОперацийКартЛояльности.ЗаменаБонуснойКарты); 
	ЭтоЗаменаКартыПриУтери = (Объект.ВидОперации = Перечисления.DMS_ВидыОперацийКартЛояльности.ЗаменаКартыПриУтери); 
	
	УстановитьПараметрыВыбораКартам();
	
	УстановитьВидимость();
	
	Если ЭтоЗаменаКартыПриУтери Тогда
		Элементы.КартыПокупателейВидКарты.ТолькоПросмотр = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	Элементы.КартыПокупателейВидКарты.Видимость		      = ЭтоЗаменаБонуснойКарты Или ЭтоЗаменаКартыПриУтери;
	Элементы.КартыПокупателейСоздатьНовыеКарты.Видимость  = ЭтоЗаменаБонуснойКарты Или ЭтоЗаменаКартыПриУтери;
	
	Элементы.ФормаСогласиеНаОбработкуДанных.Видимость = (Объект.Статус = Перечисления.DMS_СтатусЗаменыКарт.НаОзнакомлении) И Не ЭтоЗаменаКартыПриУтери;
	
КонецПроцедуры // УстановитьВидимость()

&НаСервере
Процедура УстановитьПараметрыВыбораКартам()

	Если Объект.ВидОперации = Перечисления.DMS_ВидыОперацийКартЛояльности.ЗаменаБонуснойКарты Тогда
		
		ПараметрыВидКарты = Новый ПараметрВыбора("Отбор.DMS_ТипКарты", Перечисления.DMS_ТипыКартЛояльности.Бонусная);
		
		НовыйМассив = Новый Массив;
		НовыйМассив.Добавить(ПараметрыВидКарты);
		
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		
		Элементы.КартыПокупателейКартаИсточник.ПараметрыВыбора = НовыеПараметры;	
		
	Иначе 
		
		ПараметрыВидКарты = Новый ПараметрВыбора("Отбор.DMS_ТипКарты", Перечисления.DMS_ТипыКартЛояльности.Дисконтная);
		
		НовыйМассив = Новый Массив;
		НовыйМассив.Добавить(ПараметрыВидКарты);
		
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		
		Элементы.КартыПокупателейКартаИсточник.ПараметрыВыбора = НовыеПараметры;	
		
	КонецЕсли; 	

КонецПроцедуры // УстановитьПараметрыВыбораКартам()

&НаКлиенте
Процедура КартыПокупателейКартаИсточникПриИзменении(Элемент)
		
	ТекущаяСтрока = Элементы.КартыПокупателей.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ТекущаяСтрока.КартаПриемник = ПолучитьЗначениеРеквизита(ТекущаяСтрока.КартаИсточник,"DMS_КартаЗамены");
	
	Если ЭтоЗаменаКартыПриУтери Тогда
		
		ТекущаяСтрока.ВидКарты   = ПолучитьЗначениеРеквизита(ТекущаяСтрока.КартаИсточник,"DMS_ВидКартыЛояльности");				
		ТекущаяСтрока.ПогаситьДо = ЗаполнитьДатуПогашения(ТекущаяСтрока.ВидКарты,ПолучитьЗначениеРеквизита(ТекущаяСтрока.КартаИсточник,"ПрограммаЛояльности"),Объект.Дата);
		
	КонецЕсли; 
	
	Если Не ЭтоЗаменаБонуснойКарты И Не ЭтоЗаменаКартыПриУтери Тогда
				
		Если ЗначениеЗаполнено(ТекущаяСтрока.КартаИсточник) 
			И ЗначениеЗаполнено(ТекущаяСтрока.КартаПриемник) Тогда
			
			ВидКартыИсточник = ПолучитьЗначениеРеквизита(ТекущаяСтрока.КартаИсточник,"DMS_ВидКартыЛояльности");
			ВидКартыПриемник = ПолучитьЗначениеРеквизита(ТекущаяСтрока.КартаПриемник,"DMS_ВидКартыЛояльности");
			
			ТекущаяСтрока.Номинал = ПолучитьНоминал(ВидКартыИсточник,ВидКартыПриемник);
			
		Иначе 
			
			ТекущаяСтрока.Номинал = 0;
			
		КонецЕсли; 
		
	Иначе
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.КартаИсточник) Тогда 
			ТекущаяСтрока.Номинал = ПолучитьОстатокПоКартеЛояльнсти(ТекущаяСтрока.КартаИсточник,Объект.Дата);
		Иначе 
			ТекущаяСтрока.Номинал = 0;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КартыПокупателейКартаПриемникПриИзменении(Элемент)
	
	Если ЭтоЗаменаБонуснойКарты Тогда
		Возврат;
	КонецЕсли; 
	
	ТекущаяСтрока = Элементы.КартыПокупателей.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.КартаИсточник) 
		И ЗначениеЗаполнено(ТекущаяСтрока.КартаПриемник) Тогда
		
		ВидКартыИсточник = ПолучитьЗначениеРеквизита(ТекущаяСтрока.КартаИсточник,"DMS_ВидКартыЛояльности");
		ВидКартыПриемник = ПолучитьЗначениеРеквизита(ТекущаяСтрока.КартаПриемник,"DMS_ВидКартыЛояльности");
		
		ТекущаяСтрока.Номинал = ПолучитьНоминал(ВидКартыИсточник,ВидКартыПриемник);
				
		ТекущаяСтрока.ПогаситьДо = ЗаполнитьДатуПогашения(ВидКартыПриемник,ПолучитьЗначениеРеквизита(ТекущаяСтрока.КартаИсточник,"ПрограммаЛояльности"),Объект.Дата);
		
	Иначе 
		
		ТекущаяСтрока.Номинал = 0;
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КартыПокупателейКартаПриемникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.КартыПокупателей.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если Не ЭтоЗаменаБонуснойКарты И Не ЭтоЗаменаКартыПриУтери Тогда
	
		СтандартнаяОбработка = Ложь;
		
		Контрагент		= ПолучитьЗначениеРеквизита(ТекущаяСтрока.КартаИсточник,"Контрагент");
		СписокВидовКарт = ПолучитьВидыКартПоЗаменеДисконтных(ТекущаяСтрока.КартаИсточник);
		
		ПараметрыОтбор = Новый Структура("Контрагент,DMS_ВидКартыЛояльности",Контрагент,СписокВидовКарт);
		
		ПараметрыФормы = Новый Структура("Отбор",ПараметрыОтбор);
		
		ОткрытьФорму("Справочник.Renault_КартыЛояльности.Форма.ФормаВыбораУправляемая",ПараметрыФормы,Элементы.КартыПокупателейКартаПриемник);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КартыПокупателейКартаПриемникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Renault_КартыЛояльности") Тогда
		
		ТекущаяСтрока = Элементы.КартыПокупателей.ТекущиеДанные;
		
		Если ТекущаяСтрока <> Неопределено Тогда
			
			ТекущаяСтрока.КартаПриемник = ВыбранноеЗначение;
			
			ВидКартыПриемника = ПолучитьЗначениеРеквизита(ВыбранноеЗначение,"DMS_ВидКартыЛояльности");
			
			ТекущаяСтрока.ПогаситьДо = ЗаполнитьДатуПогашения(ВидКартыПриемника,ПолучитьЗначениеРеквизита(ВыбранноеЗначение,"ПрограммаЛояльности"),Объект.Дата);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры
 
&НаКлиенте
Процедура КартыПокупателейВидКартыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЭтоЗаменаБонуснойКарты Тогда
	
		СтандартнаяОбработка = Ложь;
		
		ТекущаяСтрока = Элементы.КартыПокупателей.ТекущиеДанные;
		
		КартаЛояльностиИсточник = ТекущаяСтрока.КартаИсточник;
		
		СписокВидовКарт = Новый СписокЗначений;
		СписокВидовКарт.ЗагрузитьЗначения(ПолучитьМассивВидовКартПриемника(КартаЛояльностиИсточник,Объект.Дата));
		
		Отбор = Новый Структура("Ссылка",СписокВидовКарт);
		
		ПараметрыФормы = Новый Структура("Отбор",Отбор);
		
		ОткрытьФорму("Справочник.DMS_ВидыКартЛояльности.Форма.ФормаВыбора",ПараметрыФормы,Элементы.КартыПокупателейВидКарты);
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КартыПокупателейВидКартыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.DMS_ВидыКартЛояльности") Тогда
		
		ТекущаяСтрока = Элементы.КартыПокупателей.ТекущиеДанные;
		
		Если ТекущаяСтрока <> Неопределено Тогда
			
			ТекущаяСтрока.ВидКарты = ВыбранноеЗначение;
			
			ТекущаяСтрока.ПогаситьДо = ЗаполнитьДатуПогашения(ВыбранноеЗначение,ПолучитьЗначениеРеквизита(ТекущаяСтрока.КартаИсточник,"ПрограммаЛояльности"),Объект.Дата);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры
 
&НаСервереБезКонтекста
Функция ПолучитьНоминал(ВидКартыИсточник,ВидКартыПриемник)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидКартыИсточник", ВидКартыИсточник);
	Запрос.УстановитьПараметр("ВидКартыПриемник", ВидКартыПриемник);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ПравилаЗаменыДисконтныхКарт.Номинал
		|ИЗ
		|	Справочник.DMS_ВидыКартЛояльности.ПравилаЗаменыДисконтныхКарт КАК ПравилаЗаменыДисконтныхКарт
		|ГДЕ
		|	ПравилаЗаменыДисконтныхКарт.Ссылка = &ВидКартыПриемник
		|	И ПравилаЗаменыДисконтныхКарт.ВидДисконтнойКарты = &ВидКартыИсточник";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Номинал = 0;
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Номинал = ВыборкаДетальныеЗаписи.Номинал;
	КонецЕсли; 
	
	Возврат Номинал;

КонецФункции // ПолучитьНоминал()

&НаСервереБезКонтекста
Функция ПолучитьМассивВидовКартПриемника(КартаЛояльности,Период)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КартаЛояльности", КартаЛояльности);
	Запрос.УстановитьПараметр("Период", 		 Период);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БонусныеБаллы.КартаЛояльности КАК КартаЛояльности,
		|	БонусныеБаллы.НачисленоОстаток КАК Баллы
		|ПОМЕСТИТЬ ОстатокБаллов
		|ИЗ
		|	РегистрНакопления.DMS_БонусныеБаллы.Остатки(&Период, КартаЛояльности = &КартаЛояльности) КАК БонусныеБаллы
		|ГДЕ
		|	БонусныеБаллы.НачисленоОстаток + БонусныеБаллы.КСписаниюОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстатокБаллов.КартаЛояльности КАК КартаЛояльности,
		|	ПравилаЗаменыБонусныхКарт.Ссылка КАК ВидКарты,
		|	ОстатокБаллов.Баллы КАК Баллы,
		|	ПравилаЗаменыБонусныхКарт.СуммаБалловОт КАК СуммаБалловОт
		|ИЗ
		|	ОстатокБаллов КАК ОстатокБаллов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.DMS_ВидыКартЛояльности.ПравилаЗаменыБонусныхКарт КАК ПравилаЗаменыБонусныхКарт
		|		ПО ОстатокБаллов.КартаЛояльности.DMS_ВидКартыЛояльности = ПравилаЗаменыБонусныхКарт.ВидБонуснойКарты
		|			И ОстатокБаллов.Баллы >= ПравилаЗаменыБонусныхКарт.СуммаБалловОт
		|			И (НЕ ПравилаЗаменыБонусныхКарт.ВидБонуснойКарты.ПометкаУдаления)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивВидоКарт = Новый Массив;
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		МассивВидоКарт.Добавить(ВыборкаДетальныеЗаписи.ВидКарты);
	КонецЕсли; 
	
	Возврат МассивВидоКарт;

КонецФункции // ПолучитьМассивВидовКартПриемника()

&НаСервере
Функция ЗаполнитьДатуПогашения(ВидКартыЛояльности,ПрограммаЛояльности,Дата)
	
	ПогаситьДо = Дата("00010101");
	
	Если ЗначениеЗаполнено(ВидКартыЛояльности)
		И ВидКартыЛояльности.ИспользоватьСрокДействияБаллов Тогда
		
		ПогаситьДо = ДобавитьКДате(Дата,Формат(ВидКартыЛояльности.СрокДействияБаллов,"ЧЦ=10; ЧН=0; ЧГ="),СокрЛП(ВидКартыЛояльности.ПериодичностьДействияБаллов)); 
		
	ИначеЕсли ЗначениеЗаполнено(ПрограммаЛояльности) 
		И ПрограммаЛояльности.СрокДействияБаллов <> 0 Тогда  
		
		ПогаситьДо = ДобавитьКДате(НачалоДня(Дата),Формат(ПрограммаЛояльности.СрокДействияБаллов,"ЧЦ=10; ЧН=0; ЧГ=")); 
	
	КонецЕсли; 	

	Возврат ПогаситьДо;
	
КонецФункции

&НаСервере
Функция ДобавитьКДате(мДата,Количество,Тип = "День")
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("мДата", мДата);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДОБАВИТЬКДАТЕ(&мДата, "+Тип+", "+Количество+") КАК НоваяДата";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НоваяДата = мДата;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяДата = ВыборкаДетальныеЗаписи.НоваяДата;
	КонецЦикла;
	
	Возврат НоваяДата;
	
КонецФункции // ДобавитьКДате()

&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизита(мОбъект,ИмяРеквизита)

	Возврат мОбъект[ИмяРеквизита];

КонецФункции // ПолучитьЗначениеРеквизита()

&НаСервере
Процедура СоздатьНовыеКартыНаСервере()
	
	Для каждого ТекущаяСтрока Из Объект.КартыПокупателей Цикл
	
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.КартаПриемник) 
			И ЗначениеЗаполнено(ТекущаяСтрока.ВидКарты)
			И ЗначениеЗаполнено(ТекущаяСтрока.КартаИсточник) Тогда

			НоваяКартаОбъект = ТекущаяСтрока.КартаИсточник.Скопировать();	
			НоваяКартаОбъект.УстановитьНовыйКод();
			НоваяКартаОбъект.DMS_ВидКартыЛояльности = ТекущаяСтрока.ВидКарты;
			НоваяКартаОбъект.Наименование			= "Карта("+СокрЛП(ТекущаяСтрока.ВидКарты)+"): " + Строка(Объект.Контрагент);
			НоваяКартаОбъект.ДилерскийЦентр 		= Renault_CRM.ПолучитьДилерскийЦентрПользователя();
			
			Попытка
				НоваяКартаОбъект.Записать();
			Исключение
			   	Сообщить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				Продолжить;
			КонецПопытки;
			
			ТекущаяСтрока.КартаПриемник = НоваяКартаОбъект.Ссылка;
	
		ИначеЕсли ЗначениеЗаполнено(ТекущаяСтрока.КартаПриемник) 
			И ЗначениеЗаполнено(ТекущаяСтрока.ВидКарты)
			И ЗначениеЗаполнено(ТекущаяСтрока.КартаИсточник) Тогда

			НоваяКартаОбъект = ТекущаяСтрока.КартаПриемник.ПолучитьОбъект();	
			НоваяКартаОбъект.DMS_ВидКартыЛояльности = ТекущаяСтрока.ВидКарты;
			НоваяКартаОбъект.ПометкаУдаления = Ложь;
			НоваяКартаОбъект.Наименование			= "Карта("+СокрЛП(ТекущаяСтрока.ВидКарты)+"): " + Строка(Объект.Контрагент);
			НоваяКартаОбъект.ДилерскийЦентр 		= Renault_CRM.ПолучитьДилерскийЦентрПользователя();
			
			Попытка
				НоваяКартаОбъект.Записать();
			Исключение
			   	Сообщить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				Продолжить;
			КонецПопытки;
			
			ТекущаяСтрока.КартаПриемник = НоваяКартаОбъект.Ссылка;
			
		КонецЕсли; 
	
	КонецЦикла; 
	
КонецПроцедуры
 
&НаСервереБезКонтекста
Функция ПолучитьОстатокПоКартеЛояльнсти(КартаЛояльности,Период)
	
	ПараметрыГраницы = Новый Массив(2);
	ПараметрыГраницы[0] = КонецДня(Период);
	ПараметрыГраницы[1] = ВидГраницы.Включая;
	
	ГраницаПериода = Новый(Тип("Граница"),ПараметрыГраницы);	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КартаЛояльности", КартаЛояльности);
	Запрос.УстановитьПараметр("Период", 		 ГраницаПериода);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БонусныеБаллы.КартаЛояльности,
		|	БонусныеБаллы.НачисленоОстаток КАК НачисленоОстаток
		|ИЗ
		|	РегистрНакопления.DMS_БонусныеБаллы.Остатки(&Период, КартаЛояльности = &КартаЛояльности) КАК БонусныеБаллы
		|ГДЕ
		|	БонусныеБаллы.НачисленоОстаток + БонусныеБаллы.КСписаниюОстаток > 0";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НачисленоОстаток = 0;
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		НачисленоОстаток = ВыборкаДетальныеЗаписи.НачисленоОстаток;	
	КонецЕсли; 
	
	Возврат НачисленоОстаток;
	
КонецФункции // ПолучиьтОстатокПоКартеЛояльнсти()

&НаСервереБезКонтекста
Функция ПолучитьВидыКартПоЗаменеДисконтных(КартаЛояльности)
	
	ВидДисконтнойКарты = КартаЛояльности.DMS_ВидКартыЛояльности;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ПравилаЗаменыДисконтныхКарт.Ссылка КАК ВидКарты
		|ПОМЕСТИТЬ ВидыКарт
		|ИЗ
		|	Справочник.DMS_ВидыКартЛояльности.ПравилаЗаменыДисконтныхКарт КАК ПравилаЗаменыДисконтныхКарт
		|ГДЕ
		|	ПравилаЗаменыДисконтныхКарт.Ссылка.ИспользуетсяЗаменаДисконтныхКарт
		|	И НЕ ПравилаЗаменыДисконтныхКарт.Ссылка.ПометкаУдаления
		|	И ПравилаЗаменыДисконтныхКарт.ВидДисконтнойКарты = &ВидДисконтнойКарты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыКарт.ВидКарты
		|ИЗ
		|	ВидыКарт КАК ВидыКарт";
	
	Запрос.УстановитьПараметр("ВидДисконтнойКарты", ВидДисконтнойКарты);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СписокВидовКарт = Новый СписокЗначений;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокВидовКарт.Добавить(ВыборкаДетальныеЗаписи.ВидКарты);	
	КонецЦикла;
	
	Возврат СписокВидовКарт;

КонецФункции // ПолучитьВидыКартПоЗаменеДиксонтных()

&НаКлиенте
Процедура СогласиеНаОбработкуДанных(Команда)
	
	// сохранение ссылки на коллекцию прав, настроек и окружения
	Права = Неопределено;
	#Если Клиент Тогда
		Права = глПрава;
	#КонецЕсли
	
	СогласиеНаОбработкуПерсональныхДанныхДата = Объект.Дата;
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = Документы.DMS_ЗаменаКартЛояльности.ПолучитьМакетСогласия();
	
	СтруктураПредставления=Новый Структура(
		"ИНН,КПП,АдресЮридический,ТелефонРабочий",
		"ИНН ","КПП ","Адрес: ","тел.: "
	);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.КонтрагентНаименование	= Объект.Контрагент.НаименованиеПолное;
	ОбластьМакета.Параметры.КонтрагентАдрес			= киПолучитьПредставлениеКИ(Объект.Контрагент,Справочники.ВидыКонтактнойИнформации.АдресФактический);
	ОбластьМакета.Параметры.КонтрагентДокумент		= спПолучитьПодтверждающийДокументОбъектаПоВиду(Объект.Контрагент,Перечисления.ВидыДокументов.Паспорт);
	ОбластьМакета.Параметры.ОрганизацияНаименование	= спПолучитьПредставление(ПараметрыСеанса.Организация,Новый Структура("Наименование",""));
	ОбластьМакета.Параметры.ОрганизацияАдрес		= спПолучитьПредставление(ПараметрыСеанса.Организация,СтруктураПредставления);
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Согласие");
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.КонтрагентНаименование	= Объект.Контрагент.Наименование;
	ОбластьМакета.Параметры.СогласиеДата			= Формат(СогласиеНаОбработкуПерсональныхДанныхДата,"ДФ=dd.MM.yyyy");
	ТабДокумент.Вывести(ОбластьМакета);
	
	// Отобразить печатный документ на экране
	КлючУникальности	= Новый УникальныйИдентификатор();
	ФормаПечати			= ПолучитьОбщуюФорму("ПечатнаяФормаДокументов",,КлючУникальности);
	ТабличныйДокумент	= ФормаПечати.ЭлементыФормы.ТабличныйДокумент;
	ТабличныйДокумент.Защита			= обПраво("ЗащитаПечатныхФорм",Права);
	ТабличныйДокумент.ТолькоПросмотр	= обПраво("ОткрытиеПечатныхФормДокументовВРежимеПросмотра",Права);
	// Выведем печатную форму	
	ФормаПечати.ЭлементыФормы.ТабличныйДокумент.Вывести(ТабДокумент);
	// Заполним необходимые переменные и откроем форму
	ФормаПечати.Объект						= Объект.Контрагент.Ссылка;
	ФормаПечати.ОбъектПредставление			= Строка(Объект.Контрагент.Ссылка);
	ФормаПечати.ДополнительноКПредставлению	= "Согласие на обработку персональных данных";
	ФормаПечати.Открыть();
	
	Если Объект.Статус <> ПредопределенноеЗначение("Перечисление.DMS_СтатусЗаменыКарт.Согласован") Тогда
		
		Объект.Статус = ПредопределенноеЗначение("Перечисление.DMS_СтатусЗаменыКарт.Согласован");
		Модифицированность = Истина;
		
	КонецЕсли; 
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.DMS_СтатусЗаменыКарт.НаОзнакомлении") Тогда
		Элементы.Статус.ТолькоПросмотр = Истина;
	КонецЕсли; 
	
КонецПроцедуры
