Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Для Каждого РесурсРегистра Из Метаданные.РегистрыСведений.НастройкаМежскладскихПеремещений.Ресурсы Цикл
			
			Если НЕ ЗначениеЗаполнено(Запись[РесурсРегистра.Имя]) Тогда
				Отказ = Истина;
				Сообщить("Не заполнено значение ресурса " + РесурсРегистра.Синоним + ". Запись невозможна!");
			Иначе 
				Если РесурсРегистра.Имя = "ПутьКФайлуЛогаРаботы" Тогда
					Файл = Новый Файл(Запись[РесурсРегистра.Имя]);
					Отказ = НЕ (Файл.Существует() И Файл.ЭтоКаталог());
					Если Отказ Тогда
						Сообщить("Не верно указан путь к каталогу логов работы обработки! Запись не возможна!");
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	                                                                  
КонецПроцедуры
