// Модуль документа ПоступлениеАвтомобилей

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования
Перем ИмяРеквизитаКода Экспорт;     // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/артикула в ТЧ

Перем ТекущаяВалютаДокумента Экспорт; // Текущая валюта документа
Перем ТекущийКурсДокумента Экспорт;   // Текущий курс валюты документа

//Бондаренко++ 20230202
Перем ДеньСКоторогоНуженВидАвто Экспорт; 
//Бондаренко-- 20230202

//Иванченко 20260121 ++
//Дата новой догики продажи авто по цепочке документов ОАБР -> Реализация 
Перем ДеньЗет Экспорт;
//Иванченко 20260121 --
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Проверка наличия других заказов на автомобиль с данным VINом
//
// Параметры
//  VINАвтомобиля  – <Строка> – VIN автомобиля, заказы на который проверяются
//  ОбъектПроверки  – <ДокументОбъект> – Документ, который проверяет наличие заказов
//
// Возвращаемое значение:
//   <Булево>   – Заказов на данный автомобиль нет
//
Функция ПроверитьЗаказыНаАвтомобиль()
	ДокументОбъектСтруктура=Новый Структура();
	ДокументОбъектСтруктура.Вставить("Ссылка",Ссылка);
	ДокументОбъектСтруктура.Вставить("МоментВремени",МоментВремени());
	Если ТипЗнч(РезультатОбработки) = Тип("ОбработкаОбъект.ИнформационноеПоле") Тогда
		СтрокаСообщений="";
		Рез=зфЗащищенныеФункцииСервер.ПоступлениеАвтомобилейПроверитьЗаказыНаАвтомобиль(ДокументОбъектСтруктура,СтрокаСообщений);
		Если НЕ ПустаяСтрока(СтрокаСообщений) Тогда
			Для НомерСтроки=1 По СтрЧислоСтрок(СтрокаСообщений) Цикл
				СообщениеПользователю=СтрПолучитьСтроку(СтрокаСообщений,НомерСтроки);
				РезультатОбработки.ДобавитьСтрокуСообщения(СообщениеПользователю,"Важное",Неопределено,Неопределено);
			КонецЦикла; 
		КонецЕсли; 
	Иначе
		Рез=зфЗащищенныеФункцииСервер.ПоступлениеАвтомобилейПроверитьЗаказыНаАвтомобиль(ДокументОбъектСтруктура,РезультатОбработки);
	КонецЕсли;
	Возврат Рез;
КонецФункции // ПроверитьЗаказыНаАвтомобиль()

// Функция производит поиск заказа по заданному автомобилю
Функция НайтиЗаказАвтомобиля(Автомобиль) Экспорт
	ДокументОбъектСтруктура=Новый Структура();
	ДокументОбъектСтруктура.Вставить("ЭтоНовый",ЭтоНовый());
	ДокументОбъектСтруктура.Вставить("МоментВремени",МоментВремени());
	Возврат зфЗащищенныеФункцииСервер.ПоступлениеАвтомобилейНайтиЗаказАвтомобиля(ДокументОбъектСтруктура,Автомобиль);
КонецФункции

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	// Обязательные поля таблицы товаров
	ОбязательныеАвтомобили=Новый Структура();
	ОбязательныеАвтомобили.Вставить("VIN",        3);
	ОбязательныеАвтомобили.Вставить("Автомобиль", 3);
	ОбязательныеАвтомобили.Вставить("ИдентификаторАвтомобиля",1);
	ОбязательныеАвтомобили.Вставить("Количество", 1);
	ОбязательныеОпции=Новый Структура();
	ОбязательныеОпции.Вставить("ИдентификаторАвтомобиля",3);
	ОбязательныеОпции.Вставить("Опция",3);
	ОбязательныеОпции.Вставить("Количество",1);
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	ОбязательныеРеквизиты.Вставить("Автор",1);
	ОбязательныеРеквизиты.Вставить("ВалютаДокумента",1);
	ОбязательныеРеквизиты.Вставить("КурсДокумента",1);
	ОбязательныеРеквизиты.Вставить("СкладКомпании",1);
	ОбязательныеРеквизиты.Вставить("Контрагент",1);
	ОбязательныеРеквизиты.Вставить("ДоговорВзаиморасчетов",1);
	ОбязательныеРеквизиты.Вставить("ТипЦен",1);
	ОбязательныеРеквизиты.Вставить("ХозОперация",1);
	ОбязательныеРеквизиты.Вставить("Автомобили",ОбязательныеАвтомобили);
	ОбязательныеРеквизиты.Вставить("Опции",ОбязательныеОпции);
	
	//Бондаренко++ 20180522
	ОбязательныеРеквизиты.Вставить("Менеджер",1);
	//Бондаренко-- 20180522
	
	ОбязательныеРеквизиты.Вставить("ВхДокНомер",1);
	ОбязательныеРеквизиты.Вставить("ВхДокДата",1);
	
	Возврат ОбязательныеРеквизиты;
КонецФункции

// Проверяет корректность заполнения объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	// Здесь могут быть определены дополнительные к стандартным обязательным реквизитам условия проверки
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	
	// Проведем проверку соответствия организации документа организациям некоторых реквизитов документа.
	// Такую проверку необходимо осуществлять, если баланс в системе ведется по организации,
	// или если установлен способ контроля корректности
	// договора и склада документа. Причем, если способ контроля выбран "Контроль по организации и подразделению", то
	// дополнительно осуществляется проверка соответствия подразделений.
	Если Результат Тогда
		СпособКонтроляКорректности = обПраво("КонтрольКорректностиДоговораИСкладаДокумента", Права,,ЭтотОбъект);	
		КонтрольОтсутствует        = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольОтсутствует);
		БалансВедетсяПоОрганизации = (Константы.СпособВеденияБаланса.Получить()=Перечисления.СпособВеденияБаланса.ПоОрганизации);
		
		Если БалансВедетсяПоОрганизации Или Не КонтрольОтсутствует Тогда
			КонтрольПоПодразделению = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольПоОрганизацииИПодразделению);
			
			КонтролируемыеРеквизиты = Новый Структура();
			
			КонтролируемыеРеквизитыШапки = Новый Структура();
			КонтролируемыеРеквизитыШапки.Вставить("СкладКомпании",         КонтрольПоПодразделению);
			Если ХозОперация <> Справочники.ХозОперации.ПоступлениеАвтомобилей и ХозОперация <> Справочники.ХозОперации.ПереходВСобственностьАвтомобилей  тогда
				
				КонтролируемыеРеквизитыШапки.Вставить("ДоговорВзаиморасчетов", КонтрольПоПодразделению);
			КонецЕсли;
			
			КонтролируемыеРеквизиты.Вставить("КонтролируемыеРеквизитыШапки",КонтролируемыеРеквизитыШапки);		
			
			Результат = дкПроверитьКорректностьПоОрганизации(ЭтотОбъект,КонтролируемыеРеквизиты,Ошибки) и Результат;
		КонецЕсли;  		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Функция проверяет, допустимо ли изменение объекта
// Возвращает Истина, если изменения возможны, ложь иначе
// Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов,
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
	// Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции

// Возвращает список возможных хозяйственных операций документа
// Возвращаемое значение: СписокЗначений. 
// Строка списка: Значение - имя предопределенного элемента; 
//				  Представление - красивое его представление
// 				  "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("ПоступлениеАвтомобилей","Поступление автомобилей",Истина);
	СписокХозОпераций.Добавить("ПоступлениеАвтомобилейКомиссия","Поступление автомобилей (комиссия)");
	СписокХозОпераций.Добавить("ПоступлениеАвтомобилейОтветственноеХранение","Поступление автомобилей (ответственное хранение)");
	СписокХозОпераций.Добавить("ПереходВСобственностьАвтомобилей","Переход автомобилей в собственность (с ответственного хранения)");
	
	Возврат СписокХозОпераций;
КонецФункции

// возвращает выборку по шапке
// ДокументСсылка - Ссылка на документ для которого получаем шапку
Функция ПолучитьШапкуДокумента(ДокументСсылка) Экспорт
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата,
	|	Док.ВалютаДокумента КАК ВалютаДокумента,
	|	Док.КурсДокумента КАК КурсДокумента,
	|	Док.ТипЦен КАК ТипЦен,
	|	Док.ХозОперация КАК ХозОперация,
	|	Док.КурсВалютыУпр КАК КурсВалютыУпр,
	|	Док.КурсВалютыВзаиморасчетов КАК КурсВалютыВзаиморасчетов,
	|	Док.МоментВремени КАК МоментВремени,
	|	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
	/////////// ПРИВАТ ////////////
	|	Док.СкладКомпании КАК СкладКомпании,
	|	Док.Контрагент КАК Контрагент,
	|	Док.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов
	|
	|ИЗ
	|	Документ.ПоступлениеАвтомобилей КАК Док
	|
	|ГДЕ
	|	Док.Ссылка=&Ссылка
	|");
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	Выборка=Запрос.Выполнить().Выбрать(); Выборка.Следующий();
	
	Возврат Выборка;
КонецФункции

// функция возвращает список опций для текущего набора модели или варианта комплектации
Функция ПолучитьСписокДоступныхОпций(Модель, ВариантКомплектации = Неопределено) Экспорт
	СписокОборудования=Новый СписокЗначений;
	Запрос = Новый Запрос;
	Если обЗначениеНеЗаполнено(ВариантКомплектации) Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	МоделиОпции.Опция КАК Опция
		|ИЗ
		|	Справочник.Модели.Опции КАК МоделиОпции
		|ГДЕ
		|	МоделиОпции.Ссылка = &Модель";
		Запрос.УстановитьПараметр("Модель", Модель);
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		|	ОпцииВариантовКомплектации.Опция КАК Опция
		|ИЗ
		|	РегистрСведений.ОпцииВариантовКомплектации КАК ОпцииВариантовКомплектации
		|ГДЕ
		|	ОпцииВариантовКомплектации.ВариантКомплектации = &ВариантКомплектации
		|	И ОпцииВариантовКомплектации.ВидВключения = 1
		|";
		Запрос.УстановитьПараметр("ВариантКомплектации",ВариантКомплектации);
	КонецЕсли;
	СписокОборудования.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Опция"));
	Возврат СписокОборудования
КонецФункции

// Расчет суммы документа
Функция РассчитатьСуммуВсего()Экспорт
	Возврат Автомобили.Итог("СуммаВсего")+Опции.Итог("СуммаВсего");
КонецФункции

//Бондаренко-- 20210122
Функция НайтиПодрДопОборудования(Подр)
	
	ПодразделениеПустое = Справочники.ПодразделенияКомпании.ПустаяСсылка();
	
	Если Не обЗначениеНеЗаполнено(Подр.ПодразделениеДОиВР) Тогда
		Возврат Подр.ПодразделениеДОиВР;
	ИначеЕсли Не обЗначениеНеЗаполнено(Подр.Родитель.ПодразделениеДОиВР) Тогда	
		Возврат Подр.Родитель.ПодразделениеДОиВР;
	ИначеЕсли Не обЗначениеНеЗаполнено(Подр.Родитель.Родитель.ПодразделениеДОиВР) Тогда	
		Возврат Подр.Родитель.Родитель.ПодразделениеДОиВР;
	Иначе
		Возврат ПодразделениеПустое;
	КонецЕсли; 
	
КонецФункции // НайтиПодразделениеДопОборудования(Подр)
//Бондаренко-- 20210122


// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка			– Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	– Форма				– Ссылка на форму документа. Если значение неопределено,
//									  производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	// ОБРАБОТКА РЕКВИЗИТОВ ДОКУМЕНТА
	//Бондаренко++ 20200122
	Если Имя="ПодразделениеКомпании" Тогда
		Если ЭтоНовый() Тогда
			Попытка
				ЭтотОбъект.ПодразделениеДОиВР = НайтиПодрДопОборудования(ПодразделениеКомпании);
			Исключение
				//			
			КонецПопытки; 			
		КонецЕсли; 
		//Бондаренко 20200122	
	ИначеЕсли Имя="ВалютаДокумента" Тогда
		Попытка
			ТребуетсяПересчет=ДопПараметры.ТребуетсяПересчет;
		Исключение
			ТребуетсяПересчет=Ложь;
		КонецПопытки; 
		Рез=Истина;
		Если ТребуетсяПересчет И (НЕ обЗначениеНеЗаполнено(ТекущаяВалютаДокумента)) Тогда
			Для каждого СтрокаТЧ Из Автомобили Цикл
				НоваяЦена=обПересчет(СтрокаТЧ.Цена,ТекущаяВалютаДокумента,ТекущийКурсДокумента,ВалютаДокумента,КурсДокумента);
				Если НоваяЦена<>СтрокаТЧ.Цена Тогда
					СтрокаТЧ.Цена=НоваяЦена;
					Рез=ОбработкаРеквизита("Автомобили.Цена",СтрокаТЧ,ЭтаФорма,ДопПараметры) И Рез;
				КонецЕсли;
			КонецЦикла; 
			Для каждого СтрокаТЧ Из Опции Цикл
				НоваяЦена=обПересчет(СтрокаТЧ.Цена,ТекущаяВалютаДокумента,ТекущийКурсДокумента,ВалютаДокумента,КурсДокумента);
				Если НоваяЦена<>СтрокаТЧ.Цена Тогда
					СтрокаТЧ.Цена=НоваяЦена;
					Рез=ОбработкаРеквизита("Опции.Цена",СтрокаТЧ,ЭтаФорма,ДопПараметры) И Рез;
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли; 
		ТекущаяВалютаДокумента=ВалютаДокумента;
		ТекущийКурсДокумента=КурсДокумента;
		Возврат Рез;
	ИначеЕсли Имя = "ТипЦен" Тогда
		
		ТребуетсяПересчет = Истина;
		Если ДопПараметры <> Неопределено Тогда
			Если НЕ ДопПараметры.Свойство("ТребуетсяПересчет",ТребуетсяПересчет) Тогда
				ТребуетсяПересчет = Истина;
			КонецЕсли; 
		КонецЕсли; 
		
		// пересчитываем
		Если ТребуетсяПересчет Тогда
			Для Каждого СтрокаАвтомобиля Из Автомобили Цикл
				
				ЗаказНаАвтомобиль   = СтрокаАвтомобиля.ЗаказНаАвтомобиль;
				//Если ЗначениеЗаполнено(ЗаказНаАвтомобиль) И ЗаказНаАвтомобиль.ХозОперация = Справочники.ХозОперации.ЗаказАвтомобиляНаСклад Тогда
				СтрокаАвтомобиля.Цена = ЗаказНаАвтомобиль.ЦенаАвтомобиля;
				//Иначе
				//	СтрокаАвтомобиля.Цена = 0;
				//КонецЕсли;
				
				Если СтрокаАвтомобиля.Цена=0 Тогда
					СтрокаАвтомобиля.Цена = обПолучитьЦену(ТипЦен, Новый Структура("Автомобиль,ВариантКомплектации", СтрокаАвтомобиля.Автомобиль, Справочники.ВариантыКомплектации.ПустаяСсылка()), ?(Ссылка.Пустая(), Дата, МоментВремени()), , ТекущаяВалютаДокумента, ТекущийКурсДокумента);
				КонецЕсли;
				ОбработкаРеквизита("Автомобили.Цена", СтрокаАвтомобиля, ЭтаФорма, ДопПараметры);
				
				НайденныеОпции      = Опции.НайтиСтроки(Новый Структура("ИдентификаторАвтомобиля", СтрокаАвтомобиля.ИдентификаторАвтомобиля));
				Модель              = СтрокаАвтомобиля.Автомобиль.Модель;
				ВариантКомплектации = СтрокаАвтомобиля.Автомобиль.ВариантКомплектации;
				
				//ПоискОпцийВЗаказе = (ЗначениеЗаполнено(ЗаказНаАвтомобиль) И ЗаказНаАвтомобиль.ХозОперация = Справочники.ХозОперации.ЗаказАвтомобиляНаСклад);
				Для Каждого СтрокаОпции Из НайденныеОпции Цикл
					
					ОпцияИзЗаказа=Неопределено;
					//Если ПоискОпцийВЗаказе Тогда
					ОпцияИзЗаказа = ЗаказНаАвтомобиль.Опции.Найти(СтрокаОпции.Опция, "Опция");
					Если ОпцияИзЗаказа<>Неопределено Тогда
						СтрокаОпции.Цена=ОпцияИзЗаказа.Цена;
					Иначе
						СтрокаОпции.Цена = 0;
					КонецЕсли;
					//Иначе
					//	СтрокаОпции.Цена = 0;
					//КонецЕсли;
					Если СтрокаОпции.Цена=0 Тогда
						СтрокаОпции.Цена = обПолучитьЦену(ТипЦен, Новый Структура("Автомобиль, ВариантКомплектации, Опция", Модель, ВариантКомплектации, СтрокаОпции.Опция),?(Ссылка.Пустая(), Дата, МоментВремени()),, ТекущаяВалютаДокумента, ТекущийКурсДокумента);
					КонецЕсли;
					ОбработкаРеквизита("Опции.Цена", СтрокаОпции, ЭтаФорма, ДопПараметры);
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли Имя="Контрагент" Тогда
		Если ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилейКомиссия Тогда
			//Параметры для подстановки или создания договора контрагента
			Если ДопПараметры=Неопределено Тогда ДопПараметры=Новый Структура; КонецЕсли; 
			ДопПараметры.Вставить("ВидДоговора",Перечисления.ВидыДоговоров.СКомитентом);
			ДопПараметры.Вставить("ТипЦенПокупки",ТипЦен);
			ДопПараметры.Вставить("ТипЦенПродажи",Справочники.ТипыЦен.ПустаяСсылка());
		КонецЕсли; 
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Возврат Рез;
		
	ИначеЕсли Имя="ДоговорВзаиморасчетов" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		// проверим вид договора
		Если ДоговорВзаиморасчетов.Пустая() Тогда
		Иначе
			НеверныйДоговор=Ложь;
			Если ХозОперация=Справочники.ХозОперации.ПоступлениеАвтомобилейКомиссия Тогда
				Если ДоговорВзаиморасчетов.ВидДоговора<>Перечисления.ВидыДоговоров.СКомитентом И
					ДоговорВзаиморасчетов.ВидДоговора<>Перечисления.ВидыДоговоров.Прочее Тогда
					НеверныйДоговор=Истина;
				КонецЕсли; 
			Иначе
				Если ДоговорВзаиморасчетов.ВидДоговора<>Перечисления.ВидыДоговоров.Покупка И
					ДоговорВзаиморасчетов.ВидДоговора<>Перечисления.ВидыДоговоров.Прочее Тогда
					НеверныйДоговор=Истина;
				КонецЕсли; 
			КонецЕсли;
			Если НеверныйДоговор Тогда
				#Если Клиент Тогда
					Предупреждение("Неправильный вид договора !");
				#КонецЕсли
				ДоговорВзаиморасчетов=Неопределено;
				ОбработкаРеквизита("ДоговорВзаиморасчетов",ТекСтрока,ЭтаФорма,ДопПараметры);
				Возврат Ложь;
			КонецЕсли; 
		КонецЕсли;
		Возврат Рез;
		
	ИначеЕсли Имя="СкладКомпании" Тогда
		Если НЕ обЗначениеНеЗаполнено(СкладКомпании) Тогда
			Если СкладКомпании.Розничный Тогда
				#Если Клиент Тогда
					Предупреждение("Выбранный склад: """ + СкладКомпании + """ является розничным!
					|Выберите оптовый склад",10);
				#КонецЕсли
				СкладКомпании = Неопределено;
			КонецЕсли;
			//Бондаренко++ 20180319
			Если СкладКомпании.ТипСклада <> Перечисления.ТипыСкладов.Автомобильный Тогда
				#Если Клиент Тогда
					Предупреждение("Выбранный склад: """ + СкладКомпании + """ не является автомобильным!
					|Выберите автомобильный склад",10);
				#КонецЕсли
				СкладКомпании = Неопределено;
			КонецЕсли;
			//Бондаренко-- 20180319
		КонецЕсли; 
		Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		
		// ОБРАБОТКА РЕКВИЗИТОВ ТАБЛИЧНОЙ ЧАСТИ "АВТОМОБИЛИ"
	ИначеЕсли Имя="Автомобили.Автомобиль" Тогда
		//Проставим количество и цену
		Если ТекСтрока.Количество=0 Тогда
			ТекСтрока.Количество=1
		КонецЕсли;
		
		// проверим заметик
		#Если Клиент Тогда
			дкСообщитьОЗаметках(ЭтотОбъект,ТекСтрока.Автомобиль,ЭтаФорма);
		#КонецЕсли
		// Заполним ставку НДС
		Если обЗначениеНеЗаполнено(ТекСтрока.СтавкаНДС) Тогда
			Если НЕ обЗначениеНеЗаполнено(Контрагент) И Контрагент.ОсвобожденОтНДС Тогда
				Запрос=Новый Запрос("
				|ВЫБРАТЬ ПЕРВЫЕ 1 СпрСтавкиНДС.Ссылка КАК СтавкаБезНДС
				|ИЗ Справочник.СтавкиНДС КАК СпрСтавкиНДС
				|ГДЕ СпрСтавкиНДС.Ставка=0");
				РезультатСтавкаБезНДС=Запрос.Выполнить();
				Если РезультатСтавкаБезНДС.Пустой() Тогда
					ТекСтрока.СтавкаНДС=Неопределено;
				Иначе
					ТекСтрока.СтавкаНДС=РезультатСтавкаБезНДС.Выгрузить().Получить(0).СтавкаБезНДС;
				КонецЕсли;
			Иначе
				ТекСтрока.СтавкаНДС=Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
			КонецЕсли;
		КонецЕсли;
		Если НЕ ПустаяСтрока(ТекСтрока.Автомобиль.VIN) Тогда
			ТекСтрока.VIN = ТекСтрока.Автомобиль.VIN;
		КонецЕсли;
		ТекСтрока.Цена = обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль,ВариантКомплектации",ТекСтрока.Автомобиль,Справочники.ВариантыКомплектации.ПустаяСсылка()),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
		ОбработкаРеквизита("Автомобили.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		//Попробуем подставить ГТД
		Если обЗначениеНеЗаполнено(ТекСтрока.ГТД) Тогда
			ИндексПредСтроки=Автомобили.Индекс(ТекСтрока)-1;
			Если ИндексПредСтроки>=0 Тогда
				ПредСтрока=Автомобили.Получить(ИндексПредСтроки);
				Если НЕ обЗначениеНеЗаполнено(ПредСтрока.ГТД) Тогда
					ТекСтрока.ГТД=ПредСтрока.ГТД;
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли;
		
		//Бондаренко++ 20240919
		Если Не обЗначениеНеЗаполнено(ТекСтрока.Автомобиль) Тогда
			ВидАвтомобиля = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ТекСтрока.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля, ТекущаяДата());
			Если НЕ обЗначениеНеЗаполнено(ВидАвтомобиля) Тогда
				Если ( ВидАвтомобиля = Перечисления.ВидАвтомобиля.ТестовыйАвтомобиль ) ИЛИ ( ВидАвтомобиля = Перечисления.ВидАвтомобиля.ПодменныйАвтомобиль ) Тогда
					ТекСтрока.ВидАвтомобиля = ВидАвтомобиля;
					ТекСтрока.АвтомобильНовый = Истина;
					ТекСтрока.АвтомобильБУ = Ложь;
					ТекСтрока.ПараллельныйИмпорт = Ложь;
				КонецЕсли;
			КонецЕсли;
			//Бондаренко++ 20251023
			ГаражныйНомер_ = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ТекСтрока.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГаражныйНомер, ТекущаяДата());
			Если Не обЗначениеНеЗаполнено(ГаражныйНомер_) Тогда
				ТекСтрока.ГаражныйНомер = ГаражныйНомер_;
			КонецЕсли;
			//Бондаренко-- 20251023
		КонецЕсли;	
		//Бондаренко-- 20240919 
		
		Если ЗначениеЗаполнено(ТекСтрока.Автомобиль) Тогда
			Заказ=НайтиЗаказАвтомобиля(ТекСтрока.Автомобиль);
			ТекСтрока.ЗаказНаАвтомобиль=Заказ;
			Рез = ОбработкаРеквизита("Автомобили.ЗаказНаАвтомобиль",ТекСтрока,ЭтаФорма,ДопПараметры);
			Если НЕ Заказ = Неопределено Тогда
				Возврат Рез;
			КонецЕсли;
			
			//Бондаренко++ 20230119
			//ТекСтрока.АвтомобильБУ = (Контрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель);
			Если ТекСтрока.АвтомобильБУ Тогда
				ТекСтрока.АвтомобильНовый=Ложь;   
				ТекСтрока.ПараллельныйИмпорт=Ложь;
			КонецЕсли; 
			Если ТекСтрока.АвтомобильНовый Тогда
				ТекСтрока.АвтомобильБУ = Ложь;
				ТекСтрока.ПараллельныйИмпорт=Ложь;
			КонецЕсли;
			Если ТекСтрока.ПараллельныйИмпорт Тогда
				ТекСтрока.АвтомобильНовый = Ложь;
				ТекСтрока.АвтомобильБУ=Ложь;
			КонецЕсли;
			//Бондаренко-- 20230119
			
			// запишем опции уже имеющиеся на регистре комплектации
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	КомплектацияАвтомобилейОстатки.Номенклатура КАК Опция,
			|	КомплектацияАвтомобилейОстатки.КоличествоОстаток КАК Количество
			|ИЗ
			|	РегистрНакопления.КомплектацияАвтомобилей.Остатки КАК КомплектацияАвтомобилейОстатки
			|ГДЕ
			|	КомплектацияАвтомобилейОстатки.Номенклатура ССЫЛКА Справочник.Опции
			|	И КомплектацияАвтомобилейОстатки.Автомобиль = &Автомобиль";
			Запрос.УстановитьПараметр("Автомобиль", ТекСтрока.Автомобиль);
			ОпцииЗаказа = Запрос.Выполнить().Выгрузить();
			
			Если ОпцииЗаказа.Количество() > 0 Тогда
				// очистим опции текущего автомобиля
				ОпцииТекущегоАвтомобиля = Опции.НайтиСтроки(Новый Структура("ИдентификаторАвтомобиля", ТекСтрока.ИдентификаторАвтомобиля));
				Для Каждого СтрокаОпций Из ОпцииТекущегоАвтомобиля Цикл
					Опции.Удалить(СтрокаОпций);
				КонецЦикла;
			КонецЕсли;
			
			Для Каждого ОпцияЗаказа Из ОпцииЗаказа Цикл
				ОпцииТекущегоАвтомобиля=Опции.Добавить();
				ОпцииТекущегоАвтомобиля.ИдентификаторАвтомобиля=ТекСтрока.ИдентификаторАвтомобиля;
				ОпцииТекущегоАвтомобиля.Опция=ОпцияЗаказа.Опция;
				ОпцииТекущегоАвтомобиля.Количество=ОпцияЗаказа.Количество;
				ОбработкаРеквизита("Опции.Опция",ОпцииТекущегоАвтомобиля,ЭтаФорма);
			КонецЦикла;
		КонецЕсли;
		
		//получим список доступных опций
		Если обЗначениеНеЗаполнено(ТекСтрока.Автомобиль) Тогда
			Модель = Справочники.Модели.ПустаяСсылка();
			Вариант = Неопределено;
		Иначе
			Модель = ТекСтрока.Автомобиль.Модель;
			Вариант = ТекСтрока.Автомобиль.ВариантКомплектации;
		КонецЕсли;
		
		СписокДостОпций = ПолучитьСписокДоступныхОпций(Модель,Вариант);
		//получим опции автомобиля
		МассивОпций = Опции.НайтиСтроки(Новый Структура("ИдентификаторАвтомобиля",ТекСтрока.ИдентификаторАвтомобиля));
		
		//найдем опции для удаления
		МассивДляУдаления = Новый Массив;
		Для Каждого стрОпций Из МассивОпций Цикл
			Если СписокДостОпций.НайтиПоЗначению(стрОпций.Опция) = Неопределено Тогда
				МассивДляУдаления.Добавить(стрОпций);
			КонецЕсли;
		КонецЦикла;
		
		//удаление опций из списка
		Для Каждого стрУдалить Из МассивДляУдаления Цикл
			Опции.Удалить(стрУдалить);
		КонецЦикла;
		
		//Бондаренко++ 20230119
		Если ТекСтрока.АвтомобильБУ Тогда
			ТекСтрока.АвтомобильНовый=Ложь;   
			ТекСтрока.ПараллельныйИмпорт=Ложь;
		КонецЕсли; 
		Если ТекСтрока.АвтомобильНовый Тогда
			ТекСтрока.АвтомобильБУ = Ложь;
			ТекСтрока.ПараллельныйИмпорт=Ложь;
		КонецЕсли;
		Если ТекСтрока.ПараллельныйИмпорт Тогда
			ТекСтрока.АвтомобильНовый = Ложь;
			ТекСтрока.АвтомобильБУ=Ложь;
		КонецЕсли;
		//Бондаренко-- 20230119
		
		Возврат Истина;
		
	ИначеЕсли Имя="Автомобили.Цена" Тогда
		ТекСтрока.Сумма=ТекСтрока.Цена*ТекСтрока.Количество;
		ЦенаВключаетНДС=?(обЗначениеНеЗаполнено(ТипЦен),Истина,ТипЦен.ЦенаВключаетНДС);
		Если ЦенаВключаетНДС Тогда
			//Цена уже содержит НДС - Сумма всего равна сумме
			ТекСтрока.СуммаВсего=ТекСтрока.Сумма;
			СуммаБезНДС=(100*ТекСтрока.СуммаВсего)/(100+ТекСтрока.СтавкаНДС.Ставка);
			ТекСтрока.СуммаНДС=ТекСтрока.СуммаВсего-СуммаБезНДС;
		Иначе
			//НДС в цену не включен - Получим сумму НДС
			ТекСтрока.СуммаНДС=(ТекСтрока.Сумма*ТекСтрока.СтавкаНДС.Ставка)/100;
			ТекСтрока.СуммаВсего=ТекСтрока.Сумма+ТекСтрока.СуммаНДС;
		КонецЕсли;
		Возврат Истина;
		
	ИначеЕсли Имя="Автомобили.Сумма" Тогда
		ТекСтрока.Цена=ТекСтрока.Сумма/?(ТекСтрока.Количество=0,1,ТекСтрока.Количество);
		ЦенаВключаетНДС=?(обЗначениеНеЗаполнено(ТипЦен),Истина,ТипЦен.ЦенаВключаетНДС);
		Если ЦенаВключаетНДС Тогда
			//Цена уже содержит НДС - Сумма всего равна сумме
			ТекСтрока.СуммаВсего=ТекСтрока.Сумма;
			СуммаБезНДС=(100*ТекСтрока.СуммаВсего)/(100+ТекСтрока.СтавкаНДС.Ставка);
			ТекСтрока.СуммаНДС=ТекСтрока.СуммаВсего-СуммаБезНДС;
		Иначе
			//НДС в цену не включен - Получим сумму НДС
			ТекСтрока.СуммаНДС=(ТекСтрока.Сумма*ТекСтрока.СтавкаНДС.Ставка)/100;
			ТекСтрока.СуммаВсего=ТекСтрока.Сумма+ТекСтрока.СуммаНДС;
		КонецЕсли;
		Возврат Истина;
		
	ИначеЕсли Имя="Автомобили.СуммаВсего" Тогда
		//Получим новую сумму НДС как процент от суммы всего
		ЦенаВключаетНДС=?(обЗначениеНеЗаполнено(ТипЦен),Истина,ТипЦен.ЦенаВключаетНДС);
		Если ЦенаВключаетНДС Тогда
			//Цена уже содержит НДС
			ТекСтрока.Сумма=ТекСтрока.СуммаВсего;
			СуммаБезНДС=(100*ТекСтрока.СуммаВсего)/(100+ТекСтрока.СтавкаНДС.Ставка);
			ТекСтрока.СуммаНДС=ТекСтрока.СуммаВсего-СуммаБезНДС;
		Иначе
			//НДС в цену не включен
			ТекСтрока.Сумма=(100*ТекСтрока.СуммаВсего)/(100+ТекСтрока.СтавкаНДС.Ставка);
			ТекСтрока.СуммаНДС=ТекСтрока.СуммаВсего-ТекСтрока.Сумма;
		КонецЕсли; 
		ТекСтрока.Цена=ТекСтрока.Сумма/?(ТекСтрока.Количество=0,1,ТекСтрока.Количество);
		Возврат Истина;
		
	ИначеЕсли Имя="Автомобили.СтавкаНДС" Тогда
		Возврат ОбработкаРеквизита("Автомобили.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Автомобили.СуммаНДС" Тогда
		Возврат Истина;
		
	ИначеЕсли Имя="Автомобили.АвтомобильБезЗаказа" Тогда
		Рез=Истина;
		Если ТекСтрока.АвтомобильБезЗаказа Тогда
			Если НЕ обЗначениеНеЗаполнено(ТекСтрока.ЗаказНаАвтомобиль) Тогда
				ТекСтрока.ЗаказНаАвтомобиль=Неопределено;
				Рез=ОбработкаРеквизита("Автомобили.ЗаказНаАвтомобиль",ТекСтрока,ЭтаФорма,ДопПараметры);
			КонецЕсли; 
		КонецЕсли; 
		Возврат Рез;
		
	ИначеЕсли Имя="Автомобили.ЗаказНаАвтомобиль" Тогда
		ЗаказНаАвтомобиль = ТекСтрока.ЗаказНаАвтомобиль;
		Если ЗначениеЗаполнено(ЗаказНаАвтомобиль) Тогда
			// очистим опции текущего автомобиля
			ОпцииТекущегоАвтомобиля = Опции.НайтиСтроки(Новый Структура("ИдентификаторАвтомобиля", ТекСтрока.ИдентификаторАвтомобиля));
			Для Каждого СтрокаОпций Из ОпцииТекущегоАвтомобиля Цикл
				Опции.Удалить(СтрокаОпций);
			КонецЦикла;
			//Если ЗаказНаАвтомобиль.ХозОперация = Справочники.ХозОперации.ЗаказАвтомобиляНаСклад Тогда
			ЦенаАвтомобиля = ЗаказНаАвтомобиль.ЦенаАвтомобиля;
			//Иначе
			//	ЦенаАвтомобиля = 0;
			//КонецЕсли;
			Если ЦенаАвтомобиля<>0 Тогда
				ТекСтрока.Цена      = ЦенаАвтомобиля;
				ТекСтрока.СтавкаНДС = ЗаказНаАвтомобиль.СтавкаНДСНаАвтомобиль;
				ОбработкаРеквизита("Автомобили.Цена", ТекСтрока, ЭтаФорма,ДопПараметры);
			КонецЕсли;
			ОпцииЗаказа = ЗаказНаАвтомобиль.Опции;
			Для Каждого ОпцияЗаказа Из ОпцииЗаказа Цикл
				ОпцииТекущегоАвтомобиля=Опции.Добавить();
				ОпцииТекущегоАвтомобиля.ИдентификаторАвтомобиля=ТекСтрока.ИдентификаторАвтомобиля;
				ОпцииТекущегоАвтомобиля.Опция=ОпцияЗаказа.Опция;
				ОпцииТекущегоАвтомобиля.Количество=ОпцияЗаказа.Количество;
				ОбработкаРеквизита("Опции.Опция",ОпцииТекущегоАвтомобиля,ЭтаФорма);
			КонецЦикла; 
			ТекСтрока.АвтомобильБезЗаказа = Ложь;
		Иначе
			//Если НЕ обЗначениеНеЗаполнено(ТекСтрока.ЗаказНаАвтомобиль) Тогда
			ТекСтрока.АвтомобильБезЗаказа = Истина;
		КонецЕсли;
		Возврат Истина;
		
		//Бондаренко++ 20230119	
	ИначеЕсли Имя="Автомобили.АвтомобильБУ" Тогда
		АвтомобильБУ = ТекСтрока.АвтомобильБУ;
		Если АвтомобильБУ Тогда
			ТекСтрока.АвтомобильНовый=Ложь;
			ТекСтрока.ПараллельныйИмпорт=Ложь;
		КонецЕсли;
		Возврат Истина;
	ИначеЕсли Имя="Автомобили.АвтомобильНовый" Тогда
		АвтомобильНовый = ТекСтрока.АвтомобильНовый;
		Если АвтомобильНовый Тогда
			ТекСтрока.АвтомобильБУ=Ложь;
			ТекСтрока.ПараллельныйИмпорт=Ложь;
		КонецЕсли;
		Возврат Истина;
	ИначеЕсли Имя="Автомобили.ПараллельныйИмпорт" Тогда
		ПараллельныйИмпорт = ТекСтрока.ПараллельныйИмпорт;
		Если ПараллельныйИмпорт Тогда
			ТекСтрока.АвтомобильБУ=Ложь;
			ТекСтрока.АвтомобильНовый=Ложь;
		КонецЕсли;
		Возврат Истина;
		//Бондаренко-- 20230119		
		
		// ОБРАБОТКА РЕКВИЗИТОВ ТАБЛИЧНОЙ ЧАСТИ "ДОПОЛНИТЕЛЬНЫЕ ОПЦИИ"
	ИначеЕсли Имя="Опции.Опция" Тогда
		СтрокаАвтомобиля=Автомобили.Найти(ТекСтрока.ИдентификаторАвтомобиля,"ИдентификаторАвтомобиля");
		Если СтрокаАвтомобиля=Неопределено Тогда
			//Автомобиль не найден, значит и опций нет
			Если НЕ обЗначениеНеЗаполнено(ТекСтрока.Опция) Тогда
				ТекСтрока.Опция=Неопределено;
				Возврат ОбработкаРеквизита("Опции.Опция",ТекСтрока,ЭтаФорма,ДопПараметры);
			КонецЕсли; 
		КонецЕсли;
		Автомобиль=СтрокаАвтомобиля.Автомобиль;
		ЗаказНаАвтомобиль = СтрокаАвтомобиля.ЗаказНаАвтомобиль;
		Если обЗначениеНеЗаполнено(Автомобиль) И обЗначениеНеЗаполнено(ЗаказНаАвтомобиль) Тогда
			//Автомобиль и заказ не прописан, значит и опций нет
			Если НЕ обЗначениеНеЗаполнено(ТекСтрока.Опция) Тогда
				ТекСтрока.Опция=Неопределено;
				Возврат ОбработкаРеквизита("Опции.Опция",ТекСтрока,ЭтаФорма,ДопПараметры);
			КонецЕсли; 
		КонецЕсли;
		НаборОпций=Ложь;
		Если ДопПараметры<>Неопределено Тогда
			Если НЕ ДопПараметры.Свойство("НаборОпций",НаборОпций) Тогда
				НаборОпций=Ложь;
			КонецЕсли; 
		КонецЕсли; 
		Если (НЕ НаборОпций) И (НЕ обЗначениеНеЗаполнено(ТекСтрока.Опция)) Тогда
			Если ЗначениеЗаполнено(Автомобиль) Тогда
				ВариантКомплектации=Автомобиль.ВариантКомплектации;
				Модель=Автомобиль.Модель;
			ИначеЕсли ЗначениеЗаполнено(ЗаказНаАвтомобиль) Тогда
				ВариантКомплектации=ЗаказНаАвтомобиль.ВариантКомплектации;
				Модель=ЗаказНаАвтомобиль.Модель;
			Иначе
				ВариантКомплектации=Неопределено;
				Модель=Справочники.Модели.ПустаяСсылка();
			КонецЕсли; 
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Опция",ТекСтрока.Опция);
			Если обЗначениеНеЗаполнено(ВариантКомплектации) Тогда
				Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				|	МоделиОпции.Опция КАК Опция
				|ИЗ
				|	Справочник.Модели.Опции КАК МоделиОпции
				|ГДЕ
				|	МоделиОпции.Ссылка = &Модель
				|	И МоделиОпции.Опция = &Опция";
				Запрос.УстановитьПараметр("Модель", Модель);
			Иначе
				Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				|	ОпцииВариантовКомплектации.Опция КАК Опция
				|ИЗ
				|	РегистрСведений.ОпцииВариантовКомплектации КАК ОпцииВариантовКомплектации
				|ГДЕ
				|	ОпцииВариантовКомплектации.ВариантКомплектации = &ВариантКомплектации
				|	И ОпцииВариантовКомплектации.Опция = &Опция
				|	И ОпцииВариантовКомплектации.ВидВключения = 1";
				Запрос.УстановитьПараметр("ВариантКомплектации",ВариантКомплектации);
			КонецЕсли; 
			Если Запрос.Выполнить().Пустой() Тогда
				//Такой опции автомобиля нет
				Если ЗначениеЗаполнено(ТекСтрока.Опция) Тогда
					ТекСтрока.Опция=Неопределено;
					Возврат ОбработкаРеквизита("Опции.Опция",ТекСтрока,ЭтаФорма,ДопПараметры);
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
		Рез=Истина;
		Если ТекСтрока.Опция.ПризнакНабора Тогда
			// имеем дело с набором, разложим его...
			Набор=ТекСтрока.Опция; КоличествоНабора=ТекСтрока.Количество;
			Если КоличествоНабора=0 Тогда КоличествоНабора=1; КонецЕсли; 
			// удалим строку из табличной части
			Опции.Удалить(ТекСтрока);
			// теперь будем рекурсивно добавлять состав набора
			Если ДопПараметры=Неопределено Тогда
				ДопПараметры=Новый Структура;
			КонецЕсли;
			ДопПараметры.Вставить("НаборОпций",Истина);
			Для Каждого ИзНабора Из Набор.СоставНабора Цикл
				Если ИзНабора.Опция.ПризнакНабора Тогда
					//Вот это да, набор в наборе ... игнорируем
					#Если Клиент Тогда
						Сообщить("В наборе """+СокрЛП(Набор)+""" присутствует набор """+СокрЛП(ИзНабора.Опция)+""". Добавление набора """+СокрЛП(ИзНабора.Опция)+""" отменено.",СтатусСообщения.Внимание);
					#КонецЕсли
				Иначе
					// поищем оборудование из набора в таблице
					МассивСтрок=Опции.НайтиСтроки(Новый Структура("Опция",ИзНабора.Опция));
					Если МассивСтрок.Количество()>0 Тогда
						//Если добавляемое оборудование уже есть в табличной части
						//просто увеличим количество, если его запрашивать не надо
						СтрокаТЧ=МассивСтрок[0];
						СтрокаТЧ.Количество=СтрокаТЧ.Количество+(ИзНабора.Количество*КоличествоНабора);
						Рез=ОбработкаРеквизита("Опции.Количество",СтрокаТЧ,ЭтаФорма,ДопПараметры) И Рез;
					Иначе
						СтрокаТЧ=Опции.Добавить();
						СтрокаТЧ.ИдентификаторАвтомобиля=СтрокаАвтомобиля.ИдентификаторАвтомобиля;
						СтрокаТЧ.Опция=ИзНабора.Опция;
						СтрокаТЧ.Количество=ИзНабора.Количество*КоличествоНабора;
						Рез=ОбработкаРеквизита("Опции.Опция",СтрокаТЧ,ЭтаФорма,ДопПараметры) И Рез;
					КонецЕсли; 
				КонецЕсли; 
			КонецЦикла;
			ДопПараметры.Удалить("НаборОпций");
		Иначе
			СтрокаАвтомобиля=Автомобили.Найти(ТекСтрока.ИдентификаторАвтомобиля,"ИдентификаторАвтомобиля");
			Если СтрокаАвтомобиля=Неопределено Тогда
				Модель=Справочники.Модели.ПустаяСсылка();
				ВариантКомплектации=Справочники.ВариантыКомплектации.ПустаяСсылка();
				ЗаказНаАвтомобиль = Документы.ЗаказПоставщикуНаАвтомобиль.ПустаяСсылка();
			Иначе
				Модель=СтрокаАвтомобиля.Автомобиль.Модель;
				ВариантКомплектации=СтрокаАвтомобиля.Автомобиль.ВариантКомплектации;
				ЗаказНаАвтомобиль = СтрокаАвтомобиля.ЗаказНаАвтомобиль;
			КонецЕсли;
			ОпцияИзЗаказа=Неопределено;
			Если ЗначениеЗаполнено(ЗаказНаАвтомобиль) Тогда
				ОпцияИзЗаказа = ЗаказНаАвтомобиль.Опции.Найти(ТекСтрока.Опция, "Опция");
				Если ОпцияИзЗаказа<>Неопределено Тогда
					ТекСтрока.Количество=ОпцияИзЗаказа.Количество;
					//Если ЗаказНаАвтомобиль.ХозОперация = Справочники.ХозОперации.ЗаказАвтомобиляНаСклад Тогда
					ТекСтрока.СтавкаНДС=ОпцияИзЗаказа.СтавкаНДС;
					ТекСтрока.Цена=ОпцияИзЗаказа.Цена;
					//КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			//Проставим количество
			Если ТекСтрока.Количество=0 Тогда ТекСтрока.Количество=1 КонецЕсли;
			//Установим ставку НДС
			Если ТекСтрока.Цена=0 Тогда
				Если дкПроверитьПринадленостьХозОперации(ЭтотОбъект, "Поступление") Тогда
					ОсвобожденОтНДС	= ЭтотОбъект.Контрагент.ОсвобожденОтНДС ИЛИ
					ЭтотОбъект.Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо;	
				Иначе
					ОсвобожденОтНДС	= ПодразделениеКомпании.ОсвобожденОтНДС ИЛИ Организация.ОсвобожденОтНДС;	
				КонецЕсли;
				Если ОсвобожденОтНДС Тогда
					ТекСтрока.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
				ИначеЕсли ТипЗнч(ТекСтрока.Опция)=Тип("СправочникСсылка.Опции") Тогда
					ТекСтрока.СтавкаНДС = ТекСтрока.Опция.СтавкаНДС; 
				Иначе
					ТекСтрока.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС; 
				КонецЕсли;
				ТекСтрока.Цена=обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль,ВариантКомплектации,Опция",Модель,ВариантКомплектации,ТекСтрока.Опция),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
			КонецЕсли;
			Рез=ОбработкаРеквизита("Опции.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		КонецЕсли;
		Возврат Рез;
		
	ИначеЕсли Имя="Опции.Количество" Тогда
		Возврат ОбработкаРеквизита("Опции.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Опции.Цена" Тогда
		ТекСтрока.Сумма=ТекСтрока.Цена*ТекСтрока.Количество;
		ЦенаВключаетНДС=?(обЗначениеНеЗаполнено(ТипЦен),Истина,ТипЦен.ЦенаВключаетНДС);
		Если ЦенаВключаетНДС Тогда
			//Цена уже содержит НДС - Сумма всего равна сумме
			ТекСтрока.СуммаВсего=ТекСтрока.Сумма;
			СуммаБезНДС=(100*ТекСтрока.СуммаВсего)/(100+ТекСтрока.СтавкаНДС.Ставка);
			ТекСтрока.СуммаНДС=ТекСтрока.СуммаВсего-СуммаБезНДС;
		Иначе
			//НДС в цену не включен - Получим сумму НДС
			ТекСтрока.СуммаНДС=(ТекСтрока.Сумма*ТекСтрока.СтавкаНДС.Ставка)/100;
			ТекСтрока.СуммаВсего=ТекСтрока.Сумма+ТекСтрока.СуммаНДС;
		КонецЕсли;
		Возврат Истина;
		
	ИначеЕсли Имя="Опции.Сумма" Тогда
		ТекСтрока.Цена=ТекСтрока.Сумма/?(ТекСтрока.Количество=0,1,ТекСтрока.Количество);
		ЦенаВключаетНДС=?(обЗначениеНеЗаполнено(ТипЦен),Истина,ТипЦен.ЦенаВключаетНДС);
		Если ЦенаВключаетНДС Тогда
			//Цена уже содержит НДС - Сумма всего равна сумме
			ТекСтрока.СуммаВсего=ТекСтрока.Сумма;
			СуммаБезНДС=(100*ТекСтрока.СуммаВсего)/(100+ТекСтрока.СтавкаНДС.Ставка);
			ТекСтрока.СуммаНДС=ТекСтрока.СуммаВсего-СуммаБезНДС;
		Иначе
			//НДС в цену не включен - Получим сумму НДС
			ТекСтрока.СуммаНДС=(ТекСтрока.Сумма*ТекСтрока.СтавкаНДС.Ставка)/100;
			ТекСтрока.СуммаВсего=ТекСтрока.Сумма+ТекСтрока.СуммаНДС;
		КонецЕсли;
		Возврат Истина;
		
	ИначеЕсли Имя="Опции.СуммаВсего" Тогда
		ЦенаВключаетНДС=?(обЗначениеНеЗаполнено(ТипЦен),Истина,ТипЦен.ЦенаВключаетНДС);
		Если ЦенаВключаетНДС Тогда
			//Цена уже содержит НДС
			ТекСтрока.Сумма=ТекСтрока.СуммаВсего;
			СуммаБезНДС=(100*ТекСтрока.СуммаВсего)/(100+ТекСтрока.СтавкаНДС.Ставка);
			ТекСтрока.СуммаНДС=ТекСтрока.СуммаВсего-СуммаБезНДС;
		Иначе
			//НДС в цену не включен
			ТекСтрока.Сумма=(100*ТекСтрока.СуммаВсего)/(100+ТекСтрока.СтавкаНДС.Ставка);
			ТекСтрока.СуммаНДС=ТекСтрока.СуммаВсего-ТекСтрока.Сумма;
		КонецЕсли; 
		ТекСтрока.Цена=ТекСтрока.Сумма/?(ТекСтрока.Количество=0,1,ТекСтрока.Количество);
		Возврат Истина;
		
	ИначеЕсли Имя="Опции.СтавкаНДС" Тогда
		Возврат ОбработкаРеквизита("Автомобили.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Опции.СуммаНДС" Тогда
		Возврат Истина;
		
	Иначе Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()

// Процедура проверяет заказы на авто и если найдены несоответствия то подставляет подходящий
// или устанавливает без заказа
Процедура ПерезаполнитьЗаказы()
	ДокументОбъектСтруктура=Новый Структура();
	ДокументОбъектСтруктура.Вставить("Автомобили",Автомобили.Выгрузить());
	зфЗащищенныеФункцииСервер.ПоступлениеАвтомобилейПерезаполнитьЗаказы(ДокументОбъектСтруктура);
	Автомобили.Очистить();
	Автомобили.Загрузить(ДокументОбъектСтруктура.Автомобили);
КонецПроцедуры

// Нарашивание строки ошибок
Функция ДобавитьОшибку(Ошибки="",ЕщеСтрока="") 
	Ошибки=?(Ошибки="",ЕщеСтрока,Ошибки+Символы.ПС+ЕщеСтрока);
	Возврат(Ошибки);
КонецФункции // ДобавитьОшибку()

Процедура ЗаписатьСтатусы(Отказ) Экспорт
	// Зарезервируем автомобили под заказы клиентов
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЗаказыАвтомобилейОстатки.Автомобиль,
	|	ЗаказыАвтомобилейОстатки.Заказ,
	|	ЗаказыАвтомобилейОстатки.Заказ.СтатусАвтомобиля КАК СтатусАвтомобиля,
	|	ЕСТЬNULL(ЗаказыАвтомобилейОстатки.КоличествоОстаток, 0) КАК Количество
	|ИЗ
	|	РегистрНакопления.ЗаказыАвтомобилей.Остатки(
	|			&НаГраницу,
	|			Автомобиль В (&Автомобили)) КАК ЗаказыАвтомобилейОстатки
	|ГДЕ
	|	ЕСТЬNULL(ЗаказыАвтомобилейОстатки.КоличествоОстаток, 0)<>0
	|";
	Запрос.УстановитьПараметр("НаГраницу",  Новый Граница(МоментВремени(),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Автомобили", Автомобили.ВыгрузитьКолонку("Автомобиль"));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.СтатусАвтомобиля<>СтатусАвтомобиля Тогда
			ЗаказОбъект = Выборка.Заказ.ПолучитьОбъект();
			ЗаказОбъект.ОбменДанными.Загрузка = Истина;
			ЗаказФорма = ЗаказОбъект.ПолучитьФорму();
			ЗаказФорма.СтатусАвтомобиля=СтатусАвтомобиля;
			Попытка
				ЗаказФорма.Записать();
				ЗаказФорма.Обновить();
			Исключение
				дкСообщитьРезультат(ОписаниеОшибки(), СтатусСообщения.Внимание, ЭтотОбъект);
				Отказ = Истина;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
#Если Клиент Тогда
	
	////////////////////////////////////////////////////////////////////////////////
	// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА
	
	// Формирует печатную форму "ПоступлениеАвтомобилей"
	// Возвращает сформированный табличный документ:
	Функция ПечатьПоступлениеАвтомобилей(ТабДокумент) Экспорт
		Макет = ПолучитьМакет("ПоступлениеАвтомобилей");
		
		НомерДляПечати=дкПолучитьНомерДляПечати(ЭтотОбъект);
		
		//для начала настроим макет
		ОбластьШапкаТаблицы = орПривестиМакетПечатнойФормы(ЭтотОбъект,Макет);
		ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
		
		//вывод заголовка документа
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		
		ТекстЗаголовка = "Приходная накладная (автомобили) № "+НомерДляПечати+" от "+Формат(ЭтотОбъект.Дата,"ДФ=dd.MM.yyyy");
		
		ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьМакета.Параметры.ПредставлениеПоставщика	= спПолучитьПредставление(Контрагент);
		ОбластьМакета.Параметры.ПредставлениеПокупателя	= спПолучитьПредставление(Организация);
		ОбластьМакета.Параметры.ПредставлениеСклада		= спПолучитьНаименование(СкладКомпании);
		
		//вывод свойств
		СтрокаСвойств = дкПолучитьСтрокуСвойствДокумента(ЭтотОбъект);
		ОбластьМакета.Параметры.СтрокаСвойств = СтрокаСвойств;
		ТабДокумент.Вывести(ОбластьМакета);
		
		//сразу два, т.к. выводим на второй странице только
		НомерСтраницы = 2;
		НомерСтраницыПред = НомерСтраницы;
		
		//теперь выводим шапку
		ТабДокумент.Вывести(ОбластьШапкаТаблицы);
		
		//готовим области строки
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		
		ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента,СуммаНДС,СуммаВсего",ВалютаДокумента,0,0,0);
		
		//заполним параметры шапки таблицы для следующего листа
		ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
		
		//подготовим дополнительную таблицу
		ТаблицаОпцийПоАвтомобилям = ЭтотОбъект.Опции.Выгрузить();
		ТаблицаОпцийПоАвтомобилям.Свернуть("ИдентификаторАвтомобиля","Сумма,СуммаНДС,СуммаВсего");
		
		//перебор строк
		ВыборкаТабличнойЧасти = ЭтотОбъект.Автомобили.Выгрузить();
		Для каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
			//предварительная обработка строки ТЧ
			СтрокаТабличнойЧастиОпции = ТаблицаОпцийПоАвтомобилям.Найти(СтрокаТабличнойЧасти.ИдентификаторАвтомобиля,"ИдентификаторАвтомобиля");
			Если СтрокаТабличнойЧастиОпции <> Неопределено Тогда
				СтрокаТабличнойЧасти.Сумма		= СтрокаТабличнойЧасти.Сумма		+ СтрокаТабличнойЧастиОпции.Сумма;
				СтрокаТабличнойЧасти.СуммаНДС	= СтрокаТабличнойЧасти.СуммаНДС		+ СтрокаТабличнойЧастиОпции.СуммаНДС;
				СтрокаТабличнойЧасти.СуммаВсего	= СтрокаТабличнойЧасти.СуммаВсего	+ СтрокаТабличнойЧастиОпции.СуммаВсего;
			КонецЕсли;
			//заполняем данные строки
			СтруктураСтроки = орПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТабличнойЧасти,ЭтотОбъект);
			ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);
			
			//выводим строку, делая проверку попадания на лист
			НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице, НомерСтраницы, СтруктураИтоговПоСтранице,ЭтотОбъект);
			
			//инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента,СуммаНДС,СуммаВсего",ВалютаДокумента,0,0);
				НомерСтраницыПред = НомерСтраницы;
				ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			КонецЕсли;
			//добавляем итоги
			дкДобавитьИтогиПоСтранице(СтрокаТабличнойЧасти,СтруктураИтоговПоСтранице);
			
		КонецЦикла;
		
		//довыводим последний подвал, если страниц больше единицы
		Если НомерСтраницы > 2 Тогда
			дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьМакетаИтогоПоСтранице,СтруктураИтоговПоСтранице,ЭтотОбъект);
		КонецЕсли;
		
		//итоги
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ОбластьМакета.Параметры.ВалютаДокумента = ВалютаДокумента;
		СуммаВсего = ВыборкаТабличнойЧасти.Итог("СуммаВсего");
		ОбластьМакета.Параметры.СуммаВсего = Формат(СуммаВсего,ФорматВыводаСуммы);
		НДСВсего = ВыборкаТабличнойЧасти.Итог("СуммаНДС");
		ОбластьМакета.Параметры.НДСВсего = Формат(НДСВсего,ФорматВыводаСуммы);
		ОбластьМакета.Параметры.СуммаПрописью = "Всего наименований "+ВыборкаТабличнойЧасти.Количество()+" на сумму " + обЧислоПрописью(СуммаВсего,ЭтотОбъект.ВалютаДокумента);
		
		// Выводим представления и расшифровки подписей
		Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
		Отпустил.ОтпустилПредставление = ?(обЗначениеНеЗаполнено(Отпустил.Отпустил),"","/ "+ Отпустил.ОтпустилПредставление);
		ОбластьМакета.Параметры.Заполнить(Отпустил);
		Получил  = дкОтветственноеЛицо(ЭтотОбъект,"Получил");
		Получил.ПолучилПредставление = ?(обЗначениеНеЗаполнено(Получил.Получил),"","/ "+ Получил.ПолучилПредставление);
		ОбластьМакета.Параметры.Заполнить(Получил);
		
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, , , НомерСтраницы,,ЭтотОбъект);
		
		Возврат ТабДокумент;
	КонецФункции
	
	// Формирует печатную форму "Акт приема"
	// Возвращает сформированный табличный документ:
	Функция ПечатьАктПриема(ТабДокумент) Экспорт
		
		ДокументОбъект = ЭтотОбъект;
		
		Макет = ПолучитьМакет("АктПриема");
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		НомерДляПечати=дкПолучитьНомерДляПечати(ДокументОбъект.ЭтотОбъект,Истина);
		
		Для Каждого Строка Из ДокументОбъект.Автомобили Цикл
			
			ОбластьМакета.Параметры.ЗаголовокПФ = "приема автомобиля на комиссию";
			ОбластьМакета.Параметры.Номер = НомерДляПечати;
			ОбластьМакета.Параметры.Дата = Формат(ДокументОбъект.Дата,"ДЛФ=DD");
			Если ЗначениеЗаполнено(Строка.Автомобиль) Тогда
				ОбластьМакета.Параметры.МодельНаименование = спПолучитьНаименование(Строка.Автомобиль.Модель);
				ОбластьМакета.Параметры.Модель = Строка.Автомобиль.Модель;
				ОбластьМакета.Параметры.VIN = Строка.Автомобиль.VIN;
				ОбластьМакета.Параметры.ГодВыпуска = Формат(Строка.Автомобиль.ГодВыпуска,"ДФ=гггг");
				ОбластьМакета.Параметры.Цвет = Строка.Автомобиль.Цвет;
				ОбластьМакета.Параметры.Пробег = СокрЛП(Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Строка.Автомобиль,Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег, ДокументОбъект.Дата));
				ОбластьМакета.Параметры.Комплектация = Строка.Автомобиль.ВариантКомплектации;
				ОбластьМакета.Параметры.ТипСалона = Строка.Автомобиль.ТипСалона;
				
				Если Строка.Автомобиль.ТипДвигателя.Пустая() 
					И НЕ Строка.Автомобиль.ВариантКомплектации.Пустая() 
					И НЕ Строка.Автомобиль.ВариантКомплектации.ТипДвигателя.Пустая() Тогда
					ОбластьМакета.Параметры.ОбъемДвигателя = Строка.Автомобиль.ВариантКомплектации.ТипДвигателя.ОбъемДвигателя;
				Иначе	
					ОбластьМакета.Параметры.ОбъемДвигателя = Строка.Автомобиль.ТипДвигателя.ОбъемДвигателя;
				КонецЕсли;
				
				Если Строка.Автомобиль.ТипКПП.Пустая() 
					И НЕ Строка.Автомобиль.ВариантКомплектации.Пустая() Тогда 
					ОбластьМакета.Параметры.ТипКПП = Строка.Автомобиль.ВариантКомплектации.ТипКПП;
				Иначе	
					ОбластьМакета.Параметры.ТипКПП = Строка.Автомобиль.ТипКПП;
				КонецЕсли;
				
			КонецЕсли;
			
			ОбластьМакета.Параметры.ОписаниеКомитента = Контрагент.НаименованиеПолное;
			ОбластьМакета.Параметры.ОписаниеКомиссионера = Организация.НаименованиеПолное;
			
			ТабДокумент.Вывести(ОбластьМакета);
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЦикла;
		
		Возврат ТабДокумент;
		
	КонецФункции
	
	//Иванченко 20251209 ++
	#Область Устарело 
	//Печатная форма Договора комиссии. Не актуальна с декабря 2025г.
	// Формирует печатную форму "Договор комиссии"
	// Возвращает сформированный табличный документ:
	//Функция ПечатьДоговорКомиссии(ТабДокумент) Экспорт
	//	
	//	ДокументОбъект =  ЭтотОбъект;
	//	
	//	Макет = ПолучитьМакет("ДоговорКомиссии");
	//	
	//	НомерДокумента = дкПолучитьНомерДляПечати(ДокументОбъект,Истина);
	//	
	//	Для Каждого Строка Из ДокументОбъект.Автомобили Цикл
	//		
	//		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	//		
	//		//заполнение параметров шапки печатной формы
	//		
	//		ОбластьМакета.Параметры.Номер = НомерДокумента;
	//		ОбластьМакета.Параметры.Город = киПолучитьГород(ДокументОбъект.ПодразделениеКомпании,Справочники.ВидыКонтактнойИнформации.АдресФактический);
	//		ОбластьМакета.Параметры.Дата = Формат(ДокументОбъект.Дата,"ДЛФ=DD");
	//		
	//		//заполнение параметров комитента
	//		
	//		ОбластьМакета.Параметры.Контрагент = ДокументОбъект.Контрагент.НаименованиеПолное;
	//		Паспорт = спПолучитьПодтверждающийДокументОбъектаПоВиду(ДокументОбъект.Контрагент,Перечисления.ВидыДокументов.Паспорт);
	//		Если ЗначениеЗаполнено(Паспорт) Тогда
	//			ПаспортныеДанные = " паспорт серии " + Паспорт.Серия + " № "+ Паспорт.Номер + " выдан " + Паспорт.КемВыдан + " " + Формат(Паспорт.ДатаВыдачи,"ДФ='dd MMMM yyyy'") + "г.";
	//			ОбластьМакета.Параметры.ПаспортныеДанные = " (" + ПаспортныеДанные + ")";
	//		КонецЕсли;
	//		Доверенность = спПолучитьПодтверждающийДокументОбъектаПоВиду(ДокументОбъект.Контрагент,Перечисления.ВидыДокументов.Доверенность);
	//		Если ЗначениеЗаполнено(Доверенность) Тогда
	//			ОбластьМакета.Параметры.Доверенность = ", действующего  на основании " + Доверенность;
	//		КонецЕсли;
	//		
	//		//заполнение параметров комиссионера
	//	
	//		ОбластьМакета.Параметры.Организация = ДокументОбъект.Организация.НаименованиеПолное;
	//		Руководитель = дкОтветственноеЛицо(ДокументОбъект,Перечисления.ВидыОбъектовСведений.Руководитель);
	//		Если ЗначениеЗаполнено(Руководитель) И ТипЗнч(Руководитель)=Тип("Структура") Тогда
	//			Должность = ", в лице";
	//			Если ЗначениеЗаполнено(Руководитель.РуководительДолжность) Тогда
	//				Должность = Должность + " " + СокрЛП(НРег(Руководитель.РуководительДолжность));
	//			КонецЕсли;
	//			ОбластьМакета.Параметры.РуководительДолжность = Должность;
	//			РуководительПредставление = Руководитель.РуководительПредставление;
	//			ДоверенностьРуководителя = спПолучитьПодтверждающийДокументОбъектаПоВиду(Руководитель.Руководитель,Перечисления.ВидыДокументов.Доверенность);
	//			Если ЗначениеЗаполнено(ДоверенностьРуководителя) Тогда
	//				РуководительПредставление = РуководительПредставление + ", действующего  на основании Доверенности №" + ДоверенностьРуководителя.Номер + " от "
	//											+ Формат(ДоверенностьРуководителя.ДатаВыдачи,"ДЛФ=D"); ;
	//			Иначе
	//				РуководительПредставление = ", действующего  на основании Устава"; 		
	//			КонецЕсли;
	//			ОбластьМакета.Параметры.РуководительПредставление = РуководительПредставление;
	//		КонецЕсли;
	//		
	//		//заполнение параметров автомобиля
	//		
	//		Автомобиль = Строка.Автомобиль;
	//		ГосНомер = СокрЛП(Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер, ДокументОбъект.Дата));
	//		Пробег = СокрЛП(Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег, ДокументОбъект.Дата));
	//		ПТС = спПолучитьПодтверждающийДокументОбъектаПоВиду(Автомобиль,Перечисления.ВидыДокументов.ПТС);
	//		ПредставлениеПТС = "ПТС " + ПТС.Серия + " № "+ ПТС.Номер + " выдан " + ПТС.КемВыдан + " " + Формат(ПТС.ДатаВыдачи,"ДФ='dd MMMM yyyy'") + "г. ";
	//		
	//		СтрАвто = "";
	//		СтрАвто = СтрАвто + ?(ЗначениеЗаполнено(Автомобиль.Модель),"модели" + " " + спПолучитьНаименование(Автомобиль.Модель) + ", ","");
	//		СтрАвто = СтрАвто + ?(ЗначениеЗаполнено(Автомобиль.Цвет),"цвет: " + Автомобиль.Цвет + ", ","");
	//		СтрАвто = СтрАвто + ?(ЗначениеЗаполнено(ГосНомер),"государственный номер: " + ГосНомер + ", ","");
	//		СтрАвто = СтрАвто + ?(ЗначениеЗаполнено(Автомобиль.VIN),"VIN: " + Автомобиль.VIN + ", ","");
	//		СтрАвто = СтрАвто + ?(ЗначениеЗаполнено(Пробег),"пробег: "+ Пробег + ", ","");
	//		СтрАвто = СтрАвто + ?(ЗначениеЗаполнено(Автомобиль.ГодВыпуска),"год выпуска: " + Формат(Автомобиль.ГодВыпуска,"ДФ=гггг") + ", ","");
	//		СтрАвто = СтрАвто + ?(ЗначениеЗаполнено(Автомобиль.НомерДвигателя),"номер двигателя: " + Автомобиль.НомерДвигателя + ", ","");
	//		СтрАвто = СтрАвто + ?(ЗначениеЗаполнено(Автомобиль.НомерКузова),"номер кузова: " + Автомобиль.НомерКузова + ", ","");
	//		СтрАвто = СтрАвто + ?(ЗначениеЗаполнено(ПТС),ПредставлениеПТС + ", ","");
	//		СтрАвто = ?(Прав(СтрАвто,2) = ", ",Лев(СтрАвто,СтрДлина(СтрАвто)-2),СтрАвто); //удаление лишней запятой справа
	//		ОбластьМакета.Параметры.Автомобиль = СтрАвто;
	//		
	//		//заполнение параметров договора - различные сроки, суммы, проценты
	//		
	//		ЦенаАвтомобиля = Строка.СуммаВсего;
	//		ОбластьМакета.Параметры.ЦенаАвтомобиля = Формат(Окр(ЦенаАвтомобиля),"ЧДЦ=2; ЧН=0") + " " + ДокументОбъект.ВалютаДокумента + " ("  + обЧислоПрописью(ЦенаАвтомобиля,ДокументОбъект.ВалютаДокумента) + ")";
	//		
	//		Если ЗначениеЗаполнено(ДокументОбъект.ДоговорВзаиморасчетов) Тогда
	//			ПроцентВознаграждения = ДокументОбъект.ДоговорВзаиморасчетов.ПроцентКомиссионногоВознаграждения;
	//			СуммаВознаграждения = ДокументОбъект.ДоговорВзаиморасчетов.СуммаКомиссионногоВознаграждения; 
	//			Если ЗначениеЗаполнено(ПроцентВознаграждения) Тогда
	//				СуммаВознаграждения = ЦенаАвтомобиля*ПроцентВознаграждения/100;
	//			ИначеЕсли ЗначениеЗаполнено(СуммаВознаграждения) И ЗначениеЗаполнено(ЦенаАвтомобиля) Тогда
	//				ПроцентВознаграждения = СуммаВознаграждения/ЦенаАвтомобиля;
	//			КонецЕсли;
	//			ОбластьМакета.Параметры.РазмерВознаграждения = Формат(Окр(СуммаВознаграждения),"ЧДЦ=2; ЧН=0") + " " + ДокументОбъект.ВалютаДокумента + " ("  + обЧислоПрописью(СуммаВознаграждения,ДокументОбъект.ВалютаДокумента) + ")";
	//			ОбластьМакета.Параметры.ПроцентВознаграждения = Строка(Формат(ПроцентВознаграждения,"ЧЦ=8; ЧДЦ=4; ЧН=0")) + "% ";
	//			ОбластьМакета.Параметры.ПроцентОтПолученнойВыгоды = Строка(Формат(ПроцентВознаграждения,"ЧЦ=8; ЧДЦ=4; ЧН=0")) + "% ";
	//		КонецЕсли;
	//		
	//		СрокПриобретения = обПолучитьЗначениеСвойства(ДокументОбъект.Ссылка,ПланыВидовХарактеристик.СвойстваОбъектов.СрокПриобретенияАвтомобиляКомиссионером,0);
	//		ОбластьМакета.Параметры.СрокПриобретенияЗначение = Строка(СрокПриобретения) + " " +  "(" + СокрЛП(ЧислоПрописью(СрокПриобретения,"Л=ru_RU", " , , , , , , , , 0")) + ")"+ " " + обПолучитьПредставлениеДня(СрокПриобретения);
	//		
	//		СрокПередачи = обПолучитьЗначениеСвойства(ДокументОбъект.Ссылка,ПланыВидовХарактеристик.СвойстваОбъектов.СрокПередачиАвтомобиляКомитенту,0);
	//		ОбластьМакета.Параметры.СрокПередачиЗначение = Строка(СрокПередачи) + " " +  "(" + СокрЛП(ЧислоПрописью(СрокПередачи,"Л=ru_RU", " , , , , , , , , 0")) + ")" + " " + обПолучитьПредставлениеДня(СрокПередачи);
	//		
	//		СрокПеречисления = обПолучитьЗначениеСвойства(ДокументОбъект.Ссылка,ПланыВидовХарактеристик.СвойстваОбъектов.СрокПеречисленияВознагражденияКомиссионеру,0);
	//		ОбластьМакета.Параметры.СрокПеречисленияЗначение = Строка(СрокПеречисления) + " " +  "(" + СокрЛП(ЧислоПрописью(СрокПеречисления,"Л=ru_RU", " , , , , , , , , 0")) + ")" + " " + обПолучитьПредставлениеДня(СрокПеречисления);
	//		
	//		СуммаНеустойки = обПолучитьЗначениеСвойства(ДокументОбъект.Ссылка,ПланыВидовХарактеристик.СвойстваОбъектов.СуммаНеустойкиЗаДеньПросрочкиКомиссионером,0);
	//		ОбластьМакета.Параметры.СуммаНеустойкиЗаДеньПросрочкиКомиссионером = Строка(Формат(СуммаНеустойки,"ЧН=0")) + " руб. (" + обЧислоПрописью(СуммаНеустойки,Справочники.Валюты.НайтиПоКоду("643")) + ")";
	//		
	//		ПроцентНеустойки = обПолучитьЗначениеСвойства(ДокументОбъект.Ссылка,ПланыВидовХарактеристик.СвойстваОбъектов.ПроцентНеустойкиЗаПросрочкуКомитентом,0);
	//		ОбластьМакета.Параметры.ПроцентНеустойкиЗаПросрочкуКомитентом = Строка(ПроцентНеустойки) + "% " +  "(" + СокрЛП(ЧислоПрописью(ПроцентНеустойки,"Л=ru_RU", "процент,процента,процентов,м,,,,,0")) + ")";
	//		
	//		//заполнение параметров подвала договора
	//		
	//		СтруктураПредставления1=Новый Структура(
	//		"Наименование,ИНН,КПП,АдресЮридический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
	//		"","ИНН ","КПП ","","тел.: ","р/с ","в банке ","БИК ","к/с "
	//		);
	//		СтруктураПредставления2=Новый Структура(
	//		"Наименование,ИНН,КПП,АдресФактический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
	//		"","ИНН ","КПП ","","тел.: ","р/с ","в банке ","БИК ","к/с "
	//		);
	//		
	//		ОбластьМакета.Параметры.ОписаниеКомиссионера = спПолучитьПредставление(ДокументОбъект.Организация,СтруктураПредставления1);
	//		ОбластьМакета.Параметры.ОписаниеКомитента 	= спПолучитьПредставление(ДокументОбъект.Контрагент,СтруктураПредставления2);
	//		
	//		ТабДокумент.Вывести(ОбластьМакета);
	//		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//		
	//	КонецЦикла;
	//	 
	//	 Возврат ТабДокумент;   	
	// КонецФункции  
	#КонецОбласти
	//Иванченко 20251209 -- 
	
	// Формирует печатную форму "ТОРГ-1"
	// Возвращает сформированный табличный документ:
	Функция ПечатьТОРГ1(ТабДокумент) Экспорт
		Макет = ПолучитьОбщийМакет("ТОРГ1");
		
		НомерДляПечати=дкПолучитьНомерДляПечати(ЭтотОбъект);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		
		СтруктураПредставления1=Новый Структура(
		"Наименование,ИНН,КПП,АдресЮридический,ТелефонРабочий",
		"","ИНН ","КПП ","","тел.: "
		);
		СтруктураПредставления2=Новый Структура(
		"Наименование,ИНН,КПП,АдресФактический,ТелефонРабочий",
		"","ИНН ","КПП ","","тел.: "
		);
		
		// Правим, что автоматом не заполнилось, или заполнилось неправильно
		ОбластьМакета.Параметры.ОрганизацияПредставление	= спПолучитьПредставление(ОбластьМакета.Параметры.Организация,СтруктураПредставления1);
		ОбластьМакета.Параметры.КодПоОКПО					= ОбластьМакета.Параметры.Организация.КодПоОКПО;
		ОбластьМакета.Параметры.ВидДеятельностиПоОКДП		= ОбластьМакета.Параметры.Организация.КодПоОКДП;
		
		ОбластьМакета.Параметры.Номер			= ?(обЗначениеНеЗаполнено(ЭтотОбъект.ВхДокНомер),НомерДляПечати, ЭтотОбъект.ВхДокНомер);
		ОбластьМакета.Параметры.Дата			= Формат(?(обЗначениеНеЗаполнено(ЭтотОбъект.ВхДокНомер),ЭтотОбъект.Дата, ЭтотОбъект.ВхДокДата),"ДФ=dd.MM.yyyy");
		ОбластьМакета.Параметры.МестоПриемки	= ЭтотОбъект.СкладКомпании;
		
		// Заполним информацию о руководителе организации
		Руководитель = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.Руководитель);
		ОбластьМакета.Параметры.Заполнить(Руководитель);
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Введение");
		
		ОбластьМакета.Параметры.Грузоотправитель				= обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузоотправитель",ЭтотОбъект.Контрагент);
		ОбластьМакета.Параметры.ГрузоотправительПредставление	= спПолучитьПредставление(ОбластьМакета.Параметры.Грузоотправитель,СтруктураПредставления2);
		
		ОбластьМакета.Параметры.Поставщик				= ЭтотОбъект.Контрагент;
		ОбластьМакета.Параметры.ПоставщикПредставление	= спПолучитьПредставление(ОбластьМакета.Параметры.Поставщик,СтруктураПредставления1);
		
		Производитель = дкОтветственноеЛицо(ЭтотОбъект,"Производитель");
		ОбластьМакета.Параметры.Заполнить(Производитель);
		
		СтраховаяКомпания = дкОтветственноеЛицо(ЭтотОбъект,"СтраховаяКомпания");
		ОбластьМакета.Параметры.Заполнить(СтраховаяКомпания);
		
		Параметры = Новый Структура;
		Параметры.Вставить("СопроводительныеДокументы"	, обПолучитьЗначениеСвойства(ЭтотОбъект,"СопроводительныеДокументы"));
		Параметры.Вставить("СпособДоставки"				, обПолучитьЗначениеСвойства(ЭтотОбъект,"СпособДоставки"));
		Параметры.Вставить("НомерТранспортногоСредства"	, обПолучитьЗначениеСвойства(ЭтотОбъект,"НомерТранспортногоСредства"));
		Параметры.Вставить("ДатаОтправления"			, обПолучитьЗначениеСвойства(ЭтотОбъект,"ДатаОтправления"));
		ОбластьМакета.Параметры.Заполнить(Параметры);
		
		ТабДокумент.Вывести(ОбластьМакета);
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		//переменные управляющие постраничным выводом
		СтрокНаСтранице = 41;
		СтрокШапки      = 5;
		СтрокПодвала    = 3;
		НомерСтраницы   = 1;	
		
		ОбластьЗаголовокТаблицы	= Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ОбластьСтрока			= Макет.ПолучитьОбласть("Строка");
		ОбластьИтоги			= Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьВсего			= Макет.ПолучитьОбласть("Всего");
		ОбластьСтрокаСертификата= Макет.ПолучитьОбласть("СтрокаСертификата");
		
		ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
		ОбластьЗаголовокТаблицы.Параметры.Валюта = ВалютаДокумента;
		ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
		
		//перебор строк
		ВыборкаТабличнойЧасти = ЭтотОбъект.Автомобили.Выгрузить();
		
		КоличествоСтрок = ВыборкаТабличнойЧасти.Количество();
		Если КоличествоСтрок = 1 Тогда
			ПереноситьПоследнююСтроку = 0;
		Иначе
			ЦелыхСтраницСПодвалом     = Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
			ЦелыхСтраницБезПодвала    = Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
			ПереноситьПоследнююСтроку = ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
		КонецЕсли;
		
		// инициализация итогов по странице
		ИтогоКоличествоНаСтранице	= 0;
		ИтогоСуммаНаСтранице		= 0;
		ИтогоНДСНаСтранице			= 0;
		ИтогоСНДСНаСтранице			= 0;
		ИтогоМассаБруттоНаСтранице  = 0;
		
		// инициализация итогов по документу
		ИтогоКоличество  = 0;
		ИтогоСумма       = 0;
		ИтогоНДС         = 0;
		ИтогоСНДС        = 0;
		Ном              = 0;
		ИтогоМассаБрутто = 0;
		
		//подготовим дополнительную таблицу
		ТаблицаОпцийПоАвтомобилям = ЭтотОбъект.Опции.Выгрузить();
		ТаблицаОпцийПоАвтомобилям.Свернуть("ИдентификаторАвтомобиля","Сумма,СуммаНДС,СуммаВсего");
		
		// Выводим многострочную часть документа
		Для Каждого СтрокаТоваров Из ВыборкаТабличнойЧасти Цикл
			//предварительная обработка строки ТЧ
			СтрокаТабличнойЧастиОпции = ТаблицаОпцийПоАвтомобилям.Найти(СтрокаТоваров.ИдентификаторАвтомобиля,"ИдентификаторАвтомобиля");
			Если СтрокаТабличнойЧастиОпции <> Неопределено Тогда
				СтрокаТоваров.Сумма		= СтрокаТоваров.Сумма	+ СтрокаТабличнойЧастиОпции.Сумма;
				СтрокаТоваров.СуммаНДС	= СтрокаТоваров.СуммаНДС		+ СтрокаТабличнойЧастиОпции.СуммаНДС;
				СтрокаТоваров.СуммаВсего	= СтрокаТоваров.СуммаВсего	+ СтрокаТабличнойЧастиОпции.СуммаВсего;
			КонецЕсли;
			
			Ном = Ном + 1;
			ЦелаяСтраница = (СтрокШапки + Ном - 1) / СтрокНаСтранице;
			
			Если (ЦелаяСтраница = Цел(ЦелаяСтраница))
				или ((ПереноситьПоследнююСтроку = 1) и (Ном = КоличествоСтрок)) Тогда
				ОбластьИтоги.Параметры.ПоставкаКоличествоПоСтранице  = ИтогоКоличествоНаСтранице;
				ОбластьИтоги.Параметры.ПоставкаМассаБруттоПоСтранице = ИтогоМассаБруттоНаСтранице;
				ОбластьИтоги.Параметры.ПоставкаСтоимостьПоСтранице   = ИтогоСуммаНаСтранице;
				ОбластьИтоги.Параметры.СуммаНДСПоСтранице            = ИтогоНДСНаСтранице;
				ОбластьИтоги.Параметры.СуммаСНДСПоСтранице           = ИтогоСНДСНаСтранице;
				ТабДокумент.Вывести(ОбластьИтоги);
				
				// очистим итоги по странице
				ИтогоКоличествоНаСтранице	= 0;
				ИтогоМассаБруттоНаСтранице	= 0;
				ИтогоСуммаНаСтранице		= 0;
				ИтогоНДСНаСтранице			= 0;
				ИтогоСуммаСНДСНаСтранице	= 0;
				
				НомерСтраницы = НомерСтраницы + 1;
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
				ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
			КонецЕсли;
			
			ОбластьСтрока.Параметры.Заполнить(СтрокаТоваров);
			ОбластьСтрока.Параметры.Номенклатура				  = СтрокаТоваров.Автомобиль;
			ОбластьСтрока.Параметры.ТоварНаименование             = спПолучитьНаименование(СтрокаТоваров.Автомобиль);
			ОбластьСтрока.Параметры.ТоварКод                      = СтрокаТоваров.Автомобиль.VIN;
			ОбластьСтрока.Параметры.ЕдиницаИзмеренияНаименование  = "шт";
			ОбластьСтрока.Параметры.ЕдиницаИзмеренияКодПоОКЕИ     = 796; 
			
			ОбластьСтрока.Параметры.ПоставкаКоличествоВОдномМесте	= 1;
			ОбластьСтрока.Параметры.ПоставкаКоличествоМест			= 1;
			МассаБруттоСтр											= 0;
			ОбластьСтрока.Параметры.ПоставкаМассаБрутто				= МассаБруттоСтр;
			ОбластьСтрока.Параметры.СуммаСНДС						= СтрокаТоваров.СуммаВсего;
			ОбластьСтрока.Параметры.ПоставкаСтоимость				= СтрокаТоваров.Сумма;
			ТабДокумент.Вывести(ОбластьСтрока);
			
			// увеличим итоги по странице
			ИтогоКоличествоНаСтранице  = ИтогоКоличествоНаСтранице  + 1;
			ИтогоМассаБруттоНаСтранице = ИтогоМассаБруттоНаСтранице + МассаБруттоСтр;
			ИтогоСуммаНаСтранице       = ИтогоСуммаНаСтранице       + СтрокаТоваров.Сумма;
			ИтогоНДСНаСтранице         = ИтогоНДСНаСтранице         + СтрокаТоваров.СуммаНДС;
			ИтогоСНДСНаСтранице        = ИтогоСНДСНаСтранице        + СтрокаТоваров.СуммаВсего;
			
			// увеличим итоги по странице
			ИтогоКоличество  = ИтогоКоличество  + 1;
			ИтогоМассаБрутто = ИтогоМассаБрутто + МассаБруттоСтр;
			ИтогоСумма       = ИтогоСумма       + СтрокаТоваров.Сумма;
			ИтогоНДС         = ИтогоНДС         + СтрокаТоваров.СуммаНДС;
			ИтогоСНДС        = ИтогоСНДС        + СтрокаТоваров.СуммаВсего;
		КонецЦикла;
		
		// Выводим итоги по последней странице
		ОбластьИтоги.Параметры.ПоставкаКоличествоПоСтранице  = ИтогоКоличествоНаСтранице;
		ОбластьИтоги.Параметры.ПоставкаМассаБруттоПоСтранице = ИтогоМассаБруттоНаСтранице;
		ОбластьИтоги.Параметры.ПоставкаСтоимостьПоСтранице   = ИтогоСуммаНаСтранице;
		ОбластьИтоги.Параметры.СуммаНДСПоСтранице            = ИтогоНДСНаСтранице;
		ОбластьИтоги.Параметры.СуммаСНДСПоСтранице           = ИтогоСНДСНаСтранице;
		ТабДокумент.Вывести(ОбластьИтоги);
		
		// Выводим итоги по всему документу
		ОбластьВсего.Параметры.ПоставкаКоличество  = ИтогоКоличество;
		ОбластьВсего.Параметры.ПоставкаМассаБрутто = ИтогоМассаБрутто;
		ОбластьВсего.Параметры.ПоставкаСтоимость   = ИтогоСумма;
		ОбластьВсего.Параметры.СуммаНДС            = ИтогоНДС;
		ОбластьВсего.Параметры.СуммаСНДС           = ИтогоСНДС;
		ТабДокумент.Вывести(ОбластьВсего);
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		// Выводим подвал документа
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		
		// Комиссия
		ПредседательКомиссии = дкОтветственноеЛицо(ЭтотОбъект,"ПредседательКомиссии");
		ОбластьМакета.Параметры.Заполнить(ПредседательКомиссии);
		
		ЧленКомиссии1 = дкОтветственноеЛицо(ЭтотОбъект,"ЧленКомиссии1");
		ОбластьМакета.Параметры.Заполнить(ЧленКомиссии1);
		
		ЧленКомиссии2 = дкОтветственноеЛицо(ЭтотОбъект,"ЧленКомиссии2");
		ОбластьМакета.Параметры.Заполнить(ЧленКомиссии2);
		
		// Бухгалтер
		ГлавныйБухгалтер = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер);
		ОбластьМакета.Параметры.Заполнить(ГлавныйБухгалтер);
		
		// Кладовщик
		МОЛ = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.МОЛ);
		ОбластьМакета.Параметры.Заполнить(МОЛ);
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Зададим параметры макета
		ТабДокумент.ПолеСверху = 0;
		ТабДокумент.ПолеСлева  = 15;
		ТабДокумент.ПолеСнизу  = 0;
		ТабДокумент.ПолеСправа = 0;
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		
		Возврат ТабДокумент;
	КонецФункции
	
	// Формирует печатную форму "ТОРГ-4"
	// Возвращает сформированный табличный документ:
	Функция ПечатьТОРГ4(ТабДокумент) Экспорт
		Макет = ПолучитьОбщийМакет("ТОРГ4");
		
		НомерДляПечати=дкПолучитьНомерДляПечати(ЭтотОбъект);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		
		СтруктураПредставления1=Новый Структура(
		"Наименование,ИНН,АдресЮридический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		"","ИНН ","","тел.: ","р/с ","в банке ","БИК ","к/с "
		);
		СтруктураПредставления2=Новый Структура(
		"Наименование,ИНН,АдресФактический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		"","ИНН ","","тел.: ","р/с ","в банке ","БИК ","к/с "
		);
		
		ОбластьМакета.Параметры.ОрганизацияПредставление		= спПолучитьПредставление(ОбластьМакета.Параметры.Организация,СтруктураПредставления1);
		ОбластьМакета.Параметры.ОрганизацияПоОКПО 				= ЭтотОбъект.Организация.КодПоОКПО;
		ОбластьМакета.Параметры.ПодразделениеКомпании			= ЭтотОбъект.ПодразделениеКомпании;
		ОбластьМакета.Параметры.ПоставщикПредставление			= спПолучитьПредставление(ЭтотОбъект.Контрагент,СтруктураПредставления1);
		ОбластьМакета.Параметры.Поставщик						= ЭтотОбъект.Контрагент;
		
		ОбластьМакета.Параметры.Грузоотправитель				= обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузоотправитель",ЭтотОбъект.Контрагент);
		ОбластьМакета.Параметры.ГрузоотправительПредставление	= спПолучитьПредставление(ОбластьМакета.Параметры.Грузоотправитель,СтруктураПредставления2);
		
		ОбластьМакета.Параметры.Номер			= ?(обЗначениеНеЗаполнено(ЭтотОбъект.ВхДокНомер),НомерДляПечати, ЭтотОбъект.ВхДокНомер);
		ОбластьМакета.Параметры.Дата			= Формат(?(обЗначениеНеЗаполнено(ЭтотОбъект.ВхДокНомер),ЭтотОбъект.Дата, ЭтотОбъект.ВхДокДата),"ДФ=dd.MM.yyyy");
		ОбластьМакета.Параметры.МестоПриемки	= ЭтотОбъект.СкладКомпании;
		
		// Заполним информацию о руководителе организации
		Руководитель = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.Руководитель);
		ОбластьМакета.Параметры.Заполнить(Руководитель);
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		//переменные управляющие постраничным выводом
		СтрокНаСтранице = 23;
		СтрокШапки      = 20;
		СтрокПодвала    = 7;
		НомерСтраницы   = 1;
		
		ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ОбластьСтрока           = Макет.ПолучитьОбласть("Строка");
		ОбластьИтоги            = Макет.ПолучитьОбласть("ИтогиПоСтранице");
		ОбластьВсего            = Макет.ПолучитьОбласть("Всего");
		
		ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
		ОбластьЗаголовокТаблицы.Параметры.Валюта = ВалютаДокумента;
		ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
		
		ВыборкаСтрок = ЭтотОбъект.Автомобили.Выгрузить();
		
		КоличествоСтрок = ВыборкаСтрок.Количество();
		Если КоличествоСтрок = 1 Тогда
			ПереноситьПоследнююСтроку = 0;
		Иначе
			ЦелыхСтраницСПодвалом     = Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
			ЦелыхСтраницБезПодвала    = Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
			ПереноситьПоследнююСтроку = ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
		КонецЕсли;
		
		// инициализация итогов по странице
		ИтогоМассаБруттоПоСтранице = 0;
		ИтогоКоличествоПоСтранице  = 0;
		ИтогоСуммаПоСтранице       = 0;
		
		// инициализация итогов по документу
		ИтогоМассаБрутто = 0;
		ИтогоКоличество  = 0;
		ИтогоСумма       = 0;
		Ном              = 0;
		
		ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества",Права,,ЭтотОбъект);
		ФорматВыводаСуммы = ОбПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
		
		//подготовим дополнительную таблицу
		ТаблицаОпцийПоАвтомобилям = ЭтотОбъект.Опции.Выгрузить();
		ТаблицаОпцийПоАвтомобилям.Свернуть("ИдентификаторАвтомобиля","Сумма,СуммаНДС,СуммаВсего");
		
		// Выводим многострочную часть документа
		Для каждого СтрокаТоваров Из ВыборкаСтрок Цикл
			//предварительная обработка строки ТЧ
			СтрокаТабличнойЧастиОпции = ТаблицаОпцийПоАвтомобилям.Найти(СтрокаТоваров.ИдентификаторАвтомобиля,"ИдентификаторАвтомобиля");
			Если СтрокаТабличнойЧастиОпции <> Неопределено Тогда
				СтрокаТоваров.Сумма		= СтрокаТоваров.Сумма	+ СтрокаТабличнойЧастиОпции.Сумма;
				СтрокаТоваров.СуммаНДС	= СтрокаТоваров.СуммаНДС		+ СтрокаТабличнойЧастиОпции.СуммаНДС;
				СтрокаТоваров.СуммаВсего	= СтрокаТоваров.СуммаВсего	+ СтрокаТабличнойЧастиОпции.СуммаВсего;
			КонецЕсли;
			
			Ном = Ном + 1;
			ЦелаяСтраница = (СтрокШапки + Ном - 1) / СтрокНаСтранице;
			
			Если (ЦелаяСтраница = Цел(ЦелаяСтраница))
				или ((ПереноситьПоследнююСтроку = 1) и (Ном = КоличествоСтрок)) Тогда
				ОбластьИтоги.Параметры.ИтогоМассаБруттоПоСтранице = ИтогоМассаБруттоПоСтранице;
				ОбластьИтоги.Параметры.ИтогоШтукПоСтранице        = ИтогоКоличествоПоСтранице;
				ОбластьИтоги.Параметры.ИтогоСтоимостьПоСтранице   = ИтогоСуммаПоСтранице;
				ТабДокумент.Вывести(ОбластьИтоги);
				
				// очистим итоги по странице
				ИтогоБруттоПоСтранице     = 0;
				ИтогоКоличествоПоСтранице = 0;
				ИтогоСуммаПоСтранице      = 0;
				
				НомерСтраницы = НомерСтраницы + 1;
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
				ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
			КонецЕсли;
			
			ОбластьСтрока.Параметры.Заполнить(СтрокаТоваров);
			ОбластьСтрока.Параметры.Номенклатура 					= СтрокаТоваров.Автомобиль;
			ОбластьСтрока.Параметры.ТоварНаименование				= спПолучитьНаименование(СтрокаТоваров.Автомобиль);
			ОбластьСтрока.Параметры.ТоварКод						= СтрокаТоваров.Автомобиль.VIN;
			ОбластьСтрока.Параметры.ЕдиницаИзмеренияНаименование	= "шт";
			ОбластьСтрока.Параметры.ЕдиницаИзмеренияКодПоОКЕИ		= 796;
			
			МассаБруттоСтр											= 0;
			ОбластьСтрока.Параметры.МассаБрутто						= МассаБруттоСтр;
			ОбластьСтрока.Параметры.КоличествоМест					= 1;
			ОбластьСтрока.Параметры.КоличествоВОдномМесте			= 1;
			ОбластьСтрока.Параметры.КоличествоШтук					= 1;
			ОбластьСтрока.Параметры.Цена							= Формат(СтрокаТоваров.Сумма,ФорматВыводаСуммы);
			ОбластьСтрока.Параметры.Стоимость						= ОбластьСтрока.Параметры.Цена;
			ТабДокумент.Вывести(ОбластьСтрока);
			
			// увеличим итоги по странице
			ИтогоМассаБруттоПоСтранице = ИтогоМассаБруттоПоСтранице + МассаБруттоСтр;
			ИтогоКоличествоПоСтранице  = ИтогоКоличествоПоСтранице  + 1;
			ИтогоСуммаПоСтранице       = ИтогоСуммаПоСтранице       + СтрокаТоваров.Сумма;
			
			// увеличим итоги по документу
			ИтогоМассаБрутто = ИтогоМассаБрутто + МассаБруттоСтр;
			ИтогоКоличество  = ИтогоКоличество  + 1;
			ИтогоСумма       = ИтогоСумма       + СтрокаТоваров.Сумма;
		КонецЦикла;
		
		// Выводим итоги по последней странице
		ОбластьИтоги.Параметры.ИтогоМассаБруттоПоСтранице = ИтогоМассаБруттоПоСтранице;
		ОбластьИтоги.Параметры.ИтогоШтукПоСтранице        = ИтогоКоличествоПоСтранице;
		ОбластьИтоги.Параметры.ИтогоСтоимостьПоСтранице   = ИтогоСуммаПоСтранице;
		ТабДокумент.Вывести(ОбластьИтоги);
		
		// Выводим итоги по документу в целом
		ОбластьВсего.Параметры.ИтогоМассаБрутто = ИтогоМассаБрутто;
		ОбластьВсего.Параметры.ИтогоШтук        = ИтогоКоличество;
		ОбластьВсего.Параметры.ИтогоСтоимость   = ИтогоСумма;
		ТабДокумент.Вывести(ОбластьВсего);
		
		// Выводим подвал документа
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		
		// Комиссия
		ПредседательКомиссии = дкОтветственноеЛицо(ЭтотОбъект,"ПредседательКомиссии");
		ОбластьМакета.Параметры.Заполнить(ПредседательКомиссии);
		
		ЧленКомиссии1 = дкОтветственноеЛицо(ЭтотОбъект,"ЧленКомиссии1");
		ОбластьМакета.Параметры.Заполнить(ЧленКомиссии1);
		
		ЧленКомиссии2 = дкОтветственноеЛицо(ЭтотОбъект,"ЧленКомиссии2");
		ОбластьМакета.Параметры.Заполнить(ЧленКомиссии2);
		
		// Кладовщик
		МОЛ = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.МОЛ);
		ОбластьМакета.Параметры.Заполнить(МОЛ);
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Зададим параметры макета
		ТабДокумент.ПолеСверху = 0;
		ТабДокумент.ПолеСлева  = 15;
		ТабДокумент.ПолеСнизу  = 0;
		ТабДокумент.ПолеСправа = 0;
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		Возврат ТабДокумент;
	КонецФункции
	
	// Формирует печатную форму "ТОРГ-12"
	// Возвращает сформированный табличный документ:
	Функция ПечатьТОРГ12(ТабДокумент) Экспорт
		// Зададим параметры макета
		ТабДокумент.ПолеСверху = 0;
		ТабДокумент.ПолеСлева  = 0;
		ТабДокумент.ПолеСнизу  = 0;
		ТабДокумент.ПолеСправа = 0;
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		Макет = ПолучитьОбщийМакет("ТОРГ12");
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		
		СтруктураПредставления1=Новый Структура(
		"Наименование,ИНН,КПП,АдресЮридический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		"","ИНН ","КПП ","","тел.: ","р/с ","в банке ","БИК ","к/с "
		);
		СтруктураПредставления2=Новый Структура(
		"Наименование,ИНН,КПП,АдресФактический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		"","ИНН ","КПП ","","тел.: ","р/с ","в банке ","БИК ","к/с "
		);
		
		// получим р/с из свойств документа
		РасчетныйСчетДокумента=обПолучитьЗначениеСвойства(ЭтотОбъект, "РасчетныйСчет", Неопределено);	
		
		// Правим, что автоматом не заполнилось, или заполнилось неправильно
		ОбластьМакета.Параметры.ОрганизацияПредставление= спПолучитьПредставление(ЭтотОбъект.Контрагент,СтруктураПредставления1);
		ОбластьМакета.Параметры.ПодразделениеКомпании	= Неопределено;
		ОбластьМакета.Параметры.Поставщик				= обПолучитьЗначениеСвойства(ЭтотОбъект,"ПоставщикКонтрагент",ЭтотОбъект.Контрагент);
		ОбластьМакета.Параметры.ПоставщикПредставление	= спПолучитьПредставление(ОбластьМакета.Параметры.Поставщик,СтруктураПредставления2);
		
		ОбластьМакета.Параметры.Грузополучатель				= обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузополучатель",ЭтотОбъект.ПодразделениеКомпании);
		ОбластьМакета.Параметры.ГрузополучательПредставление= спПолучитьПредставление(ОбластьМакета.Параметры.Грузополучатель,СтруктураПредставления2,РасчетныйСчетДокумента);
		ОбластьМакета.Параметры.Плательщик					= обПолучитьЗначениеСвойства(ЭтотОбъект,"Плательщик",ЭтотОбъект.Организация);
		ОбластьМакета.Параметры.ПлательщикПредставление		= спПолучитьПредставление(ОбластьМакета.Параметры.Плательщик,СтруктураПредставления2);
		
		//дальше заполнить Шапку
		ОбластьМакета.Параметры.КодПоОКПО				= ЭтотОбъект.Контрагент.КодПоОКПО;
		Если ТипЗнч(ОбластьМакета.Параметры.Грузополучатель)=Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
			ОбластьМакета.Параметры.ГрузополучательПоОКПО	= ОбластьМакета.Параметры.Грузополучатель.Организация.КодПоОКПО;
		Иначе
			ОбластьМакета.Параметры.ГрузополучательПоОКПО	= ОбластьМакета.Параметры.Грузополучатель.КодПоОКПО;
		КонецЕсли;
		ОбластьМакета.Параметры.ПоставщикПоОКПО			= ОбластьМакета.Параметры.Поставщик.КодПоОКПО;
		Если ТипЗнч(ОбластьМакета.Параметры.Плательщик)=Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
			ОбластьМакета.Параметры.ПлательщикПоОКПО		= ОбластьМакета.Параметры.Плательщик.Организация.КодПоОКПО;
		Иначе
			ОбластьМакета.Параметры.ПлательщикПоОКПО		= ОбластьМакета.Параметры.Плательщик.КодПоОКПО;
		КонецЕсли;
		
		ОбластьМакета.Параметры.ДокументОснованиеПредставление = ДоговорВзаиморасчетов.Наименование;
		ОбластьМакета.Параметры.ДокументОснование = ДоговорВзаиморасчетов;
		ОбластьМакета.Параметры.ОснованиеДата = "";
		ОбластьМакета.Параметры.ОснованиеНомер = ""; 	
		
		ОбластьМакета.Параметры.Номер = дкПолучитьНомерДляПечати(ЭтотОбъект);	
		ТабДокумент.Вывести(ОбластьМакета);
		
		НомерСтраницы	= 2;
		НомерСтраницыПред = НомерСтраницы;	
		
		ОбластьЗаголовокТаблицы	= Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ОбластьСтрока			= Макет.ПолучитьОбласть("Строка");
		ОбластьИтоги			= Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьВсего			= Макет.ПолучитьОбласть("Всего");
		// в новой ПФ не выводится
		//ОбластьВсегоСтавкаНДС	= Макет.ПолучитьОбласть("ВсегоСтавкаНДС");
		
		СтруктураИтоговПоСтранице = Новый Структура("ИтогКоличествоПоСтранице,ИтогСуммыПоСтранице,ИтогНДСПоСтранице,ИтогСуммыСНДСПоСтранице",0,0,0,0);
		
		ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);	
		//заполним параметры шапки таблицы для следующего листа
		ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		
		ВыборкаСтрок = ЭтотОбъект.Автомобили.Выгрузить();
		
		КоличествоСтрок = ВыборкаСтрок.Количество();
		
		// инициализация итогов по документу
		ИтогоКоличество = 0;
		ИтогоСумма      = 0;
		ИтогоНДС        = 0;
		ИтогоСуммаСНДС  = 0;
		
		ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества",Права,,ЭтотОбъект);
		ФорматВыводаСуммы = ОбПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
		
		СоответствиеИтоговПоставкамНДС = Новый Соответствие();
		
		//подготовим дополнительную таблицу
		ТаблицаОпцийПоАвтомобилям = ЭтотОбъект.Опции.Выгрузить();
		ТаблицаОпцийПоАвтомобилям.Свернуть("ИдентификаторАвтомобиля,СтавкаНДС","Сумма,СуммаНДС,СуммаВсего");
		
		// Выводим многострочную часть документа
		Для каждого СтрокаТоваров Из ВыборкаСтрок Цикл
			СтруктураПоиска = Новый Структура("ИдентификаторАвтомобиля",СтрокаТоваров.ИдентификаторАвтомобиля);
			
			СуммаНДС=СтрокаТоваров.СуммаНДС;
			
			//предварительная обработка строки ТЧ
			МассивТабличнойЧастиОпции = ТаблицаОпцийПоАвтомобилям.НайтиСтроки(СтруктураПоиска);
			Для Каждого СтрокаТабличнойЧастиОпции Из МассивТабличнойЧастиОпции Цикл
				СтрокаТоваров.Сумма		= СтрокаТоваров.Сумма		+ СтрокаТабличнойЧастиОпции.Сумма;
				СуммаНДС				= СуммаНДС					+ СтрокаТабличнойЧастиОпции.СуммаНДС;
				СтрокаТоваров.СуммаВсего= СтрокаТоваров.СуммаВсего	+ СтрокаТабличнойЧастиОпции.СуммаВсего;
				// итоги по ставкам НДС
				Если НЕ обЗначениеНеЗаполнено(СтрокаТабличнойЧастиОпции.СтавкаНДС) Тогда
					Если СоответствиеИтоговПоставкамНДС[СтрокаТабличнойЧастиОпции.СтавкаНДС]=Неопределено Тогда
						СоответствиеИтоговПоставкамНДС.Вставить(СтрокаТабличнойЧастиОпции.СтавкаНДС,0);
					КонецЕсли;
					СоответствиеИтоговПоставкамНДС[СтрокаТабличнойЧастиОпции.СтавкаНДС]=СоответствиеИтоговПоставкамНДС[СтрокаТабличнойЧастиОпции.СтавкаНДС]+СтрокаТабличнойЧастиОпции.СуммаНДС;
				КонецЕсли;
			КонецЦикла;
			
			//заполняем данные строки
			СтруктураСтроки = орПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТоваров,ЭтотОбъект);
			ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);
			ОбластьСтрока.Параметры.Код = СтрокаТоваров.Автомобиль.VIN;
			ОбластьСтрока.Параметры.ТоварНаименование 			= спПолучитьНаименование(СтрокаТоваров.Автомобиль);
			ОбластьСтрока.Параметры.Номенклатура 				= СтрокаТоваров.Автомобиль;
			ОбластьСтрока.Параметры.СуммаНДС					= СуммаНДС;
			ОбластьСтрока.Параметры.БазоваяЕдиницаНаименование	= "шт";
			ОбластьСтрока.Параметры.БазоваяЕдиницаКодПоОКЕИ		= 796;
			ОбластьСтрока.Параметры.Количество					= 1;
			ОбластьСтрока.Параметры.КоличествоМест				= 1;
			ОбластьСтрока.Параметры.КоличествоВОдномМесте		= 1;
			
			//выводим строку, делая проверку попадания на лист		
			НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрока, ОбластьЗаголовокТаблицы, ОбластьИтоги, НомерСтраницы, СтруктураИтоговПоСтранице,ЭтотОбъект);
			
			// увеличим итоги по странице
			СтруктураСтрокиИтогов = Новый Структура("ИтогКоличествоПоСтранице,ИтогСуммыПоСтранице,ИтогНДСПоСтранице,ИтогСуммыСНДСПоСтранице");
			СтруктураСтрокиИтогов.ИтогКоличествоПоСтранице	= 1;
			СтруктураСтрокиИтогов.ИтогСуммыПоСтранице		= СтрокаТоваров.СуммаВсего-СтрокаТоваров.СуммаНДС;
			СтруктураСтрокиИтогов.ИтогНДСПоСтранице			= СуммаНДС;
			СтруктураСтрокиИтогов.ИтогСуммыСНДСПоСтранице	= СтрокаТоваров.СуммаВсего;
			
			//инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				СтруктураИтоговПоСтранице = Новый Структура("ИтогКоличествоПоСтранице,ИтогСуммыПоСтранице,ИтогНДСПоСтранице,ИтогСуммыСНДСПоСтранице",0,0,0,0);
				НомерСтраницыПред = НомерСтраницы;
				ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			КонецЕсли;
			//добавляем итоги
			дкДобавитьИтогиПоСтранице(СтруктураСтрокиИтогов,СтруктураИтоговПоСтранице);
			
			// итоги по ставкам НДС
			Если НЕ обЗначениеНеЗаполнено(СтрокаТоваров.СтавкаНДС) Тогда
				Если СоответствиеИтоговПоставкамНДС[СтрокаТоваров.СтавкаНДС] = Неопределено Тогда
					СоответствиеИтоговПоставкамНДС.Вставить(СтрокаТоваров.СтавкаНДС,0);
				КонецЕсли;
				СоответствиеИтоговПоставкамНДС[СтрокаТоваров.СтавкаНДС] = СоответствиеИтоговПоставкамНДС[СтрокаТоваров.СтавкаНДС] + СтрокаТоваров.СуммаНДС;
			КонецЕсли;
			// итоги по документу
			ИтогоКоличество = ИтогоКоличество+ 1;
			ИтогоСумма      = ИтогоСумма+ СтрокаТоваров.СуммаВсего-СуммаНДС;
			ИтогоНДС        = ИтогоНДС+СуммаНДС;
			ИтогоСуммаСНДС  = ИтогоСуммаСНДС+СтрокаТоваров.СуммаВсего;
		КонецЦикла;
		
		//довыводим последний подвал, если страниц больше единицы
		Если НомерСтраницы > 2 Тогда
			дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьИтоги,СтруктураИтоговПоСтранице,ЭтотОбъект);
		КонецЕсли;
		
		// Выводим итоги по документу в целом
		ОбластьВсего.Параметры.ИтогКоличество = Формат(ИтогоКоличество,ФорматВыводаКоличества);
		ОбластьВсего.Параметры.ИтогСуммы      = Формат(ИтогоСумма,ФорматВыводаСуммы);
		ОбластьВсего.Параметры.ИтогНДС        = Формат(ИтогоНДС,ФорматВыводаСуммы);
		ОбластьВсего.Параметры.ИтогСуммыСНДС  = Формат(ИтогоСуммаСНДС,ФорматВыводаСуммы);
		ТабДокумент.Вывести(ОбластьВсего);
		
		//// выведем итоги по ставкам НДС
		//Для Каждого ЭлементСоответствия Из СоответствиеИтоговПоставкамНДС Цикл
		//	ОбластьВсегоСтавкаНДС.Параметры.СтавкаНДС = "Итого по ставке НДС: "+дкПолучитьПредставлениеСтавкиНДС(ЭлементСоответствия.Ключ,"%");
		//	ОбластьВсегоСтавкаНДС.Параметры.ИтогНДС = ЭлементСоответствия.Значение;
		//	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьВсегоСтавкаНДС, , , НомерСтраницы,,ЭтотОбъект);
		//КонецЦикла;
		
		// Выводим подвал документа
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		ОбластьМакета.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ЧислоПрописью(КоличествоСтрок, ,",,,,,,,,0");
		ОбластьМакета.Параметры.СуммаПрописью = обЧислоПрописью(ВыборкаСтрок.Итог("СуммаВсего"),ЭтотОбъект.ВалютаДокумента);
		
		Доверенность = обПолучитьЗначениеСвойства(ЭтотОбъект,"Доверенность");
		Если НЕ обЗначениеНеЗаполнено(Доверенность) Тогда
			ОбластьМакета.Параметры.ДоверенностьНомер = ?(ПустаяСтрока(Доверенность.Серия),"",Доверенность.Серия + "-") + Доверенность.Номер;
			ОбластьМакета.Параметры.ДоверенностьДата  = Доверенность.ДатаВыдачи;
			ОбластьМакета.Параметры.ДоверенностьВыдана= Доверенность.КемВыдан;
		КонецЕсли; 
		
		ДатаОтгрузки=обПолучитьЗначениеСвойства(ЭтотОбъект,"ДатаОтгрузки",Дата('00010101'));
		ДатаОтгрузки=?(обЗначениеНеЗаполнено(ДатаОтгрузки),"""___""____________ 20___",Формат(ДатаОтгрузки,"ДФ=dd.MM.yyyy"));
		ОбластьМакета.Параметры.ДатаОтгрузки = ДатаОтгрузки;
		
		Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
		ОбластьМакета.Параметры.Заполнить(Отпустил);
		
		Получил = дкОтветственноеЛицо(ЭтотОбъект,"Получил");
		ОбластьМакета.Параметры.Заполнить(Получил);
		
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, , , НомерСтраницы,,ЭтотОбъект);
		
		Возврат ТабДокумент;
	КонецФункции
	
	// Формирует печатную форму "ТОРГ13"
	// Возвращает сформированный табличный документ:
	Функция ПечатьТОРГ13(ТабДокумент) Экспорт
		Макет = ПолучитьОбщийМакет("ТОРГ13");
		
		СтруктураПредставления=Новый Структура(
		"Наименование,ИНН,АдресЮридический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		"","ИНН ","","тел.: ","р/с ","в банке ","БИК ","к/с "
		);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		ОбластьМакета.Параметры.ОрганизацияПредставление	= спПолучитьПредставление(ЭтотОбъект.Организация,СтруктураПредставления);
		ОбластьМакета.Параметры.ОрганизацияПоОКПО			= ЭтотОбъект.Организация.КодПоОКПО;
		ОбластьМакета.Параметры.ОтправительПодразделение	= обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузоотправитель",ЭтотОбъект.Контрагент);
		ОбластьМакета.Параметры.ПолучательПодразделение		= обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузополучатель",ЭтотОбъект.СкладКомпании);
		ОбластьМакета.Параметры.Номер						= дкПолучитьНомерДляПечати(ЭтотОбъект);
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		СтрокНаСтранице = 25;
		СтрокШапки      = 12;
		СтрокПодвала    = 5;
		НомерСтраницы   = 1;
		
		// Выводим заголовок таблицы
		ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
		ЗаголовокТаблицы.Параметры.Валюта = ВалютаДокумента;
		ТабДокумент.Вывести(ЗаголовокТаблицы);
		
		ВыборкаСтрокТовары = ЭтотОбъект.Автомобили.Выгрузить();
		
		КоличествоСтрок = ВыборкаСтрокТовары.Количество();
		Если КоличествоСтрок = 1 Тогда
			ПереноситьПоследнююСтроку	= 0;
		Иначе
			ЦелыхСтраницСПодвалом		= Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
			ЦелыхСтраницБезПодвала		= Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
			ПереноситьПоследнююСтроку	= ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
		КонецЕсли;
		
		// инициализация итогов по странице
		ИтогКоличествоМестПоСтранице = 0;
		ИтогМассаБруттоПоСтранице    = 0;
		ИтогМассыНеттоПоСтранице     = 0;
		ИтогСуммыПоСтранице          = 0;
		
		// инициализация итогов по документу
		ИтогоКоличество  = 0;
		ИтогоМассаБрутто = 0;
		ИтогоМассаНетто  = 0;
		ИтогоСумма       = 0;
		Ном = 0;
		
		ФорматВыводаСуммы = ОбПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект); 
		ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества",Права,,ЭтотОбъект);
		// Выводим многострочную часть документа
		ОбластьИтоговПоСтранице	= Макет.ПолучитьОбласть("ИтогиПоСтранице");
		ОбластьМакета			= Макет.ПолучитьОбласть("Строка");
		
		//подготовим дополнительную таблицу
		ТаблицаОпцийПоАвтомобилям = ЭтотОбъект.Опции.Выгрузить();
		ТаблицаОпцийПоАвтомобилям.Свернуть("ИдентификаторАвтомобиля","Сумма,СуммаНДС,СуммаВсего");
		Для каждого СтрокаТовар Из ВыборкаСтрокТовары Цикл
			//предварительная обработка строки ТЧ
			СтрокаТабличнойЧастиОпции = ТаблицаОпцийПоАвтомобилям.Найти(СтрокаТовар.ИдентификаторАвтомобиля,"ИдентификаторАвтомобиля");
			Если СтрокаТабличнойЧастиОпции <> Неопределено Тогда
				СтрокаТовар.Сумма		= СтрокаТовар.Сумма	+ СтрокаТабличнойЧастиОпции.Сумма;
				СтрокаТовар.СуммаНДС	= СтрокаТовар.СуммаНДС		+ СтрокаТабличнойЧастиОпции.СуммаНДС;
				СтрокаТовар.СуммаВсего	= СтрокаТовар.СуммаВсего	+ СтрокаТабличнойЧастиОпции.СуммаВсего;
			КонецЕсли;
			
			Ном = Ном + 1;
			ЦелаяСтраница	= (СтрокШапки + Ном - 1) / СтрокНаСтранице;
			
			Если (ЦелаяСтраница = Цел(ЦелаяСтраница))
				или ((ПереноситьПоследнююСтроку = 1) и (Ном = КоличествоСтрок)) Тогда
				ОбластьИтоговПоСтранице.Параметры.ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице;
				ОбластьИтоговПоСтранице.Параметры.ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице;
				ОбластьИтоговПоСтранице.Параметры.ИтогМассыНеттоПоСтранице     = ИтогМассыНеттоПоСтранице;
				ОбластьИтоговПоСтранице.Параметры.ИтогСуммыПоСтранице          = ИтогСуммыПоСтранице;
				ТабДокумент.Вывести(ОбластьИтоговПоСтранице);
				
				// инициализация итогов по странице
				ИтогКоличествоМестПоСтранице = 0;
				ИтогМассаБруттоПоСтранице    = 0;
				ИтогМассаНеттоПоСтранице     = 0;
				ИтогСуммыПоСтранице          = 0;
				
				НомерСтраницы = НомерСтраницы + 1;
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
				ТабДокумент.Вывести(ЗаголовокТаблицы);
			КонецЕсли;
			
			ОбластьМакета.Параметры.Заполнить(СтрокаТовар);
			ОбластьМакета.Параметры.Номенклатура				= СтрокаТовар.Автомобиль;
			ОбластьМакета.Параметры.ТоварНаименование			= спПолучитьНаименование(СтрокаТовар.Автомобиль);
			ОбластьМакета.Параметры.ТоварКод					= СтрокаТовар.Автомобиль.VIN;
			ОбластьМакета.Параметры.ЕдиницаИзмерения			= "шт";
			ОбластьМакета.Параметры.ЕдиницаИзмеренияКодПоОКЕИ	= 796;
			
			ОбластьМакета.Параметры.КоличествоВОдномМесте		= 1;
			ОбластьМакета.Параметры.КоличествоМест				= 1;
			МассаБруттоСтр										= 0;
			ОбластьМакета.Параметры.МассаБрутто					= МассаБруттоСтр;
			Сумма												= СтрокаТовар.СуммаВсего - СтрокаТовар.СуммаНДС;
			ОбластьМакета.Параметры.Цена						= Формат(Сумма,ФорматВыводаСуммы);
			ОбластьМакета.Параметры.Сумма						= ОбластьМакета.Параметры.Цена;
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Обновим итоги по странице
			ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице + 1;
			ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице    + МассаБруттоСтр;
			ИтогМассыНеттоПоСтранице     = ИтогМассыНеттоПоСтранице     + 0;
			ИтогСуммыПоСтранице          = ИтогСуммыПоСтранице          + Сумма;
			
			// Обновим итоги по документу
			ИтогоКоличество  = ИтогоКоличество  + 1;
			ИтогоМассаБрутто = ИтогоМассаБрутто + МассаБруттоСтр;
			ИтогоМассаНетто  = ИтогоМассаНетто  + 0;
			ИтогоСумма       = ИтогоСумма       + Сумма;
		КонецЦикла;
		
		ОбластьИтоговПоСтранице.Параметры.ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице;
		ОбластьИтоговПоСтранице.Параметры.ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице;
		ОбластьИтоговПоСтранице.Параметры.ИтогМассыНеттоПоСтранице     = ИтогМассыНеттоПоСтранице;
		ОбластьИтоговПоСтранице.Параметры.ИтогСуммыПоСтранице          = ИтогСуммыПоСтранице;
		ТабДокумент.Вывести(ОбластьИтоговПоСтранице);
		
		// Выводим итоги по документу в целом
		ОбластьМакета = Макет.ПолучитьОбласть("Всего");
		ОбластьМакета.Параметры.ИтогоКоличествоМест = ИтогоКоличество;
		ОбластьМакета.Параметры.ИтогоМассаБрутто    = ИтогоМассаБрутто;
		ОбластьМакета.Параметры.ИтогоМассаНетто     = ИтогоМассаНетто;
		ОбластьМакета.Параметры.ИтогоСумма          = ИтогоСумма;
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Выводим подвал документа
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		ОбластьМакета.Параметры.ИтогоСуммаПрописью = обЧислоПрописью(ИтогоСумма,ЭтотОбъект.ВалютаДокумента);
		
		Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
		ОбластьМакета.Параметры.Заполнить(Отпустил);
		
		Получил = дкОтветственноеЛицо(ЭтотОбъект,"Получил");
		ОбластьМакета.Параметры.Заполнить(Получил);
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Зададим параметры макета
		ТабДокумент.ПолеСверху = 0;
		ТабДокумент.ПолеСлева  = 15;
		ТабДокумент.ПолеСнизу  = 0;
		ТабДокумент.ПолеСправа = 0;
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		Возврат ТабДокумент;
	КонецФункции
	
	// Формирует печатную форму "М-4"
	// Возвращает сформированный табличный документ
	Функция ПечатьМ4(ТабДокумент) Экспорт
		Макет = ПолучитьОбщийМакет("М4");
		
		// выводим шапку
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		
		СтруктураПредставления=Новый Структура(
		"Наименование,ИНН,АдресЮридический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		"","ИНН ","","тел.: ","р/с ","в банке ","БИК ","к/с "
		);
		
		// Правим, что автоматом не заполнилось, или заполнилось неправильно
		ОбластьМакета.Параметры.ОрганизацияПредставление= спПолучитьПредставление(ОбластьМакета.Параметры.Организация,СтруктураПредставления);
		ОбластьМакета.Параметры.ОрганизацияПоОКПО		= Организация.КодПоОКПО;
		ОбластьМакета.Параметры.Номер					= дкПолучитьНомерДляПечати(ЭтотОбъект);
		ТабДокумент.Вывести(ОбластьМакета);
		
		// выводим заголовок документа
		ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокДокумента");
		ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		ОбластьМакета.Параметры.ДатаСоставления			= Формат(Дата, "ДФ = дд.ММ.гггг");
		ОбластьМакета.Параметры.МестоПриемки			= СкладКомпании;
		ОбластьМакета.Параметры.ПоставщикНаименование	= спПолучитьНаименование(Контрагент);
		ОбластьМакета.Параметры.Поставщик				= Контрагент;
		ОбластьМакета.Параметры.ПоставщикКод			= Контрагент.Код;
		СтраховаяКомпания = дкОтветственноеЛицо(ЭтотОбъект,"СтраховаяКомпания");
		ОбластьМакета.Параметры.Заполнить(СтраховаяКомпания);
		ТабДокумент.Вывести(ОбластьМакета);
		
		//переменные управляющие постраничным выводом
		СтрокНаСтранице = 24;
		СтрокШапки      = 10;
		СтрокПодвала    = 6;
		НомерСтраницы   = 1;		
		
		ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ОбластьСтрока           = Макет.ПолучитьОбласть("Строка");
		ОбластьИтогиПоСтранице  = Макет.ПолучитьОбласть("Итого");
		
		// выводим заголовок таблицы
		ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
		ОбластьЗаголовокТаблицы.Параметры.Валюта = ВалютаДокумента;
		ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
		
		ВыборкаСтрок = ЭтотОбъект.Автомобили.Выгрузить();
		
		КоличествоСтрок = ВыборкаСтрок.Количество();
		Если КоличествоСтрок = 1 Тогда
			ПереноситьПоследнююСтроку = 0;
		Иначе
			ЦелыхСтраницСПодвалом     = Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
			ЦелыхСтраницБезПодвала    = Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
			ПереноситьПоследнююСтроку = ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
		КонецЕсли;
		
		// инициализация итогов по странице
		ИтогоКоличествоПринятоПоСтранице = 0;
		ИтогоСуммаБезНДСПоСтранице       = 0;
		ИтогоСуммаНДСПоСтранице 		 = 0;
		ИтогоВсегоСНДСПоСтранице		 = 0;
		Ном 							 = 0;
		
		// проверим, входит ли НДС в стоимость	
		ЦенаВключаетНДС = ТипЦен.ЦенаВключаетНДС;
		
		//подготовим дополнительную таблицу
		ТаблицаОпцийПоАвтомобилям = ЭтотОбъект.Опции.Выгрузить();
		ТаблицаОпцийПоАвтомобилям.Свернуть("ИдентификаторАвтомобиля","Сумма,СуммаНДС,СуммаВсего");
		
		// Выводим многострочную часть документа
		Для каждого СтрокаТабличнойЧасти Из ВыборкаСтрок Цикл
			//предварительная обработка строки ТЧ
			СтрокаТабличнойЧастиОпции = ТаблицаОпцийПоАвтомобилям.Найти(СтрокаТабличнойЧасти.ИдентификаторАвтомобиля,"ИдентификаторАвтомобиля");
			Если СтрокаТабличнойЧастиОпции <> Неопределено Тогда
				СтрокаТабличнойЧасти.Сумма		= СтрокаТабличнойЧасти.Сумма	+ СтрокаТабличнойЧастиОпции.Сумма;
				СтрокаТабличнойЧасти.СуммаНДС	= СтрокаТабличнойЧасти.СуммаНДС		+ СтрокаТабличнойЧастиОпции.СуммаНДС;
				СтрокаТабличнойЧасти.СуммаВсего	= СтрокаТабличнойЧасти.СуммаВсего	+ СтрокаТабличнойЧастиОпции.СуммаВсего;
			КонецЕсли;
			
			Ном = Ном + 1;
			ЦелаяСтраница = (СтрокШапки + Ном - 1) / СтрокНаСтранице;
			
			Если (ЦелаяСтраница = Цел(ЦелаяСтраница))
				или ((ПереноситьПоследнююСтроку = 1) и (Ном = КоличествоСтрок)) Тогда
				ОбластьИтогиПоСтранице.Параметры.ИтогоКоличествоПринято = ИтогоКоличествоПринятоПоСтранице;
				ОбластьИтогиПоСтранице.Параметры.ИтогоСуммаБезНДС = ИтогоСуммаБезНДСПоСтранице;
				ОбластьИтогиПоСтранице.Параметры.ИтогоСуммаНДС = ИтогоСуммаНДСПоСтранице;
				ОбластьИтогиПоСтранице.Параметры.ИтогоВсегоСНДС = ИтогоВсегоСНДСПоСтранице;
				ТабДокумент.Вывести(ОбластьИтогиПоСтранице);
				
				// очистим итоги по странице
				ИтогоКоличествоПринятоПоСтранице = 0;
				ИтогоСуммаБезНДСПоСтранице       = 0;
				ИтогоСуммаНДСПоСтранице 		 = 0;
				ИтогоВсегоСНДСПоСтранице		 = 0;
				
				НомерСтраницы = НомерСтраницы + 1;
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
				ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
			КонецЕсли;
			
			ОбластьСтрока.Параметры.Заполнить(СтрокаТабличнойЧасти);
			ОбластьСтрока.Параметры.Номенклатура					= СтрокаТабличнойЧасти.Автомобиль; 
			ОбластьСтрока.Параметры.ТоварНаименование				= спПолучитьНаименование(СтрокаТабличнойЧасти.Автомобиль);
			ОбластьСтрока.Параметры.ТоварКод						= СтрокаТабличнойЧасти.Автомобиль.VIN;
			ОбластьСтрока.Параметры.ЕдиницаИзмеренияКод				= 796;
			ОбластьСтрока.Параметры.ЕдиницаИзмеренияНаименование	= "шт";
			ОбластьСтрока.Параметры.КоличествоПринято				= 1;
			Если ЦенаВключаетНДС = 1 Тогда
				ОбластьСтрока.Параметры.Цена		= СтрокаТабличнойЧасти.Сумма - ОбластьСтрока.Параметры.СуммаНДС;
				ОбластьСтрока.Параметры.СуммаБезНДС	= СтрокаТабличнойЧасти.Сумма - ОбластьСтрока.Параметры.СуммаНДС;
				ИтогоСуммаБезНДСПоСтранице			= ИтогоСуммаБезНДСПоСтранице + СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.СуммаНДС;
			Иначе
				ОбластьСтрока.Параметры.Цена		= СтрокаТабличнойЧасти.Сумма;
				ОбластьСтрока.Параметры.СуммаБезНДС	= СтрокаТабличнойЧасти.Сумма;
				ИтогоСуммаБезНДСПоСтранице			= ИтогоСуммаБезНДСПоСтранице + СтрокаТабличнойЧасти.Сумма;
			КонецЕсли;		
			ОбластьСтрока.Параметры.ВсегоСНДС		= СтрокаТабличнойЧасти.СуммаВсего;
			ТабДокумент.Вывести(ОбластьСтрока);
			
			// увеличим итоги по странице
			ИтогоКоличествоПринятоПоСтранице = ИтогоКоличествоПринятоПоСтранице + 1;
			ИтогоСуммаНДСПоСтранице			 = ИтогоСуммаНДСПоСтранице + СтрокаТабличнойЧасти.СуммаНДС;
			ИтогоВсегоСНДСПоСтранице		 = ИтогоВсегоСНДСПоСтранице + СтрокаТабличнойЧасти.СуммаВсего;
		КонецЦикла;
		
		// выводим итоги по последней странице
		ОбластьИтогиПоСтранице.Параметры.ИтогоКоличествоПринято = ИтогоКоличествоПринятоПоСтранице;
		ОбластьИтогиПоСтранице.Параметры.ИтогоСуммаБезНДС = ИтогоСуммаБезНДСПоСтранице;
		ОбластьИтогиПоСтранице.Параметры.ИтогоСуммаНДС = ИтогоСуммаНДСПоСтранице;
		ОбластьИтогиПоСтранице.Параметры.ИтогоВсегоСНДС = ИтогоВсегоСНДСПоСтранице;
		ТабДокумент.Вывести(ОбластьИтогиПоСтранице);
		
		// выводим подвал
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		
		Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
		ОбластьМакета.Параметры.Заполнить(Отпустил);
		
		Получил = дкОтветственноеЛицо(ЭтотОбъект,"Получил");
		ОбластьМакета.Параметры.Заполнить(Получил);
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Зададим параметры макета
		ТабДокумент.ПолеСверху = 0;
		ТабДокумент.ПолеСлева  = 0;
		ТабДокумент.ПолеСнизу  = 0;
		ТабДокумент.ПолеСправа = 0;
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		Возврат ТабДокумент;
	КонецФункции
	
	// +++++ Соколмоторс +++++
	
	//Функция печати Акта о преме-передачи ТМЦ
	// 
	// Параметры:
	//  ТабДокумент - табличный документ.
	//
	Функция ПечатьМХ1(ТабДокумент) Экспорт
		Если ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилейОтветственноеХранение Тогда
			Макет = ПолучитьОбщийМакет("МХ1");
			ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества", Права,,ЭтотОбъект);
			ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
			ОбластьЗаголовок.Параметры.НомерДокумента                   = Номер;
			ОбластьЗаголовок.Параметры.ДатаДокумента                    = Дата;
			ОбластьЗаголовок.Параметры.ОрганизацияПоОКПО                = Организация.КодПоОКПО;
			ОбластьЗаголовок.Параметры.ОрганизацияВидДеятельностиПоОКДП = Организация.КодПоОКДП;
			Если НЕ обЗначениеНеЗаполнено(ПодразделениеКомпании) И НЕ обЗначениеНеЗаполнено(ПодразделениеКомпании.КПП) Тогда
				СтрокаПредставления = спПолучитьПредставление(Организация);
				ОбластьЗаголовок.Параметры.ПредставлениеОрганизации = СтрЗаменить(СтрокаПредставления, Организация.КПП, ПодразделениеКомпании.КПП);
			Иначе	
				ОбластьЗаголовок.Параметры.ПредставлениеОрганизации = спПолучитьПредставление(Организация);
			КонецЕсли;
			Если НЕ обЗначениеНеЗаполнено(Контрагент) Тогда
				ОбластьЗаголовок.Параметры.ПредставлениеВладельца = спПолучитьПредставление(Контрагент);
				ОбластьЗаголовок.Параметры.ВладелецПоОКПО = Контрагент.КодПоОКПО;
			КонецЕсли;
			ТабДокумент.Вывести(ОбластьЗаголовок);
			ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
			ТабДокумент.Вывести(ОбластьШапка);
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			ВыборкаСтрок = Автомобили.Выгрузить();
			НомерСтроки = 1;
			
			//подготовим дополнительную таблицу
			ТаблицаОпцийПоАвтомобилям = ЭтотОбъект.Опции.Выгрузить();
			ТаблицаОпцийПоАвтомобилям.Свернуть("ИдентификаторАвтомобиля","Сумма,СуммаНДС,СуммаВсего");
			Для Каждого СтрокаТоваров Из ВыборкаСтрок Цикл
				ОбластьСтрока.Параметры.НомерСтроки  = НомерСтроки;
				ОбластьСтрока.Параметры.Номенклатура = Строка(СтрокаТоваров.Автомобиль);
				СтрокаТабличнойЧастиОпции = ТаблицаОпцийПоАвтомобилям.Найти(СтрокаТоваров.ИдентификаторАвтомобиля,"ИдентификаторАвтомобиля");
				Если СтрокаТабличнойЧастиОпции <> Неопределено Тогда
					СтрокаТоваров.Сумма = СтрокаТоваров.Сумма + СтрокаТабличнойЧастиОпции.Сумма;
					СтрокаТоваров.СуммаВсего = СтрокаТоваров.СуммаВсего + СтрокаТабличнойЧастиОпции.СуммаВсего;
				КонецЕсли;
				ВалютаРегУчета = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
				Если Не ВалютаДокумента = ВалютаРегУчета Тогда
					СтрокаТоваров.Сумма = обПересчет(СтрокаТоваров.Сумма,ВалютаДокумента,Дата,ВалютаРегУчета,Дата);
					СтрокаТоваров.СуммаВсего = обПересчет(СтрокаТоваров.СуммаВсего,ВалютаДокумента,Дата,ВалютаРегУчета,Дата);
				КонецЕсли;
				ОбластьСтрока.Параметры.Цена = СтрокаТоваров.Сумма;
				ОбластьСтрока.Параметры.Стоимость = СтрокаТоваров.Сумма;
				ОбластьСтрока.Параметры.Количество =  Формат(1,ФорматВыводаКоличества);
				ТабДокумент.Вывести(ОбластьСтрока);
				НомерСтроки = НомерСтроки + 1;
			КонецЦикла;
			ОбластьИтого = Макет.ПолучитьОбласть("Итого");
			ОбластьИтого.Параметры.Количество = Формат(ВыборкаСтрок.Итог("Количество"),ФорматВыводаКоличества);
			ОбластьИтого.Параметры.ИтогЦена = ВыборкаСтрок.Итог("Сумма");
			ОбластьИтого.Параметры.ИтогСтоимость = ВыборкаСтрок.Итог("Сумма");
			ТабДокумент.Вывести(ОбластьИтого);
			ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
			ТабДокумент.Вывести(ОбластьПодвал);
			Возврат ТабДокумент;
		Иначе
			Сообщить("Печать акта о приеме-передаче товарно-материальных ценностей на хранение возможна только для документов с хозяйственной операцией ""Поступление автомобилей на ответственное хранение""");
			Возврат Неопределено;
		КонецЕсли;
		
	КонецФункции // ПечатьМХ1(ТабДокумент)
	
	// ----- Соколмоторс -----  
	
	//Иванченко 20251209 ++ 
	Функция ПечатьДоговорКомиссии(ТабДокумент) Экспорт
		//Иванченко 20260125 ++   
		СтруктураПараметров = ПолучитьСтруктуру();     
		
		Если СтруктураПараметров = NULL Тогда
			Возврат	Неопределено;		
		КонецЕсли;
		//Иванченко 20260125 -- 
		
		
		Макет = ПолучитьМакет("ДоговорКомиссии");  
		ЗаполнитьЗначенияСвойств(Макет.Параметры, СтруктураПараметров);	  
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("Шапка")); 
		
		Для Счетчик = 1 По 12 Цикл  
			ТекущаяОбласть = Макет.ПолучитьОбласть("П" + Строка(Счетчик)); 
			
			Если Счетчик = 12 И Не ТабДокумент.ПроверитьВывод(ТекущаяОбласть) Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;   
			
			ТабДокумент.Вывести(ТекущаяОбласть);	
		КонецЦикла;  
		
		//Иванченко 20251223 ++  
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();  		
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("Приложение1"));  
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();    
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("Приложение2")); 
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("Приложение4"));  
		//Иванченко 20251223 --
		
		//Иванченко 20260127 ++		
		ТабДокумент.ПовторятьПриПечатиСтроки = ТабДокумент.Область(1,, 1); 
		//Иванченко 20260127 --		
		ЗаполнитьСвойстваТабДока(ТабДокумент, ТипДвустороннейПечати.ПереворотВлево);
		
		Возврат ТабДокумент;   		
		
	КонецФункции  
	
	////Овечкин 20260316 ++
	//Функция ПечатьДоговорКомиссииЮР(ТабДокумент) Экспорт
	//	//Иванченко 20260125 ++   
	//	СтруктураПараметров = ПолучитьСтруктуру();     
	//	
	//	Если СтруктураПараметров = NULL Тогда
	//		Возврат	Неопределено;		
	//	КонецЕсли;
	//	//Иванченко 20260125 -- 
	//	
	//	Макет = ПолучитьМакет("ДоговорКомиссииЮР");  
	//	ЗаполнитьЗначенияСвойств(Макет.Параметры, СтруктураПараметров);	
	//	ТабДокумент.Вывести(Макет.ПолучитьОбласть("Шапка")); 
	//	
	//	Для Счетчик = 1 По 12 Цикл  
	//		ТекущаяОбласть = Макет.ПолучитьОбласть("П" + Строка(Счетчик)); 
	//		
	//		Если Счетчик = 12 И Не ТабДокумент.ПроверитьВывод(ТекущаяОбласть) Тогда
	//			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//		КонецЕсли;   
	//		
	//		ТабДокумент.Вывести(ТекущаяОбласть);	
	//	КонецЦикла; 
	//	
	//	//Иванченко 20251223 ++  
	//	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
	//	
	//	ТабДокумент.Вывести(Макет.ПолучитьОбласть("Приложение1"));  
	//	
	//	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//	
	//	ТабДокумент.Вывести(Макет.ПолучитьОбласть("Приложение2")); 
	//	
	//	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//	
	//	ТабДокумент.Вывести(Макет.ПолучитьОбласть("Приложение4"));  
	//	//Иванченко 20251223 --
	//	
	//	//Иванченко 20260127 ++		
	//	ТабДокумент.ПовторятьПриПечатиСтроки = ТабДокумент.Область(1,, 1); 
	//	//Иванченко 20260127 --		
	//	ЗаполнитьСвойстваТабДока(ТабДокумент, ТипДвустороннейПечати.ПереворотВлево);
	//	
	//	Возврат ТабДокумент;   		
	//	
	//КонецФункции  
	//Иванченко 20251209 -- 
	
	//Иванченко 20260803 ++ 
	Функция ПечатьДоговорКомиссииВыходногоДня(ТабДокумент) Экспорт
		СтруктураПараметров = ПолучитьСтруктуру();     
		
		Если СтруктураПараметров = NULL Тогда
			Возврат	Неопределено;		
		КонецЕсли;
		
		Макет = ПолучитьМакет("ДоговорКомиссииВыходногоДня");  
		ЗаполнитьЗначенияСвойств(Макет.Параметры, СтруктураПараметров);	  
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("Шапка")); 
		
		Для Счетчик = 1 По 8 Цикл  
			ТекущаяОбласть = Макет.ПолучитьОбласть("П" + Строка(Счетчик)); 
			
			Если Счетчик = 8 И Не ТабДокумент.ПроверитьВывод(ТекущаяОбласть) Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;   
			
			ТабДокумент.Вывести(ТекущаяОбласть);	
		КонецЦикла;  
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();  		
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("Приложение1"));  
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();    
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("Приложение2")); 
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("Приложение4"));  
		
		ТабДокумент.ПовторятьПриПечатиСтроки = ТабДокумент.Область(1,, 1); 
		ЗаполнитьСвойстваТабДока(ТабДокумент, ТипДвустороннейПечати.ПереворотВлево);
		
		Возврат ТабДокумент;   		
		
	КонецФункции  
	//Иванченко 20260803 --	
	
	// Процедура осуществляет печать документа. Можно направить печать на 
	// экран или принтер, а также распечатать необходимое количество копий.
	// Параметры: НазваниеМакета - строка, название макета, если пусто - то по умолчанию,
	//   Документ - сюда можно передать уже созданный табличный документ для заполнения
	Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=1, НаПринтер=Ложь, Документ=Неопределено) Экспорт
		// Вызов конкретно печатной формы и печать результата прописано в общем модуле
		// здесь могут быть вставлены дополнительные механизмы
		Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
	КонецФункции
	
	// Возвращает доступные варианты печати документа
	// Возвращаемое значение: Структура, каждая строка которой
	// соответствует одному из вариантов печати
	// Первый элемент структуры - форма по умолчанию
	Функция ПолучитьСписокПечатныхФорм() Экспорт
		СтруктураМакетов=Новый Структура();
		СтруктураМакетов.Вставить("ПоступлениеАвтомобилей", "Приходная накладная");
		СтруктураМакетов.Вставить("АктПриема", "Акт приема на комиссию"); 
		//Иванченко 20251209 ++  	
		//СтруктураМакетов.Вставить("ДоговорКомиссии", "Договор комиссии");
		
		Если ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилейКомиссия Тогда  
			СтруктураМакетов.Вставить("ДоговорКомиссии", "Агентский договор");
			//СтруктураМакетов.Вставить("ДоговорКомиссииЮР", "Агентский договор (юр.лицо)") 
		//Иванченко 20260803 ++	
			СтруктураМакетов.Вставить("ДоговорКомиссииВыходногоДня", "Агентский договор (краткосрочная экспозиция)");
		//Иванченко 20260803 --	
		КонецЕсли;
		
		//Иванченко 20251209 --	
		СтруктураМакетов.Вставить("ТОРГ1",  "ТОРГ-1 (Акт о приемке товара)");
		СтруктураМакетов.Вставить("ТОРГ4",  "ТОРГ-4 (Акт о приемке товаров без счета поставщика)");
		СтруктураМакетов.Вставить("ТОРГ12", "ТОРГ-12 (Товарная накладная за поставщика)");
		СтруктураМакетов.Вставить("ТОРГ13", "ТОРГ-13 (накладная на внутреннее перемещение)");
		СтруктураМакетов.Вставить("М4", "М-4 (Приходный ордер)");
		// +++++ Соколмоторс +++++
		Если ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилейОтветственноеХранение Тогда
			СтруктураМакетов.Вставить("МХ1","МХ-1 (Акт о приеме-передаче ТМЦ)");
		КонецЕсли;
		// ----- Соколмоторс ----- 
		
		Возврат СтруктураМакетов;
	КонецФункции
	
#КонецЕсли
// Если Клиент Тогда - завершена клиентская часть

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Процедура - обработчик ввода на основании
Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	//Бондаренко++ 20231124
	Если ТипЗнч(Основание) <> Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
		//Бондаренко-- 20231123	
		Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
		//Бондаренко++ 20231123
	Иначе
		Автор = ПараметрыСеанса.Пользователь;
		Организация = Основание.Организация;
		ПодразделениеКомпании = Основание.ПодразделениеКомпании;
		РегламентированныйУчет = Истина;
		ДокументОснование = Основание.Ссылка;
		Комментарий = "Создан автоматически для поступления по Trade-In "+Формат(ТекущаяДата(),"ДЛФ=DDT")+" пользователем: "+Автор;
		Дата = ТекущаяДата();
		Контрагент = Основание.ДокументОснование.СобственникТрейдИн;
		КурсВалютыВзаиморасчетов = 1;
		ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		КурсДокумента = 1;
		КурсВалютыУпр = 1;
		СкладКомпании = Справочники.СкладыКомпании.ОсновнойСкладКомпании;
		ТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенЗакупки;
		ВхДокДата = Дата;
		ВхДокНомер = Номер;
		ХозОперация = Справочники.ХозОперации.ПоставкаАвтомобилей;
		СтатусАвтомобиля = Справочники.СтатусыАвтомобилей.ПустаяСсылка(); 
		ДатаСоздания = ТекущаяДата();
		ДатаОперации = ТекущаяДата();
		//Бондаренко++ 20240515
		//Менеджер = ПараметрыСеанса.Пользователь.Сотрудник;
		Если обЗначениеНеЗаполнено(Основание.Менеджер) Тогда
			Менеджер = ПараметрыСеанса.Пользователь.Сотрудник;
		Иначе	
			Менеджер = Основание.Менеджер;
		КонецЕсли;
		//Бондаренко-- 20240515
	КонецЕсли;
	//Бондаренко-- 20231124   
	//Иванченко 20251112 ++
	Если ТипЗнч(Основание)=Тип("ДокументСсылка.РабочийЛистКомиссии") Тогда
		//Иванченко 20260303 ++ 
		ЗапросПоступление = Новый Запрос(
		"ВЫБРАТЬ
		|	ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль
		|ПОМЕСТИТЬ ВТ_Остаток
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(, Автомобиль = &Автомобиль) КАК ОстаткиАвтомобилейОстатки
		|ГДЕ
		|	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ОстаткиАвтомобилейОстаткиИОбороты.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_ДатаРеализации
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.ОстаткиИОбороты(
		|			,
		|			,
		|			Регистратор,
		|			,
		|			Автомобиль В
		|				(ВЫБРАТЬ
		|					ВТ_Остаток.Автомобиль
		|				ИЗ
		|					ВТ_Остаток)) КАК ОстаткиАвтомобилейОстаткиИОбороты
		|ГДЕ
		|	ОстаткиАвтомобилейОстаткиИОбороты.КоличествоНачальныйОстаток = 1
		|	И ОстаткиАвтомобилейОстаткиИОбороты.КоличествоКонечныйОстаток = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиАвтомобилейОстаткиИОбороты.Регистратор КАК Поступление
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.ОстаткиИОбороты(
		|			,
		|			,
		|			Регистратор,
		|			,
		|			Автомобиль В
		|				(ВЫБРАТЬ
		|					ВТ_Остаток.Автомобиль
		|				ИЗ
		|					ВТ_Остаток)) КАК ОстаткиАвтомобилейОстаткиИОбороты,
		|	ВТ_ДатаРеализации КАК ВТ_ДатаРеализации
		|ГДЕ
		|	ОстаткиАвтомобилейОстаткиИОбороты.КоличествоНачальныйОстаток = 0
		|	И ОстаткиАвтомобилейОстаткиИОбороты.КоличествоКонечныйОстаток = 1
		|	И ОстаткиАвтомобилейОстаткиИОбороты.Период >= ВТ_ДатаРеализации.Период");
		ЗапросПоступление.УстановитьПараметр("Автомобиль", Основание.Автомобиль);
		
		Результат_ЗапросПоступление = ЗапросПоступление.Выполнить();  
		
		Если Не Результат_ЗапросПоступление.Пустой() Тогда
			Выгрузка = Результат_ЗапросПоступление.Выгрузить()[0];
			Сообщить("ОШИБКА!! По автомобилю " + Основание.Автомобиль + " уже есть проведенный документ " + Выгрузка.Поступление, СтатусСообщения.ОченьВажное);
			Возврат;					
		КонецЕсли;
		//Иванченко 20260303 -- 
		
		Автор = ПараметрыСеанса.Пользователь;
		Организация = Основание.Организация;
		ПодразделениеКомпании = Основание.ПодразделениеКомпании;
		РегламентированныйУчет = Истина;
		ДокументОснование = Основание;
		Комментарий = "Создан автоматически для рабочего листа комиссии " + Основание.Номер + " от " + Формат(ТекущаяДата(),"ДЛФ=DDT")+" пользователем: "+Автор;
		Дата = ТекущаяДата();
		Контрагент = Основание.Контрагент;
		КурсВалютыВзаиморасчетов = 1;
		ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		КурсДокумента = 1;
		КурсВалютыУпр = 1;
		СкладКомпании = НайтиСкладАвтомобильный(ПодразделениеКомпании);
		ТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенЗакупки;
		ВхДокДата = Дата;
		ВхДокНомер = Основание.Номер;
		ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилейКомиссия;
		СтатусАвтомобиля = Справочники.СтатусыАвтомобилей.ПустаяСсылка(); 
		ДатаСоздания = ТекущаяДата();
		ДатаОперации = ТекущаяДата();
		ДоговорВзаиморасчетов = НайтиСоздатьДоговор(Контрагент,Организация,ПодразделениеКомпании,Перечисления.ВидыДоговоров.СКомитентом);		
		Менеджер = ПараметрыСеанса.Пользователь.Сотрудник;     
		СтрокаАвтомобиль = Автомобили.Добавить();
		СтрокаАвтомобиль.Автомобиль = Основание.Автомобиль;
		СтрокаАвтомобиль.ИдентификаторАвтомобиля = Строка(Новый УникальныйИдентификатор);  
		СтрокаАвтомобиль.ВидАвтомобиля = Перечисления.ВидАвтомобиля.АвтомобильСПробегом;
		
		//Иванченко 20260210 ++ 
		// Холышевская ++ 15.07.2026
		//Если Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
		СтрокаАвтомобиль.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;  
		//Иначе 
		//	Структура_ОтборСтавкаНДС = Новый Структура("Организация", Организация);
		//	Массив_СтавкаНДС = РегистрыСведений.УпрощеннаяСистемаНалогообложения.СрезПоследних(, Структура_ОтборСтавкаНДС).ВыгрузитьКолонку("СтавкаНДС");
		//	
		//	Если Массив_СтавкаНДС.Количество() = 0 Тогда  
		//		СтрокаАвтомобиль.СтавкаНДС = Справочники.СтавкиНДС.НДС22Процента;	
		//	Иначе
		//		СтрокаАвтомобиль.СтавкаНДС = Массив_СтавкаНДС[0];	
		//	КонецЕсли;	
		//	
		//КонецЕсли;
		// Холышевская -- 15.07.2026
		//Иванченко 20260210 --
		
		СтрокаАвтомобиль.АвтомобильБУ = Истина;
		ОбработкаРеквизита("Автомобили.Автомобиль",СтрокаАвтомобиль); 
			
		//Иванченко 20251113 ++ 
		Если СтрокаАвтомобиль.Цена = 0 Тогда
			СтрокаАвтомобиль.Цена = Основание.ЦенаПоступления;
		КонецЕсли;      
		
		Если СтрокаАвтомобиль.СуммаПродажи = 0 Тогда
			СтрокаАвтомобиль.СуммаПродажи = Основание.ПлановаяЦенаПродажи;
		КонецЕсли;
		//Иванченко 20251113 --	
		
	КонецЕсли;	 
	//Иванченко 20251112 --
	
	Если ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.ПоступлениеАвтомобилей") И
		ДокументОснование.ХозОперация=Справочники.ХозОперации.ПоступлениеАвтомобилейОтветственноеХранение Тогда
		
		ХозОперация=Справочники.ХозОперации.ПереходВСобственностьАвтомобилей;
		
		//Бондаренко++ 20250704
		Если Автомобили.Количество() > 0 Тогда
			Авто_ = Автомобили[0].Автомобиль;
			Если НЕ обЗначениеНеЗаполнено(Авто_) Тогда
				ОтгрузкаАвтомобиляБезРеализации = НайтиОАБР(Авто_);	
			КонецЕсли;
		КонецЕсли;
		//Бондаренко-- 20250704
		
		// проверим всели заказы досихпор используются
		ПерезаполнитьЗаказы();
	КонецЕсли; 
	
	ТекущаяВалютаДокумента=ВалютаДокумента;
	ТекущийКурсДокумента=КурсДокумента;
	
	// Семенихин 19.03.2021 +++++
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеАвтомобилей") И
		ХозОперация = Справочники.ХозОперации.ПереходВСобственностьАвтомобилей Тогда
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		|	ОстаткиАвтомобилейОстатки.СуммаОстаток,
		|	ОстаткиАвтомобилейОстатки.СуммаУпрОстаток,
		|	ОстаткиАвтомобилейОстатки.СуммаНДСОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(
		|			&ТекущаяДата,
		|			Автомобиль = &Автомобиль) КАК ОстаткиАвтомобилейОстатки";
		
		Запрос.Параметры.Вставить("ТекущаяДата", ТекущаяДата());
		
		Для Каждого СтрокаАвто Из Автомобили Цикл
			Запрос.Параметры.Вставить("Автомобиль", СтрокаАвто.Автомобиль);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				СтрокаАвто.СуммаВсего = Выборка.СуммаОстаток;
				ОбработкаРеквизита("Автомобили.СуммаВсего", СтрокаАвто)
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказНаВыкупАвтомобиля") Тогда
		//ВхДокНомер = ДокументОснование.Номер;
		НоваяСтрока = Автомобили.Добавить();
		Автомобиль = ДокументОснование.Автомобиль;
		НоваяСтрока.Автомобиль = Автомобиль;
		НоваяСтрока.VIN = Автомобиль.VIN;
		НоваяСтрока.ИдентификаторАвтомобиля = Новый УникальныйИдентификатор;
		НоваяСтрока.Количество = 1;
		НоваяСтрока.АвтомобильБУ = Истина;
		НоваяСтрока.АвтомобильБезЗаказа = Истина;
		НоваяСтрока.СтавкаНДС = ДокументОснование.СтавкаНДСНаАвтомобиль;
		НоваяСтрока.Цена = ДокументОснование.СуммаДокумента;
		ОбработкаРеквизита("Автомобили.Цена", НоваяСтрока);
		//Бондаренко++ 20231123	
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
		ВхДокНомер = Номер; 
		ВхДокДата = Дата; 
		ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилей;
		СкладКомпании = НайтиСкладАвтомобильный(ПодразделениеКомпании);
		ДоговорВзаиморасчетов = НайтиСоздатьДоговор(Контрагент,Организация,ПодразделениеКомпании,Перечисления.ВидыДоговоров.Покупка);
		Автомобили.Очистить();
		НоваяСтрока = Автомобили.Добавить();
		Автомобиль = ДокументОснование.РабочийЛист.АвтомобильТрейдИн;
		НоваяСтрока.Автомобиль = Автомобиль;
		НоваяСтрока.VIN = Автомобиль.VIN;
		НоваяСтрока.ИдентификаторАвтомобиля = Новый УникальныйИдентификатор;
		НоваяСтрока.Количество = 1;
		НоваяСтрока.АвтомобильБУ = Истина;
		НоваяСтрока.АвтомобильБезЗаказа = Истина;
		НоваяСтрока.ВидАвтомобиля = Перечисления.ВидАвтомобиля.АвтомобильСПробегом;
		НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
		НоваяСтрока.Цена = ДокументОснование.РабочийЛист.ЦенаДКПТрейдИн;
		Попытка
			НоваяСтрока.ЦенаОферты = ДокументОснование.ДокументОснование.ЦенаМинРыночнаяТрейдИн;
		Исключение
		КонецПопытки;
		ОбработкаРеквизита("Автомобили.Цена", НоваяСтрока);	
		//Бондаренко-- 20231123
		//Бондаренко++ 20240409	
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияАвтомобилей") Тогда
		
		ВхДокНомер = ДокументОснование.Номер; 
		ВхДокДата = ДокументОснование.Дата; 
		ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилей;
		ПодразделениеКомпании = ДокументОснование.ПодразделениеКонтрагента;
		Организация = ДокументОснование.ПодразделениеКонтрагента.Организация;
		Контрагент = ДокументОснование.Организация.КонтрагентОрганизации;
		СкладКомпании = НайтиСкладАвтомобильный(ПодразделениеКомпании);
		ДоговорВзаиморасчетов = НайтиСоздатьДоговор(Контрагент,Организация,ПодразделениеКомпании,Перечисления.ВидыДоговоров.Покупка);
		//Бондаренко++ 20240424
		УстановитьНовыйНомер();
		//Бондаренко-- 20240424
		
		Для Каждого СтрокаАвто Из Автомобили Цикл                               
			НомерСтроки = СтрокаАвто.НомерСтроки;
			СтрокаАвто.VIN = СтрокаАвто.Автомобиль.VIN; 
			
			//Иванченко 20260501 ++ 
			Если Контрагент.НашаФирма Тогда
				СтрокаАвто.СтавкаНДС = Справочники.СтавкиНДС.НДС22ПроцентаРасчетная; 
			КонецЕсли;
			//Иванченко 20260501 --
			СтрокаАвто.АвтомобильБезЗаказа = Истина; 
			СтрокаАвто.ВидАвтомобиля = ДокументОснование.ДокументОснование.ВидАвтомобиля; 
		КонецЦикла;
		//Бондаренко-- 20240409
		//Бондаренко++ 20241130
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщикуНаАвтомобиль") Тогда
		
		Если обЗначениеНеЗаполнено(ДокументОснование.ВхДокНомер) Тогда
			ВхДокНомер = "б/н"; 
		Иначе	
			ВхДокНомер = ДокументОснование.ВхДокНомер; 
		КонецЕсли;
		
		Если ДокументОснование.ВхДокДата = Дата(1,1,1) Тогда
			ВхДокДата = ТекущаяДата(); 
		Иначе	
			ВхДокДата = ДокументОснование.ВхДокДата; 
		КонецЕсли;
		
		Если ДокументОснование.ПоступлениеНаОтветственноеХранение Тогда
			ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилейОтветственноеХранение;
		Иначе	
			ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилей;
		КонецЕсли;
		
		Если обЗначениеНеЗаполнено(Дата) Тогда
			Дата_ = ТекущаяДата();
		Иначе	
			Дата_ = Дата;
		КонецЕсли;
		
		Для Каждого СтрокаАвто Из Автомобили Цикл                               
			
			НомерСтроки = СтрокаАвто.НомерСтроки;
			
			СтрокаАвто.VIN = СтрокаАвто.Автомобиль.VIN;
			СтрокаАвто.АвтомобильБезЗаказа = Ложь;                                                                                                                               
			СтрокаАвто.ВидАвтомобиля = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(СтрокаАвто.Автомобиль,Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля,Дата_);
			СтрокаАвто.ЗаказНаАвтомобиль = ДокументОснование;
			Если СтрокаАвто.ВидАвтомобиля = Перечисления.ВидАвтомобиля.Новый Тогда
				СтрокаАвто.АвтомобильНовый = Истина;
				СтрокаАвто.АвтомобильБУ = Ложь;
				СтрокаАвто.ПараллельныйИмпорт = Ложь;
			ИначеЕсли СтрокаАвто.ВидАвтомобиля = Перечисления.ВидАвтомобиля.АвтомобильСПробегом Тогда	
				СтрокаАвто.АвтомобильНовый = Ложь;
				СтрокаАвто.АвтомобильБУ = Истина;
				СтрокаАвто.ПараллельныйИмпорт = Ложь;
			ИначеЕсли СтрокаАвто.ВидАвтомобиля = Перечисления.ВидАвтомобиля.ПараллельныйИмпорт Тогда	
				СтрокаАвто.АвтомобильНовый = Истина;
				СтрокаАвто.АвтомобильБУ = Ложь;
				СтрокаАвто.ПараллельныйИмпорт = Истина;
			ИначеЕсли СтрокаАвто.ВидАвтомобиля = Перечисления.ВидАвтомобиля.ПараллельныйИмпортБУ Тогда	
				СтрокаАвто.АвтомобильНовый = Ложь;
				СтрокаАвто.АвтомобильБУ = Истина;
				СтрокаАвто.ПараллельныйИмпорт = Истина;
			КонецЕсли;
			
			ОбработкаРеквизита("Автомобили.Автомобиль",СтрокаАвто);
			
		КонецЦикла;
		//Бондаренко-- 20241130	 
	КонецЕсли;
	// Семенихин 19.03.2021 -----
	
	//Бондаренко++ 20241130
	
	СкладКомпании = НайтиСкладДляПоступленияАвто(ПодразделениеКомпании);
	//Бондаренко-- 20241130
КонецПроцедуры

//Бондаренко++ 20241130
Функция НайтиСкладДляПоступленияАвто(ПодразделениеКомпании) Экспорт
	
	СкладДляПоступленияАвто_ = Неопределено;
	
	СписокОрганизаций = Новый СписокЗначений;
	
	//Иванченко 2025112 ++
	//Если ЗначениеЗаполнено(ПодразделениеКомпании.ПерепродажаАвто) Тогда          
	Если ЗначениеЗаполнено(ПодразделениеКомпании.ПерепродажаАвто) И Не ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилейКомиссия Тогда          
		//Иванченко 2025112 --		
		СписокОрганизаций.Добавить(ПодразделениеКомпании.ПерепродажаАвто);
	Иначе
		СписокОрганизаций.Добавить(ПодразделениеКомпании.Организация);
	КонецЕсли;
	
	Если СписокОрганизаций.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкладыКомпании.Ссылка КАК Склад,
		|	СкладыКомпании.ПометкаУдаления КАК ПометкаУдаления,
		|	СкладыКомпании.ЭтоГруппа КАК ЭтоГруппа,
		|	СкладыКомпании.Подразделение КАК Подразделение,
		|	СкладыКомпании.ТипСклада КАК ТипСклада,
		|	СкладыКомпании.ВидСклада КАК ВидСклада,
		|	СкладыКомпании.Организация КАК Организация,
		|	СкладыКомпании.Основной КАК Основной
		|ИЗ
		|	Справочник.СкладыКомпании КАК СкладыКомпании
		|ГДЕ
		|	НЕ СкладыКомпании.ПометкаУдаления
		|	И НЕ СкладыКомпании.ЭтоГруппа
		|	И СкладыКомпании.ТипСклада = &ТипСклада
		|	И СкладыКомпании.ВидСклада = &ВидСклада
		|	И СкладыКомпании.Подразделение В ИЕРАРХИИ(&Подразделение)
		|	И СкладыКомпании.Организация В(&СписокОрганизаций)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Основной УБЫВ";
		
		Запрос.УстановитьПараметр("ТипСклада",Перечисления.ТипыСкладов.Автомобильный);
		Запрос.УстановитьПараметр("ВидСклада",Перечисления.ВидыСкладов.Обычный);
		Запрос.УстановитьПараметр("Подразделение",ПодразделениеКомпании);
		Запрос.УстановитьПараметр("СписокОрганизаций",СписокОрганизаций);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СкладДляПоступленияАвто_ = ВыборкаДетальныеЗаписи.Склад;
			Прервать;
		КонецЦикла;
		
	Иначе	
		
		СМГ_Сообщить("ОШИБКА! Не найдена организация для поступления автомобилей.",СтатусСообщения.ОченьВажное);	
		
	КонецЕсли;
	
	Если СкладДляПоступленияАвто_ = Неопределено Тогда
		СМГ_Сообщить("ОШИБКА! Не найден склад для поступления авто по подразделению """+ПодразделениеКомпании.ПерепродажаАвто+"""",СтатусСообщения.ОченьВажное);
	КонецЕсли;
	
	Возврат СкладДляПоступленияАвто_;
	
КонецФункции // НайтиСкладПоступленияАвто()
//Бондаренко-- 20241130

Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры

//Бондаренко++ 20251024	
Функция ПолучитьОстатокАвтоНаТД(Авто_)
	
	ОстатокАвто_  = 0;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль,
	|	ОстаткиАвтомобилейОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилейОстатки
	|ГДЕ
	|	ОстаткиАвтомобилейОстатки.Автомобиль = &Автомобиль";
	
	Запрос.УстановитьПараметр("Автомобиль", Авто_);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если ТЗ.Количество() > 0 Тогда
		ОстатокАвто_ = ТЗ[0].КоличествоОстаток;
	КонецЕсли;
	
	Возврат ОстатокАвто_;
	
КонецФункции // ПолучитьОстатокАвтоНаТД(Авто_) 
//Бондаренко-- 20251024	

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//Бондаренко++ 20251024
	Если ХозОперация <> Справочники.ХозОперации.ПереходВСобственностьАвтомобилей
		И РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		
		Для каждого Стр Из Автомобили Цикл
			Авто_ = Стр.Автомобиль;
			ОстатокАвто_ = 0;
			ОстатокАвто_ = ПолучитьОстатокАвтоНаТД(Авто_);
			
			Если ( Проведен И ОстатокАвто_ > 1 ) ИЛИ ( НЕ Проведен И ОстатокАвто_ > 0 ) Тогда
				#Если Клиент Тогда
					Предупреждение("ОШИБКА! На текущую дату """ + Авто_ + """ уже есть на остатках!",10);
					СМГ_Сообщить("ОШИБКА! На текущую дату """ + Авто_ + """ уже есть на остатках!",СтатусСообщения.ОченьВажное);
				#КонецЕсли
				Отказ=Истина; 
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	//Бондаренко-- 20251024
	
	ДополнительныеСвойства.Вставить("ДоговорВзаиморасчетовБыл");
	ДополнительныеСвойства.Вставить("АвтомобильСкладКомпанииБыл");
	ДополнительныеСвойства.Вставить("АвтомобильБыл");
	ДополнительныеСвойства.Вставить("АвтомобильЗаказБыл");
	ДополнительныеСвойства.Вставить("МоментВремениБыл");
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	//Проверим корректность склада
	Если НЕ Отказ Тогда
		Если НЕ обЗначениеНеЗаполнено(СкладКомпании) Тогда
			Если СкладКомпании.Розничный Тогда
				#Если Клиент Тогда
					Предупреждение("Выбранный склад: """ + СкладКомпании + """ является розничным!
					|Выберите оптовый склад",10);
				#КонецЕсли
				Отказ=Истина; Возврат;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 	
	
	//Проверим расстановку флажков, для поступления автомобилей без заказа
	Для Каждого СтрокаАвтомобиля Из Автомобили Цикл
		Если обЗначениеНеЗаполнено(СтрокаАвтомобиля.ЗаказНаАвтомобиль) И СтрокаАвтомобиля.АвтомобильБезЗаказа=Ложь Тогда
			Сообщить("Автомобиль <"+СокрЛП(СтрокаАвтомобиля.Автомобиль)+"> поступает без заказа. Установите признак поступления автомобиля без заказа.");
			Отказ=Истина;
		КонецЕсли; 
	КонецЦикла; 
	
	//Бондаренко++ 20230202
	Если Дата >= ДеньСКоторогоНуженВидАвто Тогда
		Для Каждого СтрокаАвтомобиля Из Автомобили Цикл
			Если обЗначениеНеЗаполнено(СтрокаАвтомобиля.ВидАвтомобиля) Тогда
				СМГ_Сообщить("Для <"+СокрЛП(СтрокаАвтомобиля.Автомобиль)+"> не выбран 'Вид автомобиля'.",СтатусСообщения.ОченьВажное);
				Отказ=Истина; 
			Иначе
				Если СтрокаАвтомобиля.ВидАвтомобиля=Перечисления.ВидАвтомобиля.ПараллельныйИмпорт ИЛИ СтрокаАвтомобиля.ВидАвтомобиля=Перечисления.ВидАвтомобиля.ПараллельныйИмпортБУ Тогда
					СтрокаАвтомобиля.ПараллельныйИмпорт=Истина;	
					СтрокаАвтомобиля.АвтомобильБУ=Ложь;
					СтрокаАвтомобиля.АвтомобильНовый=Ложь;
				ИначеЕсли СтрокаАвтомобиля.ВидАвтомобиля=Перечисления.ВидАвтомобиля.АвтомобильСПробегом Тогда
					СтрокаАвтомобиля.ПараллельныйИмпорт=Ложь;	
					СтрокаАвтомобиля.АвтомобильБУ=Истина;
					СтрокаАвтомобиля.АвтомобильНовый=Ложь;
				ИначеЕсли СтрокаАвтомобиля.ВидАвтомобиля=Перечисления.ВидАвтомобиля.Новый Тогда
					СтрокаАвтомобиля.ПараллельныйИмпорт=Ложь;	
					СтрокаАвтомобиля.АвтомобильБУ=Ложь;
					СтрокаАвтомобиля.АвтомобильНовый=Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;  
	КонецЕсли;
	//Бондаренко++ 20230202
	
	// получим старые значения, влияющие на границы последовательности
	Если НЕ Отказ И Проведен И РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		
		БылиДвижения = Ложь;
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		// взаиморасчеты
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ДоговорВзаиморасчетов ИЗ РегистрНакопления.ВзаиморасчетыКомпании ГДЕ Регистратор=&Ссылка";
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			БылиДвижения = Истина;
			ДополнительныеСвойства.Вставить("ДоговорВзаиморасчетовБыл", Результат.Выгрузить().ВыгрузитьКолонку("ДоговорВзаиморасчетов"));
		КонецЕсли;
		
		// заказы
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Заказы.Автомобиль КАК Автомобиль
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗаказыПокупателей.Автомобиль КАК Автомобиль
		|	ИЗ
		|		РегистрНакопления.ЗаказыАвтомобилей КАК ЗаказыПокупателей
		|	ГДЕ
		|		ЗаказыПокупателей.Регистратор = &Ссылка
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		ЗаказыПоставщикам.Автомобиль
		|	ИЗ
		|		РегистрНакопления.ЗаказыПоставщикамНаАвтомобили КАК ЗаказыПоставщикам
		|	ГДЕ
		|		ЗаказыПоставщикам.Регистратор = &Ссылка
		|	) КАК Заказы";
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			БылиДвижения = Истина;
			ДополнительныеСвойства.Вставить("АвтомобильЗаказБыл", Результат.Выгрузить().ВыгрузитьКолонку("Автомобиль"));
		КонецЕсли;
		
		// автомобили
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ СкладКомпании ИЗ РегистрНакопления.ОстаткиАвтомобилей ГДЕ Регистратор=&Ссылка";
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			БылиДвижения = Истина;
			ДополнительныеСвойства.Вставить("АвтомобильСкладКомпанииБыл", Результат.Выгрузить().ВыгрузитьКолонку("СкладКомпании"));
		КонецЕсли;
		
		// комплектация
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ Автомобиль ИЗ РегистрНакопления.КомплектацияАвтомобилей ГДЕ Регистратор=&Ссылка";
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			БылиДвижения = Истина;
			ДополнительныеСвойства.Вставить("АвтомобильБыл", Результат.Выгрузить().ВыгрузитьКолонку("Автомобиль"));
		КонецЕсли;
		
		// прошлый момент времени
		Если БылиДвижения Тогда
			Запрос.Текст = "ВЫБРАТЬ МоментВремени ИЗ Документ."+Метаданные().Имя+" ГДЕ Ссылка=&Ссылка";
			ДополнительныеСвойства.Вставить("МоментВремениБыл",Запрос.Выполнить().Выгрузить().Получить(0).МоментВремени);
		КонецЕсли;
		
	КонецЕсли;
	
	//Иванченко 20260507 ++  
	Если РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если Контрагент.НашаФирма Тогда
			Отбор_СтавкаНДСОрганизации = Новый Структура("Организация", ДокументОснование.Организация);
			ЗаписьРС_УСН = РегистрыСведений.УпрощеннаяСистемаНалогообложения.ПолучитьПоследнее(, Отбор_СтавкаНДСОрганизации);
			СтавкаНДСОрганизации = ЗаписьРС_УСН.СтавкаНДС;
			СтавкаНДСОрганизацииРасчетная = НайтиСтавкуНДСРасчетную(СтавкаНДСОрганизации); 
			
			Для каждого СтрокаАвто Из Автомобили Цикл
				
				// Холышевская ++ 16.07.2026 убыточные организации 				
				Если ПоследнимВладельцемАвтоБылЮрик(СтрокаАвто.Автомобиль) Тогда
				Иначе
					Если г_Функции.ПроверитьВидАвтоДляУбыточныхОрганизаций(СтрокаАвто.Автомобиль) 
						И ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.РеализацияАвтомобилей")
						И ТипЗнч(ДокументОснование.ДокументОснование)=Тип("ДокументСсылка.РабочийЛист") Тогда
						
						Наценка = ?(ДокументОснование.ДокументОснование.Инвойс*0.005 >= 1000, ДокументОснование.ДокументОснование.Инвойс*0.005 , 1000);
					Иначе
						Наценка = 1000;
					КонецЕсли;
					// Холышевская -- 16.07.2026
					
					Если СтрокаАвто.СтавкаНДС <> СтавкаНДСОрганизацииРасчетная 
						// Холышевская ++ 16.07.2026 убыточные организации
						//ИЛИ СтрокаАвто.СуммаНДС <> 1000 * СтавкаНДСОрганизацииРасчетная.Ставка / (100 + СтавкаНДСОрганизацииРасчетная.Ставка) Тогда
						//СтрокаАвто.СуммаНДС = 1000 * СтавкаНДСОрганизацииРасчетная.Ставка / (100 + СтавкаНДСОрганизацииРасчетная.Ставка);
						ИЛИ СтрокаАвто.СуммаНДС <> Наценка * СтавкаНДСОрганизацииРасчетная.Ставка / (100 + СтавкаНДСОрганизацииРасчетная.Ставка) Тогда
						СтрокаАвто.СуммаНДС = Наценка * СтавкаНДСОрганизацииРасчетная.Ставка / (100 + СтавкаНДСОрганизацииРасчетная.Ставка);
						// Холышевская -- 16.07.2026
					КонецЕсли;
					//Овечкин 20260826++ (для ручной перепродажи без РЛ)
					Если ТипЗнч(ДокументОснование.ДокументОснование)<>Тип("ДокументСсылка.РабочийЛист") Тогда
						СтрокаАвто.СуммаНДС = ДокументОснование.СуммаНДС;
					КонецЕсли;
					//Овечкин 20260826-- (для ручной перепродажи без РЛ)
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли; 
	КонецЕсли;
	//Иванченко 20260507 --
	
	//Бондаренко++ 20190430
	СуммаНДС = Автомобили.Итог("СуммаНДС")+Опции.Итог("СуммаНДС");
	//Бондаренко-- 20190430 
	
	//Бондаренко++ 20230825
	СуммаОферты = Автомобили.Итог("ЦенаОферты");
	//Бондаренко-- 20230825 
	
	//Иванченко 20260213 ++ 
	Если Не (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("СМ_РуководительОтделаЛогистики") ИЛИ РольДоступна("СМ_АудиторСервиса")) Тогда	
		
		//Иванченко 20260210 ++ 
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РабочийЛистКомиссии") И Не Проведен И РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда 
			ПоступлениеКомиссия = ПолучитьПоступлениеКомиссия();
			
			Если ПоступлениеКомиссия <> NULL Тогда
				
				//Иванченко 20260713 ++ 
				Если ПоступлениеКомиссия.Проведен Тогда
				//Иванченко 20260713 --  
					
					#Если Клиент Тогда
						Сообщить("У автомобиля " + Автомобили[0].Автомобиль + " уже есть проведенное поступление " + СокрЛП(ПоступлениеКомиссия.Ссылка.Номер) + " от " + Формат(ПоступлениеКомиссия.Ссылка.Дата, "ДФ=dd.MM.yyyy") + ". Отказано в записи.", СтатусСообщения.ОченьВажное); 
					#КонецЕсли 
					
				//Иванченко 20260713 ++ 
				Иначе     
				
					#Если Клиент Тогда
						Сообщить("У автомобиля " + Автомобили[0].Автомобиль + " уже есть непроведенное поступление " + СокрЛП(ПоступлениеКомиссия.Ссылка.Номер) + " от " + Формат(ПоступлениеКомиссия.Ссылка.Дата, "ДФ=dd.MM.yyyy") + ", перейдите в это поступление и проведите его. Отказано в записи.", СтатусСообщения.ОченьВажное); 
					#КонецЕсли 
	
				КонецЕсли;
				//Иванченко 20260713 --  
					
				Отказ = Истина;
				
				Возврат; 
								
			КонецЕсли;
			
		КонецЕсли;	
		//Иванченко 20260210 --	
	КонецЕсли;	
	//Иванченко 20260213 --	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Если (Не Отказ) И ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		//Проверим VIN автомобилей
		Для Каждого СтрокаАвтомобиля Из Автомобили Цикл
			ТекVIN = СтрокаАвтомобиля.Автомобиль.VIN;
			
			Если СтрокаАвтомобиля.VIN = ТекVIN Тогда
				Если ПустаяСтрока(СтрокаАвтомобиля.VIN) Тогда
					Сообщить("У автомобиля <"+СокрЛП(СтрокаАвтомобиля.Автомобиль)+"> не задан VIN. Заполните VIN автомобиля.");
					Отказ = Истина;
				Иначе
					//ОбъектАвтомобиль = СтрокаАвтомобиля.Автомобиль.ПолучитьОбъект();
					
					//Бондаренко++ 20230317
					Хозяин = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(СтрокаАвтомобиля.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин);
					Если ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилей ИЛИ ХозОперация = Справочники.ХозОперации.ПереходВСобственностьАвтомобилей Тогда
						Если Хозяин <> Организация.КонтрагентОрганизации Тогда
							Попытка 
								Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(СтрокаАвтомобиля.Автомобиль, Организация.КонтрагентОрганизации, Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин, Дата);		
							Исключение
							КонецПопытки; 
						КонецЕсли;
					КонецЕсли;
					//Бондаренко-- 20230317
					
					//Бондаренко++ 20251023
					ГаражныйНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(СтрокаАвтомобиля.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГаражныйНомер,НачалоДня(Дата));
					Если СтрокаАвтомобиля.ГаражныйНомер <> ГаражныйНомер Тогда
						Если НЕ обЗначениеНеЗаполнено(СтрокаАвтомобиля.ГаражныйНомер) Тогда
							Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(СтрокаАвтомобиля.Автомобиль,СтрокаАвтомобиля.ГаражныйНомер,Перечисления.ДополнительнаяИнформацияАвтомобилей.ГаражныйНомер,НачалоДня(Дата));
						КонецЕсли;
					КонецЕсли;		
					//Бондаренко-- 20251023
					
					//Бондаренко++ 20230202	
					Если Дата >= ДеньСКоторогоНуженВидАвто Тогда
						Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(СтрокаАвтомобиля.Автомобиль, СтрокаАвтомобиля.ВидАвтомобиля, Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля, Дата);	
					Иначе 
						//Бондаренко-- 20230202	
						Если СтрокаАвтомобиля.АвтомобильБУ Тогда
							Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(СтрокаАвтомобиля.Автомобиль, Перечисления.ВидАвтомобиля.АвтомобильСПробегом, Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля, Дата);
						ИначеЕсли СтрокаАвтомобиля.АвтомобильНовый Тогда
							Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(СтрокаАвтомобиля.Автомобиль, Перечисления.ВидАвтомобиля.Новый, Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля, Дата);
							//Бондаренко++ 20230119
						ИначеЕсли СтрокаАвтомобиля.ПараллельныйИмпорт Тогда
							Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(СтрокаАвтомобиля.Автомобиль, Перечисления.ВидАвтомобиля.ПараллельныйИмпортБУ, Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля, Дата);
							//Бондаренко-- 20230119
						КонецЕсли;
						//Бондаренко++ 20230202	
					КонецЕсли;
					//Бондаренко-- 20230202	
					
					//Бондаренко++ 20161107
					Если СтрокаАвтомобиля.ДатаКонсигнации <> Дата(1,1,1) Тогда
						Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(СтрокаАвтомобиля.Автомобиль, СтрокаАвтомобиля.ДатаКонсигнации , Перечисления.ДополнительнаяИнформацияАвтомобилей.ДатаКонсигнации, Дата);	
					КонецЕсли;
					//Бондаренко-- 20161107 
					
					//Бондаренко++ 20241115
					Если СтрокаАвтомобиля.ДатаОкончанияОтсрочкиОплаты <> Дата(1,1,1) Тогда
						//Бондаренко-- 20241115	
						Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(СтрокаАвтомобиля.Автомобиль, СтрокаАвтомобиля.ДатаОкончанияОтсрочкиОплаты , Перечисления.ДополнительнаяИнформацияАвтомобилей.ДатаОкончанияОтсрочкиОплаты, Дата);	
						//Бондаренко++ 20241115		
					КонецЕсли;
					//Бондаренко-- 20241115	
					
					//Бондаренко++ 20220913
					Если СтрокаАвтомобиля.ПараллельныйИмпорт Тогда					
						Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(СтрокаАвтомобиля.Автомобиль, Истина, Перечисления.ДополнительнаяИнформацияАвтомобилей.ПараллельныйИмпорт, Дата);
					Иначе     
						Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(СтрокаАвтомобиля.Автомобиль, Ложь, Перечисления.ДополнительнаяИнформацияАвтомобилей.ПараллельныйИмпорт, Дата);	
					КонецЕсли;						
					//Бондаренко-- 20220913					
				КонецЕсли;
			ИначеЕсли НЕ ПустаяСтрока(СтрокаАвтомобиля.VIN) Тогда
				Если ПустаяСтрока(ТекVIN) Тогда
					ОбъектАвтомобиль = СтрокаАвтомобиля.Автомобиль.ПолучитьОбъект();
					ОбъектАвтомобиль.VIN = СтрокаАвтомобиля.VIN;
					//Получить последний ГосНомер
					ГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ОбъектАвтомобиль.Ссылка, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
					ОбъектАвтомобиль.ФормированиеНаименованияАвтомобиля(ГосНомер);
					Попытка
						ТекстОшибки = "";
						ОбъектАвтомобиль.ПроверитьКорректность(ТекстОшибки);
						Если Не ПустаяСтрока(ТекстОшибки) Тогда
							Сообщить("Ошибка ввода VIN. В автомобиле <"+СокрЛП(СтрокаАвтомобиля.Автомобиль)+"> " + ТекстОшибки);
							Отказ = Истина;
							Продолжить;
						КонецЕсли;
						
						ОбъектАвтомобиль.Записать();
						Если СтрокаАвтомобиля.АвтомобильБУ Тогда
							Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(ОбъектАвтомобиль.Ссылка, Перечисления.ВидАвтомобиля.АвтомобильСПробегом, Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля, Дата);
						ИначеЕсли СтрокаАвтомобиля.АвтомобильНовый Тогда
							Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(ОбъектАвтомобиль.Ссылка, Перечисления.ВидАвтомобиля.Новый, Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля, Дата);
							//Бондаренко++ 20230119	
						ИначеЕсли СтрокаАвтомобиля.ПараллельныйИмпорт Тогда
							Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(ОбъектАвтомобиль.Ссылка, Перечисления.ВидАвтомобиля.ПараллельныйИмпортБУ, Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля, Дата);
							//Бондаренко-- 20230119
						КонецЕсли;
						
						//Бондаренко++ 20161107
						Если СтрокаАвтомобиля.ДатаКонсигнации <> Дата(1,1,1) Тогда
							Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(ОбъектАвтомобиль.Ссылка, СтрокаАвтомобиля.ДатаКонсигнации , Перечисления.ДополнительнаяИнформацияАвтомобилей.ДатаКонсигнации, Дата);	
						КонецЕсли;
						//Бондаренко-- 20161107 
						
						//Бондаренко++ 20241115
						Если СтрокаАвтомобиля.ДатаОкончанияОтсрочкиОплаты <> Дата(1,1,1) Тогда
							//Бондаренко-- 20241115	
							Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(СтрокаАвтомобиля.Автомобиль, СтрокаАвтомобиля.ДатаОкончанияОтсрочкиОплаты , Перечисления.ДополнительнаяИнформацияАвтомобилей.ДатаОкончанияОтсрочкиОплаты, Дата);	
							//Бондаренко++ 20241115 	
						КонецЕсли;	
						//Бондаренко-- 20241115 
						
						//Бондаренко++ 20220913
						Если СтрокаАвтомобиля.ПараллельныйИмпорт Тогда					
							Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(СтрокаАвтомобиля.Автомобиль, Истина, Перечисления.ДополнительнаяИнформацияАвтомобилей.ПараллельныйИмпорт, Дата);
						Иначе     
							Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(СтрокаАвтомобиля.Автомобиль, Ложь, Перечисления.ДополнительнаяИнформацияАвтомобилей.ПараллельныйИмпорт, Дата);	
						КонецЕсли;						
						//Бондаренко-- 20220913					
						
					Исключение
						Отказ = Истина;
						Возврат;
					КонецПопытки;
				Иначе
					Сообщить("Ошибка ввода VIN. В автомобиле <"+СокрЛП(СтрокаАвтомобиля.Автомобиль)+"> задан другой VIN.");
					//Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	дкУстановитьЗначениеДополнительногоСвойства(ЭтотОбъект,Отказ);
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	
	//Бондаренко++ 20231219
	Если Не обЗначениеНеЗаполнено(ДокументОснование) Тогда
		Если ТипЗНЧ(ДокументОснование)=Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
			
			ЗаказНаАвто = ДокументОснование.ПолучитьОбъект();
			ЗаказНаАвто.ПоступлениеАвтоТрэйдИн="";
			ЗаказНаАвто.TradeIn = Ложь;
			
			ЗаказНаАвто.Записать(РежимЗаписиДокумента.Запись);                                      
			
			//Бондаренко++ 20240109
			Если ТипЗНЧ(ЗаказНаАвто.ДокументОснование)=Тип("ДокументСсылка.РабочийЛист") Тогда
				
				РабочийЛист = ЗаказНаАвто.ДокументОснование.ПолучитьОбъект();
				РабочийЛист.ПоступлениеАвтоТрэйдИн="";
				
				РабочийЛист.Записать(РежимЗаписиДокумента.Запись);                                      
				
			КонецЕсли;	
			//Бондаренко-- 20240109
			
		КонецЕсли;
	КонецЕсли;
	//Бондаренко-- 20231219
КонецПроцедуры

// Функция списания автомобиля с ответственного хранения при переходе в собственность
//
// Параметры
//  Отказ  – Булево – Результат проведения
//  Режим  – РежимПроведения – Режим проведения
//
// Возвращаемое значение:
//   Булево   – Результат проведения
//
Функция СписаниеСОтветственногоХранения(Отказ, Режим)
	
	Результат = Истина;
	
	Если ХозОперация=Справочники.ХозОперации.ПереходВСобственностьАвтомобилей Тогда
		
		//Для перехода автомобиля в собственность сначала спишем его со склада
		НаборЗаписейОстаткиАвтомобилей = Движения.ОстаткиАвтомобилей;
		НаборЗаписейОстаткиАвтомобилей.РежимПроведения = Режим;
		НаборЗаписейОстаткиАвтомобилей.ДокументОбъект  = ЭтотОбъект;
		
		Запрос = Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ 
		|	ДокументАвтомобили.Автомобиль КАК Автомобиль,
		|	СУММА(ДокументАвтомобили.Количество) КАК Количество
		|ИЗ
		|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ДокументАвтомобили
		|ГДЕ
		|	ДокументАвтомобили.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ДокументАвтомобили.Автомобиль";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		НаборЗаписейОстаткиАвтомобилей.РезультатЗапросаПоАвтомобилям = Запрос.Выполнить().Выгрузить();
		НаборЗаписейОстаткиАвтомобилей.СтатусПартии  = Перечисления.СтатусыПартий.ТоварОтветственноеХранение;
		НаборЗаписейОстаткиАвтомобилей.СкладКомпании = СкладКомпании;
		НаборЗаписейОстаткиАвтомобилей.СторноПриход  = Истина;
		Отказ = НЕ НаборЗаписейОстаткиАвтомобилей.Расход() ИЛИ Отказ;
		НаборЗаписейОстаткиАвтомобилей.ГраницаРасчетаОстатков = Неопределено;
		Если НЕ Отказ Тогда
			НаборЗаписейОстаткиАвтомобилей.Записать();
		КонецЕсли;
		
		//Спишем оборудование автомобиля
		ШапкаДокумента=ПолучитьШапкуДокумента(Ссылка);
		НаборЗаписейКомплектацияАвтомобилей=Движения.КомплектацияАвтомобилей;
		Для Каждого СтрокаТЧ Из Автомобили Цикл
			////Спишем оборудование по документу
			//Спишем опции, установленные производителем
			НаборЗаписейКомплектацияАвтомобилей.РежимПроведения           = Режим;
			НаборЗаписейКомплектацияАвтомобилей.ДокументОбъект            = ЭтотОбъект;
			НаборЗаписейКомплектацияАвтомобилей.РезультатЗапросаПоТоварам = Неопределено;
			НаборЗаписейКомплектацияАвтомобилей.Автомобиль                = СтрокаТЧ.Автомобиль;
			НаборЗаписейКомплектацияАвтомобилей.СкладКомпании             = СкладКомпании;
			//НаборЗаписейКомплектацияАвтомобилей.ПериодДвижения=ШапкаДокумента.МоментВремени;
			НаборЗаписейКомплектацияАвтомобилей.ТипОборудования           = "Опции";
			НаборЗаписейКомплектацияАвтомобилей.ШапкаДокумента            = ШапкаДокумента;
			НаборЗаписейКомплектацияАвтомобилей.СторноПриход              = Истина;
			Отказ = НЕ НаборЗаписейКомплектацияАвтомобилей.Расход() ИЛИ Отказ;
		КонецЦикла;
	КонецЕсли;
	
	Результат = Результат И (НЕ Отказ);
	
	Возврат Результат;
	
КонецФункции // СписаниеСОтветственногоХранения() 

Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Иванченко 20260512 ++
	////Бондаренко++ 20250704
	//ОтгрузкаАвтомобиляБезРеализации_Об_Распроведен = Ложь;					
	//Если ХозОперация = Справочники.ХозОперации.ПереходВСобственностьАвтомобилей Тогда
	//	Если Не обЗначениеНеЗаполнено(ОтгрузкаАвтомобиляБезРеализации) Тогда
	//		Если ОтгрузкаАвтомобиляБезРеализации.Проведен Тогда
	//			ОтгрузкаАвтомобиляБезРеализации_Об = ОтгрузкаАвтомобиляБезРеализации.ПолучитьОбъект();	
	//			Попытка
	//				ОтгрузкаАвтомобиляБезРеализации_Об.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	//				ОтгрузкаАвтомобиляБезРеализации_Об_Распроведен = Истина;					
	//			Исключение
	//				#Если Клиент Тогда
	//					СМГ_Сообщить("ОШИБКА! Не удалось распровести "+ОтгрузкаАвтомобиляБезРеализации,СтатусСообщения.ОченьВажное);
	//				#КонецЕсли
	//				Отказ = Истина;
	//				Возврат;
	//			КонецПопытки;
	//		КонецЕсли;	
	//	КонецЕсли;
	//КонецЕсли;
	////Бондаренко-- 20250704 
	//Иванченко 20260512 --	
	
	Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда Возврат; КонецЕсли;
	
	//проверим, что автомобиль отсутствует на остатках по различным регистрам
	Если ХозОперация <> Справочники.ХозОперации.ПереходВСобственностьАвтомобилей Тогда
		Если НЕ РегистрыНакопления.ОстаткиАвтомобилей.ПроверитьОстаткиАвтомобилей(ЭтотОбъект,Отказ) Тогда 
			дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);		
			Возврат; 
		КонецЕсли;
	КонецЕсли; 
	
	//Бондаренко++ 20221206
	Если НЕ ( РольДоступна("ПолныеПрава") ИЛИ РольДоступна("СМ_РуководительОтделаЛогистики") ИЛИ ЭтотОбъект.Контрагент.НашаФирма ) Тогда
		Если СМГ_ЕстьАвтоБезДиагностики() Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	//Бондаренко-- 20221206
	
	// Семенихин 06.05.2024 +++++	
	Если СМГ_НетСделкиАвтохаб() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	// Семенихин 06.05.2024 +++++	
	
	ФлагУпрВалюты = (ВалютаДокумента=Константы.ВалютаУправленческогоУчетаКомпании.Получить());
	
	СписаниеСОтветственногоХранения(Отказ, Режим);
	// проведем взаиморасчеты если поступление не комиссионное и не на ответхранение
	// проведем взаиморасчеты если поступление покупки
	Если ХозОперация=Справочники.ХозОперации.ПоступлениеАвтомобилей ИЛИ
		ХозОперация=Справочники.ХозОперации.ПереходВСобственностьАвтомобилей Тогда
		НаборЗаписейВзаиморасчеты=Движения.ВзаиморасчетыКомпании;
		НаборЗаписейВзаиморасчеты.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейВзаиморасчеты.РежимПроведения=Режим;
		НаборЗаписейВзаиморасчеты.Контрагент=Контрагент;
		НаборЗаписейВзаиморасчеты.ДоговорВзаиморасчетов=ДоговорВзаиморасчетов;
		Если НЕ обЗначениеНеЗаполнено(ДокументОснование) Тогда
			НаборЗаписейВзаиморасчеты.Сделка=ДокументОснование;
		Иначе
			НаборЗаписейВзаиморасчеты.Сделка=Неопределено;
		КонецЕсли; 
		НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем=Ложь;
		НаборЗаписейВзаиморасчеты.Сумма=СуммаДокумента;
		НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц=0;
		Отказ=НЕ НаборЗаписейВзаиморасчеты.Расход() ИЛИ Отказ;
		// доходы и расходы по суммовым разницам
		СуммаДоходаРасходаСуммовыхРазниц=НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц;
		Если СуммаДоходаРасходаСуммовыхРазниц<>0 Тогда
			НаборЗаписейДиР = Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
			НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СуммовыеРазницы;
			НаборЗаписейДиР.ВУпрВалюте = Истина;
			Если СуммаДоходаРасходаСуммовыхРазниц<0 Тогда
				НаборЗаписейДиР.Расход = -СуммаДоходаРасходаСуммовыхРазниц;
			Иначе
				НаборЗаписейДиР.Доход = СуммаДоходаРасходаСуммовыхРазниц;
			КонецЕсли;
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		КонецЕсли;
	КонецЕсли;
	
	Отказ = ПроверитьЗаказыНаАвтомобиль() ИЛИ Отказ;
	
	ТаблицаАвтомобилей = Автомобили.Выгрузить(,"Автомобиль");
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ПоступлениеАвтомобилейАвтомобили.Автомобиль КАК Автомобиль
	|ПОМЕСТИТЬ
	|	ТаблицаАвтомобилей
	|ИЗ
	|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
	|ГДЕ
	|	ПоступлениеАвтомобилейАвтомобили.Ссылка = &Ссылка И 
	|	ПоступлениеАвтомобилейАвтомобили.АвтомобильБезЗаказа = ЛОЖЬ
	|ИНДЕКСИРОВАТЬ ПО
	|	Автомобиль
	|;
	|
	|ВЫБРАТЬ
	|	ЗаказыАвтомобилейОстатки.Автомобиль КАК Автомобиль,
	|	ЗаказыАвтомобилейОстатки.ЗаказПоставщику КАК Заказ,
	|	ЗаказыАвтомобилейОстатки.ЗаказПоставщику.Контрагент КАК Контрагент,
	|	ЗаказыАвтомобилейОстатки.ЗаказПоставщику.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	ЕСТЬNULL(ЗаказыАвтомобилейОстатки.КоличествоОстаток, 0) КАК Количество,
	|	ЕСТЬNULL(ЗаказыАвтомобилейОстатки.СуммаОстаток, 0) КАК Сумма,
	|	ЕСТЬNULL(ЗаказыАвтомобилейОстатки.СуммаУпрОстаток, 0) КАК СуммаУпр
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикамНаАвтомобили.Остатки(
	|			&НаГраницу,
	|			Автомобиль В (ВЫБРАТЬ Автомобиль ИЗ ТаблицаАвтомобилей)) КАК ЗаказыАвтомобилейОстатки
	|ГДЕ
	|	ЕСТЬNULL(ЗаказыАвтомобилейОстатки.КоличествоОстаток, 0)<>0
	|";
	Запрос.УстановитьПараметр("НаГраницу",  Новый Граница(МоментВремени(),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Ссылка",  Ссылка);
	
	// Наложим блокировку на считываемые данные
	СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрНакопления", "ЗаказыПоставщикамНаАвтомобили");
	ЗначенияБлокировки = Новый Соответствие;
	ЗначенияБлокировки.Вставить("Период", Новый Диапазон(, Дата));
	
	СтруктураПараметровБлокировки.Вставить("ИсточникДанных", ТаблицаАвтомобилей);
	ОписаниеИсточника = Новый Соответствие;
	ОписаниеИсточника.Вставить("Автомобиль", "Автомобиль");
	обУстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки, ОписаниеИсточника);
	
	ТаблицаЗаказовНаАвтомобили = Запрос.Выполнить().Выгрузить();
	ТаблицаЗаказовНаАвтомобили.Индексы.Добавить("Автомобиль");
	//Закроем заказы поставщикам
	НаборЗаписейЗаказыПоставщикам = Движения.ЗаказыПоставщикамНаАвтомобили;
	Для Каждого ТекСтрока Из Автомобили Цикл
		
		Если ТекСтрока.АвтомобильБезЗаказа Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаЗаказа = ТаблицаЗаказовНаАвтомобили.Найти(ТекСтрока.Автомобиль, "Автомобиль");
		
		Если СтрокаЗаказа = Неопределено Тогда
			дкСообщитьРезультат("Автомобиль """+СокрЛП(ТекСтрока.Автомобиль)+""" не заказывался. Закрытие заказа невозможно.","Важное&Заказы поставщикам на автомобили:",ЭтотОбъект, ТекСтрока.Автомобиль);
			Отказ = Истина;
			Продолжить;
		ИначеЕсли СтрокаЗаказа.Заказ <> ТекСтрока.ЗаказНаАвтомобиль Тогда
			дкСообщитьРезультат("Автомобиль """+СокрЛП(СтрокаЗаказа.Автомобиль)+""" заказан документом """+СокрЛП(СтрокаЗаказа.Заказ)+""". Закрытие чужого заказа невозможно.","Важное&Заказы поставщикам на автомобили:",ЭтотОбъект,СтрокаЗаказа.Автомобиль);
			Отказ=Истина;
			Продолжить;
		ИначеЕсли СтрокаЗаказа.Контрагент <> Контрагент Тогда
			дкСообщитьРезультат("Автомобиль """+СокрЛП(СтрокаЗаказа.Автомобиль)+""" заказан контрагентом """+СокрЛП(СтрокаЗаказа.Контрагент)+""". Закрытие чужого заказа невозможно.","Важное&Заказы поставщикам на автомобили:",ЭтотОбъект,СтрокаЗаказа.Автомобиль);
			Отказ=Истина;
			Продолжить;
		ИначеЕсли СтрокаЗаказа.ДоговорВзаиморасчетов<>ДоговорВзаиморасчетов Тогда
			дкСообщитьРезультат("Автомобиль """+СокрЛП(СтрокаЗаказа.Автомобиль)+""" заказан контрагентом согласно договора """+СокрЛП(СтрокаЗаказа.ДоговорВзаиморасчетов)+""". Закрытие заказа по другому договору невозможно.","Важное&Заказы поставщикам на автомобили:",ЭтотОбъект,СтрокаЗаказа.Автомобиль);
			Отказ=Истина;
			Продолжить;
		КонецЕсли;
		
		НоваяЗапись = НаборЗаписейЗаказыПоставщикам.Добавить();
		НоваяЗапись.ВидДвижения     = ВидДвиженияНакопления.Расход;
		НоваяЗапись.Период          = Дата;
		НоваяЗапись.Регистратор     = Ссылка;
		НоваяЗапись.ЗаказПоставщику = ТекСтрока.ЗаказНаАвтомобиль;
		НоваяЗапись.Автомобиль      = ТекСтрока.Автомобиль;
		НоваяЗапись.Количество      = СтрокаЗаказа.Количество;
		НоваяЗапись.Сумма           = СтрокаЗаказа.Сумма;
		НоваяЗапись.СуммаУпр        = СтрокаЗаказа.СуммаУпр;
		НоваяЗапись.ХозОперация     = ХозОперация;
		
	КонецЦикла;
	
	Если Отказ Тогда
		дкВыводРезультатовОбработки(ЭтотОбъект, Отказ);
		Возврат;
	Иначе
		НаборЗаписейЗаказыПоставщикам.Записать();
	КонецЕсли;
	
	// Зарезервируем автомобили под заказы клиентов
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЗаказыАвтомобилейОстатки.Автомобиль,
	|	ЗаказыАвтомобилейОстатки.Заказ,
	|	ЗаказыАвтомобилейОстатки.Заказ.СтатусАвтомобиля КАК СтатусАвтомобиля,
	|	ЕСТЬNULL(ЗаказыАвтомобилейОстатки.РезервОстаток, 0) КАК Резерв,
	|	ЕСТЬNULL(ЗаказыАвтомобилейОстатки.КоличествоОстаток, 0) КАК Количество
	|ИЗ
	|	РегистрНакопления.ЗаказыАвтомобилей.Остатки(
	|			&НаГраницу,
	|			Автомобиль В (&Автомобили)) КАК ЗаказыАвтомобилейОстатки
	|ГДЕ
	|	ЕСТЬNULL(ЗаказыАвтомобилейОстатки.КоличествоОстаток, 0)<>0
	|";
	Запрос.УстановитьПараметр("НаГраницу",  Новый Граница(МоментВремени(),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Автомобили", Автомобили.ВыгрузитьКолонку("Автомобиль"));
	
	// Наложим блокировку на считываемые данные
	СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрНакопления", "ЗаказыАвтомобилей");
	ЗначенияБлокировки = Новый Соответствие;
	ЗначенияБлокировки.Вставить("Период", Новый Диапазон(, Дата));
	
	СтруктураПараметровБлокировки.Вставить("ИсточникДанных", ТаблицаЗаказовНаАвтомобили);
	ОписаниеИсточника = Новый Соответствие;
	ОписаниеИсточника.Вставить("Автомобиль", "Автомобиль");
	обУстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки, ОписаниеИсточника);
	
	НаборЗаписейЗаказыАвтомобилей = Движения.ЗаказыАвтомобилей;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Резерв > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаДолгов = орПолучитьТаблицуДолговПоПредоплатам(ЭтотОбъект, Выборка.Заказ);
		Если ТаблицаДолгов.Количество()>0 Тогда
			СтрокаДолга = ТаблицаДолгов[0];
			Сообщить("Автомобиль """+СокрЛП(Выборка.Автомобиль)+""" нельзя зарезервировать по заказу """+СокрЛП(Выборка.Заказ)+""". Долг по предоплате составляет: "+Формат(СтрокаДолга.Долг, "ЧЦ=15; ЧДЦ=2")+" "+СокрЛП(СтрокаДолга.Валюта)+".", СтатусСообщения.Внимание);
			Продолжить;
		КонецЕсли;
		
		НоваяЗапись = НаборЗаписейЗаказыАвтомобилей.Добавить();
		НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
		НоваяЗапись.Период      = Дата;
		НоваяЗапись.Регистратор = Ссылка;
		НоваяЗапись.Автомобиль  = Выборка.Автомобиль;
		НоваяЗапись.Заказ       = Выборка.Заказ;
		НоваяЗапись.Резерв      = 1;
		НоваяЗапись.ХозОперация = ХозОперация;
		
	КонецЦикла;
	
	НаборЗаписейЗаказыАвтомобилей.Записать();
	
	НаборЗаписейОстатки = Движения.ОстаткиАвтомобилей;
	НаборЗаписейОстатки.РежимПроведения                         = Режим;
	НаборЗаписейОстатки.ДокументОбъект                          = ЭтотОбъект;
	НаборЗаписейОстатки.РезультатЗапросаПоАвтомобилям           = Автомобили.Выгрузить();
	НаборЗаписейОстатки.СкладКомпании                           = СкладКомпании;
	Если ХозОперация=Справочники.ХозОперации.ПоступлениеАвтомобилейКомиссия Тогда
		НаборЗаписейОстатки.СтатусПартии = Перечисления.СтатусыПартий.ТоварПринятыйКомиссия;
	ИначеЕсли ХозОперация=Справочники.ХозОперации.ПоступлениеАвтомобилейОтветственноеХранение Тогда
		НаборЗаписейОстатки.СтатусПартии = Перечисления.СтатусыПартий.ТоварОтветственноеХранение;
	Иначе
		НаборЗаписейОстатки.СтатусПартии = Перечисления.СтатусыПартий.ТоварКупленный;
	КонецЕсли; 
	Если ХозОперация = Справочники.ХозОперации.ПереходВСобственностьАвтомобилей Тогда
		НаборЗаписейОстатки.ГраницаРасчетаОстатков = Новый Граница(МоментВремени(), ВидГраницы.Включая);
	КонецЕсли; 
	НаборЗаписейОстатки.Партия        = Ссылка;
	
	Отказ = НЕ НаборЗаписейОстатки.Приход() ИЛИ Отказ;
	НаборЗаписейОстатки.ГраницаРасчетаОстатков = Неопределено;
	
	Если НЕ Отказ Тогда
		ШапкаДокумента=ПолучитьШапкуДокумента(Ссылка);
		//Запишем комплектацию автомобилей
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	ПоступлениеАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
		|	ПоступлениеАвтомобилейОпции.Опция КАК Номенклатура,
		|	NULL КАК ХарактеристикаНоменклатуры,
		|	&СтатусПартии КАК СтатусПартии,
		|	ПоступлениеАвтомобилейОпции.Ссылка КАК Партия,
		|	ПоступлениеАвтомобилейАвтомобили.ГТД КАК ГТД,
		|	ПоступлениеАвтомобилейОпции.СтавкаНДС КАК СтавкаНДС,
		|	ПоступлениеАвтомобилейОпции.Количество КАК Количество,
		|	ПоступлениеАвтомобилейОпции.СуммаВсего КАК Сумма,
		|	ПоступлениеАвтомобилейОпции.СуммаВсего КАК СуммаУпр,
		|	ПоступлениеАвтомобилейОпции.СуммаНДС КАК СуммаНДС
		|ИЗ
		|	Документ.ПоступлениеАвтомобилей.Опции КАК ПоступлениеАвтомобилейОпции
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
		|ПО
		|	ПоступлениеАвтомобилейОпции.Ссылка = ПоступлениеАвтомобилейАвтомобили.Ссылка И 
		|	ПоступлениеАвтомобилейОпции.ИдентификаторАвтомобиля = ПоступлениеАвтомобилейАвтомобили.ИдентификаторАвтомобиля
		|ГДЕ
		|	ПоступлениеАвтомобилейОпции.Ссылка = &Ссылка";
		Если ХозОперация=Справочники.ХозОперации.ПоступлениеАвтомобилейКомиссия Тогда
			Запрос.УстановитьПараметр("СтатусПартии",Перечисления.СтатусыПартий.ТоварПринятыйКомиссия);
		ИначеЕсли ХозОперация=Справочники.ХозОперации.ПоступлениеАвтомобилейОтветственноеХранение Тогда
			Запрос.УстановитьПараметр("СтатусПартии",Перечисления.СтатусыПартий.ТоварОтветственноеХранение);
		Иначе
			Запрос.УстановитьПараметр("СтатусПартии",Перечисления.СтатусыПартий.ТоварКупленный);
		КонецЕсли;
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		ТаблицаОпций=Запрос.Выполнить().Выгрузить();
		
		ВалютаРегл = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		Если ВалютаДокумента<>ВалютаРегл Тогда
			Для каждого СтрокаОпций Из ТаблицаОпций Цикл
				СтрокаОпций.Сумма=обПересчет(СтрокаОпций.Сумма,ВалютаДокумента,Дата,ВалютаРегл,Дата);
				СтрокаОпций.СуммаНДС=обПересчет(СтрокаОпций.СуммаНДС,ВалютаДокумента,Дата,ВалютаРегл,Дата);
			КонецЦикла; 
		КонецЕсли; 
		ВалютаУпр=Константы.ВалютаУправленческогоУчетаКомпании.Получить();
		Если обЗначениеНеЗаполнено(КурсВалютыУпр) Тогда
			СтруктураКурса = обКурсДляВалюты(ВалютаУпр,МоментВремени());
			КурсУпр		   = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
		Иначе
			КурсУпр        = КурсВалютыУпр;
		КонецЕсли;
		Если ВалютаДокумента<>ВалютаУпр Тогда
			Для каждого СтрокаОпций Из ТаблицаОпций Цикл
				СтрокаОпций.СуммаУпр=обПересчет(СтрокаОпций.СуммаУпр,ВалютаДокумента,Дата,ВалютаУпр,КурсУпр);
			КонецЦикла; 
		КонецЕсли; 
		НаборЗаписейКомплектацияАвтомобилей=Движения.КомплектацияАвтомобилей;
		НаборЗаписейКомплектацияАвтомобилей.РежимПроведения=Режим;
		НаборЗаписейКомплектацияАвтомобилей.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейКомплектацияАвтомобилей.РезультатЗапросаПоТоварам=ТаблицаОпций;
		НаборЗаписейКомплектацияАвтомобилей.СкладКомпании=СкладКомпании;
		НаборЗаписейКомплектацияАвтомобилей.ШапкаДокумента=ШапкаДокумента;
		Отказ=НЕ НаборЗаписейКомплектацияАвтомобилей.Приход() ИЛИ Отказ;
	КонецЕсли; 
	
	ВедетсяБалансПоПодразделению = (Константы.СпособВеденияБаланса.Получить() = Перечисления.СпособВеденияБаланса.ПоПодразделению);
	Если ВедетсяБалансПоПодразделению И ХозОперация=Справочники.ХозОперации.ПоступлениеАвтомобилей Тогда
		ПодразделениеСклад = обПолучитьБалансовоеПодразделение(СкладКомпании.Подразделение);
		ПодразделениеДоговорВзаиморасчетов = обПолучитьБалансовоеПодразделение(ДоговорВзаиморасчетов.Подразделение);
		БалансовыеПодразделенияНеРавны = (ПодразделениеДоговорВзаиморасчетов<>ПодразделениеСклад);
		// способ ведения не по подразделениям или балансовые подразделения равны то ничего не будем корректировать
		Если БалансовыеПодразделенияНеРавны Тогда
			СуммаАвтомобилей = Движения.ОстаткиАвтомобилей.Итог("СуммаУпр") + Движения.КомплектацияАвтомобилей.Итог("СуммаУпр");
			Если СуммаАвтомобилей<>0 Тогда
				НаборЗаписейДиР = Движения.ДоходыИРасходы;
				НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
				НаборЗаписейДиР.Подразделение = СкладКомпании.Подразделение;
				НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
				НаборЗаписейДиР.ВУпрВалюте = Истина;
				НаборЗаписейДиР.Доход = СуммаАвтомобилей;
				Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;	
			КонецЕсли;			
			НаборЗаписейДиР = Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
			НаборЗаписейДиР.Подразделение = ДоговорВзаиморасчетов.Подразделение;
			НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
			НаборЗаписейДиР.ВУпрВалюте = Ложь;
			НаборЗаписейДиР.Расход = СуммаДокумента;
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;	
		КонецЕсли;
	КонецЕсли; 
	
	// если необходимо, то установим цены на автомобили и опции
	//Если НЕ Отказ И НЕ ТипЦен.Рассчитывается И ХозОперация=Справочники.ХозОперации.ПоступлениеАвтомобилей И ПодразделениеКомпании.ФормироватьЗакупочнуюЦену Тогда
	Если НЕ Отказ И НЕ ТипЦен.Рассчитывается И ПодразделениеКомпании.ФормироватьЗакупочнуюЦену Тогда
		НаборЗаписейЦены=Движения.ЦеныАвтомобилей;
		НаборЗаписейЦены.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейЦены.ТипЦен=ТипЦен;
		Запрос=Новый Запрос("
		|ВЫБРАТЬ
		|	ДокументАвтомобили.Автомобиль.Модель КАК Автомобиль,
		|	ДокументАвтомобили.Автомобиль.ВариантКомплектации КАК ВариантКомплектации,
		|	МАКСИМУМ(ДокументАвтомобили.Цена) КАК НоваяЦена
		|ПОМЕСТИТЬ
		|	ТаблицаАвтомобилей
		|ИЗ
		|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ДокументАвтомобили
		|ГДЕ
		|	ДокументАвтомобили.Ссылка = &Ссылка И 
		|	ДокументАвтомобили.Цена > 0
		|СГРУППИРОВАТЬ ПО
		|	ДокументАвтомобили.Автомобиль.Модель,
		|	ДокументАвтомобили.Автомобиль.ВариантКомплектации
		|ИНДЕКСИРОВАТЬ ПО
		|	Автомобиль,
		|	ВариантКомплектации
		|;
		|
		|ВЫБРАТЬ
		|	ТаблицаАвтомобилей.Автомобиль КАК Автомобиль,
		|	ТаблицаАвтомобилей.ВариантКомплектации КАК ВариантКомплектации,
		|	ТаблицаАвтомобилей.НоваяЦена КАК НоваяЦена,
		|	ЕСТЬNULL(ЦеныВБазе.Цена, 0) КАК ЦенаВБазе
		|ИЗ
		|	ТаблицаАвтомобилей КАК ТаблицаАвтомобилей
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныАвтомобилей.СрезПоследних(&Момент, ТипЦен = &ТипЦен И Автомобиль Ссылка Справочник.Модели И
		|		ВариантКомплектации В (ВЫБРАТЬ ВариантКомплектации ИЗ ТаблицаАвтомобилей)) КАК ЦеныВБазе
		|ПО
		|	ТаблицаАвтомобилей.Автомобиль = ЦеныВБазе.Автомобиль И 
		|	ТаблицаАвтомобилей.ВариантКомплектации = ЦеныВБазе.ВариантКомплектации");
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
		Запрос.УстановитьПараметр("Момент", МоментВремени());
		НаборЗаписейЦены.РезультатЗапросаПоАвтомобилям = Запрос.Выполнить();
		НаборЗаписейЦены.ПроверятьОдинаковыеЦены = Ложь;
		Отказ=НЕ НаборЗаписейЦены.УстановитьЦены() ИЛИ Отказ;
		
		Если НЕ Отказ Тогда
			// устанавливаем цены
			НаборЗаписейЦены = Движения.ЦеныОпций;
			НаборЗаписейЦены.ДокументОбъект	= ЭтотОбъект;
			НаборЗаписейЦены.ТипЦен			= ТипЦен;
			
			Запрос=Новый Запрос("
			|ВЫБРАТЬ
			|	ПоступлениеАвтомобилейАвтомобили.Автомобиль.Модель КАК Модель,
			|	ПоступлениеАвтомобилейАвтомобили.Автомобиль.ВариантКомплектации КАК ВариантКомплектации,
			|	ДокументОпции.Опция КАК Опция,
			|	МАКСИМУМ(ДокументОпции.Цена) КАК НоваяЦена
			|ПОМЕСТИТЬ
			|	ТаблицаОпций
			|ИЗ
			|	Документ.ПоступлениеАвтомобилей.Опции КАК ДокументОпции
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
			|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
			|ПО 
			|	ДокументОпции.ИдентификаторАвтомобиля = ПоступлениеАвтомобилейАвтомобили.ИдентификаторАвтомобиля И 
			|	ПоступлениеАвтомобилейАвтомобили.Ссылка = &Ссылка
			|ГДЕ
			|	ДокументОпции.Ссылка = &Ссылка И 
			|	ДокументОпции.Цена > 0
			|СГРУППИРОВАТЬ ПО 
			|	ПоступлениеАвтомобилейАвтомобили.Автомобиль.Модель,
			|	ПоступлениеАвтомобилейАвтомобили.Автомобиль.ВариантКомплектации,
			|	ДокументОпции.Опция
			|ИНДЕКСИРОВАТЬ ПО
			|	Модель,
			|	ВариантКомплектации
			|;
			|
			|ВЫБРАТЬ
			|	ТаблицаОпций.Модель,
			|	ТаблицаОпций.ВариантКомплектации,
			|	ТаблицаОпций.Опция,
			|	ТаблицаОпций.НоваяЦена,
			|	ЕСТЬNULL(ЦеныВБазе.Цена,0) КАК ЦенаВБазе
			|ИЗ
			|	ТаблицаОпций КАК ТаблицаОпций
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныОпций.СрезПоследних(&Момент, ТипЦен = &ТипЦен И 
			|		(Модель, ВариантКомплектации, Опция) В 
			|		(ВЫБРАТЬ
			|			Модель,
			|			ВариантКомплектации,
			|			Опция
			|		ИЗ
			|			ТаблицаОпций)) КАК ЦеныВБазе
			|ПО
			|	ТаблицаОпций.Модель              = ЦеныВБазе.Модель И 
			|	ТаблицаОпций.ВариантКомплектации = ЦеныВБазе.ВариантКомплектации И 
			|	ТаблицаОпций.Опция               = ЦеныВБазе.Опция");
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
			Запрос.УстановитьПараметр("Момент", МоментВремени());
			НаборЗаписейЦены.РезультатЗапросаПоОпциям = Запрос.Выполнить();
			НаборЗаписейЦены.ПроверятьОдинаковыеЦены=Ложь;
			Отказ=НЕ НаборЗаписейЦены.УстановитьЦены() ИЛИ Отказ;
		КонецЕсли;
	КонецЕсли;
	
	// Возможно расхождение баланса на "копейки" из-за округления. Возникшую разницу
	// необходимо списать на доходы и расходы.
	Отказ = НЕ дкСписаниеКопейкиПриОкругленииВалютныхСчетов(ЭтотОбъект) ИЛИ Отказ;
	
	Если Режим<>РежимПроведенияДокумента.Оперативный ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.АвтомобильСкладКомпанииБыл) Тогда
		// двигаем границу последовательности автомобилей
		НаборЗаписейГраницыАвтомобили = РегистрыСведений.ГраницыАвтомобили.СоздатьНаборЗаписей();
		Если Режим<>РежимПроведенияДокумента.Оперативный Тогда
			НаборЗаписейГраницыАвтомобили.СкладКомпании		= СкладКомпании;
			НаборЗаписейГраницыАвтомобили.МоментВремени		= Дата;
			НаборЗаписейГраницыАвтомобили.СкладКомпанииБыл	= ДополнительныеСвойства.АвтомобильСкладКомпанииБыл;
			НаборЗаписейГраницыАвтомобили.МоментВремениБыл	= ДополнительныеСвойства.МоментВремениБыл;
		Иначе
			НаборЗаписейГраницыАвтомобили.СкладКомпании		= ДополнительныеСвойства.АвтомобильСкладКомпанииБыл;
			НаборЗаписейГраницыАвтомобили.МоментВремени		= ДополнительныеСвойства.МоментВремениБыл;
			НаборЗаписейГраницыАвтомобили.СкладКомпанииБыл	= Неопределено;
			НаборЗаписейГраницыАвтомобили.МоментВремениБыл	= Неопределено;
		КонецЕсли;
		НаборЗаписейГраницыАвтомобили.ДокументСсылка = Ссылка;
		НаборЗаписейГраницыАвтомобили.ИзменитьГраницу();
	КонецЕсли;
	
	ДвигаемГраницу = (Режим<>РежимПроведенияДокумента.Оперативный И (Движения.ЗаказыАвтомобилей.Количество()>0 ИЛИ Движения.ЗаказыПоставщикамНаАвтомобили.Количество()>0));
	// двигаем границу последовательности заказы на автомобиль
	Если ДвигаемГраницу ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.АвтомобильЗаказБыл) Тогда
		НаборЗаписейГраницыЗаказы = РегистрыСведений.ГраницыЗаказыНаАвтомобили.СоздатьНаборЗаписей();
		Если ДвигаемГраницу Тогда
			ТаблицаАвтомобилей = Движения.ЗаказыАвтомобилей.Выгрузить();
			Для Каждого СтрокаАвтомобиль Из Движения.ЗаказыПоставщикамНаАвтомобили Цикл
				НоваяСтрока = ТаблицаАвтомобилей.Добавить();
				НоваяСтрока.Автомобиль = СтрокаАвтомобиль.Автомобиль;
			КонецЦикла;
			ТаблицаАвтомобилей.Свернуть("Автомобиль","");
			НаборЗаписейГраницыЗаказы.Автомобиль       = ТаблицаАвтомобилей.ВыгрузитьКолонку("Автомобиль");
			НаборЗаписейГраницыЗаказы.МоментВремени    = Дата;
			НаборЗаписейГраницыЗаказы.АвтомобильБыл    = ДополнительныеСвойства.АвтомобильЗаказБыл;
			НаборЗаписейГраницыЗаказы.МоментВремениБыл = ДополнительныеСвойства.МоментВремениБыл;
		Иначе
			НаборЗаписейГраницыЗаказы.Автомобиль       = ДополнительныеСвойства.АвтомобильЗаказБыл;
			НаборЗаписейГраницыЗаказы.МоментВремени    = ДополнительныеСвойства.МоментВремениБыл;
			НаборЗаписейГраницыЗаказы.АвтомобильБыл    = Неопределено;
			НаборЗаписейГраницыЗаказы.МоментВремениБыл = Неопределено;
		КонецЕсли;
		НаборЗаписейГраницыЗаказы.ДокументСсылка = Ссылка;
		НаборЗаписейГраницыЗаказы.ИзменитьГраницу();
	КонецЕсли;
	
	ДвигаемГраницу = (Режим<>РежимПроведенияДокумента.Оперативный И Движения.КомплектацияАвтомобилей.Количество()>0);
	// двигаем границу последовательности комплектаций автомобилей
	Если ДвигаемГраницу ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.АвтомобильБыл) Тогда
		НаборЗаписейГраницыКомплектация = РегистрыСведений.ГраницыКомплектация.СоздатьНаборЗаписей();
		Если ДвигаемГраницу Тогда
			ТаблицаАвтомобилей = Движения.КомплектацияАвтомобилей.Выгрузить();
			ТаблицаАвтомобилей.Свернуть("Автомобиль","");
			НаборЗаписейГраницыКомплектация.Автомобиль = ТаблицаАвтомобилей.ВыгрузитьКолонку("Автомобиль");
			НаборЗаписейГраницыКомплектация.МоментВремени  	 = Дата;
			НаборЗаписейГраницыКомплектация.АвтомобильБыл	 = ДополнительныеСвойства.АвтомобильБыл;
			НаборЗаписейГраницыКомплектация.МоментВремениБыл = ДополнительныеСвойства.МоментВремениБыл;
		Иначе
			НаборЗаписейГраницыКомплектация.Автомобиль		 = ДополнительныеСвойства.АвтомобильБыл;
			НаборЗаписейГраницыКомплектация.МоментВремени	 = ДополнительныеСвойства.МоментВремениБыл;
			НаборЗаписейГраницыКомплектация.АвтомобильБыл	 = Неопределено;
			НаборЗаписейГраницыКомплектация.МоментВремениБыл = Неопределено;
		КонецЕсли;
		НаборЗаписейГраницыКомплектация.ДокументСсылка = Ссылка;
		НаборЗаписейГраницыКомплектация.ИзменитьГраницу();
	КонецЕсли;
	
	// двигаем границу последовательности взаиморасчетов
	ДвигаемГраницу = (Режим<>РежимПроведенияДокумента.Оперативный И Движения.ВзаиморасчетыКомпании.Количество()>0);
	Если ДвигаемГраницу ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.ДоговорВзаиморасчетовБыл) Тогда
		НаборЗаписейГраницыВзаиморасчетов = РегистрыСведений.ГраницыВзаиморасчетов.СоздатьНаборЗаписей();
		Если ДвигаемГраницу Тогда
			ТаблицаДоговоров = Движения.ВзаиморасчетыКомпании.Выгрузить();
			ТаблицаДоговоров.Свернуть("ДоговорВзаиморасчетов","");
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетов = ТаблицаДоговоров.ВыгрузитьКолонку("ДоговорВзаиморасчетов");
			НаборЗаписейГраницыВзаиморасчетов.МоментВремени = Дата;
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетовБыл = ДополнительныеСвойства.ДоговорВзаиморасчетовБыл;
			НаборЗаписейГраницыВзаиморасчетов.МоментВремениБыл = ДополнительныеСвойства.МоментВремениБыл;
		Иначе
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетов = ДополнительныеСвойства.ДоговорВзаиморасчетовБыл;
			НаборЗаписейГраницыВзаиморасчетов.МоментВремени = ДополнительныеСвойства.МоментВремениБыл;
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетовБыл = Неопределено;
			НаборЗаписейГраницыВзаиморасчетов.МоментВремениБыл = Неопределено;
		КонецЕсли;
		НаборЗаписейГраницыВзаиморасчетов.ДокументСсылка = Ссылка;
		НаборЗаписейГраницыВзаиморасчетов.ИзменитьГраницу();
	КонецЕсли;
	
	//Бондаренко++ 20231219
	Если Не обЗначениеНеЗаполнено(ДокументОснование) Тогда
		Если ТипЗНЧ(ДокументОснование)=Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
			
			ЗаказНаАвто = ДокументОснование.ПолучитьОбъект();
			ЗаказНаАвто.ПоступлениеАвтоТрэйдИн=Ссылка;
			Если Ссылка.ДокументОснование.ДокументОснование.СкидкаТрейдИн > 0 Тогда
				ЗаказНаАвто.TradeIn = Истина;
			Иначе
				ЗаказНаАвто.TradeIn = Ложь;
			КонецЕсли; 
			
			ЗаказНаАвто.Записать(РежимЗаписиДокумента.Запись);                                      
			
			//Бондаренко++ 20240109
			Если ТипЗНЧ(ЗаказНаАвто.ДокументОснование)=Тип("ДокументСсылка.РабочийЛист") Тогда
				
				РабочийЛист = ЗаказНаАвто.ДокументОснование.ПолучитьОбъект();
				РабочийЛист.ПоступлениеАвтоТрэйдИн=Ссылка;
				
				//Бондаренко++ 20250729
				Если Ссылка.ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилейКомиссия Тогда
					РабочийЛист.ВариантПриобретенияАвтоСПробегом = Перечисления.КомиссияТрейдИнВыкуп.Комиссия;
				ИначеЕсли РабочийЛист.ТолькоВыкуп Тогда
					РабочийЛист.ВариантПриобретенияАвтоСПробегом = Перечисления.КомиссияТрейдИнВыкуп.Выкуп;
				ИначеЕсли РабочийЛист.ТрейдИн Тогда
					РабочийЛист.ВариантПриобретенияАвтоСПробегом = Перечисления.КомиссияТрейдИнВыкуп.ТрейдИн;
				КонецЕсли;
				//Бондаренко-- 20250729
				
				Попытка
					РабочийЛист.Записать(РежимЗаписиДокумента.Запись); 
				Исключение
					#Если Клиент Тогда
						СМГ_Сообщить("ОШИБКА! Не удалось обновить "+СокрЛП(РабочийЛист),СтатусСообщения.ОченьВажное);
					#КонецЕсли
				КонецПопытки;
			КонецЕсли;	
			//Бондаренко-- 20240109
			
		КонецЕсли;
	КонецЕсли;
	//Бондаренко-- 20231219
	
	//Иванченко 20260512 ++	
	////Бондаренко++ 20250704
	//Если ХозОперация = Справочники.ХозОперации.ПереходВСобственностьАвтомобилей Тогда
	//	Если Не обЗначениеНеЗаполнено(ОтгрузкаАвтомобиляБезРеализации) Тогда
	//		Если Не ОтгрузкаАвтомобиляБезРеализации.Проведен Тогда
	//			Если ОтгрузкаАвтомобиляБезРеализации_Об_Распроведен Тогда
	//				ОтгрузкаАвтомобиляБезРеализации_Об = ОтгрузкаАвтомобиляБезРеализации.ПолучитьОбъект();	
	//				Попытка
	//					ОтгрузкаАвтомобиляБезРеализации_Об.Записать(РежимЗаписиДокумента.Проведение);
	//					ОтгрузкаАвтомобиляБезРеализации_Об_Распроведен = Ложь;					
	//				Исключение
	//					#Если Клиент Тогда
	//						СМГ_Сообщить("ОШИБКА! Не удалось провести "+ОтгрузкаАвтомобиляБезРеализации,СтатусСообщения.ОченьВажное);
	//					#КонецЕсли
	//					Отказ = Истина;
	//					Возврат;
	//				КонецПопытки;
	//			КонецЕсли;
	//		КонецЕсли;	
	//	КонецЕсли;
	//КонецЕсли;
	////Бондаренко-- 20250704  
	//Иванченко 20260512 --	
	
	// выведем сообщения об ошибках и предупреждениях
	дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
	
	//Иванченко 20251112 ++  
	Если ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилейКомиссия И ТипЗНЧ(ДокументОснование)=Тип("ДокументСсылка.РабочийЛистКомиссии") Тогда
		ДокументОсновнаниеОбъект = ДокументОснование.ПолучитьОбъект();
		ДокументОсновнаниеОбъект.ПоступлениеАвто = Ссылка;  
		ДокументОсновнаниеОбъект.ЦенаПоступления = Автомобили[0].СуммаВсего; 		
		//Иванченко 20251113 ++
		ДокументОсновнаниеОбъект.ПлановаяЦенаПродажи = Автомобили[0].СуммаПродажи;   
		ДокументОсновнаниеОбъект.Комиссия = Автомобили[0].СуммаПродажи - Автомобили[0].СуммаВсего;		
		//Иванченко 20251113 --		
		
		ДокументОсновнаниеОбъект.Записать();
	КонецЕсли;	
	//Иванченко 20251112 --	
	
	//Иванченко 20260121 ++	
	//Иванченко 20260116 ++
	ЗапросНА = Новый Запрос(
	//"ВЫБРАТЬ
	//|	ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль,
	//|	АвтомобилиСрезПоследних.Значение КАК ВидАвто,
	//|	СУММА(ОстаткиАвтомобилейОстатки.КоличествоОстаток) КАК КоличествоОстаток
	//|ПОМЕСТИТЬ ВТ_Остатки
	//|ИЗ
	//|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(, ) КАК ОстаткиАвтомобилейОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних(, ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)) КАК АвтомобилиСрезПоследних
	//|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = АвтомобилиСрезПоследних.Автомобиль
	//|ГДЕ
	//|	АвтомобилиСрезПоследних.Значение В(&ВидыАвто)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ОстаткиАвтомобилейОстатки.Автомобиль,
	//|	АвтомобилиСрезПоследних.Значение
	//|
	//|ИМЕЮЩИЕ
	//|	СУММА(ОстаткиАвтомобилейОстатки.КоличествоОстаток) > 0
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Остатки.Автомобиль КАК Автомобиль,
	//|	ВТ_Остатки.ВидАвто КАК ВидАвто,
	//|	МАКСИМУМ(ПоступлениеАвтомобилейАвтомобили.Ссылка) КАК Ссылка
	//|ПОМЕСТИТЬ ВТ_Поступления
	//|ИЗ
	//|	ВТ_Остатки КАК ВТ_Остатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
	//|		ПО ВТ_Остатки.Автомобиль = ПоступлениеАвтомобилейАвтомобили.Автомобиль
	//|ГДЕ
	//|	НЕ ПоступлениеАвтомобилейАвтомобили.Ссылка.ПометкаУдаления
	//|	И ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен
	//|	И НЕ ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент.НашаФирма
	//|	И ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата <= ДАТАВРЕМЯ(2026, 3, 1)
	//|	И ПоступлениеАвтомобилейАвтомобили.Ссылка = &Ссылка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_Остатки.Автомобиль,
	//|	ВТ_Остатки.ВидАвто
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Поступления.Ссылка КАК Ссылка,
	//|	ВТ_Поступления.Автомобиль КАК Автомобиль,
	//|	ПоступлениеАвтомобилейАвтомобили.СуммаВсего * 1.02 КАК ИнвойсСНаценкой
	//|ИЗ
	//|	ВТ_Поступления КАК ВТ_Поступления
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
	//|		ПО ВТ_Поступления.Автомобиль = ПоступлениеАвтомобилейАвтомобили.Автомобиль
	//|			И ВТ_Поступления.Ссылка = ПоступлениеАвтомобилейАвтомобили.Ссылка
	//|ГДЕ
	//|	ПоступлениеАвтомобилейАвтомобили.СтавкаНДС.Ставка МЕЖДУ 18 И 20"); 
	"ВЫБРАТЬ
	|	ПоступлениеАвтомобилейАвтомобили.Ссылка КАК Ссылка,
	|	ПоступлениеАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
	|	ПоступлениеАвтомобилейАвтомобили.СуммаВсего * 1.02 КАК ИнвойсСНаценкой
	|ИЗ
	|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних(, ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)) КАК АвтомобилиСрезПоследних
	|		ПО ПоступлениеАвтомобилейАвтомобили.Автомобиль = АвтомобилиСрезПоследних.Автомобиль
	|ГДЕ
	|	АвтомобилиСрезПоследних.Значение В(&ВидыАвто)
	|	И НЕ ПоступлениеАвтомобилейАвтомобили.Ссылка.ПометкаУдаления
	|	И НЕ ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент.НашаФирма
	|	И ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата <= ДАТАВРЕМЯ(2026, 3, 1)
	|	И ПоступлениеАвтомобилейАвтомобили.СтавкаНДС.Ставка МЕЖДУ 18 И 20
	|	И ПоступлениеАвтомобилейАвтомобили.Ссылка = &Ссылка");     
	//Иванченко 20260121 --	
	СЗ_ВидыАвто = Новый СписокЗначений;
	СЗ_ВидыАвто.Добавить(Перечисления.ВидАвтомобиля.КорпоративнаяКвота);  
	СЗ_ВидыАвто.Добавить(Перечисления.ВидАвтомобиля.Новый);
	СЗ_ВидыАвто.Добавить(Перечисления.ВидАвтомобиля.ПодменныйАвтомобиль); 
	СЗ_ВидыАвто.Добавить(Перечисления.ВидАвтомобиля.ТестовыйАвтомобиль);
	СЗ_ВидыАвто.Добавить(Перечисления.ВидАвтомобиля.АвтомобильСПробегом);		
	ЗапросНА.Параметры.Вставить("ВидыАвто", СЗ_ВидыАвто);    
	ЗапросНА.Параметры.Вставить("Ссылка", Ссылка);    
	ВыгрузкаРезультатаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если ВыгрузкаРезультатаЗапроса.Количество() <> 0 Тогда
		
		Для Каждого ТекСтрокаАвтомобили Из Автомобили Цикл 
			Движение = Движения.Инвойс_х_1точка02.Добавить();
			Движение.Период = РабочаяДата;
			Движение.Автомобиль = ТекСтрокаАвтомобили.Автомобиль;
			Движение.ИнвойсСНаценкой = ТекСтрокаАвтомобили.ИнвойсСНаценкой;   
			Движения.Инвойс_х_1точка02.Записать();
		КонецЦикла; 
		
	КонецЕсли;	
	//Иванченко 20260116 --	
	
КонецПроцедуры // ОбработкаПроведения

//Бондаренко++ 20220520
Функция СМГ_ЕстьАвтоБезДиагностики()
	
	флЕстьАвтоБезДиагностики = Ложь; 
	
	//Бондаренко++ 20240418 
	//Проверка того, что подразделение не относится ни к Пойменной, ни к двум Таганрогам.
	Если НЕ ( ЭтотОбъект.ПодразделениеКомпании.ПринадлежитЭлементу(Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000223")) ИЛИ
		ЭтотОбъект.ПодразделениеКомпании.ПринадлежитЭлементу(Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000199")) ИЛИ 
		ЭтотОбъект.ПодразделениеКомпании.ПринадлежитЭлементу(Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001517")) 
		) Тогда
		//Бондаренко-- 20240418		
		Если Дата >= Дата(2022,5,20) Тогда
			
			//Получаем список автомобилей б/у из табличной части <Автомобили>
			СписокБУавто = СМГ_ПолучитьСписокБУавто();
			
			//Получаем список закрытых заказ-нарядов, с видом ремонта <Диагностика Trade-In>, по списку б/у авто из предыдущего запроса, за последние две недели.
			ТаблицаЗН = СМГ_ПолучитьТаблицуЗН(СписокБУавто);
			
			//Каждый автомобиль из списка б/у пытаемся найти в таблице заказ-нарядов.
			
			ТекстОшибки = "";
			
			Для Каждого ТекБуАвто Из СписокБУавто Цикл
				
				Отбор = Новый Структура();
				Отбор.Вставить("Автомобиль",ТекБуАвто);
				НайдСтроки = ТаблицаЗН.НайтиСтроки(Отбор);
				
				Если НайдСтроки.Количество() = 0 Тогда
					ТекСообщениеОбОшибке = ""+СокрЛП(ТекБуАвто)+" - нет заказ-наряда ""Диагностика Trade-In"""; 
					Если НЕ ТекстОшибки = "" Тогда
						ТекстОшибки = ТекстОшибки +","+Символы.ПС+ ТекСообщениеОбОшибке;
					Иначе	
						ТекстОшибки = ТекСообщениеОбОшибке;									
					КонецЕсли;
					флЕстьАвтоБезДиагностики = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
			Если флЕстьАвтоБезДиагностики Тогда                                
				ТекстОшибки = ТекстОшибки +".";
				СМГ_Предупреждение(ТекстОшибки,,"Запрещено проводить поступление автомобилей без диагностики Trade-In");
			КонецЕсли;
			
		КонецЕсли; 
		//Бондаренко++ 20220527	
	КонецЕсли;
	//Бондаренко-- 20220527
	
	Возврат флЕстьАвтоБезДиагностики;
	
КонецФункции // СМГ_ЕстьАвтоБезДиагностики()

Функция СМГ_ПолучитьСписокБУавто()
	
	СЗ = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	//Иванченко 20251112 ++
	//"ВЫБРАТЬ
	//|	ПоступлениеАвтомобилейАвтомобили.Автомобиль
	//|ИЗ
	//|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
	//|ГДЕ
	//|	ПоступлениеАвтомобилейАвтомобили.АвтомобильБУ
	//|	И ПоступлениеАвтомобилейАвтомобили.Ссылка = &Ссылка"; 
	"ВЫБРАТЬ
	|	ПоступлениеАвтомобилейАвтомобили.Автомобиль КАК Автомобиль
	|ИЗ
	|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
	|ГДЕ
	|	ПоступлениеАвтомобилейАвтомобили.АвтомобильБУ
	|	И ПоступлениеАвтомобилейАвтомобили.Ссылка = &Ссылка
	|	И ПоступлениеАвтомобилейАвтомобили.Ссылка.ХозОперация <> ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеАвтомобилейКомиссия)";	
	//Иванченко 20251112 --	
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	СЗ =  Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Автомобиль");
	
	Возврат СЗ;
	
КонецФункции // СМГ_ПолучитьСписокБУавто()

Функция СМГ_ПолучитьТаблицуЗН(СписокБУавто)
	
	ТЗ = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;                                                                        
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаряд.Ссылка,
	|	ЗаказНаряд.Автомобиль
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|ГДЕ
	|	ЗаказНаряд.Дата >= &Дата
	|	И ЗаказНаряд.Проведен
	|	И ЗаказНаряд.ВидРемонта = &ВидРемонта
	|	И ЗаказНаряд.Состояние = &Состояние
	|	И ЗаказНаряд.Автомобиль В(&СписокБУавто)";
	
	Запрос.УстановитьПараметр("ВидРемонта", Справочники.ВидыРемонта.ДиагностикаТрейдИн);
	Запрос.УстановитьПараметр("Дата", НачалоДня(Дата-86400)); // Сегодня или вчера
	Запрос.УстановитьПараметр("Состояние", Справочники.ВидыСостоянийЗаказНарядов.Закрыт);
	Запрос.УстановитьПараметр("СписокБУавто", СписокБУавто);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции // СМГ_ПолучитьТаблицуЗН(СписокБУавто)
//Бондаренко-- 20220520

//Бондаренко++ 20231123
Функция НайтиСкладАвтомобильный(Подразделение)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкладыКомпании.Ссылка,
	|	СкладыКомпании.ПометкаУдаления,
	|	СкладыКомпании.ЭтоГруппа,
	|	СкладыКомпании.Подразделение,
	|	СкладыКомпании.Организация,
	|	СкладыКомпании.ВидСклада,
	|	СкладыКомпании.ТипСклада,
	|	СкладыКомпании.Основной КАК Основной
	|ИЗ
	|	Справочник.СкладыКомпании КАК СкладыКомпании
	|ГДЕ
	|	НЕ СкладыКомпании.ПометкаУдаления
	|	И НЕ СкладыКомпании.ЭтоГруппа
	|	И СкладыКомпании.Подразделение = &Подразделение
	|	И СкладыКомпании.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.Автомобильный)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Основной УБЫВ";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	СМГ_Сообщить("ОШИБКА! Не найден автомобильный склад для подразделения "+Подразделение,СтатусСообщения.ОченьВажное);
	
	Возврат Справочники.СкладыКомпании.ПустаяСсылка();
	
КонецФункции // НайтиСклад(Организация,Подразделение)

Функция НайтиСоздатьДоговор(Владелец,Организация,Подразделение,ВидДоговора) Экспорт
	
	НовДоговор = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыВзаиморасчетов.Ссылка КАК Ссылка,
	|	ДоговорыВзаиморасчетов.ВидДоговора КАК ВидДоговора,
	|	ДоговорыВзаиморасчетов.Организация КАК Организация,
	|	ДоговорыВзаиморасчетов.ДляПерепродажАвтомобилей КАК ДляПерепродажАвтомобилей,
	|	ДоговорыВзаиморасчетов.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|ГДЕ
	|	ДоговорыВзаиморасчетов.Владелец = &Владелец
	|	И ДоговорыВзаиморасчетов.ВидДоговора = &ВидДоговора
	|	И ДоговорыВзаиморасчетов.Организация = &Организация
	|	И ДоговорыВзаиморасчетов.ДляПерепродажАвтомобилей
	|	И НЕ ДоговорыВзаиморасчетов.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	НовДоговор = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
	НовДоговор.Владелец = Владелец;
	НовДоговор.УстановитьНовыйКод("");
	НовДоговор.ВидДоговора = ВидДоговора;
	НовДоговор.Автор = ПараметрыСеанса.Пользователь; 
	НовДоговор.ДатаСоздания = ТекущаяДата();
	НовДоговор.ДатаНачала = НачалоДня(ТекущаяДата());
	НовДоговор.Организация = Организация;
	НовДоговор.Подразделение = Подразделение;
	НовДоговор.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	Новдоговор.ДатаНачала = ТекущаяДата();
	НовДоговор.ТипДоговора = Перечисления.ТипыДоговоров.Договор;
	НовДоговор.ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
	НовДоговор.ДляАвтосалона = Истина;
	НовДоговор.ДляПерепродажАвтомобилей = Истина;
	НовДоговор.СформироватьНаименование(); 
	
	//Попытка
	НовДоговор.Записать();
	//Исключение
	//	СМГ_Сообщить("ОШИБКА! Не удалось создать новый договор поставки для "+Владелец);	
	//КонецПопытки;
	
	Возврат НовДоговор.Ссылка;
	
КонецФункции // НайтиСоздатьДоговор(Владелец,Организация,ВидДоговора)
//Бондаренко-- 20231123

// Семенихин 06.05.2024 +++++	
Функция СМГ_НетСделкиАвтохаб()
	Если РольДоступна("ПолныеПрава") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НетСделки = Ложь;
	мзОбъявление = РегистрыСведений.ОбъявленияНаАвтохаб.СоздатьМенеджерЗаписи();
	Для Каждого СтрокаАвто Из Автомобили Цикл
		Если СтрокаАвто.АвтомобильБУ Тогда
			мзОбъявление.Автомобиль = СтрокаАвто.Автомобиль;
			мзОбъявление.Прочитать();
			Если мзОбъявление.Выбран() Тогда
				Если Не мзОбъявление.ОсмотрПроведен Тогда
					Сообщить("ЗАПРЕЩЕНО проводить Поступление без завершения Осмотра " + Строка(СтрокаАвто.Автомобиль) +
					" на Автохаб!", СтатусСообщения.ОченьВажное);
					НетСделки = Истина;
				КонецЕсли;
				
			Иначе
				Сообщить("ЗАПРЕЩЕНО проводить Поступление без регистрации Сделки для " + Строка(СтрокаАвто.Автомобиль) +
				" на Автохаб!", СтатусСообщения.ОченьВажное);
				НетСделки = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НетСделки;
КонецФункции
// Семенихин 06.05.2024 +++++

//Бондаренко++ 20250704
Функция НайтиОАБР(Авто)
	
	ОАБР_ = "";
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтгрузкаАвтомобиляБезРеализации.Ссылка КАК Ссылка,
	|	ОтгрузкаАвтомобиляБезРеализации.Дата КАК Дата,
	|	ОтгрузкаАвтомобиляБезРеализации.Автомобиль КАК Автомобиль
	|ИЗ
	|	Документ.ОтгрузкаАвтомобиляБезРеализации КАК ОтгрузкаАвтомобиляБезРеализации
	|ГДЕ
	|	ОтгрузкаАвтомобиляБезРеализации.Автомобиль = &Автомобиль
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобили[0].Автомобиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОАБР_ = ВыборкаДетальныеЗаписи.Ссылка;
		Прервать; 
	КонецЦикла;
	
	Возврат ОАБР_; 
	
КонецФункции //НайтиОАБР(Авто)
//Бондаренко-- 20250704	

//Иванченко 20251124 ++
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого Строка Из Автомобили Цикл
		
		//Иванченко 20260121 ++
		//Иванченко 20251219 ++
		//Если Строка.ВидАвтомобиля <> Перечисления.ВидАвтомобиля.Новый И Строка.ВидАвтомобиля <> Перечисления.ВидАвтомобиля.ПараллельныйИмпорт И Строка.ВидАвтомобиля <> Перечисления.ВидАвтомобиля.КорпоративнаяКвота И ЗначениеЗаполнено(Строка.ЦенаОферты) = Ложь Тогда   
		//Если Строка.ВидАвтомобиля = Перечисления.ВидАвтомобиля.АвтомобильСПробегом И ЗначениеЗаполнено(Строка.ЦенаОферты) = Ложь Тогда   
		Если Строка.ВидАвтомобиля = Перечисления.ВидАвтомобиля.АвтомобильСПробегом И ЗначениеЗаполнено(Строка.ЦенаОферты) = Ложь И (Дата >= ДеньЗет) Тогда   		
			//Иванченко 20251219 --
			//Иванченко 20260121 --		
			//Иванченко 20251125 ++
			#Если Клиент Тогда
				Сообщить("Реквизит ""Цена оферты"" является обязательным для заполнения.", СтатусСообщения.ОченьВажное);	
			#КонецЕсли
			//Иванченко 20251125 --			
			Отказ = Истина;					
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры	
//Иванченко 20251124 --  

//Иванченко 20251209 ++
Функция ПолучитьСтруктуру()	Экспорт 
	//Иванченко 20251209 ++
	// Скрыл пока эта версия договора печатается не только для отдела комиссии
	//Иванченко 20260112 ++
	////Тип(Документы.РабочийЛистКомиссии) 
	//Если ТипЗнч(ДокументОснование) =  Тип("ДокументСсылка.РабочийЛистКомиссии")Тогда
	//	РЛКомиссии = ДокументОснование;
	//Иначе
	//	РЛКомиссии = Документы.РабочийЛистКомиссии.НайтиПоРеквизиту("ПоступлениеАвто", Ссылка);	
	//КонецЕсли;
	//
	//Если обЗначениеНеЗаполнено(РЛКомиссии) Тогда
	//	Возврат NULL;	
	//КонецЕсли;
	//Иванченко 20260112 --	
	//Иванченко 20251209 --	
	
	ДатаДоговора = ?(ЗначениеЗаполнено(ДоговорВзаиморасчетов.ДатаКП), ДоговорВзаиморасчетов.ДатаКП, Дата);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Номер", СокрЛП(?(ЗначениеЗаполнено(ВхДокНомер), ВхДокНомер, Номер)));
	СтруктураПараметров.Вставить("Дата", Формат(ДатаДоговора, "ДЛФ=Д") + " г."); 
	//Иванченко 20260303 ++
	//СтруктураПараметров.Вставить("Принципал", Контрагент.НаименованиеПолное);  
	//Иванченко 20260303 --
	СтруктураОтбора = Новый Структура("Организация, Объект", Организация, Перечисления.ВидыОбъектовСведений.Руководитель);
	СтруктураСведений = РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(РабочаяДата, СтруктураОтбора);
	Руководитель = СтруктураСведений.Значение;
	СтруктураСведений = Неопределено; 
	
	//Иванченко 20251225 ++
	#Область Устарело
	//Параметр_Подписант = ?(Ссылка.Метаданные().Реквизиты.Найти("Подписант") <> Неопределено И ЗначениеЗаполнено(Подписант), Подписант, ПараметрыСеанса.Пользователь.Сотрудник); 
	//ТекущаяДоверенность = СМ_ФормированиеНовыхОбъектов.ПолучитьДоверенность(Параметр_Подписант, Организация);
	//
	//Иванченко 20251222 ++
	//Если Организация.ФормаСобственности	= Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда
	//	
	//	ТекущаяДоверенность = СМ_ФормированиеНовыхОбъектов.ПолучитьДоверенность(Автор, Организация);
	//	
	//	Если ТекущаяДоверенность = Неопределено Тогда
	//		ВЛицеРуководителя = "Генерального директора " + СМ_ФормированиеНовыхОбъектов.ПадежФИО(Руководитель.Наименование);
	//		НаОсновании = "Устава";			
	//	Иначе
	//		СтруктураОтбора = Новый Структура("Организация", Организация);
	//		СтруктураСведений = РегистрыСведений.ИОГенеральногоДиректора.ПолучитьПоследнее(Дата, СтруктураОтбора);
	//		
	//		Если СтруктураСведений <> Неопределено И ДатаДоговора >= СтруктураСведений.ДатаНачала И ДатаДоговора < КонецДня(СтруктураСведений.ДатаОкончания) Тогда
	//			Руководитель = СтруктураСведений.Значение;
	//			ВЛицеРуководителя = " и.о. Генерального директора " + СМ_ФормированиеНовыхОбъектов.ПадежФИО(Руководитель.Наименование);
	//			ФормаВыбора = Справочники.ПодтверждающиеДокументы.ПолучитьФормуВыбора();
	//			ФормаВыбора.Заголовок = "Выбор доверенности для и.о. Генерального директора";
	//			ФормаВыбора.Отбор.Владелец.Значение = Руководитель;
	//			ФормаВыбора.Отбор.Владелец.Использование = Истина;
	//			ФормаВыбора.Отбор.ВидПодтверждающегоДокумента.Значение = Перечисления.ВидыДокументов.Доверенность;
	//			ФормаВыбора.Отбор.ВидПодтверждающегоДокумента.Использование = Истина;
	//			ПодтвДокументСсылка = ФормаВыбора.ОткрытьМодально();
	//			
	//			Если ЗначениеЗаполнено(ПодтвДокументСсылка) Тогда
	//				НаОсновании = "Доверенности от " + Формат(ПодтвДокументСсылка.ДатаВыдачи, "ДЛФ=Д");			
	//			КонецЕсли;	
	//			
	//		Иначе	
	//			ВЛицеРуководителя = СМ_ФормированиеНовыхОбъектов.daСклонение(Автор.Сотрудник.Должность, 2) + " " + СМ_ФормированиеНовыхОбъектов.ПадежФИО(Автор.Наименование);
	//			НаОсновании = "Доверенности № " + ТекущаяДоверенность.Номер + " от " + Формат(ТекущаяДоверенность.ДатаВыдачи, "ДФ=dd.MM.yy");
	//			СтруктураПараметров.Вставить("ОснованиеПодписи", "по " + НаОсновании);
	//		КонецЕсли; 		
	//		
	//	КонецЕсли; 
	//	
	//Иначе
	//	ВЛицеРуководителя = СМ_ФормированиеНовыхОбъектов.ПадежФИО(Руководитель.Наименование);
	//	НаОсновании = "Свидетельства";			
	//КонецЕсли; 
	
	//	Если ТекущаяДоверенность = Неопределено Тогда
	//		//Иванченко 20251218 ++                     
	//		ОтпустилПредставление = Руководитель.Наименование;
	//		//Иванченко 20251218 -- 
	//		
	//		Если Организация.ФормаСобственности	= Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда
	//			ВЛицеРуководителя = "Генерального директора " + СМ_ФормированиеНовыхОбъектов.ПадежФИО(Руководитель.Наименование);
	//			НаОсновании = "Устава";	
	//		Иначе    
	//			ВЛицеРуководителя = СМ_ФормированиеНовыхОбъектов.ПадежФИО(Руководитель.Наименование);
	//			НаОсновании = "Свидетельства";			
	//		КонецЕсли; 
	//		
	//	Иначе
	//		СтруктураОтбора = Новый Структура("Организация", Организация);
	//		СтруктураСведений = РегистрыСведений.ИОГенеральногоДиректора.ПолучитьПоследнее(Дата, СтруктураОтбора);
	//		
	//		Если СтруктураСведений <> Неопределено И ДатаДоговора >= СтруктураСведений.ДатаНачала И ДатаДоговора < КонецДня(СтруктураСведений.ДатаОкончания) Тогда
	//			Руководитель = СтруктураСведений.Значение;
	//			//Иванченко 20251218 ++
	//			ОтпустилПредставление = Руководитель.Наименование;
	//			//Иванченко 20251218 --			
	//			ВЛицеРуководителя = " и.о. Генерального директора " + СМ_ФормированиеНовыхОбъектов.ПадежФИО(Руководитель.Наименование);
	//			ФормаВыбора = Справочники.ПодтверждающиеДокументы.ПолучитьФормуВыбора();
	//			ФормаВыбора.Заголовок = "Выбор доверенности для и.о. Генерального директора";
	//			ФормаВыбора.Отбор.Владелец.Значение = Руководитель;
	//			ФормаВыбора.Отбор.Владелец.Использование = Истина;
	//			ФормаВыбора.Отбор.ВидПодтверждающегоДокумента.Значение = Перечисления.ВидыДокументов.Доверенность;
	//			ФормаВыбора.Отбор.ВидПодтверждающегоДокумента.Использование = Истина;
	//			ПодтвДокументСсылка = ФормаВыбора.ОткрытьМодально();
	//			
	//			Если ЗначениеЗаполнено(ПодтвДокументСсылка) Тогда
	//				НаОсновании = "Доверенности от " + Формат(ПодтвДокументСсылка.ДатаВыдачи, "ДЛФ=Д");			
	//			КонецЕсли;	
	//			
	//		Иначе
	//			//Иванченко 20251218 ++
	//			ОтпустилПредставление = Автор.Наименование;
	//			//Иванченко 20251218 --	
	//			ВЛицеРуководителя = СМ_ФормированиеНовыхОбъектов.daСклонение(Автор.Сотрудник.Должность, 2) + " " + СМ_ФормированиеНовыхОбъектов.ПадежФИО(Автор.Наименование);
	//			НаОсновании = "Доверенности № " + ТекущаяДоверенность.Номер + " от " + Формат(ТекущаяДоверенность.ДатаВыдачи, "ДФ=dd.MM.yy");
	//		КонецЕсли; 		
	//		
	//	КонецЕсли;
	////Иванченко 20251222 --
	//
	//СтруктураПараметров.Вставить("ВЛице", ВЛицеРуководителя + ?(ЗначениеЗаполнено(НаОсновании), ", действующего на основании " + НаОсновании, "")); 
	
	// Холышенвская ++ 20260204
	//ДолжностьКтоБудетПодписывать = "";        
	//
	//Если Не обЗначениеНеЗаполнено(Подписант) Тогда
	//	ДолжностьКтоБудетПодписывать = СокрЛП(СМ_ФормированиеНовыхОбъектов.ПадежФИО(СокрЛП(Подписант.Должность))); 
	//  КонецЕсли;             
	//  
	//Если обЗначениеНеЗаполнено(Подписант) Тогда
	//	Подписант = ПараметрыСеанса.Пользователь.Сотрудник; 
	//	ДолжностьКтоБудетПодписывать = СокрЛП(СМ_ФормированиеНовыхОбъектов.ПадежФИО(СокрЛП(Подписант.Должность))); 
	//КонецЕсли;
	//
	//Если Найти(ДолжностьКтоБудетПодписывать,"-") > 0  Тогда
	//	ДолжностьКтоБудетПодписывать = СтрЗаменить(ДолжностьКтоБудетПодписывать,"-","а-");
	// КонецЕсли;
	
	//СотрудникРП = СМ_ФормированиеНовыхОбъектов.ПадежФИО(Подписант.Наименование);
	//
	//Если СокрЛП(Подписант.Отчество)="" Тогда
	//	ДействующегоИлиДействующей = "действующего(ей)";	
	//Иначе  
	//	
	// 	Если Врег(Прав(Подписант.Отчество,1))="А" Тогда
	//		ДействующегоИлиДействующей = "действующей";	
	// 	Иначе
	//		ДействующегоИлиДействующей = "действующего";		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	////Иванченко 20260128 ++
	////ТекущаяДоверенность = СМ_ФормированиеНовыхОбъектов.ПолучитьДоверенность(Подписант, Агент);
	//ТекущаяДоверенность = СМ_ФормированиеНовыхОбъектов.ПолучитьДоверенность(Подписант, ?(ЗначениеЗаполнено(Агент), Агент, Организация));
	////Иванченко 20260128 --	 
	//
	//Если ТекущаяДоверенность = Неопределено Тогда 
	//	НаОсновании      = "на основании доверенности";
	// 	ОснованиеПодписи = "по доверенности";
	//Иначе
	//	НаОсновании      = "на основании доверенности № " + ТекущаяДоверенность.Номер + " от " + Формат(ТекущаяДоверенность.ДатаВыдачи,"ДФ=dd.MM.yy");
	//	ОснованиеПодписи = "по доверенности № " + ТекущаяДоверенность.Номер+ " от " + Формат(ТекущаяДоверенность.ДатаВыдачи,"ДФ=dd.MM.yy");
	// КонецЕсли; 
	
	////Иванченко 20260128 ++	
	////ОбАгенте = СокрЛП(Агент.НаименованиеПолное) + ", в лице " + ДолжностьКтоБудетПодписывать + " " + СотрудникРП + ", " + ДействующегоИлиДействующей + " " + СокрЛП(НаОсновании);
	//ОбАгенте = СокрЛП(?(ЗначениеЗаполнено(Агент), Агент, Организация).НаименованиеПолное) + ", в лице " + ДолжностьКтоБудетПодписывать + " " + СотрудникРП + ", " + ДействующегоИлиДействующей + " " + СокрЛП(НаОсновании);	
	////Иванченко 20260128 --
	//СтруктураПараметров.Вставить("ОбАгенте", ОбАгенте); 
	//СтруктураПараметров.Вставить("СотрПоДов", "В лице " + ДолжностьКтоБудетПодписывать + " " + СотрудникРП + ", " + СокрЛП(НаОсновании));
	////Иванченко 20251225 --  
	//
	// Холышевская -- 20260204
	#КонецОбласти
	
	// Холышевская ++ 20260204 
	ОбАгенте = СокрЛП(Организация.НаименованиеПолное);  
	//Иванченко 20260803 ++
	ОрганизацияДляПечати = СокрЛП(Организация.НаименованиеДляПечати);
	//Иванченко 20260803 --
	Подписант = ?( ЗначениеЗаполнено(Подписант), Подписант, ПараметрыСеанса.Пользователь.Сотрудник); 
	// Холышевская ++ 18.03.2026  
	СтруктураПараметров.Вставить("ПодписантАгент", "ФИО");
	// Холышевская -- 18.03.2026
	
	//Иванченко 20260207 ++
	//Если Организация.ФормаСобственности	= Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда 
	//Иванченко 20260207 --		
	
	ТекущаяДоверенность = СМ_ФормированиеНовыхОбъектов.ПолучитьДоверенность(Подписант, Организация);
	
	Если ТекущаяДоверенность = Неопределено Тогда 
		
		//Иванченко 20260207 ++
		Если Организация.ФормаСобственности	= Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда 
			//Иванченко 20260207 --		
			ВЛицеРуководителя = "Генерального директора " + СМ_ФормированиеНовыхОбъектов.ПадежФИО(Руководитель.Наименование);
			НаОсновании = "Устава";	  
			//Иванченко 20260803 ++
			СтруктураПараметров.Вставить("ПодписантАгентАльт", "Генеральный директор " + ОрганизацияДляПечати + " _______________________ / " + Руководитель.Наименование + " /");
			//Иванченко 20260803 --			
			//Иванченко 20260207 ++ 
		Иначе
			ВЛицеРуководителя = СМ_ФормированиеНовыхОбъектов.ПадежФИО(Руководитель.Наименование);
			НаОсновании = "Свидетельства";	
			//Иванченко 20260803 ++
			СтруктураПараметров.Вставить("ПодписантАгентАльт", ОрганизацияДляПечати + " _______________________ / " + Руководитель.Наименование + " /");
			//Иванченко 20260803 --
		КонецЕсли;  
		
		//Иванченко 20260803 ++
		СтруктураПараметров.Вставить("ПодписантАгент", Руководитель.Наименование + Символы.ПС + " на основании " + НаОсновании);
	    //Иванченко 20260803 --
		//Иванченко 20260207 --		
		
	Иначе
		СтруктураОтбора = Новый Структура("Организация", Организация);
		СтруктураСведений = РегистрыСведений.ИОГенеральногоДиректора.ПолучитьПоследнее(Дата, СтруктураОтбора);
		
		Если СтруктураСведений <> Неопределено И ДатаДоговора >= СтруктураСведений.ДатаНачала И ДатаДоговора < КонецДня(СтруктураСведений.ДатаОкончания) Тогда
			Руководитель = СтруктураСведений.Значение;
			ВЛицеРуководителя = " и.о. Генерального директора " + СМ_ФормированиеНовыхОбъектов.ПадежФИО(Руководитель.Наименование);
			ФормаВыбора = Справочники.ПодтверждающиеДокументы.ПолучитьФормуВыбора();
			ФормаВыбора.Заголовок = "Выбор доверенности для и.о. Генерального директора";
			ФормаВыбора.Отбор.Владелец.Значение = Руководитель;
			ФормаВыбора.Отбор.Владелец.Использование = Истина;
			ФормаВыбора.Отбор.ВидПодтверждающегоДокумента.Значение = Перечисления.ВидыДокументов.Доверенность;
			ФормаВыбора.Отбор.ВидПодтверждающегоДокумента.Использование = Истина;
			ПодтвДокументСсылка = ФормаВыбора.ОткрытьМодально();
			
			Если ЗначениеЗаполнено(ПодтвДокументСсылка) Тогда
				НаОсновании = "Доверенности от " + Формат(ПодтвДокументСсылка.ДатаВыдачи, "ДЛФ=Д");	
				//Иванченко 20260803 ++
				//// Холышевская ++ 18.03.2026
				//СтруктураПараметров.Вставить("ПодписантАгент", Подписант.Наименование + Символы.ПС +  " по " + НаОсновании); 
				//// Холышевская -- 18.03.2026 
				//Иванченко 20260803 --
			КонецЕсли;	
			
			//Иванченко 20260803 ++			
			СтруктураПараметров.Вставить("ПодписантАгентАльт", Подписант.Должность + " " + ОрганизацияДляПечати + " _______________________ / " + Подписант.Наименование + " /");
			//Иванченко 20260803 --		
		Иначе	
			ВЛицеРуководителя = СМ_ФормированиеНовыхОбъектов.daСклонение(Подписант.Должность, 2) + " " + СМ_ФормированиеНовыхОбъектов.ПадежФИО(Подписант.Наименование);
			НаОсновании = "Доверенности № " + ТекущаяДоверенность.Номер + " от " + Формат(ТекущаяДоверенность.ДатаВыдачи, "ДФ=dd.MM.yy");
			СтруктураПараметров.Вставить("ОснованиеПодписи", "по " + НаОсновании);   
			//Иванченко 20260803 ++
			//// Холышевская ++ 18.03.2026
			СтруктураПараметров.Вставить("ПодписантАгент", Подписант.Наименование + Символы.ПС +  " по " + НаОсновании); 
			//// Холышевская -- 18.03.2026 
			//Иванченко 20260803 --
			//Иванченко 20260803 ++			
			//СтруктураПараметров.Вставить("ПодписантАгентАльт", Подписант.Должность + " " + ОрганизацияДляПечати + " _______________________ / " + Подписант.Наименование + " /");
			//Иванченко 20260803 --		
		КонецЕсли; 		
		
		//Иванченко 20260803 ++
		СтруктураПараметров.Вставить("ПодписантАгент", Подписант.Наименование + Символы.ПС +  " по " + НаОсновании);
		//Иванченко 20260803 --		
	
	КонецЕсли;    
	
	//Иванченко 20260207 ++		
	//Иначе
	//	ВЛицеРуководителя = СМ_ФормированиеНовыхОбъектов.ПадежФИО(Руководитель.Наименование);
	//	НаОсновании = "Свидетельства";			
	//КонецЕсли; 
	//Иванченко 20260207 --	
	
	СтруктураПараметров.Вставить("ОбАгенте", ОбАгенте);
	СтруктураПараметров.Вставить("ВЛице", ВЛицеРуководителя + ?(ЗначениеЗаполнено(НаОсновании), ", действующего на основании " + НаОсновании, ""));  
	
	// Холышевская -- 20260204   
	
	// Холышевская ++ 18.03.2026
	ЗапросПД = Новый Запрос;
		ЗапросПД.Текст = 
		"ВЫБРАТЬ
		|	ПодтверждающиеДокументы.Серия КАК Серия,
		|	ПодтверждающиеДокументы.Номер КАК Номер,
		|	ПодтверждающиеДокументы.ДатаВыдачи КАК ДатаВыдачи,
		|	ПодтверждающиеДокументы.КемВыдан КАК КемВыдан,
		|	ПодтверждающиеДокументы.КодПодразделения КАК КодПодразделения
		|ИЗ
		|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
		|ГДЕ
		|	ПодтверждающиеДокументы.Владелец = &Владелец
		|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = &ВидПодтверждающегоДокумента
		|	И ПодтверждающиеДокументы.Текущий = ИСТИНА";   
	// Холышевская -- 18.03.2026
	
	//Иванченко 20260303 ++
	Если Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
	//Иванченко 20260303 --		 
		
		ЗапросПД.УстановитьПараметр("Владелец", Контрагент); 
		ЗапросПД.УстановитьПараметр("ВидПодтверждающегоДокумента", Перечисления.ВидыДокументов.Паспорт);  
		// Холышевская ++ 20260126    
		// было
		// РезультатПД = Результат.Выполнить().Выбрать()
		// стало
		РезультатЗапросаПД = ЗапросПД.Выполнить(); 
		РезультатПД = РезультатЗапросаПД.Выбрать();  
		// Холышевская -- 20260126
		
		//Иванченко 20260112 ++ 
		//Если НЕ РезультатПД.Следующий() Тогда
		// Холышевская ++ 20260126
		Если РезультатЗапросаПД.Пустой() Тогда
			// Холышевская -- 20260126
			ЗапросПД.УстановитьПараметр("ВидПодтверждающегоДокумента", Перечисления.ВидыДокументов.ВидНаЖительство);
			РезультатПД = ЗапросПД.Выполнить().Выбрать();
		КонецЕсли;	
		//Иванченко 20260112 --		
		
		Если РезультатПД.Следующий() Тогда	
			ПаспортСерия = РезультатПД.Серия;
			ПаспортНомер = РезультатПД.Номер; 
			ПаспортКемВыдан = РезультатПД.КемВыдан;
			ПаспортДатаВыдачи = Формат(РезультатПД.ДатаВыдачи, "ДЛФ=Д") + " г."; 
			ПаспортКодПодразделения = РезультатПД.КодПодразделения;  
			//Иванченко 20260303 ++		
			//СтруктураПараметров.Вставить("Паспорт", ПаспортСерия + " №" + ПаспортНомер + ", выдан " + ПаспортКемВыдан + ", дата выдачи " + ПаспортДатаВыдачи);      
		//Овечкин 20260807 ++
			Если  ЭтотОбъект.НаДоверенноеЛицо = Ложь Тогда
				СтруктураПараметров.Вставить("Принципал", Контрагент.НаименованиеПолное + ", паспорт серия " + ПаспортСерия + " №" + ПаспортНомер + ", выдан " + ПаспортКемВыдан + ", дата выдачи " + ПаспортДатаВыдачи);
				СтруктураПараметров.Вставить("ПодписантПринципал","ФИО");
			Иначе
				ТаблицаРезультат = Новый ТаблицаЗначений;
				РаботаСКонтактнымиЛицами.ПолучитьВедомых(Контрагент, ТаблицаРезультат);
				СЗ = Новый СписокЗначений;
				СЗ.ЗагрузитьЗначения(ТаблицаРезультат.ВыгрузитьКолонку("Ведомый"));
				ТекЭл = СЗ.ВыбратьЭлемент("Выбирайте контактное лицо.", ТекЭл);	
				КонтактноеЛицоСсылка = ТекЭл.Значение;
				
				КонтактноеЛицо = СокрЛП(СМ_ФормированиеНовыхОбъектов.ПадежФИО(КонтактноеЛицоСсылка.Наименование)); 
				ФормаВыбора = Справочники.ПодтверждающиеДокументы.ПолучитьФормуВыбора();
				ФормаВыбора.Заголовок = "Выбор подтверждающего документа";
				ФормаВыбора.Отбор.Владелец.Значение = КонтактноеЛицоСсылка;
				ФормаВыбора.Отбор.Владелец.Использование = Истина;
				ПодтвДокументСсылка = ФормаВыбора.ОткрытьМодально();
				
				Если ЗначениеЗаполнено(ПодтвДокументСсылка) Тогда
					ПодтвДокумент = ПодтвДокументСсылка.Наименование; 
					ВидДокументаСтрока = Строка(ПодтвДокументСсылка.ВидПодтверждающегоДокумента);
					ПодтвДокумент = СтрЗаменить(ПодтвДокументСсылка.Наименование, ВидДокументаСтрока, "");
					ВидДокументаСтрока = ПолучитьСклоненияСтроки(ВидДокументаСтрока,,"ПД=Предложный");
					ПодтвДокумент = ВидДокументаСтрока[0] + ПодтвДокумент;
				Иначе
					ПодтвДокумент = "";
				КонецЕсли;
				
				
				ПринципалНаОсновании = ?(ЗначениеЗаполнено(ПодтвДокумент), ", действующего на основании " + ПодтвДокумент, "");
				ПаспортныеДанные =  ", паспорт серия " + ПаспортСерия + " №" + ПаспортНомер + ", выдан " + ПаспортКемВыдан + ", дата выдачи " + ПаспортДатаВыдачи;
				СтруктураПараметров.Вставить("Принципал", Контрагент.НаименованиеПолное + ПаспортныеДанные +  "в лице " + КонтактноеЛицо + ПаспортныеДанные + ПринципалНаОсновании);
				КонтактноеЛицоПодписант = СокрЛП(СМ_ФормированиеНовыхОбъектов.ПадежФИО(КонтактноеЛицоСсылка.Наименование,1));
				ПодписантНаОсновании = ?(ЗначениеЗаполнено(ПодтвДокумент), ", действующий на основании " + ПодтвДокумент, "");
				СтруктураПараметров.Вставить("ПодписантПринципал", КонтактноеЛицоПодписант + ПодписантНаОсновании);
			КонецЕсли;
         //Овечкин 20260807 --

			//Иванченко 20260303 --		
			//Иванченко 20251222 ++		
			//СтруктураПараметров.Вставить("ПринципалФИО", Контрагент.НаименованиеПолное);	
			//СтруктураПараметров.Вставить("ПринципалАдрес", спПолучитьПредставление(Контрагент, Новый Структура("АдресЮридический")));
			//СтруктураПараметров.Вставить("ПринципалПаспорт", ПаспортСерия + " " + ПаспортНомер);	
			//СтруктураПараметров.Вставить("ПринципалВыдан", ПаспортКемВыдан);	
			//СтруктураПараметров.Вставить("ПринципалДатаВыдачи", ПаспортДатаВыдачи);	
			//СтруктураПараметров.Вставить("ПринципалКодПодразделения", ПаспортКодПодразделения);
			//Иванченко 20251222 --	
		КонецЕсли; 
		
	//Иванченко 20260303 ++
	ИначеЕсли Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда 
		ТаблицаРезультат = Новый ТаблицаЗначений;
		РаботаСКонтактнымиЛицами.ПолучитьВедомых(Контрагент, ТаблицаРезультат);
		СЗ = Новый СписокЗначений;
		СЗ.ЗагрузитьЗначения(ТаблицаРезультат.ВыгрузитьКолонку("Ведомый"));
		ТекЭл = СЗ.ВыбратьЭлемент("Выбирайте контактное лицо.", ТекЭл);
		// Холышевская ++ 11.08.2026
		Если НЕ обЗначениеНеЗаполнено(ТекЭл) Тогда
			КонтактноеЛицоСсылка = ТекЭл.Значение;
		Иначе
			СМГ_Сообщить("ОШИБКА! Не выбрано контактное лицо. Заполните контактные лица у контагента " + Контрагент,СтатусСообщения.ОченьВажное);
			Возврат NULL;
		КонецЕсли;
		// Холышевская -- 11.08.2026
		
		Если ЗначениеЗаполнено(КонтактноеЛицоСсылка) Тогда
			// Холышевская ++ 18.03.2026
			КонтактноеЛицо = ПолучитьСклоненияСтроки(КонтактноеЛицоСсылка.Наименование,,"ПД=Родительный");
			КонтактноеЛицо = КонтактноеЛицо[0]; 
			СтрокаТЗ = ТаблицаРезультат.НайтиСтроки(Новый Структура("Ведомый", КонтактноеЛицоСсылка)); 
			Должность = Неопределено;
			Должность = СтрокаТЗ[0].Должность;   
			Если Должность = Неопределено Тогда    
				// Холышевская -- 18.03.2026
				Должность = СокрЛП(КонтактноеЛицоСсылка.Должность.Наименование);
				ПозицияПробела = Найти(Должность," ");
				
				Если ПозицияПробела > 0 Тогда
					Должность = СокрЛП(СМ_ФормированиеНовыхОбъектов.ПадежФИО(Сред(Должность, 1, ПозицияПробела - 1) + " " + Сред(Должность, ПозицияПробела + 1)));	
				Иначе
					Должность = СМ_ФормированиеНовыхОбъектов.ПадежФИО(Должность);	
				КонецЕсли; 
				
				 
			КонецЕсли; 
			// Холышевская ++ 06.08.2026
			ПозицияПробела = Найти(Должность," ");
			Должность = ПолучитьСклоненияСтроки(Должность,,"ПД=Родительный");
			Должность = Должность[0];
			// Холышевская -- 06.08.2026
		Иначе
			КонтактноеЛицо = "";
		КонецЕсли;	
		
		// Холышевская ++ 01.07.2026
		ФормаВыбора = Справочники.ПодтверждающиеДокументы.ПолучитьФормуВыбора();
		ФормаВыбора.Заголовок = "Выбор подтверждающего документа";
		ФормаВыбора.Отбор.Владелец.Значение = КонтактноеЛицоСсылка;
		ФормаВыбора.Отбор.Владелец.Использование = Истина;
		ПодтвДокументСсылка = ФормаВыбора.ОткрытьМодально();
		
		Если ЗначениеЗаполнено(ПодтвДокументСсылка) Тогда
			ПодтвДокумент = ПодтвДокументСсылка.Наименование;
			// Холышевская ++ 06.08.2026 
			ВидДокументаСтрока = Строка(ПодтвДокументСсылка.ВидПодтверждающегоДокумента);
			ПодтвДокумент = СтрЗаменить(ПодтвДокументСсылка.Наименование, ВидДокументаСтрока, "");
			ВидДокументаСтрока = ПолучитьСклоненияСтроки(ВидДокументаСтрока,,"ПД=Родительный");
			ПодтвДокумент = ВидДокументаСтрока[0] + ПодтвДокумент;
			// Холышевская -- 06.08.2026
		Иначе
			ПодтвДокумент = "";
		КонецЕсли; 
		// Холышевская -- 01.07.2026
		
		// Холышевская ++ 18.03.2026
		ПринципалНаОсновании = ?(ЗначениеЗаполнено(ПодтвДокумент), ", действующего на основании " + ПодтвДокумент, "");
		СтруктураПараметров.Вставить("Принципал", Контрагент.НаименованиеПолное + ", в лице " + Должность
									+ " " + КонтактноеЛицо + ПринципалНаОсновании); 
		// Холышевская -- 18.03.2026
	КонецЕсли;
	//Иванченко 20260303 --
	// Овечкин ++ 19.03.2026
	Если Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда 
	ТаблицаРезультат = Новый ТаблицаЗначений;
	РаботаСКонтактнымиЛицами.ПолучитьВедомых(Контрагент, ТаблицаРезультат);
	СЗ = Новый СписокЗначений;
	СЗ.ЗагрузитьЗначения(ТаблицаРезультат.ВыгрузитьКолонку("Ведомый"));
	ТекЭл = СЗ.ВыбратьЭлемент("Выбирайте контактное лицо.", ТекЭл);	
	КонтактноеЛицоСсылка = ТекЭл.Значение;
	
	Если ЗначениеЗаполнено(КонтактноеЛицоСсылка) Тогда
		
		КонтактноеЛицо = СокрЛП(СМ_ФормированиеНовыхОбъектов.ПадежФИО(КонтактноеЛицоСсылка.Наименование)); 
		СтрокаТЗ = ТаблицаРезультат.НайтиСтроки(Новый Структура("Ведомый", КонтактноеЛицоСсылка)); 
		Должность = Неопределено;
		Должность = СтрокаТЗ[0].Должность;   
		Если Должность = Неопределено Тогда    
			
			Должность = СокрЛП(КонтактноеЛицоСсылка.Должность.Наименование);
			ПозицияПробела = Найти(Должность," ");
			
			Если ПозицияПробела > 0 Тогда
				Должность = СокрЛП(СМ_ФормированиеНовыхОбъектов.ПадежФИО(Сред(Должность, 1, ПозицияПробела - 1) + " " + Сред(Должность, ПозицияПробела + 1)));	
			Иначе
				Должность = СМ_ФормированиеНовыхОбъектов.ПадежФИО(Должность);	
			КонецЕсли; 
			
			
		КонецЕсли;
	Иначе
		КонтактноеЛицо = "";
	КонецЕсли;	
	
	ФормаВыбора = Справочники.ПодтверждающиеДокументы.ПолучитьФормуВыбора();
	ФормаВыбора.Заголовок = "Выбор подтверждающего документа";
	ФормаВыбора.Отбор.Владелец.Значение = КонтактноеЛицоСсылка;
	ФормаВыбора.Отбор.Владелец.Использование = Истина;
	ПодтвДокументСсылка = ФормаВыбора.ОткрытьМодально();
	
	Если ЗначениеЗаполнено(ПодтвДокументСсылка) Тогда
		ПодтвДокумент = ПодтвДокументСсылка.Наименование;
	Иначе
		ПодтвДокумент = "";
	КонецЕсли;
		ПринципалНаОсновании = ?(ЗначениеЗаполнено(ПодтвДокумент), ", действующего на основании " + ПодтвДокумент, "");
		СтруктураПараметров.Вставить("Принципал", Контрагент.НаименованиеПолное + ", в лице " + СМ_ФормированиеНовыхОбъектов.daСклонение(Должность, 2)
									+ " " + КонтактноеЛицо + ПринципалНаОсновании);	
КонецЕсли;
// Овечкин -- 19.03.2026
	
	СтруктураПараметров.Вставить("ЦенаПоступления", Автомобили[0].СуммаВсего);    	
	
	Автомобиль = Автомобили[0].Автомобиль; 	
	
	СтруктураПараметров.Вставить("VIN", Автомобиль.VIN);
	СтруктураПараметров.Вставить("ТипТС", "Легковой");
	СтруктураПараметров.Вставить("МаркаМодель", Автомобиль.Модель);
	СтруктураПараметров.Вставить("ГодИзготовления", Формат(Год(Автомобиль.ГодВыпуска), "ЧДЦ=0; ЧГ=0")); 
	СтруктураПараметров.Вставить("Двигатель", Автомобиль.НомерДвигателя);
	СтруктураПараметров.Вставить("Шасси", Автомобиль.НомерШасси); 
	СтруктураПараметров.Вставить("Кузов", Автомобиль.НомерКузова);
	СтруктураПараметров.Вставить("Цвет", Автомобиль.Цвет); 
	
	ЗапросПД.УстановитьПараметр("Владелец", Автомобиль);  	
	ЗапросПД.УстановитьПараметр("ВидПодтверждающегоДокумента", Перечисления.ВидыДокументов.ВыпискаИзЭлектронногоПаспорта);
	РезультатЭПТС = ЗапросПД.Выполнить().Выбрать();
	
	Если РезультатЭПТС.Следующий() Тогда
		СтруктураПараметров.Вставить("ПТССерияНомер", РезультатЭПТС.Серия + ", " + РезультатЭПТС.Номер);
		СтруктураПараметров.Вставить("ПТСВыдано", РезультатЭПТС.КемВыдан + ", " + Формат(РезультатЭПТС.ДатаВыдачи, "ДФ=dd.MM.yyyy"));    
	Иначе
		ЗапросПД.УстановитьПараметр("ВидПодтверждающегоДокумента", Перечисления.ВидыДокументов.ПТС);
		РезультатПТС = ЗапросПД.Выполнить().Выбрать();
		
		Если РезультатПТС.Следующий() Тогда
			СтруктураПараметров.Вставить("ПТССерияНомер", РезультатПТС.Серия + ", " + РезультатПТС.Номер);
			СтруктураПараметров.Вставить("ПТСВыдано", РезультатПТС.КемВыдан + ", " + Формат(РезультатПТС.ДатаВыдачи, "ДФ=dd.MM.yyyy")); 	
		КонецЕсли;		
		
	КонецЕсли;		
	
	ЗапросПД.УстановитьПараметр("ВидПодтверждающегоДокумента", Перечисления.ВидыДокументов.Свидетельство);
	РезультатСТС = ЗапросПД.Выполнить().Выбрать();
	
	Если РезультатСТС.Следующий() Тогда
		СтруктураПараметров.Вставить("СТССерияНомер", РезультатСТС.Серия + ", " + РезультатСТС.Номер);
		СтруктураПараметров.Вставить("СТСВыдано", РезультатСТС.КемВыдан + ", " + Формат(РезультатСТС.ДатаВыдачи, "ДФ=dd.MM.yyyy"));
	КонецЕсли;		
	
	СтруктураПараметров.Вставить("НомернойЗнак", Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,));
	
	//Иванченко 20260615 ++ 
	Если Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда  
		СтруктураПараметров.Вставить("П1точка7", ""); 
	Иначе	
		СтруктураПараметров.Вставить("П1точка7", Символы.ПС + "1.7. Принципал настоящим заверяет и гарантирует, что на момент подписания настоящего договора не планирует преднамеренное банкротство, не имеет неисполненных денежных обязательств, которые могут повлечь возбуждение дела о банкротстве гражданина; в отношении него не применяются процедуры банкротства (реструктуризация долгов, реализация имущества гражданина, мировое соглашение), не принято решение о признании гражданина банкротом; отсутствуют любые основания для признания сделки недействительной по основаниям, предусмотренным ст. 61.2, 61.3, ст. 213.32 ФЗ 127 от 26.10.2002 г. «О несостоятельности (банкротстве)»."); 
	КонецЕсли;
	//Иванченко 20260615 --  
	
	//Иванченко 20260112 ++
	//СтруктураПараметров.Вставить("СрокДоговора", ПолучитьСклоненияСтрокиПоЧислу("день", РЛКомиссии.СрокДоговора,,, "ПД=Именительный")[0]); 
	//Иванченко 20260112 --
	
	//Иванченко 20251222 ++		
	//СтруктураПараметров.Вставить("НаименованиеПолное", Организация.НаименованиеПолное);
	//СтруктураПараметров.Вставить("АгентАдрес", спПолучитьПредставление(Организация, Новый Структура("АдресЮридический"))); 	
	//СтруктураПараметров.Вставить("АгентИНН", Организация.ИНН);	
	//СтруктураПараметров.Вставить("АгентОГРН", Организация.КПП);	
	//СтруктураПараметров.Вставить("АгентРС", Организация.ОсновнойБанковскийСчет.НомерСчета);	
	//СтруктураПараметров.Вставить("АгентКС", Организация.ОсновнойБанковскийСчет.Банк.КоррСчет);	
	//СтруктураПараметров.Вставить("АгентБИК", Организация.ОсновнойБанковскийСчет.Банк.Код);	 
	//СтруктураПараметров.Вставить("АгентТелефон", киПолучитьПредставлениеКИ(Организация,Справочники.ВидыКонтактнойИнформации.ТелефонРабочий));         
	//
	//АгентЭлПочта = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
	//АгентЭлПочта1 = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний);
	//
	//Если ЗначениеЗаполнено(АгентЭлПочта) Тогда
	//	СтруктураПараметров.Вставить("АгентЭлПочта", АгентЭлПочта + ?(ЗначениеЗаполнено(АгентЭлПочта1), ", " + АгентЭлПочта1, ""));
	//Иначе
	//	СтруктураПараметров.Вставить("АгентЭлПочта", АгентЭлПочта1);
	//КонецЕсли;
	//Иванченко 20251222 --			
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Поле4 КАК Город,
	|	КонтактнаяИнформация.Поле5 КАК НаселённыйПункт
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Вид В(&Вид)
	|	И КонтактнаяИнформация.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект", ПодразделениеКомпании);
	ВидыАдресов = Новый Массив();
	ВидыАдресов.Добавить(Справочники.ВидыКонтактнойИнформации.АдресФактический);
	//ВидыАдресов.Добавить(Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
	Запрос.УстановитьПараметр("Вид", ВидыАдресов);
	Выборка = Запрос.Выполнить().Выбрать();  
	
	Если Выборка.Следующий() Тогда  
		
		Если ЗначениеЗаполнено(Выборка.Город) Тогда
			Город = "г. " + Лев(Выборка.Город, СтрДлина(Выборка.Город) - 2);
		ИначеЕсли ЗначениеЗаполнено(Выборка.НаселённыйПункт) Тогда
			Город = "п. " + Лев(Выборка.НаселённыйПункт, СтрДлина(Выборка.НаселённыйПункт) - 2);
		Иначе
			Город = "";
		КонецЕсли; 
		
		СтруктураПараметров.Вставить("Город", Город);
	КонецЕсли;
	
	//Иванченко 20260615 ++ 
	Если Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда  
		СтруктураПараметров.Вставить("П11точка7", ""); 
	Иначе	
		СтруктураПараметров.Вставить("П11точка7", "Принципал подтверждает, что не лишен и не ограничен в дееспособности, под опекой и попечительством, патронажем не состоит, не страдает заболеваниями, препятствующими осознать суть подписываемого договора и обстоятельств его заключения, а также отсутствуют обстоятельства, вынуждающие совершить сделку на крайне невыгодных для себя условиях." + Символы.ПС + " 11.7 ");
	КонецЕсли;
	//Иванченко 20260615 --  
	
	//Иванченко 20251222 ++	  
	// Холышевская ++ 18.03.2026
	Если Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
		СтруктураПараметров.Вставить("СтруктураПринципала", Контрагент.НаименованиеПолное + Символы.ПС + 
		"Адрес: " + спПолучитьПредставление(Контрагент, Новый Структура("АдресЮридический")) + Символы.ПС +
		"Паспорт: " + ПаспортСерия + " " + ПаспортНомер + Символы.ПС +
		"Выдан: " + ПаспортКемВыдан + Символы.ПС + 
		"Дата выдачи: " + ПаспортДатаВыдачи + Символы.ПС +
		"Код подразделения: " + ПаспортКодПодразделения);
	ИначеЕсли Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда
		СтруктураПараметров.Вставить("СтруктураПринципала", Контрагент.НаименованиеПолное + Символы.ПС + 
		"Адрес: " + спПолучитьПредставление(Контрагент, Новый Структура("АдресЮридический")) + Символы.ПС + 
		"ИНН: " + Контрагент.ИНН + Символы.ПС +
		"ОГРН: " + Контрагент.ОГРН + Символы.ПС +
		"р/с: " + Контрагент.ОсновнойБанковскийСчет.НомерСчета + Символы.ПС +
		"к/с: " + Контрагент.ОсновнойБанковскийСчет.Банк.КоррСчет + Символы.ПС +
		"БИК: " + Контрагент.ОсновнойБанковскийСчет.Банк.Код + Символы.ПС +
		"Телефон: " + киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий) + Символы.ПС +
		"Электронная почта: " + ?(ЗначениеЗаполнено(киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний)), 
													киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий) 
													+ ", " + киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний), 
													киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий)));
	// Овечкин ++ 19.03.2026
	ИначеЕсли Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
		СтруктураПараметров.Вставить("СтруктураПринципала", Контрагент.НаименованиеПолное + Символы.ПС + 
		"Адрес: " + спПолучитьПредставление(Контрагент, Новый Структура("АдресЮридический")) + Символы.ПС + 
		"ИНН: " + Контрагент.ИНН + Символы.ПС +
		"ОГРН: " + Контрагент.ОГРН + Символы.ПС +
		"р/с: " + Контрагент.ОсновнойБанковскийСчет.НомерСчета + Символы.ПС +
		"к/с: " + Контрагент.ОсновнойБанковскийСчет.Банк.КоррСчет + Символы.ПС +
		"БИК: " + Контрагент.ОсновнойБанковскийСчет.Банк.Код + Символы.ПС +
		"Телефон: " + киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий) + Символы.ПС +
		"Электронная почта: " + ?(ЗначениеЗаполнено(киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний)), 
													киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий) 
													+ ", " + киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний), 
													киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий)));
	// Овечкин -- 19.03.2026
		
	КонецЕсли;	 
	// Холышевская -- 18.03.2026
		СтруктураПараметров.Вставить("СтруктураАгента", Организация.НаименованиеПолное + Символы.ПС + 
		"Адрес: " + спПолучитьПредставление(Организация, Новый Структура("АдресЮридический")) + Символы.ПС + 
		// Овечкин ++ 04.06.2026
		"Фактический адрес: " + спПолучитьПредставление(ПодразделениеКомпании, Новый Структура("АдресФактический")) + Символы.ПС +
		// Овечкин -- 04.06.2026
		"ИНН: " + Организация.ИНН + Символы.ПС +
		"ОГРН: " + Организация.ОГРН + Символы.ПС +
		"р/с: " + Организация.ОсновнойБанковскийСчет.НомерСчета + Символы.ПС +
		"к/с: " + Организация.ОсновнойБанковскийСчет.Банк.КоррСчет + Символы.ПС +
		"БИК: " + Организация.ОсновнойБанковскийСчет.Банк.Код + Символы.ПС +
		"Телефон: " + киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий) + Символы.ПС +
		"Электронная почта: " + ?(ЗначениеЗаполнено(киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний)), киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий) + ", " + киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний), киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий))); 	
	
	//Иванченко 20251222 --	
	//Иванченко 20260803 ++	
	СтруктураПараметров.Вставить("ПринципалФИО", Контрагент.НаименованиеПолное);
	//Иванченко 20260803 --	
	Возврат СтруктураПараметров;
	
КонецФункции

Процедура ЗаполнитьСвойстваТабДока(ТабДокумент, ДвусторонняяПечать) Экспорт
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 10;
	ТабДокумент.ПолеСнизу  = 12;
	ТабДокумент.ПолеСправа = 5;   
	ТабДокумент.НижнийКолонтитул.ТекстСлева = "Принципал: _______________"; 
	ТабДокумент.НижнийКолонтитул.ТекстСправа = "Агент: _______________";
	ТабДокумент.НижнийКолонтитул.Выводить = Истина;		
	ТабДокумент.ДвусторонняяПечать = ДвусторонняяПечать;  
	ТабДокумент.АвтоМасштаб = Истина;	
	ТабДокумент.ОтображатьСетку = Ложь;
	ТабДокумент.ТолькоПросмотр = Истина;
КонецПроцедуры
//Иванченко 20251209 -- 

//Иванченко 20260210 ++
Функция ПолучитьПоступлениеКомиссия()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПоступлениеАвтомобилейАвтомобили.Ссылка КАК Ссылка,
	|	ПоступлениеАвтомобилейАвтомобили.Автомобиль КАК Автомобиль
	|ПОМЕСТИТЬ ВТ_Поступления
	|ИЗ
	|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
	|ГДЕ
	|	НЕ ПоступлениеАвтомобилейАвтомобили.Ссылка.ПометкаУдаления
	|	И ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен
	|	И ПоступлениеАвтомобилейАвтомобили.Ссылка.Организация = &Организация
	|	И ПоступлениеАвтомобилейАвтомобили.Ссылка.ПодразделениеКомпании = &ПодразделениеКомпании
	|	И ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент = &Контрагент
	|	И ПоступлениеАвтомобилейАвтомобили.Автомобиль = &Автомобиль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Поступления.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_Поступления КАК ВТ_Поступления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей.Остатки(, ) КАК ОстаткиАвтомобилейОстатки
	|		ПО ВТ_Поступления.Автомобиль = ОстаткиАвтомобилейОстатки.Автомобиль
	|ГДЕ
	|	ОстаткиАвтомобилейОстатки.КоличествоОстаток <> 0");
	Запрос.УстановитьПараметр("Организация", Организация);  
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);   
	Запрос.УстановитьПараметр("Автомобиль", Автомобили[0].Автомобиль);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		ПоступлениеКомиссия = NULL;				
	Иначе
		ПоступлениеКомиссия = Запрос.Выполнить().Выгрузить()[0];				
	КонецЕсли;
	
	Возврат ПоступлениеКомиссия;		
КонецФункции
//Иванченко 20260210 --

//Овечкин ++ 20260830
Функция ПоследнимВладельцемАвтоБылЮрик(Авто)
	
	ПоследнимВладельцемАвтоБылЮрик = Ложь;
	
  	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Автомобили.Период КАК Период,
		|	Автомобили.Автомобиль КАК Автомобиль,
		|	Автомобили.ВидЗначения КАК ВидЗначения,
		|	Автомобили.Значение КАК Значение,
		|	Автомобили.Значение.НашаФирма КАК ЗначениеНашаФирма,
		|	Автомобили.Значение.ФормаСобственности КАК ЗначениеФормаСобственности
		|ИЗ
		|	РегистрСведений.Автомобили КАК Автомобили
		|ГДЕ
		|	Автомобили.Автомобиль = &Автомобиль
		|	И Автомобили.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Хозяин)
		|	И НЕ Автомобили.Значение.НашаФирма
		|	И Автомобили.Значение.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЮридическоеЛицо)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Автомобиль",Авто);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПоследнимВладельцемАвтоБылЮрик = Истина;
		Прервать;
	КонецЦикла;
	
	Возврат ПоследнимВладельцемАвтоБылЮрик;
 
КонецФункции
//Овечкин -- 20260830

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
	Права = глПрава;
#КонецЕсли

//Бондаренко++ 20230202
ДеньСКоторогоНуженВидАвто='20230203'; 
//Бондаренко-- 20230202

//Иванченко 20260121 ++
ДеньЗет = '20251226';
//Иванченко 20260121 --
