Функция ПолучитьКоличествоКлиентов(СостояниеКлиента, сПараметров = Неопределено) Экспорт
	
	Наименование = "";
	Пользователь = "";
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Состояние", СостояниеКлиента);
	Если  сПараметров <> Неопределено Тогда
		Если сПараметров.Свойство ("ПоказыватьУдаленныеЗаписи") Тогда
			Запрос.УстановитьПараметр("ПометкаУдаления", сПараметров.ПоказыватьУдаленныеЗаписи); 
		КонецЕсли;
		Если сПараметров.Свойство ("Наименование") Тогда
			Наименование = " и Renault_КорпоративныеКлиенты.Наименование Подобно &Наименование";
			Запрос.УстановитьПараметр("Наименование","%"+ сПараметров.Наименование + "%");
		КонецЕсли;
		Если сПараметров.Свойство ("Пользователь") И Не сПараметров.ЭтоРКП Тогда
			Пользователь = " и Renault_КорпоративныеКлиенты.Менеджер = &Менеджер";
			Запрос.УстановитьПараметр("Менеджер", сПараметров.Пользователь);
		КонецЕсли;
	КонецЕсли;
	//Козлов Е.А. Начало 15.07.2016
	//Текст = "ВЫБРАТЬ
	//	|	КОЛИЧЕСТВО(Renault_КорпоративныеКлиенты.Ссылка) КАК Количество
	//	|ИЗ
	//	|	Справочник.Renault_КорпоративныеКлиенты КАК Renault_КорпоративныеКлиенты
	//	|ГДЕ
	//	|	Renault_КорпоративныеКлиенты.Состояние = &Состояние
	//	|	"+Наименование+" "+Пользователь+"
	//	|{ГДЕ
	//	|	Renault_КорпоративныеКлиенты.ПометкаУдаления}";
		
	Текст = "ВЫБРАТЬ
	        |	КОЛИЧЕСТВО(Renault_КорпоративныеКлиенты.Ссылка) КАК Количество
	        |ИЗ
	        |	Справочник.Renault_КорпоративныеКлиенты КАК Renault_КорпоративныеКлиенты
	        |ГДЕ
	        |	Renault_КорпоративныеКлиенты.Состояние = &Состояние
	        |	И Renault_КорпоративныеКлиенты.Контрагент.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЮридическоеЛицо)
			|	"+Наименование+" "+Пользователь+"
			|{ГДЕ
	        |	Renault_КорпоративныеКлиенты.ПометкаУдаления}";
	//Козлов Е.А. Конец	
	Запрос.Текст = Текст;
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Количество;
	
КонецФункции