
Перем Права Экспорт;	// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
	//Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СферыДеятельностиСтрокой = "";
	Для Каждого СтрокаТаблицы Из СферыДеятельности Цикл
		Если СферыДеятельностиСтрокой = "" Тогда
			СферыДеятельностиСтрокой = Строка(СтрокаТаблицы.СфераДеятельности);
		Иначе
			СферыДеятельностиСтрокой = СферыДеятельностиСтрокой + ";" +
				Строка(СтрокаТаблицы.СфераДеятельности)
		КонецЕсли;
	КонецЦикла;
	
	АвтопаркСтрокой = "";
	КоличествоАвтопарка = 0;
	Для Каждого СтрокаТаблицы Из Автопарк Цикл
		КоличествоАвтопарка = КоличествоАвтопарка + СтрокаТаблицы.Количество;
	КонецЦикла;
	АвтопаркСтрокой = Формат(КоличествоАвтопарка, "ЧГ=");
	
	ДополнительныеСвойства.Вставить("Состояние", Ссылка.Состояние);
	
	ОбработатьКомплексноСтроку(Наименование);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Состояние = Перечисления.Renault_СостоянияСогласованияКлиента.НаСогласовании И ОбменДанными.Загрузка = Ложь Тогда
		ПроверитьДанныеДляСогласования(Отказ, Контрагент);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Состояние = перечисления.Renault_СостоянияСогласованияКлиента.НаСогласовании
		И (Не ЗначениеЗаполнено(ДополнительныеСвойства.Состояние)
			Или ДополнительныеСвойства.Состояние = Перечисления.Renault_СостоянияСогласованияКлиента.Черновик) Тогда
			
		РегистрыСведений.Renault_СписокКорпКлиентовДляОтправки.ДобавитьКлиента(Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьДанныеДляСогласования(Отказ, ПроверяемыйКонтрагент) Экспорт
	
	#Если Клиент Тогда
		
		НезаполненыеДанныеДляСогласнования = НезаполненныеДанныеДляСогласования(ПроверяемыйКонтрагент);
		
		КолСтрок = НезаполненыеДанныеДляСогласнования.Количество();
		
		Если КолСтрок <> 0 Тогда
			
			ТекстСообщения = "Для согласования клиента необходимо устранить замечания:" + Символы.ПС;
			
			Счетчик = 1;
			Для Каждого Строка Из НезаполненыеДанныеДляСогласнования Цикл
				Если Счетчик = КолСтрок Тогда
					ТекстСообщения = ТекстСообщения + Строка;
				Иначе
					ТекстСообщения = ТекстСообщения + Строка + Символы.ПС;
				КонецЕсли;
				
				Счетчик = Счетчик + 1;
			КонецЦикла;
			
			Сообщить(ТекстСообщения, СтатусСообщения.Важное);
			Отказ = Истина;
			
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

Функция НезаполненныеДанныеДляСогласования(ПроверяемыйКонтрагент)
	
	НезаполненныеДанные = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_КорпоративныеКлиентыСферыДеятельности.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Справочник.Renault_КорпоративныеКлиенты.СферыДеятельности КАК Renault_КорпоративныеКлиентыСферыДеятельности
		|ГДЕ
		|	Renault_КорпоративныеКлиентыСферыДеятельности.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК Телефон
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &ПроверяемыйКонтрагент
		|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК ЭлПочта
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &ПроверяемыйКонтрагент
		|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Renault_КорпоративныеКлиентыАвтопарк.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Справочник.Renault_КорпоративныеКлиенты.Автопарк КАК Renault_КорпоративныеКлиентыАвтопарк
		|ГДЕ
		|	Renault_КорпоративныеКлиентыАвтопарк.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ВедушийКонтрагент = &ПроверяемыйКонтрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК АдресФактический
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &ПроверяемыйКонтрагент
		|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресФактический)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК АдресЮридический
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &ПроверяемыйКонтрагент
		|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЮридический)";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ПроверяемыйКонтрагент", ПроверяемыйКонтрагент);
	
	Результат = Запрос.ВыполнитьПакет();
	
	//Проверка заполнения сфер деятельнсоти
	Если Результат[0].Пустой() Тогда
		НезаполненныеДанные.Добавить("Не указана сфера деятельности.");
	КонецЕсли;
	
	//Проверка заполнения телефона
	Если Результат[1].Пустой() Тогда
		НезаполненныеДанные.Добавить("Не указан номер телефона.");
	КонецЕсли;
	
	//Проверка заполнения адреса эл. почты
	Если Результат[2].Пустой() Тогда
		
		НезаполненныеДанные.Добавить("Не указан адрес электронной почты.");
		
	Иначе
		
		Выборка = Результат[2].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ЭлПочта = Выборка.ЭлПочта;
			Если НЕ АдресЭлПочтыУказанВерно(ЭлПочта) Тогда
				НезаполненныеДанные.Добавить("Указан не корректный адрес эл. почты - " + ЭлПочта + ".");
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	//Проверка заполнения "Автопарка"
	Если Результат[3].Пустой() Тогда
		НезаполненныеДанные.Добавить("Не выбрана ни одна модель в таб. части ""Автопарк""!");
	КонецЕсли;
	
	//Проверка заполнения контактных лиц
	Если Результат[4].Пустой() Тогда
		НезаполненныеДанные.Добавить("Не указано ни одно контактное лицо.");
	КонецЕсли;
	
	//pu0XXXX+ 20171116. Проверяем на наличие хотя бы одной должности из контактных лиц
	//Проверка заполнения должности контактных лиц
	НаличиеДолжности = Ложь;
	
	Для Каждого Стр ИЗ Результат[4].Выгрузить() Цикл
		Если ЗначениеЗаполнено(Стр.Ссылка.Должность) Тогда
			НаличиеДолжности = Истина;
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	
	Если Не НаличиеДолжности Тогда 
		НезаполненныеДанные.Добавить("Не указана должность ни у одного из контактных лиц.");
	КонецЕсли; 
	//pu0XXXX-
	
	//Проверка заполнения фактического адреса
	Если Результат[5].Пустой() Тогда
		НезаполненныеДанные.Добавить("Не указан фактический адрес.");
	КонецЕсли;
	
	//Проверка заполнения юридического адреса
	Если Результат[6].Пустой() Тогда
		НезаполненныеДанные.Добавить("Не указан юридический адрес.");
	КонецЕсли;
	
	Возврат НезаполненныеДанные;
	
КонецФункции

Функция АдресЭлПочтыУказанВерно(ЭлПочта)
	
	Шаблон = ".+@.+\..+"; 
	
	RegExp = Новый COMОбъект("VBScript.RegExp");
	RegExp.MultiLine = Ложь;
	RegExp.Global = Истина;
	RegExp.IgnoreCase = Истина;
	RegExp.Pattern = Шаблон;
	
	Если RegExp.Test(ЭлПочта) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура ОбработатьКомплексноСтроку(Строка) Экспорт
	
	Если НЕ ЭтаСтрокаОбработана(Строка) Тогда
		УдалитьЛишнииЗнакиВСтроке(Строка);
		УстановитьЗаглавныеБуквыДляСтроки(Строка);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьЗаглавныеБуквыДляСтроки(Строка)
	
	Строка = СокрЛП(Строка);
	Строка = ВРег(Строка);
	
КонецПроцедуры

Процедура УдалитьАбривиатурыВСтроке(Строка)
	
	СтрокаСравнения = "ЙЦУКЕНГШЩЗХЪФЫВАПРОЛДЖЭЯЧСМИТЬБЮЁ";
	УдаляемыеСлова = Новый Массив;
	
	ДлинаСтроки = СтрДлина(Строка);
	
	ДобавитьВМассив = Ложь;
	УдаляемаяСтрока = "";
	ДлинаУдаляемойСтроки = 0;
	Для НомерСимвола = 1 По ДлинаСтроки Цикл
		
		Символ = Сред(Строка, НомерСимвола, 1);
		Если СтрЧислоВхождений(СтрокаСравнения, Символ) <> 0 Тогда
			УдаляемаяСтрока = УдаляемаяСтрока + Символ;
			ДлинаУдаляемойСтроки = СтрДлина(УдаляемаяСтрока);
			
			ДобавитьВМассив = Истина;
			
			Если НомерСимвола = ДлинаСтроки И ДлинаУдаляемойСтроки > 1 Тогда
				УдаляемыеСлова.Добавить(УдаляемаяСтрока);
			КонецЕсли;
			
		Иначе
			Если ДобавитьВМассив И Символ = " " И ДлинаУдаляемойСтроки > 1 Тогда
				УдаляемаяСтрока = УдаляемаяСтрока + Символ;
				
				УдаляемыеСлова.Добавить(УдаляемаяСтрока);
			КонецЕсли;
			
			ДобавитьВМассив = Ложь;
			ДлинаУдаляемойСтроки = 0;
			УдаляемаяСтрока = "";
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Слово Из УдаляемыеСлова Цикл
		Строка = СтрЗаменить(Строка, Слово, "");
	КонецЦикла;
	
	Строка = СокрЛП(Строка);
	
КонецПроцедуры

Процедура УдалитьЛишнииЗнакиВСтроке(Строка)
	
	СтрокаСравнения = "~`!@#$%^&*()_+""№;:?-=<>{}'\|/,.[]«»";
	СтрокаДляОбработки = Строка;
	ДлинаСтроки = СтрДлина(Строка);
	
	Для НомерСимвола = 1 По ДлинаСтроки Цикл
		Символ = Сред(Строка, НомерСимвола, 1);
		Если СтрЧислоВхождений(СтрокаСравнения, Символ) <> 0 Тогда
			СтрокаДляОбработки = СтрЗаменить(СтрокаДляОбработки, Символ, "");
		КонецЕсли;
	КонецЦикла;
	
	Строка = СокрЛП(СтрокаДляОбработки);
	
КонецПроцедуры

Функция ЭтаСтрокаОбработана(Строка)
	
	СтрокаСравнения = " 1234567890ЁЙЦУКЕНГШЩЗХЪФЫВАПРОЛДЖЭЯЧСМИТЬБЮQWERTYUIOPASDFGHJKLZXCVBNM";
	ДлинаСтроки = СтрДлина(Строка);
	Результат = Истина;
	
	Для НомерСимвола = 1 По ДлинаСтроки Цикл
		Символ = Сред(Строка, НомерСимвола, 1);
		Если СтрЧислоВхождений(СтрокаСравнения, Символ) = 0 Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура СогласиеНаОбработкуПерсональныхДанныхПечать(КонтактноеЛицо, ПечататьВсегда = Ложь) Экспорт
	
	Если Не ПечататьВсегда
		И ПерсДанные <> Истина Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("СогласиеНаОбработкуПерсональныхДанных");
	
	СтруктураПредставления = Новый Структура(
		"ИНН,КПП,АдресЮридический,ТелефонРабочий",
		"ИНН ","КПП ","Адрес: ","тел.: "
	);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	Если КонтактноеЛицо <> Неопределено Тогда
		
		ОбластьМакета.Параметры.ДоверенноеЛицоФИО	= КонтактноеЛицо.Наименование;
		ОбластьМакета.Параметры.Должность			= КонтактноеЛицо.Должность;
		
		Почта = киПолучитьПредставлениеКИ(КонтактноеЛицо, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
		Если Почта = "" Тогда
			Почта = киПолучитьПредставлениеКИ(КонтактноеЛицо, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний);
		Иначе
			Почта = Почта + ", " + киПолучитьПредставлениеКИ(КонтактноеЛицо, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний);
		КонецЕсли;
		ОбластьМакета.Параметры.КонтактПочта		= Почта;
		
		Телефон = киПолучитьПредставлениеКИ(КонтактноеЛицо, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
		Если Телефон = "" Тогда
			Телефон = киПолучитьПредставлениеКИ(КонтактноеЛицо, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
		Иначе
			Телефон = Телефон + ", " + киПолучитьПредставлениеКИ(КонтактноеЛицо, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
		КонецЕсли;
		ОбластьМакета.Параметры.КонтактТелефон		= Телефон;
		
	КонецЕсли;
	//ОбластьМакета.Параметры.КонтрагентНаименование	= Наименование;
	//ОбластьМакета.Параметры.КонтрагентАдрес			= киПолучитьПредставлениеКИ(Ссылка,Справочники.ВидыКонтактнойИнформации.АдресФактический);
	//ОбластьМакета.Параметры.КонтрагентДокумент		= спПолучитьПодтверждающийДокументОбъектаПоВиду(Ссылка,Перечисления.ВидыДокументов.Паспорт);
	//ОбластьМакета.Параметры.ОрганизацияНаименование	= спПолучитьПредставление(ПараметрыСеанса.Организация,Новый Структура("Наименование",""));
	//ОбластьМакета.Параметры.ОрганизацияАдрес		= спПолучитьПредставление(ПараметрыСеанса.Организация,СтруктураПредставления);
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Согласие");
	Если ЗначениеЗаполнено(ДилерскийЦентр) Тогда
		ОбластьМакета.Параметры.НаименованиеДЦ = ДилерскийЦентр.НаименованиеДляПечати;
	КонецЕсли;
	Если РегистрацияНаКорпоративномПортале = Истина Тогда
		ОбластьМакета.Параметры.СогласиеНаПортал = "Х";
	КонецЕсли;
	Если РассылкаРекламныхМатериалов = Истина Тогда
		ОбластьМакета.Параметры.СогласиеНаРекламу = "Х";
	КонецЕсли;
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	Если ЗначениеЗаполнено(ДилерскийЦентр) Тогда
		ОбластьМакета.Параметры.НаименованиеДЦ = ДилерскийЦентр.НаименованиеДляПечати;
	КонецЕсли;
	//ОбластьМакета.Параметры.КонтрагентНаименование	= Наименование;
	//ОбластьМакета.Параметры.СогласиеДата			= Формат(СогласиеНаОбработкуПерсональныхДанныхДата,"ДФ=dd.MM.yyyy");
	ТабДокумент.Вывести(ОбластьМакета);
	
	// Отобразить печатный документ на экране
	КлючУникальности	= Новый УникальныйИдентификатор();
	ФормаПечати			= ПолучитьОбщуюФорму("ПечатнаяФормаДокументов", , КлючУникальности);
	ТабличныйДокумент	= ФормаПечати.ЭлементыФормы.ТабличныйДокумент;
	ТабличныйДокумент.Защита			= обПраво("ЗащитаПечатныхФорм", Права);
	ТабличныйДокумент.ТолькоПросмотр	= обПраво("ОткрытиеПечатныхФормДокументовВРежимеПросмотра", Права);
	ТабДокумент.АвтоМасштаб = Истина;
	// Выведем печатную форму	
	ФормаПечати.ЭлементыФормы.ТабличныйДокумент.Вывести(ТабДокумент);
	// Заполним необходимые переменные и откроем форму
	ФормаПечати.Объект						= ЭтотОбъект;
	ФормаПечати.ОбъектПредставление			= Строка(ЭтотОбъект);
	ФормаПечати.ДополнительноКПредставлению	= "Согласие на обработку персональных данных";
	ФормаПечати.Открыть();
	
КонецПроцедуры // СогласиеНаОбработкуПерсональныхДанныхПечать()


// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли

