
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Вариант") Тогда 
		Вариант = Параметры.Вариант;
	КонецЕсли;
	
	Если Параметры.Свойство("Адрес") Тогда 
		Адрес = Параметры.Адрес;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаАдресВерный(Команда)
	
	Закрыть("Адрес верный");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВернутьсяКРедактированию(Команда)
	
	Закрыть("Возврат к редактированию");

КонецПроцедуры

&НаКлиенте
Процедура КомандаНеВноситьАдрес(Команда)
	
	Закрыть("Не вносить адрес");

КонецПроцедуры

&НаКлиенте
Процедура КомандаПовторитьПроверку(Команда)
	
	РезультатПроверки = ПолучитьРезультатПроверки();
	
	Если РезультатПроверки <> Неопределено Тогда 
		
		Вариант = РезультатПроверки;
		
		ОбновитьВидимостьЭлементов();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьРезультатПроверки()
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	РезультатПроверки = ОбъектОбработки.ПроверитьАдрес(Адрес);

	Возврат РезультатПроверки;
	
КонецФункции

Процедура ОбновитьВидимостьЭлементов()
	
	Элементы.КомандаАдресВерный.Видимость 			   = Вариант = 3;
	Элементы.КомандаНеВноситьАдрес.Видимость 		   = Вариант = 2 ИЛИ Вариант = 2;
	Элементы.КомандаПовторитьПроверку.Видимость		   = Вариант = 3;
	Элементы.КомандаВернутьсяКРедактированию.Видимость = Вариант = 3 ИЛИ Вариант = 2;
	
	Если Вариант = 2 Тогда
		Элементы.ОтветПользователю.Заголовок = "Адрес неверный!";
		Элементы.Описание.Заголовок = "Этот почтовый ящик не зарегистрирован или введен с ошибками. " 
		+ "Для возврата к редактированию адреса нажмите ""ВЕРНУТЬСЯ К РЕДАКТИРОВАНИЮ"". Для отказа ввода адреса нажмите ""НЕ ВНОСИТЬ АДРЕС""";
	ИначеЕсли Вариант = 3 Тогда
		Элементы.ОтветПользователю.Заголовок = "Достоверность адреса не удалось проверить!";
		Элементы.Описание.Заголовок = "Если вы уверены, что адрес введен верно, нажмите ""АДРЕС ВЕРНЫЙ"". " 
		+ "Для возврата к редактированию адреса нажмите ""ВЕРНУТЬСЯ К РЕДАКТИРОВАНИЮ"". Для повтора проверки нажмите ""ПОВТОРИТЬ ПРОВЕРКУ""";
    КонецЕсли;

КонецПроцедуры

