Функция СоздатьЭлементыПоСписку(СписокЭлементов) Экспорт
	
	//По началу все нормально
	Результат = истина;
	
	Для каждого СтруктураЭлемента из СписокЭлементов Цикл
		
		ExpenceCode = СтруктураЭлемента["ExpenceCode"];
		
		//Ищем элемент
		ТекЭлемент = НайтиПоКоду(ExpenceCode);
		Если НЕ ТекЭлемент = ПустаяСсылка() тогда 
			
			Элемент = ТекЭлемент.ПолучитьОбъект();
			
		Иначе //Новые коды автоматически не создаем
			
			Продолжить;
			
		КонецЕсли;
		
			ЗаполнитьЗначенияСвойств(Элемент, СтруктураЭлемента);
		
		Попытка
			
			//Если элемент записываем, значит он активен.
			Элемент.Активен = Истина;
			
			Элемент.Записать();
			
			//Если есть хоть одна ошибка, в истину результат уже не выставляем
			Результат = ?(Результат, истина, ложь);
		
		Исключение
			
			Результат = Ложь;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОписаниеТипов() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("СправочникСсылка.EDR_ВидыРасходов"));
	Массив.Добавить(Тип("Строка"));
	
	СтрокаНаименования = Новый КвалификаторыСтроки(50);
	
	ОписаниеТипа = Новый ОписаниеТипов(массив, , СтрокаНаименования);
	
	Возврат ОписаниеТипа;

	
КонецФункции

Процедура ЗагрузитьИзМакета() Экспорт
	
	ФайлИсточник = ПолучитьМакет("НастройкиКодовСтатьиРасходов");
	
	ВремФайл = ПолучитьИмяВременногоФайла("txt");
	ФайлИсточник.Записать(ВремФайл);
	
	ФайлИсточник = Неопределено;
	
	ОбработкаЗагрузки = Обработки.EDR_ЧтениеDIFF.Создать();
	ОбработкаЗагрузки.ПутьКФайлу = ВремФайл;
	ОбработкаЗагрузки.ПрочитатьФайлы();
	
	ОбработкаЗагрузки = Неопределено;
	
	УдалитьФайлы(ВремФайл);
	
	#Если наКлиенте тогда
	Предупреждение("Заполнение завершено.");
	#КонецЕсли
	
	
КонецПроцедуры
