
Функция Договор(ДокументОбъект, ТабДокумент, ИмяМакета)
	// Получаем макет документа
	Макет = ПолучитьМакет(ИмяМакета);
	
	// Получаем данные области	
	Макет.Параметры.Дата = Формат(ТекущаяДата(), "ДЛФ=Д");
	Макет.Параметры.НомерЗН = ДокументОбъект.Номер;
	Макет.Параметры.ВИН = ДокументОбъект.Автомобиль.VIN;
	Макет.Параметры.ГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ДокументОбъект.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер, ДокументОбъект.ДатаСоздания);
	
	//Область.Параметры.Пробег = ДокументОбъект.Пробег;
	//Область.Параметры.Собственник = ДокументОбъект.Владелец;
	//Область.Параметры.Адрес = киПолучитьПредставлениеКИ(ДокументОбъект.Владелец, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	//Область.Параметры.Заказчик = ДокументОбъект.Заказчик;
	//Область.Параметры.Телефон = киПолучитьПредставлениеКИ(ДокументОбъект.Заказчик, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
	//Область.Параметры.Машина = ДокументОбъект.Автомобиль.Модель;
	
	ТабДокумент.Вывести(Макет);	
	ТабДокумент.АвтоМасштаб = Истина;
	Возврат ТабДокумент;	
КонецФункции

Функция Печать(ДокументОбъект, ТабДокумент) Экспорт
	СписокМакетов = Новый СписокЗначений();
	МетаданныеОбработки = ЭтотОбъект.Метаданные();
	Для Каждого Макет Из МетаданныеОбработки.Макеты Цикл
		Если Найти(ДокументОбъект.Автомобиль.Модель,"Elantra")>0 Тогда
			Если Найти(Макет.Имя,"Elantra")>0 Тогда
				СписокМакетов.Добавить(Макет.Имя);			
			КонецЕсли;  
		ИначеЕсли Найти(ДокументОбъект.Автомобиль.Модель,"Equus")>0 Тогда
			Если Найти(Макет.Имя,"Equus")>0 Тогда
				СписокМакетов.Добавить(Макет.Имя);			
			КонецЕсли;
		ИначеЕсли Найти(ДокументОбъект.Автомобиль.Модель,"Genesis")>0 И Найти(ДокументОбъект.Автомобиль.Модель,"Coupe")>0 Тогда
			Если Найти(Макет.Имя,"GenesisCoupe")>0 Тогда
				СписокМакетов.Добавить(Макет.Имя);			
			КонецЕсли;
		ИначеЕсли Найти(ДокументОбъект.Автомобиль.Модель,"Genesis")>0 И Найти(ДокументОбъект.Автомобиль.Модель,"New")>0 Тогда
			Если Найти(Макет.Имя,"GenesisNew")>0 Тогда
				СписокМакетов.Добавить(Макет.Имя);			
			КонецЕсли;
		ИначеЕсли Найти(ДокументОбъект.Автомобиль.Модель,"Grand")>0 И Найти(ДокументОбъект.Автомобиль.Модель,"Santa")>0 И Найти(ДокументОбъект.Автомобиль.Модель,"Fe")>0 Тогда
			Если Найти(Макет.Имя,"GrandSantaFe")>0 Тогда
				СписокМакетов.Добавить(Макет.Имя);			
			КонецЕсли;	
		ИначеЕсли Найти(ДокументОбъект.Автомобиль.Модель,"Grandeur")>0 Тогда
			Если Найти(Макет.Имя,"GrandeurHG")>0 Тогда
				СписокМакетов.Добавить(Макет.Имя);			
			КонецЕсли;		
		ИначеЕсли Найти(ДокументОбъект.Автомобиль.Модель,"H1")>0 Тогда
			Если Найти(Макет.Имя,"H1")>0 Тогда
				СписокМакетов.Добавить(Макет.Имя);			
			КонецЕсли;
		ИначеЕсли Найти(ДокументОбъект.Автомобиль.Модель,"i30")>0 Тогда
			Если Найти(Макет.Имя,"i30")>0 Тогда
				СписокМакетов.Добавить(Макет.Имя);			
			КонецЕсли;
		ИначеЕсли Найти(ДокументОбъект.Автомобиль.Модель,"i40")>0 Тогда	
			Если Найти(Макет.Имя,"i40")>0 Тогда
				СписокМакетов.Добавить(Макет.Имя);			
			КонецЕсли;
		ИначеЕсли Найти(ДокументОбъект.Автомобиль.Модель,"ix35")>0 Тогда	
			Если Найти(Макет.Имя,"ix35")>0 Тогда
				СписокМакетов.Добавить(Макет.Имя);			
			КонецЕсли;
		ИначеЕсли Найти(ДокументОбъект.Автомобиль.Модель,"Santa")>0 И (Найти(ДокументОбъект.Автомобиль.Модель,"Fe")>0) И (Найти(ДокументОбъект.Автомобиль.Модель,"DM")>0) Тогда	
			Если Найти(Макет.Имя,"SantaFeDM")>0 Тогда
				СписокМакетов.Добавить(Макет.Имя);			
			КонецЕсли;
		ИначеЕсли Найти(ДокументОбъект.Автомобиль.Модель,"Santa")>0 И (Найти(ДокументОбъект.Автомобиль.Модель,"Fe")>0) И (Найти(ДокументОбъект.Автомобиль.Модель,"DM")>0) Тогда	
			Если Найти(Макет.Имя,"SantaFeDM")>0 Тогда
				СписокМакетов.Добавить(Макет.Имя);			
			КонецЕсли;
		ИначеЕсли Найти(ДокументОбъект.Автомобиль.Модель,"Solaris")>0 Тогда	
			Если Найти(Макет.Имя,"Solaris")>0 Тогда
				СписокМакетов.Добавить(Макет.Имя);			
			КонецЕсли;
		ИначеЕсли Найти(ДокументОбъект.Автомобиль.Модель,"Veloster")>0 Тогда	
			Если Найти(Макет.Имя,"Veloster")>0 Тогда
				СписокМакетов.Добавить(Макет.Имя);			
			КонецЕсли;
   	 	КонецЕсли;  
 	КонецЦикла;
 	
	ВыбранныйЭлемент = СписокМакетов.ВыбратьЭлемент("Выбор карты ТО");
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат Договор(ДокументОбъект, ТабДокумент, ВыбранныйЭлемент.Значение);
	КонецЕсли;
КонецФункции
