//////////////////////////////////////////////////////////////
// СОБЫТИЯ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.АдресСервера = ЛицензированиеСервер.АдресСервераЛицензирования();
	Объект.КодДоступаКлючаЗащиты = ЛицензированиеСервер.КодДоступаКлючаЗащиты();
	
	// проверка доступности локальной системы лицензирования
	Результат = ЛицензированиеСервер.ЛокальнаяСистемаЛицензированияДоступна(ОписаниеОшибки);
	Если Результат = Неопределено Тогда
		Сообщить(ОписаниеОшибки);
		// И считаем, что недоступна
		ЛокальнаяСистемаЛицензированияДоступна = Ложь;
	Иначе
		ЛокальнаяСистемаЛицензированияДоступна = Результат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.АдресСервера) ИЛИ ВРег(Объект.АдресСервера) = "*LOCAL" Тогда
		Объект.РежимСтарта = 0;
	ИначеЕсли ВРег(Объект.АдресСервера) = "*AUTO" Тогда
		Объект.РежимСтарта = 1;
		Элементы.КодДоступаКлючаЗащиты.Доступность = Ложь;
		Объект.КодДоступаКлючаЗащиты = "";
	Иначе
		Объект.РежимСтарта = 2;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СисИнфо = Новый СистемнаяИнформация;
	ЭтоWindows = СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86 ИЛИ СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86_64;

	Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
	Если ЭтоWindows Тогда
		ПереходКСтранице(Элементы.СтраницаВыборРежима);
		Элементы.СтраницаУказатьАдрес.ПодчиненныеЭлементы.КодДоступаКлючаЗащитыСтраницаАдреса.Видимость = Ложь;
	Иначе
		ПереходКСтранице(Элементы.СтраницаУказатьАдрес);
		Элементы.СтраницаУказатьАдрес.ПодчиненныеЭлементы.КодДоступаКлючаЗащитыСтраницаАдреса.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры


/////////////////////////////////////////////////////////////
// КОМАНДЫ ФОРМЫ

&НаКлиенте
Процедура КомандаВперед(Команда)
	ОбработкаДействия("Вперед");
КонецПроцедуры

&НаКлиенте
Процедура КомандаНазад(Команда)
	ОбработкаДействия("Назад");
КонецПроцедуры

&НаКлиенте
Процедура КомандаНайтиСервера(Команда)
	СписокСерверов = ЛицензированиеСервер.ПолучитьСписокСерверов(ОписаниеОшибки);
	ВыбранныйЭлемент = СписокСерверов.ВыбратьЭлемент();
	Объект.АдресСервера = ?(ВыбранныйЭлемент = Неопределено, Объект.АдресСервера, ВыбранныйЭлемент.Значение);
КонецПроцедуры

// Обработка действия пользователя
&НаКлиенте
Процедура ОбработкаДействия(Действие)
	Страницы = Элементы.ГруппаСтраницы.ПодчиненныеЭлементы;
	ТекущаяСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница;
	
	Если ТекущаяСтраница = Страницы.СтраницаВыборРежима Тогда
		Если Объект.РежимСтарта = 0 Тогда //LOCAL
			
			Если НЕ ЛокальнаяСистемаЛицензированияДоступна Тогда
				Предупреждение("Недоступен сервер лицензирования на локальном компьютере!
				|Необходимо запустить или выполнить установку сервера лицензирования.");
				Возврат;
			КонецЕсли;	
			Элементы.ДекорацияИзменениеСервера.Заголовок = "Будет выполнено подключение к локальному серверу лицензирования."; 
			Объект.АдресСервера = "*LOCAL";											   
			ПереходКСтранице(Элементы.СтраницаПредупреждение);											   
		
		ИначеЕсли Объект.РежимСтарта = 1 Тогда //AUTO
		
			Элементы.ДекорацияИзменениеСервера.Заголовок = "Будет выполнен поиск сервера лицензирования в сети и подключение к найденному серверу";
			Объект.АдресСервера = "*AUTO";                                               
			ПереходКСтранице(Элементы.СтраницаПредупреждение);												
		
		ИначеЕсли Объект.РежимСтарта = 2 Тогда //Адрес
			
			Объект.АдресСервера = АдресСервераИзПараметраСеанса(); //Текущий сервер лицензирования
			ПереходКСтранице(Страницы.СтраницаУказатьАдрес);
			
		КонецЕсли;
			
	ИначеЕсли ТекущаяСтраница = Страницы.СтраницаУказатьАдрес Тогда
		Если Действие = "Вперед" Тогда
			Если ПустаяСтрока(Объект.АдресСервера) Тогда
				Сообщить("Укажите адрес сервера лицензирования");
				Возврат;
			КонецЕсли;
			
			Элементы.ДекорацияИзменениеСервера.Заголовок = "Будет выполнено подключение к серверу лицензирования """ + Объект.АдресСервера + """ ";
															
			ПереходКСтранице(Элементы.СтраницаПредупреждение);												
															
		Иначе //Назад
			ПереходКСтранице(Страницы.СтраницаВыборРежима);
		КонецЕсли;
	ИначеЕсли ТекущаяСтраница = Страницы.СтраницаПредупреждение Тогда
		
		Если Действие = "Вперед" Тогда
			ЛицензированиеСервер.УстановитьАдресСервераЛицензирования(Объект.АдресСервера);
			ЛицензированиеСервер.УстановитьКодДоступаКлючаЗащиты(Объект.КодДоступаКлючаЗащиты);
			Оповестить("СерверЛицензирования",Объект.АдресСервера);
			Закрыть("");
		Иначе
			Если Объект.РежимСтарта = 2 Тогда
				ПереходКСтранице(Страницы.СтраницаУказатьАдрес);
			Иначе
				ПереходКСтранице(Страницы.СтраницаВыборРежима);
			КонецЕсли;
		КонецЕсли;
	Иначе
	КонецЕсли;
		
КонецПроцедуры

// Переход к странице формы
// Параметры
//   Страница - ГруппаФормы - страница, на которую будет осуществлён переход
&НаКлиенте
Процедура ПереходКСтранице(Страница)
	Для Каждого ТекСтраница Из Элементы.ГруппаСтраницы.ПодчиненныеЭлементы Цикл
		ТекСтраница.Видимость = Ложь;
	КонецЦикла;
	Страница.Видимость = Истина;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Страница;
	
	ТекущаяСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница;
	Если  ТекущаяСтраница = Элементы.СтраницаВыборРежима Тогда
		Элементы.ФормаКомандаНазад.Доступность = Ложь;
	Иначе
		Элементы.ФормаКомандаНазад.Доступность = Истина;
	КонецЕсли;
	
	Если ТекущаяСтраница = Элементы.СтраницаУказатьАдрес И НЕ ЭтоWindows Тогда
		Элементы.ФормаКомандаНазад.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АдресСервераНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    СписокСерверов = СписокСерверов(ОписаниеОшибки);
	
	ВыбранныйЭлемент = СписокСерверов.ВыбратьЭлемент("Выберите сервер лицензирования");
	Объект.АдресСервера = ?(ВыбранныйЭлемент = Неопределено, Объект.АдресСервера, ВыбранныйЭлемент.Значение);
КонецПроцедуры

//Возвращает список серверов лицензирования, найденных в локальной сети  
&НаСервереБезКонтекста
Функция СписокСерверов(ОписаниеОшибки)
	Возврат ЛицензированиеСервер.ПолучитьСписокСерверов("", ОписаниеОшибки);
КонецФункции

&НаСервереБезКонтекста
Функция АдресСервераИзПараметраСеанса()
	Возврат ПараметрыСеанса.АдресСервераЛицензирования;
КонецФункции

&НаКлиенте
Процедура РежимСтартаПриИзменении(Элемент)
	Если Объект.РежимСтарта = 1 Тогда
		Объект.КодДоступаКлючаЗащиты = "";
		Элементы.КодДоступаКлючаЗащиты.Доступность = Ложь;
	Иначе
		Элементы.КодДоступаКлючаЗащиты.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры
