
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Перем ТабДок;
	ПечатьГарантийногоТалона(ТабДок, ПараметрКоманды);
	Если ТипЗнч(ТабДок) = Тип("ДвоичныеДанные") Тогда
		ИмяФайлаPDF = ПолучитьИмяВременногоФайла("pdf");
		ТабДок.Записать(ИмяФайлаPDF);
		ЗапуститьПриложение(ИмяФайлаPDF,,Истина);
		УдалитьФайлы(ИмяФайлаPDF);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПечатьГарантийногоТалона(ТабДок, ПараметрКоманды)
	Задачи.DMS_ЗаявкаНаСогласование.ПечатьГарантийногоТалона(ТабДок, ПараметрКоманды);
КонецПроцедуры
