
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Бондаренко++ 20190411
	ёё = 0;
	
	Движения.ПартииТоваровДляУчета.Записывать = Истина;
	Движения.ПартииТоваровДляУчета.Очистить();
	
	Движения.ПартииТоваровКомпании.Записывать = Истина;
	Движения.ПартииТоваровКомпании.Очистить();

	Движения.КомплектацияАвтомобилей.Записывать = Истина;		
  	Движения.КомплектацияАвтомобилей.Очистить();
	
	Движения.СМГ_КомплектацияАвтомобилейАвтоработы.Записывать = Истина;		
	Движения.СМГ_КомплектацияАвтомобилейАвтоработы.Очистить();	
	
	//Бондаренко++ 202060320
	Движения.БонусныеБаллыДилера.Записывать = Истина;
	Движения.БонусныеБаллыДилера.Очистить();		
	 
	Если ФлагРегистрБонусныеБаллыДилера Тогда
		Для каждого ТекСтрока Из БонусныеБаллыДилера Цикл 
			
			Для Сч = 1 По 2 Цикл
				
				Если Сч = 1 Тогда
					Если ТекСтрока.Начислено > 0 Тогда
						Компенсация_ = ТекСтрока.Начислено;
						ВариантОстатков_ = Перечисления.НачисленоПодтверждено.Начислено; 
					Иначе	
					    Продолжить;
					КонецЕсли;
 				Иначе 
					Если ТекСтрока.Подтверждено > 0 Тогда
						Компенсация_ = ТекСтрока.Подтверждено;
						ВариантОстатков_ = Перечисления.НачисленоПодтверждено.Подтверждено; 
					Иначе	
					    Продолжить;
					КонецЕсли;
				КонецЕсли;
				
				Движение = Движения.БонусныеБаллыДилера.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата; 
				Движение.ПодразделениеКомпании = ТекСтрока.ПодразделениеКомпании;
				Движение.Организация = ТекСтрока.Организация;
				Движение.Автомобиль = ТекСтрока.Автомобиль;
				Движение.Марка = ТекСтрока.Автомобиль.Модель.Марка;
				Движение.Модель = ТекСтрока.Автомобиль.Модель;
				Движение.МаркетинговаяПрограмма = ТекСтрока.МаркетинговаяПрограмма;
				Движение.ДатаСписанияБонусов = "";
				
				//Бондаренко++ 20260417
				Движение.Компенсация = Компенсация_;
				Движение.ВариантОстатков = ВариантОстатков_;
				//Бондаренко++ 20260417

				Если ТекСтрока.ВариантКомпенсации = Перечисления.ВариантКомпенсации.ВИнвойсеСледующего Тогда
					Движение.ВариантКомпенсации = Перечисления.ВариантКомпенсации.ВИнвойсеСледующего;
				ИначеЕсли ТекСтрока.ВариантКомпенсации = Перечисления.ВариантКомпенсации.Ретроспективная Тогда	
					Движение.ВариантКомпенсации = Перечисления.ВариантКомпенсации.Ретроспективная;
				Иначе
					Движение.ВариантКомпенсации = Перечисления.ВариантКомпенсации.ПустаяСсылка();
				КонецЕсли;
 				
				Движение.ХозОперация = Справочники.ХозОперации.БонусныеБаллыДилераПриход;
				Если ТекСтрока.РабочийЛист.РеализацияАвтомобиля.Автомобили.Количество() > 0 Тогда
					Движение.ФактическаяЦенаПродажиАвто = ТекСтрока.РабочийЛист.РеализацияАвтомобиля.Автомобили[0].СуммаВсего;
				КонецЕсли;
				Движение.КонтрагентПокупатель = ТекСтрока.РабочийЛист.РеализацияАвтомобиля.Контрагент;
				Движение.ДатаПродажи = ТекСтрока.РабочийЛист.РеализацияАвтомобиля.Дата;
				//Бондаренко++ 20260331
				Движение.ДокументРеализации = ТекСтрока.РабочийЛист.ОтгрузкаАвтомобиля;
				//Бондаренко-- 20260331
				Движение.ДатаРитейла = "";
				Движение.ДатаПодтверждения = "";
				Движение.ДатаПолучения = "";
				
				//Бондаренко++ 20260401
				Движение.РабочийЛист = ТекСтрока.РабочийЛист.Ссылка;
				//Бондаренко-- 20260401
				
			КонецЦикла;
			
 		КонецЦикла;
	Иначе	
	//Бондаренко-- 202060320	
	
		ВсегоСтрокТЧ = Ссылка.ТЧ.Количество();
		
		Если ВсегоСтрокТЧ > 0 Тогда
			Если ФлагРегистрПартииДляУчета Тогда
				Для Каждого ТекСтрокаТЧ Из ТЧ Цикл
					ёё = ёё + 1;
					Движение = Движения.ПартииТоваровДляУчета.Добавить();
					Движение.ХозОперация = ХозОперация;
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = Дата;
					Движение.Номенклатура = ТекСтрокаТЧ.Номенклатура;
					Движение.Производитель = ТекСтрокаТЧ.Номенклатура.Производитель;
					Движение.Количество = ТекСтрокаТЧ.Количество;
					Движение.Сумма = ТекСтрокаТЧ.Сумма;
					Движение.Официально = ТекСтрокаТЧ.Официально;
					Движение.Партия = ТекСтрокаТЧ.Партия;
					Движение.ДилерскийЦентр = ТекСтрокаТЧ.Партия.ПодразделениеКомпании.ДилерскийЦентр;
 				КонецЦикла;
			Иначе
				Для Каждого ТекСтрокаТЧ Из ТЧ Цикл
					Движение = Движения.ПартииТоваровКомпании.Добавить();
					Попытка
						Движение.ХозОперация = ТекСтрокаТЧ.Партия.ХозОперация;
					Исключение
						Движение.ХозОперация = Справочники.ХозОперации.ВводОстатковТоваров;				
					КонецПопытки;
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
					Движение.СкладКомпании = ТекСтрокаТЧ.СкладКомпании;
					Движение.Номенклатура = ТекСтрокаТЧ.Номенклатура;
					Движение.Партия = ТекСтрокаТЧ.Партия;
					Движение.Количество = ТекСтрокаТЧ.Количество;
					Движение.Сумма = ТекСтрокаТЧ.Сумма;
					Движение.СуммаУпр =  ТекСтрокаТЧ.Сумма;
					Движение.СтатусПартии=ТекСтрокаТЧ.СтатусПартии;
					//Бондаренко++ 20260415
					Если ТекСтрокаТЧ.СуммаНДС = 0 Тогда
						Движение.СтавкаНДС=Справочники.СтавкиНДС.БезНДС;
 					Иначе
						Движение.СтавкаНДС=Справочники.СтавкиНДС.НДС22Процента;
					КонецЕсли;
  					Движение.СуммаНДС = ТекСтрокаТЧ.СуммаНДС;
					//Бондаренко-- 20260415
 				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		ВсегоСтрокСостав = Состав.Количество();
		Если ВсегоСтрокСостав > 0 Тогда  
			Для каждого ТекСтрока Из Состав Цикл
				Если ТекСтрока.ЭтоДеталь = 1 Тогда
					Движение = Движения.КомплектацияАвтомобилей.Добавить();
					Движение.ВидДвижения                = ВидДвиженияНакопления.Расход;
					Движение.Период                     = Дата;
					Движение.Автомобиль                 = ТекСтрока.Автомобиль;
					Движение.СкладКомпании              = ТекСтрока.СкладКомпании;
					Движение.Номенклатура               = ТекСтрока.НоменклатураИлиРабота;
					Движение.ХарактеристикаНоменклатуры = ТекСтрока.ХарактеристикаНоменклатуры;
					Движение.СтатусПартии               = ТекСтрока.СтатусПартии;
					Движение.Партия                     = ТекСтрока.Партия;
					Движение.ГТД                        = ТекСтрока.ГТД;
					Движение.Количество      			= ТекСтрока.Остаток;
					Движение.Сумма          			= ТекСтрока.Сумма;
					Движение.СуммаНДС        			= ТекСтрока.СуммаНДС;
					Движение.ХозОперация     			= Справочники.ХозОперации.КомплектацияАвтомобиля;
					Если ТекСтрока.СуммаНДС > 0 Тогда
						Движение.СтавкаНДС       		= Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
					Иначе
						Движение.СтавкаНДС       		= Справочники.СтавкиНДС.БезНДС;
					КонецЕсли;
					Движение.СуммаУпр        			= ТекСтрока.Сумма;
					Движение.СуммаПродажи    			= ТекСтрока.Сумма;
					Движение.СуммаПродажиУпр 			= ТекСтрока.Сумма;
					//Движение.Регистратор                = Ссылка;
				Иначе
					Движение = Движения.СМГ_КомплектацияАвтомобилейАвтоработы.Добавить();
					Движение.ВидДвижения  = ВидДвиженияНакопления.Расход;
					Движение.Период       = Дата;
					Движение.Автомобиль   = ТекСтрока.Автомобиль;
					Движение.Работа       = ТекСтрока.НоменклатураИлиРабота;
					Движение.Организация  = ТекСтрока.Организация;  
					Движение.ПодразделениеКомпании = ТекСтрока.ПодразделениеКомпании;
					Движение.Количество   = ТекСтрока.Остаток;
					Движение.СуммаУпр     = ТекСтрока.Сумма;
					Движение.ХозОперация  = Справочники.ХозОперации.КомплектацияАвтомобиля;
					//Движение.Регистратор  = Ссылка;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли; 
	//Бондаренко++ 202060320	
	КонецЕсли;
	//Бондаренко-- 202060320
	
КонецПроцедуры

Процедура Печать() Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.КорректировкаПартий.ПолучитьМакет("Печать");
	// Заголовок
	Область = Макет.ПолучитьОбласть("Заголовок");
	ТабДок.Вывести(Область);
	// Шапка
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.Заполнить(ЭтотОбъект);
	ТабДок.Вывести(Шапка);
	// ТЧ
	Область = Макет.ПолучитьОбласть("ТЧШапка");
	ТабДок.Вывести(Область);
	ОбластьТЧ = Макет.ПолучитьОбласть("ТЧ");
	Для Каждого ТекСтрокаТЧ Из ТЧ Цикл
		ОбластьТЧ.Параметры.Заполнить(ТекСтрокаТЧ);
		ОбластьТЧ.Параметры.НоменклатураРасшифровки=ТекСтрокаТЧ.Номенклатура;
		ОбластьТЧ.Параметры.СкладРасшифровки=ТекСтрокаТЧ.СкладКомпании;
		ОбластьТЧ.Параметры.ПартияРасшифровки=ТекСтрокаТЧ.Партия;
		ТабДок.Вывести(ОбластьТЧ);
	КонецЦикла;
	
	ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	ОбластьИтого.Параметры.Количество=ТЧ.Итог("Количество");
	ОбластьИтого.Параметры.Сумма=ТЧ.Итог("Сумма");
	ТабДок.Вывести(ОбластьИтого);
	
	ТабДок.АвтоМасштаб=Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	
КонецПроцедуры

//Бондаренко++ 20260417

// Обработка изменения реквизитов документа
// Параметры
//  Имя			- Строка - Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	- Форма	 - Ссылка на форму документа. Если значение неопределено,
//                производится программная обработка реквизитов.
//  ТекСтрока	- СтрокаТабличнойЧасти - Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры- Структура			- Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   - Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	Если Имя = "БонусныеБаллыДилера.Начислено" Тогда
		Если ТекСтрока.Начислено <= ТекСтрока.Компенсация Тогда
			ТекСтрока.Подтверждено = ТекСтрока.Компенсация - ТекСтрока.Начислено;
 		Иначе
			 ТекСтрока.Подтверждено = ТекСтрока.Компенсация;
			 ТекСтрока.Начислено = 0;
 		КонецЕсли;
    		Возврат Истина;
	ИначеЕсли Имя = "БонусныеБаллыДилера.Подтверждено" Тогда	
		Если ТекСтрока.Подтверждено <= ТекСтрока.Компенсация Тогда
 	 		ТекСтрока.Начислено = ТекСтрока.Компенсация - ТекСтрока.Подтверждено;
		Иначе
			 ТекСтрока.Начислено = ТекСтрока.Компенсация;
			 ТекСтрока.Подтверждено = 0;
 		КонецЕсли;
  		Возврат Истина;
  	Иначе 
		Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()
//Бондаренко++ 20260417
