
Процедура ОбработкаНаСервере(Кампания = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Кампания) Тогда
		Если Кампания.Статус <> Перечисления.CRM_СтатусыКлиентскихЗаявок.Утверждена
			ИЛИ Кампания.Активная = Ложь тогда
			#Если Клиент Тогда
			Сообщить("Контакты не будут созданы, т.к. компания ещё не утверждена или не активна!");	
			#КонецЕсли
			Возврат;
		КонецЕсли;

		СоздатьКонтактыПоКампании(Кампания);
	Иначе
		ВыполнитьРегламентнуюЗадачу();
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьКонтактыПоКампании(Кампания)
	
	Настройки = Кампания.НастройкиОтбора.Получить();
	
	НастройкиДополнительные = Кампания.НастройкиДополнительные.Получить();
	
	НастройкиЦентральные = Кампания.НастройкиЦентральные.Получить();
	
	Если НЕ ЗначениеЗаполнено(Настройки) и НЕ ЗначениеЗаполнено(НастройкиДополнительные) и НЕ ЗначениеЗаполнено(НастройкиЦентральные)  Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
	
		ОтчетСозданиеКампаний = Отчеты.Renault_СозданиеКлиентскихКампаний_V2.Создать();
	
	Исключение
		
		ОтчетСозданиеКампаний = Отчеты.Renault_СозданиеКлиентскихКампаний_V3.Создать();
	
	КонецПопытки;
	
	Если НЕ Кампания.Загружаемая тогда
		ОтчетСозданиеКампаний.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	КонецЕсли;
	
	//подготовим настройки отбора для компоновки данных.
	Если ЗначениеЗаполнено(НастройкиЦентральные) Тогда
		ОтчетСозданиеКампаний.КомпоновщикНастроек.ЗагрузитьФиксированныеНастройки(НастройкиЦентральные);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкиДополнительные) Тогда
		
		Для каждого ЭлДопОтбора из НастройкиДополнительные.Отбор.Элементы цикл
			
			Добавлять = Истина;
			
			Для каждого ЭлФикс из ОтчетСозданиеКампаний.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы цикл
				Если ЭлФикс.ЛевоеЗначение = ЭлДопОтбора.ЛевоеЗначение тогда //такое поле отбора уже есть в отборах, его не будем добавлять.
					Добавлять = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
				
			Если Добавлять тогда
				ЭлементОтбора = ОтчетСозданиеКампаний.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЗаполнитьЗначенияСвойств(ЭлементОтбора,ЭлДопОтбора);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	СхемаКомпоновкиДанных = ОтчетСозданиеКампаний.СхемаКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ОтчетСозданиеКампаний.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"),ТекущаяДата());  //+++ DMS
	
	УдалитьПересеченияНастроекОтбора(НастройкиДополнительные,ОтчетСозданиеКампаний.КомпоновщикНастроек.Настройки);
	УдалитьПересеченияНастроекОтбора(НастройкиЦентральные,ОтчетСозданиеКампаний.КомпоновщикНастроек.Настройки);
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, ОтчетСозданиеКампаний.КомпоновщикНастроек.ПолучитьНастройки(), , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ТаблицаИтогов = Новый ТаблицаЗначений;
	ПроцессорВыводаВКоллекцию = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВыводаВКоллекцию.УстановитьОбъект(ТаблицаИтогов);
	ПроцессорВыводаВКоллекцию.Вывести(ПроцессорКомпоновкиДанных, Истина);
	ТаблицаИтогов.Колонки.Добавить("НомерИсходнойСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаИтогов.Колонки.Добавить("ОснованиеДляКонтакта", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(400)));
	
	Индекс = 0;
	Для Каждого Строка ИЗ ТаблицаИтогов Цикл
		
		Строка.НомерИсходнойСтроки = Индекс;
		Индекс = Индекс + 1;
		
		Текст = "";
		
		Для Каждого Колонка ИЗ ТаблицаИтогов.Колонки Цикл
			Если НЕ Колонка.Имя = "НомерИсходнойСтроки" И НЕ Колонка.Имя = "ОснованиеДляКонтакта" Тогда
				Текст = Текст + "(" + Колонка.Имя + ") " + Строка(Строка[Колонка.Имя]) + ";";
			КонецЕсли;
		КонецЦикла;
		
		Строка.ОснованиеДляКонтакта = Текст;	
		
	КонецЦикла;
	
	ТаблицаИтогов.Индексы.Добавить("НомерИсходнойСтроки");
	
	КонтактыПоВидуКонтакта = Новый ТаблицаЗначений;
	КонтактыПоВидуКонтакта.Колонки.Добавить("Контрагент");
	
	//Если Кампания.ВидКонтакта = Перечисления.Renault_ВидыКонтактаКампаний.email
	//	ИЛИ Кампания.ВидКонтакта = Перечисления.Renault_ВидыКонтактаКампаний.СМС Тогда
		
		СписокКонтрагентов = Новый СписокЗначений;
		
		Если ТаблицаИтогов.Колонки.Найти("Контрагент") <> Неопределено Тогда
			
			СписокКонтрагентов.ЗагрузитьЗначения(ТаблицаИтогов.ВыгрузитьКолонку("Контрагент"));
			
		ИначеЕсли ТаблицаИтогов.Колонки.Найти("Клиент") <> Неопределено Тогда
				
			СписокКонтрагентов.ЗагрузитьЗначения(ТаблицаИтогов.ВыгрузитьКолонку("Клиент"));
			
			ТаблицаИтогов.Колонки.Клиент.Имя = "Контрагент";
			
		Иначе
			
			Возврат;
		
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_КонтактСКлиентом.Контрагент,
		|	Renault_КонтактСКлиентом.Ссылка
		|ИЗ
		|	Документ.Renault_КонтактСКлиентом КАК Renault_КонтактСКлиентом
		|ГДЕ
		|	Renault_КонтактСКлиентом.КонтактВыполнен = ЛОЖЬ
		|	И Renault_КонтактСКлиентом.ВидКонтакта = &ВидКонтакта
		|	И Renault_КонтактСКлиентом.Контрагент В (&СписокКонтрагентов)
		|	И Renault_КонтактСКлиентом.ПометкаУдаления = ЛОЖЬ
		|	И Renault_КонтактСКлиентом.Дата >= ДОБАВИТЬКДАТЕ(&ТекДата, Месяц, -1)";
		
		Запрос.УстановитьПараметр("ВидКонтакта",Кампания.ВидКонтакта);
		Запрос.УстановитьПараметр("СписокКонтрагентов",СписокКонтрагентов);
		Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
		
		КонтактыПоВидуКонтакта = Запрос.Выполнить().Выгрузить();
		КонтактыПоВидуКонтакта.Индексы.Добавить("Контрагент");
		
	//КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(Док.Дата) КАК Дата,
	|	Док.Кампания,
	|	Док.Контрагент
	|ПОМЕСТИТЬ ПоследниеДатыКонтактов
	|ИЗ Документ.Renault_КонтактСКлиентом КАК Док
	|СГРУППИРОВАТЬ ПО
	|	Док.Кампания,
	|	Док.Контрагент
	|;
	|ВЫБРАТЬ
	|	Док.Ссылка,
	|	Док.Кампания КАК Кампания,
	|	Док.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ПоследниеКонтакты
	|ИЗ Документ.Renault_КонтактСКлиентом КАК Док
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоследниеДатыКонтактов КАК ПоследниеДатыКонтактов
	|		ПО ПоследниеДатыКонтактов.Дата = Док.Дата
	|		И ПоследниеДатыКонтактов.Кампания = Док.Кампания
	|		И ПоследниеДатыКонтактов.Контрагент = Док.Контрагент
	|;
	|ВЫБРАТЬ
	|	ТЗ.НомерИсходнойСтроки,
	|	ТЗ.Контрагент,
	|	ТЗ.ОснованиеДляКонтакта
	|ПОМЕСТИТЬ ВремТЗ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТЗ.НомерИсходнойСтроки) КАК НомерИсходнойСтроки,
	|	ТЗ.Контрагент,
	|	ТЗ.ОснованиеДляКонтакта,
	//|	Документы.Ссылка КАК ПланируемыйКонтакт,
	|	НедавниеДокументы.Ссылка КАК НедавнийДокумент,
	|	КонтактыВРаботе.Ссылка КАК КонтактВРаботе
	|ИЗ
	|	ВремТЗ КАК ТЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_КонтактСКлиентом КАК КонтактыВРаботе
	|		ПО (КонтактыВРаботе.Контрагент = ТЗ.Контрагент)
	|			И (КонтактыВРаботе.Кампания = &Кампания)
	|			И (КонтактыВРаботе.КонтактВыполнен = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПоследниеКонтакты КАК Документы
	|		ПО (Документы.Контрагент = ТЗ.Контрагент)
	|			И (Документы.Кампания = &Кампания)
	|			И (Документы.Ссылка.ОснованиеДляКонтакта = ТЗ.ОснованиеДляКонтакта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_КонтактСКлиентом КАК НедавниеДокументы
	|		ПО НедавниеДокументы.Контрагент = ТЗ.Контрагент
	|			И НедавниеДокументы.Кампания = &Кампания
	|			И РАЗНОСТЬДАТ(НедавниеДокументы.Дата, &ТекДата, ДЕНЬ) < НедавниеДокументы.Кампания.МинимальныйИнтервалВКонтактах
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЗ.Контрагент,
	|	ТЗ.ОснованиеДляКонтакта,
	|	КонтактыВРаботе.Ссылка,
	|	НедавниеДокументы.Ссылка";
	
	Запрос.УстановитьПараметр("ТЗ",ТаблицаИтогов);
	Запрос.УстановитьПараметр("Кампания", Кампания);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТаблицыДанных ИЗ ТаблицаДанных Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицыДанных.Контрагент) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицыДанных.КонтактВРаботе) Тогда
			
			Если СтрокаТаблицыДанных.КонтактВРаботе.ОснованиеДляКонтакта <> СтрокаТаблицыДанных.ОснованиеДляКонтакта Тогда
				
				ДокументОбъект = СтрокаТаблицыДанных.КонтактВРаботе.ПолучитьОбъект();
				ИсходнаяСтрока = ТаблицаИтогов[СтрокаТаблицыДанных.НомерИсходнойСтроки];
				Текст = "";
				ДокументОбъект.ОснованиеДляКонтакта_Значения.Очистить();
				Для Каждого Колонка ИЗ ТаблицаИтогов.Колонки Цикл
					Если НЕ Колонка.Имя = "НомерИсходнойСтроки" И НЕ Колонка.Имя = "ОснованиеДляКонтакта" Тогда
						
						Текст = Текст + "(" + Колонка.Имя + ") " + Строка(ИсходнаяСтрока[Колонка.Имя]) + ";";
						
						// заполним таблицу "ОснованиеДляКонтакта_Значения" для последующего получения значений
						СтрокаТаб = ДокументОбъект.ОснованиеДляКонтакта_Значения.Добавить();
						СтрокаТаб.ИмяКолонки = Колонка.Имя;
						СтрокаТаб.Значение = ИсходнаяСтрока[Колонка.Имя];
						
					КонецЕсли;
				КонецЦикла;
				ДокументОбъект.ОснованиеДляКонтакта = Текст;
				ДокументОбъект.Записать();
				
				ДокСсылка = ДокументОбъект.Ссылка;
				
			КонецЕсли;
			
		Иначе
			
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицыДанных.КонтактВРаботе) Тогда
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицыДанных.НедавнийДокумент) Тогда
					
					СтрокаДанных = ТаблицаИтогов.Найти(СтрокаТаблицыДанных.НомерИсходнойСтроки,"НомерИсходнойСтроки");
					
					ДокументОбъект = Документы.Renault_КонтактСКлиентом.СоздатьДокумент();
					ЗаполнитьЗначенияСвойств(ДокументОбъект, СтрокаДанных);
					ДокументОбъект.Кампания = Кампания;
					ДокументОбъект.ВидКонтакта = Кампания.ВидКонтакта;
					ДокументОбъект.ПлановаяДата = НачалоДня(ТекущаяДата());
					ДокументОбъект.Дата = ТекущаяДата();
					ДокументОбъект.ТекстРассылки = Кампания.ТекстРассылки;
					ИсходнаяСтрока = ТаблицаИтогов[СтрокаДанных.НомерИсходнойСтроки];
					Текст = "";
					Для Каждого Колонка ИЗ ТаблицаИтогов.Колонки Цикл
						Если НЕ Колонка.Имя = "НомерИсходнойСтроки" И НЕ Колонка.Имя = "ОснованиеДляКонтакта" Тогда
							
							Текст = Текст + "(" + Колонка.Имя + ") " + Строка(ИсходнаяСтрока[Колонка.Имя]) + ";";
							
							// заполним таблицу "ОснованиеДляКонтакта_Значения" для последующего получения значений
							СтрокаТаб = ДокументОбъект.ОснованиеДляКонтакта_Значения.Добавить();
							СтрокаТаб.ИмяКолонки = Колонка.Имя;
							СтрокаТаб.Значение = ИсходнаяСтрока[Колонка.Имя];
							
						КонецЕсли;
					КонецЦикла;
					ДокументОбъект.ОснованиеДляКонтакта = Текст;
					ДокументОбъект.ДнейДоКонтрольногоСрока = (НачалоДня(ДокументОбъект.Дата) + Кампания.ДнейНаОбзвон * 86400 - НачалоДня(ТекущаяДата())) / 86400;
					
					ДокументОбъект.Записать();
					
					ДокСсылка = ДокументОбъект.Ссылка;
					
				КонецЕсли;
				
			Иначе
				
				ДокСсылка = СтрокаТаблицыДанных.КонтактВРаботе;
				
				ДокументОбъект = ДокСсылка.ПолучитьОбъект();
				СтрокаДанных = ТаблицаИтогов.Найти(СтрокаТаблицыДанных.НомерИсходнойСтроки, "НомерИсходнойСтроки");
				ЗаполнитьЗначенияСвойств(ДокументОбъект, СтрокаДанных);
				
				ДокументОбъект.ПлановаяДата = НачалоДня(ТекущаяДата());
				ДнейНаОбзвон = Кампания.ДнейНаОбзвон;
				ДокументОбъект.ДнейДоКонтрольногоСрока = (НачалоДня(ДокументОбъект.Дата) + ДнейНаОбзвон * 86400 - НачалоДня(ТекущаяДата())) / 86400;
				
				Если НЕ ЗначениеЗаполнено(ДокументОбъект.ТекстРассылки) тогда 
					ДокументОбъект.ТекстРассылки = Кампания.ТекстРассылки;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(ДокументОбъект.Телефон) и ТаблицаИтогов.Колонки.Найти("Телефон") <> Неопределено тогда 
					ДокументОбъект.Телефон = СтрокаДанных.Телефон;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(ДокументОбъект.EMail) И ТаблицаИтогов.Колонки.Найти("EMail") <> Неопределено тогда 
					ДокументОбъект.EMail = СтрокаДанных.EMail;
				КонецЕсли;
				
				ДокументОбъект.ВидКонтакта = Кампания.ВидКонтакта;
				ДокументОбъект.Записать();
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если (Кампания.ВидКонтакта = Перечисления.Renault_ВидыКонтактаКампаний.email
			ИЛИ Кампания.ВидКонтакта = Перечисления.Renault_ВидыКонтактаКампаний.СМС)
			И ЗначениеЗаполнено(ДокСсылка) Тогда
			
			Отбор = Новый Структура("Контрагент",ДокументОбъект.Контрагент);
			ПрочиеОткрытыеКонтакты = КонтактыПоВидуКонтакта.НайтиСтроки(Отбор);
			
			Для каждого ПрочийКонтакт из ПрочиеОткрытыеКонтакты цикл
				Если ПрочийКонтакт.Ссылка = ДокСсылка Тогда 
					Продолжить;
				КонецЕсли;
				
				Если Найти(ДокументОбъект.ТекстРассылки,ПрочийКонтакт.Ссылка.ТекстРассылки) = 0 Тогда
					ДокументОбъект.ТекстРассылки =  ПрочийКонтакт.Ссылка.ТекстРассылки + " " + ДокументОбъект.ТекстРассылки;
				КонецЕсли;
				
				ПрочийКонтактОбъект = ПрочийКонтакт.Ссылка.ПолучитьОбъект();
				ПрочийКонтактОбъект.КонтактВыполнен = Истина;
				ПрочийКонтактОбъект.КонтактПереемник = ДокСсылка;
				ПрочийКонтактОбъект.Записать();
				ДокументОбъект.Записать();
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьРегламентнуюЗадачу()
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_Кампании.Ссылка КАК Кампания
	|ИЗ
	|	Справочник.Renault_Кампании КАК Renault_Кампании
	|ГДЕ
	|	Renault_Кампании.Статус = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыКлиентскихЗаявок.Утверждена)
	|	И Renault_Кампании.РазоваяКампания = ЛОЖЬ
	|	И Renault_Кампании.Активная = Истина";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СоздатьКонтактыПоКампании(Выборка.Кампания);	
	КонецЦикла;
	
КонецПроцедуры

//DMS процедура удаляет из настроек отбора кампании все отборы, которые пересекаются с фиксированными настройками центральной базы.
Процедура УдалитьПересеченияНастроекОтбора(ПриоритетныеНастройки,ВторостепенныеНастройки)
	
	Если ПриоритетныеНастройки = Неопределено 
		или ВторостепенныеНастройки = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	//удалим настройки кампании, которые пересекаются с централизованными настройками.
	Для каждого ЭлементОтбораФиксНастроек из ПриоритетныеНастройки.Отбор.Элементы Цикл
		Для каждого ЭлементОтбораНастроекКампании из ВторостепенныеНастройки.Отбор.Элементы Цикл
			Если ЭлементОтбораНастроекКампании.ЛевоеЗначение = ЭлементОтбораФиксНастроек.ЛевоеЗначение тогда 
				ВторостепенныеНастройки.Отбор.Элементы.Удалить(ЭлементОтбораНастроекКампании);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры
