
Функция ПолучитьОсновногоПредставителяПоНастройке(Пользователь,Представитель = Неопределено) Экспорт 
	
	ЗначениеПредставитель = Справочники.DMS_Представители.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(Представитель) Тогда
		
		Возврат Представитель;
		
	ИначеЕсли Не ЗначениеЗаполнено(Пользователь) Тогда 
		
		ЗначениеПредставитель = Справочники.DMS_Представители.ПолучитьПредставителяПоУмолчанию();	
		Возврат ЗначениеПредставитель;
		
	Иначе 
		
		 ЗначениеПредставитель = ПолучитьНастройкуПользователя(Пользователь,"DMS_ОсновнойПредставитель");
		 
		 Если Не ЗначениеЗаполнено(ЗначениеПредставитель) Тогда
		 	ЗначениеПредставитель = Справочники.DMS_Представители.ПолучитьПредставителяПоУмолчанию();	
		 КонецЕсли; 
		 
		 Возврат ЗначениеПредставитель;
		 
	КонецЕсли; 

КонецФункции // ПолучитьОсновногоПредставителяПоНастройке()

Функция ПолучитьОсновногоДилерскийЦентрПоНастройке(Пользователь,ДилерскийЦентр = Неопределено) Экспорт 
	
	ЗначениеДилерскийЦентр = Справочники.CRM_ДилерскиеЦентры.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(ДилерскийЦентр) Тогда
		
		Возврат ДилерскийЦентр;
		
	ИначеЕсли Не ЗначениеЗаполнено(Пользователь) Тогда 
		
		ЗначениеДилерскийЦентр = Справочники.CRM_ДилерскиеЦентры.ПолучитьПредставителяПоУмолчанию();	
		Возврат ЗначениеДилерскийЦентр;
		
	Иначе 
		
		 ЗначениеДилерскийЦентр = ПолучитьНастройкуПользователя(Пользователь,"ДилерскийЦентр");
		 
		 Если Не ЗначениеЗаполнено(ЗначениеДилерскийЦентр) Тогда
		 	ЗначениеДилерскийЦентр = ПолучитьДилерскийЦентрПоУмолчанию();	
		 КонецЕсли; 
		 
		 Возврат ЗначениеДилерскийЦентр;
		 
	КонецЕсли; 

КонецФункции // ПолучитьОсновногоПредставителяПоНастройке()

Функция ПолучитьНастройкуПользователя(Пользователь,ИмяНастройки)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПользовательскиеНастройки.ПраваИНастройки
		|ПОМЕСТИТЬ ТаблицаНастроек
		|ИЗ
		|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК ПользовательскиеНастройки
		|ГДЕ
		|	ПользовательскиеНастройки.Пользователь = &Пользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНастроек.ПраваИНастройки.[ИмяНастройки] КАК [ИмяНастройки]
		|ИЗ
		|	ТаблицаНастроек КАК ТаблицаНастроек";
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"[ИмяНастройки]",ИмяНастройки);	
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНастроек = РезультатЗапроса.Выбрать();
	
	Если ВыборкаНастроек.Следующий() Тогда
		Возврат ВыборкаНастроек[ИмяНастройки];	
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции // ПолучитьНастройкуПользователя()

Функция ПолучитьДилерскийЦентрПоУмолчанию() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
		|	ДилерскиеЦентры.Ссылка
		|ИЗ
		|	Справочник.CRM_ДилерскиеЦентры КАК ДилерскиеЦентры
		|ГДЕ
		|	НЕ ДилерскиеЦентры.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ДилерскийЦентр = Справочники.CRM_ДилерскиеЦентры .ПустаяСсылка();
	
	Если ВыборкаДетальныеЗаписи.Следующий() И ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
		ДилерскийЦентр = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли; 
	
	Возврат ДилерскийЦентр;
	
КонецФункции // ПолучитьДилерскийЦентрПоУмолчанию()
  