///////////////////////////////////////////////////////////////////////////////
// СИСТЕМНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возникает при начале работы системы
Процедура ПриНачалеРаботыСистемы() Экспорт
	
	// Параметры клиента, которые будем использовать на сервере
	ПараметрыКлиента = Новый Соответствие();
	#Если НЕ ВебКлиент Тогда
	ПараметрыКлиента.Вставить("ИмяКомпьютера", ИмяКомпьютера());
	#Иначе
	ПараметрыКлиента.Вставить("ИмяКомпьютера", Renault_внОбщийМодуль.ИмяКомпьютераНаСервере());
	#КонецЕсли
	
	Renault_внОбщийМодуль.ПриНачалеРаботыСистемы(ПараметрыКлиента);
	ВыполнитьРегламентныеЗаданияИзКоманднойСтроки();
	ПодключитьПодпискиНаСобытия();
	
КонецПроцедуры // ПриНачалеРаботыСистемы

// Возникает при завершении работы
Процедура ПриЗавершенииРаботыСистемы() Экспорт
	
	Renault_внОбщийМодуль.ПриЗавершенииРаботыСистемы();
	
КонецПроцедуры // ПриЗавершенииРаботыСистемы

// Выполняет проверку на то, что запущен сеанс из под определенного пользователя и при 
// необходимости выполняет действия
Процедура ВыполнитьРегламентныеЗаданияИзКоманднойСтроки()
	
	#Если НЕ ВнешнееСоединение Тогда	
	Если НРег(ИмяПользователя()) = "автоматическоесжатие" Тогда
			
		// Сжатие вручную запуском из командной строки
		Если Renault_внОбщийМодуль.ПолучитьКоличествоЗапущенныхСеансовПользователя("АвтоматическоеСжатие") = 1 Тогда
			
			Renault_внОбщийМодуль.внОбработкаЖурналаРегистрации();
			
		КонецЕсли;
		
		ЗавершитьРаботуСистемы(Ложь);
		
		
	ИначеЕсли НРег(ИмяПользователя()) = "автоматическаяочистка" Тогда
		
		// Очистка вручную запуском из командной строке
		Если Renault_внОбщийМодуль.ПолучитьКоличествоЗапущенныхСеансовПользователя("АвтоматическаяОчистка") = 1 Тогда
			
			Renault_внОбщийМодуль.внОчисткаЖурналаРегистрации();
			
		КонецЕсли;
		
		ЗавершитьРаботуСистемы(Ложь);
		
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры // ВыполнитьРегламентныеЗаданияИзКоманднойСтроки

// Подключает подписки на события
Процедура ПодключитьПодпискиНаСобытия() Экспорт
		
	#Если Клиент Тогда
	Интервал = Renault_внОбщийМодульПовтИсп.глВНЗначениеПеременной("ИнтервалПроверкиПодпискиНаСобытия");
	Если Интервал <> Неопределено Тогда
		ПодключитьОбработчикОжидания("внПроверитьПодпискиНаСобытия", Интервал);
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры // ПодключитьПодпискиНаСобытия

#Если Клиент Тогда
	
// Проверка новых подписок на события
Процедура ПроверитьПодпискиНаСобытия() Экспорт
	
	// Есть события, которые пользователь еще не увидел?
	Если НЕ Renault_внОбщийМодуль.ЕстьНовыеПодпискиНаСобытияТекущегоПользователя() Тогда
		Возврат;
	КонецЕсли;
	
	ТекФорма = ПолучитьФорму("РегистрСведений.Renault_внПодпискиНаСобытия.ФормаСписка");
	
	// Открываем форму
	Если ТекФорма.Открыта() Тогда
		ТекФорма.Активизировать();
	Иначе
		ТекФорма.Открыть();
	КонецЕсли;
		
	ПоказатьОповещениеПользователя("Новые события", ПолучитьНавигационнуюСсылку(ТекФорма), "Произошло изменение реквизитов в журнале регистарции...", БиблиотекаКартинок.внПодпискаНаСобытия32);
	
КонецПроцедуры

#КонецЕсли

///////////////////////////////////////////////////////////////////
// Для того чтобы из формы можно было открывать историю по выбранному
// 
///////////////////////////////////////////////////////////////////
// В модуль ФормыОбъекта
//Процедура ЖурналРегистрации_ИсторияИзменений(Кнопка)
//
//	внОбщийМодульКлиент.КнопкаНажатиеПоказатьИсторию(ЭтаФорма, ЭтотОбъект, Кнопка);
//
//КонецПроцедуры
///////////////////////////////////////////////////////////////////
// В модуль ФормыСписка
//Процедура ЖурналРегистрации_ИсторияИзменений(Кнопка)
//	
//	внОбщийМодульКлиент.КнопкаНажатиеПоказатьИсторию(ЭтаФорма, , Кнопка);
//	
//КонецПроцедуры

#Если ТолстыйКлиентОбычноеПриложение Тогда
// Позволяет указать в каких объектах добавить
Процедура ПриОткрытииФормы(КоманднаяПанель, Объект = Неопределено) Экспорт	
	Если РольДоступна("Renault_внАдминистраторЖурналаРегистрации") ИЛИ РольДоступна("Renault_внПросмотрЖурналаРегистрации") Тогда
		ИмяКнопки = "внОткрытиеИсторииИзмененийПоОбъекту";
		Если НЕ (КоманднаяПанель.Кнопки.Найти(ИмяКнопки) = Неопределено) Тогда
			Возврат;
		КонецЕсли;
		Если КоманднаяПанель.ВыравниваниеКнопок = ВыравниваниеКнопокКоманднойПанели.Право Тогда
			КоманднаяПанель.Кнопки.Вставить(0,, ТипКнопкиКоманднойПанели.Разделитель);
			КнопкаИстория = КоманднаяПанель.Кнопки.Вставить(0, ИмяКнопки, ТипКнопкиКоманднойПанели.Действие, "Показать журнал по объекту", Новый Действие("ЖурналРегистрации_ИсторияИзменений"));
		Иначе
			КоманднаяПанель.Кнопки.Добавить(, ТипКнопкиКоманднойПанели.Разделитель);
			КнопкаИстория = КоманднаяПанель.Кнопки.Добавить(ИмяКнопки, ТипКнопкиКоманднойПанели.Действие, "Показать журнал по объекту", Новый Действие("ЖурналРегистрации_ИсторияИзменений"));
		КонецЕсли;		
		КнопкаИстория.Отображение = ОтображениеКнопкиКоманднойПанели.Картинка;
		КнопкаИстория.Картинка    = БиблиотекаКартинок.внОтборПоТекущемуОбъекту;
		КнопкаИстория.Подсказка   = "Показать журнал по объекту";
	КонецЕсли;
КонецПроцедуры
#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

#Если ТолстыйКлиентОбычноеПриложение Тогда
// Процедура - обработчик нажатия кнопки.
//
Процедура КнопкаНажатиеПоказатьИсторию(Форма, Объект = Неопределено, Кнопка) Экспорт
	Попытка
		ФормаОбработки = Обработки.Renault_внЖурналРегистрации.ПолучитьФорму();
		Если Объект <> Неопределено Тогда
			ФормаОбработки.ОбъектОтбора = Renault_внОбщийМодуль.СистемноеПредставлениеОбъекта(Объект.Ссылка);
		Иначе
			Ссылка = Форма.ТекущийЭлемент.ТекущаяСтрока;
			Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
				Возврат;
			КонецЕсли;		
			ФормаОбработки.ОбъектОтбора = Renault_внОбщийМодуль.СистемноеПредставлениеОбъекта(Ссылка);
		КонецЕсли;
			
		Если НЕ ФормаОбработки.Открыта() Тогда
			ФормаОбработки.Открыть();
		Иначе
			ФормаОбработки.Активизировать();
		КонецЕсли;	
	Исключение
	КонецПопытки;	
КонецПроцедуры // КнопкаНажатие()
#КонецЕсли

