
#Область ОбработчикиСобытий

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
	
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Процедура - обработчик ввода на основании
Процедура ОбработкаЗаполнения(Основание)
	
	Если ДилерскийЦентр.Пустая() Тогда 
		ДилерскийЦентр=ПараметрыСеанса.Renault_ПраваПользователя.ДилерскийЦентр; 
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

#КонецОбласти

#Если Клиент Тогда
	
#Область Печать

// Функция осуществляет печать произвольного документа.
// Можно направить печать на экран или принтер, а также распечатать необходимое количество копий.
//
// Параметры:
//	ЭтотОбъект							- ДокументОбъект	- Документ для печати
//	НазваниеПечатнойФормы 				- Строка			- Название печатной формы, если пусто, то по умолчанию
//	КоличествоЭкземпляров				- Число				- Количество экземпляров документа
//	НаПринтер							- Булево			- Признак отправки документа на принтер без отображения его на экране
//  Документ 	  						- ТабличныйДокумент	- Макет печатной формы
//
// Возвращаемое значение:
//   ТабличныйДокумент	- Сформированная печатная форма
//
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции // Печать()

#КонецОбласти

#КонецЕсли

#Область СлужебныеПроцедурыИФункции

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка – Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	– Форма	 – Ссылка на форму документа. Если значение неопределено,
//                         производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт

	Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	
КонецФункции // ОбработкаРеквизита()

Процедура ПриЗаписи(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CRM_СобытияПоРабочимЛистам.Ссылка
	|ИЗ
	|	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
	|ГДЕ
	|	CRM_СобытияПоРабочимЛистам.IDK = &IDK
	|	И CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ";
	Запрос.УстановитьПараметр("IDK", IDK);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЗаписьСобытие = Выборка.Ссылка.ПолучитьОбъект();
		ЗаписьСобытие.Сотрудник = Сотрудник;
		ЗаписьСобытие.Записать();
		
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	//DMSREN-980
	ТаблицаДублей = ДублиПоIDK();
	
	Если ТаблицаДублей.Количество() > 0 Тогда 
		Отказ = Истина;
		Сообщить("Есть дубли рабочиего листа с IDK "+IDK);
		Для Каждого Стр Из ТаблицаДублей Цикл 
			Сообщить(Стр.Ссылка);	
		КонецЦикла;
		Возврат;
	КонецЕсли;
	//---

	Если Не ЭтоНовый() Тогда 
		Возврат
	КонецЕсли;
	
	
	ПодставитьПодразделениеВДокумент();
	
КонецПроцедуры

Процедура ПодставитьПодразделениеВДокумент()
	
	Если ЗначениеЗаполнено(Подразделение) Тогда 
		Возврат;
	КонецЕсли;
	
	Подразделение = ПараметрыСеанса.Пользователь.Подразделение;
	
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда 
		Возврат;
	КонецЕсли;
	
	Подразделение = Сотрудник.Подразделение;
	
КонецПроцедуры

//DMSREN-980
Функция ДублиПоIDK()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Renault_РабочийЛист.Ссылка) КАК Ссылка,
		|	Renault_РабочийЛист.IDK КАК IDK
		|ПОМЕСТИТЬ ВремянкаИДК
		|ИЗ
		|	Документ.Renault_РабочийЛист КАК Renault_РабочийЛист
		|ГДЕ
		|	Renault_РабочийЛист.IDK <> 0
		|	И Renault_РабочийЛист.Ссылка <> &Ссылка
		|	И Renault_РабочийЛист.IDK = &IDK
		|	И Renault_РабочийЛист.ПометкаУдаления = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	Renault_РабочийЛист.IDK
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(Renault_РабочийЛист.Ссылка) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Renault_РабочийЛист.Ссылка КАК Ссылка,
		|	ВремянкаИДК.IDK КАК IDK
		|ИЗ
		|	ВремянкаИДК КАК ВремянкаИДК
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_РабочийЛист КАК Renault_РабочийЛист
		|		ПО ВремянкаИДК.IDK = Renault_РабочийЛист.IDK";
	
	Запрос.УстановитьПараметр("IDK", IDK);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();

КонецФункции
//---

#КонецОбласти