Процедура ОбработкаНаСервере() Экспорт
	
	#Если Клиент Тогда
	
		ДЦ = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
		
		Период = ДЦ.ПериодОпозданияКлиента;
	
	#Иначе
		
		Период = 15;	
	
	#КонецЕсли
	
	 Запрос = Новый Запрос("ВЫБРАТЬ
	                       |	Renault_CRM_ПриемкаАвтомобиля.Ссылка
	                       |ИЗ
	                       |	Документ.Renault_CRM_ПриемкаАвтомобиля КАК Renault_CRM_ПриемкаАвтомобиля
	                       |ГДЕ
	                       |	Renault_CRM_ПриемкаАвтомобиля.ВремяНачала <= &ПорогВремени
	                       |	И Renault_CRM_ПриемкаАвтомобиля.Состояние = &Состояние
	                       |	И Renault_CRM_ПриемкаАвтомобиля.ВремяНачала >= &НачалоДня");
						   
	Запрос.УстановитьПараметр("ПорогВремени",ТекущаяДата()-Период*60);
	Запрос.УстановитьПараметр("Состояние",Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Заявка);
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ТекущаяДата()));
	ТаблицаИтог = Запрос.Выполнить().Выгрузить();
	ТаблицаИтог.Колонки.Добавить("Уник",новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40) ));
	Для Каждого Тек Из ТаблицаИтог Цикл
		Тек.Уник = Тек.Ссылка.УникальныйИдентификатор();
	КонецЦикла;
	Запрос = новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	ТекстЗапроса = "ВЫБРАТЬ "+Символы.ПС;
	ЭтоПерваяКолонка = Истина;
	Для Каждого Кол Из ТаблицаИтог.Колонки Цикл
		Если ЭтоПерваяКолонка Тогда
			ЭтоПерваяКолонка = Ложь;
		Иначе
			ТекстЗапроса = ТекстЗапроса+", "+Символы.ПС;
		КонецЕсли;
			
		ТекстЗапроса =ТекстЗапроса + "Табл." +Кол.Имя;
	КонецЦикла;
	ТекстЗапроса = ТекстЗапроса+Символы.ПС+ "ПОМЕСТИТЬ ТаблицаДанных "+Символы.ПС+"ИЗ "+Символы.ПС+
				" &Табл КАК Табл "+СИмволы.ПС+"; "+Символы.ПС+
				"////////////////////////////////////////////////////////////////////////////////" +Символы.ПС;
	ТекстЗапроса= ТекстЗапроса+"ВЫБРАТЬ
	                           |	ТаблицаДанных.*
	                           |ИЗ
	                           |	ТаблицаДанных КАК ТаблицаДанных
	                           |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_СообщенияПользователю КАК Renault_СообщенияПользователю
	                           |		ПО ТаблицаДанных.Уник = Renault_СообщенияПользователю.ИдентификаторОбъекта
	                           |ГДЕ
	                           |	Renault_СообщенияПользователю.Ссылка ЕСТЬ NULL ";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Табл",ТаблицаИтог);
	ДокументыКОповещению = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Описание Из ДокументыКОповещению Цикл
		СоздатьОповещение(Описание);
	КонецЦикла;
	
 
	
КонецПроцедуры


Процедура СоздатьОповещение(Описание)
	Док = Описание.Ссылка;
	Сообщ = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
	
	КомуНапоминание = ПолучитьЛюдейДляНапоминаний(Описание.Ссылка.ДилерскийЦентр);
	
	Адр = Сообщ.Адресаты.Добавить();
	Адр.Сотрудник = Док.МашиноМесто;
	
	Для Каждого Людь из КомуНапоминание Цикл
		
		Кому = Сообщ.Адресаты.Добавить();
		Кому.Сотрудник = Людь.Сотрудник;
		
	КонецЦикла;
	
	Сообщ.ВидСообщения = Справочники.Renault_ВидСообщения.Автосервис_НеявкаНаПриемкуВыдачу;
	Сообщ.ДатаОтправки = ТекущаяДата();
	Сообщ.ИдентификаторОбъекта = Описание.Уник; 
	
	Сообщ.УстановитьНовыйКод();
	Сообщ.Наименование =Строка( Док);
	Сообщ.Комментарий = "Сформированно автоматически";
	Сообщ.ПоказыватьС =Сообщ.ДатаОтправки;
	Сообщ.ПоказыватьПо = Сообщ.ДатаОтправки;
	Сообщ.Сообщение =  "Клиент "+ Строка(Док.Клиент)+ " Опаздывает на "+Строка(Док.ВремяНачала);
	Сообщ.Подробнее = Новый ХранилищеЗначения(Док.Ссылка);
	Сообщ.Записать();
КонецПроцедуры

Функция ПолучитьЛюдейДляНапоминаний(ДилерскийЦентр)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Сотрудники.Ссылка КАК Сотрудник
	               |ИЗ
	               |	Справочник.Сотрудники КАК Сотрудники
	               |ГДЕ
	               |	Сотрудники.Должность = &Должность
	               |	И Сотрудники.Подразделение В(&Подразделение)";
				   
	Запрос.УстановитьПараметр("Должность", ДилерскийЦентр.Автосервис_ДолжностиДляНапоминаний);
	Запрос.УстановитьПараметр("Подразделение", ДилерскийЦентр.ПодразделенияОрганизации.ВыгрузитьКолонку("Подразделение"));
	
	Люди = Запрос.Выполнить().Выгрузить();
	
	Возврат Люди;
	
	
КонецФункции
