&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем ДанныеДляЗаполнения;
	
	Если НЕ Параметры.Свойство("ДанныеДляЗаполнения", ДанныеДляЗаполнения) Тогда
		Возврат;
	КонецЕсли;

	Для Каждого Эл Из ДанныеДляЗаполнения Цикл
		Стр = ТабличноеПолеВложения.Добавить();
		Стр.ИмяФайла = Эл;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НачальноеОформлениеФормы();
КонецПроцедуры

&НаКлиенте
Процедура НачальноеОформлениеФормы()
	МассивАктив = Новый Массив;
	МассивАктив.Добавить(Элементы.кнОК);
	
	Renault_ОбщиеФункции.МультибрендОсновноеОформление(МассивАктив);	
КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеВложенияИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.МножественныйВыбор = Ложь;
	Если НЕ Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ТабличноеПолеВложения.ТекущиеДанные.ИмяФайла = Диалог.ПолноеИмяФайла;
	Элементы.ТабличноеПолеВложения.ЗакончитьРедактированиеСтроки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура кнОК(Команда)
	ДанныеДляОтправки = Новый Массив();
	
	Для Каждого Стр Из ТабличноеПолеВложения Цикл
		ДанныеДляОтправки.Добавить(Стр.ИмяФайла);
	КонецЦикла;
	
	Закрыть(ДанныеДляОтправки);
КонецПроцедуры




