
//Перем ПоследовательностиОтчета Экспорт;                // последовательности отчета


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

Функция ПолучитьСвойства() Экспорт
	
	СтруктураСвойств = Новый Структура;
	СтруктураСвойств.Вставить("ДокументПередачи");
	СтруктураСвойств.Вставить("ПериодРегистратор");
	СтруктураСвойств.Вставить("Контрагент");
	СтруктураСвойств.Вставить("ДоговорВзаиморасчетов");
	СтруктураСвойств.Вставить("Автомобиль");
	СтруктураСвойств.Вставить("Модель");
	
	Возврат СтруктураСвойств;
	
КонецФункции

// Стандартная процедура настройки схемы компоновщика данных
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ОтчетыСервер.ЗаполнитьНачальныеОстатки(ЭтотОбъект);
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) Экспорт
	
	ОтчетыСервер.ВывестиОтчет(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

//ПоследовательностиОтчета = Новый Структура();
//ПоследовательностиОтчета.Вставить("ГраницыЗаказыНаАвтомобили");
