Функция Reanult_НайтиСоздатьТиповуюСкидку() Экспорт
	
	Код = "RPARTSDISCOUNT";
	
	Скидка = Справочники.ТипыСкидок.НайтиПоКоду(Код);
	
	Если НЕ ЗначениеЗаполнено(Скидка) Тогда
		
		Скидка = Справочники.ТипыСкидок.СоздатьЭлемент();
		Скидка.Код = Код;
		Скидка.Наименование = "Скидка Renault P@rts";
		Скидка.ВидСкидки = Перечисления.ВидыСкидок.НаСтрокуДокумента;
		Скидка.РучнаяСкидка = Истина;
		Скидка.СпособВычисления = Перечисления.СкидкиСпособВычисления.Относительная;
		Скидка.ИспользоватьДляБэкОфиса = Истина;
		Скидка.Точность = 2;
		
		Попытка
			
			Скидка.Записать();
			
			Возврат Скидка.Ссылка;
			
		Исключение
			
			ЗаписьЖурналаРегистрации("Ошибка при создании скидки Renault P@rts", УровеньЖурналаРегистрации.Ошибка,
			,,Строка(ОписаниеОшибки()));
			Возврат Справочники.ТипыСкидок.ПустаяСсылка();
			
		КонецПопытки;
		
	Иначе
		
		Возврат Скидка;
		
	КонецЕсли;
	
КонецФункции

// Создает номенклатуру по артикулу из каталога
//   РегистрСведений.Renault_КаталогРеферансов
//   или возвращает ссылку на уже созданную
//
Функция ПолучитьНоменклатуруПоКаталогу(Артикул, Создавать=Ложь) Экспорт

    Возврат Renault_ЗапчастиСервер.ПолучитьНоменклатуруПоКаталогу(Артикул, Создавать);

КонецФункции
