///////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ СОБЫТИЙ
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
	//Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Процедура - обработчик события "Перед записью".
//
// Параметры:
//  Отказ - <Булево>
//        - Признак отказа от записи элемента. Если в теле
//          процедуры-обработчика установить данному параметру
//          значение Истина, запись элемента выполнена не будет.
//          Значение по умолчанию: Ложь.
//
Процедура ПередЗаписью(Отказ) 	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ОбменДанными.Загрузка Тогда
		Если ПустаяСтрока(Идентификатор) Тогда
			Renault_ОбщегоНазначения.СообщитьОбОшибке("Не указан идентификатор обработки обслуживания!");
			Отказ = Истина;
		Иначе
			Запрос = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|    СпрОбработки.Код КАК Код
			|ИЗ
			|    Справочник.Renault_ОбработкиОбслуживанияТО КАК СпрОбработки
			|ГДЕ
			|    СпрОбработки.Идентификатор = &Идентификатор
			|    И СпрОбработки.Ссылка <> &Ссылка");
			Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
			Запрос.УстановитьПараметр("Ссылка",        Ссылка);
			Запрос = Запрос.Выполнить();
			Если НЕ Запрос.Пустой() Тогда
				Запрос = Запрос.Выгрузить()[0];
				Renault_ОбщегоНазначения.СообщитьОбОшибке("Идентификатор """
				                 + Идентификатор
				                 + """ уже используется для элемента с кодом "
				                 + Запрос.Код);
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры  

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры
