// выгружает xml файл
Функция ВыгрузкаВXML(НастройкаОтправкиСообщений, ДокументСсылка) Экспорт
	НастройкаОтправкиСообщений = Справочники.НастройкаВыгрузкиОбъявленийНаСайт.СоздатьЭлемент();
	
	// создадим каталог и получим имя файла для выгрузки
	КаталогНазначение = НастройкаОтправкиСообщений.КаталогВыгрузкиФайлов;
	Если ЗначениеЗаполнено(КаталогНазначение) Тогда
		СоздатьКаталог(КаталогНазначение);
	КонецЕсли;
	
	ПутьКновомуФайлу = ПолучитьИмяВременногоФайла(".xml");
	
	Если ЗначениеЗаполнено(КаталогНазначение) Тогда
		ПутьКновомуФайлу = + "\" + ПолучитьКраткоеИмяФайла(ПутьКновомуФайлу);
	КонецЕсли;
	
	// сформируем файл xml
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ПутьКновомуФайлу,"UTF-8");
	
	// заполнение данных
	
	ЗаписьXML.Закрыть();
	
	Возврат ПутьКновомуФайлу;
КонецФункции

Функция ПолучитьКраткоеИмяФайла(ПолныйПутьКФайлу) Экспорт
	ПозицияСлеша = Найти(ПолныйПутьКФайлу,"\");
	Результат = ПолныйПутьКФайлу;
	
	Пока ПозицияСлеша > 0 Цикл
		Результат = Сред(Результат,ПозицияСлеша + 1);
		ПозицияСлеша = Найти(Результат,"\");
	КонецЦикла;
	
	Возврат Результат;
КонецФункции
