
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	Для Каждого Набор из ЭтотОбъект Цикл 
		Если Не ЗначениеЗаполнено(Набор.ПричинаБлокировки) Тогда 
			Отказ = Истина;
			Сообщить("Не указана причина блокировки"); 			
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Набор.Пользователь) Тогда 
			Отказ = Истина;
			Сообщить("Не указан пользователь установки блокировки"); 			
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Набор.ДатаБлокировки) Тогда 
			Отказ = Истина;
			Сообщить("Не указана дата блокировки"); 			
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры
