Процедура ДобавитьЗапись(РабочийЛистСобытие) Экспорт 
	Если ТипЗнч(РабочийЛистСобытие) = Тип("ДокументСсылка.РабочийЛист") Тогда
		СвойстваОбъекта = ПолучитьСвойстваРабочегоЛиста()
	ИначеЕсли ТипЗнч(РабочийЛистСобытие) = Тип("ДокументСсылка.Событие") Тогда 
		СвойстваОбъекта = ПолучитьСвойстваСобытия();
	Иначе
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи							= СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период					= ТекущаяДата();
	МенеджерЗаписи.РабочийЛистСобытие		= РабочийЛистСобытие[СвойстваОбъекта.РабочийЛистСобытие]; 
	//Иванченко 20260608 ++
	//МенеджерЗаписи.ПодразделениеКомпании	= РабочийЛистСобытие[СвойстваОбъекта.ПодразделениеКомпании];   
	//Иванченко 20260608 --	
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		Возврат;
	КонецЕсли;
	
	//Иванченко 20260611 ++
	Попытка
	//Иванченко 20260608 --
		МенеджерЗаписи.Период					= ТекущаяДата();
		МенеджерЗаписи.УникальныйИдентификатор	= Строка(РабочийЛистСобытие.УникальныйИдентификатор());
		Для Каждого Строка Из СвойстваОбъекта Цикл 
			Если Строка.Ключ = "Телефон" Тогда
				КорректировкаНомера = РабочийЛистСобытие[Строка.Значение];
				КорректировкаНомера = СтрЗаменить(КорректировкаНомера,",","");
				КорректировкаНомера = СтрЗаменить(КорректировкаНомера," ","");
				//Иванченко 20260608 ++
				КорректировкаНомера = СтрЗаменить(КорректировкаНомера,"+7","8");	
				//Иванченко 20260608 --
				МенеджерЗаписи[Строка.Ключ] = КорректировкаНомера;
			ИначеЕсли Строка.Ключ = "Бренд" Тогда
				Попытка
					МенеджерЗаписи[Строка.Ключ] = РабочийЛистСобытие.Модель.Марка;
				Исключение
					МенеджерЗаписи[Строка.Ключ] = "Нет в данном типе документа";
				КонецПопытки;
			ИначеЕсли Строка.Ключ = "ТипДокумента" Тогда
				Попытка
					МенеджерЗаписи[Строка.Ключ] = Строка(ТипЗнч(РабочийЛистСобытие));
				Исключение
					МенеджерЗаписи[Строка.Ключ] = "Нет в данном типе документа";
				КонецПопытки; 
				//Иванченко 20260608 ++ 
			ИначеЕсли Строка.Ключ = "ИсточникИнформации" Тогда
				МенеджерЗаписи.ИсточникCRM = РабочийЛистСобытие[Строка.Значение]; 
				//Иванченко 20260608 --	
			Иначе                                                   	
				Попытка
					МенеджерЗаписи[Строка.Ключ] = РабочийЛистСобытие[Строка.Значение];
				Исключение    
					МенеджерЗаписи[Строка.Ключ] = "Нет в данном типе документа";
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
		
		Если ТипЗнч(РабочийЛистСобытие) = Тип("ДокументСсылка.РабочийЛист") Тогда
			МенеджерЗаписи.РабочийЛистУникальныйИдентификатор = Строка(РабочийЛистСобытие.УникальныйИдентификатор())
		ИначеЕсли ТипЗнч(РабочийЛистСобытие) = Тип("ДокументСсылка.Событие") Тогда 
			МенеджерЗаписи.РабочийЛистУникальныйИдентификатор = Строка(РабочийЛистСобытие.ДокументОснование.УникальныйИдентификатор());
			МенеджерЗаписи.ПервичноеСобытие = ЭтоПервоеСобытие(РабочийЛистСобытие);
			МенеджерЗаписи.ПервичныйВизит	= ЭтоПервыйВизит(РабочийЛистСобытие);
			//Иванченко 20260608 ++   
			МенеджерЗаписи.ИсточникМаркетинг = ПолучитьИсточникМаркетинг(РабочийЛистСобытие); 
			МенеджерЗаписи.ЭтоМаркетинговыйЛид = ЭтоМаркетинговыйЛид(РабочийЛистСобытие); 
			
			Если РабочийЛистСобытие.Дозвонился = 0 Тогда
				
				Если РабочийЛистСобытие.КонтактНеСостоялся Тогда
					МенеджерЗаписи.УспешныйКонтакт = Ложь;	
				Иначе	
					СобытиеФорма = РабочийЛистСобытие.ПолучитьФорму();  
					МенеджерЗаписи.УспешныйКонтакт = Не СобытиеФорма.НеУдалосьСоединить;     
				КонецЕсли;
				
			ИначеЕсли РабочийЛистСобытие.Дозвонился = 1 Тогда 
				МенеджерЗаписи.УспешныйКонтакт = Истина; 
			Иначе
				МенеджерЗаписи.УспешныйКонтакт = Ложь; 
			КонецЕсли;		
			
			Если ТипЗнч(РабочийЛистСобытие.ДокументОснование) = Тип("ДокументСсылка.Событие") Тогда   
				Перем_Событие = РабочийЛистСобытие.ДокументОснование;
			Иначе
				Перем_Событие = РабочийЛистСобытие;
			КонецЕсли;
			
			Если ТипЗнч(Перем_Событие) = Тип("ДокументСсылка.ЗаявкаНаРемонт") Или ТипЗнч(Перем_Событие) = Тип("ДокументСсылка.РабочийЛистСервиса") Или ТипЗнч(Перем_Событие) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
				МенеджерЗаписи.ПризнакСервис = Истина;
			Иначе
				МенеджерЗаписи.ПризнакСервис = Ложь;
			КонецЕсли; 
			
			МенеджерЗаписи.ПризнакРобот = Ложь;
			
			Если РабочийЛистСобытие.ИсточникИнформации = Справочники.ИсточникиИнформации.НайтиПоКоду("ЦБ000149") ИЛИ РабочийЛистСобытие.ИсточникИнформации = Справочники.ИсточникиИнформации.НайтиПоНаименованию("BTL") Тогда
				МенеджерЗаписи.ПризнакBTL = Истина;
			Иначе 
				МенеджерЗаписи.ПризнакBTL = Ложь;
			КонецЕсли;	
			
			МенеджерЗаписи.ПричинаОтказа = РабочийЛистСобытие.ПричинаОтмены; 
			
			Если РабочийЛистСобытие.Дата = РабочийЛистСобытие.СМ_ДатаСоздания Тогда		
				МенеджерЗаписи.СозданЗаднимЧислом = Ложь;
			Иначе
				МенеджерЗаписи.СозданЗаднимЧислом = Истина;
			КонецЕсли;			
			
			//Иванченко 20260608 --
		КонецЕсли;
		
		МенеджерЗаписи.Записать(Ложь); 
	//Иванченко 20260608 ++
	Исключение
	КонецПопытки;
	//Иванченко 20260608 --  
		
КонецПроцедуры                 

Функция ПолучитьСвойстваРегистра()
	Возврат "РабочийЛистСобытие,ПодразделениеКомпании,ИсточникИнформации,Статус,Телефон,Бренд,ВидСобытия,Контрагент,ТипСообщения,ДатаНачала,ДатаОкончания,СМ_ДатаСоздания,РабочийЛист,НомерДокумента,ДатаДокумента,ТипДокумента";
КонецФункции   

Функция ПолучитьСвойстваРабочегоЛиста()
	Возврат Новый Структура(ПолучитьСвойстваРегистра()
	,"Ссылка","ПодразделениеКомпании","Реклама","Статус","КонтактныйТелефон","Модель","","Контрагент","","","","","Ссылка","Номер","Дата","");
КонецФункции

Функция ПолучитьСвойстваСобытия()
	Возврат Новый Структура(ПолучитьСвойстваРегистра()
	,"Ссылка","ПодразделениеКомпании","ИсточникИнформации","Состояние","ПредставлениеТелефона","","ВидСобытия","Контрагент","ТипСообщения","ДатаНачала","ДатаОкончания","СМ_ДатаСоздания","ДокументОснование","Номер","Дата",""); 
КонецФункции 

Процедура ДобавитьЗапись_Событие_ТонкаяНастройка(Событие,Период,РабочийЛист = "",Состояние = "") Экспорт
	СвойстваСобытия = ПолучитьСвойстваСобытия();  
	
	МенеджерЗаписи							= СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период					= Период;    
	МенеджерЗаписи.РабочийЛистСобытие		= Событие[СвойстваСобытия.РабочийЛистСобытие]; 
	//Иванченко 20260608 ++
	//МенеджерЗаписи.ПодразделениеКомпании	= Событие[СвойстваСобытия.ПодразделениеКомпании];    
	//Иванченко 20260608 --
	МенеджерЗаписи.Прочитать(); 
	
	Если МенеджерЗаписи.Выбран() Тогда 
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи.Период	= Период;	
	Для Каждого Строка Из СвойстваСобытия Цикл
		Если Строка.Ключ = "Телефон" Тогда
			КорректировкаНомера = Событие[Строка.Значение];
			КорректировкаНомера = СтрЗаменить(КорректировкаНомера,",","");
			КорректировкаНомера = СтрЗаменить(КорректировкаНомера," ","");
			МенеджерЗаписи[Строка.Ключ] = КорректировкаНомера;
		ИначеЕсли Строка.Ключ = "ТипДокумента" Тогда
			Попытка
				МенеджерЗаписи[Строка.Ключ] = Строка(ТипЗнч(Событие));
			Исключение
				МенеджерЗаписи[Строка.Ключ] = "Нет в данном типе документа";
			КонецПопытки;
		Иначе                                                   	
			Попытка
				МенеджерЗаписи[Строка.Ключ] = Событие[Строка.Значение];
			Исключение    
				МенеджерЗаписи[Строка.Ключ] = "Нет в данном типе документа";
			КонецПопытки;
		КонецЕсли;	
	КонецЦикла; 
	МенеджерЗаписи.ПервичноеСобытие = ЭтоПервоеСобытие(Событие);
	МенеджерЗаписи.ПервичныйВизит	= ЭтоПервыйВизит(Событие);
	МенеджерЗаписи.РабочийЛистУникальныйИдентификатор = Строка(Событие.ДокументОснование.УникальныйИдентификатор());
	МенеджерЗаписи.УникальныйИдентификатор = Строка(Событие.УникальныйИдентификатор());
	Если Состояние <> "" Тогда
		МенеджерЗаписи.Статус = Состояние;
	КонецЕсли;
	Попытка
		МенеджерЗаписи.Записать(Ложь);
	Исключение    
		//Сообщить("Не обработан " + Событие);
	КонецПопытки;
КонецПроцедуры        

Процедура ДобавитьЗапись_РабочийЛист_ТонкаяНастройка(РабочийЛист,Период) Экспорт
	СвойстваРабочегоЛиста = ПолучитьСвойстваРабочегоЛиста();  
	
	МенеджерЗаписи							= СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период					= Период;
	МенеджерЗаписи.РабочийЛистСобытие		= РабочийЛист[СвойстваРабочегоЛиста.РабочийЛистСобытие]; 
	//Иванченко 20260608 ++
	//МенеджерЗаписи.ПодразделениеКомпании	= РабочийЛист[СвойстваРабочегоЛиста.ПодразделениеКомпании];    
	//Иванченко 20260608 --
	МенеджерЗаписи.Прочитать(); 
	
	Если МенеджерЗаписи.Выбран() ИЛИ Не ЗначениеЗаполнено(Период) Тогда 
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи.Период	= Период;	
	Для Каждого Строка Из СвойстваРабочегоЛиста Цикл
		Если Строка.Ключ = "Телефон" Тогда
			КорректировкаНомера = РабочийЛист[Строка.Значение];
			КорректировкаНомера = СтрЗаменить(КорректировкаНомера,",","");
			КорректировкаНомера = СтрЗаменить(КорректировкаНомера," ","");
			МенеджерЗаписи[Строка.Ключ] = КорректировкаНомера;
		ИначеЕсли Строка.Ключ = "Бренд" Тогда
			МенеджерЗаписи[Строка.Ключ] = РабочийЛист.Модель.Марка;
		ИначеЕсли Строка.Ключ = "ТипДокумента" Тогда
			Попытка
				МенеджерЗаписи[Строка.Ключ] = Строка(ТипЗнч(РабочийЛист));
			Исключение
				МенеджерЗаписи[Строка.Ключ] = "Нет в данном типе документа";
			КонецПопытки;
		Иначе                                                   	
			Попытка
				МенеджерЗаписи[Строка.Ключ] = РабочийЛист[Строка.Значение];
			Исключение    
				МенеджерЗаписи[Строка.Ключ] = "Нет в данном типе документа";
			КонецПопытки;
		КонецЕсли;	
	КонецЦикла;
	МенеджерЗаписи.РабочийЛистУникальныйИдентификатор = Строка(РабочийЛист.УникальныйИдентификатор());
	МенеджерЗаписи.УникальныйИдентификатор = Строка(РабочийЛист.УникальныйИдентификатор());
	Попытка
		МенеджерЗаписи.Записать(Ложь);
	Исключение    
		//Сообщить("Не обработан " + РабочийЛист);
	КонецПопытки;
КонецПроцедуры

Функция ЭтоПервоеСобытие(Событие) 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Событие.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Событие КАК Событие
		|ГДЕ
		|	Событие.ДокументОснование = &ДокументОснование
		|	И Событие.Дата <= &ДатаСобытия";
	
	Запрос.УстановитьПараметр("ДатаСобытия"			, Событие.Дата);
	Запрос.УстановитьПараметр("ДокументОснование"	, Событие.ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	КоличествоЗаписей = РезультатЗапроса.Количество();
	Если КоличествоЗаписей = 0 Тогда
		Возврат Истина;
	ИначеЕсли КоличествоЗаписей = 1 Тогда
		СсылкаЗапроса = РезультатЗапроса[0].Ссылка;
		ТекущаяСсылка = Событие;
		Если СсылкаЗапроса = ТекущаяСсылка Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции  

Функция ЭтоПервыйВизит(Событие)
	Если Событие.ВидСобытия <> Перечисления.ВидыСобытий.ЛичнаяВстреча Тогда
		Возврат Ложь;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Событие.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Событие КАК Событие
		|ГДЕ
		|	Событие.ДокументОснование = &ДокументОснование
		|	И Событие.Дата <= &ДатаСобытия
		|	И Событие.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ЛичнаяВстреча)";
	
	Запрос.УстановитьПараметр("ДатаСобытия"			, Событие.Дата);
	Запрос.УстановитьПараметр("ДокументОснование"	, Событие.ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	КоличествоЗаписей = РезультатЗапроса.Количество();
	Если КоличествоЗаписей = 0 Тогда
		Возврат Истина;
	ИначеЕсли КоличествоЗаписей = 1 Тогда
		СсылкаЗапроса = РезультатЗапроса[0].Ссылка;
		ТекущаяСсылка = Событие;
		Если СсылкаЗапроса = ТекущаяСсылка Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции

//Иванченко 20260608 ++
Функция ЭтоМаркетинговыйЛид(Событие)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	МАКСИМУМ(МаркетинговыеЛиды.Период) КАК Период
	|ИЗ
	|	РегистрСведений.МаркетинговыеЛиды КАК МаркетинговыеЛиды
	|ГДЕ
	|	МаркетинговыеЛиды.ПодразделениеКомпании = &ПодразделениеКомпании
	|	И МаркетинговыеЛиды.Телефон = &Телефон
	|	И МаркетинговыеЛиды.Статус = ЗНАЧЕНИЕ(Перечисление.СостоянияСобытий.Завершено)");
    Запрос.УстановитьПараметр("ПодразделениеКомпании", Событие.ПодразделениеКомпании);
	КорректировкаНомера = СтрЗаменить(Событие.ПредставлениеТелефона,",", "");
	КорректировкаНомера = СтрЗаменить(КорректировкаНомера," ", "");
	КорректировкаНомера = СтрЗаменить(КорректировкаНомера,"+7", "8");	
    Запрос.УстановитьПараметр("Телефон", КорректировкаНомера);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если обЗначениеНеЗаполнено(Выборка.Период) ИЛИ (НачалоДня(ТекущаяДата()) - НачалоДня(Выборка.Период)) / 86400 > 30 Тогда
			ЭтоМаркетинговыйЛид = Истина;
		Иначе 
			ЭтоМаркетинговыйЛид = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЭтоМаркетинговыйЛид; 

КонецФункции

Функция ПолучитьИсточникМаркетинг(Событие)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	МАКСИМУМ(ВЫРАЗИТЬ(МаркетинговыеЛиды.РабочийЛистСобытие КАК Документ.Событие)) КАК РабочийЛист
	|ИЗ
	|	РегистрСведений.МаркетинговыеЛиды КАК МаркетинговыеЛиды
	|ГДЕ
	|	МаркетинговыеЛиды.ТипДокумента = ""Рабочий лист""
	|	И МаркетинговыеЛиды.Телефон = &Телефон
	|	И МаркетинговыеЛиды.РабочийЛистСобытие.ПодразделениеКомпании = &ПодразделениеКомпании
	|	И МаркетинговыеЛиды.РабочийЛистСобытие.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Продажа)");
    Запрос.УстановитьПараметр("ПодразделениеКомпании", Событие.ПодразделениеКомпании);
	КорректировкаНомера = СтрЗаменить(Событие.ПредставлениеТелефона,",", "");
	КорректировкаНомера = СтрЗаменить(КорректировкаНомера," ", "");
	КорректировкаНомера = СтрЗаменить(КорректировкаНомера,"+7", "8");	
    Запрос.УстановитьПараметр("Телефон", КорректировкаНомера);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если обЗначениеНеЗаполнено(Выборка.РабочийЛист) Тогда
			ИсточникМаркетинг = Событие.ИсточникИнформации; 
		Иначе
			ИсточникМаркетинг = Выборка.РабочийЛист.Реклама;			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ИсточникМаркетинг;
	
КонецФункции
//Иванченко 20260608 -- 