Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//Проверки
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_БСО_ПриходБланковСтрогойОтчетностиСписокБСО.НомерБСО
		|ПОМЕСТИТЬ ДокТЧНомераБСО
		|ИЗ
		|	Документ.Renault_БСО_ПриходБланковСтрогойОтчетности.СписокБСО КАК Renault_БСО_ПриходБланковСтрогойОтчетностиСписокБСО
		|ГДЕ
		|	Renault_БСО_ПриходБланковСтрогойОтчетностиСписокБСО.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДокТЧНомераБСО.НомерБСО) КАК КоличествоРазличныхНомеровБСО
		|ИЗ
		|	ДокТЧНомераБСО КАК ДокТЧНомераБСО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПРЕДСТАВЛЕНИЕ(Renault_БСО_ПриходБланковСтрогойОтчетностиСписокБСО.Ссылка) КАК ДокументПриход,
		|	Renault_БСО_ПриходБланковСтрогойОтчетностиСписокБСО.НомерБСО КАК НомерБСО
		|ИЗ
		|	Документ.Renault_БСО_ПриходБланковСтрогойОтчетности.СписокБСО КАК Renault_БСО_ПриходБланковСтрогойОтчетностиСписокБСО
		|ГДЕ
		|	Renault_БСО_ПриходБланковСтрогойОтчетностиСписокБСО.Ссылка.Проведен
		|	И Renault_БСО_ПриходБланковСтрогойОтчетностиСписокБСО.Ссылка.БланкСтрогойОтчетности = &БланкСтрогойОтчетности
		|	И Renault_БСО_ПриходБланковСтрогойОтчетностиСписокБСО.Ссылка.Серия = &Серия
		|	И Renault_БСО_ПриходБланковСтрогойОтчетностиСписокБСО.НомерБСО В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ДокТЧНомераБСО.НомерБСО
		|			ИЗ
		|				ДокТЧНомераБСО КАК ДокТЧНомераБСО)
		|	И Renault_БСО_ПриходБланковСтрогойОтчетностиСписокБСО.Ссылка <> &Ссылка";	
	Запрос.УстановитьПараметр("БланкСтрогойОтчетности", БланкСтрогойОтчетности);
	Запрос.УстановитьПараметр("Серия", Серия);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	Результат = Запрос.ВыполнитьПакет();
	
	//Проверка на наличие дублей номеров в документе
	Выборка = Результат[1].Выбрать();	
	Выборка.Следующий();
	
	КоличествоНомеровБСО = СписокБСО.Количество();
	
	Если Выборка.КоличествоРазличныхНомеровБСО <> КоличествоНомеровБСО Тогда
		Сообщить("В документе встречаются одинаковые номера БСО!");
		
		Отказ = Истина;		
	КонецЕсли;
	
	//Проверка на наличие дублей в базе
	Если НЕ Результат[2].Пустой() Тогда
		Выборка = Результат[2].Выбрать();		
		 
		Пока Выборка.Следующий() Цикл
			Сообщить("Номер - " + Выборка.НомерБСО + ", встречается в приходном документе - " + Выборка.ДокументПриход + ".");
		КонецЦикла;
		
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 	
	
	//Проведение
	Движения.Renault_БСО_СтатусыБСО.Записывать = Истина;
	Движения.Renault_БСО_СтатусыБСО.Очистить();
	
	СтатусВНаличии = Перечисления.Renault_БСО_СтатусыБланковСтрогойОтчетности.ВНаличии;
	
	Для Каждого Строка Из СписокБСО Цикл
		Движение = Движения.Renault_БСО_СтатусыБСО.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Подразделение = Подразделение;
		Движение.НаименованиеБСО = БланкСтрогойОтчетности;
		Движение.СерияБСО = Серия;
		Движение.НомерБСО = Строка.НомерБСО;
		Движение.Статус = СтатусВНаличии;
	КонецЦикла;

	Движения.Renault_БСО_УчетБланковСтрогойОтчетности.Записывать = Истина;
	Движения.Renault_БСО_УчетБланковСтрогойОтчетности.Очистить();
	
	Для Каждого Строка Из СписокБСО Цикл
		Движение = Движения.Renault_БСО_УчетБланковСтрогойОтчетности.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Подразделение = Подразделение;
		Движение.НаименованиеБСО = БланкСтрогойОтчетности;
		Движение.СерияБСО = Серия;
		Движение.НомерБСО = Строка.НомерБСО;
		Движение.Количество = 1;
	КонецЦикла;
КонецПроцедуры
