
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	
	СтандартнаяОбработка = Ложь;
	
	//ПараметрыОтчета = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы;
	//
	//ПараметрПериод 		   = ПараметрыОтчета.Найти("Период");
	//ПараметрДилерскийЦентр = ПараметрыОтчета.Найти("ДилерскийЦентр");
	//ПараметрКоличествоДней = ПараметрыОтчета.Найти("КоличествоДней");
	//ПараметрДатаНачала 	   = ПараметрыОтчета.Найти("ДатаНачала");
	//ПараметрДатаОкончания  = ПараметрыОтчета.Найти("ДатаОкончания");
	//
	//Период = Новый СтандартныйПериод;
	//Период.Вариант 	 	 = ВариантСтандартногоПериода.ПроизвольныйПериод;
	//Период.ДатаНачала 	 = ДатаНачала;
	//Период.ДатаОкончания = ?(ДатаОкончания = Дата('00010101'),ДатаОкончания,КонецДня(ДатаОкончания));
	//
	//мПараметрПериод 		= КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрПериод.ИдентификаторПользовательскойНастройки);
	//мПараметрДатаНачала     = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрДатаНачала.ИдентификаторПользовательскойНастройки);
	//мПараметрДатаОкончания  = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрДатаОкончания.ИдентификаторПользовательскойНастройки);
	//мПараметрДилерскийЦентр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрДилерскийЦентр.ИдентификаторПользовательскойНастройки);
	//мПараметрКоличествоДней = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрКоличествоДней.ИдентификаторПользовательскойНастройки);
	//
	//Если мПараметрДатаНачала = Неопределено Тогда
	//	ПараметрДатаНачала.Значение = ДатаНачала;
	//Иначе 
	//	мПараметрДатаНачала.Значение = ДатаНачала;
	//КонецЕсли;
	//
	//Если мПараметрДатаОкончания = Неопределено Тогда
	//	ПараметрДатаОкончания.Значение = ?(ДатаОкончания = Дата('00010101'),ДатаОкончания,КонецДня(ДатаОкончания));;
	//Иначе 
	//	мПараметрДатаОкончания.Значение = ?(ДатаОкончания = Дата('00010101'),ДатаОкончания,КонецДня(ДатаОкончания));;
	//КонецЕсли;
	//
	//Если мПараметрПериод = Неопределено Тогда
	//	ПараметрПериод.Значение = Период;
	//Иначе 
	//	мПараметрПериод.Значение = Период;
	//КонецЕсли;
	//
	//Если мПараметрДилерскийЦентр = Неопределено Тогда
	//	ПараметрДилерскийЦентр.Значение = ДилерскийЦентр;
	//Иначе 
	//	мПараметрДилерскийЦентр.Значение = ДилерскийЦентр;
	//КонецЕсли; 
	//
	//Если мПараметрКоличествоДней = Неопределено Тогда
	//	ПараметрКоличествоДней.Значение = КоличествоДней;
	//Иначе 
	//	мПараметрКоличествоДней.Значение = КоличествоДней;
	//КонецЕсли; 
	
	мНастройкиОтчета =  КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрыОтчета = мНастройкиОтчета.ПараметрыДанных.Элементы;
	
	ПараметрПериод 		   = ПараметрыОтчета.Найти("Период");
	ПараметрДилерскийЦентр = ПараметрыОтчета.Найти("ДилерскийЦентр");
	ПараметрКоличествоДней = ПараметрыОтчета.Найти("КоличествоДней");
	ПараметрДатаНачала 	   = ПараметрыОтчета.Найти("ДатаНачала");
	ПараметрДатаОкончания  = ПараметрыОтчета.Найти("ДатаОкончания");
	
	Период = Новый СтандартныйПериод;
	Период.Вариант 	 	 = ВариантСтандартногоПериода.ПроизвольныйПериод;
	Период.ДатаНачала 	 = ДатаНачала;
	Период.ДатаОкончания = ?(ДатаОкончания = Дата('00010101'),ДатаОкончания,КонецДня(ДатаОкончания));
	
	ПараметрДатаНачала.Значение     = ДатаНачала;
	ПараметрДатаОкончания.Значение  = ?(ДатаОкончания = Дата('00010101'),ДатаОкончания,КонецДня(ДатаОкончания));
	ПараметрПериод.Значение 	    = Период;
	ПараметрДилерскийЦентр.Значение = ДилерскийЦентр;
	ПараметрКоличествоДней.Значение = КоличествоДней;	
	
	КомпоновщикМакет = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	Макет = КомпоновщикМакет.Выполнить(СхемаКомпоновкиДанных, мНастройкиОтчета, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет, , ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ДокументРезультат.ПоказатьУровеньГруппировокСтрок(1);
	
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ДокументРезультат.АвтоМасштаб = Истина;	
	
КонецПроцедуры
