
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Если НЕ ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Использование Тогда
		ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Использование = Истина;
		ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение = Дата(1,1,1);
	КонецЕсли;
	Если НЕ ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].Использование Тогда
		ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].Использование = Истина;
		ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].Значение = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры
