
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЭлементыОтбора = Список1.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементыОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементыОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементыОтбора.Использование = Истина;
	ЭлементыОтбора.ПравоеЗначение = ЭтаФорма.Параметры.Контрагент;
		
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЭтоДоверенноЛицо(Команда)
	
	Закрыть(ТекущийЭлемент.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Закрыть(ТекущийЭлемент.ТекущиеДанные);
КонецПроцедуры


&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	ФормаЗаписи = РегистрыСведений.Renault_Advanced_ДоверенныеЛицаКонтрагентов.ПолучитьФорму("ФормаЗаписи", Элемент);
	
	Для Каждого ЭлементОтбора Из ЭтаФорма.Список1.Отбор.Элементы Цикл
		Если ЭлементОтбора.Использование И ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно И ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("СправочникСсылка.Контрагенты") Тогда
			ФормаЗаписи.Владелец = ЭлементОтбора.ПравоеЗначение;
		КонецЕсли;
	КонецЦикла;
	
	ФормаЗаписи.Открыть();

	
КонецПроцедуры

