
Функция ПолучитьДанныеПечати(знач МассивДокументов, знач МассивИменМакетов) Экспорт
	
	ДанныеПоВсемОбъектам = Новый Соответствие;
	
	Для Каждого ОбъектСсылка Из МассивДокументов Цикл
		ДанныеОбъектаПоМакетам = Новый Соответствие;
		Для Каждого ИмяМакета Из МассивИменМакетов Цикл
			ДанныеОбъектаПоМакетам.Вставить(ИмяМакета, ПолучитьДанныеОбъекта(ОбъектСсылка, ИмяМакета));
		КонецЦикла;
		ДанныеПоВсемОбъектам.Вставить(ОбъектСсылка, ДанныеОбъектаПоМакетам);
	КонецЦикла;
	
	ОписаниеОбластей = Новый Соответствие;
	ОписаниеОбластей.Вставить(ИмяМакета, ПолучитьОписаниеОбластейМакетаОфисногоДокумента());
	ДвоичныеДанныеМакетов = Новый Соответствие;
	ТипыМакетов = Новый Соответствие;
	
	Для Каждого ИмяМакета Из МассивИменМакетов Цикл
		
	КонецЦикла;
	
	Возврат Новый Структура("Данные, Макеты",
							ДанныеПоВсемОбъектам,
							Новый Структура("ОписаниеОбластей, ТипыМакетов, ДвоичныеДанныеМакетов",
											ОписаниеОбластей,
											ТипыМакетов,
											ДвоичныеДанныеМакетов));
	
КонецФункции

Функция ПолучитьДанныеОбъекта(СсылкаНаОбъект, ИмяМакета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	КартыЛояльности.Ссылка,
		|	КартыЛояльности.ВерсияДанных,
		|	КартыЛояльности.ПометкаУдаления,
		|	КартыЛояльности.Предопределенный,
		|	КартыЛояльности.Код,
		|	КартыЛояльности.Наименование,
		|	КартыЛояльности.Контрагент,
		|	КартыЛояльности.Примечание,
		|	КартыЛояльности.ДатаВыдачи,
		|	КартыЛояльности.КемВыдана,
		|	КартыЛояльности.Недействительна,
		|	КартыЛояльности.ДилерскийЦентр,
		|	КартыЛояльности.ПрограммаЛояльности,
		|	КартыЛояльности.DMS_ВидКартыЛояльности КАК DMS_ВидКартыЛояльности,
		|	КартыЛояльности.DMS_ТипКарты КАК DMS_ТипКарты,
		|	КартыЛояльности.DMS_КартаЗамены КАК DMS_КартаЗамены
		|ИЗ
		|	Справочник.Renault_КартыЛояльности КАК КартыЛояльности
		|ГДЕ
		|	КартыЛояльности.Ссылка = &Ссылка";
				   
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеОбъекта = Новый Структура;
	
	Для каждого ТекущаяКолонка Из РезультатЗапроса.Колонки Цикл
		ДанныеОбъекта.Вставить(ТекущаяКолонка.Имя);
	КонецЦикла; 
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеОбъекта,Выборка);
	КонецЕсли; 
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Функция ПолучитьОписаниеОбластейМакетаОфисногоДокумента()
	
	ОписаниеОбластей = Новый Структура;
	
	Renault_УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Заголовок", "Общая");
	
	Возврат ОписаниеОбластей;
	
КонецФункции

