Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
	//Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(DMS_ВидКартыЛояльности) Тогда
		DMS_ТипКарты = DMS_ВидКартыЛояльности.ТипКарты;
	Иначе 
		DMS_ТипКарты = Неопределено;
	КонецЕсли; 
	
	#Если Клиент Тогда
		
		Если ЭтотОбъект.ЭтоНовый() Тогда
			
			ОтборДЦ = Renault_РаботаСПравамиПользователя.ДилерскийЦентрПоУмолчанию(ПараметрыСеанса.Пользователь);
			
			ДилерскийЦентр = ОтборДЦ;
			ДатаВыдачи = ТекущаяДата();
			КемВыдана = ПараметрыСеанса.Пользователь.Сотрудник;
	
			// Проверка на доступ к работе с АРМ
			Если НЕ Renault_РаботаСПравамиПользователя.ЕстьПравоВыдаватьКартуВручную(ПараметрыСеанса.Пользователь) Тогда
				Предупреждение("У вас нет прав выдачу карты вручную.");
				Отказ=Истина;
				Возврат;		
			КонецЕсли;
			
		КонецЕсли;
		
	#КонецЕсли

	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры
