
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.Renault_ПрограммыЛояльности")).ЭтоНовый() Тогда
		Если Объект.Загруженная Тогда
			Элементы.ГруппаСтраницыЗапчасти.ТекущаяСтраница = Элементы.ГруппаЗапчастиСтраницаЦентральная;
			Элементы.ГруппаСтраницыРаботы.ТекущаяСтраница = Элементы.ГруппаРаботыСтраницаЦентраль;
			Элементы.ДекорацияЗагруженаИзЦентраль.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПривестиЗначениеКНорме(Значение, ГраницаНиз, ГраницаВерх)
	
	Если Значение < ГраницаНиз Тогда
		Значение = ГраницаНиз;
	КонецЕсли;
	
	Если Значение > ГраницаВерх Тогда
		Значение = ГраницаВерх;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапчастиСкидкаВнутренняя1ПриИзменении(Элемент)
	
	ПривестиЗначениеКНорме(Объект.ЗапчастиСкидкаВнутренняя, Объект.ЗапчастиСкидкаВнутренняяОт, Объект.ЗапчастиСкидкаВнутренняяДо);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапчастиСкидкаВнешняя1ПриИзменении(Элемент)
	
	ПривестиЗначениеКНорме(Объект.ЗапчастиСкидкаВнешняя, Объект.ЗапчастиСкидкаВнешняяОт, Объект.ЗапчастиСкидкаВнешняяДо);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапчастиКурсБаллов1ПриИзменении(Элемент)
	
	ПривестиЗначениеКНорме(Объект.ЗапчастиКурсБаллов, Объект.ЗапчастиКурсБалловОт, Объект.ЗапчастиКурсБалловДо);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапчастиМаксимумБалловОплата1ПриИзменении(Элемент)
	
	ПривестиЗначениеКНорме(Объект.ЗапчастиМаксимумБалловОплата, Объект.ЗапчастиМаксимумБалловОплатаОт, Объект.ЗапчастиМаксимумБалловОплатаДо);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапчастиМаксимумБалловОплатаПроцент1ПриИзменении(Элемент)
	
	ПривестиЗначениеКНорме(Объект.ЗапчастиМаксимумБалловОплатаПроцент, Объект.ЗапчастиМаксимумБалловОплатаПроцентОт, Объект.ЗапчастиМаксимумБалловОплатаПроцентДо);
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыСкидкаВнутренняя1ПриИзменении(Элемент)
	
	ПривестиЗначениеКНорме(Объект.РаботыСкидкаВнутренняя, Объект.РаботыСкидкаВнутренняяОт, Объект.РаботыСкидкаВнутренняяДо);
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыСкидкаВнешняя1ПриИзменении(Элемент)
	
	ПривестиЗначениеКНорме(Объект.РаботыСкидкаВнешняя, Объект.РаботыСкидкаВнешняяОт, Объект.РаботыСкидкаВнешняяДо);
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыКурсБаллов1ПриИзменении(Элемент)
	
	ПривестиЗначениеКНорме(Объект.РаботыКурсБаллов, Объект.РаботыКурсБалловОт, Объект.РаботыКурсБалловДо);
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыМаксимумБалловОплата1ПриИзменении(Элемент)
	
	ПривестиЗначениеКНорме(Объект.РаботыМаксимумБалловОплата, Объект.РаботыМаксимумБалловОплатаОт, Объект.РаботыМаксимумБалловОплатаДо);
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыМаксимумБалловОплатаПроцент1ПриИзменении(Элемент)
	
	ПривестиЗначениеКНорме(Объект.РаботыМаксимумБалловОплатаПроцент, Объект.РаботыМаксимумБалловОплатаПроцентОт, Объект.РаботыМаксимумБалловОплатаПроцентДо);
	
КонецПроцедуры
