&НаСервере
Процедура УстановитьОбъект()
	
	Попытка
		ОбъектСсылка = ЗначениеИзСтрокиВнутр(ЗначениеОбъекта);
		Если НЕ Renault_внОбщийМодуль.ЭтаСсылкаСуществуетВИБ(ЗначениеОбъекта) Тогда
			Если Событие = 4 ИЛИ Событие = 9 ИЛИ Событие = 10 Тогда
				ОбъектСсылка = "<Объект недоступен для открытия>";
			Иначе
				ОбъектСсылка = "<Объект был физически удален>";
			КонецЕсли;
		Иначе			
			Элементы.ОбъектСсылка.КнопкаОткрытия = Истина;
		КонецЕсли;		
	Исключение
		Если Событие = 4 ИЛИ Событие = 9 ИЛИ Событие = 10 ИЛИ (Событие = 8 И Найти(МетаданныеОбъекта, "РегистрСведений.") > 0) Тогда
			ОбъектСсылка = "<Объект недоступен для открытия>";
		Иначе
			ОбъектСсылка = Строка(ПредставлениеОбъекта);
		КонецЕсли;
		Элементы.ОбъектСсылка.КнопкаОткрытия = Ложь;
	КонецПопытки;
		
	Элементы.ОбъектСсылка.КнопкаВыбора = Ложь;
	Элементы.ОбъектСсылка.КнопкаОчистки = Ложь;
	
	СсылкаНаУзелРИБ = Справочники.Renault_внУзлыРИБ.НайтиПоНаименованию(УзелРИБ);
	Если СсылкаНаУзелРИБ <> Неопределено Тогда
		УзелРИБ = СсылкаНаУзелРИБ;
		Элементы.УзелРИБ.КнопкаОткрытия 	= Истина;
		Элементы.УзелРИБ.КнопкаВыбора		= Ложь;
		Элементы.УзелРИБ.КнопкаОчистки 	= Ложь;		
	КонецЕсли;
	
КонецПроцедуры // УстановитьОбъект
	
&НаСервере
Процедура ЗагрузитьИзменения()
	// Переносим ТЧ
	Если Сжат Тогда		
		Изменения = Renault_внОбщийМодуль.ПолучитьИзмененияПоОбъекту(Код);
	Иначе
		Изменения = Renault_внОбщийМодуль.ПолучитьИзмененияПоОбъектуВКэше(Код, УзелРИБ);
	КонецЕсли;	
	
	// Загружаем в дерево
	Если Изменения <> Неопределено Тогда
		Дерево = ДанныеФормыВЗначение(ДеревоИзменений, Тип("ДеревоЗначений"));
		Renault_внОбщийМодуль.ЗаполнитьДеревоИзменений(Изменения, Дерево);		
		ЗначениеВРеквизитФормы(Дерево, "ДеревоИзменений");
		
		Элементы.ДеревоИзменений.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВерхнийУровень;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НайтиВСписке(Команда)
	Если ВладелецФормы <> Неопределено Тогда
		ВладелецФормы.Открыть();
	Иначе
		ОткрытьФорму("Обработка.Renault_внЖурналРегистрации.Форма.ФормаУправляемая");
	КонецЕсли;
	Оповестить("внПерейтиНаТекущуюЗапись", Код, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОбъект();
	ЗагрузитьИзменения();
	
	// Доступность
	Элементы.ФормаПоказатьИзмененияНаФорме.Видимость = 
		Событие <> 4
		И Событие <> 9 
		И Событие <> 10
		И Найти(МетаданныеОбъекта, "Константа.") <> 1
		И Найти(МетаданныеОбъекта, "РегистрСведений.") <> 1;
		
	// Показываем статус сжатия события
	СтатусСжатия = ?(Сжат, "Событие сжато и отображает все изменения", "Событие не сжато и не показывает всех изменений объекта!");
	Элементы.СтатусСжатия.Подсказка = ?(Сжат, "Все изменения события показаны в табличной части", "Если событие не сжато, то в нем не показывается информация о том, что было в объекте изменено, а что нет. При сжатии, эта информация появится.");
	Элементы.СтатусСжатия.ЦветТекста = ?(Сжат, WebЦвета.Зеленый, WebЦвета.Красный);
КонецПроцедуры

&НаКлиенте
Процедура ЗапретОчистки(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ЗапретНачалаВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаСервере
Функция НайтиСсылку(Стр)
	Если Renault_внОбщийМодуль.ЭтаСсылкаСуществуетВИБ(Стр) Тогда
		Ссылка = ЗначениеИзСтрокиВнутр(Стр);
	Иначе
		Ссылка = Неопределено;
	КонецЕсли;
	Возврат Ссылка
КонецФункции

&НаКлиенте
Процедура ДеревоИзмененийПередНачаломИзменения(Элемент, Отказ)	
	Отказ = Истина;
	
	Попытка
		Если Элементы.ДеревоИзменений.ТекущийЭлемент.Имя = "ДеревоИзмененийСтароеПредставление" Тогда			
			СсылкаНовая = Элементы.ДеревоИзменений.ТекущиеДанные.ЗначениеСтарое;
		ИначеЕсли Элементы.ДеревоИзменений.ТекущийЭлемент.Имя = "ДеревоИзмененийНовоеПредставление" Тогда
			СсылкаНовая = Элементы.ДеревоИзменений.ТекущиеДанные.ЗначениеНовое;
		КонецЕсли;		
		
		Ссылка = НайтиСсылку(СсылкаНовая);
		Если Ссылка <> Неопределено Тогда
			ОткрытьЗначение(Ссылка);
		КонецЕсли;
	Исключение
	КонецПопытки;		
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоТекущемуОбъекту(Команда)
	Если ВладелецФормы <> Неопределено Тогда
		ВладелецФормы.Открыть();
	Иначе
		ОткрытьФорму("Обработка.Renault_внЖурналРегистрации.Форма.ФормаУправляемая");
	КонецЕсли;
	Оповестить("внВсеСобытияПоОбъекту", ЗначениеОбъекта, ЭтаФорма);	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИзмененияНаФорме(Команда)
		
	ТипОбъекта = Событие;	
	
	// Константа и входы, выходы
	Если ТипОбъекта = 4 ИЛИ ТипОбъекта = 9 ИЛИ ТипОбъекта = 10 ИЛИ ПустаяСтрока(ОбъектСсылка) Тогда
		#Если Клиент Тогда
		Предупреждение("Для данного типа объектов изменения не показываются на форме!", 10);
		#КонецЕсли
		Возврат;
	КонецЕсли;
	
		
	Попытка
		П = Новый Структура("Ключ", ОбъектСсылка);
		Форма = ПолучитьФорму(МетаданныеОбъекта + ".ФормаОбъекта", П);
		ЭлементыФормыОбъекта = Форма.Элементы;
		
		СтрДатаИзмененияПлюсПользователь = Формат(ДатаИзменения, "ДФ='dd.MM.yyyy HH:mm:ss'") + " " + Пользователь;
		
		Изменения = ПолучитьИзмененияПоОбъекту(Код);
	Исключение
		#Если Клиент Тогда
		Предупреждение("Для данного типа объектов изменения не показываются на форме!", 10);
		#КонецЕсли
		Возврат;
	КонецПопытки;	
	
	Для Каждого Строки Из Изменения Цикл
		// Перебор всех реквизитов на форме
		Для Каждого Элемент Из ЭлементыФормыОбъекта Цикл
			
			//Элемент = ЭлементыФормыОбъекта[Индекс];
			Если Строки.НомерСтрокиТЧ = 0 Тогда
				
				// ШАПКА
				Если ВРег(Элемент.Имя) = ВРег(Строки.ИмяРеквизита) Тогда
					Если Строки.ПредставлениеСтарое = Строки.ПредставлениеНовое И
						Строки.ПредставлениеНовое = "" Тогда
						СтрокаЗначений = "";
					Иначе
						СтрокаЗначений = 
						" '" + Строки.ПредставлениеСтарое + "' => " +
						" '" + Строки.ПредставлениеНовое + "'"
					КонецЕсли;
					
					Попытка
						Элемент.Подсказка = СтрДатаИзмененияПлюсПользователь + СтрокаЗначений;
						Элемент.ЦветРамки = WebЦвета.Красный;
					Исключение
					КонецПопытки;
				КонецЕсли;
			Иначе
				// ТЧ
				Если ВРег(Элемент.Имя) = ВРег(Строки.ИмяТЧ) Тогда
					Попытка
						Элемент.Подсказка =	СтрДатаИзмененияПлюсПользователь;
						Элемент.ЦветРамки = WebЦвета.Красный;
					Исключение
					КонецПопытки;					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Форма.Открыть();
КонецПроцедуры

&НаСервере
Функция ПолучитьИзмененияПоОбъекту(Код)
	Изменения = Renault_внОбщийМодуль.ПолучитьИзмененияПоОбъекту(Код);
	
	Массив = Новый Массив();
	Для Каждого Строки Из Изменения Цикл
		Соответствие = Новый Структура("НомерСтроки,ИмяТЧ,ИмяРеквизита,НомерСтрокиТЧ,ЗначениеСтарое,ЗначениеНовое,ПредставлениеСтарое,ПредставлениеНовое,ТипРеквизита");
		ЗаполнитьЗначенияСвойств(Соответствие, Строки);
		Массив.Добавить(Соответствие);
	КонецЦикла;
	
	Возврат Массив; 
КонецФункции

&НаКлиенте
Процедура Развернуть(Команда)
	КоллекцияЭлементовДерева = ДеревоИзменений.ПолучитьЭлементы();
	//Свернуть дерево 
	Для Каждого Строки Из КоллекцияЭлементовДерева Цикл
		ИдентификаторСтроки	= Строки.ПолучитьИдентификатор();
		Элементы.ДеревоИзменений.Развернуть(ИдентификаторСтроки, Истина);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Свернуть(Команда)
	КоллекцияЭлементовДерева = ДеревоИзменений.ПолучитьЭлементы();
	//Свернуть дерево 
	Для Каждого Строки Из КоллекцияЭлементовДерева Цикл
		ИдентификаторСтроки	= Строки.ПолучитьИдентификатор();
		Элементы.ДеревоИзменений.Свернуть(ИдентификаторСтроки);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УзелРИБОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
