&НаКлиенте
Процедура НазваниеСайтаНажатие(Элемент)
	ПереходНаСайт();
КонецПроцедуры

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	ПереходНаСайт();
КонецПроцедуры

&НаКлиенте
Процедура ПереходНаСайт()
	ЗапуститьПриложение("https:\\www.nirax.ru");
КонецПроцедуры

&НаКлиенте
Процедура НажатиеОк(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.ЗакрыватьПриЗакрытииВладельца=Истина;
	Значения = ЭтаФорма.ВладелецФормы.Объект;
	Элементы.Название.Заголовок = "Ниракс: Помощник автобизнеса " + Значения.Лицензия + " " + Значения.Версия; // + Символы.ПС + "для конфигурации """ + Значения.ПредставлениеКонфигурации + """";
КонецПроцедуры
