//////////////////////////////////////////
// Rarus

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ
Перем ОписаниеОшибок Экспорт;    // Строка описания ошибок
Перем ИмяФайла Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
Функция ПолучитьНомерSAPPR() Экспорт
	НомерФайла	= Renault_ОбщийМодуль.ПолучитьЗначениеСвойства(Организация,"НомерФайлаSAPPR");
	Возврат НомерФайла;
КонецФункции

Функция ПолучитьСтрокуПозиции(Поле,MaxStr)
	
	ДлинаПоля 	= СтрДлина(Поле);
	КолПробелов = MaxStr-ДлинаПоля;
	
	Для Ном = 1 По КолПробелов Цикл
		Поле = Поле + " ";
	КонецЦикла;
	
    Возврат Поле;
КонецФункции

///////////////////////////////////////
// Modify Окипний А.Е.
Процедура ВыгрузитьДанныеSAPPR() Экспорт
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Renault_Открытый.СообщитьПользователю("Не указана организация");
		Возврат;
	КонецЕсли;
	
	/////////////////////////////////////////////////////
	//		Added Окипний А.Е.
	НомерФайлаSAPPR = ПолучитьНомерSAPPR();
	
	/////////////////////////////////////////////////////
	//		Added Окипний А.Е.
	//BIR3M = Renault_ОбщийМодуль.ПолучитьBIRБазыДанных();
	BIR3M = Renault_ОбщийМодуль.ПолучитьИдентификатор(Организация);
	
	/////////////////////////////////////////////////////
	//		Added Окипний А.Е.
	Если НЕ ЗначениеЗаполнено(BIR3M) тогда
		Renault_Открытый.СообщитьПользователю("У организации не указан код дилера");
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(НомерФайлаSAPPR) Тогда
		НомерФайлаSAPPR = 1;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) Тогда
		Renault_Открытый.СообщитьПользователюь("Укажите путь выгрузки данных!");
		Возврат;
	КонецЕсли;
	
	BIR3M = СокрЛП(BIR3M);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	SAPPR.PURCH_NO_C КАК PURCH_NO_C,
	|	SAPPR.ITM_NUMBER КАК ITM_NUMBER,
	|	SAPPR.DOC_TYPE КАК DOC_TYPE,
	|	SAPPR.MATERIAL КАК MATERIAL,
	|	SAPPR.REQ_QTY КАК REQ_QTY,
	|	SAPPR.SHIP_PART КАК SHIP_PART,
	|	SAPPR.TEXT_LINE КАК TEXT_LINE,
	|	SAPPR.SERIAL_NO КАК SERIAL_NO,
	|	SAPPR.REQ_DATE КАК REQ_DATE,
	|	SAPPR.ЗаказПоставщику
	|ИЗ
	|	РегистрСведений.SAPPR_Заказано КАК SAPPR
	|ГДЕ
	|	SAPPR.Отправлен = ЛОЖЬ
	|	И SAPPR.Организация = &Организация
	|ИТОГИ
	|	МАКСИМУМ(ITM_NUMBER),
	|	МАКСИМУМ(MATERIAL),
	|	МАКСИМУМ(REQ_QTY),
	|	МАКСИМУМ(SHIP_PART),
	|	МАКСИМУМ(TEXT_LINE),
	|	МАКСИМУМ(SERIAL_NO),
	|	МАКСИМУМ(REQ_DATE)
	|ПО
	|	DOC_TYPE,
	|	PURCH_NO_C";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Результат = Запрос.Выполнить();
	
	ТаблицаЗаказов = Результат.Выгрузить();
	ТаблицаЗаказов.Свернуть("ЗаказПоставщику");
	
	Для Каждого СтрокаТЗ из ТаблицаЗаказов Цикл
		если ЗначениеЗаполнено(СтрокаТЗ.ЗаказПоставщику) Тогда
			Менеджер = РегистрыСведений.Renault_ИсторияВыгрузкиЗаказов.СоздатьМенеджерЗаписи();
			Менеджер.ЗаказПоставщику = СтрокаТЗ.ЗаказПоставщику;
			Менеджер.Прочитать();
			Менеджер.ЗаказПоставщику = СтрокаТЗ.ЗаказПоставщику;
			Менеджер.ВОбработке = Истина;
			Менеджер.Записать();
		КонецЕсли;
	КонецЦикла;
	
	
	
	РезультатЗапроса = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если РезультатЗапроса.Строки.Количество()=0 Тогда
		Renault_Открытый.СообщитьПользователю("Нет данных для выгрузки!");
		Возврат;
	КонецЕсли;
	
	
	ТекстДок = Новый ТекстовыйДокумент();
	КраткоеИмя = СтрЗаменить(""+BIR3M + ".BIR.CCD."+ BIR3M + "." + Формат(НомерФайлаSAPPR,"ЧЦ=4; ЧВН=; ЧГ=0"), " ", "");
	ИмяФайла = ?(Прав(ПутьКФайлу,1) = "\", ПутьКФайлу, ПутьКФайлу+"\") + КраткоеИмя;
	
	Для Каждого НомСтр Из РезультатЗапроса.Строки Цикл
		
		Разделитель = ПолучитьСтрокуПозиции("*S*"+BIR3M+"*S*", 112);
		
		ТекстДок.ДобавитьСтроку(Разделитель);
		
		Для Каждого Заказ из НомСтр.Строки Цикл
			Для Каждого СтрокаЗаказа из Заказ.Строки Цикл
				SOLD_PART 	= BIR3M;
				MaxStr		= 10;
				Позиция1	= ПолучитьСтрокуПозиции(SOLD_PART,MaxStr);
				
				PURCH_NO_C 	= СтрокаЗаказа.PURCH_NO_C;
				MaxStr		= 10;
				Позиция2	= ПолучитьСтрокуПозиции(PURCH_NO_C,MaxStr);
				
				//Numbered on a 10 basis  or 100 basis:  
				//If item number receive = 10 20 30 the 
				//items number into the sale order will be : 100, 200, 300, ….
				//If the item number receive = 1,2, 3
				//The items number into the sale order will be 10 20 30…

				ITM_NUMBER  = Формат(СтрокаЗаказа.ITM_NUMBER * 100,"ЧЦ=6; ЧВН=; ЧГ=0"); 
				MaxStr		= 6;
				Позиция3	= ПолучитьСтрокуПозиции(ITM_NUMBER,MaxStr);
				
				DOC_TYPE  	= Строка(СтрокаЗаказа.DOC_TYPE);
				MaxStr		= 4;
				Позиция4	= ПолучитьСтрокуПозиции(DOC_TYPE,MaxStr);
				
				MATERIAL  	= СтрокаЗаказа.MATERIAL;
				MaxStr		= 18;
				Позиция5	= ПолучитьСтрокуПозиции(MATERIAL,MaxStr);
				
				REQ_QTY  	= Формат(СтрокаЗаказа.REQ_QTY,"ЧГ=0");
				MaxStr		= 6;
				Позиция6	= ПолучитьСтрокуПозиции(REQ_QTY,MaxStr);
				
				SHIP_PART  	= Формат(СтрокаЗаказа.SHIP_PART,"ЧГ=0");
				MaxStr		= 10;
				Позиция7	= ПолучитьСтрокуПозиции(SHIP_PART,MaxStr);
				
				TEXT_LINE  	= СтрокаЗаказа.TEXT_LINE;
				MaxStr		= 20;
				Позиция8	= ПолучитьСтрокуПозиции(TEXT_LINE,MaxStr);
				
				SERIAL_NO  	= СтрокаЗаказа.SERIAL_NO;
				MaxStr		= 26;
				Позиция9	= ПолучитьСтрокуПозиции(SERIAL_NO,MaxStr);
				
				REQ_DATE  	= Формат(СтрокаЗаказа.REQ_DATE,"ДФ=ггггММдд");
				MaxStr		= 8;
				Позиция10	= ПолучитьСтрокуПозиции(REQ_DATE,MaxStr);

				СтрокаТхт = Позиция1+Позиция2+Позиция3+Позиция4+Позиция5+Позиция6+Позиция7+Позиция8+Позиция9+Позиция10;
				ТекстДок.ДобавитьСтроку(СтрокаТхт);
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
	/////////////////////////////////////////////////////
	//		Modify Окипний А.Е.
	Если НЕ ТекстДок.КоличествоСтрок() = 0 тогда //Защита от формирования пустых файлов
		Попытка
			ТекстДок.Записать(ИмяФайла,"iso-8859-5");
		Исключение
			Renault_Открытый.СообщитьПользователю("Не удалось записать файл"+ Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Важное);	
		КонецПопытки;
		
		//Запишем новый номер в свойство Организация
		СвойствоВидИспользования = ПланыВидовХарактеристик.СвойстваОбъектов.НомерФайлаSAPPR;
		
		НаборЗаписейЗначенияСвойствОбъектов								= РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
		НаборЗаписейЗначенияСвойствОбъектов.Отбор.Объект.Значение 		= Организация;
		НаборЗаписейЗначенияСвойствОбъектов.Отбор.Объект.Использование 	= Истина;
		НаборЗаписейЗначенияСвойствОбъектов.Отбор.Свойство.Значение 	= СвойствоВидИспользования;
		НаборЗаписейЗначенияСвойствОбъектов.Отбор.Свойство.Использование= Истина;
		НаборЗаписейЗначенияСвойствОбъектов.Прочитать();
		НаборЗаписейЗначенияСвойствОбъектов.Очистить();
		
		НоваяЗапись 		 = НаборЗаписейЗначенияСвойствОбъектов.Добавить();
		НоваяЗапись.Объект 	 = Организация;
		НоваяЗапись.Свойство = СвойствоВидИспользования;
		НоваяЗапись.Значение = НомерФайлаSAPPR + 1;
			
		Попытка
			НаборЗаписейЗначенияСвойствОбъектов.Записать();	
		Исключение
			Renault_Открытый.СообщитьПользователю("Не удалось записать значение свойства  " + Строка(СвойствоВидИспользования) + " для " + Организация.Наименование, СтатусСообщения.Важное);	
		КонецПопытки;
		
		НомерФайлаSAPPR = ПолучитьНомерSAPPR();
		
		//Отметим в регистре SAPPR флаг отправки
		ТаблицаЗаказов = Результат.Выгрузить();
		ТаблицаЗаказов.Свернуть("ЗаказПоставщику");
		
		Для каждого СтрокаЗаказ из ТаблицаЗаказов Цикл
			Набор = РегистрыСведений.SAPPR_Заказано.СоздатьНаборЗаписей();
			
			Набор.Отбор.ЗаказПоставщику.Установить(СтрокаЗаказ.ЗаказПоставщику);
			Набор.Прочитать();
			
			ВремТЗ = Набор.Выгрузить();
			ВремТЗ.ЗаполнитьЗначения(Истина, "Отправлен");
			Набор.Загрузить(ВремТЗ);
			
			//Попытка записать, хотя ошибок быть не должно.
			Попытка
				Набор.Записать();
			Исключение
				Renault_Открытый.СообщитьПользователю("Не удалось внести изменения в таблицу заказов SAPPR.", СтатусСообщения.Важное);
			КонецПопытки;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

/////////////////////////////////////////////////////
//		Added Окипний А.Е.

/////////////////////////////////////////////////////
//		Точка входа сервер

Процедура ОбработкаНаСервере() Экспорт
	
	ВыгрузитьДанныеSAPPR();
	
КонецПроцедуры

/////////////////////////////////////////////////////
//		Инициализация объекта 
Попытка
ТекПользователь 			= ПараметрыСеанса.Пользователь;
Организация 	= ?(НЕ ЗначениеЗаполнено(ТекПользователь.Организация),
			ТекПользователь.Организация,Справочники.Организации.ОсновнаяОрганизация);
Исключение КонецПопытки;
