Перем ВебСервис Экспорт;
Перем ВСОпределение Экспорт;
Перем СервисФабрика Экспорт;

Перем XML_Данные;
Перем BIR;

Процедура СоздатьПрокси() Экспорт
	
	АдресСервиса	 = Константы.Renault_АдресWebСервисов.Получить();
	ЛогинВебСервиса	 = Константы.Renault_ЛогинВебСервиса.Получить();
	ПарольВебСервиса = Константы.Renault_ПарольВебСервиса.Получить();
	
	ВСОпределение = Новый WSОпределения(СокрЛП(АдресСервиса) + "ws/inntimetable.ws?wsdl",
									ЛогинВебСервиса, ПарольВебСервиса);
	
	ВебСервис = Новый WSПрокси(ВСОпределение, "http://www.renault.ru/schema", "ПриемРасписаний","ПриемРасписанийSoap12",600);
	
	ВебСервис.Пользователь	 = ЛогинВебСервиса;
	ВебСервис.Пароль		 = ПарольВебСервиса;
	
	СервисФабрика = ВебСервис.ФабрикаXDTO;
	
КонецПроцедуры

Процедура СобратьИОтправитьДанные() Экспорт
	
	//Для начала получим Типы XDTO
	
	//Массивы
	//Общая таблица
	TimeTable = СервисФабрика.Создать(СервисФабрика.Тип("http://www.renault.ru/schema", "TimeTable"));
	
	//Сборные таблицы
	TestDriveRecords = СервисФабрика.Создать(СервисФабрика.Тип("http://www.renault.ru/schema","TestDriveRecords"));
	ServicesRecords = СервисФабрика.Создать(СервисФабрика.Тип("http://www.renault.ru/schema","ServicesRecords"));
	CarsDistribRecords = СервисФабрика.Создать(СервисФабрика.Тип("http://www.renault.ru/schema","CarsDistribRecords"));
	
	//Таблица тест-драйвов
	ТаблицаТД = ПолучитьТаблицуТД();
	Для Каждого строкаТД из ТаблицаТД цикл
		
		TestDriveRecord_ = СервисФабрика.Создать(СервисФабрика.Тип("http://www.renault.ru/schema","TestDriveRecord"));
		
		ЗаполнитьЗначенияСвойств(TestDriveRecord_, СтрокаТД);
		
		TestDriveRecords.Элементы.Добавить(TestDriveRecord_);
		
	КонецЦикла;
	
	//Таблица сервиса
	ТаблицаСД = ПолучитьТаблицуСД();
	Для Каждого строкаСД из ТаблицаСД цикл
		
		ServicesRecord_ = СервисФабрика.Создать(СервисФабрика.Тип("http://www.renault.ru/schema","ServicesRecord"));
		
		ЗаполнитьЗначенияСвойств(ServicesRecord_, строкаСД);
		
		ServicesRecords.Элементы.Добавить(ServicesRecord_);
		
	КонецЦикла;

	//Таблица выдач
	ТаблицаВД = ПолучитьТаблицуВД();
	Для Каждого строкаВД из ТаблицаВД цикл
		
		CarsDistribRecord_ = СервисФабрика.Создать(СервисФабрика.Тип("http://www.renault.ru/schema","CarsDistribRecord"));
		
		ЗаполнитьЗначенияСвойств(CarsDistribRecord_, строкаВД);
		
		CarsDistribRecords.Элементы.Добавить(CarsDistribRecord_);
		
	КонецЦикла;
	
	
	TimeTable.TestDriveTable = TestDriveRecords;
	TimeTable.ServicesTable = ServicesRecords;
	TimeTable.CarsDistribTable = CarsDistribRecords; 
	
	//Попробуем отправить
	Результат = ВебСервис.timetableinn(TimeTable, BIR);
	
КонецПроцедуры

Функция ПолучитьТаблицуТД()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(40)) КАК guid,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(150)) КАК vehicle,
	|	CRM_ЗаписиНаТестДрайв.Автомобиль КАК Автомобиль,
	|	CRM_ЗаписиНаТестДрайв.Менеджер.Наименование КАК manager,
	|	CRM_ЗаписиНаТестДрайв.Регистратор.Клиент.Наименование КАК client,
	|	CRM_ЗаписиНаТестДрайв.ДатаНачала КАК startdate,
	|	CRM_ЗаписиНаТестДрайв.ДатаЗавершения КАК enddate,
	|	Renault_BIR_db.Значение КАК BIR
	|ИЗ
	|	РегистрСведений.CRM_ЗаписиНаТестДрайв КАК CRM_ЗаписиНаТестДрайв,
	|	Константа.Renault_BIR_db КАК Renault_BIR_db
	|ГДЕ
	|	CRM_ЗаписиНаТестДрайв.ДатаНачала >= &ДатаНачала"
	);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата()));
	
	ТаблицаТД = Запрос.Выполнить().Выгрузить();
	Для Каждого строкаТД из ТаблицаТД цикл
		
		СтрокаТД.guid = строкаТД.Автомобиль.УникальныйИдентификатор();
		строкаТД.vehicle = СтрокаТД.Автомобиль.Наименование;
		
	КонецЦикла;

	Возврат ТаблицаТД;
	
КонецФункции

Функция ПолучитьТаблицуСД()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	&BIR КАК BIR,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(40)) КАК guid,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(150)) КАК vehicle,
	|	CRM_ЗаписиНаСервис.Автомобиль КАК Автомобиль,
	|	CRM_ЗаписиНаСервис.Менеджер.Наименование КАК manager,
	|	CRM_ЗаписиНаСервис.Регистратор.Клиент.Наименование КАК client,
	|	CRM_ЗаписиНаСервис.ДатаНачала КАК startdate,
	|	CRM_ЗаписиНаСервис.Автомобиль.VIN КАК VIN
	|ИЗ
	|	РегистрСведений.CRM_ЗаписиНаСервис КАК CRM_ЗаписиНаСервис
	|ГДЕ
	|	CRM_ЗаписиНаСервис.ДатаНачала >= &ДатаНачала"
	);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("BIR", BIR);
	
	ТаблицаCД = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаCД из ТаблицаCД цикл
		
		СтрокаCД.guid = СтрокаCД.Автомобиль.УникальныйИдентификатор();
		строкаCД.vehicle = СтрокаCД.Автомобиль.Наименование;
		
	КонецЦикла;

	Возврат ТаблицаCД;
	
КонецФункции	

Функция ПолучитьТаблицуВД()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	&BIR КАК BIR,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(40)) КАК guid,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(150)) КАК vehicle,
	|	CRM_ЗаписиНаВыдачу.Автомобиль КАК Автомобиль,
	|	CRM_ЗаписиНаВыдачу.Менеджер.Наименование КАК manager,
	|	CRM_ЗаписиНаВыдачу.Регистратор.Клиент.Наименование КАК client,
	|	CRM_ЗаписиНаВыдачу.ДатаНачала КАК startdate
	|ИЗ
	|	РегистрСведений.CRM_ЗаписиНаВыдачу КАК CRM_ЗаписиНаВыдачу
	|ГДЕ
	|	CRM_ЗаписиНаВыдачу.ДатаНачала >= &ДатаНачала"
	);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("BIR", BIR);
	
	ТаблицаВД = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаВД из ТаблицаВД цикл
		
		СтрокаВД.guid = СтрокаВД.Автомобиль.УникальныйИдентификатор();
		СтрокаВД.vehicle = СтрокаВД.Автомобиль.Наименование;
		
	КонецЦикла;

	Возврат ТаблицаВД;
	
КонецФункции	

Процедура ВызовНаСервере() Экспорт
	
	СоздатьПрокси();
	
	СобратьИОтправитьДанные();
	
КонецПроцедуры	

BIR =Renault_ОбщийМодуль.ПолучитьBIRБазыДанных(); 
//*//СокрЛП(Renault_ОбщийМодуль.ПолучитьИдентификатор(ПараметрыСеанса.Организация));