&НаКлиенте
Процедура Добавить(Команда)
	
	Если Renault_ОбщегоНазначенияПовтИсп.Renault_Это83() Тогда
		ВЫПОЛНИТЬ("ОткрытьФорму(""Справочник.Renault_ПредложенияКомплексСервисов.Форма.ФормаПодбораКС"",,ЭтаФорма,,,, Новый ОписаниеОповещения(""ДобавитьЗавершение"", Объект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс)");
	Иначе
		ОткрытьФорму("Справочник.Renault_ПредложенияКомплексСервисов.Форма.ФормаПодбораКС",,ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.Renault_ПредложенияКомплексСервисов.Форма.ФормаПодбораКС" Тогда
		
		Объект.КомплексСервис = ВыбранноеЗначение;
		Объект.Наименование = ВыбранноеЗначение;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьОписание(Команда)
	
	Документ = Элементы.ОписаниеHTML.Документ;
	ТекстДляРедактирования = Документ.body.innerHTML;
	Параметр = Новый Структура("ТекстHTML", ТекстДляРедактирования);
	
	ОтредактТекст = Неопределено;
	
	Если Renault_ОбщегоНазначенияПовтИсп.Renault_Это83() Тогда
		ВЫПОЛНИТЬ("ОткрытьФорму(""Обработка.Renault_РедакторHTML.Форма"",Параметр,ЭтаФорма,,,, Новый ОписаниеОповещения(""РедактироватьОписаниеЗавершение"", Объект, Новый Структура(""Документ"", Документ)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс)");
	Иначе
		ОткрытьФорму("Обработка.Renault_РедакторHTML.Форма",Параметр,ЭтаФорма);			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОписаниеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	//   РедактироватьОписание(Элемент);
	   
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьОписаниеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Документ = ДополнительныеПараметры.Документ;
	
	ОтредактТекст = Результат;
	
	Если ОтредактТекст <> Неопределено Тогда
		Документ.body.innerHTML = ОтредактТекст;
		Объект.ОписаниеHTML = ОтредактТекст;
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОписаниеHTMLДокументСформирован(Элемент)
	
	Документ = Элемент.Документ;
	Документ.Body.innerHTML = Объект.ОписаниеHTML;
	Документ.body.scroll = "no";

КонецПроцедуры

&НаКлиенте
Процедура КомплексСервисНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Renault_ОбщегоНазначенияПовтИсп.Renault_Это83() Тогда
		ВЫПОЛНИТЬ("ОткрытьФорму(""Справочник.Renault_ПредложенияКомплексСервисов.Форма.ФормаПодбораКС"",,ЭтаФорма,,,, , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс)");
	Иначе
		ОткрытьФорму("Справочник.Renault_ПредложенияКомплексСервисов.Форма.ФормаПодбораКС",,ЭтаФорма);			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПериодПроведенияС) Тогда
		Объект.ПериодПроведенияС = ТекущаяДата();
	КонецЕсли;			
	
	Если НЕ ЗначениеЗаполнено(Объект.ПериодПроведенияПо) Тогда
		Объект.ПериодПроведенияПо = ДобавитьМесяц(ТекущаяДата(),12);
	КонецЕсли;			

	Если Модифицированность = Истина Тогда
		Объект.ДатаИзменения = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ПараметрыСеанса.DMS_Бренд <> Справочники.CRM_МаркаАвтомобиля.RENAULT Тогда
		Элементы.MyRenault.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры
