////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования


/////////////////////////////////////////////////////////////////////
////////// ФУНКЦИИ ДЛЯ ЗАПОЛНЕНИЯ ТАБЛИЦЫ Параметры расчета

Функция ПолучитьСписокНоменклатурыДляРасчета(ПодразделениеКомпании, СтруктураПараметров,Отладка,Протокол)
	
	 
	
	Состояние("Получение списка номенклатуры для расчета");
	ЗапросНоменклатуры 		 = Новый Запрос();
	ЗапросНоменклатуры.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	//При необходимости изменить запрос то найти и удалить кусок "И %ОтборНоменклатуры%", но не забыть потом вставить обратно!"
	ТекстЗапроса			 = "ВЫБРАТЬ
	            			   |	MAD_ПараметрыПоставщиков.Производитель,
	            			   |	MAD_ПараметрыПоставщиков.ПериодичностьЗаказов,
	            			   |	MAD_ПараметрыПоставщиков.СтандартныйСрокПоставки,
	            			   |	MAD_ПараметрыПоставщиков.ЗапасНаПревышениеСрокаПоставки,
	            			   |	MAD_ПараметрыПоставщиков.КоэффициентУдовлетворенияСпроса
	            			   |ПОМЕСТИТЬ ПараметрыПоставщиков
	            			   |ИЗ
	            			   |	РегистрСведений.MAD_ПараметрыПоставщиков КАК MAD_ПараметрыПоставщиков
	            			   |ГДЕ
	            			   |	MAD_ПараметрыПоставщиков.ПодразделениеКомпании = &ПодразделениеКомпании
	            			   |;
	            			   |
	            			   |////////////////////////////////////////////////////////////////////////////////
	            			   |ВЫБРАТЬ
	            			   |	ОстаткиТоваровКомпанииОбороты.Номенклатура,
	            			   |	ЕСТЬNULL(MAD_РасчетПараметровУправленияЗапасамиСрезПоследних.СтандартноеКоличество, 0) КАК СтандартноеКоличествоПрошлое,
	            			   |	ВЫБОР
	            			   |		КОГДА (ВЫРАЗИТЬ(РАЗНОСТЬДАТ(ОстаткиТоваровКомпанииОбороты.Номенклатура.Дата, &ДатаРасчета, ДЕНЬ) / 30 КАК ЧИСЛО(10, 0))) > 6
	            			   |			ТОГДА 6
	            			   |		ИНАЧЕ ВЫРАЗИТЬ(РАЗНОСТЬДАТ(ОстаткиТоваровКомпанииОбороты.Номенклатура.Дата, &ДатаРасчета, ДЕНЬ) / 30 КАК ЧИСЛО(10, 0))
	            			   |	КОНЕЦ КАК КоличествоПериодовРасчетаПоПозиции,
	            			   |	ЕСТЬNULL(ПараметрыПоставщиков.ПериодичностьЗаказов, &ПериодичностьЗаказов) КАК ПериодичностьЗаказов,
	            			   |	ЕСТЬNULL(ПараметрыПоставщиков.СтандартныйСрокПоставки, &СтандартныйСрокПоставки) КАК СтандартныйСрокПоставки,
	            			   |	ЕСТЬNULL(ПараметрыПоставщиков.ЗапасНаПревышениеСрокаПоставки, &ЗапасНаПревышениеСрокаПоставки) КАК ЗапасНаПревышениеСрокаПоставки,
	            			   |	ЕСТЬNULL(ПараметрыПоставщиков.КоэффициентУдовлетворенияСпроса, &КоэффициентУдовлетворенияСпроса) КАК КоэффициентУдовлетворенияСпроса,
	            			   |	ЕСТЬNULL(ВложенныйЗапросДатаПоследнегоСпроса.ДатаПоследнегоСпроса, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоследнегоСпроса,
	            			   |	MAD_РасчетПараметровУправленияЗапасамиСрезПоследних.КлассКонтроля КАК КлассКонтроляПредыдущий
	            			   |ПОМЕСТИТЬ НоменклатураДляРасчета
	            			   |ИЗ
	            			   |	РегистрНакопления.ОстаткиТоваровКомпании.Обороты(
	            			   |			,
	            			   |			,
	            			   |			,
	            			   |			СкладКомпании.Подразделение В ИЕРАРХИИ (&ПодразделениеКомпании)
	            			   |				И &ОтборНоменклатуры) КАК ОстаткиТоваровКомпанииОбороты
	            			   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.MAD_РасчетПараметровУправленияЗапасами.СрезПоследних(&ДатаICCПрош, ПодразделениеКомпании = &ПодразделениеКомпании) КАК MAD_РасчетПараметровУправленияЗапасамиСрезПоследних
	            			   |		ПО ОстаткиТоваровКомпанииОбороты.Номенклатура = MAD_РасчетПараметровУправленияЗапасамиСрезПоследних.Номенклатура
	            			   |		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыПоставщиков КАК ПараметрыПоставщиков
	            			   |		ПО ОстаткиТоваровКомпанииОбороты.Номенклатура.Производитель = ПараметрыПоставщиков.Производитель
	            			   |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	            			   |			Продажи.Номенклатура КАК Номенклатура,
	            			   |			МАКСИМУМ(Продажи.Период) КАК ДатаПоследнегоСпроса
	            			   |		ИЗ
	            			   |			РегистрНакопления.Продажи КАК Продажи
	            			   |		ГДЕ
	            			   |			Продажи.ПодразделениеКомпании В ИЕРАРХИИ(&ПодразделениеКомпании)
	            			   |		
	            			   |		СГРУППИРОВАТЬ ПО
	            			   |			Продажи.Номенклатура) КАК ВложенныйЗапросДатаПоследнегоСпроса
	            			   |		ПО ОстаткиТоваровКомпанииОбороты.Номенклатура = ВложенныйЗапросДатаПоследнегоСпроса.Номенклатура
	            			   |ГДЕ
	            			   |	ОстаткиТоваровКомпанииОбороты.КоличествоПриход <> 0
	            			   |;
	            			   |
	            			   |////////////////////////////////////////////////////////////////////////////////
	            			   |ВЫБРАТЬ
	            			   |	НоменклатураДляРасчета.Номенклатура,
	            			   |	НоменклатураДляРасчета.СтандартноеКоличествоПрошлое,
	            			   |	НоменклатураДляРасчета.КоличествоПериодовРасчетаПоПозиции,
	            			   |	ЕСТЬNULL(ЕСТЬNULL(SCCНоменклатура.СпециальныКлассКонтроля, SCCСкладскойПризнак.СпециальныКлассКонтроля), ЗНАЧЕНИЕ(Справочник.MAD_СпециальныеКлассыКонтроля.ПустаяСсылка)) КАК СпециальныйКлассКонтроля,
	            			   |	НоменклатураДляРасчета.ПериодичностьЗаказов,
	            			   |	НоменклатураДляРасчета.СтандартныйСрокПоставки,
	            			   |	НоменклатураДляРасчета.ЗапасНаПревышениеСрокаПоставки,
	            			   |	НоменклатураДляРасчета.КоэффициентУдовлетворенияСпроса,
	            			   |	НоменклатураДляРасчета.ДатаПоследнегоСпроса,
	            			   |	НоменклатураДляРасчета.КлассКонтроляПредыдущий
	            			   |ПОМЕСТИТЬ НоменклатураДляРАсчетаСоСпециальнымиКлассамиКонтроля
	            			   |ИЗ
	            			   |	НоменклатураДляРасчета КАК НоменклатураДляРасчета
	            			   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.MAD_НазначениеСпециальныхКлассовКонтроля.СрезПоследних(
	            			   |				&ДатаРасчета,
	            			   |				ПодразделениеКомпании = &ПодразделениеКомпании
	            			   |					И (ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	            			   |						ИЛИ ДатаОкончания >= &ДатаРасчета)) КАК SCCНоменклатура
	            			   |		ПО НоменклатураДляРасчета.Номенклатура = SCCНоменклатура.Показатель
	            			   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.MAD_НазначениеСпециальныхКлассовКонтроля.СрезПоследних(
	            			   |				&ДатаРасчета,
	            			   |				ПодразделениеКомпании = &ПОдразделениеКомпании
	            			   |					И (ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	            			   |						ИЛИ ДатаОкончания >= &ДатаРасчета)) КАК SCCСкладскойПризнак
	            			   |		ПО НоменклатураДляРасчета.Номенклатура.СкладскойПризнак = SCCСкладскойПризнак.Показатель
	            			   |;
	            			   |
	            			   |////////////////////////////////////////////////////////////////////////////////
	            			   |ВЫБРАТЬ
	            			   |	НоменклатураДляРасчета.Номенклатура,
	            			   |	НоменклатураДляРасчета.СтандартноеКоличествоПрошлое,
	            			   |	СУММА(ВЫБОР
	            			   |			КОГДА ПродажиОбороты.Период МЕЖДУ &ДатаНачала1 И &ДатаОкончания1
	            			   |				ТОГДА ПродажиОбороты.КоличествоОборот
	            			   |			ИНАЧЕ 0
	            			   |		КОНЕЦ) КАК Спрос1,
	            			   |	СУММА(ВЫБОР
	            			   |			КОГДА ПродажиОбороты.Период МЕЖДУ &ДатаНачала2 И &ДатаОкончания2
	            			   |				ТОГДА ПродажиОбороты.КоличествоОборот
	            			   |			ИНАЧЕ 0
	            			   |		КОНЕЦ) КАК Спрос2,
	            			   |	СУММА(ВЫБОР
	            			   |			КОГДА ПродажиОбороты.Период МЕЖДУ &ДатаНачала3 И &ДатаОкончания3
	            			   |				ТОГДА ПродажиОбороты.КоличествоОборот
	            			   |			ИНАЧЕ 0
	            			   |		КОНЕЦ) КАК Спрос3,
	            			   |	СУММА(ВЫБОР
	            			   |			КОГДА ПродажиОбороты.Период МЕЖДУ &ДатаНачала4 И &ДатаОкончания4
	            			   |				ТОГДА ПродажиОбороты.КоличествоОборот
	            			   |			ИНАЧЕ 0
	            			   |		КОНЕЦ) КАК Спрос4,
	            			   |	СУММА(ВЫБОР
	            			   |			КОГДА ПродажиОбороты.Период МЕЖДУ &ДатаНачала5 И &ДатаОкончания5
	            			   |				ТОГДА ПродажиОбороты.КоличествоОборот
	            			   |			ИНАЧЕ 0
	            			   |		КОНЕЦ) КАК Спрос5,
	            			   |	СУММА(ВЫБОР
	            			   |			КОГДА ПродажиОбороты.Период МЕЖДУ &ДатаНачала6 И &ДатаОкончания6
	            			   |				ТОГДА ПродажиОбороты.КоличествоОборот
	            			   |			ИНАЧЕ 0
	            			   |		КОНЕЦ) КАК Спрос6
	            			   |ПОМЕСТИТЬ СпросЗаПериод
	            			   |ИЗ
	            			   |	НоменклатураДляРасчета КАК НоменклатураДляРасчета
	            			   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(
	            			   |				&ДатаНачала1,
	            			   |				&ДатаОкончания6,
	            			   |				День,
	            			   |				ПодразделениеКомпании В ИЕРАРХИИ (&ПодразделениеКомпании)
	            			   |					И ((НЕ Покупатель В ИЕРАРХИИ (&НашиКомпании)
	            			   |						ИЛИ ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.КомплектацияАвтомобиля))
	            			   |						И НЕ Покупатель.Родитель = &ОптовыеКомпании)
	            			   |					И НЕ Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)) КАК ПродажиОбороты
	            			   |		ПО НоменклатураДляРасчета.Номенклатура = ПродажиОбороты.Номенклатура
	            			   |
	            			   |СГРУППИРОВАТЬ ПО
	            			   |	НоменклатураДляРасчета.Номенклатура,
	            			   |	НоменклатураДляРасчета.СтандартноеКоличествоПрошлое
	            			   |;
	            			   |
	            			   |////////////////////////////////////////////////////////////////////////////////
	            			   |ВЫБРАТЬ
	            			   |	НоменклатураДляРасчета.Номенклатура,
	            			   |	СУММА(ВЫБОР
	            			   |			КОГДА &УчитыватьЗЧВПроизводстве
	            			   |				ТОГДА ВЫБОР
	            			   |						КОГДА ТоварыВПроизводствеОстатки.ЗаказНаряд.Дата МЕЖДУ &ДатаНачала1 И &ДатаОкончания1
	            			   |							ТОГДА ТоварыВПроизводствеОстатки.КоличествоОстаток
	            			   |						ИНАЧЕ 0
	            			   |					КОНЕЦ
	            			   |			ИНАЧЕ 0
	            			   |		КОНЕЦ) КАК ДопСпрос1,
	            			   |	СУММА(ВЫБОР
	            			   |			КОГДА &УчитыватьЗЧВПроизводстве
	            			   |				ТОГДА ВЫБОР
	            			   |						КОГДА ТоварыВПроизводствеОстатки.ЗаказНаряд.Дата МЕЖДУ &ДатаНачала2 И &ДатаОкончания2
	            			   |							ТОГДА ТоварыВПроизводствеОстатки.КоличествоОстаток
	            			   |						ИНАЧЕ 0
	            			   |					КОНЕЦ
	            			   |			ИНАЧЕ 0
	            			   |		КОНЕЦ) КАК ДопСпрос2,
	            			   |	СУММА(ВЫБОР
	            			   |			КОГДА &УчитыватьЗЧВПроизводстве
	            			   |				ТОГДА ВЫБОР
	            			   |						КОГДА ТоварыВПроизводствеОстатки.ЗаказНаряд.Дата МЕЖДУ &ДатаНачала3 И &ДатаОкончания3
	            			   |							ТОГДА ТоварыВПроизводствеОстатки.КоличествоОстаток
	            			   |						ИНАЧЕ 0
	            			   |					КОНЕЦ
	            			   |			ИНАЧЕ 0
	            			   |		КОНЕЦ) КАК ДопСпрос3,
	            			   |	СУММА(ВЫБОР
	            			   |			КОГДА &УчитыватьЗЧВПроизводстве
	            			   |				ТОГДА ВЫБОР
	            			   |						КОГДА ТоварыВПроизводствеОстатки.ЗаказНаряд.Дата МЕЖДУ &ДатаНачала4 И &ДатаОкончания4
	            			   |							ТОГДА ТоварыВПроизводствеОстатки.КоличествоОстаток
	            			   |						ИНАЧЕ 0
	            			   |					КОНЕЦ
	            			   |			ИНАЧЕ 0
	            			   |		КОНЕЦ) КАК ДопСпрос4,
	            			   |	СУММА(ВЫБОР
	            			   |			КОГДА &УчитыватьЗЧВПроизводстве
	            			   |				ТОГДА ВЫБОР
	            			   |						КОГДА ТоварыВПроизводствеОстатки.ЗаказНаряд.Дата МЕЖДУ &ДатаНачала5 И &ДатаОкончания5
	            			   |							ТОГДА ТоварыВПроизводствеОстатки.КоличествоОстаток
	            			   |						ИНАЧЕ 0
	            			   |					КОНЕЦ
	            			   |			ИНАЧЕ 0
	            			   |		КОНЕЦ) КАК ДопСпрос5,
	            			   |	СУММА(ВЫБОР
	            			   |			КОГДА &УчитыватьЗЧВПроизводстве
	            			   |				ТОГДА ВЫБОР
	            			   |						КОГДА ТоварыВПроизводствеОстатки.ЗаказНаряд.Дата МЕЖДУ &ДатаНачала6 И &ДатаОкончания6
	            			   |							ТОГДА ТоварыВПроизводствеОстатки.КоличествоОстаток
	            			   |						ИНАЧЕ 0
	            			   |					КОНЕЦ
	            			   |			ИНАЧЕ 0
	            			   |		КОНЕЦ) КАК ДопСпрос6
	            			   |ПОМЕСТИТЬ ЗЧВПроизводстве
	            			   |ИЗ
	            			   |	НоменклатураДляРасчета КАК НоменклатураДляРасчета
	            			   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВПроизводстве.Остатки(
	            			   |				&ДатаОкончания6,
	            			   |				Цех.Подразделение В ИЕРАРХИИ (&ПодразделениеКомпании)
	            			   |					И (ЗаказНаряд.Дата МЕЖДУ &ДатаНачала1 И &ДатаОкончания6)) КАК ТоварыВПроизводствеОстатки
	            			   |		ПО НоменклатураДляРасчета.Номенклатура = ТоварыВПроизводствеОстатки.Номенклатура
	            			   |
	            			   |СГРУППИРОВАТЬ ПО
	            			   |	НоменклатураДляРасчета.Номенклатура
	            			   |;
	            			   |
	            			   |////////////////////////////////////////////////////////////////////////////////
	            			   |ВЫБРАТЬ
	            			   |	НоменклатураДляРасчета.Номенклатура,
	            			   |	НоменклатураДляРасчета.СтандартноеКоличествоПрошлое,
	            			   |	СУММА(ВЫБОР
	            			   |			КОГДА УпущенныйСпрос.Период МЕЖДУ &ДатаНачала1 И &ДатаОкончания1
	            			   |				ТОГДА УпущенныйСпрос.Количество
	            			   |			ИНАЧЕ 0
	            			   |		КОНЕЦ) КАК УпущенныйСпрос1,
	            			   |	СУММА(ВЫБОР
	            			   |			КОГДА УпущенныйСпрос.Период МЕЖДУ &ДатаНачала2 И &ДатаОкончания2
	            			   |				ТОГДА УпущенныйСпрос.Количество
	            			   |			ИНАЧЕ 0
	            			   |		КОНЕЦ) КАК УпущенныйСпрос2,
	            			   |	СУММА(ВЫБОР
	            			   |			КОГДА УпущенныйСпрос.Период МЕЖДУ &ДатаНачала3 И &ДатаОкончания3
	            			   |				ТОГДА УпущенныйСпрос.Количество
	            			   |			ИНАЧЕ 0
	            			   |		КОНЕЦ) КАК УпущенныйСпрос3,
	            			   |	СУММА(ВЫБОР
	            			   |			КОГДА УпущенныйСпрос.Период МЕЖДУ &ДатаНачала4 И &ДатаОкончания4
	            			   |				ТОГДА УпущенныйСпрос.Количество
	            			   |			ИНАЧЕ 0
	            			   |		КОНЕЦ) КАК УпущенныйСпрос4,
	            			   |	СУММА(ВЫБОР
	            			   |			КОГДА УпущенныйСпрос.Период МЕЖДУ &ДатаНачала5 И &ДатаОкончания5
	            			   |				ТОГДА УпущенныйСпрос.Количество
	            			   |			ИНАЧЕ 0
	            			   |		КОНЕЦ) КАК УпущенныйСпрос5,
	            			   |	СУММА(ВЫБОР
	            			   |			КОГДА УпущенныйСпрос.Период МЕЖДУ &ДатаНачала6 И &ДатаОкончания1
	            			   |				ТОГДА УпущенныйСпрос.Количество
	            			   |			ИНАЧЕ 0
	            			   |		КОНЕЦ) КАК УпущенныйСпрос6
	            			   |ПОМЕСТИТЬ УпущенныйСпросЗаПериод
	            			   |ИЗ
	            			   |	НоменклатураДляРасчета КАК НоменклатураДляРасчета
	            			   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УпущенныйСпрос КАК УпущенныйСпрос
	            			   |		ПО НоменклатураДляРасчета.Номенклатура = УпущенныйСпрос.Номенклатура
	            			   |ГДЕ
	            			   |	УпущенныйСпрос.Период МЕЖДУ &ДатаНачала1 И &ДатаОкончания6
	            			   |	И УпущенныйСпрос.Автор.Подразделение В ИЕРАРХИИ(&ПодразделениеКомпании)
	            			   |
	            			   |СГРУППИРОВАТЬ ПО
	            			   |	НоменклатураДляРасчета.Номенклатура,
	            			   |	НоменклатураДляРасчета.СтандартноеКоличествоПрошлое
	            			   |;
	            			   |
	            			   |////////////////////////////////////////////////////////////////////////////////
	            			   |ВЫБРАТЬ
	            			   |	НоменклатураДляРАсчетаСоСпециальнымиКлассамиКонтроля.Номенклатура,
	            			   |	НоменклатураДляРАсчетаСоСпециальнымиКлассамиКонтроля.СтандартноеКоличествоПрошлое,
	            			   |	НоменклатураДляРАсчетаСоСпециальнымиКлассамиКонтроля.СпециальныйКлассКонтроля,
	            			   |	НоменклатураДляРАсчетаСоСпециальнымиКлассамиКонтроля.КоличествоПериодовРасчетаПоПозиции,
	            			   |	ЕСТЬNULL(СпросЗаПериод.Спрос1, 0) + ЕСТЬNULL(ЗЧВПроизводстве.ДопСпрос1, 0) КАК Спрос1,
	            			   |	ЕСТЬNULL(СпросЗаПериод.Спрос2, 0) + ЕСТЬNULL(ЗЧВПроизводстве.ДопСпрос2, 0) КАК Спрос2,
	            			   |	ЕСТЬNULL(СпросЗаПериод.Спрос3, 0) + ЕСТЬNULL(ЗЧВПроизводстве.ДопСпрос3, 0) КАК Спрос3,
	            			   |	ЕСТЬNULL(СпросЗаПериод.Спрос4, 0) + ЕСТЬNULL(ЗЧВПроизводстве.ДопСпрос4, 0) КАК Спрос4,
	            			   |	ЕСТЬNULL(СпросЗаПериод.Спрос5, 0) + ЕСТЬNULL(ЗЧВПроизводстве.ДопСпрос5, 0) КАК Спрос5,
	            			   |	ЕСТЬNULL(СпросЗаПериод.Спрос6, 0) + ЕСТЬNULL(ЗЧВПроизводстве.ДопСпрос6, 0) КАК Спрос6,
	            			   |	ЕСТЬNULL(УпущенныйСпросЗаПериод.УпущенныйСпрос1, 0) КАК УпущенныйСпрос1,
	            			   |	ЕСТЬNULL(УпущенныйСпросЗаПериод.УпущенныйСпрос2, 0) КАК УпущенныйСпрос2,
	            			   |	ЕСТЬNULL(УпущенныйСпросЗаПериод.УпущенныйСпрос3, 0) КАК УпущенныйСпрос3,
	            			   |	ЕСТЬNULL(УпущенныйСпросЗаПериод.УпущенныйСпрос4, 0) КАК УпущенныйСпрос4,
	            			   |	ЕСТЬNULL(УпущенныйСпросЗаПериод.УпущенныйСпрос5, 0) КАК УпущенныйСпрос5,
	            			   |	ЕСТЬNULL(УпущенныйСпросЗаПериод.УпущенныйСпрос6, 0) КАК УпущенныйСпрос6,
	            			   |	НоменклатураДляРАсчетаСоСпециальнымиКлассамиКонтроля.ПериодичностьЗаказов КАК ПериодичностьЗаказов,
	            			   |	НоменклатураДляРАсчетаСоСпециальнымиКлассамиКонтроля.СтандартныйСрокПоставки КАК СтандартныйСрокПоставки,
	            			   |	НоменклатураДляРАсчетаСоСпециальнымиКлассамиКонтроля.ЗапасНаПревышениеСрокаПоставки КАК ЗапасНаПревышениеСрокаПоставки,
	            			   |	НоменклатураДляРАсчетаСоСпециальнымиКлассамиКонтроля.КоэффициентУдовлетворенияСпроса КАК ПроцентУдовлетворенияСпроса,
	            			   |	РАЗНОСТЬДАТ(НоменклатураДляРАсчетаСоСпециальнымиКлассамиКонтроля.ДатаПоследнегоСпроса, &ДатаРасчета, ДЕНЬ) КАК ДнейБезДвижения,
	            			   |	НоменклатураДляРАсчетаСоСпециальнымиКлассамиКонтроля.КлассКонтроляПредыдущий,
	            			   |	НоменклатураДляРАсчетаСоСпециальнымиКлассамиКонтроля.Номенклатура.Артикул КАК Артикул,
	            			   |	НоменклатураДляРАсчетаСоСпециальнымиКлассамиКонтроля.Номенклатура.СкладскойПризнак КАК СкладскойПризнак,
	            			   |	НоменклатураДляРАсчетаСоСпециальнымиКлассамиКонтроля.Номенклатура.Производитель КАК Производитель
	            			   |ИЗ
	            			   |	НоменклатураДляРАсчетаСоСпециальнымиКлассамиКонтроля КАК НоменклатураДляРАсчетаСоСпециальнымиКлассамиКонтроля
	            			   |		ЛЕВОЕ СОЕДИНЕНИЕ СпросЗаПериод КАК СпросЗаПериод
	            			   |		ПО НоменклатураДляРАсчетаСоСпециальнымиКлассамиКонтроля.Номенклатура = СпросЗаПериод.Номенклатура
	            			   |		ЛЕВОЕ СОЕДИНЕНИЕ УпущенныйСпросЗаПериод КАК УпущенныйСпросЗаПериод
	            			   |		ПО НоменклатураДляРАсчетаСоСпециальнымиКлассамиКонтроля.Номенклатура = УпущенныйСпросЗаПериод.Номенклатура
	            			   |		ЛЕВОЕ СОЕДИНЕНИЕ ЗЧВПроизводстве КАК ЗЧВПроизводстве
	            			   |		ПО НоменклатураДляРАсчетаСоСпециальнымиКлассамиКонтроля.Номенклатура = ЗЧВПроизводстве.Номенклатура";
							   
	ТекстОтбора = " Истина";						   
	
	//Если ОтборПоФильтруСкладскойПризнак Тогда
	//	ТекстОТбора = ТекстОтбора + " И " +?(ТипОтбораСкладскойПризнак = "Входит в список", "", "НЕ ") + "Номенклатура.СкладскойПризнак В (&СписокОтбораСкладскойПризнак)";
	//КонецЕсли;
	
	Если ОтборПоФильтруПроизводитель Тогда
		ТекстОТбора = ТекстОтбора + " И " +?(ТипОтбораПроизводитель = "Входит в список", "", "НЕ ") + "Номенклатура.Производитель В (&СписокОтбораПроизводитель)";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборНоменклатуры", ТекстОТбора);
	
	ЗапросНоменклатуры.Текст = ТекстЗапроса;
	ЗапросНоменклатуры.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпанииДляРасчета);
	//Гэндальф+++
	ЗапросНоменклатуры.УстановитьПараметр("ДатаICCПрош", НачалоМесяца(ДатаРасчета)-1 );
    //Гэндальф---
	ЗапросНоменклатуры.УстановитьПараметр("ДатаРасчета", ДатаРасчета);
	ЗапросНоменклатуры.УстановитьПараметр("НашиКомпании", ГруппаСобственныхКонтрагентов);
	
	//Бондаренко++ 20170907
	ЗапросНоменклатуры.УстановитьПараметр("ОптовыеКомпании", ГруппаОптовыхКонтрагентов);
	//Бондаренко-- 20170907
	
	ЗапросНоменклатуры.УстановитьПараметр("КоэффициентУдовлетворенияСпроса", ПроцентУдовлетворенияСпроса); 
	ЗапросНоменклатуры.УстановитьПараметр("ПериодичностьЗаказов", ПериодичностьЗаказов);
	ЗапросНоменклатуры.УстановитьПараметр("СтандартныйСрокПоставки", СтандартныйСрокПоставки);
	ЗапросНоменклатуры.УстановитьПараметр("ЗапасНаПревышениеСрокаПоставки", ЗапасНаПревышениеСрокаПоставки);
	
	//Бондаренко 20151230 ++
	СписокОтбораНоменклатура = Неопределено;
	Если НЕ СтруктураПараметров.Свойство("СписокОтбораНоменклатура", СписокОтбораНоменклатура) Тогда
		СписокОтбораНоменклатура = Новый СписокЗначений;
		//СписокОтбораНоменклатура.Добавить(Справочники.Номенклатура.НайтиПоКоду("ЦБ253648"));
	КОнецЕсли;
	//Бондаренко 20151230 --

	
	СписокОтбораСкладскойПризнак = Неопределено;
	Если НЕ СтруктураПараметров.Свойство("СписокОтбораСкладскойПризнак", СписокОтбораСкладскойПризнак) Тогда
		СписокОтбораСкладскойПризнак = Новый СписокЗначений;
	КОнецЕсли;
	
	СписокОтбораПроизводитель = Неопределено;
	Если НЕ СтруктураПараметров.Свойство("СписокОтбораПроизводитель", СписокОтбораПроизводитель) Тогда
		СписокОтбораПроизводитель = Новый СписокЗначений;
	КОнецЕсли;
	
	//Бондаренко 20151230 ++
	ЗапросНоменклатуры.УстановитьПараметр("СписокОтбораНоменклатура", СписокОтбораНоменклатура);
	//Бондаренко 20151230 --
	
	ЗапросНоменклатуры.УстановитьПараметр("СписокОтбораСкладскойПризнак", СписокОтбораСкладскойПризнак);
	ЗапросНоменклатуры.УстановитьПараметр("СписокОтбораПроизводитель", СписокОтбораПроизводитель);
	//ЗапросНоменклатуры.УстановитьПараметр("УчитыватьЗЧВПроизводстве", УчитыватьЗЧВПроизводстве);
	ЗапросНоменклатуры.УстановитьПараметр("УчитыватьЗЧВПроизводстве", Ложь);

	
	//ДатаНачала6 = НачалоДня(ДатаРасчета) - 30*86400;
	//ДатаОкончания6 = НачалоДня(ДатаРасчета)-1;
	
	ДатаНачала6 = НачалоМесяца(НачалоДня(ДатаРасчета) - 1);
	ДатаОкончания6 = КонецМесяца(НачалоДня(ДатаРасчета)-1);
	
	ЗапросНоменклатуры.УстановитьПараметр("ДатаНачала6", ДатаНачала6);
	ЗапросНоменклатуры.УстановитьПараметр("ДатаОкончания6", ДатаОкончания6);
	
	ДатаНач   =  НачалоМесяца(ДатаНачала6);
	ДатаКон   =  КонецМесяца(ДатаОкончания6);
	
	ДатаНач   = НачалоМесяца(ДобавитьМесяц(ДатаНач,-1));
	ДатаКон   = КонецМесяца(ДобавитьМесяц(ДатаКон,-1));

	Для СЧ = 1 ПО 5 Цикл
		//ЗапросНоменклатуры.УстановитьПараметр("ДатаНачала"+(6-СЧ), ДатаНачала6 - 30*СЧ*86400);
		//ЗапросНоменклатуры.УстановитьПараметр("ДатаОкончания"+(6-СЧ), ДатаОкончания6 - 30*СЧ*86400);
				
		ЗапросНоменклатуры.УстановитьПараметр("ДатаНачала"+(6-СЧ),    ДатаНач);
		ЗапросНоменклатуры.УстановитьПараметр("ДатаОкончания"+(6-СЧ), ДатаКон );

		ДатаНач   = НачалоМесяца( ДобавитьМесяц(ДатаНач,-1));
		ДатаКон   = КонецМесяца(ДобавитьМесяц(ДатаКон,-1));
	КонецЦикла;
	
	ТаблицаНоменклатурыИСпроса =  ЗапросНоменклатуры.Выполнить().Выгрузить();
	
	//Бондаренко 20151230 ++
	Если Отладка Тогда
	
		ТЗ = ПолучитьДанныеВременнойТаблицы(ЗапросНоменклатуры, "ПараметрыПоставщиков");
		ТЗ.ВыбратьСтроку("Параметры поставщиков. Строк = "+ТЗ.Количество());
	
		ТЗ = ПолучитьДанныеВременнойТаблицы(ЗапросНоменклатуры, "НоменклатураДляРасчета");
		ТЗ.ВыбратьСтроку("Номенклатура для расчета. Строк = "+ТЗ.Количество());
		
		ТЗ = ПолучитьДанныеВременнойТаблицы(ЗапросНоменклатуры, "НоменклатураДляРАсчетаСоСпециальнымиКлассамиКонтроля");
		ТЗ.ВыбратьСтроку("Номенклатура для расчета со специальными классами контроля. Строк = "+ТЗ.Количество());
		
		ТЗ = ПолучитьДанныеВременнойТаблицы(ЗапросНоменклатуры, "СпросЗаПериод");
		ТЗ.ВыбратьСтроку("Спрос за период. Строк = "+ТЗ.Количество());
		
		ТЗ = ПолучитьДанныеВременнойТаблицы(ЗапросНоменклатуры, "ЗЧВПроизводстве");
		ТЗ.ВыбратьСтроку("Запчасти в производстве. Строк = "+ТЗ.Количество());
		
		ТЗ = ПолучитьДанныеВременнойТаблицы(ЗапросНоменклатуры, "УпущенныйСпросЗаПериод");
		ТЗ.ВыбратьСтроку("Упущенный спрос за период. Строк = "+ТЗ.Количество());
		
 		ТаблицаНоменклатурыИСпроса.ВыбратьСтроку("Таблица номенклатуры и спроса ДО пересчета. Строк = "+ТаблицаНоменклатурыИСпроса.Количество());
  		
	КонецЕсли; 
  	//Бондаренко 20151230 --
 	
	ТаблицаНоменклатурыИСпроса.Колонки.Добавить("СреднемесячныйСпрос");
	ТаблицаНоменклатурыИСпроса.Колонки.Добавить("ЗапасНаПревышениеСпроса");
	
	ТаблицаНоменклатурыИСпроса.Колонки.Добавить("СтандартноеКоличествоРасчетное");
	ТаблицаНоменклатурыИСпроса.Колонки.Добавить("СтандартноеКоличествоИтоговое");
	ТаблицаНоменклатурыИСпроса.Колонки.Добавить("КлассКонтроля");
	
	Состояние("Расчет среднемесячного спроса");

	Если Протокол Тогда
	    Сообщить("Пересчет среднемесячного спроса и запаса на превышение спроса");
		Сообщить("-------------------------------------------------------------");
	КонецЕсли; 
	
	ёё = 0;
	ВсегоСтрок = ТаблицаНоменклатурыИСпроса.Количество();
 	
	Для Каждого СтрокаТаблицыНоменклатуры Из ТаблицаНоменклатурыИСпроса Цикл
		ОбработкаПрерыванияПользователя();
		
		ёё = ёё + 1;
		Состояние("Расчет строки "+СокрЛП(ёё)+" из "+ВсегоСтрок);
		
		Если Протокол Тогда
		    Сообщить("Обрабатывается "+СтрокаТаблицыНоменклатуры.Номенклатура);
  		КонецЕсли; 
		КоличествоПериодов = ?(СтрокаТаблицыНоменклатуры.КоличествоПериодовРасчетаПоПозиции<> 0,СтрокаТаблицыНоменклатуры.КоличествоПериодовРасчетаПоПозиции, 1);
		СуммаСпрос = 0;
		СуммаУпущенныйСпрос = 0;
		МаксимальныйСпрос = 0;
		Для СЧ = 0 ПО КоличествоПериодов-1 Цикл
			
			СуммаСпрос = СуммаСпрос + СтрокаТаблицыНоменклатуры["Спрос"+(КоличествоПериодов-СЧ)];
			Если Протокол Тогда
				Сообщить("Текущий спрос = "+СтрокаТаблицыНоменклатуры["Спрос"+(КоличествоПериодов-СЧ)]+"; Суммарный спрос = "+СуммаСпрос)
 			КонецЕсли;
			
			МаксимальныйСпрос = Макс(МаксимальныйСпрос,СтрокаТаблицыНоменклатуры["Спрос"+(КоличествоПериодов-СЧ)]+СтрокаТаблицыНоменклатуры["УпущенныйСпрос"+(КоличествоПериодов-СЧ)]*КоэффициентУчетаУпущенногоСпроса);
			Если Протокол Тогда
				Сообщить("Максимальный спрос = "+МаксимальныйСпрос+"; КоэффициентУчетаУпущенногоСпроса = "+КоэффициентУчетаУпущенногоСпроса);
 			КонецЕсли;
			
			СуммаУпущенныйСпрос = СуммаУпущенныйСпрос + СтрокаТаблицыНоменклатуры["УпущенныйСпрос" + (КоличествоПериодов-СЧ)];
			Если Протокол Тогда
				Сообщить("Сумма упущенного спроса = "+СуммаУпущенныйСпрос);
 			КонецЕсли;
			
		КонецЦикла;
		
		//Бондаренко 20160523 ++
		Если СтрокаТаблицыНоменклатуры.ПроцентУдовлетворенияСпроса > 0 Тогда
			ПроцентУдовлетворенияСпроса = СтрокаТаблицыНоменклатуры.ПроцентУдовлетворенияСпроса;
			Если Протокол Тогда
				Сообщить("Внимание! Установили ПроцентУдовлетворенияСпроса из текущей строки таблицы Номенклатуры = "+ПроцентУдовлетворенияСпроса);
 			КонецЕсли; 
		КонецЕсли; 
		//Бондаренко 20160523 --
		
		СтрокаТаблицыНоменклатуры.СреднемесячныйСпрос = Окр((СуммаСпрос + СуммаУпущенныйСпрос*КоэффициентУчетаУпущенногоСпроса)/КоличествоПериодов,2);
 		СтрокаТаблицыНоменклатуры.ЗапасНаПревышениеСпроса = Окр(?(СтрокаТаблицыНоменклатуры.СреднемесячныйСпрос <>0 ,((ПроцентУдовлетворенияСпроса/100)*МаксимальныйСпрос - СтрокаТаблицыНоменклатуры.СреднемесячныйСпрос)/СтрокаТаблицыНоменклатуры.СреднемесячныйСпрос, 0),2);
		СтрокаТаблицыНоменклатуры.ЗапасНаПревышениеСпроса = ?(СтрокаТаблицыНоменклатуры.ЗапасНаПревышениеСпроса<0,0,СтрокаТаблицыНоменклатуры.ЗапасНаПревышениеСпроса);
		Если Протокол Тогда
		    Сообщить("Среднемесячный спрос = "+СтрокаТаблицыНоменклатуры.СреднемесячныйСпрос+"; КоэффициентУчетаУпущенногоСпроса = "+КоэффициентУчетаУпущенногоСпроса);
			Сообщить("Формула => СтрокаТаблицыНоменклатуры.СреднемесячныйСпрос = Окр((СуммаСпрос + СуммаУпущенныйСпрос*КоэффициентУчетаУпущенногоСпроса)/КоличествоПериодов,2)");
			Сообщить("Запас на превышение спроса = "+СтрокаТаблицыНоменклатуры.ЗапасНаПревышениеСпроса+"; ПроцентУдовлетворенияСпроса = "+ПроцентУдовлетворенияСпроса);
			Сообщить("Формула => СтрокаТаблицыНоменклатуры.ЗапасНаПревышениеСпроса = Окр(?(СтрокаТаблицыНоменклатуры.СреднемесячныйСпрос <>0 ,((ПроцентУдовлетворенияСпроса/100)*МаксимальныйСпрос - СтрокаТаблицыНоменклатуры.СреднемесячныйСпрос)/СтрокаТаблицыНоменклатуры.СреднемесячныйСпрос, 0),2)");
			Сообщить("......................................................................................");
		КонецЕсли; 
		 
	КонецЦикла;
 	
	//Бондаренко 20151230 ++
	Если Отладка Тогда
		ТаблицаНоменклатурыИСпроса.ВыбратьСтроку("Таблица номенклатуры и спроса ПОСЛЕ пересчета. Строк = "+ТаблицаНоменклатурыИСпроса.Количество());
	КонецЕсли; 
 	//Бондаренко 20151230 --
  	
	Возврат ТаблицаНоменклатурыИСпроса;
КонецФункции

Функция РассчитатьГраничныеЗначения(ТаблицаНоменклатуры,Отладка,Протокол)
	Состояние("Назначение классов контроля");
	ТаблицаНоменклатуры.Сортировать("СреднемесячныйСпрос ВОЗР");
	
	ОбщееКоличествоОбращений = ТаблицаНоменклатуры.Итог("СреднемесячныйСпрос");
	
	//Бондаренко 20160225 ++
	Если Отладка Тогда
		ТаблицаНоменклатуры.ВыбратьСтроку("Для расчета Класса Контроля. Итог по MAD (среднемесячному спросу) = "+ОбщееКоличествоОбращений);			
	КонецЕсли;	
 	//Бондаренко 20160225 --	
	
	Если ОбщееКоличествоОбращений = 0 Тогда
		Для Каждого СтрокаТаблицыРасчетаКК Из ТаблицаНоменклатуры Цикл
			СтрокаТаблицыРасчетаКК.КлассКонтроля = Справочники.MAD_КлассыКонтроля.D1;
		КонецЦикла;
	Иначе
		КумулятивнаяДоля = 0;
		
		Если Протокол Тогда
			Сообщить("Формула => КумулятивнаяДоля = КумулятивнаяДоля + ОКР(СтрокаТаблицыРасчетаКК.СреднемесячныйСпрос*100/ОбщееКоличествоОбращений,4)");
		КонецЕсли; 	

		ёё = 0;
		
		ВсегоСтрок = ТаблицаНоменклатуры.Количество();
		
		Для Каждого СтрокаТаблицыРасчетаКК Из ТаблицаНоменклатуры Цикл
			
			ОбработкаПрерыванияПользователя();
			
			ёё = ёё + 1;
			Состояние("Расчет строки "+СокрЛП(ёё)+" из "+ВсегоСтрок);
 		
			КумулятивнаяДоля = КумулятивнаяДоля + ОКР(СтрокаТаблицыРасчетаКК.СреднемесячныйСпрос*100/ОбщееКоличествоОбращений,4);
 			КумулятивнаяДоля = ?(КумулятивнаяДоля > 100, 100, КумулятивнаяДоля);
			
			Если Протокол Тогда
 			  Сообщить("Среднемесячный cпрос = "+СтрокаТаблицыРасчетаКК.СреднемесячныйСпрос+"; ОбщееКоличествоОбращений = "+ОбщееКоличествоОбращений+"; КумулятивнаяДоля = "+КумулятивнаяДоля);
			КонецЕсли; 

			Если СтрокаТаблицыРасчетаКК.ДнейБезДвижения >= ПериодDeadStock Тогда
				СтрокаТаблицыРасчетаКК.КлассКонтроля = Справочники.MAD_КлассыКонтроля.D1;
			Иначе
				СтрокаТаблицыРасчетаКК.КлассКонтроля = ПолучитьКлассКонтроля(КумулятивнаяДоля,Протокол);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ТаблицаНоменклатуры.Сортировать("КлассКонтроля ВОЗР");
	
	Возврат ТаблицаНоменклатуры;
КонецФункции
	
Функция ПолучитьКлассКонтроля(Доля,Протокол);
	КлассКонтроля = Неопределено;			
	Для Каждого СтрокаГраницыКлассов Из ГраницыКлассовКонтроля Цикл
		Если Доля >= СтрокаГраницыКлассов.ПроцентОт И Доля <= СтрокаГраницыКлассов.ПроцентДо Тогда
			КлассКонтроля = СтрокаГраницыКлассов.КлассКонтроля;
			Если Протокол Тогда
			    Сообщить("Т.к. Доля = "+Доля+" находится между "+СтрокаГраницыКлассов.ПроцентОт+" и "+СтрокаГраницыКлассов.ПроцентДо+" то Класс контроля = "+КлассКонтроля);
 			КонецЕсли; 
		КонецЕслИ;
	КонецЦикла;
	
	Возврат ?(КлассКонтроля = Неопределено, Справочники.MAD_КлассыКонтроля.D1, КлассКонтроля);
КонецФункции
					
Функция РАссчитатьОптимальноеКоличество(ТаблицаНоменклатуры,Отладка,Протокол)
	Состояние("Идёт расчет оптимального запаса склада...");
	ёё = 0;
	ВсегоСтрок = ТаблицаНоменклатуры.Количество(); 
	Для Каждого СтрокаНоменклатуры Из ТаблицаНоменклатуры Цикл
		ОбработкаПрерыванияПользователя();
		ёё = ёё + 1;
		Состояние("Расчет строки "+СокрЛП(ёё)+" из "+ВсегоСтрок);
		СтрокаНоменклатуры.СтандартноеКоличествоРасчетное = ?(СтрокаНоменклатуры.СреднемесячныйСпрос<=ГраницаНеСкладскихПозиций, 0, ОКР(СтрокаНоменклатуры.СреднемесячныйСпрос*(СтрокаНоменклатуры.ПериодичностьЗаказов + СтрокаНоменклатуры.СтандартныйСрокПоставки + СтрокаНоменклатуры.ЗапасНаПревышениеСрокаПоставки + СтрокаНоменклатуры.ЗапасНаПревышениеСпроса),0));
		Если Протокол Тогда
		    Сообщить("Формула => СтрокаНоменклатуры.СтандартноеКоличествоРасчетное = ?(СтрокаНоменклатуры.СреднемесячныйСпрос<=ГраницаНеСкладскихПозиций, 0, ОКР(СтрокаНоменклатуры.СреднемесячныйСпрос*(СтрокаНоменклатуры.ПериодичностьЗаказов + СтрокаНоменклатуры.СтандартныйСрокПоставки + СтрокаНоменклатуры.ЗапасНаПревышениеСрокаПоставки + СтрокаНоменклатуры.ЗапасНаПревышениеСпроса),0))");
			Сообщить("Среднемесячный cпрос = "+СтрокаНоменклатуры.СреднемесячныйСпрос+" ГраницаНеСкладскихПозиций = "+ГраницаНеСкладскихПозиций+" Периодичность заказов = " + СтрокаНоменклатуры.ПериодичностьЗаказов + " Стандартный cрок поставки = "+СтрокаНоменклатуры.СтандартныйСрокПоставки + "; Запас на превышение срока поставки = "+СтрокаНоменклатуры.ЗапасНаПревышениеСрокаПоставки+"; Запас на превышение спроса = "+СтрокаНоменклатуры.ЗапасНаПревышениеСпроса);
 		КонецЕсли; 
		//Если нужно, применим свойства специального класса контроля
		Если СтрокаНоменклатуры.СпециальныйКлассКонтроля.НеСкладскаяПозиция Тогда
			СтрокаНоменклатуры.СтандартноеКоличествоИтоговое = 0;
			Если Протокол Тогда
				Сообщить("Т.к. СтрокаНоменклатуры.СпециальныйКлассКонтроля.НеСкладскаяПозиция = "+СтрокаНоменклатуры.СпециальныйКлассКонтроля.НеСкладскаяПозиция+" то Стандартное количество итоговое = "+СтрокаНоменклатуры.СтандартноеКоличествоИтоговое);
			КонецЕсли;	
		ИначеЕсли СтрокаНоменклатуры.СпециальныйКлассКонтроля.РучноеСтандартноеКоличество Тогда
			СтрокаНоменклатуры.СтандартноеКоличествоИтоговое = СтрокаНоменклатуры.СтандартноеКоличествоПрошлое;
			Если Протокол Тогда
				Сообщить("Т.к. Ручное cтандартное количество = "+СтрокаНоменклатуры.СпециальныйКлассКонтроля.РучноеСтандартноеКоличество+" то Стандартное количество итоговое = Стандартное количество прошлое: "+СтрокаНоменклатуры.СтандартноеКоличествоПрошлое);
			КонецЕсли;	
		ИначеЕсли СтрокаНоменклатуры.СпециальныйКлассКонтроля.ИзменитьСтандартноеКоличество Тогда
			Если Протокол Тогда
				Сообщить("Т.к. СтрокаНоменклатуры.СпециальныйКлассКонтроля.ИзменитьСтандартноеКоличество = "+СтрокаНоменклатуры.СпециальныйКлассКонтроля.ИзменитьСтандартноеКоличество);
			КонецЕсли;		
			Если СтрокаНоменклатуры.СпециальныйКлассКонтроля.ТипИзмененияСтандартногоКоличества = "Абсолютный" Тогда
				СтрокаНоменклатуры.СтандартноеКоличествоИтоговое = СтрокаНоменклатуры.СпециальныйКлассКонтроля.ИзменениеСтандартногоКоличества;
				Если Протокол Тогда 
					Сообщить("Т.к. СтрокаНоменклатуры.СпециальныйКлассКонтроля.ТипИзмененияСтандартногоКоличества = 'Абсолютный')"); 
					Сообщить("то по формуле: СтрокаНоменклатуры.СтандартноеКоличествоИтоговое = СтрокаНоменклатуры.СпециальныйКлассКонтроля.ИзменениеСтандартногоКоличества");
					Сообщить(" Стандартное количество итоговое "+СтрокаНоменклатуры.СпециальныйКлассКонтроля.ИзменениеСтандартногоКоличества);
				КонецЕсли;		
 			Иначе
				Выполнить("СтрокаНоменклатуры.СтандартноеКоличествоИтоговое = СтрокаНоменклатуры.СтандартноеКоличествоРасчетное"+ СтрокаНоменклатуры.СпециальныйКлассКонтроля.ИзменениеСтандартногоКоличества);
				Если Протокол Тогда
				    Сообщить("то по формуле:  Выполнить(СтрокаНоменклатуры.СтандартноеКоличествоИтоговое = СтрокаНоменклатуры.СтандартноеКоличествоРасчетное + СтрокаНоменклатуры.СпециальныйКлассКонтроля.ИзменениеСтандартногоКоличества)");
					Сообщить("Вычисляем Стандартное количество итоговое = "+СтрокаНоменклатуры.СтандартноеКоличествоИтоговое);
 				КонецЕсли; 
			КонецЕсли;
		Иначе
 			СтрокаНоменклатуры.СтандартноеКоличествоИтоговое = СтрокаНоменклатуры.СтандартноеКоличествоРасчетное;
			Если Протокол Тогда
				Сообщить("Т.к. СтрокаНоменклатуры.СпециальныйКлассКонтроля.НеСкладскаяПозиция = "+СтрокаНоменклатуры.СпециальныйКлассКонтроля.НеСкладскаяПозиция);
			    Сообщить("то по формуле:  СтрокаНоменклатуры.СтандартноеКоличествоИтоговое = СтрокаНоменклатуры.СтандартноеКоличествоРасчетное");
				Сообщить("Вычисляем Стандартное количество итоговое = "+СтрокаНоменклатуры.СтандартноеКоличествоИтоговое);
 			КонецЕсли; 
 		КонецЕсли;
	КонецЦикла;
	Возврат ТаблицаНоменклатуры;
КонецФункции

Процедура ЗаполнитьТаблицуИРасчитать(СтруктураПараметров,Отладка,Протокол) Экспорт
	ТаблицаНоменклатуры = ПолучитьСписокНоменклатурыДляРасчета(ПодразделениеКомпании, СтруктураПараметров,Отладка,Протокол);
	ТаблицаНоменклатуры = РассчитатьГраничныеЗначения(ТаблицаНоменклатуры,Отладка,Протокол);
	ТаблицаНоменклатуры = РАссчитатьОптимальноеКоличество(ТаблицаНоменклатуры,Отладка,Протокол);
 	ПараметрыРасчета.Загрузить(ТаблицаНоменклатуры);
	
	//А теперь посчитаем сезонные факторы
	//Бондаренко++ 20190327
	//РассчитатьСезонныйФактор();
	Если ФлагУчетаСезонности Тогда
		РассчитатьСезонныйФактор();
	Иначе
		СезонныеФакторы.Очистить();
 	КонецЕсли; 
 	//Бондаренко-- 20190327
КонецПроцедуры

//Корельский 2015{
////////////////////////////////////////////////////////////////////////////////
///////////// ФУНКЦИИ ДЛЯ РАСЧЕТА СЕЗОННОГО ФАКТОРА ПО НОМЕНКЛАТУРЕ ////////////
////////////////////////////////////////////////////////////////////////////////
Процедура РассчитатьСезонныйФактор()
	СезонныеФакторы.Очистить();
	
	НомеклатураДляРасчета = ПараметрыРасчета.ВыгрузитьКолонку("Номенклатура");
	ЗапросСезонногоФактора = Новый Запрос;
	ЗапросСезонногоФактора.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	//Все параметры, которые необходимы
	ЗапросСезонногоФактора.УстановитьПараметр("ДатаРасчета", НачалоМесяца(ДатаРасчета));
	ЗапросСезонногоФактора.УстановитьПараметр("ПодразделениеДляРасчета", ПодразделениеКомпанииДляРасчета);
	ЗапросСезонногоФактора.УстановитьПараметр("ПереченьНоменклатурыДляРасчета", НомеклатураДляРасчета);
	ЗапросСезонногоФактора.УстановитьПараметр("НашиФирмы", ГруппаСобственныхКонтрагентов);
	ЗапросСезонногоФактора.УстановитьПараметр("ПодразделениеДляРасчета", ПодразделениеКомпанииДляРасчета);
	//
	ЗапросСезонногоФактора.Текст = "ВЫБРАТЬ
	                               |	Номенклатура.Ссылка
	                               |ПОМЕСТИТЬ ПодходящаяНоменклатура
	                               |ИЗ
	                               |	Справочник.Номенклатура КАК Номенклатура
	                               |ГДЕ
	                               |	Номенклатура.Ссылка В(&ПереченьНоменклатурыДляРасчета)
	                               |	И РАЗНОСТЬДАТ(Номенклатура.Дата, &ДатаРасчета, МЕСЯЦ) > 24
	                               |;
	                               |
	                               |////////////////////////////////////////////////////////////////////////////////
	                               |ВЫБРАТЬ
	                               |	ПодходящаяНоменклатура.Ссылка КАК Номенклатура,
	                               |	ПродажиОбороты.Период,
	                               |	ПродажиОбороты.КоличествоОборот КАК Количество
	                               |ПОМЕСТИТЬ ВсеПродажи
	                               |ИЗ
	                               |	ПодходящаяНоменклатура КАК ПодходящаяНоменклатура
	                               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(
	                               |				ДОБАВИТЬКДАТЕ(&ДатаРасчета, МЕСЯЦ, -24),
	                               |				&ДатаРасчета,
	                               |				Месяц,
	                               |				ПодразделениеКомпании В ИЕРАРХИИ (&ПодразделениеДляРасчета)
	                               |					И НЕ Покупатель В ИЕРАРХИИ (&НашиФирмы)) КАК ПродажиОбороты
	                               |		ПО ПодходящаяНоменклатура.Ссылка = ПродажиОбороты.Номенклатура
	                               |;
	                               |
	                               |////////////////////////////////////////////////////////////////////////////////
	                               |ВЫБРАТЬ
	                               |	ПодходящаяНоменклатура.Ссылка КАК Номенклатура,
	                               |	СУММА(ВЫБОР
	                               |			КОГДА ВсеПродажи.Период < ДОБАВИТЬКДАТЕ(&ДатаРасчета, МЕСЯЦ, -12)
	                               |				ТОГДА ВсеПродажи.Количество
	                               |			ИНАЧЕ 0
	                               |		КОНЕЦ) КАК Продажи2ГодаНазад,
	                               |	СУММА(ВЫБОР
	                               |			КОГДА ВсеПродажи.Период >= ДОБАВИТЬКДАТЕ(&ДатаРасчета, МЕСЯЦ, -12)
	                               |				ТОГДА ВсеПродажи.Количество
	                               |			ИНАЧЕ 0
	                               |		КОНЕЦ) КАК ПродажиГодНазад
	                               |ПОМЕСТИТЬ ИтоговыеПродажиПоГодам
	                               |ИЗ
	                               |	ПодходящаяНоменклатура КАК ПодходящаяНоменклатура
	                               |		ЛЕВОЕ СОЕДИНЕНИЕ ВсеПродажи КАК ВсеПродажи
	                               |		ПО ПодходящаяНоменклатура.Ссылка = ВсеПродажи.Номенклатура
	                               |
	                               |СГРУППИРОВАТЬ ПО
	                               |	ПодходящаяНоменклатура.Ссылка";
	ЗапросСезонногоФактора.Выполнить();
	
	ЗапросСезонногоФактора.Текст = "ВЫБРАТЬ
	                               |	ПодходящаяНоменклатура.Ссылка КАК Номенклатура,
	                               |	СУММА(ВсеПродажиГодНазад.Количество) КАК ПродажиЗаМесяцГодНазад,
	                               |	СУММА(ВсеПродажи2ГодаНазад.Количество) КАК ПродажиЗаМесяц2ГодаНазад
	                               |ПОМЕСТИТЬ СуммаЗаПериод
	                               |ИЗ
	                               |	ПодходящаяНоменклатура КАК ПодходящаяНоменклатура
	                               |		ЛЕВОЕ СОЕДИНЕНИЕ ВсеПродажи КАК ВсеПродажиГодНазад
	                               |		ПО ПодходящаяНоменклатура.Ссылка = ВсеПродажиГодНазад.Номенклатура
	                               |			И (ВсеПродажиГодНазад.Период = ДОБАВИТЬКДАТЕ(&ПериодРасчета, МЕСЯЦ, -12))
	                               |		ЛЕВОЕ СОЕДИНЕНИЕ ВсеПродажи КАК ВсеПродажи2ГодаНазад
	                               |		ПО ПодходящаяНоменклатура.Ссылка = ВсеПродажи2ГодаНазад.Номенклатура
	                               |			И (ВсеПродажи2ГодаНазад.Период = ДОБАВИТЬКДАТЕ(&ПериодРасчета, МЕСЯЦ, -24))
	                               |
	                               |СГРУППИРОВАТЬ ПО
	                               |	ПодходящаяНоменклатура.Ссылка
	                               |;
	                               |
	                               |////////////////////////////////////////////////////////////////////////////////
	                               |ВЫБРАТЬ
	                               |	СуммаЗаПериод.Номенклатура КАК Номенклатура,
	                               |	&ПериодРасчета КАК МесяцРасчета,
	                               |	ВЫБОР
	                               |		КОГДА ЕСТЬNULL(ИтоговыеПродажиПоГодам.ПродажиГодНазад, 0) <> 0
	                               |			ТОГДА ЕСТЬNULL(СуммаЗаПериод.ПродажиЗаМесяцГодНазад, 0) / (ИтоговыеПродажиПоГодам.ПродажиГодНазад / 12)
	                               |		ИНАЧЕ 0
	                               |	КОНЕЦ КАК SFГодНазад,
	                               |	ВЫБОР
	                               |		КОГДА ЕСТЬNULL(ИтоговыеПродажиПоГодам.Продажи2ГодаНазад, 0) <> 0
	                               |			ТОГДА ЕСТЬNULL(СуммаЗаПериод.ПродажиЗаМесяц2ГодаНазад, 0) / (ИтоговыеПродажиПоГодам.Продажи2ГодаНазад / 12)
	                               |		ИНАЧЕ 0
	                               |	КОНЕЦ КАК SF2ГодаНазад,
	                               |	(ВЫБОР
	                               |		КОГДА ЕСТЬNULL(ИтоговыеПродажиПоГодам.ПродажиГодНазад, 0) <> 0
	                               |			ТОГДА ЕСТЬNULL(СуммаЗаПериод.ПродажиЗаМесяцГодНазад, 0) / (ИтоговыеПродажиПоГодам.ПродажиГодНазад / 12)
	                               |		ИНАЧЕ 0
	                               |	КОНЕЦ + ВЫБОР
	                               |		КОГДА ЕСТЬNULL(ИтоговыеПродажиПоГодам.Продажи2ГодаНазад, 0) <> 0
	                               |			ТОГДА ЕСТЬNULL(СуммаЗаПериод.ПродажиЗаМесяц2ГодаНазад, 0) / (ИтоговыеПродажиПоГодам.Продажи2ГодаНазад / 12)
	                               |		ИНАЧЕ 0
	                               |	КОНЕЦ) / 2 КАК Значение,
								   |	ложь КАК Искусственный
	                               |ИЗ
	                               |	СуммаЗаПериод КАК СуммаЗаПериод
	                               |		ЛЕВОЕ СОЕДИНЕНИЕ ИтоговыеПродажиПоГодам КАК ИтоговыеПродажиПоГодам
	                               |		ПО СуммаЗаПериод.Номенклатура = ИтоговыеПродажиПоГодам.Номенклатура
	                               |;
	                               |
	                               |////////////////////////////////////////////////////////////////////////////////
	                               |УНИЧТОЖИТЬ СуммаЗаПериод";
								   
	Для СЧ = 0 ПО 5 Цикл
		ЗапросСезонногоФактора.УстановитьПараметр("ПериодРасчета", ДобавитьМесяц(НачалоМесяца(ДатаРасчета), СЧ));
		
		ТаблицаСезонныхФакторов = ЗапросСезонногоФактора.Выполнить().Выгрузить();
		Для Каждого СтрокаСезонногоФактора Из ТаблицаСезонныхФакторов Цикл
			СтрокаТаблицыСФ = СезонныеФакторы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыСФ, СтрокаСезонногоФактора);
		КонецЦикла;
	КонецЦикла;
	
	//А теперь необходимо заполнить искусственный спрос, для значений, по которым не накопилось еще 2 года спроса
	ЗапросНоменклатурыМоложе2Лет = Новый Запрос();
	ЗапросНоменклатурыМоложе2Лет.Текст = "ВЫБРАТЬ
	                                     |	Номенклатура.Ссылка КАК Номенклатура
	                                     |ИЗ
	                                     |	Справочник.Номенклатура КАК Номенклатура
	                                     |ГДЕ
	                                     |	Номенклатура.Ссылка В(&ПереченьНоменклатурыДляПроверки)
	                                     |	И РАЗНОСТЬДАТ(Номенклатура.Дата, &ДатаРасчета, МЕСЯЦ) <= 24";
	ЗапросНоменклатурыМоложе2Лет.УстановитьПараметр("ПереченьНоменклатурыДляПроверки", НомеклатураДляРасчета);
	ЗапросНоменклатурыМоложе2Лет.УстановитьПараметр("ДатаРасчета", НачалоМесяца(ДатаРасчета));
	
	ВыборкаНоменклатурыМоложе2Лет = ЗапросНоменклатурыМоложе2Лет.Выполнить().Выбрать();
	Пока ВыборкаНоменклатурыМоложе2Лет.Следующий() Цикл
		Для СЧ = 0 ПО 5 Цикл
			СтрокаТаблицыСФ = СезонныеФакторы.Добавить();
			СтрокаТаблицыСФ.Номенклатура = ВыборкаНоменклатурыМоложе2Лет.Номенклатура;
			СтрокаТаблицыСФ.МесяцРасчета = ДобавитьМесяц(НачалоМесяца(ДатаРасчета), СЧ);
			СтрокаТаблицыСФ.Значение = 1;
			СтрокаТаблицыСФ.Искусственный = истина;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

//Сервисная функция, для просмотра временных таблиц
Функция ПросмотретьВременнуюТаблицу(МенеджерВременныхТаблиц, ИмяТаблицы) Экспорт
	ЗапросПросмотрщик = Новый Запрос();
	ЗапросПросмотрщик.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросПросмотрщик.Текст = "ВЫБРАТЬ * ИЗ "+ИмяТаблицы+" КАК ПросматриваемаяТаблица";
	Попытка
		Возврат ЗапросПросмотрщик.Выполнить().Выгрузить();
	Исключение
		Возврат ОписаниеОшибки();
	КонецПопытки;
КонецФункции
//

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	
	Возврат ОбязательныеРеквизиты;
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Проверяет корректность заполнения объекта.
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры:
//  Ошибки       - строка, в случае некорректного заполнения содержит описанием возникших ошибок, 
//  ДопРеквизиты - структура, на вход может быть передана структура с дополнительными реквизитами для проверки,
//  Заполнение   - булево, флаг проверки, 
//  Уникальность - булево, флаг проверки.
//
// Возвращаемое значение:
//  Булево - Возвращает Истина если все заполнено корректно и Ложь иначе.
// 
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	
	//Бондаренко++ 20260206
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		//Бондаренко-- 20260206	
		Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
		//Бондаренко++ 20260206	
	Иначе	
		Результат = Истина;
	КонецЕсли;
	//Бондаренко-- 20260206
 	
	Возврат Результат;
КонецФункции // ПроверитьКорректность()
 
// Функция проверяет, допустимо ли изменение объекта
//
// Параметры:
//  БлокироватьРеквизиты - структура, структура блокируемых на изменение реквизитов.
//
// Возвращаемое значение:
// Булево - Возвращает Истина, если изменения возможны, ложь иначе
//          Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
//
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции // ДоступностьИзменения()

// Возвращает список возможных хозяйственных операций документа
// Вовращаемое значение: 
//  СписокЗначений. 
//  Строка списка: Значение - имя предопределенного элемента; 
//				   Представление - красивое его представление
// 				   "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("РасчетПараметровУправленияЗапасами","Расчет параметров запасов склада",Истина);

	Возврат СписокХозОпераций;
КонецФункции // ПолучитьСписокХозОпераций()

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка			– Имя реквизита документа с полным путем (например Тавары.Номенклатура).
//  ЭтаФорма	– Форма				– Ссылка на форму документа. Если значение неопределено, производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Стркутура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
КонецФункции // ОбработкаРеквизита()

// Заполнение свойств из документа основания
//
Процедура ЗаполнитьСвойстваНаОсновании(Основание) Экспорт
 //зарезервировано для описания заполнения свойств из свойств основания
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

#Если Клиент Тогда

//Функция печати этикеток и ценников
// 
// Параметры:
//  ТабДокумент - табличный документ.
//
Функция ПечатьЭтикетокИЦенников(ТабДокумент) Экспорт
	дкПечатьЭтикетокИЦенников(ЭтотОбъект);
КонецФункции // ПечатьЭтикетокИЦенников()

// Функция осуществляет печать произвольного документа.
// Можно направить печать на экран или принтер, а также распечатать необходмое количество копий.
//
// Параметры:
//	ЭтотОбъект							- ДокументОбъект	- Документ для печати
//	НазваниеПечатнойФормы 				- Строка			- Название печатной формы, если пусто, то по умолчанию
//	КоличествоЭкземпляров				- Число				- Количество экземпляров документа
//	НаПринтер							- Булево			- Признак отправки документа на принтер без отображения его на экране
//  Документ 	  						- ТабличныйДокумент	- Макет печатной формы
//
// Возвращаемое значение:
//   ТабличныйДокумент	- Сформированная печатная форма
//
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции // Печать()

// Возвращает доступные варианты печати документа
// Вовращаемое значение: 
//  Струткура, каждая строка которой
//  соответствует одному из вариантов печати
//  Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм() Экспорт
	СтруктураМакетов=Новый Структура();
	Возврат СтруктураМакетов;
КонецФункции // ПолучитьСписокПечатныхФорм()

#КонецЕсли
		
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ
                         
// Обработчик события при установке нового номера
//
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Обработчик события заполнения
//
Процедура ОбработкаЗаполнения(Основание) Экспорт
	Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события при копировании
//
Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриКопировании()

// Обработчик события перед записью
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда Возврат; КонецЕсли;
	СМГ_УдалитьДублиСтрок();
КонецПроцедуры // ПередЗаписью()

// Обработчик события при записи
//
Процедура ПриЗаписи(Отказ)
	
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
     
КонецПроцедуры // ПриЗаписи()

// Обработчик события перед удалением
//
Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	РегистрДвижения = Движения.MAD_РасчетПараметровУправленияЗапасами;
	РегистрДвижения.Очистить();
	Для Каждого СтрокаНоменклатуры Из ПараметрыРасчета Цикл
		СтрокаРегистра = РегистрДвижения.Добавить();
		СтрокаРегистра.Регистратор = Ссылка;
		СтрокаРегистра.Период = ДатаРасчета;
		СтрокаРегистра.ПодразделениеКомпании = ПодразделениеКомпанииДляРасчета;
		СтрокаРегистра.Номенклатура = СтрокаНоменклатуры.Номенклатура;
		СтрокаРегистра.СреднемесячныйСпрос = СтрокаНоменклатуры.СреднемесячныйСпрос;
		СтрокаРегистра.КлассКонтроля = СтрокаНоменклатуры.КлассКонтроля;
		СтрокаРегистра.СпециальныйКлассКонтроля = СтрокаНоменклатуры.СпециальныйКлассКонтроля;
		СтрокаРегистра.СтандартноеКоличество = СтрокаНоменклатуры.СтандартноеКоличествоИтоговое;
		//Бондаренко++ 20170712 на всякий случай закатаю в попытку
		Попытка СтрокаРегистра.СтандартноеКоличествоРасчетное = СтрокаНоменклатуры.СтандартноеКоличествоРасчетное;	Исключение	КонецПопытки;	
		Попытка СтрокаРегистра.РучнаяКорректировка            = СтрокаНоменклатуры.РучнаяКорректировка;	            Исключение	КонецПопытки;	
		//Бондаренко-- 20170712
	КонецЦикла;
	
	//Бондаренко++ 20200110
	РегистрДвижения = Движения.ДополнительныеРеквизитыНоменклатуры;
	РегистрДвижения.Очистить();
	Для Каждого СтрокаНоменклатуры Из ПараметрыРасчета Цикл
	  //  Если обЗначениеНеЗаполнено(СтрокаНоменклатуры.СтандартноеКоличествоРасчетное) Тогда
	  //      Продолжить;
	  //КонецЕсли; 
		СтрокаРегистра = РегистрДвижения.Добавить();
		СтрокаРегистра.Регистратор = Ссылка;
		СтрокаРегистра.Период = ДатаРасчета;
		СтрокаРегистра.ПодразделениеКомпании = ПодразделениеКомпанииДляРасчета;
		СтрокаРегистра.Номенклатура = СтрокаНоменклатуры.Номенклатура;
		СтрокаРегистра.ДополнительныйРеквизит = Перечисления.ДополнительныеРеквизитыНоменклатуры.МинимальныйОстаток;
		Если Не обЗначениеНеЗаполнено(СтрокаНоменклатуры.СтандартноеКоличествоРасчетное) Тогда
			СтрокаРегистра.ЗначениеРеквизита = Окр(СтрокаНоменклатуры.СтандартноеКоличествоРасчетное*0.6,0,РежимОкругления.Окр15как20);
		Иначе
			СтрокаРегистра.ЗначениеРеквизита = 0;
		КонецЕсли;	
 	КонецЦикла;
	//Бондаренко-- 20200110
	
	ЗаписьРегистраСпецКлассаКонтроля = РегистрыСведений.MAD_НазначениеСпециальныхКлассовКонтроля.СоздатьМенеджерЗаписи();
	
	Для Каждого СтрокаНоменклатуры Из УстановкаСпециальныхКлассовКонтроляНаПозицию Цикл
		ЗаписьРегистраСпецКлассаКонтроля.Период = ДатаРасчета;
		ЗаписьРегистраСпецКлассаКонтроля.ПодразделениеКомпании = ПодразделениеКомпанииДляРасчета;
		ЗаписьРегистраСпецКлассаКонтроля.Показатель = СтрокаНоменклатуры.Номенклатура;
		ЗаписьРегистраСпецКлассаКонтроля.Прочитать();
		Если ЗаписьРегистраСпецКлассаКонтроля.Выбран() Тогда
			ЗаписьРегистраСпецКлассаКонтроля.ДокументУстановкиКлассаКонтроля = Ссылка;
			ЗаписьРегистраСпецКлассаКонтроля.СпециальныКлассКонтроля = СтрокаНоменклатуры.СпециальныйКлассКонтроля;
			ЗаписьРегистраСпецКлассаКонтроля.Комментарий = "Установлено документом ""Расчет параметров управления запасами""";
			ЗаписьРегистраСпецКлассаКонтроля.Автор = Автор;
			
			//Бондаренко 20151231 ++
			//ЗаписьРегистраСпецКлассаКонтроля.ДатаОкончания = '00010101';
			ЗаписьРегистраСпецКлассаКонтроля.ДатаОкончания = СтрокаНоменклатуры.ДатаОкончания;
			//Бондаренко 20151231 --
			
			ЗаписьРегистраСпецКлассаКонтроля.Записать();
		Иначе
			ЗаписьРегистраСпецКлассаКонтроля.Период = ДатаРасчета;
			ЗаписьРегистраСпецКлассаКонтроля.ПодразделениеКомпании = ПодразделениеКомпанииДляРасчета;
			ЗаписьРегистраСпецКлассаКонтроля.Показатель = СтрокаНоменклатуры.Номенклатура;
			ЗаписьРегистраСпецКлассаКонтроля.ДокументУстановкиКлассаКонтроля = Ссылка;
			ЗаписьРегистраСпецКлассаКонтроля.СпециальныКлассКонтроля = СтрокаНоменклатуры.СпециальныйКлассКонтроля;
			ЗаписьРегистраСпецКлассаКонтроля.Комментарий = "Установлено документом ""Расчет параметров управления запасами""";
			ЗаписьРегистраСпецКлассаКонтроля.Автор = Автор;
			
			//Бондаренко 20151231 ++
 			ЗаписьРегистраСпецКлассаКонтроля.ДатаОкончания = СтрокаНоменклатуры.ДатаОкончания;
			//Бондаренко 20151231 --

 			ЗаписьРегистраСпецКлассаКонтроля.Записать();
		КонецЕсли;
	КонецЦикла;
	
	ЗаписьРегистраСезонныеФакторы = Движения.СезонныйФактор;
	Для Каждого СтрокаСезонногоФактора Из СезонныеФакторы Цикл
		СтрокаРегистраСезонныеФакторы = ЗаписьРегистраСезонныеФакторы.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРегистраСезонныеФакторы, СтрокаСезонногоФактора);
		СтрокаРегистраСезонныеФакторы.Регистратор = Ссылка;
		СтрокаРегистраСезонныеФакторы.Период = ДатаРасчета;
		СтрокаРегистраСезонныеФакторы.Подразделение = ПодразделениеКомпанииДляРасчета;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ЗапросЗаписейПоДокументу = Новый ЗАпрос();
	ЗапросЗаписейПоДокументу.Текст = "ВЫБРАТЬ
	                                 |	MAD_НазначениеСпециальныхКлассовКонтроля.Период,
	                                 |	MAD_НазначениеСпециальныхКлассовКонтроля.ПодразделениеКомпании,
	                                 |	MAD_НазначениеСпециальныхКлассовКонтроля.Показатель,
	                                 |	MAD_НазначениеСпециальныхКлассовКонтроля.СпециальныКлассКонтроля
	                                 |ИЗ
	                                 |	РегистрСведений.MAD_НазначениеСпециальныхКлассовКонтроля КАК MAD_НазначениеСпециальныхКлассовКонтроля
	                                 |ГДЕ
	                                 |	MAD_НазначениеСпециальныхКлассовКонтроля.ДокументУстановкиКлассаКонтроля = &ДокументУстановкиКлассаКонтроля";
	ЗапросЗаписейПоДокументу.УстановитьПараметр("ДокументУстановкиКлассаКонтроля", Ссылка);
	РезультатЗапросаЗаписейПоДокументу = ЗапросЗаписейПоДокументу.Выполнить().Выбрать();
	Пока РезультатЗапросаЗаписейПоДокументу.Следующий() Цикл
		МенеджерЗаписиСпециальногоКлассаКонтроля = РегистрыСведений.MAD_НазначениеСпециальныхКлассовКонтроля.СоздатьМенеджерЗаписи();
		МенеджерЗаписиСпециальногоКлассаКонтроля.Период = РезультатЗапросаЗаписейПоДокументу.Период; 
		МенеджерЗаписиСпециальногоКлассаКонтроля.ПодразделениеКомпании = РезультатЗапросаЗаписейПоДокументу.ПодразделениеКомпании;
		МенеджерЗаписиСпециальногоКлассаКонтроля.Показатель = РезультатЗапросаЗаписейПоДокументу.Показатель;
		МенеджерЗаписиСпециальногоКлассаКонтроля.СпециальныКлассКонтроля = РезультатЗапросаЗаписейПоДокументу.СпециальныКлассКонтроля;
		МенеджерЗаписиСпециальногоКлассаКонтроля.Прочитать();
		
		Если МенеджерЗаписиСпециальногоКлассаКонтроля.Выбран() Тогда
			МенеджерЗаписиСпециальногоКлассаКонтроля.Удалить();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

//Бондаренко 20151230 ++
Функция ПолучитьДанныеВременнойТаблицы(Запрос, ИмяТаблицы) Экспорт
     ДанныеТаблицы = Новый Запрос;
	 Если Запрос.МенеджерВременныхТаблиц<> Неопределено Тогда
	 	ДанныеТаблицы.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
 	 КонецЕсли; 
     ДанныеТаблицы.Текст =
     "Выбрать *
     |    Из "+ИмяТаблицы+"
     |";
     Возврат ДанныеТаблицы.Выполнить().Выгрузить();
КонецФункции
//Бондаренко 20151230 -- 
 
 //Бондаренко++ 20211021 
Процедура СМГ_УдалитьДублиСтрок() Экспорт
	
	ТЗ = ПараметрыРасчета.Выгрузить();
	ТЗ.Колонки.Добавить("Кол");
	Для каждого Стр Из ТЗ Цикл
	    Стр.Кол = 1;
	КонецЦикла;
	
	ТЗ.Свернуть("Номенклатура","Кол");
	СЗ = Новый СписокЗначений;
	
	Для каждого Стр Из ТЗ Цикл
		Если Стр.Кол < 2 Тогда
			Продолжить;	
		КонецЕсли;
		СЗ.Добавить(Стр.Номенклатура);
	КонецЦикла;
	
	Отбор = Новый Структура(); 
	
	Для каждого ЭлСписка Из СЗ Цикл
		
		Отбор.Очистить();
		Отбор.Вставить("Номенклатура", ЭлСписка.Значение);
		
		Строки = ПараметрыРасчета.НайтиСтроки(Отбор);
 		Если Строки.Количество() > 1 Тогда
			Для каждого НайденнаяСтрока Из Строки Цикл
				ПараметрыРасчета.Удалить(НайденнаяСтрока);
			КонецЦикла;
		КонецЕсли;
		
		Строки = УстановкаСпециальныхКлассовКонтроляНаПозицию.НайтиСтроки(Отбор);
		Если Строки.Количество() > 1 Тогда
			Для каждого НайденнаяСтрока Из Строки Цикл
				УстановкаСпециальныхКлассовКонтроляНаПозицию.Удалить(НайденнаяСтрока);
			КонецЦикла;
		КонецЕсли;
		
		Строки = СезонныеФакторы.НайтиСтроки(Отбор);
		Если Строки.Количество() > 1 Тогда
			Для каждого НайденнаяСтрока Из Строки Цикл
				СезонныеФакторы.Удалить(НайденнаяСтрока);
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры  //УдалитьДублиСтрок()
//Бондаренко++ 20211021 
 


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права                 = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли

	