Перем глОбщиеЗначения Экспорт;

// Процедура - обработчик события "ПриЗаписи".
//
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если Не Отказ Тогда
				
		глЗначениеПеременнойУстановить("УчетнаяПолитикаПоУправленческомуУчету", Renault_Advanced_ОбщегоНазначения.СоздатьКЭШУчетнойПолитики(""), Истина);
		
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()


// Процедура установки значения экспортных переменных модуля приложения
//
// Параметры
//  Имя - строка, содержит имя переменной целиком
// 	Значение - значение переменной
//
Процедура глЗначениеПеременнойУстановить(Имя, Значение, ОбновлятьВоВсехКэшах = Ложь) Экспорт
	
	Renault_Advanced_ОбщегоНазначения.УстановитьЗначениеПеременной(Имя, глОбщиеЗначения, Значение, ОбновлятьВоВсехКэшах);
	
КонецПроцедуры
