// Модуль документа ВозвратПоставщику

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА
Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем ИмяРеквизитаКода Экспорт;     // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/артикула в ТЧ
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// получает цену на товар из документа поставки
//
// Параметры:
//  ДокПоставки                - Характеристика.ТипыПартий,
//  Номенклатура               - СправочникСсылка.Номенклатура,
//  СтавкаНДС                  - СправочникСсылка.СтавкиНДС,
//  ХарактеристикаНоменклатуры - СправочникСсылка.ХарактеристикиНоменклатуры,
//
// Возвращаемое значение:
//  Цена - число.
//
Функция ПолучитьЦенуИзДокументаПоставки(ДокПоставки,ГТД,Номенклатура,ХарактеристикаНоменклатуры=Неопределено)
	// проверки
	СтруктураЦены=Новый Структура("СуммаВсего,Количество",0,0);
	Если обЗначениеНеЗаполнено(ДокПоставки) Тогда Возврат СтруктураЦены; КонецЕсли;
	Если обЗначениеНеЗаполнено(Номенклатура) Тогда Возврат СтруктураЦены; КонецЕсли;
	// получаем цены
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	СУММА(ДокТовары.СуммаВсего) КАК СуммаВсего,
	|	СУММА(ДокТовары.Количество*ДокТовары.Коэффициент) КАК Количество
	|ИЗ
	|	Документ."+ДокПоставки.Метаданные().Имя+".Товары КАК ДокТовары
	|ГДЕ
	|	ДокТовары.Ссылка=&Ссылка И
	|	ДокТовары.Номенклатура=&Номенклатура
	|"+?(обЗначениеНеЗаполнено(ХарактеристикаНоменклатуры),""," И ХарактеристикаНоменклатуры=&ХарактеристикаНоменклатуры")+"
	|"+?(обЗначениеНеЗаполнено(ГТД),""," И ГТД=&ГТД")+"
	|");
	Запрос.УстановитьПараметр("Ссылка",ДокПоставки);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("ГТД",ГТД);
	РезультатЦена=Запрос.Выполнить().Выбрать();
	Если РезультатЦена.Следующий() Тогда
		СтруктураЦены.СуммаВсего=обПересчет(РезультатЦена.СуммаВсего,ДокПоставки.ВалютаДокумента,ДокПоставки.КурсДокумента,ВалютаДокумента,КурсДокумента);
		СтруктураЦены.Количество=РезультатЦена.Количество;
	КонецЕсли; 
	Возврат СтруктураЦены;
КонецФункции // ПолучитьЦенуИзДокументаПоставки()

// Возвращает ставку НДС партии
//
// Параметры:
//  ТекСтрока               - Строка табличной части Товары
//
// Возвращаемое значение:
//  Возвращает ставку НДС по регистру накопления "ПартииТоваровКомпании"
//
Функция ПолучитьСтавкуНДСПартии(ТекСтрока)

	Запрос  = Новый Запрос;
	Запрос.Текст  =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПартииТоваровКомпании.Количество,
	|	ПартииТоваровКомпании.Сумма,
	|	ПартииТоваровКомпании.СтавкаНДС
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
	|ГДЕ
	|	ПартииТоваровКомпании.Регистратор = &Регистратор
	|	И ПартииТоваровКомпании.Номенклатура = &Номенклатура
	|	И ПартииТоваровКомпании.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	|	И ПартииТоваровКомпании.СкладКомпании = &СкладКомпании
	|	И ПартииТоваровКомпании.Партия = &Партия
	|";
	
	Запрос.УстановитьПараметр("Регистратор",ТекСтрока.Партия);
	Запрос.УстановитьПараметр("Номенклатура",ТекСтрока.Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",ТекСтрока.ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("СкладКомпании",СкладКомпании);
	Запрос.УстановитьПараметр("Партия",ТекСтрока.Партия);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
	    Возврат Выборка.СтавкаНДС;
	Иначе	
	    Возврат ТекСтрока.СтавкаНДС;
	КонецЕсли; 
	
КонецФункции // ПолучитьСтавкуНДСПартии()

// Возвращает количество партии
//
// Параметры:
//  Номенклатура               - СправочникСсылка.Номенклатура,
//  ХарактеристикаНоменклатуры - СправочникСсылка.ХарактеристикиНоменклатуры,
//  Партия                     - Характеристика.ТипыПартий.
//
// Возвращаемое значение:
//  Возвращает остатки по регистру накопления "ПартииТоваровКомпании"
//
Функция ПолучитьКоличествоПартии(Номенклатура,ХарактеристикаНоменклатуры,Партия,ГТД)
	СтруктураОтбора=Новый Структура("СкладКомпании,Номенклатура,ХарактеристикаНоменклатуры",СкладКомпании,Номенклатура,ХарактеристикаНоменклатуры);
	Если НЕ обЗначениеНеЗаполнено(Партия) Тогда
		СтруктураОтбора.Вставить("Партия",Партия);
	КонецЕсли;
	Если НЕ обЗначениеНеЗаполнено(ГТД) Тогда
		СтруктураОтбора.Вставить("ГТД",ГТД);
	КонецЕсли;
	Если обЗначениеНеЗаполнено(ГТД) Тогда
		Остатки=РегистрыНакопления.ПартииТоваровКомпании.Остатки(?(Ссылка.Пустая(),Дата,Новый Граница(МоментВремени(),ВидГраницы.Исключая)),СтруктураОтбора,,"Количество");
	Иначе
		Остатки=РегистрыНакопления.ГТДПартийТоваровКомпании.Остатки(?(Ссылка.Пустая(),Дата,Новый Граница(МоментВремени(),ВидГраницы.Исключая)),СтруктураОтбора,,"Количество");
	КонецЕсли;
	Остатки.Свернуть("","Количество");
	Если Остатки.Количество()=0 Тогда
		Возврат 0;
	Иначе
		Возврат Остатки[0].Количество;
	КонецЕсли; 
КонецФункции // ПолучитьКоличествоПартии()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает соответствие в котором перечислены виды номенклатуры, которые нельзя вводить
// в таблицу товаров. Если таких нет, то возвращает неопределено
//
// Возвращаемое значение:
//  Результат - соответствие.
//
Функция ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры() Экспорт
	Результат=Новый Соответствие();
	Результат.Вставить(Перечисления.ВидыНоменклатуры.Услуга,0);
	Возврат Результат;
КонецФункции // ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры()

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	// Обязательные поля таблицы товаров
	ОбязательныеТовары=Новый Структура();
	ОбязательныеТовары.Вставить("Номенклатура",3);
	ОбязательныеТовары.Вставить("Количество",1);
	ОбязательныеТовары.Вставить("ЕдиницаИзмерения",3);
	ОбязательныеТовары.Вставить("Коэффициент",1);
	ОбязательныеТовары.Вставить("ХарактеристикаНоменклатуры",2);
	ОбязательныеТовары.Вставить("Партия",?(обПраво("РежимСписанияПриВозвратеПоставщику",Права,,ЭтотОбъект)=Перечисления.РежимыСписанияПриВозврате.ТолькоПоУказаннойПартии,3,2));
	ОбязательныеТовары.Вставить("ГТД",2);

	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	ОбязательныеРеквизиты.Вставить("Автор",1);
	ОбязательныеРеквизиты.Вставить("ВалютаДокумента",1);
	ОбязательныеРеквизиты.Вставить("КурсДокумента",1);	
	ОбязательныеРеквизиты.Вставить("СкладКомпании",1);
	ОбязательныеРеквизиты.Вставить("Контрагент",1);
	ОбязательныеРеквизиты.Вставить("ХозОперация",1);
	ОбязательныеРеквизиты.Вставить("ДоговорВзаиморасчетов",1);
	ОбязательныеРеквизиты.Вставить("Товары",ОбязательныеТовары);
	
	Возврат ОбязательныеРеквизиты;
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Проверяет корректность заполнения объекта.
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры:
//  Ошибки       - строка, в случае некорректного заполнения содержит описанием возникших ошибок, 
//  ДопРеквизиты - структура, на вход может быть передана структура с дополнительными реквизитами для проверки,
//  Заполнение   - булево, флаг проверки, 
//  Уникальность - булево, флаг проверки.
//
// Возвращаемое значение:
//  Булево - Возвращает Истина если все заполнено корректно и Ложь иначе.
// 
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	// Здесь могут быть определены дополнительные к стандартным обязательным реквизитам условия проверки
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	
	Если Не обЗначениеНеЗаполнено(ДокументОснование) Тогда
		Если ДокументОснование.Контрагент<>Контрагент Тогда
			Результат=Ложь;
			дкДобавитьОшибку(Ошибки,"Контрагент документа основания отличается от контрагента текущего документа ");
		КонецЕсли;
		
		Если ДокументОснование.ДоговорВзаиморасчетов<>ДоговорВзаиморасчетов Тогда
			Результат=Ложь;
			дкДобавитьОшибку(Ошибки,"Договор взаиморасчетов документа основания отличается от договора взаиморасчетов текущего документа ");
		КонецЕсли;
	КонецЕсли; 	
	
	// Проведем проверку соответствия организации документа организациям некоторых реквизитов документа.
	// Такую проверку необходимо осуществлять, если баланс в системе ведется по организации,
	// или если установлен способ контроля корректности
	// договора и склада документа. Причем, если способ контроля выбран "Контроль по организации и подразделению", то
	// дополнительно осуществляется проверка соответствия подразделений.
	Если Результат Тогда
		СпособКонтроляКорректности = обПраво("КонтрольКорректностиДоговораИСкладаДокумента", Права,,ЭтотОбъект);	
		КонтрольОтсутствует        = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольОтсутствует);
		БалансВедетсяПоОрганизации = (Константы.СпособВеденияБаланса.Получить()=Перечисления.СпособВеденияБаланса.ПоОрганизации);
		
		Если БалансВедетсяПоОрганизации Или Не КонтрольОтсутствует Тогда
			КонтрольПоПодразделению = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольПоОрганизацииИПодразделению);
			
			КонтролируемыеРеквизиты = Новый Структура();
			
			КонтролируемыеРеквизитыШапки = Новый Структура();
			КонтролируемыеРеквизитыШапки.Вставить("СкладКомпании",         КонтрольПоПодразделению);
			КонтролируемыеРеквизитыШапки.Вставить("ДоговорВзаиморасчетов", КонтрольПоПодразделению);
			КонтролируемыеРеквизиты.Вставить("КонтролируемыеРеквизитыШапки",КонтролируемыеРеквизитыШапки);   		
			
			Результат = дкПроверитьКорректностьПоОрганизации(ЭтотОбъект,КонтролируемыеРеквизиты,Ошибки) и Результат;
		КонецЕсли;  		
	КонецЕсли;  	
	
	Возврат Результат;
	
КонецФункции // ПроверитьКорректность()

// Функция проверяет, допустимо ли изменение объекта
//
// Параметры:
//  БлокироватьРеквизиты - структура, структура блокируемых на изменение реквизитов.
//
// Возвращаемое значение:
// Булево - Возвращает Истина, если изменения возможны, ложь иначе
//          Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
//
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции // ДоступностьИзменения()

// Возвращает список возможных хозяйственных операций документа
// Возвращаемое значение: 
//  СписокЗначений. 
//  Строка списка: Значение - имя предопределенного элемента; 
//				   Представление - красивое его представление
// 				   "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("ВозвратТоваровПоставщику","Возврат товаров поставщику",Истина);
	СписокХозОпераций.Добавить("ВозвратТоваровПоставщикуКомиссия","Возврат товаров поставщику (комиссия)");
	Возврат СписокХозОпераций;
КонецФункции // ПолучитьСписокХозОпераций()

// возвращает выборку по шапке
//
// Параметры:
//  ДокументСсылка - Ссылка на документ для которого получаем шапку.
//
// Возвращаемое значение:
//  Выборка - выборка по шапке
//
Функция ПолучитьШапкуДокумента(ДокументСсылка)
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата,
	|	Док.ВалютаДокумента КАК ВалютаДокумента,
	|	Док.КурсДокумента КАК КурсДокумента,
	|	Док.ТипЦен КАК ТипЦен,
	|	Док.ХозОперация КАК ХозОперация,
	|	Док.КурсВалютыУпр КАК КурсВалютыУпр,
	|	Док.КурсВалютыВзаиморасчетов КАК КурсВалютыВзаиморасчетов,
	|	Док.МоментВремени КАК МоментВремени,
	|	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	Док.Проект КАК Проект,
	/////////// ПРИВАТ ////////////
	|	Док.СкладКомпании КАК СкладКомпании,
	|	Док.Контрагент КАК Контрагент,
	|	Док.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	Док.ДокументОснование КАК ДокументОснование,
	|	ЕСТЬNULL(ДокТовары.СуммаВсего,0) КАК СуммаВсего
	|
	|ИЗ
	|	Документ."+Метаданные().Имя+" КАК Док
	|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ СУММА(СуммаВсего) КАК СуммаВсего ИЗ Документ."+Метаданные().Имя+".Товары ГДЕ Ссылка=&Ссылка) КАК ДокТовары
	|	ПО Истина
	|
	|ГДЕ
	|	Док.Ссылка=&Ссылка
	|");
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	Выборка=Запрос.Выполнить().Выбрать(); Выборка.Следующий();
	
	Возврат Выборка;
КонецФункции // ПолучитьШапкуДокумента()

// формирует движения документа по партионным регистрам
//
// Параметры:
//  Режим           - режим проведения (оперативный/неоперативный)
//  ДокументСсылка  - ссылка на документ который надо допровести по партиям
//
// Возвращаемое значение:
//  Возвращает Истина - все ОК, ложь - чего-то не так
//
Функция ПровестиПоПартиям(Режим,ДокументСсылка) Экспорт
	Отказ=Ложь;
	
	// Получим способ ведения баланса.
	БалансВедетсяПоПодразделениям = (Константы.СпособВеденияБаланса.Получить() = Перечисления.СпособВеденияБаланса.ПоПодразделению);
	
	// Определим необходимость корректирующих проводок для поддержания баланса по подразделениям.
	ПодразделениеСклад                 = обПолучитьБалансовоеПодразделение(СкладКомпании.Подразделение);
	ПодразделениеДоговорВзаиморасчетов = обПолучитьБалансовоеПодразделение(ДоговорВзаиморасчетов.Подразделение);
	БалансовыеПодразделенияНеРавны     = (ПодразделениеДоговорВзаиморасчетов<>ПодразделениеСклад);

	// получим шапку документа
	ШапкаДокумента=ПолучитьШапкуДокумента(ДокументСсылка);
	
	// проверим, если подразделение проводиться по партиям "отложенно", то дальше не идем
	НаборЗаписейДопроведениеПоПартиям=Движения.ДопроведениеПоПартиям;
	НаборЗаписейДопроведениеПоПартиям.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейДопроведениеПоПартиям.ШапкаДокумента=ШапкаДокумента;
	Отказ=НЕ НаборЗаписейДопроведениеПоПартиям.Зафиксировать() ИЛИ Отказ;
	Если НаборЗаписейДопроведениеПоПартиям.НеПроводитьПартии Тогда
		// Доходы и расходы на себестоимость не оприходованных партий
		Если ШапкаДокумента.ХозОперация<>Справочники.ХозОперации.ВозвратТоваровПоставщикуКомиссия Тогда
			НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
			НаборЗаписейДоходыИРасходы.ДокументОбъект         = ЭтотОбъект;
			НаборЗаписейДоходыИРасходы.Подразделение          = ШапкаДокумента.ДоговорВзаиморасчетов.Подразделение;
			НаборЗаписейДоходыИРасходы.ВУпрВалюте             = Ложь;
			НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СебестоимостьНеоприходованныхПартий;
			НаборЗаписейДоходыИРасходы.Доход                  = ШапкаДокумента.СуммаВсего;
			НаборЗаписейДоходыИРасходы.ШапкаДокумента         = ШапкаДокумента;
			Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
		КонецЕсли;
		
		Возврат НЕ Отказ;
	КонецЕсли;
	
	НаборЗаписейПартии=Движения.ПартииТоваровКомпании;
	НаборЗаписейПартии.ДокументОбъект            = ЭтотОбъект;
	НаборЗаписейПартии.СкладКомпании             = ШапкаДокумента.СкладКомпании;
	НаборЗаписейПартии.РезультатЗапросаПоТоварам = Неопределено;
	НаборЗаписейПартии.ИмяРеквизитаДокумент      = "Партия";
	НаборЗаписейПартии.Сторно                    = Истина;
	НаборЗаписейПартии.ШапкаДокумента            = ШапкаДокумента;
	НаборЗаписейПартии.СтатусПартии              = ?(ШапкаДокумента.ХозОперация=Справочники.ХозОперации.ВозвратТоваровПоставщикуКомиссия,Перечисления.СтатусыПартий.ТоварПринятыйКомиссия,Перечисления.СтатусыПартий.ТоварКупленный);
	Отказ=НЕ НаборЗаписейПартии.Приход() ИЛИ Отказ;
	
	// Движения по Доходам и Расходам
	Если ШапкаДокумента.ХозОперация<>Справочники.ХозОперации.ВозвратТоваровПоставщикуКомиссия Тогда
		// определим суммы для товаров и услуг в документе
		СуммаУслуг=0;
		СуммаТоваров=0;
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	СУММА(ВЫБОР КОГДА ДокументТовары.Номенклатура.ВидНоменклатуры =  &Услуга ТОГДА ДокументТовары.СуммаВсего ИНАЧЕ 0 КОНЕЦ) КАК СуммаУслуг,
		|	СУММА(ВЫБОР КОГДА ДокументТовары.Номенклатура.ВидНоменклатуры <> &Услуга ТОГДА ДокументТовары.СуммаВсего ИНАЧЕ 0 КОНЕЦ) КАК СуммаТоваров
		|ИЗ
		|	Документ.ВозвратПоставщику.Товары КАК ДокументТовары
		|ГДЕ
		|	ДокументТовары.Ссылка = &ДокументСсылка
		|
		|");
		Запрос.УстановитьПараметр("ДокументСсылка",ШапкаДокумента.Ссылка);
		Запрос.УстановитьПараметр("Услуга",Перечисления.ВидыНоменклатуры.Услуга);
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СуммаУслуг	 = Выборка.СуммаУслуг;
			СуммаТоваров = Выборка.СуммаТоваров;
		КонецЕсли;
		
		ВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
		Если обЗначениеНеЗаполнено(ШапкаДокумента.КурсВалютыУпр) Тогда
			СтруктураКурса = обКурсДляВалюты(ВалютаУпр,Дата);
			КурсУпр 	   = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
		Иначе
			КурсУпр        = ШапкаДокумента.КурсВалютыУпр;
		КонецЕсли;	
		
		СуммаУслуг   = обПересчет(СуммаУслуг,  ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,КурсУпр);
		СуммаТоваров = обПересчет(СуммаТоваров,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,КурсУпр);
		ДоходТовары	 = -НаборЗаписейПартии.Итог("СуммаУпр");
		
		Если (НЕ БалансВедетсяПоПодразделениям или  Не БалансовыеПодразделенияНеРавны) и обМОД(СуммаТоваров-ДоходТовары)>=0.01 Тогда	
			// запишем суммы в регистр
			НаборЗаписейДиР 						= Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект 			= ЭтотОбъект;
			НаборЗаписейДиР.СтатьяДоходовИРасходов	= Справочники.СтатьиДоходовИРасходов.ОтклонениеСтоимостиВозврата;
			Если БалансВедетсяПоПодразделениям Тогда
				НаборЗаписейДиР.Подразделение = ШапкаДокумента.СкладКомпании.Подразделение;
			КонецЕсли;
			НаборЗаписейДиР.ВУпрВалюте				= Истина;
			НаборЗаписейДиР.Доход					= СуммаТоваров-ДоходТовары;
			НаборЗаписейДиР.ШапкаДокумента			= ШапкаДокумента;
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		КонецЕсли;
		
		// если возвращали услуги
		Если СуммаУслуг<>0 Тогда
			НаборЗаписейДиР.ДокументОбъект 			= ЭтотОбъект;
			НаборЗаписейДиР.СтатьяДоходовИРасходов	= Справочники.СтатьиДоходовИРасходов.ВозвратУслугПоставщика;
			Если БалансВедетсяПоПодразделениям Тогда
				НаборЗаписейДиР.Подразделение = ШапкаДокумента.ДоговорВзаиморасчетов.Подразделение;
			КонецЕсли;
			НаборЗаписейДиР.ВУпрВалюте				= Истина;
			НаборЗаписейДиР.Доход					= СуммаУслуг;
			НаборЗаписейДиР.ШапкаДокумента			= ШапкаДокумента;
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		КонецЕсли;
		
		Если БалансВедетсяПоПодразделениям и БалансовыеПодразделенияНеРавны Тогда	
			// запишем суммы в регистр
			НаборЗаписейДиР 						= Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект 			= ЭтотОбъект;
			НаборЗаписейДиР.СтатьяДоходовИРасходов	= Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
			НаборЗаписейДиР.Подразделение			= ШапкаДокумента.ДоговорВзаиморасчетов.Подразделение;
			НаборЗаписейДиР.ВУпрВалюте				= Истина;
			НаборЗаписейДиР.Расход					= СуммаУслуг;
			НаборЗаписейДиР.ШапкаДокумента			= ШапкаДокумента;
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		КонецЕсли;

	КонецЕсли;
	
	// двигаем границу последовательности партий
	Если Режим<>РежимПроведенияДокумента.Оперативный ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.СкладКомпанииБыл) Тогда
		// если идет допроведение, то надо получить те значения которые были раньше
		Если Ссылка<>ДокументСсылка Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ СкладКомпании ИЗ РегистрНакопления.ПартииТоваровКомпании ГДЕ Регистратор=&Ссылка");
			Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
			Результат = Запрос.Выполнить(); СкладКомпанииБыл=Неопределено;
			Если НЕ Результат.Пустой() Тогда
				СкладКомпанииБыл = Результат.Выгрузить().ВыгрузитьКолонку("СкладКомпании");
			КонецЕсли;
			ДополнительныеСвойства.Вставить("СкладКомпанииБыл",СкладКомпанииБыл);
			ДополнительныеСвойства.МоментВремениБыл = ДокументСсылка.МоментВремени();
		КонецЕсли;
		
		НаборЗаписейГраницыПартий = РегистрыСведений.ГраницыПартий.СоздатьНаборЗаписей();
		Если Режим<>РежимПроведенияДокумента.Оперативный Тогда
			НаборЗаписейГраницыПартий.СкладКомпании		= ШапкаДокумента.СкладКомпании;
			НаборЗаписейГраницыПартий.МоментВремени		= ШапкаДокумента.Дата;
			НаборЗаписейГраницыПартий.СкладКомпанииБыл	= ДополнительныеСвойства.СкладКомпанииБыл;
			НаборЗаписейГраницыПартий.МоментВремениБыл	= ДополнительныеСвойства.МоментВремениБыл;
		Иначе
			НаборЗаписейГраницыПартий.СкладКомпании		= ДополнительныеСвойства.СкладКомпанииБыл;
			НаборЗаписейГраницыПартий.МоментВремени		= ДополнительныеСвойства.МоментВремениБыл;
			НаборЗаписейГраницыПартий.СкладКомпанииБыл	= Неопределено;
			НаборЗаписейГраницыПартий.МоментВремениБыл	= Неопределено;
		КонецЕсли;
		НаборЗаписейГраницыПартий.ДокументСсылка	= ШапкаДокумента.Ссылка;
		НаборЗаписейГраницыПартий.ИзменитьГраницу();
	КонецЕсли;
	
	Возврат НЕ Отказ;
КонецФункции // ПровестиПоПартиям()

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка – Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	– Форма	 – Ссылка на форму документа. Если значение неопределено,
//                         производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	// ОБРАБОТКА РЕКВИЗИТОВ ДОКУМЕНТА
	Если Имя="Контрагент" Тогда
		Если ХозОперация = Справочники.ХозОперации.ВозвратТоваровПоставщикуКомиссия Тогда
			//Параметры для подстановки или создания договора контрагента
			Если ДопПараметры=Неопределено Тогда ДопПараметры=Новый Структура; КонецЕсли; 
			ДопПараметры.Вставить("ВидДоговора",Перечисления.ВидыДоговоров.СКомитентом);
			ДопПараметры.Вставить("ТипЦенПокупки",ТипЦен);
			ДопПараметры.Вставить("ТипЦенПродажи",Справочники.ТипыЦен.ПустаяСсылка());
		КонецЕсли; 
		
		Рез = дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
				
		Возврат Рез;
	ИначеЕсли Имя="СкладКомпании" Тогда
		дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Если НЕ Товары.Количество() = 0 Тогда
			Для Каждого стрТовары Из Товары Цикл
				ОбработкаРеквизита("Товары.Ячейка",стрТовары,ЭтаФорма);
			КонецЦикла;
		КонецЕсли;
		Возврат ОбработкаРеквизита("ПроверкаСкладаКомпании",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="ПроверкаСкладаКомпании" Тогда
		Возврат Истина;
		
	ИначеЕсли Имя="Товары.Номенклатура" Тогда
		Если ЗначениеЗаполнено(Контрагент) Тогда
			Если ДопПараметры=Неопределено Тогда ДопПараметры=Новый Структура; КонецЕсли;
			ДопПараметры.Вставить("Контрагент",Контрагент);
        КонецЕсли;
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Если НЕ обДопустимаяСтрока(ТекСтрока) Тогда Возврат Рез; КонецЕсли; //Это если это был набор и мы удалили эту строку
		Количество=ПолучитьКоличествоПартии(ТекСтрока.Номенклатура,ТекСтрока.ХарактеристикаНоменклатуры,ТекСтрока.Партия,ТекСтрока.ГТД);
		ТекСтрока.Количество=Количество/?(ТекСтрока.Коэффициент=0,1,ТекСтрока.Коэффициент);
		Рез=ОбработкаРеквизита("Товары.Количество",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
		СтруктураЦены=ПолучитьЦенуИзДокументаПоставки(ТекСтрока.Партия,ТекСтрока.ГТД,ТекСтрока.Номенклатура,ТекСтрока.ХарактеристикаНоменклатуры);
		Если СтруктураЦены.СуммаВсего>0 И СтруктураЦены.Количество Тогда
			ТекСтрока.СуммаВсего=СтруктураЦены.СуммаВсего*ТекСтрока.Количество/СтруктураЦены.Количество;
			Рез=ОбработкаРеквизита("Товары.СуммаВсего",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
		КонецЕсли;
		// ставку НДС 
		Возврат Рез;
		
	ИначеЕсли Имя="Товары.Количество" Тогда
		Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
				
	ИначеЕсли Имя="Товары.ХарактеристикаНоменклатуры" Тогда
		Рез = дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Количество=ПолучитьКоличествоПартии(ТекСтрока.Номенклатура,ТекСтрока.ХарактеристикаНоменклатуры,ТекСтрока.Партия,ТекСтрока.ГТД);
		ТекСтрока.Количество=Количество/?(ТекСтрока.Коэффициент=0,1,ТекСтрока.Коэффициент);
		Рез=ОбработкаРеквизита("Товары.Количество",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
		СтруктураЦены=ПолучитьЦенуИзДокументаПоставки(ТекСтрока.Партия,ТекСтрока.ГТД,ТекСтрока.Номенклатура,ТекСтрока.ХарактеристикаНоменклатуры);
		Если СтруктураЦены.СуммаВсего>0 И СтруктураЦены.Количество Тогда
			ТекСтрока.СуммаВсего=СтруктураЦены.СуммаВсего*ТекСтрока.Количество/СтруктураЦены.Количество;
			Рез=ОбработкаРеквизита("Товары.СуммаВсего",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
		КонецЕсли;
		Возврат Рез;
		
	ИначеЕсли Имя="Товары.Партия" ИЛИ Имя="Товары.ГТД" Тогда
		Количество=ПолучитьКоличествоПартии(ТекСтрока.Номенклатура,ТекСтрока.ХарактеристикаНоменклатуры,ТекСтрока.Партия,ТекСтрока.ГТД);
		ТекСтрока.Количество =  Мин(ТекСтрока.Количество,Количество/?(ТекСтрока.Коэффициент=0,1,ТекСтрока.Коэффициент));
		Рез=ОбработкаРеквизита("Товары.Количество",ТекСтрока,ЭтаФорма,ДопПараметры);
		СтруктураЦены=ПолучитьЦенуИзДокументаПоставки(ТекСтрока.Партия,ТекСтрока.ГТД,ТекСтрока.Номенклатура,ТекСтрока.ХарактеристикаНоменклатуры);
		Если СтруктураЦены.СуммаВсего>0 И СтруктураЦены.Количество Тогда
			ТекСтрока.СуммаВсего=СтруктураЦены.СуммаВсего*ТекСтрока.Количество/СтруктураЦены.Количество;
			Рез=ОбработкаРеквизита("Товары.СуммаВсего",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
		КонецЕсли;
		ТекСтрока.СтавкаНДС = ПолучитьСтавкуНДСПартии(ТекСтрока);
		Возврат Рез;
		
	ИначеЕсли Имя="Товары.Ячейка" Тогда
		Если обЗначениеНеЗаполнено(ТекСтрока.Номенклатура) ИЛИ обЗначениеНеЗаполнено(СкладКомпании) Тогда
			ТекСтрока.Ячейка=Справочники.ЯчейкиХранения.ПустаяСсылка();
			Возврат Истина;
		КонецЕсли;
		ЯчейкаСсылка=ТекСтрока.Номенклатура.ПолучитьОбъект().ПолучитьЯчейкуХранения(СкладКомпании);
		ТекСтрока.Ячейка=ЯчейкаСсылка;
		Возврат Истина
		
	Иначе Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()

// заполнение свойств из документа основания
Процедура ЗаполнитьСвойстваНаОсновании(Основание) Экспорт
 //зарезервировано для описания заполнения свойств из свойств основания
КонецПроцедуры

#Если Клиент Тогда
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

//Функция печати этикеток и ценников
// 
// Параметры:
//  ТабДокумент - табличный документ.
//
Функция ПечатьЭтикетокИЦенников(ТабДокумент) Экспорт
	дкПечатьЭтикетокИЦенников(ЭтотОбъект);
КонецФункции // ПечатьЭтикетокИЦенников()

// Формирует печатную форму "Накладная"
// 
// Параметры:
//  ТабДокумент - табличный документ.
//
// Возвращаемое значение:
//  ТабДокумент - возвращает сформированный табличный документ.
//
Функция ПечатьВозвратПоставщику(ТабДокумент) Экспорт
	Макет = ПолучитьМакет("ВозвратПоставщику");
	
	ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
	
	//для начала настроим макет
	
	ОбластьШапкаТаблицы = дкПривестиМакетПечатнойФормы(ЭтотОбъект,Макет);
			
	//вывод заголовка документа
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
	ТекстЗаголовка = дкПолучитьПредставление(ЭтотОбъект);
	ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	Если НЕ обЗначениеНеЗаполнено(ПодразделениеКомпании) И НЕ обЗначениеНеЗаполнено(ПодразделениеКомпании.КПП) Тогда
		СтрокаПредставления = спПолучитьПредставление(Организация);
		ОбластьМакета.Параметры.ПредставлениеОтправителя = СтрЗаменить(СтрокаПредставления, Организация.КПП, ПодразделениеКомпании.КПП);
	Иначе	
	    ОбластьМакета.Параметры.ПредставлениеОтправителя = спПолучитьПредставление(Организация);
	КонецЕсли;
	ОбластьМакета.Параметры.ПредставлениеСклада			= спПолучитьНаименование(СкладКомпании);
	ОбластьМакета.Параметры.ПредставлениеПолучателя		= спПолучитьПредставление(Контрагент);
	//вывод свойств
	СтрокаСвойств = дкПолучитьСтрокуСвойствДокумента(ЭтотОбъект);
	ОбластьМакета.Параметры.СтрокаСвойств = СтрокаСвойств;
	ТабДокумент.Вывести(ОбластьМакета);
	//сразу два, т.к. выводим на второй странице только
	НомерСтраницы = 2;
	НомерСтраницыПред = НомерСтраницы;
	
	//теперь выводим шапку
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	//готовим области строки
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
	СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента,СуммаНДС,СуммаВсего",ВалютаДокумента,0,0);
	//заполним параметры шапки таблицы для следующего листа
	ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");	
	
	//перебор строк
	ВыборкаТабличнойЧасти = ЭтотОбъект.Товары;
	Для каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
		//заполняем данные строки
		СтруктураСтроки = дкПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТабличнойЧасти,ЭтотОбъект);
		ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);	
				
		//доп. области
		мсвДопОбластиПодвала = Неопределено;
		Если ВыборкаТабличнойЧасти.Индекс(СтрокаТабличнойЧасти) = ВыборкаТабличнойЧасти.Количество()-1 Тогда
			мсвДопОбластиПодвала = Новый Массив;
			мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
		КонецЕсли;				
		
		//выводим строку, делая проверку попадания на лист
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице,
			НомерСтраницы, СтруктураИтоговПоСтранице, ЭтотОбъект, мсвДопОбластиПодвала);
		
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента,СуммаНДС,СуммаВсего",ВалютаДокумента,0,0);
			НомерСтраницыПред = НомерСтраницы;
			ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли;
		//добавляем итоги
		дкДобавитьИтогиПоСтранице(СтрокаТабличнойЧасти,СтруктураИтоговПоСтранице);
		
	КонецЦикла;
    	
	
	//выводим последний подвал, если страниц больше единицы
	Если НомерСтраницы > 2 Тогда
		дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьМакетаИтогоПоСтранице,СтруктураИтоговПоСтранице,ЭтотОбъект);
	КонецЕсли;
	
	ОбластьПодвал.Параметры.ВалютаДокумента = ВалютаДокумента;
	СуммаВсего = ВыборкаТабличнойЧасти.Итог("СуммаВсего");
	ОбластьПодвал.Параметры.СуммаВсего = Формат(СуммаВсего,ФорматВыводаСуммы);
	НДСВсего = ВыборкаТабличнойЧасти.Итог("СуммаНДС");
	ОбластьПодвал.Параметры.НДСВсего = Формат(НДСВсего,ФорматВыводаСуммы);
	ОбластьПодвал.Параметры.СуммаПрописью = "Всего наименований "+ВыборкаТабличнойЧасти.Количество()+" на сумму " + обЧислоПрописью(СуммаВсего,ЭтотОбъект.ВалютаДокумента);
	
	// Выводим представления и расшифровки подписей
	Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
	Отпустил.ОтпустилПредставление = ?(обЗначениеНеЗаполнено(Отпустил.Отпустил),"","/ "+ Отпустил.ОтпустилПредставление);
	ОбластьПодвал.Параметры.Заполнить(Отпустил);
	Получил  = дкОтветственноеЛицо(ЭтотОбъект,"ПолучилКонтрагент");
	Получил.ПолучилКонтрагентПредставление = ?(обЗначениеНеЗаполнено(Получил.ПолучилКонтрагент),"","/ "+ Получил.ПолучилКонтрагентПредставление);
	ОбластьПодвал.Параметры.Заполнить(Получил);
	
	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвал, , , НомерСтраницы,,ЭтотОбъект);
	
	Возврат ТабДокумент;
КонецФункции // ПечатьВозвратПоставщику()

// Формирует печатную форму "ТОРГ-12"
// 
// Параметры:
//  ТабДокумент - табличный документ.
//
// Возвращаемое значение:
//  ТабДокумент - возвращает сформированный табличный документ.
//
Функция ПечатьТОРГ12(ТабДокумент) Экспорт
	ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы", Права,,ЭтотОбъект);
	ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества", Права,,ЭтотОбъект);
	
	// Зададим параметры макета
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = ПолучитьОбщийМакет("ТОРГ12");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
	
	СтруктураПредставления1=Новый Структура(
		"Наименование,ИНН,КПП,АдресЮридический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		"","ИНН ","КПП ","","тел.: ","р/с ","в банке ","БИК ","к/с "
	);
	СтруктураПредставления2=Новый Структура(
		"Наименование,ИНН,КПП,АдресФактический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		"","ИНН ","КПП ","","тел.: ","р/с ","в банке ","БИК ","к/с "
	);
	
	// получис р/с из свойств документа
	РасчетныйСчетДокумента=обПолучитьЗначениеСвойства(ЭтотОбъект, "РасчетныйСчет", Неопределено);
	
	// Правим, что автоматом не заполнилось, или заполнилось неправильно
	ОбластьМакета.Параметры.ОрганизацияПредставление= спПолучитьПредставление(ОбластьМакета.Параметры.ПодразделениеКомпании,СтруктураПредставления2,РасчетныйСчетДокумента);
	
	ОбластьМакета.Параметры.Поставщик				= обПолучитьЗначениеСвойства(ЭтотОбъект,"ПоставщикОрганизация",ЭтотОбъект.Организация);
	ОбластьМакета.Параметры.ПоставщикПредставление	= спПолучитьПредставление(ОбластьМакета.Параметры.Поставщик,СтруктураПредставления2);
	
	ОбластьМакета.Параметры.Грузополучатель				= обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузополучатель",ЭтотОбъект.Контрагент);
	ОбластьМакета.Параметры.ГрузополучательПредставление= спПолучитьПредставление(ОбластьМакета.Параметры.Грузополучатель,СтруктураПредставления2);
	ОбластьМакета.Параметры.Плательщик					= обПолучитьЗначениеСвойства(ЭтотОбъект,"Плательщик",ЭтотОбъект.Контрагент);
	ОбластьМакета.Параметры.ПлательщикПредставление		= спПолучитьПредставление(ОбластьМакета.Параметры.Плательщик,СтруктураПредставления1);
	
	//дальше заполнить Шапку
	ОбластьМакета.Параметры.КодПоОКПО				= ЭтотОбъект.Организация.КодПоОКПО;
	ОбластьМакета.Параметры.ВидДеятельностиПоОКДП	= ЭтотОбъект.Организация.КодПоОКДП;
	ОбластьМакета.Параметры.ГрузополучательПоОКПО	= ОбластьМакета.Параметры.Грузополучатель.КодПоОКПО;
	ОбластьМакета.Параметры.ПоставщикПоОКПО			= ОбластьМакета.Параметры.Поставщик.КодПоОКПО;
	ОбластьМакета.Параметры.ПлательщикПоОКПО		= ОбластьМакета.Параметры.Плательщик.КодПоОКПО;
	
	ОбластьМакета.Параметры.ДокументОснованиеПредставление = ДоговорВзаиморасчетов.Наименование;
	ОбластьМакета.Параметры.ДокументОснование = ДоговорВзаиморасчетов;
	ОбластьМакета.Параметры.ОснованиеДата = "";
	ОбластьМакета.Параметры.ОснованиеНомер = ""; 
	
	ОбластьМакета.Параметры.Номер = дкПолучитьНомерДляПечати(ЭтотОбъект);	
	ТабДокумент.Вывести(ОбластьМакета);
	
	НомерСтраницы	= 2;
	НомерСтраницыПред = НомерСтраницы;
	КоличествоСтрокНаТекущейСтранице=0;
	
	ОбластьЗаголовокТаблицы	= Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ОбластьСтрока			= Макет.ПолучитьОбласть("Строка");
	ОбластьИтоги			= Макет.ПолучитьОбласть("ИтогоПоСтранице");
	ОбластьВсего			= Макет.ПолучитьОбласть("Всего");
	//!!! TimR: В новой пф данное поле не выводится
	//ОбластьВсегоСтавкаНДС	= Макет.ПолучитьОбласть("ВсегоСтавкаНДС");
	
	СтруктураИтоговПоСтранице = Новый Структура("ИтогКоличествоПоСтранице,ИтогСуммыПоСтранице,ИтогНДСПоСтранице,ИтогСуммыСНДСПоСтранице",0,0,0,0);		
	
	ОбластьЗаголовокТаблицы.Параметры.валюта=ВалютаДокумента;
	ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);	
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	//заполним параметры шапки таблицы для следующего листа
	ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 

	ВыборкаСтрок = ЭтотОбъект.Товары;
	
	КоличествоСтрок = ВыборкаСтрок.Количество();

	// инициализация итогов по документу
	ИтогоКоличество = 0;
	ИтогоСумма      = 0;
	ИтогоНДС        = 0;
	ИтогоСуммаСНДС  = 0;
	
	СоответствиеИтоговПоставкамНДС = Новый Соответствие();
	
	// Выводим многострочную часть документа
	Для каждого СтрокаТоваров Из ВыборкаСтрок Цикл
		//заполняем данные строки
		СтруктураСтроки = дкПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТоваров,ЭтотОбъект);
		ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);
		ОбластьСтрока.Параметры.БазоваяЕдиницаНаименование	= СтрокаТоваров.ЕдиницаИзмерения;
		ОбластьСтрока.Параметры.БазоваяЕдиницаКодПоОКЕИ		= СтрокаТоваров.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;
		ОбластьСтрока.Параметры.Количество					= Формат(СтрокаТоваров.Количество,ФорматВыводаКоличества);
		ОбластьСтрока.Параметры.КоличествоМест				= Формат(СтрокаТоваров.Количество*СтрокаТоваров.Коэффициент,ФорматВыводаКоличества);
		ОбластьСтрока.Параметры.КоличествоВОдномМесте		= Формат(СтрокаТоваров.Коэффициент,ФорматВыводаКоличества);
		
		//доп. области
		мсвДопОбластиПодвала = Неопределено;
		Если ВыборкаСтрок.Индекс(СтрокаТоваров) = ВыборкаСтрок.Количество()-1 Тогда
			мсвДопОбластиПодвала = Новый Массив;
			мсвДопОбластиПодвала.Добавить(ОбластьВсего);
			//!!! TimR: В новой пф данное поле не выводится
			//мсвДопОбластиПодвала.Добавить(ОбластьВсегоСтавкаНДС);
			мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
		КонецЕсли;
		
		Если КоличествоСтрокНаТекущейСтранице=0 Тогда
			ТабДокумент.Вывести(ОбластьСтрока);
		Иначе
			//выводим строку, делая проверку попадания на лист		
			НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрока, ОбластьЗаголовокТаблицы, ОбластьИтоги,
				НомерСтраницы, СтруктураИтоговПоСтранице, ЭтотОбъект, мсвДопОбластиПодвала);
		КонецЕсли; 
		
		// увеличим итоги по странице
		СтруктураСтрокиИтогов = Новый Структура("ИтогКоличествоПоСтранице,ИтогСуммыПоСтранице,ИтогНДСПоСтранице,ИтогСуммыСНДСПоСтранице");
		СтруктураСтрокиИтогов.ИтогКоличествоПоСтранице = СтрокаТоваров.Количество;
		СтруктураСтрокиИтогов.ИтогСуммыПоСтранице      = СтрокаТоваров.СуммаВсего-СтрокаТоваров.СуммаНДС;
		СтруктураСтрокиИтогов.ИтогНДСПоСтранице		   = СтрокаТоваров.СуммаНДС;
		СтруктураСтрокиИтогов.ИтогСуммыСНДСПоСтранице   = СтрокаТоваров.СуммаВсего;
		
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			СтруктураИтоговПоСтранице = Новый Структура("ИтогКоличествоПоСтранице,ИтогСуммыПоСтранице,ИтогНДСПоСтранице,ИтогСуммыСНДСПоСтранице",0,0,0,0);
			НомерСтраницыПред = НомерСтраницы;
			КоличествоСтрокНаТекущейСтранице=0;
			ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		Иначе
			КоличествоСтрокНаТекущейСтранице=КоличествоСтрокНаТекущейСтранице+1;
		КонецЕсли;
		//добавляем итоги
		дкДобавитьИтогиПоСтранице(СтруктураСтрокиИтогов,СтруктураИтоговПоСтранице);
		
		// итоги по ставкам НДС
		Если НЕ обЗначениеНеЗаполнено(СтрокаТоваров.СтавкаНДС) Тогда
			Если СоответствиеИтоговПоставкамНДС[СтрокаТоваров.СтавкаНДС] = Неопределено Тогда
				СоответствиеИтоговПоставкамНДС.Вставить(СтрокаТоваров.СтавкаНДС,0);
			КонецЕсли;
			СоответствиеИтоговПоставкамНДС[СтрокаТоваров.СтавкаНДС] = СоответствиеИтоговПоставкамНДС[СтрокаТоваров.СтавкаНДС] + СтрокаТоваров.СуммаНДС;
		КонецЕсли;
	КонецЦикла;
	
	//выводим последний подвал, если страниц больше единицы
	Если НомерСтраницы > 1 Тогда
		дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьИтоги,СтруктураИтоговПоСтранице,ЭтотОбъект);
	КонецЕсли;
	
	// Выводим итоги по документу в целом
	ОбластьВсего.Параметры.ИтогКоличество = Формат(ВыборкаСтрок.Итог("Количество"), ФорматВыводаКоличества);
	ОбластьВсего.Параметры.ИтогСуммы      = Формат(ВыборкаСтрок.Итог("СуммаВсего")-ВыборкаСтрок.Итог("СуммаНДС"), ФорматВыводаСуммы);
	ОбластьВсего.Параметры.ИтогНДС        = Формат(ВыборкаСтрок.Итог("СуммаНДС"), ФорматВыводаСуммы);
	ОбластьВсего.Параметры.ИтогСуммыСНДС  = Формат(ВыборкаСтрок.Итог("СуммаВсего"), ФорматВыводаСуммы);
	ТабДокумент.Вывести(ОбластьВсего);
	
	//!!! TimR: В новой пф данное поле не выводится
	//// выведем итоги по ставкам НДС
	//Для Каждого ЭлементСоответствия Из СоответствиеИтоговПоставкамНДС Цикл
	//	ОбластьВсегоСтавкаНДС.Параметры.СтавкаНДС = "Итого по ставке НДС: "
	//	+дкПолучитьПредставлениеСтавкиНДС(ЭлементСоответствия.Ключ,"%");
	//	ОбластьВсегоСтавкаНДС.Параметры.ИтогНДС = ЭлементСоответствия.Значение;
	//	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьВсегоСтавкаНДС, , , НомерСтраницы,,ЭтотОбъект);
	//КонецЦикла;
	
	// Выводим подвал документа
	ОбластьПодвал.Параметры.Заполнить(ЭтотОбъект);
	ОбластьПодвал.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ЧислоПрописью(КоличествоСтрок, ,",,,,,,,,0");
	ОбластьПодвал.Параметры.СуммаПрописью = обЧислоПрописью(ЭтотОбъект.Товары.Итог("СуммаВсего"),ЭтотОбъект.ВалютаДокумента);
	
	Доверенность = обПолучитьЗначениеСвойства(ЭтотОбъект,"Доверенность");
	Если НЕ обЗначениеНеЗаполнено(Доверенность) Тогда
		ОбластьПодвал.Параметры.ДоверенностьНомер = ?(ПустаяСтрока(Доверенность.Серия),"",Доверенность.Серия + "-") + Доверенность.Номер;
		ОбластьПодвал.Параметры.ДоверенностьДата  = Доверенность.ДатаВыдачи;
		ОбластьПодвал.Параметры.ДоверенностьВыдана= Доверенность.КемВыдан;
	КонецЕсли; 
	
	ДатаОтгрузки=обПолучитьЗначениеСвойства(ЭтотОбъект,"ДатаОтгрузки",Дата('00010101'));
	ДатаОтгрузки=?(обЗначениеНеЗаполнено(ДатаОтгрузки),"""___""____________ 20___",Формат(ДатаОтгрузки,"ДФ=dd.MM.yyyy"));
	ОбластьПодвал.Параметры.ДатаОтгрузки = ДатаОтгрузки;
	
	// Заполним информацию о руководителях организации
	Руководитель = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.Руководитель);
	ОбластьПодвал.Параметры.Заполнить(Руководитель);
	
	ГлавныйБухгалтер = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер);
	ОбластьПодвал.Параметры.Заполнить(ГлавныйБухгалтер);
	
	Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
	ОбластьПодвал.Параметры.Заполнить(Отпустил);
	
	Получил = дкОтветственноеЛицо(ЭтотОбъект,"ПолучилКонтрагент");
	Получил.Вставить("ПолучилПредставление", Получил.ПолучилКонтрагентПредставление);
	ОбластьПодвал.Параметры.Заполнить(Получил);
	
	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвал, , , НомерСтраницы,,ЭтотОбъект);
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьТОРГ12()
	
// Формирует печатную форму "ТОРГ-2"
	// 
	// Параметры:
	//  ТабДокумент - табличный документ.
	//
	// Возвращаемое значение:
	//  ТабДокумент - возвращает сформированный табличный документ.
	//
Функция ПечатьТОРГ2(ТабДокумент) Экспорт
		Перем тзВрем; // Временная таблица значений
		Перем ФорматВыводаСуммы; // Строка формата вывода суммы
		Перем ФорматВыводаКоличества; // Строка формата вывода количества
		
		ФорматВыводаСуммы      = обПраво("ФорматВыводаСуммы",     Права,,ЭтотОбъект);
		ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества",Права,,ЭтотОбъект);
		
		// Получим табличную часть за исключением услуг
		тзВрем = Товары.Выгрузить();
		тзВрем.Колонки.Добавить("Брутто", Новый ОписаниеТипов("Число",
		Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)));
		мсвУдалить = Новый Массив;
		Для каждого ТекСтрока Из тзВрем Цикл
			Если ТекСтрока.Номенклатура.ВидНоменклатуры=Перечисления.ВидыНоменклатуры.Услуга Тогда
				мсвУдалить.Добавить(ТекСтрока);
				Продолжить;
			КонецЕсли;
			ТекСтрока.Брутто = ТекСтрока.Количество * ТекСтрока.ЕдиницаИзмерения.Вес;
		КонецЦикла;
		Для каждого ТекСтрока Из мсвУдалить Цикл
			тзВрем.Удалить(ТекСтрока);	   
		КонецЦикла;
		
		Макет = ПолучитьОбщийМакет("ТОРГ2");
		
		ОбластьСтраница1 = Макет.ПолучитьОбласть("ШапкаСтраница1");
		ОбластьСтраница1.Параметры.Заполнить(ЭтотОбъект);
		
		Параметры = Новый Структура;
		
		СтруктураПредставления1=Новый Структура(
		"Наименование,ИНН,КПП,АдресЮридический,ТелефонРабочий",
		"","ИНН ","КПП ","","тел.: "
		);
		СтруктураПредставления2=Новый Структура(
		"Наименование,ИНН,КПП,АдресФактический,ТелефонРабочий",
		"","ИНН ","КПП ","","тел.: "
		);
		
		// Правим, что автоматом не заполнилось, или заполнилось неправильно
		Если НЕ обЗначениеНеЗаполнено(ПодразделениеКомпании) И НЕ обЗначениеНеЗаполнено(ПодразделениеКомпании.КПП) Тогда
			СтрокаПредставления = спПолучитьПредставление(Организация, СтруктураПредставления1);
			Параметры.Вставить("ОрганизацияПредставление", СтрЗаменить(СтрокаПредставления, Организация.КПП, ПодразделениеКомпании.КПП));
		Иначе	
			Параметры.Вставить("ОрганизацияПредставление", спПолучитьПредставление(Организация, СтруктураПредставления1));
		КонецЕсли;
		Параметры.Вставить("КодПоОКПО",				 Организация.КодПоОКПО);
		Параметры.Вставить("ВидДеятельностиПоОКДП",	 Организация.КодПоОКДП);
		
		Параметры.Вставить("ПредставлениеДокумента", дкПолучитьПредставление(Ссылка));
		Параметры.Вставить("Номер",	 дкПолучитьНомерДляПечати(ЭтотОбъект));
		Параметры.Вставить("Дата",	 Дата);
		
		Параметры.Вставить("МестоПриемки",	                 СкладКомпании);
		Параметры.Вставить("ГрузоотправительПредставление",	 спПолучитьПредставление(обПолучитьЗначениеСвойства(,"Грузоотправитель",Контрагент),СтруктураПредставления2));
		Параметры.Вставить("ПоставщикПредставление",	     спПолучитьПредставление(Контрагент,СтруктураПредставления1));
		Параметры.Вставить("ПроизводительПредставление",	 дкОтветственноеЛицо(ЭтотОбъект, "Производитель").ПроизводительПредставление);
		Параметры.Вставить("СтраховаяКомпанияПредставление", дкОтветственноеЛицо(ЭтотОбъект, "СтраховаяКомпания").СтраховаяКомпанияПредставление);
		Параметры.Вставить("СпособДоставкиПредставление",    обПолучитьЗначениеСвойства(ЭтотОбъект, ПланыВидовХарактеристик.СвойстваОбъектов.СпособДоставки, ""));
		
		ДатаОтправления = обПолучитьЗначениеСвойства(ЭтотОбъект, ПланыВидовХарактеристик.СвойстваОбъектов.ДатаОтправления, "");
		Если ДатаОтправления<>"" Тогда
			ДатаОтправления = "Дата отправления товара: " + Формат(ДатаОтправления, "ДЛФ=DD");
		Иначе
			ДатаОтправления = "Дата отправления товара " + " ""_______""  _____________________ _______ г.";
		КонецЕсли;
		
		Параметры.Вставить("ДатаОтправления", ДатаОтправления);
		
		Параметры.Вставить("НомерДоговора",	СокрЛП(ДоговорВзаиморасчетов.НомерДоговора));
		Параметры.Вставить("ДатаДоговора",  Формат(ДоговорВзаиморасчетов.ДатаНачала, "ДЛФ=DD"));
		
		// Счет-фактура, если есть.
		МассивВидов=Новый Массив(1); МассивВидов[0]="СчетФактураПолученный"; 
		МассивПодчиненных = дкПолучитьМассивПодчиненных(Ссылка, МассивВидов);
		Если МассивПодчиненных.Количество()>0 Тогда
			// нашли
			СФ=МассивПодчиненных[0].Ссылка;
			Попытка
				НомерСФ = дкПолучитьНомерДляПечати(СФ);
				ДатаСФ  = Формат(СФ.Дата, "ДЛФ=DD");
			Исключение
				НомерСФ = "";
				ДатаСФ  = """" + "_______"  + """" + "  __________________________  " + "__________ г.";
			КонецПопытки; 
		Иначе
			НомерСФ = "";
			ДатаСФ  = """" + "_______"  + """" + "  __________________________  " + "__________ г.";
		КонецЕсли; 
		
		Параметры.Вставить("НомерСФ", НомерСФ);
		Параметры.Вставить("ДатаСФ",  ДатаСФ);
		
		ОбластьСтраница1.Параметры.Заполнить(Параметры);
		
		ТабДокумент.Вывести(ОбластьСтраница1);
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		// ВТОРАЯ СТРАНИЦА
		НомерСтраницы     = 3;
		НомерСтраницыПред = НомерСтраницы;
		
		ОбластьНомерСтроки = Макет.ПолучитьОбласть("НомерСтраницы");
		ОбластьНомерСтроки.Параметры.НомерСтраницы = "Страница: " + 2; 
		ТабДокумент.Вывести(ОбластьНомерСтроки);
		
		ОбластьСтраница2   = Макет.ПолучитьОбласть("ШапкаСтраница2"); 
		ОбластьСтраница2.Параметры.КоличествоМестПоДокументу = Формат(тзВрем.Итог("Количество"), ФорматВыводаКоличества);
		ОбластьСтраница2.Параметры.Брутто                    = Формат(тзВрем.Итог("Брутто"),           ФорматВыводаКоличества);    
		ТабДокумент.Вывести(ОбластьСтраница2);
		
		// ВЫВОДИМ ТАБЛИЧНУЮ ЧАСТЬ
		ОбластьШапкаТЧ = Макет.ПолучитьОбласть("ШапкаТабличнойЧасти"); 
		ОбластьШапкаТЧ.Параметры.Валюта = ВалютаДокумента;
		ТабДокумент.Вывести(ОбластьШапкаТЧ);
		// Для последующего вывода
		ОбластьШапкаТЧ.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
		
		// получаем макет строки
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка1");
		
		//перебор строк
		ВыборкаТабличнойЧасти = Товары;
		Для каждого СтрокаТабличнойЧасти Из тзВрем Цикл
			
			//заполняем данные строки
			СтруктураСтроки = дкПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТабличнойЧасти,ЭтотОбъект);
			ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);
			
			// Рассчитаем цену.
			ОбластьСтрока.Параметры.Цена = Формат(СтрокаТабличнойЧасти.СуммаВсего / СтрокаТабличнойЧасти.Количество, ФорматВыводаСуммы);
			
			ОбластьСтрока.Параметры.КодЕдиницыПоОКЕИ = "" + СокрЛП(СтруктураСтроки.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код);
			ОбластьСтрока.Параметры.Артикул          = "" + СтруктураСтроки.Номенклатура.Артикул;
			
			//выводим строку, делая проверку попадания на лист
			НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрока, ОбластьШапкаТЧ, , НомерСтраницы, ,ЭтотОбъект);  		
			
			//инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				НомерСтраницыПред = НомерСтраницы;
				ОбластьШапкаТЧ.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			КонецЕсли; 		
		КонецЦикла;
		
		
		// ВЫВОДИМ 3-Ю СТРАНИЦУ
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
		ОбластьНомерСтроки = Макет.ПолучитьОбласть("НомерСтраницы");
		ОбластьНомерСтроки.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		ТабДокумент.Вывести(ОбластьНомерСтроки);
		
		ОбластьСтраница3   = Макет.ПолучитьОбласть("ШапкаСтраница3"); 	
		ТабДокумент.Вывести(ОбластьСтраница3);
		
		НомерСтраницы = НомерСтраницы + 1;
		
		// ВЫВОДИМ ПРОДОЛЖЕНИЕ ТАБЛИЧНОЙ ЧАСТИ
		ОбластьШапкаТЧ = Макет.ПолучитьОбласть("ШапкаТабличнойЧасти2"); 
		ОбластьШапкаТЧ.Параметры.Валюта = ВалютаДокумента;
		ТабДокумент.Вывести(ОбластьШапкаТЧ);
		// Для последующего вывода
		ОбластьШапкаТЧ.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
		
		// получаем макет строки
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка2");
		
		//перебор строк
		Для каждого СтрокаТабличнойЧасти Из тзВрем Цикл
			//заполняем данные строки
			СтруктураСтроки = дкПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТабличнойЧасти,ЭтотОбъект);
			ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);		
			ОбластьСтрока.Параметры.Артикул = "" + СтруктураСтроки.Номенклатура.Артикул;
			
			//выводим строку, делая проверку попадания на лист
			НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрока, ОбластьШапкаТЧ, , НомерСтраницы, ,ЭтотОбъект);  		
			
			//инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				НомерСтраницыПред = НомерСтраницы;
				ОбластьШапкаТЧ.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			КонецЕсли; 		
		КонецЦикла;
		
		
		// ВЫВОДИМ 4-Ю СТРАНИЦУ
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		ОбластьНомерСтроки = Макет.ПолучитьОбласть("НомерСтраницы");
		ОбластьНомерСтроки.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		ТабДокумент.Вывести(ОбластьНомерСтроки);
		
		ОбластьСтраница4 = Макет.ПолучитьОбласть("ШапкаСтраница4");
		
		ГлавныйБухгалтер = дкОтветственноеЛицо(ЭтотОбъект,"ГлавныйБухгалтер");
		ОбластьСтраница4.Параметры.Заполнить(ГлавныйБухгалтер);
		
		// Комиссия
		ПредседательКомиссии = дкОтветственноеЛицо(ЭтотОбъект,"ПредседательКомиссии");
		ОбластьСтраница4.Параметры.Заполнить(ПредседательКомиссии);
		
		ЧленКомиссии1 = дкОтветственноеЛицо(ЭтотОбъект,"ЧленКомиссии1");
		ОбластьСтраница4.Параметры.Заполнить(ЧленКомиссии1);
		
		ЧленКомиссии2 = дкОтветственноеЛицо(ЭтотОбъект,"ЧленКомиссии2");
		ОбластьСтраница4.Параметры.Заполнить(ЧленКомиссии2);
		
		ТабДокумент.Вывести(ОбластьСтраница4); 
		
		
		// Зададим параметры макета
		ТабДокумент.ПолеСверху = 0;
		ТабДокумент.ПолеСлева  = 15;
		ТабДокумент.ПолеСнизу  = 0;
		ТабДокумент.ПолеСправа = 0;
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		
		Возврат ТабДокумент;	
	КонецФункции // ПечатьТОРГ2()
	
// Функция осуществляет печать произвольного документа.
// Можно направить печать на экран или принтер, а также распечатать необходимое количество копий.
//
// Параметры:
//	ЭтотОбъект							- ДокументОбъект	- Документ для печати
//	НазваниеПечатнойФормы 				- Строка			- Название печатной формы, если пусто, то по умолчанию
//	КоличествоЭкземпляров				- Число				- Количество экземпляров документа
//	НаПринтер							- Булево			- Признак отправки документа на принтер без отображения его на экране
//  Документ 	  						- ТабличныйДокумент	- Макет печатной формы
//
// Возвращаемое значение:
//   ТабличныйДокумент	- Сформированная печатная форма
//
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции // Печать()

// Возвращает доступные варианты печати документа
// Возвращаемое значение: 
//  Структура, каждая строка которой
//  соответствует одному из вариантов печати
//  Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм() Экспорт
	СтруктураМакетов=Новый Структура();
	//СтруктураМакетов.Вставить("ВозвратПоставщику", "Возвратная накладная");
	СтруктураМакетов.Вставить("ТОРГ12", "ТОРГ-12 (Товарная накладная)");
	СтруктураМакетов.Вставить("ТОРГ2",  "ТОРГ-2 (Акт о расхождении по количеству и качеству)");  
	СтруктураМакетов.Вставить("ЭтикетокИЦенников","Печать этикеток и ценников");
	Возврат СтруктураМакетов;
КонецФункции // ПолучитьСписокПечатныхФорм()

// Формирует печатную форму "УПД"
// Возвращает сформированный табличный документ:
Функция ПечатьУПД(ТабДокумент) Экспорт
	
	ТабДокумент = дкПечатьУПД(ЭтотОбъект,ТабДокумент);
	Возврат ТабДокумент;	
	
КонецФункции //ПечатьУПД()
#КонецЕсли
// Если Клиент Тогда - завершена клиентская часть

//Получение табличной части товаров по документу
//
// Возвращаемое значение: 
//  Результат запроса - результат запроса по табличной части товаров
Функция ПолучитьТаблицуТоваров()
	
	ТипЦенСклада = СкладКомпании.ТипЦенРозничнойТорговли;
	АлгоритмПолученияЦены        = ТипЦенСклада.АлгоритмПолученияЦены;
	ВедетсяУчетПоЕдиницам        = (АлгоритмПолученияЦены=Перечисления.АлгоритмПолученияЦены.ПоЕдиницеИзмерения);
	ВедетсяУчетПоХарактеристикам = (АлгоритмПолученияЦены=Перечисления.АлгоритмПолученияЦены.ПоХарактеристике);
	
	//Запрос.УстановитьПараметр("ПодразделениеОрг", Справочники.ПодразделенияКомпании.ОсновноеПодразделение);
	
	ОсновноеПодразделение = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
	ДобавитьОсновноеПодразделение = (НЕ ОсновноеПодразделение = Справочники.ПодразделенияКомпании.ПустаяСсылка());
	
	ТаблицаИерархииПодразделений = Новый ТаблицаЗначений;
	ТаблицаИерархииПодразделений.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании"));
	ТаблицаИерархииПодразделений.Колонки.Добавить("Уровень",       Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
	
	ТекущееПодразделение = ПодразделениеКомпании;
	Уровень = 0;
	Пока ЗначениеЗаполнено(ТекущееПодразделение) Цикл
		СтрокаПодразделения = ТаблицаИерархииПодразделений.Добавить();
		СтрокаПодразделения.Подразделение = ТекущееПодразделение;
		СтрокаПодразделения.Уровень       = Уровень;
		
		Если ТекущееПодразделение = ОсновноеПодразделение Тогда
			ДобавитьОсновноеПодразделение = Ложь;
		КонецЕсли;
		
		// Получаем родителя подразделения
		ТекущееПодразделение = ТекущееПодразделение.Родитель;
		Уровень = Уровень + 1;
	КонецЦикла;
	
	Если ДобавитьОсновноеПодразделение Тогда
		СтрокаПодразделения = ТаблицаИерархииПодразделений.Добавить();
		СтрокаПодразделения.Подразделение = ОсновноеПодразделение;
		СтрокаПодразделения.Уровень       = Уровень;
		Уровень = Уровень + 1;
	КонецЕсли;
	
	СтрокаПодразделения = ТаблицаИерархииПодразделений.Добавить();
	СтрокаПодразделения.Подразделение = Справочники.ПодразделенияКомпании.ПустаяСсылка();
	СтрокаПодразделения.Уровень = Уровень;
	
	ТекстЦена     = "ТаблицаЦен.Цена";
	РабочийТипЦен = ТипЦенСклада;
	
	Запрос = Новый Запрос;
	
	ТекстСоединенийПроцентыСкидкиНаценки = "";
	// Если расчетная цена получим базовую цену
	Счетчик = 1;
	Пока РабочийТипЦен.Рассчитывается Цикл
		// ведется ли расчет по типу номенклатуры
		Если РабочийТипЦен.ПроцентыСкидкиНаценки.Количество()>0 Тогда
			ИмяТаблицы = "ПроцентыСкидкиНаценки" + Строка(Счетчик);
			ТекстСоединенийПроцентыСкидкиНаценки = ТекстСоединенийПроцентыСкидкиНаценки + "
			|ЛЕВОЕ СОЕДИНЕНИЕ
			|	Справочник.ТипыЦен.ПроцентыСкидкиНаценки КАК " + ИмяТаблицы + "
			|ПО
			|	" + ИмяТаблицы + ".Ссылка = &ТипЦены" + Строка(Счетчик) + " И 
			|	ТаблицаЦен.Номенклатура.ТипНоменклатуры = " + ИмяТаблицы + ".ТипНоменклатуры";
			
			ТекстЦена = "("+ТекстЦена + "+" + ТекстЦена + "*ЕСТЬNULL(" + ИмяТаблицы + ".ПроцентСкидкиНаценки/100, " + Формат(РабочийТипЦен.ПроцентСкидкиНаценки/100,"ЧРД=.; ЧН=0")+"))";
			
			Запрос.УстановитьПараметр("ТипЦены" + Строка(Счетчик), РабочийТипЦен);
			
			Счетчик = Счетчик + 1;
		Иначе
			
			Если РабочийТипЦен.ПроцентСкидкиНаценки <> 0 Тогда
				ТекстЦена = "("+ТекстЦена + "+" + ТекстЦена + "*" + Формат(РабочийТипЦен.ПроцентСкидкиНаценки/100,"ЧРД=.")+")";
			КонецЕсли;
			
		КонецЕсли;
		
		РабочийТипЦен = РабочийТипЦен.БазовыйТипЦен;
	КонецЦикла;
	
	ТекстВыборкиЦен = "";
	ТекстСоединениеЦен = "";
	Если ВедетсяУчетПоЕдиницам Тогда
		
		ТекстВыборкиЦен = ",
		|	СУММА(ЕСТЬNULL(ТаблицаЦен.Цена, ЕСТЬNULL(ТаблицаЦенБаза.Цена, ЕСТЬNULL(ТаблицаЦенОбщ.Цена, 0)))*ТаблДок.Количество) КАК СуммаРозничная";
		
		ТекстСоединениеЦен = "
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ИтоговаяТаблицаЦен КАК ТаблицаЦен
		|ПО
		|	ТаблДок.Номенклатура = ТаблицаЦен.Номенклатура И
		|	ТаблДок.ЕдиницаИзмерения = ТаблицаЦен.ЕдиницаИзмерения
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ИтоговаяТаблицаЦен КАК ТаблицаЦенБаза
		|ПО
		|	ТаблДок.Номенклатура = ТаблицаЦенБаза.Номенклатура И
		|	ТаблицаЦенБаза.ЭтоБазовая = ИСТИНА
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ИтоговаяТаблицаЦен КАК ТаблицаЦенОбщ
		|ПО
		|	ТаблДок.Номенклатура = ТаблицаЦенОбщ.Номенклатура И
		|	ТаблицаЦенОбщ.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
		|";
	ИначеЕсли ВедетсяУчетПоХарактеристикам Тогда
		
		ТекстВыборкиЦен = ",
		|	СУММА(ЕСТЬNULL(ТаблицаЦен.Цена, ЕСТЬNULL(ТаблицаЦенОбщ.Цена, 0))*ТаблДок.Количество) КАК СуммаРозничная";
		
		ТекстСоединениеЦен = "
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ИтоговаяТаблицаЦен КАК ТаблицаЦен
		|ПО
		|	ТаблДок.Номенклатура = ТаблицаЦен.Номенклатура И
		|	ТаблДок.ХарактеристикаНоменклатуры = ТаблицаЦен.ХарактеристикаНоменклатуры
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ИтоговаяТаблицаЦен КАК ТаблицаЦенОбщ
		|ПО
		|	ТаблДок.Номенклатура = ТаблицаЦенОбщ.Номенклатура И 
		|	ТаблицаЦенОбщ.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|";
	Иначе
		
		ТекстВыборкиЦен = ",
		|	СУММА(ЕСТЬNULL(ТаблицаЦен.Цена, 0)*ТаблДок.Количество) КАК СуммаРозничная";
		
		ТекстСоединениеЦен = "
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ИтоговаяТаблицаЦен КАК ТаблицаЦен
		|ПО
		|	ТаблДок.Номенклатура = ТаблицаЦен.Номенклатура
		|";
	КонецЕсли;
	
	ТекстЦена = ТекстЦена + "*ТабВалют.Курс";
	
	ВалютаИзНоменклатуры = РабочийТипЦен.ВВалютеУчета;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаПодразделений.Подразделение КАК Подразделение,
	|	ТаблицаПодразделений.Уровень КАК Уровень
	|ПОМЕСТИТЬ
	|	ТаблицаПодразделений
	|ИЗ
	|	&ТаблицаПодразделений КАК ТаблицаПодразделений
	|ИНДЕКСИРОВАТЬ ПО
	|	Подразделение
	|;
	|
	|ВЫБРАТЬ
	|	ВозвратПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	ВозвратПоставщикуТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	"+?(ВедетсяУчетПоЕдиницам,"ВозвратПоставщикуТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,", "")+"
	|	СУММА(ВозвратПоставщикуТовары.Количество * ВозвратПоставщикуТовары.Коэффициент) КАК Количество,
	|	0 КАК СуммаСкидки,
	|	0 КАК Резерв
	|ПОМЕСТИТЬ
	|	ТаблДокумента
	|ИЗ
	|	Документ.ВозвратПоставщику.Товары КАК ВозвратПоставщикуТовары
	|ГДЕ
	|	ВозвратПоставщикуТовары.Ссылка = &Ссылка И
	|	ВозвратПоставщикуТовары.Номенклатура.ВидНоменклатуры <> &Услуга
	|СГРУППИРОВАТЬ ПО
	|	ВозвратПоставщикуТовары.Номенклатура,
	|	ВозвратПоставщикуТовары.ХарактеристикаНоменклатуры"+?(ВедетсяУчетПоЕдиницам, ",
	|	ВозвратПоставщикуТовары.ЕдиницаИзмерения", "")+"
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблДокумента.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ
	|	ОтборПоНоменклатуре
	|ИЗ
	|	ТаблДокумента КАК ТаблДокумента
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	Валюты.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА Валюты.Кратность = 0 Тогда
	|			Валюты.Курс
	|		ИНАЧЕ
	|			Валюты.Курс/Валюты.Кратность
	|	КОНЕЦ КАК Курс
	|	
	|ПОМЕСТИТЬ
	|	ТабВалют
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, "+?(ВалютаИзНоменклатуры, "", "Валюта = &ВалютаЦен")+") КАК Валюты
	|ГДЕ
	|	Валюты.Курс > 0
	|;
	|
	|ВЫБРАТЬ
	|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура" + ?(ВедетсяУчетПоЕдиницам, ",
	|	ЦеныСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения", "") + ?(ВедетсяУчетПоХарактеристикам, ",
	|	ЦеныСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры", "") + ",
	|	ТаблицаПодразделений.Уровень КАК Уровень,
	|	ЦеныСрезПоследних.Цена КАК Цена
	|ПОМЕСТИТЬ
	|	ТаблицаЦен
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних(
	|			&МоментВремени,
	|			ТипЦен = &ТипЦен И 
	|			Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)" + ?(НЕ ВедетсяУчетПоЕдиницам, " И 
	|			ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)", "") + ?(НЕ ВедетсяУчетПоХарактеристикам, " И 
	|			ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)", "") + " И 
	|			Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ ОтборПоНоменклатуре) И 
	|			ПодразделениеКомпании В (ВЫБРАТЬ Подразделение ИЗ ТаблицаПодразделений)) КАК ЦеныСрезПоследних
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаПодразделений КАК ТаблицаПодразделений
	|ПО
	|	ЦеныСрезПоследних.ПодразделениеКомпании = ТаблицаПодразделений.Подразделение
	|ГДЕ
	|	ЦеныСрезПоследних.Цена > 0
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаПодразделений
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаЦен.Номенклатура КАК Номенклатура" + ?(ВедетсяУчетПоЕдиницам, ",
	|	ТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения", "") + ?(ВедетсяУчетПоХарактеристикам, ",
	|	ТаблицаЦен.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры", "") + ",
	|	МИНИМУМ(ТаблицаЦен.Уровень) КАК Уровень
	|ПОМЕСТИТЬ
	|	СрезПоследних
	|ИЗ
	|	ТаблицаЦен КАК ТаблицаЦен
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЦен.Номенклатура" + ?(ВедетсяУчетПоЕдиницам, ",
	|	ТаблицаЦен.ЕдиницаИзмерения", "") + ?(ВедетсяУчетПоХарактеристикам, ",
	|	ТаблицаЦен.ХарактеристикаНоменклатуры", "") + "
	|;
	|
	|ВЫБРАТЬ
	|	СрезПоследних.Номенклатура КАК Номенклатура" + ?(ВедетсяУчетПоЕдиницам, ",
	|	СрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА СрезПоследних.Номенклатура.БазоваяЕдиницаИзмерения = СрезПоследних.ЕдиницаИзмерения.ЕдиницаПоКлассификатору И 
	|			СрезПоследних.ЕдиницаИзмерения.Коэффициент = 1 ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ КАК ЭтоБазовая", "") + ?(ВедетсяУчетПоХарактеристикам, ",
	|	СрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры", "") + ",
	|	" + ТекстЦена + " КАК Цена
	|ПОМЕСТИТЬ
	|	ИтоговаяТаблицаЦен
	|ИЗ
	|	СрезПоследних КАК СрезПоследних
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаЦен КАК ТаблицаЦен
	|ПО
	|	СрезПоследних.Номенклатура = ТаблицаЦен.Номенклатура" + ?(ВедетсяУчетПоЕдиницам, " И 
	|	СрезПоследних.ЕдиницаИзмерения = ТаблицаЦен.ЕдиницаИзмерения", "") + ?(ВедетсяУчетПоХарактеристикам, " И 
	|	СрезПоследних.ХарактеристикаНоменклатуры = ТаблицаЦен.ХарактеристикаНоменклатуры", "") + " И 
	|	СрезПоследних.Уровень = ТаблицаЦен.Уровень
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ТабВалют КАК ТабВалют
	|ПО
	|	" + ?(ВалютаИзНоменклатуры, "СрезПоследних.Номенклатура.ВалютаУчета = ТабВалют.Валюта", "ИСТИНА") + "
	|" + ТекстСоединенийПроцентыСкидкиНаценки + "
	|;
	|
	|УНИЧТОЖИТЬ
	|	СрезПоследних
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаЦен
	|;
	|
	|ВЫБРАТЬ
	|	&СкладКомпании                             КАК СкладКомпании,
	|	ИтоговаяТаблица.Номенклатура               КАК Номенклатура,
	|	ИтоговаяТаблица.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ИтоговаяТаблица.Количество                 КАК Количество,
	|	ИтоговаяТаблица.СуммаСкидки                КАК СуммаСкидки,
	|	ИтоговаяТаблица.Резерв                     КАК Резерв,
	|	ВЫБОР
	|		КОГДА ИтоговаяТаблица.СуммаРозничная = 0 ТОГДА
	|			ИтоговаяТаблица.СуммаРозничнаяПоОст
	|		ИНАЧЕ
	|			ИтоговаяТаблица.СуммаРозничная
	|	КОНЕЦ КАК СуммаРозничная,
	|	ВЫБОР
	|		КОГДА ИтоговаяТаблица.СуммаРозничная = 0 ТОГДА
	|			ИтоговаяТаблица.ЦенаРозничная
	|		КОГДА ИтоговаяТаблица.Количество = 0 ТОГДА
	|			0
	|		ИНАЧЕ
	|			ИтоговаяТаблица.СуммаРозничная/ИтоговаяТаблица.Количество
	|	КОНЕЦ КАК ЦенаРозничная
	|ИЗ
	|(	ВЫБРАТЬ
	|		ТаблДок.Номенклатура               КАК Номенклатура,
	|		ТаблДок.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		СУММА(ТаблДок.Количество)          КАК Количество,
	|		МАКСИМУМ(ТаблДок.СуммаСкидки)      КАК СуммаСкидки,
	|		МАКСИМУМ(ТаблДок.Резерв)           КАК Резерв"+ТекстВыборкиЦен+",
	|		СУММА(ВЫБОР
	|			КОГДА Остатки.КоличествоОстаток ЕСТЬ NULL ИЛИ Остатки.КоличествоОстаток = 0 Тогда
	|				0
	|			ИНАЧЕ
	|				(Остатки.СуммаРознОстаток/Остатки.КоличествоОстаток)*ТаблДок.Количество
	|		КОНЕЦ) КАК СуммаРозничнаяПоОст,
	|		МАКСИМУМ(ВЫБОР
	|			КОГДА Остатки.КоличествоОстаток ЕСТЬ NULL ИЛИ Остатки.КоличествоОстаток = 0 Тогда
	|				0
	|			ИНАЧЕ
	|				(Остатки.СуммаРознОстаток/Остатки.КоличествоОстаток)
	|		КОНЕЦ) КАК ЦенаРозничная
	|	ИЗ
	|		ТаблДокумента КАК ТаблДок
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ОстаткиТоваровКомпании.Остатки(&МоментВремени, СкладКомпании = &СкладКомпании) КАК Остатки
	|	ПО
	|		ТаблДок.Номенклатура = Остатки.Номенклатура И
	|		ТаблДок.ХарактеристикаНоменклатуры = Остатки.ХарактеристикаНоменклатуры" + ТекстСоединениеЦен + "
	|	СГРУППИРОВАТЬ ПО
	|		ТаблДок.Номенклатура,
	|		ТаблДок.ХарактеристикаНоменклатуры) КАК ИтоговаяТаблица
	|";
	
	Запрос.УстановитьПараметр("МоментВремени",        МоментВремени());
	Запрос.УстановитьПараметр("Ссылка",               Ссылка);
	Запрос.УстановитьПараметр("СкладКомпании",        СкладКомпании);
	Запрос.УстановитьПараметр("Услуга",               Перечисления.ВидыНоменклатуры.Услуга);
	Запрос.УстановитьПараметр("ТипЦен",               РабочийТипЦен);
	Запрос.УстановитьПараметр("ТаблицаПодразделений", ТаблицаИерархииПодразделений);
	Запрос.УстановитьПараметр("ВалютаЦен",            РабочийТипЦен.ВалютаЦены);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции // ПолучитьТаблицуТоваров()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Процедура - обработчик ввода на основании
Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	Если обЗначениеНеЗаполнено(ХозОперация) Тогда
		ХозОперация=Справочники.ХозОперации.ВозвратТоваровПоставщику;
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		Если Основание.ХозОперация=Справочники.ХозОперации.ПоступлениеТоваровКомиссия Тогда
			ХозОперация=Справочники.ХозОперации.ВозвратТоваровПоставщикуКомиссия;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ВводОстатковТоваров") Тогда
		Если Основание.ХозОперация=Справочники.ХозОперации.ВводОстатковТоваровПринятыхНаКомиссию Тогда
			ХозОперация=Справочники.ХозОперации.ВозвратТоваровПоставщикуКомиссия;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
	
	Если Основание=Неопределено Тогда
		МассивУслуг=Новый Массив;
		Для каждого СтрокаТоваров Из Товары Цикл
			Если СтрокаТоваров.Номенклатура.ВидНоменклатуры=Перечисления.ВидыНоменклатуры.Услуга Тогда
				МассивУслуг.Добавить(СтрокаТоваров);
			КонецЕсли; 
		КонецЦикла;
		Для каждого СтрокаТоваров Из МассивУслуг Цикл
			Товары.Удалить(СтрокаТоваров);
		КонецЦикла; 
	Иначе
		СтратегияСписанияПартийТоваровПоДатам=Константы.СтратегияСписанияПартийТоваровПоДатам.Получить();
		Если СтратегияСписанияПартийТоваровПоДатам=Перечисления.СтратегияСписанияПартийТоваровПоДатам.Средняя Тогда
			Товары.Очистить();
			ТоварыОснование = ДокументОснование.Товары;
			Партия = Константы.ПартияТоваровОтрицательныхОстатков.Получить();
			Для Каждого ТекСтрока Из ТоварыОснование Цикл
				НоваяСтрока=Товары.Добавить();
				НоваяСтрока.Номенклатура=ТекСтрока.Номенклатура;
				НоваяСтрока.ХарактеристикаНоменклатуры=ТекСтрока.ХарактеристикаНоменклатуры;
				НоваяСтрока.Партия=Партия;
				ОбработкаРеквизита("Товары.Номенклатура",НоваяСтрока);
				НоваяСтрока.Количество = ТекСтрока.Количество;
				ОбработкаРеквизита("Товары.Количество",НоваяСтрока);
			КонецЦикла;
		Иначе
			Партия = ДокументОснование;	
			Товары.Очистить();
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	ПартииТоваровКомпанииОстатки.Номенклатура,
			|	ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры
			|ИЗ
			|	РегистрНакопления.ПартииТоваровКомпании.Остатки(
			|		,
			|		Партия = &Партия
			|			И СкладКомпании = &СкладКомпании) КАК ПартииТоваровКомпанииОстатки
			|
			|СГРУППИРОВАТЬ ПО
			|	ПартииТоваровКомпанииОстатки.Номенклатура,
			|	ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры";
			Запрос.УстановитьПараметр("Партия",Партия);
			Запрос.УстановитьПараметр("СкладКомпании",СкладКомпании);
			Выборка=Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяСтрока=Товары.Добавить();
				НоваяСтрока.Номенклатура=Выборка.Номенклатура;
				НоваяСтрока.ХарактеристикаНоменклатуры=Выборка.ХарактеристикаНоменклатуры;
				НоваяСтрока.Партия=Партия;
				ОбработкаРеквизита("Товары.Номенклатура",НоваяСтрока);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// изменим итоговую сумму документа
	СуммаДокумента=Товары.Итог("СуммаВсего");
	
	Если ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
		// подставим тип цен закупки
		ТипЦен=обПраво("ОсновнойТипЦенЗакупки",Права,,ЭтотОбъект);
	КонецЕсли; 
	
	// проверим склад
	ОбработкаРеквизита("ПроверкаСкладаКомпании",,,"НЕ СООБЩАТЬ");
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриКопировании()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДополнительныеСвойства.Вставить("ДоговорВзаиморасчетовБыл");
	ДополнительныеСвойства.Вставить("СкладКомпанииБыл");
	ДополнительныеСвойства.Вставить("МоментВремениБыл");
	
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда Возврат; КонецЕсли;
	
	Если НЕ Отказ И Проведен И РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		
		БылиДвижения = Ложь;
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		// взаиморасчеты
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ДоговорВзаиморасчетов ИЗ РегистрНакопления.ВзаиморасчетыКомпании ГДЕ Регистратор=&Ссылка";
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			БылиДвижения = Истина;
			ДополнительныеСвойства.Вставить("ДоговорВзаиморасчетовБыл", Результат.Выгрузить().ВыгрузитьКолонку("ДоговорВзаиморасчетов"));
		КонецЕсли;
		
		// партии
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ СкладКомпании ИЗ РегистрНакопления.ПартииТоваровКомпании ГДЕ Регистратор=&Ссылка";
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			БылиДвижения = Истина;
			ДополнительныеСвойства.Вставить("СкладКомпанииБыл", Результат.Выгрузить().ВыгрузитьКолонку("СкладКомпании"));
		КонецЕсли;
		
		// прошлый момент времени
		Если БылиДвижения Тогда
			Запрос.Текст = "ВЫБРАТЬ МоментВремени ИЗ Документ."+Метаданные().Имя+" ГДЕ Ссылка=&Ссылка";
			ДополнительныеСвойства.Вставить("МоментВремениБыл",Запрос.Выполнить().Выгрузить().Получить(0).МоментВремени);
		КонецЕсли;
		
	КонецЕсли;
	
	// +++++ Соколмоторс +++++
	Если ЭтоНовый() И НЕ Отказ Тогда
		НомерДляЖурнала = РегистрыСведений.НумерацияСкладскихДокументов.УстановитьНовыйНомер(ТекущаяДата());
	КонецЕсли;
	// ----- Соколмоторс -----
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриЗаписи()

Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ОбработкаПроведения(Отказ, Режим)
	Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда Возврат; КонецЕсли;
	
	// Получим способ ведения баланса.
	БалансВедетсяПоПодразделениям = (Константы.СпособВеденияБаланса.Получить() = Перечисления.СпособВеденияБаланса.ПоПодразделению);
	
	// Определим необходимость корректирующих проводок, для поддержания баланса по подразделениям.
	ПодразделениеСклад                 = обПолучитьБалансовоеПодразделение(СкладКомпании.Подразделение);
	ПодразделениеДоговорВзаиморасчетов = обПолучитьБалансовоеПодразделение(ДоговорВзаиморасчетов.Подразделение);
	БалансовыеПодразделенияНеРавны     = (ПодразделениеДоговорВзаиморасчетов<>ПодразделениеСклад);
	Если СкладКомпании.Розничный И ПодразделениеКомпании.ПереоценкаРозницаПоРасходу Тогда
		ТаблицаПоТоварам=ПолучитьТаблицуТоваров();
		СписыватьРозницуПоОстаткам=Ложь;
	Иначе
		ТаблицаПоТоварам=Неопределено;
		СписыватьРозницуПоОстаткам=Истина;
	КонецЕсли;
	// проведем остатки товаров
	НаборЗаписейОстатки=Движения.ОстаткиТоваровКомпании;
	НаборЗаписейОстатки.РежимПроведения=Режим;
	НаборЗаписейОстатки.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейОстатки.РезультатЗапросаПоТоварам=ТаблицаПоТоварам;
	НаборЗаписейОстатки.СкладКомпании=СкладКомпании;
	НаборЗаписейОстатки.Приходовать=Истина;
	НаборЗаписейОстатки.СписыватьРозницуПоОстаткам=СписыватьРозницуПоОстаткам;
	НаборЗаписейОстатки.ДвиженияПоРознице=СкладКомпании.Розничный;
	НаборЗаписейОстатки.Контрагент=Контрагент;
	НаборЗаписейОстатки.ИмяРеквизитаЦенаРозничная="Цена";
	НаборЗаписейОстатки.ИмяРеквизитаСуммаРозничная="Сумма";
	Отказ=НЕ НаборЗаписейОстатки.Расход() ИЛИ Отказ;
	Если Отказ Тогда
		// выведем сообщения об ошибках и предупреждениях
		дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
		Возврат; // дальше смысла не имеет
	КонецЕсли;
	
	// проведем взаиморасчеты
	Если ХозОперация<>Справочники.ХозОперации.ВозвратТоваровПоставщикуКомиссия Тогда
		НаборЗаписейВзаиморасчеты=Движения.ВзаиморасчетыКомпании;
		НаборЗаписейВзаиморасчеты.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейВзаиморасчеты.РежимПроведения=Режим;
		НаборЗаписейВзаиморасчеты.Контрагент=Контрагент;
		НаборЗаписейВзаиморасчеты.ДоговорВзаиморасчетов=ДоговорВзаиморасчетов;
		Если НЕ обЗначениеНеЗаполнено(ДокументОснование) Тогда
			НаборЗаписейВзаиморасчеты.Сделка=ДокументОснование;
			НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем=Ложь;
		Иначе
			НаборЗаписейВзаиморасчеты.Сделка=Неопределено;
		КонецЕсли;
		НаборЗаписейВзаиморасчеты.Сумма=СуммаДокумента;
		НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц=0;
		Отказ=НЕ НаборЗаписейВзаиморасчеты.Приход() ИЛИ Отказ;
		
		// Доходы и расходы по суммовым разницам.
		СуммаДоходаРасходаСуммовыхРазниц=НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц;
		Если СуммаДоходаРасходаСуммовыхРазниц<>0 Тогда
			НаборЗаписейДиР = Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
			Если БалансВедетсяПоПодразделениям Тогда
				НаборЗаписейДиР.Подразделение = ДоговорВзаиморасчетов.Подразделение;
			КонецЕсли;
			НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СуммовыеРазницы;
			НаборЗаписейДиР.ВУпрВалюте = Истина;
			Если СуммаДоходаРасходаСуммовыхРазниц<0 Тогда
				НаборЗаписейДиР.Расход = -СуммаДоходаРасходаСуммовыхРазниц;
			Иначе
				НаборЗаписейДиР.Доход = СуммаДоходаРасходаСуммовыхРазниц;
			КонецЕсли;
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		КонецЕсли;
	КонецЕсли;
	
	// Проведем партии товаров.
	Отказ=НЕ ПровестиПоПартиям(Режим,Ссылка) ИЛИ Отказ;
	
	// способ ведения не по подразделениям или балансовые подразделения равны то ничего не будем корректировать
	Если БалансВедетсяПоПодразделениям и БалансовыеПодразделенияНеРавны Тогда	
		СуммаВзаиморасчетов = Движения.ВзаиморасчетыКомпании.Итог("СуммаУпр");
		СуммаПартий = -Движения.ПартииТоваровКомпании.Итог("СуммаУпр");
		Если СуммаПартий<>0 Тогда
			НаборЗаписейДиР = Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
			НаборЗаписейДиР.Подразделение = СкладКомпании.Подразделение;
			НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
			НаборЗаписейДиР.ВУпрВалюте = Истина;
			НаборЗаписейДиР.Доход = СуммаПартий;
			Отказ = НЕ НаборЗаписейДиР.Расход() ИЛИ Отказ;	
		КонецЕсли;
		
		Если ХозОперация<>Справочники.ХозОперации.ВозвратТоваровПоставщикуКомиссия Тогда
			НаборЗаписейДиР = Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
			НаборЗаписейДиР.Подразделение = ДоговорВзаиморасчетов.Подразделение;
			НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
			НаборЗаписейДиР.ВУпрВалюте = Ложь;
			НаборЗаписейДиР.Доход = СуммаДокумента;
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;	
		КонецЕсли;
	КонецЕсли;	
	
	// Возможно расхождение баланса на "копейки" из-за округления. Возникшую разницу
	// необходимо списать на доходы и расходы.
	Отказ = НЕ дкСписаниеКопейкиПриОкругленииВалютныхСчетов(ЭтотОбъект) ИЛИ Отказ;
	
	
	// если модифицировали документ, то запишем его
	Если НЕ Отказ И Модифицированность() Тогда
		Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;     	
	
	// двигаем границу последовательности взаиморасчетов
	ДвигаемГраницу = (Режим<>РежимПроведенияДокумента.Оперативный И Движения.ВзаиморасчетыКомпании.Количество()>0);
	Если ДвигаемГраницу ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.ДоговорВзаиморасчетовБыл) Тогда
		НаборЗаписейГраницыВзаиморасчетов = РегистрыСведений.ГраницыВзаиморасчетов.СоздатьНаборЗаписей();
		Если ДвигаемГраницу Тогда
			ТаблицаДоговоров = Движения.ВзаиморасчетыКомпании.Выгрузить();
			ТаблицаДоговоров.Свернуть("ДоговорВзаиморасчетов","");
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетов = ТаблицаДоговоров.ВыгрузитьКолонку("ДоговорВзаиморасчетов");
			НаборЗаписейГраницыВзаиморасчетов.МоментВремени = Дата;
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетовБыл = ДополнительныеСвойства.ДоговорВзаиморасчетовБыл;
			НаборЗаписейГраницыВзаиморасчетов.МоментВремениБыл = ДополнительныеСвойства.МоментВремениБыл;
		Иначе
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетов = ДополнительныеСвойства.ДоговорВзаиморасчетовБыл;
			НаборЗаписейГраницыВзаиморасчетов.МоментВремени = ДополнительныеСвойства.МоментВремениБыл;
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетовБыл = Неопределено;
			НаборЗаписейГраницыВзаиморасчетов.МоментВремениБыл = Неопределено;
		КонецЕсли;
		НаборЗаписейГраницыВзаиморасчетов.ДокументСсылка = Ссылка;
		НаборЗаписейГраницыВзаиморасчетов.ИзменитьГраницу();
	КонецЕсли;
	
	// выведем сообщения об ошибках и предупреждениях
	дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
КонецПроцедуры // ОбработкаПроведения()

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли