&НаКлиенте
Перем МассивВыбранныхСсылок Экспорт;
&НаКлиенте
Перем ПерваяАктивизация;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МассивВыбранныхСсылок = Новый Массив;
	ПерваяАктивизация = Истина;
	Список.Параметры.УстановитьЗначениеПараметра("МассивВыбранныхСсылок",МассивВыбранныхСсылок);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеОтметки(Команда)
    МассивВыбранныхСсылок.Очистить();    
    Список.Параметры.УстановитьЗначениеПараметра("МассивВыбранныхСсылок",МассивВыбранныхСсылок);
КонецПроцедуры


&НаКлиенте
Процедура ОтметитьВсе(Команда)
    МассивВыбранныхСсылок = ОтметитьВсеНаСервере(МассивВыбранныхСсылок);    
    Список.Параметры.УстановитьЗначениеПараметра("МассивВыбранныхСсылок",МассивВыбранныхСсылок);    
КонецПроцедуры

&НаСервере
Функция ОтметитьВсеНаСервере(МассивВыбранныхСсылок)
    //продублируем получение данных в динамический список
    ТекстЗапроса = ПолучитьТекстЗапросаСписка();
    СхемаКомпоновки = Новый СхемаКомпоновкиДанных();
    
    Источник = СхемаКомпоновки.ИсточникиДанных.Добавить();
    Источник.Имя = "Исток";
    Источник.СтрокаСоединения="";
    Источник.ТипИсточникаДанных = "local";
    
    НаборДанных = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));    
    НаборДанных.Запрос = ТекстЗапроса;        
    НаборДанных.Имя = "Запрос";
    НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
    НаборДанных.ИсточникДанных = "Исток";
    
    НастройкиКомпоновки = СкомпоноватьНастройки(СхемаКомпоновки);
    
    СкопироватьЭлементы(НастройкиКомпоновки.Отбор, Список.Отбор);
    СкопироватьЭлементы(НастройкиКомпоновки.Порядок, Список.Порядок);
    ЗаполнитьЭлементы(НастройкиКомпоновки.ПараметрыДанных, Список.Параметры);
    
    
    МакетКомпоновки = ПолучитьМакетКомпоновки(СхемаКомпоновки, НастройкиКомпоновки);
    
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
    
    ТЗ = Новый ТаблицаЗначений;
    
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    ПроцессорВывода.УстановитьОбъект(ТЗ);
    ПроцессорВывода.НачатьВывод();
    
    Пока Истина Цикл        
        ЭлементРезультатаКомпоновкиДанных = ПроцессорКомпоновкиДанных.Следующий();        
        Если ЭлементРезультатаКомпоновкиДанных = Неопределено Тогда 
            Прервать;
        КонецЕсли;        
        ПроцессорВывода.ВывестиЭлемент(ЭлементРезультатаКомпоновкиДанных);        
    КонецЦикла;
    
    ПроцессорВывода.ЗакончитьВывод();
    //теперь по полученной копии списка пометим все
    Для каждого стр из ТЗ Цикл
        ДокСсылка = стр.Ссылка;
        ИндексСтрокиМассива=МассивВыбранныхСсылок.Найти(ДокСсылка);
        Если ИндексСтрокиМассива=Неопределено Тогда
            МассивВыбранныхСсылок.Добавить(ДокСсылка);       
        КонецЕсли;        
    КонецЦикла;
    Возврат МассивВыбранныхСсылок;    
КонецФункции

&НаСервере
Функция ПолучитьТекстЗапросаСписка()
    Возврат Список.ТекстЗапроса;
КонецФункции

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДокСсылка = Элемент.ТекущиеДанные.Ссылка;
	ИндексСтрокиМассива=МассивВыбранныхСсылок.Найти(ДокСсылка);
	Если ИндексСтрокиМассива=Неопределено Тогда
		Если НЕ ПерваяАктивизация Тогда
			МассивВыбранныхСсылок.Добавить(ДокСсылка);       
		КонецЕсли;
	Иначе    
		МассивВыбранныхСсылок.Удалить(ИндексСтрокиМассива);
	КонецЕсли;
	ПерваяАктивизация = Ложь;
	Список.Параметры.УстановитьЗначениеПараметра("МассивВыбранныхСсылок",МассивВыбранныхСсылок);

КонецПроцедуры

// Копирует элементы из одной коллекции в другую
//
// Параметры:
//	ПриемникЗначения	- КоллекцияЗначенийПараметровКомпоновкиДанных, ЗначенияПараметровДанныхКомпоновкиДанных - коллекция элементов КД, куда копируются параметры
//	ИсточникЗначения	- КоллекцияЗначенийПараметровКомпоновкиДанных, ЗначенияПараметровДанныхКомпоновкиДанных - коллекция элементов КД, откуда копируются параметры
//	ОчищатьПриемник		- Булево - признак необходимости очистки приемника
//
&НаСервере
Процедура СкопироватьЭлементы(ПриемникЗначения, ИсточникЗначения, ОчищатьПриемник = Истина) Экспорт
	
	Если ТипЗнч(ИсточникЗначения) = Тип("УсловноеОформлениеКомпоновкиДанных")
		ИЛИ ТипЗнч(ИсточникЗначения) = Тип("ВариантыПользовательскогоПоляВыборКомпоновкиДанных")
		ИЛИ ТипЗнч(ИсточникЗначения) = Тип("ОформляемыеПоляКомпоновкиДанных")
		ИЛИ ТипЗнч(ИсточникЗначения) = Тип("ЗначенияПараметровДанныхКомпоновкиДанных") Тогда
		СоздаватьПоТипу = Ложь;
	Иначе
		СоздаватьПоТипу = Истина;
	КонецЕсли;
	ПриемникЭлементов = ПриемникЗначения.Элементы;
	ИсточникЭлементов = ИсточникЗначения.Элементы;
	Если ОчищатьПриемник Тогда
		ПриемникЭлементов.Очистить();
	КонецЕсли;
	
	Для каждого ЭлементИсточник Из ИсточникЭлементов Цикл
		
		Если ТипЗнч(ЭлементИсточник) = Тип("ЭлементПорядкаКомпоновкиДанных") Тогда
			// Элементы порядка добавляем в начало
			Индекс = ИсточникЭлементов.Индекс(ЭлементИсточник);
			ЭлементПриемник = ПриемникЭлементов.Вставить(Индекс, ТипЗнч(ЭлементИсточник));
		Иначе
			Если СоздаватьПоТипу Тогда
				ЭлементПриемник = ПриемникЭлементов.Добавить(ТипЗнч(ЭлементИсточник));
			Иначе
				ЭлементПриемник = ПриемникЭлементов.Добавить();
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭлементПриемник, ЭлементИсточник);
		// В некоторых коллекциях необходимо заполнить другие коллекции
		Если ТипЗнч(ИсточникЭлементов) = Тип("КоллекцияЭлементовУсловногоОформленияКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник.Поля, ЭлементИсточник.Поля);
			СкопироватьЭлементы(ЭлементПриемник.Отбор, ЭлементИсточник.Отбор);
			ЗаполнитьЭлементы(ЭлементПриемник.Оформление, ЭлементИсточник.Оформление); 
		ИначеЕсли ТипЗнч(ИсточникЭлементов)	= Тип("КоллекцияВариантовПользовательскогоПоляВыборКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник.Отбор, ЭлементИсточник.Отбор);
		КонецЕсли;
		
		// В некоторых элементах коллекции необходимо заполнить другие коллекции
		Если ТипЗнч(ЭлементИсточник) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник, ЭлементИсточник);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник, ЭлементИсточник);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ПользовательскоеПолеВыборКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник.Варианты, ЭлементИсточник.Варианты);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ПользовательскоеПолеВыражениеКомпоновкиДанных") Тогда
			ЭлементПриемник.УстановитьВыражениеДетальныхЗаписей (ЭлементИсточник.ПолучитьВыражениеДетальныхЗаписей());
			ЭлементПриемник.УстановитьВыражениеИтоговыхЗаписей(ЭлементИсточник.ПолучитьВыражениеИтоговыхЗаписей());
			ЭлементПриемник.УстановитьПредставлениеВыраженияДетальныхЗаписей(ЭлементИсточник.ПолучитьПредставлениеВыраженияДетальныхЗаписей ());
			ЭлементПриемник.УстановитьПредставлениеВыраженияИтоговыхЗаписей(ЭлементИсточник.ПолучитьПредставлениеВыраженияИтоговыхЗаписей ());
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
Процедура ЗаполнитьЭлементы(ПриемникЗначения, ИсточникЗначения, ПервыйУровень = Неопределено) Экспорт
	
	Если ТипЗнч(ПриемникЗначения) = Тип("КоллекцияЗначенийПараметровКомпоновкиДанных") Тогда
		КоллекцияЗначений = ИсточникЗначения;
	Иначе
		КоллекцияЗначений = ИсточникЗначения.Элементы;
	КонецЕсли;
	
	Для каждого ЭлементИсточник Из КоллекцияЗначений Цикл
		Если ПервыйУровень = Неопределено Тогда
			ЭлементПриемник = ПриемникЗначения.НайтиЗначениеПараметра(ЭлементИсточник.Параметр);
		Иначе
			ЭлементПриемник = ПервыйУровень.НайтиЗначениеПараметра(ЭлементИсточник.Параметр);
		КонецЕсли;
		Если ЭлементПриемник = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ЭлементПриемник, ЭлементИсточник);
		Если ТипЗнч(ЭлементИсточник) = Тип("ЗначениеПараметраКомпоновкиДанных") Тогда
			Если ЭлементИсточник.ЗначенияВложенныхПараметров.Количество() <> 0 Тогда
				ЗаполнитьЭлементы(ЭлементПриемник.ЗначенияВложенныхПараметров, ЭлементИсточник.ЗначенияВложенныхПараметров, ПриемникЗначения);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьМакетКомпоновки(СхемаКомпоновки, Настройки) Экспорт

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	Возврат КомпоновщикМакета.Выполнить(СхемаКомпоновки, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

КонецФункции
Функция СкомпоноватьНастройки(СхемаКомпоновки) Экспорт

	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки);
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	
	// Добавим выбранные поля
	Для Каждого Элемент Из КомпоновщикНастроек.Настройки.Выбор.ДоступныеПоляВыбора.Элементы Цикл
		
		Если НЕ Элемент.Папка Тогда
			ВыбранноеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВыбранноеПоле.Использование = Истина;
			ВыбранноеПоле.Поле = Элемент.Поле;
		КонецЕсли;
		
	КонецЦикла;
	
	// Добавим группировку
	ГруппировкаНастроек = КомпоновщикНастроек.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Поле = ГруппировкаНастроек.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	
	Возврат КомпоновщикНастроек.Настройки;

КонецФункции


&НаСервере
Процедура РеестрДоговоровУтилизацииНаСервере()

КонецПроцедуры


&НаКлиенте
Процедура РеестрДоговоровУтилизации(Команда)
	ТабДок = СформироватьПечатнуюФормуРеестрДоговоровУтилизации(МассивВыбранныхСсылок);
	ТабДок.Показать("Реестр договоров утилизации");
КонецПроцедуры

&НаСервере
Функция СформироватьПечатнуюФормуРеестрДоговоровУтилизации(МассивОбъектов)
	
	ТабДокумент = Новый ТабличныйДокумент;	
	ИмяМакета = "ПФ_РеестрДоговоровУтилизации";
	
	Макет = Документы.Renault_Договор.ПолучитьМакет("ПФ_РеестрДоговоровУтилизации");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.Организация = ПараметрыСеанса.Организация;
	ОбластьЗаголовок.Параметры.ИНН = ПараметрыСеанса.Организация.ИНН;
	ОбластьЗаголовок.Параметры.ТекущаяДата = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
	ТабДокумент.Вывести(ОбластьЗаголовок);
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДокумент.Вывести(Шапка);
	НомерПП = 0;
	Строки = Макет.ПолучитьОбласть("Строки");
	Для Каждого Док Из МассивОбъектов Цикл
		НомерПП = НомерПП + 1;
		Строки.Параметры.НомерПП = НомерПП;
		Строки.Параметры.Заполнить(Док);
		ТабДокумент.Вывести(Строки);
	КонецЦикла;

	Возврат ТабДокумент;
	
КонецФункции


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Договор",ВыбраннаяСтрока.Ссылка);
	ОткрытьФорму("Документ.Renault_Договор.Форма.ФормаВводаДанныхПоУтилизации",ПараметрыОткрытия,ЭтаФорма,УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

