                        //Процедура создает документ "Извлечение товаров из производства"
Функция СоздатьИзвлечениеИзПроизводства(Параметры,ЦехЗаказНаряда, ДатаЗаказНаряда)
	ИзвлечениеОбъект = Документы.ИзвлечениеТоваровИзПроизводства.СоздатьДокумент();
	ИзвлечениеОбъект.РегламентированныйУчет = Истина;
	ИзвлечениеОбъект.Дата = ДатаЗаказНаряда;
	ИзвлечениеОбъект.УстановитьНовыйНомер();
	
	ИзвлечениеОбъект.ХозОперация = Справочники.ХозОперации.ИзвлечениеТоваровИзПроизводства;
	ИзвлечениеОбъект.Цех = ЦехЗаказНаряда;
	
	ИзвлечениеОбъект.Организация = Параметры.ОрганизацияПоставщик;
	ИзвлечениеОбъект.ОбработкаРеквизита("Организация");
	
	ИзвлечениеОбъект.ПодразделениеКомпании = Параметры.ПодразделениеПоставщик;
	ИзвлечениеОбъект.ОбработкаРеквизита("ПодразделениеКомпании");
	
	ИзвлечениеОбъект.СкладКомпании = Параметры.СкладПолучатель;
	ИзвлечениеОбъект.ОбработкаРеквизита("СкладКомпании");
	
	ИзвлечениеОбъект.ТипЦен = Параметры.ТипЦен;
	ИзвлечениеОбъект.ОбработкаРеквизита("ТипЦен");
	
	ИзвлечениеОбъект.ВалютаДокумента = Параметры.Валюта;
	ИзвлечениеОбъект.ОбработкаРеквизита("ВалютаДокумента");	
	
	ИзвлечениеОбъект.Автор = ПараметрыСеанса.Пользователь;
	ИзвлечениеОбъект.Комментарий = "Создан автоматически для перепродажи зап. частей между организациями";
	
	Возврат ИзвлечениеОбъект;	
КонецФункции

//Процедура создает документ "Снятие резервов покупателя"
Процедура СоздатьДокументСнятияРезерва(ТаблицаЗаказов,Отказ,ЛогРаботы,Параметры)
	
	МассивЗаказов = ТаблицаЗаказов.ВыгрузитьКолонку("Заказ");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказыПокупателейОстатки.Контрагент КАК Контрагент,
	|	ЗаказыПокупателейОстатки.Заказ КАК ЗаказПокупателя,
	|	ЗаказыПокупателейОстатки.Номенклатура,
	|	ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры,
	|	ЗаказыПокупателейОстатки.СкладКомпании КАК МестоРазмещения,
	|	СУММА(ЗаказыПокупателейОстатки.РезервОстаток) КАК Количество,
	|	ЗаказыПокупателейОстатки.Заказ.ДокументОснование КАК ДокументОснование,
	|	ЕСТЬNULL(ЕдиницыИзмерения.Ссылка, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
	|	МАКСИМУМ(ЕСТЬNULL(ЕдиницыИзмерения.Коэффициент, 1)) КАК Коэффициент
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(
	|			&Дата,
	|			Заказ.ДокументОснование В (&МассивЗаказов)
	|				И СкладКомпании = &Склад) КАК ЗаказыПокупателейОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ЗаказыПокупателейОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|ГДЕ
	|	ЗаказыПокупателейОстатки.РезервОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПокупателейОстатки.Контрагент,
	|	ЗаказыПокупателейОстатки.Номенклатура,
	|	ЗаказыПокупателейОстатки.Заказ,
	|	ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры,
	|	ЗаказыПокупателейОстатки.СкладКомпании,
	|	ЗаказыПокупателейОстатки.Заказ.ДокументОснование,
	|	ЗаказыПокупателейОстатки.Заказ.Дата,
	|	ЕСТЬNULL(ЕдиницыИзмерения.Ссылка, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка))
	|ИТОГИ ПО
	|	ДокументОснование,
	|	Контрагент";
	
	Запрос.УстановитьПараметр("Дата",КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	Запрос.УстановитьПараметр("Склад",Параметры.СкладОтправитель);
	
	ВыборкаЗаказНарядов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТаблицаЗаказов.Индексы.Добавить("Заказ");
	
	Пока ВыборкаЗаказНарядов.Следующий() Цикл
		ВыборкаКонтрагентов = ВыборкаЗаказНарядов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаКонтрагентов.Следующий() Цикл
			
			Выборка = ВыборкаКонтрагентов.Выбрать();
			
			СнятиеРезервов = Документы.СнятиеРезервовЗаказовПокупателя.СоздатьДокумент();
			
			СтрокаТаблицы = ТаблицаЗаказов.Найти(ВыборкаЗаказНарядов.ДокументОснование,"Заказ");
			
			СнятиеРезервов.Дата = СтрокаТаблицы.Дата - 4;
			СнятиеРезервов.ДокументОснование = ВыборкаЗаказНарядов.ДокументОснование;
			СнятиеРезервов.Организация = Параметры.ОрганизацияПоставщик;
			СнятиеРезервов.ПодразделениеКомпании= Параметры.ПодразделениеПоставщик;
			СнятиеРезервов.Автор = ПараметрыСеанса.Пользователь;
			СнятиеРезервов.КорректировкаЗаказа = Истина;
			ЗаполнитьЗначенияСвойств(СнятиеРезервов,ВыборкаЗаказНарядов.ДокументОснование,"КурсДокумента,ВалютаДокумента");
			
			Если ЗначениеЗаполнено(ВыборкаКонтрагентов.Контрагент) Тогда
				СнятиеРезервов.ХозОперация = Справочники.ХозОперации.СнятиеРезерваПокупателя;
				СнятиеРезервов.Контрагент = ВыборкаКонтрагентов.Контрагент;
			Иначе
				СнятиеРезервов.ХозОперация = Справочники.ХозОперации.СнятиеРезерваВнутреннего;
			КонецЕсли;
			СнятиеРезервов.Комментарий = "Создан автоматически при межскладском перемещении";
			
			Пока Выборка.Следующий() Цикл
				СтрокаДокумента = СнятиеРезервов.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДокумента,Выборка);
			КонецЦикла;
			
			ЗаписатьДокумент(СнятиеРезервов,ЛогРаботы,РежимЗаписиДокумента.Запись,Отказ);
			ЗаписатьДокумент(СнятиеРезервов,ЛогРаботы,РежимЗаписиДокумента.Проведение,Отказ);
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

//Функция создает документ "Реализация товаров" с указанной датой 
//и заполняет реквизиты по переданным параметрам
//Возвращает ДокументОбъект
Функция СоздатьРеализацию(Параметры, ДатаЗаказНаряда)
	
	РеализацияОбъект = Документы.РеализацияТоваров.СоздатьДокумент();
	РеализацияОбъект.РегламентированныйУчет = Истина;
	РеализацияОбъект.Дата = ДатаЗаказНаряда;
	РеализацияОбъект.УстановитьНовыйНомер();
	РеализацияОбъект.ХозОперация = Справочники.ХозОперации.РеализацияТоваров;
	
	РеализацияОбъект.Организация = Параметры.ОрганизацияПоставщик;
	РеализацияОбъект.ОбработкаРеквизита("Организация");
	
	РеализацияОбъект.ПодразделениеКомпании = Параметры.ПодразделениеПоставщик;
	РеализацияОбъект.ОбработкаРеквизита("ПодразделениеКомпании");
	
	РеализацияОбъект.СкладКомпании = Параметры.СкладОтправитель;
	ДопПараметры = Новый Структура("НеРассчитыватьСкидки,ВозможностьИзмененияЦен",Истина,Ложь);
	РеализацияОбъект.ОбработкаРеквизита("СкладКомпании",,,ДопПараметры);
	
	РеализацияОбъект.ТипЦен = Параметры.ТипЦен;
	РеализацияОбъект.ОбработкаРеквизита("ТипЦен");
	
	РеализацияОбъект.ВалютаДокумента = Параметры.Валюта;
	РеализацияОбъект.ОбработкаРеквизита("ВалютаДокумента");
	
	РеализацияОбъект.Контрагент = Параметры.КонтрагентПокупатель;
	РеализацияОбъект.ОбработкаРеквизита("Контрагент");
	
	РеализацияОбъект.ДоговорВзаиморасчетов = Параметры.ДоговорПоставщикПокупатель;
	РеализацияОбъект.ОбработкаРеквизита("ДоговорВзаиморасчетов");	
	
	РеализацияОбъект.Автор = ПараметрыСеанса.Пользователь;
	РеализацияОбъект.Комментарий = "Создан автоматически для перепродажи зап. частей между организациями";
	
	Возврат РеализацияОбъект;
	
КонецФункции

//Функция создает документ "Поступление товаров" с указанной датой 
//и заполняет реквизиты по переданным параметрам
//Возвращает ДокументОбъект
Функция СоздатьПоступление(Параметры, ДатаЗаказНаряда)
	
	ПоступлениеОбъект = Документы.ПоступлениеТоваров.СоздатьДокумент();
	ПоступлениеОбъект.РегламентированныйУчет = Истина;
	ПоступлениеОбъект.Дата = ДатаЗаказНаряда;
	ПоступлениеОбъект.УстановитьНовыйНомер();
	ПоступлениеОбъект.ХозОперация = Справочники.ХозОперации.ПоступлениеТоваров;
	
	ПоступлениеОбъект.Организация = Параметры.ОрганизацияПокупатель;
	ПоступлениеОбъект.ОбработкаРеквизита("Организация");
	
	ПоступлениеОбъект.ПодразделениеКомпании = Параметры.ПодразделениеПокупатель;
	ПоступлениеОбъект.ОбработкаРеквизита("ПодразделениеКомпании");
	
	ПоступлениеОбъект.СкладКомпании = Параметры.СкладПолучатель;
	ПоступлениеОбъект.ОбработкаРеквизита("СкладКомпании");
	
	ПоступлениеОбъект.ТипЦен = Параметры.ТипЦен;
	ПоступлениеОбъект.ОбработкаРеквизита("ТипЦен");
	
	ПоступлениеОбъект.ВалютаДокумента = Параметры.Валюта;
	ПоступлениеОбъект.ОбработкаРеквизита("ВалютаДокумента");
	
	ПоступлениеОбъект.Контрагент = Параметры.КонтрагентПоставщик;
	ПоступлениеОбъект.ОбработкаРеквизита("Контрагент");
	
	ПоступлениеОбъект.ДоговорВзаиморасчетов = Параметры.ДоговорПокупательПоставщик;
	ПоступлениеОбъект.ОбработкаРеквизита("ДоговорВзаиморасчетов");	
	
	//ПоступлениеОбъект.НеКонтролироватьЗаказПоставщику = Истина;
	//ПоступлениеОбъект.КонтролироватьЯчейкиХранения = Ложь;
	ПоступлениеОбъект.Автор = ПараметрыСеанса.Пользователь;
	ПоступлениеОбъект.Комментарий = "Создан автоматически для перепродажи зап. частей между организациями";
	
	Возврат ПоступлениеОбъект;
	
КонецФункции

//Функция создает документ "Заказ покупателя" с указанной датой 
//и заполняет реквизиты по переданным параметрам
//Возвращает ДокументОбъект

Функция СоздатьРезервирование(Параметры,ЗаказНаряд,ДатаЗаказНаряда)
	
	РезервированиеОбъект = Документы.ЗаказПокупателя.СоздатьДокумент();
	
	РезервированиеОбъект.Дата = ДатаЗаказНаряда;
	РезервированиеОбъект.Заполнить(ЗаказНаряд);
	
	РезервированиеОбъект.ХозОперация = Справочники.ХозОперации.ЗаказРезервированиеПокупателя;
	РезервированиеОбъект.Комментарий = "Создан автоматически для перепродажи зап. частей между организациями";
	
КонецФункции

//Функция создает документ "Перемещение товаров в производство" с указанной датой 
//и заполняет реквизиты по переданным параметрам и цеху
//Возвращает ДокументОбъект
Функция СоздатьПеремещениеВПроизводство(Параметры, ЦехЗаказНаряда, ДатаЗаказНаряда)
	
	ПеремещениеОбъект = Документы.ПеремещениеТоваровВПроизводство.СоздатьДокумент();
	ПеремещениеОбъект.РегламентированныйУчет = Истина;
	ПеремещениеОбъект.Дата = ДатаЗаказНаряда;
	ПеремещениеОбъект.УстановитьНовыйНомер();
	
	ПеремещениеОбъект.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровВПроизводство;
	ПеремещениеОбъект.Цех = ЦехЗаказНаряда;
	
	ПеремещениеОбъект.Организация = Параметры.ОрганизацияПокупатель;
	ПеремещениеОбъект.ОбработкаРеквизита("Организация");
	
	ПеремещениеОбъект.ПодразделениеКомпании = Параметры.ПодразделениеПокупатель;
	ПеремещениеОбъект.ОбработкаРеквизита("ПодразделениеКомпании");
	
	ПеремещениеОбъект.СкладКомпании = Параметры.СкладПолучатель;
	ПеремещениеОбъект.ОбработкаРеквизита("СкладКомпании");
	
	ПеремещениеОбъект.ТипЦен = Параметры.ТипЦен;
	ПеремещениеОбъект.ОбработкаРеквизита("ТипЦен");
	
	ПеремещениеОбъект.ВалютаДокумента = Параметры.Валюта;
	ПеремещениеОбъект.ОбработкаРеквизита("ВалютаДокумента");
	
	ПеремещениеОбъект.Автор = ПараметрыСеанса.Пользователь;
	ПеремещениеОбъект.Комментарий = "Создан автоматически для перепродажи зап. частей между организациями";
	
	Возврат ПеремещениеОбъект;
	
КонецФункции

//Функция добавляет в реализацию строку и вызывает все необходимые обработчики
//данные берутся из выборки, если указываем партию, то заполняется реквизит "Партия"
//возвращает заполненную строку
Функция ДобавитьСтрокуРеализации(РеализацияОбъект,Выборка)
	
	СтрокаРеализации = РеализацияОбъект.Товары.Добавить();
	
	ЗаполнитьЗначенияСвойств(СтрокаРеализации,Выборка);
	
	ДопПараметры = Новый Структура;
	
	ДопПараметры.Вставить("НеКонтролироватьЗамены",Истина);
	
	РеализацияОбъект.ОбработкаРеквизита("Товары.Номенклатура", СтрокаРеализации,, ДопПараметры);
	РеализацияОбъект.ОбработкаРеквизита("Товары.ХарактеристикаНоменклатуры", СтрокаРеализации,, ДопПараметры);
	РеализацияОбъект.ОбработкаРеквизита("Товары.ЕдиницаИзмерения", СтрокаРеализации,, ДопПараметры);
	РеализацияОбъект.ОбработкаРеквизита("Товары.Количество", СтрокаРеализации,, ДопПараметры);
	РеализацияОбъект.ОбработкаРеквизита("Товары.Коэффициент", СтрокаРеализации,, ДопПараметры);
	
	Возврат СтрокаРеализации;
	
КонецФункции

//Процедура добавляет в поступление строку
//данные берутся из выборки
Процедура ДобавитьСтрокуПоступления(ПоступлениеОбъект,Выборка)
	
	СтрокаПоступления = ПоступлениеОбъект.Товары.Добавить();
	
	ЗаполнитьЗначенияСвойств(СтрокаПоступления,Выборка);
	
	//	ПоступлениеОбъект.ОбработкаРеквизита("Товары.Номенклатура", СтрокаПоступления,, Неопределено);
	
КонецПроцедуры

Процедура ДобавитьСтрокуИзвлечение(ИзвлечениеОбъект,СтрокаРеализации)
	СтрокаИзвлечения = ИзвлечениеОбъект.Товары.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаИзвлечения,СтрокаРеализации);
КонецПроцедуры

//Процедура добавляет в перемещение в производство строку и вызывает все необходимые обработчики
//данные берутся из выборки, если указываем партию, рекзивит "Партия" заполняется по указанной ссылке
Процедура ДобавитьСтрокуПеремещение(ПеремещениеОбъект,Выборка,СсылкаНаПартию)
	
	СтрокаПеремещения = ПеремещениеОбъект.Товары.Добавить();
	
	ЗаполнитьЗначенияСвойств(СтрокаПеремещения,Выборка);
	
	СтрокаПеремещения.Партия = СсылкаНаПартию;
	
	ДопПараметры = Новый Структура;
	
	ПеремещениеОбъект.ОбработкаРеквизита("Товары.Номенклатура", СтрокаПеремещения,, ДопПараметры);
	ПеремещениеОбъект.ОбработкаРеквизита("Товары.ХарактеристикаНоменклатуры", СтрокаПеремещения,, ДопПараметры);
	ПеремещениеОбъект.ОбработкаРеквизита("Товары.ЕдиницаИзмерения", СтрокаПеремещения,, ДопПараметры);
	ПеремещениеОбъект.ОбработкаРеквизита("Товары.Количество", СтрокаПеремещения,, ДопПараметры);
	ПеремещениеОбъект.ОбработкаРеквизита("Товары.Коэффициент", СтрокаПеремещения,, ДопПараметры);	
	
КонецПроцедуры

Функция ПолучитьПараметры() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НастройкаМежскладскихПеремещений.ДоговорПоставщикПокупатель,
	|	НастройкаМежскладскихПеремещений.ДоговорПокупательПоставщик,
	|	НастройкаМежскладскихПеремещений.ПутьКФайлуЛогаРаботы + &ИмяФайла КАК ПутьКФайлуЛогаРаботы,
	|	НастройкаМежскладскихПеремещений.ТипЦен,
	|	НастройкаМежскладскихПеремещений.СкладОтправитель КАК СкладОтправитель,
	|	НастройкаМежскладскихПеремещений.СкладПолучатель,
	|	НастройкаМежскладскихПеремещений.ДоговорПоставщикПокупатель.Владелец КАК КонтрагентПокупатель,
	|	НастройкаМежскладскихПеремещений.ДоговорПокупательПоставщик.Владелец КАК КонтрагентПоставщик,
	|	НастройкаМежскладскихПеремещений.ТипЦен.ВалютаЦены КАК Валюта,
	|	НастройкаМежскладскихПеремещений.СкладПолучатель.Подразделение КАК ПодразделениеПокупатель,
	|	НастройкаМежскладскихПеремещений.ОрганизацияПокупатель КАК ОрганизацияПокупатель,
	|	НастройкаМежскладскихПеремещений.СкладОтправитель.Подразделение КАК ПодразделениеПоставщик,
	|	НастройкаМежскладскихПеремещений.ОрганизацияПоставщик КАК ОрганизацияПоставщик
	|ИЗ
	|	РегистрСведений.НастройкаМежскладскихПеремещений КАК НастройкаМежскладскихПеремещений
	|ГДЕ
	|	НастройкаМежскладскихПеремещений.ОрганизацияПоставщик <> НастройкаМежскладскихПеремещений.ДоговорПокупательПоставщик";
	Запрос.УстановитьПараметр("ИмяФайла","\log_"+Формат(НачалоДня(ТекущаяДата()),"ДЛФ=D") + ".txt");
	Выборка = Запрос.Выполнить().Выбрать();
	
	//Если Выборка.Следующий() Тогда
	
	Возврат Выборка;
	
	//Иначе
	//	
	//	Возврат Неопределено;
	//	
	//КонецЕсли;
	
	
КонецФункции

//функция возвращает результат запроса по перемещенным со склада другой организации материалам.
// Анализируются закрытые сегодня заказ-наряды, 
//получается список подчиненных документов перемещения и извлечения заказ-нарядов с указанным складом
//в запросе формируется таблица для загрузки в табличную часть документа реализации
Функция ПолучитьРезультатЗапросаПоЗаказНарядам(Параметры,Дата = Неопределено)
	
	Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	ЗаказНаряд.Ссылка,
	//			   |	ЗаказНаряд.ДатаОкончания,
	//			   |	ЗаказНаряд.Цех
	//			   |ПОМЕСТИТЬ ЗаказНаряды
	//			   |ИЗ
	//			   |	Документ.ЗаказНаряд КАК ЗаказНаряд
	//			   |ГДЕ
	//			   |	ЗаказНаряд.Организация = &Организация
	//			   |	И НАЧАЛОПЕРИОДА(ЗаказНаряд.ДатаОкончания, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаОбработки, ДЕНЬ)
	//			   |	И ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Перечисление.СостояниеЗаказНаряда.Закрыт)
	//			   |
	//			   |СГРУППИРОВАТЬ ПО
	//			   |	ЗаказНаряд.Ссылка,
	//			   |	ЗаказНаряд.Дата,
	//			   |	ЗаказНаряд.Цех
	//			   |;
	//			   |
	//			   |////////////////////////////////////////////////////////////////////////////////
	//			   |ВЫБРАТЬ
	//			   |	ПеремещениеТоваровВПроизводство.Ссылка,
	//			   |	ПеремещениеТоваровВПроизводство.СкладКомпании КАК Склад
	//			   |ПОМЕСТИТЬ Документы
	//			   |ИЗ
	//			   |	Документ.ПеремещениеТоваровВПроизводство КАК ПеремещениеТоваровВПроизводство
	//			   |ГДЕ
	//			   |	ПеремещениеТоваровВПроизводство.ДокументОснование В
	//			   |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//			   |				ЗаказНаряды.Ссылка
	//			   |			ИЗ
	//			   |				ЗаказНаряды)
	//			   |	И ПеремещениеТоваровВПроизводство.СкладКомпании = &СкладКомпании
	//			   |	И ПеремещениеТоваровВПроизводство.Проведен
	//			   |
	//			   |СГРУППИРОВАТЬ ПО
	//			   |	ПеремещениеТоваровВПроизводство.Ссылка,
	//			   |	ПеремещениеТоваровВПроизводство.СкладКомпании
	//			   |
	//			   |ОБЪЕДИНИТЬ ВСЕ
	//			   |
	//			   |ВЫБРАТЬ
	//			   |	ИзвлечениеТоваровИзПроизводства.Ссылка,
	//			   |	ИзвлечениеТоваровИзПроизводства.СкладКомпании
	//			   |ИЗ
	//			   |	Документ.ИзвлечениеТоваровИзПроизводства КАК ИзвлечениеТоваровИзПроизводства
	//			   |ГДЕ
	//			   |	ИзвлечениеТоваровИзПроизводства.ДокументОснование В
	//			   |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//			   |				ЗаказНаряды.Ссылка
	//			   |			ИЗ
	//			   |				ЗаказНаряды)
	//			   |	И ИзвлечениеТоваровИзПроизводства.СкладКомпании = &СкладКомпании
	//			   |	И ИзвлечениеТоваровИзПроизводства.Проведен
	//			   |;
	//			   |
	//			   |////////////////////////////////////////////////////////////////////////////////
	//			   |ВЫБРАТЬ
	//			   |	ТоварыВПроизводствеОбороты.ЗаказНаряд КАК ЗаказНаряд,
	//			   |	ТоварыВПроизводствеОбороты.Номенклатура КАК Номенклатура,
	//			   |	ТоварыВПроизводствеОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//			   |	СУММА(ТоварыВПроизводствеОбороты.КоличествоОборот) КАК Количество
	//			   |ПОМЕСТИТЬ ТаблицаМатериалов
	//			   |ИЗ
	//			   |	РегистрНакопления.ТоварыВПроизводстве.Обороты(
	//			   |			,
	//			   |			,
	//			   |			Регистратор,
	//			   |			ЗаказНаряд В
	//			   |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//			   |					ЗаказНаряды.Ссылка
	//			   |				ИЗ
	//			   |					ЗаказНаряды)) КАК ТоварыВПроизводствеОбороты
	//			   |ГДЕ
	//			   |	ТоварыВПроизводствеОбороты.Регистратор В
	//			   |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//			   |				Документы.Ссылка
	//			   |			ИЗ
	//			   |				Документы)
	//			   |
	//			   |СГРУППИРОВАТЬ ПО
	//			   |	ТоварыВПроизводствеОбороты.ЗаказНаряд,
	//			   |	ТоварыВПроизводствеОбороты.Номенклатура,
	//			   |	ТоварыВПроизводствеОбороты.ХарактеристикаНоменклатуры
	//			   |
	//			   |ИМЕЮЩИЕ
	//			   |	СУММА(ТоварыВПроизводствеОбороты.КоличествоОборот) > 0
	//			   |;
	//			   |
	//			   |////////////////////////////////////////////////////////////////////////////////
	//			   |ВЫБРАТЬ
	//			   |	ЕСТЬNULL(СправочникНоменклатуры.ОсновнаяЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
	//			   |	МАКСИМУМ(ЕСТЬNULL(СправочникНоменклатуры.ОсновнаяЕдиницаИзмерения.Коэффициент, 1)) КАК Коэффициент,
	//			   |	ЕСТЬNULL(ЗаказНаряды.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1)) КАК Дата,
	//			   |	ТаблицаМатериалов.ЗаказНаряд КАК ЗаказНаряд,
	//			   |	ТаблицаМатериалов.Номенклатура,
	//			   |	ТаблицаМатериалов.ХарактеристикаНоменклатуры,
	//			   |	СУММА(ТаблицаМатериалов.Количество) КАК Количество,
	//			   |	ЕСТЬNULL(ЗаказНаряды.Цех, ЗНАЧЕНИЕ(Справочник.Цеха.ПустаяСсылка)) КАК Цех
	//			   |ИЗ
	//			   |	ТаблицаМатериалов КАК ТаблицаМатериалов
	//			   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатуры
	//			   |		ПО ТаблицаМатериалов.Номенклатура = СправочникНоменклатуры.Ссылка
	//			   |		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказНаряды КАК ЗаказНаряды
	//			   |		ПО ТаблицаМатериалов.ЗаказНаряд = ЗаказНаряды.Ссылка
	//			   |
	//			   |СГРУППИРОВАТЬ ПО
	//			   |	ЕСТЬNULL(ЗаказНаряды.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1)),
	//			   |	ТаблицаМатериалов.Номенклатура,
	//			   |	ЕСТЬNULL(ЗаказНаряды.Цех, ЗНАЧЕНИЕ(Справочник.Цеха.ПустаяСсылка)),
	//			   |	ТаблицаМатериалов.ХарактеристикаНоменклатуры,
	//			   |	ТаблицаМатериалов.ЗаказНаряд,
	//			   |	ЕСТЬNULL(СправочникНоменклатуры.ОсновнаяЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка))
	//			   |ИТОГИ
	//			   |	МАКСИМУМ(Дата),
	//			   |	МАКСИМУМ(Цех)
	//			   |ПО
	//			   |	ЗаказНаряд
	//			   |;
	//			   |
	//			   |////////////////////////////////////////////////////////////////////////////////
	//			   |ВЫБРАТЬ
	//			   |	Документы.Ссылка
	//			   |ИЗ
	//			   |	Документы КАК Документы
	//			   |
	//			   |СГРУППИРОВАТЬ ПО
	//			   |	Документы.Ссылка
	//			   |
	//			   |ОБЪЕДИНИТЬ ВСЕ
	//			   |
	//			   |ВЫБРАТЬ
	//			   |	ЗаказПокупателя.Ссылка
	//			   |ИЗ
	//			   |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	//			   |ГДЕ
	//			   |	ЗаказПокупателя.ДокументОснование В
	//			   |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//			   |				ЗаказНаряды.Ссылка
	//			   |			ИЗ
	//			   |				ЗаказНаряды)
	//			   |	И ЗаказПокупателя.Проведен
	//			   |	И ЗаказПокупателя.СкладКомпании = &СкладКомпании";
//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ЗаказНаряд.Ссылка,
//	|	ЗаказНаряд.Организация,
//	|	ЗаказНаряд.Дата КАК ДатаЗаказНаряда,
//	|	ЗаказНаряд.Цех
//	|ПОМЕСТИТЬ ЗаказНаряды
//	|ИЗ
//	|	Документ.ЗаказНаряд КАК ЗаказНаряд
//	|ГДЕ
//	|	КОНЕЦПЕРИОДА(ЗаказНаряд.ДатаОкончания, ДЕНЬ) = КОНЕЦПЕРИОДА(&ДатаОбработки, ДЕНЬ)
//	|	И ЗаказНаряд.Проведен
//	|	И ЗаказНаряд.Организация = &ОрганизацияПокупатель
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТоварыВПроизводстве.Номенклатура,
//	|	ТоварыВПроизводстве.ХарактеристикаНоменклатуры,
//	|	СУММА(ТоварыВПроизводстве.Количество) КАК Количество,
//	|	ТоварыВПроизводстве.Регистратор
//	|ПОМЕСТИТЬ Товары
//	|ИЗ
//	|	РегистрНакопления.ТоварыВПроизводстве КАК ТоварыВПроизводстве
//	|ГДЕ
//	|	ТоварыВПроизводстве.Регистратор В
//	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|				ЗаказНаряды.Ссылка
//	|			ИЗ
//	|				ЗаказНаряды)
//	|	И ТоварыВПроизводстве.Партия.Организация = &ОрганизацияПоставщик
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТоварыВПроизводстве.Регистратор,
//	|	ТоварыВПроизводстве.Номенклатура,
//	|	ТоварыВПроизводстве.ХарактеристикаНоменклатуры
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	Товары.Номенклатура,
//	|	Товары.ХарактеристикаНоменклатуры,
//	|	СУММА(Товары.Количество) КАК Количество,
//	|	ЕСТЬNULL(СправочникНоменклатуры.ОсновнаяЕдиницаИзмерения.Коэффициент, 1) КАК Коэффициент,
//	|	ЕСТЬNULL(СправочникНоменклатуры.ОсновнаяЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
//	|	Товары.Регистратор КАК ЗаказНаряд,
//	|	ЕСТЬNULL(ЗаказНаряды.ДатаЗаказНаряда, Товары.Регистратор.Дата) КАК ДатаЗаказНаряда,
//	|	ЕСТЬNULL(ЗаказНаряды.Цех, ЗНАЧЕНИЕ(Справочник.Цеха.ПустаяСсылка)) КАК ЦехЗаказНаряда
//	|ИЗ
//	|	Товары КАК Товары
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатуры
//	|		ПО Товары.Номенклатура = СправочникНоменклатуры.Ссылка
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказНаряды КАК ЗаказНаряды
//	|		ПО Товары.Регистратор = ЗаказНаряды.Ссылка
//	|ГДЕ
//	|	Товары.Регистратор В
//	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|				ЗаказНаряды.Ссылка
//	|			ИЗ
//	|				ЗаказНаряды)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	Товары.Номенклатура,
//	|	Товары.ХарактеристикаНоменклатуры,
//	|	ЕСТЬNULL(СправочникНоменклатуры.ОсновнаяЕдиницаИзмерения.Коэффициент, 1),
//	|	ЕСТЬNULL(СправочникНоменклатуры.ОсновнаяЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)),
//	|	Товары.Регистратор,
//	|	ЕСТЬNULL(ЗаказНаряды.ДатаЗаказНаряда, Товары.Регистратор.Дата),
//	|	ЕСТЬNULL(ЗаказНаряды.Цех, ЗНАЧЕНИЕ(Справочник.Цеха.ПустаяСсылка))
//	|ИТОГИ
//	|	МАКСИМУМ(ДатаЗаказНаряда),
//	|	МАКСИМУМ(ЦехЗаказНаряда)
//	|ПО
//	|	ЗаказНаряд";
	
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗаказНаряд.Ссылка,
	               |	ЗаказНаряд.Организация,
	               |	ЗаказНаряд.Дата КАК ДатаЗаказНаряда,
	               |	ЗаказНаряд.Цех
	               |ПОМЕСТИТЬ ЗаказНаряды
	               |ИЗ
	               |	Документ.ЗаказНаряд КАК ЗаказНаряд
	               |ГДЕ
	               |	КОНЕЦПЕРИОДА(ЗаказНаряд.ДатаОкончания, ДЕНЬ) = КОНЕЦПЕРИОДА(&ДатаОбработки, ДЕНЬ)
	               |	И ЗаказНаряд.Проведен
	               |	И ЗаказНаряд.Организация = &ОрганизацияПокупатель
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	КомплектацияАвтомобиля.Ссылка,
	               |	КомплектацияАвтомобиля.Организация,
	               |	КомплектацияАвтомобиля.Дата,
	               |	КомплектацияАвтомобиля.Цех
	               |ИЗ
	               |	Документ.КомплектацияАвтомобиля КАК КомплектацияАвтомобиля
	               |ГДЕ
	               |	КОНЕЦПЕРИОДА(КомплектацияАвтомобиля.ДатаОкончания, ДЕНЬ) = КОНЕЦПЕРИОДА(&ДатаОбработки, ДЕНЬ)
	               |	И КомплектацияАвтомобиля.Проведен
	               |	И КомплектацияАвтомобиля.Организация = &ОрганизацияПокупатель
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТоварыВПроизводстве.Номенклатура,
	               |	ТоварыВПроизводстве.ХарактеристикаНоменклатуры,
	               |	СУММА(ТоварыВПроизводстве.Количество) КАК Количество,
	               |	ТоварыВПроизводстве.Регистратор
	               |ПОМЕСТИТЬ Товары
	               |ИЗ
	               |	РегистрНакопления.ТоварыВПроизводстве КАК ТоварыВПроизводстве
	               |ГДЕ
	               |	ТоварыВПроизводстве.Регистратор В
	               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |				ЗаказНаряды.Ссылка
	               |			ИЗ
	               |				ЗаказНаряды)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТоварыВПроизводстве.Регистратор,
	               |	ТоварыВПроизводстве.Номенклатура,
	               |	ТоварыВПроизводстве.ХарактеристикаНоменклатуры
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Товары.Номенклатура,
	               |	Товары.ХарактеристикаНоменклатуры,
	               |	СУММА(Товары.Количество) КАК Количество,
	               |	ЕСТЬNULL(СправочникНоменклатуры.ОсновнаяЕдиницаИзмерения.Коэффициент, 1) КАК Коэффициент,
	               |	ЕСТЬNULL(СправочникНоменклатуры.ОсновнаяЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
	               |	Товары.Регистратор КАК ЗаказНаряд,
	               |	ЕСТЬNULL(ЗаказНаряды.ДатаЗаказНаряда, Товары.Регистратор.Дата) КАК ДатаЗаказНаряда,
	               |	ЕСТЬNULL(ЗаказНаряды.Цех, ЗНАЧЕНИЕ(Справочник.Цеха.ПустаяСсылка)) КАК ЦехЗаказНаряда
	               |ИЗ
	               |	Товары КАК Товары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатуры
	               |		ПО Товары.Номенклатура = СправочникНоменклатуры.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказНаряды КАК ЗаказНаряды
	               |		ПО Товары.Регистратор = ЗаказНаряды.Ссылка
	               |ГДЕ
	               |	Товары.Регистратор В
	               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |				ЗаказНаряды.Ссылка
	               |			ИЗ
	               |				ЗаказНаряды)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Товары.Номенклатура,
	               |	Товары.ХарактеристикаНоменклатуры,
	               |	ЕСТЬNULL(СправочникНоменклатуры.ОсновнаяЕдиницаИзмерения.Коэффициент, 1),
	               |	ЕСТЬNULL(СправочникНоменклатуры.ОсновнаяЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)),
	               |	Товары.Регистратор,
	               |	ЕСТЬNULL(ЗаказНаряды.ДатаЗаказНаряда, Товары.Регистратор.Дата),
	               |	ЕСТЬNULL(ЗаказНаряды.Цех, ЗНАЧЕНИЕ(Справочник.Цеха.ПустаяСсылка))
	               |ИТОГИ
	               |	МАКСИМУМ(ДатаЗаказНаряда),
	               |	МАКСИМУМ(ЦехЗаказНаряда)
	               |ПО
	               |	ЗаказНаряд";
	Запрос.УстановитьПараметр("ДатаОбработки",?(Дата = Неопределено,ТекущаяДата(),КонецДня(Дата)));
	Запрос.УстановитьПараметр("ОрганизацияПоставщик",Параметры.ОрганизацияПоставщик);
	Запрос.УстановитьПараметр("ОрганизацияПокупатель",Параметры.ОрганизацияПокупатель);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Процедура СформироватьДокументыПерепродажи() Экспорт	
	
	//Получение настроек + проверка заполнения обязательных настроек
	
	ВыборкаПараметров = ПолучитьПараметры();
	
	Если ВыборкаПараметров = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Пока ВыборкаПараметров.Следующий() Цикл
		
		Параметры = ВыборкаПараметров;
		//
		//Если НЕ Параметры.Следующий() Тогда
		//	Продолжить;
		//КонецЕсли;
		
		ЛогРаботы = ИнициализироватьЛогРаботы(Параметры.ПутьКФайлуЛогаРаботы);
		ДобавитьЗаписьВЛогРаботы(ЛогРаботы,"Начало работы");
		
		//Получаем результат запроса по товарам
		
		Результат = ПолучитьРезультатЗапросаПоЗаказНарядам(Параметры);
		
		Если Результат.Пустой() Тогда
			ДобавитьЗаписьВЛогРаботы(ЛогРаботы,"Завершение работы");
			СохранитьЛогРаботы(ЛогРаботы,Параметры.ПутьКФайлуЛогаРаботы);
			Продолжить;
		КонецЕсли;
		
		НачатьТранзакцию();
		
		//Создадим таблицу для хранения документов для группового проведения
		ТаблицаДокументов = Новый ТаблицаЗначений;
		ТаблицаДокументов.Колонки.Добавить("Документ");	
		ТаблицаДокументов.Колонки.Добавить("Дата");
		
		//Начинаем формировать документы перепродажи между организациями
		
		ВыборкаЗаказНарядов = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Отказ = Ложь;
		
		ТаблицаЗаказов = Новый ТаблицаЗначений;
		ТаблицаЗаказов.Колонки.Добавить("Заказ");
		ТаблицаЗаказов.Колонки.Добавить("Дата");
		
		Пока ВыборкаЗаказНарядов.Следующий() Цикл
			
			#Если Клиент Тогда
				//Прерывание пользователя
				ОбработкаПрерыванияПользователя();
			#КонецЕсли
			ЗаказНаряд = ВыборкаЗаказНарядов.ЗаказНаряд;
			
			ДатаОкончания = ЗаказНаряд.ДатаОкончания;
			ДатаЗаказНарядаОкончание =ВыборкаЗаказНарядов.ЗаказНаряд.ДатаОкончания;

			СтрокаЗаказов = ТаблицаЗаказов.Добавить();
			СтрокаЗаказов.Заказ = ЗаказНаряд;
			СтрокаЗаказов.Дата = ВыборкаЗаказНарядов.ДатаЗаказНаряда;
			
			
			//Отменим проведение у заказ-наряда
			ЗаписатьДокумент(ЗаказНаряд.ПолучитьОбъект(),ЛогРаботы,РежимЗаписиДокумента.ОтменаПроведения,Отказ);
			
			Если Отказ Тогда
				Прервать;
			КонецЕсли;
			
			//Необходимо проверить - были ли уже сформированы документы перепродажи по заказ-наряду
			//пока эту обработку не делаем
			
			ДатаЗаказНаряда = ВыборкаЗаказНарядов.ДатаЗаказНаряда;
			ЦехЗаказНаряда = ВыборкаЗаказНарядов.ЦехЗаказНаряда;
			
			//Создаем три документа:  реализацию, поступление и перемещение в производство
			ИзвлечениеОбъект = СоздатьИзвлечениеИзПроизводства(Параметры, ЦехЗаказНаряда, ДатаЗаказНарядаОкончание - 4);
			РеализацияОбъект = СоздатьРеализацию(Параметры, ДатаЗаказНарядаОкончание - 3);
			ПоступлениеОбъект = СоздатьПоступление(Параметры, ДатаЗаказНарядаОкончание - 2);
			ПеремещениеОбъект = СоздатьПеремещениеВПроизводство(Параметры, ЦехЗаказНаряда, ДатаЗаказНарядаОкончание - 1);
			
			//указываем в качестве основания заказ-наряд
			ИзвлечениеОбъект.ДокументОснование = ЗаказНаряд;
			РеализацияОбъект.ЗаказНаряд = ЗаказНаряд;
			ПоступлениеОбъект.ЗаказНаряд = ЗаказНаряд;
			ПеремещениеОбъект.ДокументОснование = ЗаказНаряд;
			
			ЗаписатьДокумент(ПоступлениеОбъект,ЛогРаботы,РежимЗаписиДокумента.Запись,Отказ);
			
			Если Отказ Тогда
				Прервать;
			КонецЕсли;
			
			СсылкаНаПоступление = ПоступлениеОбъект.Ссылка;
			
			Выборка = ВыборкаЗаказНарядов.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				#Если Клиент Тогда
					//Прерывание пользователя
					ОбработкаПрерыванияПользователя();
				#КонецЕсли
				
				
				//заполняем строки документов
				СтрокаРеализации = ДобавитьСтрокуРеализации(РеализацияОбъект,Выборка);
				//копируем строку из реализации
				ДобавитьСтрокуИзвлечение(ИзвлечениеОбъект,СтрокаРеализации);
				ДобавитьСтрокуПоступления(ПоступлениеОбъект,СтрокаРеализации);
				ДобавитьСтрокуПеремещение(ПеремещениеОбъект,Выборка,СсылкаНаПоступление);
				
			КонецЦикла;
			
			//на случай если у организация разная политика по НДС
			ПоступлениеОбъект.ОбработкаРеквизита("Организация");
			
			//РезервированиеОбъект = СоздатьРезервирование(Параметры,ЗаказНаряд,ДатаЗаказНаряда - 2);
			
			ЗаписатьДокумент(ИзвлечениеОбъект,ЛогРаботы,РежимЗаписиДокумента.Запись,Отказ);
			
			ЗаписатьДокумент(РеализацияОбъект,ЛогРаботы,РежимЗаписиДокумента.Запись,Отказ);
			
			ЗаписатьДокумент(ПоступлениеОбъект,ЛогРаботы,РежимЗаписиДокумента.Запись,Отказ);
			
			ЗаписатьДокумент(ПеремещениеОбъект,ЛогРаботы,РежимЗаписиДокумента.Запись,Отказ);
			
			Если Отказ Тогда
				Прервать;
			КонецЕсли;
			
			
			
			//добавляем записанные документы в таблицу для последующего проведения
			СтрокаДокументов = ТаблицаДокументов.Добавить();
			СтрокаДокументов.Документ = ИзвлечениеОбъект.Ссылка; 
			
			СтрокаДокументов = ТаблицаДокументов.Добавить();
			СтрокаДокументов.Документ = РеализацияОбъект.Ссылка; 
			
			СтрокаДокументов = ТаблицаДокументов.Добавить();
			СтрокаДокументов.Документ = ПоступлениеОбъект.Ссылка;
			
			СтрокаДокументов = ТаблицаДокументов.Добавить();
			СтрокаДокументов.Документ = ПеремещениеОбъект.Ссылка;
			
			СтрокаДокументов = ТаблицаДокументов.Добавить();
			СтрокаДокументов.Документ = ЗаказНаряд;
			СтрокаДокументов.Дата = ДатаОкончания;
			
			//При необходимости создаем счета-фактуры
			Если РеализацияОбъект.Товары.Итог("СуммаНДС") > 0 Тогда
				СФИсходящий = Документы.СчетФактураВыданный.СоздатьДокумент();
				СФИсходящий.Заполнить(РеализацияОбъект.Ссылка);
				СФИсходящий.Дата = РеализацияОбъект.Дата;
				СФИсходящий.УстановитьНовыйНомер();
				ЗаписатьДокумент(СФИсходящий,ЛогРаботы,РежимЗаписиДокумента.Запись,Отказ);
				Если Отказ Тогда
					Прервать;
				Иначе
					СтрокаДокументов = ТаблицаДокументов.Добавить();
					СтрокаДокументов.Документ = СФИсходящий.Ссылка;
				КонецЕсли;
			КонецЕсли;
			
			Если ПоступлениеОбъект.Товары.Итог("СуммаНДС") > 0 Тогда
				СФВходящий = Документы.СчетФактураПолученный.СоздатьДокумент();
				СФВходящий.Заполнить(ПоступлениеОбъект.Ссылка);
				СФВходящий.Дата = ПоступлениеОбъект.Дата;
				СФВходящий.УстановитьНовыйНомер();
				ЗаписатьДокумент(СФВходящий,ЛогРаботы,РежимЗаписиДокумента.Запись,Отказ);
				Если Отказ Тогда
					Прервать;
				Иначе
					СтрокаДокументов = ТаблицаДокументов.Добавить();
					СтрокаДокументов.Документ = СФВходящий.Ссылка;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		
		//Если Не Отказ Тогда
		//	//Отменяем проведение у документов перемещения и изъятия из производства, подчиненных заказ-наряду
		//	ТаблицаДокументовПеремещения = МассивРезультатов[4].Выгрузить();
		//	
		//	Для Каждого СтрокаТаблицы Из ТаблицаДокументовПеремещения Цикл
		//		ЗаписатьДокумент(СтрокаТаблицы.Ссылка.ПолучитьОбъект(),ЛогРаботы,РежимЗаписиДокумента.ОтменаПроведения,Отказ);
		//	КонецЦикла; 
		//	
		//КонецЕсли;
		
		
		//здесь нужно проверить наличие резервов по снятым с проведения документам
		
		//Если Не Отказ Тогда	
		//	СоздатьДокументСнятияРезерва(ТаблицаЗаказов,Отказ,ЛогРаботы,Параметры);
		//КонецЕсли;
		//
		
		//Займемся перепроведением документов
		Если Не Отказ Тогда
			ПровестиДокументыИзТаблицы(ТаблицаДокументов,ЛогРаботы,Отказ);
		КонецЕсли;
		
		//фиксируем результат работы
		Если Отказ Тогда
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли;
		Иначе
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
		ДобавитьЗаписьВЛогРаботы(ЛогРаботы,"Завершение работы");
		СохранитьЛогРаботы(ЛогРаботы,Параметры.ПутьКФайлуЛогаРаботы);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьДокументыПерепродажиНаДату(Дата=Неопределено) Экспорт	
	
	//Получение настроек + проверка заполнения обязательных настроек
	
	ВыборкаПараметров = ПолучитьПараметры();
	
	Если ВыборкаПараметров = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Пока ВыборкаПараметров.Следующий() Цикл
		
		Параметры = ВыборкаПараметров;
		//
		//Если НЕ Параметры.Следующий() Тогда
		//	Продолжить;
		//КонецЕсли;
		
		ЛогРаботы = ИнициализироватьЛогРаботы(Параметры.ПутьКФайлуЛогаРаботы);
		ДобавитьЗаписьВЛогРаботы(ЛогРаботы,"Начало работы");
		
		//Получаем результат запроса по товарам
		
		Результат = ПолучитьРезультатЗапросаПоЗаказНарядам(Параметры,Дата);
		
		Если Результат.Пустой() Тогда
			ДобавитьЗаписьВЛогРаботы(ЛогРаботы,"Завершение работы");
			СохранитьЛогРаботы(ЛогРаботы,Параметры.ПутьКФайлуЛогаРаботы);
			Продолжить;
		КонецЕсли;
		
		НачатьТранзакцию();
		
		//Создадим таблицу для хранения документов для группового проведения
		ТаблицаДокументов = Новый ТаблицаЗначений;
		ТаблицаДокументов.Колонки.Добавить("Документ");	
		ТаблицаДокументов.Колонки.Добавить("Дата");
		
		//Начинаем формировать документы перепродажи между организациями
		
		ВыборкаЗаказНарядов = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Отказ = Ложь;
		
		ТаблицаЗаказов = Новый ТаблицаЗначений;
		ТаблицаЗаказов.Колонки.Добавить("Заказ");
		ТаблицаЗаказов.Колонки.Добавить("Дата");
		
		Пока ВыборкаЗаказНарядов.Следующий() Цикл
			
			#Если Клиент Тогда
				//Прерывание пользователя
				ОбработкаПрерыванияПользователя();
			#КонецЕсли
			ЗаказНаряд = ВыборкаЗаказНарядов.ЗаказНаряд;
			
			ДатаОкончания = ЗаказНаряд.ДатаОкончания;
			
			СтрокаЗаказов = ТаблицаЗаказов.Добавить();
			СтрокаЗаказов.Заказ = ЗаказНаряд;
			СтрокаЗаказов.Дата = ВыборкаЗаказНарядов.ДатаЗаказНаряда;
			
			ДатаЗаказНарядаОкончание =ВыборкаЗаказНарядов.ЗаказНаряд.ДатаОкончания;

			//Отменим проведение у заказ-наряда
			ЗаписатьДокумент(ЗаказНаряд.ПолучитьОбъект(),ЛогРаботы,РежимЗаписиДокумента.ОтменаПроведения,Отказ);
			
			Если Отказ Тогда
				Прервать;
			КонецЕсли;
			
			//Необходимо проверить - были ли уже сформированы документы перепродажи по заказ-наряду
			//пока эту обработку не делаем
			
			ДатаЗаказНаряда = ВыборкаЗаказНарядов.ДатаЗаказНаряда;
			
			ЦехЗаказНаряда = ВыборкаЗаказНарядов.ЦехЗаказНаряда;
			
			//Создаем три документа:  реализацию, поступление и перемещение в производство
			ИзвлечениеОбъект = СоздатьИзвлечениеИзПроизводства(Параметры, ЦехЗаказНаряда, ДатаЗаказНарядаОкончание - 4);
			РеализацияОбъект = СоздатьРеализацию(Параметры, ДатаЗаказНарядаОкончание - 3);
			ПоступлениеОбъект = СоздатьПоступление(Параметры, ДатаЗаказНарядаОкончание - 2);
			ПеремещениеОбъект = СоздатьПеремещениеВПроизводство(Параметры, ЦехЗаказНаряда, ДатаЗаказНарядаОкончание - 1);
			
			//указываем в качестве основания заказ-наряд
			ИзвлечениеОбъект.ДокументОснование = ЗаказНаряд;
			РеализацияОбъект.ДокументОснование = ЗаказНаряд;
			ПоступлениеОбъект.ДокументОснование = ЗаказНаряд;
			ПеремещениеОбъект.ДокументОснование = ЗаказНаряд;
			
			ЗаписатьДокумент(ПоступлениеОбъект,ЛогРаботы,РежимЗаписиДокумента.Запись,Отказ);
			
			Если Отказ Тогда
				Прервать;
			КонецЕсли;
			
			СсылкаНаПоступление = ПоступлениеОбъект.Ссылка;
			
			Выборка = ВыборкаЗаказНарядов.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				#Если Клиент Тогда
					//Прерывание пользователя
					ОбработкаПрерыванияПользователя();
				#КонецЕсли
				
				
				//заполняем строки документов
				СтрокаРеализации = ДобавитьСтрокуРеализации(РеализацияОбъект,Выборка);
				//копируем строку из реализации
				ДобавитьСтрокуИзвлечение(ИзвлечениеОбъект,СтрокаРеализации);
				ДобавитьСтрокуПоступления(ПоступлениеОбъект,СтрокаРеализации);
				ДобавитьСтрокуПеремещение(ПеремещениеОбъект,Выборка,СсылкаНаПоступление);
				
			КонецЦикла;
			
			//на случай если у организация разная политика по НДС
			ПоступлениеОбъект.ОбработкаРеквизита("Организация");
			
			//РезервированиеОбъект = СоздатьРезервирование(Параметры,ЗаказНаряд,ДатаЗаказНаряда - 2);
			
			ЗаписатьДокумент(ИзвлечениеОбъект,ЛогРаботы,РежимЗаписиДокумента.Запись,Отказ);
			
			ЗаписатьДокумент(РеализацияОбъект,ЛогРаботы,РежимЗаписиДокумента.Запись,Отказ);
			
			ЗаписатьДокумент(ПоступлениеОбъект,ЛогРаботы,РежимЗаписиДокумента.Запись,Отказ);
			
			ЗаписатьДокумент(ПеремещениеОбъект,ЛогРаботы,РежимЗаписиДокумента.Запись,Отказ);
			
			Если Отказ Тогда
				Прервать;
			КонецЕсли;
			
			
			
			//добавляем записанные документы в таблицу для последующего проведения
			СтрокаДокументов = ТаблицаДокументов.Добавить();
			СтрокаДокументов.Документ = ИзвлечениеОбъект.Ссылка; 
			
			СтрокаДокументов = ТаблицаДокументов.Добавить();
			СтрокаДокументов.Документ = РеализацияОбъект.Ссылка; 
			
			СтрокаДокументов = ТаблицаДокументов.Добавить();
			СтрокаДокументов.Документ = ПоступлениеОбъект.Ссылка;
			
			СтрокаДокументов = ТаблицаДокументов.Добавить();
			СтрокаДокументов.Документ = ПеремещениеОбъект.Ссылка;
			
			СтрокаДокументов = ТаблицаДокументов.Добавить();
			СтрокаДокументов.Документ = ЗаказНаряд;
			СтрокаДокументов.Дата = ДатаОкончания;
			
			//При необходимости создаем счета-фактуры
			Если РеализацияОбъект.Товары.Итог("СуммаНДС") > 0 Тогда
				СФИсходящий = Документы.СчетФактураВыданный.СоздатьДокумент();
				СФИсходящий.Заполнить(РеализацияОбъект.Ссылка);
				СФИсходящий.Дата = РеализацияОбъект.Дата;
				СФИсходящий.УстановитьНовыйНомер();
				ЗаписатьДокумент(СФИсходящий,ЛогРаботы,РежимЗаписиДокумента.Запись,Отказ);
				Если Отказ Тогда
					Прервать;
				Иначе
					СтрокаДокументов = ТаблицаДокументов.Добавить();
					СтрокаДокументов.Документ = СФИсходящий.Ссылка;
				КонецЕсли;
			КонецЕсли;
			
			Если ПоступлениеОбъект.Товары.Итог("СуммаНДС") > 0 Тогда
				СФВходящий = Документы.СчетФактураПолученный.СоздатьДокумент();
				СФВходящий.Заполнить(ПоступлениеОбъект.Ссылка);
				СФВходящий.Дата = ПоступлениеОбъект.Дата;
				СФВходящий.УстановитьНовыйНомер();
				ЗаписатьДокумент(СФВходящий,ЛогРаботы,РежимЗаписиДокумента.Запись,Отказ);
				Если Отказ Тогда
					Прервать;
				Иначе
					СтрокаДокументов = ТаблицаДокументов.Добавить();
					СтрокаДокументов.Документ = СФВходящий.Ссылка;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		
		//Если Не Отказ Тогда
		//	//Отменяем проведение у документов перемещения и изъятия из производства, подчиненных заказ-наряду
		//	ТаблицаДокументовПеремещения = МассивРезультатов[4].Выгрузить();
		//	
		//	Для Каждого СтрокаТаблицы Из ТаблицаДокументовПеремещения Цикл
		//		ЗаписатьДокумент(СтрокаТаблицы.Ссылка.ПолучитьОбъект(),ЛогРаботы,РежимЗаписиДокумента.ОтменаПроведения,Отказ);
		//	КонецЦикла; 
		//	
		//КонецЕсли;
		
		
		//здесь нужно проверить наличие резервов по снятым с проведения документам
		
		//Если Не Отказ Тогда	
		//	СоздатьДокументСнятияРезерва(ТаблицаЗаказов,Отказ,ЛогРаботы,Параметры);
		//КонецЕсли;
		//
		
		//Займемся перепроведением документов
		Если Не Отказ Тогда
			ПровестиДокументыИзТаблицы(ТаблицаДокументов,ЛогРаботы,Отказ);
		КонецЕсли;
		
		//фиксируем результат работы
		Если Отказ Тогда
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли;
		Иначе
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
		ДобавитьЗаписьВЛогРаботы(ЛогРаботы,"Завершение работы");
		СохранитьЛогРаботы(ЛогРаботы,Параметры.ПутьКФайлуЛогаРаботы);
		
	КонецЦикла;
	
КонецПроцедуры



Процедура ЗаписатьДокумент(ДокументОбъект,ЛогРаботы,РежимЗаписи,Отказ)	
	
	ДокСтрока = Строка(ДокументОбъект);
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписи);
		ДобавитьЗаписьВЛогРаботы(ЛогРаботы,"" + РежимЗаписи + ": " + ДокСтрока);
	Исключение 
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		ДобавитьЗаписьВЛогРаботы(ЛогРаботы,"" + РежимЗаписи + ": " + ДокСтрока + ": " + ОписаниеОшибки(),Истина);			 
		
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры

Процедура ПровестиДокументыИзТаблицы(ТаблицаДокументов,ЛогРаботы,Отказ)
	Для Каждого СтрокаДокументов ИЗ ТаблицаДокументов Цикл
		
		ДокументОбъект = СтрокаДокументов.Документ.ПолучитьОбъект();
		
		ДокСтрока = Строка(СтрокаДокументов.Документ);
		
		Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ЗаказНаряд") Тогда
			//проведем заказ-наряд
			Попытка
				ДокументОбъект.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен;
				ДокументОбъект.ДатаОкончания  = СтрокаДокументов.Дата+7;
				ДокументОбъект.Записать();
				ДокументОбъект.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт;
				ДокументОбъект.Записать();
				ДобавитьЗаписьВЛогРаботы(ЛогРаботы,"Проведение: " + ДокСтрока);
			Исключение
				Если ТранзакцияАктивна() Тогда
					ОтменитьТранзакцию();
				КонецЕсли;
				ДобавитьЗаписьВЛогРаботы(ЛогРаботы,"Проведение: " + ДокСтрока + ": " + ОписаниеОшибки(),Истина);				 
				Отказ = Истина;
			КонецПопытки;
		Иначе
			Попытка
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
				ДобавитьЗаписьВЛогРаботы(ЛогРаботы,"Проведение: " + ДокСтрока);
			Исключение
				//Сообщить(ОписаниеОшибки());

				Если ТранзакцияАктивна() Тогда
					ОтменитьТранзакцию();
				КонецЕсли;
				ДобавитьЗаписьВЛогРаботы(ЛогРаботы,"Проведение: " + ДокСтрока + ": " + ОписаниеОшибки(),Истина);
				Отказ = Истина;
				
			КонецПопытки;
		КонецЕсли;
		
		Если Отказ Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//Процедуры для работы с логом работы обработки
Функция ИнициализироватьЛогРаботы(ПутьКФайлуЛогаРаботы)
	
	ФайлЛога = Новый Файл(ПутьКФайлуЛогаРаботы);
	
	ЛогРаботы = Новый ЗаписьТекста;
	
	
	Если ФайлЛога.Существует() Тогда
		ЛогРаботы.Открыть(ПутьКФайлуЛогаРаботы,,,Истина);
	Иначе
		ЛогРаботы.Открыть(ПутьКФайлуЛогаРаботы);
	КонецЕсли;
	
	Возврат ЛогРаботы;
	
КонецФункции

Процедура ДобавитьЗаписьВЛогРаботы(ЛогРаботы,Запись,Ошибка = Ложь)
	
	ЛогРаботы.ЗаписатьСтроку("" + ТекущаяДата() + ?(Ошибка," ОШИБКА!!!", "") + Символы.Таб + Запись);
	
КонецПроцедуры

Процедура СохранитьЛогРаботы(ЛогРаботы,ПутьКФайлуЛогаРаботы)
	
	ЛогРаботы.Закрыть();
	
КонецПроцедуры


//Обработчик события "При проведени изъятия товаров из производства"
Процедура ИзвлечениеТоваровИзПроизводстваПриПроведении(ДокументОбъект,Отказ, Режим) Экспорт 
	
	
	ДокументОбъект.Движения.ПартииТоваровКомпании.Записать();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПартииТоваровКомпании.Номенклатура,
	|	ПартииТоваровКомпании.ХарактеристикаНоменклатуры,
	|	ПартииТоваровКомпании.Партия,
	|	СУММА(ПартииТоваровКомпании.Количество) КАК Количество,
	|	ПартииТоваровКомпании.СкладКомпании.Организация КАК Организация
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
	|ГДЕ
	|	ПартииТоваровКомпании.Период = &Период
	|	И ПартииТоваровКомпании.Регистратор = &Регистратор
	|	И ПартииТоваровКомпании.Партия.Организация <> ПартииТоваровКомпании.СкладКомпании.Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииТоваровКомпании.ХарактеристикаНоменклатуры,
	|	ПартииТоваровКомпании.Номенклатура,
	|	ПартииТоваровКомпании.Партия,
	|	ПартииТоваровКомпании.СкладКомпании.Организация";
	
	Запрос.УстановитьПараметр("Период",ДокументОбъект.Дата);
	Запрос.УстановитьПараметр("Регистратор",ДокументОбъект.Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Отказ = Истина;
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Сообщить("Партия " + Выборка.Партия + " номенклатуры " + Выборка.Номенклатура 
			+ " принадлежит организации, отличной от " + Выборка.Организация + "!"
			+ Символы.ПС + "Извлечение невозможно!");
			
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры
