
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СуммаАвтомобиляИБазовыхОпций") Тогда
		СуммаАвтомобиляИБазовыхОпций = Параметры.СуммаАвтомобиляИБазовыхОпций;
	КонецЕсли;

	//Если Параметры.Свойство("Список") Тогда
	//	Для каждого КлючЗначение Из Параметры.Список Цикл
	//		НовСкидка = Список.Добавить();
	//		ЗаполнитьЗначенияСвойств(НовСкидка, КлючЗначение.Значение);
	//		
	//		Если ЗначениеЗаполнено(НовСкидка.ПроцентСкидки) Тогда
	//			НовСкидка.ЗначениеСкидки = ?(СуммаАвтомобиляИБазовыхОпций = 0, 0,СуммаАвтомобиляИБазовыхОпций/100*НовСкидка.ПроцентСкидки);
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	
	Если Параметры.Свойство("МассивЗначений") Тогда
		Для Каждого ТекЭлемент Из Параметры.МассивЗначений Цикл
			НоваяСтрока = Акции.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекЭлемент);
		КонецЦикла;
	КонецЕсли;
	
	Параметры.Свойство("Кредит", Кредит);
	Параметры.Свойство("TradeIn", TradeIn);
	Параметры.Свойство("Утилизация", Утилизация);
	Параметры.Свойство("VIN", VIN);
	Параметры.Свойство("Модель", Модель);
	Параметры.Свойство("ВариантКомплектации", ВариантКомплектации);
	Параметры.Свойство("ГодВыпуска", ГодВыпуска);

	ВариантСкидкиПроцент = Перечисления.DMS_ВариантыСкидки.Процент;
	
	//ОбновитьАкцииПоУтилизацииИTradeIn(Утилизация,TradeIn,Модель,ВариантКомплектации,VIN,ГодВыпуска)
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьАкцииПоУтилизацииИTradeIn(Утилизация,TradeIn,Модель,ВариантКомплектации,VIN,ГодВыпуска)
	

		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	ТЧ.Ссылка КАК Акция,
		//|	ТЧ.Ссылка.TradeIn КАК TradeIn,
		//|	ТЧ.Ссылка.Утилизация КАК Утилизация,
		//|	ТЧ.ВариантСкидки КАК ВариантСкидки,
		//|	ТЧ.ЗначениеСкидки КАК ЗначениеСкидки
		//|ИЗ
		//|	Справочник.DMS_КоммерческиеАкции.Условия КАК ТЧ
		//|ГДЕ
		//|	ТЧ.Ссылка.Активность
		//|	И (ТЧ.Объект = &ВариантКомплектации
		//|			ИЛИ ТЧ.Объект = &Модель
		//|			ИЛИ ТЧ.Объект = &VIN)
		//|	И (ТЧ.Ссылка.Кредит = ЛОЖЬ
		//|				И ТЧ.Ссылка.TradeIn = ИСТИНА
		//|				И ТЧ.Ссылка.Утилизация = ЛОЖЬ
		//|			ИЛИ ТЧ.Ссылка.Кредит = ЛОЖЬ
		//|				И ТЧ.Ссылка.TradeIn = ЛОЖЬ
		//|				И ТЧ.Ссылка.Утилизация = ИСТИНА)
		//|	И НАЧАЛОПЕРИОДА(&ТекДата, ДЕНЬ) МЕЖДУ ТЧ.Ссылка.НачалоДействия И ТЧ.Ссылка.ОкончаниеДействия
		//|	И (ТЧ.НачалоДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//|			ИЛИ НАЧАЛОПЕРИОДА(&ТекДата, ДЕНЬ) МЕЖДУ ТЧ.НачалоДействия И ТЧ.ОкончаниеДействия)
		//|	И ТЧ.Ссылка В
		//|			(ВЫБРАТЬ
		//|				Справочник.DMS_КоммерческиеАкции.Ссылка
		//|			ИЗ
		//|				Справочник.DMS_КоммерческиеАкции
		//|			ГДЕ
		//|				НЕ Справочник.DMS_КоммерческиеАкции.Ссылка В
		//|						(ВЫБРАТЬ
		//|							Справочник.DMS_КоммерческиеАкции.ГодыВыпуска.Ссылка
		//|						ИЗ
		//|							Справочник.DMS_КоммерческиеАкции.ГодыВыпуска)
		//|		
		//|			ОБЪЕДИНИТЬ
		//|		
		//|			ВЫБРАТЬ
		//|				Справочник.DMS_КоммерческиеАкции.ГодыВыпуска.Ссылка
		//|			ИЗ
		//|				Справочник.DMS_КоммерческиеАкции.ГодыВыпуска
		//|			ГДЕ
		//|				Справочник.DMS_КоммерческиеАкции.ГодыВыпуска.Год = &Год)
		//|
		//|ИТОГИ
		//|	МАКСИМУМ(TradeIn),
		//|	МАКСИМУМ(Утилизация) 
		//|ПО
		//|	ТЧ.Ссылка";		
		//Запрос.УстановитьПараметр("VIN", VIN);
		//Запрос.УстановитьПараметр("ВариантКомплектации", ВариантКомплектации);
		//Запрос.УстановитьПараметр("Год", ГодВыпуска);
		//Запрос.УстановитьПараметр("Модель", Модель);
		//Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
		//
		//РезультатЗапроса = Запрос.Выполнить();		
		//ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		
		//Пока ВыборкаСсылка.Следующий() Цикл
		//	Отбор = Новый Структура("Акция", ВыборкаСсылка.Акция);
		//	НайденныеСтроки = Акции.НайтиСтроки(Отбор);
		//	Если (Не Утилизация = Неопределено И Утилизация И Утилизация = ВыборкаСсылка.Утилизация)
		//		Или (Не TradeIn = Неопределено И TradeIn И TradeIn = ВыборкаСсылка.TradeIn) Тогда				
		//		Если НайденныеСтроки.Количество() = 0 Тогда
		//			Выборка = ВыборкаСсылка.Выбрать();
		//			Выборка.Следующий();
		//			Строка = Акции.Добавить();
		//			Строка.Акция = Выборка.Акция;		
		//			Если Выборка.ВариантСкидки=ВариантСкидкиПроцент Тогда
		//				//процент
		//				Строка.СуммаСкидки=СуммаАвтомобиляИБазовыхОпций*Выборка.ЗначениеСкидки/100;
		//			Иначе //сумма
		//				Строка.СуммаСкидки=Выборка.ЗначениеСкидки;
		//			КонецЕсли;
		//		КонецЕсли;					
		//	Иначе
		//		Если НайденныеСтроки.Количество() > 0 Тогда
		//			Для каждого Строка Из НайденныеСтроки Цикл
		//				Акции.Удалить(Строка);
		//			КонецЦикла;
		//		КонецЕсли;	
		//	КонецЕсли;	
		//КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.НадписьЦенаБазовойКомплектацииПоТарифу.Заголовок = "Цена базовой комплектации по тарифу: "+СуммаАвтомобиляИБазовыхОпций;
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)  
	МассивЗначений = Новый Массив;
	Для Каждого ТекСтрока Из Акции Цикл
		Если ЗначениеЗаполнено(ТекСтрока.Акция) Тогда
			МассивЗначений.Добавить(Новый Структура("Акция, ЗначениеСкидки", ТекСтрока.Акция, ТекСтрока.СуммаСкидки));
		КонецЕсли;
	КонецЦикла;
	Закрыть(МассивЗначений);
КонецПроцедуры

&НаКлиенте
Процедура АкцииАкцияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	
	//ТабличнаяЧасть=?(Элемент.Имя="КоммерческиеАкцииАкция","КоммерческиеАкции","СкидкиДилера");
	ТабличнаяЧасть="Акции";
	
	Парам=Новый Структура;
//	Парам.Вставить("АкцияДилера",?(ТабличнаяЧасть="КоммерческиеАкции",Ложь,Истина));
	//Если Объект.ВидАвтомобиля=ПредопределенноеЗначение("Справочник.DMS_ВидыАвтомобилей.Конфигурация") Тогда
	//	Парам.Вставить("ВариантКомплектации",Объект.ВариантКомплектации);
	//	Парам.Вставить("VIN",NULL);
	//	Парам.Вставить("Год",Год(ТекущаяДата()));
	//Иначе
//		СвВаАвто=DMS_Автомобили.Автомобиль(Объект.Автомобиль,"ВариантКомплектации,VIN,ДатаВыпуска");
		Парам.Вставить("Кредит", Кредит);
		Парам.Вставить("TradeIn", TradeIn);		
		Парам.Вставить("Утилизация", Утилизация);
		Парам.Вставить("Модель", Модель);
		Парам.Вставить("ВариантКомплектации", ВариантКомплектации);		
		Парам.Вставить("VIN",VIN);
		Парам.Вставить("Год", ГодВыпуска);
		Парам.Вставить("ДилерскийЦентр", ВладелецФормы.ДилерскийЦентр);
		
	//КонецЕсли;	
	Оповещение=Новый ОписаниеОповещения("ОкончаниеВыбораКоммерческиеАкции",ЭтаФорма,ТабличнаяЧасть);
	ОткрытьФорму("Справочник.DMS_КоммерческиеАкции.ФормаВыбора",Парам,ЭтаФорма,УникальныйИдентификатор,,,Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеВыбораКоммерческиеАкции(Парам,ТабличнаяЧасть) Экспорт 
	Если Парам=Неопределено Тогда Возврат КонецЕсли;
	Отбор = Новый Структура("Акция", Парам.КоммерческаяАкция);
	Если Акции.НайтиСтроки(Отбор).Количество() = 0 Тогда		
		Данные=Элементы[ТабличнаяЧасть].ТекущиеДанные;
		Данные.Акция=Парам.КоммерческаяАкция;		
		Если Парам.ВариантСкидки=ВариантСкидкиПроцент Тогда
			//процент
			Данные.СуммаСкидки=СуммаАвтомобиляИБазовыхОпций*Парам.ЗначениеСкидки/100;
		Иначе //сумма
			Данные.СуммаСкидки=Парам.ЗначениеСкидки
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры
