Процедура ЗагрузитьДанныеВРегистрМодуль() Экспорт
	
	Состав.Очистить();
	
	Метод = "{PostgreSQL Unicode(x64)}";
	Сервер = "10.9.0.83";
	Порт = "5432";
	БазаДанных = "trassir";
	LoginName = "postgres";
	LoginPassword = "postgres";
	
	Соединение = Новый COMОбъект("ADODB.Connection");
	
	СтрокаСоединения = "Driver="+Метод+";"+
	"server="+Сервер+";"+
	"Port="+Порт+";"+
	"Database="+БазаДанных+";"
	"UID="+LoginName+";"+
	"PWD="+LoginPassword+";";
	
	Соединение.ConnectionString = Соединение;
	
  	Попытка
		Соединение.Open(СтрокаСоединения);
	Исключение
		СМГ_Сообщить("Подключиться к SQL серверу не удалось. База: "+БазаДанных, СтатусСообщения.Важное);
		СМГ_Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
 		ЗапросВыполнен = Ложь;        
	КонецПопытки;
	
	Отказ = Истина;
	
	Если Соединение.State = 0 Тогда
		Connection=Неопределено;
 	Иначе
		Connection=Соединение;
		Отказ = Ложь;
	КонецЕсли;         
	
	Если Отказ Тогда
		СМГ_Сообщить("Не удалось соединиться с Базой TRASSIR. Обработка прервана.",СтатусСообщения.ОченьВажное);
 	КонецЕсли;
	
	СМГ_Сообщить("Подключение к базе TRASSIR прошло успешно.",СтатусСообщения.ОченьВажное);
	
	ИмяТаблицы = "public.auto_log";
	
	ТекстЗапроса = "SELECT channel, plate, time_enter, flags, best_guess FROM "+ИмяТаблицы+"";
  	
	Command =Новый COMОбъект("ADODB.Command");
	Command.ActiveConnection = Connection;
	
  	Попытка
		Command.CommandText = ТекстЗапроса;
		Выборка = Command.Execute();
		Если Выборка.BOF() = Ложь Тогда
			Выборка.MoveFirst();
			Счетчик = 0;
			Пока Выборка.EOF() = Ложь Цикл
				Если НЕ обЗначениеНеЗаполнено(Выборка.Fields("best_guess").Value) Тогда
					Счетчик = Счетчик + 1;
					СМГ_Сообщить( СокрЛП(Счетчик)+
							  "). channel = "+Выборка.Fields("channel").Value +
							  "; plate = "+Выборка.Fields("plate").Value +
							  "; time_enter = "+Выборка.Fields("time_enter").Value +
							  "; flags = "+Выборка.Fields("flags").Value +
							  "; best_guess = "+Выборка.Fields("best_guess").Value +
							  "; ДатаВремя = "+ВремяВМиллисекундахВДату1С(Выборка.Fields("time_enter").Value));
					НовСтрока = Состав.Добавить();
					НовСтрока.ГосНомер = Выборка.Fields("best_guess").Value;
					НовСтрока.ДатаВремя = ВремяВМиллисекундахВДату1С(Выборка.Fields("time_enter").Value);
					//Бондаренко++ 20230927
					//НовСтрока.Флаг = Выборка.Fields("flags").Value;
					Попытка
						НовСтрока.Флаг = ( (Число(Выборка.Fields("flags").Value)/4)-Цел((Число(Выборка.Fields("flags").Value)/4)) ) * 4;
 					Исключение
						//					
					КонецПопытки;
					//Бондаренко-- 20230927
				КонецЕсли;
				Выборка.MoveNext();
			КонецЦикла;
		КонецЕсли;
	Исключение
		СМГ_Сообщить("ОШИБКА! "+ОписаниеОшибки());
	КонецПопытки;  
	
	Состав.Сортировать("ДатаВремя");  
	
	Успешно = Ложь;
	
	//Бондаренко++ 20230530 Очистка временного регистра
	НаборЗаписей = РегистрыСведений.ПоследниеСобытияАвтомобилей.СоздатьНаборЗаписей(); 
 	НаборЗаписей.Записать();
	//Бондаренко-- 20230530
	
 	Для каждого Стр Из Состав Цикл
		Автомобиль = НайтиПоГосНомеру(Стр.ГосНомер);
		Если НЕ обЗначениеНеЗаполнено(Автомобиль) Тогда
			Стр.Автомобиль = Автомобиль;
			Если Стр.Флаг = 2 Тогда 
				Интервал = ПолучитьИнтервал(Стр.ДатаВремя,Автомобиль);
				Если Интервал > 0 И Интервал < 180 Тогда 
					СМГ_Сообщить("Для въезда слишком короткий интервал "+Интервал+" ; "+Стр.ДатаВремя+" по "+Автомобиль);
					Продолжить;
 				КонецЕсли;
				СМГ_Сообщить("Это въезд "+Стр.Флаг);
				Успешно = Въезд(Стр.ДатаВремя,Автомобиль,Стр.ГосНомер,Справочники.ДилерскиеЦентры.Автолига);
				ЗаписатьПоследнееСобытие(Стр.ДатаВремя,Автомобиль);
			ИначеЕсли Стр.Флаг = 1 Тогда 
				Интервал = ПолучитьИнтервал(Стр.ДатаВремя,Автомобиль);
				Если Интервал > 0 И Интервал < 180 Тогда
					СМГ_Сообщить("Для выезда слишком короткий интервал "+Интервал+" ; "+Стр.ДатаВремя+" по "+Автомобиль);
					Продолжить;
				КонецЕсли;
				СМГ_Сообщить("Это выезд "+Стр.Флаг);
				Успешно = Выезд(Стр.ДатаВремя,Автомобиль,Стр.ГосНомер,Справочники.ДилерскиеЦентры.Автолига);
				ЗаписатьПоследнееСобытие(Стр.ДатаВремя,Автомобиль);
   			КонецЕсли;
		Иначе
			СМГ_Сообщить("Автомобиль по госномеру не найден "+Стр.ГосНомер);
			АвтоНеНайден(Стр.ДатаВремя,Стр.ГосНомер,Справочники.ДилерскиеЦентры.Автолига,Стр.Флаг);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры //ЗагрузитьДанныеВРегистрМодуль()

Функция ПреобразоватьИзЛатВРус(ГосНомерЛат)

  	ГосНомерРус = ГосНомерЛат;
	ГосНомерРус = СтрЗаменить(ГосНомерРус,"a","А");
	ГосНомерРус = СтрЗаменить(ГосНомерРус,"b","В");
	ГосНомерРус = СтрЗаменить(ГосНомерРус,"c","С");
	ГосНомерРус = СтрЗаменить(ГосНомерРус,"d","");
	ГосНомерРус = СтрЗаменить(ГосНомерРус,"e","Е");
	ГосНомерРус = СтрЗаменить(ГосНомерРус,"f","Р");
	ГосНомерРус = СтрЗаменить(ГосНомерРус,"g","");
	ГосНомерРус = СтрЗаменить(ГосНомерРус,"h","Н");
	ГосНомерРус = СтрЗаменить(ГосНомерРус,"i","");
	ГосНомерРус = СтрЗаменить(ГосНомерРус,"j","");
	ГосНомерРус = СтрЗаменить(ГосНомерРус,"k","К");
	ГосНомерРус = СтрЗаменить(ГосНомерРус,"l","");
	ГосНомерРус = СтрЗаменить(ГосНомерРус,"m","М");
	ГосНомерРус = СтрЗаменить(ГосНомерРус,"n","");
	ГосНомерРус = СтрЗаменить(ГосНомерРус,"o","О");
	ГосНомерРус = СтрЗаменить(ГосНомерРус,"p","Р");
	ГосНомерРус = СтрЗаменить(ГосНомерРус,"q","");
	ГосНомерРус = СтрЗаменить(ГосНомерРус,"r","");
	ГосНомерРус = СтрЗаменить(ГосНомерРус,"s","");
	ГосНомерРус = СтрЗаменить(ГосНомерРус,"t","Т");
	ГосНомерРус = СтрЗаменить(ГосНомерРус,"v","");
	ГосНомерРус = СтрЗаменить(ГосНомерРус,"u","");
	ГосНомерРус = СтрЗаменить(ГосНомерРус,"w","");         
 	ГосНомерРус = СтрЗаменить(ГосНомерРус,"x","X");
	ГосНомерРус = СтрЗаменить(ГосНомерРус,"y","У");
	ГосНомерРус = СтрЗаменить(ГосНомерРус,"z","");
	
	ГосНомерРус = СокрЛП(СтрЗаменить(ГосНомерРус,Символы.ПС,"")); 
	
	Возврат ГосНомерРус;
	
КонецФункции // ПреобразоватьИзЛатВРус()	

Функция НайтиПоГосНомеру(ГосНомерЛат) Экспорт
	
	//Таких букв только 12 — А, В, Е, К, М, Н, О, Р, С, Т, У, Х
	
	Запрос = Новый Запрос;                                      
	
	ГосНомерРус = ПреобразоватьИзЛатВРус(ГосНомерЛат);
 	
	Если СтрДлина(ГосНомерРус)  >= 8 Тогда
		
		Запрос.Текст= "ВЫБРАТЬ ПЕРВЫЕ 1
		|	АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
		|	АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
		|	АвтомобилиСрезПоследних.Значение КАК ГосНомер
		|ИЗ
		|	РегистрСведений.Автомобили.СрезПоследних(, ) КАК АвтомобилиСрезПоследних
		|ГДЕ
		|	АвтомобилиСрезПоследних.Значение = &ГосНомер
		|	И АвтомобилиСрезПоследних.ВидЗначения = &ВидЗначения";
		
		Запрос.УстановитьПараметр("ВидЗначения",Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
		Запрос.УстановитьПараметр("ГосНомер",ГосНомерРус);
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		Если ТЗ.Количество() = 1 Тогда
			СМГ_Сообщить("Найден автомобиль "+ТЗ[0].Автомобиль);	
			Возврат ТЗ[0].Автомобиль;
		КонецЕсли;
		
		СМГ_Сообщить("ОШИБКА! Не найден автомобиль лат.№ "+ГосНомерЛат+" ; рус.№ "+ГосНомерРус,СтатусСообщения.ОченьВажное); 
		
	Иначе	
		СМГ_Сообщить("ОШИБКА! Слишком короткий русский номер получился из лат.№ "+ГосНомерЛат+" ; рус.№ "+ГосНомерРус,СтатусСообщения.ОченьВажное); 	
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // НайтиПоГосНомеру(ГосНомерЛат)

Функция ВремяВМиллисекундахВДату1С(UnixTime) Экспорт
	 
  	Дата_ = Дата(1970,1,1,0,0,0) + UnixTime/1000000 + 10800;
  	Возврат Дата_;
	
КонецФункции // ВремяВМиллисекундахВДату1С(unixtime)

Функция Въезд(Период,Автомобиль,ГосНомер,ДилерскийЦентрПриход) Экспорт
	
	Флаг = Истина;
	
	МенеджерЗаписи = РегистрыСведений.РегистрацияВремениАвтомобиля.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = Период;
	МенеджерЗаписи.Автомобиль = Автомобиль;
	МенеджерЗаписи.ГосНомер	= ГосНомер;
 	МенеджерЗаписи.ДилерскийЦентрПриход	= ДилерскийЦентрПриход;
	
	Попытка
		МенеджерЗаписи.Записать(Истина);
  	Исключение
		СМГ_Сообщить("ОШИБКА! Не удалось записать въезд для авто "+Автомобиль+" в "+Период,СтатусСообщения.ОченьВажное);	
		Флаг = Ложь;
	КонецПопытки; 
	
	Возврат Флаг;
  
КонецФункции // Въезд(Период,Автомобиль,ГосНомер,ДилерскийЦентрПриход)

Функция Выезд(ДатаВремяВыезда,Автомобиль,ГосНомер,ДилерскийЦентрУход) Экспорт
	
	ЗаписьНайдена = Ложь;
	Флаг = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрацияВремениАвтомобиляСрезПоследних.Автомобиль,
		|	РегистрацияВремениАвтомобиляСрезПоследних.ГосНомер,
		|	РегистрацияВремениАвтомобиляСрезПоследних.Период КАК Период,
		|	РегистрацияВремениАвтомобиляСрезПоследних.ДатаВремяВыезда,
		|	РегистрацияВремениАвтомобиляСрезПоследних.ДилерскийЦентрПриход,
		|	РегистрацияВремениАвтомобиляСрезПоследних.ДилерскийЦентрУход,
		|	РегистрацияВремениАвтомобиляСрезПоследних.Продолжительность
		|ИЗ
		|	РегистрСведений.РегистрацияВремениАвтомобиля.СрезПоследних КАК РегистрацияВремениАвтомобиляСрезПоследних
		|ГДЕ
		|	РегистрацияВремениАвтомобиляСрезПоследних.Автомобиль = &Автомобиль
		|	И РегистрацияВремениАвтомобиляСрезПоследних.ГосНомер = &ГосНомер
		|	И РегистрацияВремениАвтомобиляСрезПоследних.Период <= &ДатаВыезда
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ"; 
	
	Запрос.УстановитьПараметр("Автомобиль",Автомобиль);
	Запрос.УстановитьПараметр("ГосНомер",ГосНомер); 
	Запрос.УстановитьПараметр("ДатаВыезда",ДатаВремяВыезда);
	
	РезультатЗапроса = Запрос.Выполнить();
 
    Записи = РезультатЗапроса.Выбрать();
 
	Пока Записи.Следующий() Цикл
		
		ЗаписьНайдена = Истина;
		
		МенеджерЗаписи = РегистрыСведений.РегистрацияВремениАвтомобиля.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = Записи.Период;
		МенеджерЗаписи.Автомобиль = Записи.Автомобиль;
		МенеджерЗаписи.ГосНомер	= Записи.ГосНомер;
		МенеджерЗаписи.ДилерскийЦентрПриход	= Записи.ДилерскийЦентрПриход;
		МенеджерЗаписи.ДилерскийЦентрУход	= Записи.ДилерскийЦентрУход;
		МенеджерЗаписи.ДатаВремяВыезда = ДатаВремяВыезда;
		МенеджерЗаписи.Продолжительность = ( МенеджерЗаписи.ДатаВремяВыезда - МенеджерЗаписи.Период ) / 3600;
		
		Попытка
			МенеджерЗаписи.Записать(Истина);
 		Исключение
			СМГ_Сообщить("ОШИБКА! Не удалось записать выезд для авто "+Автомобиль+" при выезде в "+ДатаВремяВыезда,СтатусСообщения.ОченьВажное);	
			Флаг = Ложь;
		КонецПопытки;
		
		Прервать;
		
	КонецЦикла;
	
	Если НЕ ЗаписьНайдена Тогда
		
		Флаг = Истина;
		
		МенеджерЗаписи = РегистрыСведений.РегистрацияВремениАвтомобиля.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ДатаВремяВыезда;
		МенеджерЗаписи.Автомобиль = Автомобиль;
		МенеджерЗаписи.ГосНомер	= ГосНомер;
		МенеджерЗаписи.ДилерскийЦентрПриход	= ДилерскийЦентрУход;
		МенеджерЗаписи.ДилерскийЦентрУход	= ДилерскийЦентрУход;
		МенеджерЗаписи.ДатаВремяВыезда = ДатаВремяВыезда;
		МенеджерЗаписи.Продолжительность = 0;
		
		Попытка
			МенеджерЗаписи.Записать(Истина);
 		Исключение
			СМГ_Сообщить("ОШИБКА! Не удалось записать въезд-выезд для авто "+Автомобиль+" в "+ДатаВремяВыезда,СтатусСообщения.ОченьВажное);	
			Флаг = Ложь;
		КонецПопытки; 
		
 	КонецЕсли;
	
	Возврат Флаг;
   
КонецФункции // Выезд(Период,Автомобиль,ГосНомер,ДилерскийЦентрПриход)

Процедура АвтоНеНайден(ДатаВремя,ГосНомерЛат,ДилерскийЦентр,Флаг) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.НераспознанныеАвтомобили.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период         = ДатаВремя;
	МенеджерЗаписи.ГосНомерЛат	  = ГосНомерЛат;
	МенеджерЗаписи.ДилерскийЦентр = ДилерскийЦентр; 
	МенеджерЗаписи.ГосНомерРус    = ПреобразоватьИзЛатВРус(ГосНомерЛат);
	Если Флаг = 536870946 Тогда 
		МенеджерЗаписи.Направление=Истина;
	Иначе
		МенеджерЗаписи.Направление=Ложь;
	КонецЕсли;	
	
	Попытка
		МенеджерЗаписи.Записать(Истина);
	Исключение
		СМГ_Сообщить("ОШИБКА! Не удалось создать запись по ненайденному авто для даты-времени "+ДатаВремя+" по лат.госномеру "+ГосНомерЛат+" в ДЦ "+ДилерскийЦентр,СтатусСообщения.ОченьВажное);	
	КонецПопытки;
	
КонецПроцедуры // АвтоНеНайден(ДатаВремяВыезда,ГосНомер,ДилерскийЦентр)

//Бондаренко++ 20230530
Процедура ЗаписатьПоследнееСобытие(ДатаВремя,Автомобиль)

	МенеджерЗаписи = РегистрыСведений.ПоследниеСобытияАвтомобилей.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период     = ДатаВремя;
	МенеджерЗаписи.Автомобиль = Автомобиль;
 	
	Попытка
		МенеджерЗаписи.Записать(Истина);
	Исключение
		СМГ_Сообщить("ОШИБКА! Не удалось записать последнее событие "+ДатаВремя+" по "+Автомобиль,СтатусСообщения.ОченьВажное);	
	КонецПопытки;
 
КонецПроцедуры 

Функция ПолучитьИнтервал(ДатаВремя,Автомобиль)
	
	Интервал = 0;
	
 	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоследниеСобытияАвтомобилейСрезПоследних.Период,
		|	ПоследниеСобытияАвтомобилейСрезПоследних.Автомобиль
		|ИЗ
		|	РегистрСведений.ПоследниеСобытияАвтомобилей.СрезПоследних КАК ПоследниеСобытияАвтомобилейСрезПоследних
		|ГДЕ
		|	ПоследниеСобытияАвтомобилейСрезПоследних.Автомобиль = &Автомобиль";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Интервал = ДатаВремя - ВыборкаДетальныеЗаписи.Период;
		Прервать;
	КонецЦикла;
	
	Возврат Интервал;

КонецФункции // ПолучитьИнтервал(ДатаВремя,Автомобиль)

//Бондаренко-- 20230530
