
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МассивВариантов") Тогда
	
		 Для каждого ТекущийВариант Из Параметры.МассивВариантов Цикл
		 
			НоваяСтрока = ТаблицаВариантов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекущийВариант);
		 
		 КонецЦикла;
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ВыдачиКарты" 
		И Параметр = ЭтаФорма Тогда
	
		Закрыть();
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	СтруктураДанных = Новый Структура("ПрограммаЛояльности,Контрагент,ВидКарты,Номинал,ВидОперации,Статус,Дата,ЗаказНаряд");
	
	Выбран = Ложь;
	
	Для каждого ТекущаяСтрока Из ТаблицаВариантов Цикл
	
		Если ТекущаяСтрока.Выбрать Тогда
			
			ЗаполнитьЗначенияСвойств(СтруктураДанных,ТекущаяСтрока);
			Выбран = Истина;
			
		КонецЕсли; 
	
	КонецЦикла; 
	
	Если Выбран Тогда
		
		ПараметрыФормы = Новый Структура("ДанныеПоВыдачеНовойКарты,ЗакрыватьПриЗакрытииВладельца",СтруктураДанных,Ложь);
		
		ОткрытьФорму("Документ.DMS_ВыдачаКартыЛояльности.Форма.ФормаДокумента",ПараметрыФормы,ЭтаФорма);
				
	Иначе 
		Предупреждение("Выберите вид карты!",15,"Не выбран вид карты");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВариантовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВариантовПередУдалением(Элемент, Отказ)
	Отказ = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВариантовВыбратьПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаВариантов.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если Не ТекущаяСтрока.Выбрать Тогда
		Возврат;
	КонецЕсли; 
	
	Для каждого СтрокаТаблицы Из ТаблицаВариантов Цикл
	
		Если СтрокаТаблицы = ТекущаяСтрока Тогда
			Продолжить;
		КонецЕсли; 		
		
		СтрокаТаблицы.Выбрать = Ложь;
		
	КонецЦикла; 
	
КонецПроцедуры
