
Процедура ВыгрузкаПоступленийАвтоОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт //подписка на событие проведение
	
	Если ПараметрыСеанса.DMS_Бренд<>Справочники.CRM_МаркаАвтомобиля.LADA Тогда Возврат КонецЕсли;
	
	ВремRenault_ПраваПользователя = Renault_РаботаСПравамиПользователя.ПолучитьСписокПрав(Источник.Автор);
	
	Массив=Новый Массив;
	Для Каждого Стр Из Источник.Автомобили Цикл
		Массив.Добавить(Новый Структура("arrivaldate,no,dealer_inn,dealer_filial,dealer_name,vin,firstarrival,guid_arrival,guid_delivery,notes,oper_type,dealer_bir_code",
			Источник.Дата,
			Источник.Номер,
			СокрЛП(Источник.Организация.ИНН),
			СокрЛП(ПараметрыСеанса.Renault_ПраваПользователя.ДилерскийЦентр.BIR),
			ПараметрыСеанса.Renault_ПраваПользователя.ДилерскийЦентр.НаименованиеДляПечати,
			Стр.VIN,
			?(Источник.Контрагент.ВидКонтрагента=Перечисления.ВидыКонтрагентов.Поставщик,1,0),
			Строка(Источник.Ссылка.УникальныйИдентификатор())+"|"+Стр.НомерСтроки,
			"",
			Источник.Комментарий,
			1,
			СокрЛП(ВремRenault_ПраваПользователя.ДилерскийЦентр.BIR)
		));
	КонецЦикла;	
	
	Если Не LADA_Services.ПередачаДанных("LADA_Services.arrivalAuto",Массив) Тогда
		Сообщить("Произошла ошибка при выгрузке информации в АвтоВАЗ. Повторите, пожалуйста, попытку.");
		Отказ=Истина
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузкаПоступленийАвтоОтменаПроведения(Источник, Отказ) Экспорт
	
	Если ПараметрыСеанса.DMS_Бренд<>Справочники.CRM_МаркаАвтомобиля.LADA Тогда Возврат КонецЕсли;
	ВремRenault_ПраваПользователя = Renault_РаботаСПравамиПользователя.ПолучитьСписокПрав(Источник.Автор);
	Массив=Новый Массив;
	Для Каждого Стр Из Источник.Автомобили Цикл
		Массив.Добавить(Новый Структура("arrivaldate,no,dealer_inn,dealer_filial,dealer_name,vin,firstarrival,guid_arrival,guid_delivery,notes,oper_type,dealer_bir_code",
			Источник.Дата,
			Источник.Номер,
			СокрЛП(Источник.Организация.ИНН),
			СокрЛП(ПараметрыСеанса.Renault_ПраваПользователя.ДилерскийЦентр.BIR),
			ПараметрыСеанса.Renault_ПраваПользователя.ДилерскийЦентр.НаименованиеДляПечати,
			Стр.VIN,
			?(Источник.Контрагент.ВидКонтрагента=Перечисления.ВидыКонтрагентов.Поставщик,1,0),
			Строка(Источник.Ссылка.УникальныйИдентификатор())+"|"+Стр.НомерСтроки,
			"",
			Источник.Комментарий,
			0,
			СокрЛП(ВремRenault_ПраваПользователя.ДилерскийЦентр.BIR)
		));
	КонецЦикла;	
	
	Если Не LADA_Services.ПередачаДанных("LADA_Services.arrivalAuto",Массив) Тогда
		Сообщить("Произошла ошибка при выгрузке информации в АвтоВАЗ. Повторите, пожалуйста, попытку.");
		Отказ=Истина
	КонецЕсли;
	
КонецПроцедуры


Процедура ВыгрузкаРеализацийАвтоОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	//Если ПараметрыСеанса.DMS_Бренд<>Справочники.CRM_МаркаАвтомобиля.LADA Тогда Возврат КонецЕсли;
	//Если Источник.Контрагент.ФормаСобственности<>Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда Возврат КонецЕсли;
	//
	//Массив=Новый Массив;
	//Для Каждого Стр Из Источник.Автомобили Цикл
	//	Массив.Добавить( Новый Структура("PSA_DATE,PSA_NO,DEALER_INN,DEALER_FILIAL,VIN,PRICE,SELLER_INN,SELLER_FILIAL,GUID_DELIVERY",
	//		Источник.Дата,
	//		Источник.Номер,
	//		Источник.Контрагент.ИНН,
	//		Источник.Контрагент.ИНН, //ПараметрыСеанса.Renault_ПраваПользователя.ДилерскийЦентр.BIR,
	//		Стр.Автомобиль.VIN,
	//		Стр.СуммаВсего,
	//		Источник.Организация.ИНН,
	//		ПараметрыСеанса.Renault_ПраваПользователя.ДилерскийЦентр.BIR,
	//		Строка(Источник.Ссылка.УникальныйИдентификатор())
	//	));
	//КонецЦикла;	
	//
	//Если ПередачаДанных("LADA_Services.departureAuto",Массив) Тогда
	//	//Отказ=Истина
	//КонецЕсли;
	
	Если ПараметрыСеанса.DMS_Бренд<>Справочники.CRM_МаркаАвтомобиля.LADA Тогда Возврат КонецЕсли;
	Если Источник.Контрагент.ФормаСобственности<>Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда Возврат КонецЕсли;
		
	Массив=Новый Массив;
	Для Каждого Стр Из Источник.Автомобили Цикл
		Договор=Источник.ДоговорВзаиморасчетов;
		Паспорт=Паспорт(Источник.Контрагент);
		Телефон=Телефон(Источник.Контрагент);
		Email=Email(Источник.Контрагент);
		
		Структура=Новый Структура;
		Структура.Вставить("OPER_TYPE",1); //Тип операции. 1-создание новой записи продажи, 0-анулирование записи продажи.
		Структура.Вставить("VIN",Стр.Автомобиль.VIN);
		Структура.Вставить("GUID_ARRIVAL",UID_Поступление(Стр.Автомобиль.VIN,Источник.Дата)); //идентификатор поступления
		Структура.Вставить("GUID_DELIVERY",UID_Реализация(Стр.Автомобиль.VIN,Источник.Дата)); //идентификатор реализации
		Структура.Вставить("GUID_DISTRICT","_"); //код региона покупателя
		Структура.Вставить("ACTIONTYPE_CODE","_"); //идентификатор скидки
		Структура.Вставить("PAYTYPE_CODE","51");
		Структура.Вставить("SSDATE",Источник.Дата); 
		Структура.Вставить("SSNO",Источник.Номер);
		Структура.Вставить("PSADATE",Источник.Дата);
		Структура.Вставить("PSANO",Источник.Номер);
		//Структура.Вставить("PRICE",Стр.СуммаВсего);
		Структура.Вставить("PRICE",Renault_ОбщегоНазначения.ПолучитьЦенуБазовойКомплектацииПоТарифу(Стр.Автомобиль.VIN, Ложь));
		Структура.Вставить("GTDATE",дата(2001,1,1));
		Структура.Вставить("SALESMAN_FIO",Источник.Менеджер.Наименование);
		Структура.Вставить("CUSTOMER_INN",Источник.Контрагент.ИНН);
		Структура.Вставить("CUSTOMER_NAME",Источник.Контрагент.Наименование);
		Структура.Вставить("CUSTOMER_ADDRESS",Адрес(Источник.Контрагент));
		Структура.Вставить("CUSTOMER_FIO",Источник.Контрагент.наименование);
		Структура.Вставить("PASDATE",Дата(2001,1,1));
		Структура.Вставить("PASNO","_");
		Структура.Вставить("PASOVD","_");
		Структура.Вставить("PASSERIA","_");
		Структура.Вставить("CUSTOMER_PHONE","_");
		Структура.Вставить("CUSTOMER_MOPHONE","_");
		Структура.Вставить("CUSTOMER_EMAIL","_");
		Структура.Вставить("RITEMNO","_");
		Структура.Вставить("CORPORATIONREC",0); //Признак продажи корпоративным клиентам (0 - нет, 1 - корпоративным клиентам)
		Структура.Вставить("LADAFINANCEREC",0);
		Структура.Вставить("CREDITREC",0); //Признак продажи  в кредит  (0 - нет, 1 - в кредит)
		Структура.Вставить("SALEREC",1); //Признак продажи за наличные  (0 - нет, 1 - за наличные)
		Структура.Вставить("SOGLASIEREC",СогласиеНаОбработкуПерсональныхДанных(Источник.Контрагент)); //Признак Согласие покупателя на обработку персональных данных и участие в опросах.  (0 - нет, 1 - согласен)
		Структура.Вставить("LADAASSISTANCE","КАРТА НЕ ВЫДАВАЛАСЬ"); //Номер карты LADA Assistance. Если карта не выдана написать КАРТА НЕ ВЫДАВАЛАСЬ
		Структура.Вставить("LADAINSURANCE",0); //Признак продажи по программе LADA INSURANCE. (0 - нет, 1 - LADA INSURANCE)
		Структура.Вставить("FLAG_UTIL",0); //Признак договор по утилизации (0 - нет, 1 - утилизация)
		Структура.Вставить("FLAG_TRADEIN",0); //Признак договор trade-in (0 - нет, 1 - trade-in)
		Структура.Вставить("PRIZN_PO_SUDU",0); //Признак оформления продажи по решению суда (0 - нет, 1 - решение суда)
		Структура.Вставить("GUID_SALESMAN",Строка(Источник.Менеджер.УникальныйИдентификатор())); //Признак оформления продажи по решению суда (0 - нет, 1 - решение суда)
		
		Массив.Добавить(Структура);
	КонецЦикла;	
	
	Если LADA_Services.ПередачаДанных("LADA_Services.deliveryAuto",Массив) Тогда
		//Отказ=Истина
	КонецЕсли;
	
КонецПроцедуры

Функция Паспорт(Контрагент)
	
	Запрос=Новый Запрос("Выбрать Ссылка ИЗ Справочник.ПодтверждающиеДокументы ГДЕ Владелец=&Контрагент И НЕ Устаревший И НЕ ПометкаУдаления");
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Выборка=Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(),Новый Структура("Дата,Номер,Серия,Выдан",Выборка.Ссылка.ДатаВыдачи,Выборка.Ссылка.Номер,Выборка.Ссылка.Серия,Выборка.Ссылка.КемВыдан),Новый Структура("Дата,Номер,Серия,Выдан",Дата(1,1,1),"","",""))
	
КонецФункции

Функция Телефон(Контрагент)
	Запрос=Новый Запрос("Выбрать Первые 1 Представление Из РегистрСведений.КонтактнаяИнформация ГДЕ Объект=&Контрагент И Тип=Значение(Перечисление.ТипыКонтактнойИнформации.Телефон) Упорядочить По ЗначениеПоУмолчанию Убыв");
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Выборка=Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(),Выборка.Представление,"")
КонецФункции	

Функция Email(Контрагент)
	Запрос=Новый Запрос("Выбрать Первые 1 Представление Из РегистрСведений.КонтактнаяИнформация ГДЕ Объект=&Контрагент И Тип=Значение(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты) Упорядочить По ЗначениеПоУмолчанию Убыв");
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Выборка=Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(),Выборка.Представление,"")
КонецФункции	

Функция Адрес(Контрагент)
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.Текст="
	|Выбрать Первые 1
	|	Представление
	|ИЗ(
	|	Выбрать Первые 1 Представление, 1 Порядок Из РегистрСведений.КонтактнаяИнформация 
	|	ГДЕ Объект=&Контрагент И ЗначениеПоУмолчанию 
	|	И Вид В(Значение(Справочник.ВидыКонтактнойИнформации.АдресИностранный),
	|			Значение(Справочник.ВидыКонтактнойИнформации.АдресПочтовый),
	|			Значение(Справочник.ВидыКонтактнойИнформации.АдресФактический),
	|			Значение(Справочник.ВидыКонтактнойИнформации.АдресЮридический))
	|	Объединить
	|	Выбрать Первые 1 Представление, 2 Порядок Из РегистрСведений.КонтактнаяИнформация 
	|	ГДЕ Объект=&Контрагент 
	|	И Вид В(Значение(Справочник.ВидыКонтактнойИнформации.АдресИностранный),
	|			Значение(Справочник.ВидыКонтактнойИнформации.АдресПочтовый),
	|			Значение(Справочник.ВидыКонтактнойИнформации.АдресФактический),
	|			Значение(Справочник.ВидыКонтактнойИнформации.АдресЮридический))
	|)ЗП
	|Упорядочить По Порядок
	|";	
	Выборка=Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Представление
КонецФункции

Функция UID_Поступление(VIN,Дата)
	Запрос=Новый Запрос("Выбрать Первые 1 Ссылка Из Документ.ПоступлениеАвтомобилей.Автомобили ГДЕ VIN=&VIN И Ссылка.Дата<=КонецПериода(&Дата,День) Упорядочить По Ссылка.Дата Убыв");
	Запрос.УстановитьПараметр("VIN",VIN);
	Запрос.УстановитьПараметр("Дата",Дата);
	Выборка=Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(),Выборка.Ссылка.УникальныйИдентификатор(),"")
КонецФункции

Функция UID_Реализация(VIN,Дата)
	Запрос=Новый Запрос("Выбрать Первые 1 Ссылка Из Документ.РеализацияАвтомобилей.Автомобили ГДЕ Автомобиль.VIN=&VIN И Ссылка.Дата<=КонецПериода(&Дата,День) Упорядочить По Ссылка.Дата Убыв");
	Запрос.УстановитьПараметр("VIN",VIN);
	Запрос.УстановитьПараметр("Дата",Дата);
	Выборка=Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(),Выборка.Ссылка.УникальныйИдентификатор(),"")
КонецФункции

Функция СогласиеНаОбработкуПерсональныхДанных(Контрагент)
	Возврат ?(Контрагент.СогласиеНаОбработкуПерсональныхДанных=Перечисления.ВариантыОтветов.Да,1,0);
КонецФункции

Процедура ОткрытьРеестрДоговоровНаУтилизацию() Экспорт
	#Если Клиент Тогда
	ОткрытьФорму("Документ.Renault_Договор.Форма.ФормаРеестраУтилизаций");
	#КонецЕсли
КонецПроцедуры

