
// Формирует штрих-код в формате EAN-13 ЗаказНаряда и Исполнителя
//
// Параметры:
//  ЗаказНаряд, Исполнитель
//
// Возвращаемое значение:
//  ШтрихКод
Функция СформироватьНовыйШтрихКод() Экспорт
	ОбработкаШтрихКоды = Обработки.ШтрихКоды.Создать();
	
	НовыйКод = "";
	К = 10;	//Для невесового товара длина штрихкода 12 (2 - префикс)
	ПрефиксКода = Константы.ПрефиксШтучногоШК.Получить();
	НовыйКод = ОбработкаШтрихКоды.EAN13(Строка(ПрефиксКода) + СтрокаПривести(ОбработкаШтрихКоды.СформироватьПроизвольныйКод(К), "0", 10, 2));
	
	СчПопыток=0;
	Пока НЕ ШтрихКодУникален(НовыйКод) Цикл
		НовыйКод = ОбработкаШтрихКоды.EAN13(Строка(ПрефиксКода) + СтрокаПривести(ОбработкаШтрихКоды.СформироватьПроизвольныйКод(К), "0", 10, 2));
		СчПопыток = СчПопыток + 1;
		Если СчПопыток = 100 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НовыйКод;    
КонецФункции // СформироватьШтрихКод()

// Функция, приводящая строку к необходимой длине строки символом
//
// Параметры:
//  Реж    - число -  1 - добавлять символы слева, 2 - справа, 3 - слева и справа
//  Стр    - строка которую редактируем,
//  Символ - символ, который вставляем,
//  Длина  - Число - длина до которой приводим.
//
// Возвращаемое значение:
//  Стр - строка - результат редактирования строки.
//
Функция СтрокаПривести(Стр, Символ, Длина, Реж=1)
	ДопСтр = "";
	Сч = Длина - СтрДлина(Стр);
	Если Сч > 0  Тогда
		Для к = 1 По Сч Цикл
			ДопСтр = ДопСтр + Символ;
		КонецЦикла;
		
		Если Реж=1 Тогда Возврат ДопСтр+Стр;
		ИначеЕсли Реж=2 Тогда Возврат Стр+ДопСтр;
		Иначе к=Окр(Сч/2); Возврат Лев(ДопСтр,к)+Стр+Прав(ДопСтр,Сч-к);
		КонецЕсли;
		
	Иначе Возврат Стр;
	КонецЕсли;
КонецФункции // СтрокаПривести()

// Функция проверяет уникальность штрихкода
//
// Параметры
//  <ШтрихКод>  – Проверяемый штрихкод
//                 <продолжение описания параметра>
// Возвращаемое значение:
//  Истина - если код уникальный
//  Ложь   - если код неуникальный
Функция ШтрихКодУникален(ШтрихКод)
	Если ПустаяСтрока(ШтрихКод) Тогда
		Возврат Истина; // проверять нечего, говорим что все Ок
	КонецЕсли;
	// первый шаг. Проверим уникальность ШК в регистре
	Запрос = Новый Запрос();
    Запрос.УстановитьПараметр("ШтрихКод", ШтрихКод);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИсполнителиПоЗаказНарядам.ШтрихКод
	               |ИЗ
	               |	РегистрСведений.ИсполнителиПоЗаказНарядам КАК ИсполнителиПоЗаказНарядам
	               |ГДЕ
	               |	ИсполнителиПоЗаказНарядам.ШтрихКод = &ШтрихКод";

	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Пустой();
КонецФункции // ШтрихКодУникален()

