Функция Renault_ПолучитBIRДляГарантии(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_ДополнительныеСвойстваОрганизации.BIRГарантия
	               |ИЗ
	               |	РегистрСведений.Renault_ДополнительныеСвойстваОрганизации КАК Renault_ДополнительныеСвойстваОрганизации
	               |ГДЕ
	               |	Renault_ДополнительныеСвойстваОрганизации.Организация = &Организация";
				   
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.BIRГарантия;
		
	Иначе
		
		ВызватьИсключение("Внимание! Для Организации: " + Строка(Организация) + " незаполнен BIR номер для гарантии."); 
		
	КонецЕсли;
	
КонецФункции