Функция ПолучитьКоличествоVIN (Статус) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ЕСТЬNULL(СостоянияVINВЗаявках.VIN, 0)) КАК Количество
	|ИЗ
	|	РегистрСведений.Renault_СостоянияVINВЗаявках КАК СостоянияVINВЗаявках
	|ГДЕ
	|	СостоянияVINВЗаявках.Статус в (&Статус)";
	Запрос.УстановитьПараметр("Статус", Статус);
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	Возврат Результат.Количество;
КонецФункции

Функция ПолучитьКоличествоЗаявок (Статус) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(СостоянияVINВЗаявках.Заявка, 0)) КАК Количество
	|ИЗ
	|	РегистрСведений.Renault_СостоянияVINВЗаявках КАК СостоянияVINВЗаявках
	|ГДЕ
	|	СостоянияVINВЗаявках.Статус = &Статус";
	Запрос.УстановитьПараметр("Статус", Статус);
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	Возврат Результат.Количество;
КонецФункции
