
&НаКлиенте
Процедура ВыбратьФайл(Команда)
	
	АдресВременногоХранилища = Renault_РекламацииКлиент.ВыбратьФайлДляРекламации(ЭтаФорма);
	
КонецПроцедуры

// Трояновский К.Е. 22.05.2019 11:13:40 {

// Процедура - Выбрать файлы
//
&НаКлиенте
Процедура ВыбратьФайлы(Команда)
	
	Renault_РекламацииКлиент.ВыбратьФайлыДляРекламации(ЭтаФорма);
	
КонецПроцедуры // ВыбратьФайлы()

// Процедура - Загрузить файлы в базу
//
&НаКлиенте
Процедура ЗагрузитьФайлыВБазу(Команда)
	
	ДатаЗаписи = ТекущаяДата();
	
	Для Каждого СтрокаФайл Из ТаблицаФайловДляЗагрузки Цикл
	
		ИдентификаторВХранилище = Renault_РекламацииКлиент.ПоместитьФайлыДляРекламации(ЭтаФорма, СтрокаФайл.ОписаниеФайла, СтрокаФайл.АдресВоВременномХранилище, СтрокаФайл.НаименованиеФайла, СтрокаФайл.Расширение);
		
		Если ЗначениеЗаполнено(ИдентификаторВХранилище) тогда //Файл записался удачно
			
			//Добавляем новую строку
			НС = КартинкиИФайлы.Добавить();
			
			НС.ИмяФайла		  = СтрокаФайл.НаименованиеФайла + "." + СтрокаФайл.Расширение;
			НС.Идентификатор  = ИдентификаторВХранилище;
			НС.ДатаСохранения = ТекущаяДата();
			НС.Комментарий	  = СтрокаФайл.ОписаниеФайла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗагрузитьФайлыВБазу()

// Трояновский К.Е. 22.05.2019 11:13:40 }

&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	
	ДатаЗаписи = ТекущаяДата();
	ИдентификаторВХранилище = Renault_РекламацииКлиент.ПоместитьФайлДляРекламации(ЭтаФорма);
	
	Если ЗначениеЗаполнено(ИдентификаторВХранилище) тогда //Файл записался удачно
		
		//Добавляем новую строку
		НС = КартинкиИФайлы.Добавить();
		
		НС.ИмяФайла		  = НаименованиеФайла;
		НС.Идентификатор  = ИдентификаторВХранилище;
		НС.ДатаСохранения = ТекущаяДата();
		НС.Комментарий	  = ОписаниеФайла;
		
		АдресВременногоХранилища = "";
		НаименованиеФайла = "";
		РасширениеФайла = "";
		ОписаниеФайла = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Расчитаем максимальный размер
	МаксимальныйРазмер = 4 * 1024 *1024; //4 мегабайта
	КартинкиИФайлы.Загрузить(Параметры.КартинкиИФайлы.Выгрузить());
	
	ВладелецСсылка = Параметры.ВладелецСсылка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Оповестить("ОбновитьКартинкиИФайлы", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
//+Оформление	
	Массив=Новый Массив;
	Массив.Добавить(Элементы.ОК);
	Renault_ОбщиеФункции.МультибрендОсновноеОформление(Массив);
//-Оформление	
КонецПроцедуры
