
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	Если НЕ Приход и НЕ Расход Тогда
		Сообщить("Необходимо указать вид движения: приход ДС или расход ДС!");
		Отказ = Истина;
	КонецЕсли;

 	Если Не Отказ Тогда
		Движения.ВзаиморасчетыПоЗадаткам.Записывать = Истина;
		Движения.ВзаиморасчетыПоЗадаткам.Очистить();
		НаборЗаписей = Движения.ВзаиморасчетыПоЗадаткам;
		СтрокаЗаписи = НаборЗаписей.Добавить();
		СтрокаЗаписи.Активность = Истина;
		Если Приход Тогда
			СтрокаЗаписи.ВидДвижения = ВидДвиженияНакопления.Приход;
		Иначе
			СтрокаЗаписи.ВидДвижения = ВидДвиженияНакопления.Расход;
		КонецЕсли;	
		СтрокаЗаписи.Организация = Организация;
		СтрокаЗаписи.Подразделение = Подразделение;
		СтрокаЗаписи.Регистратор = Ссылка;
		СтрокаЗаписи.Контрагент = Контрагент;
		СтрокаЗаписи.ДоговорКонтрагента = ДоговорКонтрагента;
		СтрокаЗаписи.Период = ДатаЗадатка;
		СтрокаЗаписи.СуммаЗадатка = СуммаЗадатка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	//Бондаренко++ 20190829
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
 	КонецЕсли; 
 	//Бондаренко-- 20190829
	
	Организация = ДанныеЗаполнения.Организация;
	СуммаЗадатка = ДанныеЗаполнения.СуммаДокумента;
	Подразделение = ДанныеЗаполнения.ПодразделениеКомпании;
	Контрагент = ДанныеЗаполнения.Контрагент;
	ДоговорКонтрагента = ДанныеЗаполнения.ДоговорВзаиморасчетов;
	Менеджер = ДанныеЗаполнения.Автор;
	Автор = ПараметрыСеанса.Пользователь;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		Приход = Истина;
	Иначе
		Расход = Истина;
	КонецЕсли;	
 	
КонецПроцедуры
