#Область ИнформацияОДокументе

//************************//
// ИНФОРМАЦИЯ О ДОКУМЕНТЕ //
//************************//

// Возвращает доступные варианты печати документа
// Параметры:
//	ДокументСсылка - Ссылка на документ печать
// Возвращаемое значение:
//	Структура, каждая строка которой соответствует одному из вариантов печати. Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм(ДокументСсылка) Экспорт
	
	СтруктураМакетов = Новый Структура();
	СтруктураМакетов.Вставить("РеализацияТоваров" , "Расходная накладная");
	СтруктураМакетов.Вставить("ПодборочныйЛист"   , "Подборочный лист");
	СтруктураМакетов.Вставить("ТОРГ12"            , "ТОРГ-12 (Товарная накладная)");
	СтруктураМакетов.Вставить("Т1"                , "1-Т (Товарно-транспортная накладная)");
	СтруктураМакетов.Вставить("Приложение4"       , "Приложение №4 (Транспортная накладная)");
	СтруктураМакетов.Вставить("ЭтикетокИЦенников" , "Печать этикеток и ценников");
	СтруктураМакетов.Вставить("М15"               , "М-15 (Накладная на отпуск материавлов на сторону)");
	СтруктураМакетов.Вставить("УПД"               , "Универсальный передаточный документ");
	СтруктураМакетов.Вставить("АктОбОказанииУслуг", "Акт об оказании услуг");
	
	//Бондаренко++ 20201203
	Если ДокументСсылка.МежскладскиеПеремещения Тогда
 		СтруктураМакетов.Вставить("ДляОптовика"  , "Для оптовика");
   	КонецЕсли; 
	//Бондаренко-- 20201203
 	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСписокПечатныхФорм()

#КонецОбласти