   // Модуль документа РеализацияТоваров

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем тКэшСуммСписания Экспорт;     // Переменная для кэширования результатов вычисления суммы списания
Перем ИмяРеквизитаКода Экспорт;     // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/артикула в ТЧ
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования
Перем ОбработкаРасчетСкидок Экспорт; // Переменная для хранения ссылки на обработку "Расчет скидок". Данная обработка содержит необходимые
// свойства и методы для расчета скидок документа.

//Бондаренко++ 20260307
Перем ДеньЭрЭл ;
//Бондаренко++ 20260307

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА
 
// Заполняет на основании заказа
//
// Параметры:
//  ЗаказПокупателя - ДокументСсылка.
//
Процедура ЗаполнитьРезервамиКонтрагента(ЗаказПокупателя) Экспорт
	
  	Если обЗначениеНеЗаполнено(ЗаказПокупателя) Тогда
 			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ЗаказыПокупателейОстатки.Номенклатура,
			|	ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры,
 			|	СУММА(ВЫБОР
			|		КОГДА ЗаказыПокупателейОстатки.СкладКомпании = &СкладКомпании ТОГДА
			|			ЗаказыПокупателейОстатки.РезервОстаток
			|		ИНАЧЕ
			|			0
			|	КОНЕЦ) КАК Количество,
 			|	СУММА(ЗаказыПокупателейОстатки.СуммаУпрОстаток) КАК СуммаУпр,
			|	СУММА(ЗаказыПокупателейОстатки.СуммаОстаток) КАК Сумма,
			|	СУММА(ЗаказыПокупателейОстатки.ЗаказаноОстаток) КАК Заказано
			|ИЗ
			|	РегистрНакопления.ЗаказыПокупателей.Остатки("+?(Ссылка.Пустая(),"","&НаМомент")+",Контрагент = &Контрагент И (СкладКомпании = &СкладКомпании ИЛИ СкладКомпании = Заказ.СкладКомпании)) КАК ЗаказыПокупателейОстатки
			|СГРУППИРОВАТЬ ПО
			|	ЗаказыПокупателейОстатки.Номенклатура,
			|	ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры
 			|ИМЕЮЩИЕ
			|	СУММА(ВЫБОР
			|		КОГДА ЗаказыПокупателейОстатки.СкладКомпании = &СкладКомпании ТОГДА
			|			ЗаказыПокупателейОстатки.РезервОстаток
			|		ИНАЧЕ
			|			0
			|	КОНЕЦ) > 0 ");
			
 		Запрос = СМГ_ЗапросПриНеМенятьПорядокСтрок(Запрос);	
  
		Запрос.УстановитьПараметр("НаМомент",МоментВремени());
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("СкладКомпании",?(обЗначениеНеЗаполнено(СкладКомпании), обПраво("ОсновнойСкладКомпании",Права,,ЭтотОбъект), СкладКомпании));
		
		Товары.Очистить();
		
		ВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить(); 
		ВалютаРегл = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		
		ВалютаДокументаРегл = (ВалютаРегл = ВалютаДокумента);
		ВалютаДокументаУпр = (ВалютаУпр = ВалютаДокумента);	
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока=Товары.Добавить();
			НоваяСтрока.Номенклатура				= Выборка.Номенклатура;
			НоваяСтрока.ХарактеристикаНоменклатуры	= Выборка.ХарактеристикаНоменклатуры;
			ОбработкаРеквизита("Товары.Номенклатура", НоваяСтрока);
			НоваяСтрока.Количество					= Выборка.Количество/?(обЗначениеНеЗаполнено(НоваяСтрока.Коэффициент),1,НоваяСтрока.Коэффициент);
			ОбработкаРеквизита("Товары.Количество", НоваяСтрока);
			Если Выборка.Количество = Выборка.Заказано Тогда
				НоваяСтрока.СуммаВсего = ?(ВалютаДокументаРегл, Выборка.Сумма, Выборка.СуммаУпр);
			Иначе
				НоваяСтрока.СуммаВсего = (?(ВалютаДокументаРегл, Выборка.Сумма, Выборка.СуммаУпр)/Выборка.Заказано)*Выборка.Количество;
			КонецЕсли;
			Если НЕ ВалютаДокументаРегл И НЕ ВалютаДокументаУпр Тогда
				НоваяСтрока.СуммаВсего = обПересчет(НоваяСтрока.СуммаВсего, ВалютаУпр, КурсВалютыУпр, ВалютаДокумента, КурсДокумента);
			КонецЕсли;
			ОбработкаРеквизита("Товары.СуммаВсего", НоваяСтрока);
			НоваяСтрока.АйДи = ПрописатьАйДи(Выборка.Заказ,Выборка.Номенклатура);
 		КонецЦикла;
	Иначе
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
		|	ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СУММА(ВЫБОР
		|		КОГДА ЗаказыПокупателейОстатки.СкладКомпании = &СкладКомпании ТОГДА
		|			ЗаказыПокупателейОстатки.РезервОстаток
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ) КАК Количество,
		|	СУММА(ЗаказыПокупателейОстатки.ЗаказаноОстаток) КАК Заказано,
		|	СУММА(ЗаказыПокупателейОстатки.СуммаОстаток) КАК СуммаЗаказа,
		|	МАКСИМУМ(ЕСТЬNULL(ЗаказПокупателяТовары.Количество * ЗаказПокупателяТовары.Коэффициент,1)) КАК КоличествоБазовое,
		|	МАКСИМУМ(ЕСТЬNULL(ЗаказПокупателяТовары.ЕдиницаИзмерения,Значение(Справочник.ЕдиницыИзмерения.ПустаяСсылка))) КАК ЕдиницаИзмерения,
		|	МАКСИМУМ(ЕСТЬNULL(ЗаказПокупателяТовары.Коэффициент,1)) КАК Коэффициент,
		|	МАКСИМУМ(ЕСТЬNULL(ЗаказПокупателяТовары.СтавкаНДС, ЗаказыПокупателейОстатки.Номенклатура.СтавкаНДС)) КАК СтавкаНДС,
		|	ЕСТЬNULL(ЗаказПокупателяТовары.НомерСтроки, 1000000) КАК НомерСтроки,
		|	МАКСИМУМ(ЕСТЬNULL(ЗаказПокупателяТовары.СкидкаНаТовар, ЗНАЧЕНИЕ(Справочник.ТипыСкидок.ПустаяСсылка))) КАК СкидкаНаТовар,
		|	МАКСИМУМ(ЕСТЬNULL(ЗаказПокупателяТовары.ПроцентСкидкиСтроки,0)) КАК ПроцентСкидкиСтроки,
		|	МАКСИМУМ(ЕСТЬNULL(ЗаказПокупателяТовары.ПроцентСкидки,0)) КАК ПроцентСкидки
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей.Остатки("+?(Ссылка.Пустая(),"","&НаМомент")+",
		|	Контрагент = &Контрагент И 
		|	(СкладКомпании = &СкладКомпании ИЛИ СкладКомпании = &СкладЗаказа) И Заказ = &Заказ) КАК ЗаказыПокупателейОстатки
		|ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|ПО 
		|	ЗаказыПокупателейОстатки.Заказ = ЗаказПокупателяТовары.Ссылка И 
		|	ЗаказыПокупателейОстатки.Номенклатура = ЗаказПокупателяТовары.Номенклатура И 
		|	ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры = ЗаказПокупателяТовары.ХарактеристикаНоменклатуры
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыПокупателейОстатки.Номенклатура,
		|	ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры,
		|	ЕСТЬNULL(ЗаказПокупателяТовары.НомерСтроки, 1000000)
		|ИМЕЮЩИЕ
		|	СУММА(ВЫБОР
		|		КОГДА ЗаказыПокупателейОстатки.СкладКомпании = &СкладКомпании ТОГДА
		|			ЗаказыПокупателейОстатки.РезервОстаток
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ) > 0 
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|ИТОГИ
		|	СУММА(КоличествоБазовое),
		|	МАКСИМУМ(Количество),
		|	МАКСИМУМ(СуммаЗаказа),
		|	МАКСИМУМ(Заказано)
		|ПО
		|	Номенклатура,
		|	ХарактеристикаНоменклатуры");
		
		ВалютаЗаказа   = ЗаказПокупателя.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;
		СтруктураКурса = обКурсДляВалюты(ВалютаЗаказа,Дата);
		КурсЗаказа     = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
		
		Запрос.УстановитьПараметр("НаМомент",МоментВремени());
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("Заказ",ЗаказПокупателя);
		Запрос.УстановитьПараметр("СкладКомпании",?(обЗначениеНеЗаполнено(СкладКомпании), обПраво("ОсновнойСкладКомпании",Права,,ЭтотОбъект), СкладКомпании));
		Запрос.УстановитьПараметр("СкладЗаказа", ЗаказПокупателя.СкладКомпании);
		
		СкидкаНаценка = ЗаказПокупателя.СкидкаНаценка;
		ОбработкаРеквизита("СкидкаНаценка");
		Товары.Очистить(); // нужные только скорректированные позиции
		ВыборкаНоменклатуры = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаНоменклатуры.Следующий() Цикл
			ВыборкаХарактеристик = ВыборкаНоменклатуры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаХарактеристик.Следующий() Цикл
				ВсегоОсталось = ВыборкаХарактеристик.Количество;
				КоличествоБазовоеПоЗаказу = ВыборкаХарактеристик.КоличествоБазовое;
				СуммаОсталось = обПересчет(?(ВыборкаХарактеристик.Заказано <= ВыборкаХарактеристик.Количество,ВыборкаХарактеристик.СуммаЗаказа, ВыборкаХарактеристик.СуммаЗаказа/ВыборкаХарактеристик.Заказано*ВыборкаХарактеристик.Количество), ВалютаЗаказа, КурсЗаказа,ВалютаДокумента,КурсДокумента);
				ВыборкаДетали = ВыборкаХарактеристик.Выбрать(ОбходРезультатаЗапроса.Прямой);
				НоваяСтрока   = Неопределено;
				Пока ВыборкаДетали.Следующий() Цикл
					Если ВсегоОсталось=0 Тогда
						Прервать;
					КонецЕсли;
					Если ВыборкаДетали.Количество = 0 Тогда
						Продолжить;
					КонецЕсли;
					Если КоличествоБазовоеПоЗаказу = 1 Тогда
						КоличествоСтроки = ВыборкаДетали.Количество;
					Иначе
						КоличествоСтроки = ВыборкаДетали.Количество*(ВыборкаДетали.КоличествоБазовое/КоличествоБазовоеПоЗаказу);
					КонецЕсли;
					ТекущееКоличество = Мин(ВсегоОсталось, КоличествоСтроки);
					НоваяСтрока=Товары.Добавить();
					НоваяСтрока.Номенклатура				= ВыборкаДетали.Номенклатура;
					НоваяСтрока.ХарактеристикаНоменклатуры	= ВыборкаДетали.ХарактеристикаНоменклатуры;
					НоваяСтрока.ЕдиницаИзмерения			= ВыборкаДетали.ЕдиницаИзмерения;
					НоваяСтрока.Коэффициент					= ВыборкаДетали.Коэффициент;
					ОбработкаРеквизита("Товары.Номенклатура", НоваяСтрока);
					НоваяСтрока.Количество					= ТекущееКоличество/?(обЗначениеНеЗаполнено(НоваяСтрока.Коэффициент),1,НоваяСтрока.Коэффициент);;
					НоваяСтрока.КоличествоБазовое			= ТекущееКоличество;
					НоваяСтрока.СтавкаНДС					= ВыборкаДетали.СтавкаНДС;
					ТекСумма = (СуммаОсталось/ВсегоОсталось)*ТекущееКоличество;
					СуммаОсталось = СуммаОсталось - ТекСумма;
					
					НоваяСтрока.СкидкаНаТовар = ВыборкаДетали.СкидкаНаТовар;
					НоваяСтрока.ПроцентСкидки = ВыборкаДетали.ПроцентСкидки;
					НоваяСтрока.ПроцентСкидкиСтроки = ВыборкаДетали.ПроцентСкидкиСтроки;
					
					НоваяСтрока.СуммаВсего = ТекСумма;
					ОбработкаРеквизита("Товары.СуммаВсего", НоваяСтрока);
					
					ВсегоОсталось = ВсегоОсталось-ТекущееКоличество;
				КонецЦикла;
				
				Если ВсегоОсталось>0 ИЛИ СуммаОсталось>0 Тогда
					Если НЕ НоваяСтрока = Неопределено Тогда
						НоваяСтрока.Количество = НоваяСтрока.Количество + (ВсегоОсталось/НоваяСтрока.Коэффициент);
						НоваяСтрока.КоличествоБазовое = НоваяСтрока.КоличествоБазовое + ВсегоОсталось;
						ОбработкаРеквизита("Товары.Количество", НоваяСтрока);
						НоваяСтрока.СуммаВсего = НоваяСтрока.СуммаВсего + СуммаОсталось;
					ИначеЕсли ВсегоОсталось>0 Тогда
						НоваяСтрока=Товары.Добавить();
						НоваяСтрока.Номенклатура=ВыборкаХарактеристик.Номенклатура;
						НоваяСтрока.ХарактеристикаНоменклатуры = ВыборкаХарактеристик.ХарактеристикаНоменклатуры;
						ОбработкаРеквизита("Товары.Номенклатура", НоваяСтрока);
 						НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
  						НоваяСтрока.Количество = ВсегоОсталось/?(обЗначениеНеЗаполнено(НоваяСтрока.Коэффициент),1,НоваяСтрока.Коэффициент);
						НоваяСтрока.КоличествоБазовое = НоваяСтрока.КоличествоБазовое + ВсегоОсталось;
						ОбработкаРеквизита("Товары.Количество", НоваяСтрока);
						НоваяСтрока.СуммаВсего = СуммаОсталось;
					КонецЕсли;
					ОбработкаРеквизита("Товары.СуммаВсего", НоваяСтрока);
					
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьРезервамиКонтрагента()

// Возвращает соответствие в котором перечислены виды номенклатуры, которые нельзя вводить
// в таблицу товаров. Если таких нет, то возвращает неопределено
//
// Возвращаемое значение:
//  Результат - соответствие.
//
Функция ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры() Экспорт
	Результат=Неопределено;
	Если ХозОперация=Справочники.ХозОперации.АктОбОказанииУслуг
		ИЛИ ХозОперация=Справочники.ХозОперации.РеализацияАгентскихУслуг Тогда
		Результат=Новый Соответствие();
		Для каждого ВидНоменклатуры Из Перечисления.ВидыНоменклатуры Цикл
			Если ВидНоменклатуры<>Перечисления.ВидыНоменклатуры.Услуга Тогда
				Результат.Вставить(ВидНоменклатуры,0);
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли; 
	Возврат Результат;
КонецФункции // ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры()

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	// Обязательные поля таблицы товаров
	ОбязательныеТовары=Новый Структура();           
	
	//Бондаренко++ 20240620
	//ОбязательныеТовары.Вставить("Номенклатура",3);
	Если Сводный Тогда
		ОбязательныеТовары.Вставить("Номенклатура",1);
	Иначе	
		ОбязательныеТовары.Вставить("Номенклатура",3);
	КонецЕсли;
	//Бондаренко-- 20240620
	
	ОбязательныеТовары.Вставить("Количество",1);
	ОбязательныеТовары.Вставить("ЕдиницаИзмерения",3);
	ОбязательныеТовары.Вставить("Коэффициент",1);
	ОбязательныеТовары.Вставить("ХарактеристикаНоменклатуры",2);
	Если обПраво("ВыборочноеСписаниеПартий",Права,,ЭтотОбъект) Тогда
		ОбязательныеТовары.Вставить("Партия",2);
		ОбязательныеТовары.Вставить("ГТД",2);
	КонецЕсли;

	// Обязательные поля таблицы "Коды маркировки"
	ОбязательныеКодыМаркировки = Новый Структура();
	ОбязательныеКодыМаркировки.Вставить("КодМаркировки",3);
	
 	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	ОбязательныеРеквизиты.Вставить("Автор",1);
	ОбязательныеРеквизиты.Вставить("ВалютаДокумента",1);
	ОбязательныеРеквизиты.Вставить("КурсДокумента",1);
	//Бондаренко++ 20260603
	//Если ХозОперация = Справочники.ХозОперации.РеализацияАгентскихУслуг Тогда
	//	ОбязательныеРеквизиты.Вставить("Комитент",1);
	//	ОбязательныеРеквизиты.Вставить("ДоговорКомитента",1);
	//ИначеЕсли ХозОперация <> Справочники.ХозОперации.АктОбОказанииУслуг Тогда
	//	ОбязательныеРеквизиты.Вставить("СкладКомпании",1);
	//КонецЕсли;
	//Бондаренко-- 20260603
	ОбязательныеРеквизиты.Вставить("Контрагент",1);
	ОбязательныеРеквизиты.Вставить("ТипЦен",1);
	ОбязательныеРеквизиты.Вставить("ХозОперация",1);
	ОбязательныеРеквизиты.Вставить("ДоговорВзаиморасчетов",1);
	ОбязательныеРеквизиты.Вставить("Товары",ОбязательныеТовары);
	ОбязательныеРеквизиты.Вставить("КодыМаркировки", ОбязательныеКодыМаркировки);

	ОбязательныеРеквизиты = СМГ_ДобавитьОбязательныеРеквизиты(ОбязательныеРеквизиты); 
  	
	Возврат ОбязательныеРеквизиты;
КонецФункции // ПолучитьОбязательныеРеквизиты()
  
// Проверяет корректность заполнения объекта.
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры:
//  Ошибки       - строка, в случае некорректного заполнения содержит описанием возникших ошибок, 
//  ДопРеквизиты - структура, на вход может быть передана структура с дополнительными реквизитами для проверки,
//  Заполнение   - булево, флаг проверки, 
//  Уникальность - булево, флаг проверки.
//
// Возвращаемое значение:
//  Булево - Возвращает Истина если все заполнено корректно и Ложь иначе.
// 
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	// Здесь могут быть определены дополнительные к стандартным обязательным реквизитам условия проверки
	//Гэндальф+++
	Уникальность = Ложь;
	//Гэндальф---
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	
	// Проведем проверку соответствия организации документа организациям некоторых реквизитов документа.
	// Такую проверку необходимо осуществлять, если баланс в системе ведется по организации,
	// или если установлен способ контроля корректности
	// договора и склада документа. Причем, если способ контроля выбран "Контроль по организации и подразделению", то
	// дополнительно осуществляется проверка соответствия подразделений.
	Если Результат Тогда
		СпособКонтроляКорректности = обПраво("КонтрольКорректностиДоговораИСкладаДокумента", Права,,ЭтотОбъект);	
		КонтрольОтсутствует        = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольОтсутствует);
		БалансВедетсяПоОрганизации = (Константы.СпособВеденияБаланса.Получить()=Перечисления.СпособВеденияБаланса.ПоОрганизации);
		
		Если БалансВедетсяПоОрганизации Или Не КонтрольОтсутствует Тогда
			КонтрольПоПодразделению = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольПоОрганизацииИПодразделению);
			
			КонтролируемыеРеквизиты = Новый Структура();
			
			КонтролируемыеРеквизитыШапки = Новый Структура();
			//Бондаренко++ 20260603
			//КонтролируемыеРеквизитыШапки.Вставить("СкладКомпании",         КонтрольПоПодразделению);
			//Бондаренко-- 20260603
			КонтролируемыеРеквизитыШапки.Вставить("ДоговорВзаиморасчетов", КонтрольПоПодразделению);
			КонтролируемыеРеквизиты.Вставить("КонтролируемыеРеквизитыШапки",КонтролируемыеРеквизитыШапки);
			
			Если БалансВедетсяПоОрганизации И обПраво("ВыборочноеСписаниеПартий",Права,,ЭтотОбъект) Тогда
				КонтролируемыеРеквизитыСостава = Новый Структура();
				КонтролируемыеРеквизитыСостава.Вставить("Партия");
				ТабличныеЧасти = Новый Структура();
				ТабличныеЧасти.Вставить("Товары",КонтролируемыеРеквизитыСостава);
				КонтролируемыеРеквизиты.Вставить("КонтролируемыеРеквизитыТабличныхЧастей",ТабличныеЧасти);
			КонецЕсли;		
			
			Результат = дкПроверитьКорректностьПоОрганизации(ЭтотОбъект,КонтролируемыеРеквизиты,Ошибки) и Результат;
		КонецЕсли;
	КонецЕсли;
	
	// проверим документ на повторение
	Если Результат И (НЕ обЗначениеНеЗаполнено(ДокументОснование)) И (ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ДоговорПроведенияТехническогоОсмотра")) Тогда
		Если ХозОперация <> Справочники.ХозОперации.АктОбОказанииУслуг Тогда
			стрОшибка = "Для основания ""Договор проведения технического осмотра"" необходимо указать хоз. операцию ""Акт об оказании услуг"".";
			дкДобавитьОшибку(Ошибки,стрОшибка);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РеализацияТоваров.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваров КАК РеализацияТоваров
		|ГДЕ
		|	РеализацияТоваров.ДокументОснование = &ДокументОснование
		|	И РеализацияТоваров.Ссылка <> &ЭтаСсылка";
		Запрос.УстановитьПараметр("ДокументОснование" , ДокументОснование);
		Запрос.УстановитьПараметр("ЭтаСсылка"		  , Ссылка);
		РезЗапроса = Запрос.Выполнить().Выбрать();
		
		Если РезЗапроса.Количество() > 0 Тогда
			Результат = Ложь;
			РезЗапроса.Следующий();
			стрОшибка = "На основании документа <"+Строка(ДокументОснование)+"> уже введен документ <"+Строка(РезЗапроса.Ссылка)+">.";
			дкДобавитьОшибку(Ошибки,стрОшибка);
		КонецЕсли;
	КонецЕсли;
	
	//Проверим ТЧ на наличие услуг при ХозОперации "РеализацияТоваровКомиссия"
	Если Результат  И ХозОперация = Справочники.ХозОперации.РеализацияТоваровКомиссия Тогда
		МассивСтрок = Новый Массив;
		НомераСтрок = " ";
		Флаг = Ложь;
		Для Каждого ТекСтрока Из ЭтотОбъект.Товары Цикл
			Если ТекСтрока.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга Тогда
				НомераСтрок = НомераСтрок + ?(НомераСтрок = " ", " ", ", " ) + ТекСтрока.НомерСтроки;
				Флаг = Истина;
			КонецЕсли;
		КонецЦикла;
		Если Флаг Тогда
			стрОшибка = "Для хозяйственной операции <" + ХозОперация + "> не должно быть услуг в табличной части. Номера строк с услугами:" + НомераСтрок;
			дкДобавитьОшибку(Ошибки,стрОшибка);
			Результат = Ложь;
		КонецЕсли;	
	КонецЕсли;
	
	// Проверим количество маркировок и количество товара в строке
	Результат = Результат И дкПроверитьКорректностьМаркировки(ЭтотОбъект,,, Ошибки);
	дкПроверитьКорректностьРНПТ(ЭтотОбъект);
	
	Результат = СМГ_ПроверитьКорректность(Результат,Ошибки);
 	
	Возврат Результат;
КонецФункции // ПроверитьКорректность()

  // Функция проверяет, допустимо ли изменение объекта
//
// Параметры:
//  БлокироватьРеквизиты - структура, структура блокируемых на изменение реквизитов.
//
// Возвращаемое значение:
// Булево - Возвращает Истина, если изменения возможны, ложь иначе
//          Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
//
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
	// Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции // ДоступностьИзменения()

// Возвращает список возможных хозяйственных операций документа
// Возвращаемое значение: 
//  СписокЗначений. 
//  Строка списка: Значение - имя предопределенного элемента; 
//				   Представление - красивое его представление
// 				   "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("АктЛогиста", "Акт логиста",Истина);
  	Возврат СписокХозОпераций;
	
КонецФункции // ПолучитьСписокХозОпераций()

// возвращает выборку по шапке
//
// Параметры:
//  ДокументСсылка - Ссылка на документ для которого получаем шапку.
//
// Возвращаемое значение:
//  Выборка - выборка по шапке
//
Функция ПолучитьШапкуДокумента(ДокументСсылка)
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата,
	|	Док.ВалютаДокумента КАК ВалютаДокумента,
	|	Док.КурсДокумента КАК КурсДокумента,
	|	Док.ТипЦен КАК ТипЦен,
	|	Док.ХозОперация КАК ХозОперация,
	|	Док.КурсВалютыУпр КАК КурсВалютыУпр,
	|	Док.КурсВалютыВзаиморасчетов КАК КурсВалютыВзаиморасчетов,
	|	Док.МоментВремени КАК МоментВремени,
	|	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	Док.Проект КАК Проект,
	/////////// ПРИВАТ ////////////
	|	Док.СкладКомпании КАК СкладКомпании,
	|	Док.Ссылка КАК ДокументПродажи,
	|	Док.Контрагент КАК Контрагент,
	|	Док.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	Док.Комитент КАК Комитент,
	|	Док.ДоговорКомитента КАК ДоговорКомитента,
	|	Док.ДокументОснование КАК ДокументОснование,
	|	ЕСТЬNULL(ДокТовары.СуммаВсего,0) КАК СуммаВсего
	|
	|ИЗ
	|	Документ."+Метаданные().Имя+" КАК Док
	|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ СУММА(СуммаВсего) КАК СуммаВсего ИЗ Документ."+Метаданные().Имя+".Товары ГДЕ Ссылка=&Ссылка) КАК ДокТовары
	|	ПО Истина
	|
	|ГДЕ
	|	Док.Ссылка=&Ссылка
	|");
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	Выборка=Запрос.Выполнить().Выбрать(); Выборка.Следующий();
	
	Возврат Выборка;
КонецФункции // ПолучитьШапкуДокумента()

// формирует движения документа по партионным регистрам
//
// Параметры:
//  Режим           - режим проведения (оперативный/неоперативный)
//  ДокументСсылка  - ссылка на документ который надо допровести по партиям
//
// Возвращаемое значение:
//  Возвращает Истина - все ОК, ложь - чего-то не так
//
Функция ПровестиПоПартиям(Режим,ДокументСсылка) Экспорт
	Отказ=Ложь;
	
	// определим необходимость формирования корректирующих проводок
	ВедетсяБалансПоПодразделению = (Константы.СпособВеденияБаланса.Получить() = Перечисления.СпособВеденияБаланса.ПоПодразделению);
	
	// получим шапку документа
	ШапкаДокумента=ПолучитьШапкуДокумента(ДокументСсылка);
	
	// проверим, если подразделение проводиться по партиям "отложенно", то дальше не идем
	НаборЗаписейДопроведениеПоПартиям=Движения.ДопроведениеПоПартиям;
	НаборЗаписейДопроведениеПоПартиям.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейДопроведениеПоПартиям.ШапкаДокумента=ШапкаДокумента;
	Отказ=НЕ НаборЗаписейДопроведениеПоПартиям.Зафиксировать() ИЛИ Отказ;
	Если НаборЗаписейДопроведениеПоПартиям.НеПроводитьПартии Тогда
		НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
		НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
		// в случае если ведется баланс по подразделению передадим подразделение соответствующее корреспонденции
		Если ВедетсяБалансПоПодразделению Тогда
			НаборЗаписейДоходыИРасходы.Подразделение = ШапкаДокумента.ДоговорВзаиморасчетов.Подразделение;
		КонецЕсли;
		НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СебестоимостьНеоприходованныхПартий;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте = Ложь;
		НаборЗаписейДоходыИРасходы.Доход = ШапкаДокумента.СуммаВсего;
		НаборЗаписейДоходыИРасходы.Приход();
		Возврат НЕ Отказ;
	КонецЕсли;
	
	// проверяем, присутствуют ли партии в табличной части	
	ЕстьПартии = Ложь;
	Для Каждого СтрокаТовар Из Товары Цикл
		Если ЗначениеЗаполнено(СтрокаТовар.Партия) Тогда
			ЕстьПартии = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПодразделениеСклад = обПолучитьБалансовоеПодразделение(ШапкаДокумента.СкладКомпании.Подразделение);
	ПодразделениеДоговорВзаиморасчетов = обПолучитьБалансовоеПодразделение(ШапкаДокумента.ДоговорВзаиморасчетов.Подразделение);
	БалансовыеПодразделенияНеРавны = (ПодразделениеДоговорВзаиморасчетов<>ПодразделениеСклад);
	
	ВУпрВалюте=(ВалютаДокумента=Константы.ВалютаУправленческогоУчетаКомпании.Получить());
	// проведем партии товаров проданные 
	НаборЗаписейПартии=Движения.ПартииТоваровКомпании;
	НаборЗаписейПартии.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейПартии.СкладКомпании=ШапкаДокумента.СкладКомпании; 
	НаборЗаписейПартии.ИмяРеквизитаДокумент=?(ЕстьПартии, "Партия", "");
	//НаборЗаписейПартии.ИмяРеквизитаДокумент=?(обПраво("ВыборочноеСписаниеПартий",Права,,ЭтотОбъект),"Партия","");
	НаборЗаписейПартии.ПоБазовомуКоличеству=Истина;
	// если и передаем товар на комиссию, то только собственный
	Если ШапкаДокумента.ХозОперация=Справочники.ХозОперации.РеализацияТоваровКомиссия Тогда
		НаборЗаписейПартии.СтатусПартии=Перечисления.СтатусыПартий.ТоварКупленный;
	КонецЕсли;
	НаборЗаписейПартии.ШапкаДокумента=ШапкаДокумента;
	Отказ=НЕ НаборЗаписейПартии.Расход() ИЛИ Отказ;
	// комиссия
	Если (ШапкаДокумента.ХозОперация=Справочники.ХозОперации.РеализацияТоваровКомиссия) Тогда
		// проведем партии товаров переданные на комиссию
		НаборЗаписейПартииОтданные=Движения.ПартииТоваровОтданные;
		НаборЗаписейПартииОтданные.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейПартииОтданные.Контрагент=ШапкаДокумента.Контрагент;
		НаборЗаписейПартииОтданные.ДоговорВзаиморасчетов=ШапкаДокумента.ДоговорВзаиморасчетов;
		НаборЗаписейПартииОтданные.ПоБазовомуКоличеству=Истина;
		НаборЗаписейПартииОтданные.ШапкаДокумента=ШапкаДокумента;
		Отказ=НЕ НаборЗаписейПартииОтданные.Приход() ИЛИ Отказ;
		
		//Если балансовые подразделение договора и подразделения склад не равны, то сформируем корректирующие проводки
		Если ВедетсяБалансПоПодразделению и БалансовыеПодразделенияНеРавны Тогда
			НаборЗаписейПартии=Движения.ПартииТоваровКомпании;
			СебестоимостьУпр=НаборЗаписейПартии.Итог("СуммаУпр");
			//сумма себестоимости списанных товаров
			НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
			НаборЗаписейДоходыИРасходы.ДокументОбъект         = ЭтотОбъект;
			НаборЗаписейДоходыИРасходы.Подразделение          = ШапкаДокумента.СкладКомпании.Подразделение;
			НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
			НаборЗаписейДоходыИРасходы.ВУпрВалюте             = Истина;
			НаборЗаписейДоходыИРасходы.Доход                  = СебестоимостьУпр;	
			НаборЗаписейДоходыИРасходы.ШапкаДокумента         = ШапкаДокумента;
			Отказ=НЕ НаборЗаписейДоходыИРасходы.Расход() ИЛИ Отказ;
			
			НаборЗаписейПартииОтданные=Движения.ПартииТоваровОтданные;
			СебестоимостьУпр=НаборЗаписейПартииОтданные.Итог("СуммаСебестоимостиУпр");
			//сумма себестоимости списанных товаров
			НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
			НаборЗаписейДоходыИРасходы.ДокументОбъект         = ЭтотОбъект;
			НаборЗаписейДоходыИРасходы.Подразделение          = ШапкаДокумента.ДоговорВзаиморасчетов.Подразделение;
			НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
			НаборЗаписейДоходыИРасходы.ВУпрВалюте             = Истина;
			НаборЗаписейДоходыИРасходы.Доход                  = СебестоимостьУпр;	
			НаборЗаписейДоходыИРасходы.ШапкаДокумента         = ШапкаДокумента;
			Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
		КонецЕсли;	
	Иначе
		// продажи
		Если НЕ Отказ Тогда
			НаборЗаписейПродажи=Движения.Продажи;
			НаборЗаписейПродажи.ДокументОбъект=ЭтотОбъект;
			НаборЗаписейПродажи.СкладКомпании=ШапкаДокумента.СкладКомпании;
			НаборЗаписейПродажи.ДокументПродажи=ШапкаДокумента.ДокументПродажи;
			НаборЗаписейПродажи.Сторно=Ложь;
			НаборЗаписейПродажи.Покупатель=ШапкаДокумента.Контрагент;
			НаборЗаписейПродажи.РезультатЗапросаПоТоварам=Неопределено;
			НаборЗаписейПродажи.ДоговорВзаиморасчетов=ШапкаДокумента.ДоговорВзаиморасчетов;
			НаборЗаписейПродажи.ПодразделениеКомпании=ШапкаДокумента.ПодразделениеКомпании;
			НаборЗаписейПродажи.ИмяРеквизитаДокумент=?(ЕстьПартии, "Партия", "");
			//НаборЗаписейПродажи.ИмяРеквизитаДокумент = ?(обПраво("ВыборочноеСписаниеПартий",Права,,ЭтотОбъект),"Партия","");
			НаборЗаписейПродажи.Комиссия=Ложь;
			НаборЗаписейПродажи.ПоБазовомуКоличеству=Истина;
			НаборЗаписейПродажи.ШапкаДокумента=ШапкаДокумента;
			Отказ=НЕ НаборЗаписейПродажи.Приход() ИЛИ Отказ;
		КонецЕсли;
	КонецЕсли;
	
	// спишем реализованные комиссионные товары
	НаборЗаписейРеализованныеТовары=Движения.РеализованныеТовары;
	НаборЗаписейРеализованныеТовары.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейРеализованныеТовары.Контрагент=ШапкаДокумента.Контрагент;
	НаборЗаписейРеализованныеТовары.ДоговорВзаиморасчетов=ШапкаДокумента.ДоговорВзаиморасчетов;
	НаборЗаписейРеализованныеТовары.ПоБазовомуКоличеству=Истина;
	НаборЗаписейРеализованныеТовары.ШапкаДокумента=ШапкаДокумента;
	Отказ=НЕ НаборЗаписейРеализованныеТовары.Приход() ИЛИ Отказ;
	
	// Доходы и расходы, если не комиссия
	Если ШапкаДокумента.ХозОперация<>Справочники.ХозОперации.РеализацияТоваровКомиссия Тогда 
		// подготовим таблицу движений в разрезе подразделений только собственных списанных партий
		ТаблицаСписанийПартий = Движения.ПартииТоваровКомпании.Выгрузить();
		ТаблицаСписанийПартий.Свернуть("СкладКомпании,СтатусПартии","СуммаУпр");
		СтруктураОтбора=Новый Структура("СтатусПартии",Перечисления.СтатусыПартий.ТоварПринятыйКомиссия);
		МассивНайденныхСтрок=ТаблицаСписанийПартий.НайтиСтроки(СтруктураОтбора);
		Для Сч=0 По МассивНайденныхСтрок.ВГраница() Цикл
			ТаблицаСписанийПартий.Удалить(МассивНайденныхСтрок[Сч]);
		КонецЦикла;
		
		СебестоимостьУпр = ТаблицаСписанийПартий.Итог("СуммаУпр");
		
		НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
		НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
		// в случае если ведется баланс по подразделению передадим подразделение соответствующее корреспонденции
		Если ВедетсяБалансПоПодразделению Тогда
			НаборЗаписейДоходыИРасходы.Подразделение = ШапкаДокумента.ДоговорВзаиморасчетов.Подразделение;
		КонецЕсли;
		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=Справочники.СтатьиДоходовИРасходов.Себестоимость;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте=Истина;
		НаборЗаписейДоходыИРасходы.Расход=СебестоимостьУпр;	
		НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
		Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
		
		//Если балансовые подразделение договора и подразделения склад не равны, то сформируем корректирующие проводки
		Если ВедетсяБалансПоПодразделению и БалансовыеПодразделенияНеРавны Тогда
			НаборЗаписейДоходыИРасходы = Движения.ДоходыИРасходы;
			НаборЗаписейДоходыИРасходы.ДокументОбъект         = ЭтотОбъект;
			НаборЗаписейДоходыИРасходы.Подразделение          = ШапкаДокумента.СкладКомпании.Подразделение;
			НаборЗаписейДоходыИРасходы.ВУпрВалюте             = Истина;
			НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
			НаборЗаписейДоходыИРасходы.Доход                  = СебестоимостьУпр;
			Отказ=НЕ НаборЗаписейДоходыИРасходы.Расход() ИЛИ Отказ;
			
			НаборЗаписейДоходыИРасходы = Движения.ДоходыИРасходы;
			НаборЗаписейДоходыИРасходы.ДокументОбъект         = ЭтотОбъект;
			НаборЗаписейДоходыИРасходы.Подразделение          = ШапкаДокумента.ДоговорВзаиморасчетов.Подразделение;
			НаборЗаписейДоходыИРасходы.ВУпрВалюте             = Истина;
			НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
			НаборЗаписейДоходыИРасходы.Доход                  = СебестоимостьУпр;
			Отказ = НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
		КонецЕсли;
		
		// подготовим таблицу движений в разрезе подразделений комиссионных товаров
		ТаблицаСписанийПартийРеализованных = Движения.РеализованныеТовары.Выгрузить();
		ТаблицаСписанийПартийРеализованных.Свернуть("ДоговорВзаиморасчетов","СуммаУпр");
		
		ОписаниеТипов=Новый ОписаниеТипов;
		ОписаниеТипов.Типы().Добавить(Тип("СправочникСсылка.ПодразделенияКомпании"));
		ТаблицаСписанийПартийРеализованных.Колонки.Добавить("Подразделение",ОписаниеТипов);
		Для Каждого СтрокаСписания Из ТаблицаСписанийПартийРеализованных Цикл
			СтрокаСписания.Подразделение = СтрокаСписания.ДоговорВзаиморасчетов.Подразделение;
		КонецЦикла;	
		ТаблицаСписанийПартийРеализованных.Свернуть("Подразделение","СуммаУпр");
		
		// в случае если ведется баланс по подразделению передадим подразделение соответствующее корреспонденции
		Если ВедетсяБалансПоПодразделению Тогда
			Для Каждого СтрокаСписания Из ТаблицаСписанийПартийРеализованных Цикл
				НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
				НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
				НаборЗаписейДоходыИРасходы.Подразделение=СтрокаСписания.Подразделение;
				НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=Справочники.СтатьиДоходовИРасходов.Себестоимость;
				НаборЗаписейДоходыИРасходы.ВУпрВалюте=Истина;
				НаборЗаписейДоходыИРасходы.Расход=СтрокаСписания.СуммаУпр;	
				НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
				Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
			КонецЦикла;
		Иначе
			НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
			НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
			НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=Справочники.СтатьиДоходовИРасходов.Себестоимость;
			НаборЗаписейДоходыИРасходы.ВУпрВалюте=Истина;
			НаборЗаписейДоходыИРасходы.Расход=ТаблицаСписанийПартийРеализованных.Итог("СуммаУпр");	
			НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
			Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
		КонецЕсли;
		
		//Доход от начисления дебиторской задолженности по отгруженному товару и оказанным услугам
		Запрос=Новый Запрос();
		ТекстЗапроса="
		|	ВЫБРАТЬ
		|		СУММА(РеализацияТоваровТовары.СуммаВсего) КАК СуммаУслуг
		|	ИЗ
		|		Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
		|	ГДЕ
		|		РеализацияТоваровТовары.Ссылка = &ТекДок И РеализацияТоваровТовары.Номенклатура.ВидНоменклатуры=&Услуга
		|";
		Запрос.Текст=ТекстЗапроса;
		Запрос.УстановитьПараметр("ТекДок",ШапкаДокумента.Ссылка);
		Запрос.УстановитьПараметр("Услуга",Перечисления.ВидыНоменклатуры.Услуга);
		Выборка=Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СуммаУслуг=Выборка.СуммаУслуг;
		КонецЦикла;
		
		СуммаТоваров=ШапкаДокумента.СуммаВсего-?(СуммаУслуг=NULL,0,СуммаУслуг);
		НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
		НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
		// в случае если ведется баланс по подразделению передадим подразделение соответствующее корреспонденции
		Если ВедетсяБалансПоПодразделению Тогда
			НаборЗаписейДоходыИРасходы.Подразделение=ШапкаДокумента.ДоговорВзаиморасчетов.Подразделение;
		КонецЕсли;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте=ВУпрВалюте;
		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=Справочники.СтатьиДоходовИРасходов.НачислениеДебиторскойЗадолженностиПоТовару;
		НаборЗаписейДоходыИРасходы.Доход=СуммаТоваров;
		НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
		Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
		
		НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
		НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
		// в случае если ведется баланс по подразделению передадим подразделение соответствующее корреспонденции
		Если ВедетсяБалансПоПодразделению Тогда
			НаборЗаписейДоходыИРасходы.Подразделение=ШапкаДокумента.ДоговорВзаиморасчетов.Подразделение;
		КонецЕсли;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте=ВУпрВалюте;
		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=Справочники.СтатьиДоходовИРасходов.НачислениеДебиторскойЗадолженностиПоУслугам;
		НаборЗаписейДоходыИРасходы.Доход=СуммаУслуг;
		НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
		Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
	КонецЕсли;
	
	// двигаем границу последовательности партий
	Если Режим<>РежимПроведенияДокумента.Оперативный ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.СкладКомпанииБыл) Тогда
		// если идет допроведение, то надо получить те значения которые были раньше
		Если Ссылка<>ДокументСсылка Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ СкладКомпании ИЗ РегистрНакопления.ПартииТоваровКомпании ГДЕ Регистратор=&Ссылка");
			Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
			Результат = Запрос.Выполнить(); СкладКомпанииБыл=Неопределено;
			Если НЕ Результат.Пустой() Тогда
				СкладКомпанииБыл = Результат.Выгрузить().ВыгрузитьКолонку("СкладКомпании");
			КонецЕсли;
			ДополнительныеСвойства.Вставить("СкладКомпанииБыл",СкладКомпанииБыл);
			ДополнительныеСвойства.МоментВремениБыл = ДокументСсылка.МоментВремени();
		КонецЕсли;
		НаборЗаписейГраницыПартий = РегистрыСведений.ГраницыПартий.СоздатьНаборЗаписей();
		Если Режим<>РежимПроведенияДокумента.Оперативный Тогда
			НаборЗаписейГраницыПартий.СкладКомпании		= ШапкаДокумента.СкладКомпании;
			НаборЗаписейГраницыПартий.МоментВремени		= ШапкаДокумента.Дата;
			НаборЗаписейГраницыПартий.СкладКомпанииБыл	= ДополнительныеСвойства.СкладКомпанииБыл;
			НаборЗаписейГраницыПартий.МоментВремениБыл	= ДополнительныеСвойства.МоментВремениБыл;
		Иначе
			НаборЗаписейГраницыПартий.СкладКомпании		= ДополнительныеСвойства.СкладКомпанииБыл;
			НаборЗаписейГраницыПартий.МоментВремени		= ДополнительныеСвойства.МоментВремениБыл;
			НаборЗаписейГраницыПартий.СкладКомпанииБыл	= Неопределено;
			НаборЗаписейГраницыПартий.МоментВремениБыл	= Неопределено;
		КонецЕсли;
		НаборЗаписейГраницыПартий.ДокументСсылка	= ШапкаДокумента.Ссылка;
		НаборЗаписейГраницыПартий.ИзменитьГраницу();
	КонецЕсли;
	
	Возврат НЕ Отказ;
КонецФункции // ПровестиПоПартиям()

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка - Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	– Форма	 – Ссылка на форму документа. Если значение неопределено,
//                         производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	
	// обработаем бонусы при изменении ТЧ
	Если Найти(Имя, "Товары.") > 0 И Имя <> "Товары.СуммаНДС" Тогда
		Для Каждого Строка Из Товары Цикл
			Если НЕ (Имя = "Товары.СуммаВсего" И ТекСтрока = Строка) Тогда
				Строка.СуммаВсего = Строка.СуммаВсего + Строка.СуммаСкидкиБонусами;
			КонецЕсли;
			Строка.СуммаСкидкиБонусами = 0;
		КонецЦикла;
	КонецЕсли;
	
	// ОБРАБОТКА РЕКВИЗИТОВ ДОКУМЕНТА
	Если Имя="Контрагент" Тогда
		Если ХозОперация = Справочники.ХозОперации.РеализацияТоваровКомиссия Тогда
			//Параметры для подстановки или создания договора контрагента
			Если ДопПараметры=Неопределено Тогда
				ДопПараметры	= Новый Структура();
			КонецЕсли; 
			ДопПараметры.Вставить("ВидДоговора",Перечисления.ВидыДоговоров.СКомиссионером);
			ДопПараметры.Вставить("ТипЦенПокупки",Справочники.ТипыЦен.ПустаяСсылка());
			ДопПараметры.Вставить("ТипЦенПродажи",ТипЦен);
		КонецЕсли; 
		
 		Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	ИначеЕсли Имя="ДокументОснование" Тогда
		#Если Клиент Тогда
			Если НЕ обЗначениеНеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ДоговорПроведенияТехническогоОсмотра") Тогда
				ХозОперация = Справочники.ХозОперации.АктОбОказанииУслуг;
				Кнопка = ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Операция.Кнопки.Найти("АктОбОказанииУслуг");
				Если Кнопка <> Неопределено Тогда
					ЭтаФорма.ДействияФормыОперация(Кнопка);
				КонецЕсли;
			КонецЕсли;
		#КонецЕсли
	ИначеЕсли Имя="Комитент" Тогда
		
		Если ХозОперация = Справочники.ХозОперации.РеализацияАгентскихУслуг Тогда
			
			ТекущийВидДоговора	= Перечисления.ВидыДоговоров.СКомитентом;
			
			//Параметры для подстановки или создания договора контрагента
			Если ДопПараметры=Неопределено Тогда
				ДопПараметры	= Новый Структура();
			КонецЕсли; 
			ДопПараметры.Вставить("ВидДоговора",	ТекущийВидДоговора);
			
			ДоговорКомитента	= Справочники.Контрагенты.ПолучитьДоговорВзаиморасчетов(ЭтотОбъект.Комитент,ТекущийВидДоговора,ЭтотОбъект,ДопПараметры,Истина,Истина);
		КонецЕсли; 
		
	ИначеЕсли Имя="СкладКомпании" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Возврат ОбработкаРеквизита("ПроверкаСкладаКомпании",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
		
	ИначеЕсли Имя="ПроверкаСкладаКомпании" Тогда
		//Проверка корректности значения реквизита "СкладКомпании"
		Если СкладКомпании.Пустая() Тогда
		ИначеЕсли (ХозОперация = Справочники.ХозОперации.РеализацияТоваровКомиссия) И (СкладКомпании.Розничный) Тогда
			#Если Клиент Тогда
				Предупреждение("Выбранный склад: <" + СкладКомпании + "> является розничным.
				|На розничном складе невозможна реализация товаров на комиссию!",10);
			#КонецЕсли
			СкладКомпании = Неопределено;
			ОбработкаРеквизита("СкладКомпании",ТекСтрока,ЭтаФорма,ДопПараметры);
			Возврат Ложь;
		КонецЕсли;
		Возврат Истина;
		
	ИначеЕсли Имя="ПодразделениеКомпании" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Если НЕ обЗначениеНеЗаполнено(ПодразделениеКомпании) Тогда
			Если обПолучитьПраваИНастройкиПользователя(ПодразделениеКомпании,"ЗакрытиеЗаказовПоПодразделению",ЭтотОбъект) Тогда
				ЗакрытиеЗаказовПоПодразделению=Перечисления.ВариантыОтветов.Да;
			Иначе
				ЗакрытиеЗаказовПоПодразделению=Перечисления.ВариантыОтветов.Нет;
			КонецЕсли; 
		КонецЕсли; 
		Возврат Рез;
		
	ИначеЕсли Имя = "КоличествоКСписанию" Тогда
		
		// сравним бонусные баллы с суммой всего
		Если НЕ БонусныеПрограммыСервер.БонуснаяПрограммаАктивна(Карточка.БонуснаяПрограмма, Дата) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если ТипЗнч(ДопПараметры) = Тип("Структура") И ДопПараметры.Свойство("ПроверятьБлокировкуКарты")
			И БонусныеПрограммыСервер.ЗаблокированаКарточка(Карточка) Тогда
			КоличествоКСписанию = 0;
		КонецЕсли;
		
		КоличествоКСписанию = Мин(КоличествоКСписанию,
								  БонусныеПрограммыСервер.КоличествоБалловВСуммеДокумента(ЭтотОбъект, Карточка.БонуснаяПрограмма),
								  БонусныеПрограммыСервер.МаксимальноеКоличетсвоБоллов(ЭтотОбъект, Карточка.БонуснаяПрограмма));
		
		// расписываем сумму по строкам документа документам
		СводнаяТаблица = СформироватьСводнуюТаблицу();
		
		БонусныеПрограммыСервер.РаспределитьСуммуПоТаблице(СводнаяТаблица, БонусныеПрограммыСервер.БаллыВВалюту(КоличествоКСписанию, Карточка.БонуснаяПрограмма, ВалютаДокумента, Дата), "Сумма");
		
		Для Каждого Строка Из СводнаяТаблица Цикл
			Строка.Строка.СуммаВсего          = Строка.Сумма;
			Строка.Строка.СуммаНДС            = Строка.Строка.СуммаВсего*Строка.Строка.СтавкаНДС.Ставка/(100+Строка.Строка.СтавкаНДС.Ставка);
			Строка.Строка.СуммаСкидкиБонусами = Строка.РаспределенноеЗначение;
		КонецЦикла;
		
		БонусныеПрограммыСервер.РасчитатьБонусныеБаллыКНачислению(ЭтотОбъект, Карточка.БонуснаяПрограмма);
		
	   	СуммаСкидкиНаценки = Товары.Итог("СуммаСкидки");
		СуммаСкидкиНаценки = СуммаСкидкиНаценки + Товары.Итог("СуммаСкидкиСтроки");
		СуммаСкидкиНаценки = СуммаСкидкиНаценки + Товары.Итог("СуммаСкидкиБонусами");
				
		Возврат Истина;
		
	ИначеЕсли Имя = "Товары.Номенклатура" Тогда
		Рез = дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Если Рез И (НЕ ТекСтрока = Неопределено) И ЗначениеЗаполнено(ТекСтрока.Номенклатура) И 
			(ХозОперация = Справочники.ХозОперации.АктОбОказанииУслуг ИЛИ
			ХозОперация = Справочники.ХозОперации.РеализацияАгентскихУслуг) Тогда
			ТекСтрока.СтатьяДоходов = ТекСтрока.Номенклатура.СтатьяДопРасходов;
			// Семенихин 09.01.2025 +++++
			Если ХозОперация = Справочники.ХозОперации.РеализацияАгентскихУслуг Тогда
				ТекСтрока.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
			ИначеЕсли ХозОперация = Справочники.ХозОперации.АктОбОказанииУслуг Тогда
				ТекСтрока.СтавкаНДС = ТекСтрока.Номенклатура.СтавкаНДС;
			КонецЕсли;
			// Семенихин 14.01.2025 -----
		КонецЕсли;
		#Если Клиент Тогда
			Если ЭтаФорма<>Неопределено Тогда
				ЭтаФорма.ОбновитьПодборЗамен();
			КонецЕсли; 
		#КонецЕсли
		
		Если ПустаяСтрока(ТекСтрока.ИдентификаторТовара) Тогда
			ТекСтрока.ИдентификаторТовара = Новый УникальныйИдентификатор;
		КонецЕсли;
		
		Возврат Рез;
		
	ИначеЕсли Имя = "Товары.Ячейка" Тогда
		Если обЗначениеНеЗаполнено(ТекСтрока.Номенклатура) Тогда
			ТекСтрока.Ячейка=Справочники.ЯчейкиХранения.ПустаяСсылка();
			Возврат Истина;
		КонецЕсли;
		//ЯчейкаСсылка=ТекСтрока.Номенклатура.ПолучитьОбъект().ПолучитьЯчейкуХранения(СкладКомпании);
		ЯчейкаСсылка=Справочники.Номенклатура.ПолучитьЯчейкуХранения(ТекСтрока.Номенклатура,СкладКомпании);
		ТекСтрока.Ячейка=ЯчейкаСсылка;
		Возврат Истина;
	//Бондаренко++ 20260226	
	ИначеЕсли Имя = "РабочиеЛисты.МаркетинговаяПрограмма" Тогда
		Если обЗначениеНеЗаполнено(ТекСтрока.МаркетинговаяПрограмма) Тогда
			ТекСтрока.Сумма=0;
		ИначеЕсли обЗначениеНеЗаполнено(ТекСтрока.РабочийЛист) Тогда
			ТекСтрока.Сумма=0;
		Иначе
			//Бондаренко++ 20260407
			Если НЕ ФлагБрокерФинанс Тогда
			//Бондаренко-- 20260407				
 				СуммаКомп_ =  НайтиСуммуКомпенсации(ТекСтрока.МаркетинговаяПрограмма,ТекСтрока.РабочийЛист,ТекСтрока);
				Если ТекСтрока.Сумма <> СуммаКомп_ Тогда
					ТекСтрока.Сумма= СуммаКомп_;	
				КонецЕсли;
			//Бондаренко++ 20260407	
			Иначе
				СуммаКомп_ = ТекСтрока.РабочийЛист.КомпенсацияБрокерФинанс;
				Если ТекСтрока.Сумма <> СуммаКомп_ Тогда
					ТекСтрока.Сумма= СуммаКомп_;	
				КонецЕсли;
			КонецЕсли;
			//Бондаренко-- 20260407
 		КонецЕсли;
		Возврат Истина;
		//Бондаренко-- 20260226
		//Бондаренко++ 20260502
	ИначеЕсли Имя = "РабочиеЛисты.VIN" Тогда
		Если обЗначениеНеЗаполнено(ТекСтрока.VIN) Тогда
			ТекСтрока.Автомобиль = ""; 
			ТекСтрока.РабочийЛист = "";
			ТекСтрока.СуммаПоАкту = "";
			ТекСтрока.МаркетинговаяПрограмма = "";
			ТекСтрока.Сумма = "";
			ТекСтрока.ВариантКомпенсации = "";
		Иначе	                                  
			ТекСтрока.Автомобиль = Справочники.Автомобили.НайтиПоРеквизиту("VIN",ТекСтрока.VIN);
			ТекСтрока.РабочийЛист = НайтиРЛмодуль(ТекСтрока.Автомобиль); 
		КонецЕсли;
	ИначеЕсли Имя = "РабочиеЛисты.Автомобиль" Тогда
		Если обЗначениеНеЗаполнено(ТекСтрока.Автомобиль) Тогда
			ТекСтрока.VIN = ""; 
			ТекСтрока.РабочийЛист = "";
			ТекСтрока.СуммаПоАкту = "";
			ТекСтрока.МаркетинговаяПрограмма = "";
			ТекСтрока.Сумма = "";
			ТекСтрока.ВариантКомпенсации = "";
		Иначе	
			ТекСтрока.VIN = ТекСтрока.Автомобиль.VIN;
			ТекСтрока.РабочийЛист = НайтиРЛмодуль(ТекСтрока.Автомобиль); 
		КонецЕсли;
		//Бондаренко-- 20260502
	Иначе
		//Бондаренко++ 20230716
		//Результат = дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Если ( РольДоступна("ПолныеПрава") ИЛИ РольДоступна("СМ_Бухгалтер") ) И ( Имя = "Товары.СтавкаНДС" ИЛИ Имя = "Товары.Сумма" ИЛИ Имя = "Товары.СуммаВсего" ) И ЭтотОбъект.ИзмененаСуммаНДС Тогда
			СтараяСуммаНДС = ТекСтрока.СуммаНДС;
			//Бондаренко++ 20230718
			СтараяСумма = ТекСтрока.Сумма;
			СтараяСуммаВсего = ТекСтрока.СуммаВсего;
			//Бондаренко-- 20230718
 			Результат = дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
			ТекСтрока.СуммаНДС = СтараяСуммаНДС;
 			//Бондаренко++ 20230718
			ТекСтрока.Сумма = СтараяСумма;
			ТекСтрока.СуммаВсего = СтараяСуммаВсего;
			//Бондаренко-- 20230718
			
		// Семенихин 09.01.2025 +++++
		ИначеЕсли Имя = "Организация" И (ХозОперация = Справочники.ХозОперации.РеализацияАгентскихУслуг
			Или ХозОперация = Справочники.ХозОперации.АктОбОказанииУслуг) Тогда
			Возврат Истина;
		// Семенихин 14.01.2025 -----
		
		Иначе
			Результат = дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		КонецЕсли;
		//Бондаренко-- 20230716 
		Если Имя = "Дата" ИЛИ Имя = "ВалютаДокумента" ИЛИ Имя = "Карточка" Тогда
			ОбработкаРеквизита("КоличествоКСписанию", ТекСтрока, ЭтаФорма, ДопПараметры);
		КонецЕсли;
		Возврат Результат;
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()

//Бондаренко++ 20260502
Функция НайтиРЛмодуль(Автомобиль) Экспорт

	РабЛист_ = "";
	
	Если НЕ обЗначениеНеЗаполнено(Автомобиль) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияАвтомобилейАвтомобили.Ссылка КАК Реализация,
		|	РеализацияАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
		|	РеализацияАвтомобилейАвтомобили.Ссылка.Дата КАК Дата,
		|	РеализацияАвтомобилейАвтомобили.Ссылка.Проведен КАК Проведен,
		|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль.ДокументОснование КАК РабочийЛист
		|ИЗ
		|	Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
		|ГДЕ
		|	РеализацияАвтомобилейАвтомобили.Ссылка.Проведен
		|	И НЕ РеализацияАвтомобилейАвтомобили.Ссылка.Контрагент.НашаФирма
		|	И РеализацияАвтомобилейАвтомобили.Автомобиль = &Автомобиль
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
		
		Запрос.Параметры.Вставить("Автомобиль",Автомобиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			РабЛист_ = ВыборкаДетальныеЗаписи.РабочийЛист;
			Прервать;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат РабЛист_;
   
КонецФункции // НайтиРЛмодуль(Автомобиль)
//Бондаренко++ 20260502


//Бондаренко++ 20260226	
Функция НайтиСуммуКомпенсации(МаркПрогр,РабЛист,СтрокаТекущая) Экспорт
	
	СумКомп = 0;
	
	Если РабЛист.МаркетинговаяПрограммаСкидкаТрейдИн = МаркПрогр Тогда
		СумКомп = 0 + РабЛист.КомпенсацияТрейдИНРетроспективная + РабЛист.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля;
		Если РабЛист.КомпенсацияТрейдИНРетроспективная > 0 Тогда
			СтрокаТекущая.ВариантКомпенсации = Перечисления.ВариантКомпенсации.Ретроспективная;
 		Иначе
			СтрокаТекущая.ВариантКомпенсации = Перечисления.ВариантКомпенсации.ВИнвойсеСледующего;
		КонецЕсли;
 	ИначеЕсли РабЛист.МаркетинговаяПрограммаСкидкаТрейдИн2 = МаркПрогр Тогда
		СумКомп = 0 + РабЛист.КомпенсацияТрейдИН2Ретроспективная + РабЛист.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля;	
		Если РабЛист.КомпенсацияТрейдИН2Ретроспективная > 0 Тогда
			СтрокаТекущая.ВариантКомпенсации = Перечисления.ВариантКомпенсации.Ретроспективная;
 		Иначе
			СтрокаТекущая.ВариантКомпенсации = Перечисления.ВариантКомпенсации.ВИнвойсеСледующего;
		КонецЕсли;
	ИначеЕсли РабЛист.МаркетинговаяПрограммаСкидкаСубсидияКредит = МаркПрогр Тогда
		СумКомп = 0 + РабЛист.КомпенсацияСубсидияКредитРетроспективная + РабЛист.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля;	
		Если РабЛист.КомпенсацияСубсидияКредитРетроспективная > 0 Тогда
			СтрокаТекущая.ВариантКомпенсации = Перечисления.ВариантКомпенсации.Ретроспективная;
 		Иначе
			СтрокаТекущая.ВариантКомпенсации = Перечисления.ВариантКомпенсации.ВИнвойсеСледующего;
		КонецЕсли;
	ИначеЕсли РабЛист.МаркетинговаяПрограммаСкидкаПоПрограммамЛояльности = МаркПрогр Тогда
		СумКомп = 0 + РабЛист.КомпенсацияПоПрограммамЛояльностиРетроспективная + РабЛист.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля;	
		Если РабЛист.КомпенсацияПоПрограммамЛояльностиРетроспективная > 0 Тогда
			СтрокаТекущая.ВариантКомпенсации = Перечисления.ВариантКомпенсации.Ретроспективная;
 		Иначе
			СтрокаТекущая.ВариантКомпенсации = Перечисления.ВариантКомпенсации.ВИнвойсеСледующего;
		КонецЕсли;
 	ИначеЕсли РабЛист.МаркетинговаяПрограммаСкидкаПоПрограммамЛояльностиДополнительно = МаркПрогр Тогда
		СумКомп = 0 + РабЛист.КомпенсацияРозничнаяРетроспективная + РабЛист.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля;	
		Если РабЛист.КомпенсацияРозничнаяРетроспективная > 0 Тогда
			СтрокаТекущая.ВариантКомпенсации = Перечисления.ВариантКомпенсации.Ретроспективная;
 		Иначе
			СтрокаТекущая.ВариантКомпенсации = Перечисления.ВариантКомпенсации.ВИнвойсеСледующего;
		КонецЕсли;
	КонецЕсли;    
	
	Возврат СумКомп;
 
КонецФункции // НайтиСуммуКомпенсации(МаркПрогр,РабЛист)
//Бондаренко++ 20260226	

// заполнение свойств из документа основания
Процедура ЗаполнитьСвойстваНаОсновании(Основание) Экспорт
	//зарезервировано для описания заполнения свойств из свойств основания
КонецПроцедуры

Функция СформироватьСводнуюТаблицу()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Строка");
	Таблица.Колонки.Добавить("Таблица");
	Таблица.Колонки.Добавить("Сумма");
	Таблица.Колонки.Добавить("РаспределенноеЗначение");
	
	Для Каждого Строка Из Товары Цикл
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.Строка                 = Строка;
		НоваяСтрока.Таблица                = "Товары";
		НоваяСтрока.Сумма                  = Строка.СуммаВсего + Строка.СуммаСкидкиБонусами;
		НоваяСтрока.РаспределенноеЗначение = 0;
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

#Если Клиент Тогда
	
	//Функция печати этикеток и ценников
	// 
	// Параметры:
	//  ТабДокумент - табличный документ.
	//
	Функция ПечатьЭтикетокИЦенников(ТабДокумент) Экспорт
		дкПечатьЭтикетокИЦенников(ЭтотОбъект);
	КонецФункции // ПечатьЭтикетокИЦенников()
	
	// Формирует табличный документ 
	// 
	// Параметры:
	//  ТабДокумент - табличный документ.
	//
	// Возвращаемое значение:
	//  ТабДокумент - возвращает сформированный табличный документ.
	//
	Функция ПечатьРеализацияТоваров(ТабДокумент) Экспорт
		Макет = ПолучитьМакет("РеализацияТоваров");
		
		//для начала настроим макет
		ОбластьШапкаТаблицы = дкПривестиМакетПечатнойФормы(ЭтотОбъект,Макет);
		ВалютаПечатногоДокумента=зфВыборВалютыПечатногоДокумента(ЭтотОбъект);
		Если ВалютаПечатногоДокумента = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
		Если ПустаяСтрока(ФорматВыводаСуммы) Тогда
			ФорматВыводаСуммы = ФорматВыводаСуммы + "ЧДЦ=2; ЧН=0,00";
		КонецЕсли;
		
 		//вывод заголовка документа
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		ОбластьМакета.Параметры.ВалютаДокумента = ВалютаПечатногоДокумента;
		Если ХозОперация=Справочники.ХозОперации.АктОбОказанииУслуг ИЛИ
			ХозОперация=Справочники.ХозОперации.РеализацияАгентскихУслуг Тогда
			ТекстЗаголовка = ХозОперация.Наименование+" № "+дкПолучитьНомерДляПечати(ЭтотОбъект)+" от "+Формат(Дата,"ДФ=dd.MM.yyyy");
			ОбластьМакета.Параметры.Поставщик = "Исполнитель";
			ОбластьМакета.Параметры.Покупатель = "Заказчик";
		Иначе
			ОбластьМакета.Параметры.Поставщик = "Поставщик";
			ОбластьМакета.Параметры.Покупатель = "Покупатель";
			ТекстЗаголовка = дкПолучитьПредставление(ЭтотОбъект);
		КонецЕсли; 
		ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;

		ДополнительныеПараметры = спСоздатьПараметрыПолученияПредставления();
		ДополнительныеПараметры.Вставить("ИспользоватьКПППодразделения");
		ДополнительныеПараметры.Вставить("ПодразделениеКомпании", ПодразделениеКомпании);
		ОбластьМакета.Параметры.ПредставлениеПоставщика = спПолучитьПредставление(Организация, , ДополнительныеПараметры);

		ОбластьМакета.Параметры.ПредставлениеПокупателя = спПолучитьПредставление(Контрагент);
		ОбластьМакета.Параметры.ПредставлениеСклада = спПолучитьНаименование(СкладКомпании);
		//вывод свойств
		СтрокаСвойств = дкПолучитьСтрокуСвойствДокумента(ЭтотОбъект);
		ОбластьМакета.Параметры.СтрокаСвойств = СтрокаСвойств;
		ТабДокумент.Вывести(ОбластьМакета);
		НомерСтраницы = 2;
		НомерСтраницыПред = НомерСтраницы;
		//                        
		Если ХозОперация = Справочники.ХозОперации.АктОбОказанииУслуг ИЛИ
			ХозОперация=Справочники.ХозОперации.РеализацияАгентскихУслуг Тогда
			ОбластьШапкаТаблицы.Параметры.Товар = "Услуга";
		Иначе
			ОбластьШапкаТаблицы.Параметры.Товар = "Товар";
		КонецЕсли;
		
        СМГ_ПечатьАдресаЗаказа(ТабДокумент,Макет);
		
  		//теперь выводим шапку
		ТабДокумент.Вывести(ОбластьШапкаТаблицы);
		
		//готовим области строки
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		
		ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента,СуммаСкидки,СуммаНДС,СуммаВсего",ВалютаПечатногоДокумента,0,0,0);
		//заполним параметры шапки таблицы для следующего листа
		ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		
		Если ХозОперация=Справочники.ХозОперации.АктОбОказанииУслуг ИЛИ
			ХозОперация=Справочники.ХозОперации.РеализацияАгентскихУслуг Тогда
			ОбластьПодвал = Макет.ПолучитьОбласть("ПодвалАкта");
		Иначе
			ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		КонецЕсли;	
		
		//перебор строк
		ВыборкаТабличнойЧасти=ЭтотОбъект.Товары.Выгрузить();
		зфПерерасчетТаблицыТоваров(ВыборкаТабличнойЧасти,ЭтотОбъект,ВалютаПечатногоДокумента);
		Для каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
			//заполняем данные строки
			СтруктураСтроки = дкПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТабличнойЧасти,ЭтотОбъект);
			ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);
			
			//доп. области
			мсвДопОбластиПодвала = Неопределено;
			Если ВыборкаТабличнойЧасти.Индекс(СтрокаТабличнойЧасти) = ВыборкаТабличнойЧасти.Количество()-1 Тогда
				мсвДопОбластиПодвала = Новый Массив;
				мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
			КонецЕсли;		
			
			//выводим строку, делая проверку попадания на лист
			НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице,
			НомерСтраницы, СтруктураИтоговПоСтранице, ЭтотОбъект, мсвДопОбластиПодвала);
			
			//инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента,СуммаСкидки,СуммаНДС,СуммаВсего",ВалютаПечатногоДокумента,0,0,0);
				НомерСтраницыПред = НомерСтраницы;
				ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			КонецЕсли;
			//добавляем итоги
			дкДобавитьИтогиПоСтранице(СтрокаТабличнойЧасти,СтруктураИтоговПоСтранице);
			
		КонецЦикла;
		
		//выводим последний подвал, если страниц больше единицы
		Если НомерСтраницы > 2 Тогда
			дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьМакетаИтогоПоСтранице,СтруктураИтоговПоСтранице,ЭтотОбъект);
		КонецЕсли;
		
		//итоги
		
		ОбластьПодвал.Параметры.ВалютаДокумента = ВалютаПечатногоДокумента;
		СуммаВсего = ВыборкаТабличнойЧасти.Итог("СуммаВсего");
		ОбластьПодвал.Параметры.СуммаВсего = Формат(СуммаВсего,ФорматВыводаСуммы);
		НДСВсего = ВыборкаТабличнойЧасти.Итог("СуммаНДС");
		ОбластьПодвал.Параметры.НДСВсего = Формат(НДСВсего,ФорматВыводаСуммы);
		Если ВыборкаТабличнойЧасти.Итог("СуммаСкидки")>0 ИЛИ ВыборкаТабличнойЧасти.Итог("СуммаСкидкиСтроки") > 0 ИЛИ ВыборкаТабличнойЧасти.Итог("СуммаСкидкиБонусами") > 0 Тогда
			СкидкаВсего = ВыборкаТабличнойЧасти.Итог("СуммаСкидки") + ВыборкаТабличнойЧасти.Итог("СуммаСкидкиБонусами");
			Попытка
				СкидкаВсего = СкидкаВсего + ВыборкаТабличнойЧасти.Итог("СуммаСкидкиСтроки");
			Исключение
			КонецПопытки;
			ОбластьПодвал.Параметры.СкидкаВсего = Формат(СкидкаВсего,ФорматВыводаСуммы);
		КонецЕсли;
		ОбластьПодвал.Параметры.СуммаПрописью = "Всего наименований "+ВыборкаТабличнойЧасти.Количество()+" на сумму " + обЧислоПрописью(СуммаВсего,ВалютаПечатногоДокумента);
		
		// сформируем информацию о бонусных баллах
		ТекстБаллы = "";
		Если ЭтотОбъект.КоличествоКСписанию > 0 Тогда
			ТекстБаллы = ТекстБаллы + "Для оплаты использованы бонусные баллы в количестве " + ЭтотОбъект.КоличествоКСписанию +
			" на сумму "+(ВыборкаТабличнойЧасти.Итог("СуммаСкидкиБонусами")) + " " + ВалютаПечатногоДокумента +".";
		КонецЕсли;
		
		Если ЭтотОбъект.КоличествоКНачислению > 0 Тогда
			ТекстБаллы = ТекстБаллы +?(ПустаяСтрока(ТекстБаллы), "", " ")+ "Было начислено "+ ЭтотОбъект.КоличествоКНачислению +" бонусных баллов на сумму в " +
			КоличествоКНачислению*Карточка.БонуснаяПрограмма.КратностьБонусов + " "+ Карточка.БонуснаяПрограмма.ВалютаБонуса+".";
		КонецЕсли;
		
		Если ПустаяСтрока(ТекстБаллы) Тогда
			ТекОбласть = ОбластьПодвал.Область(5, , 5, );
			ТекОбласть.АвтовысотаСтроки = Ложь;
			ТекОбласть.ВысотаСтроки = 1;
			ОбластьПодвал.Область(5, 2, 5, 2).Текст = "";
		Иначе
			ОбластьПодвал.Параметры.БонусныеБаллы = ТекстБаллы;
		КонецЕсли;		
		
		// Выводим представления и расшифровки подписей
		Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
		Отпустил.ОтпустилПредставление = ?(обЗначениеНеЗаполнено(Отпустил.Отпустил),"","/ "+ Отпустил.ОтпустилПредставление);
		ОбластьПодвал.Параметры.Заполнить(Отпустил);
		Получил  = дкОтветственноеЛицо(ЭтотОбъект,"ПолучилКонтрагент");
		Получил.Вставить("ПолучилПредставление", ?(обЗначениеНеЗаполнено(Получил.ПолучилКонтрагент),"","/ "+ Получил.ПолучилКонтрагентПредставление));
		//Получил.ПолучилПредставление = ?(обЗначениеНеЗаполнено(Получил.Получил),"","/ "+ Получил.ПолучилПредставление);
		ОбластьПодвал.Параметры.Заполнить(Получил);
		
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвал, , , НомерСтраницы,,ЭтотОбъект);
		
		Возврат ТабДокумент;
	КонецФункции // ПечатьРеализацияТоваров()
	
	// Формирует табличный документ 
	// 
	// Параметры:
	//  ТабДокумент - табличный документ.
	//
	// Возвращаемое значение:
	//  ТабДокумент - возвращает сформированный табличный документ.
	//
	Функция ПечатьПодборочныйЛист(ТабДокумент) Экспорт
		Макет = ПолучитьМакет("ПодборочныйЛист");
		
		ВыборкаТабличнойЧасти = ЭтотОбъект.Товары;
		
		//Настроим макет отчёта
		//Удаляем колонку "ЯчейкаХранения", если ни в одной из номенклатур этот реквизит не заполнен
		//Увеличиваем за её счёт колонку "Товар"
		ЕстьЯчейкиХранения=Ложь;
		Для Каждого СтрокаТЧ Из ВыборкаТабличнойЧасти Цикл
			Если НЕ обЗначениеНеЗаполнено(СтрокаТЧ.Ячейка) Тогда
				ЕстьЯчейкиХранения = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ЕстьЯчейкиХранения Тогда
			ОбластьТовар = Макет.Область("Товар");
			ОбластьЯчейкаХранения = Макет.Область("ЯчейкаХранения");
			ОбластьТовар.ШиринаКолонки = ОбластьТовар.ШиринаКолонки + ОбластьЯчейкаХранения.ШиринаКолонки;
			Макет.УдалитьОбласть(ОбластьЯчейкаХранения,ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;	
		
		//Настроим макет
		ОбластьШапкаТаблицы = дкПривестиМакетПечатнойФормы(ЭтотОбъект,Макет);
		
		//вывод заголовка документа
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		ТекстЗаголовка = дкПолучитьПредставление(ЭтотОбъект, "Подборочный лист");
		ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		
		Если НЕ обЗначениеНеЗаполнено(ПодразделениеКомпании) И НЕ обЗначениеНеЗаполнено(ПодразделениеКомпании.КПП) Тогда
			СтрокаПредставления = спПолучитьПредставление(Организация);
			ОбластьМакета.Параметры.ПредставлениеПоставщика = СтрЗаменить(СтрокаПредставления, Организация.КПП, ПодразделениеКомпании.КПП);
		Иначе	
			ОбластьМакета.Параметры.ПредставлениеПоставщика = спПолучитьПредставление(Организация);
		КонецЕсли;
		ОбластьМакета.Параметры.ПредставлениеПокупателя = спПолучитьПредставление(Контрагент);
		ОбластьМакета.Параметры.ПредставлениеСклада = спПолучитьНаименование(СкладКомпании);
		//вывод свойств
		СтрокаСвойств = дкПолучитьСтрокуСвойствДокумента(ЭтотОбъект);
		ОбластьМакета.Параметры.СтрокаСвойств = СтрокаСвойств;
		ТабДокумент.Вывести(ОбластьМакета);
		НомерСтраницы = 2;
		НомерСтраницыПред = НомерСтраницы;
				
		СМГ_ПечатьАдресаЗаказа(ТабДокумент,Макет);	
		
		//теперь выводим шапку
		ТабДокумент.Вывести(ОбластьШапкаТаблицы);
		
		//готовим области строки
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		
		ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		СтруктураИтоговПоСтранице = Новый Структура();
		//заполним параметры шапки таблицы для следующего листа
		ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		
		ВыборкаТабличнойЧасти = СМГ_ОтсортироватьПоЯчейкам(ВыборкатабличнойЧасти);
  		
		//перебор строк
		Для каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
			//заполняем данные строки
			СтруктураСтроки = дкПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТабличнойЧасти,ЭтотОбъект);
			//В возвращаемой структуре нет ключа "Ячейка", создадим его
			СтруктураСтроки.Вставить("Ячейка");
			//Если ЯчейкаХранения не определена для данной номенклатуры, то печатаем пробел
			ЯчейкаДляПечати = СокрЛП(СтрокаТабличнойЧасти.Ячейка.Код);
			СтруктураСтроки.Ячейка 	= ?(обЗначениеНеЗаполнено(ЯчейкаДляПечати)," ",ЯчейкаДляПечати);
			
			СтруктураСтроки = СМГ_ВставитьПроизводителя(СтруктураСтроки,СтрокаТабличнойЧасти);
			
 			ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);
			
			//доп. области
			мсвДопОбластиПодвала = Неопределено;
			Если ВыборкаТабличнойЧасти.Индекс(СтрокаТабличнойЧасти) = ВыборкаТабличнойЧасти.Количество()-1 Тогда
				мсвДопОбластиПодвала = Новый Массив;
				мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
			КонецЕсли;		
			
			//выводим строку, делая проверку попадания на лист
			НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице,
			НомерСтраницы, СтруктураИтоговПоСтранице, ЭтотОбъект, мсвДопОбластиПодвала);
			
			//инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				СтруктураИтоговПоСтранице = Новый Структура();
				НомерСтраницыПред = НомерСтраницы;
				ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			КонецЕсли;
			//добавляем итоги
			дкДобавитьИтогиПоСтранице(СтрокаТабличнойЧасти,СтруктураИтоговПоСтранице);
			
		КонецЦикла;
		
		//Итогов по странице на этой печатной форме нет, но выводим для прорисовки завершающей чёрной линии снизу страницы
		дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьМакетаИтогоПоСтранице,СтруктураИтоговПоСтранице,ЭтотОбъект);
		
		//итоги
		
		// Выводим представления и расшифровки подписей
		Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
		Отпустил.ОтпустилПредставление = ?(обЗначениеНеЗаполнено(Отпустил.Отпустил),"","/ "+ Отпустил.ОтпустилПредставление);
		ОбластьПодвал.Параметры.Заполнить(Отпустил);
		Получил  = дкОтветственноеЛицо(ЭтотОбъект,"ПолучилКонтрагент");
		Получил.Вставить("ПолучилПредставление", ?(обЗначениеНеЗаполнено(Получил.ПолучилКонтрагент),"","/ "+ Получил.ПолучилКонтрагентПредставление));
		//Получил.ПолучилПредставление = ?(обЗначениеНеЗаполнено(Получил.Получил),"","/ "+ Получил.ПолучилПредставление);
		ОбластьПодвал.Параметры.Заполнить(Получил);
		
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвал, , , НомерСтраницы,,ЭтотОбъект);
		
		Возврат ТабДокумент;
	КонецФункции // ПечатьПодборочныйЛист()
	
	// Формирует печатную форму "ТОРГ-12"
	// 
	// Параметры:
	//  ТабДокумент - табличный документ.
	//
	// Возвращаемое значение:
	//  ТабДокумент - возвращает сформированный табличный документ.
	//
	Функция ПечатьТОРГ12(ТабДокумент) Экспорт
		ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы", Права,,ЭтотОбъект);
		ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества", Права,,ЭтотОбъект);
		
		// Получим валюту регламентированного учета для перерасчета цены и суммы
		ВалютаРегл = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	
		// Зададим параметры макета
		ТабДокумент.ПолеСверху = 0;
		ТабДокумент.ПолеСлева  = 0;
		ТабДокумент.ПолеСнизу  = 0;
		ТабДокумент.ПолеСправа = 0;
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		Макет = ПолучитьОбщийМакет("ТОРГ12");
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		
		СтруктураПредставления1=Новый Структура(
		"Наименование,ИНН,КПП,АдресЮридический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		"","ИНН ","КПП ","","тел.: ","р/с ","в банке ","БИК ","к/с "
		);
		СтруктураПредставления2=Новый Структура(
		"Наименование,ИНН,КПП,АдресФактический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		"","ИНН ","КПП ","","тел.: ","р/с ","в банке ","БИК ","к/с "
		);
		
		// получим р/с из свойств документа
		РасчетныйСчетДокумента=обПолучитьЗначениеСвойства(ЭтотОбъект, "РасчетныйСчет", Неопределено);
		
		// Правим, что автоматом не заполнилось, или заполнилось неправильно
		//ДополнительныеПараметры = спСоздатьПараметрыПолученияПредставления();
		//ДополнительныеПараметры.ДляПечати = Истина;
		//ДополнительныеПараметры.РасчетныйСчетДокумента = РасчетныйСчетДокумента;
		//ОбластьМакета.Параметры.ОрганизацияПредставление= спПолучитьПредставление(
		//ОбластьМакета.Параметры.ПодразделениеКомпании,СтруктураПредставления2, ДополнительныеПараметры);
        ОбластьМакета.Параметры.ОрганизацияПредставление= спПолучитьПредставление(ОбластьМакета.Параметры.ПодразделениеКомпании,СтруктураПредставления2,РасчетныйСчетДокумента);
		
		ОбластьМакета.Параметры.Поставщик				= обПолучитьЗначениеСвойства(ЭтотОбъект,"ПоставщикОрганизация",ЭтотОбъект.Организация);
		ОбластьМакета.Параметры.ПоставщикПредставление	= спПолучитьПредставление(ОбластьМакета.Параметры.Поставщик,СтруктураПредставления2);
		
		ОбластьМакета.Параметры.Грузополучатель				= обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузополучатель",ЭтотОбъект.Контрагент);
		ОбластьМакета.Параметры.ГрузополучательПредставление= спПолучитьПредставление(ОбластьМакета.Параметры.Грузополучатель,СтруктураПредставления2);
		ОбластьМакета.Параметры.Плательщик					= обПолучитьЗначениеСвойства(ЭтотОбъект,"Плательщик",ЭтотОбъект.Контрагент);
		ОбластьМакета.Параметры.ПлательщикПредставление		= спПолучитьПредставление(ОбластьМакета.Параметры.Плательщик,СтруктураПредставления1);
		
		//дальше заполнить Шапку
		ОбластьМакета.Параметры.КодПоОКПО				= ЭтотОбъект.Организация.КодПоОКПО;
		ОбластьМакета.Параметры.ВидДеятельностиПоОКДП	= ЭтотОбъект.Организация.КодПоОКДП;
		ОбластьМакета.Параметры.ГрузополучательПоОКПО	= ОбластьМакета.Параметры.Грузополучатель.КодПоОКПО;
		ОбластьМакета.Параметры.ПоставщикПоОКПО			= ОбластьМакета.Параметры.Поставщик.КодПоОКПО;
		ОбластьМакета.Параметры.ПлательщикПоОКПО		= ОбластьМакета.Параметры.Плательщик.КодПоОКПО;
		
		ОбластьМакета.Параметры.ДокументОснованиеПредставление = ДоговорВзаиморасчетов.Наименование;
		ОбластьМакета.Параметры.ДокументОснование = ДоговорВзаиморасчетов;
		ОбластьМакета.Параметры.ОснованиеДата = "";
		ОбластьМакета.Параметры.ОснованиеНомер = ""; 
		
		ОбластьМакета.Параметры.Номер = дкПолучитьНомерДляПечати(ЭтотОбъект);	
		ТабДокумент.Вывести(ОбластьМакета);
		
		НомерСтраницы	= 2;
		НомерСтраницыПред = НомерСтраницы;
		КоличествоСтрокНаТекущейСтранице=0;
		
		ОбластьЗаголовокТаблицы	= Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ОбластьСтрока			= Макет.ПолучитьОбласть("Строка");
		ОбластьИтоги			= Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьВсего			= Макет.ПолучитьОбласть("Всего");
		//!!! TimR: В новой пф данное поле не выводится
		//ОбластьВсегоСтавкаНДС	= Макет.ПолучитьОбласть("ВсегоСтавкаНДС");
		
		СтруктураИтоговПоСтранице = Новый Структура("ИтогКоличествоПоСтранице,ИтогСуммыПоСтранице,ИтогНДСПоСтранице,ИтогСуммыСНДСПоСтранице",0,0,0,0);		
		
		ОбластьЗаголовокТаблицы.Параметры.валюта=ВалютаРегл;
		ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);	
		
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		
		//заполним параметры шапки таблицы для следующего листа
		ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		
		ВыборкаСтрок = ЭтотОбъект.Товары;
		
		КоличествоСтрок = ВыборкаСтрок.Количество();
		
		// инициализация итогов по документу
		ИтогоКоличество = 0;
		ИтогоСумма      = 0;
		ИтогоНДС        = 0;
		ИтогоСуммаСНДС  = 0;
		
		СоответствиеИтоговПоставкамНДС = Новый Соответствие();
		
		// Выводим многострочную часть документа
		Для каждого СтрокаТоваров Из ВыборкаСтрок Цикл
			//заполняем данные строки
			СтруктураСтроки = дкПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТоваров,ЭтотОбъект);
			ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);
			ОбластьСтрока.Параметры.Код							= дкПолучитьЗначениеКолонкиКода(СтрокаТоваров.Номенклатура,, ЭтотОбъект);			
			ОбластьСтрока.Параметры.БазоваяЕдиницаНаименование	= СтрокаТоваров.ЕдиницаИзмерения;
			ОбластьСтрока.Параметры.БазоваяЕдиницаКодПоОКЕИ		= СтрокаТоваров.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;
			ОбластьСтрока.Параметры.Количество					= Формат(СтрокаТоваров.КоличествоБазовое,ФорматВыводаКоличества);
			ОбластьСтрока.Параметры.КоличествоМест				= Формат(СтрокаТоваров.Количество,ФорматВыводаКоличества);
			ОбластьСтрока.Параметры.КоличествоВОдномМесте		= Формат(СтрокаТоваров.Коэффициент,ФорматВыводаКоличества);
			
			ОбластьСтрока.Параметры.ТоварНаименование 			= СтруктураСтроки.ТоварНаименование + ?(ЗначениеЗаполнено(СтрокаТоваров.Номенклатура.Артикул), ", "+СтрокаТоваров.Номенклатура.Артикул, "");
			
			// Пересчитаем сумму в соответствии с регламентированной валютой
			СуммаВсего = Окр(обПересчет(СтрокаТоваров.СуммаВсего, ВалютаДокумента, КурсДокумента, ВалютаРегл, Дата), 2);
			СуммаНДС   = Окр(обПересчет(СтрокаТоваров.СуммаНДС, ВалютаДокумента, КурсДокумента, ВалютаРегл, Дата), 2);
			СуммаБезНДС = СуммаВсего - СуммаНДС;
			
			ОбластьСтрока.Параметры.СуммаВсего  = Формат(СуммаВсего, ФорматВыводаСуммы);
			ОбластьСтрока.Параметры.СуммаНДС    = Формат(СуммаНДС, ФорматВыводаСуммы);
			ОбластьСтрока.Параметры.СуммаБезНДС = Формат(СуммаБезНДС, ФорматВыводаСуммы);
			
			// Рассчитаем цену.
			ОбластьСтрока.Параметры.ЦенаБезНДС = Формат(СуммаБезНДС / (СтрокаТоваров.Количество * ?(СтрокаТоваров.Коэффициент = 0, 1, СтрокаТоваров.Коэффициент)), ФорматВыводаСуммы);
			
			//доп. области
			мсвДопОбластиПодвала = Неопределено;
			Если ВыборкаСтрок.Индекс(СтрокаТоваров) = ВыборкаСтрок.Количество()-1 Тогда
				мсвДопОбластиПодвала = Новый Массив;
				мсвДопОбластиПодвала.Добавить(ОбластьВсего);
				//!!! TimR: В новой пф данное поле не выводится
				//мсвДопОбластиПодвала.Добавить(ОбластьВсегоСтавкаНДС);
				мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
			КонецЕсли;
			
			Если КоличествоСтрокНаТекущейСтранице=0 Тогда
				ТабДокумент.Вывести(ОбластьСтрока);
			Иначе
				//выводим строку, делая проверку попадания на лист		
				НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрока, ОбластьЗаголовокТаблицы, ОбластьИтоги,
				НомерСтраницы, СтруктураИтоговПоСтранице, ЭтотОбъект, мсвДопОбластиПодвала);
			КонецЕсли; 
			
			// увеличим итоги по странице
			СтруктураСтрокиИтогов = Новый Структура("ИтогКоличествоПоСтранице,ИтогСуммыПоСтранице,ИтогНДСПоСтранице,ИтогСуммыСНДСПоСтранице");
			СтруктураСтрокиИтогов.ИтогКоличествоПоСтранице = СтрокаТоваров.КоличествоБазовое;
			СтруктураСтрокиИтогов.ИтогСуммыПоСтранице      = СуммаБезНДС;
			СтруктураСтрокиИтогов.ИтогНДСПоСтранице		   = СуммаНДС;
			СтруктураСтрокиИтогов.ИтогСуммыСНДСПоСтранице  = СуммаВсего;
			
			//инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				СтруктураИтоговПоСтранице = Новый Структура("ИтогКоличествоПоСтранице,ИтогСуммыПоСтранице,ИтогНДСПоСтранице,ИтогСуммыСНДСПоСтранице",0,0,0,0);
				НомерСтраницыПред = НомерСтраницы;
				КоличествоСтрокНаТекущейСтранице=0;
				ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			Иначе
				КоличествоСтрокНаТекущейСтранице=КоличествоСтрокНаТекущейСтранице+1;
			КонецЕсли;
			//добавляем итоги
			дкДобавитьИтогиПоСтранице(СтруктураСтрокиИтогов,СтруктураИтоговПоСтранице);
			
			// итоги по ставкам НДС
			Если НЕ обЗначениеНеЗаполнено(СтрокаТоваров.СтавкаНДС) Тогда
				Если СоответствиеИтоговПоставкамНДС[СтрокаТоваров.СтавкаНДС] = Неопределено Тогда
					СоответствиеИтоговПоставкамНДС.Вставить(СтрокаТоваров.СтавкаНДС,0);
				КонецЕсли;
				СоответствиеИтоговПоставкамНДС[СтрокаТоваров.СтавкаНДС] = СоответствиеИтоговПоставкамНДС[СтрокаТоваров.СтавкаНДС] + СтрокаТоваров.СуммаНДС;
			КонецЕсли;
			
			//Сформируем итоги по документу
			ИтогоСумма      = ИтогоСумма + СуммаБезНДС;
			ИтогоНДС        = ИтогоНДС + СуммаНДС;
			ИтогоСуммаСНДС  = ИтогоСуммаСНДС + СуммаВсего;
			
		КонецЦикла;
		
		//выводим последний подвал, если страниц больше единицы
		Если НомерСтраницы > 1 Тогда
			дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьИтоги,СтруктураИтоговПоСтранице,ЭтотОбъект);
		КонецЕсли;
		
		// Выводим итоги по документу в целом
		ОбластьВсего.Параметры.ИтогКоличество = Формат(ВыборкаСтрок.Итог("КоличествоБазовое"), ФорматВыводаКоличества);
		ОбластьВсего.Параметры.ИтогСуммы      = Формат(ИтогоСумма, ФорматВыводаСуммы);
		ОбластьВсего.Параметры.ИтогНДС        = Формат(ИтогоНДС, ФорматВыводаСуммы);
		ОбластьВсего.Параметры.ИтогСуммыСНДС  = Формат(ИтогоСуммаСНДС, ФорматВыводаСуммы);
		ТабДокумент.Вывести(ОбластьВсего);
		
		//!!! TimR: В новой пф данное поле не выводится
		//// выведем итоги по ставкам НДС
		//Для Каждого ЭлементСоответствия Из СоответствиеИтоговПоставкамНДС Цикл
		//	ОбластьВсегоСтавкаНДС.Параметры.СтавкаНДС = "Итого по ставке НДС: "
		//	+дкПолучитьПредставлениеСтавкиНДС(ЭлементСоответствия.Ключ,"%");
		//	ОбластьВсегоСтавкаНДС.Параметры.ИтогНДС = ЭлементСоответствия.Значение;
		//	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьВсегоСтавкаНДС, , , НомерСтраницы,,ЭтотОбъект);
		//КонецЦикла;
		
		// Выводим подвал документа
		ОбластьПодвал.Параметры.Заполнить(ЭтотОбъект);
		ОбластьПодвал.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ЧислоПрописью(КоличествоСтрок, ,",,,,,,,,0");
		ОбластьПодвал.Параметры.СуммаПрописью = обЧислоПрописью(ИтогоСуммаСНДС,ВалютаРегл);
		
		Доверенность = обПолучитьЗначениеСвойства(ЭтотОбъект,"Доверенность");
		Если НЕ обЗначениеНеЗаполнено(Доверенность) Тогда
			ОбластьПодвал.Параметры.ДоверенностьНомер = ?(ПустаяСтрока(Доверенность.Серия),"",Доверенность.Серия + "-") + Доверенность.Номер;
			ОбластьПодвал.Параметры.ДоверенностьДата  = Доверенность.ДатаВыдачи;
			ОбластьПодвал.Параметры.ДоверенностьВыдана= Доверенность.КемВыдан;
			
			ВладелецДоверенности = Доверенность.Владелец;
			Если ТипЗнч(ВладелецДоверенности)=Тип("СправочникСсылка.Контрагенты") ИЛИ
				 ТипЗнч(ВладелецДоверенности)=Тип("СправочникСсылка.Организации") Тогда
				ОбластьПодвал.Параметры.ДоверенностьЧерезКого = спПолучитьНаименование(ВладелецДоверенности);
			ИначеЕсли ТипЗнч(ВладелецДоверенности)=Тип("СправочникСсылка.Сотрудники") Тогда
				ОбластьПодвал.Параметры.ДоверенностьЧерезКого = ?(обЗначениеНеЗаполнено(ВладелецДоверенности.Должность),"",спПолучитьНаименование(ВладелецДоверенности.Должность)+", ")+спПолучитьНаименование(ВладелецДоверенности);
			КонецЕсли;
		КонецЕсли; 
		
		ДатаОтгрузки=обПолучитьЗначениеСвойства(ЭтотОбъект,"ДатаОтгрузки",Дата('00010101'));
		ДатаОтгрузки=?(обЗначениеНеЗаполнено(ДатаОтгрузки),"""___""____________ 20___",Формат(ДатаОтгрузки,"ДФ=dd.MM.yyyy"));
		ОбластьПодвал.Параметры.ДатаОтгрузки = ДатаОтгрузки;
		
		// Заполним информацию о руководителях организации
		Руководитель = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.Руководитель);
		ОбластьПодвал.Параметры.Заполнить(Руководитель);
		
		ГлавныйБухгалтер = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер);
		ОбластьПодвал.Параметры.Заполнить(ГлавныйБухгалтер);
		
		Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
		ОбластьПодвал.Параметры.Заполнить(Отпустил);
		
		Получил = дкОтветственноеЛицо(ЭтотОбъект,"ПолучилКонтрагент");
		Получил.Вставить("ПолучилПредставление", ?(обЗначениеНеЗаполнено(Получил.ПолучилКонтрагент),"","/ "+ Получил.ПолучилКонтрагентПредставление));
		ОбластьПодвал.Параметры.Заполнить(Получил);
		
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвал, , , НомерСтраницы,,ЭтотОбъект);
		
		ТабДокумент.АвтоМасштаб = Истина;
		
		Возврат ТабДокумент;
	КонецФункции // ПечатьТОРГ12()
	
	// Формирует печатную форму Т-1 "Товарно-транспортная накладная"
	// 
	// Параметры:
	//  ТабДокумент - табличный документ.
	//
	// Возвращаемое значение:
	//  ТабДокумент - возвращает сформированный табличный документ.
	//
	Функция ПечатьТ1(ТабДокумент) Экспорт
		
		ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы", Права,,ЭтотОбъект);
		ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества", Права,,ЭтотОбъект);
		
		// Получим валюту регламентированного учета для перерасчета цены и суммы
		ВалютаРегл = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
 		
		// Зададим параметры макета
		ТабДокумент.ПолеСверху = 0;
		ТабДокумент.ПолеСлева  = 0;
		ТабДокумент.ПолеСнизу  = 0;
		ТабДокумент.ПолеСправа = 0;
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		Макет = ПолучитьОбщийМакет("ТТН");
		
		//дальше заполнить Шапку
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПредставления1=Новый Структура(
		"Наименование,ИНН,КПП,АдресЮридический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		"","ИНН ","КПП ","","тел.: ","р/с ","в банке ","БИК ","к/с ");
		СтруктураПредставления2=Новый Структура(
		"Наименование,ИНН,КПП,АдресФактический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		"","ИНН ","КПП ","","тел.: ","р/с ","в банке ","БИК ","к/с ");
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.НомерДокумента                = дкПолучитьНомерДляПечати(ЭтотОбъект);
		ОбластьМакета.Параметры.ДатаДокумента                 = Формат(Дата,"ДФ=dd.MM.yyyy");
		ОбластьМакета.Параметры.Грузоотправитель              = ЭтотОбъект.Организация;
		ОбластьМакета.Параметры.Грузополучатель               = обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузополучатель",ЭтотОбъект.Контрагент);
		ОбластьМакета.Параметры.Плательщик                    = обПолучитьЗначениеСвойства(ЭтотОбъект,"Плательщик",ЭтотОбъект.Контрагент);
		ОбластьМакета.Параметры.ГрузоотправительПредставление = спПолучитьПредставление(ОбластьМакета.Параметры.Грузоотправитель,СтруктураПредставления2);
		ОбластьМакета.Параметры.ГрузополучательПредставление  = спПолучитьПредставление(ОбластьМакета.Параметры.Грузополучатель,СтруктураПредставления2);
		ОбластьМакета.Параметры.ПлательщикПредставление       = спПолучитьПредставление(ОбластьМакета.Параметры.Плательщик,СтруктураПредставления1);
		ОбластьМакета.Параметры.ГрузополучательПоОКПО		  = ОбластьМакета.Параметры.Грузополучатель.КодПоОКПО;
		ОбластьМакета.Параметры.ГрузоотправительПоОКПО		  = ОбластьМакета.Параметры.Грузоотправитель.КодПоОКПО;
		ОбластьМакета.Параметры.ПлательщикПоОКПО			  = ОбластьМакета.Параметры.Плательщик.КодПоОКПО;
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Выводим заголовок таблицы
		ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ОбластьЗаголовокТаблицы.Параметры.Валюта=ВалютаРегл;
		ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
		
		НомерСтраницы	= 2;
		НомерСтраницыПред = НомерСтраницы;	
		
		// инициализация итогов по документу
		Ном            = 0;
		ИтогоМест      = 0;
		ИтогоВес       = 0;
		
		ОбластьСтрока	= Макет.ПолучитьОбласть("Строка");
		ОбластьИтоги	= Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьВсего	= Макет.ПолучитьОбласть("Всего");
		ОбластьПодвал	= Макет.ПолучитьОбласть("Подвал");
		
		// инициализация итогов по странице
		СтруктураИтоговПоСтранице = Новый Структура("Количество, СуммаВсего",0,0);
		
		//заполним параметры шапки таблицы для следующего листа
		ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы  = "Страница: " + НомерСтраницы;
		ОбластьЗаголовокТаблицы.Параметры.ТекстЗаголовка = "Товарно-транспортная накладная товарный раздел";
		
		ВыборкаСтрок = ЭтотОбъект.Товары;
		КоличествоСтрок = ВыборкаСтрок.Количество();
		
		//доп. области
		мсвДопОбластиПодвала = Новый Массив;
		мсвДопОбластиПодвала.Добавить(ОбластьВсего);
		мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
		ИтогСуммаВсего = 0;
		// Выводим многострочную часть документа
		Для Каждого СтрокаТоваров Из ВыборкаСтрок Цикл
			//заполняем данные строки
			Ном = Ном + 1;
			ТоварНаименование = спПолучитьНаименование(СтрокаТоваров.Номенклатура);
			Характеристика = СтрокаТоваров.ХарактеристикаНоменклатуры;
			//характеристику выводим в строке с наименованием
			ТоварНаименование = ТоварНаименование + ?(НЕ обЗначениеНеЗаполнено(Характеристика),", " + спПолучитьНаименование(Характеристика),"");
			
			СуммаВсего = Окр(обПересчет(СтрокаТоваров.СуммаВсего, ВалютаДокумента, КурсДокумента, ВалютаРегл, Дата), 2);
 			Цена=СуммаВсего/(СтрокаТоваров.КоличествоБазовое); 			МассаБрутто = Справочники.Номенклатура.ПолучитьВесНоменклатуры(СтрокаТоваров.Номенклатура, СтрокаТоваров.ЕдиницаИзмерения)*СтрокаТоваров.Количество;
						ОбластьСтрока.Параметры.КодПродукции				= СтрокаТоваров.Номенклатура.Код;
			ОбластьСтрока.Параметры.Артикул 					= СтрокаТоваров.Номенклатура.Артикул;
			ОбластьСтрока.Параметры.Количество					= Формат(СтрокаТоваров.КоличествоБазовое, ФорматВыводаКоличества);
			ОбластьСтрока.Параметры.Цена						= Формат(Цена, ФорматВыводаСуммы);
			ОбластьСтрока.Параметры.ТоварНаименование			= ТоварНаименование;
			ОбластьСтрока.Параметры.Номенклатура				= СтрокаТоваров.Номенклатура;
			ОбластьСтрока.Параметры.БазоваяЕдиницаНаименование	= спПолучитьНаименование(СтрокаТоваров.ЕдиницаИзмерения);
			ОбластьСтрока.Параметры.ВидУпаковки					= СтрокаТоваров.ЕдиницаИзмерения.ЕдиницаПоКлассификатору;
			ОбластьСтрока.Параметры.КоличествоМест				= Формат(СтрокаТоваров.Количество, ФорматВыводаКоличества);
			ОбластьСтрока.Параметры.Масса						= Формат(МассаБрутто/1000, ФорматВыводаКоличества);
			ОбластьСтрока.Параметры.СуммаВсего					= Формат(СтрокаТоваров.СуммаВсего, ФорматВыводаСуммы);
			
			ИтогоМест = ИтогоМест + СтрокаТоваров.Количество;
			ИтогоВес  = ИтогоВес + МассаБрутто;
			
			//выводим строку, делая проверку попадания на лист		
			НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрока, ОбластьЗаголовокТаблицы, ОбластьИтоги, НомерСтраницы, СтруктураИтоговПоСтранице, ЭтотОбъект, ?(Ном=КоличествоСтрок,мсвДопОбластиПодвала,Неопределено));
			
			//инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				СтруктураИтоговПоСтранице = Новый Структура("Количество, СуммаВсего",0,0);
				НомерСтраницыПред = НомерСтраницы;
				ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			КонецЕсли;
			
			//обновим итоги по странице
			СтруктураИтоговПоСтранице.Количество = СтруктураИтоговПоСтранице.Количество + СтрокаТоваров.КоличествоБазовое;
			СтруктураИтоговПоСтранице.СуммаВсего = СтруктураИтоговПоСтранице.СуммаВсего + (СтрокаТоваров.СуммаВсего);
 			ИтогСуммаВсего = ИтогСуммаВсего + СуммаВсего;
		КонецЦикла;
		
		//выводим последний подвал, если страниц больше единицы
		Если НомерСтраницы > 2 Тогда
			дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьИтоги,СтруктураИтоговПоСтранице,ЭтотОбъект);
		КонецЕсли;
		
		ИтогоКоличество = Товары.Итог("КоличествоБазовое");
		ИтогоСуммаСНДС  = ИтогСуммаВсего;
		
		// Выводим итоги по документу в целом
		ОбластьВсего.Параметры.Количество = Формат(ИтогоКоличество, ФорматВыводаКоличества);
		ОбластьВсего.Параметры.СуммаВсего = Формат(ИтогоСуммаСНДС, ФорматВыводаСуммы);
		
		ТабДокумент.Вывести(ОбластьВсего);
		
		// Выводим подвал документа
		Руководитель = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.Руководитель);
		ОбластьПодвал.Параметры.Заполнить(Руководитель);
		ГлавныйБухгалтер = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер);
		ОбластьПодвал.Параметры.Заполнить(ГлавныйБухгалтер);
		Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
		ОбластьПодвал.Параметры.Заполнить(Отпустил);
		Получил  = дкОтветственноеЛицо(ЭтотОбъект,"ПолучилКонтрагент");
		Получил.Вставить("ПолучилПредставление", ?(обЗначениеНеЗаполнено(Получил.ПолучилКонтрагент),"","/ "+ Получил.ПолучилКонтрагентПредставление));
		Получил.Вставить("ПолучилДолжность", Получил.ПолучилКонтрагентДолжность);
		Получил.Вставить("Получил", Получил.ПолучилКонтрагент);
		ОбластьПодвал.Параметры.Заполнить(Получил);
		ГрузополучательСтруктура = дкОтветственноеЛицо(ЭтотОбъект,"Грузополучатель");
		ОбластьПодвал.Параметры.Заполнить(ГрузополучательСтруктура);
		ОбластьПодвал.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ЧислоПрописью(КоличествоСтрок,,",,,,,,,,0");
		ОбластьПодвал.Параметры.КоличествоСтрок         = КоличествоСтрок;
		ОбластьПодвал.Параметры.ВсегоМестПрописью       = ЧислоПрописью(ИтогоМест,,",,,,,,,,3");
		ОбластьПодвал.Параметры.ВсегоНаименований       = ЧислоПрописью(КоличествоСтрок,,",,,,,,,,0");
		ОбластьПодвал.Параметры.ОтпущеноНаСуммуПрописью = обЧислоПрописью(ИтогоСуммаСНДС,ВалютаРегл);
		ОбластьПодвал.Параметры.ВсегоКОплате			 = Формат(ИтогоСуммаСНДС, ФорматВыводаСуммы);
		ОбластьПодвал.Параметры.МассаГрузаБрутто		= ЧислоПрописью(ИтогоВес,,",,,,,,,,0")+"кг";
		Попытка ОбластьПодвал.Параметры.МассаВсего				= Формат(ИтогоВес / 1000, ФорматВыводаКоличества);	Исключение КонецПопытки; 
		ОбластьПодвал.Параметры.ВсегоМестПрописью       = ЧислоПрописью(ИтогоМест,,",,,,,,,,0");
		Доверенность = обПолучитьЗначениеСвойства(ЭтотОбъект,"Доверенность");
		Если НЕ обЗначениеНеЗаполнено(Доверенность) Тогда
			ОбластьПодвал.Параметры.НомерДоверенности = ?(ПустаяСтрока(Доверенность.Серия),"",Доверенность.Серия + "-") + Доверенность.Номер;
			ОбластьПодвал.Параметры.ДатаДоверености  = Формат(Доверенность.ДатаВыдачи, "ДЛФ=DD");
			ОбластьПодвал.Параметры.ДоверенностьВыдана= Доверенность.КемВыдан;
		КонецЕсли; 
		ТабДокумент.Вывести(ОбластьПодвал); 
		 		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ОбластьМакета   = Макет.ПолучитьОбласть("ТранспортныйРаздел");
		
		ЛицензионнаяКарточка 		= обПолучитьЗначениеСвойства(ЭтотОбъект, "ЛицензионнаяКарточка");
		СрокДоставки 				= обПолучитьЗначениеСвойства(ЭтотОбъект, "СрокДоставки");
		Перевозчик 					= обПолучитьЗначениеСвойства(ЭтотОбъект, "ОрганизацияПеревозчик");
		МаркаАвтомобиля     	    = обПолучитьЗначениеСвойства(ЭтотОбъект, "МаркаАвтомобиля");
		ГосНомерАвтомобиля	        = обПолучитьЗначениеСвойства(ЭтотОбъект, "ГосНомерАвтомобиля");
		Заказчик	 				= обПолучитьЗначениеСвойства(ЭтотОбъект, "ОрганизацияЗаказчик");
		Водитель					= обПолучитьЗначениеСвойства(ЭтотОбъект, "ФИОВодителя");
		ВодительскоеУдостоверение	= обПолучитьЗначениеСвойства(ЭтотОбъект, "ВодительскоеУдостоверение");
		ВидПеревозки	            = обПолучитьЗначениеСвойства(ЭтотОбъект, "ВидПеревозки");
		ПунктПогрузки             	= обПолучитьЗначениеСвойства(ЭтотОбъект, "ПунктПогрузки");
		ПунктРазгрузки            	= обПолучитьЗначениеСвойства(ЭтотОбъект, "ПунктРазгрузки");
		МаркаПрицепа 			  	= обПолучитьЗначениеСвойства(ЭтотОбъект, "Прицеп");
		ГосНомерПрицепа	           	= обПолучитьЗначениеСвойства(ЭтотОбъект, "ГосНомерПрицепа");
		
		Если ТипЗнч(ЛицензионнаяКарточка) = Тип("Булево") Тогда
			ШрифтСтандарт   = Новый Шрифт(ОбластьМакета.Области.Стандарт.Шрифт, , , , , , НЕ ЛицензионнаяКарточка);
			ШрифтОграничено = Новый Шрифт(ОбластьМакета.Области.Стандарт.Шрифт, , , , , , ЛицензионнаяКарточка);
			ОбластьМакета.Области.Стандарт.Шрифт   = ШрифтСтандарт;
			ОбластьМакета.Области.Ограничено.Шрифт = ШрифтОграничено;
		КонецЕсли;
		
		ОбластьМакета.Параметры.СрокДоставки              = СрокДоставки;
		ОбластьМакета.Параметры.Номер                     = дкПолучитьНомерДляПечати(ЭтотОбъект);
		ОбластьМакета.Параметры.ОрганизацияПеревозчик     = Перевозчик;
		ОбластьМакета.Параметры.МаркаАвтомобиля           = МаркаАвтомобиля;
		ОбластьМакета.Параметры.ГосНомерАвтомобиля        = ГосНомерАвтомобиля;
		ОбластьМакета.Параметры.ОрганизацияЗаказчик       = Заказчик;
		ОбластьМакета.Параметры.ФИОВодителя               = Водитель;
		ОбластьМакета.Параметры.ВодительскоеУдостоверение = ВодительскоеУдостоверение;
		ОбластьМакета.Параметры.ВидПеревозки              = ВидПеревозки;
		ОбластьМакета.Параметры.ПунктПогрузки             = ПунктПогрузки;
		ОбластьМакета.Параметры.ПунктРазгрузки            = ПунктРазгрузки;
		ОбластьМакета.Параметры.Прицеп                    = МаркаПрицепа;
		ОбластьМакета.Параметры.ГосНомерПрицепа           = ГосНомерПрицепа;
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("СведенияОГрузе");
		ТабДокумент.Вывести(ОбластьМакета);
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалСведенийОГрузе");
		ТабДокумент.Вывести(ОбластьМакета);
		ОбластьМакета = Макет.ПолучитьОбласть("ПогрузочныеОперации");
		ТабДокумент.Вывести(ОбластьМакета);
		ОбластьМакета = Макет.ПолучитьОбласть("ПрочиеСведения");
		ОбластьМакета.Параметры.валюта=ВалютаРегл;
		ТабДокумент.Вывести(ОбластьМакета);
		
		ТабДокумент.АвтоМасштаб = Истина;
		
		Возврат ТабДокумент;
	КонецФункции // ПечатьТ1()
	
	// Формирует печатную форму Приложение №4 "Транспортная накладная"
	// 
	// Параметры:
	//  ТабДокумент - табличный документ.
	//
	// Возвращаемое значение:
	//  ТабДокумент - возвращает сформированный табличный документ.
	//
	Функция ПечатьПриложение4(ТабДокумент) Экспорт
		ТабДокумент = дкПечатьНовойТТН(ЭтотОбъект,ТабДокумент);
		Возврат ТабДокумент;
	КонецФункции // ПечатьПриложение4()
	
	// Функция осуществляет печать произвольного документа.
	// Можно направить печать на экран или принтер, а также распечатать необходимое количество копий.
	//
	// Параметры:
	//	ЭтотОбъект							- ДокументОбъект	- Документ для печати
	//	НазваниеПечатнойФормы 				- Строка			- Название печатной формы, если пусто, то по умолчанию
	//	КоличествоЭкземпляров				- Число				- Количество экземпляров документа
	//	НаПринтер							- Булево			- Признак отправки документа на принтер без отображения его на экране
	//  Документ 	  						- ТабличныйДокумент	- Макет печатной формы
	//
	// Возвращаемое значение:
	//   ТабличныйДокумент	- Сформированная печатная форма
	//
	Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
		Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
	КонецФункции // Печать()
	
	// Формирует печатную форму "М-15"
// 
// Параметры:
//  ТабДокумент - табличный документ.
//
// Возвращаемое значение:
//  ТабДокумент - возвращает сформированный табличный документ.
//
Функция ПечатьМ15(ТабДокумент) Экспорт
	Макет = ПолучитьОбщийМакет("М15");
	
	// Зададим параметры макета
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;

	ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
	ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества",Права,,ЭтотОбъект);
	
	ТекстЗаголовка = дкПолучитьПредставление(ЭтотОбъект);
	
	// выводим шапку
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
	ОбластьМакета.Параметры.НомерДокумента = дкПолучитьНомерДляПечати(ЭтотОбъект);
	
	ДополнительныеПараметры = спСоздатьПараметрыПолученияПредставления();
	ДополнительныеПараметры.Вставить("ИспользоватьКПППодразделения");
	ДополнительныеПараметры.Вставить("ПодразделениеКомпании", ПодразделениеКомпании);
	ОбластьМакета.Параметры.ПредставлениеОрганизации = спПолучитьПредставление(Организация, , ДополнительныеПараметры);
	ОбластьМакета.Параметры.ОрганизацияПоОКПО = Организация.КодПоОКПО;
	ОбластьМакета.Параметры.ДатаСоставления = Формат(Дата, "ДФ = дд.ММ.гггг");
	ОбластьМакета.Параметры.ПодразделениеНаименование = спПолучитьНаименование(ПодразделениеКомпании);
	Если Не обЗначениеНеЗаполнено(ДоговорВзаиморасчетов) Тогда 
		ОбластьМакета.Параметры.Основание = спПолучитьНаименование(ДоговорВзаиморасчетов);
	КонецЕсли;
	ОбластьМакета.Параметры.КонтрагентНаименование = спПолучитьНаименование(Контрагент);
	ОбластьМакета.Параметры.Получатель = обПолучитьЗначениеСвойства(ЭтотОбъект,"Получатель");
	ТабДокумент.Вывести(ОбластьМакета); // конец шапки
	
	ВыборкаСтрок = ЭтотОбъект.Товары;
	
	//подвал выводим во временный
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ЧислоПрописью(ВыборкаСтрок.Количество(), ,",,,,,,,,0");
	ОбластьПодвал.Параметры.СуммаПрописью = обЧислоПрописью(ВыборкаСтрок.Итог("Сумма"), ВалютаДокумента);
	ОбластьПодвал.Параметры.ИтогНДС = обЧислоПрописью(ВыборкаСтрок.Итог("СуммаНДС"), ВалютаДокумента);
	Руководитель = дкОтветственноеЛицо(ЭтотОбъект, Перечисления.ВидыОбъектовСведений.Руководитель);
	ГлавныйБухгалтер = дкОтветственноеЛицо(ЭтотОбъект, Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер);
	Отпустил = дкОтветственноеЛицо(ЭтотОбъект, "Отпустил");
	Получил = дкОтветственноеЛицо(ЭтотОбъект,"ПолучилКонтрагент");
	Получил.Вставить("ПолучилПредставление", Получил.ПолучилКонтрагентПредставление);
	ОбластьПодвал.Параметры.Заполнить(Руководитель);
	ОбластьПодвал.Параметры.Заполнить(ГлавныйБухгалтер);
	ОбластьПодвал.Параметры.Заполнить(Отпустил);
	ОбластьПодвал.Параметры.Заполнить(Получил);
	ТабДокументПодвал = Новый ТабличныйДокумент;
	ТабДокументПодвал.Вывести(ОбластьПодвал);
	
	ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьРазделителя = Макет.ПолучитьОбласть("Разделитель");
	
	//сразу два, т.к. выводим на второй странице только
	НомерСтраницы = 2;
	НомерСтраницыПред = НомерСтраницы;
	
	// выводим заголовок таблицы
	ОбластьЗаголовокТаблицы.Параметры.Валюта = ВалютаДокумента;
	ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
	ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
		
	// Выводим многострочную часть документа
	Для каждого СтрокаТабличнойЧасти Из ВыборкаСтрок Цикл
		СтавкаНДС = СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС.Ставка;
		
		ОбластьСтрока.Параметры.Заполнить(СтрокаТабличнойЧасти);
		ОбластьСтрока.Параметры.ТоварНаименование            = спПолучитьНаименование(СтрокаТабличнойЧасти.Номенклатура);
		ОбластьСтрока.Параметры.ТоварКод					 = СтрокаТабличнойЧасти.Номенклатура.Код;
		ОбластьСтрока.Параметры.ЕдиницаИзмеренияКод 		 = СтрокаТабличнойЧасти.Номенклатура.БазоваяЕдиницаИзмерения.Код;
		ОбластьСтрока.Параметры.ЕдиницаИзмеренияНаименование = СтрокаТабличнойЧасти.Номенклатура.БазоваяЕдиницаИзмерения;
		ОбластьСтрока.Параметры.Количество 					 = Формат(СтрокаТабличнойЧасти.Количество,ФорматВыводаКоличества);
		ОбластьСтрока.Параметры.СуммаБезНДС 				 = Формат(СтрокаТабличнойЧасти.Сумма,ФорматВыводаСуммы);
		ОбластьСтрока.Параметры.Цена 						 = Формат(СтрокаТабличнойЧасти.Сумма/СтрокаТабличнойЧасти.Количество,ФорматВыводаСуммы);
		ОбластьСтрока.Параметры.СуммаСНДС 					 = Формат(СтрокаТабличнойЧасти.СуммаВсего,ФорматВыводаСуммы);
		ОбластьСтрока.Параметры.СуммаНДС					 = Формат(СтрокаТабличнойЧасти.СуммаНДС,ФорматВыводаСуммы);
		
		//доп. области
		мсвДопОбластиПодвала = Неопределено;
		Если ВыборкаСтрок.Индекс(СтрокаТабличнойЧасти) = ВыборкаСтрок.Количество()-1 Тогда
			мсвДопОбластиПодвала = Новый Массив;
			мсвДопОбластиПодвала.Добавить(ТабДокументПодвал);
		КонецЕсли;
		
		//выводим строку, делая проверку попадания на лист
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрока, ОбластьЗаголовокТаблицы, ОбластьРазделителя,
			НомерСтраницы, , ЭтотОбъект, мсвДопОбластиПодвала);
		
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			НомерСтраницыПред = НомерСтраницы;
			ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли;
	КонецЦикла;
		
	// выводим подвал
	ТабДокумент.Вывести(ТабДокументПодвал); // конец подвала
	
	Возврат ТабДокумент;
КонецФункции // ПечатьМ15()

// Формирует печатную форму "УПД"
// Возвращает сформированный табличный документ:
Функция ПечатьУПД(ТабДокумент) Экспорт
	
	ТабДокумент = дкПечатьУПД(ЭтотОбъект,ТабДокумент);
	
	Возврат ТабДокумент;
	
КонецФункции //ПечатьУПД()

// Формирует печатную форму "Акт об оказании услуг"
// Возвращает сформированный табличный документ:
Функция ПечатьАктОбОказанииУслуг(ТабДокумент) Экспорт
	
	Если ХозОперация <> Справочники.ХозОперации.АктОбОказанииУслуг
			И ХозОперация <> Справочники.ХозОперации.РеализацияАгентскихУслуг Тогда
			
			Сообщить(СтрШаблон(НСтр("ru = 'Печатная форма Акта об оказании услуг не доступна для Хоз.операции <%1>'"), ХозОперация));
			Возврат Неопределено;
			
	КонецЕсли;
	
	ДатаПечатная = Дата;
	
	Макет = ПолучитьМакет("АктОбОказанииУслуг");
	
	ФорматВыводаСуммы      = обПраво("ФорматВыводаСуммы", Права,,ЭтотОбъект);
	ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества", Права,,ЭтотОбъект);
	
	НомерДляПечати=дкПолучитьНомерДляПечати(ЭтотОбъект);
	
	//зададим параметры макета
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;

	ВалютаПечатногоДокумента=зфВыборВалютыПечатногоДокумента(ЭтотОбъект);
	Если ВалютаПечатногоДокумента=Неопределено Тогда Возврат Неопределено; КонецЕсли; 
	ТаблицаРабот=Товары.Выгрузить();
	зфПерерасчетТаблицыТоваров(ТаблицаРабот,ЭтотОбъект,ВалютаПечатногоДокумента,Истина);
		
	ЕстьСкидка = Истина;
	Если ТаблицаРабот.Итог("СуммаСкидки")=0 И ТаблицаРабот.Итог("СуммаСкидкиСтроки")=0 И ТаблицаРабот.Итог("СуммаСкидкиБонусами")=0 Тогда
		ЕстьСкидка = Ложь;
		ОбластьСкидка = Макет.Область("Скидка");
		ОбластьУслуга = Макет.Область("Услуга");
		
		ОбластьУслуга.ШиринаКолонки = ОбластьУслуга.ШиринаКолонки + ОбластьСкидка.ШиринаКолонки;
		Макет.УдалитьОбласть(ОбластьСкидка, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
		
	ФорматВыводаСуммы      = обПраво("ФорматВыводаСуммы", Права,,ЭтотОбъект);
	ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества", Права,,ЭтотОбъект);
		
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.НомерДок = НомерДляПечати;
	ОбластьМакета.Параметры.ДатаДок = Формат(ДатаПечатная, "ДФ = дд.ММ.гггг");
	ДополнительныеПараметры = спСоздатьПараметрыПолученияПредставления();
	ДополнительныеПараметры.ДляПечати = Истина;
	ОбластьМакета.Параметры.ПредставлениеПоставщика = спПолучитьПредставление(
		ЭтотОбъект.ПодразделениеКомпании, , ДополнительныеПараметры);
	ОбластьМакета.Параметры.ПредставлениеПолучателя = спПолучитьПредставление(ЭтотОбъект.Контрагент);
	СтрокаСвойств = дкПолучитьСтрокуСвойствДокумента(ЭтотОбъект);
	ОбластьМакета.Параметры.СтрокаСвойств = СтрокаСвойств;
	ОбластьМакета.Параметры.ВалютаДокумента = ВалютаПечатногоДокумента;
	ТабДокумент.Вывести(ОбластьМакета);
	
	Если НЕ обЗначениеНеЗаполнено(ДокументОснование) Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ДокументОснование");
		ОбластьМакета.Параметры.ДокументОснованиеПредставление = дкПолучитьПредставление(ДокументОснование);
		ОбластьМакета.Параметры.ДокументОснование=ДокументОснование;
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЕсли;
	
	ОбластьШапка = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ОбластьШапка);
		
	НомерСтраницы = 2;
	НомерСтраницыПред = 2;
	
	ТекстЗаголовка = СтрШаблон(НСтр("ru = 'Акт об оказании услуг № %1 от %2'"),НомерДляПечати, Формат(ДатаПечатная, "ДЛФ=D"));
		
	//заполним параметры шапки таблицы для следующего листа
	ОбластьШапка.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	ОбластьШапка.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		
	//Вывод табличной части работ

	СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента, СуммаВсего, СуммаНДС, СуммаСкидки",ВалютаПечатногоДокумента, 0, 0, 0);
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтогПоСтранице = Макет.ПолучитьОбласть("ИтогиПоСтранице");
		
	ВыборкаТабличнойЧасти = ТаблицаРабот;
	Для Каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
		ОбластьСтрока.Параметры.НомерСтроки = СтрокаТабличнойЧасти.НомерСтроки;
		ОбластьСтрока.Параметры.Работа = спПолучитьНаименование(СтрокаТабличнойЧасти.Номенклатура);
		ОбластьСтрока.Параметры.Количество = Формат(СтрокаТабличнойЧасти.Количество, ФорматВыводаКоличества);
		ОбластьСтрока.Параметры.Цена = Формат(СтрокаТабличнойЧасти.Цена, ФорматВыводаСуммы);
		Если ЕстьСкидка Тогда
			ОбластьСтрока.Параметры.СуммаСкидки = Формат(СтрокаТабличнойЧасти.СуммаСкидки+СтрокаТабличнойЧасти.СуммаСкидкиСтроки+СтрокаТабличнойЧасти.СуммаСкидкиБонусами, ФорматВыводаСуммы);
		КонецЕсли;
		ОбластьСтрока.Параметры.СуммаВсего = Формат(СтрокаТабличнойЧасти.СуммаВсего, ФорматВыводаСуммы);
		ОбластьСтрока.Параметры.СуммаНДС = Формат(СтрокаТабличнойЧасти.СуммаНДС, ФорматВыводаСуммы);
			
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрока, ОбластьШапка, ОбластьИтогПоСтранице, НомерСтраницы, СтруктураИтоговПоСтранице,ЭтотОбъект);
			
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента, СуммаВсего, СуммаНДС, СуммаСкидки",ВалютаПечатногоДокумента , 0, 0, 0);
			НомерСтраницыПред = НомерСтраницы;
			ОбластьШапка.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли;
			
		//обновим итоги по странице
		дкДобавитьИтогиПоСтранице(СтрокаТабличнойЧасти, СтруктураИтоговПоСтранице);
	КонецЦикла; 
		
	//довыводим последний итог по странице, если страниц больше единицы
	Если НомерСтраницы > 2 Тогда
		дкВывестиИтогиПоСтранице(ТабДокумент, ОбластьИтогПоСтранице, СтруктураИтоговПоСтранице, ЭтотОбъект);
	КонецЕсли;
		
	СуммаВсего=ВыборкаТабличнойЧасти.Итог("СуммаВсего");
	СуммаНДС=ВыборкаТабличнойЧасти.Итог("СуммаНДС");

		
	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	Если ЕстьСкидка Тогда
		ОбластьМакета.Параметры.СуммаСкидки = Формат(ВыборкаТабличнойЧасти.Итог("СуммаСкидки")+ВыборкаТабличнойЧасти.Итог("СуммаСкидкиСтроки")+ВыборкаТабличнойЧасти.Итог("СуммаСкидкиБонусами"), ФорматВыводаСуммы);
	КонецЕсли;
		
	ОбластьМакета.Параметры.СуммаВсего = Формат(СуммаВсего,ФорматВыводаСуммы);
	ОбластьМакета.Параметры.СуммаНДС = Формат(СуммаНДС,ФорматВыводаСуммы);
	ОбластьМакета.Параметры.ВалютаДокумента = ВалютаПечатногоДокумента;
	ТабДокумент.Вывести(ОбластьМакета);
		
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
	ОбластьМакета.Параметры.ИтоговаяСтрока = "Всего услуг "+ВыборкаТабличнойЧасти.Количество()+" на сумму "+Формат(СуммаВсего,ФорматВыводаСуммы)+" "+ВалютаПечатногоДокумента+" (в т.ч. НДС "+Формат(СуммаНДС,ФорматВыводаСуммы)+" "+ВалютаПечатногоДокумента+")";
	ОбластьМакета.Параметры.СуммаПрописью = обЧислоПрописью(СуммаВсего,ВалютаПечатногоДокумента);
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	// Выводим представления и расшифровки подписей
	Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
	Отпустил.ОтпустилПредставление = ?(обЗначениеНеЗаполнено(Отпустил.Отпустил),"","/ "+ Отпустил.ОтпустилПредставление);
	ОбластьМакета.Параметры.Заполнить(Отпустил);
	Получил  = дкОтветственноеЛицо(ЭтотОбъект,"ПолучилКонтрагент");
	Получил.Вставить("ПолучилПредставление", ?(обЗначениеНеЗаполнено(Получил.ПолучилКонтрагент),"","/ "+ Получил.ПолучилКонтрагентПредставление));
	ОбластьМакета.Параметры.Заполнить(Получил);
	
	ТабДокумент.Вывести(ОбластьМакета);
		
	Возврат ТабДокумент;
КонецФункции
#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Процедура - обработчик ввода на основании
Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	Если ТипЗнч(Основание)=Тип("ДокументСсылка.РабочийЛистОтделаСтрахования") Тогда
		БлокироватьПерерасчетСкидок	= Истина;
		ХозОперация		= Справочники.ХозОперации.РеализацияАгентскихУслуг;
	КонецЕсли;
	
	ОбработкаЗаполненияОтказ = НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание);
	
  	Если ТипЗнч(Основание)=Тип("ДокументСсылка.РабочийЛистОтделаСтрахования") Тогда			
 		Если ТипЗнч(Основание.Страхователь)=Тип("СправочникСсылка.Контрагенты") Тогда
			Контрагент		= Основание.Страхователь;
			ОбработкаРеквизита("Контрагент");
  		КонецЕсли;
		
		//СписокСтраховщиков	= Новый СписокЗначений();
		//Для Каждого СтрокаСтрахования Из Основание.ВариантыСтрахования Цикл
		//	Если СписокСтраховщиков.НайтиПоЗначению(СтрокаСтрахования.Страховщик)=Неопределено Тогда
		//		СписокСтраховщиков.Добавить(СтрокаСтрахования.Страховщик);
		//	КонецЕсли;
		//КонецЦикла;
		
		//Бондаренко++ 20251030
		//Если СписокСтраховщиков	.Количество()=1 Тогда
		//	Комитент	= СписокСтраховщиков[0].Значение;
		//	ОбработкаРеквизита("Комитент");
		//ИначеЕсли СписокСтраховщиков.Количество()>1 Тогда						
		//	ФормаВыбора	= Справочники.Контрагенты.ПолучитьФорму("ФормаСписка");
		//	ФормаВыбора.РежимВыбора			= Истина;
		//	ФормаВыбора.ЗакрыватьПриВыборе	= Истина;
		//	ФормаВыбора.ЭлементыФормы.Список.ИзменятьИерархическийПросмотр	= Ложь;
		//	ФормаВыбора.ЭлементыФормы.Список.ИерархическийПросмотр	= Ложь;
		//	ФормаВыбора.Отбор.Ссылка.ВидСравнения	= ВидСравнения.ВСписке;
		//	ФормаВыбора.Отбор.Ссылка.Значение		= СписокСтраховщиков;
		//	ФормаВыбора.Отбор.Ссылка.Использование	= Истина;
		//	ФормаВыбора.Отбор.ЭтоГруппа.Установить(Ложь);
		//	
		//	Выбрано	= ФормаВыбора.ОткрытьМодально();
		//	
		//	Если ТипЗнч(Выбрано)=Тип("СправочникСсылка.Контрагенты") Тогда
		//		Комитент	= Выбрано;
		//		ОбработкаРеквизита("Комитент");
		//	КонецЕсли;
		//КонецЕсли;
		//Бондаренко++ 20251030
		
		ЭтоПерваяСтрока = Истина;
		
		Для Каждого ТекСтрока Из Основание.ВариантыСтрахования Цикл
			Если Не ТекСтрока.Наличные Тогда
				Продолжить;
			КонецЕсли;
			Если Не ТекСтрока.ФормироватьРеализацию Тогда
				Продолжить;
			КонецЕсли;
			Если ЭтоПерваяСтрока Тогда
 				БылаЗаменаПодразделенияИлиОрганизации = Ложь;
				Если Не обЗначениеНеЗаполнено(ТекСтрока.АгентПодразделение) Тогда
					Если ПодразделениеКомпании <> ТекСтрока.АгентПодразделение Тогда
						ПодразделениеКомпании = ТекСтрока.АгентПодразделение;
						ОбработкаРеквизита("Подразделение"); 
						БылаЗаменаПодразделенияИлиОрганизации = Истина;
					КонецЕсли;
					Если Организация <> ТекСтрока.АгентПодразделение.Организация Тогда
						Организация = ТекСтрока.АгентПодразделение.Организация;
						ОбработкаРеквизита("Организация");
						БылаЗаменаПодразделенияИлиОрганизации = Истина;
					КонецЕсли;
					Если БылаЗаменаПодразделенияИлиОрганизации Тогда
						УстановитьНовыйНомер("");
					КонецЕсли; 
 					Комитент = ТекСтрока.СтраховаяКомпания.БанкКонтрагент;
 					ОбработкаРеквизита("Комитент");
  					Попытка
						ДоговорКомитента=СМ_ФормированиеНовыхОбъектов.НайтиСоздатьДоговорНеИстекший(Комитент,Организация,ПодразделениеКомпании,Перечисления.ВидыДоговоров.СКомитентом,Дата);
					Исключение
					КонецПопытки; 
 				КонецЕсли;
  				Контрагент		= Основание.Страхователь;
 				ОбработкаРеквизита("Контрагент");
 				Попытка
					ДоговорВзаиморасчетов=СМ_ФормированиеНовыхОбъектов.НайтиСоздатьДоговорНеИстекший(Контрагент,Организация,ПодразделениеКомпании,Перечисления.ВидыДоговоров.Продажа,Дата);
				Исключение
					//			
				КонецПопытки; 
				//Бондаренко++ 20251108
 				//ЭтоПерваяСтрока = Ложь;
				//Бондаренко-- 20251108
			КонецЕсли;			
			
			//Бондаренко++ 20251108
			Если ЭтоПерваяСтрока Тогда
				НоваяСтрока	= Товары.Добавить();
				НоваяСтрока.Номенклатура	= ТекСтрока.ПрограммаСтрахования.АгентскаяУслуга;
 				ОбработкаРеквизита("Товары.Номенклатура", НоваяСтрока);			
				НоваяСтрока.СтатьяДоходов = Справочники.СтатьиДоходовИРасходов.НачислениеДебиторскойЗадолженностиПоУслугам;
				НоваяСтрока.СуммаВсего		= ТекСтрока.СтраховаяСумма;
				ЭтоПерваяСтрока = Ложь;
			Иначе
				НоваяСтрока = Товары[0];
             	НоваяСтрока.СуммаВсего		= НоваяСтрока.СуммаВсего + ТекСтрока.СтраховаяСумма;
 			КонецЕсли;
			//Бондаренко-- 20251108
 			ОбработкаРеквизита("Товары.СуммаВсего", НоваяСтрока);
 		КонецЦикла; 
		
	//Бондаренко++ 20250424
	ИначеЕсли ТипЗнч(Основание)=Тип("ДокументСсылка.РабочийЛистКредитногоОтдела") Тогда 
		
		//Бондаренко++ 20250823
 		//ХозОперация = Справочники.ХозОперации.АктОбОказанииУслуг;
		ХозОперация = Справочники.ХозОперации.РеализацияАгентскихУслуг;
		//Бондаренко-- 20250823
		
		//Бондаренко++ 20250513
		ЭтоПерваяСтрока = Истина; 
		//Бондаренко++ 20250513
		
		Для Каждого ТекСтрока Из Основание.СтраховыеПродукты Цикл
			//Бондаренко++ 20250513
			Если Не ТекСтрока.Наличные Тогда
				Продолжить;
			КонецЕсли;
			Если Не ТекСтрока.ФормироватьРеализацию Тогда
				Продолжить;
			КонецЕсли; 
			Если ЭтоПерваяСтрока Тогда
 				БылаЗаменаПодразделенияИлиОрганизации = Ложь;
				Если Не обЗначениеНеЗаполнено(ТекСтрока.АгентПодразделение) Тогда
					Если ПодразделениеКомпании <> ТекСтрока.АгентПодразделение Тогда
						ПодразделениеКомпании = ТекСтрока.АгентПодразделение;
						ОбработкаРеквизита("Подразделение"); 
						БылаЗаменаПодразделенияИлиОрганизации = Истина;
					КонецЕсли;
					Если Организация <> ТекСтрока.АгентПодразделение.Организация Тогда
						Организация = ТекСтрока.АгентПодразделение.Организация;
						ОбработкаРеквизита("Организация");
						БылаЗаменаПодразделенияИлиОрганизации = Истина;
					КонецЕсли;
					Если БылаЗаменаПодразделенияИлиОрганизации Тогда
						УстановитьНовыйНомер("");
					КонецЕсли; 
					//Бондаренко++ 20250823
					Комитент = ТекСтрока.СтраховаяКомпания.БанкКонтрагент;
 					ОбработкаРеквизита("Комитент");
  					Попытка
						ДоговорКомитента=СМ_ФормированиеНовыхОбъектов.НайтиСоздатьДоговорНеИстекший(Комитент,Организация,ПодразделениеКомпании,Перечисления.ВидыДоговоров.СКомитентом,Дата);
					Исключение
					КонецПопытки; 
					//Бондаренко-- 20250823
				КонецЕсли;
				//Бондаренко++ 20250812
				//Контрагент		= ТексСтрока.СтраховаяКомпания;
 				Контрагент		= Основание.Клиент;
				//Бондаренко-- 20250812
				ОбработкаРеквизита("Контрагент");
 				Попытка
					ДоговорВзаиморасчетов=СМ_ФормированиеНовыхОбъектов.НайтиСоздатьДоговорНеИстекший(Контрагент,Организация,ПодразделениеКомпании,Перечисления.ВидыДоговоров.Продажа,Дата);
				Исключение
					//			
				КонецПопытки;
 				ЭтоПерваяСтрока = Ложь;
			КонецЕсли;
			//Бондаренко-- 20250513
			
			НоваяСтрока	= Товары.Добавить();
			НоваяСтрока.Номенклатура	= ТекСтрока.ПрограммаСтрахования.АгентскаяУслуга;
			ОбработкаРеквизита("Товары.Номенклатура", НоваяСтрока);			
			НоваяСтрока.СуммаВсего		= ТекСтрока.СуммаСтрахования;
			ОбработкаРеквизита("Товары.СуммаВсего", НоваяСтрока);
		КонецЦикла;
		//Бондаренко-- 20250424
	
	ИначеЕсли ТипЗнч(Основание)=Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		
		//КодыМаркировки.Очистить();
		Если Не обПраво("ВыборочноеСписаниеПартий",Права,,ЭтотОбъект) Тогда
			ТаблТовары = Основание.Товары.Выгрузить();
			ТаблТовары.Свернуть("Номенклатура,ЕдиницаИзмерения,Коэффициент,Ячейка", "Количество");
			Товары.Загрузить(ТаблТовары);
		КонецЕсли;
		
		
	ИначеЕсли ТипЗнч(Основание)=Тип("ДокументСсылка.ДоговорПроведенияТехническогоОсмотра") Тогда		
		ХозОперация=Справочники.ХозОперации.АктОбОказанииУслуг;
		БлокироватьПерерасчетСкидок=Истина;
		Товары.Очистить();
		НоваяСтрока=Товары.Добавить();
		НоваяСтрока.Номенклатура=Основание.Номенклатура;
		НоваяСтрока.Количество=1;
		НоваяСтрока.ЕдиницаИзмерения=НоваяСтрока.Номенклатура.ОсновнаяЕдиницаИзмерения;
		НоваяСтрока.Коэффициент=НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
		НоваяСтрока.КоличествоБазовое=1;
		НоваяСтрока.Цена=Основание.Цена;
		НоваяСтрока.Сумма=Основание.СуммаДокумента;
		НоваяСтрока.СтавкаНДС=Основание.СтавкаНДС;
		НоваяСтрока.СуммаНДС=Основание.СуммаНДС;
		НоваяСтрока.СуммаВсего=Основание.СуммаДокумента;
		ОбработкаРеквизита("Товары.СуммаВсего",НоваяСтрока);
		
	КонецЕсли;	
	
	Если НЕ обЗначениеНеЗаполнено(ПодразделениеКомпании) Тогда
		Если обПолучитьПраваИНастройкиПользователя(ПодразделениеКомпании,"ЗакрытиеЗаказовПоПодразделению",ЭтотОбъект) Тогда
			ЗакрытиеЗаказовПоПодразделению=Перечисления.ВариантыОтветов.Да;
		Иначе
			ЗакрытиеЗаказовПоПодразделению=Перечисления.ВариантыОтветов.Нет;
		КонецЕсли; 
	КонецЕсли; 
	
	Если ОбработкаЗаполненияОтказ Тогда Возврат; КонецЕсли;
	
	Если НЕ Основание = Неопределено Тогда
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказВнутренний") ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			Контрагент = Неопределено; ДоговорВзаиморасчетов = Неопределено;
			ТипЦенНовый = обПраво("ОсновнойТипЦенПродажи",Права,,ЭтотОбъект);
			Если ТипЦен<>ТипЦенНовый Тогда
				ТипЦен=ТипЦенНовый;
				Если НЕ ТипЦен.ВВалютеУчета Тогда
					Если обПраво("ИзменятьВалютуПоКатегорииЦен",Права,,ЭтотОбъект) Тогда
						ВалютаДокумента=ТипЦен.ВалютаЦены;
					КонецЕсли; 
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
	    СМГ_ТипОснованияЗаказПоставщику(Основание); 
		//Если ТипЗнч(Основание)<>Тип("ДокументСсылка.РабочийЛистОтделаСтрахования") Тогда
		//	ХозОперация = Справочники.ХозОперации.РеализацияТоваров;
		//КонецЕсли;
		Если Основание.ХозОперация = Справочники.ХозОперации.РасходныйСкладскойОрдер Тогда
			Если Не обЗначениеНеЗаполнено(Основание.ВладелецТовара) Тогда
				Если ТипЗнч(Основание.ВладелецТовара) = Тип("СправочникСсылка.Контрагенты") Тогда
					Контрагент = Основание.ВладелецТовара;
					ОбработкаРеквизита("Контрагент");
				КонецЕсли;
			КонецЕсли;
			Для Каждого СтрТовар Из Товары Цикл
				ОбработкаРеквизита("Товары.Номенклатура", СтрТовар);
			КонецЦикла;
			
			// заполняем ячейки
			Попытка
				Для Каждого стрТовар Из Товары Цикл
					Если стрТовар.Номенклатура = Основание.Товары[стрТовар.НомерСтроки-1].Номенклатура Тогда
						стрТовар.Ячейка = Основание.Товары[стрТовар.НомерСтроки-1].Ячейка;
					КонецЕсли;
				КонецЦикла;
			Исключение
			КонецПопытки;
			
		ИначеЕсли Основание.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваров И НЕ обЗначениеНеЗаполнено(Основание.СкладПолучатель)Тогда
			Если Основание.СкладПолучатель.Розничный Тогда
				ТипЦен = Основание.СкладПолучатель.ТипЦенРозничнойТорговли;
				Для Каждого СтрТовар Из Товары Цикл
					ОбработкаРеквизита("Товары.Номенклатура", СтрТовар);
				КонецЦикла;
			КонецЕсли;
			
			// заполняем ячейки
			Попытка
				Для Каждого стрТовар Из Товары Цикл
					Если стрТовар.Номенклатура = Основание.Товары[стрТовар.НомерСтроки-1].Номенклатура Тогда
						стрТовар.Ячейка = Основание.Товары[стрТовар.НомерСтроки-1].ЯчейкаПолучатель;
					КонецЕсли;
				КонецЦикла;
			Исключение
			КонецПопытки;
			
		ИначеЕсли ТипЗнч(Основание)=Тип("ДокументСсылка.ПоступлениеТоваров") ИЛИ
			ТипЗнч(Основание)=Тип("ДокументСсылка.ВводОстатковТоваров") ИЛИ
			ТипЗнч(Основание)=Тип("ДокументСсылка.АвансовыйОтчет") Тогда
			Контрагент = Неопределено;
			ДоговорВзаиморасчетов = Неопределено;
			ТипЦенНовый = обПраво("ОсновнойТипЦенПродажи",Права,,ЭтотОбъект);
			Если ТипЦен<>ТипЦенНовый Тогда
				ТипЦен=ТипЦенНовый;
				Если обПраво("ИзменятьВалютуПоКатегорииЦен",Права,,ЭтотОбъект) Тогда
					ВалютаДокумента=обВалютаТипаЦены(Неопределено,ТипЦен,Ложь);
				КонецЕсли; 
			КонецЕсли; 
			СтруктураКурса = обКурсДляВалюты(ВалютаДокумента,Дата);
			КурсДокумента  = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
			ВыборочноеСписаниеПартий=обПраво("ВыборочноеСписаниеПартий",Права,,ЭтотОбъект);
			СтратегияСписанияПартийТоваровПоДатам=Константы.СтратегияСписанияПартийТоваровПоДатам.Получить();
			ПартияТоваровОтрицательныхОстатков=Константы.ПартияТоваровОтрицательныхОстатков.Получить();
			Если СтратегияСписанияПартийТоваровПоДатам=Перечисления.СтратегияСписанияПартийТоваровПоДатам.Средняя Тогда
				ПартияРеализации = ПартияТоваровОтрицательныхОстатков;
			Иначе
				ПартияРеализации = ДокументОснование;
				Запрос=Новый Запрос;
				Запрос.Текст="ВЫБРАТЬ
				|	ПартииТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
				|	ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
				|	СУММА(ПартииТоваровКомпанииОстатки.КоличествоОстаток) КАК Количество
				|ИЗ
				|	РегистрНакопления.ПартииТоваровКомпании.Остатки(
				|			,
				|			СкладКомпании = &СкладКомпании
				|				И Партия = &Партия) КАК ПартииТоваровКомпанииОстатки
				|
				|СГРУППИРОВАТЬ ПО
				|	ПартииТоваровКомпанииОстатки.Номенклатура,
				|	ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры";
				Запрос.УстановитьПараметр("СкладКомпании",СкладКомпании);
				Запрос.УстановитьПараметр("Партия",ПартияРеализации);
				ОстаткиПартий=Запрос.Выполнить().Выгрузить();
				Запрос.Текст="ВЫБРАТЬ
				|	ГТДПартийТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
				|	ГТДПартийТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
				|	ГТДПартийТоваровКомпанииОстатки.ГТД КАК ГТД,
				|	СУММА(ГТДПартийТоваровКомпанииОстатки.КоличествоОстаток) КАК Количество
				|ИЗ
				|	РегистрНакопления.ГТДПартийТоваровКомпании.Остатки(
				|			,
				|			СкладКомпании = &СкладКомпании
				|				И Партия = &Партия) КАК ГТДПартийТоваровКомпанииОстатки
				|
				|СГРУППИРОВАТЬ ПО
				|	ГТДПартийТоваровКомпанииОстатки.Номенклатура,
				|	ГТДПартийТоваровКомпанииОстатки.ХарактеристикаНоменклатуры,
				|	ГТДПартийТоваровКомпанииОстатки.ГТД";
				ОстаткиГТД=Запрос.Выполнить().Выгрузить();
			КонецЕсли;	
			Для Каждого СтрТовар Из Товары Цикл
				Если ВыборочноеСписаниеПартий Тогда
					СтрТовар.Партия = ПартияРеализации;
				Иначе
					СтрТовар.Партия=Неопределено;
					СтрТовар.ГТД=Неопределено;
				КонецЕсли;
				Если СтратегияСписанияПартийТоваровПоДатам<>Перечисления.СтратегияСписанияПартийТоваровПоДатам.Средняя Тогда
					СтруктураПоиска=Новый Структура("Номенклатура,ХарактеристикаНоменклатуры",СтрТовар.Номенклатура,СтрТовар.ХарактеристикаНоменклатуры);
					ОстаткиТекущейПартии=ОстаткиПартий.НайтиСтроки(СтруктураПоиска);
					Если обЗначениеНеЗаполнено(СтрТовар.ГТД) Тогда
						ОстаткиТекущейГТД=Неопределено;
					Иначе
						СтруктураПоиска.Вставить("ГТД",СтрТовар.ГТД);
						ОстаткиТекущейГТД=ОстаткиГТД.НайтиСтроки(СтруктураПоиска);
					КонецЕсли; 
					Если обЗначениеНеЗаполнено(СтрТовар.ГТД) Тогда
						Если ОстаткиТекущейПартии.Количество()>0 Тогда
							СтрТовар.Количество=Мин(ОстаткиТекущейПартии[0].Количество/СтрТовар.Коэффициент,СтрТовар.Количество);
							ОстаткиТекущейПартии[0].Количество=СтрТовар.Количество*СтрТовар.Коэффициент;
							Если ОстаткиТекущейПартии[0].Количество=0 Тогда
								ОстаткиПартий.Удалить(ОстаткиТекущейПартии[0]);
							КонецЕсли; 
						Иначе
							СтрТовар.Количество=0;
						КонецЕсли; 
					Иначе
						Если ОстаткиТекущейГТД.Количество()>0 Тогда
							СтрТовар.Количество=Мин(ОстаткиТекущейГТД[0].Количество/СтрТовар.Коэффициент,СтрТовар.Количество);
							ОстаткиТекущейГТД[0].Количество=СтрТовар.Количество*СтрТовар.Коэффициент;
							Если ОстаткиТекущейГТД[0].Количество=0 Тогда
								ОстаткиГТД.Удалить(ОстаткиТекущейГТД[0]);
							КонецЕсли; 
						Иначе
							СтрТовар.Количество=0;
						КонецЕсли; 
						Если ОстаткиТекущейПартии.Количество()>0 Тогда
							ОстаткиТекущейПартии[0].Количество=СтрТовар.Количество*СтрТовар.Коэффициент;
							Если ОстаткиТекущейПартии[0].Количество=0 Тогда
								ОстаткиПартий.Удалить(ОстаткиТекущейПартии[0]);
							КонецЕсли; 
						Иначе
							СтрТовар.Количество=0;
						КонецЕсли; 
					КонецЕсли;
					ОбработкаРеквизита("Товары.Количество",СтрТовар);
				КонецЕсли;
				СтрТовар.Цена = обПолучитьЦену(ТипЦен,СтрТовар.Номенклатура,?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента, СтрТовар.ХарактеристикаНоменклатуры, СтрТовар.ЕдиницаИзмерения, ПодразделениеКомпании);
				ОбработкаРеквизита("Товары.Цена",СтрТовар);
			КонецЦикла;
			ПустыеСтроки=Товары.НайтиСтроки(Новый Структура("Количество",0));
			Для Сч=1 По ПустыеСтроки.Количество() Цикл
				Товары.Удалить(ПустыеСтроки[Сч-1]);
			КонецЦикла; 
			
		ИначеЕсли ТипЗнч(Основание)=Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			//Для ввода на основании заказа покупателя будем отгружать товары,
			//зарезервированные под данный заказ на данном складе
			Товары.Очистить();
			ЗаполнитьРезервамиКонтрагента(Основание);
			
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаявкаНаХранениеШин") Тогда
			ХозОперация=Справочники.ХозОперации.АктОбОказанииУслуг;
 		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
			СМГ_АгентскоеВознаграждение();
		КонецЕсли;
 	КонецЕсли;
	
	// если ввели на основании, но при этом не заполнили ставки НДС, то исправимся
	// так же установим ячейки хранения по умолчанию
	Для Каждого СтрокаТовар Из Товары Цикл
 		// Заполним доп. поля для товарной строки
		Если ПустаяСтрока(СтрокаТовар.ИдентификаторТовара) Тогда
			СтрокаТовар.ИдентификаторТовара = Новый УникальныйИдентификатор;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТовар.Номенклатура) Тогда Продолжить; КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТовар.СтавкаНДС) Тогда
			СтрокаТовар.СтавкаНДС = СтрокаТовар.Номенклатура.СтавкаНДС;
			Если НЕ обЗначениеНеЗаполнено(СтрокаТовар.СтавкаНДС) Тогда 
				ОбработкаРеквизита("Товары.СтавкаНДС",СтрокаТовар);
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТовар.Ячейка) Тогда Продолжить; КонецЕсли;
 		СтрокаТовар.Ячейка = Справочники.Номенклатура.ПолучитьЯчейкуХранения(СтрокаТовар.Номенклатура, СкладКомпании);
	КонецЦикла;
	
	// если вводили документ на основании перемещения, то подправим склад
	Попытка СкладКомпании=Основание.СкладПолучатель Исключение КонецПопытки;
	
	ИдентификаторГосударственногоКонтракта = ?(ЗначениеЗаполнено(ИдентификаторГосударственногоКонтракта),
	ИдентификаторГосударственногоКонтракта,
	ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта); 
	
	//Бондаренко++ 20220525
	РегламентированныйУчет=Истина;
	//Бондаренко-- 20220525
 	
КонецПроцедуры // ОбработкаЗаполнения()
  
Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
	//КодыМаркировки.Очистить();
КонецПроцедуры // ПриКопировании()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Отказ = СМГ_ПередЗаписью(РежимЗаписи);
	Если Отказ Тогда
		Возврат;
 	КонецЕсли;
	
 	ДополнительныеСвойства.Вставить("ДоговорВзаиморасчетовБыл");
	ДополнительныеСвойства.Вставить("СкладКомпанииБыл");
	ДополнительныеСвойства.Вставить("ЗаказБыл");
	ДополнительныеСвойства.Вставить("МоментВремениБыл");
	
	Если ХозОперация = Справочники.ХозОперации.АктОбОказанииУслуг ИЛИ
		ХозОперация = Справочники.ХозОперации.РеализацияАгентскихУслуг Тогда
		СкладКомпании=Справочники.СкладыКомпании.ПустаяСсылка();
	Иначе
		ПустаяСтатьяДоходов = Справочники.СтатьиДоходовИРасходов.ПустаяСсылка();
		Для Каждого ТекСтрока Из Товары Цикл
			ТекСтрока.СтатьяДоходов = ПустаяСтатьяДоходов;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда Возврат; КонецЕсли;
	
	Если НЕ Отказ Тогда
		//Проверим корректность видов введенной номенклатуры
		БлокироватьВидыНоменклатуры=ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры();
		Если БлокироватьВидыНоменклатуры<>Неопределено И ТипЗнч(БлокироватьВидыНоменклатуры)=Тип("Соответствие") И БлокироватьВидыНоменклатуры.Количество()>0 Тогда
			Ошибки="";
			Для каждого СтрокаТоваров Из Товары Цикл
				ЕстьОшибка=(БлокироватьВидыНоменклатуры[СтрокаТоваров.Номенклатура.ВидНоменклатуры]<>Неопределено);
				Если ЕстьОшибка Тогда
					Ошибки=?(Ошибки="","",Ошибки+Символы.ПС);
					Ошибки=Ошибки+"Строка "+СтрокаТоваров.НомерСтроки+". Товар <"+СтрокаТоваров.Номенклатура+">. В таблицу нельзя вводить номенклатуру вида """+СокрЛП(СтрокаТоваров.Номенклатура.ВидНоменклатуры)+""".";
					Отказ=Истина;
				КонецЕсли;
			КонецЦикла; 
			Если Отказ Тогда
				#Если Клиент Тогда
					// Выведем все накопившиеся ошибки 
					Сообщить("При записи <"+СокрЛП(ЭтотОбъект)+"> обнаружены ошибки :",СтатусСообщения.Внимание);
					Сообщить(Ошибки,СтатусСообщения.БезСтатуса);
					Сообщить("Из-за возникших ошибок операция записи была отменена.",СтатусСообщения.Важное);
				#КонецЕсли
				дкУстановитьЗначениеДополнительногоСвойства(ЭтотОбъект,Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	
	// получим старые значения, влияющие на границы последовательности
	Если НЕ Отказ И Проведен И РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		
		БылиДвижения = Ложь;
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		// взаиморасчеты
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ДоговорВзаиморасчетов ИЗ РегистрНакопления.ВзаиморасчетыКомпании ГДЕ Регистратор=&Ссылка";
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			БылиДвижения = Истина;
			ДополнительныеСвойства.Вставить("ДоговорВзаиморасчетовБыл", Результат.Выгрузить().ВыгрузитьКолонку("ДоговорВзаиморасчетов"));
		КонецЕсли;
		
		// партии
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ СкладКомпании ИЗ РегистрНакопления.ПартииТоваровКомпании ГДЕ Регистратор=&Ссылка";
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			БылиДвижения = Истина;
			ДополнительныеСвойства.Вставить("СкладКомпанииБыл", Результат.Выгрузить().ВыгрузитьКолонку("СкладКомпании"));
		КонецЕсли;
		
		// Заказы
		Запрос.Текст  = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Заказы.Заказ КАК Заказ
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗаказыПокупателей.Заказ КАК Заказ
		|	ИЗ
		|		РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателей
		|	ГДЕ
		|		ЗаказыПокупателей.Регистратор = &Ссылка
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		ЗаказыРаспределение.ЗаказПокупателя
		|	ИЗ
		|		РегистрНакопления.ЗаказыРаспределение КАК ЗаказыРаспределение
		|	ГДЕ
		|		ЗаказыРаспределение.Регистратор = &Ссылка
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		ЗаказыРаспределение.ЗаказПоставщика
		|	ИЗ
		|		РегистрНакопления.ЗаказыРаспределение КАК ЗаказыРаспределение
		|	ГДЕ
		|		ЗаказыРаспределение.Регистратор = &Ссылка) КАК Заказы";
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			БылиДвижения = Истина;
			ДополнительныеСвойства.Вставить("ЗаказБыл", Результат.Выгрузить().ВыгрузитьКолонку("Заказ"));
		КонецЕсли;
		
		// прошлый момент времени
		Если БылиДвижения Тогда
			Запрос.Текст = "ВЫБРАТЬ МоментВремени ИЗ Документ."+Метаданные().Имя+" ГДЕ Ссылка=&Ссылка";
			ДополнительныеСвойства.Вставить("МоментВремениБыл",Запрос.Выполнить().Выгрузить().Получить(0).МоментВремени);
		КонецЕсли;
		
	КонецЕсли;
	
	Если БонусныеПрограммыСервер.ЗаблокированаКарточка(Карточка)
		И (ДополнительныеСвойства.Свойство("ПроверятьБлокировкуКарты") ИЛИ (КоличествоКНачислению = 0 И ЗначениеЗаполнено(Ссылка))) Тогда
		КоличествоКНачислению = 0;
	Иначе
			БонусныеПрограммыСервер.РасчитатьБонусныеБаллыКНачислению(ЭтотОбъект, Карточка.БонуснаяПрограмма);
	КонецЕсли;
			
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	//Бондаренко++ 20220309
 	СМГ_ПриЗаписи();
 	//Бондаренко++ 20220309
КонецПроцедуры // ПриЗаписи()

Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	
	//Удалим накопление сумм
	//НаборЗаписейНакоплениеСумм=РегистрыСведений.НакоплениеСумм.СоздатьНаборЗаписей();
	//НаборЗаписейНакоплениеСумм.ДокументОбъект=ЭтотОбъект;
	//НаборЗаписейНакоплениеСумм.ОтменаПроведения();
	
	Если Не Отказ Тогда
		тКэшСуммСписания = Неопределено;
	КонецЕсли;
	
	// Удалим введенные в оборот коды маркировки
	//НаборЗаписейСостоянияКодовМаркировки = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
	//НаборЗаписейСостоянияКодовМаркировки.ДокументОбъект = ЭтотОбъект;
	//НаборЗаписейСостоянияКодовМаркировки.ОтменаПроведения();
	
	Отказ = СМГ_ОбработкаУдаленияПроведения();
 
КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ОбработкаПроведения(Отказ, Режим)
	
	//
	//Если НеПроводной или ОбъединеннаяРеализация   тогда
	// 	Возврат;
	//КонецЕсли;
	//
	////Честный_знак_10.10.2024
	//Параметры = Модуль_ГВС.Присутствие_Маркированная_Номенклатура(Товары);
	//
	//Если Параметры.Маркировка_Присутствует И Константы.Проверки_По_Честному_Знаку.Получить() И Дата >= Дата(2026, 01, 15) Тогда
	//	Если Контрагент.НашаФирма Тогда
	//	// Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо	
	//	Иначе
	//		Отказ = Истина;
	//		Сообщить("Продажа маркированной продукции запрещена!",СтатусСообщения.ОченьВажное);
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	//  //Честный_знак_10.10.2024

	// Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда Возврат; КонецЕсли;
	//
	Отказ = СМГ_ОбработкаПроведения(); 
	Если Отказ Тогда
	    Возврат;
	КонецЕсли;
	//
	//// определим необходимость формирования корректирующих проводок
	//ВедетсяБалансПоПодразделению = (Константы.СпособВеденияБаланса.Получить() = Перечисления.СпособВеденияБаланса.ПоПодразделению);
	//
	//// проведем взаиморасчеты
	//Если ХозОперация<>Справочники.ХозОперации.РеализацияТоваровКомиссия Тогда
	//	НаборЗаписейВзаиморасчеты=Движения.ВзаиморасчетыКомпании;
	//	НаборЗаписейВзаиморасчеты.ДокументОбъект=ЭтотОбъект;
	//	НаборЗаписейВзаиморасчеты.РежимПроведения=Режим;
	//	НаборЗаписейВзаиморасчеты.Контрагент=Контрагент;
	//	НаборЗаписейВзаиморасчеты.ДоговорВзаиморасчетов=ДоговорВзаиморасчетов;
	//	Если НЕ обЗначениеНеЗаполнено(ДокументОснование) Тогда
	//		НаборЗаписейВзаиморасчеты.Сделка=ДокументОснование;
	//	Иначе
	//		НаборЗаписейВзаиморасчеты.Сделка=Неопределено;
	//	КонецЕсли; 
	//	НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем=Истина;
	//	НаборЗаписейВзаиморасчеты.Сумма=Товары.Итог("СуммаВсего");
	//	НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц=0;
	//	Отказ = НЕ НаборЗаписейВзаиморасчеты.Приход() ИЛИ Отказ;
	//	// доходы и расходы по суммовым разницам
	//	СуммаДоходаРасходаСуммовыхРазниц=НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц;
	//	Если СуммаДоходаРасходаСуммовыхРазниц<>0 Тогда
	//		НаборЗаписейДиР = Движения.ДоходыИРасходы;
	//		НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
	//		// в случае если ведется баланс по подразделению передадим подразделение соответствующее корреспонденции
	//		Если ВедетсяБалансПоПодразделению Тогда
	//			НаборЗаписейДиР.Подразделение  = ДоговорВзаиморасчетов.Подразделение;
	//		КонецЕсли;
	//		НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СуммовыеРазницы;
	//		НаборЗаписейДиР.ВУпрВалюте = Истина;
	//		Если СуммаДоходаРасходаСуммовыхРазниц<0 Тогда
	//			НаборЗаписейДиР.Расход = -СуммаДоходаРасходаСуммовыхРазниц;
	//		Иначе
	//			НаборЗаписейДиР.Доход = СуммаДоходаРасходаСуммовыхРазниц;
	//		КонецЕсли;
	//		Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
	//	КонецЕсли;
	//КонецЕсли;
	//
	////Закрываем заказы покупателя по FIFO
	//ТекстЗапроса="
	//|ВЫБРАТЬ
	//|	ДокументТовары.Номенклатура КАК Номенклатура,
	//|	ДокументТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//|	ДокументТовары.КоличествоБазовое КАК Количество,
	//|	ДокументТовары.Цена КАК ЦенаРозничная,
	//|	0 КАК Резерв,
	//|	ДокументТовары.СуммаВсего КАК Сумма
	//|ИЗ
	//|	Документ.РеализацияТоваров.Товары КАК ДокументТовары
	//|ГДЕ
	//|	  ДокументТовары.Ссылка=&Ссылка И ДокументТовары.Номенклатура.ВидНоменклатуры<>&Услуга
	//|";
	//Запрос=Новый Запрос(ТекстЗапроса);
	//Запрос.УстановитьПараметр("Ссылка",Ссылка);
	//Запрос.УстановитьПараметр("Услуга",Перечисления.ВидыНоменклатуры.Услуга);
	////Закрываем заказы
	//НаборЗаписейЗаказыПокупателей = Движения.ЗаказыПокупателей;
	//НаборЗаписейЗаказыПокупателей.РежимПроведения = Режим;
	//НаборЗаписейЗаказыПокупателей.ДокументОбъект = ЭтотОбъект;
	//НаборЗаписейЗаказыПокупателей.РезультатЗапросаПоТоварам = Запрос.Выполнить();
	//НаборЗаписейЗаказыПокупателей.Контрагент = Контрагент;
	//НаборЗаписейЗаказыПокупателей.Заказ = Неопределено;
	//НаборЗаписейЗаказыПокупателей.СкладКомпании = СкладКомпании;
	//НаборЗаписейЗаказыПокупателей.Заказывать = Истина;
	//НаборЗаписейЗаказыПокупателей.Резервировать = Истина;
	//НаборЗаписейЗаказыПокупателей.ПоБазовомуКоличеству=Истина;
	//Отказ=НЕ НаборЗаписейЗаказыПокупателей.ЗакрытиеЗаказовПокупателя() ИЛИ Отказ;
	////Если было списание резервов то таблица товаров содержит списанные резервы
	//РезультатЗапросаПоТоварам=НаборЗаписейЗаказыПокупателей.РезультатЗапросаПоТоварам;
	//
	////Снимаем распределение заказов покупателя
	//РезультатЗакрытияЗаказов=НаборЗаписейЗаказыПокупателей.Выгрузить();
	//КолонкаКоличества=РезультатЗакрытияЗаказов.Колонки.Найти("Заказано");
	//КолонкаКоличества.Имя="Количество"; КолонкаКоличества.Заголовок="Количество";
	//РезультатЗакрытияЗаказов.Свернуть("Заказ,Контрагент,Номенклатура,ХарактеристикаНоменклатуры","Количество,Резерв");
	//Для каждого СтрокаЗаказа Из РезультатЗакрытияЗаказов Цикл
	//	СтрокаЗаказа.Количество=-(СтрокаЗаказа.Количество-СтрокаЗаказа.Резерв);
	//КонецЦикла; 
	//НаборЗаписейРаспределениеЗаказов = Движения.ЗаказыРаспределение;
	//НаборЗаписейРаспределениеЗаказов.РежимПроведения = Режим;
	//НаборЗаписейРаспределениеЗаказов.ДокументОбъект = ЭтотОбъект;
	//НаборЗаписейРаспределениеЗаказов.РезультатЗапросаПоТоварам = РезультатЗакрытияЗаказов;
	//НаборЗаписейРаспределениеЗаказов.ЗаказПокупателя = "Заказ";
	//НаборЗаписейРаспределениеЗаказов.ЗаказПоставщика = Неопределено;
	//НаборЗаписейРаспределениеЗаказов.Контрагент = Контрагент;
	//НаборЗаписейРаспределениеЗаказов.ПоБазовомуКоличеству=Истина;
	//Отказ=НЕ НаборЗаписейРаспределениеЗаказов.КорректировкаРаспределения() ИЛИ Отказ;
	//
	////Делаем расход по складу
	//Если ХозОперация=Справочники.ХозОперации.АктОбОказанииУслуг Тогда
	//	// проведем услуги по доходам и расходам
	//	Запрос=Новый Запрос("ВЫБРАТЬ
	//	|	ВЫБОР
	//	|		КОГДА РеализацияТоваровТовары.СтатьяДоходов = ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка) ТОГДА
	//	|			РеализацияТоваровТовары.Номенклатура.СтатьяДопРасходов
	//	|		ИНАЧЕ
	//	|			РеализацияТоваровТовары.СтатьяДоходов
	//	|	КОНЕЦ КАК СтатьяРасходов,
	//	|	СУММА(РеализацияТоваровТовары.СуммаВсего) КАК СуммаУслуг
	//	|ИЗ
	//	|	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	//	|ГДЕ
	//	|	РеализацияТоваровТовары.Ссылка = &ТекДок
	//	|	И РеализацияТоваровТовары.Номенклатура.ВидНоменклатуры = &Услуга
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВЫБОР
	//	|		КОГДА РеализацияТоваровТовары.СтатьяДоходов = ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка) ТОГДА
	//	|			РеализацияТоваровТовары.Номенклатура.СтатьяДопРасходов
	//	|		ИНАЧЕ
	//	|			РеализацияТоваровТовары.СтатьяДоходов
	//	|	КОНЕЦ");
	//	Запрос.УстановитьПараметр("ТекДок", Ссылка);
	//	Запрос.УстановитьПараметр("Услуга", Перечисления.ВидыНоменклатуры.Услуга);
	//	Выборка=Запрос.Выполнить().Выбрать();
	//	СуммаУслуг = 0;
	//	Пока Выборка.Следующий() Цикл
	//		НаборЗаписейДоходыИРасходы = Движения.ДоходыИРасходы;
	//		НаборЗаписейДоходыИРасходы.ДокументОбъект         = ЭтотОбъект;
	//		НаборЗаписейДоходыИРасходы.ВУпрВалюте             = (ВалютаДокумента=Константы.ВалютаУправленческогоУчетаКомпании.Получить());
	//		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Выборка.СтатьяРасходов;
	//		НаборЗаписейДоходыИРасходы.Доход                  = Выборка.СуммаУслуг;
	//		СуммаУслуг = СуммаУслуг + Выборка.СуммаУслуг;
	//		Отказ = (НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ);
	//	КонецЦикла;
	//	
	//	ПодразделениеПодразделениеКомпании = обПолучитьБалансовоеПодразделение(ПодразделениеКомпании);
	//	ПодразделениеДоговорВзаиморасчетов = обПолучитьБалансовоеПодразделение(ДоговорВзаиморасчетов.Подразделение);
	//	БалансовыеПодразделенияНеРавны = (ПодразделениеДоговорВзаиморасчетов<>ПодразделениеПодразделениеКомпании);
	//	
	//	//Если балансовые подразделение договора и подразделения склад не равны, то сформируем корректирующие проводки
	//	Если ВедетсяБалансПоПодразделению и БалансовыеПодразделенияНеРавны Тогда
	//		НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
	//		НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
	//		НаборЗаписейДоходыИРасходы.Подразделение=ДоговорВзаиморасчетов.Подразделение;
	//		НаборЗаписейДоходыИРасходы.ВУпрВалюте=Ложь;
	//		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
	//		НаборЗаписейДоходыИРасходы.Доход=СуммаУслуг;
	//		Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
	//		
	//		НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
	//		НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
	//		НаборЗаписейДоходыИРасходы.Подразделение=ПодразделениеКомпании;
	//		НаборЗаписейДоходыИРасходы.ВУпрВалюте=(ВалютаДокумента=Константы.ВалютаУправленческогоУчетаКомпании.Получить());
	//		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
	//		НаборЗаписейДоходыИРасходы.Расход=СуммаУслуг;
	//		Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
	//	КонецЕсли;
	//	
	//	// продажи
	//	Если НЕ Отказ Тогда
	//		
	//		// проверяем, присутствуют ли партии в табличной части
	//		ЕстьПартии = Ложь;
	//		Для Каждого СтрокаТовар Из Товары Цикл
	//			Если ЗначениеЗаполнено(СтрокаТовар.Партия) Тогда
	//				ЕстьПартии = Истина;
	//				Прервать;
	//			КонецЕсли;
	//		КонецЦикла;
	//		
	//		// получим шапку документа
	//		ШапкаДокумента=ПолучитьШапкуДокумента(Ссылка);
	//		НаборЗаписейПродажи=Движения.Продажи;
	//		НаборЗаписейПродажи.ДокументОбъект=ЭтотОбъект;
	//		НаборЗаписейПродажи.СкладКомпании=ШапкаДокумента.СкладКомпании;
	//		НаборЗаписейПродажи.ДокументПродажи=ШапкаДокумента.ДокументПродажи;
	//		НаборЗаписейПродажи.Сторно=Ложь;
	//		НаборЗаписейПродажи.Покупатель=ШапкаДокумента.Контрагент;
	//		НаборЗаписейПродажи.РезультатЗапросаПоТоварам=Неопределено;
	//		НаборЗаписейПродажи.ДоговорВзаиморасчетов=ШапкаДокумента.ДоговорВзаиморасчетов;
	//		НаборЗаписейПродажи.ПодразделениеКомпании=ШапкаДокумента.ПодразделениеКомпании;
	//		НаборЗаписейПродажи.ИмяРеквизитаДокумент = ?(ЕстьПартии,"Партия","");
	//		НаборЗаписейПродажи.Комиссия=Ложь;
	//		НаборЗаписейПродажи.ПоБазовомуКоличеству=Истина;
	//		НаборЗаписейПродажи.ШапкаДокумента=ШапкаДокумента;
	//		Отказ=НЕ НаборЗаписейПродажи.Приход() ИЛИ Отказ;
	//	КонецЕсли;
	//	
	//ИначеЕсли ХозОперация=Справочники.ХозОперации.РеализацияАгентскихУслуг Тогда		
	//	ШапкаДокумента					= ПолучитьШапкуДокумента(Ссылка);
	//	
	//	// проведем услуги по доходам и расходам
	//	Запрос=Новый Запрос("ВЫБРАТЬ
	//	|	ВЫБОР
	//	|		КОГДА РеализацияТоваровТовары.СтатьяДоходов = ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка) ТОГДА
	//	|			РеализацияТоваровТовары.Номенклатура.СтатьяДопРасходов
	//	|		ИНАЧЕ
	//	|			РеализацияТоваровТовары.СтатьяДоходов
	//	|	КОНЕЦ КАК СтатьяРасходов,
	//	|	СУММА(РеализацияТоваровТовары.СуммаВсего) КАК СуммаУслуг,
	//	|	СУММА(РеализацияТоваровТовары.СуммаВсего+РеализацияТоваровТовары.СуммаСкидки+РеализацияТоваровТовары.СуммаСкидкиСтроки) КАК СуммаУслугСоСкидками
	//	|ИЗ
	//	|	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	//	|ГДЕ
	//	|	РеализацияТоваровТовары.Ссылка = &ТекДок
	//	|	И РеализацияТоваровТовары.Номенклатура.ВидНоменклатуры = &Услуга
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВЫБОР
	//	|		КОГДА РеализацияТоваровТовары.СтатьяДоходов = ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка) ТОГДА
	//	|			РеализацияТоваровТовары.Номенклатура.СтатьяДопРасходов
	//	|		ИНАЧЕ
	//	|			РеализацияТоваровТовары.СтатьяДоходов
	//	|	КОНЕЦ");
	//	Запрос.УстановитьПараметр("ТекДок", Ссылка);
	//	Запрос.УстановитьПараметр("Услуга", Перечисления.ВидыНоменклатуры.Услуга);
	//	Выборка		= Запрос.Выполнить().Выбрать();
	//	ВУпрВалюте	= (ВалютаДокумента=Константы.ВалютаУправленческогоУчетаКомпании.Получить());
	//	СуммаУслуг 	= 0;
	//	Пока Выборка.Следующий() Цикл
	//		НаборЗаписейДоходыИРасходы							= Движения.ДоходыИРасходы;
	//		НаборЗаписейДоходыИРасходы.ДокументОбъект			= ЭтотОбъект;
	//		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов	= Справочники.СтатьиДоходовИРасходов.Себестоимость;
	//		НаборЗаписейДоходыИРасходы.ВУпрВалюте				= ВУпрВалюте;
	//		НаборЗаписейДоходыИРасходы.Доход					= Выборка.СуммаУслугСоСкидками;	
	//		НаборЗаписейДоходыИРасходы.ШапкаДокумента			= ШапкаДокумента;
	//		Отказ	= НЕ НаборЗаписейДоходыИРасходы.Расход() ИЛИ Отказ;			
	//		
	//		НаборЗаписейДоходыИРасходы							= Движения.ДоходыИРасходы;
	//		НаборЗаписейДоходыИРасходы.ДокументОбъект			= ЭтотОбъект;
	//		НаборЗаписейДоходыИРасходы.ВУпрВалюте				= ВУпрВалюте;
	//		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов	= Выборка.СтатьяРасходов;
	//		НаборЗаписейДоходыИРасходы.Доход					= Выборка.СуммаУслуг;
	//		СуммаУслуг		= СуммаУслуг + Выборка.СуммаУслуг;
	//		Отказ = (НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ);
	//	КонецЦикла;
	//	
	//	ПодразделениеПодразделениеКомпании = обПолучитьБалансовоеПодразделение(ПодразделениеКомпании);
	//	ПодразделениеДоговорВзаиморасчетов = обПолучитьБалансовоеПодразделение(ДоговорВзаиморасчетов.Подразделение);
	//	БалансовыеПодразделенияНеРавны = (ПодразделениеДоговорВзаиморасчетов<>ПодразделениеПодразделениеКомпании);
	//	
	//	//Если балансовые подразделение договора и подразделения склад не равны, то сформируем корректирующие проводки
	//	Если ВедетсяБалансПоПодразделению и БалансовыеПодразделенияНеРавны Тогда
	//		НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
	//		НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
	//		НаборЗаписейДоходыИРасходы.Подразделение=ДоговорВзаиморасчетов.Подразделение;
	//		НаборЗаписейДоходыИРасходы.ВУпрВалюте=Ложь;
	//		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
	//		НаборЗаписейДоходыИРасходы.Доход=СуммаУслуг;
	//		Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
	//		
	//		НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
	//		НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
	//		НаборЗаписейДоходыИРасходы.Подразделение=ПодразделениеКомпании;
	//		НаборЗаписейДоходыИРасходы.ВУпрВалюте=(ВалютаДокумента=Константы.ВалютаУправленческогоУчетаКомпании.Получить());
	//		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
	//		НаборЗаписейДоходыИРасходы.Расход=СуммаУслуг;
	//		Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
	//	КонецЕсли;		
	//	
	//	// продажи
	//	НаборЗаписейПродажи							= Движения.Продажи;
	//	НаборЗаписейПродажи.ДокументОбъект			= ЭтотОбъект;
	//	НаборЗаписейПродажи.СкладКомпании			= ШапкаДокумента.СкладКомпании;
	//	НаборЗаписейПродажи.ДокументПродажи			= ШапкаДокумента.ДокументПродажи;
	//	НаборЗаписейПродажи.Сторно					= Ложь;
	//	НаборЗаписейПродажи.Покупатель				= ШапкаДокумента.Контрагент;
	//	НаборЗаписейПродажи.РезультатЗапросаПоТоварам	= Неопределено;
	//	НаборЗаписейПродажи.ДоговорВзаиморасчетов	= ШапкаДокумента.ДоговорВзаиморасчетов;
	//	НаборЗаписейПродажи.ПодразделениеКомпании	= ШапкаДокумента.ПодразделениеКомпании;
	//	НаборЗаписейПродажи.ИмяРеквизитаДокумент	= "";
	//	НаборЗаписейПродажи.Комиссия					= Ложь;
	//	НаборЗаписейПродажи.ПоБазовомуКоличеству	= Истина;
	//	НаборЗаписейПродажи.ШапкаДокумента			= ШапкаДокумента;
	//	Отказ=НЕ НаборЗаписейПродажи.Приход() ИЛИ Отказ;		
	//	
	//	// Реализованные товары		
	//	НаборЗаписейРеализованныеТовары	= Движения.РеализованныеТовары;
	//	
	//	ВалютаРегл		= Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	//	СтруктураКурса	= обКурсДляВалюты(ВалютаРегл,ШапкаДокумента.Дата);
	//	КурсРегл		= СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	//	ВалютаУпр		= Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	//	Если обЗначениеНеЗаполнено(ШапкаДокумента.КурсВалютыУпр) Тогда
	//		СтруктураКурса	= обКурсДляВалюты(ВалютаУпр,ШапкаДокумента.Дата);
	//		КурсУпр			= СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	//	Иначе
	//		КурсУпр			= ШапкаДокумента.КурсВалютыУпр;
	//	КонецЕсли;
	//	
	//	ТекстЗапросаПоУслугам	= "ВЫБРАТЬ
	//	|	ДокТовары.Номенклатура КАК Номенклатура,
	//	|	ДокТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//	|	СУММА(ДокТовары.КоличествоБазовое) КАК Количество,
	//	|	СУММА(ДокТовары.СуммаСкидки) КАК СуммаСкидки,
	//	|	СУММА(ДокТовары.СуммаСкидкиСтроки) КАК СуммаСкидкиСтроки,
	//	|	СУММА(ДокТовары.СуммаВсего) КАК СуммаПродажи
	//	|ИЗ
	//	|	Документ.РеализацияТоваров.Товары КАК ДокТовары
	//	|ГДЕ
	//	|	ДокТовары.Ссылка=&Ссылка
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ДокТовары.Номенклатура,
	//	|	ДокТовары.ХарактеристикаНоменклатуры";
	//	ЗапросТЧ = Новый Запрос(ТекстЗапросаПоУслугам);
	//	ЗапросТЧ.УстановитьПараметр("Ссылка", ШапкаДокумента.Ссылка);
	//	ТаблицаУслуги = ЗапросТЧ.Выполнить().Выгрузить();						
	//	
	//	Для Каждого ТекСтрока Из ТаблицаУслуги Цикл
	//		НоваяЗапись					= НаборЗаписейРеализованныеТовары.Добавить();
	//		НоваяЗапись.ВидДвижения		= ВидДвиженияНакопления.Приход;
	//		НоваяЗапись.Период			= ШапкаДокумента.Дата;
	//		НоваяЗапись.Регистратор		= ШапкаДокумента.Ссылка;
	//		НоваяЗапись.Номенклатура	= ТекСтрока.Номенклатура;
	//		НоваяЗапись.ХарактеристикаНоменклатуры	= ТекСтрока.ХарактеристикаНоменклатуры;
	//		НоваяЗапись.Контрагент		= ШапкаДокумента.Комитент;
	//		НоваяЗапись.ДоговорВзаиморасчетов	= ШапкаДокумента.ДоговорКомитента;
	//		НоваяЗапись.ДокументПередачи		= ШапкаДокумента.Ссылка;
	//		
	//		НоваяЗапись.ХозОперация		= ШапкаДокумента.ХозОперация;
	//		НоваяЗапись.Количество		= ТекСтрока.Количество;
	//		
	//		СуммаПоступления			= ТекСтрока.СуммаПродажи + ТекСтрока.СуммаСкидки + ТекСтрока.СуммаСкидкиСтроки;
	//		НоваяЗапись.СуммаРегл		= Окр(обПересчет(СуммаПоступления,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаРегл,КурсРегл),2);
	//		НоваяЗапись.СуммаУпр		= Окр(обПересчет(СуммаПоступления,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,КурсУпр),2);
	//		
	//		НоваяЗапись.СуммаПродажиРегл = Окр(обПересчет(ТекСтрока.СуммаПродажи, ШапкаДокумента.ВалютаДокумента, ШапкаДокумента.КурсДокумента, ВалютаРегл, КурсРегл), 2);
	//		НоваяЗапись.СуммаПродажи     = Окр(обПересчет(Текстрока.СуммаПродажи, ШапкаДокумента.ВалютаДокумента, ШапкаДокумента.КурсДокумента, ВалютаУпр, КурсУпр), 2); 
	//	КонецЦикла;
	//Иначе
	//	//Бондаренко++ 20211213
	//	Если Не НепроводнойДляДопОборудования Тогда
	//	//Бондаренко-- 20211213	
	//		// для оказания услуг товары не списываем
	//		// проведем остатки товаров
	//		НаборЗаписейОстатки=Движения.ОстаткиТоваровКомпании;
	//		НаборЗаписейОстатки.РежимПроведения=Режим;
	//		НаборЗаписейОстатки.ДокументОбъект=ЭтотОбъект;
	//		НаборЗаписейОстатки.РезультатЗапросаПоТоварам=РезультатЗапросаПоТоварам;
	//		НаборЗаписейОстатки.СкладКомпании=СкладКомпании;
	//		НаборЗаписейОстатки.Приходовать=Истина;
	//		НаборЗаписейОстатки.Контрагент=Контрагент;
	//		НаборЗаписейОстатки.ПоБазовомуКоличеству=Истина;
	//		НаборЗаписейОстатки.ДвиженияПоРознице=СкладКомпании.Розничный;
	//		НаборЗаписейОстатки.ИмяРеквизитаЦенаРозничная="Цена";
	//		НаборЗаписейОстатки.Резервировать=РезультатЗапросаПоТоварам<>Неопределено;
	//		Отказ=НЕ НаборЗаписейОстатки.Расход() ИЛИ Отказ;
	//		Если Отказ Тогда
	//			// выведем сообщения об ошибках и предупреждениях
	//			дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
	//			Возврат; // дальше смысла не имеет
	//		КонецЕсли;
	//		// Партии
	//		Отказ=НЕ ПровестиПоПартиям(Режим,Ссылка) ИЛИ Отказ;		
	//	//Бондаренко++ 20211213                                
	//	Иначе
	//		Если НЕ Отказ Тогда 
	//			ШапкаДокумента = ПолучитьШапкуДокумента(Ссылка);
	//			НаборЗаписейПродажи=Движения.Продажи;
	//			НаборЗаписейПродажи.ДокументОбъект=ЭтотОбъект;
	//			НаборЗаписейПродажи.СкладКомпании=ШапкаДокумента.СкладКомпании;
	//			НаборЗаписейПродажи.ДокументПродажи=ШапкаДокумента.ДокументПродажи;
	//			НаборЗаписейПродажи.Сторно=Ложь;
	//			НаборЗаписейПродажи.Покупатель=ШапкаДокумента.Контрагент;
	//			НаборЗаписейПродажи.РезультатЗапросаПоТоварам=Неопределено;
	//			НаборЗаписейПродажи.ДоговорВзаиморасчетов=ШапкаДокумента.ДоговорВзаиморасчетов;
	//			НаборЗаписейПродажи.ПодразделениеКомпании=ШапкаДокумента.ПодразделениеКомпании;
	//			НаборЗаписейПродажи.ИмяРеквизитаДокумент="";
	//			НаборЗаписейПродажи.Комиссия=Ложь;
	//			НаборЗаписейПродажи.ПоБазовомуКоличеству=Истина;
	//			НаборЗаписейПродажи.ШапкаДокумента=ШапкаДокумента;
	//			Отказ=НЕ НаборЗаписейПродажи.Приход() ИЛИ Отказ;
	//		КонецЕсли;
	//		Если Не Отказ Тогда
	//			НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
	//			НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
	//			// в случае если ведется баланс по подразделению передадим подразделение соответствующее корреспонденции
	//			Если ВедетсяБалансПоПодразделению Тогда
	//				НаборЗаписейДоходыИРасходы.Подразделение = ШапкаДокумента.ДоговорВзаиморасчетов.Подразделение;
	//			КонецЕсли;
	//			НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
	//			НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.Себестоимость;
	//			НаборЗаписейДоходыИРасходы.ВУпрВалюте = Ложь;
	//			НаборЗаписейДоходыИРасходы.Доход = ШапкаДокумента.СуммаВсего;
	//			Отказ = НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
	//		КонецЕсли;	
	// 	КонецЕсли;             
	//	//Бондаренко-- 20211213
	//КонецЕсли;
	//
	////Сформируем сумму накопления
	//Если ХозОперация<>Справочники.ХозОперации.РеализацияАгентскихУслуг Тогда
	//	НаборЗаписейНакоплениеСумм=РегистрыСведений.НакоплениеСумм.СоздатьНаборЗаписей();
	//	НаборЗаписейНакоплениеСумм.ДокументОбъект         = ЭтотОбъект;
	//	НаборЗаписейНакоплениеСумм.Контрагент             = Контрагент;
	//	НаборЗаписейНакоплениеСумм.КоличествоНоменклатуры = Товары.Итог("КоличествоБазовое");
	//	НаборЗаписейНакоплениеСумм.Карточка               = Карточка;
	//	НаборЗаписейНакоплениеСумм.Сторно                 = Ложь;
	//	Отказ=НЕ НаборЗаписейНакоплениеСумм.НакоплениеСуммы() ИЛИ Отказ;
	//КонецЕсли;
	//
	//Если Не Отказ Тогда
	//	тКэшСуммСписания = Неопределено;
	//КонецЕсли;
	//
	//Если НЕ Отказ И (ХозОперация = Справочники.ХозОперации.РеализацияТоваров
	//	ИЛИ ХозОперация = Справочники.ХозОперации.РеализацияТоваровКомиссия) Тогда
	//	
	//	СостояниеКодаМаркировки = ?(Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо,
	//		Перечисления.СостоянияКодовМаркировки.ВыведенИзОборотаРозничнаяПродажа,
	//		Перечисления.СостоянияКодовМаркировки.ПередачаДругомуСобственнику);
	//	
	//	// Изменим состояние маркировки
	//	НаборЗаписейСостоянияКодовМаркировки = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
	//	НаборЗаписейСостоянияКодовМаркировки.ДокументОбъект = ЭтотОбъект;
	//	НаборЗаписейСостоянияКодовМаркировки.Организация = Организация;
	//	НаборЗаписейСостоянияКодовМаркировки.ПроверятьВыводИзОборота = Истина;
	//	НаборЗаписейСостоянияКодовМаркировки.Состояние = СостояниеКодаМаркировки;
	//	НаборЗаписейСостоянияКодовМаркировки.РежимПроведения = Режим;
	//	Отказ = НЕ НаборЗаписейСостоянияКодовМаркировки.СостояниеКодовМаркировки() ИЛИ Отказ;
	//	
	//КонецЕсли;
	//
	//// если модифицировали документ, то запишем его
	//Если НЕ Отказ И Модифицированность() Тогда
	//	Записать(РежимЗаписиДокумента.Запись);
	//КонецЕсли;
	//
	//// Возможно расхождение баланса на "копейки" из-за округления. Возникшую разницу
	//// необходимо списать на доходы и расходы.
	//Отказ = НЕ дкСписаниеКопейкиПриОкругленииВалютныхСчетов(ЭтотОбъект) ИЛИ Отказ;
	//
	// бонусные баллы
	//НаборБонусныеПрограммы = Движения.БонусныеБаллы;
	//Если КоличествоКНачислению > 0 Тогда
	//	НаборБонусныеПрограммы.Карта             = Карточка;
	//	НаборБонусныеПрограммы.БонуснаяПрограмма = Карточка.БонуснаяПрограмма;
	//	НаборБонусныеПрограммы.ХозОперация       = ХозОперация;
	//	НаборБонусныеПрограммы.КоличетсвоБаллов  = КоличествоКНачислению;
	//	НаборБонусныеПрограммы.Регистратор       = Ссылка;
	//	НаборБонусныеПрограммы.ДокДата           = Дата;
	//	
	//	Отказ = НЕ НаборБонусныеПрограммы.Приход() ИЛИ Отказ;
	//КонецЕсли;
	//
	//Если КоличествоКСписанию > 0 Тогда
	//	МаксимальноеКоличествоБаллов = БонусныеПрограммыСервер.МаксимальноеКоличетсвоБоллов(ЭтотОбъект, Карточка.БонуснаяПрограмма);
	//	Если КоличествоКСписанию > МаксимальноеКоличествоБаллов Тогда
	//		Отказ = Истина;
	//		ТекстСообщения = НСтр("ru = 'Максимальное количество бонусных баллов доступных к оплате %1 меньше указанных %2.'");
	//		ТекстСообщения = СтрЗаменить(СтрЗаменить(ТекстСообщения, "%1", МаксимальноеКоличествоБаллов), "%2", КоличествоКСписанию);
	//		Сообщить(ТекстСообщения, СтатусСообщения.Важное);
	//	КонецЕсли;
	//	
	//	НаборБонусныеПрограммы.Карта = Карточка;
	//	НаборБонусныеПрограммы.БонуснаяПрограмма = Карточка.БонуснаяПрограмма;
	//	НаборБонусныеПрограммы.ХозОперация       = ХозОперация;
	//	НаборБонусныеПрограммы.КоличетсвоБаллов  = КоличествоКСписанию;
	//	НаборБонусныеПрограммы.Регистратор       = Ссылка;
	//	НаборБонусныеПрограммы.ДокДата           = Дата;
	//	
	//	Отказ = НЕ НаборБонусныеПрограммы.Расход() ИЛИ Отказ;
	//	
	//КонецЕсли;
	
	//// двигаем границу последовательности взаиморасчетов
	//ДвигаемГраницу = (Режим<>РежимПроведенияДокумента.Оперативный И Движения.ВзаиморасчетыКомпании.Количество()>0);
	//Если ДвигаемГраницу ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.ДоговорВзаиморасчетовБыл) Тогда
	//	НаборЗаписейГраницыВзаиморасчетов = РегистрыСведений.ГраницыВзаиморасчетов.СоздатьНаборЗаписей();
	//	Если ДвигаемГраницу Тогда
	//		ТаблицаДоговоров = Движения.ВзаиморасчетыКомпании.Выгрузить();
	//		ТаблицаДоговоров.Свернуть("ДоговорВзаиморасчетов","");
	//		НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетов = ТаблицаДоговоров.ВыгрузитьКолонку("ДоговорВзаиморасчетов");
	//		НаборЗаписейГраницыВзаиморасчетов.МоментВремени = Дата;
	//		НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетовБыл = ДополнительныеСвойства.ДоговорВзаиморасчетовБыл;
	//		НаборЗаписейГраницыВзаиморасчетов.МоментВремениБыл = ДополнительныеСвойства.МоментВремениБыл;
	//	Иначе
	//		НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетов = ДополнительныеСвойства.ДоговорВзаиморасчетовБыл;
	//		НаборЗаписейГраницыВзаиморасчетов.МоментВремени = ДополнительныеСвойства.МоментВремениБыл;
	//		НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетовБыл = Неопределено;
	//		НаборЗаписейГраницыВзаиморасчетов.МоментВремениБыл = Неопределено;
	//	КонецЕсли;
	//	НаборЗаписейГраницыВзаиморасчетов.ДокументСсылка = Ссылка;
	//	НаборЗаписейГраницыВзаиморасчетов.ИзменитьГраницу();
	//КонецЕсли;
	//
	//// двигаем границу последовательности заказов
	//ДвигаемГраницу = (Режим<>РежимПроведенияДокумента.Оперативный И (Движения.ЗаказыПокупателей.Количество()>0 ИЛИ Движения.ЗаказыРаспределение.Количество()>0));
	//Если ДвигаемГраницу ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.ЗаказБыл) Тогда
	//	НаборЗаписейГраницыЗаказы = РегистрыСведений.ГраницыЗаказы.СоздатьНаборЗаписей();
	//	Если ДвигаемГраницу Тогда
	//		ТаблицаЗаказов = Движения.ЗаказыПокупателей.Выгрузить();
	//		ТаблицаЗаказов.Колонки.Удалить("Заказ");
	//		//Гэндальф+++
	//		//ТаблицаЗаказов.Колонки.Добавить("Заказ",Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя,ДокументСсылка.ЗаказВнутренний,ДокументСсылка.ЗаказПоставщику"));
	//		ТаблицаЗаказов.Колонки.Добавить("Заказ",Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя,ДокументСсылка.ЗаявкаНаРемонт,ДокументСсылка.ЗаказВнутренний,ДокументСсылка.ЗаказПоставщику"));
	//		//Гэндальф---
	//		ТаблицаЗаказов.ЗагрузитьКолонку(Движения.ЗаказыПокупателей.ВыгрузитьКолонку("Заказ"),"Заказ");
	//		Для каждого СтрокаЗаказа Из Движения.ЗаказыРаспределение Цикл
	//			НоваяСтрока=ТаблицаЗаказов.Добавить();
	//			НоваяСтрока.Заказ=СтрокаЗаказа.ЗаказПокупателя;
	//			НоваяСтрока=ТаблицаЗаказов.Добавить();
	//			НоваяСтрока.Заказ=СтрокаЗаказа.ЗаказПоставщика;
	//		КонецЦикла; 
	//		ТаблицаЗаказов.Свернуть("Заказ","");
	//		НаборЗаписейГраницыЗаказы.Заказ = ТаблицаЗаказов.ВыгрузитьКолонку("Заказ");
	//		НаборЗаписейГраницыЗаказы.МоментВремени = Дата;
	//		НаборЗаписейГраницыЗаказы.ЗаказБыл = ДополнительныеСвойства.ЗаказБыл;
	//		НаборЗаписейГраницыЗаказы.МоментВремениБыл = ДополнительныеСвойства.МоментВремениБыл;
	//	Иначе
	//		НаборЗаписейГраницыЗаказы.Заказ = ДополнительныеСвойства.ЗаказБыл;
	//		НаборЗаписейГраницыЗаказы.МоментВремени = ДополнительныеСвойства.МоментВремениБыл;
	//		НаборЗаписейГраницыЗаказы.ЗаказБыл = Неопределено;
	//		НаборЗаписейГраницыЗаказы.МоментВремениБыл = Неопределено;
	//	КонецЕсли;
	//	НаборЗаписейГраницыЗаказы.ДокументСсылка = Ссылка;
	//	НаборЗаписейГраницыЗаказы.ИзменитьГраницу();
	//КонецЕсли;
	//
	//СМГ_СформироватьДвиженияПартийТоваровДляУчета();
 	
	// выведем сообщения об ошибках и предупреждениях
	//дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
КонецПроцедуры // ОбработкаПроведения()

//Бондаренко++ 20190405
Функция ПолучитьТаблицуТоваров()
	
	ТекстЗапроса="ВЫБРАТЬ
	             |	СписаниеТоваровТовары.Номенклатура КАК Номенклатура,
	             |	СписаниеТоваровТовары.Количество * СписаниеТоваровТовары.Коэффициент КАК Количество
	             |ИЗ
	             |	Документ.РеализацияТоваров.Товары КАК СписаниеТоваровТовары
	             |ГДЕ
	             |	СписаниеТоваровТовары.Ссылка = &Ссылка";

	Запрос=Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст=ТекстЗапроса;

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьТаблицуОстатковПартий(СЗ_Товаров)
	
	ТекстЗапроса="ВЫБРАТЬ
	             |	ПартииТоваровДляУчета.Номенклатура КАК Номенклатура,
	             |	ПартииТоваровДляУчета.Партия КАК Партия,
	             |	ПартииТоваровДляУчета.КоличествоОстаток КАК КоличествоОстаток,
	             |	ПартииТоваровДляУчета.СуммаОстаток КАК СуммаОстаток,
	             |	ПартииТоваровДляУчета.Партия.Дата КАК ПартияДата,
	             |	ПартииТоваровДляУчета.Официально
	             |ИЗ
	             |	РегистрНакопления.ПартииТоваровДляУчета.Остатки(&МоментВремени, Номенклатура В (&ВыбСписокНоменклатура)) КАК ПартииТоваровДляУчета
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ПартияДата";

	Запрос=Новый Запрос();
	Запрос.УстановитьПараметр("МоментВремени",?(обЗначениеНеЗаполнено(Ссылка.Дата),ТекущаяДата(),Ссылка.Дата));
 	Запрос.УстановитьПараметр("ВыбСписокНоменклатура",СЗ_Товаров);
	Запрос.Текст=ТекстЗапроса;

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
//Бондаренко-- 20190405

Процедура ПересчитатьПоСебестоимости(Этаформа) Экспорт
	ДокументОбъект = ЭтотОбъект;
	
	//Бондаренко++ 20220308
	Если ДокументОбъект.НепроводнойДляДопОборудования Тогда
 	    Возврат;
 	КонецЕсли;		
	//Бондаренко-- 20220308
	
	ИмяРеквизитаДокумент = "Партия"  ;
	ПартииУказаны=НЕ обЗначениеНеЗаполнено(ИмяРеквизитаДокумент);
	ПартияТоваровОтрицательныхОстатков=Константы.ПартияТоваровОтрицательныхОстатков.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПартииТоваровКомпанииОстатки.СкладКомпании КАК СкладКомпании,
	|	ПартииТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
 	|	ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПартииТоваровКомпанииОстатки.СтатусПартии КАК СтатусПартии,
	|	ПартииТоваровКомпанииОстатки.Партия КАК Партия,
	|	ВЫБОР
	|		КОГДА ПартииТоваровКомпанииОстатки.СтатусПартии = &Купленные
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПорядокСтатуса,
	|	ЕСТЬNULL(ПартииТоваровКомпанииОстатки.КоличествоОстаток, 0) КАК Количество,
	|	ЕСТЬNULL(ПартииТоваровКомпанииОстатки.СуммаНДСОстаток, 0) КАК СуммаНДС,
	|	ЕСТЬNULL(ПартииТоваровКомпанииОстатки.СуммаОстаток, 0) КАК Сумма,
	|	ЕСТЬNULL(ПартииТоваровКомпанииОстатки.СуммаУпрОстаток, 0) КАК СуммаУпр
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании.Остатки(
	|			&Момент,
	|			Номенклатура В (&Номенклатура)
	|				И СкладКомпании = &СкладКомпании) КАК ПартииТоваровКомпанииОстатки
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	РегистрНакопления.ПартииТоваровКомпании.Остатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокСтатуса УБЫВ,
	|	ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры.Сортировка,
	|	ПартииТоваровКомпанииОстатки.Партия.Дата,
	|	ПартииТоваровКомпанииОстатки.Партия
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(СуммаНДС),
	|	СУММА(Сумма),
	|	СУММА(СуммаУпр)
	|ПО
	|	Номенклатура";
	Запрос.УстановитьПараметр("Купленные",Перечисления.СтатусыПартий.ТоварКупленный);	
	Запрос.УстановитьПараметр("Момент",МоментВремени());
	Запрос.УстановитьПараметр("СкладКомпании",СкладКомпании);
	Запрос.УстановитьПараметр("Номенклатура",Товары.ВыгрузитьКолонку("Номенклатура"));
	ТоварыДо = Товары.Выгрузить();
	//ТоварыПосле = ТоварыДо.Очистить();
	ТаблицаТовары = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	//ИмяКолонкиКода=дкПолучитьПараметрыРежимаВыводаКодаВДокументах(,ДокументОбъект).Имя;
	
	Товары.Очистить();
	//Товары.Загрузить(Результат);
	// идем по таблице товаров и списываем партии
	Расход=0;
	
	Для Каждого СтрокаТовар Из ТоварыДо Цикл
		НадоСписать=Окр(СтрокаТовар.Количество,3);
		// получим строки таблицы партий с нашим товаром
		СтрокаПартийНоменклатуры=ТаблицаТовары.Строки.Найти(СтрокаТовар.Номенклатура,"Номенклатура");
		ПоследнийСтатус=Перечисления.СтатусыПартий.ТоварКупленный;
		
		// инициализируем переменные для расчета усредненной цены списанных партий
		ОбщаяСумма = 0; ОбщаяСуммаУпр=0; ОбщаяСуммаНДС = 0; ОбщееКоличество = 0;
		ЕстьПартииТоваров = Ложь;
		
  		Если СтрокаПартийНоменклатуры<>Неопределено Тогда
			СтруктураОтбора=Новый Структура("Номенклатура");
			СтруктураОтбора.Номенклатура=СтрокаТовар.Номенклатура; 
			//Если НЕ обЗначениеНеЗаполнено(СтрокаТовар.ХарактеристикаНоменклатуры) ИЛИ (ТаблицаРучныхХарактеристик<>Неопределено И ТаблицаРучныхХарактеристик.Найти(СтрокаТовар.Номенклатура,"Номенклатура")<>Неопределено) Тогда 
			//	СтруктураОтбора.Вставить("ХарактеристикаНоменклатуры",СтрокаТовар.ХарактеристикаНоменклатуры);
			//КонецЕсли;
			МассивНайденныхСтрок=СтрокаПартийНоменклатуры.Строки.НайтиСтроки(СтруктураОтбора);
			// теперь идем по партиям товаров и списываем в соответствии с выбранной стратегией
			Для Сч=0 По МассивНайденныхСтрок.ВГраница() Цикл
				ТекСтрока=МассивНайденныхСтрок[Сч];
				// проверки на нулевую партию или партию отрицательных остатков
				Если ТекСтрока.Количество=NULL ИЛИ ТекСтрока.Количество=0 Тогда Продолжить; КонецЕсли;
				
				//// если указаны партии, то пропустим все партии не наши
				//Если ПартииУказаны И НЕ обЗначениеНеЗаполнено(СтрокаТовар.Партия) И ТекСтрока.Партия<>СтрокаТовар.Партия Тогда
				//	Продолжить;
				//КонецЕсли;
				
				ЕстьПартииТоваров = Истина; // если есть партия с которой производим списание, значит и цены будем брать из списаний
				
				Если ТекСтрока.Количество<0 Тогда
					// запомним удельные значения списания для отрицательной партии товаров
					ОбщаяСумма      = ОбщаяСумма      + Окр(ТекСтрока.Сумма, 2);
					ОбщаяСуммаУпр   = ОбщаяСуммаУпр   + Окр(ТекСтрока.СуммаУпр, 2);
					ОбщаяСуммаНДС   = ОбщаяСуммаНДС   + Окр(ТекСтрока.СуммаНДС, 2);
					ОбщееКоличество = ОбщееКоличество + ТекСтрока.Количество;
					Продолжить;
				КонецЕсли;
				
				НоваяЗапись = ТОвары.Добавить();
				Партия = ТекСтрока.Партия;
				НоваяЗапись.Партия                     = Партия;
				
				ПоследнийСтатус = ТекСтрока.СтатусПартии;
				
				НоваяЗапись.Номенклатура               = ТекСтрока.Номенклатура;
				
				//Бондаренко++ 20201214
				НоваяЗапись.ИдентификаторТовара = СтрокаТовар.ИдентификаторТовара;
				//Бондаренко-- 20201214
 				
				НоваяЗапись.ХарактеристикаНоменклатуры = ТекСтрока.ХарактеристикаНоменклатуры;
				// определяемся с хоз. операцией
				
				// осуществим движения по реквизиту Проект через попытку, т.к. не у всех документов
				// осуществляющих движения по данному регистру есть данный реквизит. 
				
				Если ТекСтрока.Количество > НадоСписать И ТекСтрока.Количество>0 Тогда
					КоличествоСписания	= НадоСписать;
					СуммаСписания	 	= Окр(ТекСтрока.Сумма/ТекСтрока.Количество*НадоСписать, 2);
					СуммаУпрСписания 	= Окр(ТекСтрока.СуммаУпр/ТекСтрока.Количество*НадоСписать, 2);
					СуммаНДССписания	= Окр(ТекСтрока.СуммаНДС/ТекСтрока.Количество*НадоСписать, 2);
				Иначе
					КоличествоСписания	= ТекСтрока.Количество;
					СуммаСписания	 	= Окр(ТекСтрока.Сумма, 2);
					СуммаУпрСписания 	= Окр(ТекСтрока.СуммаУпр, 2);
					СуммаНДССписания	= Окр(ТекСтрока.СуммаНДС, 2);
				КонецЕсли;
				
				НоваяЗапись.Количество	= КоличествоСписания;
				НоваяЗапись.Сумма		= СуммаСписания;
				//НоваяЗапись.СуммаУпр	= СуммаУпрСписания;
				//НоваяЗапись.СуммаНДС	= СуммаНДССписания;
				
				Расход=Расход+СуммаУпрСписания;
				
				// запомним удельные значения списания для отрицательной партии товаров
				ОбщаяСумма = ОбщаяСумма + СуммаСписания;
				ОбщаяСуммаУпр = ОбщаяСуммаУпр + СуммаУпрСписания;
				ОбщаяСуммаНДС = ОбщаяСуммаНДС + СуммаНДССписания;
				ОбщееКоличество = ОбщееКоличество + КоличествоСписания;
				
				// уменьшим ресурсы для остатка текущей партии
				Если КоличествоСписания >= ТекСтрока.Количество Тогда
					СтрокаПартийНоменклатуры.Строки.Удалить(ТекСтрока);
				Иначе
					ТекСтрока.Количество = ТекСтрока.Количество	- КоличествоСписания;
					ТекСтрока.Сумма		 = ТекСтрока.Сумма		- СуммаСписания;
					//ТекСтрока.СуммаУпр	 = ТекСтрока.СуммаУпр	- СуммаУпрСписания;
					//ТекСтрока.СуммаНДС	 = ТекСтрока.СуммаНДС	- СуммаНДССписания;
				КонецЕсли;
				// уменьшаем количество которое надо списать (или увеличиваем если это коррекция отрицательной партии)
				НадоСписать=НадоСписать - КоличествоСписания;
				Если НадоСписать<=0 Тогда Прервать; КонецЕсли;
			КонецЦикла;
			
			// уменьшим ресурсы для остатка по номенклатуре
			Если ОбщееКоличество >= СтрокаПартийНоменклатуры.Количество Тогда
				ТаблицаТовары.Строки.Удалить(СтрокаПартийНоменклатуры);
			Иначе
				СтрокаПартийНоменклатуры.Количество	 = СтрокаПартийНоменклатуры.Количество	- ОбщееКоличество;
			КонецЕсли;
		КонецЕсли;
		
		// если после списания по партиям осталось еще что-то, то либо образуем партию отрицательных остатков,
		// либо  предупредим о не распределении по партиям
		// проверим чего осталось
		ОтрицательныеОстаткиРазрешены =  (обПраво("РазрешитьОтрицательныеСкладскиеОстатки",ДокументОбъект.Права,,ДокументОбъект)<>Перечисления.ВидыРазрешенныхОтрицательныхОстатков.Запрещены);
		
		Если (НадоСписать<>0) И (ОтрицательныеОстаткиРазрешены ИЛИ НадоСписать<0) Тогда
			//НоваяЗапись = Товары.Добавить();
			////НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Расход;
			////НоваяЗапись.Период = ШапкаДокумента.Дата;
			////НоваяЗапись.Регистратор = ШапкаДокумента.Ссылка;
			//// если партия указана непосредственно, то на нее. Иначе служебная
			//Если ПартииУказаны И НЕ обЗначениеНеЗаполнено(СтрокаТовар.Партия) Тогда
			//	НоваяЗапись.Партия = СтрокаТовар.Партия;
			//	//НоваяЗапись.СтатусПартии = ПоследнийСтатус;
			//Иначе
			//	НоваяЗапись.Партия = ПартияТоваровОтрицательныхОстатков;
			//	//НоваяЗапись.СтатусПартии = Перечисления.СтатусыПартий.ТоварКупленный;
			//КонецЕсли;
			//	
			////НоваяЗапись.СкладКомпании = СкладКомпании;
			//НоваяЗапись.Номенклатура = СтрокаТовар.Номенклатура;
			//НоваяЗапись.ХарактеристикаНоменклатуры = СтрокаТовар.ХарактеристикаНоменклатуры;
			//// хозоперация будет соответствовать статусу партии или текущей хозоперации?
			////НоваяЗапись.ХозОперация = ШапкаДокумента.Хозоперация;
			//// осуществим движения по реквизиту Проект через попытку, т.к. не у всех документов
			//// осуществляющих движения по данному регистру есть данный реквизит. 
			////Попытка
			////	НоваяЗапись.Проект = ШапкаДокумента.Проект;
			////Исключение
			////КонецПопытки;
			////
			////Попытка
			////	НоваяЗапись.ДокументПродажи = ШапкаДокумента.ДокументПродажи;
			////Исключение
			////КонецПопытки;
			//
			//НоваяЗапись.Количество = НадоСписать;
			//
			//// теперь попробуем определиться с суммой списания
			//Если ЕстьПартииТоваров Тогда
			//	Если ОбщееКоличество=0 Тогда
			//		ЦенаПоследнейПартии = 0;
			//		ЦенаУпрПоследнейПартии = 0;
			//		УдельныйНДСПоследнейПартии = 0;
			//	Иначе
			//		ЦенаПоследнейПартии = ОбщаяСумма/ОбщееКоличество;
			//		ЦенаУпрПоследнейПартии = ОбщаяСуммаУпр/ОбщееКоличество;
			//		УдельныйНДСПоследнейПартии = ОбщаяСуммаНДС/ОбщееКоличество;
			//	КонецЕсли; 
			//Иначе // в этом случае пробуем достать оценку из регистра сведений Цены по типу цен Нормативная цена
			//	ТипЦен = Справочники.ТипыЦен.НормативнаяЦена;
			//	// получим цену в валюте управленческого учета компании
			//	ЦенаПоследнейПартии = обПолучитьЦену(ТипЦен,СтрокаТовар.Номенклатура,МоментВремени(),,Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(),, СтрокаТовар.ХарактеристикаНоменклатуры,, СкладКомпании.Подразделение);
			//	ЦенаУпрПоследнейПартии = обПолучитьЦену(ТипЦен,СтрокаТовар.Номенклатура,МоментВремени(),,Константы.ВалютаУправленческогоУчетаКомпании.Получить(),, СтрокаТовар.ХарактеристикаНоменклатуры,, СкладКомпании.Подразделение);
			//	// розничную оценку берем по типу цен основной тип цен отгрузки
			//	ТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенПродажи;
			//	// для расчета НДС сначала определимся со ставкой
			//	СтавкаНДС = СтрокаТовар.Номенклатура.СтавкаНДС;
			//	УдельныйНДСПоследнейПартии = (ЦенаПоследнейПартии*СтавкаНДС.Ставка)/100;
			//КонецЕсли;
			//
			//НоваяЗапись.Сумма = Окр(ЦенаПоследнейПартии*НадоСписать,2);
			////НоваяЗапись.СуммаУпр = Окр(ЦенаУпрПоследнейПартии*НадоСписать,2);
			////НоваяЗапись.СуммаНДС = Окр(УдельныйНДСПоследнейПартии*НадоСписать,2);
			//
			//// ПОДЛЕЖИТ ИСПРАВЛЕНИЮ? Стоит ли влиять на сумму расхода?		
			//Расход=Расход+НоваяЗапись.Сумма;
			
		ИначеЕсли НадоСписать<>0 Тогда
			//Если ПартииУказаны И НЕ обЗначениеНеЗаполнено(СтрокаТовар.Партия) Тогда
			//	// не хватило товара по партии. Ошибка
			//	#Если Клиент Тогда
			//	Если обЗначениеНеЗаполнено(СтрокаТовар.ХарактеристикаНоменклатуры) Тогда
			//		дкСообщитьРезультат("["+дкПолучитьЗначениеКолонкиКода(СтрокаТовар.Номенклатура,ИмяКолонкиКода,ДокументОбъект)+"] Товар """+СокрЛП(СтрокаТовар.Номенклатура)+""" не распределился по партии "+СокрЛП(СтрокаТовар.Партия)+" !","Важное&Партии товаров компании:",ДокументОбъект,СтрокаТовар.Номенклатура);
			//	Иначе 
			//		дкСообщитьРезультат("["+дкПолучитьЗначениеКолонкиКода(СтрокаТовар.Номенклатура,ИмяКолонкиКода,ДокументОбъект)+"] Товар """+СокрЛП(СтрокаТовар.Номенклатура)+""" с характеристикой """+СокрЛП(СтрокаТовар.ХарактеристикаНоменклатуры)+""" не распределился по партии "+СокрЛП(СтрокаТовар.Партия)+" !","Важное&Партии товаров компании:",ДокументОбъект,СтрокаТовар.Номенклатура);					
			//	КонецЕсли; 
			//	ВсеОК=Ложь;
			//	#КонецЕсли
			//Иначе
			//	#Если Клиент Тогда
			//	Если обЗначениеНеЗаполнено(СтрокаТовар.ХарактеристикаНоменклатуры) Тогда
			//		дкСообщитьРезультат("["+дкПолучитьЗначениеКолонкиКода(СтрокаТовар.Номенклатура,ИмяКолонкиКода,ДокументОбъект)+"] Товар """+СокрЛП(СтрокаТовар.Номенклатура)+""" не распределился по партиям !","Важное&Партии товаров компании:",ДокументОбъект,СтрокаТовар.Номенклатура);
			//	Иначе
			//		дкСообщитьРезультат("["+дкПолучитьЗначениеКолонкиКода(СтрокаТовар.Номенклатура,ИмяКолонкиКода,ДокументОбъект)+"] Товар """+СокрЛП(СтрокаТовар.Номенклатура)+""" с характеристикой """+СокрЛП(СтрокаТовар.ХарактеристикаНоменклатуры)+""" не распределился по партиям !","Важное&Партии товаров компании:",ДокументОбъект,СтрокаТовар.Номенклатура);
			//	КонецЕсли; 
			//	ВсеОК=Ложь;
			//	#КонецЕсли
			//КонецЕсли;
			ДатаДок = МоментВремени().Дата;
			#Если НаКлиенте Тогда
			Сообщить(Формат(ДатаДок, "ДЛФ=Д") + " в " + Формат(ДатаДок, "ДЛФ=В") + " товар """ + СокрЛП(СтрокаТовар.Номенклатура) + """ (в количестве " + НадоСписать + ") отсутствовал на складе!", СтатусСообщения.ОченьВажное);
			#КонецЕсли 
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого стр из Товары цикл
		
		//Бондаренко++ 20161227
		Если НЕ обЗначениеНеЗаполнено(Контрагент) Тогда
			Если Контрагент.НашаФирма Тогда
				Если (Не обЗначениеНеЗаполнено(Дата)) И (Дата>Дата(2016,10,31)) Тогда
					//СвойствоПоНоменклатуре = обПолучитьЗначениеСвойства(Стр.Номенклатура.Ссылка,ПланыВидовХарактеристик.СвойстваОбъектов._г_Масло,Ложь);
					//Если СвойствоПоНоменклатуре Тогда
					//	//Это масло. Надо продавать нашей фирме по Основной цене продажи.
					//	ОснЦенаПродажи = 0;
					//	ОснЦенаПродажи = обПолучитьЦену(Справочники.ТипыЦен.ОсновнойТипЦенПродажи,Стр.Номенклатура,Дата,,ВалютаДокумента,КурсДокумента, ,Стр.ЕдиницаИзмерения , ПодразделениеКомпании);
					//	Если ОснЦенаПродажи = 0 Тогда
					//		ОснЦенаПродажи = обПолучитьЦену(Справочники.ТипыЦен.ОсновнойТипЦенПродажи,Стр.Номенклатура,Дата,,ВалютаДокумента,КурсДокумента, , , ПодразделениеКомпании);
					//	КонецЕсли;	
					//	
					//	//Бондаренко++ 20170428
					//	Если ОснЦенаПродажи = 0 Тогда
					//		ОснЦенаПродажи = обПолучитьЦену(Справочники.ТипыЦен.ОсновнойТипЦенПродажи,Стр.Номенклатура,Дата,,ВалютаДокумента,КурсДокумента, , , Справочники.ПодразделенияКомпании.ОсновноеПодразделение);
					//	КонецЕсли;	
					//	//Бондаренко++ 20170428
					//	
					//	Если ОснЦенаПродажи = 0 Тогда
					//		Сообщить("ОШИБКА! Не найдена розничная цена для ["+Стр.Номенклатура.Артикул+"] "+Стр.Номенклатура+" ; Обработка прервана.",СтатусСообщения.ОченьВажное);
					//		Стр.Сумма = Стр.Сумма*1.01;
					//	Иначе
					//		Стр.Цена=ОснЦенаПродажи;
					//		Стр.Сумма=ОснЦенаПродажи*Стр.Количество;
					//	КонецЕсли; 
					//Иначе
					
					//Бондаренко++ 20180830
					Если Организация.ФормаСобственности=Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
  						Стр.Сумма = Стр.Сумма*1.00;
					Иначе
						//Бондаренко++ 20200324
						//Стр.Сумма = Стр.Сумма*1.01;
						Стр.Сумма = Стр.Сумма*1.00;
						//Бондаренко-- 20200324
					КонецЕсли; 
					//Стр.Сумма = Стр.Сумма*1.01;
					//Бондаренко-- 20180830	 
					//КонецЕсли; 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		//Бондаренко-- 20161227
		
		стр.ЕдиницаИзмерения = стр.Номенклатура.ОсновнаяЕдиницаИзмерения;
		
 		Если Стр.Количество > 0 Тогда
			Стр.Цена = стр.Сумма/Стр.Количество;
			//Бондаренко++ 20220513
			Если Стр.Количество > 1 Тогда
				Стр.Цена = Стр.Цена+0.01;
				Стр.Сумма = Стр.Цена*Стр.Количество;
			КонецЕсли;
 			//Бондаренко++ 20220513
		КонецЕсли; 
 		
		Стр.КоличествоБазовое = стр.Количество;
		Стр.Коэффициент = 1;
		СтрокаДо = ТоварыДо.Найти(стр.Номенклатура,"Номенклатура");
		
		Если СтрокаДо <> Неопределено тогда
			стр.СтавкаНДС = СтрокаДо.СтавкаНДС;
			ОбработкаРеквизита("Товары.СтавкаНДС",стр,Этаформа);
		КонецЕсли;  
		
		//ОбработкаРеквизита("Товары.Цена",стр,Этаформа);
		
		//стр.Сумма = стр.Сумма;
		
		//Бондаренко++ 20161020
		Если НЕ обЗначениеНеЗаполнено(Контрагент) Тогда
			Если Контрагент.НашаФирма Тогда
				Если (Не обЗначениеНеЗаполнено(Дата)) И (Дата>Дата(2016,10,31)) 
					//И (НЕ обПолучитьЗначениеСвойства(Стр.Номенклатура.Ссылка,ПланыВидовХарактеристик.СвойстваОбъектов._г_Масло,Ложь)) 
					Тогда
						Если Организация.ФормаСобственности<>Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда //Бондаренко++ 20180830	 
						    //Бондаренко++ 20200324
 							//стр.Сумма = Окр(стр.Сумма+0.5,0);
							//Бондаренко-- 20200324 убрал округление до рубля
						КонецЕсли; 				                                                                          //Бондаренко-- 20180830	 
 				КонецЕсли; 		
			КонецЕсли; 
		КонецЕсли; 
		//Бондаренко++ 20161020
		
	//	ОбработкаРеквизита("Товары.Сумма",стр,Этаформа);
		
	КонецЦикла;	
КонецПроцедуры	

//Бондаренко++ 20170320

// <Описание функции>
//
// Параметры
//  ПараметрыДоговора  - Структура: Контрагент, Организация, ВидДоговора.
//
// Возвращаемое значение:
//   Справочники.ДоговорыВзаиморасчетов  или пустая ссылка этого же типа  
//
Функция НайтиДоговор(ПараметрыДоговора)
	
	ДоговорВзаиморасчетовТек = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	
	//Бондаренко++ 20180321
	//Если СокрЛП(ПараметрыДоговора.Организация.ИНН)<>"6167075244" Тогда 
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//	|	ДоговорыВзаиморасчетов.Ссылка,
	//	|	ДоговорыВзаиморасчетов.ВидДоговора,
	//	|	ДоговорыВзаиморасчетов.Владелец,
	//	|	ДоговорыВзаиморасчетов.Организация,
	//	|	ДоговорыВзаиморасчетов.ДатаСоздания КАК ДатаСоздания,
	//	|	ДоговорыВзаиморасчетов.ДляЗапчастей,
	//	|	ДоговорыВзаиморасчетов.ПометкаУдаления,
	//	|	ДоговорыВзаиморасчетов.Владелец.ОсновнойДоговорВзаиморасчетов КАК ОснДоговор,
	//	|	ДоговорыВзаиморасчетов.ДляПерепродаж,
	//	|	ДоговорыВзаиморасчетов.Подразделение
	//	|ИЗ
	//	|	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	//	|ГДЕ
	//	|	ДоговорыВзаиморасчетов.Владелец = &ВыбВладелец
	//	|	И ДоговорыВзаиморасчетов.Организация = &ВыбОрганизация
	//	|	И ДоговорыВзаиморасчетов.ВидДоговора = &ВыбВидДоговора
	//	|	И ДоговорыВзаиморасчетов.ДляЗапчастей = ИСТИНА
	//	|	И ДоговорыВзаиморасчетов.ДляПерепродаж = ИСТИНА
	//	|	И ДоговорыВзаиморасчетов.ПометкаУдаления = ЛОЖЬ
	//	|	И ДоговорыВзаиморасчетов.Подразделение = &ВыбПодразделение
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	ДатаСоздания";
	//	Запрос.УстановитьПараметр("ВыбПодразделение", ПараметрыДоговора.Подразделение);
 	//Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДоговорыВзаиморасчетов.Ссылка,
		|	ДоговорыВзаиморасчетов.ВидДоговора,
		|	ДоговорыВзаиморасчетов.Владелец,
		|	ДоговорыВзаиморасчетов.Организация,
		|	ДоговорыВзаиморасчетов.ДатаСоздания КАК ДатаСоздания,
		|	ДоговорыВзаиморасчетов.ДляЗапчастей,
		|	ДоговорыВзаиморасчетов.ПометкаУдаления,
		|	ДоговорыВзаиморасчетов.Владелец.ОсновнойДоговорВзаиморасчетов КАК ОснДоговор,
		|	ДоговорыВзаиморасчетов.ДляПерепродаж
		|ИЗ
		|	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
		|ГДЕ
		|	ДоговорыВзаиморасчетов.Владелец = &ВыбВладелец
		|	И ДоговорыВзаиморасчетов.Организация = &ВыбОрганизация
		|	И ДоговорыВзаиморасчетов.ВидДоговора = &ВыбВидДоговора
		|	И ДоговорыВзаиморасчетов.ДляЗапчастей = ИСТИНА
		|	И ДоговорыВзаиморасчетов.ДляПерепродаж = ИСТИНА
		|	И ДоговорыВзаиморасчетов.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаСоздания";
 	//КонецЕсли; 
	//Бондаренко-- 20180321
	
 	
	Запрос.УстановитьПараметр("ВыбВидДоговора", ПараметрыДоговора.ВидДоговора);
	Запрос.УстановитьПараметр("ВыбВладелец", ПараметрыДоговора.Контрагент);
	Запрос.УстановитьПараметр("ВыбОрганизация", ПараметрыДоговора.Организация);
 	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДоговорВзаиморасчетовТек = ВыборкаДетальныеЗаписи.Ссылка; 
		Если ВыборкаДетальныеЗаписи.ДляПерепродаж Тогда
			//Бондаренко++ 20200413
			Возврат ДоговорВзаиморасчетовТек;
			//Бондаренко-- 20200413
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	
	Если обЗначениеНезаполнено(ДоговорВзаиморасчетовТек) Тогда
		Дог = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
		Дог.Автор=ПараметрыСеанса.Пользователь;
		Дог.ДатаСоздания=ТекущаяДата();
		Дог.ДатаНачала=ТекущаяДата();
		Дог.ВидДоговора=ПараметрыДоговора.ВидДоговора;
		Дог.Владелец = ПараметрыДоговора.Контрагент;
		Дог.Организация = ПараметрыДоговора.Организация;
		Дог.Подразделение = ПараметрыДоговора.Подразделение;
		Дог.ВалютаВзаиморасчетов=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		Дог.ВидОплаты=Перечисления.ВидыОплаты.ПроизвольнаяОплата;
		Дог.ДляЗапчастей=Истина;
		Дог.ДляПерепродаж=Истина;
		Дог.Наименование = СокрЛП(Строка(Дог.ВидДоговора))
		+ ?(ПустаяСтрока(Дог.НомерДоговора),""," № " + СокрЛП(Дог.НомерДоговора))
		+ " в " + Дог.ВалютаВзаиморасчетов.Наименование
		+ " от "+Формат(Дог.ДатаНачала,"ДФ=дд.ММ.гг");
		
		Попытка
			Дог.Записать();
			ДоговорВзаиморасчетов = Дог.Ссылка;
		Исключение
			#Если НаКлиенте Тогда
				Сообщить("ОШИБКА! Не удалось записать договор");		
			#КонецЕсли 
		КонецПопытки;
		
	КонецЕсли; 
	
	Возврат ДоговорВзаиморасчетовТек;
	
	
КонецФункции // НайтиДоговор(ПараметрыДоговора)
//Бондаренко 20160119 --

//Бондаренко 20160118 ++

Функция НайтиРозничнуюЦену(Номенклатура,ТипЦен,ЕдИзмерения,Подразделение)
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныСрезПоследних.Номенклатура,
	|	ЦеныСрезПоследних.ТипЦен,
	|	ЦеныСрезПоследних.ЕдиницаИзмерения,
	|	ЦеныСрезПоследних.ПодразделениеКомпании,
	|	ЦеныСрезПоследних.Цена,
	|	ЦеныСрезПоследних.Период КАК Период
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних КАК ЦеныСрезПоследних
	|ГДЕ
	|	ЦеныСрезПоследних.Номенклатура = &ВыбНомен
	|	И ЦеныСрезПоследних.ТипЦен = &ВыбТипЦен
	|	И ЦеныСрезПоследних.ЕдиницаИзмерения = &ВыбЕдИзмерен
	|	И ЦеныСрезПоследних.ПодразделениеКомпании = &ВыбПодразделение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Запрос.Параметры.Вставить("ВыбНомен",Номенклатура);
	Запрос.Параметры.Вставить("ВыбТипЦен",ТипЦен);
	Запрос.Параметры.Вставить("ВыбЕдИзмерен",ЕдИзмерения);
	Запрос.Параметры.Вставить("ВыбПодразделение",Подразделение);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Цена;
	КонецЦикла;
	
	Возврат 0;
	
	
КонецФункции // НайтиРозничнуюЦену()
 Функция СоздатьДокументыПерепродажиПоЮрЛицам (ТоварыКПродаже,ФлагНашаФирма) Экспорт 
	
	//Бондаренко++ 20190204
	СтавкаНДС20 = Справочники.СтавкиНДС.НайтиПоРеквизиту("Ставка", 20);
	//Бондаренко-- 20190204
	
	ЕстьОшибки=Ложь;
	
 	Если Не ФлагНашаФирма Тогда
 		
		РеализацияОбъект = Документы.РеализацияТоваров.СоздатьДокумент();
		РеализацияОбъект.РегламентированныйУчет = Истина;
		РеализацияОбъект.Дата = ТекущаяДата();
		РеализацияОбъект.УстановитьНовыйНомер();
		РеализацияОбъект.ХозОперация = Справочники.ХозОперации.РеализацияТоваров;
		
		РеализацияОбъект.ДокументОснование=Ссылка;
		
		РеализацияОбъект.Организация = ТоварыКПродаже[0].ОрганизацияПоставщик;
		РеализацияОбъект.ОбработкаРеквизита("Организация");
		
		РеализацияОбъект.ПодразделениеКомпании = ТоварыКПродаже[0].ПодразделениеПоставщик;
		//РеализацияОбъект.ОбработкаРеквизита("ПодразделениеКомпании");
		
		РеализацияОбъект.СкладКомпании = ТоварыКПродаже[0].СкладОтправитель;
		
		ДопПараметры = Новый Структура("НеРассчитыватьСкидки,ВозможностьИзмененияЦен",Истина,Ложь);
		РеализацияОбъект.ОбработкаРеквизита("СкладКомпании",,,ДопПараметры);
		
		
		Если РеализацияОбъект.ПодразделениеКомпании.ДилерскийЦентр=Справочники.ДилерскиеЦентры.Еврокар_Гамма Тогда
			Попытка
				РеализацияОбъект.ТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенЗакупки;
				РеализацияОбъект.ОбработкаРеквизита("ТипЦен");
			Исключение
				#Если НаКлиенте Тогда
				Сообщить("ОШИБКА! Не найден тип цен 'Основной тип цен закупки'. Обработка прервана.", СтатусСообщения.ОченьВажное);
				#КонецЕсли 
				ЕстьОшибки=Истина;
				Возврат ЕстьОшибки;
			КонецПопытки;	
		Иначе	
			Попытка
				РеализацияОбъект.ТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенЗакупки;
				РеализацияОбъект.ОбработкаРеквизита("ТипЦен");
			Исключение
				#Если НаКлиенте Тогда
				Сообщить("ОШИБКА! Не найден тип цен 'Основной тип цен закупки'. Обработка прервана.", СтатусСообщения.ОченьВажное);
				#КонецЕсли
				ЕстьОшибки=Истина;
				Возврат ЕстьОшибки;
			КонецПопытки;	
		КонецЕсли; 
		
		РеализацияОбъект.КурсВалютыВзаиморасчетов=1;
		РеализацияОбъект.КурсВалютыУпр=1;
		РеализацияОбъект.КурсДокумента=1;
		
		РеализацияОбъект.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		РеализацияОбъект.ОбработкаРеквизита("ВалютаДокумента");
		
		РеализацияОбъект.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", ТоварыКПродаже[0].ИНН_Покупателя);
		РеализацияОбъект.ОбработкаРеквизита("Контрагент");
		
		//Договоры  = Справочники.ДоговорыВзаиморасчетов;
		//
		//Отбор1 = Новый Структура("Организация");
		//Отбор1.Организация = РеализацияОбъект.Организация;
		// 
		//Выборка = Справочники.ДоговорыВзаиморасчетов.Выбрать(,РеализацияОбъект.Контрагент);
		//
		//Пока Выборка.Следующий() Цикл
		//	Если Выборка.ВидДоговора <> Перечисления.ВидыДоговоров.Продажа Тогда
		//		Продолжить;
		//	КонецЕсли;  
		//	Если Выборка.Организация <> РеализацияОбъект.Организация Тогда
		//		Продолжить;
		//	КонецЕсли;  
		//   	РеализацияОбъект.ДоговорВзаиморасчетов=Выборка.ПолучитьОбъект().Ссылка;
		// 	Прервать;
		// КонецЦикла; 
		
		ПараметрыДоговора = Новый Структура;
		ПараметрыДоговора.Вставить("Контрагент",РеализацияОбъект.Контрагент);
		ПараметрыДоговора.Вставить("ВидДоговора",Перечисления.ВидыДоговоров.Продажа);
		ПараметрыДоговора.Вставить("Организация",РеализацияОбъект.Организация);
		ПараметрыДоговора.Вставить("Подразделение",РеализацияОбъект.ПодразделениеКомпании);
		
		
		РеализацияОбъект.ДоговорВзаиморасчетов = НайтиДоговор(ПараметрыДоговора);
		РеализацияОбъект.ОбработкаРеквизита("ДоговорВзаиморасчетов");	
		
		РеализацияОбъект.Автор = ПараметрыСеанса.Пользователь;
		РеализацияОбъект.Комментарий = "Создан автоматически "+ТекущаяДата()+" пользователем "+ПараметрыСеанса.Пользователь+" для перепродажи запасных частей между организациями";
		РеализацияОбъект.СформированАвтоматически=Истина;
		
		Для Каждого стр из ТоварыКПродаже цикл 
			СтрокаРеализации = РеализацияОбъект.Товары.Добавить();
			СтрокаРеализации.Номенклатура = стр.Товар;
			
			//Отбор = Новый Структура;
			//Отбор.Вставить("ТипЦен",РеализацияОбъект.ТипЦен);
			//Отбор.Вставить("Номенклатура",стр.Товар);
			//Отбор.Вставить("ЕдиницаИзмерения",стр.ЕдиницаИзмерения);
			//Отбор.Вставить("ПодразделениеКомпании",РеализацияОбъект.ПодразделениеКомпании);
			//
			//ТЗ = Новый ТаблицаЗначений;
			//ТЗ = РегистрыСведений.Цены.СрезПоследних(,Отбор);
			//Попытка
			//	СтрокаРеализации.Цена = ТЗ[0].Цена;
			//Исключение	
			//	СтрокаРеализации.Цена = 0.01;
			//КонецПопытки;
			
			СтрокаРеализации.Цена = обПолучитьЦену(РеализацияОбъект.ТипЦен,СтрокаРеализации.Номенклатура,РеализацияОбъект.Дата,,РеализацияОбъект.ВалютаДокумента,РеализацияОбъект.КурсДокумента, ,СтрокаРеализации.ЕдиницаИзмерения , РеализацияОбъект.ПодразделениеКомпании);
			
			СтрокаРеализации.Количество = стр.Количество;
			СтрокаРеализации.ЕдиницаИзмерения = стр.ЕдиницаИзмерения;
			
 			//Бондаренко++ 20190204
			//СтрокаРеализации.СтавкаНДС=Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
			Если ТекущаяДата() >= Дата(2019,1,1) Тогда
				СтрокаРеализации.СтавкаНДС=СтавкаНДС20;	
 			Иначе
				СтрокаРеализации.СтавкаНДС=Справочники.СтавкиНДС.ОсновнаяСтавкаНДС; 
 			КонецЕсли; 
 			//Бондаренко-- 20190204
 
			ДопПараметры = Новый Структура;
			
			ДопПараметры.Вставить("НеКонтролироватьЗамены",Истина);
			ДопПараметры.Вставить("ПересчитатьЦену",Истина);
			РеализацияОбъект.ОбработкаРеквизита("Товары.Номенклатура", СтрокаРеализации,, ДопПараметры);
			
			РеализацияОбъект.ОбработкаРеквизита("Товары.ХарактеристикаНоменклатуры", СтрокаРеализации,, ДопПараметры);
			РеализацияОбъект.ОбработкаРеквизита("Товары.ЕдиницаИзмерения", СтрокаРеализации,, ДопПараметры);
			РеализацияОбъект.ОбработкаРеквизита("Товары.Количество", СтрокаРеализации,, ДопПараметры);
			РеализацияОбъект.ОбработкаРеквизита("Товары.Коэффициент", СтрокаРеализации,, ДопПараметры);
			
			//Бондаренко 20160301 ++
			
			Если РеализацияОбъект.Организация.ОсвобожденОтНДС Тогда
				//Бондаренко++ 20180904
				Если РеализацияОбъект.Контрагент.НашаФирма Тогда
					//Бондаренко++ 20190204
					//СтрокаРеализации.СтавкаНДС=Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
					Если ТекущаяДата() >= Дата(2019,1,1) Тогда
						СтрокаРеализации.СтавкаНДС=СтавкаНДС20;	
 					Иначе
						СтрокаРеализации.СтавкаНДС=Справочники.СтавкиНДС.ОсновнаяСтавкаНДС; 
					КонецЕсли; 
					//Бондаренко-- 20190204
				Иначе
					СтрокаРеализации.СтавкаНДС=Справочники.СтавкиНДС.БезНДС;
				КонецЕсли; 
				//СтрокаРеализации.СтавкаНДС=Справочники.СтавкиНДС.БезНДС;
				//Бондаренко++ 20180904
			Иначе	
				//Бондаренко++ 20190204
				//СтрокаРеализации.СтавкаНДС=Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
				Если ТекущаяДата() >= Дата(2019,1,1) Тогда
					СтрокаРеализации.СтавкаНДС=СтавкаНДС20;	
				Иначе
					СтрокаРеализации.СтавкаНДС=Справочники.СтавкиНДС.ОсновнаяСтавкаНДС; 
				КонецЕсли; 
				//Бондаренко-- 20190204
			КонецЕсли; 
			//Бондаренко 20160301 --
			
			РеализацияОбъект.ОбработкаРеквизита("Товары.СтавкаНДС", СтрокаРеализации,, ДопПараметры);
			
			СтрокаРеализации.СуммаВсего=СтрокаРеализации.Сумма;
			РеализацияОбъект.ОбработкаРеквизита("Товары.СуммаВсего", СтрокаРеализации,, ДопПараметры);
			
		КонецЦикла;
		
		
		РеализацияОбъект.ПересчитатьПоСебестоимости(""); 
		
		//Бондаренко++ 20220103
		Для каждого СтрокаРеализации Из Товары Цикл
		    Если СтрокаРеализации.Цена = 0 Тогда
			   СтрокаРеализации.Цена = обПолучитьЦену(Справочники.ТипыЦен.ОсновнойТипЦенЗакупки,СтрокаРеализации.Номенклатура,РеализацияОбъект.Дата,,РеализацияОбъект.ВалютаДокумента,РеализацияОбъект.КурсДокумента, ,СтрокаРеализации.ЕдиницаИзмерения , Справочники.ПодразделенияКомпании.ОсновноеПодразделение );
			   Если СтрокаРеализации.Цена = 0 Тогда
					СтрокаРеализации.Цена = обПолучитьЦену(Справочники.ТипыЦен.ОсновнойТипЦенЗакупки,СтрокаРеализации.Номенклатура,РеализацияОбъект.Дата,,РеализацияОбъект.ВалютаДокумента,РеализацияОбъект.КурсДокумента, ,СтрокаРеализации.ЕдиницаИзмерения, РеализацияОбъект.ПодразделениеКомпании);			   
			   КонецЕсли;		
			   Если СтрокаРеализации.Цена = 0 Тогда
					СтрокаРеализации.Цена = 1;			   
				КонецЕсли;
 				СтрокаРеализации.Сумма = СтрокаРеализации.Цена*СтрокаРеализации.Количество*СтрокаРеализации.Коэффициент;
				СтрокаРеализации.СуммаВсего = СтрокаРеализации.Сумма;
				СтрокаРеализации.СуммаНДС = СтрокаРеализации.СуммаВсего*СтрокаРеализации.СтавкаНДС.Ставка/(100+СтрокаРеализации.СтавкаНДС.Ставка);				
		   КонецЕсли;
  		КонецЦикла;
 		//Бондаренко-- 20220103
 		
		//Для каждого Стр Из РеализацияОбъект.Товары Цикл
		//	
		//	СвойствоПоНоменклатуре = обПолучитьЗначениеСвойства(стр.Номенклатура.Ссылка,ПланыВидовХарактеристик.СвойстваОбъектов._г_Масло,Ложь);
		//	
		//	Если СвойствоПоНоменклатуре тогда
		//		
		//		Цена = 0;
		//		
		//		Цена = обПолучитьЦену(Справочники.ТипыЦен.ОсновнойТипЦенПродажи,Стр.Номенклатура,РеализацияОбъект.Дата,,РеализацияОбъект.ВалютаДокумента,РеализацияОбъект.КурсДокумента, ,Стр.ЕдиницаИзмерения , РеализацияОбъект.ПодразделениеКомпании);
		//		
		//		Если Цена = 0 Тогда
		//			Цена = обПолучитьЦену(Справочники.ТипыЦен.ОсновнойТипЦенПродажи,Стр.Номенклатура,РеализацияОбъект.Дата,,РеализацияОбъект.ВалютаДокумента,РеализацияОбъект.КурсДокумента, , , РеализацияОбъект.ПодразделениеКомпании);
		//		КонецЕсли;
		//		
		//		//Бондаренко++ 20170428
		//		Если Цена = 0 Тогда
		//			Цена = обПолучитьЦену(Справочники.ТипыЦен.ОсновнойТипЦенПродажи,Стр.Номенклатура,РеализацияОбъект.Дата,,РеализацияОбъект.ВалютаДокумента,РеализацияОбъект.КурсДокумента, , , Справочники.ПодразделенияКомпании.ОсновноеПодразделение);
		//		КонецЕсли;	
		//		//Бондаренко++ 20170428
		//	
		//		Если Цена = 0 Тогда
		//			Сообщить("ОШИБКА! Не найдена розничная цена для ["+Стр.Номенклатура.Артикул+"] "+Стр.Номенклатура+" ; Обработка прервана.",СтатусСообщения.ОченьВажное);
		//			ЕстьОшибки=Истина;
		//			Возврат ЕстьОшибки;
		//		КонецЕсли; 
		//		
		//		Если Цена > 0 Тогда
		//			Стр.Цена=Цена;
		//			Стр.Сумма=Стр.Цена*Стр.Количество*Стр.Коэффициент;
		//			ДопПараметры.Вставить("НеКонтролироватьЗамены",Истина);
		//			ДопПараметры.Вставить("ПересчитатьЦену",Истина);
		//			РеализацияОбъект.ОбработкаРеквизита("Товары.Номенклатура", Стр,, ДопПараметры);
		//			РеализацияОбъект.ОбработкаРеквизита("Товары.ХарактеристикаНоменклатуры", Стр,, ДопПараметры);
		//			РеализацияОбъект.ОбработкаРеквизита("Товары.ЕдиницаИзмерения", Стр,, ДопПараметры);
		//			РеализацияОбъект.ОбработкаРеквизита("Товары.Количество", Стр,, ДопПараметры);
		//			РеализацияОбъект.ОбработкаРеквизита("Товары.Коэффициент", Стр,, ДопПараметры);
		//			
		//			Если РеализацияОбъект.Организация.ОсвобожденОтНДС Тогда
		//				Стр.СтавкаНДС=Справочники.СтавкиНДС.БезНДС;
		//			Иначе	
		//				Стр.СтавкаНДС=Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
		//			КонецЕсли;
		//			
		//			РеализацияОбъект.ОбработкаРеквизита("Товары.СтавкаНДС", Стр,, ДопПараметры);
		//			Стр.СуммаВсего=Стр.Сумма;
		//			РеализацияОбъект.ОбработкаРеквизита("Товары.СуммаВсего", Стр,, ДопПараметры);
		//		Иначе
		//			ЕстьОшибки=Истина;	
		//		КонецЕсли; 
		//		
		//	КонецЕсли;
		//	
		//	//Бондаренко++ 20161019
		//	//Стр.Сумма = Окр(Стр.Сумма*1.01); 
		//	//для масло не надо
		//	Стр.СуммаВсего=Стр.Сумма;
		//	РеализацияОбъект.ОбработкаРеквизита("Товары.СуммаВсего", Стр,, ДопПараметры);
		//	Кол = Стр.Количество*Стр.Коэффициент;
		//	Если Кол  > 0 Тогда
		//		Стр.Цена = Стр.Сумма / Кол;
		//	КонецЕсли; 
		//	//Бондаренко-- 20161019
		//	
		//КонецЦикла;
		
		Если ЕстьОшибки Тогда
			#Если НаКлиенте Тогда
			Сообщить("ОШИБКА! Реализация для перепродажи не сформирована.",СтатусСообщения.ОченьВажное);
			#КонецЕсли 
			Возврат ЕстьОшибки;
		КонецЕсли;
		
		//Бондаренко++ 20180905
		Попытка
			РеализацияОбъект.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			#Если НаКлиенте Тогда
			Сообщить(ОписаниеОшибки());
			#КонецЕсли
			ЕстьОшибки=Истина;
		КонецПопытки;
		
		Попытка
			СвойствоАвто = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
 			СвойствоАвто.Объект   = РеализацияОбъект.Ссылка;
			СвойствоАвто.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ДокументСозданАвтоматически;
			СвойствоАвто.Значение = Истина;
 			СвойствоАвто.Записать(Истина);
		Исключение
			//
		Конецпопытки;	
 		//Бондаренко++ 20180905
  		
		Попытка
			РеализацияОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			#Если НаКлиенте Тогда
			Сообщить(ОписаниеОшибки());
			#КонецЕсли
			ЕстьОшибки=Истина;
		КонецПопытки;
 		
		ТЗ_Себест = РеализацияОбъект.Движения.ПартииТоваровКомпании.Выгрузить();
		Если РольДоступна("ПолныеПрава") Тогда
 			ТЗ_Себест.ВыбратьСтроку();
		КонецЕсли;	
			
		//Бондаренко++ 20181004
		//ТЗ_Себест.Свернуть("Номенклатура","СуммаУпр");  
		ТЗ_Себест.Свернуть("Номенклатура","СуммаУпр,Количество");
		
		ТЗ_Себест.Очистить();
		
		Для Каждого СтрокаТовары Из РеализацияОбъект.Товары Цикл
			СуммаСписания = дкПолучитьСуммуСписания(РеализацияОбъект, "ПартииТоваровКомпании", , СтрокаТовары.Номенклатура,, СтрокаТовары.НомерСтроки);
			НовСтр = ТЗ_Себест.Добавить();
			НовСтр.Номенклатура = СтрокаТовары.Номенклатура;
			НовСтр.Количество = СтрокаТовары.Количество * СтрокаТовары.Коэффициент;
			НовСтр.СуммаУпр = СуммаСписания;
		КонецЦикла;
		
		Если РольДоступна("ПолныеПрава") Тогда
			ТЗ_Себест.ВыбратьСтроку();
		КонецЕсли;		
 
		//Бондаренко-- 20181004
 		//ТЗ_Себест.ВыбратьСтроку();
		
		Если ЕстьОшибки Тогда
			#Если НаКлиенте Тогда
			Сообщить("ОШИБКА! Реализация для перепродажи не сформирована.",СтатусСообщения.ОченьВажное);
			#КонецЕсли 
			Возврат ЕстьОшибки;
		КонецЕсли; 
		
		//Бондаренко++ 20170905
		Попытка
			СвойствоАвто = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
 			СвойствоАвто.Объект   = РеализацияОбъект.Ссылка;
			СвойствоАвто.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ДокументСозданАвтоматически;
			СвойствоАвто.Значение = Истина;
 			СвойствоАвто.Записать(Истина);
		Исключение
			//
		Конецпопытки;	
 		//Бондаренко-- 20170905
 
		#Если НаКлиенте Тогда
		Сообщить("Сформирован документ: "+РеализацияОбъект,СтатусСообщения.Информация);
		#КонецЕсли
		
		ТабДок  = Новый ТабличныйДокумент;
		
		//Бондаренко++ 20190222
		//РеализацияОбъект.ПечатьТОРГ12(ТабДок);
		РеализацияОбъект.ПечатьУПД(ТабДок);
		//Бондаренко-- 20190222
		ТабДок.АвтоМасштаб=Истина;
		ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
		ТабДок.ТолькоПросмотр=Истина;
		ТабДок.Показать();
		
	КонецЕсли; 
	
	ФормироватьСФ = Истина;
	
	Если ФлагНашаФирма  Тогда
		Если ЗначениеЗаполнено(Ссылка.Организация) Тогда
			Если Ссылка.Организация.ОсвобожденОтНДС Тогда
				//Бондаренко-- 200180904
				Если Ссылка.Контрагент.НашаФирма Тогда
 					ФормироватьСФ = Истина;
	 			Иначе
					ФормироватьСФ = Ложь;
				КонецЕсли; 
				//ФормироватьСФ = Ложь;
				//Бондаренко++ 20180904
 			КонецЕсли; 
		КонецЕсли; 
	Иначе
		Если ЗначениеЗаполнено(РеализацияОбъект.Организация) Тогда
			Если РеализацияОбъект.Организация.ОсвобожденОтНДС Тогда
				//Бондаренко-- 200180904
				Если РеализацияОбъект.Контрагент.НашаФирма Тогда
 					ФормироватьСФ = Истина;
	 			Иначе
					ФормироватьСФ = Ложь;
				КонецЕсли; 
				//ФормироватьСФ = Ложь;
				//Бондаренко++ 20180904
 			КонецЕсли; 
		КонецЕсли; 
		
 	КонецЕсли; 
 	
	Если ФормироватьСФ Тогда
		
		СчетФактураОбъект = Документы.СчетФактураВыданный.СоздатьДокумент();
		
		//Бондаренко++ 20190502
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданный.Ссылка
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.ДокументОснование = &ДокументОснование";
		
		Запрос.УстановитьПараметр("ДокументОснование", РеализацияОбъект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СчетФактураОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		КонецЦикла;
 		//Бондаренко-- 20190502
 		
		Если Не ФлагНашаФирма  Тогда
			СчетФактураОбъект.ОбработкаЗаполнения(РеализацияОбъект.Ссылка);
		Иначе
			СчетФактураОбъект.ОбработкаЗаполнения(Ссылка);
		КонецЕсли;	
		СчетФактураОбъект.СформированАвтоматически=Истина;
		
		
		ЕстьОшибки=Ложь;
		СчетФактураОбъект.УстановитьНовыйНомер();
		Попытка
			СчетФактураОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
 			#Если НаКлиенте Тогда
			Сообщить(ОписаниеОшибки());
			#КонецЕсли
			ЕстьОшибки=Истина;
 		КонецПопытки;	
		
		Если ЕстьОшибки Тогда
			#Если НаКлиенте Тогда
			Сообщить("ОШИБКА! СчетФактура выданный для перепродажи не сформирована.",СтатусСообщения.ОченьВажное);
			#КонецЕсли 
			Возврат ЕстьОшибки;
		КонецЕсли; 
		
		#Если НаКлиенте Тогда
		Сообщить("Сформирован документ: "+СчетФактураОбъект,СтатусСообщения.Информация);
		#КонецЕсли
		
		ТабДок = Новый ТабличныйДокумент;
		
		СчетФактураОбъект.ПечатьСчетФактура(ТабДок);
		ТабДок.АвтоМасштаб=Истина;
		ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
		ТабДок.ТолькоПросмотр=Истина;
		ТабДок.Показать();
		
	КонецЕсли; 
	
	
	ПоступлениеОбъект = Документы.ПоступлениеТоваров.СоздатьДокумент();
	//ПоступлениеОбъект.ОбработкаЗаполнения(РеализацияОбъект.Ссылка);
	
	ПоступлениеОбъект.Автор = ПараметрыСеанса.Пользователь;
	ПоступлениеОбъект.РегламентированныйУчет = Истина;
	ПоступлениеОбъект.Дата = ТекущаяДата();
	ПоступлениеОбъект.УстановитьНовыйНомер();
	ПоступлениеОбъект.ХозОперация = Справочники.ХозОперации.ПоступлениеТоваров;
	Если ФлагнашаФирма Тогда
		ПоступлениеОбъект.ДокументОснование = Ссылка;
	Иначе	
		ПоступлениеОбъект.ДокументОснование = РеализацияОбъект.Ссылка;
	КонецЕсли; 
	
	Если ФлагНашаФирма Тогда
	    ПоступлениеОбъект.СкладКомпании=ТоварыКПродаже[0].СкладОтправитель;
	Иначе	
		ПоступлениеОбъект.СкладКомпании = СкладКомпании;
	КонецЕсли; 

	
	Если ФлагНашаФирма Тогда
		ПоступлениеОбъект.Организация = ПоступлениеОбъект.СкладКомпании.Организация;
	Иначе	
		ПоступлениеОбъект.Организация = Организация;
	КонецЕсли;	
		
	ПоступлениеОбъект.ОбработкаРеквизита("Организация");
	
	Если ФлагНашаФирма Тогда
		ПоступлениеОбъект.ВхДокДата = Ссылка.Дата;
		ПоступлениеОбъект.ВхДокНомер = Ссылка.Номер;
 	Иначе	
		ПоступлениеОбъект.ВхДокДата = РеализацияОбъект.Дата;
		ПоступлениеОбъект.ВхДокНомер = РеализацияОбъект.Номер;
	КонецЕсли; 
	
	Если ФлагНашаФирма Тогда
 		ПоступлениеОбъект.ПодразделениеКомпании = ПоступлениеОбъект.СкладКомпании.Подразделение;
	Иначе
		ПоступлениеОбъект.ПодразделениеКомпании = ПодразделениеКомпании;
	КонецЕсли;	
	
	ПоступлениеОбъект.ОбработкаРеквизита("ПодразделениеКомпании");
  	 
	ПоступлениеОбъект.ОбработкаРеквизита("СкладКомпании");
	
	ПоступлениеОбъект.ТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенЗакупки;
	ПоступлениеОбъект.ОбработкаРеквизита("ТипЦен");
	
	ПоступлениеОбъект.КурсДокумента = 1;
	ПоступлениеОбъект.КурсВалютыВзаиморасчетов = 1;
	ПоступлениеОбъект.КурсВалютыУпр = 1;
	
	ПоступлениеОбъект.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	ПоступлениеОбъект.ОбработкаРеквизита("ВалютаДокумента");
	
	Если Контрагент.НашаФирма Тогда
		ПоступлениеОбъект.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН",ТоварыКПродаже[0].ИНН_Покупателя);
	Иначе	
		ПоступлениеОбъект.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН",ТоварыКПродаже[0].ИНН_Продавца);
	КонецЕсли; 
	 
	ПоступлениеОбъект.ОбработкаРеквизита("Контрагент");
	
	ПараметрыДоговора = Новый Структура;
	ПараметрыДоговора.Вставить("Контрагент",ПоступлениеОбъект.Контрагент);
	ПараметрыДоговора.Вставить("ВидДоговора",Перечисления.ВидыДоговоров.Покупка);
	ПараметрыДоговора.Вставить("Организация",ПоступлениеОбъект.Организация);
	ПараметрыДоговора.Вставить("Подразделение",ПоступлениеОбъект.ПодразделениеКомпании);
	
	ПоступлениеОбъект.ДоговорВзаиморасчетов = НайтиДоговор(ПараметрыДоговора);
	ПоступлениеОбъект.ОбработкаРеквизита("ДоговорВзаиморасчетов");	
	
	Если ФлагНашаФирма Тогда
		ПоступлениеОбъект.ВхДокДата  = Ссылка.Дата;
		ПоступлениеОбъект.ВхДокНомер = Ссылка.Номер;
	Иначе
 		ПоступлениеОбъект.ВхДокДата  = РеализацияОбъект.Дата;
		ПоступлениеОбъект.ВхДокНомер = РеализацияОбъект.Номер;
 	КонецЕсли; 
 	
	ПоступлениеОбъект.Автор = ПараметрыСеанса.Пользователь;
	ПоступлениеОбъект.Комментарий = "Создан автоматически "+ТекущаяДата()+" пользователем "+ПараметрыСеанса.Пользователь+" для перепродажи запасных частей между организациями";
	ПоступлениеОбъект.СформированАвтоматически=Истина;
	
	//ПоступлениеОбъект.Товары.Очистить();
	
	//Для Каждого стр из ТоварыКПродаже цикл 
	//	СтрокаРеализации = ПоступлениеОбъект.Товары.Добавить();
	//	СтрокаРеализации.Номенклатура = стр.Товар;
	//	
	//	СтрокаРеализации.Количество = стр.Количество;
	//	СтрокаРеализации.ЕдиницаИзмерения = стр.ЕдиницаИзмерения;
	//	
	//	ДопПараметры = Новый Структура;
	//	
	//	ДопПараметры.Вставить("НеКонтролироватьЗамены",Истина);
	//	ДопПараметры.Вставить("ПересчитатьЦену",Ложь);
	//	ПоступлениеОбъект.ОбработкаРеквизита("Товары.Номенклатура", СтрокаРеализации,, ДопПараметры);
	// 	
	//	ПоступлениеОбъект.ОбработкаРеквизита("Товары.ХарактеристикаНоменклатуры", СтрокаРеализации,, ДопПараметры);
	//	ПоступлениеОбъект.ОбработкаРеквизита("Товары.ЕдиницаИзмерения", СтрокаРеализации,, ДопПараметры);
	//	ПоступлениеОбъект.ОбработкаРеквизита("Товары.Количество", СтрокаРеализации,, ДопПараметры);
	//	ПоступлениеОбъект.ОбработкаРеквизита("Товары.Коэффициент", СтрокаРеализации,, ДопПараметры);
	//	//РеализацияОбъект.ОбработкаРеквизита("Товары.Сумма", СтрокаРеализации,, ДопПараметры);
	//КонецЦикла;
	
	Если ФлагНашаФирма Тогда
		ВремТЗ=Ссылка.Товары.Выгрузить();
	Иначе	
		ВремТЗ=РеализацияОбъект.Товары.Выгрузить();
	КонецЕсли; 
	
	//Бондаренко++ 20210809
	ЗаполнитьБазовоеКоличество = Ложь;
 	Если НЕ обЗначениеНеЗаполнено(СчетФактураОбъект) Тогда
 		ВремТЗ=СчетФактураОбъект.Товары.Выгрузить();
		ЗаполнитьБазовоеКоличество = Истина;
   	КонецЕсли; 
	//Бондаренко-- 20210809
 	
	ПоступлениеОбъект.Товары.Загрузить(ВремТЗ);
	
	//Бондаренко++ 20210809
 	Если ЗаполнитьБазовоеКоличество Тогда
		Для каждого Стр Из ПоступлениеОбъект.Товары Цикл
 			Стр.КоличествоБазовое = Стр.Количество * Стр.Коэффициент;
  		КонецЦикла; 
	КонецЕсли; 
	//Бондаренко-- 20210809
 	
	ЕстьОшибки=Ложь;
	
	Попытка
		ПоступлениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		#Если НаКлиенте Тогда
		Сообщить(ОписаниеОшибки());
		#КонецЕсли
		ЕстьОшибки=Истина;
	КонецПопытки;
	
	Если ЕстьОшибки Тогда
		#Если НаКлиенте Тогда
		Сообщить("ОШИБКА! Поступление товаров для перепродажи не сформирована.",СтатусСообщения.ОченьВажное);
		#КонецЕсли 
		Возврат ЕстьОшибки;
	КонецЕсли; 
	
	#Если НаКлиенте Тогда
	Сообщить("Сформирован документ: "+ПоступлениеОбъект,СтатусСообщения.Информация);
	#КонецЕсли

 ////   //Бондаренко++ 20210219
 ////   //==================================================================
 ////   ЗафиксироватьТранзакцию();
 ////   НачатьТранзакцию();

 ////   Если ПоступлениеОбъект.Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
 ////   	
 ////   	КорректировкаПоступленияОбъект = Документы.КорректировкаПоступления.СоздатьДокумент();
 ////   	
 ////   	//Бондаренко++ 20181003
 ////   	КорректировкаПоступленияОбъект.ДублиНоменклатурыДопустимы = Истина;
 ////   	//Бондаренко-- 20181003
 //// 		
 ////   	КорректировкаПоступленияОбъект.Автор = ПараметрыСеанса.Пользователь;
 ////   	КорректировкаПоступленияОбъект.РегламентированныйУчет = Истина;
 ////   	КорректировкаПоступленияОбъект.Дата = ТекущаяДата();
 ////   	КорректировкаПоступленияОбъект.УстановитьНовыйНомер();
 ////   	КорректировкаПоступленияОбъект.ХозОперация = Справочники.ХозОперации.КорректировкаПоступленияИсправлениеВПервичныхДокументах;
 ////		КорректировкаПоступленияОбъект.ДокументОснование = ПоступлениеОбъект.Ссылка;
 ////		
 ////		КорректировкаПоступленияОбъект.СкладКомпании=ПоступлениеОбъект.СкладКомпании;
 ////   	КорректировкаПоступленияОбъект.ОбработкаРеквизита("СкладКомпании");
 ////   	
 ////   	КорректировкаПоступленияОбъект.Организация = ПоступлениеОбъект.Организация;
 ////		КорректировкаПоступленияОбъект.ОбработкаРеквизита("Организация");
 ////   	
 //// 		КорректировкаПоступленияОбъект.ПодразделениеКомпании = ПоступлениеОбъект.ПодразделениеКомпании;
 ////		КорректировкаПоступленияОбъект.ОбработкаРеквизита("ПодразделениеКомпании");
 ////   	
 ////		
 ////   	КорректировкаПоступленияОбъект.КурсДокумента = 1;
 ////   	КорректировкаПоступленияОбъект.КурсВалютыВзаиморасчетов = 1;
 ////   	КорректировкаПоступленияОбъект.КурсВалютыУпр = 1;
 ////   	
 ////   	КорректировкаПоступленияОбъект.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
 ////   	КорректировкаПоступленияОбъект.ОбработкаРеквизита("ВалютаДокумента");
 ////   	
 ////		//КорректировкаПоступленияОбъект.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН",ТоварыКПродаже[0].ИНН_Продавца);
 ////   	КорректировкаПоступленияОбъект.Контрагент = ПоступлениеОбъект.Контрагент;
 ////		КорректировкаПоступленияОбъект.ОбработкаРеквизита("Контрагент");
 ////   	
 ////   	//ПараметрыДоговора = Новый Структура;
 ////   	//ПараметрыДоговора.Вставить("Контрагент",КорректировкаПоступленияОбъект.Контрагент);
 ////   	//ПараметрыДоговора.Вставить("ВидДоговора",Перечисления.ВидыДоговоров.Покупка);
 ////   	//ПараметрыДоговора.Вставить("Организация",КорректировкаПоступленияОбъект.Организация);
 ////   	//ПараметрыДоговора.Вставить("Подразделение",КорректировкаПоступленияОбъект.ПодразделениеКомпании);
 ////   	//
 ////   	//КорректировкаПоступленияОбъект.ДоговорВзаиморасчетов = НайтиДоговор(ПараметрыДоговора);
 ////   	КорректировкаПоступленияОбъект.ДоговорВзаиморасчетов = ПоступлениеОбъект.ДоговорВзаиморасчетов;
 ////   	КорректировкаПоступленияОбъект.ОбработкаРеквизита("ДоговорВзаиморасчетов");	
 ////   	
 ////		КорректировкаПоступленияОбъект.Автор = ПараметрыСеанса.Пользователь;
 ////   	КорректировкаПоступленияОбъект.ТипЦен=ПоступлениеОбъект.ТипЦен;
 ////   	КорректировкаПоступленияОбъект.Комментарий = "Создан автоматически "+ТекущаяДата()+" пользователем "+ПараметрыСеанса.Пользователь+" для перепродажи запасных частей между организациями";
 ////   	КорректировкаПоступленияОбъект.СформированАвтоматически=Истина;
 ////   	
 ////		ВремТЗ=РеализацияОбъект.Товары.Выгрузить();
 ////		
 ////   	КорректировкаПоступленияОбъект.Товары.Загрузить(ВремТЗ);
 ////   	
 ////   	НомСтр = 0;
 ////   	
 ////   	Для каждого Стр Из КорректировкаПоступленияОбъект.Товары Цикл
 ////   		
 ////   		Стр.КоличествоПоДокументуРеализации = Стр.Количество;
 ////   		Стр.КоличествоДоКорректировки       = Стр.Количество;
 ////   		
 ////   		Стр.КоэффициентПоДокументуРеализации = Стр.Коэффициент;
 ////   		Стр.КоэффициентПоДокументуРеализации = Стр.Коэффициент;
 ////   		
 ////   		Стр.ЕдиницаИзмеренияПоДокументуРеализации = Стр.ЕдиницаИзмерения;
 ////			
 ////   		Стр.СтавкаНДСПоДокументуРеализации = Стр.СтавкаНДС;
 ////			
 ////  			
 ////			Стр.СуммаВсегоДоКорректировки = Стр.СуммаВсего;
 //// 			Стр.СуммаВсегоПоДокументуРеализации = Стр.СуммаВсего;
 ////   		
 ////   		Отбор = Новый Структура();
 ////   		Отбор.Вставить("Номенклатура",Стр.Номенклатура);
 ////   		СтрокиСебест = ТЗ_Себест.НайтиСтроки(Отбор);
 ////   		
 ////   		//Бондаренко++ 20181004
 ////   		ЦенаСебест = ТЗ_Себест[НомСтр].СуммаУпр;
 ////   		Если ТЗ_Себест[НомСтр].Количество > 0 Тогда
 ////   			ЦенаСебест =ТЗ_Себест[НомСтр].СуммаУпр / ТЗ_Себест[НомСтр].Количество;
 ////   		КонецЕсли; 
 ////   		НомСтр = НомСтр + 1;

 ////   	//	ЦенаСебест = СтрокиСебест[0].СуммаУпр;
 ////   	//Если СтрокиСебест[0].Количество > 0 Тогда
 ////   	//		ЦенаСебест = СтрокиСебест[0].СуммаУпр / СтрокиСебест[0].Количество;
 ////   	//КонецЕсли; 
 ////   		
 ////   		Если СтрокиСебест.Количество() > 0 Тогда
 ////   			Стр.Сумма = ЦенаСебест*Стр.Количество;
 ////   			Стр.СуммаВсего =  ЦенаСебест*Стр.Количество;
 //// 			Иначе
 ////   			Стр.Сумма = 100*Стр.СуммаВсего/5;
 ////   			Стр.СуммаВсего = 100*Стр.СуммаВсего/5;
 ////   		КонецЕсли; 
 ////   		//Бондаренко++ 20181004 
 ////   		
 ////   		Стр.СуммаВсегоРазница = Стр.СуммаВсего-Стр.СуммаВсегоПоДокументуРеализации;
 ////   		
 ////   		Если Стр.Коэффициент>0 Тогда
 ////   			Если Стр.Количество>0 Тогда
 ////   				Стр.Цена = Стр.СуммаВсего/(Стр.Количество*Стр.Коэффициент);
 ////   			Иначе
 ////   				Стр.Цена = (100*Стр.СуммаВсего/5);	
 ////   			КонецЕсли; 
 ////   		Иначе
 ////   			Стр.Цена = (100*Стр.СуммаВсего/5);	
 ////   		КонецЕсли;
 ////   		
 //// 			Стр.СуммаНДСПоДокументуРеализации = Стр.СуммаНДС;
 ////   		Стр.СуммаНДСДоКорректировки =  Стр.СуммаНДС;
 ////   		Стр.СуммаНДС =  Стр.СуммаВсего*Стр.СтавкаНДС.Ставка/(100+Стр.СтавкаНДС.Ставка);
 ////			
 ////		КонецЦикла; 
 ////   	
 ////   	//Форма = КорректировкаПоступленияОбъект.ПолучитьФорму("ФормаДокумента");
 ////   	//Если НЕ Форма.Открыта() Тогда
 ////   	//	Форма.ОткрытьМодально();
 ////   	//КонецЕсли;
 ////   	
 ////   	ЕстьОшибки=Ложь;
 ////   	
 ////   	Попытка
 ////   		КорректировкаПоступленияОбъект.Записать(РежимЗаписиДокумента.Запись);
 ////   	Исключение
 ////   		#Если НаКлиенте Тогда
 ////   			Сообщить(ОписаниеОшибки());
 ////   		#КонецЕсли
 ////   		ЕстьОшибки=Истина;
 ////   	КонецПопытки;
 ////		
 ////   	Попытка
 ////   		КорректировкаПоступленияОбъект.Записать(РежимЗаписиДокумента.Проведение);
 ////   	Исключение
 ////   		#Если НаКлиенте Тогда
 ////   			Сообщить(ОписаниеОшибки());
 ////   		#КонецЕсли
 ////   		ЕстьОшибки=Истина;
 ////   	КонецПопытки;
 ////   	
 ////   	Если ЕстьОшибки Тогда
 ////   		#Если НаКлиенте Тогда
 ////   			Сообщить("ОШИБКА! Корректировка поступления товаров для перепродажи не сформирована.",СтатусСообщения.ОченьВажное);
 ////   		#КонецЕсли 
 ////   		
 ////   		Попытка
 ////   			ПоступлениеОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
 ////   		Исключение
 ////   			Сообщить(ОписаниеОшибки());
 ////   			ЕстьОшибки=Истина;
 ////   		КонецПопытки;
 ////   		
 ////   		Попытка
 ////   			РеализацияОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
 ////   		Исключение
 ////   			Сообщить(ОписаниеОшибки());
 ////   			ЕстьОшибки=Истина;
 ////   		КонецПопытки;
 ////   		
 ////   		Попытка
 ////   			СчетФактураОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
 ////   		Исключение
 ////   			Сообщить(ОписаниеОшибки());
 ////   			ЕстьОшибки=Истина;
 ////   		КонецПопытки;
 ////
 ////   	 	Возврат ЕстьОшибки;
 ////   	КонецЕсли; 
 ////   	
 ////   	#Если НаКлиенте Тогда
 ////   		Сообщить("Сформирован документ: "+КорректировкаПоступленияОбъект,СтатусСообщения.Информация);
 ////   	#КонецЕсли
 ////   	
 ////   КонецЕсли; 
 ////   //==================================================================
 ////   //Бондаренко-- 20210219	

  
 	Если НЕ ФормироватьСФ Тогда
		Возврат ЕстьОшибки;
		// Если не было счет-фактуры выданной, то счет-фактуры полученнной также быть не должно;
	КонецЕсли;	
	
	//ФормироватьСФполуч = Истина;
	//
	//  Если ЗначениеЗаполнено(РеализацияОбъект.Организация) Тогда
	//	Если ПоступлениеОбъект.Организация.ОсвобожденОтНДС Тогда
	//		ФормироватьСФполуч = Ложь;
	//  	КонецЕсли; 
	//КонецЕсли; 
	
	Если ФормироватьСФ Тогда
		
		СчетФактураПолученныйОбъект = Документы.СчетФактураПолученный.СоздатьДокумент();
		СчетФактураПолученныйОбъект.ОбработкаЗаполнения(ПоступлениеОбъект.Ссылка);
		СчетФактураПолученныйОбъект.СформированАвтоматически=Истина;
		
		ЕстьОшибки=Ложь;
		Попытка
			СчетФактураПолученныйОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			#Если НаКлиенте Тогда
			Сообщить(ОписаниеОшибки());
			#КонецЕсли 
			ЕстьОшибки=Истина;
		КонецПопытки;	
		
		Если ЕстьОшибки Тогда
			#Если НаКлиенте Тогда
			Сообщить("ОШИБКА! СчетФактура полученный для перепродажи не сформирована.",СтатусСообщения.ОченьВажное);
			#КонецЕсли 
			Возврат ЕстьОшибки;
		КонецЕсли; 
		
		#Если НаКлиенте Тогда
		Сообщить("Сформирован документ: "+СчетФактураПолученныйОбъект,СтатусСообщения.Информация);
		#КонецЕсли  
		
	КонецЕсли;
	
 	
	Возврат ЕстьОшибки;
	
КонецФункции

Процедура СформироватьПерепродажу(ВопросОПеремещении=Истина,ВозврЗначение,СписокОчищаемыхСкладов,ФлагНашаФирма) Экспорт
	
	Если ВопросОПеремещении Тогда
		#Если НаКлиенте Тогда
		Если Вопрос("Сформировать перепродажу между юридическими лицами компании?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
		#КонецЕсли
	КонецЕсли;
	
	//Бондаренко++ 20170412
	СЗ_СкладыОтправители = Новый СписокЗначений; 
	
 	Для Каждого стр из Товары цикл
		Если обЗначениеНеЗаполнено(стр.СкладКомпании) Тогда
			Продолжить;
		КонецЕсли;
		Если СЗ_СкладыОтправители.НайтиПоЗначению(стр.СкладКомпании.Ссылка)=Неопределено Тогда
			СЗ_СкладыОтправители.Добавить(стр.СкладКомпании.Ссылка);
		КонецЕсли; 
	КонецЦикла;	
 	//Бондаренко-- 20170412
	
	Для каждого ТекСклад Из СЗ_СкладыОтправители Цикл
		
		ТоварыКПродаже = Новый ТаблицаЗначений;
		ТоварыКПродаже.Колонки.Добавить("Товар");
		ТоварыКПродаже.Колонки.Добавить("Количество");
		ТоварыКПродаже.Колонки.Добавить("ЗН");
		ТоварыКПродаже.Колонки.Добавить("ЕдиницаИзмерения");
		ТоварыКПродаже.Колонки.Добавить("ОрганизацияПоставщик");
		ТоварыКПродаже.Колонки.Добавить("ПодразделениеПоставщик");
		ТоварыКПродаже.Колонки.Добавить("СкладОтправитель");
		ТоварыКПродаже.Колонки.Добавить("ИНН_Покупателя");
		ТоварыКПродаже.Колонки.Добавить("ИНН_Продавца");
		ТоварыКПродаже.Колонки.Добавить("ИдентификаторТовара");
		
		Для Каждого стр из Товары цикл
			
 			Если обЗначениеНеЗаполнено(стр.СкладКомпании) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Стр.СкладКомпании.Ссылка <> ТекСклад.Значение Тогда
				Продолжить;
			КонецЕсли; 
 			
			СтрокаТоварыКПродаже = ТоварыКПродаже.Добавить();
			
			СтрокаТоварыКПродаже.Товар = стр.Номенклатура;
			СтрокаТоварыКПродаже.Количество = стр.Количество;
			СтрокаТоварыКПродаже.ЗН = Ссылка.Ссылка;
			СтрокаТоварыКПродаже.ЕдиницаИзмерения = стр.ЕдиницаИзмерения;
			
 			СтрокаТоварыКПродаже.ОрганизацияПоставщик   = стр.СкладКомпании.Организация;
			СтрокаТоварыКПродаже.ПодразделениеПоставщик = стр.СкладКомпании.Подразделение;
			СтрокаТоварыКПродаже.СкладОтправитель       = стр.СкладКомпании.Ссылка;
			СтрокаТоварыКПродаже.ИНН_Продавца           = стр.СкладКомпании.Организация.ИНН; 
 			
  			СтрокаТоварыКПродаже.ИНН_Покупателя = Ссылка.Организация.ИНН;
			
			//Бондаренко++ 20210218
			СтрокаТоварыКПродаже.ИдентификаторТовара = стр.ИдентификаторТовара;
 			//Бондаренко-- 20210218
 
		КонецЦикла;	
		
		//Бондаренко++ 20181229
		//=====================================================
		//Откорректируем таблицу товаров на количество, уже проданного.
		//Защита от повторных нажатий при частичных (не до конца сформированных) пакетах перепродаж
		
		Запрос = Новый Запрос;
		
		СЗ_Товары = Новый СписокЗначений;
		
		СЗ_Товары.ЗагрузитьЗначения(ТоварыКПродаже.ВыгрузитьКолонку("Товар"));
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	РеализацияТоваровТовары.Ссылка КАК Реализация,
		               |	РеализацияТоваровТовары.Ссылка.ДокументОснование КАК ДокументОснованиеРеализации,
		               |	РеализацияТоваровТовары.Номенклатура КАК Товар,
		               |	СУММА(РеализацияТоваровТовары.КоличествоБазовое) КАК Количество,
		               |	РеализацияТоваровТовары.Ссылка.СкладКомпании КАК СкладОтправитель
		               |ИЗ
		               |	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
		               |ГДЕ
		               |	РеализацияТоваровТовары.Ссылка.ДокументОснование = &ДокументОснование
		               |	И РеализацияТоваровТовары.Ссылка ССЫЛКА Документ.РеализацияТоваров
		               |	И РеализацияТоваровТовары.Ссылка.СкладКомпании В (&СЗ_СкладыОтправители)
		               |	И РеализацияТоваровТовары.Номенклатура В (&Сз_Номенклатура)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РеализацияТоваровТовары.Ссылка.СкладКомпании,
		               |	РеализацияТоваровТовары.Номенклатура,
		               |	РеализацияТоваровТовары.Ссылка,
		               |	РеализацияТоваровТовары.Ссылка.ДокументОснование";
		
		Запрос.УстановитьПараметр("ДокументОснование",Ссылка);
		Запрос.УстановитьПараметр("СЗ_СкладыОтправители",СЗ_СкладыОтправители);
		Запрос.УстановитьПараметр("Сз_Номенклатура",СЗ_Товары);
				
		ТЗ_УжеПродано = Запрос.Выполнить().Выгрузить();
		Если РольДоступна("ПолныеПрава") Тогда
			ТЗ_УжеПродано.ВыбратьСтроку("Товары уже продано");
		КонецЕсли; 
		
		Если РольДоступна("ПолныеПрава") Тогда
			ТоварыКПродаже.ВыбратьСтроку("Товары к продаже ДО корректировки");
		КонецЕсли; 
 	
		Для каждого Стр Из ТоварыКПродаже Цикл
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Товар",Стр.Товар);
			ПараметрыОтбора.Вставить("СкладОтправитель",Стр.СкладОтправитель);
			СтрокиКорректировки = ТЗ_УжеПродано.НайтиСтроки(ПараметрыОтбора);
			Если СтрокиКорректировки.Количество()>0  Тогда
				Стр.Количество = Число(Стр.Количество) - Число(СтрокиКорректировки[0].Количество);
 			КонецЕсли; 
  		КонецЦикла; 
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Количество",0);
		СтрокиКорректировки = ТоварыКПродаже.НайтиСтроки(ПараметрыОтбора);
		Для каждого СтрокаУдаления Из СтрокиКорректировки Цикл
      		ТоварыКПродаже.Удалить(СтрокаУдаления);
		КонецЦикла;
 		//=====================================================
		//Бондаренко-- 20181229
 		
		Если РольДоступна("ПолныеПрава") Тогда
			ТоварыКПродаже.ВыбратьСтроку("Товары к продаже ПОСЛЕ корректировки");
		КонецЕсли; 
		
		//Бондаренко++ 20210218
		ТаблицаКодовМаркировки = Новый ТаблицаЗначений;
		ТаблицаКодовМаркировки.Колонки.Добавить("ИдентификаторТовара");
		ТаблицаКодовМаркировки.Колонки.Добавить("КодМаркировки");
		
		//ЕстьКодыМаркировки=Ложь;
		//Для Каждого стр из КодыМаркировки цикл
		//	СтрокаКодов = ТаблицаКодовМаркировки.Добавить();
		//	СтрокаКодов.ИдентификаторТовара = стр.ИдентификаторТовара;
		//	СтрокаКодов.КодМаркировки = стр.КодМаркировки;
		//	ЕстьКодыМаркировки=Истина;
		//КонецЦикла;
		//ТаблицаКодовМаркировки.ВыбратьСтроку();
		//Бондаренко-- 20210218
  		
		БылиОшибки = Истина;  
		
		Если ТоварыКПродаже.Количество() > 0 тогда
			НачатьТранзакцию();
			
			//Бондаренко++ 20210218
			БылиОшибки = СоздатьДокументыПерепродажиПоЮрЛицам(ТоварыКПродаже,ФлагНашаФирма);
			
 //   		СкладСтрокиТаблицы = ТекСклад.Значение;
 //   		Сообщить("Обрабатывается склад = "+ТекСклад.Значение);
 //   		Отбор = Новый Структура("СкладОтправитель", ТекСклад.Значение);
 //   		ТЗ_ПоСкладу = ТоварыКПродаже.Скопировать(Отбор);
 //
 //			ТЗ_КодовМаркировки=ТаблицаКодовМаркировки.Скопировать();
 //   		ТЗ_КодовМаркировки.Очистить();
 //			Если ЕстьКодыМаркировки Тогда
 //   			СЗ_ИдентификаторовТовара = Новый СписокЗначений;
 //   			СЗ_ИдентификаторовТовара.ЗагрузитьЗначения(ТЗ_ПоСкладу.ВыгрузитьКолонку("ИдентификаторТовара"));
 //				Для каждого Стр Из ТаблицаКодовМаркировки Цикл
 //   				Если СЗ_ИдентификаторовТовара.НайтиПоЗначению(Стр.ИдентификаторТовара)=Неопределено Тогда
 //   					Продолжить;
 //					КонецЕсли; 
 //   				НовСтрока = ТЗ_КодовМаркировки.Добавить();					
 //   				НовСтрока.ИдентификаторТовара = Стр.ИдентификаторТовара;
 //   				НовСтрока.КодМаркировки = Стр.КодМаркировки;
 //   			КонецЦикла; 
 //			КонецЕсли;  
 //
 //   		БылиОшибки = СМ_ПерепродажиЗапчастей.СоздатьДокументыПерепродажиПоЮрЛицамОбщийМодуль(ТЗ_ПоСкладу,ТЗ_КодовМаркировки,Ссылка,СкладКомпании);
			//Бондаренко-- 20210218
			ЗафиксироватьТранзакцию();
			//Бондаренко++ 20181229	
		Иначе
			#Если НаКлиенте Тогда
				Сообщить("Все товары уже перепроданы.",СтатусСообщения.ОченьВажное);
			#КонецЕсли 
			БылиОшибки = Ложь; 
			//Бондаренко-- 20181229	
		КонецЕсли; 
		
		Если БылиОшибки Тогда
			#Если НаКлиенте Тогда
			Сообщить("Обработка по перепродаже завершена С ошибками",СтатусСообщения.ОченьВажное);
			#КонецЕсли 
			ВозврЗначение=Ложь;
		Иначе	
			#Если НаКлиенте Тогда
			Сообщить("Обработка по перепродаже завершена БЕЗ ошибок.",СтатусСообщения.Обычное);	
			#КонецЕсли 
			СписокОчищаемыхСкладов.Добавить(ТекСклад.Значение);
			ВозврЗначение=Истина;
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры	
//Бондаренко-- 20170320  

Функция НайтиСоздатьДокументыПеремешенияИПерепродажОдногоДЦмодуль(ТЗ_Перемещений,ТЗ_Реализаций) Экспорт
	
	СЗ_CкладовОтправителей = Новый СписокЗначений;
	
	Для каждого Стр Из ТЗ_Перемещений Цикл
	    Если СЗ_CкладовОтправителей.НайтиПоЗначению(Стр.СкладОтправитель)<>Неопределено Тогда
			Продолжить;
 		КонецЕсли; 
 	    СЗ_CкладовОтправителей.Добавить(Стр.СкладОтправитель);
	КонецЦикла; 
	
	//СЗ_CкладовОтправителей.ЗагрузитьЗначения(ТЗ_Перемещений.ВыгрузитьКолонку("СкладОтправитель"));
	
	//Создан = Истина;
	
	Для каждого ТекСкладОтправитель Из СЗ_CкладовОтправителей Цикл
		#Если Клиент Тогда
			//Сообщить("Обрабатывается склад: "+ТекСкладОтправитель);		 	
 		#КонецЕсли
 		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеТоваров.Ссылка КАК ПеремещениеТоваров,
		|	ПеремещениеТоваров.ДокументОснование,
		|	ПеремещениеТоваров.ПометкаУдаления,
		|	ПеремещениеТоваров.СкладКомпании КАК СкладКомпании,
		|	ПеремещениеТоваров.СкладПолучатель КАК СкладПолучатель
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|ГДЕ
		|	ПеремещениеТоваров.ДокументОснование = &ДокументОснование
		|	И ПеремещениеТоваров.ПометкаУдаления = ЛОЖЬ
		|	И ПеремещениеТоваров.СкладКомпании = &СкладКомпании
		|	И ПеремещениеТоваров.СкладПолучатель = &СкладПолучатель";
		
		Запрос.УстановитьПараметр("ДокументОснование",Ссылка);
		Запрос.УстановитьПараметр("СкладКомпании",ТекСкладОтправитель.Значение);
		Запрос.УстановитьПараметр("СкладПолучатель",Ссылка.СкладКомпании);
		
		ТаблицаПеремещений = Запрос.Выполнить().Выгрузить();
		
		Если ТаблицаПеремещений.Количество() = 0 Тогда
			ДокСсылка = Документы.ПеремещениеТоваров.СоздатьДокумент();
		Иначе	
			ДокСсылка = ТаблицаПеремещений[0].ПеремещениеТоваров.Ссылка.ПолучитьОбъект();
		КонецЕсли; 
		
		//ДокСсылка = Документы.ПеремещениеТоваров.СоздатьДокумент();
		
		Если ДокСсылка.Товары.Количество()>0  Тогда
			ДокСсылка.Товары.Очистить();
		КонецЕсли; 
		
		ДокСсылка.Автор = ПараметрыСеанса.Пользователь;
		ДокСсылка.ВалютаДокумента=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		ДокСсылка.Дата = ТекущаяДата();
		ДокСсылка.ДатаОперации = ТекущаяДата();
		ДокСсылка.ДатаСоздания = ТекущаяДата();
		ДокСсылка.ДокументОснование = Ссылка;
		ДокСсылка.Комментарий = "Сформирован "+Формат(ТекущаяДата(),"ДЛФ=DDT")+" пользователем: "+ПараметрыСеанса.Пользователь;
		
		ДокСсылка.СкладКомпании = ТекСкладОтправитель.Значение;
		ДокСсылка.Организация = Ссылка.СкладКомпании.Организация;
		ДокСсылка.ПодразделениеКомпании = Ссылка.СкладКомпании.Подразделение;
		
		ДокСсылка.СкладПолучатель=Ссылка.СкладКомпании;
 		
  		ДокСсылка.КурсВалютыУпр=1;
		ДокСсылка.КурсДокумента=1;
		ДокСсылка.ТипЦен=Справочники.ТипыЦен.ОсновнойТипЦенЗакупки;
		ДокСсылка.ХозОперация=Справочники.ХозОперации.ПеремещениеТоваров;
		ДокСсылка.СформированАвтоматически=Ложь;
		
		ТекСотр = ПараметрыСеанса.Пользователь.Сотрудник;
		ДокСсылка.ОтпустилСот = ТекСотр;
		ДокСсылка.ПолучилСот = ТекСотр;
		ДокСсылка.Перевозчик = ТекСотр;
		
		Для каждого СтрокаТовара Из ТЗ_перемещений Цикл
			НовСтрокаПеремещения = ДокСсылка.Товары.Добавить();
			НовСтрокаПеремещения.Номенклатура = СтрокаТовара.Номенклатура;
			НовСтрокаПеремещения.КоличествоПолучено = СтрокаТовара.Кол;
			НовСтрокаПеремещения.КоличествоБазовое = СтрокаТовара.Кол;
			НовСтрокаПеремещения.Количество = СтрокаТовара.Кол;
			НовСтрокаПеремещения.СуммаВсего = СтрокаТовара.СуммаВсего;
			НовСтрокаПеремещения.Коэффициент = 1;
			Если НовСтрокаПеремещения.Количество <> 0 Тогда
				НовСтрокаПеремещения.Цена = НовСтрокаПеремещения.СуммаВсего / НовСтрокаПеремещения.Количество;
			КонецЕсли; 
			НовСтрокаПеремещения.ЕдиницаИзмерения = СтрокаТовара.ОсновнаяЕдиницаИзмерения;
			
			НовСтрокаПеремещения.СтавкаНДС=Справочники.СтавкиНДС.БезНДС;
			//Бондаренко++ 20190409
			ОтборСклад = Новый Структура();
			ОтборСклад.Вставить("СкладКомпании",ДокСсылка.СкладКомпании);
			НайдСтроки = НовСтрокаПеремещения.Номенклатура.ЯчейкиХранения.НайтиСтроки(ОтборСклад);
			Попытка
				НовСтрокаПеремещения.ЯчейкаОтправитель = НайдСтроки[0].ЯчейкаХранения; 	
			Исключение
				//		
			КонецПопытки; 
			//Бондаренко-- 20190409
		КонецЦикла; 	
		
		//Создан = Истина;
		
		Попытка
			ДокСсылка.Записать(РежимЗаписиДокумента.Проведение);
			#Если Клиент Тогда
			Сообщить("Документ проведён "+ДокСсылка,СтатусСообщения.ОченьВажное);
			#КонецЕсли
		Исключение
			Попытка
				ДокСсылка.Записать(РежимЗаписиДокумента.Запись);
				#Если Клиент Тогда
				Сообщить("Документ записан "+ДокСсылка,СтатусСообщения.ОченьВажное);
				#КонецЕсли
			Исключение		
				Отказ = Истина;
				Возврат Ложь;	
			КонецПопытки;
		КонецПопытки;	
		
		//Если Не Создан Тогда
		//	Форма = ДокСсылка.ПолучитьФорму("ФормаДокумента");
		//	Форма.ОткрытьМодально();
		//	Прервать;
		//КонецЕсли;
	КонецЦикла; 
	
	//============================= Перепродажи ==============================
	
	СЗ_CкладовОтправителей = Новый СписокЗначений;
	
	Для каждого Стр Из ТЗ_Реализаций Цикл
		Если СЗ_CкладовОтправителей.НайтиПоЗначению(Стр.СкладОтправитель)<>Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		СЗ_CкладовОтправителей.Добавить(Стр.СкладОтправитель);
	КонецЦикла;
	
	Для каждого ТекСкладОтправитель Из СЗ_CкладовОтправителей Цикл
		#Если Клиент Тогда
			//Сообщить("Обрабатывается склад: "+ТекСкладОтправитель);		 	
		#КонецЕсли
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваров.Ссылка КАК РеализацияТоваров,
		|	РеализацияТоваров.ДокументОснование,
		|	РеализацияТоваров.ПометкаУдаления,
		|	РеализацияТоваров.СкладКомпании
		|ИЗ
		|	Документ.РеализацияТоваров КАК РеализацияТоваров
		|ГДЕ
		|	РеализацияТоваров.ДокументОснование = &ДокументОснование
		|	И РеализацияТоваров.ПометкаУдаления = ЛОЖЬ
		|	И РеализацияТоваров.СкладКомпании = &СкладКомпании";
		
		Запрос.УстановитьПараметр("ДокументОснование",Ссылка);
		Запрос.УстановитьПараметр("СкладКомпании",ТекСкладОтправитель.Значение);
		Запрос.УстановитьПараметр("СкладПолучатель",Ссылка.СкладКомпании);
		
		ТаблицаРеализаций = Запрос.Выполнить().Выгрузить();
		
		Если ТаблицаРеализаций.Количество() = 0 Тогда
			ДокСсылка = Документы.РеализацияТоваров.СоздатьДокумент();
		Иначе	
			ДокСсылка = ТаблицаРеализаций[0].РеализацияТоваров.Ссылка.ПолучитьОбъект();
		КонецЕсли; 
		
		//ДокСсылка = Документы.ПеремещениеТоваров.СоздатьДокумент();
		
		Если ДокСсылка.Товары.Количество()>0  Тогда
			ДокСсылка.Товары.Очистить();
		КонецЕсли; 
		
		ДокСсылка.Автор = ПараметрыСеанса.Пользователь;
		ДокСсылка.ВалютаДокумента=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		ДокСсылка.Дата = ТекущаяДата();
		//ДокСсылка.ДатаОперации = ТекущаяДата();
		//ДокСсылка.ДатаСоздания = ТекущаяДата();
		ДокСсылка.ДокументОснование = Ссылка;
		ДокСсылка.Комментарий = "Сформирован "+Формат(ТекущаяДата(),"ДЛФ=DDT")+" пользователем: "+ПараметрыСеанса.Пользователь;
		
		ДокСсылка.СкладКомпании = ТекСкладОтправитель.Значение;
		ДокСсылка.Организация = ТекСкладОтправитель.Значение.Организация;
		ДокСсылка.ПодразделениеКомпании = ТекСкладОтправитель.Значение.Подразделение;
 		ДокСсылка.Контрагент = Ссылка.СкладКомпании.Организация.КонтрагентОрганизации;
		
		ПараметрыДоговора = Новый Структура;
		ПараметрыДоговора.Вставить("Контрагент",ДокСсылка.Контрагент);
		ПараметрыДоговора.Вставить("ВидДоговора",Перечисления.ВидыДоговоров.Продажа);
		ПараметрыДоговора.Вставить("Организация",ДокСсылка.Организация);
		ПараметрыДоговора.Вставить("Подразделение",ДокСсылка.ПодразделениеКомпании);
  		ДокСсылка.ДоговорВзаиморасчетов = НайтиДоговор(ПараметрыДоговора);
  		
		ДокСсылка.КурсВалютыУпр=1;
		ДокСсылка.КурсДокумента=1;
		ДокСсылка.ТипЦен=Справочники.ТипыЦен.ОсновнойТипЦенЗакупки;
		ДокСсылка.ХозОперация=Справочники.ХозОперации.РеализацияТоваров;
		ДокСсылка.СформированАвтоматически=Ложь;
		
		Для каждого СтрокаТовара Из ТЗ_реализаций Цикл
			Если СтрокаТовара.СкладОтправитель <> ТекСкладОтправитель.Значение Тогда
				Продолжить;
 			КонецЕсли;
			НовСтрокаРеализации = ДокСсылка.Товары.Добавить();
			НовСтрокаРеализации.Номенклатура = СтрокаТовара.Номенклатура;
			НовСтрокаРеализации.КоличествоБазовое = СтрокаТовара.Кол;
			НовСтрокаРеализации.Количество = СтрокаТовара.Кол;
			НовСтрокаРеализации.СуммаВсего = СтрокаТовара.СуммаВсего;
			НовСтрокаРеализации.Сумма = СтрокаТовара.СуммаВсего;
			НовСтрокаРеализации.Коэффициент = 1;
			Если НовСтрокаРеализации.Количество <> 0 Тогда
				НовСтрокаРеализации.Цена = НовСтрокаРеализации.СуммаВсего / НовСтрокаРеализации.Количество;
			КонецЕсли; 
			НовСтрокаРеализации.ЕдиницаИзмерения = СтрокаТовара.ОсновнаяЕдиницаИзмерения;
			
			НовСтрокаРеализации.СтавкаНДС=Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
 			Попытка
				НовСтрокаРеализации.Ячейка = НовСтрокаРеализации.Номенклатура.ПолучитьОбъект().ПолучитьЯчейкуХранения(Ссылка.СкладКомпании); 	
			Исключение
				//		
			КонецПопытки; 
			ОбработкаРеквизита("Товары.СуммаВсего", НовСтрокаРеализации);
			 
		КонецЦикла;  //По строкам
		
		Если ДокСсылка.Проведен Тогда
			ДокСсылка.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			ДокСсылка.ПересчитатьПоСебестоимости("");
 		КонецЕсли; 
 		
		Попытка
 			ДокСсылка.Записать(РежимЗаписиДокумента.Запись);
			#Если Клиент Тогда
				Сообщить("Документ записан "+ДокСсылка,СтатусСообщения.ОченьВажное);
			#КонецЕсли
		Исключение		
			Отказ = Истина;
			Если обПраво("ДоступКЗначимымОбработкам") Тогда
				Форма = ДокСсылка.ПолучитьФорму("ФормаДокумента");
				Форма.ОткрытьМодально();
			КонецЕсли; 
			Возврат Ложь;	
		КонецПопытки;
		
		Если Не ДокСсылка.Проведен Тогда
 	 		Попытка
				ДокСсылка.Записать(РежимЗаписиДокумента.Проведение);
				#Если Клиент Тогда
					Сообщить("Документ проведён "+ДокСсылка,СтатусСообщения.ОченьВажное);
				#КонецЕсли
			Исключение
				Отказ = Истина;
				Если обПраво("ДоступКЗначимымОбработкам") Тогда
					Форма = ДокСсылка.ПолучитьФорму("ФормаДокумента");
					Форма.ОткрытьМодально();
				КонецЕсли; 
				Возврат Ложь;	
	 		КонецПопытки;
		КонецЕсли; 
		
		//============================ СчетФактураВыданный ====================================
		Запрос = Новый Запрос;
			
		Запрос.Текст = 	"ВЫБРАТЬ
		               	|	СчетФактураВыданный.Ссылка КАК СчетФактураВыданный,
		               	|	СчетФактураВыданный.ДокументОснование
		               	|ИЗ
		               	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		               	|ГДЕ
		               	|	СчетФактураВыданный.ДокументОснование = &ДокументОснование
		               	|	И СчетФактураВыданный.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("ДокументОснование",ДокСсылка.Ссылка);
 		
		ТаблицаСФ = Запрос.Выполнить().Выгрузить();
		
		Если ТаблицаСФ.Количество() = 0 Тогда
			ДокСФвыданный = Документы.СчетФактураВыданный.СоздатьДокумент();
		Иначе	
			ДокСФвыданный = ТаблицаСФ[0].СчетФактураВыданный.Ссылка.ПолучитьОбъект();
		КонецЕсли; 
		
		ДокСФвыданный.ОбработкаЗаполнения(ДокСсылка.Ссылка);
		
		Попытка
			ДокСФвыданный.Записать(РежимЗаписиДокумента.Проведение);
 		Исключение
			Отказ = Истина;
			Если обПраво("ДоступКЗначимымОбработкам") Тогда
				Форма = ДокСФвыданный.ПолучитьФорму("ФормаДокумента");
				Форма.ОткрытьМодально();
			КонецЕсли; 
			Возврат Ложь;	
		КонецПопытки;
 		//============================ Конец СчетФактураВыданный ====================================
		
		//============================ ПоступлениеТоваров ====================================
		Запрос = Новый Запрос;
			
		Запрос.Текст = 	"ВЫБРАТЬ
		               	|	ПоступлениеТоваров.Ссылка КАК ПоступлениеТоваров,
		               	|	ПоступлениеТоваров.ДокументОснование
		               	|ИЗ
		               	|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
		               	|ГДЕ
		               	|	ПоступлениеТоваров.ДокументОснование = &ДокументОснование
		               	|	И ПоступлениеТоваров.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("ДокументОснование",ДокСсылка.Ссылка);
 		
		ТаблицаПоступлений = Запрос.Выполнить().Выгрузить();
		
		Если ТаблицаПоступлений.Количество() = 0 Тогда
			ДокПоступлений = Документы.ПоступлениеТоваров.СоздатьДокумент();
		Иначе	
			ДокПоступлений = ТаблицаПоступлений[0].ПоступлениеТоваров.ПолучитьОбъект();
		КонецЕсли; 
		
		ДокПоступлений.ОбработкаЗаполнения(ДокСсылка.Ссылка);
		
		ДокПоступлений.Контрагент = ДокСсылка.Организация.КонтрагентОрганизации;
		ДокПоступлений.СкладКомпании = Ссылка.СкладКомпании;
		ДокПоступлений.Организация = Ссылка.СкладКомпании.Подразделение.Организация;
		ДокПоступлений.ПодразделениеКомпании = Ссылка.СкладКомпании.Подразделение;
		
		ПараметрыДоговора = Новый Структура;
		ПараметрыДоговора.Вставить("Контрагент",ДокПоступлений.Контрагент);
		ПараметрыДоговора.Вставить("ВидДоговора",Перечисления.ВидыДоговоров.Покупка);
		ПараметрыДоговора.Вставить("Организация",ДокПоступлений.Организация);
		//Бондаренко++ 20200413
		ПараметрыДоговора.Вставить("Подразделение",ДокПоступлений.ПодразделениеКомпании);
		//Бондаренко-- 20200413
  		ДокПоступлений.ДоговорВзаиморасчетов = НайтиДоговор(ПараметрыДоговора);
		
		ДокПоступлений.УстановитьНовыйНомер();
		
		Если ДокПоступлений.Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
			Для каждого Стр Из ДокПоступлений.Товары Цикл
				Стр.Сумма = Стр.Сумма/20;
				Стр.СуммаВсего = Стр.СуммаВсего/20;
				Стр.Цена = Стр.Цена/20;
				Стр.СуммаНДС = Стр.СуммаНДС/20;
 			КонецЦикла; 
 		КонецЕсли; 
		 
 		Попытка
			ДокПоступлений.Записать(РежимЗаписиДокумента.Проведение);
 		Исключение
			Отказ = Истина;
			Если обПраво("ДоступКЗначимымОбработкам") Тогда
				Форма = ДокПоступлений.ПолучитьФорму("ФормаДокумента");
				Форма.ОткрытьМодально();
			КонецЕсли; 
			Возврат Ложь;	
		КонецПопытки;
 		//============================ Конец ПоступлениеТоваров =================================
		
		//////Бондаренко++ 20210219
		//////============================ Корректировка поступления ================================
		////Если ДокПоступлений.Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
		////	
		////	Запрос = Новый Запрос;
		////	
		////	Запрос.Текст = 	"ВЫБРАТЬ
		////	               	|	КорректировкаПоступленияТоваров.Ссылка КАК КорректировкаПоступления,
		////	               	|	КорректировкаПоступленияТоваров.ДокументОснование
		////	               	|ИЗ
		////	               	|	Документ.КорректировкаПоступления КАК КорректировкаПоступленияТоваров
		////	               	|ГДЕ
		////	               	|	КорректировкаПоступленияТоваров.ДокументОснование = &ДокументОснование
		////	               	|	И КорректировкаПоступленияТоваров.ПометкаУдаления = ЛОЖЬ";
		////	
		////	Запрос.УстановитьПараметр("ДокументОснование",ДокПоступлений.Ссылка);
		////	
		////	ТаблицаКорректировокПоступления = Запрос.Выполнить().Выгрузить();
		////	
		////	Если ТаблицаКорректировокПоступления.Количество() = 0 Тогда
		////		ДокКорректировкаПоступления = Документы.КорректировкаПоступления.СоздатьДокумент();
		////	Иначе	
		////		ДокКорректировкаПоступления = ТаблицаКорректировокПоступления[0].КорректировкаПоступления.ПолучитьОбъект();
		////	КонецЕсли; 
		////	
		////	ДокКорректировкаПоступления.ОбработкаЗаполнения(ДокПоступлений.Ссылка);
		////	
		////	Для каждого Стр Из ДокКорректировкаПоступления.Товары Цикл
		////		Стр.Сумма = Стр.Сумма*20;
		////		Стр.СуммаВсего = Стр.СуммаВсего*20;
		////		Стр.Цена = Стр.Цена*20;
		////КонецЦикла; 
		////	 			
		////	Попытка
		////	ДокКорректировкаПоступления.Записать(РежимЗаписиДокумента.Проведение);
		////Исключение
		////		Отказ = Истина;
		////		Если обПраво("ДоступКЗначимымОбработкам") Тогда
		////			Форма = ДокКорректировкаПоступления.ПолучитьФорму("ФормаДокумента");
		////			Форма.ОткрытьМодально();
		////		КонецЕсли; 
		////		Возврат Ложь;
		////КонецПопытки;
		////	
		////КонецЕсли;
		//////============================ Конец Коректировки поступления ===========================
		//////Бондаренко-- 20210219
		
		//============================ СчетФактураПолученный ====================================
		Запрос = Новый Запрос;
			
		Запрос.Текст = 	"ВЫБРАТЬ
		               	|	СчетФактураПолученный.Ссылка КАК СчетФактураПолученный,
		               	|	СчетФактураПолученный.ДокументОснование
		               	|ИЗ
		               	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
		               	|ГДЕ                                                         
		               	|	СчетФактураПолученный.ДокументОснование = &ДокументОснование
		               	|	И СчетФактураПолученный.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("ДокументОснование",ДокПоступлений.Ссылка);
 		
		ТаблицаСФ = Запрос.Выполнить().Выгрузить();
		
		Если ТаблицаСФ.Количество() = 0 Тогда
			ДокСФполученный = Документы.СчетФактураПолученный.СоздатьДокумент();
		Иначе	
			ДокСФполученный = ТаблицаСФ[0].СчетФактураПолученный.Ссылка.ПолучитьОбъект();
		КонецЕсли; 
		
		ДокСФполученный.ОбработкаЗаполнения(ДокПоступлений.Ссылка);
		
		Попытка
			ДокСФполученный.Записать(РежимЗаписиДокумента.Проведение);
 		Исключение
			Отказ = Истина;
			Если обПраво("ДоступКЗначимымОбработкам") Тогда
				Форма = ДокСФполученный.ПолучитьФорму("ФормаДокумента");
				Форма.ОткрытьМодально();
			КонецЕсли; 
			Возврат Ложь;	
		КонецПопытки;
 		//============================ Конец СчетФактураПолученный ====================================
 
 		
	КонецЦикла; // По складам
	
  
 	Возврат Истина;

КонецФункции // НайтиСоздатьДокументыПеремешенияИПерепродажОдногоДЦмодуль(ТЗ_для_перемещений,ТЗ_для_реализаций)

//Бондаренко++ 20191112
Функция НайтиСписокАйДи(ТекЗаказПокупателя,ТекНоменклатура)
	
	СтрокаАйДи = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателяТовары.Ссылка КАК ЗаказПокупателя,
		|	ЗаказПокупателяТовары.Номенклатура,
		|	ЗаказПокупателяТовары.АйДи
		|ИЗ
		|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|ГДЕ
		|	ЗаказПокупателяТовары.Ссылка = &Ссылка
		|	И ЗаказПокупателяТовары.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", ТекНоменклатура);
	Запрос.УстановитьПараметр("Ссылка", ТекЗаказПокупателя);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если ТЗ.Количество() > 0 Тогда
		Для каждого Стр Из ТЗ Цикл
			Если НЕ обЗначениеНеЗаполнено(СтрокаАйДи) Тогда
				СтрокаАйДи = СтрокаАйДи+","+СокрЛП(Стр.АйДи);
			Иначе
				СтрокаАйДи = СокрЛП(Стр.АйДи);
 			КонецЕсли; 
 		КонецЦикла; 	
	КонецЕсли; 
	
	Возврат СтрокаАйДи;
 
КонецФункции // НайтиСписокАйДи()
//Бондаренко-- 20191112

Процедура ЗаполнитьОстаткамиЗаказовКонтрагента() Экспорт
	
	СписокСкладов = Новый СписокЗначений;
	
 	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкладыКомпании.Ссылка КАК Склад,
		|	СкладыКомпании.ЭтоГруппа,
		|	СкладыКомпании.Подразделение,
		|	СкладыКомпании.ВидСклада,
		|	СкладыКомпании.Основной,
		|	СкладыКомпании.ТипСклада
		|ИЗ
		|	Справочник.СкладыКомпании КАК СкладыКомпании
		|ГДЕ
		|	СкладыКомпании.ЭтоГруппа = ЛОЖЬ
		|	И СкладыКомпании.ВидСклада = &ВидСклада
		|	И СкладыКомпании.Основной = ИСТИНА
		|	И СкладыКомпании.ТипСклада В(&ТипСклада)
		|	И СкладыКомпании.Подразделение.Родитель = &Родитель";
	
	СЗ_ТиповСкладов = Новый СписокЗначений;
	СЗ_ТиповСкладов.Добавить(Перечисления.ТипыСкладов.Экспедитор);
	СЗ_ТиповСкладов.Добавить(Перечисления.ТипыСкладов.ЗапЧасти);
	
	Запрос.УстановитьПараметр("ВидСклада", Перечисления.ВидыСкладов.Обычный);
	Запрос.УстановитьПараметр("Родитель", ПодразделениеКомпании.Родитель);
	Запрос.УстановитьПараметр("ТипСклада",СЗ_ТиповСкладов);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если обПраво("ДоступКЗначимымОбработкам") Тогда
		ТЗ.ВыбратьСтроку("Это список складов в количестве: "+ТЗ.Количество());
 	КонецЕсли; 
 	СписокСкладов.ЗагрузитьЗначения(ТЗ.ВыгрузитьКолонку("Склад"));
	
 	Если Ссылка.Пустая() Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ЗаказыПокупателейОстатки.Номенклатура,
		                      |	ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры,
		                      |	СУММА(ЗаказыПокупателейОстатки.СуммаОстаток) КАК Сумма,
		                      |	СУММА(ЗаказыПокупателейОстатки.ЗаказаноОстаток) КАК Количество
		                      |ИЗ
		                      |	РегистрНакопления.ЗаказыПокупателей.Остатки(, Контрагент = &Контрагент) КАК ЗаказыПокупателейОстатки
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	ЗаказыПокупателейОстатки.Номенклатура,
		                      |	ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры");
		
	Иначе
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ЗаказыПокупателейОстатки.Номенклатура,
		                      |	ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры,
		                      |	СУММА(ЗаказыПокупателейОстатки.СуммаОстаток) КАК Сумма,
		                      |	СУММА(ЗаказыПокупателейОстатки.ЗаказаноОстаток) КАК Количество
		                      |ИЗ
		                      |	РегистрНакопления.ЗаказыПокупателей.Остатки(&НаМомент, Контрагент = &Контрагент) КАК ЗаказыПокупателейОстатки
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	ЗаказыПокупателейОстатки.Номенклатура,
		                      |	ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры");
		Запрос.УстановитьПараметр("НаМомент",МоментВремени());
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
 	
	ТЗ_ОстатковЗаказов = Запрос.Выполнить().Выгрузить();
	Если обПраво("ДоступКЗначимымОбработкам") Тогда
		ТЗ_ОстатковЗаказов.ВыбратьСтроку("Это свёрнутая таблица всех заказов контрагента:"+Контрагент+", строк: "+ТЗ_ОстатковЗаказов.Количество());
	КонецЕсли;	
	
	СписокТоваровЗаказов = Новый СписокЗначений;
	СписокТоваровЗаказов.ЗагрузитьЗначения(ТЗ_ОстатковЗаказов.ВыгрузитьКолонку("Номенклатура"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура,
		|	ОстаткиТоваровКомпанииОстатки.СкладКомпании,
		|	СУММА(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки КАК ОстаткиТоваровКомпанииОстатки
		|ГДЕ
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура В (&СпНоменклатуры)
		|	И ОстаткиТоваровКомпанииОстатки.СкладКомпании В (&СпСкладовКомпании)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиТоваровКомпанииОстатки.СкладКомпании,
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура";
	
	Запрос.УстановитьПараметр("СпНоменклатуры", СписокТоваровЗаказов);
	Запрос.УстановитьПараметр("СпСкладовКомпании", СписокСкладов);
	
	ТЗ_ОстатковНоменклатуры = Запрос.Выполнить().Выгрузить();
	Если обПраво("ДоступКЗначимымОбработкам") Тогда
		ТЗ_ОстатковНоменклатуры.ВыбратьСтроку("Это свёрнутая таблица всех остатков товаров на экспедиторских складах:"+СписокСкладов+", строк: "+ТЗ_ОстатковНоменклатуры.Количество());
	КонецЕсли;	
	
	ВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	КурсВалютыУпр = 1;
	
	Для Каждого ТекСтрокаТовары Из ТЗ_ОстатковЗаказов Цикл
		
		ТекНоменклатура = ТекСтрокаТовары.Номенклатура; 
		ТребуетсяКол = ТекСтрокаТовары.Количество;
		ТекЦена = 0;
		Если ТребуетсяКол > 0 Тогда
			ТекЦена = ТекСтрокаТовары.Сумма/ТребуетсяКол;
 		КонецЕсли; 
		
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",ТекНоменклатура);
		
		НайдСтроки = ТЗ_ОстатковНоменклатуры.НайтиСтроки(Отбор);
		
		ВсегоВналичии = 0;
		Для Каждого СтрокаМассива Из НайдСтроки Цикл
			ВсегоВналичии = ВсегоВналичии + СтрокаМассива.КоличествоОстаток;
		КонецЦикла;
		
		Если ВсегоВналичии = 0 Тогда
 			Продолжить;
 		КонецЕсли;	
		
		Для каждого Эл из НайдСтроки Цикл
			НоваяСтрока=Товары.Добавить();
 			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.СкладКомпании = Эл.СкладКомпании;
			НоваяСтрока.Количество = Мин(ТребуетсяКол,Эл.Количествоостаток);
			НоваяСтрока.КоличествоБазовое = НоваяСтрока.Количество;
			ТребуетсяКол = ТребуетсяКол - НоваяСтрока.Количество;
			НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаТовары.Номенклатура.ОсновнаяЕдиницаИзмерения;
			НоваяСтрока.Коэффициент = 1;
			НоваяСтрока.Отметка = Истина;
			НоваяСтрока.Цена = ТекЦена; 
			НоваяСтрока.СуммаВсего = НоваяСтрока.Цена*НоваяСтрока.Количество*НоваяСтрока.Коэффициент;
			НоваяСтрока.СуммаВсего = обПересчет(НоваяСтрока.СуммаВсего, ВалютаУпр, КурсВалютыУпр, ВалютаДокумента, КурсДокумента);
			ОбработкаРеквизита("Товары.СуммаВсего", НоваяСтрока);
 			//НоваяСтрока.АйДи = НайтиСписокАйДи(НоваяСтрока.Заказ,НоваяСтрока.Номенклатура);
 			Если ТребуетсяКол <= 0 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;

	
	//Возврат;
	//
	//Товары.Очистить();
	//
	//ВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	НоваяСтрока=Товары.Добавить();
	//	НоваяСтрока.Номенклатура				= Выборка.Номенклатура;
	//	НоваяСтрока.ХарактеристикаНоменклатуры	= Выборка.ХарактеристикаНоменклатуры;
	//	ОбработкаРеквизита("Товары.Номенклатура", НоваяСтрока);
	//	НоваяСтрока.Количество					= Выборка.Количество/?(обЗначениеНеЗаполнено(НоваяСтрока.Коэффициент),1,НоваяСтрока.Коэффициент);
	//	ОбработкаРеквизита("Товары.Количество", НоваяСтрока);
	//	Если Выборка.Количество = Выборка.Заказано Тогда
	//		НоваяСтрока.СуммаВсего = Выборка.Сумма;
	//	Иначе
	//		НоваяСтрока.СуммаВсего = (Выборка.Сумма/Выборка.Заказано)*Выборка.Количество;
	//	КонецЕсли;
	//	НоваяСтрока.СуммаВсего = обПересчет(НоваяСтрока.СуммаВсего, ВалютаУпр, КурсВалютыУпр, ВалютаДокумента, КурсДокумента);
	//	ОбработкаРеквизита("Товары.СуммаВсего", НоваяСтрока);
 ;	
	//КонецЦикла;
КонецПроцедуры

Функция СМГ_ЗапросПриНеМенятьПорядокСтрок(Запрос)

		//Бондаренко++ 20191112
		Если НеМенятьПорядокСтрок Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ЗаказыПокупателейОстатки.Номенклатура,
			|	ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры,
			|	ЗаказыПокупателейОстатки.Заказ,
			|	СУММА(ВЫБОР
			|		КОГДА ЗаказыПокупателейОстатки.СкладКомпании = &СкладКомпании ТОГДА
			|			ЗаказыПокупателейОстатки.РезервОстаток
			|		ИНАЧЕ
			|			0
			|	КОНЕЦ) КАК Количество,
			|	СУММА(ЗаказыПокупателейОстатки.СуммаУпрОстаток) КАК СуммаУпр,
			|	СУММА(ЗаказыПокупателейОстатки.СуммаОстаток) КАК Сумма,
			|	СУММА(ЗаказыПокупателейОстатки.ЗаказаноОстаток) КАК Заказано
			|ИЗ
			|	РегистрНакопления.ЗаказыПокупателей.Остатки("+?(Ссылка.Пустая(),"","&НаМомент")+",Контрагент = &Контрагент И (СкладКомпании = &СкладКомпании ИЛИ СкладКомпании = Заказ.СкладКомпании)) КАК ЗаказыПокупателейОстатки
			|СГРУППИРОВАТЬ ПО
			|	ЗаказыПокупателейОстатки.Номенклатура,
			|	ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры,
			|	ЗаказыПокупателейОстатки.Заказ
			|ИМЕЮЩИЕ
			|	СУММА(ВЫБОР
			|		КОГДА ЗаказыПокупателейОстатки.СкладКомпании = &СкладКомпании ТОГДА
			|			ЗаказыПокупателейОстатки.РезервОстаток
			|		ИНАЧЕ
			|			0
			|	КОНЕЦ) > 0 ");
 		КонецЕсли; 
		//Бондаренко-- 20191112                 
		
		Возврат Запрос;
 
КонецФункции // СМГ_ЗапросПриНеМенятьПорядокСтрок()

Функция ПрописатьАйДи(ВыборкаЗаказ,ВыборкаНоменклатура)
	СтрокаАйДи = "";
 	Если НеМенятьПорядокСтрок Тогда
		СтрокаАйДи = НайтиСписокАйДи(ВыборкаЗаказ,ВыборкаНоменклатура);
	КонецЕсли;	                                         
	Возврат СтрокаАйДи;
КонецФункции // ПрописатьАйДи()

Функция СМГ_ДобавитьОбязательныеРеквизиты(ОбязательныеРеквизиты)
	
	ОбязательныеВыгрузкаИзТСД=Новый Структура();
	ОбязательныеВыгрузкаИзТСД.Вставить("Номенклатура",3);
 	ОбязательныеВыгрузкаИзТСД.Вставить("Количество",1);
 	ОбязательныеРеквизиты.Вставить("ВыгрузкаИзТСД",ОбязательныеВыгрузкаИзТСД);
	
	//Бондаренко++ 20220511
	ОбязательныеЗаказНаряды=Новый Структура();
	ОбязательныеЗаказНаряды.Вставить("ЗаказНаряд",1);
 	ОбязательныеЗаказНаряды.Вставить("СуммаПоАкту",1);
 	ОбязательныеРеквизиты.Вставить("ЗаказНаряды",ОбязательныеЗаказНаряды);
	//Бондаренко-- 20220511
 	
  	Возврат ОбязательныеРеквизиты; 
КонецФункции // СМГ_ДобавитьОбязательныеРеквизитыТСД(ОбязательныеРеквизиты)
  
Функция СМГ_ПроверитьКорректность(Результат,Ошибки)

 	// Проверим ТЧ на наличие НДС для ХозОперации "РеализацияТоваров"
	Если Результат И ХозОперация = Справочники.ХозОперации.РеализацияТоваров И Не Организация.ОсвобожденОтНДС И (Контрагент.Код<>"ЦБ003307") Тогда
		МассивСтрок = Новый Массив;
		НомераСтрок = " ";
		Флаг = Ложь;
		Для Каждого ТекСтрока Из ЭтотОбъект.Товары Цикл
			Если ТекСтрока.СтавкаНДС = Справочники.СтавкиНДС.БезНДС Тогда
				НомераСтрок = НомераСтрок + ?(НомераСтрок = " ", " ", ", " ) + ТекСтрока.НомерСтроки;
				Флаг = Истина;
			КонецЕсли;
		КонецЦикла;
		Если Флаг Тогда
			стрОшибка = "Для организации <" + Организация + "> не должно быть строк без НДС в табличной части. Номера строк без НДС:" + НомераСтрок;
			дкДобавитьОшибку(Ошибки, стрОшибка);
			Результат = Ложь;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // СМГ_ПроверитьКорректность(Результат)

Процедура СМГ_ПечатьАдресаЗаказа(ТабДокумент,Макет)

 		АдресПеч = "";
		Запрос = Новый Запрос; 
		Запрос.Текст =     
		"ВЫБРАТЬ
		|	ЗаказыПокупателей.Период,
		|	ЗаказыПокупателей.Регистратор,
		|	ЗаказыПокупателей.Заказ
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателей
		|ГДЕ
		|	ЗаказыПокупателей.Регистратор = &Регистратор"; 
		
		Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		Если ТЗ.Количество() > 0 Тогда
			
			Запрос = Новый Запрос;
			
			Запрос.Текст = 
			
			"ВЫБРАТЬ
			|	АдресаХраненияЗаказовПокупателейСрезПоследних.ЯчейкаХранения,
			|	АдресаХраненияЗаказовПокупателейСрезПоследних.ЗаказПокупателя
			|ИЗ
			|	РегистрСведений.АдресаХраненияЗаказовПокупателей.СрезПоследних КАК АдресаХраненияЗаказовПокупателейСрезПоследних
			|ГДЕ
			|	АдресаХраненияЗаказовПокупателейСрезПоследних.ЗаказПокупателя = &ВыбЗаказ";
			
			Запрос.УстановитьПараметр("ВыбЗаказ", ТЗ[0].Заказ);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				АдресПеч = ВыборкаДетальныеЗаписи.ЯчейкаХранения;
 			КонецЦикла;
			
		КонецЕсли; 
		
		Если СокрЛП(АдресПеч) <> "" Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Адрес");
			ОбластьМакета.Параметры.АдресПеч = АдресПеч;
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли; 
		//Бондаренко-- 20171005
 
КонецПроцедуры

//Бондаренко++ 20200310
Функция СМГ_ОтсортироватьПоЯчейкам(ВыборкаТЧ)

	ВыборкаТабличнойЧастиОтсортированная  = ВыборкаТЧ.Выгрузить();
  	ВыборкаТабличнойЧастиОтсортированная.Свернуть("Номенклатура,ЕдиницаИзмерения,Ячейка","Количество, НомерСтроки");
  	ВыборкаТабличнойЧастиОтсортированная.Сортировать("Ячейка");
	Счётчик = 0;
	Для каждого Стр Из ВыборкаТабличнойЧастиОтсортированная Цикл
		Счётчик = Счётчик + 1;
		Стр.НомерСтроки = Счётчик;
	КонецЦикла; 
	Возврат ВыборкаТабличнойЧастиОтсортированная;
 
КонецФункции // СМГ_ОтсортироватьПоЯчейкам()
//Бондаренко++ 20200310

Функция СМГ_ВставитьПроизводителя(СтруктураСтр,СтрокаТЧ)
	
	СтруктураСтр.Вставить("Производитель");
	Производитель = СтрокаТЧ.Номенклатура.Производитель;
	СтруктураСтр.Производитель = ?(обЗначениеНеЗаполнено(Производитель), "", Производитель.Наименование);		
	
	Возврат СтруктураСтр;	
	
КонецФункции // СМГ_Вставитьпроизводителя()

// Возвращает доступные варианты печати документа
// Возвращаемое значение: 
//  Структура, каждая строка которой
//  соответствует одному из вариантов печати
//  Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм() Экспорт
		СтруктураМакетов=Новый Структура();
		//СтруктураМакетов.Вставить("РеализацияТоваров", "Расходная накладная");
		СтруктураМакетов.Вставить("ПодборочныйЛист", "Подборочный лист");
		////Гэндальф+++
		//Если Константы.ДилерскийЦентр.Получить() <> Справочники.ДилерскиеЦентры.Дельта тогда
		////Гэндальф---	
			СтруктураМакетов.Вставить("ТОРГ12", "ТОРГ-12 (Товарная накладная)");
		////Гэндальф+++
		//КонецЕсли;
		////Гэндальф---
		СтруктураМакетов.Вставить("Т1", "1-Т (Товарно-транспортная накладная)");
		СтруктураМакетов.Вставить("Приложение4", "Приложение №4 (Транспортная накладная)");
		СтруктураМакетов.Вставить("ЭтикетокИЦенников", "Печать этикеток и ценников");
		
		//Бондаренко++ 20199222
		СтруктураМакетов.Вставить("УПД"              , "Универсальный передаточный документ");
		//Бондаренко-- 20199222
		
		//Бондаренко++ 20190417
		Если МежскладскиеПеремещения Тогда
 			СтруктураМакетов.Вставить("ДляОптовика"  , "Для оптовика");
   		КонецЕсли; 
		//Бондаренко-- 20190417
 		Возврат СтруктураМакетов;
	КонецФункции // ПолучитьСписокПечатныхФорм()

	//Бондаренко++ 20190417
// Формирует печатную форму "ДляОптовика"
// Возвращает сформированный табличный документ:
Функция ПечатьДляОптовика(ТабДокумент) Экспорт
		
	Если МежскладскиеПеремещения Тогда
		ТабДокумент = ПечатьОптовика(ЭтотОбъект,ТабДокумент);
		Возврат ТабДокумент;	
	Иначе
		ТабДокумент = Новый ТабличныйДокумент;
		Сообщить("Форма запрещена");
		Возврат ТабДокумент;	
	КонецЕсли; 
		
КонецФункции //ПечатьДляОптовика()
	
Функция ПечатьОптовика(ДокументОбъект, ТабДокумент) Экспорт
	
	Макет = ПолучитьМакет("ДляОптовика");
	
	ТабДокумент.ТолькоПросмотр = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	//формат вывода суммы и количества
	ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы", ДокументОбъект.Права,,ДокументОбъект);
	ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества", ДокументОбъект.Права,,ДокументОбъект);
	//
	ТипДок = ТипЗнч(ДокументОбъект);
	
	ВыводитьКодВидаТовара = (ДокументОбъект.Дата >= Дата('20171001'));
	ВыводитьКодТНВЭД      = обПраво("ВыводитьКодТНВЭД");
	
	//формируем таблицу для вывода на печать
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("ТоварКод", Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("ТоварНаименование", Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("КодВидаТовара", Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("ЕдиницаИзмеренияКод", Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("Стоимость", Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("Акциз", Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("СуммаНДС", Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("Всего", Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("СтранаПроисхожденияКод", Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("ПредставлениеСтраны", Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("ПредставлениеГТД", Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("ПредставлениеАйДи", Новый ОписаниеТипов("Строка"));
	
	Ном = 1;
	ЕстьТовары=Ложь;
	Для Каждого ИмяТабличнойЧасти Из ДокументОбъект.Метаданные().ТабличныеЧасти Цикл
		ЕстьСкидкиБонусов = (ИмяТабличнойЧасти.Реквизиты.Найти("СуммаСкидкиБонусами") <> Неопределено);
		Если ИмяТабличнойЧасти.Имя = "Товары" Тогда
			//для документов товаров
			Для Каждого ТекСтрока Из ДокументОбъект[ИмяТабличнойЧасти.Имя] Цикл
				НоваяСтрока = ТаблицаТоваров.Добавить();
				НоваяСтрока.НомерСтроки			 = Ном;
				НоваяСтрока.ТоварНаименование	 = спПолучитьНаименование(ТекСтрока.Номенклатура);
				СуммаБезНДС = ТекСтрока.СуммаВсего - ТекСтрока.СуммаНДС;
				ЦенаБезНДС = СуммаБезНДС/ТекСтрока.Количество;
				НоваяСтрока.Цена				 = Формат(ЦенаБезНДС, ФорматВыводаСуммы);
				Если ТипЗнч(ТекСтрока.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
					НоваяСтрока.ЕдиницаИзмеренияКод	 = ТекСтрока.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;
					НоваяСтрока.ЕдиницаИзмерения	 = спПолучитьНаименование(ТекСтрока.ЕдиницаИзмерения);
					НоваяСтрока.ТоварКод			 = ТекСтрока.Номенклатура.Артикул;
					ЕстьТовары = ТекСтрока.Номенклатура.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.Услуга ИЛИ ЕстьТовары;
					Если ДокументОбъект.ТипЦен.ЦенаВключаетНДС = Истина Тогда
						Стоимость = ТекСтрока.Сумма - ТекСтрока.СуммаНДС;
						Попытка
							НоваяСтрока.Стоимость = Формат(Стоимость - ТекСтрока.СуммаСкидки - ТекСтрока.СуммаСкидкиСтроки - ?(ЕстьСкидкиБонусов, ТекСтрока.СуммаСкидкиБонусами, 0), ФорматВыводаСуммы);
						Исключение
							НоваяСтрока.Стоимость = Формат(Стоимость, ФорматВыводаСуммы);
						КонецПопытки;
					Иначе
						НоваяСтрока.Стоимость = Формат(ЦенаБезНДС * ТекСтрока.Количество, ФорматВыводаСуммы);
					КонецЕсли;
					
					КодТНВЭД = ТекСтрока.Номенклатура.КодТНВЭД;
					Если ЗначениеЗаполнено(КодТНВЭД) И ВыводитьКодТНВЭД
						И ТекСтрока.Номенклатура.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.Услуга Тогда
						НоваяСтрока.КодВидаТовара = СокрЛП(КодТНВЭД);
					Иначе
						НоваяСтрока.КодВидаТовара = "--";
					КонецЕсли;
				ИначеЕсли ТипЗнч(ТекСтрока.Номенклатура) = Тип("СправочникСсылка.Автомобили") Тогда
					НоваяСтрока.ЕдиницаИзмеренияКод	 = "796";
					НоваяСтрока.ЕдиницаИзмерения	 = "шт";
					НоваяСтрока.КодВидаТовара = "--";
					ЕстьТовары=Истина;
					Если ДокументОбъект.ТипЦен.ЦенаВключаетНДС = Истина Тогда
						Стоимость		 =ТекСтрока.Сумма - ТекСтрока.СуммаНДС;
						Попытка
							НоваяСтрока.Стоимость = Формат(Стоимость - ТекСтрока.СуммаСкидки - ТекСтрока.СуммаСкидкиСтроки - ?(ЕстьСкидкиБонусов, ТекСтрока.СуммаСкидкиБонусами, 0), ФорматВыводаСуммы);
						Исключение
							НоваяСтрока.Стоимость = Формат(Стоимость, ФорматВыводаСуммы);
						КонецПопытки;
					Иначе
						НоваяСтрока.Стоимость = Формат(ЦенаБезНДС * ТекСтрока.Количество, ФорматВыводаСуммы);
					КонецЕсли;
					
				Иначе
					НоваяСтрока.ЕдиницаИзмеренияКод	 = "--";
					НоваяСтрока.ЕдиницаИзмерения	 = "--";
					НоваяСтрока.КодВидаТовара = "--";
					НоваяСтрока.Стоимость = Формат(ЦенаБезНДС * ТекСтрока.Количество, ФорматВыводаСуммы);
				КонецЕсли;
				НоваяСтрока.Количество			 = Формат(ТекСтрока.Количество, ФорматВыводаКоличества);
				НоваяСтрока.Акциз				 = "без акциза";
				НоваяСтрока.СтавкаНДС			 = Формат(ТекСтрока.СтавкаНДС, ФорматВыводаСуммы);
				НоваяСтрока.СуммаНДС			 = Формат(ТекСтрока.СуммаНДС, ФорматВыводаСуммы);
				НоваяСтрока.Всего				 = Формат(ТекСтрока.СуммаВсего, ФорматВыводаСуммы);
				НоваяСтрока.ПредставлениеАйДи    = СокрЛП(ТекСтрока.АйДи);
				
				Попытка
					Если НЕ обЗначениеНеЗаполнено(ТекСтрока.ГТД) Тогда
						НоваяСтрока.ПредставлениеГТД		 = спПолучитьНаименование(ТекСтрока.ГТД);
						НоваяСтрока.ПредставлениеСтраны		 = ТекСтрока.ГТД.Страна.Наименование;
						НоваяСтрока.СтранаПроисхожденияКод	 = ТекСтрока.ГТД.Страна.Код;
					Иначе
						НоваяСтрока.ПредставлениеГТД		 = "--";
						НоваяСтрока.ПредставлениеСтраны		 = "--";
						НоваяСтрока.СтранаПроисхожденияКод	 = "--";
					КонецЕсли;
				Исключение
					НоваяСтрока.ПредставлениеГТД		 = "--";
					НоваяСтрока.ПредставлениеСтраны		 = "--";
					НоваяСтрока.СтранаПроисхожденияКод	 = "--";
				КонецПопытки;
				
				Ном = Ном + 1;
			КонецЦикла;
		ИначеЕсли ИмяТабличнойЧасти.Имя = "Автомобили" Тогда
			Для Каждого ТекСтрока Из ДокументОбъект[ИмяТабличнойЧасти.Имя] Цикл
				НоваяСтрока = ТаблицаТоваров.Добавить();
				НоваяСтрока.НомерСтроки			 = Ном;
				НоваяСтрока.ТоварНаименование	 = спПолучитьНаименование(ТекСтрока.Автомобиль);
				НоваяСтрока.ЕдиницаИзмеренияКод	 = "796";
				НоваяСтрока.ЕдиницаИзмерения	 = "шт";
				НоваяСтрока.КодВидаТовара = "--";
				ТекСтрокаКоличество=1;
				Попытка
					ТекСтрокаКоличество=ТекСтрока.Количество;
				Исключение
				КонецПопытки; 
				СуммаБезНДС = ТекСтрока.СуммаВсего - ТекСтрока.СуммаНДС;
				ЦенаБезНДС = СуммаБезНДС/ТекСтрокаКоличество;
				НоваяСтрока.Количество			 = Формат(ТекСтрокаКоличество, ФорматВыводаКоличества);
				НоваяСтрока.Цена				 = Формат(ЦенаБезНДС, ФорматВыводаСуммы);
				Если ДокументОбъект.ТипЦен.ЦенаВключаетНДС = Истина Тогда
					Стоимость		 = ТекСтрока.Сумма - ТекСтрока.СуммаНДС;
					Попытка
						НоваяСтрока.Стоимость = Формат(Стоимость - ТекСтрока.СуммаСкидки, ФорматВыводаСуммы);
					Исключение
						НоваяСтрока.Стоимость = Формат(Стоимость, ФорматВыводаСуммы);
					КонецПопытки;
				Иначе
					НоваяСтрока.Стоимость = Формат(ЦенаБезНДС * ТекСтрокаКоличество, ФорматВыводаСуммы);
				КонецЕсли;
				
				НоваяСтрока.Акциз				 = "без акциза";
				НоваяСтрока.СтавкаНДС			 = Формат(ТекСтрока.СтавкаНДС, ФорматВыводаСуммы);
				НоваяСтрока.СуммаНДС			 = Формат(ТекСтрока.СуммаНДС, ФорматВыводаСуммы);
				НоваяСтрока.Всего				 = Формат(ТекСтрока.СуммаВсего, ФорматВыводаСуммы);
				НоваяСтрока.ПредставлениеАйДи    = СокрЛП(ТекСтрока.АйДи);
				НоваяСтрока.ПредставлениеГТД		 = "--";
				НоваяСтрока.ПредставлениеСтраны		 = "--";
				НоваяСтрока.СтранаПроисхожденияКод	 = "--";
				ЕстьТовары=Истина;
				Ном = Ном + 1;
			КонецЦикла;
		ИначеЕсли ИмяТабличнойЧасти.Имя = "Опции" Тогда
			ТаблицаОпцийПоАвтомобилям = ДокументОбъект[ИмяТабличнойЧасти.Имя].Выгрузить();
			ТаблицаОпцийПоАвтомобилям.Свернуть("ИдентификаторАвтомобиля","Сумма,СуммаНДС,СуммаВсего");
			//перебор строк
			Для Каждого СтрокаТабличнойЧасти Из ТаблицаТоваров Цикл
				//предварительная обработка строки ТЧ
				СтрокаТабличнойЧастиОпции = ТаблицаОпцийПоАвтомобилям.Найти(СтрокаТабличнойЧасти.ИдентификаторАвтомобиля,"ИдентификаторАвтомобиля");
				Если СтрокаТабличнойЧастиОпции <> Неопределено Тогда
					СтрокаТабличнойЧасти.Сумма		= СтрокаТабличнойЧасти.Сумма		+ СтрокаТабличнойЧастиОпции.Сумма;
					СтрокаТабличнойЧасти.СуммаНДС	= СтрокаТабличнойЧасти.СуммаНДС		+ СтрокаТабличнойЧастиОпции.СуммаНДС;
					СтрокаТабличнойЧасти.СуммаВсего	= СтрокаТабличнойЧасти.СуммаВсего	+ СтрокаТабличнойЧастиОпции.СуммаВсего;
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ИмяТабличнойЧасти.Имя = "Активы" Тогда
			Для Каждого ТекСтрока Из ДокументОбъект[ИмяТабличнойЧасти.Имя] Цикл
				НоваяСтрока = ТаблицаТоваров.Добавить();
				НоваяСтрока.НомерСтроки			 = Ном;
				НоваяСтрока.ТоварНаименование	 = спПолучитьНаименование(ТекСтрока.ПрочийАктив);
				НоваяСтрока.ЕдиницаИзмеренияКод	 = ТекСтрока.ПрочийАктив.Номенклатура.БазоваяЕдиницаИзмерения.Код;
				НоваяСтрока.ЕдиницаИзмерения	 = ТекСтрока.ПрочийАктив.Номенклатура.БазоваяЕдиницаИзмерения;
				НоваяСтрока.КодВидаТовара		 = "--";
				НоваяСтрока.ТоварКод			 = ТекСтрока.ПрочийАктив.Код;
				НоваяСтрока.Количество			 = Формат(ТекСтрока.Количество, ФорматВыводаКоличества);
				Стоимость			 = ТекСтрока.Сумма - ТекСтрока.СуммаНДС;
				Попытка
					НоваяСтрока.Стоимость = Формат(Стоимость - ТекСтрока.СуммаСкидки - ТекСтрока.СуммаСкидкиСтроки - ?(ЕстьСкидкиБонусов, ТекСтрока.СуммаСкидкиБонусами, 0), ФорматВыводаСуммы);
				Исключение
					НоваяСтрока.Стоимость = Формат(Стоимость, ФорматВыводаСуммы);
				КонецПопытки;
				НоваяСтрока.Цена				 = НоваяСтрока.Стоимость;
				НоваяСтрока.Акциз				 = "без акциза";
				НоваяСтрока.СтавкаНДС			 = Формат(ТекСтрока.СтавкаНДС, ФорматВыводаСуммы);
				НоваяСтрока.СуммаНДС			 = Формат(ТекСтрока.СуммаНДС, ФорматВыводаСуммы);
				НоваяСтрока.Всего				 = Формат(ТекСтрока.Сумма, ФорматВыводаСуммы);
				НоваяСтрока.ПредставлениеИд		 = СокрЛП(ТекСтрока.АйДи);
				НоваяСтрока.ПредставлениеГТД		 = "--";
				НоваяСтрока.ПредставлениеСтраны		 = "--";
				НоваяСтрока.СтранаПроисхожденияКод	 = "--";
				Ном = Ном + 1;
			КонецЦикла;
		ИначеЕсли ИмяТабличнойЧасти.Имя = "Работы" Тогда
			Для Каждого ТекСтрока Из ДокументОбъект[ИмяТабличнойЧасти.Имя] Цикл
				НоваяСтрока						 = ТаблицаТоваров.Добавить();
				НоваяСтрока.НомерСтроки			 = Ном;
				НоваяСтрока.ТоварКод			 = ТекСтрока.Работа.Артикул;
				НоваяСтрока.ТоварНаименование	 = спПолучитьНаименование(ТекСтрока.Работа);
				НоваяСтрока.ЕдиницаИзмеренияКод	 = "--";
				НоваяСтрока.ЕдиницаИзмерения	 = "--";
				НоваяСтрока.КодВидаТовара		 = "--";
				НоваяСтрока.Количество			 = Формат(ТекСтрока.Количество, ФорматВыводаКоличества);
				СуммаБезНДС = ТекСтрока.СуммаВсего - ТекСтрока.СуммаНДС;
				ЦенаБезНДС = СуммаБезНДС/ТекСтрока.Количество;
				НоваяСтрока.Цена				 = Формат(ЦенаБезНДС, ФорматВыводаСуммы);
				Если ДокументОбъект.ТипЦенРабот.ЦенаВключаетНДС = Истина Тогда
					Стоимость = ТекСтрока.Сумма - ТекСтрока.СуммаНДС;
					Попытка
						НоваяСтрока.Стоимость = Формат(Стоимость - ТекСтрока.СуммаСкидки - ТекСтрока.СуммаСкидкиСтроки - ?(ЕстьСкидкиБонусов, ТекСтрока.СуммаСкидкиБонусами, 0), ФорматВыводаСуммы);
					Исключение
						НоваяСтрока.Стоимость = Формат(Стоимость, ФорматВыводаСуммы);
					КонецПопытки;
				Иначе
					НоваяСтрока.Стоимость = Формат(ЦенаБезНДС * ТекСтрока.Количество, ФорматВыводаСуммы);
				КонецЕсли;
				
				НоваяСтрока.Акциз				 = "--";
				НоваяСтрока.СтавкаНДС			 = Формат(ТекСтрока.СтавкаНДС, ФорматВыводаСуммы);
				НоваяСтрока.СуммаНДС			 = Формат(ТекСтрока.СуммаНДС, ФорматВыводаСуммы);
				НоваяСтрока.Всего				 = Формат(ТекСтрока.СуммаВсего, ФорматВыводаСуммы);
				НоваяСтрока.ПредставлениеАйДи		 = СокрЛП(ТекСтрока.АйДи);
				НоваяСтрока.ПредставлениеГТД		 = "--";
				НоваяСтрока.ПредставлениеСтраны		 = "--";
				НоваяСтрока.СтранаПроисхожденияКод	 = "--";
				Ном = Ном + 1;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакетаШапка.Параметры.Поставщик				= ДокументОбъект.Организация;
	ОбластьМакетаШапка.Параметры.ПредставлениеПоставщика	= спПолучитьПредставление(ОбластьМакетаШапка.Параметры.Поставщик,Новый Структура("Наименование"," "));
	ОбластьМакетаШапка.Параметры.АдресПоставщика	= спПолучитьПредставление(ДокументОбъект.ПодразделениеКомпании,Новый Структура("АдресЮридический"," "));

	ОбластьМакетаШапка.Параметры.АдресПоставщика = ?(ЗначениеЗаполнено(ОбластьМакетаШапка.Параметры.АдресПоставщика), ОбластьМакетаШапка.Параметры.АдресПоставщика, "--");
	ОбластьМакетаШапка.Параметры.ИННПоставщика = ?(ЗначениеЗаполнено(ДокументОбъект.Организация.ИНН),ДокументОбъект.Организация.ИНН, "--") +"/"+?(ЗначениеЗаполнено(ДокументОбъект.Организация.КПП), ДокументОбъект.Организация.КПП, "--");
	
	ОбластьМакетаШапка.Параметры.Грузоотправитель				= обПолучитьЗначениеСвойства(ДокументОбъект,"Грузоотправитель",ДокументОбъект.ПодразделениеКомпании);
	Если ТипЗнч(ОбластьМакетаШапка.Параметры.Грузоотправитель)=Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
		ОргДляСравнения=ОбластьМакетаШапка.Параметры.Грузоотправитель.Организация;
	Иначе
		ОргДляСравнения=ОбластьМакетаШапка.Параметры.Грузоотправитель;
	КонецЕсли;
	Если ОргДляСравнения=ДокументОбъект.Организация Тогда
		ОбластьМакетаШапка.Параметры.ПредставлениеГрузоотправителя	= "он же";
	Иначе
		ОбластьМакетаШапка.Параметры.ПредставлениеГрузоотправителя	= спПолучитьПредставление(ОбластьМакетаШапка.Параметры.Грузоотправитель,Новый Структура("Наименование,АдресФактический"," ",""));
	КонецЕсли;
	
	//ДокументОбъект = Ссылка;
	Если обЭтотТип(ДокументОбъект, "ДокументОбъект.СчетФактураВыданный") Тогда
		ОбластьМакетаШапка.Параметры.Грузополучатель	= обПолучитьЗначениеСвойства(ДокументОбъект,"Грузополучатель", ДокументОбъект.Грузополучатель);
	Иначе
		ОбластьМакетаШапка.Параметры.Грузополучатель	= обПолучитьЗначениеСвойства(ДокументОбъект,"Грузополучатель");
	КонецЕсли;
	ОбластьМакетаШапка.Параметры.ПредставлениеГрузополучателя = спПолучитьПредставление(ОбластьМакетаШапка.Параметры.Грузополучатель,Новый Структура("Наименование,АдресФактический"," ",""));
	КоличествоСтрок = ТаблицаТоваров.Количество();
	Если НЕ ЕстьТовары Тогда
		ОбластьМакетаШапка.Параметры.ПредставлениеГрузоотправителя = "--";
		ОбластьМакетаШапка.Параметры.ПредставлениеГрузополучателя = "--";
	КонецЕсли; 
	
	
	Если ТипДок = Тип("ДокументОбъект.СчетФактураВыданный") Тогда
		ОбластьМакетаШапка.Параметры.ПоДокументу = ?(ЗначениеЗаполнено(ДокументОбъект.ПлатежноРасчетныеДокументы), ДокументОбъект.ПлатежноРасчетныеДокументы, "--");
	КонецЕсли;
	Если ДокументОбъект.Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ОбособленноеПодразделение Тогда
		ОбластьМакетаШапка.Параметры.Покупатель				= ДокументОбъект.Контрагент.ГоловнойКонтрагент;	
	Иначе
		ОбластьМакетаШапка.Параметры.Покупатель				= ДокументОбъект.Контрагент;	
	КонецЕсли;
	
	ОбластьМакетаШапка.Параметры.ПредставлениеПокупателя = спПолучитьПредставление(ОбластьМакетаШапка.Параметры.Покупатель,Новый Структура("Наименование",""));
	ОбластьМакетаШапка.Параметры.АдресПокупателя = спПолучитьПредставление(ОбластьМакетаШапка.Параметры.Покупатель,Новый Структура("АдресЮридический",""));
	Если ДокументОбъект.Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ОбособленноеПодразделение Тогда
		ОбластьМакетаШапка.Параметры.ИННПокупателя = ?(ЗначениеЗаполнено(ДокументОбъект.Контрагент.ГоловнойКонтрагент.ИНН), ДокументОбъект.Контрагент.ГоловнойКонтрагент.ИНН, "--") +"/"+?(ЗначениеЗаполнено(ДокументОбъект.Контрагент.КПП), ДокументОбъект.Контрагент.КПП, "--");	
	Иначе
		ОбластьМакетаШапка.Параметры.ИННПокупателя = ?(ЗначениеЗаполнено(ДокументОбъект.Контрагент.ИНН), ДокументОбъект.Контрагент.ИНН, "--") +"/"+?(ЗначениеЗаполнено(ДокументОбъект.Контрагент.КПП), ДокументОбъект.Контрагент.КПП, "--");
	КонецЕсли;

	ДокументФактура = Документы.СчетФактураВыданный.НайтиПоРеквизиту("ДокументОснование", ДокументОбъект.Ссылка);
	
	//если документ вводится на основании счет-фактуры или счет-фактура - статус 1
	Если ТипДок = Тип("ДокументОбъект.СчетФактураВыданный") ИЛИ (ДокументФактура <> Документы.СчетФактураВыданный.ПустаяСсылка() И НЕ ДокументФактура.ПометкаУдаления) Тогда
		ОбластьМакетаШапка.Параметры.СтатусУПД = 1;
		//заполним номер и дату
		ДокументСчетФактура = ?(ДокументФактура = Документы.СчетФактураВыданный.ПустаяСсылка(), ДокументОбъект.ссылка, ДокументФактура);
		Если ДокументСчетФактура.ХозОперация = Справочники.ХозОперации.СчетФактураВыданный Тогда
			ОбластьМакетаШапка.Параметры.Номер    = дкПолучитьНомерДляПечати(ДокументСчетФактура);
			ОбластьМакетаШапка.Параметры.Дата = Формат(ДокументСчетФактура.Дата, "ДФ=""дд ММММ гггг""");
			ОбластьМакетаШапка.Параметры.НомерИсправления = "--";
			ОбластьМакетаШапка.Параметры.ДатаИсправления = "--";
		Иначе
			//ТекстЗаголовкаИзменения = "Исправление  № " + ?(ЗначениеЗаполнено(ЭтотОбъект.НомерИсправления), ЭтотОбъект.НомерИсправления, "----") +" от " + Формат(ЭтотОбъект.Дата, "ДФ=""дд ММММ гггг""");
			ОбластьМакетаШапка.Параметры.НомерИсправления = ?(ЗначениеЗаполнено(ДокументСчетФактура.НомерИсправления), ДокументСчетФактура.НомерИсправления, "--");
			ОбластьМакетаШапка.Параметры.ДатаИсправления = Формат(ДокументСчетФактура.Дата, "ДФ=""дд ММММ гггг""");
			// найдем изначальную счет фактуру
			ДокументОсн = ДокументСчетФактура.ДокументОснование;
			Пока ТипЗнч(ДокументОсн) = Тип("ДокументСсылка.КорректировкаРеализации") Цикл
				ДокументОсн = ДокументОсн.ДокументОснование;
			КонецЦикла;
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СчетФактураВыданный.Ссылка
			|ИЗ
			|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
			|ГДЕ
			|	СчетФактураВыданный.ДокументОснование = &ДокументОсн";
			Запрос.УстановитьПараметр("ДокументОсн",ДокументОсн);
			ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
			
			Если ВыборкаЗапроса.Следующий() Тогда 
				//ТекстЗаголовкаОтчета    = "Счет-фактура № " + дкПолучитьНомерДляПечати(ВыборкаЗапроса.Ссылка.ПолучитьОбъект()) +" от " + Формат(ВыборкаЗапроса.Ссылка.Дата, "ДФ=""дд ММММ гггг""");
				ОбластьМакетаШапка.Параметры.Номер    = дкПолучитьНомерДляПечати(ВыборкаЗапроса.Ссылка.ПолучитьОбъект());
				ОбластьМакетаШапка.Параметры.Дата = Формат(ВыборкаЗапроса.Ссылка.Дата, "ДФ=""дд ММММ гггг""");
			Иначе
				ОбластьМакетаШапка.Параметры.Номер    = "--";
				ОбластьМакетаШапка.Параметры.Дата = "--";
			КонецЕсли;
		КонецЕсли;
	Иначе
		ОбластьМакетаШапка.Параметры.СтатусУПД = 2;
		//заполним номер и дату
		ОбластьМакетаШапка.Параметры.Номер			  = дкПолучитьНомерДляПечати(ДокументОбъект);
		ОбластьМакетаШапка.Параметры.Дата			  = Формат(?(НЕ обЭтотТип(ДокументОбъект, "ДокументОбъект.ЗаказНаряд"), ДокументОбъект.Дата, ?(обЗначениеНеЗаполнено(ДокументОбъект.ДатаЗакрытия), ДокументОбъект.Дата, ДокументОбъект.ДатаЗакрытия)), "ДФ=""дд ММММ гггг""");
		ОбластьМакетаШапка.Параметры.НомерИсправления = "--";
		ОбластьМакетаШапка.Параметры.ДатаИсправления  = "--";
	КонецЕсли;
	
	ОбластьМакетаШапка.Параметры.Валюта = ?(НЕ обЗначениеНеЗаполнено(ДокументОбъект.ВалютаДокумента.НаименованиеПолное), ДокументОбъект.ВалютаДокумента.НаименованиеПолное, ДокументОбъект.ВалютаДокумента.Наименование) + ", " + ДокументОбъект.ВалютаДокумента.Код;
	
	// если дата документа позднее 01.07.2017
	Если ВыводитьКодВидаТовара Тогда
		ОбластьМакетаШапка.Параметры.Редакция = НСтр("ru = '(в редакции постановления Правительства Российской Федерации от 19 августа 2017 № 981)'");
	ИначеЕсли ДокументОбъект.Дата >= Дата('20170701') Тогда
		ОбластьМакетаШапка.Параметры.Редакция = НСтр("ru = '(в редакции постановления Правительства Российской Федерации от 25 мая 2017 г. № 625)'");
	КонецЕсли;
	
	// Выводим область шапки
	ТабДокумент.Вывести(ОбластьМакетаШапка);
	
	// если дата документа позднее 01.07.2017
	Если ДокументОбъект.Дата >= Дата('20170701') Тогда
		ОбластьШапкаИдГосКонтракта = Макет.ПолучитьОбласть("ШапкаИдГосКонтракта");
		ЗаголовокИдентификатораГосударственногоКонтракта = "Идентификатор государственного контракта, договора (соглашения)" + ?(ВыводитьКодВидаТовара, " (при наличии)", "")+": ";
		ОбластьШапкаИдГосКонтракта.Параметры.ИдентификаторГосударственногоКонтракта = ЗаголовокИдентификатораГосударственногоКонтракта + ОбластьШапкаИдГосКонтракта.Параметры.ИдентификаторГосударственногоКонтракта;
		ТабДокумент.Вывести(ОбластьШапкаИдГосКонтракта);
	КонецЕсли;
	
	ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	
	// Уберем колонку, вывод которой утвержден с 1 октября 2017 г.
	ОбластьКодВидаТовара = Макет.Область("КодВидаТовара");
	Если НЕ ВыводитьКодВидаТовара Тогда
		
		НовыйТекст = ОбластьЗаголовокТаблицы.Область(3,ОбластьКодВидаТовара.Лево-1,4,ОбластьКодВидаТовара.Лево-1).Текст;
		
		ОбластьВыреза = ОбластьЗаголовокТаблицы.Область(3,ОбластьКодВидаТовара.Лево-1,4,ОбластьКодВидаТовара.Право);
		ОбластьВыреза.Объединить();
		ОбластьВыреза.Текст = НовыйТекст;
		
		ОбластьВыреза = ОбластьЗаголовокТаблицы.Область(5,ОбластьКодВидаТовара.Лево-1,5,ОбластьКодВидаТовара.Право);
		ОбластьВыреза.Объединить();
		
		ОбластьЗаголовокТаблицы.Параметры.ТекстНомерТаможеннойДекларации = "Номер таможенной декларации";
		
	Иначе
		
		ОбластьЗаголовокТаблицы.Параметры.ТекстНомерТаможеннойДекларации = "Регистрацион- ный номер таможенной декларации";
		
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
	Смещать = ТипСмещенияТабличногоДокумента.ПоВертикали;
	Область = ТабДокумент.Область(?(ДокументОбъект.Дата >= Дата('20170701'),"R17","R16"));
	ТабДокумент.УдалитьОбласть(Область, Смещать); 
	НомерСтраницы	= 2;
	НомерСтраницыПред = НомерСтраницы;

	//заполним параметры шапки таблицы для следующего листа
	ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы  = "Лист " + НомерСтраницы;
	Если ОбластьМакетаШапка.Параметры.Номер <> "--" И ОбластьМакетаШапка.Параметры.Дата <> "--" Тогда
		ОбластьЗаголовокТаблицы.Параметры.ТекстЗаголовка = "Универсальный передаточный документ №"+ОбластьМакетаШапка.Параметры.Номер+" от "+ОбластьМакетаШапка.Параметры.Дата;
	Иначе
		ОбластьЗаголовокТаблицы.Параметры.ТекстЗаголовка = "Универсальный передаточный документ №"+ОбластьМакетаШапка.Параметры.НомерИсправления+" от "+ОбластьМакетаШапка.Параметры.ДатаИсправления;
	КонецЕсли;
	
	Ном = 0;
	
	ОбластьМакетаСтрока = Макет.ПолучитьОбласть("Строка");
	
	// Уберем колонку, вывод которой утвержден с 1 октября 2017 г.
	Если НЕ ВыводитьКодВидаТовара Тогда
		НовыйПараметр = ОбластьМакетаСтрока.Область(1,ОбластьКодВидаТовара.Лево-1,1,ОбластьКодВидаТовара.Лево-1).Параметр;
		ОбластьВыреза = ОбластьМакетаСтрока.Область(1,ОбластьКодВидаТовара.Лево-1,1,ОбластьКодВидаТовара.Право);
		ОбластьВыреза.Объединить();
		ОбластьВыреза.Параметр = НовыйПараметр;
	КонецЕсли;
	
	ОбластьМакетаИтог = Макет.ПолучитьОбласть("Итого");
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакетаПодвалНакладной = Макет.ПолучитьОбласть("ПодвалНакладной");
	
	//доп. области
	мсвДопОбластиПодвала = Новый Массив;
	мсвДопОбластиПодвала.Добавить(ОбластьМакетаИтог);
	мсвДопОбластиПодвала.Добавить(ОбластьМакетаПодвал);
	мсвДопОбластиПодвала.Добавить(ОбластьМакетаПодвалНакладной);
	
	Для Каждого ТекСтрока Из ТаблицаТоваров Цикл
		Ном = Ном + 1;
		
		ОбластьМакетаСтрока.Параметры.Заполнить(ТекСтрока);
		
		//выводим строку, делая проверку попадания на лист		
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакетаСтрока, ОбластьЗаголовокТаблицы, , НомерСтраницы, , ДокументОбъект, ?(Ном=КоличествоСтрок,мсвДопОбластиПодвала,Неопределено));
		
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			НомерСтраницыПред = НомерСтраницы;
			ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Лист " + НомерСтраницы;
		КонецЕсли;
		
	КонецЦикла;
	
	ОбластьМакетаИтог.Параметры.ИтогоСтоимость = Формат(ТаблицаТоваров.Итог("Стоимость"), ФорматВыводаСуммы);
	ОбластьМакетаИтог.Параметры.ИтогоСуммаНДС = Формат(ТаблицаТоваров.Итог("СуммаНДС"), ФорматВыводаСуммы);
	ОбластьМакетаИтог.Параметры.ИтогоВсего = Формат(ТаблицаТоваров.Итог("Всего"), ФорматВыводаСуммы);
	
	//выводим область Итого
	ТабДокумент.Вывести(ОбластьМакетаИтог);
	
	//выводим подвал печатной формы
	
	// Заполним информацию о руководителях организации
	Руководитель = дкОтветственноеЛицо(ДокументОбъект,Перечисления.ВидыОбъектовСведений.Руководитель);
	
	Если ДокументОбъект.Организация.ФормаСобственности=Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
		ОбластьМакетаПодвал.Параметры.ФИОПБОЮЛ=Руководитель.Руководитель;
		ОбластьМакетаПодвал.Параметры.Свидетельство = спПолучитьПодтверждающийДокументОбъектаПоВиду(ДокументОбъект.Организация,Перечисления.ВидыДокументов.Свидетельство);
	Иначе
		ОбластьМакетаПодвал.Параметры.ФИОРуководителя = Руководитель.РуководительПредставление;
	КонецЕсли;
	
	ГлавныйБухгалтер = дкОтветственноеЛицо(ДокументОбъект,Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер);
	ОбластьМакетаПодвал.Параметры.ФИОГлавногоБухгалтера = ГлавныйБухгалтер.ГлавныйБухгалтерПредставление;
	
	ОбластьМакетаПодвал.Параметры.КоличествоЛистов ="Документ 
	|составлен на
	|"+ ТабДокумент.КоличествоСтраниц() +" листах";
	
	ОбластьМакетаПодвал.Параметры.ТекстИндивидуальныйПредприниматель = ?(ВыводитьКодВидаТовара, "Индивидуальный предприниматель или иное уполномоченное лицо", "Индивидуальный предприниматель");
	
	ТабДокумент.Вывести(ОбластьМакетаПодвал);
	
	ОбластьМакетаПодвалНакладной.Параметры.Основание = ?(ЗначениеЗаполнено(ДокументОбъект.ДоговорВзаиморасчетов), ДокументОбъект.ДоговорВзаиморасчетов, "");
	Попытка
		Доверенность = обПолучитьЗначениеСвойства(?(НЕ обЭтотТип(ДокументОбъект, "ДокументОбъект.СчетФактураВыданный"), ДокументОбъект, ДокументОбъект.ДокументОснование),"Доверенность");
		Если ЗначениеЗаполнено(Доверенность) Тогда
			ОбластьМакетаПодвалНакладной.Параметры.Основание = ?(НЕ ЗначениеЗаполнено(ОбластьМакетаПодвалНакладной.Параметры.Основание), "", Строка(ОбластьМакетаПодвалНакладной.Параметры.Основание) + ", ") + Доверенность;
		КонецЕсли;
	Исключение
	КонецПопытки;
	ОбластьМакетаПодвалНакладной.Параметры.Основание = ?(НЕ ЗначениеЗаполнено(ОбластьМакетаПодвалНакладной.Параметры.Основание), "--", ОбластьМакетаПодвалНакладной.Параметры.Основание);
	
	Попытка
		ОбластьМакетаПодвалНакладной.Параметры.ФИОКладовщика = обПолучитьЗначениеСвойства(?(НЕ обЭтотТип(ДокументОбъект, "ДокументОбъект.СчетФактураВыданный"), ДокументОбъект, ДокументОбъект.ДокументОснование),"Отпустил (сотрудник)");
	Исключение
		ОбластьМакетаПодвалНакладной.Параметры.ФИОКладовщика = "";
	КонецПопытки;
	ОбластьМакетаПодвалНакладной.Параметры.ФИОКладовщика = ?(ЗначениеЗаполнено(ОбластьМакетаПодвалНакладной.Параметры.ФИОКладовщика), ОбластьМакетаПодвалНакладной.Параметры.ФИОКладовщика, "");
	Если Строка(ОбластьМакетаПодвалНакладной.Параметры.ФИОКладовщика) <> "" Тогда
		ОбластьМакетаПодвалНакладной.Параметры.ДолжностьКладовщика = ОбластьМакетаПодвалНакладной.Параметры.ФИОКладовщика.Должность.Наименование;
	Иначе
		ОбластьМакетаПодвалНакладной.Параметры.ДолжностьКладовщика = "";
	КонецЕсли;
	Попытка
		ОбластьМакетаПодвалНакладной.Параметры.ДатаОтгрузкиПередачи = обПолучитьЗначениеСвойства(?(НЕ обЭтотТип(ДокументОбъект, "ДокументОбъект.СчетФактураВыданный"), ДокументОбъект, ДокументОбъект.ДокументОснование),"Дата отгрузки");
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ОбластьМакетаПодвалНакладной.Параметры.ДатаОтгрузкиПередачи) Тогда
		ОбластьМакетаПодвалНакладной.Параметры.ДатаОтгрузкиПередачи = ?(НЕ обЭтотТип(ДокументОбъект, "ДокументОбъект.ЗаказНаряд"), ДокументОбъект.Дата, ДокументОбъект.ДатаОкончания);
	КонецЕсли;
	ОбластьМакетаПодвалНакладной.Параметры.ДатаОтгрузкиПередачи = Формат(ОбластьМакетаПодвалНакладной.Параметры.ДатаОтгрузкиПередачи, "ДЛФ=ДД");
	
	Попытка
		ОбластьМакетаПодвалНакладной.Параметры.ФИОМенеджера = ДокументОбъект.Менеджер;
		ОбластьМакетаПодвалНакладной.Параметры.ДолжностьМенеджера = ДокументОбъект.Менеджер.Должность;
	Исключение
	КонецПопытки;
	ОбластьМакетаПодвалНакладной.Параметры.ПредставлениеОрганизации = ОбластьМакетаШапка.Параметры.ПредставлениеПоставщика+", ИНН/КПП "+ОбластьМакетаШапка.Параметры.ИННПоставщика;
	Попытка
		ОбластьМакетаПодвалНакладной.Параметры.ФИОГрузополучателя = обПолучитьЗначениеСвойства(?(НЕ обЭтотТип(ДокументОбъект, "ДокументОбъект.СчетФактураВыданный"), ДокументОбъект, ДокументОбъект.ДокументОснование),"ПолучилКонтрагент");
	Исключение
		ОбластьМакетаПодвалНакладной.Параметры.ФИОГрузополучателя = "";
	КонецПопытки;
	ОбластьМакетаПодвалНакладной.Параметры.ФИОГрузополучателя = ?(ЗначениеЗаполнено(ОбластьМакетаПодвалНакладной.Параметры.ФИОГрузополучателя), ОбластьМакетаПодвалНакладной.Параметры.ФИОГрузополучателя, "");
	Если Строка(ОбластьМакетаПодвалНакладной.Параметры.ФИОГрузополучателя) <> "" Тогда
		ОбластьМакетаПодвалНакладной.Параметры.ДолжностьГрузополучателя = Строка(ОбластьМакетаПодвалНакладной.Параметры.ФИОГрузополучателя.Должность.Наименование);
	Иначе
		ОбластьМакетаПодвалНакладной.Параметры.ДолжностьГрузополучателя = "";
	КонецЕсли;
	
	ОбластьМакетаПодвалНакладной.Параметры.ПредставлениеКонтрагента = ОбластьМакетаШапка.Параметры.ПредставлениеПокупателя+", ИНН/КПП "+ ОбластьМакетаШапка.Параметры.ИННПокупателя;
	ТабДокумент.Вывести(ОбластьМакетаПодвалНакладной);
	
	Возврат ТабДокумент;
	
КонецФункции

	//Бондаренко-- 20190417

//Бондаренко++ 20210128	
Функция НайтиПодразделениеАгента(ПодразделениеКомпании,ОрганизацияАгент)
	
	ЭтоРодитель = НайтиПодчиненные(ПодразделениеКомпании);
	
 	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияКомпании.Ссылка,
		|	ПодразделенияКомпании.Родитель,
		|	ПодразделенияКомпании.Организация
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|ГДЕ
		|	ПодразделенияКомпании.Родитель = &Родитель
		|	И ПодразделенияКомпании.Организация = &ОрганизацияАгент";
	
	Запрос.УстановитьПараметр("ОрганизацияАгент", ОрганизацияАгент);
	
	Если ЭтоРодитель Тогда
		Запрос.УстановитьПараметр("Родитель", ПодразделениеКомпании);
	Иначе	
	    Запрос.УстановитьПараметр("Родитель", ПодразделениеКомпании.Родитель);
	КонецЕсли; 
 	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат	ВыборкаДетальныеЗаписи.Ссылка; 
	КонецЦикла;
	
 	Возврат Справочники.ПодразделенияКомпании.ПустаяСсылка();
 
КонецФункции // НайтиПодразделениеАгента((ПодразделениеКомпании,ОрганизацияАгент)

Функция НайтиПодчиненные(ПодразделениеКомпании)
 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияКомпании.Ссылка,
		|	ПодразделенияКомпании.Родитель
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|ГДЕ
		|	ПодразделенияКомпании.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель", ПодразделениеКомпании);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь; 
 
КонецФункции // НайтиПодчиненные(ПодразделениеКомпании)
//Бондаренко-- 20210128	

//Бондаренко++ 20180720 
Процедура СМГ_ТипОснованияЗаказПоставщику(Основание)
 	Если ТипЗнч(Основание)=Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ДокументОснование = Основание;
		ХозОперация = Справочники.ХозОперации.РеализацияТоваров;
		Контрагент = Неопределено; 
		ДоговорВзаиморасчетов = Неопределено;
		ТипЦен = обПраво("ОсновнойТипЦенПродажи",Права,,ЭтотОбъект);
		//Бондаренко++ 20230815
		Если Не обЗначениеНеЗаполнено(Основание.Контрагент) Тогда
			Если Основание.Контрагент.НашаФирма Тогда
				Попытка 
					ПодразделениеКонтрагента = Основание.ПодразделениеКомпании.Родитель;
					Контрагент = Основание.Контрагент;
  				Исключение
 				КонецПопытки; 
 			КонецЕсли;
 		КонецЕсли;
		//Бондаренко-- 20230815
	КонецЕсли;
 КонецПроцедуры
//Бондаренко-- 20180720 	

Процедура СМГ_АгентскоеВознаграждение()
	
	ХозОперация=Справочники.ХозОперации.АктОбОказанииУслуг;
	ОптоваяПродажа=Ложь;
	ИсточникИнформации = Справочники.ИсточникиИнформации.ЛичныйВизит;
	ОрганизацияАгент = Справочники.Организации.НайтиПоРеквизиту("ИНН","262804044870");
	Если Организация <> ОрганизацияАгент Тогда
		Организация = ОрганизацияАгент;
	КонецЕсли; 
	ПодразделениеКомпании = НайтиПодразделениеАгента(ПодразделениеКомпании,ОрганизацияАгент);
	ДоговорВзаиморасчетов = СМ_ABCP.НайтиСоздатьДоговор(Контрагент,Организация,ПодразделениеКомпании);
	Товары.Очистить();
	НовСтрока = Товары.Добавить();
	НовСтрока.Номенклатура = Справочники.Номенклатура.АгентскоеВознаграждение;
	НовСтрока.ЕдиницаИзмерения = Справочники.Номенклатура.АгентскоеВознаграждение.ОсновнаяЕдиницаИзмерения;
	НовСтрока.ИдентификаторТовара = Новый УникальныйИдентификатор();
	НовСтрока.Количество = 1;
	НовСтрока.КоличествоБазовое = 1;
	НовСтрока.Коэффициент=1;
	Если Организация.ОсвобожденОтНДС Тогда
		НовСтрока.СтавкаНДС=Справочники.СтавкиНДС.БезНДС;
	Иначе
		НовСтрока.СтавкаНДС=Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
	КонецЕсли;
	НовСтрока.Цена = 5000;
	НовСтрока.Сумма = НовСтрока.Цена*НовСтрока.Количество*НовСтрока.Коэффициент;
	НовСтрока.СуммаВсего = НовСтрока.Сумма;
	НовСтрока.СуммаНДС = НовСтрока.СуммаВсего*НовСтрока.СтавкаНДС.Ставка/(100+НовСтрока.СтавкаНДС.Ставка);
	
	
КонецПроцедуры

Функция СМГ_ПередЗаписью(РежимЗаписи)

	флОтказ = Ложь;
	
	//Бондаренко++ 20230718
	Если НЕ ИзмененаСуммаНДС Тогда
	//Бондаренко-- 20230718	
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("НеПерерасчитыватьЦену",Ложь);
		ОбработкаРеквизита("Организация",,,ДопПараметры);
	//Бондаренко++ 20230718	
	КонецЕсли;
    //Бондаренко-- 20230718
  	Если Дата >= Дата(2021,3,1) Тогда
		Если Организация.КонтрагентОрганизации.Родитель=Справочники.Контрагенты.ДопОборудование Тогда
			Если Контрагент.НашаФирма Тогда
 				Если Контрагент.ИНН <> "616714023180" Тогда
 	 				#Если НаКлиенте Тогда
						Сообщить("ОШИБКА! Организации <"+Организация+"> запрещено реализовывать товары на <"+Контрагент+">",СтатусСообщения.ОченьВажное);
					#КонецЕсли 
					флОтказ = Истина;
					Возврат флОтказ;
 				КонецЕсли; 
  			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	
 	//Бондаренко++ 20250312
	Если РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения Тогда
		ЭтоОптоваяПродажа = Ложь;
		Если Не обЗначениеНеЗаполнено(ДокументОснование) Тогда
			Если ТипЗНЧ(ДокументОснование)=Тип("ДокументСсылка.РеализацияТоваров") Тогда
				Если ДокументОснование.ОптоваяПродажа Тогда
					ЭтоОптоваяПродажа = Истина;
				Иначе						
					Если Не обЗначениеНеЗаполнено(ДокументОснование.ДокументОснование) Тогда
						Если ТипЗНЧ(ДокументОснование.ДокументОснование)=Тип("ДокументСсылка.РеализацияТоваров") Тогда
							Если ДокументОснование.ДокументОснование.ОптоваяПродажа Тогда
								ЭтоОптоваяПродажа = Истина;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если  НЕ ( РольДоступна("ПолныеПрава") ИЛИ РольДоступна("СМ_АудиторСервиса") ИЛИ РольДоступна("СМ_Бухгалтер") ИЛИ (ЭтоОптоваяПродажа И РольДоступна("СМ_МенеджерОтделаЗапасныхЧастейОпт") ) ) Тогда
				#Если НаКлиенте Тогда
					Сообщить("ОШИБКА! Вам запрещено распроводить документ Реализация товаров.",СтатусСообщения.ОченьВажное);
				#КонецЕсли	
			флОтказ=Истина; 
			Возврат флОтказ;
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;	
	//Бондаренко-- 20250312
 	
	//Бондаренко-- 20250311
	
	//Бондаренко++ 20230324
	//ФокусАвтоОрганизация        = Справочники.Организации.НайтиПоРеквизиту("ИНН","6168074067");
	//ФокусАвтоКонтрагент         = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН","6168074067");	
	// АтлантМоторсОрганизация     = Справочники.Организации.НайтиПоРеквизиту("ИНН","6167104657");
	//АтлантМоторсКонтрагент      = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН","6167104657");	
	// СимволВолгодонскОрганизация = Справочники.Организации.НайтиПоРеквизиту("ИНН","6168071500");
	//СимволВолгодонскКонтрагент  = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН","6168071500");	
	//  Если Дата >= Дата(2023,1,1) И Не РольДоступна("ПолныеПрава") Тогда
	//	Если ( Организация = ФокусАвтоОрганизация        И Контрагент = АтлантМоторсКонтрагент )    ИЛИ  //Фокус Авто ООО        -> Атлант Моторс ООО
	//		 ( Организация = АтлантМоторсОрганизация     И Контрагент = ФокусАвтоКонтрагент )       ИЛИ  //Атлант Моторс ООО     -> Фокус Авто ООО
	//		 ( Организация = СимволВолгодонскОрганизация И Контрагент = АтлантМоторсКонтрагент )     //Символ Волгодонск ООО -> Атлант Моторс ООО
	//		 //Бондаренко++ 20230115
	//		 // ИЛИ ( Организация = АтлантМоторсОрганизация И Контрагент = СимволВолгодонскКонтрагент )     //Атлант Моторс ООО     ->  Символ Волгодонск ООО 
	//		 //Бондаренко-- 20230115
	// 		 Тогда
	//		#Если НаКлиенте Тогда
	//			Сообщить("Ошибка! Организации <"+Организация+"> запрещено реализовывать товары и/или услуги на <"+Контрагент+">",СтатусСообщения.ОченьВажное);
	//		#КонецЕсли 
	//		флОтказ = Истина;
	//		Возврат флОтказ;
	//	КонецЕсли; 
	//КонецЕсли; 
	//Бондаренко-- 20230324
  	
 	Если НЕ обЗначениеНеЗаполнено(ДокументОснование) Тогда
		Если ДокументОснование=Ссылка Тогда
			#Если НаКлиенте Тогда
			Сообщить("ОШИБКА! Реквизит ДокументОснование = '"+ДокументОснование+"' и является ссылкой на сам документ.",СтатусСообщения.ОченьВажное);
			#КонецЕсли 
			флОтказ = Истина;
			Возврат флОтказ;
		КонецЕсли;
 		Если обЗначениеНеЗаполнено(Менеджер) Тогда
			Если НЕ обЗначениеНеЗаполнено(ДокументОснование.Автор.Сотрудник) Тогда
 				Менеджер = ДокументОснование.Автор.Сотрудник; 
			Иначе	
 				#Если НаКлиенте Тогда
				Сообщить("ОШИБКА! В документе-основании: '"+ДокументОснование+"' у автора: "+ДокументОснование.Автор+" не заполнен реквизит Сотрудник.",СтатусСообщения.ОченьВажное);
				#КонецЕсли 
			КонецЕсли; 		
   		КонецЕсли; 
   	КонецЕсли; 
 	
 	Если Не обЗначениеНеЗаполнено(Дата) Тогда
		Если Дата > '20170630' Тогда
			Попытка
				Если Не ПодразделениеКомпании.ОПЗарегистрировано Тогда
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ ПЕРВЫЕ 1
					|	ПодразделенияКомпании.Ссылка,
					|	ПодразделенияКомпании.Организация,
					|	ПодразделенияКомпании.ОПЗарегистрировано
					|ИЗ
					|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
					|ГДЕ
					|	ПодразделенияКомпании.ОПЗарегистрировано = ИСТИНА
					|	И ПодразделенияКомпании.Организация = &ВыбОрганизация";
					
					Запрос.УстановитьПараметр("ВыбОрганизация", Организация);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						ПодразделениеКомпании = ВыборкаДетальныеЗаписи.Ссылка;
 						ЭтотОбъект.УстановитьНовыйНомер();
						Прервать;
 					КонецЦикла;
				КонецЕсли;
			Исключение
				//
			Конецпопытки;
 		КонецЕсли; 
	КонецЕсли;
	
 	Если Не ОбъединеннаяРеализация тогда	
		ВыборкаТовары = ЭтотОбъект.Товары;
 		Если НЕ ЭтотОбъект.НеМенятьПорядокСтрок Тогда
			ВыборкаТовары.Сортировать("Ячейка Убыв");
 		КонецЕсли; 
 	КонецЕсли;
	
	Если  РежимЗаписиДокумента.Проведение = РежимЗаписи  и Организация.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо И ХозОперация = Справочники.ХозОперации.РеализацияТоваров  и Организация.НельзяРеализовыватьЗапчасти тогда
 		#Если НаКлиенте Тогда  
		Сообщить("С этой организации нельзя реализовывать запчасти.");
		#КонецЕсли 
		флОтказ = Истина;
	    Возврат флОтказ;
	КонецЕсли;	
	
	Попытка
		ОбъектЗаказчик = Контрагент.ПолучитьОбъект();
		ОбъектЗаказчик.Записать();
	Исключение
 		#Если НаКлиенте Тогда  
			СМГ_Сообщить("ОШИБКА! Не удалсь записать контрагента """+СокрЛП(Контрагент)+"""",СтатусСообщения.ОченьВажное);
		#КонецЕсли 		
		флОтказ = Истина;
		Возврат флОтказ;
	КонецПопытки;
 
 	Если Не обЗначениеНеЗаполнено(Дата) Тогда
		Если Дата > '20241212' Тогда
 			Если Не ПодразделениеКомпании.ОПЗарегистрировано Тогда
				#Если НаКлиенте Тогда
					Сообщить("Выбранное подразделение '" + ПодразделениеКомпании + "' не зарегистрировано, реализация запрещена!", СтатусСообщения.ОченьВажное);
				#КонецЕсли
				флОтказ = Истина;
				Возврат флОтказ;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоНовый() И НЕ флОтказ Тогда
		НомерДляЖурнала = РегистрыСведений.НумерацияСкладскихДокументов.УстановитьНовыйНомер(ТекущаяДата());
	КонецЕсли;
 	
 	Если Не Контрагент.Пустая() И Контрагент.НашаФирма Тогда
		Если обЗначениеНеЗаполнено(ПодразделениеКонтрагента) Тогда
			Если Не обЗначениеНеЗаполнено(ДокументОснование) Тогда
				Попытка
					ПодразделениеКонтрагента = ДокументОснование.ДокументОснование.ПодразделениеКомпании;
				Исключение
					//			
				КонецПопытки;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 	
 	
 	Если Не обЗначениеНеЗаполнено(Контрагент.ИНН) Тогда
		Если Не обЗначениеНеЗаполнено(Организация.ИНН) Тогда
			Если СокрЛП(Контрагент.ИНН) = СокрЛП(Организация.ИНН) Тогда
				#Если НаКлиенте Тогда
					Сообщить("ОШИБКА! Реализация от организации '" + Организация+ "' самой себе, т.е. контрагенту: '"+Контрагент+"', запрещена!", СтатусСообщения.ОченьВажное);
				#КонецЕсли
				//Бондаренко++ 20250301
				Если Не РольДоступна("ПолныеПрава") Тогда
				//Бондаренко-- 20250301	
					флОтказ = Истина;
					Возврат флОтказ;
				//Бондаренко++ 20250301	
				КонецЕсли;
				//Бондаренко-- 20250301
 			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
	
	//Бондаренко++ 20220511
	//Если ЗаказНаряды.Количество() > 0 Тогда
	//	ТЗ = ЗаказНаряды.Выгрузить();
	//	ТЗ.Колонки.Добавить("Количество");		
	//	Для каждого Стр Из ТЗ Цикл
	// 		Стр.Количество = 1;
	//	КонецЦикла;		
	//	ТЗ.Свернуть("ЗаказНаряд","Количество");
	//	Для каждого Стр Из ТЗ Цикл
	//	    Если Стр.Количество = 1 Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		    НомераСтрок = "";
	//		    Отбор = Новый Структура;
	//			Отбор.Вставить("ЗаказНаряд",Стр.ЗаказНаряд);
	//			НайденныеСтроки = ЗаказНаряды.НайтиСтроки(Отбор);
	//			Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
	//				Если НомераСтрок <> "" Тогда
	//					НомераСтрок = НомераСтрок+","+Строка(НайденнаяСтрока.НомерСтроки);
	//				Иначе	
	//					НомераСтрок = Строка(НайденнаяСтрока.НомерСтроки);					
	//				КонецЕсли;					
	// 			КонецЦикла;
	//			#Если НаКлиенте Тогда
	//				Сообщить("Внимание! '" + Стр.ЗаказНаряд+ "' встретился в списке заказ-нарядов "+Стр.Количество+?(Стр.Количество < 5," раза."," раз. ")+"Номера найденных строк:"+НомераСтрок+".", СтатусСообщения.Внимание);
	//			#КонецЕсли
	//			//флОтказ = Истина;
	// 	КонецЦикла;	
	//КонецЕсли;
 	//Бондаренко-- 20220511  
	
	//Бондаренко++ 20240613                           
	//Если РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда
	//	Если ХозОперация = Справочники.ХозОперации.АктОбОказанииУслуг Тогда
	//		Если Сводный Тогда
	//			ЗаказНарядыКоличество = ЗаказНаряды.Количество();
	//			ТоварыКоличество = Товары.Количество();
	//			//Бондаренко++ 20250118
	//			АвтомобилиКоличество = Автомобили.Количество();   
	//			//Если ЗаказНарядыКоличество <> ТоварыКоличество Тогда
	//			//Бондаренко 20250118
	//			Если (ЗаказНарядыКоличество <> ТоварыКоличество) И АвтомобилиКоличество = 0 Тогда
	//				#Если НаКлиенте Тогда
	//					Сообщить("ОШИБКА! Количество заказ-нарядов "+ЗаказНарядыКоличество+" а количество Товаров "+ТоварыКоличество+". Запись прервана.", СтатусСообщения.ОченьВажное);
	//				#КонецЕсли
	//				флОтказ = Истина;
	//			КонецЕсли;
	//		КонецЕсли;	
	//	КонецЕсли;
	//КонецЕсли;
 	//Бондаренко-- 20240613	
 		
	//Бондаренко++ 20240606                           
	//Если РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда
	// 	Если ХозОперация = Справочники.ХозОперации.АктОбОказанииУслуг Тогда
	// 		Если ЗаказНаряды.Количество() > 0 Тогда
	//			ЗаказНарядыИтогСуммаПоАкту = ЗаказНаряды.Итог("СуммаПоАкту");
	//			ТоварыИтогСуммаВсего = Товары.Итог("СуммаВсего");
	//			Если  ЗаказНарядыИтогСуммаПоАкту <> ТоварыИтогСуммаВсего Тогда
	//				#Если НаКлиенте Тогда
	//					Сообщить("ОШИБКА! Сумма заказ-нарядов "+ЗаказНарядыИтогСуммаПоАкту+" а сумма Товаров "+ТоварыИтогСуммаВсего+". Запись прервана.", СтатусСообщения.ОченьВажное);
	//				#КонецЕсли
	//				флОтказ = Истина;
	//			КонецЕсли;
	//		КонецЕсли;	
	//	КонецЕсли;
	//КонецЕсли;
 	//Бондаренко-- 20240606	
    	
	СуммаНДС =  Товары.Итог("СуммаНДС");
	
	Возврат флОтказ;
 
КонецФункции // СМГ_ПередЗаписью()

Функция СМГ_ОбработкаУдаленияПроведения()
	
	флОтказ = Ложь;
	
	// Если ЭтотОбъект.ХозОперация=Справочники.ХозОперации.РеализацияТоваров Тогда
	//	Если ЭтотОбъект.СкладКомпании.ТипСклада <> Перечисления.ТипыСкладов.Хозяйстенный Тогда
	//		Если РольДоступна("СМ_КассирОформитель") ИЛИ РольДоступна("СМ_ОператорСервисБюро") Тогда
	// 			Если НЕ ( РольДоступна("СМ_Кладовщик") ИЛИ РольДоступна("СМ_ЗаведующийСкладом") ИЛИ РольДоступна("ПолныеПрава") ИЛИ РольДоступна("СМ_АудиторСервиса") ) Тогда
	// 				#Если НаКлиенте Тогда
	//					Сообщить("ОШИБКА! 'Кассир-оформитель' и 'Оператор сервиса' не имеют права распроводить документ с хозоперацией <<Реализация товаров>> с нехозяйственного склада",СтатусСообщения.ОченьВажное);
	//				#КонецЕсли	
	//				флОтказ = Истина;
	//				Возврат флОтказ;
	// 			КонецЕсли; 
	// 		КонецЕсли; 
	//	КонецЕсли; 
	//КонецЕсли;
	
	////Бондаренко++ 20220309
	//Если Не ФлОтказ Тогда
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	СчетФактураВыданный.Ссылка,
	//	|	СчетФактураВыданный.ДокументОснование,
	//	|	СчетФактураВыданный.Проведен
	//	|ИЗ
	//	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	//	|ГДЕ
	//	|	СчетФактураВыданный.ДокументОснование = &ДокументОснование
	//	|	И СчетФактураВыданный.Проведен = ИСТИНА";
	//	
	//	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	//	
	//	ТЗ =  Запрос.Выполнить().Выгрузить();
	//	
	//	Если ТЗ.Количество() > 0 Тогда
	//		СФ_выданный = ТЗ[0].Ссылка.ПолучитьОбъект();
	// 		СФ_выданный.ПометкаУдаления = Ссылка.ПометкаУдаления;
	// 		Попытка
	//			СФ_выданный.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	//		Исключение
	//			#Если Клиент Тогда
	//				Сообщить("ОШИБКА! Не удалось снять с проведения <"+СФ_выданный+">");			 
	//			#КонецЕсли
	//		КонецПопытки;
	//	КонецЕсли;
	// 	
	//КонецЕсли;	
	////Бондаренко-- 20220309
	
	Возврат флОтказ;

КонецФункции // СМГ_ОбработкаУдаленияПроведения()()

//Бондаренко++ 20250118
Процедура ВывестиЗаголовокСуммаДокументаМоя(ЭтаФорма) Экспорт
	Мет = ЭтаФорма.ЭтотОбъект.Метаданные();
	Для Каждого ТаблЧасть Из Мет.ТабличныеЧасти Цикл
		Попытка ЭтаФорма.ЭлементыФормы.ОсновнаяПанель.Страницы[ТаблЧасть.Имя].Заголовок = СокрЛП(ТаблЧасть.Синоним) + " (" + СокрЛП(ЭтаФорма[ТаблЧасть.Имя].Количество()) + " поз.)"; Исключение КонецПопытки;
 	КонецЦикла; 
КонецПроцедуры // ВывестиЗаголовокСуммаДокументаМоя()
//Бондаренко-- 20250118

//Бондаренко++ 20220422 
//Организации Мкртчян запрещено пререпродавать товары нашим фирмам в том числе и через механизм автоматических перепродаж.
Функция СМГ_ЗапретПерепродажОтМкртчян()
	
	ФлагОтказ = Ложь;
	
	Для каждого Стр Из Товары Цикл
		Если Стр.СкладКомпании.Организация.ИНН = "616714023180" Тогда
			// т.е. организацией является Мкртчян К.А. ИП        
			Если Стр.СкладКомпании.Организация<>Организация Тогда 
				ФлагОтказ = Истина;
				#Если НаКлиенте Тогда
					Сообщить("Ошибка! Организации <"+Стр.СкладКомпании.Организация+"> запрещено перепродавать товары контрагенту <"+Организация.КонтрагентОрганизации+">",СтатусСообщения.ОченьВажное);
				#КонецЕсли 	
 				Прервать; 
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат ФлагОтказ;
	
КонецФункции // СМГ_ЗапретПерепродажОтМкртчян() 

//Запрет заполненности колонки СкладКомпании в табличной части Товары
Функция СМГ_ПроверитьПотребностьВВыполненииПерепродаж()
	
	ФлагОтказ = Ложь;
	
	Если Контрагент.НашаФирма И ХозОперация = Справочники.ХозОперации.РеализацияТоваров Тогда
		Для каждого стр Из Товары Цикл
			Если НЕ обЗначениеНеЗаполнено(стр.СкладКомпании) Тогда
				ФлагОтказ = Истина;
				#Если НаКлиенте Тогда
				Сообщить("ОШИБКА! При наличии складов в табличной части 'Товары' проведение выполняется только через кнопку 'Перепродажи'. "+Формат(ТекущаяДата(),"ДЛФ=T"), СтатусСообщения.ОченьВажное);
				#КонецЕсли 	
				Прервать; 
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;	 
	
	Возврат ФлагОтказ; 
	
КонецФункции // СМГ_ПроверкаСкладовВТаблицеТовары(РежимЗаписи)

 //Для типа цен Уценка проверяется заполненность этой цены у каждой номенклатцры и, кроме того, чтобы цена в строке не оказалась ниже.
Функция СМГ_ПроверкаТоваровПоЦенамУценки()
	
	ФлагОтказ = Ложь;
	
 	Если ХозОперация = Справочники.ХозОперации.РеализацияТоваров И ТипЦен = Справочники.ТипыЦен.ЦенаУценки Тогда
		ФлагОбнаруженыСуммыНижеЦеныУценки = Ложь;
		ТекстОшибки = "";
		Для каждого ТекСтрока Из Товары Цикл
			ЦенаУценки = 0;
			ЦенаУценки = обПолучитьЦену(ТипЦен,ТекСтрока.Номенклатура,,,ЭтотОбъект.ВалютаДокумента,ЭтотОбъект.КурсДокумента,,ТекСтрока.ЕдиницаИзмерения,Справочники.ПодразделенияКомпании.ОсновноеПодразделение);
			Если ЦенаУценки = 0 Тогда
				ФлагОтказ = Истина;
				#Если НаКлиенте Тогда
				Сообщить("ОШИБКА! Для номенклатуры ["+ТекСтрока.Номенклатура.Артикул + "]"+ТекСтрока.Номенклатура+"не задана цена уценки. Проведение документа прервано.", СтатусСообщения.ОченьВажное);
				#КонецЕсли 	
				Прервать;
			КонецЕсли; 
			Если ТекСтрока.Цена < ЦенаУценки Тогда
				Если ФлагОбнаруженыСуммыНижеЦеныУценки Тогда
					ТекстОшибки = СокрЛП(ТекстОшибки)+", "+СокрЛП(ТекСтрока.НомерСтроки);
				Иначе
					ТекстОшибки = СокрЛП(ТекСтрока.НомерСтроки);
					ФлагОбнаруженыСуммыНижеЦеныУценки = Истина;
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла;
		Если ФлагОбнаруженыСуммыНижеЦеныУценки Тогда
			ФлагОтказ = Истина;
			#Если НаКлиенте Тогда
			Сообщить("ОШИБКА! В табличной части 'Товары' обнаружены цены ниже уценки. Номера строк:  " + ТекстОшибки + ". Проведение документа прервано.", СтатусСообщения.ОченьВажное);
			#КонецЕсли 	
 		КонецЕсли;			
	КонецЕсли;
	
	Возврат ФлагОтказ;
	
КонецФункции // СМГ_ПроверкаТоваровПоЦенамУценки(РежимЗаписи)
//Бондаренко-- 20220422

Функция СМГ_ОбработкаПроведения()
	
	флОтказ = Ложь;
	
	//Бондаренко++ 20220422
	
	//флОтказ = СМГ_ПроверитьПотребностьВВыполненииПерепродаж();
	//Если флОтказ Тогда
	//	Возврат флОтказ;
	//КонецЕсли;
	// 
	//Если Дата > Дата(2022,2,1) Тогда
	//	флОтказ = СМГ_ЗапретПерепродажОтМкртчян(); 
	//	Если флОтказ Тогда
	//		Возврат флОтказ;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//флОтказ = СМГ_ПроверкаТоваровПоЦенамУценки();
	//Если флОтказ Тогда
	//	Возврат флОтказ;
	//КонецЕсли;
  	//Бондаренко-- 20220422
  	 
	//Если Дата > Дата(2018,12,17) Тогда
	//	Если Товары.Количество()=0 Тогда
	//		#Если НаКлиенте Тогда
	//			Сообщить("ОШИБКА! Табличная часть 'Товары' пустая",СтатусСообщения.ОченьВажное);	
	//		#КонецЕсли 	
	//		флОтказ = Истина;
	//		Возврат флОтказ;
	//	КонецЕсли; 
	//КонецЕсли;
	
	//Бондаренко++ 20240606
	//Если ХозОперация = Справочники.ХозОперации.АктОбОказанииУслуг И ЗаказНаряды.Количество() > 0 Тогда
	//	Движения.ВзаиморасчетыКомпании.Очистить();
	//	Для Каждого ТекСтрокаСостав Из ЗаказНаряды Цикл
	//		Движение = Движения.ВзаиморасчетыКомпании.Добавить();
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//		Движение.Период = Дата;
	// 		Движение.Контрагент=ТекСтрокаСостав.ЗаказНаряд.Контрагент;
	//		Движение.ДоговорВзаиморасчетов = ТекСтрокаСостав.ЗаказНаряд.ДоговорВзаиморасчетов;
	//		Движение.Сделка=ТекСтрокаСостав.ЗаказНаряд;
	// 		Движение.Сумма = ТекСтрокаСостав.СуммаПоАкту;
	//		Движение.СуммаУпр = ТекСтрокаСостав.СуммаПоАкту;
	//		Движение.СуммаБаз = ТекСтрокаСостав.СуммаПоАкту;
	// 		Движение.ВидОперации = ХозОперация ;
	//		Движение.ВидОперации=Перечисления.ВидыОперацийВзаиморасчетов.ПогашениеДебиторскойЗадолженности;
	//	КонецЦикла;	
	//КонецЕсли;
	//Бондаренко-- 20240606
		
	//Если Дата >= Дата(2021,04,15) Тогда
	//	Если Не обЗначениеНеЗаполнено(Контрагент) Тогда
	//		Если Товары.Количество() > 0 Тогда                       
	//			//Бондаренко++ 20220318
	//			Если Не СМ_ПерепродажиЗапчастей.ПерепродажаРазрешена(Ссылка) Тогда
	//			//Бондаренко-- 20220318	
	//				#Если НаКлиенте Тогда
	//					Сообщить("ОШИБКА! Для такого сочетания Контрагента и складов реализация запрещена.",СтатусСообщения.ОченьВажное);	
	//				#КонецЕсли 	
	//				флОтказ = Истина;
	//				Возврат флОтказ;
	//			КонецЕсли; 		
	//		КонецЕсли; 
	//	КонецЕсли; 
	//КонецЕсли; 
	// 
	// Если Не обЗначениеНеЗаполнено(Контрагент) Тогда
	//	Если Не обЗначениеНеЗаполнено(ДоговорВзаиморасчетов) Тогда
	//		Если Дата > Дата(2020,09,01) Тогда
	//			Если Не Контрагент.НашаФирма Тогда
	//  				Если ОптоваяПродажа Тогда
	// 					
	//					ТекущаяДата = ТекущаяДата();
	//					СтруктураОтбора = Новый Структура("Контрагент, ДоговорВзаиморасчетов", Контрагент, ДоговорВзаиморасчетов);
	//					
	//					Если обЗначениеНеЗаполнено(Дата) Тогда
	//						МоментВремени = Новый МоментВремени(КонецДня(ТекущаяДата));
	//					Иначе
	//						МоментВремени = КонецДня(Дата);
	//					КонецЕсли;
	//					
	//					тзОбщДолгиПоДоговорам = РегистрыНакопления.ВзаиморасчетыКомпании.Остатки(МоментВремени,СтруктураОтбора,,"Сумма");
	//					тзОбщДолгиПоДоговорам.Свернуть("ДоговорВзаиморасчетов","Сумма"); 
	//					
	//					СтрОстатокЧислоПоКонтру = тзОбщДолгиПоДоговорам.Итог("Сумма");
	//					СтрОстатокСтрокаПоКонтру = Формат(СтрОстатокЧислоПоКонтру,"ЧЦ=15; ЧДЦ=2");
	//					
	//					Запрос = Новый Запрос;
	//					
	//					СпРодителей = Новый СписокЗначений;
	//					СпРодителей.Добавить(Справочники.ХозОперации.ОтгрузкаТМЦ);
	// 					
	//					Запрос = Новый Запрос;
	//					Запрос.Текст = 
	//					"ВЫБРАТЬ
	//					|	ВзаиморасчетыКомпанииОстатки.Контрагент,
	//					|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов,
	//					|	ВзаиморасчетыКомпанииОстатки.Сделка,
	//					|	ВзаиморасчетыКомпанииОстатки.СуммаОстаток КАК Сумма,
	//					|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.СрокОплатыЗадолженности КАК СрокОплатыЗадолженности,
	//					|	ВзаиморасчетыКомпанииОстатки.Сделка.Дата КАК ДатаСделки,
	//					|	ВзаиморасчетыКомпанииОстатки.Сделка.ХозОперация.Родитель,
	//					|	ДОБАВИТЬКДАТЕ(ВзаиморасчетыКомпанииОстатки.Сделка.Дата, ДЕНЬ, ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.СрокОплатыЗадолженности) КАК ОплатитьДо
	//					|ИЗ
	//					|	РегистрНакопления.ВзаиморасчетыКомпании.Остатки(&ДатаРасчета, ) КАК ВзаиморасчетыКомпанииОстатки
	//					|ГДЕ
	//					|	ВзаиморасчетыКомпанииОстатки.Контрагент = &Контрагент
	//					|	И ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов
	//					|	И ВзаиморасчетыКомпанииОстатки.Сделка.ХозОперация.Родитель В(&СпРодителей)
	//					|
	//					|УПОРЯДОЧИТЬ ПО
	//					|	ОплатитьДо УБЫВ,
	//					|	ДатаСделки УБЫВ";
	//					
	//					Если обЗначениеНеЗаполнено(Дата) Тогда
	//						ДатаРасчета = КонецДня(ТекущаяДата);
	//					Иначе
	//						ДатаРасчета = КонецДня(Дата);
	//					КонецЕсли;
	//					
	//					Запрос.УстановитьПараметр("Контрагент", Контрагент);
	//					Запрос.УстановитьПараметр("ДоговорВзаиморасчетов", ДоговорВзаиморасчетов);
	//					Запрос.УстановитьПараметр("СпРодителей", СпРодителей);
	//					Запрос.УстановитьПараметр("ДатаРасчета", ДатаРасчета);
	//					тзОбщДолги = Запрос.Выполнить().Выгрузить();
	//					
	//					ЕстьПросроченныеОплаты = Ложь;
	//					
	//					Для каждого Стр Из тзОбщДолги Цикл
	//						#Если Клиент Тогда
	//						ОбработкаПрерыванияПользователя();
	//						#КонецЕсли
	//						СтрОстатокЧисло = 0;
	//						НайдСтрокаОбщДолга = тзОбщДолгиПоДоговорам.Найти(Стр.ДоговорВзаиморасчетов,"ДоговорВзаиморасчетов");
	//						Если НайдСтрокаОбщДолга <> Неопределено Тогда
	//							СтрОстатокЧисло = НайдСтрокаОбщДолга.Сумма;	 
	//						КонецЕсли;
	//						Если СтрОстатокЧисло > 0 Тогда
	//							СтрОстатокЧисло = СтрОстатокЧисло - Стр.Сделка.СуммаДокумента; 
	//							НайдСтрокаОбщДолга.Сумма = СтрОстатокЧисло;
	//							Если СтрОстатокЧисло >= 0  Тогда
	//								ТекДолгПоСделке = Стр.Сделка.СуммаДокумента; 
	//							Иначе	
	//								ТекДолгПоСделке = Стр.Сделка.СуммаДокумента+СтрОстатокЧисло; 
	//							КонецЕсли; 
	//							Если КонецДня(Стр.ОплатитьДо) < ДатаРасчета Тогда
	//								#Если НаКлиенте Тогда
	//									Сообщить("У контагента '"+Контрагент+"' по договору '"+Стр.ДоговорВзаиморасчетов+"' для '"+Стр.Сделка+"' на сумму: "+Формат(ТекДолгПоСделке,"ЧЦ=15; ЧДЦ=2")+" руб., отсрочка составляет: "+Стр.СрокОплатыЗадолженности+" дней и дата платежа: "+Формат(Стр.ОплатитьДо,"ДЛФ=DD=D")+" просрочена.",СтатусСообщения.ОченьВажное);
	//								#КонецЕсли
	//								ЕстьПросроченныеОплаты = Истина;
	//							КонецЕсли; 
	//						КонецЕсли;
	//					КонецЦикла; 
	//					
	//					Если ЕстьПросроченныеОплаты Тогда
	//						флОтказ=Истина;
	//						Возврат флОтказ;
	//					КонецЕсли; 
	//					
	//				КонецЕсли; 
	//			КонецЕсли; 
	//		КонецЕсли; 		
	//	КонецЕсли; 		
	//КонецЕсли; 
	
	//Бондаренко++ 20220511
	// Движения.СМГ_ОплатаГарантийныхЗН.Очистить();
	//Если Дата > Дата(2022,1,1) Тогда
	// 	Для Каждого ТекСтрокаЗаказНаряды Из ЗаказНаряды Цикл
	//		Движение = Движения.СМГ_ОплатаГарантийныхЗН.Добавить();
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//		Движение.Период = Дата;
	//		Движение.ЗаказНаряд = ТекСтрокаЗаказНаряды.ЗаказНаряд;
	// 		Движение.Сумма = ТекСтрокаЗаказНаряды.СуммаПоАкту;
	//	КонецЦикла;
	//КонецЕсли; 			
	//Бондаренко-- 20220511
	
	//Бондаренко++ 20260306
	Движения.БонусныеБаллыДилера.Очистить();
	Если Дата > ДеньЭрЭл Тогда
		Для каждого ТекСтрокаРабочиеЛисты Из РабочиеЛисты Цикл 
			
			Для Сч = 1 По 2 Цикл
				
				Движение = Движения.БонусныеБаллыДилера.Добавить();
				
				//Бондаренко++ 20260417
				Если Сч = 1 Тогда
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.ВариантОстатков = Перечисления.НачисленоПодтверждено.Начислено;
 				Иначе
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.ВариантОстатков = Перечисления.НачисленоПодтверждено.Подтверждено;
				КонецЕсли;
				//Бондаренко-- 20260417

				Движение.Период = Дата; 
				Движение.ПодразделениеКомпании = ТекСтрокаРабочиеЛисты.РабочийЛист.ПодразделениеКомпании;
				Движение.Организация = ТекСтрокаРабочиеЛисты.РабочийЛист.Организация;
				Движение.Автомобиль = ТекСтрокаРабочиеЛисты.РабочийЛист.Автомобиль;
				Движение.Марка = ТекСтрокаРабочиеЛисты.РабочийЛист.Автомобиль.Модель.Марка;
				Движение.Модель = ТекСтрокаРабочиеЛисты.РабочийЛист.Автомобиль.Модель;
				Движение.МаркетинговаяПрограмма = ТекСтрокаРабочиеЛисты.МаркетинговаяПрограмма;
				Движение.ДатаСписанияБонусов = Дата;
				
				//Бондаренко++ 20260417
				Движение.Компенсация = ТекСтрокаРабочиеЛисты.СуммаПоАкту;
				//Бондаренко-- 20260417
				
				//Бондаренко++ 20260311
				Если ТекСтрокаРабочиеЛисты.ВариантКомпенсации = Перечисления.ВариантКомпенсации.ВИнвойсеСледующего Тогда
					Движение.ВариантКомпенсации = Перечисления.ВариантКомпенсации.ВИнвойсеСледующего;
				ИначеЕсли ТекСтрокаРабочиеЛисты.ВариантКомпенсации = Перечисления.ВариантКомпенсации.Ретроспективная Тогда	
					Движение.ВариантКомпенсации = Перечисления.ВариантКомпенсации.Ретроспективная;
				Иначе
					Движение.ВариантКомпенсации = Перечисления.ВариантКомпенсации.ПустаяСсылка();
				КонецЕсли;
				//Бондаренко-- 20260311
				
				Движение.ХозОперация = Справочники.ХозОперации.БонусныеБаллыДилераРасход;
				//Бондаренко++ 20260402
				Если НЕ обЗначениеНеЗаполнено(ТекСтрокаРабочиеЛисты.РабочийЛист) Тогда
					Если НЕ обЗначениеНеЗаполнено(ТекСтрокаРабочиеЛисты.РабочийЛист.ОтгрузкаАвтомобиля) Тогда
						Движение.ФактическаяЦенаПродажиАвто = ТекСтрокаРабочиеЛисты.РабочийЛист.ОтгрузкаАвтомобиля.Сумма;
						Движение.КонтрагентПокупатель = ТекСтрокаРабочиеЛисты.РабочийЛист.ОтгрузкаАвтомобиля.Контрагент;
						Движение.ДатаПродажи = ТекСтрокаРабочиеЛисты.РабочийЛист.ОтгрузкаАвтомобиля.Дата;
						Движение.ДокументРеализации = ТекСтрокаРабочиеЛисты.РабочийЛист.ОтгрузкаАвтомобиля;			
					КонецЕсли;
				КонецЕсли;
				Движение.РабочийЛист = ТекСтрокаРабочиеЛисты.РабочийЛист.Ссылка;
				//Бондаренко++ 20260402
				
				Движение.ДатаРитейла = "";
				Движение.ДатаПодтверждения = "";
				Движение.ДатаПолучения = "";
				
			КонецЦикла;
			
 		КонецЦикла;
  	КонецЕсли;
	//Бондаренко-- 20260306
	
	//Бондаренко++ 20221005
	//Если ХозОперация = Справочники.ХозОперации.РеализацияАгентскихУслуг Тогда 
	//	Если Дата >= Дата(2022,01,01) Тогда
	//		Движение = Движения.ВзаиморасчетыКомпании.Добавить();
	//		Движение.Период = Дата;
	//		Движение.Контрагент = Комитент;
	//		Движение.ДоговорВзаиморасчетов = ДоговорКомитента;
	//		Движение.Сделка = Ссылка;  
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//		Движение.Сумма = СуммаДокумента;
	//		Движение.СуммаУпр = СуммаДокумента;
	//		Движение.СуммаБаз = СуммаДокумента;
	//		Движение.ХозОперация = ХозОперация;
	//		Движение.ВидОперации = Перечисления.ВидыОперацийВзаиморасчетов.НачислениеДебиторскойЗадолженности;
	//		
	//	 	Движение = Движения.ДоходыИРасходы.Добавить();
	//	 	Движение.Период = Дата;
	//		Движение.ПодразделениеКомпании = Ссылка.ПодразделениеКомпании;
	//		Движение.ХозОперация = ХозОперация; 
	// 		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//  		Движение.ДоходУпр    = 0;
	//		Движение.РасходУпр   = СуммаДокумента;
	//		Движение.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.НачислениеДебиторскойЗадолженностиПоУслугам;
	// 	КонецЕсли;
	//КонецЕсли;             
	//Бондаренко-- 20221005
 	
	Возврат флОтказ;
 
КонецФункции // СМГ_ОбработкаПроведения()

Процедура СМГ_СформироватьДвиженияПартийТоваровДляУчета()

 	Если Не Контрагент.НашаФирма Тогда
		
		Если Дата >= Дата(2019,4,24) ИЛИ ЭтоНовый() Тогда
			
 			Движения.ПартииТоваровДляУчета.Очистить();
			Движения.Записать();
			
			ТЗ_товаров = Новый ТаблицаЗначений;
			ТЗ_товаров = ПолучитьТаблицуТоваров();
 			
			СЗ_Товаров = Новый СписокЗначений;
			
			СЗ_Товаров.ЗагрузитьЗначения(Ссылка.Товары.ВыгрузитьКолонку("Номенклатура"));
			
			ТЗ_партий = Новый ТаблицаЗначений;
			ТЗ_партий = ПолучитьТаблицуОстатковПартий(СЗ_Товаров);
 			
			ТЗ_ТоварыДока = Товары.Выгрузить();
			ТЗ_ТоварыДока.Свернуть("Номенклатура","КоличествоБазовое");
			
			Для Каждого ТекСтрокаТовары Из ТЗ_ТоварыДока Цикл
				
 				Если ТекСтрокаТовары.Номенклатура.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.Товар Тогда
					Продолжить;
				КонецЕсли; 
 				
				ТекНоменклатура = ТекСтрокаТовары.Номенклатура; 
				ТребуетсяКол = ТекСтрокаТовары.КоличествоБазовое;
				
				Отбор = Новый Структура;
				Отбор.Вставить("Номенклатура",ТекНоменклатура);
				
				НайдСтроки = ТЗ_партий.НайтиСтроки(Отбор);
				
				ВсегоВналичии = 0;
				Для Каждого СтрокаМассива Из НайдСтроки Цикл
					ВсегоВналичии = ВсегоВналичии + СтрокаМассива.КоличествоОстаток;
				КонецЦикла;
				
				Если ТребуетсяКол > ВсегоВналичии Тогда
					Сообщить("Номенклатуры ["+ТекНоменклатура.Артикул+"] "+ТекНоменклатура+" cписывается по регистру 'Товары для учета'"+ТребуетсяКол+", а в наличии по этому регистру "+ВсегоВналичии);	
					Продолжить;
					//Отказ = Истина;
					//Возврат;
				КонецЕсли;	
				
				Для каждого Эл из НайдСтроки Цикл
					Движение = Движения.ПартииТоваровДляУчета.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
					Движение.ДокументПродажи = Ссылка;
					Движение.Официально = Эл.Официально;
					Движение.Партия = Эл.Партия;
					Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
					Движение.ХозОперация = ХозОперация;
					Движение.ДилерскийЦентр = Эл.Партия.ПодразделениеКомпании.ДилерскийЦентр;
 					Движение.ДилерскийЦентрПродажи = ЭтотОбъект.ПодразделениеКомпании.ДилерскийЦентр;
 					Движение.Количество = Мин(ТребуетсяКол,Эл.КоличествоОстаток);
					Движение.Производитель = ТекСтрокаТовары.Номенклатура.Производитель;
					Если ТребуетсяКол >= Эл.КоличествоОстаток Тогда
						Движение.Сумма = Эл.СуммаОстаток;
					Иначе
						Если Эл.КоличествоОстаток > 0 Тогда
							Движение.Сумма = Эл.СуммаОстаток*Движение.Количество/Эл.КоличествоОстаток;
						Иначе
							Движение.Сумма = 0;	
						КонецЕсли;
					КонецЕсли;
					ТребуетсяКол = ТребуетсяКол - Движение.Количество;
					Если ТребуетсяКол <= 0 Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
			КонецЦикла;
		КонецЕсли; 
	КонецЕсли;
  
КонецПроцедуры

//Бондаренко++ 20220610
Процедура СМГ_ПриЗаписи()
	//Бондаренко++ 20260603
	//СМГ_СоздатьИлиОбновитьСФВыданный();
	//Бондаренко-- 20260603
КонецПроцедуры  //СМГ_ПриЗаписи()
	
Процедура СМГ_СоздатьИлиОбновитьСФВыданный()
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
 	КонецЕсли;
	
	СФ_выданный = Неопределено;
	
	Если СуммаНДС > 0 Тогда
		СФ_выданный = Документы.СчетФактураВыданный.СоздатьДокумент(); 
		СФ_выданный.Комментарий = "Автоматически создан "+СокрЛП(ТекущаяДата());
 	КонецЕсли;
 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка КАК СФ,
	|	СчетФактураВыданный.ДокументОснование,
	|	СчетФактураВыданный.Проведен
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ЭтотОбъект.Ссылка);
 	 
 	Результат = Запрос.Выполнить();		
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СФ_выданный = ВыборкаДетальныеЗаписи.СФ.ПолучитьОбъект();
		//Бондаренко++ 2023207
		Если СФ_выданный.ДоговорВзаиморасчетов <> ЭтотОбъект.ДоговорВзаиморасчетов Тогда
			Попытка
				СФ_выданный.Контрагент = ЭтотОбъект.Контрагент;
				СФ_выданный.ДоговорВзаиморасчетов = ЭтотОбъект.ДоговорВзаиморасчетов;
				СФ_выданный.Грузополучатель = ЭтотОбъект.Контрагент;
				СФ_выданный.Записать(РежимЗаписиДокумента.Запись);
			Исключение
	 		КонецПопытки;
		КонецЕсли;            
		//Бондаренко-- 2023207
  		Прервать;
	КонецЦикла; 
	
	Если СФ_выданный = Неопределено Тогда
		// Так как "СуммаНДС" равна нулю и старый счет-фактура выданный не найден
		Возврат;
 	КонецЕсли;
 	
	СФ_выданный.Заполнить(ЭтотОбъект.Ссылка);
 	СФ_выданный.Дата = ЭтотОбъект.Дата;      
	СФ_выданный.Номер = ЭтотОбъект.Номер;      				
 	
	ФлЭтотОбъектПроведен = ЭтотОбъект.Проведен;
	ФлЭтотОбъектПометкаУдаления = ЭтотОбъект.ПометкаУдаления;
	
	СФ_выданный.Проведен = ФлЭтотОбъектПроведен;			
	СФ_выданный.ПометкаУдаления = ФлЭтотОбъектПометкаУдаления;
	
	Если ФлЭтотОбъектПометкаУдаления Тогда               
		Попытка СФ_выданный.Записать(РежимЗаписиДокумента.Запись); Исключение КонецПопытки; 
	Иначе                                                           
		Если ФлЭтотОбъектПроведен Тогда
			Попытка СФ_выданный.Записать(РежимЗаписиДокумента.Проведение); Исключение КонецПопытки; 					
		Иначе
			Попытка СФ_выданный.Записать(РежимЗаписиДокумента.ОтменаПроведения); Исключение КонецПопытки; 					
		КонецЕсли; 
	КонецЕсли;
 	
КонецПроцедуры //СМГ_СоздатьИлиОбновитьСФВыданный()
//Бондаренко-- 20220610  


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

//Бондаренко++ 20260402
ДеньЭрЭл = обПраво("ДатаНачалаРаботыСКомпенсациями");
//Бондаренко-- 20260402

// сохранение ссылки на коллекцию прав, настроек и окружения
Права                 = Неопределено;
ОбработкаРасчетСкидок = Неопределено;
#Если Клиент Тогда
	Права = глПрава;
	ОбработкаРасчетСкидок = Обработки.РасчетСкидок.Создать();
#КонецЕсли    
