// Модуль документа Корректировка реализации

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;                            // Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;               // Переменная для накопления результатов проведения по модулям наборов записей
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования

Перем ТекущаяВалютаДокумента Экспорт;           // Текущая валюта документа перед изменением
Перем ТекущийКурсДокумента Экспорт;             //Текущий курс документа перед изменением

Перем ИмяРеквизитаКода Экспорт;                 // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/артикула в ТЧ

//Бондаренко++ 20260326
Перем ДеньЭрЭл;
//Бондаренко-- 20260326

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ПолучитьСебестоимостьАвтомобиля(Автомобиль, СписокОснований = Неопределено) Экспорт
	Если СписокОснований = Неопределено Тогда
		СписокОснований = ПолучитьСписокОснований();
	КонецЕсли;
	
	Результат = Новый Структура("Сумма,СуммаУпр,СуммаНДС",0,0,0);
	
	// автомобили
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(ОстаткиАвтомобилей.Сумма) КАК Сумма,
	|	СУММА(ОстаткиАвтомобилей.СуммаУпр) КАК СуммаУпр,
	|	СУММА(ОстаткиАвтомобилей.СуммаНДС) КАК СуммаНДС
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
	|ГДЕ
	|	ОстаткиАвтомобилей.ВидДвижения = &ВидДвижения
	|	И ОстаткиАвтомобилей.Регистратор В(&Регистраторы)
	|	И ОстаткиАвтомобилей.Автомобиль = &Автомобиль
	|	"+?(Сделка.ХозОперация = Справочники.ХозОперации.ПереходВСобственностьАвтомобилей,"И ОстаткиАвтомобилей.СтатусПартии <> &СтатусПартии","")+"";
	
	Запрос.УстановитьПараметр("ВидДвижения"  , ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("Автомобиль"   , Автомобиль);
	Запрос.УстановитьПараметр("Регистраторы" , СписокОснований);
	Запрос.УстановитьПараметр("СтатусПартии" , Перечисления.СтатусыПартий.ТоварОтветственноеХранение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.Сумма    = Результат.Сумма + Выборка.Сумма;
		Результат.СуммаУпр = Результат.СуммаУпр + Выборка.СуммаУпр;
		Результат.СуммаНДС = Результат.СуммаНДС + Выборка.СуммаНДС;
	КонецЕсли;
	
	// получим сумму опций
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(КомплектацияАвтомобилей.Сумма) КАК Сумма,
	|	СУММА(КомплектацияАвтомобилей.СуммаНДС) КАК СуммаНДС,
	|	СУММА(КомплектацияАвтомобилей.СуммаУпр) КАК СуммаУпр
	|ИЗ
	|	РегистрНакопления.КомплектацияАвтомобилей КАК КомплектацияАвтомобилей
	|ГДЕ
	|	КомплектацияАвтомобилей.Автомобиль = &Автомобиль
	|	И КомплектацияАвтомобилей.ВидДвижения = &ВидДвижения
	|	И КомплектацияАвтомобилей.Регистратор В(&Регистраторы)
	|	И КомплектацияАвтомобилей.Номенклатура ССЫЛКА Справочник.Опции
	|"+?(Сделка.ХозОперация = Справочники.ХозОперации.ПереходВСобственностьАвтомобилей,"И КомплектацияАвтомобилей.СтатусПартии <> &СтатусПартии","")+"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.Сумма <> null Тогда
		Результат.Сумма    = Результат.Сумма + Выборка.Сумма;
		Результат.СуммаУпр = Результат.СуммаУпр + Выборка.СуммаУпр;
		Результат.СуммаНДС = Результат.СуммаНДС + Выборка.СуммаНДС;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСписокОснований() Экспорт
	Основания = Новый Массив;
	ТекОснование = ДокументОснование;
	
	Пока ТипЗнч(ТекОснование) <> Тип("ДокументСсылка.ПоступлениеАвтомобилей") Цикл
		Основания.Добавить(ТекОснование);
		ТекОснование = ТекОснование.ДокументОснование;
	КонецЦикла;
	
	Основания.Добавить(ТекОснование);
	
	Возврат Основания;
КонецФункции

Функция ПолучитьСделку(СписокОснований = Неопределено) Экспорт
	Если СписокОснований = Неопределено Тогда
		СписокОснований = ПолучитьСписокОснований();
	КонецЕсли;
	
	Для Каждого Основание Из СписокОснований Цикл
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеАвтомобилей") Тогда
			Возврат Основание;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Документы.ПоступлениеАвтомобилей.ПустаяСсылка();
КонецФункции

Функция ПолучитьТаблицуАвтомобилей() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КорректировкаПоступленияАвтомобилейАвтомобили.Автомобиль,
	|	КорректировкаПоступленияАвтомобилейАвтомобили.СуммаВсегоРазница,
	|	КорректировкаПоступленияАвтомобилейАвтомобили.СуммаНДСРазница,
	|	КорректировкаПоступленияАвтомобилейАвтомобили.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ОстаткиАвтомобилейОстатки.Автомобиль ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьОстаток,
	|	ЕСТЬNULL(ОстаткиАвтомобилейОстатки.СкладКомпании, ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка)) КАК СкладКомпании,
	|	ЕСТЬNULL(ОстаткиАвтомобилейОстатки.СтатусПартии, ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ПустаяСсылка)) КАК СтатусПартии,
	|	ЕСТЬNULL(ОстаткиАвтомобилейОстатки.Партия, ЗНАЧЕНИЕ(Документ.ПоступлениеАвтомобилей.ПустаяСсылка)) КАК Партия,
	|	ЕСТЬNULL(ОстаткиАвтомобилейОстатки.ГТД, ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)) КАК ГТД,
	|	КорректировкаПоступленияАвтомобилейАвтомобили.Количество,
	|	КорректировкаПоступленияАвтомобилейАвтомобили.КоличествоРазница
	|ИЗ
	|	Документ.КорректировкаПоступленияАвтомобилей.Автомобили КАК КорректировкаПоступленияАвтомобилейАвтомобили
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей.Остатки(&МоментВремени, Автомобиль В (&СписокАвтомобилей)) КАК ОстаткиАвтомобилейОстатки
	|		ПО КорректировкаПоступленияАвтомобилейАвтомобили.Автомобиль = ОстаткиАвтомобилейОстатки.Автомобиль
	|ГДЕ
	|	КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка = &Ссылка
	|	И (КорректировкаПоступленияАвтомобилейАвтомобили.СуммаВсегоРазница <> 0
	|			ИЛИ КорректировкаПоступленияАвтомобилейАвтомобили.СуммаНДСРазница <> 0)";
	
	Запрос.УстановитьПараметр("МоментВремени"     , МоментВремени());
	Запрос.УстановитьПараметр("Ссылка"            , Ссылка);
	Запрос.УстановитьПараметр("СписокАвтомобилей" , Автомобили.ВыгрузитьКолонку("Автомобиль"));
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

// Возвращает выборку по шапке
// ДокументСсылка - Ссылка на документ для которого получаем шапку.
Функция ПолучитьШапкуДокумента(ДокументСсылка) Экспорт
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата,
	|	Док.ВалютаДокумента КАК ВалютаДокумента,
	|	Док.КурсДокумента КАК КурсДокумента,
	|	Док.ТипЦен КАК ТипЦен,
	|	Док.ХозОперация КАК ХозОперация,
	|	Док.КурсВалютыУпр КАК КурсВалютыУпр,
	|	Док.КурсВалютыВзаиморасчетов КАК КурсВалютыВзаиморасчетов,
	|	Док.МоментВремени КАК МоментВремени,
	|	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
	/////////// ПРИВАТ ////////////
	|	Док.СкладКомпании КАК СкладКомпании,
	|	Док.Контрагент КАК Контрагент,
	|	Док.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов
	|
	|ИЗ
	|	Документ.КорректировкаПоступленияАвтомобилей КАК Док
	|
	|ГДЕ
	|	Док.Ссылка=&Ссылка
	|");
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	Выборка=Запрос.Выполнить().Выбрать(); Выборка.Следующий();
	
	Возврат Выборка;
КонецФункции

Функция ВыполнитьДвиженияПоОстаткам(ТаблицаДокумента, СписокОснований, Отказ)
	
	НеобходимоСкорректироватьСебестоимость = Новый Массив;
	
	Если ТаблицаДокумента.Количество() = 0 Тогда
		Возврат НеобходимоСкорректироватьСебестоимость;
	КонецЕсли;
	
	ВалютаУпр  = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	ВалютаРегл = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	
	// получим записи из регистра остатков
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОстаткиАвтомобилей.Автомобиль,
	|	ОстаткиАвтомобилей.СкладКомпании,
	|	ОстаткиАвтомобилей.СтатусПартии,
	|	ОстаткиАвтомобилей.Партия,
	|	ОстаткиАвтомобилей.ГТД
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
	|ГДЕ
	|	ОстаткиАвтомобилей.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ОстаткиАвтомобилей.Регистратор В(&Регистраторы)
	|	И ОстаткиАвтомобилей.Автомобиль В(&Автомобили)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиАвтомобилей.Партия,
	|	ОстаткиАвтомобилей.СтатусПартии,
	|	ОстаткиАвтомобилей.Автомобиль,
	|	ОстаткиАвтомобилей.СкладКомпании,
	|	ОстаткиАвтомобилей.ГТД";
	
	Запрос.УстановитьПараметр("Регистраторы" , СписокОснований);
	Запрос.УстановитьПараметр("Автомобили"   , ТаблицаДокумента.ВыгрузитьКолонку("Автомобиль"));
	
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаАвтомобиля Из ТаблицаДокумента Цикл
		НайденныеСтроки = ТаблицаОстатков.НайтиСтроки(Новый Структура("Автомобиль", СтрокаАвтомобиля.Автомобиль));
		
		Если НайденныеСтроки.Количество() = 0 Тогда		
			дкСообщитьРезультат("Для автомобиля <"+СтрокаАвтомобиля.Автомобиль+"> не найденны движения в данной цепочке.", , ЭтотОбъект);
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
		
		ДвижениеОстатки = Движения.ОстаткиАвтомобилей.Добавить();
		
		ЗаполнитьЗначенияСвойств(ДвижениеОстатки, НайденныеСтроки[0],"Автомобиль,СкладКомпании,СтатусПартии,Партия,ГТД");
		
		// Семенихин 28.12.2018 +++++
		Если ЗначениеЗаполнено(Сделка) И Сделка.ХозОперация = Справочники.ХозОперации.ПереходВСобственностьАвтомобилей Тогда
			ДвижениеОстатки.Партия = Сделка;
			ДвижениеОстатки.СтатусПартии = Перечисления.СтатусыПартий.ТоварКупленный;
		КонецЕсли;
		
		ДвижениеОстатки.СкладКомпании = СкладКомпании;
		ОстаткиПоСкладу = РегистрыНакопления.ОстаткиАвтомобилей.Остатки(Дата, Новый Структура("Автомобиль,СкладКомпании", СтрокаАвтомобиля.Автомобиль, СкладКомпании)); 
		Если СтрокаАвтомобиля.ЕстьОстаток И СтрокаАвтомобиля.СуммаВсегоРазница > 0 И ОстаткиПоСкладу.Количество() = 0 Тогда
			дкСообщитьРезультат("Автомобиль <" + Строка(СтрокаАвтомобиля.Автомобиль) + "> отсутствует на складе " + Строка(СкладКомпании), , ЭтотОбъект);
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
		// Семенихин 28.12.2018 -----
		
		ДвижениеОстатки.Период      = Дата;
		ДвижениеОстатки.Регистратор = Ссылка;
		ДвижениеОстатки.ВидДвижения = ВидДвиженияНакопления.Приход;
		
		//Бондаренко++ 20230416
 		Если СтрокаАвтомобиля.Количество = 0 Тогда
			ДвижениеОстатки.Количество  = -1;
 		Иначе
		    ДвижениеОстатки.Количество  = 0;
 		КонецЕсли;
 		//Бондаренко++ 20230416
		
		ДвижениеОстатки.Сумма       = обПересчет(СтрокаАвтомобиля.СуммаВсегоРазница, ВалютаДокумента, КурсДокумента, ВалютаРегл, Дата);
		ДвижениеОстатки.СуммаНДС    = обПересчет(СтрокаАвтомобиля.СуммаНДСРазница  , ВалютаДокумента, КурсДокумента, ВалютаРегл, Дата);
		ДвижениеОстатки.СуммаУпр    = обПересчет(СтрокаАвтомобиля.СуммаВсегоРазница, ВалютаДокумента, КурсДокумента, ВалютаУпр , КурсВалютыУпр);
		ДвижениеОстатки.СтавкаНДС   = СтрокаАвтомобиля.СтавкаНДС;
		ДвижениеОстатки.ХозОперация = ХозОперация;
		
		// откорректруем списывающие движение если необходимо
		Если НЕ СтрокаАвтомобиля.ЕстьОстаток Тогда
			ДвижениеОстаткиРасход = Движения.ОстаткиАвтомобилей.Добавить();
			ЗаполнитьЗначенияСвойств(ДвижениеОстаткиРасход, ДвижениеОстатки);
			ДвижениеОстаткиРасход.ВидДвижения = ВидДвиженияНакопления.Расход;
			
			// скорректируем себестоимость на регистре продажи
			Если Сделка.ХозОперация <> Справочники.ХозОперации.ПоступлениеАвтомобилейОтветственноеХранение Тогда
				НеобходимоСкорректироватьСебестоимость.Добавить(СтрокаАвтомобиля.Автомобиль);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Не Отказ Тогда
		Движения.ОстаткиАвтомобилей.Записать();
	КонецЕсли;
	
	Возврат НеобходимоСкорректироватьСебестоимость;	
КонецФункции

Процедура ВыполнитьДвиженияПоВзаиморасчетам(Отказ, Режим)
	// получим сумму различий
	СуммаЗаписи = Автомобили.Итог("СуммаВсегоРазница");
	
	Если Отказ Или СуммаЗаписи = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Сделка.ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилей ИЛИ
		Сделка.ХозОперация = Справочники.ХозОперации.ПереходВСобственностьАвтомобилей Тогда
		
		НаборЗаписейВзаиморасчеты                       = Движения.ВзаиморасчетыКомпании;
		НаборЗаписейВзаиморасчеты.ДокументОбъект        = ЭтотОбъект;
		НаборЗаписейВзаиморасчеты.РежимПроведения       = Режим;
		НаборЗаписейВзаиморасчеты.Контрагент            = Контрагент;
		НаборЗаписейВзаиморасчеты.ДоговорВзаиморасчетов = ДоговорВзаиморасчетов;
		НаборЗаписейВзаиморасчеты.Сделка                = Сделка;
	
		НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем        = Ложь;
		НаборЗаписейВзаиморасчеты.Сумма                            = СуммаЗаписи;
		НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц = 0;
		Отказ = НЕ НаборЗаписейВзаиморасчеты.Расход() ИЛИ Отказ;
		
		// доходы и расходы по суммовым разницам
		СуммаДоходаРасходаСуммовыхРазниц = НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц;
		Если СуммаДоходаРасходаСуммовыхРазниц <> 0 Тогда
			НаборЗаписейДиР                        = Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект         = ЭтотОбъект;
			НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СуммовыеРазницы;
			НаборЗаписейДиР.ВУпрВалюте             = Истина;
			Если СуммаДоходаРасходаСуммовыхРазниц<0 Тогда
				НаборЗаписейДиР.Расход = -СуммаДоходаРасходаСуммовыхРазниц;
			Иначе
				НаборЗаписейДиР.Доход = СуммаДоходаРасходаСуммовыхРазниц;
			КонецЕсли;
			
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

Процедура ВыполнитьДвиженияПоРегистрамРеализации(НеобходимоСкорректироватьСебестоимость, ТаблицаДокумента, Отказ)
	
	Если Отказ Или НеобходимоСкорректироватьСебестоимость.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПродажиАвтомобилей.ПодразделениеКомпании,
	|	ПродажиАвтомобилей.Автомобиль,
	|	ПродажиАвтомобилей.ДокументПродажи,
	|	ПродажиАвтомобилей.Поставщик,
	|	ПродажиАвтомобилей.Покупатель,
	|	ПродажиАвтомобилей.СтатусПартии,
	|	ПродажиАвтомобилей.ХозОперация,
	|	ПродажиАвтомобилей.ДоговорВзаиморасчетов,
	|	ПродажиАвтомобилей.СкладКомпании,
	|	ПродажиАвтомобилей.СтавкаНДС,
	|	ПродажиАвтомобилей.Партия,
	|	ПродажиАвтомобилей.ГТД
	|ИЗ
	|	РегистрНакопления.ПродажиАвтомобилей КАК ПродажиАвтомобилей
	|ГДЕ
	|	ПродажиАвтомобилей.Автомобиль В(&Автомобили)
	|	И ПродажиАвтомобилей.Партия = &Партия
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиАвтомобилей.ПодразделениеКомпании,
	|	ПродажиАвтомобилей.Автомобиль,
	|	ПродажиАвтомобилей.ДокументПродажи,
	|	ПродажиАвтомобилей.Поставщик,
	|	ПродажиАвтомобилей.Покупатель,
	|	ПродажиАвтомобилей.СтатусПартии,
	|	ПродажиАвтомобилей.ХозОперация,
	|	ПродажиАвтомобилей.ДоговорВзаиморасчетов,
	|	ПродажиАвтомобилей.СкладКомпании,
	|	ПродажиАвтомобилей.СтавкаНДС,
	|	ПродажиАвтомобилей.Партия,
	|	ПродажиАвтомобилей.ГТД";
	
	Запрос.УстановитьПараметр("Автомобили" , НеобходимоСкорректироватьСебестоимость);
	Запрос.УстановитьПараметр("Партия"     , Сделка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВалютаУпр  = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	ВалютаРегл = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	
	СуммаДоходовИРасходов = 0;
	
	Пока Выборка.Следующий() Цикл
		// получим сумму из документа и откорректируем продажи
		НайденныеСтроки = ТаблицаДокумента.НайтиСтроки(Новый Структура("Автомобиль",Выборка.Автомобиль));
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СуммаРазница    = НайденныеСтроки[0].СуммаВсегоРазница;
		СуммаНДСРазница = НайденныеСтроки[0].СуммаНДСРазница;
		
		НоваяЗапись = Движения.ПродажиАвтомобилей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка, "ПодразделениеКомпании,Автомобиль,ДокументПродажи,Поставщик,Покупатель,СтатусПартии,ХозОперация,ДоговорВзаиморасчетов,СкладКомпании,СтавкаНДС,Партия,ГТД");
		
		НоваяЗапись.Период      = Дата;
		НоваяЗапись.Регистратор = Ссылка;
		
		НоваяЗапись.Себестоимость    = обПересчет(СуммаРазница, ВалютаДокумента, КурсДокумента, ВалютаРегл, Дата);
		НоваяЗапись.СебестоимостьУпр = обПересчет(СуммаРазница, ВалютаДокумента, КурсДокумента, ВалютаУпр , КурсВалютыУпр);
		НоваяЗапись.СуммаНДСВходящий = обПересчет(СуммаНДСРазница, ВалютаДокумента, КурсДокумента, ВалютаРегл, Дата);
		
		// скорректируем доходы
		СуммаДоходовИРасходов = СуммаДоходовИРасходов + НоваяЗапись.СебестоимостьУпр;
		
		// также откоректируем себестоимость на регитре реализованных авто
		Если Сделка.ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилейКомиссия Тогда
			ЗаписьРеализованныеАвто = Движения.РеализованныеАвтомобили.Добавить();
			ЗаписьРеализованныеАвто.Период                = Дата;
			ЗаписьРеализованныеАвто.Регистратор           = Ссылка;
			ЗаписьРеализованныеАвто.Контрагент            = Контрагент;
			ЗаписьРеализованныеАвто.ДоговорВзаиморасчетов = ДоговорВзаиморасчетов;
			ЗаписьРеализованныеАвто.Автомобиль            = Выборка.Автомобиль;
			ЗаписьРеализованныеАвто.ДокументПередачи      = Сделка;
			ЗаписьРеализованныеАвто.ГТД                   = Выборка.ГТД;
			ЗаписьРеализованныеАвто.СуммаУпр              = НоваяЗапись.СебестоимостьУпр;
			ЗаписьРеализованныеАвто.СуммаРегл             = НоваяЗапись.Себестоимость;
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.ПродажиАвтомобилей.Записать();
	Движения.РеализованныеАвтомобили.Записать();
	
	Если СуммаДоходовИРасходов <> 0 Тогда
		НаборЗаписейДиР = Движения.ДоходыИРасходы;
		НаборЗаписейДиР.ДокументОбъект         = ЭтотОбъект;
		НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СебестоимостьАвтомобилей;
		НаборЗаписейДиР.ВУпрВалюте             = Истина;
		Если Сделка.ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилейКомиссия Тогда
			НаборЗаписейДиР.Доход = СуммаДоходовИРасходов;
			Отказ = НЕ НаборЗаписейДиР.Расход() ИЛИ Отказ;
		Иначе
			НаборЗаписейДиР.Расход = СуммаДоходовИРасходов;
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		КонецЕсли;
	КонецЕсли;
	
	Движения.ДоходыИРасходы.Записать();
КонецПроцедуры

Процедура ВыполнитьДвиженияПоВозвратуАвтомобилей(ТаблицаДокумента, Отказ, Режим)
	
	// Сформируем список автомобилей для возврата
	АвтомобилиКВозврату = Новый Массив;
	
	НайденныеСтроки = ТаблицаДокумента.НайтиСтроки(Новый Структура("Количество", 0));
	
	// Автомобилей нет к возврату
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
		АвтомобилиКВозврату.Добавить(ТекущаяСтрока.Автомобиль);
	КонецЦикла;
	
	// Проверим наличие незакрытых документов по комплектации автомобилей.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗаказНаряд.Ссылка) КАК ЗаказНаряд,
	               |	ЗаказНаряд.Автомобиль КАК Автомобиль
	               |ИЗ
	               |	Документ.ЗаказНаряд КАК ЗаказНаряд
	               |ГДЕ
	               |	ЗаказНаряд.Автомобиль В(&Автомобили)
	               |	И ЗаказНаряд.Дата <= &Дата
	               |	И ЗаказНаряд.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.КомплектацияАвтомобиля)
	               |	И НЕ ЗаказНаряд.ПометкаУдаления
	               |	И ЗаказНаряд.Состояние <> ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
	               |ИТОГИ ПО
	               |	Автомобиль";
	Запрос.УстановитьПараметр("Автомобили", АвтомобилиКВозврату);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	ВыборкаАвтомобилей = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаАвтомобилей.Следующий() Цикл
		
		СписокЗН = Новый Массив;
		ВыборкаЗН = ВыборкаАвтомобилей.Выбрать();
		
		Пока ВыборкаЗН.Следующий() Цикл
			СписокЗН.Добавить(ВыборкаЗН.ЗаказНаряд);
		КонецЦикла;
		
		дкСообщитьРезультат("У автомобиля <"+ВыборкаАвтомобилей.Автомобиль+"> есть незавершенные документы по комплектации: "+СтрСоединить(СписокЗН, "; "), , ЭтотОбъект);
		Отказ = Истина;
		
	КонецЦикла;
	
	Отказ = ПроверитьЗаказыНаАвтомобиль(АвтомобилиКВозврату) ИЛИ Отказ;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПровестиПоПартиям(Режим, Ссылка, ТаблицаДокумента, АвтомобилиКВозврату);
	
КонецПроцедуры // ВыполнитьДвиженияПоВозвратуАвтомобилей()

// Проверка наличия резервов на автомобиль
//
// Параметры
// Возвращаемое значение:
//   <Булево>   – Заказов на данный автомобиль нет.
//
Функция ПроверитьЗаказыНаАвтомобиль(АвтомобилиКВозврату)
	ДокументОбъектСтруктура = Новый Структура();
	ДокументОбъектСтруктура.Вставить("МоментВремени", МоментВремени());
	ДокументОбъектСтруктура.Вставить("Автомобили", АвтомобилиКВозврату);
	
	Возврат зфЗащищенныеФункцииСервер.РезервыАвтомобиляПроверитьЗаказыНаАвтомобиль(ДокументОбъектСтруктура,РезультатОбработки);
КонецФункции // ПроверитьЗаказыНаАвтомобиль()

// Формирует движения документа по партионным регистрам
// Возвращает Истина - все хорошо, ложь - чего-то не так.
Функция ПровестиПоПартиям(Режим,ДокументСсылка,ТаблицаДокумента,АвтомобилиКВозврату) Экспорт
	Отказ=Ложь;
	
	// получим шапку документа
	ШапкаДокумента=ПолучитьШапкуДокумента(ДокументСсылка);
	
	// Получим способ ведения баланса.
	БалансВедетсяПоПодразделениям = (Константы.СпособВеденияБаланса.Получить() = Перечисления.СпособВеденияБаланса.ПоПодразделению);
		
	// Определим необходимость корректирующих проводок для поддержания баланса по подразделениям.
	ПодразделениеСклад                 = обПолучитьБалансовоеПодразделение(СкладКомпании.Подразделение);
	ПодразделениеДоговорВзаиморасчетов = обПолучитьБалансовоеПодразделение(ДоговорВзаиморасчетов.Подразделение);
	БалансовыеПодразделенияНеРавны     = (ПодразделениеДоговорВзаиморасчетов<>ПодразделениеСклад);
		
	// Если было отложенное проведение по партиям, то :
	// Очистим возможные движения по регистру комплектации автомобилей. 
	НаборЗаписейПартионногоРегистра=РегистрыНакопления.КомплектацияАвтомобилей.СоздатьНаборЗаписей();
	НаборЗаписейПартионногоРегистра.Отбор.Регистратор.Значение=ШапкаДокумента.Ссылка;
	НаборЗаписейПартионногоРегистра.Отбор.Регистратор.Использование=Истина;
	НаборЗаписейПартионногоРегистра.Записать();
	
	// Спишем оборудование автомобиля
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КомплектацияАвтомобилейОстатки.Автомобиль КАК Автомобиль,
	               |	КомплектацияАвтомобилейОстатки.СкладКомпании КАК СкладКомпании,
	               |	КомплектацияАвтомобилейОстатки.Номенклатура КАК Номенклатура,
	               |	КомплектацияАвтомобилейОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	КомплектацияАвтомобилейОстатки.СтатусПартии КАК СтатусПартии,
	               |	КомплектацияАвтомобилейОстатки.Партия КАК Партия,
	               |	КомплектацияАвтомобилейОстатки.ГТД КАК ГТД,
	               |	КомплектацияАвтомобилейОстатки.КоличествоОстаток КАК Количество,
	               |	КомплектацияАвтомобилейОстатки.СуммаОстаток КАК Сумма,
	               |	КомплектацияАвтомобилейОстатки.СуммаНДСОстаток КАК СуммаНДС,
	               |	КомплектацияАвтомобилейОстатки.СуммаУпрОстаток КАК СуммаУпр,
	               |	КомплектацияАвтомобилейОстатки.СуммаПродажиОстаток КАК СуммаПродажи,
	               |	КомплектацияАвтомобилейОстатки.СуммаПродажиУпрОстаток КАК СуммаПродажиУпр
	               |ИЗ
	               |	РегистрНакопления.КомплектацияАвтомобилей.Остатки(&МоментВремени, Автомобиль В (&СписокАвтомобилей)) КАК КомплектацияАвтомобилейОстатки";
	Запрос.УстановитьПараметр("МоментВремени"     , МоментВремени());
	Запрос.УстановитьПараметр("Ссылка"            , Ссылка);
	Запрос.УстановитьПараметр("СписокАвтомобилей" , АвтомобилиКВозврату);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДвижениеКомплектации = Движения.КомплектацияАвтомобилей.Добавить();
		ЗаполнитьЗначенияСвойств(ДвижениеКомплектации, Выборка);
		ДвижениеКомплектации.Период          = Дата;
		ДвижениеКомплектации.Регистратор     = Ссылка;
		ДвижениеКомплектации.ВидДвижения     = ВидДвиженияНакопления.Приход;
		ДвижениеКомплектации.Количество      = -ДвижениеКомплектации.Количество;
		ДвижениеКомплектации.Сумма           = -ДвижениеКомплектации.Сумма;
		ДвижениеКомплектации.СуммаНДС        = -ДвижениеКомплектации.СуммаНДС;
		ДвижениеКомплектации.СуммаУпр        = -ДвижениеКомплектации.СуммаУпр;
		ДвижениеКомплектации.СуммаПродажи    = -ДвижениеКомплектации.СуммаПродажи;
		ДвижениеКомплектации.СуммаПродажиУпр = -ДвижениеКомплектации.СуммаПродажиУпр;
		
	КонецЦикла;
	
	Движения.КомплектацияАвтомобилей.Записать();
	
	// двигаем границу последовательности комплектаций автомобилей
	Если Режим<>РежимПроведенияДокумента.Оперативный ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.АвтомобильБыл) Тогда
		// если идет допроведение, то надо получить те значения которые были раньше
		Если Ссылка<>ДокументСсылка Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ Автомобиль ИЗ РегистрНакопления.КомплектацияАвтомобилей ГДЕ Регистратор=&Ссылка");
			Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
			Результат = Запрос.Выполнить(); АвтомобильБыл=Неопределено;
			Если НЕ Результат.Пустой() Тогда
				АвтомобильБыл = Результат.Выгрузить().ВыгрузитьКолонку("Автомобиль");
			КонецЕсли;
			ДополнительныеСвойства.Вставить("АвтомобильБыл",АвтомобильБыл);
			ДополнительныеСвойства.МоментВремениБыл = ДокументСсылка.МоментВремени();
		КонецЕсли;
		
		НаборЗаписейГраницыКомплектация = РегистрыСведений.ГраницыКомплектация.СоздатьНаборЗаписей();
		Если Режим<>РежимПроведенияДокумента.Оперативный Тогда
			ТаблицаАвтомобилей = Движения.КомплектацияАвтомобилей.Выгрузить();
			ТаблицаАвтомобилей.Свернуть("Автомобиль","");
			НаборЗаписейГраницыКомплектация.Автомобиль = ТаблицаАвтомобилей.ВыгрузитьКолонку("Автомобиль");
			НаборЗаписейГраницыКомплектация.МоментВремени  = ШапкаДокумента.Дата;
			НаборЗаписейГраницыКомплектация.АвтомобильБыл	 = ДополнительныеСвойства.АвтомобильБыл;
			НаборЗаписейГраницыКомплектация.МоментВремениБыл = ДополнительныеСвойства.МоментВремениБыл;
		Иначе
			НаборЗаписейГраницыКомплектация.Автомобиль		 = ДополнительныеСвойства.АвтомобильБыл;
			НаборЗаписейГраницыКомплектация.МоментВремени	 = ДополнительныеСвойства.МоментВремениБыл;
			НаборЗаписейГраницыКомплектация.АвтомобильБыл	 = Неопределено;
			НаборЗаписейГраницыКомплектация.МоментВремениБыл = Неопределено;
		КонецЕсли;
		НаборЗаписейГраницыКомплектация.ДокументСсылка = ШапкаДокумента.Ссылка;
		НаборЗаписейГраницыКомплектация.ИзменитьГраницу();
	КонецЕсли;
	
	ВалютаРегл=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(); 
	СтруктураКурса = обКурсДляВалюты(ВалютаРегл,ШапкаДокумента.МоментВремени);
	КурсРегл = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	ВалютаУпр=Константы.ВалютаУправленческогоУчетаКомпании.Получить(); 
	Если НЕ ЗначениеЗаполнено(ШапкаДокумента.КурсВалютыУпр) Тогда
		СтруктураКурса = обКурсДляВалюты(ВалютаУпр,ШапкаДокумента.МоментВремени);
		КурсУпр = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	Иначе
		КурсУпр = ШапкаДокумента.КурсВалютыУпр;
	КонецЕсли;	
	
	// спишем реализованное оборудование
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	КомплектацияАвтомобилей.Период,
	|	КомплектацияАвтомобилей.Регистратор,
	|	КомплектацияАвтомобилей.НомерСтроки КАК НомерСтроки,
	|	КомплектацияАвтомобилей.Активность,
	|	КомплектацияАвтомобилей.ВидДвижения,
	|	КомплектацияАвтомобилей.Автомобиль,
	|	КомплектацияАвтомобилей.СкладКомпании,
	|	КомплектацияАвтомобилей.Номенклатура,
	|	КомплектацияАвтомобилей.ХарактеристикаНоменклатуры,
	|	КомплектацияАвтомобилей.СтатусПартии,
	|	КомплектацияАвтомобилей.Партия,
	|	КомплектацияАвтомобилей.ГТД,
	|	КомплектацияАвтомобилей.Количество,
	|	КомплектацияАвтомобилей.Сумма,
	|	КомплектацияАвтомобилей.СуммаНДС,
	|	КомплектацияАвтомобилей.СуммаУпр,
	|	КомплектацияАвтомобилей.СуммаПродажи,
	|	КомплектацияАвтомобилей.СуммаПродажиУпр,
	|	КомплектацияАвтомобилей.ХозОперация,
	|	КомплектацияАвтомобилей.СтавкаНДС
	|ИЗ
	|	РегистрНакопления.КомплектацияАвтомобилей КАК КомплектацияАвтомобилей
	|ГДЕ
	|	КомплектацияАвтомобилей.Регистратор = &Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Запрос.УстановитьПараметр("Регистратор", ШапкаДокумента.Ссылка);
	РезультатКомплектацияАвтомобилей = Запрос.Выполнить();
	ВыборкаКомплектацияАвтомобилей = РезультатКомплектацияАвтомобилей.Выбрать();
	НаборЗаписейРеализованныеТовары = Движения.РеализованныеТовары;
	НаборЗаписейПродажи = Движения.Продажи;
	СуммаПродажи = 0;
	Пока ВыборкаКомплектацияАвтомобилей.Следующий() Цикл
		Если ТипЗнч(ВыборкаКомплектацияАвтомобилей.Номенклатура)=Тип("СправочникСсылка.Номенклатура") Тогда
			Если ВыборкаКомплектацияАвтомобилей.СтатусПартии=Перечисления.СтатусыПартий.ТоварПринятыйКомиссия Тогда
				НоваяЗапись = НаборЗаписейРеализованныеТовары.Добавить();
				НоваяЗапись.ВидДвижения                = ВидДвиженияНакопления.Приход;
				НоваяЗапись.Период                     = ШапкаДокумента.Дата;
				НоваяЗапись.Регистратор                = ШапкаДокумента.Ссылка;
				НоваяЗапись.Контрагент                 = ШапкаДокумента.Контрагент;
				НоваяЗапись.ДоговорВзаиморасчетов      = ШапкаДокумента.ДоговорВзаиморасчетов;
				НоваяЗапись.Автомобиль                 = ВыборкаКомплектацияАвтомобилей.Автомобиль;
				НоваяЗапись.Номенклатура               = ВыборкаКомплектацияАвтомобилей.Номенклатура;
				НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаКомплектацияАвтомобилей.ХарактеристикаНоменклатуры;
				НоваяЗапись.ДокументПередачи           = ВыборкаКомплектацияАвтомобилей.Партия;
				НоваяЗапись.ГТД                        = ВыборкаКомплектацияАвтомобилей.ГТД;
				НоваяЗапись.Количество                 = -ВыборкаКомплектацияАвтомобилей.Количество;
				НоваяЗапись.СуммаУпр                   = -ВыборкаКомплектацияАвтомобилей.СуммаУпр;
				НоваяЗапись.СуммаРегл                  = -ВыборкаКомплектацияАвтомобилей.Сумма;
				НоваяЗапись.СуммаБезНДС                = -(НоваяЗапись.СуммаРегл - НоваяЗапись.СуммаНДС);
				НоваяЗапись.СуммаПродажиРегл           = -ВыборкаКомплектацияАвтомобилей.СуммаПродажи;
				НоваяЗапись.СуммаПродажи               = -ВыборкаКомплектацияАвтомобилей.СуммаПродажиУпр;
				// Себестоимость равна продаже.
				Если НЕ НоваяЗапись.ДоговорВзаиморасчетов.КомиссияОтчетНаОснованииПродаж Тогда
					НоваяЗапись.СуммаРегл      = НоваяЗапись.СуммаПродажиРегл;
					НоваяЗапись.СуммаУпр       = НоваяЗапись.СуммаПродажи;
				КонецЕсли;
				НоваяЗапись.ХозОперация                = ШапкаДокумента.ХозОперация;
			КонецЕсли;
			НоваяЗапись = НаборЗаписейПродажи.Добавить();
			НоваяЗапись.Период                     = ШапкаДокумента.Дата;
			НоваяЗапись.Регистратор                = ШапкаДокумента.Ссылка;
			НоваяЗапись.ПодразделениеКомпании      = ШапкаДокумента.ПодразделениеКомпании;
			НоваяЗапись.Автомобиль                 = ВыборкаКомплектацияАвтомобилей.Автомобиль;
			НоваяЗапись.Номенклатура               = ВыборкаКомплектацияАвтомобилей.Номенклатура;
			НоваяЗапись.ДокументПродажи			   = ШапкаДокумента.Ссылка;
			Попытка
				НоваяЗапись.Поставщик              = ВыборкаКомплектацияАвтомобилей.Партия.Контрагент;
			Исключение
			КонецПопытки;
			НоваяЗапись.Покупатель                 = ШапкаДокумента.Контрагент;
			НоваяЗапись.СтатусПартии               = ВыборкаКомплектацияАвтомобилей.СтатусПартии;
			НоваяЗапись.ХозОперация                = ШапкаДокумента.ХозОперация;
			НоваяЗапись.ДоговорВзаиморасчетов      = ШапкаДокумента.ДоговорВзаиморасчетов;
			НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаКомплектацияАвтомобилей.ХарактеристикаНоменклатуры;
			НоваяЗапись.СкладКомпании              = ШапкаДокумента.СкладКомпании;
			НайденныеСтроки = ТаблицаДокумента.НайтиСтроки(Новый Структура("Автомобиль", ВыборкаКомплектацияАвтомобилей.Автомобиль));
			Если НайденныеСтроки.Количество() > 0 Тогда
				НоваяЗапись.СтавкаНДС              = НайденныеСтроки[0].СтавкаНДС;
			КонецЕсли; 
			НоваяЗапись.Партия                     = ВыборкаКомплектацияАвтомобилей.Партия;
			НоваяЗапись.ГТД                        = ВыборкаКомплектацияАвтомобилей.ГТД;
			НоваяЗапись.Количество                 = -ВыборкаКомплектацияАвтомобилей.Количество;
			НоваяЗапись.Сумма                      = -ВыборкаКомплектацияАвтомобилей.СуммаПродажи;
			НоваяЗапись.СуммаНДС                   = Окр(НоваяЗапись.Сумма*НоваяЗапись.СтавкаНДС.Ставка/100, 2);
			НоваяЗапись.СуммаУпр                   = -ВыборкаКомплектацияАвтомобилей.СуммаПродажиУпр;
			НоваяЗапись.СебестоимостьУпр           = -ВыборкаКомплектацияАвтомобилей.СуммаУпр;
			НоваяЗапись.Себестоимость              = Окр(обПересчет(-ВыборкаКомплектацияАвтомобилей.СуммаУпр,ВалютаУпр,КурсУпр,ВалютаРегл,КурсРегл),2);
			НоваяЗапись.СуммаНДСВходящий           = -ВыборкаКомплектацияАвтомобилей.СуммаНДС;
			СуммаПродажи = СуммаПродажи + НоваяЗапись.Сумма;
		КонецЕсли;
	КонецЦикла; 
	
	Если СуммаПродажи <> 0 И (Сделка.ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилей ИЛИ
		Сделка.ХозОперация = Справочники.ХозОперации.ПереходВСобственностьАвтомобилей) Тогда
		
		НаборЗаписейВзаиморасчеты                       = Движения.ВзаиморасчетыКомпании;
		НаборЗаписейВзаиморасчеты.ДокументОбъект        = ЭтотОбъект;
		НаборЗаписейВзаиморасчеты.РежимПроведения       = Режим;
		НаборЗаписейВзаиморасчеты.Контрагент            = Контрагент;
		НаборЗаписейВзаиморасчеты.ДоговорВзаиморасчетов = ДоговорВзаиморасчетов;
		НаборЗаписейВзаиморасчеты.Сделка                = Сделка;
		НаборЗаписейВзаиморасчеты.Валюта                = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем        = Истина;
		НаборЗаписейВзаиморасчеты.Сумма                            = -СуммаПродажи;
		НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц = 0;
		Отказ = НЕ НаборЗаписейВзаиморасчеты.Расход() ИЛИ Отказ;
		
		// доходы и расходы по суммовым разницам
		СуммаДоходаРасходаСуммовыхРазниц = НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц;
		Если СуммаДоходаРасходаСуммовыхРазниц <> 0 Тогда
			НаборЗаписейДиР                        = Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект         = ЭтотОбъект;
			НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СуммовыеРазницы;
			НаборЗаписейДиР.ВУпрВалюте             = Истина;
			Если СуммаДоходаРасходаСуммовыхРазниц<0 Тогда
				НаборЗаписейДиР.Расход = -СуммаДоходаРасходаСуммовыхРазниц;
			Иначе
				НаборЗаписейДиР.Доход = СуммаДоходаРасходаСуммовыхРазниц;
			КонецЕсли;
			
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НЕ Отказ;
КонецФункции

// Расчет суммы документа
Функция РассчитатьСуммуВсего()Экспорт
	ВремСуммаДокумента=Автомобили.Итог("СуммаВсего");
	Если СуммаДокумента<>ВремСуммаДокумента Тогда
		СуммаДокумента=ВремСуммаДокумента;
	КонецЕсли;
	Возврат СуммаДокумента;
КонецФункции

/// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка			– Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	– Форма				– Ссылка на форму документа.
//	Если значение неопределено, производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	Если ДопПараметры=Неопределено Тогда
		ДопПараметры=Новый Структура;
	КонецЕсли;
	Если ТипЗнч(ДопПараметры)=Тип("Структура") Тогда
		ДопПараметры.Вставить("НеРассчитыватьСкидки",Истина);
	КонецЕсли; 
	
	// ОБРАБОТКА РЕКВИЗИТОВ ДОКУМЕНТА
	Если Имя="ДокументОснование" Тогда
		Если ДокументОснование <> Неопределено Тогда
			Если ДокументОснование = Ссылка Тогда
				ДокументОснование = Неопределено;
				ОбработкаРеквизита("ДокументОснование");
				Сообщить("Ввод корректировки поступления автомобилей на основании самой себя запрещен.",СтатусСообщения.Внимание);
				Возврат Истина;
			КонецЕсли;
			
			Если НЕ ДокументОснование.Проведен Тогда
				Сообщить("Ввод корректировки поступления автомобилей возможен только на основании проведенного документа.",СтатусСообщения.Внимание);
				ДокументОснование=Неопределено;
				ОбработкаРеквизита("ДокументОснование");
				Возврат Истина;
			КонецЕсли;
			
			//Запрос = Новый Запрос;
			//Запрос.Текст =
			//"ВЫБРАТЬ
			//|	КорректировкаПоступленияАвтомобилей.Ссылка
			//|ИЗ
			//|	Документ.КорректировкаПоступленияАвтомобилей КАК КорректировкаПоступленияАвтомобилей
			//|ГДЕ
			//|	КорректировкаПоступленияАвтомобилей.ДокументОснование = &ДокументОснование
			//|	И КорректировкаПоступленияАвтомобилей.Ссылка <> &Ссылка";
			//Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
			//Запрос.УстановитьПараметр("Ссылка", Ссылка);
			//РезЗапроса = Запрос.Выполнить();
			//Если НЕ РезЗапроса.Пустой() Тогда
			//	Выборка = РезЗапроса.Выбрать();
			//	Выборка.Следующий();
			//	#Если Клиент Тогда
			//		Предупреждение("На основании документа " + ДокументОснование + " уже введен" + Выборка.Ссылка);
			//	#КонецЕсли
			//	ДокументОснование = Неопределено;
			//	ОбработкаРеквизита("ДокументОснование");
			//	Возврат Истина;
			//КонецЕсли;
		КонецЕсли;
		
		#Если Клиент Тогда
			Если ЭтаФорма<>Неопределено Тогда 
				Если Вопрос("Заполнить по документу-основания?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
					ЭтотОбъект.ОбработкаЗаполнения(ДокументОснование);
					ЭтаФорма.УправлениеДиалогом();
					дкВывестиЗаголовокСуммаДокумента(ЭтаФорма);
				КонецЕсли;
			КонецЕсли; 
		#КонецЕсли
		Возврат Ложь;
		
	// ОБРАБОТКА РЕКВИЗИТОВ ТАБЛИЧНОЙ ЧАСТИ "Автомобили"
	ИначеЕсли Имя = "Автомобили.Автомобиль" Тогда
		// подставим VIN
		ТекСтрока.VIN = ТекСтрока.Автомобиль.VIN;
		Если НЕ ЗначениеЗаполнено(ТекСтрока.СтавкаНДС) Тогда
			ТекСтрока.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
		КонецЕсли;
		Возврат Истина;
	ИначеЕсли Имя = "Автомобили.Цена" Тогда
		ТекСтрока.Сумма = ТекСтрока.Цена;
		ОбработкаРеквизита("Автомобили.Сумма", ТекСтрока, ЭтаФорма);
		Возврат Истина;
	ИначеЕсли Имя = "Автомобили.Сумма" Тогда
		ТекСтрока.Цена = ТекСтрока.Сумма;
		
		// расчитаем сумму всего
		Если ?(ЗначениеЗаполнено(ТипЦен),ТипЦен.ЦенаВключаетНДС,Истина) Тогда
			ТекСтрока.СуммаВсего = ТекСтрока.Сумма;
			ТекСтрока.СуммаНДС = ТекСтрока.СуммаВсего - (100*ТекСтрока.СуммаВсего)/(100+ТекСтрока.СтавкаНДС.Ставка);
		Иначе
			ТекСтрока.СуммаНДС=(ТекСтрока.Сумма*ТекСтрока.СтавкаНДС.Ставка)/100;
			ТекСтрока.СуммаВсего=ТекСтрока.Сумма+ТекСтрока.СуммаНДС;
		КонецЕсли;
		Возврат Истина;
	ИначеЕсли Имя = "Автомобили.СуммаВсего" Тогда
		//Получим новую сумму НДС как процент от суммы всего
		Если ?(ЗначениеЗаполнено(ТипЦен),ТипЦен.ЦенаВключаетНДС,Истина)Тогда
			//Цена уже содержит НДС
			ТекСтрока.Сумма    = ТекСтрока.СуммаВсего;
			ТекСтрока.СуммаНДС = ТекСтрока.СуммаВсего - (100*ТекСтрока.СуммаВсего)/(100+ТекСтрока.СтавкаНДС.Ставка);
		Иначе
			//НДС в цену не включен
			ТекСтрока.Сумма    = (100*ТекСтрока.СуммаВсего)/(100+ТекСтрока.СтавкаНДС.Ставка);
			ТекСтрока.СуммаНДС = ТекСтрока.СуммаВсего - ТекСтрока.Сумма;
		КонецЕсли; 
 		ТекСтрока.Цена = ТекСтрока.Сумма;
		Возврат Истина;                                                                
	//Бондаренко++ 20230329	
	ИначеЕсли Имя = "Автомобили.Количество" Тогда
		Если ТекСтрока.Количество > 1 Тогда
			Сообщить("Поступление двух и болле автомобилей с одинаковыми VIN номерами невозможно.",СтатусСообщения.Внимание);
			ТекСтрока.Количество = 1;
			Возврат Ложь;
		Иначе 
			ТекСтрока.КоличествоРазница = ТекСтрока.Количество - ТекСтрока.КоличествоПоДокументуПоступления;
		КонецЕсли;	
		ОбработкаРеквизита("Автомобили.Сумма", ТекСтрока, ЭтаФорма);		
	//Бондаренко-- 20230329		
	ИначеЕсли Имя="Автомобили.СтавкаНДС" Тогда
		Возврат ОбработкаРеквизита("Автомобили.Сумма",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Автомобили.СуммаНДС" Тогда
		Возврат Истина;
	ИначеЕсли Имя="РассчитатьРазницу" Тогда
		ТекСтрока.СуммаРазница      = ТекСтрока.Сумма - ТекСтрока.СуммаПоДокументуПоступления ;
		ТекСтрока.СуммаНДСРазница   = ТекСтрока.СуммаНДС - ТекСтрока.СуммаНДСПоДокументуПоступления;
		ТекСтрока.СуммаВсегоРазница = ТекСтрока.СуммаВсего - ТекСтрока.СуммаВсегоПоДокументуПоступления;
	//Бондаренко++ 20260326	
	ИначеЕсли Имя = "РабочиеЛисты.МаркетинговаяПрограмма" Тогда
		Если обЗначениеНеЗаполнено(ТекСтрока.МаркетинговаяПрограмма) Тогда
			ТекСтрока.Сумма=0;
		ИначеЕсли обЗначениеНеЗаполнено(ТекСтрока.РабочийЛист) Тогда
			ТекСтрока.Сумма=0;
		Иначе
			СуммаКомп_ =  НайтиСуммуКомпенсации(ТекСтрока.МаркетинговаяПрограмма,ТекСтрока.РабочийЛист,ТекСтрока);
			Если ТекСтрока.Сумма <> СуммаКомп_ Тогда
				ТекСтрока.Сумма= СуммаКомп_;	
			КонецЕсли;
		КонецЕсли;
		Возврат Истина;
		//Бондаренко-- 20260326		
	Иначе Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()

//Бондаренко++ 20260326	
Функция НайтиСуммуКомпенсации(МаркПрогр,РабЛист,СтрокаТекущая) Экспорт
	
	СумКомп = 0;
	
	Если РабЛист.МаркетинговаяПрограммаСкидкаТрейдИн = МаркПрогр Тогда
		СумКомп = 0 + РабЛист.КомпенсацияТрейдИНРетроспективная + РабЛист.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля;
		Если РабЛист.КомпенсацияТрейдИНРетроспективная > 0 Тогда
			СтрокаТекущая.ВариантКомпенсации = Перечисления.ВариантКомпенсации.Ретроспективная;
 		Иначе
			СтрокаТекущая.ВариантКомпенсации = Перечисления.ВариантКомпенсации.ВИнвойсеСледующего;
		КонецЕсли;
 	ИначеЕсли РабЛист.МаркетинговаяПрограммаСкидкаТрейдИн2 = МаркПрогр Тогда
		СумКомп = 0 + РабЛист.КомпенсацияТрейдИН2Ретроспективная + РабЛист.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля;	
		Если РабЛист.КомпенсацияТрейдИН2Ретроспективная > 0 Тогда
			СтрокаТекущая.ВариантКомпенсации = Перечисления.ВариантКомпенсации.Ретроспективная;
 		Иначе
			СтрокаТекущая.ВариантКомпенсации = Перечисления.ВариантКомпенсации.ВИнвойсеСледующего;
		КонецЕсли;
	ИначеЕсли РабЛист.МаркетинговаяПрограммаСкидкаСубсидияКредит = МаркПрогр Тогда
		СумКомп = 0 + РабЛист.КомпенсацияСубсидияКредитРетроспективная + РабЛист.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля;	
		Если РабЛист.КомпенсацияСубсидияКредитРетроспективная > 0 Тогда
			СтрокаТекущая.ВариантКомпенсации = Перечисления.ВариантКомпенсации.Ретроспективная;
 		Иначе
			СтрокаТекущая.ВариантКомпенсации = Перечисления.ВариантКомпенсации.ВИнвойсеСледующего;
		КонецЕсли;
	ИначеЕсли РабЛист.МаркетинговаяПрограммаСкидкаПоПрограммамЛояльности = МаркПрогр Тогда
		СумКомп = 0 + РабЛист.КомпенсацияПоПрограммамЛояльностиРетроспективная + РабЛист.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля;	
		Если РабЛист.КомпенсацияПоПрограммамЛояльностиРетроспективная > 0 Тогда
			СтрокаТекущая.ВариантКомпенсации = Перечисления.ВариантКомпенсации.Ретроспективная;
 		Иначе
			СтрокаТекущая.ВариантКомпенсации = Перечисления.ВариантКомпенсации.ВИнвойсеСледующего;
		КонецЕсли;
 	ИначеЕсли РабЛист.МаркетинговаяПрограммаСкидкаПоПрограммамЛояльностиДополнительно = МаркПрогр Тогда
		СумКомп = 0 + РабЛист.КомпенсацияРозничнаяРетроспективная + РабЛист.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля;	
		Если РабЛист.КомпенсацияРозничнаяРетроспективная > 0 Тогда
			СтрокаТекущая.ВариантКомпенсации = Перечисления.ВариантКомпенсации.Ретроспективная;
 		Иначе
			СтрокаТекущая.ВариантКомпенсации = Перечисления.ВариантКомпенсации.ВИнвойсеСледующего;
		КонецЕсли;
	КонецЕсли;    
	
	Возврат СумКомп;
 
КонецФункции // НайтиСуммуКомпенсации(МаркПрогр,РабЛист)
//Бондаренко++ 20260326

// Заполнение свойств из документа основания
Процедура ЗаполнитьСвойстваНаОсновании(Основание) Экспорт
	//Зарезервировано для описания заполнения свойств из свойств основания
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////
//// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает соответствие в котором перечислены виды номенклатуры, которые нельзя вводить
// в таблицу товаров. Если таких нет, то возвращает неопределено
Функция ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры() Экспорт
	Результат=Неопределено;
	Результат=Новый Соответствие();
	Возврат Результат;
КонецФункции

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	ОбязательныеРеквизиты.Вставить("Автор",1);
	ОбязательныеРеквизиты.Вставить("ДокументОснование",1);
	ОбязательныеРеквизиты.Вставить("ТипЦен",1);
	ОбязательныеРеквизиты.Вставить("ХозОперация",1);
	ОбязательныеРеквизиты.Вставить("ВалютаДокумента",1);
	ОбязательныеРеквизиты.Вставить("КурсДокумента",1);
	ОбязательныеРеквизиты.Вставить("Контрагент",1);
	ОбязательныеРеквизиты.Вставить("ДоговорВзаиморасчетов",1);
	ОбязательныеРеквизиты.Вставить("СкладКомпании",1);
	
	// Обязательные поля таблицы товаров
	ОбязательныеАвтомобили=Новый Структура();
	ОбязательныеАвтомобили.Вставить("Автомобиль",3);
	ОбязательныеАвтомобили.Вставить("ГТД",2);
	ОбязательныеРеквизиты.Вставить("Автомобили",ОбязательныеАвтомобили); 
		
	Возврат ОбязательныеРеквизиты;
КонецФункции

// Проверяет корректность заполнения объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	// Здесь могут быть определены дополнительные к стандартным обязательным реквизитам условия проверки
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	
	// Проведем проверку соответствия организации документа организациям некоторых реквизитов документа.
	// Такую проверку необходимо осуществлять, если баланс в системе ведется по организации, 
	// или если установлен способ контроля корректности договора и склада документа. 
	// Причем, если способ контроля выбран "Контроль по организации и подразделению", то
	// дополнительно осуществляется проверка соответствия подразделений.
	Если Результат Тогда
		СпособКонтроляКорректности = обПраво("КонтрольКорректностиДоговораИСкладаДокумента", Права,,ЭтотОбъект);
		КонтрольОтсутствует        = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольОтсутствует);
		БалансВедетсяПоОрганизации = (Константы.СпособВеденияБаланса.Получить()=Перечисления.СпособВеденияБаланса.ПоОрганизации);

		Если БалансВедетсяПоОрганизации Или Не КонтрольОтсутствует Тогда
			КонтрольПоПодразделению = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольПоОрганизацииИПодразделению);
			
			КонтролируемыеРеквизиты = Новый Структура();
			
			КонтролируемыеРеквизитыШапки = Новый Структура();
			КонтролируемыеРеквизитыШапки.Вставить("ДоговорВзаиморасчетов",КонтрольПоПодразделению);
			КонтролируемыеРеквизиты.Вставить("КонтролируемыеРеквизитыШапки",КонтролируемыеРеквизитыШапки);
		
			Результат = дкПроверитьКорректностьПоОрганизации(ЭтотОбъект,КонтролируемыеРеквизиты,Ошибки) и Результат;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
 
// Функция проверяет, допустимо ли изменение объекта
// Возвращает Истина, если изменения возможны, ложь иначе
// Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов,
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
	// Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции

// Возвращает список возможных хозяйственных операций документа
// Возвращаемое значение: СписокЗначений. 
// Строка списка: Значение - имя предопределенного элемента; 
//				  Представление - красивое его представление
// 				  "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("КорректировкаПоступленияАвтомобилейИсправлениеВПервичныхДокументах","Исправление в первичных документах",Истина);
	СписокХозОпераций.Добавить("КорректировкаПоступленияАвтомобилейКорректировкаПоСогласованиюСторон","Корректировка по согласованию сторон",Ложь);
	Возврат СписокХозОпераций;
КонецФункции

#Если Клиент Тогда

//////////////////////////////////////////////////////////////////////////////////
//// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА


// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
// Параметры: НазваниеМакета - строка, название макета, если пусто - то по умолчанию,
//   Документ - сюда можно передать уже созданный табличный документ для заполнения
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	// Вызов конкретно печатной формы и печать результата прописано в общем модуле
	// здесь могут быть вставлены дополнительные механизмы
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции

// Формирует печатную форму "ПоступлениеАвтомобилей"
// Возвращает сформированный табличный документ:
Функция ПечатьПоступлениеАвтомобилей(ТабДокумент) Экспорт
	Макет = ПолучитьМакет("ПоступлениеАвтомобилей");
	
	НомерДляПечати=дкПолучитьНомерДляПечати(ЭтотОбъект);
	
	//для начала настроим макет
	ОбластьШапкаТаблицы = орПривестиМакетПечатнойФормы(ЭтотОбъект,Макет);
	ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
	
	//вывод заголовка документа
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
	
	ТекстЗаголовка = "Приходная накладная (автомобили) № "+НомерДляПечати+" от "+Формат(ЭтотОбъект.Дата,"ДФ=dd.MM.yyyy");
	
	ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
    ОбластьМакета.Параметры.ПредставлениеПоставщика	= спПолучитьПредставление(Контрагент);
	ОбластьМакета.Параметры.ПредставлениеПокупателя	= спПолучитьПредставление(Организация);
	ОбластьМакета.Параметры.ПредставлениеСклада		= спПолучитьНаименование(СкладКомпании);
	
	//вывод свойств
	СтрокаСвойств = дкПолучитьСтрокуСвойствДокумента(ЭтотОбъект);
	ОбластьМакета.Параметры.СтрокаСвойств = СтрокаСвойств;
	ТабДокумент.Вывести(ОбластьМакета);
	
	//сразу два, т.к. выводим на второй странице только
	НомерСтраницы = 2;
	НомерСтраницыПред = НомерСтраницы;
	
	//теперь выводим шапку
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	//готовим области строки
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
	СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента,СуммаНДС,СуммаВсего",ВалютаДокумента,0,0,0);
	
	//заполним параметры шапки таблицы для следующего листа
	ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
	
	//перебор строк
	ВыборкаТабличнойЧасти = ЭтотОбъект.Автомобили.Выгрузить();
	Для каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
		//заполняем данные строки
		СтруктураСтроки = орПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТабличнойЧасти,ЭтотОбъект);
		ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);
		
		//выводим строку, делая проверку попадания на лист
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице, НомерСтраницы, СтруктураИтоговПоСтранице,ЭтотОбъект);
		
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента,СуммаНДС,СуммаВсего",ВалютаДокумента,0,0);
			НомерСтраницыПред = НомерСтраницы;
			ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли;
		//добавляем итоги
		дкДобавитьИтогиПоСтранице(СтрокаТабличнойЧасти,СтруктураИтоговПоСтранице);
		
	КонецЦикла;
	
	//довыводим последний подвал, если страниц больше единицы
	Если НомерСтраницы > 2 Тогда
		дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьМакетаИтогоПоСтранице,СтруктураИтоговПоСтранице,ЭтотОбъект);
	КонецЕсли;
	
	//итоги
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.ВалютаДокумента = ВалютаДокумента;
	СуммаВсего = ВыборкаТабличнойЧасти.Итог("СуммаВсего");
	ОбластьМакета.Параметры.СуммаВсего = Формат(СуммаВсего,ФорматВыводаСуммы);
	НДСВсего = ВыборкаТабличнойЧасти.Итог("СуммаНДС");
	ОбластьМакета.Параметры.НДСВсего = Формат(НДСВсего,ФорматВыводаСуммы);
	ОбластьМакета.Параметры.СуммаПрописью = "Всего наименований "+ВыборкаТабличнойЧасти.Количество()+" на сумму " + обЧислоПрописью(СуммаВсего,ЭтотОбъект.ВалютаДокумента);
	
	// Выводим представления и расшифровки подписей
	Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
	Отпустил.ОтпустилПредставление = ?(обЗначениеНеЗаполнено(Отпустил.Отпустил),"","/ "+ Отпустил.ОтпустилПредставление);
	ОбластьМакета.Параметры.Заполнить(Отпустил);
	Получил  = дкОтветственноеЛицо(ЭтотОбъект,"Получил");
	Получил.ПолучилПредставление = ?(обЗначениеНеЗаполнено(Получил.Получил),"","/ "+ Получил.ПолучилПредставление);
	ОбластьМакета.Параметры.Заполнить(Получил);
	
	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, , , НомерСтраницы,,ЭтотОбъект);
	
	Возврат ТабДокумент;
КонецФункции

// Формирует печатную форму "УКД"
// Возвращает сформированный табличный документ:
Функция ПечатьУКД(ТабДокумент) Экспорт
	
	ТабДокумент = дкПечатьУКД(ЭтотОбъект, ТабДокумент);
	
	Возврат ТабДокумент;
КонецФункции // ПечатьУКД

// Функция получения данных для УКД.
//
Функция ПолучитьДанныеДляПечатиУКД() Экспорт
	
	ДокументФактура = Документы.СчетФактураПолученный.НайтиПоРеквизиту("ДокументОснование", ЭтотОбъект.Ссылка);
	ДокументОбъект = ДокументФактура;
	ДанныеОбъекта = Новый Структура();
	
	// Сформируем статус документа
	Если ДокументФактура <> Документы.СчетФактураПолученный.ПустаяСсылка() И НЕ ДокументФактура.ПометкаУдаления Тогда
		Статус = 1;
		ДокументОбъект = ДокументФактура;
	Иначе
		Статус = 2;
		ДокументОбъект = ЭтотОбъект;
	КонецЕсли;
	
	Если Дата > Дата('20210701') Тогда
		ТаблицаТоваров = Документы.СчетФактураПолученный.ТоварыДляПечатиУКД(ЭтотОбъект.Ссылка);
	Иначе

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КорректировкаПоступленияАвтомобилейАвтомобили.Автомобиль КАК Номенклатура,
	|	КорректировкаПоступленияАвтомобилейАвтомобили.Цена,
	|	КорректировкаПоступленияАвтомобилейАвтомобили.Сумма,
	|	КорректировкаПоступленияАвтомобилейАвтомобили.СуммаРазница,
	|	КорректировкаПоступленияАвтомобилейАвтомобили.СтавкаНДС,
	|	КорректировкаПоступленияАвтомобилейАвтомобили.СуммаНДС,
	|	КорректировкаПоступленияАвтомобилейАвтомобили.СуммаНДСРазница,
	|	КорректировкаПоступленияАвтомобилейАвтомобили.СуммаВсего,
	|	КорректировкаПоступленияАвтомобилейАвтомобили.СуммаВсегоРазница,
	|	КорректировкаПоступленияАвтомобилейАвтомобили.Количество КАК Количество,
	|	КорректировкаПоступленияАвтомобилейАвтомобили.КоличествоРазница КАК КоличествоРазница,
	|	КорректировкаПоступленияАвтомобилейАвтомобили.СуммаНДСПоДокументуПоступления,
	|	КорректировкаПоступленияАвтомобилейАвтомобили.СуммаВсегоПоДокументуПоступления
	|ИЗ
	|	Документ.КорректировкаПоступленияАвтомобилей.Автомобили КАК КорректировкаПоступленияАвтомобилейАвтомобили
	|ГДЕ
	|	КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка = &Ссылка
	|	И (КорректировкаПоступленияАвтомобилейАвтомобили.Сумма <> КорректировкаПоступленияАвтомобилейАвтомобили.СуммаПоДокументуПоступления
	|			ИЛИ КорректировкаПоступленияАвтомобилейАвтомобили.СтавкаНДС <> КорректировкаПоступленияАвтомобилейАвтомобили.СтавкаНДСПоДокументуПоступления
	|			ИЛИ КорректировкаПоступленияАвтомобилейАвтомобили.СуммаНДС <> КорректировкаПоступленияАвтомобилейАвтомобили.СуммаНДСПоДокументуПоступления
	|			ИЛИ КорректировкаПоступленияАвтомобилейАвтомобили.СуммаВсего <> КорректировкаПоступленияАвтомобилейАвтомобили.СуммаВсегоПоДокументуПоступления)";
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	// данные документа
	ДанныеОбъекта.Вставить("Дата"                   	, ДокументОбъект.Дата);
	ДанныеОбъекта.Вставить("Номер"                  	, дкПолучитьНомерДляПечати(ДокументОбъект));
	ДанныеОбъекта.Вставить("ХозОперация"            	, ДокументОбъект.ХозОперация);
	ДанныеОбъекта.Вставить("ДокументОснование"      	, ДокументОбъект.ДокументОснование);
	ДанныеОбъекта.Вставить("ВалютаДокумента"      		, ЭтотОбъект.ВалютаДокумента);
	ДанныеОбъекта.Вставить("Поставщик"              	, ДокументОбъект.Контрагент);
	ДанныеОбъекта.Вставить("ПодразделениеКомпании"  	, ДокументОбъект.ПодразделениеКомпании);
	ДанныеОбъекта.Вставить("Покупатель"              	, ДокументОбъект.Организация);
	ДанныеОбъекта.Вставить("Организация"              	, ЭтотОбъект.Организация);
	ДанныеОбъекта.Вставить("ДоговорВзаиморасчетов"     	, ?(ЗначениеЗаполнено(ДокументОбъект.ДоговорВзаиморасчетов), ЭтотОбъект.ДоговорВзаиморасчетов, "--"));
	ДанныеОбъекта.Вставить("Товары"              		, ТаблицаТоваров);
	ДанныеОбъекта.Вставить("Статус"              		, Статус);
	ДанныеОбъекта.Вставить("Ссылка"              		, ДокументОбъект.Ссылка);
	ДанныеОбъекта.Вставить("ИдентификаторГосударственногоКонтракта", Неопределено);
	ДанныеОбъекта.Вставить("ДатаОтгрузки", Неопределено);
	
	Если Статус = 1 Тогда
		ДанныеОбъекта.Вставить("НомерИсходногоДокумента",
			?(ЗначениеЗаполнено(ДокументОбъект.НомерИсходногоДокумента),
				дкПолучитьНомерДляПечати(ДокументОбъект,,"НомерИсходногоДокумента"),
				"--"));
		ДанныеОбъекта.Вставить("ДатаИсходногоДокумента",
			?(ЗначениеЗаполнено(ДокументОбъект.ДатаИсходногоДокумента), ДокументОбъект.ДатаИсходногоДокумента, "--"));
		ДанныеОбъекта.Вставить("ПлатежноРасчетныеДокументы" , Неопределено);
	КонецЕсли;
	
	// Свойства
	ДанныеОбъекта.Вставить("Руководитель"     		, дкОтветственноеЛицо(ЭтотОбъект.ДокументОснование, Перечисления.ВидыОбъектовСведений.Руководитель));
	ДанныеОбъекта.Вставить("ГлавныйБухгалтер" 		, дкОтветственноеЛицо(ЭтотОбъект.ДокументОснование, Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер));
	ДанныеОбъекта.Вставить("Менеджер" 				, дкОтветственноеЛицо(ДокументОбъект, "Менеджер"));
	
	Возврат ДанныеОбъекта;
	
КонецФункции

// Возвращает доступные варианты печати документа
// Возвращаемое значение: Структура, каждая строка которой
// соответствует одному из вариантов печати
// Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм() Экспорт
	СтруктураМакетов=Новый Структура();
	СтруктураМакетов.Вставить("ПоступлениеАвтомобилей", "Приходная накладная");
	Возврат СтруктураМакетов;
КонецФункции

#КонецЕсли

// Если Клиент Тогда - завершена клиентская часть

//////////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

//// Процедура - обработчик ввода на основании
Процедура ОбработкаЗаполнения(Основание) Экспорт
	//{[+](фрагмент ДОБАВЛЕН), art2310@gmail.com 08.07.2021 19:08:26
	//!!!Закомментировано до принятия решения о схеме ущета документов 
	//Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеАвтомобилей")
	//	И Основание.ХозОперация <> Справочники.ХозОперации.ПереходВСобственностьАвтомобилей Тогда
	//	ВызватьИсключение("Оформление корректировки возможно только на основании перехода в собственность");
	//КонецЕсли; 
	//ХозОперация = Справочники.ХозОперации.КорректировкаПоступленияАвтомобилейКорректировкаПоСогласованиюСторон;
	//}art2310@gmail.com 08.07.2021 19:08:26
	
	//Если Основание <> ДокументОснование Тогда
	//	// проверим введенные на основании корректировки
	//	Корректировка  = Неопределено;
	//	МассивВидов    = Новый Массив(1); 
	//	МассивВидов[0] = "КорректировкаПоступленияАвтомобилей";
	//	МассивПодчиненных = дкПолучитьМассивПодчиненных(Основание, МассивВидов, Истина);
	//	
	//	Если НЕ обЗначениеНеЗаполнено(МассивПодчиненных) И МассивПодчиненных.Количество()>0 Тогда
	//		Корректировка = МассивПодчиненных[0].Ссылка;
	//	КонецЕсли;
	//	// откроем введенную ранее СФ, отменим ввод новой
	//	Если НЕ Корректировка = Неопределено Тогда
	//		ФормаСФ = Корректировка.ПолучитьФорму();
	//		Если ФормаСФ.Открыта() Тогда
	//			ФормаСФ.Активизировать();
	//		Иначе
	//			ФормаСФ.Открыть();
	//		КонецЕсли;
	//		ЭтотОбъект.ДополнительныеСвойства.Вставить("НеОткрыватьФорму", Истина);
	//		Сообщить("На основании документа " + Основание + " уже введен " + Корректировка);
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Контрагент = Неопределено;
		ДоговорВзаиморасчетов = Неопределено;
	КонецЕсли;
	дкОбработкаЗаполнения(ЭтотОбъект, Основание, , Ложь);
	
	Если Основание = Неопределено Тогда
		Возврат;		
	// Семенихин 21.01.2022 +++++
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеАвтомобилей") Тогда
		ХозОперация = Справочники.ХозОперации.КорректировкаПоступленияАвтомобилейКорректировкаПоСогласованиюСторон;	
	// Семенихин 21.01.2022 -----
	КонецЕсли;
	
	Сделка = ПолучитьСделку();
	
	Контрагент = Основание.Контрагент;
	ОбработкаРеквизита("Контрагент");
	
	
	// получим список авто из документа
	Автомобили.Загрузить(Основание.Автомобили.Выгрузить());
	
	Основания = ПолучитьСписокОснований();
	ВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	ВалютаРег = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	
	// заполняем суммы автомобилей
	Для Каждого Автомобиль Из Автомобили Цикл
		Суммы = ПолучитьСебестоимостьАвтомобиля(Автомобиль.Автомобиль, Основания);
		
		Если ВалютаРег = ВалютаДокумента Тогда
			Автомобиль.СуммаВсего = Суммы.Сумма;
		Иначе
			Автомобиль.СуммаВсего = обПересчет(Суммы.СуммаУпр, ВалютаУпр, КурсВалютыУпр, ВалютаДокумента, КурсДокумента);
		КонецЕсли;
		ОбработкаРеквизита("Автомобили.СуммаВсего", Автомобиль);
		
		Автомобиль.СуммаНДС = обПересчет(Суммы.СуммаНДС, ВалютаРег, Дата, ВалютаДокумента, КурсДокумента);
		
		// заполним доп реквизиты
		Автомобиль.СуммаВсегоПоДокументуПоступления = Автомобиль.СуммаВсего;
		Автомобиль.СуммаПоДокументуПоступления      = Автомобиль.Сумма;
		Автомобиль.СуммаНДСПоДокументуПоступления   = Автомобиль.СуммаНДС;
		Автомобиль.СтавкаНДСПоДокументуПоступления  = Автомобиль.СтавкаНДС;
		//Бондаренко++ 20230329
		Автомобиль.КоличествоПоДокументуПоступления = Автомобиль.Количество;
		//Бондаренко-- 20230329
 		Автомобиль.ГТДПоДокументуПоступления        = Автомобиль.ГТД;
		Автомобиль.ИзДокументаОснования             = Истина;
		
		ОбработкаРеквизита("РассчитатьРазницу", Автомобиль);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
	
	ВхДокНомер = "";
	#Если Клиент Тогда
	ВхДокДата = РабочаяДата;
	#Иначе
	ВхДокДата = ТекущаяДата();
	#КонецЕсли
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//Бондаренко++ 20250426
	Если РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда 
			
		Если обЗначениеНеЗаполнено(СкладКомпании) Тогда
			СМГ_Сообщить("ОШИБКА! Не выбран склад.",СтатусСообщения.ОченьВажное);
 			Отказ = Истина;
	 	    Возврат;
 		КонецЕсли;
		
		Если СМГ_ПередЗаписью() Тогда	
 			СМГ_Сообщить("ОШИБКА! В документе выбран не тот склад. Нажмие ""Действия"", выберите ""Разрешить/запретить редактировать склад"" и замените склад.",СтатусСообщения.ОченьВажное);
			Если НЕ РольДоступна("ПолныеПрава") Тогда
				Отказ = Истина;
				Возврат;
			КонецЕсли;	
		КонецЕсли;
		
	КонецЕсли;
	//Бондаренко-- 20250426
	
	// заполним сделку
	Сделка = ПолучитьСделку();
	// проверим хоз. операции
	// составим список документов движений
	Если ХозОперация = Справочники.ХозОперации.КорректировкаПоступленияАвтомобилейКорректировкаПоСогласованиюСторон Тогда
		
		// заполним значение до корректировки
		Для Каждого Строка Из Автомобили Цикл
			Строка.СуммаВсегоДоКорректировки = Строка.СуммаВсегоПоДокументуПоступления;
			Строка.СуммаНДСДоКорректировки   = Строка.СуммаНДСПоДокументуПоступления;
		КонецЦикла;
		
	ИначеЕсли ХозОперация = Справочники.ХозОперации.КорректировкаПоступленияАвтомобилейИсправлениеВПервичныхДокументах Тогда
		
		// проверим введенные на основании корректировки
		МассивВидов = Новый Массив(1); 
		МассивВидов[0] = "КорректировкаПоступленияАвтомобилей";
		МассивПодчиненных = дкПолучитьМассивПодчиненных(ДокументОснование, МассивВидов, Истина);
		
		ЕстьКорректировка = Ложь;
		
		Если НЕ обЗначениеНеЗаполнено(МассивПодчиненных) И МассивПодчиненных.Количество()>0 Тогда
			Для Каждого Корректировка Из МассивПодчиненных Цикл
				Если НЕ Корректировка.Ссылка = Ссылка
					И НЕ Корректировка.ХозОперация = Справочники.ХозОперации.КорректировкаПоступленияАвтомобилейКорректировкаПоСогласованиюСторон Тогда
					ЕстьКорректировка = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ЕстьКорректировка Тогда
			Сообщить("К документу """+Строка(ДокументОснование)+""" введено больше одного корректировочного документа с хоз. операцей ""Исправление первичных документов"". 
					|Каждую последующую корректировку следует вводить на основании предыдущей.");
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ДоговорВзаиморасчетовБыл");
	ДополнительныеСвойства.Вставить("АвтомобильСкладКомпанииБыл");
	ДополнительныеСвойства.Вставить("АвтомобильБыл");
	ДополнительныеСвойства.Вставить("МоментВремениБыл");
	
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	// получим старые значения, влияющие на границы последовательности
	Если НЕ Отказ И Проведен И РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		
		БылиДвижения = Ложь;
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		// взаиморасчеты
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ДоговорВзаиморасчетов ИЗ РегистрНакопления.ВзаиморасчетыКомпании ГДЕ Регистратор=&Ссылка";
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			БылиДвижения = Истина;
			ДополнительныеСвойства.Вставить("ДоговорВзаиморасчетовБыл", Результат.Выгрузить().ВыгрузитьКолонку("ДоговорВзаиморасчетов"));
		КонецЕсли;
		
		// автомобили
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ СкладКомпании ИЗ РегистрНакопления.ОстаткиАвтомобилей ГДЕ Регистратор=&Ссылка";
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			БылиДвижения = Истина;
			ДополнительныеСвойства.Вставить("АвтомобильСкладКомпанииБыл", Результат.Выгрузить().ВыгрузитьКолонку("СкладКомпании"));
		КонецЕсли;
		
		// комплектация
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ Автомобиль ИЗ РегистрНакопления.КомплектацияАвтомобилей ГДЕ Регистратор=&Ссылка";
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			БылиДвижения = Истина;
			ДополнительныеСвойства.Вставить("АвтомобильБыл", Результат.Выгрузить().ВыгрузитьКолонку("Автомобиль"));
		КонецЕсли;
		
		// прошлый момент времени
		Если БылиДвижения Тогда
			Запрос.Текст = "ВЫБРАТЬ МоментВремени ИЗ Документ."+Метаданные().Имя+" ГДЕ Ссылка=&Ссылка";
			ДополнительныеСвойства.Вставить("МоментВремениБыл",Запрос.Выполнить().Выгрузить().Получить(0).МоментВремени);
		КонецЕсли;
		
	КонецЕсли;

	
	РассчитатьСуммуВсего();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
 	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли; 
 	//Бондаренко++ 20220930
	СМГ_ПриЗаписи()
	//Бондаренко-- 20220930	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда Возврат; КонецЕсли; Ошибки = "";
	
	ТаблицаДокумента = ПолучитьТаблицуАвтомобилей();
	СписокОснований  = ПолучитьСписокОснований();
	
	// движения по регистру Остатки автомобилей
	НеобходимоСкорректироватьСебестоимость = ВыполнитьДвиженияПоОстаткам(ТаблицаДокумента, СписокОснований, Отказ);
	
	// движения по регитсру взаимо расчетов
	ВыполнитьДвиженияПоВзаиморасчетам(Отказ, Режим);
	
	// движения по продажам
	ВыполнитьДвиженияПоРегистрамРеализации(НеобходимоСкорректироватьСебестоимость, ТаблицаДокумента, Отказ);
	
	ВыполнитьДвиженияПоВозвратуАвтомобилей(ТаблицаДокумента, Отказ, Режим);
	
	// границы
	Если Режим<>РежимПроведенияДокумента.Оперативный ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.АвтомобильСкладКомпанииБыл) Тогда
		// двигаем границу последовательности автомобилей
		НаборЗаписейГраницыАвтомобили = РегистрыСведений.ГраницыАвтомобили.СоздатьНаборЗаписей();
		Если Режим<>РежимПроведенияДокумента.Оперативный Тогда
			НаборЗаписейГраницыАвтомобили.СкладКомпании		= СкладКомпании;
			НаборЗаписейГраницыАвтомобили.МоментВремени		= Дата;
			НаборЗаписейГраницыАвтомобили.СкладКомпанииБыл	= ДополнительныеСвойства.АвтомобильСкладКомпанииБыл;
			НаборЗаписейГраницыАвтомобили.МоментВремениБыл	= ДополнительныеСвойства.МоментВремениБыл;
		Иначе
			НаборЗаписейГраницыАвтомобили.СкладКомпании		= ДополнительныеСвойства.АвтомобильСкладКомпанииБыл;
			НаборЗаписейГраницыАвтомобили.МоментВремени		= ДополнительныеСвойства.МоментВремениБыл;
			НаборЗаписейГраницыАвтомобили.СкладКомпанииБыл	= Неопределено;
			НаборЗаписейГраницыАвтомобили.МоментВремениБыл	= Неопределено;
		КонецЕсли;
		НаборЗаписейГраницыАвтомобили.ДокументСсылка = Ссылка;
		НаборЗаписейГраницыАвтомобили.ИзменитьГраницу();
	КонецЕсли;
	
	ДвигаемГраницу = (Режим<>РежимПроведенияДокумента.Оперативный И Движения.ВзаиморасчетыКомпании.Количество()>0);
	Если ДвигаемГраницу ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.ДоговорВзаиморасчетовБыл) Тогда
		НаборЗаписейГраницыВзаиморасчетов = РегистрыСведений.ГраницыВзаиморасчетов.СоздатьНаборЗаписей();
		Если ДвигаемГраницу Тогда
			ТаблицаДоговоров = Движения.ВзаиморасчетыКомпании.Выгрузить();
			ТаблицаДоговоров.Свернуть("ДоговорВзаиморасчетов","");
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетов = ТаблицаДоговоров.ВыгрузитьКолонку("ДоговорВзаиморасчетов");
			НаборЗаписейГраницыВзаиморасчетов.МоментВремени = Дата;
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетовБыл = ДополнительныеСвойства.ДоговорВзаиморасчетовБыл;
			НаборЗаписейГраницыВзаиморасчетов.МоментВремениБыл = ДополнительныеСвойства.МоментВремениБыл;
		Иначе
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетов = ДополнительныеСвойства.ДоговорВзаиморасчетовБыл;
			НаборЗаписейГраницыВзаиморасчетов.МоментВремени = ДополнительныеСвойства.МоментВремениБыл;
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетовБыл = Неопределено;
			НаборЗаписейГраницыВзаиморасчетов.МоментВремениБыл = Неопределено;
		КонецЕсли;
		НаборЗаписейГраницыВзаиморасчетов.ДокументСсылка = Ссылка;
		НаборЗаписейГраницыВзаиморасчетов.ИзменитьГраницу();
	КонецЕсли;   
	
	//Иванченко 20260121 ++	
	ЗапросНА = Новый Запрос( 
	//
	//"ВЫБРАТЬ
	//|	ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль,
	//|	АвтомобилиСрезПоследних.Значение КАК ВидАвто,
	//|	СУММА(ОстаткиАвтомобилейОстатки.КоличествоОстаток) КАК КоличествоОстаток
	//|ПОМЕСТИТЬ ВТ_Остатки
	//|ИЗ
	//|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(, ) КАК ОстаткиАвтомобилейОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних(, ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)) КАК АвтомобилиСрезПоследних
	//|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = АвтомобилиСрезПоследних.Автомобиль
	//|ГДЕ
	//|	АвтомобилиСрезПоследних.Значение В(&ВидыАвто)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ОстаткиАвтомобилейОстатки.Автомобиль,
	//|	АвтомобилиСрезПоследних.Значение
	//|
	//|ИМЕЮЩИЕ
	//|	СУММА(ОстаткиАвтомобилейОстатки.КоличествоОстаток) > 0
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка.ДокументОснование КАК Поступление,
	//|	КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка КАК Ссылка,
	//|	ВТ_Остатки.Автомобиль КАК Автомобиль,
	//|	СУММА(КорректировкаПоступленияАвтомобилейАвтомобили.СуммаВсего * 1.02) КАК ИнвойсСНаценкой
	//|ПОМЕСТИТЬ ВТ_Корректировки
	//|ИЗ
	//|	ВТ_Остатки КАК ВТ_Остатки,
	//|	Документ.КорректировкаПоступленияАвтомобилей.Автомобили КАК КорректировкаПоступленияАвтомобилейАвтомобили
	//|ГДЕ
	//|	НЕ КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка.ДокументОснование.ПометкаУдаления
	//|	И КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка.ДокументОснование.Проведен
	//|	И НЕ КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка.ДокументОснование.Контрагент.НашаФирма
	//|	И КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка.ДокументОснование.Дата <= ДАТАВРЕМЯ(2026, 3, 1)
	//|	И КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка = &Ссылка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_Остатки.Автомобиль,
	//|	КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка.ДокументОснование,
	//|	КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Корректировки.Автомобиль КАК Автомобиль,
	//|	ВТ_Корректировки.ИнвойсСНаценкой КАК ИнвойсСНаценкой,
	//|	ВТ_Корректировки.Ссылка КАК Ссылка
	//|ИЗ
	//|	ВТ_Корректировки КАК ВТ_Корректировки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
	//|		ПО ВТ_Корректировки.Поступление = ПоступлениеАвтомобилейАвтомобили.Ссылка
	//|			И ВТ_Корректировки.Автомобиль = ПоступлениеАвтомобилейАвтомобили.Автомобиль
	//|ГДЕ
	//|	ПоступлениеАвтомобилейАвтомобили.СтавкаНДС.Ставка МЕЖДУ 18 И 20"); 
	"ВЫБРАТЬ
	|	КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка.ДокументОснование КАК Поступление,
	|	КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка КАК Ссылка,
	|	КорректировкаПоступленияАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
	|	СУММА(КорректировкаПоступленияАвтомобилейАвтомобили.СуммаВсего * 1.02) КАК ИнвойсСНаценкой
	|ПОМЕСТИТЬ ВТ_Корректировки
	|ИЗ
	|	Документ.КорректировкаПоступленияАвтомобилей.Автомобили КАК КорректировкаПоступленияАвтомобилейАвтомобили
	|ГДЕ
	|	НЕ КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка.ДокументОснование.ПометкаУдаления
	|	И КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка.ДокументОснование.Проведен
	|	И НЕ КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка.ДокументОснование.Контрагент.НашаФирма
	|	И КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка.ДокументОснование.Дата <= ДАТАВРЕМЯ(2026, 3, 1)
	|	И КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка.ДокументОснование,
	|	КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка,
	|	КорректировкаПоступленияАвтомобилейАвтомобили.Автомобиль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Корректировки.ИнвойсСНаценкой КАК ИнвойсСНаценкой,
	|	ВТ_Корректировки.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_Корректировки КАК ВТ_Корректировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
	|		ПО ВТ_Корректировки.Поступление = ПоступлениеАвтомобилейАвтомобили.Ссылка
	|ГДЕ
	|	ПоступлениеАвтомобилейАвтомобили.СтавкаНДС.Ставка МЕЖДУ 18 И 20"); 
	//Иванченко 20260121 --	
	СЗ_ВидыАвто = Новый СписокЗначений;
	СЗ_ВидыАвто.Добавить(Перечисления.ВидАвтомобиля.КорпоративнаяКвота);  
	СЗ_ВидыАвто.Добавить(Перечисления.ВидАвтомобиля.Новый);
	СЗ_ВидыАвто.Добавить(Перечисления.ВидАвтомобиля.ПодменныйАвтомобиль); 
	СЗ_ВидыАвто.Добавить(Перечисления.ВидАвтомобиля.ТестовыйАвтомобиль);
	СЗ_ВидыАвто.Добавить(Перечисления.ВидАвтомобиля.АвтомобильСПробегом);		
	ЗапросНА.Параметры.Вставить("ВидыАвто", СЗ_ВидыАвто);    
	ЗапросНА.Параметры.Вставить("Ссылка", Ссылка);    
	ВыгрузкаРезультатаЗапросаНА = ЗапросНА.Выполнить().Выгрузить();
	
	Если ВыгрузкаРезультатаЗапросаНА.Количество() <> 0 Тогда
		
		Для Каждого ТекСтрокаАвтомобили Из Автомобили Цикл 
			Движение = Движения.Инвойс_х_1точка02.Добавить();
			Движение.Период = РабочаяДата;
			Движение.Автомобиль = ТекСтрокаАвтомобили.Автомобиль;
			//Бондаренко++ 20260123
			//Движение.ИнвойсСНаценкой = ТекСтрокаАвтомобили.ИнвойсСНаценкой;
			Движение.ИнвойсСНаценкой = ВыгрузкаРезультатаЗапросаНА[0].ИнвойсСНаценкой;
			//Бондаренко-- 20260123
			Движения.Инвойс_х_1точка02.Записать();
		КонецЦикла; 
			
	КонецЕсли;	
	//Иванченко 20260116 --	
	
	// Возможно расхождение баланса на "копейки" из-за округления. Возникшую разницу
	// необходимо списать на доходы и расходы.
	Отказ = НЕ дкСписаниеКопейкиПриОкругленииВалютныхСчетов(ЭтотОбъект) ИЛИ Отказ; 
	
	//Бондаренко++ 20260326
	Движения.БонусныеБаллыДилера.Очистить();
	Если Дата >= ДеньЭрЭл Тогда
		Если РабочиеЛисты.Количество() > 0 Тогда
			Для каждого ТекСтрокаРабочиеЛисты Из РабочиеЛисты Цикл
 				Для Счетчик_ = 1 По 2 Цикл
					
					Движение = Движения.БонусныеБаллыДилера.Добавить();
					
					Если Счетчик_ = 1 Тогда
						Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
						Движение.ВариантОстатков = Перечисления.НачисленоПодтверждено.Начислено;
					Иначе
						Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
						Движение.ВариантОстатков = Перечисления.НачисленоПодтверждено.Подтверждено;
					КонецЕсли;
 					 
					Движение.Период = Дата; 
					Движение.ПодразделениеКомпании = ТекСтрокаРабочиеЛисты.РабочийЛист.ПодразделениеКомпании;
					Движение.Организация = ТекСтрокаРабочиеЛисты.РабочийЛист.Организация;
					Движение.Автомобиль = ТекСтрокаРабочиеЛисты.РабочийЛист.Автомобиль;
					Движение.Марка = ТекСтрокаРабочиеЛисты.РабочийЛист.Автомобиль.Модель.Марка;
					Движение.Модель = ТекСтрокаРабочиеЛисты.РабочийЛист.Автомобиль.Модель;
					Движение.МаркетинговаяПрограмма = ТекСтрокаРабочиеЛисты.МаркетинговаяПрограмма;
					Движение.ДатаСписанияБонусов = Дата;
					
					//Бондаренко++ 20260311
					Движение.Компенсация = ТекСтрокаРабочиеЛисты.СуммаПоАкту;
					Если ТекСтрокаРабочиеЛисты.ВариантКомпенсации = Перечисления.ВариантКомпенсации.ВИнвойсеСледующего Тогда
						Движение.ВариантКомпенсации = Перечисления.ВариантКомпенсации.ВИнвойсеСледующего;
					ИначеЕсли ТекСтрокаРабочиеЛисты.ВариантКомпенсации = Перечисления.ВариантКомпенсации.Ретроспективная Тогда	
						Движение.ВариантКомпенсации = Перечисления.ВариантКомпенсации.Ретроспективная;
					Иначе
						Движение.ВариантКомпенсации = Перечисления.ВариантКомпенсации.ПустаяСсылка();
					КонецЕсли;
					//Бондаренко-- 20260311
					
					Движение.ХозОперация = Справочники.ХозОперации.БонусныеБаллыДилераРасход;
					Если НЕ обЗначениеНеЗаполнено(ТекСтрокаРабочиеЛисты.РабочийЛист.РеализацияАвтомобиля) Тогда
						Движение.ФактическаяЦенаПродажиАвто = ТекСтрокаРабочиеЛисты.РабочийЛист.РеализацияАвтомобиля.Автомобили[0].СуммаВсего;
						Движение.КонтрагентПокупатель = ТекСтрокаРабочиеЛисты.РабочийЛист.РеализацияАвтомобиля.Контрагент;
						Движение.ДатаПродажи = ТекСтрокаРабочиеЛисты.РабочийЛист.РеализацияАвтомобиля.Дата;
						//Бондаренко++ 20260331
						Движение.ДокументРеализации = ТекСтрокаРабочиеЛисты.РабочийЛист.ОтгрузкаАвтомобиля;
						//Бондаренко-- 20260331
					КонецЕсли;
					Движение.ДатаРитейла = "";
					Движение.ДатаПодтверждения = "";
					Движение.ДатаПолучения = "";
					
					//Бондаренко++ 20260401
					Движение.РабочийЛист = ТекСтрокаРабочиеЛисты.РабочийЛист.Ссылка;
					//Бондаренко-- 20260401
					
				КонецЦикла;
 			КонецЦикла;
		КонецЕсли;
	КонецЕсли;	
	//Бондаренко-- 20260326
	
	// выведем сообщения об ошибках и предупреждениях
	дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
	
КонецПроцедуры // ОбработкаПроведения

//Бондаренко++ 20220930
Процедура СМГ_ПриЗаписи()
 	СМГ_СоздатьИлиОбновитьСФПолученный();
 КонецПроцедуры  //СМГ_ПриЗаписи()
	
Процедура СМГ_СоздатьИлиОбновитьСФПолученный()
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
 	КонецЕсли;
 	
	СФ_полученный = Неопределено; 
	
	Если ЭтотОбъект.Автомобили.Итог("СуммаНДС") > 0 Тогда
		СФ_полученный = Документы.СчетФактураПолученный.СоздатьДокумент(); 
		СФ_полученный.Комментарий = "Документ был автоматически создан "+СокрЛП(ТекущаяДата());
 	КонецЕсли;
 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураПолученный.Ссылка КАК СФ,
	|	СчетФактураПолученный.ДокументОснование,
	|	СчетФактураПолученный.Проведен
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|ГДЕ
	|	СчетФактураПолученный.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ЭтотОбъект.Ссылка);
     	
	Результат = Запрос.Выполнить();		
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СФ_полученный = ВыборкаДетальныеЗаписи.СФ.ПолучитьОбъект(); 
		Прервать;
	КонецЦикла; 
	
	Если СФ_полученный = Неопределено Тогда
		// Так как "Автомобили.Итог("СуммаНДС") равна нулю и старый счет-фактура полученный не найден
		Возврат;
 	КонецЕсли;
	 
	СФ_полученный.Заполнить(ЭтотОбъект.Ссылка);
 	СФ_полученный.Дата = ЭтотОбъект.Дата; 
	СФ_полученный.Комментарий = "Документ был автоматически обновлен "+СокрЛП(ТекущаяДата());
  	
	ФлЭтотОбъектПроведен = ЭтотОбъект.Проведен;
	ФлЭтотОбъектПометкаУдаления = ЭтотОбъект.ПометкаУдаления;
	
	СФ_полученный.Проведен = ФлЭтотОбъектПроведен;			
	СФ_полученный.ПометкаУдаления = ФлЭтотОбъектПометкаУдаления;
	
	Если ФлЭтотОбъектПометкаУдаления Тогда               
		Попытка СФ_полученный.Записать(РежимЗаписиДокумента.Запись); Исключение КонецПопытки; 
	Иначе                                                           
		Если ФлЭтотОбъектПроведен Тогда
			Попытка СФ_полученный.Записать(РежимЗаписиДокумента.Проведение); Исключение КонецПопытки; 					
		Иначе
			Попытка СФ_полученный.Записать(РежимЗаписиДокумента.ОтменаПроведения); Исключение КонецПопытки; 					
		КонецЕсли; 
	КонецЕсли;
 	
КонецПроцедуры //СМГ_СоздатьИлиОбновитьСФПолученный()
//Бондаренко-- 20220930

//Бондаренко++ 20250426
Функция СМГ_ПередЗаписью()
	
	ФлОтказ = Ложь;
	
	Для каждого ТекСтрока Из Автомобили Цикл
		
		Если ТекСтрока.КоличествоРазница = 0 И ТекСтрока.СуммаВсегоРазница = 0 Тогда
			Продолжить;
		КонецЕсли;
		
 		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиАвтомобилейОстаткиТекСклада.Автомобиль,
		|	ОстаткиАвтомобилейОстаткиТекСклада.КоличествоОстаток КАК ОстатокНаТекущем,
		|	0 КАК ОстатокНаДругих
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(
		|			&Период,
		|			СкладКомпании = &Склад
		|				И Автомобиль = &Автомобиль) КАК ОстаткиАвтомобилейОстаткиТекСклада
		|ГДЕ
		|	ОстаткиАвтомобилейОстаткиТекСклада.КоличествоОстаток = 1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОстаткиАвтомобилейОстаткиДругихСкладов.Автомобиль,
		|	0,
		|	ОстаткиАвтомобилейОстаткиДругихСкладов.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(
		|			&Период,
		|			СкладКомпании <> &Склад
		|				И Автомобиль = &Автомобиль) КАК ОстаткиАвтомобилейОстаткиДругихСкладов
		|ГДЕ
		|	ОстаткиАвтомобилейОстаткиДругихСкладов.КоличествоОстаток = 1";
		
		Запрос.УстановитьПараметр("Склад", СкладКомпании);
		Запрос.УстановитьПараметр("Автомобиль", ТекСтрока.Автомобиль);
		Запрос.УстановитьПараметр("Период", Дата);
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		Если ТЗ.Количество() = 1 Тогда
			Если ТЗ[0].ОстатокНаТекущем = 0 Тогда
				СМГ_Сообщить("ОШИБКА! "+ТекСтрока.Автомобиль+" отсутствует на складе """+СкладКомпании+""".",СтатусСообщения.ОченьВажное);
				ФлОтказ = Истина;
				Возврат ФлОтказ;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ФлОтказ;
 	
КонецФункции //
//Бондаренко-- 20250426

//Бондаренко++ 20260402
ДеньЭрЭл = обПраво("ДатаНачалаРаботыСКомпенсациями");
//Бондаренко-- 20260402

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли

