
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗакрыватьПриЗакрытииВладельца=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьЗначенияСвойств(Объект,ЭтаФорма.ВладелецФормы.Объект,,"ЗаявкаНаОформление,ЗаявкаПоставщику,ОчищеннаяТаблица");
	АвтоДилер_Инициализация();
	Если не ЗначениеЗаполнено(Склад) тогда
		Склад=Объект.Склад;
	КонецЕсли;
	Если не ЗначениеЗаполнено(ТипЦен) тогда
		ТипЦен=Объект.ТипЦен;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура АвтоДилер_Инициализация()
	ОтвПар=РеквизитФормыВЗначение("Объект").АПИ_АвтоДилер_ПолучитьПарольЛогин();
	Логин=ОтвПар.Логин;
	Пароль=ОтвПар.Пароль;
	
	Объект.АвтоДилер_Параметры=Новый Структура("Логин,Пароль,Сайт,СписокПросмотра,Уровень,ОбработкаУзла,ОбработкаУзлаЧтение,ПараметрыУзла,ПараметрДетали,ОбработкаДетали,Склад,ТипЦен,ПоказыватьКартинку");
	Объект.АвтоДилер_Параметры.Логин=Логин;
	Объект.АвтоДилер_Параметры.Пароль=Пароль;
	
	Объект.АвтоДилер_Параметры.Сайт="http://auto2d.com/api/in.php?u="+Логин+"&p="+Пароль;
	Объект.АвтоДилер_Параметры.СписокПросмотра=Новый СписокЗначений;
	Объект.АвтоДилер_Параметры.Уровень=-1;
	АвтоДилер_ТД_ТипыАвтомобилей=РеквизитФормыВЗначение("Объект").АПИ_АвтоДилер_ТД_ТипыАвтомобилей();
	СписокТаблицПросмотра=Новый Массив;
	СтекПоложения.Добавить(Неопределено);
	Вр=Новый Массив(9);
	Для н=1 по 9 Цикл
		 СписокТаблицПросмотра.Добавить(Новый РеквизитФормы("АвтоДилер_ТД_"+Строка(н),Новый ОписаниеТипов("ТабличныйДокумент")));
		 Объект.АвтоДилер_Параметры.СписокПросмотра.Добавить(Неопределено);
		 СтекПоложения.Добавить(Неопределено);
	КонецЦикла;
	ИзменитьРеквизиты(СписокТаблицПросмотра);
	Доб=Элементы.Добавить("АвтоДилер_ТД_Просмотр",Тип("ПолеФормы"),Элементы.АвтоДилер_ГруппаПросмотра);
	Доб.Вид=ВидПоляФормы.ПолеТабличногоДокумента;
	Доб.РежимМасштабированияПросмотра=РежимМасштабированияПросмотра.Обычный;
	Доб.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Нет;
	Доб.ПутьКДанным="АвтоДилер_ТД_Просмотр";
КонецПроцедуры

&НаКлиенте
Процедура АвтоДилер_ТД_СбросПоложения()
	Элементы.АвтоДилер_ТД_Просмотр.УстановитьВыделенныеОбласти(Новый Массив);
	Элементы.АвтоДилер_ТД_Просмотр.ТекущаяОбласть=АвтоДилер_ТД_Просмотр.Область(1,1);
конецПроцедуры

&НаКлиенте
Процедура АвтоДилер_ТД_ТипыАвтомобилейОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Если ТипЗнч(Расшифровка)<>Тип("ФиксированнаяСтруктура") тогда
		Возврат;
	КонецЕсли;
	Объект.АвтоДилер_Параметры.Уровень=0;
	Объект.АвтоДилер_Параметры.СписокПросмотра.Получить(0).Значение=Расшифровка;
	ПереходВниз("АПИ_АвтоДилер_ТД_МаркиАвтомобилей");
	АвтоДилер_ТД_СбросПоложения();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоУзловВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Дан=Элементы.ДеревоУзлов.ДанныеСтроки(ВыбраннаяСтрока);
	Если  Дан.Каталог=1 тогда
		Если Дан.Прочитать=Ложь тогда
			Возврат;
		КонецЕсли;
		Дан.Прочитать=Ложь;
		Если Объект.АвтоДилер_Параметры.ОбработкаУзлаЧтение="" тогда
			Возврат;
		КонецЕсли;
		Объект.АвтоДилер_Параметры.ПараметрыУзла=Элементы.ДеревоУзлов.ДанныеСтроки(ВыбраннаяСтрока).ПараметрУзла;
		Рез=ДеревоУзловВыборЧтениеНаСервере();
		СписВр=Дан.ПолучитьЭлементы();
		Для каждого Эл из Рез Цикл
			СтрД=СписВр.Добавить();
			ЗаполнитьЗначенияСвойств(СтрД,Эл);
			Если Эл.Свойство("ПодУзлы") тогда
				СписВр1=СтрД.ПолучитьЭлементы();
				Для каждого ЭлМ из Эл.Подузлы Цикл
					СтрД1=СписВр1.Добавить();
					ЗаполнитьЗначенияСвойств(СтрД1,ЭлМ);
				конецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		Элементы.ДеревоУзлов.Развернуть(Дан.ПолучитьИдентификатор());
		Возврат;
	КонецЕсли;
	Если Объект.АвтоДилер_Параметры.ОбработкаУзла="" тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка=Ложь;
	Объект.АвтоДилер_Параметры.Склад=Склад;
	Объект.АвтоДилер_Параметры.ТипЦен=ТипЦен;
	Объект.АвтоДилер_Параметры.ПараметрыУзла=Элементы.ДеревоУзлов.ДанныеСтроки(ВыбраннаяСтрока).ПараметрУзла;
	Объект.АвтоДилер_Параметры.ПоказыватьКартинку=ПоказыватьКартинку;
	Рез=ДеревоУзловВыборНаСервере();
	Если Рез.КартинкаУзла=Неопределено тогда
		АдресКартинки="";
	иначе
		АдресКартинки=Рез.КартинкаУзла;
	КонецЕсли;
	Элементы.СтрИнфОбщая.ТекущаяСтраница=Элементы.СтрКартинкаОбщая;	
	Элементы.СтрИнфДеталиОбщая.Видимость=Ложь;
	Элементы.ЗаголовокУзла.Заголовок=Рез.НазваниеУзла;
	Элементы.ЗаголовокКартинки.Заголовок=Рез.НазваниеКартинки;
	ДанныеВыбора.Очистить();
	Для каждого Эл из Рез.СписокВыбора Цикл
		СтрД=ДанныеВыбора.Добавить();
		ЗаполнитьЗначенияСвойств(СтрД,Эл);
		Если ЗначениеЗаполнено(СтрД.Номенклатура) тогда
			Если СтрД.Остаток<>0 тогда
				СтрД.ТипСтроки=1;
			иначе
				СтрД.ТипСтроки=2;
			КонецЕсли;
		иначе
			Если СтрД.Артикул<>""  тогда
				СтрД.ТипСтроки=4;
			иначе
				СтрД.ТипСтроки=5;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ДеревоУзловВыборНаСервере()
	Возврат РеквизитФормыВЗначение("Объект").ВыполнитьСобытие(Объект.АвтоДилер_Параметры.ОбработкаУзла);
КонецФункции

&НаСервере
Функция ДеревоУзловВыборЧтениеНаСервере()
	Возврат РеквизитФормыВЗначение("Объект").ВыполнитьСобытие(Объект.АвтоДилер_Параметры.ОбработкаУзлаЧтение);
КонецФункции

&НаСервере
Процедура ПереходВниз(ИмяФункции)
	Элементы.Удалить(Элементы["АвтоДилер_ТД_Просмотр"]);
	Доб=Элементы.Добавить("АвтоДилер_ТД_Просмотр",Тип("ПолеФормы"),Элементы.АвтоДилер_ГруппаПросмотра);
	Доб.Вид=ВидПоляФормы.ПолеТабличногоДокумента;
	ЭтаФорма["АвтоДилер_ТД_"+Строка(Объект.АвтоДилер_Параметры.Уровень+1)]=РеквизитФормыВЗначение("Объект").ВыполнитьСобытие(ИмяФункции);
	Доб.ПутьКДанным="АвтоДилер_ТД_"+Строка(Объект.АвтоДилер_Параметры.Уровень+1);
	Доб.УстановитьДействие("ОбработкаРасшифровки","АвтоДилер_ТД_ПросмотрОбработкаРасшифровки");
	Доб.РежимМасштабированияПросмотра=РежимМасштабированияПросмотра.Обычный;
	Доб.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Нет;
	Доб.КонтекстноеМеню.Видимость=Истина;
    
КонецПроцедуры

&НаСервере
Процедура ПереходВозврат(Уровень)
	Объект.АвтоДилер_Параметры.Уровень=Уровень;
	Элементы.Удалить(Элементы["АвтоДилер_ТД_Просмотр"]);
	Доб=Элементы.Добавить("АвтоДилер_ТД_Просмотр",Тип("ПолеФормы"),Элементы.АвтоДилер_ГруппаПросмотра);
	Доб.Вид=ВидПоляФормы.ПолеТабличногоДокумента;
	Доб.ПутьКДанным="АвтоДилер_ТД_"+Строка(Объект.АвтоДилер_Параметры.Уровень+1);
	Доб.УстановитьДействие("ОбработкаРасшифровки","АвтоДилер_ТД_ПросмотрОбработкаРасшифровки");
	Доб.РежимМасштабированияПросмотра=РежимМасштабированияПросмотра.Обычный;
	Доб.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Нет;
	
КонецПроцедуры

&НаСервере
Процедура ПереходОбработкаУзла(ИмяФункции)
	Рез=РеквизитФормыВЗначение("Объект").ВыполнитьСобытие(ИмяФункции);
	ЗначениеВРеквизитФормы(Рез.Дерево,"ДеревоУзлов");
	АвтоДилер_ТД_УзелИнфо=Рез.ИнформацияОМодели;
	ДанныеВыбора.Очистить();
	АдресКартинки="";
	Объект.АвтоДилер_Параметры.ОбработкаУзла=Рез.ОбработкаУзла;
	Объект.АвтоДилер_Параметры.ОбработкаУзлаЧтение=Рез.ОбработкаУзлаЧтение;
	Если Рез.Свойство("ОбработкаДетали") тогда
		Объект.АвтоДилер_Параметры.ОбработкаДетали=Рез.ОбработкаДетали;
	иначе
		Объект.АвтоДилер_Параметры.ОбработкаДетали="";
	конецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПереходОбработкаУзлаТД(ИмяФункции)
	Рез=РеквизитФормыВЗначение("Объект").ВыполнитьСобытие(ИмяФункции);
	ЗначениеВРеквизитФормы(Рез.Дерево,"ДеревоУзлов");
	ДанныеВыбора.Очистить();
	Объект.АвтоДилер_Параметры.ОбработкаУзла=Рез.ОбработкаУзла;
	Возврат Рез.ИнфКомплектации;
КонецФункции

&НаКлиенте
Процедура АвтоДилер_ТД_ПросмотрОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Если Расшифровка.Функция="Возврат" тогда
		ПереходВозврат(Расшифровка.Уровень);
		Элементы.АвтоДилер_ТД_Просмотр.УстановитьВыделенныеОбласти(Новый Массив);
		Обл=ЭтаФорма["АвтоДилер_ТД_"+Строка(Объект.АвтоДилер_Параметры.Уровень+1)].Область(СтекПоложения.Получить(Объект.АвтоДилер_Параметры.Уровень).Значение);
		Выд=Новый Массив;
		Выд.Добавить(Обл);
		Элементы.АвтоДилер_ТД_Просмотр.УстановитьВыделенныеОбласти(Новый Массив);
		Элементы.АвтоДилер_ТД_Просмотр.ТекущаяОбласть=Обл;
		
	иначеЕсли Расшифровка.Функция="" тогда		 
		    Возврат;  
	иначеЕсли Расшифровка.Функция="ОбработкаУзла" тогда
		РежимТД=Ложь;	
		Объект.АвтоДилер_Параметры.Уровень=Объект.АвтоДилер_Параметры.Уровень+1;
		Объект.АвтоДилер_Параметры.СписокПросмотра.Получить(Объект.АвтоДилер_Параметры.Уровень).Значение=Расшифровка;
		ПереходОбработкаУзла(Расшифровка.ФункцияУзла);
		
		Элементы.СтрАвтоДилер.ТекущаяСтраница=Элементы.СтрАвтоДилерСписокУзлов;
		Если ДеревоУзлов.ПолучитьЭлементы().Количество()>0 тогда
			Элементы.ДеревоУзлов.Развернуть(ДеревоУзлов.ПолучитьЭлементы()[0].ПолучитьИдентификатор());
		КонецЕсли;
		Элементы.ЗаголовокУзла.Заголовок="";
		Элементы.ЗаголовокКартинки.Заголовок="";
		Элементы.СтрИнфОбщая.ТекущаяСтраница=Элементы.СтрКартинкаОбщая;
		Элементы.СтрИнфДеталиОбщая.Видимость=Ложь;
	иначеЕсли Расшифровка.Функция="ОбработкаУзлаТД" тогда
		РежимТД=Истина;	
		Объект.АвтоДилер_Параметры.Уровень=Объект.АвтоДилер_Параметры.Уровень+1;
		Объект.АвтоДилер_Параметры.СписокПросмотра.Получить(Объект.АвтоДилер_Параметры.Уровень).Значение=Расшифровка;
		Рез=ПереходОбработкаУзлаТД(Расшифровка.ФункцияУзла);
		Элементы.СтрАвтоДилер.ТекущаяСтраница=Элементы.СтрАвтоДилерСписокУзловТД;
		ЗаголовокУзлаТД=" ";
		ДанныеВыбораТД.Очистить();
	    Элементы.ОбщиеСведенияДетали.Видимость=Ложь;
		Элементы.СтрПрименяемосьТД.Видимость=Ложь;
		АвтоДилерИНФТД=Рез;
		Элементы.СтрТДИнф.ТекущаяСтраница=Элементы.СтрОписКомплектации;		
		Если ДеревоУзлов.ПолучитьЭлементы().Количество()>0 тогда
			Элементы.ДеревоУзловТД.Развернуть(ДеревоУзлов.ПолучитьЭлементы()[0].ПолучитьИдентификатор());
		КонецЕсли;

	иначе
		Объект.АвтоДилер_Параметры.Уровень=Объект.АвтоДилер_Параметры.Уровень+1;
		Если Объект.АвтоДилер_Параметры.Уровень<>0 тогда
			СтекПоложения.Получить(Объект.АвтоДилер_Параметры.Уровень-1).Значение=ЭтаФорма["АвтоДилер_ТД_"+Строка(Объект.АвтоДилер_Параметры.Уровень)].ТекущаяОбласть.Имя;	
		КонецЕсли;
		
		Объект.АвтоДилер_Параметры.СписокПросмотра.Получить(Объект.АвтоДилер_Параметры.Уровень).Значение=Расшифровка;
		ПереходВниз(Расшифровка.Функция);
		АвтоДилер_ТД_СбросПоложения();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВозвратИзУзлов(Команда)
	Объект.АвтоДилер_Параметры.Уровень=Объект.АвтоДилер_Параметры.Уровень-1;
	Элементы.СтрАвтоДилер.ТекущаяСтраница=Элементы.СтрАвтоДилерОсновная;
	АвтоДилер_ТД_СбросПоложения();
КонецПроцедуры

&НаКлиенте
Процедура АвтоДилер_ТД_УзелИнфоОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПодборДетали(Команда)
	ПоискП=Новый Структура("Марка,Номер");
	Для каждого Область из АвтоДилер_ТД_Узел.ВыделенныеОбласти Цикл
		Если ТипЗнч(Область) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
			Для ИндексСтрока = Область.Верх По Область.Низ Цикл
				Для ИндексКолонка = Область.Лево По Область.Право Цикл
					ЭлР=АвтоДилер_ТД_Узел.Область("R" + Формат(ИндексСтрока, "ЧГ=0") + "C" + Формат(ИндексКолонка, "ЧГ=0")).Расшифровка;  
					Если ТипЗнч(ЭлР)<>Тип("ФиксированнаяСтруктура") тогда
						Продолжить;
					КонецЕсли;
					Если ЭлР.Номер="" тогда
						Продолжить;
					КонецЕсли;
					ПоискП.Номер=СокрЛП(ЭлР.Номер);
					ПоискП.Марка=СокрЛП(ЭлР.Марка);
					СтрП=ДанныеВыбора.НайтиСтроки(ПоискП);
					Если СтрП.Количество()=0 тогда
						СтрД=ДанныеВыбора.Добавить();
						ЗаполнитьЗначенияСвойств(СтрД,ЭлР);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Элементы.АвтоДилер_ТД_Узел.УстановитьВыделенныеОбласти(Новый Массив());
	ДанныеВыбора.Сортировать("Марка,Номер");
КонецПроцедуры

&НаКлиенте
Процедура АвтоДилер_ТД_УзелОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
	Спис=Новый Массив();
	Дан=Новый Структура("Марка,Номер,Наименование,Дополнительно");
	Для каждого Эл из ДанныеВыбора Цикл
		ЗаполнитьЗначенияСвойств(Дан,Эл);
		Спис.Добавить(Новый ФиксированнаяСтруктура(Дан));
	конецЦикла;
	ОповеститьОВыборе(Спис);
КонецПроцедуры

Процедура ДобавитьОбновитьВБазуСервер(Спис)
	РеквизитФормыВЗначение("Объект").АПИ_АвтоДилер_СоздатьОбновитьНоменклатуру(Спис);
Конецпроцедуры

&НаКлиенте
Процедура ДобавитьОбновитьВБазу(Команда)
	Объект.АвтоДилер_Параметры.Склад=Склад;
	Объект.АвтоДилер_Параметры.ТипЦен=ТипЦен;
	Спис=Новый Массив;
	Если РежимТД=Ложь тогда	
		Для каждого Эл из Элементы.ДанныеВыбора.ВыделенныеСтроки Цикл
			Стр=Новый Структура("Артикул,Номенклатура,Производитель,Наименование,Цена,Остаток,резерв,Номенклатура,ПозицияЭлемента");
			Дан=Элементы.ДанныеВыбора.ДанныеСтроки(Эл);
			ЗаполнитьЗначенияСвойств(Стр,Дан);
			Стр.ПозицияЭлемента=Эл;
			Спис.Добавить(Стр);
		КонецЦикла;
		ДобавитьОбновитьВБазуСервер(Спис);
		СписДоб=Новый Массив();
		Для каждого Эл из Спис Цикл
			Дан=Элементы.ДанныеВыбора.ДанныеСтроки(Эл.ПозицияЭлемента);
			ЗаполнитьЗначенияСвойств(Дан,Эл);
			Если ЗначениеЗаполнено(Дан.Номенклатура) тогда
				Если Дан.Остаток<>0 тогда
					Дан.ТипСтроки=1;
				иначе
					Дан.ТипСтроки=2;
				КонецЕсли;
				СписДоб.Добавить(Дан);
			иначе
				Если Дан.Артикул<>""  тогда
					Дан.ТипСтроки=4;
				иначе
					Дан.ТипСтроки=5;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ПоискП=Новый Структура("Артикул");
		Для каждого Эл из СписДоб Цикл
			ПоискП.Артикул=Эл.Артикул;
			СтрП=ДанныеВыбора.НайтиСтроки(ПоискП);
			Для каждого ЭлП из СтрП Цикл
				ЭлП.Номенклатура=Эл.Номенклатура;
				ЭлП.ТипСтроки=Эл.ТипСтроки;
				ЭлП.Остаток=Эл.Остаток;
				ЭлП.Цена= Эл.Цена;
				ЭлП.резерв=Эл.Резерв;
			КонецЦикла;
			
		КонецЦикла;
	иначе
		
		Для каждого Эл из Элементы.ДанныеВыбораТД.ВыделенныеСтроки Цикл
			Стр=Новый Структура("Артикул,Номенклатура,Производитель,Наименование,Цена,Остаток,резерв,Номенклатура,ПозицияЭлемента");
			Дан=Элементы.ДанныеВыбораТД.ДанныеСтроки(Эл);
			ЗаполнитьЗначенияСвойств(Стр,Дан);
			Стр.ПозицияЭлемента=Эл;
			Спис.Добавить(Стр);
		КонецЦикла;
		ДобавитьОбновитьВБазуСервер(Спис);
		СписДоб=Новый Массив();
		Для каждого Эл из Спис Цикл
			Дан=Элементы.ДанныеВыбораТД.ДанныеСтроки(Эл.ПозицияЭлемента);
			ЗаполнитьЗначенияСвойств(Дан,Эл);
			Если ЗначениеЗаполнено(Дан.Номенклатура) тогда
				Если Дан.Остаток<>0 тогда
					Дан.ТипСтроки=1;
				иначе
					Дан.ТипСтроки=2;
				КонецЕсли;
				СписДоб.Добавить(Дан);
			иначе
				Если Дан.Артикул<>""  тогда
					Дан.ТипСтроки=4;
				иначе
					Дан.ТипСтроки=5;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ПоискП=Новый Структура("Артикул");
		Для каждого Эл из СписДоб Цикл
			ПоискП.Артикул=Эл.Артикул;
			СтрП=ДанныеВыбораТД.НайтиСтроки(ПоискП);
			Для каждого ЭлП из СтрП Цикл
				ЭлП.Номенклатура=Эл.Номенклатура;
				ЭлП.ТипСтроки=Эл.ТипСтроки;
				ЭлП.Остаток=Эл.Остаток;
				ЭлП.Цена= Эл.Цена;
				ЭлП.резерв=Эл.Резерв;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНоменклатуру(Команда)
	Если РежимТД=Ложь тогда
	
		Если Элементы.ДанныеВыбора.ТекущаяСтрока=Неопределено тогда
			Возврат;
		КонецЕсли;
		Если ЗначениеЗаполнено(Элементы.ДанныеВыбора.ТекущиеДанные.Номенклатура) тогда
			ОткрытьЗначение(Элементы.ДанныеВыбора.ТекущиеДанные.Номенклатура);
		КонецЕсли;
	иначе
		Если Элементы.ДанныеВыбораТД.ТекущаяСтрока=Неопределено тогда
			Возврат;
		КонецЕсли;
		Если ЗначениеЗаполнено(Элементы.ДанныеВыбораТД.ТекущиеДанные.Номенклатура) тогда
			ОткрытьЗначение(Элементы.ДанныеВыбораТД.ТекущиеДанные.Номенклатура);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьАртикулВПоиск(Команда)
	Если РежимТД=Ложь тогда
		Если Элементы.ДанныеВыбора.ТекущаяСтрока=Неопределено тогда
			Возврат;
		КонецЕсли;
		Если Элементы.ДанныеВыбора.ТекущиеДанные.Артикул="" тогда
			Возврат;
		КонецЕсли;
		ВладелецФормы.Объект.НомерАртикула=Элементы.ДанныеВыбора.ТекущиеДанные.Артикул;
	иначе
		Если Элементы.ДанныеВыбораТД.ТекущаяСтрока=Неопределено тогда
			Возврат;
		КонецЕсли;
		Если Элементы.ДанныеВыбораТД.ТекущиеДанные.Артикул="" тогда
			Возврат;
		КонецЕсли;
		ВладелецФормы.Объект.НомерАртикула=Элементы.ДанныеВыбораТД.ТекущиеДанные.Артикул;
	КонецЕсли;
	ВладелецФормы.Окно.Активизировать();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнфПоНоменклатуре(Ном)
	Возврат Новый Структура("СтавкаНДС,Артикул",Ном.СтавкаНДС,Ном.Артикул);
КонецФункции

&НаКлиенте
Процедура ДобавитьВКорзину(Команда)
	Если РежимТД=Ложь тогда	
		Для каждого Эл из Элементы.ДанныеВыбора.ВыделенныеСтроки Цикл
			Дан=Элементы.ДанныеВыбора.ДанныеСтроки(Эл);
			Если не ЗначениеЗаполнено(Дан.Номенклатура) тогда
				Продолжить;
			КонецЕсли;
			ДанНом=ПолучитьИнфПоНоменклатуре(Дан.Номенклатура);
			Стр=ВладелецФормы.Объект.ЗаявкаНаОформление.Добавить();
			Стр.Номенклатура=Дан.Номенклатура;
			Стр.Производитель=Дан.Производитель;
			Стр.Количество=1;
			Стр.НаименованиеТовара=Дан.Наименование;
			Стр.Склад=Склад;
			Стр.Наименование=Дан.Номенклатура;
			Стр.Артикул=ДанНом.Артикул;
			Стр.СтавкаНДС=ДанНом.СтавкаНДС;
			Стр.СуммаСоСкидкой=Дан.Цена;
			Стр.Всего=Дан.Цена;
			Стр.СуммаНДС=0;
			Если Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") ИЛИ 
				Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10_110") Тогда
				Стр.СуммаНДС = Окр(Стр.Сумма*(1-(1/1.10)),2);
			ИначеЕсли Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18") ИЛИ 
				Стр.СтавкаНДС=ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18_118") Тогда
				Стр.СуммаНДС = Окр(Стр.Сумма*(1-(1/1.18)),2);
			КонецЕсли;
			ЕСли ВладелецФормы.Объект.ЗаявкаНаОформление.Количество() > 0 Тогда
				ВладелецФормы.ЭтаФорма.Элементы.СтрКорзина.Заголовок = "Корзина (" + ВладелецФормы.Объект.ЗаявкаНаОформление.Количество() + ")";
			Иначе
				ВладелецФормы.ЭтаФорма.Элементы.СтрКорзина.Заголовок = "Корзина";
			КонецЕСли;
			ВладелецФормы.ЭтаФорма.СуммаКорзины=ВладелецФормы.Объект.ЗаявкаНаОформление.Итог("Всего");
		КонецЦикла;
	иначе
		Для каждого Эл из Элементы.ДанныеВыбораТД.ВыделенныеСтроки Цикл
			Дан=Элементы.ДанныеВыбораТД.ДанныеСтроки(Эл);
			Если не ЗначениеЗаполнено(Дан.Номенклатура) тогда
				Продолжить;
			КонецЕсли;
			ДанНом=ПолучитьИнфПоНоменклатуре(Дан.Номенклатура);
			Стр=ВладелецФормы.Объект.ЗаявкаНаОформление.Добавить();
			Стр.Номенклатура=Дан.Номенклатура;
			Стр.Производитель=Дан.Производитель;
			Стр.Количество=1;
			Стр.НаименованиеТовара=Дан.Наименование;
			Стр.Склад=Склад;
			Стр.Наименование=Дан.Номенклатура;
			Стр.Артикул=ДанНом.Артикул;
			Стр.СтавкаНДС=ДанНом.СтавкаНДС;
			Стр.СуммаСоСкидкой=Дан.Цена;
			Стр.Всего=Дан.Цена;
			Стр.СуммаНДС=0;
			Если Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") ИЛИ 
				Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10_110") Тогда
				Стр.СуммаНДС = Окр(Стр.Сумма*(1-(1/1.10)),2);
			ИначеЕсли Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18") ИЛИ 
				Стр.СтавкаНДС=ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18_118") Тогда
				Стр.СуммаНДС = Окр(Стр.Сумма*(1-(1/1.18)),2);
			КонецЕсли;
			ЕСли ВладелецФормы.Объект.ЗаявкаНаОформление.Количество() > 0 Тогда
				ВладелецФормы.ЭтаФорма.Элементы.СтрКорзина.Заголовок = "Корзина (" + ВладелецФормы.Объект.ЗаявкаНаОформление.Количество() + ")";
			Иначе
				ВладелецФормы.ЭтаФорма.Элементы.СтрКорзина.Заголовок = "Корзина";
			КонецЕСли;
			ВладелецФормы.ЭтаФорма.СуммаКорзины=ВладелецФормы.Объект.ЗаявкаНаОформление.Итог("Всего");
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоУзловТДВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	РежимТД=Истина;
	Дан=Элементы.ДеревоУзлов.ДанныеСтроки(ВыбраннаяСтрока);
	Если  Дан.Каталог=1 тогда
		Возврат;
	КонецЕсли;
	Если Объект.АвтоДилер_Параметры.ОбработкаУзла="" тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка=Ложь;
	Объект.АвтоДилер_Параметры.Склад=Склад;
	Объект.АвтоДилер_Параметры.ТипЦен=ТипЦен;
	Объект.АвтоДилер_Параметры.ПараметрыУзла=Элементы.ДеревоУзлов.ДанныеСтроки(ВыбраннаяСтрока).ПараметрУзла;
	Объект.АвтоДилер_Параметры.ПоказыватьКартинку=ПоказыватьКартинку;
	Рез=ДеревоУзловВыборНаСервере();
	СтрВр=Дан.Наименование;
	Род=Дан.ПолучитьРодителя();
	ГлУзел=ДеревоУзлов.ПолучитьЭлементы()[0];
	Пока Род<>ГлУзел Цикл
		СтрВр=Род.Наименование+"\"+СтрВр;
		Род=Род.ПолучитьРодителя();
	КонецЦикла;
	ПрименяемостьТД=ложь;
	ЗаголовокУзлаТД=СтрВр;
    Элементы.ОбщиеСведенияДетали.Видимость=Ложь;
	Элементы.СтрПрименяемосьТД.Видимость=Ложь;
	Элементы.СтрТДИнф.ТекущаяСтраница=Элементы.СтрОписКомплектации;
	ДанныеВыбораТД.Очистить();
	Для каждого Эл из Рез.СписокВыбора Цикл
		СтрД=ДанныеВыбораТД.Добавить();
		ЗаполнитьЗначенияСвойств(СтрД,Эл);
		Если ЗначениеЗаполнено(СтрД.Номенклатура) тогда
			Если СтрД.Остаток<>0 тогда
				СтрД.ТипСтроки=1;
			иначе
				СтрД.ТипСтроки=2;
			КонецЕсли;
		иначе
			Если СтрД.Артикул<>""  тогда
				СтрД.ТипСтроки=4;
			иначе
				СтрД.ТипСтроки=5;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ИнфДетальТД(ИмяФункции)
	Возврат РеквизитФормыВЗначение("Объект").ВыполнитьСобытие(ИмяФункции);
КонецФункции

&НаКлиенте
Процедура ДанныеВыбораТДВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Если ВыбраннаяСтрока=Неопределено тогда
		Возврат;
	КонецЕсли;
	Дан=Элементы.ДанныеВыбораТД.ДанныеСтроки(ВыбраннаяСтрока);
	Объект.АвтоДилер_Параметры.ПоказыватьКартинку=ПоказыватьКартинку;
	Объект.АвтоДилер_Параметры.ПараметрДетали=Дан.ИнфДетали;
	Рез=ИнфДетальТД("АПИ_АвтоДилер_ТД_ИнфДетальТД");
	ИНформацияТДДетали=Рез.ИнфДетали;
	ПрименяемостьТД=ложь;
    Элементы.ОбщиеСведенияДетали.Видимость=истина;
	Элементы.СтрПрименяемосьТД.Видимость=истина;
	Элементы.СтрТДИнф.ТекущаяСтраница=Элементы.ОбщиеСведенияДетали;
КонецПроцедуры

&НаСервере
Функция ИнфПрименяемостьТД(ИмяФункции)
	Возврат РеквизитФормыВЗначение("Объект").ВыполнитьСобытие(ИмяФункции);
КонецФункции

&НаКлиенте
Процедура СтрТДИнфПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница=Элементы.СтрПрименяемосьТД тогда
		Если ПрименяемостьТД=ложь тогда
			// Получить информациию о применяемости
			Состояние("Ждите идет считывание применяемости ...");
			АвтоДилерПрименяемостьТД=ИнфПрименяемостьТД("АПИ_АвтоДилер_ТД_ИнфПрименямостьТД");
			ПрименяемостьТД=Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьИнфДетали(ИмяФункции)
	Возврат РеквизитФормыВЗначение("Объект").ВыполнитьСобытие(ИмяФункции);
конецФункции

&НаКлиенте
Процедура ДанныеВыбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Если Элементы.ДанныеВыбора.ТекущаяСтрока=Неопределено тогда
		Возврат;
	КонецЕсли;
	Если Объект.АвтоДилер_Параметры.ОбработкаДетали<>"" тогда
		Дан=Элементы.ДанныеВыбора.ДанныеСтроки( Элементы.ДанныеВыбора.ТекущаяСтрока);
		Объект.АвтоДилер_Параметры.ПараметрДетали=Дан.ПараметрДетали;
		ИнфДеталиОбщая=ПолучитьИнфДетали(Объект.АвтоДилер_Параметры.ОбработкаДетали);
		Элементы.СтрИнфОбщая.ТекущаяСтраница=Элементы.СтрИнфДеталиОбщая;
		Элементы.СтрИнфДеталиОбщая.Видимость=Истина;
		
	КонецЕсли;
КонецПроцедуры


