
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Клиент = Параметры.Клиент;
	Таблица = Параметры.ВсеПредложения;
	
	Если Не ЗначениеЗаполнено(Клиент) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Для Каждого Строка из Таблица Цикл
		
		НоваяСтрока = ВсеПредложения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ВсеПредложенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДокументИсточник) Тогда
		
		ФормаКалькуляции = Элемент.ТекущиеДанные.ДокументИсточник.ПолучитьФорму();
		ФормаКалькуляции.ТолькоПросмотр = Истина;
		ФормаКалькуляции.Открыть();
		
	КонецЕсли;
	
КонецПроцедуры
