
&НаКлиенте
Процедура Заполнить(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОбОчистке", ЭтаФорма), "Скидки по документам Изменение скидок на автомобили будут перезаполнены, продолжить?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОчистке(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПрочиеСкидкиНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПрочиеСкидкиНаСервере()
	
	// НАЧАЛО DMSCOR-1030
	СтрокиНаУдалениеМ = Новый Массив;
	
	Для Каждого Стр Из ТЧ Цикл
		Если ЗначениеЗаполнено(Стр.Документ) ИЛИ Стр.СуммаСкидки = 0 Тогда
			СтрокиНаУдалениеМ.Добавить(Стр);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Стр Из СтрокиНаУдалениеМ Цикл
		ИндексСтроки = ТЧ.Индекс(Стр);
		ТЧ.Удалить(ИндексСтроки);
	КонецЦикла;
	
	// Ранее было:
	//Для Каждого Стр Из ТЧ Цикл
	//	Если ЗначениеЗаполнено(Стр.Документ) ИЛИ Стр.СуммаСкидки = 0 Тогда
	//		ТЧ.Удалить(Стр);
	//	КонецЕсли;
	//КонецЦикла;
	
	// КОНЕЦ DMSCOR-1030 
	
	//Определим количество дней автомобиля на складе
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	//|	ОстаткиАвтомобилейОстатки.Автомобиль,
	//|	НАЧАЛОПЕРИОДА(ОстаткиАвтомобилейОстатки.Партия.Дата, ДЕНЬ) КАК ДатаПартии,
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ОстаткиАвтомобилейОстатки.Партия.Дата, ДЕНЬ), НАЧАЛОПЕРИОДА(&ДатаПериода, ДЕНЬ), ДЕНЬ) КАК ДнейНаСкладе
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилейОстатки
	|ГДЕ
	|	ОстаткиАвтомобилейОстатки.Автомобиль = &Автомобиль";
	Запрос.УстановитьПараметр("ДатаПериода", ДатаДоговора);
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	КоличествоДнейНаСкладе = ?(РезультатЗапроса.Следующий(), РезультатЗапроса.ДнейНаСкладе, 0);
	
	//Определим наличие ПТС
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1 1
	|ИЗ
	|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|ГДЕ
	|	ПодтверждающиеДокументы.Владелец = &Владелец
	|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = &ВидПодтверждающегоДокумента
	|	И ПодтверждающиеДокументы.Текущий
	|	И НЕ ПодтверждающиеДокументы.Устаревший
	|	И НЕ ПодтверждающиеДокументы.ПометкаУдаления";
	Запрос.УстановитьПараметр("Владелец", Автомобиль);
	Запрос.УстановитьПараметр("ВидПодтверждающегоДокумента", Перечисления.ВидыДокументов.ПТС);
	РезультатЗапроса = Запрос.Выполнить();
	
	ЕстьПТС = ?(РезультатЗапроса.Пустой(), Ложь, Истина);
	
	//Год выпуска и статус
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.Автомобиль,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.Статус,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.YEAR
	|ИЗ
	|	РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
	|ГДЕ
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.Автомобиль = &Автомобиль";
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		СтатусАвтомобиля = РезультатЗапроса.Статус;
		ГодВыпуска = РезультатЗапроса.YEAR;
	Иначе
		СтатусАвтомобиля = Перечисления.CRM_СтатусыАвтомобилей.ПустаяСсылка();
		ГодВыпуска = 1;
	КонецЕсли;
	
	//Отбор скидок
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Renault_СкидкиНаАвтомобили.ПроцентСкидки КАК ПроцентСкидки,
	               |	Renault_СкидкиНаАвтомобили.СуммаСкидки КАК СуммаСкидки,
	               |	Renault_СкидкиНаАвтомобили.ТипСкидки КАК ТипСкидки,
	               |	Renault_СкидкиНаАвтомобили.Регистратор КАК Документ,
	               |	Renault_СкидкиНаАвтомобили.ДатаНачала,
	               |	Renault_СкидкиНаАвтомобили.ДатаКонца
	               |ПОМЕСТИТЬ ВТСкидки
	               |ИЗ
	               |	РегистрСведений.Renault_СкидкиНаАвтомобили КАК Renault_СкидкиНаАвтомобили
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(Renault_СкидкиНаАвтомобили.ДатаНачала, ДЕНЬ) <= &ДатаДоговора
	               |	И КОНЕЦПЕРИОДА(Renault_СкидкиНаАвтомобили.ДатаКонца, ДЕНЬ) >= &ДатаДоговора
	               |	И Renault_СкидкиНаАвтомобили.ДилерскийЦентр = &ДилерскийЦентр
	               |	И Renault_СкидкиНаАвтомобили.Автомобиль = &Автомобиль
	               |	И Renault_СкидкиНаАвтомобили.Активность
	               |	И Renault_СкидкиНаАвтомобили.ТипСкидки <> &КоммАкция
	               |	И Renault_СкидкиНаАвтомобили.КоличествоДнейНаСкладе <= &КоличествоДнейНаСкладе
	               |	И (Renault_СкидкиНаАвтомобили.СтатусАвтомобиля = &СтатусАвтомобиля
	               |			ИЛИ Renault_СкидкиНаАвтомобили.СтатусАвтомобиля = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыАвтомобилей.ПустаяСсылка))
	               |	И (ГОД(Renault_СкидкиНаАвтомобили.ГодВыпуска) = &ГодВыпуска
	               |			ИЛИ ГОД(Renault_СкидкиНаАвтомобили.ГодВыпуска) = 1)
	               |	И (&НаличиеПТС
	               |			ИЛИ НЕ Renault_СкидкиНаАвтомобили.НаличиеПТС)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Renault_СкидкиНаАвтомобили.ПроцентСкидки,
	               |	Renault_СкидкиНаАвтомобили.СуммаСкидки,
	               |	Renault_СкидкиНаАвтомобили.ТипСкидки,
	               |	Renault_СкидкиНаАвтомобили.Регистратор,
	               |	Renault_СкидкиНаАвтомобили.ДатаНачала,
	               |	Renault_СкидкиНаАвтомобили.ДатаКонца
	               |ИЗ
	               |	РегистрСведений.Renault_СкидкиНаАвтомобили КАК Renault_СкидкиНаАвтомобили
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(Renault_СкидкиНаАвтомобили.ДатаНачала, ДЕНЬ) <= &ДатаДоговора
	               |	И КОНЕЦПЕРИОДА(Renault_СкидкиНаАвтомобили.ДатаКонца, ДЕНЬ) >= &ДатаДоговора
	               |	И Renault_СкидкиНаАвтомобили.ДилерскийЦентр = &ДилерскийЦентр
	               |	И Renault_СкидкиНаАвтомобили.ВариантКомплектации = &ВариантКомплектации
	               |	И Renault_СкидкиНаАвтомобили.Активность
	               |	И Renault_СкидкиНаАвтомобили.ТипСкидки <> &КоммАкция
	               |	И Renault_СкидкиНаАвтомобили.КоличествоДнейНаСкладе <= &КоличествоДнейНаСкладе
	               |	И (Renault_СкидкиНаАвтомобили.СтатусАвтомобиля = &СтатусАвтомобиля
	               |			ИЛИ Renault_СкидкиНаАвтомобили.СтатусАвтомобиля = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыАвтомобилей.ПустаяСсылка))
	               |	И (ГОД(Renault_СкидкиНаАвтомобили.ГодВыпуска) = &ГодВыпуска
	               |			ИЛИ ГОД(Renault_СкидкиНаАвтомобили.ГодВыпуска) = 1)
	               |	И НЕ &НаличиеПТС
	               |	И НЕ Renault_СкидкиНаАвтомобили.НаличиеПТС
	               |	И (&НаличиеПТС
	               |			ИЛИ НЕ Renault_СкидкиНаАвтомобили.НаличиеПТС)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТСкидки.ПроцентСкидки КАК ПроцентСкидки,
	               |	ВТСкидки.СуммаСкидки КАК СуммаСкидки,
	               |	ВТСкидки.ТипСкидки КАК ТипСкидки,
	               |	ВТСкидки.Документ КАК Документ,
	               |	ВТСкидки.ДатаНачала,
	               |	ВТСкидки.ДатаКонца
	               |ИЗ
	               |	ВТСкидки КАК ВТСкидки";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("ВариантКомплектации", ВариантКомплектации);
	Запрос.УстановитьПараметр("ДилерскийЦентр", ДилерскийЦентр);
	Запрос.УстановитьПараметр("ДатаДоговора", ДатаДоговора);
	Запрос.УстановитьПараметр("КоммАкция", Справочники.ТипыСкидок.НайтиПоКоду("RenltCA"));
	Запрос.УстановитьПараметр("КоличествоДнейНаСкладе", КоличествоДнейНаСкладе);
	Запрос.УстановитьПараметр("СтатусАвтомобиля", СтатусАвтомобиля);
	Запрос.УстановитьПараметр("ГодВыпуска", ГодВыпуска);
	Запрос.УстановитьПараметр("НаличиеПТС", ЕстьПТС);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_СкидкиНаАвтомобили.ПроцентСкидки,
		|	Renault_СкидкиНаАвтомобили.СуммаСкидки,
		|	Renault_СкидкиНаАвтомобили.ТипСкидки,
		|	Renault_СкидкиНаАвтомобили.Регистратор КАК Документ,
		|	Renault_СкидкиНаАвтомобили.ДатаНачала,
		|	Renault_СкидкиНаАвтомобили.ДатаКонца
		|ИЗ
		|	РегистрСведений.Renault_СкидкиНаАвтомобили КАК Renault_СкидкиНаАвтомобили
		|ГДЕ
		|	Renault_СкидкиНаАвтомобили.Автомобиль ССЫЛКА Справочник.Модели
		|	И НАЧАЛОПЕРИОДА(Renault_СкидкиНаАвтомобили.ДатаНачала, ДЕНЬ) <= &ДатаДоговора
		|	И КОНЕЦПЕРИОДА(Renault_СкидкиНаАвтомобили.ДатаКонца, ДЕНЬ) >= &ДатаДоговора
		|	И Renault_СкидкиНаАвтомобили.ДилерскийЦентр = &ДилерскийЦентр
		|	И Renault_СкидкиНаАвтомобили.Автомобиль = &Модель
		|	И Renault_СкидкиНаАвтомобили.Активность
		|	И Renault_СкидкиНаАвтомобили.ТипСкидки <> &КоммАкция
		|	И Renault_СкидкиНаАвтомобили.КоличествоДнейНаСкладе <= &КоличествоДнейНаСкладе
		|	И (Renault_СкидкиНаАвтомобили.СтатусАвтомобиля = &СтатусАвтомобиля
		|			ИЛИ Renault_СкидкиНаАвтомобили.СтатусАвтомобиля = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыАвтомобилей.ПустаяСсылка))
		|	И (ГОД(Renault_СкидкиНаАвтомобили.ГодВыпуска) = &ГодВыпуска
		|			ИЛИ ГОД(Renault_СкидкиНаАвтомобили.ГодВыпуска) = 1)
		|	И (&НаличиеПТС
		|			ИЛИ НЕ Renault_СкидкиНаАвтомобили.НаличиеПТС)";
		
		Запрос.УстановитьПараметр("Модель", ВариантКомплектации.Владелец);
		Запрос.УстановитьПараметр("ДилерскийЦентр", ДилерскийЦентр);
		Запрос.УстановитьПараметр("ДатаДоговора", ДатаДоговора);
		Запрос.УстановитьПараметр("КоммАкция", Справочники.ТипыСкидок.НайтиПоКоду("RenltCA"));
		Запрос.УстановитьПараметр("КоличествоДнейНаСкладе", КоличествоДнейНаСкладе);
		Запрос.УстановитьПараметр("СтатусАвтомобиля", СтатусАвтомобиля);
		Запрос.УстановитьПараметр("ГодВыпуска", ГодВыпуска);
		Запрос.УстановитьПараметр("НаличиеПТС", ЕстьПТС);
		Результат = Запрос.Выполнить();
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НовСтр = ТЧ.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
		
		Если Выборка.ПроцентСкидки > 0 Тогда
			НовСтр.СуммаСкидки = СуммаКонфигурации * Выборка.ПроцентСкидки/100;	
		КонецЕсли;	
	КонецЦикла;
	
	ИтогоСкидка = Тч.Итог("СуммаСкидки")
	
КонецПроцедуры	
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоКорпоративныйКлиент = Параметры.ЭтоКорпоративныйКлиент;
	
	Для Каждого Стр Из Параметры.Строки Цикл
		
		//++ DMSREN-57
		//Если Параметры.Свойство("ТипСкидки_Renault") Тогда
		//	Если Параметры.ТипСкидки_Renault<>Стр.ТипСкидки Тогда
		//		ЗаполнитьЗначенияСвойств(ТЧ.Добавить(), Стр);
		//	КонецЕсли;
		//Иначе
		//	ЗаполнитьЗначенияСвойств(ТЧ.Добавить(), Стр);
		//КонецЕсли;
		
		Если Стр.Документ <> Документы.Renault_ИзменениеСкидокНаАвтомобили.ПустаяСсылка() Тогда
			ЗаполнитьЗначенияСвойств(ТЧ.Добавить(), Стр);
		КонецЕсли; 
		//--DMSREN-57
		
	КонецЦикла;
	ИтогоСкидка = ТЧ.Итог("СуммаСкидки");
		
	Если Параметры.Свойство("ЭтоКП") Тогда
		Если Параметры.ЭтоКП Тогда
			ЕстьПравоНаСкидкуВКП = ПараметрыСеанса.Renault_ПраваПользователя.СкидкаНаАвтомобильВКП;
		КонецЕсли;
	КонецЕсли;
	
	ЕстьПравоСкидки = ПараметрыСеанса.Renault_ПраваПользователя.Скидка;
	
	Если Параметры.Свойство("Автомобиль") Тогда
		Автомобиль = Параметры.Автомобиль;
	КонецЕсли;
	Если Параметры.Свойство("ВариантКомплектации") Тогда
		ВариантКомплектации = Параметры.ВариантКомплектации;
	КонецЕсли;
	Если Параметры.Свойство("ДатаДоговора") Тогда
		ДатаДоговора = Параметры.ДатаДоговора;
	КонецЕсли;
	Если Параметры.Свойство("ДилерскийЦентр") Тогда
		ДилерскийЦентр = Параметры.ДилерскийЦентр;
	КонецЕсли;
	
	Если Параметры.Свойство("СуммаКонфигурации") Тогда
		СуммаКонфигурации = Параметры.СуммаКонфигурации;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура кнОК(Команда)
	
	МассивСтрок = Новый Массив;
	Для Каждого Стр Из ТЧ Цикл
		МассивСтрок.Добавить(Новый Структура("ТипСкидки,ПроцентСкидки,СуммаСкидки,Документ,ДатаНачала,ДатаКонца", Стр.ТипСкидки, Стр.ПроцентСкидки, Стр.СуммаСкидки, Стр.Документ, Стр.ДатаНачала, Стр.ДатаКонца));
	КонецЦикла;
	
	ОповеститьОВыборе(МассивСтрок);
	
	//Закрыть(МассивСтрок)
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧСуммаСкидкиПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТЧ.ТекущиеДанные;

	Если ЗначениеЗаполнено(ТекДанные.Документ) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТЧСуммаСкидкиПревышаетПорог() Тогда
		ТекДанные.СуммаСкидки = 0;
	КонецЕсли;
	
	ИтогоСкидка = ТЧ.Итог("СуммаСкидки");

КонецПроцедуры

&НаСервере
Функция ТЧСуммаСкидкиПревышаетПорог()
	
	ИтогоСкидка = ТЧ.Итог("СуммаСкидки");

	Если ПолучитьПараметрПользователя("Скидка") Тогда
		МаксимальнаяСуммаСкидки = ПолучитьПараметрПользователя("СкидкаМаксимальнаяСумма");
		
		Если ИтогоСкидка > МаксимальнаяСуммаСкидки Тогда
			Сообщить("Сумма всех скидок превышает максимальный порог скидок, поэтому не может быть установлена!");
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ПолучитьПараметрПользователя(Право) 
	Возврат ПараметрыСеанса.Renault_ПраваПользователя[Право]; 
КонецФункции

&НаКлиенте
Процедура ТЧПередУдалением(Элемент, Отказ)
	
	ПроверитьПраваНаСкидки(Отказ);
	
	ТД = Элементы.ТЧ.ТекущиеДанные;
	
	Если ТД <> Неопределено Тогда
		
		КодСкидки = ПолучитьРеквизитПоСсылке(ТД.ТипСкидки, "Код");
		
		Если СокрЛП(КодСкидки) = "RenltCA" Тогда
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧПриАктивизацииСтроки(Элемент)
	
	//++ DMSREN-57
	//ТД = Элементы.ТЧ.ТекущиеДанные;
	//
	//Если ТД <> Неопределено Тогда
	//	
	//	КодСкидки = ПолучитьРеквизитПоСсылке(ТД.ТипСкидки, "Код");
	//	
	//	Элементы.ТЧТипСкидки.ТолькоПросмотр = СокрЛП(КодСкидки) = "RenltCA";
	//	Элементы.ТЧСуммаСкидки.ТолькоПросмотр = СокрЛП(КодСкидки) = "RenltCA";
	//	
	//КонецЕсли;
	//-- DMSREN-57
	
	ИтогоСкидка = Тч.Итог("СуммаСкидки")
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитПоСсылке(Ссылка, ИмяРеквизита)
	
	Возврат Ссылка[ИмяРеквизита];
	
КонецФункции // ПолучитьРеквизитПоСсылке()

&НаКлиенте
Процедура ТЧПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ПроверитьПраваНаСкидки(Отказ);
	
	ФормаДок = ПолучитьФорму("Документ.Renault_ИзменениеСкидокНаАвтомобили.Форма.ФормаДокумента",,ЭтаФорма);
	ФормаДок.Автомобиль = Автомобиль;
	ФОрмаДок.ВариантКомплектации = ВариантКомплектации;
	ФормаДок.ДатаНачала = ДатаДоговора;
	
	ФормаДок.ОткрытьМодально();
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧПередНачаломИзменения(Элемент, Отказ)
	ПроверитьПраваНаСкидки(Отказ);
КонецПроцедуры

Процедура ПроверитьПраваНаСкидки(Отказ)

	Если Не ЕстьПравоСкидки И НЕ ЕстьПравоНаСкидкуВКП Тогда
		Отказ = Истина;
		Сообщить("Нет прав на установку и редактирование скидок");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТЧТипСкидкиПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТЧ.ТекущиеДанные;

	Если ЗначениеЗаполнено(ТекДанные.Документ) Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СоздатьИзменениеСкидки" Тогда
		// НАЧАЛО DMSCOR-1028
		//ЗаполнитьПрочиеСкидкиНаСервере();
		Если ЗначениеЗаполнено(Параметр) Тогда
			ДобавитьДокументВТЧ(Параметр);
		КонецЕсли;
		// КОНЕЦ
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Элементы.ТЧ.ТекущиеДанные.Документ) Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Документ.Renault_ИзменениеСкидокНаАвтомобили.Форма.ФормаДокумента", Новый Структура("Ключ", Элементы.ТЧ.ТекущиеДанные.Документ));
	КонецЕсли;
	
КонецПроцедуры

// НАЧАЛО DMSCOR-1028
&НаСервере
Процедура ДобавитьДокументВТЧ(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Renault_СкидкиНаАвтомобили.СуммаСкидки КАК СуммаСкидки,
	               |	Renault_СкидкиНаАвтомобили.ТипСкидки КАК ТипСкидки,
	               |	Renault_СкидкиНаАвтомобили.Регистратор КАК Документ,
	               |	Renault_СкидкиНаАвтомобили.ПроцентСкидки,
	               |	Renault_СкидкиНаАвтомобили.ДатаНачала,
	               |	Renault_СкидкиНаАвтомобили.ДатаКонца
	               |ИЗ
	               |	РегистрСведений.Renault_СкидкиНаАвтомобили КАК Renault_СкидкиНаАвтомобили
	               |ГДЕ
	               |	Renault_СкидкиНаАвтомобили.Автомобиль = &Автомобиль
	               |	И Renault_СкидкиНаАвтомобили.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
		
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НовСтр = ТЧ.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
		Если Выборка.ПроцентСкидки > 0 Тогда
			НовСтр.СуммаСкидки = СуммаКонфигурации * Выборка.ПроцентСкидки/100;	
		КонецЕсли;
	КонецЦикла;
	
	ИтогоСкидка = Тч.Итог("СуммаСкидки")
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧПриИзменении(Элемент)
	ИтогоСкидка = Тч.Итог("СуммаСкидки")
КонецПроцедуры
// КОНЕЦ
