//Козлов Е.А. Начало 06.04.2016
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ДилерскийЦентр = Неопределено;
		Клиент = Неопределено;
		
		ЭтаФорма.Параметры.Свойство("ДилерскийЦентр", ДилерскийЦентр);
		ЭтаФорма.Параметры.Свойство("Клиент", Клиент);
		
		ТекущийПользователь = ПараметрыСеанса.Пользователь;
		
		Если ЗначениеЗаполнено(ДилерскийЦентр) Тогда
			Объект.ДилерскийЦентр = ДилерскийЦентр;		
			Объект.Откуда = ДилерскийЦентр.ОсновнойАдрес;
		Иначе
			Элементы.ДилерскийЦентр.ТолькоПросмотр = Ложь;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Клиент) Тогда
			Объект.Клиент = Клиент;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущийПользователь) Тогда 	
			Объект.Автор = ТекущийПользователь;
		Иначе
			Элементы.Автор.ТолькоПросмотр = Ложь;
		КонецЕсли;
		
		Объект.ВремяЗаезда = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВремяЗаездаПриИзменении(Элемент)
	ТекущаяДата = ТекущаяДата();
	
	Если День(Объект.ВремяЗаезда) = День(ТекущаяДата) Тогда
		Объект.ВремяЗаезда = ТекущаяДата;
	КонецЕсли;	
КонецПроцедуры 

&НаКлиенте
Процедура ДилерскийЦентрПриИзменении(Элемент)
	Объект.Откуда = ПолучитьАдресДилерскогоЦентра(Объект.ДилерскийЦентр);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАдресДилерскогоЦентра(ДилерскийЦентр)
	Возврат ДилерскийЦентр.ОсновнойАдрес;
КонецФункции
//Козлов Е.А. Конец 06.04.2016