
Функция GetCarBalanceReportМетод1(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type","application/json; charset=UTF-8");
	Попытка
		Тело = ПолучениеОтчетаИКонвертацияВJSON(); 
		Ответ.УстановитьТелоИзСтроки(Тело,"UTF-8");
		Возврат Ответ;
	Исключение 
		Ответ.КодСостояния = 409;
		Возврат Ответ;
	КонецПопытки
КонецФункции

Функция ПолучениеОтчетаИКонвертацияВJSON()
	Обработка = Обработки.ОстаткиАвтоНаСкладеИВЗаказахПоставщикам;
	
	Отчет = Обработка.ВыводТаблицы().Выгрузить();	
	
	МассивОбъектов = Новый Массив;
	Колонки = Отчет.Колонки;
	Для Каждого Строка Из Отчет Цикл  	
		JSONОбъект = Новый Структура;
		Для Каждого Колонка Из Колонки Цикл 
			ЛистНужныхКолонок = Новый Структура("НомерСтроки,Владелец,ВидАвтомобиля,ДилерскийЦентр,Марка,Модель,VIN,ГодВыпуска,ВариантКомплектации,ТипКузова,ТипТоплива,ТипКПП,ТипПривода,КодЦветаКузова,Цвет,ЦветСалонаАвтомобиля,РРЦ,СкидкаПриПокупкеВТрейдИн,СкидкаПриПокупкеВКредит,Инвойс,СебестоимостьДО,ЛогистическийСтатус,ЗаказНаАвтомобиль,РодительПодразделенияЗаказаНаАвтомобиль,СуммаПредоплаты,Клиент,ФактическиОплачено,Менеджер,ДатаДоставки,СрокХранения,ОплаченПоставщику,ЕстьНезакрытыеЗНиКомпл,СтоимостьСуточногоХранения,ОбщаяСтоимостьХранения");
			Если Не ЛистНужныхКолонок.Свойство(Колонка.Имя)Тогда
				Продолжить;
			КонецЕсли;
			Значение = Строка[Колонка.Имя]; 
			Если ТипЗнч(Значение) <> Тип("Число") Или
				 ТипЗнч(Значение) <> Тип("Строка") Или
				 ТипЗнч(Значение) <> Тип("Дата") Или
				 ТипЗнч(Значение) <> Тип("Булево") Тогда 
			Значение = Строка(Значение);	 
			КонецЕсли;
			JSONОбъект.Вставить(Колонка.Имя,Значение);
		КонецЦикла; 
		МассивОбъектов.Добавить(JSONОбъект);
	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	СтрJSON = Новый Структура("Array",МассивОбъектов);
	ЗаписатьJSON(ЗаписьJSON,СтрJSON);
	
	JSON = ЗаписьJSON.Закрыть();
	
	Возврат JSON;
	
КонецФункции