Функция УбратьЗапрещенныеСимволы(выбСтрока)
	// функция замещает запрещенные символы на _ в строке
	
	РазрешенныеСимволы = "ЙЦУКЕНГШЩЗХЪФЫВАПРОЛДЖЭЯЧСМИТЬБЮQWERTYUIOPASDFGHJKLZXCVBNM1234567890_";
	
	рСТрока = "";
	Для сч=1 по СтрДлина(выбСтрока) Цикл
		нСимвол = Сред(СокрЛП(выбСтрока),сч,1);
		Если Найти(РазрешенныеСимволы,ВРег(нСимвол))=0 Тогда
			рСтрока = рСтрока+"_";
		Иначе
			рСтрока = рСтрока+нСимвол;
		КонецЕсли;			
	КонецЦикла;
	
	Возврат рСтрока;
КонецФункции

Процедура ЗаполнитьНастройкиОтчета(НастройкиОтчета, ЭтоДиаграмма=Ложь) Экспорт
	
	СписокРесурсов = Новый СписокЗначений;
	СписокПолей = Новый СписокЗначений;
	
	Для Каждого текСтрока Из ДоступныеПоляОтчета Цикл
		Если текСтрока.Пометка=Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		Если текСтрока.Ресурс Тогда
			Элемент = СписокРесурсов.Добавить(текСтрока.ИмяПоля);
			Элемент.Пометка = текСтрока.Пометка;
		Иначе
			Элемент = СписокПолей.Добавить(текСтрока.ИмяПоля);
			Элемент.Пометка = текСтрока.Пометка;
		КОнецЕсли;
	КонецЦикла;
	
	// добавим выбранные группировки                    
	Для Каждого текРесурс Из СписокРесурсов Цикл
		Если НайтиПолеКомпоновки(текРесурс.Значение, НастройкиОтчета.Выбор.Элементы) ИЛИ НЕ текРесурс.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
 		ПолеРесурса = НастройкиОтчета.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеРесурса.Использование = Истина;
		ПолеРесурса.Заголовок = текРесурс.Значение;
		ПолеРесурса.Поле = Новый ПолеКомпоновкиДанных(текРесурс.Значение);
	КонецЦикла;
	
	////////////
	НастройкиОтчета.Выбор.Элементы.Очистить();
	Для Каждого ПолеОтчета Из ДоступныеПоляОтчета Цикл
		Если ПолеОтчета.Пометка Тогда
			ПолеРесурса = НастройкиОтчета.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ПолеРесурса.Использование = Истина;
			ПолеРесурса.Заголовок = ПолеОтчета.ИмяПоля;
			ПолеРесурса.Поле = Новый ПолеКомпоновкиДанных(ПолеОтчета.ИмяПоля);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ПолеОтчета Из ДоступныеРесурсыОтчета Цикл
		Если ПолеОтчета.Пометка Тогда
			ПолеРесурса = НастройкиОтчета.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ПолеРесурса.Использование = Истина;
			//ПолеРесурса.Заголовок = ПолеОтчета.ИмяПоля;
			ПолеРесурса.Заголовок = ПолеОтчета.Представление;
			ПолеРесурса.Поле = Новый ПолеКомпоновкиДанных(ПолеОтчета.ИмяПоля);
		КонецЕсли;
	КонецЦикла;
	
	НастройкиОтчета.Структура.Очистить();
	
	НастройкиОтчета.УсловноеОформление.Элементы[0].Оформление.Элементы.Найти("Формат").Значение = "ЧДЦ=2";
	
	если ЭтоДиаграмма Тогда
 		ПолеДиаграммы = НастройкиОтчета.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеДиаграммы.Использование = Истина;
		ПолеДиаграммы.Заголовок = ГруппировкаДиаграммы;
		ПолеДиаграммы.Поле = Новый ПолеКомпоновкиДанных(ГруппировкаДиаграммы);
		
		График = НастройкиОтчета.Структура.Добавить(Тип("ДиаграммаКомпоновкиДанных"));
		График.ПараметрыВывода.УстановитьЗначениеПараметра("ТипДиаграммы",ТипДиаграммы);
		АвтополеГрафик = График.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных")); 
		АвтополеГрафик.Использование = Истина; 
		
		Серии = График.Серии.Добавить();
		Серии.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных")).Поле = Новый ПолеКомпоновкиДанных(ГруппировкаДиаграммы);
 
	Иначе
	    ЭлементСтруктуры = НастройкиОтчета;
    	Для Каждого Группировка Из Группировки Цикл
    		// если не указан тип группировки, то установим тип "Элементы"
    		Если ПустаяСтрока(Группировка.ТипГруппировки) Тогда
    			Группировка.ТипГруппировки = "Элементы";
    		КонецЕсли;
    		
    		ЭлементСтруктуры = ВложитьГруппировку(ЭлементСтруктуры, Группировка);
    		
		КонецЦикла;
		
    КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьСхемуКомпоновкиДанных() Экспорт
	// изменим текст запроса
	Для Каждого нДанных Из СхемаКомпоновкиДанных.НаборыДанных Цикл
		Если типЗнч(нДанных) = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных") Тогда
			// меняем только первый набор-запрос
			нДанных.АвтоЗаполнениеДоступныхПолей = Истина;
			
			ВспомогательныйТекст = 
			"ВЫБРАТЬ
			|	CRM_УпущенныйТрафик.Менеджер,
			|	CRM_УпущенныйТрафик.ДилерскийЦентр,
			|	CRM_УпущенныйТрафик.ИдентификаторТрафика,
			|	1 КАК КоличествоУпущено,
			|	ВЫБОР
			|		КОГДА CRM_УпущенныйТрафик.ВидУпущения = ЗНАЧЕНИЕ(Перечисление.CRM_ТипыУпущенияТрафика.Администратор)
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК КоличествоУпущеноАдминистратор,
			|	ВЫБОР
			|		КОГДА CRM_УпущенныйТрафик.ВидУпущения = ЗНАЧЕНИЕ(Перечисление.CRM_ТипыУпущенияТрафика.Менеджер)
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК КоличествоУпущеноМенеджер
			|ПОМЕСТИТЬ УпущенныйТрафик
			|ИЗ
			|	РегистрСведений.CRM_УпущенныйТрафик КАК CRM_УпущенныйТрафик
			|ГДЕ
			|	CRM_УпущенныйТрафик.Период МЕЖДУ &НачалоПериода И &КонецПериода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Renault_Трафик.Менеджер,
			|	Renault_Трафик.ДилерскийЦентр,
			|	Renault_Трафик.Отдел,
			|	Renault_Трафик.Клиент,
			|	Renault_Трафик.Идентификатор,
			|	Renault_Трафик.Обработан,
			|	Renault_Трафик.ПервичныйПовторный,
			|	Renault_Трафик.ТипТрафика,
			|	1 КАК Количество
			|ПОМЕСТИТЬ ПолныйТрафик
			|ИЗ
			|	РегистрСведений.Renault_Трафик КАК Renault_Трафик
			|ГДЕ
			|	Renault_Трафик.Период МЕЖДУ &НачалоПериода И &КонецПериода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РабочиеЛисты.Сотрудник,
			|	РабочиеЛисты.ДилерскийЦентр,
			|	РабочиеЛисты.Клиент,
			|	СУММА(СобытияПоРабочимЛистам.КоличествоСобытийПоРЛ) КАК КоличествоСобытийПоРЛ,
			|	СУММА(ВЫБОР
			|			КОГДА РабочиеЛисты.ID ЕСТЬ NULL 
			|				ТОГДА 0
			|			ИНАЧЕ 1
			|		КОНЕЦ) КАК КоличествоРабочихЛистов,
			|	СУММА(ВЫБОР
			|			КОГДА РабочиеЛисты.ЗапросНаЗакрытие = ИСТИНА
			|				ТОГДА 1
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК КоличествоЗапросовНаЗакрытие,
			|	СУММА(ВЫБОР
			|			КОГДА СобытияПоРабочимЛистам.КоличествоСобытийПоРЛ = 1
			|				ТОГДА 1
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК КоличествоРЛС1Событием,
			|	СУММА(ВЫБОР
			|			КОГДА ЕстьNULL(СобытияПоРабочимЛистам.КоличествоСобытийПоРЛ,0) = 0
			|				ТОГДА 1
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК КоличествоРЛС0Событий,
			|	СУММА(ВЫБОР
			|			КОГДА СобытияПоРабочимЛистам.КоличествоСобытийПоРЛ > 1
			|				ТОГДА 1
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК КоличествоРЛСБолее1Событием
			|ПОМЕСТИТЬ РабочиеЛисты
			|ИЗ
			|	Документ.Renault_РабочийЛист КАК РабочиеЛисты
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			СобытияПоРабочимЛистам.IDK КАК IDK,
			|			СУММА(ВЫБОР
			|					КОГДА СобытияПоРабочимЛистам.IDK ЕСТЬ NULL 
			|						ТОГДА 0
			|					ИНАЧЕ 1
			|				КОНЕЦ) КАК КоличествоСобытийПоРЛ
			|		ИЗ
			|			Документ.CRM_СобытияПоРабочимЛистам КАК СобытияПоРабочимЛистам
			|		
			|		СГРУППИРОВАТЬ ПО
			|			СобытияПоРабочимЛистам.IDK) КАК СобытияПоРабочимЛистам
			|		ПО РабочиеЛисты.IDK = СобытияПоРабочимЛистам.IDK
			|ГДЕ
			|	РабочиеЛисты.ДатаID МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|СГРУППИРОВАТЬ ПО
			|	РабочиеЛисты.Сотрудник,
			|	РабочиеЛисты.Клиент,
			|	РабочиеЛисты.ДилерскийЦентр;
			|	
			|";
			
			ТекстЗапроса = "
			|ИЗ
			|ПолныйТрафик КАК ПолныйТрафик
			|	ЛЕВОЕ СОЕДИНЕНИЕ УпущенныйТрафик КАК УпущенныйТрафик
			|	ПО ПолныйТрафик.Идентификатор = УпущенныйТрафик.ИдентификаторТрафика
			|	ЛЕВОЕ СОЕДИНЕНИЕ РабочиеЛисты КАК РабочиеЛисты
			|	ПО (РабочиеЛисты.Сотрудник = ПолныйТрафик.Менеджер)
			|	И (РабочиеЛисты.Клиент = ПолныйТрафик.Клиент)
			|";
			
			ТекстВыбрать = "ВЫБРАТЬ
							|ПолныйТрафик.Менеджер КАК Менеджер,
							|ПолныйТрафик.ДилерскийЦентр КАК ДилерскийЦентр,
							|ПолныйТрафик.Отдел КАК Отдел,
							|ПолныйТрафик.Обработан КАК Обработан,
							|ПолныйТрафик.ПервичныйПовторный КАК ПервичныйПовторный,
							|ПолныйТрафик.ТипТрафика КАК ТипТрафика,
							|СУММА(ЕСТЬNULL(ПолныйТрафик.Количество, 0)) КАК ПервичныйТрафик,
							|СУММА(ЕСТЬNULL(УпущенныйТрафик.КоличествоУпущено, 0)+ЕСТЬNULL(РабочиеЛисты.КоличествоЗапросовНаЗакрытие, 0)) КАК ВсеУпущенныеКлиенты,
							|СУММА(ЕСТЬNULL(УпущенныйТрафик.КоличествоУпущеноАдминистратор, 0)) КАК УпущенныеКлиентыАдминистратор,
							|СУММА(ЕСТЬNULL(УпущенныйТрафик.КоличествоУпущеноМенеджер, 0)) КАК УпущенныеКлиентыМенеджер,
							|СУММА(ЕСТЬNULL(РабочиеЛисты.КоличествоЗапросовНаЗакрытие, 0)) КАК КоличествоЗапросовНаЗакрытие,
							|СУММА(ЕСТЬNULL(РабочиеЛисты.КоличествоРабочихЛистов, 0)) КАК КоличествоРабочихЛистов,
							|СУММА(ЕСТЬNULL(РабочиеЛисты.КоличествоСобытийПоРЛ, 0)) КАК КоличествоСобытийПоРЛ,
							|СУММА(ЕСТЬNULL(РабочиеЛисты.КоличествоСобытийПоРЛ, 0)/ЕСТЬNULL(РабочиеЛисты.КоличествоРабочихЛистов, 1)) КАК СреднееЧислоСобытийПоРЛ,
							|СУММА(ЕСТЬNULL(РабочиеЛисты.КоличествоРЛС1Событием, 0)) КАК КоличествоРЛС1Событием,
							|СУММА(ЕСТЬNULL(РабочиеЛисты.КоличествоРЛС0Событий, 0)) КАК КоличествоРЛС0Событий,
							|СУММА(ЕСТЬNULL(РабочиеЛисты.КоличествоРЛСБолее1Событием, 0)) КАК КоличествоРЛСБолее1Событием";
			
			Для Каждого текСтрока Из ДоступныеПоляОтчета Цикл
				Если ТекСтрока.Пометка=Ложь ИЛИ ТекСтрока.ДополнительноеПоле.Пустая() Тогда
					Продолжить;
				КонецЕсли;
				
				ИмяРеквизита = УбратьЗапрещенныеСимволы(ТекСтрока.ДополнительноеПоле.Наименование);
				
				ТекстЗапроса = ТекстЗапроса + "ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|	CRM_ЗначенияРеквизитовТрафика.ИдентификаторТрафика,
				|	CRM_ЗначенияРеквизитовТрафика.ЗначениеРеквизита
				|ИЗ
				|	РегистрСведений.CRM_ЗначенияРеквизитовТрафика КАК CRM_ЗначенияРеквизитовТрафика
				|ГДЕ
				|	CRM_ЗначенияРеквизитовТрафика.РеквизитТрафика.Код = "+Символ(34)+ТекСтрока.ДополнительноеПоле.Код+Символ(34)+") КАК "+ИмяРеквизита+"_Выборка
				|ПО "+ИмяРеквизита+"_Выборка.ИдентификаторТрафика=Renault_Трафик.Идентификатор
				|";
				
				ТекстВыбрать = ТекстВыбрать+","+ИмяРеквизита+"_Выборка.ЗначениеРеквизита КАК "+ИмяРеквизита;
				
			КонецЦикла;
			
			нДанных.Запрос = ВспомогательныйТекст+ТекстВыбрать+ТекстЗапроса+"
			|СГРУППИРОВАТЬ ПО
			|ПолныйТрафик.Менеджер,
			|ПолныйТрафик.ДилерскийЦентр,
			|ПолныйТрафик.Отдел,
			|ПолныйТрафик.Обработан,
			|ПолныйТрафик.ПервичныйПовторный,
			|ПолныйТрафик.ТипТрафика
			|";
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Если Не Renault_РаботаСПравамиПользователя.ЕстьПравоОткрытияОтчетапродаж(ПараметрыСеанса.Пользователь,"CRM_ПоказателиМенеджеровПоПериодам") тогда
		Сообщить("Недостаточно прав доступа.");
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	СтандартнаяОбработка = Ложь;
	
	// переработаем СКД на базе выбранных настроек
	СформироватьСхемуКомпоновкиДанных();

	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	ЗаполнитьНастройкиОтчета(НастройкиОтчета);

	//    Далее, устанавливаем значения параметров и загружаем заполненные настройки
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("Период",Период);
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтчета);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки);

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	// диаграмма
	//РезультатДиаграмма.Очистить();
	//НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	//ЗаполнитьНастройкиОтчета(НастройкиОтчета, Истина);
	//
	//НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("Период",Период);
	//КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтчета);
	//
	//КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	//МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки);

	//ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	//
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(РезультатДиаграмма);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	РезультатДиаграмма.Очистить();
	Макет  = ПолучитьМакет("Макет");    
    График  = Макет.ПолучитьОбласть("График");
    Диаграмма=График.Рисунки.D1.Объект;
	Диаграмма.ТипДиаграммы = ТипДиаграммы;
	Запрос = Новый Запрос;
	Запрос.Текст = СхемаКомпоновкиДанных.НаборыДанных[0].Запрос;
	Если ГруппировкаДиаграммы = "Менеджер" Тогда
		СтрокаИтоги = "ИТОГИ ПО Менеджер";
	ИначеЕсли ГруппировкаДиаграммы = "Причина" Тогда
		СтрокаИтоги = "ИТОГИ ПО Причина";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + СтрокаИтоги;
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Диаграмма.СерииВСтроках = Ложь;
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		Для Каждого Показатель Из ПоказателиДиаграммы Цикл
			Если Показатель.Пометка Тогда
				
				ТекущаяСерия = Диаграмма.УстановитьСерию(Показатель.ИмяПоля);
				ТекущаяСерия.Текст = Показатель.Представление;
		        ТекущаяТочка = Диаграмма.УстановитьТочку(Выборка[ГруппировкаДиаграммы]);
				ТекущаяТочка.Текст = ?(Выборка[ГруппировкаДиаграммы] = Null, "", Выборка[ГруппировкаДиаграммы].Наименование);
				Если Найти(Показатель.ИмяПоля, "Процент") Тогда
					ИмяПоказателяБезПроцентов = Лев(Показатель.ИмяПоля, СтрДлина(Показатель.ИмяПоля)-7);
					Значение = (Выборка[ИмяПоказателяБезПроцентов]/Выборка.ПервичныйТрафик)*100;
					Диаграмма.УстановитьЗначение(ТекущаяТочка, ТекущаяСерия, Значение, ,) ;
				Иначе
					Диаграмма.УстановитьЗначение(ТекущаяТочка, ТекущаяСерия, Выборка[Показатель.ИмяПоля], ,) ;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	РезультатДиаграмма.Вывести(График);
    РезультатДиаграмма.Защита = Ложь;
    РезультатДиаграмма.ТолькоПросмотр = Истина;

КонецПроцедуры

Функция НайтиПолеКомпоновки(Имя, Коллекция) Экспорт
	Для Каждого ПолеКомпоновкиДанных Из Коллекция Цикл
		Если ПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных(Имя) Тогда
			Возврат Истина;
		Иначе
			Продолжить;
		КонецЕсли;
	КонецЦикла; 
	
	Возврат Ложь;
КонецФункции

Функция ВложитьГруппировку(ЭлементСтруктуры, Группировка)
	
	ЭлементСтруктуры = ЭлементСтруктуры.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ЭлементГруппировки = ЭлементСтруктуры.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ЭлементГруппировки.Использование = Истина;
	ЭлементГруппировки.Поле =  Новый ПолеКомпоновкиДанных(Группировка.Поле);                                                  
	ЭлементГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных[Группировка.ТипГруппировки];
	
	ПолеСортировки = ЭлементСтруктуры.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	ПолеСортировки.Использование = Истина;

	
	ЭлементВыбора = ЭлементСтруктуры.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));//.Поле = Новый ПолеКомпоновкиДанных(Элемент.ИмяПоля);
	ЭлементВыбора.Использование = Истина;
	Возврат ЭлементСтруктуры;
	
КонецФункции