//Только клиентская часть
Функция ВыбратьФайлДляРекламации(ФормаВладелец) Экспорт
	
	МаксимальныйРазмер = ФормаВладелец.МаксимальныйРазмер;
	
	АдресВременногоХранилищаФайла = "";
	
	// Создание из файла
	ПолноеИмяФайла = "";
	
	РасширениеПодключено = ПодключитьРасширениеРаботыСФайлами();
	
	Если РасширениеПодключено Тогда
		
		ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ВыборФайла.МножественныйВыбор = Ложь;
		ВыборФайла.Заголовок = "Выбор файла";
		
		Результат = ВыборФайла.Выбрать();
		ПолноеИмяФайла = ВыборФайла.ПолноеИмяФайла;
		
		Если НЕ Результат Тогда
			Возврат "";
		КонецЕсли;
		
		Файл = Новый Файл(ПолноеИмяФайла);
		
		Если Файл.ЭтоКаталог() тогда
			
			ПоказатьПредупреждение(,"Выбор каталога не возможен", 5);
			Возврат "";
			
		КонецЕсли;
		
		ИмяФайла	 = Файл.ИмяБезРасширения;
		Расширение	 = СтрЗаменить(Файл.Расширение, ".","");
		Размер		 = Файл.Размер();
		
		Если Размер > МаксимальныйРазмер тогда
			
			Предупреждение("Размер файла более 4 Мб. Добавление невозможно!", 10);
			Возврат "";
			
		КонецЕсли;
		АдресВременногоХранилищаФайла = ПоместитьФайлВоВременноеХранилище(ПолноеИмяФайла, ФормаВладелец);
		
	Иначе 
		// Если веб-клиент
		
		// Поместим Файл в ВременноеХранилище
		АдресВременногоХранилищаФайла = "";
		ПутьФайла = "";
		Если НЕ ПоместитьФайл(АдресВременногоХранилищаФайла, ПутьФайла, ПутьФайла, Истина,ФормаВладелец.УникальныйИдентификатор) Тогда
			Возврат "";
		КонецЕсли;
		
		Файл = Новый Файл(ПутьФайла);
		
		Если Файл.ЭтоКаталог() тогда
			
			ПоказатьПредупреждение(,"Выбор каталога не возможен", 5);
			Возврат "";
			
		КонецЕсли;
		
		ИмяФайла	 = Файл.ИмяБезРасширения;
		Расширение	 = Файл.Расширение;

	КонецЕсли;
	
	////////////////////////////////
	//	Проверки
	Если ЗначениеЗаполнено(АдресВременногоХранилищаФайла) тогда
		
		ФормаВладелец.НаименованиеФайла	 = ИмяФайла;
		ФормаВладелец.РасширениеФайла	 = Расширение;
		
	КонецЕсли;
	
	Возврат АдресВременногоХранилищаФайла;
	
КонецФункции

// Трояновский К.Е. 22.05.2019 11:11:58 {

// Производит выбор файлов для загрузки в документ рекламации
//
// Параметры:
//  ФормаВладелец	 - УправляемаяФорма	 -  Форма загрузки файлов в рекламацию
//
Процедура ВыбратьФайлыДляРекламации(ФормаВладелец) Экспорт
	
	МаксимальныйРазмер = ФормаВладелец.МаксимальныйРазмер;
	
	РасширениеПодключено = ПодключитьРасширениеРаботыСФайлами();
	
	Если РасширениеПодключено Тогда
		
		ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ВыборФайла.МножественныйВыбор = Истина;
		ВыборФайла.Заголовок = "Выберите один или несколько файлов...";
		
		Результат = ВыборФайла.Выбрать();
		
		Если Результат Тогда
			
			Для Каждого ВыбранныйФайл Из ВыборФайла.ВыбранныеФайлы Цикл
				
				Файл = Новый Файл(ВыбранныйФайл);
				
				Если НЕ Файл.ЭтоКаталог() Тогда
					
					ИмяФайла	 = Файл.ИмяБезРасширения;
					Расширение	 = СтрЗаменить(Файл.Расширение, ".","");
					Размер		 = Файл.Размер();
					
					Если Размер > МаксимальныйРазмер тогда
						
						Предупреждение("Размер файла " + ИмяФайла + " более 4 Мб. Добавление невозможно!", 10);
						Продолжить;
						
					КонецЕсли;
					
					НоваяСтрока = ФормаВладелец.ТаблицаФайловДляЗагрузки.Добавить();
					
					НоваяСтрока.НаименованиеФайла 			= ИмяФайла;
					НоваяСтрока.Расширение 					= Расширение;
					НоваяСтрока.АдресВоВременномХранилище 	= ПоместитьФайлВоВременноеХранилище(ВыбранныйФайл, ФормаВладелец);
					
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе 
		// Если веб-клиент
		
		Для Каждого ВыбранныйФайл Из ВыборФайла.ВыбранныеФайлы Цикл
		
			// Поместим Файл в ВременноеХранилище
			АдресВременногоХранилищаФайла = "";
			ПутьФайла = "";
			Если НЕ ПоместитьФайл(АдресВременногоХранилищаФайла, ПутьФайла, ПутьФайла, Истина,ФормаВладелец.УникальныйИдентификатор) Тогда
				Продолжить;
			КонецЕсли;
			
			Файл = Новый Файл(ПутьФайла);
			
			Если НЕ Файл.ЭтоКаталог() тогда
				
				ИмяФайла	 = Файл.ИмяБезРасширения;
				Расширение	 = СтрЗаменить(Файл.Расширение, ".","");
				Размер		 = Файл.Размер();
				
				Если Размер > МаксимальныйРазмер тогда
					
					Сообщить("Размер файла " + ИмяФайла + " более 4 Мб. Добавление невозможно!", 10);
					Продолжить;
					
				КонецЕсли;
				
				НоваяСтрока = ФормаВладелец.ТаблицаФайловДляЗагрузки.Добавить();
				
				НоваяСтрока.НаименованиеФайла 			= ИмяФайла;
				НоваяСтрока.Расширение 					= Расширение;
				НоваяСтрока.АдресВоВременномХранилище 	= АдресВременногоХранилищаФайла;
				
			КонецЕсли;
			
		КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры // ВыбратьФайлыДляРекламации()

// Функция - Поместить файлы для рекламации
//
// Параметры:
//  ФормаВладелец	 - УправляемаяФорма	 - Форма загрузки файлов в рекламацию
// 
// Возвращаемое значение:
//  Строка - Идентификатор файла в хранилище
//
Функция ПоместитьФайлыДляРекламации(ФормаВладелец, ОписаниеФайла, АдресВременногоХранилищаФайла, НаименованиеФайла, РасширениеФайла) Экспорт
	
	ДатаЗаписи = ФормаВладелец.ДатаЗаписи;
	
	ВладелецСсылка = ФормаВладелец.ВладелецСсылка;
	
	ИдентификаторВХранилище = Renault_ОбщийМодульСервер.ЗаписатьФайлВБазу(АдресВременногоХранилищаФайла, ВладелецСсылка, НаименованиеФайла, РасширениеФайла,
												ОписаниеФайла, ДатаЗаписи);
	
	Возврат ИдентификаторВХранилище;
	
КонецФункции // ПоместитьФайлыДляРекламации()

// Трояновский К.Е. 22.05.2019 11:11:58 }

// Помещает файл во временное хранилище и возвращает строковое представление адреса
//
// Параметры
//  ПолноеИмяФайла  - Строка(0) - полное имя файла в строковом представлении
//
//  ФормаВладелец - Управл. форма - Форма УУИД которой используем в качестве УУИД хранилища.
//
// Возвращаемое значение
//  АдресВременногоХранилищаФайла  - Строка(0) - Строковое представление адреса врем. хранилища
//
Функция ПоместитьФайлВоВременноеХранилище(ПолноеИмяФайла, ФормаВладелец) Экспорт
	
	//Первоначальная инициализация
	АдресВременногоХранилищаФайла = неопределено;
	
	ПомещаемыеФайлы = Новый Массив;
	Описание = Новый ОписаниеПередаваемогоФайла(ПолноеИмяФайла, "");
	ПомещаемыеФайлы.Добавить(Описание);
	
	ПомещенныеФайлы = Новый Массив;
	
	Если НЕ ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы,, Ложь, ФормаВладелец.УникальныйИдентификатор) Тогда
		ВызватьИсключение "Ошибка при помещении файла в хранилище: " + ПолноеИмяФайла;
	КонецЕсли;
	
	Если ПомещенныеФайлы.Количество() = 1 Тогда
		АдресВременногоХранилищаФайла = ПомещенныеФайлы[0].Хранение;
	КонецЕсли;
	
	Возврат АдресВременногоХранилищаФайла;
	
КонецФункции

Функция ПоместитьФайлДляРекламации(ФормаВладелец) Экспорт
	
	ОписаниеФайла = ФормаВладелец.ОписаниеФайла;

	АдресВременногоХранилищаФайла = ФормаВладелец.АдресВременногоХранилища;
	
	ДатаЗаписи = ФормаВладелец.ДатаЗаписи;

	ИмяБезРасширения = ФормаВладелец.НаименованиеФайла;
	Расширение		 = ФормаВладелец.РасширениеФайла;
	
	ВладелецСсылка = ФормаВладелец.ВладелецСсылка;
	
	ИдентификаторВХранилище = Renault_ОбщийМодульСервер.ЗаписатьФайлВБазу(АдресВременногоХранилищаФайла, ВладелецСсылка, ИмяБезРасширения, Расширение,
												ОписаниеФайла, ДатаЗаписи);
	
	Возврат ИдентификаторВХранилище;
	
КонецФункции

Процедура ОткрытьФайлПоИдентификатору(Идентификатор) Экспорт
	
	РасширениеПодключено = ПодключитьРасширениеРаботыСФайлами();
	
	ЭтоВебКлиент = Renault_Открытый.ЭтоВебКлиент();
	
	Если РасширениеПодключено Тогда
		Если НЕ ЭтоВебКлиент тогда
			КаталогВременныхФайлов = КаталогВременныхФайлов();
		КонецЕсли;
	
		АдресВременногоХранилищаФайла = Renault_ОбщийМодульСервер.ПолучитьФайлИзБазы(Идентификатор);
		
		Если ЗначениеЗаполнено(АдресВременногоХранилищаФайла) тогда
			ДанныеИзХранилища = ПолучитьИзВременногоХранилища(АдресВременногоХранилищаФайла);
			
			ДДанные = ДанныеИзХранилища["ДДанные"];
			ИмяФайла = ДанныеИзХранилища["ИмяФайла"];
			
			Если Не ЭтоВебКлиент тогда
				ПутьКФайлу = КаталогВременныхФайлов + ИмяФайла;
				ДанныеФайла = ПолучитьИзВременногоХранилища(ДДанные);
				ДанныеФайла.Записать(ПутьКФайлу);
				ОткрытьФайлПриложением(ПутьКФайлу);
			Иначе
				ПолучитьФайл(ДДанные,ИмяФайла,Истина);
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Функция предназначена для открытия файла соответствующим приложением
//
// Параметры
//  ДанныеФайла  - структура с данными файла
//  ИмяОткрываемогоФайла - Строка - полное имя файла
Процедура ОткрытьФайлПриложением(ИмяОткрываемогоФайла)
	
	РасширениеПодключено = ПодключитьРасширениеРаботыСФайлами();
	Если РасширениеПодключено Тогда
		Попытка
			ДопПараметры = Новый Структура("ИмяФайла",ИмяОткрываемогоФайла);
			НачатьЗапускПриложения(Новый ОписаниеОповещения("ОткрытьФайлПриложениемЗавершение",Renault_РекламацииКлиент,ДопПараметры),ИмяОткрываемогоФайла,,Истина);
		Исключение
			Инфо = ИнформацияОбОшибке();
			Предупреждение("Описание="""+ Инфо.Описание +"""");
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры 

Процедура ОткрытьФайлПриложениемЗавершение(КодВозврата, ДополнительныеПараметры) Экспорт
	УдалитьФайлы(ДополнительныеПараметры.ИмяФайла);	
КонецПроцедуры
