
&НаСервере
Процедура ПрочитатьДокументы(МассивКлиентов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПодтверждающиеДокументы.Ссылка КАК Документ,
	               |	ПодтверждающиеДокументы.ВидПодтверждающегоДокумента КАК ВидДокумента
	               |ИЗ
	               |	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	               |ГДЕ
	               |	ПодтверждающиеДокументы.Владелец В (&МассивКлиентов)";
				   
				   
	Запрос.УстановитьПараметр("МассивКлиентов", МассивКлиентов);
	
	ЗначениеВДанныеФормы(Запрос.Выполнить().Выгрузить(), ВсеДокументы);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Клиент = Параметры.Клиент;
	МассивКлиентов = Параметры.Клиенты.Выгрузить().ВыгрузитьКолонку("Клиент");
	
	Если Не ЗначениеЗаполнено(Клиент) Тогда
		Возврат;	
	КонецЕсли;
	
	ПрочитатьДокументы(МассивКлиентов);
		
КонецПроцедуры
