&НаКлиенте
Перем мВыбраныСсылки; 

&НаКлиенте
Процедура УстановитьЗаголовкиВкладокКлиент()
	
	УстановитьЗаголовкиВкладок();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовкиВкладок()
	
	ЭтоРКП = РольДоступна("ПолныеПрава") Или ПараметрыСеанса.Renault_ПраваПользователя.РазрешитьРасботуСАРМРуководителяКП;
	
	сПараметров = Новый Структура;
	сПараметров.Вставить("ПоказыватьУдаленныеЗаписи", ПоказыватьУдаленныеЗаписи);
	сПараметров.Вставить("Наименование", Наименование);
	сПараметров.Вставить("Пользователь", ПараметрыСеанса.Пользователь.Сотрудник);
	сПараметров.Вставить("ЭтоРКП", ЭтоРКП);
	
	Для Каждого Страница Из Элементы.ГруппаЗаявок.ПодчиненныеЭлементы Цикл
		мСтатусов = Новый Массив;
		Если Страница = Элементы.VINЧерновик Тогда
			КоличестоVIN = РегистрыСведений.Renault_СостоянияVINВЗаявках.ПолучитьКоличествоЗаявок(
				Перечисления.Renault_СостоянияСогласованияКорпСкидок[СтрЗаменить(Страница.Имя, "VIN", "")]);
		Иначе
			КоличестоVIN = РегистрыСведений.Renault_СостоянияVINВЗаявках.ПолучитьКоличествоVIN(
				Перечисления.Renault_СостоянияСогласованияКорпСкидок[СтрЗаменить(Страница.Имя, "VIN", "")]);
		КонецЕсли;
			
		Если КоличестоVIN = 0 Тогда
			Страница.Заголовок = Страница.Подсказка;
		Иначе
			Страница.Заголовок = Страница.Подсказка + " (" + Формат(КоличестоVIN, "ЧГ=") + ")";
		КонецЕсли;
	КонецЦикла;
	
	КоличествоНаСогласовании = Справочники.Renault_КорпоративныеКлиенты.ПолучитьКоличествоКлиентов(
		Перечисления.Renault_СостоянияСогласованияКлиента.НаСогласовании,
		сПараметров);
	КоличествоНеСогласованные = Справочники.Renault_КорпоративныеКлиенты.ПолучитьКоличествоКлиентов(
		Перечисления.Renault_СостоянияСогласованияКлиента.НеСогласован,
		сПараметров);
	КоличествоЧерновик = Справочники.Renault_КорпоративныеКлиенты.ПолучитьКоличествоКлиентов(
		Перечисления.Renault_СостоянияСогласованияКлиента.Черновик,
		сПараметров);
	КоличествоСогласован = Справочники.Renault_КорпоративныеКлиенты.ПолучитьКоличествоКлиентов(
		Перечисления.Renault_СостоянияСогласованияКлиента.Согласован,
		сПараметров);
	
	Элементы.НаСогласовании.Заголовок = "На регистрации";
	Элементы.НеСогласован.Заголовок = "Не зарегистрированные";
	
	Если ЗначениеЗаполнено(Статус) Тогда
		Если Статус = Перечисления.Renault_СостоянияСогласованияКлиента.Черновик Тогда
			КоличествоВсе = КоличествоЧерновик;
		ИначеЕсли Статус = Перечисления.Renault_СостоянияСогласованияКлиента.Согласован Тогда
			КоличествоВсе = КоличествоСогласован;
		КонецЕсли;
	Иначе
		КоличествоВсе = КоличествоЧерновик + КоличествоСогласован;
	КонецЕсли;
	
	Если КоличествоЧерновик > 0 или КоличествоСогласован > 0 Тогда
		Элементы.Все.Заголовок = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"Все (%1)",
			Строка(КоличествоВсе));
	КонецЕсли;		
	Если КоличествоНаСогласовании > 0 Тогда
		Элементы.НаСогласовании.Заголовок = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"На регистрации (%1)",
			Строка(КоличествоНаСогласовании));
	КонецЕсли;
	Если КоличествоНеСогласованные > 0 Тогда
		Элементы.НеСогласован.Заголовок	= Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"Не зарегистрированные (%1)",
			Строка(КоличествоНеСогласованные));
	КонецЕсли;
	
	Элементы.СменитьМенеджера.Видимость = ЭтоРКП;
	Элементы.СписокКлиентовВсеКонтекстноеМенюСменитьМенеджера.Видимость = ЭтоРКП;
	Элементы.СписокКлиентовНаСогласованииКонтекстноеМенюСменитьМенеджера.Видимость = ЭтоРКП;
	Элементы.СписокКлиентовНеСогласованКонтекстноеМенюСменитьМенеджера.Видимость = ЭтоРКП;
	Элементы.СписокКлиентовВсеМенеджер.Видимость = ЭтоРКП;
	Элементы.СписокКлиентовНаСогласованииМенеджер.Видимость = ЭтоРКП;
	Элементы.СписокКлиентовНеСогласованМенеджер.Видимость = ЭтоРКП;
	
	мСтатусов = Новый Массив;
	мСтатусов.Добавить(Перечисления.Renault_СостоянияСогласованияКорпСкидок[СтрЗаменить(СокрЛП(Элементы.ГруппаЗаявок.ТекущаяСтраница.Имя), "VIN", "")]);
	СписокVIN.Параметры.УстановитьЗначениеПараметра("Статус", мСтатусов);
	
	КонтактнаяИнформацияТекущегоКлиента.Параметры.УстановитьЗначениеПараметра("Объект", Клиент);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтутусовПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	мСостояние = Новый Массив;
	Состояние = ПредопределенноеЗначение("Перечисление.Renault_СостоянияСогласованияКлиента." + СокрЛП(Элементы.ГруппаКлиенты.ПодчиненныеЭлементы.Группа1.ПодчиненныеЭлементы.ГруппаСтатусов.ТекущаяСтраница.Имя));
	Если Состояние <> Неопределено Тогда
		мСостояние.Добавить(Состояние);
		СписокКлиентов.Параметры.УстановитьЗначениеПараметра("Состояние", мСостояние );
	Иначе
		Если ЗначениеЗаполнено(Статус) Тогда
			мСостояние.Добавить(Статус);
			СписокКлиентов.Параметры.УстановитьЗначениеПараметра("Состояние", мСостояние );
		Иначе
			мСостояние.Добавить(ПредопределенноеЗначение("Перечисление.Renault_СостоянияСогласованияКлиента.Согласован"));
			мСостояние.Добавить(ПредопределенноеЗначение("Перечисление.Renault_СостоянияСогласованияКлиента.Черновик"));
			СписокКлиентов.Параметры.УстановитьЗначениеПараметра("Состояние", мСостояние);
		КонецЕсли;
	КонецЕсли;
	СписокКлиентов.Параметры.УстановитьЗначениеПараметра("ПоказыватьВсе", ПоказыватьУдаленныеЗаписи);
	СписокКлиентов.Параметры.УстановитьЗначениеПараметра("Пользователь", ПараметрыСеанса.Пользователь.Сотрудник);
	СписокКлиентов.Параметры.УстановитьЗначениеПараметра("ЭтоРКП", ЭтоРКП);
	УстановитьПараметрСписка();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗаголовкиВкладок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	мВыбраныСсылки = Новый Массив;
	Элементы.ГруппаОбработки.Видимость = Ложь;
	мСостояние = Новый Массив;
	Состояние = ПредопределенноеЗначение("Перечисление.Renault_СостоянияСогласованияКлиента." + СокрЛП(Элементы.ГруппаКлиенты.ПодчиненныеЭлементы.Группа1.ПодчиненныеЭлементы.ГруппаСтатусов.ТекущаяСтраница.Имя));
	Если Состояние <> Неопределено Тогда
		мСостояние.Добавить(Состояние);
		СписокКлиентов.Параметры.УстановитьЗначениеПараметра("Состояние", мСостояние);
	Иначе
		мСостояние.Добавить(ПредопределенноеЗначение("Перечисление.Renault_СостоянияСогласованияКлиента.Согласован"));
		мСостояние.Добавить(ПредопределенноеЗначение("Перечисление.Renault_СостоянияСогласованияКлиента.Черновик"));
		СписокКлиентов.Параметры.УстановитьЗначениеПараметра("Состояние", мСостояние);
	КонецЕсли;
	СписокКлиентов.Параметры.УстановитьЗначениеПараметра("ПоказыватьВсе", ПоказыватьУдаленныеЗаписи);
	СписокКлиентов.Параметры.УстановитьЗначениеПараметра("Пользователь", ПараметрыСеанса.Пользователь.Сотрудник);
	СписокКлиентов.Параметры.УстановитьЗначениеПараметра("ЭтоРКП", ЭтоРКП);
	мСтатусов = Новый Массив();
	мСтатусов.Добавить( ПредопределенноеЗначение("Перечисление.Renault_СостоянияСогласованияКорпСкидок.Черновик"));
	СписокVIN.Параметры.УстановитьЗначениеПараметра("Статус", мСтатусов);
	
	Если ЗначениеЗаполнено(Клиент) Тогда
		ОткрытьСтраницуКлиента();
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("УстановитьЗаголовкиВкладокКлиент", 60, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздать(Команда)
	
	Форма = ПолучитьФорму("Справочник.Renault_КорпоративныеКлиенты.Форма.Renault_ФормаКорпоративногоКлиента");
	Форма.СправочникОбъект = Справочники.Контрагенты.СоздатьЭлемент(); 
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИзменить(Команда)
	
	ТекущийКлиент = Неопределено;
	ТекущиеДанные = Элементы["СписокКлиентов" + Элементы.ГруппаСтатусов.ТекущаяСтраница.Имя].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтрагентСсылка = ТекущиеДанные.Контрагент;
	ОткрытьКарточкуКлиента(КонтрагентСсылка, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_КорпоративныеКлиенты" Тогда
		Элементы["СписокКлиентов" + Элементы.ГруппаКлиенты.ПодчиненныеЭлементы.Группа1.ПодчиненныеЭлементы.ГруппаСтатусов.ТекущаяСтраница.Имя].Обновить();
		УстановитьЗаголовкиВкладок();
	ИначеЕсли ИмяСобытия = "ЗаписьVIN" Тогда
		Если Элементы.ГруппаВИН.ПодчиненныеЭлементы.ГруппаЗаявок.ТекущаяСтраница.Имя = "VINЧерновик" Тогда
			Если Элементы.ГруппаВИН.Видимость Тогда
				//Козлов Е.А. Начало 12.05.2016
				//Элементы.СписокЗаявок.Обновить();
				//Козлов Е.А. Конец
			Иначе
				Элементы.СписокВинКлиента.Обновить();
				Элементы.СписокВыданных.Обновить();
			КонецЕсли;
		Иначе
			Элементы["Список" + Элементы.ГруппаВИН.ПодчиненныеЭлементы.ГруппаЗаявок.ТекущаяСтраница.Имя].Обновить();
		КонецЕсли;
		
		УстановитьЗаголовкиВкладок();
		
		Элементы.СписокVINНаСогласовании.Обновить();
		Элементы.СписокVINСогласован.Обновить();
		Элементы.СписокVINНеСогласован.Обновить();
		Элементы.СписокVINОтчетПредоставлен.Обновить();
		Элементы.СписокVINОтчетаНеБудет.Обновить();
		Элементы.СписокVINДопИнформация.Обновить();
		Элементы.СписокЗаявокАрхив.Обновить();
		Элементы.СписокЗаявок.Обновить();
		
	ИначеЕсли ИмяСобытия = "ОбновитьРабочийЛист" Тогда
		Если Элементы.ГруппаСтраниц.ТекущаяСтраница.Имя = "ГруппаОбработкиВин" Тогда
			Элементы.СписокВинКлиента.Обновить();
			Элементы.СписокВыданных.Обновить();
		ИначеЕсли Элементы.ГруппаСтраниц.ТекущаяСтраница.Имя = "ГруппаВыданных" Тогда
			Элементы.СписокВыданных.Обновить();
		КонецЕсли;
	КонецЕсли;
	
	УстановитьЗаголовкиВкладок();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКлиентовЧернивикВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьСтраницуКлиента();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРабочиеЛистыКонтрагента(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_РабочиеЛисты.IDK
		|ИЗ
		|	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
		|ГДЕ
		|	Renault_РабочиеЛисты.Клиент = &Клиент";
	Запрос.УстановитьПараметр("Клиент", Контрагент);
	МассивРабочихЛистов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	Возврат МассивРабочихЛистов;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьСтраницуКлиента ()

	ТекущаяСтрока = Элементы.СписокКлиентовВсе.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивРабочихЛистов = ПолучитьРабочиеЛистыКонтрагента( ТекущаяСтрока.Контрагент);
	
	Элементы.ГруппаВИН.Видимость = Ложь;
	Элементы.ГруппаОбработки.Видимость = Истина;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОбработки;
	Элементы.ГруппаОбработки.Заголовок = Строка(ТекущаяСтрока.Ссылка);
	
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.Renault_СостоянияСогласованияКорпСкидок.ОтчетПринят);
	МассивСтатусов.Добавить(Перечисления.Renault_СостоянияСогласованияКорпСкидок.ОтчетаНеБудет);
	
	СписокВинКлиента.Параметры.УстановитьЗначениеПараметра("РабочиеЛистыКонтрагента", МассивРабочихЛистов);
	СписокВинКлиента.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	СписокВинКлиента.Параметры.УстановитьЗначениеПараметра("МассивСтатусов", МассивСтатусов);
	
	СписокВыданных.Параметры.УстановитьЗначениеПараметра("РабочиеЛистыКонтрагента", МассивРабочихЛистов);
	СписокВыданных.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	СписокВыданных.Параметры.УстановитьЗначениеПараметра("МассивСтатусов", МассивСтатусов);
	КонтактнаяИнформация.Параметры.УстановитьЗначениеПараметра("Объект", ТекущаяСтрока.Контрагент); 
	
	СписокАрхив.Параметры.УстановитьЗначениеПараметра("МассивСтатусов", МассивСтатусов);
	СписокАрхив.Параметры.УстановитьЗначениеПараметра("РабочиеЛистыКонтрагента", МассивРабочихЛистов);
	СписокАрхив.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточкуКлиента(КонтрагентСсылка, ТекущиеДанные)
	
	ФормаКорпКлиента = ТекущиеДанные.Ссылка.ПолучитьОбъект().ПолучитьФорму("Renault_ФормаКорпоративногоКлиента");
	ФормаКорпКлиента.СправочникОбъект = КонтрагентСсылка.ПолучитьОбъект();
	ФормаКорпКлиента.СферыДеятельности = ТекущиеДанные.Ссылка.СферыДеятельности.Выгрузить();
	ФормаКорпКлиента.Автопарк = ТекущиеДанные.Ссылка.Автопарк.Выгрузить();
	ФормаКорпКлиента.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	РежимВопроса = РежимДиалогаВопрос.ДаНет;
	Ответ = Вопрос(НСтр("ru='Удалить данного клиента?'"), РежимВопроса, 0);
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийКлиент = Неопределено;
	ТекущиеДанные = Элементы["СписокКлиентов" + Элементы.ГруппаКлиенты.ПодчиненныеЭлементы.Группа1.ПодчиненныеЭлементы.ГруппаСтатусов.ТекущаяСтраница.Имя].ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КорпоративныйКлиентСсылка = ТекущиеДанные.Ссылка;
	ИзменитьПометкуУдаленияКлиента(КорпоративныйКлиентСсылка);
	Оповестить("Запись_КорпоративныеКлиенты");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьПометкуУдаленияКлиента(КорпоративныйКлиентСсылка)
	
	КорпоративныйКлиент = КорпоративныйКлиентСсылка.ПолучитьОбъект();
	Контрагент = КорпоративныйКлиент.Контрагент.ПолучитьОбъект();
	КорпоративныйКлиент.УстановитьПометкуУдаления(Не КорпоративныйКлиент.ПометкаУдаления);
	Контрагент.УстановитьПометкуУдаления(Не Контрагент.ПометкаУдаления);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКлиентовНаСогласованииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьКарточкуКлиента(Элемент.ТекущиеДанные.Контрагент, Элемент.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКлиентовСогласованВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьКарточкуКлиента(Элемент.ТекущиеДанные.Контрагент, Элемент.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКлиентовНеСогласованВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьКарточкуКлиента(Элемент.ТекущиеДанные.Контрагент, Элемент.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаЗаявокПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	мСтатусов = Новый Массив;
	мСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.Renault_СостоянияСогласованияКорпСкидок." + СтрЗаменить(СокрЛП(ТекущаяСтраница.Имя), "VIN", "")));
	СписокVIN.Параметры.УстановитьЗначениеПараметра("Статус", мСтатусов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьVIN(Команда)
	
	Если Элементы.ГруппаВИН.Видимость Тогда
		ТекушаяСтрока = Элементы["Список" + Элементы.ГруппаЗаявок.ТекущаяСтраница.Имя].ТекущиеДанные;
	Иначе
		ТекушаяСтрока = Элементы.СписокВинКлиента.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекушаяСтрока <> Неопределено Тогда
		сПараметров = Новый Структура;
		сПараметров.Вставить("Заявка", ТекушаяСтрока.Заявка);
		сПараметров.Вставить("Автомобиль", ТекушаяСтрока.Автомобиль);
		сПараметров.Вставить("Статус", ТекушаяСтрока.СтатусЗаявки);
		ОткрытьФорму("Обработка.Renault_АРМ_КорпоративныеСкидки.Форма.ФормаVIN", сПараметров, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
Процедура УстановитьПараметрСписка()
	
	ТекущаяСтрока = Элементы["СписокКлиентов" + Элементы.ГруппаКлиенты.ПодчиненныеЭлементы.Группа1.ПодчиненныеЭлементы.ГруппаСтатусов.ТекущаяСтраница.Имя].ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_РезервированиеАвтомобилей.Ссылка КАК ИдентификаторРезерва,
		|	Renault_РезервированиеАвтомобилей.ВерсияДанных,
		|	Renault_РезервированиеАвтомобилей.ПометкаУдаления,
		|	Renault_РезервированиеАвтомобилей.Номер,
		|	Renault_РезервированиеАвтомобилей.Дата КАК Дата,
		|	Renault_РезервированиеАвтомобилей.Проведен,
		|	Renault_РезервированиеАвтомобилей.VIN,
		|	Renault_РезервированиеАвтомобилей.Менеджер,
		|	Renault_РезервированиеАвтомобилей.Комментарий,
		|	Renault_РезервированиеАвтомобилей.Автор,
		|	Renault_РезервированиеАвтомобилей.Контролер,
		|	Renault_РезервированиеАвтомобилей.СтатусРезерва,
		|	Renault_РезервированиеАвтомобилей.РабочийЛист,
		|	Renault_РезервированиеАвтомобилей.SedreNum,
		|	Renault_РезервированиеАвтомобилей.Клиент,
		|	Renault_РезервированиеАвтомобилей.Автомобиль,
		|	Renault_РезервированиеАвтомобилей.ДатаСнятияРезерва,
		|	ЛОЖЬ КАК Флажок,
		|	СостоянияVINВЗаявках.Статус КАК СтатусЗаявки
		|ИЗ
		|	Документ.Renault_РезервированиеАвтомобилей КАК Renault_РезервированиеАвтомобилей
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_СостоянияVINВЗаявках КАК СостоянияVINВЗаявках
		|		ПО Renault_РезервированиеАвтомобилей.Автомобиль = СостоянияVINВЗаявках.VIN
		|			И Renault_РезервированиеАвтомобилей.Клиент = СостоянияVINВЗаявках.Заявка.Клиент
		|ГДЕ
		|	Renault_РезервированиеАвтомобилей.Проведен = ИСТИНА
		|	И Renault_РезервированиеАвтомобилей.Клиент = &Клиент
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
		Запрос.УстановитьПараметр("Клиент", ТекущаяСтрока.Контрагент);
	Иначе
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКлиентовЧерновикПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОбработатьСменуСтроки", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСменуСтроки()
	
	ТекущаяСтрока = Элементы["СписокКлиентов" + Элементы.ГруппаСтатусов.ТекущаяСтраница.Имя].ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		Если ТекущаяСтрока.Ссылка <> Клиент Тогда
			Клиент = ТекущаяСтрока.Ссылка;
		КонецЕсли;
	Иначе
		Клиент = ПредопределенноеЗначение("Справочник.Renault_КорпоративныеКлиенты.ПустаяСсылка");
		Коментарий = "";
	КонецЕсли;
	
	КонтактнаяИнформацияТекущегоКлиента.Параметры.УстановитьЗначениеПараметра("Объект", Клиент.Контрагент);
	ЗаполнитьСписокКомментариев();
	
КонецПроцедуры

&НаСервере 
Процедура ОчиститьКонтакты()
	
	мУдаления = новый Массив;
	Для Каждого СтрокаЭлемента из Элементы.ГруппаКонтактов.ПодчиненныеЭлементы Цикл
		мУдаления.Добавить(СтрокаЭлемента);
	КонецЦикла;
	Для Каждого строкаМассива из мУдаления Цикл
		Элементы.Удалить(строкаМассива);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СписокКлиентовДобавитьКонтактнуюИнформацию()
	
	ОчиститьКонтакты();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 5
	|	КонтактнаяИнформация.Объект КАК Объект,
	|	КонтактнаяИнформация.Представление,
	|	КонтактнаяИнформация.Тип,
	|	КонтактнаяИнформация.Вид КАК Вид,
	|	КонтактнаяИнформация.Объект.ВедушийКонтрагент КАК ВедушийКонтрагент
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Тип В(&Тип)
	|	И (КонтактнаяИнформация.Объект = &Контрагент
	|			ИЛИ КонтактнаяИнформация.Объект.ВедушийКонтрагент = &Контрагент)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВедушийКонтрагент,
	|	Объект,
	|	Вид";
	Запрос.УстановитьПараметр("Контрагент", Клиент.Контрагент);
	мТипов = Новый Массив;
	мТипов.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
	мТипов.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("Тип", мТипов);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() тогда
		Возврат;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Вид = Неопределено;
	ВедушийКонтрагент = Неопределено;
	х = 1;
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ВедушийКонтрагент) И выборка.Объект <> ВедушийКонтрагент Тогда
			ВедушийКонтрагент = Выборка.Объект;
			ПолеФормы = Элементы.Найти("КонактноеЛицо" + х);
			Если ПолеФормы = Неопределено Тогда
				ПолеФормы = Элементы.Добавить("КонактноеЛицо" + х, Тип("ДекорацияФормы"), Элементы.ГруппаКонтактов);
				ПолеФормы.Вид = ВидДекорацииФормы.Надпись; 
				ПолеФормы.Шрифт = Новый Шрифт(,,Истина,,Истина);
			КонецЕсли;
			ПолеФормы.Заголовок = Строка(Выборка.Объект);
			Вид = Неопределено;
		КонецЕсли;
		Если Вид = Неопределено ИЛИ Выборка.Вид <> Вид Тогда
			Вид = Выборка.Вид;
			ЭлементВид = Элементы.Найти("вид" + х);
			Если ЭлементВид = Неопределено Тогда
				ЭлементВид = Элементы.Добавить("Вид" + х, Тип("ДекорацияФормы"), Элементы.ГруппаКонтактов);
				ЭлементВид.Вид = ВидДекорацииФормы.Надпись;
				ЭлементВид.Шрифт = Новый Шрифт(,,Истина);
			КонецЕсли;
			ЭлементВид.Заголовок = Строка(Выборка.Вид);
		КонецЕсли;
		ЭлементПредставление = Элементы.Найти("Представление" + х);
		Если ЭлементПредставление = Неопределено Тогда
			ЭлементПредставление = Элементы.Добавить("Представление" + х, Тип("ДекорацияФормы"), Элементы.ГруппаКонтактов);
			ЭлементПредставление.Вид = ВидДекорацииФормы.Надпись;
		КонецЕсли;
		ЭлементПредставление.Заголовок = Строка(Выборка.Представление);
		х = х + 1;
	КонецЦикла;
	Коментарий = Клиент.Контрагент.Комментарий;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКлиентовНаСогласованииПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОбработатьСменуСтроки", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКлиентовСогласованПриАктивизацииСтроки(Элемент)
	
	УстановитьПараметрСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКлиентовНеСогласованПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОбработатьСменуСтроки", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявку(Команда)
	
	ФормаНового = ПолучитьФорму("Документ.Renault_ЗаявкаНаКорпоративнуюСкидку.Форма.ФормаДокумента");
	ДанныеФормы = ФормаНового.Объект;
	Если Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаОбработкиВин Тогда
		ТекущийСписок = Элементы.СписокВинКлиента;
	Иначе
		ТекущийСписок = Элементы.СписокВыданных;
	КонецЕсли;
	
	ПолучитьВыделеныеСтроки(ТекущийСписок, ТекущийСписок.ВыделенныеСтроки);
	СоздатьЗаявкуНаСервере(ДанныеФормы, мВыбраныСсылки);
	КопироватьДанныеФормы(ДанныеФормы, ФормаНового.Объект); 
	Если Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаОбработкиВин Тогда
		ФормаНового.Объект.ТипЗаявки = ПредопределенноеЗначение("Перечисление.Renault_ТипыЗаявокНаКорпоротивнуюСкидку.СкидкаПриОтгрузке");
	Иначе
		ФормаНового.Объект.ТипЗаявки = ПредопределенноеЗначение("Перечисление.Renault_ТипыЗаявокНаКорпоротивнуюСкидку.ВозмещениеСкидки");
	КонецЕсли;
	ФормаНового.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаявкуНаСервере(ДанныеФормы, мВыбраныСсылки)
	
	ТЗЗарезервированных = Новый ТаблицаЗначений;
	ТЗЗарезервированных.Колонки.Добавить("VIN", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(17)));
	ТЗЗарезервированных.Колонки.Добавить("Автомобиль", Новый ОписаниеТипов("СправочникСсылка.Автомобили"));
	
	Для Каждого СтрокаМассива из мВыбраныСсылки Цикл 
		Если Не ЗначениеЗаполнено(СтрокаМассива.СтатусЗаявки) Или СтрокаМассива.СтатусЗаявки = Перечисления.Renault_СостоянияСогласованияКорпСкидок.НеСогласован Тогда 
			СтрокаТЗ = ТЗЗарезервированных.Добавить();
			СтрокаТЗ.VIN = СтрокаМассива.VIN;
			СтрокаТЗ.Автомобиль = СтрокаМассива.Автомобиль;
		КонецЕсли;
	КонецЦикла;
	
	ЗаявкаНаСкидку = Документы.Renault_ЗаявкаНаКорпоративнуюСкидку.СоздатьДокумент();
	ЗаявкаНаСкидку.Дата = ТекущаяДата();
	ЗаявкаНаСкидку.УстановитьНовыйНомер();
	ЗаявкаНаСкидку.Клиент = Клиент;
	ЗаявкаНаСкидку.ТипЗаявки = Перечисления.Renault_ТипыЗаявокНаКорпоротивнуюСкидку.СкидкаПриОтгрузке;
	ЗаявкаНаСкидку.ТипОтгрузки = Перечисления.Renault_ТипыОтгрузокНаКорпоративнуюСкидку.Отгрузка;
	ЗаявкаНаСкидку.Статус = Перечисления.Renault_СостоянияСогласованияКорпСкидок.Черновик;
	ЗаявкаНаСкидку.Автор = ПараметрыСеанса.Пользователь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.VIN,
	|	Таблица.Автомобиль
	|ПОМЕСТИТЬ ВТ_Автомобилей
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Автомобилей.VIN КАК ВИН,
	|	ВТ_Автомобилей.Автомобиль,
	|	ЕСТЬNULL(CRM_СостояниеАвтомобилейПроизводителя_v2.ЦенаПродажиБаза + CRM_СостояниеАвтомобилейПроизводителя_v2.ЦенаПродажиОпции, 0) КАК ЦенаPVC,
	|	ЕСТЬNULL(CRM_СостояниеАвтомобилейПроизводителя_v2.DEALER_PRICE_BASE + CRM_СостояниеАвтомобилейПроизводителя_v2.DEALER_PRICE_OPTION, 0) КАК ЦенаPVR
	|ИЗ
	|	ВТ_Автомобилей КАК ВТ_Автомобилей
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
	|		ПО ВТ_Автомобилей.VIN = CRM_СостояниеАвтомобилейПроизводителя_v2.VIN";
	Запрос.УстановитьПараметр("Таблица", ТЗЗарезервированных);
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество () > 0 Тогда
		ЗаявкаНаСкидку.ТаблицаВИН.Загрузить(Результат);
	КонецЕсли;
	Приемник = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.Renault_ЗаявкаНаКорпоративнуюСкидку")); 
	ЗаполнитьЗначенияСвойств(Приемник, ЗаявкаНаСкидку);
	Приемник.ТаблицаВИН.Загрузить(ЗаявкаНаСкидку.ТаблицаВИН.Выгрузить());
	ЗначениеВДанныеФормы(Приемник, ДанныеФормы);
	мВыбраныСсылки = Новый Массив;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВИН(Команда)
	
	ТекущаяСтрока = Элементы.СписокVINНаСогласовании.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Автомобиль", ТекущаяСтрока.VIN);
		Отбор.Вставить("Заявка", ТекущаяСтрока.Заявка);
		СогласоватьНаСервере(Отбор);
	КонецЕсли;
	Оповестить("ЗаписьVIN");
	
КонецПроцедуры

&НаСервере
Процедура СогласоватьНаСервере(Отбор)
	
	МенеджерЗаписи = РегистрыСведений.Renault_СостоянияVINВЗаявках.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.VIN = Отбор.Автомобиль;
	МенеджерЗаписи.Заявка = Отбор.Заявка;
	МенеджерЗаписи.Статус = Перечисления.Renault_СостоянияСогласованияКорпСкидок.НеСогласован;
	МенеджерЗаписи.Записать();
	
	НаборЗаписи = РегистрыСведений.Renault_СостоянияVINВЗаявках.СоздатьНаборЗаписей();
	НаборЗаписи.Отбор.VIN.Установить(Отбор.Автомобиль);
	НаборЗаписи.Отбор.Заявка.Установить(Отбор.Заявка);
	НаборЗаписи.Прочитать();
	Узел = ПланыОбмена.Renault_ОчередьЗаявокНаСкидку.ПоличитьУзелОбмена();
	ПланыОбмена.ЗарегистрироватьИзменения(Узел, НаборЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокVINСогласованВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьVIN("");
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	мСостояние = Новый Массив;
	
	Если ЗначениеЗаполнено(Статус) Тогда
		мСостояние.Добавить(Статус);
		СписокКлиентов.Параметры.УстановитьЗначениеПараметра("Состояние", мСостояние);
	Иначе
		мСостояние.Добавить(ПредопределенноеЗначение("Перечисление.Renault_СостоянияСогласованияКлиента.Согласован"));
		мСостояние.Добавить(ПредопределенноеЗначение("Перечисление.Renault_СостоянияСогласованияКлиента.Черновик"));
		СписокКлиентов.Параметры.УстановитьЗначениеПараметра("Состояние", мСостояние);
	КонецЕсли;
	УстановитьЗаголовкиВкладок();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если Наименование <> "" Тогда
		Renault_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокКлиентов.Отбор,"Наименование",Наименование,ВидСравненияКомпоновкиДанных.Содержит,,Истина);
	Иначе
		Renault_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокКлиентов.Отбор,"Наименование",Наименование,ВидСравненияКомпоновкиДанных.Содержит,,Ложь);
	КонецЕсли;
	ЭтаФорма.ОбновитьОтображениеДанных();
	УстановитьЗаголовкиВкладок();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если Элементы.ГруппаВИН.Видимость = Ложь И ТекущаяСтраница = Элементы.ГруппаКлиенты Тогда
		Элементы.ГруппаВИН.Видимость = Истина;
		Элементы.ГруппаОбработки.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВинКлиентаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		Если Поле.Имя = "СписокВинКлиентаФлаг" Тогда
			СтандартнаяОбработка = Ложь;
			мИндекс = мВыбраныСсылки.Найти(Элемент.ТекущиеДанные.Автомобиль);
			Если мИндекс=Неопределено Тогда
				мВыбраныСсылки.Добавить(Элемент.ТекущиеДанные.Автомобиль);
			Иначе
				мВыбраныСсылки.Удалить(мИндекс);
			КонецЕсли;
		ИначеЕсли Поле.Имя = "СписокВинКлиентаVIN" ИЛИ Поле.Имя = "СписокВинКлиентаАвтомобиль" Тогда
			Если ЗначениеЗаполнено(ТекущаяСтрока.Заявка) Тогда
				сПараметров = Новый Структура;
				сПараметров.Вставить("Заявка", ТекущаяСтрока.Заявка);
				сПараметров.Вставить("Автомобиль", ТекущаяСтрока.Автомобиль);
				сПараметров.Вставить("Статус", ТекущаяСтрока.СтатусЗаявки);
				ОткрытьФорму("Обработка.Renault_АРМ_КорпоративныеСкидки.Форма.ФормаVIN", сПараметров, ЭтаФорма);
			КонецЕсли;
		ИначеЕсли Поле.Имя = "СписокВинКлиентаСтатусДоговора" Тогда
			Если ЗначениеЗаполнено(ТекущаяСтрока.ДоговорСсылка) Тогда
				сПараметры = Новый Структура;
				сПараметры.Вставить("Ключ", ТекущаяСтрока.ДоговорСсылка);
				ОткрытьФорму("Документ.Renault_Договор.ФормаОбъекта", сПараметры);
			КонецЕсли;
		ИначеЕсли Поле.Имя = "СписокВинКлиентаСтатусЗаявки" Тогда
			Если ЗначениеЗаполнено(ТекущаяСтрока.Заявка) И ТекущаяСтрока.СтатусЗаявки = Перечисления.Renault_СостоянияСогласованияКорпСкидок.Черновик Тогда
				сПараметры = Новый Структура;
				сПараметры.Вставить("Ключ", ТекущаяСтрока.Заявка);
				ОткрытьФорму("Документ.Renault_ЗаявкаНаКорпоративнуюСкидку.Форма.ФормаДокумента", сПараметры);
			ИначеЕсли ЗначениеЗаполнено(ТекущаяСтрока.Заявка) И ТекущаяСтрока.СтатусЗаявки <> Перечисления.Renault_СостоянияСогласованияКорпСкидок.Черновик Тогда
				сПараметров = Новый Структура;
				сПараметров.Вставить("Заявка", ТекущаяСтрока.Заявка);
				сПараметров.Вставить("Автомобиль", ТекущаяСтрока.Автомобиль);
				сПараметров.Вставить("Статус", ТекущаяСтрока.СтатусЗаявки);
				ОткрытьФорму("Обработка.Renault_АРМ_КорпоративныеСкидки.Форма.ФормаVIN", сПараметров, ЭтаФорма);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
Процедура ПолучитьВыделеныеСтроки(ЭлементСписок, ВыделенныеСтроки)
	
	мВыбраныСсылки = Новый Массив;
	Для Каждого ВыделеннаяСтрока из ВыделенныеСтроки Цикл
		мВыбраныСсылки.Добавить(ЭлементСписок.ДанныеСтроки(ВыделеннаяСтрока));
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗаявку(Команда)
	
	Если Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаОбработкиВин Тогда
		ТекущийСписок = Элементы.СписокВинКлиента;
	ИначеЕсли Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаВыданных Тогда
		ТекущийСписок = Элементы.СписокВыданных;
	Иначе
		ТекущийСписок = Элементы.СписокАрхив;
	КонецЕсли;
	ТекущаяСтрока = ТекущийСписок.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Или ТекущаяСтрока.СтатусЗаявки <> Перечисления.Renault_СостоянияСогласованияКорпСкидок.Черновик Тогда
		Возврат;
	КонецЕсли;
	
	сПараметры = Новый Структура;
	сПараметры.Вставить("Ключ", ТекущаяСтрока.Заявка);
	ОткрытьФорму("Документ.Renault_ЗаявкаНаКорпоративнуюСкидку.Форма.ФормаДокумента", сПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокКомментариев()
	
	ОтключитьОбработчикОжидания("ЗаполнитьСписокКомментариев");
	Если Элементы.ГруппаСтатусов.ТекущаяСтраница = Элементы.НаСогласовании 
		И Элементы.СписокКлиентовНаСогласовании.ТекущиеДанные <> Неопределено Тогда
		ИсторияКомментариев = ПолучитьИсториюКомментариевПоЗаявке(Клиент);
	Иначе
		ИсторияКомментариев = "";
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ЗаполнитьСписокКомментариев", 3, Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИсториюКомментариевПоЗаявке(Клиент)
	
	Возврат РегистрыСведений.RenaultFlotte_ИсторияКомментариев.ПолучитьКомментарииПоОбъектуСтрокой(Клиент.ИдЗаявки);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьКомментарий(Клиент, Текст)
	
	ДатаДобавления = ТекущаяУниверсальнаяДата();
	
	РегистрыСведений.RenaultFlotte_ИсторияКомментариев.ДобавитьКомментарий(
		Клиент.ИдЗаявки,
		Текст,
		ПараметрыСеанса.Renault_ПраваПользователя.ДилерскийЦентр,
		ДатаДобавления);
		
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьКомментарий(Команда)
	
	Если Не ЗначениеЗаполнено(НовыйКомментарий) Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьКомментарий(Клиент, НовыйКомментарий);
	
	ЗаполнитьСписокКомментариев();
	НовыйКомментарий = "";
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДоговор(Команда)
	
	ПолучитьВыделеныеСтроки(Элементы.СписокВинКлиента, Элементы.СписокВинКлиента.ВыделенныеСтроки); 
	СоздатьДоговорНаСервере(мВыбраныСсылки);
	Элементы.СписокВинКлиента.Обновить();
	Элементы.СписокВыданных.Обновить();
	мВыбраныСсылки = Новый Массив;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДоговорНаСервере (мВыбраныСсылки)   
	
	мАвтомобилей = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_РабочиеЛисты.IDK
	|ИЗ
	|	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	|ГДЕ
	|	Renault_РабочиеЛисты.Клиент.Ссылка = &Ссылка
	|	И Renault_РабочиеЛисты.ЛистЗакрыт = ЛОЖЬ
	|	И Renault_РабочиеЛисты.ЗапросНаЗакрытие = ЛОЖЬ";
	Запрос.УстановитьПараметр("Ссылка", Клиент.Контрагент);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не найден работчий лист";
		Возврат;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	РабочийЛист = Выборка.IDK;
	Отдел = Renault_РаботаСПравамиПользователя.ОтделПоУмолчанию(ПараметрыСеанса.Пользователь);
	ДилерскийЦентр = Отдел.ДилерскийЦентр;
	
	Для Каждого СтрокаМассива из мВыбраныСсылки Цикл 
		
		Если ЗначениеЗаполнено(СтрокаМассива.ДоговорСсылка)
			ИЛИ СтрокаМассива.Заявка.ТипЗаявки = Перечисления.Renault_ТипыЗаявокНаКорпоротивнуюСкидку.СкидкаПриОтгрузке
			И СтрокаМассива.СтатусЗаявки <> Перечисления.Renault_СостоянияСогласованияКорпСкидок.Согласован Тогда
			Продолжить;
		КонецЕсли;
		
		НовДок = Документы.Renault_Договор.СоздатьДокумент();
		НовДок.Дата = ТекущаяДата();
		НовДок.ДатаДоговора = ТекущаяДата();
		НовДок.ДилерскийЦентр = ДилерскийЦентр;
		
		НовДок.Клиент = Клиент.Контрагент;
		НовДок.НесколькоАвтомобилейВДоговоре = Ложь;
		НовДок.РабочийЛист = РабочийЛист;
		
		СтрАвто = НовДок.СоставДоговора.Добавить();
		СтрАвто.Идентификатор = Новый УникальныйИдентификатор;
		СтрАвто.VIN = СтрокаМассива.VIN;
		СтрАвто.Автомобиль = СтрокаМассива.Автомобиль;
		СтрАвто.Модель = СтрокаМассива.Автомобиль.Модель;
		СтрАвто.Версия = СтрокаМассива.Автомобиль.ВариантКомплектации;
		СтрАвто.Цвет = СтрокаМассива.Автомобиль.Цвет;
		СтрАвто.ГодВыпуска = Формат(СтрокаМассива.Автомобиль.ГодВыпуска, "ДФ=yyyy");
		СтрАвто.ЖелаемаяДатаВыдачи = ТекущаяДата();
		
		Запись = РегистрыСведений.CRM_СостояниеАвтомобилейПроизводителя_v2.СоздатьМенеджерЗаписи();
		Запись.VIN = СтрокаМассива.VIN;
		Запись.Прочитать();
		
		Если Не Запись.Выбран() Тогда
			//Все цены в ноль
			тОбщаяСуммаПоАвтомобилю = 0;
			тСтоимостьБазовойКомплектации = 0;
			тСуммаДоставки = 0;
			тСуммаСкидки = 0;
			тСтоимостьДопОпций = 0;
			тСтоимостьОпцийДилера = 0;
		Иначе
			//Получим цены продажи по данным склада
			тСтоимостьБазовойКомплектации = Запись.ЦенаПродажиБаза;
			тСуммаДоставки = Запись.ЦенаПродажиДоставка;
			тСтоимостьДопОпций = Запись.ЦенаПродажиОпции;
			тСтоимостьОпцийДилера = Запись.ЦенаПродажиДопОборудования;
			тСуммаСкидки = 0;
			ЗапролнитьДанныеПТС(СтрАвто, Запись);
		КонецЕсли;
		//Заполним окончательно в договоре
		тОбщаяСуммаПоАвтомобилю = тСтоимостьБазовойКомплектации + тСтоимостьДопОпций + тСтоимостьОпцийДилера + тСуммаДоставки;
		СтрАвто.СтоимостьБазовойКомплектации = тСтоимостьБазовойКомплектации;
		СтрАвто.СтоимостьДопОпций = тСтоимостьДопОпций;
		СтрАвто.СтоимостьОпцийДилера = тСтоимостьОпцийДилера;
		СтрАвто.ОбщаяСуммаПоАвтомобилю = тОбщаяСуммаПоАвтомобилю;
		СтрАвто.СуммаДоставки = тСуммаДоставки;
		СтрАвто.СуммаСкидки = СтрокаМассива.ЦенаPVC - СтрокаМассива.ЦенаFlotte;
		НовДок.СуммаДоговора = тОбщаяСуммаПоАвтомобилю - (СтрокаМассива.ЦенаPVC - СтрокаМассива.ЦенаFlotte);
		НовДок.ПриСозданииНовогоДоговора();
		ЗаполнитьДанныеОрганизации(НовДок);
		ЗагрузитьСписокДополнительныхОпцийПоТарифу(НовДок, СтрАвто);
		НовДок.СтатусПредварительныхДокументов = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Черновик;
		НовДок.СтатусОкончательныхДокументов = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Черновик;
		НовДок.СтатусДоговора = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Черновик;
		Попытка
			НовДок.Записать(РежимЗаписиДокумента.Проведение);
			мАвтомобилей.Добавить(СтрокаМассива.Автомобиль);
		Исключение
			Инфо = ИнформацияОбОшибке();
		КонецПопытки
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗонаВыдачиПоУмолчанию(ДЦ = Неопределено)
	
	Если ДЦ = Неопределено Тогда
		ДЦ = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
	КонецЕсли;
	
	Запрос = новый Запрос("ВЫБРАТЬ
	                      |	CRM_ДилерскиеЦентрыЗоныВыдачи.ЗонаВыдачи.Ссылка
	                      |ИЗ
	                      |	Справочник.CRM_ДилерскиеЦентры.ЗоныВыдачи КАК CRM_ДилерскиеЦентрыЗоныВыдачи
	                      |ГДЕ
	                      |	CRM_ДилерскиеЦентрыЗоныВыдачи.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка",ДЦ);
	Таблица = Запрос.Выполнить().Выгрузить();
	Если Таблица.Количество() > 0 Тогда
		Возврат Таблица[0].ЗонаВыдачиСсылка;
	Иначе
		Возврат Справочники.Renault_ЗоныВыдачиАвтомобилей.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗапролнитьДанныеПТС(СтрАвто, ЗаписьСостояниеАвтомобилейПроизводителя)
	
	СтрАвто.ПТС = ЗаписьСостояниеАвтомобилейПроизводителя.PTS_SERIE + " " + ЗаписьСостояниеАвтомобилейПроизводителя.PTS_NUM;
	СтрАвто.МаркаМодельПТС = ЗаписьСостояниеАвтомобилейПроизводителя.ModelTS;
	СтрАвто.ТипПТС = ЗаписьСостояниеАвтомобилейПроизводителя.TypeTS;
	СтрАвто.КатегорияПТС = ЗаписьСостояниеАвтомобилейПроизводителя.CategTS;
	СтрАвто.ГодИзготовленияПТС = ЗаписьСостояниеАвтомобилейПроизводителя.YEAR;
	СтрАвто.НомерДвигателяПТС = ЗаписьСостояниеАвтомобилейПроизводителя.ENGINE_NUM;
	СтрАвто.НомерШассиПТС = ЗаписьСостояниеАвтомобилейПроизводителя.Shassi;
	СтрАвто.НомерКузоваПТС = ЗаписьСостояниеАвтомобилейПроизводителя.Kuzov;
	СтрАвто.ЦветКузоваПТС = ЗаписьСостояниеАвтомобилейПроизводителя.COLOR_PTS;
	СтрАвто.РазрешеннаяМаксимальнаяМассаПТС = ЗаписьСостояниеАвтомобилейПроизводителя.MaxMass;
	СтрАвто.МассаБезНагрузкиПТС = ЗаписьСостояниеАвтомобилейПроизводителя.MinMass;
	СтрАвто.МощностьДвигателяПТС = ЗаписьСостояниеАвтомобилейПроизводителя.PowerLS;
	СтрАвто.РабочийОбъемДвигателяПТС = ЗаписьСостояниеАвтомобилейПроизводителя.VolumeEngine;
	СтрАвто.ТипДвигателяПТС = ЗаписьСостояниеАвтомобилейПроизводителя.TypeEngine;
	СтрАвто.ЭкологическийКлассДвигателяПТС = ЗаписьСостояниеАвтомобилейПроизводителя.EcoClass;
	СтрАвто.ОрганизацияИзготовительПТС = ЗаписьСостояниеАвтомобилейПроизводителя.NaimProiz;
	СтрАвто.ОдобрениеТипаТСПТС = ЗаписьСостояниеАвтомобилейПроизводителя.APPROV_STRING;
	СтрАвто.ДатаПТС = ЗаписьСостояниеАвтомобилейПроизводителя.DATE_PTS;
	СтрАвто.МодельДвигателяПТС = ЗаписьСостояниеАвтомобилейПроизводителя.ENGINE_MODEL;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеОрганизации(ДоговорОбъект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Организация,
	|	Организации.ИНН КАК ДилерИНН,
	|	Организации.КПП КАК ДилерКПП,
	|	Организации.НаименованиеПолное КАК ДилерНаименованиеОрганизации,
	|	Организации.ОсновнойБанковскийСчет.Банк.Наименование КАК ДилерБанк,
	|	Организации.ОсновнойБанковскийСчет.Банк.КоррСчет КАК ДилерКоррСчет,
	|	Организации.ОсновнойБанковскийСчет.Банк.Код КАК ДилерБИК,
	|	Организации.ОсновнойБанковскийСчет.НомерСчета КАК ДилерСчет,
	|	КонтактнаяИнформацияАдресФактический.Представление КАК ДилерАдресФактический,
	|	КонтактнаяИнформацияАдресЮридический.Представление КАК ДилерАдресЮридический,
	|	КонтактнаяИнформацияТелефон.Представление КАК ДилерТелефон
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияАдресЮридический
	|		ПО Организации.Ссылка = КонтактнаяИнформацияАдресЮридический.Объект
	|			И (&ВидАдресЮр = КонтактнаяИнформацияАдресЮридический.Вид)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияАдресФактический
	|		ПО Организации.Ссылка = КонтактнаяИнформацияАдресФактический.Объект
	|			И (&ВидАдресФакт = КонтактнаяИнформацияАдресФактический.Вид)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияТелефон
	|		ПО Организации.Ссылка = КонтактнаяИнформацияТелефон.Объект
	|			И (&ВидТелефон = КонтактнаяИнформацияТелефон.Вид)
	|ГДЕ
	|	Организации.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДоговорОбъект.Организация);
	Запрос.УстановитьПараметр("ВидТелефон", Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
	Запрос.УстановитьПараметр("ВидАдресФакт", Справочники.ВидыКонтактнойИнформации.АдресФактический);
	Запрос.УстановитьПараметр("ВидАдресЮр", Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДоговорОбъект, Выборка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСписокДополнительныхОпцийПоТарифу(ДоговорОбъект, СтрАвто)
	
	ДоговорОбъект.ДопОпцииАвтомобилей.Очистить();
	Тариф = Renault_CRM.ПолучитьТекущийТарифНаАвтомобили(ДоговорОбъект.ДатаДоговора);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Модель", СтрАвто.Модель);
	Запрос.УстановитьПараметр("ВариантКомплектации", СтрАвто.Версия);
	Запрос.УстановитьПараметр("Тариф", Тариф);
	Запрос.УстановитьПараметр("Идентификатор", СтрАвто.Идентификатор);
	Запрос.УстановитьПараметр("ДатаДоговора", ДоговорОбъект.ДатаДоговора);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&Идентификатор КАК Идентификатор,
	|	ЛОЖЬ КАК Выбран,
	|	Renault_ТарифНаОпцииАвтомобилей.Опция КАК Опция,
	|	Renault_ТарифНаОпцииАвтомобилей.ЦенаКлиентская КАК Цена,
	|	Renault_ТарифНаОпцииАвтомобилей.Опция.Артикул КАК Код,
	|	ВЫРАЗИТЬ(Renault_ТарифНаОпцииАвтомобилей.Опция.НаименованиеПолное КАК СТРОКА(500)) КАК Наименование,
	|	10 КАК НомерСтроки
	|ИЗ
	|	РегистрСведений.Renault_ТарифНаОпцииАвтомобилей.СрезПоследних(
	|			,
	|			Модель = &Модель
	|				И ВариантКомплектации = &ВариантКомплектации
	|				И Тариф = &Тариф
	|				И Базовая = ЛОЖЬ) КАК Renault_ТарифНаОпцииАвтомобилей";
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	НомерСтроки = 1;
	Для Каждого Строка Из ТаблицаРезультат Цикл
		Строка.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	ДоговорОбъект.ДопОпцииАвтомобилей.Загрузить(ТаблицаРезультат);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДоговор(Команда)
	
	Если Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаОбработкиВин Тогда
		ТекущийСписок = Элементы.СписокВинКлиента;
	ИначеЕсли Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаВыданных Тогда
		ТекущийСписок = Элементы.СписокВыданных;
	Иначе
		ТекущийСписок = Элементы.СписокАрхив;
	КонецЕсли;
		
	ТекущаяСтрока = ТекущийСписок.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Или Не ЗначениеЗаполнено(ТекущаяСтрока.ДоговорСсылка)Тогда
		Возврат;
	КонецЕсли;
	
	сПараметры = Новый Структура;
	сПараметры.Вставить("Ключ", ТекущаяСтрока.ДоговорСсылка);
	ОткрытьФорму("Документ.Renault_Договор.ФормаОбъекта", сПараметры, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапланироватьВыдачу(Команда)
	
	Перем ДатаВыдачи;
	ПолучитьВыделеныеСтроки(Элементы.СписокВинКлиента, Элементы.СписокВинКлиента.ВыделенныеСтроки);
	Если ВвестиДату(ДатаВыдачи, "Введите планируемую дату выдачи", ЧастиДаты.Дата) Тогда 
		ЗапланироватьВыдачуНаСервере (мВыбраныСсылки, ДатаВыдачи);
	КонецЕсли;
	Элементы.СписокВинКлиента.Обновить();
	Элементы.СписокВыданных.Обновить();
	мВыбраныСсылки = Новый Массив;
	
КонецПроцедуры

&НаСервере
Процедура ЗапланироватьВыдачуНаСервере (мВыбраныСсылки, ДатаВыдачи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_РабочиеЛисты.IDK
	|ИЗ
	|	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	|ГДЕ
	|	Renault_РабочиеЛисты.Клиент.Ссылка = &Ссылка
	|	И Renault_РабочиеЛисты.ЛистЗакрыт = ЛОЖЬ
	|	И Renault_РабочиеЛисты.ЗапросНаЗакрытие = ЛОЖЬ";
	Запрос.УстановитьПараметр("Ссылка", Клиент.Контрагент);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не найден работчий лист";
		Возврат;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	РабочийЛист = Выборка.IDK;
	Отдел = Renault_РаботаСПравамиПользователя.ОтделПоУмолчанию(ПараметрыСеанса.Пользователь);
	ДилерскийЦентр = Отдел.ДилерскийЦентр;
	ЗонаВыдачи = ЗонаВыдачиПоУмолчанию(ДилерскийЦентр);
	Для Каждого СтрокаАвтомобиля из мВыбраныСсылки Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаАвтомобиля.ДоговорСсылка)
			ИЛИ СтрокаАвтомобиля.Заявка.ТипЗаявки = Перечисления.Renault_ТипыЗаявокНаКорпоротивнуюСкидку.СкидкаПриОтгрузке
			И СтрокаАвтомобиля.СтатусЗаявки <> Перечисления.Renault_СостоянияСогласованияКорпСкидок.Согласован Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаАвтомобиля.Событие) Тогда
			СобытиеОбъект = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
			СобытиеОбъект.IDK = РабочийЛист;
			СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.Выдача;
			СобытиеОбъект.Сотрудник = ПараметрыСеанса.Пользователь.Сотрудник;
			СобытиеОбъект.Автор = ПараметрыСеанса.Пользователь.Сотрудник;
			СобытиеОбъект.Комментарий = "Выдача автомобиля";
			СобытиеОбъект.Отдел = Отдел;
			СобытиеОбъект.ДилерскийЦентр = ДилерскийЦентр;
			СобытиеОбъект.Подразделение = ПараметрыСеанса.ПодразделениеКомпании;
			СобытиеОбъект.Дата = ТекущаяДата();
			СобытиеОбъект.ДатаНапоминания = ДатаВыдачи + 3600*9;
			
			ДокВыдача = Документы.CRM_ЗаписьНаВыдачу.СоздатьДокумент();
			ДокВыдача.Дата = ТекущаяДата();	
			ДокВыдача.IDK = РабочийЛист;
			ДокВыдача.ДилерскийЦентр = ДилерскийЦентр;
			ДокВыдача.Статус = Перечисления.CRM_СтатусыДокументаЗаписьНаВыдачу.Черновик;
			ДокВыдача.Клиент = Клиент.Контрагент;
			ДокВыдача.ДатаНачала =  ДатаВыдачи + 3600*9;
			ДокВыдача.Менеджер = ПараметрыСеанса.Пользователь.Сотрудник;;
			ДокВыдача.Продолжительность = 30; 
			ДокВыдача.ЗонаВыдачи = ЗонаВыдачи;
			
			СтрокаТЧ = ДокВыдача.АвтомобилиДляВыдачи.Добавить();
			СтрокаТЧ.Автомобиль = СтрокаАвтомобиля.Автомобиль;
			СтрокаТЧ.VIN = СтрокаАвтомобиля.VIN;
			СтрокаТЧ.Выбран = Истина;
			ДокВыдача.Записать(РежимЗаписиДокумента.Проведение);
			
			СобытиеОбъект.Объект = ДокВыдача.Ссылка;
			СтрокаТЧ = СобытиеОбъект.АвтомобилиДляВыдачи.Добавить();
			СтрокаТЧ.Автомобиль = СтрокаАвтомобиля.Автомобиль;
			СтрокаТЧ.VIN = СтрокаАвтомобиля.VIN;
			СтрокаТЧ.Выбран = Истина;
			
			СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Выдача(Команда)
	
	ПолучитьВыделеныеСтроки(Элементы.СписокВинКлиента, Элементы.СписокВинКлиента.ВыделенныеСтроки);
	ЗапланироватьВыдачуНаСервере(мВыбраныСсылки, ТекущаяДата());
	Элементы.СписокВинКлиента.Обновить();
	Элементы.СписокВыданных.Обновить();
	ПолучитьВыделеныеСтроки(Элементы.СписокВинКлиента, Элементы.СписокВинКлиента.ВыделенныеСтроки);
	ЗавершитьВыдачуНаСервере(мВыбраныСсылки, "Автомобиль выдан");
	мВыбраныСсылки = Новый Массив;
	Элементы.СписокВинКлиента.Обновить();
	Элементы.СписокВыданных.Обновить(); 
	
КонецПроцедуры

&НаСервере
Функция ЗавершитьВыдачуНаСервере(мВыбраныСсылки, СтатусВыдачи)
	
	МассивЗапланированных = Новый Массив;
	Для Каждого СтрокаАвтомобиля из мВыбраныСсылки Цикл	
		
		Если Не ЗначениеЗаполнено(СтрокаАвтомобиля.ДоговорСсылка)
			ИЛИ СтрокаАвтомобиля.Заявка.ТипЗаявки = Перечисления.Renault_ТипыЗаявокНаКорпоротивнуюСкидку.СкидкаПриОтгрузке
			И СтрокаАвтомобиля.СтатусЗаявки <> Перечисления.Renault_СостоянияСогласованияКорпСкидок.Согласован Тогда
			Продолжить;
		КонецЕсли;
		
		Событие = СтрокаАвтомобиля.Событие.ПолучитьОбъект();
		Событие.Обработано = Истина;
		Событие.ДатаЗакрытия = ТекущаяДата();
		Событие.АвторЗакрытия = ПараметрыСеанса.Пользователь.Сотрудник;
		Если СтатусВыдачи = "Выдача отменена" Тогда
			Событие.КомментарийЗакрытия = "Выдача отменена";
			Событие.Обработано = Ложь;
			Событие.ЗавершеноУспешно = Ложь;
		ИначеЕсли СтатусВыдачи = "Автомобиль выдан" Тогда
			Событие.КомментарийЗакрытия = "Автомобиль выдан";
			Событие.ЗавершеноУспешно = Истина;
		КонецЕсли;
		Событие.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ОтменаВыдачи(Команда)
	
	Если Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаОбработкиВин Тогда
		ТекущийСписок = Элементы.СписокВинКлиента;
	Иначе
		ТекущийСписок = Элементы.СписокВыданных;
	КонецЕсли;
	
	ПолучитьВыделеныеСтроки(ТекущийСписок, ТекущийСписок.ВыделенныеСтроки);
	ЗавершитьВыдачуНаСервере(мВыбраныСсылки, "Выдача отменена");
	мВыбраныСсылки = Новый Массив;
	Элементы.СписокВинКлиента.Обновить(); 
	Элементы.СписокВыданных.Обновить(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	мВыбраныСсылки = Новый Массив;
	Если ТекущаяСтраница.Имя = "ГруппаОбработкиВин" Тогда
		Если Клиент.Состояние <> ПредопределенноеЗначение("Перечисление.Renault_СостоянияСогласованияКлиента.Согласован") Тогда
			Элементы.СписокВинКлиента.Доступность = ложь;
		Иначе
			Элементы.СписокВинКлиента.Доступность = Истина;
		КонецЕсли;
	ИначеЕсли ТекущаяСтраница.Имя = "ГруппаВыданных" Тогда 
		Элементы.СписокВыданных.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыданныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "СписокВыданныхVIN" ИЛИ Поле.Имя = "СписокВыданныхАвтомобиль" Тогда
		Если ЗначениеЗаполнено(ТекущаяСтрока.Заявка) Тогда
			сПараметров = Новый Структура;
			сПараметров.Вставить("Заявка", ТекущаяСтрока.Заявка);
			сПараметров.Вставить("Автомобиль", ТекущаяСтрока.Автомобиль);
			сПараметров.Вставить("Статус", ТекущаяСтрока.СтатусЗаявки);
			ОткрытьФорму("Обработка.Renault_АРМ_КорпоративныеСкидки.Форма.ФормаVIN", сПараметров, ЭтаФорма);
		КонецЕсли;
	ИначеЕсли Поле.Имя = "СписокВыданныхДоговорСсылка" ИЛИ Поле.Имя = "СписокВыданныхСтатусДоговора" Тогда
		Если ЗначениеЗаполнено(ТекущаяСтрока.ДоговорСсылка) Тогда
			сПараметры = Новый Структура;
			сПараметры.Вставить("Ключ", ТекущаяСтрока.ДоговорСсылка);
			ОткрытьФорму("Документ.Renault_Договор.ФормаОбъекта", сПараметры);
		КонецЕсли;
	ИначеЕсли Поле.Имя = "СписокВыданныхСтатусЗаявки" Тогда
		Если ЗначениеЗаполнено(ТекущаяСтрока.Заявка) И ТекущаяСтрока.СтатусЗаявки = Перечисления.Renault_СостоянияСогласованияКорпСкидок.Черновик Тогда
			сПараметры = Новый Структура;
			сПараметры.Вставить("Ключ", ТекущаяСтрока.Заявка);
			ОткрытьФорму("Документ.Renault_ЗаявкаНаКорпоративнуюСкидку.Форма.ФормаДокумента", сПараметры);
		ИначеЕсли ЗначениеЗаполнено(ТекущаяСтрока.Заявка) И ТекущаяСтрока.СтатусЗаявки <> Перечисления.Renault_СостоянияСогласованияКорпСкидок.Черновик Тогда
			сПараметров = Новый Структура;
			сПараметров.Вставить("Заявка", ТекущаяСтрока.Заявка);
			сПараметров.Вставить("Автомобиль", ТекущаяСтрока.Автомобиль);
			сПараметров.Вставить("Статус", ТекущаяСтрока.СтатусЗаявки);
			ОткрытьФорму("Обработка.Renault_АРМ_КорпоративныеСкидки.Форма.ФормаVIN", сПараметров, ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьКомментарий(Команда)
	
	ЗаписатьКомментарийНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКомментарийНаСервере()
	
	КлиентОбъект = Клиент.Контрагент.ПолучитьОбъект();
	КлиентОбъект.Комментарий = Коментарий;
	КлиентОбъект.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Автосклад(Команда)
	
	сПараметров = ПолучитьСтруктуруПараметров(Клиент);
	
	Форма = ПолучитьФорму("Обработка.Renault_АРМ_Автосклад.Форма");

	Если сПараметров.Количество() > 0 Тогда
		Форма.м_РабочийЛист = сПараметров.РабочийЛист;
		Форма.м_Клиент = сПараметров.Клиент;
		Форма.ЗапомнитьКлиента = Истина;
	КонецЕсли;
	Попытка
		Форма.ОткрытьМодально();
	Исключение
		Предупреждение("Автосклад ранее уже был открыт.
			|Закройте ранее открытую ыорму и повторите попытку.");
	КонецПопытки;
	Элементы.СписокВинКлиента.Обновить(); 
	Элементы.СписокВыданных.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруПараметров(Клиент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_РабочиеЛисты.IDK
	|ИЗ
	|	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	|ГДЕ
	|	Renault_РабочиеЛисты.Клиент.Ссылка = &Ссылка
	|	И Renault_РабочиеЛисты.ЛистЗакрыт = ЛОЖЬ
	|	И Renault_РабочиеЛисты.ЗапросНаЗакрытие = ЛОЖЬ";
	Запрос.УстановитьПараметр("Ссылка", Клиент.Контрагент);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не найден работчий лист";
		Возврат Новый Структура;
	КонецЕсли;
	сПараметров = Новый Структура;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	сПараметров.Вставить("РабочийЛист", Выборка.IDK);
	сПараметров.Вставить("Клиент", Клиент.Контрагент);
	Возврат сПараметров;
	
КонецФункции

&НаКлиенте
Процедура СменитьМенеджера(Команда)
	
	Если Элементы.ГруппаСтатусов.ТекущаяСтраница = Элементы.Все Тогда
		ТекущиеДанные = Элементы.СписокКлиентовВсе.ТекущиеДанные;
	ИначеЕсли Элементы.ГруппаСтатусов.ТекущаяСтраница = Элементы.НаСогласовании Тогда
		ТекущиеДанные = Элементы.СписокКлиентовНаСогласовании.ТекущиеДанные;
	ИначеЕсли Элементы.ГруппаСтатусов.ТекущаяСтраница = Элементы.НеСогласован Тогда
		ТекущиеДанные = Элементы.СписокКлиентовНеСогласован.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Клиент = ТекущиеДанные.Ссылка;
	
	Форма = ПолучитьОбщуюФорму("Renault_ФормаВыбораПлиткой");
	Форма.Заголовок = "Выберите менеджера";
	СписокВыбора = Новый СписокЗначений;
	Выборка = Справочники.Сотрудники.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Renault_РаботаСПравамиПользователя.ЕстьПравоКорпПродажи(Выборка.Ссылка) Тогда
			СписокВыбора.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	Форма.СписокВыбора = СписокВыбора;
	
	Ответ = Форма.ОткрытьМодально();
	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СменитьМенеджераНаСервере(Клиент, Ответ);
	Оповестить("Запись_КорпоративныеКлиенты");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СменитьМенеджераНаСервере(Клиент, НовыйМенеджер)
	
	КлиентОбъект = Клиент.ПолучитьОбъект();
	КлиентОбъект.Менеджер = НовыйМенеджер;
	КлиентОбъект.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАрхивВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "СписокАрхивVIN" ИЛИ Поле.Имя = "СписокАрхивАвтомобиль" Тогда
		Если ЗначениеЗаполнено(ТекущаяСтрока.Заявка) Тогда
			сПараметров = Новый Структура;
			сПараметров.Вставить("Заявка", ТекущаяСтрока.Заявка);
			сПараметров.Вставить("Автомобиль", ТекущаяСтрока.Автомобиль);
			сПараметров.Вставить("Статус", ТекущаяСтрока.СтатусЗаявки);
			ОткрытьФорму("Обработка.Renault_АРМ_КорпоративныеСкидки.Форма.ФормаVIN", сПараметров, ЭтаФорма);
		КонецЕсли;
	ИначеЕсли Поле.Имя = "СписокАрхивДоговорСсылка" ИЛИ Поле.Имя = "СписокАрхивСтатусДоговора" Тогда
		Если ЗначениеЗаполнено(ТекущаяСтрока.ДоговорСсылка) Тогда
			сПараметры = Новый Структура;
			сПараметры.Вставить("Ключ", ТекущаяСтрока.ДоговорСсылка);
			ОткрытьФорму("Документ.Renault_Договор.ФормаОбъекта", сПараметры);
		КонецЕсли;
	ИначеЕсли Поле.Имя = "СписокАрхивСтатусЗаявки" Тогда
		Если ЗначениеЗаполнено(ТекущаяСтрока.Заявка) И ТекущаяСтрока.СтатусЗаявки = Перечисления.Renault_СостоянияСогласованияКорпСкидок.Черновик Тогда
			сПараметры = Новый Структура;
			сПараметры.Вставить("Ключ", ТекущаяСтрока.Заявка);
			ОткрытьФорму("Документ.Renault_ЗаявкаНаКорпоративнуюСкидку.Форма.ФормаДокумента",сПараметры);
		ИначеЕсли ЗначениеЗаполнено(ТекущаяСтрока.Заявка) И ТекущаяСтрока.СтатусЗаявки <> Перечисления.Renault_СостоянияСогласованияКорпСкидок.Черновик Тогда
			сПараметров = Новый Структура;
			сПараметров.Вставить("Заявка", ТекущаяСтрока.Заявка);
			сПараметров.Вставить("Автомобиль", ТекущаяСтрока.Автомобиль);
			сПараметров.Вставить("Статус", ТекущаяСтрока.СтатусЗаявки);
			ОткрытьФорму("Обработка.Renault_АРМ_КорпоративныеСкидки.Форма.ФормаVIN", сПараметров, ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзРабочегоЛиста(Команда)
	
	РабочийЛист = ОткрытьФормуМодально("РегистрСведений.Renault_РабочиеЛисты.ФормаВыбора");
	Если РабочийЛист = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьКарточкуКорпКлиента();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточкуКорпКлиента()
	
	//Форма = ПолучитьФорму("ОбщаяФорма.Renault_ФормаКорпоративногоКлиента");
	//Форма.Ключ = ПолучитьКонтрагента(Клиент);
	//Форма.Открыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКонтрагента(Клиент)
	
	Возврат Клиент.Контрагент;
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьОтчетЗаявкаНаКорпкидкуНаСервере(Ссылка)
	
	Возврат Отчеты.Renault_ОтчетПоЗаявкамНаКорпоративнуюСкидку.СформироватьОтчетНаСервере(Ссылка, "СхемаКомпоновкиДляДокумента");
	
КонецФункции

&НаКлиенте
Процедура СформироватьОтчетЗаявкаНаКорпкидку(Команда)
	
	ТекущаяСтрока = Неопределено;
	
	Если Элементы.СписокVINНаСогласовании.ТекущиеДанные <> Неопределено Тогда
		ТекущаяСтрока = Элементы.СписокVINНаСогласовании.ТекущиеДанные;
		
	ИначеЕсли Элементы.СписокVINСогласован.ТекущиеДанные <> Неопределено Тогда
		ТекущаяСтрока = Элементы.СписокVINСогласован.ТекущиеДанные;
		
	ИначеЕсли Элементы.СписокVINНеСогласован.ТекущиеДанные <> Неопределено Тогда
		ТекущаяСтрока = Элементы.СписокVINНеСогласован.ТекущиеДанные;
		
	ИначеЕсли Элементы.СписокVINОтчетПредоставлен.ТекущиеДанные <> Неопределено Тогда
		ТекущаяСтрока = Элементы.СписокVINОтчетПредоставлен.ТекущиеДанные;
		
	ИначеЕсли Элементы.СписокVINОтчетаНеБудет.ТекущиеДанные <> Неопределено Тогда
		ТекущаяСтрока = Элементы.СписокVINОтчетаНеБудет.ТекущиеДанные;
		
	ИначеЕсли Элементы.СписокVINДопИнформация.ТекущиеДанные <> Неопределено Тогда
		ТекущаяСтрока = Элементы.СписокVINДопИнформация.ТекущиеДанные;
		
	ИначеЕсли Элементы.СписокЗаявокАрхив.ТекущиеДанные <> Неопределено Тогда
		ТекущаяСтрока = Элементы.СписокЗаявокАрхив.ТекущиеДанные;
		
	ИначеЕсли Элементы.СписокЗаявок.ТекущиеДанные <> Неопределено Тогда
		ТекущаяСтрока = Элементы.СписокЗаявок.ТекущиеДанные;
		ЗаявкаСсылка = ТекущаяСтрока.Ссылка;
	КонецЕсли;
		
	Если ТекущаяСтрока <> Неопределено Тогда
		ЗаявкаСсылка = ТекущаяСтрока.Заявка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаявкаСсылка) Тогда
		Результат = СформироватьОтчетЗаявкаНаКорпкидкуНаСервере(ЗаявкаСсылка);
		Результат.ОтображатьЗаголовки = Ложь;
		Результат.ОтображатьСетку = Ложь;
		Результат.Показать("Отчет по заявке на корп.скидку");
	КонецЕсли;

КонецПроцедуры
