Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
	//Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)   
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Если ЭтоГруппа Тогда Возврат КонецЕсли;
	
	//проверка заполнения
	МассивНеНайденныхТипов=Новый Массив;
	Если Не Справочники.Renault_КонвертацияДанных.ВыполнитьПроверкуМетаданных(ЭтотОбъект,МассивНеНайденныхТипов) Тогда 
		//Отказ=Истина 
	КонецЕсли;
	
	//проверка существования общего реквизита Renault_ВерсияВнешнихДанных
	Если Найти(Наименование,"РегистрСведений.")=0 Тогда
		Запрос=Новый Запрос("Выбрать Первые 1 Renault_ВерсияВнешнихДанных Из "+Наименование);
		Попытка Запрос.Выполнить() Исключение
			Активно=Ложь;
			Сообщить("Для метаданных <"+Наименование+"> необходимо в конфигураторе включить использование общего реквизита <Renault_ВерсияВнешнихДанных>, а пока элемент будет не активным",СтатусСообщения.Внимание);
		КонецПопытки;	
	КонецЕсли;
	
	//проверка существования полей поиска
	Если Активно И Найти(Наименование,"РегистрСведений.")>0 И Реквизиты.Количество()>0 Тогда
		Если Реквизиты.НайтиСтроки(Новый Структура("Поиск",Истина)).Количество()=0 Тогда
			Отказ=Истина;
			Сообщить("Для <"+Наименование+"> не определены поля поика (Измерения РегистраСведений)",СтатусСообщения.Внимание);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//не должно быть 2х активных (дублирования метаданных)
	//Если ЭтоГруппа Тогда 
	//	Запрос=Новый Запрос("Выбрать 1 Из Справочник.Renault_КонвертацияДанных ГДЕ Наименование=&Наименование И Ссылка<>&Ссылка");
	//	Запрос.УстановитьПараметр("Наименование",Наименование);
	//	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	//	Если Не Запрос.Выполнить().Пустой() Тогда
	//		Отказ=Истина;
	//		Сообщить("Группа метаданных <"+Наименование+"> уже существует",СтатусСообщения.Информация);
	//	КонецЕсли;
	//Иначе
		Если Активно Тогда
			Запрос=Новый Запрос("Выбрать 1 Из Справочник.Renault_КонвертацияДанных ГДЕ Наименование=&Наименование И Активно И Ссылка<>&Ссылка");
			Запрос.УстановитьПараметр("Наименование",Наименование);
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			Если Не Запрос.Выполнить().Пустой() Тогда
				Отказ=Истина;
				Сообщить("Описание метаданных <"+Наименование+"> уже существует",СтатусСообщения.Информация);
			КонецЕсли;
		КонецЕсли;	
	//КонецЕсли;
	
КонецПроцедуры
