Функция ПолучитьВидСобытия(ВидСобытия) Экспорт
	
	Если ВидСобытия = Справочники.CRM_ВидыСобытий.Кредит 
		ИЛИ ВидСобытия=Справочники.CRM_ВидыСобытий.Страховка 
		ИЛИ ВидСобытия=Справочники.CRM_ВидыСобытий.КонсультацияОФУ Тогда
		Возврат "ОФУ";
	ИначеЕсли ВидСобытия = Справочники.CRM_ВидыСобытий.ПлановаяПролонгация
		ИЛИ ВидСобытия = Справочники.CRM_ВидыСобытий.КлиентыСервиса
		ИЛИ ВидСобытия = Справочники.CRM_ВидыСобытий.УтеряннаяБаза
        ИЛИ ВидСобытия = Справочники.CRM_ВидыСобытий.НапоминаниеОВзносе Тогда
        Возврат "Пролонгация";
	Иначе
		Возврат "";
	КонецЕсли;
			
КонецФункции
