#Область ОписаниеПеременных

&НаКлиенте
Перем ДанныеПроценкиИзменены, ТекПроценка, ПроценкиИзменены, СкладыПроценкиИзменены, zp;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Метаданные.Константы.Найти("ИспользоватьСоглашенияСКлиентами")<>Неопределено Тогда
		Если Константы.ИспользоватьСоглашенияСКлиентами.Получить() Тогда
			Элементы.ТиповоеСоглашение.Видимость=Метаданные.Справочники.Найти("СоглашенияСКлиентами")<>Неопределено;
			
			ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.СоглашенияСКлиентами"); 
			Элементы.ТиповоеСоглашение.ОграничениеТипа = ОписаниеТипа;
		КонецЕсли;
	КонецЕсли;
	
	// Список выбора для РеквизитНомераДляПоиска
	Если Метаданные.Справочники.Найти("Номенклатура")<>Неопределено Тогда
		Реквизиты=Метаданные.Справочники.Номенклатура.Реквизиты;
		Если Реквизиты.Найти("Артикул")<>Неопределено Тогда 
			Элементы.РеквизитНомераДляПоиска.СписокВыбора.Добавить("Артикул",Реквизиты.Артикул.Синоним);
		КонецЕсли;
		Если Реквизиты.Найти("АртикулДляПоиска")<>Неопределено Тогда 
			Элементы.РеквизитНомераДляПоиска.СписокВыбора.Добавить("АртикулДляПоиска",Реквизиты.АртикулДляПоиска.Синоним);
		КонецЕсли;
		Если Реквизиты.Найти("ор_НомерПоКаталогу")<>Неопределено Тогда 
			Элементы.РеквизитНомераДляПоиска.СписокВыбора.Добавить("ор_НомерПоКаталогу",Реквизиты.ор_НомерПоКаталогу.Синоним);
		КонецЕсли;
		Если Реквизиты.Найти("НомерПоКаталогу")<>Неопределено Тогда 
			Элементы.РеквизитНомераДляПоиска.СписокВыбора.Добавить("НомерПоКаталогу",Реквизиты.НомерПоКаталогу.Синоним);
		КонецЕсли;
		Если Реквизиты.Найти("Вес")=Неопределено Тогда
			Элементы.НеОбнВес.Видимость=Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("Страница") Тогда
		Если Параметры.Страница="ТехПоддержка" Тогда
			Элементы.Группа21.ТекущаяСтраница = Элементы.Группа21.ПодчиненныеЭлементы.ТехПоддержка;
		КонецЕсли;
	КонецЕсли;
	
	Если Метаданные.Справочники.Найти("Номенклатура") <> Неопределено Тогда
		Объект.ЕстьНоменклатура = ИСтина;
	Иначе
		Объект.ЕстьНоменклатура = Ложь;
		ЗаполнитьНачальныеНастройкиДляПустойБазы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНачальныеНастройкиДляПустойБазы()
	//уберем лишние элементы для пустой базы
	//Основные настройки
	Элементы.ПараметрыПодключения.Видимость = Ложь;
	Элементы.ОчиститьБаза.Видимость = Ложь;
	Элементы.ГруппаЗначенияНоменклатуры.Видимость = Ложь;
	Элементы.ТипЦенЗакупка.Доступность = Ложь;
	Элементы.ТипЦен.Доступность = Ложь;
	Элементы.Группа19_Синонимы.Доступность=Ложь;
	//Элементы.Группа22.Доступность=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВладелецФормы.ФормыПАВставить("НастройкиУФ",ЭтаФорма);
	ЭтаФорма.ЗакрыватьПриЗакрытииВладельца=Истина;
	ВладелецОбъект = ЭтаФорма.ВладелецФормы.Объект;
	Попытка
	   ЗаполнитьЗначенияСвойств(Объект,ВладелецОбъект,,
	   "ЗаказыКлиентов,ЗаявкаНаОформление,ЗаявкаПоставщику,ОчищеннаяТаблица,УточнениеПоиска,РезультатПоискаОнлайн, 
	   |МоиЗаявки,МоиЗаявкиКомментарии,ААОткрытиеОбработки,ОбучающиеСтатьи"); //зк()
    Исключение
	   Сообщить(ОписаниеОшибки());
   КонецПопытки;
    
	// Проценки начальные значения
	КодыПрайсов = ЗагрузитьТабПроценки();
	Если КодыПрайсов<>"" Тогда
		// Запрос на обновление данных о прайсах
		Запрос="{""action"":""getPrices"",""idPrices"":"""+Сред(КодыПрайсов,3)+""",""schema"":""pricelists""}";
		ЭтаФорма.ВладелецФормы.СендерОтправить(Запрос); // см.ОбновитьПрайсы
	КонецЕсли;
	
	ДанныеПроценкиИзменены=Ложь; ПроценкиИзменены=Ложь; СкладыПроценкиИзменены=Ложь;
	Элементы.Помощь.ТолькоПросмотр=Истина;
	// ограничения на доступность элементов формы
	Элементы.ВидНоменклатуры.Видимость=Объект.ВидНоменклатуры<>Неопределено;
	Если Строка(ТипЗнч(Объект.ВидНоменклатуры))="Категория номенклатуры" Тогда
		Элементы.ВидНоменклатуры.Заголовок="Категория номенклатуры";
	КонецЕсли;
	Элементы.ЦеноваяГруппа.Видимость=Объект.ЦеноваяГруппа<>Неопределено;
	Элементы.Группа31.Доступность=Элементы.Проценки.ТекущиеДанные<>Неопределено;
	
	РеквизитНомераДляПоискаПриИзменении(Неопределено);
	//-
	ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + ": Помощник автобизнеса " + Объект.Версия;
	    
	ОбновитьВидимостьПодсказок();  //Глухов 290618
	ОбновитьЛичныйКабинет();
	Группа21ПриСменеСтраницы(Элементы.Группа21,Элементы.Группа21.ТекущаяСтраница);
	Доступ=ПолучитьДоступНаСервере();
	Попытка
		Если Не Доступ.Админ Тогда
			Элементы.Администрирование.Доступность=Ложь;
			Если Не Доступ.Поставщики Тогда 
				Элементы.Группа22.Доступность=Ложь;
			КонецЕсли;
			Если Не Доступ.Основные Тогда
				Элементы.Группа23.Доступность=Ложь;
			ИначеЕсли Не Доступ.БезОграничений Тогда
				Элементы.ГруппаПараметрыПодключения.Доступность=Ложь;
				Элементы.УровниЦен.Доступность=Ложь;
				Элементы.ЗапретитьРедактированиеЦенВКорзине.Доступность=Ложь;
				Элементы.ЗаказВКомментарий.Доступность=Ложь;
				Элементы.ВсеЗаявкиПоставщику.Доступность=Ложь;
				Элементы.ГруппаЗначенияНоменклатуры.Доступность=Ложь;
				Элементы.СендерОтладка.Доступность=Ложь;
			КонецЕсли;
		КонецЕсли;
	Исключение 
	Конецпопытки;
	
	Если ВладелецФормы.Объект.ПоУмолчанию.Количество()>0 Тогда
		Для Каждого Стр Из ВладелецФормы.Объект.ПоУмолчанию Цикл
			Нов=ПоУмолчанию.Добавить();
			Нов.Имя=Стр.Ключ;
			Нов.Наименование=Стр.Значение.Наименование;
			Нов.Значение=Стр.Значение.Значение;
		КонецЦикла;
	Иначе
		Элементы.ГруппаПоУмолчанию.Видимость=Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если (Объект.РежимМодальности И ПроценкиИзменены)Тогда
		Если Вопрос("Данные настроек были изменены, сохранить изменения?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
			СохранитьНастройки(Неопределено);
		КонецЕсли;
	КонецЕсли;
		
	//Перезапись объекта с изменениями в основную форму
	Попытка
		ВладелецОбъект = ЭтаФорма.ВладелецФормы.Объект;
		ЗаполнитьЗначенияСвойств(ВладелецОбъект,Объект,,
		"ЗаявкаНаОформление,ЗаявкаПоставщику,ОчищеннаяТаблица,УточнениеПоиска,РезультатПоискаОнлайн,МоиЗаявки,МоиЗаявкиКомментарии,ОбучающиеСтатьи,ЗаказыКлиентов");//зк()
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ЗагрузитьТабПроценки()
	Обоработка = РеквизитФормыВЗначение("Объект");
	Обоработка.ОбновитьДанныеПоОнлайнПоставщикам();
	Проценки = ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","Проценки",,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
	//Если ТипЗнч(Проценки)<>Тип("ТаблицаЗначений") ТОгда
	//	Проценки = ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","Проценки",,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);    
	//КонецЕсли;
	Если ТипЗнч(Проценки)<>Тип("ТаблицаЗначений") ТОгда
		Проценки=Новый ТаблицаЗначений; 
	КонецЕсли;
	
	//Загрузка данных проценок
	ПКолонки=Проценки.Колонки;
	Если ПКолонки.Найти("Вкл")=Неопределено Тогда ПКолонки.Добавить("Вкл",Новый ОписаниеТипов("Булево"));КонецЕсли;
	Если ПКолонки.Найти("Сайт")=Неопределено Тогда ПКолонки.Добавить("Сайт",Новый ОписаниеТипов("Строка"));КонецЕсли;
	Если ПКолонки.Найти("Поставщик")=Неопределено Тогда 
		Если Метаданные.Справочники.Найти("Контрагенты") <> Неопределено Тогда
			ПКолонки.Добавить("Поставщик",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
		Иначе
			ПКолонки.Добавить("Поставщик",Новый ОписаниеТипов("Строка"));
		КонецЕсли;
	КонецЕсли;
	Если ПКолонки.Найти("Помощь")=Неопределено Тогда ПКолонки.Добавить("Помощь",Новый ОписаниеТипов("Строка"));КонецЕсли;
	Если ПКолонки.Найти("Проверка")=Неопределено Тогда ПКолонки.Добавить("Проверка",Новый ОписаниеТипов("Булево"));КонецЕсли;
	Если ПКолонки.Найти("Авторизация")=Неопределено Тогда ПКолонки.Добавить("Авторизация");КонецЕсли;
	Если ПКолонки.Найти("Фильтры")=Неопределено Тогда ПКолонки.Добавить("Фильтры");КонецЕсли;
	Если ПКолонки.Найти("Методы")=Неопределено Тогда ПКолонки.Добавить("Методы");КонецЕсли;
	Если ПКолонки.Найти("ОтПоставщика")=Неопределено Тогда ПКолонки.Добавить("ОтПоставщика",Новый ОписаниеТипов("Строка"));КонецЕсли;
	Если ПКолонки.Найти("СрокПлюс")=Неопределено Тогда ПКолонки.Добавить("СрокПлюс",Новый ОписаниеТипов("Число"));КонецЕсли;
	Если ПКолонки.Найти("Источник")=Неопределено Тогда ПКолонки.Добавить("Источник",Новый ОписаниеТипов("Строка"));КонецЕсли;
	СкладыВТаблицу(Проценки);
	// Добавляем информацию из прайс-листов
	КодыПрайсов="";
	ПустыеПрайсы=Новый Массив;
	
	Проценки.ЗаполнитьЗначения(Ложь,"Проверка");     //)
	Для каждого Запись из Проценки Цикл
		Запись.Сайт = НРЕГ(Запись.Сайт);	
		Если Пустаястрока(Запись.Источник) Тогда 
			Запись.Источник="API";
		ИначеЕсли Запись.Источник<>"API" Тогда
			Если ПустаяСтрока(Запись.Сайт) Тогда
				ПустыеПрайсы.Вставить(0,Запись);
			Иначе
				КодыПрайсов=КодыПрайсов+", "+Сред(Запись.Сайт,3);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Стр Из ПустыеПрайсы Цикл
		Проценки.Удалить(Стр);
	КонецЦикла;
	
	Если ПКолонки.Найти("НаименованиеСайт")=Неопределено Тогда 
		ПКолонки.Добавить("НаименованиеСайт",Новый ОписаниеТипов("Строка"));
		Для каждого Запись Из Проценки Цикл
			Запись.НаименованиеСайт = Запись.Сайт;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Проценки) Тогда
		//ТабПроценки.Загрузить(Проценки);
		Для Каждого Стр Из Проценки Цикл
			Нов=ТабПроценки.Добавить();
			ЗаполнитьЗначенияСвойств(Нов,Стр,,"Склады");
			Нов.Склады.Загрузить(Стр.Склады);
		КонецЦикла;
	КонецЕсли;
	Возврат КодыПрайсов;
КонецФункции

&НаСервере
Процедура СкладыВТаблицу(Таблица)
	Колонки=Таблица.Колонки;
	кСклады=Колонки.Найти("Склады");
	Если кСклады=Неопределено Тогда 
		Колонки.Добавить("Склады",Новый ОписаниеТипов("ТаблицаЗначений"));
	ИначеЕсли ТипЗнч(кСклады)<>Тип("ТаблицаЗначений") Тогда
		кСклады.Имя="СкладыПроценки";
		Колонки.Добавить("Склады",Новый ОписаниеТипов("ТаблицаЗначений"));
		Склады0=Новый ТаблицаЗначений;
		Склады0.Колонки.Добавить("Пометка",Новый ОписаниеТипов("Булево"),"Вкл");
		Склады0.Колонки.Добавить("Значение",Новый ОписаниеТипов("Строка"),"Склад");
		Склады0.Колонки.Добавить("СрокПлюс",Новый ОписаниеТипов("Число"),"Срок+");
		Склады0.Колонки.Добавить("Комментарий",Новый ОписаниеТипов("Строка"));
		
		Для Каждого Стр Из Таблица Цикл
			Стр.Склады=Склады0.СкопироватьКолонки();
			Если Стр.СкладыПроценки.Количество()>0 Тогда
				Если ТипЗнч(Стр.СкладыПроценки)=Тип("СписокЗначений") Тогда
					Для Каждого тСклад из Стр.СкладыПроценки Цикл
						ЗаполнитьЗначенияСвойств(Стр.Склады.Добавить(),тСклад,"Пометка,Значение")
					КонецЦикла;
				ИначеЕсли ТипЗнч(Стр.СкладыПроценки)=Тип("ТаблицаЗначений") Тогда
					Для Каждого тСклад из Стр.СкладыПроценки Цикл
						ЗаполнитьЗначенияСвойств(Стр.Склады.Добавить(),тСклад);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Колонки.Удалить(кСклады);
	КонецЕсли;
КонецПроцедуры

&НаСервере  //!!!
Процедура СохранитьНастройкиНаСервере()
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.СохранитьНастройкиВХранилище("ОсновныеНастройки");
КонецПроцедуры

&НаКлиенте   //!!!
Процедура СохранитьНастройки(Команда)
	//Сохраниение проценок
	//Если ПроценкиИзменены Тогда
		СохранитьПроценки(Команда);
	//КонецЕсли;
	Если Доступы.Количество()>0 Тогда
		Отбор=Доступы.НайтиСтроки(Новый Структура("ДоступИзменен",Истина));
		ЕСли Отбор.Количество()>0 Тогда
			Массив=Новый Массив;
			Для каждого стр из Отбор Цикл
				Массив.Добавить(Новый Структура("Имя,Админ,Основные,БезОграничений,Поставщики,Аналитика,Комментарий",
				Стр.Имя,Стр.Админ,Стр.Основные,Стр.БезОграничений,Стр.Поставщики,Стр.Аналитика,Стр.Комментарий));
			КонецЦикла;
			СохранитьДоступыНаСервере(Массив);
		КонецЕсли;
	КонецЕсли;
	Если ПоУмолчаниюИзменены Тогда
		СохранитьПоУмолчанию();
	КонецЕсли;
	
	//Сохранение настроек
	СохранитьНастройкиНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры

//#Область Элементов

&НаКлиенте  //!!!
Процедура ПутьКВременнойПапкеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//
	//СтандартнаяОбработка=Ложь;
	////Создаем новый диалог
	//Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	//Если Не ПустаяСтрока(Объект.ПУтьКВременнойПапке) Тогда
	//	Диалог.Каталог=Объект.ПУтьКВременнойПапке;
	//КонецЕсли;
	//Если Диалог.Выбрать() Тогда
	//	Объект.ПУтьКВременнойПапке=Диалог.Каталог;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте   //!!!
Процедура ОбщийПоискПриИзменении(Элемент)
	Объект.ОбщийПоискВрем=Объект.ОбщийПоиск;
КонецПроцедуры

//#КонецОбласти

//#Область Команд

&НаКлиенте
Процедура Поставщики(Команда)

	ФормаПараметры = Новый Структура();
	ФормаПараметры.Вставить("AvtoTest", Истина);	
	Попытка
		ОткрытьФормуМодально(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ФормаУФ", ФормаПараметры, ЭтаФорма);
	Исключение
		ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ФормаУФ", ФормаПараметры, ЭтаФорма);
	Конецпопытки;	
КонецПроцедуры

&НаКлиенте
Процедура УровниЦен(Команда)

	ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.УровниЦенУФ",,ЭтаФорма.ВладелецФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьБазаОтвет(Ответ,Доп) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОчиститьАртикулыНаСервере();
		ПоказатьПредупреждение(,"Операция завершена!", 0, "1С: Помощник автобизнеса");
	КонецЕсли;
Конецпроцедуры

&НаКлиенте
Процедура ОчиститьБаза(Команда)
	ОО=Новый ОписаниеОповещения("ОчиститьБазаОтвет",ЭтаФорма);
	ПоказатьВопрос(ОО,"ПРЕДУПРЕЖДЕНИЕ: Перед началом очистки сделайте ОБЯЗАТЕЛЬЛЬНО копию текущей базы. Очистить артикулы номенклатуры от незначащих символов?", РежимДиалогаВопрос.ДаНет, 0);
КонецПроцедуры

&НаСервере
Процедура ОчиститьАртикулыНаСервере()
	
    Выборка = Справочники.Номенклатура.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.ЭтоГруппа Тогда
			СправочникОбъект = Выборка.ПолучитьОбъект();
			СправочникОбъект.Артикул = ПодготовитьНомер(СокрЛП(СправочникОбъект.Артикул));
			Попытка
			    СправочникОбъект.Записать();
			Исключение
				Сообщить("Номенклатура " + СправочникОбъект.Наименование + " не обработана! " + ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЦикла; 
		
КонецПроцедуры
	
&НаКлиентеНаСервереБезКонтекста	
Функция ПодготовитьНомер(СтрНомер)
		
	СтрНомер=СокрЛП(строка(СтрНомер));
	СтрНомер=Стрзаменить(СтрНомер,символы.НПП,"");
	СтрНомер=Стрзаменить(СтрНомер,",","");
	СтрНомер=Стрзаменить(СтрНомер,")","");
	СтрНомер=Стрзаменить(СтрНомер,"(","");
	СтрНомер=Стрзаменить(СтрНомер,"-","");
	СтрНомер=Стрзаменить(СтрНомер,".","");
	СтрНомер=Стрзаменить(СтрНомер," ","");
	СтрНомер=Стрзаменить(СтрНомер,"_",""); // Символ подчеркивания является значимым
	СтрНомер=Стрзаменить(СтрНомер,"-","");
	СтрНомер=Стрзаменить(СтрНомер,"""","");
	СтрНомер=Стрзаменить(СтрНомер,"'","");
	СтрНомер=Стрзаменить(СтрНомер,":","");
	СтрНомер=Стрзаменить(СтрНомер,";","");
	СтрНомер=Стрзаменить(СтрНомер,"/","");
	СтрНомер=Стрзаменить(СтрНомер,"|","");
	СтрНомер=Стрзаменить(СтрНомер,"\","");
	СтрНомер=Стрзаменить(СтрНомер,"!","");
	СтрНомер=Стрзаменить(СтрНомер,"#","");
	СтрНомер=Стрзаменить(СтрНомер,"№","");
	СтрНомер=Стрзаменить(СтрНомер,"?","");
	СтрНомер=Стрзаменить(СтрНомер,"*","");
	Возврат ВРЕГ(СтрНомер);
	
Конецфункции

&НаКлиенте
Процедура ОчиститьПрайсОтвет(Ответ) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
        ОчиститьПрайсНаСервере();		
		ПоказатьПредупреждение(,"Операция завершена!", 0, "1С: Помощник автобизнеса");		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПрайс(Команда)
	ОО=Новый ОписаниеОповещения("ОчиститьПрайсОтвет",ЭтаФорма);
	ПоказатьВопрос(ОО,"Очистить артикулы прайс-листов от незначащих симвлов?", РежимДиалогаВопрос.ДаНет, 0);
КонецПроцедуры

&НаСервере 
Процедура ОчиститьПрайсНаСервере()
	Попытка
		Эксель = Новый COMОбъект("Excel.Application"); 
		Эксель.Displayalerts = 0;
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
		
	НастройкаЗагрузки=ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","НастройкаЗагрузки",,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
		
	Для каждого СтрокаТаб Из НастройкаЗагрузки Цикл
	
		Книга = Эксель.WorkBooks.Open(СокрЛП(СтрокаТаб.ПутьКФайлу));                                      
		Лист = Книга.WorkSheets(1).UsedRange;
		
		Попытка
		    ЧислоКолонка = Число(СтрокаТаб.Артикул);
		Исключение
			ЧислоКолонка = 0;
		КонецПопытки;
		
		Для К = 1 По Лист.Rows.Count Цикл
			//СтрокаТаб.Артикул
			Лист.Cells(К, ЧислоКолонка ).Value = Строка(ПодготовитьНомер(СокрЛП(Лист.Cells(К, ЧислоКолонка).Value)));
			Лист.Cells(К, ЧислоКолонка).NumberFormat = "@";			
		КонецЦикла;
			
		Попытка 		
			Книга.Save();
		Исключение
		КонецПопытки;
				
	КонецЦикла;
		
	Эксель.Application.Quit();
		
КонецПроцедуры

&НаСервере 
Процедура ОбновитьНаСервере(Каталог)     // Пока не используется

//	Попытка
//		Если Объект.Конфигурация = "УправлениеТорговлей 11.0" Тогда
//			Соединение = Новый FTPСоединение("109.188.66.72:21", , "ut11", "11155");	
//			Соединение.Получить("prof/nirax_ut11.zip", Каталог + "\nirax_ut11.zip");	
//		ИначеЕсли Объект.Конфигурация = "УправлениеТорговлей 11.1.2" Тогда
//			Соединение = Новый FTPСоединение("109.188.66.72:21", , "", "");
//			Соединение.Получить("/nirax_ut11_1.zip", Каталог + "\nirax_ut11_1.zip");
//		ИначеЕсли Объект.Конфигурация = "УправлениеТорговлей 11.1.4" Тогда
//			Соединение = Новый FTPСоединение("109.188.66.72:21", , "", "");
//			Соединение.Получить("/nirax_ut11_1.zip", Каталог + "\nirax_ut11_1.zip");
//		ИначеЕсли Объект.Конфигурация = "РозницаМагазинАвтозапчастей 2.1" Тогда
//			Соединение = Новый FTPСоединение("109.188.66.72",21, "rma", "54321", , Истина);
//			Соединение.Получить("prof/nirax_r20811ma.zip", Каталог + "\nirax_r20811ma.zip");
//		КонецЕсли;	
//	Исключение
//	  Сообщить("Ошибка соединения с FTP сервером: " + ОписаниеОшибки());
//	КонецПопытки;
//	
КонецПроцедуры

&НаСервере 
Функция СоединениеССерверомБыла()
	
	Попытка
		Если Объект.Конфигурация = "УправлениеТорговлей 11.0" Тогда
			Соединение = Новый FTPСоединение("109.188.66.72/", , "ut11", "11155");
			СписокФайлов = Соединение.НайтиФайлы("prof/version.txt");
		ИначеЕсли Объект.Конфигурация = "УправлениеТорговлей 11.1.2" Тогда
			Соединение = Новый FTPСоединение("109.188.66.72/", , "", "");
			СписокФайлов = Соединение.НайтиФайлы("version.txt");
		ИначеЕсли Объект.Конфигурация = "УправлениеТорговлей 11.1.4" Тогда
			Соединение = Новый FTPСоединение("109.188.66.72/", , "", "");
			СписокФайлов = Соединение.НайтиФайлы("version.txt");
		ИначеЕсли Объект.Конфигурация = "РозницаМагазинАвтозапчастей 2.1" Тогда
			Соединение = Новый FTPСоединение("109.188.66.72", 21, "rma", "54321", , Истина);
			СписокФайлов = Соединение.НайтиФайлы("prof/version.txt");
		КонецЕсли;	
		Если ЗначениеЗаполнено(СписокФайлов) Тогда
			Соединение.Получить(СписокФайлов[0].ПолноеИмя, КаталогВременныхФайлов() + "\NiraxVersionInfo.txt");
			Стр = "";
			Текст = Новый ЧтениеТекста();
			Текст.Открыть(КаталогВременныхФайлов() + "\NiraxVersionInfo.txt");
			Стр = Текст.ПрочитатьСтроку();	
		КонецЕсли;
		Текст.Закрыть();
		УдалитьФайлы(КаталогВременныхФайлов() + "\NiraxVersionInfo.txt");
		Возврат Стр;
	Исключение
	  Сообщить(ОписаниеОшибки());
		Возврат "";
	КонецПопытки;
			
КонецФункции

&НаКлиенте 
Процедура ОграниченияЛицензии()
	Если Объект.Лицензия = "БАЗОВЫЙ" Тогда
		Элементы.ЗаказПоставщику.Доступность = Ложь;
		Элементы.КассаККМ.Доступность = Ложь;
		Элементы.ОбщийПоиск.Доступность = Ложь;
		Элементы.Настроить.Доступность = Ложь;
		Элементы.УровниЦен.Доступность = Ложь;
		Элементы.ОчиститьПрайс.Доступность = Ложь;
		Элементы.Поставщики.Доступность = Ложь;
	КонецЕсли; 
КонецПроцедуры

//#КонецОбласти

//#Область Проценки
&НаКлиенте
Процедура СохранитьПроценки(Команда)
	//Если ПроценкиИзменены Тогда
		ТабПроценкиПриАктивизацииСтроки(Неопределено);
		ЗаписатьПроценкиНаСервере();
		ПроценкиИзменены=Ложь;
	//КонецЕсли;
КонецПроцедуры

&НаСервере    //!!!
Процедура ЗаписатьПроценкиНаСервере()
	Проценки=ТабПроценки.Выгрузить(Новый Массив);
	Проценки.Колонки.Добавить("Склады",НОвый ОписаниеТипов("ТаблицаЗначений"));
	Для Каждого Стр из ТабПроценки Цикл
		Нов=Проценки.Добавить();
		ЗаполнитьЗначенияСвойств(Нов,Стр);
		Нов.Склады=Стр.Склады.Выгрузить();
	КонецЦикла;
	ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса","Проценки",Проценки,,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
Конецпроцедуры

&НаКлиенте
Процедура ТабПроценкиПриАктивизацииСтроки(Элемент)

	Если ДанныеПроценкиИзменены Тогда
		//Изменение значений структуры данных
		СвойстваД=Новый Структура;
		Для Каждого Элем Из ДанныеПроценки Цикл
			Попытка
				СвойстваД.Вставить(Элем.Ключ,Элем.Значение);
			Исключение
			КонецПопытки;
		КонецЦикла;
		ТекПроценка.Авторизация = СвойстваД;
		ДанныеПроценкиИзменены=Ложь;
	КонецЕсли;
	
	Если СкладыПроценкиИзменены Тогда
		ТекПроценка.Склады.Очистить();
		Для Каждого стр Из СкладыПроценки цикл
			ЗаполнитьЗначенияСвойств(ТекПроценка.Склады.Добавить(),Стр);
		КонецЦикла;
		СкладыПроценкиИзменены=Ложь;
	КонецЕсли;
	
	Если ТекПроценка=Элементы.Проценки.ТекущиеДанные Тогда Возврат; КонецЕсли;
	
	ДанныеПроценки.Очистить();
	ТекПроценка=Элементы.Проценки.ТекущиеДанные;
	Если ТекПроценка=Неопределено Тогда
		СкладыПроценки.Очистить();
		Элементы.Группа31.Доступность=Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.Группа31.Доступность=Истина;
	Если ТекПроценка.Авторизация=Неопределено Тогда
		ТекПроценка.Авторизация=Новый Структура;
	КонецЕсли;
	Если ТекПроценка.Источник="API" Тогда
		Наименования=Новый Структура("АдресДоставки,СпособДоставки,СпособОплаты,КомментарийКЗаказу,АдресСамовывоза,ДатаОтгрузки,СоздаватьЗаказ",
		"Адрес доставки","Способ доставки","Способ оплаты","Комментарий к заказу","Адрес самовывоза" ,"Дата отгрузки","Создавать заказ");
		Для каждого Элем из ТекПроценка.Авторизация Цикл
			Нов=ДанныеПроценки.Добавить();
			Нов.Ключ=Элем.Ключ;
			Нов.Наименование=?(Наименования.Свойство(Нов.Ключ),Наименования[Нов.Ключ],Нов.Ключ);
			Нов.Значение=Элем.Значение;
		КонецЦикла;
		Помощь=ТекПроценка.Помощь;
		Методы="";	
		Для каждого Метод из ТекПроценка.Методы Цикл
			Если Метод.Значение="1" Тогда
				Методы=Методы+Метод.Ключ+"; ";
			КонецЕсли;
		КонецЦикла;	
		Элементы.ДанныеПроценки.ТолькоПросмотр=Ложь;
		Элементы.ДанныеПроценкиПрайс.Видимость=Ложь;
	Иначе
		СвойстваД=ТекПроценка.Авторизация;
		Нов=ДанныеПроценки.Добавить();
		Нов.Ключ="dateFrom";Нов.Значение=СвойстваД.dateFrom;Нов.Наименование="Дата прайс-листа";
		Нов=ДанныеПроценки.Добавить();
		Нов.Ключ="dateDownload";Нов.Значение=СвойстваД.dateDownload;Нов.Наименование="Дата последней загрузки";
		Если ТекПроценка.Источник<>"FILE" Тогда
			Нов=ДанныеПроценки.Добавить();
			Нов.Ключ="dateLastCheck";Нов.Значение=СвойстваД.dateLastCheck;Нов.Наименование="Дата последнего опроса";
			Нов=ДанныеПроценки.Добавить();
			Нов.Ключ="validity";Нов.Значение=СвойстваД.validity;Нов.Наименование="Срок действия прайс-листа, час (до опроса)";
			Нов=ДанныеПроценки.Добавить();
			Нов.Ключ="period";Нов.Значение=СвойстваД.period;Нов.Наименование="Частота опроса, час";
		КонецЕсли;
		Элементы.ДанныеПроценки.ТолькоПросмотр=Истина;
		Помощь="";
		Методы="";
		Элементы.ДанныеПроценкиПрайс.Видимость=Истина;
		
	КонецЕсли;
		
	//Если ТекПроценка.Источник="API" Тогда
	//ИначеЕсли ТекПроценка.Источник="FILE" Тогда
	//	Помощь="";
	//ИначеЕсли ТекПроценка.Источник="EMAIL" Тогда
	//	Помощь="";
	//КонецЕсли;
	
	СкладыПроценки.Очистить();
	Для Каждого Стр Из ТекПроценка.Склады Цикл
		ЗаполнитьЗначенияСвойств(СкладыПроценки.Добавить(),Стр);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабПроценкиПослеУдаления(Элемент)
	ДанныеПроценкиИзменены=Ложь;
	ЗаписатьПроценкиНаСервере();
	ПроценкиИзменены=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТабПроценкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПроценкиИзменены=Истина;
КонецПроцедуры

&НаКлиенте
Процедура Таблица1ПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ДанныеПроценкиИзменены=Истина;
	ПроценкиИзменены=Истина;
КонецПроцедуры

&НаКлиенте
Процедура Проверка(Команда)
	// Записать последние изменения
	Если ТекПроценка=Неопределено Тогда Возврат;КонецЕсли; 
	Если ТекПроценка.Источник<>"API" Тогда 
		Ошибка=ПроверкаПрайс(ТекПроценка);	
		Если Ошибка="" Тогда
			ТекПроценка.Проверка=Истина;	
		Иначе
			Сообщить(Ошибка);
			ТекПроценка.Проверка=Ложь;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если ДанныеПроценкиИзменены=Истина Тогда
		//Изменение значений структуры данных
		СвойстваД=Новый Структура;
		Для Каждого Элем Из ДанныеПроценки Цикл
			СвойстваД.Вставить(Элем.Ключ,Элем.Значение);
		КонецЦикла;
		ТекПроценка.Авторизация = СвойстваД;
	КонецЕсли;
	ОтветОтПоставщика = "";
	Ошибки=ПроверкаНаСервере(Новый Структура("Сайт,Авторизация,Методы",ТекПроценка.Сайт,ТекПроценка.Авторизация,ТекПроценка.Методы), ОтветОтПоставщика);
	Если Ошибки="" Тогда 
		ТекПроценка.Проверка=Истина;
	Иначе
		Попытка
			ПоказатьПредупреждение(,"Ошибки при подключении: "+Ошибки); 
		Исключение
			Сообщить("Ошибки при подключении: "+Ошибки); 
		Конецпопытки;
		ТекПроценка.Проверка=Ложь;
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтветОтПоставщика) Тогда
		ТекПроценка.ОтПоставщика = ОтветОтПоставщика;
		Элементы.Группа31.ТекущаяСтраница = Элементы.СтраницаОтПоставщика;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверкаНаСервере(Стр, ОтветОтПоставщика)
	Возврат РеквизитФормыВЗначение("Объект").ПроверкаПодключенияСайта(Стр,ОтветОтПоставщика);
КонецФункции

&НаКлиенте
Процедура ПодключениеПриИзменении(Элемент)
	//Изменения.Вставить("СтрокаПодключенияКроссов",Объект.СтрокаПодключенияКроссов);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПроценкуОнлайнПоставщиковПриИзменении(Элемент)
	ЭтаФорма.ВладелецФормы.Объект.ИспользоватьПроценкуОнлайнПоставщиков=Объект.ИспользоватьПроценкуОнлайнПоставщиков;
	ЭтаФорма.ВладелецФормы.Элементы.ПоискЕмекс.Видимость=Объект.ИспользоватьПроценкуОнлайнПоставщиков;
	УстановитьТекущуюСтраницу();
КонецПроцедуры

&НаКлиенте
Процедура ШаблонНомераДляПоискаПриИзменении(Элемент)
	ЕСли ПустаяСтрока(Объект.ШаблонНомераДляПоиска) Тогда
		Объект.ШаблонНомераДляПоиска="&К";
		Сообщить("Поле ""ШаблонНомераДляПоиска"" очищать запрещено.");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РеквизитНомераДляПоискаПриИзменении(Элемент)
	Элементы.ШаблонНомераДляПоиска.Доступность=Объект.РеквизитНомераДляПоиска<>"";
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеПроизводителейИСинонимовНажатие(Команда)
	ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ОбработкаСинонимовУФ",,ЭтаФорма);
КонецПроцедуры

&НаСервере
Функция ФормированиеСпискаСохраненияНаСервере()
	Обработка=РеквизитФормыВЗначение("Объект");
	Возврат Обработка.ФормированиеСпискаСохранения();
КонецФункции

&НаКлиенте
Процедура СохранитьНастройкиВФайл(Команда)
	Список=ФормированиеСпискаСохраненияНаСервере();
	Оповещение=Новый ОписаниеОповещения("СохранениеНастройкиВыборФайла",ЭтаФорма);
	ПараметрыФормы=Новый Структура("СписокЗначений,Групповой,ТекущаяСтрока,Заголовок",
	Список,Истина,0,"Сохранить настройки");
	ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ФормаСпискаУФ",
	ПараметрыФормы,ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СохранениеНастройкиВыборФайла(Список,Доп) Экспорт
	Если Список=Неопределено тогда Возврат; КонецЕсли;
	//Список[0].Представление="Все (онлайн-поставищики заменяются)";
	Инд=Список.Количество()-1;
	Если Список[0].Пометка Тогда 
		Список.Удалить(Инд);	// проценки отмеченные удаляем
	Иначе
		//Если отмечены проценки все - проценки отмеченные удаляем
		Если Список[Инд-1].Пометка Тогда 
			Список.Удалить(Инд);
			Инд=Инд-1;
		КонецЕсли;
		//Удаляем не отмеченные позиции сохранения
		Пока Инд>0 Цикл
			Если Не Список[Инд].Пометка Тогда Список.Удалить(Инд);КонецЕсли;
			Инд=Инд-1;
		КонецЦикла;
		Если Список.Количество()<2 Тогда Возврат;КонецЕсли;	//Не отмечена ни одна позиция
	КонецЕсли;
	Список.ЗаполнитьПометки(Ложь);
	
	Оповещение=Новый ОписаниеОповещения("СохранениеНастроекВФайл",ЭтаФорма,Список);
	Диалог = Новый ДиалогВыбораФайла (РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Фильтр = "Файлы настроек отчетов *.rep1c|*.rep1c";
	Диалог.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура СохранениеНастроекВФайл(Файлы,Список) Экспорт
	Если Файлы=Неопределено Тогда Возврат;КонецЕсли;
	ТекстовыйФайл=СохранениеНастроекНаСервере(Список);
	Если ТекстовыйФайл = Неопределено Тогда
		Сообщить("Нет данных для сохранения");
	Иначе
		Попытка
		    ТекстовыйФайл.Записать(Файлы[0]);
		Исключение
	    	Сообщить("Ошибка при сохранении файла настроек: " + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция СохранениеНастроекНаСервере(Список)
	ИндексПроценки=0;
	Инд=Список.Количество()-1;
	Пока Инд>0 Цикл
		Стр=Список[Инд];
		Если ТипЗнч(Стр.Значение)=Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(Стр.Значение,Объект);
			Стр.Значение=ЗначениеВСтрокуВнутр(Стр.Значение);
		ИначеЕсли Стр.Представление="Онлайн-поставщиков отмеченных" И ИндексПроценки>0 Тогда
			Список.Удалить(Стр);
		ИначеЕсли Стр.Значение="ПриходСтруктура" Тогда
			Попытка
				Отбор = Новый Структура("Пользователь, КлючОбъекта");
				Отбор.Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
				Отбор.КлючОбъекта = "ПомощникАвтобизнеса";
				Значение=Новый СписокЗначений;
				ВыборкаХранилища = ХранилищеОбщихНастроек.Выбрать(Отбор);
				Пока ВыборкаХранилища.Следующий() Цикл
					Если Найти(ВыборкаХранилища.КлючНастроек, "ПриходСтруктура_") > 0 Тогда
					   Значение.Добавить(ВыборкаХранилища.Настройки,ВыборкаХранилища.КлючНастроек);
				    КонецЕсли;
				КонецЦикла;
				Если Значение.Количество()>0 Тогда
					Стр.Значение=ЗначениеВСтрокуВнутр(Значение);
				Иначе
					Список.Удалить(Стр);
				КонецЕсли;
		    Исключение
		        Список.Удалить(Стр);
			КонецПопытки;
		ИначеЕсли Лев(Стр.Представление,18)= "Онлайн-поставщиков" Тогда
			Значение=ТабПроценки.Выгрузить();
			Если Значение.Количество()=0 Тогда 
				Список.Удалить(Стр); 
			ИначеЕсли Стр.Представление="Онлайн-поставщиков всех" Тогда
				ИндексПроценки=Инд;
				Стр.Представление="Онлайн-поставщиков заменить";
				Стр.Значение=ЗначениеВСтрокуВнутр(Значение);
			ИначеЕсли Стр.Представление="Онлайн-поставщиков отмеченных" Тогда
				Вкл=0;
				ИндПроц=Значение.Количество()-1;
				Пока ИндПроц >= 0 Цикл
					Проц=Значение[ИндПроц];
					Если Не Проц.Вкл Тогда 
						Значение.Удалить(Проц);
					Иначе
						Вкл=Вкл+1;
					КонецЕсли;
					ИндПроц=ИндПроц-1;
				КонецЦикла;
				Если Вкл=0 Тогда 
					Список.Удалить(Стр);
				Иначе
					Стр.Значение=ЗначениеВСтрокуВнутр(Значение);
					ИндексПроценки=Инд;
					Стр.Представление="Онлайн-поставщиков заменить";
				КонецЕсли;
			КонецЕсли;
		Иначе
			Стр.Значение=ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса",Стр.Значение,,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
			Если Стр.Значение=Неопределено или ?(ТипЗнч(Стр.Значение)=Тип("ДеревоЗначений"),Ложь,Стр.Значение.Количество()=0) Тогда 
				Список.Удалить(Стр);
			Иначе		
				Стр.Значение=ЗначениеВСтрокуВнутр(Стр.Значение);
			КонецЕсли;
		КонецЕсли;
		Инд=Инд-1;
	КонецЦикла;
	Если Список.Количество()<2 Тогда
		Сообщить("Нет данных для сохранения");
		Возврат Неопределено;
	ИначеЕсли Список.Количество()=2 Тогда
		Список.Удалить(Список[0]);
	ИначеЕсли ИндексПроценки>0 Тогда
		Список[0].Представление="Все (онлайн-поставищики заменяются)";
	КонецЕсли;
	Если ИндексПроценки>0 Тогда Список.Добавить(ИндексПроценки, "Онлайн-поставщиков добавить"); КонецЕсли;
	ТекстовыйФайл = Новый ТекстовыйДокумент;
	ТекстовыйФайл.УстановитьТекст(ЗначениеВСтрокуВнутр(Список));
	Список.Очистить();  // Чтобы не передавались на клиент данные из списка
	Возврат ТекстовыйФайл;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайла(Команда)
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьНастройкиВыборИзФайла",ЭтаФорма);
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    Диалог.Фильтр = "Файлы настроек отчетов *.rep1c|*.rep1c";
    Диалог.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиВыборИзФайла(Файлы,Доп) Экспорт
	Если Файлы=Неопределено Тогда Возврат;КонецЕсли;
    ТекстовыйФайл = Новый ТекстовыйДокумент;
	ОО=Новый ОписаниеОповещения("ЗагрузитьНастройкиИзФайлаЧтение",ЭтаФорма,
	Новый Структура("ТекстовыйФайл,ПользователиПА",ТекстовыйФайл,Доп));
    ТекстовыйФайл.НачатьЧтение(ОО,Файлы[0]);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайлаЧтение(Данные) Экспорт
	Доп=Неопределено;
	Список=ЗагрузитьНастройкиИзФайлаНаСервере(Данные.ТекстовыйФайл.ПолучитьТекст(),Доп);
	Если Список=Неопределено Тогда
		//Загрузили Настройки в старом формате
		Если Доп=Неопределено Тогда
			ЭтаФорма.Закрыть();
		КонецЕсли;
	Иначе
		Оповещение=Новый ОписаниеОповещения("ЗагрузитьИзФайлаВосстановить",ЭтаФорма, Данные.ПользователиПА);
		ПараметрыФормы=Новый Структура("СписокЗначений,Групповой,ТекущаяСтрока,Заголовок",
		Список,Истина,0,"Загрузить настройки");
		ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ФормаСпискаУФ",
		ПараметрыФормы,ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаВосстановить(Список,ПользователиПА) Экспорт
	Если Список=Неопределено Тогда Возврат;
	ИначеЕСли ПользователиПА<>Неопределено Тогда
		ДоступЗагрузкаНастроекИзФайлаНаСервере(Список,ПользователиПА);
		Возврат;
	КонецЕсли;
	Обновить=ЗагрузкаНастроекИзФайлаНаСервере(Список);
	Если Обновить.Свойство("ЕстьСкрытые") ТОгда
		Страницы=ЭтаФорма.ВладелецФормы.Элементы;
		ВОбъект=ЭтаФорма.ВладелецФормы.Объект;
		
		ВОбъект.ИспользоватьБазуКроссов=Объект.ИспользоватьБазуКроссов;
		Страницы.СтраницаПоискПоАртикулу.Видимость=Объект.ИспользоватьБазуКроссов;
		
		ВОбъект.ИспользоватьПрайсЛист=Объект.ИспользоватьПрайсЛист;
		Страницы.СтраницаПоискПоПрайсу.Видимость=Объект.ИспользоватьПрайсЛист;
		
		ВОбъект.ИспользоватьПроценкуОнлайнПоставщиков=Объект.ИспользоватьПроценкуОнлайнПоставщиков;
		Страницы.ПоискЕмекс.Видимость=Объект.ИспользоватьПроценкуОнлайнПоставщиков;
		
		ВОбъект.ИспользоватьПоискПоАвтомобилю=Объект.ИспользоватьПоискПоАвтомобилю;
		Страницы.Стр3.Видимость=Объект.ИспользоватьПоискПоАвтомобилю;
		
		ВОбъект.ИспользоватьЗаказПоставщику=Объект.ИспользоватьЗаказПоставщику;
		Страницы.Группа10.Видимость=Объект.ИспользоватьЗаказПоставщику;

		УстановитьТекущуюСтраницу();
		ОбновитьВидимостьПодсказок();
	ИначеЕсли Обновить.Свойство("УровниЦен") ТОгда
		Мас=Обновить.УровниЦен;
		Рекв=ЭтаФорма.ВладелецФормы;
		Рекв.Элементы.УровеньЦен.СписокВыбора.ЗагрузитьЗначения(Мас);
		Рекв.Элементы.УровеньЦенЕмекс.СписокВыбора.ЗагрузитьЗначения(Мас);
		Если Мас.Найти(Рекв.Объект.УровеньЦен)=Неопределено Тогда Рекв.Объект.УровеньЦен="Закупочная";КонецЕсли;
		Если Мас.Найти(Рекв.Объект.УровеньЦенЕмекс)=Неопределено Тогда Рекв.Объект.УровеньЦенЕмекс="Закупочная";КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ЗагрузитьНастройкиИзФайлаНаСервере(ТекстовыйФайл,Доп)
	Список=ЗначениеИзСтрокиВнутр(ТекстовыйФайл);
	Если ТипЗнч(Список)=Тип("СписокЗначений") Тогда
		Возврат Список;
	ИначеЕсли Доп=Неопределено Тогда
		Обработка=РеквизитФормыВЗначение("Объект");
		Обработка.ЗагрузитьНастройкиИзФайлаБыл(Список);
		Данные = Новый Структура(
		"АналогиЕстьВ1С,АртикулОчищать,БанковскийСчетДляЗаявки,БезАналогов,БезПрименяемости,ВидНоменклатуры,
	    |ВКорзину,ВыбиратьГруппу,ВыводитьАналоги,ВыводитьНаличие,Группировать,ЗаказПокупателя,ЗаписьШтрихкода,
	    |ЗапрашиватьКоличество,ЗапрашиватьСкидку,ЗапрашиватьЦену,ИспользоватьПроценкуОнлайнПоставщиков,
	    |ИспользоватьЦены,КассаККМ,КонтрольОстатков,НДСПоУмолчанию,ОбщийПоиск,ОрганизацияДляЗаявки,
		|ОтборПроизводители,ПутьКВременнойПапке,РеализацияТоваров,Склад,СортироватьТолькоПоЦенам,ПроводитьДокументы,
		|СчетФактура,ТипЦен,ЦеноваяГруппа,ШаблонНаименования,ШаблонНаименованияП,ШаблонНомераДляПоиска,
		|РеквизитНомераДляПоиска,ИспользоватьСинонимы,ЗапрашиватьГруппуНоменклатуры,ПоискПоОчищенному,ГруппаНоменклатуры,
		|ПоказатьЗамерПроизводительностиПоиска,БазоваяЕдиницаИзмерения, ТипЦенЗакупка, ИспользоватьБазуКроссов, 
		|ИспользоватьПрайсЛист, ИспользоватьПоискПоАвтомобилю,
		|ОтключитьПодсказкиВидеоИнструкций,ИспользоватьЗаказПоставщику,СортировкаОнлайнПоставщики, СортировкаОнлайнПоставщикиНаправление,
		|ЗаполнятьЗаказПриДобавленииВОнлайнКорзину,ЗапретитьРедактированиеЦенВКорзине,ИспользоватьСжатиеДанных,ЗаказВКомментарий,СборАналитики");
			
		ЗаполнитьЗначенияСвойств(Данные,ЗначениеИзСтрокиВнутр(ТекстовыйФайл.ПолучитьТекст()));
		ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса","ОбъектMySQL",Данные,,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
		Возврат Неопределено;
	Иначе
		Сообщить("Старый формат данных сохранения.Для загрузки настроек другим пользователям сохраняйте данные в новом формате.");
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ЗагрузкаНастроекИзФайлаНаСервере(Список)
	Имена=Новый СписокЗначений;
	Имена.Добавить("Уровней цен","УровниЦен");
	Имена.Добавить("Прайс-листов","НастройкаЗагрузки");
	Имена.Добавить("Синонимы","Синонимы");
	Имена.Добавить("Онлайн-поставщиков заменить","Проценки",);	
	ЕстьПроценки=Ложь;
	ЕстьОбщие=Ложь;
	Обновить=Новый Структура;
	Для Каждого Стр из Список Цикл
		Если Не Стр.Пометка Тогда Продолжить;
		ИначеЕсли Стр.Представление="Все (онлайн-поставищики заменяются)" или Стр.Представление="Все" Тогда 
			Список.ЗаполнитьПометки(Истина);
			Продолжить;
		ИначеЕСли Стр.Представление="Онлайн-поставщиков добавить" И ЕстьПроценки Тогда
			Продолжить;
		КонецЕсли;
		ЕСли ТипЗнч(Стр.Значение)=Тип("Число") Тогда
			Значение=ЗначениеИзСтрокиВнутр(Список[Список.Индекс(Стр)-1].Значение);
		Иначе
			Значение=ЗначениеИзСтрокиВнутр(Стр.Значение);
		КонецЕсли;
		СтрТип=ТипЗнч(Значение);
		
		Если СтрТип = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(Объект,Значение);
			ЕстьОбщие=Истина;
			Если Стр.Представление="Скрытых элементов" Тогда 
				Обновить.Вставить("ЕстьСкрытые",Истина); 
			КонецЕсли; 
		ИначеЕсли СтрТип = Тип("СписокЗначений") Тогда
			Для Каждого Эл из Значение Цикл
				ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса",Эл.Представление,Эл.Значение,,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
			КонецЦикла;	
		ИначеЕсли Лев(Стр.Представление,18)="Онлайн-поставщиков" Тогда
			Если ЕстьПроценки Тогда Продолжить;КонецЕсли;
			ЕстьПроценки=Истина;
			Если Стр.Представление="Онлайн-поставщиков заменить" Тогда
				ТабПроценки.Очистить();
			КонецЕсли;
			СкладыВТаблицу(Значение); 
			Для каждого эл из Значение Цикл
				Нов=ТабПроценки.Добавить();
				ЗаполнитьЗначенияСвойств(Нов,эл,,"Склады");
				Если ПустаяСтрока(Нов.Источник) Тогда Нов.Источник="API";КонецЕсли;
				Нов.Склады.Загрузить(Эл.Склады);
			КонецЦикла;
			ЗаписатьПроценкиНаСервере();
			//ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса","Проценки",ТабПроценки.Выгрузить(),,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
		ИначеЕсли СтрТип = Тип("ТаблицаЗначений") Тогда
			Имя=Имена.НайтиПоЗначению(Стр.Представление);
			ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса",Имя.Представление,Значение,,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
			Если Имя.Представление="УровниЦен" Тогда
				Обработка=РеквизитФормыВЗначение("Объект");
				Мас=Обработка.ВыгрузитьУровниЦен();
				Обновить.Вставить("УровниЦен",Мас);
			КонецЕсли;
		ИначеЕсли СтрТип = Тип("ДеревоЗначений") Тогда
			Имя=Имена.НайтиПоЗначению(Стр.Представление);
			ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса",Имя.Представление,Значение,,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
			Обработка=РеквизитФормыВЗначение("Объект");
			Мас=Обработка.ВыгрузитьУровниЦен();
			Обновить.Вставить("УровниЦен",Мас);
		КонецЕсли;
	КонецЦикла;
	Если ЕстьОбщие Тогда
		Обработка = РеквизитФормыВЗначение("Объект");
		Обработка.СохранитьНастройкиВХранилище("ОсновныеНастройки");
	КонецЕсли;
	Возврат Обновить;
КонецФункции

&НаКлиенте
Процедура ВыбратьПроценки(Команда)
	Если ДанныеПроценкиИзменены Тогда
		ТабПроценкиПриАктивизацииСтроки(Неопределено);
	КонецЕсли;
	ПараметрыФормы=Новый Структура("ТабПроценки", ТабПроценки);
	Оповещение=Новый ОписаниеОповещения("ВыборПроценокНаКлиенте",ЭтаФорма);
	ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ФормаЗагрузкиПроценокУФ",ПараметрыФормы,ЭтаФорма,,,,Оповещение);
	
	ТабПроценкиПриАктивизацииСтроки(Неопределено);
	ПроценкиИзменены=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыборПроценокНаКлиенте(Результат,Параметры) Экспорт
	ВыборПроценокНаСервере(Результат);
КонецПроцедуры	

&НаСервере
Процедура ВыборПроценокНаСервере(Результат)
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Для Каждого СтрокаВыбора Из Результат Цикл
		Если НЕ СтрокаВыбора.Загружать Тогда
			Продолжить;
		КонецЕсли;
		
		//Проверим на уже добавленную такуж же проценку
		НомерПроценки = 0;
		СтрНомерПроценки = "";
		Пока ТабПроценки.НайтиСтроки(Новый Структура("НаименованиеСайт", СтрокаВыбора.Сайт+СтрНомерПроценки)).Количество() > 0 Цикл
			НомерПроценки = НомерПроценки + 1;
			СтрНомерПроценки = " "+Строка(НомерПроценки);
		КонецЦикла;
		
		ТСтр=ТабПроценки.Добавить();
		ТСтр.Сайт=СтрокаВыбора.Сайт;
		ТСтр.Источник="API";
		ТСтр.НаименованиеСайт=СтрокаВыбора.Сайт+СтрНомерПроценки;
		ТСтр.Вкл = Ложь;
		Стр=СтрокаВыбора.Данные;
		ТСтр.Помощь=Стр.Помощь;
		ТСтр.Авторизация=Новый Структура();
		Для Каждого Эл Из Стр.Авторизация Цикл
			Если Не ТСтр.Авторизация.Свойство(Эл.Ключ) Тогда
				ТСтр.Авторизация.Вставить(Эл.Ключ,Эл.Значение);
			КонецЕсли;
		КонецЦикла;
		ТСтр.Фильтры=Новый Структура();
		Для Каждого Эл Из Стр.Фильтры Цикл
			Если Не ТСтр.Фильтры.Свойство(Эл.Ключ) Тогда
				ТСтр.Фильтры.Вставить(Эл.Ключ,Эл.Значение);
			КонецЕсли;
		КонецЦикла;
		ТСтр.Методы=Новый Структура();
		Для Каждого Эл Из Стр.Методы Цикл
			Если Не ТСтр.Методы.Свойство(Эл.Ключ) Тогда
				ТСтр.Методы.Вставить(Эл.Ключ,Эл.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Процедура ОПрограмме(Команда)
	Попытка
		ОткрытьФормуМодально(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ОПрограммеУФ", , ЭтаФорма);
	Исключение
		ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ОПрограммеУФ", , ЭтаФорма);
	Конецпопытки;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ВладелецФормы.ФормыПАУдалить("НастройкиУФ");
	Оповестить("ОбновитьТЗ");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущуюСтраницу()
	
    Если ЭтаФорма.ВладелецФормы.Элементы.СтраницаПоискПоАртикулу.Видимость = Истина Тогда
	   ЭтаФорма.ВладелецФормы.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.ВладелецФормы.Элементы.СтраницаПоискПоАртикулу;
	ИначеЕсли ЭтаФорма.ВладелецФормы.Элементы.СтраницаПоискПоПрайсу.Видимость = Истина Тогда
	   ЭтаФорма.ВладелецФормы.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.ВладелецФормы.Элементы.СтраницаПоискПоПрайсу;
	ИначеЕсли ЭтаФорма.ВладелецФормы.Элементы.ПоискЕмекс.Видимость = Истина Тогда
	   ЭтаФорма.ВладелецФормы.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.ВладелецФормы.Элементы.ПоискЕмекс;	   
	ИначеЕсли ЭтаФорма.ВладелецФормы.Элементы.Стр3.Видимость = Истина Тогда
	   ЭтаФорма.ВладелецФормы.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.ВладелецФормы.Элементы.Стр3;
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьБазуКроссовПриИзменении(Элемент)
	ЭтаФорма.ВладелецФормы.Объект.ИспользоватьБазуКроссов=Объект.ИспользоватьБазуКроссов;
	ЭтаФорма.ВладелецФормы.Элементы.СтраницаПоискПоАртикулу.Видимость=Объект.ИспользоватьБазуКроссов;
	УстановитьТекущуюСтраницу();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПрайсЛистПриИзменении(Элемент)
	ЭтаФорма.ВладелецФормы.Объект.ИспользоватьПрайсЛист=Объект.ИспользоватьПрайсЛист;
	ЭтаФорма.ВладелецФормы.Элементы.СтраницаПоискПоПрайсу.Видимость=Объект.ИспользоватьПрайсЛист;
	УстановитьТекущуюСтраницу();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПоискПоАвтомобилюПриИзменении(Элемент)
	ЭтаФорма.ВладелецФормы.Объект.ИспользоватьПоискПоАвтомобилю=Объект.ИспользоватьПоискПоАвтомобилю;
	ЭтаФорма.ВладелецФормы.Элементы.Стр3.Видимость=Объект.ИспользоватьПоискПоАвтомобилю;
	УстановитьТекущуюСтраницу();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЗаказПоставщикуПриИзменении(Элемент)     
	ЭтаФорма.ВладелецФормы.Объект.ИспользоватьЗаказПоставщику=Объект.ИспользоватьЗаказПоставщику;
	ЭтаФорма.ВладелецФормы.Элементы.Группа10.Видимость=Объект.ИспользоватьЗаказПоставщику;
	УстановитьТекущуюСтраницу();
КонецПроцедуры

&НаКлиенте
Процедура КакНачатьРаботатьСПоставщикамиНажатие(Команда) 
	ЗапуститьПриложение("https://youtu.be/FxT76GXCV7A?utm_source=fromPA&utm_medium=cpc&utm_campaign=podkl_procenok");
КонецПроцедуры

&НаКлиенте
Процедура КакСкрыватьНенужныеКолонкиНажатие(Команда)  
	ЗапуститьПриложение("https://youtu.be/ufnum3z4fok?utm_source=fromPA&utm_medium=cpc&utm_campaign=vidimost_elementov");	
КонецПроцедуры

&НаКлиенте
Процедура ВидеоИнструкцииНажатие(Команда)
	ЗапуститьПриложение("https://www.youtube.com/watch?v=d-3Apu9lZWA&list=PLIoIhXiFXpXabO3wIzNjBQrKbxx71Ihhq&utm_source=fromPA&utm_medium=cpc&utm_campaign=instruction");	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьПодсказкиВидеоИнструкцийПриИзменении(Элемент)
	ОбновитьВидимостьПодсказок();  //Глухов 290618	
КонецПроцедуры

&НаКлиенте
Процедура КакВстроитьВПродукт(Команда) 
	ЗапуститьПриложение("https://youtu.be/xq2q1kLOvqU?utm_source=fromPA&utm_medium=cpc&utm_campaign=instruction");		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьПодсказок()
	Если Объект.ОтключитьПодсказкиВидеоИнструкций Тогда   
		ЭтаФорма.Элементы.КакВстроитьВПродукт.Видимость=Ложь;
		ЭтаФорма.Элементы.КакНачатьРаботатьСПоставщиками.Видимость=Ложь;
		ЭтаФорма.Элементы.КакСкрыватьНенужныеКолонки.Видимость=Ложь;
	Иначе
		ЭтаФорма.Элементы.КакВстроитьВПродукт.Видимость=Истина;
		ЭтаФорма.Элементы.КакНачатьРаботатьСПоставщиками.Видимость=Истина;
		ЭтаФорма.Элементы.КакСкрыватьНенужныеКолонки.Видимость=Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Функция ОпределитьЦветДляЗаголовка(Элемент)
	Если (Элемент-ТекущаяДата())<=20*86400 Тогда
		ЦветДляЗаголовка = Новый Цвет(255,0,0);
	Иначе
		ЦветДляЗаголовка = Новый Цвет(0,128,0);
	КонецЕсли;
	Возврат ЦветДляЗаголовка;
КонецФункции

&НаКлиенте
Процедура ОбновитьЛичныйКабинет()
	Если ЗначениеЗаполнено(Объект.СрокПодпискиТП) Тогда   //выкуплен ПА
		ЭтаФорма.Элементы.ЗначениеСрокПодпискиПА.Заголовок = "Выкуплен";
		ЭтаФорма.Элементы.ЗначениеСрокПодпискиПА.ЦветТекста = Новый Цвет(0,128,0); 
		
		ЭтаФорма.Элементы.ЗначениеСрокПодпискиТП.Заголовок = Формат(Объект.СрокПодпискиТП, "ДЛФ=ДД");
		ЭтаФорма.Элементы.ЗначениеСрокПодпискиТП.ЦветТекста = ОпределитьЦветДляЗаголовка(Объект.СрокПодпискиТП);
	ИначеЕсли ЗначениеЗаполнено(Объект.СрокПодпискиПА) Тогда  //аренда ПА
		ЭтаФорма.Элементы.ЗначениеСрокПодпискиПА.Заголовок = Формат(Объект.СрокПодпискиПА, "ДЛФ=ДД");
		ЭтаФорма.Элементы.ЗначениеСрокПодпискиПА.ЦветТекста = ОпределитьЦветДляЗаголовка(Объект.СрокПодпискиПА);
		
		ЭтаФорма.Элементы.ЗначениеСрокПодпискиТП.Заголовок = "Включена";
		ЭтаФорма.Элементы.ЗначениеСрокПодпискиТП.ЦветТекста = Новый Цвет(0,128,0);	
	ИначеЕсли Объект.ДемоРежим Тогда //режим Демо
		ЭтаФорма.Элементы.ЗначениеСрокПодпискиПА.Заголовок = "Демо";
		ЭтаФорма.Элементы.ЗначениеСрокПодпискиПА.ЦветТекста = Новый Цвет(0,0,0); 
		ЭтаФорма.Элементы.ЗначениеСрокПодпискиТП.Заголовок = "Не подключена";
		ЭтаФорма.Элементы.ЗначениеСрокПодпискиТП.ЦветТекста = Новый Цвет(0,0,0); 		
	Иначе //купили только ПА 
		ЭтаФорма.Элементы.ЗначениеСрокПодпискиПА.Заголовок = "Выкуплен";
		ЭтаФорма.Элементы.ЗначениеСрокПодпискиПА.ЦветТекста = Новый Цвет(0,128,0); 
		ЭтаФорма.Элементы.ЗначениеСрокПодпискиТП.Заголовок = "Не подключена";
		ЭтаФорма.Элементы.ЗначениеСрокПодпискиТП.ЦветТекста = Новый Цвет(0,0,0); 		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СрокПодпискиБК) Тогда   //аренда БК
		ЭтаФорма.Элементы.ЗначениеСрокПодпискиБК.Заголовок = Формат(Объект.СрокПодпискиБК, "ДЛФ=ДД");
		ЭтаФорма.Элементы.ЗначениеСрокПодпискиБК.ЦветТекста = ОпределитьЦветДляЗаголовка(Объект.СрокПодпискиБК);
	Иначе
		ЭтаФорма.Элементы.ЗначениеСрокПодпискиБК.Заголовок = "Не подключена";
	КонецЕсли;	
	
	ОбновитьЛичныйКабинетНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЛичныйКабинетНаСервере()
	Обработка=РеквизитФормыВЗначение("Объект");	
	Рез = Обработка.ПолучитьДанныеПоТехПоддержке();
	Элементы.ЗначениеЗаявокВРаботе.Заголовок = Рез.КолЗаявок;
	Элементы.ЗначениеТребуетсяОтветить.Заголовок = Рез.КолОтветить;
	Если Рез.КолОтветить>0 Тогда
		Элементы.ЗначениеТребуетсяОтветить.ЦветТекста = Новый Цвет(255,0,0);
	Иначе
		Элементы.ЗначениеТребуетсяОтветить.ЦветТекста = Новый Цвет(0,0,0);
	КонецЕсли;

	Элементы.IPКлиента.Заголовок = Обработка.ПолучитьIPКлиента();	

Конецпроцедуры

&НаКлиенте
Процедура ВыделитьВсеПроценки(ПометкаЗначение)	
	Для Каждого Стр Из ТабПроценки Цикл
		Инд=Стр.ПолучитьИдентификатор();
		Если Элементы.Проценки.ПроверитьСтроку(Инд)=Истина Тогда
			Стр.Вкл = ПометкаЗначение;
		КонецЕсли;
	КонецЦикла;                                	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьВсеПроценки(Команда)	
	ВыделитьВсеПроценки(Истина);	
	ПроценкиИзменены=Истина;          		
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометкуВсеПроценки(Команда)	
	ВыделитьВсеПроценки(Ложь);  	
	ПроценкиИзменены=Истина;              		
КонецПроцедуры                            

#Область ТехПоддержка

&НаСервере
Процедура ОбновитьСписокВидовЗаявок()
	Обработка=РеквизитФормыВЗначение("Объект");
	
	Элементы.ВидЗаявки.СписокВыбора.Очистить();
	Элементы.Фильтр_ВидыЗаявок.СписокВыбора.Очистить();
	ТЗ_ВидыЗаявок = Обработка.ПолучитьСписокВидовЗаявок();
	Для каждого Запись ИЗ ТЗ_ВидыЗаявок Цикл
		Элементы.ВидЗаявки.СписокВыбора.Добавить(Запись.idtask_types,Запись.name);
		Элементы.Фильтр_ВидыЗаявок.СписокВыбора.Добавить(Запись.idtask_types,Запись.name);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокСтатусов()
	Обработка=РеквизитФормыВЗначение("Объект");
	
	Элементы.Фильтр_СтатусыЗаявок.СписокВыбора.Очистить();
	ТЗ_Статусы = Обработка.ПолучитьСписокСтатусовЗаявок();
	Для каждого Запись ИЗ ТЗ_Статусы Цикл
		Элементы.Фильтр_СтатусыЗаявок.СписокВыбора.Добавить(Запись.idtask_statuses,Запись.name);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокЗаявокНаКлиенте()
	ОбновитьСписокЗаявок();
	Если Элементы.МоиЗаявки.ТекущиеДанные <> Неопределено Тогда
		ПолучитьКомментарииИУстановитьНаПослений(Элементы.МоиЗаявки.ТекущиеДанные.Номер);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокЗаявок()
	Обработка=РеквизитФормыВЗначение("Объект");
	
	Объект.МоиЗаявки.Очистить();
	ТЗ = Обработка.ПолучитьСписокЗаявок();
	Если ТЗ <> Неопределено Тогда
		Для каждого Запись из ТЗ Цикл
			Эл = Объект.МоиЗаявки.Добавить();
			Эл.Номер = Запись.idTasks;
			Эл.Статус = Элементы.Фильтр_СтатусыЗаявок.СписокВыбора.НайтиПоЗначению(Запись.status);
			//Эл.Статус = Элементы.Фильтр_СтатусыЗаявок.СписокВыбора.Получить(Число(Запись.status)-1);
			Эл.Вид = Элементы.Фильтр_ВидыЗаявок.СписокВыбора.Получить(Число(Запись.type)-1);
			Эл.Наименование = Запись.name;
			Эл.Описание = Запись.description;
			Эл.Дата = Дата(СтрЗаменить(СтрЗаменить(СтрЗаменить(Запись.date,"-",""),":","")," ",""));
			Эл.idСтатус = Число(Запись.status);
		КонецЦикла;
		Объект.МоиЗаявки.Сортировать("Дата Убыв, Номер Убыв");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокСтатей()
	Обработка=РеквизитФормыВЗначение("Объект");
	
	Объект.ОбучающиеСтатьи.Очистить();
	ТЗ = Обработка.ПолучитьСписокСтатей();
	Если ТЗ <> Неопределено Тогда
		Для каждого Запись из ТЗ Цикл
			Эл = Объект.ОбучающиеСтатьи.Добавить();
			Эл.Номер = Запись.idArticle;
			Эл.Описание = Запись.description;
			Эл.VK = Запись.vk;
			Эл.Youtube = Запись.youtube;
		КонецЦикла;
		Объект.ОбучающиеСтатьи.Сортировать("Номер");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Группа21ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если Элемент.ТекущаяСтраница.Имя = "ТехПоддержка" Тогда
		ОбновитьСписокВидовЗаявок();
		ОбновитьСписокСтатусов();
		ОбновитьСписокЗаявок();
	ИначеЕсли Элемент.ТекущаяСтраница.Имя = "ЛичныйКабинет" Тогда
		ОбновитьЛичныйКабинет();
	ИначеЕсли Элемент.ТекущаяСтраница.Имя = "Администрирование" и Доступы.Количество()=0 Тогда
		ЗаполнитьДоступы();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Фильтр_СтатусыЗаявокПриИзменении(Элемент)
	Если Элемент.ВыделенныйТекст = Неопределено ИЛИ Элемент.ВыделенныйТекст = "" Тогда
		Элементы.МоиЗаявки.ОтборСтрок = Новый ФиксированнаяСтруктура();
	Иначе
		Элементы.МоиЗаявки.ОтборСтрок = Новый ФиксированнаяСтруктура("Статус",Элемент.ВыделенныйТекст);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Фильтр_ВидыЗаявокПриИзменении(Элемент)
	Если Элемент.ВыделенныйТекст = Неопределено ИЛИ Элемент.ВыделенныйТекст = "" Тогда
		Элементы.МоиЗаявки.ОтборСтрок = Новый ФиксированнаяСтруктура();
	Иначе
		Элементы.МоиЗаявки.ОтборСтрок = Новый ФиксированнаяСтруктура("Вид",Элемент.ВыделенныйТекст);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МоиЗаявкиПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		МоиЗаявки_ОписаниеЗаявки = Элемент.ТекущиеДанные.Описание;
		ПолучитьКомментарииИУстановитьНаПослений(Элемент.ТекущиеДанные.Номер);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКомментарииИУстановитьНаПослений(НомерЗаявки)
	ПолучитьКомментарииПоЗаявкеНаСервере(НомерЗаявки);
	Если Объект.МоиЗаявкиКомментарии.Количество() > 0 Тогда
		Элементы.МоиЗаявкиКомментарии.ТекущаяСтрока = Объект.МоиЗаявкиКомментарии[Объект.МоиЗаявкиКомментарии.Количество()-1].ПолучитьИдентификатор();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьКомментарииПоЗаявкеНаСервере(Элемент)
	Обработка=РеквизитФормыВЗначение("Объект");	
	Обработка.ПолучитьКомментарииПоЗаявке(Элемент);
	ЗначениеВРеквизитФормы(Обработка, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКомментарий(Команда)
	Если (Элементы.МоиЗаявки.ТекущиеДанные.idСтатус = 4) или (Элементы.МоиЗаявки.ТекущиеДанные.idСтатус = 5) Тогда
		Сообщить("В закрытую заявку добавлять комментарии запрещено. Необходимо создать новую заявку в тех.поддержку");
		Возврат;
	КонецЕсли;
	
	Оповещение=Новый ОписаниеОповещения("ОбработкаРасшифровкиДобавленияКомментария",ЭтаФорма);
	ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ДобавлениеКомментарияУФ",,ЭтаФорма,,,,Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРасшифровкиДобавленияКомментария(Комментарий, ПараметрДляОповещения) Экспорт
	Если Комментарий=Неопределено Тогда Возврат; КонецЕсли;
	Если ЗначениеЗаполнено(Комментарий) Тогда
		КомментарийПоЗаявке = Новый Структура("НомерЗаявки,Комментарий",
			Элементы.МоиЗаявки.ТекущиеДанные.Номер,Комментарий);	
			
		ОтправитьКомментарийПоЗаявкеСервер(КомментарийПоЗаявке);
		
		//Если Элементы.МоиЗаявки.ТекущиеДанные.Статус = "Есть ответ" Тогда 
			ИзменитьСтатусЗаявкиНаСервере(Элементы.МоиЗаявки.ТекущиеДанные.Номер, 2);
			Элементы.МоиЗаявки.ТекущиеДанные.Статус = Элементы.Фильтр_СтатусыЗаявок.СписокВыбора.Получить(1);
		//КонецЕсли;	
		
		ПолучитьКомментарииИУстановитьНаПослений(Элементы.МоиЗаявки.ТекущиеДанные.Номер);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтправитьКомментарийПоЗаявкеСервер(Элемент)
	Обработка=РеквизитФормыВЗначение("Объект");	
	Обработка.ОтправитьКомментарийПоЗаявкеНаСервер(Элемент);	
КонецПроцедуры

&НаСервере
Процедура ИзменитьСтатусЗаявкиНаСервере(НомерЗаявки, НомерСтатуса)
	Обработка=РеквизитФормыВЗначение("Объект");
	Обработка.ИзменитьСтатусЗаявки(НомерЗаявки, НомерСтатуса);	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗаявку(Команда)
	Заявка = Новый Структура("Наименование,ВидЗаявки,Описание",НазваниеЗаявки,Число(ВидЗаявки),ОписаниеЗаявки);
	Успешно = ОтправитьЗаявкуСервер(Заявка);
	Если Успешно = Истина Тогда
		НазваниеЗаявки = "";
		ОписаниеЗаявки = "";
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ОтправитьЗаявкуСервер(Заявка)
	Обработка=РеквизитФормыВЗначение("Объект");
	Успешно = Обработка.ОтправитьЗаявкуНаСервере(Заявка);
	Возврат Успешно;		
КонецФункции

&НаКлиенте
Процедура Группа_ТехПоддержкаПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если Элемент.ТекущаяСтраница.Имя = "Группа_МоиЗаявки" Тогда
		ОбновитьСписокЗаявок();
	ИначеЕсли Элемент.ТекущаяСтраница.Имя = "Группа_ОтправитьЗаявку" Тогда
		Если Не ЗначениеЗаполнено(ВидЗаявки) Тогда
			ВидЗаявки = Элементы.ВидЗаявки.СписокВыбора.Получить(0).Значение; 
		КонецЕсли;
	ИначеЕсли Элемент.ТекущаяСтраница.Имя = "Группа_ОбучающиеСтатьи" Тогда
		ОбновитьСписокСтатей();		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбучающиеСтатьиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если (Поле.Имя = "VK") или (Поле.Имя = "Youtube") Тогда
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные[Поле.Имя]) Тогда
			ЗапуститьПриложение("http://"+Элемент.ТекущиеДанные[Поле.Имя]);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапретитьРедактированиеЦенВКорзинеПриИзменении(Элемент)
	ЭтаФорма.ВладелецФормы.Элементы.ЗаявкаНаОформлениеЦена.Доступность = НЕ Объект.ЗапретитьРедактированиеЦенВКорзине;	
КонецПроцедуры

#КонецОбласти

#Область Доступы
&НаКлиенте
Процедура ДоступыАдминПриИзменении(Элемент)
	ТекДан=Элементы.Доступы.ТекущиеДанные;
	Если ТекДан.Админ Тогда
		ТекДан.Основные=Истина;
		ТекДан.БезОграничений=Истина;
		ТекДан.Поставщики=Истина;
	ИначеЕсли ТекДан.Имя=Объект.ПользовательИмя Тогда
		ТекДан.Админ=Истина;
	КонецЕсли;
	ТекДан.ДоступИзменен=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДоступыОсновныеПриИзменении(Элемент)
	ТекДан=Элементы.Доступы.ТекущиеДанные;
	Если НЕ ТекДан.Основные Тогда
		ТекДан.БезОграничений=Ложь;
	КонецЕсли;
	ТекДан.ДоступИзменен=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДоступыБезОграниченийПриИзменении(Элемент)
	ТекДан=Элементы.Доступы.ТекущиеДанные;
	Если ТекДан.БезОграничений Тогда
		ТекДан.Основные=Истина;
	КонецЕсли;
	ТекДан.ДоступИзменен=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДоступыПриИзменении(Элемент)
	ТекДан=Элементы.Доступы.ТекущиеДанные;
	ТекДан.ДоступИзменен=Истина;
КонецПроцедуры

&НаСервере
Функция ПолучитьДоступНаСервере()
	Доступ = ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","Доступ",,Объект.ПользовательИмя);
	Если ТипЗнч(Доступ) = Тип("Структура") Тогда 
		Если Не Доступ.Свойство("Аналитика") Тогда Доступ.Вставить("Аналитика",Истина);КонецЕсли;
		Возврат Доступ; 
	КонецЕсли;
	
	Отбор=Новый Структура("КлючОбъекта, КлючНастроек","ПомощникАвтобизнеса","Доступ");
	УстановитьПривилегированныйРежим(Истина);
	Выбор=ХранилищеОбщихНастроек.Выбрать(Отбор);
	Если Выбор.Следующий() Тогда
		Доступ=Новый Структура("Имя,Админ,Основные,БезОграничений,Поставщики,Аналитика,Комментарий",
		Объект.ПользовательИмя,Ложь,Ложь,Ложь,Ложь,Ложь,"");
	Иначе
		Доступ=Новый Структура("Имя,Админ,Основные,БезОграничений,Поставщики,Аналитика,Комментарий",
		Объект.ПользовательИмя,Истина,Истина,Истина,Истина,Истина,"");
	КонецЕсли;
	ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса","Доступ",Доступ,,Объект.ПользовательИмя);
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Доступ;
	
	//Отбор=Новый Структура("КлючОбъекта, КлючНастроек","ПомощникАвтобизнеса","ЗаказыКлиентов");
	//Выбор=ХранилищеОбщихНастроек.Выбрать(Отбор);
	//Пока Выбор.Следующий() Цикл;
	//	Доступ.Имя=Выбор.Пользователь;
	//	ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса","Доступ",Доступ,,Выбор.Пользователь);
	//КонецЦикла;	
	//УстановитьПривилегированныйРежим(Ложь);
	//Доступ.Имя=Объект.ПользовательИмя;
	//Возврат Доступ;
КонецФункции

&НаСервере
Функция ПолучитьДоступыНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	Отбор=Новый Структура("КлючОбъекта, КлючНастроек","ПомощникАвтобизнеса","Доступ");
	Выбор=ХранилищеОбщихНастроек.Выбрать(Отбор);
    Массив=Новый Массив;
	Пока Выбор.Следующий() Цикл;
		ТекДоступ=ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","Доступ",,Выбор.Пользователь);
		ТекДоступ.Имя=Выбор.Пользователь;
		Если Не ТекДоступ.Свойство("Аналитика") Тогда ТекДоступ.Вставить("Аналитика",Истина);КонецЕсли;
		Массив.Добавить(ТекДоступ);
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Массив;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьДоступы()
	Массив=ПолучитьДоступыНаСервере();
	Для Каждого Стр Из массив Цикл
		ЗаполнитьЗначенияСвойств(Доступы.Добавить(),Стр)
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СохранитьДоступыНаСервере(Массив)
	УстановитьПривилегированныйРежим(Истина);
	Для Каждого Доступ из Массив Цикл;
		ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса","Доступ",Доступ,,Доступ.Имя);
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры	

&НаКлиенте
Процедура ДоступУстановитьВыбор(Команда)
	Для Каждого Стр Из Доступы Цикл
		Стр.Выбор=Истина;
	КонецЦикла
КонецПроцедуры

&НаКлиенте
Процедура ДоступСнятьВыбор(Команда)
	Для Каждого Стр Из Доступы Цикл
		Стр.Выбор=Ложь;
	КонецЦикла
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДоступУдалитьНаСервере(Имя)
	УстановитьПривилегированныйРежим(Истина);
	Отбор=Новый Структура("КлючОбъекта, Пользователь","ПомощникАвтобизнеса",Имя);
	Выбор=ХранилищеОбщихНастроек.Выбрать(Отбор);
	Список=Новый СписокЗначений;
	Пока Выбор.Следующий() Цикл
		ХранилищеОбщихНастроек.Удалить("ПомощникАвтобизнеса",Выбор.КлючНастроек,Выбор.Пользователь);
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ДоступУдалить(Команда)
	ТекДан = Элементы.Доступы.ТекущиеДанные;
	Если ТекДан<>Неопределено Тогда
		ОО=Новый ОписаниеОповещения("ДоступУдалитьОтвет",ЭтаФорма, ТекДан.Имя);
		ПоказатьВопрос(ОО,"Внимание!!! Все данные пользователя "+ТекДан.Имя+" будут удалены из помощника автобизнеса. Продолжить?",
		РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДоступУдалитьОтвет(Ответ, Имя) Экспорт
	Если Ответ<>КодВозвратаДиалога.Да Тогда Возврат;КонецЕсли;
	ДоступУдалитьНаСервере(Имя);
	Доступы.Удалить(Элементы.Доступы.ТекущиеДанные);	
КонецПроцедуры

&НаКлиенте
Процедура ДоступЗагрузитьНастройкиИзФайла(Команда)
	Отбор=Доступы.НайтиСтроки(Новый Структура("Выбор",Истина));
	Доп=Новый Массив;
	Если Отбор.Количество()=0 Тогда 
		ТекДан=Элементы.Доступы.ТекущиеДанные;
		Если ТекДан=Неопределено Тогда Возврат;
		ИначеЕсли ТекДан.Имя=Объект.ПользовательИмя Тогда 
			Сообщить("Загрузка своих настроек производится на вкладках <Основные настройки>-<Основные>");
			Возврат;
		КонецЕсли;
		Доп.Добавить(ТекДан.Имя);
	Иначе
		Для Каждого Стр Из Отбор Цикл
			ЕСли Стр.Имя=Объект.ПользовательИмя Тогда 
				Сообщить("Загрузка своих настроек производится на вкладках <Основные настройки>-<Основные>");
			Иначе
				Доп.Добавить(Стр.Имя);
			КонецЕсли;
		КонецЦикла;
		Если Доп.Количество()=0 Тогда Возврат;КонецЕсли;
	КонецЕсли;
	ОО=Новый ОписаниеОповещения("ДоступЗагрузитьНастройкиизФайлаОтвет",ЭтаФорма,Доп);
	ПоказатьВопрос(ОО,"Загрузка настроек для "+?(Доп.Количество()>1, Строка(Доп.Количество())+" пользователей",
	"пользователя "+Доп[0])+Символы.ПС+"Внимание!!! Для загрузки основных настроек эти пользователи"
	+Символы.ПС+"должны выйти из Помощника автобизнеса. Продолжить?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступЗагрузитьНастройкиИзФайлаОтвет(Ответ,Доп) Экспорт
	Если Ответ<>КодВозвратаДиалога.Да Тогда Возврат;КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьНастройкиВыборИзФайла",ЭтаФорма,Доп);
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    Диалог.Фильтр = "Файлы настроек отчетов *.rep1c|*.rep1c";
    Диалог.Показать(Оповещение);
КонецПроцедуры

&НаСервере
Процедура ДоступЗагрузкаНастроекИзФайлаНаСервере(Список,ПользователиПА)
	Имена=Новый СписокЗначений;
	Имена.Добавить("Уровней цен","УровниЦен");
	Имена.Добавить("Прайс-листов","НастройкаЗагрузки");
	Имена.Добавить("Синонимы","Синонимы");
	Имена.Добавить("Онлайн-поставщиков заменить","Проценки",);	
	Общие=Новый Массив;
	ЕстьПроценки=Ложь;
	ЕстьОбщие=Ложь;
	Для Каждого Стр из Список Цикл
		Если Не Стр.Пометка Тогда Продолжить;
		ИначеЕсли Стр.Представление="Все (онлайн-поставищики заменяются)" или Стр.Представление="Все" Тогда 
			Список.ЗаполнитьПометки(Истина);
			Продолжить;
		ИначеЕСли Стр.Представление="Онлайн-поставщиков добавить" И ЕстьПроценки Тогда
			Продолжить;
		КонецЕсли;
		ЕСли ТипЗнч(Стр.Значение)=Тип("Число") Тогда
			Значение=ЗначениеИзСтрокиВнутр(Список[Список.Индекс(Стр)-1].Значение);
		Иначе
			Значение=ЗначениеИзСтрокиВнутр(Стр.Значение);
		КонецЕсли;
		СтрТип=ТипЗнч(Значение);
		
		Если СтрТип = Тип("Структура") Тогда
			Общие.Добавить(Значение);
			ЕстьОбщие=Истина;
		ИначеЕсли СтрТип = Тип("СписокЗначений") Тогда
			Для Каждого Эл из Значение Цикл
				ДоступСохранитьВХранилищеНастройки(Эл.Представление,Эл.Значение,ПользователиПА);
			КонецЦикла;	
		ИначеЕсли Лев(Стр.Представление,18)="Онлайн-поставщиков" Тогда
			Если ЕстьПроценки Тогда Продолжить;КонецЕсли;
			ЕстьПроценки=Истина;
			Если Стр.Представление="Онлайн-поставщиков заменить" Тогда
				ДоступСохранитьВХранилищеНастройки("Проценки",Значение,ПользователиПА);
			Иначе
				ДоступСохранитьВХранилищеНастройки("ПроценкиДобавить",Значение,ПользователиПА);
			КонецЕсли;
		ИначеЕсли СтрТип = Тип("ТаблицаЗначений") Тогда
			Имя=Имена.НайтиПоЗначению(Стр.Представление);
			ДоступСохранитьВХранилищеНастройки(Имя.Представление,Значение,ПользователиПА);
		ИначеЕсли СтрТип = Тип("ДеревоЗначений") Тогда
			Имя=Имена.НайтиПоЗначению(Стр.Представление);
			ДоступСохранитьВХранилищеНастройки(Имя.Представление,Значение,ПользователиПА);
		КонецЕсли;
	КонецЦикла;
	Если ЕстьОбщие Тогда
		ДоступСохранитьВХранилищеНастройки("ОбъектMySQL",Общие,ПользователиПА);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ДоступСохранитьВХранилищеНастройки(Ключ,Значение,ПользователиПА)
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Для Каждого Стр Из ПользователиПА Цикл
			ЕСли Ключ="ОбъектMySQL" Тогда
				Если Значение.Количество()=0 Тогда Возврат;КонецЕсли;
				Данные=ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса", "ОбъектMySQL",,Стр);
				Если ТипЗнч(Данные)<>Тип("Структура") Тогда
					// На всякий случай. Теоретически данные должны быть определены
					Данные = Новый Структура(
					"АналогиЕстьВ1С,АртикулОчищать,БанковскийСчетДляЗаявки,БезАналогов,БезПрименяемости,ВидНоменклатуры,
					|ВКорзину,ВыбиратьГруппу,ВыводитьАналоги,ВыводитьНаличие,Группировать,ЗаказПокупателя,ЗаписьШтрихкода,
					|ЗапрашиватьКоличество,ЗапрашиватьСкидку,ЗапрашиватьЦену,ИспользоватьПроценкуОнлайнПоставщиков,
					|ИспользоватьЦены,КассаККМ,КонтрольОстатков,НДСПоУмолчанию,ОбщийПоиск,ОрганизацияДляЗаявки,
					|ОтборПроизводители,ПутьКВременнойПапке,РеализацияТоваров,Склад,СортироватьТолькоПоЦенам,ПроводитьДокументы,
					|СчетФактура,ТипЦен,ЦеноваяГруппа,ШаблонНаименования,ШаблонНаименованияП,ШаблонНомераДляПоиска,
					|РеквизитНомераДляПоиска,ИспользоватьСинонимы,ЗапрашиватьГруппуНоменклатуры,ПоискПоОчищенному,ГруппаНоменклатуры,
					|ПоказатьЗамерПроизводительностиПоиска,БазоваяЕдиницаИзмерения, ТипЦенЗакупка, ИспользоватьБазуКроссов, 
					|ИспользоватьПрайсЛист, ИспользоватьПоискПоАвтомобилю,
					|ОтключитьПодсказкиВидеоИнструкций,ИспользоватьЗаказПоставщику,СортировкаОнлайнПоставщики, СортировкаОнлайнПоставщикиНаправление,
					|ЗаполнятьЗаказПриДобавленииВОнлайнКорзину,ЗапретитьРедактированиеЦенВКорзине,ИспользоватьСжатиеДанных,ЗаказВКомментарий,СборАналитики");
				КонецЕсли;
				Для Каждого Структ из Значение Цикл
					ЗаполнитьЗначенияСвойств(Данные, Структ);
				КонецЦикла;
				ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса","ОбъектMySQL",Данные,,Стр);
			ИначеЕсли Ключ="ПроценкиДобавить" Тогда
				Данные=ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса", "Проценки",,Стр);
				Для каждого эл из Значение Цикл
					ЗаполнитьЗначенияСвойств(Данные.Добавить(),эл);
				КонецЦикла;
				ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса","Проценки",Данные,,Стр);
			Иначе
				ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса",Ключ,Значение,,Стр);
			КонецЕсли;
		КонецЦикла;
	Исключение
		Сообщить("Ошибки при загрузке настроек: "+ОписаниеОшибки());
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры


#КонецОбласти

#Область СкладыПроценки

&НаКлиенте
Процедура СкладыПриИзменении(Элемент)
	СкладыПроценкиИзменены=Истина;
	ПроценкиИзменены=Истина;
КонецПроцедуры

&НаКлиенте
Процедура СкладыУстановитьФлажки(Команда)
	Флаг=Команда.Имя="СкладыУстановитьФлажки";
	Для каждого Стр Из СкладыПроценки Цикл
		Инд=Стр.ПолучитьИдентификатор();
		Если Элементы.СкладыПроценки.ПроверитьСтроку(Инд)=Истина Тогда
			  Стр.Пометка = Флаг;
		КонецЕсли; 
	КонецЦикла; 
	СкладыПроценкиИзменены=Истина;
	ПроценкиИзменены=Истина;
КонецПроцедуры

#КонецОбласти

#Область ПоУмолчанию

&НаКлиенте
Процедура ПоУмолчаниюЗначениеПриИзменении(Элемент)
	ПоУмолчаниюИзменены=Истина;
КонецПроцедуры

&НаСервере
Процедура СохранитьПоУмолчаниюНаСервере(Данные)
	ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса","ПоУмолчанию",Данные,,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
КонецПроцедуры
	
&НаКлиенте
Процедура СохранитьПоУмолчанию()
	Данные=ВладелецФормы.Объект.ПоУмолчанию;
	Для Каждого Стр из ПоУмолчанию Цикл
		Данные[Стр.Имя].Вставить("Значение",Стр.Значение);
	КонецЦикла;
	СохранитьПоУмолчаниюНаСервере(Данные);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗагрузитьИзХранилищаПА(КлючНастроек)
	Возврат ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса",КлючНастроек,,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьВХранилищеПА(КлючНастроек,Значение)
	ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса",КлючНастроек,Значение,,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьГруппы(Команда)
	Группы=ЗагрузитьИзХранилищаПА("ГруппыПоставщиков");
	ЭлементыГрупп=Новый СписокЗначений;
	Для Каждого Стр Из ТабПроценки Цикл
		//Если Стр.Вкл Тогда
			ЭлементыГрупп.Добавить(Стр.НаименованиеСайт);
		//КонецЕсли;
	КонецЦикла;
	ОО=Новый ОписаниеОповещения("ЗаписатьГруппыПоставщиков",ЭтаФорма);
	ОткрытьФорму("ВнешняяОбработка.Nirax_ПомощникАвтобизнесаОбщий.Форма.ГруппыУФ",
	Новый Структура("Группы,ЭлементыГрупп,Заголовок,ЗаголовокГруппы",
	Группы,ЭлементыГрупп,"Группы поставщиков","Поставщики"),ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно,,ОО,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьГруппыПоставщиков(Группы,Доп=Неопределено) Экспорт
	Если Группы=Неопределено Тогда Возврат; КонецЕсли;
	СохранитьВХранилищеПА("ГруппыПоставщиков",Группы);
	Список=ВладелецФормы.Элементы.ГруппаПоставщиков.СписокВыбора;
	Список.Очистить();
	//Список.Добавить(""," ");
	Для Каждого Стр из Группы Цикл
		Список.Добавить(Стр.Представление);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИспользоватьСинонимыПриИзмененииНаСервере()
		Выб=ХранилищеОбщихНастроек.Выбрать(Новый Структура("КлючОбъекта, КлючНастроек, Пользователь",
		"ПомощникАвтобизнеса","Синонимы",ПользователиИнформационнойБазы.ТекущийПользователь().Имя));
		Возврат Выб.Следующий();
КонецФункции

&НаКлиенте
Процедура ИспользоватьСинонимыПриИзменении(Элемент)
	Если Объект.ИспользоватьСинонимы=Истина Тогда
		Если Не ИспользоватьСинонимыПриИзмененииНаСервере() Тогда
			Объект.ИспользоватьСинонимы=Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоставщика(Команда)
	Список=Новый СписокЗначений;
	Список.Добавить("API");
	Список.Добавить("PRICE");
	ОО=Новый ОписаниеОповещения("ДобавлениеПоставщика",ЭтаФорма,Список);
	Список.ПоказатьВыборЭлемента(ОО,"Выберите источник данных");
КонецПроцедуры
	
&НаКлиенте
Процедура ДобавлениеПоставщика(Источник,Доп=Неопределено) Экспорт
	Если Источник=Неопределено Тогда Возврат;КонецЕсли;
	
	Если Источник.Значение="API" ТОгда
		Текст=ПолучитьПоставщиковAPI();
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Текст);
		Проценки = ПрочитатьJSON(ЧтениеJSON, Ложь);
		Если Проценки=Неопределено тогда возврат;КонецЕсли;
		
		Список=Новый СписокЗначений;
		Для Каждого Стр из Проценки Цикл
			Список.Добавить(Стр,Стр.Сайт);
		КонецЦикла;
		Список.СортироватьПоПредставлению();
		ОО=Новый ОписаниеОповещения("ДобавлениеПоставщикаAPI",Этаформа);
		Список.ПоказатьВыборЭлемента(ОО,"Выберите сайт Поставщика");
	Иначе
		Запрос="{""action"":""getUser"", ""schema"":""pricelists""}";
		ЭтаФорма.ВладелецФормы.СендерОтправить(Запрос);	// см. ВыбратьПрайсДляДобавления
	КонецЕсли;
	
КонецПроцедуры


&НаСервере	
Функция ПолучитьПоставщиковAPI()
	Обработка=РеквизитФормыВЗначение("Объект");
	Возврат Обработка.ПолучитьСписокПроценок();
КонецФункции
	
&НаКлиенте
Процедура ДобавлениеПоставщикаAPI(Данные,Доп=Неопределено) Экспорт
	Если Данные=Неопределено Тогда возврат;КонецЕсли;
	Стр=Данные.Значение;
	// Определим наименование
	НомерПроценки = 0;
	СтрНомерПроценки = "";
	Пока ТабПроценки.НайтиСтроки(Новый Структура("НаименованиеСайт", Стр.Сайт+СтрНомерПроценки)).Количество() > 0 Цикл
		НомерПроценки = НомерПроценки + 1;
		СтрНомерПроценки = " "+Строка(НомерПроценки);
	КонецЦикла;
	ТСтр=ТабПроценки.Добавить();
	ТСтр.Сайт=Стр.Сайт;
	ТСтр.Источник="API";
	ТСтр.НаименованиеСайт=ПолучитьНаименование(Стр.Сайт); //+СтрНомерПроценки;
	ТСтр.Вкл = Ложь;
	//Стр=СтрокаВыбора.Данные;
	ТСтр.Помощь=Стр.Помощь;
	ТСтр.Авторизация=Новый Структура();
	Для Каждого Эл Из Стр.Авторизация Цикл
		Если Не ТСтр.Авторизация.Свойство(Эл.Ключ) Тогда
			ТСтр.Авторизация.Вставить(Эл.Ключ,Эл.Значение);
		КонецЕсли;
	КонецЦикла;
	ТСтр.Фильтры=Новый Структура();
	Для Каждого Эл Из Стр.Фильтры Цикл
		Если Не ТСтр.Фильтры.Свойство(Эл.Ключ) Тогда
			ТСтр.Фильтры.Вставить(Эл.Ключ,Эл.Значение);
		КонецЕсли;
	КонецЦикла;
	ТСтр.Методы=Новый Структура();
	Для Каждого Эл Из Стр.Методы Цикл
		Если Не ТСтр.Методы.Свойство(Эл.Ключ) Тогда
			ТСтр.Методы.Вставить(Эл.Ключ,Эл.Значение);
		КонецЕсли;
	КонецЦикла;
	Элементы.Проценки.ТекущаяСтрока=ТСтр.ПолучитьИдентификатор();
КонецПроцедуры	

&НаКлиенте
Процедура ПроценкиНаименованиеСайтОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ТекДан=Элементы.Проценки.ТекущиеДанные;
	Если ПустаяСтрока(Текст) Тогда
		ТекДан.Вкл=Ложь;
	Иначе
		Строки=ТабПроценки.НайтиСтроки(Новый Структура("НаименованиеСайт",Текст));
		Если Строки.Количество()>1 или (Строки.Количество()=1 И Строки[0]<>ТекДан) Тогда
			Значение=ПолучитьНаименование(Текст,ТекДан);
			ДанныеВыбора=Новый СписокЗначений;
			ДанныеВыбора.Добавить(Значение);
			СтандартнаяОбработка=Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьНаименование(Текст,ТекСтр=Неопределено)
	// Выделяем номер проценки
	Кол=СтрДлина(Текст);
	СтрНомерПроценки = "";
	Разделитель=" ";
	Для Поз=1 по Кол Цикл
		Символ=Сред(Текст,Кол-Поз+1,1);
		Если Символ>="0" и Символ<="9" Тогда
			СтрНомерПроценки=Символ+СтрНомерПроценки;
		Иначе
			ИмяПроценки=Лев(Текст,Кол-Поз+1);
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	Если СтрНомерПроценки="" Тогда
		НомерПроценки=0;
	Иначе
		НомерПроценки=Число(СтрНомерПроценки);
		Разделитель="";
	КонецЕсли;
	
	Пока Истина Цикл
		Строки=ТабПроценки.НайтиСтроки(Новый Структура("НаименованиеСайт", ИмяПроценки+СтрНомерПроценки));
		Если Строки.Количество()=0 ИЛИ (Строки.Количество()=1 И Строки[0]=ТекСтр) Тогда
			Прервать;
		КонецЕсли;
		НомерПроценки = НомерПроценки + 1;
		СтрНомерПроценки = Разделитель+Формат(НомерПроценки,"ЧН=");
	КонецЦикла;
	Возврат ИмяПроценки+СтрНомерПроценки;
	
КонецФункции	

// Обновляет данные о прайсах, полученные из сендера
&НаКлиенте
Процедура ОбновитьПрайсы(Данные) Экспорт
	Для Каждого ТекСтр из Данные Цикл
		Строки=ТабПроценки.НайтиСтроки(Новый Структура("Сайт","id"+Формат(ТекСтр.idPrice,"ЧЦ=6;ЧВН=;ЧГ=")));
		Если Строки.Количество()>0 Тогда
			Стр=Строки[0];
			Стр.Авторизация.Очистить();
			Стр.Авторизация.Вставить("dateFrom",ТекСтр.dateFrom);
			Стр.Авторизация.Вставить("dateDownload",ТекСтр.dateDownload);
			Стр.Авторизация.Вставить("dateLastCheck",ТекСтр.dateLastCheck);
			Стр.Авторизация.Вставить("validity",ТекСтр.validity);
			Стр.Авторизация.Вставить("period",ТекСтр.period);
			Стр.Авторизация.Вставить("settings",ТекСтр.settings);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Формирует список прайсов для добавления из данных запроса
&НаКлиенте
Процедура ВыбратьПрайсДляДобавления(Данные) Экспорт
	Список=Новый СписокЗначений;
	Список.Добавить("FILE","FILE - Новый постащик");
	Список.Добавить("EMAIL","EMAIL - Новый Поставщик");
	Для Каждого Стр Из Данные Цикл
		Если ТабПроценки.НайтиСтроки(Новый Структура("Сайт","id"+Формат(Стр.idPrice,"ЧЦ=6;ЧВН=;ЧГ="))).Количество()=0  Тогда
			Список.Добавить(Стр,Стр.source+" - "+Стр.supplier);
		КонецЕсли;
	КонецЦикла;
	ОО=Новый ОписаниеОповещения("ВыбранПрайсДляДобавления",ЭтаФорма);
	Список.ПоказатьВыборЭлемента(ОО,"Выберите прайс поставщика");
КонецПроцедуры

&НаКлиенте
Процедура ВыбранПрайсДляДобавления(Стр, Доп=Неопределено) Экспорт
	Если Стр=Неопределено тогда возврат;КонецЕсли;
	Стр=Стр.Значение;
	Если ТипЗнч(Стр)=Тип("Строка") тогда
		Нов=ТабПроценки.Добавить();
		Нов.Источник=Стр;
		Нов.НаименованиеСайт=ПолучитьНаименование("Поставщик");
		Нов.Методы=Новый структура("Поиск,Корзина","1","1");
		Нов.Фильтры=Новый Структура;
		Нов.Авторизация=Новый Структура("dateFrom,dateDownload,dateLastCheck,validity,period,settings",
		Неопределено, Неопределено, Неопределено,24,0);
		Если Стр="FILE" Тогда
			Нов.Авторизация.settings="{""ФайлШаблон"":"""",""ZipАрхив"":false}";
		ИначеЕсли Стр="EMAIL" Тогда
			Нов.Авторизация.settings="{""Отправитель"":"""",""Получатель"":"""",""ПочтовыйЯщик"":"""",""Тема"":"""",""Вложение"":"""",""ZipАрхив"":false}";
			//Нов.Авторизация.settings=Новый Структура("Отправитель,Получатель,ПарольПолучателя,ПочтовыйЯщик,Тема,Вложение,ФорматДанных,ZipАрхив","","","","","","","",Ложь);
		КонецЕсли;
		
		Запрос=Новый Структура("action,schema,index,supplier,source,validity,period,settings",
		"add","pricelists",ТабПроценки.Индекс(Нов),Нов.НаименованиеСайт,Нов.Источник,
		Нов.Авторизация.validity,Нов.Авторизация.period,Нов.Авторизация.settings);
		ЭтаФорма.ВладелецФормы.СендерОтправить(Запрос);  // ПрайсДобавлен
		Элементы.Проценки.ТекущаяСтрока=Нов.ПолучитьИдентификатор();
	Иначе
		Нов=ТабПроценки.Добавить();
		Нов.Источник=Стр.source;
		Нов.НаименованиеСайт=ПолучитьНаименование(Стр.supplier);
		Нов.Сайт="id"+Формат(Стр.idPrice,"ЧЦ=6;ЧВН=;ЧГ=");
		Нов.Методы=Новый структура("Поиск,Корзина","1","1");
		Нов.Фильтры=Новый Структура;
		Нов.Авторизация=Новый Структура("dateFrom,dateDownload,dateLastCheck,validity,period,settings",
		Стр.dateFrom,Стр.dateDownload,Стр.dateLastCheck,Стр.validity,Стр.period,Стр.settings);
		Элементы.Проценки.ТекущаяСтрока=Нов.ПолучитьИдентификатор();
		ЗаписатьПроценкиНаСервере();
		ПроценкиИзменены=Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрайсДобавлен(data) Экспорт
	ТабПроценки[data.index].Сайт="id"+Формат(data.idPrice,"ЧЦ=6;ЧВН=;ЧГ=");
	ТабПроценки[data.index].НаименованиеСайт=data.supplier;
	ЗаписатьПроценкиНаСервере();
	ПроценкиИзменены=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДаты(Команда)
	ТекДан=Элементы.Проценки.ТекущиеДанные;
	Запрос=Новый Структура("action,schema,idPrice","getPrice","pricelists",Сред(ТекДан.Сайт,3));
	ВладелецФормы.СендерОтправить(Запрос); // ОбновлениеДат
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеДат(Данные) Экспорт
	ТекДан=Элементы.Проценки.ТекущиеДанные;
	Сайт="id"+Формат(Данные.idPrice,"ЧЦ=6;ЧГ=;ЧВН=");
	Если ТекДан.Сайт=Сайт Тогда
		Авторизация=ТекДан.Авторизация;
		Авторизация.Очистить();
		Авторизация.Вставить("dateFrom",Данные.dateFrom);
		Авторизация.Вставить("dateDownload",Данные.dateDownload);
		Авторизация.Вставить("dateLastCheck",Данные.dateLastCheck);
		Авторизация.Вставить("validity",Данные.validity);
		Авторизация.Вставить("period",Данные.period);
		Авторизация.Вставить("settings",Данные.settings);
		ДанныеПроценки.Очистить();
		Нов=ДанныеПроценки.Добавить();
		Нов.Ключ="dateFrom";Нов.Значение=Авторизация.dateFrom;Нов.Наименование="Дата прайс-листа";
		Нов=ДанныеПроценки.Добавить();
		Нов.Ключ="dateDownload";Нов.Значение=Авторизация.dateDownload;Нов.Наименование="Дата последней загрузки";
		Если ТекПроценка.Источник<>"FILE" Тогда
			Нов=ДанныеПроценки.Добавить();
			Нов.Ключ="dateLastCheck";Нов.Значение=Авторизация.dateLastCheck;Нов.Наименование="Дата последнего опроса";
			Нов=ДанныеПроценки.Добавить();
			Нов.Ключ="validity";Нов.Значение=Авторизация.validity;Нов.Наименование="Срок действия прайс-листа, час (до опроса)";
			Нов=ДанныеПроценки.Добавить();
			Нов.Ключ="period";Нов.Значение=Авторизация.period;Нов.Наименование="Частота опроса, час";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПроверкаПрайс(ТекДан)
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекДан.Авторизация.settings);
	Рез = ПрочитатьJSON(ЧтениеJSON,Ложь);
	ЧтениеJSON.Закрыть();
	Ошибка=?(Рез.НачальнаяСтрока = 0,"Начальная строка не должна быть равна нулю."+Символы.ПС,"")+
	?(Рез.КолАртикул = 0,"Номер колонки Артикул не должен быть равен нулю."+Символы.ПС,"")+
	?(Рез.КолПроизводитель = 0 И ПустаяСтрока(Рез.Производитель) ,"Не определена колонка производителя и его наименование."+Символы.ПС,"")+
	?(Рез.КолНаименование = 0,"Номер колонки Наименование не должен быть равен нулю."+Символы.ПС,"")+
	?(Рез.КолЦена = 0,"Номер колонки Цена не должен быть равен нулю."+Символы.ПС,"");
	
	Если ТекДан.Источник="EMAIL" тогда	
		Ошибка=?(Рез.Получатель = "","Не определен получатель."+Символы.ПС,"")+
		?(Рез.Отправитель = "","Не определен отправитель."+Символы.ПС,"")+
		?(Рез.ПочтовыйЯщик = "","Не определен почтовый ящик."+Символы.ПС,"")+
		?(Рез.Вложение = "","Не определен шаблон имени файла вложения."+Символы.ПС,"")+Ошибка;
	ИначеЕсли Рез.ФайлШаблон = "" Тогда 
		Ошибка="Не определено имя файла."+Символы.ПС+Ошибка;
	КонецЕсли;	
	Возврат Ошибка;
КонецФункции

&НаКлиенте
Процедура ЗагрузитьПрайс(Команда)
	ТекДан=Элементы.Проценки.ТекущиеДанные;
	Если ТекДан=Неопределено тогда Возврат; КонецЕсли;
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекДан.Авторизация.settings);
	Рез = ПрочитатьJSON(ЧтениеJSON,Ложь);
	ЧтениеJSON.Закрыть();
	Если Не Рез.Свойство("НачальнаяСтрока") Тогда
		Сообщить("Не определены настройки для загрузки прайс-листа");
		Возврат;
	КонецЕсли;
	Ошибка=?(Рез.НачальнаяСтрока = 0,"Начальная строка не должна быть равна нулю."+Символы.ПС,"")+
	?(Рез.КолАртикул = 0,"Номер колонки Артикул не должен быть равен нулю."+Символы.ПС,"")+
	?(Рез.КолПроизводитель = 0 И ПустаяСтрока(Рез.Производитель) ,"Не определена колонка производителя и его наименование."+Символы.ПС,"")+
	?(Рез.КолНаименование = 0,"Номер колонки Наименование не должен быть равен нулю."+Символы.ПС,"")+
	?(Рез.КолЦена = 0,"Номер колонки Цена не должен быть равен нулю."+Символы.ПС,"");
	
	Если ТекДан.Источник="EMAIL" тогда	
		Ошибка=?(Рез.Получатель = "","Не определен получатель."+Символы.ПС,"")+
		?(Рез.Отправитель = "","Не определен отправитель."+Символы.ПС,"")+
		?(Рез.ПочтовыйЯщик = "","Не определен почтовый ящик."+Символы.ПС,"")+
		?(Рез.Вложение = "","Не определен шаблон имени файла вложения."+Символы.ПС,"")+Ошибка;
	ИначеЕсли Рез.ФайлШаблон = "" Тогда 
		Ошибка="Не определено имя файла."+Символы.ПС+Ошибка;
	КонецЕсли;	
	
	Если Ошибка<>"" Тогда 
		ПоказатьПредупреждение(,Ошибка);
		Возврат;
	КонецЕсли;
	
	Если ТекДан.Источник="EMAIL" тогда
		Запрос="{""action"":""loadPrice"",""idPrice"":"""+Сред(ТекДан.Сайт,3)+""",""schema"":""price""}";
		ВладелецФормы.СендерОтправить(Запрос); // ПрайсОбновлен
		Сообщить("Запрос на загрузку отправлен на сервер");
	Иначе
		Запрос="{""action"":""clearPrice"",""idPrice"":"""+Сред(ТекДан.Сайт,3)+""",""schema"":""price"",""noReply"":true}";
		ВладелецФормы.СендерОтправить(Запрос);
		
		zp=Новый Структура("Excel,ExcelЛист,Группы,Групп,dateFrom,dateDownload,idPrice,cols,Н1,Н0,Колонки, Начало");
		zp.Начало=ТекущаяДата();
		zp.cols = "article,manufacturer,description,price";
		zp.Колонки=Новый Массив;
		zp.Колонки.Добавить(Новый Структура("ПоУмолчанию,Номер,ЭтоЧисло,Массив",Неопределено,Рез.КолАртикул,Ложь));
		zp.Колонки.Добавить(Новый Структура("ПоУмолчанию,Номер,ЭтоЧисло,Массив",
		?(ПустаяСтрока(Рез.Производитель),Неопределено,Рез.Производитель),Рез.КолПроизводитель,Ложь));
		zp.Колонки.Добавить(Новый Структура("ПоУмолчанию,Номер,ЭтоЧисло,Массив",Неопределено,Рез.КолНаименование,Ложь));
		zp.Колонки.Добавить(Новый Структура("ПоУмолчанию,Номер,ЭтоЧисло,Массив",Неопределено,Рез.КолЦена,Истина));
		Если Рез.КолНаличие>0 Тогда 
			zp.cols=zp.cols+",inStock";
			zp.Колонки.Добавить(Новый Структура("ПоУмолчанию,Номер,ЭтоЧисло,Массив","0",Рез.КолНаличие,Истина));
		КонецЕсли;
		Если Рез.КолСрокДоставки>0 Тогда
			zp.cols=zp.cols+",deliveryTime";
			zp.Колонки.Добавить(Новый Структура("ПоУмолчанию,Номер,ЭтоЧисло,Массив","999",Рез.КолСрокДоставки,Истина));
		КонецЕсли;
		Если Рез.КолКратность>0 Тогда 
			zp.cols=zp.cols+",multiple";
			zp.Колонки.Добавить(Новый Структура("ПоУмолчанию,Номер,ЭтоЧисло,Массив","1",Рез.КолКратность,Истина));
		КонецЕсли;
		Если Рез.КолМинПартия>0 Тогда 
			zp.cols=zp.cols+",minBatch";
			zp.Колонки.Добавить(Новый Структура("ПоУмолчанию,Номер,ЭтоЧисло,Массив","1",Рез.КолМинПартия,Истина));
		КонецЕсли;
		Если Рез.КолКодТовара>0 Тогда 
			zp.cols=zp.cols+",productCode";
			zp.Колонки.Добавить(Новый Структура("ПоУмолчанию,Номер,ЭтоЧисло,Массив","",Рез.КолКодТовара,Ложь));
		КонецЕсли;
		zp.cols=zp.cols+",searchCode";
		zp.idPrice=Сред(ТекДан.Сайт,3);
		
		Файл=Новый Файл(Рез.ФайлШаблон);
		Если Не Файл.Существует() Тогда
			Сообщить("Файл "+Рез.ФайлШаблон+" не существует");
			Возврат;
		КонецЕсли;
		zp.dateFrom=Файл.ПолучитьВремяИзменения();
		zp.dateDownload=ТекущаяДата();
		
		Попытка	   
			zp.Excel = Новый COMОбъект("Excel.Application");
			zp.Excel.WorkBooks.Open(Рез.ФайлШаблон);	
			zp.ExcelЛист = zp.Excel.Sheets(Рез.НомерЛиста);	   
			zp.ExcelЛист.Activate();
		Исключение	   
			Сообщить("Ошибка при открытии файла Excel. "+ОписаниеОшибки()); 
			Возврат;
		КонецПопытки;
	
		Состояние("Чтение данных из документа Excel ...");
		Попытка
			//xlLastCell = 11;   	
			//ActiveCell = zp.Excel.ActiveCell.SpecialCells(xlLastCell);   
			//Строк = ActiveCell.Row;
			Строк = zp.Excel.ActiveSheet.UsedRange.Rows.Count;
			zp.Н0=Рез.НачальнаяСтрока;
			zp.Н1=Строк%200;
			zp.Групп=(Строк-zp.Н1)/200;
			Если zp.Н1<=zp.Н0 Тогда 
				zp.Н1=zp.Н1+200-zp.Н0;
				zp.Групп=zp.Групп-1;
			Иначе
			КонецЕсли;
			zp.Группы=0;
			ПодключитьОбработчикОжидания("ЗагрузитьГруппу", 0.1, Истина);
		Исключение
			Сообщить(ОписаниеОшибки());
		Конецпопытки;
	КонецЕсли;
Конецпроцедуры
				
&НаКлиенте
Процедура ЗагрузитьГруппу() Экспорт		
	Состояние("Загружено "+Цел(zp.Группы*100/(zp.Групп+1))+"%");
	Попытка					
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.ПроверятьСтруктуру = Ложь;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		ЗаписьJSON.ЗаписатьИмяСвойства("action");
		ЗаписьJSON.ЗаписатьЗначение("addPrice");
		ЗаписьJSON.ЗаписатьИмяСвойства("schema");
		ЗаписьJSON.ЗаписатьЗначение("price");
		ЗаписьJSON.ЗаписатьИмяСвойства("idPrice");
		ЗаписьJSON.ЗаписатьЗначение(zp.idPrice);
		Если zp.Группы<>zp.Групп Тогда 
			ЗаписьJSON.ЗаписатьИмяСвойства("noReply");
			ЗаписьJSON.ЗаписатьЗначение(1);
		Иначе
			ЗаписьJSON.ЗаписатьИмяСвойства("dateFrom");
			ЗаписьJSON.ЗаписатьЗначение(Формат(zp.dateFrom,"ДФ=гггг-ММ-дд ЧЧ:мм:сс"));
			ЗаписьJSON.ЗаписатьИмяСвойства("dateDownload");
			ЗаписьJSON.ЗаписатьЗначение(Формат(zp.dateDownload,"ДФ=гггг-ММ-дд ЧЧ:мм:сс"));
		КонецЕсли;
		ЗаписьJSON.ЗаписатьИмяСвойства("cols");
		ЗаписьJSON.ЗаписатьЗначение(zp.cols);
		ЗаписьJSON.ЗаписатьИмяСвойства("data");
		ЗаписьJSON.ЗаписатьНачалоМассива();
		ЕстьЗаписи=Ложь;
		
		// Читаем данные в Массивы
		Для Каждого Кол Из zp.Колонки Цикл
			Если Кол.Номер=0 Тогда
				Кол.Массив=Новый Массив;
				Для Инд = 0 По zp.Н1-zp.Н0 Цикл Кол.Массив.Добавить(Кол.ПоУмолчанию);КонецЦикла;
			Иначе
				Область = zp.ExcelЛист.Range(zp.ExcelЛист.Cells(zp.Н0,Кол.Номер), zp.ExcelЛист.Cells(zp.Н1,Кол.Номер));
				Кол.Массив = Область.Value.Выгрузить()[0];
			КонецЕсли;
		КонецЦикла;
		
		// Формируем значения для запроса
		Для Инд = 0 По zp.Н1-zp.Н0 Цикл 
			value="";
			Для Каждого Кол из zp.Колонки Цикл
				Текст=Кол.Массив[Инд];
				Если ПустаяСтрока(Текст) Тогда
					Если Кол.ПоУмолчанию=Неопределено Тогда 
						value="";
						Прервать;
					Иначе
						Текст=Кол.ПоУмолчанию;
					КонецЕсли;
				ИначеЕсли Кол.ЭтоЧисло Тогда
					Попытка
						Число=Число(Текст); 
					Исключение
						Попытка
							Текст=СтрЗаменить(СтрЗаменить(СтрЗаменить(Текст, Символы.НПП, "")," ", ""),",",".");
							Число=Число(Текст); 
						Исключение
							Число=ПолучитьЧисло(Текст,Кол.ПоУмолчанию);
							Если Число=Неопределено Тогда 
								value="";
								Прервать;
							//ИначеЕсли ТипЗнч(Текст)=Тип("Число") Тогда
							КонецЕсли;
						Конецпопытки;
					КонецПопытки;
					Текст=Формат(Число,"ЧГ=;ЧН=");
				Иначе
					Текст=СтрЗаменить(СтрЗаменить(Текст,"\","\\"),"'","''");
					Если Кол=zp.Колонки[0] Тогда
						КодПоиска=ПодготовитьНомер(Текст);
					КонецЕсли;
				КонецЕсли;
				value=value+"'"+Текст+"',";
			КонецЦикла;
			Если value<>"" Тогда
				ЗаписьJSON.ЗаписатьЗначение(value+"'"+КодПоиска+"'");
				ЕстьЗаписи=Истина;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьЗаписи или zp.Группы=zp.Групп Тогда
			ЗаписьJSON.ЗаписатьКонецМассива();
			ЗаписьJSON.ЗаписатьКонецОбъекта();
			ВладелецФормы.СендерОтправить(ЗаписьJSON.Закрыть());
		КонецЕсли;
		Если zp.Группы<zp.Групп Тогда
		    zp.Н0=zp.Н1+1;
		    zp.Н1=zp.Н1+200;
			zp.Группы=zp.Группы+1;
			ПодключитьОбработчикОжидания("ЗагрузитьГруппу", 0.1, Истина);
		Иначе
			Состояние();
		    zp.Excel.DisplayAlerts = 0;
		    zp.Excel.Quit();
		    zp.Excel.DisplayAlerts = 1;
			zp.Excel = Неопределено;
			Сообщить("Строк: "+zp.Н1+", Время: "+(ТекущаяДата()-zp.Начало)+" сек.");
		КонецЕсли
	Исключение
		Сообщить(ОписаниеОшибки());
		Состояние();
	    zp.Excel.DisplayAlerts = 0;
	    zp.Excel.Quit();
	    zp.Excel.DisplayAlerts = 1;
		zp.Excel = Неопределено;
	КонецПопытки;	
КонецПроцедуры		

&НаКлиенте
Функция ПолучитьЧисло(Данные,Ноль=0) Экспорт
	Если ТипЗнч(Данные)=Тип("Число") Тогда Возврат Данные;КонецЕсли; 
	Если ПустаяСтрока(Данные) Тогда Возврат Ноль;КонецЕсли; 
	Попытка 
		Данные=СтрЗаменить(СтрЗаменить(СтрЗаменить(Данные, Символы.НПП, "")," ", ""),",",".");
		Возврат Число(Данные); 
	Исключение
		Симв=Лев(Данные,1);
		//Числа = (Симв>="0" И Симв <= "9") ИЛИ Симв="-" или Симв="+";
		Нач=0; Длина=0; ТочкиНет=Истина; Знак="";
		Кол = СтрДлина(Данные);
		Для Поз=1 по Кол Цикл
			Симв=Сред(Данные,Поз,1);
			Число = (Симв>="0" И Симв <= "9"); 
			Если Не Число Тогда
				Если Длина=0 и (Симв="-" или Симв="+") Тогда
					Знак=Симв;
				ИначеЕсли Длина>0 И ТочкиНет И Симв="." Тогда
					ТочкиНет=Ложь;
					Длина=Длина+1;
				ИначеЕсли Длина>0 Тогда
					Длина=Поз-Нач;
					Прервать;
				КонецЕсли;
			Иначе
				Если Длина=0 Тогда
					Нач=Поз;
				КонецЕсли;
				Длина=Длина+1;
			КонецЕсли;
		КонецЦикла;
		Если Длина=0 Тогда
			Возврат Ноль;
		Иначе
			Возврат Число(Знак+Сред(Данные,Нач,Длина));
		КонецЕсли;
	Конецпопытки
КонецФункции

&НаКлиенте
Процедура ОткрытьПрайс(Команда)
	ТекДан=Элементы.Проценки.ТекущиеДанные;
	Если ТекДан<>Неопределено Тогда
		ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ПрайсУФ",
		Новый Структура("Наименование,Код",ТекДан.НаименованиеСайт,ТекДан.Сайт),
		ЭтаФорма.ВладелецФормы,"ПрайсУФ");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаЗагрузки(Команда)
	ТекДан=Элементы.Проценки.ТекущиеДанные;
	Если ТекДан<>Неопределено Тогда
		ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ПрайсНастройкаУФ", 
		Новый Структура("НаименованиеСайт,Источник,Сайт,Авторизация",ТекДан.НаименованиеСайт,ТекДан.Источник,ТекДан.Сайт,ТекДан.Авторизация),
		ЭтаФорма.ВладелецФормы,"ПрайсНастройкаУФ");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПрайсУдалять(Код)
	Попытка
	УстановитьПривилегированныйРежим(Истина);
    Если ПривилегированныйРежим()=Истина Тогда
		Удалять=Истина;
		Отбор = Новый Структура("КлючНастроек, КлючОбъекта","Проценки","ПомощникАвтобизнеса");
		Выборка = ХранилищеОбщихНастроек.Выбрать(Отбор);
		Пока Выборка.Следующий() Цикл
			Если Выборка.Пользователь<>Объект.ПользовательИмя Тогда
				Таб=ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","Проценки",,Выборка.Пользователь);
				Если ТипЗнч(Таб)=Тип("ТаблицаЗначений") И Таб.Найти(Код,"Сайт")<>Неопределено Тогда
					Удалять=Ложь;
					Прервать;
				КонецЕсли;
		    КонецЕсли;
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);
	Иначе
		Удалять=Ложь;
	КонецЕсли;
    Исключение
		Удалять=Ложь;
	КонецПопытки;
	Возврат Удалять;
КонецФункции

&НаКлиенте
Процедура ПроценкиПередУдалением(Элемент, Отказ)
	ТекДан=Элементы.Проценки.ТекущиеДанные;
	Если ТекДан.Источник<>"API" Тогда
		Если ПрайсУдалять(ТекДан.Сайт) Тогда
			Запрос="{""action"":""del"",""idPrice"":"""+сред(ТекДан.Сайт,3)+""",""schema"":""pricelists""}";
			ЭтаФорма.ВладелецФормы.СендерОтправить(Запрос);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрайсОбновлен(Рез) Экспорт
	ТекДан=Элементы.Проценки.ТекущиеДанные;
	Код="id"+Формат(Рез.idPrice,"ЧЦ=6;ЧВН=;ЧГ=");
	Если ТекДан.Сайт<>Код Тогда
		Строки=ТабПроценки.НайтиСтроки("Сайт",Код);
		Если Строки.Количество()=0 Тогда 
			Сообщить("Не найден прайс с кодом "+Код);
			Возврат;
		КонецЕсли;
		Тек=Строки[0];
	Иначе
		Тек=ТекДан;
	КонецЕсли;
	
	Если Рез.Свойство("settings") И ТипЗнч(Рез.settings)=Тип("Структура") Тогда
		ЗаписьJSON=Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет,,,,,,,,Истина));
		ЗаписатьJSON(ЗаписьJSON,Рез.settings);
		Рез.settings=ЗаписьJSON.Закрыть();
	КонецЕсли;
	
	Если Рез.action="update" тогда
		ЗаполнитьЗначенияСвойств(Тек.Авторизация,Рез,"validity,period,settings");
	ИначеЕсли Рез.action="loadPrice" или Рез.action="addPrice" Тогда
		ЗаполнитьЗначенияСвойств(Тек.Авторизация,Рез,"dateFrom,dateDownload");
		Сообщить("Обновлен прайс id"+Формат(Рез.idPrice,"ЧЦ=6;ЧВН=;ЧГ="));
	Иначе		
		ЗаполнитьЗначенияСвойств(Тек.Авторизация,Рез,"dateFrom,dateDownload,dateLastCheck,validity,period,settings");
	КонецЕсли;
	Если ТекДан=Тек Тогда
		СвойстваД=Тек.Авторизация;
		ДанныеПроценки.Очистить();
		Нов=ДанныеПроценки.Добавить();
		Нов.Ключ="dateFrom";Нов.Значение=СвойстваД.dateFrom;Нов.Наименование="Дата прайс-листа";
		Нов=ДанныеПроценки.Добавить();
		Нов.Ключ="dateDownload";Нов.Значение=СвойстваД.dateDownload;Нов.Наименование="Дата последней загрузки";
		Если ТекДан.Источник<>"FILE" Тогда
			Нов=ДанныеПроценки.Добавить();
			Нов.Ключ="dateLastCheck";Нов.Значение=СвойстваД.dateLastCheck;Нов.Наименование="Дата последнего опроса";
			Нов=ДанныеПроценки.Добавить();
			Нов.Ключ="validity";Нов.Значение=СвойстваД.validity;Нов.Наименование="Срок действия прайс-листа, час (до опроса)";
			Нов=ДанныеПроценки.Добавить();
			Нов.Ключ="period";Нов.Значение=СвойстваД.period;Нов.Наименование="Частота опроса, час";
		КонецЕсли;
	КонецЕсли;
Конецпроцедуры

#КонецОбласти
