Процедура СформироватьПросрочкиМодуль() Экспорт
		
	Для каждого Стр Из Контрагенты Цикл
		
		Контрагент = Стр.Значение;
		
		Если Не обЗначениеНеЗаполнено(Контрагент) Тогда
			
			Если Не обЗначениеНеЗаполнено(ДатаРасчета) Тогда
				
				СтрОстатокЧисло = 0;
				СтруктураОтбора = Новый Структура("Контрагент",Контрагент);
				МоментВремени = Новый МоментВремени(КонецДня(РабочаяДата));
				тзОбщДолги = РегистрыНакопления.ВзаиморасчетыКомпании.Остатки(МоментВремени,СтруктураОтбора,,"Сумма");
				СтрОстатокЧисло = тзОбщДолги.Итог("Сумма");
				СтрОстаток = Формат(СтрОстаток,"ЧЦ=15; ЧДЦ=2");
				
				Всего=тзОбщДолги.Количество();        
				Сч=1;        
				Пока Сч <= Всего цикл        
					Состояние("Обработка строк: "+строка(сч)+" из "+Строка(Всего));
					Попытка
						Стр = тзОбщДолги[сч-1];
					Исключение
						//
					КонецПопытки; 
					Если Число(СокрЛП(Стр.Сумма)) <= 0 Тогда
						тзОбщДолги.Удалить(Стр);
						Всего = Всего - 1;
					Иначе
						Сч = Сч + 1;
					КонецЕсли;    
				КонецЦикла;
				
				тзОбщДолги.Колонки.Добавить("ДатаСделки");
				тзОбщДолги.Колонки.Добавить("СрокОплатыЗадолженности");
				тзОбщДолги.Колонки.Добавить("ОплатитьДо");
				тзОбщДолги.Колонки.Добавить("ПросроченнаяЗадолженность");
				
				Если обЗначениеНеЗаполнено(ДатаРасчета) Тогда
					ДатаРасчета = КонецДня(ТекущаяДата());
				Иначе
					ДатаРасчета = КонецДня(ДатаРасчета);
				КонецЕсли; 
				
				ТекСумма = СтрОстатокЧисло;
				ЕстьПросрочка = Ложь;
				Для каждого Стр Из тзОбщДолги Цикл
					Стр.ДатаСделки = КонецДня(Стр.Сделка.Дата);
					Стр.СрокОплатыЗадолженности = Стр.ДоговорВзаиморасчетов.СрокОплатыЗадолженности;
					Если Стр.ДоговорВзаиморасчетов.СрокОплатыЗадолженности > 0 Тогда
						Стр.ОплатитьДо = Стр.ДатаСделки+Число(СтрЗаменить(Стр.СрокОплатыЗадолженности,Символы.НПП,""))*86400;
						Если КонецДня(Стр.ОплатитьДо) < ДатаРасчета Тогда
							Стр.ПросроченнаяЗадолженность = Истина;
							ЕстьПросрочка = Истина;
						Иначе
							Стр.ПросроченнаяЗадолженность = Ложь;
						КонецЕсли; 
					Иначе
						Стр.ПросроченнаяЗадолженность = Ложь;
					КонецЕсли;
					ТекСумма = ТекСумма - Стр.Сумма;
					Если ТекСумма <= 0 Тогда
						Прервать;
					КонецЕсли; 
				КонецЦикла; 
				
				тзОбщДолги.Сортировать("ДатаСделки Убыв");
				
				Если ЕстьПросрочка Тогда
					Для каждого Стр Из тзОбщДолги Цикл
						Если Не обЗначениеНеЗаполнено(Стр.ПросроченнаяЗадолженность) Тогда
							Если Стр.ПросроченнаяЗадолженность Тогда
								Сообщить("Для контагента "+Контрагент+" по сделке "+Стр.Сделка+", на сумму "+Стр.Сделка.СуммаДокумента+" руб., отсрочка платежа составляет "+Стр.СрокОплатыЗадолженности+" дней и дата платежа "+Формат(Стр.ОплатитьДо,"ДЛФ=DD=D")+" просрочена.",СтатусСообщения.ОченьВажное);
							КонецЕсли; 
 						КонецЕсли; 
					КонецЦикла; 
				КонецЕсли; 		
				
			КонецЕсли; 		
			
		КонецЕсли; 		
		
	КонецЦикла; 
 
КонецПроцедуры
 