// процедура заполнения предопределенных элементов справочника
//
// Параметры:
// ЗаполнятьВсе - Булево - Признак заполнение всей информации
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	
	// !!!_Переход на ставку НДС 20%
	ТекущаяДата2019 = (ТекущаяДатаСеанса() >= Дата("20190101"));
	
	СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС.ПолучитьОбъект();
	Если ЗаполнятьВсе Тогда
		// !!!_Переход на ставку НДС 20%
		СтавкаНДС.Ставка = ?(ТекущаяДата2019, 20, 18);
	ИначеЕсли обЗначениеНеЗаполнено(СтавкаНДС.Ставка) Тогда
		// !!!_Переход на ставку НДС 20%
		Если ТекущаяДата2019 Тогда
			СтавкаНДС.Наименование = "20%";
			СтавкаНДС.Ставка = 20;
		Иначе
			СтавкаНДС.Ставка = 18;
		КонецЕсли;
	КонецЕсли;
	//Сохранение справочника
	НовыйЭлемент = СтавкаНДС.ЭтоНовый();
	Если СтавкаНДС.Модифицированность() Тогда
		Попытка		
			СтавкаНДС.Записать();
			Сообщить("Справочник ""Ставки НДС"". "+?(НовыйЭлемент,"Создан","Обновлен")+" элемент """+СокрЛП(СтавкаНДС.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДСРасчетная.ПолучитьОбъект();
	Если обЗначениеНеЗаполнено(СтавкаНДС.Ставка) Тогда
		СтавкаНДС.Наименование = "20/120";
		СтавкаНДС.Ставка = 20;
	КонецЕсли;
	
	//Сохранение справочника
	НовыйЭлемент = СтавкаНДС.ЭтоНовый();
	Если СтавкаНДС.Модифицированность() Тогда
		Попытка		
			СтавкаНДС.Записать();
			Сообщить("Справочник ""Ставки НДС"". "+?(НовыйЭлемент,"Создан","Обновлен")+" элемент """+СокрЛП(СтавкаНДС.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()
