// Модуль документа СписаниеТоваров

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем тКэшСуммСписания Экспорт;		// Переменная для кэширования результатов вычисления суммы списания
Перем ФлагПерерасчет;               // Переменная для обозначения того, что ведется перерасчет суммы документа
Перем ИмяРеквизитаКода Экспорт;     // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/артикула в ТЧ
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования
Перем ВедетсяБалансПоПодразделению Экспорт;		//Признак ведения баланса по подразделениям

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если обЗначениеНеЗаполнено(ДокументОснование) Тогда
	    Отказ = Истина;
	КонецЕсли; 
	
	Если обЗначениеНеЗаполнено(Автор) Тогда
		Отказ = Истина;
	КонецЕсли; 	
		
	Если обЗначениеНеЗаполнено(Автор.Сотрудник) Тогда
	   	Отказ = Истина;
	КонецЕсли; 
 	
	Движения.ЗамечанияАудитора.Очистить();
	Движение = Движения.ЗамечанияАудитора.Добавить();
	Движение.Период = Дата;
	Движение.Основание = ДокументОснование;
	Движение.Аудитор = Автор.Сотрудник;
	Движение.Сотрудник = ДокументОснование.Автор.Сотрудник;
	Движение.ТекстЗамечания = ТекстЗамечания;
	Движение.ПлановаяДатаУстранения=ПлановаяДатаУстранения;
	Движение.ФактическаяДатаУстранения=ФактическаяДатаУстранения;
	Движение.ЗамечаниеУстранено=ЗамечаниеУстранено;
	Движение.РекомендацияПоДемотивации=РекомендацияПоДемотивации;
	
	 
 
КонецПроцедуры // ОбработкаПроведения()


// Возвращает соответствие в котором перечислены виды номенклатуры, которые нельзя вводить
// в таблицу товаров. Если таких нет, то возвращает неопределено
//
// Возвращаемое значение:
//  Результат - соответствие.
//
Функция ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры() Экспорт
	Результат=Новый Соответствие();
	Результат.Вставить(Перечисления.ВидыНоменклатуры.Услуга,0);
	Возврат Результат;
КонецФункции // ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры()

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
 
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	ОбязательныеРеквизиты.Вставить("Автор",1);
 	ОбязательныеРеквизиты.Вставить("ВалютаДокумента",1);
	ОбязательныеРеквизиты.Вставить("КурсДокумента",1);
	ОбязательныеРеквизиты.Вставить("ДокументОснование",1);
	ОбязательныеРеквизиты.Вставить("ПлановаяДатаУстранения",1);
	ОбязательныеРеквизиты.Вставить("ХозОперация",1);
  	
	Возврат ОбязательныеРеквизиты;
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Проверяет корректность заполнения объекта.
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры:
//  Ошибки       - строка, в случае некорректного заполнения содержит описанием возникших ошибок, 
//  ДопРеквизиты - структура, на вход может быть передана структура с дополнительными реквизитами для проверки,
//  Заполнение   - булево, флаг проверки, 
//  Уникальность - булево, флаг проверки.
//
// Возвращаемое значение:
//  Булево - Возвращает Истина если все заполнено корректно и Ложь иначе.
// 
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
		// Здесь могут быть определены дополнительные к стандартным обязательным реквизитам условия проверки
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	
	// Проведем проверку соответствия организации документа организациям некоторых реквизитов документа.
	// Такую проверку необходимо осуществлять, если баланс в системе ведется по организации,
	// или если установлен способ контроля корректности
	// договора и склада документа. Причем, если способ контроля выбран "Контроль по организации и подразделению", то
	// дополнительно осуществляется проверка соответствия подразделений.
	Если Результат Тогда
		СпособКонтроляКорректности = обПраво("КонтрольКорректностиДоговораИСкладаДокумента", Права,,ЭтотОбъект);	
		КонтрольОтсутствует        = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольОтсутствует);
		БалансВедетсяПоОрганизации = (Константы.СпособВеденияБаланса.Получить()=Перечисления.СпособВеденияБаланса.ПоОрганизации);

		Если БалансВедетсяПоОрганизации ИЛИ НЕ КонтрольОтсутствует Тогда
			КонтрольПоПодразделению = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольПоОрганизацииИПодразделению);
						
			КонтролируемыеРеквизиты = Новый Структура();			
			КонтролируемыеРеквизитыШапки = Новый Структура();			
			//Если ХозОперация=Справочники.ХозОперации.СписаниеТоваровОтданныхНаКомиссию Тогда
			//	КонтролируемыеРеквизитыШапки.Вставить("ДоговорВзаиморасчетов", КонтрольПоПодразделению);
			//Иначе
			//	КонтролируемыеРеквизитыШапки.Вставить("СкладКомпании", КонтрольПоПодразделению);
			//КонецЕсли;      			
			//КонтролируемыеРеквизиты.Вставить("КонтролируемыеРеквизитыШапки",КонтролируемыеРеквизитыШапки);
			
 			
			Результат = дкПроверитьКорректностьПоОрганизации(ЭтотОбъект,КонтролируемыеРеквизиты,Ошибки) И Результат;
		КонецЕсли;  		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции // ПроверитьКорректность()
 
// Функция проверяет, допустимо ли изменение объекта
//
// Параметры:
//  БлокироватьРеквизиты - структура, структура блокируемых на изменение реквизитов.
//
// Возвращаемое значение:
// Булево - Возвращает Истина, если изменения возможны, ложь иначе
//          Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
//
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции // ДоступностьИзменения()

// Возвращает список возможных хозяйственных операций документа
// Возвращаемое значение: 
//  СписокЗначений. 
//  Строка списка: Значение - имя предопределенного элемента; 
//				   Представление - красивое его представление
// 				   "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("ЗамечаниеАудитора","Замечание аудитора",Истина);
 	Возврат СписокХозОпераций;
КонецФункции // ПолучитьСписокХозОпераций()

// у нас не стандартная таблица, поэтому сформирует свой результат запроса по товарам
//
// Параметры:
//  ШапкаДокумента - выборка.
//
Функция ПолучитьРезультатЗапросаПоТоварам(ШапкаДокумента)
    ТекстЗапроса="ВЫБРАТЬ
                 |	СписаниеТоваровТовары.Номенклатура КАК Номенклатура,
                 |	СписаниеТоваровТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
                 |	СписаниеТоваровТовары.Партия КАК Партия,
                 |	СписаниеТоваровТовары.Количество * СписаниеТоваровТовары.Коэффициент КАК Количество
                 |ИЗ
                 |	Документ.СписаниеТМЦ.Товары КАК СписаниеТоваровТовары
                 |ГДЕ
                 |	СписаниеТоваровТовары.Ссылка = &Ссылка";

	Запрос=Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка",ШапкаДокумента.Ссылка);
	Запрос.Текст=ТекстЗапроса;

	Возврат Запрос.Выполнить();
КонецФункции // ПолучитьРезультатЗапросаПоТоварам()

// возвращает выборку по шапке
//
// Параметры:
//  ДокументСсылка - Ссылка на документ для которого получаем шапку.
//
// Возвращаемое значение:
//  Выборка - выборка по шапке
//
Функция ПолучитьШапкуДокумента(ДокументСсылка)
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	Док.Ссылка                КАК Ссылка,
	|	Док.Дата                  КАК Дата,
	|	Док.ВалютаДокумента       КАК ВалютаДокумента,
	|	Док.КурсДокумента         КАК КурсДокумента,
	|	Док.ТипЦен                КАК ТипЦен,
	|	Док.ХозОперация           КАК ХозОперация,
 	|	Док.МоментВремени         КАК МоментВремени,
	|	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
 	|	Док.ДилерскийЦентр        КАК ДилерскийЦентр,
  	|	Док.ДокументОснование     КАК ДокументОснование
 	|
	|ИЗ
	|	Документ."+Метаданные().Имя+" КАК Док
	|
	|ГДЕ
	|	Док.Ссылка=&Ссылка
	|");
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	Выборка=Запрос.Выполнить().Выбрать(); Выборка.Следующий();
	
	Возврат Выборка;
КонецФункции // ПолучитьШапкуДокумента()

// формирует движения документа по партионным регистрам
//
// Параметры:
//  Режим           - режим проведения (оперативный/неоперативный)
//  ДокументСсылка  - ссылка на документ который надо допровести по партиям
//
// Возвращаемое значение:
//  Возвращает Истина - все ОК, ложь - чего-то не так
//
Функция ПровестиПоПартиям(Режим,ДокументСсылка) Экспорт
	//Отказ=Ложь;
	//
	// // получим шапку документа
	//ШапкаДокумента=ПолучитьШапкуДокумента(ДокументСсылка);
	//
	//// у нас нестандартная таблица, поэтому сформирует свой результат запроса по товарам
	//
	//РезультатЗапросаПоТоварам=ПолучитьРезультатЗапросаПоТоварам(ШапкаДокумента);
	//// определим вид проводки
	//Если ШапкаДокумента.ХозОперация=Справочники.ХозОперации.СписаниеТоваров Тогда
	//	// списываем
	// 	НаборЗаписейПартии.ДокументОбъект = ЭтотОбъект;
	//  	НаборЗаписейПартии.РезультатЗапросаПоТоварам = РезультатЗапросаПоТоварам;
	//	НаборЗаписейПартии.ШапкаДокумента            = ШапкаДокумента;
	//	Отказ=НЕ НаборЗаписейПартии.Расход() ИЛИ Отказ;
	//	Если НЕ Отказ Тогда 
	//		НаборЗаписейПартии.Записать(); 
	//	КонецЕсли; 
	//  	
	//КонецЕсли;
	//
	// Возврат НЕ Отказ;
КонецФункции // ПровестиПоПартиям()

// Расчет суммы документа
Функция РассчитатьСуммуВсего()Экспорт
	//СуммаВсего = дкПолучитьСуммуСписания(ЭтотОбъект, ?(ХозОперация = Справочники.ХозОперации.СписаниеТоваровОтданныхНаКомиссию, "ПартииТоваровОтданные" , "ПартииТоваровКомпании"),тКэшСуммСписания);
	//Возврат СуммаВсего;
КонецФункции // РассчитатьСуммуВсего()

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка – Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	– Форма	 – Ссылка на форму документа. Если значение неопределено,
//                         производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	// ОБРАБОТКА РЕКВИЗИТОВ ДОКУМЕНТА
	Если Имя="Товары.Номенклатура" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		ТекСтрока.Коэффициент = ТекСтрока.ЕдиницаИзмерения.Коэффициент;
 	ИначеЕсли Имя="Товары.ЕдиницаИзмерения" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		ТекСтрока.Коэффициент = ТекСтрока.ЕдиницаИзмерения.Коэффициент;
  	Иначе Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()

// заполнение свойств из документа основания
Процедура ЗаполнитьСвойстваНаОсновании(Основание) Экспорт
 //зарезервировано для описания заполнения свойств из свойств основания
КонецПроцедуры

// Заполняет на основании заказа
//
// Параметры:
//  ЗаказПокупателя - ДокументСсылка.
//
Процедура ЗаполнитьТоварыОстатками(Основание) Экспорт
КонецПроцедуры // ЗаполнитьОстаткамиПоПартии()

#Если Клиент Тогда
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

//Функция печати этикеток и ценников
// 
// Параметры:
//  ТабДокумент - табличный документ.
//
Функция ПечатьЭтикетокИЦенников(ТабДокумент) Экспорт
	дкПечатьЭтикетокИЦенников(ЭтотОбъект);
КонецФункции // ПечатьЭтикетокИЦенников()

Функция ПолучитьТаблицуДвиженийДока() 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗамечанияАудитора.Период,
	|	ЗамечанияАудитора.Регистратор,
	|	ЗамечанияАудитора.НомерСтроки,
	|	ЗамечанияАудитора.Активность,
	|	ЗамечанияАудитора.Основание,
	|	ЗамечанияАудитора.Аудитор,
	|	ЗамечанияАудитора.ТекстЗамечания
	|ИЗ
	|	РегистрСведений.ЗамечанияАудитора КАК ЗамечанияАудитора
	|ГДЕ
	|	ЗамечанияАудитора.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);  
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Формирует печатную форму "СписаниеТоваров"
// 
// Параметры:
//  ТабДокумент - табличный документ.
//
// Возвращаемое значение:
//  ТабДокумент - возвращает сформированный табличный документ.
//
Функция ПечатьСписаниеТоваров(ТабДокумент) Экспорт
	
	ТЗ_Движений = Новый ТаблицаЗначений;
	
 	ТЗ_Движений = ПолучитьТаблицуДвиженийДока();
	
	//ТЗ_Движений.ВыбратьСтроку();
	
 	Макет = ПолучитьМакет("СписаниеТоваров");
	
	//для начала настроим макет
	ОбластьШапкаТаблицы = дкПривестиМакетПечатнойФормы(ЭтотОбъект,Макет);
	ФорматВыводаСуммы	= обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
	
	//вывод заголовка документа
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
	ТекстЗаголовка = дкПолучитьПредставление(ЭтотОбъект);
	ОбластьМакета.Параметры.ТекстЗаголовка				= ТекстЗаголовка;
	
  	
	Если НЕ обЗначениеНеЗаполнено(ПодразделениеКомпании) И НЕ обЗначениеНеЗаполнено(ПодразделениеКомпании.КПП) Тогда
		СтрокаПредставления = спПолучитьПредставление(Организация);
		ОбластьМакета.Параметры.ПредставлениеОрганизации = СтрЗаменить(СтрокаПредставления, Организация.КПП, ПодразделениеКомпании.КПП);
	Иначе	
	    ОбластьМакета.Параметры.ПредставлениеОрганизации = спПолучитьПредставление(Организация);
	КонецЕсли;
	ОбластьМакета.Параметры.ПредставлениеПодразделения	= спПолучитьНаименование(ПодразделениеКомпании);
 	//вывод свойств
	СтрокаСвойств = дкПолучитьСтрокуСвойствДокумента(ЭтотОбъект);
	ОбластьМакета.Параметры.СтрокаСвойств = СтрокаСвойств;
	ТабДокумент.Вывести(ОбластьМакета);
	
	НомерСтраницы = 2;
	НомерСтраницыПред = НомерСтраницы;
	
	//теперь выводим шапку
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	//готовим области строки
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
	СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента,СуммаВсего",ВалютаДокумента,0);
	//заполним параметры шапки таблицы для следующего листа
	ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ИмяРегистра =  "ТМЦпереданныеСотрудникам";
	
	//перебор строк
	ВыборкаТабличнойЧасти = ЭтотОбъект.Товары;
	Для каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
		//заполняем данные строки
		СтруктураСтроки = дкПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТабличнойЧасти,ЭтотОбъект);
		
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",СтрокаТабличнойЧасти.Номенклатура);
		
		НайдСтроки = ТЗ_Движений.НайтиСтроки(Отбор);
		
		Сумма = 0;
		
		Если НайдСтроки.Количество() > 0 Тогда
			Попытка
				Сумма = НайдСтроки[0].Сумма;	
			Исключение
				//
			КонецПопытки;	
		КонецЕсли;	
 		
		//Сумма = дкПолучитьСуммуСписания(ЭтотОбъект, ИмяРегистра, тКэшСуммСписания, 
		//		СтрокаТабличнойЧасти.Номенклатура, 
		//		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, 
		//		СтрокаТабличнойЧасти.НомерСтроки);
		Цена  = Сумма / СтрокаТабличнойЧасти.Количество / СтрокаТабличнойЧасти.Коэффициент;
		
		СтруктураСтроки.Вставить("Цена",		Формат(Цена,  ФорматВыводаСуммы));
		СтруктураСтроки.Вставить("СуммаВсего",	Формат(Сумма, ФорматВыводаСуммы));
		ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);
		
		//доп. области
		мсвДопОбластиПодвала = Неопределено;
		Если ВыборкаТабличнойЧасти.Индекс(СтрокаТабличнойЧасти) = ВыборкаТабличнойЧасти.Количество()-1 Тогда
			мсвДопОбластиПодвала = Новый Массив;
			мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
		КонецЕсли;
		
		//выводим строку, делая проверку попадания на лист
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице,
			НомерСтраницы, СтруктураИтоговПоСтранице, ЭтотОбъект, мсвДопОбластиПодвала);
		
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента,СуммаВсего",ВалютаДокумента,0);
			НомерСтраницыПред = НомерСтраницы;
			ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли;
		//добавляем итоги
		СтруктураСтроки.Вставить("СуммаВсего", Сумма); // чтобы округление не сказалось на итоговой сумме
		дкДобавитьИтогиПоСтранице(СтруктураСтроки,СтруктураИтоговПоСтранице);
		
	КонецЦикла;
	
	//выводим последний подвал, если страниц больше единицы
	Если НомерСтраницы > 2 Тогда
		дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьМакетаИтогоПоСтранице,СтруктураИтоговПоСтранице,ЭтотОбъект);
	КонецЕсли;	
	
	//итоги
	ОбластьПодвал.Параметры.ВалютаДокумента = ВалютаДокумента;
	//СуммаВсего = дкПолучитьСуммуСписания(ЭтотОбъект, ИмяРегистра, тКэшСуммСписания);
	СуммаВсего = ТЗ_Движений.Итог("Сумма");
	ОбластьПодвал.Параметры.СуммаВсего = Формат(СуммаВсего, ФорматВыводаСуммы);
	ОбластьПодвал.Параметры.СуммаПрописью = "Всего наименований " + ВыборкаТабличнойЧасти.Количество()
		+" на сумму " + обЧислоПрописью(СуммаВсего,ЭтотОбъект.ВалютаДокумента);
	
	// Выводим представления и расшифровки подписей
	Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
	Отпустил.ОтпустилПредставление = ?(обЗначениеНеЗаполнено(Отпустил.Отпустил),"","/ "+ Отпустил.ОтпустилПредставление);
	ОбластьПодвал.Параметры.Заполнить(Отпустил);
	Получил  = дкОтветственноеЛицо(ЭтотОбъект,"Получил");
	Получил.ПолучилПредставление = ?(обЗначениеНеЗаполнено(Получил.Получил),"","/ "+ Получил.ПолучилПредставление);
	ОбластьПодвал.Параметры.Заполнить(Получил);
	
	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвал, , , НомерСтраницы,,ЭтотОбъект);
	
	Возврат ТабДокумент;
КонецФункции // ПечатьСписаниеТоваров()

// Формирует печатную форму "ТОРГ16"
// 
// Параметры:
//  ТабДокумент - табличный документ.
//
// Возвращаемое значение:
//  ТабДокумент - возвращает сформированный табличный документ.
//
Функция ПечатьТОРГ16(ТабДокумент) Экспорт
    ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
	ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества",Права,,ЭтотОбъект);
	
	
	ТекстЗаголовка = дкПолучитьПредставление(ЭтотОбъект);
	
	ВалютаРегл = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	ВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	
	Макет = ПолучитьМакет("ТОРГ16локал");

	СтруктураПредставления = Новый Структура(
		"Наименование,ИНН,АдресЮридический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		"","ИНН ","","тел.: ","р/с ","в банке ","БИК ","к/с ");
	
	// Выводим общие реквизиты шапки
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
	ОбластьМакета.Параметры.ОрганизацияПредставление = спПолучитьПредставление(Организация, СтруктураПредставления);
	ОбластьМакета.Параметры.ОрганизацияПоОКПО		 = Организация.КодПоОКПО;
	Руководитель = дкОтветственноеЛицо(ЭтотОбъект, Перечисления.ВидыОбъектовСведений.Руководитель);
	ОбластьМакета.Параметры.Заполнить(Руководитель);
	ОбластьМакета.Параметры.Номер = дкПолучитьНомерДляПечати(ЭтотОбъект);
	ТабДокумент.Вывести(ОбластьМакета);

	Если ХозОперация = Справочники.ХозОперации.СписаниеТоваров Тогда  
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ПартииТоваровКомпании.НомерСтроки,
		               |	ПартииТоваровКомпании.ДилерскийЦентр,
 		               |	ПартииТоваровКомпании.Номенклатура,
		               |	ПРЕДСТАВЛЕНИЕ(ПартииТоваровКомпании.Номенклатура) КАК НоменклатураПредставление,
		               |	ПартииТоваровКомпании.ПартияТМЦ,
		               |	ПартииТоваровКомпании.Количество,
		               |	ПартииТоваровКомпании.Сумма
		               |ИЗ
		               |	РегистрНакопления.ТМЦПереданныеСотрудникам КАК ПартииТоваровКомпании
		               |ГДЕ
		               |	ПартииТоваровКомпании.Регистратор = &Регистратор";
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Регистратор", Ссылка);
		ВыборкаСтрокТовары = Запрос.Выполнить().Выгрузить();
		ВыборкаСтрокТовары.Колонки.Добавить("Цена");
		ПростоеСписание = Истина;
 	Иначе
		Сообщить("Неправильный вид хозяйственной операции.");
		Возврат Неопределено;
		
	КонецЕсли; 
	
	//определимся откуда будем брать многострочную часть документа
	//если движения есть, то из регистра иначе из табличной части документа
	ЕстьДвиженияПоРегистру = Ложь;
	КоличествоСтрок = ВыборкаСтрокТовары.Количество();
	Если КоличествоСтрок > 0 Тогда
		ЕстьДвиженияПоРегистру = Истина;
	Иначе
		Сообщить("Документ не проведен по партионному регистру. Отображение партий невозможно.");
		Возврат Неопределено;
		
	  //ВыборкаСтрокТовары = Товары.Выгрузить();
	  //  ВыборкаСтрокТовары.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	  //  ВыборкаСтрокТовары.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	  //  ВыборкаСтрокТовары.Колонки.Добавить("НоменклатураПредставление", Новый ОписаниеТипов("Строка"));
	  //  ВыборкаСтрокТовары.Колонки.Добавить("ХарактеристикаНоменклатурыПредставление", Новый ОписаниеТипов("Строка"));
		
	КонецЕсли; 
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицыПервогоЛиста");
	ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтраницеПервогоЛиста");
	
	НомерСтраницы = 2;
	НомерСтраницыПред = НомерСтраницы;
	
	//теперь выводим шапку
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
	
	////таблица партий - преобразование
	//тблПартий = ВыборкаСтрокТовары.Скопировать();
	//Если ЕстьДвиженияПоРегистру И НЕ ПростоеСписание Тогда
	//	Попытка
	//		тблПартий.Колонки.Партия.Имя = "ПартияСтарый";
	//	Исключение КонецПопытки; 
	//	тблПартий.Колонки.ДокументПередачи.Имя = "Партия";
	//КонецЕсли;
	//тблПартий.Колонки.Добавить("ДатаПоступленияТовара", Новый ОписаниеТипов("Дата"));
	//тблПартий.Колонки.Добавить("ТоварнаяНакладнаяНомер", Новый ОписаниеТипов("Строка"));
	//тблПартий.Колонки.Добавить("ТоварнаяНакладнаяДата", Новый ОписаниеТипов("Дата"));
	//тблПартий.Колонки.Добавить("ДатаСписанияТовара", Новый ОписаниеТипов("Дата"));
	//Для Каждого ТекПартия Из тблПартий Цикл
	//	ТекПартия.ДатаСписанияТовара = Дата;
	//	Если ТекПартия.Партия <> Неопределено Тогда
	//		ТекПартия.ДатаПоступленияТовара = ТекПартия.Партия.Дата;
	//		ТекПартия.ТоварнаяНакладнаяНомер = ТекПартия.Партия.Номер;
	//		ТекПартия.ТоварнаяНакладнаяДата = ТекПартия.Партия.Дата; //OkoE - а так ли это? //тут вопрос о разнице ДатаПоступленияТовара и ТоварнаяНакладнаяДата KOZT
	//	КонецЕсли;
	//КонецЦикла;
	//тблПартий.Сортировать("ДатаПоступленияТовара, ДатаСписанияТовара, ТоварнаяНакладнаяДата");
	//
	//ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПервогоЛиста");
	//Для каждого СтрокаПартия Из тблПартий Цикл
	//	ОбластьМакета.Параметры.Заполнить(СтрокаПартия);

	//	//выводим строку, делая проверку попадания на лист
	//	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице,
	//		НомерСтраницы, , ЭтотОбъект);
	//		
	//	//инициализация итогов по странице
	//	Если НомерСтраницы <> НомерСтраницыПред Тогда
	//		НомерСтраницыПред = НомерСтраницы;
	//		ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
	//	КонецЕсли;
	//КонецЦикла;
	//
	//ТабДокумент.Вывести(ОбластьМакетаИтогоПоСтранице);
	//	
	//ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицыВторогоЛиста");
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаВторогоЛиста");
	ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
	ОбластьМакетаИтого = Макет.ПолучитьОбласть("Итого");
	
	НомерСтраницы = 2;
	НомерСтраницыПред = НомерСтраницы;
	
	//теперь выводим шапку
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
	
	СтруктураИтоговПоСтранице = Новый Структура("Сумма", 0);
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	// Определим, что показывать в колонке кода - код или артикул
	ИмяКолонкиКода = дкПолучитьПараметрыРежимаВыводаКодаВДокументах(,ЭтотОбъект).Имя;
	
	СуммаПечатногоДокумента = 0;
	
	// Выводим многострочную часть документа
	Для Каждого СтрокаТовар Из ВыборкаСтрокТовары Цикл
		Если ЕстьДвиженияПоРегистру Тогда
			Если ПростоеСписание Тогда
 				СтрокаТовар.Цена = СтрокаТовар.Сумма / СтрокаТовар.Количество;
 			Иначе
				СтрокаТовар.Цена = СтрокаТовар.Сумма / СтрокаТовар.Количество;
			КонецЕсли; 
		Иначе
			СтрокаТовар.НоменклатураПредставление = Строка(СтрокаТовар.Номенклатура);
			СтрокаТовар.ХарактеристикаНоменклатурыПредставление = Строка(СтрокаТовар.ХарактеристикаНоменклатуры);
			СтрокаТовар.Цена = СтрокаТовар.ЦенаРозничная;
			СтрокаТовар.Сумма = СтрокаТовар.ЦенаРозничная * СтрокаТовар.Количество;
			Если ВалютаДокумента <> ВалютаРегл Тогда
				СтрокаТовар.Сумма = обПересчет(СтрокаТовар.Сумма, ВалютаДокумента, Дата, ВалютаРегл, Дата);
				СтрокаТовар.Цена = обПересчет(СтрокаТовар.Цена, ВалютаДокумента, Дата, ВалютаРегл, Дата);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Для каждого СтрокаТовар Из ВыборкаСтрокТовары Цикл
        ОбластьМакета.Параметры.Заполнить(СтрокаТовар);
		ОбластьМакета.Параметры.ТоварНаименование = СтрокаТовар.НоменклатураПредставление;
 		ОбластьМакета.Параметры.ТоварКод = дкПолучитьЗначениеКолонкиКода(СтрокаТовар.Номенклатура, ИмяКолонкиКода, ЭтотОбъект);
		ОбластьМакета.Параметры.КоличествоМест = Формат(СтрокаТовар.Количество,ФорматВыводаКоличества);
		ОбластьМакета.Параметры.Цена = Формат(СтрокаТовар.Цена,ФорматВыводаСуммы);
		ОбластьМакета.Параметры.Сумма = Формат(СтрокаТовар.Сумма,ФорматВыводаСуммы);
		
		Если ЕстьДвиженияПоРегистру Тогда
			ОбластьМакета.Параметры.ЕдиницаИзмерения = СтрокаТовар.Номенклатура.БазоваяЕдиницаИзмерения;	
			ОбластьМакета.Параметры.ЕдиницаИзмеренияКодПоОКЕИ = СтрокаТовар.Номенклатура.БазоваяЕдиницаИзмерения.Код;
		Иначе
			ОбластьМакета.Параметры.ЕдиницаИзмерения = СтрокаТовар.ЕдиницаИзмерения;
			ОбластьМакета.Параметры.ЕдиницаИзмеренияКодПоОКЕИ = СтрокаТовар.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;
		КонецЕсли;
		 
		//доп. области
		мсвДопОбластиПодвала = Неопределено;
		Если ВыборкаСтрокТовары.Индекс(СтрокаТовар) = ВыборкаСтрокТовары.Количество()-1 Тогда
			мсвДопОбластиПодвала = Новый Массив;
			мсвДопОбластиПодвала.Добавить(ОбластьМакетаИтого);
			мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
		КонецЕсли;
		
		//выводим строку, делая проверку попадания на лист
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице,
			НомерСтраницы, СтруктураИтоговПоСтранице, ЭтотОбъект, мсвДопОбластиПодвала);
		
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			СтруктураИтоговПоСтранице = Новый Структура("Сумма", 0);
			НомерСтраницыПред = НомерСтраницы;
			ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли;
		
		//добавляем итоги
		дкДобавитьИтогиПоСтранице(СтрокаТовар, СтруктураИтоговПоСтранице);
	КонецЦикла;

	//выводим последний подвал, если страниц больше единицы
	Если НомерСтраницы > 2 Тогда
		дкВывестиИтогиПоСтранице(ТабДокумент, ОбластьМакетаИтого, СтруктураИтоговПоСтранице, ЭтотОбъект);
	КонецЕсли;
	
	// Выводим итоги по документу в общем
	СуммаИтого = ВыборкаСтрокТовары.Итог("Сумма");
	ОбластьМакетаИтого.Параметры.Сумма = Формат(СуммаИтого, ФорматВыводаСуммы);
	ТабДокумент.Вывести(ОбластьМакетаИтого);

	// Выводим подвал документа
	ОбластьПодвал.Параметры.Заполнить(ЭтотОбъект);
	// форма регламентированная, все суммы в руб., итого - тоже в руб.
	ОбластьПодвал.Параметры.СуммаСписанияПрописью = обЧислоПрописью(СуммаИтого, Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить());
	
	// Комиссия
	ПредседательКомиссии= дкОтветственноеЛицо(ЭтотОбъект, "ПредседательКомиссии");	
	ЧленКомиссии1		= дкОтветственноеЛицо(ЭтотОбъект, "ЧленКомиссии1");
	ЧленКомиссии2		= дкОтветственноеЛицо(ЭтотОбъект, "ЧленКомиссии2");
	МОЛ					= дкОтветственноеЛицо(ЭтотОбъект, Перечисления.ВидыОбъектовСведений.МОЛ);
	ОбластьПодвал.Параметры.Заполнить(ПредседательКомиссии);
	ОбластьПодвал.Параметры.Заполнить(ЧленКомиссии1);
	ОбластьПодвал.Параметры.Заполнить(ЧленКомиссии2);
	ОбластьПодвал.Параметры.Заполнить(МОЛ);
	
	ТабДокумент.Вывести(ОбластьПодвал);

	Возврат ТабДокумент;
КонецФункции // ПечатьТОРГ16()

// Функция осуществляет печать произвольного документа.
// Можно направить печать на экран или принтер, а также распечатать необходимое количество копий.
//
// Параметры:
//	ЭтотОбъект							- ДокументОбъект	- Документ для печати
//	НазваниеПечатнойФормы 				- Строка			- Название печатной формы, если пусто, то по умолчанию
//	КоличествоЭкземпляров				- Число				- Количество экземпляров документа
//	НаПринтер							- Булево			- Признак отправки документа на принтер без отображения его на экране
//  Документ 	  						- ТабличныйДокумент	- Макет печатной формы
//
// Возвращаемое значение:
//   ТабличныйДокумент	- Сформированная печатная форма
//
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции // Печать()

// Возвращает доступные варианты печати документа
// Возвращаемое значение: 
//  Структура, каждая строка которой
//  соответствует одному из вариантов печати
//  Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм() Экспорт
	СтруктураМакетов=Новый Структура();
	//СтруктураМакетов.Вставить("СписаниеТоваров", "Акт списания товаров");
	//СтруктураМакетов.Вставить("ТОРГ16", "ТОРГ-16 (Акт о списании товаров)");
	//СтруктураМакетов.Вставить("ЭтикетокИЦенников", "Печать этикеток и ценников");
	Возврат СтруктураМакетов;
КонецФункции // ПолучитьСписокПечатныхФорм()

#КонецЕсли
// Если Клиент Тогда - завершена клиентская часть


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Процедура - обработчик ввода на основании
Процедура ОбработкаЗаполнения(Основание) Экспорт
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Автор = Основание.Автор;
		ВалютаДокумента = Основание.ВалютаДокумента;
		ДатаОперации = Основание.ДатаОперации;
		ДатаСоздания = Основание.ДатаСоздания;
		Комментарий = Основание.Комментарий;
		КурсДокумента = Основание.КурсДокумента;
		Организация = Основание.Организация;
		ПодразделениеКомпании = Основание.ПодразделениеКомпании;
		СуммаДокумента = Основание.СуммаДокумента;
		ТипЦен = Основание.ТипЦен;
		ХозОперация = Справочники.ХозОперации.ЗамечаниеАудитора;
		ДокументОснование = Основание;
		ДилерскийЦентр = Основание.ПодразделениеКомпании.ДилерскийЦентр;
		Сотрудник = Основание.Автор.Сотрудник;
		//Бондаренко++ 20180515	
	Иначе
		Попытка Автор = Основание.Автор;Исключение	КонецПопытки; 
		Попытка ВалютаДокумента = Основание.ВалютаДокумента;Исключение	КонецПопытки; 
		Попытка ДатаОперации = Основание.ДатаОперации;Исключение	КонецПопытки; 
		Попытка ДатаСоздания = Основание.ДатаСоздания;Исключение	КонецПопытки; 
		Попытка Комментарий = Основание.Комментарий;Исключение	КонецПопытки; 
		Попытка КурсДокумента = Основание.КурсДокумента;Исключение	КонецПопытки; 
		Попытка Организация = Основание.Организация;Исключение	КонецПопытки; 
		Попытка ПодразделениеКомпании = Основание.ПодразделениеКомпании;Исключение	КонецПопытки; 
		Попытка СуммаДокумента = Основание.СуммаДокумента;Исключение	КонецПопытки; 
		Попытка ТипЦен = Основание.ТипЦен;Исключение	КонецПопытки; 
		Попытка ХозОперация = Справочники.ХозОперации.ЗамечаниеАудитора;Исключение	КонецПопытки; 
		Попытка ДокументОснование = Основание;Исключение	КонецПопытки; 
		Попытка ДилерскийЦентр = Основание.ПодразделениеКомпании.ДилерскийЦентр;Исключение	КонецПопытки; 
		Попытка Сотрудник = Основание.Автор.Сотрудник;Исключение	КонецПопытки; 
		//Бондаренко++ 20180515		
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.РабочийЛист") Тогда
		СтатусИсходный = Основание.Статус;
		ПричинаОтказаИсходная = Основание.ПричинаОтказа;
 	КонецЕсли;
	
	//Запрос = Новый Запрос;
	//
	//Запрос.Текст = 	"ВЫБРАТЬ
	//               	|	ПраваИНастройки.Значение
	//               	|ИЗ
	//               	|	РегистрСведений.ПраваИНастройки КАК ПраваИНастройки
	//               	|ГДЕ
	//               	|	ПраваИНастройки.Объект = &Объект
	//               	|	И ПраваИНастройки.ПравоНастройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ПраваИНастройки.ВводНаОснованииПроведенныхДокументов)";
	//
	//Запрос.УстановитьПараметр("Объект", ПараметрыСеанса.Пользователь);
	//ВыборкаНастроек = Запрос.Выполнить().Выбрать();
	//
	//Если ВыборкаНастроек.Следующий() Тогда
	//	Если ВыборкаНастроек.Значение = Истина Тогда  
	// 		РегистрыСведений.ПраваИНастройки.СоздатьМенеджерЗаписи();
	//	КонецЕсли;
	//КонецЕсли;	
 	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриКопировании()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Результат = Истина;
	ДополнительныеСвойства.Вставить("СкладКомпанииБыл");
	ДополнительныеСвойства.Вставить("ЗаказБыл");
	ДополнительныеСвойства.Вставить("МоментВремениБыл");
	
	Если НЕ ФлагПерерасчет Тогда
		Результат = дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	КонецЕсли;
	ФлагПерерасчет = Ложь;
	Если НЕ Результат Тогда Возврат; КонецЕсли; 
	
	// получим старые значения, влияющие на границы последовательности
	Если НЕ Отказ И Проведен И РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		
		БылиДвижения = Ложь;
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		// партии
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ СкладКомпании ИЗ РегистрНакопления.ПартииТоваровКомпании ГДЕ Регистратор=&Ссылка";
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			БылиДвижения = Истина;
			ДополнительныеСвойства.Вставить("СкладКомпанииБыл", Результат.Выгрузить().ВыгрузитьКолонку("СкладКомпании"));
		КонецЕсли;
		
		// Заказы
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ Заказ  ИЗ РегистрНакопления.ЗаказыПокупателей ГДЕ Регистратор = &Ссылка";
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			БылиДвижения = Истина;
			ДополнительныеСвойства.Вставить("ЗаказБыл", Результат.Выгрузить().ВыгрузитьКолонку("Заказ"));
		КонецЕсли;
		
		// прошлый момент времени
		Если БылиДвижения Тогда
			Запрос.Текст = "ВЫБРАТЬ МоментВремени ИЗ Документ."+Метаданные().Имя+" ГДЕ Ссылка=&Ссылка";
			ДополнительныеСвойства.Вставить("МоментВремениБыл",Запрос.Выполнить().Выгрузить().Получить(0).МоментВремени);
		КонецЕсли;
		
	КонецЕсли;
	
	// +++++ Соколмоторс +++++
	Если ЭтоНовый() И НЕ Отказ Тогда
		НомерДляЖурнала = РегистрыСведений.НумерацияСкладскихДокументов.УстановитьНовыйНомер(ТекущаяДата());
	КонецЕсли;
	// ----- Соколмоторс -----
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриЗаписи()

Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	Если НЕ Отказ Тогда
		тКэшСуммСписания = Неопределено;
		СуммаДокумента = 0;
	КонецЕсли;	
КонецПроцедуры // ОбработкаУдаленияПроведения()

 
Функция ПолучитьТаблицуТоваров()
	
	ТекстЗапроса="ВЫБРАТЬ
                 |	СписаниеТоваровТовары.Номенклатура КАК Номенклатура,
                 |	СписаниеТоваровТовары.Количество * СписаниеТоваровТовары.Коэффициент КАК Количество
                 |ИЗ
                 |	Документ.СписаниеТМЦ.Товары КАК СписаниеТоваровТовары
                 |ГДЕ
                 |	СписаниеТоваровТовары.Ссылка = &Ссылка";

	Запрос=Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст=ТекстЗапроса;

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьТаблицуОстатковПартий(Сотрудник,ДилерскийЦентр,СЗ_Товаров)
	
	//ТекстЗапроса="ВЫБРАТЬ
	//             |	ТМЦПереданныеСотрудникамОстатки.Сотрудник КАК Сотрудник,
	//             |	ТМЦПереданныеСотрудникамОстатки.ДилерскийЦентр КАК ДилерскийЦентр,
	//             |	ТМЦПереданныеСотрудникамОстатки.Номенклатура КАК Номенклатура,
	//             |	ТМЦПереданныеСотрудникамОстатки.ПартияТМЦ КАК ПартияТМЦ,
	//             |	ТМЦПереданныеСотрудникамОстатки.КоличествоОстаток КАК КоличествоОстаток,
	//             |	ТМЦПереданныеСотрудникамОстатки.СуммаОстаток КАК СуммаОстаток
	//             |ИЗ
	//             |	РегистрНакопления.ТМЦПереданныеСотрудникам.Остатки(
	//             |			&МоментВремени,
	//             |			Сотрудник = &ВыбСотрудник
	//             |				И ДилерскийЦентр = &ВыбДилерскийЦентр
	//             |				И Номенклатура В (&ВыбСписокНоменклатура)) КАК ТМЦПереданныеСотрудникамОстатки";

	//Запрос=Новый Запрос();
	//Запрос.УстановитьПараметр("МоментВремени",?(обЗначениеНеЗаполнено(Ссылка.Дата),ТекущаяДата(),Ссылка.Дата));
	//Запрос.УстановитьПараметр("ВыбСотрудник",Сотрудник);
	//Запрос.УстановитьПараметр("ВыбДилерскийЦентр",ДилерскийЦентр);
	//Запрос.УстановитьПараметр("ВыбСписокНоменклатура",СЗ_Товаров);
	//Запрос.Текст=ТекстЗапроса;

	//Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции



////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
//Права = глПрава;
#КонецЕсли
ФлагПерерасчет = Ложь;
ВедетсяБалансПоПодразделению=(Константы.СпособВеденияБаланса.Получить()=Перечисления.СпособВеденияБаланса.ПоПодразделению);
