Перем Тестирование Экспорт;				// Признак естирования
Перем МассивССТипов Экспорт;            // массив типов
Перем ОписаниеТиповДляВыбора Экспорт;	// описание типов
Перем login Экспорт;                    // логин для соединением с сервером
Перем password Экспорт;					// пароль для соединения с сервером
Перем ФормаДока Экспорт;				// форма загруженного документа

///////////////////////////////////////////////////////////
// ГЛАВНОЕ

// Функция осуществляет инициализацию списка заданий
// посредством отправки запроса на сервер
//
// Параметры:
// datefrom - дата начала
// dateto - дата окончания
// tab - фильтр списка дел
//
// Возвращаемое значение - список дел
//
Функция ИнициализацияСписка(datefrom, dateto, tab) Экспорт
	
	Попытка
		Библиотека = Новый COMОбъект("Auda.Saxif");
		
		// Свойство Test может принимать значения «true» и «false». В случае использования
		// тестовых учетных записей следует установить значение в «true». По умолчанию имеет значение «false»
		//Библиотека.Test = "true";
		
		СтрокаВозврата = Библиотека.GetTaskList(login, password, datefrom, dateto, tab);
		Попытка			
			СписокИдентификаторов	= Библиотека.GetCustomerIDList();
		Исключение
			СписокИдентификаторов	= "";
		КонецПопытки;
		Если ВыводитьСообщения И ЗначениеЗаполнено(СписокИдентификаторов) Тогда
			#Если Клиент Тогда
			Сообщить(СписокИдентификаторов);
			#КонецЕсли
		КонецЕсли;					
		
		Если Тестирование Тогда
			ЗаписатьСтрокуXML(СтрокаВозврата, КаталогВременныхФайлов() + Формат(ТекущаяДата(), "ДФ=""гг ММММ дд чч мм""")+ ".xml");
		КонецЕсли;
		
		Библиотека = Неопределено;
		Возврат СтрокаВозврата;
	Исключение
		#Если Клиент Тогда
		Сообщить(ОписаниеОшибки());
		#КонецЕсли
	КонецПопытки;
	Возврат Неопределено;
	
КонецФункции

// Функция проверяет зарегистрирована ли библиотека
//
// Возвращаемое значение - булево
//
Функция БиблиотекаЗарегистрирована() Экспорт
	
	Попытка
		Библиотека = Новый COMОбъект("Auda.Saxif");
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Библиотека = Неопределено;
	Возврат Истина;
	
КонецФункции

// Функция осуществляет инициализацию калькуляции
//
// Параметры:
//  taskid - номер дела
//
// Возвращаемое значение - данные о калькуляции
//
Функция ИнициализацияКалькуляции(taskid) Экспорт
	
	Попытка
		Библиотека = Новый COMОбъект("Auda.Saxif");
		
		// Свойство Test может принимать значения «true» и «false». В случае использования
		// тестовых учетных записей следует установить значение в «true». По умолчанию имеет значение «false»
		//Библиотека.Test = "true";
		
		СтрокаВозврата = Библиотека.GetTaskCalcs(login, password, taskid);
		
		Если Тестирование Тогда
			ЗаписатьСтрокуXML(СтрокаВозврата, КаталогВременныхФайлов() + Формат(ТекущаяДата(), "ДФ=""гг ММММ дд чч мм""")+ ".xml");
		КонецЕсли;
		
		Библиотека = Неопределено;
		Возврат СтрокаВозврата;
	Исключение
		#Если Клиент Тогда
		Сообщить(ОписаниеОшибки());
		#КонецЕсли
	КонецПопытки;
	Возврат Неопределено;
	
КонецФункции

//Разбирает ФИ такой структуры:
//
//<TaskProxyList xmlns="http://www.audatex.com/SAXIF">
// <TaskProxy>
//  <TaskId>D1BE10D4-3E62-EBB3-BE7E-A39A37CFA7ED</TaskId>
//  <CaseId>F5612FCA-1A41-2530-D34D-0EC7A89BE498</CaseId>
//  <ClaimNumber>ftdtrdr</ClaimNumber>
//  <VIN>11111111111111111</VIN>
//  <PlateNumber>FHGGFVGHGHG</PlateNumber>
//  <ManufacturerName>MERCEDES BENZ[R] [03]</ManufacturerName>
//  <ModelName>S-Class (W221/V221) 09/05-  [49]</ModelName>
//  <CreationDate>2009-05-12T14:25:52.000</CreationDate>
// </TaskProxy>
Функция DOMРазборСпискаXML(СтрокаВозврата) Экспорт
	
	ПИ ="xmlns="+Прав("""", 1)+"http://www.audatex.com/SAXIF"+Прав("""", 1);
	ДОМ = ВернутьДОМ(СтрЗаменить(СтрокаВозврата, ПИ, ""));
	
	Если ДОМ = Неопределено Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	СтруктураКолонок = Новый Структура;
	СтруктураКолонок.Вставить("ClaimNumber", "Номер Дела");
	СтруктураКолонок.Вставить("VIN", "VIN");
	СтруктураКолонок.Вставить("PlateNumber", "Гос. Номер Автомобиля");
	СтруктураКолонок.Вставить("VehicleOwnerFirstName", "Имя Владельца");
	СтруктураКолонок.Вставить("VehicleOwnerLastName", "Фамилия Владельца");
	
	СтруктураКолонок.Вставить("TaskID", "Текущий Идентификатор Дела");
	СтруктураКолонок.Вставить("CaseID", "Уникальный Идентификатор Дела");
	СтруктураКолонок.Вставить("ManuFacturerName", "Название Производителя");
	СтруктураКолонок.Вставить("CreationDate", "Дата Создания Дела");
	СтруктураКолонок.Вставить("ModelName", "Модель Автомобиля");
	
	ТаблицаСпискаДел = РазобратьВеткуВСтрокиТаблицы(ДОМ, "//TaskProxy/descendant::*", , СтруктураКолонок);
	
	ТаблицаСпискаДел.Колонки.Вставить(0, "ДатаСозданияДела", , "Дата Создания Дела", 25);
	ТаблицаСпискаДел.Колонки.Вставить(2, "МодельАвтомобиля", , "Модель Автомобиля", 25);
	Для Каждого СтрокаСписка Из ТаблицаСпискаДел Цикл
		СтрокаСписка["ДатаСозданияДела"] = ВычислитьДату(СтрокаСписка["CreationDate"]);
		
		Если НЕ ((СтрокаСписка["ManuFacturerName"] = Неопределено) И (СтрокаСписка["ModelName"] = Неопределено)) Тогда
			
			Модель = СтрокаСписка["ManuFacturerName"] + СтрокаСписка["ModelName"];
			Скобка1 = Найти(Модель, "[");
			Скобка2 = Найти(Модель, "]");
			Пока Скобка1 > 0 Цикл
				ДоСкобки = Лев(Модель, Скобка1-1);
				ПослеСкобки = Прав(Модель, СтрДлина(Модель) - (Скобка2));
				Модель = ДоСкобки + ПослеСкобки;
				Скобка1 = Найти(Модель, "[");
				Скобка2 = Найти(Модель, "]");
			КонецЦикла;
			СтрокаСписка["МодельАвтомобиля"] = Модель;
		Иначе
			СтрокаСписка["МодельАвтомобиля"] = "";
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаСпискаДел;
	
КонецФункции

//Разбирает ФИ такой структуры:
//
//- <Расчет>
//	- <ПарамРасч>
//		<ДатаРасч>2009-05-12T14:28:40.07</ДатаРасч> 
//		<ДатаЦен>2009-02-24</ДатаЦен> 
//		<РПвЧас>100</РПвЧас> 
//		<ВалРасч>RUR</ВалРасч> 
//		<ВалИсх>EUR</ВалИсх> 
//		<Курс>43.9939</Курс> 
//		<НацНаДетали>2.0</НацНаДетали> 
//		<НЧРабот Валюта="RUR">5.20</НЧРабот> 
//		<НЧОкрас Валюта="RUR">0.55</НЧОкрас> 
//	</ПарамРасч>
//	- <Детали>
//		- <Деталь>
//			<ТипРемонта>E</ТипРемонта> 
//			<КодДетали>0361</КодДетали> 
//			<НаимДетали>НАСОС ОМЫВ. ФАРЫ ЛЕВ</НаимДетали> 
//			<НомДетали>1J0 955 978B</НомДетали> 
//			<СтоимДетали КодПересч="U" Валюта="RUR">935</СтоимДетали> 
//		</Деталь>
//	</Детали>
//	- <Работы>
//		- <Работа>
//			<НомРаб>63 29 19 00</НомРаб> 
//			<НаимРаб>ОБЛИЦОВКА БАМПЕРА ПЕРЕДН. - С/У ВКЛ: РЕШЕТКУ РАДИАТОРА С/У</НаимРаб> 
//			<КолвоРП>90.0</КолвоРП> 
//			<СтоимРаб Валюта="RUR">468</СтоимРаб> 
//		</Работа>
//	</Работы>
//	- <Окраска>
//		- <ПарамОкрасРабот>
//			<ТипОкрас>MF</ТипОкрас> 
//			<КодТипаОкрас>46</КодТипаОкрас> 
//			<НаимТипОкрас>Manufacturer</НаимТипОкрас> 
//			<ТипСистемыОкрас>MF</ТипСистемыОкрас> 
//			<РПвЧас>100</РПвЧас> 
//		</ПарамОкрасРабот>
//		- <ПодготОкрасРаботы>
//			- <ПодготОкрасРабота>
//				<НомРаб>51 01 71 11</НомРаб> 
//				<НаимРаб>ПОДГОТОВИТЕЛЬНАЯ РАБОТА К ОКРАСКЕ НОВОЙ ДЕТАЛИ S1 МЕТАЛ (ДЕТАЛЬ/ДЕТАЛИ УСТАНОВЛЕНЫ)</НаимРаб> 
//				<КолвоРП>160.0</КолвоРП> 
//				<КолвоРПпласт /> 
//				<СтоимРаб Валюта="RUR">88</СтоимРаб> 
//			</ПодготОкрасРабота>
//		</ПодготОкрасРаботы>
//		- <ОкрасРаботы>
//			- <ОкрасРабота>
//				<ТипРемонта>LE</ТипРемонта> 
//				<КодДетали>0471</КодДетали> 
//				<НаимДетали>КАПОТ</НаимДетали> 
//				<НомРаб>55 22 61 00</НомРаб> 
//				<НаимРаб>ОКРАСКА НОВ. ДЕТ. S1</НаимРаб> 
//				<КолвоРП>250.0</КолвоРП> 
//				<СтоимРаб Валюта="RUR">138</СтоимРаб> 
//			</ОкрасРабота>
//		</ОкрасРаботы>
//	</Окраска>
//</Расчет>
Функция ВернутьРасчеты(СтрокаВозврата) Экспорт
	
	ДОМ = ВернутьДОМ(СтрокаВозврата);
	Если ДОМ = Неопределено Тогда
		Возврат Новый ДеревоЗначений;
	КонецЕсли;
	
	Таблица = РазобратьВеткуВСтрокиТаблицы(ДОМ, "/Расчеты/Расчет/ПарамРасч/*");
	Таблица.Колонки.Вставить(0, "ДатаРасчета", , "Дата Расчета");
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		СтрокаТаблицы["ДатаРасчета"] = ВычислитьДату(СтрокаТаблицы["ДатаРасч"]);
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

// Функция предназначена для заполнения дерева мастера
//
// Возвращаемое значение - дерево значений мастера
//
Функция ЗаполнитьДеревоМастера() Экспорт
	
	КС = Новый КвалификаторыСтроки(500);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	Массив.Очистить();
	
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("ИмяКолонки", ОписаниеТиповС, "Имя табличной части, колонки, реквизита", 45);
	Дерево.Колонки.Добавить("Поле", ОписаниеТиповС, , 25);
	Дерево.Колонки.Добавить("Значение", ПолучитьОписаниеТиповПЗ(), , 30);
	
	СтрокаПараметры = Дерево.Строки.Добавить();
	СтрокаПараметры["ИмяКолонки"] = "Параметры";
	СтрокаПараметры["Поле"] = "";
	СтрокаПараметры["Значение"] = "";
	
	
	СтрДок = СтрокаПараметры.Строки.Добавить();
	СтрДок["ИмяКолонки"] = "Документ";
	
	//////////////////////////////////////////////////////////
	// АВТОМОБИЛЬ ДЛЯ ШАПКИ ДОКУМЕНТА
	СтрНоменклатура = СтрокаПараметры.Строки.Добавить();
	СтрНоменклатура["ИмяКолонки"] = "Автомобиль";
	
	ТекСтрока = СтрНоменклатура.Строки.Добавить();
	ТекСтрока["ИмяКолонки"] = "#ИскатьПо";
	
	//////////////////////////////////////////////////////////
	// ПОЛЯ СПРАВОЧНИКА НОМЕНКЛАТУРА
	СтрНоменклатура = СтрокаПараметры.Строки.Добавить();
	СтрНоменклатура["ИмяКолонки"] = "Номенклатура";
	
	ТекСтрока = СтрНоменклатура.Строки.Добавить();
	ТекСтрока["ИмяКолонки"] = "#ИскатьПо";
	
	//////////////////////////////////////////////////////////
	// ПОЛЯ СПРАВОЧНИКА АВТОМОРАБОТЫ
	СтрАвтоработы = СтрокаПараметры.Строки.Добавить();
	СтрАвтоработы["ИмяКолонки"] = "Автоработы";
	
	ТекСтрока = СтрАвтоработы.Строки.Добавить();
	ТекСтрока["ИмяКолонки"] = "#ИскатьПо";
	
	//////////////////////////////////////////////////////////
	// ВЕТКА "РАСЧЕТ"
	СтрокаРасчет = Дерево.Строки.Добавить();
	СтрокаРасчет["ИмяКолонки"] = "Расчет";
	СтрокаРасчет["Поле"] = "";
	СтрокаРасчет["Значение"] = "";
	
	//////////////////////////////////////////////////////////
	// СООТВЕТСТВИЕ ПОЛЕЙ ТЧ ДЕТАЛИ
	Строка_Детали = СтрокаРасчет.Строки.Добавить();
	Строка_Детали["ИмяКолонки"] = "Товары";
	Строка_Детали["Поле"] = "#Детали";
	Строка_Детали["Значение"] = "";
	
	ТекСтрока = Строка_Детали.Строки.Добавить();
	ТекСтрока["Поле"] = "#ТипРемонта";
	ТекСтрока = Строка_Детали.Строки.Добавить();
	ТекСтрока["Поле"] = "#КодДетали";
	ТекСтрока = Строка_Детали.Строки.Добавить();
	ТекСтрока["Поле"] = "#НаимДетали";
	ТекСтрока = Строка_Детали.Строки.Добавить();
	ТекСтрока["Поле"] = "#НомДетали";
	ТекСтрока = Строка_Детали.Строки.Добавить();
	ТекСтрока["Поле"] = "#СтоимДетали";
	
	
	//////////////////////////////////////////////////////////
	// СООТВЕТСТВИЕ ПОЛЕЙ ТЧ РАБОТЫ
	Строка_Работы = СтрокаРасчет.Строки.Добавить();
	Строка_Работы["ИмяКолонки"] = "Работы";
	Строка_Работы["Поле"] = "#Работы";
	Строка_Работы["Значение"] = "";
	
	ТекСтрока = Строка_Работы.Строки.Добавить();
	ТекСтрока["Поле"] = "#НомРаб";
	ТекСтрока = Строка_Работы.Строки.Добавить();
	ТекСтрока["Поле"] = "#НаимРаб";
	ТекСтрока = Строка_Работы.Строки.Добавить();
	ТекСтрока["Поле"] = "#КолвоРП";
	ТекСтрока = Строка_Работы.Строки.Добавить();
	ТекСтрока["Поле"] = "#СтоимРаб";
	
	//////////////////////////////////////////////////////////
	// СООТВЕТСТВИЕ ПОЛЕЙ ТЧ ПОДГОТ ОКРАС РАБОТЫ
	Строка_ПодготОкрасРаботы = СтрокаРасчет.Строки.Добавить();
	Строка_ПодготОкрасРаботы["Поле"] = "#ПодготОкрасРаботы";
	Строка_ПодготОкрасРаботы["ИмяКолонки"] = "Работы";
	Строка_ПодготОкрасРаботы["Значение"] = "";
	
	ТекСтрока = Строка_ПодготОкрасРаботы.Строки.Добавить();
	ТекСтрока["Поле"] = "#НомРаб";
	ТекСтрока = Строка_ПодготОкрасРаботы.Строки.Добавить();
	ТекСтрока["Поле"] = "#НаимРаб";
	ТекСтрока = Строка_ПодготОкрасРаботы.Строки.Добавить();
	ТекСтрока["Поле"] = "#КолвоРП";
	ТекСтрока = Строка_ПодготОкрасРаботы.Строки.Добавить();
	ТекСтрока["Поле"] = "#КолвоРПпласт";
	ТекСтрока = Строка_ПодготОкрасРаботы.Строки.Добавить();
	ТекСтрока["Поле"] = "#СтоимРаб";
	
	//////////////////////////////////////////////////////////
	// СООТВЕТСТВИЕ ПОЛЕЙ ТЧ  ОКРАС РАБОТЫ
	Строка_ОкрасРаботы = СтрокаРасчет.Строки.Добавить();
	Строка_ОкрасРаботы["Поле"] = "#ОкрасРаботы";
	Строка_ОкрасРаботы["ИмяКолонки"] = "Работы";
	Строка_ОкрасРаботы["Значение"] = "";
	
	ТекСтрока = Строка_ОкрасРаботы.Строки.Добавить();
	ТекСтрока["Поле"] = "#ТипРемонта";
	ТекСтрока = Строка_ОкрасРаботы.Строки.Добавить();
	ТекСтрока["Поле"] = "#КодДетали";
	ТекСтрока = Строка_ОкрасРаботы.Строки.Добавить();
	ТекСтрока["Поле"] = "#НаимДетали";
	ТекСтрока = Строка_ОкрасРаботы.Строки.Добавить();
	ТекСтрока["Поле"] = "#НомРаб";
	ТекСтрока = Строка_ОкрасРаботы.Строки.Добавить();
	ТекСтрока["Поле"] = "#НаимРаб";
	ТекСтрока = Строка_ОкрасРаботы.Строки.Добавить();
	ТекСтрока["Поле"] = "#КолвоРП";
	ТекСтрока = Строка_ОкрасРаботы.Строки.Добавить();
	ТекСтрока["Поле"] = "#СтоимРаб";
	
	Возврат Дерево;
	
КонецФункции

// Функция производит поиск или создание указанного контрагента.
// Функция вызывается из схемы импорта.
//
Функция НайтиСоздатьКонтрагента(Знач ПараметрыДела) Экспорт
	
	Результат	= Справочники.Контрагенты.ПустаяСсылка();
	
	Если ПараметрыДела.Свойство("VehicleOwnerLastName") И
		ПараметрыДела.Свойство("VehicleOwnerFirstName") Тогда
		ФамилияКонтрагента	= ?(ЗначениеЗаполнено(ПараметрыДела.VehicleOwnerLastName),ПараметрыДела.VehicleOwnerLastName,"");
		ИмяКонтрагента		= ?(ЗначениеЗаполнено(ПараметрыДела.VehicleOwnerFirstName), ПараметрыДела.VehicleOwnerFirstName, "");
		
		НаименованиеКонтрагента	= СокрЛП(ФамилияКонтрагента+" "+ИмяКонтрагента);
		Если ПустаяСтрока(НаименованиеКонтрагента) Тогда
			Возврат Результат;
		КонецЕсли;
		
		Результат	= Справочники.Контрагенты.НайтиПоНаименованию(НаименованиеКонтрагента, Истина);		
	КонецЕсли;	
	
	Возврат Результат;	
КонецФункции

#Если Клиент Тогда

// Функция предназначена для формирования документа на основании
// данных расчета.
//
// Параметры:
//  СтрокаВозврата - строка возврата
//  ПараметрыДела - параметры дела
//  СтруктураДокумента - структура документа
//  СуществующийДокумент - заполнение данными существующего документа
//  ДокументПриёмник - ссылка на формируемый документ
//  ЗатиратьШапку    - признак затирания шапки
//
// Возвращаемое значение - структура признаков документа
//
Функция СоздатьДокументПоРасчету(СтрокаВозврата, ПараметрыДела, СтруктураДокумента, СуществующийДокумент, ДокументПриёмник, ЗатиратьШапку) Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	ТипЧисло = Новый ОписаниеТипов(Массив, Новый КвалификаторыЧисла(15, 2));
	Массив.Очистить();
	Массив.Добавить(Тип("Строка"));
	ТипСтрока = Новый ОписаниеТипов(Массив, Новый КвалификаторыСтроки(100));
	Массив.Очистить();
	Массив.Добавить(Тип("Дата"));
	ТипДата = Новый ОписаниеТипов(Массив);
	Массив.Очистить();
	
	Вернём = Новый Структура("ВсёОк, Ошибка, UIN, ДатаРасч, CaseID, TaskID, ВидДок", Ложь, "");
	ДОМ = ВернутьДОМ(СтрокаВозврата);
	Если ДОМ = Неопределено Тогда
		Вернём.Ошибка = "Ошибка прочтения файла импорта...";
		Возврат Вернём;
	КонецЕсли;
	
	КореньВеткиСДатой = "//*[contains(text(), '"+ПараметрыДела.ДатаРасч+"')]/parent::*/parent::*/descendant-or-self::*";
	
	ПутьВеткиПараметров = "/ПарамРасч/*";
	
	ПутьВеткиДеталей = "/Детали/Деталь/*";
	
	ПутьВеткиРабот = "/Работы/Работа/*";
	ПутьВеткиРемонта = "/Работы/Ремонт/*";
	ПутьВеткиДопРабот = "/Работы/ДопРабота/*";
	
	ПутьВеткиПараметровОкрасРабот = "/Окраска/ПарамОкрасРабот/*";
	ПутьВеткиПодготовитОкрасРабот = "/Окраска/ПодготОкрасРаботы/ПодготОкрасРабота/*";
	ПутьВеткиОкрасРабот = "/Окраска/ОкрасРаботы/ОкрасРабота/*";
	
	ПутьВеткиСтоимМат = "/Окраска/СтоимМат";
	
	ПутьВеткиДопКомпонент = "/ДопКомпоненты/*";
	
	Попытка
		
		//////////////////////////////////////////////////////////
		// ПолучениеДанных
		
		// детали
		
		СтруктураТитпов = Новый Структура;
		СтруктураТитпов.Вставить("ТипРемонта", ТипСтрока);
		СтруктураТитпов.Вставить("КодДетали", ТипСтрока);
		СтруктураТитпов.Вставить("НаименованиеДетали", ТипСтрока);
		СтруктураТитпов.Вставить("НомерДетали", ТипСтрока);
		СтруктураТитпов.Вставить("СтоимостьДетали", ТипЧисло);
		
		ТаблицаДеталей = Новый ТаблицаЗначений;
		Для Каждого Элемент Из СтруктураТитпов Цикл
			ТаблицаДеталей.Колонки.Добавить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;
		
		ВремСтруктура = Новый Структура;
		ВремСтруктура.Вставить("ТипРемонта", "ТипРемонта");
		ВремСтруктура.Вставить("КодДетали", "КодДетали");
		ВремСтруктура.Вставить("НаименованиеДетали", "НаимДетали");
		ВремСтруктура.Вставить("НомерДетали", "НомДетали");
		ВремСтруктура.Вставить("СтоимостьДетали", "СтоимДетали");
		ЗаполнитьТаблицу1изТаблицы2ЧерезСтруктуру(ТаблицаДеталей, РазобратьВеткуВСтрокиТаблицы(ДОМ, КореньВеткиСДатой, ПутьВеткиДеталей), ВремСтруктура);
		
		// работы
		СтруктураТитпов = Новый Структура;
		СтруктураТитпов.Вставить("НомерРаботы", ТипСтрока);
		СтруктураТитпов.Вставить("НаименованиеРаботы", ТипСтрока);
		СтруктураТитпов.Вставить("НаименованиеДетали", ТипСтрока);
		СтруктураТитпов.Вставить("КоличествоРП", ТипЧисло);
		СтруктураТитпов.Вставить("СтоимостьРабот", ТипЧисло);
		
		ТаблицаРабот = Новый ТаблицаЗначений;
		Для Каждого Элемент Из СтруктураТитпов Цикл
			ТаблицаРабот.Колонки.Добавить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;
		
		// работы
		ВремСтруктура = Новый Структура;
		ВремСтруктура.Вставить("НомерРаботы", "НомРаб");
		ВремСтруктура.Вставить("НаименованиеРаботы", "НаимРаб");
		ВремСтруктура.Вставить("КоличествоРП", "КолвоРП");
		ВремСтруктура.Вставить("СтоимостьРабот", "СтоимРаб");
		ЗаполнитьТаблицу1изТаблицы2ЧерезСтруктуру(ТаблицаРабот, РазобратьВеткуВСтрокиТаблицы(ДОМ, КореньВеткиСДатой, ПутьВеткиРабот), ВремСтруктура);
		
		// ремонт
		ВремСтруктура = Новый Структура;
		ВремСтруктура.Вставить("НомерРаботы", "НомРаб");
		//ВремСтруктура.Вставить("НаименованиеРаботы", "НаимРемонта");
		ВремСтруктура.Вставить("НаименованиеРаботы", "СтрокаВрТбл.НаимРемонта + ?(ПустаяСтрока(СтрокаВрТбл.НаимДетали), """", "" "" + СтрокаВрТбл.НаимДетали)");
		ВремСтруктура.Вставить("НаименованиеДетали", "НаимДетали");
		ВремСтруктура.Вставить("КоличествоРП", "КолвоРП");
		ВремСтруктура.Вставить("СтоимостьРабот", "СтоимРаб");
		ЗаполнитьТаблицу1изТаблицы2ЧерезСтруктуру(ТаблицаРабот, РазобратьВеткуВСтрокиТаблицы(ДОМ, КореньВеткиСДатой, ПутьВеткиРемонта), ВремСтруктура);
		
		// доп работы
		ВремСтруктура = Новый Структура;
		ВремСтруктура.Вставить("НомерРаботы", "НомРаб");
//		ВремСтруктура.Вставить("НаименованиеРаботы", "НаимРаб");
		ВремСтруктура.Вставить("НаименованиеРаботы", "СтрокаВрТбл.НаимРаб + ?(ПустаяСтрока(СтрокаВрТбл.НаимДетали), """", "" "" + СтрокаВрТбл.НаимДетали)");
		ВремСтруктура.Вставить("КоличествоРП", "КолвоРП");
		ВремСтруктура.Вставить("СтоимостьРабот", "СтоимРаб");
		ЗаполнитьТаблицу1изТаблицы2ЧерезСтруктуру(ТаблицаРабот, РазобратьВеткуВСтрокиТаблицы(ДОМ, КореньВеткиСДатой, ПутьВеткиДопРабот), ВремСтруктура);
		
		// подготовит окрас работы
		ВремСтруктура = Новый Структура;
		ВремСтруктура.Вставить("НомерРаботы", "НомРаб");
		ВремСтруктура.Вставить("НаименованиеРаботы", "НаимРаб");
		ВремСтруктура.Вставить("КоличествоРП", "КолвоРП");
		ВремСтруктура.Вставить("СтоимостьРабот", "СтоимРаб");
		ЗаполнитьТаблицу1изТаблицы2ЧерезСтруктуру(ТаблицаРабот, РазобратьВеткуВСтрокиТаблицы(ДОМ, КореньВеткиСДатой, ПутьВеткиПодготовитОкрасРабот), ВремСтруктура);

		// окрас работы
		ВремСтруктура = Новый Структура;
		ВремСтруктура.Вставить("НомерРаботы", "НомРаб");
		ВремСтруктура.Вставить("НаименованиеРаботы", "СтрокаВрТбл.НаимРаб + ?(ПустаяСтрока(СтрокаВрТбл.НаимДетали), """", "" "" + СтрокаВрТбл.НаимДетали)");
		ВремСтруктура.Вставить("НаименованиеДетали", "НаимДетали");
		ВремСтруктура.Вставить("КоличествоРП", "КолвоРП");
		ВремСтруктура.Вставить("СтоимостьРабот", "СтоимРаб");
		ЗаполнитьТаблицу1изТаблицы2ЧерезСтруктуру(ТаблицаРабот, РазобратьВеткуВСтрокиТаблицы(ДОМ, КореньВеткиСДатой, ПутьВеткиОкрасРабот), ВремСтруктура);
		
		// доп компоненты
		ВремСтруктура = Новый Структура;
		ВремСтруктура.Вставить("НомерРаботы", "КодПозиции");
		ВремСтруктура.Вставить("НаименованиеРаботы", "Описание");
		ВремСтруктура.Вставить("КоличествоРП", "КолвоРП");
		ВремСтруктура.Вставить("СтоимостьРабот", "Стоим");
		ЗаполнитьТаблицу1изТаблицы2ЧерезСтруктуру(ТаблицаРабот, РазобратьВеткуВСтрокиТаблицы(ДОМ, КореньВеткиСДатой, ПутьВеткиДопКомпонент), ВремСтруктура);

		// парм окрас работ
		ТаблицаПараметровОкрасРабот = РазобратьВеткуВСтрокиТаблицы(ДОМ, КореньВеткиСДатой, ПутьВеткиПараметровОкрасРабот);
		
		// Общая стоимость окрасочных материалов.
		ВыражениеXPath = ДОМ.СоздатьВыражениеXPath(КореньВеткиСДатой + ПутьВеткиСтоимМат, Новый РазыменовательПространствИменDOM(ДОМ));
		РезультатXPath = ВыражениеXPath.Вычислить(ДОМ);
		ЭлементDOM = РезультатXPath.ПолучитьСледующий();
		
		СтоимМат = 0;
		Если ЭлементDOM <> Неопределено Тогда
			Попытка
				СтоимМат = Число(ЭлементDOM.ТекстовоеСодержимое);
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		ДОМ = Неопределено;
		ВременнаяТаблица = Неопределено;
		
		Для Каждого СтрокаРабот Из ТаблицаРабот Цикл
			Если СтрокаРабот.НаименованиеДетали = Неопределено Тогда
				СтрокаРабот.НаименованиеДетали = "";
			КонецЕсли;
			Если СтрокаРабот.НомерРаботы = Неопределено Тогда
				СтрокаРабот.НомерРаботы = "";
			КонецЕсли;
		КонецЦикла;
		
		ПКШапка = Новый Структура;
		ПКШапка.Вставить("НомерДела",		 ВернутьВозможноеЗначение(ПараметрыДела, "ClaimNumber"));
		ПКШапка.Вставить("МодельАвтомобиля", ВернутьВозможноеЗначение(ПараметрыДела, "МодельАвтомобиля"));
		ПКШапка.Вставить("VIN",				 ВернутьВозможноеЗначение(ПараметрыДела, "VIN"));
		ПКШапка.Вставить("ДатаРасчета",		 ВернутьВозможноеЗначение(ПараметрыДела, "ДатаРасчета"));
		ПКШапка.Вставить("НаценкаНаДетали",	 ВернутьВозможноеЗначение(ПараметрыДела, "НацНаДетали"));
		ПКШапка.Вставить("ВалютаРасчета",	 ВернутьВозможноеЗначение(ПараметрыДела, "ВалютаРасч"));
		ПКШапка.Вставить("ВалютаИсходная",	 ВернутьВозможноеЗначение(ПараметрыДела, "ВалютаИсх"));
		
		Знч = ВернутьВозможноеЗначение(ПараметрыДела, "ДатаЦен");
		Неопр = Знч = "" ИЛИ Знч = Неопределено;
		ПКШапка.Вставить("ДатаЦен",			 ?(Неопр, '000101010000', Дата(СтрЗаменить(Знч, "-", ""))));
		
		Знч = ВернутьВозможноеЗначение(ПараметрыДела, "РПвЧас");
		Неопр = Знч = "" ИЛИ Знч = Неопределено;
		ПКШапка.Вставить("РПвЧас",			 ?(Неопр, 0, Число(Знч)));
		
		Знч = ВернутьВозможноеЗначение(ПараметрыДела, "Курс");
		Неопр = Знч = "" ИЛИ Знч = Неопределено;
		ПКШапка.Вставить("Курс",			 ?(Неопр, 0, Число(Знч)));
		
		Знч = ВернутьВозможноеЗначение(ПараметрыДела, "НЧРабот");
		Неопр = Знч = "" ИЛИ Знч = Неопределено;
		ПКШапка.Вставить("НЧРабот",			 ?(Неопр, 0, Число(Знч)));
		
		Знч = ВернутьВозможноеЗначение(ПараметрыДела, "НЧОкрас");
		Неопр = Знч = "" ИЛИ Знч = Неопределено;
		ПКШапка.Вставить("НЧОкрас",			 ?(Неопр, 0, Число(Знч)));
		
		ПКДетали = Новый Структура("ТипРемонта, КодДетали, НаименованиеДетали, НомерДетали, СтоимостьДетали, ЦенаРубли, ЦенаЕвро");
		ПКРаботы = Новый Структура("НомерРаботы, НаименованиеРаботы, НаименованиеДетали, КоличествоРП, СтоимостьРабот, ЦенаРубли, ЦенаЕвро");
		ПараметрыКалькуляции = Новый Структура("Шапка, ПКДетали, ПКРаботы, Документ, Детали, Работы, ТаблицаСинхронизации", ПКШапка, ПКДетали, ПКРаботы, СтруктураДокумента.Документ, СтруктураДокумента.Детали, СтруктураДокумента.Работы, СтруктураДокумента.ТаблицаСинхронизации);
		
		Если НЕ ПустаяСтрока(ПараметрыДела.НацНаДетали) Тогда
			НацНаДетали = Число(ПараметрыДела.НацНаДетали);
			Если НацНаДетали > 0 Тогда
				ИтогНаценки = 0;
				Для Каждого строчка Из ТаблицаДеталей Цикл
					ИтогНаценки = ИтогНаценки + Число(строчка.СтоимостьДетали);
				КонецЦикла;
				НаценкаНаМелкиеДетали							= ТаблицаДеталей.Добавить();
				НаценкаНаМелкиеДетали["НаименованиеДетали"]		= "Наценка на мелкие детали";
				НаценкаНаМелкиеДетали["СтоимостьДетали"]		= Окр(ИтогНаценки*НацНаДетали/100,0);
			КонецЕсли;
		КонецЕсли;
		
		Если СтоимМат > 0 Тогда
			//НаценкаНаМелкиеДетали = ТаблицаРабот.Добавить();
			//НаценкаНаМелкиеДетали["НомерРаботы"] = "KN";
			//НаценкаНаМелкиеДетали["НаименованиеРаботы"] = "Общая стоимость окрасочных материалов";
			//НаценкаНаМелкиеДетали["КоличествоРП"] = 0;
			//НаценкаНаМелкиеДетали["СтоимостьРабот"] = СтоимМат;
			
			НаценкаНаМелкиеДетали = ТаблицаДеталей.Добавить();
			НаценкаНаМелкиеДетали["ТипРемонта"] = "E";
			НаценкаНаМелкиеДетали["КодДетали"] = "KN";
			НаценкаНаМелкиеДетали["НаименованиеДетали"] = "Общая стоимость окрасочных материалов";
			НаценкаНаМелкиеДетали["НомерДетали"] = "KN";
			НаценкаНаМелкиеДетали["СтоимостьДетали"] = СтоимМат;
		КонецЕсли;
		
		ЕстьДетали = ТаблицаДеталей.Количество() > 0;
		ЕстьРаботы = ТаблицаРабот.Количество() > 0;
		ЕстьОкраска = ТаблицаПараметровОкрасРабот.Количество() > 0;
		ПараметрыОкрасРабот = ?(ЕстьОкраска, ТаблицаПараметровОкрасРабот[0], 0);
		
		// Заполнение параметров деталей и работ в таблицах
		Если ЕстьДетали Тогда
			ТаблицаДеталей.Колонки.Добавить("ВалРасч", ТипСтрока);
			ТаблицаДеталей.ЗаполнитьЗначения(ПараметрыДела["ВалРасч"], "ВалРасч");
			ТаблицаДеталей.Колонки.Добавить("Курс", ТипЧисло);
			ТаблицаДеталей.ЗаполнитьЗначения(ПараметрыДела["Курс"], "Курс");
		КонецЕсли;
		
		Если ЕстьРаботы Тогда
			ТаблицаРабот.Колонки.Добавить("РПвЧас", ТипЧисло);
			ТаблицаРабот.ЗаполнитьЗначения(ПараметрыДела["РПвЧас"], "РПвЧас");
			ТаблицаРабот.Колонки.Добавить("НЧРабот", ТипЧисло);			
			ТекЗнч			= ВернутьВозможноеЗначение(ПараметрыДела, "НЧРабот");
			Неопр			= ТекЗнч = "" ИЛИ ТекЗнч = Неопределено;
			НормочасыРабот	= ?(Неопр, 0, Число(Знч));			
			ТаблицаРабот.ЗаполнитьЗначения(НормочасыРабот, "НЧРабот");
		КонецЕсли;
			
		Для Каждого СтрокаВхТаблицы Из ТаблицаДеталей Цикл
			ЗаполнитьСтоимость(ПараметрыДела, Число(СтрокаВхТаблицы["СтоимостьДетали"]), ТаблицаДеталей, СтрокаВхТаблицы);
		КонецЦикла;
			
		Для Каждого СтрокаВхТаблицы Из ТаблицаРабот Цикл			
			ЗаполнитьСтоимость(ПараметрыДела, Число(СтрокаВхТаблицы["СтоимостьРабот"]), ТаблицаРабот, СтрокаВхТаблицы);
		КонецЦикла;
		
		УИН = Строка(Новый УникальныйИдентификатор);
		СЧ = "";
		Для х=1 По 36 Цикл
			Симв = Сред(УИН, х, 1);
			Попытка
				СЧ = СЧ + Строка(Число(Симв));
			Исключение
			КонецПопытки;
		КонецЦикла;
		ГСЧ = Новый ГенераторСлучайныхЧисел(Число(СЧ));
		МассивЗарезНомеров = Новый Массив;
		МассивЗарезНомеров.Добавить("KN");
		МассивЗарезНомеров.Добавить("NO NUMBER");
		Для Каждого СтрокаВхТаблицы Из ТаблицаДеталей Цикл
			Если МассивЗарезНомеров.Найти(СтрокаВхТаблицы.НомерДетали) <> Неопределено Тогда
				СтрокаВхТаблицы.НомерДетали = "";
			КонецЕсли;
			Если СтрокаВхТаблицы.НомерДетали = "" Тогда
				
				ИмяВЛоге = СтрокаВхТаблицы.НаименованиеДетали + ВернутьВозможноеЗначение(ПараметрыДела, "МодельАвтомобиля");
			
				ИмяФайла = КаталогИмпорта + "/GoodsTune.tbl";
				ФайлЗначения = Новый Файл(ИмяФайла);
				Лог = ЗначениеИзФайла(ИмяФайла);
				ЗаписьВЛоге = Лог.Найти(ИмяВЛоге, "Имя");
				Если ЗаписьВЛоге = Неопределено Тогда
					НовУИН = Формат(ГСЧ.СлучайноеЧисло(0, 999999999), "ЧЦ=9;ЧГ=9;ЧВН=1");
					СтрокаВхТаблицы.НомерДетали = НовУИН;
					СтрокаЛога = Лог.ДОбавить();
					СтрокаЛога.UIN = НовУИН;
					СтрокаЛога.Имя = ИмяВЛоге;
					ЗначениеВФайл(ИмяФайла, Лог);
				Иначе
					СтрокаВхТаблицы.НомерДетали = ЗаписьВЛоге.UIN;
				КонецЕсли;
			
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаВхТаблицы Из ТаблицаРабот Цикл
			Если МассивЗарезНомеров.Найти(СтрокаВхТаблицы.НомерРаботы) <> Неопределено Тогда
				СтрокаВхТаблицы.НомерРаботы = "";
			КонецЕсли;
			Если СтрокаВхТаблицы.НомерРаботы = "" Тогда
				
				ИмяВЛоге = СтрокаВхТаблицы.НаименованиеРаботы + ВернутьВозможноеЗначение(ПараметрыДела, "МодельАвтомобиля");
			
				ИмяФайла = КаталогИмпорта + "/GoodsTune.tbl";
				ФайлЗначения = Новый Файл(ИмяФайла);
				Лог = ЗначениеИзФайла(ИмяФайла);
				ЗаписьВЛоге = Лог.Найти(ИмяВЛоге, "Имя");
				Если ЗаписьВЛоге = Неопределено Тогда
					НовУИН = Формат(ГСЧ.СлучайноеЧисло(0, 999999999), "ЧЦ=9;ЧГ=9;ЧВН=1");
					СтрокаВхТаблицы.НОмерРаботы = НовУИН;
					СтрокаЛога = Лог.ДОбавить();
					СтрокаЛога.UIN = НовУИН;
					СтрокаЛога.Имя = ИмяВЛоге;
					ЗначениеВФайл(ИмяФайла, Лог);
				Иначе
					СтрокаВхТаблицы.НомерРаботы = ЗаписьВЛоге.UIN;
				КонецЕсли;
			
			КонецЕсли;
		КонецЦикла;
		
		Если Тестирование Тогда
			СтруктураТаблицДляВывода = Новый Структура;
			СтруктураТаблицДляВывода.Вставить("ТаблицаДеталей", ТаблицаДеталей);
			СтруктураТаблицДляВывода.Вставить("ТаблицаРабот", ТаблицаРабот);
			ПоказатьТаблицы(СтруктураТаблицДляВывода);
		КонецЕсли;
		
		//////////////////////////////////////////////////////////
		// СОЗДАНИЕ ДОКУМЕНТА.
		Если СуществующийДокумент = Неопределено Тогда
			Если ДокументПриёмник=Неопределено ИЛИ ДокументПриёмник.Пустая() ИЛИ
				Найти(Строка(ДокументПриёмник), "Объект не найден")>0 Тогда
				
				Док		= Документы[СтруктураДокумента.Документ].СоздатьДокумент();
				Для Каждого Реквизит Из СтруктураДокумента.ДеревоДокумента.Строки Цикл
					Док[Реквизит.Реквизит] = ВернутьРеквизит(Док, Реквизит, ПараметрыКалькуляции,,ПараметрыДела);
				КонецЦикла;
			Иначе
				Если ДокументОбъект<>Неопределено И
					ЗначениеЗаполнено(ДокументОбъект.Ссылка) Тогда
					Док	= ДокументОбъект;
				Иначе
					Док	= ДокументПриёмник.ПолучитьОбъект();
				КонецЕсли;
				
				Если ЗатиратьШапку Тогда
					Для Каждого Реквизит Из СтруктураДокумента.ДеревоДокумента.Строки Цикл
						Док[Реквизит.Реквизит] = ВернутьРеквизит(Док, Реквизит, ПараметрыКалькуляции,,ПараметрыДела);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			Тч		= Док[СтруктураДокумента.Детали];
			Тч.Очистить();
			Тч		= Док[СтруктураДокумента.Работы];
			Тч.Очистить();
		Иначе
			Если ДокументОбъект<>Неопределено И
				ЗначениеЗаполнено(ДокументОбъект.Ссылка) Тогда
				Док	= ДокументОбъект;
			Иначе
				Док	= СуществующийДокумент.ПолучитьОбъект();
			КонецЕсли;			
			
			Если ЗатиратьШапку Тогда
				Для Каждого Реквизит Из СтруктураДокумента.ДеревоДокумента.Строки Цикл
					Док[Реквизит.Реквизит] = ВернутьРеквизит(Док, Реквизит, ПараметрыКалькуляции,,ПараметрыДела);
				КонецЦикла;
			КонецЕсли;			
			
			Тч		= Док[СтруктураДокумента.Детали];
			Тч.Очистить();
			Тч		= Док[СтруктураДокумента.Работы];
			Тч.Очистить();
		КонецЕсли;
		
		///////////////////////////////////////////////////////////
		// ЗАПОЛНЕНИЕ ТАБЛИЧНЫХ ЧАСТЕЙ.
		
		Если ДокументОбъект=Неопределено ИЛИ
			Найти(Строка(ДокументОбъект), "Объект не найден")>0 ИЛИ
			(НЕ ЗначениеЗаполнено(ДокументОбъект.Ссылка)) Тогда
			ФормаДока	= Док.ПолучитьФорму();
		КонецЕсли;
	
		ИсполняемыйКод	= СтруктураДокумента.ВКПЗРС_Детали;
		Если ЕстьДетали Тогда
			Попытка
				Тч = Док[СтруктураДокумента.Детали];
			Исключение
				Вернём.Ошибка = ОписаниеОшибки();
				Сообщение("Не удалось обратиться к табличной части """+СтруктураДокумента.Детали+""". Проверьте схему импорта.", 1);
				Возврат Вернём;
			КонецПопытки;
			Для Каждого СтрокаВхТаблицы Из ТаблицаДеталей Цикл
				СтрокаТЧ = Тч.Добавить();
				Для Каждого Реквизит Из СтруктураДокумента.ДеревоДеталей.Строки Цикл
					СтрокаТЧ[Реквизит.Реквизит] = ВернутьРеквизит(СтрокаТЧ, Реквизит, ПараметрыКалькуляции, СтрокаВхТаблицы);
				КонецЦикла;
				Если НЕ Пустаястрока(ИсполняемыйКод) Тогда
					Попытка
						Выполнить(ИсполняемыйКод);
					Исключение
						Сообщение("Неверно указана строка с кодом, исполняемым после заполнения табличной части 'Детали'", 1);
					КонецПопытки;
				КонецЕсли;
			КонецЦикла;
			Попытка
				Тч.Свернуть("Номенклатура,ЕдиницаИзмерения,Коэффициент,СтавкаНДС,ХарактеристикаНоменклатуры,СкладКомпании","Количество,Цена,Сумма,СуммаНДС,ПроцентСкидки,СуммаСкидки,СуммаВсего,СуммаСкидкиСтроки");
			Исключение КонецПопытки;
			Для Каждого ТекСтрока Из Тч Цикл                                     
				Попытка
					Док.ОбработкаРеквизита("Товары.СуммаВсего",	ТекСтрока,	ФормаДока);
				Исключение КонецПопытки;
			КонецЦикла;
		КонецЕсли;
		
		ИсполняемыйКод = СтруктураДокумента.ВКПЗРС_Работы;
		Если ЕстьРаботы Тогда
			Попытка
				Тч = Док[СтруктураДокумента.Работы];
			Исключение
				Вернём.Ошибка = ОписаниеОшибки();
				Сообщение("Не удалось обратиться к табличной части """+СтруктураДокумента.Работы+""". Проверьте схему импорта.", 1);
				Возврат Вернём;
			КонецПопытки;
			Для Каждого СтрокаВхТаблицы Из ТаблицаРабот Цикл
				СтрокаТЧ = Тч.Добавить();
				Для Каждого Реквизит Из СтруктураДокумента.ДеревоРабот.Строки Цикл
					// Процент скидки назначается системой
					Если Реквизит.Реквизит="ПроцентСкидки" Тогда
						Продолжить;	
					КонецЕсли;
					
					СтрокаТЧ[Реквизит.Реквизит] = ВернутьРеквизит(СтрокаТЧ, Реквизит, ПараметрыКалькуляции, СтрокаВхТаблицы);
					
					Если Реквизит.Реквизит="Работа" Тогда
						Попытка
							Док.ОбработкаРеквизита("Работы.Работа",СтрокаТЧ,ФормаДока);
						Исключение КонецПопытки;
					КонецЕсли;					
				КонецЦикла;
								
				Если НЕ Пустаястрока(ИсполняемыйКод) Тогда
					Попытка
						Выполнить(ИсполняемыйКод);
					Исключение
						Сообщение("Неверно указана строка с кодом, исполняемым после заполнения табличной части 'Работы'", 1);
					КонецПопытки;
				КонецЕсли;
			КонецЦикла;
			Попытка
				Тч.Свернуть("Работа,Нормочас,СтавкаНДС,ПроцентСкидки,ПроцентСкидкиСтроки","Количество,Коэффициент,Цена,Сумма,СуммаНДС,СуммаСкидки,СуммаВсего,СуммаСкидкиСтроки");
			Исключение КонецПопытки;
			Для Каждого ТекСтрока Из Тч Цикл
				ТекСтрока.ИдентификаторРаботы = Новый УникальныйИдентификатор;
				Док.ОбработкаРеквизита("Работы.СуммаВсего",	ТекСтрока,	ФормаДока);
			КонецЦикла;
		КонецЕсли;
		
		///////////////////////////////////////////////////////////
		// ВСЁ ПРОШЛО ХОРОШО, ЗАПИШЕМ И ВЫЙДЕМ.
		
		Если ТипЗнч(Док)=Тип("ДокументОбъект.ЗаказНаряд") И
			ЗначениеЗаполнено(Док.ЗаказЧик) И
			(НЕ ЗначениеЗаполнено(Док.ДоговорВзаиморасчетов)) Тогда
			
			Док.Контрагент				= Док.Заказчик;
			Док.ДоговорВзаиморасчетов	= Док.Заказчик.ОсновнойДоговорВзаиморасчетов;
		КонецЕсли;
		
		Док.ОбменДанными.Загрузка = Истина;
		Если НЕ ЗначениеЗаполнено(Док.Дата) Тогда
			Док.Дата = ТекущаяДата();
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Док.Номер) Тогда
			Док.УстановитьНовыйНомер();
		КонецЕсли;
		
		Попытка
			Док.Записать();
		Исключение
			Сообщение(ОписаниеОшибки(),1);
		КонецПопытки;
	
		Док.ОбменДанными.Загрузка = Ложь;
		Если ДокументОбъект=Неопределено ИЛИ
			Найти(Строка(ДокументОбъект), "Объект не найден")>0 ИЛИ
			(НЕ ЗначениеЗаполнено(ДокументОбъект.Ссылка)) Тогда
			ФормаДока.Открыть();
		Иначе
			ФормаДока.Активизировать();
			ФормаДока.Обновить();
			
			Попытка
				дкВывестиЗаголовокСуммаДокумента(ФормаДока);	
			Исключение КонецПопытки;
		КонецЕсли;
		
		Вернём.ВсёОк = Истина;
		Вернём.UIN = Док.Ссылка.УникальныйИдентификатор ();
		Вернём.CaseID = ПараметрыДела.CaseID;
		Вернём.TaskID = ПараметрыДела.TaskID;
		Вернём.ВидДок = ВернутьИмяОбъектаМД(Док);
		Вернём.ДатаРасч = ПараметрыДела.ДатаРасч;
	Исключение
		Вернём.Ошибка = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Вернём;
	
КонецФункции

#КонецЕсли

///////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ЗАПОЛНЕНИЯ СПРАВОЧНИКОВ И ДОКУМЕНТОВ

///////////////////////////////////////////////////////////
//ВернутьЭлементДляПодстановки. Функция монстр.
//
//   Описание: Возвращает составной элемент метаданных. 
//Нпример, справочник "номенклатура" с подчинёнными справочниками.
Функция ВернутьЭлементДляПодстановки(Объект, Реквизит, ПараметрыКалькуляции, СтрокаВхТаблицы)
	
	ВеткаРеквизита = Реквизит.Строки;
	
	Шапка			= ПараметрыКалькуляции.Шапка;
	Детали			= ПараметрыКалькуляции.Детали;
	Работы			= ПараметрыКалькуляции.Работы;
	
	ТаблицаСинхронизации	= ПараметрыКалькуляции.ТаблицаСинхронизации;
	СтрокаСинх				= ТаблицаСинхронизации.Найти(Реквизит.UIN, "UIN");
	Если СтрокаСинх <> Неопределено Тогда
		Попытка
			ЗнчСинх = ?(СтрокаСинх.Тип = "Фиксированое Значение", СтрокаСинх.Значение, Вычислить(СтрокаСинх.Значение));
		Исключение
			ВызватьИсключение "Описание:" + ОписаниеОшибки() + "; Вычисляемое значение: " + СтрокаСинх.Значение;
		КонецПопытки;
		
		//Если Реквизит.Значение="Автоработы" И
		//	СтрокаСинх.Реквизит="Артикул" И			
		//	ТипЗнч(Работы)=Тип("Структура") И
		//	Работы.Свойство("НаименованиеРаботы") Тогда
		//	
		//	НайденоПоАртикулу		= НайтиСпр(Реквизит.Значение, СтрокаСинх.Реквизит, ЗнчСинх);
		//	НайденоПоНаименованию	= НайтиСпр(Реквизит.Значение, "Наименование", Работы.НаименованиеРаботы);
		//				
		//	// Когда не указан артикул автоработы, то её поиск следует проводить по наименованию
		//	Если (ВРег(СокрЛП(ЗнчСинх))="БН" ИЛИ ЗнчСинх="" ИЛИ ЗнчСинх=Неопределено) Тогда
		//		ЭлементДляПодстановки	= НайденоПоНаименованию;
		//	Иначе
		//		ЭлементДляПодстановки	= НайденоПоАртикулу;
		//	КонецЕсли;
		//	
		//ИначеЕсли Реквизит.Значение="Номенклатура" И
		//	СтрокаСинх.Реквизит="Артикул" И			
		//	ТипЗнч(Детали)=Тип("Структура") И
		//	Детали.Свойство("НаименованиеДетали")Тогда
		//	
		//	НайденоПоАртикулу		= НайтиСпр(Реквизит.Значение, СтрокаСинх.Реквизит, ЗнчСинх);			
		//	НайденоПоНаименованию	= НайтиСпр(Реквизит.Значение, "Наименование", Детали.НаименованиеДетали);
		//	
		//	Если (ВРег(СокрЛП(ЗнчСинх))="ЗАМЕНИТЬ" ИЛИ ЗнчСинх="" ИЛИ ЗнчСинх=Неопределено) Тогда
		//		ЭлементДляПодстановки	= НайденоПоНаименованию;
		//	Иначе
		//		ЭлементДляПодстановки	= НайденоПоАртикулу;
		//	КонецЕсли;
		//	
		//Иначе		
			ЭлементДляПодстановки = НайтиСпр(Реквизит.Значение, СтрокаСинх.Реквизит, ЗнчСинх);
		//КонецЕсли;
	
		Если ЭлементДляПодстановки.Пустая() Тогда
			
			ИмяСпр = Реквизит.Значение;
			ЭлементДляПодстановки = Справочники[ИмяСпр].СоздатьЭлемент();
			
		Иначе
			ЭлементДляПодстановки = ЭлементДляПодстановки.получитьОбъект();
			
		КонецЕсли;
	КонецЕсли;
	Попытка
		Если НЕ СтрокаСинх.Создавать Тогда
			Возврат ЭлементДляПодстановки;
		КонецЕсли;
	Исключение
		// Нет такого реквизита. Старая схема.
	КонецПопытки;
	// Запихаем строки с реквизитами в таблицу,
	// и отсортируем её по убыванию уровня вложенности.
	ТаблицаРеквизитов = Новый ТаблицаЗначений;
	ТаблицаРеквизитов.Колонки.Добавить("Строка");
	ТаблицаРеквизитов.Колонки.Добавить("Значение");
	ТаблицаРеквизитов.Колонки.Добавить("Уровень");
	
	СтрокиРеквизиты = ВеткаРеквизита.НайтиСтроки(Новый Структура("Тип", "Найти / Создать Элемент Справочника"), Истина);
	Для Каждого СтрокаРеквизит Из СтрокиРеквизиты Цикл
		
		Владельцы = Метаданные.Справочники[СтрокаРеквизит.Значение].Владельцы;
		Если Владельцы.Количество() = 0 Тогда
			СтрокаТР = ТаблицаРеквизитов.Добавить();
			СтрокаТР.Строка = СтрокаРеквизит;
			СтрокаТР.Уровень = СтрокаРеквизит.Уровень();
		КонецЕсли;
	КонецЦикла;
	ТаблицаРеквизитов.Сортировать("Уровень убыв");
	
	Для Каждого СтрокаТР Из ТаблицаРеквизитов Цикл
		
		СтрокиДерева = СтрокаТР.Строка.Строки;
		ТекСтрокаРеквзита = СтрокаТР.Строка;

		СтрокаСинх = ТаблицаСинхронизации.Найти(ТекСтрокаРеквзита.UIN, "UIN");
		Если СтрокаСинх = Неопределено Тогда
			ЗнчСинх = Неопределено;
			ИмяРеквизита = "Неопределено";
		Иначе
			Попытка
				ЗнчСинх = ?(СтрокаСинх.Тип = "Фиксированое Значение", СтрокаСинх.Значение, Вычислить(СтрокаСинх.Значение));
			Исключение
				ВызватьИсключение "Описание:" + ОписаниеОшибки() + "; Вычисляемое значение: " + СтрокаСинх.Значение;
			КонецПопытки;
			ИмяРеквизита = СтрокаСинх.Реквизит;
		КонецЕсли;
		СпрРеквизит = НайтиСпр(ТекСтрокаРеквзита.Значение, ИмяРеквизита, ЗнчСинх);
		
		Попытка
			Если НЕ СтрокаСинх.Создавать Тогда
				Продолжить;
			КонецЕсли;
		Исключение
			// Нет такого реквизита. Старая схема.
		КонецПопытки;
		
		Если СпрРеквизит.Пустая() Тогда
			
			ИмяСпр		= ТекСтрокаРеквзита.Значение;
			СпрРеквизит	= Справочники[ИмяСпр].СоздатьЭлемент();
			Попытка
				СпрРеквизит.ОбработкаЗаполнения(Неопределено);
			Исключение КонецПопытки;
			
			Для Каждого СтрокаДерева Из СтрокиДерева Цикл
				Значение = ВернутьЗначениеРеквизитаИзСтрокиДерева(ПараметрыКалькуляции, СтрокаДерева, СпрРеквизит, ЭлементДляПодстановки);
				Если Значение <> Неопределено Тогда
					СпрРеквизит[СтрокаДерева["Реквизит"]] = Значение;
				КонецЕсли;
			КонецЦикла;
			
			СпрРеквизит.УстановитьНовыйКод();
			СпрРеквизит.ОбменДанными.Загрузка = Истина;
			Попытка
				СпрРеквизит.Записать();
			Исключение
				Сообщение(ОписаниеОшибки(),1);
			КонецПопытки;
			
			// Создание Подчинённых справочников...
			ВеткиПодчСпр = СтрокиДерева.НайтиСтроки(Новый Структура("Тип", "Найти / Создать Элемент Справочника"));
			Для Каждого ВеткаПодчСпр Из ВеткиПодчСпр Цикл
				
				СтрокиПодчСпр = ВеткаПодчСпр.Строки;
				СтрокаСинх = ТаблицаСинхронизации.Найти(ВеткаПодчСпр.UIN, "UIN");
				Если СтрокаСинх = Неопределено Тогда
					ЗнчСинх = Неопределено;
					ИмяРеквизита = "Неопределено";
				Иначе
					Попытка
						ЗнчСинх = ?(СтрокаСинх.Тип = "Фиксированое Значение", СтрокаСинх.Значение, Вычислить(СтрокаСинх.Значение));
					Исключение
						ВызватьИсключение "Описание:" + ОписаниеОшибки() + "; Вычисляемое значение: " + СтрокаСинх.Значение;
					КонецПопытки;
					
					ИмяРеквизита = СтрокаСинх.Реквизит;
				КонецЕсли;
				
				Попытка
					ПодчСпр = НайтиСпр(ВеткаПодчСпр.Значение, ИмяРеквизита, ЗнчСинх);
					Если НЕ СтрокаСинх.Создавать Тогда
						Продолжить;
					КонецЕсли;
				Исключение
					// Нет такого реквизита. Старая схема.
				КонецПопытки;
				
				Если ПодчСпр.Пустая() Тогда
					
					ИмяСпр		= ВеткаПодчСпр.Значение;
					ПодчСпр		= Справочники[ИмяСпр].СоздатьЭлемент();
					Попытка
						СпрРеквизит.ОбработкаЗаполнения(Неопределено);
					Исключение КонецПопытки;
			
					Для Каждого СтрокаПодчСпр Из СтрокиПодчСпр Цикл
						Значение = ВернутьЗначениеРеквизитаИзСтрокиДерева(ПараметрыКалькуляции, СтрокаПодчСпр, ПодчСпр, СпрРеквизит);
						Если Значение <> Неопределено Тогда
							ПодчСпр[СтрокаПодчСпр["Реквизит"]] = Значение;
						КонецЕсли;
					КонецЦикла;
					
					ПодчСпр.УстановитьНовыйКод();
					ПодчСпр.ОбменДанными.Загрузка	= Истина;
					ПодчСпр.Записать();
					ПодчСпр.ОбменДанными.Загрузка = Ложь;
				КонецЕсли;
				
				СпрРеквизит[ВеткаПодчСпр["Реквизит"]] = ПодчСпр.Ссылка;
				
			КонецЦикла;
			// Заполнение ссылок в СпрРеквизит...
			СпрРеквизит.ОбменДанными.Загрузка = Истина;
			СпрРеквизит.Записать();
			
		КонецЕсли;
		
		СтрокаТР.Значение = СпрРеквизит.Ссылка;
		
		///////////////////////////////////////////////////////
		// Получено значение. Его надо записать в дерево 
		// на место строки с параметрами поиска/создания, 
		// с тем, чтобы реквизит ветки с меньшим уровнем 
		// заполнился этим значением.
		
		// Получим строки этого уровня:
		СтрокиУровня = СтрокаТР.Строка.Родитель.Строки;
		
		// Дальше очевидно.
		UIN = ТекСтрокаРеквзита.UIN;
		Реквизит = ТекСтрокаРеквзита.Реквизит;
		СтрокиУровня.Удалить(ТекСтрокаРеквзита);
		НовыйРеквизит = СтрокиУровня.Добавить();
		НовыйРеквизит.UIN = UIN;
		НовыйРеквизит.Реквизит = Реквизит;
		НовыйРеквизит.Тип = "Фиксированое Значение";
		НовыйРеквизит.Значение = СпрРеквизит.Ссылка;
		
		// Удалилась вся ветка реквизита вместе с раскрытыми ветками подчинённых справоников.
		// вмсесто неё образовалась строка дерева со значением справочника реквизита, которую 
		// на следующем витке просто запихнёт в соответствующий реквизит.
		
	КонецЦикла;
	
	///////////////////////////////////////////////////////
	// В результате этой комбинации получено дерево со 
	// значениями реквизитов справочника "Номенклатура".
	// Остаётся создать элемент, и заполнить его значениями реквизитов.
	
	Для Каждого СтрокаДерева Из ВеткаРеквизита Цикл
		Значение = ВернутьЗначениеРеквизитаИзСтрокиДерева(ПараметрыКалькуляции, СтрокаДерева, ЭлементДляПодстановки, Объект);
		Если Значение <> Неопределено Тогда
			ЭлементДляПодстановки[СтрокаДерева["Реквизит"]] = Значение;
		КонецЕсли;
	КонецЦикла;
	
	ЭлементДляПодстановки.УстановитьНовыйКод();
	ЭлементДляПодстановки.ОбменДанными.Загрузка = Истина; // на всякий случай, не пойдём в процедуру "ПередЗаписью()"
	ЭлементДляПодстановки.Записать();
	
	// Есть ещё вероятность того, что подч справочник будет в корне возвращаемого элемента
	// Создание Подчинённых справочников...
	ВеткиПодчСпр = ВеткаРеквизита.НайтиСтроки(Новый Структура("Тип", "Найти / Создать Элемент Справочника"));
	Для Каждого ВеткаПодчСпр Из ВеткиПодчСпр Цикл
		
		СтрокиПодчСпр = ВеткаПодчСпр.Строки;
		СтрокаСинх = ТаблицаСинхронизации.Найти(ВеткаПодчСпр.UIN, "UIN");
		Если СтрокаСинх = Неопределено Тогда
			ЗнчСинх = Неопределено;
			ИмяРеквизита = "Неопределено";
		Иначе
			Попытка
				ЗнчСинх = ?(СтрокаСинх.Тип = "Фиксированое Значение", СтрокаСинх.Значение, Вычислить(СтрокаСинх.Значение));
			Исключение
				ВызватьИсключение "Описание:" + ОписаниеОшибки() + "; Вычисляемое значение: " + СтрокаСинх.Значение;
			КонецПопытки;
			ИмяРеквизита = СтрокаСинх.Реквизит;
		КонецЕсли;
		ПодчСпр = НайтиСпр(ВеткаПодчСпр.Значение, ИмяРеквизита, ЗнчСинх);
		
		Попытка
			Если НЕ СтрокаСинх.Создавать Тогда
				Продолжить;
			КонецЕсли;
		Исключение
			// Нет такого реквизита. Старая схема.
		КонецПопытки;
		
		Если ПодчСпр.Пустая() Тогда
			ИмяСпр = ВеткаПодчСпр.Значение;
			ПодчСпр = Справочники[ИмяСпр].СоздатьЭлемент();
			Для Каждого СтрокаПодчСпр Из СтрокиПодчСпр Цикл
				Значение = ВернутьЗначениеРеквизитаИзСтрокиДерева(ПараметрыКалькуляции, СтрокаПодчСпр, ПодчСпр, ЭлементДляПодстановки);
				Если Значение <> Неопределено тогда
					ПодчСпр[СтрокаПодчСпр["Реквизит"]] = Значение;
				КонецЕсли;
			КонецЦикла;
			ПодчСпр.Владелец = ЭлементДляПодстановки.Ссылка;
			ПодчСпр.УстановитьНовыйКод();
			ПодчСпр.ОбменДанными.Загрузка = Истина;
			ПодчСпр.Записать();
		КонецЕсли;
		
		Если ПустаяСтрока(ВеткаПодчСпр["Реквизит"]) Тогда
			Продолжить;
		КонецЕсли;
	
		ЭлементДляПодстановки[ВеткаПодчСпр["Реквизит"]] = ПодчСпр.Ссылка;
	КонецЦикла;

	ЭлементДляПодстановки.ОбменДанными.Загрузка = Истина; // на всякий случай, не пойдём в процедуру "ПередЗаписью()"
	ЭлементДляПодстановки.Записать();
	
	Возврат ЭлементДляПодстановки.Ссылка;
	
КонецФункции // ВернутьЭлементДляПодстановки()

Функция ВернутьРеквизит(ТекЭлемент, Реквизит, ПараметрыКалькуляции, СтрокаВхТаблицы = Неопределено, ПараметрыДела=Неопределено)
	
	Шапка = ПараметрыКалькуляции.Шапка;
	Детали = ПараметрыКалькуляции.ПКДетали;
	Работы = ПараметрыКалькуляции.ПКРаботы;
	Если НЕ СтрокаВхТаблицы = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Детали, СтрокаВхТаблицы);
		ЗаполнитьЗначенияСвойств(Работы, СтрокаВхТаблицы);
	КонецЕсли;
	
	ПК = Новый Структура("Шапка, Детали, Работы, ТаблицаСинхронизации", Шапка, Детали, Работы, ПараметрыКалькуляции.ТаблицаСинхронизации);
	
	ДеревоРеквизита = СоздатьТипизированноеДерево();
	Корень = ДеревоРеквизита.Строки.Добавить();
	ЗаполнитьЗначенияСвойств(Корень, Реквизит);
	ЗаполнитьВеткуСИизДерева(Корень, Реквизит);
	
	Тип = Реквизит.Тип;
	Значение = Реквизит.Значение;
	Если Тип = "Параметр Сеанса" Тогда
		Возврат ПараметрыСеанса[Значение];
	ИначеЕсли Тип = "Поле Калькуляции" Тогда
		Попытка
			Возврат Вычислить(Значение);
		Исключение
			ВызватьИсключение "Описание:" + ОписаниеОшибки() + "; Вычисляемое значение: " + Значение;
		КонецПопытки;
	ИначеЕсли Тип = "Найти / Создать Элемент Справочника" Тогда
		Возврат ВернутьЭлементДляПодстановки(ТекЭлемент, Корень, ПК, СтрокаВхТаблицы);
	ИначеЕсли Тип = "Фиксированое Значение" Тогда
		ТипРеквизита = ВернутьОписаниеТиповРеквизита(ТекЭлемент[Реквизит.Реквизит]);
		Возврат ТипРеквизита.ПривестиЗначение(Значение);
	ИначеЕсли Тип = "Вычисляемое значение" Тогда
		Попытка
			Возврат Вычислить(Значение);
		Исключение
			ВызватьИсключение "Описание:" + ОписаниеОшибки() + "; Вычисляемое значение: " + Значение;
		КонецПопытки;
	КонецЕсли;
	
КонецФункции

//---------------------------------------------------------

Функция НайтиСпр(ИмяСпр, имяРеквизитаПоиска, ЗначениеСинхронизации, неопр = Неопределено)
	
	ЭлементСправочника = Справочники[ИмяСпр].СоздатьЭлемент();

	ТипРеквизита = ВернутьОписаниеТиповРеквизита(ЭлементСправочника[имяРеквизитаПоиска]);
	
	ЗначениеПоиска = ТипРеквизита.ПривестиЗначение(ЗначениеСинхронизации);
	Запрос = Новый Запрос;
	ЗапросТекст = "ВЫБРАТЬ
	|	спр.Ссылка
	|ИЗ
	|	Справочник."+ИмяСпр+" КАК спр
	|ГДЕ
	|	спр."+имяРеквизитаПоиска+" = &Парам
	|";
	ЗапросТекст = ЗапросТекст + ?(ЭлементСправочника.метаданные().Иерархический, Символы.ПС+"и спр.ЭтоГруппа = ложь", "");
	Запрос.Текст = ЗапросТекст;
	Запрос.УстановитьПараметр("Парам", ЗначениеПоиска);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники[ИмяСпр].ПустаяСсылка();
	
КонецФункции

Функция СоздатьСпр(Строка)
	
	ИмяСпр = ВернутьИмяОбъектаМД(Строка.Значение);
	Возврат Справочники[ИмяСпр].СоздатьЭлемент();
	
КонецФункции // НайтиСпр()

Функция ВернутьИмяОбъектаМД(Значение)
	
	ОбъектСсылка = Новый(ТипЗнч(Значение));
	Возврат ОбъектСсылка.Метаданные().Имя;
	
КонецФункции

//---------------------------------------------------------

Функция РазобратьВеткуВСтрокиТаблицы(ДОМ, КореньВетки, ПутьКВетке = "", СтруктураКолонок = Неопределено)
	
	ТаблицаВозврата = Новый ТаблицаЗначений;
	Если НЕ СтруктураКолонок = Неопределено Тогда
		Для Каждого Элемент Из СтруктураКолонок Цикл
			ТаблицаВозврата.Колонки.Добавить(Элемент.Ключ, , Элемент.Значение, 25);
		КонецЦикла;
	КонецЕсли;
	
	ВыражениеXPath = ДОМ.СоздатьВыражениеXPath(КореньВетки + ПутьКВетке, Новый РазыменовательПространствИменDOM(ДОМ));
	РезультатXPath = ВыражениеXPath.Вычислить(ДОМ);
	ЭлементDOM = РезультатXPath.ПолучитьСледующий();
	
	РодительскийУзел = Неопределено;
	СтрокаТаблицы = Неопределено;
	
	Пока ЭлементDOM <> Неопределено Цикл
		ИмяКолонки = ЭлементDOM.ИмяУзла;
		Если ТаблицаВозврата.Колонки.Найти(ИмяКолонки) = Неопределено Тогда
			ТаблицаВозврата.Колонки.Добавить(ИмяКолонки, , ,50);
		КонецЕсли;
		Если ЭлементDOM.РодительскийУзел = РодительскийУзел Тогда
			
			СтрокаТаблицы[ИмяКолонки] = ЭлементDOM.ТекстовоеСодержимое;
		Иначе
			
			РодительскийУзел = ЭлементDOM.РодительскийУзел;
			СтрокаТаблицы = ТаблицаВозврата.Добавить();
			СтрокаТаблицы[ИмяКолонки] = ЭлементDOM.ТекстовоеСодержимое;
		КонецЕсли;
		ЭлементDOM = РезультатXPath.ПолучитьСледующий();
	КонецЦикла;
	
	Возврат ТаблицаВозврата;
	
КонецФункции

//---------------------------------------------------------

Функция ВернутьЗначениеРеквизитаИзСтрокиДерева(ПараметрыКалькуляции, СтрокаДерева, ТекЭлемент, ТекОбъект = Неопределено)
	
	Шапка = ПараметрыКалькуляции.Шапка;
	Детали = ПараметрыКалькуляции.Детали;
	Работы = ПараметрыКалькуляции.Работы;
	
	Тип = СтрокаДерева["Тип"];
	ВхЗначение = СтрокаДерева["Значение"];
	ИмяРеквизита = СтрокаДерева["Реквизит"];
	
	Если НЕ ЗначениеЗаполнено(ВхЗначение) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Тип = "Параметр Сеанса" Тогда
		Значение = ПараметрыСеанса[ВхЗначение];
	ИначеЕсли Тип = "Поле Калькуляции" Тогда
		Попытка
			Значение = Вычислить(ВхЗначение);
		Исключение
			ВызватьИсключение "Описание:" + ОписаниеОшибки() + "; Вычисляемое значение: " + ВхЗначение;
		КонецПопытки;
	ИначеЕсли Тип = "Фиксированое Значение" Тогда
		Значение =ВхЗначение;
	ИначеЕсли Тип = "Вычисляемое значение" Тогда
		Попытка
			Значение = Вычислить(ВхЗначение);
		Исключение
			ВызватьИсключение "Описание:" + ОписаниеОшибки() + "; Вычисляемое значение: " + ВхЗначение;
		КонецПопытки;
	КонецЕсли;
	
	ТипРеквизита = ВернутьОписаниеТиповРеквизита(ТекЭлемент[ИмяРеквизита]);
	
	Возврат ТипРеквизита.ПривестиЗначение(Значение);
	
КонецФункции

//---------------------------------------------------------

Функция ВернутьОписаниеТиповРеквизита(Реквизит)
	
	Массив = Новый Массив;
	КС = Новый КвалификаторыСтроки(100);
	КД = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
	КЧ = Новый КвалификаторыЧисла(15,2);
	Массив.Добавить(ТипЗнч(Реквизит));
	Возврат Новый ОписаниеТипов(Массив, Кч, Кс, Кд);
	
КонецФункции // ВернутьТипРеквизита()

Функция ПолучитьОписаниеТиповПЗ()
	
	Массив = Новый Массив;
	Для Каждого МетаданныеОбъектов Из Метаданные.Справочники Цикл
		Массив.Добавить(Тип("СправочникСсылка."+МетаданныеОбъектов.Имя));
	КонецЦикла; 
	Для Каждого МетаданныеОбъектов Из Метаданные.ДОкументы Цикл
		Массив.Добавить(Тип("ДокументСсылка."+МетаданныеОбъектов.Имя));
	КонецЦикла; 
	Для Каждого МетаданныеОбъектов Из Метаданные.Перечисления Цикл
		Массив.Добавить(Тип("ПеречислениеСсылка."+МетаданныеОбъектов.Имя));
	КонецЦикла;
	Массив.Добавить(Тип("Строка"));
	Массив.Добавить(Тип("Дата"));
	Массив.Добавить(Тип("Булево"));
	КС = Новый КвалификаторыСтроки(500);
	Возврат Новый ОписаниеТипов(Массив, , КС);
	
КонецФункции // ПОлучитьОписаниеТиповПЗ()

//---------------------------------------------------------

Процедура ЗаполнитьСтоимость(ПараметрыРасчета, Стоимость, ВхТаблица, СтрокаВхТаблицы)

	Если ВхТаблица.Колонки.Найти("ЦенаРубли") = Неопределено Тогда
		ВхТаблица.Колонки.Добавить("ЦенаРубли")
	КонецЕсли;
	Если ВхТаблица.Колонки.Найти("ЦенаЕвро") = Неопределено Тогда
		ВхТаблица.Колонки.Добавить("ЦенаЕвро")
	КонецЕсли;
	Курс = ?(ПараметрыРасчета["Курс"] = "", 0, Число(ПараметрыРасчета["Курс"]));
	ОкрСтоимость = Окр(Стоимость, 2);
	Попытка
		СтрокаВхТаблицы.ЦенаРубли = ?(ВРег(СокрЛП(ПараметрыРасчета["ВалРасч"]))="RUR", ОкрСтоимость, Окр(Стоимость*Курс, 2));
		СтрокаВхТаблицы.ЦенаЕвро = ?(ВРег(СокрЛП(ПараметрыРасчета["ВалРасч"]))="EUR", ОкрСтоимость, Окр(Стоимость/Курс, 2));
	Исключение
	КонецПопытки;

КонецПроцедуры

Функция ВычислитьДату(ДатаСтрокой)
	
	Дата = Лев(СтрЗаменить(ДатаСтрокой, "T", " "), Найти(ДатаСтрокой, ".")-1);
	Дата = СтрЗаменить(Дата, "-", "");
	Дата = СтрЗаменить(Дата, ":", "");
	Дата = СтрЗаменить(Дата, " ", "");
	Если ЗначениеЗаполнено(Дата) Тогда
		Возврат Дата(Дата);
	Иначе
		Возврат Дата(1,1,1);
	КонецЕсли;
	
КонецФункции

// Функция осуществляет чтение XML через DOM
//
// Параметры:
//  СтрокаXML = xml для чтения
//
// Возвращаемое значение - документ DOM
//
Функция ВернутьДОМ(СтрокаXML) Экспорт
	
	ЧтениеХМЛ = Новый ЧтениеXML();
	ЧтениеХМЛ.УстановитьСтроку(СтрокаXML);
	
	ПостроительДом = Новый ПостроительDOM();
	Попытка
		ДокументДОМ = ПостроительДом.Прочитать(ЧтениеХМЛ);
	Исключение
		#Если Клиент Тогда
		Предупреждение(ОписаниеОшибки(),, "Ошибка при чтении файла XML");
		#КонецЕсли
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ДокументДОМ;
	
КонецФункции

Процедура ЗаполнитьТаблицу1изТаблицы2ЧерезСтруктуру(ТаблицаПриёмник, ТаблицаИсточник, СтруктураПолей)

	Для Каждого СтрокаВрТбл Из ТаблицаИсточник Цикл
		Строка = ТаблицаПриёмник.Добавить();
		Для Каждого Элемент Из СтруктураПолей Цикл
			Если ТаблицаИсточник.Колонки.Найти(Элемент.Значение) = Неопределено Тогда
				Попытка
					Строка[Элемент.Ключ] = Вычислить(Элемент.Значение);
				Исключение
					Строка[Элемент.Ключ] = "";
				КонецПопытки;
			Иначе
				Строка[Элемент.Ключ] = СтрокаВрТбл[Элемент.Значение];
			КонецЕсли;			
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

Функция ВернутьВозможноеЗначение(Коллекция, Имя)
	Попытка
		Возврат Коллекция[Имя];
	Исключение
		Возврат "";
	КонецПопытки;
КонецФункции // ВернутьВозможноеЗначение()

///////////////////////////////////////////////////////////
// ФУНКЦИИ ДЛЯ ВЫЗОВА ИЗ МАСТЕРА НАСТРОЕК

Функция ПодчСпр(СпрВид, Владелец)

	Спр = Справочники[СпрВид].Выбрать(, Владелец);
	Если Спр.Следующий() Тогда
		Возврат Спр.Ссылка;
	КонецЕсли;

КонецФункции

///////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОТОБРАЖЕНИЯ ИНФОРМАЦИИ

// Процедура осуществляет отображение таблицы
//
// Параметры:
//  ТаблицаДляВывода - выводимая таблица
//
Процедура ОтобразитьТаблицу(ТаблицаДляВывода) Экспорт
	
	ВспомогательнаяФорма = ЭтотОбъект.ПолучитьФорму("ВспомогательнаяФорма");
	Если ВспомогательнаяФорма.Открыта() Тогда
		ВспомогательнаяФорма.Закрыть();// при открытии выполняется создание колонок
	КонецЕсли;	
	ВспомогательнаяФорма.ТаблицаРезультатаПрочтения = ТаблицаДляВывода.Скопировать();
	ВспомогательнаяФорма.Открыть();
	
КонецПроцедуры

// Процедура осуществляет отображение дерева
//
// Параметры:
//  ТаблицаДляВывода - выводимая таблица
//
Процедура ОтобразитьДерево(ТаблицаДляВывода) Экспорт
	
	ВспомогательнаяФорма = ЭтотОбъект.ПолучитьФорму("ВспомогательнаяФормаДерево");
	Если ВспомогательнаяФорма.Открыта() Тогда
		ВспомогательнаяФорма.Закрыть();
	КонецЕсли;
	ВспомогательнаяФорма.ТаблицаРезультатаПрочтения = ТаблицаДляВывода.Скопировать();
	ВспомогательнаяФорма.Открыть();
	
КонецПроцедуры

Процедура ПоказатьТаблицы(СтруктураТаблицДляВывода)

	Для Каждого Элемент Из СтруктураТаблицДляВывода Цикл
		Таблица = Элемент.Значение;
		Таблица.Колонки.Добавить("ИмяТаблицы");
		Таблица.ЗаполнитьЗначения(Элемент.Ключ, "ИмяТаблицы");
		Построитель = Новый ПостроительОтчета;
		Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Таблица);
		Построитель.Вывести();
	КонецЦикла;

КонецПроцедуры

// Процедура для вывода сообщения пользователю в режиме клиента
//
// Параметры:
//  Текст - текст сообщения
//  ИндексРежима - режим вовда сообщения
//
Процедура Сообщение(Текст, ИндексРежима = 0) Экспорт
	
	Если ВыводитьСообщения Тогда
		Режим = Новый СписокЗначений;
		Режим.Добавить(СтатусСообщения.БезСтатуса);
		Режим.Добавить(СтатусСообщения.Важное);
		Режим.Добавить(СтатусСообщения.Внимание);
		Режим.Добавить(СтатусСообщения.Информация);
		Режим.Добавить(СтатусСообщения.Обычное);
		Режим.Добавить(СтатусСообщения.ОченьВажное);
		
		Попытка
			#Если Клиент Тогда
			Сообщить(Текст, Режим[ИндексРежима].Значение);
			#КонецЕсли
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьСтрокуXML(Строка, ИмяФайла)
	
	ТекстовыйДок = Новый ТекстовыйДокумент;
	ТекстовыйДок.УстановитьТипФайла(КодировкаТекста.UTF8);
	ТекстовыйДок.УстановитьТекст(Строка);
	ТекстовыйДок.Записать(ИмяФайла);
	Сообщение(ИмяФайла, 3);
	
КонецПроцедуры

// Функция осуществляет регистрацию библиотеки auda.dll в системе
//
// Параметры:
//  Спредупреждением - флаг вывода предупреждений
//
// Возвращаемое значение - признак регистрации библиотеки
//
Функция ЗарегистрироватьБиблиотеку(Спредупреждением = Ложь) Экспорт
	
	Если БиблиотекаЗарегистрирована() Тогда
		Возврат Истина
	КонецЕсли;
	
	// компонента
	рИмяФайла = КаталогИмпорта + "\" + "AudaReg" + ".ini";
	кИмяФайла = КаталогИмпорта + "\" + "auda" + ".dll";
	кФайл = Новый Файл(кИмяФайла);
	рФайл = Новый Файл(рИмяФайла);
	Если кФайл.Существует() Тогда
		Если НЕ рФайл.Существует() Тогда
			Попытка
				
				//Ком = Новый COMObject("wScript.Shell");
				//Ком.Run("Regsvr32.exe " + кИмяФайла);
				#Если Клиент Тогда
				ЗапуститьПриложение("Regsvr32.exe """ + кИмяФайла + """");
				#Иначе
				Ком		= Новый COMObject("wScript.Shell");
				Ком.Run("""Regsvr32.exe """ + кИмяФайла + """" + """");
				#КонецЕсли
			
				Если Спредупреждением Тогда
					#Если Клиент Тогда
					Предупреждение("Дождитесь окна сообщения о регистрации DLL и нажмите ОК!", 10);
					#КонецЕсли
				КонецЕсли;
				
			Исключение
				Сообщение("Не удалось зарегистрировать компоненту. "+Символы.ПС+"Возможно нет прав, обратитесь за помощью к системному администратору.", 1);
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;
	Иначе
		Сообщение("Не удалось зарегистрировать компоненту. "+Символы.ПС+"В каталоге импорта отсутствует библиотека 'Auda.dll'", 1);
		Возврат Ложь;
	КонецЕсли;
	
	Зарегистириована = БиблиотекаЗарегистрирована();
	Если Зарегистириована Тогда
		ЗначениеВФайл(рИмяФайла, Истина);
	КонецЕсли;
	
	Возврат Зарегистириована
	
КонецФункции

// Функция проверяет корректность каталога импорта
//
// Возвращаемое значение - булево, каталог корректен
//
Функция ПроверкаКаталогаИмпорта() Экспорт

	Каталог = Новый Файл(КаталогИмпорта);
	Если (НЕ Каталог.Существует()) ИЛИ (НЕ Каталог.ЭтоКаталог()) Тогда
		Сообщение("Некорректно указан каталог обмен """+КаталогИмпорта+"""",1);
		Возврат Ложь;
	КонецЕсли;

	ИмяФайла	= КаталогИмпорта + "/ini.ini";
	ФайлИНИ		= Новый Файл(ИмяФайла);
	Если НЕ ФайлИНИ.Существует() Тогда
		ИНИ		= Новый ТаблицаЗначений();
		ИНИ.Колонки.Добавить("ИмяШаблона");
		ИНИ.Колонки.Добавить("ТекШаблон");
		Для Каждого Шаблон Из ЭтотОбъект.Метаданные().Макеты Цикл
			Если Шаблон.Комментарий = "Шаблон" Тогда
				СтрокаИНИ = ИНИ.Добавить();
				СтрокаИНИ.ИмяШаблона = Шаблон.Имя;
			КонецЕсли;
		КонецЦикла;
		ИНИ.ЗаполнитьЗначения(Ложь, "ТекШаблон");
		ЗначениеВФайл(ИмяФайла, ИНИ);
		
		Если НЕ ФайлИНИ.Существует() Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	// распаковка шаблонов
	ИНИ	= ЗначениеИзФайла(ИмяФайла);
	Для Каждого Шаблон Из ИНИ Цикл
		шИмяФайла	= КаталогИмпорта + "/" + Шаблон.ИмяШаблона + ".xml";
		шФайл		= Новый Файл(шИмяФайла);
		Если НЕ шФайл.Существует() Тогда
			Попытка
				шДвоичныеДанные = ЭтотОбъект.ПолучитьМакет(Шаблон.ИмяШаблона);
				шДвоичныеДанные.Записать(шИмяФайла);
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	// Лог файл
	ИмяФайла	= КаталогИмпорта + "/log.tbl";
	ФайлЛог		= Новый Файл(ИмяФайла);
	Если НЕ ФайлЛог.Существует() Тогда
		Лог	= Новый ТаблицаЗначений();
		Лог.Колонки.Добавить("ВидДок");
		Лог.Колонки.Добавить("UIN");
		Лог.Колонки.Добавить("CaseID");
		Лог.Колонки.Добавить("TaskID");
		Лог.Колонки.Добавить("ДатаРасч");
		ЗначениеВФайл(ИмяФайла, Лог);
	КонецЕсли;

	// Лог файл для синхронизации номенклатуры
	ИмяФайла	= КаталогИмпорта + "/GoodsTune.tbl";
	ФайлЛог		= Новый Файл(ИмяФайла);
	Если НЕ ФайлЛог.Существует() Тогда
		Лог		= Новый ТаблицаЗначений;
		Лог.Колонки.Добавить("Имя");
		Лог.Колонки.Добавить("UIN");
		ЗначениеВФайл(ИмяФайла, Лог);
	КонецЕсли;

	Возврат Истина;
	
КонецФункции // ПроверкаКаталогаИмпорта()

///////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ МАСТЕРА СИ

// Функция возвращает список синонимов документов
//
// Возвращаемое значение - список синонимов из метаданных
//
Функция ВернутьСписокСинонимовДокументов() Экспорт
	СписокЗначений = Новый СписокЗначений;
	Для Каждого МетаданныеОбъектов Из Метаданные.Документы Цикл
		Если ВРег(МетаданныеОбъектов.Имя)="ЗАКАЗНАРЯД" Тогда
			СписокЗначений.Добавить(ВРег(МетаданныеОбъектов.Имя), МетаданныеОбъектов.Синоним);
		КонецЕсли;
	КонецЦикла;
	Возврат СписокЗначений;
КонецФункции

// Функция осуществляет разбор объекта в дерево значений
//
// Параметры:
//  ОбъектРазбора - объект для разбора
//
// Возвращаемое значение - дерево значений после разбора
//
Функция РазобратьОбъектВДерево(ОбъектРазбора) Экспорт

	Дерево = СоздатьТипизированноеДерево();
	
	Для Каждого Реквизит Из ОбъектРазбора Цикл
		СтрокаДерева = Дерево.Строки.Добавить();
		СтрокаДерева.Реквизит = Реквизит.Имя;
		СтрокаДерева.Синоним = Реквизит.Синоним;
		СтрокаДерева.UIN = Новый УникальныйИдентификатор;
		
		МассивТипов = Новый Массив;
		Для Каждого тип Из Реквизит.Тип.Типы() Цикл
			Если МассивССТипов.Найти(тип) <> Неопределено Тогда
				МассивТипов.Добавить(тип);
			КонецЕсли;
		КонецЦикла;
		
		СтрокаДерева.ТипВыбираемогоЗнч = Реквизит.Тип.Типы()[0];
		СтрокаДерева.ОбъектМД = Неопределено;
		СтрокаДерева.МассивТипов = Реквизит.Тип.Типы();
		
		
		Если ОбъектОбразуетСсылочныйТип(Реквизит) Тогда
			СтрокаДерева.ОбъектМД = Неопределено;
			ОбъектМД = Новый (МассивТипов[0]);
			КоличествоВладельцев = 0;
			Для Каждого Владелец Из ОбъектМД.Метаданные().Владельцы Цикл
				КоличествоВладельцев = КоличествоВладельцев + 1;
			КонецЦикла;
			СтрокаДерева.КоличествоВладельцев = КоличествоВладельцев;
			СтрокаДерева.ОбъектМД = ОбъектМД;
			ДобавитьВеткуРеквизитовВДрево(ОбъектМД, СтрокаДерева, Реквизит);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Дерево;
КонецФункции

// Процедура осуществляет добавление ветки реквизитов в дерево
//
// Параметры:
//  Реквизиты - реквизиты
//  Дерево - дерево
//  объект - объект
//
Процедура ДобавитьВеткуРеквизитовВДрево(Реквизиты, Дерево, объект = неопределено) Экспорт
	
	Если Реквизиты.МетаДанные().Иерархический Тогда
		Массив = Новый массив;
		Массив.Добавить(ТипЗнч(Реквизиты));
		ТипЗнч = Новый ОписаниеТипов(Массив);
		
		СтрокаДерева = Дерево.Строки.Добавить();
		СтрокаДерева.Реквизит = "Родитель";
		СтрокаДерева.Синоним = "Родитель";
		СтрокаДерева.UIN = Новый УникальныйИдентификатор;
		СтрокаДерева.ТипВыбираемогоЗнч = ТипЗнч;
		СтрокаДерева.ОбъектМД = Неопределено;
		СтрокаДерева.МассивТипов = Массив;
	КонецЕсли;
	
	Массив = Новый массив;
	Массив.Добавить(Тип("Строка"));
	ТипЗнч = Новый ОписаниеТипов(Массив, , Новый КвалификаторыСтроки(Реквизиты.метаданные().ДлинаНаименования));
	
	СтрокаДерева = Дерево.Строки.Добавить();
	СтрокаДерева.Реквизит = "Наименование";
	СтрокаДерева.Синоним = "Наименование";
	СтрокаДерева.UIN = Новый УникальныйИдентификатор;
	СтрокаДерева.ТипВыбираемогоЗнч = ТипЗнч;
	СтрокаДерева.ОбъектМД = Неопределено;
	СтрокаДерева.МассивТипов = Массив;
	
	Массив = Новый массив;
	Если ТипЗнч(Реквизиты.метаданные().ТипКода) = Тип("Строка") Тогда
		Массив = Новый массив;
		Массив.Добавить(Тип("Строка"));
		ТипЗнч = Новый ОписаниеТипов(Массив, , Новый КвалификаторыСтроки(Реквизиты.метаданные().ДлинаКода));
	Иначе
		Массив = Новый массив;
		Массив.Добавить(Тип("Число"));
		ТипЗнч = Новый ОписаниеТипов(Массив, , Новый КвалификаторыСтроки(Реквизиты.метаданные().ДлинаКода));
	КонецЕсли;
	
	СтрокаДерева = Дерево.Строки.Добавить();
	СтрокаДерева.Реквизит = "Код";
	СтрокаДерева.Синоним = "Код";
	СтрокаДерева.UIN = Новый УникальныйИдентификатор;
	СтрокаДерева.ТипВыбираемогоЗнч = ТипЗнч;
	СтрокаДерева.ОбъектМД = Неопределено;
	СтрокаДерева.МассивТипов = Массив;
	
	Если Реквизиты.метаданные().Владельцы.Количество() > 0 Тогда
		Массив = Новый массив;
		Массив.Добавить(Тип("Строка"));
		ТипЗнч = Новый ОписаниеТипов(Массив);
		
		СтрокаДерева = Дерево.Строки.Добавить();
		СтрокаДерева.Реквизит = "Владелец";
		СтрокаДерева.Синоним = "Владелец";
		СтрокаДерева.UIN = Новый УникальныйИдентификатор;
		СтрокаДерева.ТипВыбираемогоЗнч = ТипЗнч;
		СтрокаДерева.ОбъектМД = Неопределено;
		СтрокаДерева.МассивТипов = Массив;
	КонецЕсли;

	Для Каждого СубРеквизит Из Реквизиты.метаданные().Реквизиты Цикл
		#Если Клиент Тогда
		ОбработкаПрерыванияПользователя();
		#КонецЕсли
		СтрокаДерева = Дерево.Строки.Добавить();
		СтрокаДерева.Реквизит = СубРеквизит.Имя;
		СтрокаДерева.Синоним = СубРеквизит.Синоним;
		СтрокаДерева.UIN = Новый УникальныйИдентификатор;
		СтрокаДерева.ТипВыбираемогоЗнч = ТипЗнч(Реквизиты[СубРеквизит.Имя]);
		СтрокаДерева.ОбъектМД = Неопределено;
		
		МассивТипов = Новый Массив;
		Для Каждого тип Из Реквизиты.метаданные().Реквизиты[Субреквизит.Имя].Тип.Типы() Цикл
			Если МассивССТипов.Найти(тип) <> Неопределено Тогда
				МассивТипов.Добавить(тип);
			КонецЕсли;
		КонецЦикла;
		
		СтрокаДерева.МассивТипов = Реквизиты.метаданные().Реквизиты[Субреквизит.Имя].Тип.Типы();
		Если ОбъектОбразуетСсылочныйТип(СубРеквизит) Тогда
			Попытка
				СтрокаДерева.ОбъектМД = Новый (ТипЗнч(Реквизиты[СубРеквизит.Имя]));
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Функция проверяет образует ли объект ссылочный тип
//
// Параметры:
//  ОбъектМД - объект метаданных для проверки
//
// Возвращаемое значение - булево
//
Функция ОбъектОбразуетСсылочныйТип(ОбъектМД) Экспорт
	Если ОбъектМД = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого тип Из ОбъектМД.Тип.Типы() Цикл
		Если МассивССТипов.Найти(тип) <> Неопределено Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;
КонецФункции

Функция ПолучитьМассивСсыылочныхТипов()
	Массив = Новый Массив;
	Для Каждого МетаданныеОбъектов Из Метаданные.Справочники Цикл
		Массив.Добавить(Тип("СправочникСсылка."+МетаданныеОбъектов.Имя));
	КонецЦикла; 
	
	Возврат Массив;
КонецФункции

Функция ПолучитьОписаниеТиповДляВыбора()
	Массив = Новый Массив;
	Для Каждого МетаданныеОбъектов Из Метаданные.Справочники Цикл
		Массив.Добавить(Тип("СправочникСсылка."+МетаданныеОбъектов.Имя));
	КонецЦикла; 
	Для Каждого МетаданныеОбъектов Из Метаданные.ДОкументы Цикл
		Массив.Добавить(Тип("ДокументСсылка."+МетаданныеОбъектов.Имя));
	КонецЦикла; 
	Для Каждого МетаданныеОбъектов Из Метаданные.ПланыВидовХарактеристик Цикл
		Массив.Добавить(Тип("ПланВидовХарактеристикСсылка."+МетаданныеОбъектов.Имя));
	КонецЦикла; 
	Для Каждого МетаданныеОбъектов Из Метаданные.ПланыСчетов Цикл
		Массив.Добавить(Тип("ПланСчетовСсылка."+МетаданныеОбъектов.Имя));
	КонецЦикла; 
	Для Каждого МетаданныеОбъектов Из Метаданные.ПланыВидовРасчета Цикл
		Массив.Добавить(Тип("ПланВидовРасчетаСсылка."+МетаданныеОбъектов.Имя));
	КонецЦикла; 
	Для Каждого МетаданныеОбъектов Из Метаданные.ПланыОбмена Цикл
		Массив.Добавить(Тип("ПланОбменаСсылка."+МетаданныеОбъектов.Имя));
	КонецЦикла; 
	Для Каждого МетаданныеОбъектов Из Метаданные.БизнесПроцессы Цикл
		Массив.Добавить(Тип("БизнесПроцессСсылка."+МетаданныеОбъектов.Имя));
	КонецЦикла; 
	Для Каждого МетаданныеОбъектов Из Метаданные.Задачи Цикл
		Массив.Добавить(Тип("ЗадачаСсылка."+МетаданныеОбъектов.Имя));
	КонецЦикла; 
	Для Каждого МетаданныеОбъектов Из Метаданные.Перечисления Цикл
		Массив.Добавить(Тип("ПеречислениеСсылка."+МетаданныеОбъектов.Имя));
	КонецЦикла;
	Массив.Добавить(Тип("Строка"));
	Массив.Добавить(Тип("Дата"));
	Массив.Добавить(Тип("Булево"));
	КС = Новый КвалификаторыСтроки(500);
	КЧ = Новый КвалификаторыЧисла(15,2, ДопустимыйЗнак.Любой);
	Возврат Новый ОписаниеТипов(Массив, КЧ, КС);
КонецФункции

// Функция осуществляет формирование таблицы значений
// для осуществления синхронизации реквизитов
//
// Параметры:
// СИ - схема импорта
//
// Возвращаемое значение - таблица синхронизации
//
Функция СоздатьТаблицуСинхронизации(СИ) Экспорт

	ТС = Новый ТаблицаЗначений;
	// новые:
	БулевМассив = Новый Массив;
	БулевМассив.Добавить(Тип("Булево"));
	БулевоОписание = Новый ОписаниеТипов(БулевМассив);
	ТС.Колонки.Добавить("Создавать", БулевоОписание, "Создавть эл-ты", 15);
	ТС.Колонки.Добавить("Поле", , "Синхронизируемое поле", 50);
	ТС.Колонки.Добавить("Дерево", , "Раздел", 20);
	// те, что есть в дереве:
	ТС.Колонки.Добавить("Реквизит", , "Реквизит", 25);
	ТС.Колонки.Добавить("Тип", , "Тип значения синхронизации", 25);
	ТС.Колонки.Добавить("ТипВыбираемогоЗнч");
	ТС.Колонки.Добавить("Значение", ОписаниеТиповДляВыбора, "Значение синхронизации", 50);
	ТС.Колонки.Добавить("UIN", , "UIN строки дерева");
	ТС.Колонки.Добавить("Системное", , "Системная колонка");
	ТС.Колонки.Добавить("ОбъектМД", , "ОбъектМД");
	ТС.Колонки.Добавить("МассивТипов");
	
	ЗаполнитьТСизДерева("Документ", СИ, ТС);
	ЗаполнитьТСизДерева("Детали", СИ, ТС);
	ЗаполнитьТСизДерева("Работы", СИ, ТС);
	
	ТС.ЗаполнитьЗначения("Поле Калькуляции", "Тип");
	ТС.ЗаполнитьЗначения("", "Значение");
	ТС.ЗаполнитьЗначения("Наименование", "Реквизит");
	ТС.ЗаполнитьЗначения(Истина, "Создавать");
	
	Возврат ТС;

КонецФункции

// Процедура заполнения ветки схемы импорта из дерева
//
// Параметры:
//  ВеткаСИ - ветка схемы импорта
//  Дерево - дерево значений
//
Процедура ЗаполнитьВеткуСИизДерева(ВеткаСИ, Дерево) Экспорт

	Строки = Дерево.Строки;
	СтрокиВеткиСИ = ВеткаСИ.Строки;
	Для Каждого Строка Из Строки Цикл
		строкАветкиСИ = СтрокиВеткиСИ.Добавить();
		ЗаполнитьЗначенияСвойств(строкАветкиСИ, Строка);
		Если Строка.Строки.Количество() > 0 Тогда
			ЗаполнитьВеткуСИизДерева(строкАветкиСИ, Строка);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьПутьСтрокиДерева(СтрСинх)

	ВозврЗнч = Строка(СтрСинх.Реквизит);
	Если СтрСинх.Уровень() > 0 Тогда
		РодитЗнч = ПолучитьПутьСтрокиДерева(СтрСинх.Родитель);
		РодитЗнч = ?(ПустаяСтрока(РодитЗнч), "", РодитЗнч + ".");
		ВозврЗнч = РодитЗнч + ВозврЗнч;
	КонецЕсли;
	Возврат ВозврЗнч;
	
КонецФункции // ПолучитьПутьСтокиДерева(СтрСинх)

Процедура ЗаполнитьТСизДерева(ИмяДерева, СИ, ТС)

	Поддерево = СИ.Строки.Найти(ИмяДерева, "Синоним").Строки;
	СтрокиСинхронизации = Поддерево.НайтиСтроки(Новый Структура("Тип", "Найти / Создать Элемент Справочника"), Истина);
	Для Каждого СтрСинх Из СтрокиСинхронизации Цикл
		СтрокаТабСинх = ТС.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТабСинх, СтрСинх);
		СтрокаТабСинх.Дерево = ИмяДерева;
		СтрокаТабСинх.Поле = ПолучитьПутьСтрокиДерева(СтрСинх);
	КонецЦикла;

КонецПроцедуры

// Функция осуществляет формирование типизированного дерева значений
// для работы со схемой импорта данных
//
// Возвращаемое значение - дерево значений для работы со схемой импорта
//
Функция СоздатьТипизированноеДерево() Экспорт 
	
	Массив = Новый массив;
	Массив.Добавить(Тип("Число"));
	
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("Синоним", , "Реквизит Документа", 25);
	Дерево.Колонки.Добавить("Реквизит", , "Имя реквизита", 25);
	Дерево.Колонки.Добавить("Тип", , "Тип Значения", 25);
	Дерево.Колонки.Добавить("ТипВыбираемогоЗнч");
	Дерево.Колонки.Добавить("Значение", ОписаниеТиповДляВыбора, "Значение", 25);
	Дерево.Колонки.Добавить("Системное", , "Системная колонка");
	Дерево.Колонки.Добавить("ОбъектМД", , "ОбъектМД");
	Дерево.Колонки.Добавить("UIN", , "UIN Строки дерева");
	Дерево.Колонки.Добавить("МассивТипов");
	Дерево.Колонки.Добавить("КоличествоВладельцев", Новый ОписаниеТипов(Массив));
	БулевМассив = Новый Массив;
	БулевМассив.Добавить(Тип("Булево"));
	БулевоОписание = Новый ОписаниеТипов(БулевМассив);
	Дерево.Колонки.Добавить("Создавать", БулевоОписание, "Создавть эл-ты", 15);
	Возврат Дерево;
КонецФункции

///////////////////////////////////////////////////////////
// НЕИСПОЛЬЗУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

///////////////////////////////////////////////////////////
// ТЕЛО МОДУЛЯ

МассивССТипов			= ПолучитьМассивСсыылочныхТипов();
ОписаниеТиповДляВыбора	= ПолучитьОписаниеТиповДляВыбора();
ВыводитьСообщения		= Истина;
Тестирование			= Ложь;
ДокументОбъект			= Неопределено;
ФормаДока				= Неопределено;

#Если Клиент Тогда
Login		= ВосстановитьЗначение("адтЛогин");
Password	= ВосстановитьЗначение("адтПароль");
#КонецЕсли