
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Проверка на доступ к работе с АРМ
	Если НЕ Renault_РаботаСПравамиПользователя.ЕстьПравоИзменятьПравилаУчастияВПрограммеЛояльности(ПараметрыСеанса.Пользователь) Тогда
		Предупреждение("У вас нет прав на изменение правил участия.");
		Отказ = Истина;
		Возврат;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОтборДЦ = Renault_РаботаСПравамиПользователя.ДилерскийЦентрПоУмолчанию(ПараметрыСеанса.Пользователь);
	
	Отказать = ЛОЖЬ;
	
	Выборка = Справочники.Renault_ПравилаУчастияВПрограммеЛояльности.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Ссылка = ТекущийОбъект.Ссылка Тогда
			Продолжить;
		КонецЕсли;
		
		Если (ТекущийОбъект.СуммаВсегоЗаказНарядОт <= Выборка.СуммаВсегоЗаказНарядОт И ТекущийОбъект.СуммаВсегоЗаказНарядДо >= Выборка.СуммаВсегоЗаказНарядДо)
			ИЛИ (ТекущийОбъект.СуммаВсегоЗаказНарядОт >= Выборка.СуммаВсегоЗаказНарядОт И ТекущийОбъект.СуммаВсегоЗаказНарядДо <= Выборка.СуммаВсегоЗаказНарядДо)
			ИЛИ (ТекущийОбъект.СуммаВсегоЗаказНарядОт <= Выборка.СуммаВсегоЗаказНарядОт И ТекущийОбъект.СуммаВсегоЗаказНарядДо >= Выборка.СуммаВсегоЗаказНарядОт)
			Тогда
			
			
			Если ТекущийОбъект.СуммаВсегоЗаказНарядОт > 0 ИЛИ ТекущийОбъект.СуммаВсегоЗаказНарядДо > 0 Тогда
				
				Сообщить("Есть свопадения по сумме заказ-наряда.");
				
				Отказать = Истина;
				
			КонецЕсли;
			
			
		ИначеЕсли (ТекущийОбъект.СуммаВсегоРаботОт <= Выборка.СуммаВсегоРаботОт И ТекущийОбъект.СуммаВсегоРаботДо >= Выборка.СуммаВсегоРаботДо)
			ИЛИ (ТекущийОбъект.СуммаВсегоРаботОт >= Выборка.СуммаВсегоРаботОт И ТекущийОбъект.СуммаВсегоРаботДо <= Выборка.СуммаВсегоРаботДо)
			ИЛИ (ТекущийОбъект.СуммаВсегоРаботОт <= Выборка.СуммаВсегоРаботОт И ТекущийОбъект.СуммаВсегоРаботДо >= Выборка.СуммаВсегоРаботОт)
			Тогда 
			
			Если ТекущийОбъект.СуммаВсегоРаботОт > 0 ИЛИ ТекущийОбъект.СуммаВсегоРаботДо > 0 Тогда
				
				Сообщить("Есть свопадения по сумме работ.");
				
				Отказать = Истина; 
				
			КонецЕсли;
			
			
		ИначеЕсли (ТекущийОбъект.СуммаВсегоЗапчастейОт <= Выборка.СуммаВсегоЗапчастейОт И ТекущийОбъект.СуммаВсегоЗапчастейДо >= Выборка.СуммаВсегоЗапчастейДо)
			ИЛИ (ТекущийОбъект.СуммаВсегоЗапчастейОт >= Выборка.СуммаВсегоЗапчастейОт И ТекущийОбъект.СуммаВсегоЗапчастейДо <= Выборка.СуммаВсегоЗапчастейДо)
			ИЛИ (ТекущийОбъект.СуммаВсегоЗапчастейОт <= Выборка.СуммаВсегоЗапчастейОт И ТекущийОбъект.СуммаВсегоЗапчастейДо >= Выборка.СуммаВсегоЗапчастейОт)
			Тогда 
			
			Если ТекущийОбъект.СуммаВсегоЗапчастейОт > 0 ИЛИ ТекущийОбъект.СуммаВсегоЗапчастейДо > 0 Тогда
				
				Сообщить("Есть свопадения по сумме запчастей.");
				
				Отказать = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
		
	КонецЦикла;
	
	Если Отказать = Истина Тогда
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры
