
//#Область Шаблон

//+общие функции
Функция ИмяЗакладки() Возврат ПунктыМеню[ТекущаяЗакладкаМеню].Значение КонецФункции
Функция ИмяСписка() Возврат "сп"+ИмяЗакладки() КонецФункции 
Функция ТекстЗапросИсточникаДанных(ИмяСписка) Возврат ?(ЭтаФорма[ИмяСписка].ПроизвольныйЗапрос,ЭтаФорма[ИмяСписка].ТекстЗапроса,"") КонецФункции	
Функция ПолучитьИсточникНаСервере(ИмяСписка) Возврат Renault_ОбщиеФункции.ИсточникДанныхФормы(ЭтаФорма,ИмяСписка) КонецФункции
Функция ПолучитьПроизвольныйИсточникНаСервере(ИмяСписка) Возврат Renault_ОбщиеФункции.ПроизвольныйИсточникДанных(ТекстЗапросИсточникаДанных(ИмяСписка)) КонецФункции
//-общие функции

Процедура УстановитьОтбор()
	
	Сп=Новый Массив;
	//Сп.Добавить(спРабочиеЛисты);
	//Сп.Добавить(спСобытия);
	//Сп.Добавить(спРаботаСТрафиком);
	//Сп.Добавить(спЗапросыНаЗакрытие);
	Для Каждого Список Из Сп Цикл
		Эл=Список.Отбор.Элементы[0]; Эл.ПравоеЗначение=ДилерскийЦентр; Эл.Использование=Не ДилерскийЦентр.Пустая();
		Эл=Список.Отбор.Элементы[1]; Эл.ПравоеЗначение=Отдел; Эл.Использование=Не Отдел.Пустая();
	КонецЦикла;	
	
	////отбор по задачам где по исполнителю либо с пустым исполнителем но своим отделом	
	//Права=ПараметрыСеанса.Renault_ПраваПользователя;
	//спЗадачи.Отбор.Элементы.Очистить();
	//
	////Если ВключенОтборЗадачи Тогда 
	//	ГруппаОтбораИли=спЗадачи.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	//	ГруппаОтбораИли.Использование=Истина;
	//	ГруппаОтбораИли.ТипГруппы=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	//	
	//	ЭлементОтбора=ГруппаОтбораИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	//	ЭлементОтбора.Использование=Истина;
	//	ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Исполнитель");
	//	ЭлементОтбора.ПравоеЗначение=ПараметрыСеанса.Пользователь;
	//	
	//	ЭлементОтбора=ГруппаОтбораИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	//	ЭлементОтбора.Использование=Истина;
	//	ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Автор");
	//	ЭлементОтбора.ПравоеЗначение=ПараметрыСеанса.Пользователь;
	//	
	//	ГруппаОтбораИ=ГруппаОтбораИли.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	//	ГруппаОтбораИ.Использование=Истина;
	//	ГруппаОтбораИ.ТипГруппы=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	//	
	//	//ДилерскийЦентр
	//	ЭлементОтбора=ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	//	ЭлементОтбора.Использование=Истина;
	//	ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ДилерскийЦентр");
	//	ЭлементОтбора.ПравоеЗначение=Renault_CRM.ПолучитьДилерскийЦентрПользователя(ПараметрыСеанса.Пользователь);

	//	//Подразделение
	//	ЭлементОтбора=ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	//	ЭлементОтбора.Использование=Истина;
	//	ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Подразделение");
	//	ЭлементОтбора.ПравоеЗначение=ПараметрыСеанса.Пользователь.Сотрудник.Подразделение;
	//	
	//	//Отдел
	//	ЭлементОтбора=ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	//	ЭлементОтбора.Использование=Истина;
	//	ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Отдел");
	//	ЭлементОтбора.ПравоеЗначение=Renault_РаботаСПравамиПользователя.ОтделпоУмолчанию(ПараметрыСеанса.Пользователь);
	//	
	//	//Сотрудник пустой или сотрудник текущего пользователя
	//	ЭлементОтбора=ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.ВСписке;
	//	ЭлементОтбора.Использование=Истина;
	//	ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Сотрудник");
	//	Сп=Новый СписокЗначений;
	//	Сп.Добавить(Справочники.Пользователи.ПустаяСсылка());
	//	Сп.Добавить(Renault_ОбщиеФункции.СотрудникПользователя(ПараметрыСеанса.Пользователь));
	//	ЭлементОтбора.ПравоеЗначение=Сп;
	//	
	////Иначе 	
	////	спЗадачи.Отбор.Элементы.Очистить()
	////КонецЕсли;

	////отбор по видам задач
	//Массив=Новый Массив;
	//Массив.Добавить(Перечисления.Renault_ОбластиПрименения.Общие);
	//Массив.Добавить(Перечисления.Renault_ОбластиПрименения.ОФУ);
	//Сп=Новый СписокЗначений;
	//Сп.ЗагрузитьЗначения(Справочники.CRM_ВидыСобытий.РазрешенныеВидыСобытийПоОбластямПрименения(Массив,"Просмотр"));
	//ЭлементОтбора=спЗадачи.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	//ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.ВСписке;
	//ЭлементОтбора.Использование=Истина;
	//ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ВидСобытия");
	//ЭлементОтбора.ПравоеЗначение=Сп;
	//
	//ЭлементОтбора=спЗадачи.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	//ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.Использование=Истина;
	//ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Выполнена");
	//ЭлементОтбора.ПравоеЗначение=Ложь;
	//
	////НаборКнопокСписка(); //для того чтобы обновить состав и подсказки тех кнопок что были не видны
	//
	//УстановитьПараметрыСписков();
	//
	////ГруппаОтбораИ=спСтраховыеПолисы.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	////ГруппаОтбораИ.Использование=Истина;
	////ГруппаОтбораИ.ТипГруппы=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	////
	////ЭлементОтбора=ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	////ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	////ЭлементОтбора.Использование=Истина;
	////ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ДатаНачалаСтрахования");
	////ЭлементОтбора.ПравоеЗначение=КонецДня(ТекущаяДата());
	////
	////ЭлементОтбора=ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	////ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	////ЭлементОтбора.Использование=Истина;
	////ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ДатаОкончанияСтрахования");
	////ЭлементОтбора.ПравоеЗначение=ДобавитьМесяц(НачалоМесяца(ТекущаяДата()),-1);
	////
	////ЭлементОтбора=ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	////ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	////ЭлементОтбора.Использование=Истина;
	////ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ДатаОкончанияСтрахования");
	////ЭлементОтбора.ПравоеЗначение=ДобавитьМесяц(КонецМесяца(ТекущаяДата()),1);
	
КонецПроцедуры
Процедура УстановитьПараметрыСписков()
	
	Сп=Новый Массив;
	Сп.Добавить(спВыдачи);
	Сп.Добавить(спДоговоры);
	Сп.Добавить(спКП);
	Сп.Добавить(спРезервы);
	Сп.Добавить(спСобытияПоРабочемуЛисту);
	Сп.Добавить(спТестДрайвы);
	Сп.Добавить(спРезолюции);
	Сп.Добавить(спКПСостав);
	Сп.Добавить(спВыдачиАвтомобили);
	
	// IDK
	Для Каждого Список Из Сп Цикл
		ЭлIDK=Список.Параметры.Элементы.Найти("IDK");
		Если ЭлIDK<>Неопределено Тогда
			ЭлIDK.Значение=?(Объект.IDK=0,Null,Объект.IDK);
			ЭлIDK.Использование=Истина;
		КонецЕсли;
		
		ЭлСсылка=Список.Параметры.Элементы.Найти("Ссылка");
		Если ЭлСсылка<>Неопределено Тогда
			ЭлСсылка.Значение=Null;
			ЭлСсылка.Использование=Истина;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры	

&НаКлиенте
Процедура НажатиеКнМеню(Элемент) 
	Для Н=0 По ПунктыМеню.Количество()-1 Цикл
		Если Найти(ТекущийЭлемент.Имя,ПунктыМеню[Н].Значение)>0 Тогда ТекущаяЗакладкаМеню=Н; Прервать КонецЕсли;	
	КонецЦикла;
	УправлениеМеню();
КонецПроцедуры
&НаКлиенте
Процедура УправлениеМеню()
	//скрыть или показать пункты меню в зависимости от набора прав
	Для Каждого Эл Из Элементы.кнМеню.ПодчиненныеЭлементы Цикл Эл.Видимость=ПунктыМеню.НайтиПоЗначению(Сред(Эл.Имя,3))<>Неопределено КонецЦикла;	
	
	//скрыть показать списки
	Для Н=0 По ПунктыМеню.Количество()-1 Цикл 
		Эл=Элементы.Найти("сп"+ПунктыМеню[Н]);
		Если Эл=Неопределено Тогда Продолжить КонецЕсли;
		Эл.Видимость=Н=ТекущаяЗакладкаМеню;
	КонецЦикла;	
	
	//цвета кнопок меню
	ПарамОфр=Renault_ОбщиеФункции.МультибрендПараметрыОформления();
	//Вкл=Новый Цвет(255,207,0);
	Вкл=Вычислить(ПарамОфр.ОсновнойЦвет);
	//Выкл=Вычислить(ПарамОфр.ДопЦвет1);
	//ВыклСерый=Вычислить(ПарамОфр.ДопЦвет1);
	Выкл=Новый Цвет(189,195,206);
	ВыклСерый=Новый Цвет(231,231,231);
	
	Для Н=1 По Элементы.кнМеню.ПодчиненныеЭлементы.Количество() Цикл
		Эл=Элементы.кнМеню.ПодчиненныеЭлементы[Н-1];
		Если НЕ Эл.Видимость Тогда Продолжить КонецЕсли;
		ЭтоТекущаяЗакладка=Сред(Эл.Имя,3)=ПунктыМеню[ТекущаяЗакладкаМеню].Значение;
		Эл.ЦветФона=?(ЭтоТекущаяЗакладка,Вкл,Выкл);  //?(Н=ТекущаяЗакладкаМеню,Вкл,Выкл);
		Эл.ЦветРамки=?(ЭтоТекущаяЗакладка,Вкл,Выкл);
	КонецЦикла;
	
	ИмяЗакладки=ИмяЗакладки();
	//Если ИмяЗакладки="РегистрацияТрафика" Тогда
	//	Элементы.грРегТрафика.Видимость=Истина;
	//	Элементы.кнОтбор.Видимость=Ложь;
	//	ОбновитьДиаграммуМенеджера();
	//ИначеЕсли ИмяЗакладки="Фото" Тогда
	//	Элементы.кнОтбор.Видимость=Ложь;
	//ИначеЕсли ИмяЗакладки="Диаграммы" Тогда
	//	Элементы.кнОтбор.Видимость=Ложь;
	//Иначе
	//	Элементы.грРегТрафика.Видимость=Ложь;
	//	Элементы.кнОтбор.Видимость=Истина;
	//КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура НажатиеКнМенюСписка(Элемент)
	ИмяПунктаМеню=ИмяЗакладки();
	ИмяСписка=ИмяСписка();
	
	Если ТекущийЭлемент.Имя="кнОбновить" Тогда //это действие по умолчанию всегда
		Элементы[ИмяСписка].Обновить();
	ИначеЕсли ТекущийЭлемент.Имя="кнОтбор" Тогда
		
		//	Если ИмяПунктаМеню="Отчеты" Тогда
		//		Renault_ОбщиеФункции.ОткрытьКомпоновщикНастроек(ЭтаФорма,КомпоновщикНастроекОтчета,"ОтборОтчета")
		//	Иначе //динамические списки
		//		
		//		Если Renault_ОбщиеФункции.СтараяПлатформа() Тогда
		//			Сообщить("Функционал не доступен",СтатусСообщения.Информация);
		//			Возврат
		//		КонецЕсли;	
		
		//Если ИмяПунктаМеню="Трафик" Тогда 
		//	Источник=ПолучитьИсточникНаСервере(ИмяСписка); 
		//Иначе 
		//	Источник=ПолучитьПроизвольныйИсточникНаСервере(ИмяСписка);
		//КонецЕсли;	
		//
		//Renault_ОбщиеФункции.ОткрытьФормуОтбора(ЭтаФорма,Источник,ЭтаФорма[ИмяСписка].КомпоновщикНастроек,"ОтборСписка",ИмяСписка,,Истина)
	ИначеЕсли ТекущийЭлемент.Имя="кнПериод" Тогда	
		Стр=ОткрытьФормуМодально("ОбщаяФорма.Renault_ВыборПериода",Новый Структура("Дата1,Дата2",Дата1,Дата2),ЭтаФорма,УникальныйИдентификатор);
		Если ТипЗнч(Стр)=Тип("Структура") Тогда
			Дата1=Стр.Дата1;
			Дата2=Стр.Дата2;
			УстановитьПараметрыСписков();
		КонецЕсли;	
	ИначеЕсли ТекущийЭлемент.Имя="кнСтараяФорма" Тогда	
		кнСтараяФорма();
	ИначеЕсли ТекущийЭлемент.Имя="кнВзятьВРаботу" Тогда	
		ВзятьРЛВРаботу();
	Иначе 
		Сообщить("Действие кнопки еще не настроено"); Возврат
	КонецЕсли;
	
	//обновление списка - при любом действии кнопок списка
	//Если ИмяПунктаМеню="РегистрацияТрафика" Тогда ОбновитьДиаграммуМенеджера()
	//ИначеЕсли ИмяПунктаМеню="Диаграммы" Тогда ОтчетДиаграмма()
	//Иначе 
		Элементы[ИмяСписка].Обновить() 
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСписка(КомпНастроек,ИмяСписка) Экспорт
	Если КомпНастроек=Неопределено Тогда Возврат КонецЕсли;		
	ЭтаФорма[ИмяСписка].КомпоновщикНастроек.ЗагрузитьФиксированныеНастройки(КомпНастроек.ФиксированныеНастройки);
	УстановитьПараметрыСписков();
	//Если ИмяСписка="спСтраховыеПолисы" Тогда
	//	спСтраховыеПолисы.Параметры.Элементы.Найти("ТекущаяДата").Значение=ТекущаяДата();
	//	спСтраховыеПолисы.Параметры.Элементы.Найти("ТекущаяДата").Использование=Истина;
	//	спСтраховыеПолисы.Параметры.Элементы.Найти("Пролонгация").Значение=ТолькоПролонгация;
	//	спСтраховыеПолисы.Параметры.Элементы.Найти("Пролонгация").Использование=Истина;
	//КонецЕсли;	
	
	//ЭтаФорма[ИмяСписка].КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.Настройки);
	//ЭтаФорма[ИмяСписка].КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(КомпоновщикНастроек.ПользовательскиеНастройки);
	//ЭтаФорма[ИмяСписка].КомпоновщикНастроек.ЗагрузитьФиксированныеНастройки(КомпоновщикНастроек.ФиксированныеНастройки);
КонецПроцедуры

&НаКлиенте
Процедура РаботаСоСписком(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ИмяСписка=ИмяСписка();
	//Если ИмяСписка = "спТрафик" Тогда
	//	РасшифроватьТрафик(ВыбраннаяСтрока, Поле.Имя);
	//ИначеЕсли ИмяСписка = "спТестДрайв" Тогда
	//	РасшифроватьТестДрайв(Поле.Имя);
	//ИначеЕсли ИмяСписка = "спЗаписьНаСервис" Тогда
	//	РасшифроватьЗаписьНаСервис(Поле.Имя);
	//КонецЕсли;
	
КонецПроцедуры

//#КонецОбласти 

//#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Дата1=НачалоМесяца(ТекущаяДата());
	Дата2=ТекущаяДата(); 

	ДилерскийЦентр=Renault_РаботаСПравамиПользователя.ДилерскийЦентрПоУмолчанию(ПараметрыСеанса.Пользователь);
	Отдел=Renault_CRM.ПолучитьОтделАвтосалона();
	
	//доступность закладок может регламентироваться правами, - соответстенно формируем список
	ПунктыМеню.Добавить("Основная");
	ПунктыМеню.Добавить("Воронка");
	ПунктыМеню.Добавить("События");
	ПунктыМеню.Добавить("КоммерческиеПредложения");
	ПунктыМеню.Добавить("Резерв");
	ПунктыМеню.Добавить("ТестДрайв");
	ПунктыМеню.Добавить("Договор");
	ПунктыМеню.Добавить("Выдача");
	ПунктыМеню.Добавить("РОП");
	ПунктыМеню.Добавить("КОРП");
	
	ТекущаяЗакладкаМеню=0;
	УстановитьПараметрыСписков();
	УстановитьОтбор();
	
	ПраваРено = ПараметрыСеанса.Renault_ПраваПользователя;
	
	ОбновитьКомментарий(Объект.IDK,Комментарии);
	
	Если ТипЗнч(Объект.Клиент) = Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты") Тогда
		Если ЗначениеЗаполнено(Объект.Клиент.Контрагент) Тогда
			Объект.Клиент = Объект.Клиент.Контрагент;
			Попытка Записать(); Исключение КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	ПрочитатьДанныеКлиентаСервер();
	
	НастроитьСоставВоронки();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	// -= ВРЕМЕННЫЙ КОД: УДАЛИТЬ ПОСЛЕ ОТЛАДКИ  =-
	ОткрытьСтаруюФорму(Отказ); Если Отказ Тогда Возврат; КонецЕсли;
	
	//брендовое оформление
	Массив=Новый Массив;
	Для Каждого Эл Из Элементы.кнМеню.ПодчиненныеЭлементы Цикл Массив.Добавить(Эл); КонецЦикла;	
	
	Renault_ОбщиеФункции.МультибрендЗадатьОформление(Массив,"ЦветФона","ДопЦвет2");
	Renault_ОбщиеФункции.МультибрендЗадатьОформление(Массив,"ЦветРамки","ДопЦвет2");
	Renault_ОбщиеФункции.МультибрендЗадатьОформление(Массив,"ЦветТекста","ЦветТекста");
	
	//Массив=Новый Массив;
	//Массив.Добавить(Элементы.кнОтбор);
	//Массив.Добавить(Элементы...);
	//Renault_ОбщиеФункции.МультибрендЗадатьОформление(Массив,"ЦветФона","ОсновнойЦвет");
	
	Массив=Новый Массив;
	Массив.Добавить(Элементы.Logo);
	Renault_ОбщиеФункции.МультибрендЗадатьОформление(Массив,"Картинка","Логотип");
	
	УправлениеМеню();
	
	//условное оформление задач
	//Эл=спЗадачи.УсловноеОформление.Элементы.Добавить();
	//Эл.Оформление.Элементы[0].Значение=Новый Цвет(255,207,0); //цвет фона
	//Эл.Оформление.Элементы[0].Использование=Истина;
	//Отбор=Эл.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//Отбор.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	//Отбор.Использование=Истина;                        
	//Отбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Исполнитель");
	//Отбор.ПравоеЗначение=ПараметрыСеанса.Пользователь;

	ОбновитьЗаголовок();
		
КонецПроцедуры

//#КонецОбласти 


&НаКлиенте
Процедура ОткрытьСтаруюФорму(Отказ)
	Если Вопрос("Новая (управляемая) форма в разработке. Открыть старую форму?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да)=КодВозвратаДиалога.Да Тогда
		Запись = Renault_CRM.ПолучитьЗаписьРЛПоIDK(Объект.IDK);
		Если Запись=Неопределено Тогда
			ОткрытьФорму("РегистрСведений.Renault_РабочиеЛисты.Форма.ФормаЗаписи");
		Иначе	
			Renault_CRM.ОткрытьФормуРЛ(Объект.IDK);
		КонецЕсли;
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры // ОткрытьСтаруюФорму()

&НаКлиенте
Процедура кнСтараяФорма()
	Если ЗначениеЗаполнено(Объект.IDK) И Модифицированность Тогда
		Записан = Ложь;
		Попытка Записан = Записать(); Исключение Сообщить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке())); КонецПопытки;
		Если Не Записан Тогда Возврат; КонецЕсли;
	КонецЕсли;
	
	Renault_CRM.ОткрытьФормуРЛ(Объект.IDK);
	
	Закрыть();
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// АДАПТИРОВАННЫЙ КОД

&НаКлиенте
Процедура ОбновитьЗаголовок()
	
	//Элементы.НадписьЗаголовок.Заголовок = "Рабочий лист №" + Строка(Объект.IDK) + " от " + Формат(Объект.ДатаID, "ДФ=""дд ММММ гггг 'г.' ЧЧ:мм:сс""") + " - " + ?(ЗначениеЗаполнено(Объект.Сотрудник), Объект.Сотрудник, "Взять в работу");	
	//Элементы.НадписьЗаголовок.Гиперссылка = Не ЗначениеЗаполнено(Объект.Сотрудник);	
	
	ТипРЛ = "";
	Если Объект.ТипРабочегоЛиста=ПредопределенноеЗначение("Перечисление.Renault_ТипыРабочихЛистов.TradeIn") Тогда
		ТипРЛ = " (рабочий лист трейд-ин)";
	ИначеЕсли Объект.ТипРабочегоЛиста=ПредопределенноеЗначение("Перечисление.Renault_ТипыРабочихЛистов.Продажа") Тогда
		ТипРЛ = " (рабочий лист продажа)";
	КонецЕсли;
	
	ЭтаФорма.Заголовок = "Рабочий лист №" + Строка(Объект.IDK) + ТипРЛ;
	
КонецПроцедуры

&НаКлиенте
Процедура ВзятьРЛВРаботу()

	Если Не ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ВзятьРЛВРаботуЗавершение", ЭтаФорма),
					"Взять рабочий лист в работу?",
					РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВзятьРЛВРаботуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда Возврат; КонецЕсли;
	
	Если РЛВзятьВРаботуНаСервере() Тогда ОбновитьЗаголовок(); КонецЕсли;

КонецПроцедуры

&НаСервере
Функция РЛВзятьВРаботуНаСервере()

	ИзменилиМенеджера = Ложь;
	
	текСотрудник = ПараметрыСеанса.Пользователь.Сотрудник;
	Если ЗначениеЗаполнено(текСотрудник) Тогда
		СтруктураОтбора = Новый Структура();
		СтруктураОтбора.Вставить("РабочийЛист", Объект.IDK);
		Выборка = Документы.Renault_ЗаявкаНаТрейдИн.Выбрать(,, СтруктураОтбора);
		
		Если Выборка.Следующий() И НЕ ЗначениеЗаполнено(Выборка.МенеджерТрейдИн) И Не Выборка.ПометкаУдаления Тогда					
			ДокЗаявкаПоТрейдИн = Выборка.Ссылка.ПолучитьОбъект();
			ДокЗаявкаПоТрейдИн.МенеджерТрейдИн = текСотрудник;
			Попытка
				ДокЗаявкаПоТрейдИн.Записать(РежимЗаписиДокумента.Запись); ИзменилиМенеджера = Истина;
			Исключение
				Сообщить("Не удалось указать менеджера по трейд-ин в заявке № "+Выборка.Номер);
			КонецПопытки;
		КонецЕсли;				
	КонецЕсли;

	Возврат ИзменилиМенеджера;
	
КонецФункции // ВзятьРЛВРаботуЗавершение()

&НаСервереБезКонтекста
Процедура ОбновитьКомментарий(IDK,ТабличныйДокумент)
	
	ТабличныйДокумент.Очистить();
	Таб = Новый ТабличныйДокумент;
	
	МакетКомментариев = РегистрыСведений.Renault_РабочиеЛисты.ПолучитьМакет("РазделКомментариевУзкий");
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	CRM_Комментарии.Дата КАК ДатаКомментария,
	|	CRM_Комментарии.IDK КАК IDK,
	|	CRM_Комментарии.Идентификатор КАК Идентификатор,
	|	CRM_Комментарии.ИдентификаторРодителя КАК ИдентификаторРодителя,
	|	CRM_Комментарии.Автор,
	|	CRM_Комментарии.ТекстКомментария Как Комментарий
	|ИЗ
	|	РегистрСведений.CRM_Комментарии КАК CRM_Комментарии
	|ГДЕ
	|	CRM_Комментарии.IDK = &IDK
	|
	|УПОРЯДОЧИТЬ ПО
	|	IDK,
	|	Дата,
	|	Идентификатор,
	|	ИдентификаторРодителя");
	Запрос.УстановитьПараметр("IDK",IDK);
	
	ТаблицаКомментариев = Запрос.Выполнить().Выгрузить();
	
	ДеревоКомментариев = Renault_CRM.ПолучитьДеревоКомментариев(ТаблицаКомментариев);
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьШапка = МакетКомментариев.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Идентификатор = "ДобавитьКомментарий";
	Таб.Вывести(ОбластьШапка);
	
	Для каждого КорневойКомментарий из ДеревоКомментариев.Строки Цикл
		Renault_CRM.ВывестиКомментарийРекурсивно(Таб, МакетКомментариев, КорневойКомментарий, 1);
	КонецЦикла;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку     = Ложь;
	Таб.ТолькоПросмотр      = Истина;
	ТабличныйДокумент.Вывести(Таб);
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьГруппировки = Истина;
	
	ТабличныйДокумент.ОтображатьСетку     = Ложь;
	ТабличныйДокумент.ТолькоПросмотр      = Истина;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб         = Истина;
	ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(1, 1, 1, 1);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеКлиентаСервер(СтруктураПервичныйИнтерес = Неопределено)
	
	Клиент_ФИО = "";
	Клиент_Телефон = "";
	Клиент_Email = "";
	Клиент_Город = "";
	Клиент_ИсточникИнформации = Справочники.CRM_ИсточникиИнформации.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		
		Клиент_Телефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(Объект.Клиент);
		Клиент_Телефон = CRM_Сервер.Renault_CRM_СкорректироватьТелефонПриЗаписи(Клиент_Телефон);
		
		Если ЗначениеЗаполнено(Объект.ДилерскийЦентр) И НЕ ПустаяСтрока(Объект.ДилерскийЦентр.ПервыйСимволТелефона) Тогда
			Клиент_Телефон = СтрЗаменить(Клиент_Телефон, "+", "");
			Если СтрДлина(Клиент_Телефон) = 11 Тогда
				Клиент_Телефон = Прав(Клиент_Телефон, 10);
			КонецЕсли;
		КонецЕсли;
		
		Клиент_Email = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(Объект.Клиент);
		
		Клиент_ФИО = Объект.Клиент.НаименованиеПолное;
		
		Если ТипЗнч(Объект.Клиент) = Тип("СправочникСсылка.Контрагенты") тогда
			Элементы.Клиент_ФИО.КнопкаВыбора = Истина;
			СтатусКлиента = 1;
		Иначе
			Элементы.Клиент_ФИО.КнопкаВыбора = Истина;
			СтатусКлиента = 0;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_КлиентскиеДанные.ИсточникИнформации,
		|	CRM_КлиентскиеДанные.Город
		|ИЗ
		|	РегистрСведений.CRM_КлиентскиеДанные КАК CRM_КлиентскиеДанные
		|ГДЕ
		|	CRM_КлиентскиеДанные.Клиент = &Клиент";
		Запрос.УстановитьПараметр("Клиент", Объект.Клиент);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Клиент_Город = Выборка.Город;
			Клиент_ИсточникИнформации = Выборка.ИсточникИнформации;
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураПервичныйИнтерес <> Неопределено Тогда
		Если СтруктураПервичныйИнтерес.IDK = Объект.СвязаныйIDK Тогда
			ПервичныйИнтересМодель = СтруктураПервичныйИнтерес.ПервичныйИнтерес;
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВоронкуИСписки()
	
	//ОбновитьЦветаВоронки();
	//ОбновитьСписокСобытий();
	//ОбновитьСписокКП();
	//ОбновитьСписокТестДрайвов();
	//ОбновитьСписокКонтрактов();
	//ОбновитьСписокВыдач();
	//ОбновитьСписокРезервов();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьСоставВоронки()
	Если ПараметрыСеанса.DMS_Бренд.Наименование = Справочники.Renault_СлужебныеНастройкиБазыДанных.RENAULT.Наименование Тогда
		НастроитьСоставВоронкиRenault();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НастроитьСоставВоронкиRenault()
	
	Если Объект.ТипКлиента = Перечисления.Renault_ТипыРабочихЛистов.TradeIn Тогда
		НастроитьСоставВоронкиRenaultTradeIn();		
	ИначеЕсли Объект.ТипКлиента = Перечисления.Renault_ТипыРабочихЛистов.Продажа Тогда	
		НастроитьСоставВоронкиRenaultПродажа();		
	КонецЕсли;
	
	УстановитьНачальнуюВидимостьВоронкиРекурсия(Элементы.грВоронка.ПодчиненныеЭлементы);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьСоставВоронкиRenaultПродажа()

	КОРП = Объект.ТипКлиента = ПредопределенноеЗначение("Перечисление.Renault_ТипыКлиентов.КорпоративныйКлиент");
	
	Если КОРП Тогда
		СоставВоронки = Новый Структура("кнСтр1Воронка1,кнСтр1Воронка2,кнСтр1Воронка3,
										|кнСтр2Воронка1,дкВоронка1,дкВоронка2,
										|кнСтр3Воронка1,дкВоронка3,дкВоронка4,
										|кнСтр4Воронка1,дкВоронка5,дкВоронка6,
										|кнСтр5Воронка1,дкВоронка7,дкВоронка8,
										|кнСтр6Воронка1,кнСтр5Воронка2,кнСтр5Воронка3,кнСтр5Воронка4,кнСтр5Воронка5,дкВоронка19,дкВоронка20,
										|кнСтр7Воронка1,дкВоронка21,дкВоронка22,
										|кнСтр8Воронка1,дкВоронка23,дкВоронка24,
										|кнСтр9Воронка1,дкВоронка25,дкВоронка26,
										|кнСтр10Воронка1,кнСтр10Воронка2,кнСтр10Воронка3,кнСтр10Воронка4,дкВоронка27,дкВоронка28,
										|кнСтр11Воронка1,дкВоронка29,дкВоронка30,
										|кнСтр12Воронка1,дкВоронка31,дкВоронка32,
										|Декорация3,
										|Декорация9,
										|Декорация10,
										|кнВоронка4Команда1,кнВоронка4Команда2,Декорация11,
										|кнВоронка5Команда1,кнВоронка5Команда2,Декорация12,
										|кнВоронка6Команда1,кнВоронка6Команда2,кнВоронка6Команда3,Декорация13,
										|Декорация14,
										|кнВоронка8Команда1,кнВоронка8Команда2,Декорация15,
										|кнВоронка9Команда1,кнВоронка9Команда2,Декорация16,
										|кнВоронка10Команда1,кнВоронка10Команда2,Декорация17,
										|Декорация18,
										|Декорация19,
										|");
	Иначе
		СоставВоронки = Новый Структура("кнСтр1Воронка1,кнСтр1Воронка2,кнСтр1Воронка3,
										|кнСтр2Воронка1,дкВоронка1,дкВоронка2,
										|кнСтр3Воронка1,дкВоронка3,дкВоронка4,
										|кнСтр4Воронка1,дкВоронка5,дкВоронка6,
										|кнСтр5Воронка1,дкВоронка7,дкВоронка8,
										|кнСтр6Воронка1,кнСтр5Воронка2,кнСтр5Воронка3,кнСтр5Воронка4,кнСтр5Воронка5,дкВоронка19,дкВоронка20,
										|кнСтр7Воронка1,дкВоронка21,дкВоронка22,
										|кнСтр8Воронка1,дкВоронка23,дкВоронка24,
										|кнСтр9Воронка1,дкВоронка25,дкВоронка26,
										|кнСтр10Воронка1,кнСтр10Воронка2,кнСтр10Воронка3,кнСтр10Воронка4,дкВоронка27,дкВоронка28,
										|кнСтр11Воронка1,дкВоронка29,дкВоронка30,
										|Декорация3,
										|Декорация9,
										|Декорация10,
										|кнВоронка4Команда1,кнВоронка4Команда2,Декорация11,
										|кнВоронка5Команда1,кнВоронка5Команда2,Декорация12,
										|кнВоронка6Команда1,кнВоронка6Команда2,кнВоронка6Команда3,Декорация13,
										|кнВоронка7Команда1,кнВоронка7Команда2,Декорация14,
										|кнВоронка8Команда1,кнВоронка8Команда2,Декорация15,
										|кнВоронка9Команда1,кнВоронка9Команда2,кнВоронка9Команда2,Декорация16,
										|Декорация17,
										|Декорация18,
										|");
	КонецЕсли;
	
	СоставВоронкиПредставление = Новый Структура("кнВзятТелефон,кнВзятEmail,кнКарточкаКлиента,кнПосещениеАвтосалона,кнПрезентация,кнТестДрайв,кнКП,
												|кнДополнительноеОборудование,кнПродленнаяГарантия,кнТрейдИн,кнКредит,кнНаличные,кнДКП,кнMyRenault,кнВыдача,
												|кнЗвонокВежливости3,кнЗвонокВежливости30,кнЗвонокВежливости360,кнЗвонокВежливостиДР,кнПредварительныйКонтракт,
												|кнОткрытьСписокТестДрайв,кнСинхронизироватьCПланшетом,кнОткрытьСписокКП,кнОткрытьАвтосклад,кнСписокДО,
												|кнОткрытьСписокПолисов,кнОткрытьСписокКредитныхПредложений,кнОткрытьСписокДоговоров,кнРасторжениеДоговора,
												|кнОткрытьMyRenault,кнОткрытьSara,кнОткрытьСписокВыдач,кнРасторжениеДоговора");
	Для каждого КлючЗначение Из СоставВоронкиПредставление Цикл
		Ключ = ИмяЭлементаВоронка(КлючЗначение.Ключ,Объект.ТипКлиента);
		НастроитьПараметрыКнопкиВоронки("кнВзятТелефон",Ключ,СоставВоронки);
	КонецЦикла;
	
	Для каждого КлючЗначение Из СоставВоронки Цикл
		СвойстваЭлемента = КлючЗначение.Значение.СвойстваЭлемента;
		Если СвойстваЭлемента = Неопределено Тогда Продолжить; КонецЕсли;
		
	    ЗаполнитьЗначенияСвойств(Элементы[КлючЗначение.Ключ],СвойстваЭлемента);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьПараметрыКнопкиВоронки(ПредставлениеКнопки, Ключ, СоставВоронки)

	ОЭ = ОформлениеЭлементов;
	ПараметрыКнопки = Новый Структура("Функция,СвойстваЭлемента");

	Если ПредставлениеКнопки = "кнВзятТелефон" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Телефон",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,ОЭ.ИзображениеПустое,ОтображениеКнопки.КартинкаИТекст);
										
		ПараметрыКнопки.Функция = "кнВзятТелефон";
	ИначеЕсли Ключ = "кнВзятEmail" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Email",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,ОЭ.ИзображениеПустое,ОтображениеКнопки.КартинкаИТекст);
										
		ПараметрыКнопки.Функция = "кнВзятEmail"; 
	ИначеЕсли Ключ = "кнКарточкаКлиента" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Карточка клиента",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,БиблиотекаКартинок.Renault_Client_New,ОтображениеКнопки.Картинка);
										
		ПараметрыКнопки.Функция = "кнКарточкаКлиента"; 
	ИначеЕсли Ключ = "кнПосещениеАвтосалона" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Посещение автосалона",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,ОЭ.ИзображениеПустое,ОтображениеКнопки.КартинкаИТекст);
										
		ПараметрыКнопки.Функция = "кнВстреча"; 
	ИначеЕсли Ключ = "кнПрезентация" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Презентация",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,ОЭ.ИзображениеПустое,ОтображениеКнопки.КартинкаИТекст);
										
		ПараметрыКнопки.Функция = "кнПрезентация"; 
	ИначеЕсли Ключ = "кнТестДрайв" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Тест-драйв",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,ОЭ.ИзображениеПустое,ОтображениеКнопки.КартинкаИТекст);
										
		ПараметрыКнопки.Функция = "кнТестДрайв"; 
	ИначеЕсли Ключ = "кнКП" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Коммерческое предложение",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,ОЭ.ИзображениеПустое,ОтображениеКнопки.КартинкаИТекст);
										
		ПараметрыКнопки.Функция = "кнКП"; 
	ИначеЕсли Ключ = "кнДополнительноеОборудование" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Доп. опции",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,ОЭ.ИзображениеПустое,ОтображениеКнопки.КартинкаИТекст);
										
		ПараметрыКнопки.Функция = "кнДополнительноеОборудование"; 
	ИначеЕсли Ключ = "кнПродленнаяГарантия" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Продленная гарантия",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,ОЭ.ИзображениеПустое,ОтображениеКнопки.КартинкаИТекст);
										
		ПараметрыКнопки.Функция = "кнПродленнаяГарантия"; 
	ИначеЕсли Ключ = "кнТрейдИн" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Трейд-ин",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,ОЭ.ИзображениеПустое,ОтображениеКнопки.КартинкаИТекст);
										
		ПараметрыКнопки.Функция = "кнТрейдИн"; 
	ИначеЕсли Ключ = "кнКредит" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Кредит",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,ОЭ.ИзображениеПустое,ОтображениеКнопки.КартинкаИТекст);
										
		ПараметрыКнопки.Функция = "кнОпределитьСпособПокупки"; 
	ИначеЕсли Ключ = "кнНаличные" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Наличные",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,ОЭ.ИзображениеПустое,ОтображениеКнопки.КартинкаИТекст);
										
		ПараметрыКнопки.Функция = "кнОпределитьСпособПокупки"; 
	ИначеЕсли Ключ = "кнДКП" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Договор купли-продажи",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,ОЭ.ИзображениеПустое,ОтображениеКнопки.КартинкаИТекст);
										
		ПараметрыКнопки.Функция = "кнДКП"; 
	ИначеЕсли Ключ = "кнMyRenault" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"MyRenault",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,ОЭ.ИзображениеПустое,ОтображениеКнопки.КартинкаИТекст);
										
		ПараметрыКнопки.Функция = "кнMyRenault"; 
	ИначеЕсли Ключ = "кнВыдача" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Выдача автомобиля",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,ОЭ.ИзображениеПустое,ОтображениеКнопки.КартинкаИТекст);
										
		ПараметрыКнопки.Функция = "кнВыдача"; 
	ИначеЕсли Ключ = "кнЗвонокВежливости3" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Звонок №1",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,ОЭ.ИзображениеПустое,ОтображениеКнопки.КартинкаИТекст);
										
		ПараметрыКнопки.Функция = "кнЗвонокВежливости"; 
	ИначеЕсли Ключ = "кнЗвонокВежливости30" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Звонок №2",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,ОЭ.ИзображениеПустое,ОтображениеКнопки.КартинкаИТекст);
										
		ПараметрыКнопки.Функция = "кнЗвонокВежливости"; 
	ИначеЕсли Ключ = "кнЗвонокВежливости360" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Звонок №3",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,ОЭ.ИзображениеПустое,ОтображениеКнопки.КартинкаИТекст);
										
		ПараметрыКнопки.Функция = "кнЗвонокВежливости"; 
	ИначеЕсли Ключ = "кнЗвонокВежливостиДР" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Звонок ДР",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,ОЭ.ИзображениеПустое,ОтображениеКнопки.КартинкаИТекст);
										
		ПараметрыКнопки.Функция = "кнЗвонокВежливости"; 
	ИначеЕсли Ключ = "кнПредварительныйКонтракт" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Предварительный контракт и аванс",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,ОЭ.ИзображениеПустое,ОтображениеКнопки.КартинкаИТекст);
										
		ПараметрыКнопки.Функция = "кнКонтракт"; 
	ИначеЕсли Ключ = "кнОткрытьСписокТестДрайв" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Открыть список тест-драйвов",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,БиблиотекаКартинок.Renault_Folder_New,ОтображениеКнопки.Картинка);
										
		ПараметрыКнопки.Функция = "кнОткрытьСписокТестДрайв";
	ИначеЕсли Ключ = "кнСинхронизироватьCПланшетом" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Синхронизировать с планшетом",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,БиблиотекаКартинок.Renault_Refresh_New,ОтображениеКнопки.Картинка);
										
		ПараметрыКнопки.Функция = "кнСинхронизироватьCПланшетом";			
	ИначеЕсли Ключ = "кнОткрытьСписокКП" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Открыть список КП",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,БиблиотекаКартинок.Renault_Folder_New,ОтображениеКнопки.Картинка);
										
		ПараметрыКнопки.Функция = "кнОткрытьСписокКП";
	ИначеЕсли Ключ = "кнОткрытьАвтосклад" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Открыть автосклад",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,БиблиотекаКартинок.Renault_MCars_New,ОтображениеКнопки.Картинка);
										
		ПараметрыКнопки.Функция = "кнОткрытьАвтосклад";			
	ИначеЕсли Ключ = "кнСписокДО" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Список ДО",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,БиблиотекаКартинок.Renault_Folder_New,ОтображениеКнопки.Картинка);
										
		ПараметрыКнопки.Функция = "кнСписокДО";
	ИначеЕсли Ключ = "кнОткрытьСписокПолисов" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Список полисов",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,БиблиотекаКартинок.Renault_Folder_New,ОтображениеКнопки.Картинка);
										
		ПараметрыКнопки.Функция = "кнОткрытьСписокПолисов";			
	ИначеЕсли Ключ = "кнОткрытьСписокКредитныхПредложений" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Кредитные предложения",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,БиблиотекаКартинок.Renault_Folder_New,ОтображениеКнопки.Картинка);
										
		ПараметрыКнопки.Функция = "кнОткрытьСписокКредитныхПредложений";
	ИначеЕсли Ключ = "кнОткрытьСписокДоговоров" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Договоры",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,БиблиотекаКартинок.Renault_Folder_New,ОтображениеКнопки.Картинка);
										
		ПараметрыКнопки.Функция = "кнОткрытьСписокДоговоров";			
	ИначеЕсли Ключ = "кнРасторжениеКонтракта" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Расторжение контракта",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,БиблиотекаКартинок.Renault_CancelDoc_New,ОтображениеКнопки.Картинка);
										
		ПараметрыКнопки.Функция = "кнРасторжениеДоговора";
	ИначеЕсли Ключ = "кнОткрытьMyRenault" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"My Renault",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,БиблиотекаКартинок.Renault_Refresh_New,ОтображениеКнопки.Картинка);
										
		ПараметрыКнопки.Функция = "кнОткрытьMyRenault";			
	ИначеЕсли Ключ = "кнОткрытьSara" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"SARA",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,БиблиотекаКартинок.Renault_OnlineCons_New,ОтображениеКнопки.Картинка);
										
		ПараметрыКнопки.Функция = "кнОткрытьSara";	
	ИначеЕсли Ключ = "кнОткрытьСписокВыдач" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Выдачи",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,БиблиотекаКартинок.Renault_Folder_New,ОтображениеКнопки.Картинка);
										
		ПараметрыКнопки.Функция = "кнОткрытьСписокВыдач";			
	ИначеЕсли Ключ = "кнРасторжениеДКП" Тогда
		СвойстваЭлемента = Новый Структура("Заголовок,ЦветФона,ЦветТекста,ЦветРамки,Картинка,Отображение",
										"Расторжение ДКП",ОЭ.ЦветRenault1,ОЭ.ЦветТекста,ОЭ.ЦветRenault1,БиблиотекаКартинок.Renault_CancelDoc_New,ОтображениеКнопки.Картинка);
										
		ПараметрыКнопки.Функция = "кнРасторжениеДоговора";			
	КонецЕсли;
	
	ПараметрыКнопки.СвойстваЭлемента = СвойстваЭлемента;
	
	СоставВоронки.Вставить(Ключ,ПараметрыКнопки);
	
КонецПроцедуры


&НаСервере
Процедура НастроитьСоставВоронкиRenaultTradeIn()

	

КонецПроцедуры

&НаСервере
Функция УстановитьНачальнуюВидимостьВоронкиРекурсия(Элементы)

	Для каждого Эл Из Элементы Цикл
		Если ТипЗнч(Эл) = Тип("ГруппаФормы") Тогда
			УстановитьНачальнуюВидимостьВоронкиРекурсия(Эл.ПодчиненныеЭлементы);
		Иначе
			Эл.Видимость = СоставВоронки.Свойство(Эл.Имя);
		КонецЕсли;
	КонецЦикла;	

КонецФункции

&НаКлиенте
Процедура ОбновитьЦветаВоронки()
	
	Воронка_ОбновитьВзятТелефон();
	Воронка_ОбновитьВзятEmail();
	Воронка_ОбновитьПосещениеАвтосалона();
	Воронка_ОбновитьПрезентацияАвтомобиля();
	Воронка_ОбновитьТестДрайв();
	Воронка_ОбновитьКоммерческоеПредложение();
	Воронка_ОбновитьДопОборудование();
	Воронка_ОбновитьПродленнуюГарантию();
	Воронка_ОбновитьТрейдИн();
	//Воронка_ОбновитьСтраховку();
	//Воронка_ОбновитьКредит();
	Воронка_ОбновитьMYRenault();
	Воронка_ОбновитьКонтракт();
	Воронка_ОбновитьДКП();
	Воронка_ОбновитьВыдачу();
	Воронка_ОбновитьРасторжениеПредварительногоКонтракта();
	Воронка_ОбновитьРасторжениеДКП();
	Воронка_ОбновитьЗвонокВежливости(ПредопределенноеЗначение("Справочник.CRM_ВидыСобытий.ЗвонокВежливости3"));
	Воронка_ОбновитьЗвонокВежливости(ПредопределенноеЗначение("Справочник.CRM_ВидыСобытий.ЗвонокВежливости30"));
	Воронка_ОбновитьЗвонокВежливости(ПредопределенноеЗначение("Справочник.CRM_ВидыСобытий.ЗвонокВежливости360"));
	//Воронка_ОбновитьЗвонокВежливостиДР();
	Воронка_ОбновитьРегистрациюКлиентаВБазеРеноРоссия();
	
КонецПроцедуры

&НаКлиенте
Процедура кнВоронкаНажатие(Команда)
	Выполнить(СоставВоронки[ТекущийЭлемент.Имя].Функция+"(ТекущийЭлемент)");
КонецПроцедуры

&НаКлиенте
Процедура кнВзятТелефон(Элемент)
	
	// -= ВРЕМЕННЫЙ КОД: УДАЛИТЬ ПОСЛЕ ОТЛАДКИ  =-
	Предупреждение("В разработке");
	//Форма = ПолучитьФорму("ФормаВводаТелефона", ЭтаФорма);
	//Форма.ТелефонПоУмолчанию = Клиент_Телефон;
	//Форма.Клиент = Клиент;
	//Клиент_Телефон = Форма.ОткрытьМодально();
	//Клиент_Телефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(Клиент);
	//СохранитьДанныеКлиентаПриСменеТелефона();
	//Воронка_ОбновитьВзятТелефон();
	
КонецПроцедуры

Процедура кнВзятEmail(Элемент)
	
	// -= ВРЕМЕННЫЙ КОД: УДАЛИТЬ ПОСЛЕ ОТЛАДКИ  =-
	Предупреждение("В разработке");
	//Форма = ПолучитьФорму("ФормаВводаEmail", ЭтаФорма);
	//Форма.EmailПоУмолчанию = Клиент_Email;
	//Форма.Клиент = Клиент;
	//Клиент_Email = Форма.ОткрытьМодально();
	//Клиент_Email = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(Клиент);
	//СохранитьДанныеКлиентаПриСменеEmail();
	//Воронка_ОбновитьВзятEmail();
	
КонецПроцедуры

&НаКлиенте
Процедура Воронка_ОбновитьMYRenault()

	кн = Элементы.кнСтр8Воронка1;
	Оформление = Воронка_ОбновитьMYRenaultНаСервере(Объект.IDK,ОформлениеЭлементов);
	кн.Заголовок = Оформление.Заголовок;
	ЗаполнитьЗначенияСвойств(кн, Оформление.ЦветКнопки);	

КонецПроцедуры

&НаСервереБезКонтекста
Функция Воронка_ОбновитьMYRenaultНаСервере(IDK,ОформлениеЭлементов)
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.РегистрацияВMYRenault;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Зарегистрирован
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		ЦветКнопки = ОформлениеЭлементов.Цвет125157183;
		Заголовок = "Зарегистрирован в корп. портале (" + ТекстДата + ")";
	Иначе
		//Не зарегистрирован
		ЦветКнопки = ОформлениеЭлементов.ЦветRenault1;
		Заголовок = "Зарегистрировать в корпоративном портале";
	КонецЕсли;
	
	Возврат Новый Структура("ЦветКнопки,Заголовок",ЦветКнопки,Заголовок);
	
КонецФункции

&НаКлиенте
Процедура Воронка_ОбновитьПрезентацияАвтомобиля()

	кн = Элементы.кнСтр3Воронка1;
	Оформление = Воронка_ОбновитьПрезентацияАвтомобиляНаСервере(Объект.IDK,ОформлениеЭлементов);
	ЗаполнитьЗначенияСвойств(кн, Оформление);
	ЗаполнитьЗначенияСвойств(кн, Оформление.ЦветКнопки);	

КонецПроцедуры

&НаСервереБезКонтекста
Функция Воронка_ОбновитьПрезентацияАвтомобиляНаСервере(IDK,ОформлениеЭлементов)
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ПрезентацияАвтомобиля;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Проведена
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		ЦветКнопки = ОформлениеЭлементов.ЦветRenault2;
		Заголовок = "Презентация (" + ТекстДата + ")";
	Иначе
		//Не проведена
		ЦветКнопки = ОформлениеЭлементов.ЦветRenault1;
		Заголовок = "Презентация";
	КонецЕсли;
	
	Возврат Новый Структура("ЦветКнопки,Заголовок",ЦветКнопки,Заголовок);
	
КонецФункции

&НаКлиенте
Процедура Воронка_ОбновитьТестДрайв()
	
	кн = Элементы.кнСтр4Воронка1;
	Оформление = Воронка_ОбновитьТестДрайвНаСервере(Объект.IDK,ОформлениеЭлементов);
	ЗаполнитьЗначенияСвойств(кн, Оформление);
	ЗаполнитьЗначенияСвойств(кн, Оформление.ЦветКнопки);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция Воронка_ОбновитьТестДрайвНаСервере(IDK,ОформлениеЭлементов)
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ТестДрайв;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Был тест-драйв
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		ЦветКнопки = ОформлениеЭлементов.ЦветRenault2;
		Заголовок = "Тест-драйв (" + ТекстДата + ")";
		Картинка = ОформлениеЭлементов.ИзображениеСобытиеВыполнено;
	Иначе
		//Не было посещения
		//Проверим наличие напоминания
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	CRM_СобытияПоРабочимЛистам.Ссылка,
		|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания
		|ИЗ
		|	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
		|ГДЕ
		|	CRM_СобытияПоРабочимЛистам.IDK = &IDK
		|	И CRM_СобытияПоРабочимЛистам.ВидСобытия = &ВидСобытия
		|	И CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания";
		Запрос.УстановитьПараметр("IDK", IDK);
		Запрос.УстановитьПараметр("ВидСобытия", Справочники.CRM_ВидыСобытий.ТестДрайв);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			//Есть напоминание
			ЦветКнопки = ОформлениеЭлементов.ЦветRenault1;
			Заголовок = "Тест-драйв";
			Картинка = ОформлениеЭлементов.ИзображениеСобытиеЗапланировано;
			Если ЗначениеЗаполнено(Выборка.ДатаНапоминания) Тогда
				ТекстДата = Формат(Выборка.ДатаНапоминания, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
				Заголовок = "Тест-драйв (" + ТекстДата + ")";
			КонецЕсли;
		Иначе
			//Нет напоминания
			ЦветКнопки = ОформлениеЭлементов.ЦветRenault1;
			Заголовок = "Тест-драйв";
			Картинка = ОформлениеЭлементов.ИзображениеПустое;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый Структура("ЦветКнопки,Картинка,Заголовок",ЦветКнопки,Картинка,Заголовок);
	
КонецФункции

&НаКлиенте
Процедура Воронка_ОбновитьВзятТелефон()

	кн = Элементы.кнСтр1Воронка1;
	Оформление = Воронка_ОбновитьВзятТелефонНаСервере(Объект.IDK,Объект.Клиент,ОформлениеЭлементов);
	ЗаполнитьЗначенияСвойств(кн, Оформление);
	ЗаполнитьЗначенияСвойств(кн, Оформление.ЦветКнопки);	

КонецПроцедуры

&НаСервереБезКонтекста
Функция Воронка_ОбновитьВзятТелефонНаСервере(IDK,Клиент,ОформлениеЭлементов)
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.НаличиеТелефона;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Было посещение
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		ЦветКнопки = ОформлениеЭлементов.ЦветRenault2;
		Телефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(Клиент);
		Заголовок = ?(Телефон = "", "Телефон (" + ТекстДата + ")", "Тел: " + Строка(Телефон));
	Иначе
		//Не было посещения
		ЦветКнопки = ОформлениеЭлементов.ЦветRenault1;
		Телефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(Клиент);
		Заголовок = ?(Телефон = "", "Телефон", "Тел: " + Строка(Телефон));
	КонецЕсли;
	
	Возврат Новый Структура("ЦветКнопки,Заголовок",ЦветКнопки,Заголовок);
	
КонецФункции

&НаКлиенте
Процедура Воронка_ОбновитьВзятEmail()

	кн = Элементы.кнСтр1Воронка2;
	Оформление = Воронка_ОбновитьВзятEmailНаСервере(Объект.IDK,Объект.Клиент,ОформлениеЭлементов);
	ЗаполнитьЗначенияСвойств(кн, Оформление);
	ЗаполнитьЗначенияСвойств(кн, Оформление.ЦветКнопки);	

КонецПроцедуры

&НаСервереБезКонтекста
Функция Воронка_ОбновитьВзятEmailНаСервере(IDK,Клиент,ОформлениеЭлементов)
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.НаличиеEmail;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Было посещение
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		ЦветКнопки = ОформлениеЭлементов.ЦветRenault2;
		Email = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(Клиент);
		Заголовок = ?(Email = "", "Email (" + ТекстДата + ")", "e-mail: "+ Строка(Email));
	Иначе
		//Не было посещения
		ЦветКнопки = ОформлениеЭлементов.ЦветRenault1;
		Email = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(Клиент);
		Заголовок = ?(Email = "", "Email", "e-mail: "+ Строка(Email));
	КонецЕсли;
	
	Возврат Новый Структура("ЦветКнопки,Заголовок",ЦветКнопки,Заголовок);
	
КонецФункции

&НаКлиенте
Процедура Воронка_ОбновитьПосещениеАвтосалона()

	кн = Элементы.кнСтр2Воронка1;
	Оформление = Воронка_ОбновитьПосещениеАвтосалонаНаСервере(Объект.IDK,ОформлениеЭлементов);
	ЗаполнитьЗначенияСвойств(кн, Оформление);
	ЗаполнитьЗначенияСвойств(кн, Оформление.ЦветКнопки);	

КонецПроцедуры

&НаСервереБезКонтекста
Функция Воронка_ОбновитьПосещениеАвтосалонаНаСервере(IDK,ОформлениеЭлементов)
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ПосещениеАвтосалона;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Было посещение
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		ЦветКнопки = ОформлениеЭлементов.ЦветRenault2;
		Заголовок = "Посещение автосалона (" + ТекстДата + ")";
		Картинка = ОформлениеЭлементов.ИзображениеСобытиеВыполнено; 
	Иначе
		//Не было посещения
		//Проверим наличие напоминания
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	CRM_СобытияПоРабочимЛистам.Ссылка,
		|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания
		|ИЗ
		|	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
		|ГДЕ
		|	CRM_СобытияПоРабочимЛистам.IDK = &IDK
		|	И CRM_СобытияПоРабочимЛистам.ВидСобытия = &ВидСобытия
		|	И CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания";
		Запрос.УстановитьПараметр("IDK", IDK);
		Запрос.УстановитьПараметр("ВидСобытия", Справочники.CRM_ВидыСобытий.Встреча);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			//Есть напоминание
			ЦветКнопки = ОформлениеЭлементов.ЦветRenault1;
			Заголовок = "Посещение автосалона";
			Картинка = ОформлениеЭлементов.ИзображениеСобытиеЗапланировано;
			Если ЗначениеЗаполнено(Выборка.ДатаНапоминания) Тогда
				ТекстДата = Формат(Выборка.ДатаНапоминания, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
				Заголовок = "Посещение автосалона (" + ТекстДата + ")";
			КонецЕсли;
		Иначе
			//Нет напоминания
			ЦветКнопки = ОформлениеЭлементов.ЦветRenault1;
			Заголовок = "Посещение автосалона";
			Картинка = ОформлениеЭлементов.ИзображениеПустое;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый Структура("ЦветКнопки,Заголовок,Картинка",ЦветКнопки,Заголовок,Картинка);
	
КонецФункции

&НаКлиенте
Процедура Воронка_ОбновитьКоммерческоеПредложение()

	кн = Элементы.кнСтр5Воронка1;
	Оформление = Воронка_ОбновитьКоммерческоеПредложениеНаСервере(Объект.IDK,ОформлениеЭлементов);
	ЗаполнитьЗначенияСвойств(кн, Оформление);
	ЗаполнитьЗначенияСвойств(кн, Оформление.ЦветКнопки);	

КонецПроцедуры

&НаСервереБезКонтекста
Функция Воронка_ОбновитьКоммерческоеПредложениеНаСервере(IDK,ОформлениеЭлементов)
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.КоммерческоеПредложение;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Есть КП
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		ЦветКнопки = ОформлениеЭлементов.ЦветRenault3;
		Заголовок = "Коммерческое предложение (" + ТекстДата + ")";
	Иначе
		//Нет КП
		ЦветКнопки = ОформлениеЭлементов.ЦветRenault1;
		Заголовок = "Коммерческое предложение";
	КонецЕсли;
	
	Возврат Новый Структура("ЦветКнопки,Заголовокч",ЦветКнопки,Заголовок);
	
КонецФункции

&НаКлиенте
Процедура Воронка_ОбновитьДопОборудование()

	кн = Элементы.кнСтр6Воронка1;
	Оформление = Воронка_ОбновитьДопОборудованиеНаСервере(Объект.IDK,ОформлениеЭлементов);
	ЗаполнитьЗначенияСвойств(кн, Оформление);
	ЗаполнитьЗначенияСвойств(кн, Оформление.ЦветКнопки);	

КонецПроцедуры

&НаСервереБезКонтекста
Функция Воронка_ОбновитьДопОборудованиеНаСервере(IDK,ОформлениеЭлементов)
	   
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_CRM_ЗаявкаНаСервис.СтатусПодготовкиКПродаже КАК Статус,
	               |	Renault_CRM_ЗаявкаНаСервис.Ссылка
	               |ИЗ
	               |	Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
	               |ГДЕ
	               |	Renault_CRM_ЗаявкаНаСервис.ПометкаУдаления = ЛОЖЬ
	               |	И Renault_CRM_ЗаявкаНаСервис.Обращение.IDK = &IDK
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Renault_CRM_ЗаявкаНаСервис.Дата УБЫВ";
				   
	Запрос.УстановитьПараметр("IDK", IDK);

	ТаблицаЗаявокНаДопОборудование = Запрос.Выполнить().Выгрузить();

	ЕстьЗаявкаНаДопы = ?(ТаблицаЗаявокНаДопОборудование.Количество()=0, Ложь, Истина);
	
	Если Не ЕстьЗаявкаНаДопы Тогда
		Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
		Запись.IDK = IDK;
		Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ИнтересовалсяОборудованием;
		Запись.Прочитать();
		ЕстьИнтересКДопам = Запись.Выбран();
	Иначе
		ЕстьИнтересКДопам = Ложь;
	КонецЕсли;
	
	Если ЕстьЗаявкаНаДопы Тогда
		СтатусПоследнейЗаявки = ТаблицаЗаявокНаДопОборудование[0].Статус;		
		ЦветКнопки = ОформлениеЭлементов.ЦветRenault3;
		Заголовок = "Доп. опции"+Символы.ПС + " ("+СтатусПоследнейЗаявки+")";
	ИначеЕсли ЕстьИнтересКДопам Тогда
		//Есть ДО в КП
		ЦветКнопки = ОформлениеЭлементов.ЦветRenault2;
		Заголовок = "Доп. опции"+Символы.ПС + " (есть интерес)";
	Иначе
		//Нет ДО в КП
		ЦветКнопки = ОформлениеЭлементов.ЦветRenault1;
		Заголовок = "Доп. опции";
	КонецЕсли;
	
	Возврат Новый Структура("ЦветКнопки,Заголовок",ЦветКнопки,Заголовок);
	
КонецФункции

&НаКлиенте
Процедура Воронка_ОбновитьПродленнуюГарантию()

	кн = Элементы.кнСтр6Воронка2;
	Оформление = Воронка_ОбновитьПродленнуюГарантиюНаСервере(Объект.IDK,ОформлениеЭлементов);
	ЗаполнитьЗначенияСвойств(кн, Оформление);
	ЗаполнитьЗначенияСвойств(кн, Оформление.ЦветКнопки);	

КонецПроцедуры

&НаСервереБезКонтекста
Функция Воронка_ОбновитьПродленнуюГарантиюНаСервере(IDK,ОформлениеЭлементов)
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаПрГарантию;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Есть ПГ в КП
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		ЦветКнопки = ОформлениеЭлементов.ЦветRenault2;
		Заголовок = "Продл. гарантия" + Символы.ПС + ТекстДата;
		ЗаписьВып = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
		ЗаписьВып.IDK = IDK;
		ЗаписьВып.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаПрГарантиюВыполнена;
		ЗаписьВып.Прочитать();
		Если ЗаписьВып.Выбран() Тогда
			Если ЗначениеЗаполнено(ЗаписьВып.ДатаВыполнения) Тогда
				ТекстДата = Формат(ЗаписьВып.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
			КонецЕсли;
			ЦветКнопки = ОформлениеЭлементов.ЦветRenault3;
			Заголовок = "Продл. гарантия" +Символы.ПС+ ТекстДата;
		КонецЕсли;
		
	Иначе
		
		Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
		Запись.IDK = IDK;
		Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаПрГарантиюВыполнена;
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
				ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
			КонецЕсли;
			ЦветКнопки = ОформлениеЭлементов.Цвет121181109;
			Заголовок = "Продл. гарантия" +Символы.ПС+ ТекстДата;
		Иначе
			//Нет ПГ в КП
			ЦветКнопки = ОформлениеЭлементов.ЦветRenault1;
			Заголовок = "Продл. гарантия ";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый Структура("ЦветКнопки,Заголовок",ЦветКнопки,Заголовок);
	
КонецФункции

&НаКлиенте
Процедура Воронка_ОбновитьТрейдИн()

	кн = Элементы.кнСтр6Воронка3;
	Оформление = Воронка_ОбновитьТрейдИнНаСервере(Объект.IDK,Объект.СвязаныйIDK,ОформлениеЭлементов);
	ЗаполнитьЗначенияСвойств(кн, Оформление);
	ЗаполнитьЗначенияСвойств(кн, Оформление.ЦветКнопки);	

КонецПроцедуры

&НаСервереБезКонтекста
Функция Воронка_ОбновитьТрейдИнНаСервере(IDK,СвязаныйIDK,ОформлениеЭлементов)
	
	ТекстМенеджер = "";
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("РабочийЛист", СвязаныйIDK);
	Выборка = Документы.Renault_ЗаявкаНаТрейдИн.Выбрать(,, СтруктураОтбора);
	Пока Выборка.Следующий() И ЗначениеЗаполнено(Выборка.МенеджерТрейдИн) Цикл
		ТекстМенеджер = Символы.ПС + Выборка.МенеджерТрейдИн;
	КонецЦикла;
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИн;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Есть трейд-ин в КП
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		ЦветКнопки = ОформлениеЭлементов.ЦветRenault2;
		Заголовок = "Трейд-ин" +Символы.ПС+ ТекстДата + ТекстМенеджер;
		ЗаписьВып = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
		ЗаписьВып.IDK = IDK;
		ЗаписьВып.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнВыполнена;
		ЗаписьВып.Прочитать();
		Если ЗаписьВып.Выбран() Тогда
			Если ЗначениеЗаполнено(ЗаписьВып.ДатаВыполнения) Тогда
				ТекстДата = Формат(ЗаписьВып.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
			КонецЕсли;
			ЦветКнопки = ОформлениеЭлементов.ЦветRenault3;
			Заголовок = "Трейд-ин" +Символы.ПС+ ТекстДата + ТекстМенеджер;
		КонецЕсли;
	Иначе
		Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
		Запись.IDK = СвязаныйIDK;
		Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнВыполнена;
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
				ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
			КонецЕсли;
			ЦветКнопки = ОформлениеЭлементов.Цвет121181109;
			Заголовок = "Трейд-ин" +Символы.ПС+ ТекстДата + ТекстМенеджер;
			
		Иначе
			//Нет трейд-ин в КП
			ЦветКнопки = ОформлениеЭлементов.ЦветRenault1;
			Заголовок = "Трейд-ин";
			Если ЗначениеЗаполнено(СвязаныйIDK) Тогда
				СтруктураОтбора = Новый Структура();
				СтруктураОтбора.Вставить("РабочийЛист", СвязаныйIDK);
				Выборка = Документы.Renault_ЗаявкаНаТрейдИн.Выбрать(,, СтруктураОтбора);
				Пока Выборка.Следующий() Цикл
	 				ТекстДата = Формат(Выборка.Ссылка.Дата, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
					ЦветКнопки = ОформлениеЭлементов.ЦветRenault3;
					Заголовок = "Трейд-ин" +Символы.ПС+ ТекстДата + ТекстМенеджер;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат Новый Структура("ЦветКнопки,Заголовок",ЦветКнопки,Заголовок);
	
КонецФункции

&НаКлиенте
Процедура Воронка_ОбновитьКонтракт()

	кн = Элементы.кнСтр11Воронка1;
	Оформление = Воронка_ОбновитьКонтрактНаСервере(Объект.IDK,ОформлениеЭлементов);
	ЗаполнитьЗначенияСвойств(кн, Оформление);
	ЗаполнитьЗначенияСвойств(кн, Оформление.ЦветКнопки);	

КонецПроцедуры

&НаСервереБезКонтекста
Функция Воронка_ОбновитьКонтрактНаСервере(IDK,ОформлениеЭлементов)
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.Контракт;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Зарегистрирован
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		ЦветКнопки = ОформлениеЭлементов.ЦветRenault2;
		Заголовок = "Предварительный контракт и аванс (" + ТекстДата + ")";
	Иначе
		//Не зарегистрирован
		ЦветКнопки = ОформлениеЭлементов.ЦветRenault1;
		Заголовок = "Предварительный контракт и аванс"; //+ ОписаниеДоговора;
	КонецЕсли;
	
	Возврат Новый Структура("ЦветКнопки,Заголовок",ЦветКнопки,Заголовок);
	
КонецФункции

&НаКлиенте
Процедура Воронка_ОбновитьДКП()

	кн = Элементы.кнСтр7Воронка1;
	Оформление = Воронка_ОбновитьДКПНаСервере(Объект.IDK,ОформлениеЭлементов);
	ЗаполнитьЗначенияСвойств(кн, Оформление);
	ЗаполнитьЗначенияСвойств(кн, Оформление.ЦветКнопки);	

КонецПроцедуры

&НаСервереБезКонтекста
Функция Воронка_ОбновитьДКПНаСервере(IDK,ОформлениеЭлементов)
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.Контракт;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Зарегистрирован
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		ЦветКнопки = ОформлениеЭлементов.ЦветRenault3;
		Заголовок = "Договор купли-продажи (" + ТекстДата + ")";
	Иначе
		//Не зарегистрирован
		//Узнаем статус договора, если он есть
		ЦветКнопки = ОформлениеЭлементов.ЦветRenault1;
		Заголовок = "Договор купли-продажи";
	КонецЕсли;
	
	Возврат Новый Структура("ЦветКнопки,Заголовок",ЦветКнопки,Заголовок);
	
КонецФункции

&НаКлиенте
Процедура Воронка_ОбновитьРасторжениеПредварительногоКонтракта()

	кн = Элементы.кнВоронка7Команда2;
	Оформление = Воронка_ОбновитьРасторжениеПредварительногоКонтрактаНаСервере(Объект.IDK,ОформлениеЭлементов);
	ЗаполнитьЗначенияСвойств(кн, Оформление);
	ЗаполнитьЗначенияСвойств(кн, Оформление.ЦветКнопки);	

КонецПроцедуры

&НаСервереБезКонтекста
Функция Воронка_ОбновитьРасторжениеПредварительногоКонтрактаНаСервере(IDK,ОформлениеЭлементов)
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.РасторжениеПредварительногоКонтракта;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Расторгнут
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		ЦветКнопки = ОформлениеЭлементов.Цвет211668;
		Заголовок = "Расторжение" + ТекстДата;
	Иначе
		//Не расторгнут
		ЦветКнопки = ОформлениеЭлементов.ЦветRenault1;
		Заголовок = "Расторжение";
	КонецЕсли;
	
	Возврат Новый Структура("ЦветКнопки,Заголовок",ЦветКнопки,Заголовок);
	
КонецФункции

&НаКлиенте
Процедура Воронка_ОбновитьРасторжениеДКП()

	кн = Элементы.кнВоронка9Команда2;
	Оформление = Воронка_ОбновитьРасторжениеДКПНаСервере(Объект.IDK,ОформлениеЭлементов);
	ЗаполнитьЗначенияСвойств(кн, Оформление);
	ЗаполнитьЗначенияСвойств(кн, Оформление.ЦветКнопки);	

КонецПроцедуры

&НаСервереБезКонтекста
Функция Воронка_ОбновитьРасторжениеДКПНаСервере(IDK,ОформлениеЭлементов)
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.РасторжениеДКП;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Расторгнут
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		ЦветКнопки = ОформлениеЭлементов.Цвет211668;
		Заголовок = "Расторжение" + ТекстДата;
	Иначе
		//Не расторгнут
		ЦветКнопки = ОформлениеЭлементов.ЦветRenault1;
		Заголовок = "Расторжение";
	КонецЕсли;
	
	Возврат Новый Структура("ЦветКнопки,Заголовок",ЦветКнопки,Заголовок);
	
КонецФункции

&НаКлиенте
Процедура Воронка_ОбновитьВыдачу()

	кн = Элементы.кнСтр9Воронка1;
	Оформление = Воронка_ОбновитьВыдачуНаСервере(Объект.IDK,ОформлениеЭлементов);
	ЗаполнитьЗначенияСвойств(кн, Оформление);
	ЗаполнитьЗначенияСвойств(кн, Оформление.ЦветКнопки);	

КонецПроцедуры

&НаСервереБезКонтекста
Функция Воронка_ОбновитьВыдачуНаСервере(IDK,ОформлениеЭлементов)
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ВыдачаАвтомобиля;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Была выдача
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		ЦветКнопки = ОформлениеЭлементов.ЦветRenault3;
		Заголовок = "Выдача (" + ТекстДата + ")";
		Картинка = ОформлениеЭлементов.ИзображениеСобытиеВыполнено;
	Иначе
		//Не было выдачи
		//Проверим наличие напоминания
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	CRM_СобытияПоРабочимЛистам.Ссылка,
		|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания
		|ИЗ
		|	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
		|ГДЕ
		|	CRM_СобытияПоРабочимЛистам.IDK = &IDK
		|	И CRM_СобытияПоРабочимЛистам.ВидСобытия = &ВидСобытия
		|	И CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания";
		Запрос.УстановитьПараметр("IDK", IDK);
		Запрос.УстановитьПараметр("ВидСобытия", Справочники.CRM_ВидыСобытий.Выдача);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			//Есть напоминание
			ЦветКнопки = ОформлениеЭлементов.ЦветRenault1;
			Заголовок = "Выдача";
			Картинка = ОформлениеЭлементов.ИзображениеСобытиеЗапланировано;
			Если ЗначениеЗаполнено(Выборка.ДатаНапоминания) Тогда
				ТекстДата = Формат(Выборка.ДатаНапоминания, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
				Заголовок = "Выдача (" + ТекстДата + ")";
			КонецЕсли;
		Иначе
			//Нет напоминания
			ЦветКнопки = ОформлениеЭлементов.ЦветRenault1;
			Заголовок = "Выдача";
			Картинка = ОформлениеЭлементов.ИзображениеПустое;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый Структура("ЦветКнопки,Заголовок,Картинка",ЦветКнопки,Заголовок,Картинка);
	
КонецФункции

&НаКлиенте
Процедура Воронка_ОбновитьЗвонокВежливости(ВидСобытия)

	Оформление = Воронка_ОбновитьЗвонокВежливостиНаСервере(Объект.IDK,ВидСобытия,Объект.ТипКлиента,ОформлениеЭлементов);
	кн = Элементы[Оформление.ИмяЭлемента];
	ЗаполнитьЗначенияСвойств(кн, Оформление);
	ЗаполнитьЗначенияСвойств(кн, Оформление.ЦветКнопки);	

КонецПроцедуры

&НаСервереБезКонтекста
Функция Воронка_ОбновитьЗвонокВежливостиНаСервере(IDK,ВидСобытия,ТипКлиента,ОформлениеЭлементов)
	
	Если ВидСобытия = ПредопределенноеЗначение("Справочник.CRM_ВидыСобытий.ЗвонокВежливости3") Тогда
		НомерЗвонка = "1"; ИмяЭлемента = ИмяЭлементаВоронка("кнЗвонокВежливости3",ТипКлиента);
		ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗвонокВежливости3дня;
	ИначеЕсли ВидСобытия = ПредопределенноеЗначение("Справочник.CRM_ВидыСобытий.ЗвонокВежливости30") Тогда	
		НомерЗвонка = "2"; ИмяЭлемента = ИмяЭлементаВоронка("кнЗвонокВежливости30",ТипКлиента);
		ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗвонокВежливости30Дней;
	ИначеЕсли ВидСобытия = ПредопределенноеЗначение("Справочник.CRM_ВидыСобытий.ЗвонокВежливости360") Тогда		
		НомерЗвонка = "3"; ИмяЭлемента = ИмяЭлементаВоронка("кнЗвонокВежливости360",ТипКлиента);;
		ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗвонокВежливости360Дней;
	КонецЕсли;
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = IDK;
	Запись.ЭтапПродаж = ЭтапПродаж;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Был звонок
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		ЦветКнопки = ОформлениеЭлементов.ЦветRenault3;
		Заголовок = "Звонок №" + НомерЗвонка + Символы.ПС + "(" + ТекстДата + ")";
		Картинка = ОформлениеЭлементов.ИзображениеСобытиеВыполнено;
	Иначе
		//Не было звонка
		//Проверим наличие напоминания
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	CRM_СобытияПоРабочимЛистам.Ссылка,
		|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания
		|ИЗ
		|	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
		|ГДЕ
		|	CRM_СобытияПоРабочимЛистам.IDK = &IDK
		|	И CRM_СобытияПоРабочимЛистам.ВидСобытия = &ВидСобытия
		|	И CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания";
		Запрос.УстановитьПараметр("IDK", IDK);
		Запрос.УстановитьПараметр("ВидСобытия", ВидСобытия);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			//Есть напоминание
			ЦветКнопки = ОформлениеЭлементов.ЦветRenault1;
			Заголовок = "Звонок №" + НомерЗвонка;
			Картинка = ОформлениеЭлементов.ИзображениеСобытиеЗапланировано;
			Если ЗначениеЗаполнено(Выборка.ДатаНапоминания) Тогда
				ТекстДата = Формат(Выборка.ДатаНапоминания, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
				Заголовок = "Звонок №" + НомерЗвонка + Символы.ПС + "(" + ТекстДата + ")";
			КонецЕсли;
		Иначе
			//Нет напоминания
			ЦветКнопки = ОформлениеЭлементов.ЦветRenault1;
			Заголовок = "Звонок №" + НомерЗвонка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый Структура("ИмяЭлемента, ЦветКнопки,Заголовок,Картинка",ИмяЭлемента,ЦветКнопки,Заголовок,Картинка);
	
КонецФункции

&НаКлиенте
Процедура Воронка_ОбновитьРегистрациюКлиентаВБазеРеноРоссия()

	кн = Элементы[ИмяЭлементаВоронка("кнРегистрацияВБазеРеноРоссия",Объект.ТипКлиента)];
	Оформление = Воронка_ОбновитьРегистрациюКлиентаВБазеРеноРоссияНаСервере(Объект.IDK,Объект.Клиент,Объект.ТипКлиента,ОформлениеЭлементов);
	ЗаполнитьЗначенияСвойств(кн, Оформление);
	ЗаполнитьЗначенияСвойств(кн, Оформление.ЦветКнопки);	

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИмяЭлементаВоронка(ИмяКнопки, ТипКлиента)

	КОРП = ТипКлиента = ПредопределенноеЗначение("Перечисление.Renault_ТипыКлиентов.КорпоративныйКлиент");
	
	Если КОРП Тогда
		Если ИмяКнопки = "кнВзятТелефон" Тогда ИмяЭлемента = "кнСтр1Воронка1";
		ИначеЕсли ИмяКнопки = "кнВзятEmail" Тогда ИмяЭлемента = "кнСтр1Воронка2";
		ИначеЕсли ИмяКнопки = "кнКарточкаКлиента" Тогда ИмяЭлемента = "кнСтр1Воронка3";
		ИначеЕсли ИмяКнопки = "кнПосещениеАвтосалона" Тогда ИмяЭлемента = "кнСтр2Воронка1";
		ИначеЕсли ИмяКнопки = "кнПрезентация" Тогда ИмяЭлемента = "кнСтр3Воронка1";
		ИначеЕсли ИмяКнопки = "кнТестДрайв" Тогда ИмяЭлемента = "кнСтр4Воронка1";
		ИначеЕсли ИмяКнопки = "кнКП" Тогда ИмяЭлемента = "кнСтр5Воронка1";
		ИначеЕсли ИмяКнопки = "кнДополнительноеОборудование" Тогда ИмяЭлемента = "кнСтр6Воронка1";
		ИначеЕсли ИмяКнопки = "кнПродленнаяГарантия" Тогда ИмяЭлемента = "кнСтр6Воронка2";
		ИначеЕсли ИмяКнопки = "кнТрейдИн" Тогда ИмяЭлемента = "кнСтр6Воронка3";
		ИначеЕсли ИмяКнопки = "кнКредит" Тогда ИмяЭлемента = "кнСтр6Воронка4";
		ИначеЕсли ИмяКнопки = "кнНаличные" Тогда ИмяЭлемента = "кнСтр6Воронка5";
		ИначеЕсли ИмяКнопки = "кнДКП" Тогда ИмяЭлемента = "кнСтр7Воронка1";
		ИначеЕсли ИмяКнопки = "кнMyRenault" Тогда ИмяЭлемента = "кнСтр8Воронка1";
		ИначеЕсли ИмяКнопки = "кнВыдача" Тогда ИмяЭлемента = "кнСтр9Воронка1";
		ИначеЕсли ИмяКнопки = "кнЗвонокВежливости3" Тогда ИмяЭлемента = "кнСтр10Воронка1";
		ИначеЕсли ИмяКнопки = "кнЗвонокВежливости30" Тогда ИмяЭлемента = "кнСтр10Воронка2";
		ИначеЕсли ИмяКнопки = "кнЗвонокВежливости360" Тогда ИмяЭлемента = "кнСтр10Воронка3";
		ИначеЕсли ИмяКнопки = "кнЗвонокВежливостиДР" Тогда ИмяЭлемента = "кнСтр10Воронка4";
		ИначеЕсли ИмяКнопки = "кнПредварительныйКонтракт" Тогда ИмяЭлемента = "кнСтр11Воронка1";
		КонецЕсли;
	Иначе
		Если ИмяКнопки = "кнВзятТелефон" Тогда ИмяЭлемента = "кнСтр1Воронка1";
		ИначеЕсли ИмяКнопки = "кнВзятEmail" Тогда ИмяЭлемента = "кнСтр1Воронка2";
		ИначеЕсли ИмяКнопки = "кнКарточкаКлиента" Тогда ИмяЭлемента = "кнСтр1Воронка3";
		ИначеЕсли ИмяКнопки = "кнПосещениеАвтосалона" Тогда ИмяЭлемента = "кнСтр2Воронка1";
		ИначеЕсли ИмяКнопки = "Презентация" Тогда ИмяЭлемента = "кнСтр3Воронка1";
		ИначеЕсли ИмяКнопки = "кнТестДрайв" Тогда ИмяЭлемента = "кнСтр4Воронка1";
		ИначеЕсли ИмяКнопки = "кнКП" Тогда ИмяЭлемента = "кнСтр5Воронка1";
		ИначеЕсли ИмяКнопки = "кнДополнительноеОборудование" Тогда ИмяЭлемента = "кнСтр6Воронка1";
		ИначеЕсли ИмяКнопки = "кнПродленнаяГарантия" Тогда ИмяЭлемента = "кнСтр6Воронка2";
		ИначеЕсли ИмяКнопки = "кнТрейдИн" Тогда ИмяЭлемента = "кнСтр6Воронка3";
		ИначеЕсли ИмяКнопки = "кнКредит" Тогда ИмяЭлемента = "кнСтр6Воронка4";
		ИначеЕсли ИмяКнопки = "кнНаличные" Тогда ИмяЭлемента = "кнСтр6Воронка5";
		ИначеЕсли ИмяКнопки = "кнРегистрацияВБазеРеноРоссия" Тогда ИмяЭлемента = "кнСтр7Воронка1";
		ИначеЕсли ИмяКнопки = "кнДКП" Тогда ИмяЭлемента = "кнСтр8Воронка1";
		ИначеЕсли ИмяКнопки = "кнMyRenault" Тогда ИмяЭлемента = "кнСтр9Воронка1";
		ИначеЕсли ИмяКнопки = "кнВыдача" Тогда ИмяЭлемента = "кнСтр10Воронка1";
		ИначеЕсли ИмяКнопки = "кнЗвонокВежливости3" Тогда ИмяЭлемента = "кнСтр11Воронка1";
		ИначеЕсли ИмяКнопки = "кнЗвонокВежливости30" Тогда ИмяЭлемента = "кнСтр11Воронка2";
		ИначеЕсли ИмяКнопки = "кнЗвонокВежливости360" Тогда ИмяЭлемента = "кнСтр11Воронка3";
		ИначеЕсли ИмяКнопки = "кнЗвонокВежливостиДР" Тогда ИмяЭлемента = "кнСтр11Воронка4";
		ИначеЕсли ИмяКнопки = "кнПредварительныйКонтракт" Тогда ИмяЭлемента = "кнСтр12Воронка1";
		КонецЕсли;
	КонецЕсли;
		
	Возврат ИмяЭлемента;

КонецФункции

&НаСервереБезКонтекста
Функция Воронка_ОбновитьРегистрациюКлиентаВБазеРеноРоссияНаСервере(IDK,Клиент,ТипКлиента,ОформлениеЭлементов)
		
	ДанныеКорпКлиента = ПолучитьИдентификаторКорпКлиента(Клиент,ТипКлиента);  
	ИдентификаторКорпКлиента = ?(ДанныеКорпКлиента <> Неопределено,ДанныеКорпКлиента.ИдентификаторКорпКлиента,"");

	//проверим была ли попытка регистрации клиента 
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.РегистрацияКлиентаВБазеРеноРоссия;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		ЦветКнопки = ОформлениеЭлементов.ЦветRenault3;
		//если корп.клиент зарегестрирован, выведем его идентификатор
		//если нет отобразим, дату регистрации корп. клиента
		Если ЗначениеЗаполнено(ИдентификаторКорпКлиента) Тогда		
			Заголовок = "Корп. клиент зарегистрирован. № " + ИдентификаторКорпКлиента;
		Иначе
			Заголовок = "Регистрация клиента в базе Renault Россия (" + ТекстДата + ")";
		КонецЕсли;	
	Иначе
		ЦветКнопки = ОформлениеЭлементов.ЦветRenault1;
		Заголовок = "Регистрация клиента в базе Renault Россия";
	КонецЕсли;
	
	Возврат Новый Структура("ЦветКнопки,Заголовок",ЦветКнопки,Заголовок);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИдентификаторКорпКлиента(Клиент,ТипКлиента)
	
	ИдентификаторКорпКлиента = "";
	
	ДанныеКорпКлиента = Новый Структура("КорпКлиент,ИдентификаторКорпКлиента");	
	ДанныеКорпКлиента.Вставить("КорпКлиент","");
	ДанныеКорпКлиента.Вставить("ИдентификаторКорпКлиента","");
			
	
	Если ТипЗнч(Клиент) = Тип("СправочникСсылка.Контрагенты") Тогда
		Если ТипКлиента = Перечисления.Renault_ТипыКлиентов.КорпоративныйКлиент Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Renault_КорпоративныеКлиенты.Ссылка
				|ИЗ
				|	Справочник.Renault_КорпоративныеКлиенты КАК Renault_КорпоративныеКлиенты
				|ГДЕ
				|	Renault_КорпоративныеКлиенты.Контрагент = &Контрагент";
			Запрос.УстановитьПараметр("Контрагент", Клиент);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				КорпКлиент  = Выборка.Ссылка;
				ИдентификаторКорпКлиента = КорпКлиент.Идентификатор;
				
				ДанныеКорпКлиента.Вставить("КорпКлиент",КорпКлиент);
				ДанныеКорпКлиента.Вставить("ИдентификаторКорпКлиента",ИдентификаторКорпКлиента);
				
				Возврат ДанныеКорпКлиента;
			КонецЕсли;	
		Иначе
			Возврат ДанныеКорпКлиента;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// НОВЫЙ КОД

// Возвращает значение реквизита, прочитанного из информационной базы по ссылке на объект.
// 
//  Если доступа к реквизиту нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
//
// Функция не предназначена для получения значений реквизитов пустых ссылок.
// 
// Параметры:
//  Ссылка       - ссылка на объект, - элемент справочника, документ, ...
//  ИмяРеквизита - Строка, например, "Код".
// 
// Возвращаемое значение:
//  Произвольный    - зависит от типа значения прочитанного реквизита.
// 
&НаСервереБезКонтекста
Функция ЗначениеРеквизитаОбъекта(Ссылка,ИмяРеквизита)
	Результат = ЗначенияРеквизитовОбъекта(Ссылка, ИмяРеквизита);
	Возврат Результат[СтрЗаменить(ИмяРеквизита, ".", "")];
КонецФункции

// Возвращает структуру, содержащую значения реквизитов прочитанные из информационной базы
// по ссылке на объект.
// 
//  Если доступа к одному из реквизитов нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Функция не предназначена для получения значений реквизитов пустых ссылок.
//
// Параметры:
//  Ссылка    - ЛюбаяСсылка - объект, значения реквизитов которого необходимо получить.
//
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую, в формате
//              требований к свойствам структуры.
//              Например, "Код, Наименование, Родитель".
//            - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//              псевдоним поля для возвращаемой структуры с результатом, а в качестве
//              значения (опционально) фактическое имя поля в таблице.
//              Если значение не определено, то имя поля берется из ключа.
//            - Массив, ФиксированныйМассив - имена реквизитов в формате требований
//              к свойствам структуры.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
//              Если строка затребованных реквизитов пуста, то возвращается пустая структура.
//              Если в качестве объекта передана пустая ссылка, то все реквизиты вернутся со значением Неопределено.
//
&НаСервереБезКонтекста
Функция ЗначенияРеквизитовОбъекта(Ссылка, Знач Реквизиты) Экспорт
	
	Если ТипЗнч(Реквизиты) = Тип("Строка") Тогда
		Если ПустаяСтрока(Реквизиты) Тогда
			Возврат Новый Структура;
		КонецЕсли;
		
		Реквизиты = обРазложитьСтрокуВМассивПодстрок(Реквизиты, ",");
		Пока Реквизиты.Найти("")<>Неопределено Цикл Реквизиты.Удалить(Реквизиты.Найти("")); КонецЦикла;
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура;
	Если ТипЗнч(Реквизиты) = Тип("Структура") Или ТипЗнч(Реквизиты) = Тип("ФиксированнаяСтруктура") Тогда
		СтруктураРеквизитов = Реквизиты;
	ИначеЕсли ТипЗнч(Реквизиты) = Тип("Массив") Или ТипЗнч(Реквизиты) = Тип("ФиксированныйМассив") Тогда
		Для Каждого Реквизит Из Реквизиты Цикл
			СтруктураРеквизитов.Вставить(СтрЗаменить(Реквизит, ".", ""), Реквизит);
		КонецЦикла;
	Иначе
		ВызватьИсключение Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Неверный тип второго параметра Реквизиты: %1'"), Строка(ТипЗнч(Реквизиты)));
	КонецЕсли;
	
	ТекстПолей = "";
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		ИмяПоля   = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
		              СокрЛП(КлючИЗначение.Значение),
		              СокрЛП(КлючИЗначение.Ключ));
		
		Псевдоним = СокрЛП(КлючИЗначение.Ключ);
		
		ТекстПолей  = ТекстПолей + ?(ПустаяСтрока(ТекстПолей), "", ",") + "
		|	" + ИмяПоля + " КАК " + Псевдоним;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|" + ТекстПолей + "
	|ИЗ
	|	" + Ссылка.Метаданные().ПолноеИмя() + " КАК ПсевдонимЗаданнойТаблицы
	|ГДЕ
	|	ПсевдонимЗаданнойТаблицы.Ссылка = &Ссылка
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Результат = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		Результат.Вставить(КлючИЗначение.Ключ);
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура спКППриАктивизацииСтроки(Элемент)
	Если Элементы.спКП.ТекущиеДанные<>Неопределено Тогда
		спКПСостав.Параметры.УстановитьЗначениеПараметра("Ссылка",Элементы.спКП.ТекущиеДанные.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура спВыдачиПриАктивизацииСтроки(Элемент)
	Если Элементы.спВыдачиАвтомобили.ТекущиеДанные<>Неопределено Тогда
		спВыдачиАвтомобили.Параметры.УстановитьЗначениеПараметра("Ссылка",Элементы.спВыдачи.ТекущиеДанные.Ссылка);
	КонецЕсли;
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// НЕАКТУАЛЬНЫЙ КОД

&НаСервереБезКонтекста
Функция ЭтаФормаУжеОткрыта(вхПользователь, вхИмя, вхКомпьютер, вхПолноеИмя = Неопределено)
	
	вхПолноеИмя = ?(вхПолноеИмя = Неопределено, вхИмя, вхПолноеИмя);

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Renault_ОткрытыеФормы.Пользователь,
	                      |	Renault_ОткрытыеФормы.ИмяФормы,
	                      |	Renault_ОткрытыеФормы.Компьютер,
	                      |	Renault_ОткрытыеФормы.ПолноеИмяФормы
	                      |ИЗ
	                      |	РегистрСведений.Renault_ОткрытыеФормы КАК Renault_ОткрытыеФормы
	                      |ГДЕ
	                      |	Renault_ОткрытыеФормы.ПолноеИмяФормы ПОДОБНО &ПолноеИмяФормы
	                      |	И Renault_ОткрытыеФормы.ИмяФормы = &ИмяФормы
	                      |	И Renault_ОткрытыеФормы.Пользователь = &Пользователь
	                      |	И Renault_ОткрытыеФормы.Компьютер = &Компьютер");
	Запрос.УстановитьПараметр("ПолноеИмяФормы", вхПолноеИмя);
	Запрос.УстановитьПараметр("Компьютер", вхКомпьютер);
	Запрос.УстановитьПараметр("Пользователь", вхПользователь);
	Запрос.УстановитьПараметр("ИмяФормы", вхИмя);
	
	Выборка = запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Следующий();
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

БО = Renault_ОбщиеФункции.МультибрендПараметрыОформления();
ЦветRenault1 = Новый Структура("Цветфона,ЦветТекста,ЦветРамки",БО.ДопЦвет1,БО.ЦветТекста,БО.ДопЦвет1);
ЦветRenault2 = Новый Структура("Цветфона,ЦветТекста,ЦветРамки",БО.ДопЦвет3,БО.ЦветТекста,БО.ДопЦвет3);
ЦветRenault3 = Новый Структура("Цветфона,ЦветТекста,ЦветРамки",БО.ДопЦвет4,БО.ЦветТекста,БО.ДопЦвет4);
Цвет125157183 = Новый Структура("Цветфона,ЦветТекста,ЦветРамки",Новый Цвет(125,157,183),БО.ЦветТекста,Новый Цвет(125,157,183));
Цвет121181109 = Новый Структура("Цветфона,ЦветТекста,ЦветРамки",Новый Цвет(121,181,109),БО.ЦветТекста,Новый Цвет(121,181,109));
Цвет211668 = Новый Структура("Цветфона,ЦветТекста,ЦветРамки",Новый Цвет(211,6,68),БО.ЦветТекста,Новый Цвет(211,6,68));

ОформлениеЭлементов = Новый Структура;
ОформлениеЭлементов.Вставить("ЦветRenault1",ЦветRenault1);
ОформлениеЭлементов.Вставить("ЦветRenault2",ЦветRenault2);
ОформлениеЭлементов.Вставить("ЦветRenault3",ЦветRenault3);
ОформлениеЭлементов.Вставить("Цвет125157183",Цвет125157183);
ОформлениеЭлементов.Вставить("Цвет121181109",Цвет121181109);

ОформлениеЭлементов.Вставить("ИзображениеСобытиеВыполнено",БиблиотекаКартинок.Renault_Confirm_Square);
ОформлениеЭлементов.Вставить("ИзображениеСобытиеЗапланировано",БиблиотекаКартинок.Renault_Confirm_New);
ОформлениеЭлементов.Вставить("ИзображениеПустое",Новый Картинка);
