#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСтатусы() Экспорт 

	Статус = Справочники.СтатусыОтчетовПоРекламнойКампании.Согласован.ПолучитьОбъект();
	Статус.Вес = 10;
	Статус.ПредставлениеВОтчете = "О";
	Статус.ЦветФона = Новый ХранилищеЗначения(WebЦвета.Зеленый,Новый СжатиеДанных(9));
	Статус.Записать();

	Статус = Справочники.СтатусыОтчетовПоРекламнойКампании.Заявлен.ПолучитьОбъект();
	Статус.Наименование = "Подгружен";
	Статус.ЦветФона = Новый ХранилищеЗначения(WebЦвета.Голубой,Новый СжатиеДанных(9));
	Статус.ПредставлениеВОтчете = "О";
	Статус.Вес = 20;
	Статус.Записать();

	Статус = Справочники.СтатусыОтчетовПоРекламнойКампании.НаСогласовании.ПолучитьОбъект();
	Статус.ЦветФона = Новый ХранилищеЗначения(WebЦвета.СветлоЗеленый,Новый СжатиеДанных(9));
	Статус.ПредставлениеВОтчете = "О";
	Статус.Вес = 30;
	Статус.Записать();

	Статус = Справочники.СтатусыОтчетовПоРекламнойКампании.КомментарииОтMMR.ПолучитьОбъект();
	Статус.ЦветФона = Новый ХранилищеЗначения(WebЦвета.Желтый,Новый СжатиеДанных(9));
	Статус.ПредставлениеВОтчете = "О";
	Статус.Вес = 40;
	Статус.Записать();
	
	Статус = Справочники.СтатусыОтчетовПоРекламнойКампании.НеСогласован.ПолучитьОбъект();
	Статус.ЦветФона = Новый ХранилищеЗначения(WebЦвета.Красный,Новый СжатиеДанных(9));
	Статус.ПредставлениеВОтчете = "О";
	Статус.Вес = 60;
	Статус.Записать();

	Статус = Справочники.СтатусыОтчетовПоРекламнойКампании.БезДействия.ПолучитьОбъект();
	Статус.ЦветФона = Новый ХранилищеЗначения(WebЦвета.Белый,Новый СжатиеДанных(9));
	Статус.ПредставлениеВОтчете = "О";
	Статус.Вес = 70;
	Статус.Записать();

	Статус = Справочники.СтатусыОтчетовПоРекламнойКампании.ВАрхиве.ПолучитьОбъект();
	Статус.ЦветФона = Новый ХранилищеЗначения(WebЦвета.Красный,Новый СжатиеДанных(9));
	Статус.ПредставлениеВОтчете = "О";
	Статус.Вес = 80;
	Статус.Записать();

	Статус = Справочники.СтатусыОтчетовПоРекламнойКампании.БезОтчета.ПолучитьОбъект();
	Статус.ЦветФона = Новый ХранилищеЗначения(WebЦвета.Белый,Новый СжатиеДанных(9));
	Статус.ПредставлениеВОтчете = "О";
	Статус.Вес = 90;
	Статус.Записать();

КонецПроцедуры   
 
//#КонецОбласти

#КонецЕсли