// Список синонимов - это копия таблицы синонимов и предназначена для контроля за 
// отстутствие дубликатов синонимов. Идентификатор элемента списка увеличенный на 1
// (тогда 0 индекс - новая строка) копируется в поле Индекс дерева: ТаблицаСинонимов
// для поиска изменяемого значения;
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Если Не Объект.ИспользоватьСинонимы Тогда
	//	ЗагрузитьТаблицуСинонимов(Объект.Синонимы);
	//Иначе
		УстановитьПривилегированныйРежим(Истина);
		ЗагрузитьТаблицуСинонимов(ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","Синонимы",,ПользователиИнформационнойБазы.ТекущийПользователь().Имя));
		УстановитьПривилегированныйРежим(Ложь);
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии()
	ТипПроизводителя = ОпределитьТипПроизводителя();
	Если ТипПроизводителя = Неопределено Тогда
		Элементы.ТаблицаСинонимовПроизводитель.Видимость=Ложь;
	Иначе
		Элементы.ТаблицаСинонимовПроизводитель.ОграничениеТипа=ТипПроизводителя;
	КонецЕсли;
	Элементы.ОпределитьПроизводителей.Видимость = Элементы.ТаблицаСинонимовПроизводитель.Видимость;	
	Данные=ПолучитьДанные();
	Если ТипЗнч(Данные)=Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Объект,Данные);
	КонецЕсли;
	Объект.ВнешняяОбработка=Этаформа.ВладелецФормы.Объект.ВнешняяОбработка;
КонецПроцедуры

&НаСервере	
Функция ПолучитьДанные()
	УстановитьПривилегированныйРежим(Истина);
	Данные = ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","ОбъектMySQL",,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	Возврат Данные;
КонецФункции

&НаСервере
Функция ОпределитьТипПроизводителя()
	Если Метаданные.Справочники.Найти("Номенклатура") = Неопределено Тогда Возврат Неопределено; КонецЕсли;
	Реквизиты=Метаданные.Справочники.Номенклатура.Реквизиты;
	Если Реквизиты.Найти("ор_Производитель")<>Неопределено Тогда Возврат Реквизиты.ор_Производитель.Тип;
	ИначеЕсли Реквизиты.Найти("асПроизводитель")<>Неопределено Тогда Возврат Реквизиты.асПроизводитель.Тип;
	ИначеЕсли Реквизиты.Найти("Производитель")<>Неопределено
		И (Лев(Метаданные.Имя+Метаданные.Версия,23) <> "УправлениеТорговлей10.3") 
		И (Лев(Метаданные.Имя+Метаданные.Версия,30) <> "УправлениеТорговлейБазовая10.3") Тогда
		Возврат Реквизиты.Производитель.Тип; 
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

// Формируем дерево для переноса в таблице синонимов и 
// и список синонимов для контроля за дубликатами
&НаСервере
Процедура ЗагрузитьТаблицуСинонимов(ТабСинонимы)
	Дерево=Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("Синоним");
	Дерево.Колонки.Добавить("Производитель");
	Дерево.Колонки.Добавить("Индекс");
	ИндексМакс=1;
	СписокСинонимов=Новый СписокЗначений;
	Если (ТабСинонимы = Неопределено) или (ТабСинонимы.Количество()=0) Тогда Возврат;КонецЕсли;
	ТабСинонимы.Сортировать("Бренд");
	ТекБренд = "";

	Для Каждого Стр из ТабСинонимы Цикл
		Если СокрП(Стр.Бренд)<>ТекБренд Тогда
			ТекБренд=Стр.Бренд;
			БрендСоздан=Ложь;
		КонецЕсли;
		Если Стр.Синоним<>ТекБренд И ТекБренд <> "" Тогда
			Если НЕ БрендСоздан Тогда
				ТекЕл=СписокСинонимов.Добавить(СокрП(Стр.Бренд),Стр.Бренд,Истина);
				ТекСтр=Дерево.Строки.Добавить();
				ТекСтр.Индекс=ТекЕл.ПолучитьИдентификатор()+1;
				ТекСтр.Синоним = СокрП(Стр.Бренд);
				ТекСтр.Производитель = Стр.Производитель;
				ТекУзел=ТекСтр.Строки;
				БрендСоздан=Истина;
			КонецЕсли;	
			ТекЕл=СписокСинонимов.Добавить(Стр.Синоним,Стр.Бренд,Ложь);
			ТекСтр=ТекУзел.Добавить();
			ТекСтр.Индекс=ТекЕл.ПолучитьИдентификатор()+1;
			ТекСтр.Синоним = Стр.Синоним;
		КонецЕсли;	
	КонецЦикла;
	ЗначениеВРеквизитФормы(Дерево,"ТаблицаСинонимов");

КонецПроцедуры

&НаСервере
Функция ЗагрузитьСправочникСинонимовНаСервере()
	Обработка=РеквизитФормыВЗначение("Объект");
	ТабСин=Обработка.ПолучитьСинонимы();
	Если ТабСин=Неопределено Тогда Возврат 0;КонецЕсли;
	ТабСин.Сортировать("Бренд");
	ДеревоСинонимов=РеквизитФормыВЗначение("ТаблицаСинонимов",Тип("ДеревоЗначений"));
	ТекБренд="";
	Бренд=Неопределено;
	Всего=0;
	Ошибка="";
	Для Каждого Стр Из ТабСин Цикл
		Если СокрП(Стр.Бренд)<>ТекБренд Тогда
			// Только регистрируем бренд, записывать только когда будет синоним
			ТекБренд=СокрП(Стр.Бренд);
			Бренд=Неопределено;
			НовыйБренд=Ложь;
		КонецЕсли;
		Если ТекБренд<>Стр.Синоним Тогда
			Если Бренд=Неопределено Тогда
				// Синоним найден, Ищем бренд:
				Бренд=ДеревоСинонимов.Строки.Найти(ТекБренд,"Синоним",Истина);
				Если Бренд=Неопределено Тогда
					// Бренда нет - создаем
					Бренд=ДеревоСинонимов.Строки.Добавить();
					Бренд.Синоним=ТекБренд;
					НовыйБренд=Истина;
					Всего=Всего+1;
				Иначе
					НовыйБренд=Ложь;
					// Бренд есть, если он синоним - берем его родителя как бренд 
					Если Бренд.Родитель<>Неопределено Тогда
						Бренд=Бренд.Родитель;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			// Ищем синонимы
			Синоним=ДеревоСинонимов.Строки.Найти(Стр.Синоним,"Синоним",Истина);
			Если Синоним=Неопределено Тогда
				// Синонима нет - создаем
				Синоним=Бренд.Строки.Добавить();
				Синоним.Синоним=СокрП(Стр.Синоним);
				Всего=Всего+1;
			ИначеЕсли Синоним.Родитель<>Бренд и Синоним<>Бренд Тогда
				// Синоним есть, но принадлежит другому бренду.
				Если НовыйБренд Тогда
					// Если синоним принадлежит другому родителю, то и новый бренд ему принадлежит
					ВБренд=?(Синоним.Родитель=Неопределено,Синоним,Синоним.Родитель);
					// Переназначаем родителя строкам бренда и самому бренду через добавить/удалить
					Для Каждого НовСтр из Бренд.Строки Цикл
						брендСтр=ВБренд.Строки.Добавить();
						брендСтр.Синоним=НовСтр.Синоним;
						Бренд.Строки.Удалить(НовСтр);
					КонецЦикла;
					брендСтр=ВБренд.Строки.Добавить();
					брендСтр.Синоним=Бренд.Синоним;
					ДеревоСинонимов.Строки.Удалить(Бренд);
					Бренд=ВБренд;
					НовыйБренд=Ложь;
				Иначе
					// Фиксируем принадлежность синонимов разным брендам
					Ошибка=Ошибка+символы.ПС+Стр.Синоним+" : "+ТекБренд+" ? "
					+?(Синоним.Родитель=Неопределено,Стр.Синоним,Синоним.Родитель.Синоним);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если Всего>0 Тогда
		ДеревоСинонимов.Строки.Сортировать("Синоним",Истина);
		СписокСинонимов.Очистить();
		// Формируем новый список синонимов
		Для Каждого Бренд Из ДеревоСинонимов.Строки Цикл
			Стр=СписокСинонимов.Добавить(Бренд.Синоним,Бренд.Синоним,Истина);
			Бренд.Индекс=Стр.ПолучитьИдентификатор()+1;
			Для Каждого Синоним Из Бренд.Строки Цикл
				Стр=СписокСинонимов.Добавить(Синоним.Синоним,Бренд.Синоним,Ложь);
				Синоним.Индекс=Стр.ПолучитьИдентификатор()+1;
			КонецЦикла;
		КонецЦикла;
		ЗначениеВРеквизитФормы(ДеревоСинонимов,"ТаблицаСинонимов");
	КонецЕсли;
	Если Ошибка<>"" Тогда
		Сообщить("Проверьте синоним принадлежит разным брендам:"+Символы.ПС
		+"Синоним : Бренд в загрузке ? бренд в таблице"+Ошибка);
	КонецЕсли;
	Возврат Всего;

КонецФункции

&НаКлиенте
Процедура ЗагрузитьСправочникСинонимов(Команда)
	Всего=ЗагрузитьСправочникСинонимовНаСервере();
	ПоказатьПредупреждение(,"Загружено всего брендов и синонимов: "+Всего);
	Если Всего>0 Тогда
		Элементы.ТаблицаСинонимов.Обновить();
		ЭтаФорма.Модифицированность=Истина;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОпределитьПроизводителей(Команда)
	Типы=Элементы.ТаблицаСинонимовПроизводитель.ОграничениеТипа.Типы();
	Ответ=ОпределитьПроизводителейНаСервере(Типы);
	Если Ответ <> "" Тогда
		ПоказатьПредупреждение(,"Данные производители являются синонимами других производителей:"+Ответ);
	КонецЕсли;
	ЭтаФорма.Модифицированность=Истина;
КонецПроцедуры

&НаСервере
Функция ОпределитьПроизводителейНаСервере(Типы);
	Ответ="";
	Дерево=РеквизитФормыВЗначение("ТаблицаСинонимов",Тип("ДеревоЗначений"));
	// Цикл по типам - обычно это один тип
	Для Каждого ЕлТип Из Типы Цикл
		СтрТип=Метаданные.НайтиПоТипу(ЕлТип).ПолноеИмя();
		// Рассматриваем только справочники
		Если Лев(СтрТип,11)<>"Справочник." Тогда Продолжить;КонецЕсли;
		Запрос=Новый Запрос(
		"ВЫБРАТЬ
		|	Производители.Ссылка КАК Ссылка,
		|	Производители.Наименование КАК Наименование
		|ИЗ
		|	"+СтрТип+" КАК Производители
		|ГДЕ
		|	Производители.ПометкаУдаления = ЛОЖЬ");
		Выб=Запрос.Выполнить().Выбрать();
		// Цикл по производителям, не помеченных на удаление
		Пока Выб.Следующий() Цикл
			Бренд = Выб.Наименование;
			Стр=СписокСинонимов.НайтиПоЗначению(Бренд);
			// Если такого синонима нет - пропускаем этого производителя
			Если Стр=Неопределено Тогда Продолжить; КонецЕсли; 
			СтрДер=Дерево.Строки.Найти(Бренд,"Синоним",Истина);
			Если СтрДер=Неопределено Тогда Продолжить;КонецЕсли;
			СтрРод=СтрДер.Родитель;	
			Если СтрРод<>Неопределено Тогда
				// наименование производителя совпадает с синонимом
				Если ЗначениеЗаполнено(СтрРод.Производитель) Тогда
					// Производитель уже определен
					Если Выб.Ссылка<>СтрРод.Производитель Тогда
						Ответ=Символы.ПС+Бренд+" - "+СтрРод.Производитель.Наименование;
					КонецЕсли;
				Иначе
					// Если наименование производителя совпадает с синонимом бренд меняем на синоним
					СтрДер.Синоним=СтрРод.Синоним;
					СтрБренд=СписокСинонимов.НайтиПоЗначению(СтрРод.Синоним);
					Стр.Значение=СтрРод.Синоним;
					Стр.Представление=Бренд;
					СтрРод.Синоним=Бренд;
					СтрБренд.Значение=Бренд;
					СтрБренд.Представление=Бренд;
					СтрРод.Производитель=Выб.Ссылка;
				КонецЕсли;
			Иначе
				// наименование производителя совпадает с брендом
				ЕСли ЗначениеЗаполнено(СтрДер.Производитель) Тогда
					// Производитель уже определен
					Если Выб.Ссылка<>СтрДер.Производитель Тогда
						Ответ=Символы.ПС+Бренд+" - "+СтрДер.Производитель.Наименование;
					КонецЕсли;
				Иначе
					СтрДер.Производитель=Выб.Ссылка;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	ЗначениеВРеквизитФормы(Дерево,"ТаблицаСинонимов");
	Возврат Ответ;
КонецФункции

&НаКлиенте
Процедура ТаблицаСинонимовПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Попытка
	ТекДан=Элемент.ТекущиеДанные;
	Ответ="";
	Если ПустаяСтрока(ТекДан.Синоним) Тогда
		Ответ = "Не задан "+?(ТекДан.ПолучитьРодителя()=Неопределено,"бренд","синоним");
	Иначе
		Стр=СписокСинонимов.НайтиПоЗначению(ТекДан.Синоним);
		Если Стр<>Неопределено И (Стр.ПолучитьИдентификатор()+1)<>ТекДан.Индекс Тогда
			Ответ = ?(ТекДан.ПолучитьРодителя()=Неопределено,"Бренд","Синоним")+" уже существует "
			+?(Стр.Пометка,"как бренд", "у бренда: "+Стр.Представление);
		ИначеЕсли ТекДан.Индекс=0 Тогда
			Родитель=ТекДан.ПолучитьРодителя();
			Если Родитель=Неопределено Тогда
				Стр=СписокСинонимов.Добавить(ТекДан.Синоним,ТекДан.Синоним,Истина);
			Иначе
				Стр=СписокСинонимов.НайтиПоИдентификатору(Родитель.Индекс-1);
				Если Стр=Неопределено Тогда
					Ответ = "Ошибка при поиске родителя нового синонима: "+ТекДан.Синоним;
				Иначе
					Стр=СписокСинонимов.Добавить(ТекДан.Синоним,Родитель.Синоним,Ложь);
				КонецЕсли;
			КонецЕсли;
			Если Ответ="" Тогда
				ТекДан.Индекс=Стр.ПолучитьИдентификатор()+1;
			КонецЕсли;
		Иначе
			Стр=СписокСинонимов.НайтиПоИдентификатору(ТекДан.Индекс-1);
			Если Стр=Неопределено Тогда
				Ответ="Ошибка при поиске индекса синонима: "+ТекДан.Синоним;
			КонецЕсли;
			Стр.Значение=ТекДан.Синоним;
		КонецЕсли;
	КонецЕсли;
	
	Исключение
		Ответ=ОписаниеОшибки();
	КонецПопытки;
	
	Если Ответ<>"" Тогда 
		//Если Не ПустаяСтрока(ТекДан.Синоним) Тогда
			ПоказатьПредупреждение(,Ответ);
		//КонецЕсли;
		Отказ=Истина;
		ОтменаРедактирования=Истина;
		Если ТекДан.Индекс=0 Тогда 
			Родитель=ТекДан.ПолучитьРодителя();
			Если Родитель=Неопределено Тогда Родитель=ТаблицаСинонимов.ПолучитьЭлементы();
			Иначе Родитель=Родитель.ПолучитьЭлементы();
			КонецЕсли;
			Родитель.Удалить(Родитель.Индекс(ТекДан));
		КонецЕсли;
	Иначе
		ЭтаФорма.Модифицированность=Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСинонимовПриАктивизацииСтроки(Элемент)
	// Для бренда делаем доступным поле Производитель
	ТекДан=Элементы.ТаблицаСинонимов.ТекущиеДанные;
	Если ТекДан<>Неопределено Тогда
		Элементы.ТаблицаСинонимовПроизводитель.Доступность=ТекДан.ПолучитьРодителя()=Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьБренд(Команда)
	Строки=ТаблицаСинонимов.ПолучитьЭлементы();
	Строка=Строки.Добавить();
	Элементы.ТаблицаСинонимов.ТекущаяСтрока=Строка.ПолучитьИдентификатор();
	Элементы.ТаблицаСинонимовПроизводитель.Доступность=Истина;
	ЭтаФорма.Модифицированность=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСиноним(Команда)
	ТекДан=Элементы.ТаблицаСинонимов.ТекущиеДанные;
	ТекРод=ТекДан.ПолучитьРодителя();
	Строки=?(ТекРод=Неопределено,ТекДан.ПолучитьЭлементы(),ТекРод.ПолучитьЭлементы());
	Строка=Строки.Добавить();
	Элементы.ТаблицаСинонимов.ТекущаяСтрока=Строка.ПолучитьИдентификатор();
	Элементы.ТаблицаСинонимовПроизводитель.Доступность=Ложь;
	ЭтаФорма.Модифицированность=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСинонимовПередУдалением(Элемент, Отказ)
	ТекРод=Элемент.ТекущийРодитель;
	ТекДан=Элемент.ТекущиеДанные;
	Если ТекРод=Неопределено Тогда 
		Если ТекДан.ПолучитьЭлементы().Количество()>0 Тогда
			ПоказатьПредупреждение(,"Бренд содержит синонимы. В начале удалите их",0,"Удаление бренда");
			Отказ=Истина;
		Иначе
			ЭтаФорма.Модифицированность=Истина;
		КонецЕсли;
	Иначе
		ЭтаФорма.Модифицированность=Истина;
	КонецЕсли;
	Если Не Отказ и ТекДан.Индекс>0 Тогда
		стр=СписокСинонимов.НайтиПоИдентификатору(ТекДан.Индекс-1);
		Если Стр<>Неопределено Тогда
			СписокСинонимов.Удалить(Стр);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьИВыйтиНаСервере()
	Дерево=РеквизитФормыВЗначение("ТаблицаСинонимов",Тип("ДеревоЗначений"));
	Таблица=Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Бренд");
	Таблица.Колонки.Добавить("Синоним");
	Таблица.Колонки.Добавить("Производитель");
	Для Каждого Бренд Из Дерево.Строки Цикл
		Стр=Таблица.Добавить();
		Стр.Бренд=Бренд.Синоним;
		Стр.Синоним=Бренд.Синоним;
		Производитель=?(ЗначениеЗаполнено(Бренд.Производитель),Бренд.Производитель,Неопределено);
		Стр.Производитель=Производитель;
		Для Каждого Синоним из Бренд.Строки Цикл
			Стр=Таблица.Добавить();			
			Стр.Бренд=Бренд.Синоним;
			Стр.Синоним=Синоним.Синоним;
			Стр.Производитель=Производитель;
		КонецЦикла;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Истина);
	ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса","Синонимы",Таблица,,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура СохранитьИВыйти(Команда)
	СохранитьИВыйтиНаСервере(); 
	ЭтаФорма.Модифицированность=Ложь;
	ЭтаФорма.Закрыть();		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если ЭтаФорма.Модифицированность Тогда
		Отказ=Истина;
		Оповещение=Новый ОписаниеОповещения("ОбработатьОтвет",ЭтотОбъект);
		ПоказатьВопрос(Оповещение,"Таблица синонимов была изменена. Сохранить изменения?",РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтвет(Ответ,Параметр=Неопределено) Экспорт
	Если Ответ=Неопределено или Ответ = КодВозвратаДиалога.Отмена Тогда Возврат;КонецЕсли;
	Если Ответ=КодВозвратаДиалога.Да Тогда
		СохранитьИВыйтиНаСервере();
	КонецЕсли;
	ЭтаФорма.Модифицированность=Ложь;
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСинонимовСинонимПриИзменении(Элемент)
	ТекДан=Элементы.ТаблицаСинонимов.ТекущиеДанные;
	Если ТекДан<>Неопределено Тогда
		ТекДан.Синоним=ВРЕГ(ТекДан.Синоним);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицуСинонимов(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("ОчиститьТаблицуОтвет",ЭтотОбъект),"Очистить таблицу синонимов?",РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицуОтвет(Ответ,Доп=Неопределено) Экспорт
	Если Ответ=КодВозвратаДиалога.Да Тогда
		ОчиститьТаблицуСинонимовНаСервере();
		СписокСинонимов.Очистить();
		Элементы.ТаблицаСинонимов.Обновить();
	КонецЕсли;
Конецпроцедуры

Процедура ОчиститьТаблицуСинонимовНаСервере()
	Дерево=Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("Синоним");
	Дерево.Колонки.Добавить("Производитель");
	Дерево.Колонки.Добавить("Индекс");
	ЗначениеВРеквизитФормы(Дерево,"ТаблицаСинонимов");
Конецпроцедуры

&НаКлиенте
Процедура ТаблицаСинонимовПроизводительПриИзменении(Элемент)
	ТекДан=Элементы.ТаблицаСинонимов.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДан.Производитель) Тогда
		Бренд=ВРЕГ(СокрП(ТекДан.Производитель));
		Если ТекДан.Синоним<>Бренд Тогда
			Строки=ТекДан.ПолучитьЭлементы();
			ТекСпис=СписокСинонимов.НайтиПоИдентификатору(ТекДан.Индекс-1);
			СтрСпис=СписокСинонимов.НайтиПоЗначению(Бренд);
			Если СтрСпис=Неопределено Тогда
				СтрСпис=СписокСинонимов.Добавить(ТекДан.Синоним,Бренд,Ложь);
				Стр=Строки.Добавить();
				Стр.Синоним=ТекДан.Синоним;
				Стр.Индекс=СтрСпис.ПолучитьИдентификатор()+1;
				ТекСпис.Значение=Бренд;
				ТекСпис.Представление=Бренд;
				ТекДан.Синоним=Бренд;
			Иначе
				Стр=Неопределено;
				Для каждого СинСтр Из Строки Цикл
					Если СинСтр.Синоним=Бренд Тогда
						Стр=СинСтр;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если Стр=Неопределено Тогда 
					ПоказатьПредупреждение(,"Наименование производителя: "+СтрСпис.Значение
					+" включено в синонимы бренда: "+СтрСпис.Представление+Символы.ПС
					+"Исправьте ошибку вручную.");
				Иначе
					СтрСпис.Значение=ТекДан.Синоним;
					СтрСпис.Представление=Бренд;
					Стр.Синоним=ТекДан.Синоним;
					ТекДан.Синоним=Бренд;
					ТекСпис.Значение=Бренд;
					ТекСпис.Представление=Бренд;
				КонецЕсли;
		    КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ЭтаФорма.Модифицированность=Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПолеПоискаПриИзменении(Элемент)
	Синоним=ВРег(ПолеПоиска);
	Стр=СписокСинонимов.НайтиПоЗначению(Синоним);
	Если Стр=Неопределено тогда 
		Возврат;
	КонецЕсли;
	Бренд=Стр.Представление;
	Для Каждого СтрБренд из ТаблицаСинонимов.ПолучитьЭлементы() Цикл
		Если СтрБренд.Синоним=Бренд Тогда
			Если Бренд=Синоним Тогда
				Элементы.ТаблицаСинонимов.ТекущаяСтрока=СтрБренд.ПолучитьИдентификатор();
				Возврат;
			КонецЕсли;
			Элементы.ТаблицаСинонимов.Развернуть(СтрБренд.ПолучитьИдентификатор());
			Для Каждого СтрСиноним из СтрБренд.ПолучитьЭлементы() Цикл 
				Если СтрСиноним.Синоним=Синоним Тогда
					Элементы.ТаблицаСинонимов.ТекущаяСтрока=СтрСиноним.ПолучитьИдентификатор();
					Возврат;
				КонецЕсли;
			КонецЦикла;
			Элементы.ТаблицаСинонимов.ТекущаяСтрока=СтрБренд.ПолучитьИдентификатор();
			Возврат;
		КонецЕсли;
	КонецЦикла;
	Сообщить("Бренд "+Бренд+" не найден");
    Возврат;
КонецПроцедуры

&НаКлиенте
Процедура ПолеПоискаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Стандартнаяобработка=Ложь;
	Длина=СтрДлина(Текст);
	ТекстПоиска=ВРЕГ(Текст);
	ДанныеВыбора=Новый СписокЗначений;
	Для Каждого Стр из СписокСинонимов Цикл
		Если Лев(Стр.Значение,Длина)=ТекстПоиска Тогда
			ДанныеВыбора.Добавить(Стр.Значение,Стр.Значение);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция НайтиДублиПроизводителейНаСервере(Типы,ВсеДубли)
	//Список проблемных брендов Представление - бренд, значение - список значений;
	Дубли=Новый СписокЗначений; 
	// Выбиравем только один тип производителей
	Для Каждого ЕлТип Из Типы Цикл
		СтрТип=Метаданные.НайтиПоТипу(ЕлТип).ПолноеИмя();
		Если Лев(СтрТип,11)="Справочник." Тогда Прервать;КонецЕсли;
		СтрТип=Неопределено;
	КонецЦикла;
	Если СтрТип=Неопределено тогда Возврат Дубли;КонецЕсли;
	
	Для Каждого Стр из ТаблицаСинонимов.ПолучитьЭлементы() Цикл
		Если Стр.Производитель=Неопределено или Стр.Производитель.Пустая() Тогда Продолжить;КонецЕсли;
		Наименования=Новый Массив;
		Для Каждого Ел из Стр.ПолучитьЭлементы() Цикл
			Наименования.Добавить(Ел.Синоним);
		КонецЦикла;
		
		Запрос=Новый Запрос(
		"ВЫБРАТЬ
		|	Производители.Ссылка КАК Ссылка,
		|	Производители.Наименование КАК Наименование,
		|	Производители.ПометкаУдаления КАК Пометка
		|ИЗ
		|	"+СтрТип+" КАК Производители
		|ГДЕ
		|	Производители.Наименование В(&Наименования)
		//|	И Производители.ПометкаУдаления = ЛОЖЬ
		|");
		Запрос.УстановитьПараметр("Наименования",Наименования);
		Вып=Запрос.Выполнить();
		Если Вып.Пустой() Тогда Продолжить; КонецЕсли;
		Список=Новый СписокЗначений;
		ПометкаБренд=Стр.Производитель.ПометкаУдаления;
		Список.Добавить(Стр.Производитель,Стр.Синоним,ПометкаБренд);
		ЕстьБезПометки=ВсеДубли;
		Выб=Вып.Выбрать();
		Пока Выб.Следующий() Цикл
			ЕстьБезПометки=ЕстьБезПометки ИЛИ Не Выб.Пометка;
			Список.Добавить(Выб.Ссылка,ВРег(Выб.Наименование),Выб.Пометка);
		КонецЦикла;
		Если ЕстьБезПометки Тогда
			Дубли.Добавить(Список,Стр.Синоним,ПометкаБренд);
		КонецЕсли;
	КонецЦикла;
	Возврат Дубли;	
КонецФункции

&НаКлиенте
Процедура НайтиДублиПроизводителей(Команда)
	ВсеДубли=Команда=Истина;
	Типы=Элементы.ТаблицаСинонимовПроизводитель.ОграничениеТипа.Типы();
	Дубли=НайтиДублиПроизводителейНаСервере(Типы,ВсеДубли);
	Если Дубли.Количество()=0 Тогда
		ПоказатьПредупреждение(,"Бренды, имеющие несколько произодителей отсутствуют");
	Иначе
		ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ДубликатыПроизводителейУФ",
		Новый Структура("Производители",Дубли),ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ВсеДубли(Команда)
	НайтиДублиПроизводителей(Истина);
КонецПроцедуры
