//// Регистрация документов в плане обмена ОбменСАвтохаб
///////////////////////////////////////////////////////////

Процедура РегистрацияИзмененныхДокументов(Источник, Отказ) Экспорт
	//Если Не ЭтоРабочаяБаза() Тогда
	//	Возврат;
	//КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказНаряд") Тогда
		РегистрацияЗаказНаряда(Источник);
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияАвтомобилей") Тогда
		//РегистрацияРеализацииАвтомобилей(Источник);
	КонецЕсли;	
КонецПроцедуры

Процедура РегистрацияЗаказНаряда(ЗаказНаряд)	
	ЗаказНарядЗакрыт = ЗаказНаряд.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт;
	Модель = ЗаказНаряд.Автомобиль.Модель;
	
	Марка = Модель.Марка;
	ЭтоУАЗ = Марка = Справочники.Марка.UAZ; 
	ЭтоФорд = Марка = Справочники.Марка.FORD;
	ЭтоGeely = Марка = Справочники.Марка.GEELY Или Марка = Справочники.Марка.BELGEE;
	ЭтоФиат = Марка = Справочники.Марка.FIAT;
	ЭтоДжип = Марка = Справочники.Марка.JEEP;
	ЭтоExeed = Марка = Справочники.Марка.EXEED;
	
	ЭтоКорандоГамма = ЗаказНаряд.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000174"); // Корандо Шахты ООО Гамма
	ЭтоРентаКарАвтолига = ЗаказНаряд.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000121"); // Рента Кар ООО Автолига
	ЭтоГаммаМоторсШахты = ЗаказНаряд.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001292"); // Гамма Моторс ООО Шахты Джили
	ЭтоГаммаМоторсРостов = ЗаказНаряд.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001300"); // Гамма Моторс ООО Шолохова Джили
	ЭтоАтлантГамма = ЗаказНаряд.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000032"); // Атлант Моторс ООО Гамма
	ЭтоАтлантПойменная = ЗаказНаряд.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000235"); // Атлант Моторс ООО Пойменная
	
	Если ЭтоФорд И ЭтоРентаКарАвтолига Тогда
		Если Модель.Код = "ЦБ00005706" Тогда // FORD ГЕРМЕС
			Возврат;
		КонецЕсли;
		УзелОбмена = ПланыОбмена.ОбменСАвтодилер.НайтиПоКоду("РентаКарФордППО");
		
	ИначеЕсли ЭтоФиат И ЭтоАтлантГамма Тогда
		УзелОбмена = ПланыОбмена.ОбменСАвтодилер.НайтиПоКоду("АтлантФиатППО");
		
	ИначеЕсли ЭтоДжип И ЭтоАтлантГамма Тогда
		УзелОбмена = ПланыОбмена.ОбменСАвтодилер.НайтиПоКоду("АтлантДжипППО");
		
	ИначеЕсли ЭтоExeed И ЭтоАтлантПойменная Тогда
		УзелОбмена = ПланыОбмена.ОбменСАвтодилер.НайтиПоКоду("ПойменнаяЭксидППО");
		
	ИначеЕсли ЭтоУАЗ И ЭтоКорандоГамма Тогда
		УзелОбмена = ПланыОбмена.ОбменСАвтодилер.НайтиПоКоду("КорандоУАЗППО");
		
	ИначеЕсли ЗаказНарядЗакрыт И ЭтоGeely И ЭтоГаммаМоторсШахты Тогда
		УзелОбмена = ПланыОбмена.ОбменСАвтодилер.НайтиПоКоду("ГаммаШахтыДжилиППО");
		
	ИначеЕсли ЗаказНарядЗакрыт И ЭтоGeely И ЭтоГаммаМоторсРостов Тогда
		УзелОбмена = ПланыОбмена.ОбменСАвтодилер.НайтиПоКоду("ГаммаРостовДжилиППО");
		
	Иначе
		Возврат;
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(УзелОбмена) Тогда	
		Возврат;
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(ЗаказНаряд.Диспетчер) Тогда
		#Если Клиент Тогда
		Сообщить("В заказ-наряде не указан мастер-приёмщик. Выгрузка на портал Автодилер невозможна!!!", СтатусСообщения.Внимание);
		#КонецЕсли
		Возврат;
	КонецЕсли;
	
	мзИдентификаторыDSF = РегистрыСведений.УАЗDSFИдентификаторы.СоздатьМенеджерЗаписи();
	мзИдентификаторыDSF.ОбъектАльфаАвто = Модель;
	мзИдентификаторыDSF.Прочитать();
	Если Не мзИдентификаторыDSF.Выбран() Тогда
		#Если Клиент Тогда
		Сообщить("С порталом Автодилер не синхронизирована модель " + Модель
		+ ". Выгрузка заказ-наряда на портал Автодилер невозможна!!!", СтатусСообщения.Внимание);
		#КонецЕсли
		Возврат;
	КонецЕсли;
	
	ВидРемонта = ЗаказНаряд.ВидРемонта;
	Если ВидРемонта.Код = "00000142" Тогда // Приобретение авто с пробегом
		Возврат;
	КонецЕсли;
	
	мзИдентификаторыDNM = РегистрыСведений.УАЗDNMИдентификаторы.СоздатьМенеджерЗаписи();
	мзИдентификаторыDNM.ВидРемонта = ВидРемонта;
	мзИдентификаторыDNM.Прочитать();
	Если Не мзИдентификаторыDNM.Выбран() Тогда		
		#Если Клиент Тогда
		Сообщить("Заказ-наряды с видом ремонта "
		+ ВидРемонта + " на портал Автодилер не выгружаются.", СтатусСообщения.Информация);
		#КонецЕсли
		Возврат;
	КонецЕсли;
	
	ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, ЗаказНаряд);		
КонецПроцедуры


//// Общие процедуры / функции для выгрузки данных на портал Автохаб
/////////////////////////////////////////////////////////////////////

Функция ТелефонЦифрами(Объект)
	НаборЗаписейКИ = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	НаборЗаписейКИ.Отбор.Объект.Значение = Объект;
	НаборЗаписейКИ.Отбор.Объект.Использование = Истина;
	НаборЗаписейКИ.Отбор.Тип.Значение = Перечисления.ТипыКонтактнойИнформации.Телефон;
	НаборЗаписейКИ.Отбор.Тип.Использование = Истина;
	НаборЗаписейКИ.Прочитать();
	Представление = "";
	СтруктураТелефон = Новый Структура();
	СтруктураТелефон.Вставить("Представление", Представление);
	СтруктураТелефон.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонСотовый);
	
	Для каждого Запись Из НаборЗаписейКИ Цикл
		Если ПустаяСтрока(Запись.Поле1) Тогда
			Представление = Запись.Поле2 + Запись.Поле3;
		Иначе
			Представление = Запись.Поле1 + Запись.Поле2 + Запись.Поле3;
			Представление = Сред(Представление, 2);
		КонецЕсли;
		Если обЗначениеНеЗаполнено(Представление) Тогда
			Представление = Запись.Представление;
		КонецЕсли;
		
		ТелефонТолькоЦифры = "";
		СимволовВПредставлении = СтрДлина(Представление);
		Если СимволовВПредставлении > 0 Тогда
			Для сч = 1 По СимволовВПредставлении Цикл
				СимволИзНомера = Сред(Представление, сч, 1);
				Если СтрНайти("1234567890", СимволИзНомера) > 0 Тогда
					ТелефонТолькоЦифры = ТелефонТолькоЦифры + СимволИзНомера;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
			
		СтруктураТелефон.Вставить("Представление", ТелефонТолькоЦифры);
		СтруктураТелефон.Вставить("Вид", Запись.Вид);
		
		Если Запись.ЗначениеПоУмолчанию Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат СтруктураТелефон;
КонецФункции

Функция ЭлПочтаКорректна(ЭлПочта)
	Если Не ЗначениеЗаполнено(ЭлПочта) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Найти(ЭлПочта, " ") > 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДлинаАдреса = СтрДлина(ЭлПочта);
	Если ДлинаАдреса < 6 Тогда
		Возврат Ложь;
	КонецЕсли;	
	ЭлПочтаНР = НРег(ЭлПочта);
	Для сч = 1 По ДлинаАдреса Цикл
		СимволИзАдреса = Сред(ЭлПочтаНР, сч, 1);
		Если СтрНайти("абвгдеёжзийклмнопрстуфхцчшщъыьэюя", СимволИзАдреса) > 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Позиция1 = Найти(ЭлПочта, "@");
	Если Позиция1 < 2 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Позиция2 = Найти(Сред(ЭлПочта, Позиция1), ".");
	Возврат Позиция2 > 2;
КонецФункции

Функция ПолучитьСоединениеHTTP(УзелОбмена)
	Таймаут = 120;
	SSL = Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows(), Новый СертификатыУдостоверяющихЦентровWindows());
	Возврат Новый HTTPСоединение(УзелОбмена.Хост, , , , , Таймаут, SSL);
КонецФункции

Функция ПолучитьЗапросHTTP(УзелОбмена)
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Type", "application/json; charset=utf-8");
	ЗаголовкиHTTP.Вставить("Accept", "application/json");
	ЗаголовкиHTTP.Вставить("Connection", "Keep-Alive");
	ЗаголовкиHTTP.Вставить("Authorization", "Basic " + УзелОбмена.Токен);
	
	ЗапросHTTP = Новый HTTPЗапрос();
	ЗапросHTTP.Заголовки = ЗаголовкиHTTP;
	Возврат ЗапросHTTP;
КонецФункции

Функция ПолучитьИдентификатор(Объект)
	Если ТипЗнч(Объект) = Тип("Массив") Тогда
		Если Объект.Количество() > 0 Тогда
			стОбъект = Объект[0];		
		Иначе
			Возврат 0;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Объект) = Тип("Структура") Тогда
		стОбъект = Объект;
		
	Иначе
		Возврат 0;
	КонецЕсли;
	
	Если ТипЗнч(стОбъект) = Тип("Структура") И стОбъект.Свойство("id") Тогда
		Возврат стОбъект.id;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

Функция ОбновитьОбъект(УзелОбмена, АдресРесурса, ТелоЗапроса)	
	НТТР = ПолучитьСоединениеHTTP(УзелОбмена);
	ЗапросHTTP = ПолучитьЗапросHTTP(УзелОбмена);
	
	ЗапросHTTP.АдресРесурса = АдресРесурса;
	ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
	НТТРОтвет = НТТР.Записать(ЗапросHTTP);
	ТелоОтвета = НТТРОтвет.ПолучитьТелоКакСтроку(КодировкаТекста.Системная);
	
	Если НТТРОтвет.КодСостояния >= 300 Тогда
		#Если Клиент Тогда
		Сообщить("Обновление объекта Автохаб " + АдресРесурса + ":" + Символы.ПС 
		+ "Код состояния: " + НТТРОтвет.КодСостояния  + Символы.ПС 
		+ "Тело ответа: " + json_decode(ТелоОтвета), СтатусСообщения.Важное);
		#КонецЕсли
	КонецЕсли;
	
	Возврат НТТРОтвет.КодСостояния;	
КонецФункции

Функция ВыгрузитьОбъект(УзелОбмена, АдресРесурса, ТелоЗапроса, СтрокаОбъект)
	НТТР = ПолучитьСоединениеHTTP(УзелОбмена);
	ЗапросHTTP = ПолучитьЗапросHTTP(УзелОбмена);
	
	ЗапросHTTP.АдресРесурса = АдресРесурса;
	ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);		
	НТТРОтвет = НТТР.ОтправитьДляОбработки(ЗапросHTTP);
	
	ТелоОтвета = НТТРОтвет.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
	Попытка
		стОтвет = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		#Если Клиент Тогда
		Сообщить("Выгрузка в Автохаб объекта " + СтрокаОбъект + ":" + Символы.ПС 
		+ "Ошибка чтения json!", СтатусСообщения.Важное);
		#КонецЕсли
		Возврат Неопределено;
	КонецПопытки;

	Если ТипЗнч(стОтвет) <> Тип("Структура") Или Не стОтвет.Свойство("status") Тогда
		#Если Клиент Тогда
		Сообщить("Выгрузка в Автохаб объекта " + СтрокаОбъект + ":" + Символы.ПС 
		+ "Неверный тип json в теле ответа!", СтатусСообщения.Важное);
		#КонецЕсли
		Возврат Неопределено;
	КонецЕсли;
	
	Если стОтвет.status = "error" Тогда
		#Если Клиент Тогда	
		Сообщить("ОШИБКА при выгрузке в Автохаб объекта " + СтрокаОбъект + ":" + Символы.ПС 
		+ "Код состояния: " + НТТРОтвет.КодСостояния  + Символы.ПС 
		+ "Тело ответа: " + json_decode(ТелоОтвета), СтатусСообщения.Важное);
		#КонецЕсли
	КонецЕсли;
	
	Возврат стОтвет;
КонецФункции

Функция ВИерархии(Элемент, Группа)
	Если ТипЗнч(Группа) <> ТипЗнч(Элемент) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Группа = Элемент Или Элемент.ПринадлежитЭлементу(Группа);
КонецФункции

Функция СтоимостьПредпродажнойПодготовки(мзОбъявление)
	Если обЗначениеНеЗаполнено(мзОбъявление.Поступление) Тогда
		Возврат 0;
	КонецЕсли;
	
	ЗапросСтоимостьПП = Новый Запрос();
	ЗапросСтоимостьПП.УстановитьПараметр("Автомобиль", мзОбъявление.Автомобиль);
	ЗапросСтоимостьПП.УстановитьПараметр("Закрыт", Справочники.ВидыСостоянийЗаказНарядов.Закрыт);
	ЗапросСтоимостьПП.УстановитьПараметр("ДатаПоступления", мзОбъявление.Поступление.Дата);
	мРемонтыПрП = Новый Массив();
	мРемонтыПрП.Добавить(Справочники.ВидыРемонта.РемонтБуАвтомобиля);
	мРемонтыПрП.Добавить(Справочники.ВидыРемонта.ПредпродажнаяПодготовка);
	ЗапросСтоимостьПП.УстановитьПараметр("РемонтыПрП", мРемонтыПрП);
	ЗапросСтоимостьПП.Текст =
	"ВЫБРАТЬ
	|	СУММА(ЗаказНаряд.СуммаДокумента) КАК СтоимостьПрП
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|ГДЕ
	|	ЗаказНаряд.Автомобиль = &Автомобиль
	|	И ЗаказНаряд.Состояние = &Закрыт
	|	И ЗаказНаряд.ДатаЗакрытия > &ДатаПоступления
	|	И ЗаказНаряд.ВидРемонта В(&РемонтыПрП)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказНаряд.Автомобиль";
	
	РезультатЗапроса = ЗапросСтоимостьПП.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	Иначе
		ВыборкаСтоимостьПП = РезультатЗапроса.Выбрать();
		Если ВыборкаСтоимостьПП.Следующий() Тогда
			Возврат ВыборкаСтоимостьПП.СтоимостьПрП;
		Иначе
			Возврат 0;
		КонецЕсли;
	КонецЕсли;
КонецФункции

Функция json_decode(unicode_escape_sequence)
	ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(unicode_escape_sequence);
    стДанные = ПрочитатьJSON(ЧтениеJSON);
    ЧтениеJSON.Закрыть();

    ЗаписьJSON = Новый ЗаписьJSON;
    //ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	ЗаписьJSON.УстановитьСтроку();
    ЗаписатьJSON(ЗаписьJSON, стДанные);
    Возврат ЗаписьJSON.Закрыть();
КонецФункции

Функция ЭтоРабочаяБаза()
	СтрокаСоединения = НРег(СтрокаСоединенияИнформационнойБазы());
	Возврат Найти(СтрокаСоединения, "1cserver") > 0 И Найти(СтрокаСоединения, "alfaauto") > 0;
КонецФункции

//// Процедуры / функции для выгрузки данных по поступлению автомобиля:
//// принятие ТС на склад и вывод в продажу
///////////////////////////////////////////////////////////////////////

Функция ДанныеПоступления(СтрокаАвтомобиль)
	стЗапись = Новый Структура();
	стЗапись.Вставить("appraisalPurchaseCost", СтрокаАвтомобиль.СуммаВсего);
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	Попытка
		ЗаписатьJSON(ЗаписьJSON, стЗапись);
	Исключение
		Сообщить("Не удалось записать JSON-данные для принятия ТС на склад Автохаб!", СтатусСообщения.Внимание);
		Возврат "";
	КонецПопытки;
	
	ТелоЗапроса = ЗаписьJSON.Закрыть();
	Возврат ТелоЗапроса;
КонецФункции
	
Функция ВыгрузитьПоступление(ПоступлениеОбъект)
	Если ПоступлениеОбъект.Контрагент.НашаФирма Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ПоступлениеОбъект.ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилей
		Или ПоступлениеОбъект.ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилейКомиссия Тогда
		УзелОбмена = ПланыОбмена.ОбменСАвтохаб.НайтиПоКоду("ПубликацияСоколМоторс");
		
	Иначе
		Возврат Истина;
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(УзелОбмена) Тогда
		Возврат Истина;
	КонецЕсли;
	
	НеБылоОшибок = Истина;
	Для Каждого СтрокаАвто Из ПоступлениеОбъект.Автомобили Цикл
		Если Не СтрокаАвто.АвтомобильБУ Тогда
			Продолжить;
		КонецЕсли;
		
		мзОбъявление = РегистрыСведений.ОбъявленияНаАвтохаб.СоздатьМенеджерЗаписи();
		мзОбъявление.Автомобиль = СтрокаАвто.Автомобиль;
		мзОбъявление.Прочитать();
		Если Не мзОбъявление.Выбран() Тогда
			Продолжить;
		ИначеЕсли обЗначениеНеЗаполнено(мзОбъявление.appraisal_id) Тогда
			Продолжить;
		ИначеЕсли мзОбъявление.Поступление = ПоступлениеОбъект.Ссылка Тогда
			Продолжить;
		ИначеЕсли мзОбъявление.Поступление.Дата > ПоступлениеОбъект.Дата Тогда
			Продолжить;
		ИначеЕсли мзОбъявление.Реализация.Дата > ПоступлениеОбъект.Дата Тогда
			Продолжить;
		КонецЕсли;
		
		Если мзОбъявление.ОсмотрПроведен Тогда
			АдресРесурса = "/partners-api/appraisals/" + Формат(мзОбъявление.appraisal_id, "ЧГ=0,0") + "/accept";
			ТелоЗапроса = ДанныеПоступления(СтрокаАвто);
			Если ЗначениеЗаполнено(ТелоЗапроса) Тогда
				стРезультат = ВыгрузитьОбъект(УзелОбмена, АдресРесурса, ТелоЗапроса, Строка(ПоступлениеОбъект));
				Если стРезультат = Неопределено Тогда
					НеБылоОшибок = Ложь;
					Продолжить;
					
				ИначеЕсли стРезультат.status = "success" Тогда
					vehicle_id = стРезультат.data.vehicle.id;
					Если ЗначениеЗаполнено(vehicle_id) Тогда
						мзОбъявление.Поступление = ПоступлениеОбъект.Ссылка;
						мзОбъявление.vehicle_id = vehicle_id;
						мзОбъявление.Записать();
					КонецЕсли;
					
				ИначеЕсли стРезультат.status = "error" Тогда
					НеБылоОшибок = Ложь;
					Сообщить("Не удалось перевести автомобиль на склад в Автохаб: " + стРезультат.message, СтатусСообщения.Внимание);
				
				Иначе
					НеБылоОшибок = Ложь;
				КонецЕсли;
				
			Иначе
				НеБылоОшибок = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НеБылоОшибок;
КонецФункции

Процедура ПринятиеТСНаСклад(УзелОбмена)
  	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	ЗаписьСообщения.НачатьЗапись(Запись, УзелОбмена);
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(ЗаписьСообщения.Получатель, ЗаписьСообщения.НомерСообщения);
	Пока ВыборкаИзменений.Следующий() Цикл
	    ПоступлениеОбъект = ВыборкаИзменений.Получить();
		car_id = ВыгрузитьПоступление(ПоступлениеОбъект);
		Если car_id = -422 Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, ПоступлениеОбъект);
			Продолжить;
		ИначеЕсли car_id = 0 Тогда
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	НомерСообщения = ЗаписьСообщения.НомерСообщения;
	ЗаписьСообщения.ЗакончитьЗапись();
	СтрокаСообщения = Запись.Закрыть();		
КонецПроцедуры

//// Процедуры / функции для выгрузки данных по предпродажной подготовку (ПрП) автомобиля:
//// затраты на предпродажную подготовку автомобиля
///////////////////////////////////////////////////////////////////////

Функция ДанныеПоПрП(мзОбъявление)
	ЗатратыНаППП = СтоимостьПредпродажнойПодготовки(мзОбъявление);
	стЗапись = Новый Структура();
	стЗапись.Вставить("preSalePreparationCost", ЗатратыНаППП);
	стТелоЗапроса = Новый Структура();
	стТелоЗапроса.Вставить("vehicle", стЗапись);
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	Попытка
		ЗаписатьJSON(ЗаписьJSON, стТелоЗапроса);
	Исключение
		Сообщить("Не удалось записать JSON-данные для принятия ТС на склад Автохаб!", СтатусСообщения.Внимание);
		Возврат "";
	КонецПопытки;
	
	ТелоЗапроса = ЗаписьJSON.Закрыть();
	Возврат ТелоЗапроса;
КонецФункции
	
Функция ВыгрузитьЗатратыПрП(ЗаказНарядОбъект)
	Если ЗаказНарядОбъект.ВидРемонта = Справочники.ВидыРемонта.РемонтБуАвтомобиля
		Или ЗаказНарядОбъект.ВидРемонта = Справочники.ВидыРемонта.ПредпродажнаяПодготовка Тогда
		УзелОбмена = ПланыОбмена.ОбменСАвтохаб.НайтиПоКоду("ЗатратыПрПСоколМоторс");
		
	Иначе
		Возврат Истина;
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(УзелОбмена) Тогда
		Возврат Истина;
	КонецЕсли;
	
	НеБылоОшибок = Истина;
	мзОбъявление = РегистрыСведений.ОбъявленияНаАвтохаб.СоздатьМенеджерЗаписи();
	мзОбъявление.Автомобиль = ЗаказНарядОбъект.Автомобиль;
	мзОбъявление.Прочитать();
	Если Не мзОбъявление.Выбран() Тогда
		Возврат Истина;
	ИначеЕсли обЗначениеНеЗаполнено(мзОбъявление.vehicle_id) Тогда
		Возврат Истина;
	КонецЕсли;
	
	АдресРесурса = "/partners-api/vehicles/" + Формат(мзОбъявление.vehicle_id, "ЧГ=0,0");
	ТелоЗапроса = ДанныеПоПрП(мзОбъявление);
	Если ЗначениеЗаполнено(ТелоЗапроса) Тогда
		КодСостояния = ОбновитьОбъект(УзелОбмена, АдресРесурса, ТелоЗапроса);
		Если КодСостояния >= 300 Тогда
			НеБылоОшибок = Ложь;
		КонецЕсли;
		
	Иначе
		НеБылоОшибок = Ложь;
	КонецЕсли;
	
	Возврат НеБылоОшибок;
КонецФункции

Процедура ПредпродажнаяПодготовкаТС(УзелОбмена)
  	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	ЗаписьСообщения.НачатьЗапись(Запись, УзелОбмена);
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(ЗаписьСообщения.Получатель, ЗаписьСообщения.НомерСообщения);
	Пока ВыборкаИзменений.Следующий() Цикл
	    ПоступлениеОбъект = ВыборкаИзменений.Получить();
		car_id = ВыгрузитьЗатратыПрП(ПоступлениеОбъект);
		Если car_id = -422 Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, ПоступлениеОбъект);
			Продолжить;
		ИначеЕсли car_id = 0 Тогда
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	НомерСообщения = ЗаписьСообщения.НомерСообщения;
	ЗаписьСообщения.ЗакончитьЗапись();
	СтрокаСообщения = Запись.Закрыть();		
КонецПроцедуры

//// Процедуры / функции для выгрузки данных по перемещению автомобиля:
//// смена кабинета дилера (локации) в Автохаб
///////////////////////////////////////////////////////////////////////

Функция ДанныеПеремещения(СтрокаАвтомобиль, НомерКабинетаПолучателя)
	стТело = Новый Структура();
	стТело.Вставить("reason", "moved");
	стДилер = Новый Структура();
	стДилер.Вставить("id", НомерКабинетаПолучателя);
	стТело.Вставить("copyDealer", стДилер);
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	Попытка
		ЗаписатьJSON(ЗаписьJSON, стТело);
	Исключение
		Сообщить("Не удалось записать JSON-данные для принятия ТС на склад Автохаб!", СтатусСообщения.Внимание);
		Возврат "";
	КонецПопытки;
	
	ТелоЗапроса = ЗаписьJSON.Закрыть();
	Возврат ТелоЗапроса;
КонецФункции
	
Функция ВыгрузитьПеремещение(ПеремещениеОбъект)
	Если ПеремещениеОбъект.ХозОперация = Справочники.ХозОперации.ПеремещениеАвтомобилей Тогда
		УзелОбмена = ПланыОбмена.ОбменСАвтохаб.НайтиПоКоду("ПеремещениеСоколМоторс");
		
	Иначе
		Возврат Истина;
	КонецЕсли;
	Если обЗначениеНеЗаполнено(УзелОбмена) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ПодразделениеОтправитель = ПеремещениеОбъект.ПодразделениеКомпании;
	ПодразделениеРодитель = ПодразделениеОтправитель.Родитель;
	Если ПодразделениеРодитель = Справочники.ПодразделенияКомпании.ОсновноеПодразделение Тогда
		НомерКабинетаОтправителя = ПодразделениеОтправитель.НомерКабинетаАвтохаб;
	Иначе
		НомерКабинетаОтправителя = ПодразделениеРодитель.НомерКабинетаАвтохаб;
	КонецЕсли;
	
	ПодразделениеПолучатель = ПеремещениеОбъект.СкладПолучатель.Подразделение;
	ПодразделениеРодитель = ПодразделениеПолучатель.Родитель;
	Если ПодразделениеРодитель = Справочники.ПодразделенияКомпании.ОсновноеПодразделение Тогда
		НомерКабинетаПолучателя = ПодразделениеПолучатель.НомерКабинетаАвтохаб;
	Иначе
		НомерКабинетаПолучателя = ПодразделениеРодитель.НомерКабинетаАвтохаб;
	КонецЕсли;
	Если НомерКабинетаПолучателя = 0 Тогда
		Возврат Истина;
	ИначеЕсли НомерКабинетаПолучателя = НомерКабинетаОтправителя Тогда
		Возврат Истина;
	КонецЕсли;
	
	НеБылоОшибок = Истина;
	Для Каждого СтрокаАвто Из ПеремещениеОбъект.Автомобили Цикл
		ВидАвтомобиля = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения
		(СтрокаАвто.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля);
		Если обЗначениеНеЗаполнено(ВидАвтомобиля) Тогда
			Продолжить;
		КонецЕсли;
		Если Не (ВидАвтомобиля = Перечисления.ВидАвтомобиля.АвтомобильСПробегом 
			Или ВидАвтомобиля = Перечисления.ВидАвтомобиля.ТестовыйАвтомобиль
			Или ВидАвтомобиля = Перечисления.ВидАвтомобиля.ПодменныйАвтомобиль) Тогда
			Продолжить;
		КонецЕсли;
		
		мзОбъявление = РегистрыСведений.ОбъявленияНаАвтохаб.СоздатьМенеджерЗаписи();
		мзОбъявление.Автомобиль = СтрокаАвто.Автомобиль;
		мзОбъявление.Прочитать();
		Если Не мзОбъявление.Выбран() Тогда
			Продолжить;
			
		ИначеЕсли обЗначениеНеЗаполнено(мзОбъявление.vehicle_id) Тогда
			Продолжить;
			
		ИначеЕсли мзОбъявление.Перемещение = ПеремещениеОбъект.Ссылка Тогда
			Продолжить;
			
		ИначеЕсли мзОбъявление.Перемещение.Дата > ПеремещениеОбъект.Дата Тогда
			Продолжить;
		КонецЕсли;
		
		АдресРесурса = "/partners-api/vehicles/" + Формат(мзОбъявление.vehicle_id, "ЧГ=0,0") + "/close";
		ТелоЗапроса = ДанныеПеремещения(СтрокаАвто, НомерКабинетаПолучателя);
		Если ЗначениеЗаполнено(ТелоЗапроса) Тогда
			стРезультат = ВыгрузитьОбъект(УзелОбмена, АдресРесурса, ТелоЗапроса, Строка(ПеремещениеОбъект));
			Если стРезультат = Неопределено Тогда
				НеБылоОшибок = Ложь;
				Продолжить;
				
			ИначеЕсли стРезультат.status = "success" Тогда
				vehicle_id = стРезультат.data.copiedToVehicle.id;
				Если ЗначениеЗаполнено(vehicle_id) И мзОбъявление.vehicle_id <> vehicle_id Тогда
					мзОбъявление.Перемещение = ПеремещениеОбъект.Ссылка;
					мзОбъявление.vehicle_id = vehicle_id;
					мзОбъявление.Записать();
				КонецЕсли;
			Иначе
				НеБылоОшибок = Ложь;
			КонецЕсли;
			
		Иначе
			НеБылоОшибок = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НеБылоОшибок;
КонецФункции

Процедура СменаКабинетаДилера(УзелОбмена)
  	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	ЗаписьСообщения.НачатьЗапись(Запись, УзелОбмена);
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(ЗаписьСообщения.Получатель, ЗаписьСообщения.НомерСообщения);
	Пока ВыборкаИзменений.Следующий() Цикл
	    ПеремещениеОбъект = ВыборкаИзменений.Получить();
		car_id = ВыгрузитьПеремещение(ПеремещениеОбъект);
		Если car_id = -422 Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, ПеремещениеОбъект);
			Продолжить;
		ИначеЕсли car_id = 0 Тогда
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	НомерСообщения = ЗаписьСообщения.НомерСообщения;
	ЗаписьСообщения.ЗакончитьЗапись();
	СтрокаСообщения = Запись.Закрыть();		
КонецПроцедуры

//// Процедуры / функции для выгрузки данных по продаже автомобиля:
//// завершить объявление (поместить в архив)
/////////////////////////////////////////////////////////////////////

Функция ДанныеРеализации(СтрокаАвтомобиль, ДатаСтрокой, СкидкаДополнительная)
	стТело = Новый Структура();
	стТело.Вставить("reason", "sold");
	стТело.Вставить("salePrice", СтрокаАвтомобиль.СуммаВсего + СкидкаДополнительная);
	стТело.Вставить("completionDate", ДатаСтрокой);
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	Попытка
		ЗаписатьJSON(ЗаписьJSON, стТело);
	Исключение
		Сообщить("Не удалось записать JSON-данные для принятия ТС на склад Автохаб!", СтатусСообщения.Внимание);
		Возврат "";
	КонецПопытки;
	
	ТелоЗапроса = ЗаписьJSON.Закрыть();
	Возврат ТелоЗапроса;
КонецФункции
	
Функция ВыгрузитьРеализацию(РеализацияОбъект)
	Если РеализацияОбъект.Контрагент.НашаФирма Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если РеализацияОбъект.ХозОперация = Справочники.ХозОперации.РеализацияАвтомобилей Тогда
		УзелОбмена = ПланыОбмена.ОбменСАвтохаб.НайтиПоКоду("РеализацияСоколМоторс");
		
	Иначе
		Возврат Истина;
	КонецЕсли;
	Если обЗначениеНеЗаполнено(УзелОбмена) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ДатаСтрокой = Формат(РеализацияОбъект.Дата, "ДФ=""гггг-ММ-дд""");
	
	НеБылоОшибок = Истина;
	Для Каждого СтрокаАвто Из РеализацияОбъект.Автомобили Цикл
		ВидАвтомобиля = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения
		(СтрокаАвто.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля);
		Если обЗначениеНеЗаполнено(ВидАвтомобиля) Тогда
			Продолжить;
		КонецЕсли;
		Если Не (ВидАвтомобиля = Перечисления.ВидАвтомобиля.АвтомобильСПробегом 
			Или ВидАвтомобиля = Перечисления.ВидАвтомобиля.ТестовыйАвтомобиль
			Или ВидАвтомобиля = Перечисления.ВидАвтомобиля.ПодменныйАвтомобиль) Тогда
			Продолжить;
		КонецЕсли;
		
		мзОбъявление = РегистрыСведений.ОбъявленияНаАвтохаб.СоздатьМенеджерЗаписи();
		мзОбъявление.Автомобиль = СтрокаАвто.Автомобиль;
		мзОбъявление.Прочитать();
		Если Не мзОбъявление.Выбран() Тогда
			Продолжить;
			
		ИначеЕсли обЗначениеНеЗаполнено(мзОбъявление.vehicle_id) Тогда
			Продолжить;
			
		ИначеЕсли мзОбъявление.Реализация = РеализацияОбъект.Ссылка Тогда
			Продолжить;
			
		ИначеЕсли мзОбъявление.Реализация.Дата > РеализацияОбъект.Дата Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаказСсылка = РеализацияОбъект.ДокументОснование;
		Если ЗначениеЗаполнено(ЗаказСсылка) И ТипЗнч(ЗаказСсылка) = Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
			РабочийЛистСсылка = ЗаказСсылка.ДокументОснование;
			Если ЗначениеЗаполнено(РабочийЛистСсылка) И ТипЗнч(РабочийЛистСсылка) = Тип("ДокументСсылка.РабочийЛист") Тогда
				СкидкаДополнительная = РабочийЛистСсылка.СкидкаДополнительная;
			Иначе
				СкидкаДополнительная = 0;
			КонецЕсли;
			
		Иначе
			СкидкаДополнительная = 0;
		КонецЕсли;
		
		АдресРесурса = "/partners-api/vehicles/" + Формат(мзОбъявление.vehicle_id, "ЧГ=0,0") + "/close";
		ТелоЗапроса = ДанныеРеализации(СтрокаАвто, ДатаСтрокой, СкидкаДополнительная);
		Если ЗначениеЗаполнено(ТелоЗапроса) Тогда
			стРезультат = ВыгрузитьОбъект(УзелОбмена, АдресРесурса, ТелоЗапроса, Строка(РеализацияОбъект));
			Если стРезультат = Неопределено Тогда
				НеБылоОшибок = Ложь;
				Продолжить;
				
			ИначеЕсли стРезультат.status = "success" Тогда
				мзОбъявление.Реализация = РеализацияОбъект.Ссылка;
				мзОбъявление.Записать();
			Иначе
				НеБылоОшибок = Ложь;
			КонецЕсли;
			
		Иначе
			НеБылоОшибок = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НеБылоОшибок;
КонецФункции

Процедура ПереводОбъявленияВАрхив(УзелОбмена)
  	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	ЗаписьСообщения.НачатьЗапись(Запись, УзелОбмена);
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(ЗаписьСообщения.Получатель, ЗаписьСообщения.НомерСообщения);
	Пока ВыборкаИзменений.Следующий() Цикл
	    ПеремещениеОбъект = ВыборкаИзменений.Получить();
		car_id = ВыгрузитьПеремещение(ПеремещениеОбъект);
		Если car_id = -422 Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, ПеремещениеОбъект);
			Продолжить;
		ИначеЕсли car_id = 0 Тогда
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	НомерСообщения = ЗаписьСообщения.НомерСообщения;
	ЗаписьСообщения.ЗакончитьЗапись();
	СтрокаСообщения = Запись.Закрыть();		
КонецПроцедуры

//// Интерфейсные функции
/////////////////////////////////////////////////////////////////////

Функция ВыгрузитьВАвтохаб(ДокументОбъект) Экспорт
	Если Не ЭтоРабочаяБаза() Тогда
		Возврат Истина;
	КонецЕсли;

	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПоступлениеАвтомобилей") Тогда
		Возврат ВыгрузитьПоступление(ДокументОбъект);
		
	ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ЗаказНаряд") Тогда
		Возврат ВыгрузитьЗатратыПрП(ДокументОбъект);
		
	ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПеремещениеАвтомобилей") Тогда
		Возврат ВыгрузитьПеремещение(ДокументОбъект);
		
	ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РеализацияАвтомобилей") Тогда
		Возврат ВыгрузитьРеализацию(ДокументОбъект);
		
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

Функция ПолучитьРРЦ(VIN) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСАвтохаб.НайтиПоКоду("РеализацияСоколМоторс");
	НТТР = ПолучитьСоединениеHTTP(УзелОбмена);
	ЗапросHTTP = ПолучитьЗапросHTTP(УзелОбмена);	
	ЗапросHTTP.АдресРесурса = "/partners-api/vehicles/active";
	
	стОтвет = Новый Структура("status, message, price");
	стЗапрос = Новый Структура();
	стЗапрос.Вставить("limit", 10);
	
	мФильтры = Новый Массив();
	стФильтр = Новый Структура();
	стФильтр.Вставить("fields", "vin");
	стФильтр.Вставить("type", "equal");
	мЗначения = Новый Массив();
	мЗначения.Добавить(VIN);
	стФильтр.Вставить("value", мЗначения);
	мФильтры.Добавить(стФильтр);
	стЗапрос.Вставить("filters", мФильтры);
	
	мЗначенияПорядок = Новый Массив();
	мЗначенияПорядок.Добавить("-id");
	стЗапрос.Вставить("orders", мЗначенияПорядок);
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	Попытка
		ЗаписатьJSON(ЗаписьJSON, стЗапрос);
	Исключение
		стОтвет.status = "error";
		стОтвет.message = "Не удалось создать json для запроса РРЦ на Автохаб!";
		Возврат стОтвет;
	КонецПопытки;
	
	ТелоЗапроса = ЗаписьJSON.Закрыть();
	ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);		
	НТТРОтвет = НТТР.ОтправитьДляОбработки(ЗапросHTTP);
	
	ТелоОтвета = НТТРОтвет.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
	
	Попытка
		стОтветСервера = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		стОтвет.status = "error";
		стОтвет.message = "Загрузка РРЦ с Автохаб для VIN = " + VIN + ": ОШИБКА чтения json!";
		Возврат стОтвет;
	КонецПопытки;

	Если ТипЗнч(стОтветСервера) <> Тип("Структура") Или Не стОтветСервера.Свойство("status") Тогда
		стОтвет.status = "error";
		стОтвет.message = "Загрузка РРЦ с Автохаб для VIN = " + VIN + ": неверная структура json в теле ответа сервера!";
		Возврат стОтвет;
	КонецЕсли;
	
	Если стОтветСервера.status = "error" Тогда
		стОтвет.status = "error";
		стОтвет.message = "Загрузка РРЦ с Автохаб для VIN = " + VIN + ", ответ сервера: " + стОтветСервера.message;
		Возврат стОтвет;
	КонецЕсли;
	
	Если Не стОтветСервера.Свойство("data") Или Не стОтветСервера.data.Свойство("vehicles") Тогда
		стОтвет.status = "error";
		стОтвет.message = "Загрузка РРЦ с Автохаб для VIN = " + VIN + ": данные отсутствуют в теле ответа сервера!";
		Возврат стОтвет;
	КонецЕсли;
	
	мДанныеАвто = стОтветСервера.data.vehicles;
	Если ТипЗнч(мДанныеАвто) <> Тип("Массив") Или мДанныеАвто.Количество() = 0 Тогда
		стОтвет.status = "error";
		стОтвет.message = "Загрузка РРЦ с Автохаб для VIN = " + VIN + ": автомобиль отсутствует на складе.";
		Возврат стОтвет;
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(мДанныеАвто[0].price) Тогда
		стОтвет.status = "error";
		стОтвет.message = "Загрузка РРЦ с Автохаб для VIN = " + VIN + ": цена продажи не указана!";
	Иначе
		стОтвет.status = "success";
		стОтвет.price = мДанныеАвто[0].price;
	КонецЕсли;
	
	Возврат стОтвет;
КонецФункции

//// Загрузка объявлений классифайдов (пока только Авито)
/////////////////////////////////////////////////////////////////////

Процедура ЗагрузитьОбъявленияКлассифайдов(Параметры = Неопределено) Экспорт
	УзелОбмена = ПланыОбмена.ОбменСАвтохаб.НайтиПоКоду("ПубликацияСоколМоторс");
	Если обЗначениеНеЗаполнено(УзелОбмена) Тогда
		Сообщить("Не удалось найти Узел обмена <ПубликацияСоколМоторс>!", СтатусСообщения.Внимание);
		Возврат;
	Иначе
		АдресРесурса = "/partners-api/buyout/actual-market";
	КонецЕсли;
	
	стТелоЗапроса = Новый Структура();
	стТелоЗапроса.Вставить("limit", 100);
	Смещение = 0;
	стТелоЗапроса.Вставить("offset", Смещение);
	стТелоЗапроса.Вставить("orders", "+saleStartedAt");

	стФильтры = Новый Структура();
	ДатаНачала = ТекущаяДата() - 3600;
	//ДатаНачала = ТекущаяДата() - 43200; //// УБРАТЬ !!!!!
	стФильтры.Вставить("minSaleStartedAt", Формат(ДатаНачала, "ДФ=""гггг-ММ-ддTЧЧ:мм:сс"""));
	
	стГеоФильтр = Новый Структура();
	стГеоФильтр.Вставить("geoType", "region");
	мЗначения = Новый Массив();
	мЗначения.Добавить(62);
	стГеоФильтр.Вставить("regions", мЗначения);
	стФильтры.Вставить("geoFilter", стГеоФильтр);
	
	мЗначения = Новый Массив();
	мЗначения.Добавить("avito");
	стФильтры.Вставить("publishedOnSites", мЗначения);
	
	стФильтры.Вставить("sellerType", "PRIVATE");
	стФильтры.Вставить("ownerCountTo", 7);
	стФильтры.Вставить("rubPriceTo", 3200000);
	стФильтры.Вставить("rubPriceFrom", 500000);
	стФильтры.Вставить("steeringWheel", "left");
	стФильтры.Вставить("isBroken", Ложь);
	стТелоЗапроса.Вставить("actualMarketFilter", стФильтры);
	
	КоличествоОбъявлений = ЗагрузитьОбъявления(УзелОбмена, АдресРесурса, стТелоЗапроса);
	Если КоличествоОбъявлений < 100 Тогда
		Возврат;
	КонецЕсли;
	
	НомерЗапроса = 1;
	Пока КоличествоОбъявлений = 100 Цикл
		НомерЗапроса = НомерЗапроса + 1;
		Смещение = Смещение + 100;
		стТелоЗапроса.offset = Смещение;
		КоличествоОбъявлений = ЗагрузитьОбъявления(УзелОбмена, АдресРесурса, стТелоЗапроса);
		//ЭлементыФормы.тСтатус.Заголовок = "Запрос " + НомерЗапроса + ", автомобилей: " + ТаблицаАвтомобилей.Количество();
	КонецЦикла;
КонецПроцедуры

Функция ЗагрузитьОбъявления(УзелОбмена, АдресРесурса, стТелоЗапроса)
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	Попытка
		ЗаписатьJSON(ЗаписьJSON, стТелоЗапроса);
	Исключение
		Сообщить("Не удалось записать JSON-данные для тела запроса на Автохаб!", СтатусСообщения.Внимание);
		Возврат 0;
	КонецПопытки;
	ТелоЗапроса = ЗаписьJSON.Закрыть();
	
	Если ЗначениеЗаполнено(ТелоЗапроса) Тогда
		стРезультат = ВыгрузитьОбъект(УзелОбмена, АдресРесурса, ТелоЗапроса, "Список объявлений классифайдов");
		Если стРезультат = Неопределено Тогда
			Сообщить("Некорректный ответ портала Автохаб!", СтатусСообщения.Внимание);
			Возврат 0;
			
		ИначеЕсли стРезультат.status = "success" Тогда
			мОбъявления = стРезультат.data.sales;
			Если ТипЗнч(мОбъявления) <> Тип("Массив") Или мОбъявления.Количество() = 0 Тогда
				Сообщить("На портале Автохаб нет подходящих объявлений!", СтатусСообщения.Внимание);
				Возврат 0;
			КонецЕсли;
	
		Иначе
			Возврат 0;
		КонецЕсли;
		
	Иначе
		Сообщить("Пустое тело запроса на Автохаб!", СтатусСообщения.Внимание);
		Возврат 0;
	КонецЕсли;
	
	ствТипПродавца = Новый Соответствие();
	ствТипПродавца.Вставить("PRIVATE", "Частник");
	ствТипПродавца.Вставить("COMMERCIAL", "Салон");
	ствТипПродавца.Вставить("RESELLER", "Перекуп");
	
	ствТипКузова = Новый Соответствие();
	ствТипКузова.Вставить("cabriolet", "Кабриолет");
	ствТипКузова.Вставить("coupe", "Купе");
	ствТипКузова.Вставить("hatchback", "Хэтчбек");
	ствТипКузова.Вставить("long", "Лимузин");
	ствТипКузова.Вставить("minivan", "Минивэн");
	ствТипКузова.Вставить("pickup", "Пикап");
	ствТипКузова.Вставить("roadster", "Родстер");
	ствТипКузова.Вставить("sedan", "Седан");
	ствТипКузова.Вставить("suv", "Внедорожник");
	ствТипКузова.Вставить("van", "Фургон");
	ствТипКузова.Вставить("universal", "Универсал");
	ствТипКузова.Вставить("minibus", "Микроавтобус");
	ствТипКузова.Вставить("cargo_van", "Промтоварный фургон");
	ствТипКузова.Вставить("isothermal", "Изотермический фургон");
	ствТипКузова.Вставить("compactvan", "Компактвэн");
	ствТипКузова.Вставить("fastback", "Фастбек");
	ствТипКузова.Вставить("liftback", "Лифтбек");
	ствТипКузова.Вставить("microvan", "Микровэн");
	ствТипКузова.Вставить("phaeton", "Фаэтон");
	ствТипКузова.Вставить("speedster", "Спидстер");
	ствТипКузова.Вставить("targa", "Тарга");
	
	ствТипТрансмиссии = Новый Соответствие();
	ствТипТрансмиссии.Вставить("automatic", "Автоматическая");
	ствТипТрансмиссии.Вставить("manual", "Ручная");
	ствТипТрансмиссии.Вставить("robotized", "Робот");
	ствТипТрансмиссии.Вставить("variator", "Вариатор");
	
	ствТипДВС = Новый Соответствие();
	ствТипДВС.Вставить("petrol", "Бензин");
	ствТипДВС.Вставить("diesel", "Дизель");
	ствТипДВС.Вставить("electric", "Электро");
	ствТипДВС.Вставить("hybrid", "Гибрид");
	ствТипДВС.Вставить("petrol_and_gas", "Бензин/Газ");
	
	Для Каждого стОбъявление Из мОбъявления Цикл
		//стАвито = Неопределено;
		//Если Не стОбъявление.Свойство("avito", стАвито) Или обЗначениеНеЗаполнено(стАвито)  Тогда
		//	Продолжить;
		//КонецЕсли;
		//Если стОбъявление.lastRubPrice > 3200000 Или стОбъявление.lastRubPrice < 500000 Тогда
		//	Продолжить;
		//КонецЕсли;
		//Если стОбъявление.ownerCount > 7 Тогда
		//	Продолжить;
		//КонецЕсли;
		
		мзНовоеОбъявление = РегистрыСведений.ОбъявленияКлассифайдов.СоздатьМенеджерЗаписи();
		мзНовоеОбъявление.IDОбъявления = стОбъявление.id;
		
		СтрокаДатаВремя = стОбъявление.saleStartedAt;
		СтрокаДатаВремя = Лев(СтрокаДатаВремя, 19);
		СтрокаДата = Лев(СтрокаДатаВремя, 10);
		СтрокаДата = СтрЗаменить(СтрокаДата, "-", "");
		СтрокаВремя = Прав(СтрокаДатаВремя, 8);
		СтрокаВремя = СтрЗаменить(СтрокаВремя, ":", "");
		СтрокаДатаВремя = СтрокаДата + СтрокаВремя;
		Попытка
			мзНовоеОбъявление.ДатаОбъявления = Дата(СтрокаДатаВремя);
		Исключение
			мзНовоеОбъявление.ДатаОбъявления = ТекущаяДата();
		КонецПопытки;
		
		мзНовоеОбъявление.Марка = стОбъявление.brand.name;
		мзНовоеОбъявление.Модель =  стОбъявление.model.name;
		мзНовоеОбъявление.ГодВыпуска = стОбъявление.year;
		мзНовоеОбъявление.Пробег = стОбъявление.kmDistance;
		мзНовоеОбъявление.Владельцев = стОбъявление.ownerCount;
		мзНовоеОбъявление.Руль = стОбъявление.steeringWheel;
		
		ТипПродавца = ствТипПродавца[стОбъявление.sellerType];
		Если ЗначениеЗаполнено(ТипПродавца) Тогда
			мзНовоеОбъявление.Продавец = ТипПродавца;
		Иначе
			мзНовоеОбъявление.Продавец = "Другое";
		КонецЕсли;
		
		ТипДВС = ствТипДВС[стОбъявление.engineType];
		Если ЗначениеЗаполнено(ТипДВС) Тогда
			мзНовоеОбъявление.ТипДВС = ТипДВС;
		Иначе
			мзНовоеОбъявление.ТипДВС = "Другое";
		КонецЕсли;
		
		ТипКузова = ствТипКузова[стОбъявление.bodyType];
		Если ЗначениеЗаполнено(ТипКузова) Тогда
			мзНовоеОбъявление.ТипКузова = ТипКузова;
		Иначе
			мзНовоеОбъявление.ТипКузова = "Грузовик";
		КонецЕсли;
		
		ТипТрансмиссии = ствТипТрансмиссии[стОбъявление.gearboxType];
		Если ЗначениеЗаполнено(ТипТрансмиссии) Тогда
			мзНовоеОбъявление.ТипТрансмиссии = ТипТрансмиссии;
		Иначе
			мзНовоеОбъявление.ТипТрансмиссии = "Другое";
		КонецЕсли;
		
		мзНовоеОбъявление.ОбъемДВС = стОбъявление.engineVolume;
		мзНовоеОбъявление.Мощность =  стОбъявление.enginePower;
		мзНовоеОбъявление.ТипПривода = стОбъявление.driveType;
	
		Если стОбъявление.autotekaFeedStatus = 1 Тогда
			мзНовоеОбъявление.СтатусАвтотека = "Зеленый";
		ИначеЕсли стОбъявление.autotekaFeedStatus = 2 Тогда
			мзНовоеОбъявление.СтатусАвтотека = "Желтый";
		ИначеЕсли стОбъявление.autotekaFeedStatus = 3 Тогда
			мзНовоеОбъявление.СтатусАвтотека = "Красный";
		КонецЕсли;
		
		мзНовоеОбъявление.Цена = стОбъявление.lastRubPrice;
		мзНовоеОбъявление.Локация = стОбъявление.cityName;
		мзНовоеОбъявление.Поколение = стОбъявление.generation.name;
		мзНовоеОбъявление.Кузов = стОбъявление.bodyConfiguration.name;
		мзНовоеОбъявление.Модификация = стОбъявление.modification.name;
		мзНовоеОбъявление.Записать();
	КонецЦикла;
	
	Возврат мОбъявления.Количество();
КонецФункции
