// При использовании данной формы изменения вноятся в процедуру "Ок"
// Смотри в ней комментарии
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПривилегированныйРежим(Истина);
	ИмяПользователя=ПолноеИмяПользователя();
	СисИнфо = Новый СистемнаяИнформация;
	Софт=Метаданные.Имя+" v."+Метаданные.Версия+", 1C: "+СисИнфо.ВерсияПриложения;	
	Обработка=РеквизитФормыВЗначение("Объект");
	Версии=Обработка.ПолучитьВерсииПА();
	Версия=Обработка.Метаданные().Комментарий;
	ТипОбработки=?(Лев(ТипЗнч(Обработка),7)="Внешняя","Внешняя","")+"Обработка."+Обработка.Метаданные().Имя;
	Попытка
		Данные=ХранилищеОбщихНастроек.Загрузить("Ниракс-Лицензирование","Авторизация",,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
		Если ТипЗнч(Данные)=Тип("Структура") Тогда 
			Если Данные.Свойство("Логин")  Тогда Логин=Данные.Логин;  КонецЕсли;
			Если Данные.Свойство("Пароль") Тогда Пароль=Данные.Пароль; КонецЕсли;
			ВходБезЗапроса=?(Данные.Свойство("ВходБезЗапроса"), Данные.ВходБезЗапроса, Ложь);
		КонецЕсли;
	Исключение
	Конецпопытки;
	//Нужны настройки   //Глухов 290618
	Попытка	
		Данные2=Неопределено;
		Данные2=ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","ОбъектMySQL",,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
		Если ТипЗнч(Данные2)=Тип("Структура") Тогда
			Если Данные2.Свойство("ОтключитьПодсказкиВидеоИнструкций") Тогда
				Если Данные2.ОтключитьПодсказкиВидеоИнструкций Тогда
					ЭтаФорма.Элементы.КакНачатьПользоватьсяПродуктом.Видимость = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
	Исключение
	КонецПопытки;
	//УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Server="web.nirax.ru";
	urlAPI="/api/index.php";
	ЭтаФорма.Заголовок=ЭтаФорма.Заголовок+" v."+Версия;
	Запрос=новый Структура("action","getIP");
	Ответ=ВыполнитьЗапрос(Запрос);
	IPКлиента=Ответ.comment;
	Если Версии.СтарыйЗапуск Тогда
		Элементы.Станицы.ТекущаяСтраница=Элементы.СтараяВерсия;
		Элементы.Декорация5.Заголовок="Ваша рабочая версия: "+Версии.Рабочая+", запущена версия: "+Версии.Текущая;
		ЭтаФорма.ТекущийЭлемент=Элементы.Кнопка2;
	Иначе
		ЭтаФорма.ТекущийЭлемент=Элементы.Логин;
		Если Не Пустаястрока(Логин) Тогда
			Если ВходБезЗапроса=Истина И Лев(ЭтаФорма.Заголовок,16)<>"Регистрация и ли" Тогда
				ЛогинВерен=Ложь;
				ОК("1");
				//Отказ=ЛогинВерен;
			Иначе
				ЛогинПриИзменении(Неопределено);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Глухов 300618
	//#Если ВебКлиент Тогда    
	//	Если Не ПодключитьРасширениеРаботыСФайлами() Тогда 
	//	    НачатьУстановкуРасширенияРаботыСФайлами();
	//	    ПодключитьРасширениеРаботыСФайлами();
	//	КонецЕсли;
	//#КонецЕсли
	#Если ВебКлиент Тогда
		ЭтаФорма.Элементы.КакПолучитьПолныйДоступ.Видимость=Ложь;
	#КонецЕсли
	Элементы.IPКлиента.Заголовок = IPКлиента;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛогинПриИзменении(Элемент)
	Если ПустаяСтрока(Логин) Тогда
		Элементы.Логин.ЦветТекстаЗаголовка = Новый Цвет(0,0,0);
		ЛогинВерен=Ложь;
	Иначе
		Оповещение=Новый ОписаниеОповещения("КурсорНаЛогин",ЭтаФорма);
		Запрос=новый Структура("action,login","isRegistration",Логин);
		Ответ=ВыполнитьЗапрос(Запрос);
		Если Ответ.result=Ложь тогда
			ЛогинВерен=Ложь;
			Элементы.Логин.ЦветТекстаЗаголовка = Новый Цвет(255,0,0);
			ПоказатьПредупреждение(Оповещение,"Проблемы доступа к серверу."+символы.ПС+Ответ.comment,,"Проверка регистрации пользователя");
		ИначеЕсли Ответ.isRegistration<>Истина Тогда
			ЛогинВерен=Ложь;
			Элементы.Логин.ЦветТекстаЗаголовка = Новый Цвет(255,0,0);
			ПоказатьПредупреждение(Оповещение,"Пользователь с таким Логином не существует.",,"Проверка регистрации пользователя");
		ИначеЕсли Ответ.role<1 Тогда
			ЛогинВерен=Ложь;
			Элементы.Логин.ЦветТекстаЗаголовка = Новый Цвет(255,0,0);
			ПоказатьПредупреждение(Оповещение,"Требуется подтверждение регистрации.",,"Проверка регистрации пользователя");
		Иначе
			ЛогинВерен=Истина;
			Элементы.Логин.ЦветТекстаЗаголовка = Новый Цвет(0,0,0);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КурсорНаЛогин(Пар=Неопределено) Экспорт
	ЭтаФорма.ТекущийЭлемент=Элементы.Логин;
КонецПроцедуры	

&НаКлиенте
Процедура Регистрация(Команда)
	ПараметрыФормы=Новый Структура("urlAPI",urlAPI);
	ПараметрыФормы.Вставить("Server",Server);
	Если Не ПустаяСтрока(Логин) Тогда ПараметрыФормы.Вставить("Логин",Логин); КонецЕсли;
	Если Не ПустаяСтрока(Пароль) Тогда ПараметрыФормы.Вставить("Пароль",Пароль); КонецЕсли;
	Оповещение=Новый ОписаниеОповещения("КонецРегистрации",ЭтаФорма);
	ОткрытьФорму(ТипОбработки+".Форма.Лицензирование",ПараметрыФормы,
	ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура КонецРегистрации(Данные,Доп) Экспорт
	Если Данные<>Неопределено Тогда
		Логин=Данные.Логин;
		Пароль=Данные.Пароль;
	КонецЕсли;
	ЛогинПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	Если  ПустаяСтрока(Пароль) Тогда Возврат;
	ИначеЕсли ЛогинВерен = Ложь Тогда
		ЛогинПриИзменении(Неопределено);
		Если ЛогинВерен=Ложь Тогда Возврат;КонецЕсли;
	КонецЕсли;
	Запрос=новый Структура("action,login,password","userView",Логин,Пароль);
	Ответ=ВыполнитьЗапрос(Запрос);
	Если Ответ.result=Ложь Тогда
		ЭтаФорма.ТекущийЭлемент=Элементы.Пароль;
		ПоказатьПредупреждение(,Ответ.comment,,"Проверка регистрации пользователя");
		Возврат;
	КонецЕсли;

	// Открытие сеанса
	Запрос=новый Структура("action,login,password","sessionOpen",Логин,Пароль);
	// Укажите ключ продукта вместо "registration"
	Запрос.Вставить("keySoftware","CarAssistant");
	Запрос.Вставить("userName",ИмяПользователя);
	//Запрос.Вставить("workstation",ИмяКомпьютера());  //Глухов 260618
	#Если НЕ ВебКлиент Тогда
		Запрос.Вставить("workstation",ИмяКомпьютера());
	#Иначе
		Запрос.Вставить("workstation","Веб-клиент");
	#КонецЕсли	
	Запрос.Вставить("softwareVersion",Версия);
	Запрос.Вставить("userSoft",Софт);
	ДанныеСеанса=ВыполнитьЗапрос(Запрос);
	ДанныеСеанса.Вставить("CurrentUser", Логин);	
		
	Если ДанныеСеанса.result=ложь или ДанныеСеанса.idSession=0 Тогда
		ПоказатьПредупреждение(,"При при открытии сеанса произошли ошибки:"+символы.ПС+ДанныеСеанса.comment,,"Открытие сеанса");
	Иначе
		// Укажите имя основной формы. 
		ОсновнаяФорма="ОсновнаяФормаУФ";
		ДанныеСеанса.Вставить("urlAPI",urlAPI);
		// В основную форму передадутся Данные сеанса, которые содержат следующую информацию
		// idSession - Код сеанса - указывать при каждом обращении к web-серверу и при закрытии сеанса
		// idLicense - Код лицензии - если 0 - лицензия отсутствует - генерируйте в этом случае режим "ДЕМО"
		// idSoftware - Код программного продукта 
		// idUser - код Пользователя
		// urlAPI - адрес API;
		// Добавляейте в Данные сеанса требуемую информацию
		//Получим информацию по срокам подписки на продукты
		Запрос=Новый Структура("idSession,api,action,idUserList",ДанныеСеанса.idSession,"LicenseManagement","license",ДанныеСеанса.idUser);
		Ответ=ВыполнитьЗапрос(Запрос);
		Если Ответ.result=Ложь Тогда
			Сообщить(,"Ошибка при чтении данных запросов лицензий: "+Ответ.comment);
		КонецЕсли;
		
		СрокПодпискиПА = "";
		СрокПодпискиБК = "";
		СрокПодпискиТП = "";
		Для каждого Стр из Ответ.data цикл
			Если Стр.active="0" Тогда Продолжить; КонецЕсли;
			Если Стр.idSoftware = "4" Тогда //ПА
				Если ЗначениеЗаполнено(Стр.endDate) Тогда
					СрокПодпискиПА = Дата(стрЗаменить(Стр.endDate,"-",""));
				КонецЕсли;
				Если ЗначениеЗаполнено(Стр.supportDate) Тогда
					СрокПодпискиТП=Дата(стрЗаменить(Стр.supportDate,"-",""));
				КонецЕсли;
			ИначеЕсли Стр.idSoftware = "11" Тогда //БК	
				Если ЗначениеЗаполнено(Стр.endDate) Тогда
					СрокПодпискиБК = Дата(стрЗаменить(Стр.endDate,"-",""));
				КонецЕсли;
			КонецЕсли;					
		КонецЦикла;
		Если Ответ.data.Количество() = 0 Тогда
			ДемоРежим = Истина;
		КонецЕсли;
		ДанныеСеанса.Вставить("СрокПодпискиПА",СрокПодпискиПА);
		ДанныеСеанса.Вставить("СрокПодпискиБК",СрокПодпискиБК);
		ДанныеСеанса.Вставить("СрокПодпискиТП",СрокПодпискиТП);	
		ДанныеСеанса.Вставить("ДемоРежим",ДемоРежим);
		ДанныеСеанса.Вставить("IPКлиента",Сред(IPКлиента,16));
		ОткрытьФорму(ТипОбработки+".Форма."+ОсновнаяФорма, ДанныеСеанса,,Новый УникальныйИдентификатор());
		Попытка       //Глухов 300618 выдает ошибку если поместить в начальную страницу, ее закрывать не нужно
			Если Команда<>Неопределено Тогда
				ЭтаФорма.Закрыть();
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВыполнитьЗапрос(ПараметрыЗапроса)
	Попытка
		ТекстЗапроса="";
		Если ТипЗнч(ПараметрыЗапроса)=Тип("Структура") Тогда
			Для каждого Эл Из ПараметрыЗапроса Цикл
				Тип=ТипЗнч(Эл.Значение);
				Значение=?(Тип=Тип("Число"),Формат(Эл.Значение,"ЧГ=0;ЧН="),
				?(Тип<>Тип("Булево"), КодироватьСтроку(Строка(Эл.Значение), СпособКодированияСтроки.КодировкаURL),  //КодироватьURL(Строка(Эл.Значение)),
				?(Эл.Значение=Истина,1,0)));
				ТекстЗапроса=ТекстЗапроса+"&"+Эл.Ключ+"="+Значение;
			КонецЦикла
		КонецЕсли;
		
		Соединение = Новый HTTPСоединение(Server);
		Заголовки = Новый Соответствие();
		Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
		Запрос = Новый HTTPЗапрос(urlAPI, Заголовки);
		Запрос.УстановитьТелоИзСтроки(ТекстЗапроса);		
		Ответ = Соединение.ОтправитьДляОбработки(Запрос);
		ОтветТекст = Ответ.ПолучитьТелоКакСтроку();
		Если Ответ.КодСостояния=200 Тогда
			Если лев(ОтветТекст,1)="<" Тогда
				Возврат Новый Структура("result,comment",Ложь,"Не выполнен запрос: "+символы.ПС+
				"получен ответ: "+Символы.ПС+ОтветТекст);
			КонецЕсли;
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ОтветТекст);
			Рез = ПрочитатьJSON(ЧтениеJSON, Ложь);
			Если ЗначениеЗаполнено(Рез) Тогда
				Возврат Рез;
			Иначе
				Возврат Новый Структура("result,comment",Ложь,"Не выполнен запрос: "+символы.ПС+
				"получен ответ: "+Символы.ПС+ОтветТекст);
			КонецЕсли;
		Иначе
			Возврат Новый Структура("result,comment",Ложь,"Ошибка подключения при авторизации, статус ответа =  "+Строка(Ответ.КодСостояния));
		КонецЕсли;
	Исключение
		Возврат Новый Структура("result,comment",Ложь,"Ошибка при подключении: "+ОписаниеОшибки());
	Конецпопытки;
 
КонецФункции

&НаКлиенте
Процедура КакНачатьПользоватьсяПродуктомНажатие(Команда)   //Глухов 290618
	ЗапуститьПриложение("https://youtu.be/d-3Apu9lZWA?utm_source=fromPA&utm_medium=cpc&utm_campaign=registration");
КонецПроцедуры

&НаКлиенте
Процедура КакПолучитьПолныйДоступНажатие(Команда)  //Глухов 290618
	ЗапуститьПриложение("https://youtu.be/w-SAnVR29yc?utm_source=fromPA&utm_medium=cpc&utm_campaign=fullaccess");
КонецПроцедуры

//
&НаКлиенте
Процедура Link_YouTube(Команда)
	ЗапуститьПриложение("https://www.youtube.com/channel/UCJb2A6qtmHPoCCNH1wiVPVQ");
КонецПроцедуры

&НаКлиенте
Процедура Link_VK(Команда)
	ЗапуститьПриложение("https://vk.com/it_nirax");
КонецПроцедуры

&НаКлиенте
Процедура Link_Web(Команда)
	ЗапуститьПриложение("https://nirax.ru/");
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьРаботу(Команда)
	Элементы.Станицы.ТекущаяСтраница=Элементы.Авторизация;
	ЭтаФорма.ТекущийЭлемент=Элементы.Логин;
	Если Не Пустаястрока(Логин) Тогда
		Если ВходБезЗапроса=Истина И Лев(ЭтаФорма.Заголовок,16)<>"Регистрация и ли" Тогда
			ЛогинВерен=Ложь;
			ОК("1");
		Иначе
			ЛогинПриИзменении(Неопределено);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры





