Функция ОпределитьВидАвтомобиля(Автомобиль) Экспорт
	
	Результат = Неопределено;
	
	Если Не ЗначениеЗаполнено(Автомобиль) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПоступлениеАвтомобилейАвтомобили.Ссылка.DMS_ВидАвтомобиля КАК ТипОперации
		               |ИЗ
		               |	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
		               |ГДЕ
		               |	ПоступлениеАвтомобилейАвтомобили.Автомобиль = &Автомобиль
		               |	И ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	""Демо""
		               |ИЗ
		               |	РегистрСведений.Renault_ДемоПодменки КАК Renault_ДемоПодменки
		               |ГДЕ
		               |	Renault_ДемоПодменки.VIN = &VIN
		               |	И Renault_ДемоПодменки.ТипЗаявки = ""Демо""";
		
		Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
		Запрос.УстановитьПараметр("VIN", Автомобиль.VIN);
		
		РезультатЗапроса = Запрос.Выполнить();		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Результат = Выборка.ТипОперации;	 
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеПечати(знач МассивДокументов, знач МассивИменМакетов) Экспорт
	
	ДанныеПоВсемОбъектам = Новый Соответствие;
	
	Для Каждого ОбъектСсылка Из МассивДокументов Цикл
		ДанныеОбъектаПоМакетам = Новый Соответствие;
		Для Каждого ИмяМакета Из МассивИменМакетов Цикл
			ДанныеОбъектаПоМакетам.Вставить(ИмяМакета, ПолучитьДанныеОбъекта(ОбъектСсылка, ИмяМакета));
		КонецЦикла;
		ДанныеПоВсемОбъектам.Вставить(ОбъектСсылка, ДанныеОбъектаПоМакетам);
	КонецЦикла;
	
	ОписаниеОбластей = Новый Соответствие;
	ОписаниеОбластей.Вставить(ИмяМакета, ПолучитьОписаниеОбластейМакетаОфисногоДокумента());
	ДвоичныеДанныеМакетов = Новый Соответствие;
	ТипыМакетов = Новый Соответствие;
	
	Для Каждого ИмяМакета Из МассивИменМакетов Цикл
		Если ИмяМакета = "ПФ_DOC_Договор" Тогда
			ДвоичныеДанныеМакетов.Вставить(ИмяМакета, Renault_УправлениеПечатью.ПолучитьМакет("Документ.CRM_Договор.ПФ_DOC_ДоговорНаАванс_ФизЛицо"));
			ТипыМакетов.Вставить(ИмяМакета, "DOC");
		Иначе
			//?
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("Данные, Макеты",
							ДанныеПоВсемОбъектам,
							Новый Структура("ОписаниеОбластей, ТипыМакетов, ДвоичныеДанныеМакетов",
											ОписаниеОбластей,
											ТипыМакетов,
											ДвоичныеДанныеМакетов));
	
КонецФункции

Функция ПолучитьДанныеОбъекта(СсылкаНаОбъект, ИмяМакета) Экспорт
	
	Запрос = Новый Запрос;
	
	//++ изменено dev7 20180305. По заданию в связи с изменением метода хранения информации для подписания договора
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Renault_Договор.Ссылка,
	//|	Renault_Договор.Номер КАК НомерДоговора,
	//|	Renault_Договор.Дата,
	//|	Renault_Договор.РабочийЛист,
	//|	Renault_Договор.ДатаДоговора,
	//|	Renault_Договор.Комментарий,
	//|	Renault_Договор.СтатусПредварительныхДокументов,
	//|	Renault_Договор.СтатусОкончательныхДокументов,
	//|	Renault_Договор.СтатусДоговора,
	//|	Renault_Договор.РеализацияАвтомобиля,
	//|	Renault_Договор.ЗаказНаАвтомобиль,
	//|	ЕСТЬNULL(Контрагенты.Ссылка, CRM_ПотенциальныеКонтрагенты.Ссылка) КАК Клиент,
	//|	ЕСТЬNULL(Контрагенты.ФормаСобственности, CRM_ПотенциальныеКонтрагенты.ФормаСобственности) КАК КлиентФормаСобственности,
	//|	ЕСТЬNULL(Контрагенты.Фамилия, CRM_ПотенциальныеКонтрагенты.Фамилия) КАК КлиентФамилия,
	//|	ЕСТЬNULL(Контрагенты.Имя, CRM_ПотенциальныеКонтрагенты.Имя) КАК КлиентИмя,
	//|	ЕСТЬNULL(Контрагенты.Отчество, CRM_ПотенциальныеКонтрагенты.Отчество) КАК КлиентОтчество,
	//|	ЕСТЬNULL(Контрагенты.Пол, CRM_ПотенциальныеКонтрагенты.Пол) КАК КлиентПол,
	//|	ЕСТЬNULL(Контрагенты.ДатаРождения, CRM_ПотенциальныеКонтрагенты.ДатаРождения) КАК КлиентДатаРождения,
	//|	ЕСТЬNULL(ПодтверждающиеДокументы.Серия, """") КАК КлиентПаспортСерия,
	//|	ЕСТЬNULL(ПодтверждающиеДокументы.Номер, """") КАК КлиентПаспортНомер,
	//|	ЕСТЬNULL(ПодтверждающиеДокументы.КемВыдан, """") КАК КлиентПаспортВыданКем,
	//|	ЕСТЬNULL(ПодтверждающиеДокументы.ДатаВыдачи, """") КАК КлиентПаспортВыданДата,
	//|	ЕСТЬNULL(КонтактнаяИнформацияТелефоны.Представление, """") КАК КлиентОсновнойТелефон,
	//|	ЕСТЬNULL(КонтактнаяИнформацияEMail.Представление, """") КАК КлиентОсновнойEmail,
	//|	ВЫБОР
	//|		КОГДА ЕСТЬNULL(Контрагенты.ФормаСобственности, CRM_ПотенциальныеКонтрагенты.ФормаСобственности) = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЧастноеЛицо)
	//|			ТОГДА ЕСТЬNULL(КонтактнаяИнформацияАдресФакт.Представление, """")
	//|		ИНАЧЕ ЕСТЬNULL(КонтактнаяИнформацияАдресЮр.Представление, """")
	//|	КОНЕЦ КАК КлиентАдрес,
	//|	Renault_Договор.КлиентДоговора.Наименование,
	//|	ЕСТЬNULL(Контрагенты.ИНН, CRM_ПотенциальныеКонтрагенты.ИНН) КАК КлиентИНН,
	//|	ЕСТЬNULL(Контрагенты.КПП, CRM_ПотенциальныеКонтрагенты.КПП) КАК КлиентКПП,
	//|	ЕСТЬNULL(Контрагенты.КодПоОКПО, CRM_ПотенциальныеКонтрагенты.КодПоОКПО) КАК КлиентКодПоОКПО,
	//|	ЕСТЬNULL(Контрагенты.КодИМНС, CRM_ПотенциальныеКонтрагенты.КодИМНС) КАК КлиентКодИМНС,
	//|	Renault_Договор.КлиентБанковскийСчет.НомерСчета КАК КлиентСчет,
	//|	Renault_Договор.КлиентБанковскийСчет.Банк.КоррСчет КАК КлиентКоррСчет,
	//|	Renault_Договор.КлиентБанковскийСчет.Банк.Код КАК КлиентБИК,
	//|	Renault_Договор.КлиентБанковскийСчет.Банк КАК КлиентБанкСчета,
	//|	Renault_Договор.НесколькоАвтомобилейВДоговоре,
	//|	Renault_Договор.ДилерскийЦентр,
	//|	Renault_Договор.СуммаДоговора,
	//|	Renault_Договор.СуммаАванса,
	//|	Renault_Договор.Организация,
	//|	Renault_Договор.Менеджер,
	//|	Renault_Договор.КлиентПодписант КАК КлиентПодписантВЛице,
	//|	Renault_Договор.ДилерНаименованиеОрганизации,
	//|	Renault_Договор.ДилерИНН,
	//|	Renault_Договор.ДилерКПП,
	//|	Renault_Договор.ДилерСчет,
	//|	Renault_Договор.ДилерКоррСчет,
	//|	Renault_Договор.ДилерБИК,
	//|	Renault_Договор.ДилерБанк,
	//|	Renault_Договор.ДилерАдресЮридический,
	//|	Renault_Договор.ДилерАдресФактический,
	//|	Renault_Договор.ДилерТелефон,
	//|	Renault_Договор.ДилерПодписантВЛице,
	//|	Renault_Договор.ДилерПодписантНаОсновании,
	//|	Renault_Договор.ДилерПодписантПодпись,
	//|	Renault_Договор.ДилерПодписантДолжность,
	//|	Renault_Договор.СоставДоговора.(
	//|		Ссылка,
	//|		НомерСтроки,
	//|		Идентификатор,
	//|		ЗаказВПроизводство,
	//|		Автомобиль,
	//|		VIN,
	//|		ГодВыпуска,
	//|		Модель,
	//|		Версия,
	//|		Цвет,
	//|		ЖелаемаяДатаВыдачи,
	//|		СоставОпций,
	//|		ОбщаяСуммаПоАвтомобилю,
	//|		СтоимостьБазовойКомплектации,
	//|		СуммаДоставки,
	//|		СуммаСкидки,
	//|		СтоимостьДопОпций,
	//|		СтоимостьОпцийДилера,
	//|		РазницаССуммойПоДоговору,
	//|		СуммаАвтомобиляИтого,
	//|		СуммаОпцийИтого,
	//|		СтоимостьУстановленногоОборудования,
	//|		СтоимостьАвторабот,
	//|		СтоимостьОборудованияДляУстановки,
	//|		Модель.Артикул КАК КодМодели,
	//|		Версия.Артикул КАК КодВерсии,
	//|		Цвет.Артикул КАК КодЦвета,
	//|		МаркаМодельПТС,
	//|		ТипПТС,
	//|		КатегорияПТС,
	//|		ГодИзготовленияПТС,
	//|		НомерДвигателяПТС,
	//|		НомерШассиПТС,
	//|		НомерКузоваПТС,
	//|		ЦветКузоваПТС,
	//|		МощностьДвигателяПТС,
	//|		РабочийОбъемДвигателяПТС,
	//|		ТипДвигателяПТС,
	//|		ЭкологическийКлассДвигателяПТС,
	//|		ПТС,
	//|		ОрганизацияИзготовительПТС,
	//|		ГарантияПТС,
	//|		РазрешеннаяМаксимальнаяМассаПТС,
	//|		МассаБезНагрузкиПТС,
	//|		ОдобрениеТипаТСПТС,
	//|		МодельДвигателяПТС,
	//|		ДатаПТС,
	//|		АдресИзготовителяПТС,
	//|		ДатаВыдачи,
	//|		ЗаявкаНаТрейдИн
	//|	),
	//|	Renault_Договор.ДопОпцииАвтомобилей.(
	//|		Ссылка,
	//|		НомерСтроки,
	//|		Идентификатор,
	//|		Опция,
	//|		Цена,
	//|		Код,
	//|		Наименование
	//|	),
	//|	Renault_Договор.УстановленноеОборудование.(
	//|		Ссылка,
	//|		НомерСтроки,
	//|		Идентификатор,
	//|		Номенклатура,
	//|		Цена,
	//|		Количество,
	//|		Сумма
	//|	),
	//|	Renault_Договор.ОборудованиеДляУстановки.(
	//|		Ссылка,
	//|		НомерСтроки,
	//|		Идентификатор,
	//|		Номенклатура,
	//|		Цена,
	//|		Количество,
	//|		Сумма
	//|	),
	//|	Renault_Договор.СуммаДоговора - Renault_Договор.СуммаАванса КАК СуммаЗаВычетомАванса,
	//|	Renault_Договор.Менеджер.Наименование КАК МенеджерФИО,
	//|	Renault_Договор.ДатаАктаПередачи,
	//|	Renault_ДополнительныеСвойстваОрганизации.БИН,
	//|	CRM_СостояниеАвтомобилейПроизводителя_v2.Статус КАК СтатусГотовностиАвтомобиля,
	//|	CRM_ДополнительнаяИнформацияПоДоговорам.ПлановаяДатаПолнойОплатыКлиентом КАК ПлановаяДатаПолнойОплатыКлиентом,
	//|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания КАК ПланируемаяДатаВыдачиАвтомобиля,
	//|	ВЫБОР
	//|		КОГДА CRM_СостояниеАвтомобилейПроизводителя_v2.Версия = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка)
	//|			ТОГДА CRM_СостояниеАвтомобилейПроизводителя_v2.Автомобиль.ВариантКомплектации
	//|		ИНАЧЕ CRM_СостояниеАвтомобилейПроизводителя_v2.Версия
	//|	КОНЕЦ КАК КодМодели,
	//|	ВЫБОР
	//|		КОГДА Renault_Договор.ОсновнаяФормаОплаты = ЗНАЧЕНИЕ(Справочник.Renault_ФормыОплатыДоговоров.Наличными)
	//|			ТОГДА ""Да""
	//|		ИНАЧЕ ""Нет""
	//|	КОНЕЦ КАК ОплатаНаличными,
	//|	CRM_КлиентскиеДанные.ИсточникИнформации КАК ИсточникИнформации,
	//|	Renault_Договор.ТипАвтомобиля,
	//|	Renault_Договор.ДилерскийЦентр.Город КАК ДилерГород,
	//|	Renault_Договор.СуммаАкцииРено,
	//|	CRM_СостояниеАвтомобилейПроизводителя_v2.OPTIONS КАК СоставОпций,
	//|	Renault_Договор.СуммаКредита,
	//|	Renault_Договор.СпособОплаты,
	//|	Renault_Договор.Коммерческий,
	//|	Renault_Договор.ОтсрочкаПлатежа,
	//|	Renault_Договор.КредитБанкНаименование
	//|ИЗ
	//|	Документ.Renault_Договор КАК Renault_Договор
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ДополнительныеСвойстваОрганизации КАК Renault_ДополнительныеСвойстваОрганизации
	//|		ПО Renault_Договор.Организация = Renault_ДополнительныеСвойстваОрганизации.Организация
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
	//|		ПО (CRM_СобытияПоРабочимЛистам.IDK = Renault_Договор.РабочийЛист)
	//|			И (CRM_СобытияПоРабочимЛистам.ВидСобытия = ЗНАЧЕНИЕ(Справочник.CRM_ВидыСобытий.Выдача))
	//|			И (CRM_СобытияПоРабочимЛистам.ЗавершеноУспешно = ИСТИНА)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	//|		ПО (Контрагенты.Ссылка = Renault_Договор.КлиентДоговора)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_ПотенциальныеКонтрагенты КАК CRM_ПотенциальныеКонтрагенты
	//|		ПО (CRM_ПотенциальныеКонтрагенты.Ссылка = Renault_Договор.КлиентДоговора)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	//|		ПО Renault_Договор.КлиентДоговора = ПодтверждающиеДокументы.Владелец
	//|			И (ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Паспорт))
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияТелефоны
	//|		ПО Renault_Договор.КлиентДоговора = КонтактнаяИнформацияТелефоны.Объект
	//|			И (КонтактнаяИнформацияТелефоны.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	//|			И (КонтактнаяИнформацияТелефоны.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСотовый))
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияАдресЮр
	//|		ПО Renault_Договор.КлиентДоговора = КонтактнаяИнформацияАдресЮр.Объект
	//|			И (КонтактнаяИнформацияАдресЮр.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	//|			И (КонтактнаяИнформацияАдресЮр.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЮридический))
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияАдресФакт
	//|		ПО Renault_Договор.КлиентДоговора = КонтактнаяИнформацияАдресФакт.Объект
	//|			И (КонтактнаяИнформацияАдресФакт.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	//|			И (КонтактнаяИнформацияАдресФакт.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресФактический))
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияEMail
	//|		ПО Renault_Договор.КлиентДоговора = КонтактнаяИнформацияEMail.Объект
	//|			И (КонтактнаяИнформацияEMail.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	//|			И (КонтактнаяИнформацияEMail.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий)
	//|				ИЛИ КонтактнаяИнформацияEMail.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний))
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументыПодписанта
	//|		ПО Renault_Договор.КлиентПодписант = ПодтверждающиеДокументыПодписанта.Владелец
	//|			И (ПодтверждающиеДокументыПодписанта.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Доверенность))
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
	//|		ПО Renault_Договор.VIN = CRM_СостояниеАвтомобилейПроизводителя_v2.VIN
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ДополнительнаяИнформацияПоДоговорам КАК CRM_ДополнительнаяИнформацияПоДоговорам
	//|		ПО Renault_Договор.Ссылка = CRM_ДополнительнаяИнформацияПоДоговорам.Договор
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_КлиентскиеДанные КАК CRM_КлиентскиеДанные
	//|		ПО Renault_Договор.Клиент = CRM_КлиентскиеДанные.Клиент
	//|ГДЕ
	//|	Renault_Договор.Ссылка = &Ссылка";
	//-- изменено dev7 20180305. По заданию в связи с изменением метода хранения информации для подписания договора
	
	//++ изменено dev7 20180305. По заданию в связи с изменением метода хранения информации для подписания договора
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_Договор.Ссылка КАК Ссылка,
	|	Renault_Договор.Номер КАК НомерДоговора,
	|	Renault_Договор.Дата КАК Дата,
	|	Renault_Договор.РабочийЛист КАК РабочийЛист,
	|	Renault_Договор.ДатаДоговора КАК ДатаДоговора,
	|	Renault_Договор.Комментарий КАК Комментарий,
	|	Renault_Договор.СтатусПредварительныхДокументов КАК СтатусПредварительныхДокументов,
	|	Renault_Договор.СтатусОкончательныхДокументов КАК СтатусОкончательныхДокументов,
	|	Renault_Договор.СтатусДоговора КАК СтатусДоговора,
	|	Renault_Договор.РеализацияАвтомобиля КАК РеализацияАвтомобиля,
	|	Renault_Договор.ЗаказНаАвтомобиль КАК ЗаказНаАвтомобиль,
	|	ЕСТЬNULL(Контрагенты.Ссылка, CRM_ПотенциальныеКонтрагенты.Ссылка) КАК Клиент,
	|	ЕСТЬNULL(Контрагенты.ФормаСобственности, CRM_ПотенциальныеКонтрагенты.ФормаСобственности) КАК КлиентФормаСобственности,
	|	ЕСТЬNULL(Контрагенты.Фамилия, CRM_ПотенциальныеКонтрагенты.Фамилия) КАК КлиентФамилия,
	|	ЕСТЬNULL(Контрагенты.Имя, CRM_ПотенциальныеКонтрагенты.Имя) КАК КлиентИмя,
	|	ЕСТЬNULL(Контрагенты.Отчество, CRM_ПотенциальныеКонтрагенты.Отчество) КАК КлиентОтчество,
	|	ЕСТЬNULL(Контрагенты.Пол, CRM_ПотенциальныеКонтрагенты.Пол) КАК КлиентПол,
	|	ЕСТЬNULL(Контрагенты.ДатаРождения, CRM_ПотенциальныеКонтрагенты.ДатаРождения) КАК КлиентДатаРождения,
	|	ЕСТЬNULL(ПодтверждающиеДокументы.Серия, """") КАК КлиентПаспортСерия,
	|	ЕСТЬNULL(ПодтверждающиеДокументы.Номер, """") КАК КлиентПаспортНомер,
	|	ЕСТЬNULL(ПодтверждающиеДокументы.КемВыдан, """") КАК КлиентПаспортВыданКем,
	|	ЕСТЬNULL(ПодтверждающиеДокументы.ДатаВыдачи, """") КАК КлиентПаспортВыданДата,
	|	ЕСТЬNULL(КонтактнаяИнформацияТелефоны.Представление, """") КАК КлиентОсновнойТелефон,
	|	ЕСТЬNULL(КонтактнаяИнформацияEMail.Представление, """") КАК КлиентОсновнойEmail,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Контрагенты.ФормаСобственности, CRM_ПотенциальныеКонтрагенты.ФормаСобственности) = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЧастноеЛицо)
	|			ТОГДА ЕСТЬNULL(КонтактнаяИнформацияАдресФакт.Представление, """")
	|		ИНАЧЕ ЕСТЬNULL(КонтактнаяИнформацияАдресЮр.Представление, """")
	|	КОНЕЦ КАК КлиентАдрес,
	|	Renault_Договор.КлиентДоговора.Наименование КАК КлиентДоговораНаименование,
	|	ЕСТЬNULL(Контрагенты.ИНН, CRM_ПотенциальныеКонтрагенты.ИНН) КАК КлиентИНН,
	|	ЕСТЬNULL(Контрагенты.КПП, CRM_ПотенциальныеКонтрагенты.КПП) КАК КлиентКПП,
	|	ЕСТЬNULL(Контрагенты.КодПоОКПО, CRM_ПотенциальныеКонтрагенты.КодПоОКПО) КАК КлиентКодПоОКПО,
	|	ЕСТЬNULL(Контрагенты.КодИМНС, CRM_ПотенциальныеКонтрагенты.КодИМНС) КАК КлиентКодИМНС,
	|	Renault_Договор.КлиентБанковскийСчет.НомерСчета КАК КлиентСчет,
	|	Renault_Договор.КлиентБанковскийСчет.Банк.КоррСчет КАК КлиентКоррСчет,
	|	Renault_Договор.КлиентБанковскийСчет.Банк.Код КАК КлиентБИК,
	|	Renault_Договор.КлиентБанковскийСчет.Банк КАК КлиентБанкСчета,
	|	Renault_Договор.НесколькоАвтомобилейВДоговоре КАК НесколькоАвтомобилейВДоговоре,
	|	Renault_Договор.ДилерскийЦентр КАК ДилерскийЦентр,
	|	Renault_Договор.СуммаДоговора КАК СуммаДоговора,
	|	Renault_Договор.СуммаАванса КАК СуммаАванса,
	|	Renault_Договор.Организация КАК Организация,
	|	Renault_Договор.Менеджер КАК Менеджер,
	|	CRM_КлиентскиеДанныеПодписанта.ПодписантВЛице КАК КлиентПодписантВЛице,
	|	CRM_КлиентскиеДанныеПодписанта.ПодписантНаОсновании КАК КлиентПодписантНаОсновании,
	|	CRM_КлиентскиеДанныеПодписанта.ПодписантПодпись КАК КлиентПодписантПодпись,
	|	CRM_КлиентскиеДанныеПодписанта.ПодписантДолжность КАК КлиентПодписантДолжность,
	|	Renault_Договор.ДилерНаименованиеОрганизации КАК ДилерНаименованиеОрганизации,
	|	Renault_Договор.ДилерИНН КАК ДилерИНН,
	|	Renault_Договор.ДилерКПП КАК ДилерКПП,
	|	Renault_Договор.ДилерСчет КАК ДилерСчет,
	|	Renault_Договор.ДилерКоррСчет КАК ДилерКоррСчет,
	|	Renault_Договор.ДилерБИК КАК ДилерБИК,
	|	Renault_Договор.ДилерБанк КАК ДилерБанк,
	|	Renault_Договор.ДилерАдресЮридический КАК ДилерАдресЮридический,
	|	Renault_Договор.ДилерАдресФактический КАК ДилерАдресФактический,
	|	Renault_Договор.ДилерТелефон КАК ДилерТелефон,
	|	Renault_Договор.ДилерПодписантВЛице КАК ДилерПодписантВЛице,
	|	Renault_Договор.ДилерПодписантНаОсновании КАК ДилерПодписантНаОсновании,
	|	Renault_Договор.ДилерПодписантПодпись КАК ДилерПодписантПодпись,
	|	Renault_Договор.ДилерПодписантДолжность КАК ДилерПодписантДолжность,
	|	Renault_Договор.СоставДоговора.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Идентификатор КАК Идентификатор,
	|		ЗаказВПроизводство КАК ЗаказВПроизводство,
	|		Автомобиль КАК Автомобиль,
	|		VIN КАК VIN,
	|		ГодВыпуска КАК ГодВыпуска,
	|		Модель КАК Модель,
	|		Версия КАК Версия,
	|		Цвет КАК Цвет,
	|		ЖелаемаяДатаВыдачи КАК ЖелаемаяДатаВыдачи,
	|		СоставОпций КАК СоставОпций,
	|		ОбщаяСуммаПоАвтомобилю КАК ОбщаяСуммаПоАвтомобилю,
	|		СтоимостьБазовойКомплектации КАК СтоимостьБазовойКомплектации,
	|		СуммаДоставки КАК СуммаДоставки,
	|		СуммаСкидки КАК СуммаСкидки,
	|		СтоимостьДопОпций КАК СтоимостьДопОпций,
	|		СтоимостьОпцийДилера КАК СтоимостьОпцийДилера,
	|		РазницаССуммойПоДоговору КАК РазницаССуммойПоДоговору,
	|		СуммаАвтомобиляИтого КАК СуммаАвтомобиляИтого,
	|		СуммаОпцийИтого КАК СуммаОпцийИтого,
	|		СтоимостьУстановленногоОборудования КАК СтоимостьУстановленногоОборудования,
	|		СтоимостьАвторабот КАК СтоимостьАвторабот,
	|		СтоимостьОборудованияДляУстановки КАК СтоимостьОборудованияДляУстановки,
	|		Модель.Артикул КАК КодМодели,
	|		Версия.Артикул КАК КодВерсии,
	|		Цвет.Артикул КАК КодЦвета,
	|		МаркаМодельПТС КАК МаркаМодельПТС,
	|		ТипПТС КАК ТипПТС,
	|		КатегорияПТС КАК КатегорияПТС,
	|		ГодИзготовленияПТС КАК ГодИзготовленияПТС,
	|		НомерДвигателяПТС КАК НомерДвигателяПТС,
	|		НомерШассиПТС КАК НомерШассиПТС,
	|		НомерКузоваПТС КАК НомерКузоваПТС,
	|		ЦветКузоваПТС КАК ЦветКузоваПТС,
	|		МощностьДвигателяПТС КАК МощностьДвигателяПТС,
	|		РабочийОбъемДвигателяПТС КАК РабочийОбъемДвигателяПТС,
	|		ТипДвигателяПТС КАК ТипДвигателяПТС,
	|		ЭкологическийКлассДвигателяПТС КАК ЭкологическийКлассДвигателяПТС,
	|		ПТС КАК ПТС,
	|		ОрганизацияИзготовительПТС КАК ОрганизацияИзготовительПТС,
	|		ГарантияПТС КАК ГарантияПТС,
	|		РазрешеннаяМаксимальнаяМассаПТС КАК РазрешеннаяМаксимальнаяМассаПТС,
	|		МассаБезНагрузкиПТС КАК МассаБезНагрузкиПТС,
	|		ОдобрениеТипаТСПТС КАК ОдобрениеТипаТСПТС,
	|		МодельДвигателяПТС КАК МодельДвигателяПТС,
	|		ДатаПТС КАК ДатаПТС,
	|		АдресИзготовителяПТС КАК АдресИзготовителяПТС,
	|		ДатаВыдачи КАК ДатаВыдачи,
	|		ЗаявкаНаТрейдИн КАК ЗаявкаНаТрейдИн,
	|		СуммаСкидокПоКоммерческимАкциям КАК СуммаСкидокПоКоммерческимАкциям,
	|		ЦенаПродажиАвтомобиля КАК ЦенаПродажиАвтомобиля,
	|		Оттенок КАК Оттенок,
	|		СуммаАвансаПоАвтомобилю КАК СуммаАвансаПоАвтомобилю,
	|		СтоимостьВыкупленногоАвтомобиля КАК СтоимостьВыкупленногоАвтомобиля,	
	|	) КАК СоставДоговора,
	|	Renault_Договор.ДопОпцииАвтомобилей.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Идентификатор КАК Идентификатор,
	|		Опция КАК Опция,
	|		Цена КАК Цена,
	|		Код КАК Код,
	|		Наименование КАК Наименование
	|	) КАК ДопОпцииАвтомобилей,
	|	Renault_Договор.УстановленноеОборудование.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Идентификатор КАК Идентификатор,
	|		Номенклатура КАК Номенклатура,
	|		Цена КАК Цена,
	|		Количество КАК Количество,
	|		Сумма КАК Сумма
	|	) КАК УстановленноеОборудование,
	|	Renault_Договор.ОборудованиеДляУстановки.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Идентификатор КАК Идентификатор,
	|		Номенклатура КАК Номенклатура,
	|		Цена КАК Цена,
	|		Количество КАК Количество,
	|		Сумма КАК Сумма
	|	) КАК ОборудованиеДляУстановки,
	|	Renault_Договор.СуммаДоговора - Renault_Договор.СуммаАванса КАК СуммаЗаВычетомАванса,
	|	Renault_Договор.Менеджер.Наименование КАК МенеджерФИО,
	|	Renault_Договор.ДатаАктаПередачи КАК ДатаАктаПередачи,
	|	Renault_ДополнительныеСвойстваОрганизации.БИН КАК БИН,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.Статус КАК СтатусГотовностиАвтомобиля,
	|	CRM_ДополнительнаяИнформацияПоДоговорам.ПлановаяДатаПолнойОплатыКлиентом КАК ПлановаяДатаПолнойОплатыКлиентом,
	|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания КАК ПланируемаяДатаВыдачиАвтомобиля,
	|	ВЫБОР
	|		КОГДА CRM_СостояниеАвтомобилейПроизводителя_v2.Версия = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка)
	|			ТОГДА CRM_СостояниеАвтомобилейПроизводителя_v2.Автомобиль.ВариантКомплектации
	|		ИНАЧЕ CRM_СостояниеАвтомобилейПроизводителя_v2.Версия
	|	КОНЕЦ КАК КодМодели,
	|	ВЫБОР
	|		КОГДА Renault_Договор.ОсновнаяФормаОплаты = ЗНАЧЕНИЕ(Справочник.Renault_ФормыОплатыДоговоров.Наличными)
	|			ТОГДА ""Да""
	|		ИНАЧЕ ""Нет""
	|	КОНЕЦ КАК ОплатаНаличными,
	|	CRM_КлиентскиеДанные.ИсточникИнформации КАК ИсточникИнформации,
	|	Renault_Договор.ТипАвтомобиля КАК ТипАвтомобиля,
	|	Renault_Договор.ДилерскийЦентр.Город КАК ДилерГород,
	|	Renault_Договор.СуммаАкцииРено КАК СуммаАкцииРено,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.OPTIONS КАК СоставОпций,
	|	Renault_Договор.СуммаКредита КАК СуммаКредита,
	|	Renault_Договор.СпособОплаты КАК СпособОплаты,
	|	Renault_Договор.Коммерческий КАК Коммерческий,
	|	Renault_Договор.ОтсрочкаПлатежа КАК ОтсрочкаПлатежа,
	|	Renault_Договор.КредитБанкНаименование КАК КредитБанкНаименование,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.PTS_SERIE КАК ПТССерия,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.PTS_NUM КАК ПТСНомер,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.CODE_RADIO КАК КодРадио
	|ИЗ
	|	Документ.Renault_Договор КАК Renault_Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ДополнительныеСвойстваОрганизации КАК Renault_ДополнительныеСвойстваОрганизации
	|		ПО Renault_Договор.Организация = Renault_ДополнительныеСвойстваОрганизации.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
	|		ПО (CRM_СобытияПоРабочимЛистам.IDK = Renault_Договор.РабочийЛист)
	|			И (CRM_СобытияПоРабочимЛистам.ВидСобытия = ЗНАЧЕНИЕ(Справочник.CRM_ВидыСобытий.Выдача))
	|			И (CRM_СобытияПоРабочимЛистам.ЗавершеноУспешно = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (Контрагенты.Ссылка = Renault_Договор.КлиентДоговора)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_ПотенциальныеКонтрагенты КАК CRM_ПотенциальныеКонтрагенты
	|		ПО (CRM_ПотенциальныеКонтрагенты.Ссылка = Renault_Договор.КлиентДоговора)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|		ПО Renault_Договор.КлиентДоговора = ПодтверждающиеДокументы.Владелец
	|			И (ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Паспорт))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияТелефоны
	|		ПО Renault_Договор.КлиентДоговора = КонтактнаяИнформацияТелефоны.Объект
	|			И (КонтактнаяИнформацияТелефоны.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	//|			И (КонтактнаяИнформацияТелефоны.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСотовый))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияАдресЮр
	|		ПО Renault_Договор.КлиентДоговора = КонтактнаяИнформацияАдресЮр.Объект
	|			И (КонтактнаяИнформацияАдресЮр.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформацияАдресЮр.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЮридический))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияАдресФакт
	|		ПО Renault_Договор.КлиентДоговора = КонтактнаяИнформацияАдресФакт.Объект
	|			И (КонтактнаяИнформацияАдресФакт.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформацияАдресФакт.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресФактический))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияEMail
	|		ПО Renault_Договор.КлиентДоговора = КонтактнаяИнформацияEMail.Объект
	|			И (КонтактнаяИнформацияEMail.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	|			И (КонтактнаяИнформацияEMail.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий)
	|				ИЛИ КонтактнаяИнформацияEMail.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
	|		ПО Renault_Договор.VIN = CRM_СостояниеАвтомобилейПроизводителя_v2.VIN
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ДополнительнаяИнформацияПоДоговорам КАК CRM_ДополнительнаяИнформацияПоДоговорам
	|		ПО Renault_Договор.Ссылка = CRM_ДополнительнаяИнформацияПоДоговорам.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_КлиентскиеДанные КАК CRM_КлиентскиеДанные
	|		ПО Renault_Договор.Клиент = CRM_КлиентскиеДанные.Клиент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_КлиентскиеДанные КАК CRM_КлиентскиеДанныеПодписанта
	|		ПО Renault_Договор.КлиентПодписант = CRM_КлиентскиеДанныеПодписанта.Клиент
	|ГДЕ
	|	Renault_Договор.Ссылка = &Ссылка";
	//-- изменено dev7 20180305. По заданию в связи с изменением метода хранения информации для подписания договора

	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВалютаРубли = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
	
	Если Выборка.Следующий() Тогда
		
		ДанныеОбъекта = Новый Структура;
		
		ДанныеОбъекта.Вставить("Ссылка", Выборка.Ссылка);
		ДанныеОбъекта.Вставить("Дата", Формат(Выборка.Дата, "ДФ='дд ММММ гггг'"));
		
		ДанныеОбъекта.Вставить("НомерДоговора", Выборка.НомерДоговора);
		ДанныеОбъекта.Вставить("ДатаДоговора", Формат(Выборка.ДатаДоговора,"ДФ='дд.ММ.гггг'"));
		ДанныеОбъекта.Вставить("ДатаАктаПередачи", Формат(Выборка.ДатаАктаПередачи,"ДФ='дд.ММ.гггг'"));
		ДанныеОбъекта.Вставить("ДатаДоговораПропись", Формат(Выборка.ДатаДоговора,"ДФ='дд ММММ гггг'")); //DMSREN 1325
		ДанныеОбъекта.Вставить("СуммаАванса", Выборка.СуммаАванса); //DMSREN 1159
		ДанныеОбъекта.Вставить("СтавкаНДС", Справочники.СтавкиНДС.ОсновнаяСтавкаНДС);
		ДанныеОбъекта.Вставить("Организация", Выборка.Организация);
		ДанныеОбъекта.Вставить("ОГРН", Выборка.Организация.ОГРН);
		ДанныеОбъекта.Вставить("БИН", Выборка.БИН);
		ДанныеОбъекта.Вставить("ДилерНаименованиеПолное", Выборка.ДилерНаименованиеОрганизации);
		ДанныеОбъекта.Вставить("ДилерИНН", Выборка.ДилерИНН);
		ДанныеОбъекта.Вставить("ДилерКПП", Выборка.ДилерКПП);
		ДанныеОбъекта.Вставить("ДилерСчет", Выборка.ДилерСчет);
		ДанныеОбъекта.Вставить("ДилерКоррСчет", Выборка.ДилерКоррСчет);
		ДанныеОбъекта.Вставить("ДилерБанк", Выборка.ДилерБанк);
		ДанныеОбъекта.Вставить("ДилерБИК", Выборка.ДилерБИК);
		ДанныеОбъекта.Вставить("ДилерТелефон", Выборка.ДилерТелефон);
		ДанныеОбъекта.Вставить("ДилерАдресЮридический", Выборка.ДилерАдресЮридический);
		ДанныеОбъекта.Вставить("ДилерАдресФактический", Выборка.ДилерАдресФактический);
		ДанныеОбъекта.Вставить("ДилерПодписантВЛице", Выборка.ДилерПодписантВЛице);
		ДанныеОбъекта.Вставить("ДилерПодписантНаОсновании", Выборка.ДилерПодписантНаОсновании);
		ДанныеОбъекта.Вставить("ДилерПодписантПодпись", Выборка.ДилерПодписантПодпись);
		ДанныеОбъекта.Вставить("ДилерПодписантДолжность", Выборка.ДилерПодписантДолжность);
		ДанныеОбъекта.Вставить("Менеджер", Выборка.МенеджерФИО);
		
		//Собираем инициалы которых нет в справочнике сотрудники
		ВходящаяСтрока = СтрЗаменить(Выборка.МенеджерФИО, " ", Символы.ПС);
		МенеджерИнициалы = "";
		Для ИндексСтроки = 1 По СтрЧислоСтрок(ВходящаяСтрока) Цикл
			Подстрока = СтрПолучитьСтроку(ВходящаяСтрока, ИндексСтроки);
			МенеджерИнициалы = МенеджерИнициалы + " "+ ?(ИндексСтроки=1,Подстрока,Лев(Подстрока,1)+".");
		КонецЦикла;
		
		ДанныеОбъекта.Вставить("МенеджерИнициалы",МенеджерИнициалы);
		//
		
		ДанныеОбъекта.Вставить("СтатусГотовностиАвтомобиля", Выборка.СтатусГотовностиАвтомобиля);
		ДанныеОбъекта.Вставить("ПлановаяДатаПолнойОплатыКлиентом", Выборка.ПлановаяДатаПолнойОплатыКлиентом);
		ДанныеОбъекта.Вставить("ПланируемаяДатаВыдачиАвтомобиля", Выборка.ПланируемаяДатаВыдачиАвтомобиля);
		ДанныеОбъекта.Вставить("КодМодели", Выборка.КодМодели);
		ДанныеОбъекта.Вставить("ОплатаНаличными", Выборка.ОплатаНаличными);
		ДанныеОбъекта.Вставить("ИсточникИнформации", Выборка.ИсточникИнформации);  
		ДанныеОбъекта.Вставить("КодыДополнительныхОпций", Выборка.СоставОпций);
		ДанныеОбъекта.Вставить("КодРадио", Выборка.КодРадио);
		ДанныеОбъекта.Вставить("ПТССерия", Выборка.ПТССерия);
		ДанныеОбъекта.Вставить("ПТСНомер", Выборка.ПТСНомер);
		
		ДанныеОбъекта.Вставить("СпособОплаты", Выборка.СпособОплаты); // DMSREN-1159
		
		
		ЗапросВоронкаПродаж = Новый Запрос;
		ЗапросВоронкаПродаж.Текст = 
		
		"ВЫБРАТЬ
		|	CRM_ВоронкаПродаж.ЭтапПродаж
		|ИЗ
		|	РегистрСведений.CRM_ВоронкаПродаж КАК CRM_ВоронкаПродаж
		|ГДЕ
		|	CRM_ВоронкаПродаж.IDK = &IDK";
				
		ЗапросВоронкаПродаж.УстановитьПараметр("IDK", Выборка.РабочийЛист);	
		РезультатВоронкаПродаж = ЗапросВоронкаПродаж.Выполнить().Выгрузить();
		
		ФормаОплатыКредит = "Нет";
		ТрэйдИН = "Нет";
		ДопОпции = "Нет";
		
		Для каждого стр из РезультатВоронкаПродаж Цикл
			Если стр.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаКредит 
				ИЛИ стр.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаКредитВыполнена
				ИЛИ стр.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаКредитОдобрена Тогда
				ФормаОплатыКредит = "Да";
			ИначеЕсли стр.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИн 
				ИЛИ стр.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнВизуальныйОсмотр 
				ИЛИ стр.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнВыполнена 
				ИЛИ стр.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнДиагностикаВСервисе
				ИЛИ стр.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнДоговорСКлиентом
				ИЛИ стр.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнЗаполнениеДанныхАвтомобиля
				ИЛИ стр.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнКалькуляция
				ИЛИ стр.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнКоммерческоеПредложение
				ИЛИ стр.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнОдобрена
				ИЛИ стр.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнПредварительнаяОценка
				ИЛИ стр.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнПредложениеВыкупа
				ИЛИ стр.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнПроверкаЮридическойЧистоты Тогда
				ТрэйдИН = "Да";
			ИначеЕсли стр.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаОборудование 
				ИЛИ стр.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаОборудованиеВыполнена Тогда
				ДопОпции = "Да";
			КонецЕсли;
		КонецЦикла;
		
		ДанныеОбъекта.Вставить("ФормаОплатыКредит", ФормаОплатыКредит);
		ДанныеОбъекта.Вставить("ТрэйдИН", ТрэйдИН);
		ДанныеОбъекта.Вставить("ДопОпции", ДопОпции);
		
		ОСАГО = "Нет";
		КАСКО = "Нет";
		
		ЗапросДанныеКАСКО_ОСАГО = Новый Запрос;
		ЗапросДанныеКАСКО_ОСАГО.Текст = 
			"ВЫБРАТЬ
			|	Renault_РабочийЛистОФУФинансовыеУслуги.ФинансоваяУслуга КАК ВидСтрахования
			|ИЗ
			|	Документ.Renault_РабочийЛистОФУ.ФинансовыеУслуги КАК Renault_РабочийЛистОФУФинансовыеУслуги
			|ГДЕ
			|	Renault_РабочийЛистОФУФинансовыеУслуги.Ссылка.Клиент = &Клиент
			|	И Renault_РабочийЛистОФУФинансовыеУслуги.Ссылка.РабочийЛист = &РабочийЛист";
		
		ЗапросДанныеКАСКО_ОСАГО.УстановитьПараметр("Клиент", Выборка.Клиент);
		ЗапросДанныеКАСКО_ОСАГО.УстановитьПараметр("РабочийЛист", Выборка.РабочийЛист);
		
		ВыборкаДанныеКАСКО_ОСАГО = ЗапросДанныеКАСКО_ОСАГО.Выполнить().Выбрать();
		
		Пока ВыборкаДанныеКАСКО_ОСАГО.Следующий() Цикл
			Если ВыборкаДанныеКАСКО_ОСАГО.ВидСтрахования.Вид = Перечисления.ВидыСтрахования.КАСКО Тогда
				КАСКО = "Да";
			ИначеЕсли ВыборкаДанныеКАСКО_ОСАГО.ВидСтрахования.Вид = Перечисления.ВидыСтрахования.ОСАГО Тогда
				ОСАГО = "Да";
			КонецЕсли; 
		КонецЦикла;
		
		ДанныеОбъекта.Вставить("КАСКО", КАСКО);
		ДанныеОбъекта.Вставить("ОСАГО", ОСАГО);
		
		ЗапросЖелаемаяДатаУстановки = Новый Запрос;
		ЗапросЖелаемаяДатаУстановки.Текст = 
			"ВЫБРАТЬ
			|	МАКСИМУМ(Renault_CRM_ЗаявкаНаСервис.ЖелаемаяДата) КАК ЖелаемаяДата
			|ИЗ
			|	Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
			|ГДЕ
			|	Renault_CRM_ЗаявкаНаСервис.Обращение.IDK = &IDK";
		
		ЗапросЖелаемаяДатаУстановки.УстановитьПараметр("IDK", Выборка.РабочийЛист);
		
		РезультатЗапросЖелаемаяДатаУстановки = ЗапросЖелаемаяДатаУстановки.Выполнить().Выгрузить();
		
		Для каждого стр из РезультатЗапросЖелаемаяДатаУстановки Цикл
			ЖелаемаяДата = стр.ЖелаемаяДата;
		КонецЦикла;
		
		ДанныеОбъекта.Вставить("ЖелаемаяДата", ЖелаемаяДата);
		
		ДанныеОбъекта.Вставить("Сумма", Выборка.СуммаДоговора);
		ДанныеОбъекта.Вставить("СуммаПрописью", обЧислоПрописью(Выборка.СуммаДоговора, ВалютаРубли));
		ДанныеОбъекта.Вставить("СуммаНДС", ПолучитьНДС(Выборка.СуммаДоговора, СтавкаНДС));
		ДанныеОбъекта.Вставить("СуммаНДСПрописью", обЧислоПрописью(ПолучитьНДС(Выборка.СуммаДоговора, СтавкаНДС), ВалютаРубли));
		
		ДанныеОбъекта.Вставить("СуммаАванса", Выборка.СуммаАванса);
		ДанныеОбъекта.Вставить("СуммаАвансаПрописью", обЧислоПрописью(Выборка.СуммаАванса, ВалютаРубли));
		ДанныеОбъекта.Вставить("СуммаАвансаНДС", ПолучитьНДС(Выборка.СуммаАванса, СтавкаНДС));
		ДанныеОбъекта.Вставить("СуммаАвансаНДСПрописью", обЧислоПрописью(ПолучитьНДС(Выборка.СуммаАванса, СтавкаНДС), ВалютаРубли));
		
		ДанныеОбъекта.Вставить("СуммаЗаВычетомАванса", Выборка.СуммаЗаВычетомАванса);
		ДанныеОбъекта.Вставить("СуммаЗаВычетомАвансаПрописью", обЧислоПрописью(Выборка.СуммаЗаВычетомАванса, ВалютаРубли));
		ДанныеОбъекта.Вставить("СуммаЗаВычетомАвансаНДС", ПолучитьНДС(Выборка.СуммаЗаВычетомАванса, СтавкаНДС));
		ДанныеОбъекта.Вставить("СуммаЗаВычетомАвансаНДСПрописью", обЧислоПрописью(ПолучитьНДС(Выборка.СуммаЗаВычетомАванса, СтавкаНДС), ВалютаРубли));
		ВыборкаСоставДоговора = Выборка.СоставДоговора.Выбрать();
		
		Если ВыборкаСоставДоговора.Следующий() Тогда
			
			ГосНомер = ЧтениеЗначенияРегистраСведения(ВыборкаСоставДоговора.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
			
			ДанныеОбъекта.Вставить("ГосНомер", ГосНомер);
			Менеджер = РегистрыСведений.Renault_ДопИнформацияПоВерсиям.СоздатьМенеджерЗаписи();
			Менеджер.ВариантКомплектации = ВыборкаСоставДоговора.Автомобиль.ВариантКомплектации;
			Менеджер.Прочитать();
			ДанныеОбъекта.Вставить("ОбъемДвигателя",	Менеджер.ОбъемДвигателя);
			ДанныеОбъекта.Вставить("МинимальнаяМасса",	Менеджер.МинимальнаяМасса);
			ДанныеОбъекта.Вставить("МаксимальнаяМасса",	Менеджер.МаксимальнаяМасса);
			ДанныеОбъекта.Вставить("МощностьКВТ",		Менеджер.МощностьКВТ);
			ДанныеОбъекта.Вставить("МощностьЛС",		Менеджер.МощностьЛС);
			ДанныеОбъекта.Вставить("СрокПоставки", Формат(ВыборкаСоставДоговора.ЖелаемаяДатаВыдачи,"ДЛФ=ДД"));
			
			ДанныеОбъекта.Вставить("Автомобиль", ВыборкаСоставДоговора.Автомобиль);
			ДанныеОбъекта.Вставить("VIN", ВыборкаСоставДоговора.VIN);
			ДанныеОбъекта.Вставить("Модель", ВыборкаСоставДоговора.Модель);
			ДанныеОбъекта.Вставить("Версия", ВыборкаСоставДоговора.Версия);
			ДанныеОбъекта.Вставить("Цвет", ВыборкаСоставДоговора.Цвет);
			ДанныеОбъекта.Вставить("ГодВыпуска", ВыборкаСоставДоговора.ГодВыпуска);
			ДанныеОбъекта.Вставить("ДатаВыдачи", ВыборкаСоставДоговора.ДатаВыдачи);
			ДанныеОбъекта.Вставить("КодМодели", ВыборкаСоставДоговора.КодМодели);
			ДанныеОбъекта.Вставить("КодВерсии", ВыборкаСоставДоговора.КодВерсии);
			ДанныеОбъекта.Вставить("КодЦвета", ВыборкаСоставДоговора.КодЦвета);
			ДанныеОбъекта.Вставить("СоставДопОпций", ВыборкаСоставДоговора.СоставОпций);
	
			
			ДанныеОбъекта.Вставить("АнкетаМарка", ВыборкаСоставДоговора.ЗаявкаНаТрейдИн.ПроизводительКод);
			ДанныеОбъекта.Вставить("АнкетаМодель", ВыборкаСоставДоговора.ЗаявкаНаТрейдИн.МодельКод);
			ДанныеОбъекта.Вставить("АнкетаГодВыпуска", ВыборкаСоставДоговора.ЗаявкаНаТрейдИн.ГодВыпуска);
			
			ВыборкаТТХИБазовыеОпции = ПолучитьВыборкуПоТТХИБазовымОпциям(ВыборкаСоставДоговора.Модель, ВыборкаСоставДоговора.Версия);
			Если ЗначениеЗаполнено(ВыборкаТТХИБазовыеОпции) Тогда
				ДанныеОбъекта.Вставить("СписокБазовыхОпций", ПолучитьТекстБазовыеОпции(ВыборкаТТХИБазовыеОпции.Выбрать()));
				ДанныеОбъекта.Вставить("МаркированныйСписокБазовыхОпций", ПолучитьСписокБазовыеОпции(ВыборкаТТХИБазовыеОпции.Выбрать()));
			Иначе
				ДанныеОбъекта.Вставить("СписокБазовыхОпций", "");
				ДанныеОбъекта.Вставить("МаркированныйСписокБазовыхОпций", "");
			КонецЕсли;
			
			//Стоимость автомобиля	
			ДанныеОбъекта.Вставить("СтоимостьБазовойКомплектацииПоПрайсу", ВыборкаСоставДоговора.СтоимостьБазовойКомплектации);
			ДанныеОбъекта.Вставить("СтоимостьБазовойКомплектацииПоПрайсуПрописью", обЧислоПрописью(ВыборкаСоставДоговора.СтоимостьБазовойКомплектации, ВалютаРубли));
			ДанныеОбъекта.Вставить("СтоимостьБазовойКомплектацииПоПрайсуНДС", ПолучитьНДС(ВыборкаСоставДоговора.СтоимостьБазовойКомплектации, СтавкаНДС));
			ДанныеОбъекта.Вставить("СтоимостьБазовойКомплектацииПоПрайсуНДСПрописью", обЧислоПрописью(ПолучитьНДС(ВыборкаСоставДоговора.СтоимостьБазовойКомплектации, СтавкаНДС), ВалютаРубли));
			
			ДанныеОбъекта.Вставить("СтоимостьДоставки", ВыборкаСоставДоговора.СуммаДоставки);
			ДанныеОбъекта.Вставить("СтоимостьДоставкиПрописью", обЧислоПрописью(ВыборкаСоставДоговора.СуммаДоставки, ВалютаРубли));
			ДанныеОбъекта.Вставить("СтоимостьДоставкиНДС", ПолучитьНДС(ВыборкаСоставДоговора.СуммаДоставки, СтавкаНДС));
			ДанныеОбъекта.Вставить("СтоимостьДоставкиНДСПрописью", обЧислоПрописью(ПолучитьНДС(ВыборкаСоставДоговора.СуммаДоставки, СтавкаНДС), ВалютаРубли));
			
			ДанныеОбъекта.Вставить("СуммаАкции", ВыборкаСоставДоговора.СуммаСкидокПоКоммерческимАкциям);
			ДанныеОбъекта.Вставить("СуммаАкцииПрописью", обЧислоПрописью(ВыборкаСоставДоговора.СуммаСкидокПоКоммерческимАкциям, ВалютаРубли));
			
			ДанныеОбъекта.Вставить("ЦенаПродажиАвтомобиля", ВыборкаСоставДоговора.ЦенаПродажиАвтомобиля);
			ДанныеОбъекта.Вставить("ЦенаПродажиАвтомобиляНДС", ПолучитьНДС(ВыборкаСоставДоговора.ЦенаПродажиАвтомобиля, СтавкаНДС));
	        ДанныеОбъекта.Вставить("ЦенаПродажиАвтомобиляПрописью", обЧислоПрописью(ВыборкаСоставДоговора.ЦенаПродажиАвтомобиля, ВалютаРубли));			
			ДанныеОбъекта.Вставить("ЦенаПродажиАвтомобиляНДСПрописью", обЧислоПрописью(ПолучитьНДС(ВыборкаСоставДоговора.ЦенаПродажиАвтомобиля, СтавкаНДС), ВалютаРубли));			
		
			ДанныеОбъекта.Вставить("СуммаСкидки", ВыборкаСоставДоговора.СуммаСкидки);
			ДанныеОбъекта.Вставить("СуммаСкидкиПрописью", обЧислоПрописью(ВыборкаСоставДоговора.СуммаСкидки, ВалютаРубли));
			ДанныеОбъекта.Вставить("СуммаСкидкиНДС", ПолучитьНДС(ВыборкаСоставДоговора.СуммаСкидки, СтавкаНДС));
			ДанныеОбъекта.Вставить("СуммаСкидкиНДСПрописью", обЧислоПрописью(ПолучитьНДС(ВыборкаСоставДоговора.СуммаСкидки, СтавкаНДС), ВалютаРубли));
			
			ИтоговаяСтоимостьАвтомобиля = ВыборкаСоставДоговора.ЦенаПродажиАвтомобиля - ВыборкаСоставДоговора.СуммаСкидокПоКоммерческимАкциям - ВыборкаСоставДоговора.СуммаСкидки;
			ДанныеОбъекта.Вставить("ИтоговаяСтоимостьАвтомобиля", ИтоговаяСтоимостьАвтомобиля);
			ДанныеОбъекта.Вставить("ИтоговаяСтоимостьАвтомобиляНДС", ПолучитьНДС(ИтоговаяСтоимостьАвтомобиля, СтавкаНДС));
			ДанныеОбъекта.Вставить("ИтоговаяСтоимостьАвтомобиляПрописью", обЧислоПрописью(ИтоговаяСтоимостьАвтомобиля, ВалютаРубли));
			ДанныеОбъекта.Вставить("ИтоговаяСтоимостьАвтомобиляНДСПрописью", обЧислоПрописью(ПолучитьНДС(ИтоговаяСтоимостьАвтомобиля, СтавкаНДС), ВалютаРубли));
			
			СтоимостьПоПрайсу = ВыборкаСоставДоговора.СтоимостьБазовойКомплектации + ВыборкаСоставДоговора.СтоимостьДопОпций;
			ДанныеОбъекта.Вставить("СтоимостьПоПрайсу", СтоимостьПоПрайсу);
			ДанныеОбъекта.Вставить("СтоимостьПоПрайсуПрописью", обЧислоПрописью(СтоимостьПоПрайсу, ВалютаРубли));
			ДанныеОбъекта.Вставить("СтоимостьПоПрайсуНДС", ПолучитьНДС(СтоимостьПоПрайсу, СтавкаНДС));
			ДанныеОбъекта.Вставить("СтоимостьПоПрайсуНДСПрописью", обЧислоПрописью(ПолучитьНДС(СтоимостьПоПрайсу, СтавкаНДС), ВалютаРубли));
			
			ДанныеОбъекта.Вставить("СтоимостьБазовойКомплектацииПоПрайсу", ВыборкаСоставДоговора.СтоимостьБазовойКомплектации);
			ДанныеОбъекта.Вставить("СтоимостьБазовойКомплектацииПоПрайсуПрописью", обЧислоПрописью(ВыборкаСоставДоговора.СтоимостьБазовойКомплектации, ВалютаРубли));
			ДанныеОбъекта.Вставить("СтоимостьБазовойКомплектацииПоПрайсуНДС", ПолучитьНДС(ВыборкаСоставДоговора.СтоимостьБазовойКомплектации, СтавкаНДС));
			ДанныеОбъекта.Вставить("СтоимостьБазовойКомплектацииПоПрайсуНДСПрописью", обЧислоПрописью(ПолучитьНДС(ВыборкаСоставДоговора.СтоимостьБазовойКомплектации, СтавкаНДС), ВалютаРубли));
			
			СтоимостьБазовойКомплектации = ВыборкаСоставДоговора.СтоимостьБазовойКомплектации + ВыборкаСоставДоговора.СуммаДоставки - ВыборкаСоставДоговора.СуммаСкидки;
			ДанныеОбъекта.Вставить("СтоимостьБазовойКомплектации", СтоимостьБазовойКомплектации);
			ДанныеОбъекта.Вставить("СтоимостьБазовойКомплектацииПрописью", обЧислоПрописью(СтоимостьБазовойКомплектации, ВалютаРубли));
			ДанныеОбъекта.Вставить("СтоимостьБазовойКомплектацииНДС", ПолучитьНДС(СтоимостьБазовойКомплектации, СтавкаНДС));
			ДанныеОбъекта.Вставить("СтоимостьБазовойКомплектацииНДСПрописью", обЧислоПрописью(ПолучитьНДС(СтоимостьБазовойКомплектации, СтавкаНДС), ВалютаРубли));
			
			ДанныеОбъекта.Вставить("СтоимостьАвтомобиляБезОборудования", ВыборкаСоставДоговора.СуммаАвтомобиляИтого);
			ДанныеОбъекта.Вставить("СтоимостьАвтомобиляБезОборудованияПрописью", обЧислоПрописью(ВыборкаСоставДоговора.СуммаАвтомобиляИтого, ВалютаРубли));
			ДанныеОбъекта.Вставить("СтоимостьАвтомобиляБезОборудованияНДС", ПолучитьНДС(ВыборкаСоставДоговора.СуммаАвтомобиляИтого, СтавкаНДС));
			ДанныеОбъекта.Вставить("СтоимостьАвтомобиляБезОборудованияНДСПрописью", обЧислоПрописью(ПолучитьНДС(ВыборкаСоставДоговора.СуммаАвтомобиляИтого, СтавкаНДС), ВалютаРубли));
			
			ДанныеОбъекта.Вставить("СписокДополнительныхОпций", ПолучитьТекстДопОпции(Выборка.ДопОпцииАвтомобилей.Выбрать(), ВыборкаСоставДоговора.Идентификатор));
			ДанныеОбъекта.Вставить("МаркированныйСписокДополнительныхОпций", ПолучитьСписокДопОпции(Выборка.ДопОпцииАвтомобилей.Выбрать(), ВыборкаСоставДоговора.Идентификатор));
			ДанныеОбъекта.Вставить("СтоимостьДопОпций", ВыборкаСоставДоговора.СтоимостьДопОпций);
			ДанныеОбъекта.Вставить("СтоимостьДопОпцийПрописью", обЧислоПрописью(ВыборкаСоставДоговора.СтоимостьДопОпций, ВалютаРубли));
			ДанныеОбъекта.Вставить("СтоимостьДопОпцийНДС", ПолучитьНДС(ВыборкаСоставДоговора.СтоимостьДопОпций, СтавкаНДС));
			ДанныеОбъекта.Вставить("СтоимостьДопОпцийНДСПрописью", обЧислоПрописью(ПолучитьНДС(ВыборкаСоставДоговора.СтоимостьДопОпций, СтавкаНДС), ВалютаРубли));
			
			ДанныеОбъекта.Вставить("СписокОпцийДилера", ПолучитьТекстОпцииДилера(Выборка.УстановленноеОборудование.Выбрать(), ВыборкаСоставДоговора.Идентификатор));
			ДанныеОбъекта.Вставить("СтоимостьОпцийДилера", ВыборкаСоставДоговора.СтоимостьОпцийДилера);
			ДанныеОбъекта.Вставить("СтоимостьОпцийДилераПрописью", обЧислоПрописью(ВыборкаСоставДоговора.СтоимостьОпцийДилера, ВалютаРубли));
			ДанныеОбъекта.Вставить("СтоимостьОпцийДилераНДС", ПолучитьНДС(ВыборкаСоставДоговора.СтоимостьОпцийДилера, СтавкаНДС));
			ДанныеОбъекта.Вставить("СтоимостьОпцийДилераНДСПрописью", обЧислоПрописью(ПолучитьНДС(ВыборкаСоставДоговора.СтоимостьОпцийДилера, СтавкаНДС), ВалютаРубли));
			
			ДанныеОбъекта.Вставить("СписокОпцийДилераДляУстановки", ПолучитьТекстОпцииДилера(Выборка.ОборудованиеДляУстановки.Выбрать(), ВыборкаСоставДоговора.Идентификатор));
			ДанныеОбъекта.Вставить("СтоимостьОпцийДилераДляУстановки", ВыборкаСоставДоговора.СтоимостьОпцийДилера);
			ДанныеОбъекта.Вставить("СтоимостьОпцийДилераДляУстановкиПрописью", обЧислоПрописью(ВыборкаСоставДоговора.СтоимостьОпцийДилера, ВалютаРубли));
			ДанныеОбъекта.Вставить("СтоимостьОпцийДилераДляУстановкиНДС", ПолучитьНДС(ВыборкаСоставДоговора.СтоимостьОпцийДилера, СтавкаНДС));
			ДанныеОбъекта.Вставить("СтоимостьОпцийДилераДляУстановкиНДСПрописью", обЧислоПрописью(ПолучитьНДС(ВыборкаСоставДоговора.СтоимостьОпцийДилера, СтавкаНДС), ВалютаРубли));
			
			// { DMSREN-1159. Тег "ЗаполнениеСуммаОсталось" 
			УчитыватьВДоговореСтоимостьАвтомобиляТрейдИнКакПредоплату = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].УчитыватьВДоговореСтоимостьАвтомобиляТрейдИнКакПредоплату;
			ВсегоОплачено = ВыборкаСоставДоговора.СуммаАвансаПоАвтомобилю+?(УчитыватьВДоговореСтоимостьАвтомобиляТрейдИнКакПредоплату,ВыборкаСоставДоговора.СтоимостьВыкупленногоАвтомобиля,0);
			СуммаОсталось = Выборка.СуммаДоговора - ВсегоОплачено;
			ДанныеОбъекта.Вставить("СуммаОсталось", СуммаОсталось);
			// DMSREN-1159 }
			
			//ПТС
			
			ДанныеОбъекта.Вставить("МаркаМодельПТС", ВыборкаСоставДоговора.МаркаМодельПТС);
			ДанныеОбъекта.Вставить("ТипПТС", ВыборкаСоставДоговора.ТипПТС);
			ДанныеОбъекта.Вставить("КатегорияПТС", ВыборкаСоставДоговора.КатегорияПТС);
			ДанныеОбъекта.Вставить("ГодИзготовленияПТС", ВыборкаСоставДоговора.ГодИзготовленияПТС);
			ДанныеОбъекта.Вставить("НомерДвигателяПТС", ВыборкаСоставДоговора.НомерДвигателяПТС);
			ДанныеОбъекта.Вставить("НомерШассиПТС", ВыборкаСоставДоговора.НомерШассиПТС);
			ДанныеОбъекта.Вставить("НомерКузоваПТС", ВыборкаСоставДоговора.НомерКузоваПТС);
			ДанныеОбъекта.Вставить("ЦветКузоваПТС", ВыборкаСоставДоговора.ЦветКузоваПТС);
			ДанныеОбъекта.Вставить("МощностьДвигателяПТС", ВыборкаСоставДоговора.МощностьДвигателяПТС);
			ДанныеОбъекта.Вставить("РабочийОбъемДвигателяПТС", ВыборкаСоставДоговора.РабочийОбъемДвигателяПТС);
			ДанныеОбъекта.Вставить("ТипДвигателяПТС", ВыборкаСоставДоговора.ТипДвигателяПТС);
			ДанныеОбъекта.Вставить("ЭкологическийКлассДвигателяПТС", ВыборкаСоставДоговора.ЭкологическийКлассДвигателяПТС);
			ДанныеОбъекта.Вставить("ПТС", ВыборкаСоставДоговора.ПТС);
			ДанныеОбъекта.Вставить("ОрганизацияИзготовительПТС", ВыборкаСоставДоговора.ОрганизацияИзготовительПТС);
			ДанныеОбъекта.Вставить("ГарантияПТС", ВыборкаСоставДоговора.ГарантияПТС);
			ДанныеОбъекта.Вставить("РазрешеннаяМаксимальнаяМассаПТС", ВыборкаСоставДоговора.РазрешеннаяМаксимальнаяМассаПТС);
			ДанныеОбъекта.Вставить("МассаБезНагрузкиПТС", ВыборкаСоставДоговора.МассаБезНагрузкиПТС);
			ДанныеОбъекта.Вставить("ОдобрениеТипаТСПТС", ВыборкаСоставДоговора.ОдобрениеТипаТСПТС);
			ДанныеОбъекта.Вставить("МодельДвигателяПТС", ВыборкаСоставДоговора.МодельДвигателяПТС);
			ДанныеОбъекта.Вставить("Оттенок", ВыборкаСоставДоговора.Оттенок);
			Если ЗначениеЗаполнено(ВыборкаСоставДоговора.ДатаПТС) Тогда
				ДанныеОбъекта.Вставить("ДатаПТС", Формат(ВыборкаСоставДоговора.ДатаПТС,"ДФ=""дд.ММ.гггг"""));
			Иначе
				ДанныеОбъекта.Вставить("ДатаПТС", " ");
			КонецЕсли;
			ДанныеОбъекта.Вставить("АдресИзготовителяПТС", ВыборкаСоставДоговора.АдресИзготовителяПТС);
			
			//ВидАвтомобиля = ОпределитьВидАвтомобиля(Выборка.СоставДоговора[0].Автомобиль);			
			ВидАвтомобиля = ОпределитьВидАвтомобиля(ВыборкаСоставДоговора.Автомобиль);
			
			Если Выборка.ДилерскийЦентр.Продажи_ИспользоватьДополнительныеРеквизитыДоговораКП Тогда
				
				ДанныеОбъекта.Вставить("ОрганизацияНаименованиеПолное", Выборка.ДилерНаименованиеОрганизации);
				ДанныеОбъекта.Вставить("Месторасположение",Выборка.ДилерГород);
				
				Пробег = ЧтениеЗначенияРегистраСведения(ВыборкаСоставДоговора.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
				Если Пробег <> Неопределено и Пробег > 0 Тогда
					ДанныеОбъекта.Вставить("СПробегом", Пробег);
				Иначе
					ДанныеОбъекта.Вставить("СПробегом", "");	
				КонецЕсли;
				
				ГосУтилизация = Перечисления.ВидАвтомобиля.DMS_ГосУтилизация;
				Консигнация   = Перечисления.ВидАвтомобиля.DMS_Консигнация;
				Конверсия     = Перечисления.ВидАвтомобиля.DMS_Конверсия;
				Комиссия      = Перечисления.ВидАвтомобиля.DMS_Комиссия;
				ДемоПродажа   = Перечисления.ВидАвтомобиля.DMS_Демонстрационный;
				БУ   		  = Перечисления.ВидАвтомобиля.АвтомобильСПробегом;
					  				
				ЕстьПакетProtection = ПроверитьНаличиеПакетаProtection(Выборка.ДопОпцииАвтомобилей.Выбрать());
				ДанныеОбъекта.Вставить("ПредметДоговораКонецП14","");
				Если ВидАвтомобиля = ГосУтилизация Или ВидАвтомобиля = Консигнация Или ВидАвтомобиля = Конверсия Тогда
					Если ЕстьПакетProtection Тогда
						ДанныеОбъекта.Вставить("ПредметДоговораКонецП12",Справочники.Renault_Advanced_ПунктыДоговора.ПредметДоговораКонецProtection12.Содержание); 
						ДанныеОбъекта.Вставить("ПредметДоговораКонецП121",Справочники.Renault_Advanced_ПунктыДоговора.ПредметДоговораКонецProtection121.Содержание); 
						ДанныеОбъекта.Вставить("ПредметДоговораКонецП13",Справочники.Renault_Advanced_ПунктыДоговора.ПредметДоговораКонецProtection13.Содержание); 
						ДанныеОбъекта.Вставить("ПредметДоговораКонецП14",Справочники.Renault_Advanced_ПунктыДоговора.ПредметДоговораКонецProtection14.Содержание);						
					Иначе 
						ДанныеОбъекта.Вставить("ПредметДоговораКонецП12",Справочники.Renault_Advanced_ПунктыДоговора.ПредметДоговораКонецКонсигнацияУтилизацияКонверсия12.Содержание);
						ДанныеОбъекта.Вставить("ПредметДоговораКонецП121",Справочники.Renault_Advanced_ПунктыДоговора.ПредметДоговораКонецКонсигнацияУтилизацияКонверсия13.Содержание);
						ДанныеОбъекта.Вставить("ПредметДоговораКонецП13",Справочники.Renault_Advanced_ПунктыДоговора.ПредметДоговораКонецКонсигнацияУтилизацияКонверсия14.Содержание);
					КонецЕсли;
				Иначе
					ДанныеОбъекта.Вставить("ПредметДоговораКонецП12",Справочники.Renault_Advanced_ПунктыДоговора.ПредметДоговораКонецОбщий12.Содержание);
					ДанныеОбъекта.Вставить("ПредметДоговораКонецП121",Справочники.Renault_Advanced_ПунктыДоговора.ПредметДоговораКонецОбщий13.Содержание);
					ДанныеОбъекта.Вставить("ПредметДоговораКонецП13",Справочники.Renault_Advanced_ПунктыДоговора.ПредметДоговораКонецОбщий14.Содержание);
				КонецЕсли;
				
				СуммаСкидки = СуммаСкидки(Выборка.ДилерскийЦентр,ВыборкаСоставДоговора.Автомобиль);
				ПризнакПрограммаОбновленияАвтомобилей = ЗначениеЗаполнено(ВыборкаСоставДоговора.ЗаявкаНаТрейдИн);//Или признак Утилизации
				
				ДанныеОбъекта.Вставить("СуммаДоговораП21","");
				ДанныеОбъекта.Вставить("СуммаДоговораП22","");
				ДанныеОбъекта.Вставить("СуммаДоговораП23","");
				ДанныеОбъекта.Вставить("СуммаДоговораОплата","");
				ДанныеОбъекта.Вставить("СписокХарактеристикаСдаваемогоАвто",Новый Структура("МассивЗначений, ЗаголовокСписка", Новый Массив, ""));
				ДанныеОбъекта.Вставить("СписокЗначениеСдаваемогоАвто",Новый Структура("МассивЗначений, ЗаголовокСписка", Новый Массив, ""));
				НомерПункта = 3;
				Если Выборка.Организация.ОсвобожденОтНДС ИЛИ ВидАвтомобиля = Комиссия Тогда
					ДанныеОбъекта.Вставить("СуммаДоговораП21",Справочники.Renault_Advanced_ПунктыДоговора.СуммаДоговоровКомиссияП21.Содержание);
					ДанныеОбъекта.Вставить("СуммаДоговораП22",Справочники.Renault_Advanced_ПунктыДоговора.СуммаДоговоровКомиссияП22.Содержание);
				ИначеЕсли ВидАвтомобиля = ГосУтилизация Или ВидАвтомобиля = Консигнация Или ВидАвтомобиля = ДемоПродажа Или ВидАвтомобиля = Конверсия Тогда
					Если ПризнакПрограммаОбновленияАвтомобилей Тогда
						ДанныеОбъекта.Вставить("СуммаДоговораП21",Справочники.Renault_Advanced_ПунктыДоговора.СуммаДоговораДанныеСдаваемогоАвто.Содержание);
						
						Если ЗначениеЗаполнено(ВыборкаСоставДоговора.ЗаявкаНаТрейдИн) Тогда
							
							ЗаявкаНаТрейдИн = ВыборкаСоставДоговора.ЗаявкаНаТрейдИн;
							Запрос = Новый Запрос;
							Запрос.Текст = 
							"ВЫБРАТЬ
							|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата КАК Дата,
							|	ПоступлениеАвтомобилейАвтомобили.Ссылка.ДоговорВзаиморасчетов.НомерДоговора КАК НомерДоговора
							|ИЗ
							|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
							|ГДЕ
							|	ПоступлениеАвтомобилейАвтомобили.Автомобиль = &Автомобиль";
							
							Запрос.УстановитьПараметр("Автомобиль", ЗаявкаНаТрейдИн.Автомобиль);
							
							РезультатЗапроса = Запрос.Выполнить();
							
							ВыборкаПоступлений = РезультатЗапроса.Выбрать();
							НомерДКП = "";	
							ДатаДКП = "";
							ДатаСдачи = "";
							Пока ВыборкаПоступлений.Следующий() Цикл
								НомерДКП = ВыборкаПоступлений.НомерДоговора;
								ДатаДКП  = ВыборкаПоступлений.Дата;
								ДатаСдачи = ВыборкаПоступлений.Дата;
							КонецЦикла;
							
							ДанныеОбъекта.Вставить("ПрограммаСобственник",Строка(ЗаявкаНаТрейдИн.Клиент));
							ДанныеОбъекта.Вставить("ПрограммаНачалаоВладения",ЗаявкаНаТрейдИн.НачалаоВладения);
							ДанныеОбъекта.Вставить("ПрограммаДоверенность",ЗаявкаНаТрейдИн.Доверенность);
							ДанныеОбъекта.Вставить("ПрограммаГодВыпуска",ЗаявкаНаТрейдИн.ГодВыпуска);
							ДанныеОбъекта.Вставить("ПрограммаМодель",Строка(ЗаявкаНаТрейдИн.Автомобиль.Модель));
							ДанныеОбъекта.Вставить("ПрограммаVIN",ЗаявкаНаТрейдИн.VIN);
							ДанныеОбъекта.Вставить("ПрограммаГосНомер",ЗаявкаНаТрейдИн.ГосНомер);
							ДанныеОбъекта.Вставить("ПрограммаНомерКузова",ЗаявкаНаТрейдИн.НомерКузова);
							ДанныеОбъекта.Вставить("ПрограммаНомерДвигателя",ЗаявкаНаТрейдИн.НомерДвигателя);
							ДанныеОбъекта.Вставить("ПрограммаНомерШасси",ЗаявкаНаТрейдИн.НомерШасси);
							ДанныеОбъекта.Вставить("ПрограммаНомерПТС",ЗаявкаНаТрейдИн.НомерПТС);
							ДанныеОбъекта.Вставить("ПрограммаДатаПТС",ЗаявкаНаТрейдИн.ДатаПТС);
							ДанныеОбъекта.Вставить("ПрограммаПробег",ЗаявкаНаТрейдИн.Пробег);
							ДанныеОбъекта.Вставить("ПрограммаВозрастАвто",Год(ТекущаяДата()) - ЗаявкаНаТрейдИн.ГодВыпуска);
							ДанныеОбъекта.Вставить("ПрограммаКоличествоВладельцев",ЗаявкаНаТрейдИн.КоличествоВладельцевПоПТС);
							ДанныеОбъекта.Вставить("ПрограммаНомерДоговора",ЗаявкаНаТрейдИн.НомерДоговора);
							ДанныеОбъекта.Вставить("СуммаДоговораП211",Справочники.Renault_Advanced_ПунктыДоговора.СуммаДоговораТрейдИнП211.Содержание);
							ДанныеОбъекта.Вставить("СуммаДоговораП22",Справочники.Renault_Advanced_ПунктыДоговора.СуммаДоговораТрейдИнП22.Содержание);
							ДанныеОбъекта.Вставить("ВидДоговора","Номер и дата договора купли-продажи автомобиля");
														
							//// Утилизация пока не разработана	
							//ИначеЕсли Программа = Утилизация Тогда
							//ДанныеОбъекта.Вставить("СуммаДоговораП22",Справочники.Renault_Advanced_ПунктыДоговора.СуммаДоговораУтилизацияП22.Содержание);
							//ДанныеОбъекта.Вставить("ЗаполнениеСписокХарактеристикаСдаваемогоАвто",ПолучитьСписокХарактеристикСдаваемогоАвто(Ложь));
							//ДанныеОбъекта.Вставить("ЗаполнениеСписокЗначениеСдаваемогоАвто",ПолучитьСписокЗначениеСдаваемогоАвто(Ложь));
							//ДанныеОбъекта.Вставить("ВидДоговора","Номер и дата акта сдачи Утилизируемого автомобиля");
							
							// Трояновский К.Е. 15.02.2019 11:30:18 {
							// Закомментировано по DMSCOR-1087
							//Если ВыборкаПоступлений.Дата >= '20190101' Тогда
							//	СуммаНДС_Зачет =  Окр(ВыборкаСоставДоговора.ЗаявкаНаТрейдИн.ЦенаВыкупа*20/120,2);
							//Иначе
							//	СуммаНДС_Зачет =  Окр(ВыборкаСоставДоговора.ЗаявкаНаТрейдИн.ЦенаВыкупа*18/118,2);
							//КонецЕсли;
							//
							//Если Выборка.ДатаДоговора >= '20190101' Тогда
							//	НДС_СуммаДоплаты = Окр((Выборка.СуммаДоговора-СуммаСкидки)*20/120,2);
							//Иначе
							//	НДС_СуммаДоплаты = Окр((Выборка.СуммаДоговора-СуммаСкидки)*18/118,2);
							//КонецЕсли;
							СуммаНДС_Зачет =  Окр(ВыборкаСоставДоговора.ЗаявкаНаТрейдИн.ЦенаВыкупа*СтавкаНДС.Ставка/(100 + СтавкаНДС.Ставка),2);
							НДС_СуммаДоплаты = Окр((Выборка.СуммаДоговора-СуммаСкидки)*СтавкаНДС.Ставка/(100 + СтавкаНДС.Ставка),2);
							// Трояновский К.Е. 15.02.2019 11:30:18 }
							
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[ДатаВыдачиСвидОРег]",ЗаявкаНаТрейдИн.ДатаВыдачиСвидОРег);
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[ДатаСдачи]",ДатаСдачи);
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[НомерДКП]",НомерДКП);
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[ДатаДКП]",ДатаДКП);
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[ЦенаАвтоБезОпцийИДоставки]",ВыборкаСоставДоговора.СтоимостьБазовойКомплектации);
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[ЦенаБезОпцийИДоставкиПрописью]",ВывестиПрописьюЦелуюЧасть(ВыборкаСоставДоговора.СтоимостьБазовойКомплектации));
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[ЦенаБезОпцийИДоставкиКопейки]",ВывестиКопейки(ВыборкаСоставДоговора.СтоимостьБазовойКомплектации));
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[СтоимостьДопОпций]",ВыборкаСоставДоговора.СтоимостьДопОпций);
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[СтоимостьДопОпцийПрописью]",ВывестиПрописьюЦелуюЧасть(ВыборкаСоставДоговора.СтоимостьДопОпций));
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[СтоимостьДопОпцийКопейки]",ВывестиКопейки(ВыборкаСоставДоговора.СтоимостьДопОпций));
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[АкцияРено]","стоимости скидок по акции в размере " + Цел(Выборка.СуммаАкцииРено) + " (" + ВывестиПрописьюЦелуюЧасть(Выборка.СуммаАкцииРено) + ") руб. " + ВывестиКопейки(Выборка.СуммаАкцииРено) + " коп. с НДС, ");
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[ДопОборудование]","стоимости дополнительного оборудования в размере " + Цел(ВыборкаСоставДоговора.СтоимостьОборудованияДляУстановки) + " (" + 
							ВывестиПрописьюЦелуюЧасть(ВыборкаСоставДоговора.СтоимостьОборудованияДляУстановки) + ") руб. " + ВывестиКопейки(ВыборкаСоставДоговора.СтоимостьОборудованияДляУстановки) + " 00 коп. с НДС");
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[СуммаСкидок]",СуммаСкидки);
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[СуммаСкидокПрописью]",ВывестиПрописьюЦелуюЧасть(СуммаСкидки));
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[СуммаСкидокКопейки]",ВывестиКопейки(СуммаСкидки));
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[ОбщаяЦенаАвто]",ВыборкаСоставДоговора.ЗаявкаНаТрейдИн.ЦенаВыкупа);
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[ОбщаяЦенаАвтоПрописью]",ВывестиПрописьюЦелуюЧасть(ВыборкаСоставДоговора.ЗаявкаНаТрейдИн.ЦенаВыкупа));
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[ОбщаяЦенаАвтоКопейки]",ВывестиКопейки(ВыборкаСоставДоговора.ЗаявкаНаТрейдИн.ЦенаВыкупа)); 
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[ЦенаПринятияВЗачет]",ВыборкаСоставДоговора.ЗаявкаНаТрейдИн.ЦенаВыкупа);
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[ЦенаПринятияВЗачетПрописью]",ВывестиПрописьюЦелуюЧасть(ВыборкаСоставДоговора.ЗаявкаНаТрейдИн.ЦенаВыкупа));
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[ЦенаПринятияВЗачетКопейки]",ВывестиКопейки(ВыборкаСоставДоговора.ЗаявкаНаТрейдИн.ЦенаВыкупа));
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[СуммаНДС_Зачет]",СуммаНДС_Зачет);
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[СуммаНДС_ЗачетПрописью]",ВывестиПрописьюЦелуюЧасть(СуммаНДС_Зачет));
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[СуммаНДС_ЗачетКопейки]",ВывестиКопейки(СуммаНДС_Зачет));
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[РазмерСкидки]",СуммаСкидки);
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[РазмерСкидкиПрописью]",ВывестиПрописьюЦелуюЧасть(СуммаСкидки));
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[РазмерСкидкиКопейки]",ВывестиКопейки(СуммаСкидки));
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[VIN]",ВыборкаСоставДоговора.ЗаявкаНаТрейдИн.VIN);
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[СуммаДоплаты]",Выборка.СуммаДоговора-СуммаСкидки);
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[СуммаДоплатыПрописью]",ВывестиПрописьюЦелуюЧасть(Выборка.СуммаДоговора-СуммаСкидки));
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[СуммаДоплатыКопейки]",ВывестиКопейки(Выборка.СуммаДоговора-СуммаСкидки));
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[НДС_СуммаДоплаты]",НДС_СуммаДоплаты);
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[НДС_СуммаДоплатыПрописью]",ВывестиПрописьюЦелуюЧасть(НДС_СуммаДоплаты));
							ДанныеОбъекта.СуммаДоговораП211 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП211,"[НДС_СуммаДоплатыКопейки]",ВывестиКопейки(НДС_СуммаДоплаты));
							
						КонецЕсли;
						
					Иначе
						Если Выборка.СуммаАкцииРено <> 0 Тогда 
							ДанныеОбъекта.Вставить("СуммаДоговораП21",Справочники.Renault_Advanced_ПунктыДоговора.СуммаДоговораП21_АкцияРено.Содержание);
						Иначе 
							ДанныеОбъекта.Вставить("СуммаДоговораП21",Справочники.Renault_Advanced_ПунктыДоговора.СуммаДоговораП21.Содержание);
						КонецЕсли; 
					КонецЕсли;
					
					Если НЕ ЗначениеЗаполнено(ВыборкаСоставДоговора.ЗаявкаНаТрейдИн) Тогда
						Если Выборка.СуммаАкцииРено <> 0 Тогда
							ДанныеОбъекта.Вставить("СуммаДоговораП22",Справочники.Renault_Advanced_ПунктыДоговора.СуммаДоговораП22АкцияРено.Содержание);
							
						Иначе 
							ДанныеОбъекта.Вставить("СуммаДоговораП22",Справочники.Renault_Advanced_ПунктыДоговора.СуммаДоговораП22.Содержание);
						КонецЕсли;
					КонецЕсли;
					
				ИначеЕсли ВидАвтомобиля = БУ Тогда
					ДанныеОбъекта.Вставить("СуммаДоговораП21",Справочники.Renault_Advanced_ПунктыДоговора.СуммаДоговораП21.Содержание);
					ДанныеОбъекта.Вставить("СуммаДоговораП22",Справочники.Renault_Advanced_ПунктыДоговора.СуммаДоговораП22.Содержание);
					////Утилизация пока не разработана
					//Если Программа = Утилизация Тогда
					//ДанныеОбъекта.Вставить("СуммаДоговораП23",Справочники.Renault_Advanced_ПунктыДоговора.СуммаДоговораП23Утилизация.Содержание);
					//НомерПункта = НомерПункта + 2;
					//КонецЕсли;
				Иначе
					ДанныеОбъекта.Вставить("СуммаДоговораП21",Справочники.Renault_Advanced_ПунктыДоговора.СуммаДоговораП21.Содержание);
					ДанныеОбъекта.Вставить("СуммаДоговораП22",Справочники.Renault_Advanced_ПунктыДоговора.СуммаДоговораП22.Содержание);
				КонецЕсли;
				// Трояновский К.Е. 15.02.2019 11:32:42 {
				// Закомментировано по DMSCOR-1087
				//Если Выборка.ДатаДоговора >= '20190101' Тогда
				//	СуммаНДС = Окр(Выборка.СуммаДоговора*20/120,2);
				//Иначе
				//	СуммаНДС = Окр(Выборка.СуммаДоговора*18/118,2);
				//КонецЕсли;				
				СуммаНДС = Окр(Выборка.СуммаДоговора*СтавкаНДС.Ставка/(100 + СтавкаНДС.Ставка),2);
				// Трояновский К.Е. 15.02.2019 11:32:42 }
				ДанныеОбъекта.СуммаДоговораП21 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП21,"[ДоговорСумма]",Выборка.СуммаДоговора);
				ДанныеОбъекта.СуммаДоговораП21 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП21,"[ДоговорСуммаПрописью]",ВывестиПрописьюЦелуюЧасть(Выборка.СуммаДоговора));
				ДанныеОбъекта.СуммаДоговораП21 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП21,"[ДоговорСуммаКопейки]",ВывестиКопейки(Выборка.СуммаДоговора));
				ДанныеОбъекта.СуммаДоговораП21 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП21,"[СуммаНДС]",СуммаНДС);
				ДанныеОбъекта.СуммаДоговораП21 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП21,"[СуммаНДСПрописью]",ВывестиПрописьюЦелуюЧасть(СуммаНДС));
				ДанныеОбъекта.СуммаДоговораП21 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП21,"[СуммаНДСКопейки]",ВывестиКопейки(СуммаНДС));
				ДанныеОбъекта.СуммаДоговораП22 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП22,"[СуммаНДС]",СуммаНДС);
				ДанныеОбъекта.СуммаДоговораП22 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП22,"[СуммаНДСПрописью]",ВывестиПрописьюЦелуюЧасть(СуммаНДС));
				ДанныеОбъекта.СуммаДоговораП22 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП22,"[СуммаНДСКопейки]",ВывестиКопейки(СуммаНДС));
				ДанныеОбъекта.СуммаДоговораП22 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП22,"[ОбщаяЦена]",Выборка.СуммаДоговора);
				ДанныеОбъекта.СуммаДоговораП22 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП22,"[ОбщаяЦенаСуммаПрописью]",ВывестиПрописьюЦелуюЧасть(Выборка.СуммаДоговора));
				ДанныеОбъекта.СуммаДоговораП22 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП22,"[ОбщаяЦенаСуммаКопейки]",ВывестиКопейки(Выборка.СуммаДоговора));
				ДанныеОбъекта.СуммаДоговораП22 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП22,"[ОбщаяЦенаСуммаНДС]",СуммаНДС);
				ДанныеОбъекта.СуммаДоговораП22 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП22,"[ОбщаяЦенаСуммаНДСПрописью]",ВывестиПрописьюЦелуюЧасть(СуммаНДС));
				ДанныеОбъекта.СуммаДоговораП22 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП22,"[ОбщаяЦенаСуммаНДСКопейки]",ВывестиКопейки(СуммаНДС));
				ДанныеОбъекта.СуммаДоговораП22 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП22,"[СуммаСкидкиПоАкцииРено]",Выборка.СуммаАкцииРено);
				ДанныеОбъекта.СуммаДоговораП22 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП22,"[СуммаПоАкцииРеноПрописью]",ВывестиПрописьюЦелуюЧасть(Выборка.СуммаАкцииРено));
				ДанныеОбъекта.СуммаДоговораП22 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП22,"[ИтоговаяЦена]",Выборка.СуммаДоговора);
				ДанныеОбъекта.СуммаДоговораП22 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП22,"[ИтоговаяЦенаПрописью]",ВывестиПрописьюЦелуюЧасть(Выборка.СуммаДоговора));
				ДанныеОбъекта.СуммаДоговораП22 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП22,"[ИтоговаяЦенаСуммаКопейки]",ВывестиКопейки(Выборка.СуммаДоговора));
				ДанныеОбъекта.СуммаДоговораП22 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП22,"[ИтоговаяЦенаСуммаНДС]",СуммаНДС);
				ДанныеОбъекта.СуммаДоговораП22 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП22,"[ИтоговаяЦенаСуммаНДСПрописью]",ВывестиПрописьюЦелуюЧасть(СуммаНДС));
				ДанныеОбъекта.СуммаДоговораП22 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП22,"[ИтоговаяЦенаСуммаНДСКопейки]",ВывестиКопейки(СуммаНДС));
				ДанныеОбъекта.СуммаДоговораП22 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП22,"[ДоговорСумма]",Выборка.СуммаДоговора);
				ДанныеОбъекта.СуммаДоговораП22 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП22,"[ДоговорСуммаПрописью]",ВывестиПрописьюЦелуюЧасть(Выборка.СуммаДоговора));
				ДанныеОбъекта.СуммаДоговораП22 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП22,"[ДоговорСуммаКопейки]",ВывестиКопейки(Выборка.СуммаДоговора));
				ДанныеОбъекта.СуммаДоговораП22 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП22,"[СуммаНДС]",СуммаНДС);
				ДанныеОбъекта.СуммаДоговораП22 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП22,"[СуммаНДСПрописью]",ВывестиПрописьюЦелуюЧасть(СуммаНДС)); 
				ДанныеОбъекта.СуммаДоговораП22 = СтрЗаменить(ДанныеОбъекта.СуммаДоговораП22,"[СуммаНДСКопейки]",ВывестиКопейки(СуммаНДС));
				
				//Заполнение полей в пунктах договора п 2.1 и 2.2
				
				//Раздел "Оплата"
				ДанныеОбъекта.Вставить("СуммаДоговораОплата", Справочники.Renault_Advanced_ПунктыДоговора.СуммаДоговораОплата.Содержание);
				ДанныеОбъекта.СуммаДоговораОплата = СтрЗаменить(ДанныеОбъекта.СуммаДоговораОплата, "[НомерПункта]", НомерПункта);
				
				Если Выборка.СуммаАванса = 0 Тогда
					ДанныеОбъекта.Вставить("ОплатаПредоплата", "");
				Иначе
					ДанныеОбъекта.СуммаДоговораОплата = ДанныеОбъекта.СуммаДоговораОплата + " "+ Справочники.Renault_Advanced_ПунктыДоговора.ОплатаПредоплата.Содержание;
					ДанныеОбъекта.СуммаДоговораОплата = СтрЗаменить(ДанныеОбъекта.СуммаДоговораОплата,"[ПредоплатаСумма]",Выборка.СуммаАванса); 
					ДанныеОбъекта.СуммаДоговораОплата = СтрЗаменить(ДанныеОбъекта.СуммаДоговораОплата,"[ПредоплатаСуммаПрописью]",ВывестиПрописьюЦелуюЧасть(Выборка.СуммаАванса));
					ДанныеОбъекта.СуммаДоговораОплата = СтрЗаменить(ДанныеОбъекта.СуммаДоговораОплата,"[ПредоплатаСуммаКопейки]",ВывестиКопейки(Выборка.СуммаАванса));
					
					//ДанныеОбъекта.Вставить("ОплатаПредоплата",Справочники.Renault_Advanced_ПунктыДоговора.ОплатаПредоплата.Содержание);
					//ДанныеОбъекта.ОплатаПредоплата = СтрЗаменить(ДанныеОбъекта.ОплатаПредоплата,"[ПредоплатаСумма]",Выборка.СуммаАванса); 
					//ДанныеОбъекта.ОплатаПредоплата = СтрЗаменить(ДанныеОбъекта.ОплатаПредоплата,"[ПредоплатаСуммаПрописью]",ВывестиПрописьюЦелуюЧасть(Выборка.СуммаАванса));
					//ДанныеОбъекта.ОплатаПредоплата = СтрЗаменить(ДанныеОбъекта.ОплатаПредоплата,"[ПредоплатаСуммаКопейки]",ВывестиКопейки(Выборка.СуммаАванса));
				КонецЕсли;
				
				
				ДанныеОбъекта.Вставить("ОплатаУтилизация", "");  //утилизация пока не разработана
				
				ДанныеОбъекта.Вставить("ОплатаОстаток", "");
				Если Выборка.СуммаДоговора > Выборка.СуммаАванса Тогда
					ОстатокСумма = Выборка.СуммаДоговора - Выборка.СуммаАванса;
					ДанныеОбъекта.СуммаДоговораОплата = ДанныеОбъекта.СуммаДоговораОплата + " "+ Справочники.Renault_Advanced_ПунктыДоговора.ОплатаОстаток.Содержание;
					ДанныеОбъекта.СуммаДоговораОплата = СтрЗаменить(ДанныеОбъекта.СуммаДоговораОплата,"[ОстатокСумма]",ОстатокСумма);
					ДанныеОбъекта.СуммаДоговораОплата = СтрЗаменить(ДанныеОбъекта.СуммаДоговораОплата,"[ОстатокСуммаПрописью]",ВывестиПрописьюЦелуюЧасть(ОстатокСумма));
					ДанныеОбъекта.СуммаДоговораОплата = СтрЗаменить(ДанныеОбъекта.СуммаДоговораОплата,"[ОстатокСуммаКопейки]",ВывестиКопейки(ОстатокСумма));
					ДанныеОбъекта.СуммаДоговораОплата = СтрЗаменить(ДанныеОбъекта.СуммаДоговораОплата,"[ОтсрочкаПлатежа]",?(ЗначениеЗаполнено(Выборка.ОтсрочкаПлатежа), Выборка.ОтсрочкаПлатежа,"10 (десяти)"));
					
					//ДанныеОбъекта.Вставить("ОплатаОстаток",Справочники.Renault_Advanced_ПунктыДоговора.ОплатаОстаток.Содержание);
					//ДанныеОбъекта.ОплатаОстаток = СтрЗаменить(ДанныеОбъекта.ОплатаОстаток,"[ОстатокСумма]",ОстатокСумма);
					//ДанныеОбъекта.ОплатаОстаток = СтрЗаменить(ДанныеОбъекта.ОплатаОстаток,"[ОстатокСуммаПрописью]",ВывестиПрописьюЦелуюЧасть(ОстатокСумма));
					//ДанныеОбъекта.ОплатаОстаток = СтрЗаменить(ДанныеОбъекта.ОплатаОстаток,"[ОстатокСуммаКопейки]",ВывестиКопейки(ОстатокСумма));
					//ДанныеОбъекта.ОплатаОстаток = СтрЗаменить(ДанныеОбъекта.ОплатаОстаток,"[ОтсрочкаПлатежа]",?(ЗначениеЗаполнено(Выборка.ОтсрочкаПлатежа), Выборка.ОтсрочкаПлатежа,"10 (десяти)"));
				КонецЕсли;
				
				ДанныеОбъекта.Вставить("ОплатаКредит", "");
				Если Выборка.СуммаКредита > 0 Тогда
					ДанныеОбъекта.СуммаДоговораОплата = ДанныеОбъекта.СуммаДоговораОплата + " "+ Справочники.Renault_Advanced_ПунктыДоговора.ОплатаКредит.Содержание;
					ДанныеОбъекта.СуммаДоговораОплата = СтрЗаменить(ДанныеОбъекта.СуммаДоговораОплата,"[КредитСумма]",Выборка.СуммаКредита);
					ДанныеОбъекта.СуммаДоговораОплата = СтрЗаменить(ДанныеОбъекта.СуммаДоговораОплата,"[КредитСуммаПрописью]",ВывестиПрописьюЦелуюЧасть(Выборка.СуммаКредита));
					ДанныеОбъекта.СуммаДоговораОплата = СтрЗаменить(ДанныеОбъекта.СуммаДоговораОплата,"[КредитСуммаКопейки]",ВывестиКопейки(Выборка.СуммаКредита));
					ДанныеОбъекта.СуммаДоговораОплата = СтрЗаменить(ДанныеОбъекта.СуммаДоговораОплата,"[КредитБанкНаименование]",Выборка.КредитБанкНаименование);
					
					//ДанныеОбъекта.Вставить("ОплатаКредит",Справочники.Renault_Advanced_ПунктыДоговора.ОплатаКредит.Содержание);	
					//ДанныеОбъекта.ОплатаКредит = СтрЗаменить(ДанныеОбъекта.ОплатаКредит,"[КредитСумма]",Выборка.СуммаКредита);
					//ДанныеОбъекта.ОплатаКредит = СтрЗаменить(ДанныеОбъекта.ОплатаКредит,"[КредитСуммаПрописью]",ВывестиПрописьюЦелуюЧасть(Выборка.СуммаКредита));
					//ДанныеОбъекта.ОплатаКредит = СтрЗаменить(ДанныеОбъекта.ОплатаКредит,"[КредитСуммаКопейки]",ВывестиКопейки(Выборка.СуммаКредита));
					//ДанныеОбъекта.ОплатаКредит = СтрЗаменить(ДанныеОбъекта.ОплатаКредит,"[КредитБанкНаименование]",Выборка.КредитБанкНаименование);
				КонецЕсли;
				
				СкидкаRCIСумма = СуммаСкидки(Выборка.ДилерскийЦентр, ВыборкаСоставДоговора.Автомобиль, Справочники.ТипыСкидок.СкидкаRCI);
				ДанныеОбъекта.Вставить("СуммаДоговораСкидкаRCI", "");
				
				ЕстьСкидкаRCI = Выборка.СпособОплаты = Перечисления.Renault_СпособыОплаты.РеноКредит И СкидкаRCIСумма > 0;
				Если ЕстьСкидкаRCI И НЕ ПризнакПрограммаОбновленияАвтомобилей Тогда 
					ДанныеОбъекта.СуммаДоговораОплата = ДанныеОбъекта.СуммаДоговораОплата + " "+ Справочники.Renault_Advanced_ПунктыДоговора.СуммаДоговораСкидкаRCI.Содержание;
					ДанныеОбъекта.СуммаДоговораОплата = СтрЗаменить(ДанныеОбъекта.СуммаДоговораОплата,"[НомерПункта]",НомерПункта + 1);
					ДанныеОбъекта.СуммаДоговораОплата = СтрЗаменить(ДанныеОбъекта.СуммаДоговораОплата,"[СкидкаRCIСумма]",СкидкаRCIСумма);
					ДанныеОбъекта.СуммаДоговораОплата = СтрЗаменить(ДанныеОбъекта.СуммаДоговораОплата,"[СкидкаRCIСуммаПрописью]",ВывестиПрописьюЦелуюЧасть(СкидкаRCIСумма));
					ДанныеОбъекта.СуммаДоговораОплата = СтрЗаменить(ДанныеОбъекта.СуммаДоговораОплата,"[СкидкаRCIСуммаКопейки]",ВывестиКопейки(СкидкаRCIСумма));
					//ДанныеОбъекта.Вставить("СуммаДоговораСкидкаRCI",Справочники.Renault_Advanced_ПунктыДоговора.СуммаДоговораСкидкаRCI.Содержание);
					//ДанныеОбъекта.СуммаДоговораСкидкаRCI = СтрЗаменить(ДанныеОбъекта.СуммаДоговораСкидкаRCI,"[НомерПункта]",НомерПункта + 1);
					//ДанныеОбъекта.СуммаДоговораСкидкаRCI = СтрЗаменить(ДанныеОбъекта.СуммаДоговораСкидкаRCI,"[СкидкаRCIСумма]",СкидкаRCIСумма);
					//ДанныеОбъекта.СуммаДоговораСкидкаRCI = СтрЗаменить(ДанныеОбъекта.СуммаДоговораСкидкаRCI,"[СкидкаRCIСуммаПрописью]",ВывестиПрописьюЦелуюЧасть(СкидкаRCIСумма));
					//ДанныеОбъекта.СуммаДоговораСкидкаRCI = СтрЗаменить(ДанныеОбъекта.СуммаДоговораСкидкаRCI,"[СкидкаRCIСуммаКопейки]",ВывестиКопейки(СкидкаRCIСумма));
				КонецЕсли;
				
				ДанныеОбъекта.Вставить("ДнейПередачи", "14 (четырнадцати)");
				
				Если НЕ ЗначениеЗаполнено(ДанныеОбъекта.СуммаДоговораП23) Тогда
					ДанныеОбъекта.СуммаДоговораП23 = ДанныеОбъекта.СуммаДоговораОплата;
					ДанныеОбъекта.СуммаДоговораОплата = "";	
				КонецЕсли;
				
				////Утилизация еще не разработана
				//Если Выборка.СуммаУтилизация > 0 Тогда
				//	ДанныеОбъекта.Вставить("ОплатаУтилизация",Справочники.Renault_Advanced_ПунктыДоговора.ОплатаУтилизация.Содержание);	
				//КонецЕсли;
				Если ВидАвтомобиля = Консигнация Или ВидАвтомобиля = ГосУтилизация ИЛИ ВидАвтомобиля = Конверсия Тогда
					ДанныеОбъекта.Вставить("ОбязанностиСторонПродавец411",Справочники.Renault_Advanced_ПунктыДоговора.ОбязанностиСторонПродавец411.Содержание);
					ДанныеОбъекта.Вставить("ОбязанностиСторонПродавец412",Справочники.Renault_Advanced_ПунктыДоговора.ОбязанностиСторонПродавец412.Содержание);
					ДанныеОбъекта.Вставить("ОбязанностиСторонПродавец413",Справочники.Renault_Advanced_ПунктыДоговора.ОбязанностиСторонПродавец413.Содержание);
					ДанныеОбъекта.Вставить("ОбязанностиСторонПокупатель421",Справочники.Renault_Advanced_ПунктыДоговора.ОбязанностиСторонПокупатель421.Содержание);
					ДанныеОбъекта.Вставить("ОбязанностиСторонПокупатель422",Справочники.Renault_Advanced_ПунктыДоговора.ОбязанностиСторонПокупатель422.Содержание);
					ДанныеОбъекта.Вставить("ОбязанностиСторонПокупатель423",Справочники.Renault_Advanced_ПунктыДоговора.ОбязанностиСторонПокупатель423.Содержание);
				Иначе 
					ДанныеОбъекта.Вставить("ОбязанностиСторонПродавец411",Справочники.Renault_Advanced_ПунктыДоговора.ОбязанностиСторонПродавец411.Содержание);
					ДанныеОбъекта.Вставить("ОбязанностиСторонПродавец412",Справочники.Renault_Advanced_ПунктыДоговора.ОбязанностиСторонПродавец412.Содержание);
					ДанныеОбъекта.Вставить("ОбязанностиСторонПродавец413",Справочники.Renault_Advanced_ПунктыДоговора.ОбязанностиСторонПродавец413.Содержание);
					ДанныеОбъекта.Вставить("ОбязанностиСторонПокупатель421",Справочники.Renault_Advanced_ПунктыДоговора.ОбязанностиСторонПокупатель421.Содержание);
					ДанныеОбъекта.Вставить("ОбязанностиСторонПокупатель422",Справочники.Renault_Advanced_ПунктыДоговора.ОбязанностиСторонПокупатель422.Содержание);
					ДанныеОбъекта.Вставить("ОбязанностиСторонПокупатель423",Справочники.Renault_Advanced_ПунктыДоговора.ОбязанностиСторонПокупатель423.Содержание);
				КонецЕсли;
				
				Если Выборка.Коммерческий Тогда
					ДанныеОбъекта.Вставить("Гарантия611",Справочники.Renault_Advanced_ПунктыДоговора.ГарантияКоммерческий611.Содержание);
					ДанныеОбъекта.Вставить("Гарантия612",Справочники.Renault_Advanced_ПунктыДоговора.ГарантияКоммерческий612.Содержание);
					ДанныеОбъекта.Вставить("Гарантия613",Справочники.Renault_Advanced_ПунктыДоговора.ГарантияКоммерческий613.Содержание);
					ДанныеОбъекта.Вставить("Гарантия62",Справочники.Renault_Advanced_ПунктыДоговора.ГарантияКоммерческий62.Содержание);
					ДанныеОбъекта.Вставить("Гарантия621",Справочники.Renault_Advanced_ПунктыДоговора.ГарантияКоммерческий621.Содержание);
					ДанныеОбъекта.Вставить("Гарантия66",Справочники.Renault_Advanced_ПунктыДоговора.ГарантияКоммерческий66.Содержание);
				Иначе	
					ДанныеОбъекта.Вставить("Гарантия611",Справочники.Renault_Advanced_ПунктыДоговора.Гарантия611.Содержание);
					ДанныеОбъекта.Вставить("Гарантия612",Справочники.Renault_Advanced_ПунктыДоговора.Гарантия612.Содержание);
					ДанныеОбъекта.Вставить("Гарантия613",Справочники.Renault_Advanced_ПунктыДоговора.Гарантия613.Содержание);
					ДанныеОбъекта.Вставить("Гарантия62",Справочники.Renault_Advanced_ПунктыДоговора.Гарантия62.Содержание);
					ДанныеОбъекта.Вставить("Гарантия621",Справочники.Renault_Advanced_ПунктыДоговора.Гарантия621.Содержание);
					ДанныеОбъекта.Вставить("Гарантия66",Справочники.Renault_Advanced_ПунктыДоговора.Гарантия66.Содержание);
				КонецЕсли;
				
				ДанныеОбъекта.Вставить("ПакетProtection", "");
				Если ЕстьПакетProtection Тогда 
					ДанныеОбъекта.Вставить("ПакетProtection"," На аксессуары комплекта «Protection», перечисленные в п.п. 1.2.1 настоящего Договора - 1 (один) год с даты продажи автомобиля, указанной в Гарантийной книжке.");
					ДанныеОбъекта.Гарантия611 = СтрЗаменить(ДанныеОбъекта.Гарантия611,"[ПакетProtection]",ДанныеОбъекта.ПакетProtection);
				Иначе
					ДанныеОбъекта.Гарантия611 = СтрЗаменить(ДанныеОбъекта.Гарантия611,"[ПакетProtection]","");	 
				КонецЕсли;
				
				ДанныеОбъекта.Вставить("ГарантияДО", "");
				Если ВыборкаСоставДоговора.СтоимостьОборудованияДляУстановки > 0 Тогда 
					ДанныеОбъекта.Вставить("ГарантияДО", " На установленное, по желанию покупателя, дополнительное оборудование - 1(Один) год. Перечень дополнительного оборудования указывается в отдельной спецификации (Приложение №3 к настоящему договору)");
				КонецЕсли;
				
				ДанныеОбъекта.Вставить("ОКВЭД", Выборка.Организация.КодПоОКВЭД); 
				ДанныеОбъекта.Вставить("ОКПО", Выборка.Организация.КодПоОКПО);
				Если Выборка.КлиентФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда
					
					ДанныеОбъекта.Вставить("АдресКлиента",Выборка.КлиентАдрес);
					ДанныеОбъекта.Вставить("ТелефонКлиента",Выборка.КлиентОсновнойТелефон);
					ДанныеОбъекта.Вставить("ДанныеКлиента1","ИНН: " + Выборка.КлиентИНН + " КПП: " + Выборка.КлиентКПП);
					ДанныеОбъекта.Вставить("ДанныеКлиента2","р/с " + Выборка.КлиентСчет + " в " + Выборка.КлиентБанкСчета);
					ДанныеОбъекта.Вставить("ДанныеКлиента3","к/с " + Выборка.КлиентКоррСчет + ", БИК " + Выборка.КлиентБИК);
					ДанныеОбъекта.Вставить("ДанныеКлиента4","ОКПО: " + Выборка.КлиентКодПоОКПО);	
					Если ЗначениеЗаполнено(Выборка.КлиентПодписантВЛице) Тогда
						//КлиентПодписантПодпись = Выборка.КлиентПодписантВЛице.Фамилия + " " + Лев(Выборка.КлиентПодписантВЛице.Имя,1) + "."+Лев(Выборка.КлиентПодписантВЛице.Отчество,1)+"."; 
						КлиентПодписантПодпись = Выборка.КлиентПодписантВЛице;
						ДанныеОбъекта.Вставить("ПокупательДоверенноеЛицо",КлиентПодписантПодпись);
					Иначе
						ДанныеОбъекта.Вставить("ПокупательДоверенноеЛицо","");
					КонецЕсли;
				Иначе
					ДанныеОбъекта.Вставить("АдресКлиента",Выборка.КлиентАдрес);
					ДанныеОбъекта.Вставить("ТелефонКлиента",Выборка.КлиентОсновнойТелефон);
					ДанныеОбъекта.Вставить("ДанныеКлиента1","Паспорт: " + Выборка.КлиентПаспортСерия + " " + Выборка.КлиентПаспортНомер);
					ДанныеОбъекта.Вставить("ДанныеКлиента2","Выдан: " + Выборка.КлиентПаспортВыданКем+ ", " + Формат(Выборка.КлиентПаспортВыданДата, "ДФ='дд.ММ.гггг'"));
					ДанныеОбъекта.Вставить("ДанныеКлиента3","E-mail: " + Выборка.КлиентОсновнойEmail);
					ДанныеОбъекта.Вставить("ДанныеКлиента4","Дата рождения: " + Формат(Выборка.КлиентДатаРождения,"ДФ='dd.MM.yyyy ""г.""'"));
					ДанныеОбъекта.Вставить("ПокупательДоверенноеЛицо",Выборка.Клиент);
				КонецЕсли;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаСоставДоговора.ЗаявкаНаТрейдИн) Тогда
							
				ЗапросТрейдИн = Новый Запрос;
				ЗапросТрейдИн.Текст = 
					"ВЫБРАТЬ
					|	Renault_ЗаявкаНаТрейдИн.VIN,
					|	Renault_ЗаявкаНаТрейдИн.ГодВыпуска,
					|	Renault_ЗаявкаНаТрейдИн.МодельКод КАК Модель,
					|	Renault_ЗаявкаНаТрейдИн.Пробег,
					|	Renault_ЗаявкаНаТрейдИн.ПроизводительКод КАК Производитель,
					|	Renault_ЗаявкаНаТрейдИн.ЦенаВыкупа,
					|	Renault_ЗаявкаНаТрейдИн.Цвет,
					|	Renault_ЗаявкаНаТрейдИн.КоличествоВладельцевПоПТС КАК КоличествоВладельцев,
					|	Renault_ЗаявкаНаТрейдИн.МесяцВыпуска,
					|	Renault_ЗаявкаНаТрейдИн.Автомобиль,
					|	Renault_ЗаявкаНаТрейдИн.Автомобиль.ДатаРегистрации КАК ДатаРегистрации,
					|	Renault_ЗаявкаНаТрейдИн.Автомобиль.VIN,
					|	Renault_ЗаявкаНаТрейдИн.НомерКузова,
					|	Renault_ЗаявкаНаТрейдИн.ДвигательКод,
					|	Renault_ЗаявкаНаТрейдИн.НомерДвигателя,
					|	Renault_ЗаявкаНаТрейдИн.ГосНомер,
					|	Renault_ЗаявкаНаТрейдИн.НомерШасси,
					|	Renault_ЗаявкаНаТрейдИн.МодификацияКод
					|ИЗ
					|	Документ.Renault_ЗаявкаНаТрейдИн КАК Renault_ЗаявкаНаТрейдИн
					|ГДЕ
					|	Renault_ЗаявкаНаТрейдИн.Ссылка = &ЗаявкаНаТрейдИн";
				ЗапросТрейдИн.УстановитьПараметр("ЗаявкаНаТрейдИн", ВыборкаСоставДоговора.ЗаявкаНаТрейдИн);
				РезультатТрейдИн = ЗапросТрейдИн.Выполнить();
				
				ВыборкаТрейдИн = РезультатТрейдИн.Выбрать();
				ВыборкаТрейдИн.Следующий();
				
				ДанныеОбъекта.Вставить("ТрейдИнVIN", ВыборкаТрейдИн.VIN);
				ДанныеОбъекта.Вставить("ТрейдИнВерсия", ВыборкаТрейдИн.МодификацияКод);
				ДанныеОбъекта.Вставить("ТрейдИнМодель", ВыборкаТрейдИн.Модель);
				ДанныеОбъекта.Вставить("ТрейдИнПроизводитель", ВыборкаТрейдИн.Производитель);
				ДанныеОбъекта.Вставить("ТрейдИнЦвет", ВыборкаТрейдИн.Цвет);
				ДанныеОбъекта.Вставить("ТрейдИнМодельДвигателя", ВыборкаТрейдИн.ДвигательКод);
				ДанныеОбъекта.Вставить("ТрейдИнНомерДвигателя", ВыборкаТрейдИн.НомерДвигателя);
				ДанныеОбъекта.Вставить("ТрейдИнНомерШасси", ВыборкаТрейдИн.НомерШасси);

				ДанныеОбъекта.Вставить("ТрейдИнНомерКузова", ВыборкаТрейдИн.НомерКузова);
				ДанныеОбъекта.Вставить("ТрейдИнПробег", ВыборкаТрейдИн.Пробег);
				ДанныеОбъекта.Вставить("ТрейдИнГосНомер", ВыборкаТрейдИн.ГосНомер);
				ДанныеОбъекта.Вставить("ТрейдИнКоличествоВладельцев", ВыборкаТрейдИн.КоличествоВладельцев);
				ГодВыпуска = ВыборкаТрейдИн.ГодВыпуска;
				МесяцВыпуска = ВыборкаТрейдИн.МесяцВыпуска;
				
				ГодВыпуска = СтрЗаменить(ГодВыпуска, " ", "");
				ГодВыпуска = СтрЗаменить(ГодВыпуска, Символы.НПП, "");
				
				Если ЗначениеЗаполнено(ГодВыпуска) И ЗначениеЗаполнено(МесяцВыпуска) Тогда
					ДатаВыпуска = Дата(ГодВыпуска + МесяцВыпуска + "01");
				Иначе
					ДатаВыпуска = '00010101';
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ДатаВыпуска) Тогда
					РазностьДат = ТекущаяДата() - ДатаВыпуска;
					СекундВГоду = 3600 * 24 * 365;
					КоличествоЛетАвто = Окр(РазностьДат / СекундВГоду, 0); 
				КонецЕсли;
				
				ДанныеОбъекта.Вставить("ТрейдИнГодВыпуска", ГодВыпуска);
				ДанныеОбъекта.Вставить("ТрейдИнВозраст", КоличествоЛетАвто);
				
				ЗапросПоступление = Новый Запрос;
							ЗапросПоступление.Текст = 
							"ВЫБРАТЬ
							|	ПоступлениеАвтомобилейАвтомобили.Сумма,
							|	ПоступлениеАвтомобилейАвтомобили.СуммаНДС,
							|	ПоступлениеАвтомобилейАвтомобили.Автомобиль,
							|	ПоступлениеАвтомобилей.Дата,
							|	ПоступлениеАвтомобилей.Номер
							|ИЗ
							|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
							|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеАвтомобилей КАК ПоступлениеАвтомобилей
							|		ПО ПоступлениеАвтомобилейАвтомобили.Ссылка = ПоступлениеАвтомобилей.Ссылка
							|ГДЕ
							|	ПоступлениеАвтомобилейАвтомобили.Автомобиль = &Автомобиль";
							
							ЗапросПоступление.УстановитьПараметр("Автомобиль", ВыборкаТрейдИн.Автомобиль);
							
				РезультатЗапросаПоступление = ЗапросПоступление.Выполнить();
				ВыборкаПоступлений = РезультатЗапросаПоступление.Выгрузить();	
				
				ПТСТрейдИн = ЧтениеЗначенияРегистраСведения(ВыборкаТрейдИн.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ТехПаспорт);
				
				Если ЗначениеЗаполнено(ПТСТрейдИн) Тогда
					ПТСДатаВыдачи = ПТСТрейдИн.ДатаВыдачи;
				Иначе
					ПТСДатаВыдачи = '00010101';
				КонецЕсли;
				
				Если НЕ РезультатЗапросаПоступление.Пустой() Тогда
					ДанныеОбъекта.Вставить("ТрейдИнДатаПраваСобственности", ВыборкаТрейдИн.ДатаРегистрации);
					ДанныеОбъекта.Вставить("ТрейдИнДатаПередачиПокупателю", ВыборкаПоступлений[0].Дата);
					ДанныеОбъекта.Вставить("СуммаТрейдИн", ВыборкаПоступлений[0].Сумма);			
					ДанныеОбъекта.Вставить("СуммаТрейдИнПрописью", обЧислоПрописью(ВыборкаПоступлений[0].Сумма, ВалютаРубли));
					ДанныеОбъекта.Вставить("СуммаТрейдИнНДС", ВыборкаПоступлений[0].СуммаНДС);
					ДанныеОбъекта.Вставить("ТрейдИнДатаЗаявки", ВыборкаПоступлений[0].Дата);
					ДанныеОбъекта.Вставить("ТрейдИнНомерЗаявки", ВыборкаПоступлений[0].Номер);
				Иначе
					ДанныеОбъекта.Вставить("ТрейдИнДатаПередачиПокупателю", ТекущаяДата());	
				КонецЕсли;
				
				ДанныеОбъекта.Вставить("ТрейдИнПТС", ПТСТрейдИн);
				ДанныеОбъекта.Вставить("ТрейдИнДатаВыдачиПТС", ПТСДатаВыдачи);

				
			КонецЕсли;
		КонецЕсли;
		
		//Клиент
		
		ДанныеОбъекта.Вставить("Клиент", Выборка.Клиент);
		ДанныеОбъекта.Вставить("ФИОКлиента", Выборка.КлиентФамилия + " " + Выборка.КлиентИмя + " " + Выборка.КлиентОтчество);
		ДанныеОбъекта.Вставить("ФИОКлиентаИнициалы", Выборка.КлиентФамилия + " " + Лев(Выборка.КлиентИмя,1) + "." + Лев(Выборка.КлиентОтчество,1) + ".");
		ДанныеОбъекта.Вставить("ФормаСобственности", Выборка.КлиентФормаСобственности);
		Если ЗначениеЗаполнено(Выборка.КлиентДатаРождения) Тогда
			ДанныеОбъекта.Вставить("ДатаРождения", Формат(Выборка.КлиентДатаРождения,"ДФ=""дд.ММ.гггг"""));
		Иначе
			ДанныеОбъекта.Вставить("ДатаРождения", "");
		КонецЕсли;
		
		ДанныеОбъекта.Вставить("Пол", Выборка.КлиентПол);
		ДанныеОбъекта.Вставить("Фамилия", Выборка.КлиентФамилия);
		ДанныеОбъекта.Вставить("Имя", Выборка.КлиентИмя);
		ДанныеОбъекта.Вставить("Отчество", Выборка.КлиентОтчество);
		ДанныеОбъекта.Вставить("АдресФактический", Выборка.КлиентАдрес);
		ДанныеОбъекта.Вставить("ТелефонСотовый", Выборка.КлиентОсновнойТелефон);
		ДанныеОбъекта.Вставить("АдресЭлектроннойПочтыДомашний", Выборка.КлиентОсновнойEmail);
		ДанныеОбъекта.Вставить("АдресЭлектроннойПочты", Выборка.КлиентОсновнойEmail);
		ДанныеОбъекта.Вставить("ПаспортСерия", Выборка.КлиентПаспортСерия);
		ДанныеОбъекта.Вставить("ПаспортНомер", Выборка.КлиентПаспортНомер);
		ДанныеОбъекта.Вставить("ПаспортВыданКем", Выборка.КлиентПаспортВыданКем);
		ДанныеОбъекта.Вставить("ПаспортВыданДата", Формат(Выборка.КлиентПаспортВыданДата,"ДФ='дд.ММ.гггг'"));
		ДанныеОбъекта.Вставить("НаименованиеОрганизацииКлиента", Выборка.КлиентДоговораНаименование);
		
		//Нужно именно наименование организации, без ФИО
		Если Выборка.КлиентФормаСобственности <> Перечисления.ФормыСобственности.ЧастноеЛицо Тогда 
			АнкетаНаименованиеОрганизацииКлиента = Выборка.КлиентДоговораНаименование; 
		Иначе
			АнкетаНаименованиеОрганизацииКлиента = "";
		КонецЕсли;
		ДанныеОбъекта.Вставить("АнкетаНаименованиеОрганизацииКлиента",АнкетаНаименованиеОрганизацииКлиента);
		
		ДанныеОбъекта.Вставить("АдресЮридический", Выборка.КлиентАдрес);
		ДанныеОбъекта.Вставить("Счет", Выборка.КлиентСчет);
		ДанныеОбъекта.Вставить("КоррСчет", Выборка.КлиентКоррСчет);
		ДанныеОбъекта.Вставить("БИК", Выборка.КлиентБИК);
		ДанныеОбъекта.Вставить("ИНН", Выборка.КлиентИНН);
		ДанныеОбъекта.Вставить("КПП", Выборка.КлиентКПП);
		ДанныеОбъекта.Вставить("КодПоОКПО", Выборка.КлиентКодПоОКПО);
		ДанныеОбъекта.Вставить("КодИМНС", Выборка.КлиентКодИМНС);
		ДанныеОбъекта.Вставить("Банк", Выборка.КлиентБанкСчета);
		
		// Подписант договора
		Если ЗначениеЗаполнено(Выборка.КлиентПодписантВЛице) Тогда
			ДанныеОбъекта.Вставить("ПодписантВЛице", Выборка.КлиентПодписантВЛице);
			КлиентПодписантПодпись = Выборка.КлиентПодписантВЛице; 
			//КлиентПодписантПодпись = Выборка.КлиентПодписантВЛице.Фамилия + " " + Лев(Выборка.КлиентПодписантВЛице.Имя,1) + "."+Лев(Выборка.КлиентПодписантВЛице.Отчество,1)+"."; 
			ДанныеОбъекта.Вставить("ПодписантПодпись", КлиентПодписантПодпись);
			ДанныеОбъекта.Вставить("ПодписантДолжность", Выборка.КлиентПодписантДолжность);
			
			//ДокументОснование = Справочники.ПодтверждающиеДокументы.НайтиПоРеквизиту("ВидПодтверждающегоДокумента", Перечисления.ВидыДокументов.Доверенность,,Выборка.КлиентПодписантВЛице);
			//Если ЗначениеЗаполнено(ДокументОснование) Тогда
			//	КлиентПодписантНаОсновании = "доверенности №"+ ДокументОснование.Номер + " от " + ДокументОснование.ДатаВыдачи;
			//Иначе
			//	КлиентПодписантНаОсновании = "Устава";
			//КонецЕсли;	
			ДанныеОбъекта.Вставить("ПодписантНаОсновании", Выборка.КлиентПодписантНаОсновании);
		КонецЕсли;
		
		
		//Доп.продукты
		
		//ДанныеОбъекта.Вставить("ТекстПродленнаяГарантия", "Продленная гарантия " + Строка(Выборка.ПродленнаяГарантия));
		//ДанныеОбъекта.Вставить("СуммаПродленнойГарантии", Выборка.СуммаПродленнойГарантии);
		//ДанныеОбъекта.Вставить("СуммаПродленнойГарантииПрописью", обЧислоПрописью(Выборка.СуммаПродленнойГарантии, ВалютаРубли));
		//ДанныеОбъекта.Вставить("СуммаПродленнойГарантииНДС", Выборка.СуммаПродленнойГарантииНДС);
		//ДанныеОбъекта.Вставить("СуммаПродленнойГарантииНДСПрописью", обЧислоПрописью(Выборка.СуммаПродленнойГарантииНДС, ВалютаРубли));		
		//
		//ДанныеОбъекта.Вставить("ВидСтраховойПрограммы", Выборка.ВидСтраховойПрограммы);
		//ДанныеОбъекта.Вставить("СтраховаяКомпания", Выборка.СтраховаяКомпания);
		//ДанныеОбъекта.Вставить("СтоимостьСтраховки", Выборка.СтоимостьСтраховки);
		//ДанныеОбъекта.Вставить("СтоимостьСтраховкиПрописью", обЧислоПрописью(Выборка.СтоимостьСтраховки, ВалютаРубли));
		//ДанныеОбъекта.Вставить("СтоимостьСтраховкиНДС", Выборка.СтоимостьСтраховкиНДС);
		//ДанныеОбъекта.Вставить("СтоимостьСтраховкиНДСПрописью", обЧислоПрописью(Выборка.СтоимостьСтраховкиНДС, ВалютаРубли));
		//
		//ДанныеОбъекта.Вставить("КредитнаяПрограмма", Выборка.КредитнаяПрограмма);
		//ДанныеОбъекта.Вставить("БанкПредоставляющийКредит", Выборка.БанкПредоставляющийКредит);
		//ДанныеОбъекта.Вставить("СуммаКредита", Выборка.СуммаКредита);
		//ДанныеОбъекта.Вставить("СуммаКредитаПрописью", обЧислоПрописью(Выборка.СуммаКредита, ВалютаРубли));
		//ДанныеОбъекта.Вставить("СуммаКредитаНДС", Выборка.СуммаКредитаНДС);
		//ДанныеОбъекта.Вставить("СуммаКредитаНДСПрописью", обЧислоПрописью(Выборка.СуммаКредитаНДС, ВалютаРубли));
		//
		//ДанныеОбъекта.Вставить("ТрейдИнМодель", Выборка.ТрейдИнМодель);
		//ДанныеОбъекта.Вставить("СуммаТрейдИн", Выборка.СуммаТрейдИн);
		//ДанныеОбъекта.Вставить("СуммаТрейдИнПрописью", обЧислоПрописью(Выборка.СуммаТрейдИн, ВалютаРубли));
		//ДанныеОбъекта.Вставить("СуммаТрейдИнНДС", Выборка.СуммаТрейдИнНДС);
		//ДанныеОбъекта.Вставить("СуммаТрейдИнНДСПрописью", обЧислоПрописью(Выборка.СуммаТрейдИнНДС, ВалютаРубли));
		
		Возврат ДанныеОбъекта;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

Функция ВывестиКопейки(Сумма)
	
	БезКопеек = Цел( Сумма);
	Копейки   = Цел((Сумма - БезКопеек)*100);
	
	Возврат ?(Копейки = 0, "00", Строка(Копейки));
	
КонецФункции

Функция ВывестиПрописьюЦелуюЧасть(Сумма)
	
	Возврат ЧислоПрописью(Цел(Сумма),"Л = ru_RU; НП = Ложь", ",,,,,,,,0")
	
КонецФункции

Функция СуммаСкидки(ДилерскийЦентр,Автомобиль,ТипСкидки = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДилерскийЦентр", ДилерскийЦентр);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("ТипСкидки", ?(ТипСкидки = Неопределено, Справочники.ТипыСкидок.ПустаяСсылка(), ТипСкидки));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_СкидкиНаАвтомобилиСрезПоследних.СуммаСкидки
	|ИЗ
	|	РегистрСведений.Renault_СкидкиНаАвтомобили.СрезПоследних КАК Renault_СкидкиНаАвтомобилиСрезПоследних
	|ГДЕ
	|	Renault_СкидкиНаАвтомобилиСрезПоследних.ДилерскийЦентр = &ДилерскийЦентр
	|	И Renault_СкидкиНаАвтомобилиСрезПоследних.Автомобиль = &Автомобиль
	|	И Renault_СкидкиНаАвтомобилиСрезПоследних.ВариантКомплектации = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка)
	|	И Renault_СкидкиНаАвтомобилиСрезПоследних.ДатаНачала <= &ТекущаяДата
	|	И Renault_СкидкиНаАвтомобилиСрезПоследних.ДатаКонца >= &ТекущаяДата
	|	И (Renault_СкидкиНаАвтомобилиСрезПоследних.ТипСкидки = &ТипСкидки
	|			ИЛИ &ТипСкидки = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.ПустаяСсылка))";
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.СуммаСкидки, 0)
	
КонецФункции

Функция ПолучитьСписокДанныхАвтомобиля(Автомобиль,ДанныеПТС)
	
	МассивДанных = Новый Массив;
	//МассивДанных.Добавить(Автомобиль.Модель);
	//МассивДанных.Добавить(Автомобиль.Цвет);
	//МассивДанных.Добавить(ДанныеПТС.ОбъемДвигателя);
	//МассивДанных.Добавить(ДанныеПТС.МощностьЛС);
	//МассивДанных.Добавить(ДанныеПТС.НомерДвигателяПТС);
	//МассивДанных.Добавить(Автомобиль.VIN);
	//МассивДанных.Добавить(ДанныеПТС.НомерКузоваПТС);
	//МассивДанных.Добавить(ДанныеПТС.ТипПТС);
	//МассивДанных.Добавить(ДанныеПТС.НомерШассиПТС);
	//МассивДанных.Добавить(Формат(ДанныеПТС.ГодВыпуска,"ДФ=yyyy"));
	//МассивДанных.Добавить(ДанныеПТС.ПТС);
	//МассивДанных.Добавить(ДанныеПТС.ОрганизацияИзготовительПТС);
	//МассивДанных.Добавить(Формат(ДанныеПТС.ДатаПТС, "ДФ=dd.MM.yyyy"));
	
	Возврат Новый Структура("МассивЗначений, ЗаголовокСписка", МассивДанных, "");
	
КонецФункции

Функция ПолучитьСписокЗаголовковДанныхАвтомобиля()
	
	МассивДанных = Новый Массив;
	МассивДанных.Добавить("Модель:");
	МассивДанных.Добавить("Цвет:");
	МассивДанных.Добавить("Объём Двигателя (в куб. см.):");
	МассивДанных.Добавить("Мощность Двигателя (в л.с.):");
	МассивДанных.Добавить("Номер Двигателя:");
	МассивДанных.Добавить("Идентификационный номер (VIN):");
	МассивДанных.Добавить("Кузов №:");
	МассивДанных.Добавить("Наименование (тип ТС):");
	МассивДанных.Добавить("Номер шасси:");
	МассивДанных.Добавить("Год выпуска");
	МассивДанных.Добавить("Паспорт транспортного средства (ПТС):");
	МассивДанных.Добавить("Выдан:");
	МассивДанных.Добавить("Дата выдачи ПТС:");
	
	Возврат Новый Структура("МассивЗначений, ЗаголовокСписка", МассивДанных, "");
	
КонецФункции

Функция ПроверитьНаличиеПакетаProtection(Выборка)
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Код = "9PRTCT" Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Процедура ПересчитатьНДС(тСумма, тСуммаНДС, СтавкаНДС)
	
	Если ЗначениеЗаполнено(СтавкаНДС) Тогда 
		ПроцентНДС = СтавкаНДС.Ставка / 100;
	Иначе
		ПроцентНДС = 0;
	КонецЕсли;
	тСуммаНДС = тСумма - тСумма / (1 + ПроцентНДС);
	Если тСуммаНДС <> 0 Тогда
		тСуммаНДС = Формат(тСуммаНДС, "ЧЦ=10; ЧДЦ=2");
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьНомерПечать(Номер)
	
	Ответ = Номер;
	ТекНомер = Номер;
	Итог = Лев(ТекНомер, 1);
	ЭтоПрефикс = Ложь;
	ПозицияПрефикса = 0;
	Нпп = 1;
	ПредИтог = "";
	Префикс = "";
	
	Пока Итог <> "0" И Нпп <= СтрДлина(Номер) Цикл
		
		ТекНомер = Прав(ТекНомер,СтрДлина(ТекНомер) - 1);
		ПредИтог = Итог;
		Итог = Лев(ТекНомер, 1);
		ЭтоПрефикс = Истина;
		Если Не ЭтоЦифра(Итог) Тогда
			ПозицияПрефикса = Нпп-1;
		КонецЕсли;
		
		Нпп = Нпп + 1;
		
	КонецЦикла;
	
	Если ЭтоПрефикс И Не ЭтоЦифра(ПредИтог) Тогда
		ПозицияПрефикса = Нпп-1;
	Иначе
		ЭтоПрефикс = Ложь;
	КонецЕсли;
	
	Если ЭтоПрефикс И (ПозицияПрефикса > 0) Тогда
		
		ТекНомер = Прав(Ответ,СтрДлина(Ответ)-ПозицияПрефикса);
		Префикс = Лев(Ответ,ПозицияПрефикса);
		Итог = Лев(ТекНомер, 1);
		Пока  Итог = "0" Цикл
			ПредИтог = ТекНомер;
			ТекНомер = Прав(ТекНомер,СтрДлина(ТекНомер) - 1);
			Итог = Лев(ТекНомер, 1);
		КонецЦикла;
		
	ИначеЕсли ЭтоПрефикс И (ПозицияПрефикса = 0) Тогда
		
		ТекНомер = Ответ;
		
	Иначе
		
		ТекНомер = Ответ;
		Итог = Лев(ТекНомер, 1);
		Пока  Итог = "0" Цикл
			ПредИтог = ТекНомер;
			ТекНомер = Прав(ТекНомер,СтрДлина(ТекНомер) - 1);
			Итог = Лев(ТекНомер, 1);
		КонецЦикла;
		
	КонецЕсли;
	
	Ответ = Префикс + ТекНомер;
	Возврат Ответ;
	
КонецФункции

Функция ЭтоЦифра(Слово)
	
	Цифры = "1234567890";
	Если Найти(Цифры,Слово) = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина
	
КонецФункции

Функция ПолучитьВыборкуПоТТХИБазовымОпциям(Модель, ВариантКомплектации)
	
	Тариф = Renault_CRM.ПолучитьПоследнийТарифНаАвтомобиль(ВариантКомплектации);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ТарифНаОпцииАвтомобилей.НаименованиеОпции КАК Опция
	|ИЗ
	|	РегистрСведений.Renault_ТарифНаОпцииАвтомобилей.СрезПоследних(
	|			,
	|			Модель = &Модель
	|				И ВариантКомплектации = &ВариантКомплектации
	|				И Тариф = &Тариф
	|				И Базовая = ИСТИНА) КАК Renault_ТарифНаОпцииАвтомобилей";
	
	Запрос.УстановитьПараметр("Модель", Модель);
	Запрос.УстановитьПараметр("ВариантКомплектации", ВариантКомплектации);
	Запрос.УстановитьПараметр("Тариф", Тариф);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено
	Иначе
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТекстДопОпции(Знач ВыборкаОпции, Знач Идентификатор)
	
	СписокОпцийТекст = "";
	НужнаЗапятая = Ложь;
	Пока ВыборкаОпции.Следующий() Цикл
		Если ВыборкаОпции.Идентификатор = Идентификатор Тогда
			Если НужнаЗапятая Тогда
				СписокОпцийТекст = СписокОпцийТекст + Символы.ПС;
			Иначе
				НужнаЗапятая = Истина;
			КонецЕсли;
			//DMSREN-870
			//СписокОпцийТекст = СписокОпцийТекст + ВыборкаОпции.Опция.НаименованиеПолное;
			СписокОпцийТекст = СписокОпцийТекст + ВыборкаОпции.Наименование;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокОпцийТекст;
	
КонецФункции

Функция ПолучитьСписокДопОпции(Знач ВыборкаОпции, Знач Идентификатор)

	МассивОпций = Новый Массив;
	
	Пока ВыборкаОпции.Следующий() Цикл
		Если ВыборкаОпции.Идентификатор = Идентификатор Тогда
			//МассивОпций.Добавить(Строка(ВыборкаОпции.Опция.НаименованиеПолное));
			МассивОпций.Добавить(Строка(ВыборкаОпции.Наименование));
		КонецЕсли;
	КонецЦикла;
	
	Если МассивОпций.Количество() = 0 Тогда
		Возврат "";
	Иначе
		Возврат Новый Структура("МассивЗначений, ЗаголовокСписка", МассивОпций, "Список дополнительных опций");
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТекстБазовыеОпции(ВыборкаОпции)
	
	СписокОпцийТекст = "";
	НужнаЗапятая = Ложь;
	Пока ВыборкаОпции.Следующий() Цикл
		Если НужнаЗапятая Тогда
			СписокОпцийТекст = СписокОпцийТекст + Символы.ПС;
		Иначе
			НужнаЗапятая = Истина;
		КонецЕсли;
		СписокОпцийТекст = СписокОпцийТекст + ВыборкаОпции.Опция;
	КонецЦикла;
	
	Возврат СписокОпцийТекст;
	
КонецФункции

Функция ПолучитьСписокБазовыеОпции(Знач ВыборкаОпции)
	
	МассивОпций = Новый Массив;
	
	Пока ВыборкаОпции.Следующий() Цикл
		МассивОпций.Добавить(Строка(ВыборкаОпции.Опция));
	КонецЦикла;
	
	Если МассивОпций.Количество() = 0 Тогда
		Возврат "";
	Иначе
		Возврат Новый Структура("МассивЗначений,ЗаголовокСписка", МассивОпций, "Список базовых опций");
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТекстОпцииДилера(ВыборкаОпции, Идентификатор)
	
	СписокОпцийТекст = "";
	НужнаЗапятая = Ложь;
	Пока ВыборкаОпции.Следующий() Цикл
		Если ВыборкаОпции.Идентификатор = Идентификатор Тогда 
			Если НужнаЗапятая Тогда
				СписокОпцийТекст = СписокОпцийТекст + Символы.ПС;
			Иначе
				НужнаЗапятая = Истина;
			КонецЕсли;
		КонецЕсли;
		СписокОпцийТекст = СписокОпцийТекст + ВыборкаОпции.Номенклатура;
	КонецЦикла;
	
	Возврат СписокОпцийТекст;
	
КонецФункции

Функция ПолучитьОписаниеОбластейМакетаОфисногоДокумента()
	
	ОписаниеОбластей = Новый Структура;
	
	Renault_УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Заголовок", "Общая");
	
	Возврат ОписаниеОбластей;
	
КонецФункции

Функция ПолучитьНДС(Знач тСумма, СтавкаНДС)
	
	Если ЗначениеЗаполнено(СтавкаНДС) Тогда 
		ПроцентНДС = СтавкаНДС.Ставка / 100;
	Иначе
		ПроцентНДС = 0;
	КонецЕсли;
	
	тСуммаНДС = тСумма - тСумма / (1 + ПроцентНДС);
	
	Если тСуммаНДС <> 0 Тогда
		тСуммаНДС = Окр(тСуммаНДС, 2);
	КонецЕсли;
	
	Возврат тСуммаНДС;
	
КонецФункции

Функция ЧтениеЗначенияРегистраСведения(Автомобиль, ВидЗначения, НаДату = Неопределено) Экспорт
	
	Если НаДату = Неопределено Тогда
		ДатаЗаписи = Неопределено;
	Иначе
		ДатаЗаписи = НаДату;
	КонецЕсли;
	СтруктураОтбора   = Новый Структура("Автомобиль, ВидЗначения", Автомобиль, ВидЗначения);
	СтруктураСведений = РегистрыСведений.Автомобили.ПолучитьПоследнее(ДатаЗаписи, СтруктураОтбора);
	Возврат СтруктураСведений.Значение;
	
КонецФункции

Функция ПолучитьРаботыПоЗаказНарядам(Автомобиль, Состояние = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(Работы.СуммаВсего) КАК СуммаВсего
	               |ИЗ
	               |	Документ.ЗаказНаряд.Работы КАК Работы
	               |ГДЕ
	               |	Работы.Ссылка.Автомобиль = &Автомобиль
	               |	И Работы.Ссылка.ВидРемонта = &ВидРемонта
	               |	И НЕ Работы.Ссылка.ПометкаУдаления "
				   +?(Состояние = Неопределено, "",
				   "  И Работы.Ссылка.Состояние = &Состояние ");
					
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("ВидРемонта", Справочники.ВидыРемонта.КомплектацияАвтомобиля);
	Если Состояние<>Неопределено Тогда
		Запрос.УстановитьПараметр("Состояние", Состояние);
	КонецЕсли;
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество()>0 Тогда
		Возврат ?(ЗначениеЗаполнено(Результат[0].СуммаВсего), Результат[0].СуммаВсего, 0);
	Иначе
		Возврат 0;
	КонецЕсли;

КонецФункции

#Если ТолстыйКлиентОбычноеПриложение Тогда
Процедура ПечатьПредварительногоДоговора(ДанныеПечати)

	СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
	МакетПредварительногоДоговора = ПолучитьМакет("МакетПредварительногоДоговора");
	ОбластьШапки = МакетПредварительногоДоговора.ПолучитьОбласть("Шапка");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 5;
	ТабДокумент.ПолеСправа = 5;
	
	ТЗСостав = ДанныеПечати.СоставДоговора.Выгрузить(); 
	
	Для Каждого СтрокаТЗ ИЗ ТЗСостав Цикл	 

		ОбластьШапки.Параметры.НаименованиеПокупателя = ДанныеПечати.КлиентДоговораНаименование;
		ОбластьШапки.Параметры.НаименованиеОрганизации = ДанныеПечати.ДилерНаименованиеОрганизации;						
        ОбластьШапки.Параметры.ДатаДоговора  = Формат(ДанныеПечати.ДатаДоговора,"ДФ=dd.MM.yyyy");
        ОбластьШапки.Параметры.НомерДоговора = ДанныеПечати.НомерДоговора;
		ФИООтветственного = "";
		ПОЛ = обОпределитьПол(?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице));
		Если DMS_ФизическиеЛицаСервер.Просклонять(?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице),2,ФИООтветственного,?(ПОЛ=Перечисления.ПолФизическихЛиц.Женский,2,1)) Тогда
		КонецЕсли;
		ОбластьШапки.Параметры.ФИООтветственного = ФИООтветственного;	

		ОбластьШапки.Параметры.Город = ""+ОпределитьГородДляПродвинутогоПакета();
        ОбластьШапки.Параметры.ПодписантНаОсновании = ДанныеПечати.ДилерПодписантНаОсновании;	

		ТабДокумент.Вывести(ОбластьШапки);
		
		СтрокаРасчетов2_1 = МакетПредварительногоДоговора.ПолучитьОбласть("Шапка_2");	
		СтрокаРасчетов2_1.Параметры.СуммаИтог         = ДанныеПечати.СуммаДоговора;
		СтрокаРасчетов2_1.Параметры.СуммаИтогПрописью = обЧислоПрописью(ДанныеПечати.СуммаДоговора,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
		НДСИтого = ПолучитьНДС(ДанныеПечати.СуммаДоговора, СтавкаНДС);
		СтрокаРасчетов2_1.Параметры.НДСИтого  = ЛЕВ(Формат(НДСИтого, "ЧРД=,"), СтрДлина(Формат(НДСИтого, "ЧРД=,"))-3);
		СтрокаРасчетов2_1.Параметры.НДСИтогоПрописью = обЧислоПрописью(Цел(НДСИтого),,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
		НДСКопеек = обЧислоПрописью(НДСИтого-Цел(НДСИтого),,"Л=ru_RU;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");		
		СтрокаРасчетов2_1.Параметры.НДСКопеек = СтрЗаменить(НДСКопеек, "Ноль рублей ", "");
		ТабДокумент.Вывести(СтрокаРасчетов2_1);           
		
		Подвал = МакетПредварительногоДоговора.ПолучитьОбласть("Подвал");	
		Подвал.Параметры.СуммаИтог1         = СтрокаТЗ.СуммаПредоплаты;
		Подвал.Параметры.СуммаИтог1Прописью = обЧислоПрописью(СтрокаТЗ.СуммаПредоплаты,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
		Подвал.Параметры.СуммаИтог2         = ДанныеПечати.СуммаДоговора-СтрокаТЗ.СуммаПредоплаты;
		Подвал.Параметры.СуммаИтог2Прописью = обЧислоПрописью(ДанныеПечати.СуммаДоговора-СтрокаТЗ.СуммаПредоплаты,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
		ТабДокумент.Вывести(Подвал);
		
		СтрокаПодвал = МакетПредварительногоДоговора.ПолучитьОбласть("СтрокаПодвал");	
		СтрокаПодвал.Параметры.Продавец = ""+ДанныеПечати.ДилерНаименованиеОрганизацииКраткое + Символы.ПС+
		                                   "Юридический адрес:"+ДанныеПечати.ДилерАдресЮридический+Символы.ПС+
											 "Тел: "+ДанныеПечати.ДилерТелефон+Символы.ПС+
                                             "ИНН: "+ДанныеПечати.ДилерИНН+" КПП: "+ДанныеПечати.ДилерКПП+Символы.ПС+          
	                                         "ОГРН: "+ДанныеПечати.ДилерОГРН+Символы.ПС+
											 "р/с "+ДанныеПечати.ДилерСчет+" в"+Символы.ПС+
											 ДанныеПечати.ДилерБанк+Символы.ПС+
											 "к/с "+ДанныеПечати.ДилерКоррСчет+", БИК"+Символы.ПС+ 
											 ДанныеПечати.ДилерБИК+Символы.ПС+ 
											 "ОКВЭД: "+ДанныеПечати.ДилерОКВЭД+" ОКПО: "+ДанныеПечати.ДилерОКПО;
        СтрокаПодвал.Параметры.Покупатель = ДанныеПечати.КлиентДоговораНаименование+Символы.ПС+
		                                    "Паспорт: "+ДанныеПечати.КлиентПаспортСерия+" "+ДанныеПечати.КлиентПаспортНомер+Символы.ПС+
                                            "Выдан: "+ДанныеПечати.КлиентПаспортВыданКем+", "+Формат(ДанныеПечати.КлиентПаспортВыданДата,"ДФ=dd.MM.yyyy")+Символы.ПС+
                                            "Адрес регистрации: "+ДанныеПечати.КлиентАдрес+Символы.ПС+
											"Тел. "+ДАнныеПечати.КлиентОсновнойТелефон+Символы.ПС+
											"E-mail: "+ДанныеПечати.КлиентОсновнойEmail;
		ТабДокумент.Вывести(СтрокаПодвал);
		
		Подписи = МакетПредварительногоДоговора.ПолучитьОбласть("Подписи");	
		Подписи.Параметры.НаименованиеПокупателя = ДанныеПечати.КлиентДоговораНаименование;
		Подписи.Параметры.ФИООтветственного = ?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице);
		ТабДокумент.Вывести(Подписи);
		
		Макет = Новый Структура();
		Макет.Вставить("Тип",ВРег("mxl"));
		Макет.Вставить("ПечатнаяФорма",ТабДокумент);
		Renault_УправлениеПечатьюКлиент.ПоказатьДокумент(Макет);
		
	КонецЦикла;
			
КонецПроцедуры

Процедура ПечатьОсновногоДоговора(ДанныеПечати)
	
	МакетОсновногоДоговора = ПолучитьМакет("МакетОсновногоДоговора");
	ОбластьШапки = МакетОсновногоДоговора.ПолучитьОбласть("Шапка");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 5;
	ТабДокумент.ПолеСправа = 5;
	СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
	
	ТЗСостав = ДанныеПечати.СоставДоговора.Выгрузить(); 
	
	Для Каждого СтрокаТЗ ИЗ ТЗСостав Цикл	 
							
		ОбластьШапки.Параметры.НаименованиеПокупателя  = ДанныеПечати.КлиентДоговораНаименование;
	    ОбластьШапки.Параметры.НаименованиеОрганизации = ДанныеПечати.ДилерНаименованиеОрганизации;						
        ОбластьШапки.Параметры.ДатаДоговора            = Формат(ДанныеПечати.ДатаДоговора,"ДФ=dd.MM.yyyy");
        ОбластьШапки.Параметры.НомерДоговора           = ДанныеПечати.НомерДоговора;
		ФИООтветственного = "";
		ПОЛ = обОпределитьПол(?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице));
		Если DMS_ФизическиеЛицаСервер.Просклонять(?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице),2,ФИООтветственного,?(ПОЛ=Перечисления.ПолФизическихЛиц.Женский,2,1)) Тогда
		КонецЕсли;

		ОбластьШапки.Параметры.ФИООтветственного = ФИООтветственного;
		ОбластьШапки.Параметры.УставОрганизации        = ДанныеПечати.ДилерПодписантНаОсновании;	
		ОбластьШапки.Параметры.Город                   = ""+ОпределитьГородДляПродвинутогоПакета();

		ТабДокумент.Вывести(ОбластьШапки);
		
		СтрокаАвтомобиль = МакетОсновногоДоговора.ПолучитьОбласть("СтрокаАвтомобиль");
		ЗаполнитьЗначенияСвойств(СтрокаАвтомобиль.Параметры, СтрокаТЗ);	
		Если Не ЗначениеЗаполнено(СтрокаТЗ.НомерШассиПТС) Тогда
			СтрокаАвтомобиль.Параметры.НомерШассиПТС = "ОТСУТСТВУЕТ";
		КонецЕсли;
		СтрокаАвтомобиль.Параметры.ДатаПТС = Формат(СтрокаТЗ.ДатаПТС, "ДЛФ=DD");

		ТабДокумент.Вывести(СтрокаАвтомобиль);
		
		Если СтрокаТЗ.ВключитьТрейдИнВДоговор Тогда		
			
			СтрокаРасчетов2_1 = МакетОсновногоДоговора.ПолучитьОбласть("ПрограммаТрейдИн");	
			
			//ЗаполнитьЗначенияСвойств(СтрокаРасчетов2_1.Параметры, СтрокаТЗ);
			
			ЗаявкаНаТрейдИн = СтрокаТЗ.ЗаявкаНаТрейдИн;
			
			Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн) Тогда
				
				АвтоТрейдИн = ЗаявкаНаТрейдИн.Автомобиль;
								
				СтрокаРасчетов2_1.Параметры.ДатаВладения       = "";
				СтрокаРасчетов2_1.Параметры.ГодИзготовленияПТС = Формат(АвтоТрейдИн.ГодВыпуска, "ДФ=yyyy");
				СтрокаРасчетов2_1.Параметры.МаркаМодельПТС     = АвтоТрейдИн.Модель;
				СтрокаРасчетов2_1.Параметры.VIN                = АвтоТрейдИн.VIN;
				СтрокаРасчетов2_1.Параметры.ГРН                = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(АвтоТрейдИн, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);;
				СтрокаРасчетов2_1.Параметры.НомерКузоваПТС     = АвтоТрейдИн.НомерКузова;
				СтрокаРасчетов2_1.Параметры.НомерДвигателяПТС  = АвтоТрейдИн.НомерДвигателя;
				СтрокаРасчетов2_1.Параметры.НомерШассиПТС      = АвтоТрейдИн.НомерШасси;
				ПТС = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(АвтоТрейдИн, Перечисления.ДополнительнаяИнформацияАвтомобилей.ТехПаспорт);
				Если ЗначениеЗаполнено(ПТС) Тогда
					СтрокаРасчетов2_1.Параметры.ПТС     = ПТС.Серия+ " " + ПТС.Номер;
					СтрокаРасчетов2_1.Параметры.ДатаПТС = Формат(ПТС.ДатаВыдачи,"ДФ=dd.MM.yyyy");
				КонецЕсли;	
				СтрокаРасчетов2_1.Параметры.Пробег  = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(АвтоТрейдИн, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
				СтрокаРасчетов2_1.Параметры.Возраст = ЦЕЛ(ГОД(ТекущаяДата())-ГОД(АвтоТрейдИн.ГодВыпуска));
				Если ЗначениеЗаполнено(СтрокаТЗ.ЗаявкаНаТрейдИн) Тогда
					СтрокаРасчетов2_1.Параметры.КоличествоВладельцев = СтрокаТЗ.ЗаявкаНаТрейдИн.КоличествоВладельцевПоПТС;
				КонецЕсли;
				СтрокаРасчетов2_1.Параметры.НомерИДатаАкта = "№"+ДанныеПечати.НомерДоговора+" от "+Формат(ДанныеПечати.ДатаДоговора, "ДФ=dd.MM.yyyy");
				СтрокаРасчетов2_1.Параметры.Доверенность   = "";

			КонецЕсли;
			СтрокаРасчетов2_1.Параметры.НаименованиеПокупателя   = ДанныеПечати.КлиентДоговораНаименование;
			СтрокаРасчетов2_1.Параметры.НомерДоговора = ДанныеПечати.НомерДоговора;
			СтрокаРасчетов2_1.Параметры.ДатаДоговора  = Формат(ДанныеПечати.ДатаДоговора, "ДФ=dd.MM.yyyy");
			СтрокаРасчетов2_1.Параметры.Цена          = СтрокаТЗ.СтоимостьБазовойКомплектации;
			СтрокаРасчетов2_1.Параметры.ЦенаПрописью  = обЧислоПрописью(СтрокаТЗ.СтоимостьБазовойКомплектации,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			СтрокаРасчетов2_1.Параметры.СуммаОпций          = СтрокаТЗ.СтоимостьДопОпций+СтрокаТЗ.СтоимостьОборудованияДляУстановки;
			СтрокаРасчетов2_1.Параметры.СуммаОпцийПрописью  = обЧислоПрописью(СтрокаТЗ.СтоимостьДопОпций+СтрокаТЗ.СтоимостьОборудованияДляУстановки,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			Если ЗначениеЗаполнено(СтрокаТЗ.СуммаСкидокПоКоммерческимАкциям) Тогда
				СтрокаРасчетов2_1.Параметры.КоммСкидка = ", стоимости скидок по акции в размере "+СтрокаТЗ.СуммаСкидокПоКоммерческимАкциям+" ("+обЧислоПрописью(СтрокаТЗ.СуммаСкидокПоКоммерческимАкциям,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0")+") руб. 00 коп. с НДС";
			КонецЕсли;	
			СтрокаРасчетов2_1.Параметры.СуммаСкидки         = СтрокаТЗ.СуммаПоПрочимСкидкам;
			СтрокаРасчетов2_1.Параметры.СуммаСкидкиПрописью = обЧислоПрописью(СтрокаТЗ.СуммаПоПрочимСкидкам,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			СтрокаРасчетов2_1.Параметры.СуммПредварИтог     = СтрокаТЗ.СтоимостьБазовойКомплектации+СтрокаТЗ.СтоимостьДопОпций+СтрокаТЗ.СтоимостьОборудованияДляУстановки-СтрокаТЗ.СуммаСкидокПоКоммерческимАкциям+СтрокаТЗ.СуммаПоПрочимСкидкам;
			СтрокаРасчетов2_1.Параметры.СуммПредварИтогПрописью = обЧислоПрописью(СтрокаТЗ.СтоимостьБазовойКомплектации+СтрокаТЗ.СтоимостьДопОпций+СтрокаТЗ.СтоимостьОборудованияДляУстановки-СтрокаТЗ.СуммаСкидокПоКоммерческимАкциям+СтрокаТЗ.СуммаПоПрочимСкидкам,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			СтрокаРасчетов2_1.Параметры.СуммТрейдИн             = СтрокаТЗ.СтоимостьВыкупленногоАвтомобиля;
			СтрокаРасчетов2_1.Параметры.СуммТрейдИнПрописью     = обЧислоПрописью(СтрокаТЗ.СтоимостьВыкупленногоАвтомобиля,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			НДСИтого                                            = ПолучитьНДС(СтрокаТЗ.СтоимостьВыкупленногоАвтомобиля, СтавкаНДС);
			СтрокаРасчетов2_1.Параметры.СуммТрейдИнНДС          = ЛЕВ(Формат(НДСИтого, "ЧРД=,"), СтрДлина(Формат(НДСИтого, "ЧРД=,"))-3);
			СтрокаРасчетов2_1.Параметры.СуммТрейдИнНДСПрописью  = обЧислоПрописью(Цел(НДСИтого),,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			НДСКопеек                                              = обЧислоПрописью(НДСИтого-Цел(НДСИтого),,"Л=ru_RU;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");		
			СтрокаРасчетов2_1.Параметры.НДСТрейдИнКопейки          =  СтрЗаменить(НДСКопеек, "Ноль рублей ", "");
            СтрокаРасчетов2_1.Параметры.СуммаСкидкиТрейдИн         = СтрокаТЗ.СуммаТрейдИн;
            СтрокаРасчетов2_1.Параметры.СуммаСкидкиТрейдИнПрописью = обЧислоПрописью(СтрокаТЗ.СуммаТрейдИн,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");	
			СтрокаРасчетов2_1.Параметры.СуммаИтог1                 = ДанныеПечати.СуммаДоговора+СтрокаТЗ.СтоимостьВыкупленногоАвтомобиля;
			СтрокаРасчетов2_1.Параметры.СуммаИтогПрописью1         = обЧислоПрописью(ДанныеПечати.СуммаДоговора+СтрокаТЗ.СтоимостьВыкупленногоАвтомобиля,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			НДСИтого                                      = ПолучитьНДС(ДанныеПечати.СуммаДоговора+СтрокаТЗ.СтоимостьВыкупленногоАвтомобиля, СтавкаНДС);
			СтрокаРасчетов2_1.Параметры.НДСИтого1         = ЛЕВ(Формат(НДСИтого, "ЧРД=,"), СтрДлина(Формат(НДСИтого, "ЧРД=,"))-3);
			СтрокаРасчетов2_1.Параметры.НДСИтогоПрописью1 = обЧислоПрописью(Цел(НДСИтого),,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			НДСКопеек                                     = обЧислоПрописью(НДСИтого-Цел(НДСИтого),,"Л=ru_RU;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");		
			СтрокаРасчетов2_1.Параметры.НДСИтогоКопеек1   = СтрЗаменить(НДСКопеек, "Ноль рублей ", "");	
			СтрокаРасчетов2_1.Параметры.СуммаИтог         = ДанныеПечати.СуммаДоговора;
			СтрокаРасчетов2_1.Параметры.СуммаИтогПрописью = обЧислоПрописью(ДанныеПечати.СуммаДоговора,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			НДСИтого                                      = ПолучитьНДС(ДанныеПечати.СуммаДоговора, СтавкаНДС);
			СтрокаРасчетов2_1.Параметры.НДСИтого          = ЛЕВ(Формат(НДСИтого, "ЧРД=,"), СтрДлина(Формат(НДСИтого, "ЧРД=,"))-3);
			СтрокаРасчетов2_1.Параметры.НДСИтогоПрописью  = обЧислоПрописью(Цел(НДСИтого),,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			НДСКопеек                                     = обЧислоПрописью(НДСИтого-Цел(НДСИтого),,"Л=ru_RU;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");		
			СтрокаРасчетов2_1.Параметры.НДСИтогоКопейки    = СтрЗаменить(НДСКопеек, "Ноль рублей ", "");	
		ИначеЕсли СтрокаТЗ.ВключитьУтилизациюВДоговор Тогда
			СтрокаРасчетов2_1 = МакетОсновногоДоговора.ПолучитьОбласть("ПрограммаУтилизация");	
            ЗаполнитьЗначенияСвойств(СтрокаРасчетов2_1.Параметры, ДанныеПечати);
			СтрокаРасчетов2_1.Параметры.НаименованиеПокупателя   = ДанныеПечати.КлиентДоговораНаименование;
			СтрокаРасчетов2_1.Параметры.Возраст                  = ЦЕЛ(ГОД(ТекущаяДата())-ГОД(ДанныеПечати.УтилГодВыпуска));
			СтрокаРасчетов2_1.Параметры.УтилВладениеАвтомобилемС = Формат(ДанныеПечати.УтилВладениеАвтомобилемС,"ДФ=dd.MM.yyyy");
			СтрокаРасчетов2_1.Параметры.УтилГодВыпуска           = Формат(ДанныеПечати.УтилГодВыпуска,"ДФ=yyyy");
			СтрокаРасчетов2_1.Параметры.УтилДатаПТС              = Формат(ДанныеПечати.УтилДатаПТС,"ДФ=dd.MM.yyyy");
			СтрокаРасчетов2_1.Параметры.Цена                     = СтрокаТЗ.СтоимостьБазовойКомплектации;
			СтрокаРасчетов2_1.Параметры.ЦенаПрописью        = обЧислоПрописью(СтрокаТЗ.СтоимостьБазовойКомплектации,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			СтрокаРасчетов2_1.Параметры.СуммаОпций          = СтрокаТЗ.СтоимостьДопОпций+СтрокаТЗ.СтоимостьОборудованияДляУстановки;
			СтрокаРасчетов2_1.Параметры.СуммаОпцийПрописью  = обЧислоПрописью(СтрокаТЗ.СтоимостьДопОпций+СтрокаТЗ.СтоимостьОборудованияДляУстановки,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			Если ЗначениеЗаполнено(СтрокаТЗ.СуммаСкидокПоКоммерческимАкциям) Тогда
				СтрокаРасчетов2_1.Параметры.КоммСкидка = ", стоимости скидок по акции в размере "+СтрокаТЗ.СуммаСкидокПоКоммерческимАкциям+" ("+обЧислоПрописью(СтрокаТЗ.СуммаСкидокПоКоммерческимАкциям,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0")+") руб. 00 коп. с НДС";
			КонецЕсли;	
			СтрокаРасчетов2_1.Параметры.СуммаСкидки         = СтрокаТЗ.СуммаПоПрочимСкидкам;
			СтрокаРасчетов2_1.Параметры.СуммаСкидкиПрописью = обЧислоПрописью(СтрокаТЗ.СуммаПоПрочимСкидкам,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			СтрокаРасчетов2_1.Параметры.СуммаПредварИтог    = СтрокаТЗ.СтоимостьБазовойКомплектации+СтрокаТЗ.СтоимостьДопОпций+СтрокаТЗ.СтоимостьОборудованияДляУстановки-СтрокаТЗ.СуммаСкидокПоКоммерческимАкциям+СтрокаТЗ.СуммаПоПрочимСкидкам;
			СтрокаРасчетов2_1.Параметры.СуммаПредварИтогПрописью      = обЧислоПрописью(СтрокаТЗ.СтоимостьБазовойКомплектации+СтрокаТЗ.СтоимостьДопОпций+СтрокаТЗ.СтоимостьОборудованияДляУстановки-СтрокаТЗ.СуммаСкидокПоКоммерческимАкциям+СтрокаТЗ.СуммаПоПрочимСкидкам,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
            СтрокаРасчетов2_1.Параметры.СуммаСкидкиУтилизация         = СтрокаТЗ.СуммаВозмещенияПоУтилизации;
            СтрокаРасчетов2_1.Параметры.СуммаСкидкиУтилизацияПрописью = обЧислоПрописью(СтрокаТЗ.СуммаВозмещенияПоУтилизации,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");			
			СтрокаРасчетов2_1.Параметры.СуммаИтог         = ДанныеПечати.СуммаДоговора;
			СтрокаРасчетов2_1.Параметры.СуммаИтогПрописью = обЧислоПрописью(ДанныеПечати.СуммаДоговора,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			НДСИтого                                      = ПолучитьНДС(ДанныеПечати.СуммаДоговора, СтавкаНДС);
			СтрокаРасчетов2_1.Параметры.НДСИтого          = ЛЕВ(Формат(НДСИтого, "ЧРД=,"), СтрДлина(Формат(НДСИтого, "ЧРД=,"))-3);
			СтрокаРасчетов2_1.Параметры.НДСИтогоПрописью  = обЧислоПрописью(Цел(НДСИтого),,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			НДСКопеек                                     = обЧислоПрописью(НДСИтого-Цел(НДСИтого),,"Л=ru_RU;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");		
			СтрокаРасчетов2_1.Параметры.НДСИтогоКопеек    = СтрЗаменить(НДСКопеек, "Ноль рублей ", "");		
		Иначе	
			Если СтрокаТЗ.СуммаСкидокПоКоммерческимАкциям+СтрокаТЗ.СуммаПоПрочимСкидкам <> 0 Тогда      //вариант 3,4,7,8,11,12
			    СтрокаРасчетов2_1                                 = МакетОсновногоДоговора.ПолучитьОбласть("Шапка2_1_Скидка");	
				Если ДанныеПечати.СуммаКредита <> 0 Тогда  //Кредит	
					СтрокаРасчетов2_1.Параметры.СуммаИтог         = СтрокаТЗ.ОбщаяСуммаПоАвтомобилю+СтрокаТЗ.СуммаСкидокПоКоммерческимАкциям+СтрокаТЗ.СуммаПоПрочимСкидкам;
					СтрокаРасчетов2_1.Параметры.СуммаИтогПрописью = обЧислоПрописью(СтрокаТЗ.ОбщаяСуммаПоАвтомобилю+СтрокаТЗ.СуммаСкидокПоКоммерческимАкциям+СтрокаТЗ.СуммаПоПрочимСкидкам,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
					НДСИтого                                      = ПолучитьНДС(СтрокаТЗ.ОбщаяСуммаПоАвтомобилю+СтрокаТЗ.СуммаСкидокПоКоммерческимАкциям+СтрокаТЗ.СуммаПоПрочимСкидкам, СтавкаНДС);
                Иначе
					СтрокаРасчетов2_1.Параметры.СуммаИтог         = ДанныеПечати.СуммаДоговора+СтрокаТЗ.СуммаСкидокПоКоммерческимАкциям+СтрокаТЗ.СуммаПоПрочимСкидкам;
					СтрокаРасчетов2_1.Параметры.СуммаИтогПрописью = обЧислоПрописью(ДанныеПечати.СуммаДоговора+СтрокаТЗ.СуммаСкидокПоКоммерческимАкциям+СтрокаТЗ.СуммаПоПрочимСкидкам,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
					НДСИтого                                      = ПолучитьНДС(ДанныеПечати.СуммаДоговора+СтрокаТЗ.СуммаСкидокПоКоммерческимАкциям+СтрокаТЗ.СуммаПоПрочимСкидкам, СтавкаНДС);
				КонецЕсли;
				СтрокаРасчетов2_1.Параметры.НДСИтого            = ЛЕВ(Формат(НДСИтого, "ЧРД=,"), СтрДлина(Формат(НДСИтого, "ЧРД=,"))-3);
				СтрокаРасчетов2_1.Параметры.НДСИтогоПрописью    = обЧислоПрописью(Цел(НДСИтого),,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
				НДСКопеек                                       = обЧислоПрописью(НДСИтого-Цел(НДСИтого),,"Л=ru_RU;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");		
				СтрокаРасчетов2_1.Параметры.НДСКопеек           = СтрЗаменить(НДСКопеек, "Ноль рублей ", "");	
				СтрокаРасчетов2_1.Параметры.СуммаСкидка         = СтрокаТЗ.СуммаСкидокПоКоммерческимАкциям+СтрокаТЗ.СуммаПоПрочимСкидкам;
				СтрокаРасчетов2_1.Параметры.СуммаСкидкаПрописью = обЧислоПрописью(СтрокаТЗ.СуммаСкидокПоКоммерческимАкциям+СтрокаТЗ.СуммаПоПрочимСкидкам,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
				Если ДанныеПечати.СуммаКредита <> 0 Тогда  //Кредит	
					СтрокаРасчетов2_1.Параметры.СуммаИтогСУчетомСкидки         = СтрокаТЗ.ОбщаяСуммаПоАвтомобилю;
					СтрокаРасчетов2_1.Параметры.СуммаИтогСУчетомСкидкиПрописью = обЧислоПрописью(СтрокаТЗ.ОбщаяСуммаПоАвтомобилю,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
					НДСИтого                                                   = ПолучитьНДС(СтрокаТЗ.ОбщаяСуммаПоАвтомобилю, СтавкаНДС);
				Иначе
					СтрокаРасчетов2_1.Параметры.СуммаИтогСУчетомСкидки         = ДанныеПечати.СуммаДоговора;
					СтрокаРасчетов2_1.Параметры.СуммаИтогСУчетомСкидкиПрописью = обЧислоПрописью(ДанныеПечати.СуммаДоговора,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
					НДСИтого                                                   = ПолучитьНДС(ДанныеПечати.СуммаДоговора, СтавкаНДС);
				КонецЕсли;
				СтрокаРасчетов2_1.Параметры.НДСИтогоСУчетомСкидки          = ЛЕВ(Формат(НДСИтого, "ЧРД=,"), СтрДлина(Формат(НДСИтого, "ЧРД=,"))-3);
				СтрокаРасчетов2_1.Параметры.НДСИтогоСУчетомСкидкиПрописью  = обЧислоПрописью(Цел(НДСИтого),,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
				НДСКопеек                                                  = обЧислоПрописью(НДСИтого-Цел(НДСИтого),,"Л=ru_RU;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");		
				СтрокаРасчетов2_1.Параметры.НДСКопеекСУчетомСкидки         = СтрЗаменить(НДСКопеек, "Ноль рублей ", "");	
			Иначе   
				СтрокаРасчетов2_1                                 = МакетОсновногоДоговора.ПолучитьОбласть("Шапка2_1");	
				//вариант 1,2,5,6,9,10
				Если ДанныеПечати.СуммаКредита <> 0 Тогда  //Кредит	
                    СтрокаРасчетов2_1.Параметры.СуммаИтог         =  СтрокаТЗ.ОбщаяСуммаПоАвтомобилю;
					СтрокаРасчетов2_1.Параметры.СуммаИтогПрописью = обЧислоПрописью(СтрокаТЗ.ОбщаяСуммаПоАвтомобилю,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
					НДСИтого                                      = ПолучитьНДС(СтрокаТЗ.ОбщаяСуммаПоАвтомобилю, СтавкаНДС);
				Иначе
					СтрокаРасчетов2_1.Параметры.СуммаИтог         = ДанныеПечати.СуммаДоговора;
					СтрокаРасчетов2_1.Параметры.СуммаИтогПрописью = обЧислоПрописью(ДанныеПечати.СуммаДоговора,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
					НДСИтого                                      = ПолучитьНДС(ДанныеПечати.СуммаДоговора, СтавкаНДС);
				КонецЕсли;
				СтрокаРасчетов2_1.Параметры.НДСИтого          = ЛЕВ(Формат(НДСИтого, "ЧРД=,"), СтрДлина(Формат(НДСИтого, "ЧРД=,"))-3);
				СтрокаРасчетов2_1.Параметры.НДСИтогоПрописью  = обЧислоПрописью(Цел(НДСИтого),,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
				НДСКопеек                                     = обЧислоПрописью(НДСИтого-Цел(НДСИтого),,"Л=ru_RU;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");		
				СтрокаРасчетов2_1.Параметры.НДСКопеек         = СтрЗаменить(НДСКопеек, "Ноль рублей ", "");	
			КонецЕсли;
			
		КонецЕсли;
		
		ТабДокумент.Вывести(СтрокаРасчетов2_1);
		
		Если СтрокаТЗ.СуммаКредита <> 0 Тогда  //Кредит	
			
			Если СтрокаТЗ.ОбщаяСуммаПоАвтомобилю = СтрокаТЗ.СуммаПредоплаты+СтрокаТЗ.СуммаКредита Тогда
				Если ДанныеПечати.СпособОплаты = Перечисления.Renault_СпособыОплаты.РеноКредит Тогда//RCI
					СтрокаРасчетов2_2 = МакетОсновногоДоговора.ПолучитьОбласть("Шапка_2_9"); //вариант 
					СтрокаРасчетов2_2.Параметры.СуммаСкидка         = СтрокаТЗ.СуммаСубсидииПоКредиту;
					СтрокаРасчетов2_2.Параметры.СуммаСкидкаПрописью = обЧислоПрописью(СтрокаТЗ.СуммаСубсидииПоКредиту,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
				Иначе
					СтрокаРасчетов2_2 = МакетОсновногоДоговора.ПолучитьОбласть("Шапка_2_5"); //вариант 5
				КонецЕсли;
				СтрокаРасчетов2_2.Параметры.СуммаИтог1         = СтрокаТЗ.СуммаПредоплаты;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью1 = обЧислоПрописью(СтрокаТЗ.СуммаПредоплаты,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
				СтрокаРасчетов2_2.Параметры.СуммаИтог2         = СтрокаТЗ.СуммаКредита;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью2 = обЧислоПрописью(СтрокаТЗ.СуммаКредита,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			Иначе
				Если ДанныеПечати.СпособОплаты = Перечисления.Renault_СпособыОплаты.РеноКредит Тогда//RCI
					СтрокаРасчетов2_2 = МакетОсновногоДоговора.ПолучитьОбласть("Шапка_2_10"); //вариант 
					СтрокаРасчетов2_2.Параметры.СуммаСкидка         = СтрокаТЗ.СуммаСубсидииПоКредиту;
				    СтрокаРасчетов2_2.Параметры.СуммаСкидкаПрописью = обЧислоПрописью(СтрокаТЗ.СуммаСубсидииПоКредиту,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
				Иначе
					СтрокаРасчетов2_2 = МакетОсновногоДоговора.ПолучитьОбласть("Шапка_2_6"); //вариант 6
				КонецЕсли;		
				СтрокаРасчетов2_2.Параметры.СуммаИтог1         = СтрокаТЗ.СуммаПредоплаты;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью1 = обЧислоПрописью(СтрокаТЗ.СуммаПредоплаты,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
				СтрокаРасчетов2_2.Параметры.СуммаИтог2         =  СтрокаТЗ.ОбщаяСуммаПоАвтомобилю-СтрокаТЗ.СуммаПредоплаты-СтрокаТЗ.СуммаКредита;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью2 = обЧислоПрописью( СтрокаТЗ.ОбщаяСуммаПоАвтомобилю-СтрокаТЗ.СуммаПредоплаты-СтрокаТЗ.СуммаКредита,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
				СтрокаРасчетов2_2.Параметры.СуммаИтог3         = СтрокаТЗ.СуммаКредита;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью3 = обЧислоПрописью(СтрокаТЗ.СуммаКредита,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			КонецЕсли;	
			Если ЗначениеЗаполнено(ДанныеПечати.Ссылка.ЗаявкаНаКредит) Тогда
				СтрокаРасчетов2_2.Параметры.Банк = ДанныеПечати.Ссылка.ЗаявкаНаКредит.Банк;
			КонецЕсли;
		Иначе //Наличные	
			Если ДанныеПечати.СуммаДоговора = СтрокаТЗ.СуммаПредоплаты Тогда  //вариант 1,3
				СтрокаРасчетов2_2 = МакетОсновногоДоговора.ПолучитьОбласть("Пункт2_2");
				СтрокаРасчетов2_2.Параметры.СуммаИтог         = ДанныеПечати.СуммаДоговора;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью = обЧислоПрописью(ДанныеПечати.СуммаДоговора,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			Иначе			                                                  //вариант 2,4
				СтрокаРасчетов2_2 = МакетОсновногоДоговора.ПолучитьОбласть("Шапка_2_2");
				СтрокаРасчетов2_2.Параметры.СуммаИтог1         = СтрокаТЗ.СуммаПредоплаты;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью1 = обЧислоПрописью(СтрокаТЗ.СуммаПредоплаты,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
				СтрокаРасчетов2_2.Параметры.СуммаИтог2         = ДанныеПечати.СуммаДоговора-СтрокаТЗ.СуммаПредоплаты;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью2 = обЧислоПрописью(ДанныеПечати.СуммаДоговора-СтрокаТЗ.СуммаПредоплаты,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			КонецЕсли;			
		КонецЕсли;
		
		ТабДокумент.Вывести(СтрокаРасчетов2_2);			

		Подвал = МакетОсновногоДоговора.ПолучитьОбласть("Подвал");
		ТабДокумент.Вывести(Подвал);
		
        СтрокаПодвал = МакетОсновногоДоговора.ПолучитьОбласть("СтрокаПодвал");
		СтрокаПодвал.Параметры.Продавец = ""+ДанныеПечати.ДилерНаименованиеОрганизацииКраткое + Символы.ПС+
		                                   "Юридический адрес:"+ДанныеПечати.ДилерАдресЮридический+Символы.ПС+
											 "Тел: "+ДанныеПечати.ДилерТелефон+Символы.ПС+
                                             "ИНН: "+ДанныеПечати.ДилерИНН+" КПП: "+ДанныеПечати.ДилерКПП+Символы.ПС+          
	                                         "ОГРН: "+ДанныеПечати.ДилерОГРН+Символы.ПС+
											 "р/с "+ДанныеПечати.ДилерСчет+" в"+Символы.ПС+
											 ДанныеПечати.ДилерБанк+Символы.ПС+
											 "к/с "+ДанныеПечати.ДилерКоррСчет+", БИК"+Символы.ПС+ 
											 ДанныеПечати.ДилерБИК+Символы.ПС+ 
											 "ОКВЭД: "+ДанныеПечати.ДилерОКВЭД+" ОКПО: "+ДанныеПечати.ДилерОКПО;
        СтрокаПодвал.Параметры.Покупатель = ДанныеПечати.КлиентДоговораНаименование+Символы.ПС+
		                                    "Паспорт: "+ДанныеПечати.КлиентПаспортСерия+" "+ДанныеПечати.КлиентПаспортНомер+Символы.ПС+
                                            "Выдан: "+ДанныеПечати.КлиентПаспортВыданКем+", "+Формат(ДанныеПечати.КлиентПаспортВыданДата,"ДФ=dd.MM.yyyy")+"г."+Символы.ПС+
                                            "Адрес регистрации: "+ДанныеПечати.КлиентАдрес+Символы.ПС+
											"Тел. "+ ДанныеПечати.КлиентОсновнойТелефон+Символы.ПС+
											"E-mail: "+ДанныеПечати.КлиентОсновнойEmail+Символы.ПС+
											"Дата рождения: "+ Формат(ДанныеПечати.КлиентДатаРождения,"ДФ=dd.MM.yyyy")+"г.";
											
		ТабДокумент.Вывести(СтрокаПодвал);
		
        Подписи = МакетОсновногоДоговора.ПолучитьОбласть("Подписи");
		Подписи.Параметры.НаименованиеПокупателя = ДанныеПечати.КлиентДоговораНаименование;
        Подписи.Параметры.ФИООтветственного = ?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице);
		ТабДокумент.Вывести(Подписи);
				
		Макет = Новый Структура();
		Макет.Вставить("Тип",ВРег("mxl"));
		Макет.Вставить("ПечатнаяФорма",ТабДокумент);
		Renault_УправлениеПечатьюКлиент.ПоказатьДокумент(Макет);
		
	КонецЦикла;
			
КонецПроцедуры

Процедура ПечатьОсновногоДоговораВыкупАвто(ДанныеПечати)
	
	МакетОсновногоДоговора = ПолучитьМакет("МакетОсновногоДоговораВыкупАвто");
	ОбластьШапки = МакетОсновногоДоговора.ПолучитьОбласть("Шапка");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 5;
	ТабДокумент.ПолеСправа = 5;
	СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
	
	ТЗСостав = ДанныеПечати.СоставДоговора.Выгрузить(); 
	
	Для Каждого СтрокаТЗ ИЗ ТЗСостав Цикл	 
							
		ОбластьШапки.Параметры.НаименованиеПокупателя  = ДанныеПечати.КлиентДоговораНаименование;
	    ОбластьШапки.Параметры.НаименованиеОрганизации = ДанныеПечати.ДилерНаименованиеОрганизации;						
        ОбластьШапки.Параметры.ДатаДоговора            = Формат(ДанныеПечати.ДатаДоговора,"ДФ=dd.MM.yyyy");
        ОбластьШапки.Параметры.НомерДоговора           = ДанныеПечати.НомерДоговора;
		ФИООтветственного = "";
		ПОЛ = обОпределитьПол(?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице));
		Если DMS_ФизическиеЛицаСервер.Просклонять(?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице),2,ФИООтветственного,?(ПОЛ=Перечисления.ПолФизическихЛиц.Женский,2,1)) Тогда
		КонецЕсли;

		ОбластьШапки.Параметры.ФИООтветственного = ФИООтветственного;

		ОбластьШапки.Параметры.УставОрганизации        = ДанныеПечати.ДилерПодписантНаОсновании;	
		ОбластьШапки.Параметры.Город                   = ""+ОпределитьГородДляПродвинутогоПакета();

		ОбластьШапки.Параметры.МаркаМодельПТС = ?(ЗначениеЗаполнено(СтрокаТЗ.ЗаявкаНаТрейдИн), ""+СтрокаТЗ.ЗаявкаНаТрейдИн.ПроизводительКод +" "+СтрокаТЗ.Автомобиль.Модель.Наименование,СтрокаТЗ.Автомобиль.Модель.Наименование);
		
		ТабДокумент.Вывести(ОбластьШапки);
		
		СтрокаАвтомобиль = МакетОсновногоДоговора.ПолучитьОбласть("СтрокаАвтомобиль");
		ЗаполнитьЗначенияСвойств(СтрокаАвтомобиль.Параметры, СтрокаТЗ);	
		Если Не ЗначениеЗаполнено(СтрокаТЗ.НомерШассиПТС) Тогда
			СтрокаАвтомобиль.Параметры.НомерШассиПТС = "ОТСУТСТВУЕТ";
		КонецЕсли;
		
		СтрокаАвтомобиль.Параметры.МаркаМодельПТС = ?(ЗначениеЗаполнено(СтрокаТЗ.ЗаявкаНаТрейдИн), ""+СтрокаТЗ.ЗаявкаНаТрейдИн.ПроизводительКод +" "+СтрокаТЗ.Автомобиль.Модель.Наименование,СтрокаТЗ.Автомобиль.Модель.Наименование);
		
		Если Не ЗначениеЗаполнено(СтрокаТЗ.ЦветКузоваПТС) Тогда
			СтрокаАвтомобиль.Параметры.ЦветКузоваПТС = СтрокаТЗ.Автомобиль.Цвет;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.НомерДвигателяПТС) Тогда
			СтрокаАвтомобиль.Параметры.НомерДвигателяПТС = СтрокаТЗ.Автомобиль.НомерДвигателя;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.НомерКузоваПТС) Тогда
			СтрокаАвтомобиль.Параметры.НомерКузоваПТС = СтрокаТЗ.Автомобиль.НомерКузова;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.НомерШассиПТС) Тогда
			СтрокаАвтомобиль.Параметры.НомерШассиПТС = СтрокаТЗ.Автомобиль.НомерШасси;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.ГодИзготовленияПТС) Тогда
			СтрокаАвтомобиль.Параметры.ГодИзготовленияПТС = ?(ЗначениеЗаполнено(СтрокаТЗ.ГодВыпуска),Формат(СтрокаТЗ.ГодВыпуска,"ДФ=yyyy"), Формат(СтрокаТЗ.Автомобиль.ГодВыпуска,"ДФ=yyyy"));
		КонецЕсли;	
		
		ПТС = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(СтрокаТЗ.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ТехПаспорт);
		
		Если ЗначениеЗаполнено(ПТС) Тогда
			СтрокаАвтомобиль.Параметры.ПТС     = ПТС.Серия+" "+ПТС.Номер;  
			СтрокаАвтомобиль.Параметры.ОрганизацияИзготовительПТС = ПТС.КемВыдан;
			СтрокаАвтомобиль.Параметры.АдресИзготовителяПТС = ПТС.АдресВыдачи;
			СтрокаАвтомобиль.Параметры.ДатаПТС = Формат(ПТС.ДатаВыдачи,"ДЛФ=DD");
		КонецЕсли;		

		СтрокаАвтомобиль.Параметры.ГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(СтрокаТЗ.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
		СтрокаАвтомобиль.Параметры.Пробег   = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(СтрокаТЗ.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);	
		
		ТабДокумент.Вывести(СтрокаАвтомобиль);
		
		СтрокаРасчетов2_1 = МакетОсновногоДоговора.ПолучитьОбласть("Шапка2_1");	
		
		СтрокаРасчетов2_1.Параметры.СуммаИтог         = ДанныеПечати.СуммаДоговора;
		СтрокаРасчетов2_1.Параметры.СуммаИтогПрописью = обЧислоПрописью(ДанныеПечати.СуммаДоговора,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
		СуммаВыкупа                                   = ПолучитьСуммуВыкупа(СтрокаТЗ.Автомобиль);
		
		НДСИтого                                     = ПолучитьНДС(СуммаВыкупа-ДанныеПечати.СуммаДоговора, СтавкаНДС);
		Если НДСИтого<0 Тогда
			СтрокаРасчетов2_1.Параметры.НДС          = "Без НДС";
		Иначе			
			НДСИтого          = ЛЕВ(Формат(НДСИтого, "ЧРД=,"), СтрДлина(Формат(НДСИтого, "ЧРД=,"))-3);
			НДСИтогоПрописью  = обЧислоПрописью(Цел(НДСИтого),,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			НДСКопеек         = обЧислоПрописью(НДСИтого-Цел(НДСИтого),,"Л=ru_RU;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");		
			НДСКопеек         = СтрЗаменить(НДСКопеек, "Ноль рублей ", "");	
			
			// Трояновский К.Е. 15.02.2019 11:34:55 {
			// Закомментировано по DMSCOR-1087
			//СтрокаРасчетов2_1.Параметры.НДС          = "в том числе НДС (" + ?(ДанныеПечати.ДатаДоговора < '20190101', "18", "20") + "%) - "+НДСИтого+"("+НДСИтогоПрописью+") руб. "+НДСКопеек;
			СтрокаРасчетов2_1.Параметры.НДС          = "в том числе НДС (" + Строка(СтавкаНДС.Ставка) + "%) - "+НДСИтого+"("+НДСИтогоПрописью+") руб. "+НДСКопеек;
			// Трояновский К.Е. 15.02.2019 11:34:55 }	
		КонецЕсли;

		ТабДокумент.Вывести(СтрокаРасчетов2_1);
	
		Если СтрокаТЗ.СуммаКредита <> 0 Тогда  //Кредит	
			
			Если СтрокаТЗ.ОбщаяСуммаПоАвтомобилю = СтрокаТЗ.СуммаПредоплаты+СтрокаТЗ.СуммаКредита Тогда
				СтрокаРасчетов2_2 = МакетОсновногоДоговора.ПолучитьОбласть("Шапка2_4"); 
				СтрокаРасчетов2_2.Параметры.СуммаИтог1         = СтрокаТЗ.СуммаПредоплаты;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью1 = обЧислоПрописью(СтрокаТЗ.СуммаПредоплаты,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
				СтрокаРасчетов2_2.Параметры.СуммаИтог2         = СтрокаТЗ.СуммаКредита;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью2 = обЧислоПрописью(СтрокаТЗ.СуммаКредита,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			Иначе
				СтрокаРасчетов2_2 = МакетОсновногоДоговора.ПолучитьОбласть("Шапка2_5"); 				СтрокаРасчетов2_2.Параметры.СуммаИтог1         = СтрокаТЗ.СуммаПредоплаты;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью1 = обЧислоПрописью(СтрокаТЗ.СуммаПредоплаты,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
				СтрокаРасчетов2_2.Параметры.СуммаИтог2         =  СтрокаТЗ.ОбщаяСуммаПоАвтомобилю-СтрокаТЗ.СуммаПредоплаты-СтрокаТЗ.СуммаКредита;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью2 = обЧислоПрописью( СтрокаТЗ.ОбщаяСуммаПоАвтомобилю-СтрокаТЗ.СуммаПредоплаты-СтрокаТЗ.СуммаКредита,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
				СтрокаРасчетов2_2.Параметры.СуммаИтог3         = СтрокаТЗ.СуммаКредита;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью3 = обЧислоПрописью(СтрокаТЗ.СуммаКредита,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			КонецЕсли;	
			Если ЗначениеЗаполнено(ДанныеПечати.Ссылка.ЗаявкаНаКредит) Тогда
				СтрокаРасчетов2_2.Параметры.Банк = ДанныеПечати.Ссылка.ЗаявкаНаКредит.Банк;
			КонецЕсли;
		Иначе //Наличные	
			Если ДанныеПечати.СуммаДоговора = СтрокаТЗ.СуммаПредоплаты Тогда  
				СтрокаРасчетов2_2 = МакетОсновногоДоговора.ПолучитьОбласть("Пункт2_2");
				СтрокаРасчетов2_2.Параметры.СуммаИтог         = ДанныеПечати.СуммаДоговора;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью = обЧислоПрописью(ДанныеПечати.СуммаДоговора,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			Иначе			                                                  
				СтрокаРасчетов2_2 = МакетОсновногоДоговора.ПолучитьОбласть("Пункт2_3");
				СтрокаРасчетов2_2.Параметры.СуммаИтог1         = СтрокаТЗ.СуммаПредоплаты;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью1 = обЧислоПрописью(СтрокаТЗ.СуммаПредоплаты,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
				СтрокаРасчетов2_2.Параметры.СуммаИтог2         = ДанныеПечати.СуммаДоговора-СтрокаТЗ.СуммаПредоплаты;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью2 = обЧислоПрописью(ДанныеПечати.СуммаДоговора-СтрокаТЗ.СуммаПредоплаты,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			КонецЕсли;			
		КонецЕсли;
					
		ТабДокумент.Вывести(СтрокаРасчетов2_2);			

		Подвал = МакетОсновногоДоговора.ПолучитьОбласть("Подвал");
		ТабДокумент.Вывести(Подвал);
		
        СтрокаПодвал = МакетОсновногоДоговора.ПолучитьОбласть("СтрокаПодвал");
		СтрокаПодвал.Параметры.Продавец   = ""+ДанныеПечати.ДилерНаименованиеОрганизацииКраткое + Символы.ПС+
		                                    "Юридический адрес: "+ДанныеПечати.ДилерАдресЮридический+Символы.ПС+
										    "Тел: "+ДанныеПечати.ДилерТелефон+Символы.ПС+
                                            "ИНН: "+ДанныеПечати.ДилерИНН+" КПП: "+ДанныеПечати.ДилерКПП+Символы.ПС+          
	                                        "ОГРН: "+ДанныеПечати.ДилерОГРН+Символы.ПС+
											"р/с "+ДанныеПечати.ДилерСчет+" в"+Символы.ПС+
											ДанныеПечати.ДилерБанк+Символы.ПС+
											"к/с "+ДанныеПечати.ДилерКоррСчет+", БИК"+Символы.ПС+ 
											ДанныеПечати.ДилерБИК+Символы.ПС+ 
											"ОКВЭД: "+ДанныеПечати.ДилерОКВЭД+" ОКПО: "+ДанныеПечати.ДилерОКПО;
        СтрокаПодвал.Параметры.Покупатель = ДанныеПечати.КлиентДоговораНаименование+Символы.ПС+
		                                    "Паспорт: "+ДанныеПечати.КлиентПаспортСерия+" "+ДанныеПечати.КлиентПаспортНомер+Символы.ПС+
                                            "Выдан: "+ДанныеПечати.КлиентПаспортВыданКем+", "+Формат(ДанныеПечати.КлиентПаспортВыданДата,"ДФ=dd.MM.yyyy")+"г."+Символы.ПС+
                                            "Адрес регистрации: "+ДанныеПечати.КлиентАдрес+Символы.ПС+
											"Тел. "+ ДанныеПечати.КлиентОсновнойТелефон+Символы.ПС+
											"E-mail: "+ДанныеПечати.КлиентОсновнойEmail+Символы.ПС+
											"Дата рождения: "+ Формат(ДанныеПечати.КлиентДатаРождения,"ДФ=dd.MM.yyyy")+"г.";
											
		ТабДокумент.Вывести(СтрокаПодвал);
		
        Подписи                                  = МакетОсновногоДоговора.ПолучитьОбласть("Подписи");
		Подписи.Параметры.НаименованиеПокупателя = ДанныеПечати.КлиентДоговораНаименование;
        Подписи.Параметры.ФИООтветственного      = ?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице);
		ТабДокумент.Вывести(Подписи);
				
		Макет = Новый Структура();
		Макет.Вставить("Тип",ВРег("mxl"));
		Макет.Вставить("ПечатнаяФорма",ТабДокумент);
		Renault_УправлениеПечатьюКлиент.ПоказатьДокумент(Макет);
		
	КонецЦикла;
			
КонецПроцедуры

Процедура ПечатьОсновногоДоговораДемоАвто(ДанныеПечати)
	
	МакетОсновногоДоговора = ПолучитьМакет("МакетОсновногоДоговораДемоАвто");
	ОбластьШапки = МакетОсновногоДоговора.ПолучитьОбласть("Шапка");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 5;
	ТабДокумент.ПолеСправа = 5;
	СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
	
	ТЗСостав = ДанныеПечати.СоставДоговора.Выгрузить(); 
	
	Для Каждого СтрокаТЗ ИЗ ТЗСостав Цикл	 
							
		ОбластьШапки.Параметры.НаименованиеПокупателя  = ДанныеПечати.КлиентДоговораНаименование;
	    ОбластьШапки.Параметры.НаименованиеОрганизации = ДанныеПечати.ДилерНаименованиеОрганизации;						
        ОбластьШапки.Параметры.ДатаДоговора            = Формат(ДанныеПечати.ДатаДоговора,"ДФ=dd.MM.yyyy");
        ОбластьШапки.Параметры.НомерДоговора           = ДанныеПечати.НомерДоговора;
		ФИООтветственного = "";
		ПОЛ = обОпределитьПол(?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице));
		Если DMS_ФизическиеЛицаСервер.Просклонять(?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице),2,ФИООтветственного,?(ПОЛ=Перечисления.ПолФизическихЛиц.Женский,2,1)) Тогда
		КонецЕсли;

		ОбластьШапки.Параметры.ФИООтветственного = ФИООтветственного;

		ОбластьШапки.Параметры.УставОрганизации        = ДанныеПечати.ДилерПодписантНаОсновании;	
		ОбластьШапки.Параметры.Город                   = ""+ОпределитьГородДляПродвинутогоПакета();
		
		ОбластьШапки.Параметры.МаркаМодельПТС = ?(ЗначениеЗаполнено(СтрокаТЗ.ЗаявкаНаТрейдИн), ""+СтрокаТЗ.ЗаявкаНаТрейдИн.ПроизводительКод +" "+СтрокаТЗ.Автомобиль.Модель.Наименование,СтрокаТЗ.Автомобиль.Модель.Наименование);
		
		ТабДокумент.Вывести(ОбластьШапки);
		
		СтрокаАвтомобиль = МакетОсновногоДоговора.ПолучитьОбласть("СтрокаАвтомобиль");
		ЗаполнитьЗначенияСвойств(СтрокаАвтомобиль.Параметры, СтрокаТЗ);	
		Если Не ЗначениеЗаполнено(СтрокаТЗ.НомерШассиПТС) Тогда
			СтрокаАвтомобиль.Параметры.НомерШассиПТС = "ОТСУТСТВУЕТ";
		КонецЕсли;
		
		СтрокаАвтомобиль.Параметры.МаркаМодельПТС = ?(ЗначениеЗаполнено(СтрокаТЗ.ЗаявкаНаТрейдИн), ""+СтрокаТЗ.ЗаявкаНаТрейдИн.ПроизводительКод +" "+СтрокаТЗ.Автомобиль.Модель.Наименование,СтрокаТЗ.Автомобиль.Модель.Наименование);

		Если Не ЗначениеЗаполнено(СтрокаТЗ.ЦветКузоваПТС) Тогда
			СтрокаАвтомобиль.Параметры.ЦветКузоваПТС = СтрокаТЗ.Автомобиль.Цвет;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.НомерДвигателяПТС) Тогда
			СтрокаАвтомобиль.Параметры.НомерДвигателяПТС = СтрокаТЗ.Автомобиль.НомерДвигателя;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.НомерКузоваПТС) Тогда
			СтрокаАвтомобиль.Параметры.НомерКузоваПТС = СтрокаТЗ.Автомобиль.НомерКузова;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.НомерШассиПТС) Тогда
			СтрокаАвтомобиль.Параметры.НомерШассиПТС = СтрокаТЗ.Автомобиль.НомерШасси;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.ГодИзготовленияПТС) Тогда
			СтрокаАвтомобиль.Параметры.ГодИзготовленияПТС = ?(ЗначениеЗаполнено(СтрокаТЗ.ГодВыпуска),Формат(СтрокаТЗ.ГодВыпуска,"ДФ=yyyy"), Формат(СтрокаТЗ.Автомобиль.ГодВыпуска,"ДФ=yyyy"));
		КонецЕсли;	
		
		ПТС = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(СтрокаТЗ.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ТехПаспорт);
		
		Если ЗначениеЗаполнено(ПТС) Тогда
			СтрокаАвтомобиль.Параметры.ПТС     = ПТС.Серия+" "+ПТС.Номер;  
			СтрокаАвтомобиль.Параметры.ОрганизацияИзготовительПТС = ПТС.КемВыдан;
			СтрокаАвтомобиль.Параметры.АдресИзготовителяПТС = ПТС.АдресВыдачи;
			СтрокаАвтомобиль.Параметры.ДатаПТС = Формат(ПТС.ДатаВыдачи,"ДЛФ=DD");
		КонецЕсли;		

		СтрокаАвтомобиль.Параметры.ГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(СтрокаТЗ.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
		СтрокаАвтомобиль.Параметры.Пробег   = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(СтрокаТЗ.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);	
		
		ТабДокумент.Вывести(СтрокаАвтомобиль);
		
		СтрокаРасчетов2_1 = МакетОсновногоДоговора.ПолучитьОбласть("Шапка2_1");	
		
		СтрокаРасчетов2_1.Параметры.СуммаИтог         = ДанныеПечати.СуммаДоговора;
		СтрокаРасчетов2_1.Параметры.СуммаИтогПрописью = обЧислоПрописью(ДанныеПечати.СуммаДоговора,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
		
		НДСИтого                                      = ПолучитьНДС(ДанныеПечати.СуммаДоговора, СтавкаНДС);
		СтрокаРасчетов2_1.Параметры.НДСИтого          = ЛЕВ(Формат(НДСИтого, "ЧРД=,"), СтрДлина(Формат(НДСИтого, "ЧРД=,"))-3);
		СтрокаРасчетов2_1.Параметры.НДСИтогоПрописью  = обЧислоПрописью(Цел(НДСИтого),,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
		НДСКопеек         = обЧислоПрописью(НДСИтого-Цел(НДСИтого),,"Л=ru_RU;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");		
		СтрокаРасчетов2_1.Параметры.НДСКопеек         = СтрЗаменить(НДСКопеек, "Ноль рублей ", "");	
			
		ТабДокумент.Вывести(СтрокаРасчетов2_1);
	
		Если СтрокаТЗ.СуммаКредита <> 0 Тогда  //Кредит	
			
			Если СтрокаТЗ.ОбщаяСуммаПоАвтомобилю = СтрокаТЗ.СуммаПредоплаты+СтрокаТЗ.СуммаКредита Тогда
				СтрокаРасчетов2_2 = МакетОсновногоДоговора.ПолучитьОбласть("Шапка2_4"); 
				СтрокаРасчетов2_2.Параметры.СуммаИтог1         = СтрокаТЗ.СуммаПредоплаты;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью1 = обЧислоПрописью(СтрокаТЗ.СуммаПредоплаты,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
				СтрокаРасчетов2_2.Параметры.СуммаИтог2         = СтрокаТЗ.СуммаКредита;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью2 = обЧислоПрописью(СтрокаТЗ.СуммаКредита,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			Иначе
				СтрокаРасчетов2_2 = МакетОсновногоДоговора.ПолучитьОбласть("Шапка2_5"); 				СтрокаРасчетов2_2.Параметры.СуммаИтог1         = СтрокаТЗ.СуммаПредоплаты;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью1 = обЧислоПрописью(СтрокаТЗ.СуммаПредоплаты,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
				СтрокаРасчетов2_2.Параметры.СуммаИтог2         =  СтрокаТЗ.ОбщаяСуммаПоАвтомобилю-СтрокаТЗ.СуммаПредоплаты-СтрокаТЗ.СуммаКредита;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью2 = обЧислоПрописью( СтрокаТЗ.ОбщаяСуммаПоАвтомобилю-СтрокаТЗ.СуммаПредоплаты-СтрокаТЗ.СуммаКредита,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
				СтрокаРасчетов2_2.Параметры.СуммаИтог3         = СтрокаТЗ.СуммаКредита;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью3 = обЧислоПрописью(СтрокаТЗ.СуммаКредита,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			КонецЕсли;	
			Если ЗначениеЗаполнено(ДанныеПечати.Ссылка.ЗаявкаНаКредит) Тогда
				СтрокаРасчетов2_2.Параметры.Банк = ДанныеПечати.Ссылка.ЗаявкаНаКредит.Банк;
			КонецЕсли;
		Иначе //Наличные	
			Если ДанныеПечати.СуммаДоговора = СтрокаТЗ.СуммаПредоплаты Тогда  
				СтрокаРасчетов2_2 = МакетОсновногоДоговора.ПолучитьОбласть("Пункт2_2");
				СтрокаРасчетов2_2.Параметры.СуммаИтог         = ДанныеПечати.СуммаДоговора;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью = обЧислоПрописью(ДанныеПечати.СуммаДоговора,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			Иначе			                                                  
				СтрокаРасчетов2_2 = МакетОсновногоДоговора.ПолучитьОбласть("Пункт2_3");
				СтрокаРасчетов2_2.Параметры.СуммаИтог1         = СтрокаТЗ.СуммаПредоплаты;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью1 = обЧислоПрописью(СтрокаТЗ.СуммаПредоплаты,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
				СтрокаРасчетов2_2.Параметры.СуммаИтог2         = ДанныеПечати.СуммаДоговора-СтрокаТЗ.СуммаПредоплаты;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью2 = обЧислоПрописью(ДанныеПечати.СуммаДоговора-СтрокаТЗ.СуммаПредоплаты,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			КонецЕсли;			
		КонецЕсли;
					
		ТабДокумент.Вывести(СтрокаРасчетов2_2);			

		Подвал = МакетОсновногоДоговора.ПолучитьОбласть("Подвал");
		ТабДокумент.Вывести(Подвал);
		
        СтрокаПодвал = МакетОсновногоДоговора.ПолучитьОбласть("СтрокаПодвал");
		СтрокаПодвал.Параметры.Продавец   = ""+ДанныеПечати.ДилерНаименованиеОрганизацииКраткое + Символы.ПС+
		                                    "Юридический адрес: "+ДанныеПечати.ДилерАдресЮридический+Символы.ПС+
										    "Тел: "+ДанныеПечати.ДилерТелефон+Символы.ПС+
                                            "ИНН: "+ДанныеПечати.ДилерИНН+" КПП: "+ДанныеПечати.ДилерКПП+Символы.ПС+          
	                                        "ОГРН: "+ДанныеПечати.ДилерОГРН+Символы.ПС+
											"р/с "+ДанныеПечати.ДилерСчет+" в"+Символы.ПС+
											ДанныеПечати.ДилерБанк+Символы.ПС+
											"к/с "+ДанныеПечати.ДилерКоррСчет+", БИК"+Символы.ПС+ 
											ДанныеПечати.ДилерБИК+Символы.ПС+ 
											"ОКВЭД: "+ДанныеПечати.ДилерОКВЭД+" ОКПО: "+ДанныеПечати.ДилерОКПО;
        СтрокаПодвал.Параметры.Покупатель = ДанныеПечати.КлиентДоговораНаименование+Символы.ПС+
		                                    "Паспорт: "+ДанныеПечати.КлиентПаспортСерия+" "+ДанныеПечати.КлиентПаспортНомер+Символы.ПС+
                                            "Выдан: "+ДанныеПечати.КлиентПаспортВыданКем+", "+Формат(ДанныеПечати.КлиентПаспортВыданДата,"ДФ=dd.MM.yyyy")+"г."+Символы.ПС+
                                            "Адрес регистрации: "+ДанныеПечати.КлиентАдрес+Символы.ПС+
											"Тел. "+ ДанныеПечати.КлиентОсновнойТелефон+Символы.ПС+
											"E-mail: "+ДанныеПечати.КлиентОсновнойEmail+Символы.ПС+
											"Дата рождения: "+ Формат(ДанныеПечати.КлиентДатаРождения,"ДФ=dd.MM.yyyy")+"г.";
											
		ТабДокумент.Вывести(СтрокаПодвал);
		
        Подписи                                  = МакетОсновногоДоговора.ПолучитьОбласть("Подписи");
		Подписи.Параметры.НаименованиеПокупателя = ДанныеПечати.КлиентДоговораНаименование;
        Подписи.Параметры.ФИООтветственного      = ?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице);
		ТабДокумент.Вывести(Подписи);
				
		Макет = Новый Структура();
		Макет.Вставить("Тип",ВРег("mxl"));
		Макет.Вставить("ПечатнаяФорма",ТабДокумент);
		Renault_УправлениеПечатьюКлиент.ПоказатьДокумент(Макет);
		
	КонецЦикла;
			
КонецПроцедуры

Функция ПолучитьСуммуВыкупа(Автомобиль)
	
	Если Не ЗначениеЗаполнено(Автомобиль) Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеАвтомобилейАвтомобили.СуммаВсего
	               |ИЗ
	               |	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
	               |ГДЕ
	               |	ПоступлениеАвтомобилейАвтомобили.Автомобиль = &Автомобиль
	               |	И ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат 0;
	Иначе
		Возврат Результат.Выгрузить()[0].СуммаВсего;	 
	КонецЕсли;

КонецФункции

Процедура ПечатьОсновногоДоговораКомисАвто(ДанныеПечати)
	
	МакетОсновногоДоговора = ПолучитьМакет("МакетОсновногоДоговораКомисАвто");
	ОбластьШапки = МакетОсновногоДоговора.ПолучитьОбласть("Шапка");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 5;
	ТабДокумент.ПолеСправа = 5;
	СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
	
	ТЗСостав = ДанныеПечати.СоставДоговора.Выгрузить(); 
	
	Для Каждого СтрокаТЗ ИЗ ТЗСостав Цикл	 
							
		ОбластьШапки.Параметры.НаименованиеПокупателя  = ДанныеПечати.КлиентДоговораНаименование;
	    ОбластьШапки.Параметры.НаименованиеОрганизации = ДанныеПечати.ДилерНаименованиеОрганизации;						
        ОбластьШапки.Параметры.ДатаДоговора            = Формат(ДанныеПечати.ДатаДоговора,"ДФ=dd.MM.yyyy");
        ОбластьШапки.Параметры.НомерДоговора           = ДанныеПечати.НомерДоговора;
		ФИООтветственного = "";
		ПОЛ = обОпределитьПол(?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице));
		Если DMS_ФизическиеЛицаСервер.Просклонять(?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице),2,ФИООтветственного,?(ПОЛ=Перечисления.ПолФизическихЛиц.Женский,2,1)) Тогда
		КонецЕсли;

		ОбластьШапки.Параметры.ФИООтветственного = ФИООтветственного;

		ОбластьШапки.Параметры.УставОрганизации        = ДанныеПечати.ДилерПодписантНаОсновании;	
		ОбластьШапки.Параметры.Город                   = ""+ОпределитьГородДляПродвинутогоПакета();

		ОбластьШапки.Параметры.МаркаМодельПТС = ?(ЗначениеЗаполнено(СтрокаТЗ.ЗаявкаНаТрейдИн), ""+СтрокаТЗ.ЗаявкаНаТрейдИн.ПроизводительКод +" "+СтрокаТЗ.Автомобиль.Модель.Наименование,СтрокаТЗ.Автомобиль.Модель.Наименование);
		
		ТабДокумент.Вывести(ОбластьШапки);
		
		СтрокаАвтомобиль = МакетОсновногоДоговора.ПолучитьОбласть("СтрокаАвтомобиль");
		ЗаполнитьЗначенияСвойств(СтрокаАвтомобиль.Параметры, СтрокаТЗ);	
		Если Не ЗначениеЗаполнено(СтрокаТЗ.НомерШассиПТС) Тогда
			СтрокаАвтомобиль.Параметры.НомерШассиПТС = "ОТСУТСТВУЕТ";
		КонецЕсли;
		СтрокаАвтомобиль.Параметры.МаркаМодельПТС = ?(ЗначениеЗаполнено(СтрокаТЗ.ЗаявкаНаТрейдИн), ""+СтрокаТЗ.ЗаявкаНаТрейдИн.ПроизводительКод +" "+СтрокаТЗ.Автомобиль.Модель.Наименование,СтрокаТЗ.Автомобиль.Модель.Наименование);
		
		Если Не ЗначениеЗаполнено(СтрокаТЗ.ЦветКузоваПТС) Тогда
			СтрокаАвтомобиль.Параметры.ЦветКузоваПТС = СтрокаТЗ.Автомобиль.Цвет;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.НомерДвигателяПТС) Тогда
			СтрокаАвтомобиль.Параметры.НомерДвигателяПТС = СтрокаТЗ.Автомобиль.НомерДвигателя;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.НомерКузоваПТС) Тогда
			СтрокаАвтомобиль.Параметры.НомерКузоваПТС = СтрокаТЗ.Автомобиль.НомерКузова;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.НомерШассиПТС) Тогда
			СтрокаАвтомобиль.Параметры.НомерШассиПТС = СтрокаТЗ.Автомобиль.НомерШасси;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.ГодИзготовленияПТС) Тогда
			СтрокаАвтомобиль.Параметры.ГодИзготовленияПТС = ?(ЗначениеЗаполнено(СтрокаТЗ.ГодВыпуска),Формат(СтрокаТЗ.ГодВыпуска,"ДФ=yyyy"), Формат(СтрокаТЗ.Автомобиль.ГодВыпуска,"ДФ=yyyy"));
		КонецЕсли;	
		
		ПТС = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(СтрокаТЗ.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ТехПаспорт);
		
		Если ЗначениеЗаполнено(ПТС) Тогда
			СтрокаАвтомобиль.Параметры.ПТС     = ПТС.Серия+" "+ПТС.Номер;  
			СтрокаАвтомобиль.Параметры.ОрганизацияИзготовительПТС = ПТС.КемВыдан;
			СтрокаАвтомобиль.Параметры.АдресИзготовителяПТС = ПТС.АдресВыдачи;
			СтрокаАвтомобиль.Параметры.ДатаПТС = Формат(ПТС.ДатаВыдачи,"ДЛФ=DD");
		КонецЕсли;		

		СтрокаАвтомобиль.Параметры.ГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(СтрокаТЗ.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
		СтрокаАвтомобиль.Параметры.Пробег   = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(СтрокаТЗ.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);	
		
		ТабДокумент.Вывести(СтрокаАвтомобиль);
		
		СтрокаРасчетов2_1 = МакетОсновногоДоговора.ПолучитьОбласть("Шапка2_1");	
		
		СтрокаРасчетов2_1.Параметры.СуммаИтог         = ДанныеПечати.СуммаДоговора;
		СтрокаРасчетов2_1.Параметры.СуммаИтогПрописью = обЧислоПрописью(ДанныеПечати.СуммаДоговора,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
		
		ТабДокумент.Вывести(СтрокаРасчетов2_1);
		
		Если СтрокаТЗ.СуммаКредита <> 0 Тогда  //Кредит	
			
			Если СтрокаТЗ.ОбщаяСуммаПоАвтомобилю = СтрокаТЗ.СуммаПредоплаты+СтрокаТЗ.СуммаКредита Тогда
				СтрокаРасчетов2_2 = МакетОсновногоДоговора.ПолучитьОбласть("Шапка2_4"); 
				СтрокаРасчетов2_2.Параметры.СуммаИтог1         = СтрокаТЗ.СуммаПредоплаты;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью1 = обЧислоПрописью(СтрокаТЗ.СуммаПредоплаты,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
				СтрокаРасчетов2_2.Параметры.СуммаИтог2         = СтрокаТЗ.СуммаКредита;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью2 = обЧислоПрописью(СтрокаТЗ.СуммаКредита,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			Иначе
				СтрокаРасчетов2_2 = МакетОсновногоДоговора.ПолучитьОбласть("Шапка2_5"); 				СтрокаРасчетов2_2.Параметры.СуммаИтог1         = СтрокаТЗ.СуммаПредоплаты;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью1 = обЧислоПрописью(СтрокаТЗ.СуммаПредоплаты,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
				СтрокаРасчетов2_2.Параметры.СуммаИтог2         =  СтрокаТЗ.ОбщаяСуммаПоАвтомобилю-СтрокаТЗ.СуммаПредоплаты-СтрокаТЗ.СуммаКредита;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью2 = обЧислоПрописью( СтрокаТЗ.ОбщаяСуммаПоАвтомобилю-СтрокаТЗ.СуммаПредоплаты-СтрокаТЗ.СуммаКредита,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
				СтрокаРасчетов2_2.Параметры.СуммаИтог3         = СтрокаТЗ.СуммаКредита;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью3 = обЧислоПрописью(СтрокаТЗ.СуммаКредита,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			КонецЕсли;	
			Если ЗначениеЗаполнено(ДанныеПечати.Ссылка.ЗаявкаНаКредит) Тогда
				СтрокаРасчетов2_2.Параметры.Банк = ДанныеПечати.Ссылка.ЗаявкаНаКредит.Банк;
			КонецЕсли;
		Иначе //Наличные	
			Если ДанныеПечати.СуммаДоговора = СтрокаТЗ.СуммаПредоплаты Тогда  
				СтрокаРасчетов2_2 = МакетОсновногоДоговора.ПолучитьОбласть("Пункт2_2");
				СтрокаРасчетов2_2.Параметры.СуммаИтог         = ДанныеПечати.СуммаДоговора;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью = обЧислоПрописью(ДанныеПечати.СуммаДоговора,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			Иначе			                                                  
				СтрокаРасчетов2_2 = МакетОсновногоДоговора.ПолучитьОбласть("Пункт2_3");
				СтрокаРасчетов2_2.Параметры.СуммаИтог1         = СтрокаТЗ.СуммаПредоплаты;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью1 = обЧислоПрописью(СтрокаТЗ.СуммаПредоплаты,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
				СтрокаРасчетов2_2.Параметры.СуммаИтог2         = ДанныеПечати.СуммаДоговора-СтрокаТЗ.СуммаПредоплаты;
				СтрокаРасчетов2_2.Параметры.СуммаИтогПрописью2 = обЧислоПрописью(ДанныеПечати.СуммаДоговора-СтрокаТЗ.СуммаПредоплаты,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
			КонецЕсли;			
		КонецЕсли;
			
		ТабДокумент.Вывести(СтрокаРасчетов2_2);			

		Подвал = МакетОсновногоДоговора.ПолучитьОбласть("Подвал");
		ТабДокумент.Вывести(Подвал);
		
        СтрокаПодвал = МакетОсновногоДоговора.ПолучитьОбласть("СтрокаПодвал");
		СтрокаПодвал.Параметры.Продавец   = ""+ДанныеПечати.ДилерНаименованиеОрганизацииКраткое + Символы.ПС+
		                                    "Юридический адрес: "+ДанныеПечати.ДилерАдресЮридический+Символы.ПС+
										    "Тел: "+ДанныеПечати.ДилерТелефон+Символы.ПС+
                                            "ИНН: "+ДанныеПечати.ДилерИНН+" КПП: "+ДанныеПечати.ДилерКПП+Символы.ПС+          
	                                        "ОГРН: "+ДанныеПечати.ДилерОГРН+Символы.ПС+
											"р/с "+ДанныеПечати.ДилерСчет+" в"+Символы.ПС+
											ДанныеПечати.ДилерБанк+Символы.ПС+
											"к/с "+ДанныеПечати.ДилерКоррСчет+", БИК"+Символы.ПС+ 
											ДанныеПечати.ДилерБИК+Символы.ПС+ 
											"ОКВЭД: "+ДанныеПечати.ДилерОКВЭД+" ОКПО: "+ДанныеПечати.ДилерОКПО;
        СтрокаПодвал.Параметры.Покупатель = ДанныеПечати.КлиентДоговораНаименование+Символы.ПС+
		                                    "Паспорт: "+ДанныеПечати.КлиентПаспортСерия+" "+ДанныеПечати.КлиентПаспортНомер+Символы.ПС+
                                            "Выдан: "+ДанныеПечати.КлиентПаспортВыданКем+", "+Формат(ДанныеПечати.КлиентПаспортВыданДата,"ДФ=dd.MM.yyyy")+"г."+Символы.ПС+
                                            "Адрес регистрации: "+ДанныеПечати.КлиентАдрес+Символы.ПС+
											"Тел. "+ ДанныеПечати.КлиентОсновнойТелефон+Символы.ПС+
											"E-mail: "+ДанныеПечати.КлиентОсновнойEmail+Символы.ПС+
											"Дата рождения: "+ Формат(ДанныеПечати.КлиентДатаРождения,"ДФ=dd.MM.yyyy")+"г.";
											
		ТабДокумент.Вывести(СтрокаПодвал);
		
        Подписи                                  = МакетОсновногоДоговора.ПолучитьОбласть("Подписи");
		Подписи.Параметры.НаименованиеПокупателя = ДанныеПечати.КлиентДоговораНаименование;
        Подписи.Параметры.ФИООтветственного      = ?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице);
		ТабДокумент.Вывести(Подписи);
				
		Макет = Новый Структура();
		Макет.Вставить("Тип",ВРег("mxl"));
		Макет.Вставить("ПечатнаяФорма",ТабДокумент);
		Renault_УправлениеПечатьюКлиент.ПоказатьДокумент(Макет);
		
	КонецЦикла;
			
КонецПроцедуры

Процедура ПечатьОсновногоДоговораАгентАвто(ДанныеПечати)
	
	МакетОсновногоДоговора = ПолучитьМакет("МакетОсновногоДоговораАгентАвто");
	ОбластьШапки = МакетОсновногоДоговора.ПолучитьОбласть("Шапка");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 5;
	ТабДокумент.ПолеСправа = 5;
	СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
	
	ТЗСостав = ДанныеПечати.СоставДоговора.Выгрузить(); 
	
	Для Каждого СтрокаТЗ ИЗ ТЗСостав Цикл	 
		
		ДанныеАгента = ПолучитьДанныеАгента(СтрокаТЗ.Автомобиль);
							
		ОбластьШапки.Параметры.НаименованиеПокупателя  = ДанныеПечати.КлиентДоговораНаименование;
	    ОбластьШапки.Параметры.НаименованиеОрганизации = ДанныеПечати.ДилерНаименованиеОрганизацииКраткое;	
		Если ЗначениеЗаполнено(ДанныеАгента) Тогда
			ОбластьШапки.Параметры.Агент               = ДанныеАгента.Агент;
			ОбластьШапки.Параметры.УставОрганизации        = "Доверенности (Приложение №2 к Агентскому договору № "+ДанныеАгента.НомерДоговора+" от "+Формат(ДанныеАгента.ДатаДоговора, "ДЛФ=DD");	
		КонецЕсли;
        ОбластьШапки.Параметры.ДатаДоговора            = Формат(ДанныеПечати.ДатаДоговора, "ДФ=dd.MM.yyyy");
        ОбластьШапки.Параметры.НомерДоговора           = ДанныеПечати.НомерДоговора;
		ФИООтветственного = "";
		ПОЛ = обОпределитьПол(?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице));
		Если DMS_ФизическиеЛицаСервер.Просклонять(?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице),2,ФИООтветственного,?(ПОЛ=Перечисления.ПолФизическихЛиц.Женский,2,1)) Тогда
		КонецЕсли;

		ОбластьШапки.Параметры.ФИООтветственного = ФИООтветственного;
		ОбластьШапки.Параметры.Город                   = ""+ОпределитьГородДляПродвинутогоПакета();

		ТабДокумент.Вывести(ОбластьШапки);
		
		СтрокаАвтомобиль = МакетОсновногоДоговора.ПолучитьОбласть("СтрокаАвтомобиль");
		ЗаполнитьЗначенияСвойств(СтрокаАвтомобиль.Параметры, СтрокаТЗ);	
		
		Если ЗначениеЗаполнено(ДанныеАгента) Тогда
			СтрокаАвтомобиль.Параметры.НомерДоговораАгента = ДанныеАгента.НомерДоговора;
			СтрокаАвтомобиль.Параметры.ДатаДоговораАгента  = Формат(ДанныеАгента.ДатаДоговора, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТЗ.НомерШассиПТС) Тогда
			СтрокаАвтомобиль.Параметры.НомерШассиПТС = "ОТСУТСТВУЕТ";
		КонецЕсли;
		СтрокаАвтомобиль.Параметры.МаркаМодельПТС = ?(ЗначениеЗаполнено(СтрокаТЗ.ЗаявкаНаТрейдИн), ""+СтрокаТЗ.ЗаявкаНаТрейдИн.ПроизводительКод +" "+СтрокаТЗ.Автомобиль.Модель.Наименование,СтрокаТЗ.Автомобиль.Модель.Наименование);

		Если Не ЗначениеЗаполнено(СтрокаТЗ.ЦветКузоваПТС) Тогда
			СтрокаАвтомобиль.Параметры.ЦветКузоваПТС = СтрокаТЗ.Автомобиль.Цвет;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.НомерДвигателяПТС) Тогда
			СтрокаАвтомобиль.Параметры.НомерДвигателяПТС = СтрокаТЗ.Автомобиль.НомерДвигателя;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.НомерКузоваПТС) Тогда
			СтрокаАвтомобиль.Параметры.НомерКузоваПТС = СтрокаТЗ.Автомобиль.НомерКузова;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.НомерШассиПТС) Тогда
			СтрокаАвтомобиль.Параметры.НомерШассиПТС = СтрокаТЗ.Автомобиль.НомерШасси;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.ГодИзготовленияПТС) Тогда
			СтрокаАвтомобиль.Параметры.ГодИзготовленияПТС = ?(ЗначениеЗаполнено(СтрокаТЗ.ГодВыпуска),Формат(СтрокаТЗ.ГодВыпуска,"ДФ=yyyy"), Формат(СтрокаТЗ.Автомобиль.ГодВыпуска,"ДФ=yyyy"));
		КонецЕсли;	
		
		ПТС = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(СтрокаТЗ.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ТехПаспорт);
		
		Если ЗначениеЗаполнено(ПТС) Тогда
			СтрокаАвтомобиль.Параметры.ПТС     = ПТС.Серия+" "+ПТС.Номер;  
			СтрокаАвтомобиль.Параметры.ОрганизацияИзготовительПТС = ПТС.КемВыдан;
			СтрокаАвтомобиль.Параметры.АдресИзготовителяПТС = ПТС.АдресВыдачи;
			СтрокаАвтомобиль.Параметры.ДатаПТС = Формат(ПТС.ДатаВыдачи,"ДЛФ=DD");
		КонецЕсли;		

		СтрокаАвтомобиль.Параметры.ГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(СтрокаТЗ.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
		СтрокаАвтомобиль.Параметры.Пробег   = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(СтрокаТЗ.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);	
		
		ТабДокумент.Вывести(СтрокаАвтомобиль);
		
		СтрокаРасчетов2_1 = МакетОсновногоДоговора.ПолучитьОбласть("Шапка2_1");	
		
		СтрокаРасчетов2_1.Параметры.СуммаИтог         = ДанныеПечати.СуммаДоговора;
		СтрокаРасчетов2_1.Параметры.СуммаИтогПрописью = обЧислоПрописью(ДанныеПечати.СуммаДоговора,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
		
		ТабДокумент.Вывести(СтрокаРасчетов2_1);
		
		СтрокаРасчетов2_2 = МакетОсновногоДоговора.ПолучитьОбласть("Пункт2_2");

		Если ЗначениеЗаполнено(ДанныеАгента) Тогда
			СтрокаРасчетов2_2.Параметры.НомерДоговораАгента = ДанныеАгента.НомерДоговора;
			СтрокаРасчетов2_2.Параметры.ДатаДоговораАгента  = Формат(ДанныеАгента.ДатаДоговора, "ДФ=dd.MM.yyyy");
		КонецЕсли;
			
		ТабДокумент.Вывести(СтрокаРасчетов2_2);			

		Подвал = МакетОсновногоДоговора.ПолучитьОбласть("Подвал");
		ТабДокумент.Вывести(Подвал);
		
        СтрокаПодвал = МакетОсновногоДоговора.ПолучитьОбласть("СтрокаПодвал");
		
		Если ЗначениеЗаполнено(ДанныеАгента) Тогда

			СтрокаПодвал.Параметры.Продавец = ДанныеАгента.Агент+Символы.ПС+
			                                    "Паспорт: "+ДанныеАгента.Серия+" "+ДанныеАгента.Номер+Символы.ПС+
	                                            "Выдан: "+ДанныеАгента.КемВыдан+", "+Формат(ДанныеАгента.ДатаВыдачи,"ДФ=dd.MM.yyyy")+"г."+Символы.ПС+
	                                            "Адрес регистрации: "+ДанныеАгента.Адрес+Символы.ПС+
												"Тел. "+ ДанныеАгента.ОсновнойТелефон+Символы.ПС+
												"E-mail: "+ДанныеАгента.Email+Символы.ПС+
												"Дата рождения: "+ Формат(ДанныеАгента.ДатаРождения,"ДФ=dd.MM.yyyy")+"г.";
												
		КонецЕсли;

        СтрокаПодвал.Параметры.Покупатель = ДанныеПечати.КлиентДоговораНаименование+Символы.ПС+
		                                    "Паспорт: "+ДанныеПечати.КлиентПаспортСерия+" "+ДанныеПечати.КлиентПаспортНомер+Символы.ПС+
                                            "Выдан: "+ДанныеПечати.КлиентПаспортВыданКем+", "+Формат(ДанныеПечати.КлиентПаспортВыданДата,"ДФ=dd.MM.yyyy")+"г."+Символы.ПС+
                                            "Адрес регистрации: "+ДанныеПечати.КлиентАдрес+Символы.ПС+
											"Тел. "+ ДанныеПечати.КлиентОсновнойТелефон+Символы.ПС+
											"E-mail: "+ДанныеПечати.КлиентОсновнойEmail+Символы.ПС+
											"Дата рождения: "+ Формат(ДанныеПечати.КлиентДатаРождения,"ДФ=dd.MM.yyyy")+"г.";
											
		ТабДокумент.Вывести(СтрокаПодвал);
		
        Подписи                                  = МакетОсновногоДоговора.ПолучитьОбласть("Подписи");
		
		ФИООтветственного                       = ?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице);
		Фамилия  = ЛЕВ(ФИООтветственного, Найти(ФИООтветственного," ")-1);
		ФИООтветственного = ПРАВ(ФИООтветственного, СтрДлина(ФИООтветственного)-СтрДлина(Фамилия)-1);
		Имя      = ЛЕВ(ФИООтветственного, Найти(ФИООтветственного," ")-1);
        ФИООтветственного = ПРАВ(ФИООтветственного, СтрДлина(ФИООтветственного)-СтрДлина(Имя)-1);
		Отчество = ФИООтветственного;
		Подписи.Параметры.ФИООтветственного      = Фамилия+" "+ЛЕВ(Имя,1)+"."+ЛЕВ(Отчество,1)+".";
		Подписи.Параметры.НаименованиеПокупателя = ДанныеПечати.КлиентФамилия+" "+ЛЕВ(ДанныеПечати.КлиентИмя,1)+ "."+ЛЕВ(ДанныеПечати.КлиентОтчество,1)+".";

		ТабДокумент.Вывести(Подписи);
				
		Макет = Новый Структура();
		Макет.Вставить("Тип",ВРег("mxl"));
		Макет.Вставить("ПечатнаяФорма",ТабДокумент);
		Renault_УправлениеПечатьюКлиент.ПоказатьДокумент(Макет);
		
	КонецЦикла;
			
КонецПроцедуры

Функция ПолучитьДанныеАгента(Автомобиль)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент.Наименование КАК Агент,
	|	ПоступлениеАвтомобилейАвтомобили.Ссылка.ДоговорВзаиморасчетов.ДатаНачала КАК ДатаДоговора,
	|	ПоступлениеАвтомобилейАвтомобили.Ссылка.ДоговорВзаиморасчетов.НомерДоговора КАК НомерДоговора,
	|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент.ОсновнойТелефон КАК ОсновнойТелефон,
	|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент.ДатаРождения КАК ДатаРождения,
	|	ПодтверждающиеДокументы.КемВыдан,
	|	ПодтверждающиеДокументы.Серия,
	|	ПодтверждающиеДокументы.Номер,
	|	ПодтверждающиеДокументы.ДатаВыдачи,
	|	КонтактнаяИнформацияЭмейл.Представление КАК Email,
	|	КонтактнаяИнформация.Представление КАК Адрес
	|ИЗ
	|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|		ПО ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент = ПодтверждающиеДокументы.Владелец
	|			И (ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = &Паспорт)
	|			И (ПодтверждающиеДокументы.Текущий)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресФактический))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияЭмейл
	|		ПО ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент = КонтактнаяИнформацияЭмейл.Объект
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий))
	|ГДЕ
	|	ПоступлениеАвтомобилейАвтомобили.Автомобиль = &Автомобиль
	|	И ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("Паспорт", Перечисления.ВидыДокументов.Паспорт);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат.Выгрузить()[0];
	КонецЕсли;
	
КонецФункции

Процедура ПечатьГарантийноеПисьмо(ДанныеПечати)
	
	МакетГарантийноеПисьмо = ПолучитьМакет("МакетГарантийноеПисьмо");
	ОбластьШапки           = МакетГарантийноеПисьмо.ПолучитьОбласть("Шапка");
	ТабДокумент            = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева  = 5;
	ТабДокумент.ПолеСправа = 5;
	ТЗСостав               = ДанныеПечати.СоставДоговора.Выгрузить(); 
	
	Для Каждого СтрокаТЗ ИЗ ТЗСостав Цикл	 

		ОбластьШапки.Параметры.МестоПередачи = "От: " +ДанныеПечати.ДилерНаименованиеОрганизацииКраткое + Символы.ПС+
		                                               ДанныеПечати.ДилерАдресЮридический+Символы.ПС+
											 "Тел: "  +ДанныеПечати.ДилерТелефон+Символы.ПС+
                                             "ИНН: "  +ДанныеПечати.ДилерИНН+" КПП: "+ДанныеПечати.ДилерКПП+Символы.ПС+          
	                                         "ОГРН: " +ДанныеПечати.ДилерОГРН+Символы.ПС+
											 "р/с "   +ДанныеПечати.ДилерСчет+" в"+Символы.ПС+
											           ДанныеПечати.ДилерБанк+Символы.ПС+
											 "к/с "   +ДанныеПечати.ДилерКоррСчет+", БИК"+Символы.ПС+ 
											           ДанныеПечати.ДилерБИК+Символы.ПС+ 
											 "ОКВЭД: "+ДанныеПечати.ДилерОКВЭД+" ОКПО: "+ДанныеПечати.ДилерОКПО;
											 
		ОбластьШапки.Параметры.Кому          = "Кому: "   +ДанныеПечати.Ссылка.ЗаявкаНаКредит.Банк;

		ЗаполнитьЗначенияСвойств(ОбластьШапки.Параметры,СтрокаТЗ);
							
		ОбластьШапки.Параметры.Паспорт    = "паспорт: "+ДанныеПечати.КлиентПаспортСерия+" "+ДанныеПечати.КлиентПаспортНомер;
		ОбластьШапки.Параметры.Выдан      = "выдан: "+ДанныеПечати.КлиентПаспортВыданКем;
		ОбластьШапки.Параметры.ДатаВыдачи = "дата выдачи: "+Формат(ДанныеПечати.КлиентПаспортВыданДата,"ДФ=dd.MM.yyyy");

		ОбластьШапки.Параметры.НаименованиеПокупателя  = ДанныеПечати.КлиентДоговораНаименование;
	    ОбластьШапки.Параметры.НаименованиеОрганизации = ДанныеПечати.ДилерНаименованиеОрганизацииКраткое;						
        ОбластьШапки.Параметры.ДатаДоговора            = Формат(ДанныеПечати.ДатаДоговора,"ДФ=dd.MM.yyyy");
        ОбластьШапки.Параметры.НомерДоговора           = ДанныеПечати.НомерДоговора;
		
		//Чтение значения для руководителя
		СтруктураОтбора   = Новый Структура("Организация,Объект",ДанныеПечати.Организация,Перечисления.ВидыОбъектовСведений.Руководитель);
		СтруктураСведений = РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(ДанныеПечати.ДатаДоговора,СтруктураОтбора);
		
		Руководитель = СтруктураСведений.Значение;

		Если ЗначениеЗаполнено(Руководитель) Тогда
			
			РуководительДолжность = Руководитель.Должность;
			
			Если ЗначениеЗаполнено(РуководительДолжность)Тогда
				ОбластьШапки.Параметры.ОтветственныйДолжность = РуководительДолжность.Наименование+" "+ДанныеПечати.ДилерНаименованиеОрганизацииКраткое;
				РуководительДолжностьНаименование = РуководительДолжность.Наименование+Руководитель.Наименование;
				ФИООтветственного = "";
				ПОЛ = обОпределитьПол(РуководительДолжностьНаименование);
				Если DMS_ФизическиеЛицаСервер.Просклонять(РуководительДолжностьНаименование,2,ФИООтветственного,?(ПОЛ=Перечисления.ПолФизическихЛиц.Женский,2,1)) Тогда
				КонецЕсли;

				ОбластьШапки.Параметры.ФИООтветственного = ФИООтветственного;

			КонецЕсли;
			
			Фамилия           = ЛЕВ(Руководитель.Наименование, Найти(Руководитель.Наименование," ")-1);
			ФИООтветственного = ПРАВ(Руководитель.Наименование, СтрДлина(Руководитель.Наименование)-СтрДлина(Фамилия)-1);
			Имя               = ЛЕВ(ФИООтветственного, Найти(ФИООтветственного," ")-1);
	        ФИООтветственного = ПРАВ(ФИООтветственного, СтрДлина(ФИООтветственного)-СтрДлина(Имя)-1);
			Отчество          = ФИООтветственного;
			
			ОбластьШапки.Параметры.ФИООтветственногоСокр = Фамилия+" "+ЛЕВ(Имя,1)+"."+ЛЕВ(Отчество,1)+".";
			
		КонецЕсли;
		
		ОбластьШапки.Параметры.СуммаИтогПрописью = обЧислоПрописью(ДанныеПечати.СуммаДоговора,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
		ОбластьШапки.Параметры.СуммаИтог         = ДанныеПечати.СуммаДоговора;
		
		ТабДокумент.Вывести(ОбластьШапки);
		
		Макет = Новый Структура();
		Макет.Вставить("Тип",ВРег("mxl"));
		Макет.Вставить("ПечатнаяФорма",ТабДокумент);
		Renault_УправлениеПечатьюКлиент.ПоказатьДокумент(Макет);
		
	КонецЦикла;
			
КонецПроцедуры

Процедура ПечатьАктПриемаПередачиНаУтилизацию(ДанныеПечати)
	
	МакетАктПриемаПередачиНаУтилизацию = ПолучитьМакет("МакетАктПриемаПередачиНаУтилизацию");
	ОбластьШапки = МакетАктПриемаПередачиНаУтилизацию.ПолучитьОбласть("Шапка");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 5;
	ТабДокумент.ПолеСправа = 5;	
	ТЗСостав = ДанныеПечати.СоставДоговора.Выгрузить(); 
	
	Для Каждого СтрокаТЗ ИЗ ТЗСостав Цикл	 
		
		ОбластьШапки.Параметры.АдресУтилизации              = ДанныеПечати.УтилизаторАдрес;
		ОбластьШапки.Параметры.НаименованиеПунктаУтилизации = ДанныеПечати.Утилизатор;
		
		ОбластьШапки.Параметры.НомерАкта = ДанныеПечати.УтилНомерИДатаАктаСдачи;

		ОбластьШапки.Параметры.УтилМаркаМодель = ДанныеПечати.УтилМаркаМодель;
					
		ТабДокумент.Вывести(ОбластьШапки);
		
		ОбластьСтрокаАвтомобиль = МакетАктПриемаПередачиНаУтилизацию.ПолучитьОбласть("СтрокаАвтомобиль");
		
		ОбластьСтрокаАвтомобиль.Параметры.Паспорт    = ДанныеПечати.КлиентПаспортСерия+" "+ДанныеПечати.КлиентПаспортНомер+" от "+Формат(ДанныеПечати.КлиентПаспортВыданДата,"ДФ=dd.MM.yyyy")+"г.";
		ОбластьСтрокаАвтомобиль.Параметры.Выдан      = ДанныеПечати.КлиентПаспортВыданКем;

		ФИООтветственного = "";
		ПОЛ = обОпределитьПол(ДанныеПечати.КлиентДоговораНаименование);
		Если DMS_ФизическиеЛицаСервер.Просклонять(ДанныеПечати.КлиентДоговораНаименование,2,ФИООтветственного,?(ПОЛ=Перечисления.ПолФизическихЛиц.Женский,2,1)) Тогда
		КонецЕсли;

		ОбластьСтрокаАвтомобиль.Параметры.НаименованиеПокупателя = ФИООтветственного;
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаАвтомобиль.Параметры, ДанныеПечати);
		
		ОбластьСтрокаАвтомобиль.Параметры.УтилГодВыпуска               = Формат(ДанныеПечати.УтилГодВыпуска,"ДФ=yyyy");
		ОбластьСтрокаАвтомобиль.Параметры.АдресУтилизации              = ДанныеПечати.УтилизаторАдрес;
		ОбластьСтрокаАвтомобиль.Параметры.НаименованиеПунктаУтилизации = ДанныеПечати.Утилизатор;
		ОбластьСтрокаАвтомобиль.Параметры.ИНН = ДанныеПечати.УтилизаторИНН;
		ОбластьСтрокаАвтомобиль.Параметры.КПП = ДанныеПечати.УтилизаторКПП;
		ОбластьСтрокаАвтомобиль.Параметры.Телефон = ДанныеПечати.УтилизаторТелефон;
		Если ЗначениеЗаполнено(ДанныеПечати.УтилизаторКонтЛицо) И ЗначениеЗаполнено(ДанныеПечати.УтилизаторДолжностьКонтЛица) Тогда
			Ответственный = "";
			ФИООтветственного = "";
			ПОЛ = обОпределитьПол(ДанныеПечати.УтилизаторКонтЛицо);
			Если DMS_ФизическиеЛицаСервер.Просклонять(ДанныеПечати.УтилизаторКонтЛицо,2,Ответственный,?(ПОЛ=Перечисления.ПолФизическихЛиц.Женский,2,1)) Тогда
			КонецЕсли;

			ОбластьСтрокаАвтомобиль.Параметры.Ответственный =Ответственный;
		    Должность = "";
			ПОЛ = обОпределитьПол(ДанныеПечати.УтилизаторДолжностьКонтЛица);
			Если DMS_ФизическиеЛицаСервер.Просклонять(ДанныеПечати.УтилизаторДолжностьКонтЛица,2,Должность,?(ПОЛ=Перечисления.ПолФизическихЛиц.Женский,2,1)) Тогда
			КонецЕсли;
			ОбластьСтрокаАвтомобиль.Параметры.Должность = Должность;
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьСтрокаАвтомобиль);
				
		Макет = Новый Структура();
		Макет.Вставить("Тип",ВРег("mxl"));
		Макет.Вставить("ПечатнаяФорма",ТабДокумент);
		Renault_УправлениеПечатьюКлиент.ПоказатьДокумент(Макет);
		
	КонецЦикла;
			
КонецПроцедуры

Процедура ПечатьАктПриемаПередачиАвтомобиля(ДанныеПечати)
	Если ПараметрыСеанса.DMS_Бренд = СПравочники.CRM_МаркаАвтомобиля.LADA Тогда 
		МакетАктПриемаПередачиАвтомобиля = ПолучитьМакет("МакетАктПриемаПередачиАвтомобиляLADA");
	Иначе
		МакетАктПриемаПередачиАвтомобиля = ПолучитьМакет("МакетАктПриемаПередачиАвтомобиля");
	КонецЕсли;
	ОбластьШапки = МакетАктПриемаПередачиАвтомобиля.ПолучитьОбласть("Шапка");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 5;
	ТабДокумент.ПолеСправа = 5;	
	Если ЗначениеЗаполнено(ДанныеПечати.ДатаАктаПередачи) Тогда
		ДатаНадпись = Формат(ДанныеПечати.ДатаАктаПередачи,"ДФ='дд ММММ гггг'");
	Иначе	
		ДатаНадпись = Формат(ТекущаяДата(),"ДФ='дд ММММ гггг'");
 	КонецЕсли;
	
	ТЗСостав = ДанныеПечати.СоставДоговора.Выгрузить(); 
	
	Для Каждого СтрокаТЗ ИЗ ТЗСостав Цикл	 

		ОбластьШапки.Параметры.НаименованиеОрганизацииПолное = ДанныеПечати.ДилерНаименованиеОрганизации;
		ОбластьШапки.Параметры.ДатаЗаполнения         =  """" + ЛЕВ(ДатаНадпись,2)+ """ "+ Сред(ДатаНадпись,4, СтрДлина(ДатаНадпись))+" г.";
		ОбластьШапки.Параметры.НаименованиеПокупателя = ДанныеПечати.КлиентДоговораНаименование;
		ОбластьШапки.Параметры.Город                  = ""+ОпределитьГородДляПродвинутогоПакета();
		ОбластьШапки.Параметры.ЮрАдрес  = "Юр. адр.:"+ДанныеПечати.ДилерАдресЮридический;
		ОбластьШапки.Параметры.ИНН      = "ИНН "+ДанныеПечати.ДилерИНН;
		ОбластьШапки.Параметры.НаименованиеОрганизации = ДанныеПечати.ДилерНаименованиеОрганизацииКраткое;						
        ОбластьШапки.Параметры.ДатаДоговора  = Формат(ДанныеПечати.ДатаДоговора, "ДФ=dd.MM.yyyy")+"г.";
        ОбластьШапки.Параметры.НомерДоговора = ДанныеПечати.НомерДоговора;

		ОбластьШапки.Параметры.ФИООтветственного = ?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице);
	    ОбластьШапки.Параметры.УставОрганизации  = ДанныеПечати.ДилерПодписантНаОсновании;
		ОбластьШапки.Параметры.МаркаМодельПТС = СтрокаТЗ.МаркаМодельПТС;
		
		ОбластьШапки.Параметры.Паспорт    = ДанныеПечати.КлиентПаспортСерия+" "+ДанныеПечати.КлиентПаспортНомер;
		ОбластьШапки.Параметры.Выдан      = ДанныеПечати.КлиентПаспортВыданКем+", "+Формат(ДанныеПечати.КлиентПаспортВыданДата,"ДФ=dd.MM.yyyy");
		
		ТабДокумент.Вывести(ОбластьШапки);
		
		ОбластьСтрокаАвтомобиль = МакетАктПриемаПередачиАвтомобиля.ПолучитьОбласть("СтрокаАвтомобиль");
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаАвтомобиль.Параметры, СтрокаТЗ);	
		ОбластьСтрокаАвтомобиль.Параметры.Двигатель = СтрокаТЗ.РабочийОбъемДвигателяПТС+" куб.см.,"+СтрокаТЗ.МощностьДвигателяПТС+" л.с.";
		Если СтрокаТЗ.НомерШассиПТС = "" Тогда                           
			ОбластьСтрокаАвтомобиль.Параметры.НомерШассиПТС = "ОТСУТСТВУЕТ";
		КонецЕсли;
		ОбластьСтрокаАвтомобиль.Параметры.ДатаПТС = Формат(СтрокаТЗ.ДатаПТС, "ДЛФ=DD");
		ТабДокумент.Вывести(ОбластьСтрокаАвтомобиль);
		
		ОбластьПодвал = МакетАктПриемаПередачиАвтомобиля.ПолучитьОбласть("Подвал");
		ОбластьПодвал.Параметры.ПТС        = СтрокаТЗ.ПТС;
		ОбластьПодвал.Параметры.Продавец   = ДанныеПечати.ДилерНаименованиеОрганизацииКраткое + Символы.ПС+
		                                     ДанныеПечати.ДилерАдресЮридический+Символы.ПС+
											 "Тел: "+ДанныеПечати.ДилерТелефон+Символы.ПС+
                                             "ИНН: "+ДанныеПечати.ДилерИНН+" КПП: "+ДанныеПечати.ДилерКПП+Символы.ПС+          
	                                         "ОГРН: "+ДанныеПечати.ДилерОГРН+Символы.ПС+
											 "р/с "+ДанныеПечати.ДилерСчет+" в"+Символы.ПС+
											 ДанныеПечати.ДилерБанк+Символы.ПС+
											 "к/с "+ДанныеПечати.ДилерКоррСчет+", БИК"+Символы.ПС+ 
											 ДанныеПечати.ДилерБИК+Символы.ПС+ 
											 "ОКВЭД: "+ДанныеПечати.ДилерОКВЭД+" ОКПО: "+ДанныеПечати.ДилерОКПО;
											
		ОбластьПодвал.Параметры.Покупатель = ДанныеПечати.КлиентДоговораНаименование+Символы.ПС+
		                                    "Паспорт: "+ДанныеПечати.КлиентПаспортСерия+" "+ДанныеПечати.КлиентПаспортНомер+Символы.ПС+
                                            "Выдан: "+ДанныеПечати.КлиентПаспортВыданКем+", "+Формат(ДанныеПечати.КлиентПаспортВыданДата,"ДФ=dd.MM.yyyy")+Символы.ПС+
                                            "Адрес регистрации: "+ДанныеПечати.КлиентАдрес;
											
        ОбластьПодвал.Параметры.ФИООтветственного      = ?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице);
        ОбластьПодвал.Параметры.НаименованиеПокупателя = ДанныеПечати.КлиентДоговораНаименование;
		
        ТабДокумент.Вывести(ОбластьПодвал);	
		
		Макет = Новый Структура();
		Макет.Вставить("Тип",ВРег("mxl"));
		Макет.Вставить("ПечатнаяФорма",ТабДокумент);
		Renault_УправлениеПечатьюКлиент.ПоказатьДокумент(Макет);
		
	КонецЦикла;
			
КонецПроцедуры

Процедура ПечатьАктПриемаПередачиАвтомобиляКорп(ДанныеПечати)
	
	Если ПараметрыСеанса.DMS_Бренд = СПравочники.CRM_МаркаАвтомобиля.LADA Тогда 
		МакетАктПриемаПередачиАвтомобиля = ПолучитьМакет("МакетАктПриемаПередачиАвтомобиляКорпLADA");
	Иначе
		МакетАктПриемаПередачиАвтомобиля = ПолучитьМакет("МакетАктПриемаПередачиАвтомобиляКорп");
	КонецЕсли;
	
	ОбластьШапки = МакетАктПриемаПередачиАвтомобиля.ПолучитьОбласть("Шапка");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 5;
	ТабДокумент.ПолеСправа = 5;	
	ДатаНадпись = Формат(ТекущаяДата(),"ДФ='дд ММММ гггг'");

	ТЗСостав = ДанныеПечати.СоставДоговора.Выгрузить(); 
	
	Для Каждого СтрокаТЗ ИЗ ТЗСостав Цикл
		
		//++ добавлено Зеленчук 20180305. По заданию Андрея Дуплицкого в связи с изменением метода хранения информации для подписания договора
		ЗаполнитьЗначенияСвойств(ОбластьШапки.Параметры, ДанныеПечати); 
	 	//-- добавлено Зеленчук 20180305. По заданию Андрея Дуплицкого в связи с изменением метода хранения информации для подписания договора

		ОбластьШапки.Параметры.НаименованиеОрганизацииПолное = ДанныеПечати.ДилерНаименованиеОрганизации;
		ОбластьШапки.Параметры.ДатаЗаполнения         =  """" + ЛЕВ(ДатаНадпись,2)+ """ "+ Сред(ДатаНадпись,4, СтрДлина(ДатаНадпись))+" г.";
		ОбластьШапки.Параметры.НаименованиеПокупателя = ДанныеПечати.КлиентДоговораНаименование;
		ОбластьШапки.Параметры.Город                  = ""+ОпределитьГородДляПродвинутогоПакета();
		ОбластьШапки.Параметры.ЮрАдрес  = "Юр. адр.:"+ДанныеПечати.ДилерАдресЮридический;
		ОбластьШапки.Параметры.ИНН      = "ИНН "+ДанныеПечати.ДилерИНН;
		ОбластьШапки.Параметры.НаименованиеОрганизации = ДанныеПечати.ДилерНаименованиеОрганизацииКраткое;						
        ОбластьШапки.Параметры.ДатаДоговора  = Формат(ДанныеПечати.ДатаДоговора, "ДФ=dd.MM.yyyy")+"г.";
        ОбластьШапки.Параметры.НомерДоговора = ДанныеПечати.НомерДоговора;

		// начало добавление Зеленчук
		ФИООтветственного = ?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице);
		//ФИООтветственногоРодительныйПадеж = DMS_ФизическиеЛицаСервер.ПросклонятьЧерезМорфер30(ФИООтветственного);
		ФИООтветственногоРодительныйПадеж = "";	
		ПОЛ = обОпределитьПол(ФИООтветственного);
		Если DMS_ФизическиеЛицаСервер.Просклонять(ФИООтветственного,2,ФИООтветственногоРодительныйПадеж,?(ПОЛ=Перечисления.ПолФизическихЛиц.Женский,2,1)) Тогда
		КонецЕсли;

		//++ изменено Зеленчук 20180305. По заданию Андрея Дуплицкого в связи с изменением метода хранения информации для подписания договора
		//ДолжностьОтветственногоПокупателя = "";
		//ОснованиеПокупателя = "";
		//Если ЗначениеЗаполнено(ДанныеПечати.КлиентПодписант) Тогда
		//
		//	ДолжностьОтветственногоПокупателя = ДанныеПечати.КлиентПодписантДолжность;
		//		
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = 
		//		"ВЫБРАТЬ ПЕРВЫЕ 1
		//		|	ПодтверждающиеДокументы.Номер КАК Номер,
		//		|	ПодтверждающиеДокументы.ДатаВыдачи КАК ДатаВыдачи,
		//		|	ПодтверждающиеДокументы.Наименование КАК Наименование,
		//		|	ВЫБОР
		//		|		КОГДА ПодтверждающиеДокументы.Текущий
		//		|			ТОГДА 1
		//		|		ИНАЧЕ 2
		//		|	КОНЕЦ КАК Порядок,
		//		|	ПодтверждающиеДокументы.ВидПодтверждающегоДокумента КАК ВидПодтверждающегоДокумента
		//		|ИЗ
		//		|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
		//		|ГДЕ
		//		|	ПодтверждающиеДокументы.Владелец = &Владелец
		//		|	И НЕ ПодтверждающиеДокументы.ПометкаУдаления
		//		|	И НЕ ПодтверждающиеДокументы.Устаревший
		//		|
		//		|УПОРЯДОЧИТЬ ПО
		//		|	Порядок"; 			
		//	Запрос.УстановитьПараметр("Владелец", ДанныеПечати.КлиентПодписант);
		//	Результат = Запрос.Выполнить();
		//	
		//	Если НЕ Результат.Пустой() Тогда
		//		Выборка = Результат.Выбрать();
		//		Выборка.Следующий();
		//		
		//		Если Выборка.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.Доверенность Тогда
		//			ОснованиеПокупателя = "Доверенности" + ?(ЗначениеЗаполнено(Выборка.Номер), " №"+ Выборка.Номер, "") + ?(ЗначениеЗаполнено(Выборка.ДатаВыдачи), " от " + Формат(Выборка.ДатаВыдачи,"ДФ=dd.MM.yyyy"), "");
		//		ИначеЕсли Выборка.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.Прочее Тогда
		//			ОснованиеПокупателя = Выборка.Наименование;
		//		КонецЕсли;
		//	Иначе
		//		ОснованиеПокупателя = "Устава";
		//	КонецЕсли;
		//КонецЕсли;
				
		//ДолжностьОтветственногоПокупателяРодительныйПадеж = "";
		//Если ЗначениеЗаполнено(ДолжностьОтветственногоПокупателя) Тогда 
		//	ПОЛ = обОпределитьПол(ДолжностьОтветственногоПокупателя.Наименование);
		//	Если DMS_ФизическиеЛицаСервер.Просклонять(ДолжностьОтветственногоПокупателя.Наименование,2,ДолжностьОтветственногоПокупателяРодительныйПадеж,?(ПОЛ=Перечисления.ПолФизическихЛиц.Женский,2,1)) Тогда
		//	КонецЕсли;
		//КонецЕсли;
		////ДолжностьОтветственногоПокупателяРодительныйПадеж = DMS_ФизическиеЛицаСервер.ПросклонятьЧерезМорфер30(ДолжностьОтветственногоПокупателя.Наименование);
		//ФИООтветственногоПокупателя = ДанныеПечати.КлиентПодписантФИО;
		//ФИООтветственногоПокупателяРодительныйПадеж = "";	
		//ПОЛ = обОпределитьПол(ФИООтветственногоПокупателя);
		//Если DMS_ФизическиеЛицаСервер.Просклонять(ФИООтветственногоПокупателя,2,ФИООтветственногоПокупателяРодительныйПадеж,?(ПОЛ=Перечисления.ПолФизическихЛиц.Женский,2,1)) Тогда
		//КонецЕсли;

		//ОбластьШапки.Параметры.ДолжностьОтветственногоПокупателяРодительныйПадеж = ДолжностьОтветственногоПокупателяРодительныйПадеж;
		//ОбластьШапки.Параметры.ФИООтветственногоРодительныйПадеж  = ФИООтветственногоРодительныйПадеж;
		//ОбластьШапки.Параметры.ОснованиеПокупателя = ОснованиеПокупателя;
		//ОбластьШапки.Параметры.ФИООтветственногоПокупателяРодительныйПадеж = ФИООтветственногоПокупателяРодительныйПадеж;
		//// окончание добавление Зеленчук
		//-- изменено Зеленчук 20180305. По заданию Андрея Дуплицкого в связи с изменением метода хранения информации для подписания договора
			
	    ОбластьШапки.Параметры.УставОрганизации  = ДанныеПечати.ДилерПодписантНаОсновании;
		ОбластьШапки.Параметры.МаркаМодельПТС = СтрокаТЗ.МаркаМодельПТС;
		
		ТабДокумент.Вывести(ОбластьШапки);
		
		ОбластьСтрокаАвтомобиль = МакетАктПриемаПередачиАвтомобиля.ПолучитьОбласть("СтрокаАвтомобиль");
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаАвтомобиль.Параметры, СтрокаТЗ);	
		ОбластьСтрокаАвтомобиль.Параметры.Двигатель = СтрокаТЗ.РабочийОбъемДвигателяПТС+" куб.см.,"+СтрокаТЗ.МощностьДвигателяПТС+" л.с.";
		Если СтрокаТЗ.НомерШассиПТС = "" Тогда                           
			ОбластьСтрокаАвтомобиль.Параметры.НомерШассиПТС = "ОТСУТСТВУЕТ";
		КонецЕсли;
		ОбластьСтрокаАвтомобиль.Параметры.ДатаПТС = Формат(СтрокаТЗ.ДатаПТС, "ДЛФ=DD");
		ТабДокумент.Вывести(ОбластьСтрокаАвтомобиль);
		
		ОбластьПодвал = МакетАктПриемаПередачиАвтомобиля.ПолучитьОбласть("Подвал");
		ОбластьПодвал.Параметры.ПТС        = СтрокаТЗ.ПТС;
		ОбластьПодвал.Параметры.Продавец   = ДанныеПечати.ДилерНаименованиеОрганизацииКраткое + Символы.ПС+
		                                     ДанныеПечати.ДилерАдресЮридический+Символы.ПС+
											 "Тел: "+ДанныеПечати.ДилерТелефон+Символы.ПС+
                                             "ИНН: "+ДанныеПечати.ДилерИНН+" КПП: "+ДанныеПечати.ДилерКПП+Символы.ПС+          
	                                         "ОГРН: "+ДанныеПечати.ДилерОГРН+Символы.ПС+
											 "р/с "+ДанныеПечати.ДилерСчет+" в"+Символы.ПС+
											 ДанныеПечати.ДилерБанк+Символы.ПС+
											 "к/с "+ДанныеПечати.ДилерКоррСчет+", БИК"+Символы.ПС+ 
											 ДанныеПечати.ДилерБИК+Символы.ПС+ 
											 "ОКВЭД: "+ДанныеПечати.ДилерОКВЭД+" ОКПО: "+ДанныеПечати.ДилерОКПО;
											
		ОбластьПодвал.Параметры.Покупатель = ДанныеПечати.КлиентДоговораНаименование+Символы.ПС+
		                                    ДанныеПечати.КлиентАдрес+Символы.ПС+
                                            "Тел: "+ДанныеПечати.ДилерТелефон+Символы.ПС+
                                            "ИНН: "+ДанныеПечати.КлиентИНН+" КПП: "+ДанныеПечати.КлиентКПП+Символы.ПС+          
	                                        //"ОГРН: "+ДанныеПечати.ДилерОГРН+Символы.ПС+
											//"р/с "+ДанныеПечати.КлиентСчет+" в"+Символы.ПС+
											//ДанныеПечати.КлиентБанк+Символы.ПС+
											//"к/с "+ДанныеПечати.КлиентКоррСчет+", БИК"+Символы.ПС+ 
											//ДанныеПечати.КлиентБИК+Символы.ПС+ 
											////"ОКВЭД: "+ДанныеПечати.ДилерОКВЭД+" ОКПО: "+ДанныеПечати.ДилерОКПО;
											" ОКПО: "+ДанныеПечати.КлиентКодПоОКПО;
											
        ОбластьПодвал.Параметры.ФИООтветственного      = ?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице);
        ОбластьПодвал.Параметры.ФИООтветственногоПокупателя = ДанныеПечати.ФИООтветственногоПокупателя;
		
        ТабДокумент.Вывести(ОбластьПодвал);	
		
		Макет = Новый Структура();
		Макет.Вставить("Тип",ВРег("mxl"));
		Макет.Вставить("ПечатнаяФорма",ТабДокумент);
		Renault_УправлениеПечатьюКлиент.ПоказатьДокумент(Макет);
		
	КонецЦикла;
			
КонецПроцедуры

Процедура ЗаполнитьОпции(БазовыеОпции, Обл, ТабДокумент)
	
	Если НЕ БазовыеОпции = Неопределено Тогда
		ВсегоБазовыхОпций = БазовыеОпции.Количество();
	Иначе
		ВсегоБазовыхОпций = 0;
	КонецЕсли;
	
	Номер = 0;
	
	Влезает = 50;
	Индекс = 0;
	СледующуюСтрокуПропускаем = Ложь;
	
	Пока Индекс <> БазовыеОпции.Количество() Цикл
		
		СтрокаЭлемента = БазовыеОпции[Индекс];
		ДлинаСтроки = СтрДлина(СтрокаЭлемента);
		
		Если ДлинаСтроки > Влезает Тогда
			
			//Нужно делить строку
			
			//Ищем пробел с конца строки
			НайденныйСимвол = "";
			Инд1 = ДлинаСтроки - Влезает; //индекс пробела по которому делим строки
			Пока НайденныйСимвол <> " " Цикл
				НайденныйСимвол = Сред(СтрокаЭлемента, СтрДлина(СтрокаЭлемента)- Инд1, 1);
				Инд1 = Инд1 + 1;
			КонецЦикла;
			
			//Получим левую часть и запишем ее в массив
			
			ЛеваяЧасть = "- " + СокрЛП(Лев(СтрокаЭлемента, ДлинаСтроки - Инд1));
			БазовыеОпции[Индекс] = ЛеваяЧасть;
			
			//Получим правую часть и запишем ее в массив
			
			ПраваяЧасть = " " + СокрЛП(Сред(СтрокаЭлемента, СтрДлина(СтрокаЭлемента) - Инд1 + 1));
			БазовыеОпции.Вставить(Индекс+1, "  " + ПраваяЧасть);
			СледующуюСтрокуПропускаем = Истина;
			
		Иначе
			
			Если СледующуюСтрокуПропускаем Тогда
				СледующуюСтрокуПропускаем = Ложь; //Эта строка - права часть предыдущей строки
			Иначе
				БазовыеОпции[Индекс] = "- " + БазовыеОпции[Индекс];
			КонецЕсли;
			
		КонецЕсли;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	//разделим опции на 2 массива
	ПервыйМассив = Новый Массив;
	ВторойМассив = Новый Массив;
	Для Индекс = 0 По БазовыеОпции.Количество() - 1 Цикл
		Если Индекс < Окр((БазовыеОпции.Количество()) / 2) Тогда
			ПервыйМассив.Добавить(БазовыеОпции[Индекс]);
		Иначе
			ВторойМассив.Добавить(БазовыеОпции[Индекс]);
		КонецЕсли;
	КонецЦикла;
	
	Если ПервыйМассив.Количество() >= ВторойМассив.Количество() Тогда
		БольшийИндекс = ПервыйМассив.Количество();
	Иначе
		БольшийИндекс = ВторойМассив.Количество();
	КонецЕсли;
	
	Для Индекс = 0 По БольшийИндекс-1 Цикл
		
		Если Индекс+1 <= ПервыйМассив.Количество() Тогда
			Обл.Параметры.Опция1 = ПервыйМассив[Индекс];
		Иначе
			Обл.Параметры.Опция1 = "";
		КонецЕсли;
		
		Если Индекс+1 <= ВторойМассив.Количество() Тогда
			Обл.Параметры.Опция2 = ВторойМассив[Индекс];
		Иначе
			Обл.Параметры.Опция2 = "";
		КонецЕсли;
		
		ТабДокумент.Вывести(Обл);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДопОпции(Идентификатор, Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Renault_ДоговорДопОпцииАвтомобилей.Наименование КАК НаименованиеОпции
	|ИЗ
	|	Документ.Renault_Договор.ДопОпцииАвтомобилей КАК Renault_ДоговорДопОпцииАвтомобилей
	|ГДЕ
	|	Renault_ДоговорДопОпцииАвтомобилей.Ссылка = &Ссылка
	|	И Renault_ДоговорДопОпцииАвтомобилей.Идентификатор = &Идентификатор";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Новый ТаблицаЗначений;
	Иначе
		Возврат Результат.Выгрузить().ВыгрузитьКолонку("НаименованиеОпции");
	КонецЕсли;
	
КонецФункции

Функция ПолучитьБазовыеОпции(Модель, ВариантКомплектации, Тариф)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Renault_ТарифНаОпцииАвтомобилей.НаименованиеОпции КАК НаименованиеОпции
	|ИЗ
	|	РегистрСведений.Renault_ТарифНаОпцииАвтомобилей.СрезПоследних(
	|			,
	|			Тариф = &Тариф
	|				И Модель = &Модель
	|				И ВариантКомплектации = &ВариантКомплектации
	|				И Базовая = ИСТИНА) КАК Renault_ТарифНаОпцииАвтомобилей";
	
	Запрос.УстановитьПараметр("Модель", Модель);
	Запрос.УстановитьПараметр("ВариантКомплектации", ВариантКомплектации);
	Запрос.УстановитьПараметр("Тариф", Тариф);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Новый ТаблицаЗначений;
	Иначе
		Возврат Результат.Выгрузить().ВыгрузитьКолонку("НаименованиеОпции");
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДопИнформациюПоВерсии(Версия)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ДопИнформацияПоВерсиям.ОбъемДвигателя КАК Объем,
	|	Renault_ДопИнформацияПоВерсиям.МощностьЛС КАК ДвигательЛС,
	|	Renault_ДопИнформацияПоВерсиям.МощностьКВТ КАК Двигатель_КВТ
	|ИЗ
	|	РегистрСведений.Renault_ДопИнформацияПоВерсиям КАК Renault_ДопИнформацияПоВерсиям
	|ГДЕ
	|	Renault_ДопИнформацияПоВерсиям.ВариантКомплектации = &ВариантКомплектации";
	Запрос.УстановитьПараметр("ВариантКомплектации", Версия);
	Выборка = Запрос.Выполнить();
	Если Выборка.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Результат = Выборка.Выбрать();
		Результат.Следующий();
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

Процедура ПечатьДоговораКорп(ДанныеПечати)
	
	ВалютаРубли = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
	Тариф = Renault_CRM.ПолучитьТекущийТарифНаАвтомобили(ДанныеПечати.ДатаДоговора);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 5;
	ТабДокумент.ПолеСправа = 5;
	 		
	МакетДоговор = ПолучитьМакет("МакетДоговораКорп");
	ОбластьШапки = МакетДоговор.ПолучитьОбласть("Шапка");
	ОбластьШапки.Параметры.Город = киПолучитьГород(ДанныеПечати.Организация, Справочники.ВидыКонтактнойИнформации.АдресФактический);
	ОбластьШапки.Параметры.НомерДоговора = ДанныеПечати.НомерДоговора;
	ОбластьШапки.Параметры.ДатаДоговора = Формат(ДанныеПечати.ДатаДоговора, "ДЛФ=ДД");
	ОбластьШапки.Параметры.НаименованиеОрганизации = ДанныеПечати.ДилерНаименованиеОрганизации;
	
	ДолжностьОтветственногоРодительныйПадеж = "";
	
	ПОЛ = обОпределитьПол(ДанныеПечати.ДилерПодписантДолжность);
	Если DMS_ФизическиеЛицаСервер.Просклонять(ДанныеПечати.ДилерПодписантДолжность,2,ДолжностьОтветственногоРодительныйПадеж,?(ПОЛ=Перечисления.ПолФизическихЛиц.Женский,2,1)) Тогда
	КонецЕсли;
	
	ОбластьШапки.Параметры.ДолжностьОтветственногоРодительныйПадеж = ДолжностьОтветственногоРодительныйПадеж;
		
	ФИООтветственного = ?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице);
	ФИООтветственногоРодительныйПадеж = "";
	
	ПОЛ = обОпределитьПол(ФИООтветственного);
	Если DMS_ФизическиеЛицаСервер.Просклонять(ФИООтветственного,2,ФИООтветственногоРодительныйПадеж,?(ПОЛ=Перечисления.ПолФизическихЛиц.Женский,2,1)) Тогда
	КонецЕсли;

	ОбластьШапки.Параметры.ФИООтветственногоРодительныйПадеж = ФИООтветственногоРодительныйПадеж;
	ОбластьШапки.Параметры.УставОрганизации  = ДанныеПечати.ДилерПодписантНаОсновании;
	ОбластьШапки.Параметры.НаименованиеПокупателя = ДанныеПечати.КлиентДоговораНаименование;
	
	//++ изменено Зеленчук 20180305. По заданию Андрея Дуплицкого в связи с изменением метода хранения информации для подписания договора
	//Если ЗначениеЗаполнено(ДанныеПечати.КлиентПодписант) Тогда
	//	 		
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ ПЕРВЫЕ 1
	//		|	ПодтверждающиеДокументы.Номер КАК Номер,
	//		|	ПодтверждающиеДокументы.ДатаВыдачи КАК ДатаВыдачи,
	//		|	ПодтверждающиеДокументы.Наименование КАК Наименование,
	//		|	ВЫБОР
	//		|		КОГДА ПодтверждающиеДокументы.Текущий
	//		|			ТОГДА 1
	//		|		ИНАЧЕ 2
	//		|	КОНЕЦ КАК Порядок,
	//		|	ПодтверждающиеДокументы.ВидПодтверждающегоДокумента КАК ВидПодтверждающегоДокумента
	//		|ИЗ
	//		|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	//		|ГДЕ
	//		|	ПодтверждающиеДокументы.Владелец = &Владелец
	//		|	И НЕ ПодтверждающиеДокументы.ПометкаУдаления
	//		|	И НЕ ПодтверждающиеДокументы.Устаревший
	//		|
	//		|УПОРЯДОЧИТЬ ПО
	//		|	Порядок"; 			
	//	Запрос.УстановитьПараметр("Владелец", ДанныеПечати.КлиентПодписант);
	//	Результат = Запрос.Выполнить();
	//	
	//	Если НЕ Результат.Пустой() Тогда
	//		Выборка = Результат.Выбрать();
	//		Выборка.Следующий();
	//		
	//		Если Выборка.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.Доверенность Тогда
	//			ОснованиеПокупателя = "Доверенности" + ?(ЗначениеЗаполнено(Выборка.Номер), " №"+ Выборка.Номер, "") + ?(ЗначениеЗаполнено(Выборка.ДатаВыдачи), " от " + Выборка.ДатаВыдачи, "");
	//		ИначеЕсли Выборка.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.Прочее Тогда
	//			ОснованиеПокупателя = Выборка.Наименование;
	//		КонецЕсли;
	//	Иначе
	//		ОснованиеПокупателя = "Устава";
	//	КонецЕсли;
	//КонецЕсли;
	//
	//ДолжностьОтветственногоПокупателяРодительныйПадеж = "";
	//Если ЗначениеЗаполнено(ДанныеПечати.КлиентПодписантДолжность) Тогда 
	//	ПОЛ = обОпределитьПол(ДанныеПечати.КлиентПодписантДолжность.Наименование);
	//	Если DMS_ФизическиеЛицаСервер.Просклонять(ДанныеПечати.КлиентПодписантДолжность.Наименование,2,ДолжностьОтветственногоПокупателяРодительныйПадеж,?(ПОЛ=Перечисления.ПолФизическихЛиц.Женский,2,1)) Тогда
	//	КонецЕсли;
	//КонецЕсли;
	//ФИООтветственногоПокупателя = ДанныеПечати.КлиентПодписантФИО;
	//ФИООтветственногоПокупателяРодительныйПадеж = "";	
	//ПОЛ = обОпределитьПол(ФИООтветственногоПокупателя);
	//Если DMS_ФизическиеЛицаСервер.Просклонять(ФИООтветственногоПокупателя,2,ФИООтветственногоПокупателяРодительныйПадеж,?(ПОЛ=Перечисления.ПолФизическихЛиц.Женский,2,1)) Тогда
	//КонецЕсли;

	//ОбластьШапки.Параметры.ФИООтветственногоПокупателяРодительныйПадеж = ФИООтветственногоПокупателяРодительныйПадеж;	
	//ОбластьШапки.Параметры.ДолжностьОтветственногоПокупателяРодительныйПадеж = ДолжностьОтветственногоПокупателяРодительныйПадеж;
	//ОбластьШапки.Параметры.ОснованиеПокупателя = ОснованиеПокупателя;		
	
	//[НаименованиеОрганизации], именуемое в дальнейшем "Продавец", в лице [ДолжностьОтветственногоРодительныйПадеж] [ФИООтветственногоРодительныйПадеж], действующего на основании [УставОрганизации], с одной стороны, и [НаименованиеПокупателя], именуемое  далее «Покупатель», в лице [ДолжностьОтветственногоПокупателяРодительныйПадеж] [ФИООтветственногоПокупателяРодительныйПадеж], действующего на основании [ОснованиеПокупателя], с другой стороны, совместно именуемые «Стороны», а по отдельности «Сторона», заключили настоящий договор о нижеследующем:
	//-- изменено Зеленчук 20180305. По заданию Андрея Дуплицкого в связи с изменением метода хранения информации для подписания договора
	
	//++ изменено Зеленчук 20180305. По заданию Андрея Дуплицкого в связи с изменением метода хранения информации для подписания договора
	ЗаполнитьЗначенияСвойств(ОбластьШапки.Параметры, ДанныеПечати);  		
	//-- изменено Зеленчук 20180305. По заданию Андрея Дуплицкого в связи с изменением метода хранения информации для подписания договора
	
	ТабДокумент.Вывести(ОбластьШапки);
	ТЗСостав = ДанныеПечати.СоставДоговора.Выгрузить(); 
	ОбластьСтрокаАвто = МакетДоговор.ПолучитьОбласть("СтрокаАвтомобиль");
	Для Каждого СтрокаСостав из ТЗСостав Цикл
		ОбластьСтрокаАвто.Параметры.Заполнить(СтрокаСостав);
		ОбластьСтрокаАвто.Параметры.НомерПоПорядку = "1.1." + СтрокаСостав.НомерСтроки;
		ОбластьСтрокаАвто.Параметры.НомерПриложения = СтрокаСостав.НомерСтроки;
		ТабДокумент.Вывести(ОбластьСтрокаАвто);
	КонецЦикла;
	
	ОбластьШапка_2 = МакетДоговор.ПолучитьОбласть("Шапка_2");
	ОбластьШапка_2.Параметры.СуммаИтог = ДанныеПечати.СуммаДоговора;
	ОбластьШапка_2.Параметры.СуммаИтогПрописью =  обЧислоПрописью(ДанныеПечати.СуммаДоговора, ВалютаРубли);
	ОбластьШапка_2.Параметры.НДСИтого = ПолучитьНДС(ДанныеПечати.СуммаДоговора, СтавкаНДС);
	ТабДокумент.Вывести(ОбластьШапка_2);
	
	ОбластьСтоки_2 = МакетДоговор.ПолучитьОбласть("Строка_2");
	Для Каждого СтрокаСостав Из ТЗСостав Цикл
		ОбластьСтоки_2.Параметры.НомерПоПорядку = "2.1." + СтрокаСостав.НомерСтроки;
		ОбластьСтоки_2.Параметры.НомерПриложения = СтрокаСостав.НомерСтроки;
		ОбластьСтоки_2.Параметры.Стоимость = СтрокаСостав.ОбщаяСуммаПоАвтомобилю;
		ОбластьСтоки_2.Параметры.СтоимостьПрописью = обЧислоПрописью(СтрокаСостав.ОбщаяСуммаПоАвтомобилю, ВалютаРубли);
		ОбластьСтоки_2.Параметры.НДСИтог = ПолучитьНДС(СтрокаСостав.ОбщаяСуммаПоАвтомобилю, СтавкаНДС);
		ТабДокумент.Вывести(ОбластьСтоки_2);
	КонецЦикла;
	
	ОбластьПодвал = МакетДоговор.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.СуммаАванс = ДанныеПечати.СуммаАванса;
	ОбластьПодвал.Параметры.СуммаАвансПрописью = обЧислоПрописью(ДанныеПечати.СуммаАванса, ВалютаРубли);
	ОбластьПодвал.Параметры.НДСАванс = ПолучитьНДС(ДанныеПечати.СуммаАванса, СтавкаНДС);
	ОбластьПодвал.Параметры.СуммаОстаток = ДанныеПечати.СуммаЗаВычетомАванса;
	ОбластьПодвал.Параметры.СуммаОстатокПрописью = обЧислоПрописью(ДанныеПечати.СуммаЗаВычетомАванса, ВалютаРубли);
	ОбластьПодвал.Параметры.НДСОстаток = ПолучитьНДС(ДанныеПечати.СуммаЗаВычетомАванса, СтавкаНДС);
	ОбластьПодвал.Параметры.АдресВыдачи = ДанныеПечати.ДилерАдресФактический;
	ТабДокумент.Вывести(ОбластьПодвал);
	
	ОбластьСтрПодвал = МакетДоговор.ПолучитьОбласть("СтрокаПодвал");
	ОбластьСтрПодвал.Параметры.Продавец = ДанныеПечати.ДилерНаименованиеОрганизации;
	ОбластьСтрПодвал.Параметры.Покупатель = ДанныеПечати.КлиентДоговораНаименование;
	ТабДокумент.Вывести(ОбластьСтрПодвал);
	ОбластьСтрПодвал.Параметры.Продавец = "Юридический адрес: " + ДанныеПечати.ДилерАдресЮридический;
	ОбластьСтрПодвал.Параметры.Покупатель = "Юридический адрес: " + ДанныеПечати.КлиентАдрес;
	ТабДокумент.Вывести(ОбластьСтрПодвал);
	ОбластьСтрПодвал.Параметры.Продавец = "ИНН: " + ДанныеПечати.ДилерИНН + " КПП: " + ДанныеПечати.ДилерКПП;
	ОбластьСтрПодвал.Параметры.Покупатель = "ИНН: " + ДанныеПечати.КлиентИНН + " КПП: " + ДанныеПечати.КлиентКПП;
	ТабДокумент.Вывести(ОбластьСтрПодвал);
	ОбластьСтрПодвал.Параметры.Продавец = "р/с: " + ДанныеПечати.ДилерСчет;
	ОбластьСтрПодвал.Параметры.Покупатель = "р/с: " + ДанныеПечати.КлиентСчет;
	ТабДокумент.Вывести(ОбластьСтрПодвал);
	ОбластьСтрПодвал.Параметры.Продавец = "в " + ДанныеПечати.ДилерБанк;
	ОбластьСтрПодвал.Параметры.Покупатель = "в " + ДанныеПечати.КлиентБанкСчета;
	ТабДокумент.Вывести(ОбластьСтрПодвал);
	ОбластьСтрПодвал.Параметры.Продавец = "БИК:" + ДанныеПечати.ДилерБИК;
	ОбластьСтрПодвал.Параметры.Покупатель = "БИК:" + ДанныеПечати.КлиентБИК;
	ТабДокумент.Вывести(ОбластьСтрПодвал);
	
	ОбластьПодпись = МакетДоговор.ПолучитьОбласть("Подписи");
	ОбластьПодпись.Параметры.ФИООтветственного = ФИООтветственного;
	ОбластьПодпись.Параметры.ФИООтветственногоПокупателя = ДанныеПечати.ФИООтветственногоПокупателя;
	
	ТабДокумент.Вывести(ОбластьПодпись);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	МакетПриложение = ПолучитьМакет("МакетПриложение");
	ОбластьШапки = МакетПриложение.ПолучитьОбласть("Шапка");
	ШапкаБазовые = МакетПриложение.ПолучитьОбласть("ШапкаБазовые");
	СтрокиБазовые = МакетПриложение.ПолучитьОбласть("БазовыеОпции");
	ШапкаДопОпции = МакетПриложение.ПолучитьОбласть("ШапкаДопОпции");
	СтрокиДопОпции = МакетПриложение.ПолучитьОбласть("ДопОпции");
	Подвал = МакетПриложение.ПолучитьОбласть("Подвал");
	
	Для Каждого СтрокаТЗ из ТЗСостав Цикл
		ОбластьШапки.Параметры.НомерПоПорыдку = СтрокаТЗ.НомерСтроки;
		ОбластьШапки.Параметры.НомерДоговора = ДанныеПечати.НомерДоговора;
		ОбластьШапки.Параметры.ДатаДоговора =  Формат(ДанныеПечати.ДатаДоговора,"ДЛФ=ДД");
		ОбластьШапки.Параметры.Модель = ?(ЗначениеЗаполнено(СтрокаТЗ.Модель), СтрокаТЗ.Модель.Наименование, "<Не указана>"); 
		ОбластьШапки.Параметры.Версия = ?(ЗначениеЗаполнено(СтрокаТЗ.Версия), СтрокаТЗ.Версия.Наименование, "<Не указана>"); 
		ОбластьШапки.Параметры.Цвет = ?(ЗначениеЗаполнено(СтрокаТЗ.Цвет), СтрокаТЗ.Цвет.Наименование, "<Не указан>"); 
		ДопИнформация = ПолучитьДопИнформациюПоВерсии (СтрокаТЗ.Версия);
		Если ДопИнформация <> Неопределено Тогда
			
			ОбластьШапки.Параметры.Объем = ?(ЗначениеЗаполнено(ДопИнформация.Объем), Строка(ДопИнформация.Объем) + " см3", "<Не указан>"); 
			Двигатель_КВТ = ?(ЗначениеЗаполнено(ДопИнформация.Двигатель_КВТ), Строка(ДопИнформация.Двигатель_КВТ), "<Не указана>");
			ДвигательЛС = ?(ЗначениеЗаполнено(ДопИнформация.ДвигательЛС), Строка(ДопИнформация.ДвигательЛС), "<Не указана>");
			ОбластьШапки.Параметры.Двигатель = ДвигательЛС + " (" + Двигатель_КВТ + ") л.с.(кВт)";
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьШапки);
		БазовыеОпции = ПолучитьБазовыеОпции(СтрокаТЗ.Модель, СтрокаТЗ.Версия, Тариф);
		Если БазовыеОпции.Количество() > 0 Тогда
			ТабДокумент.Вывести(ШапкаБазовые);
			ЗаполнитьОпции (БазовыеОпции, СтрокиБазовые, ТабДокумент);
		КонецЕсли;
		ДопОпции = ПолучитьДопОпции(СтрокаТЗ.Идентификатор, СтрокаТЗ.Ссылка);
		Если ДопОпции.Количество() > 0 Тогда
			ТабДокумент.Вывести(ШапкаДопОпции);
			ЗаполнитьОпции (ДопОпции, СтрокиДопОпции, ТабДокумент);
		КонецЕсли;
		ТабДокумент.Вывести(Подвал);
	КонецЦикла;
	Макет = Новый Структура();
	Макет.Вставить("Тип",ВРег("mxl"));
	Макет.Вставить("ПечатнаяФорма",ТабДокумент);
	Renault_УправлениеПечатьюКлиент.ПоказатьДокумент(Макет);
	
КонецПроцедуры

Процедура ПечатьАктПриемаПередачиАвтомобиляВыкуп(ДанныеПечати)
	
	МакетАктПриемаПередачиАвтомобиля = ПолучитьМакет("МакетАктПриемаПередачиАвтомобиляВыкуп");
	ОбластьШапки = МакетАктПриемаПередачиАвтомобиля.ПолучитьОбласть("Шапка");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 5;
	ТабДокумент.ПолеСправа = 5;	
	ДатаНадпись = Формат(ТекущаяДата(),"ДФ='дд ММММ гггг'");

	ТЗСостав = ДанныеПечати.СоставДоговора.Выгрузить(); 
	
	Для Каждого СтрокаТЗ ИЗ ТЗСостав Цикл	 

		ОбластьШапки.Параметры.НаименованиеОрганизацииПолное = ДанныеПечати.ДилерНаименованиеОрганизации;
		ОбластьШапки.Параметры.ДатаЗаполнения         =  """" + ЛЕВ(ДатаНадпись,2)+ """ "+ Сред(ДатаНадпись,4, СтрДлина(ДатаНадпись))+" г.";
		ОбластьШапки.Параметры.НаименованиеПокупателя = ДанныеПечати.КлиентДоговораНаименование;
		ОбластьШапки.Параметры.Город                  = ""+ОпределитьГородДляПродвинутогоПакета();
		ОбластьШапки.Параметры.ЮрАдрес  = "Юр. адр.:"+ДанныеПечати.ДилерАдресЮридический;
		ОбластьШапки.Параметры.ИНН      = "ИНН "+ДанныеПечати.ДилерИНН;
		ОбластьШапки.Параметры.НаименованиеОрганизации = ДанныеПечати.ДилерНаименованиеОрганизацииКраткое;						
        ОбластьШапки.Параметры.ДатаДоговора  = Формат(ДанныеПечати.ДатаДоговора, "ДФ=dd.MM.yyyy")+"г.";
        ОбластьШапки.Параметры.НомерДоговора = ДанныеПечати.НомерДоговора;

		ОбластьШапки.Параметры.ФИООтветственного = ?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице);
	    ОбластьШапки.Параметры.УставОрганизации  = ДанныеПечати.ДилерПодписантНаОсновании;
		ОбластьШапки.Параметры.МаркаМодельПТС = ?(ЗначениеЗаполнено(СтрокаТЗ.ЗаявкаНаТрейдИн), ""+СтрокаТЗ.ЗаявкаНаТрейдИн.ПроизводительКод +" "+СтрокаТЗ.Автомобиль.Модель.Наименование,СтрокаТЗ.Автомобиль.Модель.Наименование);

		ОбластьШапки.Параметры.Паспорт    = ДанныеПечати.КлиентПаспортСерия+" "+ДанныеПечати.КлиентПаспортНомер;
		ОбластьШапки.Параметры.Выдан      = ДанныеПечати.КлиентПаспортВыданКем+", "+Формат(ДанныеПечати.КлиентПаспортВыданДата,"ДФ=dd.MM.yyyy");
		
		ТабДокумент.Вывести(ОбластьШапки);
		
		ОбластьСтрокаАвтомобиль = МакетАктПриемаПередачиАвтомобиля.ПолучитьОбласть("СтрокаАвтомобиль");
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаАвтомобиль.Параметры, СтрокаТЗ);	
		ОбластьСтрокаАвтомобиль.Параметры.МаркаМодельПТС = ?(ЗначениеЗаполнено(СтрокаТЗ.ЗаявкаНаТрейдИн), ""+СтрокаТЗ.ЗаявкаНаТрейдИн.ПроизводительКод +" "+СтрокаТЗ.Автомобиль.Модель.Наименование,СтрокаТЗ.Автомобиль.Модель.Наименование);

		ОбластьСтрокаАвтомобиль.Параметры.Двигатель = СтрокаТЗ.РабочийОбъемДвигателяПТС+" куб.см.,"+СтрокаТЗ.МощностьДвигателяПТС+" л.с.";
		Если СтрокаТЗ.НомерШассиПТС = "" Тогда                           
			ОбластьСтрокаАвтомобиль.Параметры.НомерШассиПТС = "ОТСУТСТВУЕТ";
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.ЦветКузоваПТС) Тогда
			ОбластьСтрокаАвтомобиль.Параметры.ЦветКузоваПТС = СтрокаТЗ.Автомобиль.Цвет;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.НомерДвигателяПТС) Тогда
			ОбластьСтрокаАвтомобиль.Параметры.НомерДвигателяПТС = СтрокаТЗ.Автомобиль.НомерДвигателя;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.НомерКузоваПТС) Тогда
			ОбластьСтрокаАвтомобиль.Параметры.НомерКузоваПТС = СтрокаТЗ.Автомобиль.НомерКузова;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.НомерШассиПТС) Тогда
			ОбластьСтрокаАвтомобиль.Параметры.НомерШассиПТС = СтрокаТЗ.Автомобиль.НомерШасси;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.ГодИзготовленияПТС) Тогда
			ОбластьСтрокаАвтомобиль.Параметры.ГодИзготовленияПТС = ?(ЗначениеЗаполнено(СтрокаТЗ.ГодВыпуска),Формат(СтрокаТЗ.ГодВыпуска,"ДФ=yyyy"), Формат(СтрокаТЗ.Автомобиль.ГодВыпуска,"ДФ=yyyy"));
		КонецЕсли;
		ОбластьСтрокаАвтомобиль.Параметры.ДатаПТС = Формат(СтрокаТЗ.ДатаПТС, "ДЛФ=DD");
		ОбластьСтрокаАвтомобиль.Параметры.Пробег  = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(СтрокаТЗ.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);	
		ТабДокумент.Вывести(ОбластьСтрокаАвтомобиль);
		
		ОбластьПодвал = МакетАктПриемаПередачиАвтомобиля.ПолучитьОбласть("Подвал");
		ОбластьПодвал.Параметры.ПТС        = СтрокаТЗ.ПТС;
		ОбластьПодвал.Параметры.Продавец   = ДанныеПечати.ДилерНаименованиеОрганизацииКраткое + Символы.ПС+
		                                     ДанныеПечати.ДилерАдресЮридический+Символы.ПС+
											 "Тел: "+ДанныеПечати.ДилерТелефон+Символы.ПС+
                                             "ИНН: "+ДанныеПечати.ДилерИНН+" КПП: "+ДанныеПечати.ДилерКПП+Символы.ПС+          
	                                         "ОГРН: "+ДанныеПечати.ДилерОГРН+Символы.ПС+
											 "р/с "+ДанныеПечати.ДилерСчет+" в"+Символы.ПС+
											 ДанныеПечати.ДилерБанк+Символы.ПС+
											 "к/с "+ДанныеПечати.ДилерКоррСчет+", БИК"+Символы.ПС+ 
											 ДанныеПечати.ДилерБИК+Символы.ПС+ 
											 "ОКВЭД: "+ДанныеПечати.ДилерОКВЭД+" ОКПО: "+ДанныеПечати.ДилерОКПО;
											
		ОбластьПодвал.Параметры.Покупатель = ДанныеПечати.КлиентДоговораНаименование+Символы.ПС+
		                                    "Паспорт: "+ДанныеПечати.КлиентПаспортСерия+" "+ДанныеПечати.КлиентПаспортНомер+Символы.ПС+
                                            "Выдан: "+ДанныеПечати.КлиентПаспортВыданКем+", "+Формат(ДанныеПечати.КлиентПаспортВыданДата,"ДФ=dd.MM.yyyy")+Символы.ПС+
                                            "Адрес регистрации: "+ДанныеПечати.КлиентАдрес;
											
        ОбластьПодвал.Параметры.ФИООтветственного      = ?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице);
        ОбластьПодвал.Параметры.НаименованиеПокупателя = ДанныеПечати.КлиентДоговораНаименование;
		
        ТабДокумент.Вывести(ОбластьПодвал);	
		
		Макет = Новый Структура();
		Макет.Вставить("Тип",ВРег("mxl"));
		Макет.Вставить("ПечатнаяФорма",ТабДокумент);
		Renault_УправлениеПечатьюКлиент.ПоказатьДокумент(Макет);
		
	КонецЦикла;
			
КонецПроцедуры

Процедура ПечатьАктПриемаПередачиАвтомобиляАгент(ДанныеПечати)
	
	МакетАктПриемаПередачиАвтомобиля = ПолучитьМакет("МакетАктПриемаПередачиАвтомобиляАгент");
	ОбластьШапки = МакетАктПриемаПередачиАвтомобиля.ПолучитьОбласть("Шапка");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 5;
	ТабДокумент.ПолеСправа = 5;	
	ДатаНадпись = Формат(ТекущаяДата(),"ДФ='дд ММММ гггг'");

	ТЗСостав = ДанныеПечати.СоставДоговора.Выгрузить(); 
	
	Для Каждого СтрокаТЗ ИЗ ТЗСостав Цикл	 

		ДанныеАгента = ПолучитьДанныеАгента(СтрокаТЗ.Автомобиль);

		ОбластьШапки.Параметры.ДатаЗаполнения         =  """" + ЛЕВ(ДатаНадпись,2)+ """ "+ Сред(ДатаНадпись,4, СтрДлина(ДатаНадпись))+" г.";
		ОбластьШапки.Параметры.НаименованиеПокупателя = ДанныеПечати.КлиентДоговораНаименование;
		ОбластьШапки.Параметры.Город                  = ""+ОпределитьГородДляПродвинутогоПакета();
		ОбластьШапки.Параметры.НаименованиеОрганизации = ДанныеПечати.ДилерНаименованиеОрганизацииКраткое;						
        ОбластьШапки.Параметры.ДатаДоговора  = Формат(ДанныеПечати.ДатаДоговора, "ДЛФ=DD");
        ОбластьШапки.Параметры.НомерДоговора = ДанныеПечати.НомерДоговора;
        ФИООтветственного = "";
		ПОЛ = обОпределитьПол(?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице));
		Если DMS_ФизическиеЛицаСервер.Просклонять(?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице),2,ФИООтветственного,?(ПОЛ=Перечисления.ПолФизическихЛиц.Женский,2,1)) Тогда
		КонецЕсли;

		ОбластьШапки.Параметры.ФИООтветственного = ФИООтветственного;
		Если ЗначениеЗаполнено(ДанныеАгента) Тогда
			ОбластьШапки.Параметры.Агент               = ДанныеАгента.Агент;
			ОбластьШапки.Параметры.УставОрганизации    = "Доверенности (Приложение №2 к Агентскому договору № "+ДанныеАгента.НомерДоговора+" от "+Формат(ДанныеАгента.ДатаДоговора, "ДЛФ=DD");	
		КонецЕсли;
				
		ТабДокумент.Вывести(ОбластьШапки);
		
		ОбластьСтрокаАвтомобиль = МакетАктПриемаПередачиАвтомобиля.ПолучитьОбласть("СтрокаАвтомобиль");
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаАвтомобиль.Параметры, СтрокаТЗ);	
		ОбластьСтрокаАвтомобиль.Параметры.МаркаМодельПТС = ?(ЗначениеЗаполнено(СтрокаТЗ.ЗаявкаНаТрейдИн), ""+СтрокаТЗ.ЗаявкаНаТрейдИн.ПроизводительКод +" "+СтрокаТЗ.Автомобиль.Модель.Наименование,СтрокаТЗ.Автомобиль.Модель.Наименование);

		ОбластьСтрокаАвтомобиль.Параметры.ОбъемДвигателяПТС = СтрокаТЗ.РабочийОбъемДвигателяПТС+" куб.см.";
		ОбластьСтрокаАвтомобиль.Параметры.МощностьДвигателяПТС = СтрокаТЗ.МощностьДвигателяПТС+" л.с.";
		Если СтрокаТЗ.НомерШассиПТС = "" Тогда                           
			ОбластьСтрокаАвтомобиль.Параметры.НомерШассиПТС = "ОТСУТСТВУЕТ";
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.ЦветКузоваПТС) Тогда
			ОбластьСтрокаАвтомобиль.Параметры.ЦветКузоваПТС = СтрокаТЗ.Автомобиль.Цвет;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.НомерДвигателяПТС) Тогда
			ОбластьСтрокаАвтомобиль.Параметры.НомерДвигателяПТС = СтрокаТЗ.Автомобиль.НомерДвигателя;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.НомерКузоваПТС) Тогда
			ОбластьСтрокаАвтомобиль.Параметры.НомерКузоваПТС = СтрокаТЗ.Автомобиль.НомерКузова;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.НомерШассиПТС) Тогда
			ОбластьСтрокаАвтомобиль.Параметры.НомерШассиПТС = СтрокаТЗ.Автомобиль.НомерШасси;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.ГодИзготовленияПТС) Тогда
			ОбластьСтрокаАвтомобиль.Параметры.ГодИзготовленияПТС = ?(ЗначениеЗаполнено(СтрокаТЗ.ГодВыпуска),Формат(СтрокаТЗ.ГодВыпуска,"ДФ=yyyy"), Формат(СтрокаТЗ.Автомобиль.ГодВыпуска,"ДФ=yyyy"));
		КонецЕсли;	
		ПТС = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(СтрокаТЗ.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ТехПаспорт);
		
		Если ЗначениеЗаполнено(ПТС) Тогда
			ОбластьСтрокаАвтомобиль.Параметры.ПТС = ПТС.Серия+" "+ПТС.Номер; 
			ОбластьСтрокаАвтомобиль.Параметры.ДатаПТС = Формат(ПТС.ДатаВыдачи,"ДФ=dd.MM.yyyy");
		КонецЕсли;	
				
		ОбластьСтрокаАвтомобиль.Параметры.ГосЗнак = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(СтрокаТЗ.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);	
		ОбластьСтрокаАвтомобиль.Параметры.Пробег  = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(СтрокаТЗ.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);	
		
		ТабДокумент.Вывести(ОбластьСтрокаАвтомобиль);
		
		ОбластьПодвал = МакетАктПриемаПередачиАвтомобиля.ПолучитьОбласть("Подвал");
        ФИООтветственного = ДанныеПечати.МенеджерФИО;
		Фамилия  = ЛЕВ(ФИООтветственного, Найти(ФИООтветственного," ")-1);
		ФИООтветственного = ПРАВ(ФИООтветственного, СтрДлина(ФИООтветственного)-СтрДлина(Фамилия)-1);
		Имя      = ЛЕВ(ФИООтветственного, Найти(ФИООтветственного," ")-1);
        ФИООтветственного = ПРАВ(ФИООтветственного, СтрДлина(ФИООтветственного)-СтрДлина(Имя)-1);
		Отчество = ФИООтветственного;
		ОбластьПодвал.Параметры.ПокупательСокр = Фамилия+" "+ЛЕВ(Имя,1)+"."+ЛЕВ(Отчество,1)+".";

		ОбластьПодвал.Параметры.ПродавецСокр = ДанныеПечати.КлиентФамилия+" "+ЛЕВ(ДанныеПечати.КлиентИмя,1)+ "."+ЛЕВ(ДанныеПечати.КлиентОтчество,1)+".";
		
        ТабДокумент.Вывести(ОбластьПодвал);	
		
		Макет = Новый Структура();
		Макет.Вставить("Тип",ВРег("mxl"));
		Макет.Вставить("ПечатнаяФорма",ТабДокумент);
		Renault_УправлениеПечатьюКлиент.ПоказатьДокумент(Макет);
		
	КонецЦикла;
			
КонецПроцедуры

Процедура ПечатьАктПриемаПередачиАвтомобиляДемо(ДанныеПечати)
	
	МакетАктПриемаПередачиАвтомобиля = ПолучитьМакет("МакетАктПриемаПередачиАвтомобиляДемо");
	ОбластьШапки = МакетАктПриемаПередачиАвтомобиля.ПолучитьОбласть("Шапка");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 5;
	ТабДокумент.ПолеСправа = 5;	
	ДатаНадпись = Формат(ТекущаяДата(),"ДФ='дд ММММ гггг'");

	ТЗСостав = ДанныеПечати.СоставДоговора.Выгрузить(); 
	
	Для Каждого СтрокаТЗ ИЗ ТЗСостав Цикл	 

		ОбластьШапки.Параметры.НаименованиеОрганизацииПолное = ДанныеПечати.ДилерНаименованиеОрганизации;
		ОбластьШапки.Параметры.ДатаЗаполнения         =  """" + ЛЕВ(ДатаНадпись,2)+ """ "+ Сред(ДатаНадпись,4, СтрДлина(ДатаНадпись))+" г.";
		ОбластьШапки.Параметры.НаименованиеПокупателя = ДанныеПечати.КлиентДоговораНаименование;
		ОбластьШапки.Параметры.Город                  = ""+ОпределитьГородДляПродвинутогоПакета();
		ОбластьШапки.Параметры.ЮрАдрес  = "Юр. адр.:"+ДанныеПечати.ДилерАдресЮридический;
		ОбластьШапки.Параметры.ИНН      = "ИНН "+ДанныеПечати.ДилерИНН;
		ОбластьШапки.Параметры.НаименованиеОрганизации = ДанныеПечати.ДилерНаименованиеОрганизацииКраткое;						
        ОбластьШапки.Параметры.ДатаДоговора  = Формат(ДанныеПечати.ДатаДоговора, "ДФ=dd.MM.yyyy")+"г.";
        ОбластьШапки.Параметры.НомерДоговора = ДанныеПечати.НомерДоговора;

		ОбластьШапки.Параметры.ФИООтветственного = ?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице);
	    ОбластьШапки.Параметры.УставОрганизации  = ДанныеПечати.ДилерПодписантНаОсновании;
		ОбластьШапки.Параметры.МаркаМодельПТС = ?(ЗначениеЗаполнено(СтрокаТЗ.ЗаявкаНаТрейдИн), ""+СтрокаТЗ.ЗаявкаНаТрейдИн.ПроизводительКод +" "+СтрокаТЗ.Автомобиль.Модель.Наименование,СтрокаТЗ.Автомобиль.Модель.Наименование);

		ОбластьШапки.Параметры.Паспорт    = ДанныеПечати.КлиентПаспортСерия+" "+ДанныеПечати.КлиентПаспортНомер;
		ОбластьШапки.Параметры.Выдан      = ДанныеПечати.КлиентПаспортВыданКем+", "+Формат(ДанныеПечати.КлиентПаспортВыданДата,"ДФ=dd.MM.yyyy");
		
		ТабДокумент.Вывести(ОбластьШапки);
		
		ОбластьСтрокаАвтомобиль = МакетАктПриемаПередачиАвтомобиля.ПолучитьОбласть("СтрокаАвтомобиль");
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаАвтомобиль.Параметры, СтрокаТЗ);
		ОбластьСтрокаАвтомобиль.Параметры.МаркаМодельПТС = ?(ЗначениеЗаполнено(СтрокаТЗ.ЗаявкаНаТрейдИн), ""+СтрокаТЗ.ЗаявкаНаТрейдИн.ПроизводительКод +" "+СтрокаТЗ.Автомобиль.Модель.Наименование,СтрокаТЗ.Автомобиль.Модель.Наименование);

		ОбластьСтрокаАвтомобиль.Параметры.Двигатель = СтрокаТЗ.РабочийОбъемДвигателяПТС+" куб.см.,"+СтрокаТЗ.МощностьДвигателяПТС+" л.с.";
		Если СтрокаТЗ.НомерШассиПТС = "" Тогда                           
			ОбластьСтрокаАвтомобиль.Параметры.НомерШассиПТС = "ОТСУТСТВУЕТ";
		КонецЕсли;
		ОбластьСтрокаАвтомобиль.Параметры.ДатаПТС = Формат(СтрокаТЗ.ДатаПТС, "ДЛФ=DD");
		ОбластьСтрокаАвтомобиль.Параметры.Пробег  = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(СтрокаТЗ.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);	
		Если Не ЗначениеЗаполнено(СтрокаТЗ.ЦветКузоваПТС) Тогда
			ОбластьСтрокаАвтомобиль.Параметры.ЦветКузоваПТС = СтрокаТЗ.Автомобиль.Цвет;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.НомерДвигателяПТС) Тогда
			ОбластьСтрокаАвтомобиль.Параметры.НомерДвигателяПТС = СтрокаТЗ.Автомобиль.НомерДвигателя;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.НомерКузоваПТС) Тогда
			ОбластьСтрокаАвтомобиль.Параметры.НомерКузоваПТС = СтрокаТЗ.Автомобиль.НомерКузова;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.НомерШассиПТС) Тогда
			ОбластьСтрокаАвтомобиль.Параметры.НомерШассиПТС = СтрокаТЗ.Автомобиль.НомерШасси;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.ГодИзготовленияПТС) Тогда
			ОбластьСтрокаАвтомобиль.Параметры.ГодИзготовленияПТС = ?(ЗначениеЗаполнено(СтрокаТЗ.ГодВыпуска),Формат(СтрокаТЗ.ГодВыпуска,"ДФ=yyyy"), Формат(СтрокаТЗ.Автомобиль.ГодВыпуска,"ДФ=yyyy"));
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьСтрокаАвтомобиль);
		
		ОбластьПодвал = МакетАктПриемаПередачиАвтомобиля.ПолучитьОбласть("Подвал");
		ОбластьПодвал.Параметры.ПТС        = СтрокаТЗ.ПТС;
		ОбластьПодвал.Параметры.Продавец   = ДанныеПечати.ДилерНаименованиеОрганизацииКраткое + Символы.ПС+
		                                     ДанныеПечати.ДилерАдресЮридический+Символы.ПС+
											 "Тел: "+ДанныеПечати.ДилерТелефон+Символы.ПС+
                                             "ИНН: "+ДанныеПечати.ДилерИНН+" КПП: "+ДанныеПечати.ДилерКПП+Символы.ПС+          
	                                         "ОГРН: "+ДанныеПечати.ДилерОГРН+Символы.ПС+
											 "р/с "+ДанныеПечати.ДилерСчет+" в"+Символы.ПС+
											 ДанныеПечати.ДилерБанк+Символы.ПС+
											 "к/с "+ДанныеПечати.ДилерКоррСчет+", БИК"+Символы.ПС+ 
											 ДанныеПечати.ДилерБИК+Символы.ПС+ 
											 "ОКВЭД: "+ДанныеПечати.ДилерОКВЭД+" ОКПО: "+ДанныеПечати.ДилерОКПО;
											
		ОбластьПодвал.Параметры.Покупатель = ДанныеПечати.КлиентДоговораНаименование+Символы.ПС+
		                                    "Паспорт: "+ДанныеПечати.КлиентПаспортСерия+" "+ДанныеПечати.КлиентПаспортНомер+Символы.ПС+
                                            "Выдан: "+ДанныеПечати.КлиентПаспортВыданКем+", "+Формат(ДанныеПечати.КлиентПаспортВыданДата,"ДФ=dd.MM.yyyy")+Символы.ПС+
                                            "Адрес регистрации: "+ДанныеПечати.КлиентАдрес;
											
        ОбластьПодвал.Параметры.ФИООтветственного      = ?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице);
        ОбластьПодвал.Параметры.НаименованиеПокупателя = ДанныеПечати.КлиентДоговораНаименование;
		
        ТабДокумент.Вывести(ОбластьПодвал);	
		
		Макет = Новый Структура();
		Макет.Вставить("Тип",ВРег("mxl"));
		Макет.Вставить("ПечатнаяФорма",ТабДокумент);
		Renault_УправлениеПечатьюКлиент.ПоказатьДокумент(Макет);
		
	КонецЦикла;
			
КонецПроцедуры

Процедура ПечатьОтчетКомиссионера(ДанныеПечати)
	
	МакетОтчетКомиссионера = ПолучитьМакет("МакетОтчетКомиссионера");
	ОбластьШапки = МакетОтчетКомиссионера.ПолучитьОбласть("Шапка");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 5;
	ТабДокумент.ПолеСправа = 5;	
	ДатаНадпись = Формат(ТекущаяДата(),"ДФ='дд ММММ гггг'");

	ТЗСостав = ДанныеПечати.СоставДоговора.Выгрузить(); 
	
	Для Каждого СтрокаТЗ ИЗ ТЗСостав Цикл	 

		ДанныеАгента = ПолучитьДанныеАгента(СтрокаТЗ.Автомобиль);

		ОбластьШапки.Параметры.ДатаЗаполнения =  """" + ЛЕВ(ДатаНадпись,2)+ """ "+ Сред(ДатаНадпись,4, СтрДлина(ДатаНадпись))+" г.";
		ОбластьШапки.Параметры.Город         = ""+ОпределитьГородДляПродвинутогоПакета();
        ОбластьШапки.Параметры.ДатаДоговора  = Формат(ДанныеАгента.ДатаДоговора, "ДФ=dd.MM.yyyy")+"г.";
        ОбластьШапки.Параметры.НомерДоговора = ДанныеАгента.НомерДоговора;
		СуммаВыкупа = ПолучитьСуммуВыкупа(СтрокаТЗ.Автомобиль);
		ОбластьШапки.Параметры.СуммаВыкупа   = СуммаВыкупа;
		ОбластьШапки.Параметры.СуммаВыкупаПрописью = обЧислоПрописью(СуммаВыкупа,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
		
		ТабДокумент.Вывести(ОбластьШапки);
		
		ОбластьПодвал = МакетОтчетКомиссионера.ПолучитьОбласть("Подвал");
												
        ОбластьПодвал.Параметры.ФИООтветственного      = ?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице);
        ОбластьПодвал.Параметры.НаименованиеПокупателя = ДанныеПечати.КлиентДоговораНаименование;
		
        ТабДокумент.Вывести(ОбластьПодвал);	
		
		Макет = Новый Структура();
		Макет.Вставить("Тип",ВРег("mxl"));
		Макет.Вставить("ПечатнаяФорма",ТабДокумент);
		Renault_УправлениеПечатьюКлиент.ПоказатьДокумент(Макет);
		
	КонецЦикла;
			
КонецПроцедуры

Процедура ПечатьОтчетАгента(ДанныеПечати)
	
	МакетОтчетАгента = ПолучитьМакет("МакетОтчетАгента");
	ОбластьШапки = МакетОтчетАгента.ПолучитьОбласть("Шапка");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 5;
	ТабДокумент.ПолеСправа = 5;	

	ТЗСостав = ДанныеПечати.СоставДоговора.Выгрузить(); 
	
	Для Каждого СтрокаТЗ ИЗ ТЗСостав Цикл	 

		ДанныеАгента = ПолучитьДанныеАгента(СтрокаТЗ.Автомобиль);

		ОбластьШапки.Параметры.ДатаЗаполнения = Формат(ТекущаяДата(), "ДЛФ=DD");
 
		ОбластьШапки.Параметры.Город         = ""+ОпределитьГородДляПродвинутогоПакета();
        ОбластьШапки.Параметры.ДатаДоговора  = Формат(ДанныеАгента.ДатаДоговора, "ДФ=dd.MM.yyyy")+"г.";
        ОбластьШапки.Параметры.НомерДоговора = ДанныеАгента.НомерДоговора;
		СуммаВыкупа = ПолучитьСуммуВыкупа(СтрокаТЗ.Автомобиль);
		ОбластьШапки.Параметры.СуммаВыкупа   = СуммаВыкупа;
		ОбластьШапки.Параметры.СуммаВыкупаПрописью = обЧислоПрописью(СуммаВыкупа,,"Л=ru_RU;НП=Ложь;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
		
		ТабДокумент.Вывести(ОбластьШапки);
		
		ОбластьПодвал = МакетОтчетАгента.ПолучитьОбласть("Подвал");
												
        ОбластьПодвал.Параметры.ФИООтветственного = ?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице);
        ОбластьПодвал.Параметры.Агент = ДанныеАгента.Агент;
		
        ТабДокумент.Вывести(ОбластьПодвал);	
		
		Макет = Новый Структура();
		Макет.Вставить("Тип",ВРег("mxl"));
		Макет.Вставить("ПечатнаяФорма",ТабДокумент);
		Renault_УправлениеПечатьюКлиент.ПоказатьДокумент(Макет);
		
	КонецЦикла;
			
КонецПроцедуры

Процедура ПечатьСогласиеНаОбработкуПерсональныхДанных(ДанныеПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 5;
	ТабДокумент.ПолеСправа = 5;
	МакетСогласиеНаОбработкуПерсональныхДанных = ПолучитьМакет("МакетСогласиеНаОбработкуПерсональныхДанных");
	ОбластьШапки = МакетСогласиеНаОбработкуПерсональныхДанных.ПолучитьОбласть("Шапка");
		
	ОбластьШапки.Параметры.ДатаДоговора   = Формат(ДанныеПечати.ДатаДоговора,"ДЛФ=D");
	ОбластьШапки.Параметры.НомерДоговора  = ДанныеПечати.НомерДоговора;
	ОбластьШапки.Параметры.Оператор       = ДанныеПечати.ДилерНаименованиеОрганизацииКраткое + Символы.ПС+
	                                        "ОГРН: "+ДанныеПечати.ДилерОГРН+ Символы.ПС+
											"ИНН/КПП: "+ДанныеПечати.ДилерИНН+"/"+ДанныеПечати.ДилерКПП+ Символы.ПС+
											"Юридический адрес: "+ДанныеПечати.ДилерАдресЮридический;
	
	ОбластьШапки.Параметры.Субъект        = ДанныеПечати.КлиентДоговораНаименование+" – потребитель, обратившийся в "+
	                                        ДанныеПечати.ДилерНаименованиеОрганизацииКраткое+" за приобретением автомобиля (паспорт: серия "+
										    ДанныеПечати.КлиентПаспортСерия+", номер "+ДанныеПечати.КлиентПаспортНомер+")";
											
	ОбластьШапки.Параметры.НаименованиеПокупателя  = ДанныеПечати.КлиентДоговораНаименование;						
	ОбластьШапки.Параметры.НаименованиеОрганизации = ДанныеПечати.ДилерНаименованиеОрганизацииКраткое;						
	
	ОбластьШапки.Параметры.Покупатель     = ДанныеПечати.КлиентФамилия+" "+ЛЕВ(ДанныеПечати.КлиентИмя,1)+ "."+ЛЕВ(ДанныеПечати.КлиентОтчество,1)+".";
	
	ОбластьШапки.Параметры.Паспорт    = ДанныеПечати.КлиентПаспортСерия + " "+ДанныеПечати.КлиентПаспортНомер;
	ОбластьШапки.Параметры.Выдан      = ДанныеПечати.КлиентПаспортВыданКем+" от "+Формат(ДанныеПечати.КлиентПаспортВыданДата,"ДФ=dd.MM.yyyy")+"г.";
	
	ТабДокумент.Вывести(ОбластьШапки);
	
	Макет = Новый Структура();
	Макет.Вставить("Тип",ВРег("mxl"));
	Макет.Вставить("ПечатнаяФорма",ТабДокумент);
	Renault_УправлениеПечатьюКлиент.ПоказатьДокумент(Макет);
				
КонецПроцедуры

Процедура ПечатьДоверенностьГИБДД(ДанныеПечати)
	
	ФормаДоверенныйГИБДД = Справочники.Сотрудники.ПолучитьФормуВыбора();
    ФормаДоверенныйГИБДД.МножественныйВыбор = Ложь;
	ФормаДоверенныйГИБДД.Заголовок = "Выберите сотрудника - доверенное лицо";
	
	ДоверенныйГИБДД = ФормаДоверенныйГИБДД.ОткрытьМодально();
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 5;
	ТабДокумент.ПолеСправа = 5;
	МакетДоверенностьГИБДД = ПолучитьМакет("МакетДоверенностьГИБДД");
	ОбластьШапки = МакетДоверенностьГИБДД.ПолучитьОбласть("Шапка");
	
	ТЗСостав = ДанныеПечати.СоставДоговора.Выгрузить(); 
	
	Для Каждого СтрокаТЗ ИЗ ТЗСостав Цикл	 

		ОбластьШапки.Параметры.НаименованиеПокупателя = ДанныеПечати.КлиентДоговораНаименование;
		ОбластьШапки.Параметры.Покупатель     = ДанныеПечати.КлиентФамилия+" "+ЛЕВ(ДанныеПечати.КлиентИмя,1)+ "."+ЛЕВ(ДанныеПечати.КлиентОтчество,1)+".";
		ОбластьШапки.Параметры.Город          = ""+ОпределитьГородДляПродвинутогоПакета();
		ОбластьШапки.Параметры.ДатаЗаполнения = Формат(ТекущаяДата(),"ДЛФ=DD");
		
		ОбластьШапки.Параметры.Паспорт        = ДанныеПечати.КлиентПаспортСерия + " "+ДанныеПечати.КлиентПаспортНомер;
		ОбластьШапки.Параметры.Выдан          = ДанныеПечати.КлиентПаспортВыданКем+", "+Формат(ДанныеПечати.КлиентПаспортВыданДата,"ДФ=dd.MM.yyyy");

		ОбластьШапки.Параметры.АдресРегистрации        = ДанныеПечати.КлиентАдрес;
		
		Если ДоверенныйГИБДД<>Неопределено Тогда
			ДоверенныйГИБДДНаименование = "";
			ПОЛ = обОпределитьПол(ДоверенныйГИБДД.Наименование);
			Если DMS_ФизическиеЛицаСервер.Просклонять(ДоверенныйГИБДД.Наименование,3,ДоверенныйГИБДДНаименование,?(ПОЛ=Перечисления.ПолФизическихЛиц.Женский,2,1)) Тогда
			КонецЕсли;

			ОбластьШапки.Параметры.Доверяю  = ДоверенныйГИБДДНаименование;
			ОбластьШапки.Параметры.ДатаРожденияДоверенного = Формат(ДоверенныйГИБДД.ДатаРождения,"ДФ=dd.MM.yyyy")+"г.";
			Паспорт                                        = Справочники.ПодтверждающиеДокументы.НайтиПоРеквизиту("ВидПодтверждающегоДокумента", Перечисления.ВидыДокументов.Паспорт,,ДоверенныйГИБДД);
			Если ЗначениеЗаполнено(Паспорт) Тогда
				ОбластьШапки.Параметры.ПаспортДоверенного  = Паспорт.Серия+" "+Паспорт.Номер+" выдан: "+Паспорт.КемВыдан+", "+Формат(Паспорт.ДатаВыдачи,"ДФ=dd.MM.yyyy")+"г.";
			КонецЕсли;	
			ОбластьШапки.Параметры.АдресРегистрацииДоверенного = Renault_УправлениеКонтактнойИнформацией.АдресКлиента(ДоверенныйГИБДД);
		КонецЕсли;
		
        ОбластьШапки.Параметры.Телефон                 = ДанныеПечати.КлиентОсновнойТелефон;
		ЗаполнитьЗначенияСвойств(ОбластьШапки.Параметры, СтрокаТЗ);	
		ОбластьШапки.Параметры.Двигатель               = СтрокаТЗ.РабочийОбъемДвигателяПТС+" куб.см.,"+СтрокаТЗ.МощностьДвигателяПТС+" л.с.";
		Если СтрокаТЗ.НомерШассиПТС = "" Тогда                           
			ОбластьШапки.Параметры.НомерШассиПТС = "ОТСУТСТВУЕТ";
		КонецЕсли;
		ОбластьШапки.Параметры.ДатаПТС = Формат(СтрокаТЗ.ДатаПТС, "ДЛФ=DD");
		
		ТабДокумент.Вывести(ОбластьШапки);
		
		Макет = Новый Структура();
		Макет.Вставить("Тип",ВРег("mxl"));
		Макет.Вставить("ПечатнаяФорма",ТабДокумент);
		Renault_УправлениеПечатьюКлиент.ПоказатьДокумент(Макет);
		
	КонецЦикла;
			
КонецПроцедуры

Процедура ПечатьНаправлениеВКассу(ДанныеПечати)
	
	СуммаАванса = 0;
	
	Если ВвестиЧисло(СуммаАванса, "Введите сумму") Тогда
	Иначе
		СуммаАванса = ?(ДанныеПечати.СуммаАванса=0, ДанныеПечати.СоставДоговора.Выгрузить().Итог("СуммаАвансаПоАвтомобилю"),ДанныеПечати.СуммаАванса);
	КонецЕсли;
	
    ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 5;
	ТабДокумент.ПолеСправа = 5;
	МакетНаправлениеВКассу = ПолучитьМакет("МакетНаправлениеВКассу");
	ОбластьШапки = МакетНаправлениеВКассу.ПолучитьОбласть("Шапка");
					
	ОбластьШапки.Параметры.НомерДоговора = ДанныеПечати.НомерДоговора;
	ОбластьШапки.Параметры.ДатаДоговора  = ДанныеПечати.ДатаДоговора;
	ОбластьШапки.Параметры.ДатаЗаполнения  = Формат(ТекущаяДата(),"ДФ='dd MMMM yyyy'");
	ОбластьШапки.Параметры.НаименованиеОрганизации = ДанныеПечати.ДилерНаименованиеОрганизацииКраткое; 
	ОбластьШапки.Параметры.Клиент                  = ДанныеПечати.КлиентДоговораНаименование;
	ОбластьШапки.Параметры.СуммаАванса             = СуммаАванса;
	ОбластьШапки.Параметры.Продавец                = ?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице);
		
	ТабДокумент.Вывести(ОбластьШапки);
	
	Макет = Новый Структура();
	Макет.Вставить("Тип",ВРег("mxl"));
	Макет.Вставить("ПечатнаяФорма",ТабДокумент);
	Renault_УправлениеПечатьюКлиент.ПоказатьДокумент(Макет);
			
КонецПроцедуры

Процедура ПечатьСпецификации(ДанныеПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 5;
	ТабДокумент.ПолеСправа = 5;
	ДатаНадпись = Формат(ДанныеПечати.ДатаДоговора,"ДФ='дд ММММ гггг'");
	
    Тариф = Renault_CRM.ПолучитьТекущийТарифНаАвтомобили(ДанныеПечати.ДатаДоговора);
	
	МакетСпецификация = ПолучитьМакет("МакетСпецификация");
	ОбластьШапки      = МакетСпецификация.ПолучитьОбласть("Шапка");
	
	ТЗСостав = ДанныеПечати.СоставДоговора.Выгрузить(); 
	
	НомерПоПорядку = 1;
	
	Для Каждого СтрокаТЗ ИЗ ТЗСостав Цикл	 
		
		ОбластьШапки.Параметры.НомерДоговора  = ДанныеПечати.НомерДоговора;
		ОбластьШапки.Параметры.ДатаДоговора   = """" + ЛЕВ(ДатаНадпись,2)+ """ "+ Сред(ДатаНадпись,4, СтрДлина(ДатаНадпись))+" года";
		ОбластьШапки.Параметры.НомерПоПорядку = НомерПоПорядку;
		ОбластьШапки.Параметры.Модель  = ?(ЗначениеЗаполнено(СтрокаТЗ.Модель), СтрокаТЗ.Модель.Наименование, "<Не указана>"); 
		ОбластьШапки.Параметры.Версия  = ?(ЗначениеЗаполнено(СтрокаТЗ.Версия), СтрокаТЗ.Версия.Наименование, "<Не указана>");
		ОбластьШапки.Параметры.Версия2 = ?(ЗначениеЗаполнено(СтрокаТЗ.Версия), СтрокаТЗ.Версия.Артикул,      "<Не указана>");
		ОбластьШапки.Параметры.Цвет    = ?(ЗначениеЗаполнено(СтрокаТЗ.Цвет), СтрокаТЗ.Цвет.Наименование + "("+СтрокаТЗ.Цвет.Артикул+")", "<Не указан>");
		
		ОбластьШапки.Параметры.Объем     = СтрокаТЗ.МодельДвигателяПТС;
		ОбластьШапки.Параметры.Двигатель = СтрокаТЗ.МощностьДвигателяПТС; 
		
		ТабДокумент.Вывести(ОбластьШапки);
		
		ШапкаБазовые   = МакетСпецификация.ПолучитьОбласть("ШапкаБазовые");		
		СтрокиБазовые  = МакетСпецификация.ПолучитьОбласть("БазовыеОпции");
		ШапкаДопОпции  = МакетСпецификация.ПолучитьОбласть("ШапкаДопОпции");		
		СтрокиДопОпции = МакетСпецификация.ПолучитьОбласть("ДопОпции");
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Renault_ТарифНаОпцииАвтомобилей.НаименованиеОпции КАК НаименованиеОпции
		|ИЗ
		|	РегистрСведений.Renault_ТарифНаОпцииАвтомобилей.СрезПоследних(
		|			,
		|			Тариф = &Тариф
		|				И Модель = &Модель
		|				И ВариантКомплектации = &ВариантКомплектации
		|				И Базовая = ИСТИНА) КАК Renault_ТарифНаОпцииАвтомобилей";
		
		Запрос.УстановитьПараметр("Модель", СтрокаТЗ.Модель);
		Запрос.УстановитьПараметр("ВариантКомплектации", СтрокаТЗ.Версия);
		Запрос.УстановитьПараметр("Тариф", Тариф);
		БазовыеОпции = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НаименованиеОпции");
		
		Если БазовыеОпции.Количество() > 0 Тогда
			ТабДокумент.Вывести(ШапкаБазовые);
			Для Каждого Стр Из БазовыеОпции Цикл
				СтрокиБазовые.Параметры.Опция1 = Стр;
				ТабДокумент.Вывести(СтрокиБазовые);
			КонецЦикла;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Renault_ОпцииАвтомобилей.Опция КАК Опция1,
		               |	Renault_ОпцииАвтомобилей.Опция.Артикул КАК ОпцияАртикул
		               |ИЗ
		               |	РегистрСведений.Renault_ОпцииАвтомобилей КАК Renault_ОпцииАвтомобилей
		               |ГДЕ
		               |	Renault_ОпцииАвтомобилей.VIN = &VIN";
		Запрос.УстановитьПараметр("VIN",СтрокаТЗ.VIN);

		ДопОпции = Запрос.Выполнить().Выгрузить();

		Если ДопОпции.Количество() > 0 Тогда
			ТабДокумент.Вывести(ШапкаДопОпции);
			Для Каждого Стр Из ДопОпции Цикл
				ЗаполнитьЗначенияСвойств(СтрокиДопОпции.Параметры, Стр);
				ТабДокумент.Вывести(СтрокиДопОпции);
			КонецЦикла;
			
		КонецЕсли;
		
		Подвал                                  = МакетСпецификация.ПолучитьОбласть("Подвал");
		ФИООтветственного                       = ?(ДанныеПечати.ДилерПодписантВЛице = "", ДанныеПечати.МенеджерФИО, ДанныеПечати.ДилерПодписантВЛице);
		Фамилия  = ЛЕВ(ФИООтветственного, Найти(ФИООтветственного," ")-1);
		ФИООтветственного = ПРАВ(ФИООтветственного, СтрДлина(ФИООтветственного)-СтрДлина(Фамилия)-1);
		Имя      = ЛЕВ(ФИООтветственного, Найти(ФИООтветственного," ")-1);
        ФИООтветственного = ПРАВ(ФИООтветственного, СтрДлина(ФИООтветственного)-СтрДлина(Имя)-1);
		Отчество = ФИООтветственного;
		Подвал.Параметры.ФИООтветственного      = Фамилия+" "+ЛЕВ(Имя,1)+"."+ЛЕВ(Отчество,1)+".";
		Подвал.Параметры.НаименованиеПокупателя = ДанныеПечати.КлиентФамилия+" "+ЛЕВ(ДанныеПечати.КлиентИмя,1)+ "."+ЛЕВ(ДанныеПечати.КлиентОтчество,1)+".";
		
		ТабДокумент.Вывести(Подвал);
		
		НомерПоПорядку = НомерПоПорядку+1;
		
		Макет = Новый Структура();
		Макет.Вставить("Тип",ВРег("mxl"));
		Макет.Вставить("ПечатнаяФорма",ТабДокумент);
		Renault_УправлениеПечатьюКлиент.ПоказатьДокумент(Макет);
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПечатьПродвинутогоПакета(ТипМакета, ДоговорСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_Договор.Ссылка КАК Ссылка,
	|	Renault_Договор.Номер КАК НомерДоговора,
	|	Renault_Договор.Дата КАК Дата,
	|	Renault_Договор.ДатаДоговора КАК ДатаДоговора,
	|	Renault_Договор.Комментарий КАК Комментарий,
	|	Renault_Договор.СтатусДоговора КАК СтатусДоговора,
	|	Renault_Договор.РеализацияАвтомобиля КАК РеализацияАвтомобиля,
	|	Renault_Договор.ЗаказНаАвтомобиль КАК ЗаказНаАвтомобиль,
	|	ЕСТЬNULL(Контрагенты.Ссылка, CRM_ПотенциальныеКонтрагенты.Ссылка) КАК Клиент,
	|	ЕСТЬNULL(Контрагенты.ФормаСобственности, CRM_ПотенциальныеКонтрагенты.ФормаСобственности) КАК КлиентФормаСобственности,
	|	ЕСТЬNULL(Контрагенты.Фамилия, CRM_ПотенциальныеКонтрагенты.Фамилия) КАК КлиентФамилия,
	|	ЕСТЬNULL(Контрагенты.Имя, CRM_ПотенциальныеКонтрагенты.Имя) КАК КлиентИмя,
	|	ЕСТЬNULL(Контрагенты.Отчество, CRM_ПотенциальныеКонтрагенты.Отчество) КАК КлиентОтчество,
	|	ЕСТЬNULL(Контрагенты.Пол, CRM_ПотенциальныеКонтрагенты.Пол) КАК КлиентПол,
	|	ЕСТЬNULL(Контрагенты.ДатаРождения, CRM_ПотенциальныеКонтрагенты.ДатаРождения) КАК КлиентДатаРождения,
	|	ЕСТЬNULL(ПодтверждающиеДокументы.Серия, """") КАК КлиентПаспортСерия,
	|	ЕСТЬNULL(ПодтверждающиеДокументы.Номер, """") КАК КлиентПаспортНомер,
	|	ЕСТЬNULL(ПодтверждающиеДокументы.КемВыдан, """") КАК КлиентПаспортВыданКем,
	|	ЕСТЬNULL(ПодтверждающиеДокументы.ДатаВыдачи, """") КАК КлиентПаспортВыданДата,
	|	ЕСТЬNULL(КонтактнаяИнформацияТелефоны.Представление, """") КАК КлиентОсновнойТелефон,
	|	ЕСТЬNULL(КонтактнаяИнформацияEMail.Представление, """") КАК КлиентОсновнойEmail,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Контрагенты.ФормаСобственности, CRM_ПотенциальныеКонтрагенты.ФормаСобственности) = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЧастноеЛицо)
	|			ТОГДА ЕСТЬNULL(КонтактнаяИнформацияАдресФакт.Представление, """")
	|		ИНАЧЕ ЕСТЬNULL(КонтактнаяИнформацияАдресЮр.Представление, """")
	|	КОНЕЦ КАК КлиентАдрес,
	|	Renault_Договор.КлиентДоговора.Наименование КАК КлиентДоговораНаименование,
	|	ЕСТЬNULL(Контрагенты.ИНН, CRM_ПотенциальныеКонтрагенты.ИНН) КАК КлиентИНН,
	|	ЕСТЬNULL(Контрагенты.КПП, CRM_ПотенциальныеКонтрагенты.КПП) КАК КлиентКПП,
	|	ЕСТЬNULL(Контрагенты.КодПоОКПО, CRM_ПотенциальныеКонтрагенты.КодПоОКПО) КАК КлиентКодПоОКПО,
	|	ЕСТЬNULL(Контрагенты.КодИМНС, CRM_ПотенциальныеКонтрагенты.КодИМНС) КАК КлиентКодИМНС,
	|	Renault_Договор.КлиентБанковскийСчет.НомерСчета КАК КлиентСчет,
	|	Renault_Договор.КлиентБанковскийСчет.Банк.КоррСчет КАК КлиентКоррСчет,
	|	Renault_Договор.КлиентБанковскийСчет.Банк.Код КАК КлиентБИК,
	|	Renault_Договор.КлиентБанковскийСчет.Банк КАК КлиентБанкСчета,
	|	Renault_Договор.НесколькоАвтомобилейВДоговоре КАК НесколькоАвтомобилейВДоговоре,
	|	Renault_Договор.ДилерскийЦентр КАК ДилерскийЦентр,
	|	Renault_Договор.СуммаДоговора КАК СуммаДоговора,
	|	Renault_Договор.СуммаАванса КАК СуммаАванса,
	|	Renault_Договор.Организация КАК Организация,
	|	Renault_Договор.Менеджер КАК Менеджер,
	|	Renault_Договор.КлиентПодписант КАК КлиентПодписант,
	|	CRM_КлиентскиеДанныеПодписанта.ПодписантВЛице КАК КлиентПодписантВЛице,
	|	CRM_КлиентскиеДанныеПодписанта.ПодписантНаОсновании КАК КлиентПодписантНаОсновании,
	|	CRM_КлиентскиеДанныеПодписанта.ПодписантПодпись КАК КлиентПодписантПодпись,
	|	CRM_КлиентскиеДанныеПодписанта.ПодписантДолжность КАК КлиентПодписантДолжность,
	|	Renault_Договор.КлиентПодписант.НаименованиеПолное КАК КлиентПодписантФИО,
	|	Renault_Договор.КлиентПодписант.НаименованиеПолное КАК ФИООтветственногоПокупателя,
	|	Renault_Договор.ДилерНаименованиеОрганизации КАК ДилерНаименованиеОрганизации,
	|	Renault_Договор.ДилерИНН КАК ДилерИНН,
	|	Renault_Договор.ДилерКПП КАК ДилерКПП,
	|	Renault_Договор.ДилерСчет КАК ДилерСчет,
	|	Renault_Договор.ДилерКоррСчет КАК ДилерКоррСчет,
	|	Renault_Договор.ДилерБИК КАК ДилерБИК,
	|	Renault_Договор.ДилерБанк КАК ДилерБанк,
	|	Renault_Договор.ДилерАдресЮридический КАК ДилерАдресЮридический,
	|	Renault_Договор.ДилерАдресФактический КАК ДилерАдресФактический,
	|	Renault_Договор.ДилерТелефон КАК ДилерТелефон,
	|	Renault_Договор.ДилерПодписантВЛице КАК ДилерПодписантВЛице,
	|	Renault_Договор.ДилерПодписантНаОсновании КАК ДилерПодписантНаОсновании,
	|	Renault_Договор.ДилерПодписантПодпись КАК ДилерПодписантПодпись,
	|	Renault_Договор.ДилерПодписантДолжность КАК ДилерПодписантДолжность,
	|	Renault_Договор.СоставДоговора.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Идентификатор КАК Идентификатор,
	|		ЗаказВПроизводство КАК ЗаказВПроизводство,
	|		Автомобиль КАК Автомобиль,
	|		VIN КАК VIN,
	|		ГодВыпуска КАК ГодВыпуска,
	|		Модель КАК Модель,
	|		Версия КАК Версия,
	|		Цвет КАК Цвет,
	|		ЖелаемаяДатаВыдачи КАК ЖелаемаяДатаВыдачи,
	|		СоставОпций КАК СоставОпций,
	|		ОбщаяСуммаПоАвтомобилю КАК ОбщаяСуммаПоАвтомобилю,
	|		СтоимостьБазовойКомплектации КАК СтоимостьБазовойКомплектации,
	|		СуммаДоставки КАК СуммаДоставки,
	|		СуммаСкидки КАК СуммаСкидки,
	|		СтоимостьДопОпций КАК СтоимостьДопОпций,
	|		СтоимостьОпцийДилера КАК СтоимостьОпцийДилера,
	|		РазницаССуммойПоДоговору КАК РазницаССуммойПоДоговору,
	|		СуммаАвтомобиляИтого КАК СуммаАвтомобиляИтого,
	|		СуммаОпцийИтого КАК СуммаОпцийИтого,
	|		СтоимостьУстановленногоОборудования КАК СтоимостьУстановленногоОборудования,
	|		СтоимостьАвторабот КАК СтоимостьАвторабот,
	|		Модель.Артикул КАК КодМодели,
	|		Версия.Артикул КАК КодВерсии,
	|		Цвет.Артикул КАК КодЦвета,
	|		МаркаМодельПТС КАК МаркаМодельПТС,
	|		ТипПТС КАК ТипПТС,
	|		КатегорияПТС КАК КатегорияПТС,
	|		ГодИзготовленияПТС КАК ГодИзготовленияПТС,
	|		НомерДвигателяПТС КАК НомерДвигателяПТС,
	|		НомерШассиПТС КАК НомерШассиПТС,
	|		НомерКузоваПТС КАК НомерКузоваПТС,
	|		ЦветКузоваПТС КАК ЦветКузоваПТС,
	|		МощностьДвигателяПТС КАК МощностьДвигателяПТС,
	|		РабочийОбъемДвигателяПТС КАК РабочийОбъемДвигателяПТС,
	|		ТипДвигателяПТС КАК ТипДвигателяПТС,
	|		ЭкологическийКлассДвигателяПТС КАК ЭкологическийКлассДвигателяПТС,
	|		ПТС КАК ПТС,
	|		ОрганизацияИзготовительПТС КАК ОрганизацияИзготовительПТС,
	|		ГарантияПТС КАК ГарантияПТС,
	|		РазрешеннаяМаксимальнаяМассаПТС КАК РазрешеннаяМаксимальнаяМассаПТС,
	|		МассаБезНагрузкиПТС КАК МассаБезНагрузкиПТС,
	|		ОдобрениеТипаТСПТС КАК ОдобрениеТипаТСПТС,
	|		МодельДвигателяПТС КАК МодельДвигателяПТС,
	|		ДатаПТС КАК ДатаПТС,
	|		АдресИзготовителяПТС КАК АдресИзготовителяПТС,
	|		ДатаВыдачи КАК ДатаВыдачи,
	|		ПокупкаВТрейдИн КАК ПокупкаВТрейдИн,
	|		ПокупкаПоУтилизации КАК ПокупкаПоУтилизации,
	|		ПокупкаВКредит КАК ПокупкаВКредит,
	|		СуммаКредита КАК СуммаКредита,
	|		СуммаТрейдИн КАК СуммаТрейдИн,
	|		СуммаВозмещенияПоУтилизации КАК СуммаВозмещенияПоУтилизации,
	|		СуммаСубсидииПоКредиту КАК СуммаСубсидииПоКредиту,
	|		СуммаСкидокПоКоммерческимАкциям КАК СуммаСкидокПоКоммерческимАкциям,
	|		СуммаПоПрочимСкидкам КАК СуммаПоПрочимСкидкам,
	|		ЦенаПродажиАвтомобиля КАК ЦенаПродажиАвтомобиля,
	|		ВключитьУтилизациюВДоговор КАК ВключитьУтилизациюВДоговор,
	|		ВключитьТрейдИнВДоговор КАК ВключитьТрейдИнВДоговор,
	|		СтоимостьВыкупленногоАвтомобиля КАК СтоимостьВыкупленногоАвтомобиля,
	|		СтоимостьОборудованияДляУстановки КАК СтоимостьОборудованияДляУстановки,
	|		ЗаявкаНаТрейдИн КАК ЗаявкаНаТрейдИн,
	|		СуммаАвансаПоАвтомобилю КАК СуммаАвансаПоАвтомобилю,
	|		СуммаПредоплаты КАК СуммаПредоплаты
	|	) КАК СоставДоговора,
	|	Renault_Договор.ДопОпцииАвтомобилей.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Идентификатор КАК Идентификатор,
	|		Опция КАК Опция,
	|		Цена КАК Цена,
	|		Код КАК Код,
	|		Наименование КАК Наименование
	|	) КАК ДопОпцииАвтомобилей,
	|	Renault_Договор.УстановленноеОборудование.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Идентификатор КАК Идентификатор,
	|		Номенклатура КАК Номенклатура,
	|		Цена КАК Цена,
	|		Количество КАК Количество,
	|		Сумма КАК Сумма
	|	) КАК УстановленноеОборудование,
	|	Renault_Договор.ОборудованиеДляУстановки.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Идентификатор КАК Идентификатор,
	|		Номенклатура КАК Номенклатура,
	|		Цена КАК Цена,
	|		Количество КАК Количество,
	|		Сумма КАК Сумма
	|	) КАК ОборудованиеДляУстановки,
	|	Renault_Договор.СуммаДоговора - Renault_Договор.СуммаАванса КАК СуммаЗаВычетомАванса,
	|	Renault_Договор.Менеджер.Наименование КАК МенеджерФИО,
	|	Renault_Договор.ДатаАктаПередачи КАК ДатаАктаПередачи,
	|	Renault_ДополнительныеСвойстваОрганизации.БИН КАК БИН,
	|	Renault_Договор.Организация.КодПоОКВЭД КАК ДилерОКВЭД,
	|	Renault_Договор.Организация.ОГРН КАК ДилерОГРН,
	|	Renault_Договор.Организация.КодПоОКПО КАК ДилерОКПО,
	|	ЕСТЬNULL(Renault_Договор.Организация.Наименование, Renault_Договор.ДилерНаименованиеОрганизации) КАК ДилерНаименованиеОрганизацииКраткое,
	|	Renault_Договор.СуммаКредита КАК СуммаКредита,
	|	Renault_Договор.СпособОплаты КАК СпособОплаты,
	|	Renault_Договор.УтилВладениеАвтомобилемС КАК УтилВладениеАвтомобилемС,
	|	Renault_Договор.УтилДоверенность КАК УтилДоверенность,
	|	Renault_Договор.УтилГодВыпуска КАК УтилГодВыпуска,
	|	Renault_Договор.УтилМаркаМодель КАК УтилМаркаМодель,
	|	Renault_Договор.УтилVIN КАК УтилVIN,
	|	Renault_Договор.УтилГосНомер КАК УтилГосНомер,
	|	Renault_Договор.УтилНомерКузова КАК УтилНомерКузова,
	|	Renault_Договор.УтилНомерДвигателя КАК УтилНомерДвигателя,
	|	Renault_Договор.УтилНомерШасси КАК УтилНомерШасси,
	|	Renault_Договор.УтилПТС КАК УтилПТС,
	|	Renault_Договор.УтилДатаПТС КАК УтилДатаПТС,
	|	Renault_Договор.УтилПробег КАК УтилПробег,
	|	Renault_Договор.УтилКоличествоВладельцев КАК УтилКоличествоВладельцев,
	|	Renault_Договор.УтилНомерИДатаАктаСдачи КАК УтилНомерИДатаАктаСдачи,
	|	Renault_Договор.Утилизатор КАК Утилизатор,
	|	Renault_Договор.УтилизаторАдрес КАК УтилизаторАдрес,
	|	Renault_Договор.УтилизаторОГРН КАК УтилизаторОГРН,
	|	Renault_Договор.УтилЦвет КАК УтилЦвет,
	|	Renault_Договор.УтилизаторИНН КАК УтилизаторИНН,
	|	Renault_Договор.УтилизаторКПП КАК УтилизаторКПП,
	|	Renault_Договор.УтилизаторТелефон КАК УтилизаторТелефон,
	|	Renault_Договор.УтилизаторКонтЛицо КАК УтилизаторКонтЛицо,
	|	Renault_Договор.УтилизаторДолжностьКонтЛица КАК УтилизаторДолжностьКонтЛица,
	|	Renault_Договор.ПоступлениеАвтомобиля КАК ПоступлениеАвтомобиля
	|ИЗ
	|	Документ.Renault_Договор КАК Renault_Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ДополнительныеСвойстваОрганизации КАК Renault_ДополнительныеСвойстваОрганизации
	|		ПО Renault_Договор.Организация = Renault_ДополнительныеСвойстваОрганизации.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
	|		ПО (CRM_СобытияПоРабочимЛистам.IDK = Renault_Договор.РабочийЛист)
	|			И (CRM_СобытияПоРабочимЛистам.ВидСобытия = ЗНАЧЕНИЕ(Справочник.CRM_ВидыСобытий.Выдача))
	|			И (CRM_СобытияПоРабочимЛистам.ЗавершеноУспешно = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (Контрагенты.Ссылка = Renault_Договор.КлиентДоговора)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_ПотенциальныеКонтрагенты КАК CRM_ПотенциальныеКонтрагенты
	|		ПО (CRM_ПотенциальныеКонтрагенты.Ссылка = Renault_Договор.КлиентДоговора)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|		ПО Renault_Договор.КлиентДоговора = ПодтверждающиеДокументы.Владелец
	|			И (ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Паспорт))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияТелефоны
	|		ПО Renault_Договор.КлиентДоговора = КонтактнаяИнформацияТелефоны.Объект
	|			И (КонтактнаяИнформацияТелефоны.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	|			И (КонтактнаяИнформацияТелефоны.ЗначениеПоУмолчанию = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияАдресЮр
	|		ПО Renault_Договор.КлиентДоговора = КонтактнаяИнформацияАдресЮр.Объект
	|			И (КонтактнаяИнформацияАдресЮр.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформацияАдресЮр.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЮридический))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияАдресФакт
	|		ПО Renault_Договор.КлиентДоговора = КонтактнаяИнформацияАдресФакт.Объект
	|			И (КонтактнаяИнформацияАдресФакт.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформацияТелефоны.ЗначениеПоУмолчанию = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияEMail
	|		ПО Renault_Договор.КлиентДоговора = КонтактнаяИнформацияEMail.Объект
	|			И (КонтактнаяИнформацияEMail.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	|			И (КонтактнаяИнформацияEMail.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_КлиентскиеДанные КАК CRM_КлиентскиеДанныеПодписанта
	|		ПО Renault_Договор.КлиентПодписант = CRM_КлиентскиеДанныеПодписанта.Клиент
	|ГДЕ
	|	Renault_Договор.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДоговорСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВалютаРубли = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
	Тариф = Renault_CRM.ПолучитьТекущийТарифНаАвтомобили(ДоговорСсылка.ДатаДоговора);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 5;
	ТабДокумент.ПолеСправа = 5;
	Если Выборка.Следующий() Тогда
		
		Если ТипМакета = "МакетСпецификация" Тогда
			ПечатьСпецификации(Выборка);
		ИначеЕсли ТипМакета = "МакетНаправлениеВКассу" Тогда
			ПечатьНаправлениеВКассу(Выборка);
		ИначеЕсли ТипМакета = "МакетОсновногоДоговора" Тогда
			
			ТЗСостав = Выборка.СоставДоговора.Выгрузить(); 
			Если ТЗСостав.Количество()>0 Тогда
				ВидАвтомобиля = ОпределитьВидАвтомобиля(ТЗСостав[0].Автомобиль);
				Если ВидАвтомобиля = Перечисления.ВидАвтомобиля.DMS_Выкуп Или ВидАвтомобиля = Перечисления.ВидАвтомобиля.DMS_Зачет Тогда
					ПечатьОсновногоДоговораВыкупАвто(Выборка);
				ИначеЕсли ВидАвтомобиля = Перечисления.ВидАвтомобиля.DMS_Комиссия Тогда
					ПечатьОсновногоДоговораКомисАвто(Выборка);
				ИначеЕсли ВидАвтомобиля = Перечисления.ВидАвтомобиля.DMS_Агентский Тогда
					ПечатьОсновногоДоговораАгентАвто(Выборка);
				ИначеЕсли ВидАвтомобиля = "Демо" Тогда
					ПечатьОсновногоДоговораДемоАвто(Выборка);
				Иначе
					ПечатьОсновногоДоговора(Выборка); //новый авто
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ТипМакета = "МакетПредварительногоДоговора" Тогда
			ПечатьПредварительногоДоговора(Выборка);
		ИначеЕсли ТипМакета = "МакетДоверенностьГИБДД" Тогда
			ПечатьДоверенностьГИБДД(Выборка);
		ИначеЕсли ТипМакета = "МакетСогласиеНаОбработкуПерсональныхДанных" Тогда
			ПечатьСогласиеНаОбработкуПерсональныхДанных(Выборка);
		ИначеЕсли ТипМакета = "МакетАктПриемаПередачиАвтомобиля" Тогда
			
			ТЗСостав = Выборка.СоставДоговора.Выгрузить(); 
			Если ТЗСостав.Количество()>0 Тогда
				ТипАвтомобиля = ОпределитьВидАвтомобиля(ТЗСостав[0].Автомобиль);
				// начало добавление Зеленчук
				Если Выборка.КлиентФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда
					ПечатьАктПриемаПередачиАвтомобиляКорп(Выборка);
				Иначе
					// окончание добавления Зеленчук
					Если ТипАвтомобиля = Справочники.Renault_ТипыАвтомобилей.БУ Или
						ТипАвтомобиля = Справочники.Renault_ТипыАвтомобилей.Зачет Или 
						ТипАвтомобиля = Справочники.Renault_ТипыАвтомобилей.Комиссия Тогда
						ПечатьАктПриемаПередачиАвтомобиляВыкуп(Выборка);
					ИначеЕсли ТипАвтомобиля = Справочники.Renault_ТипыАвтомобилей.Агентский Тогда
						ПечатьАктПриемаПередачиАвтомобиляАгент(Выборка);
					ИначеЕсли ТипАвтомобиля = "Демо" Тогда
						ПечатьАктПриемаПередачиАвтомобиляДемо(Выборка);
					Иначе
						ПечатьАктПриемаПередачиАвтомобиля(Выборка); //новый
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ТипМакета = "МакетАктПриемаПередачиНаУтилизацию" Тогда
			ПечатьАктПриемаПередачиНаУтилизацию(Выборка);
		ИначеЕсли ТипМакета = "МакетГарантийноеПисьмо" Тогда
			ПечатьГарантийноеПисьмо(Выборка);
		ИначеЕсли ТипМакета = "МакетОтчетКомиссионера" Тогда
			ПечатьОтчетКомиссионера(Выборка);
		ИначеЕсли ТипМакета = "МакетОтчетАгента" Тогда
			ПечатьОтчетАгента(Выборка);
		ИначеЕсли ТипМакета = "МакетДоговорКорп" Тогда
			ПечатьДоговораКорп(Выборка)
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьГородДляПродвинутогоПакета() Экспорт
	
	ЭтоМосква = Константы.Renault_ЭтоМосковскаяБаза.Получить();
	
	Если ЭтоМосква Тогда	
		Город = "г. Москва";		
	Иначе 		
		Город = "г. Санкт-Петербург";		
	КонецЕсли;
	
	Возврат Город;
	
КонецФункции
#КонецЕсли