Перем мТипАвтомобиля Экспорт;
Перем Права Экспорт;

#Если НЕ Сервер Тогда
Процедура ПечатьДокумента (ТипМакета, ДоговорСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_Договор.Ссылка,
	|	Renault_Договор.Номер КАК НомерДоговора,
	|	Renault_Договор.Дата,
	|	Renault_Договор.ДатаДоговора,
	|	Renault_Договор.Комментарий,
	|	Renault_Договор.СтатусДоговора,
	|	Renault_Договор.РеализацияАвтомобиля,
	|	Renault_Договор.ЗаказНаАвтомобиль,
	|	ЕСТЬNULL(Контрагенты.Ссылка, CRM_ПотенциальныеКонтрагенты.Ссылка) КАК Клиент,
	|	ЕСТЬNULL(Контрагенты.ФормаСобственности, CRM_ПотенциальныеКонтрагенты.ФормаСобственности) КАК КлиентФормаСобственности,
	|	ЕСТЬNULL(Контрагенты.Фамилия, CRM_ПотенциальныеКонтрагенты.Фамилия) КАК КлиентФамилия,
	|	ЕСТЬNULL(Контрагенты.Имя, CRM_ПотенциальныеКонтрагенты.Имя) КАК КлиентИмя,
	|	ЕСТЬNULL(Контрагенты.Отчество, CRM_ПотенциальныеКонтрагенты.Отчество) КАК КлиентОтчество,
	|	ЕСТЬNULL(Контрагенты.Пол, CRM_ПотенциальныеКонтрагенты.Пол) КАК КлиентПол,
	|	ЕСТЬNULL(Контрагенты.ДатаРождения, CRM_ПотенциальныеКонтрагенты.ДатаРождения) КАК КлиентДатаРождения,
	|	ЕСТЬNULL(ПодтверждающиеДокументы.Серия, """") КАК КлиентПаспортСерия,
	|	ЕСТЬNULL(ПодтверждающиеДокументы.Номер, """") КАК КлиентПаспортНомер,
	|	ЕСТЬNULL(ПодтверждающиеДокументы.КемВыдан, """") КАК КлиентПаспортВыданКем,
	|	ЕСТЬNULL(ПодтверждающиеДокументы.ДатаВыдачи, """") КАК КлиентПаспортВыданДата,
	|	ЕСТЬNULL(КонтактнаяИнформацияТелефоны.Представление, """") КАК КлиентОсновнойТелефон,
	|	ЕСТЬNULL(КонтактнаяИнформацияEMail.Представление, """") КАК КлиентОсновнойEmail,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Контрагенты.ФормаСобственности, CRM_ПотенциальныеКонтрагенты.ФормаСобственности) = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЧастноеЛицо)
	|			ТОГДА ЕСТЬNULL(КонтактнаяИнформацияАдресФакт.Представление, """")
	|		ИНАЧЕ ЕСТЬNULL(КонтактнаяИнформацияАдресЮр.Представление, """")
	|	КОНЕЦ КАК КлиентАдрес,
	|	Renault_Договор.КлиентДоговора.Наименование,
	|	ЕСТЬNULL(Контрагенты.ИНН, CRM_ПотенциальныеКонтрагенты.ИНН) КАК КлиентИНН,
	|	ЕСТЬNULL(Контрагенты.КПП, CRM_ПотенциальныеКонтрагенты.КПП) КАК КлиентКПП,
	|	ЕСТЬNULL(Контрагенты.КодПоОКПО, CRM_ПотенциальныеКонтрагенты.КодПоОКПО) КАК КлиентКодПоОКПО,
	|	ЕСТЬNULL(Контрагенты.КодИМНС, CRM_ПотенциальныеКонтрагенты.КодИМНС) КАК КлиентКодИМНС,
	|	Renault_Договор.КлиентБанковскийСчет.НомерСчета КАК КлиентСчет,
	|	Renault_Договор.КлиентБанковскийСчет.Банк.КоррСчет КАК КлиентКоррСчет,
	|	Renault_Договор.КлиентБанковскийСчет.Банк.Код КАК КлиентБИК,
	|	Renault_Договор.КлиентБанковскийСчет.Банк КАК КлиентБанкСчета,
	|	Renault_Договор.НесколькоАвтомобилейВДоговоре,
	|	Renault_Договор.ДилерскийЦентр,
	|	Renault_Договор.СуммаДоговора,
	|	Renault_Договор.СуммаАванса,
	|	Renault_Договор.Организация,
	|	Renault_Договор.Менеджер,
	|	Renault_Договор.КлиентПодписант КАК КлиентПодписантВЛице,
	|	Renault_Договор.ДилерНаименованиеОрганизации,
	|	Renault_Договор.ДилерИНН,
	|	Renault_Договор.ДилерКПП,
	|	Renault_Договор.ДилерСчет,
	|	Renault_Договор.ДилерКоррСчет,
	|	Renault_Договор.ДилерБИК,
	|	Renault_Договор.ДилерБанк,
	|	Renault_Договор.ДилерАдресЮридический,
	|	Renault_Договор.ДилерАдресФактический,
	|	Renault_Договор.ДилерТелефон,
	|	Renault_Договор.ДилерПодписантВЛице,
	|	Renault_Договор.ДилерПодписантНаОсновании,
	|	Renault_Договор.ДилерПодписантПодпись,
	|	Renault_Договор.ДилерПодписантДолжность,
	|	Renault_Договор.СоставДоговора.(
	|		Ссылка,
	|		НомерСтроки,
	|		Идентификатор,
	|		ЗаказВПроизводство,
	|		Автомобиль,
	|		VIN,
	|		ГодВыпуска,
	|		Модель,
	|		Версия,
	|		Цвет,
	|		ЖелаемаяДатаВыдачи,
	|		СоставОпций,
	|		ОбщаяСуммаПоАвтомобилю,
	|		СтоимостьБазовойКомплектации,
	|		СуммаДоставки,
	|		СуммаСкидки,
	|		СтоимостьДопОпций,
	|		СтоимостьОпцийДилера,
	|		РазницаССуммойПоДоговору,
	|		СуммаАвтомобиляИтого,
	|		СуммаОпцийИтого,
	|		СтоимостьУстановленногоОборудования,
	|		СтоимостьАвторабот,
	|		Модель.Артикул КАК КодМодели,
	|		Версия.Артикул КАК КодВерсии,
	|		Цвет.Артикул КАК КодЦвета,
	|		МаркаМодельПТС,
	|		ТипПТС,
	|		КатегорияПТС,
	|		ГодИзготовленияПТС,
	|		НомерДвигателяПТС,
	|		НомерШассиПТС,
	|		НомерКузоваПТС,
	|		ЦветКузоваПТС,
	|		МощностьДвигателяПТС,
	|		РабочийОбъемДвигателяПТС,
	|		ТипДвигателяПТС,
	|		ЭкологическийКлассДвигателяПТС,
	|		ПТС,
	|		ОрганизацияИзготовительПТС,
	|		ГарантияПТС,
	|		РазрешеннаяМаксимальнаяМассаПТС,
	|		МассаБезНагрузкиПТС,
	|		ОдобрениеТипаТСПТС,
	|		МодельДвигателяПТС,
	|		ДатаПТС,
	|		АдресИзготовителяПТС,
	|		ДатаВыдачи
	|	),
	|	Renault_Договор.ДопОпцииАвтомобилей.(
	|		Ссылка,
	|		НомерСтроки,
	|		Идентификатор,
	|		Опция,
	|		Цена,
	|		Код,
	|		Наименование
	|	),
	|	Renault_Договор.УстановленноеОборудование.(
	|		Ссылка,
	|		НомерСтроки,
	|		Идентификатор,
	|		Номенклатура,
	|		Цена,
	|		Количество,
	|		Сумма
	|	),
	|	Renault_Договор.ОборудованиеДляУстановки.(
	|		Ссылка,
	|		НомерСтроки,
	|		Идентификатор,
	|		Номенклатура,
	|		Цена,
	|		Количество,
	|		Сумма
	|	),
	|	Renault_Договор.СуммаДоговора - Renault_Договор.СуммаАванса КАК СуммаЗаВычетомАванса,
	|	Renault_Договор.Менеджер.Наименование КАК МенеджерФИО,
	|	Renault_Договор.ДатаАктаПередачи,
	|	Renault_ДополнительныеСвойстваОрганизации.БИН
	|ИЗ
	|	Документ.Renault_Договор КАК Renault_Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ДополнительныеСвойстваОрганизации КАК Renault_ДополнительныеСвойстваОрганизации
	|		ПО Renault_Договор.Организация = Renault_ДополнительныеСвойстваОрганизации.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
	|		ПО (CRM_СобытияПоРабочимЛистам.IDK = Renault_Договор.РабочийЛист)
	|			И (CRM_СобытияПоРабочимЛистам.ВидСобытия = ЗНАЧЕНИЕ(Справочник.CRM_ВидыСобытий.Выдача))
	|			И (CRM_СобытияПоРабочимЛистам.ЗавершеноУспешно = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (Контрагенты.Ссылка = Renault_Договор.КлиентДоговора)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_ПотенциальныеКонтрагенты КАК CRM_ПотенциальныеКонтрагенты
	|		ПО (CRM_ПотенциальныеКонтрагенты.Ссылка = Renault_Договор.КлиентДоговора)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|		ПО Renault_Договор.КлиентДоговора = ПодтверждающиеДокументы.Владелец
	|			И (ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Паспорт))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияТелефоны
	|		ПО Renault_Договор.КлиентДоговора = КонтактнаяИнформацияТелефоны.Объект
	|			И (КонтактнаяИнформацияТелефоны.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	|			И (КонтактнаяИнформацияТелефоны.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСотовый))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияАдресЮр
	|		ПО Renault_Договор.КлиентДоговора = КонтактнаяИнформацияАдресЮр.Объект
	|			И (КонтактнаяИнформацияАдресЮр.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформацияАдресЮр.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЮридический))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияАдресФакт
	|		ПО Renault_Договор.КлиентДоговора = КонтактнаяИнформацияАдресФакт.Объект
	|			И (КонтактнаяИнформацияАдресФакт.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформацияАдресФакт.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресФактический))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияEMail
	|		ПО Renault_Договор.КлиентДоговора = КонтактнаяИнформацияEMail.Объект
	|			И (КонтактнаяИнформацияАдресФакт.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	|			И (КонтактнаяИнформацияАдресФакт.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументыПодписанта
	|		ПО Renault_Договор.КлиентПодписант = ПодтверждающиеДокументыПодписанта.Владелец
	|			И (ПодтверждающиеДокументыПодписанта.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Доверенность))
	|ГДЕ
	|	Renault_Договор.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДоговорСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВалютаРубли = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
	Тариф = Renault_CRM.ПолучитьТекущийТарифНаАвтомобили(ДоговорСсылка.ДатаДоговора);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 5;
	ТабДокумент.ПолеСправа = 5;
	Если Выборка.Следующий() Тогда
		Если ТипМакета = "Договор" Тогда
			МакетДоговор = ПолучитьМакет("МакетДоговора");
			ОбластьШапки = МакетДоговор.ПолучитьОбласть("Шапка");
			ОбластьШапки.Параметры.Город = киПолучитьГород(Выборка.Организация, Справочники.ВидыКонтактнойИнформации.АдресФактический);
			ОбластьШапки.Параметры.НомерДоговора = Выборка.НомерДоговора;
			ОбластьШапки.Параметры.ДатаДоговора = Формат(Выборка.ДатаДоговора, "ДЛФ=ДД");
			ОбластьШапки.Параметры.НаименованиеОрганизации = Выборка.ДилерНаименованиеОрганизации;
			ОбластьШапки.Параметры.должность = Выборка.ДилерПодписантДолжность;
			ОбластьШапки.Параметры.ФИООтветственного = Выборка.ДилерПодписантВЛице;
			ОбластьШапки.Параметры.УставОрганизации  = Выборка.ДилерПодписантНаОсновании;
			ОбластьШапки.Параметры.НаименованиеПокупателя = Выборка.КлиентДоговораНаименование;
			// Подписант договора
			Если ЗначениеЗаполнено(Выборка.КлиентПодписантВЛице) Тогда
				КлиентПодписантПодпись = Выборка.КлиентПодписантВЛице.Фамилия + " " + Лев(Выборка.КлиентПодписантВЛице.Имя,1) + "."+Лев(Выборка.КлиентПодписантВЛице.Отчество,1)+"."; 
				ОбластьШапки.Параметры.ПодписантПодпис = КлиентПодписантПодпись;
				ОбластьШапки.Параметры.ПодписантДолжность = Выборка.КлиентПодписантВЛице.Должность;
			КонецЕсли; 
			ДокументОснование = Справочники.ПодтверждающиеДокументы.НайтиПоРеквизиту("ВидПодтверждающегоДокумента", Перечисления.ВидыДокументов.Доверенность,,Выборка.КлиентПодписантВЛице);
			Если ЗначениеЗаполнено(ДокументОснование) Тогда
				КлиентПодписантНаОсновании = "доверенности №"+ ДокументОснование.Номер + " от " + ДокументОснование.ДатаВыдачи;
			Иначе
				КлиентПодписантНаОсновании = "Устава";
			КонецЕсли;
			ОбластьШапки.Параметры.ПодписантНаОсновании = КлиентПодписантНаОсновании;
			
			ТабДокумент.Вывести(ОбластьШапки);
			ТЗСостав = Выборка.СоставДоговора.Выгрузить(); 
			ОбластьСтрокаАвто = МакетДоговор.ПолучитьОбласть("СтрокаАвтомобиль");
			Для Каждого СтрокаСостав из ТЗСостав Цикл
				ОбластьСтрокаАвто.Параметры.Заполнить(СтрокаСостав);
				ОбластьСтрокаАвто.Параметры.НомерПоПорядку = "1.1." + СтрокаСостав.НомерСтроки;
				ОбластьСтрокаАвто.Параметры.НомерПриложения = СтрокаСостав.НомерСтроки;
				ТабДокумент.Вывести(ОбластьСтрокаАвто);
			КонецЦикла;
			
			ОбластьШапка_2 = МакетДоговор.ПолучитьОбласть("Шапка_2");
			ОбластьШапка_2.Параметры.СуммаИтог = Выборка.СуммаДоговора;
			ОбластьШапка_2.Параметры.СуммаИтогПрописью =  обЧислоПрописью(Выборка.СуммаДоговора, ВалютаРубли);
			ОбластьШапка_2.Параметры.НДСИтого = ПолучитьНДС(Выборка.СуммаДоговора, СтавкаНДС);
			ТабДокумент.Вывести(ОбластьШапка_2);
			
			ОбластьСтоки_2 = МакетДоговор.ПолучитьОбласть("Строка_2");
			Для Каждого СтрокаСостав Из ТЗСостав Цикл
				ОбластьСтоки_2.Параметры.НомерПоПорядку = "2.1." + СтрокаСостав.НомерСтроки;
				ОбластьСтоки_2.Параметры.НомерПриложения = СтрокаСостав.НомерСтроки;
				ОбластьСтоки_2.Параметры.Стоимость = СтрокаСостав.ОбщаяСуммаПоАвтомобилю;
				ОбластьСтоки_2.Параметры.СтоимостьПрописью = обЧислоПрописью(СтрокаСостав.ОбщаяСуммаПоАвтомобилю, ВалютаРубли);
				ОбластьСтоки_2.Параметры.НДСИтог = ПолучитьНДС(СтрокаСостав.ОбщаяСуммаПоАвтомобилю, СтавкаНДС);
				ТабДокумент.Вывести(ОбластьСтоки_2);
			КонецЦикла;
			
			ОбластьПодвал = МакетДоговор.ПолучитьОбласть("Подвал");
			ОбластьПодвал.Параметры.СуммаАванс = Выборка.СуммаАванса;
			ОбластьПодвал.Параметры.СуммаАвансПрописью = обЧислоПрописью(Выборка.СуммаАванса, ВалютаРубли);
			ОбластьПодвал.Параметры.НДСАванс = ПолучитьНДС(Выборка.СуммаАванса, СтавкаНДС);
			ОбластьПодвал.Параметры.СуммаОстаток = Выборка.СуммаЗаВычетомАванса;
			ОбластьПодвал.Параметры.СуммаОстатокПрописью = обЧислоПрописью(Выборка.СуммаЗаВычетомАванса, ВалютаРубли);
			ОбластьПодвал.Параметры.НДСОстаток = ПолучитьНДС(Выборка.СуммаЗаВычетомАванса, СтавкаНДС);
			ОбластьПодвал.Параметры.АдресВыдачи = Выборка.ДилерАдресФактический;
			ТабДокумент.Вывести(ОбластьПодвал);
			
			ОбластьСтрПодвал = МакетДоговор.ПолучитьОбласть("СтрокаПодвал");
			ОбластьСтрПодвал.Параметры.Продавец = Выборка.ДилерНаименованиеОрганизации;
			ОбластьСтрПодвал.Параметры.Покупатель = Выборка.КлиентДоговораНаименование;
			ТабДокумент.Вывести(ОбластьСтрПодвал);
			ОбластьСтрПодвал.Параметры.Продавец = "Юридический адрес: " + Выборка.ДилерАдресЮридический;
			ОбластьСтрПодвал.Параметры.Покупатель = "Юридический адрес: " + Выборка.КлиентАдрес;
			ТабДокумент.Вывести(ОбластьСтрПодвал);
			ОбластьСтрПодвал.Параметры.Продавец = "ИНН: " + Выборка.ДилерИНН + " КПП: " + Выборка.ДилерКПП;
			ОбластьСтрПодвал.Параметры.Покупатель = "ИНН: " + Выборка.КлиентИНН + " КПП: " + Выборка.КлиентКПП;
			ТабДокумент.Вывести(ОбластьСтрПодвал);
			ОбластьСтрПодвал.Параметры.Продавец = "р/с: " + Выборка.ДилерСчет;
			ОбластьСтрПодвал.Параметры.Покупатель = "р/с: " + Выборка.КлиентСчет;
			ТабДокумент.Вывести(ОбластьСтрПодвал);
			ОбластьСтрПодвал.Параметры.Продавец = "в " + Выборка.ДилерБанк;
			ОбластьСтрПодвал.Параметры.Покупатель = "в " + Выборка.КлиентБанкСчета;
			ТабДокумент.Вывести(ОбластьСтрПодвал);
			ОбластьСтрПодвал.Параметры.Продавец = "БИК:" + Выборка.ДилерБИК;
			ОбластьСтрПодвал.Параметры.Покупатель = "БИК:" + Выборка.КлиентБИК;
			ТабДокумент.Вывести(ОбластьСтрПодвал);
			
			ОбластьПодпись = МакетДоговор.ПолучитьОбласть("Подписи");
			ТабДокумент.Вывести(ОбластьПодпись);
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			МакетПриложение = ПолучитьМакет("МакетПриложение");
			ОбластьШапки = МакетПриложение.ПолучитьОбласть("Шапка");
			ШапкаБазовые = МакетПриложение.ПолучитьОбласть("ШапкаБазовые");
			СтрокиБазовые = МакетПриложение.ПолучитьОбласть("БазовыеОпции");
			ШапкаДопОпции = МакетПриложение.ПолучитьОбласть("ШапкаДопОпции");
			СтрокиДопОпции = МакетПриложение.ПолучитьОбласть("ДопОпции");
			Подвал = МакетПриложение.ПолучитьОбласть("Подвал");
			
			Для Каждого СтрокаТЗ из ТЗСостав Цикл
				ОбластьШапки.Параметры.НомерПоПорыдку = СтрокаТЗ.НомерСтроки;
				ОбластьШапки.Параметры.НомерДоговора = Выборка.НомерДоговора;
				ОбластьШапки.Параметры.ДатаДоговора =  Формат(Выборка.ДатаДоговора,"ДЛФ=ДД");
				ОбластьШапки.Параметры.Модель = ?(ЗначениеЗаполнено(СтрокаТЗ.Модель), СтрокаТЗ.Модель.Наименование, "<Не указана>"); 
				ОбластьШапки.Параметры.Версия = ?(ЗначениеЗаполнено(СтрокаТЗ.Версия), СтрокаТЗ.Версия.Наименование, "<Не указана>"); 
				ОбластьШапки.Параметры.Цвет = ?(ЗначениеЗаполнено(СтрокаТЗ.Цвет), СтрокаТЗ.Цвет.Наименование, "<Не указан>"); 
				ДопИнформация = ПолучитьДопИнформациюПоВерсии (СтрокаТЗ.Версия);
				Если ДопИнформация <> Неопределено Тогда
					
					ОбластьШапки.Параметры.Объем = ?(ЗначениеЗаполнено(ДопИнформация.Объем), Строка(ДопИнформация.Объем) + " см3", "<Не указан>"); 
					Двигатель_КВТ = ?(ЗначениеЗаполнено(ДопИнформация.Двигатель_КВТ), Строка(ДопИнформация.Двигатель_КВТ), "<Не указана>");
					ДвигательЛС = ?(ЗначениеЗаполнено(ДопИнформация.ДвигательЛС), Строка(ДопИнформация.ДвигательЛС), "<Не указана>");
					ОбластьШапки.Параметры.Двигатель = ДвигательЛС + " (" + Двигатель_КВТ + ") л.с.(кВт)";
				КонецЕсли;
				ТабДокумент.Вывести(ОбластьШапки);
				БазовыеОпции = ПолучитьБазовыеОпции(СтрокаТЗ.Модель, СтрокаТЗ.Версия, Тариф);
				Если БазовыеОпции.Количество() > 0 Тогда
					ТабДокумент.Вывести(ШапкаБазовые);
					ЗаполнитьОпции (БазовыеОпции, СтрокиБазовые, ТабДокумент);
				КонецЕсли;
				ДопОпции = ПолучитьДопОпции(СтрокаТЗ.Идентификатор, СтрокаТЗ.Ссылка);
				Если ДопОпции.Количество() > 0 Тогда
					ТабДокумент.Вывести(ШапкаДопОпции);
					ЗаполнитьОпции (ДопОпции, СтрокиДопОпции, ТабДокумент);
				КонецЕсли;
				ТабДокумент.Вывести(Подвал);
			КонецЦикла;
			Макет = Новый Структура();
			Макет.Вставить("Тип",ВРег("mxl"));
			Макет.Вставить("ПечатнаяФорма",ТабДокумент);
			Renault_УправлениеПечатьюКлиент.ПоказатьДокумент(Макет);
		ИначеЕсли ТипМакета = "Акт" Тогда
			МакетАкт = ПолучитьМакет("МакетАкт");
			ОбластьШапки = МакетАкт.ПолучитьОбласть("Шапка");
			ОбластьШапки.Параметры.Город = киПолучитьГород(Выборка.Организация,Справочники.ВидыКонтактнойИнформации.АдресФактический);
			ОбластьШапки.Параметры.НомерДоговора = Выборка.НомерДоговора;
			ОбластьШапки.Параметры.ДатаДоговора =  Формат(Выборка.ДатаДоговора,"ДЛФ=ДД");
			ОбластьШапки.Параметры.НаименованиеОрганизации = Выборка.ДилерНаименованиеОрганизации;
			ОбластьШапки.Параметры.должность = Выборка.ДилерПодписантДолжность;
			ОбластьШапки.Параметры.ФИООтветственного = Выборка.ДилерПодписантВЛице;
			ОбластьШапки.Параметры.УставОрганизации = Выборка.ДилерПодписантНаОсновании;
			ОбластьШапки.Параметры.НаименованиеПокупателя = Выборка.КлиентДоговораНаименование;
			Если ЗначениеЗаполнено(Выборка.КлиентПодписантВЛице) Тогда
				КлиентПодписантПодпись = Выборка.КлиентПодписантВЛице.Фамилия + " " + Лев(Выборка.КлиентПодписантВЛице.Имя,1) + "."+Лев(Выборка.КлиентПодписантВЛице.Отчество,1)+"."; 
				ОбластьШапки.Параметры.ПодписантПодпис = КлиентПодписантПодпись;
				ОбластьШапки.Параметры.ПодписантДолжность = Выборка.КлиентПодписантВЛице.Должность;
			КонецЕсли; 
			ДокументОснование = Справочники.ПодтверждающиеДокументы.НайтиПоРеквизиту("ВидПодтверждающегоДокумента", Перечисления.ВидыДокументов.Доверенность,,Выборка.КлиентПодписантВЛице);
			Если ЗначениеЗаполнено(ДокументОснование) Тогда
				КлиентПодписантНаОсновании = "доверенности №"+ ДокументОснование.Номер + " от " + ДокументОснование.ДатаВыдачи;
			Иначе
				КлиентПодписантНаОсновании = "Устава";
			КонецЕсли;
			ОбластьШапки.Параметры.ПодписантНаОсновании = КлиентПодписантНаОсновании;
			
			ТабДокумент.Вывести(ОбластьШапки);
			ТЗСостав = Выборка.СоставДоговора.Выгрузить(); 
			ОбластьСтрокаАвто = МакетАкт.ПолучитьОбласть("СтрокаТовар");
			ШапкаТовар = МакетАкт.ПолучитьОбласть("ШапкаТовар");
			ТабДокумент.Вывести(ШапкаТовар);
			Для Каждого СтрокаСостав из ТЗСостав Цикл
				ОбластьСтрокаАвто.Параметры.Заполнить(СтрокаСостав);
				ОбластьСтрокаАвто.Параметры.Кол_во = "1";
				ОбластьСтрокаАвто.Параметры.Ед = "шт.";
				ТабДокумент.Вывести(ОбластьСтрокаАвто);
			КонецЦикла;
			ОбластьПодвалТовара = МакетАкт.ПолучитьОбласть("ПодвалТовар");
			ОбластьПодвалТовара.Параметры.Итого = Выборка.СуммаДоговора;
			ОбластьПодвалТовара.Параметры.ИтогНДС = ПолучитьНДС(Выборка.СуммаДоговора, СтавкаНДС);
			ТабДокумент.Вывести(ОбластьПодвалТовара);
			
			ОбластьПТС = МакетАкт.ПолучитьОбласть("СтрокаАвтомобиль");
			Для Каждого СтрокаСостав из ТЗСостав Цикл
				ОбластьПТС.Параметры.Заполнить(СтрокаСостав);
				ТабДокумент.Вывести(ОбластьПТС);
			КонецЦикла;
			
			ШапкаБазовые = МакетАкт.ПолучитьОбласть("ШапкаБазовые");
			СтрокиБазовые = МакетАкт.ПолучитьОбласть("БазовыеОпции");
			ШапкаДопОпции = МакетАкт.ПолучитьОбласть("ШапкаДопОпции");
			СтрокиДопОпции = МакетАкт.ПолучитьОбласть("ДопОпции");
			Подвал = МакетАкт.ПолучитьОбласть("Подвал");
			Для Каждого СтрокаТЗ из ТЗСостав Цикл
				БазовыеОпции = ПолучитьБазовыеОпции(СтрокаТЗ.Модель, СтрокаТЗ.Версия, Тариф);
				Если БазовыеОпции.Количество() > 0 Тогда
					ШапкаБазовые.Параметры.VIN = СтрокаТЗ.VIN;
					ТабДокумент.Вывести(ШапкаБазовые);
					ЗаполнитьОпции (БазовыеОпции, СтрокиБазовые, ТабДокумент);
				КонецЕсли;
				ДопОпции = ПолучитьДопОпции(СтрокаТЗ.Идентификатор, СтрокаТЗ.Ссылка);
				Если ДопОпции.Количество() > 0 Тогда
					ТабДокумент.Вывести(ШапкаДопОпции);
					ЗаполнитьОпции (ДопОпции, СтрокиДопОпции, ТабДокумент);
				КонецЕсли;
			КонецЦикла; 
			Подвал.Параметры.НомерДоговора = Выборка.НомерДоговора;
			Подвал.Параметры.ДатаДоговора =  Формат(Выборка.ДатаДоговора,"ДЛФ=ДД");
			ТабДокумент.Вывести(Подвал);
			Макет = Новый Структура();
			Макет.Вставить("Тип",ВРег("mxl"));
			Макет.Вставить("ПечатнаяФорма",ТабДокумент);
			Renault_УправлениеПечатьюКлиент.ПоказатьДокумент(Макет);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
#КонецЕсли

Процедура ЗаполнитьОпции(БазовыеОпции, Обл, ТабДокумент)
	
	Если НЕ БазовыеОпции = Неопределено Тогда
		ВсегоБазовыхОпций = БазовыеОпции.Количество();
	Иначе
		ВсегоБазовыхОпций = 0;
	КонецЕсли;
	
	Номер = 0;
	
	Влезает = 50;
	Индекс = 0;
	СледующуюСтрокуПропускаем = Ложь;
	
	Пока Индекс <> БазовыеОпции.Количество() Цикл
		
		СтрокаЭлемента = БазовыеОпции[Индекс];
		ДлинаСтроки = СтрДлина(СтрокаЭлемента);
		
		Если ДлинаСтроки > Влезает Тогда
			
			//Нужно делить строку
			
			//Ищем пробел с конца строки
			НайденныйСимвол = "";
			Инд1 = ДлинаСтроки - Влезает; //индекс пробела по которому делим строки
			Пока НайденныйСимвол <> " " Цикл
				НайденныйСимвол = Сред(СтрокаЭлемента, СтрДлина(СтрокаЭлемента)- Инд1, 1);
				Инд1 = Инд1 + 1;
			КонецЦикла;
			
			//Получим левую часть и запишем ее в массив
			
			ЛеваяЧасть = "- " + СокрЛП(Лев(СтрокаЭлемента, ДлинаСтроки - Инд1));
			БазовыеОпции[Индекс] = ЛеваяЧасть;
			
			//Получим правую часть и запишем ее в массив
			
			ПраваяЧасть = " " + СокрЛП(Сред(СтрокаЭлемента, СтрДлина(СтрокаЭлемента) - Инд1 + 1));
			БазовыеОпции.Вставить(Индекс+1, "  " + ПраваяЧасть);
			СледующуюСтрокуПропускаем = Истина;
			
		Иначе
			
			Если СледующуюСтрокуПропускаем Тогда
				СледующуюСтрокуПропускаем = Ложь; //Эта строка - права часть предыдущей строки
			Иначе
				БазовыеОпции[Индекс] = "- " + БазовыеОпции[Индекс];
			КонецЕсли;
			
		КонецЕсли;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	//разделим опции на 2 массива
	ПервыйМассив = Новый Массив;
	ВторойМассив = Новый Массив;
	Для Индекс = 0 По БазовыеОпции.Количество() - 1 Цикл
		Если Индекс < Окр((БазовыеОпции.Количество()) / 2) Тогда
			ПервыйМассив.Добавить(БазовыеОпции[Индекс]);
		Иначе
			ВторойМассив.Добавить(БазовыеОпции[Индекс]);
		КонецЕсли;
	КонецЦикла;
	
	Если ПервыйМассив.Количество() >= ВторойМассив.Количество() Тогда
		БольшийИндекс = ПервыйМассив.Количество();
	Иначе
		БольшийИндекс = ВторойМассив.Количество();
	КонецЕсли;
	
	Для Индекс = 0 По БольшийИндекс-1 Цикл
		
		Если Индекс+1 <= ПервыйМассив.Количество() Тогда
			Обл.Параметры.Опция1 = ПервыйМассив[Индекс];
		Иначе
			Обл.Параметры.Опция1 = "";
		КонецЕсли;
		
		Если Индекс+1 <= ВторойМассив.Количество() Тогда
			Обл.Параметры.Опция2 = ВторойМассив[Индекс];
		Иначе
			Обл.Параметры.Опция2 = "";
		КонецЕсли;
		
		ТабДокумент.Вывести(Обл);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДопОпции(Идентификатор, Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Renault_ДоговорДопОпцииАвтомобилей.Наименование КАК НаименованиеОпции
	|ИЗ
	|	Документ.Renault_Договор.ДопОпцииАвтомобилей КАК Renault_ДоговорДопОпцииАвтомобилей
	|ГДЕ
	|	Renault_ДоговорДопОпцииАвтомобилей.Ссылка = &Ссылка
	|	И Renault_ДоговорДопОпцииАвтомобилей.Идентификатор = &Идентификатор";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Новый ТаблицаЗначений;
	Иначе
		Возврат Результат.Выгрузить().ВыгрузитьКолонку("НаименованиеОпции");
	КонецЕсли;
	
КонецФункции

Функция ПолучитьБазовыеОпции(Модель, ВариантКомплектации, Тариф)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Renault_ТарифНаОпцииАвтомобилей.НаименованиеОпции КАК НаименованиеОпции
	|ИЗ
	|	РегистрСведений.Renault_ТарифНаОпцииАвтомобилей.СрезПоследних(
	|			,
	|			Тариф = &Тариф
	|				И Модель = &Модель
	|				И ВариантКомплектации = &ВариантКомплектации
	|				И Базовая = ИСТИНА) КАК Renault_ТарифНаОпцииАвтомобилей";
	
	Запрос.УстановитьПараметр("Модель", Модель);
	Запрос.УстановитьПараметр("ВариантКомплектации", ВариантКомплектации);
	Запрос.УстановитьПараметр("Тариф", Тариф);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Новый ТаблицаЗначений;
	Иначе
		Возврат Результат.Выгрузить().ВыгрузитьКолонку("НаименованиеОпции");
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДопИнформациюПоВерсии(Версия)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ДопИнформацияПоВерсиям.ОбъемДвигателя КАК Объем,
	|	Renault_ДопИнформацияПоВерсиям.МощностьЛС КАК ДвигательЛС,
	|	Renault_ДопИнформацияПоВерсиям.МощностьКВТ КАК Двигатель_КВТ
	|ИЗ
	|	РегистрСведений.Renault_ДопИнформацияПоВерсиям КАК Renault_ДопИнформацияПоВерсиям
	|ГДЕ
	|	Renault_ДопИнформацияПоВерсиям.ВариантКомплектации = &ВариантКомплектации";
	Запрос.УстановитьПараметр("ВариантКомплектации", Версия);
	Выборка = Запрос.Выполнить();
	Если Выборка.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Результат = Выборка.Выбрать();
		Результат.Следующий();
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьНДС(Знач тСумма, СтавкаНДС)
	
	Если ЗначениеЗаполнено(СтавкаНДС) Тогда 
		ПроцентНДС = СтавкаНДС.Ставка / 100;
	Иначе
		ПроцентНДС = 0;
	КонецЕсли;
	
	тСуммаНДС = тСумма - тСумма / (1 + ПроцентНДС);
	
	Если тСуммаНДС <> 0 Тогда
		тСуммаНДС = Окр(тСуммаНДС, 2);
	КонецЕсли;
	
	Возврат тСуммаНДС;
	
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Renault_ЗаконтрактованныеАвтомобили.Записывать = Истина;
	Движения.Renault_ЗаконтрактованныеАвтомобили.Очистить();
	
	Движения.Renault_ПроданныеАвтомобили.Записывать = Истина;
	Движения.Renault_ПроданныеАвтомобили.Очистить();
	
	Движения.Renault_АвтомобилиКВыдаче.Записывать = Истина;
	Движения.Renault_АвтомобилиКВыдаче.Очистить();
	
	Движения.Renault_ЗаказыВПроизводствоПодКлиентов.Записывать = Истина;
	Движения.Renault_ЗаказыВПроизводствоПодКлиентов.Очистить();
	
	Движения.Renault_ВзаиморасчетыПоДоговорам.Записывать = Истина;
	Движения.Renault_ВзаиморасчетыПоДоговорам.Очистить();
	
	Движения.Renault_ФактВыполненияЭтаповПланирования.Записывать = Истина;
	Движения.Renault_ФактВыполненияЭтаповПланирования.Очистить();
	
	Для Каждого ТекСтрокаСоставДоговора Из СоставДоговора Цикл
		
		Автомобиль = ТекСтрокаСоставДоговора.Автомобиль;
		ЕстьРезерв = Ложь;
		
		СтатусРезерва = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан;
		
		Если (СтатусПредварительныхДокументов = СтатусРезерва ИЛИ СтатусОкончательныхДокументов = СтатусРезерва)
				И Не СтатусДоговора = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Расторгнут Тогда
			ЕстьРезерв = Истина;
		КонецЕсли;
		
		Если ПометкаУдаления ИЛИ Не ЗначениеЗаполнено(Автомобиль) Тогда
			ЕстьРезерв = Ложь;
		КонецЕсли;
		
		Если ЕстьРезерв Тогда
			
			//Проверим возможность записи
			//1) Наличие других контрактов
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	Renault_ЗаконтрактованныеАвтомобили.Период,
			               |	Renault_ЗаконтрактованныеАвтомобили.VIN,
			               |	Renault_ЗаконтрактованныеАвтомобили.Автомобиль,
			               |	Renault_ЗаконтрактованныеАвтомобили.РабочийЛист,
			               |	Renault_ЗаконтрактованныеАвтомобили.Регистратор,
						   |    Renault_ЗаконтрактованныеАвтомобили.ДатаСнятияРезерва
			               |ИЗ
			               |	РегистрСведений.Renault_ЗаконтрактованныеАвтомобили КАК Renault_ЗаконтрактованныеАвтомобили
			               |ГДЕ
			               |	Renault_ЗаконтрактованныеАвтомобили.Автомобиль = &Автомобиль
			               |	И Renault_ЗаконтрактованныеАвтомобили.Регистратор <> &Регистратор";
			
			Запрос.УстановитьПараметр("Регистратор", Ссылка);
			Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
			Выборка = Запрос.Выполнить().Выбрать();
			
			ПараметрыЗаписи = Новый Структура;
			ПараметрыЗаписи.Вставить("Период",      Дата);
			ПараметрыЗаписи.Вставить("Регистратор", Ссылка);
			
			ПараметрыЗаписи.Вставить("РабочийЛист",                     РабочийЛист);
			ПараметрыЗаписи.Вставить("Клиент",                          КлиентДоговора);
			ПараметрыЗаписи.Вставить("ДатаДоговора",                    ДатаДоговора);
			ПараметрыЗаписи.Вставить("НомерДоговора",                   НомерДоговора);
			ПараметрыЗаписи.Вставить("СтатусПредварительныхДокументов", СтатусПредварительныхДокументов);
			ПараметрыЗаписи.Вставить("СтатусОкончательныхДокументов",   СтатусОкончательныхДокументов);
			ПараметрыЗаписи.Вставить("СтатусДоговора",                  СтатусДоговора);
			ПараметрыЗаписи.Вставить("СуммаАванса",                     СуммаАванса);
			ПараметрыЗаписи.Вставить("СуммаДоговора",                   СуммаДоговора);
			ПараметрыЗаписи.Вставить("Менеджер",                        Менеджер);
			
			ПараметрыЗаписи.Вставить("VIN",                         ТекСтрокаСоставДоговора.VIN);
			ПараметрыЗаписи.Вставить("Автомобиль",                  ТекСтрокаСоставДоговора.Автомобиль);
			ПараметрыЗаписи.Вставить("ОбщаяСуммаПоАвтомобилю",      ТекСтрокаСоставДоговора.ОбщаяСуммаПоАвтомобилю);
			ПараметрыЗаписи.Вставить("ЖелаемаяДатаВыдачи",          ТекСтрокаСоставДоговора.ЖелаемаяДатаВыдачи);
			ПараметрыЗаписи.Вставить("ИдентификаторСтрокиДоговора", ТекСтрокаСоставДоговора.Идентификатор);
			
			Если Выборка.Следующий() Тогда
				Если Выборка.ДатаСнятияРезерва = Дата(1,1,1) Тогда
					Отказ = Истина;
					#Если НаКлиенте Тогда
						Сообщить("Автомобиль законтрактован под другого клиента - рабочий лист №" + Строка(Выборка.РабочийЛист)+" VIN: "+Автомобиль.VIN);
					#КонецЕсли
					Возврат;
				Иначе
					ВыполнитьДвиженияПоРегиструЗаконтрактованныеАвто(ПараметрыЗаписи,Дата(1,1,1)); 
				КонецЕсли;
			Иначе
				ВыполнитьДвиженияПоРегиструЗаконтрактованныеАвто(ПараметрыЗаписи,Дата(1,1,1)); 
			КонецЕсли;
			
			//2) Наличие отметки "не для продажи"
			ЗаписьДопИнфо = РегистрыСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям.СоздатьМенеджерЗаписи();
			ЗаписьДопИнфо.Автомобиль = Автомобиль;
			ЗаписьДопИнфо.Прочитать();
			Если ЗаписьДопИнфо.Выбран() И ЗаписьДопИнфо.НеДляПродажи = Истина Тогда
				Отказ = Истина;
				#Если НаКлиенте Тогда
					Сообщить("Автомобиль отмечен руководителем как недоступный для продажи. VIN: " +Автомобиль.VIN);
				#КонецЕсли
				Возврат;
			КонецЕсли;
			
			//3) Наличие утвержденного резерва под другой рабочий лист
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	Renault_УтвержденныеРезервы.Регистратор,
			               |	Renault_УтвержденныеРезервы.НомерСтроки,
			               |	Renault_УтвержденныеРезервы.Активность,
			               |	Renault_УтвержденныеРезервы.VIN,
			               |	Renault_УтвержденныеРезервы.Автомобиль,
			               |	Renault_УтвержденныеРезервы.Менеджер,
			               |	Renault_УтвержденныеРезервы.Комментарий,
			               |	Renault_УтвержденныеРезервы.Автор,
			               |	Renault_УтвержденныеРезервы.Контролер,
			               |	Renault_УтвержденныеРезервы.РабочийЛист,
			               |	Renault_УтвержденныеРезервы.SedreNum,
			               |	Renault_УтвержденныеРезервы.Клиент
			               |ИЗ
			               |	РегистрСведений.Renault_УтвержденныеРезервы КАК Renault_УтвержденныеРезервы
			               |ГДЕ
			               |	Renault_УтвержденныеРезервы.Автомобиль = &Автомобиль
			               |	И Renault_УтвержденныеРезервы.РабочийЛист <> &РабочийЛист";
			Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
			Запрос.УстановитьПараметр("РабочийЛист", РабочийЛист);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				
				#Если НаКлиенте Тогда
					ЕстьПравоАдминистрированияАвтосклад = Renault_РаботаСПравамиПользователя.ЕстьПравоАдминистрированияАрмАвтосклад(ПараметрыСеанса.Пользователь); 
					Если ЕстьПравоАдминистрированияАвтосклад Тогда
						Режим = РежимДиалогаВопрос.ДаНет;
						Текст = "Автомобиль зарезервирован под другого клиента - рабочий лист №. Отменить резерв?";
						Ответ = Вопрос(Текст, Режим, 0);
						Если Ответ = КодВозвратаДиалога.Нет Тогда
							Отказ = Истина;
							Возврат;
						Иначе
							//Снимем резерв
							ДокОбъект = Выборка.Регистратор.ПолучитьОбъект();
							ДокОбъект.СтатусРезерва = Перечисления.CRM_СтатусыРезервовАвтомобилей.РезервСнят;
							ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
						КонецЕсли;
					Иначе
						Отказ = Истина;
						Сообщить("Автомобиль зарезервирован под клиента " + Строка(Выборка.Клиент) + " менеджером " + Строка(Выборка.Менеджер));
						Возврат;
					КонецЕсли;
				#КонецЕсли
				Возврат;
				
			КонецЕсли;
			
			//Если ограничений нет - можно проводить
			
			// регистр Renault_ЗаконтрактованныеАвтомобили
			//Движение = Движения.Renault_ЗаконтрактованныеАвтомобили.Добавить();
			//Движение.Период = Дата;
			//Движение.VIN = ТекСтрокаСоставДоговора.VIN;
			//Движение.Автомобиль = ТекСтрокаСоставДоговора.Автомобиль;
			//Движение.РабочийЛист = РабочийЛист;
			//Движение.Клиент = РабочийЛист;
			//Движение.ДатаДоговора = ДатаДоговора;
			//Движение.НомерДоговора = НомерДоговора;
			//Движение.ЖелаемаяДатаВыдачи = ТекСтрокаСоставДоговора.ЖелаемаяДатаВыдачи;
			//Движение.СтатусПредварительныхДокументов = СтатусПредварительныхДокументов;
			//Движение.СтатусОкончательныхДокументов = СтатусОкончательныхДокументов;
			//Движение.СтатусДоговора = СтатусДоговора;
			//Движение.ОбщаяСуммаПоАвтомобилю = ТекСтрокаСоставДоговора.ОбщаяСуммаПоАвтомобилю;
			//Движение.СуммаАванса = СуммаАванса;
			//Движение.СуммаДоговора = СуммаДоговора;
			//Движение.ИдентификаторСтрокиДоговора = ТекСтрокаСоставДоговора.Идентификатор;
			//Движение.Менеджер = Менеджер;
			//Движение.Клиент = КлиентДоговора;
			//Движение.ПокупкаВКредит = ТекСтрокаСоставДоговора.ПокупкаВКредит;
			
			//Renault_ПроданныеАвтомобили
			Если СтатусОкончательныхДокументов = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан Тогда
				Движение = Движения.Renault_ПроданныеАвтомобили.Добавить();
				Движение.Период = Дата;
				Движение.VIN = ТекСтрокаСоставДоговора.VIN;
				Движение.Автомобиль = ТекСтрокаСоставДоговора.Автомобиль;
				Движение.РабочийЛист = РабочийЛист;
				Движение.ДатаДоговора = ДатаДоговора;
				Движение.НомерДоговора = НомерДоговора;
				Движение.ЖелаемаяДатаВыдачи = ТекСтрокаСоставДоговора.ЖелаемаяДатаВыдачи;
				Движение.СтатусПредварительныхДокументов = СтатусПредварительныхДокументов;
				Движение.СтатусОкончательныхДокументов = СтатусОкончательныхДокументов;
				Движение.СтатусДоговора = СтатусДоговора;
				Движение.ОбщаяСуммаПоАвтомобилю = ТекСтрокаСоставДоговора.ОбщаяСуммаПоАвтомобилю;
				Движение.СуммаАванса = СуммаАванса;
				Движение.СуммаДоговора = СуммаДоговора;
				Движение.ИдентификаторСтрокиДоговора = ТекСтрокаСоставДоговора.Идентификатор;
				Движение.Менеджер = Менеджер;
				Движение.Клиент = КлиентДоговора;
			КонецЕсли;
			
			//Если провели - нужно снять резервы (резервирование автомобилей)
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	Renault_УтвержденныеРезервы.Регистратор
			               |ИЗ
			               |	РегистрСведений.Renault_УтвержденныеРезервы КАК Renault_УтвержденныеРезервы
			               |ГДЕ
			               |	Renault_УтвержденныеРезервы.Автомобиль = &Автомобиль
			               |	И Renault_УтвержденныеРезервы.РабочийЛист = &РабочийЛист";
			Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
			Запрос.УстановитьПараметр("РабочийЛист", РабочийЛист);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				ДокРезервОбъект = Выборка.Регистратор.ПолучитьОбъект();
				ДокРезервОбъект.СтатусРезерва = Перечисления.CRM_СтатусыРезервовАвтомобилей.РезервСнят;
				ДокРезервОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЦикла;
		
		КонецЕсли;
		
		// регистр Renault_АвтомобилиКВыдаче Приход
		
		Если СтатусДоговора = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан Тогда
			
			Движение = Движения.Renault_АвтомобилиКВыдаче.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.РабочийЛист = РабочийЛист;
			Движение.Автомобиль = ТекСтрокаСоставДоговора.Автомобиль;
			Движение.VIN = ТекСтрокаСоставДоговора.VIN;
			Движение.Количество = 1;
			
		КонецЕсли;
		
		//Регистр заказы в производство
		
		ЕстьЗаказВПроизводство = Ложь;
		Если ТекСтрокаСоставДоговора.ЗаказВПроизводство И Не ЗначениеЗаполнено(ТекСтрокаСоставДоговора.Автомобиль) И
				(СтатусОкончательныхДокументов = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан ИЛИ СтатусПредварительныхДокументов = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан)
				И СтатусДоговора <> Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Расторгнут
				Тогда
			ЕстьЗаказВПроизводство = Истина;
		КонецЕсли;
		
		Если ЕстьЗаказВПроизводство Тогда
			
			Движение = Движения.Renault_ЗаказыВПроизводствоПодКлиентов.Добавить();
			Движение.РабочийЛист = РабочийЛист;
			Движение.Договор = Ссылка;
			Движение.Модель = ТекСтрокаСоставДоговора.Модель;
			Движение.Версия = ТекСтрокаСоставДоговора.Версия;
			Движение.Цвет = ТекСтрокаСоставДоговора.Цвет;
			Движение.ИдентификаторСтрокиДоговора = ТекСтрокаСоставДоговора.Идентификатор;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если СтатусДоговора <> Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Черновик И
			СтатусДоговора <> Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Расторгнут Тогда
			
		Движение = Движения.Renault_ВзаиморасчетыПоДоговорам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Договор = Ссылка;
		Движение.Период = ДатаДоговора;
		Движение.Сумма = СуммаДоговора;
		
	КонецЕсли;
	
	//Причина изменения
	Если ЗначениеЗаполнено(ПричинаИзменения) Тогда
		
		Запись = РегистрыСведений.Renault_ВнесениеИзмененийВДоговор.СоздатьМенеджерЗаписи();
		Запись.Период = ДатаИзменения;
		Запись.Договор = Ссылка;
		Запись.Прочитать();
		
		Если Не Запись.Выбран() Тогда
			
			Запись.Период = ДатаИзменения;
			Запись.Договор = Ссылка;
			Запись.ПричинаИзменения = ПричинаИзменения;
			Запись.КомментарийИзменения = КомментарийИзменения;
			Запись.АвторИзменения = АвторИзменения;
			Запись.ИзмененияПеренесеныВDistri = Ложь;
			Запись.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Заявки Distri
	Для Каждого Строка Из СоставДоговора Цикл
		Если ЗначениеЗаполнено(Строка.Автомобиль) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	Renault_ИнформацияПоЗаявкамDistri.Автомобиль,
			               |	Renault_ИнформацияПоЗаявкамDistri.ИдентификаторСтрокиДоговора,
			               |	Renault_ИнформацияПоЗаявкамDistri.НомерКлиентскойЗаявки,
			               |	Renault_ИнформацияПоЗаявкамDistri.ПродажаВнесена,
			               |	Renault_ИнформацияПоЗаявкамDistri.НомерОрдера
			               |ИЗ
			               |	РегистрСведений.Renault_ИнформацияПоЗаявкамDistri КАК Renault_ИнформацияПоЗаявкамDistri
			               |ГДЕ
			               |	Renault_ИнформацияПоЗаявкамDistri.ИдентификаторСтрокиДоговора = &ИдентификаторСтрокиДоговора";
			Запрос.УстановитьПараметр("ИдентификаторСтрокиДоговора", Строка.Идентификатор);
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				
				Запись = РегистрыСведений.Renault_ИнформацияПоЗаявкамDistri.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
				Запись.Прочитать();
				Запись.Автомобиль = Строка.Автомобиль;
				Запись.Записать();
				
			Иначе 
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	Renault_ИнформацияПоЗаявкамDistri.Автомобиль,
				               |	Renault_ИнформацияПоЗаявкамDistri.ИдентификаторСтрокиДоговора,
				               |	Renault_ИнформацияПоЗаявкамDistri.НомерКлиентскойЗаявки,
				               |	Renault_ИнформацияПоЗаявкамDistri.ПродажаВнесена,
				               |	Renault_ИнформацияПоЗаявкамDistri.НомерОрдера
				               |ИЗ
				               |	РегистрСведений.Renault_ИнформацияПоЗаявкамDistri КАК Renault_ИнформацияПоЗаявкамDistri
				               |ГДЕ
				               |	Renault_ИнформацияПоЗаявкамDistri.Автомобиль = &Автомобиль";
				Запрос.УстановитьПараметр("Автомобиль", Строка.Автомобиль);
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					Запись = РегистрыСведений.Renault_ИнформацияПоЗаявкамDistri.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(Запись, Выборка);
					Запись.Автомобиль = Строка.Автомобиль;
					Запись.ИдентификаторСтрокиДоговора = Строка.Идентификатор;
					Запись.Записать();
					
					Если ЗначениеЗаполнено(Строка.Идентификатор) Тогда
						Запись = РегистрыСведений.Renault_ИнформацияПоЗаявкамDistri.СоздатьМенеджерЗаписи();
						Запись.Автомобиль = Строка.Автомобиль;
						Запись.ИдентификаторСтрокиДоговора = "";
						Запись.Удалить();
					КонецЕсли;
					
				Иначе
					Запись = РегистрыСведений.Renault_ИнформацияПоЗаявкамDistri.СоздатьМенеджерЗаписи();
					Запись.Автомобиль = Строка.Автомобиль;
					Запись.ИдентификаторСтрокиДоговора = Строка.Идентификатор;
					Запись.Записать();
				КонецЕсли;
				
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Renault_ИнформацияПоЗаявкамDistri.Автомобиль,
				|	Renault_ИнформацияПоЗаявкамDistri.ИдентификаторСтрокиДоговора
				|ИЗ
				|	РегистрСведений.Renault_ИнформацияПоЗаявкамDistri КАК Renault_ИнформацияПоЗаявкамDistri
				|ГДЕ
				|	Renault_ИнформацияПоЗаявкамDistri.Автомобиль = &Автомобиль
				|	И Renault_ИнформацияПоЗаявкамDistri.ИдентификаторСтрокиДоговора <> &ИдентификаторСтрокиДоговора";
			Запрос.УстановитьПараметр("Автомобиль", Строка.Автомобиль);
			Запрос.УстановитьПараметр("ИдентификаторСтрокиДоговора", Строка.Идентификатор);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Запись = РегистрыСведений.Renault_ИнформацияПоЗаявкамDistri.СоздатьМенеджерЗаписи();
				Запись.Автомобиль = Выборка.Автомобиль;
				Запись.ИдентификаторСтрокиДоговора = Выборка.ИдентификаторСтрокиДоговора;
				Запись.Удалить();
			КонецЦикла;
		Иначе
			Запись = РегистрыСведений.Renault_ИнформацияПоЗаявкамDistri.СоздатьМенеджерЗаписи();
			Запись.ИдентификаторСтрокиДоговора = Строка.Идентификатор;
			Запись.Записать();
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьВоронкуПродаж();
	
	//v+ Renault_РекомендуемоеДопОборудованияКУстановке
	Движения.Renault_РекомендуемоеДопОборудованияКУстановке.Записывать = Истина;
	Движения.Renault_РекомендуемоеДопОборудованияКУстановке.Очистить();
	Если СтатусДоговора = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан Тогда
		Для Каждого Состав Из СоставДоговора Цикл
			Запрос=Новый Запрос;
			Запрос.УстановитьПараметр("ДилерскийЦентр",ДилерскийЦентр);
			Запрос.УстановитьПараметр("Модель",Состав.Модель);
			Запрос.УстановитьПараметр("Версия",Состав.Версия);
			Запрос.УстановитьПараметр("ТекущаяДата",ДатаДоговора);
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			Запрос.УстановитьПараметр("Идентификатор",Состав.Идентификатор);
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОбязательноеДО.ДопОборудование,
			|	ОбязательноеДО.Количество - ЕСТЬNULL(Договор.Количество, 0) КАК Количество
			|ИЗ
			|	РегистрСведений.Renault_ОбязательноеДопОборудования КАК ОбязательноеДО
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_Договор.ОборудованиеДляУстановки КАК Договор
			|		ПО (Договор.Ссылка = &Ссылка)
			|			И (Договор.Идентификатор = &Идентификатор)
			|			И ОбязательноеДО.ДопОборудование = Договор.Номенклатура
			|ГДЕ
			|	ОбязательноеДО.ДилерскийЦентр = &ДилерскийЦентр
			|	И ОбязательноеДО.Модель = &Модель
			|	И ОбязательноеДО.Версия = &Версия
			|	И ОбязательноеДО.ПериодНачало <= &ТекущаяДата
			|	И ВЫБОР
			|			КОГДА ОбязательноеДО.ПериодОкончание = ДАТАВРЕМЯ(1, 1, 1)
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ОбязательноеДО.ПериодОкончание >= &ТекущаяДата
			|		КОНЕЦ
			|	И ОбязательноеДО.Количество - ЕСТЬNULL(Договор.Количество, 0) > 0";
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Движение=Движения.Renault_РекомендуемоеДопОборудованияКУстановке.Добавить();
				Движение.Автомобиль = Состав.Автомобиль;
				Движение.ДопОборудование = Выборка.ДопОборудование;
				Движение.Количество = Выборка.Количество;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	//v-
	
КонецПроцедуры

Процедура ВыполнитьДвиженияПоРегиструЗаконтрактованныеАвто(ПараметрыЗаписи,ДатаСнятияРезерва)
	
	ДвижениеА = Движения.Renault_ЗаконтрактованныеАвтомобили.Добавить();
	ЗаполнитьЗначенияСвойств(ДвижениеА, ПараметрыЗаписи);
	ДвижениеА.ДатаСнятияРезерва = ДатаСнятияРезерва;
	
КонецПроцедуры

Процедура ОбновитьВоронкуПродаж()
	
	ЕстьВоронкаАванс = Ложь;
	ЕстьВоронкаДКП = Ложь;
	ЕстьВоронкаРасторжение = Ложь;
	
	Renault_CRM.Воронка_ПредварительныйКонтракт_Снять(РабочийЛист, Ссылка);
	Renault_CRM.Воронка_ДКП_Снять(РабочийЛист, Ссылка);
	Renault_CRM.Воронка_РасторжениеДКП_Снять(РабочийЛист, Ссылка);
	Renault_CRM.Статистика_Снять(Справочники.CRM_ЭтапыПродаж.Контракт, РабочийЛист, Ссылка);
	Renault_CRM.Статистика_Снять(Справочники.CRM_ЭтапыПродаж.ДКП, РабочийЛист, Ссылка);
	Renault_CRM.Статистика_Снять(Справочники.CRM_ЭтапыПродаж.РасторжениеДКП, РабочийЛист, Ссылка);
	
	Если СтатусПредварительныхДокументов = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан ИЛИ
			СтатусОкончательныхДокументов = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан Тогда
		ЕстьВоронкаАванс = Истина;
	КонецЕсли;
	
	Если СтатусОкончательныхДокументов = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан Тогда
		ЕстьВоронкаДКП = Истина;
	КонецЕсли;
	
	Если СтатусДоговора = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Расторгнут Тогда
		ЕстьВоронкаРасторжение = Истина;
	КонецЕсли;
	
	Для каждого СтрСостав из СоставДоговора Цикл
		
		Если ЕстьВоронкаАванс Тогда
			Renault_CRM.Воронка_ПредварительныйКонтракт_Установить(РабочийЛист, Ссылка, ДатаДоговора);
			Renault_CRM.Статистика_Установить(Справочники.CRM_ЭтапыПродаж.Контракт, РабочийЛист, Ссылка,, ДатаДоговора, СтрСостав.Модель);
			ДобавитьДвиженияФактаПродаж("Аванс");
		КонецЕсли;
		
		Если ЕстьВоронкаДКП Тогда
			Renault_CRM.Воронка_ДКП_Установить(РабочийЛист, Ссылка, ДатаДоговора);
			Renault_CRM.Статистика_Установить(Справочники.CRM_ЭтапыПродаж.ДКП, РабочийЛист, Ссылка,, ДатаДоговора, СтрСостав.Модель);
			ДобавитьДвиженияФактаПродаж("ДКП");
		КонецЕсли;
		
		
		Если ЕстьВоронкаРасторжение Тогда
			Renault_CRM.Воронка_РасторжениеДКП_Установить(РабочийЛист, Ссылка, ТекущаяДата()); //Сергеев В.Н. DMSREN-878 Изменил проставляемую дату в договоре			
			Renault_CRM.Статистика_Установить(Справочники.CRM_ЭтапыПродаж.РасторжениеДКП, РабочийЛист, Ссылка,, ДатаДоговора, СтрСостав.Модель);
		КонецЕсли;
		Если СтрСостав.ПокупкаВКредит Тогда
			Если ЕстьВоронкаДКП Тогда
				Renault_CRM.Статистика_Установить(Справочники.CRM_ЭтапыПродаж.КредитныйДоговорНаАванс, РабочийЛист, Ссылка,, ДатаДоговора, СтрСостав.Модель);
			ИначеЕсли ЕстьВоронкаАванс Тогда
				Renault_CRM.Статистика_Установить(Справочники.CRM_ЭтапыПродаж.ПродажаПоКредитномуДоговору, РабочийЛист, Ссылка,, ДатаДоговора, СтрСостав.Модель);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьДвиженияФактаПродаж(Этап)
	
	ЗаписьРабочийЛист = Renault_CRM.докПолучитьЗаписьРЛПоIDK(РабочийЛист);
	Для Каждого ТекСтрокаСоставДоговора Из СоставДоговора Цикл
		Если Этап = "Аванс" Тогда 
			ДобавитьСтрокуФактПродажи(Справочники.Renault_ЭтапыВыполненияПродаж.КонтрактБаза, ТекСтрокаСоставДоговора.СтоимостьБазовойКомплектации, ЗаписьРабочийЛист,ТекСтрокаСоставДоговора);
			ДобавитьСтрокуФактПродажи(Справочники.Renault_ЭтапыВыполненияПродаж.КонтрактДопОборудование, ТекСтрокаСоставДоговора.СтоимостьДопОпций, ЗаписьРабочийЛист,ТекСтрокаСоставДоговора);
		ИначеЕсли Этап = "ДКП" Тогда 
			ДобавитьСтрокуФактПродажи(Справочники.Renault_ЭтапыВыполненияПродаж.ПродажаБаза, ТекСтрокаСоставДоговора.СтоимостьБазовойКомплектации, ЗаписьРабочийЛист,ТекСтрокаСоставДоговора);
			ДобавитьСтрокуФактПродажи(Справочники.Renault_ЭтапыВыполненияПродаж.ПродажаДопОборудование, ТекСтрокаСоставДоговора.СтоимостьДопОпций, ЗаписьРабочийЛист,ТекСтрокаСоставДоговора);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСтрокуФактПродажи (Этап,Показатель, ЗаписьРабочийЛист, ТекСтрокаСоставДоговора)
	
	Движение = Движения.Renault_ФактВыполненияЭтаповПланирования.Добавить();
	Движение.ДилерскийЦентр = ?(ЗаписьРабочийЛист <> Неопределено, ЗаписьРабочийЛист.ДилерскийЦентр, Справочники.CRM_ДилерскиеЦентры.ПустаяСсылка());
	Движение.Менеджер = Менеджер;
	Движение.Отдел = ?(ЗаписьРабочийЛист <> Неопределено, ЗаписьРабочийЛист.Отдел, Справочники.CRM_Отделы.ПустаяСсылка());
	Движение.Модель = ТекСтрокаСоставДоговора.Модель;
	Движение.Этап = Этап;
	Движение.Период = Дата;
	Движение.Показатель = Показатель;
	
КонецПроцедуры

Процедура ПриСозданииНовогоДоговора() Экспорт
	
	ДатаДоговора = ТекущаяДата();
	
	Менеджер = ПараметрыСеанса.Пользователь.Сотрудник;
	Организация = Менеджер.Организация;
	КлиентДоговора = Клиент;
	НесколькоАвтомобилейВДоговоре = Ложь;
	
	Если КлиентДоговора <> Неопределено И Не ЗначениеЗаполнено(КлиентДоговора.ФормаСобственности) Тогда
		// DMSREN-1366
		//ВызватьИсключение "У клиента не указана форма собственности";
		КлиентОбъект = КлиентДоговора.ПолучитьОбъект();
		КлиентОбъект.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо;
		КлиентОбъект.Записать();
	КонецЕсли;
	
	//Добавим один автомобиль в табличную часть
	Если СоставДоговора.Количество() = 0 Тогда
		ДобавитьАвтомобиль();
	КонецЕсли;
	
	Для каждого стр Из СоставДоговора Цикл
		ОбновитьСкидкиДоговораПоСуммеRenault(стр);
	КонецЦикла;
	
КонецПроцедуры

Функция ДобавитьАвтомобиль() Экспорт
	
	НовСтрока = СоставДоговора.Добавить();
	НовСтрока.Идентификатор = Новый УникальныйИдентификатор();
	НовСтрока.ЗаказВПроизводство = Ложь;
	
	Возврат НовСтрока.Идентификатор;
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если СоставДоговора.Количество() = 1 Тогда
		
		VIN = СоставДоговора[0].VIN;
		
	ИначеЕсли СоставДоговора.Количество() > 1 Тогда
		
		VIN = Строка(СоставДоговора.Количество()) + " а/м";
		
	КонецЕсли;
	
	//Запишем реквизит состав договора
	Если ДопОпцииАвтомобилей.Количество() = 0 Тогда
		Для Каждого Строка Из СоставДоговора Цикл
			Строка.СоставОпций = "";
		КонецЦикла;
	Иначе
		
		Для Каждого Строка Из СоставДоговора Цикл
			
			СоставОпций = "";
			ОтборСтруктура = Новый Структура;
			ОтборСтруктура.Вставить("Идентификатор", Строка.Идентификатор);
			СтрокиПоАвто = ДопОпцииАвтомобилей.НайтиСтроки(ОтборСтруктура);
			Для Каждого СтрокаПоАвто Из СтрокиПоАвто Цикл
				СоставОпций = СоставОпций + " " + СтрокаПоАвто.Код;
			КонецЦикла;
			СоставОпций = СокрЛП(СоставОпций);
			Строка.СоставОпций = СоставОпций;
			
		КонецЦикла;
		
	КонецЕсли;
	
	СоздатьКлиента();
	
	//Проставим реквизит "НаОбработку" для отборов в списке
	Если СтатусПредварительныхДокументов = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.НаОформление
		ИЛИ СтатусПредварительныхДокументов = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Оформлен
		ИЛИ СтатусОкончательныхДокументов = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.НаОформление
		ИЛИ СтатусОкончательныхДокументов = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Оформлен
		ИЛИ СтатусДоговора = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.НаИзменение
		ИЛИ СтатусДоговора = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.НаРасторжение Тогда
		
		НаОбработку = Истина;
		
	Иначе
		
		НаОбработку = Ложь;
		
	КонецЕсли;
	
	НесколькоАвтомобилейВДоговоре = СоставДоговора.Количество() > 1;
	
	ЗаполнитьСуммыДоговора();
	
	Если НЕ СформироватьДокументыСкидки() Тогда Отказ=Истина КонецЕсли; //Сформируем документы по скидкам
	
	ПодставитьПодразделениеВДокумент();
	
	Если ЭтоНовый() Тогда
		// Сергеев. В.Н. DMSREN-846
		УстановитьНовыйНомер(обПолучитьПрефиксОбъекта(ЭтотОбъект,""));
		//+++
		//чтобы вызывать заного событие ПриУстановкеНовогоНомера присвоим пустой номер документу
		//Номер = "";
		//---
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПодставитьПодразделениеВДокумент()
	
	Если ЗначениеЗаполнено(DMS_Подразделение) Тогда 
		Возврат;
	КонецЕсли;
	
	//если будет установлен менеджер то подразделение берем оттуда, если не заполнено,
	//то отталкиваемся от текущего пользователя
	DMS_Подразделение = ПараметрыСеанса.Пользователь.Подразделение;
	
	Если Не ЗначениеЗаполнено(Менеджер) Тогда 
		Возврат;
	КонецЕсли;
	
	DMS_Подразделение = Менеджер.Подразделение;
	
КонецПроцедуры

Процедура ЗаполнитьСуммыДоговора() Экспорт
	
	СуммаКредита = СоставДоговора.Выгрузить().Скопировать(Новый Структура("ВключитьКредитВДоговор",Истина), "СуммаКредита").Итог("СуммаКредита");
	СуммаТрейдИн = СоставДоговора.Выгрузить().Скопировать(Новый Структура("ВключитьТрейдИнВДоговор",Истина), "СуммаТрейдИн").Итог("СуммаТрейдИн");
	СуммаВозмещенияПоУтилизации = СоставДоговора.Выгрузить().Скопировать(Новый Структура("ВключитьУтилизациюВДоговор",Истина), "СуммаВозмещенияПоУтилизации").Итог("СуммаВозмещенияПоУтилизации");
	СуммаСтраховки = СоставДоговора.Выгрузить().Скопировать(Новый Структура("ВключитьСтраховкуВДоговор",Истина), "СуммаСтраховки").Итог("СуммаСтраховки");
	СуммаПродленнойГарантии = СоставДоговора.Выгрузить().Скопировать(Новый Структура("ВключитьГарантиюВДоговор",Истина), "СуммаПродленнойГарантии").Итог("СуммаПродленнойГарантии");
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТЗ = СоставДоговора.Выгрузить(,"VIN,Модель,Версия");	
	Если ДействуетБлокировкаПродажиАвтомобиля(ТЗ,Отказ) Тогда
		Возврат;
	КонецЕсли;	
	
	ПривязатьАвтомобилиККлиенту();
	
	Если СтатусДоговора <> Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.НаОформление  Тогда
		
		ПланОбменаCRM = ПолучитьПланОбмена();
		ПланыОбмена.ЗарегистрироватьИзменения(ПланОбменаCRM,ЭтотОбъект.Ссылка);
		
	КонецЕсли;
	
	// проведем скидки или отменим проведение
	РежимПроведенияСкидок = ?(Проведен И СтатусДоговора = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.ОтменаПроведения);
	Для Каждого ДокСкидки Из СкидкиДоговора.ВыгрузитьКолонку("Документ") Цикл
		Если ДокСкидки.Пустая() Тогда Возврат КонецЕсли;
		Попытка
			Док = ДокСкидки.ПолучитьОбъект();
			Док.Записать(РежимПроведенияСкидок,РежимПроведенияДокумента.Неоперативный);
		Исключение
			Отказ = Истина;
			Сообщить("Не удалось провести скидку на автомобиль: " + ОписаниеОшибки(), СтатусСообщения.Внимание);
			Прервать
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПланОбмена()
	
	Выборка = ПланыОбмена.Renault_CRM.Выбрать();
	ЭтаБаза = ПланыОбмена.Renault_CRM.ЭтотУзел();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка <> ЭтаБаза Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Процедура ПривязатьАвтомобилиККлиенту()
	
	Если ТипЗнч(КлиентДоговора) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		// Удаляем прошлую принадлежность автомобилей клиенту
		ОтвязатьАвтомобилиОтКлиента();
		
		// Устанавливаем текущую принадлежность автомобилей клиенту
		Если СтатусОкончательныхДокументов = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан Тогда
			Для Каждого СтрокаАвтомобиль Из СоставДоговора Цикл
				Если СтрокаАвтомобиль.Автомобиль.Пустая() Тогда Продолжить; КонецЕсли;
				Менеджер_ = РегистрыСведений.Автомобили.СоздатьМенеджерЗаписи();
				Менеджер_.Автомобиль = СтрокаАвтомобиль.Автомобиль;
				Менеджер_.ВидЗначения = Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин;
				Менеджер_.Значение = КлиентДоговора;
				Менеджер_.Период = ДатаДоговора;
				Менеджер_.Записать();
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтвязатьАвтомобилиОтКлиента()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Автомобили.Период,
		|	Автомобили.Автомобиль,
		|	Автомобили.ВидЗначения
		|ИЗ
		|	РегистрСведений.Автомобили КАК Автомобили
		|ГДЕ
		|	Автомобили.Автомобиль В(&Автомобили)
		|	И Автомобили.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Хозяин)";
	Запрос.УстановитьПараметр("Автомобили", СоставДоговора.ВыгрузитьКолонку("Автомобиль"));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Менеджер_ = РегистрыСведений.Автомобили.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Менеджер, Выборка);
		Менеджер_.Удалить();
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОтвязатьАвтомобилиОтКлиента();
	
КонецПроцедуры

Процедура СоздатьКлиента()
	
	Если ПараметрыСеанса.Renault_ПраваПользователя.АвтосозданиеКлиентаПриОформленииДоговора И
		(СтатусПредварительныхДокументов = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Оформлен ИЛИ
		СтатусПредварительныхДокументов = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан ИЛИ
		СтатусОкончательныхДокументов = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Оформлен ИЛИ
		СтатусОкончательныхДокументов = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан) И
		ТипЗнч(КлиентДоговора) = Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты") Тогда
		
		Контрагент = CRM_Редубликация.СоздатьКонтрагентаНаОснованииПотенциальногоКлиента(КлиентДоговора, ЭтотОбъект);
		КлиентОбъект = КлиентДоговора.ПолучитьОбъект();
		КлиентОбъект.Контрагент = Контрагент;
		КлиентОбъект.Записать();
		
		Запись = РегистрыСведений.Renault_КлиентыНаЗамену.СоздатьМенеджерЗаписи();
		Запись.Клиент = КлиентДоговора;
		Запись.Записать();
		
		КлиентДоговора = Контрагент;
		Если Не КлиентДоговораОтличаетсяОтКлиентаРЛ Тогда
			Клиент = КлиентДоговора;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Если Не ДилерскийЦентр.DMS_ИспользоватьТиповуНумерациюДоговоровПродажАвто Тогда
		Возврат;
	КонецЕсли;
	
	Если Не дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда 
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьДокументыСкидки()
	
	//удалим документы по скидкам если они были удалены в договоре
	Если Не Ссылка.Пустая() И Ссылка.СкидкиДоговора.Количество() > 0 И СкидкиДоговора.Количество() = 0 Тогда
		Попытка
			Для Каждого Стр Из Ссылка.СкидкиДоговора Цикл 
				Если ЗначениеЗаполнено(Стр.Документ) И Не Стр.Документ.ПометкаУдаления Тогда
					Стр.Документ.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
				КонецЕсли;
			КонецЦикла;
		Исключение
			Сообщить("Не удалось удалить скидку на автомобиль", СтатусСообщения.Внимание);
			Возврат Ложь
		КонецПопытки;
	КонецЕсли;
	
	//удалим битые ссылки
	Для Каждого Стр Из ЭтотОбъект.СкидкиДоговора Цикл 
		Если ЗначениеЗаполнено(Стр.Документ) Тогда
			Если Стр.Документ.ПолучитьОбъект() = Неопределено Тогда
				Стр.Документ = Документы.Renault_ИзменениеСкидокНаАвтомобили.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//сформируем новые документы
	Если СтатусДоговора=Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СкидкиДоговора", СкидкиДоговора.Выгрузить());
		Запрос.УстановитьПараметр("СоставДоговора", СоставДоговора.Выгрузить());
		Запрос.Текст = "ВЫБРАТЬ
		               |	Т.Идентификатор,
		               |	Т.ТипСкидки,
		               |	Т.СуммаСкидки,
		               |	Т.Документ
		               |ПОМЕСТИТЬ СкидкиДоговора
		               |ИЗ
		               |	&СкидкиДоговора КАК Т
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Т.Идентификатор,
		               |	Т.Автомобиль,
		               |	Т.Модель,
		               |	Т.Версия
		               |ПОМЕСТИТЬ СоставДоговора
		               |ИЗ
		               |	&СоставДоговора КАК Т
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Скидки.Идентификатор,
		               |	Скидки.ТипСкидки,
		               |	Скидки.СуммаСкидки,
		               |	Скидки.Документ,
		               |	ВЫБОР
		               |		КОГДА Состав.Автомобиль = ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка)
		               |			ТОГДА Состав.Модель
		               |		ИНАЧЕ Состав.Автомобиль
		               |	КОНЕЦ КАК Автомобиль,
		               |	Состав.Версия КАК ВариантКомплектации
		               |ИЗ
		               |	СкидкиДоговора КАК Скидки
		               |		ЛЕВОЕ СОЕДИНЕНИЕ СоставДоговора КАК Состав
		               |		ПО Скидки.Идентификатор = Состав.Идентификатор";
		
		//СкидкиДоговора.Очистить();
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.Документ.Пустая() ИЛИ Выборка.Документ.ПометкаУдаления ИЛИ Выборка.Документ.ПолучитьОбъект() = Неопределено Тогда
				Док = Документы.Renault_ИзменениеСкидокНаАвтомобили.СоздатьДокумент(); //создадим новый документ
				Док.Дата = ТекущаяДата(); 
				Док.УстановитьНовыйНомер(); 
				//Иначе
				//	Док = Выборка.Документ.ПолучитьОбъект(); //используем существующий
				//КонецЕсли;
				
				Док.Комментарий = "Скидка по договору " + Ссылка;
				Док.Автор = ПараметрыСеанса.Пользователь;
				Док.ДатаНачала = ТекущаяДата();
				Док.ДатаКонца = ДобавитьМесяц(ТекущаяДата(),12);
				Док.ТипСкидки = Выборка.ТипСкидки;
				Док.ДилерскийЦентр = ДилерскийЦентр;
				Док.Автомобили.Очистить();
				СтрДок = Док.Автомобили.Добавить();
				СтрДок.Автомобиль = Выборка.Автомобиль;
				СтрДок.ВариантКомплектации = Выборка.ВариантКомплектации;
				СтрДок.СуммаСкидки = Выборка.СуммаСкидки;
				Попытка Док.Записать() Исключение 
					Сообщить("Не удалось записать скидку на автомобиль: " + ОписаниеОшибки(), СтатусСообщения.Внимание);
					Возврат Ложь
				КонецПопытки;
				
				СтрокаСкидки = СкидкиДоговора.Найти(Выборка.Идентификатор, "Идентификатор");//.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаСкидки, Выборка);
				СтрокаСкидки.Документ = Док.Ссылка; 	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Истина
КонецФункции

// Основная функция
Процедура РассчитатьСкидкиПоСтроке_неиспользуется(СтрокаДанных) Экспорт

	Если ДилерскийЦентр.ПрименятьКоммерческиеАкцииRenault <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаДанных.Модель) ИЛИ Не ЗначениеЗаполнено(СтрокаДанных.Версия) Тогда
		МодельНеопределена = Истина;
	Иначе
		мМодель = СтрокаДанных.Модель;
		мВерсия = СтрокаДанных.Версия;
		
		МодельНеопределена = Ложь;
	КонецЕсли;

	Если МодельНеопределена Тогда
		
		Если ЗначениеЗаполнено(СтрокаДанных.Автомобиль) Тогда
			мМодель = СтрокаДанных.Автомобиль.Модель;
			мВерсия = СтрокаДанных.Автомобиль.ВариантКомплектации;
		КонецЕсли;
		
		МодельНеопределена = Не ЗначениеЗаполнено(мМодель) ИЛИ Не ЗначениеЗаполнено(мВерсия);
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	мТипСкидки = Справочники.ТипыСкидок.НайтиПоКоду("RenltCA");
	
	Если мТипСкидки.Пустая() Тогда
		
		мТипСкидкиОб = Справочники.ТипыСкидок.СоздатьЭлемент();
		мТипСкидкиОб.ОбменДанными.Загрузка = Истина;
		мТипСкидкиОб.Код = "RenltCA";
		мТипСкидкиОб.Наименование = "Скидки по коммерческим акциям Renault";
		
		Попытка
			мТипСкидкиОб.Записать();
			мТипСкидки = мТипСкидкиОб.Ссылка;
		Исключение
			Сообщить("Не удалось автоматически создать тип скидки. Создайте элемент справочника ""Типы скидок и наценок"" с кодом ""RenltCA"" (тип скидки по коммерческим акциям Renault)");
			Возврат;
		КонецПопытки;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	// Очистка рассчитанных скидок
	Найдено = СкидкиДоговора.НайтиСтроки(Новый Структура("ТипСкидки, Идентификатор", мТипСкидки, СтрокаДанных.Идентификатор));  
	
	МасУд = Новый Массив;
	Для каждого стр Из Найдено Цикл
		МасУд.Добавить(стр);
	КонецЦикла;
	
	Пока МасУд.Количество() > 0 Цикл
		СкидкиДоговора.Удалить(МасУд[0]);
		МасУд.Удалить(0);
	КонецЦикла;
	
	Пока СкидкиRenualtРасшифровка.Найти(СтрокаДанных.Идентификатор) <> Неопределено Цикл
		СкидкиRenualtРасшифровка.Удалить(СкидкиRenualtРасшифровка.Найти(СтрокаДанных.Идентификатор));
	КонецЦикла;
	
	Если МодельНеопределена Тогда
		Возврат;
	КонецЕсли;
	
	//перенесена в общий модуль, так-как нужна и в других местах
	мТипАвтомобиля = Renault_ЗагрузкаКоммерческихАкций.УстановитьТипАвтомобиля(СтрокаДанных.VIN, ДилерскийЦентр); 
	
	мСкидки = Renault_ЗагрузкаКоммерческихАкций.ПолучитьВсеСкидки(СтрокаДанных.VIN, мМодель, мВерсия, мТипАвтомобиля, СтрокаДанных.ГодВыпуска, ДатаДоговора);
	
	Для Сч = 1 По мСкидки.Количество() Цикл
		
		СтруктураСкидки = мСкидки["КлючСтроки"+Сч];
		
		Если СтруктураСкидки.ВариантСкидки = "Процент" Тогда
			Продолжить; // уточнить как обрабатывать процентные скидки, от какой суммы считать процент // доработать
		КонецЕсли;
		
		// Проверка соответствия договора условиям предоставления скидки
		ОтказПредоставления = Ложь;
		Для каждого стрУсловие Из СтруктураСкидки.СписокУсловий Цикл
			ПроверитьСоответствиеДоговораУсловиюСкидки(ОтказПредоставления, стрУсловие, СтрокаДанных);
			Если ОтказПредоставления Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ОтказПредоставления Тогда
			НС = СкидкиRenualtРасшифровка.Добавить();
			НС.Идентификатор = СтрокаДанных.Идентификатор;
			НС.КоммерческаяАкцияGUID = СтруктураСкидки.КоммерческаяАкцияGUID;
			НС.КлючСтроки = СтруктураСкидки.КлючСтроки;
			НС.ЗначениеСкидки = СтруктураСкидки.ЗначениеСкидки;
		КонецЕсли;
		
	КонецЦикла;
	
	Если СкидкиRenualtРасшифровка.Найти(СтрокаДанных.Идентификатор, "Идентификатор") <> Неопределено Тогда
		
		УдалитьНесовместимыеСкидкиRenault(СтрокаДанных.Идентификатор);
		
		СуммаСкидокRenault = 0;
		Для каждого стр Из СкидкиRenualtРасшифровка Цикл
			СуммаСкидокRenault = СуммаСкидокRenault + стр.ЗначениеСкидки;
		КонецЦикла;
		
		Если СуммаСкидокRenault > 0 Тогда
		
			НС = СкидкиДоговора.Добавить();
			НС.Идентификатор = СтрокаДанных.Идентификатор;
			НС.ТипСкидки = мТипСкидки;
			НС.СуммаСкидки = СуммаСкидокRenault;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
Процедура ОбновитьСкидкиДоговораПоСуммеRenault(СтрокаДанных) Экспорт

	//Если ДилерскийЦентр.ПрименятьКоммерческиеАкцииRenault <> Истина Тогда
	//	СтрокаДанных.СуммаСкидокПоКоммерческимАкциям = 0;
	//КонецЕсли;
	//
	//УстановитьПривилегированныйРежим(Истина);
	//
	//мТипСкидки = Справочники.ТипыСкидок.НайтиПоКоду("RenltCA");
	//
	//Если мТипСкидки.Пустая() Тогда
	//	мТипСкидкиОб = Справочники.ТипыСкидок.СоздатьЭлемент();
	//	мТипСкидкиОб.ОбменДанными.Загрузка = Истина;
	//	мТипСкидкиОб.Код = "RenltCA";
	//	мТипСкидкиОб.Наименование = "Скидки по коммерческим акциям Renault";
	//	
	//	Попытка
	//		мТипСкидкиОб.Записать();
	//		мТипСкидки = мТипСкидкиОб.Ссылка;
	//	Исключение
	//		Сообщить("Не удалось автоматически создать тип скидки. Создайте элемент справочника ""Типы скидок и наценок"" с кодом ""RenltCA"" (тип скидки по коммерческим акциям Renault)");
	//		Возврат;
	//	КонецПопытки;
	//КонецЕсли;
	//
	//УстановитьПривилегированныйРежим(Ложь);
	//
	//Строки = СкидкиДоговора.НайтиСтроки(Новый Структура("ТипСкидки, Идентификатор", мТипСкидки, СтрокаДанных.Идентификатор));  
	//
	//Если Строки.Количество()>0 И СтрокаДанных.СуммаСкидокПоКоммерческимАкциям = 0 Тогда
	//	МасУд = Новый Массив;
	//	Для каждого стр Из Строки Цикл
	//		МасУд.Добавить(стр);
	//	КонецЦикла;
	//	
	//	Пока МасУд.Количество() > 0 Цикл
	//		СкидкиДоговора.Удалить(МасУд[0]);
	//		МасУд.Удалить(0);
	//	КонецЦикла;
	//ИначеЕсли Строки.Количество()>0 И СтрокаДанных.СуммаСкидокПоКоммерческимАкциям > 0 Тогда
	//	Строки[0].СуммаСкидки = СтрокаДанных.СуммаСкидокПоКоммерческимАкциям;	
	//ИначеЕсли Строки.Количество()=0 И СтрокаДанных.СуммаСкидокПоКоммерческимАкциям > 0 Тогда	
	//	НС = СкидкиДоговора.Добавить();
	//	НС.Идентификатор = СтрокаДанных.Идентификатор;
	//	НС.ТипСкидки = мТипСкидки;
	//	НС.СуммаСкидки = СтрокаДанных.СуммаСкидокПоКоммерческимАкциям;
	//КонецЕсли;
	//
	//мСуммаПоПрочимСкидкам =  0;
	//Для каждого стрСкидка Из СкидкиДоговора.НайтиСтроки(Новый Структура("Идентификатор", СтрокаДанных.Идентификатор)) Цикл
	//	мСуммаПоПрочимСкидкам = мСуммаПоПрочимСкидкам + стрСкидка.СуммаСкидки;	
	//КонецЦикла;
	//СтрокаДанных.СуммаПоПрочимСкидкам = мСуммаПоПрочимСкидкам;
	
КонецПроцедуры

Процедура ПроверитьСоответствиеДоговораУсловиюСкидки(ОтказПредоставления, стрУсловие, СтрокаДанных, ПроверкаТипАвто = Ложь) Экспорт
	
	// Доработать проверку остальных условий
	Если СтрокаДанных.ПокупкаВТрейдИн Тогда
		Если стрУсловие.ВидУсловия = Перечисления.Renault_ВидыУсловийПредоставленияСкидок.Утилизация Тогда
			ОтказПредоставления = Истина;
		КонецЕсли;
	ИначеЕсли НЕ СтрокаДанных.ПокупкаВТрейдИн И
			стрУсловие.ВидУсловия = Перечисления.Renault_ВидыУсловийПредоставленияСкидок.ТрейдИн Тогда
		ОтказПредоставления = Истина;
	ИначеЕсли СтрокаДанных.ПокупкаПоУтилизации Тогда
		Если стрУсловие.ВидУсловия = Перечисления.Renault_ВидыУсловийПредоставленияСкидок.ТрейдИн Тогда
			ОтказПредоставления = Истина;
		КонецЕсли;
	ИначеЕсли НЕ СтрокаДанных.ПокупкаПоУтилизации И
		стрУсловие.ВидУсловия = Перечисления.Renault_ВидыУсловийПредоставленияСкидок.Утилизация Тогда
		ОтказПредоставления = Истина;
	КонецЕсли;
	
	Если ПроверкаТипАвто Тогда
		
		Если стрУсловие.ВидУсловия = Перечисления.Renault_ВидыУсловийПредоставленияСкидок.НовыйАвтомобиль Тогда
			ОтказПредоставления = мТипАвтомобиля <> "Новый";
		ИначеЕсли стрУсловие.ВидУсловия = Перечисления.Renault_ВидыУсловийПредоставленияСкидок.ПодержанныйАвтомобиль Тогда
			ОтказПредоставления = мТипАвтомобиля <> "Подержанный";
		ИначеЕсли стрУсловие.ВидУсловия = Перечисления.Renault_ВидыУсловийПредоставленияСкидок.ДемоАвтомобиль Тогда
			ОтказПредоставления = мТипАвтомобиля <> "Демо";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьНесовместимыеСкидкиRenault(Идентификатор)
	
	//СтрокаСостав = СоставДоговора.Найти(Идентификатор);
	//
	//Если мТипАвтомобиля = "Новый" Тогда
	//	ВидУсловия = Перечисления.Renault_ВидыУсловийПредоставленияСкидок.НовыйАвтомобиль;
	//ИначеЕсли мТипАвтомобиля = "Подержанный" Тогда
	//	ВидУсловия = Перечисления.Renault_ВидыУсловийПредоставленияСкидок.ПодержанныйАвтомобиль;
	//ИначеЕсли мТипАвтомобиля = "Демо" Тогда
	//	ВидУсловия = Перечисления.Renault_ВидыУсловийПредоставленияСкидок.ДемоАвтомобиль;
	//КонецЕсли;
	//
	//Запрос = Новый Запрос;
	//
	//Запрос.УстановитьПараметр("Идентификатор", Идентификатор); 
	//Запрос.УстановитьПараметр("СкидкиRenualtРасшифровка", СкидкиRenualtРасшифровка.Выгрузить());
	//Запрос.УстановитьПараметр("ВидУсловия", ВидУсловия);
	//
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	СкидкиRenualtРасшифровка.КоммерческаяАкцияGUID
	//|ПОМЕСТИТЬ ВТ_СкидкиRenault
	//|ИЗ
	//|	&СкидкиRenualtРасшифровка КАК СкидкиRenualtРасшифровка
	//|ГДЕ
	//|	СкидкиRenualtРасшифровка.Идентификатор = &Идентификатор
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID
	//|ПОМЕСТИТЬ ВТ_АкцииПодготовка1
	//|ИЗ
	//|	ВТ_СкидкиRenault КАК ВТ_СкидкиRenault
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КоммерческиеАкции КАК Renault_КоммерческиеАкции
	//|		ПО ВТ_СкидкиRenault.КоммерческаяАкцияGUID = Renault_КоммерческиеАкции.КоммерческаяАкцияGUID
	//|			И (Renault_КоммерческиеАкции.АкцияGUID = """")
	//|ГДЕ
	//|	Renault_КоммерческиеАкции.УсловиеПредоставления.ВидУсловия = &ВидУсловия
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID КАК КоммерческаяАкцияGUID
	//|ПОМЕСТИТЬ ВТ_АкцииСовместимыНекоторыеПодготовка
	//|ИЗ
	//|	ВТ_СкидкиRenault КАК ВТ_СкидкиRenault
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КоммерческиеАкции КАК Renault_КоммерческиеАкции
	//|		ПО ВТ_СкидкиRenault.КоммерческаяАкцияGUID = Renault_КоммерческиеАкции.КоммерческаяАкцияGUID
	//|			И (Renault_КоммерческиеАкции.Комбинируется)
	//|ГДЕ
	//|	Renault_КоммерческиеАкции.УсловиеПредоставления.ВидУсловия = &ВидУсловия
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID КАК КоммерческаяАкцияGUID
	//|ПОМЕСТИТЬ ВТ_АкцииСовместимыНекоторыеПодготовка2
	//|ИЗ
	//|	ВТ_СкидкиRenault КАК ВТ_СкидкиRenault
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КоммерческиеАкции КАК Renault_КоммерческиеАкции
	//|		ПО ВТ_СкидкиRenault.КоммерческаяАкцияGUID = Renault_КоммерческиеАкции.КоммерческаяАкцияGUID
	//|			И (Renault_КоммерческиеАкции.Комбинируется)
	//|ГДЕ
	//|	(Renault_КоммерческиеАкции.АкцияGUID В
	//|				(ВЫБРАТЬ
	//|					ВТ_АкцииПодготовка1.КоммерческаяАкцияGUID
	//|				ИЗ
	//|					ВТ_АкцииПодготовка1 КАК ВТ_АкцииПодготовка1)
	//|			ИЛИ НЕ 1 В
	//|					(ВЫБРАТЬ ПЕРВЫЕ 1
	//|						1
	//|					ИЗ
	//|						ВТ_АкцииПодготовка1 КАК ВТ_АкцииПодготовка1))
	//|	И Renault_КоммерческиеАкции.КоммерческаяАкцияGUID В
	//|			(ВЫБРАТЬ
	//|				ВТ_АкцииСовместимыНекоторыеПодготовка.КоммерческаяАкцияGUID
	//|			ИЗ
	//|				ВТ_АкцииСовместимыНекоторыеПодготовка КАК ВТ_АкцииСовместимыНекоторыеПодготовка)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID КАК КоммерческаяАкцияGUID,
	//|	Renault_КоммерческиеАкции.АкцияGUID КАК КомбинируемаяАкцияGUID
	//|ПОМЕСТИТЬ ВТ_АкцииСовместимыНекоторые
	//|ИЗ
	//|	ВТ_АкцииСовместимыНекоторыеПодготовка2 КАК ВТ_АкцииСовместимыНекоторыеПодготовка2
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КоммерческиеАкции КАК Renault_КоммерческиеАкции
	//|		ПО ВТ_АкцииСовместимыНекоторыеПодготовка2.КоммерческаяАкцияGUID = Renault_КоммерческиеАкции.КоммерческаяАкцияGUID
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID,
	//|	Renault_КоммерческиеАкции.АкцияGUID
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_АкцииПодготовка1.КоммерческаяАкцияGUID
	//|ИЗ
	//|	ВТ_АкцииПодготовка1 КАК ВТ_АкцииПодготовка1
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_АкцииСовместимыНекоторые.КоммерческаяАкцияGUID КАК КоммерческаяАкцияGUID,
	//|	ВТ_АкцииСовместимыНекоторые.КомбинируемаяАкцияGUID,
	//|	АкцииКолвоСовместимых.Колво КАК Колво
	//|ИЗ
	//|	ВТ_АкцииСовместимыНекоторые КАК ВТ_АкцииСовместимыНекоторые
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			ВТ_АкцииСовместимыНекоторые.КоммерческаяАкцияGUID КАК КоммерческаяАкцияGUID,
	//|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_АкцииСовместимыНекоторые.КомбинируемаяАкцияGUID) КАК Колво
	//|		ИЗ
	//|			ВТ_АкцииСовместимыНекоторые КАК ВТ_АкцииСовместимыНекоторые
	//|		
	//|		СГРУППИРОВАТЬ ПО
	//|			ВТ_АкцииСовместимыНекоторые.КоммерческаяАкцияGUID) КАК АкцииКолвоСовместимых
	//|		ПО ВТ_АкцииСовместимыНекоторые.КоммерческаяАкцияGUID = АкцииКолвоСовместимых.КоммерческаяАкцияGUID
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Колво УБЫВ
	//|ИТОГИ ПО
	//|	КоммерческаяАкцияGUID";
	//
	//Результат = Запрос.ВыполнитьПакет();
	//
	//Совместимые = Результат[Результат.Количество()-2].Выбрать();
	//СовместимыеНекоторые = Результат[Результат.Количество()-1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//
	//СписокАкций = Новый Массив;
	//
	//Пока Совместимые.Следующий() Цикл
	//	СписокАкций.Добавить(Совместимые.КоммерческаяАкцияGUID);
	//КонецЦикла;
	//
	//ТЗ_Свертка = Новый ТаблицаЗначений;
	//ТЗ_Свертка.Колонки.Добавить("Акция", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(36)));
	//ТЗ_Свертка.Колонки.Добавить("общ"  , Новый ОписаниеТипов("Булево"));
	//ТЗ_Свертка.Колонки.Добавить("тек"  , Новый ОписаниеТипов("Булево"));
	//
	//ПЦ = Истина;
	//общСписокСовместимых = Новый Массив;
	//Пока СовместимыеНекоторые.Следующий() Цикл
	//	
	//	Если ПЦ Тогда
	//	
	//		СписокАкций.Добавить(СовместимыеНекоторые.КоммерческаяАкцияGUID);
	//		
	//		ВыборкаДЗ = СовместимыеНекоторые.Выбрать();
	//		
	//		общСписокСовместимых = Новый Массив;
	//		Пока ВыборкаДЗ.Следующий() Цикл
	//			общСписокСовместимых.Добавить(ВыборкаДЗ.КомбинируемаяАкцияGUID);
	//		КонецЦикла;
	//		
	//		ПЦ = Ложь;
	//		
	//	Иначе
	//		
	//		Если общСписокСовместимых.Найти(СовместимыеНекоторые.КоммерческаяАкцияGUID) = Неопределено Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		ВыборкаДЗ = СовместимыеНекоторые.Выбрать();
	//		
	//		текСписокСовместимых = Новый Массив;
	//		Пока ВыборкаДЗ.Следующий() Цикл
	//			текСписокСовместимых.Добавить(ВыборкаДЗ.КомбинируемаяАкцияGUID);
	//		КонецЦикла;
	//		
	//		Отказ = Ложь;
	//		Для каждого стрАкция Из СписокАкций Цикл
	//			Если текСписокСовместимых.Найти(стрАкция) = Неопределено Тогда
	//				Отказ = Истина;
	//				Прервать;
	//			КонецЕсли;
	//		КонецЦикла;
	//		
	//		ТЗ_Свертка.Очистить();
	//		Если Не Отказ Тогда
	//			
	//			СписокАкций.Добавить(СовместимыеНекоторые.КоммерческаяАкцияGUID);	
	//			
	//			// Выбираем из двух массивов значения, которые есть и там и там
	//			
	//			Для каждого Эл Из общСписокСовместимых Цикл
	//				НС = ТЗ_Свертка.Добавить();
	//				НС.общ = Истина;
	//				НС.Акция = Эл;
	//			КонецЦикла;
	//			
	//			Для каждого Эл Из текСписокСовместимых Цикл
	//				Если ТЗ_Свертка.НайтиСтроки(Новый Структура("Акция", Эл)).Количество() > 0 Тогда
	//					НС = ТЗ_Свертка.НайтиСтроки(Новый Структура("Акция", Эл))[0];
	//				Иначе	
	//					НС = ТЗ_Свертка.Добавить();
	//				КонецЕсли;
	//				НС.тек = Истина;
	//				НС.Акция = Эл;
	//			КонецЦикла;
	//			
	//			Для Сч=0 По ТЗ_Свертка.Количество()-1 Цикл
	//				
	//				Если Сч > ТЗ_Свертка.Количество()-1 Тогда
	//					Прервать;
	//				КонецЕсли;
	//				
	//				стр = ТЗ_Свертка[Сч];
	//				
	//				Если Не стр.тек ИЛИ Не стр.общ Тогда
	//					ТЗ_Свертка.Удалить(стр);
	//					Сч = Сч - 1;
	//				КонецЕсли;
	//				
	//			КонецЦикла;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Для Сч = 0 По СкидкиRenualtРасшифровка.Количество()-1 Цикл
	//	
	//	Если Сч > СкидкиRenualtРасшифровка.Количество()-1 Тогда
	//		Прервать;
	//	КонецЕсли;
	//	
	//	стр = СкидкиRenualtРасшифровка.Получить(Сч);
	//	
	//	Если СписокАкций.Найти(стр.КоммерческаяАкцияGUID) = Неопределено Тогда
	//		СкидкиRenualtРасшифровка.Удалить(стр);
	//		
	//		Сч = Сч - 1;
	//	КонецЕсли;
	//КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьСоответствиеСкидокТипуАвто(Идентификатор, УстановитьТипАвто = Истина)

	//ТЗ = СкидкиRenualtРасшифровка.Выгрузить(Новый Структура("Идентификатор", Идентификатор), "КоммерческаяАкцияGUID");
	//
	//Если ТЗ.Количество() = 0 Тогда
	//	Возврат
	//КонецЕсли;
	//
	//СтрокаДанных = СоставДоговора.Найти(Идентификатор, "Идентификатор");
	//
	//Если УстановитьТипАвто Тогда
	//	//перенесена в общий модуль, так-как нужна и в других местах
	//	мТипАвтомобиля = Renault_ЗагрузкаКоммерческихАкций.УстановитьТипАвтомобиля(СтрокаДанных.VIN, ДилерскийЦентр); 
	//КонецЕсли;
	//
	//Если мТипАвтомобиля = Неопределено Тогда
	//	
	//	Сообщить("Не удалось определить тип автомобиля (новый/подержанный/демо), скидки Renault не рассчитаны");
	//	
	//	// Удаляем все акции renault	
	//	
	//	Для каждого стр Из ТЗ Цикл
	//		
	//		стрАкция = СкидкиRenualtРасшифровка.НайтиСтроки(Новый Структура("Идентификатор, КоммерческаяАкцияGUID", Идентификатор, стр.КоммерческаяАкцияGUID))[0];
	//		СкидкиRenualtРасшифровка.Удалить(стрАкция);
	//		
	//	КонецЦикла;
	//	
	//	Возврат;
	//	
	//КонецЕсли;
	//
	//ВидыУсловий = Renault_ЗагрузкаКоммерческихАкций.ПолучитьСписокВидУсловийТипАвто();
	//
	//Запрос = Новый Запрос;
	//
	//Запрос.УстановитьПараметр("СписокАкций", ТЗ.ВыгрузитьКолонку("КоммерческаяАкцияGUID"));
	//Запрос.УстановитьПараметр("ВидыУсловий", ВидыУсловий); 
	//
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID КАК КоммерческаяАкцияGUID,
	//               |	Renault_КоммерческиеАкции.УсловиеПредоставления
	//               |ИЗ
	//               |	РегистрСведений.Renault_КоммерческиеАкции КАК Renault_КоммерческиеАкции
	//               |ГДЕ
	//               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID В (&СписокАкций)
	//               |	И Renault_КоммерческиеАкции.УсловиеПредоставления.ВидУсловия В(&ВидыУсловий)
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID,
	//               |	Renault_КоммерческиеАкции.УсловиеПредоставления
	//               |ИТОГИ ПО
	//               |	КоммерческаяАкцияGUID";
	//
	//ВыборкаАкция = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//
	//АкцииУдалить = Новый Массив;
	//Пока ВыборкаАкция.Следующий() Цикл
	//	
	//	Выборка = ВыборкаАкция.Выбрать();
	//	Отказ = Истина;
	//	Пока Выборка.Следующий() Цикл
	//		ПроверитьСоответствиеДоговораУсловиюСкидки(Отказ, Выборка.УсловиеПредоставления, СтрокаДанных, Истина);
	//		Если Не Отказ Тогда
	//			// Если хоть одно условие по типу авто проходит, считаем такую скидку применимой
	//			Прервать;
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	Если Отказ Тогда
	//		АкцииУдалить.Добавить(ВыборкаАкция.КоммерческаяАкцияGUID);
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	//Для каждого стр Из АкцииУдалить Цикл
	//	
	//	стрАкция = СкидкиRenualtРасшифровка.НайтиСтроки(Новый Структура("Идентификатор, КоммерческаяАкцияGUID", Идентификатор, стр))[0];
	//	СкидкиRenualtРасшифровка.Удалить(стрАкция);
	//	
	//КонецЦикла;
	
КонецПроцедуры

//Создана такая же в общем модуле Renault_ЗагрузкаКоммерческихАкций, если не нужна можно удалить
Процедура УстановитьТипАвтомобиля(СтрокаДанных) Экспорт
	
	Если ЗначениеЗаполнено(СтрокаДанных.VIN) Тогда
		
		мТипАвтомобиля = Неопределено;
		
		ДилерскийЦентрПользователя = Renault_РаботаСПравамиПользователя.ДилерскийЦентрПоУмолчанию(ПараметрыСеанса.Пользователь);
		
		BIR_Distri = СокрЛП(ДилерскийЦентрПользователя.BIR_Distri);
		
		МассивСкладовДилера = ДилерскийЦентрПользователя.СкладыДилера.ВыгрузитьКолонку("Склад");
		//Корзюков начало
		Если Не ЗначениеЗаполнено(ДилерскийЦентрПользователя) Тогда
			#Если Клиент Тогда
				Предупреждение("Для пользователя не задан дилерский центр!");
			#конецЕсли
			Возврат;
		КонецЕсли;
		
		Если ДилерскийЦентрПользователя.Автосклад_ИспользоватьНовуюФормуСклада = Истина Тогда
			
			ФормаАвтосклад = Обработки.Renault_АРМ_Автосклад_Упр.ПолучитьФорму("ФормаДинамическийСписок");
			
		Иначе
			ФормаАвтосклад = Обработки.Renault_АРМ_Автосклад.ПолучитьФорму("Форма");
			

		КонецЕсли;
		
		//ФормаАвтосклад = Обработки.Renault_АРМ_Автосклад.ПолучитьФорму("Форма");
		//Корзюков конец
		ФормаАвтосклад.ПоказыватьЗарезервированные = Истина;
		ФормаАвтосклад.МассивСкладовДилера = МассивСкладовДилера;		
		// Ищем в новых
		
		Результат = CRM_Сервер.Автосклад_ПолучитьТаблицуПоСостояниюАвтомобилей(СтрокаДанных.VIN, МассивСкладовДилера, BIR_Distri, Истина, Истина, Истина, Истина,,,,, Неопределено, Неопределено,, Неопределено);
		Если Результат.Количество() > 0 Тогда
			мТипАвтомобиля = "Новый";
		КонецЕсли;
		
		// Ищем в подержанных
		
		Если мТипАвтомобиля = Неопределено Тогда
		
			Результат = CRM_Сервер.Автосклад_ПолучитьТаблицуПодержанныхАвтомобилей(СтрокаДанных.VIN);
			Если Результат.Количество() > 0 Тогда
				мТипАвтомобиля = "Подержанный";
			КонецЕсли;
		
		КонецЕсли;
		
		// Ищем в демо/подменных
		
		Если мТипАвтомобиля = Неопределено Тогда
			
			Результат = ФормаАвтосклад.Автосклад_ПолучитьТаблицуДемоПодменок(СтрокаДанных.VIN);
			Если Результат.Количество() > 0 Тогда
				мТипАвтомобиля = "Демо";
			КонецЕсли;
			
		КонецЕсли;
		
		
		// Если так и не удалось определить тип, считаем что новый
		Если мТипАвтомобиля = Неопределено Тогда
			мТипАвтомобиля = "Новый";
		КонецЕсли;
		
	Иначе
		
		мТипАвтомобиля = Неопределено;
		
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьСписокПечатныхФорм(СсылкаДокумента) Экспорт
	
	Возврат Новый СписокЗначений();
	
КонецФункции

Функция ДействуетБлокировкаПродажиАвтомобиля(ТЗ,Отказ)	
	
	//DMSREN-984
	Если СтатусДоговора=Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Расторгнут Тогда 
		Возврат Отказ;
	КонецЕсли;
	//---
	
	Для каждого Стр Из ТЗ Цикл
		Если ЗначениеЗаполнено(Стр.VIN) И Renault_ОбщийМодуль.Блокировка(Стр.VIN) Тогда
			//Сергеев В.Н. DMSREN-1124 
			//Сообщить("Не удалось записать договор."+Символы.ПС+"Автомобиль с VIN "+Стр.VIN+" заблокирован к продаже.");
			//Отказ=Истина;
		ИначеЕсли ЗначениеЗаполнено(Стр.Версия) И Renault_ОбщийМодуль.Блокировка(Стр.Версия) Тогда
			Сообщить("Не удалось записать договор."+Символы.ПС+"Вариант комплектации "+Стр.Версия + " заблокирован к продаже.");
			Отказ=Истина;
		ИначеЕсли ЗначениеЗаполнено(Стр.Модель) И Renault_ОбщийМодуль.Блокировка(Стр.Модель) Тогда
			Сообщить("Не удалось записать договор."+Символы.ПС+"Модель "+Стр.Модель+" заблокирована к продаже.");
			Отказ=Истина;
		КонецЕсли;	
	КонецЦикла;
	Возврат Отказ;	
КонецФункции

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли

