Процедура НачатьПеренос() Экспорт
		
	МассивПереносимыхНастроек = СформироватьМассивПереносимыхНастроек();
	Если НЕ(МассивПереносимыхНастроек.Количество()=0) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Пользователи.ШаблонПрав,
		                      |	Пользователи.Ссылка
		                      |ИЗ
		                      |	Справочник.Пользователи КАК Пользователи
		                      |ГДЕ
		                      |	Пользователи.ПометкаУдаления = ЛОЖЬ");
		Таблица = Запрос.Выполнить().Выгрузить();
		ТаблицаОписания =  СформироватьНовуюТаблицуОписания(МассивПереносимыхНастроек);
		ЗаполнитьТаблицуОписания(ТаблицаОписания,Таблица,МассивПереносимыхНастроек);
		СвенутьТаблицуОписания(ТаблицаОписания,МассивПереносимыхНастроек);
		СопоставитьшаблоныИПользователей(ТаблицаОписания);
	КонецЕсли;
    ЗаполнитьТипыМакетов();
КонецПроцедуры

Процедура ЗаполнитьТипыМакетов()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПользовательскиеМакетыПечати.ИмяМакета,
	                      |	ПользовательскиеМакетыПечати.Объект,
	                      |	ПользовательскиеМакетыПечати.ТипМакета,
	                      |	ПользовательскиеМакетыПечати.Макет,
	                      |	ПользовательскиеМакетыПечати.Использование
	                      |ИЗ
	                      |	РегистрСведений.Renault_ПользовательскиеМакетыПечати КАК ПользовательскиеМакетыПечати");
	Таблица = запрос.Выполнить().Выгрузить();
	Для Каждого Тек Из Таблица Цикл
		Если СтрДлина(СокрЛП(Тек.ТипМакета))=0 Тогда 
			Тек.ТипМакета ="DOC";
		КонецЕсли;
	КонецЦикла;
	Набор = РегистрыСведений.Renault_ПользовательскиеМакетыПечати.СоздатьНаборЗаписей();
	Набор.Загрузить(Таблица);
	Набор.Записать();
	
КонецПроцедуры	

Функция СформироватьНовуюТаблицуОписания(Настройки) экспорт 
	
	Таблица = Новый ТаблицаЗначений();
	Таблица.Колонки.Добавить("Пользователь");
	Таблица.Колонки.Добавить("НовыйШаблонНастроек");
	Таблица.Колонки.Добавить("ЭтоШаблонПрав");
  	Для Каждого Настройка Из Настройки Цикл
		Таблица.Колонки.Добавить(Настройка.Имя);
	КонецЦикла;
	Возврат Таблица;
	
КонецФункции

Функция СформироватьМассивПереносимыхНастроек() Экспорт
	
	МассивПереносимыхНастроек = Новый Массив();
	
	ПерНастройка = Новый Структура();
	ПерНастройка.Вставить("Имя","Отдел");
	ПерНастройка.Вставить("Значение",ПланыВидовХарактеристик.ПраваИНастройки.ОтделПоУмолчанию);
	МассивПереносимыхНастроек.Добавить(ПерНастройка);
	Попытка
		ПерНастройка = Новый Структура();
		ПерНастройка.Вставить("Имя","ПравоНаПодтверждениеДокументаТестДрайв");
		ПерНастройка.Вставить("Значение",ПланыВидовХарактеристик.ПраваИНастройки.ПравоНаПодтверждениеДокументаТестДрайв);
		МассивПереносимыхНастроек.Добавить(ПерНастройка);
	Исключение
	КонецПопытки;
	Попытка
		ПерНастройка = Новый Структура();
		ПерНастройка.Вставить("Имя","РазрешитьРаботуСАрмМенеджера");
		ПерНастройка.Вставить("Значение",ПланыВидовХарактеристик.ПраваИНастройки.РазрешитьРаботуСАРММенеджера);
		МассивПереносимыхНастроек.Добавить(ПерНастройка);
	Исключение
	КонецПопытки;
	Попытка
		ПерНастройка = Новый Структура();
		ПерНастройка.Вставить("Имя","РазрешитьРаботуСАрмРесепшена");
		ПерНастройка.Вставить("Значение",ПланыВидовХарактеристик.ПраваИНастройки.РазрешитьРаботуСАРМРесепшн);
		МассивПереносимыхНастроек.Добавить(ПерНастройка);
	Исключение
	КонецПопытки;
	Попытка
		ПерНастройка = Новый Структура();
		ПерНастройка.Вставить("Имя","РазрешитьРаботуСАрмРОП");
		ПерНастройка.Вставить("Значение",ПланыВидовХарактеристик.ПраваИНастройки.РазрешитьРаботуСАРМРуководителя);
		МассивПереносимыхНастроек.Добавить(ПерНастройка);
	Исключение
	КонецПопытки;
	
	Возврат МассивПереносимыхНастроек;
	
КонецФункции

Процедура ЗаполнитьТаблицуОписания(ТаблицаОписания,ТаблицаПользователей,ПереносимыеНастройки) Экспорт
	
	Для Каждого ТекПользователь Из ТаблицаПользователей Цикл
		Если (ТекПользователь.ШаблонПрав = Неопределено) ИЛИ (ТекПользователь.ШаблонПрав = Справочники.Пользователи.ПустаяСсылка()) Тогда
			ДобавитьСтрокуТаблицы(ТаблицаОписания,ТекПользователь.Ссылка,Истина,ПереносимыеНастройки);
		Иначе
			ДобавитьСтрокуТаблицы(ТаблицаОписания,ТекПользователь.Ссылка,Ложь,ПереносимыеНастройки);
        КонецЕсли;
		                                                                                                                 
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСтрокуТаблицы(ТаблицаОписания,Пользователь,ЭтоШаблонПрав,ПереносимыеНастройки)Экспорт
	
	Поиск =Неопределено; //ТаблицаОписания.Найти(Пользователь,"Пользователь");
	Если (Поиск = Неопределено) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ПраваИНастройки.Значение,
		                      |	ПраваИНастройки.ПравоНастройка
		                      |ИЗ
		                      |	РегистрСведений.ПраваИНастройки КАК ПраваИНастройки
		                      |ГДЕ
		                      |	ПраваИНастройки.Объект = &Объект
		                      |	И ПраваИНастройки.ПравоНастройка В ИЕРАРХИИ(&ПраваНастройки)");
		Запрос.УстановитьПараметр("ПраваНастройки",ПланыВидовХарактеристик.ПраваИНастройки.CRM);
		
		Если Пользователь.ЯвляетсяШаблоном Тогда
			Запрос.УстановитьПараметр("Объект",Пользователь);
		Иначе
			Если ЭтоШаблонПрав Тогда
				Запрос.УстановитьПараметр("Объект",Пользователь);
			Иначе
				Запрос.УстановитьПараметр("Объект",Пользователь.ШаблонПрав);
			КонецЕсли;
			
		КонецЕсли;
		
		Таблица = Запрос.Выполнить().Выгрузить();
		ТекСтрока = ТаблицаОписания.Добавить();
		ТекСтрока.Пользователь = Пользователь;
		ТекСтрока.ЭтоШаблонПрав = ЭтоШаблонПрав;
		Для Каждого Настройка Из ПереносимыеНастройки Цикл
			Параметр = Таблица.Найти(Настройка.Значение,"ПравоНастройка");
			Если Не (Параметр = Неопределено) Тогда
				ТекСтрока[Настройка.Имя] = Параметр.Значение;
			Иначе
				ТекСтрока[Настройка.Имя] = Неопределено;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

Процедура СвенутьТаблицуОписания(ТаблицаОписания,ПереносимыеНастройки)Экспорт
	СтрокаКогоСвернуть ="";
	СтрокаКогоСуммировать ="Пользователь";
	Для Каждого Настройка Из ПереносимыеНастройки Цикл
		СтрокаКогоСвернуть =Настройка.Имя +" ,"+ СтрокаКогоСвернуть;
	КонецЦикла;
	КопияТаблицы = ТаблицаОписания.Скопировать();
	СернутаяТаблица = ТаблицаОписания.Скопировать(); 
	СернутаяТаблица.Свернуть(СтрокаКогоСвернуть,СтрокаКогоСуммировать);
	Для Каждого ТекСтрока Из СернутаяТаблица Цикл
		Отбор = СформироватьОтборТаблицыОписаний(ПереносимыеНастройки,ТекСтрока,Истина);
		НайденныеСтроки = КопияТаблицы.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() =0 Тогда
			отбор = СформироватьОтборТаблицыОписаний(ПереносимыеНастройки,ТекСтрока,Ложь);
			НайденныеСтроки = КопияТаблицы.НайтиСтроки(Отбор);
		КонецЕсли;
		Если НайденныеСтроки.Количество()>0 тогда
			ТекСтрока.Пользователь = НайденныеСтроки[0].Пользователь;
		КонецЕсли;
		Отбор = СформироватьОтборТаблицыОписаний(ПереносимыеНастройки,ТекСтрока);
		СтрокиДляПодстановки  = ТаблицаОписания.НайтиСтроки(Отбор);
		Для Каждого ТекОсновнаяСтрока Из СтрокиДляПодстановки Цикл
			ТекОсновнаяСтрока.НовыйШаблонНастроек = ТекСтрока.пользователь.Наименование;
		КонецЦикла;
	КонецЦикла;
	СоздатьШаблоныНастроек(СернутаяТаблица,ПереносимыеНастройки);	
КонецПроцедуры

Процедура СоздатьШаблоныНастроек(ТаблицаШаблонов,Настройки)Экспорт
	Для Каждого Описание Из ТаблицаШаблонов Цикл
		СоздатьШаблонНастроек(Описание,Описание.Пользователь.Наименование,Настройки);
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьШаблонНастроек(Описание,Наименование,Настройки)Экспорт
	Поиск = Справочники.Renault_ПраваИНастройкиПользователей.НайтиПоНаименованию(Наименование);
	Если (Поиск= Неопределено)ИЛИ (Поиск=Справочники.Renault_ПраваИНастройкиПользователей.ПустаяСсылка()) Тогда
		НовШаблон = Справочники.Renault_ПраваИНастройкиПользователей.СоздатьЭлемент();
		НовШаблон.Наименование = Наименование;
		Если ЗначениеОпределено(Описание.Отдел) И ЗначениеОпределено(Описание.Отдел,Справочники.CRM_Отделы.ПустаяСсылка()) Тогда
			НовШаблон.ДилерскийЦентр = Описание.Отдел.ДилерскийЦентр;
		КонецЕсли;
		Для Каждого Настройка Из Настройки Цикл
			Значение = Описание[Настройка.Имя];
			Если ЗначениеОпределено(Значение) Тогда
				НовШаблон[Настройка.Имя]= Значение;
			КонецЕсли;

		КонецЦикла;
		НовШаблон.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция ЗначениеОпределено(Значение,Сравнение = Неопределено) Экспорт
	Возврат НЕ(Значение = Сравнение);
КонецФункции

Процедура  СопоставитьШаблоныИПользователей(ТаблицаОписания) Экспорт
	
	Для Каждого Описание из ТаблицаОписания Цикл
		Менеджер = РегистрыСведений.Renault_ПользователиИШаблоныПравИНастроек.СоздатьМенеджерЗаписи();
		Менеджер.Пользователь = Описание.Пользователь;
		Шаблон =  НайтиШаблонПоНаименованию(Описание.НовыйШаблонНастроек);
		Если ЗначениеОпределено(Шаблон) и ЗначениеОпределено(Шаблон,Справочники.Renault_ПраваИНастройкиПользователей.ПустаяСсылка()) Тогда
			Менеджер.ПраваИНастройки =  Шаблон;
			менеджер.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиШаблонПоНаименованию(Имя)Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Renault_ПраваИНастройкиПользователей.Ссылка
	                      |ИЗ
	                      |	Справочник.Renault_ПраваИНастройкиПользователей КАК Renault_ПраваИНастройкиПользователей
	                      |ГДЕ
	                      |	Renault_ПраваИНастройкиПользователей.Наименование = &Наименование");
	Запрос.УстановитьПараметр("Наименование",Имя);
	Вып = Запрос.Выполнить().Выгрузить();
	Если Вып.Количество()>0 Тогда
		Возврат Вып[0].Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция СформироватьОтборТаблицыОписаний(ПереносимыеНастройки,ТекСтрока,ЭтоШаблонПрав = Неопределено)Экспорт
	Отбор = Новый Структура();
	Для Каждого Настройка Из ПереносимыеНастройки Цикл
		Отбор.Вставить(Настройка.Имя,ТекСтрока[Настройка.Имя]);
	КонецЦикла;
	Если Не(ЭтоШаблонПрав = Неопределено)Тогда
		Отбор.Вставить("ЭтоШаблонПрав",ЭтоШаблонПрав);
	КонецЕсли;
	Возврат Отбор;
КонецФункции

Функция СформироватьМассивПользователей(Таблица) Экспорт
	МассивПользователей = Новый Массив();	
	
	Возврат МассивПользователей;	
КонецФункции
	