
Функция ПолучитьПрокси()
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	
	// Сериализация полученной таблицы и передача ее в web-сервис
	Адрес = Настройки.АдресWsGate + "ws/ClientsInfo.ws?wsdl";
	ПарольWS = Настройки.ПарольДоступаКВебСервисам;
	ЛогинWS = Настройки.ЛогинДоступаКВебСервисам;
	ОпределениеСервиса = Новый WSОпределения(Адрес, ЛогинWS, ПарольWS);
	ВебСервис = Новый WSПрокси(
		ОпределениеСервиса, 
		"http://renault-nissan.com/schema/ClientsInfo", // ПРОВЕРИТЬ 
		"Renault_ClientsInfo",
		"Renault_ClientsInfoSoap12",
		3600);
	ВебСервис.Пользователь	 = ЛогинWS;
	ВебСервис.Пароль		 = ПарольWS;
	
	Возврат ВебСервис;
	                         
КонецФункции

Процедура Renault_ЗагрузкаКлиентскихДанных() Экспорт
		
	ДатаАктуальности = Константы.Renault_ДатаАктуальностиЦентрализованныхКлиентскихДанных.Получить();
	ВебСервис = ПолучитьПрокси();
	Server = СтрокаСоединенияИнформационнойБазы();
	BIR = Константы.Renault_BIR_db.Получить();
	
	//ЗагрузитьРассылки(ВебСервис, ДатаАктуальности, Server, BIR);
	//ЗагрузитьОпросы(ВебСервис, ДатаАктуальности, Server, BIR);
	ЗагрузитьПродукты(ВебСервис, ДатаАктуальности, Server, BIR);
	
КонецПроцедуры

Процедура ЗагрузитьРассылки(ВебСервис, ДатаАктуальности, Server, BIR)
	
	СериализованнаяТаблицаРассылок = ВебСервис.GetCampainsInfo(ДатаАктуальности, Server, BIR); //ДОПОЛНИТЬ
	
	Фабрика = ВебСервис.ФабрикаXDTO;
	Сериализатор = Новый СериализаторXDTO(Фабрика);
	ТаблицаРассылок = Сериализатор.ПрочитатьXDTO(СериализованнаяТаблицаРассылок);
	
	Для Каждого Строка Из ТаблицаРассылок Цикл		
				
		Запись = РегистрыСведений.Renault_ЦентрализованныеРассылки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Строка);
		Запись.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьОпросы(ВебСервис, ДатаАктуальности, Server, BIR)
	
	СериализованнаяТаблицаОпросов = ВебСервис.GetSurveysInfo(ДатаАктуальности, Server, BIR); //ДОПОЛНИТЬ
	
	Фабрика = ВебСервис.ФабрикаXDTO;
	Сериализатор = Новый СериализаторXDTO(Фабрика);
	ТаблицаОпросов = Сериализатор.ПрочитатьXDTO(СериализованнаяТаблицаОпросов);
	
	Для Каждого Строка Из ТаблицаОпросов Цикл		
				
		Запись = РегистрыСведений.Renault_ЦентрализованныеОпросы.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Строка);
		Запись.Записать();
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗагрузитьПродукты(ВебСервис, ДатаАктуальности, Server, BIR)
	
	СериализованнаяТаблицаПродуктов = ВебСервис.GetProductsInfo(ДатаАктуальности, Server, BIR); //ДОПОЛНИТЬ
	
	Фабрика = ВебСервис.ФабрикаXDTO;
	Сериализатор = Новый СериализаторXDTO(Фабрика);
	ТаблицаПродуктов = Сериализатор.ПрочитатьXDTO(СериализованнаяТаблицаПродуктов);
	
	Для Каждого Строка Из ТаблицаПродуктов Цикл		
				
		Запись = РегистрыСведений.Renault_ЦентрализованныеПродукты.СоздатьМенеджерЗаписи();
		Запись.Идентификатор = Строка.garantee_id;
		 
		ИдентификаторКлиента = Новый УникальныйИдентификатор(Строка.dms_client_id);
		СсылкаНаКлиента = Справочники.Контрагенты.ПолучитьСсылку(ИдентификаторКлиента);
		Если Не ЗначениеЗаполнено(СсылкаНаКлиента.ПолучитьОбъект()) Тогда
			СсылкаНаКлиента = Справочники.CRM_ПотенциальныеКонтрагенты.ПолучитьСсылку(ИдентификаторКлиента);
		КонецЕсли;
		Если ЗначениеЗаполнено(СсылкаНаКлиента) Тогда
			Запись.Клиент = СсылкаНаКлиента;
		КонецЕсли;
		
		Запись.VIN = Строка.vin;
		Запись.ДатаНачалаДействияГарантии = Строка.gar_start_date_Formated;
		Запись.ДатаОкончанияДействияГарантии = Строка.gar_end_date_Formated;
		Запись.ДатаОкончанияДействияПродленнойГарантии = Строка.ext_gar_end_date_Formated;
		Запись.ДатаПродажиКарты = Строка.contract_date_Formated;
		Запись.Стоимость = Строка.cost;
		Запись.НомерКарты = Строка.card;
		Запись.ПробегНаДатуПродажиКарты = Строка.run;
		Если Строка.type = 1 Тогда
			Запись.ТипКарты = "Пр.гарантия";
		ИначеЕсли Строка.type = 2 Тогда
			Запись.ТипКарты = "SARA";
		ИначеЕсли Строка.type = 3 Тогда
			Запись.ТипКарты = "Кредит RN-Банка";
		КонецЕсли;			
		Запись.Действующая = Строка.active;
		
		Запись.СуммаКредита = Строка.Loan_Amount_Total;		
		Запись.ДатаВыдачиКредита = Строка.Date_Agreement;
				
		Запись.Записать();
		
	КонецЦикла;

КонецПроцедуры