//Функция ПолучитьНаименованиеБСО(СтраховойПолис) Экспорт
//	Если СтраховойПолис.ВидСтрахования=Перечисления.ВидыСтрахования.КАСКО Тогда Возврат Справочники.Renault_БСО_НаименованияБланковСтрогойОтчетности.КАСКО
//	ИначеЕсли СтраховойПолис.ВидСтрахования=Перечисления.ВидыСтрахования.ОСАГО Тогда Возврат Справочники.Renault_БСО_НаименованияБланковСтрогойОтчетности.ОСАГО
//	ИначеЕсли СтраховойПолис.ВидСтрахования=Перечисления.ВидыСтрахования.МедицинскоеСтрахование Тогда Возврат Справочники.Renault_БСО_НаименованияБланковСтрогойОтчетности.МедицинскоеСтрахование
//	ИначеЕсли СтраховойПолис.ВидСтрахования=Перечисления.ВидыСтрахования.СтрахованиеИмущества Тогда Возврат Справочники.Renault_БСО_НаименованияБланковСтрогойОтчетности.СтрахованиеИмущества
//	Иначе Возврат Неопределено	
//	КонецЕсли;	
//КонецФункции	

Функция РазобратьДатуВСтруктуру(ТекДата, КлючевоеИмя)
	Результат	= Новый Структура;
	
	Если обЗначениеНеЗаполнено(ТекДата) Тогда Возврат Результат; КонецЕсли;
	
	ТекЧас		= Час (ТекДата);
	ТекМинута	= Минута(ТекДата);
	ТекДень		= День(ТекДата);
	ТекМесяц	= Месяц(ТекДата);
	ТекГод		= Год(ТекДата);	
	
	Если ТекЧас>9 Тогда
		Результат.Вставить(КлючевоеИмя+"Ч1", Сред(ТекЧас,1,1));
		Результат.Вставить(КлючевоеИмя+"Ч2", Сред(ТекЧас,2,1));
	Иначе
		Результат.Вставить(КлючевоеИмя+"Ч1", "0");
		Результат.Вставить(КлючевоеИмя+"Ч2", Строка(ТекЧас));
	КонецЕсли;
	
	Если ТекМинута>9 Тогда
		Результат.Вставить(КлючевоеИмя+"Мин1", Сред(ТекМинута,1,1));
		Результат.Вставить(КлючевоеИмя+"Мин2", Сред(ТекМинута,2,1));
	Иначе
		Результат.Вставить(КлючевоеИмя+"Мин1", "0");
		Результат.Вставить(КлючевоеИмя+"Мин2", Строка(ТекМинута));
	КонецЕсли;
	
	Если ТекДень>9 Тогда
		Результат.Вставить(КлючевоеИмя+"Д1", Сред(ТекДень,1,1));
		Результат.Вставить(КлючевоеИмя+"Д2", Сред(ТекДень,2,1));
	Иначе
		Результат.Вставить(КлючевоеИмя+"Д1", "0");
		Результат.Вставить(КлючевоеИмя+"Д2", Строка(ТекДень));
	КонецЕсли;
	
	Если ТекМесяц>9 Тогда
		Результат.Вставить(КлючевоеИмя+"М1", Сред(ТекМесяц,1,1));
		Результат.Вставить(КлючевоеИмя+"М2", Сред(ТекМесяц,2,1));
	Иначе
		Результат.Вставить(КлючевоеИмя+"М1", "0");
		Результат.Вставить(КлючевоеИмя+"М2", Строка(ТекМесяц));
	КонецЕсли;
	
	Результат.Вставить(КлючевоеИмя+"Г1", Сред(ТекГод,4,1));
	Результат.Вставить(КлючевоеИмя+"Г2", Сред(ТекГод,5,1));	
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция Печать(Ссылка,ФормаВладелец) Экспорт
	Перем ТабДок;
	
	Сп=Новый СписокЗначений;
	Сп.Добавить("КвитанцияНаПолучениеСтраховойПремии","Квитанция на получение страховой премии");
	Сп.Добавить("СтраховойПолис","Страховой полис");
	//Сп.Добавить("Счет","Счет на оплату");
	
	Парам=Новый Структура;
	Парам.Вставить("Список",Сп);
	Парам.Вставить("Заголовок","Печатная форма");
	//Парам.Вставить("МножественныйВыбор",Ложь);
	//Парам.Вставить("КоличествоЭлементовВСтроке",3);
	Парам.Вставить("ШиринаЭлемента",0);
	Парам.Вставить("ВысотаЭлемента",2);
	ИмяФормы=ОткрытьФормуМодально("ОбщаяФорма.Renault_ДиалогВыбораСпискаЗначений",Парам,ФормаВладелец);
	Если ИмяФормы="КвитанцияНаПолучениеСтраховойПремии" Тогда ТабДок=ПечатьКвитанцияНаПолучениеСтраховойПремии(Ссылка) 
	ИначеЕсли ИмяФормы="СтраховойПолис" Тогда ТабДок=ПечатьСтраховойПолис(Ссылка)
	//ИначеЕсли ИмяФормы="Счет" Тогда ТабДок=ПечатьСчета(Ссылка) 		
	КонецЕсли;
	
	Если ТабДок<>Неопределено Тогда
		Форма=ПолучитьФорму("ОбщаяФорма.ПечатнаяФормаДокументов",,ФормаВладелец.УникальныйИдентификатор);
		Форма.Объект=Ссылка;
		Форма.ЭлементыФормы.ТабличныйДокумент.Вывести(ТабДок);
		Форма.Открыть();
	КонецЕсли;	
	
КонецФункции // Печать()

&НаКлиенте
Функция ПечатьСтраховойПолис(Ссылка) Экспорт
	ТабДокумент=Новый ТабличныйДокумент;
	
	////валюта печати	
	//ВалютаПечатногоДокумента = зфВыборВалютыПечатногоДокумента(Ссылка);
	//Если ВалютаПечатногоДокумента = Неопределено Тогда
	//	Возврат Неопределено;
	//КонецЕсли;
	//КоэффициентПересчета= обПересчет(1, Ссылка.ВалютаДокумента, Ссылка.КурсДокумента, ВалютаПечатногоДокумента, Ссылка.Дата);
	//ФорматВыводаСуммы	= обПраво("ФорматВыводаСуммы",Права,,Ссылка);
	ВалютаПечатногоДокумента=Справочники.Валюты.НайтиПоКоду("643");
	
	// приступим к печати
	Макет = Документы.СтраховойПолис.ПолучитьМакет("СтраховойПолис");	
	
	ОбластьШапка			= Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблицы		= Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока			= Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал			= Макет.ПолучитьОбласть("Подвал");
	
	СтруктураШапки	= Новый Структура();
	СтруктураШапки.Вставить("НаименованиеПоставщика",	спПолучитьПредставление(Ссылка.Организация));
	СтруктураШапки.Вставить("СерияПолиса",				Ссылка.СерияБСО.Наименование);
	СтруктураШапки.Вставить("НомерПолиса",				Ссылка.НомерБСО);
	
	// Посимвольный вывод даты начала и окончания страхования
	Если НЕ обЗначениеНеЗаполнено(Ссылка.ДатаНачалаСтрахования) И
		НЕ обЗначениеНеЗаполнено(Ссылка.ДатаОкончанияСтрахования)Тогда		
		// Дата начала страхования
		СтруктураДаты	= РазобратьДатуВСтруктуру(Ссылка.ДатаНачалаСтрахования, "ДатаНачалаСтрахования");
		Для Каждого ТекСтрока Из СтруктураДаты Цикл
			СтруктураШапки.Вставить(ТекСтрока.Ключ, ТекСтрока.Значение);
		КонецЦикла;
		// Дата окончания страхования
		СтруктураДаты	= РазобратьДатуВСтруктуру(Ссылка.ДатаОкончанияСтрахования, "ДатаОкончанияСтрахования");
		Для Каждого ТекСтрока Из СтруктураДаты Цикл
			СтруктураШапки.Вставить(ТекСтрока.Ключ, ТекСтрока.Значение);
		КонецЦикла;			
	КонецЕсли;
	
	// Посимвольный вывод дат использования ТС
	Если НЕ обЗначениеНеЗаполнено(Ссылка.ДатаНачалаИспользованияТС1) И
		НЕ обЗначениеНеЗаполнено(Ссылка.ДатаОкончанияИспользованияТС1) Тогда
		// Дата начала использования ТС
		СтруктураДаты	= РазобратьДатуВСтруктуру(Ссылка.ДатаНачалаИспользованияТС1, "ДатаНачалаИспользованияТС1");
		Для Каждого ТекСтрока Из СтруктураДаты Цикл
			СтруктураШапки.Вставить(ТекСтрока.Ключ, ТекСтрока.Значение);
		КонецЦикла;
		// Дата окончания использования ТС
		СтруктураДаты	= РазобратьДатуВСтруктуру(Ссылка.ДатаОкончанияИспользованияТС1, "ДатаОкончанияИспользованияТС1");
		Для Каждого ТекСтрока Из СтруктураДаты Цикл
			СтруктураШапки.Вставить(ТекСтрока.Ключ, ТекСтрока.Значение);
		КонецЦикла;		
	КонецЕсли;
	
	// Посимвольный вывод дат использования ТС
	Если НЕ обЗначениеНеЗаполнено(Ссылка.ДатаНачалаИспользованияТС2) И
		НЕ обЗначениеНеЗаполнено(Ссылка.ДатаОкончанияИспользованияТС2) Тогда
		// Дата начала использования ТС
		СтруктураДаты	= РазобратьДатуВСтруктуру(Ссылка.ДатаНачалаИспользованияТС2, "ДатаНачалаИспользованияТС2");
		Для Каждого ТекСтрока Из СтруктураДаты Цикл
			СтруктураШапки.Вставить(ТекСтрока.Ключ, ТекСтрока.Значение);
		КонецЦикла;
		// Дата окончания использования ТС
		СтруктураДаты	= РазобратьДатуВСтруктуру(Ссылка.ДатаОкончанияИспользованияТС2, "ДатаОкончанияИспользованияТС2");
		Для Каждого ТекСтрока Из СтруктураДаты Цикл
			СтруктураШапки.Вставить(ТекСтрока.Ключ, ТекСтрока.Значение);
		КонецЦикла;		
	КонецЕсли;
	
	// Посимвольный вывод дат использования ТС
	Если НЕ обЗначениеНеЗаполнено(Ссылка.ДатаНачалаИспользованияТС3) И
		НЕ обЗначениеНеЗаполнено(Ссылка.ДатаОкончанияИспользованияТС3) Тогда
		// Дата начала использования ТС
		СтруктураДаты	= РазобратьДатуВСтруктуру(Ссылка.ДатаНачалаИспользованияТС3, "ДатаНачалаИспользованияТС3");
		Для Каждого ТекСтрока Из СтруктураДаты Цикл
			СтруктураШапки.Вставить(ТекСтрока.Ключ, ТекСтрока.Значение);
		КонецЦикла;
		// Дата окончания использования ТС
		СтруктураДаты	= РазобратьДатуВСтруктуру(Ссылка.ДатаОкончанияИспользованияТС3, "ДатаОкончанияИспользованияТС3");
		Для Каждого ТекСтрока Из СтруктураДаты Цикл
			СтруктураШапки.Вставить(ТекСтрока.Ключ, ТекСтрока.Значение);
		КонецЦикла;		
	КонецЕсли;	
	
	СтруктураШапки.Вставить("Страхователь",			Ссылка.Контрагент);
	СтруктураШапки.Вставить("СобственникТС",		Ссылка.СобственникТС);
	СтруктураШапки.Вставить("ТранспортноеСредство",	Ссылка.Автомобиль);
	Если НЕ обЗначениеНеЗаполнено(Ссылка.Автомобиль) Тогда
		ГосНомер   = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Ссылка.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
		ПТС	= Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Ссылка.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ТехПаспорт);
		
		СтруктураШапки.Вставить("ГосНомер",			ГосНомер);
		Если ТипЗнч(Ссылка.Автомобиль)=Тип("СправочникСсылка.Автомобили") И НЕ ПустаяСтрока(Ссылка.Автомобиль.VIN) Тогда
			СтрокаДляРазбора	= СокрЛП(Ссылка.Автомобиль.VIN);
			Счетчик	= 1;
			ДлинаСтрокиРазбора	= СтрДлина(СтрокаДляРазбора);
			Для Индекс=1 По ДлинаСтрокиРазбора Цикл
				// Не может быть больше 17 символов
				Если Счетчик=18 Тогда Прервать; КонецЕсли;
				
				ТекСимвол	= Сред(СтрокаДляРазбора, Индекс, 1);
				СтруктураШапки.Вставить("VIN"+Индекс,	ТекСимвол);
				Счетчик	= Счетчик+1;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ обЗначениеНеЗаполнено(ПТС) Тогда
		СтруктураШапки.Вставить("ВидПТС",	ПТС.ВидПодтверждающегоДокумента);
		СтруктураШапки.Вставить("СерияПТС",	ПТС.Серия);
		СтруктураШапки.Вставить("НомерПТС",	ПТС.Номер);
	КонецЕсли;
	
	Если Ссылка.ВидДействияДоговора=1 Тогда
		СтруктураШапки.Вставить("ВидДействияДоговора1",	"Х");
		СтруктураШапки.Вставить("ВидДействияДоговора2",	"");
	Иначе
		СтруктураШапки.Вставить("ВидДействияДоговора1",	"");
		СтруктураШапки.Вставить("ВидДействияДоговора2",	"Х");		
	КонецЕсли;
			
	ОбластьШапка.Параметры.Заполнить(СтруктураШапки);
	ТабДокумент.Вывести(ОбластьШапка);
	
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	//сразу два, т.к. выводим на второй странице только
	НомерСтраницы		= 2;
	НомерСтраницыПред	= НомерСтраницы;
	Счетчик				= 0;
	СтруктураИтоговПоСтранице	= Новый Структура();
	
	//перебор строк
	ВыборкаТабличнойЧасти = Ссылка.ЛицаДопущенныеКУправлениюТС;
	Для Каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
		Счетчик	= Счетчик + 1;
		
		//заполняем данные строки
		СтруктураСтроки = Новый Структура();
		СтруктураСтроки.Вставить("Номер",	Счетчик);
		СтруктураСтроки.Вставить("ЛицоДопущенное", СтрокаТабличнойЧасти.ЛицоДопущенное);
		Если НЕ обЗначениеНеЗаполнено(СтрокаТабличнойЧасти.ВодительскоеУдостоверение) Тогда
			Удостоверение	= СтрокаТабличнойЧасти.ВодительскоеУдостоверение;
			СерияНомер		= Удостоверение.Серия+" "+Удостоверение.Номер;
			СтруктураСтроки.Вставить("ВодительскоеУдостоверение",	СерияНомер);
		КонецЕсли;
		ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);
		
		//доп. области
		мсвДопОбластиПодвала = Неопределено;
		//Если ВыборкаТабличнойЧасти.Индекс(СтрокаТабличнойЧасти) = ВыборкаТабличнойЧасти.Количество()-1 Тогда
		//	мсвДопОбластиПодвала = Новый Массив;
		//	мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
		//КонецЕсли;
		
		//выводим строку, делая проверку попадания на лист
		//НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрока, ОбластьШапкаТаблицы, ,НомерСтраницы, СтруктураИтоговПоСтранице, Ссылка, мсвДопОбластиПодвала);
		
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			НомерСтраницыПред = НомерСтраницы; 
		КонецЕсли;
	КонецЦикла;
	
	// На странице должно быть как минимум 5 строк
	Если Счетчик<5 Тогда
		ЧислоЦиклов	= 5-Счетчик;
		Для Индекс=1 По ЧислоЦиклов Цикл
			ОбластьСтрока.Параметры.Номер		= "";
			ОбластьСтрока.Параметры.ЛицоДопущенное	= "";
			ОбластьСтрока.Параметры.ВодительскоеУдостоверение	= "";
			ТабДокумент.Вывести(ОбластьСтрока);			
		КонецЦикла;
	КонецЕсли;
	
	СтруктураПодвала	= Новый Структура();
	СтруктураПодвала.Вставить("СуммаПремии",			Ссылка.СуммаПремии);
	СтруктураПодвала.Вставить("СуммаПремииПрописью",	обЧислоПрописью(Ссылка.СуммаПремии, ВалютаПечатногоДокумента));
	
	ДатаДляВывода	= Ссылка.Дата;
	Если НЕ обЗначениеНеЗаполнено(ДатаДляВывода) Тогда
		ТекДень		= День(ДатаДляВывода); ТекМесяц	= Месяц(ДатаДляВывода); ТекГод		= Год(ДатаДляВывода);	
		
		СтруктураПодвала.Вставить("ДеньЗаключения", Строка(ТекДень));
		СтруктураПодвала.Вставить("МесяцЗаключения", Строка(ТекМесяц));
		СтруктураПодвала.Вставить("ГодЗаключения", Сред(ТекГод,4));
	КонецЕсли;
	
	ДатаДляВывода	= Ссылка.ДатаВыдачи;
	Если НЕ обЗначениеНеЗаполнено(ДатаДляВывода) Тогда
		ТекДень		= День(ДатаДляВывода); ТекМесяц	= Месяц(ДатаДляВывода); ТекГод		= Год(ДатаДляВывода);	
		
		СтруктураПодвала.Вставить("ДеньПолиса", Строка(ТекДень));
		СтруктураПодвала.Вставить("МесяцПолиса", Строка(ТекМесяц));
		СтруктураПодвала.Вставить("ГодПолиса", Сред(ТекГод,4));
	КонецЕсли;		
	
	СтруктураПодвала.Вставить("ФИОСтраховщика",	"                                           ");
	
	ОбластьПодвал.Параметры.Заполнить(СтруктураПодвала);
	ТабДокумент.Вывести(ОбластьПодвал);	
	
	// Зададим параметры макета
	ТабДокумент.ПолеСверху			= 10;
	ТабДокумент.ПолеСлева			= 10;
	ТабДокумент.ПолеСнизу			= 10;
	ТабДокумент.ПолеСправа			= 10;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабДокумент.Автомасштаб			= Истина;
	
	Возврат ТабДокумент;
КонецФункции

&НаКлиенте
Функция ПечатьКвитанцияНаПолучениеСтраховойПремии(Ссылка) Экспорт
	ТабДокумент=Новый ТабличныйДокумент;
	//ВалютаПечатногоДокумента = зфВыборВалютыПечатногоДокумента(Ссылка);
	//Если ВалютаПечатногоДокумента = Неопределено Тогда Возврат Неопределено КонецЕсли;
	
	ВалютаПечатногоДокумента=Справочники.Валюты.НайтиПоКоду("643");
	
	// КоэффициентПересчета= обПересчет(1, Ссылка.ВалютаДокумента, Ссылка.КурсДокумента, ВалютаПечатногоДокумента, Ссылка.Дата);	
	//ФорматВыводаСуммы	= обПраво("ФорматВыводаСуммы",Права,,Ссылка);
	
	// Необходимо отдельно выводить целую часть суммы прописью без валюты и отдельно дробную
	ДробнаяЧасть		= Ссылка.СуммаПремии-Цел(Ссылка.СуммаПремии);	
	Если ДробнаяЧасть=0 Тогда
		ДробнаяЧасть	= "00";
	Иначе
		ДробнаяЧасть	= Сред(Формат(ДробнаяЧасть,"ЧДЦ=2"), 3);	
	КонецЕсли;	
	СуммаПремииПрописью	= обЧислоПрописью(Ссылка.СуммаПремии, ВалютаПечатногоДокумента, "Л=ru_RU;НП=Ложь;НД=Ложь;ДП=Ложь");
    Позиция	= найти(СуммаПремииПрописью, ДробнаяЧасть);
	Если Позиция>0 Тогда
		СуммаПремииПрописью	= Лев(СуммаПремииПрописью, Позиция-2);
	КонецЕсли;
	Позиция	= 0;
	Для Индекс=1 По СтрДлина(СуммаПремииПрописью)Цикл
		Если Сред(СуммаПремииПрописью, Индекс,1)=" " Тогда
			Позиция	= Индекс;
		КонецЕсли;
	КонецЦикла;
	Если Позиция>0 Тогда
		СуммаПремииПрописью	= Лев(СуммаПремииПрописью, Позиция-1);
	КонецЕсли;
	
	ДатаОплаты	= Формат(Ссылка.Дата, "ДЛФ=DD");
	Позиция	= Найти(ДатаОплаты, " ");
	Если Позиция>0 Тогда
		ДатаОплаты	= Сред(ДатаОплаты, Позиция+1);
	КонецЕсли;	
	
	// приступим к печати
	Макет = Документы.СтраховойПолис.ПолучитьМакет("КвитанцияНаПолучениеСтраховойПремии");	
	
	ОбластьШапка=Макет.ПолучитьОбласть("Шапка");
	
	СтруктураШапки	= Новый Структура();
	СтруктураШапки.Вставить("НаименованиеПоставщика",		спПолучитьПредставление(Ссылка.Организация));
	СтруктураШапки.Вставить("СерияКвитанции",				Ссылка.СерияБСО);
	СтруктураШапки.Вставить("НомерКвитанции",				Ссылка.НомерБСО);
	СтруктураШапки.Вставить("ПодразделениеКомпании",		Ссылка.ТочкаПродаж);
	СтруктураШапки.Вставить("СерияНомерСтраховогоПолиса",	""+Ссылка.СерияБСО+"  "+Ссылка.НомерБСО);
	СтруктураШапки.Вставить("Страхователь",					Ссылка.Контрагент);
	Если НЕ обЗначениеНеЗаполнено(Ссылка.ФинансоваяУслуга) Тогда
		СтруктураШапки.Вставить("ВидСтрахования",			Ссылка.ФинансоваяУслуга.ВидУслуги);
	КонецЕсли;
	СтруктураШапки.Вставить("ВалютаПечатногоДокумента",		?(Найти(НРег(ВалютаПечатногоДокумента),"руб")>0, "руб.", ВалютаПечатногоДокумента));
	
	СтруктураШапки.Вставить("СуммаПремииЦелая",				СуммаПремииПрописью);
	СтруктураШапки.Вставить("СуммаПремииДробная",			ДробнаяЧасть);
	Если НЕ Ссылка.ОплатаЧерезБанк Тогда
		СтруктураШапки.Вставить("ОплатаНаличными",				"Х");
		СтруктураШапки.Вставить("ОплатаКарточкой",				"");
		СтруктураШапки.Вставить("СуммаПремииНаличнымиЦелая",	СуммаПремииПрописью);
		СтруктураШапки.Вставить("СуммаПремииНаличнымиДробная",	ДробнаяЧасть);
		СтруктураШапки.Вставить("СуммаПремииКартойЦелая",		"");
		СтруктураШапки.Вставить("СуммаПремииКартойДробная",		"");
	Иначе
		СтруктураШапки.Вставить("ОплатаНаличными",				"");
		СтруктураШапки.Вставить("ОплатаКарточкой",				"Х");
		СтруктураШапки.Вставить("СуммаПремииНаличнымиЦелая",	"");
		СтруктураШапки.Вставить("СуммаПремииНаличнымиДробная",	"");
		СтруктураШапки.Вставить("СуммаПремииКартойЦелая",		СуммаПремииПрописью);
		СтруктураШапки.Вставить("СуммаПремииКартойДробная",		ДробнаяЧасть);
	КонецЕсли;
	
	СтруктураШапки.Вставить("ДолжностьСтраховщика",	Ссылка.ДолжностьСтраховщика);
	
	СтруктураШапки.Вставить("Страховщик",					Ссылка.СтраховаяКомпания);
	СтруктураШапки.Вставить("ДеньОплаты",					""""+День(Ссылка.Дата)+"""");
	СтруктураШапки.Вставить("ДатаОплаты",					Ссылка.Дата);	
			
	ОбластьШапка.Параметры.Заполнить(СтруктураШапки);
	ТабДокумент.Вывести(ОбластьШапка);
		
	// Зададим параметры макета
	ТабДокумент.ПолеСверху			= 5;
	ТабДокумент.ПолеСлева			= 5;
	ТабДокумент.ПолеСнизу			= 5;
	ТабДокумент.ПолеСправа			= 5;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабДокумент.Автомасштаб			= Ложь;
	
	Возврат ТабДокумент;
КонецФункции

//&НаКлиенте
//Функция ПечатьСчета(Ссылка) Экспорт
//	ТабДок=Новый ТабличныйДокумент;
//	
//	//СуммаКОплате=?(ГрафикОплаты.Количество()=0,Ссылка.СуммаПремии,Ссылка.ГрафикОплаты[0].Сумма);
//	//Если НЕ ВвестиЧисло(СуммаКОплате, "Введите сумму оплаты", 15, 2) ИЛИ СуммаКОплате = 0 Тогда Возврат КонецЕсли;
//	//
//	////создадим документ Счет на оплату покупателю
//	//КоличествоСчетов = ОпределитьКоличествоСчетов(ЗаказПокупателя);
//	//НомерСПолиса = ?(ЗначениеЗаполнено(СерияБСО), СокрЛП(СерияБСО) + " ", "") + СокрЛП(НомерБСО);
//	//НомерСчета = ?(КоличествоСчетов = 0, НомерСПолиса, НомерПолиса + "/" + Число(КоличествоСчетов + 1));
//	//
//	//ДокументСчет = Документы.СчетНаОплатуПокупателю.СоздатьДокумент();
//	//
//	//ДокументСчет.Заполнить(Ссылка.ЗаказПокупателя);
//	//
//	//СтрокаУслуг = ДокументСчет.Услуги.Добавить();
//	//СтрокаУслуг.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию("Страхование");
//	//СтрокаУслуг.Цена         = СуммаКОплате;
//	//СтрокаУслуг.Сумма        = СуммаКОплате;
//	//СтрокаУслуг.СтавкаНДС    = Перечисления.СтавкиНДС.БезНДС;
//	//СтрокаУслуг.СуммаНДС     = 0;
//	//СтрокаУслуг.Содержание   = ?(ЗначениеЗаполнено(СтрокаУслуг.Номенклатура.НаименованиеПолное), СтрокаУслуг.Номенклатура.НаименованиеПолное, СтрокаУслуг.Номенклатура.Наименование); 
//	//СтрокаУслуг.Количество   = 1;
//	//
//	//ДокументСчет.Дата = ТекущаяДата();
//	//ДокументСчет.Комментарий = "Сформирован из документа " + Ссылка;
//	//ДокументСчет.СтруктурнаяЕдиница	= ДокументСчет.Организация.ОсновнойБанковскийСчет;
//	//
//	//ДокументСчет.Записать();	
//	//
//	//ОрганизацияПродавец              = ДокументСчет.Организация;
//	//БанкПолучателяПредставление      = ДокументСчет.Ссылка.СтруктурнаяЕдиница.Банк;
//	//СчетПолучателяПредставление      = ДокументСчет.Ссылка.СтруктурнаяЕдиница.НомерСчета;
//	//БИКБанкаПолучателя 				 = БанкПолучателяПредставление.Код;
//	//СчетБанкаПолучателяПредставление = БанкПолучателяПредставление.КоррСчет;
//	//ИНН 							 = ОрганизацияПродавец.ИНН;
//	//КПП 							 = ОрганизацияПродавец.КПП;
//	//ПредставлениеПоставщика 		 = ОрганизацияПродавец.Наименование;
//	//
//	//Макет = ПолучитьМакет(ИмяМакета);
//	//
//	//ОбластьЗаголовокСчета = Макет.ПолучитьОбласть("ЗаголовокСчета");
//	//ОбластьЗаголовок 	  = Макет.ПолучитьОбласть("Заголовок");
//	//ОбластьПоставщик 	  = Макет.ПолучитьОбласть("Поставщик");
//	//ОбластьПокупатель 	  = Макет.ПолучитьОбласть("Покупатель");
//	//ОбластьШапкаТаблицы   = Макет.ПолучитьОбласть("ШапкаТаблицы");
//	//ОбластьСтрока 		  = Макет.ПолучитьОбласть("Строка");
//	//ОбластьИтого 		  = Макет.ПолучитьОбласть("Итого");
//	//ОбластьИтогоНДС 	  = Макет.ПолучитьОбласть("ИтогоНДС");
//	//ОбластьСуммаПрописью  = Макет.ПолучитьОбласть("СуммаПрописью");
//	//ОбластьПодвалСчета 	  = Макет.ПолучитьОбласть("ПодвалСчета");
//	//
//	//ТаблДок = Новый ТабличныйДокумент;
//	//
//	//ТаблДок.АвтоМасштаб        = Истина;
//	//ТаблДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
//	//
//	//ОбластьЗаголовокСчета.Параметры.БанкПолучателяПредставление 	 = БанкПолучателяПредставление;
//	//ОбластьЗаголовокСчета.Параметры.БИКБанкаПолучателя 				 = БИКБанкаПолучателя;
//	//ОбластьЗаголовокСчета.Параметры.СчетБанкаПолучателяПредставление = СчетБанкаПолучателяПредставление;	
//	//ОбластьЗаголовокСчета.Параметры.СчетПолучателяПредставление 	 = СчетПолучателяПредставление;
//	//ОбластьЗаголовокСчета.Параметры.ИНН 							 = ИНН;
//	//ОбластьЗаголовокСчета.Параметры.КПП 							 = КПП;
//	//ОбластьЗаголовокСчета.Параметры.ПредставлениеПоставщика 		 = ПредставлениеПоставщика;
//	//
//	//Заголовок = "Счет № " + НомерСчета + " от " + Формат(ТекущаяДата(), "ДЛФ=DD");
//	//ОбластьЗаголовок.Параметры.ТекстЗаголовка = Заголовок;
//	//
//	//Поставщик  = ПолучитьДанныеОрганизации(ОрганизацияПродавец);
//	//Покупатель = ПолучитьДанныеКонтрагентаЮрФактАдрес(ДокументСчет.Контрагент);
//	//
//	//ОбластьПоставщик.Параметры.ПредставлениеПоставщика 		= Поставщик;
//	//ОбластьПокупатель.Параметры.ПредставлениеПолучателя 	= Покупатель;
//	//
//	//ТаблДок.Вывести(ОбластьЗаголовокСчета);
//	//ТаблДок.Вывести(ОбластьЗаголовок);
//	//ТаблДок.Вывести(ОбластьПоставщик);
//	//ТаблДок.Вывести(ОбластьПокупатель);
//	//ТаблДок.Вывести(ОбластьШапкаТаблицы);
//	//
//	//ОбластьСтрока.Параметры.НомерСтроки = 1;
//	//ОбластьСтрока.Параметры.Товар = "Оплата полиса " + НомерСПолиса + " от " + Формат(Дата, "ДЛФ=Д") + " г., " + Символы.ПС + Плательщик;
//	//
//	//СуммаВсего = ДокументСчет.СуммаДокумента;
//	//ОбластьСтрока.Параметры.Цена = СуммаВсего;
//	//ОбластьСтрока.Параметры.Сумма = СуммаВсего;
//	//ТаблДок.Вывести(ОбластьСтрока);
//	//
//	//ОбластьИтого.Параметры.Всего = СуммаВсего;
//	//ТаблДок.Вывести(ОбластьИтого);
//	//
//	//СуммаНДС = 0;
//	//ОбластьИтогоНДС.Параметры.НДС      = "В том числе НДС:";
//	//ОбластьИтогоНДС.Параметры.ВсегоНДС = "0,00";
//	//ТаблДок.Вывести(ОбластьИтогоНДС);
//	//
//	//ОбластьСуммаПрописью.Параметры.ИтоговаяСтрока = "Всего наименований " + 1 + ", на сумму " + Renault_ОбщегоНазначения.ФорматСумм(СуммаВсего, ДокументСчет.Ссылка.ВалютаДокумента);
//	//ОбластьСуммаПрописью.Параметры.ИтогоПрописью  = Renault_ОбщегоНазначения.СформироватьСуммуПрописью(СуммаВсего, ДокументСчет.Ссылка.ВалютаДокумента);
//	//ТаблДок.Вывести(ОбластьСуммаПрописью);
//	//
//	//Запрос = Новый запрос;
//	//Запрос.Текст = 
//	//"ВЫБРАТЬ
//	//|	ОтветственныеЛицаОрганизацииСрезПоследних.ОтветственноеЛицо,
//	//|	ОтветственныеЛицаОрганизацииСрезПоследних.ФизическоеЛицо.Наименование КАК ФИО
//	//|ИЗ
//	//|	РегистрСведений.ОтветственныеЛицаОрганизации.СрезПоследних(&Дата, СтруктурнаяЕдиница = &Организация) КАК ОтветственныеЛицаОрганизацииСрезПоследних
//	//|ГДЕ
//	//|	(ОтветственныеЛицаОрганизацииСрезПоследних.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизации.Руководитель)
//	//|			ИЛИ ОтветственныеЛицаОрганизацииСрезПоследних.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизации.ГлавныйБухгалтер))";
//	//
//	//Запрос.УстановитьПараметр("Организация" , ОрганизацияПродавец);
//	//
//	//Запрос.УстановитьПараметр("Дата", ДокументСчет.Ссылка.Дата);
//	//Выборка = Запрос.Выполнить().Выбрать();
//	//Пока Выборка.Следующий() Цикл
//	//	Если Выборка.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизации.Руководитель тогда
//	//		ФИОРуководителя =  Выборка.Фио;
//	//	Иначе
//	//		ФИОБухгалтера = Выборка.Фио;
//	//	КонецЕсли;
//	//КонецЦикла;
//	//
//	//ОбластьПодвалСчета.Параметры.ФИОРуководителя = "(" + Renault_ОбщегоНазначения.ФамилияИнициалыФизЛица(ФИОРуководителя) + ")";
//	//ОбластьПодвалСчета.Параметры.ФИОБухгалтера   = "(" + Renault_ОбщегоНазначения.ФамилияИнициалыФизЛица(ФИОБухгалтера)   + ")";
//	//ТаблДок.Вывести(ОбластьПодвалСчета);
//	//
//	//ТаблДок.ОтображатьСетку     = Ложь;
//	//ТаблДок.ОтображатьЗаголовки = Ложь;
//	//ТаблДок.АвтоМасштаб         = Истина;
//	
//	Возврат ТабДок
//КонецФункции


