Перем ТаблицаБСО;

Функция ПолучитьСуммуДокумента() Экспорт
	
	Если ЗаменаБезДоплаты Тогда
		СуммаДокумента = 0;
	ИначеЕсли СуммаДоплаты>0 Тогда
		СуммаДокумента = СуммаДоплаты - СкидкаЗасчетКВ - СуммаДокументаОплачено;
	Иначе
		СуммаДокумента = СуммаПремии - СкидкаЗасчетКВ - СуммаДокументаОплачено;
	КонецЕсли;
	Возврат СуммаДокумента;
	
КонецФункции

//Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
//	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
//	Если РежимЗаписи<>РежимЗаписиДокумента.ОтменаПроведения И  НЕ Ссылка.Пустая() И Ссылка.Проведен Тогда
//		Отказ=Истина;
//		Сообщить("Бланки БСО уже списаны, для исправления отмените проведение",СтатусСообщения.Внимание);
//	КонецЕсли;	
//КонецПроцедуры

//Процедура ОбработкаПроведения(Отказ, Режим)
//	
//	Движения.Renault_БСО_УчетБланковСтрогойОтчетности.Очистить();
//	Движения.Renault_БСО_СтатусыБСО.Очистить();
//	
//	МассивБланков=Новый Массив;
//	Если НомерКвитанции<>"" Тогда
//		МассивБланков.Добавить(Новый Структура("Период,Организация,Подразделение,НаименованиеБСО,СерияБСО,НомерБСО,Количество,Статус",
//			Дата,Организация,Подразделение,Справочники.Renault_БСО_НаименованияБланковСтрогойОтчетности.Квитанция,СерияКвитанции,НомерКвитанции,1,Перечисления.Renault_БСО_СтатусыБланковСтрогойОтчетности.Продан));
//	КонецЕсли;
//	Если НомерПолиса<>"" Тогда
//		МассивБланков.Добавить(Новый Структура("Период,Организация,Подразделение,НаименованиеБСО,СерияБСО,НомерБСО,Количество,Статус",
//			Дата,Организация,Подразделение,Документы.Renault_СтраховойПолис.ПолучитьНаименованиеБСО(ЭтотОбъект),СерияПолиса,НомерПолиса,1,Перечисления.Renault_БСО_СтатусыБланковСтрогойОтчетности.Продан));
//	КонецЕсли;
//		
//	Для Каждого Бланк Из МассивБланков Цикл
//		//проверка остатков БСО
//		Запрос=Новый Запрос("Выбрать КоличествоОстаток Из РегистрНакопления.Renault_БСО_УчетБланковСтрогойОтчетности.Остатки(,
//		|	Организация=&Организация 
//		|	И Подразделение=&Подразделение
//		|	И НаименованиеБСО=&НаименованиеБСО
//		|	И СерияБСО=&СерияБСО
//		|	И НомерБСО=&НомерБСО
//		|)");
//		//Запрос.УстановитьПараметр("Граница",Новый Граница(МоментВремени(),ВидГраницы.Исключая));
//		Для Каждого Эл Из Бланк Цикл Запрос.УстановитьПараметр(Эл.Ключ,Эл.Значение) КонецЦикла;
//		Если Запрос.Выполнить().Выгрузить().Итог("КоличествоОстаток")=0 Тогда
//			Сообщить("Не найден остаток по БСО "+Эл.НаименованиеБСО+", Серия: "+Эл.СерияБСО+", НомерБСО: "+Эл.НомерБСО,СтатусСообщения.Внимание);
//			Отказ=Истина;
//			Продолжить
//		КонецЕсли;
//		
//		//списание остатка
//		Движение=Движения.Renault_БСО_УчетБланковСтрогойОтчетности.Добавить();
//		Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
//		ЗаполнитьЗначенияСвойств(Движение,Бланк);
//		
//		//изменение статуса
//		Движение=Движения.Renault_БСО_СтатусыБСО.Добавить();
//		ЗаполнитьЗначенияСвойств(Движение,Бланк);
//		
//	КонецЦикла;	

//КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Renault_СтраховыеПолисы
	Движения.Renault_СтраховыеПолисы.Записывать=Истина;
	Движения.Renault_СтраховыеПолисы.Очистить();

	Движение = Движения.Renault_СтраховыеПолисы.Добавить();
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.СтраховаяКомпания = СтраховаяКомпания;
	Движение.ВидСтрахования = ВидСтрахования;
	Движение.ТипБСО = ТипБСО;
	Движение.СерияБСО = СерияБСО;
	Движение.НомерБСО = НомерБСО;
	Движение.Страхователь = Контрагент;
	Движение.Количество = 1;
	Движение.СтраховаяСумма = СтраховаяСумма;
	Движение.СтраховаяПремия = СуммаДокумента;
	
	Движения.Renault_ВзаиморасчетыСоСтрахователями.Записывать = Истина;
	Движения.Renault_ВзаиморасчетыСоСтрахователями.Очистить();
	Если НЕ ОплатаСК Тогда
		Движение = Движения.Renault_ВзаиморасчетыСоСтрахователями.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Страхователь = Контрагент;
		Движение.СтраховойПолис = Ссылка;
		Движение.Сумма = СуммаДокумента;
	КонецЕсли;	

	Движения.Renault_СтатусыБСО.Записывать = Истина;
	Движения.Renault_СтатусыБСО.Очистить();
	Если Состояние = Перечисления.Renault_СтатусыСтраховыхПолисов.ВРаботе ИЛИ Состояние = Перечисления.Renault_СтатусыСтраховыхПолисов.Продан ИЛИ Состояние = Перечисления.Renault_СтатусыСтраховыхПолисов.Испорчен Тогда
		
		Если Состояние = Перечисления.Renault_СтатусыСтраховыхПолисов.ВРаботе ИЛИ Состояние = Перечисления.Renault_СтатусыСтраховыхПолисов.Продан Тогда
			мСтатус = Перечисления.Renault_СтатусыБСО.Продан;
		ИначеЕсли Состояние = Перечисления.Renault_СтатусыСтраховыхПолисов.Испорчен Тогда
			мСтатус = Перечисления.Renault_СтатусыБСО.Испорчен;
		КонецЕсли;	
		
		Для Каждого Стр Из ТаблицаБСО Цикл
			Движение = Движения.Renault_СтатусыБСО.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.СтраховаяКомпания = СтраховаяКомпания;
			Движение.ТипБСО = Стр.ТипБСО;
			Движение.СерияБСО = Стр.СерияБСО;
			Движение.НомерБСО = Стр.НомерБСО;
			Движение.Статус = мСтатус;
		КонецЦикла;	
		
		//подвинем регистр Пролонгация полисов, если указан Предыдущий полис
		Если ЗначениеЗаполнено(ПредыдущийПолис) И мСтатус = Перечисления.Renault_СтатусыБСО.Продан тогда
			Движения.Renault_ПролонгацияПолисов.Записывать = Истина;
			Движения.Renault_ПролонгацияПолисов.Очистить();
			Движение = Движения.Renault_ПролонгацияПолисов.Добавить();
			Движение.Период = Дата;
			Движение.КаналВхода = Перечисления.Renault_КаналВхода_Страховка.Пролонгация;
			
			//данные из Предыдущего полиса
			Движение.СтраховаяКомпания = ПредыдущийПолис.СтраховаяКомпания;
			Движение.ВидСтрахования = ПредыдущийПолис.ВидСтрахования;
			Движение.Контрагент = ПредыдущийПолис.Контрагент;
			Движение.Результат = Перечисления.Renault_РезультатЗвонкаКлиенту_Страховка.Застраховался;
			Движение.Комментарий = "";
			
			Движение.НовыйПолис = Ссылка;
			Движение.Пользователь = Агент;
			Движение.СтраховойПолис = ПредыдущийПолис;
			Движение.ТочкаПродаж = ПредыдущийПолис.ТочкаПродаж;
			Движение.СерияБСО = ПредыдущийПолис.СерияБСО;
			Движение.НомерБСО = ПредыдущийПолис.НомерБСО;
			Движение.Автомобиль = ПредыдущийПолис.Автомобиль;
			Движение.ДатаОкончанияСрокаДействия = ПредыдущийПолис.ДатаОкончанияСтрахования;
		ИначеЕсли ЗначениеЗаполнено(ПредыдущийПолис) И мСтатус = Перечисления.Renault_СтатусыБСО.Испорчен тогда
			Движения.Renault_ПролонгацияПолисов.Записывать = Истина;
			Движения.Renault_ПролонгацияПолисов.Очистить();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ПолучитьСуммуДокумента();
	
	//Если НЕ ОплатаСК И НЕ Отказ И НЕ ЗаменаБезДоплаты Тогда
		//Если РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		//	Если Справочники.Renault_ОбщиеНастройкиБазыДанных.ЭтаБаза.АвтоФормированиеДокументовЗаказРеализация Тогда
		//		Если СтатусДокумента = Перечисления.Renault_СтатусыСтраховыхПолисов.ВРаботе И НЕ ЗначениеЗаполнено(ТекЗаказ) Тогда
		//			Заголовок = "Запись документа: " + СокрЛП(ЭтотОбъект);
		//			ТекЗаказ = СоздатьЗаказПокупателя(Отказ, Заголовок, ТекЗаказ);	
		//		КонецЕсли;	
		//		
		//		Если СтатусДокумента = Перечисления.Renault_СтатусыСтраховыхПолисов.ВРаботе И НЕ ЗначениеЗаполнено(ТекРеализация) И ЗначениеЗаполнено(ТекЗаказ) Тогда
		//			Заголовок = "Запись документа: " + СокрЛП(ЭтотОбъект);
		//			СоздатьДокументРеализации(Отказ, ТекЗаказ, ТекРеализация);	
		//		КонецЕсли;
		//	КонецЕсли;	
		//КонецЕсли;
		//
		//Если СтатусДокумента = Перечисления.Renault_СтатусыСтраховыхПолисов.Аннулирован И ЗначениеЗаполнено(ТекРеализация) И НЕ ЗначениеЗаполнено(КорректировкаРеализации) Тогда
		//	СоздатьКорректировкуРеализации(ТекРеализация);	
		//КонецЕсли;	
		//Если СтатусДокумента = Перечисления.Renault_СтатусыСтраховыхПолисов.Аннулирован И ЗначениеЗаполнено(ТекЗаказ) И НЕ ЗначениеЗаполнено(ЗакрытиеЗаказаПокупателя) Тогда
		//	СоздатьЗакрытиеЗаказаПокупателя(ТекЗаказ);	
		//КонецЕсли;	
	//КонецЕсли;	
	
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Запрос = Новый Запрос("Выбрать Регистратор Из РегистрСведений.Renault_КвитанцииКПолисам ГДЕ СтраховойПолис = &СтраховойПолис");
		Запрос.УстановитьПараметр("СтраховойПолис",Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество()>0 Тогда
			Сообщить("Для отмены проведения полиса необходимо отменить проведение документов оплаты");
			Отказ = Истина;
		КонецЕсли;
		Пока Выборка.Следующий() Цикл
			Сообщить("" + Выборка.Регистратор);
		КонецЦикла;
	КонецЕсли;
		
	//Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения И НЕ Отказ Тогда
	//	Если ЗначениеЗаполнено(ТекЗаказ) Тогда
	//		ЗаказПокупателяОбъект = ТекЗаказ.ПолучитьОбъект();
	//		ЗаказПокупателяОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	//		ТекЗаказ = Документы.ЗаказПокупателя.ПустаяСсылка();
	//	КонецЕсли;	
	//	
	//	Если ЗначениеЗаполнено(ТекРеализация) Тогда
	//		РеализацияТоваровУслугОбъект = ТекРеализация.ПолучитьОбъект();
	//		РеализацияТоваровУслугОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	//		ТекРеализация = Документы.РеализацияТоваров.ПустаяСсылка();
	//	КонецЕсли;
	//КонецЕсли;	
	
	//Если НЕ Отказ Тогда СформироватьЗаказПокупателя(Отказ) КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьЗаказПокупателя(Отказ) Экспорт
//	Если НЕ ЗаказПокупателя.Пустая() Тогда Возврат КонецЕсли;
	
	Заказ = Документы.ЗаказПокупателя.СоздатьДокумент();
	Заказ.ПроцентПредоплаты = 50;
	Заказ.Дата = ТекущаяДата();
	Заказ.ТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенПродажи;
	Заказ.СрокПоставки = Заказ.Дата;
	Заказ.ХозОперация = Справочники.ХозОперации.ЗаказПокупателя;
	Заказ.СкладКомпании = Справочники.СкладыКомпании.ОсновнойСкладКомпании;
	Заказ.Автор = ПараметрыСеанса.Пользователь;
	Заказ.Автомобиль = Автомобиль;
	Заказ.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	Заказ.ВидОплаты = Перечисления.ВидыОплаты.НаличныйРасчет;
	Заказ.ДатаОперации = ТекущаяДата();
	Заказ.ДатаСоздания = ТекущаяДата();
	Заказ.Контрагент = Контрагент;
	Заказ.ДоговорВзаиморасчетов = ПолучитьДоговорКонтрагента();
	Заказ.КурсВалютыУпр = 1;
	Заказ.КурсДокумента = 1;
	Заказ.Менеджер = Агент;
	Заказ.Организация = Организация;
	Заказ.ПодразделениеКомпании = ТочкаПродаж;
	Строка = Заказ.Товары.Добавить();
	Строка.Количество = 1;
	Строка.Номенклатура = ФинансоваяУслуга.ВидУслуги.Номенклатура;
	Строка.ЕдиницаИзмерения = ФинансоваяУслуга.ВидУслуги.Номенклатура.ОсновнаяЕдиницаИзмерения;
	Строка.Коэффициент = 1;
	Строка.Цена = СуммаДокумента;
	
	Если Организация.ОсвобожденОтНДС Тогда
		Строка.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
	Иначе
		Строка.СтавкаНДС = ФинансоваяУслуга.ВидУслуги.Номенклатура.СтавкаНДС;
		//НДС в том числе
		Строка.СуммаНДС = ФинансоваяУслуга.ВидУслуги.Номенклатура.СтавкаНДС.Ставка * Строка.Цена / (100 + ФинансоваяУслуга.ВидУслуги.Номенклатура.СтавкаНДС.Ставка);
	КонецЕсли;
	
	Строка.Сумма = СуммаДокумента;
	Заказ.Записать();
	ЗаказПокупателя = Заказ.Ссылка;
	
КонецПроцедуры	

Функция ПроверкаПроведения(Отказ)
	
	//Если РежимПроведения=РежимПроведенияДокумента.Оперативный Тогда
		//К+    //На вермя проведения старых документов, потом убрать
		ПроводитьБезПроверок = Renault_AdvancedСервер.РазрешитьПроводитьЗаказНарядБезОпределенныхПроверок();
		//К-

		Если НЕ ПроводитьБезПроверок И ВидСтрахования.НеобходимОбъектСтрахования И Не ЗначениеЗаполнено(Автомобиль) Тогда
			DMS_ОбщегоНазначенияСервер.СообщитьОбОшибке("Для данного вида страхования необходимо заполнить автомобиль ",Отказ)
		КонецЕсли;
		
		//проверить всю информацию по срокам страхования
		//отрицательный срок 
		Если ДатаОкончанияСтрахования-ДатаНачалаСтрахования<0 тогда
			DMS_ОбщегоНазначенияСервер.СообщитьОбОшибке("Дата окончания страхования не может быть ранее даты начала страхования!",Отказ)
		КонецЕсли;
		
		//кривые даты
		ГодНачала = Год(ДатаНачалаСтрахования);
		ГодОкончания = Год(ДатаОкончанияСтрахования);
		//дата начала может быть только текущего года (или прошлого)
		Если НЕ (ГодНачала = (Год(Дата) -1) или ГодНачала = Год(Дата) или  ГодНачала = (Год(Дата) + 1)) тогда
			DMS_ОбщегоНазначенияСервер.СообщитьОбОшибке("Некорректная дата начала страхования",Отказ)
		КонецЕсли;
		
		//пустая дата окончания и начала
		Если НЕ ЗначениеЗаполнено(ДатаНачалаСтрахования) или НЕ ЗначениеЗаполнено(ДатаОкончанияСтрахования) тогда
			DMS_ОбщегоНазначенияСервер.СообщитьОбОшибке("Заполните даты начала и окончания страхования",Отказ)
		КонецЕсли;
		
		Если  НЕ ПроводитьБезПроверок И НЕ ЗначениеЗаполнено(АлгоритмРассрочки) тогда
			DMS_ОбщегоНазначенияСервер.СообщитьОбОшибке("Заполните алгоритм рассрочки",Отказ)
		КонецЕсли;
		Если  НЕ ПроводитьБезПроверок И  АлгоритмРассрочки.Алгоритмы.Количество() И (НЕ ГрафикОплаты.Количество()) тогда
			DMS_ОбщегоНазначенияСервер.СообщитьОбОшибке("Заполните график рассрочки платежей",Отказ)
		КонецЕсли;
		
		Если  НЕ ПроводитьБезПроверок И НЕ ЗаменаБезДоплаты И СуммаПремии = 0 Тогда
			Сообщить("Страховая премия не может быть нулевой, если это не замена без доплаты"); Отказ = истина
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
			Сообщить("Необходимо заполнить Страхователя!");
			Отказ = Истина
		КонецЕсли;
		//Если НЕ ЗначениеЗаполнено(ДоговорКонтрагента) Тогда Сообщить("Необходимо заполнить Договор!"); Отказ=Истина КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТипБСО) Тогда
			Сообщить("Необходимо заполнить тип БСО!");
			Отказ = Истина
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НомерБСО) Тогда
			Сообщить("Необходимо заполнить номер БСО!");
			Отказ = Истина
		КонецЕсли;
		
		ТаблицаБСО = Renault_УчетБСО.ПолучитьПустуюТаблицуБСО();
		НоваяСтрока = ТаблицаБСО.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭтотОбъект);
		НоваяСтрока.Количество = 1;
		
		//бланк квитанции
		Если НомерБСО_Квитанция<>"" Тогда
			НоваяСтрока = ТаблицаБСО.Добавить();
			НоваяСтрока.Организация = Организация;
			НоваяСтрока.СтраховаяКомпания = СтраховаяКомпания;
			НоваяСтрока.ТочкаПродаж = ТочкаПродаж;
			НоваяСтрока.Количество = 1;
			НоваяСтрока.ТипБСО = ТипБСО_Квитанция;
			НоваяСтрока.СерияБСО = СерияБСО_Квитанция;
			НоваяСтрока.НомерБСО = НомерБСО_Квитанция;
		КонецЕсли;	
		
		ЕстьБСОНаТочке = Renault_УчетБСО.ПроверитьНаличиеБСО(Дата, ТаблицаБСО, Организация, СтраховаяКомпания, ТочкаПродаж, истина);
		Если НЕ ЕстьБСОНаТочке Тогда
			Отказ = Истина
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СтраховаяКомпания", СтраховаяКомпания);
		Запрос.УстановитьПараметр("ТаблицаБСО", ТаблицаБСО);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст = "
		|Выбрать т.ТипБСО, т.СерияБСО, т.НомерБСО Поместить т Из &ТаблицаБСО т;
		|ВЫБРАТЬ * Из РегистрНакопления.Renault_СтраховыеПолисы 
		|ГДЕ
		|	СтраховаяКомпания = &СтраховаяКомпания
		|	И (ТипБСО,СерияБСО,НомерБСО) В (Выбрать ТипБСО,СерияБСО,НомерБСО Из т)
		|	И Регистратор <> &Ссылка";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Сообщить("Страховой полис " + СокрЛП(Выборка.ТипБСО) + " " + СокрЛП(Выборка.СерияБСО) + " " + СокрЛП(Выборка.НомерБСО) + " уже введен для страхователя " + Выборка.Страхователь);
			Отказ = истина;
		КонецЦикла;
		
	//КонецЕсли;
	
	Возврат НЕ Отказ
	
КонецФункции

Функция ПолучитьДоговорКонтрагента()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	|	ДоговорыВзаиморасчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|ГДЕ
	|	ДоговорыВзаиморасчетов.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец",Контрагент);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	если ВыборкаДетальныеЗаписи.Следующий() тогда
		возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	возврат Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	
	
КонецФункции


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ПроверкаПроведения(Отказ);
КонецПроцедуры

