&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПараметрыФормы=Новый Структура("Марка,Модель,Комплект,Узел");
	ЗаполнитьЗначенияСвойств(ПараметрыФормы,Параметры);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.ЗакрыватьПриЗакрытииВладельца=Истина;
	ВладелецОбъект = ЭтаФорма.ВладелецФормы.Объект;
	ЗаполнитьЗначенияСвойств(Объект,ВладелецОбъект,,"ЗаявкаНаОформление,ЗаявкаПоставщику,ОчищеннаяТаблица");
	СборДанныхНаСервере();
КонецПроцедуры

&НаСервере
Процедура СборДанныхНаСервере()
	Обработка=РеквизитФормыВЗначение("Объект");
	Если ПараметрыФормы.Свойство("Узел") Тогда
		ТЗ=Обработка.СборДанныхОбУзле(Новый Структура("Узел,Комплект",ПараметрыФормы.Узел, ПараметрыФормы.Комплект));
	ИначеЕсли ПараметрыФормы.Свойство("Комплект") Тогда
		ТЗ=Обработка.СборДанныхОКомплектации(ПараметрыФормы.Комплект);
	ИначеЕсли ПараметрыФормы.Свойство("Модель") Тогда
		ТЗ=Обработка.СборДанныхОМоделиАвто(ПараметрыФормы.Марка,ПараметрыФормы.Модель);
	Иначе
		Отказ=Истина;
		Возврат;
	КонецЕсли;
	Для Каждого Стр Из ТЗ Цикл
		Нов=ГрупповаяЗагрузка.Добавить();
		ЗаполнитьЗначенияСвойств(Нов,Стр);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсё(Команда)
	Для каждого Запись из ГрупповаяЗагрузка Цикл
		Запись.Загружать=Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсё(Команда)
	Для каждого Запись из ГрупповаяЗагрузка Цикл
		Запись.Загружать=Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузку(Команда)
	ВыполнитьНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры  

&НаСервере
Процедура ВыполнитьНаСервере()
	Обработка=РеквизитФормыВЗначение("Объект");
	Для Каждого Стр Из ГрупповаяЗагрузка Цикл
		Если Стр.Загружать Тогда
			Обработка.ДобавлениеТовараВБазу(Стр.Айди);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


