/////////////////////////////События формы//////////////////////////////////////////////////////////////////////
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	Если НЕ Параметры.Свойство("РабочийЛист") ИЛИ НЕ ЗначениеЗаполнено(Параметры.РабочийЛист) Тогда
		Сообщить("Не указан рабочий лист!");
		Отказ = Истина;
	КонецЕсли;
	
	ЭтаФорма.РабочийЛист = Параметры.РабочийЛист;
	ЭтаФорма.ВключитьКредитВДоговор = Параметры.ВключитьКредитВДоговор;
	ЭтаФорма.ЗаявкаНаКредит = Параметры.ЗаявкаНаКредит;
	ЭтаФорма.СуммаСубсидии = Параметры.СуммаСубсидии; 	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьИнформациюПоКредиту();
	УправлениеОтображениемФормы(); 
КонецПроцедуры

////////////////////////////События элементов формы//////////////////////////////////////////////////////////
&НаКлиенте
Процедура ВключитьКредитВДоговорПриИзменении(Элемент)
	Если НЕ ВключитьКредитВДоговор Тогда
		СуммаСубсидии = 0;
	КонецЕсли;
	
	УправлениеОтображениемФормы(); 
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаКредитПриИзменении(Элемент)
	ОбновитьИнформациюПоКредиту();
	УправлениеОтображениемФормы();
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаКредитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ЗаявкаНаКредит = ПредопределенноеЗначение("Документ.Renault_CRM_ЗаявкаНаКредит.ПустаяСсылка");
	
	СписокЗаявокНаКредит = ПолучитьСписокЗаявокНаКредит();
	
	Если СписокЗаявокНаКредит.Количество() > 0 Тогда	
		ФормаСписка = Обработки.Renault_ARM_Администратор.ПолучитьФорму("ФормаВыбораИзСпискаПлиткой");
		ФормаСписка.Список = СписокЗаявокНаКредит;
		ФормаСписка.Заголовок = "Выбор заявки на кредит";
		ФормаСписка.КнопокВСтроке = 1;
		ФормаСписка.ВысотаКнопки = 40;
		ФормаСписка.ЭтоВыборСотрудника = Ложь;
		Ответ = ФормаСписка.ОткрытьМодально();
		Если ЗначениеЗаполнено(Ответ) Тогда
			ЗаявкаНаКредит = Ответ;			
		КонецЕсли;
		
		ОбновитьИнформациюПоКредиту(); 
		УправлениеОтображениемФормы();
	Иначе
		Сообщить("Одобренных заявок на кредит не обнаружено!");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ДанныеПоКредиту = Новый Структура("ЗаявкаНаКредит, ВключитьКредитВДоговор, СуммаСубсидии, СуммаКредита, КредитнаяПрограмма, ДатаКредитногоДоговора",
		ЗаявкаНаКредит, ВключитьКредитВДоговор, СуммаСубсидии, СуммаКредита, КредитнаяПрограмма, ДатаКредитногоДоговора);
	
	Закрыть(ДанныеПоКредиту);
КонецПроцедуры 

///////////////////////////Прочие процедуры и функции///////////////////////////////////////////////////////////////
&НаКлиенте
Процедура ОбновитьИнформациюПоКредиту()
	КредитноеПредложение = ПредопределенноеЗначение("Справочник.КредитныеПрограммы.ПустаяСсылка");
	СуммаКредита = 0;
	ДатаКредитногоДоговора = '0001-01-01';
	Если ЗначениеЗаполнено(ЗаявкаНаКредит) Тогда
		ДанныеПоКредиту = ДанныеПоКредиту(ЗаявкаНаКредит);
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ДанныеПоКредиту);
	Иначе
		ВключитьКредитВДоговор = Ложь;
		СуммаСубсидии = 0;
	КонецЕсли; 	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеПоКредиту(ЗаявкаНаКредит)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ЗаявкаНаКредит.КредитноеПредложение КАК КредитноеПредложение,
		|	Renault_ЗаявкаНаКредит.СуммаКредита КАК СуммаКредита,
		|	Renault_ЗаявкаНаКредит.Дата КАК ДатаКредитногоДоговора
		|ИЗ
		|	Документ.Renault_ЗаявкаНаКредит КАК Renault_ЗаявкаНаКредит
		|ГДЕ
		|	Renault_ЗаявкаНаКредит.Ссылка = &ЗаявкаНаКредит";  		
	Запрос.УстановитьПараметр("ЗаявкаНаКредит", ЗаявкаНаКредит); 	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();		
	Выборка.Следующий(); 
	
	ДанныеПоКредиту = Новый Структура("КредитноеПредложение, СуммаКредита, ДатаКредитногоДоговора");
	ЗаполнитьЗначенияСвойств(ДанныеПоКредиту, Выборка);
	
	Возврат ДанныеПоКредиту;
КонецФункции

&НаКлиенте
Процедура УправлениеОтображениемФормы()
	ЕстьЗаявкаНаКредит = ЗначениеЗаполнено(ЗаявкаНаКредит);
	
	Элементы.ВключитьКредитВДоговор.Доступность = ЕстьЗаявкаНаКредит;
	Элементы.СуммаСубсидии.Доступность = ЕстьЗаявкаНаКредит И ВключитьКредитВДоговор;
	ЭтаФорма.Заголовок = ?(ЕстьЗаявкаНаКредит, "Данные по кредиту (" + Строка(ЗаявкаНаКредит) + ")", "Данные по кредиту");
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписокЗаявокНаКредит()
	СписокЗаявок = Новый СписокЗначений();
	
	ЗаявкиНаКредит = ЗаявкиНаКредит(РабочийЛист);
	
	Для Каждого Эл Из ЗаявкиНаКредит Цикл
		СписокЗаявок.Добавить(Эл);
	КонецЦикла;	
	
	Возврат СписокЗаявок;
КонецФункции

&НаСервереБезКонтекста
Функция ЗаявкиНаКредит(РабочийЛист)
	ЗаявкиНаКредит = Новый Массив();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ЗаявкаНаКредит.Ссылка КАК ЗаявкаНаКредит
		|ИЗ
		|	Документ.Renault_ЗаявкаНаКредит КАК Renault_ЗаявкаНаКредит
		|ГДЕ
		|	Renault_ЗаявкаНаКредит.РабочийЛист = &РабочийЛист
		|	И Renault_ЗаявкаНаКредит.Состояние = ЗНАЧЕНИЕ(Перечисление.Renault_CRM_СтатусЗаявокНаКредит.Одобрена)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Renault_ЗаявкаНаКредит.МоментВремени";	
	Запрос.УстановитьПараметр("РабочийЛист", РабочийЛист); 	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ЗаявкиНаКредит.Добавить(Выборка.ЗаявкаНаКредит);
		КонецЦикла;	
	КонецЕсли;
	
	Возврат ЗаявкиНаКредит;		
КонецФункции





