&НаКлиенте
Перем Сендер,СендерАдрес, СендерЗапросы, ВсеЗаявкиПоставщикуБыли, СендерСв, СендерОтладкаБыла, ПодключаемоеОборудование, ФормыПА;

#Область ОбработчикиСобытийФормы

&НаСервере   
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем Данные;
	Объект.ПользовательИмя=ПользователиИнформационнойБазы.ТекущийПользователь().Имя;//вс(
	Данные=ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","ОбъектMySQL",,Объект.ПользовательИмя);//вс)
	Если ТипЗнч(Данные)<>Тип("Структура") Тогда
		Данные=Новый Структура("ИспользоватьБазуКроссов,ИспользоватьПрайсЛист, ИспользоватьПоискПоАвтомобилю,ИспользоватьЗаказПоставщику,МаксСрокПоНаличию,СборАналитики",
		Истина,Истина,Истина,Истина,3,Истина);
	ИначеЕсли Не Данные.Свойство("СборАналитики") Тогда
		Данные.Вставить("СборАналитики",Истина);
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(Объект,Данные);
			
	Объект.КроссПодключен=Найти(Параметры.listSoftware,",CrossAssistant,")>0; 
	Объект.СтрокаПодключенияКроссов=Параметры.urlAPI;
	Объект.КодСеанса=Параметры.idSession;
	ЭтаФорма.КодПользователя=Параметры.idUser;
	Объект.Лицензия=?(Параметры.idLicense=0,"ДЕМО(Функционал ограничен)","ПРОФ.");
	Объект.СрокПодпискиПА = Параметры.СрокПодпискиПА;
	Объект.СрокПодпискиБК = Параметры.СрокПодпискиБК;
	Объект.СрокПодпискиТП = Параметры.СрокПодпискиТП;
	Объект.ДемоРежим = Параметры.ДемоРежим;
	Объект.IPКлиента = Параметры.IPКлиента;
	Объект.СП = ПолучитьАдресСПСервер();
	
	Обработка=РеквизитФормыВЗначение("Объект"); 
	Если Лев(Строка(ТипЗнч(Обработка)),7)="Внешняя" ТОгда
		Объект.ВнешняяОбработка="ВнешняяОбработка";
	Иначе
		Объект.ВнешняяОбработка="Обработка";
	КонецЕсли;
	
	Объект.ПАЛогин = Параметры.CurrentUser;
	
	ЗначениеНастроек = ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса", "ФильтрОнлайнСтруктура",,Объект.ПользовательИмя); 	
	Если ТипЗнч(ЗначениеНастроек) = Тип("Соответствие") Тогда		 
		 Объект.ФильтрОнлайнВид = ЗначениеНастроек.Получить("ФильтрОнлайнВид");	 
		 Объект.ФильтрОнлайнКвоСтрок = ЗначениеНастроек.Получить("ФильтрОнлайнКвоСтрок");
		
	КонецЕсли;	
	//зк(
	Обработка.ЗагрузитьКорзины(Объект.ПользовательИмя);
	ЗначениеВДанныеФормы(Обработка.ЗаказыКлиентов,Объект.ЗаказыКлиентов);	
	ЗначениеВДанныеФормы(Обработка.ЗаявкаНаОформление,Объект.ЗаявкаНаОформление);	
	//зк)
	Обработка.ЗагрузитьЗаявкиПоставщику();
	ЗначениеВДанныеФормы(Обработка.ЗаявкаПоставщику,Объект.ЗаявкаПоставщику);
	Элементы.Группа10.Заголовок="Заказанное ("+Строка(Объект.ЗаявкаПоставщику.Количество())+")";
	
	ЗаполнитьСтатусыВКорзине(Объект.ПользовательИмя);

	Мас=Обработка.ВыгрузитьУровниЦен();
	Элементы.УровеньЦен.СписокВыбора.ЗагрузитьЗначения(Мас);
	Элементы.УровеньЦенЕмекс.СписокВыбора.ЗагрузитьЗначения(Мас);
	Если Мас.Найти(Объект.УровеньЦен)=Неопределено Тогда Объект.УровеньЦен="Закупочная";КонецЕсли;
	Если Мас.Найти(Объект.УровеньЦенЕмекс)=Неопределено Тогда Объект.УровеньЦенЕмекс="Закупочная";КонецЕсли;
	
	// Обновим методы у проценок
	Обработка.ОбновитьДанныеПоОнлайнПоставщикам(Истина, Истина);
	
	 Попытка
		#Если ВебКлиент Тогда
			Объект.РежимМодальности=Ложь;
		#Иначе
			Объект.РежимМодальности=Метаданные.РежимИспользованияМодальности=Метаданные.СвойстваОбъектов.РежимИспользованияМодальности.Использовать;
		#КонецЕсли
	Исключение
		Объект.РежимМодальности=Истина;
	КонецПопытки;
	
	Если Метаданные.Справочники.Найти("Номенклатура") <> Неопределено Тогда
		Объект.ЕстьНоменклатура = ИСтина;
	Иначе
		Объект.ЕстьНоменклатура = Ложь;
		ЗаполнитьНачальныеНастройкиДляПустойБазы();
	КонецЕсли;
	
	// Формирование списка групп поставщиков
	ГруппыПоставщиков=ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","ГруппыПоставщиков",,Объект.ПользовательИмя);
	Если ТипЗнч(ГруппыПоставщиков)<>Тип("СписокЗначений") Тогда ГруппыПоставщиков=Новый СписокЗначений;Конецесли;
	Список=Элементы.ГруппаПоставщиков.СписокВыбора;
	//Список.Добавить(""," ");
	Для Каждого Стр Из ГруппыПоставщиков Цикл
		Список.Добавить(Стр.Представление);
	КонецЦикла;

	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНачальныеНастройкиДляПустойБазы()
	//уберем лишние элементы для пустой базы
	//База кроссов
	Объект.ВыводитьАналоги = Ложь;
	Элементы.ВключаяАналоги.Видимость = Ложь;
	Объект.ВыводитьНаличие = Ложь;
	Элементы.ВыводитьНаличие.Видимость = Ложь;
	Объект.ПоШаблону = Ложь;
	Элементы.ПоШаблону.Видимость = Ложь;
	Элементы.ФильтрСклад.Видимость = Ложь;
	Элементы.ТипЦен.Видимость = Ложь;
	//Прайс-листы
	Элементы.ФильтрСкладПрайс.Видимость = Ложь;
	//Проценки
	Элементы.МенюОтборПоНаличиюНаСкладеПредприятия.Видимость = Ложь;
	Элементы.СервисДобавитьВКарточку.Видимость = Ложь;
	//Корзина
	Элементы.ОформитьЗаявку.Видимость = Ложь;
	Элементы.КонтрагентДляЗаявки.Видимость = Ложь;
	Элементы.СкладДляЗаявки.Видимость = Ложь;
	//Заказы поставщикам
	Элементы.ОформитьЗаказы.Видимость = Ложь;
	Элементы.ОформитьДокументыПоступления.Видимость = Ложь;
КонецПроцедуры

&НаСервере
Функция ВыяснитьКонфигурациюНаСервере()
	Обработка=РеквизитФормыВЗначение("Объект");
	Возврат Обработка.ВыяснитьКонфигурацию(ЭтаФорма.Элементы);
КонецФункции

&НаСервере
Функция ПолучитьАдресСПСервер()
	Обработка=РеквизитФормыВЗначение("Объект");
	Возврат Обработка.ПолучитьАдресСервераПроценок();
КонецФункции

&НаСервере
Процедура СохранитьЗаявкиНаСервере()
	СохранитьДанныеПоКорзине(ПользовательКорзины);
	СохранитьДанныеПоЗаказамПоставщикам(); //вс()
	Обработка=РеквизитФормыВЗначение("Объект");
	Обработка.СохранитьНастройкиВХранилище("ОсновныеНастройки");
	Обработка.ПризакрытииОграничения();
КонецПроцедуры

&НаСервере
Процедура ИспользованиеПроценокОнЛайнПоставщиков()
Перем Данные;	

	Данные=Неопределено;
	Данные=ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","ОбъектMySQL",,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
	
	Если НЕ ТипЗнч(Данные)=Тип("Структура") Тогда
  		Объект.ИспользоватьПроценкуОнлайнПоставщиков= ИСТИНА;
		Объект.ИспользоватьБазуКроссов = ИСТИНА;
		Объект.ИспользоватьПрайсЛист = ИСТИНА;
		Объект.ИспользоватьПоискПоАвтомобилю = ИСТИНА;
		Объект.ИспользоватьЗаказПоставщику = ИСТИНА;
			
		Элементы.ПоискЕмекс.Видимость=Объект.ИспользоватьПроценкуОнлайнПоставщиков;
		Элементы.СтраницаПоискПоАртикулу.Видимость = Объект.ИспользоватьБазуКроссов;
		Элементы.СтраницаПоискПоПрайсу.Видимость = Объект.ИспользоватьПрайсЛист;
		Элементы.Стр3.Видимость = Объект.ИспользоватьПоискПоАвтомобилю;
		Элементы.Группа10.Видимость = Объект.ИспользоватьЗаказПоставщику;
		
		Обработка = РеквизитФормыВЗначение("Объект");
		Обработка.СохранитьНастройкиВХранилище("ОсновныеНастройки");
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущуюСтраницу()
	
    Если ЭтаФорма.Элементы.СтраницаПоискПоАртикулу.Видимость = Истина Тогда
	   ЭтаФорма.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.Элементы.СтраницаПоискПоАртикулу;
	ИначеЕсли ЭтаФорма.Элементы.СтраницаПоискПоПрайсу.Видимость = Истина Тогда
	   ЭтаФорма.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.Элементы.СтраницаПоискПоПрайсу;
	ИначеЕсли ЭтаФорма.Элементы.ПоискЕмекс.Видимость = Истина Тогда
	   ЭтаФорма.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.Элементы.ПоискЕмекс;	   
	ИначеЕсли ЭтаФорма.Элементы.Стр3.Видимость = Истина Тогда
	   ЭтаФорма.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.Элементы.Стр3;
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОпределитьВидимостьСрокаПодписки()
	Показывать = Ложь;
	СрокПодписки = "";
	Если ЗначениеЗаполнено(Объект.СрокПодпискиТП) Тогда
		СрокПодписки = Объект.СрокПодпискиТП;
	ИначеЕсли ЗначениеЗаполнено(Объект.СрокПодпискиПА) Тогда
		СрокПодписки = Объект.СрокПодпискиПА;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СрокПодпискиБК) Тогда 
		Если ЗначениеЗаполнено(СрокПодписки)  Тогда
			Если (Объект.СрокПодпискиБК >= НачалоДня(ТекущаяДата())) и (Объект.СрокПодпискиБК < СрокПодписки) Тогда			
				СрокПодписки = Объект.СрокПодпискиБК;
			КонецЕсли;
		Иначе
			СрокПодписки = Объект.СрокПодпискиБК;
		КонецЕсли;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(СрокПодписки) Тогда
		Если СрокПодписки-ТекущаяДата()<=20*86400 Тогда
			ЭтаФорма.Элементы.СрокПодписки.Заголовок = "Срок подписки до "+Формат(СрокПодписки, "ДЛФ=Д");
			Показывать = Истина;
			Если СрокПодписки-ТекущаяДата()<=7*86400 Тогда
				ЭтаФорма.Элементы.СрокПодписки.ЦветТекста = Новый Цвет(255,0,0);
			Иначе
				ЭтаФорма.Элементы.СрокПодписки.ЦветТекста = Новый Цвет(28,85,174);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Показывать;
КонецФункции

&НаКлиенте   
Процедура ПриОткрытии(Отказ)
	
    Состояние("Запуск NIRAX: Помощника автобизнеса...", , "Восстанавливаем ранее сохраненные настройки");
	СендерЗапросы=Новый СписокЗначений;
	СендерСв=Новый Структура("Начало,Источник,Живой,Пинг,Повторов,Таймаут,ЖдатьОтвет,КС,Конец,Первый,макс,ВсеЗаявки,Отладка",
    	ТекущаяДата(),"",Истина,0,3,60,10,0,0,0,0,Ложь,Ложь);
	ФормыПА=Новый Структура;     
	
	//Определение конфигурации
	Рез=ВыяснитьКонфигурациюНаСервере();
	ЗаполнитьЗначенияСвойств(Объект,Рез);
	Если Объект.Лицензия="ДЕМО(Функционал ограничен)" Тогда
		Список="Пред0,Пред1,Пред3,Пред4,Пред5,ОбщийПоиск,ВыводитьНаличие,ФильтрМарка,ФильтрСклад,"+
		"УровеньЦен,ФильтрСкладПрайс,ФильтрМаркаЕмекс,ФильтрПоставщикЕмекс,ФильтрСкладЕмекс,ЕмексИскатьСЗаменамиИАналогами,ОтборПоНаличию,УровеньЦенЕмекс,"+
		"КонтрагентДляЗаявки,ДоговорДляЗаявки,СкладДляЗаявки,ОформитьЗаявку,ЧекККМ,ЗаказатьЕмекс,ЗаявкаНаОформление,ЗаказыКлиентов,ОформитьЗаказы,ЗаявкаПоставщику,"+
		"МенюСЗаменамиИАналогами,ПодменюОтбор,МенюРасчетОстатокНаСкладе";
		
		Список=СтрЗаменить(Список,",",Символы.ПС);
		КолСтр=СтрЧислоСтрок(Список);
		Для Инд=1 по КолСтр Цикл
			Стр=СтрПолучитьСтроку(Список,Инд);
			Элементы[Стр].Доступность=Ложь;
		КонецЦикла;		
	КонецЕсли;
	Отказ = Объект.ОтказОт;
	ЭтаФорма.Заголовок = "NIRAX: Помощник автобизнеса " + Объект.Версия
	+ ?(Объект.Лицензия="ДЕМО(Функционал ограничен)" или Объект.КроссПодключен,""," (кроссы ограничены)");
	//Определение доступности реквизитов
	//Убираем элементы формы, данные которых отсутствуют в данной конфигурации
	Элементы.ЗаказПокупателя.Видимость=Рез.ЕстьЗаказ;
	Элементы.РеализацияТоваров.Видимость=Рез.ЕстьРеализация;
	Элементы.СчетФактура.Видимость=Рез.ЕстьСчет;
	Элементы.Соглашение.Видимость=Рез.Свойство("Соглашение");
	Элементы.ДоговорДляЗаявки.Видимость=Объект.ДоговорДляЗаявки<>Неопределено;
	//Элементы.ОформитьЧекККМ.Видимость=Объект.КассаККМ<>Неопределено;//зк()
	
	Элементы.ПоискЕмекс.Видимость=Объект.ИспользоватьПроценкуОнлайнПоставщиков;
	Элементы.СтраницаПоискПоАртикулу.Видимость=Объект.ИспользоватьБазуКроссов;
	Элементы.СтраницаПоискПоПрайсу.Видимость=Объект.ИспользоватьПрайсЛист;
	Элементы.Стр3.Видимость=Объект.ИспользоватьПоискПоАвтомобилю;
	Элементы.Группа10.Видимость=Объект.ИспользоватьЗаказПоставщику; 
	Элементы.ЗаявкаНаОформлениеЦена.Доступность = НЕ Объект.ЗапретитьРедактированиеЦенВКорзине;	
	Элементы.УточнениеПоиска1УточнениеПоставщик.Видимость=Объект.УточнятьПоставщика;
	Элементы.УточнениеПоиска.ОтборСтрок=Новый ФиксированнаяСтруктура("Отображать",Истина);
	//зк(
	ПользовательКорзины=Объект.ПользовательИмя;
	Элементы.ЗаказыКлиентов.ТекущаяСтрока=Объект.ЗаказыКлиентов[0];
	ОбновитьЗаголовокКорзины();
	Если Объект.Соглашение=Неопределено Тогда
		Элементы.ЗаказСоглашение.Видимость=Ложь;
	Иначе
		Элементы.ЗаказСоглашение.ОграничениеТипа=ОпределитьТип(Объект.Соглашение);
	КонецЕсли;
	Если Объект.ДоговорДляЗаявки=Неопределено Тогда
		Элементы.ЗаказДоговор.Видимость=Ложь;
	Иначе
		Элементы.ЗаказДоговор.ОграничениеТипа = ОпределитьТип(Объект.ДоговорДляЗаявки);
	КонецЕсли;
	Если Объект.Склад=Неопределено Тогда
		Элементы.ЗаказСклад.Видимость=Ложь;
	Иначе
		Элементы.ЗаказСклад.ОграничениеТипа = ОпределитьТип(Объект.Склад);
	КонецЕсли;
	ЗаказыКлиентовОтбор=Новый Структура("Статусы,ДатаЗаказаС,ДатаЗаказаПо,ДатаОтгрузкиС,ДатаОтгрузкиПо,Контрагент",
	Новый СписокЗначений(),'00010101','00010101','00010101','00010101',?(Объект.ЕстьНоменклатура,
	ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"),""));
	ЗаказыКлиентовОтбор.Статусы=Элементы.ЗаказСтатус.СписокВыбора.Скопировать();
	ЗаказыКлиентовОтбор.Статусы[0].Пометка=Истина;
	ЗаказыКлиентовОтборВыполнить(Истина);
	Элементы.ЗаказыКлиентов.ОтборСтрок=Новый ФиксированнаяСтруктура("Отбор",Истина);
	
	Элементы.ОформитьЗаказПокупателя.Видимость=Объект.Реквизит1С.Заказ<>Неопределено;
	Элементы.ОформитьЗаказНаряд.Видимость=Объект.Реквизит1С.ЗаказНаряд<>Неопределено;
	Элементы.ОформитьРеализациюТоваров.Видимость=Объект.Реквизит1С.Реализация<>Неопределено;
	Элементы.ОформитьСчетФактуру.Видимость=Объект.Реквизит1С.СчетФактураВыданный<>Неопределено;
	Элементы.ОформитьЧекККМ.Видимость=Объект.КассаККМ<>Неопределено И Объект.Реквизит1С.ЧекККМ<>Неопределено;
	Элементы.КакСоздатьЧекККМНажатие.Видимость=Элементы.ОформитьЧекККМ.Видимость;
	Если Не Объект.ЕстьНоменклатура Тогда
		Элементы.ОформитьЗаказы.Видимость=Ложь;
		Элементы.ПоступлениеИзФайла.Видимость=Ложь;
		Элементы.ЗаказЗаказПокупателя.Видимость=Ложь;
		Элементы.МенюОформитьДокументы.Видимость=Ложь;
		Элементы.КорзинаСменитьПользователя.Видимость=Ложь;
	КонецЕсли;
	ИзменятьКорзину=Истина;
	Если Не Объект.ВсеЗаявкиПоставщику Тогда 
		Элементы.КорзинаСменитьПользователя.Доступность=Ложь;
	КонецЕсли;
	//зк)
	СендерСв.Отладка=Объект.СендерОтладка;
	СендерСв.ВсеЗаявки=Объект.ВсеЗаявкиПоставщику;
	СендерОткрыть();//вс()
	// Присваиваем начальные значения реквизитам
	//Если НЕ (Пред1 ИЛИ Пред2 ИЛИ Пред3 Или Пред4 Или Пред5) Тогда Пред1=Истина;КонецЕсли;
	Пред1=Истина;
	ПредПриИзменении(Неопределено);	
	ИзменениеУровняЦенНаСервере();
	УровеньЦенЕмексПриИзмененииНаСервере();
	Объект.ОбщийПоискВрем=Объект.ОбщийПоиск;
	Объект.СкладДляЗаявки=Объект.Склад;
	Объект.ФильтрСклад=Объект.Склад;
	Объект.ФильтрСкладЕмекс=Объект.Склад;
	Объект.ФильтрСкладПрайс=Объект.Склад;
	Если ПустаяСтрока(Объект.ШаблонНаименования) Тогда
		Объект.ШаблонНаименования = "&Н"; //"&К &Н *&П"
	КонецЕсли;
	Если ПустаяСтрока(Объект.ШаблонНаименованияП) Тогда
		Объект.ШаблонНаименованияП = "&К &Н *&П";
	КонецЕсли;
	Если ПустаяСтрока(Объект.ШаблонНомераДляПоиска) Тогда
		Объект.ШаблонНомераДляПоиска = "&К_&П";
	КонецЕсли;
	Ошибки="";
		
	//Заносим сохраненное значение артикула в список выбора
	Если Объект.НомерАртикула<>"" Тогда
		НомерАртикулаПриИзменении(Неопределено);
	КонецЕсли;
	
	// Установим признак "Использовать проценку онлайн-поставщиков
	ИспользованиеПроценокОнЛайнПоставщиков();
	
	//Сравнить версии ПА
	//СравнитьВерсииПА();
	Версии=ПолучитьВерсииПАнаСервере(); //Новая, БылаНовая, Текущая, Рабочая, БылаРабочая, СтарыйЗапуск, Информировать
	//Если Версии.СтарыйЗапуск Тогда
	//	ОО=Новый ОписаниеОповещения("ОтветСтарыйЗапуск",ЭтаФорма);
	//	ПоказатьВопрос(ОО,"Ваша рабочая версия: "+Версии.Рабочая+", запущена версия: "+Версии.Текущая+Символы.ПС
	//	+"Запуск предыдущих версий может повлечь потерю данных. Продолжить?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
	Если Версии.Информировать=Истина Тогда
		ПодключитьОбработчикОжидания("ПоказатьОбновлениеВерсии", 0.1, Истина);
		//ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ОписаниеВерсийУФ",,ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца).Активизировать();
	КонецЕсли;
	Элементы.ОбновлениеВерсии.Видимость = Версии.Текущая<>Версии.Новая;
	
	Счетчик=10;
	ПроверитьОтветыОтТехПоддержки();
	ЭтаФорма.Элементы.СрокПодписки.Видимость = ОпределитьВидимостьСрокаПодписки();	
	
	Если Объект.Лицензия="ДЕМО(Функционал ограничен)" Тогда
		Объект.ОбщийПоискВрем = Ложь;
	КонецЕсли;
	                                             
	СочетаниеТвойОтбор = Новый СочетаниеКлавиш(Клавиша._7,Ложь,Истина,Ложь);
	
	ОбновитьПометкиМеню();
	ОбновитьВидимостьПодсказок();
	
	#Если ВебКлиент Тогда
		Если Объект.ПАЛогин="demo" Тогда
			ЭтаФорма.Элементы.Настройки.Доступность=Ложь;
			ЭтаФорма.Элементы.СрокПодписки.Доступность=Ложь;
			ЭтаФорма.Элементы.ЕстьОтветТехПоддержки.Доступность=Ложь;
			ЭтаФорма.Элементы.ОформитьЗаявку.Доступность=Ложь;
			ЭтаФорма.Элементы.ОформитьЧекККМ.Доступность=Ложь;
			ЭтаФорма.Элементы.ЗаказатьЕмекс.Доступность=Ложь;
			ЭтаФорма.Элементы.ОформитьЗаказы.Доступность=Ложь;
			ЭтаФорма.Элементы.ОбщийПоиск.Доступность=Ложь;
		Иначе
			ЭтаФорма.Элементы.ОформитьЗаявку.Доступность=Ложь;
			ЭтаФорма.Элементы.ОформитьЧекККМ.Доступность=Ложь;
			ЭтаФорма.Элементы.ОформитьЗаказы.Доступность=Ложь;
			ЭтаФорма.Элементы.ОбщийПоиск.Доступность=Ложь;
		КонецЕсли;
	#КонецЕсли
	
	УстановитьТекущуюСтраницу();
	
	Если Объект.МетодыСортировки = Неопределено ИЛИ ЗначениеЗаполнено(Объект.МетодыСортировки) = Ложь Тогда
		Объект.МетодыСортировки = Элементы.МетодыСортировки.СписокВыбора[0].Значение;
	КонецЕсли;
	
	ВидПоискаКросс = 2;
	
	Элементы.ЗаявкаНаОформлениеСклад.Видимость = Истина;
	ОбновитьКолонкиСписковНаСервере();
	ИзменитьЭлементыФормы();
	Состояние();
	
	#Если ВебКлиент Тогда
        // Попробуем подключить расширение работы с файлами
		ОО=Новый ОписаниеОповещения("ПодключениеРасширения",ЭтаФорма,Истина);
        НачатьПодключениеРасширенияРаботыСФайлами(ОО);
    #КонецЕсли  	
КонецПроцедуры

#Если ВебКлиент Тогда
&НаКлиенте
Процедура ПодключениеРасширения(Подключено, Установить) Экспорт
	Если Не Подключено Тогда
		Если Установить Тогда
			ОО=Новый ОписаниеОповещения("УстановкаРасширения",ЭтаФорма,Истина);
			НачатьУстановкуРасширенияРаботыСФайлами(ОО);
		Иначе
	        Сообщить("Не удалось установить расширение для работы с файлами");
		Конецесли;
	КонецЕсли;
Конецпроцедуры

&НаКлиенте
Процедура УстановкаРасширения(Установлено) Экспорт
	ОО=Новый ОписаниеОповещения("ПодключениеРасширения",ЭтаФорма,Ложь);
    НачатьПодключениеРасширенияРаботыСФайлами(ОО);
Конецпроцедуры

#Конецесли
		
	

&НаКлиенте
Процедура ИзменитьЭлементыФормы()
	
	Если Объект.РежимКлиента Тогда
		Элементы.РезультатПоискаОнлайнЦена.Видимость               = НЕ Объект.БлокироватьЦенуПокупки;
		Элементы.РезультатПоискаОнлайнЦенаПродажи.Видимость        = НЕ Объект.БлокироватьЦенуПродажи;
		Элементы.РезультатПоискаОнлайнИсточникИнформации.Видимость = НЕ Объект.БлокироватьПоставщика;
		Элементы.РезультатПоискаОнлайнСклад.Видимость 			  = НЕ Объект.БлокироватьПроценкаСклад;
		Элементы.РезультатПоискаОнлайнПроизводитель.Видимость	= НЕ Объект.БлокироватьПроизводителя И НЕ Объект.ОтображатьКолонкуБренд;
		Элементы.РезультатПоискаОнлайнБренд.Видимость			= НЕ Объект.БлокироватьПроизводителя И Объект.ОтображатьКолонкуБренд;
	Иначе
		Элементы.РезультатПоискаОнлайнПроизводитель.Видимость	= НЕ Объект.ОтображатьКолонкуБренд;
		Элементы.РезультатПоискаОнлайнБренд.Видимость			= Объект.ОтображатьКолонкуБренд;
	КонецЕсли;
	
	Элементы.ЗаявкаНаОформлениеЦена.Видимость     = НЕ Объект.БлокироватьКорзинаЦена;
	
	Элементы.ЗаявкаНаОформлениеСумма.Видимость    = НЕ Объект.БлокироватьКорзинаСумма;
	Элементы.ЗаявкаНаОформлениеСуммаСоСкидкой.Видимость    = НЕ Объект.БлокироватьКорзинаСуммаСоСкидкой;
	Элементы.ЗаявкаНаОформлениеВсего.Видимость = НЕ Объект.БлокироватьКорзинаСуммаВсего;
	
	Элементы.ЗаявкаНаОформлениеСклад.Видимость    = НЕ Объект.БлокироватьКорзинаСкладПоставщика;
	Элементы.ЗаявкаНаОформлениеСуммаНДС.Видимость = НЕ Объект.БлокироватьКорзинаСуммаНДС;
	Элементы.ЗаявкаНаОформлениеСкидка.Видимость = НЕ Объект.БлокироватьКорзинаСкидка;
	Элементы.ЗаявкаНаОформлениеСтавкаНДС.Видимость = НЕ Объект.БлокироватьКорзинаСтавкаНДС;
	Элементы.ЗаявкаНаОформлениеЦенаПоставки.Видимость = НЕ Объект.БлокироватьКорзинаЦенаПоставки;

КонецПроцедуры


&НаСервере
Функция БыстрыйВызов(Код, Alt=0, Control=0, Shift=0) Экспорт 
   Возврат ЗначениеИзСтрокиВнутр("{""#"",69cf4251-8759-11d5-bf7e-0050bae2bc79,1, 
      |{0,"+ Формат(Код, "ЧН=0; ЧГ=0") +","+ Формат(Alt*16+Control*8+Shift*4, "ЧН=0; ЧГ=0") +"} 
      |}"); 
КонецФункции 

&НаКлиенте
Процедура ЗакрытьФорму(Доп=Неопределено) Экспорт
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, Текст, СтандартнаяОбработка)		
	Если Не ЗавершениеРаботы = Истина Тогда
		СохранитьЗаявкиНаСервере();			
		СендерЗакрыть();
	Иначе
	   Отказ = Истина;
	   Текст = "Закрытие 1С приведёт к потере несохранённых данных в NIRAX:Помощник автобизнеса! Сначала закройте продукт, потом 1С!";
	   ПодключитьОбработчикОжидания("СохранениеНесохраненныхДанных", 1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранениеНесохраненныхДанных() Экспорт
	СохранитьЗаявкиНаСервере();				
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Меню_Помощь_ПА(Команда)
	Ключ = Новый Структура("Страница", "ТехПоддержка");
	Оповещение=Новый ОписаниеОповещения("ПроверитьОтветыОтТехПоддержки",ЭтаФорма);
	Счетчик=10;
	ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.НастройкиУФ",Ключ,ЭтаФорма,,,,Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура Меню_Видео_ПА(Команда)
	Ключ = Новый Структура("Страница", "ТехПоддержка");
	Оповещение=Новый ОписаниеОповещения("ПроверитьОтветыОтТехПоддержки",ЭтаФорма);
	Счетчик=10;
	ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.НастройкиУФ",Ключ,ЭтаФорма,,,,Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура Меню_чат_Вк(Команда)
	ЗапуститьПриложение("https://vk.me/join/yxvMOjC43tI9o8uzknq1E/U81IT5rIyrtJ4=");
КонецПроцедуры

&НаКлиенте
Процедура Меню_чат_Тг(Команда)
	ЗапуститьПриложение("https://t.me/joinchat/QX9PG1aBW9RH7BoAAO8jBQ");
КонецПроцедуры

&НаКлиенте
Процедура Меню_Программа_any(Команда)
	ЗапуститьПриложение("https://anydesk.com/ru/downloads");
КонецПроцедуры

&НаКлиенте
Процедура Меню_Программа_google(Команда)
	ЗапуститьПриложение("https://remotedesktop.google.com/support/");
КонецПроцедуры

&НаКлиенте
Процедура Меню_Программа_все(Команда)
	ЗапуститьПриложение("https://vk.com/topic-134718093_40237553");
КонецПроцедуры

&НаКлиенте
Процедура Меню_Новость_Вк(Команда)
	ЗапуститьПриложение("https://vk.com/it_nirax");
КонецПроцедуры

&НаКлиенте
Процедура Меню_Новость_Тг(Команда)
	ЗапуститьПриложение("https://t.me/it_nirax");
КонецПроцедуры

&НаКлиенте
Процедура Меню_Помощь_Вк(Команда)
	ЗапуститьПриложение("https://vk.com/im?sel=-134718093");
КонецПроцедуры

&НаКлиенте
Процедура Меню_Видео_Вк(Команда)
	ЗапуститьПриложение("https://vk.com/videos-134718093?section=album_4");
КонецПроцедуры

&НаКлиенте
Процедура Меню_Видео_YouTube(Команда)
	ЗапуститьПриложение("https://www.youtube.com/user/1CNirax/featured");
КонецПроцедуры

&НаКлиенте
Процедура Меню_Помощь_Тг(Команда)
	ЗапуститьПриложение("https://t.me/nirax_01");
КонецПроцедуры

&НаКлиенте
Процедура НомерАртикулаПриИзменении(Элемент)
	Если Элементы.НомерАртикула.СписокВыбора.НайтиПоЗначению(Объект.НомерАртикула) = Неопределено Тогда
		Элементы.НомерАртикула.СписокВыбора.Вставить(0,Объект.НомерАртикула);
	КонецЕсли;	
	
//	НайтиАртикулВыполнить()

КонецПроцедуры

&НаКлиенте
Процедура КартинкаНираксНажатие(Элемент)
	ЗапуститьПриложение("https://nirax.ru/products/auto_assistant");
КонецПроцедуры

&НаКлиенте
Процедура FAQ_БК(Команда)
	ЗапуститьПриложение("https://youtu.be/MpfecuC9_O4");
КонецПроцедуры

&НаКлиенте
Процедура FAQ_Прайс(Команда)
	ЗапуститьПриложение("https://youtu.be/jvA5VGh_hIk");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовСтраницыПоискаПоАртикулу

&НаКлиенте
Процедура ПредПриИзменении(Элемент)
	Если Элемент=Элементы.Пред4 Тогда
		Пред2=Пред4;
	КонецЕсли;
	Если Элемент=Элементы.Пред0 И Пред0 Тогда 
		Пред1=Истина; Пред2=Истина; Пред3=Истина;
		Пред4=Истина; Пред5=Истина;
		Элементы.Пред0.Доступность=Ложь;
	ИначеЕсли Пред1 И Пред2 И Пред3 И Пред4 И Пред5 Тогда
		Пред0=Истина;
		Элементы.Пред0.Доступность=Ложь;
	ИначеЕсли НЕ (Пред1 ИЛИ Пред2 ИЛИ Пред3 ИЛИ Пред4 ИЛИ Пред5) Тогда
		Пред1=Истина;
	Иначе
		Пред0=Ложь;
		Элементы.Пред0.Доступность=Истина;
	КонецЕсли;
	Предикат=Сред(?(Пред1,", '1'","")+?(Пред2,", '2'","")+?(Пред3,", '3'","")
	+?(Пред4,", '4'","")+?(Пред5,", '5'",""),3);
КонецПроцедуры

&НаКлиенте
Процедура Пред0ПриИзменении(Элемент)
	ПредПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Пред1ПриИзменении(Элемент)
	ПредПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Пред3ПриИзменении(Элемент)
	ПредПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Пред4ПриИзменении(Элемент)
	ПредПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Пред5ПриИзменении(Элемент)
	ПредПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПриИзменении(Элемент)
	Если Элемент=Элементы.ФильтрСклад И 
		ТипЗнч(Элементы.Результат.ТекущаяОбласть)=Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		ТекСтр=Элементы.Результат.ТекущаяОбласть.Верх;
		ТекКол=Элементы.Результат.ТекущаяОбласть.Лево;
	Иначе
		ТекСтр=1;ТекКол=1;
	КонецЕсли;
	
	ФильтрПриИзмененииНаСервере();
	ТекущаяОбласть=Результат.Область(ТекСтр,ТекКол,ТекСтр,ТекКол);
	Элементы.Результат.ТекущаяОбласть=ТекущаяОбласть;
КонецПроцедуры

&НаСервере
Процедура ФильтрПриИзмененииНаСервере()
	Обработка=РеквизитФормыВЗначение("Объект");
	ТЗ = РезультатПоискаТЗ.Выгрузить();
	Если ПустаяСтрока(Объект.ФильтрМарка) Тогда
		КолСтр=Обработка.ВыводРезультатаПоиска(ТЗ,Результат);
	Иначе
		Структура = Новый Структура("поставщик",Объект.ФильтрМарка);
		Массив = ТЗ.НайтиСтроки(Структура);
		КолСтр=Обработка.ВыводРезультатаПоиска(Массив, Результат);
	КонецЕсли;
	Элементы.СтраницаПоискПоАртикулу.Заголовок="по Базе Кроссов ("+Строка(КолСтр)+")";
КонецПроцедуры

&НаКлиенте
Процедура ФильтрМаркаПриИзменении(Элемент)
	ФильтрПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСкладПриИзменении(Элемент)
	ФильтрПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТипЦенПриИзменении(Элемент)
	ТекСтр=1;ТекКол=1;
	ФильтрПриИзмененииНаСервере();
	ТекущаяОбласть=Результат.Область(ТекСтр,ТекКол,ТекСтр,ТекКол);
	Элементы.Результат.ТекущаяОбласть=ТекущаяОбласть;
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
		
	СтандартнаяОбработка=Ложь;
	Если Расшифровка=Неопределено тогда
		Если ТипЗнч(Элемент.ТекущаяОбласть)=Тип("РисунокТабличногоДокумента") тогда
			Расшифровка=Элемент.ТекущаяОбласть.Расшифровка;
		иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	Попытка

		Если Расшифровка.Действие="ДобавитьВЗаявку" Тогда
			Если Не ИзменятьКорзину Тогда 
				Сообщить("Корзина в режиме просмотра - переключите ее в режим изменения");
				Возврат;
			КонецЕсли;
			Если Объект.КонтрольОстатков И Расшифровка.Остаток=0 Тогда
				Попытка
					ТекстОшибки="Для оформления заявки с нулевыми остатками требуется в настройках убрать признак контроля остатков";
					ПоказатьПредупреждение(,ТекстОшибки);
				Исключение
					Сообщить(ТекстОшибки);
				Конецпопытки;
				Возврат;
			КонецЕсли;
			
			ПередачаПараметров=Новый Структура;
			ПередачаПараметров.Вставить("Номенклатура",Расшифровка.Номенклатура);
			ПередачаПараметров.Вставить("Производитель",Расшифровка.Производитель);  
			ПередачаПараметров.Вставить("Склад",Объект.ФильтрСклад);
			Если (Объект.ЗапрашиватьКоличество ИЛИ Объект.ЗапрашиватьЦену ИЛИ Объект.ЗапрашиватьСкидку) Тогда
				ПередачаПараметров.Вставить("Остаток",Расшифровка.Остаток);
				ПередачаПараметров.Вставить("ЦенаПоУмолчанию",Расшифровка.Цена);
				ПередачаПараметров.Вставить("КонтрольОстатков",Объект.КонтрольОстатков);
				ПередачаПараметров.Вставить("ЗапрашиватьКолво",Объект.ЗапрашиватьКоличество);
				ПередачаПараметров.Вставить("ЗапрашиватьЦену",Объект.ЗапрашиватьЦену);
				ПередачаПараметров.Вставить("ЗапрашиватьСкидку",Объект.ЗапрашиватьСкидку);
				
				Оповещение=Новый ОписаниеОповещения("ДобавитьВЗаявкуНаСервере",ЭтаФорма,Неопределено);
				ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ВыборКоличестваУФ",ПередачаПараметров,ЭтаФорма,Истина,,,Оповещение);
			Иначе
				ПередачаПараметров.Вставить("Количество",1);
				ПередачаПараметров.Вставить("Цена",Расшифровка.Цена);
				ПередачаПараметров.Вставить("Скидка",0);
				ДобавитьВЗаявкуНаСервере(ПередачаПараметров);
			КонецЕсли;
			Возврат;
		ИначеЕсли Расшифровка.Действие="ОткрытьФорму" Тогда
			ПараметрыФормы=Новый Структура("Ключ",Расшифровка.Значение);
			ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта",ПараметрыФормы);
		ИначеЕсли Расшифровка.Действие = "ДополнитьИнформацию" Тогда
			ОбработкаРасшифровкиНаСервере(Расшифровка, Элемент.Имя);
			Если ЗначениеЗаполнено(Расшифровка.Номенклатура) Тогда
				Ключ = Новый Структура("Ключ", Расшифровка.Номенклатура);
				ФормаЭлемента=ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта", Ключ);
			КонецЕсли;	
			
		// если дополняем информацию	
		ИначеЕсли Расшифровка.Действие="ДобавитьДетальВБазу" Тогда
			Если Объект.ЕстьНоменклатура Тогда
				ТипНомера=Неопределено;
	        	Номенклатура=ДобавитьТоварВБазуНаСервере(Расшифровка.Значение, ТипНомера,Элемент.Имя,Расшифровка.НомерКартинки);
				
				Если ЗначениеЗаполнено(Номенклатура) Тогда
					Если Объект.ЗапрашиватьГруппуНоменклатуры Тогда
						ПараметрыФормы = Новый Структура("УникальныйИдентификатор", новый УникальныйИдентификатор);
						Оповещение = Новый ОписаниеОповещения("ВходВгруппу", ЭтаФорма, Номенклатура);
						ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы",ПараметрыФормы,,,,,Оповещение);
					Иначе
						ПараметрыФормы=Новый Структура("Ключ",Номенклатура);
						ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта",ПараметрыФормы);
					КонецЕсли;
				КонецЕсли;
			Иначе
				Сообщить("В данной конфигурации нет справочника ""Номенклатура""");
			КонецЕсли;
		ИначеЕсли Расшифровка.Действие = "Назад" Тогда
			Если Элемент.Имя="Результат1" Тогда
				Элементы.Результат1.Видимость=Ложь;
				Элементы.Результат.Видимость=Истина;
			Иначе
				Элементы.РезультатПоДереву1.Видимость=Ложь;
				Элементы.РезультатПоДереву.Видимость=Истина;
			КонецЕсли;
		ИначеЕсли Расшифровка.Действие="РасшифровкаДляПроценки" Тогда
			Объект.НомерАртикула = Расшифровка.Значение;
			ЭтаФорма.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.Элементы.ПоискЕмекс;
			ПоискПоАртикулу();
		Иначе
			ОбработкаРасшифровкиНаСервере(Расшифровка,Элемент.Имя);
		КонецЕсли;
		
	Исключение
		
		Сообщить(ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовСтраницыПоискаПоПрайсу

&НаКлиенте
Процедура УровеньЦенПриИзменении(Элемент)
	
	ИзменениеУровняЦенНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура ИзменениеУровняЦенНаСервере()
	Если РезультатПоискаПрайс.Количество()>0 Тогда
		Обработка=РеквизитФормыВЗначение("Объект");
		КолПрайс=Обработка.ВыводРезультатаПоискаПрайс(РезультатПоискаПрайс, РезультатПрайс);
		Элементы.СтраницаПоискПоПрайсу.Заголовок="по Прайс-листам ("+Строка(КолПрайс)+")";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСкладПрайсПриИзменении(Элемент)
	Если РезультатПоискаПрайс.Количество()>0 Тогда
		ФильтрСкладПрайсПриИзмененииНаСервере()
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ФильтрСкладПрайсПриИзмененииНаСервере()
	Обработка=РеквизитФормыВЗначение("Объект");
	КолПрайс=Обработка.ВыводРезультатаПоискаПрайс(РезультатПоискаПрайс, РезультатПрайс);
	Элементы.СтраницаПоискПоПрайсу.Заголовок="по Прайс-листам ("+Строка(КолПрайс)+")";
КонецПроцедуры

&НаКлиенте
Процедура РезультатПрайсОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Расшифровка=Неопределено тогда
		Если ТипЗнч(Элемент.ТекущаяОбласть)=Тип("РисунокТабличногоДокумента") тогда
			Расшифровка=Элемент.ТекущаяОбласть.Расшифровка;
		иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	ЕСли Расшифровка.Действие = "Открыть" Тогда
		ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта",Новый Структура("Ключ",Расшифровка.Значение));
		
	ИначеЕсли Расшифровка.Действие = "ДобавитьВЗаявкуПрайс" Тогда
		Если Не ИзменятьКорзину Тогда 
			Сообщить("Корзина в режиме просмотра - переключите ее в режим изменения");
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Расшифровка.Номенклатура) Тогда
			ТекНоменклатура = Расшифровка.Номенклатура;
		Иначе
			ТекНоменклатура = Расшифровка.Название;
		КонецЕсли;
					
		ПроверкаОтбор = Новый Структура("Номенклатура, Поставщик, Склад", ТекНоменклатура, Расшифровка.Поставщик, Объект.ФильтрСкладПрайс);
		ПроверкаСуществования = Объект.ЗаявкаПоставщику.НайтиСтроки(ПроверкаОтбор);
		Попытка 
			Остаток=Число(Расшифровка.Остаток)-?(ПроверкаСуществования.Количество()=0,0,ПроверкаСуществования[0].Количество);
		Исключение
			Остаток = 0;	
		КонецПопытки;
		Если Остаток<=0 И Объект.КонтрольОстатков Тогда
			ТекстОшибки="Для оформления заказа с нулевыми остатками требуется в настройках убрать признак контроля остатков";
			Попытка
				ПоказатьПредупреждение(,ТекстОшибки);
			Исключение
				Сообщить(ТекстОшибки);
			Конецпопытки;
			Возврат;
		КонецЕсли;
		
		Если Объект.ЗапрашиватьКоличество ИЛИ Объект.ЗапрашиватьЦену ИЛИ Объект.ЗапрашиватьСкидку Тогда
			ПередачаПараметров = Новый Структура(
			"Номенклатура,Производитель,Склад,Остаток,ЦенаПоУмолчанию,КонтрольОстатков,ЗапрашиватьКолво,ЗапрашиватьЦену,ЗапрашиватьСкидку",
			ТекНоменклатура,Расшифровка.Производитель,Объект.ФильтрСкладПрайс,Остаток,Расшифровка.Цена,Объект.КонтрольОстатков,
			Объект.ЗапрашиватьКоличество, Объект.ЗапрашиватьЦену, Объект.ЗапрашиватьСкидку);
			Оповещение=Новый ОписаниеОповещения("ОбработкаРасшифровкиПрайсНаСервере",ЭтаФорма,Расшифровка);
			ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ВыборКоличестваУФ",ПередачаПараметров,ЭтаФорма,Истина,,,Оповещение)
		Иначе
			Данные=Новый Структура("Номенклатура,Производитель,Склад,Количество,Цена,Скидка",
			ТекНоменклатура,Расшифровка.Производитель,Объект.ФильтрСкладПрайс,1,Расшифровка.Цена,0);
			ОбработкаРасшифровкиПрайсНаСервере(Данные,Расшифровка)
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовСтраницыПоискаОнлайн

&НаКлиенте
Процедура ФильтрПоставщикЕмексПриИзменении(Элемент)
	//Элементы.РезультатПоискаОнлайн.ОтборСтрок = Новый ФиксированнаяСтруктура("ИсточникИнформации", Элемент.ВыделенныйТекст);  
	УстановитьОтборФильтр();
КонецПроцедуры
&НаКлиенте
Процедура ФильтрПоставщикЕмексОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Объект.ФильтрПоставщикЕмекс=ВыбранноеЗначение;
	Элементы.ФильтрПоставщикЕмекс.СписокВыбора.ЗаполнитьПометки(Ложь);
	Элементы.ФильтрПоставщикЕмекс.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение).Пометка=Истина;
	УстановитьОтборФильтр();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоставщикЕмексНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Если Элементы.ФильтрПоставщикЕмекс.СписокВыбора.Количество()=0 Тогда Возврат;КонецЕсли;
	Оповещение=Новый ОписаниеОповещения("ФильтрПоставщикЕмексУстановитьВыбор",ЭтаФорма);
	ПараметрыФормы=Новый Структура("СписокЗначений,Групповой,ТекущаяСтрока,Заголовок",
	Элементы.ФильтрПоставщикЕмекс.СписокВыбора,Истина,0,"Выбор производителей");
	ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ФормаСпискаУФ",
	ПараметрыФормы,ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоставщикЕмексУстановитьВыбор(Список, доп) Экспорт
	Если Список=Неопределено тогда Возврат; КонецЕсли;
	Бренды = Новый Массив;
	Строка="";
	Для Каждого Стр Из Список Цикл
		Если Стр.Пометка и Бренды.Найти(Стр.Значение)=Неопределено Тогда
			Бренды.Добавить(Стр.Значение);
			Строка=Строка+Стр.Значение+";";
			Элементы.ФильтрПоставщикЕмекс.СписокВыбора[Список.Индекс(Стр)].Пометка=Истина;
		КонецЕсли;
	КонецЦикла;	
	Объект.ФильтрПоставщикЕмекс=Строка;
	Элементы.ФильтрПоставщикЕмекс.ОбновитьТекстРедактирования();
	УстановитьОтборФильтр();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоставщикЕмексОчистка(Элемент, СтандартнаяОбработка)
	Объект.ФильтрПоставщикЕмекс="";
	Элементы.ФильтрПоставщикЕмекс.СписокВыбора.ЗаполнитьПометки(Ложь);
	УстановитьОтборФильтр();
КонецПроцедуры

//-------------------------------------------------
&НаКлиенте
Процедура ФильтрМаркаЕмексОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Объект.ФильтрМаркаЕмекс=ВыбранноеЗначение;
	Элементы.ФильтрМаркаЕмекс.СписокВыбора.ЗаполнитьПометки(Ложь);
	Элементы.ФильтрМаркаЕмекс.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение).Пометка=Истина;
	УстановитьОтборФильтр();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрМаркаЕмексНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Если Элементы.ФильтрМаркаЕмекс.СписокВыбора.Количество()=0 Тогда Возврат;КонецЕсли;
	Оповещение=Новый ОписаниеОповещения("ФильтрМаркаЕмексУстановитьВыбор",ЭтаФорма);
	ПараметрыФормы=Новый Структура("СписокЗначений,Групповой,ТекущаяСтрока,Заголовок",
	Элементы.ФильтрМаркаЕмекс.СписокВыбора,Истина,0,"Выбор производителей");
	ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ФормаСпискаУФ",
	ПараметрыФормы,ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ФильтрМаркаЕмексУстановитьВыбор(Список, доп) Экспорт
	Если Список=Неопределено тогда Возврат; КонецЕсли;
	Бренды = Новый Массив;
	Строка="";
	Для Каждого Стр Из Список Цикл
		Если Стр.Пометка и Бренды.Найти(Стр.Значение)=Неопределено Тогда
			Бренды.Добавить(Стр.Значение);
			Строка=Строка+Стр.Значение+";";
			Элементы.ФильтрМаркаЕмекс.СписокВыбора[Список.Индекс(Стр)].Пометка=Истина;
		КонецЕсли;
	КонецЦикла;	
	Объект.ФильтрМаркаЕмекс=Строка;
	Элементы.ФильтрМаркаЕмекс.ОбновитьТекстРедактирования();
	УстановитьОтборФильтр();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрМаркаЕмексОчистка(Элемент, СтандартнаяОбработка)
	Объект.ФильтрМаркаЕмекс="";
	Элементы.ФильтрМаркаЕмекс.СписокВыбора.ЗаполнитьПометки(Ложь);
	УстановитьОтборФильтр();
КонецПроцедуры

&НаКлиенте
Процедура УровеньЦенЕмексПриИзменении(Элемент)
	УровеньЦенЕмексПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура УровеньЦенЕмексПриИзмененииНаСервере()
	Обработка=РеквизитФормыВЗначение("Объект");
	Обработка.НаценкаЦен(Объект.РезультатПоискаОнлайн, Объект.УровеньЦенЕмекс,Новый Структура("Производитель,Поставщик,Покупка,Продажа",
		"Бренд","Сайт","Цена","ЦенаПродажи"));
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборФильтр()
	Для Каждого Стр из Объект.РезультатПоискаОнлайн Цикл
		Стр.ОтборФильтр = (Не ОтборСокращеннаяВыдача или Стр.ОтборСписок) 	// СокращеннаяВыдачаРезультата
		И (Не ОтборНаличиеНаСкладе или Стр.НаличиеНаСкладе)		  	  		// НаличиеНаСкладе
		И (Не ОтборНаличиеУПоставщика или Стр.НаличиеУПоставщика)       	// НаличиеУПоставщика
		И (ПустаяСтрока(Объект.ФильтрПоставщикЕмекс) или Найти(";"+Объект.ФильтрПоставщикЕмекс+";",";"+Стр.ИсточникИнформации+";")>0) 
		//Стр.ИсточникИнформации=Объект.ФильтрПоставщикЕмекс)      // Поставщик
		И (ПустаяСтрока(Объект.ФильтрМаркаЕмекс) или Найти(";"+Объект.ФильтрМаркаЕмекс+";",";"+Стр.Бренд+";")>0); //Бренд
	КонецЦикла;
	Элементы.РезультатПоискаОнлайн.ОтборСтрок=Новый ФиксированнаяСтруктура("ОтборФильтр",Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовСтраницыПоискаПоАвтомобилю

&НаКлиенте
Процедура ТипАвтоПриИзменении(Элемент)
	Если ТипАвто="коду двигателя" Тогда
		Элементы.НомерVIN.Видимость=Ложь;
		Элементы.НайтиПоВин.Видимость=Ложь;
		Элементы.ФильтрМодельАвто.Видимость=Ложь;
		Элементы.ФильтрФирмаАвто.Видимость=Истина;
		Элементы.КодДвигателя.Видимость=Истина;
	ИначеЕсли ТипАвто="VIN номеру" Тогда
		Элементы.ФильтрМодельАвто.Видимость=Ложь;
		Элементы.КодДвигателя.Видимость=Ложь;
		Элементы.ФильтрФирмаАвто.Видимость=Ложь;
		Элементы.НомерVIN.Видимость=Истина;
		Элементы.НайтиПоВин.Видимость=Истина;
		НомерVIN="";
		Элементы.РезультатУзлы.Доступность=Ложь;
		Возврат;
	Иначе
		Элементы.НомерVIN.Видимость=Ложь;
		Элементы.НайтиПоВин.Видимость=Ложь;		
		Элементы.КодДвигателя.Видимость=Ложь;
		Элементы.ФильтрФирмаАвто.Видимость=Истина;
		Элементы.ФильтрМодельАвто.Видимость=Истина;
		Если ТипАвто="" Тогда
			ТипАвто="всем автомобилям";
		КонецЕсли;
	КонецЕсли;
	Элементы.ФильтрФирмаАвто.СписокВыбора.Очистить();
	ФильтрФирмаАвто="";
	КодДвигателя="";
	НомерVIN="";
	Состояние("Производится загрузка списка торговых марок. Пожалуйста подождите.");
	
	//Элементы.ФильтрФирмаАвто.СписокВыбора.ВыбратьЭлемент();
	Элементы.ФильтрМодельАвто.СписокВыбора.Очистить();
	Элементы.ФильтрМодельАвто.Доступность=Ложь;
	Элементы.ЗагрузитьПоМодели.Доступность=Ложь;
	Элементы.РезультатУзлы.Доступность=Истина;

	//Вызовем процедуру вывода марок
	ВыводМарокАвтоНаСервере();
	Состояние();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрФирмаАвтоПриИзменении(Элемент)
	КодДвигателя="";	
	Если ФильтрФирмаАвто="" Тогда	
		Элементы.ФильтрМодельАвто.СписокВыбора.Очистить(); 
		ФильтрМодельАвто = "";
		Элементы.ФильтрМодельАвто.Доступность=Ложь;
		Элементы.ЗагрузитьПоМодели.Доступность=Ложь;
		Состояние("Производится загрузка списка торговых марок.       Ж Д И Т Е . . .");
		ВыводМарокАвтоНаСервере();
	Иначе
		ФильтрМодельАвто="";
		Состояние("Производится загрузка марок автомобилей.        Ж Д И Т Е . . .");
		ВыводОтфильтрованныхМарокАвтоНаСервере();
		Элементы.ФильтрМодельАвто.Доступность=Истина;
	КонецЕсли;
	Состояние();
	
КонецПроцедуры

&НаСервере
Процедура ВыводМарокАвтоНаСервере()
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ВыводМарокАвто(ТипАвто,РезультатУзлы,Элементы.ФильтрФирмаАвто.СписокВыбора,ТЗДляФильтраМарок);
КонецПроцедуры

&НаСервере
Процедура ВыводОтфильтрованныхМарокАвтоНаСервере()
	Обработка = РеквизитФормыВЗначение("Объект");
	МСтрФирма=ТЗДляФильтраМарок.НайтиСтроки(Новый Структура("MFA_BRAND",ФильтрФирмаАвто));
	Если НРЕГ(Лев(ТипАвто,1))="к" Тогда
		Обработка.ВыводОтфильтрованныхМарокАвто(МСтрФирма[0],РезультатУзлы,Элементы.КодДвигателя.СписокВыбора,Истина);
	Иначе
		Обработка.ВыводОтфильтрованныхМарокАвто(МСтрФирма[0],РезультатУзлы,Элементы.ФильтрМодельАвто.СписокВыбора);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КодДвигателяПриИзменении(Элемент)
	Состояние("Производится загрузка комплектаций автомобилей.         Ж Д И Т Е . . .");
	УзлыОбработкаНаСервере(Новый Структура("Действие,Значение", "РасшифровкаДвигателя", КодДвигателя), Неопределено);
	Состояние();
КонецПроцедуры

&НаСервере
Процедура УзлыОбработкаНаСервере( Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	Попытка
		Если Расшифровка.Действие="РасшифровкаМодели" Тогда
			//Запомним таблицу до расшифровки
			Если РезультатУзлы.Область(2,1,2,1).Текст<>"Типы комплектаций:" Тогда
				РезультатМарокДляВозврата.Очистить();
				РезультатМарокДляВозврата.Вывести(РезультатУзлы);
				РезультатМарокДляВозврата.ТекущаяОбласть=Элементы.РезультатУзлы.ТекущаяОбласть;
			КонецЕсли;
			ФильтрМодельАвто=Элементы.РезультатУзлы.ТекущаяОбласть.Текст;
			Обработка = РеквизитФормыВЗначение("Объект");
			Обработка.ВыводТаблицыТипов(Расшифровка.Значение, РезультатУзлы);
		ИначеЕсли Расшифровка.Действие="РасшифровкаБренда" Тогда
			//Запомним таблицу до расшифровки
			ФильтрФирмаАвто=Расшифровка.Значение;
			ФильтрМодельАвто="";
			ВыводОтфильтрованныхМарокАвтоНаСервере();
			Элементы.ФильтрМодельАвто.Доступность=Истина;
		ИначеЕсли Расшифровка.Действие="НазадКМаркам" Тогда
			//вернем таблице исходный марочный вид
			РезультатУзлы.Очистить();
			РезультатУзлы.Вывести(РезультатМарокДляВозврата);
			Элементы.РезультатУзлы.ТекущаяОбласть=РезультатМарокДляВозврата.ТекущаяОбласть;
		ИначеЕсли Расшифровка.Действие="РасшифровкаОписания" Тогда
			Элементы.Группа4.Видимость=Ложь;
			Элементы.Группа5.Видимость=Истина;
			Обработка = РеквизитФормыВЗначение("Объект");
			Обработка.ВыводУзлов(Расшифровка.Значение, РезультатПоДереву, УзловоеДерево);
			ТипАвтоИзТаблицыТипов = Расшифровка.Значение;
			РезультатПоДереву.Очистить();
		ИначеЕсли Расшифровка.Действие="РасшифровкаДвигателя" Тогда
			Если РезультатУзлы.Область(2,1,2,1).Текст<>"Типы комплектаций:" Тогда
				РезультатМарокДляВозврата.Очистить();
				РезультатМарокДляВозврата.Вывести(РезультатУзлы);
				РезультатМарокДляВозврата.ТекущаяОбласть=Элементы.РезультатУзлы.ТекущаяОбласть;
			КонецЕсли;
			Если КодДвигателя<>Расшифровка.Значение Тогда КодДвигателя=Расшифровка.Значение;КонецЕсли;
			Обработка = РеквизитФормыВЗначение("Объект");
			Обработка.ВыводТаблицыТипов(Расшифровка.Значение, РезультатУзлы,Истина);
		КонецЕсли;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ФильтрМодельАвтоПриИзменении(Элемент)
	
	Если Элемент.ВыделенныйТекст="" Тогда	
		Состояние("Производится загрузка марок автомобилей.        Ж Д И Т Е . . .");
		ВыводОтфильтрованныхМарокАвтоНаСервере();
		Элементы.ЗагрузитьПоМодели.Доступность=Ложь;
	Иначе
		Состояние("Производится загрузка модели автомобиля.        Ж Д И Т Е . . .");
		ФильтрМодельАвтоПриИзмененииНаСервере();
		Элементы.ЗагрузитьПоМодели.Доступность=Истина;
	КонецЕсли;
	Состояние();
	
КонецПроцедуры

Процедура ФильтрМодельАвтоПриИзмененииНаСервере()
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ВыводОтфильтрованныхМоделейАвто(ФильтрФирмаАвто,ФильтрМодельАвто,РезультатУзлы,ТЗДляФильтраМарок);
	Элементы.РезультатУзлы.ТекущаяОбласть=РезультатУзлы.Область(1,1,1,1);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатУзлыОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	Если Расшифровка=Неопределено тогда
		Если ТипЗнч(Элемент.ТекущаяОбласть)=Тип("РисунокТабличногоДокумента") тогда
			Расшифровка=Элемент.ТекущаяОбласть.Расшифровка;
		иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	Если Расшифровка.Действие="ЗагрузитьПоКомплектации" Тогда
		Состояние("Производится загрузка комплектующих автомобиля.  Ж Д И Т Е . . .");
		ПараметрыФормы=Новый Структура("Комплект", Расшифровка.Значение);
		ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ФормаЗагрузкиУФ",ПараметрыФормы,ЭтаФорма);
	Иначе
		Состояние("Производится загрузка комплектаций автомобилей.         Ж Д И Т Е . . .");
		УзлыОбработкаНаСервере(Расшифровка, СтандартнаяОбработка);
	КонецЕсли;
	Состояние();
	
КонецПроцедуры

&НаКлиенте
Процедура УзловоеДеревоПриАктивизацииСтроки(Элемент)
	
	попытка
		Если Элементы.УзловоеДерево.ТекущиеДанные<>Неопределено И Элементы.УзловоеДерево.ТекущиеДанные.ПолучитьЭлементы().Количество()=0 Тогда
			Если Элемент.ТекущиеДанные.Айди <> ОбработанныйУзелАйди или ОбработанныйУзелАйди="" тогда
				Элементы.РезультатПоДереву1.Видимость=Ложь;
				Элементы.РезультатПоДереву.Видимость=Истина;
				ОбработанныйУзелАйди=Элементы.УзловоеДерево.ТекущиеДанные.Айди;
				Состояние("Производится загрузка данных о комплектующих.     Ж Д И Т Е . . .");
				ПриАктивизацииНаСервере(Число(Элемент.ТекущиеДанные.айди));
				Состояние();
			КонецЕсли;
		КонецЕсли;
	Исключение
		сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере                
Процедура ПриАктивизацииНаСервере(ТекДан) Экспорт
	РезультатПоДереву.Очистить();
	Обработка = РеквизитФормыВЗначение("Объект");
	ТЗРасшифровкаУзлов="";
	Обработка.ВыводРезультатаПоУзлам(ТЗРасшифровкаУзлов, РезультатПоДереву, ТекДан, 
	Элементы.РезультатУзлы.ТекущаяОбласть.Расшифровка.Значение);
КонецПроцедуры

&НаКлиенте
Процедура РезультатПоДеревуОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура РезультатПоДереву1ОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
КонецПроцедуры

&НаСервере
Процедура НайтиПоВинНаСервере(Вин)
	//РезультатПоДереву.Очистить();
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ВыводТаблицыТипов(Вин, РезультатУзлы,2);
	Элементы.РезультатУзлы.ТекущаяОбласть=РезультатУзлы.Область(1,1,1,1);
КонецПроцедуры

&НаКлиенте
Процедура НайтиПоВин(Команда)
	НомерVIN=СокрЛП(ВРЕГ(НомерVIN));
	Если СтрДлина(НомерVIN)<>17 Тогда
		ПоказатьПредупреждение(,"VIN номер должен содержать 17 символов, а в наличии "+СтрДлина(НомерVIN));
		Возврат;
	КонецЕсли;
	НайтиПоВинНаСервере(НомерVIN);
	Элементы.РезультатУзлы.Доступность=Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовСтраницыКорзина

// Функция возвращает структуру с ключами "ДоговорПустой" - Пустая ссылка на договор,
// "Текст" - текст запроса без начальной фразы: "ВЫБРАТЬ РАЗРЕШЕННЫЕ [ПЕРВЫЕ 1]"
// Если КонтрагентЗадан   = Истина - тогда в запрос включается отбор по контрагенту
// Если ОрганизацияЗадана = Истина - тогда в запрос включается отбор по организации
// Результат запроса содержит только 1 реквизит: Договор - ссылка на договор.
//
&НаСервереБезКонтекста
Функция СформироватьЗапросДоговора(КонтрагентЗадан, ОрганизацияЗадана)
	Если Метаданные.Справочники.Найти("ДоговорыКонтрагентов") <> Неопределено Тогда
		Мета=Метаданные.Справочники.ДоговорыКонтрагентов;
		Договоры="ДоговорыКонтрагентов";
		ДоговорПустой=Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	ИначеЕсли Метаданные.Справочники.Найти("ДоговорыВзаиморасчетов") <> Неопределено Тогда
		Мета=Метаданные.Справочники.ДоговорыВзаиморасчетов;
		Договоры="ДоговорыВзаиморасчетов";
		ДоговорПустой=Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	Иначе Возврат Неопределено; 
	КонецЕсли;
	
	Если Мета.Реквизиты.Найти("Контрагент")<>Неопределено Тогда 
		ИмяКонтрагент="Контрагент";
	ИначеЕсли Мета.Владельцы.Содержит(Метаданные.Справочники.Контрагенты) Тогда
		ИмяКонтрагент="Владелец";
	Иначе Возврат "";
	КонецЕсли;
	
	Если Мета.Реквизиты.Найти("ВидДоговора")<>Неопределено ТОгда
		ВидДоговора=Новый Структура("Имя, Значение", "ВидДоговора"); 
		Если Метаданные.Перечисления.ВидыДоговоров.ЗначенияПеречисления.Найти("СПокупателем")<>Неопределено Тогда
			ВидДоговора.Значение="ВидыДоговоров.СПокупателем";
		ИначеЕсли Метаданные.Перечисления.ВидыДоговоров.ЗначенияПеречисления.Найти("Продажа")<>Неопределено Тогда
			ВидДоговора.Значение="ВидыДоговоров.Продажа";
		Иначе
			ВидДоговора=Неопределено;
		КонецЕсли;
	ИначеЕсли Мета.Реквизиты.Найти("ТипДоговора")<>Неопределено
		И Метаданные.Перечисления.ТипыДоговоров.ЗначенияПеречисления.Найти("СПокупателем")<>Неопределено Тогда
		ВидДоговора=Новый Структура("Имя, Значение", "ТипДоговора", "ТипыДоговоров.СПокупателем");
	КонецЕсли;
	
	Если Мета.Реквизиты.Найти("Дата")<>Неопределено ТОгда
		Дата="Дата";
	ИначеЕсли Мета.Реквизиты.Найти("ДатаДоговора")<>Неопределено ТОгда
		Дата="ДатаДоговора";
	Иначе
		Дата=Неопределено;
	КонецЕсли;
		
	ЕстьОсновной=Метаданные.РегистрыСведений.Найти("ОсновныеДоговорыКонтрагента")<>Неопределено;
	
	Текст="
		|Договоры.Ссылка КАК Договор" + ?(ЕстьОсновной,",
		|	НЕ ОсновныеДоговорыКонтрагента.Договор ЕСТЬ NULL КАК Основной","") + "
		|ИЗ
		|	Справочник."+Договоры+" КАК Договоры" + ?(ЕстьОсновной,"
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеДоговорыКонтрагента КАК ОсновныеДоговорыКонтрагента
		|		ПО Договоры.Ссылка = ОсновныеДоговорыКонтрагента.Договор","")+ "
		|ГДЕ "+?(КонтрагентЗадан, "
		|	Договоры."+ИмяКонтрагент+" = &Контрагент","ИСТИНА")+?(ОрганизацияЗадана,"
		|	И Договоры.Организация = &Организация","")+ ?(ВидДоговора=Неопределено,"","
		|	И Договоры."+ВидДоговора.Имя+" = ЗНАЧЕНИЕ(Перечисление."+ВидДоговора.Значение+")")
		+ ?(Мета.Реквизиты.Найти("ДатаКонца")=Неопределено,""," 
		|	И (Договоры.ДатаКонца >= &ТекущаяДата ИЛИ Договоры.ДатаКонца = ДАТАВРЕМЯ(1, 1, 1))")
		+ ?(Мета.Реквизиты.Найти("ДатаОкончанияДействия")=Неопределено,""," 
		|	И (Договоры.ДатаОкончанияДействия >= &ТекущаяДата ИЛИ Договоры.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))")
		+ ?(Дата=Неопределено,"","
	    |УПОРЯДОЧИТЬ ПО " + ?(ЕстьОсновной,"
		|	Основной УБЫВ,","") + "
		|	Договоры."+Дата+" УБЫВ");
		
	Возврат Новый Структура("Текст,ДоговорПустой", Текст,ДоговорПустой); 
КонецФункции

&НаСервереБезКонтекста
Функция ЗаказКонтрагентПриИзмененииНаСервере(Контрагент, Организация)
	Рез=Новый Структура();
	ТелоЗапроса = СформироватьЗапросДоговора(ИСТИНА,ЗначениеЗаполнено(Организация));
	Если ТелоЗапроса= Неопределено тогда Возврат Рез; КонецЕсли;
	Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1 "+ТелоЗапроса.Текст);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	Запрос.УстановитьПараметр("Организация",Организация);
	ВЫб=Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() ТОгда
		Рез.Вставить("Договор", Выб.Договор);
	Иначе
		Рез.Вставить("Договор", ТелоЗапроса.ДоговорПустой);
	КонецЕсли;
	
	Если Метаданные.Справочники.Найти("СоглашенияСКлиентами")<>Неопределено Тогда
		Запрос=Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	СоглашенияСКлиентами.Ссылка КАК Соглашение
			|ИЗ
			|	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
			|ГДЕ
			|	СоглашенияСКлиентами.Организация = &Организация
			|	И СоглашенияСКлиентами.Контрагент = &Контрагент
			|
			|УПОРЯДОЧИТЬ ПО
			|	СоглашенияСКлиентами.Дата УБЫВ"
		);
		Запрос.УстановитьПараметр("Контрагент", Контрагент); //ДляЗаявки);	
		Запрос.УстановитьПараметр("Организация",Организация);
		Выб=Запрос.Выполнить().Выбрать();
		Если Выб.Следующий() ТОгда
			Рез.Вставить("Соглашение", Выб.Соглашение);
		Иначе
			Рез.Вставить("Соглашение", Справочники.СоглашенияСКлиентами.ПустаяСсылка());
		КонецЕсли;
	КонецЕсли;	
	Возврат Рез;
КонецФункции

&НаКлиенте
Процедура ЗаказКонтрагентПриИзменении(Элемент)
	Если Элементы.ЗаказДоговор.Видимость = Ложь Тогда Возврат; КонецЕсли;
	ТекДан=Элементы.ЗаказыКлиентов.ТекущиеДанные; 
	Если ЗначениеЗаполнено(ТекДан.Контрагент) Тогда
		Рез=ЗаказКонтрагентПриИзмененииНаСервере(ТекДан.Контрагент,Объект.ОрганизацияДляЗаявки);
		Если Рез.Свойство("Соглашение") И Рез.Соглашение.Пустая() Тогда
			Рез.Соглашение = Объект.ТиповоеСоглашение;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ТекДан,Рез);
	Иначе
		Мас=Новый Массив; Мас.Добавить(ТипЗнч(Объект.ДоговорДляЗаявки));
		Описание=Новый ОписаниеТипов(Мас);
		ТекДан.Договор=Описание.ПривестиЗначение("");
		Если Элементы.ЗаказСоглашение.Видимость Тогда
			ТекДан.Соглашение=Объект.ТиповоеСоглашение;
		КонецЕсли;
	КонецЕсли;
	ЗаказПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентДляЗаявкиПриИзменении(Элемент)
	ТекДан=Элементы.ЗаказыКлиентов.ТекущиеДанные; 
	ТекДан.Контрагент = Объект.КонтрагентДляЗаявки;
	ЗаказКонтрагентПриИзменении(Элемент);
	Возврат;
	
	ПараметрыВыбора=новый Массив();
	Если (Объект.Конфигурация="УправлениеНебольшойФирмой 1.6") Тогда
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Организация",Объект.ОрганизацияДляЗаявки));
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Контрагент",Объект.КонтрагентДляЗаявки));
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("КонтролироватьВыборДоговора",Истина));
	ИначеЕсли (Лев(Объект.Конфигурация,9) = "Автосалон") Тогда
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Организация",Объект.ОрганизацияДляЗаявки));
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец",Объект.КонтрагентДляЗаявки));
	Иначе
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Организация",Объект.ОрганизацияДляЗаявки));
		Если Лев(Объект.Конфигурация,22)="УправлениеТорговлей 11" ИЛИ Лев(Объект.Конфигурация,33) = "УправлениеТорговлейДляУкраины 3.0" Тогда
			Если ЗначениеЗаполнено(Объект.КонтрагентДляЗаявки) Тогда
				ПартнерДляОтбора = НайтиЗначениеПартнераПоКонтрагенту(Объект.КонтрагентДляЗаявки);
				Если ЗначениеЗАполнено(ПартнерДляОтбора) Тогда
					ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Партнер",ПартнерДляОтбора));
				Иначе
					ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Контрагент",Объект.КонтрагентДляЗаявки));
				КонецЕсли;
			КонецЕсли;
		Иначе
			ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Контрагент",Объект.КонтрагентДляЗаявки));
		КонецЕсли;
	КонецЕсли;
	Если Элементы.Соглашение.Видимость Тогда
		Если ЗначениеЗаполнено(Объект.ТиповоеСоглашение) Тогда
			Объект.Соглашение = Объект.ТиповоеСоглашение;	
		Иначе
			Элементы.Соглашение.ПараметрыВыбора=Новый ФиксированныйМассив(ПараметрыВыбора);
			Мас=Новый Массив();Мас.Добавить(ТипЗнч(Объект.Соглашение));
			ОТип=Новый ОписаниеТипов(Мас);
			Объект.Соглашение=ОТип.ПривестиЗначение("");
		КонецЕсли;
	КонецЕсли;
	Элементы.ДоговорДляЗаявки.ПараметрыВыбора=Новый ФиксированныйМассив(ПараметрыВыбора);
	Мас=Новый Массив();Мас.Добавить(ТипЗнч(Объект.ДоговорДляЗаявки));
	ОТип=Новый ОписаниеТипов(Мас);
	Объект.ДоговорДляЗаявки=ОТип.ПривестиЗначение("");
	Если (Лев(Объект.Конфигурация,9) = "Автосалон") Тогда
		Объект.ДоговорДляЗаявки = ЗаполнитьДоговорАА6(Объект.ОрганизацияДляЗаявки, Объект.КонтрагентДляЗаявки);		
	КонецЕсли;
	//зк(
	Если ТекДан<>Неопределено Тогда
		ТекДан.Контрагент=Объект.КонтрагентДляЗаявки;
		ТекДан.Соглашение=Объект.Соглашение;
		ТекДан.Договор=Объект.ДоговорДляЗаявки;
	КонецЕсли; 
	ЗаказКлиентаПриИзменении(Элемент);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаказДоговорНачалоВыбораНаСервере(ДанныеВыбора, Контрагент, Организация)
	ТелоЗапроса = СформироватьЗапросДоговора(ЗначениеЗаполнено(Контрагент),ЗначениеЗаполнено(Организация));
	Если ТелоЗапроса= Неопределено тогда Возврат; КонецЕсли;
	Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ "+ТелоЗапроса.Текст);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	Запрос.УстановитьПараметр("Организация",Организация);
	ДанныеВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Договор"));
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекДан=Элементы.ЗаказыКлиентов.ТекущиеДанные; 
	ДанныеВыбора=Новый СписокЗначений;
	ЗаказДоговорНачалоВыбораНаСервере(ДанныеВыбора, ТекДан.Контрагент, Объект.ОрганизацияДляЗаявки);
	Если ДанныеВыбора.Количество()>0 Тогда
		СтандартнаяОбработка=Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорСозданиеЗаписать(Рез,Рекв) Экспорт
	Если Рекв<>Неопределено И Не Рекв.Объект.Ссылка.Пустая() Тогда
		Элементы.ЗаказыКлиентов.ТекущиеДанные.Договор=Рекв.Объект.Ссылка;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаказДоговорСозданиеНаСервере(Контрагент)
	Если Метаданные.Справочники.Найти("ДоговорыКонтрагентов") <> Неопределено Тогда
		Мета=Метаданные.Справочники.ДоговорыКонтрагентов;
		Договоры="ДоговорыКонтрагентов";
		ДоговорПустой=Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	ИначеЕсли Метаданные.Справочники.Найти("ДоговорыВзаиморасчетов") <> Неопределено Тогда
		Мета=Метаданные.Справочники.ДоговорыВзаиморасчетов;
		Договоры="ДоговорыВзаиморасчетов";
		ДоговорПустой=Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	Иначе Возврат Неопределено; 
	КонецЕсли;
	
	Рекв=Новый Структура("ДоговорПустой,ДоговорИмя",ДоговорПустой,Договоры);
	Если ЕстьРеквизит1С(Мета,"Контрагент") Тогда 
		Рекв.Вставить("Контрагент",Контрагент);
	ИначеЕсли Мета.Владельцы.Содержит(Метаданные.Справочники.Контрагенты) Тогда
		Рекв.Вставить("Владелец",Контрагент);
	Иначе Возврат Неопределено;
	КонецЕсли;
	
	Если Мета.Реквизиты.Найти("Партнер")<>Неопределено Тогда 
		Рекв.Вставить("Партнер",Контрагент.Партнер);
	КонецЕсли;
	
	Рекв.Вставить("Наименование",Строка(Контрагент)+" - договор продажи");
	Рекв.Вставить("Организация",Объект.ОрганизацияДляЗаявки);
	
	Если Метаданные.ПараметрыСеанса.Найти("ТекущийПользователь")<>Неопределено Тогда
	   Пользователь = ПараметрыСеанса.ТекущийПользователь;
	ИначеЕсли Метаданные.ПараметрыСеанса.Найти("Пользователь")<>Неопределено Тогда
	    Пользователь=ПараметрыСеанса.Пользователь;
	ИначеЕсли Метаданные.ПараметрыСеанса.Найти("АвторизованныйПользователь")<>Неопределено Тогда
	    Пользователь=ПараметрыСеанса.АвторизованныйПользователь;
	Иначе
		Пользователь=Неопределено;
	КонецЕсли;
	
	Если ЕстьРеквизит1С(Мета,"Автор",Тип("СправочникСсылка.Пользователи")) Тогда
		Рекв.Вставить("Автор",Пользователь);
	КонецЕсли;
	
	Если ЕстьРеквизит1С(Мета,"Менеджер",Тип("СправочникСсылка.Пользователи")) Тогда
		Рекв.Вставить("Менеджер",Пользователь);
	ИначеЕсли Метаданные.Справочники.Найти("Сотрудники")<>Неопределено И 
		ЕстьРеквизит1С(Мета,"Менеджер",Тип("СправочникСсылка.Сотрудники"))И
		Метаданные.Справочники.Пользователи.Реквизиты.Найти("Сотрудник")<>Неопределено Тогда
		Рекв.Вставить("Менеджер",Пользователь.Сотрудник);
	КонецЕсли;
	
	//Подразделение
	Если ЕстьРеквизит1С(Мета,"ПодразделениеКомпании") Тогда
		рПодразделение="ПодразделениеКомпании";
	ИначеЕсли Мета.Реквизиты.Найти("Подразделение")<>Неопределено Тогда
		рПодразделение="Подразделение";
	КонецЕсли;
	Если рПодразделение<>Неопределено Тогда	
		Если Метаданные.ПараметрыСеанса.Найти("ПодразделениеКомпании")<>Неопределено Тогда
			Подразделение=ПараметрыСеанса.ПодразделениеКомпании;
		ИначеЕсли Пользователь<>Неопределено И Пользователь.Метаданные().Реквизиты.Найти("ТекущееПодразделение")<>Неопределено Тогда
			Подразделение=Пользователь.ТекущееПодразделение;
		ИначеЕсли Пользователь<>Неопределено И Пользователь.Метаданные().Реквизиты.Найти("Подразделение")<>Неопределено Тогда
			Подразделение=Пользователь.Подразделение;
		ИначеЕсли Метаданные.Справочники.Найти("СтруктурныеЕдиницы")<>Неопределено Тогда
			Попытка Подразделение=Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение; Исключение Конецпопытки;
		КонецЕсли;
		Если Подразделение <> Неопределено Тогда
			Рекв.Вставить(рПодразделение,Подразделение);
		КонецЕсли;
	КонецЕсли;
	
	//Согласован
	Если Мета.Реквизиты.Найти("Согласован")<>Неопределено Тогда
		Рекв.Вставить("Согласован",Истина);
	КонецЕсли;
	
	//Статус=Перечисления.СтатусыДоговоровКонтрагентов.Действует
	Если Метаданные.Перечисления.Найти("СтатусыДоговоровКонтрагентов")<>Неопределено И ЕстьРеквизит1С(Мета,"Статус",Тип("ПеречислениеСсылка.СтатусыДоговоровКонтрагентов")) Тогда
		Рекв.Вставить("Статус",Перечисления.СтатусыДоговоровКонтрагентов.Действует);
	КонецЕсли;
	
	//ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.РеализацияКлиенту
	Если Метаданные.Перечисления.Найти("ХозяйственныеОперации")<>Неопределено И  ЕстьРеквизит1С(Мета,"ХозяйственнаяОперация",Тип("ПеречислениеСсылка.ХозяйственныеОперации")) Тогда
		Рекв.Вставить("ХозяйственнаяОперация",Перечисления.ХозяйственныеОперации.РеализацияКлиенту);
	КонецЕсли;
	
	//ПорядокРасчетов = Перечисления.ПорядокРасчетов
	Если Метаданные.Перечисления.Найти("ПорядокРасчетов")<>Неопределено И  ЕстьРеквизит1С(Мета,"ПорядокРасчетов",Тип("ПеречислениеСсылка.ПорядокРасчетов")) Тогда
		Рекв.Вставить("ПорядокРасчетов",Перечисления.ПорядокРасчетов.ПоЗаказамНакладным);
	КонецЕсли;
	
	//ДоговорПодписан
	Если Мета.Реквизиты.Найти("ДоговорПодписан")<>Неопределено Тогда
		Рекв.Вставить("ДоговорПодписан",Истина);
	КонецЕсли;
	
	Если Мета.Реквизиты.Найти("ВидДоговора")<>Неопределено ТОгда
		//ВидДоговора=Новый Структура("Имя, Значение", "ВидДоговора"); 
		Если Метаданные.Перечисления.ВидыДоговоров.ЗначенияПеречисления.Найти("СПокупателем")<>Неопределено Тогда
			Рекв.Вставить("ВидДоговора",Перечисления.ВидыДоговоров.СПокупателем);
		ИначеЕсли Метаданные.Перечисления.ВидыДоговоров.ЗначенияПеречисления.Найти("Продажа")<>Неопределено Тогда
			Рекв.Вставить("ВидДоговора",Перечисления.ВидыДоговоров.Продажа);
		КонецЕсли;
	КонецЕсли;
	
	Если Мета.Реквизиты.Найти("ТипДоговора")<>Неопределено Тогда
		Если Метаданные.Перечисления.ТипыДоговоров.ЗначенияПеречисления.Найти("СПокупателем")<>Неопределено Тогда
			Рекв.Вставить("ТипДоговора", Перечисления.ТипыДоговоров.СПокупателем);
		ИначеЕсли Метаданные.Перечисления.ТипыДоговоров.ЗначенияПеречисления.Найти("Договор")<>Неопределено Тогда
			Рекв.Вставить("ТипДоговора", Перечисления.ТипыДоговоров.Договор);
		КонецЕсли;
	КонецЕсли;
	
		
	Если Мета.Реквизиты.Найти("БанковскийСчет")<>Неопределено и ЗначениеЗаполнено(Объект.БанковскийСчетДляЗаявки) Тогда 
		Рекв.Вставить("БанковскийСчет",Объект.БанковскийСчетДляЗаявки);
	КонецЕсли;
			
	Если Мета.Реквизиты.Найти("Валюта")<>Неопределено Тогда 
		РВалюта="Валюта";
	ИначеЕсли ЕстьРеквизит1С(Мета,"ВалютаВзаиморасчетов") Тогда 
		РВалюта="ВалютаВзаиморасчетов";
	ИначеЕсли ЕстьРеквизит1С(Мета,"ВалютаРасчетов") Тогда 
		РВалюта="ВалютаРасчетов";
	Иначе
		РВалюта=Неопределено;
	КонецЕсли;
	Если РВалюта<>Неопределено Тогда
		ЕСли ЗначениеЗаполнено(Объект.БанковскийСчетДляЗаявки) Тогда
			Если Объект.БанковскийСчетДляЗаявки.Метаданные().Реквизиты.Найти("ВалютаДенежныхСредств")<>Неопределено  Тогда
				Валюта=Объект.БанковскийСчетДляЗаявки.ВалютаДенежныхСредств;
			ИначеЕсли Объект.БанковскийСчетДляЗаявки.Метаданные().Реквизиты.Найти("Валюта")<>Неопределено  Тогда
				Валюта=Объект.БанковскийСчетДляЗаявки.Валюта;
			КонецЕсли;
		КонецЕсли;
		Если Валюта=Неопределено И Метаданные.Справочники.Найти("Валюты")<>Неопределено Тогда
			Если Метаданные.Константы.Найти("ВалютаРегламентированногоУчета") ТОгда
				Валюта=Константы.ВалютаРегламентированногоУчета.Получить();
			ИначеЕсли Метаданные.Константы.Найти("ВалютаРегламентированногоУчетаОрганизаций") ТОгда
				Валюта=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
			ИначеЕсли Метаданные.Константы.Найти("ВалютаУчета") ТОгда
				Валюта=Константы.ВалютаУчета.Получить();
			КонецЕсли;
		КонецЕсли;
		Если Валюта <> Неопределено тогда
			Рекв.Вставить(РВалюта,Валюта);
		КонецЕсли;
	КонецЕсли;
	
	Если Мета.Реквизиты.Найти("ПорядокОплаты")<>Неопределено И Метаданные.Перечисления.Найти("ПорядокОплатыПоСоглашениям")<>Неопределено Тогда
		ВалРегл=Константы.ВалютаРегламентированногоУчета.Получить();
		Если Валюта=ВалРегл Тогда
			Рекв.Вставить("ПорядокОплаты",Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВРубляхОплатаВРублях);
			ОплатаВВалюте=ЛОжь;
		Иначе
			Рекв.Вставить("ПорядокОплаты",Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВВалютеОплатаВВалюте);
			ОплатаВВалюте=Истина;
		КонецЕсли;
		Если Мета.Реквизиты.Найти("БанковскийСчетКонтрагента")<>Неопределено Тогда
			Запрос = Новый Запрос("
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	БанковскиеСчетаКонтрагентов.Ссылка КАК БанковскийСчетКонтрагента
			|ИЗ
			|	Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчетаКонтрагентов
			|ГДЕ
			|	БанковскиеСчетаКонтрагентов.Владелец = &Контрагент
			|	И ((БанковскиеСчетаКонтрагентов.ВалютаДенежныхСредств = &ВалютаРегл И НЕ &ОплатаВВалюте)
			|	ИЛИ (БанковскиеСчетаКонтрагентов.ВалютаДенежныхСредств <> &ВалютаРегл И &ОплатаВВалюте))
			|	И Не БанковскиеСчетаКонтрагентов.ПометкаУдаления
			|");
			
			Запрос.УстановитьПараметр("Контрагент", Контрагент);
			Запрос.УстановитьПараметр("ОплатаВВалюте", ОплатаВВалюте);
			Запрос.УстановитьПараметр("ВалютаРегл", ВалРегл);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				БанковскийСчетКонтрагента = Выборка.БанковскийСчетКонтрагента;
			Иначе
				БанковскийСчетКонтрагента = Справочники.БанковскиеСчетаКонтрагентов.ПустаяСсылка();
			КонецЕсли;
			Рекв.Вставить("БанковскийСчетКонтрагента",БанковскийСчетКонтрагента);
		КонецЕсли;
	КонецЕсли;
	
	ТекДата=ТекущаяДата();
	Если Мета.Реквизиты.Найти("Дата")<>Неопределено ТОгда
		Рекв.Вставить("Дата",ТекДата);
	ИначеЕсли Мета.Реквизиты.Найти("ДатаДоговора")<>Неопределено ТОгда
		Рекв.Вставить("ДатаДоговора",ТекДата);
	КонецЕсли;
	
	Если ЕстьРеквизит1С(Мета,"ДатаСоздания") Тогда
		Рекв.Вставить("ДатаСоздания",ТекДата);
	КонецЕсли;
	
	Если Мета.Реквизиты.Найти("ДатаНачала")<>Неопределено ТОгда
		Рекв.Вставить("ДатаНачала",ТекДата);
	ИначеЕсли Мета.Реквизиты.Найти("ДатаНачалаДействия")<>Неопределено ТОгда
		Рекв.Вставить("ДатаНачалаДействия",ТекДата);
	КонецЕсли;	
	
	Если Мета.Реквизиты.Найти("Основной")<>Неопределено Тогда
		Рекв.Вставить("Основной",Истина);
	КонецЕсли;
	
	Если Метаданные.Справочники.Найти("ТипыЦен")<>Неопределено И ЕстьРеквизит1С(Мета,"ТипЦен",Тип("СправочникСсылка.ТипыЦен")) Тогда
		Попытка
			Рекв.Вставить("ТипЦен",Справочники.ТипыЦен.ОсновнойТипЦенПродажи);
		Исключение
		Конецпопытки;
	КонецЕсли;
	
	Возврат Рекв;
КонецФункции

&НаКлиенте
Процедура ЗаказДоговорСоздание(Элемент, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Элементы.ЗаказыКлиентов.ТекущиеДанные.Контрагент) Тогда Возврат; КонецЕсли;
	
	Рекв=ЗаказДоговорСозданиеНаСервере(Элементы.ЗаказыКлиентов.ТекущиеДанные.Контрагент);
	Если Рекв=Неопределено Тогда Возврат; КонецЕсли;
	Попытка
		ПараметрыФормы=Новый Структура("Ключ",Рекв.ДоговорПустой);
		ОО = Новый ОписаниеОповещения("ЗаказДоговорСозданиеЗаписать",ЭтаФорма,Рекв);
		Форма=ОткрытьФорму("Справочник."+Рекв.ДоговорИмя+".ФормаОбъекта",ПараметрыФормы,ЭтаФорма,Истина,,,ОО);
		ЗаполнитьЗначенияСвойств(Форма.Объект,Рекв);
		Рекв.Вставить("Объект",Форма.Объект);
		СтандарнаяОбработка=Ложь;
	Исключение
		Сообщить(ОписаниеОшибки());
	Конецпопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаказСоглашениеНачалоВыбораНаСервере(ДанныеВыбора, Контрагент, Организация)
	Запрос=Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СоглашенияСКлиентами.Ссылка КАК Соглашение
		|ИЗ
		|	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
		|ГДЕ "+?(ЗначениеЗаполнено(Контрагент),"
		|	(СоглашенияСКлиентами.Контрагент = &Контрагент
		|			ИЛИ СоглашенияСКлиентами.Типовое = ИСТИНА)","
		|	СоглашенияСКлиентами.Типовое = ИСТИНА")+?(ЗначениеЗаполнено(Организация),"
		|	И СоглашенияСКлиентами.Организация = &Организация ","")+"
		|
		|УПОРЯДОЧИТЬ ПО
		|	СоглашенияСКлиентами.Контрагент УБЫВ,
		|	СоглашенияСКлиентами.Дата УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ"
	);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация",Организация);
	ДанныеВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Соглашение"));
КонецПроцедуры

&НаКлиенте
Процедура ЗаказСоглашениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекДан=Элементы.ЗаказыКлиентов.ТекущиеДанные; 
	ДанныеВыбора=Новый СписокЗначений;
	ЗаказСоглашениеНачалоВыбораНаСервере(ДанныеВыбора, ТекДан.Контрагент, Объект.ОрганизацияДляЗаявки);
	Если ДанныеВыбора.Количество()>0 Тогда
		СтандартнаяОбработка=Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСоглашениеПриИзменении(Элемент)
	ТекДан=Элементы.ЗаказыКлиентов.ТекущиеДанные;
	ЕСли ТекДан<>Неопределено Тогда
		ТекДан.Соглашение=Объект.Соглашение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДоговорДляЗаявкиПриИзменении(Элемент)
	ТекДан=Элементы.ЗаказыКлиентов.ТекущиеДанные;
	ЕСли ТекДан<>Неопределено Тогда
		ТекДан.Договор=Объект.ДоговорДляЗаявки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСкладДляЗаявкиПриИзменении(Элемент)
	ТекДан=Элементы.ЗаказыКлиентов.ТекущиеДанные;
	ЕСли ТекДан<>Неопределено Тогда
		ТекДан.Склад=Объект.СкладДляЗаявки;
	КонецЕсли;
КонецПроцедуры
//зк)
&НаСервере
Функция ЗаполнитьДоговорАА6(Организация, Контрагент)
	ДоговорНаПродажу = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст =   "ВЫБРАТЬ
	                 |	ДоговорыВзаиморасчетов.Ссылка КАК Ссылка
	                 |ИЗ
	                 |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	                 |ГДЕ
	                 |	ДоговорыВзаиморасчетов.Организация = &Организация
	                 |	И ДоговорыВзаиморасчетов.ПодразделениеКомпании = &ПодразделениеКомпании
	                 |	И ДоговорыВзаиморасчетов.ВидДоговора = &ВидДоговора
	                 |	И ДоговорыВзаиморасчетов.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПараметрыСеанса.ПодразделениеКомпании);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоров.Продажа);
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока ВЫборка.Следующий() Цикл
		ДоговорНаПродажу = Выборка.Ссылка;
		Прервать;
	КонецЦикла;
	Возврат ДоговорНаПродажу;
КонецФункции

&НаСервере
Функция НайтиЗначениеПартнераПоКонтрагенту(ЗначениеНаименования)
	Если Объект.Конфигурация="УправлениеНебольшойФирмой 1.6" Тогда
		Возврат Неопределено;
	КонецЕсли;
	Спр = Справочники.Контрагенты.НайтиПоНаименованию(ЗначениеНаименования,Истина,);
	Если ЗначениеЗаполнено(Спр.Партнер) Тогда
		Возврат Спр.Партнер;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗаявкаНаОформлениеПриИзменении(Элемент)
	ТекДан=Элементы.ЗаявкаНаОформление.ТекущиеДанные;//зк(
	ТекЗак=Элементы.ЗаказыКлиентов.ТекущиеДанные;
	Если ТекДан<>Неопределено Тогда
		Данные=Новый Структура("Количество,Цена,Сумма,Скидка,СуммаСоСкидкой,СтавкаНДС,СуммаНДС,Всего");
		ЗаполнитьЗначенияСвойств(Данные,ТекДан);
		ЗаявкаНаОформлениеПриИзмененииНаСервере(Данные);
		ЗаполнитьЗначенияСвойств(ТекДан,Данные);
		ТекЗак.Сумма=Объект.ЗаявкаНаОформление.Итог("Всего");     //зк)
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаявкаНаОформлениеПриИзмененииНаСервере(Данные)
	РассчитатьСуммы(Данные);
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаОформлениеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	НовСтр=Элементы.ЗаявкаНаОформление.ТекущиеДанные;
	Если НоваяСтрока Тогда
		НовСтр.Склад=Объект.СкладДляЗаявки;
		НовСтр.СтавкаНДС=Объект.НДСПоУмолчанию;
    	НовСтр.Наименование = ПолучитьПустуюСсылкуНаСервере("Справочник", "Номенклатура");
		НовСтр.Номенклатура = ПолучитьПустуюСсылкуНаСервере("Справочник", "Номенклатура");
		НовСтр.Заказ=Элементы.ЗаказыКлиентов.ТекущиеДанные.Заказ; //зк()
	КонецЕсли;
	Если Элемент.ТекущийЭлемент.Имя = "ЗаявкаНаОформлениеЗаказПокупателя" Тогда
		Если НЕ ЗначениеЗаполнено(НовСтр.ЗаказПокупателя) Тогда
			ЗаказИмя = Объект.Реквизит1С.Заказ;	
			Если ЗаказИмя<>Неопределено Тогда
				МассивТипов=Новый Массив();
				МассивТипов.Добавить(Тип("ДокументСсылка."+ЗаказИмя));
				Элемент.ТекущийЭлемент.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПустуюСсылкуНаСервере(ИмяОбъекта, ИмяРеквизита)
	Обработка=РеквизитФормыВЗначение("Объект");
	Возврат Обработка.ПолучитьПустуюСсылку(ИмяОбъекта, ИмяРеквизита);	
КонецФункции

&НаСервере
Функция ПолучитьПустуюСсылкуДокумента(ИмяДокумента)
	Возврат Документы[ИмяДокумента].ПустаяСсылка();	
КонецФункции

&НаКлиенте
Процедура ЗаявкаНаОформлениеПередУдалениемОтвет(Ответ, Элемент) Экспорт
	Если Ответ=КодВозвратаДиалога.Да Тогда
		ТекДан=Элементы.ЗаявкаНаОформление.ТекущиеДанные;
		НовСтр=ПолучитьСледующуюСтроку(Объект.ЗаявкаНаОформление, ТекДан);
		Объект.ЗаявкаНаОформление.Удалить(ТекДан);
		Элементы.ЗаявкаНаОформление.ТекущаяСтрока=НовСтр;
		ЗаявкаНаОформлениеПослеУдаления(Элемент)
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ЗаявкаНаОформлениеПередУдалением(Элемент, Отказ)
	ОО=Новый ОписаниеОповещения("ЗаявкаНаОформлениеПередУдалениемОтвет",ЭтаФорма,Элемент);
	ПоказатьВопрос(ОО,"Удалить текущую запись?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
	Отказ=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаОформлениеПослеУдаления(Элемент)
	ТекЗак=Элементы.ЗаказыКлиентов.ТекущиеДанные;   //зк(
	ТекЗак.Сумма=Объект.ЗаявкаНаОформление.Итог("Всего");
	ОбновитьЗаголовокКорзины();
	СохранитьДанныеПоКорзине();
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаОформлениеНаименованиеПриИзменении(Элемент)
	ЗаявкаНаОформлениеНаименованиеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаявкаНаОформлениеНаименованиеПриИзмененииНаСервере()
	ТекСтр=Объект.ЗаявкаНаОформление.НайтиПоИдентификатору(Элементы.ЗаявкаНаОформление.ТекущаяСтрока);
	
	Если ТипЗнч(ТекСтр.Наименование) <> Тип("Строка") Тогда	
		ТекСтр.Номенклатура=ТекСтр.Наименование;
		ТекСтр.Артикул=ТекСтр.Номенклатура.Артикул;
		Если ТекСтр.Номенклатура.Метаданные().Реквизиты.Найти("СтавкаНДС")<>Неопределено Тогда
			ТекСтр.СтавкаНДС=ТекСтр.Номенклатура.СтавкаНДС;
		КонецЕсли;
	
		Обработка=РеквизитФормыВЗначение("Объект");
		
		ПроизводительСвойства=Обработка.ПолучитьПроизводителяНоменклатуры(ТекСтр.Номенклатура);
		Если ПроизводительСвойства<>Неопределено Тогда
			ТекСтр.Производитель=ТекСтр.Номенклатура[ПроизводительСвойства.Реквизит];
		КонецЕсли;
	
		ТекСтр.Цена=Обработка.ПолучитьЦенуНоменклатуры(ТекСтр.Номенклатура,Объект.ТипЦен).Цена;
	КонецЕсли;
	
	Если ТекСтр.Количество=0 Тогда ТекСтр.Количество=1;КонецЕсли;
	
	РассчитатьСуммы(ТекСтр);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовЗаказаПоставщику
//вс(
&НаКлиенте
Процедура ЗаявкаПоставщикуПриАктивизацииЯчейки(Элемент)
	ТекДан=Элементы.ЗаявкаПоставщику.ТекущиеДанные;
	Если ТекДан<>Неопределено Тогда
		ТекКол=Элементы.ЗаявкаПоставщику.ТекущийЭлемент;
		Элементы.ЗаявкаПоставщику.ТолькоПросмотр = ТекКол.Имя<>"ЗаявкаПоставщикуВыбран"
		И ТекДан.Пользователь<>Объект.ПользовательИмя И ТекДан.Пользователь<>"";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаПоставщикуПередНачаломИзменения(Элемент, Отказ)
	ТекИмя=Сред(Элементы.ЗаявкаПоставщику.ТекущийЭлемент.Имя,17);
	Если Найти("Выбран;ЗаказПоставщику;ЗаказПокупателя;",ТекИмя)=0 Тогда
		ТекДан=Элементы.ЗаявкаПоставщику.ТекущиеДанные;
		Если ТекДан.Пользователь<>Объект.ПользовательИмя И ТекДан.Пользователь<>"" Тогда
			Отказ=Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаПоставщикуПередУдалениемОтвет(Ответ,Элемент) Экспорт
	Если ОТвет=КодВозвратаДиалога.Да Тогда
		ТекДан=Элементы.ЗаявкаПоставщику.ТекущиеДанные;
		//Сообщаем другим пользователям об удалении
		СендерОтправить("{""table"":""ordered"",""action"":""del"",""idData"":"
		+Формат(ТекДан.КодСтроки,"ЧГ=;ЧН=")+"}");
		// Убираем ссылку на строку заказа поставщику
		Строки=Объект.ЗаявкаНаОформление.НайтиСтроки(Новый Структура("КодЗП",ТекДан.КодСтроки));
		Если Строки.Количество()>0 Тогда
			Строки[0].КодЗП=0;
		КонецЕсли;
		НовСтр=ПолучитьСледующуюСтроку(Объект.ЗаявкаПоставщику,ТекДан);
		Объект.ЗаявкаПоставщику.Удалить(ТекДан);
		Элементы.ЗаявкаПоставщику.ТекущаяСтрока=НовСтр;
		ЗаявкаПоставщикуПослеУдаления(Элемент);
	КонецЕсли;
Конецпроцедуры

&НаКлиенте
Процедура ЗаявкаПоставщикуПередУдалением(Элемент, Отказ)
	ТекДан=Элементы.ЗаявкаПоставщику.ТекущиеДанные;
	ЕСли Объект.ПользовательИмя<>ПользовательКорзины Тогда
		Сообщить("Для удаления строк необходимо работать со своей корзиной");
	ИначеЕсли ТекДан.Пользователь<>Объект.ПользовательИмя Тогда
		Сообщить("Удалять строки другого пользователя запрещено");
	Иначе
		ОО=Новый ОписаниеОповещения("ЗаявкаПоставщикуПередУдалениемОтвет",ЭтаФорма,Элемент);
		ПоказатьВопрос(ОО,"Удалять текущую запись?",РежимДиалогаВопрос.ДаНет,,КодвозвратаДиалога.Нет);
	КонецЕсли;
	Отказ=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаПоставщикуПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекДан=Элементы.ЗаявкаПоставщику.ТекущиеДанные;
	Если ТекДан.Пользователь<>Объект.ПользовательИмя Тогда Возврат;КонецЕсли;
	Стр=СтруктураЗаявкаПоставщику();
	ЗаполнитьЗначенияСвойств(Стр,ТекДан);
	Строка=СтруктураВСтроку(Стр);
	СендерОтправить("{""table"":""ordered"",""action"":""edit"",""idData"":" 
	+Формат(ТекДан.КодСтроки,"ЧГ=;ЧН=")+",""data"":"+Строка+"}");
	Элементы.Группа10.Заголовок="Заказанное ("+Строка(Объект.ЗаявкаПоставщику.Количество())+")";
	СохранитьДанныеПоЗаказамПоставщикам();
КонецПроцедуры
//вс

&НаКлиенте
Процедура ЗаявкаПоставщикуПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	НовСтр=Элементы.ЗаявкаПоставщику.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(НовСтр.Поставщик) Тогда //вс(
		НовСтр.Поставщик = ПолучитьПустуюСсылкуНаСервере("Справочник", "Контрагент");
	КонецЕсли;	
	Если НоваяСтрока Тогда
		НовСтр.Склад=Объект.Склад;
		НовСтр.СтавкаНДС=Объект.НДСПоУмолчанию;
		НовСтр.Номенклатура = ПолучитьПустуюСсылкуНаСервере("Справочник", "Номенклатура");
		НовСтр.Дата = ТекущаяДата();
		НовСтр.КодСтроки = КодНовойСтрокиПользователя(Объект.ЗаявкаПоставщику,Объект.ПользовательИмя);
		НовСтр.Пользователь=Объект.ПользовательИмя;
		Стр=СтруктураЗаявкаПоставщику();
		ЗаполнитьЗначенияСвойств(Стр,НовСтр);
		Строка=СтруктураВСтроку(Стр);
		СендерОтправить("{""table"":""ordered"",""action"":""add"",""idData"":"
		+Формат(НовСтр.КодСтроки,"ЧГ=;ЧН=")+",""data"":"+Строка+"}"); 
		Элементы.Группа10.Заголовок="Заказанное ("+Строка(Объект.ЗаявкаПоставщику.Количество())+")";
	КонецЕсли; //вс)
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаПоставщикуПослеУдаления(Элемент)
	Элементы.Группа10.Заголовок="Заказанное ("+Строка(Объект.ЗаявкаПоставщику.Количество())+")";
	СохранитьДанныеПоЗаказамПоставщикам();
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаПоставщикуНоменклатураПриИзменении(Элемент)
	ЗаявкаПоставщикуНоменклатураПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаявкаПоставщикуНоменклатураПриИзмененииНаСервере()
	ТекСтр=Объект.ЗаявкаПоставщику.НайтиПоИдентификатору(Элементы.ЗаявкаПоставщику.ТекущаяСтрока);
	ТекСтр.Артикул=ТекСтр.Номенклатура.Артикул;
	Если ТекСтр.Номенклатура.Метаданные().Реквизиты.Найти("СтавкаНДС")<>Неопределено Тогда
		ТекСтр.СтавкаНДС=ТекСтр.Номенклатура.СтавкаНДС;
	КонецЕсли;
	Если ТекСтр.Количество=0 Тогда ТекСтр.Количество=1;КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаПоставщикуПриИзменении(Элемент)
	РассчитатьСуммы(Объект.ЗаявкаПоставщику[Элементы.ЗаявкаПоставщику.ТекущиеДанные.НомерСтроки-1]);
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаПоставщикуКоличествоПриИзменении(Элемент)
	ЗаявкаПоставщикуПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаПоставщикуЦенаПриИзменении(Элемент)
	ЗаявкаПоставщикуПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаПоставщикуСтавкаНдсПриИзменении(Элемент)
	ЗаявкаПоставщикуПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПереносЗаказов(Кнопка)
	Если ПользовательКорзины=Объект.ПользовательИмя ИЛИ НЕ ИзменятьКорзину Тогда Возврат;КонецЕсли;
	Массив=Объект.ЗаявкаПоставщику.НайтиСтроки(Новый Структура("Выбран",Истина));
	ЕстьИзменения=Ложь;
	Для Каждого Стр Из Массив Цикл
		Если Стр.Пользователь<>ПользовательКорзины Тогда Продолжить;КонецЕсли;
		КодСтроки=Формат(Стр.КодСтроки,"ЧГ=;ЧН=");
		Стр.КодСтроки=КодНовойСтрокиПользователя(Объект.ЗаявкаПоставщику,Объект.ПользовательИмя);
		Стр.Пользователь=Объект.ПользовательИмя;
		Стр.Выбран=Ложь;
		Стр1=СтруктураЗаявкаПоставщику();
		ЗаполнитьЗначенияСвойств(Стр1,Стр);
		Строка=СтруктураВСтроку(Стр1);
		СендерОтправить("{""table"":""ordered"",""action"":""edit"",""idData"":"+КодСтроки
		+",""data"":"+Строка+",""name"":"""+ПользовательКорзины+"""}");
		ЕстьИзменения=Истина;
	КонецЦикла;
	Если ЕстьИзменения Тогда
		Пользователи1=Новый Соответствие();
		Пользователи1.Вставить(ПользовательКорзины);
		Пользователи1.Вставить(Объект.ПользовательИмя);
		СохранитьДанныеПоЗаказамПоставщикам(Пользователи1);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд
//       ****** Шапка формы *****

&НаКлиенте
Процедура НайтиАртикулВыполнить()
	
	Попытка
		СписокГрупп = "";
		Если ЭтаФорма.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.Элементы.СтраницаПоискПоАртикулу или Объект.ОбщийПоискВрем Тогда
			//Заполнение таблицы выбора групп
			Если  Объект.ВыбиратьГруппу Тогда
				Группы=ЗаполнитьТаблицуГрупп();
				Если Группы.Количество()>1 Тогда
					Оповещение=Новый ОписаниеОповещения("ПоискПоАртикулу",ЭтаФорма);
					ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ФормаВыбораГруппыУФ",Новый Структура("Группы",Группы),ЭтаФорма,Истина,,,Оповещение);
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ПоискПоАртикулу(СписокГрупп);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры


&НаКлиенте
Процедура НайтиАртикул(Команда)
     НайтиАртикулВыполнить();
	 //ПроверитьОтветыОтТехПоддержки();
КонецПроцедуры

&НаСервере
Процедура ОбновитьКолонкиСписковНаСервере(ВключаяЗаявкиПоставщику=Ложь)
	//-> 05.2018
	Обработка=РеквизитФормыВЗначение("Объект");
	Если ВключаяЗаявкиПоставщику Тогда
		Обработка.ЗагрузитьЗаявкиПоставщику();
		ЗначениеВДанныеФормы(Обработка.ЗаявкаПоставщику,Объект.ЗаявкаПоставщику);
		Элементы.Группа10.Заголовок="Заказанное ("+Строка(Объект.ЗаявкаПоставщику.Количество())+")";
	КонецЕсли; //вс)
    //<- 05.2018
КонецПроцедуры

&НаКлиенте  
Процедура Настройки(Команда)
	Оповещение=Новый ОписаниеОповещения("ПроверитьОтветыОтТехПоддержки",ЭтаФорма);
	СендерСв.ВсеЗаявки=Объект.ВсеЗаявкиПоставщику;//вс()
	СендерСв.Отладка=Объект.СендерОтладка;
	Счетчик=10;
	ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.НастройкиУФ",,ЭтаФорма,"Настройки",,,Оповещение);	
КонецПроцедуры   

&НаКлиенте 
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник) 
	Если ИмяСобытия="Сендер" ТОгда Возврат;КонецЕсли;
	Если СендерСв.ВсеЗаявки<>Объект.ВсеЗаявкиПоставщику или СендерСв.Отладка<>Объект.СендерОтладка Тогда
		СендерСв.ВсеЗаявки=Объект.ВсеЗаявкиПоставщику;
		СендерСв.Отладка=Объект.СендерОтладка;
		СендерОтправить("{""table"":""ordered"",""action"":""tran"",""all"":"+?(Объект.ВсеЗаявкиПоставщику,"true","false")
		+",""debug"":"+?(Объект.СендерОтладка,"true","false")+"}"); 
		Элементы.КорзинаСменитьПользователя.Доступность=Объект.ВсеЗаявкиПоставщику;
		// Если пользователь работал с чужой корзиной - вернем его в свою корзину
		Если ПользовательКорзины<>Объект.ПользовательИмя и Не Объект.ВсеЗаявкиПоставщику Тогда
			ПользовательКорзиныВыбран(Объект.ПользовательИмя);
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ЗаказатьЕмекс.Доступность = ПользовательКорзины=Объект.ПользовательИмя ИЛИ Объект.ВсеЗаявкиПоставщику;
	Элементы.ЗаявкаНаОформлениеКнопка3.Доступность = Элементы.ЗаказатьЕмекс.Доступность;
	Если ИмяСобытия = "ОбновитьТЗ" Тогда 
         ОбновитьКолонкиСписковНаСервере(ВсеЗаявкиПоставщикуБыли<>Объект.ВсеЗаявкиПоставщику);//вс() 
		 ИзменитьЭлементыФормы();
	КонецЕсли;
КонецПроцедуры

//      ****** Станица поиска по прайс-листам ******
&НаКлиенте
Процедура НастройкаПоставщиков(Команда)
	
	ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ФормаУФ");
	
КонецПроцедуры

//      ****** Станица поиска онлайн ******

&НаКлиенте
Процедура ОтборПоНаличиюСкладПредприятия(Команда)
	
	ОтборНаличиеНаСкладе	= Не ОтборНаличиеНаСкладе;
	Элементы.ФильтрПоставщикЕмекс.Доступность=Не ОтборНаличиеНаСкладе;
	ОтборНаличиеУПоставщика = Ложь;
	ОтборСокращеннаяВыдача  = Ложь;
	УстановитьОтборФильтр();
	ОбновитьПометкиМеню(); 
	
КонецПроцедуры

//
&НаКлиенте
Процедура ОтборПоНаличиюСкладПоставщика(Команда)
	ОтборНаличиеНаСкладе	= Ложь;
	Элементы.ФильтрПоставщикЕмекс.Доступность=Истина;
	ОтборНаличиеУПоставщика = Не ОтборНаличиеУПоставщика;		
	ОтборСокращеннаяВыдача  = Ложь;
	УстановитьОтборФильтр();
	ОбновитьПометкиМеню(); 

КонецПроцедуры

&НаКлиенте
Процедура ОтборСокращеннаяВыдачаРезультата(Команда)
	
	ОтборНаличиеНаСкладе	= Ложь;
	Элементы.ФильтрПоставщикЕмекс.Доступность=Истина;
	ОтборНаличиеУПоставщика	= Ложь;
	ОтборСокращеннаяВыдача 	= Не ОтборСокращеннаяВыдача;		
	УстановитьОтборФильтр();
	ОбновитьПометкиМеню(); 

КонецПроцедуры
	
//      ****** Станица поиска по автомобилю ******
&НаКлиенте
Процедура ЗагрузитьПоМодели(Команда)
	ИскомаяМарка=ТЗДляФильтраМарок.НайтиСтроки(Новый Структура("MFA_BRAND",ФильтрФирмаАвто));
	ПараметрыФормы=Новый Структура("Марка, Модель", ИскомаяМарка[0].MFA_ID, ФильтрМодельАвто);	
	ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ФормаЗагрузкиУФ",ПараметрыФормы,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	Элементы.Группа5.Видимость=Ложь;
	Элементы.Группа4.Видимость=Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПоУзлу(Команда)
	Если Объект.ЕстьНоменклатура Тогда
		Если ОбработанныйУзелАйди<>"" Тогда
			ПараметрыФормы=Новый Структура("Узел, Комплект", ОбработанныйУзелАйди, ТипАвтоИзТаблицыТипов);	
			ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ФормаЗагрузкиУФ",ПараметрыФормы, ЭтаФорма);
		Иначе
			Сообщить("Не выбран узел для обработки!");
		КонецЕсли;
	Иначе
		Сообщить("В данной конфигурации нет справочника ""Номенклатура""");	
	КонецЕсли;
КонецПроцедуры

//      ****** Станица Корзина ******
&НаКлиенте
Процедура ОформитьДокументы(Команда)
	Список=Новый СписокЗначений();
	Если Объект.Реквизит1С.Заказ<>Неопределено И ИзменятьКорзину Тогда Список.Добавить("ЗаказПокупателя","Заказ покупателя");КонецЕсли;
	Если Объект.Реквизит1С.ЗаказНаряд<>Неопределено Тогда Список.Добавить("ЗаказНаряд","Заказ-наряд");КонецЕсли;
	Если Объект.Реквизит1С.Реализация<>Неопределено Тогда Список.Добавить("РеализацияТоваров","Реализация товаров");КонецЕсли;
	Если Объект.Реквизит1С.СчетФактураВыданный<>Неопределено Тогда Список.Добавить("СчетФактура","Счет-фактура");КонецЕсли;
	Если Список.Количество()=0 Тогда 
		Сообщить("Нет документов для оформления");
	Иначе	
		ОО=Новый ОписаниеОповещения("ОформитьЗаявку",ЭтаФорма);
		Список.ПоказатьОтметкуЭлементов(ОО,"Выберите документы для оформления");
	КонецЕсли;
КонецПроцедуры
	
&НаКлиенте
Процедура ОформитьЗаявку(Команда,Доп=Неопределено) Экспорт
	//зк(
	Объект.ЗаказПокупателя=Ложь;
	Объект.ЗаказНаряд=Ложь;
	Объект.РеализацияТоваров=Ложь;
	Объект.СчетФактура=Ложь;
	ТекДан=Элементы.ЗаказыКлиентов.ТекущиеДанные;
	Если ТекДан=Неопределено или Команда=Неопределено Тогда Возврат;
	ИначеЕсли ТипЗнч(Команда)=Тип("СписокЗначений") Тогда
		НетПометок=Истина;
		Для Каждого Стр Из Команда Цикл
			Если Стр.Пометка Тогда
				Объект[Стр.Значение]=Истина;
				НетПометок=Ложь;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли Команда.Имя="ОформитьЗаказПокупателя" Тогда
		Объект.ЗаказПокупателя=Истина;
	ИначеЕсли Команда.Имя="ОформитьЗаказНаряд" Тогда
		Объект.ЗаказНаряд=Истина;
	ИначеЕсли Команда.Имя="ОформитьРеализациюТоваров" Тогда
		Объект.РеализацияТоваров=Истина;
	ИначеЕсли Команда.Имя="ОформитьСчетФактуру" Тогда
		Объект.СчетФактура=Истина;
	КонецЕсли;
		
	Если Объект.ЗаявкаНаОформление.Количество()=0 Тогда
		Сообщить("Список товара пуст");
		возврат;
	КонецЕсли;
	
	Предупреждение=?(Объект.ЗаказПокупателя = Истина И  ЗначениеЗаполнено(ТекДан.ЗаказПокупателя),"Для заявки уже определен "
	+Строка(ТекДан.ЗаказПокупателя)+Символы.ПС,"");
	
	ОтборВыбран=Новый Структура("Выбран",Истина);
    Строки=Объект.ЗаявкаНаОформление.НайтиСтроки(ОтборВыбран);
	ВыбранКолво=Строки.Количество();
	Если Объект.ЗаявкаНаОформление.Количество()=ВыбранКолво Тогда ВыбранКолво=0;КонецЕсли;
	
	Объект.КонтрагентДляЗаявки=ТекДан.Контрагент;
	Объект.Соглашение=?(ТекДан.Соглашение<>Неопределено,ТекДан.Соглашение,
	?(Элементы.ЗаказСоглашение.Видимость=Истина,Элементы.ЗаказСоглашение.ОграничениеТипа.ПривестиЗначение(""),Неопределено));
	Объект.ДоговорДляЗаявки=?(ТекДан.Договор<>Неопределено,ТекДан.Договор,
	?(Элементы.ЗаказДоговор.Видимость=Истина,Элементы.ЗаказДоговор.ОграничениеТипа.ПривестиЗначение(""),Неопределено));
	Объект.СкладДляЗаявки=?(ЗначениеЗаполнено(ТекДан.Склад),ТекДан.Склад,Объект.Склад);
	
	Рез=КонтрольДанныхДляДокументовНаСервере();
	Если Рез<>"" Тогда
		Если Лев(Рез,1)="!" Тогда
			ПоказатьПредупреждение(,"Для оформления документов необходимо в настройках и форме определить следующие данные:"+
			Символы.ПС+Сред(Рез,2));
			Возврат;
		ИначеЕсли ВыбранКолво>0 Тогда
			ОО=Новый ОписаниеОповещения("ОформлениеЗаявки",ЭтаФорма,ОтборВыбран);
			ПоказатьВопрос(ОО,Предупреждение+"Для оформления документов рекомендуется в настройках и форме определить следующие данные:"+
			Символы.ПС+Рез+Символы.ПС+"Оформить документы выбранных позиций?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		Иначе
			ОО=Новый ОписаниеОповещения("ОформлениеЗаявки",ЭтаФорма,Неопределено);
			ПоказатьВопрос(ОО,Предупреждение+"Для оформления документов рекомендуется в настройках и форме определить следующие данные:"+
			Символы.ПС+Рез+Символы.ПС+"Оформить документы?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		КонецЕсли;
	ИначеЕсли ВыбранКолво>0 Тогда 
		ОО=Новый ОписаниеОповещения("ОформлениеЗаявки",ЭтаФорма,ОтборВыбран);
		ПоказатьВопрос(ОО,Предупреждение+"Оформить документы выбранных позиций?",РежимДиалогаВопрос.ДаНет,,
		?(Предупреждение="",КодВозвратаДиалога.Да,КодВозвратаДиалога.Нет));
	ИначеЕсли Предупреждение<>"" Тогда 
		ОО=Новый ОписаниеОповещения("ОформлениеЗаявки",ЭтаФорма,Неопределено);
		ПоказатьВопрос(ОО,Предупреждение+"Оформить документы выбранных позиций?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
	Иначе
		ОформлениеЗаявки(КодВозвратаДиалога.Да,Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОформлениеЗаявки(Ответ,Отбор) Экспорт
	ЕСли Ответ<>КодВозвратаДиалога.Да И Ответ<>КодВозвратаДиалога.ОК Тогда Возврат;КонецЕсли;
	МасДок=ОформитьЗаявкуНаСервере(Отбор);
	ТекДан=Элементы.ЗаказыКлиентов.ТекущиеДанные;
	Если МасДок.Количество()>0 Тогда
		// Если документы создавались из строк корзины - они перемещаются в отдельную заявку
		Если ТекДан.Заказ=0 Тогда
			Нов=Объект.ЗаказыКлиентов.Добавить();
			Заказ=НовыйКодТаблицы(Объект.ЗаказыКлиентов,"Заказ");
			ЗаполнитьЗначенияСвойств(Нов,Новый Структура("Заказ,Наименование,Дата,Контрагент,Соглашение,Договор,Склад,ДатаОтгрузки,Статус,Отбор",
			Заказ,Формат(ТекущаяДата(),"ДФ=дд.ММ.гг ЧЧ:мм")+" / "+Строка(ТекДан.Контрагент),ТекущаяДата(),
			ТекДан.Контрагент, ТекДан.Соглашение,ТекДан.Договор, ТекДан.Склад,ТекДан.ДатаОтгрузки,0,Истина));
			
			ИзКорзиныВНовуюЗаявку(Отбор,Заказ);
			Элементы.ЗаказыКлиентов.ТекущаяСтрока=Нов.ПолучитьИдентификатор();
			ТекДан=Нов;
			Нов.Сумма = Объект.ЗаявкаНаОформление.Итог("Всего");
			Строки = Объект.ЗаявкаНаОформление;
		Иначе
			Строки=?(Отбор=Неопределено,Объект.ЗаявкаНаОформление,Объект.ЗаявкаНаОформление.НайтиСтроки(Отбор));
		КонецЕсли;
		
		СохранитьКорзину=Ложь;
		Для Каждого Стр Из МасДок Цикл
			Если Стр.Свойство("Склад") Тогда
				// Реквизит Склад есть только в заказе
				ТекДан.ЗаказПокупателя=Стр.Ключ;
				Для Каждого Строка Из Строки Цикл
					Строка.ЗаказПокупателя=Стр.Ключ;
					Если Объект.СборАналитики Тогда
						СендерОтправить(Новый Структура("schema, action, ID, customerCount,customerPrice,customerDate,ipUser,noReply",
						"analytics","toDocClient",Строка.КодВКорзине,Окр(Строка.Количество,0),Окр(Строка.Цена,0),
						Формат(ТекущаяДата(),"ДФ=""гггг-ММ-дд ЧЧ:мм:сс"""), Объект.IPКлиента,Истина));
					КонецЕсли;
					ЕСли Объект.ЗаказВКомментарий Тогда
						Строка.Комментарий=Строка(Стр.Ключ)+"; "+Строка.Комментарий;
					КонецЕсли;
				КонецЦикла;
				
				
				СохранитьКорзину=Истина;
			ИначеЕсли Объект.ЗаказВКомментарий И Лев(Стр.Ключ,11)="Заказ-наряд" Тогда
				Для Каждого Строка Из Строки Цикл
					Строка.Комментарий=Строка(Стр.Ключ)+"; "+Строка.Комментарий;
				КонецЦикла;
			КонецЕсли;
			Если Ответ=КодВозвратаДиалога.Да  или (Объект.ПроводитьДокументы И Стр.Свойство("Проведен") и Не Стр.Проведен) Тогда
				ОткрытьФорму("Документ."+Стр.Имя+".ФормаОбъекта",Стр);
			КонецЕсли;
		КонецЦикла;
		
		Если СохранитьКорзину и ИзменятьКорзину Тогда
			СохранитьДанныеПоКорзине(ПользовательКорзины);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере      
Процедура ИзКорзиныВНовуюЗаявку(Отбор,Заказ)
	ЕСли Отбор=Неопределено Тогда
		Данные=Объект.ЗаявкаНаОформление.Выгрузить();
		Объект.ЗаявкаНаОформление.Очистить();
		Объект.ЗаказыКлиентов[0].Сумма = 0;
	Иначе
		Строки = Объект.ЗаявкаНаОформление.НайтиСтроки(Отбор);
		Данные = Объект.ЗаявкаНаОформление.Выгрузить(Строки);
		// Удалим строки
		Колво=Строки.Количество();
		Для инд=1 по колво Цикл
			Строка=Строки[Колво-инд];
			Объект.ЗаявкаНаОформление.Удалить(Строка);
		КонецЦикла;
		Объект.ЗаказыКлиентов[0].Сумма = Объект.ЗаявкаНаОформление.Итог("Всего");
	КонецЕсли;
	Элементы.СтрКорзина.Заголовок="Корзина"+?(Объект.ЗаявкаНаОформление.Количество()=0,"",
	" ("+Объект.ЗаявкаНаОформление.Количество()+")");
	
	// Смена заявки и пополнение строками
	СменитьЗаявку(Заказ);
	Данные.ЗаполнитьЗначения(Заказ,"Заказ");
	Объект.ЗаявкаНаОформление.Загрузить(Данные);
	
КонецПроцедуры

&НаСервере      
Функция КонтрольДанныхДляДокументовНаСервере()
	Обработка=РеквизитФормыВЗначение("Объект");
	Возврат Обработка.КонтрольДанныхДляДокументов();
КонецФункции

&НаСервере
Функция ОформитьЗаявкуНаСервере(Отбор) //зк(
	Обработка=РеквизитФормыВЗначение("Объект");
	
	//Создадим номенклатуру если она еще не создана
	Обработка.КорзинаСоздатьНоменклатуру(Отбор);
	ЗначениеВДанныеФормы(Обработка.ЗаявкаНаОформление,Объект.ЗаявкаНаОформление);
	
	Возврат Обработка.ОформитьЗаявку(Новый Структура("Отбор",Отбор));
	
КонецФункции

//-
&НаСервере
Функция ПолучитьПродажуПоНомеру(Номер, Интервал)	
	Возврат Документы.ЧекККМ.НайтиПоНомеру(
        Номер, Интервал
		);			
КонецФункции

&НаСервере
Функция ПолучитьТипКонфигурацииРозница()
	
	Если Объект.Конфигурация = "РозницаМагазинАвтозапчастей 2.1" ИЛИ
		 Объект.Конфигурация = "РозницаМагазинАвтозапчастей 2.0" ИЛИ
		 Объект.Конфигурация = "РозницаМагазинАвтозапчастей 2.2" Тогда
		 Возврат Истина;
	 Иначе
		 Возврат Ложь;
	 КонецЕсли;         

КонецФункции  
//-

&НаКлиенте
Процедура ОформитьЧекККМ(Команда)
	
	СформироватьЧек = Истина;
	ТекстОшибки = "";
	ТекДан=Элементы.ЗаказыКлиентов.ТекущиеДанные;
	Объект.КонтрагентДляЗаявки=ТекДан.Контрагент;
	Объект.СкладДляЗаявки=?(ЗначениеЗаполнено(ТекДан.Склад),ТекДан.Склад,Объект.Склад);
	Ошибки="";
	Если Не ЗначениеЗаполнено(Объект.ОрганизацияДляЗаявки) Тогда Ошибки=Ошибки+", организация";КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.СкладДляЗаявки) Тогда Ошибки=Ошибки+", склад";КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.КассаККМ) Тогда Ошибки=Ошибки+", касса ККМ";КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ТипЦен) и Лев(Объект.Конфигурация,7)<>"Розница" Тогда 
		Ошибки=Ошибки+", тип цен";
	КонецЕсли;
	Если Ошибки<>"" Тогда
		Сообщить("Отсутствует заполнение реквизитов в заказе и/настройка:"+Сред(Ошибки,2));
		Возврат;
	КонецЕсли;
	
	Если Объект.ЗаявкаНаОформление.Количество()=0 Тогда
		Сообщить("Список товара пуст");
		возврат;
	КонецЕсли;
	
	ОтборВыбран=Новый Структура("Выбран",Истина);
    Строки=Объект.ЗаявкаНаОформление.НайтиСтроки(ОтборВыбран);
	ВыбранКолво=Строки.Количество();
	Если Объект.ЗаявкаНаОформление.Количество()=ВыбранКолво Тогда ВыбранКолво=0;КонецЕсли;
	 
	Если ВыбранКолво>0 Тогда 
		ОО=Новый ОписаниеОповещения("ОформлениеЧека",ЭтаФорма,ОтборВыбран);
		ПоказатьВопрос(ОО,"Оформить чек выбранных позиций?",РежимДиалогаВопрос.ДаНет);
	Иначе
		ОформлениеЧека(КодВозвратаДиалога.Да,Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОформлениеЧека(Ответ,Отбор) Экспорт
	ЕСли Ответ<>КодВозвратаДиалога.Да Тогда Возврат;КонецЕсли;
	ЧекККМСсылка=ОформитьЧекККМНаСервере(Отбор);
	Если ЗначениеЗаполнено(ЧекККМСсылка) Тогда
		Если Объект.Конфигурация = "УправлениеТорговлей 11.3" ИЛИ Объект.Конфигурация = "УправлениеТорговлей 11.4" Тогда
			ДСсылка = ПолучитьПродажуПоНомеру(ЧекККМСсылка, ЧекККМСсылка.Дата); 
		   
			СсылкаНаДокумент = ПолучитьПродажуПоНомеру(ЧекККМСсылка.Номер, ТекущаяДата());		  
			ПараметрыФормы = Новый Структура("Ключ", СсылкаНаДокумент);   	      		  			  
			ОткрытьФорму("Документ.ЧекККМ.Форма.ФормаДокументаРМК", ПараметрыФормы );

		Иначе			   
	   
	    	Если Не ПолучитьТипКонфигурацииРозница() Тогда
		    	ПоказатьЗначение(,ЧекККМСсылка.Ссылка);
	    	Иначе		 
			    СсылкаНаДокумент = ПолучитьПродажуПоНомеру(ЧекККМСсылка.Номер, ТекущаяДата());
				ПараметрыФормы = Новый Структура("Ключ", СсылкаНаДокумент);   	      		  			  
			    ОткрытьФорму("Документ.ЧекККМ.ФормаОбъекта", ПараметрыФормы );
			КонецЕсли;		  	   
			
		КонецЕсли;
	  		   
	КонецЕсли;			
   
КонецПроцедуры

&НаСервере
Функция ОформитьЧекККМНаСервере(Отбор)
	//Создадим номенклатуру если она еще не создана
	Обработка=РеквизитФормыВЗначение("Объект");
	Обработка.КорзинаСоздатьНоменклатуру();
	ЗначениеВРеквизитФормы(Обработка, "Объект");
	
	Попытка
		Если Лев(Объект.Конфигурация,9) = "Автосалон" Тогда
			Чек = Документы.Чек.СоздатьДокумент();
			Чек.УстановитьНовыйНомер();
			//Чек.Автор = ПараметрыСеанса.Пользователь;
			Чек.ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
			Чек.Контрагент = Объект.КонтрагентДляЗаявки; 
			Чек.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
			Чек.КурсДокумента = 1;
			Чек.СкладКомпании = Объект.СкладДляЗаявки;
			Чек.ХозОперация = Справочники.ХозОперации.Чек;
			Чек.ДатаСоздания = ТекущаяДата();
			Чек.ТипЦен = Объект.ТипЦен;
			Чек.Автор = ПараметрыСеанса.АвторизованныйПользователь;
		Иначе
			Чек = Документы.ЧекККМ.СоздатьДокумент();
			Попытка
				Чек.ЦенаВключаетНДС = Истина;
			Исключение
				Чек.СуммаВключаетНДС = Истина;
			КонецПопытки;	
		КонецЕсли;
		Чек.Дата = ТекущаяДата();
		Чек.КассаККМ = Объект.КассаККМ;
		Чек.Организация = Объект.ОрганизацияДляЗаявки;
		Чек.СуммаДокумента = СуммаКорзины;		
		
		Если Объект.Конфигурация = "УправлениеТорговлей 11.0" ИЛИ
			Объект.Конфигурация = "УправлениеТорговлей 11.1.2" ИЛИ
			Объект.Конфигурация = "УправлениеТорговлей 11.4" Тогда
			Попытка	 
				Чек.Склад = Объект.СкладДляЗаявки;
				Чек.Партнер = Объект.КонтрагентДляЗаявки.Партнер;
				Чек.ВидЦены = Объект.ТипЦен;
				Чек.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
				Чек.Кассир = ПараметрыСеанса.ТекущийПользователь;
				Чек.Валюта = Объект.ТипЦен.ВалютаЦены;
				Если НЕ Чек.Метаданные().Реквизиты.Найти("КассоваяСмена") = Неопределено Тогда
					Запрос = Новый Запрос(
					"ВЫБРАТЬ ПЕРВЫЕ 1
					|	КассоваяСмена.Номер               КАК НомерКассовойСмены,
					|	КассоваяСмена.Ссылка              КАК КассоваяСмена,
					|	КассоваяСмена.Статус			  КАК СтатусКассовойСмены,
					|	
					|	КассоваяСмена.КассаККМ             КАК КассаККМ,
					|	КассоваяСмена.Валюта               КАК Валюта,
					|	КассоваяСмена.Валюта.Представление КАК ВалютаПредставление,
					|	КассоваяСмена.ВидЦены              КАК ВидЦены,
					|	КассоваяСмена.Организация          КАК Организация,
					|	КассоваяСмена.Кассир               КАК Кассир,
					|	КассоваяСмена.Склад                КАК Склад,
					|	КассоваяСмена.ЦенаВключаетНДС      КАК ЦенаВключаетНДС,
					|	КассоваяСмена.НалогообложениеНДС   КАК НалогообложениеНДС,
					|	
					|	ВЫБОР
					|		КОГДА КассоваяСмена.СтатусКассовойСмены = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
					|			ТОГДА ИСТИНА
					|		ИНАЧЕ ЛОЖЬ
					|	КОНЕЦ КАК СменаОткрыта,
					|	
					|	ВЫБОР
					|		КОГДА КассоваяСмена.СтатусКассовойСмены = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
					|			ТОГДА КассоваяСмена.НачалоКассовойСмены
					|		ИНАЧЕ КассоваяСмена.ОкончаниеКассовойСмены
					|	КОНЕЦ КАК ДатаИзмененияСтатуса,
					|	
					|	ЕСТЬNULL(ДенежныеСредстваВКассахККМОстатки.СуммаОстаток, 0) КАК НаличностьВКассе
					|	
					|ИЗ
					|	Документ.КассоваяСмена КАК КассоваяСмена
					|	
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(, КассаККМ = &КассаККМ) КАК ДенежныеСредстваВКассахККМОстатки
					|		ПО КассоваяСмена.КассаККМ = ДенежныеСредстваВКассахККМОстатки.КассаККМ
					|	
					|ГДЕ
					|	КассоваяСмена.Проведен
					|	И КассоваяСмена.КассаККМ = &КассаККМ
					|
					|УПОРЯДОЧИТЬ ПО
					|	КассоваяСмена.Дата УБЫВ,
					|	КассоваяСмена УБЫВ");
					
					Запрос.Текст =
					"ВЫБРАТЬ ПЕРВЫЕ 1
					|	КассоваяСмена.Номер                      КАК НомерКассовойСмены,
					|	КассоваяСмена.Ссылка                     КАК КассоваяСмена,
					|	КассоваяСмена.Статус                     КАК СтатусКассовойСмены,
					|	КассоваяСмена.СтатусРегламентныхОпераций КАК СтатусРегламентныхОпераций,
					|	
					|	КассоваяСмена.Организация          КАК Организация,
					|	КассоваяСмена.КассаККМ             КАК КассаККМ,
					|	КассоваяСмена.ФискальноеУстройство КАК ФискальноеУстройство,
					|	
					|	ВЫБОР
					|		КОГДА КассоваяСмена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
					|			ТОГДА ИСТИНА
					|		ИНАЧЕ ЛОЖЬ
					|	КОНЕЦ КАК СменаОткрыта,
					|	
					|	ВЫБОР
					|		КОГДА КассоваяСмена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
					|			ТОГДА КассоваяСмена.НачалоКассовойСмены
					|		ИНАЧЕ КассоваяСмена.ОкончаниеКассовойСмены
					|	КОНЕЦ КАК ДатаИзмененияСтатуса
					|ИЗ
					|	Документ.КассоваяСмена КАК КассоваяСмена
					|ГДЕ
					|	КассоваяСмена.Проведен
					|	И КассоваяСмена.КассаККМ = &КассаККМ
					|
					|УПОРЯДОЧИТЬ ПО
					|	КассоваяСмена.Дата УБЫВ,
					|	КассоваяСмена УБЫВ";					
					
					Запрос.УстановитьПараметр("КассаККМ",Объект.КассаККМ);
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда
						Чек.КассоваяСмена = Выборка.КассоваяСмена;
					КонецЕсли;
				КонецЕсли;
			Исключение
				Чек.СтруктурнаяЕдиница = Объект.СкладДляЗаявки;
				Чек.асВидОперации = Перечисления.асВидыОперацийЧекККМ.ЧекККМ;
				Чек.ФормаОплаты = Перечисления.ТипыДенежныхСредств.Наличные;
				Чек.ВидЦен = Объект.ТипЦен;
				Чек.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
				Чек.Автор = ПараметрыСеанса.ТекущийПользователь;
				Чек.ВалютаДокумента = Объект.ТипЦен.ВалютаЦены;
			КонецПопытки;
			
		ИначеЕсли Объект.Конфигурация = "РозницаМагазинАвтозапчастей 2.1" ИЛИ
			Объект.Конфигурация = "РозницаМагазинАвтозапчастей 2.0" ИЛИ
			Объект.Конфигурация = "РозницаМагазинАвтозапчастей 2.2" ИЛИ 
			Найти(Объект.Конфигурация, "Розница") <> 0  Тогда
			
			Чек.ВидОперации=Перечисления.ВидыОперацийЧекККМ.Продажа;
			Чек.АналитикаХозяйственнойОперации=Справочники.АналитикаХозяйственныхОпераций.РеализацияТоваров;
			Чек.Магазин=объект.КассаККМ.Магазин;
			Чек.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			Чек.Продавец = ПолучитьПродавцаРозницаМА(Чек.Ответственный);
			Если (Метаданные.ОбщиеМодули.Найти("ПодключаемоеОборудованиеРТ") <> Неопределено) Тогда
				Если (Метаданные.Документы.ЧекККМ.Реквизиты.Найти("СистемаНалогообложения") <> Неопределено) Тогда
					Чек.СистемаНалогообложения = Вычислить(
						"ПодключаемоеОборудованиеРТ.ПолучитьСистемуНалогообложения(Чек.Дата, Чек.Организация, Чек.Магазин, Чек.Магазин.СкладПродажи)"
					);
				ИначеЕсли (Метаданные.Документы.ЧекККМ.Реквизиты.Найти("ВидНалога") <> Неопределено) Тогда
					Чек.ВидНалога = Вычислить(
						"ПодключаемоеОборудованиеРТ.ВидНалогаПоОрганизацииИСкладу(Чек.Дата, Чек.Организация, Чек.Магазин.СкладПродажи)"
					);
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Лев(Объект.Конфигурация,25) = "УправлениеНебольшойФирмой" Тогда
			Чек.ВидЦен = Объект.ТипЦен;
			Чек.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
			//СостояниеКассовойСмены = Документы.ОтчетОРозничныхПродажах.ПолучитьСостояниеКассовойСмены(Чек.КассаККМ);
			Чек.ЗаполнитьДокументПоКассеККМ(Чек.КассаККМ);
			Чек.Автор = ПараметрыСеанса.ТекущийПользователь; 
			//ЗаполнитьЗначенияСвойств(Чек, СостояниеКассовойСмены);
		КонецЕсли;
		Строки=?(Отбор=Неопределено,Объект.ЗаявкаНаОформление,Объект.ЗаявкаНаОформление.НайтиСтроки(Отбор));
		Для Каждого Строка Из Строки Цикл
			
			Если Лев(Объект.Конфигурация,9) <> "Автосалон" Тогда
				Попытка
					ЧекСтрока = Чек.Товары.Добавить();
					ЧекСтрока.Номенклатура = Строка.Номенклатура;
					ЧекСтрока.ПроцентРучнойСкидки = Строка.Скидка;
					ЧекСтрока.СуммаРучнойСкидки = Строка.Сумма - Строка.СуммаСоСкидкой;
					ЧекСтрока.КоличествоУпаковок = Строка.Количество;
					ЧекСтрока.Количество = Строка.Количество;
					ЧекСтрока.Цена = Строка.Цена;
					ЧекСтрока.Сумма = Строка.СуммаСоСкидкой;
					ЧекСтрока.СтавкаНДС = Строка.СтавкаНДС;
					ЧекСтрока.СуммаНДС = Строка.СуммаНДС;
					Если НЕ Чек.метаданные().ТабличныеЧасти.Товары.Реквизиты.Найти("Продавец") = Неопределено Тогда
						ЧекСтрока.Продавец = ПараметрыСеанса.ТекущийПользователь;
					КонецЕсли;
				Исключение
					ЧекСтрока = Чек.Запасы.Добавить();
					
					Если  Объект.Конфигурация = "РозницаМагазинАвтозапчастей 2.0" ИЛИ
						Объект.Конфигурация = "РозницаМагазинАвтозапчастей 2.1" ИЛИ
						Объект.Конфигурация = "РозницаМагазинАвтозапчастей 2.2" Тогда
						
						Спр = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Строка.Артикул);
						
						Если Спр <> Неопределено Тогда						   
							ЧекСтрока.Номенклатура = Спр;						   
						КонецЕсли;
					Иначе
						ЧекСтрока.Номенклатура 	= Строка.Номенклатура;
					КонецЕсли;					   
					
					ЧекСтрока.ЕдиницаИзмерения	= Строка.Номенклатура.ЕдиницаИзмерения;
					ЧекСтрока.Количество			= Строка.Количество;
					ЧекСтрока.Цена				= Строка.Цена;
					ЧекСтрока.Сумма				= Строка.СуммаСоСкидкой;
					
					Если Лев(Объект.Конфигурация,29) = "УправлениеНебольшойФирмой 1.6" Тогда
						ЧекСтрока.СтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС(Строка.Номенклатура.ВидСтавкиНДС, ТекущаяДатаСеанса());
					Иначе
						ЧекСтрока.СтавкаНДС = Строка.СтавкаНДС;
					КонецЕсли; 	
					
					ЧекСтрока.СуммаНДС			= Строка.СуммаНДС;
					ЧекСтрока.Всего				= Строка.Всего;
				КонецПопытки;
				
				Если Лев(Объект.Конфигурация,29) = "РозницаМагазинАвтозапчастей 2" Тогда
					ЧекСтрока.Склад=объект.Склад;
				КонецЕсли;
			Иначе  //для АА6
				ЧекСтрока = Чек.Товары.Добавить();
				ЧекСтрока.Номенклатура = Строка.Номенклатура;
				ЧекСтрока.ЕдиницаИзмерения = Строка.Номенклатура.ОсновнаяЕдиницаИзмерения;
				ЧекСтрока.Коэффициент = 1;
				ЧекСтрока.ПроцентСкидки = Строка.Скидка;
				ЧекСтрока.СуммаСкидки = Строка.Сумма - Строка.СуммаСоСкидкой;
				ЧекСтрока.Количество = Строка.Количество;
				ЧекСтрока.Цена = Строка.Цена;
				ЧекСтрока.Сумма = Строка.СуммаСоСкидкой;
				ЧекСтрока.СтавкаНДС = Строка.СтавкаНДС;
				ЧекСтрока.СуммаНДС = Строка.СуммаНДС;
				ЧекСтрока.СуммаВсего = Строка.Всего;
				ЧекСтрока.МестоРазмещения = Объект.СкладДляЗаявки;
			КонецЕсли;
			
		КонецЦикла; 
		
		Чек.Записать();
		
		ЧекДанные = Новый Структура;
		ЧекДанные.Вставить("Ссылка", Чек.Ссылка);
		ЧекДанные.Вставить("Номер", Чек.Номер);
		ЧекДанные.Вставить("Дата", Чек.Дата);
		
		Возврат ЧекДанные; //Чек.Ссылка
		
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;	
	
КонецФункции

&НаСервере
Функция ПолучитьПродавцаРозницаМА(ТекПользователь)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", ТекПользователь);
	Запрос.УстановитьПараметр("Магазин", ПараметрыСеанса.ТекущийМагазин);
	Запрос.УстановитьПараметр("Настройка", ПланыВидовХарактеристик.НастройкиПользователей["ОсновнойПродавец"]);	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Значение КАК Значение	
		|ИЗ
		|	РегистрСведений.НастройкиПользователей КАК РегистрЗначениеПрав
		|
		|ГДЕ
		|	Пользователь = &Пользователь
		|	И Магазин    = &Магазин
		|	И Настройка  = &Настройка
		|";
	Выборка = Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	КонецЕсли;	
	Возврат Неопределено;
КонецФункции


&НаСервере
Функция ОформитьЧекРМКНаСервере()
	Попытка  	
		Чек = Документы.ЧекККМ.СоздатьДокумент(); 		
		Чек.Дата = ТекущаяДата();
		Чек.КассаККМ = Объект.КассаККМ;
		Чек.Организация = Объект.ОрганизацияДляЗаявки;
		Чек.СуммаДокумента = СуммаКорзины;
		Попытка
			Чек.ЦенаВключаетНДС = Истина;
		Исключение
		    Чек.СуммаВключаетНДС = Истина;
		КонецПопытки;
				
		Для Каждого Строка Из Объект.ЗаявкаНаОформление Цикл
			Если Строка.Выбран Тогда				
				Попытка
				   ЧекСтрока = Чек.Товары.Добавить();
				   ЧекСтрока.Номенклатура = Строка.Номенклатура;
				   ЧекСтрока.СуммаРучнойСкидки = Строка.Сумма - Строка.СуммаСоСкидкой;
				   ЧекСтрока.КоличествоУпаковок = Строка.Количество;
				   ЧекСтрока.Количество = Строка.Количество;
				   ЧекСтрока.Цена = Строка.Цена;
				   ЧекСтрока.Сумма = Строка.СуммаСоСкидкой;
				   ЧекСтрока.СтавкаНДС = Строка.СтавкаНДС;
				   ЧекСтрока.СуммаНДС = Строка.СуммаНДС;
				   ЧекСтрока.ПроцентРучнойСкидки = Строка.Скидка;
				   
				   Если НЕ Чек.Метаданные().ТабличныеЧасти.Товары.Реквизиты.Найти("Продавец") = Неопределено Тогда
					   ЧекСтрока.Продавец = ПараметрыСеанса.ТекущийПользователь;
				   КонецЕсли;
			   Исключение
				   ЧекСтрока = Чек.Запасы.Добавить();				   
				   ЧекСтрока.Номенклатура = Строка.Номенклатура;				   
				   ЧекСтрока.ЕдиницаИзмерения = Строка.Номенклатура.ЕдиницаИзмерения;
				   ЧекСтрока.Количество = Строка.Количество;
				   ЧекСтрока.Цена = Строка.Цена;
				   ЧекСтрока.Сумма = Строка.СуммаСоСкидкой;
				   ЧекСтрока.СтавкаНДС = Строка.СтавкаНДС;
				   ЧекСтрока.СуммаНДС = Строка.СуммаНДС;
				   ЧекСтрока.Всего = Строка.Всего;
			   КонецПопытки;
		   КонецЕсли;
		КонецЦикла; 
		Чек.Записать();
        ЧекДанные = Новый Структура;
        ЧекДанные.Вставить("Ссылка", Чек.Ссылка);
        ЧекДанные.Вставить("Номер", Чек.Номер);
		ЧекДанные.Вставить("Дата", Чек.Дата);
	
		Возврат ЧекДанные; 
	
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;	
	
КонецФункции


&НаКлиенте
Процедура ОчиститьЗаявку(Команда)
	ТекДан=Элементы.ЗаказыКлиентов.ТекущиеДанные;
	Если Объект.ЗаявкаНаОформление.Количество()=0 Тогда возврат;КонецЕсли;
	
    СтрокиВыбран=Объект.ЗаявкаНаОформление.НайтиСтроки(Новый Структура("Выбран",Истина));
	ВыбранКолво=СтрокиВыбран.Количество();
	Если Объект.ЗаявкаНаОформление.Количество()=ВыбранКолво Тогда ВыбранКолво=0;КонецЕсли;
	 
	Если ВыбранКолво>0 Тогда 
		ОО=Новый ОписаниеОповещения("ОчисткаЗаявки",ЭтаФорма,СтрокиВыбран);
		ПоказатьВопрос(ОО,"Удалить выбранные записи?",РежимДиалогаВопрос.ДаНет);
	Иначе
		ОО=Новый ОписаниеОповещения("ОчисткаЗаявки",ЭтаФорма,Объект.ЗаявкаНаОформление);
		ПоказатьВопрос(ОО,"Удалить все записи товара?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчисткаЗаявки(Ответ,Строки) Экспорт
	Если Ответ<>КодВозвратаДиалога.Да Тогда Возврат;КонецЕсли;
	Колво=Строки.Количество();
	Для инд=1 по колво Цикл
		Стр=Строки[Колво-инд];
		Объект.ЗаявкаНаОформление.Удалить(Стр);
	КонецЦикла;
	ЗаявкаНаОформлениеПослеУдаления(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ВКорзинуОнлайн(Команда)
	ТекДан=Элементы.ЗаказыКлиентов.ТекущиеДанные;//зк(
	Если ТекДан=Неопределено Тогда Возврат;КонецЕсли;
	Отбор=Новый Структура("Выбран",Истина);
	Строки=Объект.ЗаявкаНаОформление.НайтиСтроки(Отбор);
	Если Строки.Количество()=0 Тогда
		ПоказатьПредупреждение(,"Нет ни одной отмеченной заявки для переноса в корзину поставщика");
	Иначе
		// Контроль на кратность
		Для Каждого Запись Из Строки Цикл
			Если ТипЗнч(Запись.Кратность) = Тип("Число") И Запись.Кратность<>0 И Запись.Кратность <> 1 Тогда
				Если Запись.Количество/Запись.Кратность <> Цел(Запись.Количество/Запись.Кратность) Тогда
					Сообщить("В строке "+Запись.НомерСтроки+" возникли ошибки при отправке в корзину: Количество товара не соответсвует кратности. Для текущей позиции кратность равна "+Строка(Запись.Кратность));
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
			
		Запросы=ВКорзинуОнлайнНаСервере(Отбор);  //зк)вс(
		Для Каждого Запрос Из Запросы Цикл
			СендерОтправить(Запрос);
		КонецЦикла;                          //вс)
		Элементы.Группа10.Заголовок="Заказанное ("+Строка(Объект.ЗаявкаПоставщику.Количество())+")";
		СохранитьДанныеПоЗаказамПоставщикам(ПользовательКорзины);
		СохранитьДанныеПоКорзине(ПользовательКорзины);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВКорзинуОнлайнНаСервере(Отбор,Выбрать=Ложь) //зк(
	Обработка=РеквизитФормыВЗначение("Объект");
	Обработка.КорзинаСоздатьНоменклатуру(Отбор);
	ЗначениеВДанныеФормы(Обработка.ЗаявкаНаОформление,Объект.ЗаявкаНаОформление);	

	ЗаявкаПост=Обработка.ЗаявкаПоставщику.ВыгрузитьКолонки(); //вс(
	Обработка.ВКорзинуПроценки(Объект.ЗаявкаНаОформление,ЗаявкаПост,Отбор); //зк)
	Запросы=Новый Массив;
	Для Каждого Стр Из ЗаявкаПост Цикл
		Нов=Объект.ЗаявкаПоставщику.Добавить();
		ЗаполнитьЗначенияСвойств(Нов,Стр);
		Нов.КодСтроки=КодНовойСтрокиПользователя(Объект.ЗаявкаПоставщику,ПользовательКорзины);
		Нов.КодВКорзине=Стр.КодВКорзине;
		Если Выбрать Тогда Нов.Выбран=Истина;КонецЕсли;
		Объект.ЗаявкаНаОформление[Стр.КодСтроки].КодЗП=Нов.КодСтроки;
		Объект.ЗаявкаНаОформление[Стр.КодСтроки].Статус=?(ПустаяСтрока(Нов.СтатусПозиции),Нов.СтатусЗаказа,Нов.СтатусПозиции);
		Нов.Пользователь=ПользовательКорзины;
		Стр=СтруктураЗаявкаПоставщику();
		ЗаполнитьЗначенияСвойств(Стр,Нов);
		Строка=СтруктураВСтроку(Стр);
		Запросы.Добавить("{""table"":""ordered"",""action"":""add"",""idData"":"
		+Формат(Нов.КодСтроки,"ЧГ=;ЧН=")+",""data"":"+Строка+"}");
		Если Объект.СборАналитики ТОгда
			Запросы.Добавить(Новый Структура("schema, action, ID, deliveryCount,deliveryDate,ipUser,noReply",
			"analytics","toOrder",Нов.КодВКорзине,Окр(Нов.Количество,0),
			Формат(ТекущаяДата(),"ДФ=""гггг-ММ-дд ЧЧ:мм:сс"""),Объект.IPКлиента,Истина))
		КонецЕсли;
	КонецЦикла;
	Возврат Запросы;
КонецФункции

&НаКлиенте
Процедура ОбработатьФлажки(Команда) //зк(
	ТекДан=Элементы.ЗаказыКлиентов.ТекущиеДанные;
	Если ТекДан=Неопределено Тогда Возврат;КонецЕсли;
	Флаг=Команда.Имя="УстановитьФлажки";
	Для каждого СтрокаТЗ Из Объект.ЗаявкаНаОформление Цикл
		 СтрокаТЗ.Выбран = Флаг;
	КонецЦикла; //зк)
КонецПроцедуры

&НаКлиенте
Процедура КПоставщику(Команда)
	ТекДан=Элементы.ЗаказыКлиентов.ТекущиеДанные;//зк(
	Если ТекДан=Неопределено Тогда Возврат;КонецЕсли;
	Отбор=Новый Структура("Выбран",Истина);
	МасСтр=Объект.ЗаявкаНаОформление.НайтиСтроки(Отбор);//зк)
	Если МасСтр.Количество()=0 Тогда
		//МасСтр.Добавить(Элементы.ЗаявкаНаОформление.ТекущаяСтрока);
		Сообщить("Отсутствуют выбранные строки для переноса");
		Возврат;
	КонецЕсли;
	
	КПоставщикуНаСервере(Отбор);
	
	Для Каждого Заявка из 	МасСтр Цикл
		Нов=Объект.ЗаявкаПоставщику.Добавить();
		ЗаполнитьЗначенияСвойств(Нов,Заявка,"Номенклатура,Артикул,Количество,СтавкаНДС");
		Если ЗначениеЗаполнено(Заявка.ЗаказПокупателя) Тогда
			Нов.ЗаказПокупателя=Заявка.ЗаказПокупателя;
		КонецЕсли;	
		Нов.Срок=?(ТипЗнч(Заявка.СрокДоставкиГарантированный)=Тип("Строка"),Заявка.СрокДоставки,Заявка.СрокДоставкиГарантированный);
		Нов.Склад=?(ТипЗнч(Заявка.Склад)=Тип("Строка") или Не ЗначениеЗаполнено(Заявка.Склад),Объект.СкладДляЗаявки,Заявка.Склад);
		Если ЗначениеЗаполнено(Заявка.Поставщик) Тогда
			Нов.Поставщик=Заявка.Поставщик;
		ИначеЕсли Не ПустаяСтрока(Заявка.Сайт) Тогда
			Пост = ПолучитьПоставщика(Заявка.Сайт);
			Если ЗначениеЗаполнено(Пост) ТОгда
				Нов.Поставщик=Пост;
			КонецЕсли;
		КонецЕсли;	
		Нов.Цена=Заявка.ЦенаПоставки;
		Нов.Скидка=0;
		РассчитатьСуммы(Объект.ЗаявкаПоставщику[Нов.НомерСтроки-1]);
		Нов.Сайт=Заявка.Сайт;
		Нов.КодТовара=Заявка.КодТовара;
		Нов.КодЗаказа=Заявка.КодЗаказа;
		Нов.idСклад=Заявка.idСклад;
		Нов.КодДоставки=Заявка.КодДоставки;
		Нов.КодВКорзине = Заявка.КодВКорзине;
		Нов.Дата = ТекущаяДата();
		Нов.Выбран = Истина;
		Нов.ДанныеСайта="{""Производитель"":"""+СтрЗаменить(СтрЗаменить(Заявка.Производитель,"/","//"),"""","/""")+
		""",""КодПроизводителя"":"""+СтрЗаменить(СтрЗаменить(Заявка.КодПроизводителя,"/","//"),"""","/""")+
		""",""ДляКорзины"":"""+СтрЗаменить(СтрЗаменить(Заявка.ДляКорзины,"/","//"),"""","/""")+"""}";
		Нов.КодСтроки=КодНовойСтрокиПользователя(Объект.ЗаявкаПоставщику,ПользовательКорзины);  //вс(
		Заявка.КодЗП=Нов.КодСтроки;
		Нов.Пользователь=ПользовательКорзины;
		Стр=СтруктураЗаявкаПоставщику();
		ЗаполнитьЗначенияСвойств(Стр,Нов);
		Строка=СтруктураВСтроку(Стр);
		СендерОтправить("{""table"":""ordered"",""action"":""add"",""idData"":"
		+Формат(Нов.КодСтроки,"ЧГ=;ЧН=")+",""data"":"+Строка+"}");                     //вс)
		Если Объект.СборАналитики Тогда
			СендерОтправить(Новый Структура("schema, action, ID, deliveryCount,deliveryDate,ipUser,noReply",
			"analytics","toOrder",Нов.КодВКорзине,Окр(Нов.Количество,0),
			Формат(ТекущаяДата(),"ДФ=""гггг-ММ-дд ЧЧ:мм:сс"""),Объект.IPКлиента,ИСтина));
		КонецЕсли;
	КонецЦикла;
	Элементы.Группа10.Заголовок="Заказанное ("+Строка(Объект.ЗаявкаПоставщику.Количество())+")";
	СохранитьДанныеПоЗаказамПоставщикам(ПользовательКорзины);
	СохранитьДанныеПоКорзине(ПользовательКорзины);
КонецПроцедуры

&НаСервере
Процедура КПоставщикуНаСервере(Отбор)   //зк(
	//Создадим номенклатуру если она еще не создана
	Обработка=РеквизитФормыВЗначение("Объект");
	Обработка.КорзинаСоздатьНоменклатуру(Отбор); //зк)
	ЗначениеВРеквизитФормы(Обработка, "Объект");	
КонецПроцедуры

&НаСервере
Функция ПолучитьПоставщика(СайтПост)
	Пост = "";
	Проценки = ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","Проценки",,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
	Сайт=Проценки.Найти(СайтПост,"НаименованиеСайт");
	Если Сайт<>Неопределено ТОгда
		Попытка
		Если ЗначениеЗаполнено(Сайт.Поставщик) ТОгда
			Пост=Сайт.Поставщик;
		КонецЕсли;
		Исключение КонецПопытки;
	КонецЕсли;
	Возврат Пост;
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандЗаказовПоставщику
//     ****** Страница Заказы Поставщику  *****
&НаКлиенте
Процедура ОформитьЗаказы(Команда)
	Отбор=Объект.ЗаявкаПоставщику.НайтиСтроки(Новый Структура("Выбран",Истина));//вс(
	Если Отбор.Количество() > 0 Тогда
		Кол=0;
		Для каждого Запись Из Отбор Цикл
			Если ЗначениеЗаполнено(Запись.ЗаказПоставщику) Тогда Кол=Кол+1;КонецЕсли;
		КонецЦикла;
		Если Кол>0 Тогда
			ОО=Новый ОписаниеОповещения("ОформитьЗаказыОтвет",ЭтаФорма,Отбор);
			ПоказатьВопрос(ОО,"Для "+Строка(Кол)+" номенклатурных единиц уже оформлены заказы поставщику. Продолжить?",
			РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		Иначе
			ОформитьЗаказыОтвет(КодВозвратаДиалога.Да, Отбор);
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(,"Нет данных для формирования заказов!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОформитьЗаказыОтвет(Ответ, Отбор) Экспорт
	Если Ответ<>КодВозвратаДиалога.Да и Ответ<>КодВозвратаДиалога.ОК Тогда Возврат;КонецЕсли;
	
	ОформленныеЗаказы=ОформитьЗаказыНаСервере();
	Если ЗначениеЗаполнено(ОформленныеЗаказы) Тогда
		Пользователи1=Новый Соответствие;
		Для Каждого Стр Из Отбор Цикл
			Струк=СтруктураЗаявкаПоставщику();
			ЗаполнитьЗначенияСвойств(Струк,Стр);
			Строка=СтруктураВСтроку(Струк);
			СендерОтправить("{""action"":""edit"",""table"":""ordered"",""name"":"""+Стр.Пользователь
			+""",""idData"":"+Формат(Стр.КодСтроки,"ЧГ=;ЧН=")+",""data"":"+Строка+"}");
			Пользователи1.Вставить(Стр.Пользователь);
			Если Объект.СборАналитики Тогда
				СендерОтправить(Новый Структура("schema, action, ID, supplierCount,supplierPrice,supplierDate,ipUser,noReply",
				"analytics","toDocSupplier",Стр.КодВКорзине,Окр(Стр.Количество,0),Окр(Стр.Цена,0),
				Формат(ТекущаяДата(),"ДФ=""гггг-ММ-дд ЧЧ:мм:сс"""),Объект.IPКлиента,ИСтина));
			КонецЕсли;
			Стр.Выбран=Ложь;
		КонецЦикла;
		СохранитьДанныеПоЗаказамПоставщикам(Пользователи1);
		// Если Ответ=КодВозвратаДиалога.ОК тогда формы документов не открываются
		Для Каждого Значение Из ОформленныеЗаказы Цикл
			Если Ответ=КодВозвратаДиалога.Да или (Объект.ПроводитьДокументы и Не Значение.Пометка) Тогда
				ЗаявкаПост = Значение.Значение;
				ПоказатьЗначение(,ЗаявкаПост);
			КонецЕсли;
		КонецЦикла;
	КонецЕСли;	
	РассчитатьКоличествоЭлементов();
		
КонецПроцедуры

&НаСервере
Функция ОформитьЗаказыНаСервере()
	
	Отбор=Новый Структура("Выбран",Истина);
	ТЗДляОформления = Объект.ЗаявкаПоставщику.Выгрузить(Объект.ЗаявкаПоставщику.НайтиСтроки(Отбор));
	ОформленныеЗаказы=Новый СписокЗначений;
	ТЗВЗаказ = ТЗДляОформления.СкопироватьКолонки();
	Если Лев(Объект.Конфигурация,29) = "РозницаМагазинАвтозапчастей 2" Тогда	
		ТЗДляОформления.Сортировать("Поставщик,Склад");
		ТекущийПоставщик = ТЗДляОформления[0].Поставщик;
		ТекущийСклад=ТЗДляОформления[0].Склад;
		Для каждого Запись Из ТЗДляОформления Цикл
			
			Если (ТекущийПоставщик = Запись.Поставщик) и (Запись.Склад=ТекущийСклад) Тогда
				
				СтрокаВЗаказ = ТЗВЗаказ.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаВЗаказ, Запись);
				Если (ТЗДляОформления.Количество() - 1) = ТЗДляОформления.Индекс(Запись) Тогда
					СоздатьЗаказПоставщику(ТЗВЗаказ,ОформленныеЗаказы);
				КонецЕСли;
				
			Иначе
				
				Если ТЗВЗаказ.Количество() > 0 Тогда
					СоздатьЗаказПоставщику(ТЗВЗАказ,ОформленныеЗаказы);
				КонецЕСли;
				
				ТекущийПоставщик = Запись.Поставщик;
				ТекущийСклад = Запись.Склад;
				
				ТЗВЗаказ.Очистить();
				СтрокаВЗаказ = ТЗВЗАказ.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаВЗаказ, Запись);
				
				Если (ТЗДляОформления.Количество() - 1) = ТЗДляОформления.Индекс(Запись) Тогда
					СоздатьЗаказПоставщику(ТЗВЗаказ,ОформленныеЗаказы);
				КонецЕСли;
				
			КонецЕсли; 	
			
		КонецЦикла;
		
		РассчитатьКоличествоЭлементов();	
		
		Возврат ОформленныеЗаказы;
	КонецЕсли;
	
	ТЗДляОформления.Сортировать("Поставщик");
	
	ТекущийПоставщик = ТЗДляОформления[0].Поставщик;
	
	Для каждого Запись Из ТЗДляОформления Цикл
		
		Если ТекущийПоставщик = Запись.Поставщик Тогда
			
			СтрокаВЗаказ = ТЗВЗаказ.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаВЗаказ, Запись);
			Если (ТЗДляОформления.Количество() - 1) = ТЗДляОформления.Индекс(Запись) Тогда
				СоздатьЗаказПоставщику(ТЗВЗаказ,ОформленныеЗаказы);
			КонецЕСли;
			
		Иначе
			
			Если ТЗВЗаказ.Количество() > 0 Тогда
				СоздатьЗаказПоставщику(ТЗВЗАказ,ОформленныеЗаказы);
			КонецЕСли;
			
			ТекущийПоставщик = Запись.Поставщик;
			ТЗВЗаказ.Очистить();
			СтрокаВЗаказ = ТЗВЗАказ.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаВЗаказ, Запись);
			
			Если (ТЗДляОформления.Количество() - 1) = ТЗДляОформления.Индекс(Запись) Тогда
				СоздатьЗаказПоставщику(ТЗВЗаказ,ОформленныеЗаказы);
			КонецЕСли;
			
		КонецЕсли; 	
		
	КонецЦикла;
	
	РассчитатьКоличествоЭлементов();	
	
	Возврат ОформленныеЗаказы;
	
КонецФункции

&НаСервере
Процедура СоздатьЗаказПоставщику(ТЗВЗаказ,ОформленныеЗаказы)
	
	Попытка
		ЗаказПоставщику = Документы.ЗаказПоставщику.СоздатьДокумент();		
		МетаданныеДокумента = ЗаказПоставщику.Метаданные();
		Если МетаданныеДокумента.Реквизиты.Найти("ВариантПриемкиТоваров") <> Неопределено Тогда
		    ЗаказПоставщику.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
			//ЗаказПоставщику.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
		КонецЕсли;
		
		Если МетаданныеДокумента.Реквизиты.Найти("Валюта") <> Неопределено Тогда
			Валюта="Валюта";
		ИначеЕсли ЕстьРеквизит1С(МетаданныеДокумента,"ВалютаДокумента") Тогда
			Валюта="ВалютаДокумента";
		Иначе 
			Валюта=Неопределено;
		КонецЕсли;
		Если Валюта<>Неопределено Тогда
			Если Метаданные.Константы.Найти("ВалютаРегламентированногоУчета")<>Неопределено Тогда
				ЗаказПоставщику[Валюта] = Константы.ВалютаРегламентированногоУчета.Получить();
			ИначеЕсли Метаданные.Константы.Найти("ВалютаРегламентированногоУчетаОрганизаций")<>Неопределено Тогда
				ЗаказПоставщику[Валюта] = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
			ИначеЕсли Метаданные.Константы.Найти("НациональнаяВалюта")<>Неопределено Тогда
				ЗаказПоставщику[Валюта] = Константы.НациональнаяВалюта.Получить();
			КонецЕсли;
		КонецЕсли;
		
		ЗаказПоставщику.Дата = ТекущаяДата();
		
		МаксДней=0;
		Если Объект.Конфигурация = "УправлениеТорговлей 11.0" ИЛИ
			Объект.Конфигурация = "УправлениеТорговлей 11.1" ИЛИ
			Объект.Конфигурация = "УправлениеТорговлей 11.2" ИЛИ
			Объект.Конфигурация = "УправлениеТорговлей 11.4" Тогда
			Если Документы.ЗаказПоставщику.ПустаяСсылка().Метаданные().Реквизиты.Найти("Менеджер") = Неопределено тогда
				Заказпоставщику.Ответственный = параметрыСеанса.ТекущийПользователь;
			Иначе
				ЗаказПоставщику.Менеджер = ПараметрыСеанса.ТекущийПользователь;
			КонецЕсли;
			Если Документы.ЗаказПоставщику.ПустаяСсылка().Метаданные().Реквизиты.Найти("ХозяйственнаяОперация") = Неопределено тогда
				ЗаказПоставщику.ВидОперации = Перечисления.ВидыОперацийЗаказПоставщику.ЗаказНаЗакупку;
			Иначе
				ЗаказПоставщику.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
			КонецЕсли;
			Если Метаданные.Документы.ЗаказПоставщику.Реквизиты.Найти("ДокументОснование") <> Неопределено Тогда
				ЗаказПоставщику.ДокументОснование = ТЗВЗАказ[0].ЗаказПокупателя;	
			КонецЕсли;				
			
			Попытка
				Если ЗначениеЗаполнено(Метаданные.Документы.ЗаказПоставщику.Реквизиты.СпособДоставки.ЗначениеЗаполнения) Тогда
					ЗаказПоставщику.СпособДоставки=Метаданные.Документы.ЗаказПоставщику.Реквизиты.СпособДоставки.ЗначениеЗаполнения;
				КонецЕсли;	
			Исключение
			Конецпопытки;
			
			Попытка
				ЗаказПоставщику.ЗакупкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
				ЗаказПоставщику.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
				ЗаказПоставщику.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");  //Перечисления.Приоритеты.Средний;
				ЗаказПоставщику.Статус = Перечисления.СтатусыЗаказовПоставщикам.Согласован;		
				ЗаказПоставщику.Валюта = Объект.ТипЦен.ВалютаЦены;
				Если ЗначениеЗаполнено(ТЗВЗАказ[0].Поставщик) Тогда
					ЗаказПоставщику.Партнер = ТЗВЗАказ[0].Поставщик.Партнер;
					ЗаказПоставщику.Контрагент = ТЗВЗАказ[0].Поставщик;
				КонецЕсли;
				ЗаказПоставщику.ДатаСогласования = ТекущаяДата();
			Исключение
				ЗаказПоставщику.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
				ЗаказПоставщику.СостояниеЗаказа = Справочники.СостоянияЗаказовПоставщикам.Открыт;
				Заказпоставщику.ВалютаДокумента = ТЗВЗАказ[0].Поставщик.ДоговорПоУмолчанию.ВалютаРасчетов;
				ЗаказПоставщику.Контрагент = ТЗВЗАказ[0].Поставщик;
				ЗаказПоставщику.ДатаПоступления = ТекущаяДата() 
				+ ?(ТипЗнч(ТЗВЗаказ[0].Срок)=Тип("Число") и ТЗВЗаказ[0].Срок<999, ТЗВЗаказ[0].Срок*24*60*60,0);
				ЗаказПоставщику.Договор = ТЗВЗАказ[0].Поставщик.ДоговорПоУмолчанию;
				Курс = РегистрыСведений.КурсыВалют.СрезПоследних();
				Для Каждого СтрокаКурс Из Курс Цикл
					Если СтрокаКурс.Валюта = Объект.ТипЦен.ВалютаЦены Тогда
						ЗаказПоставщику.Кратность = СтрокаКурс.Кратность;
						ЗаказПоставщику.Курс = СтрокаКурс.Курс;
					КонецЕсли;
				КонецЦикла;
			Конецпопытки;
			РежимЗаписиЗаказа = ?(Объект.ПроводитьДокументы=Истина,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись);
			Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыЗаказовПоставщикам") Тогда
				ЗаказПоставщику.Статус = Перечисления.СтатусыЗаказовПоставщикам.Закрыт;
			Иначе
				ЗаказПоставщику.Статус = Перечисления.СтатусыЗаказовПоставщикам.Согласован;
			КонецЕсли;
		ИначеЕсли Лев(Объект.Конфигурация,29) = "РозницаМагазинАвтозапчастей 2" Тогда
			ЗаказПоставщику.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			ЗаказПоставщику.Магазин = ТЗВЗАказ[0].Склад.Магазин;
			РежимЗаписиЗаказа = РежимЗаписиДокумента.Запись;
			ЗаказПоставщику.ЗаказПокупателя = ТЗВЗАказ[0].ЗаказПокупателя;
			ЗаказПоставщику.УчитыватьНДС = Истина;
			ЗаказПоставщику.ЦенаВключаетНДС = Истина;
		ИначеЕсли Объект.Конфигурация = "УправлениеНебольшойФирмой 1.6" Тогда
			ЗаказПоставщику.ЗаказПокупателя = ТЗВЗАказ[0].ЗаказПокупателя;
			Запрос=Новый Запрос(
			 "ВЫБРАТЬ
			 |	ОсновныеДоговорыКонтрагента.Договор КАК Договор
			 |ИЗ
			 |	РегистрСведений.ОсновныеДоговорыКонтрагента КАК ОсновныеДоговорыКонтрагента
			 |ГДЕ
			 |	ОсновныеДоговорыКонтрагента.Организация = &Организация
			 |	И ОсновныеДоговорыКонтрагента.Контрагент = &Контрагент
			 |	И ОсновныеДоговорыКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.СПоставщиком)"
			);
			Запрос.УстановитьПараметр("Контрагент",ТЗВЗАказ[0].Поставщик);
			Запрос.УстановитьПараметр("Организация",Объект.ОрганизацияДляЗаявки);			
			Выб=Запрос.Выполнить().Выбрать();
			Если Выб.Следующий() Тогда
				ЗаказПоставщику.Договор=Выб.Договор;
			Иначе
				Запрос=Новый Запрос(
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
				|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
				|ГДЕ
				|	ДоговорыКонтрагентов.Владелец = &Контрагент
				|	И (ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.СПоставщиком)
				|			ИЛИ ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.СПокупателем))
				|	И ДоговорыКонтрагентов.Недействителен = ЛОЖЬ
				|	И (ДоговорыКонтрагентов.СрокДействия >= &ТекущаяДата
				|			ИЛИ ДоговорыКонтрагентов.СрокДействия = ДАТАВРЕМЯ(1, 1, 1))
				|	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
				|	И ДоговорыКонтрагентов.Организация = &Организация
				|
				|УПОРЯДОЧИТЬ ПО
				|	ДоговорыКонтрагентов.ВидДоговора,
				|	ДоговорыКонтрагентов.ДатаДоговора УБЫВ");
				Запрос.УстановитьПараметр("Контрагент",ТЗВЗАказ[0].Поставщик);
				Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
				Запрос.УстановитьПараметр("Организация",Объект.ОрганизацияДляЗаявки);;			
				Выб=Запрос.Выполнить().Выбрать();
				Если Выб.Следующий() Тогда
					ЗаказПоставщику.Договор=Выб.Ссылка;
				КонецЕсли;
			КонецЕсли;
			Состояние=Справочники.СостоянияЗаказовПоставщикам.НайтиПоНаименованию("В работе");
			Если ЗначениеЗаполнено(Состояние) Тогда
				ЗаказПоставщику.СостояниеЗаказа=Состояние;
			КонецЕсли;
			ЕСли МетаданныеДокумента.Реквизиты.Найти("ВидОперации")<>Неопределено Тогда
				ЗаказПоставщику.ВидОперации=Перечисления.ВидыОперацийЗаказПоставщику.ЗаказНаЗакупку;
			КонецЕсли;
			Если Метаданные.Справочники.СтавкиНДС.Реквизиты.Найти("НеОблагается")<>Неопределено Тогда
				ЗаказПоставщику.НалогообложениеНДС=?(Объект.НДСПоУмолчанию.НеОблагается,Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС,
				Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС);
			Иначе
				ЗаказПоставщику.НалогообложениеНДС=?(Объект.НДСПоУмолчанию.Ставка=0,Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС,
				Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС);
			КонецЕсли;
			ЗаказПоставщику.НДСВключатьВСтоимость=Истина;
		ИначеЕсли Лев(Объект.Конфигурация,9) = "Автосалон" Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =   "ВЫБРАТЬ
			                 |	ДоговорыВзаиморасчетов.Ссылка КАК Ссылка,
			                 |	ДоговорыВзаиморасчетов.ПодразделениеКомпании КАК ПодразделениеКомпании
			                 |ИЗ
			                 |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
			                 |ГДЕ
			                 |	ДоговорыВзаиморасчетов.Организация = &Организация
			                 |	И ДоговорыВзаиморасчетов.ПодразделениеКомпании В ИЕРАРХИИ(&ПодразделениеКомпании)
			                 |	И ДоговорыВзаиморасчетов.ВидДоговора = &ВидДоговора
			                 |	И ДоговорыВзаиморасчетов.Владелец = &Владелец
			                 |
			                 |УПОРЯДОЧИТЬ ПО
			                 |	ДоговорыВзаиморасчетов.Основной УБЫВ";
			Запрос.УстановитьПараметр("Организация", Объект.ОрганизацияДляЗаявки);
			Запрос.УстановитьПараметр("ПодразделениеКомпании", ПараметрыСеанса.ПодразделениеКомпании);
			Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоров.Покупка);
			Запрос.УстановитьПараметр("Владелец", ТЗВЗАказ[0].Поставщик);
			Выборка = Запрос.Выполнить().Выбрать();
			Если ВЫборка.Следующий() Тогда
				ЗаказПоставщику.ДоговорВзаиморасчетов = Выборка.Ссылка;
				ЗаказПоставщику.ПодразделениеКомпании = Выборка.ПодразделениеКомпании;
			Иначе	
				ЗаказПоставщику.ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
			КонецЕсли;
			ЗаказПоставщику.ТипЦен = Объект.ТипЦен;
			ЗаказПоставщику.СрокПоставки = ТекущаяДата() 
			+?(ТипЗнч(ТЗВЗаказ[0].Срок)=Тип("Число") и ТЗВЗаказ[0].Срок<999, ТЗВЗаказ[0].Срок*24*60*60,0);
			ЗаказПоставщику.Автор = ПараметрыСеанса.АвторизованныйПользователь;
			ЗаказПоставщику.ВалютаДокумента = Объект.ТипЦен.ВалютаЦены;
			ЗаказПоставщику.ДатаОперации = ТекущаяДата();
			ЗаказПоставщику.ДатаСоздания = ТекущаяДата();
			ЗаказПоставщику.КурсДокумента = 1;
			ЗаказПоставщику.КурсВалютыУпр = 1;
			ЗаказПоставщику.ХозОперация = Справочники.ХозОперации.ЗаказПоставщику;
		КонецЕсли;
		ЗаказПоставщику.Организация = Объект.ОрганизацияДляЗаявки;
		ЗаказПоставщику.Контрагент = ТЗВЗАказ[0].Поставщик;
		Если НЕ ЗаказПоставщику.Метаданные().Реквизиты.Найти("Партнер") = Неопределено Тогда
			ЗаказПоставщику.Партнер=ЗаказПоставщику.Контрагент.Партнер;
		КонецЕсли;
		Если НЕ Документы.ЗаказПоставщику.ПустаяСсылка().Метаданные().Реквизиты.Найти("Склад") = Неопределено Тогда
			ЗаказПоставщику.Склад = ТЗВЗАказ[0].Склад;
		КонецЕсли;
		Если МетаданныеДокумента.Реквизиты.Найти("ДатаПоступления") <> Неопределено Тогда
			ЗаказПоставщику.ДатаПоступления = ТекущаяДата()
			+ ?(ТипЗнч(ТЗВЗаказ[0].Срок)=Тип("Число") и ТЗВЗаказ[0].Срок<999, ТЗВЗаказ[0].Срок*24*60*60,0);
		КонецЕсли;
		Если Метаданные.ОбщиеМодули.Найти("УчетНДСУП") <> Неопределено Тогда
			ЗаказПоставщику.ЗаполнитьУсловияЗакупокПоУмолчанию(Ложь);
			ЗаказПоставщику.ВариантПриемкиТоваров = ЗаказПоставщику.Договор.ВариантПриемкиТоваров;
			Если НЕ ЗначениеЗаполнено(ЗаказПоставщику.ВариантПриемкиТоваров) Тогда
				ЗаказПоставщику.ВариантПриемкиТоваров = Вычислить("ЗакупкиСервер.ПолучитьВариантПриемкиТоваров(Неопределено, ЗаказПоставщику.Договор)");
			КонецЕсли;
			ЗаказПоставщику.Приоритет = Справочники.Приоритеты.ПолучитьПриоритетПоУмолчанию(ЗаказПоставщику.Приоритет);
			ЗаказПоставщику.ПорядокРасчетов = Вычислить("ВзаиморасчетыСервер.ПорядокРасчетовПоДокументу(ЗаказПоставщику)");
			
			//ПараметрыЗаполнения = Документы.ЗаказПоставщику.ПараметрыЗаполненияВидаДеятельностиНДС(ЗаказПоставщику);
			//Выполнить("УчетНДСУП.ЗаполнитьВидДеятельностиНДС(ЗаказПоставщику.ЗакупкаПодДеятельность, ПараметрыЗаполнения)");
			//
			//ПараметрыЗаполнения = Документы.ЗаказПоставщику.ПараметрыЗаполненияНалогообложенияНДСЗакупки(ЗаказПоставщику);
			//Выполнить("УчетНДСУП.ЗаполнитьНалогообложениеНДСЗакупки(ЗаказПоставщику.НалогообложениеНДС, ПараметрыЗаполнения)");
		КонецЕсли;		
		СуммаДокумента=0;
		ТабЧасть=Метаданные.Документы.ЗаказПоставщику.ТабличныеЧасти.Найти("Товары");
		Если ТабЧасть=Неопределено тогда
			ТабЧасть=Метаданные.Документы.ЗаказПоставщику.ТабличныеЧасти.Найти("Запасы");
		КонецЕсли;
		ТабРекв=Табчасть.Реквизиты;
		
		Для каждого Строка Из ТЗВЗаказ Цикл
			Если Лев(Объект.Конфигурация,9) <> "Автосалон" Тогда
			    Попытка
					ЗаказПоставщикуСтрока = ЗаказПоставщику.Товары.Добавить();
					ЗаказПоставщикуСтрока.Номенклатура = Строка.Номенклатура;
					ЗаказПоставщикуСтрока.КоличествоУпаковок = Строка.Количество;
				Исключение
				    ЗаказПоставщикуСтрока = ЗаказПоставщику.Запасы.Добавить();
					ЗаказПоставщикуСтрока.Номенклатура = Строка.Номенклатура;
					//ЗаказПоставщикуСтрока.ДатаПоступления = ТекущаяДата() + ТЗВЗаказ[0].Срок*24*60*60;
				КонецПопытки;
				Если НЕ Лев(Объект.Конфигурация,29) = "РозницаМагазинАвтозапчастей 2" Тогда
					ЗаказПоставщикуСтрока.ДатаПоступления = ТекущаяДата()
					+ ?(ТипЗнч(ТЗВЗаказ[0].Срок)=Тип("Число") и ТЗВЗаказ[0].Срок<999, ТЗВЗаказ[0].Срок*24*60*60,0);
				КонецЕсли;
			Иначе
				ЗаказПоставщикуСтрока = ЗаказПоставщику.Товары.Добавить();
				ЗаказПоставщикуСтрока.Номенклатура = Строка.Номенклатура;
				ЗаказПоставщикуСтрока.ЕдиницаИзмерения = Строка.Номенклатура.ОсновнаяЕдиницаИзмерения;
				ЗаказПоставщикуСтрока.Коэффициент = 1; 
				Если ЗначениеЗаполнено(Строка.ЗаказПокупателя) Тогда
					СтрЗК=Строка.ЗаказПокупателя.Товары.Найти(Строка.Номенклатура,"Номенклатура");
					Если СтрЗК<>Неопределено Тогда
						Распределение=ЗаказПоставщику.РаспределениеЗаказа.Добавить();
						ЗаполнитьЗначенияСвойств(Распределение,ЗаказПоставщикуСтрока);
						ЗаказПоставщикуСтрока.Распределено = Мин(СтрЗК.Количество,Строка.Количество);
						Распределение.Количество = ЗаказПоставщикуСтрока.Распределено;
						Распределение.Цена = Строка.Цена;
						Распределение.ЗаказПокупателя=Строка.ЗаказПокупателя;
						Распределение.ЗаказОтправленПоставщику = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			ЗаказПоставщикуСтрока.Количество = Строка.Количество;
			ЗаказПоставщикуСтрока.Цена = Строка.Цена;
			ЗаказПоставщикуСтрока.Сумма = Строка.Сумма;
			ЗаказПоставщикуСтрока.СтавкаНДС = Строка.СтавкаНДС;
			ЗаказПоставщикуСтрока.СуммаНДС = Строка.СуммаНДС;
			Если ТабРекв.Найти("Всего")<>Неопределено Тогда ЗаказПоставщикуСтрока.Всего=Строка.Сумма;КонецЕсли;
			Если ТабРекв.Найти("СуммаВсего")<>Неопределено Тогда ЗаказПоставщикуСтрока.СуммаВсего=Строка.Сумма;КонецЕсли;
			СуммаДокумента=СуммаДокумента + ЗаказПоставщикуСтрока.Сумма;
			Если Объект.Конфигурация = "УправлениеТорговлей 11.0" ИЛИ
				Объект.Конфигурация = "УправлениеТорговлей 11.2" ИЛИ
				Объект.Конфигурация = "УправлениеТорговлей 11.4" Тогда
				Попытка
					ЗаказПоставщикуСтрока.СуммаСНДС = Строка.Всего;
					ЗаказПоставщикуСтрока.Склад = Строка.Склад;	
				Исключение
				КонецПопытки;
				//Подберем Назначение
				Если ЗначениеЗаполнено(Строка.ЗаказПокупателя) Тогда
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	ОбеспечениеЗаказовОстатки.Назначение КАК Назначение,
					               |	ОбеспечениеЗаказовОстатки.ПотребностьОстаток КАК ПотребностьОстаток,
					               |	ОбеспечениеЗаказовОстатки.КЗаказуОстаток КАК КЗаказуОстаток,
					               |	ОбеспечениеЗаказовОстатки.НаличиеПодЗаказОстаток КАК НаличиеПодЗаказОстаток
					               |ИЗ
					               |	РегистрНакопления.ОбеспечениеЗаказов.Остатки КАК ОбеспечениеЗаказовОстатки
					               |ГДЕ
					               |	ОбеспечениеЗаказовОстатки.Номенклатура = &Номенклатура
					               |	И ОбеспечениеЗаказовОстатки.Склад = &Склад
					               |	И ОбеспечениеЗаказовОстатки.Назначение.Заказ = &Заказ";
					Запрос.УстановитьПараметр("Номенклатура", ЗаказПоставщикуСтрока.Номенклатура);
					Запрос.УстановитьПараметр("Склад", ЗаказПоставщикуСтрока.Склад);
					Запрос.УстановитьПараметр("Заказ", Строка.ЗаказПокупателя);
					Выборка = Запрос.Выполнить().Выбрать();
					Пока Выборка.Следующий() Цикл
						ЗаказПоставщикуСтрока.Назначение = Выборка.НАзначение;
						Прервать;
					КонецЦикла;
				КонецЕсли;
			ИначеЕсли Лев(Объект.Конфигурация,29) = "РозницаМагазинАвтозапчастей 2" И НЕ Метаданные.Имя = "Розница" Тогда
				ЗаказПоставщикуСтрока.ор_ЗаказПокупателя=Строка.ЗаказПокупателя;
			ИначеЕсли Объект.Конфигурация = "УправлениеНебольшойФирмой 1.6" Тогда
				ЗаказПоставщикуСтрока.ЕдиницаИзмерения = ЗаказПоставщикуСтрока.Номенклатура.ЕдиницаИзмерения;
				ЗаказПоставщикуСтрока.Всего = ЗаказПоставщикуСтрока.Сумма;
			КонецЕсли;
			Если ТипЗнч(Строка.Срок)=Тип("Число") и Строка.Срок<999 И Строка.Срок>МаксДней Тогда МаксДней=Строка.Срок КонецЕсли;
		КонецЦикла;  		
	    Если Метаданные.Документы.ЗаказПоставщику.Реквизиты.Найти("ЖелаемаяДатаПоступления")<>Неопределено Тогда
			ЗаказПоставщику.ЖелаемаяДатаПоступления = ТекущаяДата()
			+ ?(ТипЗнч(ТЗВЗаказ[0].Срок)=Тип("Число") и ТЗВЗаказ[0].Срок<999, ТЗВЗаказ[0].Срок*24*60*60,0);
		КонецЕсли;
		Если Метаданные.Документы.ЗаказПоставщику.Реквизиты.Найти("СуммаВключаетНДС")<>Неопределено Тогда
			ЗаказПоставщику.СуммаВключаетНДС=Истина;
		КонецЕсли;
		Если Метаданные.Документы.ЗаказПоставщику.Реквизиты.Найти("СуммаДокумента")<>Неопределено Тогда
			ЗаказПоставщику.СуммаДокумента=СуммаДокумента;
		КонецЕсли;
		Если Объект.Конфигурация = "УправлениеТорговлей 11.0" ИЛИ
			Объект.Конфигурация = "УправлениеТорговлей 11.2" ИЛИ
			Объект.Конфигурация = "УправлениеТорговлей 11.4" Тогда
			ЗаказПоставщику.ЗаполнитьЭтапыГрафикаОплаты();
		КонецЕсли;
		Попытка
			ЗаказПоставщику.Записать(?(Объект.ПроводитьДокументы=Истина,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
		Исключение
			Если Объект.ПроводитьДокументы=Истина Тогда
				Ошибка=ОписаниеОшибки();
				ЗаказПоставщику.Записать(РежимЗаписиДокумента.Запись);
				Сообщить("Документ "+Строка(ЗаказПоставщику)+" не проведен из-за ошибки:"+Символы.ПС+Ошибка);
			Иначе
				ВызватьИсключение ОписаниеОшибки();
			КонецЕсли;
		Конецпопытки;
		ОформленныеЗаказы.Добавить(ЗаказПоставщику.Ссылка,,ЗаказПоставщику.Проведен);
		Для каждого ТекЗаказ Из ТЗВЗаказ Цикл
			Объект.ЗаявкаПоставщику.Получить(ТекЗаказ.НомерСтроки-1).ЗаказПоставщику = ЗаказПоставщику.Ссылка;
		КонецЦикла;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЗаказы(Команда)
	ЕСли Объект.ПользовательИмя<>ПользовательКорзины Тогда
		Сообщить("Для удаления строк необходимо работать со своей корзиной");
		Возврат;
	КонецЕсли;
	Отбор=Новый Структура("Выбран,Пользователь",Истина,Объект.ПользовательИмя);//вс(
	Массив = Объект.ЗаявкаПоставщику.НайтиСтроки(Отбор);
	Оповещение=Новый ОписаниеОповещения("ОчиститьЗаказыОтвет",ЭтаФорма,Массив);
	Если Массив.Количество()>0 Тогда
		ПоказатьВопрос(Оповещение,"Удалить все выбранные записи ?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
	Иначе
		Массив = Объект.ЗаявкаПоставщику.НайтиСтроки(Новый Структура("Пользователь",Объект.ПользовательИмя));
		Если Массив.Количество()>0 Тогда
			ПоказатьВопрос(Оповещение,"Удалить все Ваши записи ?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		Иначе
			ПоказатьПредупреждение(,"В Заявках Поставщику нет записей пользователя "+Объект.ПользовательИмя);
		КонецЕсли;
	КонецЕсли;
Конецпроцедуры

&НаКлиенте
Процедура ОчиститьЗаказыОтвет(Ответ,Массив) Экспорт
	Если Ответ <> КодВозвратаДиалога.Да Тогда Возврат;КонецЕсли;
	
	//Для Каждого Стр Из Массив Цикл
	Колво=Массив.Количество();
	Для инд=1 по колво Цикл
		Стр=Массив[Колво-инд];
		// Удаляем ссылку на запись в корзине
		Строки=Объект.ЗаявкаНаОформление.НайтиСтроки(Новый Структура("КодЗП",Стр.КодСтроки));
		Если Строки.Количество()>0 Тогда Строки[0].КОдЗП=0;КонецЕсли;
		//Сообщаем об удалении записи
		СендерОтправить("{""action"":""del"",""table"":""ordered"",""idData"":"+Формат(Стр.КодСтроки,"ЧГ=;ЧН=")+"}");
		Объект.ЗаявкаПоставщику.Удалить(Стр);
	КонецЦикла;
	Элементы.Группа10.Заголовок = "Заказанное(" + Объект.ЗаявкаПоставщику.Количество() + ")";
	СохранитьДанныеПоЗаказамПоставщикам();
	СохранитьДанныеПоКорзине(ПользовательКорзины);
	//вс)
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьФлажкиПоставщику(Команда)
	Флаг=Команда.Имя="УстановитьФлажкиПоставщику";
	Для каждого СтрокаТЗ Из Объект.ЗаявкаПоставщику Цикл
		Инд=СтрокаТЗ.ПолучитьИдентификатор();
		Если Элементы.ЗаявкаПоставщику.ПроверитьСтроку(Инд)=Истина Тогда
			Если Флаг = Неопределено Тогда
			  СтрокаТЗ.Выбран = НЕ СтрокаТЗ.Выбран;
			Иначе	
			  СтрокаТЗ.Выбран = Флаг;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиПоставщикуБезДокумента(Команда)
	Для каждого СтрокаТЗ Из Объект.ЗаявкаПоставщику Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЗ.ЗаказПоставщику) Тогда
			СтрокаТЗ.Выбран = Истина;
		Иначе
			СтрокаТЗ.Выбран = Ложь;
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод(Команда)
	Если Элементы.ЗаявкаПоставщику.ОтборСтрок=Неопределено или Элементы.ЗаявкаПоставщику.ОтборСтрок.Количество()=0 Тогда
		Диалог = Новый ДиалогРедактированияСтандартногоПериода();
		Диалог.Период = Новый СтандартныйПериод(); //ПериодЗаявокПоставщику;
		ОО=Новый описаниеОповещения("УстановкаПериода",ЭтаФорма);
		Диалог.Показать(ОО);
	Иначе
		Элементы.ЗаявкаПоставщику.ОтборСтрок=Неопределено;
		Элементы.ЗаявкаПоставщикуКнопка9.ЦветФона=Новый Цвет(255, 255, 255);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановкаПериода(НовыйПериод, Доп) Экспорт
	Если НовыйПериод=Неопределено Тогда
		//Элементы.ЗаявкаПоставщику.ОтборСтрок=Неопределено;
		Возврат;
	КонецЕсли;
	//ПериодЗаявокПоставщику=НовыйПериод;
	Для Каждого Стр Из Объект.ЗаявкаПоставщику Цикл
		Стр.ОтборФильтр = Стр.Дата>=НовыйПериод.ДатаНачала И (Стр.Дата<=НовыйПериод.ДатаОкончания или НовыйПериод.ДатаОкончания='00010101');
	КонецЦикла;
	Элементы.ЗаявкаПоставщику.ОтборСтрок = Новый ФиксированнаяСтруктура("ОтборФильтр",Истина);
	Элементы.ЗаявкаПоставщикуКнопка9.ЦветФона=Новый Цвет(200,255,225);
Конецпроцедуры

&НаКлиенте
// Производит контроль наличия Поставщика и оформленных документов
// Документ: "ЗаказПоставщику" или "ПоступлениеТовара"
Процедура ОформитьПоступленияТовара(Команда)
 	Отбор=Объект.ЗаявкаПоставщику.НайтиСтроки(Новый Структура("Выбран",Истина));//вс(
	Если Отбор.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Нет отмеченных строк для формирования документов!");
		Возврат;
	КонецЕсли;
	Пользователи1=Новый Соответствие;
	Кол=0;НетПост=0;
	Для каждого Стр Из Отбор Цикл
		Если ЗначениеЗаполнено(Стр.ПоступлениеТовара) Тогда Кол=Кол+1;КонецЕсли;
		Если ТипЗнч(Стр.Поставщик)=Тип("Строка") Или Не ЗначениеЗаполнено(Стр.Поставщик) Тогда НетПост=НетПост+1;КонецЕсли;
		Пользователи1.Вставить(Стр.Пользователь);
	КонецЦикла;
	Если Кол>0 ИЛИ НетПост>0 Тогда
		ОО=Новый ОписаниеОповещения("ОформитьДокументыСПоставщиком",ЭтаФорма,Пользователи1);
		ПоказатьВопрос(ОО,?(Кол>0,"Для "+Строка(Кол)+" отмеченных строк уже оформлены документы","")+
		?(НетПост>0, ?(Кол>0, " и в ","В "),"")+?(НетПост>0,Строка(НетПост)+" строк"+?(НетПост=1,"е","ах")
		+" не определен поставщик","")+". Продолжить?",	РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
	Иначе
		ОформитьДокументыСПоставщиком(КодВозвратаДиалога.Да,Пользователи1);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОформитьДокументыСПоставщиком(Ответ,Пользователи1) Экспорт
	Если Ответ<>КодВозвратаДиалога.Да Тогда Возврат;КонецЕсли;
	Поступления=ОформитьПоступленияТовараНаСервере();
	Если Поступления.Количество()>0 Тогда
		СохранитьДанныеПоЗаказамПоставщикам(Пользователи1); 
		Для Каждого Значение Из Поступления Цикл
			Поступление = Значение.Значение;
			ПоказатьЗначение(,Поступление);
		КонецЦикла;
	КонецЕсли;
Конецпроцедуры	

&НаСервере
Функция ОформитьПоступленияТовараНаСервере()
	Обработка=РеквизитФормыВзначение("Объект");
	Поступления=Обработка.ОформитьПоступленияТовара();
	ЗначениеВДанныеФормы(Обработка.ЗаявкаПоставщику,Объект.ЗаявкаПоставщику);
	Возврат Поступления;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбщегоНазаначения

// ***** Общего назаначения *****
&НаКлиентеНаСервереБезКонтекста 
Функция ПодготовитьНомер(СтрНом) Экспорт
	СтрНомер=СокрЛП(строка(СтрНом));
	СтрНомер=Стрзаменить(СтрНомер,символы.НПП,"");
	СтрНомер=Стрзаменить(СтрНомер,",","");
	СтрНомер=Стрзаменить(СтрНомер,")","");
	СтрНомер=Стрзаменить(СтрНомер,"(","");
	СтрНомер=Стрзаменить(СтрНомер,"-","");
	СтрНомер=Стрзаменить(СтрНомер,".","");
	СтрНомер=Стрзаменить(СтрНомер," ","");
	СтрНомер=Стрзаменить(СтрНомер,"-","");
	СтрНомер=Стрзаменить(СтрНомер,"""","");
	СтрНомер=Стрзаменить(СтрНомер,"'","");
	СтрНомер=Стрзаменить(СтрНомер,":","");
	СтрНомер=Стрзаменить(СтрНомер,";","");
	СтрНомер=Стрзаменить(СтрНомер,"/","");
	СтрНомер=Стрзаменить(СтрНомер,"|","");
	СтрНомер=Стрзаменить(СтрНомер,"\","");
	СтрНомер=Стрзаменить(СтрНомер,"!","");
	СтрНомер=Стрзаменить(СтрНомер,"#","");
	СтрНомер=Стрзаменить(СтрНомер,"№","");
	СтрНомер=Стрзаменить(СтрНомер,"?","");
	СтрНомер=Стрзаменить(СтрНомер,"*","");
	СтрНомер=Стрзаменить(СтрНомер,">","");
	СтрНомер=Стрзаменить(СтрНомер,"<","");	
	СтрНомер=Стрзаменить(СтрНомер,"_","");	
	Возврат ВРЕГ(СтрНомер);
Конецфункции

&НаСервере
Функция ЗаполнитьТаблицуГрупп()
	Обработка=РеквизитФормыВЗначение("Объект");
	ТаблицаГруппТоваров=Обработка.ПоискГруппПоАртикулу(Объект.НомерАртикула, Предикат);
	ТаблицаГруппТоваров.Сортировать("Родитель");
	Массив=Новый Массив;
	Для Каждого Стр Из ТаблицаГруппТоваров Цикл
		Массив.Добавить(Новый Структура("ID_Группы,Наименование,Родитель",Стр.ID_Группы,Стр.Наименование,Стр.Родитель));
	КонецЦикла;
	Возврат Массив;
КонецФункции

&НаКлиенте
Процедура ПоискПоАртикулу(СписокГрупп="") Экспорт
	Если СписокГрупп=Неопределено Тогда СписокГрупп="";КонецЕсли;
	Попытка
		СтрокаОриг = Объект.НомерАртикула;
		СтрокаПоиска = ПодготовитьНомер(СтрокаОриг);
		Если (ЭтаФорма.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.Элементы.СтраницаПоискПоАртикулу или Объект.ОбщийПоискВрем)
			И Объект.ИспользоватьБазуКроссов Тогда
			ПоискВКроссах(СписокГрупп);
		КонецЕсли;
		
	Если (Объект.ОбщийПоискВрем или ЭтаФорма.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.Элементы.СтраницаПоискПоПрайсу)
		И Объект.ИспользоватьПрайсЛист Тогда
			//- ПоискПрайсНаКлиенте(СтрокаПоиска,СтрокаОриг);
			ПоискПрайсНаКлиенте_3(СтрокаПоиска,СтрокаОриг);
		КонецЕсли;

		Если ((Объект.ОбщийПоискВрем или ЭтаФорма.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.Элементы.ПоискЕмекс) ИЛИ
			(Объект.ОбщийПоискВрем или ЭтаФорма.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.Элементы.ГруппаУточнениеПоиска) ) И 
			Объект.ИспользоватьПроценкуОнлайнПоставщиков Тогда	
			Объект.РезультатПоискаОнлайн.Очистить(); 
			ПоискПроценки();
			//УровеньЦенЕмексПриИзмененииНаСервере();
		КонецЕсли;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	УстановитьОтборФильтр();
КонецПроцедуры

&НаСервере
Процедура РассчитатьКоличествоЭлементов()Экспорт
	
	Если ЗначениеЗаполнено(КолКроссов) И КолКроссов > 0 Тогда
		Элементы.СтраницаПоискПоАртикулу.Заголовок = "по Базе Кроссов (" + КолКроссов + ")";
	Иначе
		Элементы.СтраницаПоискПоАртикулу.Заголовок = "по Базе Кроссов";
	КонецЕСли;
	
	Если ЗначениеЗаполнено(КолПрайс) И КолПрайс > 0 Тогда
		Элементы.СтраницаПоискПоПрайсу.Заголовок = "по Прайс-листам (" + КолПрайс + ")";
	Иначе
		Элементы.СтраницаПоискПоПрайсу.Заголовок = "по Прайс-листам";
	КонецЕСли;
	
	Если ЗначениеЗаполнено(КолЕмекс) И КолЕмекс > 0 Тогда
		Элементы.ПоискЕмекс.Заголовок = "по Поставщикам (" + КолЕмекс + ")";
	Иначе
		Элементы.ПоискЕмекс.Заголовок = "по Поставщикам";
	КонецЕСли;
	
	Если Объект.ТекущийЗК=0 Тогда
		Колво=Объект.ЗаявкаНаОформление.Количество();
		Элементы.СтрКорзина.Заголовок="Корзина"+?(Колво=0,""," ("+Колво+")");
	КонецЕсли;
	
	ЕСли Объект.ЗаявкаПоставщику.Количество() > 0 Тогда
		Элементы.Группа10.Заголовок = "Заказанное(" + Объект.ЗаявкаПоставщику.Количество() + ")";
	Иначе
		Элементы.Группа10.Заголовок = "Заказанное";
	КонецЕСли;	
	
КонецПроцедуры

&НаКлиенте
Функция ВыполнитьМетодНаКлиенте(Метод,ТекСтр)
	Попытка
		ИмяМетода=Метод.Сайт+"_"+Метод.Метод;
		Рез=Неопределено;
		Если ИмяМетода="Корзина_Подбор" Тогда
			Рез=Корзина_Подбор();
		Иначе
			Возврат "Метод "+Метод.Метод+" для сайта "+Метод.Сайт+" не найден";
		КонецЕсли;
		Возврат Рез;
	Исключение
		Возврат ОписаниеОшибки();
	КонецПопытки;	
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КодНовойСтрокиПользователя(Таблица,Пользователь)
	Строки=Таблица.НайтиСтроки(Новый Структура("Пользователь",Пользователь));
	Колво=Строки.Количество();
	Если Колво=0 Тогда Возврат 1;КонецЕсли;
	
	Массив=Новый СписокЗначений;
	Для Каждого Стр Из Строки Цикл
		Массив.Добавить(Стр.КодСтроки);
	КонецЦикла;
	Массив.СортироватьПоЗначению();
	МаксКод=Массив[Колво-1].Значение;
	Если МаксКод<=2*Колво Тогда
		Возврат МаксКод+1;
	Иначе
		Номер=1;
		Для Каждого Код Из Массив Цикл
			Если Код.Значение>Номер Тогда Прервать;КонецЕсли;
			Номер=Номер+1;
		КонецЦикла;
		Возврат Номер;
	КонецЕсли;			
КонецФункции

&НаКлиенте
// Функция возвращает идентификатор следующей строки Таблицы 
// после данных строки ТекДан, а если она последняя - то предудущей.
// Используется для установки новой строки при удалении.
// Сначала получаем идентификатор, потом удаляем, потом устанавливаем новую текущую строку
//
Функция ПолучитьСледующуюСтроку(Таблица,ТекДан)
	Инд=Таблица.Индекс(ТекДан);
	Если Инд=Таблица.Количество()-1 Тогда
		Если Инд=0 Тогда Возврат Неопределено; КонецЕсли;
		Инд=Инд-1;
	КонецЕсли;
    Возврат Таблица[Инд].ПолучитьИдентификатор();
КонецФункции

&НаСервере
// Функция проверяет наличие Реквизита в метаданных объета. 
// Дополнительно, при  наличии параметра Тип - проверяется содержит ли Реквизит заданный тип.
// Возвращает Истина или Ложь
//
Функция ЕстьРеквизит1С(МетаОбъект, Реквизит, Тип=Неопределено)
	МетаРеквизит = МетаОбъект.Реквизиты.Найти(Реквизит); 
	Если МетаРеквизит=Неопределено Тогда
		МетаРеквизит = Метаданные.ОбщиеРеквизиты.Найти(Реквизит);
		Если МетаРеквизит=Неопределено Тогда Возврат Ложь;
		Иначе
			ЭлСостава = Метаданные.ОбщиеРеквизиты[Реквизит].Состав.Найти(МетаОбъект);
			Если ЭлСостава=Неопределено или ЭлСостава.Использование<> Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать Тогда Возврат Ложь;КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Тип=Неопределено или МетаРеквизит.Тип.СодержитТип(Тип);
КонецФункции

// Функция возвращает число из строки, удаляя все пробельные символы, начальные и конечные не цифры
// Если Строка не имеет цифр или пустая - возвращается 0.
// Если вместо строки передается число - оно же и возвращается. 
//
&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьЧисло(Данные,Ноль=0) Экспорт
	Если ТипЗнч(Данные)=Тип("Число") Тогда Возврат Данные;КонецЕсли; 
	Если ПустаяСтрока(Данные) Тогда Возврат Ноль;КонецЕсли; 
	Попытка 
		Данные=СтрЗаменить(СтрЗаменить(СтрЗаменить(Данные, Символы.НПП, "")," ", ""),",",".");
		Возврат Число(Данные); 
	Исключение
		Симв=Лев(Данные,1);
		//Числа = (Симв>="0" И Симв <= "9") ИЛИ Симв="-" или Симв="+";
		Нач=0; Длина=0; ТочкиНет=Истина; Знак="";
		Кол = СтрДлина(Данные);
		Для Поз=1 по Кол Цикл
			Симв=Сред(Данные,Поз,1);
			Число = (Симв>="0" И Симв <= "9"); 
			Если Не Число Тогда
				Если Длина=0 и (Симв="-" или Симв="+") Тогда
					Знак=Симв;
				ИначеЕсли Длина>0 И ТочкиНет И Симв="." Тогда
					ТочкиНет=Ложь;
					Длина=Длина+1;
				ИначеЕсли Длина>0 Тогда
					Длина=Поз-Нач;
					Прервать;
				КонецЕсли;
			Иначе
				Если Длина=0 Тогда
					Нач=Поз;
				КонецЕсли;
				Длина=Длина+1;
			КонецЕсли;
		КонецЦикла;
		Если Длина=0 Тогда
			Возврат Ноль;
		Иначе
			Возврат Число(Знак+Сред(Данные,Нач,Длина));
		КонецЕсли;
	Конецпопытки
КонецФункции

#КонецОбласти

#Область ПоискВКроссах

// ***** Поиск в Кроссах
&НаСервере
Процедура ПоискВКроссах(СписокГрупп)
	СтрокаОриг = Объект.НомерАртикула;
	СтрокаПоиска = ПодготовитьНомер(СтрокаОриг);
	Обработка=РеквизитФормыВЗначение("Объект");
	//Вызовем процедуру поиска
	//ТЗКроссов = Обработка.ПоискПоАртикулуВКроссах(СтрокаПоиска, Предикат, СписокГрупп); 		
	ТЗКроссов = Обработка.ПоискПоАртикулуВКроссах(СтрокаПоиска, Предикат, СписокГрупп, ВидПоискаКросс, Объект.АналогиБК);	
	Если Метаданные.Справочники.Найти("Номенклатура") <> Неопределено Тогда
		Обработка.ПоискВ1С(ТЗКроссов, СтрокаОриг,Объект.ПоШаблону);
	Иначе
		ТЗКроссов.Колонки.Добавить("ВБазе", Новый ОписаниеТипов("Число"));
		ТЗКроссов.Колонки.Добавить("ВКроссах", Новый ОписаниеТипов("Число"));
		ТЗКроссов.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("Строка"));
		ТЗКроссов.Колонки.Добавить("ПорядковыйНомер", Новый ОписаниеТипов("Число"));
		Для каждого Запись ИЗ ТЗКроссов Цикл
			Запись.ВБазе = 0;
			Запись.ВКроссах = 1;
		КонецЦикла;
	КонецЕсли;
	РезультатПоискаТЗ.Загрузить(ТЗКроссов);		
		
	//Заполним список выбора ФильтрМарка
    ТабПоставщики = ТЗКроссов.Скопировать(,"поставщик");
    ТабПоставщики.Свернуть("поставщик");
    Элементы.ФильтрМарка.СписокВыбора.ЗагрузитьЗначения(ТабПоставщики.ВыгрузитьКолонку("поставщик"));
    Элементы.ФильтрМарка.СписокВыбора.СортироватьПоЗначению();
	
	КолСтр=Обработка.ВыводРезультатаПоиска(ТЗКроссов,Результат);
	Элементы.СтраницаПоискПоАртикулу.Заголовок="по Базе Кроссов ("+Строка(КолСтр)+")";	
Конецпроцедуры

&НаКлиенте
Процедура ВходВгруппу(Результат,Номенклатура) Экспорт
	
   ВходВгруппуЕмексСервер(Результат, Номенклатура); 
   ПараметрыФормы=Новый Структура("Ключ",Номенклатура);
   ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта",ПараметрыФормы);	
   
КонецПроцедуры

&НаСервере
Функция ДобавитьТоварВБазуНаСервере(Значение, ТипНомера, Элемент, НомерКартинки=0)
	Обработка=РеквизитФормыВЗначение("Объект");
	Номенклатура=Обработка.ДобавлениеТовараВБазу(Значение, ТипНомера);
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда Возврат Номенклатура;КонецЕсли;
	
	Если Элемент="Результат" или Элемент="Результат1" Тогда
		ТЗКроссов = РезультатПоискаТЗ.Выгрузить(); 
		Стр=ТЗКроссов.Найти(Значение,"ART_ID");
		Стр.Номенклатура=Номенклатура;
		Стр.ВБазе=1;
		Обработка.ЗаменаОбластиТабДок(Результат, "МакетПоискаПоАртикулу", Значение, Номенклатура);
		Элементы.Результат.ТекущаяОбласть=Результат.ТекущаяОбласть;
	Иначе
		Обработка.ЗаменаОбластиТабДок(РезультатПоДереву, "МакетУзлов", Значение, Номенклатура);
		Элементы.РезультатПоДереву.ТекущаяОбласть=РезультатПоДереву.ТекущаяОбласть;
	КонецЕсли;	
	
	Возврат Номенклатура;
КонецФункции

&НаКлиенте
Процедура ДобавитьВЗаявку(Данные,Запись) Экспорт
	Если Данные=Неопределено тогда возврат;КонецЕсли;
	ЕСли Объект.СборАналитики И Запись.ИсточникИнформации <> "1C" Тогда
		СендерОтправить(Новый Структура("schema, action, ID, article, manufacturer, articleName, date,ipUser,noReply,
		| supplierName,supplierStore, deliveryDay, buyerStore, count, priceIn, priceOut, stockAvailability, company, userName",
		"analytics","toCart",Запись.КодВКорзине,Запись.Артикул,Запись.Производитель,СтрЗаменить(Запись.Наименование,"'",""),
		Формат(ТекущаяДата(),"ДФ=""гггг-ММ-дд ЧЧ:мм:сс"""),Объект.IPКлиента,Истина,
		Запись.Сайт,Запись.Склад,МаксЧисло(Запись.СрокДоставкиГарантированный, Запись.СрокДоставки, 0),
		Строка(Объект.СкладДляЗаявки),Окр(Данные.Количество,0),Окр(Запись.ЦенаПоставки,0),Окр(Данные.Цена,0),Окр(Запись.Наличие1С,0),
		Строка(Объект.ОрганизацияДляЗаявки), Объект.ПользовательИмя));
	КонецЕсли;
	Запись.Удалить("Наличие1С");
	ДобавитьВЗаявкуНаСервере(Данные,Запись);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Возвращает максимальное число из Пар1, Пар2 или Умолч если оба не могут быть числами
Функция МаксЧисло(Знач Пар1, Знач Пар2, Знач Умолч)
	Если ТипЗнч(Пар1)<>Тип("Число") Тогда
		Попытка Пар1=Число(Пар1);Исключение Пар1=Неопределено;Конецпопытки;
	КонецЕсли;
	Если ТипЗнч(Пар2)<>Тип("Число") Тогда
		Попытка Пар2=Число(Пар2);
		Исключение Возврат ?(Пар1=Неопределено,Умолч,Пар1)
		Конецпопытки;
	КонецЕсли;
	Возврат ?(Пар1=Неопределено,Пар2,Макс(Пар1,Пар2));
КонецФункции		


&НаСервере
Процедура ДобавитьВЗаявкуНаСервере(Данные,Запись=Неопределено) Экспорт

	Если Данные=Неопределено тогда возврат;КонецЕсли;
	Если Запись=Неопределено Тогда
		ЕстьПоставщик=Данные.Свойство("Поставщик");
	КонецЕсли;
	
	Если Объект.ТекущийЗК<>0 Тогда 
		СменитьЗаявку(0);
		Элементы.ЗаказыКлиентов.ТекущаяСтрока=Объект.ЗаказыКлиентов[0].ПолучитьИдентификатор();
	КонецЕсли;
	Стр=Объект.ЗаявкаНаОформление.Добавить();
	
	Если Запись=Неопределено Тогда    //вызов с вкладки БК и Прайс-листы
		Стр.Склад=Данные.Склад;
		Если Объект.ЕстьНоменклатура И ЗначениеЗаполнено(Данные.Номенклатура) Тогда
			Стр.Артикул=Данные.Номенклатура.Артикул;
		Иначе
			Стр.Артикул=Данные.Артикул;
		КонецЕсли;
		Если ЕстьПоставщик Тогда
			Стр.Поставщик=Данные.Поставщик;
			Стр.Сайт = Данные.Поставщик;
		КонецЕсли;
	Иначе //вызов с вкладки онлайн-проценка
		ЗаполнитьЗначенияСвойств(Стр,Запись);
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(Стр,Данные);
	
	Если НЕ Объект.ЕстьНоменклатура Тогда
		Если Запись <> Неопределено Тогда
			Стр.Наименование = Запись.Наименование;
			Стр.Номенклатура = Запись.Наименование;
		Иначе
			Стр.Наименование = Данные.Номенклатура;
			Стр.Номенклатура = Данные.Номенклатура;
		КонецЕсли;
	Иначе
		Если Данные.Свойство("Номенклатура") Тогда
			Если ТипЗнч(Данные.Номенклатура) = Тип("Строка") Тогда
				Стр.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Запись = Неопределено Тогда
		ТекНоменклатура = Данные.Номенклатура;
		Если ЗначениеЗаполнено(Данные.Номенклатура) Тогда
			Стр.Наименование = ТекНоменклатура;
		КонецЕсли;
	Иначе
		ТекНоменклатура = Запись.Номенклатура;	
	КонецЕсли;
	
	Если Объект.ЕстьНоменклатура Тогда
		Если ЗначениеЗаполнено(ТекНоменклатура) Тогда
			Если Метаданные.Справочники.Номенклатура.Реквизиты.Найти("СтавкаНДС")<>Неопределено Тогда
				Стр.СтавкаНдс = ТекНоменклатура.СтавкаНДС; 
			ИначеЕсли Метаданные.Справочники.Номенклатура.Реквизиты.Найти("ВидСтавкиНДС")<>Неопределено Тогда
				Если Метаданные.Имя = "Автосервис" Тогда
					Стр.СтавкаНДС=Справочники.СтавкиНДС.СтавкаНДС(ТекНоменклатура.ВидСтавкиНДС, ТекущаяДатаСеанса());
				Иначе			
					Стр.СтавкаНдс = ТекНоменклатура.ВидСтавкиНДС;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Стр.СтавкаНДС) Тогда
			Стр.СтавкаНДС = Объект.НДСПоУмолчанию;
		КонецЕсли;
	Иначе
		Стр.СтавкаНДС = "20%";
	КонецЕсли;
	
	Если Запись=Неопределено И ЕстьПоставщик Тогда
		Если Данные.Свойство("ЦенаПоставки") Тогда  Стр.ЦенаПоставки=Данные.ЦенаПоставки;КонецЕсли;
		Если Данные.Свойство("СрокДоставки") и ТипЗнч(Данные.СрокДоставки)=Тип("Число") 
			и Данные.СрокДоставки<999 и Данные.СрокДоставки>=0 Тогда
			Стр.СрокДоставки=Данные.СрокДоставки;
			Стр.ДатаДоставки=НачалоДня(ТекущаяДата())+Стр.СрокДоставки*86400;
		Иначе
			Стр.СрокДоставки = "—";
		КонецЕсли;
		Если Данные.Свойство("СрокДоставкиГарантированный") и ТипЗнч(Данные.СрокДоставкиГарантированный)=Тип("Число") 
			и Данные.СрокДоставкиГарантированный<999 и Данные.СрокДоставкиГарантированный>=0 Тогда
			Стр.СрокДоставкиГарантированный=Данные.СрокДоставкиГарантированный;
			Стр.ДатаДоставкиМакс=НачалоДня(ТекущаяДата())+Стр.СрокДоставкиГарантированный*86400;
		Иначе
			Стр.СрокДоставкиГарантированный = "—";
		КонецЕсли;
	КонецЕсли;
	
	Если Запись <> Неопределено Тогда
		Если Запись.ИсточникИнформации = "1C" Тогда
			Стр.СрокДоставки = "—"; //0;
			Стр.СрокДоставкиГарантированный = "—"; //0;
		КонецЕсли;
	КонецЕсли;
	
	РассчитатьСуммы(Стр); 
	//зк(
	Объект.ЗаказыКлиентов[Объект.ТекущийЗК].Сумма = Объект.ЗаявкаНаОформление.Итог("Всего");
	Элементы.СтрКорзина.Заголовок="Корзина"+?(Объект.ЗаявкаНаОформление.Количество()=0,"",
	" ("+Объект.ЗаявкаНаОформление.Количество()+")");
	СохранитьДанныеПоКорзине(); //зк)
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаРасшифровкиНаСервере(Расшифровка, Элемент)
	Если Элемент="Результат" Тогда
		ТабДок=Результат;
	ИначеЕсли Элемент="Результат1" Тогда
		ТабДок=Результат1;
	ИначеЕсли Элемент="РезультатПоДереву" Тогда
		ТабДок=РезультатПоДереву;
	ИначеЕсли Элемент="РезультатПоДереву1" Тогда
		ТабДок=РезультатпоДереву1;
	КонецЕсли;
	//Разберемся, что за расшифровка
	Попытка
		Обработка=РеквизитФормыВЗначение("Объект");
		Если Расшифровка.Действие="СледующаяКартинка" Тогда
			Расшифровка.НомерКартинки=Расшифровка.НомерКартинки+1;
			Обработка.ВыводРасшифровки(Расшифровка.Значение, ТабДок, Расшифровка.НомерКартинки); 
		ИначеЕсли Расшифровка.Действие="ПредыдущаяКартинка" Тогда
			Расшифровка.НомерКартинки=Расшифровка.НомерКартинки-1;
			Обработка.ВыводРасшифровки(Расшифровка.Значение, ТабДок, Расшифровка.НомерКартинки); 
			
		ИначеЕсли Расшифровка.Действие = "ДополнитьИнформацию" Тогда
			
			Обработка.ДополнитьИнформацию(Расшифровка.Значение, Расшифровка.Номенклатура);
		ИначеЕсли Расшифровка.Действие = "РасшифровкаПоАртикулу" Тогда
			НомерКартинки=0;
			Если Элемент="Результат" Тогда
				Обработка.ВыводРасшифровки(Расшифровка.Значение, Результат1, НомерКартинки);
				Элементы.Результат.Видимость=Ложь;
				Элементы.Результат1.Видимость=Истина;
			Иначе
				Обработка.ВыводРасшифровки(Расшифровка.Значение, РезультатПоДереву1, НомерКартинки);
				Элементы.РезультатПоДереву.Видимость=Ложь;
				Элементы.РезультатПоДереву1.Видимость=Истина;
			КонецЕсли;
		КонецЕсли;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ПоискПрайс

// ***** Поиск в прайс-листах
&НаСервере
Функция ПолучитьНастройкиЗагрузки()
	НастройкаЗагрузки=ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","НастройкаЗагрузки",,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
	Мас=Новый Массив;
	ЕСли ТипЗнч(НастройкаЗагрузки)<>Тип("ТаблицаЗначений") Тогда
		Возврат Мас;
	КонецЕсли;
	Для Каждого Стр Из НастройкаЗагрузки Цикл
		Если Стр.Вкл Тогда
			Мас.Добавить(Новый Структура("Поставщик,ПутьКФайлу,Лист,Артикул,Наименование,Производитель,Время,Остаток,Цена",
			Стр.Поставщик,Стр.ПутьКФайлу,Стр.Лист,Стр.Артикул,Стр.Наименование,Стр.Производитель,Стр.Время,Стр.Остаток,Стр.Цена));
        КонецЕсли;
	КонецЦикла;
	Возврат Мас;
КонецФункции

&НаКлиенте
Процедура ПоискПрайсНаКлиенте(Артикул,АртОриг)
	Попытка
		Эксель = Новый COMОбъект("Excel.Application"); 
		Эксель.Displayalerts = 0;
	Исключение
		Сообщить("Ошибка при попытке работы с Mirosoft Excel, возможно он не установлен"+Символы.ПС+ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	НастройкаЗагрузки=ПолучитьНастройкиЗагрузки();
	Если НастройкаЗагрузки.Количество()=0 Тогда
		Сообщить("Отсутствуют данные - выполните настройку Прайс листов");
	КонецЕсли;
	ТЗРез=Новый Массив;
	Для Каждого СтрТаб из НастройкаЗагрузки Цикл
		Попытка	
			//сообщить("4512");
			Книга = Эксель.WorkBooks.Open(СокрЛП(СтрТаб.ПутьКФайлу),0,Истина);
			Если СтрТаб.Лист<>"" Тогда
				Лист=Книга.Worksheets(СтрТаб.Лист)
			Иначе
				Лист=Книга.Worksheets(1);
			КонецЕсли;
			Лист.Activate();
			ВсегоСтрок = Лист.Cells(1,1).SpecialCells(11).Row; 
			ИмяКолонки=Символ(64+СтрТаб.Артикул);
			КонОбл=":"+ИмяКолонки+Формат(ВсегоСтрок,"ЧГ=0");
			МасПоиск=Новый Массив;
			МасПоиск.Добавить(АртОриг);
			Если ВРЕГ(СокрЛП(АртОриг))<>ВРЕГ(СОКРЛП(Артикул)) Тогда
				МасПоиск.Добавить(Артикул);
			КонецЕсли;
			Попытка 
				АртЧисло=Число(АртОриг);
				МасПоиск.Добавить(АртЧисло);
			Исключение
			Конецпопытки;
			Для Каждого Искомое из МасПоиск Цикл
				НомерСтроки=1;
				Пока Истина Цикл
					Попытка
	        			Сдвиг=Эксель.WorksheetFunction.Match(Искомое,Лист.Range(ИмяКолонки+Формат(НомерСтроки,"ЧГ=0")+КонОбл),0);
					Исключение
						Сдвиг=Неопределено;
					Конецпопытки;
					//Если не нашли - выходим
					Если ТипЗнч(Сдвиг)<>Тип("Число") Тогда 
						Прервать;
					КонецЕсли;					 
					//Если нашли - вносим данные в таблицу
					НомерСтроки=НомерСтроки+Сдвиг-1;
					ТЗРез.Добавить(Новый Структура("Полное_описание_русский,поставщик,Артикул,ЦенаПрайс,Остаток,Срок,ПоставщикПрайс",
					СтрЗаменить(СокрЛП(Лист.Cells(НомерСтроки,СтрТаб.Наименование).Value), Символы.НПП, ""),
					СтрЗаменить(СокрЛП(Лист.Cells(НомерСтроки, СтрТаб.Производитель).Value), Символы.НПП, ""),
					СтрЗаменить(СокрЛП(Лист.Cells(НомерСтроки, СтрТаб.Артикул).Value), Символы.НПП, ""),
					СтрЗаменить(СокрЛП(Лист.Cells(НомерСтроки, СтрТаб.Цена).Value), Символы.НПП, ""),
					СтрЗаменить(СокрЛП(Лист.Cells(НомерСтроки, СтрТаб.Остаток).Value), Символы.НПП, ""),
					СтрТаб.Время,СтрТаб.Поставщик));
					НомерСтроки=НомерСтроки+1;
					Если НомерСтроки>ВсегоСтрок Тогда Прервать;КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			Книга.Close();
		Исключение
			Сообщить("Ошибки при разборе данных прайс-листа:"+Символы.ПС+"Файл: "+СтрТаб.ПутьКфайлу+" лист: "+СтрТаб.Лист+символы.ПС+"Возможно ошибки в настройках или данных.");
			Попытка Книга.Close();Исключение;КонецПопытки;
		КонецПопытки;
	КонецЦикла;
	Эксель=Неопределено;
	ПоискПрайсНаСервере(ТЗРез, АртОриг);
КонецПроцедуры

//- 20.02.2019
&НаСервере
Функция ПолучитьРасширениеФайлаНаСервере(ПутьКФайлу)
	Обработка=РеквизитФормыВЗначение("Объект");	
	Возврат Обработка.ПолучитьРасширениеФайла(ПутьКФайлу);
КонецФункции
	
&НаКлиенте
Процедура ПоискПрайсНаКлиенте_3(Артикул, АртОриг)
	
	НастройкаЗагрузки = ПолучитьНастройкиЗагрузки();
	Если НастройкаЗагрузки.Количество()=0 Тогда
		Сообщить("Отсутствуют данные - выполните настройку Прайс листов");
	КонецЕсли;
	
	//артПоиск = ?(НЕ ВРЕГ(СокрЛП(АртОриг)) = ВРЕГ(СОКРЛП(Артикул)), Артикул, АртОриг);	
	артПоиск = ВРЕГ(АртОриг);
	Если ПоНаименованию<>1 и Объект.ПоискПоПрайсуОчиститьАртикул Тогда
		артПоиск = ПодготовитьНомер(артПоиск); 
	КонецЕсли;
	Состояние("Производится поиск товара "+?(ПоНаименованию=0,"артикул","наименование")+" которого содержат "
	+?(ПоЧасти,"текст ","фразу """)+ АртОриг+"""");
	ТЗРез = Новый Массив;
		
	Для Каждого СтрТаб из НастройкаЗагрузки Цикл
		
		РасширениеФайла = ПолучитьРасширениеФайлаНаСервере(СокрЛП(СтрТаб.ПутьКФайлу));
		
		ЕстьЭксель = Истина;
		Попытка
			Эксель = Новый COMОбъект("Excel.Application"); 
			Эксель.Displayalerts = 0;
		Исключение
			ЕстьЭксель = Ложь;
		КонецПопытки;
		
		Если (РасширениеФайла = "csv") И (НЕ ЕстьЭксель) Тогда
			ЗагрузитьCSV(СтрТаб, СтрТаб.ПутьКФайлу, ТЗРез, артПоиск);
		Иначе
			СистемнаяИнформация = Новый СистемнаяИнформация;
			Если (СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86) 
				или (СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64) Тогда
				
				Если Не ЕстьЭксель Тогда
					Сообщить("Ошибка при попытке работы с Mirosoft Excel, возможно он не установлен"+Символы.ПС+ОписаниеОшибки());
					Возврат;
				КонецЕсли;
				
				Попытка	
					Книга = Эксель.WorkBooks.Open(СокрЛП(СтрТаб.ПутьКФайлу),0,Истина);
					Если СтрТаб.Лист<>"" Тогда
						Лист = Книга.Worksheets(СтрТаб.Лист)
					Иначе
						Лист = Книга.Worksheets(1);
					КонецЕсли;
					
					Лист.Activate();
					ВсегоСтрок = Лист.Cells(1,1).SpecialCells(11).Row; 
					//ИмяКолонки = Символ(64+СтрТаб.Артикул);
					//КонОбл = ":"+ИмяКолонки+Формат(ВсегоСтрок, "ЧГ=0");
					Если ПоНаименованию=1 Тогда
						Если ТипЗнч(СтрТаб.Наименование) = Тип("Строка") ТОгда
							Поз = Найти(СтрТаб.Наименование,":");
							Если Поз = 0 Тогда
								ИмяКолонки = Символ(64+Число(СтрТаб.Наименование));
							Иначе
								ИмяКолонки = Символ(64+Число(Лев(СтрТаб.Наименование,Поз-1)))
								+":"+Символ(64+Число(Сред(СтрТаб.Наименование,Поз+1)));
							КонецЕсли;
 						Иначе
							ИмяКолонки = Символ(64+СтрТаб.Наименование);
						КонецЕсли;
					Иначе
						Если ТипЗнч(СтрТаб.Артикул) <> Тип("Строка") Тогда
							ИмяКолонки = Символ(64+СтрТаб.Артикул);
						Иначе
							Поз = Найти(СтрТаб.Артикул,":");
							Если Поз = 0 Тогда
								ИмяКолонки = Символ(64+Число(СтрТаб.Артикул));
							Иначе
								ИмяКолонки = Символ(64+Число(Лев(СтрТаб.Артикул,Поз-1)))+":"+Символ(64+Число(Сред(СтрТаб.Артикул,Поз+1)))
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;

					Диапазон = Лист.Columns(ИмяКолонки);
					//Диапазон = Книга.Worksheets(к).UsedRange;					
					Попытка
												
						Найдено = Диапазон.Find(артПоиск);
						
						Если Найдено<>Неопределено Тогда
							мИстина = -1;
						Иначе
							мИстина = 0;
						КонецЕсли;
					Исключение
						мИстина = 0;
					КонецПопытки;	
					
					Если мИстина = -1 Тогда
						АдресПреж = Найдено.Address;
						Пока мИстина = -1 Цикл
							Разбирать=Истина;
							Если ПредставитьВВидеЧисла(СтрТаб.Наименование) <> 0 Тогда
								ПрайсНаименование = СтрЗаменить(СокрЛП(Лист.Cells(Найдено.Row, ПредставитьВВидеЧисла(СтрТаб.Наименование)).Value), Символы.НПП, "");
								Если ПоНаименованию>0 И Не ПоЧасти Тогда
									Разбирать=Найти(" "+ВРЕГ(ПрайсНаименование)+" "," "+артПоиск+" ")>0;
								КонецЕсли;
							Иначе
								ПрайсНаименование = "";
							КонецЕсли;
							Если ПредставитьВВидеЧисла(СтрТаб.Артикул) <> 0 Тогда
								ПрайсАртикул = СтрЗаменить(СокрЛП(Лист.Cells(Найдено.Row, ПредставитьВВидеЧисла(СтрТаб.Артикул)).Value), Символы.НПП, "");
								Если Не ПоНаименованию И Не ПоЧасти Тогда
									Разбирать=Найти(" "+ВРЕГ(ПрайсАртикул)+" "," "+артПоиск+" ")>0;
								КонецЕсли;
							Иначе
								ПрайсАртикул = "";
							КонецЕсли;
							Если Разбирать Тогда
								Если ПредставитьВВидеЧисла(СтрТаб.Производитель) <> 0 Тогда
									ПрайсПроизводитель = СтрЗаменить(СокрЛП(Лист.Cells(Найдено.Row, ПредставитьВВидеЧисла(СтрТаб.Производитель)).Value), Символы.НПП, "");
								Иначе
									ПрайсПроизводитель = "Отсутствует";
								КонецЕсли;
								Если ПредставитьВВидеЧисла(СтрТаб.Цена) <> 0 Тогда
									ПрайсЦена = СтрЗаменить(СокрЛП(Лист.Cells(Найдено.Row, ПредставитьВВидеЧисла(СтрТаб.Цена)).Value), Символы.НПП, "");
								Иначе
									ПрайсЦена = "0";
								КонецЕсли;
								Если ПредставитьВВидеЧисла(СтрТаб.Остаток) <> 0 Тогда
									ПрайсОстаток = ПодготовитьНомер(СокрЛП(Лист.Cells(Найдено.Row, ПредставитьВВидеЧисла(СтрТаб.Остаток)).Value));
								Иначе
									ПрайсОстаток = "0";
								КонецЕсли;
								Если ПредставитьВВидеЧисла(СтрТаб.Время) <> 0 Тогда
									ПрайсВремя = СтрЗаменить(СокрЛП(Лист.Cells(Найдено.Row, ПредставитьВВидеЧисла(СтрТаб.Время)).Value), Символы.НПП, "");
								Иначе
									ПрайсВремя = "";
								КонецЕсли;
								
								ТЗРез.Добавить(Новый Структура("Полное_описание_русский, Поставщик, Артикул, ЦенаПрайс, Остаток, Срок, ПоставщикПрайс",
								ПрайсНаименование, ПрайсПроизводитель, ПрайсАртикул, ПрайсЦена, ПрайсОстаток, ПрайсВремя, СтрТаб.Поставщик));							
							КонецЕсли;
							
							Попытка
								Найдено = Диапазон.FindNext(Найдено);
								Если Найдено<>Неопределено Тогда 
									мИстина = -1;
								Иначе
									мИстина = 0;
								КонецЕсли;
							Исключение
								мИстина = 0;
							КонецПопытки;	
							
							мИстина = ?((мИстина = -1) И (НЕ Найдено.Address = АдресПреж), -1, 0);
						КонецЦикла;	
					КонецЕсли;	
					
					Книга.Close();
				Исключение
					Сообщить("Ошибки при разборе данных прайс-листа:"+Символы.ПС+"Файл: "+СтрТаб.ПутьКфайлу+" лист: "+СтрТаб.Лист+символы.ПС+"Возможно ошибки в настройках или данных.");
					Попытка Книга.Close();Исключение;КонецПопытки;
				КонецПопытки;
			Иначе //читаем средствами xml
				//нужно установить пакет gnumeric
				//apt-get install gnumeric
				//скопировать скрипт convert.sh в каталог программы
				//конвертируем в csv
				#Если НЕ ВебКлиент Тогда
					ПутьКНовомуФайлу = "";
					ПозицияПоследнейТочки = Найти(СтрТаб.ПутьКФайлу, ".");
					ПутьКНовомуФайлу = Лев(СтрТаб.ПутьКФайлу,ПозицияПоследнейТочки)+"csv"; 
					Если ЗначениеЗаполнено(ПутьКНовомуФайлу) Тогда
						ЗапуститьПриложение("/bin/bash "+КаталогПрограммы()+"convert.sh "+СтрТаб.ПутьКФайлу+" "+ПутьКНовомуФайлу,,Истина);
						ЗагрузитьCSV(СтрТаб, ПутьКНовомуФайлу, ТЗРез, артПоиск);
					КонецЕсли;
				#КонецЕсли
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Эксель = Неопределено;
	ПоискПрайсНаСервере(ТЗРез, АртОриг);
	Состояние();
	
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьCSV(СтрТаб, ПутьКФайлу, ТЗРез, артПоиск)
	// Чтение файла
	Если Не ПоЧасти Тогда артПоиск=" "+артПоиск+" ";КонецЕсли;
	ЗагружаемыйФайл = Новый ТекстовыйДокумент;
	ЗагружаемыйФайл.Прочитать(СокрЛП(ПутьКФайлу));
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если (СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86) 
		или (СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64) Тогда
		Разделитель = ";";
	Иначе
		Разделитель = ",";
	КонецЕсли;
	
	КоличествоСтрок = ЗагружаемыйФайл.КоличествоСтрок();
	Для Строка = 1 По КоличествоСтрок Цикл
		ОбработкаПрерыванияПользователя();
		
		Если ПустаяСтрока(ЗагружаемыйФайл.ПолучитьСтроку(Строка)) Тогда
			Продолжить;
		КонецЕсли;
		
		// Чтение строки из файла тхт / csv
		СтрокаИзФайла = ЗагружаемыйФайл.ПолучитьСтроку(Строка);
		// Разбор строки в массив, используя в качествен символа-разделителя "|"
		МассивСтрок = РазложитьСтрокуВМассивПодстрок2(СтрокаИзФайла, Разделитель);
		
		Попытка
			Если ПоЧасти Тогда
				Если ПоНаименованию=1 Тогда 
					Найдено = Найти(ВРЕГ(МассивСтрок[ПредставитьВВидеЧисла(СтрТаб.Наименование)-1]),артПоиск)>0;
				Иначе 
					Найдено = Найти(ВРЕГ(МассивСтрок[ПредставитьВВидеЧисла(СтрТаб.Артикул)-1]), артПоиск) > 0;
				КонецЕсли;
			Иначе
				Если ПоНаименованию=1 Тогда 
					Найдено = Найти(" "+ВРЕГ(МассивСтрок[ПредставитьВВидеЧисла(СтрТаб.Наименование)-1])+" ",артПоиск)>0;
				Иначе 
					Найдено = Найти(" "+ВРЕГ(МассивСтрок[ПредставитьВВидеЧисла(СтрТаб.Артикул)-1])+" ", артПоиск) > 0;
				КонецЕсли;
			КонецЕсли;
			Если Найдено Тогда
				Если ПредставитьВВидеЧисла(СтрТаб.Наименование) <> 0 Тогда
					ПрайсНаименование = СтрЗаменить(СокрЛП(МассивСтрок[ПредставитьВВидеЧисла(СтрТаб.Наименование)-1]), Символы.НПП, "");
				Иначе
					ПрайсНаименование = "";
				КонецЕсли;
				Если ПредставитьВВидеЧисла(СтрТаб.Производитель) <> 0 Тогда
					ПрайсПроизводитель = СтрЗаменить(СокрЛП(МассивСтрок[ПредставитьВВидеЧисла(СтрТаб.Производитель)-1]), Символы.НПП, "");
				Иначе
					ПрайсПроизводитель = "Отсутствует";
				КонецЕсли;
				Если ПредставитьВВидеЧисла(СтрТаб.Артикул) <> 0 Тогда
					ПрайсАртикул = СтрЗаменить(СокрЛП(МассивСтрок[ПредставитьВВидеЧисла(СтрТаб.Артикул)-1]), Символы.НПП, "");
				Иначе
					ПрайсАртикул = "";
				КонецЕсли;
				Если ПредставитьВВидеЧисла(СтрТаб.Цена) <> 0 Тогда
					ПрайсЦена = СтрЗаменить(СокрЛП(МассивСтрок[ПредставитьВВидеЧисла(СтрТаб.Цена)-1]), Символы.НПП, "");
				Иначе
					ПрайсЦена = "";
				КонецЕсли;
				Если ПредставитьВВидеЧисла(СтрТаб.Остаток) <> 0 Тогда
					ПрайсОстаток = ПодготовитьНомер(СокрЛП(МассивСтрок[ПредставитьВВидеЧисла(СтрТаб.Остаток)-1]));
				Иначе
					ПрайсОстаток = "";
				КонецЕсли;
				Если ПредставитьВВидеЧисла(СтрТаб.Время) <> 0 Тогда
					ПрайсВремя = СтрЗаменить(СокрЛП(МассивСтрок[ПредставитьВВидеЧисла(СтрТаб.Время)-1]), Символы.НПП, "");
				Иначе
					ПрайсВремя = "";
				КонецЕсли;
						
				ТЗРез.Добавить(Новый Структура("Полное_описание_русский, Поставщик, Артикул, ЦенаПрайс, Остаток, Срок, ПоставщикПрайс",
				ПрайсНаименование,ПрайсПроизводитель,ПрайсАртикул,ПрайсЦена,ПрайсОстаток,ПрайсВремя,СтрТаб.Поставщик));					
			КонецЕсли;	
		Исключение
		КонецПопытки;
		
		// Отобразить информацию о ходе выполнения обработки
		Состояние("Обработка строк файла : строка " + Строка + " из " + КоличествоСтрок, Цел((Строка/КоличествоСтрок)*100),,);
	КонецЦикла;
	Состояние();
	//Возврат ТЗРез;
КонецПроцедуры

&НаКлиенте
Функция РазложитьСтрокуВМассивПодстрок2(Знач Строка, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено, СокращатьНепечатаемыеСимволы = Ложь) Экспорт
	
	Рез = Новый Массив;
	
	// Для обеспечения обратной совместимости.
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
		Если ПустаяСтрока(Строка) Тогда 
			Если Разделитель = " " Тогда
				Рез.Добавить("");
			КонецЕсли;
			Возврат Рез;
		КонецЕсли;
	КонецЕсли;
	
	Позиция = Найти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Строка, Позиция - 1);
		Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
			Если СокращатьНепечатаемыеСимволы Тогда
				Рез.Добавить(СокрЛП(Подстрока));
			Иначе
				Рез.Добавить(Подстрока);
			КонецЕсли;
		КонецЕсли;
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(Строка, Разделитель);
	КонецЦикла;
	
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
		Если СокращатьНепечатаемыеСимволы Тогда
			Рез.Добавить(СокрЛП(Строка));
		Иначе
			Рез.Добавить(Строка);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Рез;
КонецФункции 

&НаКлиенте
Функция ПредставитьВВидеЧисла(Значение)
	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		//ЗначениеЧисло = Символ(64+Значение);
		ЗначениеЧисло = Значение;
	Иначе
		Поз = Найти(Значение,":");
		Если Поз = 0 Тогда
			//ЗначениеЧисло = Символ(64+Число(Значение));
			ЗначениеЧисло = Число(Значение);
		Иначе
			//ЗначениеЧисло = Символ(64+Число(Лев(Значение,Поз-1)));
			ЗначениеЧисло = Число(Лев(Значение,Поз-1));
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеЧисло;
КонецФункции

&НаСервере
Процедура ПоискПрайсНаСервере(ТЗРез, АртОриг)
	
	КЧ = Новый КвалификаторыЧисла(10,2);
	КС = Новый КвалификаторыСтроки(500);
	ТипЧ = Новый ОписаниеТипов("Число", КЧ);
	ТипС = Новый ОписаниеТипов("Строка", КС);
	ТипЧС = Новый ОписаниеТипов(ТипЧ,"Строка");
	Если Метаданные.Справочники.Найти("Контрагенты") <> Неопределено Тогда
		ТипСпр = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	Иначе
		ТипСпр = Неопределено;
	КонецЕсли;
	
	//Результирующая таблица
	ТЗПрайс = Новый ТаблицаЗначений();	
	ТЗПрайс.Колонки.Добавить("Полное_название_группы", ТипС);
	ТЗПрайс.Колонки.Добавить("Место_установки", ТипС);
	ТЗПрайс.Колонки.Добавить("Входит_в", ТипС);
	ТЗПрайс.Колонки.Добавить("поставщик", ТипС);
	ТЗПрайс.Колонки.Добавить("Артикул", ТипС);
	ТЗПрайс.Колонки.Добавить("ПоставщикЗапчасти", ТипЧ);
	ТЗПрайс.Колонки.Добавить("ART_ID", ТипЧ);
	ТЗПрайс.Колонки.Добавить("МОДЕЛЬ", ТипС);
	ТЗПрайс.Колонки.Добавить("Полное_описание_русский", ТипС);
	ТЗПрайс.Колонки.Добавить("ТипНомера", ТипС);
	ТЗПрайс.Колонки.Добавить("тип", ТипС);
	ТЗПрайс.Колонки.Добавить("номер", ТипС);
	ТЗПрайс.Колонки.Добавить("ПоставщикПрайс", ТипСпр);
	ТЗПрайс.Колонки.Добавить("Остаток", ТипС);
	ТЗПрайс.Колонки.Добавить("ЦенаПрайс", ТипЧ);
	ТЗПрайс.Колонки.Добавить("Срок", ТипЧС);
	ТЗПрайс.Колонки.Добавить("НашАрт", ТипЧ);
	ТЗПрайс.Колонки.Добавить("Источник",ТипЧ);
	ТЗПрайс.Колонки.Добавить("Номенклатура");
	Для Каждого Стр Из ТЗРез Цикл
		Нов=ТЗПрайс.Добавить();
		ЗаполнитьЗначенияСвойств(Нов,Стр);
		Если ТипЗнч(Нов.Срок)=Тип("Строка") и Не ПустаяСтрока(Нов.Срок) Тогда
			Попытка
				Нов.Срок=Число(Нов.Срок);
			Исключение
			Конецпопытки;
		КонецЕсли;
	КонецЦикла;
	Обработка=РеквизитФормыВЗначение("Объект");
	ТЗПрайс.Сортировать("поставщик");
	ТекПроизводитель="";
	ТекИсточник=0;
	
	Если Объект.ЕстьНоменклатура Тогда
		ТекНоменклатура=Справочники.Номенклатура.ПустаяСсылка();
		Если Объект.ПоискПоОчищенному И Объект.ОчищеннаяТаблица.Количество() = 0 Тогда 		
			Таб = Обработка.ПолучитьТаблицуНоменклатуры();
			Для Каждого Эл Из Таб Цикл
				Стр = Объект.ОчищеннаяТаблица.Добавить();
				Стр.Артикул = ПодготовитьНомер(Эл.Артикул);
				Стр.Производитель= ПодготовитьНомер(Эл.Производитель);
			    Стр.Номенклатура = Эл.Ссылка;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Для каждого Стр Из ТЗПрайс Цикл
		Если Объект.ЕстьНоменклатура Тогда
			Если Стр.поставщик<>ТекПроизводитель Тогда
				ТекПроизводитель=Стр.поставщик;
				Рез=Обработка.ПолучитьНоменклатуруТовара(Новый Структура("Артикул,Производитель",АртОриг,ТекПроизводитель),Ложь);
				Если Рез=Неопределено Тогда
					ТекИсточник=0;
					ТекНоменклатура=Справочники.Номенклатура.ПустаяСсылка();
				Иначе
					ТекИсточник=1;
					ТекНоменклатура=Рез;
				КонецЕсли;
			КонецЕсли;
			Стр.Номенклатура=ТекНоменклатура;
			Стр.Источник=ТекИсточник;
		//Иначе
		//	Стр.Источник=ТекИсточник;
		КонецЕсли;
	КонецЦикла;
	РезультатПоискаПрайс.Загрузить(ТЗПрайс);
	КолСтр=Обработка.ВыводРезультатаПоискаПрайс(ТЗПрайс,РезультатПрайс);
	Элементы.СтраницаПоискПоПрайсу.Заголовок="по Прайс-листам ("+Строка(КолСтр)+")";
КонецПроцедуры

&НаСервере
Функция ПолучитьНоменклатуруТовараНаСервере(Запись,Создать=Истина);
	Обработка=РеквизитФормыВЗначение("Объект");
	Возврат Обработка.ПолучитьНоменклатуруТовара(Запись,Создать);
КонецФункции

&НаСервере
Процедура ЗаписатьгруппуНоменклатуры(Группа,Номенклатура)
	Об = Номенклатура.ПолучитьОбъект();
	Об.Родитель = Группа;
	Об.Записать();
КонецПроцедуры
	
&НаКлиенте
Процедура ВходВгруппуПрайс(Результат,Отбор) Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда
		ЗаписатьгруппуНоменклатуры(Результат,Отбор.Номенклатура);
	КонецЕсли;
	Номенклатура = Отбор.Номенклатура;
	Расшифровка = Отбор.Расшифровка;
	ПроверкаОтбор = Новый Структура("Номенклатура, Поставщик, Склад", Номенклатура, Расшифровка.Поставщик, Объект.ФильтрСкладПрайс);
	ПроверкаСуществования = Объект.ЗаявкаПоставщику.НайтиСтроки(ПроверкаОтбор);
	Остаток=Число(Расшифровка.Остаток)-?(ПроверкаСуществования.Количество()=0,0,ПроверкаСуществования[0].Количество);
	Если Остаток<=0 И Объект.КонтрольОстатков Тогда
		ТекстОшибки="Для оформления заказа с нулевыми остатками требуется в настройках убрать признак контроля остатков";
		Попытка
			ПоказатьПредупреждение(,ТекстОшибки);
		Исключение
			Сообщить(ТекстОшибки);
		Конецпопытки;
		Возврат;
	КонецЕсли;
	Если Объект.ЗапрашиватьКоличество ИЛИ Объект.ЗапрашиватьЦену ИЛИ Объект.ЗапрашиватьСкидку Тогда
		ПередачаПараметров = Новый Структура(
		"Номенклатура,Производитель,Склад,Остаток,ЦенаПоУмолчанию,КонтрольОстатков,ЗапрашиватьКолво,ЗапрашиватьЦену,ЗапрашиватьСкидку",
		Номенклатура,Расшифровка.Поставщик,Объект.ФильтрСкладПрайс,Остаток,Расшифровка.Цена,Объект.КонтрольОстатков,
		Объект.ЗапрашиватьКоличество, Объект.ЗапрашиватьЦену, Объект.ЗапрашиватьСкидку);
		Оповещение=Новый ОписаниеОповещения("ОбработкаРасшифровкиПрайсНаСервере",ЭтаФорма,Расшифровка);
		ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ВыборКоличестваУФ",ПередачаПараметров,ЭтаФорма,Истина,,,Оповещение)
	Иначе
		Данные=Новый Структура("Номенклатура,Производитель,Склад,Количество,Цена,Скидка",
		Номенклатура,Расшифровка.Поставщик,Объект.ФильтрСкладПрайс,1,Расшифровка.Цена,0);
		ОбработкаРасшифровкиПрайсНаСервере(Данные,Расшифровка)
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаРасшифровкиПрайсНаСервере(Данные, Расшифровка) Экспорт
	//Отказ при выборе количества
	Если Данные=Неопределено Тогда Возврат; КонецЕсли;
	
	Данные.Вставить("Поставщик",Расшифровка.Поставщик);
	Данные.Вставить("ЦенаПоставки",Расшифровка.ЦенаПоставщика);
	Данные.Вставить("СрокДоставки",Расшифровка.Срок);
	Данные.Вставить("СрокДоставкиГарантированный",Расшифровка.Срок);
	Данные.Вставить("Производитель",Расшифровка.Производитель);
	Данные.Вставить("Артикул",Расшифровка.Артикул);
	Данные.Вставить("Номенклатура",Расшифровка.Номенклатура);
	Данные.Вставить("Наименование",Расшифровка.Название);
	ДобавитьВЗаявкуНаСервере(Данные,Неопределено);
КонецПроцедуры

#КонецОбласти

#Область ПоискОнлайн
// ***** Поиск онлайн

&НаСервере
Процедура ПоискПроценки()
	
	СтрокаОриг = Объект.НомерАртикула;
	СтрокаПоиска = ПодготовитьНомер(СтрокаОриг);
	Обработка=РеквизитФормыВЗначение("Объект");
	
	Объект.УточнениеПоиска.Очистить();
	КолЕмекс = Обработка.ПоискПроценок(СтрокаОриг,Объект.ЕмексИскатьСЗаменамиИАналогами,Объект.УточнениеПоиска);
    // Обработка.ВыводРезультатаПоискаЕмекс(ТЗЕмекс, Объект.РезультатПоискаОнлайн, , Объект.МетодыСортировки); 
	ЗначениеВДанныеФормы(Обработка.РезультатПоискаОнлайн,Объект.РезультатПоискаОнлайн);
	
	ОнлайнПроценкаЗаполнитьФильтры();
		
	Если Объект.УточнениеПоиска.Количество() <> 0 Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаУточнениеПоиска;
	КонецЕсли;	
	
	Элементы.ПоискЕмекс.Заголовок = "по Поставщикам(" + Объект.РезультатПоискаОнлайн.Количество() + ")";
	Элементы.ГруппаУточнениеПоиска.Заголовок = "Уточнение(" + Объект.УточнениеПоиска.Количество() + ")";	
	
Конецпроцедуры

&НаКлиенте
Процедура ВходВгруппуЕмексДобавить(Результат,НоменклатураСсылка) Экспорт
	
	ВходВгруппуЕмексСерверДобавить(Результат,НоменклатураСсылка);
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта",Новый Структура("Ключ",НоменклатураСсылка),НоменклатураСсылка);	
КонецПроцедуры

&НаКлиенте
Процедура ВходВгруппуЕмекс(Результат,Запись) Экспорт
	
	ВходВгруппуЕмексСервер(Результат,Запись);
	
	НоменклатураСсылка = Запись.Номенклатура;
	ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта",Новый Структура("Ключ",НоменклатураСсылка),НоменклатураСсылка);
	МожноВКорзину=Запись.Наличие;
КонецПроцедуры

&НаСервере
Процедура ВходВгруппуЕмексСервер(Результат,Запись) Экспорт
		
	Если ТипЗнч(Запись) = Тип("СправочникСсылка.Номенклатура") Тогда
	    Спр = Справочники.Номенклатура;
	    СпрСсылка = Спр.НайтиПоНаименованию(СокрЛП(Запись), Истина);
		Если СпрСсылка <> Спр.ПустаяСсылка() Тогда
	        Если ЗначениеЗаполнено(Результат) Тогда
		        Об = СпрСсылка.ПолучитьОбъект();  // Запись.Номенклатура
		        Об.Родитель = Результат;
		        Об.Записать();
	        КонецЕсли;
        КонецЕсли;
	Иначе
		Об = Запись.Номенклатура.ПолучитьОбъект();  // Запись.Номенклатура
		Об.Родитель = Результат;
		Об.Записать();		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВходВгруппуЕмексСерверДобавить(Результат,Запись) Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда
		Об = Запись.ПолучитьОбъект();
		Об.Родитель = Результат;
		Об.Записать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДобавлениеТовараВБазуЕмекс(Запись, ТипНомера = Неопределено) Экспорт
	ЭтоОбъект=РеквизитФормыВЗначение("Объект");
	Номенклатура=ЭтоОбъект.ПолучитьНоменклатуруТовара(Запись, Истина, ТипНомера);
	
	Если Номенклатура<>Неопределено Тогда
		СтрокаВрем = Объект.РезультатПоискаОнлайн.Добавить(); // РезультатПоискаЕмекс.Добавить()
		СтрокаВрем.Группа = Запись.Группа;
		СтрокаВрем.Тип = Запись.Тип;
		СтрокаВрем.Производитель = Запись.Производитель;
		СтрокаВрем.Артикул = Запись.Артикул;
		СтрокаВрем.Наименование = Номенклатура.Наименование;
		СтрокаВрем.Номенклатура = Номенклатура;
		Объект.РезультатПоискаОнлайн.Сортировать("Тип Возр, Производитель Возр, Группа Возр, Артикул Возр, Цена Возр");
		//РезультатПоискаЕмекс.Сортировать("Тип Возр, Производитель Возр, Группа Возр, Артикул Возр, Цена Возр");
	КонецЕсли;	
	Возврат Номенклатура;
		        	
КонецФункции

#КонецОбласти

#Область Корзина

&НаСервере
Функция Корзина_Подбор_ПолучитьВалюту()
	Если Метаданные.Обработки.Найти("ПодборТоваровВДокументПродажи")=Неопределено
		Тогда Возврат Неопределено;
	Иначе
		Возврат Константы.ВалютаРегламентированногоУчета.Получить();
	КонецЕсли;
КонецФункции

&Наклиенте
Функция Корзина_Подбор()
	Перем Валюта,ФрмВр,Эл,Стр;
	Попытка
		Валюта=Корзина_Подбор_ПолучитьВалюту();
		Если Валюта=Неопределено Тогда
			Возврат "Данная конфигурация не поддерживает функцию подбора";
		КонецЕсли;
		Если не ЗначениеЗаполнено(Объект.Соглашение)тогда
			Возврат "Не заполнено соглашение с контрагентом";
		КонецЕсли;
		ФрмВр=ПолучитьФорму("Документ.РеализацияТоваровУслуг.ФормаОбъекта",,Элементы.ЗаявкаНаОформление);
		Для каждого Эл из Объект.ЗаявкаНаОформление Цикл
		     Стр=ФрмВр.Объект.Товары.Добавить();
			 ЗаполнитьЗначенияСвойств(Стр,Эл);
		 КонецЦикла;
		ПараметрЗаголовок = НСтр("ru = 'Подбор товаров в корзину");
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Соглашение", Объект.Соглашение);
		ПараметрыФормы.Вставить("ЦенаВключаетНДС", Истина);
		ПараметрыФормы.Вставить("Склад", Объект.Склад);
		ПараметрыФормы.Вставить("Валюта",Валюта);
		ПараметрыФормы.Вставить("Заголовок", ПараметрЗаголовок);
		ПараметрыФормы.Вставить("Дата", ТекущаяДата());
		ПараметрыФормы.Вставить("РежимПодбораИспользоватьСкладыВТабличнойЧасти", Истина);
		ПараметрыФормы.Вставить("РежимПодбораИсключитьГруппыДоступныеВЗаказах", Истина);
		ПараметрыФормы.Вставить("СкрыватьПодакцизныеТовары", Ложь);
		ПараметрыФормы.Вставить("ОтображатьФлагСкрыватьПодакцизныеТовары", Ложь);
		ПараметрыФормы.Вставить("Документ", ФрмВр.Объект.Ссылка);
		ПараметрыФормы.Вставить("Заголовок", ПараметрЗаголовок);
		Оповещение=Новый ОписаниеОповещения("Корзина_Подбор_УТ11_ЗаявкаНаОформлениеОбработкаВыбора",ЭтаФорма);
		
		ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма",ПараметрыФормы,ЭтаФорма,Истина,,,Оповещение);
	Исключение
		Возврат "Ошибки при вызове подбора номенклатуры. "+Символы.ПС+ОписаниеОшибки();
	КонецПопытки;
	Возврат "";
КонецФункции

&НаСервере
Процедура Корзина_Подбор_УТ11_ЗаполнитьСтрокиДополнительно(Спис)
	Для каждого Эл из Спис Цикл
		ТекСтр=Объект.ЗаявкаНаОформление.НайтиПоИдентификатору(Эл);
		ТекСтр.Наименование=ТекСтр.Номенклатура;
		ТекСтр.Артикул=ТекСтр.Номенклатура.Артикул;
		ТекСтр.СтавкаНДС=ТекСтр.Номенклатура.СтавкаНДС;
		ТекСтр.СуммаСоСкидкой=ТекСтр.Сумма;
		ТекСтр.Всего=ТекСтр.Сумма;
		ТекСтр.СуммаНДС=0;
		Если ТекСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 ИЛИ ТекСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
			ТекСтр.СуммаНДС = Окр(ТекСтр.Сумма*(1-(1/1.10)),2);
		ИначеЕсли ТекСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС18 ИЛИ ТекСтр.СтавкаНДС= Перечисления.СтавкиНДС.НДС18_118 Тогда
			ТекСтр.СуммаНДС = Окр(ТекСтр.Сумма*(1-(1/1.18)),2);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Корзина_Подбор_УТ11_ЗаявкаНаОформлениеОбработкаВыбора(ВыбранноеЗначение,Источник) Экспорт
		ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
		Если ТаблицаТоваров.Количество()>0 Тогда
	    	СписСтрок=Новый Массив; 
			Если Объект.ТекущийЗК<>0 Тогда 
				СменитьЗаявку(0);
				Элементы.ЗаказыКлиентов.ТекущаяСтрока=Объект.ЗаказыКлиентов[0].ПолучитьИдентификатор();
			КонецЕсли;
			Для каждого Эл из ТаблицаТоваров Цикл
				Стр=Объект.ЗаявкаНаОформление.Добавить();
				ЗаполнитьЗначенияСвойств(Стр,Эл);
				СписСтрок.Добавить(Стр.ПолучитьИдентификатор());
			КонецЦикла;
			Корзина_Подбор_УТ11_ЗаполнитьСтрокиДополнительно(СписСтрок);
			СуммаКорзины=Объект.ЗаявкаНаОформление.Итог("Всего");
			ОбновитьЗаголовокКорзины();
		КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеПоЗаказамПоставщикам(Пользователи2=Неопределено)
	Если Пользователи2=Неопределено Тогда
		Пользователь=Объект.ПользовательИмя;
	ИначеЕСли ТипЗнч(Пользователи2)=тип("Строка") Тогда
		Пользователь=Пользователи2;
	Иначе
		Пользователь=Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Если Пользователь<>Неопределено Тогда 
		Строки=Объект.ЗаявкаПоставщику.НайтиСтроки(Новый Структура("Пользователь",Пользователь)); //вс(
		Данные=Объект.ЗаявкаПоставщику.Выгрузить(Строки);
		ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса","ЗаявкаПоставщику",Данные,,Пользователь);//вс)
	Иначе
		Для Каждого КлючЗначение Из Пользователи2 Цикл
			Строки=Объект.ЗаявкаПоставщику.НайтиСтроки(Новый Структура("Пользователь",КлючЗначение.Ключ)); //вс(
			Данные=Объект.ЗаявкаПоставщику.Выгрузить(Строки);
			ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса","ЗаявкаПоставщику",Данные,,КлючЗначение.Ключ);//вс)
		КонецЦикла;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

#КонецОбласти

#КонецОбласти


#Область Разобрать
	
&НаКлиенте
Процедура ФильтрОнлайн(Команда)
		
    ФормаФильтра = ПолучитьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.НастройкиФильтраРезультатовУФ",, ЭтаФорма);
    ФормаФильтра.Открыть();	            

КонецПроцедуры

&НаСервере
Процедура СравнитьВерсииПА()   //Удалить
	Обработка=РеквизитФормыВЗначение("Объект");
	Если Лев(Строка(ТипЗнч(Обработка)),7)="Внешняя" ТОгда
		Объект.ВнешняяОбработка="ВнешняяОбработка";
	Иначе
		Объект.ВнешняяОбработка="Обработка";
	КонецЕсли;
	
	Элементы.ОбновлениеВерсии.Видимость = Обработка.ПолучитьПоследнююВерсиюПА();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВерсииПАнаСервере()
	Обработка=РеквизитФормыВЗначение("Объект");
	Возврат Обработка.ПолучитьВерсииПА();
КонецФункции

&НаКлиенте
Процедура ОтветСтарыйЗапуск(Ответ,Доп) Экспорт
	Если Ответ<>КодВозвратаДиалога.Да Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьОписаниеПоследнейВерсииНаСервере()
	
	Обработка=РеквизитФормыВЗначение("Объект");
	Если Лев(Строка(ТипЗнч(Обработка)),7)="Внешняя" ТОгда
		Объект.ВнешняяОбработка="ВнешняяОбработка";
	Иначе
		Объект.ВнешняяОбработка="Обработка";
	КонецЕсли;
	
	Возврат Обработка.ПолучитьОписаниеПоследнейВерсии();	
	
КонецФункции

&НаКлиенте
Процедура ОбновлениеВерсии(Команда)

    //ПараметрФормыВерсии = Новый Структура("ПараметрыВерсии", ПолучитьОписаниеПоследнейВерсииНаСервере() );

	//Попытка
	//	ОткрытьФормуМодально(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ОписаниеВерсийУФ", ПараметрФормыВерсии, ЭтаФорма); 
	//Исключение
	ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ОписаниеВерсийУФ", , ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно);
	//Конецпопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОбновлениеВерсии() Экспорт
	ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ОписаниеВерсийУФ", , ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно);
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПоискаВыборочныйПоиск(Команда)
	
	//Объект.ВыборочныйПоиск	= Не Объект.ВыборочныйПоиск;
	//ОбновитьПометкиМеню();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПоискаСЗаменамиИАналогами(Команда)
	Объект.ЕмексИскатьСЗаменамиИАналогами = НЕ Объект.ЕмексИскатьСЗаменамиИАналогами;
	ОбновитьПометкиМеню();	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПоискаБезОбработкиРезультатов(Команда)

	Объект.ПоискБезОбработкиРезультатов = НЕ Объект.ПоискБезОбработкиРезультатов;
	ОбновитьПометкиМеню();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПометкиМеню()	
	Цвет0 = Новый Цвет(255,255,255);
	Цвет1 = Новый Цвет(200,255,225);
    ЭтаФорма.Элементы.МенюСЗаменамиИАналогами.Пометка = Объект.ЕмексИскатьСЗаменамиИАналогами;
    ЭтаФорма.Элементы.МенюСЗаменамиИАналогами.ЦветФона = ?(Объект.ЕмексИскатьСЗаменамиИАналогами,Цвет1,Цвет0);
	ЭтаФорма.Элементы.СервисМногострочныйРежим.Пометка = Объект.ОнлайнПоискМногострочныйРежим;
	ЭтаФорма.Элементы.СервисМногострочныйРежим.ЦветФона = ?(Объект.ОнлайнПоискМногострочныйРежим,Цвет1,Цвет0);
	ЭтаФорма.Элементы.СервисРежимКлиента.Пометка = Объект.РежимКлиента;
	ЭтаФорма.Элементы.СервисРежимКлиента.ЦветФона = ?(Объект.РежимКлиента,Цвет1,Цвет0);
	ЭтаФорма.Элементы.УточнениеСервисМногострочныйРежим.Пометка = Объект.ОнлайнПоискУточнениеМногострочныйРежим;
	ЭтаФорма.Элементы.УточнениеСервисМногострочныйРежим.ЦветФона = ?(Объект.ОнлайнПоискУточнениеМногострочныйРежим,Цвет1,Цвет0);
	ЭтаФорма.Элементы.МенюРасчетОстатокНаСкладе.Пометка = Объект.ОнлайнПоискРасчетОстатков;
	ЭтаФорма.Элементы.МенюРасчетОстатокНаСкладе.ЦветФона = ?(Объект.ОнлайнПоискРасчетОстатков,Цвет1,Цвет0);
	ЭтаФорма.Элементы.МенюУточнениеПоиска.Пометка = Объект.ПараметрыПоискаУточнение;
	ЭтаФорма.Элементы.МенюУточнениеПоиска.ЦветФона = ?(Объект.ПараметрыПоискаУточнение,Цвет1,цвет0);
	ЭтаФорма.Элементы.УточнениеОчищатьРезультаты.Пометка = Объект.ОчищатьРезультатыПоиска;
	ЭтаФорма.Элементы.УточнениеОчищатьРезультаты.ЦветФона = ?(Объект.ОчищатьРезультатыПоиска,Цвет1,Цвет0);
	ЭтаФорма.Элементы.МенюОтборПоНаличиюНаСкладеПоставщика.Пометка = ОтборНаличиеУПоставщика;
	ЭтаФорма.Элементы.МенюОтборПоНаличиюНаСкладеПоставщика.ЦветФона= ?(ОтборНаличиеУПоставщика,Цвет1,Цвет0);
	ЭтаФорма.Элементы.МенюОтборСокращеннаяВыдачаРезультата.Пометка = ОтборСокращеннаяВыдача;	
	ЭтаФорма.Элементы.МенюОтборСокращеннаяВыдачаРезультата.ЦветФона = ?(ОтборСокращеннаяВыдача,Цвет1,Цвет0);	
	ЭтаФорма.Элементы.ГруппаУточнениеПоиска.Видимость = ЭтаФорма.Элементы.МенюУточнениеПоиска.Пометка;
	ЭтаФорма.Элементы.МенюОтборОтсечьРезультатыНаСервере.Пометка = Объект.ОтсечьРезультатыНаСервере;	
	ЭтаФорма.Элементы.МенюОтборОтсечьРезультатыНаСервере.ЦветФона = ?(Объект.ОтсечьРезультатыНаСервере,Цвет1,Цвет0);	
	ЭтаФорма.Элементы.МенюОтборПоНаличиюНаСкладеПредприятия.Пометка = ОтборНаличиеНаСкладе; 
	ЭтаФорма.Элементы.МенюОтборПоНаличиюНаСкладеПредприятия.ЦветФона = ?(ОтборНаличиеНаСкладе,Цвет1,Цвет0);	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьУточненныйРезультат(Команда)
	ОбработкаСтрокНаСервере();
    //УровеньЦенЕмексПриИзмененииНаСервере();
	УстановитьОтборФильтр();
	Элементы.Страницы.ТекущаяСтраница=Элементы.ПоискЕмекс;
КонецПроцедуры

&НаСервере
Процедура ОбработкаСтрокНаСервере()	
	Таб = Новый ТаблицаЗначений;				
	Таб.Колонки.Добавить("УточнениеПоставщик");
	Таб.Колонки.Добавить("УточнениеКод");
	Таб.Колонки.Добавить("УточнениеАртикул");
	Таб.Колонки.Добавить("Производитель");
	Таб.Колонки.Добавить("УточнениеНазваниеТовара");
	Таб.Колонки.Добавить("УточнениеКодОрганизации");
	Таб.Колонки.Добавить("УточнениеКодПокупателя");
	
	Для Каждого Стр Из Объект.УточнениеПоиска Цикл				
		Если (Стр.УточнениеПометка) И (НЕ Стр.СтрокиСформированы) Тогда	
			Стр.СтрокиСформированы = Истина;
			Стр.УточнениеПометка = Ложь;
			
			НоваяСтрока = Таб.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр);
			НоваяСтрока.Производитель = Стр.УточнениеПроизводитель;
		КонецЕсли;		
	КонецЦикла;	
		
    Обработка = РеквизитФормыВЗначение("Объект");	
	КолЕмекс = Обработка.ОбработкаТаблицыВыборочногоПоиска(Таб, Объект.ЕмексИскатьСЗаменамиИАналогами);
	ЗначениеВДанныеФормы(Обработка.РезультатПоискаОнлайн,Объект.РезультатПоискаОнлайн);
		
	//Объект.РезультатПоискаОнлайн.Очистить(); // РезультатПоискаЕмекс.Очистить()	   
	//Объект.РезультатПоискаОнлайн.Загрузить(ТЗЕмекс); // РезультатПоискаЕмекс.Загрузить(ТЗЕмекс) 
    //КолЕмекс = Обработка.ВыводРезультатаПоискаЕмекс(ТЗЕмекс, Объект.РезультатПоискаОнлайн, Ложь, Объект.МетодыСортировки); 						
	
	ОнлайнПроценкаЗаполнитьФильтры();
	
	//Если Объект.УточнениеПоиска.Количество() <> 0 Тогда
	//	Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаУточнениеПоиска;
	//КонецЕсли;		
	Элементы.ПоискЕмекс.Заголовок = "по Поставщикам(" + Объект.РезультатПоискаОнлайн.Количество() + ")";
	Элементы.ГруппаУточнениеПоиска.Заголовок = "Уточнение(" + Объект.УточнениеПоиска.Количество() + ")";			
КонецПроцедуры

&НаСервере
Процедура ОнлайнПроценкаЗаполнитьФильтры()
	//Заполним список выбора ФильтрМарка
	Объект.ФильтрМаркаЕмекс="";
	Список=Элементы.ФильтрМаркаЕмекс.СписокВыбора;
	Список.Очистить();
	Если Объект.ОтображатьКолонкуБренд Тогда
		ТабПро=Объект.РезультатПоискаОнлайн.Выгрузить(,"Бренд");
		ТабПро.Свернуть("Бренд");
		ТабПро.Сортировать("Бренд");
		Для Каждого Стр Из ТабПро Цикл
			Список.Добавить(Стр.Бренд,Стр.Бренд);
		КонецЦикла;
	Иначе
		ТабПро=Объект.РезультатПоискаОнлайн.Выгрузить(,"Бренд,Производитель");
		ТабПро.Свернуть("Бренд,Производитель");
		ТабПро.Сортировать("Производитель");
		Для Каждого Стр Из ТабПро Цикл
			Список.Добавить(Стр.Бренд,Стр.Производитель);
		КонецЦикла;
	КонецЕсли;
	//Заполним список выбора ФильтрПоставщик
	ТабПост=Объект.РезультатПоискаОнлайн.Выгрузить(,"Сайт");
	ТабПост.Свернуть("Сайт");
	ТабПост.Сортировать("Сайт");
	Если ТабПост.Количество() >0 Тогда
		НулеваяСтрока = ТабПост.Получить(0);
		Если НулеваяСтрока.Сайт = "" Тогда
			ТабПост.Удалить(НулеваяСтрока);
		КонецЕсли;
	КонецЕсли;
	СписокВыбора=Элементы.ФильтрПоставщикЕмекс.СписокВыбора;
	СписокВыбора.Очистить();
	Для Каждого Стр Из ТабПост Цикл
		СписокВыбора.Добавить(Стр.Сайт,Стр.Сайт);
	КонецЦикла;
	//Элементы.ФильтрПоставщикЕмекс.СписокВыбора.ЗагрузитьЗначения(ТабПост.ВыгрузитьКолонку("Сайт"));			
КонецПроцедуры

&НаКлиенте
Процедура УточнениеПоискаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
//	СформироватьШагУточнения(Поле.Имя, Элементы.УточнениеПоиска.ТекущиеДанные);
	
КонецПроцедуры

&НаСервере
Процедура ВыделитьВсеНаСервере(ПометкаЗначение)
	
	Для Каждого Стр Из Объект.УточнениеПоиска Цикл
		Стр.УточнениеПометка = ПометкаЗначение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсе(Команда)
	
	ВыделитьВсеНаСервере(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыделение(Команда)
	
	ВыделитьВсеНаСервере(Ложь);
	
КонецПроцедуры

&НаСервере
Функция ОпределениеНоменклатурыПоиска(СтруктураПоиска)
	
	ЭтоОбъект=РеквизитФормыВЗначение("Объект");			
	Номенклатура = ЭтоОбъект.ПолучитьНоменклатуруТовара(СтруктураПоиска, Истина,);
	
	Возврат Номенклатура;
КонецФункции                       

&НаКлиенте
Процедура ОтборВКорзинуЛокальноНаСервере()

	Попытка
		ТекДанные = Элементы.РезультатПоискаОнлайн.ТекущиеДанные;		
		
		Если Число(ТекДанные.Наличие) <= 0 И Объект.КонтрольОстатков Тогда
			Попытка
				ПоказатьПредупреждение(,"Не хватает товара на складе");
			Исключение
				Сообщить("Не хватает товара на складе");
			КонецПопытки;          			
			Возврат;               
		КонецЕсли;			
		
		БезПроизводителя=Ложь;
		Если ЗначениеЗаполнено(ТекДанные.Номенклатура) Тогда
			ТекНоменклатура = ТекДанные.Номенклатура;
		Иначе
			ТекНоменклатура = ТекДанные.НаименованиеДетали;
			Если Объект.ПоискПоОчищенному и Объект.ОчищеннаяТаблица.Количество() > 0 Тогда
				Масс = Объект.ОчищеннаяТаблица.НайтиСтроки(Новый Структура("Артикул,Производитель",ТекДанные.Артикул,""));
				Если Масс.Количество() > 0 Тогда БезПроизводителя = Истина;КонецЕсли;
			Иначе
				БезПроизводителя = НайтиБезПроизводителя(ТекДанные.Артикул, ТекДанные.КодПроизводителя);
			КонецЕсли;
		КонецЕсли;
		Поставщик=ПоставщикСайта(ТекДанные.Сайт);
		
		Запись2 = Новый Структура(
			"КодТовара, Номенклатура, Наименование, Склад, idСклад, ЦенаПоставки, Сайт, КодПроизводителя, 
			|Производитель, Артикул, Кратность, ДляКорзины, Номенклатура, Наличие, Цена, КодСкидки, СрокДоставки, 
			|СрокДоставкиГарантированный, Наличие, ИсточникИнформации, БезПроизводителя, Поставщик, КодВКорзине, Наличие1С", 
	        ТекДанные.КодТовара, ТекДанные.Номенклатура, ТекНоменклатура, ТекДанные.Склад, 
	        ТекДанные.idСклад, ТекДанные.ЦенаПоставки, ТекДанные.Сайт, ТекДанные.КодПроизводителя,
			ТекДанные.Производитель, ТекДанные.Артикул, ТекДанные.Кратность, ТекДанные.ДляКорзины,
			ТекДанные.Номенклатура, ТекДанные.Наличие, ТекДанные.ЦенаПродажи, ТекДанные.КодСкидки, 
			ТекДанные.СрокДоставки, ТекДанные.СрокДоставкиГарантированный, ТекДанные.Наличие, 
			ТекДанные.ИсточникИнформации, БезПроизводителя, Поставщик, НовыйКодВКорзине(ЭтаФорма.КодПользователя),ТекДанные.Наличие1С);
			
		Если Объект.ЗапрашиватьКоличество или Объект.ЗапрашиватьЦену или Объект.ЗапрашиватьСкидку Тогда
			ПараметрыФормы=Новый Структура("Номенклатура,Производитель,Склад,Остаток,ЦенаПоУмолчанию,КонтрольОстатков,ЗапрашиватьКолво,ЗапрашиватьЦену,ЗапрашиватьСкидку",
			ТекНоменклатура,ТекДанные.Производитель,Объект.ФильтрСкладЕмекс,ТекДанные.Наличие,ТекДанные.ЦенаПродажи,Объект.КонтрольОстатков,Объект.ЗапрашиватьКоличество,Объект.ЗапрашиватьЦену,Объект.ЗапрашиватьСкидку);
			
			Оповещение=Новый ОписаниеОповещения("ДобавитьВЗаявку",ЭтаФорма,Запись2);
			
			ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ВыборКоличестваУФ",ПараметрыФормы,ЭтаФорма,Истина,,,Оповещение);
		Иначе	
			Данные=Новый Структура("Количество,Цена,Скидка,ДляКорзины",1,ТекДанные.ЦенаПродажи,0,ТекДанные.ДляКорзины);
			ДобавитьВЗаявку(Данные,Запись2);
		КонецЕсли;	
			
	Исключение		
		Сообщить(ОписаниеОшибки());		
	КонецПопытки;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиБезПроизводителя(Артикул, КодПроизводителя)
	Метаном = Метаданные.Справочники.Найти("Номенклатура");
	Если Метаном=Неопределено Тогда Возврат Ложь; КонецЕсли;
	метаНом = МетаНом.Реквизиты;
	Имена=Новый Структура("ор_Производитель,асПроизводитель,Производитель,Поставщик,ор_Поставщик");
	Для Каждого Стр Из Имена Цикл
		Если метаНом.Найти(Стр.Ключ)<>Неопределено Тогда
			имяПроизводитель=Стр.Ключ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Имена=Новый Структура("ор_НомерПоКаталогу,НомерПоКаталогу,АртикулПроизводителя,Артикул,АртикулДляПоиска");
	Для Каждого Стр Из Имена Цикл
		Если метаНом.Найти(Стр.Ключ)<>Неопределено Тогда
			имяАртикул=Стр.Ключ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если метаНом.Найти("АртикулДляПоиска")<>Неопределено Тогда
		имяАртикулДляПоиска="АртикулДляПоиска";
	Иначе
		имяАртикулДляПоиска=имяАртикул;
	КонецЕсли;
	Если ПодготовитьНомер(КодПроизводителя)<>Артикул Тогда
		КодПроизводителя=Артикул;
	КонецЕсли;
	
	Запрос=Новый Запрос(
	   "ВЫБРАТЬ ПЕРВЫЕ 1
	 |	Номенклатура.Ссылка КАК Ссылка
	 |ИЗ
	 |	Справочник.Номенклатура КАК Номенклатура
	 |ГДЕ
	 |	(Номенклатура."+имяАртикулДляПоиска+" = """+Артикул+"""
	 |			ИЛИ Номенклатура."+имяАртикул+" = """+КодПроизводителя+""")
	 |	И Номенклатура."+имяПроизводитель+" = &Производитель"
	);
	Запрос.УстановитьПараметр("Производитель",Справочники.Номенклатура.ПустаяСсылка()[имяПроизводитель]);
	Вып=Запрос.Выполнить();
	Возврат Не Вып.Пустой();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПоставщикСайта(Сайт)
	Проценки = ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","Проценки",,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
	Если Проценки<>Неопределено ТОгда
		Стр=Проценки.Найти(Сайт,"Сайт");
		Если Стр<>Неопределено Тогда Возврат Стр.Поставщик;КонецЕсли;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

&НаСервереБезКонтекста
Функция НовыйКодВКорзине(КодПользователя)
	//УстановитьПривилегированныйРежим(Истина);
	//ОбщиеСвойства=ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнесаОбщий","ОбщиеСвойства",,"Администратор");
	//Если ОбщиеСвойства = Неопределено Тогда ОбщиеСвойства=Новый Структура("КодВКорзине", 1); КонецЕсли;
	//КодВКорзине=ОбщиеСвойства.КодВКорзине;
	//ОбщиеСвойства.КодВКорзине=КодВКорзине+1;
	//ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнесаОбщий","ОбщиеСвойства",ОбщиеСвойства,,"Администратор");
	//УстановитьПривилегированныйРежим(Ложь);
	//Возврат Строка(Новый УникальныйИдентификатор); //КодВКорзине;
	Возврат Формат(ТекущаяУниверсальнаяДата(),"ДФ=""ггММдд-ЧЧммсс""")+"-"+Формат(КодПользователя,"ЧЦ=6;ЧВН=;ЧГ=")
	+"-"+Прав(Новый УникальныйИдентификатор,15);
КонецФункции

&НаСервере
Функция ОткрытьФормуНоменклатуры(Артикул, НаименованиеДетали, Производитель)
	    		
	    СтруктураПоиска = Новый Структура("Артикул,Наименование,Производитель", Артикул, НаименованиеДетали, Производитель);				
     	ЭтоОбъект = РеквизитФормыВЗначение("Объект");			
		
		НоменклатураСсылка = Неопределено;
	    НоменклатураСсылка = ЭтоОбъект.ПолучитьНоменклатуруТовара(СтруктураПоиска, Истина,);				
				
		Возврат НоменклатураСсылка;
КонецФункции
	
&НаКлиенте
Процедура РезультатПоискаОнлайнВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы.РезультатПоискаОнлайн.ТекущиеДанные;
	
	Если Поле.Имя = "РезультатПоискаОнлайнКорзина" Тогда
		Если ИзменятьКорзину Тогда     
			Попытка
				ОтборВКорзинуЛокальноНаСервере();
			Исключение
			КонецПопытки;
		Иначе
			Сообщить("Корзина в режиме просмотра - переключите ее в режим изменения");
		КонецЕсли;
	Иначе
		Если ТекДанные.Номенклатура <> Неопределено Тогда
			Если Объект.ЕстьНоменклатура И ЗначениеЗаполнено(ТекДанные.Номенклатура) Тогда
				Ключ = Новый Структура("Ключ", ТекДанные.Номенклатура);			
				Форма = ПолучитьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", Ключ);    			
				Форма.Открыть();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РасчетОстатковНоменклатура(НоменклатураСсылка)     //Не Используется
	
	ЭтоОбъект = РеквизитФормыВЗначение("Объект");
	ТекущиеОстатки = ЭтоОбъект.ПА_ПолучитьСвободныйОстаток(НоменклатураСсылка, Справочники.Склады.ПустаяСсылка());
	НайденаКолонка = "";
	Если ТекущиеОстатки.Колонки.Найти("КоличествоОстаток") <> Неопределено Тогда
		НайденаКолонка = "КоличествоОстаток";
	КонецЕсли;
	Если ТекущиеОстатки.Колонки.Найти("ВНаличии") <> Неопределено Тогда
		НайденаКолонка = "ВНаличии";
	КонецЕсли;
	
	Для Каждого Строка Из ТекущиеОстатки Цикл
		Если НайденаКолонка = "КоличествоОстаток" Тогда
			Кво = Строка.КоличествоОстаток; //ВНаличии;  			
		КонецЕсли;
		Если НайденаКолонка = "ВНаличии" Тогда
			Кво = Строка.ВНаличии; //ВНаличии;  			
		КонецЕсли;
		
			Если Кво = Неопределено или ЗначениеЗаполнено(Кво) = Ложь Тогда
				Кво = 0;
			КонецЕсли;						
	КонецЦикла;  							   
	
	Возврат Кво;
	  
КонецФункции

&НаСервере
Процедура ОстаткиТоваровТестБыл()  //Не Используется
	ЭтоОбъект = РеквизитФормыВЗначение("Объект");
	
	ОтборУсловие = Новый Структура("СтрокаСправочника", 1);	
	Таб = Объект.РезультатПоискаОнлайн.Выгрузить(ОтборУсловие, "Номенклатура"); 	
    Таб.Свернуть("Номенклатура");
	
	Для Каждого Стр Из Таб Цикл			
		
		Остаток = 0;			
		ЦенаПродажиРасчетная = 0;
		
		Остаток = РасчетОстатковНоменклатура(Стр.Номенклатура);
		ЦенаПродажиРасчетная = ЭтоОбъект.ПолучитьЦенуНоменклатуры(Стр.Номенклатура, Объект.ТипЦен);
		    			
		Если (Остаток <> 0) ИЛИ (ЦенаПродажиРасчетная <> 0) Тогда				
			
			Для Каждого Строка Из Объект.РезультатПоискаОнлайн Цикл  													
				Если (Строка.Номенклатура = Стр.Номенклатура) И (Строка.СтрокаСправочника = 1) Тогда						
					
					Если (Остаток <> 0) И (Остаток <> Неопределено) Тогда							
						Строка.Наличие1С = Остаток;
					    Строка.НаличиеНаСкладе = Истина;
					КонецЕсли;
					
					Если ЦенаПродажиРасчетная.Цена <> 0 Тогда   						
						Строка.ЦенаПродажи = ЦенаПродажиРасчетная.Цена;
						//Попытка
						//    Строка.ПроцентПрибыли = Окр( ((Строка.ЦенаПродажи - Строка.Цена)/Строка.Цена * 100), 2);
						//Исключение
						//КонецПопытки						
					КонецЕсли;				
					
					
				КонецЕсли;								
			КонецЦикла; 			
			
		КонецЕсли;
			
						
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьМногострочныйРежим(Команда)
	Объект.ОнлайнПоискМногострочныйРежим = НЕ Объект.ОнлайнПоискМногострочныйРежим;
	
	Элементы.РезультатПоискаОнлайнПроизводитель.МногострочныйРежим      = Объект.ОнлайнПоискМногострочныйРежим;
	Элементы.РезультатПоискаОнлайнАртикул.МногострочныйРежим            = Объект.ОнлайнПоискМногострочныйРежим;
	Элементы.РезультатПоискаОнлайнНаименованиеДетали.МногострочныйРежим = Объект.ОнлайнПоискМногострочныйРежим;
	Элементы.РезультатПоискаОнлайнИсточникИнформации.МногострочныйРежим = Объект.ОнлайнПоискМногострочныйРежим;
	Элементы.РезультатПоискаОнлайнСклад.МногострочныйРежим              = Объект.ОнлайнПоискМногострочныйРежим;
	Элементы.РезультатПоискаОнлайнНаличие1С.МногострочныйРежим = Объект.ОнлайнПоискМногострочныйРежим;
		
	ОбновитьПометкиМеню();	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПоискаТоварыОстатки(Команда)
	
	Объект.ОнлайнПоискРасчетОстатков = НЕ Объект.ОнлайнПоискРасчетОстатков;
	ОбновитьПометкиМеню();
	
КонецПроцедуры

&НаКлиенте
Процедура УточнениеУстановитьМногострочныйРежим(Команда)
	
	Объект.ОнлайнПоискУточнениеМногострочныйРежим = НЕ Объект.ОнлайнПоискУточнениеМногострочныйРежим;
	
	Элементы.УточнениеПоиска1УточнениеПроизводитель.МногострочныйРежим      = Объект.ОнлайнПоискУточнениеМногострочныйРежим;
	Элементы.УточнениеПоиска1УточнениеАртикул.МногострочныйРежим      = Объект.ОнлайнПоискУточнениеМногострочныйРежим;
	Элементы.УточнениеПоиска1УточнениеНазваниеТовара.МногострочныйРежим      = Объект.ОнлайнПоискУточнениеМногострочныйРежим;
	Элементы.УточнениеПоиска1УточнениеПоставщик.МногострочныйРежим      = Объект.ОнлайнПоискУточнениеМногострочныйРежим;
			
	ОбновитьПометкиМеню();	

КонецПроцедуры

&НаСервере
Функция ДобавитьВКарточкуНоменлатурыНаСервере(Артикул, НаименованиеДетали, Производитель)
	СтруктураПоиска = Новый Структура("Артикул,НаименованиеДетали,Производитель", Артикул, НаименованиеДетали, Производитель);
	ЭтоОбъект = РеквизитФормыВЗначение("Объект");			
		                                  		
	НоменклатураСсылка = Неопределено;		
	НоменклатураСсылка = ЭтоОбъект.ПолучитьНоменклатуруТовара(СтруктураПоиска, Истина,);
	
	Возврат НоменклатураСсылка;
КонецФункции

&НаКлиенте
Процедура ДобавитьВКарточкуНоменклатуры(Команда)
	
	ТекДанные = Элементы.РезультатПоискаОнлайн.ТекущиеДанные;
	Если ТекДанные=Неопределено Тогда Возврат;КонецЕсли;
	Если ТекДанные.НаличиеВСправочнике = 0 Тогда
		НоменклатураСсылка = ДобавитьВКарточкуНоменлатурыНаСервере(ТекДанные.Артикул, ТекДанные.НаименованиеДетали, ТекДанные.Производитель);				
		Если НоменклатураСсылка <> Неопределено Тогда 			
			Если Объект.ЗапрашиватьГруппуНоменклатуры Тогда
				ПараметрыФормы = Новый Структура("УникальныйИдентификатор", новый УникальныйИдентификатор);
				Оповещение = Новый ОписаниеОповещения("ВходВгруппу", ЭтаФорма, НоменклатураСсылка);	
				ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы",ПараметрыФормы,,,,,Оповещение);
			Иначе
				ПараметрыФормы=Новый Структура("Ключ",НоменклатураСсылка);
				ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта",ПараметрыФормы);
			КонецЕсли;   
			ТекДанные.Номенклатура = НоменклатураСсылка;
			ТекДанные.НаличиеВСправочнике = 1;

			//Ключ = Новый Структура("Ключ", НоменклатураСсылка);			
			//Форма = ПолучитьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", Ключ);    			
			//Форма.Открыть();			
	    КонецЕсли;
	Иначе
		Сообщить("Данный товар уже есть в справочнике номенклатуры");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПоискаУточнение(Команда)
	Объект.ПараметрыПоискаУточнение = НЕ Объект.ПараметрыПоискаУточнение;
	Элементы.ГруппаУточнениеПоиска.Видимость = Объект.ПараметрыПоискаУточнение;
	ОбновитьПометкиМеню();	
КонецПроцедуры

&НаКлиенте
Процедура ПоВсемСкладам(Команда)
	Если Объект.ПроценитьПоВсемСкладам Тогда
		Объект.ПроценитьПоВсемСкладам=Ложь;
		Элементы.ПоВсемСкладам.ЦветФона=Новый Цвет(255,255,255);
	Иначе
		Объект.ПроценитьПоВсемСкладам=Истина;
		Элементы.ПоВсемСкладам.ЦветФона=Новый Цвет(200,255,225);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСтрокиКорзинаОтвет(Ответ,Доп) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
        Объект.ЗаявкаНаОформление.Очистить();
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ОчиститьСтрокиКорзина(Команда)
	ОО=Новый ОписаниеОповещения("ОчиститьСтрокиКорзинаОтвет",ЭтаФорма);
	ПоказатьВопрос(ОО,"Очистить все строки корзины заказов?",
	РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Да, "Корзина заказов");
КонецПроцедуры

&НаКлиенте
Процедура ОчищатьРезультатыПоиска(Команда)
	
	Объект.ОчищатьРезультатыПоиска = НЕ Объект.ОчищатьРезультатыПоиска;
	ОбновитьПометкиМеню();	

КонецПроцедуры

&НаКлиенте
Процедура КакРаботатьСВыдачейРезультатовНажатие(Команда) 
	ЗапуститьПриложение("https://youtu.be/l6AKe_aXRhA?utm_source=fromPA&utm_medium=cpc&utm_campaign=poisk_po_procenkam");
КонецПроцедуры

&НаКлиенте
Процедура КакПодключитьПоставщика(Команда) 
	ЗапуститьПриложение("http://youtu.be/eScVn0QK-uM");
КонецПроцедуры

&НаКлиенте
Процедура КакРаботатьСУточнениеПоиск(Команда) 
	ЗапуститьПриложение("http://youtu.be/LE4ZSipeJDs");
КонецПроцедуры

&НаКлиенте
Процедура КакИскатьПоVINНажатие(Команда)
	ЗапуститьПриложение("https://youtu.be/2uEcbbvyORA?utm_source=fromPA&utm_medium=cpc&utm_campaign=poisk_po_vin");
КонецПроцедуры

&НаКлиенте
Процедура КакСоздатьЧекККМНажатие(Команда)
	ЗапуститьПриложение("http://youtu.be/wuHoO90fqwg");
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если Элемент.ТекущаяСтраница.Имя = "Стр3" Тогда
		ПоискПоАвтомобилюПриСменеСтраницы();
	КонецЕсли;	
	ОбновитьВидимостьПодсказок();
	ПроверитьОтветыОтТехПоддержки();
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоАвтомобилюПриСменеСтраницы()
	Если Не ЗначениеЗаполнено(ТипАвто) Тогда 
		ТипАвто="легковым автомобилям";
	КонецЕсли;
	Если НЕ РезультатУзлыЗаполнен() Тогда
		ТипАвтоПриИзменении(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РезультатУзлыЗаполнен()
	Если РезультатУзлы.КоличествоСтраниц()>0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура ОбновитьВидимостьПодсказок()
	Если Объект.ОтключитьПодсказкиВидеоИнструкций Тогда   
		ЭтаФорма.Элементы.КакИскатьПоVIN.Видимость					=Ложь;
		ЭтаФорма.Элементы.КакРаботатьСВыдачейРезультатов.Видимость	=Ложь;
		ЭтаФорма.Элементы.FAQ_БК.Видимость							=Ложь;
		ЭтаФорма.Элементы.FAQ_Прайс.Видимость						=Ложь;
		ЭтаФорма.Элементы.КакПодключитьПоставщика.Видимость			=Ложь; 
		ЭтаФорма.Элементы.КакРаботатьСУточнениеПоиск.Видимость		=Ложь; 
		ЭтаФорма.Элементы.КакСоздатьЧекККМНажатие.Видимость			=Ложь;
	Иначе
		ЭтаФорма.Элементы.КакИскатьПоVIN.Видимость					=Истина;
		ЭтаФорма.Элементы.КакРаботатьСВыдачейРезультатов.Видимость	=Истина;
		ЭтаФорма.Элементы.FAQ_БК.Видимость							=Истина;
		ЭтаФорма.Элементы.FAQ_Прайс.Видимость						=Истина;
		ЭтаФорма.Элементы.КакПодключитьПоставщика.Видимость			=Истина; 
		ЭтаФорма.Элементы.КакРаботатьСУточнениеПоиск.Видимость		=Истина; 
		ЭтаФорма.Элементы.КакСоздатьЧекККМНажатие.Видимость			=Истина;

	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УточнениеПоискаУточнениеПометкаПриИзменении(Элемент)

	ТекДанные = Элементы.УточнениеПоиска.ТекущиеДанные;
	тАртикул = ТекДанные.АртикулДляПоиска;
	тБренд = ТекДанные.Бренд;
	тПоставщик = ТекДанные.УточнениеПоставщик;
	Индекс = Объект.УточнениеПоиска.Индекс(ТекДанные)+1;
	Колво=Объект.УточнениеПоиска.Количество();
	Пометка=ТекДанные.УточнениеПометка;
	Пока Индекс<Колво Цикл
		Стр=Объект.УточнениеПоиска[Индекс];
		Если Стр.Бренд<>тБренд или Стр.АртикулДляПоиска<>тАртикул или
			(Объект.УточнятьПоставщика и Стр.УточнениеПоставщик<>тПоставщик) Тогда
			Прервать;
		КонецЕсли;
		Стр.УточнениеПометка=Пометка;
		Индекс=Индекс+1;
	КонецЦикла;       
	
КонецПроцедуры

&НаКлиенте
Процедура УточнятьПоставщикаПриИзменении(Элемент)
	тБренд=Неопределено; тАртикул=Неопределено; тПоставщик=Неопределено;
	тСтр=Неопределено;тБезИмени=Ложь;тПометка=Ложь; 
	Для Каждого стр Из Объект.УточнениеПоиска Цикл
		Если Стр.Бренд<>тБренд или стр.АртикулДляПоиска<>тАртикул 
			или (Объект.УточнятьПоставщика И стр.УточнениеПоставщик<>тПоставщик) Тогда
			Стр.Отображать=Истина;
			тБренд=Стр.Бренд;
			тАртикул=стр.АртикулДляПоиска;
			тПометка=Стр.УточнениеПометка;
			Если Объект.УточнятьПоставщика Тогда
				тПоставщик=стр.УточнениеПоставщик;
			КонецЕсли;
			Если ПустаяСтрока(Стр.УточнениеНазваниеТовара) Тогда 
				БезИмени=Истина;
				тСтр=Стр;
			Иначе
				БезИмени=Ложь;
			КонецЕсли;
		Иначе
			Стр.Отображать=Ложь ;
			Стр.УточнениеПометка=тПометка;
			Если БезИмени и не ПустаяСтрока(Стр.УточнениеНазваниеТовара) Тогда
				тСтр.УточнениеНазваниеТовара=Стр.УточнениеНазваниеТовара;
				БезИмени=Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	Элементы.УточнениеПоиска1УточнениеПоставщик.Видимость=Объект.УточнятьПоставщика;
	Элементы.УточнениеПоиска.Обновить();
КонецПроцедуры

&НаСервере
Процедура СортироватьОнЛайнНаСервере()
	
  Если (Объект.МетодыСортировки <> Неопределено) И ЗначениеЗаполнено(Объект.МетодыСортировки) Тогда
      Объект.РезультатПоискаОнлайн.Сортировать(Объект.МетодыСортировки);	
  Иначе
      Объект.РезультатПоискаОнлайн.Сортировать("АртикулПоиска,Бренд,Артикул,Цена");
  КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура МетодыСортировкиПриИзменении(Элемент)
	
	СортироватьОнлайнНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтсечьРезультатыНаСервере(Команда)
	
	Объект.ОтсечьРезультатыНаСервере = НЕ Объект.ОтсечьРезультатыНаСервере;
	ОбновитьПометкиМеню(); 

КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимКлиента(Команда)
	
	Объект.РежимКлиента = НЕ Объект.РежимКлиента;
	ОбновитьПометкиМеню(); 
	Если Объект.РежимКлиента Тогда
		Элементы.РезультатПоискаОнлайнЦена.Видимость               	= НЕ Объект.БлокироватьЦенуПокупки;
		Элементы.РезультатПоискаОнлайнЦенаПродажи.Видимость        	= НЕ Объект.БлокироватьЦенуПродажи;
		Элементы.РезультатПоискаОнлайнИсточникИнформации.Видимость 	= НЕ Объект.БлокироватьПоставщика;
		Элементы.РезультатПоискаОнлайнСклад.Видимость 				= НЕ Объект.БлокироватьПроценкаСклад;
		Элементы.РезультатПоискаОнлайнКратность.Видимость			= НЕ Объект.БлокироватьКратность;
		Элементы.РезультатПоискаОнлайнПроцентОтгрузки.Видимость 	= НЕ Объект.БлокироватьПроцентОтгрузки;
		Элементы.РезультатПоискаОнлайнПроизводитель.Видимость		= НЕ Объект.БлокироватьПроизводителя;
		Элементы.РезультатПоискаОнлайнВозврат.Видимость 			= НЕ Объект.БлокироватьВозврат;

	Иначе
		Элементы.РезультатПоискаОнлайнЦена.Видимость             	= Истина;
		Элементы.РезультатПоискаОнлайнЦенаПродажи.Видимость         = Истина;
		Элементы.РезультатПоискаОнлайнИсточникИнформации.Видимость  = Истина;
		Элементы.РезультатПоискаОнлайнСклад.Видимость 				= Истина;
		Элементы.РезультатПоискаОнлайнКратность.Видимость 			= Истина;
		Элементы.РезультатПоискаОнлайнПроцентОтгрузки.Видимость 	= Истина;
		Элементы.РезультатПоискаОнлайнПроизводитель.Видимость		= Истина;
		Элементы.РезультатПоискаОнлайнВозврат.Видимость 			= Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаОформлениеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ЗаявкаНаОформлениеСайт" Тогда	
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Сайт) Тогда
			ЗаявкаНаОформлениеВыборНаСервере(Элемент.ТекущиеДанные.Сайт);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаявкаНаОформлениеВыборНаСервере(НаименованиеСайт)
	Обработка=РеквизитФормыВЗначение("Объект");
	СайтДляВызова = Обработка.ПолучитьСайтПроценки(НаименованиеСайт);			
	ЗапуститьПриложение("http://"+СайтДляВызова);
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаПоставщикуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ЗаявкаПоставщикуСайт" Тогда	
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Сайт) Тогда
			ЗаявкаНаОформлениеВыборНаСервере(Элемент.ТекущиеДанные.Сайт);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОбновитьСтатусыНаСервере() //вс(
	Обработка=РеквизитФормыВЗначение("Объект");
	Возврат Обработка.ОбновитьСтатусыПроценки(Объект.ЗаявкаПоставщику);	
КонецФункции                       //вс)

&НаКлиенте
Процедура ОбновитьСтатусы(Команда)
	Если Объект.ЗаявкаПоставщику.НайтиСтроки(Новый Структура("Выбран",Истина)).Количество()=0 Тогда
		Текст="Нет ни одной отмеченной позиции для обновления статусов";
		Если Объект.РежимМодальности Тогда
			ПоказатьПредупреждение(,Текст);
		Иначе
			Сообщить(Текст);
		КонецЕсли;
	Иначе
		КодыСтрок=ОбновитьСтатусыНаСервере(); //вс(
		Пользователи=Новый Соответствие;
		СохранитьКорзину=Ложь;
		Для Каждого Значение из КодыСтрок Цикл
			Мстр=Объект.ЗаявкаПоставщику.НайтиСтроки(Значение);
			Если Мстр.Количество()>0 Тогда
				Стр=Мстр[0];
				//Струк=СтруктураЗаявкаПоставщику();
				//ЗаполнитьЗначенияСвойств(Струк,Стр);
				//Строка=СтруктураВСтроку(Струк);
				Статус=?(ПустаяСтрока(Стр.СтатусПозиции),Стр.СтатусЗаказа,Стр.СтатусПозиции);
				СендерОтправить("{""table"":""ordered"", ""action"":""edit"",""status"":"""+Статус
				+""",""idData"":"+Формат(Стр.КодСтроки,"ЧГ=;ЧН=")+",""name"":"""+Стр.Пользователь+"""}");  //",""data"":"+Строка+
				Пользователи.Вставить(Стр.Пользователь);
				Если ПользовательКорзины=Стр.Пользователь Тогда
					Стрк=Объект.ЗаявкаНаОформление.НайтиСтроки(Новый Структура("КодЗП",Стр.КодСтроки));
					Если Стрк.Количество()>0 Тогда
						Стрк[0].Статус=Статус;
						СохранитьКорзину=Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		СохранитьДанныеПоЗаказамПоставщикам(Пользователи);
		Если СохранитьКорзину И ИзменятьКорзину Тогда
			СохранитьДанныеПоКорзине(ПользовательКорзины);
		КонецЕсли;
		//вс)
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЕстьОтветТехПоддержки(Команда)
	Ключ = Новый Структура("Страница", "ТехПоддержка");
	Оповещение=Новый ОписаниеОповещения("ПроверитьОтветыОтТехПоддержки",ЭтаФорма);
	Счетчик=10;
	ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.НастройкиУФ",Ключ,ЭтаФорма,,,,Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОтветыОтТехПоддержки(Данные=Неопределено, ПараметрДляОповещения=Неопределено) Экспорт
	Счетчик = Счетчик + 1;
	Если Счетчик >= 10 Тогда
		ПроверитьОтветыОтТехПоддержкиНаСервере();
		Счетчик = 0;	
	КонецЕсли;		
Конецпроцедуры

&НаСервере
Процедура ПроверитьОтветыОтТехПоддержкиНаСервере()
	Обработка=РеквизитФормыВЗначение("Объект");
	Рез = Обработка.ПолучитьДанныеПоТехПоддержке();
	Если Рез.КолОтветить > 0 Тогда
		Элементы.ЕстьОтветТехПоддержки.Видимость = Истина;	
	Иначе
		Элементы.ЕстьОтветТехПоддержки.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроценитьЗаказ(Команда)
	ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ПроценкаЗаказаУФ",,ЭтаФорма,"ПроценкаЗаказа");
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеИзФайла(Команда)
	ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ПоступлениеТовараУФ",,ЭтаФорма,"ПоступлениеТовара");
КонецПроцедуры

&НаКлиенте
Процедура КорзинаСоздатьКарточкуТовара(Команда)
	ТекДанные = Элементы.ЗаявкаНаОформление.ТекущиеДанные;	
	Если Объект.ЕстьНоменклатура Тогда
		Если НЕ ЗначениеЗаполнено(ТекДанные.Номенклатура) Тогда
			НоменклатураСсылка = ДобавитьВКарточкуНоменлатурыНаСервере(ТекДанные.Артикул, ТекДанные.Наименование, ТекДанные.Производитель);				
			Если НоменклатураСсылка <> Неопределено Тогда 			
				//Заполним все позиции в корзине
				Фильтр = Новый Структура("Артикул, Производитель", ТекДанные.Артикул, ТекДанные.Производитель);  
				НайденныеСтроки = Объект.ЗаявкаНаОформление.НайтиСтроки(Фильтр);
				Если НайденныеСтроки <> Неопределено Тогда
					Для каждого Запись Из НайденныеСтроки Цикл
						Запись.Номенклатура = НоменклатураСсылка;
						Запись.Наименование = НоменклатураСсылка;
					КонецЦикла;
				КонецЕсли;
				
				Если Объект.ЗапрашиватьГруппуНоменклатуры Тогда
					ПараметрыФормы = Новый Структура("УникальныйИдентификатор", новый УникальныйИдентификатор);
					Оповещение = Новый ОписаниеОповещения("ВходВгруппу", ЭтаФорма, НоменклатураСсылка);	
					ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы",ПараметрыФормы,,,,,Оповещение);
				Иначе
					ПараметрыФормы=Новый Структура("Ключ",НоменклатураСсылка);
					ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта",ПараметрыФормы);
				КонецЕсли;   
								
				//Ключ = Новый Структура("Ключ", НоменклатураСсылка);			
				//Форма = ПолучитьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", Ключ);    			
				//Форма.Открыть();			
			КонецЕсли;
		Иначе
			Сообщить("Данный товар уже есть в справочнике номенклатуры");
		КонецЕсли;
	Иначе
		Сообщить("В данной конфигурации нет справочника ""Номенклатура""");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КорзинаСоздатьВсеКарточкиТоваров(Команда)
	Если Объект.ЕстьНоменклатура Тогда
		
		ТекЗаказ=Элементы.ЗаказыКлиентов.ТекущиеДанные;
		Если ТекЗаказ<>Неопределено Тогда
			Для каждого ТекДанные Из Объект.ЗаявкаНаОформление Цикл
				Если ЗначениеЗаполнено(ТекДанные.Номенклатура) Тогда
					Продолжить;
				КонецЕсли;
				НоменклатураСсылка = ДобавитьВКарточкуНоменлатурыНаСервере(ТекДанные.Артикул, ТекДанные.Наименование, ТекДанные.Производитель);				
				Если НоменклатураСсылка <> Неопределено Тогда 			
					//Заполним все позиции в корзине
					Фильтр = Новый Структура("Артикул, Производитель", ТекДанные.Артикул, ТекДанные.Производитель);  
					НайденныеСтроки = Объект.ЗаявкаНаОформление.НайтиСтроки(Фильтр);
					Если НайденныеСтроки <> Неопределено Тогда
						Для каждого Запись Из НайденныеСтроки Цикл
							Запись.Номенклатура = НоменклатураСсылка;
							Запись.Наименование = НоменклатураСсылка;
						КонецЦикла;
					КонецЕсли;
					
					Если Объект.ЗапрашиватьГруппуНоменклатуры Тогда
						ПараметрыФормы = Новый Структура("УникальныйИдентификатор", новый УникальныйИдентификатор);
						Оповещение = Новый ОписаниеОповещения("ВходВгруппу", ЭтаФорма, НоменклатураСсылка);	
						ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы",ПараметрыФормы,,,,,Оповещение);
					Иначе
						ПараметрыФормы=Новый Структура("Ключ",НоменклатураСсылка);
						ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта",ПараметрыФормы);
					КонецЕсли;   
									
					//Ключ = Новый Структура("Ключ", НоменклатураСсылка);			
					//Форма = ПолучитьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", Ключ);    			
					//Форма.Открыть();			
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	Иначе
		Сообщить("В данной конфигурации нет справочника ""Номенклатура""");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаОформлениеНаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ТекДан=Элементы.ЗаявкаНаОформление.ТекущиеДанные;
	Оповещение=Новый ОписаниеОповещения("ТоварыНаименованиеВыбор",ЭтаФорма,ТекДан);
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("РежимВыбора",Истина);
	Если ЗначениеЗаполнено(ТекДан.Номенклатура) Тогда
		ПараметрыВыбора.Вставить("ТекущаяСтрока",ТекДан.Номенклатура);
		//ПараметрыВыбора.Вставить("УстановитьПараметрыФункциональныхОпцийФормы",Новый Структура("ТекущаяСтрока",ТекДан.Номенклатура));
	КонецЕсли;
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",ПараметрыВыбора,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНаименованиеВыбор(Номенклатура,ТекДан) Экспорт
	Если Номенклатура<>Неопределено тогда 
		ТекДан.Номенклатура=Номенклатура;
		ТекДан.Наименование=Строка(Номенклатура);
		ЗаполнитьЗначенияСвойств(ТекДан,ТоварыНаименованиеВыборНаСервере(Номенклатура));
	КонецЕсли;
Конецпроцедуры

&НаСервере
Функция ТоварыНаименованиеВыборНаСервере(Номенклатура)
	ТекДан=Новый Структура();
	Если Метаданные.Справочники.Номенклатура.Реквизиты.Найти("Артикул")<>Неопределено Тогда
		ТекДан.Вставить("Артикул",Номенклатура.Артикул);
	КонецЕсли;
	
	Обработка=РеквизитФормыВЗначение("Объект"); 
	ПроизводительСвойства = Обработка.ПолучитьПроизводителяНоменклатуры(Номенклатура);
	Если ПроизводительСвойства<>Неопределено Тогда
		ТекДан.Вставить("Производитель",Строка(ПроизводительСвойства.Ссылка));
	КонецЕсли;
	Возврат ТекДан;
КонецФункции

#КонецОбласти

#Область sender

&НаКлиенте
Процедура СендерОткрыть()
	Попытка
	#Если ВебКлиент Тогда
		СендерАдрес = ПолучитьАдресМакета("ВебСендер");
	#Иначе
		СендерАдрес = Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Макет.Сендер";
	#КонецЕсли
		//"ПоместитьВоВременноеХранилище(ПолучитьМакет("Компонента"));
		ОО = Новый ОписаниеОповещения("СендерПодключение",ЭтаФорма);
		НачатьПодключениеВнешнейКомпоненты(ОО,СендерАдрес,"RW715",ТипВнешнейКомпоненты.Native);
	Исключение
		Сообщить(ОписаниеОшибки());
	Конецпопытки;
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресМакета(Имя)
	Обработка=РеквизитФормыВЗначение("Объект");
	Возврат ПоместитьВоВременноеХранилище(Обработка.ПолучитьМакет(Имя),Новый УникальныйИдентификатор);
КонецФункции

&НаКлиенте
Процедура СендерПодключение(Подключено,ДопПараметры) Экспорт
	
	Если Подключено=Истина Тогда
		Сендер = Новый("AddIn.RW715.WebSocketClient_Async");
		СендерНачатьВызов();

	ИначеЕсли ДопПараметры=2 Тогда
		А = Новый СообщениеПользователю;
		А.Текст = "Ошибка подключения компоненты!";
		А.Сообщить();
	Иначе 
		ОО = Новый ОписаниеОповещения("СендерУстановка",ЭтаФорма);
		НачатьУстановкуВнешнейКомпоненты(ОО,СендерАдрес);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СендерУстановка(ДопПараметры) Экспорт
	ОО = Новый ОписаниеОповещения("СендерПодключение",ЭтаФорма,2);
	НачатьПодключениеВнешнейКомпоненты(ОО,СендерАдрес, "RW715", ТипВнешнейКомпоненты.Native);
КонецПроцедуры

&НаКлиенте
Процедура СендерНачатьВызов() Экспорт
	СендерСв.КС=1;
	СендерСв.Источник="";
	ОО = Новый ОписаниеОповещения("СендерОткрыт",ЭтаФорма);
	Сендер.НачатьВызовОткрыть(ОО,"wss://web.nirax.ru:5822");
	//Сендер.НачатьВызовОткрыть(ОО,"wss://neshataev.ru:5822");
КонецПроцедуры	
	
&НаКлиенте
Процедура СендерОткрыт(Результат,Параметры,ДопПараметры) Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура СендерОтправить(Данные=Неопределено,Инд=0) Экспорт
	Если Данные<>Неопределено Тогда
		СендерЗапросы.Добавить(Данные);
	КонецЕсли;
	
	Если СендерСв.КС<2 Тогда 
		СендерНачатьВызов();
		Возврат;
	КонецЕсли;
	
	Колво=СендерЗапросы.Количество();
	Пока Инд < Колво И СендерЗапросы[Инд].Пометка=Истина Цикл
		Инд=Инд+1;
	КонецЦикла;
	
	Если Колво<=Инд Тогда Возврат;КонецЕсли;
	
	Если СендерСв.Конец < СендерСв.Первый Тогда
		Ожидание=ТекущаяДата()-СендерСв.Начало-СендерСв.Первый;
		Если Объект.СендерОтладка И СендерСв.Макс<Ожидание Тогда 
			СендерСв.Макс=Ожидание;
			Сообщить("Максимальное время ожидания сек."+СендерСв.Макс);
		КонецЕсли; 
		Если Ожидание>СендерСв.Таймаут Тогда
			СендерПроверитьРаботу();
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	Стр=СендерЗапросы[Инд];
	Если ТипЗнч(Стр.Значение)=Тип("Строка") Тогда
		Если Найти(Стр.Значение,"""noReply"":")=0 Тогда
			Значение="{""idMess"":"+Формат(Стр.ПолучитьИдентификатор(),"ЧГ=;ЧН=")
			+","+Сред(Стр.Значение,2);
		Иначе
			Значение=Стр.Значение;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Стр.Значение)=Тип("Структура") Тогда
		Если НЕ Стр.Значение.СВойство("noReply") Тогда
			Стр.Значение.Вставить("idMess",Стр.ПолучитьИдентификатор());
		КонецЕсли;
		ЗаписьJSON=Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет,,,,,,,,Истина));
		ЗаписатьJSON(ЗаписьJSON,Стр.Значение);
		Значение=ЗаписьJSON.Закрыть();
		//Значение=ДанныеВJSON(Стр.Значение);
	Иначе
		СендерЗапросы.Удалить(Стр);
		СендерОтправить(Неопределено,Инд);
		Возврат;
	КонецЕсли;
	
	СендерСв.Первый=ТекущаяДата()-СендерСв.Начало;
	ОО = Новый ОписаниеОповещения("СендерОповещение",ЭтаФорма,Инд);
	Сендер.НачатьВызовSendMessage(ОО,Значение);
	//Если Объект.СендерОтладка Тогда
	//	Сообщить("Отправлено: "+?(СтрДлина(Значение)>100,Лев(Значение,100)+"...}",Значение));
	//КонецЕсли;
	Стр.Представление=Формат(ТекущаяДата()-СендерСв.Начало,"ЧГ=;ЧН=");
	Стр.Пометка=Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СендерПроверитьРаботу() Экспорт
	Если СендерСв.Пинг>0 И СендерСв.Живой Тогда
		Если Объект.СендерОтладка Тогда
			Сообщить("Проверка связи восстановлена после "+СендерСв.Пинг+" обращений к серверу");
		КонецЕсли;
		СендерСв.Пинг=0;
		СендерОтправить();
		Возврат;
	ИначеЕсли СендерСв.Пинг > СендерСв.Повторов И Не СендерСв.Живой Тогда	
		Если Объект.СендерОтладка Тогда
			Сообщить("Потеря связи с сервером, производится переподключение");
		КонецЕсли;
		СендерЗапросы.ЗаполнитьПометки(Ложь);
		СендерСв.Пинг=0;
		СендерЗакрыть(Истина);
		Возврат;
	ИначеЕсли СендерСв.Пинг=0 Тогда
		СендерСв.Живой=Ложь;
	КонецЕсли;
	СендерСв.Пинг = СендерСв.Пинг + 1;
	#Если Не ВебКлиент Тогда
		Сендер.Ping();
	#КонецЕсли
	ПодключитьОбработчикОжидания("СендерПроверитьРаботу", СендерСв.ЖдатьОтвет, Истина);
	
Конецпроцедуры

&НаКлиенте
Процедура СендерОповещение(Результат,Параметры,Инд=0) Экспорт
	Если Объект.СендерОтладка Тогда
		Сообщить("Отправлено в "+Формат(ТекущаяДата(),"ДЛФ=В")+": "
		+?(СтрДлина(Параметры[0])>100,СтрЗаменить(Лев(Параметры[0],100),Символы.ПС,"")+"...}",СтрЗаменить(Параметры[0],Символы.ПС,"")));
	КонецЕсли;
	СендерОтправить(Неопределено,Инд+1);
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если Лев(Источник,16)<>"WebSocketClient_" Тогда Возврат;КонецЕсли;
	Если СендерСв.Источник <> Источник Тогда
		Если СендерСв.Источник<>"" Тогда
			Сообщить("Неизвестный источник подключения: "+Источник+", текущий: "+СендерСв.Источник);
			Возврат;
		ИначеЕсли Событие<>"Open" Тогда
			Сообщить("Событие: "+Событие+", а подключение: "+Источник+" не открыто");
			СендерЗакрыть(Истина);
			Возврат;
		Иначе
			СендерСв.Источник = Источник;
		КонецЕсли;
	КонецЕсли;
	СендерСв.Живой=Истина;
	СендерСв.Конец=ТекущаяДата()-СендерСв.Начало;
	
	Если Объект.СендерОтладка и Событие<>"TextMessage" Тогда
		Сообщить("Событие: "+Событие+", время : "+СендерСв.Конец);
	КонецЕсли;

	Если Событие="TextMessage" или Событие="BinaryMessage" Тогда
		ОО = Новый ОписаниеОповещения("СендерПрочитать",ЭтаФорма);
		Сендер.НачатьВызовGetMessage(ОО);
	ИначеЕсли Событие="Open" Тогда
		Если Лев(Объект.Конфигурация,19)="УправлениеТорговлей" Тогда
			ПодключаемоеОборудование=Неопределено;
		Иначе	
			// Регистрация в ПодключаемоеОборудование
			Попытка
				Выполнить("ПодключаемоеОборудование=?(глПодключаемоеОборудование<>Неопределено,глПодключаемоеОборудование,Неопределено)");
			Исключение
				ПодключаемоеОборудование=Неопределено;
			Конецпопытки;
		КонецЕсли;
		Попытка
			Если ПодключаемоеОборудование<>Неопределено И ПодключаемоеОборудование.Свойство("ПараметрыПодключенияПО") Тогда
				НетПодключения=Истина;
				Для Каждого Подключение Из ПодключаемоеОборудование.ПараметрыПодключенияПО Цикл
					Если Подключение.Наименование="Сендер" Тогда
						Подключение.ИсточникСобытия=Источник;
						НетПодключения=Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если НетПодключения Тогда
					ИменаСобытий=Новый Массив;ИменаСобытий.Добавить("TextMessage");ИменаСобытий.Добавить("Ping");
					ИменаСобытий.Добавить("Pong");ИменаСобытий.Добавить("Error");ИменаСобытий.Добавить("BinaryMessage");
					ИменаСобытий.Добавить("Open");ИменаСобытий.Добавить("Close");
					Подключение=Новый Структура("ИсточникСобытия,ИменаСобытий,ОбъектДрайвера,
					|ОбработчикДрайвераМодуль,Параметры,ПараметрыПодключения,
					|ПоТехнологииРарус,Клиенты,Наименование,КоличествоПодключенных,ИДУстройства",
					Источник,ИменаСобытий,"Сендер",
					ЭтаФорма,Неопределено,Неопределено,
					Ложь,Новый Массив,"Сендер",0,"");
					//ПодключениеСсылка=ПолучитьПустуюСсылку("Справочник","ПодключаемоеОборудование");
					//ЕСли ПодключениеСсылка<>Неопределено Тогда Подключение.Вставить("Ссылка",ПодключениеСсылка);КонецЕсли;
					//ТипОборудования=ПолучитьПустуюСсылку("Перечисление","ТипыПодключаемогоОборудования");
					//ЕСли ТипОборудования<>Неопределено Тогда Подключение.Вставить("ТипОборудования",ТипОборудования);КонецЕсли;
					Для каждого Стр Из ЗаполнитьПодключениеНаСервере() Цикл
						Подключение.Вставить(Стр.Ключ,Стр.Значение);
					КонецЦикла;
					ПодключаемоеОборудование.ПараметрыПодключенияПО.Добавить(Подключение);
				КонецЕсли;
			КонецЕсли;
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		// Идентификация подключения
		СендерСВ.КС=2;
		Попытка
			СендерЗапросы.Вставить(0,"{""idUser"":"+Формат(ЭтаФорма.КодПользователя,"ЧГ=")+",""idSession"":"
			+Формат(Объект.КодСеанса,"ЧГ=")+",""name"":"""+Объект.ПользовательИмя+""",""id1s"":"+Ид1С()+"}");
			СендерЗапросы.Вставить(1,"{""table"":""ordered"",""action"":""tran"",""all"":"
			+?(Объект.ВсеЗаявкиПоставщику,"true","false")+",""debug"":"+?(Объект.СендерОтладка,"true","false")+"}"); //вс)
			// Сообщаем какие прайсы нужно обновлять
			КодыПрайсов=ПрайсыДляОбновления();
			Если Не ПустаяСтрока(КодыПрайсов) Тогда
				СендерЗапросы.Вставить(2,"{""schema"":""price"",""action"":""waitPrices"",""idPrices"":"""+КодыПрайсов+""",""noReply"":true}");
			КонецЕсли;
		Исключение
		Конецпопытки;
	ИначеЕсли Событие="Error" Тогда
		СендерПроверитьРаботу();
		Возврат;
	КонецЕсли;
	
	Если Событие<>"Error" Тогда
		Если СендерЗапросы.Количество()>0 Тогда
			СендерОтправить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПрайсыДляОбновления()
	Проценки = ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","Проценки",,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
	КодыПрайсов="";
	Если Проценки.Колонки.Найти("Источник")=Неопределено Тогда Возврат КодыПрайсов;КонецЕсли;
	Строки=Проценки.НайтиСтроки(Новый Структура("Вкл, Источник",Истина, "EMAIL"));
	Если Строки.Количество()>0 Тогда
		Для Каждого Стр Из Строки Цикл
			КодыПрайсов=КодыПрайсов+", "+Сред(Стр.Сайт,3);
		КонецЦикла;
		КодыПрайсов=Сред(КодыПрайсов, 3);
	КонецЕсли;
	Возврат КодыПрайсов;
КонецФункции

&НаСервере
Функция ЗаполнитьПодключениеНаСервере()
	Подключение=Новый Структура;
	Если Метаданные.Справочники.Найти("ПодключаемоеОборудование")<>Неопределено Тогда
		Подключение.Вставить("Ссылка",Справочники.ПодключаемоеОборудование.ПустаяСсылка());
	КонецЕсли;
	Если Метаданные.Перечисления.Найти("ТипыПодключаемогоОборудования")<>Неопределено Тогда
		Подключение.Вставить("ТипОборудования",Перечисления.ТипыПодключаемогоОборудования.ПустаяСсылка());
	КонецЕсли;
	Возврат Подключение;
КонецФункции

&НаКлиенте
Функция ВыполнитьКоманду(Команда, ВходныеПараметры, ВыходныеПараметры,
    ОбъектДрайвера, Параметры, ПараметрыПодключения) Экспорт
	ЕСли ВыходныеПараметры=Неопределено Тогда
		ВыходныеПараметры=Новый Массив;
	КонецЕсли;
	Если Команда="ОбработатьСобытие" Тогда
		Возврат ОбработатьСобытие(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры[0], 
		ВходныеПараметры[1], ВыходныеПараметры);
	ИначеЕсли Команда="ЗавершитьОбработкуСобытия" Тогда	
		Возврат ЗавершитьОбработкуСобытия(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);	
	КонецЕсли;
	Возврат Истина;
КонецФункции

&НаКлиенте
Функция ОбработатьСобытие(ОбъектДрайвера, Параметры, ПараметрыПодключения, Событие, Данные, ВыходныеПараметры) Экспорт
	ВыходныеПараметры.Добавить("Сендер");
	ВыходныеПараметры.Добавить(Новый Массив());
	Возврат Истина;
КонецФункции

&НаКлиенте
Функция ЗавершитьОбработкуСобытия(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт
	Возврат Истина;
КонецФункции

&НаКлиенте
Функция ПоддержкаАсинхронногоРежима() Экспорт
	Возврат Ложь;
КонецФункции

&НаКлиенте
Функция ОтключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт
	ВыходныеПараметры = Новый Массив();
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура СендерПрочитать(Ответ,Параметры,ДопПараметры) Экспорт
	Если Ответ=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Ответ)=Тип("Строка") Тогда 
		Рез=UnJSON(Ответ,Истина,ИСтина);
		
		Если Рез.Свойство("idMess") Тогда
			СтрСЗ=СендерЗапросы.НайтиПоИдентификатору(Рез.idMess);
			Если СтрСЗ <> Неопределено Тогда
				СендерЗапросы.Удалить(СтрСЗ);
			КонецЕсли;
		КонецЕсли;
		
		Если Рез.Свойство("table") Тогда
			ВнешнееСобытиеТаблиц(Рез);
		Иначе
			Если Рез.Свойство("comment") и (Объект.СендерОтладка ИЛИ Рез.result=Ложь) Тогда
				Сообщить(Рез.comment);
			КонецЕсли;
			Если Рез.Свойство("action") Тогда
				Если Рез.action="ident" Тогда
					Если Рез.result=Истина Тогда
						ОбновитьЗаказанное(Неопределено);
						Если Объект.СендерОтладка Тогда
							Сообщить("Заказанное обновлено");
						КонецЕсли;
						Если ПользовательКорзины<>Объект.ПользовательИмя или Не ИзменятьКорзину Тогда
							СендерОтправить("{""action"":""cart"",""name"":"""+ПользовательКорзины+""",""edit"":"
							+?(ИзменятьКорзину,"true","false")+"}");
						КонецЕсли;
					Иначе
						ОО=Новый ОписаниеОповещения("ЗакрытьФорму",ЭтаФорма);
						ПоказатьПредупреждение(ОО,"Пользователь "+Объект.ПользовательИмя+" уже работает с помощником автобизнеса."
						+Символы.ПС+"Работа нескольких пользователей под одним именем запрещена, так как может повлечь потерю данных.");
					КонецЕсли;
				ИначеЕсли Рез.action="cart" Тогда
					Если Объект.СендерОтладка Тогда Сообщить(Ответ);КонецЕсли;
					Если Рез.Свойство("userEdit") Тогда 
						Сообщить("Пользователь "+Рез.userEdit+" работает с корзиной в режиме изменений");
					КонецЕсли;
					Если Рез.result<>Истина Тогда Возврат;КонецЕсли;
					Если Рез.name=ПользовательКорзины Тогда
						Если Рез.edit<>ИзменятьКорзину Тогда
							ИзменятьКорзину=Рез.edit;
							РедактированиеКорзины(ИзменятьКорзину);
							Если ИзменятьКорзину Тогда
								ПользовательКорзиныВыбранНаСервере();
							КонецЕсли	
						Иначе
							Элементы.ПереносЗаказов.Видимость=ПользовательКорзины<>Объект.ПользовательИмя и Рез.edit=Истина;
						КонецЕсли;
					Иначе
						ПользовательКорзиныВыбран(Рез.name,Рез.edit)
						//Сообщить("Не произошло переключение на корзину пользователя "+рез.name);
					КонецЕсли;
				ИначеЕСли Рез.action="isLicense" Тогда
					ДоступКАналитике=ПроверитьДоступ("Аналитика",Объект.ПользовательИмя);
					Если Рез.result=Истина И Объект.СборАналитики=Истина И ДоступКАналитике=Истина Тогда
						ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ОтчетУФ",
						Новый Структура("Отчет,Код","Аналитика",ЭтаФорма.КодПользователя),ЭтаФорма,"ОтчетУФ");	
					Иначе
						ПоказатьПредупреждение(,"Для получения доступа к Аналитике нужно выполнить следущее: "
						+?(Рез.result=Ложь,Символы.ПС+"- обратитесь к менеджеру для получения лицензии;","")
						+?(Объект.СборАналитики<>Истина,Символы.ПС+"- в Настройках: Корзина и Заказанное включите флаг: ""Сбор аналитики""","")
						+?(ДоступКАналитике<>Истина,Символы.ПС+"- в Настройках: Администрирование включите флаг ""Аналитика"".",""));
					КонецЕсли;
				ИначеЕСли Рез.Свойство("schema") И Рез.schema="pricelists" И (Не Рез.Свойство("result") ИЛИ Рез.result=Истина) Тогда
					Если Рез.action="getPrices" Тогда
						ЕСли ФормыПАОткрыта("НастройкиУФ") Тогда
						// Обновляем информацию по прайс-листам
							ФормыПА.НастройкиУФ.ОбновитьПрайсы(Рез.data);
						КонецЕсли;
					ИначеЕсли Рез.action="getPrice" Тогда
						ЕСли ФормыПАОткрыта("НастройкиУФ") Тогда
							// Обновляем информацию по прайс-листу
							ФормыПА.НастройкиУФ.ОбновлениеДат(Рез.data[0]);
						КонецЕсли;
					ИначеЕсли Рез.action="getUser" Тогда
						ЕСли ФормыПАОткрыта("НастройкиУФ") Тогда
							// выбираем прайс для добавления
							ФормыПА.НастройкиУФ.ВыбратьПрайсДляДобавления(Рез.data);
						КонецЕсли;
					ИначеЕсли Рез.action="add" Тогда
						ЕСли ФормыПАОткрыта("НастройкиУФ") Тогда
							// добавляем прайс
							ФормыПА.НастройкиУФ.ПрайсДобавлен(Рез);
						Конецесли;
					ИначеЕсли Рез.action="update" или Рез.action="getPrice" Тогда
						ЕСли ФормыПАОткрыта("НастройкиУФ")Тогда
							// добавляем прайс
							ФормыПА.НастройкиУФ.ПрайсОбновлен(Рез);
						Конецесли;
					КонецЕсли;
				ИначеЕСли Рез.Свойство("schema") И Рез.schema="mail" И (Не Рез.Свойство("result") ИЛИ Рез.result=Истина) Тогда
					Если Рез.action="getUserEmail" Тогда
						ЕСли ФормыПАОткрыта("ПрайсНастройкаУФ") Тогда
							// добавляем прайс
							ФормыПА.ПрайсНастройкаУФ.ПолучениеАдресовПользователя(Рез.data);
						Конецесли;
					ИначеЕсли Рез.action="getMailServer" Тогда
						ЕСли ФормыПАОткрыта("ПочтаНастройкаУФ") Тогда
							// добавляем прайс
							ФормыПА.ПочтаНастройкаУФ.ПолучениеПочтовыхСерверов(Рез.data);
						Конецесли;
					ИначеЕсли Рез.action="getEmail" Тогда
						ЕСли ФормыПАОткрыта("ПочтаНастройкаУФ") Тогда
							// добавляем прайс
							ФормыПА.ПочтаНастройкаУФ.ПолучениеНастроекПочты(Рез);
						Конецесли;
					ИначеЕсли Рез.action="delEmail" Тогда
						ЕСли ФормыПАОткрыта("ПочтаНастройкаУФ") Тогда
							// добавляем прайс
							ФормыПА.ПочтаНастройкаУФ.ПочтаУдалена();
						Конецесли;
					ИначеЕсли Рез.action="saveEmail" Тогда
						ЕСли ФормыПАОткрыта("ПочтаНастройкаУФ") Тогда
							// добавляем прайс
							ФормыПА.ПочтаНастройкаУФ.ПочтаСохранена(Рез.idMail);
						Конецесли;
					КонецЕсли;
				ИначеЕСли Рез.Свойство("schema") И Рез.schema="price" И (Не Рез.Свойство("result") ИЛИ Рез.result=Истина) Тогда
					Если Рез.action="loadPrice" Тогда
						ЕСли ФормыПАОткрыта("НастройкиУФ") Тогда
							// добавляем прайс
							ФормыПА.НастройкиУФ.ПрайсОбновлен(Рез);
						Иначе
							Сообщить("Обновлен прайс id"+Формат(Рез.idPrice,"ЧЦ=6;ЧВН=;ЧГ="));
						Конецесли;
					ИначеЕсли Рез.action="addPrice" Тогда
						ЕСли ФормыПАОткрыта("НастройкиУФ") Тогда
							// добавляем прайс
							ФормыПА.НастройкиУФ.ПрайсОбновлен(Рез);
						Иначе
							Сообщить("Обновлен прайс id"+Формат(Рез.idPrice,"ЧЦ=6;ЧВН=;ЧГ="));
						Конецесли;
					ИначеЕсли Рез.action="getPrice" Тогда
						ЕСли ФормыПАОткрыта("ПрайсУФ") Тогда
							// загружаем прайс
							ФормыПА.ПрайсУФ.Загрузка(Рез.data);
						Конецесли;
							
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;		

	//Вызываем СендерПрочитать ещё раз, т.к. сообщений в очереди может быть несколько
	ОО = Новый ОписаниеОповещения("СендерПрочитать",ЭтаФорма);
	Сендер.НачатьВызовGetMessage(ОО);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытиеТаблиц(Рез)
	Если Рез.table="ordered" Тогда
		Таблица=Объект.ЗаявкаПоставщику;
	ИначеЕсли Рез.table="analytics.primary" Тогда
		ЕСли ФормыПАОткрыта("ОтчетУФ") Тогда	
			ФормыПА.ОтчетУФ.ЗагрузитьТаблицу(Рез.data);
		КонецЕсли;
		Возврат;
	Иначе
		Сообщить("Таблица "+Рез.table+" не определена, данные Sender не обработаны");
		Возврат;
	КонецЕсли;
	СтрТаб=Таблица.НайтиСтроки(Новый Структура("Пользователь,КодСтроки",Рез.name,Рез.idData));
	
	Если Рез.action="edit" И Рез.name=ПользовательКорзины И Рез.Свойство("status") Тогда
		// Изменение статуса в корзине
		МСтрК=Объект.ЗаявкаНаОформление.НайтиСтроки(Новый Структура("КодЗП",Рез.idData));
		Если МСтрК.Количество()>0 Тогда
			МСтрК[0].Статус=Рез.status;
			Если Объект.СендерОтладка Тогда
				Сообщить("В корзине "+Рез.name+" измененился статус на "+Рез.status+" в строке с кодом: "+Рез.idData);
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Если СтрТаб.Количество()>0 Тогда
		Если Рез.action="del" Тогда
			Таблица.Удалить(СтрТаб[0]);
			Если Объект.СендерОтладка Тогда
				Сообщить("Пользователь "+Рез.name+" удалил строку с кодом: "+Рез.idData);
			КонецЕсли;
		ИначеЕсли Рез.action="edit" Тогда
			Если  Рез.Свойство("data") Тогда
				СтрДата=ЗначениеИзСтрокиНаСервере(Рез.data);
				ЗаполнитьЗначенияСвойств(СтрТаб[0],СтрДата);
				//Если Рез.name<>СтрДата.Пользователь ИЛИ Рез.idData<>СтрДата.КодСтроки Тогда
				//	Сообщить("Ошибка действия "+Рез.action+", пользователь "+Рез.name+"<>"+СтрДата.Пользователь
				//	+" или Код "+Рез.idData+"<>"+СтрДата.КодСтроки);
				//КонецЕсли;
			ИначеЕсли Рез.Свойство("status") Тогда
				// Изменение статуса в заказанном
				СтрТаб[0].СтатусПозиции=Рез.status;
            КонецЕсли;
			Если Объект.СендерОтладка Тогда
				Сообщить("Пользователь "+Рез.name+" изменил строку с кодом: "+Рез.idData);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Рез.action="add" или Рез.action="edit" и Рез.Свойство("data") Тогда
		СтрДата=ЗначениеИзСтрокиНаСервере(Рез.data);
		Нов=Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(Нов,СтрДата);
		Нов.КодСтроки=Рез.idData;
		Если Объект.СендерОтладка Тогда
			Сообщить("Пользователь "+Нов.Пользователь+" добавил"+?(Рез.action="add","",", а не изменил")+" строку с кодом: "+Нов.КодСтроки);
		КонецЕсли;
	ИначеЕсли Объект.СендерОтладка Тогда
		Сообщить("Пользователь "+Рез.name+" операция "+Рез.action+" не выполнена для кода строки "+Рез.idData);
	КонецЕсли;
	
	Если Рез.table="ordered" Тогда
		Элементы.Группа10.Заголовок="Заказанное ("+Строка(Объект.ЗаявкаПоставщику.Количество())+")";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СендерЗакрыть(Перезапуск=Ложь)
	Попытка
		ОО = Новый ОписаниеОповещения("СендерЗакрытьОповещение",ЭтаФорма,Перезапуск);
		Сендер.НачатьВызовClose(ОО,1001,"Какая-то причина");
	Исключение
	Конецпопытки;
КонецПроцедуры

&НаКлиенте
Процедура СендерЗакрытьОповещение(Результат,Параметры,Перезапуск) Экспорт
	Если ПодключаемоеОборудование<>Неопределено И ПодключаемоеОборудование.Свойство("ПараметрыПодключенияПО") Тогда
		Индекс=0;
		Для Каждого Подключение Из ПодключаемоеОборудование.ПараметрыПодключенияПО Цикл
			Если Подключение.Наименование="Сендер" Тогда
				ПодключаемоеОборудование.ПараметрыПодключенияПО.Удалить(Индекс);
				Прервать;
			КонецЕсли;
			Индекс=Индекс+1;
		КонецЦикла;
	КонецЕсли;
	Если Перезапуск=Истина Тогда
		ПодключитьОбработчикОжидания("СендерНачатьВызов", СендерСв.ЖдатьОтвет, Истина);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция UnJSONнаСервере(Текст,ЭтоСтруктура=Истина,ЕстьДатыСсылки=Ложь)
	Перем Результат;
	Если ТипЗнч(Текст)<>Тип("Строка") или ПустаяСтрока(Текст) Тогда Возврат Неопределено;КонецЕсли;
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Текст);
		Если ЕстьДатыСсылки Тогда
			Результат = ПрочитатьJSON(ЧтениеJSON,Не ЭтоСтруктура,,,"UnJsonRestServ",ЭтаФорма);
		Иначе
			Результат = ПрочитатьJSON(ЧтениеJSON,Не ЭтоСтруктура);
		КонецЕсли;
		ЧтениеJSON.Закрыть();
		Возврат Результат;
	Исключение
		Сообщить(ОписаниеОшибки()+Символы.ПС+"Будет произведено тестирование и попытка восстановленияь значение из JSON");
	КонецПопытки;
	
КонецФункции

&НаСервере
// Функция восстановления дат из JSON
Функция UnJsonRestServ(Свойство, Значение, Доп) Экспорт
	#Если ВебКлиент Тогда 
		Возврат Значение;
	#КонецЕсли
	Если ТипЗнч(Значение)<>Тип("Строка") Тогда Возврат Значение;КонецЕсли; 
	Длина=СтрДлина(Значение);
	Попытка
		Если Лев(Значение,2)<> "@^" Тогда
			Если Длина<>19 И Длина<>20 Тогда Возврат Значение;КонецЕсли;
			Если Сред(Значение,5,1)<>"-" ИЛИ Сред(Значение,8,1)<>"-" ИЛИ Сред(Значение,14,1)<>":" ИЛИ Сред(Значение,17,1)<>":" Тогда
				Возврат Значение;
			КонецЕсли;
			Если Сред(Значение,11,1)<>"T" Тогда
				Возврат ПрочитатьДатуJSON(Лев(Значение,10)+"T"+Сред(Значение,12), ФорматДатыJSON.ISO);
			Иначе
				Возврат ПрочитатьДатуJSON(Значение, ФорматДатыJSON.ISO);
			КонецЕсли;
		ИначеЕсли Сред(Значение,3,1)="^" Тогда Возврат "@^"+Сред(Значение,4);
		ИначеЕсли Длина=16 Тогда
			Возврат Дата(Сред(Значение,3));
		Иначе 
			Возврат Значение;
		КонецЕсли;
	Исключение
		Возврат Значение;
	КонецПопытки;
КонецФункции

&НаКлиенте
// Функция восстановления дат из JSON
Функция UnJsonRest(Свойство, Значение, Доп) Экспорт
	#Если ВебКлиент Тогда 
		Возврат Значение;
	#Иначе
	Если ТипЗнч(Значение)<>Тип("Строка") Тогда Возврат Значение;КонецЕсли; 
	Длина=СтрДлина(Значение);
	Попытка
		Если Лев(Значение,2)<> "@^" Тогда
			Если Длина<>19 И Длина<>20 Тогда Возврат Значение;КонецЕсли;
			Если Сред(Значение,5,1)<>"-" ИЛИ Сред(Значение,8,1)<>"-" ИЛИ Сред(Значение,14,1)<>":" ИЛИ Сред(Значение,17,1)<>":" Тогда
				Возврат Значение;
			КонецЕсли;
			Если Сред(Значение,11,1)<>"T" Тогда
				Возврат ПрочитатьДатуJSON(Лев(Значение,10)+"T"+Сред(Значение,12), ФорматДатыJSON.ISO);
			Иначе
				Возврат ПрочитатьДатуJSON(Значение, ФорматДатыJSON.ISO);
			КонецЕсли;
		ИначеЕсли Сред(Значение,3,1)="^" Тогда Возврат "@^"+Сред(Значение,4);
		ИначеЕсли Длина=16 Тогда
			Возврат Дата(Сред(Значение,3));
		Иначе 
			Возврат Значение;
		КонецЕсли;
	Исключение
		Возврат Значение;
	КонецПопытки;
	#КонецЕсли
КонецФункции

&НаКлиенте
// Функция преобразует текст в формате JSON в соответствующие объекты (структуры или соответствия и массивы) и их значения
// Параметры:
//    Текст - текст в формате JSON или Объект ЧтениеJSON c открытым объектом (Файл, поток, Поток в памяти, файловый поток)
//    ЭтоСтруктура - Истина - объекты преобразуются в структуры, Ложь - в соответствия
//       умолчание - Истина      
//    ЕстьДатыСсылки - Если истина - тогда переводит даты форматов: гггг-мм-ддТчч:мм:сс[Z] или @^ггггммддччммсс,
//       где вместо T может быть пробел, а если в конце стоит Z - перевод в универсальную дату
//       и ссылки формат: @^ТипОбъекта.ИмяОбъекта?уникальныйИдентификатор, где ТипОбъекта: Справочник,Документ,
//       ПланВидовХарактеристик,ПланСчетов,ПланВидовРасчетов,ПланОбмена,БизнесПроцесс,Задача
//       умолчание - Ложь      
Функция UnJSON(Текст,ЭтоСтруктура=Истина,ЕстьДатыСсылки=Ложь) Экспорт
	Перем Результат;
	Если ТипЗнч(Текст)<>Тип("Строка") или ПустаяСтрока(Текст) Тогда Возврат Неопределено;КонецЕсли;
	Попытка
	#Если ВебКлиент Тогда
		Результат=UnJSONнаСервере(Текст,ЭтоСтруктура,ЕстьДатыСсылки);
	#Иначе
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Текст);
		Если ЕстьДатыСсылки Тогда
			Результат = ПрочитатьJSON(ЧтениеJSON,Не ЭтоСтруктура,,,"UnJsonRest",ЭтаФорма);
		Иначе
			Результат = ПрочитатьJSON(ЧтениеJSON,Не ЭтоСтруктура);
		КонецЕсли;
		ЧтениеJSON.Закрыть();
	#КонецЕсли
	
	Возврат Результат;
	Исключение
		Сообщить(ОписаниеОшибки()+Символы.ПС+"Будет произведено тестирование и попытка восстановленияь значение из JSON");
		//Возврат UnJsonTest(Текст,ЭтоСтруктура);
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Функция ВJson(Данные)
	//типы=Новый Структура("Строка,Булево,Число,Неопределено,Null,Дата"+
	//"Структура,ФиксированнаяСтруктура,Массив,СписокЗначений,ЭлементСпискаЗначений,"+
	//"ТаблицаЗначений,СтрокаТаблицыЗначений,ДанныеФормыКоллекция,ДанныеСтруктураСКоллекцией",
	//0,0,0,0,0,0,1,1,2,)
	//Дан=Данные
	//Уровень=0;
	//Пока Уровень>=0 Цикл
	//	Тип=Строка(ТипЗнч(Дан));
	//	Если Не Типы.Свойство(Тип) Тогда 
	//		Уровень=Уровень-1;
	//		Продолжить;
	//	КонецЕсли;
	//	КодОбработки=Типы[Тип];
	//	Если КодОбработки=0 Тогда
	Возврат Неопределено;		
КонецФункции

&НаСервере
Функция ДанныеВJSON(Данные);
	Обработка=РеквизитФормыВЗначение("Объект");
	Возврат Обработка.ДанныеВJSON(Данные);
КонецФункции

&НаСервере
Функция СтруктураВСтроку(Стр)
	Строка=ЗначениеВСтрокуВнутр(Стр);	
	Попытка
		ДемоКомп = Новый("AddIn.NiraxVK.Image");
		Возврат """"+ДемоКомп.ТекстJson(Строка)+"""";
	Исключение
		Обработка=РеквизитФормыВЗначение("Объект");
		Возврат """"+Обработка.ТекстJSON(Строка)+"""";
	КонецПопытки;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СтруктураЗаявкаПоставщику()
	Возврат Новый Структура("Артикул,Всего,Количество,Номенклатура,Пользователь,Поставщик,Скидка,"
	+"Склад,Срок,СтавкаНДС,Сумма,СуммаНДС,СуммаСоСкидкой,Цена,СтатусЗаказа,СтатусПозиции,Сайт,КодТовара,"
	+"КодЗаказа,idСклад,КодДоставки,ДанныеСайта,ЗаказПокупателя,idЗаказа,ЗаказПоставщику,Дата,КодСтроки");
КонецФункции	

&НаСервере
Функция ЗначениеИзСтрокиНаСервере(стр)
	Возврат ЗначениеИзСтрокиВнутр(Стр);	
КонецФункции

&НаСервере
Функция ЗначениеВСтрокуНаСервере(стр)
	Возврат ЗначениеВСтрокуВнутр(Стр);	
КонецФункции

&НаСервере
Функция Ид1С()
	ЖС=Новый ЗаписьJSON;
	жс.УстановитьСтроку();
	жс.ЗаписатьЗначение(СтрокаСоединенияИнформационнойБазы());
	Возврат жс.Закрыть();
КонецФункции

&НаСервере
Процедура ОбновитьЗаказанноеНаСервере()
	Обработка=РеквизитФормыВЗначение("Объект");
	Обработка.ЗагрузитьЗаявкиПоставщику();
	ЗначениеВДанныеФормы(Обработка.ЗаявкаПоставщику,Объект.ЗаявкаПоставщику);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаказанное(Команда)
	ОбновитьЗаказанноеНаСервере();
	Элементы.Группа10.Заголовок="Заказанное ("+Строка(Объект.ЗаявкаПоставщику.Количество())+")";
КонецПроцедуры

#КонецОбласти

#Область ЗаказыКлиентов

&НаКлиенте
Процедура СпрятатьПоказатьЗаказы(Команда)
	Если Элементы.ГруппаКлиенты.Видимость Тогда
		Элементы.ГруппаКлиенты.Видимость=Ложь;
		Элементы.СпрятатьПоказатьЗаказыТовары.Заголовок="→";
	Иначе
		Элементы.ГруппаКлиенты.Видимость=Истина;
		Элементы.СпрятатьПоказатьЗаказыТовары.Заголовок="←";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВЗаказ(Команда)
	// Проверим наличие отмеченных строк
	ТекДан=Элементы.ЗаказыКлиентов.ТекущиеДанные;
	ЕСли ТекДан=Неопределено Тогда Возврат;КонецЕсли;
	
	Строки=Объект.ЗаявкаНаОформление.НайтиСтроки(Новый Структура("Выбран",Истина));
	Если Строки.Количество()=0 Тогда 
		ПоказатьПредупреждение(,"Нет выбранных строк для переноса");
		Возврат;
	КонецЕсли;
	
	// Сформируем список значений для выбора
	Список=Новый СписокЗначений;
	Список.Добавить(-1,"Новая заявка");
	Для Каждого Стр Из Объект.ЗаказыКлиентов Цикл
		Если Стр.Заказ<>ТекДан.Заказ Тогда
			Список.Добавить(Стр.Заказ,Стр.Наименование);
		КонецЕсли;
	КонецЦикла;
	ОО = Новый ОписаниеОповещения("ВЗаказВыбран",ЭтаФорма,Строки);
	//Список.ПоказатьВыборЭлемента(ОО,"Выберите заявку");
	ПараметрыФормы=Новый Структура("СписокЗначений,Групповой,ТекущаяСтрока,Заголовок",
	Список,Ложь,0,"Выберите заявку");
	ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ФормаСпискаУФ",
	ПараметрыФормы,ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно,, ОО,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВЗаказВыбран(Элемент,Строки) Экспорт
	Если Элемент=Неопределено Тогда Возврат;КонецЕсли;
	ТекДан=Элементы.ЗаказыКлиентов.ТекущиеДанные;
	
	// Данные для перемещения в заказ
	Данные=Объект.ЗаявкаНаОформление.НайтиСтроки(Новый Структура("Выбран",Истина));
	
	Если Элемент.Значение=-1 Тогда
		// Новый заказ
		Элемент.Значение=НовыйКодТаблицы(Объект.ЗаказыКлиентов,"Заказ");
		Стр=Объект.ЗаказыКлиентов.Добавить();
		ЗаполнитьЗначенияСвойств(Стр,Новый Структура("Заказ,Наименование,Дата,Контрагент,Соглашение,Договор,Склад,ДатаОтгрузки,Статус,Отбор",
		Элемент.Значение,Формат(ТекущаяДата(),"ДФ=дд.ММ.гг ЧЧ:мм")+" / "+Строка(ТекДан.Контрагент),ТекущаяДата(),
		ТекДан.Контрагент, ТекДан.Соглашение,ТекДан.Договор, ТекДан.Склад,ТекДан.ДатаОтгрузки,0,Истина));
		
		// Переносим ссылку на заказа покупателя, если он был создан из корзины
		Если ТекДан.Заказ=0 И ЗначениеЗаполнено(ТекДан.ЗаказПокупателя) Тогда 
			Стр.ЗаказПокупателя=ТекДан.ЗаказПокупателя;
			Массив=Новый Массив;
			Массив.Добавить(ТипЗнч(ТекДан.ЗаказПокупателя));
			Описание=Новый ОписаниеТипов(Массив);
			ТекДан.ЗаказПокупателя=Описание.ПривестиЗначение("");
		КонецЕсли;
	Иначе
		Стр=Объект.ЗаказыКлиентов.НайтиСтроки(Новый структура("Заказ",Элемент.Значение));
		Стр=Стр[0];
	КонецЕсли;
	
	// Удалим строки
	Колво=Строки.Количество();
	Для инд=1 по колво Цикл
		Строка=Строки[Колво-инд];
		Объект.ЗаявкаНаОформление.Удалить(Строка);
	КонецЦикла;
	
	ТекДан.Сумма = Объект.ЗаявкаНаОформление.Итог("Всего");
	Если ТекДан.Заказ = 0 Тогда 
		ОбновитьЗаголовокКорзины();
	КонецЕсли;
	// Смена заявки и пополнение строками
	Элементы.ЗаказыКлиентов.ТекущаяСтрока=Стр.ПолучитьИдентификатор();
	СменитьЗаявку(Стр.Заказ);
	Для Каждого Строка Из Данные Цикл
		Нов = Объект.ЗаявкаНаОформление.Добавить();
		ЗаполнитьЗначенияСвойств(Нов,Строка);
		Нов.Заказ = Стр.Заказ;
	КонецЦикла;
	Стр.Сумма = Объект.ЗаявкаНаОформление.Итог("Всего");
	Если Стр.Заказ = 0 Тогда 
		ОбновитьЗаголовокКорзины();
	КонецЕсли;
	СохранитьДанныеПоКорзине(ПользовательКорзины);
	Элементы.ЗаказыКлиентов.ТекущаяСтрока=Стр.ПолучитьИдентификатор();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокКорзины()
	Если Объект.ТекущийЗК=0 Тогда
		Колво=Объект.ЗаявкаНаОформление.Количество();
		Элементы.СтрКорзина.Заголовок="Корзина"+?(Колво=0,""," ("+Колво+")");
	КонецЕсли;
Конецпроцедуры

&НаКлиенте
Функция НовыйКодТаблицы(Таблица,Колонка)
	Код = Таблица.Количество();
	Последний = Таблица[Код-1][Колонка];
	Если Последний>=Код тогда Код=Последний+1;КонецЕсли;
	Отбор=Новый Структура(Колонка,Код);
	Пока Истина Цикл
		Если Таблица.НайтиСтроки(Отбор).Количество()=0 Тогда Прервать;КонецЕсли;
		Отбор[Колонка]=Отбор[Колонка]+1;
	КонецЦикла;
	Возврат Отбор[Колонка];
КонецФункции

&НаКлиенте
Процедура ЗаказыКлиентовПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если Лев(ВРЕГ(Элемент.ТекущиеДанные.Наименование),7)="КОРЗИНА" Тогда
		Сообщить("Заказ не может именоваться Корзина");
		Отказ=Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыКлиентовПриАктивизацииСтроки(Элемент)
	ТекСтр=Элементы.ЗаказыКлиентов.ТекущаяСтрока;
	ТекДан=Элементы.ЗаказыКлиентов.ТекущиеДанные;
	Если ТекДан<>Неопределено И ТекДан.Заказ<>Объект.ТекущийЗК Тогда 
		СменитьЗаявку(ТекДан.Заказ);
		ЕСли Не Элементы.ГруппаДокумент.Видимость Тогда Элементы.ГруппаДокумент.Видимость=Истина;КонецЕсли;
		Элементы.ЗаказыКлиентовВверх.Доступность=ТекДан.Заказ<>0 и ИзменятьКорзину;
		Элементы.ЗаказыКлиентов.ТолькоПросмотр=ТекДан.Заказ=0 или Не ИзменятьКорзину;
		Элементы.ЗаказНаименование.ТолькоПросмотр=ТекДан.Заказ=0 или Не ИзменятьКорзину;
		Элементы.ЗаказСтатус.ТолькоПросмотр=ТекДан.Заказ=0 или Не ИзменятьКорзину;
		Элементы.ЗаказДата.ТолькоПросмотр=ТекДан.Заказ=0 или Не ИзменятьКорзину;
		
		Если Элементы.ЗаказСклад.Видимость И Не ЗначениеЗаполнено(ТекДан.Склад) И ТипЗнч(ТекДан.Склад)<>ТипЗнч(Объект.Склад) Тогда 
			ТекДан.Склад=ОпределитьТип(Объект.Склад).ПривестиЗначение("");
		КонецЕсли;
		Если Элементы.ЗаказДоговор.Видимость И Не ЗначениеЗаполнено(ТекДан.Договор) И ТипЗнч(ТекДан.Договор)<>ТипЗнч(Объект.ДоговорДляЗаявки) Тогда 
			ТекДан.Договор=ОпределитьТип(Объект.ДоговорДляЗаявки).ПривестиЗначение("");
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СписокПользователейКорзины(ПользовательНеВключать)
	Отбор=Новый Структура("КлючОбъекта, КлючНастроек","ПомощникАвтобизнеса","Доступ");
	УстановитьПривилегированныйРежим(Истина);
	Выбор=ХранилищеОбщихНастроек.Выбрать(Отбор);
	Список=Новый СписокЗначений;
	Пока Выбор.Следующий() Цикл;
		Если Выбор.Пользователь<>ПользовательНеВключать Тогда
			Список.Добавить(Выбор.Пользователь, Выбор.Пользователь);
		КонецЕсли;
	КонецЦикла;	
	Возврат Список;
КонецФункции

&НаКлиенте
Процедура КорзинаСменитьПользователя(Команда)
	Список=СписокПользователейКорзины(ПользовательКорзины);
	Если Список.Количество()=0 Тогда Возврат;КонецЕсли;
	ОО=Новый ОписаниеОповещения("ПользовательКорзиныВыбран",ЭтаФорма);
	ПараметрыФормы=Новый Структура("СписокЗначений,Групповой,ТекущаяСтрока,Заголовок",
	Список,Ложь,0,"Выберите пользователя");
	ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ФормаСпискаУФ",
	ПараметрыФормы,ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно,, ОО,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПользовательКорзиныВыбран(Элемент,Изменять=Неопределено) Экспорт
	Если Элемент=Неопределено тогда Возврат;КонецЕсли;
	Если ИзменятьКорзину Тогда
		СохранитьДанныеПоКорзине(ПользовательКорзины);
	КонецЕсли;
	ПользовательКорзины=?(ТипЗнч(Элемент)=Тип("Строка"),Элемент,Элемент.Значение);
	ИзменятьКорзину = Изменять=Истина;
	РедактированиеКорзины(ИзменятьКорзину);
	Если Изменять = Неопределено Тогда 
		СендерОтправить("{""action"":""cart"",""name"":"""+ПользовательКорзины+""",""edit"":true}");	
	КонецЕсли;	
	ПользовательКорзиныВыбранНаСервере();
	ЗаказыКлиентовОтборВыполнить(Истина);
	ОбновитьЗаголовокКорзины();
	Элементы.ЗаказыКлиентов.ТекущаяСтрока=Объект.ЗаказыКлиентов[0].ПолучитьИдентификатор();
	ЗаказыКлиентовПриАктивизацииСтроки(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПользовательКорзиныВыбранНаСервере()
	БылЗК=Объект.ТекущийЗК;
	Обработка=РеквизитФормыВЗначение("Объект");
	Обработка.ЗагрузитьКорзины(ПользовательКорзины);
	ЗначениеВДанныеФормы(Обработка.ЗаказыКлиентов,Объект.ЗаказыКлиентов);	
	ЗначениеВДанныеФормы(Обработка.ЗаявкаНаОформление,Объект.ЗаявкаНаОформление);	
	МСтр=Объект.ЗаказыКлиентов.НайтиСтроки(Новый Структура("Заказ",БылЗК));
	Если МСтр.Количество()=0 Тогда
		БылЗК=0;
	КонецЕсли;
	Объект.ТекущийЗК=Неопределено;
	СменитьЗаявку(БылЗК);
	ЗаполнитьСтатусыВКорзине(ПользовательКорзины);
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыКлиентовНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	Выполнение=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыКлиентовВверх(Команда)
	ТекДан=Элементы.ЗаказыКлиентов.ТекущиеДанные;
	Индекс=Объект.ЗаказыКлиентов.Индекс(ТекДан);
	Если Индекс>1 Тогда
		Объект.ЗаказыКлиентов.Сдвинуть(Индекс,-1);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыКлиентовПередУдалениемОтвет(Ответ, Элемент) Экспорт
	Если Ответ=КодВозвратаДиалога.Да Тогда
		ТекДан=Элементы.ЗаказыКлиентов.ТекущиеДанные;
		Объект.ТекущийЗК=0-ТекДан.Заказ;
		НовСтр=ПолучитьСледующуюСтроку(Объект.ЗаказыКлиентов,ТекДан);
		Объект.ЗаказыКлиентов.Удалить(ТекДан);
		Элементы.ЗаказыКлиентов.ТекущаяСтрока=НовСтр;
	КонецЕсли;
Конецпроцедуры

&НаКлиенте
Процедура ЗаказыКлиентовПередУдалением(Элемент, Отказ)
	ТекДан=Элементы.ЗаказыКлиентов.ТекущиеДанные;
	Если ТекДан<>Неопределено Тогда
		Если ТекДан.Заказ=0 Тогда 
			Отказ=Истина;
		ИначеЕсли Объект.ЗаявкаНаОформление.Количество()=0 Тогда 
			Объект.ТекущийЗК=0-ТекДан.Заказ;
		Иначе
			ОО=Новый ОписаниеОповещения("ЗаказыКлиентовПередУдалениемОтвет",ЭтаФорма,Элемент);
			ПоказатьВопрос(ОО,"Удалить заявку клиента?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
			Отказ=Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыКлиентовПослеУдаления(Элемент)
	СохранитьДанныеПоКорзине();
КонецПроцедуры

&НаКлиенте
Функция ОпределитьТип(Ссылка)
	Типы=Новый Массив;
	Типы.Добавить(ТипЗнч(Ссылка));
	Возврат Новый ОписаниеТипов(Типы);
КонецФункции

&НаКлиенте
Процедура ОтборЗаказовКлиентов(Команда)
	ОО=Новый ОписаниеОповещения("ЗаказыКлиентовОтборВыполнить",ЭтаФорма);
	ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ОтборЗаказовКлиентовУФ",,ЭтаФорма,"ОтборЗаказовКлиентов",,,ОО,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры	

&НаКлиенте
Процедура ЗаказыКлиентовОтборВыполнить(ОтборИзменен, Парам2=Неопределено) Экспорт
	Если ОтборИзменен<>Истина Тогда Возврат;КонецЕсли;
	Для Каждого Стр Из Объект.ЗаказыКлиентов Цикл
		ЗаказКлиентаУстановитьОтбор(Стр);
	КонецЦикла;
	Элементы.ЗаказыКлиентов.ТекущаяСтрока=Объект.ЗаказыКлиентов[0].ПолучитьИдентификатор();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказКлиентаПриИзменении(Элемент)
	ТекДан=Элементы.ЗаказыКлиентов.ТекущиеДанные;
	ЕСли ТекДан<>Неопределено Тогда 
		ЗаказКлиентаУстановитьОтбор(ТекДан)	
	КонецЕсли;
	ЗаказПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗаказКлиентаУстановитьОтбор(Стр)
	Если Стр.Заказ=0 Тогда 
		Стр.Отбор=Истина ;
	ИначеЕсли НЕ ЗаказыКлиентовОтбор.Статусы[Стр.Статус].Пометка ТОгда
		Стр.Отбор=Ложь;
	ИначеЕсли ЗначениеЗаполнено(ЗаказыКлиентовОтбор.Контрагент)
		И ЗаказыКлиентовОтбор.Контрагент<>Стр.Контрагент Тогда
		Стр.Отбор=Ложь;
	ИначеЕсли ЗначениеЗаполнено(ЗаказыКлиентовОтбор.ДатаЗаказаС) 
		И ЗаказыКлиентовОтбор.ДатаЗаказаС>Стр.Дата Тогда
		Стр.Отбор=Ложь;
	ИначеЕсли ЗначениеЗаполнено(ЗаказыКлиентовОтбор.ДатаЗаказаПо) 
		И ЗаказыКлиентовОтбор.ДатаЗаказаПо<(Стр.Дата-86400) Тогда
		Стр.Отбор=Ложь;
	ИначеЕсли ЗначениеЗаполнено(ЗаказыКлиентовОтбор.ДатаОтгрузкиС) 
		И ЗаказыКлиентовОтбор.ДатаОтгрузкиС>Стр.Дата Тогда
		Стр.Отбор=Ложь;
	ИначеЕсли ЗначениеЗаполнено(ЗаказыКлиентовОтбор.ДатаОтгрузкиПо) 
		И ЗаказыКлиентовОтбор.ДатаОтгрузкиПо<(Стр.Дата-86400) Тогда
		Стр.Отбор=Ложь;
	Иначе
		Стр.Отбор=Истина;
	КонецЕсли;
КонецПроцедуры
		
&НаКлиенте
Процедура ЗаявкаНаОформлениеКолонки(Команда)
	ЕСли Команда.Имя="ЗаявкаКолонкиВсе" ТОгда
		Шаблон=Новый Структура("ЗаявкаНаОформлениеКодПроизводителя,ЗаявкаНаОформлениеДляКорзины,ЗаявкаНаОформлениеКодВКорзине",ИСтина,Истина,Истина);
		Для Каждого Колонка Из Элементы.ЗаявкаНаОформление.ПодчиненныеЭлементы Цикл
			Колонка.Видимость = НЕ Шаблон.Свойство(Колонка.Имя);
		КонецЦикла
	ИначеЕсли Команда.Имя="ЗаявкаКолонкиИзНастройки" ТОгда
		Шаблон=Новый Структура("Скидка,Склад,СтавкаНДС,Сумма,СуммаВсего,СуммаНДС,СуммаСоСкидкой,Цена,ЦенаПоставки,КодПроизводителя,ДляКорзины,КодВКорзине",
		Объект.БлокироватьКорзинаСкидка,Объект.БлокироватьКорзинаСкладПоставщика,
		Объект.БлокироватьКорзинаСтавкаНДС,Объект.БлокироватьКорзинаСумма,
		Объект.БлокироватьКорзинаСуммаВсего,Объект.БлокироватьКорзинаСуммаНДС,
		Объект.БлокироватьКорзинаСуммаСоСкидкой,Объект.БлокироватьКорзинаЦена,
		Объект.БлокироватьКорзинаЦенаПоставки,Истина,Истина,Истина);
		Для Каждого Колонка Из Элементы.ЗаявкаНаОформление.ПодчиненныеЭлементы Цикл
			Имя=Сред(Колонка.Имя,19);
			Колонка.Видимость = НЕ(Шаблон.Свойство(Имя) И Шаблон[Имя]);
		КонецЦикла
	Иначе
		Шаблон=Новый Структура(?(Команда.Имя="ЗаявкаКолонкиКлиента",
		"Выбран,Производитель,Артикул,Наименование,Количество,Цена,Сумма,Статус,Склад,Комментарий",
		"Выбран,Производитель,Артикул,Наименование,Количество,ЦенаПоставки,Сайт,Статус,Склад,Комментарий,СрокДоставки,СрокДоставкиМакс,Наличие,Поставщик"));
		Для Каждого Колонка Из Элементы.ЗаявкаНаОформление.ПодчиненныеЭлементы Цикл
			Колонка.Видимость = Шаблон.Свойство(Сред(Колонка.Имя,19));    //Убираем "ЗаявкаНаОформление"
		КонецЦикла
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеПоКорзине(Владелец=Неопределено)
	Если Владелец=Неопределено Тогда Владелец=ПользовательКорзины;КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	Данные=Объект.ЗаявкаНаОформление.Выгрузить();
	ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнесаЗК",Строка(Объект.ТекущийЗК),Данные,,Владелец);
	Данные=Объект.ЗаказыКлиентов.Выгрузить();
	ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса","ЗаказыКлиентов",Данные,,Владелец);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаСервере
// Процедура сохраняет в хранилище текущий заказ клиента (ТекущшийЗК), если он задан положительным числом
// Если число отрицательно то -ТекущшийЗК удаляется из хранилища.
// Если указан Заказ числом - загружает заказ с этим номером из хранилища, меняя номер текущего заказа
// Если Заказ=Истина - Заявка на оформление очищается
//
Процедура СменитьЗаявку(Заказ=Неопределено, Владелец=Неопределено)
	Если Владелец=Неопределено Тогда Владелец=ПользовательКорзины;КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	Если ТипЗнч(Объект.ТекущийЗК)=Тип("Число") и ИзменятьКорзину Тогда
		Если Объект.ТекущийЗК < 0 Тогда
			ХранилищеОбщихНастроек.Удалить("ПомощникАвтобизнесаЗК",Строка(0-Объект.ТекущийЗК),Владелец);
		Иначе	
			Данные=Объект.ЗаявкаНаОформление.Выгрузить();
			ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнесаЗК",Строка(Объект.ТекущийЗК),Данные,,Владелец);
		КонецЕсли;
	КонецЕсли;
	Если ТипЗнч(Заказ)=Тип("Число") Тогда
		Объект.ТекущийЗК=Заказ;
		Данные=ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнесаЗК",Строка(Заказ),,Владелец);
		Если ТипЗнч(Данные)=Тип("ТаблицаЗначений") Тогда
			Объект.ЗаявкаНаОформление.Загрузить(Данные);
			// Обновляем значения статуса заказа из заказов поставщиков
			Для Каждого Стр Из Объект.ЗаявкаНаОформление Цикл
				Если Стр.КодЗП<>0 И Не ПустаяСтрока(Стр.КодЗаказа) Тогда
					Строки=Объект.ЗаявкаПоставщику.НайтиСтроки(Новый Структура("Пользователь,КодСтроки",ПользовательКорзины,Стр.КодЗП));
					ЕСли Строки.Количество()>0 Тогда 
						Стр.Статус=?(ПустаяСтрока(Строки[0].СтатусПозиции),Строки[0].СтатусЗаказа,Строки[0].СтатусПозиции);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Объект.ЗаявкаНаОформление.Очистить();
		КонецЕсли;
	ИначеЕсли Заказ=Истина Тогда
		Объект.ЗаявкаНаОформление.Очистить();
	КонецЕсли;	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВключитьРедактированиеКорзины(Команда)
	СендерОтправить("{""action"":""cart"",""name"":"""+ПользовательКорзины+""",""edit"":true}");
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьРедактированиеКорзины(Команда)
	СендерОтправить("{""action"":""cart"",""name"":"""+ПользовательКорзины+""",""edit"":false}");
	РедактированиеКорзины(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеКорзины(Доступ)
	ТекДан=Элементы.ЗаказыКлиентов.ТекущиеДанные;
	Доступ0=?(ТекДан=Неопределено или ТекДан.Заказ=0,Ложь,Доступ);
	НеДоступ = Не Доступ;
	ДоступСвой=ПользовательКорзины=Объект.ПользовательИмя;
	Элементы.ЗаявкаПоставщикуУдалить.Доступность=ДоступСвой;
	Элементы.ОчиститьЗаказы.Доступность=ДоступСвой;
	Элементы.ВключитьРедактирование.Доступность=НеДоступ;
	Элементы.ОтключитьРедактирование.Доступность=Доступ;
	Элементы.ЗаказыКлиентовВниз.Доступность=Доступ;
	Элементы.ЗаказыКлиентовВверх.Доступность=Доступ0;
	Элементы.ОбновитьКорзину.Доступность=НеДоступ;
	Элементы.ЗаказыКлиентовУдалить.Доступность=Доступ;
	Элементы.ОформитьЗаказПокупателя.Доступность=
	?(Доступ,Объект.Реквизит1С.Заказ<>Неопределено,Ложь);
	
	Элементы.ЗаказыКлиентов.ТолькоПросмотр=Не Доступ0;
	Элементы.ЗаказНаименование.ТолькоПросмотр=Не Доступ0;
	Элементы.ЗаказСтатус.ТолькоПросмотр=Не Доступ0;
	Элементы.ЗаказДата.ТолькоПросмотр=Не Доступ0;
	
	Элементы.ЗаявкаНаОформление.ТолькоПросмотр=Не Доступ;
	Элементы.ЗаказКонтрагент.ТолькоПросмотр=Не Доступ;
	Элементы.ЗаказСоглашение.ТолькоПросмотр=Не Доступ;
	Элементы.ЗаказДоговор.ТолькоПросмотр=Не Доступ;
	Элементы.ЗаказСклад.ТолькоПросмотр=Не Доступ;
	Элементы.ЗаказДатаОтгрузки.ТолькоПросмотр=Не Доступ;
	
	Элементы.ПереносЗаказов.Видимость=ПользовательКорзины<>Объект.ПользовательИмя и Доступ=Истина;
	
	Кнопки=Новый Структура("УстановитьФлажки,СнятьФлажки,ЗаявкаНаОформлениеДобавить,
	|ЗаявкаНаОформлениеУдалить,ЗаявкаНаОформлениеОчистить,ВЗаказ,ЗаявкаНаОформлениеВверх,
	|ЗаявкаНаОформлениеВниз,ЗаявкаНаОформлениеКнопка3,ЗаказатьЕмекс");
	Для Каждого Кнопка из Кнопки Цикл
		Элементы[Кнопка.Ключ].Доступность=Доступ;
	КонецЦикла;
	ИзменятьКорзину=Доступ;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКорзину(Команда)
	ПользовательКорзиныВыбранНаСервере();
	ЗаполнитьСтатусыВКорзине(ПользовательКорзины);
	ОбновитьЗаголовокКорзины();
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаОформлениеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если ИзменятьКорзину Тогда
		СохранитьДанныеПоКорзине(ПользовательКорзины);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПриИзменении(Элемент=Неопределено)
	Если ИзменятьКорзину Тогда
		СохранитьДанныеПоКорзине(ПользовательКорзины);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатусыВКорзине(Владелец=Неопределено)
	Если Владелец=Неопределено Тогда Владелец=ПользовательКорзины;КонецЕсли;
	Строки=Объект.ЗаявкаПоставщику.НайтиСтроки(Новый Структура("Пользователь",Владелец));
	Для Каждого Строка из Строки Цикл
		МСтр=Объект.ЗаявкаНаОформление.НайтиСтроки(Новый Структура("КодЗП",Строка.КодСтроки));
		Если МСтр.Количество()>0 тогда 
			МСтр[0].Статус=?(ПустаяСтрока(Строка.СтатусПозиции),Строка.СтатусЗаказа,Строка.СтатусПозиции);
		КонецЕсли;
	КонецЦикла;
Конецпроцедуры

&НаКлиенте
Процедура ЗаявкаПоставщикуСтатусПриИзменении(Элемент)
	СохранитьКорзину=Ложь;
	Стр=Элементы.ЗаявкаПоставщику.ТекущиеДанные;

	СендерОтправить("{""table"":""ordered"", ""action"":""edit"",""status"":"""+Стр.СтатусПозиции
	+""",""idData"":"+Формат(Стр.КодСтроки,"ЧГ=;ЧН=")+",""name"":"""+Стр.Пользователь+"""}");  //",""data"":"+Строка+
	Если ПользовательКорзины=Стр.Пользователь Тогда
		Стрк=Объект.ЗаявкаНаОформление.НайтиСтроки(Новый Структура("КодЗП",Стр.КодСтроки));
		Если Стрк.Количество()>0 Тогда
			Стрк[0].Статус=Стр.СтатусПозиции;
			СохранитьКорзину=Истина;
		КонецЕсли;
	КонецЕсли;
	Если СохранитьКорзину И ИзменятьКорзину Тогда
		СохранитьДанныеПоКорзине(ПользовательКорзины);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОбновитьСтатусыЗаявкиНаСервере(Связки)
	Обработка=РеквизитФормыВЗначение("Объект");
	Возврат Обработка.ОбновитьСтатусыПроценки(Объект.ЗаявкаПоставщику,Связки);	
КонецФункции

&НаКлиенте
Процедура ОбновитьСтатусыЗаявки(Команда)
	ТекДан=Элементы.ЗаказыКлиентов.ТекущиеДанные;
	Если ТекДан=Неопределено тогда Возврат;КонецЕсли;
	Строки=Объект.ЗаявкаНаОформление.НайтиСтроки(Новый Структура("Выбран",Истина));
	Если Строки.Количество()=0 Тогда
		Строки=Объект.ЗаявкаНаОформление;
		Если Строки.Количество()=0 ТОгда Возврат;КонецЕсли;
	    Отмеченных="";
	Иначе
		Отмеченных="выбранных";
	КонецЕсли;
	Связки=Новый Массив;
	Для Каждого Стр из Строки Цикл
		Если Стр.КодЗП<>0 И Не ПустаяСтрока(Стр.КодЗаказа) Тогда
			Связки.Добавить(Новый Структура("Пользователь,КодСтроки",ПользовательКорзины,Стр.КодЗП));
		КонецЕсли;
	КонецЦикла;
	Если Связки.Количество()=0 Тогда
		Сообщить("Среди "+Отмеченных+" строк заявки не найдены строки, отправленные на сайт");
		Возврат;
	КонецЕсли;
	
	КодыСтрок=ОбновитьСтатусыЗаявкиНаСервере(Связки);
	
	Если КодыСтрок.Количество()=0 Тогда Возврат;КонецЕсли;
	
	Для Каждого Значение из КодыСтрок Цикл
		Мстр=Объект.ЗаявкаПоставщику.НайтиСтроки(Значение);
		Если Мстр.Количество()>0 Тогда
			Стр=Мстр[0];
			Статус=?(ПустаяСтрока(Стр.СтатусПозиции),Стр.СтатусЗаказа,Стр.СтатусПозиции);
			СендерОтправить("{""table"":""ordered"", ""action"":""edit"",""status"":"""+Статус
			+""",""idData"":"+Формат(Стр.КодСтроки,"ЧГ=;ЧН=")+",""name"":"""+ПользовательКорзины+"""}"); 
			
			Стрк=Объект.ЗаявкаНаОформление.НайтиСтроки(Новый Структура("КодЗП",Стр.КодСтроки));
			Если Стрк.Количество()>0 Тогда Стрк[0].Статус=Статус;КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Пользователи=Новый Соответствие;
	Пользователи.Вставить(ПользовательКорзины);
	СохранитьДанныеПоЗаказамПоставщикам(Пользователи);
	СохранитьДанныеПоКорзине(ПользовательКорзины);

КонецПроцедуры

&НаКлиенте
Процедура ВЗаявку(Команда)
	ТекДан=Элементы.ЗаявкаПоставщику.ТекущиеДанные;
	Если ТекДан=Неопределено тогда Возврат;КонецЕсли;
	Если ТекДан.Пользователь<>ПользовательКорзины Тогда
		Сообщить("Сейчас идет работа с корзиной другого пользователя");
	Иначе
		Строки=Объект.ЗаявкаНаОформление.НайтиСтроки(Новый Структура("КодЗП",ТекДан.Кодстроки));
		Если Строки.Количество()=0 Тогда
			КодЗП=ТекДан.Кодстроки;
			Если Не НайтиЗаявку(КодЗП) Тогда
				Сообщить("В корзине этой строки нет");
				Возврат;
			КонецЕсли;
			Строки=Объект.ЗаказыКлиентов.НайтиСтроки(Новый Структура("Заказ",Объект.ТекущийЗК));
			Элементы.ЗаказыКлиентов.ТекущаяСтрока=Строки[0].ПолучитьИдентификатор();
			Строки=Объект.ЗаявкаНаОформление.НайтиСтроки(Новый Структура("КодЗП",КодЗП));
		КонецЕсли;
		Строка=Строки[0];
		Элементы.ЗаявкаНаОформление.ТекущаяСтрока=Строка.ПолучитьИдентификатор();
		Элементы.Страницы.ТекущаяСтраница=Элементы.СтрКорзина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКонтрагентДляЗаявкиСоздание(Элемент, СтандартнаяОбработка)	
	Если Объект.Конфигурация = "УправлениеТорговлей 11.4" Тогда
		ОткрыватьСправочникПартнеров = ИспользоватьПартнеровКакКонтрагентов();
		Если ОткрыватьСправочникПартнеров Тогда
			СтандартнаяОбработка = Ложь;
			
			ПараметрыФормы = Новый Структура;
			Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияФормыВводаПартнера", ЭтаФорма);
			ОткрытьФорму("Справочник.Партнеры.Форма.ПомощникНового", ПараметрыФормы,ЭтаФорма,,,,Оповещение);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИспользоватьПартнеровКакКонтрагентов()
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровКакКонтрагентов");
КонецФункции

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияФормыВводаПартнера(Результат, ДополнительныеПараметры) Экспорт
	ВыполнитьПослеЗакрытияФормыВводаПартнераНаСервере(Результат);
	Если ЗначениеЗаполнено(Объект.КонтрагентДляЗаявки) Тогда
		КонтрагентДляЗаявкиПриИзменении("");
	Конецесли;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПослеЗакрытияФормыВводаПартнераНаСервере(Результат)
	Если ЗначениеЗаполнено(Результат) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Контрагенты.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Партнер = &Партнер";
		Запрос.УстановитьПараметр("Партнер", Результат);
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		Объект.КонтрагентДляЗаявки = Выборка.Ссылка;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказКонтрагентСоздание(Элемент, СтандартнаяОбработка)
	Если Объект.Конфигурация = "УправлениеТорговлей 11.4" Тогда
		ОткрыватьСправочникПартнеров = ИспользоватьПартнеровКакКонтрагентов();
		Если ОткрыватьСправочникПартнеров Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура;
			Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияФормыВводаПартнера", ЭтаФорма);
			ОткрытьФорму("Справочник.Партнеры.Форма.ПомощникНового", ПараметрыФормы,ЭтаФорма,,,,Оповещение);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьСуммы(ТекущиеДанные) Экспорт
	Попытка
		Если Не ЗначениеЗаполнено(ТекущиеДанные.СтавкаНДС) Тогда
			Ставка=20;
		Иначе
			Ставка=ТекущиеДанные.СтавкаНДС.Ставка;
		КонецЕсли;
	Исключение
		СтавкаНДС=Строка(ТекущиеДанные.СтавкаНДС);
		Если Найти(СтавкаНДС,"20")>0 Тогда
			Ставка=20;
		ИначеЕсли Найти(СтавкаНДС,"18")>0 Тогда
			Ставка=18;
		ИначеЕсли Найти(СтавкаНДС,"10")>0 Тогда	
			Ставка=10;
		Иначе
			Ставка=0;
		КонецЕсли;			
	Конецпопытки;
	
	ТекущиеДанные.Сумма=ТекущиеДанные.Цена*ТекущиеДанные.Количество;
	//Если в текущих данных не определен процент скидки - Сумма со скидкой - не расчитывается
	Попытка
		СкидкаКоэф=?(ТекущиеДанные.Скидка=0,1,1-ТекущиеДанные.Скидка/100);
	    ТекущиеДанные.СуммаСоСкидкой=ТекущиеДанные.Сумма*?(ТекущиеДанные.Скидка=0,1,1-ТекущиеДанные.Скидка/100);
		ТекущиеДанные.СуммаНДС=ТекущиеДанные.СуммаСоСкидкой*(1-1/(1 + Ставка / 100));
		ТекущиеДанные.Всего=ТекущиеДанные.СуммаСоСкидкой;
	Исключение
		ТекущиеДанные.СуммаНДС=ТекущиеДанные.Сумма*(1-1/(1 + Ставка / 100));
		ТекущиеДанные.Всего=ТекущиеДанные.Сумма;
	Конецпопытки;	
	
КонецПроцедуры

&НаСервере
Функция НайтиЗаявку(КодЗП)
	Строка=Неопределено;
	Для Каждого Стр из Объект.ЗаказыКлиентов Цикл
		Если Стр.Заказ = Объект.ТекущийЗК Тогда Продолжить;КонецЕсли;
		Данные=ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнесаЗК",Строка(Стр.Заказ),,ПользовательКорзины);
		Если ТипЗнч(Данные)=Тип("ТаблицаЗначений") Тогда
			Строка=Данные.Найти(КодЗП,"КодЗП");
			Если Строка<>Неопределено Тогда 				
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если Строка<>Неопределено Тогда 
		СменитьЗаявку(Стр.Заказ);
		Возврат Истина;
	Иначе
		Возврат Ложь;		
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ВДокумент(Команда)
	// Формируем массив наименований возможных документв
    Строки=Объект.ЗаявкаНаОформление.НайтиСтроки(Новый Структура("Выбран",Истина));
	Если Строки.Количество()=0 Тогда
		ПоказатьПредупреждение(,"Нет выбранных строк для переноса");
		Возврат;
	КонецЕсли;
	
	Документы=Новый Массив;
	Если Объект.Реквизит1С.Заказ<>Неопределено Тогда
		Документы.Добавить(Объект.Реквизит1С.Заказ);
	КонецЕсли;
	Документы.Добавить("ЗаказНаряд");
	Документы.Добавить("асЗаказНаряд");
	Документы.Добавить("асЗаявкаНаРемонт");
	Если Объект.Реквизит1С.Реализация<>Неопределено Тогда
		Документы.Добавить(Объект.Реквизит1С.Реализация);
	КонецЕсли;
	Если Объект.Реквизит1С.СчетФактураВыданный<>Неопределено Тогда
		Документы.Добавить(Объект.Реквизит1С.СчетФактураВыданный);
	КонецЕсли;
	
	// Формируем список форм
	ВсеОкна=ПолучитьОкна();
	Формы=Новый СписокЗначений;
	ИменаДокументов=Новый СписокЗначений;
	Инд=0;
	Для Каждого Окна из ВсеОкна Цикл
		ФормыОкна=Окна.Содержимое;
		Для Каждого Форма из ФормыОкна Цикл
			Если Лев(Форма.ИмяФормы,9)="Документ." И Прав(Форма.ИмяФормы,15)=".ФормаДокумента" и Форма.Открыта() Тогда
				ИмяДокумента=Сред(Форма.ИмяФормы,10,СтрДлина(Форма.ИмяФормы)-30);
				Если Документы.Найти(ИмяДокумента)<>Неопределено Тогда
					Формы.Добавить(Форма,,ИмяДокумента=Объект.Реквизит1С.Заказ);
					НаименованиеДокумента=Строка(Форма.Объект.Ссылка);
					Если ПустаяСтрока(НаименованиеДокумента) Тогда
						НаименованиеДокумента=СинонимДокумента(ИмяДокумента)+ " (создание)- без сохранения ссылки";
					КонецЕсли;
					ИменаДокументов.Добавить(Инд,Строка(НаименованиеДокумента));
					Инд=Инд+1;
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Если Формы.Количество()>0 тогда
		ОО=Новый ОписаниеОповещения("ВДокументЗаполнить",ЭтаФорма,Формы);
		ПараметрыФормы=Новый Структура("СписокЗначений,Групповой,ТекущаяСтрока,Заголовок",
			ИменаДокументов,Ложь,0,"Выберите документ для загрузки товара");
		ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ФормаСпискаУФ",
			ПараметрыФормы,ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно,,ОО,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;		
КонецПроцедуры

&НаСервере
Функция СинонимДокумента(Имя)
	Попытка
		Возврат Метаданные.Документы[Имя].Синоним;
	Исключение
		Возврат Имя;
	Конецпопытки;
КонецФункции

&НаКлиенте
Процедура ВДокументЗаполнить(Документ,Формы) Экспорт
	Если Документ=Неопределено Тогда Возврат;КонецЕсли;
    Строки=Объект.ЗаявкаНаОформление.НайтиСтроки(Новый Структура("Выбран",Истина));
	Форма=Формы[Документ.Значение].Значение;
	ЭтоЗаказ=Формы[Документ.Значение].Пометка;
	ФормаОбъект=Форма.Объект;
	ДокументСсылка=ФормаОбъект.Ссылка;
	// Заполняем данные из текущей заявки
	текДан=Элементы.ЗаказыКлиентов.ТекущиеДанные;
	Объект.СкладДляЗаявки=ТекДан.Склад;
	Объект.ДоговорДляЗаявки=ТекДан.Договор;

	// Проверка на не созданную номенклатуру
	//СрокДоставки=0;
	Для Каждого Стр Из Строки Цикл
		//СрокДоставки=Макс(СрокДоставки,Стр.СрокДоставки,Стр.СрокДоставкиГарантированный); 
		Если НЕ ЗначениеЗаполнено(Стр.Номенклатура) Тогда
			Стр.Номенклатура=СоздатьНоменклатуруВДокумент(Новый Структура("Артикул,НаименованиеДетали,Производитель", Стр.Артикул, Стр.Наименование, Стр.Производитель));
		КонецЕсли;
	КонецЦикла;
	
	ДатаОтгрузки=ТекущаяДата();
	
	имя=ПолучитьМетаданныеТовараНаСервере(ДокументСсылка);
	Если имя.Товары=Неопределено Тогда
		ПоказатьПредупреждение(,"Данный документ не поддерживается, так как не содержит товары");
		Возврат;
	КонецЕсли;
	НомСтр=ФормаОбъект[имя.Товары].Количество();
	СуммаДокумента=0;
	СуммаНДСДокумента=0;
	Для Каждого Стр Из Строки Цикл
		Нов=ФормаОбъект[имя.Товары].Добавить();
		НомСтр=НомСтр+1;
		Если имя.ИдентификаторСтроки Тогда Нов.ИдентификаторСтроки=Новый Уникальныйидентификатор; КонецЕсли;
		Если имя.КодСтроки<>Неопределено Тогда Нов[имя.КодСтроки]=НомСтр;КонецЕсли;
			
		// Заполняем номенклатуру цены, скидки
	    ЗаполнитьЗначенияСвойств(Нов,Стр,"Количество,Номенклатура,СтавкаНДС");
		
		Если имя.Всего Тогда Нов.Всего=Стр.Всего;КонецЕсли;
		Если имя.СуммаНДС Тогда Нов.СуммаНДС=Стр.СуммаНДС;КонецЕсли;
		СуммаДокумента=СуммаДокумента+Стр.Всего;
		СуммаНДСДокумента=СуммаНДСДокумента+Стр.СуммаНДС;
		
		Если имя.Упаковок<>Неопределено Тогда Нов[имя.Упаковок]=Стр.Количество;КонецЕсли;
		Если имя.Коэффициент Тогда Нов.Коэффициент=1;КонецЕсли;
		
		//Если Стр.Скидка<>0 и имя.Скидка<>Неопределено Тогда
		//	Нов[имя.Скидка]=Стр.Скидка;
		//КонецЕсли;
		Количество=?(Стр.Количество=0,1,Стр.Количество);
		Если Имя.НДСВЦене Тогда
			Нов.Сумма=Стр.Сумма-Стр.СуммаНДС;
			//Если Стр.Скидка=0 Тогда
				Нов.Цена=стр.Цена;
				Если имя.ЦенаБезСкидки тогда 
					Нов.ЦенаБезСкидки=Нов.Цена;
					Нов.ВсегоБезСкидки=Стр.Всего;
				КонецЕсли;
			//Иначе
			//	Если имя.ЦенаБезСкидки тогда 
			//		Нов.ЦенаБезСкидки=Стр.Цена;
			//		Нов.ВсегоБезСкидки=Стр.Сумма;
			//		Нов.Цена=Стр.Всего/Количество;
			//	Иначе
			//		Нов.Цена=Стр.Цена;
			//	КонецЕсли;
			//	Если имя.Скидка<>Неопределено Тогда Нов[имя.Скидка]=Стр.Скидка;КонецЕсли;
			//	Если имя.СуммаСкидки<>Неопределено Тогда Нов[имя.СуммаСкидки]=Стр.Сумма-Стр.СуммаСоСкидкой;КонецЕсли;
			//		
			//КонецЕсли;
			Если имя.Сумма Тогда Нов.Сумма=Стр.Всего; КонецЕсли;
		Иначе   // НДС отдельно
			СоСкидкой=Стр.Всего-Стр.СуммаНДС;
			Скидка=0; //СоСкидкой*Стр.Скидка/(100-Стр.Скидка);
			Сумма=СоСкидкой; //+Скидка;
			Цена=Окр(Сумма/Количество,2);
			
			Если имя.ЦенаБезСкидки тогда 
				Нов.ЦенаБезСкидки=Цена;
				Нов.ВсегоБезСкидки=Сумма;
				Нов.Цена=Окр(СоСкидкой/Количество,2);
			Иначе
				Нов.Цена=Цена;
			КонецЕсли;
			//Если Стр.Скидка>0 Тогда
			//	Если имя.Скидка<>Неопределено Тогда Нов[имя.Скидка]=Стр.Скидка;КонецЕсли;
			//	Если имя.СуммаСкидки<>Неопределено Тогда Нов[имя.СуммаСкидки]=Скидка;КонецЕсли;
			//КонецЕсли;
			Если имя.Сумма Тогда Нов.Сумма=Сумма; КонецЕсли;
		КонецЕсли;		
		Если имя.СуммаВсего Тогда Нов.СуммаВсего=Стр.Всего; КонецЕсли;
		Если имя.СуммаСНДС Тогда Нов.СуммаСНДС=Стр.Всего; КонецЕсли;
		
		Если имя.ДатаОтгрузки<>Неопределено Тогда 
			Нов[имя.ДатаОтгрузки]=ДатаОтгрузки+?(ТипЗнч(Стр.СрокДоставки)=Тип("Число"),
			?(ТипЗнч(Стр.СрокДоставкиГарантированный)=Тип("Число"),Макс(Стр.СрокДоставки,Стр.СрокДоставкиГарантированный)*86400,Стр.СрокДоставки),
			?(ТипЗнч(Стр.СрокДоставкиГарантированный)=Тип("Число"),Стр.СрокДоставкиГарантированный,0))*86400;
		КонецЕсли;
		
		Если имя.Заказ<>Неопределено и значениеЗаполнено(Стр.ЗаказПокупателя) Тогда
			Нов[имя.Заказ]=Стр.ЗаказПокупателя;
		КонецЕсли;
		
		Если имя.Поставщик и ЗначениеЗаполнено(Стр.Поставщик) Тогда 
			Нов.Поставщик = Стр.Поставщик;
		КонецЕсли;
		
		ЕСли имя.РеквизитыНоменклатуры.Количество()>0 Тогда
			ЗаполнитьЗначенияСвойствНаСервере(имя.РеквизитыНоменклатуры, Стр.Номенклатура);
			Для Каждого рекв из имя.РеквизитыТоваров Цикл
				Нов[рекв.Значение]=имя.РеквизитыНоменклатуры[рекв.Ключ]
			КонецЦикла;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Нов,имя.Значения);
		
		Если ЭтоЗаказ Тогда 
			Стр.ЗаказПокупателя=ДокументСсылка; 
			Если Объект.ЗаказВКомментарий Тогда
				Стр.Комментарий=Строка(ДокументСсылка)+"; "+Стр.Комментарий;
			КонецЕсли;
		ИначеЕсли Лев(ДокументСсылка,11)="Заказ-наряд" Тогда 
			Стр.Комментарий=Строка(ДокументСсылка)+"; "+Стр.Комментарий;
		КонецЕсли;
				
	КонецЦикла;
	
	Если имя.СуммаДокумента Тогда 
		ФормаОбъект.СуммаДокумента=ФормаОбъект.СуммаДокумента+СуммаДокумента;
	КонецЕсли;
	Если имя.СуммаНоменклатурыДокумента Тогда 
		ФормаОбъект.СуммаНоменклатурыДокумента=ФормаОбъект.СуммаНоменклатурыДокумента+СуммаДокумента;
	КонецЕсли;
	Если имя.СуммаНДСДокумента Тогда 
		ФормаОбъект.СуммаНДСДокумента=ФормаОбъект.СуммаНДСДокумента+СуммаНДСДокумента;
	КонецЕсли;
	
	// Реквизиты формы - структура ключ - имя реквизита, значение Истина - сумма документа, ложь - НДС документа
	РеквизитыСуммыДокумента=Новый Структура("ИтогВсего,СуммаБезСкидки,СуммаВсего,СуммаЗаказано,
	|СуммаЗаказаноСЗалоговойТарой,СуммаКредитаПослеОтгрузки");
	ЗаполнитьЗначенияСвойств(РеквизитыСуммыДокумента,Форма);
	Для Каждого Стр из РеквизитыСуммыДокумента Цикл
		Если Стр.Значение <> Неопределено Тогда 
			Форма[Стр.Ключ]=Форма[Стр.Ключ]+СуммаДокумента;
		КонецЕсли;	
	КонецЦикла;
	
	РеквизитыНДСДокумента=Новый Структура("ИтогСуммаНДС,СуммаНДС,СуммаНДСЗаказано");
	ЗаполнитьЗначенияСвойств(РеквизитыНДСДокумента,Форма);
	Для Каждого Стр из РеквизитыНДСДокумента Цикл
		Если Стр.Значение<>Неопределено Тогда 
			Форма[Стр.Ключ]=Форма[Стр.Ключ]+СуммаНДСДокумента;
		КонецЕсли;	
	КонецЦикла;
	
	Если имя.ЭтапыГрафикаОплаты Тогда
		Попытка
			Если ФормаОбъект.ЭтапыГрафикаОплаты.Количество()>0 Тогда
				Форма.СуммаКОплате=Форма.СуммаКОплате+СуммаДокумента;
				ФормаОбъект.ЭтапыГрафикаОплаты[0].СуммаПлатежа=ФормаОбъект.ЭтапыГрафикаОплаты[0].СуммаПлатежа+СуммаДокумента;
			КонецЕсли;
		Исключение
		Конецпопытки;		
	КонецЕсли;
	
	Форма.Активизировать();

Конецпроцедуры

&НаСервере
Функция ПолучитьМетаданныеТовараНаСервере(Ссылка)
	
	// Определяем структуры для возврата
	имя=Новый структура;
	значения=Новый Структура;
	
	// Определим имя табличной части
	МетаТаб=Ссылка.Метаданные().ТабличныеЧасти.Найти("Товары");
	Если МетаТаб=Неопределено Тогда
		МетаТаб=Ссылка.Метаданные().ТабличныеЧасти.Найти("Запасы");
		Если МетаТаб=Неопределено Тогда 
			имя.Вставить("Товары",Неопределено);
			Возврат имя;
		КонецЕсли;
		имя.Вставить("Товары","Запасы");
	иначе
		имя.Вставить("Товары","Товары");
	КонецЕсли;
	МетаТаб=МетаТаб.Реквизиты;
	
	// Определим договор документа
	МетаДок=Ссылка.Метаданные().Реквизиты;
	имяДоговор=РеквизитИзСписка(Метадок,"Договор,ДоговорКонтрагента,ДоговорВзаиморасчетов");
	Если имяДоговор=Неопределено Тогда
		Договор=Объект.ДоговорДляЗаявки;
		//имяДоговор=?(Договор=Неопределено,Неопределено,Договор.Метаданные().Имя);
	Иначе
		Договор=Ссылка[имяДоговор];
	КонецЕсли;
	
	// Определим НДСВЦене
	имяНДСВЦене=РеквизитИзСписка(МетаДок,"СуммаВключаетНДС,ЦенаВключаетНДС,НДСВключатьВСтоимость");
	имя.Вставить("НДСВЦене",?(имяНДСВЦене=Неопределено,Истина,Ссылка[имяНДСВЦене]));
	
	// Реквизиты
	имя.Вставить("Скидка",РеквизитИзСписка(МетаТаб,"ПроцентСкидки, ПроцентСкидкиНаценки, ПроцентСкидкиСтроки, ПроцентРучнойСкидки"));
	имя.Вставить("РучнаяСкидка",МетаТаб.Найти("РучнаяСкидка")<>Неопределено);
	имя.Вставить("СуммаСкидки",РеквизитИзСписка(МетаТаб,"СуммаСкидки,СуммаСкидкиСтроки,СуммаРучнойСкидки"));
	имя.Вставить("ЦенаБезСкидки",МетаТаб.Найти("ЦенаБезСкидки")<>Неопределено);
	имя.Вставить("Всего",МетаТаб.Найти("Всего")<>Неопределено);
	имя.Вставить("Сумма",МетаТаб.Найти("Сумма")<>Неопределено);
	имя.Вставить("СуммаВсего",МетаТаб.Найти("СуммаВсего")<>Неопределено);
	имя.Вставить("СуммаСНДС",МетаТаб.Найти("СуммаСНДС")<>Неопределено);
	имя.Вставить("СуммаНДС",МетаТаб.Найти("СуммаНДС")<>Неопределено);
	имя.Вставить("Упаковок",РеквизитИзСписка(МетаТаб,"КоличествоУпаковок,КоличествоБазовое"));
	имя.Вставить("Коэффициент",МетаТаб.Найти("Коэффициент")<>Неопределено);
	имя.Вставить("ИдентификаторСтроки",МетаТаб.Найти("ИдентификаторСтроки")<>Неопределено);
	имя.Вставить("КодСтроки",РеквизитИзСписка(МетаТаб,"КлючСтроки,КодСтроки,ор_КодСтроки,МаксимальныйКодСтроки"));
	имя.Вставить("ДатаОтгрузки",РеквизитИзСписка(МетаТаб,"ДатаОтгрузки,СрокПоставки"));
	
	имя.Вставить("СуммаДокумента",МетаДок.Найти("СуммаДокумента")<>Неопределено);
	имя.Вставить("СуммаНоменклатурыДокумента",МетаДок.Найти("СуммаНоменклатурыДокумента")<>Неопределено);
	имя.Вставить("СуммаНДСДокумента",МетаДок.Найти("СуммаНДСДокумента")<>Неопределено);
	//  ЗначениеСкидкиНаценки,СуммаСкидкиНаценки,СуммаСписания,СуммаСписанияБезНДС
	//  СуммаРасчетная, СогласованнаяСумма
	
	РеквизитыНоменклатуры=Новый Структура;
	РеквизитыТоваров=Новый Структура;
	
	ЕСли МетаТаб.Найти("ЕдиницаИзмерения")<>Неопределено Тогда
		рекв=РеквизитИзСписка(Метаданные.Справочники.Номенклатура.Реквизиты,
		"ЕдиницаХраненияОстатков,ОсновнаяЕдиницаИзмерения,ЕдиницаИзмерения");
		Если рекв<>Неопределено Тогда
			РеквизитыНоменклатуры.Вставить(рекв);
			РеквизитыТоваров.Вставить(рекв,"ЕдиницаИзмерения");
		КонецЕсли;	
	КонецЕсли;
	
	ЕСли МетаТаб.Найти("Производитель")<>Неопределено Тогда
		рекв=РеквизитИзСписка(Метаданные.Справочники.Номенклатура.Реквизиты,
		"ор_Производитель,асПроизводитель,Производитель,Поставщик,ор_Поставщик");
		Если рекв<>Неопределено Тогда
			РеквизитыНоменклатуры.Вставить(рекв);
			РеквизитыТоваров.Вставить(рекв,"Производитель");
		КонецЕсли;	
	КонецЕсли;
	
	Если Объект.Конфигурация = "УправлениеТорговлей 11.4" Тогда
		рекв=РеквизитИзСписка(Метаданные.Справочники.Номенклатура.Реквизиты,"Артикул");
		Если рекв<>Неопределено Тогда
			РеквизитыНоменклатуры.Вставить(рекв);
			РеквизитыТоваров.Вставить(рекв,"Артикул");
		КонецЕсли;	
	КонецЕсли;
	
	имя.Вставить("Поставщик",МетаТаб.Найти("Поставщик")<>Неопределено);
	
	имя.Вставить("РеквизитыНоменклатуры",РеквизитыНоменклатуры);
	имя.Вставить("РеквизитыТоваров",РеквизитыТоваров);
	
	Если МетаТаб.Найти("ВариантОбеспечения")<>Неопределено Тогда
		Значения.Вставить("ВариантОбеспечения",Объект.ПоУмолчанию.ВариантОбеспечения.Значение); //Перечисления.ВариантыОбеспечения.Требуется);
	КонецЕсли;
	Если МетаТаб.Найти("ВидЦены")<>Неопределено Тогда
		Если ЗначениеЗаполнено(Договор) Тогда
			имяТипЦен=РеквизитИзСписка(Договор.Метаданные().Реквизиты,"ТипЦен,ВидЦен,КатегорияЦен,ТипЦенПродажи");
			Если имяТипЦен<>Неопределено Тогда
				ТипЦен=Договор[имяТипЦен];
			КонецЕсли;
		Иначе
			ТипЦен=НЕопределено;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(типЦен) Тогда
			ТипЦен=Объект.ТипЦен;
		КонецЕсли;
		значения.Вставить("ВидЦены",ТипЦен);
	КонецЕсли;
	имяСклад=РеквизитИзСписка(МетаТаб,"Склад,СкладКомпании,Размещение");
	ЕСли имяСклад<>Неопределено тогда
		имя2Склад=РеквизитИзСписка(МетаДок,"Склад,СкладКомпании,СкладГруппа");
		Если имя2Склад=Неопределено Тогда
			Склад=объект.СкладДляЗаявки;
		Иначе
			Склад=ссылка[имя2Склад];
		КонецЕсли;
		значения.Вставить(имяСклад,Склад);
	КонецЕсли;
	Если МетаТаб.Найти("ТипНоменклатурыЗапас")<>Неопределено Тогда
		значения.Вставить("ТипНоменклатурыЗапас",Истина);
	КонецЕсли;
	Если МетаТаб.Найти("Качество")<>Неопределено Тогда
		значения.Вставить("Качество",Справочники.Качество.Новый);
	КонецЕсли;
	Если МетаТаб.Найти("СпособСписанияОстаткаТоваров")<>Неопределено Тогда
		значения.Вставить("СпособСписанияОстаткаТоваров",Перечисления.СпособыСписанияОстаткаТоваров.СоСклада);
	КонецЕсли;
	имя.Вставить("Заказ",РеквизитИзСписка(МетаТаб,"Заказ,ЗаказКлиента,ЗаказПокупателя,ор_ЗаказПокупателя,ИзЗаказаПокупателя"));
	//Если имяЗаказ<>Неопределено Тогда
		//имя2Заказ=РеквизитИзСписка(МетаДок,"Заказ,ЗаказКлиента,ЗаказПокупателя,Сделка,ДокументОснование");
		//Если имя2Заказ<>Неопределено Тогда
		//	значения.Вставить(имяЗаказ,ссылка[имя2Заказ]);
		//КонецЕсли;
	//КонецЕсли;
	
	//Если Ссылка.Метаданные().ТабличныеЧасти.Найти("ЭтапыГрафикаОплаты")<>Неопределено Тогда
	//	имя.Вставить("ЭтапыГрафикаОплаты",Новый Структура("ВариантОплаты,ДатаПлатежа,ПроцентПлатежа",
	//	Перечисления.ВариантыОплатыКлиентом.КредитПослеОтгрузки,ТекущаяДата(),100));
	//КонецЕсли;
	//СуммаЗаказано,СуммаЗаказаноСЗалоговойТарой,СуммаКредитаПослеОтгрузки,СуммаНДСЗаказано
	Имя.Вставить("ЭтапыГрафикаОплаты",Ссылка.Метаданные().ТабличныеЧасти.Найти("ЭтапыГрафикаОплаты")<>Неопределено);
	
	имя.Вставить("Значения",значения);
	// расчет на основании значения: НДСВключатьВСтоимость,СуммаВключаетНДС, ЦенаВключаетНДС
	// ВариантОбеспечения, ВидЦены(ТипЦены),Всего,ДатаОтгрузки,ЕдиницаИзмерения(Номенклатура[ЕИ]),
	// ИдентификаторСтроки, КлючСтроки,КодСтроки,МаксимальныйКодСтроки,
	// Количество, КоличествоУпаковок,Коэффициент, Номенклатура, Поставщик,
	// Производитель,ПроцентРучнойСкидки,ПроцентСкидки, ПроцентСкидкиНаценки,ПроцентСкидкиСтроки ,
	// РучнаяСкидка,Размещение,Склад,СкладКомпании, СтавкаНДС, Сумма, СуммаВсего,СуммаВсего, СуммаСкидкиСтроки
	// СуммаРучнойСкидки, СуммаСкидки, СуммаСНДС,СуммаНДС, ТипНоменклатурыЗапас,
	// ЦенаБезСкидки, Цена, ВсегоБезСкидки,СрокПоставкиВСтроке, Комментарий,
	// Заказ,ЗаказКлиента, ЗаказПокупателя, ор_ЗаказПокупателя, ИзЗаказаПокупателя,
	// Качество,КоличествоБазовое,ор_КодСтроки,СпособСписанияОстаткаТоваров,  

	Возврат имя;
КонецФункции

&НаСервере
Функция СоздатьНоменклатуруВДокумент(Запись)
	Обработка = РеквизитФормыВЗначение("Объект");
	Возврат Обработка.ПолучитьНоменклатуруТовара(Запись, Истина);
КонецФункции

&НаСервереБезКонтекста
Функция РеквизитИзСписка(Реквизиты, Список)
	Данные=?(ТипЗнч(Список)=Тип("Структура"),Список,Новый Структура(Список));
	Для Каждого Стр из Данные Цикл
		Если Реквизиты.Найти(Стр.Ключ)<>Неопределено Тогда Возврат Стр.Ключ;КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции
		
&НаСервереБезКонтекста
Процедура ЗаполнитьЗначенияСвойствНаСервере(Структура, Ссылка)
	ЗаполнитьЗначенияСвойств(Структура,Ссылка);
	//Возврат Структура;
КонецПроцедуры

&НаСервере
Функция ИзКорзиныНаСервере(Отбор) //зк(
	Обработка=РеквизитФормыВЗначение("Объект");
	//Создадим номенклатуру если она еще не создана
	Обработка.КорзинаСоздатьНоменклатуру(Отбор);
	ЗначениеВДанныеФормы(Обработка.ЗаявкаНаОформление,Объект.ЗаявкаНаОформление);
	Возврат Обработка.ОформитьЗаявку(Новый Структура("Отбор",Отбор));
	
КонецФункции

&НаКлиенте
Процедура УточнитьНоменклатуру(Команда)
	ТекДан=Элементы.ЗаявкаНаОформление.ТекущиеДанные;
	Если ТекДан=Неопределено или ЗначениеЗаполнено(ТекДан.Номенклатура) Тогда Возврат;КонецЕсли;
	ОО=Новый ОписаниеОповещения("УточнениеНоменклатуры",ЭтаФорма,ТекДан);
	ПараметрыФормы=Новый Структура("Артикул,КодПроизводителя,Наименование,Производитель");
	ЗаполнитьЗначенияСвойств(ПараметрыФормы,ТекДан);
	ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.УточнитьНоменклатуруУФ",
	ПараметрыФормы,ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно,,ОО,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура УточнениеНоменклатуры(Ссылка,ТекДан) Экспорт
	Если Ссылка=Неопределено Тогда Возврат;КонецЕсли;
	ТекДан.БезПроизводителя=Ложь;
	Если Не Ссылка.Пустая() Тогда
		ТекДан.Номенклатура=Ссылка;
		ТекДан.Наименование=Ссылка;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаОформлениеПриАктивизацииСтроки(Элемент)
	ТекДан=Элементы.ЗаявкаНаОформление.ТекущиеДанные;
	Элементы.УточнитьНоменклатуру.Доступность=ТекДан<>Неопределено И НЕ ЗначениеЗаполнено(ТекДан.Номенклатура);
КонецПроцедуры

&НаКлиенте
Процедура Аналитика(Команда)
	СендерОтправить("{""action"":""isLicense"",""software"":""analyticsPA""}");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьДоступ(Свойство,Пользователь)
	УстановитьПривилегированныйРежим(Истина);
	Доступ = ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","Доступ",,Пользователь);
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ?(Доступ=Неопределено,Истина,?(Доступ.Свойство(Свойство),Доступ[Свойство],Истина));
КонецФункции

&НаКлиенте
Процедура ДоставкаСрок(Команда)
	ПоДням = Команда.Имя="ДоставкаДней";
	ЕСли Элементы.Страницы.ТекущаяСтраница=Элементы.ПоискЕмекс Тогда
		Элементы.РезультатПоискаОнлайнДатаДоставки.Видимость  = Не ПоДням;
		Элементы.РезультатПоискаОнлайнДатаМакс.Видимость      = Не ПоДням;
		Элементы.РезультатПоискаОнлайнСрокДоставки.Видимость     = ПоДням;
		Элементы.РезультатПоискаОнлайнСрокДоставкиМакс.Видимость = ПоДням;
	Иначе
		Элементы.ЗаявкаНаОформлениеДатаДоставки.Видимость  = Не ПоДням;
		Элементы.ЗаявкаНаОформлениеДатаМакс.Видимость      = Не ПоДням;
		Элементы.ЗаявкаНаОформлениеСрокДоставки.Видимость     = ПоДням;
		Элементы.ЗаявкаНаОформлениеСрокДоставкиМакс.Видимость = ПоДням;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Если Лев(Объект.Конфигурация,19)<>"УправлениеТорговлей" Тогда
		// ДеРегистрация в ПодключаемоеОборудование
		Попытка
			ПодключаемоеОборудование=Неопределено;
			Попытка
				Выполнить("ПодключаемоеОборудование=?(глПодключаемоеОборудование<>Неопределено,глПодключаемоеОборудование,Неопределено)");
			Исключение КонецПопытки;
			Если ПодключаемоеОборудование<>Неопределено  Тогда
				Индекс=ПодключаемоеОборудование.ПараметрыПодключенияПО.Количество()-1;
				Пока Индекс>=0 Цикл
					Подключение=ПодключаемоеОборудование.ПараметрыПодключенияПО[Индекс];
					Если Подключение.Наименование="Сендер" Тогда
						ПодключаемоеОборудование.ПараметрыПодключенияПО.Удалить(Индекс);
					КонецЕсли;
					Индекс=Индекс-1;
				КонецЦикла;
			КонецЕсли;
		Исключение
			Сообщить(ОписаниеОшибки());
			Возврат;
		Конецпопытки;
    КонецЕсли;
	Сендер=Неопределено; СендерАдрес=Неопределено; СендерЗапросы=Неопределено; ВсеЗаявкиПоставщикуБыли=Неопределено; 
	СендерСв=Неопределено; СендерОтладкаБыла=Неопределено; ПодключаемоеОборудование=Неопределено; 
КонецПроцедуры

#КонецОбласти

Процедура ЗагрузкаПрайсЛиста(Код)
	
	
Конецпроцедуры

&НаКлиенте
Процедура НаСайтПлюс(Команда)
	ТекДан=Элементы.ЗаказыКлиентов.ТекущиеДанные;
	Если ТекДан=Неопределено или Команда=Неопределено Тогда Возврат; КонецЕсли;
	
	Отбор=Новый Структура("Выбран",Истина);
    Строки=Объект.ЗаявкаНаОформление.НайтиСтроки(Отбор);
	ВыбранКолво=Строки.Количество();
	Если ВыбранКолво=0 Тогда
		ПоказатьПредупреждение(,"Нет ни одной отмеченной заявки для переноса в корзину поставщика");
		Возврат;
	Иначе
		// Контроль на кратность
		Для Каждого Запись Из Строки Цикл
			Если ТипЗнч(Запись.Кратность) = Тип("Число") И Запись.Кратность<>0 И Запись.Кратность <> 1 Тогда
				Если Запись.Количество/Запись.Кратность <> Цел(Запись.Количество/Запись.Кратность) Тогда
					Сообщить("В строке "+Запись.НомерСтроки+" возникли ошибки при отправке в корзину: Количество товара не соответсвует кратности. Для текущей позиции кратность равна "+Строка(Запись.Кратность));
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Ошибки="";
	Если Найти(Команда.Имя,"ЗаказПокупателя")>0 Тогда
		Если ЗначениеЗаполнено(ТекДан.ЗаказПокупателя) Тогда
			Ошибки="Для заявки уже определен "+Строка(ТекДан.ЗаказПокупателя)+Символы.ПС;
		КонецЕсли;
		Объект.ЗаказПокупателя=Истина;
		Объект.РеализацияТоваров=Ложь;
		Объект.СчетФактура=Ложь;
		Объект.ЗаказНаряд=Ложь;
		Объект.КонтрагентДляЗаявки=ТекДан.Контрагент;
		Объект.Соглашение=?(ТекДан.Соглашение<>Неопределено,ТекДан.Соглашение,
		?(Элементы.ЗаказСоглашение.Видимость=Истина,Элементы.ЗаказСоглашение.ОграничениеТипа.ПривестиЗначение(""),Неопределено));
		Объект.ДоговорДляЗаявки=?(ТекДан.Договор<>Неопределено,ТекДан.Договор,
		?(Элементы.ЗаказДоговор.Видимость=Истина,Элементы.ЗаказДоговор.ОграничениеТипа.ПривестиЗначение(""),Неопределено));
		Объект.СкладДляЗаявки=?(ЗначениеЗаполнено(ТекДан.Склад),ТекДан.Склад,Объект.Склад);
	
		Ошибки=КонтрольДанныхДляДокументовНаСервере()+Ошибки;
		Если Ошибки<>"" Тогда
			Если Лев(Ошибки,1)="!" Тогда
				ПоказатьПредупреждение(,Сред(Ошибки,2));
				Возврат;
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	
	Данные=Новый Структура("КомандаИмя,Отбор,Строки",Команда.Имя,Отбор,Строки);
	Если Ошибки<>"" Тогда
		ОО=Новый ОписаниеОповещения("НаСайтПлюсОтвет",ЭтаФорма,Данные);
		ПоказатьВопрос(ОО,Ошибки+"Продолжить?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
	Иначе
		НаСайтПлюсОтвет(КодВозвратаДиалога.Да,Данные);
	КонецЕсли;
		
		
КонецПроцедуры

&НаКлиенте
Процедура НаСайтПлюсОтвет(Ответ,Данные) Экспорт
	Если Ответ<>КодВозвратаДиалога.Да Тогда Возврат;КонецЕсли;
	// Оформление заказов покупателя
	Если Найти(Данные.КомандаИмя,"ЗаказПокупателя")>0 Тогда
		ОформлениеЗаявки(КодВозвратаДиалога.ОК,	Данные.Отбор);
	КонецЕсли;
	
	// Снимаем отметки выбора, если будем формировать Заказы поставщику
	Если Найти(Данные.КомандаИмя,"ЗаказПоставщику")>0 Тогда
		Строки=Объект.ЗаявкаПоставщику.НайтиСтроки(Новый Структура("Выбран",Истина));
		Для Каждого Стр из Строки Цикл
			Стр.Выбран=Ложь;
		КонецЦикла;
		Запросы=ВКорзинуОнлайнНаСервере(Данные.Отбор,Истина);	
	Иначе
		Запросы=ВКорзинуОнлайнНаСервере(Данные.Отбор);	
	КонецЕсли;
 	Для Каждого Запрос Из Запросы Цикл
		СендерОтправить(Запрос);
	КонецЦикла;                          //вс)
	Элементы.Группа10.Заголовок="Заказанное ("+Строка(Объект.ЗаявкаПоставщику.Количество())+")";
	СохранитьДанныеПоЗаказамПоставщикам(ПользовательКорзины);
	СохранитьДанныеПоКорзине(ПользовательКорзины);

	Если Найти(Данные.КомандаИмя,"ЗаказПоставщику")>0 Тогда
		Отбор=Объект.ЗаявкаПоставщику.НайтиСтроки(Новый Структура("Выбран",Истина));
		ОформитьЗаказыОтвет(КодВозвратаДиалога.ОК, Отбор);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФормыПАВставить(Имя,Форма) Экспорт
	ФормыПА.Вставить(Имя,Форма);
КонецПроцедуры

&НаКлиенте
Процедура ФормыПАУдалить(Имя) Экспорт
	ФормыПА.Удалить(Имя);
КонецПроцедуры

&НаКлиенте
Функция ФормыПАОткрыта(Имя) Экспорт
	Возврат ФормыПА.Свойство(Имя) и ФормыПА[Имя].Открыта();
КонецФункции

&НаКлиенте
Функция ФормыПАПолучить(Имя) Экспорт
	Возврат ?(ФормыПА.Свойство(Имя) и ФормыПА[Имя].Открыта(),ФормыПА[Имя],Неопределено);
КонецФункции

//СендерЗапросы=Новый СписокЗначений;
//СендерСв=Новый Структура("Начало,Источник,Живой,Пинг,Повторов,Таймаут,ЖдатьОтвет,КС,Конец,Первый,макс,ВсеЗаявки,Отладка",
//                    ТекущаяДата(),"",Истина,0,3,60,10,0,0,0,0,Ложь,Ложь);
