
&НаКлиенте
Перем Права;

&НаКлиенте
Перем НаборКонтактнойИнформации;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполнение реквизитов формы с цветами и картинками
	РР  = БиблиотекаКартинок.Renault_Logo_Min;
	РВК = БиблиотекаКартинок.STM_comment;
	РС  = БиблиотекаКартинок.Renault_Calendar_New;
	РКО = БиблиотекаКартинок.STM_comment;

	Права = обПолучитьПраваИНастройкиПользователя(ПараметрыСеанса.Пользователь);
	ПраваРено = ПараметрыСеанса.Renault_ПраваПользователя;
	
	ТекМенеджер = ПараметрыСеанса.Пользователь.Сотрудник;

	СтруктураЦветов = Renault_ОбщиеФункцииСервер.МультибрендПараметрыОформления();
	
	ЦветРено = Вычислить(СтруктураЦветов.ОсновнойЦвет);

	ЦветБелый 			= Новый Цвет(255, 255, 255);
	ЦветСерый 			= Новый Цвет(156, 166, 178);
	
	ЦветRenault1 		= Вычислить(СтруктураЦветов.ДопЦвет1);
	ЦветRenault2 		= Вычислить(СтруктураЦветов.ДопЦвет3);
	ЦветRenault3 		= Вычислить(СтруктураЦветов.ДопЦвет4);

	ЦветКнопкиВоронкиСерый = Новый Цвет(212, 212, 212);

	ИзображениеСобытиеВыполнено 		= БиблиотекаКартинок.Renault_Confirm_Square;
	ИзображениеСобытиеЗапланировано 	= БиблиотекаКартинок.Renault_Confirm_New;
	ИзображениеПустое 					= БиблиотекаКартинок.CRM_ПустоеИзображение32;
	
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("РабочийЛист", Объект.IDK);
	Выборка = Документы.Renault_ЗаявкаНаТрейдИн.Выбрать(,, СтруктураОтбора);
	МенеджерТрейдИн = Справочники.Сотрудники.ПустаяСсылка();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.МенеджерТрейдИн) Тогда
		МенеджерТрейдИн = Выборка.МенеджерТрейдИн;
	КонецЕсли;
	
	ТекСотрудник = ПараметрыСеанса.Пользователь.Сотрудник;
	
	Если Объект.Сотрудник <> ТекСотрудник Или (МенеджерТрейдИн <> ТекСотрудник и ЗначениеЗаполнено(МенеджерТрейдИн)) Тогда
		Если ПраваРено.Свойство("ПравоРедактированияЧужихРЛ") Тогда
			Если Не ПраваРено.ПравоРедактированияЧужихРЛ Тогда
				ЗаблокироватьРЛ();
			КонецЕсли;
		Иначе
			ЗаблокироватьРЛ();
		КонецЕсли;
	КонецЕсли;
	
	СлужНастройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	Если Не СлужНастройки.ПоказыватьПрототипы Тогда 
		Элементы.ОткрытьSara.Видимость = Ложь;
	КонецЕсли;
		
	Если ПараметрыСеанса.DMS_Бренд <> Справочники.CRM_МаркаАвтомобиля.RENAULT Тогда
		Элементы.MyRenault.Видимость 		= Ложь;
		Элементы.ОткрытьMyRenault.Видимость = Ложь;
		Элементы.ОтменитьВыдачу.Видимость 	= Ложь;
		Элементы.ИзменитьВыдачу.Видимость 	= Ложь;
	КонецЕсли;
	
	Элементы.РОП.Видимость = ПраваРено.РазрешитьРаботуСАрмРОП;
	Если ПараметрыСеанса.DMS_Бренд <> Справочники.CRM_МаркаАвтомобиля.RENAULT Тогда
		Элементы.КарточкаКлиента.Видимость = Ложь;
	КонецЕсли;
	
	ДЦ = ?(ЗначениеЗаполнено(Объект.ДилерскийЦентр), Объект.ДилерскийЦентр, Renault_CRM.ПолучитьДилерскийЦентрПользователя());
	Если СтрДлина(ДЦ.ПервыйСимволТелефона) Тогда
		ПервыйСимволТел = ДЦ.ПервыйСимволТелефона;
		Если Лев(ПервыйСимволТел, 1) = "+" Тогда
			ПервыйСимволТел = " " + ПервыйСимволТел;
		КонецЕсли;
		Элементы.Клиент_Телефон.Маска = ПервыйСимволТел + "(999)999-99-99";
		Элементы.КлиентКорпоративный_Телефон.Маска = ПервыйСимволТел + "(999)999-99-99";
		ОбрезатьТелефон = Истина;
	Иначе
		Элементы.Клиент_Телефон.Маска = "9(999)999-99-99";
		Элементы.КлиентКорпоративный_Телефон.Маска = "9(999)999-99-99";
		ОбрезатьТелефон = Ложь;
	КонецЕсли;
	
	Элементы.ОтправитьСМС.Видимость = ДЦ.ОтображатьКнопкиРассылкиСМС;
	Элементы.Позвонить.Видимость 	= ДЦ.ОтображатьКнопкиИнтеграцииСТелефонией;
	Элементы.ОтправитьЕмейл.Видимость = ДЦ.ОтображатьКнопкиРассылкиЕмейл;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Заполнение полей формы
	ОбновитьЗаголовок();
	НовыйАвтомобиль = ? (Объект.ПродажаБУ, 1, 0);
	
	ЭтаФорма.Модифицированность = Ложь;
	
	ОпределитьНеобходимостьФункционалаТрейдИн(ПраваРено);	
	
	ОбновитьКомментарий();
	ОбновитьКомментарийРезолюция();
	
	Если ТипЗнч(Объект.Клиент) = Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты") Тогда
		Если ЗначениеЗаполнено(Объект.Клиент.Контрагент) Тогда
			Клиент = Объект.Клиент.Контрагент;
			ЗаписатьРабочийЛист();
		КонецЕсли;
	КонецЕсли;
	
	ПрочитатьДанныеКлиентаСервер();
	
	ОбновитьВоронкуИСписки();
	
	ОбновитьЦветКнопкиВажность();
	ОбновитьОтображениеКнопокЗакрытия();
	ОбновитьЦветКнопокРОП();
	ОбновитьЦветКнопкиКарточкаКлиента();
	
	ОбновитьДоступностьПолей();
	
	ОбновитьСтатусКорпКлиента();
	ЗаполнитьСписокКомментариев();
	ОбновитьКнопкиТипКлиента();	
	
	//ПодключитьОбработчикОжидания("СообщенияПользователюПоКорпКлиенту", 3, Ложь);
	
	Если ЗначениеЗаполнено(Объект.СвязаныйIDK) Тогда
		Элементы.НадписьСоздатьРабочийЛистТрейдИн.Заголовок 	= "Открыть связаный рабочий лист";
		Элементы.НадписьСоздатьРабочийЛистПродажа.Заголовок 	= "Открыть связаный рабочий лист";
		Элементы.НадписьПривязатьРабочийЛистПродажа.Заголовок 	= "Отвязать текущий и привязать другой рабочий лист";
		Элементы.ПривязатьСоздатьРабочийЛистТрейдИн.Заголовок 	= "Отвязать текущий и привязать другой рабочий лист";
	КонецЕсли;
	
	Если Объект.ТипРабочегоЛиста = Перечисления.Renault_ТипыРабочихЛистов.TradeIn Тогда
		
		Элементы.НадписьВыдачи.Видимость 				= Ложь;
		Элементы.СоздатьВыдачу.Видимость 				= Ложь;
		Элементы.НадписьВыдачиПредупреждение.Видимость 	= Ложь;
		Элементы.Выдачи.Видимость 						= Ложь;
		Элементы.ДоговорыСКлиентом.Видимость 			= Ложь;
		Элементы.КоммерческиеПредложения.Видимость 		= Ложь;
		Элементы.ТестДрайв.Видимость 					= Ложь;
		
		Элементы.УспешнаяПродажа.Заголовок = "Успешный выкуп";
		Элементы.ТипПродажиВыкупа.Заголовок = "Тип выкупа";
		ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " (рабочий лист трейд-ин)."+ ?(ЗначениеЗаполнено(ЗаявкаНаТрейдИн.МенеджерЗаявитель)," Менеджер заявитель: "+ЗаявкаНаТрейдИн.МенеджерЗаявитель, "");
		ЗаполнитьСписокВыбораЭлемента("ПроизводительТрейдИн");	

	Иначе
		
		ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " (рабочий лист продажа)";
		
	КонецЕсли;
	
	ОбновитьПоляДляСтатистики();
	
	Элементы.СинхронизироватьCПланшетом.Видимость = Объект.ДилерскийЦентр.СинхронизированСПланшетомПродавца;
	
	УправлениеКнопкамиОФУ();
	
	Элементы.ГруппаСтраницыКлиента.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
	Если ЭтоПетровский() Тогда
		УправлениеПанельюСтатистики();
	КонецЕсли;
	
	СогласиеНаОПД();
	ОбновитьДатуICM();
	
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ЗаголовокФормы =  "Рабочий лист №" + Строка(Объект.IDK);
	ЗаголовокФормы = СтрЗаменить(ЗаголовокФормы, " ", "");
	ЗаголовокФормы = СтрЗаменить(ЗаголовокФормы, Символы.НПП, "");
	ЗаголовокФормы = НРег(ЗаголовокФормы);
	ПолноеИмя = "регистрсведений.Renault_РабочиеЛисты.формазаписи." + ЗаголовокФормы;
	
	Если ИмяСобытия = "ОбновитьРабочийЛист" Тогда
		ОбновитьВоронкуИСписки();
		ПрочитатьДанныеКлиентаСервер();
	ИначеЕсли ИмяСобытия =("Активизировать."+ПолноеИмя) Тогда
		Активизировать();
	ИначеЕсли ИмяСобытия = "ОбновитьВоронку" Тогда
		ОбновитьВоронкуИСписки();
	ИначеЕсли ИмяСобытия = "ОбновитьСобытия" Тогда
		ОбновитьСписокСобытий();
	ИначеЕсли ИмяСобытия = "ПеречитатьДанныеКлиента" Тогда
		ПрочитатьДанныеКлиентаСервер();
	ИначеЕсли ИмяСобытия = "ОбновитьВоронкуТелефон" Тогда
		Воронка_ОбновитьВзятТелефон();
	ИначеЕсли ИмяСобытия = "ОбновитьВоронкуЕмаил" Тогда
		Воронка_ОбновитьВзятEmail();
	ИначеЕсли ИмяСобытия = "ОбновитьРабочийЛистПослеЗаписиДоговора" Тогда
		ОбновитьОтображениеДанных();
		ОбновитьВоронкуИСписки();
		ПрочитатьДанныеКлиентаСервер();
	ИначеЕсли ИмяСобытия = "ОбновитьРабочийЛистПослеЗаписиКонтрагента" Тогда
		
		Прочитать();
		Если ТипЗнч(Объект.Клиент) = Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты") Тогда
			Если ЗначениеЗаполнено(Объект.Клиент.Контрагент) Тогда
				Клиент = Объект.Клиент.Контрагент;
			КонецЕсли;
		КонецЕсли;
		
		СохранитьРабочийЛист();
		ОбновитьОтображениеДанных();
		ОбновитьВоронкуИСписки();
		ОбновитьСтатусКорпКлиента();
		ПрочитатьДанныеКлиентаСервер();
		
	ИначеЕсли ИмяСобытия = "ОбновитьОсновногоКлиентаРабочегоЛиста" Тогда
		Клиент = Параметр;
		ПрочитатьДанныеКлиентаСервер();
	ИначеЕсли ИмяСобытия = "СозданаЗаявкаНаРезерв" Тогда
		ОбновитьСписокРезервов();
	ИначеЕсли ИмяСобытия = "ОткрытьДоступКПолюРабочегоЛистаКлиент_ФИО1" Тогда
		Элементы.Клиент_ФИОКОРП.Доступность = Истина;
		ФормаКорпКлиента = Неопределено;
	ИначеЕсли ИмяСобытия = "ПередачаДанныхНаАвтосервис2СФормыОбращения" Тогда
		Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн) Тогда
			Форма = ЗаявкаНаТрейдИн.ПолучитьФорму("ФормаДокументаУпр");
			Если Форма.Открыта() Тогда
				Форма.Закрыть();
			КонецЕсли;
			
			СоздатьОбращениеПродолжение(Параметр, Источник);			
		КонецЕсли;		
	ИначеЕсли ИмяСобытия = "РабочийЛистВизуальныйОсмотр" Тогда
		Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн) И Объект.ТипРабочегоЛиста = Перечисления.Renault_ТипыРабочихЛистов.TradeIn Тогда			
			РегистрацияВизуальногоОсмотра();			
		КонецЕсли;		
	ИначеЕсли ИмяСобытия = "РабочийЛистЗаполнениеДанныхАвтомобиля" Тогда
		Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн) И Объект.ТипРабочегоЛиста = Перечисления.Renault_ТипыРабочихЛистов.TradeIn  Тогда			
			РегистрацияЗаполненияДанныхАвтомобиля();			
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "РабочийЛистПредложениеВыкупа" Тогда
		Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн) И Объект.ТипРабочегоЛиста = Перечисления.Renault_ТипыРабочихЛистов.TradeIn  Тогда			
			РегистрацияПредложениеВыкупа(Параметр);			
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "РабочийЛистПредворительнаяОценка" Тогда
		Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн) И Объект.ТипРабочегоЛиста = Перечисления.Renault_ТипыРабочихЛистов.TradeIn  Тогда			
			РегистрацияПредварительнаяОценка(Параметр);			
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "Запись_КорпоративныеКлиенты" Тогда
		ПрочитатьДанныеКлиентаСервер();
	ИначеЕсли ИмяСобытия= "ОбновитьФормуЗаписи" Тогда 
		ПрочитатьДанныеКлиентаСервер(Параметр);
		ЭтаФорма.ОбновитьОтображениеДанных(); 
	ИначеЕсли ИмяСобытия = "ЗаписанаКИ" Тогда
		Если НаборКонтактнойИнформации <> Неопределено И ЗначениеЗаполнено(Объект.Клиент) Тогда	
			Если НаборКонтактнойИнформации.Количество() > 0 Тогда
				НаборКонтактнойИнформации[0].Представление = СтрЗаменить(НаборКонтактнойИнформации[0].Представление, " ", ""); //DMSREN-439
				Объект.Телефон = НаборКонтактнойИнформации[0].Представление;
				Клиент_Телефон = Renault_УправлениеКонтактнойИнформацией.НормализацияНомераТелефона(Объект.Телефон, Объект.ДилерскийЦентр);
				Если ОбрезатьТелефон Тогда
					Клиент_Телефон = Прав(Клиент_Телефон, 10);
				КонецЕсли;
				ПровестиДедубликацию("Телефон");	
				Если НаборКонтактнойИнформации.Количество()>0 Тогда
					НаборКонтактнойИнформации.Записать();
				КонецЕсли;
			КонецЕсли;
			Для Каждого Стр Из НаборКонтактнойИнформации Цикл
				Если Стр.ЗначениеПоУмолчанию Тогда
					ТекущийКлиентОбъект = Объект.Клиент.ПолучитьОбъект();
					ТекущийКлиентОбъект.ОсновнойТелефон = Стр.Представление;
					ТекущийКлиентОбъект.Записать();
					Клиент_ТелефонПриИзменении(Неопределено);
					СохранитьДанныеКлиентаПриСменеТелефона();
					ПрочитатьДанныеКлиентаСервер();	
					Воронка_ОбновитьВзятТелефон();
					Прервать;		
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
    ИначеЕсли ИмяСобытия = "ОбновитьСписокКП" Тогда  //Блинков обработка оповещения при измененииКП DMSREN-742
		ОбновитьСписокКП();
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОповещения()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Формирует заголовок формы и текст надписи "Заголовок" исходя из IDK, ДатаID и сотрудника рабочего листа
//
&НаКлиенте
Процедура ОбновитьЗаголовок()
	
	ЭтоТрейдИн = Объект.ТипРабочегоЛиста = ПредопределенноеЗначение("Перечисление.Renault_ТипыРабочихЛистов.TradeIn");
	
	Элементы.Заголовок.Заголовок = "Рабочий лист №" + Строка(Объект.IDK) + " от " + Формат(Объект.ДатаID, "ДФ=""дд ММММ гггг 'г.' ЧЧ:мм:сс""") + " - " + ?(ЗначениеЗаполнено(Объект.Сотрудник), Объект.Сотрудник, ?(ЭтоТрейдИн, Объект.Отдел, "Взять в работу"));	
	Элементы.Заголовок.Гиперссылка = НЕ ЗначениеЗаполнено(Объект.Сотрудник);	
	ЭтаФорма.Заголовок = "Рабочий лист №" + Строка(Объект.IDK);
	
КонецПроцедуры // ОбновитьЗаголовок()

// Заполняет табличный документ "ТаблоКоментарии" данными комментариев из РС "CRM_Комментарии" 
//	и истории переписки из РС "Renault_ИсторияПерепискиСКлиентом" 
//
&НаСервере
Процедура ОбновитьКомментарий()
	
	ТаблоКоментарии.Очистить();
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	МакетКомментариев = РегистрыСведений.Renault_РабочиеЛисты.ПолучитьМакет("РазделКомментариевУзкий");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_Комментарии.Дата КАК ДатаКомментария,
	|	CRM_Комментарии.IDK КАК IDK,
	|	CRM_Комментарии.Идентификатор КАК Идентификатор,
	|	CRM_Комментарии.ИдентификаторРодителя КАК ИдентификаторРодителя,
	|	CRM_Комментарии.Автор КАК Автор,
	|	CRM_Комментарии.ТекстКомментария КАК Комментарий
	|ИЗ
	|	РегистрСведений.CRM_Комментарии КАК CRM_Комментарии
	|ГДЕ
	|	CRM_Комментарии.IDK = &IDK
	|
	|УПОРЯДОЧИТЬ ПО
	|	IDK,
	|	CRM_Комментарии.Дата,
	|	Идентификатор,
	|	ИдентификаторРодителя";
	Запрос.УстановитьПараметр("IDK", Объект.IDK);
	
	ТаблицаКомментариев = Запрос.Выполнить().Выгрузить();
	
	ДеревоКомментариев = Renault_CRM.ПолучитьДеревоКомментариев(ТаблицаКомментариев);
	ДеревоКомментариев.Строки.Сортировать("ДатаКомментария "+?(СортировкаКомментариевПоДате,"Убыв","Возр"),Ложь);  //Блинков DMSREN-786
	ТабличныйДокумент.НачатьАвтогруппировкуСтрок();
	
	ОбластьШапка = МакетКомментариев.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Идентификатор = "ДобавитьКомментарий";
	ОбластьШапка.Параметры.СортировкаПоДате = "СортировкаКомментариевПоДате";  //Блинков DMSREN-786
	ОбластьШапка.Параметры.Убывание = ?(СортировкаКомментариевПоДате,"Убывание","Возрастание");  //Блинков DMSREN-786 изменение надписи
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Для Каждого КорневойКомментарий Из ДеревоКомментариев.Строки Цикл
		Renault_CRM.ВывестиКомментарийРекурсивно(ТабличныйДокумент, МакетКомментариев, КорневойКомментарий, 1);
	КонецЦикла;
	
	// Получим историю переписки с клиентом
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Renault_ИсторияПерепискиСКлиентом.Период КАК ДатаКомментария,
	|	Renault_РабочиеЛисты.IDK,
	|	Renault_ИсторияПерепискиСКлиентом.Идентификатор,
	|	"""" КАК ИдентификаторРодителя,
	|	Renault_ИсторияПерепискиСКлиентом.ПользовательДилера КАК Автор,
	|	Renault_ИсторияПерепискиСКлиентом.Сообщение КАК Комментарий,
	|	Renault_ИсторияПерепискиСКлиентом.Объект
	|ИЗ
	|	РегистрСведений.Renault_ИсторияПерепискиСКлиентом КАК Renault_ИсторияПерепискиСКлиентом
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	|		ПО (Renault_РабочиеЛисты.IDТрафика = Renault_ИсторияПерепискиСКлиентом.Объект.ТрафикИД)
	|ГДЕ
	|	Renault_РабочиеЛисты.IDK = &IDK";
	Запрос.УстановитьПараметр("IDK", Объект.IDK);
	
	ТаблицаПереписки = Запрос.Выполнить().Выгрузить();
	ДеревоПереписки = Renault_CRM.ПолучитьДеревоКомментариев(ТаблицаПереписки);
	
	Для каждого КорневойКомментарий из ДеревоПереписки.Строки Цикл
		Renault_CRM.ВывестиКомментарийРекурсивно(ТабличныйДокумент, МакетКомментариев, КорневойКомментарий, 1);
	КонецЦикла;
	
	// Выведем текст запроса клиента
	ТаблицаЛИДов = ТаблицаПереписки.Скопировать();
	ТаблицаЛИДов.Свернуть("Объект");
	ТаблицаЛИДов.Колонки.Добавить("ДатаКомментария");
	ТаблицаЛИДов.Колонки.Добавить("IDK");
	ТаблицаЛИДов.Колонки.Добавить("Идентификатор");
	ТаблицаЛИДов.Колонки.Добавить("ИдентификаторРодителя");
	ТаблицаЛИДов.Колонки.Добавить("Автор");
	ТаблицаЛИДов.Колонки.Добавить("Комментарий");
	
	Для Каждого Строка Из ТаблицаЛИДов Цикл
		
		Строка.ДатаКомментария = Строка.Объект.Дата;
		Строка.IDK = Объект.IDK;
		Строка.Идентификатор = Строка.Объект.ТрафикИД;
		Строка.ИдентификаторРодителя = "";
		Строка.Автор = Строка.Объект.Менеджер;
		Строка.Комментарий = Строка.Объект.Сообщение;
		
	КонецЦикла;
	
	ДеревоЛИДов = Renault_CRM.ПолучитьДеревоКомментариев(ТаблицаЛИДов);
	
	Для каждого КорневойКомментарий из ДеревоЛИДов.Строки Цикл
		Renault_CRM.ВывестиКомментарийРекурсивно(ТабличныйДокумент, МакетКомментариев, КорневойКомментарий, 1);
	КонецЦикла;
	
	ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();
	ТабличныйДокумент.ОтображатьЗаголовки 	= Ложь;
	ТабличныйДокумент.ОтображатьСетку     	= Ложь;
	ТабличныйДокумент.ТолькоПросмотр      	= Истина;
	
	ТаблоКоментарии.Вывести(ТабличныйДокумент);
	
	ТаблоКоментарии.ОтображатьЗаголовки 	= Ложь;
	ТаблоКоментарии.ОтображатьГруппировки 	= Истина;
	
	ТаблоКоментарии.ОтображатьСетку    		= Ложь;
	ТаблоКоментарии.ТолькоПросмотр      	= Истина;
	ТаблоКоментарии.ОриентацияСтраницы  	= ОриентацияСтраницы.Портрет;
	ТаблоКоментарии.АвтоМасштаб         	= Истина;
	ТаблоКоментарии.ТекущаяОбласть 			= ТабличныйДокумент.Область(1, 1, 1, 1);
	
КонецПроцедуры // ОбновитьКомментарий()

// Заполняет резолюцию руководителя отдела продаж из РС "CRM_РезолюцииПоРабочимЛистам"
//
&НаСервере
Процедура ОбновитьКомментарийРезолюция()
	
	ТаблоРезолюций.Очистить();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет = РегистрыСведений.Renault_РабочиеЛисты.ПолучитьМакет("Резолюции");
	Макет.Параметры.Расшифровка = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	CRM_РезолюцииПоРабочимЛистам.ID,
	|	CRM_РезолюцииПоРабочимЛистам.IDK,
	|	CRM_РезолюцииПоРабочимЛистам.Дата КАК Дата,
	|	CRM_РезолюцииПоРабочимЛистам.Подразделение,
	|	CRM_РезолюцииПоРабочимЛистам.Комментарий,
	|	CRM_РезолюцииПоРабочимЛистам.Сотрудник
	|ИЗ
	|	РегистрСведений.CRM_РезолюцииПоРабочимЛистам КАК CRM_РезолюцииПоРабочимЛистам
	|ГДЕ
	|	CRM_РезолюцииПоРабочимЛистам.IDK = &IDK
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("IDK", Объект.IDK);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		ОбластьМакета.Параметры.Комент = "[" + СокрЛП(Выборка.Сотрудник) + " " + Формат(Выборка.Дата, "ДФ=HH:mm") + ", " + Лев(СокрЛП(Выборка.Дата), 10) + "] " + СокрЛП(Выборка.Комментарий);
		ТабличныйДокумент.Вывести(ОбластьМакета);
	КонецЦикла;
	
	ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();
	
	ТабличныйДокумент.ОтображатьЗаголовки 		= Ложь;
	ТабличныйДокумент.ОтображатьСетку     		= Ложь;
	ТабличныйДокумент.ТолькоПросмотр      		= Истина;
	
	ТаблоРезолюций.Вывести(ТабличныйДокумент);
	
	ТаблоРезолюций.ОтображатьЗаголовки 			= Ложь;
	ТаблоРезолюций.ОтображатьСетку    			= Ложь;
	ТаблоРезолюций.ТолькоПросмотр      			= Истина;
	ТаблоРезолюций.ОриентацияСтраницы  			= ОриентацияСтраницы.Портрет;
	ТаблоРезолюций.АвтоМасштаб         			= Истина;
	ТаблоРезолюций.ТекущаяОбласть 				= ТаблоРезолюций.Область(1, 1, 1, 1);
	
КонецПроцедуры // ОбновитьКомментарийРезолюция()

// Процедура - Прочитать данные клиента сервер
//
// Параметры:
//  СтруктураПервичныйИнтерес	 - Структура	 - Структура, содержащая ссылку на певричный интерес по связанному IDK, с полями:
//		* IDK				-	Строка										-	Связанный IDK
//		* ПервичныйИнтерес	-	СправочникССылка.CRM_ПервичныйИнтерес		-	Первичный интерес клиента
//
&НаСервере
Процедура ПрочитатьДанныеКлиентаСервер(СтруктураПервичныйИнтерес = Неопределено)
	
	Клиент_ФИО = "";
	Клиент_Телефон = "";
	Клиент_Email = "";
	Клиент_Город = "";
	Клиент_ИсточникИнформации = Справочники.CRM_ИсточникиИнформации.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.Телефон) Тогда
			Объект.Телефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(Объект.Клиент);
		КонецЕсли;
		
		Клиент_Телефон = Renault_УправлениеКонтактнойИнформацией.НормализацияНомераТелефона(Объект.Телефон, Объект.ДилерскийЦентр);
		Если ОбрезатьТелефон Тогда
			Клиент_Телефон = Прав(Клиент_Телефон, 10);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.Email) Тогда 
			Объект.Email 	= Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(Объект.Клиент);
		КонецЕсли;
		Клиент_Email = Объект.EMail;
		
		Клиент_ФИО = Объект.Клиент.НаименованиеПолное;
		Клиент_Корпоративный = Объект.Клиент.НаименованиеПолное;
			
		Если ТипЗнч(Объект.Клиент) = Тип("СправочникСсылка.Контрагенты") тогда
			СтатусКлиента = 1;
		Иначе
			СтатусКлиента = 0;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	CRM_КлиентскиеДанные.ИсточникИнформации,
		|	CRM_КлиентскиеДанные.Город
		|ИЗ
		|	РегистрСведений.CRM_КлиентскиеДанные КАК CRM_КлиентскиеДанные
		|ГДЕ
		|	CRM_КлиентскиеДанные.Клиент = &Клиент";
		
		Запрос.УстановитьПараметр("Клиент", Объект.Клиент);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Клиент_Город 				= Выборка.Город;
			Клиент_ИсточникИнформации 	= Выборка.ИсточникИнформации;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Клиент_Город) Тогда 
			ПодставитьГородИзТрафика(Клиент_Город,Объект.Клиент);
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураПервичныйИнтерес <> Неопределено Тогда
		Если СтруктураПервичныйИнтерес.IDK 	= Объект.СвязаныйIDK Тогда
			ПервичныйИнтересМодель 			= СтруктураПервичныйИнтерес.ПервичныйИнтерес;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры // ПрочитатьДанныеКлиентаСервер()

&НаСервереБезКонтекста
Процедура ПодставитьГородИзТрафика(Город,Клиент)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Renault_Трафик.Город КАК Город
		|ИЗ
		|	РегистрСведений.Renault_Трафик КАК Renault_Трафик
		|ГДЕ
		|	Renault_Трафик.Клиент = &Клиент
		|	И Renault_Трафик.Город <> """"
		|
		|УПОРЯДОЧИТЬ ПО
		|	Renault_Трафик.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Город = ВыборкаДетальныеЗаписи.Город;
	КонецЦикла;
	
КонецПроцедуры


// Обновляет тексты кнопок страницы "ГруппаСтраницаВоронка", заполняет элементы: 
//	"ПолеСписокСобытий", "ТаблицаКП", "ТаблоТестДрайв", "Договоры", "Выдачи", "Резервы"
//
&НаКлиенте
Процедура ОбновитьВоронкуИСписки()
	
	ОбновитьЦветаВоронки();
	ОбновитьСписокСобытий();
	ОбновитьСписокКП();
	ОбновитьСписокТестДрайвов();
	ОбновитьСписокКонтрактов();
	ОбновитьСписокВыдач();
	ОбновитьСписокРезервов();
	
КонецПроцедуры // ОбновитьВоронкуИСписки()

// Возвращает идентификатор корпоративного клиента из справочника "Renault_КорпоративныеКлиенты"
// 
// Возвращаемое значение:
//  Структура	-	Структура с идентификатором корпоративного клиента, с полями:
//		* КорпКлиент				- СправочникСсылка.Renault_КорпоративныеКлиенты
//      * ИдентификаторКорпКлиента	- Строка
//
&НаСервере
Функция ПолучитьИдентификаторКорпКлиента()

	ИдентификаторКорпКлиента = "";
	
	ДанныеКорпКлиента = Новый Структура("КорпКлиент,ИдентификаторКорпКлиента");	
	ДанныеКорпКлиента.Вставить("КорпКлиент","");
	ДанныеКорпКлиента.Вставить("ИдентификаторКорпКлиента","");
			
	
	Если ТипЗнч(Объект.Клиент) = Тип("СправочникСсылка.Контрагенты") Тогда
		Если Объект.ТипКлиента = Перечисления.Renault_ТипыКлиентов.КорпоративныйКлиент Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Renault_КорпоративныеКлиенты.Ссылка
				|ИЗ
				|	Справочник.Renault_КорпоративныеКлиенты КАК Renault_КорпоративныеКлиенты
				|ГДЕ
				|	Renault_КорпоративныеКлиенты.Контрагент = &Контрагент";
			Запрос.УстановитьПараметр("Контрагент", Объект.Клиент);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				КорпКлиент  = Выборка.Ссылка;
				ИдентификаторКорпКлиента = КорпКлиент.Идентификатор;
				
				ДанныеКорпКлиента.Вставить("КорпКлиент", КорпКлиент);
				ДанныеКорпКлиента.Вставить("ИдентификаторКорпКлиента", ИдентификаторКорпКлиента);
				
				Возврат ДанныеКорпКлиента;
			КонецЕсли;	
		Иначе
			Возврат ДанныеКорпКлиента;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции // ПолучитьИдентификаторКорпКлиента()

// Изменяет окраску фона и рамки кнопок "Лизинг", "Кредит" и "Наличные"
//
// Параметры:
//  ВидЗадачи	 - СправочникСсылка.CRM_ВидыСобытий	 - Вид события РЛ
//
&НаСервере
Процедура ПокраситьКнопкиКредитСтраховка(ВидЗадачи) 
	
	УправлениеКнопкамиОФУ();
	
КонецПроцедуры // ПокраситьКнопкиКредитСтраховка()

// Изменяет окраску фона и рамки кнопок "Лизинг", "Кредит" и "Наличные"
//
&НаСервере
Процедура УправлениеКнопкамиОФУ() Экспорт
	
	Запрос=Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Renault_События.Ссылка,
	|	Renault_События.Состояние,
	|	Renault_События.ВидСобытия
	|ИЗ
	|	Задача.Renault_События КАК Renault_События
	|ГДЕ
	|	НЕ Renault_События.ПометкаУдаления
	|	И Renault_События.Объект В(&СписокКП)
	|	И НЕ Renault_События.Состояние В (ЗНАЧЕНИЕ(Справочник.Renault_Состояния.Отклонено), ЗНАЧЕНИЕ(Справочник.Renault_Состояния.ОтмененоВыполнение))";
	
	Запрос.УстановитьПараметр("СписокКП",СписокКП());
	ЗачачиОФУ=Запрос.Выполнить().Выгрузить();
	
	СуществуетКонсультацияОФУ=ЗачачиОФУ.НайтиСтроки(Новый Структура("ВидСобытия",Справочники.CRM_ВидыСобытий.КонсультацияОФУ)).Количество()>0;
	ВыполненаКонсультацияОФУ=ЗачачиОФУ.НайтиСтроки(Новый Структура("Состояние,ВидСобытия",Справочники.Renault_Состояния.ЗавершеноУспешно,Справочники.CRM_ВидыСобытий.КонсультацияОФУ)).Количество()>0;
	
	СуществуетКредит=ЗачачиОФУ.НайтиСтроки(Новый Структура("ВидСобытия",Справочники.CRM_ВидыСобытий.Кредит)).Количество()>0;
	ВыполненКредит=ЗачачиОФУ.НайтиСтроки(Новый Структура("Состояние,ВидСобытия",Справочники.Renault_Состояния.ЗавершеноУспешно,Справочники.CRM_ВидыСобытий.Кредит)).Количество()>0;
	
	СуществуетЛизинг = ?(ЕстьЛизингКорпКлиента(), Истина, Ложь);
	Элементы.Лизинг.ЦветФона=?(СуществуетЛизинг,ЦветРено,ЦветКнопкиВоронкиСерый);
	Элементы.Лизинг.ЦветРамки=?(СуществуетЛизинг,ЦветРено,ЦветСерый);
	
	Элементы.Кредит.Картинка=?(ВыполненКредит,ИзображениеСобытиеВыполнено,Новый Картинка); 
	Элементы.Кредит.ЦветФона=?(СуществуетКредит,ЦветРено,ЦветКнопкиВоронкиСерый);
	Элементы.Кредит.ЦветРамки=?(СуществуетКредит,ЦветРено,ЦветСерый);
	
	Элементы.Наличные.Картинка=?(ВыполненаКонсультацияОФУ,ИзображениеСобытиеВыполнено,Новый Картинка); 
	Элементы.Наличные.ЦветФона=?(СуществуетКонсультацияОФУ,ЦветРено,ЦветКнопкиВоронкиСерый);
	Элементы.Наличные.ЦветРамки=?(СуществуетКонсультацияОФУ,ЦветРено,ЦветСерый);
	
КонецПроцедуры // УправлениеКнопкамиОФУ()

// Возвращает массив коммерческих предложений по этому рабочему листу
// 
// Возвращаемое значение:
//  Массив - Массив ссылок на коммерческие предложения
//
&НаСервере
Функция СписокКП()
	
	Запрос=Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	CRM_КоммерческоеПредложение.Ссылка
	|ИЗ
	|	Документ.CRM_КоммерческоеПредложение КАК CRM_КоммерческоеПредложение
	|ГДЕ
	|	CRM_КоммерческоеПредложение.РабочийЛист = &РабочийЛист
	|	И НЕ CRM_КоммерческоеПредложение.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("РабочийЛист", Объект.IDK);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка")
	
КонецФункции // СписокКП()

// Проверяет есть ли заявка на лизинг от этого корпоративного клиента
// 
// Возвращаемое значение:
//  Булево - Есть заявка на лизинг
//
&НаСервере
Функция ЕстьЛизингКорпКлиента()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_СтатистикаВыполненияЭтаповПродаж.Объект
		|ИЗ
		|	РегистрСведений.Renault_СтатистикаВыполненияЭтаповПродаж КАК Renault_СтатистикаВыполненияЭтаповПродаж
		|ГДЕ
		|	Renault_СтатистикаВыполненияЭтаповПродаж.IDK = &IDK
		|	И Renault_СтатистикаВыполненияЭтаповПродаж.ЭтапПродаж = &ЭтапПродаж";
	
	Запрос.УстановитьПараметр("IDK", 		Объект.IDK);
	Запрос.УстановитьПараметр("ЭтапПродаж", Справочники.CRM_ЭтапыПродаж.ЗаявкаНаЛизинг);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Возврат ?(ВыборкаДетальныеЗаписи.Следующий(), Истина, Ложь);
	
КонецФункции // ЕстьЛизингКорпКлиента()

// Заполнение табличного документа "ПолеСписокСобытий"
//
&НаСервере
Процедура ОбновитьСписокСобытий()
	
	ПолеСписокСобытий = Элементы.ПолеСписокСобытий;
	ПолеСписокСобытий.Очистить();
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = РегистрыСведений.Renault_РабочиеЛисты.ПолучитьМакет("СписокСобытий");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_СобытияПоРабочимЛистам.Ссылка КАК СобытиеСсылка,
	               |	CRM_СобытияПоРабочимЛистам.Дата КАК Период,
	               |	CRM_СобытияПоРабочимЛистам.Ссылка КАК ID,
	               |	CRM_СобытияПоРабочимЛистам.IDK КАК IDK,
	               |	CRM_СобытияПоРабочимЛистам.Подразделение КАК Подразделение,
	               |	CRM_СобытияПоРабочимЛистам.Отдел КАК Отдел,
	               |	CRM_СобытияПоРабочимЛистам.ДатаНапоминания КАК ДатаНапоминания,
	               |	CRM_СобытияПоРабочимЛистам.Автор КАК Автор,
	               |	CRM_СобытияПоРабочимЛистам.Сотрудник КАК Сотрудник,
	               |	CRM_СобытияПоРабочимЛистам.Комментарий КАК Комментарий,
	               |	CRM_СобытияПоРабочимЛистам.Обработано КАК Обработано,
	               |	CRM_СобытияПоРабочимЛистам.ДатаЗакрытия КАК ДатаЗакрытия,
	               |	CRM_СобытияПоРабочимЛистам.АвторЗакрытия КАК АвторЗакрытия,
	               |	CRM_СобытияПоРабочимЛистам.КомментарийЗакрытия КАК КомментарийЗакрытия,
	               |	CRM_СобытияПоРабочимЛистам.ЛидПрикрепленный.ТрафикИД КАК ЛидПрикрепленныйТрафикИД
	               |ИЗ
	               |	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
	               |ГДЕ
	               |	CRM_СобытияПоРабочимЛистам.IDK = &IDK
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаНапоминания";
	Запрос.УстановитьПараметр("IDK", Объект.IDK);

	Выборка = Запрос.Выполнить().Выбрать();
	КоличествоСобытий = Выборка.Количество();
	IDСледСобытия = Неопределено;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заголовок = "Назначенные события по рабочему листу: " + Строка(КоличествоСобытий);
	ТабДок.Вывести(ОбластьМакета);
	
	НомерСтр = 0;
	Пока Выборка.Следующий() Цикл
		
		НомерСтр = НомерСтр + 1;
		Если Выборка.Обработано Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаОбработано");
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Выборка);
		ОбластьМакета.Параметры.НомерСтроки = НомерСтр;
		
		ОбластьМакета.Параметры.СтруктураРасшифровки=Выборка.ID;
		
		// + DMSREN-1362
		Если ЗначениеЗаполнено(Выборка.ЛидПрикрепленныйТрафикИД) тогда
			ОбластьМакета.Параметры.Действие = "Перейти в" + Символы.ПС + "КЦ";
			ОбластьМакета.Параметры.ИДТрафик = Выборка.ЛидПрикрепленныйТрафикИД;
			Ячейка = ОбластьМакета.Область("Действие");
			Граница = новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
			Ячейка.Обвести(Граница,Граница,Граница,Граница);
		КонецЕсли;
	    // - DMSREN-1362 
		
		ТабДок.Вывести(ОбластьМакета);
		
		//Ищем следующее событие
		Если Не Выборка.Обработано И Не ЗначениеЗаполнено(IDСледСобытия) Тогда
			IDСледСобытия = Выборка.ID;
			КомментарийСледСобытия = Выборка.Комментарий;
			СотрудникСледСобытия = Выборка.Сотрудник;
			ДатаСледСобытия = Выборка.ДатаНапоминания;
		КонецЕсли;
				
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку     = Ложь;
	ТабДок.ТолькоПросмотр      = Истина;
	
	ПолеСписокСобытий.Вывести(ТабДок);
	ПолеСписокСобытий.ОтображатьЗаголовки = Ложь;
	ПолеСписокСобытий.ОтображатьСетку     = Ложь;
	ПолеСписокСобытий.ТолькоПросмотр      = Истина;
	ПолеСписокСобытий.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ПолеСписокСобытий.АвтоМасштаб         = Истина;
	ПолеСписокСобытий.ТекущаяОбласть = ПолеСписокСобытий.Область(1, 1, 1, 1);
	
	// Обновим следующее событие
	Если Не ЗначениеЗаполнено(IDСледСобытия) Тогда
		Элементы.НадписьСледСобытие.Заголовок = "Не назначено";
		IDСледСобытия = Неопределено;
	Иначе
		Элементы.НадписьСледСобытие.Заголовок = КомментарийСледСобытия + " (" + СотрудникСледСобытия + ", " + Формат(ДатаСледСобытия, "ДЛФ=ДД") + ")";
	КонецЕсли;
	
	Элементы.СобытиеОтправкаНаОценкуТрейдИн.Видимость = ЕстьСобытиеОтправкиНаОценкуТрейдИн();
	
КонецПроцедуры // ОбновитьСписокСобытий()

// Определяет, существует ли событие "CRM_СобытияПоРабочимЛистам" на оценку по трейд-ин по рабочему листу
// 
// Возвращаемое значение:
//  Булево - Признак наличия события отправки на оценку по трейд-ин
//
&НаСервере
Функция ЕстьСобытиеОтправкиНаОценкуТрейдИн()
	
	ЕстьСобытие = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	CRM_СобытияПоРабочимЛистам.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
	|ГДЕ
	|	CRM_СобытияПоРабочимЛистам.IDK = &IDK
	|	И НЕ CRM_СобытияПоРабочимЛистам.ПометкаУдаления
	|	И НЕ CRM_СобытияПоРабочимЛистам.Обработано
	|	И CRM_СобытияПоРабочимЛистам.ВидСобытия = ЗНАЧЕНИЕ(Справочник.CRM_ВидыСобытий.ОценкаТрейдИн)";
	
	Запрос.УстановитьПараметр("IDK", Объект.IDK);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		ЕстьСобытие = Истина;
	КонецЕсли;
	
	Возврат ЕстьСобытие;
	
КонецФункции // ЕстьСобытиеОтправкиНаОценкуТрейдИн()

// Заполняет список коммерческих предложений клиенту по рабочему листу
//
&НаСервере
Процедура ОбновитьСписокКП()
	//Блинков изменил запрос для отображения основного КП основываясь на регистре а не на реквизите документа DMSREN-742
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_КП.РабочийЛист,
	|	CRM_КП.Ссылка,
	|	CRM_КП.Дата КАК Дата,
	|	CRM_КП.Состав.(
	|		Ссылка,
	|		НомерСтроки,
	|		Конфигурация,
	|		Сумма,
	|		Конфигурация.Модель,
	|		Конфигурация.Версия,
	|		Конфигурация.Автомобиль,
	|		Конфигурация.Автомобиль.VIN
	|	) КАК СоставКП,
	|	CRM_КП.Номер,
	|	CRM_КП.Представление КАК Конфигурация,
	|	CRM_КП.Сумма КАК Сумма,
	|	CRM_КП.ДатаНачалаПередачиАвто,
	|	CRM_КП.ДатаОкончанияПередачиАвто,
	|	ВЫБОР
	|		КОГДА CRM_ВоронкаПродаж.Объект ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОсновноеКП
	|ИЗ
	|	Документ.CRM_КоммерческоеПредложение КАК CRM_КП
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ВоронкаПродаж КАК CRM_ВоронкаПродаж
	|		ПО CRM_КП.Ссылка = CRM_ВоронкаПродаж.Объект
	|			И (CRM_ВоронкаПродаж.ЭтапПродаж = ЗНАЧЕНИЕ(Справочник.CRM_ЭтапыПродаж.КоммерческоеПредложение))
	|ГДЕ
	|	CRM_КП.РабочийЛист = &РабочийЛист
	|	И CRM_КП.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("РабочийЛист", Объект.IDK);
	ТаблицаКоммерческихПредложений = Запрос.Выполнить().Выгрузить();
	
	ТаблицаКоммерческихПредложений.Колонки.Добавить("ПериодВыдачиОриентировочный", Новый ОписаниеТипов("Строка"));
	
	Для Каждого Строка Из ТаблицаКоммерческихПредложений Цикл
		НужнаЗапятая = Ложь;
		Строка.Конфигурация = "";
		
		Если Строка.ДатаНачалаПередачиАвто = Дата(1, 1, 1) И Строка.ДатаОкончанияПередачиАвто = Дата(1, 1, 1) Тогда
			Строка.ПериодВыдачиОриентировочный = "";
		Иначе	
			Строка.ПериодВыдачиОриентировочный = ""+Формат(Строка.ДатаНачалаПередачиАвто, "ДЛФ=Д")+" - "+Формат(Строка.ДатаОкончанияПередачиАвто, "ДЛФ=Д");
		КонецЕсли;	
		
		Для Каждого СтрокаКонфигурации Из Строка.СоставКП Цикл
			
			//Наименование
			Если НужнаЗапятая Тогда
				Строка.Конфигурация = Строка.Конфигурация + ", ";
			КонецЕсли;
			НужнаЗапятая = Истина;
			Строка.Конфигурация = Строка.Конфигурация + Строка(СтрокаКонфигурации.КонфигурацияМодель) + " " + Строка(СтрокаКонфигурации.КонфигурацияВерсия);
			Если ЗначениеЗаполнено(СтрокаКонфигурации.КонфигурацияАвтомобиль) Тогда
				Строка.Конфигурация = Строка.Конфигурация + " (" + СтрокаКонфигурации.КонфигурацияАвтомобильVIN + ")";
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаКП.Загрузить(ТаблицаКоммерческихПредложений);
	
	Если ТаблицаКП.Количество() = 1 Тогда
		
		Элементы.ТаблицаКП.ПодчиненныеЭлементы.ТаблицаКПОсновноеКП.Видимость = Ложь;
		
	ИначеЕсли ТаблицаКП.Количество() > 1 Тогда
		
		Элементы.ТаблицаКП.ПодчиненныеЭлементы.ТаблицаКПОсновноеКП.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры // ОбновитьСписокКП()

// Заполнение табличного документа "ТаблоТестДрайв"
//
&НаСервере
Процедура ОбновитьСписокТестДрайвов()
	
	ТаблоТестДрайв.Очистить();
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет = РегистрыСведений.Renault_РабочиеЛисты.ПолучитьМакет("ЗаписиНаТестДрайв");

	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заголовок = "Тест-драйв клиента";
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаписиНаТестДрайв.IDK,
	|	ЗаписиНаТестДрайв.Автомобиль.Модель КАК МодельАвтомобиля,
	|	ЗаписиНаТестДрайв.Менеджер КАК Сотрудник,
	|	ЗаписиНаТестДрайв.Подразделение КАК Подразделение,
	|	ЗаписиНаТестДрайв.ДатаНачала КАК Дата,
	|	ПРЕДСТАВЛЕНИЕ(ЗаписиНаТестДрайв.Регистратор.СтатусДокумента) КАК Комментарий,
	|	ЗаписиНаТестДрайв.Статус КАК Статус,
	|	CRM_СобытияПоРабочимЛистам.Ссылка КАК Ссылка,
	|	ЗаписиНаТестДрайв.Регистратор.Номер КАК Номер
	|ИЗ
	|	РегистрСведений.CRM_ЗаписиНаТестДрайв КАК ЗаписиНаТестДрайв
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
	|		ПО ЗаписиНаТестДрайв.Регистратор = CRM_СобытияПоРабочимЛистам.Объект
	|ГДЕ
	|	ЗаписиНаТестДрайв.IDK = &IDK
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";	
	
	Запрос.УстановитьПараметр("IDK", Объект.IDK);
	Выборка = Запрос.Выполнить().Выбрать();
	Нпп = 0;
	ТабличныйДокумент.НачатьАвтогруппировкуСтрок();
	
	Пока Выборка.Следующий() Цикл
		Нпп = Нпп + 1;
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		ОбластьМакета.Параметры.Нпп       = СокрЛП(Нпп);
		ОбластьМакета.Параметры.Дата      = СокрЛП(Формат(Выборка.Дата, "ДЛФ=DD"));
		ОбластьМакета.Параметры.Сотрудник = СокрЛП(Выборка.Сотрудник);
		ОбластьМакета.Параметры.Модель    = СокрЛП(Выборка.МодельАвтомобиля);
		Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			ОбластьМакета.Параметры.Ссылка = Выборка.Ссылка;
		КонецЕсли;
		ОбластьМакета.Параметры.Номер = Выборка.Номер;
		ОбластьМакета.Параметры.Комментарий = СокрЛП(Выборка.Статус);
		ТабличныйДокумент.Вывести(ОбластьМакета, 2, Ложь);
	КонецЦикла;
	
	ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку     = Ложь;
	ТабличныйДокумент.ТолькоПросмотр      = Истина;
	
	ТаблоТестДрайв.Вывести(ТабличныйДокумент);
	
	ТаблоТестДрайв.ОтображатьЗаголовки = Ложь;
	ТаблоТестДрайв.ФиксацияСверху      = 5;
	ТаблоТестДрайв.ОтображатьСетку     = Ложь;
	ТаблоТестДрайв.ТолькоПросмотр      = Истина;
	ТаблоТестДрайв.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТаблоТестДрайв.АвтоМасштаб         = Истина;
	ТаблоТестДрайв.ТекущаяОбласть = ТаблоТестДрайв.Область(1, 1, 1, 1);
	
КонецПроцедуры // ОбновитьСписокТестДрайвов()

// Заполнение таблицы значений "Договоры"
//
&НаСервере
Процедура ОбновитьСписокКонтрактов()
	
	Договоры.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	Документ.Renault_Договор КАК Renault_Договор
	|ГДЕ
	|	Renault_Договор.РабочийЛист = &РабочийЛист
	|
	|УПОРЯДОЧИТЬ ПО
	|	Renault_Договор.ДатаДоговора УБЫВ";
	
	Запрос.УстановитьПараметр("РабочийЛист", Объект.IDK);
	
	ТаблицаДоговоров = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка Из ТаблицаДоговоров Цикл
		НоваяСтрока = Договоры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
КонецПроцедуры // ОбновитьСписокКонтрактов()

// Заполнение таблицы значений "Выдачи"
//
&НаСервере
Процедура ОбновитьСписокВыдач()
	
	Выдачи.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_ЗаписьНаВыдачуАвтомобилиДляВыдачи.Ссылка.IDK КАК IDK,
	|	CRM_ЗаписьНаВыдачуАвтомобилиДляВыдачи.Ссылка.ЗонаВыдачи КАК ЗонаВыдачи,
	|	CRM_ЗаписьНаВыдачуАвтомобилиДляВыдачи.Ссылка.Статус КАК Статус,
	|	CRM_ЗаписьНаВыдачуАвтомобилиДляВыдачи.Ссылка.ДатаНачала КАК ДатаПлан,
	|	CRM_ЗаписьНаВыдачуАвтомобилиДляВыдачи.Ссылка.ДатаВыдачи КАК ДатаФакт,
	|	ВЫБОР
	|		КОГДА CRM_ЗаписьНаВыдачуАвтомобилиДляВыдачи.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыДокументаЗаписьНаВыдачу.Отменено)
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ПриоритетСтатуса,
	|	CRM_ЗаписьНаВыдачуАвтомобилиДляВыдачи.Ссылка КАК Ссылка,
	|	CRM_ЗаписьНаВыдачуАвтомобилиДляВыдачи.Ссылка.VIN КАК Автомобили
	|ИЗ
	|	Документ.CRM_ЗаписьНаВыдачу.АвтомобилиДляВыдачи КАК CRM_ЗаписьНаВыдачуАвтомобилиДляВыдачи
	|ГДЕ
	|	CRM_ЗаписьНаВыдачуАвтомобилиДляВыдачи.Ссылка.IDK = &IDK";
	
	Запрос.УстановитьПараметр("IDK", Объект.IDK);
	//Запрос.УстановитьПараметр("ВидСобытия", Справочники.CRM_ВидыСобытий.Выдача);
	
	ВыборкаВыдач = Запрос.Выполнить().Выбрать();
	Пока ВыборкаВыдач.Следующий() Цикл
		
		////Список авто надо конкатинировать
		//ВыборкаАвтомобили = ВыборкаВыдач.АвтомобилиДляВыдачи.Выбрать();
		//СтрокаАвтомобили = "";
		//НужнаЗапятая = Ложь;
		//Пока ВыборкаАвтомобили.Следующий() Цикл
		//	Если НужнаЗапятая Тогда
		//		СтрокаАвтомобили = СтрокаАвтомобили + ", ";
		//	Иначе
		//		НужнаЗапятая = Истина;
		//	КонецЕсли;
		//	СтрокаАвтомобили = СтрокаАвтомобили + ВыборкаАвтомобили.VIN;
		//КонецЦикла;
		
		НоваяСтрока = Выдачи.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаВыдач);
		//НоваяСтрока.Автомобили = СтрокаАвтомобили;
		
	КонецЦикла;             //Блинков в рамках задачи DMSREN-678 Перписал запрос и обработку заполения тч не верно основвывался на событии по РЛ а должен основываться на документе ЗаписьНаВыдачу
	
КонецПроцедуры // ОбновитьСписокВыдач()

// Заполнение таблицы значений "Резервы"
//
&НаСервере
Процедура ОбновитьСписокРезервов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	(ВЫРАЗИТЬ(Renault_РезервированиеАвтомобилей.Автомобиль.Модель.НаименованиеПолное КАК СТРОКА(100))) + "" "" + (ВЫРАЗИТЬ(Renault_РезервированиеАвтомобилей.Автомобиль.ВариантКомплектации.НаименованиеПолное КАК СТРОКА(200))) КАК Автомобиль,
	|	Renault_РезервированиеАвтомобилей.VIN КАК VIN,
	|	Renault_РезервированиеАвтомобилей.Дата КАК Дата,
	|	Renault_РезервированиеАвтомобилей.ДатаСнятияРезерва КАК ДатаСнятияРезерва,
	|	Renault_РезервированиеАвтомобилей.СтатусРезерва КАК Статус
	|ИЗ
	|	Документ.Renault_РезервированиеАвтомобилей КАК Renault_РезервированиеАвтомобилей
	|ГДЕ
	|	Renault_РезервированиеАвтомобилей.РабочийЛист = &РабочийЛист";
	
	Запрос.УстановитьПараметр("РабочийЛист", Объект.IDK);
	
	ТаблицаРезервы = Запрос.Выполнить().Выгрузить();
	Резервы.Загрузить(ТаблицаРезервы);
	
КонецПроцедуры // ОбновитьСписокРезервов()

// Установка цвета фона кнопки "ВажнаяСделка"
//
&НаКлиенте
Процедура ОбновитьЦветКнопкиВажность()
	
	Если Объект.Важность Тогда
  		Элементы.ВажнаяСделка.ЦветФона = ЦветРено;
  		Элементы.ВажнаяСделка.Заголовок = "[!]      Важная сделка";
 	Иначе
  		Элементы.ВажнаяСделка.ЦветФона = Новый Цвет(156, 166, 178);
  		Элементы.ВажнаяСделка.Заголовок = "Важная сделка";
 	КонецЕсли;
	
КонецПроцедуры // ОбновитьЦветКнопкиВажность()

// Устанавливает цвета фона для кнопок "УспешнаяПродажа" и "ЗапросНаЗакрытие"
//
&НаКлиенте
Процедура ОбновитьОтображениеКнопокЗакрытия()
	
	ВыделятьУпущен = Ложь;
	ВыделятьПродан = Ложь;
	Элементы.УспешнаяПродажа.ЦветФона 	= Новый Цвет (156, 166, 178);
	Элементы.КлиентУпущен.ЦветФона 		= Новый Цвет (156, 166, 178);
	
	Если Объект.ЗапросНаЗакрытие Тогда
		
		Если Объект.ПричинаЗакрытия = Справочники.CRM_ПричиныЗакрытияРЛ.УспешнаяПродажа Тогда
			ВыделятьПродан = Истина;
		Иначе
			ВыделятьУпущен = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВыделятьПродан Тогда
		Элементы.УспешнаяПродажа.ЦветФона 	= ЦветРено;
	ИначеЕсли ВыделятьУпущен Тогда
		Элементы.КлиентУпущен.ЦветФона 	= ЦветРено;
	КонецЕсли;
	
КонецПроцедуры // ОбновитьОтображениеКнопокЗакрытия()

// Устанавливает цвет фона и цвет рамки для кнопок на странице "ГруппаСтраницаРОП"
//
&НаКлиенте
Процедура ОбновитьЦветКнопокРОП()
	
	Кнопка = Элементы.ПодтвердитьЗакрытие;
	Если Объект.ЛистЗакрыт Тогда
		Кнопка.ЦветРамки 	= ЦветРено;
		Кнопка.ЦветТекста 	= ЦветРено;
		Кнопка.ЦветФона 	= ЦветБелый;
	Иначе
		Кнопка.ЦветРамки 	= ЦветБелый;
		Кнопка.ЦветТекста 	= ЦветБелый;
		Кнопка.ЦветФона 	= ЦветСерый;
	КонецЕсли;
	
КонецПроцедуры // ОбновитьЦветКнопокРОП()

// Устанавливает цвет фона кнопки "КарточкаКлиента"
//
&НаКлиенте
Процедура ОбновитьЦветКнопкиКарточкаКлиента()
	
	Элементы.КарточкаКлиента.ЦветФона 			= ЦветРено;
	Элементы.КарточкаКлиентаПродажа.ЦветФона 	= ЦветРено;
	Элементы.КарточкаКлиентаТрейдИн.ЦветФона 	= ЦветРено;
	
КонецПроцедуры // ОбновитьЦветКнопкиКарточкаКлиента()

// Устанавливает возможность открытия страницы "ГруппаСтраницаРОП" и доступность кнопки "Изменить выдачу"
//
&НаСервере
Процедура ОбновитьДоступностьПолей() 
	
	ЕстьПраваРОП = Renault_РаботаСПравамиПользователя.ЕстьПравоИспользоватьАрмРОП(ПараметрыСеанса.Пользователь);
	Элементы.РОП.Видимость = ЕстьПраваРОП;
	
	ЕстьПравоНаИзменениеДатыВыдачи = ПраваРено.ПравоНаИзменениеДатыВыдачиАвтомобиля;
	Элементы.ИзменитьВыдачу.Доступность = ЕстьПравоНаИзменениеДатыВыдачи;
	
КонецПроцедуры // ОбновитьДоступностьПолей()

// Блокирует рабочий лист для редактирования
//
&НаСервере
Процедура ЗаблокироватьРЛ() Экспорт
	
	ТолькоПросмотр = Истина;
	Элементы.ТаблицаКП.Доступность = Ложь;
	МассивИменБезБлока = Новый Массив();
	МассивИменБезБлока.Добавить("СводныйОтчет");
	МассивИменБезБлока.Добавить("Закрыть");
	//МассивИменБезБлока.Добавить("ОбновитьКоммерческиеПредложения");
	МассивИменБезБлока.Добавить("ОбновитьСписокСобытий");
	МассивИменБезБлока.Добавить("ТаблоКоментарии");     
    //МассивИменБезБлока.Добавить("ДиалогКомментария");
	//МассивИменБезБлока.Добавить("ВводКомментарияОК");
	//МассивИменБезБлока.Добавить("ВводКомментарияОтмена");
	
	Для Каждого ТекущийЭлемент Из Элементы Цикл
		
		Если ТипЗнч(ТекущийЭлемент) = Тип("КнопкаФормы") Тогда
			Если МассивИменБезБлока.Найти(ТекущийЭлемент.Имя)= Неопределено Тогда
				ТекущийЭлемент.Доступность = Ложь;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ТекущийЭлемент) = Тип("ТаблицаФормы")Тогда
			Если МассивИменБезБлока.Найти(ТекущийЭлемент.Имя)= Неопределено Тогда
				ТекущийЭлемент.Доступность = Ложь;
			КонецЕсли;
	    ИначеЕсли ТипЗнч(ТекущийЭлемент) = Тип("ПолеТабличногоДокументаФормы")Тогда
			Если МассивИменБезБлока.Найти(ТекущийЭлемент.Имя)= Неопределено Тогда
				ТекущийЭлемент.Доступность = Ложь;
			КонецЕсли;
        ИначеЕсли ТипЗнч(ТекущийЭлемент) = Тип("ПолеВводаФормы")Тогда
			Если МассивИменБезБлока.Найти(ТекущийЭлемент.Имя)= Неопределено Тогда
				ТекущийЭлемент.Доступность = Ложь;
			КонецЕсли;

		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаблокироватьРЛ()

// Заполняет реквизиты формы, связанные с клиентом
//
&НаСервере
Процедура ОбновитьСтатусКорпКлиента()
	
	ЕстьПравоКорпПродажи = Renault_РаботаСПравамиПользователя.ЕстьПравоКорпПродажи(ПараметрыСеанса.Пользователь);
	
	Если Не ЕстьПравоКорпПродажи Тогда
		Элементы.ГруппаОсновнаяИнформацияШапкаЛевая.Видимость = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Клиент) И Объект.ТипКлиента = Перечисления.Renault_ТипыКлиентов.КорпоративныйКлиент Тогда
		
		ИНН = Объект.Клиент.ИНН;		
		
		Если Не ЗначениеЗаполнено(Клиент_КорпоративныйКонтЛицоФИО) Тогда 			
			Клиент_КорпоративныйКонтЛицо = Справочники.Контрагенты.НайтиПоРеквизиту("ВедушийКонтрагент", Объект.Клиент);
			Клиент_КорпоративныйКонтЛицоФИО = Клиент_КорпоративныйКонтЛицо.Наименование;	
		КонецЕсли;
		
	КонецЕсли;    
	
	Если Не ЗначениеЗаполнено(Объект.Клиент) ИЛИ (ТипЗнч(Объект.Клиент) <> Тип("СправочникСсылка.Контрагенты")) Тогда
		КорпКлиентСтатус = "Не создан";
		Элементы.КОРП.Видимость = Ложь;
		Элементы.ГруппаСтраницаКОРППотенциальныйКлиент.Видимость = Истина;
		Элементы.ГруппаСтраницаКОРПКлиент.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.КОРП.Видимость = Истина;
	Элементы.ГруппаСтраницаКОРППотенциальныйКлиент.Видимость = Ложь;
	Элементы.ГруппаСтраницаКОРПКлиент.Видимость = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_КорпоративныеКлиенты.Ссылка
	|ИЗ
	|	Справочник.Renault_КорпоративныеКлиенты КАК Renault_КорпоративныеКлиенты
	|ГДЕ
	|	Renault_КорпоративныеКлиенты.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Объект.Клиент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		// Если корп клиент не найден, то создадим его по корреспонденту.
		// Делается для всех корреспондентов, т.к. физ. лицо тоже может претендовать на корпоративную скидку.
		КорпКлиентОбъект = Справочники.Renault_КорпоративныеКлиенты.СоздатьЭлемент();
		КорпКлиентОбъект.Наименование = RenaultFlotte_ОтправкаЗагрузкаКлиентов.ПривестиНаименованиеВТребуемыйВид(Объект.Клиент.Наименование);
		КорпКлиентОбъект.Контрагент = Объект.Клиент;
		КорпКлиентОбъект.Менеджер = Объект.Сотрудник;
		КорпКлиентОбъект.Состояние = Перечисления.Renault_СостоянияСогласованияКлиента.Черновик;
		КорпКлиентОбъект.Автор = Объект.Сотрудник;
		КорпКлиентОбъект.ИдЗаявки = Новый УникальныйИдентификатор();		
		Если ЗначениеЗаполнено(Клиент_СфераДеятельности) Тогда
			СтрокаСфераДеятельности  = КорпКлиентОбъект.СферыДеятельности.Добавить(); 
			СтрокаСфераДеятельности.СфераДеятельности = Клиент_СфераДеятельности;
		КонецЕсли;			
		Если ЗначениеЗаполнено(Клиент_АвтопаркМарка) Тогда
			СтрокаАвтопарк            = КорпКлиентОбъект.Автопарк.Добавить();
			СтрокаАвтопарк.Марка      = Клиент_АвтопаркМарка;
			СтрокаАвтопарк.Модель     = Клиент_АвтопаркМодель;
            СтрокаАвтопарк.Количество = Клиент_АвтопаркКоличество;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Клиент_КорпоративныйКонтЛицо) Тогда
			СохранитьДанныеКонтактногоЛица();
        КонецЕсли;			
		КорпКлиентОбъект.Записать();
		КорпКлиент = КорпКлиентОбъект.Ссылка;
		КорпКлиентСтатус = Строка(КорпКлиент.Состояние);
	Иначе
		КорпКлиент = Выборка.Ссылка;
		КорпКлиентСтатус = Строка(КорпКлиент.Состояние);
		Если КорпКлиент.СферыДеятельности.Количество()>0 Тогда
			Клиент_СфераДеятельности  = КорпКлиент.СферыДеятельности[0].СфераДеятельности; 
		КонецЕсли;
		
		Если КорпКлиент.Автопарк.Количество() > 0 Тогда
			Клиент_АвтопаркМарка      = КорпКлиент.Автопарк[0].Марка;
			Клиент_АвтопаркМодель     = КорпКлиент.Автопарк[0].Модель;
			Клиент_АвтопаркКоличество = КорпКлиент.Автопарк[0].Количество;
		КонецЕсли;		
	КонецЕсли;
	
	Элементы.ОтправитьНаСогласование.Доступность = Истина;
	Элементы.ПерейтиКЗаявкамНаСкидки.Доступность = Истина;
	Если КорпКлиент.Состояние <> Перечисления.Renault_СостоянияСогласованияКлиента.Черновик Тогда
		Элементы.ОтправитьНаСогласование.Доступность = Ложь;
	КонецЕсли;
	Если КорпКлиент.Состояние <> Перечисления.Renault_СостоянияСогласованияКлиента.Согласован Тогда
		Элементы.ПерейтиКЗаявкамНаСкидки.Доступность = Ложь;
	КонецЕсли;

	ОбновитьКнопкиТипКлиента();
	
КонецПроцедуры //ОбновитьСтатусКорпКлиента()

// Создает элемент справочника "Контрагенты" или "CRM_ПотенциальныеКонтрагенты"
//
&НаСервере
Процедура СохранитьДанныеКонтактногоЛица()

	Если ТипЗнч(Объект.Клиент) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(Клиент_КорпоративныйКонтЛицоФИО) Тогда		

		НовыйЭлемент = Справочники.Контрагенты.СоздатьЭлемент();
		НовыйЭлемент.УстановитьНовыйКод();
		НовыйЭлемент.ВидКонтрагента     = Перечисления.ВидыКонтрагентов.КонтактноеЛицо;
		НовыйЭлемент.ВедушийКонтрагент  = Объект.Клиент;
		НовыйЭлемент.ВидОтношений       = Справочники.ВидыВзаимоотношений.КонтактноеЛицо;
		НовыйЭлемент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо;
		НовыйЭлемент.НаименованиеПолное = Клиент_КорпоративныйКонтЛицоФИО;
		НовыйЭлемент.СогласиеНаОбработкуПерсональныхДанных     = Перечисления.ВариантыОтветов.Спрашивать;
		НовыйЭлемент.Наименование       = Клиент_КорпоративныйКонтЛицоФИО;
		CRM_Сервер.РазбитьФИО(Клиент_КорпоративныйКонтЛицоФИО, НовыйЭлемент.Фамилия, НовыйЭлемент.Имя, НовыйЭлемент.Отчество);
		НовыйЭлемент.Записать();
		
		Клиент_КорпоративныйКонтЛицо = НовыйЭлемент.Ссылка;
		
	КонецЕсли;        

	Если ТипЗнч(Объект.Клиент) = Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты") И ЗначениеЗаполнено(Клиент_КорпоративныйКонтЛицоФИО) Тогда		

		НовыйЭлемент = Справочники.CRM_ПотенциальныеКонтрагенты.СоздатьЭлемент();
		НовыйЭлемент.УстановитьНовыйКод();
		НовыйЭлемент.ВидКонтрагента     = Перечисления.ВидыКонтрагентов.КонтактноеЛицо;
		НовыйЭлемент.Renault_ВедушийКонтрагент  	= Объект.Клиент;
		НовыйЭлемент.ВидОтношений       = Справочники.ВидыВзаимоотношений.КонтактноеЛицо;
		НовыйЭлемент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо;
		НовыйЭлемент.НаименованиеПолное = Клиент_КорпоративныйКонтЛицоФИО;
		НовыйЭлемент.СогласиеНаОбработкуПерсональныхДанных     = Перечисления.ВариантыОтветов.Спрашивать;
		НовыйЭлемент.Наименование       = Клиент_КорпоративныйКонтЛицоФИО;
		CRM_Сервер.РазбитьФИО(Клиент_КорпоративныйКонтЛицоФИО, НовыйЭлемент.Фамилия, НовыйЭлемент.Имя, НовыйЭлемент.Отчество);
		НовыйЭлемент.Записать();
		
		Клиент_КорпоративныйКонтЛицо = НовыйЭлемент.Ссылка;
		
	КонецЕсли;

КонецПроцедуры // СохранитьДанныеКонтактногоЛица()

// Управляет видимостью и оформлением кнопок в зависимости от типа клиента
//
&НаСервере
Процедура ОбновитьКнопкиТипКлиента()
	
	Если Не ЗначениеЗаполнено(Объект.ТипКлиента) Тогда
		Объект.ТипКлиента = Перечисления.Renault_ТипыКлиентов.РозничныйКлиент;
	КонецЕсли;
	
	ДанныеКорпКлиента = ПолучитьИдентификаторКорпКлиента();  
	Если ДанныеКорпКлиента <> Неопределено Тогда
		КорпКлиент = ДанныеКорпКлиента.КорпКлиент;
		ИдентификаторКорпКлиента = ДанныеКорпКлиента.ИдентификаторКорпКлиента;
	Иначе
		КорпКлиент = "";
		ИдентификаторКорпКлиента = "";
	КонецЕсли;
		
	Если Объект.ТипКлиента = Перечисления.Renault_ТипыКлиентов.РозничныйКлиент Тогда
		Элементы.РозничныйКлиент.ЦветФона = ЦветРено;		
		Элементы.КорпоративныйКлиент.ЦветФона = ЦветRenault1;
		Элементы.КОРП.Видимость = Ложь;
		Элементы.ГруппаСтраницыКлиента.ТекущаяСтраница = Элементы.ГруппаСтраницаКлиент;
		
		Элементы.НадписьДанныеКорпКлиентаЗаполнены.Заголовок = "";
		Элементы.НадписьДанныеКорпКлиентаЗаполнены.Видимость = Ложь;
		
		Элементы.Кредит.Видимость 	= Истина;
		Элементы.Кредит.Доступность = Истина;
		Элементы.Лизинг.Видимость 	= Ложь;
		Элементы.Лизинг.Доступность = Ложь;
		
	ИначеЕсли Объект.ТипКлиента = Перечисления.Renault_ТипыКлиентов.КорпоративныйКлиент Тогда
		
		Если ЗначениеЗаполнено(КорпКлиент) Тогда
			ДанныеЗаполнены = ДанныеКорпКлиентаЗаполнены(КорпКлиент); 
			Если ДанныеЗаполнены Тогда
				ЗаголовокНадписьДанныеКорпКлиентаЗаполнены = "Все обязательные поля корп.клиента заполнены";
			Иначе
				ЗаголовокНадписьДанныеКорпКлиентаЗаполнены = "Не все обязательные поля корп.клиента заполнены";
			КонецЕсли;
		Иначе
			ДанныеЗаполнены = Ложь;
			ЗаголовокНадписьДанныеКорпКлиентаЗаполнены = "Корп.клиент не зарегестрирован";
		КонецЕсли;
		
		Элементы.РозничныйКлиент.ЦветФона = ЦветRenault1;
		Элементы.КорпоративныйКлиент.ЦветФона = ЦветРено;		
		Элементы.КОРП.Видимость = Истина;
		Элементы.ГруппаСтраницыКлиента.ТекущаяСтраница = Элементы.ГруппаСтраницаКорпоративныйКлиент;
		
		Элементы.НадписьДанныеКорпКлиентаЗаполнены.Заголовок = ЗаголовокНадписьДанныеКорпКлиентаЗаполнены;
		Элементы.НадписьДанныеКорпКлиентаЗаполнены.Видимость = Истина;
		
		Элементы.Кредит.Видимость 	= Ложь;
		Элементы.Кредит.Доступность = Ложь;
		Элементы.Лизинг.Видимость 	= Истина;
		Элементы.Лизинг.Доступность = Истина;
		
	КонецЕсли;
	
	Воронка_ОбновитьMYRenault();
	Воронка_ОбновитьРегистрациюКлиентаВБазеРеноРоссия();

	//ПодвинутьКнопки();
	
КонецПроцедуры // ОбновитьКнопкиТипКлиента()

// Проверяет заполненность необходимых данных у корпоративного клиента
//
// Параметры:
//  СсылкаКорпКлиент - СправочникСсылка.Контрагенты	 - Ссылка на корпоративного клиента
// 
// Возвращаемое значение:
//  Булево - Признак того, что необходимые данные по клиенту заполнены
//
&НаСервере
Функция ДанныеКорпКлиентаЗаполнены(СсылкаКорпКлиент)
	
	ДанныеЗаполнены = Ложь;
	
	ОбъектКорпКлиент = СсылкаКорпКлиент.ПолучитьОбъект();
	
	ОбъектКорпКлиент.ПроверитьДанныеДляСогласования(ДанныеЗаполнены, СсылкаКорпКлиент.Контрагент);
	
	ДанныеЗаполнены = НЕ ДанныеЗаполнены;
	
	Если Не ЗначениеЗаполнено(СсылкаКорпКлиент.Контрагент.ИНН) Тогда
		Сообщить("Не заполнен ИНН.");
		ДанныеЗаполнены = Ложь;
	КонецЕсли;
	
	Возврат ДанныеЗаполнены;
	
КонецФункции // ДанныеКорпКлиентаЗаполнены()

// Заполнение истории комментариев
//
&НаКлиенте
Процедура ЗаполнитьСписокКомментариев()
	
	//ОтключитьОбработчикОжидания("ЗаполнитьСписокКомментариев");
	ИсторияКомментариев = ПолучитьИсториюКомментариев(КорпКлиент.ИдЗаявки);
			
	//ПодключитьОбработчикОжидания("ЗаполнитьСписокКомментариев", 3, Ложь);
	
КонецПроцедуры // ЗаполнитьСписокКомментариев() 

// Возвращает историю комментариев по идентификатору заявки
//
// Параметры:
//  ИдЗаявки - Строка	 - Идентификатор заявки корп. клиента
// 
// Возвращаемое значение:
//  Строка - История комментариев
//
&НаСервере
Функция ПолучитьИсториюКомментариев(ИдЗаявки)
	
	Возврат РегистрыСведений.RenaultFlotte_ИсторияКомментариев.ПолучитьКомментарииПоОбъектуСтрокой(ИдЗаявки);
	
КонецФункции // ПолучитьИсториюКомментариев()

// Устанавливает тип рабочего листа и начальные настройки для трейд-ин
//
// Параметры:
//  ПраваРено	 - ФиксированнаяСтруктура	 - Права пользователя
//
&НаКлиенте
Процедура ОпределитьНеобходимостьФункционалаТрейдИн(ПраваРено)
	
	Если НЕ ЗначениеЗаполнено(Объект.ТипРабочегоЛиста) Тогда
		Если Объект.Отдел.КлассификацияRenault = Перечисления.CRM_КлассификацияОтделов.ОтделТрейдИн И Не РЛПоПродаже Тогда
			Объект.ТипРабочегоЛиста = Перечисления.Renault_ТипыРабочихЛистов.TradeIn;
		Иначе
			Объект.ТипРабочегоЛиста = Перечисления.Renault_ТипыРабочихЛистов.Продажа; 
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьНачальныеЗначенияДляТрейдИн(Истина, ПраваРено.Продажи_РазрешитьВРЛРасширенногоФункционалаТрейдИн, Объект.ТипРабочегоЛиста); 	
		
КонецПроцедуры // ОпределитьНеобходимостьФункционалаТрейдИн()


// Заполняет свойства элементов управления и значения реквизитов в зависимости от типа рабочего листа продажи/трейд-ин
//
// Параметры:
//  ЭтоПродажаПрава	 - Булево	 										- Признак продажи
//  ЭтоТрейдИнПрава	 - Булево	 										- Признак трейд-ин
//  ТипРабочегоЛиста - ПеречислениеСсылка.Renault_ТипыРабочихЛистов	 	- Тип рабочего листа продажа/трейд-ин
//
&НаКлиенте
Процедура ЗаполнитьНачальныеЗначенияДляТрейдИн(ЭтоПродажаПрава, ЭтоТрейдИнПрава, ТипРабочегоЛиста)
	
	Перем ПараметрыУправленияЭлементами;
	Перем ПараметрыУправленияСтраницами;
	
	Если ЭтоТрейдИнПрава Тогда
		
		Если ТипРабочегоЛиста = Перечисления.Renault_ТипыРабочихЛистов.TradeIn Тогда
			СессияТрейдИн = Renault_РаботаСРабочимиЛистамиПовтИсп.СессияДляТрейдИн();
			Renault_РаботаСРабочимиЛистами.ЗагрузитьСправочникиТрейдИн(СессияТрейдИн);
			
			ЗаявкаНаТрейдИн = ПолучитьЗаявкуНаТрейдИн(Объект.IDK);			
			
			Значение = ЗначениеЗаполнено(ЗаявкаНаТрейдИн);
			Если Значение Тогда
				
				ПроизводительТрейдИн = ЗаявкаНаТрейдИн.ПроизводительКод;
				ГодВыпускаТрейдИн = ЗаявкаНаТрейдИн.ГодВыпуска;
				МодельТрейдИн = ЗаявкаНаТрейдИн.МодельКод;		
				ОжидаемаяСтоимостьКлиентаТрейдИн = ЗаявкаНаТрейдИн.ОжиданиеСтоимостиКлиента;
				ТипОперацииТрейдИн = ЗаявкаНаТрейдИн.ТипОперацииTradeIn;
				
				ЗаполнитьСписокВыбораЭлемента("ПроизводительТрейдИн");
				
				Если ЗначениеЗаполнено(ПроизводительТрейдИн) Тогда
					Если Элементы.ГодВыпускаТрейдИн.СписокВыбора.Количество() = 0 Тогда
						ЗаполнитьСписокВыбораЭлемента("ГодВыпускаТрейдИн");
					КонецЕсли;

				КонецЕсли;
				
				Если ЗначениеЗаполнено(ГодВыпускаТрейдИн) Тогда
					ЗаполнитьСписокВыбораЭлемента("МодельТрейдИн");
				КонецЕсли;
				
			Иначе
				
				СоздатьЗаявкуТрейдИн(Неопределено);
				
				Значение = ЗначениеЗаполнено(ЗаявкаНаТрейдИн);
				
			КонецЕсли;
			
			ПараметрыУправленияЭлементами = Новый Структура;
			ПараметрыУправленияЭлементами.Вставить("ГодВыпускаТрейдИн", ЗначениеЗаполнено(ПроизводительТрейдИн));
			ПараметрыУправленияЭлементами.Вставить("МодельТрейдИн", ЗначениеЗаполнено(ГодВыпускаТрейдИн));
			ПараметрыУправленияЭлементами.Вставить("ОжидаемаяСтоимостьКлиентаТрейдИн", ЗначениеЗаполнено(МодельТрейдИн));
			
		КонецЕсли;
		
	Иначе
		
		Если ТипРабочегоЛиста = Перечисления.Renault_ТипыРабочихЛистов.TradeIn Тогда
			
			Сообщить("Нет прав по работе с рабочими листами трейд-ин!");
			
			ЭтаФорма.Закрыть();
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыУправленияСтраницами = Новый Структура("ТипРабочегоЛиста", Объект.ТипРабочегоЛиста);	

	ОбновитьИнтерфейсТрейдИн(ПараметрыУправленияЭлементами, ПараметрыУправленияСтраницами);
	
	ОбновитьВоронкуИСпискиТрейдИн();
	
КонецПроцедуры // ЗаполнитьНачальныеЗначенияДляТрейдИн()

// Возвращает ссылку на заявку на трейд-ин IDK рабочего листа
//
// Параметры:
//  РабочийЛист	 - Строка	 - IDK рабочего листа
// 
// Возвращаемое значение:
//  ДокументСсылка.Renault_ЗаявкаНаТрейдИн - Заявка на трейд-ин по IDK рабочего листа
//
&НаСервере
Функция ПолучитьЗаявкуНаТрейдИн(РабочийЛист)
	
	Документ = Документы.Renault_ЗаявкаНаТрейдИн.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ЗаявкаНаТрейдИн.Ссылка КАК Документ
		|ИЗ
		|	Документ.Renault_ЗаявкаНаТрейдИн КАК Renault_ЗаявкаНаТрейдИн
		|ГДЕ
		|	НЕ Renault_ЗаявкаНаТрейдИн.ПометкаУдаления
		|	И Renault_ЗаявкаНаТрейдИн.РабочийЛист = &РабочийЛист
		|
		|УПОРЯДОЧИТЬ ПО
		|	Renault_ЗаявкаНаТрейдИн.МоментВремени УБЫВ";	
	Запрос.УстановитьПараметр("РабочийЛист", РабочийЛист);	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда	
		Выборка = Результат.Выбрать();		
		Выборка.Следующий();
		
		Документ = Выборка.Документ; 	
	КонецЕсли;
	
	Возврат Документ;
	
КонецФункции // ПолучитьЗаявкуНаТрейдИн()

// Заполняет списки выбора элементов формы
//
// Параметры:
//  ИмяЭлемента	 - Строка	 - Имя элемента формы
//
&НаСервере
Процедура ЗаполнитьСписокВыбораЭлемента(ИмяЭлемента)
	
	Если ИмяЭлемента = "ПроизводительТрейдИн" Тогда
		МассивЗначений = Renault_РаботаСРабочимиЛистами.СписокПроизводителейДляТрейдИн(СессияТрейдИн, "");
		
		Если МассивЗначений.Найти(ПроизводительТрейдИн) = Неопределено Тогда
			МассивЗначений.Добавить(ПроизводительТрейдИн);
		КонецЕсли;
		
	ИначеЕсли ИмяЭлемента = "ГодВыпускаТрейдИн" Тогда
		Если ПроизводительТрейдИн <> Неопределено Тогда
			МассивЗначений = Renault_РаботаСРабочимиЛистами.СписокГодовВыпускаДляТрейдИн(СессияТрейдИн, "", ПроизводительТрейдИн);		
			
			СписокЧисел = Новый СписокЗначений;
			Для Каждого Эл Из МассивЗначений Цикл
				СписокЧисел.Добавить(Формат(Число(Эл), "ЧГ=") + "          ");	// DMSREN-1210
			КонецЦикла;
			
			СписокЧисел.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
			
			МассивЗначений.Очистить();
			
			Для Каждого Эл Из СписокЧисел Цикл
				МассивЗначений.Добавить(Строка(Эл.Значение));
			КонецЦикла;
			
			Если МассивЗначений.Найти(ГодВыпускаТрейдИн) = Неопределено Тогда
				МассивЗначений.Добавить(Формат(ГодВыпускаТрейдИн,"ЧГ=") + "          ");   // DMSREN-1210 
			КонецЕсли;
		КонецЕсли;		
	ИначеЕсли ИмяЭлемента = "МесяцВыпускаТрейдИн" Тогда
		Если Элементы[ИмяЭлемента].СписокВыбора.Количество() = 0 Тогда
			Для Счетчик = 1 По 12 Цикл
				Если Счетчик < 10 Тогда
					Месяц = "0" + Счетчик;
				Иначе
					Месяц = "" + Счетчик;
				КонецЕсли;
				
				Элементы[ИмяЭлемента].СписокВыбора.Добавить(Месяц);	
			КонецЦикла;
		КонецЕсли;
		
		Возврат;
	ИначеЕсли ИмяЭлемента = "МодельТрейдИн" Тогда
		МассивЗначений = Renault_РаботаСРабочимиЛистами.СписокМоделейДляТрейдИн(СессияТрейдИн, "", ПроизводительТрейдИн, МесяцВыпускаТрейдИн, ГодВыпускаТрейдИн);		
		
		Если МассивЗначений.Найти(МодельТрейдИн) = Неопределено Тогда
			МассивЗначений.Добавить(МодельТрейдИн);
		КонецЕсли;
		
	ИначеЕсли ИмяЭлемента = "ПервичныйИнтересМодельВыбор" Тогда
		МассивЗначений = Renault_CRM.ПолучитьПервичныйИнтерес(Объект.ДилерскийЦентр);
	КонецЕсли;
	
	Элементы[ИмяЭлемента].СписокВыбора.Очистить();
	
	Если МассивЗначений <> Неопределено Тогда
	
		Для Каждого Значение Из МассивЗначений Цикл
			Элементы[ИмяЭлемента].СписокВыбора.Добавить(Значение);	
		КонецЦикла;
		
		Если МассивЗначений.Количество() = 1 Тогда
			ПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
			Если Лев(ПутьКДанным, 7) = "Объект." Тогда
				Объект[СтрЗаменить(ПутьКДанным, "Объект.", "")] = МассивЗначений[0];
			Иначе
				ЭтаФорма[ПутьКДанным] = МассивЗначений[0];
			КонецЕсли;
			
			ИмяСледующегоЭлемента = "";
			Если ИмяЭлемента = "ПроизводительТрейдИн" Тогда
				ЗаполнитьСписокВыбораЭлемента("ГодВыпускаТрейдИн");
				
				ПараметрыУправленияЭлементами = Новый Структура();
				ПараметрыУправленияЭлементами.Вставить("ГодВыпускаТрейдИн", Истина);
				//ПараметрыУправленияЭлементами.Вставить("МесяцВыпускаТрейдИн", Истина);
				
				ОбновитьИнтерфейсТрейдИн(ПараметрыУправленияЭлементами);
				
				Возврат; 
			КонецЕсли;		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСписокВыбораЭлемента()

// Управляет видимостью и доступностью элементов формы в зависимости от переданных параметров
//
// Параметры:
//  ПараметрыУправленияЭлементами	 - Структура	 -  Параметры установки видимости и доступности элементов формы
//  ПараметрыУправленияСтраницами	 - Структура	 -  Параметры отображения страниц элементов формы
//
&НаСервере
Процедура ОбновитьИнтерфейсТрейдИн(ПараметрыУправленияЭлементами = Неопределено, ПараметрыУправленияСтраницами = Неопределено)
	
	Если ПараметрыУправленияЭлементами <> Неопределено Тогда
		Для Каждого Элемент Из ПараметрыУправленияЭлементами Цикл
			Элементы[Элемент.Ключ].Доступность = Элемент.Значение;
		КонецЦикла;		
	КонецЕсли;
	
	Если ПараметрыУправленияСтраницами <> Неопределено Тогда
		ТипЛиста = ПараметрыУправленияСтраницами.ТипРабочегоЛиста;
		
		Элементы.ГруппаСтраницыАвтомобиль.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
			
		Элементы.ГруппаСтраницыПродажаПрием.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;

		Если ТипЛиста = Перечисления.Renault_ТипыРабочихЛистов.TradeIn Тогда
			Элементы.ГруппаСтраницыАвтомобиль.ТекущаяСтраница 		= Элементы.АвтомобильТрейдИн;
			Элементы.АвтомобильПродажа.Видимость 					= Ложь;
			Элементы.АвтомобильПродажаТрейдИн.Видимость 			= Истина;
			Элементы.АвтомобильТрейдИнПродажа.Видимость 			= Ложь;
			Элементы.АвтомобильТрейдИн.Видимость 					= Истина;
			Элементы.АвтомобильПродажаБУ.Видимость 					= Ложь;

			Элементы.ГруппаСтраницыПродажаПрием.ТекущаяСтраница = Элементы.ГруппаСтраницаПрием;
				
			Элементы.ГруппаОсновнаяИнформацияШапкаЛеваяСтраницы.ТекущаяСтраница = Элементы.ГруппаОсновнаяИнформацияШапкаЛеваяСтраницаТрейдИн;
			
			Элементы.Клиент_Город.Видимость = Ложь;
			//Элементы.НадписьEmail1.Видимость = Ложь;
			Элементы.НовыйАвтомобиль.Видимость = Ложь;
			Если Элементы.НовыйАвтомобиль.СписокВыбора.Количество() = 2 Тогда
				Элементы.НовыйАвтомобиль.СписокВыбора.Удалить(1);
			КонецЕсли;
			ЗаполнитьСписокВыбораЭлемента("ПервичныйИнтересМодель");
			
		Иначе
			Если Объект.ПродажаБУ Тогда
				Элементы.ГруппаСтраницыАвтомобиль.ТекущаяСтраница 	= Элементы.АвтомобильПродажаБУ;
				Элементы.АвтомобильПродажаБУ.Видимость 				= Истина; 
				Элементы.АвтомобильТрейдИнПродажа.Видимость 		= Истина;
				Элементы.АвтомобильПродажа.Видимость 				= Ложь;
				Элементы.ПодборАвто.Видимость 						= Ложь;
			Иначе
				Элементы.ГруппаСтраницыАвтомобиль.ТекущаяСтраница 	= Элементы.АвтомобильПродажа;
				Элементы.АвтомобильПродажа.Видимость 				= Истина;
				Элементы.АвтомобильПродажаБУ.Видимость 				= Ложь;
				Элементы.АвтомобильТрейдИнПродажа.Видимость 		= Истина;
				Элементы.ПодборАвто.Видимость 						= Истина;
			КонецЕсли;
			Элементы.АвтомобильПродажаТрейдИн.Видимость = Ложь;
			Элементы.АвтомобильТрейдИн.Видимость 		= Ложь;

			Элементы.ГруппаСтраницыПродажаПрием.ТекущаяСтраница = Элементы.ГруппаСтраницаПродажа;
				
			Элементы.ГруппаОсновнаяИнформацияШапкаЛеваяСтраницы.ТекущаяСтраница = Элементы.ГруппаОсновнаяИнформацияШапкаЛеваяСтраницаТипКлиента;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ОбновитьИнтерфейсТрейдИн()

// Вызывает обновление оформления и заполнение таблиц значений формы для типа рабочего листа "Трейд-Ин"
//
&НаСервере
Процедура ОбновитьВоронкуИСпискиТрейдИн()
	
	ОбновитьЦветаВоронкиТрейдИн();	
	ОбновитьСписокСобытий();
	ОбновитьКнопкиТипТрейдИн();
	
КонецПроцедуры // ОбновитьВоронкуИСпискиТрейдИн()

// Устанавливает оформление кнопок типа трейд-ин в зависимости от типа операции трейд-ин
//
&НаСервере
Процедура ОбновитьКнопкиТипТрейдИн()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.Renault_ТипыОперацийТрейдИн.TradeIn) КАК ТрейдИн,
	|	ЗНАЧЕНИЕ(Перечисление.Renault_ТипыОперацийТрейдИн.Комиссия) КАК Комиссия,
	|	ЗНАЧЕНИЕ(Перечисление.Renault_ТипыОперацийТрейдИн.Выкуп) КАК Выкуп";	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();	
	Выборка.Следующий();
	
	ТрейдИн = Выборка.ТрейдИн;
	Комиссия = Выборка.Комиссия;
	Выкуп = Выборка.Выкуп;
	
	Если НЕ ЗначениеЗаполнено(ТипОперацииТрейдИн) Тогда
		ТипОперацииТрейдИн = ТрейдИн;
	КонецЕсли;
	
	Если ТипОперацииТрейдИн = ТрейдИн Тогда
		
		Элементы.ТипТрейдИнТрейдИн.ЦветФона 	= ЦветРено;		
		Элементы.ТипТрейдИнВыкуп.ЦветФона 		= Новый Цвет (156, 166, 178);
		Элементы.ТипТрейдИнКомиссия.ЦветФона 	= Новый Цвет (156, 166, 178);		
		
	ИначеЕсли ТипОперацииТрейдИн = Комиссия Тогда
		
		Элементы.ТипТрейдИнТрейдИн.ЦветФона 	= Новый Цвет (156, 166, 178);		
		Элементы.ТипТрейдИнВыкуп.ЦветФона 		= Новый Цвет (156, 166, 178);
		Элементы.ТипТрейдИнКомиссия.ЦветФона 	= ЦветРено;	
		
	ИначеЕсли ТипОперацииТрейдИн = Выкуп Тогда
		
		Элементы.ТипТрейдИнТрейдИн.ЦветФона 	= Новый Цвет (156, 166, 178);		
		Элементы.ТипТрейдИнВыкуп.ЦветФона 		= ЦветРено;
		Элементы.ТипТрейдИнКомиссия.ЦветФона 	= Новый Цвет (156, 166, 178);	
		
	КонецЕсли;
	
КонецПроцедуры // ОбновитьКнопкиТипТрейдИн()

// Устанавливает свойства элементов группы "ГруппаДляСтатистики"
//
&НаСервере
Процедура ОбновитьПоляДляСтатистики()
	
	Если Объект.ТипРабочегоЛиста = Перечисления.Renault_ТипыРабочихЛистов.Продажа И НовыйАвтомобиль = 0 Тогда
		
		Объект.ТипПродажиВыкупа = "";
		Объект.Гарантия 		= "";
		Объект.СрокГарантии 	= "";
		
		Элементы.ТипПродажиВыкупа.Доступность 	= Ложь; 
		Элементы.Гарантия.Доступность 			= Ложь;
		Элементы.СрокГарантии.Доступность 		= Ложь;
		
	Иначе
		
		Элементы.ТипПродажиВыкупа.Доступность 	= Истина; 
		Элементы.Гарантия.Доступность 			= Истина;
		Элементы.СрокГарантии.Доступность 		= Истина;
		
		Элементы.ТипПродажиВыкупа.СписокВыбора.Очистить();
		Элементы.Гарантия.СписокВыбора.Очистить();
		Элементы.СрокГарантии.СписокВыбора.Очистить();
		
		Если Объект.ТипРабочегоЛиста = Перечисления.Renault_ТипыРабочихЛистов.TradeIn Тогда
			Для ч = 0 по Перечисления.Renault_Used_ТипыПоступленияАвто.Количество() - 1 Цикл
				Элементы.ТипПродажиВыкупа.СписокВыбора.Добавить(Строка(Перечисления.Renault_Used_ТипыПоступленияАвто[ч]));
			КонецЦикла;
		Иначе
			Для ч=0 по Перечисления.Renault_Used_ТипыПродажиАвто.Количество()- 1 Цикл
				Элементы.ТипПродажиВыкупа.СписокВыбора.Добавить(Строка(Перечисления.Renault_Used_ТипыПродажиАвто[ч]));
			КонецЦикла;
		КонецЕсли;
		Элементы.Гарантия.СписокВыбора.Добавить("Renault Selections (silver+)");
		Элементы.Гарантия.СписокВыбора.Добавить("Базовая (bronze+)");
		Элементы.Гарантия.СписокВыбора.Добавить("Нет");
		Элементы.СрокГарантии.СписокВыбора.Добавить(12);
		Элементы.СрокГарантии.СписокВыбора.Добавить(24);
		Если Объект.Гарантия = "Нет" Тогда 
			Элементы.СрокГарантии.Доступность = Ложь 
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОбновитьПоляДляСтатистики()

// Присутствие в базе организации с определенными ИНН
// 
// Возвращаемое значение:
//  Булево - Признак того, что в базе присутствует организация с ИНН "7813382729" или "7718752313"
//
&НаСервере
Функция ЭтоПетровский()
	
	Запрос=Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Поле1
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ИНН В(&МассивИНН)";
	
	МассивИНН=Новый Массив;
	МассивИНН.Добавить("7813382729");
	МассивИНН.Добавить("7718752313");
	Запрос.УстановитьПараметр("МассивИНН",МассивИНН);
	
	Возврат Не Запрос.Выполнить().Пустой()
	
КонецФункции // ЭтоПетровский()

// Включает видимость группы "ГруппаСправочнаяИнформация" и заполняет реквизиты формы:
// 	 "ОриентировочнаяЦенаТрейдИн", "ОценкаСуммыКредита", "СтоимостьКАСКО"
//
&НаСервере
Процедура УправлениеПанельюСтатистики()
	
	Элементы.ГруппаСправочнаяИнформация.Видимость = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Renault_РабочийЛистОФУРасчетКредита.СуммаКредита,
	|	Renault_РабочийЛистОФУФинансовыеУслуги.Стоимость КАК СтоимостьКАСКО,
	|	Renault_РабочийЛистОФУ.РабочийЛист
	|ПОМЕСТИТЬ Пакет1
	|ИЗ
	|	Документ.Renault_РабочийЛистОФУ КАК Renault_РабочийЛистОФУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_РабочийЛистОФУ.РасчетКредита КАК Renault_РабочийЛистОФУРасчетКредита
	|		ПО Renault_РабочийЛистОФУ.Ссылка = Renault_РабочийЛистОФУРасчетКредита.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_РабочийЛистОФУ.ФинансовыеУслуги КАК Renault_РабочийЛистОФУФинансовыеУслуги
	|		ПО Renault_РабочийЛистОФУ.Ссылка = Renault_РабочийЛистОФУФинансовыеУслуги.Ссылка
	|ГДЕ
	|	Renault_РабочийЛистОФУ.РабочийЛист = &РабочийЛист
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_ЗаявкаНаТрейдИн.ОриентировочнаяЦена,
	|	Пакет1.СуммаКредита,
	|	Пакет1.СтоимостьКАСКО
	|ИЗ
	|	Документ.Renault_ЗаявкаНаТрейдИн КАК Renault_ЗаявкаНаТрейдИн
	|		ЛЕВОЕ СОЕДИНЕНИЕ Пакет1 КАК Пакет1
	|		ПО Renault_ЗаявкаНаТрейдИн.РабочийЛист = Пакет1.РабочийЛист
	|ГДЕ
	|	Renault_ЗаявкаНаТрейдИн.РабочийЛист = &РабочийЛист";
	
	Запрос.УстановитьПараметр("РабочийЛист", Объект.IDK);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОриентировочнаяЦенаТрейдИн = ВыборкаДетальныеЗаписи.ОриентировочнаяЦена;
		ОценкаСуммыКредита = ВыборкаДетальныеЗаписи.СуммаКредита;
	 	СтоимостьКАСКО = ВыборкаДетальныеЗаписи.СтоимостьКАСКО;
	КонецЦикла;
	
КонецПроцедуры // УправлениеПанельюСтатистики()

// Возвращает документ согласия на обработку персональных данных по клиенту
// 
// Возвращаемое значение:
//  ДокументСсылка.DMS_СогласиеНаОбработкуПерсональныхДанных - документ согласия на обработку персональных данных по клиенту
//
&НаСервере
Функция СогласиеНаОПД()
	
	ДокументСогласиеНаОбработкуПерсональныхДанных = Документы.DMS_СогласиеНаОбработкуПерсональныхДанных.ВернутьСогласиеПоКлиенту(Объект.Клиент); 
	
	Возврат ДокументСогласиеНаОбработкуПерсональныхДанных;
	
КонецФункции // СогласиеНаОПД()

// Устанавливает заголовок кнопки "ОткрытьICM"
//
// Параметры:
//  СообщатьОбРезультате - Булево	 - Признак вывода сообщения с результатом обработки на экран
//
&НаКлиенте
Процедура ОбновитьДатуICM(СообщатьОбРезультате = Ложь)
	
	VIN = ВернутьVINПоАвтомобилям(Истина);
	ОбновитьДатуICMСервер(VIN, СообщатьОбРезультате);
	
КонецПроцедуры // ОбновитьДатуICM()

// Устанавливает заголовок кнопки "ОткрытьICM"
//
// Параметры:
//  СообщатьОбРезультате - Булево	 - Признак вывода сообщения с результатом обработки на экран
//
&НаСервере
Процедура ОбновитьДатуICMСервер(VIN, СообщатьОбРезультате = Ложь)

	РезультатПроверки = Renault_АвтосервисСервер.ПолучитьРезультатПоследнейПроверкиICM(VIN);
	Если РезультатПроверки.РезультатЗапроса = Неопределено тогда
		Возврат;
	КонецЕсли;	
	Элементы.ОткрытьICM.Заголовок = "ICM:"+Формат(РезультатПроверки.ДатаВыполнения,"ДФ=dd.MM.yy");
	Если СообщатьОбРезультате тогда
		Если РезультатПроверки.РезультатЗапроса = "Есть отзывные компании" тогда
			Сообщить(РезультатПроверки.ОписаниеOTS);
		Иначе
			Сообщить(РезультатПроверки.РезультатЗапроса);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры // ОбновитьДатуICMСервер()

// Возвращает VIN первого автомобиля клиента, либо предсотавляет выбор автомобиля
//
// Параметры:
//  Первый	 - Булево	 - Вернуть первый автомобиль по коммерческому предложению
// 
// Возвращаемое значение:
//  СправочникСсылка.Автомобили - Автомобиль клиента
//
&НаКлиенте
Функция ВернутьVINПоАвтомобилям(Первый = Ложь)
	
		//hvv DMSREN-715
	//
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_Договор.Ссылка,
	|	ВЫБОР
	|		КОГДА CRM_Договор.СтатусДоговора = &Подписан
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК СортировкаПотипуДоговора,
	|	CRM_Договор.VIN
	|ИЗ
	|	Документ.Renault_Договор КАК CRM_Договор
	|ГДЕ
	|	CRM_Договор.РабочийЛист = &IDK
	|	И НЕ CRM_Договор.ПометкаУдаления
	|	И (CRM_Договор.СтатусДоговора = &Подписан
	|			ИЛИ CRM_Договор.СтатусДоговора = &НаОформление
	|			ИЛИ CRM_Договор.СтатусДоговора = &Черновик
	|			ИЛИ CRM_Договор.СтатусДоговора = &Оформлен)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СортировкаПотипуДоговора,
	|	CRM_Договор.Дата УБЫВ";
	Запрос.УстановитьПараметр("IDK", Объект.IDK);
	Запрос.УстановитьПараметр("Подписан", перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан);
	Запрос.УстановитьПараметр("НаОформление", перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.НаОформление);
	Запрос.УстановитьПараметр("Черновик", перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Черновик); 
	Запрос.УстановитьПараметр("Оформлен", перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Оформлен);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока выборка.Следующий() Цикл
		Если НЕ Пустаястрока(выборка.VIN) Тогда
			Возврат выборка.VIN;
		Иначе
			продолжить;
		КонецЕсли;
	КонецЦикла;
	
	//
	
	МассивКонфигураций = ПолучитьКонфигурацииАвтомобилейРабочегоЛиста();
	
	Если МассивКонфигураций <> Неопределено Тогда
	
		Если МассивКонфигураций.Количество() > 1 Тогда
			
			Если Первый тогда
				КонфигурацияОбъект = МассивКонфигураций[0];
			Иначе	
				СписокКонфигураций = Новый СписокЗначений;
				СписокКонфигураций.ЗагрузитьЗначения(МассивКонфигураций);
				Ответ = СписокКонфигураций.ВыбратьЭлемент("В коммерческом предложении более одного автомобиля. Выберите подходящий.");
				Если ЗначениеЗаполнено(Ответ) Тогда
					КонфигурацияОбъект = Ответ.Значение;
				Иначе
					КонфигурацияОбъект = Неопределено;
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			КонфигурацияОбъект = МассивКонфигураций[0];
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КонфигурацияОбъект.VIN) тогда
			Возврат КонфигурацияОбъект.VIN;
		Иначе	
			Возврат ?(ЗначениеЗаполнено(КонфигурацияОбъект.Автомобиль), КонфигурацияОбъект.Автомобиль.VIN, Объект.VINАвтомобилей)
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции // ВернутьVINПоАвтомобилям()

// Возвращает массив конфигураций автомобилей рабочего листа
// 
// Возвращаемое значение:
//  Массив - массив конфигураций автомобилей рабочего листа
//
&НаСервере
Функция ПолучитьКонфигурацииАвтомобилейРабочегоЛиста()
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.КоммерческоеПредложение;
	Запись.Прочитать();
	
	Если Запись.Выбран() И ЗначениеЗаполнено(Запись.Объект) Тогда
		//КПОбъект = Запись.Объект.ПолучитьОбъект();
		Возврат Запись.Объект.Состав.ВыгрузитьКолонку("Конфигурация");
	КонецЕсли;
	
КонецФункции // ПолучитьКонфигурацииАвтомобилейРабочегоЛиста()

// Обработчик ожидания. 
//
&НаКлиенте
Процедура СообщенияПользователюПоКорпКлиенту()
	
	//ОтключитьОбработчикОжидания("СообщенияПользователюПоКорпКлиенту");
	
	СообщенияПользователюПоКорпКлиентуНаСервере();
			
	//ПодключитьОбработчикОжидания("СообщенияПользователюПоКорпКлиенту", 3, Ложь);
	
КонецПроцедуры

// Формирование сообщений пользователю
//
&НаСервере
Процедура СообщенияПользователюПоКорпКлиентуНаСервере()
	
	Если ЗначениеЗаполнено(КорпКлиент) Тогда
	
		Если ДанныеДляСообщенийПользователю = Неопределено Тогда
			
			МассивСтатусовЗаявок = Новый Массив;
			СостояниеКорпКлиента = КорпКлиент.Состояние;
			
			ДанныеДляСообщенийПользователю = Новый Структура("СтатусыЗаявок, СостояниеКорпКлиента, ПериодСообщения", МассивСтатусовЗаявок, СостояниеКорпКлиента, Неопределено);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияVINВЗаявках.VIN КАК VIN,
		|	СостоянияVINВЗаявках.Заявка КАК Заявка,
		|	СостоянияVINВЗаявках.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.Renault_СостоянияVINВЗаявках КАК СостоянияVINВЗаявках
		|ГДЕ
		|	СостоянияVINВЗаявках.Заявка.Клиент = &КорпКлиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Renault_КорпоративныеКлиенты.Состояние КАК Состояние,
		|	Renault_КорпоративныеКлиенты.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Renault_КорпоративныеКлиенты КАК Renault_КорпоративныеКлиенты
		|ГДЕ
		|	Renault_КорпоративныеКлиенты.Ссылка = &КорпКлиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	RenaultFlotte_ИсторияКомментариев.Период КАК Период,
		|	RenaultFlotte_ИсторияКомментариев.Автор КАК Автор,
		|	RenaultFlotte_ИсторияКомментариев.Сообщение КАК Сообщение
		|ИЗ
		|	РегистрСведений.RenaultFlotte_ИсторияКомментариев КАК RenaultFlotte_ИсторияКомментариев
		|ГДЕ
		|	RenaultFlotte_ИсторияКомментариев.Объект = &Объект
		|	И RenaultFlotte_ИсторияКомментариев.Автор <> &Автор
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
		Запрос.УстановитьПараметр("КорпКлиент", КорпКлиент);
		Запрос.УстановитьПараметр("Объект", Строка(КорпКлиент.ИдЗаявки));
		Запрос.УстановитьПараметр("Автор", ПараметрыСеанса.Renault_ПраваПользователя.ДилерскийЦентр);
		Результат = Запрос.ВыполнитьПакет();
		
		//Статусы заявок
		Если НЕ Результат[0].Пустой() Тогда
			Выборка = Результат[0].Выбрать();
			
			ДанныеМассивСтатусовЗаявок = ДанныеДляСообщенийПользователю.СтатусыЗаявок;
			Если ДанныеМассивСтатусовЗаявок.Количество() = 0 Тогда
				Пока Выборка.Следующий() Цикл
					Стр = Новый Структура("VIN, Заявка, Статус"); 
					ЗаполнитьЗначенияСвойств(Стр, Выборка);
					
					ДанныеМассивСтатусовЗаявок.Добавить(Стр);
				КонецЦикла;
			Иначе
				Пока Выборка.Следующий() Цикл
					VIN = Выборка.VIN;
					Заявка = Выборка.Заявка;
					Статус = Выборка.Статус;
					
					Для Каждого Эл Из ДанныеМассивСтатусовЗаявок Цикл
						Если Эл.VIN = VIN И Эл.Заявка = Заявка Тогда
							Если Эл.Статус <> Статус Тогда
								Сообщить("Статус заявки - " + Заявка + Символы.ПС + " для VIN - " + VIN + " изменился с """ +
								Эл.Статус + """ на """ + Статус + """.");
							КонецЕсли;
							
							Прервать;						
						КонецЕсли;					
					КонецЦикла;				
				КонецЦикла;	
				
				ДанныеМассивСтатусовЗаявок.Очистить();
				
				Выборка.Сбросить();
				
				Пока Выборка.Следующий() Цикл
					Стр = Новый Структура("VIN, Заявка, Статус"); 
					ЗаполнитьЗначенияСвойств(Стр, Выборка);
					
					ДанныеМассивСтатусовЗаявок.Добавить(Стр);
				КонецЦикла;
			КонецЕсли; 		
		КонецЕсли;
		
		//Состояние клиента	
		Выборка = Результат[1].Выбрать();	
		Выборка.Следующий();
		
		Если Выборка.Состояние <> ДанныеДляСообщенийПользователю.СостояниеКорпКлиента Тогда
			Сообщить("Состояние клиента - " + Выборка.Наименование + " изменилось с """ + 
			ДанныеДляСообщенийПользователю.СостояниеКорпКлиента + """ на """ + Выборка.Состояние + """.");
			
			ДанныеДляСообщенийПользователю.Вставить("СостояниеКорпКлиента", Выборка.Состояние);
		КонецЕсли;	
		
		//Сообщение пользователю
		Выборка = Результат[2].Выбрать();	
		Выборка.Следующий();
		
		Если Выборка.Период <> ДанныеДляСообщенийПользователю.ПериодСообщения И НЕ ДанныеДляСообщенийПользователю.ПериодСообщения = Неопределено Тогда
			КомментарийПользователю = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"%1 %2: %3",
				МестноеВремя(Выборка.Период, ЧасовойПоясСеанса()),
				Строка(Выборка.Автор),
				Выборка.Сообщение);
			Сообщить(КомментарийПользователю);	
		КонецЕсли;
		
		ДанныеДляСообщенийПользователю.Вставить("ПериодСообщения", Выборка.Период);
	КонецЕсли;

КонецПроцедуры // СообщенияПользователюПоКорпКлиентуНаСервере()

// Записывает рабочий лист
//
&НаСервере
Процедура СохранитьРабочийЛист()
	
	Дата = ТекущаяДата();
	
	РегистрыСведений.Renault_ОкружениеРабочегоЛиста.ОбновитьОсновногоКлиентаОкруженияРабочегоЛиста(Объект.IDK, Объект.Клиент);
	
	//Статистика продаж
	Renault_CRM.Статистика_Установить(Справочники.CRM_ЭтапыПродаж.РабочийЛист, Объект.IDK,,,Объект.ДатаID,,Объект.ДилерскийЦентр);
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.Записать();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");	
	
КонецПроцедуры // СохранитьРабочийЛист()

// Записывает рабочий лист и обновляет данные на форме
//
&НаСервере
Процедура ЗаписатьРабочийЛист()
	
	//DMSREN-182 пока не будем сохранять документ, пусть предагает
	ЭтаФорма.Модифицированность = Истина;
	//ДокументОбъект = РеквизитФормыВЗначение("Объект");
	//ДокументОбъект.Записать();
	//ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры // ЗаписатьРабочийЛист()

// Обработка оповещения создания обращения
//
&НаКлиенте
Процедура СоздатьОбращениеПродолжение(Параметр, Источник)
	
	ПолученныеДанные = Параметр;
	ФормаОбращения = Источник;
	
	ТекущаяДата = ТекущаяДата();
	
	НовоеОбращение = ФормаОбращения.ДокументОбъект;
	
	Если НЕ ЗначениеЗаполнено(ПолученныеДанные) Тогда
		ТипВызова = "Закрытие";
	Иначе
		ТипВызова = ПолученныеДанные.ТипВызова;
	КонецЕсли; 		
	
	Если ТипВызова = "Закрытие" ИЛИ ТипВызова = "Упущен" ИЛИ ТипВызова = "СохранитьИЗакрытьЗаявку" ИЛИ 
		ТипВызова = "СохранятьОбращение" Тогда
						
		ЭтапОценкаСервисом = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнДиагностикаВСервисе;
		
		Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
		Запись.IDK = Объект.IDK;	
		Запись.ЭтапПродаж = ЭтапОценкаСервисом;
		Запись.Прочитать();
		
		Если Не Запись.Выбран() Тогда
			Запись.IDK = Объект.IDK;
			Запись.Объект = ЗаявкаНаТрейдИн;
			Запись.ЭтапПродаж = ЭтапОценкаСервисом; 
			Запись.ДилерскийЦентр = Объект.ДилерскийЦентр;
			Запись.ДатаВыполнения = ТекущаяДата();
			Запись.Записать();
		КонецЕсли;	
			
		ТекСотрудник = DMS_ОбращенияКлиентов.ВернутьТекущегоСотрудника();
		
		Событие = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
		Событие.IDK = Объект.IDK;
		Событие.Дата = ТекущаяДата;
		Событие.Автор = ТекСотрудник;
		Событие.ВидСобытия = Справочники.CRM_ВидыСобытий.Прочее;
		Событие.Комментарий = "Создание заявки на диагностику по трейд-ин";
		Событие.ДатаНапоминания = ТекущаяДата;
		Событие.ДатаЗакрытия = ТекущаяДата;
		Событие.АвторЗакрытия = ТекСотрудник;
		Событие.Сотрудник = ЗаявкаНаТрейдИн.МенеджерЗаявитель;
		Событие.ДилерскийЦентр = Объект.ДилерскийЦентр;
		Событие.ЗавершеноУспешно = Истина;
		Событие.Обработано = Истина;
		Событие.КомментарийЗакрытия = "Выполнено";
		Событие.Записать();
		
		ПриемкаВСервис = Документы.Renault_CRM_ПриемкаАвтомобиля.НайтиПоРеквизиту("Обращение", НовоеОбращение.Ссылка); 
		
		Если ЗначениеЗаполнено(ПриемкаВСервис) Тогда
			
			МастерПриемщик = ПриемкаВСервис.Машиноместо;
			
			Если НЕ ЗначениеЗаполнено(МастерПриемщик) Тогда
				
				ТаблицаМастеров = Renault_АвтосервисОбщий.ПолучитьМастеровПриемщиковДЦ(Объект.ДилерскийЦентр);
				СписокМастеров = Новый СписокЗначений;
				СписокМастеров.ЗагрузитьЗначения(ТаблицаМастеров.ВыгрузитьКолонку("Сотрудник"));
				ФормаВыбораПлиткой = ПолучитьОбщуюФорму("Renault_ФормаВыбораПлиткой");
				ФормаВыбораПлиткой.Заголовок = "Для создания обращения в сервис укажите мастера-приемщика";
				ФормаВыбораПлиткой.СписокВыбора = СписокМастеров;
				МастерПриемщик = ФормаВыбораПлиткой.ОткрытьМодально();
				Если НЕ ЗначениеЗаполнено(МастерПриемщик) Тогда
					Предупреждение("Не выбран мастер-приемщик");
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Напоминание = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
		Напоминание.Отправитель = ТекСотрудник;
		Напоминание.Адресаты.Добавить().Сотрудник = МастерПриемщик; 
		Напоминание.ДатаОтправки = ТекущаяДата;
		Напоминание.Комментарий = Событие.Комментарий;
		Напоминание.ВидСообщения = Справочники.Renault_ВидСообщения.ДиагностикаТрейдИн;
		Напоминание.ПоказыватьС = ТекущаяДата;
		Напоминание.Наименование ="Диагностика трейд-ин";
		Напоминание.Сообщение = "Создана заявка на диагностику трейд-ин";
		Напоминание.ИдентификаторОбъекта = Строка(НовоеОбращение.Ссылка.УникальныйИдентификатор());
		Напоминание.Записать();
		Сообщить("Создано " + НовоеОбращение.Ссылка);
		
		ОбновитьВоронкуИСпискиТрейдИн(); 		

	ИначеЕсли ТипВызова = "НеСохранятьОбращение" Тогда
		НовоеОбращение.ПометкаУдаления = Истина;
		НовоеОбращение.Записать();
	КонецЕсли;
	
КонецПроцедуры // СоздатьОбращениеПродолжение()

// Создание события визуального осмотра
//
&НаСервере
Процедура РегистрацияВизуальногоОсмотра()
	
	ЭтапВизуальныйОсмотр = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнВизуальныйОсмотр;
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;	
	Запись.ЭтапПродаж = ЭтапВизуальныйОсмотр;
	Запись.Прочитать();
	
	Если Не Запись.Выбран() Тогда
		ТекущаяДата = ТекущаяДата();
		ТекСотрудник = DMS_ОбращенияКлиентов.ВернутьТекущегоСотрудника();
		
		Событие = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
		Событие.IDK = Объект.IDK;
		Событие.Дата = ТекущаяДата;
		Событие.Автор = ТекСотрудник;
		Событие.ВидСобытия = Справочники.CRM_ВидыСобытий.Прочее;
		Событие.Комментарий = "Визуальный осмотр по трейд-ин";
		Событие.ДатаНапоминания = ТекущаяДата;
		Событие.ДатаЗакрытия = ТекущаяДата;
		Событие.КомментарийЗакрытия = "Выполнено";
		Событие.АвторЗакрытия = ТекСотрудник;
		Событие.Сотрудник = ЗаявкаНаТрейдИн.МенеджерЗаявитель;
		Событие.ДилерскийЦентр = Объект.ДилерскийЦентр;
		Событие.Записать();
		
		Запись.IDK = Объект.IDK;
		Запись.Объект = ЗаявкаНаТрейдИн;
		Запись.ЭтапПродаж = ЭтапВизуальныйОсмотр; 
		Запись.ДилерскийЦентр = Объект.ДилерскийЦентр;
		Запись.ДатаВыполнения = ТекущаяДата;
		Запись.Записать();
	КонецЕсли;	
	
	ОбновитьВоронкуИСпискиТрейдИн();
	
КонецПроцедуры // РегистрацияВизуальногоОсмотра()

// Создание события регистрации данных автомобиля
//
&НаСервере
Процедура РегистрацияЗаполненияДанныхАвтомобиля()
	
	ПроизводительТрейдИн = ЗаявкаНаТрейдИн.ПроизводительКод;
	ГодВыпускаТрейдИн = ЗаявкаНаТрейдИн.ГодВыпуска;
	МодельТрейдИн = ЗаявкаНаТрейдИн.МодельКод;		
	
	ЗаполнитьСписокВыбораЭлемента("ПроизводительТрейдИн");
	
	Если ЗначениеЗаполнено(ПроизводительТрейдИн) Тогда
		ЗаполнитьСписокВыбораЭлемента("ГодВыпускаТрейдИн");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГодВыпускаТрейдИн) Тогда
		ЗаполнитьСписокВыбораЭлемента("МодельТрейдИн");
	КонецЕсли;			
	
	ПараметрыУправленияЭлементами = Новый Структура();
	ПараметрыУправленияЭлементами.Вставить("ГодВыпускаТрейдИн", ЗначениеЗаполнено(ПроизводительТрейдИн));
	ПараметрыУправленияЭлементами.Вставить("МодельТрейдИн", ЗначениеЗаполнено(ГодВыпускаТрейдИн));
	ПараметрыУправленияЭлементами.Вставить("ОжидаемаяСтоимостьКлиентаТрейдИн", ЗначениеЗаполнено(МодельТрейдИн));

	ОбновитьИнтерфейсТрейдИн(ПараметрыУправленияЭлементами);	
	
	Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн.Автомобиль) Тогда		
		ЭтапЗаполнениеАвто = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнЗаполнениеДанныхАвтомобиля;
		
		Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
		Запись.IDK = Объект.IDK;	
		Запись.ЭтапПродаж = ЭтапЗаполнениеАвто;
		Запись.Прочитать();
		
		Если Не Запись.Выбран() Тогда
			ТекущаяДата = ТекущаяДата();
			ТекСотрудник = DMS_ОбращенияКлиентов.ВернутьТекущегоСотрудника();
			
			Событие = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
			Событие.IDK = Объект.IDK;
			Событие.Дата = ТекущаяДата;
			Событие.Автор = ТекСотрудник;
			Событие.ВидСобытия = Справочники.CRM_ВидыСобытий.Прочее;
			Событие.Комментарий = "Заполнение данных автомобиля по трейд-ин";
			Событие.ДатаНапоминания = ТекущаяДата;
			Событие.ДатаЗакрытия = ТекущаяДата;
			Событие.КомментарийЗакрытия = "Выполнено";
			Событие.АвторЗакрытия = ТекСотрудник;
			Событие.Сотрудник = ЗаявкаНаТрейдИн.МенеджерЗаявитель;
			Событие.ДилерскийЦентр = Объект.ДилерскийЦентр;
			Событие.Записать();
			
			Запись.IDK = Объект.IDK;
			Запись.Объект = ЗаявкаНаТрейдИн;
			Запись.ЭтапПродаж = ЭтапЗаполнениеАвто; 
			Запись.ДилерскийЦентр = Объект.ДилерскийЦентр;
			Запись.ДатаВыполнения = ТекущаяДата;
			Запись.Записать();
		КонецЕсли;
	Иначе
		Сообщить("Автомобиль не создан!");
	КонецЕсли;
	
	ОбновитьВоронкуИСпискиТрейдИн();
	
КонецПроцедуры // РегистрацияЗаполненияДанныхАвтомобиля()

// Регистрация события предложения выкупа по трейд-ин
//
// Параметры:
//  ДокументПредложениеВыкупа	 - ДокументСсылка.Renault_ПредложениеВыкупаАвтомобиляТрейдИн	 -  Документ предложения выкупа
//
&НаСервере
Процедура РегистрацияПредложениеВыкупа(ДокументПредложениеВыкупа)
	
	Если ЗначениеЗаполнено(ДокументПредложениеВыкупа) Тогда
		ЭтапПредложениеВыкупа = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнПредложениеВыкупа;
		
		Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
		Запись.IDK = Объект.IDK;	
		Запись.ЭтапПродаж = ЭтапПредложениеВыкупа;
		Запись.Прочитать();
		
		Если Не Запись.Выбран() Тогда
			ТекущаяДата = ТекущаяДата();
			ТекСотрудник = DMS_ОбращенияКлиентов.ВернутьТекущегоСотрудника();
			
			Событие = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
			Событие.IDK = Объект.IDK;
			Событие.Дата = ТекущаяДата;
			Событие.Автор = ТекСотрудник;
			Событие.ВидСобытия = Справочники.CRM_ВидыСобытий.Прочее;
			Событие.Комментарий = "Предложение выкупа по трейд-ин";
			Событие.ДатаНапоминания = ТекущаяДата;
			Событие.ДатаЗакрытия = ТекущаяДата;
			Событие.КомментарийЗакрытия = "Выполнено";
			Событие.АвторЗакрытия = ТекСотрудник;
			Событие.Сотрудник = ЗаявкаНаТрейдИн.МенеджерЗаявитель;
			Событие.ДилерскийЦентр = Объект.ДилерскийЦентр;
			Событие.Записать();
			
			Запись.IDK = Объект.IDK;
			Запись.Объект = ЗаявкаНаТрейдИн;
			Запись.ЭтапПродаж = ЭтапПредложениеВыкупа; 
			Запись.ДилерскийЦентр = Объект.ДилерскийЦентр;
			Запись.ДатаВыполнения = ТекущаяДата;
			Запись.Записать();
		КонецЕсли;
		
		ОбновитьВоронкуИСпискиТрейдИн();
	КонецЕсли;
	
КонецПроцедуры // РегистрацияПредложениеВыкупа()

// Регистрация события предварительной оценки
//
&НаСервере
Процедура РегистрацияПредварительнаяОценка(Параметр)
	
	Если Параметр.ЭтоВыбор Тогда
		ОриентировочнаяЦена = Параметр.ДокументОценки.ОриентировочнаяЦена;
		ДатаОценки = Параметр.ДокументОценки.ДатаОценки;
		
		Если ЗначениеЗаполнено(ДатаОценки) И ЗначениеЗаполнено(ОриентировочнаяЦена) Тогда			
			ЗаявкаНаТрейдИнОбъект = ЗаявкаНаТрейдИн.ПолучитьОбъект();
			ЗаявкаНаТрейдИнОбъект.ОриентировочнаяЦена = ОриентировочнаяЦена;
			ЗаявкаНаТрейдИнОбъект.ДатаОценки = ДатаОценки;
			ЗаявкаНаТрейдИнОбъект.Записать();
		КонецЕсли;
	КонецЕсли;	
	
	ОриентировочнаяЦена = Параметр.ОриентировочнаяЦена;
	ДатаОценки = Параметр.ДатаОценки;			

	Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн.ОриентировочнаяЦена) И ЗначениеЗаполнено(ЗаявкаНаТрейдИн.ДатаОценки) Тогда
		Если ЗаявкаНаТрейдИн.ОриентировочнаяЦена <> ОриентировочнаяЦена ИЛИ ЗаявкаНаТрейдИн.ДатаОценки <> ДатаОценки Тогда
			ЭтапЗаявкаНаТрейдИнПредварительнаяОценка = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнПредварительнаяОценка;
			
			Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
			Запись.IDK = Объект.IDK;	
			Запись.ЭтапПродаж = ЭтапЗаявкаНаТрейдИнПредварительнаяОценка;
			Запись.Прочитать();

			Если Не Запись.Выбран() Тогда						
				Запись.IDK = Объект.IDK;
				Запись.Объект = ЗаявкаНаТрейдИн;
				Запись.ЭтапПродаж = ЭтапЗаявкаНаТрейдИнПредварительнаяОценка; 
				Запись.ДилерскийЦентр = Объект.ДилерскийЦентр;
				Запись.ДатаВыполнения = ТекущаяДата();
				Запись.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	ОбновитьВоронкуИСпискиТрейдИн();
	
КонецПроцедуры // РегистрацияПредварительнаяОценка()

// Проверка на дубли
//
// Параметры:
//  Тип	 - Строка	 - Где искать дубли
//
&НаКлиенте
Процедура ПровестиДедубликацию(Тип)
	
	НайденныеКлиенты = Новый Массив;
	Существует = Ложь;
	Если Тип = "ФИО" Тогда
		Если Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ОтключитьДедубликациюКлиентовПоФИО Тогда
			Возврат;
		КонецЕсли;
		Существует = CRM_Редубликация.ФИОСуществует(Клиент_ФИО, НайденныеКлиенты, Объект.Клиент);
	ИначеЕсли Тип = "EMail" Тогда
		Если Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ОтключитьДедубликациюКлиентовПоКонтактам Тогда
			Возврат;
		КонецЕсли;
		Существует = CRM_Редубликация.EMailСуществует(Объект.Email, НайденныеКлиенты, Объект.Клиент);
	ИначеЕсли Тип = "Телефон" Тогда
		Если Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ОтключитьДедубликациюКлиентовПоКонтактам Тогда
			Возврат;
		КонецЕсли;
		ЦифрыПоиска = СтрЗаменить(СтрЗаменить(Объект.Телефон, "(", ""), ")", "");
		ЦифрыПоиска = СтрЗаменить(СтрЗаменить(ЦифрыПоиска, " ", ""), "-", "");
		ЦифрыПоиска = Прав(ЦифрыПоиска, 10);
		Существует = CRM_Редубликация.НомерСуществует(ЦифрыПоиска, НайденныеКлиенты, Объект.Клиент);
	КонецЕсли;
	
	Если Не Существует Тогда
		Возврат;
	КонецЕсли;
	
	Струк = Новый Структура();
	Струк.Вставить("Ссылка", Объект.Клиент);
	Струк.Вставить("Телефон", Объект.Телефон);
	Струк.Вставить("EMail", Объект.EMail);
	Струк.Вставить("ДатаСоздания", CRM_Редубликация.ДатаСозданияКлиента(Объект.Клиент));
	
	Результат = CRM_Редубликация.ВопросЗаменятьКлиента(Струк, НайденныеКлиенты);
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Объект.Клиент = Струк.Ссылка;
		
		НаборКонтактнойИнформации = Неопределено;
		ФормаРегистрацииТелефона = Обработки.Renault_РедактированиеКонтактнойИнформации.ПолучитьФорму("ФормаЗаписиТелефона");
		Если ФормаРегистрацииТелефона.Открыта() Тогда
			ФормаРегистрацииТелефона.Закрыть();
		КонецЕсли;
				
		Если Справочники.Renault_ПрофилиКлиентов.Используются() Тогда
			Профиль = Справочники.Renault_ПрофилиКлиентов.СохранитьКлиентаВПрофиль(Объект.Клиент);
			Справочники.Renault_ПрофилиКлиентов.ДобавитьКлиента(Профиль, Струк.Ссылка);
		КонецЕсли;
		Клиент = Струк.Ссылка;
		Клиент_ФИО = Клиент.Наименование;
		Объект.EMail = Струк.EMail;
		Объект.Телефон = Струк.Телефон;
		Клиент_Телефон = Renault_УправлениеКонтактнойИнформацией.НормализацияНомераТелефона(Объект.Телефон, Объект.ДилерскийЦентр);
		Если ОбрезатьТелефон Тогда
			Клиент_Телефон = Прав(Клиент_Телефон, 10);
		КонецЕсли;
		СохранитьРабочийЛист();
	КонецЕсли;
	
КонецПроцедуры // ПровестиДедубликацию()

// Обновляет оформление элементов формы
//
// Параметры:
//  ЭтоТрейдИн	 - Булево	 - Признак того, что рабочий лист по трейд-ин
//
&НаКлиенте
Процедура СохранитьДанныеКлиентаПриСменеТелефона(ЭтоТрейдИн = Ложь)
	
	//////// Запишем контактные данные клиента
	Renault_УправлениеКонтактнойИнформацией.ЗаписатьОсновнойТелефонКлиента(Клиент_Телефон, Объект.Клиент);
	
	ТекТелефон = СкорректироватьТелефонПриЗаписиНаСервере();
	
	Клиент_Телефон  = Renault_УправлениеКонтактнойИнформацией.НормализацияНомераТелефона(Объект.Телефон, Объект.ДилерскийЦентр);
	Если ОбрезатьТелефон Тогда
		Клиент_Телефон = Прав(Клиент_Телефон, 10);
	КонецЕсли;
		
	Если ЭтоТрейдИн Тогда
		ОбновитьВоронкуИСпискиТрейдИн();
	Иначе 		
		ОбновитьВоронкуИСписки();
		Оповестить("ОбновитьРабСтолМенеджера");
	КонецЕсли;
	Модифицированность = Истина;
	
КонецПроцедуры // СохранитьДанныеКлиентаПриСменеТелефона()

// Корректирует номер телефона
// 
// Возвращаемое значение:
//  Строка - Скорректированный номер телефона
//
&НаСервере
Функция СкорректироватьТелефонПриЗаписиНаСервере()
	
	Возврат CRM_Сервер.Renault_CRM_СкорректироватьТелефонПриЗаписи(Объект.Телефон);
	
КонецФункции // СохранитьДанныеКлиентаПриСменеТелефонаНаСервере()

// Возвращает путь к данным элемента формы по имени элемента
//
// Параметры:
//  ИмяЭлемента	 - Строка	 - Имя элемента формы
// 
// Возвращаемое значение:
//  Строка - Путь к данным элемента
//
&НаСервере
Функция ПолучитьПутьКДаннымЭлемента(ИмяЭлемента)
	
	Возврат Элементы[ИмяЭлемента].ПутьКДанным;
	
КонецФункции // ПолучитьПутьКДаннымЭлемента()

// Возвращает имя формы выбора элемента
//
// Параметры:
//  ПутьКДанным	 - Ссылка	 - Путь к данным элемента
// 
// Возвращаемое значение:
//  Строка - Имя формы выбора элемента
//
&НаСервере
Функция ПолучитьИмяФормыВыбораЭлемента(ПутьКДанным)
	
	Если ПутьКДанным = "Клиент_ФИО" ИЛИ ПутьКДанным = "Клиент_Корпоративный" Тогда
		СсылкаНаДанные = Справочники.Контрагенты.ПустаяСсылка();		
	Иначе
		СсылкаНаДанные = Вычислить(ПутьКДанным);
	КонецЕсли;
	
	ТипЗначенияЭлемента = ТипЗнч(СсылкаНаДанные);
	
	ИмяФормыВыбора = "";
	ИмяОбъекта = СсылкаНаДанные.Метаданные().Имя;
	
	Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗначенияЭлемента) Тогда
		ИмяФормыВыбора = "Справочник." + ИмяОбъекта + ".ФормаВыбора";	
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипЗначенияЭлемента) Тогда
		ИмяФормыВыбора = "Документ." + ИмяОбъекта + ".ФормаВыбора";
	КонецЕсли;
	
	Возврат ИмяФормыВыбора;
	
КонецФункции // ПолучитьИмяФормыВыбораЭлемента()

// Возвращает ссылку на данные по пути к данным
//
// Параметры:
//  ПутьКДанным	 - Ссылка	 - Путь к данным элемента
// 
// Возвращаемое значение:
//  Ссылка - Ссылка на данные элемента формы
//
&НаСервере
Функция ПолучитьСсылкуНаОбъект(ПутьКДанным)
	
	Если ПутьКДанным = "Клиент_ФИО" ИЛИ ПутьКДанным = "Клиент_Корпоративный" Тогда
		СсылкаНаДанные = Объект.Клиент;		
	Иначе
		СсылкаНаДанные = Вычислить(ПутьКДанным);
	КонецЕсли;
	
	Возврат СсылкаНаДанные;
	
КонецФункции // ПолучитьСсылкуНаОбъект()

// Записывает форму собственности для клиента рабочего листа
//
// Параметры:
//  ФормаСобственности	 - ПеречислениеСсылка.ФормыСобственности	-	Устанавливаемая форма собственности
//
&НаСервере
Процедура ИзменитьФормуСобственностиКлиента(ФормаСобственности)

	Если Объект.Клиент <> Неопределено Тогда
	    Если Объект.Клиент.ФормаСобственности <> ФормаСобственности Тогда

	        УстановитьПривилегированныйРежим(Истина);
	        КлиентОбъект = Объект.Клиент.ПолучитьОбъект();
	        КлиентОбъект.ФормаСобственности = ФормаСобственности;
	        Если ФормаСобственности=Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
	            Если НЕ ЗначениеЗаполнено(КлиентОбъект.Фамилия) И НЕ ЗначениеЗаполнено(КлиентОбъект.Имя) И НЕ ЗначениеЗаполнено(КлиентОбъект.Отчество) Тогда
	                КлиентОбъект.Фамилия = "Фамилия";
	                КлиентОбъект.Имя = "Имя";
	                КлиентОбъект.Отчество = "Отчество";
	            КонецЕсли;
	        КонецЕсли;
	        КлиентОбъект.ОбменДанными.Загрузка = Истина; // Защита от незаполненных реквизитов
	        КлиентОбъект.Записать();
	        УстановитьПривилегированныйРежим(Ложь);

		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ИзменитьФормуСобственностиКлиента()

// Устанавливает заголовок кнопки "Кредит"
//
// Параметры:
//  ТекстЗаголовка	 - Строка	 -  Текст заголовка кнопки
//
&НаКлиенте
Процедура ОбновитьЗаголовок_КнопкаКредит(ТекстЗаголовка="Кредит")
	
	Элементы.Кредит.Заголовок = ТекстЗаголовка;	
	
КонецПроцедуры // ОбновитьЗаголовок_КнопкаКредит()

// Записывает тип операции в заявке на трейд-ин
//
&НаСервере
Процедура УстановитьТипОперацииВЗаявкеНаТрейдИн(ТипОперацииТрейдИн)
	
	Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн) Тогда
		ЗаявкаНаТрейдИнОбъект = ЗаявкаНаТрейдИн.ПолучитьОбъект();
		ЗаявкаНаТрейдИнОбъект.ТипОперацииTradeIn = ТипОперацииТрейдИн;
		ЗаявкаНаТрейдИнОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры // УстановитьТипОперацииВЗаявкеНаТрейдИн()

// Записывает основной Email контрагента и обновляет элементы формы
//
// Параметры:
//  ЭтоТрейдИн	 - Булево	 - Признак того, что это рабочий лист по трейд-ин
//
&НаКлиенте
Процедура СохранитьДанныеКлиентаПриСменеEmail(ЭтоТрейдИн = Ложь)
	
	Renault_УправлениеКонтактнойИнформацией.ЗаписатьОсновнойEmailКлиента(Объект.Email, Объект.Клиент);
	
	Клиент_Email = Объект.Email; //Блинков DMSREN-745 Не обновлялся реквизит
	
	Если ЭтоТрейдИн Тогда
		ОбновитьВоронкуИСпискиТрейдИн();
	Иначе
		ОбновитьВоронкуИСписки();
		Оповестить("ОбновитьРабСтолМенеджера");
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры // СохранитьДанныеКлиентаПриСменеEmail()

// Обработка оповещения при выборе согласия на обработку персональных данных
//
&НаКлиенте
Процедура ОбновитьСогласиеНаОД(Результат, ДополнительныеПараметры) Экспорт 
	
	СогласиеНаОПД(); 
	
КонецПроцедуры // ОбновитьСогласиеНаОД()

// Возвращает менеджера трейд-ин
// 
// Возвращаемое значение:
//  СписокЗначений - Список сотрудников отдета трейд-ин
//
&НаСервере
Функция ПолучитьСотрудниковОтделаТрейдИн()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_Отделы.Ссылка
	               |ИЗ
	               |	Справочник.CRM_Отделы КАК CRM_Отделы
	               |ГДЕ
	               |	CRM_Отделы.КлассификацияRenault = ЗНАЧЕНИЕ(Перечисление.CRM_КлассификацияОтделов.ОтделТрейдИн)
	               |	И CRM_Отделы.ДилерскийЦентр = &ДилерскийЦентр";
	Запрос.УстановитьПараметр("ДилерскийЦентр", Объект.ДилерскийЦентр);
	Результат = Запрос.Выполнить();
	
	ОтделТрейдИн = Справочники.CRM_Отделы.ПустаяСсылка();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();		
		Выборка.Следующий();
			
		ОтделТрейдИн = Выборка.Ссылка;				
	КонецЕсли;	
		
	СписокСотрудниковТрейдИн = Renault_CRM.ПолучитьСписокСотрудниковПоОтделу(ОтделТрейдИн);
	СписокСотрудниковТрейдИн.Добавить(?(ЗначениеЗаполнено(ОтделТрейдИн), ОтделТрейдИн, Объект.Отдел));
	
	Возврат СписокСотрудниковТрейдИн;
	
КонецФункции // ПолучитьСотрудниковОтделаТрейдИн()

// Обрабатывает команду "СоздатьЗаявкуТрейдИн" на сервере
//
&НаСервере
Процедура СоздатьЗаявкуТрейдИнНаСервере(МенеджерТрейдИн)
	
	ТекСотрудник = DMS_ОбращенияКлиентов.ВернутьТекущегоСотрудника();	
	ТекущаяДата = ТекущаяДата();
	
	ДокументЗаявка = Документы.Renault_ЗаявкаНаТрейдИн.СоздатьДокумент();
	ДокументЗаявка.Дата = ТекущаяДата;
	ДокументЗаявка.МенеджерЗаявитель = ТекСотрудник; 
	ДокументЗаявка.РабочийЛист = Объект.IDK;
	ДокументЗаявка.ДилерскийЦентр = Объект.ДилерскийЦентр;
	ДокументЗаявка.Клиент = Объект.Клиент;
	ДокументЗаявка.Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.Черновик;
	ДокументЗаявка.ТипСделки = "ТрейдИн";
	ДокументЗаявка.ВычетДилера = Объект.ДилерскийЦентр.UsedCars_МаржаСумма;
	ДокументЗаявка.СтатусЮридическойПроверки = Перечисления.DMS_СтатусыЮридическойПроверки.ПроверкаНеВыполнялась;
	ДокументЗаявка.ТипОперацииTradeIn = ТипОперацииТрейдИн;
	Если ТипЗнч(МенеджерТрейдИн) = Тип("СправочникСсылка.CRM_Отделы") Тогда
		ДокументЗаявка.Отдел = МенеджерТрейдИн;
	Иначе
		ДокументЗаявка.МенеджерТрейдИн = МенеджерТрейдИн;
	КонецЕсли;
	ДокументЗаявка.Записать();	
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.Объект = ЗаявкаНаТрейдИн;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИн; 
	Запись.ДилерскийЦентр = Объект.ДилерскийЦентр;
	Запись.ДатаВыполнения = ТекущаяДата;
	Запись.Записать();
		
	Событие = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
	Событие.IDK = Объект.IDK;
	Событие.Дата = ТекущаяДата();
	Событие.Автор = ТекСотрудник;
	Событие.ВидСобытия = Справочники.CRM_ВидыСобытий.Прочее;
	Событие.Комментарий = "Создание заявки на трейд-ин";
	Событие.ДатаНапоминания = ТекущаяДата;
	Событие.ДатаЗакрытия = ТекущаяДата;
	Событие.КомментарийЗакрытия = "Выполнено";
	Событие.АвторЗакрытия = ТекСотрудник;
	Событие.Сотрудник = ТекСотрудник;
	Событие.ДилерскийЦентр = Объект.ДилерскийЦентр;
	Если ТипЗнч(МенеджерТрейдИн) = Тип("СправочникСсылка.CRM_Отделы") Тогда
		Событие.Отдел = МенеджерТрейдИн;
	Иначе
		Событие.Сотрудник = МенеджерТрейдИн;
	КонецЕсли;
	Событие.Записать();
	
	ЗаявкаНаТрейдИн = ДокументЗаявка.Ссылка;
	
	ПроизводительТрейдИн = "";
	ГодВыпускаТрейдИн = "";
	МодельТрейдИн = "";
	ОжидаемаяСтоимостьКлиентаТрейдИн = 0;
	
	ПараметрыУправленияЭлементами = Новый Структура();
	ПараметрыУправленияЭлементами.Вставить("ГодВыпускаТрейдИн", Ложь);
	ПараметрыУправленияЭлементами.Вставить("МодельТрейдИн", Ложь);
	ПараметрыУправленияЭлементами.Вставить("ОжидаемаяСтоимостьКлиентаТрейдИн", Ложь);
	
	ОбновитьИнтерфейсТрейдИн(ПараметрыУправленияЭлементами);
	
КонецПроцедуры // СоздатьЗаявкуТрейдИнНаСервере()	

// Проверка на наличие заявок трейд-ин
// 
// Возвращаемое значение:
//  Булево - Есть заявки трейд-ин
//
&НаСервере
Функция ПроверитьСозданныеЗаявкиТрейдИн()

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТипОперацииTradeIn", ТипОперацииТрейдИн);
	Запрос.УстановитьПараметр("РабочийЛист", Объект.IDK);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Renault_ЗаявкаНаТрейдИн.Ссылка
	|ИЗ
	|	Документ.Renault_ЗаявкаНаТрейдИн КАК Renault_ЗаявкаНаТрейдИн
	|ГДЕ
	|	НЕ Renault_ЗаявкаНаТрейдИн.ПометкаУдаления
	|	И Renault_ЗаявкаНаТрейдИн.ТипОперацииTradeIn = &ТипОперацииTradeIn
	|	И Renault_ЗаявкаНаТрейдИн.РабочийЛист = &РабочийЛист";
				   
	Возврат Не Запрос.Выполнить().Пустой();
				   
КонецФункции // ПроверитьСозданныеЗаявкиТрейдИн()

// Оповещение "ОбновитьФормуЗаписи"
//
&НаКлиенте
Процедура ОбработкаОповещенияФормыЗаписи()
	
	СтруктураПервичныйИнтерес = Новый Структура;
	СтруктураПервичныйИнтерес.Вставить("IDK", 				Объект.IDK);
	СтруктураПервичныйИнтерес.Вставить("ПервичныйИнтерес",	Объект.ПервичныйИнтересМодель);
	
	Оповестить("ОбновитьФормуЗаписи",СтруктураПервичныйИнтерес);  
	
КонецПроцедуры // ОбработкаОповещенияФормыЗаписи() 

// Открывает форму со списком рабочих листов
//
&НаКлиенте
Процедура ОткрытьПоискЛистов()
	
	// TO DO тут скорее всего придется сделать какую то свою форму или переделать АРМ менеджеров на РЛ-документы
	Форма = Обработки.Renault_ARM_Менеджеры.ПолучитьФорму("Форма");
	
	Если Форма.Открыта() Тогда
		
		Форма.Закрыть();
		
	КонецЕсли;
	
	Если Объект.ТипРабочегоЛиста <> Перечисления.Renault_ТипыРабочихЛистов.TradeIn Тогда
		
		Форма.ВнешнийПоискОтборТиповЛистов = Перечисления.Renault_ТипыРабочихЛистов.TradeIn;
		
	КонецЕсли;
	
	Форма.ЭтоВнешнийПоискЛистов = Истина;
	
	СвязаныйIDKполуч = Форма.ОткрытьМодально();
	
	Если ЗначениеЗаполнено(СвязаныйIDKполуч) Тогда
		
		СвязаныйIDK = СвязаныйIDKполуч;
		
		Элементы.НадписьСоздатьРабочийЛистТрейдИн.Заголовок = "Открыть связаный рабочий лист";
		Элементы.НадписьСоздатьРабочийЛистПродажа.Заголовок = "Открыть связаный рабочий лист";
		Элементы.НадписьПривязатьРабочийЛистПродажа.Заголовок = "Отвязать текущий и привязать другой рабочий лист";
		Элементы.ПривязатьСоздатьРабочийЛистТрейдИн.Заголовок = "Отвязать текущий и привязать другой рабочий лист";
		
	КонецЕсли;
	
КонецПроцедуры // ОткрытьПоискЛистов()

// Создает запись в РС "CRM_ВоронкаПродаж" по этапу продаж
//
// Параметры:
//  ЭтапПродаж	 - СправочникСсылка.CRM_ЭтапыПродаж	 - Этап продаж
//
&НаСервере
Процедура СоздатьЗаписьВоронкиПродаж(ЭтапПродаж)
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = ЭтапПродаж;
	Запись.Прочитать();
	Если НЕ Запись.Выбран() Тогда
		Запись.ДилерскийЦентр = Объект.ДилерскийЦентр;
		Запись.ДатаВыполнения = ТекущаяДата();
		Запись.Объект = Документы.Renault_ЗаявкаНаТрейдИн.НайтиПоРеквизиту("РабочийЛист", Объект.IDK)
	КонецЕсли;
	
КонецПроцедуры // СоздатьЗаписьВоронкиПродаж()

// Создает новое событие по рабочему листу
//
&НаКлиенте
Процедура СоздатьНовоеСобытие()
	
	ФормаСобытия = ПолучитьФорму("Документ.CRM_СобытияПоРабочимЛистам.Форма.ФормаСозданияСобытия");
	
	ФормаСобытия.IDK 				= Объект.IDK;
	ФормаСобытия.ВидСобытия 		= Справочники.CRM_ВидыСобытий.Прочее;
	ФормаСобытия.Сотрудник 			= Объект.Сотрудник;
	ФормаСобытия.Отдел 				= Объект.Отдел;
	ФормаСобытия.ДилерскийЦентр 	= Объект.ДилерскийЦентр;
	ФормаСобытия.Подразделение 		= Объект.Подразделение;
	ФормаСобытия.Открыть();
			
КонецПроцедуры // СоздатьНовоеСобытие()

// Возвращает список событий трейд-ин по IDK
//
// Параметры:
//  IDK	 - Строка	 - IDK событий
// 
// Возвращаемое значение:
//  СписокЗначений - Список событий трейд-ин по IDK
//
&НаСервереБезКонтекста
Функция ПолучитьСписокСобытийТрейдИн(IDK)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_СобытияПоРабочимЛистам.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
	               |ГДЕ
	               |	CRM_СобытияПоРабочимЛистам.IDK = &IDK
	               |	И НЕ CRM_СобытияПоРабочимЛистам.ПометкаУдаления
	               |	И НЕ CRM_СобытияПоРабочимЛистам.Обработано
	               |	И CRM_СобытияПоРабочимЛистам.ВидСобытия = ЗНАЧЕНИЕ(Справочник.CRM_ВидыСобытий.ОценкаТрейдИн)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	CRM_СобытияПоРабочимЛистам.МоментВремени";
	Запрос.УстановитьПараметр("IDK", IDK);
	Результат = Запрос.Выполнить();
	
	СписокСобытий = Новый СписокЗначений;
	
	Выборка = Запрос.Выполнить();
	
	Пока Выборка.Следующий() Цикл
		СписокСобытий.Добавить(Выборка.Ссылка);	
	КонецЦикла;
	
	Возврат СписокСобытий;
	
КонецФункции // ПолучитьСписокСобытийТрейдИн()

// Возвращает есть ли необработанные события по рабочему листу
// 
// Возвращаемое значение:
//  Булево - Признак наличия необработанных событий по рабочему листу
//
&НаСервере
Функция ЕстьСобытияПоРЛ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_СобытияПоРабочимЛистам.Ссылка
	|ИЗ
	|	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
	|ГДЕ
	|	CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
	|	И CRM_СобытияПоРабочимЛистам.IDK = &IDK";
	
	Запрос.УстановитьПараметр("IDK", Объект.IDK);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции // ЕстьСобытияПоРЛ()

// Возвращает массив невыполненных заявок на сервис по рабочему листу
// 
// Возвращаемое значение:
//  Массив - Массив заявок
//
&НаСервере
Функция ПолучитьНеВыполненныеЗаявкиНаСервис()
	
	МассивЗаявок = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Renault_CRM_ЗаявкаНаСервис.Ссылка
	|ИЗ
	|	Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
	|ГДЕ
	|	Renault_CRM_ЗаявкаНаСервис.Обращение.IDK = &IDK
	|	И НЕ Renault_CRM_ЗаявкаНаСервис.ПометкаУдаления
	|	И Renault_CRM_ЗаявкаНаСервис.Состояние В (&Состояние)";
	
	Запрос.УстановитьПараметр("IDK", Объект.IDK);
	СостоянияЗаявок = Новый СписокЗначений;
	СостоянияЗаявок.Добавить(Справочники.ВидыСостоянийЗаказНарядов.Заявка);
	СостоянияЗаявок.Добавить(Справочники.ВидыСостоянийЗаказНарядов.ПустаяСсылка());	
	Запрос.УстановитьПараметр("Состояние", СостоянияЗаявок);
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		МассивЗаявок.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат МассивЗаявок;
	
КонецФункции // ПолучитьНеВыполненныеЗаявкиНаСервис()

// Устанавливает пометки удаления для выполненных заявок на сервис
// 
// Возвращаемое значение:
//  Булево - Результат выполнения
//
&НаКлиенте
Функция ПометитьНеВыполненныеЗаявкиНаСервис()
	
	МассивЗаявок = ПолучитьНеВыполненныеЗаявкиНаСервис();
	
	Если МассивЗаявок.Количество() > 0 Тогда
			
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить("ОК", "Ок");
		Кнопки.Добавить("Заполнить", "Заполнить");
		Кнопки.Добавить("Отмена", "Отмена");
		
		Ответ = Вопрос(НСтр("ru = 'По этому рабочему листу есть заявки которые имеют статус ""незаполненные"", которые будут помечены на удаление!!!';"),Кнопки);
		Если Ответ = "ОК" Тогда
			Для Каждого Заявка Из МассивЗаявок Цикл
				ДокЗаявка = Заявка.ПолучитьОбъект();
				Если ДокЗаявка.Проведен Тогда
					ДокЗаявка.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				КонецЕсли;
				ДокЗаявка.ПометкаУдаления = Истина;
				Попытка
					ДокЗаявка.Записать();
				Исключение
					Сообщить("Не удалось пометить на удаление не выполненные заявки на сервис");
				КонецПопытки;
			КонецЦикла;
			Возврат Ложь;
		ИначеЕсли Ответ = "Заполнить" тогда
			
			Для Каждого Заявка из МассивЗаявок Цикл
				ПараметрыФормы = Новый Структура("Ключ", Заявка);
                ОткрытьФорму("Документ.Renault_CRM_ЗаявкаНаСервис.Форма.ФормаДокумента", ПараметрыФормы);
			КонецЦикла;
			Возврат Истина;
		ИначеЕсли Ответ = "Отмена" тогда
			Возврат Истина;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // ПометитьНеВыполненныеЗаявкиНаСервис()

// Проверяет есть ли поступление на склад по авто
//
// Параметры:
//  АвтомобильПроверки	 - СправочникСсылка.Автомобили	 - Проверямый автомобиль
// 
// Возвращаемое значение:
//  Булево - Есть поступление на склад
//
&НаСервере
Функция ПроверитьНаличиеПоступленияНаСклад(АвтомобильПроверки)

	Если Не ЗначениеЗаполнено(АвтомобильПроверки) Тогда
		Ошибки = "В заявке на трейд-ин не указан автомобиль";
		Сообщить(Ошибки);
		Возврат Ложь;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеАвтомобилейАвтомобили.Ссылка
	|ИЗ
	|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
	|ГДЕ
	|	ПоступлениеАвтомобилейАвтомобили.Автомобиль = &Автомобиль
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	ВводОстатковАвтомобилейАвтомобили.Ссылка
	|ИЗ
	|	Документ.ВводОстатковАвтомобилей.Автомобили КАК ВводОстатковАвтомобилейАвтомобили
	|ГДЕ
	|	ВводОстатковАвтомобилейАвтомобили.Автомобиль = &Автомобиль";
	
	Запрос.УстановитьПараметр("Автомобиль", АвтомобильПроверки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;	
	
КонецФункции // ПроверитьНаличиеПоступленияНаСклад()

// Проверяет есть ли этап посещения автосалона, если нет, то создает его
// 
// Возвращаемое значение:
//  Булево - Результат выполнения
//
&НаКлиенте
Функция ПроверитьСоздатьПосещение(ТекстВопроса="")
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ПосещениеАвтосалона;
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		Возврат Истина;
	Иначе
		//ВазСистем Тарасов 22.12.2020 11:03:22 Инцидент #DMSREN-996
		//{
		//Старый код:
		//Если Вопрос("Для проведения этого этапа необходимо посещение Клиентом дилерского центра. Создать посещение?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		//Новый код:
		Если ПустаяСтрока(ТекстВопроса) Тогда 
			ТекстВопроса = "Для проведения этого этапа необходимо посещение Клиентом дилерского центра. Создать посещение?";
		КонецЕсли;
		Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		//}
			//Проверим наличие напоминания
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	CRM_СобытияПоРабочимЛистам.Ссылка
			|ИЗ
			|	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
			|ГДЕ
			|	CRM_СобытияПоРабочимЛистам.IDK = &IDK
			|	И CRM_СобытияПоРабочимЛистам.ВидСобытия = &ВидСобытия
			|	И CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
			|
			|УПОРЯДОЧИТЬ ПО
			|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания";
			Запрос.УстановитьПараметр("IDK", Объект.IDK);
			Запрос.УстановитьПараметр("ВидСобытия", Справочники.CRM_ВидыСобытий.Встреча);
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				//Откроем форму завершения события
				Событие = Выборка.Ссылка;
				Событие.ПолучитьФорму("ФормаЗавершенияСобытия").ОткрытьМодально();
				Возврат Истина;
			Иначе
				//Создадим событие или выполним этап
				ФормаВыбораДействия = ПолучитьФорму("Документ.Renault_РабочийЛист.Форма.ФормаВыбораДействия");
				Ответ = ФормаВыбораДействия.ОткрытьМодально();
				Если ЗначениеЗаполнено(Ответ) Тогда
					Если Ответ = "Выполнить" Тогда
						Renault_CRM.Воронка_ПосещениеАвтосалона_Установить(Объект.IDK);
						Renault_CRM.Статистика_Установить(Справочники.CRM_ЭтапыПродаж.ПосещениеАвтосалона, Объект.IDK);
						Возврат Истина;
					ИначеЕсли Ответ = "Напоминание" Тогда
						СобытиеОбъект = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
						СобытиеОбъект.IDK = Объект.IDK;
						СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.Встреча;
						СобытиеОбъект.Сотрудник = Объект.Сотрудник;
						СобытиеОбъект.Отдел = Объект.Отдел;
						СобытиеОбъект.ДилерскийЦентр = Объект.ДилерскийЦентр;
						СобытиеОбъект.Подразделение = Объект.Подразделение;
						ФормаСобытия = СобытиеОбъект.ПолучитьФорму("ФормаСозданияСобытия");
						//ВазСистем Тарасов 23.11.2020 10:44:49 Инцидент #DMSREN-996
						//{
						//Старый код:
						//ФормаСобытия.Открыть();
						//Новый код:
						ФормаСобытия.ОткрытьМодально();
						//}
						Возврат Ложь;
					КонецЕсли
				КонецЕсли
			КонецЕсли
		Иначе
			Возврат Ложь;
		КонецЕсли
	КонецЕсли;
	
	Возврат Ложь; //Реакция на Escape
	
КонецФункции // ПроверитьСоздатьПосещение()

// Создает событие тест-драйва по рабочему листу
//
&НаКлиенте
Процедура СоздатьЗаписьНаТестДрайв()
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("Новый автомобиль", "Новый автомобиль");
	СписокВыбора.Добавить("Автомобиль с пробегом", "Автомобиль с пробегом");
	ФормаВыбора = ПолучитьОбщуюФорму("Renault_ФормаВыбораПлиткой");
	ФормаВыбора.СписокВыбора = СписокВыбора;
	ФормаВыбора.Заголовок = "Выбор типа тест драйва";
	Ответ = ФормаВыбора.ОткрытьМодально();
	
	Если Ответ <> Неопределено Тогда
		//Откроем форму создания события
		СобытиеОбъект = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
		СобытиеОбъект.IDK = Объект.IDK;
		СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.ТестДрайв;
		СобытиеОбъект.Сотрудник = Объект.Сотрудник;
		СобытиеОбъект.Отдел = Объект.Отдел;
		СобытиеОбъект.ДилерскийЦентр = Объект.ДилерскийЦентр;
		СобытиеОбъект.Подразделение = Объект.Подразделение;					
		ФормаСобытия = СобытиеОбъект.ПолучитьФорму("ФормаСозданияСобытия");
		ФормаСобытия.БУАвтомобиль = ?(Ответ = Неопределено или Ответ = "Новый автомобиль", Ложь, Истина);
		ФормаСобытия.Открыть();
	КонецЕсли;
	
КонецПроцедуры // СоздатьЗаписьНаТестДрайв()

// Синхронизация тест-драйвов с планшетом
//
&НаКлиенте
Процедура СинхронизироватьПланшетТД()
	
	Возврат;
	
	Если ТипЗнч(Объект.Клиент) = Тип("СправочникСсылка.Контрагенты") Тогда
		Потенциальный = Справочники.CRM_ПотенциальныеКонтрагенты.НайтиПоРеквизиту("Контрагент", Объект.Клиент);
		Ответ = Renault_РаботаСSalesTablet.ПолучитьДанныеПоТестДрайвам(Объект.Клиент);
		РазобратьДанныеПоТДИзПланшета(Ответ);
		Ответ = Renault_РаботаСSalesTablet.ПолучитьДанныеПоТестДрайвам(Потенциальный);
		РазобратьДанныеПоТДИзПланшета(Ответ);
	Иначе
		Ответ = Renault_РаботаСSalesTablet.ПолучитьДанныеПоТестДрайвам(Объект.Клиент);
		РазобратьДанныеПоТДИзПланшета(Ответ);
	КонецЕсли;
	
КонецПроцедуры // СинхронизироватьПланшетТД()

// Записывает данные по тест-драйвам из планшета в базу
//
// Параметры:
//  ТабДанных	 - ТаблицаЗначений	 - Данные по тест-драйвам из планшета
//
&НаКлиенте
Процедура РазобратьДанныеПоТДИзПланшета(ТабДанных)
	
	Возврат;
	
	Если ТипЗнч(ТабДанных)<>Тип("ТаблицаЗначений") Тогда Возврат; КонецЕсли;
	
	Для Каждого Данные из ТабДанных Цикл
		
		СсылкаТД = Документы.CRM_ЗаписьНаТестДрайв.ПолучитьСсылку(Новый УникальныйИдентификатор(Данные.Id));
		ЕстьДокумент = (СсылкаТД.ПолучитьОбъект() <> Неопределено);
		
		Если НЕ ЕстьДокумент Тогда
			//Создаем запись на ТД
			ДокТестДрайв = Документы.CRM_ЗаписьНаТестДрайв.СоздатьДокумент();
			ДокТестДрайв.УстановитьСсылкуНового(СсылкаТД);
		Иначе
			ДокТестДрайв = СсылкаТД.ПолучитьОбъект();
		КонецЕсли;
		
		ДокТестДрайв.Дата = ТекущаяДата();
		ДокТестДрайв.ДатаПроведения = Данные.Date;
		ДокТестДрайв.Клиент = Объект.Клиент;
		ДокТестДрайв.ДилерскийЦентр = Объект.ДилерскийЦентр;
		Автомобиль = НайтиАвтомобильДляТестДрайва(Объект.ДилерскийЦентр, Данные.Model,Данные.Version);
		Если Автомобиль.Пустая() Тогда
			Сообщить("Не найден автомбиль для тест-драйва по артикулу модели "+ Данные.Model+". Тест-драйв не будет загружен!");
			Продолжить;
		КонецЕсли;	
		ДокТестДрайв.Автомобиль = Автомобиль;
		ДокТестДрайв.Менеджер = Объект.Сотрудник;
		ДокТестДрайв.Отдел = Объект.Отдел;
		ДокТестДрайв.Подразделение = Объект.Подразделение;
		ДокТестДрайв.РабочийЛист = Объект.IDK;
		ДокТестДрайв.СтатусДокумента = Перечисления.CRM_СтатусыТестДрайва.Получить(Данные.TestDriveStatus);
		Если ДокТестДрайв.СтатусДокумента = Перечисления.CRM_СтатусыТестДрайва.Завершено или ДокТестДрайв.СтатусДокумента = Перечисления.CRM_СтатусыТестДрайва.ЗавершеноДосрочно Тогда
			Оценки = Renault_РаботаСSalesTablet.ПолучитьДанныеПоОценкамТестДрайва(Данные.Id);	
			Для Каждого стр из Оценки Цикл
				Показатель = Справочники.CRM_ПлановыеРезультатыКонтактов.НайтиПоНаименованию(стр.Title,Истина);
				Если НЕ ЗначениеЗаполнено(Показатель) Тогда
					ПоказательЭлемент = Справочники.CRM_ПлановыеРезультатыКонтактов.СоздатьЭлемент();
					ПоказательЭлемент.Наименование = стр.Title;
					ПоказательЭлемент.Записать();
					Показатель = ПоказательЭлемент.Ссылка;				
				КонецЕсли;  				
				стрДок = ДокТестДрайв.КодыКомментариев.Найти(Показатель,"Показатель");
				Если стрДок = Неопределено Тогда
					стрДок = ДокТестДрайв.КодыКомментариев.Добавить();	
				КонецЕсли;
				стрДок.Показатель = Показатель;
				стрДок.Оценка =  стр.Mark;
			КонецЦикла;
		КонецЕсли;
		
		ДокТестДрайв.ВыдатьНапоминание = Ложь;
		ДокТестДрайв.ТипТестДрайва = Перечисления.CRM_ТипыТестДрайвов.ЧастноеЛицо;
		ДокТестДрайв.Продолжительность = Объект.ДилерскийЦентр.Продажи_ПродолжительностьТестДрайва;
		ДокТестДрайв.Начало = Данные.Date;
		ДокТестДрайв.Записать(РежимЗаписиДокумента.Проведение);
		
		Если НЕ ЕстьДокумент Тогда
			СобытиеОбъект = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
			СобытиеОбъект.Дата = ТекущаяДата();
			СобытиеОбъект.IDK = Объект.IDK;
			СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.ТестДрайв;
			СобытиеОбъект.Сотрудник = Объект.Сотрудник;
			СобытиеОбъект.Отдел = Объект.Отдел;
			СобытиеОбъект.ДилерскийЦентр = Объект.ДилерскийЦентр;
			СобытиеОбъект.Подразделение = Объект.Подразделение;
			СобытиеОбъект.Автор = ПараметрыСеанса.Пользователь.Сотрудник;
			СобытиеОбъект.Объект = ДокТестДрайв.Ссылка;
			СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // РазобратьДанныеПоТДИзПланшета()

&НаКлиенте
Функция НайтиАвтомобильДляТестДрайва(ДилерскийЦентр, Модель, Версия)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_ДилерскиеЦентрыАвтомобилиТестДрайв.Автомобиль
	|ИЗ
	|	Справочник.CRM_ДилерскиеЦентры.АвтомобилиТестДрайв КАК CRM_ДилерскиеЦентрыАвтомобилиТестДрайв
	|ГДЕ
	|	CRM_ДилерскиеЦентрыАвтомобилиТестДрайв.Ссылка = &ДилерскийЦентр
	|	И ПОДСТРОКА(CRM_ДилерскиеЦентрыАвтомобилиТестДрайв.Автомобиль.Модель.Артикул,1,3) = ПОДСТРОКА(&Модель,1,3)
	|	И CRM_ДилерскиеЦентрыАвтомобилиТестДрайв.Автомобиль.ВариантКомплектации.Артикул = &Версия";
	
	Запрос.УстановитьПараметр("Модель", Модель);
	Запрос.УстановитьПараметр("Версия", Версия);
	Запрос.УстановитьПараметр("ДилерскийЦентр", ДилерскийЦентр);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	//Ищем по модели и версии
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Автомобиль;
	Иначе //не нашли, тогда ищем только по модели
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И CRM_ДилерскиеЦентрыАвтомобилиТестДрайв.Автомобиль.ВариантКомплектации.Артикул = &Версия","");
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Автомобиль;  
		Иначе
			Возврат Справочники.Автомобили.ПустаяСсылка();		
		КонецЕсли;
	КонецЕсли;
	
	Возврат Справочники.Автомобили.ПустаяСсылка();	
	
КонецФункции // НайтиАвтомобильДляТестДрайва()

// Синхронизирует данные по коммерческим предложениям с планшетом
//
&НаКлиенте
Процедура СинхронизироватьПланшетКП()
	
	Возврат;
	
	Ответ = Renault_РаботаСSalesTablet.ПолучитьДанныеПоКоммерческимПредложениям(Объект.IDТрафика);
	
	Если ТипЗнч(Ответ)<>Тип("ТаблицаЗначений") ИЛИ Ответ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийТариф = Renault_CRM.ПолучитьТекущийТарифНаАвтомобили();
	ТекДилерскийЦентр = Renault_РаботаСПравамиПользователя.ДилерскийЦентрПоУмолчанию(ПараметрыСеанса.Пользователь);
	ТипЦенКП = Renault_РаботаСПравамиПользователя.ПолучитьТипЦенКП(ТекДилерскийЦентр); 
	
	Для Каждого СтрокаОтвета ИЗ Ответ Цикл
		
		ИДПредложения = Сред(СтрокаОтвета.ID, 2, СтрДлина(СтрокаОтвета.ID)-2);
		СсылкаВБазе = Документы.CRM_КоммерческоеПредложение.ПолучитьСсылку(Новый УникальныйИдентификатор(ИДПредложения));
		Если СсылкаВБазе.ПолучитьОбъект() <> Неопределено  Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаОпции = СтрокаОтвета.Options;
		СтрокаАксессуары = СтрокаОтвета.Accessories;
		СтрокаДопОпции = СтрокаОтвета.AdditionalOptions;
		МодельАртикул = СтрокаОтвета.Vehicle;
		МодельВКомПредложение = Справочники.Модели.НайтиПоРеквизиту("Артикул", МодельАртикул);
		Если НЕ ЗначениеЗаполнено(МодельВКомПредложение) Тогда
			Возврат;
		КонецЕсли;
		КомплектацияАртикул = СтрокаОтвета.Version;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВариантыКомплектации.Ссылка
		|ИЗ
		|	Справочник.ВариантыКомплектации КАК ВариантыКомплектации
		|ГДЕ
		|	ВариантыКомплектации.Артикул = &Артикул
		|	И ВариантыКомплектации.Владелец = &Владелец";
		Запрос.УстановитьПараметр("Артикул", КомплектацияАртикул);
		Запрос.УстановитьПараметр("Владелец", МодельВКомПредложение);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			КомПредложение = Документы.CRM_КоммерческоеПредложение.СоздатьДокумент();
			Идентификатор = Сред(СтрокаОтвета.ID, 2, СтрДлина(СтрокаОтвета.ID)-2);
			НоваяСсылка = Документы.CRM_КоммерческоеПредложение.ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор));
			КомПредложение.УстановитьСсылкуНового(НоваяСсылка);
			КомПредложение.Автор = ПараметрыСеанса.Пользователь;
			КомПредложение.Дата = ТекущаяДата();
			КомПредложение.ДилерскийЦентр = Объект.ДилерскийЦентр;
			КомПредложение.Клиент = Объект.Клиент;
			КомПредложение.РабочийЛист = Объект.IDK;
			СоставПредложения = КомПредложение.Состав.Добавить();
			НоваяКонфигурация = Справочники.CRM_КонфигурацииАвтомобилей.СоздатьЭлемент();
			НоваяКонфигурация.Наименование = "" + МодельВКомПредложение.Наименование + " " + Выборка.Ссылка.Наименование;
			НоваяКонфигурация.РабочийЛист = Объект.IDK;
			НоваяКонфигурация.Комментарий = "Загружено из планшета продавца";
			
			//нет времени объяснять!!! делаем через попытку,  т.к., если в таблице NULL, то приходит пустая дата.
			Попытка				
					НоваяКонфигурация.Автомобиль = Справочники.Автомобили.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаОтвета.VehicleInStockId));					
			Исключение	
					
			КонецПопытки;		
				
			Если ЗначениеЗаполнено(НоваяКонфигурация.Автомобиль) Тогда
				ЗаполнитьЗначенияСвойств(НоваяКонфигурация,НоваяКонфигурация.Автомобиль,,"Наименование,Родитель,Владелец");
				НоваяКонфигурация.Версия = НоваяКонфигурация.Автомобиль.ВариантКомплектации;
			Иначе
				НоваяКонфигурация.Модель = МодельВКомПредложение;
				НоваяКонфигурация.Цвет = Справочники.Цвета.НайтиПоРеквизиту("Артикул",СокрЛП(СтрокаОтвета.ColorId));
				НоваяКонфигурация.Версия = Выборка.Ссылка;
			КонецЕсли;
			
			// Опции
			Если СтрокаОпции <> "" Тогда
				МассивОпций = CRM_Сервер.РазложитьСтрокуВМассивПодстрок(СтрокаОпции, ",");
				Для Каждого СтрокаОпция ИЗ МассивОпций Цикл
					ОпцияСсылка = Справочники.Опции.НайтиПоРеквизиту("Артикул", Сред(СтрокаОпция, 2, СтрДлина(СтрокаОпция)-2));
					Если ЗначениеЗаполнено(ОпцияСсылка) Тогда
						НоваяОпцияВКонфигурации = НоваяКонфигурация.Опции.Добавить();
						НоваяОпцияВКонфигурации.Опция = ОпцияСсылка;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			// Аксессуары и оборудование
			Если СтрокаАксессуары <> "" Тогда
				КомПредложение.ИнтересовалсяОборудованием = Истина;
				МассивАксессуаров = CRM_Сервер.РазложитьСтрокуВМассивПодстрок(СтрокаАксессуары, ",");
				Для Каждого СтрокаАксессуар ИЗ МассивАксессуаров Цикл
					
					АксессуарСтрока = СокрЛП(Сред(СтрокаАксессуар, 2, СтрДлина(СтрокаАксессуар)-2));
					Если АксессуарСтрока <> "" Тогда
						Артикул = "";
						Название = "";
						Цена = 0;
						Сумма = 0;
						МассивОписаниеАксессуара = CRM_Сервер.РазложитьСтрокуВМассивПодстрок(АксессуарСтрока, "&&");
						Если МассивОписаниеАксессуара.Количество()>=1 Тогда
							Артикул = МассивОписаниеАксессуара.получить(0);
						КонецЕсли;
						
						Если МассивОписаниеАксессуара.Количество()>=2 Тогда						
							Название = МассивОписаниеАксессуара.получить(1);
						КонецЕсли;
						
						Если МассивОписаниеАксессуара.Количество()>=3 Тогда						
							Цена = Число(МассивОписаниеАксессуара.получить(2));
							Сумма = Цена;
						КонецЕсли;
						
						АксессуарСсылка = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Артикул);
						Если ЗначениеЗаполнено(АксессуарСсылка) Тогда
							НовыйАксессуарВКонфигурации = НоваяКонфигурация.Оборудование.Добавить();
							НовыйАксессуарВКонфигурации.Номенклатура = АксессуарСсылка;
							НовыйАксессуарВКонфигурации.Количество = 1;
							НовыйАксессуарВКонфигурации.Цена = Цена;
							НовыйАксессуарВКонфигурации.Сумма = Сумма;
						Иначе
							АксессуарСсылка = Справочники.Номенклатура.НайтиПоНаименованию(Название);
							Если ЗначениеЗаполнено(АксессуарСсылка) Тогда
								НовыйАксессуарВКонфигурации = НоваяКонфигурация.Оборудование.Добавить();
								НовыйАксессуарВКонфигурации.Номенклатура = АксессуарСсылка;
								НовыйАксессуарВКонфигурации.Количество = 1;
								НовыйАксессуарВКонфигурации.Цена = Цена;
								НовыйАксессуарВКонфигурации.Сумма = Сумма;
							Иначе
								НовыйАксессуарВКонфигурации = НоваяКонфигурация.Оборудование.Добавить();
								НовыйАксессуарВКонфигурации.Номенклатура = Название;
								НовыйАксессуарВКонфигурации.Количество = 1;
								НовыйАксессуарВКонфигурации.Цена = Цена;
								НовыйАксессуарВКонфигурации.Сумма = Сумма;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла;
				НоваяКонфигурация.Оборудование.Свернуть("Номенклатура,Цена,Количество,Сумма");
			КонецЕсли;
			
			//Заполним суммы
			ЦенаВариантаКомплектации = 0;
			
			Если НовыйАвтомобиль = 1 Тогда
				
				Запрос = Новый Запрос;
				
				Запрос.УстановитьПараметр("VIN", НоваяКонфигурация.VIN);
				
				Запрос.Текст =
				"ВЫБРАТЬ
				|	CRM_СостояниеАвтомобилейПроизводителя_v2.ЦенаПродажиБаза
				|ИЗ
				|	РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
				|ГДЕ
				|	CRM_СостояниеАвтомобилейПроизводителя_v2.VIN = &VIN";
				Выборка = Запрос.Выполнить().Выбрать();
				
				Если Выборка.Следующий() Тогда
					ЦенаВариантаКомплектации = Выборка.ЦенаПродажиБаза;
				Иначе
					ЦенаВариантаКомплектации = 0;
				КонецЕсли;
				
			КонецЕсли;
			
			Если ЦенаВариантаКомплектации = 0 Тогда
				
				Запрос = Новый Запрос;
				
				Запрос.УстановитьПараметр("Модель", НоваяКонфигурация.Модель);
				Запрос.УстановитьПараметр("ВариантКомплектации", НоваяКонфигурация.Версия);
				Запрос.УстановитьПараметр("Тариф", ТекущийТариф);
				
				Запрос.Текст =
				"ВЫБРАТЬ
				|	Renault_ТарифНаКомплектацииАвтомобилей.ЦенаКлиентская
				|ИЗ
				|	РегистрСведений.Renault_ТарифНаКомплектацииАвтомобилей.СрезПоследних(, Тариф = &Тариф) КАК Renault_ТарифНаКомплектацииАвтомобилей
				|ГДЕ
				|	Renault_ТарифНаКомплектацииАвтомобилей.Модель = &Модель
				|	И Renault_ТарифНаКомплектацииАвтомобилей.ВариантКомплектации = &ВариантКомплектации";
				Выборка = Запрос.Выполнить().Выбрать();
				
				Если Выборка.Следующий() Тогда
					ЦенаВариантаКомплектации = Выборка.ЦенаКлиентская;
				Иначе
					ЦенаВариантаКомплектации = 0;
				КонецЕсли;
				
			КонецЕсли;
			
			НоваяКонфигурация.ЦенаВерсии = ЦенаВариантаКомплектации;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Опции.Опция
			|ПОМЕСТИТЬ ВТ_Опции
			|ИЗ
			|	&Опции КАК Опции
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Опции.Опция КАК Опция,
			|	ЕСТЬNULL(Renault_ТарифНаОпцииАвтомобилейСрезПоследних.ЦенаКлиентская, 0) КАК Цена
			|ИЗ
			|	ВТ_Опции КАК ВТ_Опции
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ТарифНаОпцииАвтомобилей.СрезПоследних(
			|				,
			|				Модель = &Модель
			|					И Тариф = &Тариф
			|					И ВариантКомплектации = &Комплектация
			|					И Базовая = ЛОЖЬ) КАК Renault_ТарифНаОпцииАвтомобилейСрезПоследних
			|		ПО ВТ_Опции.Опция = Renault_ТарифНаОпцииАвтомобилейСрезПоследних.Опция";
			
			Запрос.УстановитьПараметр("Опции", НоваяКонфигурация.Опции.Выгрузить());
			Запрос.УстановитьПараметр("Комплектация", НоваяКонфигурация.Версия);
			Запрос.УстановитьПараметр("Модель", НоваяКонфигурация.Модель);
			Запрос.УстановитьПараметр("Тариф", ТекущийТариф);
			НоваяКонфигурация.Опции.Загрузить(Запрос.Выполнить().Выгрузить());
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Аксессуары.Номенклатура,
			|	1 КАК Количество
			|ПОМЕСТИТЬ ВТ_Аксессуары
			|ИЗ
			|	&Аксессуары КАК Аксессуары
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Аксессуары.Номенклатура КАК Номенклатура,
			|	ВТ_Аксессуары.Количество КАК Количество,
			|	МАКСИМУМ(ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0)) КАК Цена,
			|	МАКСИМУМ(ВТ_Аксессуары.Количество * ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0)) КАК Сумма
			|ИЗ
			|	ВТ_Аксессуары КАК ВТ_Аксессуары
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(, ТипЦен = &ТипЦенКП) КАК ЦеныСрезПоследних
			|		ПО ВТ_Аксессуары.Номенклатура = ЦеныСрезПоследних.Номенклатура
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_Аксессуары.Номенклатура,
			|	ВТ_Аксессуары.Количество";
			
			Запрос.УстановитьПараметр("Аксессуары", НоваяКонфигурация.Аксессуары.Выгрузить());
			Запрос.УстановитьПараметр("ТипЦенКП", ТипЦенКП);
			
			НоваяКонфигурация.Аксессуары.Загрузить(Запрос.Выполнить().Выгрузить());
			
			СтоимостьДоставки = 0;
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЕСТЬNULL(ЕСТЬNULL(ПоВерсиям.СтоимостьДоставки, ПоМоделям.СтоимостьДоставки), 0) КАК СтоимостьДоставки
			|ИЗ
			|	(ВЫБРАТЬ
			|		Renault_СтоимостьДоставкиАвтомобилей.СтоимостьДоставки КАК СтоимостьДоставки
			|	ИЗ
			|		РегистрСведений.Renault_СтоимостьДоставкиАвтомобилей КАК Renault_СтоимостьДоставкиАвтомобилей
			|	ГДЕ
			|		Renault_СтоимостьДоставкиАвтомобилей.Версия = &Версия) КАК ПоВерсиям
			|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			Renault_СтоимостьДоставкиАвтомобилей.СтоимостьДоставки КАК СтоимостьДоставки
			|		ИЗ
			|			РегистрСведений.Renault_СтоимостьДоставкиАвтомобилей КАК Renault_СтоимостьДоставкиАвтомобилей
			|		ГДЕ
			|			Renault_СтоимостьДоставкиАвтомобилей.Модель = &Модель) КАК ПоМоделям
			|		ПО (ИСТИНА)";


			Запрос.УстановитьПараметр("Версия", НоваяКонфигурация.Версия);
			Запрос.УстановитьПараметр("Модель", НоваяКонфигурация.Модель);

			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				СтоимостьДоставки = Выборка.СтоимостьДоставки;
			КонецЕсли;
			Если СтоимостьДоставки = 0 ИЛИ Не ЗначениеЗаполнено(СтоимостьДоставки) Тогда
				СтоимостьДоставки = ТекДилерскийЦентр.СтоимостьДоставкиПоУмолчанию;;
			КонецЕсли;
			
			
			НоваяКонфигурация.СуммаДоставки = СтоимостьДоставки;
			СоставПредложения.СуммаДоставки = СтоимостьДоставки;			
			
			НоваяКонфигурация.Записать();
			
			
			СоставПредложения.Конфигурация = НоваяКонфигурация.Ссылка;
			СоставПредложения.Сумма = НоваяКонфигурация.Опции.Итог("Цена") + НоваяКонфигурация.Аксессуары.Итог("Сумма");
			

			КомПредложение.Сумма = ЦенаВариантаКомплектации+ СоставПредложения.Сумма + СоставПредложения.СуммаДоставки - СоставПредложения.СуммаСкидки;

			КомПредложение.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЦикла;
	
	Воронка_ОбновитьКоммерческоеПредложение();
	
КонецПроцедуры // СинхронизироватьПланшетКП()

// Открывает форму АРМ "Конфигуратор"
//
// Параметры:
//  ТекущаяСтрока				 - Строка табличного поля	 - Текущая строка табличного поля коммерческих предложений
//  ПоказатьСтраницуОборудования - Булево					 - Признак открытия страницы с доп. оборудованием
//
&НаКлиенте
Процедура ОткрытьФормуКомПредложения(ТекущаяСтрока, ПоказатьСтраницуОборудования = Ложь) 
	
	СсылкаНаКП = ТекущаяСтрока.Ссылка;
	
	ФормаРабочийСтол = Обработки.CRM_АРМ_Конфигуратор.ПолучитьФорму("Форма");
	ФормаРабочийСтол.ТекущийРабочийЛист = Объект.IDK;
	ФормаРабочийСтол.ТекущийКлиент = Объект.Клиент;
	ФормаРабочийСтол.ПоказатьСтраницуОборудования = ПоказатьСтраницуОборудования;
	Если ЗначениеЗаполнено(СсылкаНаКП) Тогда
		ФормаРабочийСтол.ТекущееКП = СсылкаНаКП;
		Если СсылкаНаКП.ТрейдИн Тогда
			ФормаРабочийСтол.ЭтоТрейдИН = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ФормаРабочийСтол.Открыть();
	
КонецПроцедуры // ОткрытьФормуКомПредложения()

// Открывает форму коммерческих предложений и задач
//
// Параметры:
//  ВидЗадачи	 - СправочникСсылка.CRM_ВидыСобытий	 - Вид события
//
&НаКлиенте
Процедура СтраховкаКредит(ВидЗадачи)
	
	//выбор коммерческого предложения
	МассивКП=СписокКП();
	Если МассивКП.Количество()=0 Тогда 
		Предупреждение("Создание заявки возможно только на основе КП"); 
		Возврат;
	Иначе
		спКП=Новый СписокЗначений; спКП.ЗагрузитьЗначения(МассивКП); 
		ОткрытьФорму("Документ.Renault_РабочийЛист.Форма.КПиЗадачи", Новый Структура("спКП,ВидСобытия",спКП,ВидЗадачи) ,ЭтаФорма,ВидЗадачи);
	КонецЕсли;
	
КонецПроцедуры // СтраховкаКредит()

// Создает новый договор по рабочему листу
//
&НаКлиенте
Процедура СоздатьНовыйДоговор()
	
	ЗаписьРЛ = Renault_CRM.докПолучитьЗаписьРЛПоIDK(Объект.IDK);

	ДоговорОбъектНового = Документы.Renault_Договор.СоздатьДокумент();
	ДоговорОбъектНового.Дата = ТекущаяДата();
	ДоговорОбъектНового.ДатаДоговора = ТекущаяДата();	
	ДоговорОбъектНового.РабочийЛист = Объект.IDK;
	ДоговорОбъектНового.СтатусДоговора = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Черновик;
	ДоговорОбъектНового.Клиент = ЗаписьРЛ.Клиент;
	ДоговорОбъектНового.ДилерскийЦентр = Объект.ДилерскийЦентр;
			
	//ДоговорОбъектНового.ПолучитьФорму().Открыть();
	ТекМенеджер = ПараметрыСеанса.Пользователь.Сотрудник;
	ТекОрганизация = ТекМенеджер.Организация;
	Если НЕ (ЗначениеЗаполнено(ТекМенеджер) И ЗначениеЗаполнено(ТекОрганизация)) Тогда
		ПоказатьПредупреждение(, "Для пользователя не задан сотрудник/организация!");
		Возврат;
	КонецЕсли;
	Результат  = ДоговорОбъектНового.ПолучитьФорму().ОткрытьМодально();
	Прочитать();
	//ВазСистем Тарасов 25.12.2020 11:04:10 Инцидент #DMSREN-1051
	//{
	//Старый код:
	//Новый код:
	Если ДоговорОбъектНового.Клиент <> Объект.Клиент Тогда 
		Объект.Клиент = ДоговорОбъектНового.Клиент;
		Модифицированность = Истина;
		Оповестить("ПеречитатьДанныеКлиента");
	КонецЕсли;
	//}

КонецПроцедуры // СоздатьНовыйДоговор()

// Создает событие выдачи
//
// Параметры:
//  VIN	 - Строка	 - VIN автомобиля
//
&НаКлиенте
Процедура СоздатьЗаписьНаВыдачу(VIN="")
	
	Если Элементы.Договоры.ТекущиеДанные = Неопределено Тогда
		Если Договоры.Количество() > 0 Тогда
			СтруктураПоиска = Новый Структура("СтатусДоговора", Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан);
			НайденныеСтроки = Договоры.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				ТекДоговор = НайденныеСтроки[0];
			Иначе
				ТекДоговор = Неопределено;
			КонецЕсли;
			Если ТекДоговор = Неопределено Тогда
				ТекДоговор = Договоры[0];
			КонецЕсли;
		Иначе
			Сообщить("Отсутствует договор, выдача невозможна");
			Возврат;
		КонецЕсли;
	Иначе
		ТекДоговор = Элементы.Договоры.ТекущиеДанные;	
	КонецЕсли;
	
	МассивVINПоДоговору = ТекДоговор.Ссылка.СоставДоговора.ВыгрузитьКолонку("VIN");
	
	// ++ начало Давыдов А. 2020-04-30
	// DMSREN-678 - сделаем проверку на повторную выдачу авто. По-хорошему, надо вычищать повторные проверки.
	// но тогда много где много чего найдется переделывать. Поэтому, просто вставлю свою проверку.
	// Рекомендуется использовать ее.
	
	//пока закоментим проверку по задаче DMSREN-847 
	//ТекстСообщения = ""; Элементы.Выдачи.ТекущаяСтрока
	//Если CRM_Сервер.ЕстьВыданныеАвтомобили(Объект.IDK, МассивVINПоДоговору, Истина, ТекстСообщения) Тогда
	//	Сообщить("По данному договору рабочего листа уже имеется запланированная или завершенная выдача. Список VIN:" + Символы.ПС + ТекстСообщения);
	//	Возврат;
	//КонецЕсли; 
	// -- конец Давыдов А.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(CRM_СобытияПоРабочимЛистам.Ссылка) КАК ДокСобытиеВыдача
	|ИЗ
	|	Документ.CRM_СобытияПоРабочимЛистам.АвтомобилиДляВыдачи КАК CRM_СобытияПоРабочимЛистам
	|ГДЕ
	|	CRM_СобытияПоРабочимЛистам.Ссылка.IDK = &IDK
	|	И CRM_СобытияПоРабочимЛистам.VIN В (&МассивVIN)
	|	И CRM_СобытияПоРабочимЛистам.Ссылка.ВидСобытия = ЗНАЧЕНИЕ(Справочник.CRM_ВидыСобытий.Выдача)
	|	И CRM_СобытияПоРабочимЛистам.Ссылка.Обработано = ИСТИНА
	|	И CRM_СобытияПоРабочимЛистам.Ссылка.ЗавершеноУспешно = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	CRM_СобытияПоРабочимЛистам.Ссылка.ДатаНапоминания";
	Запрос.УстановитьПараметр("IDK", Объект.IDK);
	Запрос.УстановитьПараметр("МассивVIN", МассивVINПоДоговору);	

	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();		
		Пока Выборка.Следующий() Цикл
			Сообщить("По данному автомобилю рабочего листа уже производилась успешная выдача - " + Выборка.ДокСобытиеВыдача + ".");
		КонецЦикла;		
		Возврат;
	КонецЕсли;	
	
	АвтомобилиДляВыдачи = Новый ТаблицаЗначений;
	// Для одного автомобиля заполняем выдачу сразу
	// Для нескольких выбираем автомобили в самой выдаче
	//Если МассивVINПоДоговору.Количество() = 1 Тогда
	Если МассивVINПоДоговору.Количество() <> 0 Тогда
		VIN = МассивVINПоДоговору[0];
		Если НЕ ЗначениеЗаполнено(VIN) Тогда 
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			               |	Renault_ЗаконтрактованныеАвтомобили.VIN,
			               |	Renault_ЗаконтрактованныеАвтомобили.Регистратор,
						   |	Renault_ЗаконтрактованныеАвтомобили.Регистратор КАК Договор,
			               |	ВЫБОР
			               |		КОГДА Renault_ЗаконтрактованныеАвтомобили.ДатаСнятияРезерва = ДАТАВРЕМЯ(1, 1, 1)
			               |			ТОГДА ИСТИНА
			               |		ИНАЧЕ ЛОЖЬ
			               |	КОНЕЦ КАК Выбран,
			               |	Renault_ЗаконтрактованныеАвтомобили.Автомобиль
			               |ИЗ
			               |	РегистрСведений.Renault_ЗаконтрактованныеАвтомобили.СрезПоследних КАК Renault_ЗаконтрактованныеАвтомобили
			               |ГДЕ
			               |	Renault_ЗаконтрактованныеАвтомобили.РабочийЛист = &РабочийЛист
			               |	И Renault_ЗаконтрактованныеАвтомобили.ДатаСнятияРезерва = ДАТАВРЕМЯ(1, 1, 1)";
			Запрос.УстановитьПараметр("РабочийЛист", Объект.IDK);
			АвтомобилиДляВыдачи = Запрос.Выполнить().Выгрузить();			
		Иначе			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	Renault_ЗаконтрактованныеАвтомобили.VIN,
			               |	Renault_ЗаконтрактованныеАвтомобили.Регистратор,
						   |	Renault_ЗаконтрактованныеАвтомобили.Регистратор КАК Договор,
			               |	ВЫБОР
			               |		КОГДА Renault_ЗаконтрактованныеАвтомобили.ДатаСнятияРезерва = ДАТАВРЕМЯ(1, 1, 1)
			               |			ТОГДА ИСТИНА
			               |		ИНАЧЕ ЛОЖЬ
			               |	КОНЕЦ КАК Выбран,
			               |	Renault_ЗаконтрактованныеАвтомобили.Автомобиль
			               |ИЗ
			               |	РегистрСведений.Renault_ЗаконтрактованныеАвтомобили.СрезПоследних КАК Renault_ЗаконтрактованныеАвтомобили
			               |ГДЕ
			               |	Renault_ЗаконтрактованныеАвтомобили.РабочийЛист = &РабочийЛист
			               |	И Renault_ЗаконтрактованныеАвтомобили.ДатаСнятияРезерва = ДАТАВРЕМЯ(1, 1, 1)
			               |	И Renault_ЗаконтрактованныеАвтомобили.VIN = &VIN";
			Запрос.УстановитьПараметр("РабочийЛист", Объект.IDK);
			Запрос.УстановитьПараметр("VIN", VIN);
			
			АвтомобилиДляВыдачи = Запрос.Выполнить().Выгрузить();		
		КонецЕсли;
	КонецЕсли;
	
	////Если МассивVINПоДоговору.Количество() = 0 Тогда
	Если АвтомобилиДляВыдачи.Количество() = 0 Тогда
		Предупреждение("Нет автомобилей для выдачи!");
		Возврат;
	КонецЕсли;
	
	//Откроем форму создания события
	СобытиеОбъект = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
	СобытиеОбъект.IDK = Объект.IDK;
	СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.Выдача;
	СобытиеОбъект.Сотрудник = Объект.Сотрудник;
	СобытиеОбъект.Отдел = Объект.Отдел;
	СобытиеОбъект.ДилерскийЦентр = Объект.ДилерскийЦентр;
	СобытиеОбъект.Подразделение = Объект.Подразделение;
	СобытиеОбъект.АвтомобилиДляВыдачи.Загрузить(АвтомобилиДляВыдачи);
	ФормаСобытия = СобытиеОбъект.ПолучитьФорму("ФормаСозданияСобытия");
	ФормаСобытия.Открыть();	
	
КонецПроцедуры // СоздатьЗаписьНаВыдачу()

// Создает событие первого звонка вежливости
//
&НаКлиенте
Процедура СоздатьЗвонокВежливости3()
	
	//Откроем форму создания события		
	СобытиеОбъект = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
	СобытиеОбъект.IDK = Объект.IDK;
	СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.ЗвонокВежливости3;
	СобытиеОбъект.Сотрудник = Объект.Сотрудник;
	СобытиеОбъект.Отдел = Объект.Отдел;
	СобытиеОбъект.ДилерскийЦентр = Объект.ДилерскийЦентр;
	СобытиеОбъект.Подразделение = Объект.Подразделение;					
	ФормаСобытия = СобытиеОбъект.ПолучитьФорму("ФормаСозданияСобытия");
	ФормаСобытия.Открыть();
	
КонецПроцедуры // СоздатьЗвонокВежливости3()

// Создает событие второго звонка вежливости
//
&НаКлиенте
Процедура СоздатьЗвонокВежливости30()
	
	//Откроем форму создания события		
	СобытиеОбъект = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
	СобытиеОбъект.IDK = Объект.IDK;
	СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.ЗвонокВежливости30;
	СобытиеОбъект.Сотрудник = Объект.Сотрудник;
	СобытиеОбъект.Отдел = Объект.Отдел;
	СобытиеОбъект.ДилерскийЦентр = Объект.ДилерскийЦентр;
	СобытиеОбъект.Подразделение = Объект.Подразделение;					
	ФормаСобытия = СобытиеОбъект.ПолучитьФорму("ФормаСозданияСобытия");
	ФормаСобытия.Открыть();
	
КонецПроцедуры // СоздатьЗвонокВежливости30()

// Создает событие третьего звонка вежливости
//
&НаКлиенте
Процедура СоздатьЗвонокВежливости360()
	
	//Откроем форму создания события		
	СобытиеОбъект = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
	СобытиеОбъект.IDK = Объект.IDK;
	СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.ЗвонокВежливости360;
	СобытиеОбъект.Сотрудник = Объект.Сотрудник;
	СобытиеОбъект.Отдел = Объект.Отдел;
	СобытиеОбъект.ДилерскийЦентр = Объект.ДилерскийЦентр;
	СобытиеОбъект.Подразделение = Объект.Подразделение;					
	ФормаСобытия = СобытиеОбъект.ПолучитьФорму("ФормаСозданияСобытия");
	ФормаСобытия.Открыть();
	
КонецПроцедуры // СоздатьЗвонокВежливости360()      

// Беседин 19.10.21 заявка 1082
&НаКлиенте
Процедура СоздатьЗвонокВежливостиНов()
	
	//Откроем форму создания события		
	СобытиеОбъект = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
	СобытиеОбъект.IDK = Объект.IDK;
	СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.ЗвонокВежливостиНовый;
	СобытиеОбъект.Сотрудник = Объект.Сотрудник;
	СобытиеОбъект.Отдел = Объект.Отдел;
	СобытиеОбъект.ДилерскийЦентр = Объект.ДилерскийЦентр;
	СобытиеОбъект.Подразделение = Объект.Подразделение;					
	ФормаСобытия = СобытиеОбъект.ПолучитьФорму("ФормаСозданияСобытия");
	ФормаСобытия.Открыть();
	
КонецПроцедуры // СоздатьЗвонокВежливостиНов()

// Возвращает актуальный документ предварительной оценки
// 
// Возвращаемое значение:
//  ДокументСсылка.Renault_ПредварительнаяОценкаАвтомобиляТрейдИн - Актуальный документ
//
&НаСервере
Функция АктуальныйДокументПредварительнойОценки()
	
	ДокументОценки = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ЗаявкаНаТрейдИн.ОриентировочнаяЦена,
	|	Renault_ЗаявкаНаТрейдИн.ДатаОценки
	|ПОМЕСТИТЬ ДанныеЗаявкиНаТрейдИн
	|ИЗ
	|	Документ.Renault_ЗаявкаНаТрейдИн КАК Renault_ЗаявкаНаТрейдИн
	|ГДЕ
	|	Renault_ЗаявкаНаТрейдИн.Ссылка = &ЗаявкаНаТрейдИн
	|	И Renault_ЗаявкаНаТрейдИн.ОриентировочнаяЦена <> 0
	|	И Renault_ЗаявкаНаТрейдИн.ДатаОценки <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_ПредварительнаяОценкаАвтомобиляТрейдИн.Ссылка КАК ДокументОценки
	|ИЗ
	|	Документ.Renault_ПредварительнаяОценкаАвтомобиляТрейдИн КАК Renault_ПредварительнаяОценкаАвтомобиляТрейдИн
	|ГДЕ
	|	Renault_ПредварительнаяОценкаАвтомобиляТрейдИн.ЗаявкаНаТрейдИн = &ЗаявкаНаТрейдИн
	|	И (Renault_ПредварительнаяОценкаАвтомобиляТрейдИн.ОриентировочнаяЦена, Renault_ПредварительнаяОценкаАвтомобиляТрейдИн.ДатаОценки) В
	|			(ВЫБРАТЬ
	|				ДанныеЗаявкиНаТрейдИн.ОриентировочнаяЦена,
	|				ДанныеЗаявкиНаТрейдИн.ДатаОценки
	|			ИЗ
	|				ДанныеЗаявкиНаТрейдИн КАК ДанныеЗаявкиНаТрейдИн)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Renault_ПредварительнаяОценкаАвтомобиляТрейдИн.МоментВремени УБЫВ";	
	Запрос.УстановитьПараметр("ЗаявкаНаТрейдИн", ЗаявкаНаТрейдИн);	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		ДокументОценки = Выборка.ДокументОценки;
	КонецЕсли; 
	
	Возврат ДокументОценки;
	
КонецФункции // АктуальныйДокументПредварительнойОценки()

// Создает новое обращение в сервис или предлагает выбор существующего
//
&НаКлиенте
Процедура СоздатьОбращениеВСервис()
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_CRM_ОбращениеВАвтоСервис.Ссылка КАК Документ,
	|	Renault_CRM_ОбращениеВАвтоСервис.ВидОбращения КАК ВидОбращения,
	|	Renault_CRM_ОбращениеВАвтоСервис.Менеджер КАК Менеджер
	|ИЗ
	|	Документ.Renault_CRM_ОбращениеВАвтоСервис КАК Renault_CRM_ОбращениеВАвтоСервис
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Renault_ЗаявкаНаТрейдИн КАК Renault_ЗаявкаНаТрейдИн
	|		ПО Renault_CRM_ОбращениеВАвтоСервис.Клиент = Renault_ЗаявкаНаТрейдИн.Клиент
	|			И Renault_CRM_ОбращениеВАвтоСервис.Автомобиль = Renault_ЗаявкаНаТрейдИн.Автомобиль
	|ГДЕ
	|	Renault_ЗаявкаНаТрейдИн.Ссылка = &Ссылка
	|	И Renault_CRM_ОбращениеВАвтоСервис.ВидОбращения = &ВидОбращения
	|	И Renault_CRM_ОбращениеВАвтоСервис.ПометкаУдаления = ЛОЖЬ
	|	И Renault_ЗаявкаНаТрейдИн.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ВидОбращения", Справочники.Renault_ВидыОбращенийВАвтосервис.ДиагностикаТрейдИн);
	Запрос.УстановитьПараметр("Ссылка", ЗаявкаНаТрейдИн);
	
	Выборка = Запрос.Выполнить();
	Если НЕ Выборка.Пустой() Тогда
		Форма = Документы.Renault_ЗаявкаНаТрейдИн.ПолучитьФорму("ФормаВыбораОбращений");
		ЗначениеВДанныеФормы(Выборка.Выгрузить(), Форма.ТаблицаОбращений);
		Результат = Форма.ОткрытьМодально();
		Если ЗначениеЗаполнено(Результат) и ТипЗнч(Результат) = Тип("ДокументСсылка.Renault_CRM_ОбращениеВАвтоСервис")  тогда  
			Форма = ПолучитьОбщуюФорму("Renault_АвтосервисФормаДеталейОбращения");
			Форма.Обращение = Результат; 				
			Форма.Открыть();		
		ИначеЕсли ЗначениеЗаполнено(Результат) и Результат = "Создать новый" тогда
			СоздатьНовоеОбращение();
		КонецЕсли;
	Иначе
		СоздатьНовоеОбращение();
	КонецЕсли;
	
КонецПроцедуры // СоздатьОбращениеВСервис()

// Создает новое обращение в автосервис
//
&НаКлиенте
Процедура СоздатьНовоеОбращение()
	
	НовоеОбращение = Документы.Renault_CRM_ОбращениеВАвтоСервис.СоздатьДокумент();
	НовоеОбращение.Дата = ТекущаяДата();
	НовоеОбращение.Менеджер = ПараметрыСеанса.Пользователь;
	НовоеОбращение.ОбращениеОбработано = Истина;
	НовоеОбращение.Клиент = ЗаявкаНаТрейдИн.Клиент;
	НовоеОбращение.Автомобиль = ЗаявкаНаТрейдИн.Автомобиль;
	НовоеОбращение.ВидОбращения = Справочники.Renault_ВидыОбращенийВАвтосервис.ДиагностикаТрейдИн;
	НовоеОбращение.ПервичныйПовторный = Перечисления.CRM_ПервичныйПовторный.Повторный;
	НовоеОбращение.IDK = ЗаявкаНаТрейдИн.РабочийЛист;
	НовоеОбращение.Записать();
    НовоеОбращениеСсылка = НовоеОбращение.Ссылка;
	Обработка = Обработки.Renault_АвтосервисВыборВерсии.Создать();
	
	Если Объект.ДилерскийЦентр.Автосервис_ИспользуетсяНоваяВерсияВ2 = Истина ТОГДА
		ФормаАвтосервис2 = Обработки.CRM_АРМ_АвтоСервис_4.ПолучитьФорму("Форма");
	Иначе
		ФормаАвтосервис2 = Обработки.CRM_АРМ_АвтоСервис_2.ПолучитьФорму("Форма");
	КонецЕсли;

	Обработка.ВнешнийЗапрос(НовоеОбращениеСсылка, ЗаявкаНаТрейдИн.Клиент, ЗаявкаНаТрейдИн.Автомобиль, ФормаАвтосервис2);
	
КонецПроцедуры // СоздатьНовоеОбращение()

// Создает калькуляцию ремонта трейд-ин
// 
// Возвращаемое значение:
//  ДокументСсылка.Renault_Калькуляция - Ссылка на созданную калькуляцию
//
&НаКлиенте
Функция СоздатьКалькуляцию()
	
	Заявки = НайтиЗаявки();
	
	Если Заявки.Количество() > 1 Тогда			
		Форма = ПолучитьОбщуюФорму("Renault_ФормаВыбораПлиткой");
		СписокВыбора = Новый СписокЗначений;
			
		СписокВыбора.ЗагрузитьЗначения(Заявки.ВыгрузитьКолонку("Заявка"));
			
		Форма.Заголовок = "Выберите в какую заявку добавлеяем.";
		Форма.СписокВыбора = СписокВыбора;
		
		Заявка = Форма.ОткрытьМодально();
		Если НЕ ЗначениеЗаполнено(Заявка) Тогда
			Предупреждение("Не выбрана заявка!");
			Возврат Неопределено;
		КонецЕсли; 				
	ИначеЕсли Заявки.Количество() = 1 Тогда		
		Заявка = Заявки[0].Заявка;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Заявка) Тогда
		Сообщить("Нет заявки в автосервис!");
		Возврат Неопределено;		
	КонецЕсли;
	
	Калькуляции = ПолучитьКалькуляцииПоЗаявке(Заявка);
	Если Калькуляции.Количество() > 0 Тогда		
		Калькуляция = Калькуляции[0].Значение;
	Иначе
		Калькуляция = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Калькуляция) Тогда
		ВопросПользователю = Вопрос("Найден документ калькуляции, открыть его (да) или создать новый (нет)?", РежимДиалогаВопрос.ДаНет);
					
		Если ВопросПользователю = КодВозвратаДиалога.Нет Тогда
			Калькуляция = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Калькуляция) Тогда 		
		Калькуляция = Документы.Renault_Калькуляция.СоздатьДокумент();
		
		Калькуляция.Контрагент = ЗаявкаНаТрейдИн.Клиент;
		Калькуляция.Автомобиль = ЗаявкаНаТрейдИн.Автомобиль;
		Калькуляция.ТипЦен = Заявка.ТипЦен;
		Калькуляция.Нормочас = Заявка.Нормочас;
		Калькуляция.ДокументОснование = Заявка;		
	Иначе		
		Калькуляция = Калькуляция.Ссылка.ПолучитьОбъект(); 		
	КонецЕсли;
	
	ФормаКалькуляции = Калькуляция.ПолучитьФорму();
	ФормаКалькуляции.ОткрытьМодально();
	
	Возврат Калькуляция.Ссылка;
	
КонецФункции // СоздатьКалькуляцию()

// Пересчитывает суммы заявки на трейд-ин
//
&НаКлиенте
Процедура ПересчитатьСтоимостьВосстановления()
	
	ЗаявкаОбъект = ЗаявкаНаТрейдИн.ПолучитьОбъект();
	

	ЗаявкаОбъект.ЗатратыНаВосстановлениеПослеДиагностики = 0;
	ТабРезультатыДиагностикиRenaultSelection = ЗаявкаОбъект.РезультатыДиагностикиRenaultSelection;
	
	Для Каждого Строка Из ТабРезультатыДиагностикиRenaultSelection Цикл
		ЗаявкаОбъект.ЗатратыНаВосстановлениеПослеДиагностики = 
			ЗаявкаОбъект.ЗатратыНаВосстановлениеПослеДиагностики
			+ Строка.СтоимостьЗапчасти
			+ Строка.СтоимостьРаботы;
	КонецЦикла;	
	
	СтоимостьВосстановленияПоКалькуляции = 0;
	СписокКалькуляции = Документы.Renault_Калькуляция.НайтиКалькуляциюПоЗаявкеНаТрейдИн(ЗаявкаОбъект.Ссылка);
	Если СписокКалькуляции.Количество() = 1 Тогда
		СтоимостьВосстановленияПоКалькуляции = Документы.Renault_Калькуляция.ПолучитьИтого(СписокКалькуляции[0].Ссылка);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаявкаОбъект.ОриентировочнаяЦена) Тогда		
		МаржаСумма = Объект.ДилерскийЦентр.UsedCars_МаржаСумма;
		МаржаПроцент = Объект.ДилерскийЦентр.UsedCars_МаржаПроцент;
		МаржаСуммаПоПроценту = МаржаПроцент * (ЗаявкаОбъект.ОриентировочнаяЦена - 
			ЗаявкаОбъект.ЗатратыНаВосстановлениеПослеДиагностики - СтоимостьВосстановленияПоКалькуляции) / 100;
		
		ЗаявкаОбъект.ВычетДилера = ?(ЗначениеЗаполнено(МаржаСумма), МаржаСумма, МаржаСуммаПоПроценту);  

		ЗаявкаОбъект.ЦенаВыкупа = ЗаявкаОбъект.ОриентировочнаяЦенаСреднее - ЗаявкаОбъект.ЗатратыНаВосстановлениеПослеДиагностики - СтоимостьВосстановленияПоКалькуляции - ЗаявкаОбъект.ВычетДилера;
	КонецЕсли;
		
	ЗаявкаОбъект.Записать();
	
КонецПроцедуры // ПересчитатьСтоимостьВосстановления()

// Возвращает таблицу заявок на сервис
// 
// Возвращаемое значение:
// ТаблицаЗначений  -  Таблица заявок на сервис
//
&НаСервере
Функция НайтиЗаявки()
	
	Обращение = ПолучитьОбращениеПоЗаявкеНаТрейдИн();
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_CRM_ЗаявкаНаСервис.Ссылка КАК Заявка
	|ИЗ
	|	Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
	|ГДЕ
	|	Renault_CRM_ЗаявкаНаСервис.Обращение.Ссылка = &Обращение";
	Запрос.УстановитьПараметр("Обращение", Обращение);
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
	
КонецФункции // НайтиЗаявки()

// Возвращает обращение по заявке на трейд-ин
// 
// Возвращаемое значение:
//  ДокументСсылка.Renault_CRM_ОбращениеВАвтоСервис - Обращение по заявке
//
&НаСервере
Функция ПолучитьОбращениеПоЗаявкеНаТрейдИн()
	
	Обращение = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ЗаявкаНаТрейдИн.Клиент,
	|	Renault_ЗаявкаНаТрейдИн.Автомобиль,
	|	Renault_ЗаявкаНаТрейдИн.РабочийЛист
	|ПОМЕСТИТЬ ПараметрыЗаявкаНаТрейдИн
	|ИЗ
	|	Документ.Renault_ЗаявкаНаТрейдИн КАК Renault_ЗаявкаНаТрейдИн
	|ГДЕ
	|	Renault_ЗаявкаНаТрейдИн.Ссылка = &ЗаявкаНаТрейдИн
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_CRM_ОбращениеВАвтоСервис.Ссылка КАК Обращение
	|ИЗ
	|	Документ.Renault_CRM_ОбращениеВАвтоСервис КАК Renault_CRM_ОбращениеВАвтоСервис
	|ГДЕ
	|	Renault_CRM_ОбращениеВАвтоСервис.ВидОбращения = ЗНАЧЕНИЕ(Справочник.Renault_ВидыОбращенийВАвтосервис.ДиагностикаТрейдИн)
	|	И (Renault_CRM_ОбращениеВАвтоСервис.Клиент, Renault_CRM_ОбращениеВАвтоСервис.Автомобиль, Renault_CRM_ОбращениеВАвтоСервис.IDK) В
	|			(ВЫБРАТЬ
	|				ПараметрыЗаявкаНаТрейдИн.Клиент,
	|				ПараметрыЗаявкаНаТрейдИн.Автомобиль,
	|				ПараметрыЗаявкаНаТрейдИн.РабочийЛист
	|			ИЗ
	|				ПараметрыЗаявкаНаТрейдИн КАК ПараметрыЗаявкаНаТрейдИн)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Renault_CRM_ОбращениеВАвтоСервис.МоментВремени УБЫВ";
	Запрос.УстановитьПараметр("ЗаявкаНаТрейдИн", ЗаявкаНаТрейдИн);
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Обращение = Выборка.Обращение;
	КонецЕсли;
	
	Возврат Обращение;
	
КонецФункции // ПолучитьОбращениеПоЗаявкеНаТрейдИн()

// Возвращает список калькуляций по заявке на трейд-ин
//
// Параметры:
//  Заявка	 - ДокументСсылка.Renault_ЗаявкаНаТрейдИн	 - Заявка
// 
// Возвращаемое значение:
//  СписокЗначений - Список калькуляций
//
&НаСервереБезКонтекста
Функция ПолучитьКалькуляцииПоЗаявке(Заявка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_Калькуляция.Ссылка КАК Калькуляция
	|ИЗ
	|	Документ.Renault_Калькуляция КАК Renault_Калькуляция
	|ГДЕ
	|	Renault_Калькуляция.ДокументОснование = &Заявка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Renault_Калькуляция.МоментВремени УБЫВ";	
	Запрос.УстановитьПараметр("Заявка", Заявка);	
	Результат = Запрос.Выполнить();
	
	Калькуляции = Новый СписокЗначений();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Калькуляции.Добавить(Выборка.Калькуляция);
		КонецЦикла;	
	КонецЕсли;
	
	Возврат Калькуляции;
	
КонецФункции // ПолучитьКалькуляцииПоЗаявке()

// Записывает код автомобиля выкупа в РС "CRM_ДополнительнаяИнформацияПоАвтомобилям"
//
// Параметры:
//  Автомобиль		 - СправочникСсылка.Автомобили						- Автомобиль
//  ДатаПоступления	 - Дата	 											- Дата поступления автомобиля
//  BIR				 - Строка											- BIR дилера
//  ТипОперации		 - ПеречислениеСсылка.Renault_ТипыОперацийТрейдИн	- Тип операции трейд-ин
//
&НаСервере
Процедура КодифицироватьАвтомобиль(Автомобиль, ДатаПоступления, BIR, ТипОперации);
	
	// Коды приемки:
	// Формат: A600010170001 , где
	// A – Тип поступления (см. ниже);
	// 6000 – Код дилера (Bir);
	// 10 – Месяц поступления;
	// 17 – Год поступления;
	// 0001 – Индивидуальный номер авто. Нумерация обновляется с 1 числа каждого года.
	
	// 	Коды типов поступления:
	// A – Trade-in (АП на НА);
	// B – Внутренний Trade-in (АП на АП);
	// C – Выкуп;
	// D – Комиссия;
	// E – Обратный выкуп;
	// F – Трансфер (внутри холдинга);
	// G – Юр. лица (Лизинговые компании, банки, аукционы и др.);
	// H – Корпоративные клиенты;
	// I – Другое

	КодАвтомобиляВыкупа = "";
	
	Если ТипОперации = Перечисления.Renault_ТипыОперацийТрейдИн.TradeIn Тогда 
		КодАвтомобиляВыкупа = КодАвтомобиляВыкупа + "A";
	ИначеЕсли ТипОперации = Перечисления.Renault_ТипыОперацийТрейдИн.Выкуп Тогда
		КодАвтомобиляВыкупа = КодАвтомобиляВыкупа + "C"; 
	ИначеЕсли ТипОперации = Перечисления.Renault_ТипыОперацийТрейдИн.Комиссия Тогда
		КодАвтомобиляВыкупа = КодАвтомобиляВыкупа + "D";
	Иначе
		Возврат;
	КонецЕсли; 
	
	КодАвтомобиляВыкупа = КодАвтомобиляВыкупа + Прав(BIR, 4);
	КодАвтомобиляВыкупа = КодАвтомобиляВыкупа + ?(Месяц(ДатаПоступления) < 10, "0" + Строка(Месяц(ДатаПоступления)), Строка(Месяц(ДатаПоступления)));
	КодАвтомобиляВыкупа = КодАвтомобиляВыкупа + Прав(Строка(Год(ДатаПоступления)), 2);
	
	//Определим последний введенный номер в пределах года выкупа по BIR
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ПОДСТРОКА(ВложенныйЗапрос.ПорядковыйНомер, 10, 4)) КАК ПорядковыйНомер
	|ИЗ
	|	(ВЫБРАТЬ
	|		CRM_ДополнительнаяИнформацияПоАвтомобилям.КодАвтомобиляВыкупа КАК ПорядковыйНомер
	|	ИЗ
	|		РегистрСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям КАК CRM_ДополнительнаяИнформацияПоАвтомобилям
	|	ГДЕ
	|		ПОДСТРОКА(CRM_ДополнительнаяИнформацияПоАвтомобилям.КодАвтомобиляВыкупа, 2, 4) = &BIR
	|		И ПОДСТРОКА(CRM_ДополнительнаяИнформацияПоАвтомобилям.КодАвтомобиляВыкупа, 8, 2) = &ГодВыкупа) КАК ВложенныйЗапрос";
	
	Запрос.УстановитьПараметр("BIR", Прав(BIR, 4));
	Запрос.УстановитьПараметр("ГодВыкупа", Прав(Строка(Год(ДатаПоступления)), 2));
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() И РезультатЗапроса.ПорядковыйНомер <> Неопределено И РезультатЗапроса.ПорядковыйНомер <> Null Тогда
		ПорядковыйНомер = РезультатЗапроса.ПорядковыйНомер;
		ПорядковыйНомер = Строка(Число(ПорядковыйНомер) + 1);
		КодАвтомобиляВыкупа = КодАвтомобиляВыкупа + Прав("0000"+ПорядковыйНомер,4);
	Иначе
		КодАвтомобиляВыкупа = КодАвтомобиляВыкупа + "0001"; //Если это новый
	КонецЕсли;
	
	ДопИнфо = РегистрыСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям.СоздатьМенеджерЗаписи();
	ДопИнфо.Автомобиль = Автомобиль;
	ДопИнфо.Прочитать();
	ДопИнфо.Автомобиль = Автомобиль;
	ДопИнфо.КодАвтомобиляВыкупа = КодАвтомобиляВыкупа;
	ДопИнфо.ДилерскийЦентр = ЗаявкаНаТрейдИн.ДилерскийЦентр;
	ДопИнфо.Записать();
	
КонецПроцедуры // КодифицироватьАвтомобиль()

// Возвращает структуру заявок по рабочему листу
//
// Параметры:
//  РабочийЛист	 - Число	 - IDK рабочего листа
// 
// Возвращаемое значение:
//  Структура - Структура заявок, с полями
//		* ЗаявкаНаГарантию
//		* ЗаявкаНаСтраховкуОсаго
//		* ЗаявкаНаСтраховкуКаско
//		* ЗаявкаНаТрейдИн
//		* ЗаявкаНаКредит
//		
&НаСервереБезКонтекста
Функция ПолучитьЗаявкиПоРабочемуЛисту(РабочийЛист)
	
	ЗаявкиРабочегоЛиста = Новый Структура("ЗаявкаНаГарантию, ЗаявкаНаСтраховкуОсаго, ЗаявкаНаСтраховкуКаско, ЗаявкаНаТрейдИн, ЗаявкаНаКредит");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Renault_CRM_ЗаявкаНаГарантию.Ссылка КАК ЗаявкаНаГарантию,
	|	ВЫБОР
	|		КОГДА Renault_CRM_ЗаявкаНаГарантию.ВыполненаУспешно
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПриоритетСортировки
	|ИЗ
	|	Документ.Renault_CRM_ЗаявкаНаГарантию КАК Renault_CRM_ЗаявкаНаГарантию
	|ГДЕ
	|	НЕ Renault_CRM_ЗаявкаНаГарантию.ПометкаУдаления
	|	И Renault_CRM_ЗаявкаНаГарантию.РабочийЛист = &РабочийЛист
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПриоритетСортировки УБЫВ
	|;
	|"+?(Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ИспользоватьСтарыйФункционалКСО,"
	|ВЫБРАТЬ
	|	Ссылка ЗаявкаНаКредит,
	|	Выбор Когда Статус=ЗНАЧЕНИЕ(Перечисление.Renault_CRM_СтатусЗаявокНаКредит.Выполнена) Тогда 1 Иначе 0 Конец ПриоритетСортировки 
	|ИЗ Документ.Renault_CRM_ЗаявкаНаКредит
	|ГДЕ НЕ ПометкаУдаления И РабочийЛист=&РабочийЛист
	|УПОРЯДОЧИТЬ ПО ПриоритетСортировки УБЫВ		
	|;","
	|ВЫБРАТЬ
	|	Ссылка ЗаявкаНаКредит,
	|	Выбор Когда Состояние=ЗНАЧЕНИЕ(Перечисление.Renault_CRM_СтатусЗаявокНаКредит.Выполнена) Тогда 1 Иначе 0 Конец ПриоритетСортировки 
	|ИЗ Документ.Renault_РабочийЛистОФУ
	|ГДЕ НЕ ПометкаУдаления И РабочийЛист=&РабочийЛист
	|УПОРЯДОЧИТЬ ПО ПриоритетСортировки УБЫВ		
	|;")+"

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Renault_ЗаявкаНаТрейдИн.Ссылка КАК ЗаявкаНаТрейдИн
	|ИЗ
	|	Документ.Renault_ЗаявкаНаТрейдИн КАК Renault_ЗаявкаНаТрейдИн
	|ГДЕ
	|	НЕ Renault_ЗаявкаНаТрейдИн.ПометкаУдаления
	|	И Renault_ЗаявкаНаТрейдИн.РабочийЛист В
	|			(ВЫБРАТЬ
	|				Renault_РабочиеЛисты.СвязаныйIDK
	|			ИЗ
	|				РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	|			ГДЕ
	|				Renault_РабочиеЛисты.IDK = &РабочийЛист)
	|	И Renault_ЗаявкаНаТрейдИн.РабочийЛист > 0";	
	Запрос.УстановитьПараметр("РабочийЛист", РабочийЛист); 	
	Результат = Запрос.ВыполнитьПакет();
	
	//Заявка на гарантию
	Если НЕ Результат[0].Пустой() Тогда
		Выборка = Результат[0].Выбрать();		
		Выборка.Следующий();
		
		ЗаявкиРабочегоЛиста.Вставить("ЗаявкаНаГарантию", Выборка.ЗаявкаНаГарантию);		
	КонецЕсли;
	
	//Заявка на кредит
	Если НЕ Результат[1].Пустой() Тогда
		Выборка = Результат[1].Выбрать();		
		Выборка.Следующий();
		
		ЗаявкиРабочегоЛиста.Вставить("ЗаявкаНаКредит", Выборка.ЗаявкаНаКредит);		
	КонецЕсли;
	
	//Заявка на трейд-ин
	Если НЕ Результат[2].Пустой() Тогда
		Выборка = Результат[2].Выбрать();		
		Выборка.Следующий();
		
		ЗаявкиРабочегоЛиста.Вставить("ЗаявкаНаТрейдИн", Выборка.ЗаявкаНаТрейдИн);		
	КонецЕсли;
	
	Возврат ЗаявкиРабочегоЛиста;
	
КонецФункции // ПолучитьЗаявкиПоРабочемуЛисту()

// Возвращает коммерческое предложение по рабочему листу, не равное переданному
//
// Параметры:
//  СсылкаКП - ДокументСсылка.CRM_КоммерческоеПредложение	 -  Заменяемое коммерческое предложение
// 
// Возвращаемое значение:
//  ДокументСсылка.CRM_КоммерческоеПредложение - Заменяющее коммерческое предложение
//
&НаСервере
Функция ЗаменитьКП(СсылкаКП)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_КоммерческоеПредложение.Ссылка
	|ИЗ
	|	Документ.CRM_КоммерческоеПредложение КАК CRM_КоммерческоеПредложение
	|ГДЕ
	|	CRM_КоммерческоеПредложение.РабочийЛист = &РабочийЛист
	|	И CRM_КоммерческоеПредложение.ПометкаУдаления = ЛОЖЬ
	|	И НЕ CRM_КоммерческоеПредложение.Ссылка = &СсылкаКП
	|УПОРЯДОЧИТЬ ПО
	|	CRM_КоммерческоеПредложение.Дата УБЫВ";
	Запрос.УстановитьПараметр("РабочийЛист", Объект.IDK);
	Запрос.УстановитьПараметр("СсылкаКП", СсылкаКП);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // ЗаменитьКП()

// Записывает данные клиента
//
&НаКлиенте
Процедура СохранитьДанныеКлиента()
	
	КлиентОбъект = Объект.Клиент.ПолучитьОбъект();
	CRM_Сервер.РазбитьФИО(Клиент_ФИО, КлиентОбъект.Фамилия, КлиентОбъект.Имя, КлиентОбъект.Отчество);
	КлиентОбъект.Наименование = Клиент_ФИО;
	КлиентОбъект.НаименованиеПолное = Клиент_ФИО;
	КлиентОбъект.Записать();
	
	ОбновитьВоронкуИСписки();
	Оповестить("ОбновитьРабСтолМенеджера");
	Модифицированность = Ложь;
	
КонецПроцедуры // СохранитьДанныеКлиента()

// Проверяет дубли контрагентов
//
// Параметры:
//  НовыйКонтрагент	 - СправочникСсылка.Контрагенты	 - Контрагент после проверки на дубли
//
&НаСервере
Процедура ЗаменитьКонтрагента(НовыйКонтрагент)

	Если ЗначениеЗаполнено(Объект.Клиент) И ТипЗнч(Объект.Клиент) = Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты") Тогда		
		// { DMSREN-669 Болдарев Д.Е. от 30.03.2020 
		// В процедуре CRM_Редубликация.ПроизвестиЗаменуКлиентов() будет прочитан из базы и записан текущий документ.
		// Чтобы не потерять текущие изменения, запишем данные сейчас
		Попытка
			Записать();			
		Исключение
		    ТекстОшибки = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("ДокументРабочийЛист.ЗаменитьКонтрагента", УровеньЖурналаРегистрации.Ошибка, 
				Метаданные.Документы.Renault_РабочийЛист, Объект.Ссылка, ТекстОшибки);
		КонецПопытки;
		// } DMSREN-669 Болдарев Д.Е. от 30.03.2020. 
		
		МассивИсключаемыхОбъектов = Новый Массив;
		CRM_Редубликация.ПроизвестиЗаменуКлиентов(Объект.Клиент, НовыйКонтрагент,, МассивИсключаемыхОбъектов);
		
		// { DMSREN-669 Болдарев Д.Е. от 30.03.2020 
		// После того, как из общего модуля перезаписали объект текущего документа, различаются версии данных
		// объекта БД и данных в форме. Нужно их синхронизировать
		Попытка
			ДокОбъект = Объект.Ссылка.ПолучитьОбъект();
			ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
		Исключение
		    ТекстОшибки = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("ДокументРабочийЛист.ЗаменитьКонтрагента", УровеньЖурналаРегистрации.Ошибка, 
				Метаданные.Документы.Renault_РабочийЛист, Объект.Ссылка, ТекстОшибки);
		КонецПопытки; 
		// } DMSREN-669 Болдарев Д.Е. от 30.03.2020. 	
	КонецЕсли;
		
	Если ЗначениеЗаполнено(НовыйКонтрагент) Тогда
		Объект.Клиент = НовыйКонтрагент;
	КонецЕсли;
	
КонецПроцедуры // ЗаменитьКонтрагента()

// Обработка оповещения при выборе согласия на обработку персональных данных
//
&НаКлиенте
Процедура ЗавершениеРедактированияПД(Результат, ДополнительныеПараметры) Экспорт 
	
	СогласиеНаОПД(); 
	
КонецПроцедуры // ЗавершениеРедактированияПД()

// Записывает данные корпоративного клиента
//
&НаКлиенте
Процедура ОбновитьДанныеКорпКлиента()
			
	КорпКлиентОбъект = КорпКлиент.ПолучитьОбъект();
	
	СтрокаСферыДеятельности = КорпКлиентОбъект.СферыДеятельности[0];
	СтрокаСферыДеятельности.СфераДеятельности = Клиент_СфераДеятельности;

	СтрокаАвтопарк            = КорпКлиентОбъект.Автопарк[0];
	СтрокаАвтопарк.Марка      = Клиент_АвтопаркМарка;
	СтрокаАвтопарк.Модель     = Клиент_АвтопаркМодель;
    СтрокаАвтопарк.Количество = Клиент_АвтопаркКоличество;

	КорпКлиентОбъект.Записать();		

КонецПроцедуры // ОбновитьДанныеКорпКлиента()

&НаКлиенте
Процедура Клиент_АвтопаркКоличествоНачалоВыбора(Команда)
	
	ВвестиЧисловойЭлемент(Команда);
	Клиент_АвтопаркПриИзменении(Неопределено);
	
КонецПроцедуры // Клиент_АвтопаркКоличествоНачалоВыбора()

// Обработчик события "ПриИзменении" года выпуска трейд-ин
//
&НаКлиенте
Процедура ПриИзмененииДатыВыпуска()
	
	Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн) Тогда
		ЗаявкаНаТрейдИнОбъект = ЗаявкаНаТрейдИн.ПолучитьОбъект();
	Иначе
		Сообщить("Необходимо создать заявку на трейд-ин!");
		Возврат;
	КонецЕсли;
		
	ЗаявкаНаТрейдИнОбъект.ГодВыпуска = ГодВыпускаТрейдИн;
	ЗаявкаНаТрейдИнОбъект.МодельКод = "";
	ЗаявкаНаТрейдИнОбъект.ТипКузоваКод = "";
	ЗаявкаНаТрейдИнОбъект.ДвигательКод = "";
	ЗаявкаНаТрейдИнОбъект.КППКод = "";
	ЗаявкаНаТрейдИнОбъект.МодификацияКод = "";
	ЗаявкаНаТрейдИнОбъект.Опции.Очистить();
	ЗаявкаНаТрейдИнОбъект.ОриентировочнаяЦена = 0;  
	ЗаявкаНаТрейдИнОбъект.ОжиданиеСтоимостиКлиента = 0;
	ЗаявкаНаТрейдИнОбъект.Автомобиль = ПредопределенноеЗначение("Справочник.Автомобили.ПустаяСсылка");
	ЗаявкаНаТрейдИнОбъект.Цвет = ""; 
	ЗаявкаНаТрейдИнОбъект.VIN = "";
	ЗаявкаНаТрейдИнОбъект.ГосНомер = "";
	ЗаявкаНаТрейдИнОбъект.СрокДействия = "";
	ЗаявкаНаТрейдИнОбъект.ОценкаСостояния = ""; 
	ЗаявкаНаТрейдИнОбъект.Пробег = "";
	ЗаявкаНаТрейдИнОбъект.КоличествоВладельцевПоПТС = "";
	ЗаявкаНаТрейдИнОбъект.СостояниеШин = "";
	ЗаявкаНаТрейдИнОбъект.НаличиеАварий = Ложь;
	ЗаявкаНаТрейдИнОбъект.ОригиналПТС = Ложь;
	ЗаявкаНаТрейдИнОбъект.Металик = Ложь;
	ЗаявкаНаТрейдИнОбъект.Записать();
		
	МодельТрейдИн = "";
	ОжидаемаяСтоимостьКлиентаТрейдИн = 0;
	
	Значение = ЗначениеЗаполнено(ГодВыпускаТрейдИн);
	Если Значение Тогда
		ЗаполнитьСписокВыбораЭлемента("МодельТрейдИн");	
	КонецЕсли;
	
	ПараметрыУправленияЭлементами = Новый Структура();
	ПараметрыУправленияЭлементами.Вставить("МодельТрейдИн",								Значение);
	ПараметрыУправленияЭлементами.Вставить("ВыбратьМодельТрейдИн", 						Значение);
	ПараметрыУправленияЭлементами.Вставить("ОжидаемаяСтоимостьКлиентаТрейдИн", 			ЗначениеЗаполнено(МодельТрейдИн));
	ПараметрыУправленияЭлементами.Вставить("ВвестиОжидаемаяСтоимостьКлиентаТрейдИн", 	ЗначениеЗаполнено(МодельТрейдИн));

	ОбновитьИнтерфейсТрейдИн(ПараметрыУправленияЭлементами);
	
КонецПроцедуры // ПриИзмененииДатыВыпуска()

// Записывает источник информации в РС "CRM_КлиентскиеДанные"
//
&НаКлиенте
Процедура СохранитьИсточникИнформации()
	
	ЗаписьКлиентскиеДанные = РегистрыСведений.CRM_КлиентскиеДанные.СоздатьМенеджерЗаписи();
	ЗаписьКлиентскиеДанные.Клиент = Объект.Клиент;
	ЗаписьКлиентскиеДанные.Прочитать();
	
	Если Не ЗаписьКлиентскиеДанные.Выбран() Тогда
		ЗаписьКлиентскиеДанные.Клиент = Объект.Клиент;
	КонецЕсли;
	
	ЗаписьКлиентскиеДанные.ИсточникИнформации = Клиент_ИсточникИнформации;
	ЗаписьКлиентскиеДанные.Записать();
	
КонецПроцедуры // СохранитьИсточникИнформации()

// Записывает город клиента в РС "CRM_КлиентскиеДанные"
//
&НаКлиенте
Процедура СохранитьГород()
	
	ЗаписьКлиентскиеДанные = РегистрыСведений.CRM_КлиентскиеДанные.СоздатьМенеджерЗаписи();
	ЗаписьКлиентскиеДанные.Клиент = Объект.Клиент;
	ЗаписьКлиентскиеДанные.Прочитать();
	
	Если Не ЗаписьКлиентскиеДанные.Выбран() Тогда
		ЗаписьКлиентскиеДанные.Клиент = Объект.Клиент;
	КонецЕсли;
	
	ЗаписьКлиентскиеДанные.Город = Клиент_Город;
	ЗаписьКлиентскиеДанные.Записать();
	
КонецПроцедуры // СохранитьГород()

// Устанавливает признак основного коммерческого предложения
//
// Параметры:
//  КП		 - 	СправочникСсылка.CRM_КонфигурацииАвтомобилей - Текущее коммерческое предложение
//  Основное - 	Булево - Признак основного коммерческого предложения
//
&НаСервере
Процедура УстановитьОсновноеКП(КП, Основное = Ложь)
	
	КПОбъект = КП.ПолучитьОбъект();
	КПОбъект.Основное = Основное;
	КПОбъект.Записать();
	
	Если Основное Тогда
		
		Для Каждого Строка Из ТаблицаКП Цикл
			
			Если Строка.Ссылка = КП Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			КПОбъект = Строка.Ссылка.ПолучитьОбъект();
			КПОбъект.Основное = Ложь;
			КПОбъект.Записать();
			
		КонецЦикла;
		
	КонецЕсли;

	НаборЗаписей = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	НаборЗаписей.IDK = Объект.IDK;
	НаборЗаписей.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.КоммерческоеПредложение;
	НаборЗаписей.Прочитать();

	Если НаборЗаписей.Выбран() И ЗначениеЗаполнено(НаборЗаписей.Объект) Тогда
		 НаборЗаписей.Объект = КП;
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
	ОбновитьСписокКП();
	
КонецПроцедуры // УстановитьОсновноеКП()

// Устанавливает доступность реквизитов корпоративного клиента
//
// Параметры:
//  ЗапретитьРедактирование	 - Булево	 - Признак запрета редактирования реквизитов
//
&НаКлиенте
Процедура УстановитьДоступностьРеквизитовКорпКлиента(ЗапретитьРедактирование)
	
	Элементы.Клиент_Корпоративный.ТолькоПросмотр                  	= ЗапретитьРедактирование;
	Элементы.ГруппаСтраницаСфераДеятельностиАвтопарк.ТолькоПросмотр = ЗапретитьРедактирование;
	Элементы.Клиент_АвтопаркМарка.ТолькоПросмотр                  	= ЗапретитьРедактирование;
	Элементы.Клиент_АвтопаркМодель.ТолькоПросмотр                 	= ЗапретитьРедактирование;
	Элементы.Клиент_АвтопаркКоличество.ТолькоПросмотр             	= ЗапретитьРедактирование; 
	
КонецПроцедуры // УстановитьДоступностьРеквизитовКорпКлиента()

// Проверяет правильность ввода ИНН
//
// Параметры:
//  ПроверяемыйИНН	 - Строка	 - ИНН для проверки
// 
// Возвращаемое значение:
//  Строка - Описание ошибки
//
&НаКлиенте
Функция ПроверкаИНН(ПроверяемыйИНН) Экспорт
	
	ПровИНН = СокрЛП(ПроверяемыйИНН);
	ДлинаИНН = СтрДлина(ПровИНН);
	
	// Проверка длины ИНН
	Если ДлинаИНН < 10 Тогда
		Возврат "ИНН не должен быть меньше 10-ти цифр";
	КонецЕсли;
	
	// Проверка ключа ИНН - сначала составим матрицу простых чисел,
	// потом проверим ключ для разной длины
	КодКонст = Новый Массив;
	КодКонст.Добавить(41);
	КодКонст.Добавить(37);
	КодКонст.Добавить(31);
	КодКонст.Добавить(29);
	КодКонст.Добавить(23);
	КодКонст.Добавить(19);
	КодКонст.Добавить(17);
	КодКонст.Добавить(13);
	КодКонст.Добавить(7);
	КодКонст.Добавить(5);
	КодКонст.Добавить(3);
	
	НСум = 0;
	Если ДлинаИНН = 10 Тогда
		// Для ИНН 10 знаков
		Для Сч = 1 По 9 Цикл
			НСум = НСум + Число(Сред(ПровИНН, Сч, 1)) * КодКонст[Сч + 1];
		КонецЦикла;
		//----------------------------------------------- 
		ННов = 11 - (НСум - (Цел(НСум / 11) * 11)); 
		КНов = Сред(ПровИНН, 1, 9) + ?(ННов < 10, Строка(ННов), "0");
		Если КНов = ПровИНН Тогда
			Возврат "";
		КонецЕсли;
		
	ИначеЕсли ДлинаИНН = 11 Тогда
		// Для ИНН 11 знаков
		КНов = "1" + Сред(ПровИНН, 2, 9);
		ПровИНН = ВРег(ПровИНН);
		Для Сч = 1 По 10 Цикл
			НСум = НСум + Число(Сред(КНов,Сч,1)) * КодКонст[Сч];
		КонецЦикла;
		//----------------------------------------------- 
		ННов = 11 - (НСум - (Цел(НСум/11)*11));
		КНов = "F" + Сред(КНов, 2, 9) + ?(ННов < 10, Строка(ННов), "0");
		Если КНов = ПровИНН Тогда
			Возврат "";
		КонецЕсли;
		
	ИначеЕсли ДлинаИНН = 12 Тогда
		// Для 12 знаков
		Если Число(ПровИНН) * Число(Сред(ПровИНН, 5, 6)) = 0 Тогда
			Возврат "Неправильный ИНН - ошибка ключа";
		КонецЕсли;
		//----------------------------------------------- 
		Для Сч = 1 По 10 Цикл
			НСум = НСум + Число(Сред(ПровИНН, Сч, 1)) * КодКонст[Сч];
		КонецЦикла;
		ННов = 11 - (НСум - (Цел(НСум / 11) * 11));
		КНов = Сред(ПровИНН, 1, 10) + ?(ННов < 10, Строка(ННов), "0");
		НСум = 0;
		//----------------------------------------------- 
		Для Сч = 1 По 11 Цикл
			НСум = НСум + Число(Сред(ПровИНН, Сч, 1)) * КодКонст[Сч - 1];
		КонецЦикла;
		ННов = 11-(НСум - (Цел(НСум / 11) * 11));
		КНов = ?(ННов < 10,КНов+Строка(ННов), КНов + "0");
		Если КНов = ПровИНН Тогда
			Возврат "";
		КонецЕсли;
	КонецЕсли;
	
	Возврат "Неправильный ИНН - ошибка ключа";
	
КонецФункции // ПроверкаИНН()

// Процедура загружает данные корпоративного клиента,
//		полученного с базы Хранилище справочников
//
&НаКлиенте
Процедура ЗагрузитьКорпоративногоКлиента(ДанныеКлиента)
	
	//Создание-обновление данных клиента
	КонтрагентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
	КлиентОбъект = Справочники.Renault_КорпоративныеКлиенты.СоздатьЭлемент();
	СсылкаКлиента = Справочники.Renault_КорпоративныеКлиенты.ПолучитьСсылку(ДанныеКлиента.Идентификатор);
	КлиентОбъект.УстановитьСсылкуНового(СсылкаКлиента);
	
	КлиентОбъект.Наименование = ДанныеКлиента.Наименование;
	Если ДанныеКлиента.Состояние = "Согласован" Тогда
		Состояние = Перечисления.Renault_СостоянияСогласованияКлиента.Согласован;
	ИначеЕсли ДанныеКлиента.Состояние = "На согласовании" Тогда
		Состояние = Перечисления.Renault_СостоянияСогласованияКлиента.НаСогласовании;
	ИначеЕсли ДанныеКлиента.Состояние = "Не согласован" Тогда
		Состояние = Перечисления.Renault_СостоянияСогласованияКлиента.НеСогласован;
	Иначе
		Состояние = "";
	КонецЕсли;
	
	КлиентОбъект.Состояние = Перечисления.Renault_СостоянияСогласованияКлиента.Черновик;
	КлиентОбъект.ИдЗаявки = ДанныеКлиента.ИдЗаявки;
	КлиентОбъект.Идентификатор = ДанныеКлиента.Идентификатор;
	КонтрагентОбъект.Наименование = ДанныеКлиента.Наименование;
	КонтрагентОбъект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель;
	КонтрагентОбъект.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо;
	КонтрагентОбъект.НаименованиеПолное = ДанныеКлиента.НаименованиеПолное;
	КонтрагентОбъект.ИНН = Клиент_ИНН;
	
	Попытка
		КонтрагентОбъект.Записать();
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	КлиентОбъект.Контрагент = КонтрагентОбъект.Ссылка;
	
	Попытка
		КлиентОбъект.Записать();
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	КонтрагентПоиск = КонтрагентОбъект.Ссылка;
	
КонецПроцедуры // ЗагрузитьКорпоративногоКлиента()

&НаКлиенте
Процедура РазблокироватьРЛ() Экспорт
	
	ТолькоПросмотр = Ложь;
	Элементы.ТаблицаКП.Доступность = Истина;
	МассивИменБезБлока = Новый Массив();
	
	МассивИменБезБлока.Добавить("СводныйОтчет");
	МассивИменБезБлока.Добавить("Закрыть");
	МассивИменБезБлока.Добавить("кнОбновитьКоммерческиеПредложения");
	МассивИменБезБлока.Добавить("кнОбновитьСписокСобытий");
	МассивИменБезБлока.Добавить("ТаблоКоментарии");     
	МассивИменБезБлока.Добавить("ДиалогКомментария");
	МассивИменБезБлока.Добавить("кнВводКомментарияОК");
	МассивИменБезБлока.Добавить("кнВводКомментарияОтмена");
	
	Для Каждого Элем Из Элементы Цикл
		Если ТипЗнч(Элем) = Тип("Кнопка") Тогда
			Если МассивИменБезБлока.Найти(Элем.Имя)= Неопределено Тогда
				Элем.Доступность = Истина;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Элем) = Тип("ТабличноеПоле")Тогда
			Если МассивИменБезБлока.Найти(Элем.Имя)= Неопределено Тогда
				Элем.Доступность = Истина;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Элем) = Тип("ПолеТабличногоДокумента")Тогда
			Если МассивИменБезБлока.Найти(Элем.Имя)= Неопределено Тогда
				Элем.Доступность = Истина;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Элем) = Тип("ПолеВвода")Тогда
			Если МассивИменБезБлока.Найти(Элем.Имя)= Неопределено Тогда
				Элем.Доступность = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаVIN (Результат, Параметры) Экспорт
//DMSREN-715 
    Если Результат = КодВозвратаДиалога.Да Тогда
        Оповещение = Новый ОписаниеОповещения("ПослеВводаVIN", ЭтотОбъект);	
 
    ПоказатьВводСтроки(
        Оповещение,
        ,"Введите VIN",17,Ложь    );  
    КонецЕсли;	
 //DMSREN-715
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаVIN(Строка, Параметры) Экспорт
//DMSREN-715 
    Если Не Строка = Неопределено Тогда
        ТаблицаОТС = Renault_АвтосервисСервер.Renault_ОбработатьОТС(Строка);
		Если ТаблицаОТС.Количество()>0 тогда
			Для Каждого СтрокаТЗ из ТаблицаОТС Цикл
				Предупреждение(Строка("По автомобилю с VIN: "+Строка+"Отзывная компания:" + СтрокаТЗ.НаименованиеОТС +Символы.ПС + "
				| Номер технической ноты: " +Строка(СтрокаТЗ.НомерТехническойНоты)),10,"По данному автомобилю, есть отзывные компании!");
			КонецЦикла;
		КонецЕсли;
    КонецЕсли;
//DMSREN-715 
КонецПроцедуры

#КонецОбласти

#Область Воронка

// Обновляет цвета кнопок страницы "ГруппаСтраницаВоронка"
//
&НаСервере
Процедура ОбновитьЦветаВоронки()
	
	Воронка_ОбновитьВзятТелефон();
	Воронка_ОбновитьВзятEmail();
	Воронка_ОбновитьПосещениеАвтосалона();
	Воронка_ОбновитьПрезентацияАвтомобиля();
	Воронка_ОбновитьТестДрайв();
	Воронка_ОбновитьКоммерческоеПредложение();
	Воронка_ОбновитьДопОборудование();
	Воронка_ОбновитьПродленнуюГарантию();
	Воронка_ОбновитьТрейдИн();
	Воронка_ОбновитьСтраховку();
	Воронка_ОбновитьКредит();
	Воронка_ОбновитьMYRenault();
	Воронка_ОбновитьКонтракт();
	Воронка_ОбновитьДКП();
	Воронка_ОбновитьВыдачу();
	Воронка_ОбновитьРасторжениеПредварительногоКонтракта();
	Воронка_ОбновитьРасторжениеДКП();
	Воронка_ОбновитьЗвонокВежливости3();
	Воронка_ОбновитьЗвонокВежливости30();
	Воронка_ОбновитьЗвонокВежливости360();
	Воронка_ОбновитьЗвонокВежливостиДР();
	Воронка_ОбновитьРегистрациюКлиентаВБазеРеноРоссия();
	
КонецПроцедуры // ОбновитьЦветаВоронки()

// Обновляет цвета кнопок страницы "ГруппаСтраницаВоронка" для типа рабочего листа "Трейд-Ин"
//
&НаСервере
Процедура ОбновитьЦветаВоронкиТрейдИн()
	
	Воронка_ОбновитьВзятТелефон(Истина);	
	Воронка_ОбновитьВзятEmail(Истина);
	Воронка_ОбновитьПосещениеАвтосалона(Истина);
	Воронка_ОбновитьЗаполнениеДанныхАвтомобиляТрейдИн();
	Воронка_ОбновитьПредварительнаяОценка();
	Воронка_ОбновитьВизуальныйОсмотр();
	Воронка_ОбновитьОценкаСервисом();
	Воронка_ОбновитьПроверкаЮридическойЧистоты();
	Воронка_ОбновитьКалькуляцию();
	Воронка_ОбновитьПредложениеВыкупа();
	Воронка_ОбновитьДоговорСКлиентом();
	
КонецПроцедуры // ОбновитьЦветаВоронкиТрейдИн()

&НаСервере
Процедура Воронка_ОбновитьВзятТелефон(ЭтоТрейдИн = Ложь)
	
	Если ЭтоТрейдИн Тогда
		ИмяЭлемента = "ВзятТелефонТрейдИн";
	Иначе
		ИмяЭлемента = "ВзятТелефон";
	КонецЕсли;	
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK 			= Объект.IDK;
	Запись.ЭтапПродаж 	= Справочники.CRM_ЭтапыПродаж.НаличиеТелефона;
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		//Было посещение
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		Элементы[ИмяЭлемента].ЦветФона = ЦветRenault2;
		Телефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(Объект.Клиент);
		Телефон = Renault_УправлениеКонтактнойИнформацией.НормализацияНомераТелефона(Телефон, Объект.ДилерскийЦентр);
		Элементы[ИмяЭлемента].Заголовок = ?(Телефон = "", "Телефон (" + ТекстДата + ")", "Тел: " + Строка(Телефон));
	Иначе
		//Не было посещения
		Элементы[ИмяЭлемента].ЦветФона = ЦветКнопкиВоронкиСерый;
		Телефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(Объект.Клиент);
		Телефон = Renault_УправлениеКонтактнойИнформацией.НормализацияНомераТелефона(Телефон, Объект.ДилерскийЦентр);
		Элементы[ИмяЭлемента].Заголовок = ?(Телефон = "", "Телефон", "Тел: " + Строка(Телефон));
	КонецЕсли;
	
КонецПроцедуры // Воронка_ОбновитьВзятТелефон()

&НаСервере
Процедура Воронка_ОбновитьВзятEmail(ЭтоТрейдИн = Ложь)
	
	Если ЭтоТрейдИн Тогда
		ИмяЭлемента = "ВзятEmailТрейдИн";
	Иначе
		ИмяЭлемента = "ВзятEmail";
	КонецЕсли;	
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.НаличиеEmail;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Было посещение
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		Элементы[ИмяЭлемента].ЦветФона = ЦветRenault2;
		Email = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(Объект.Клиент);
		Элементы[ИмяЭлемента].Заголовок = ?(Email = "", "Email (" + ТекстДата + ")", "e-mail: "+ Строка(Email));
	Иначе
		//Не было посещения
		Элементы[ИмяЭлемента].ЦветФона = ЦветКнопкиВоронкиСерый;
		Email = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(Объект.Клиент);
		Элементы[ИмяЭлемента].Заголовок = ?(Email = "", "Email", "e-mail: "+ Строка(Email));
	КонецЕсли;
	
КонецПроцедуры // Воронка_ОбновитьВзятEmail()

&НаСервере
Процедура Воронка_ОбновитьПосещениеАвтосалона(ЭтоТрейдИн = Ложь)
	
	Если ЭтоТрейдИн Тогда
		ИмяЭлемента = "ПосещениеАвтосалонаТрейдИн";
	Иначе
		ИмяЭлемента = "ПосещениеАвтосалона";
	КонецЕсли;	
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ПосещениеАвтосалона;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Было посещение
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		Элементы[ИмяЭлемента].ЦветФона = ЦветRenault2;
		Элементы[ИмяЭлемента].Заголовок = "Посещение автосалона (" + ТекстДата + ")";
		Элементы[ИмяЭлемента].Картинка = ИзображениеСобытиеВыполнено; 
	Иначе
		//Не было посещения
		//Проверим наличие напоминания
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	CRM_СобытияПоРабочимЛистам.Ссылка,
		|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания
		|ИЗ
		|	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
		|ГДЕ
		|	CRM_СобытияПоРабочимЛистам.IDK = &IDK
		|	И CRM_СобытияПоРабочимЛистам.ВидСобытия = &ВидСобытия
		|	И CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания";
		Запрос.УстановитьПараметр("IDK", Объект.IDK);
		Запрос.УстановитьПараметр("ВидСобытия", Справочники.CRM_ВидыСобытий.Встреча);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			//Есть напоминание
			Элементы[ИмяЭлемента].ЦветФона = ЦветКнопкиВоронкиСерый;
			Элементы[ИмяЭлемента].Заголовок = "Посещение автосалона";
			Элементы[ИмяЭлемента].Картинка = ИзображениеСобытиеЗапланировано;
			Если ЗначениеЗаполнено(Выборка.ДатаНапоминания) Тогда
				ТекстДата = Формат(Выборка.ДатаНапоминания, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
				Элементы[ИмяЭлемента].Заголовок = "Посещение автосалона (" + ТекстДата + ")";
			КонецЕсли;
		Иначе
			//Нет напоминания
			Элементы[ИмяЭлемента].ЦветФона = ЦветКнопкиВоронкиСерый;
			Элементы[ИмяЭлемента].Заголовок = "Посещение автосалона";
			Элементы[ИмяЭлемента].Картинка = ИзображениеПустое;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // Воронка_ОбновитьПосещениеАвтосалона()

&НаСервере
Процедура Воронка_ОбновитьКоммерческоеПредложение()
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.КоммерческоеПредложение;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Есть КП
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		Элементы.КоммерческоеПредложение.ЦветФона = ЦветRenault3;
		Элементы.КоммерческоеПредложение.Заголовок = "Коммерческое предложение (" + ТекстДата + ")";
	Иначе
		//Нет КП
		Элементы.КоммерческоеПредложение.ЦветФона = ЦветКнопкиВоронкиСерый;
		Элементы.КоммерческоеПредложение.Заголовок = "Коммерческое предложение";
	КонецЕсли;
	
КонецПроцедуры // Воронка_ОбновитьКоммерческоеПредложение()

&НаСервере
Процедура Воронка_ОбновитьДопОборудование()
	   
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_CRM_ЗаявкаНаСервис.СтатусПодготовкиКПродаже КАК Статус,
	|	Renault_CRM_ЗаявкаНаСервис.Ссылка
	|ИЗ
	|	Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
	|ГДЕ
	|	Renault_CRM_ЗаявкаНаСервис.ПометкаУдаления = ЛОЖЬ
	|	И Renault_CRM_ЗаявкаНаСервис.Обращение.IDK = &IDK
	|
	|УПОРЯДОЧИТЬ ПО
	|	Renault_CRM_ЗаявкаНаСервис.Дата УБЫВ";
				   
	Запрос.УстановитьПараметр("IDK", Объект.IDK);

	ТаблицаЗаявокНаДопОборудование = Запрос.Выполнить().Выгрузить();

	ЕстьЗаявкаНаДопы = ?(ТаблицаЗаявокНаДопОборудование.Количество()=0, Ложь, Истина);
	
	Если Не ЕстьЗаявкаНаДопы Тогда
		Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
		Запись.IDK = Объект.IDK;
		Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ИнтересовалсяОборудованием;
		Запись.Прочитать();
		ЕстьИнтересКДопам = Запись.Выбран();
	Иначе
		ЕстьИнтересКДопам = Ложь;
	КонецЕсли;
	
	Если ЕстьЗаявкаНаДопы Тогда
		СтатусПоследнейЗаявки = ТаблицаЗаявокНаДопОборудование[0].Статус;		
		Элементы.ДополнительноеОборудование.ЦветФона = ЦветRenault3;
		Элементы.ДополнительноеОборудование.Заголовок = "Доп. опции"+Символы.ПС + " ("+СтатусПоследнейЗаявки+")";
	ИначеЕсли ЕстьИнтересКДопам Тогда
		//Есть ДО в КП
		Элементы.ДополнительноеОборудование.ЦветФона = ЦветRenault2;
		Элементы.ДополнительноеОборудование.Заголовок = "Доп. опции"+Символы.ПС + " (есть интерес)";
	Иначе
		//Нет ДО в КП
		Элементы.ДополнительноеОборудование.ЦветФона = ЦветКнопкиВоронкиСерый;
		Элементы.ДополнительноеОборудование.Заголовок = "Доп. опции";
	КонецЕсли;
	
КонецПроцедуры // Воронка_ОбновитьДопОборудование()

&НаСервере
Процедура Воронка_ОбновитьПродленнуюГарантию()
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаПрГарантию;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Есть ПГ в КП
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		Элементы.ПродленнаяГарантия.ЦветФона = ЦветRenault2;
		Элементы.ПродленнаяГарантия.Заголовок = "Продл. гарантия" + Символы.ПС + ТекстДата;
		ЗаписьВып = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
		ЗаписьВып.IDK = Объект.IDK;
		ЗаписьВып.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаПрГарантиюВыполнена;
		ЗаписьВып.Прочитать();
		Если ЗаписьВып.Выбран() Тогда
			Если ЗначениеЗаполнено(ЗаписьВып.ДатаВыполнения) Тогда
				ТекстДата = Формат(ЗаписьВып.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
			КонецЕсли;
			Элементы.ПродленнаяГарантия.ЦветФона = ЦветRenault3;
			Элементы.ПродленнаяГарантия.Заголовок = "Продл. гарантия" +Символы.ПС+ ТекстДата;
		КонецЕсли;
		
	Иначе
		
		Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
		Запись.IDK = Объект.IDK;
		Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаПрГарантиюВыполнена;
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
				ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
			КонецЕсли;
			Элементы.ПродленнаяГарантия.ЦветФона = Новый Цвет(121,181,109);
			Элементы.ПродленнаяГарантия.Заголовок = "Продл. гарантия" +Символы.ПС+ ТекстДата;
		Иначе
			//Нет ПГ в КП
			Элементы.ПродленнаяГарантия.ЦветФона = ЦветКнопкиВоронкиСерый;
			Элементы.ПродленнаяГарантия.Заголовок = "Продл. гарантия ";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // Воронка_ОбновитьПродленнуюГарантию()

&НаСервере
Процедура Воронка_ОбновитьТрейдИн()
	
	ТекстМенеджер = "";
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("РабочийЛист", Объект.СвязаныйIDK);
	Выборка = Документы.Renault_ЗаявкаНаТрейдИн.Выбрать(,, СтруктураОтбора);
	Пока Выборка.Следующий() И ЗначениеЗаполнено(Выборка.МенеджерТрейдИн) Цикл
		ТекстМенеджер = Символы.ПС + Выборка.МенеджерТрейдИн;
	КонецЦикла;
	
	Элементы.ДополнительноеОборудование.Высота 	= 2;
	Элементы.ПродленнаяГарантия.Высота 			= 2;
	Элементы.ТрейдИн.Высота 					= 2;
	Элементы.Лизинг.Высота 						= 2;
	Элементы.Кредит.Высота 						= 2;
	Элементы.Наличные.Высота 					= 2;
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.СвязаныйIDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИн;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Есть трейд-ин в КП
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		Элементы.ТрейдИн.ЦветФона = ЦветRenault2;
		Элементы.ТрейдИн.Заголовок = "Трейд-ин" +Символы.ПС+ ТекстДата + ТекстМенеджер;
		ЗаписьВып = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
		ЗаписьВып.IDK = Объект.IDK;
		ЗаписьВып.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнВыполнена;
		ЗаписьВып.Прочитать();
		Если ЗаписьВып.Выбран() Тогда
			Если ЗначениеЗаполнено(ЗаписьВып.ДатаВыполнения) Тогда
				ТекстДата = Формат(ЗаписьВып.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
			КонецЕсли;
			Элементы.ТрейдИн.ЦветФона = ЦветRenault3;
			Элементы.ТрейдИн.Заголовок = "Трейд-ин" +Символы.ПС+ ТекстДата + Символы.ПС + ТекстМенеджер;
		КонецЕсли;
		Элементы.ДополнительноеОборудование.Высота 	= 3;
		Элементы.ПродленнаяГарантия.Высота 			= 3;
		Элементы.ТрейдИн.Высота 					= 3;
		Элементы.Лизинг.Высота 						= 3;
		Элементы.Кредит.Высота 						= 3;
		Элементы.Наличные.Высота 					= 3;
	Иначе
		Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
		Запись.IDK = Объект.СвязаныйIDK;
		Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнВыполнена;
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
				ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
			КонецЕсли;
			Элементы.ТрейдИн.ЦветФона = Новый Цвет(121,181,109);
			Элементы.ТрейдИн.Заголовок = "Трейд-ин" +Символы.ПС+ ТекстДата + Символы.ПС + ТекстМенеджер;
			Элементы.ДополнительноеОборудование.Высота 	= 3;
			Элементы.ПродленнаяГарантия.Высота 			= 3;
			Элементы.ТрейдИн.Высота 					= 3;
			Элементы.Лизинг.Высота 						= 3;
			Элементы.Кредит.Высота 						= 3;
			Элементы.Наличные.Высота 					= 3;
		Иначе
			//Нет трейд-ин в КП
			Элементы.ТрейдИн.ЦветФона = ЦветКнопкиВоронкиСерый;
			Элементы.ТрейдИн.Заголовок = "Трейд-ин";
			Если Не ЗначениеЗаполнено(Объект.СвязаныйIDK) Тогда
				ЗаписьРЛ = Renault_CRM.докПолучитьЗаписьРЛПоIDK(Объект.IDK);
				Если ЗаписьРЛ<>Неопределено Тогда
					СвязаныйIDK = ЗаписьРЛ.СвязаныйIDK;
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(СвязаныйIDK) Тогда
				СтруктураОтбора = Новый Структура();
				СтруктураОтбора.Вставить("РабочийЛист", СвязаныйIDK);
				Выборка = Документы.Renault_ЗаявкаНаТрейдИн.Выбрать(,, СтруктураОтбора);
				Пока Выборка.Следующий() Цикл
	 				ТекстДата = Формат(Выборка.Ссылка.Дата, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
					Элементы.ТрейдИн.ЦветФона = ЦветRenault3;
					Элементы.ТрейдИн.Заголовок = "Трейд-ин" +Символы.ПС+ ТекстДата + Символы.ПС + ТекстМенеджер;
					Элементы.ДополнительноеОборудование.Высота 	= 3;
					Элементы.ПродленнаяГарантия.Высота 			= 3;
					Элементы.ТрейдИн.Высота 					= 3;
					Элементы.Лизинг.Высота 						= 3;
					Элементы.Кредит.Высота 						= 3;
					Элементы.Наличные.Высота 					= 3;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры // Воронка_ОбновитьТрейдИн()

&НаСервере
Процедура Воронка_ОбновитьКонтракт()
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.Контракт;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Зарегистрирован
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		Элементы.ПредварительныйКонтракт.ЦветФона = ЦветRenault2;
		Элементы.ПредварительныйКонтракт.Заголовок = "Предварительный контракт и аванс (" + ТекстДата + ")";
	Иначе
		Элементы.ПредварительныйКонтракт.ЦветФона = ЦветКнопкиВоронкиСерый;
		Элементы.ПредварительныйКонтракт.Заголовок = "Предварительный контракт и аванс"; //+ ОписаниеДоговора;
	КонецЕсли;
	
КонецПроцедуры // Воронка_ОбновитьКонтракт()

&НаСервере
Процедура Воронка_ОбновитьДКП()
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.Контракт;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Зарегистрирован
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		Элементы.ДКП.ЦветФона = ЦветRenault3;
		Элементы.ДКП.Заголовок = "Договор купли-продажи (" + ТекстДата + ")";
	Иначе
		//Не зарегистрирован
		//Узнаем статус договора, если он есть
		Элементы.ДКП.ЦветФона = ЦветКнопкиВоронкиСерый;
		Элементы.ДКП.Заголовок = "Договор купли-продажи";
	КонецЕсли;
	
КонецПроцедуры // Воронка_ОбновитьДКП()

&НаСервере
Процедура Воронка_ОбновитьРасторжениеПредварительногоКонтракта()
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.РасторжениеПредварительногоКонтракта;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Расторгнут
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		Элементы.РасторжениеПредварительногоКонтракта.ЦветФона = Новый Цвет(211,6,68);
		Элементы.РасторжениеПредварительногоКонтракта.Заголовок = "Расторжение" + ТекстДата;
	Иначе
		//Не расторгнут
		Элементы.РасторжениеПредварительногоКонтракта.ЦветФона = ЦветКнопкиВоронкиСерый;
		Элементы.РасторжениеПредварительногоКонтракта.Заголовок = "Расторжение";
	КонецЕсли;
	
КонецПроцедуры // Воронка_ОбновитьРасторжениеПредварительногоКонтракта()

&НаСервере
Процедура Воронка_ОбновитьРасторжениеДКП()
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.РасторжениеДКП;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Расторгнут
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		Элементы.РасторжениеДКП.ЦветФона = Новый Цвет(211,6,68);
		Элементы.РасторжениеДКП.Заголовок = "Расторжение" + ТекстДата;
	Иначе
		//Не расторгнут
		Элементы.РасторжениеДКП.ЦветФона = ЦветКнопкиВоронкиСерый;
		Элементы.РасторжениеДКП.Заголовок = "Расторжение";
	КонецЕсли;
	
КонецПроцедуры // Воронка_ОбновитьРасторжениеДКП()

&НаСервере
Процедура Воронка_ОбновитьВыдачу()
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ВыдачаАвтомобиля;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Была выдача
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		Элементы.ВыдачаАвтомобиля.ЦветФона = ЦветRenault3;
		Элементы.ВыдачаАвтомобиля.Заголовок = "Выдача (" + ТекстДата + ")";
		Элементы.ВыдачаАвтомобиля.Картинка = ИзображениеСобытиеВыполнено;
	Иначе
		//Не было выдачи
		//Проверим наличие напоминания
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	CRM_СобытияПоРабочимЛистам.Ссылка,
		|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания
		|ИЗ
		|	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
		|ГДЕ
		|	CRM_СобытияПоРабочимЛистам.IDK = &IDK
		|	И CRM_СобытияПоРабочимЛистам.ВидСобытия = &ВидСобытия
		|	И CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
		|	И НЕ CRM_СобытияПоРабочимЛистам.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания";
		Запрос.УстановитьПараметр("IDK", Объект.IDK);
		Запрос.УстановитьПараметр("ВидСобытия", Справочники.CRM_ВидыСобытий.Выдача);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			//Есть напоминание
			Элементы.ВыдачаАвтомобиля.ЦветФона = ЦветКнопкиВоронкиСерый;
			Элементы.ВыдачаАвтомобиля.Заголовок = "Выдача";
			Элементы.ВыдачаАвтомобиля.Картинка = ИзображениеСобытиеЗапланировано;
			Если ЗначениеЗаполнено(Выборка.ДатаНапоминания) Тогда
				ТекстДата = Формат(Выборка.ДатаНапоминания, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
				Элементы.ВыдачаАвтомобиля.Заголовок = "Выдача (" + ТекстДата + ")";
			КонецЕсли;
		Иначе
			//Нет напоминания
			Элементы.ВыдачаАвтомобиля.ЦветФона = ЦветКнопкиВоронкиСерый;
			Элементы.ВыдачаАвтомобиля.Заголовок = "Выдача";
			Элементы.ВыдачаАвтомобиля.Картинка = ИзображениеПустое;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // Воронка_ОбновитьВыдачу()

&НаСервере
Процедура Воронка_ОбновитьЗвонокВежливости3()
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗвонокВежливости3дня;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Был звонок
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		Элементы.ЗвонокВежливости3.ЦветФона = ЦветRenault3;
		Элементы.ЗвонокВежливости3.Заголовок = "Звонок №1" + Символы.ПС + "(" + ТекстДата + ")";
		Элементы.ЗвонокВежливости3.Картинка = ИзображениеСобытиеВыполнено;
	Иначе
		//Не было звонка
		//Проверим наличие напоминания
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	CRM_СобытияПоРабочимЛистам.Ссылка,
		|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания
		|ИЗ
		|	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
		|ГДЕ
		|	CRM_СобытияПоРабочимЛистам.IDK = &IDK
		|	И CRM_СобытияПоРабочимЛистам.ВидСобытия = &ВидСобытия
		|	И CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания";
		Запрос.УстановитьПараметр("IDK", Объект.IDK);
		Запрос.УстановитьПараметр("ВидСобытия", Справочники.CRM_ВидыСобытий.ЗвонокВежливости3);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			//Есть напоминание
			Элементы.ЗвонокВежливости3.ЦветФона = ЦветКнопкиВоронкиСерый;
			Элементы.ЗвонокВежливости3.Заголовок = "Звонок №1";
			Элементы.ЗвонокВежливости3.Картинка = ИзображениеСобытиеЗапланировано;
			Если ЗначениеЗаполнено(Выборка.ДатаНапоминания) Тогда
				ТекстДата = Формат(Выборка.ДатаНапоминания, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
				Элементы.ЗвонокВежливости3.Заголовок = "Звонок №1" + Символы.ПС + "(" + ТекстДата + ")";
			КонецЕсли;
		Иначе
			//Нет напоминания
			Элементы.ЗвонокВежливости3.ЦветФона = ЦветКнопкиВоронкиСерый;
			Элементы.ЗвонокВежливости3.Заголовок = "Звонок №1";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // Воронка_ОбновитьЗвонокВежливости3()

&НаСервере
Процедура Воронка_ОбновитьЗвонокВежливости30()
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗвонокВежливости30Дней;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Был звонок
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		Элементы.ЗвонокВежливости30.ЦветФона = ЦветRenault3;
		Элементы.ЗвонокВежливости30.Заголовок = "Звонок №2" + Символы.ПС + "(" + ТекстДата + ")";
		Элементы.ЗвонокВежливости30.Картинка = ИзображениеСобытиеВыполнено;
	Иначе
		//Не было звонка
		//Проверим наличие напоминания
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	CRM_СобытияПоРабочимЛистам.Ссылка,
		|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания
		|ИЗ
		|	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
		|ГДЕ
		|	CRM_СобытияПоРабочимЛистам.IDK = &IDK
		|	И CRM_СобытияПоРабочимЛистам.ВидСобытия = &ВидСобытия
		|	И CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания";
		Запрос.УстановитьПараметр("IDK", Объект.IDK);
		Запрос.УстановитьПараметр("ВидСобытия", Справочники.CRM_ВидыСобытий.ЗвонокВежливости30);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			//Есть напоминание
			Элементы.ЗвонокВежливости30.ЦветФона = ЦветКнопкиВоронкиСерый;
			Элементы.ЗвонокВежливости30.Заголовок = "Звонок №2";
			Элементы.ЗвонокВежливости30.Картинка = ИзображениеСобытиеЗапланировано;
			Если ЗначениеЗаполнено(Выборка.ДатаНапоминания) Тогда
				ТекстДата = Формат(Выборка.ДатаНапоминания, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
				Элементы.ЗвонокВежливости30.Заголовок = "Звонок №2" + Символы.ПС + "(" + ТекстДата + ")";
			КонецЕсли;
		Иначе
			//Нет напоминания
			Элементы.ЗвонокВежливости30.ЦветФона = ЦветКнопкиВоронкиСерый;
			Элементы.ЗвонокВежливости30.Заголовок = "Звонок №2";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // Воронка_ОбновитьЗвонокВежливости30()

&НаСервере
Процедура Воронка_ОбновитьЗвонокВежливости360()
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗвонокВежливости360Дней;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Был звонок
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		Элементы.ЗвонокВежливости360.ЦветФона = ЦветRenault3;
		Элементы.ЗвонокВежливости360.Заголовок = "Звонок №3" + Символы.ПС + "(" + ТекстДата + ")";
		Элементы.ЗвонокВежливости360.Картинка = ИзображениеСобытиеВыполнено;
	Иначе
		//Не было звонка
		//Проверим наличие напоминания
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	CRM_СобытияПоРабочимЛистам.Ссылка,
		|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания
		|ИЗ
		|	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
		|ГДЕ
		|	CRM_СобытияПоРабочимЛистам.IDK = &IDK
		|	И CRM_СобытияПоРабочимЛистам.ВидСобытия = &ВидСобытия
		|	И CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания";
		Запрос.УстановитьПараметр("IDK", Объект.IDK);
		Запрос.УстановитьПараметр("ВидСобытия", Справочники.CRM_ВидыСобытий.ЗвонокВежливости360);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			//Есть напоминание
			Элементы.ЗвонокВежливости360.ЦветФона = ЦветКнопкиВоронкиСерый;
			Элементы.ЗвонокВежливости360.Заголовок = "Звонок №3";
			Элементы.ЗвонокВежливости360.Картинка = ИзображениеСобытиеЗапланировано;
			Если ЗначениеЗаполнено(Выборка.ДатаНапоминания) Тогда
				ТекстДата = Формат(Выборка.ДатаНапоминания, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
				Элементы.ЗвонокВежливости360.Заголовок = "Звонок №3" + Символы.ПС + "(" + ТекстДата + ")";
			КонецЕсли;
		Иначе
			//Нет напоминания
			Элементы.ЗвонокВежливости360.ЦветФона = ЦветКнопкиВоронкиСерый;
			Элементы.ЗвонокВежливости360.Заголовок = "Звонок №3";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // Воронка_ОбновитьЗвонокВежливости360()

&НаСервере
Процедура Воронка_ОбновитьЗвонокВежливостиНов()
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗвонокВежливостиНовый;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Был звонок
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		Элементы.ЗвонокВежливостиНовый.ЦветФона = ЦветRenault3;
		Элементы.ЗвонокВежливостиНовый.Заголовок = "Звонок новый" + Символы.ПС + "(" + ТекстДата + ")";
		Элементы.ЗвонокВежливостиНовый.Картинка = ИзображениеСобытиеВыполнено;
	Иначе
		//Не было звонка
		//Проверим наличие напоминания
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	CRM_СобытияПоРабочимЛистам.Ссылка,
		|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания
		|ИЗ
		|	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
		|ГДЕ
		|	CRM_СобытияПоРабочимЛистам.IDK = &IDK
		|	И CRM_СобытияПоРабочимЛистам.ВидСобытия = &ВидСобытия
		|	И CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания";
		Запрос.УстановитьПараметр("IDK", Объект.IDK);
		Запрос.УстановитьПараметр("ВидСобытия", Справочники.CRM_ВидыСобытий.ЗвонокВежливостиНовый);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			//Есть напоминание
			Элементы.ЗвонокВежливостиНовый.ЦветФона = ЦветКнопкиВоронкиСерый;
			Элементы.ЗвонокВежливостиНовый.Заголовок = "Звонок №3";
			Элементы.ЗвонокВежливостиНовый.Картинка = ИзображениеСобытиеЗапланировано;
			Если ЗначениеЗаполнено(Выборка.ДатаНапоминания) Тогда
				ТекстДата = Формат(Выборка.ДатаНапоминания, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
				Элементы.ЗвонокВежливостиНовый.Заголовок = "Звонок новый" + Символы.ПС + "(" + ТекстДата + ")";
			КонецЕсли;
		Иначе
			//Нет напоминания
			Элементы.ЗвонокВежливостиНовый.ЦветФона = ЦветКнопкиВоронкиСерый;
			Элементы.ЗвонокВежливостиНовый.Заголовок = "Звонок новый";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // Воронка_ОбновитьЗвонокВежливостиНовый()


&НаСервере
Процедура Воронка_ОбновитьРегистрациюКлиентаВБазеРеноРоссия()
		
	ДанныеКорпКлиента = ПолучитьИдентификаторКорпКлиента();  
	Если ДанныеКорпКлиента <> Неопределено Тогда
		ИдентификаторКорпКлиента = ДанныеКорпКлиента.ИдентификаторКорпКлиента;
	Иначе
		ИдентификаторКорпКлиента = "";
	КонецЕсли;

	//проверим была ли попытка регистрации клиента 
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.РегистрацияКлиентаВБазеРеноРоссия;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		Элементы.РегистрацияВБазеРеноРоссия.ЦветФона = ЦветRenault3;
		//если корп.клиент зарегестрирован, выведем его идентификатор
		//если нет отобразим, дату регистрации корп. клиента
		Если ЗначениеЗаполнено(ИдентификаторКорпКлиента) Тогда		
			Элементы.РегистрацияВБазеРеноРоссия.Заголовок = "Корп. клиент зарегистрирован. № " + ИдентификаторКорпКлиента;
		Иначе
			Элементы.РегистрацияВБазеРеноРоссия.Заголовок = "Регистрация клиента в базе Renault Россия (" + ТекстДата + ")";
		КонецЕсли;	
	Иначе
		Элементы.РегистрацияВБазеРеноРоссия.ЦветФона = ЦветКнопкиВоронкиСерый;
		Элементы.РегистрацияВБазеРеноРоссия.Заголовок = "Регистрация клиента в базе Renault Россия";
	КонецЕсли;
	
КонецПроцедуры // Воронка_ОбновитьРегистрациюКлиентаВБазеРеноРоссия()

&НаСервере
Процедура Воронка_ОбновитьПрезентацияАвтомобиля()
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ПрезентацияАвтомобиля;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Проведена
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		Элементы.Презентация.ЦветФона = ЦветRenault2;
		Элементы.Презентация.Заголовок = "Презентация (" + ТекстДата + ")";
	Иначе
		//Не проведена
		Элементы.Презентация.ЦветФона = ЦветКнопкиВоронкиСерый;
		Элементы.Презентация.Заголовок = "Презентация";
	КонецЕсли;
	
КонецПроцедуры // Воронка_ОбновитьПрезентацияАвтомобиля()

&НаСервере
Процедура Воронка_ОбновитьТестДрайв()
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ТестДрайв;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Был тест-драйв
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		Элементы.ТестДрайвПродажа.ЦветФона 	= ЦветRenault2;
		Элементы.ТестДрайвПродажа.Заголовок = "Тест-драйв (" + ТекстДата + ")";
		Элементы.ТестДрайвПродажа.Картинка 	= ИзображениеСобытиеВыполнено;
	Иначе
		//Не было посещения
		//Проверим наличие напоминания
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	CRM_СобытияПоРабочимЛистам.Ссылка,
		|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания
		|ИЗ
		|	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
		|ГДЕ
		|	CRM_СобытияПоРабочимЛистам.IDK = &IDK
		|	И CRM_СобытияПоРабочимЛистам.ВидСобытия = &ВидСобытия
		|	И CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания";
		Запрос.УстановитьПараметр("IDK", Объект.IDK);
		Запрос.УстановитьПараметр("ВидСобытия", Справочники.CRM_ВидыСобытий.ТестДрайв);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			//Есть напоминание
			Элементы.ТестДрайвПродажа.ЦветФона 	= ЦветКнопкиВоронкиСерый;
			Элементы.ТестДрайвПродажа.Заголовок = "Тест-драйв";
			Элементы.ТестДрайвПродажа.Картинка 	= ИзображениеСобытиеЗапланировано;
			Если ЗначениеЗаполнено(Выборка.ДатаНапоминания) Тогда
				ТекстДата = Формат(Выборка.ДатаНапоминания, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
				Элементы.ТестДрайвПродажа.Заголовок = "Тест-драйв (" + ТекстДата + ")";
			КонецЕсли;
		Иначе
			//Нет напоминания
			Элементы.ТестДрайвПродажа.ЦветФона = ЦветКнопкиВоронкиСерый;
			Элементы.ТестДрайвПродажа.Заголовок = "Тест-драйв";
			Элементы.ТестДрайвПродажа.Картинка = ИзображениеПустое;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // Воронка_ОбновитьТестДрайв()

&НаСервере
Процедура Воронка_ОбновитьСтраховку() 
	
	ПокраситьКнопкиКредитСтраховка(Справочники.CRM_ВидыСобытий.Страховка)
	
КонецПроцедуры // Воронка_ОбновитьСтраховку()

&НаСервере
Процедура Воронка_ОбновитьКредит() 
	
	ПокраситьКнопкиКредитСтраховка(Справочники.CRM_ВидыСобытий.Кредит)
	
КонецПроцедуры // Воронка_ОбновитьКредит()

&НаСервере
Процедура Воронка_ОбновитьMYRenault()
	
	ЭтоКОРП = Объект.ТипКлиента = Перечисления.Renault_ТипыКлиентов.КорпоративныйКлиент;
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.РегистрацияВMYRenault;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		//Зарегистрирован
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		Элементы.MyRenault.ЦветФона = Новый Цвет(125,157,183);
		Если Не ЭтоКОРП Тогда
			Элементы.MyRenault.Заголовок = "Зарегистрирован в MyRenault (" + ТекстДата + ")";
		Иначе	
			Элементы.MyRenault.Заголовок = "Зарегистрирован в корп. портале (" + ТекстДата + ")";
		КонецЕсли;
	Иначе
		//Не зарегистрирован
		Элементы.MyRenault.ЦветФона = ЦветКнопкиВоронкиСерый;
		Если Не ЭтоКОРП Тогда
			Элементы.MyRenault.Заголовок = "Зарегистрировать в MyRenault";
		Иначе	
			Элементы.MyRenault.Заголовок = "Зарегистрировать в корпоративном портале";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // Воронка_ОбновитьMYRenault()

&НаСервере
Процедура Воронка_ОбновитьЗвонокВежливостиДР()
	
	СтрокаЗВ = Объект.ДилерскийЦентр.ЗвонкиВежливости.Найти("Звонок ДР", "ЗвонокНомер");
	Выход = Ложь;
	Если СтрокаЗВ <> Неопределено Тогда
		Если НЕ СтрокаЗВ.ДелатьЗвонок Тогда
			Выход = Истина;
		КонецЕсли;		
	Иначе
		Выход = Истина;
	КонецЕсли;
	
	Если Выход Тогда
		Элементы.ЗвонокВежливостиДР.Доступность = Ложь;
		Элементы.ЗвонокВежливостиДР.ЦветФона = ЦветКнопкиВоронкиСерый;
		Элементы.ЗвонокВежливостиДР.Заголовок = "Звонок ДР";
		Элементы.ЗвонокВежливостиДР.Картинка = ИзображениеПустое; 		

		Возврат;
	Иначе
		Элементы.ЗвонокВежливостиДР.Доступность = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Клиент) Тогда
		Элементы.ЗвонокВежливостиДР.ЦветФона = ЦветКнопкиВоронкиСерый;
		Элементы.ЗвонокВежливостиДР.Заголовок = "Звонок ДР";		
		Возврат;
	КонецЕсли;
	
	КлиентДатаРождения = Объект.Клиент.ДатаРождения;
	Если НЕ ЗначениеЗаполнено(КлиентДатаРождения) Тогда
		Элементы.ЗвонокВежливостиДР.ЦветФона = ЦветКнопкиВоронкиСерый;
		Элементы.ЗвонокВежливостиДР.Заголовок = "Звонок ДР";
		Возврат;
	КонецЕсли;
	
	ДатаЗвонкаДР = Документы.CRM_СобытияПоРабочимЛистам.ПолучитьБлижайшуюДатуДР(КлиентДатаРождения); 		

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CRM_СобытияПоРабочимЛистам.Ссылка,
	               |	CRM_СобытияПоРабочимЛистам.ДатаНапоминания
	               |ИЗ
	               |	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
	               |ГДЕ
	               |	CRM_СобытияПоРабочимЛистам.IDK = &РабочийЛист
	               |	И CRM_СобытияПоРабочимЛистам.ВидСобытия = ЗНАЧЕНИЕ(Справочник.CRM_ВидыСобытий.ЗвонокВежливостиДР)
	               |	И CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
	               |	И CRM_СобытияПоРабочимЛистам.ДатаНапоминания = &ДатаНапоминания
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	CRM_СобытияПоРабочимЛистам.ДатаНапоминания";
	Запрос.УстановитьПараметр("РабочийЛист", 		Объект.IDK);
	Запрос.УстановитьПараметр("ДатаНапоминания", 	ДатаЗвонкаДР);
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Элементы.ЗвонокВежливостиДР.ЦветФона = ЦветКнопкиВоронкиСерый;
		Элементы.ЗвонокВежливостиДР.Заголовок = "Звонок ДР";
		Элементы.ЗвонокВежливостиДР.Картинка = ИзображениеСобытиеЗапланировано;
		Если ЗначениеЗаполнено(Выборка.ДатаНапоминания) Тогда
			ТекстДата = Формат(Выборка.ДатаНапоминания, "ДФ=""дд.ММ.гггг""");
			Элементы.ЗвонокВежливостиДР.Заголовок = "Звонок ДР" + Символы.ПС + "(" + ТекстДата + ")";
		КонецЕсли;
	Иначе
		Элементы.ЗвонокВежливостиДР.ЦветФона = ЦветКнопкиВоронкиСерый;
		Элементы.ЗвонокВежливостиДР.Заголовок = "Звонок ДР";
		Элементы.ЗвонокВежливостиДР.Картинка = ИзображениеПустое;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Воронка_ОбновитьЗаполнениеДанныхАвтомобиляТрейдИн()
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнЗаполнениеДанныхАвтомобиля;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		Элементы.ЗаполнениеИнформацииОбАвтомобилеТрейдИн.ЦветФона 	= ЦветRenault2;
		Элементы.ЗаполнениеИнформацииОбАвтомобилеТрейдИн.Заголовок 	= "Заполнены данные автомобиля (" + ТекстДата + ")";
		Элементы.ЗаполнениеИнформацииОбАвтомобилеТрейдИн.Картинка 	= ИзображениеСобытиеВыполнено;
	Иначе
		Элементы.ЗаполнениеИнформацииОбАвтомобилеТрейдИн.ЦветФона 	= ЦветКнопкиВоронкиСерый;
		Элементы.ЗаполнениеИнформацииОбАвтомобилеТрейдИн.Заголовок 	= "Автомобиль клиента";
	КонецЕсли;
	
КонецПроцедуры // Воронка_ОбновитьЗаполнениеДанныхАвтомобиляТрейдИн()

&НаСервере
Процедура Воронка_ОбновитьПредварительнаяОценка()
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнПредварительнаяОценка;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		Элементы.ПредварительнаяОценкаТрейдИн.ЦветФона 	= ЦветRenault3;
		Элементы.ПредварительнаяОценкаТрейдИн.Заголовок 		= "Выполнена предварительная оценка (" + ТекстДата + ")";
		Элементы.ПредварительнаяОценкаТрейдИн.Картинка 			= ИзображениеСобытиеВыполнено;
	Иначе
		Элементы.ПредварительнаяОценкаТрейдИн.ЦветФона 			= ЦветКнопкиВоронкиСерый;
		Элементы.ПредварительнаяОценкаТрейдИн.Заголовок 		= "Предварительная оценка";
	КонецЕсли;
	
КонецПроцедуры // Воронка_ОбновитьПредварительнаяОценка()

&НаСервере
Процедура Воронка_ОбновитьВизуальныйОсмотр()
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнВизуальныйОсмотр;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		Элементы.ВизуальныйОсмотрТрейдИн.ЦветФона 	= ЦветRenault2;
		Элементы.ВизуальныйОсмотрТрейдИн.Заголовок 	= "Выполнен визуальный осмотр (" + ТекстДата + ")";
		Элементы.ВизуальныйОсмотрТрейдИн.Картинка 	= ИзображениеСобытиеВыполнено;
	Иначе
		Элементы.ВизуальныйОсмотрТрейдИн.ЦветФона 	= ЦветКнопкиВоронкиСерый;
		Элементы.ВизуальныйОсмотрТрейдИн.Заголовок 	= "Визуальный осмотр";
	КонецЕсли;
	
КонецПроцедуры // Воронка_ОбновитьВизуальныйОсмотр()

&НаСервере
Процедура Воронка_ОбновитьОценкаСервисом()
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнДиагностикаВСервисе;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		Элементы.ОценкаСервисомТрейдИн.ЦветФона 	= ЦветRenault2;
		Элементы.ОценкаСервисомТрейдИн.Заголовок 	= "Записан на диагностику (" + ТекстДата + ")";
		Элементы.ОценкаСервисомТрейдИн.Картинка 	= ИзображениеСобытиеВыполнено;
	Иначе
		Элементы.ОценкаСервисомТрейдИн.ЦветФона 	= ЦветКнопкиВоронкиСерый;
		Элементы.ОценкаСервисомТрейдИн.Заголовок 	= "Оценка сервисом";
	КонецЕсли;
	
КонецПроцедуры // Воронка_ОбновитьОценкаСервисом()

&НаСервере
Процедура Воронка_ОбновитьПроверкаЮридическойЧистоты()
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнПроверкаЮридическойЧистоты;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		Элементы.ПроверкаЮрЧистотыТрейдИн.ЦветФона 	= Новый Цвет(121, 181, 109);
		Элементы.ПроверкаЮрЧистотыТрейдИн.Заголовок = "Выполнена проверка юр. чистоты (" + ТекстДата + ")";
		Элементы.ПроверкаЮрЧистотыТрейдИн.Картинка 	= ИзображениеСобытиеВыполнено;
	Иначе
		Элементы.ПроверкаЮрЧистотыТрейдИн.ЦветФона 	= ЦветКнопкиВоронкиСерый;
		Элементы.ПроверкаЮрЧистотыТрейдИн.Заголовок = "Проверка юридической чистоты (выполняется дилером)";
	КонецЕсли
	
КонецПроцедуры // Воронка_ОбновитьПроверкаЮридическойЧистоты()

&НаСервере
Процедура Воронка_ОбновитьКалькуляцию()
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнКалькуляция;;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		Элементы.КалькуляцияТрейдИн.ЦветФона 	= ЦветRenault3;
		Элементы.КалькуляцияТрейдИн.Заголовок 	= "Создан документ калькуляции (" + ТекстДата + ")";
		Элементы.КалькуляцияТрейдИн.Картинка 	= ИзображениеСобытиеВыполнено;
	Иначе
		Элементы.КалькуляцияТрейдИн.ЦветФона 	= ЦветКнопкиВоронкиСерый;
		Элементы.КалькуляцияТрейдИн.Заголовок 	= "Калькуляция";
	КонецЕсли
	
КонецПроцедуры // Воронка_ОбновитьКалькуляцию()

&НаСервере
Процедура Воронка_ОбновитьПредложениеВыкупа()
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнПредложениеВыкупа;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		Элементы.ПредложениеВыкупаТрейдИн.ЦветФона 	= ЦветRenault3;
		Элементы.ПредложениеВыкупаТрейдИн.Заголовок = "Создано предложение выкупа (" + ТекстДата + ")";
		Элементы.ПредложениеВыкупаТрейдИн.Картинка 	= ИзображениеСобытиеВыполнено;
	Иначе
		Элементы.ПредложениеВыкупаТрейдИн.ЦветФона 	= ЦветКнопкиВоронкиСерый;
		Элементы.ПредложениеВыкупаТрейдИн.Заголовок = "Предложение выкупа";
	КонецЕсли
	
КонецПроцедуры // Воронка_ОбновитьПредложениеВыкупа()

&НаСервере
Процедура Воронка_ОбновитьДоговорСКлиентом()
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнДоговорСКлиентом;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Если ЗначениеЗаполнено(Запись.ДатаВыполнения) Тогда
			ТекстДата = Формат(Запись.ДатаВыполнения, "ДФ=""дд.ММ.гггг 'в' ЧЧ:мм""");
		КонецЕсли;
		Элементы.ДоговорСКлиентомТрейдИн.ЦветФона 	= ЦветRenault3;
		Элементы.ДоговорСКлиентомТрейдИн.Заголовок 	= "Заключен договор с клиентом (" + ТекстДата + ")";
		Элементы.ДоговорСКлиентомТрейдИн.Картинка 	= ИзображениеСобытиеВыполнено;
	Иначе
		Элементы.ДоговорСКлиентомТрейдИн.ЦветФона 	= ЦветКнопкиВоронкиСерый;
		Элементы.ДоговорСКлиентомТрейдИн.Заголовок 	= "Договор с клиентом";
	КонецЕсли
	
КонецПроцедуры // Воронка_ОбновитьДоговорСКлиентом()

#КонецОбласти

#Область ОбщиеПроцедурыИФункцииРаботыСРабочимиЛистами

// Возвращает список отделов продаж/Трейд-ин
// 
// Возвращаемое значение:
//  СписокЗначений - Список отделов продаж
//
&НаСервере
Функция ПолучитьСписокОтделов(ЭтоТрейдИн)
	
	Если ЭтоТрейдИн Тогда
		ДопУсловие = "(ЗНАЧЕНИЕ(Перечисление.CRM_КлассификацияОтделов.ОтделПродажАвтомобилей), ЗНАЧЕНИЕ(Перечисление.CRM_КлассификацияОтделов.ОтделТрейдИн))";	
	Иначе
		ДопУсловие = "(ЗНАЧЕНИЕ(Перечисление.CRM_КлассификацияОтделов.ОтделПродажАвтомобилей))";	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_Отделы.Ссылка КАК Отдел
	|ИЗ
	|	Справочник.CRM_Отделы КАК CRM_Отделы
	|ГДЕ
	|	CRM_Отделы.КлассификацияRenault В" + ДопУсловие + "
	|	И CRM_Отделы.ДилерскийЦентр = &ДилерскийЦентр
	|	И НЕ CRM_Отделы.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	CRM_Отделы.КлассификацияRenault";
	
	Запрос.УстановитьПараметр("ДилерскийЦентр", Объект.ДилерскийЦентр);
	
	Результат = Запрос.Выполнить();
		
	СписокОтделов = Новый СписокЗначений;
	
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СписокОтделов.Добавить(Выборка.Отдел);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СписокОтделов;
	
КонецФункции // ПолучитьСписокОтделов()

// Создает запись в РС "Renault_Трафик"
//
// Параметры:
//  Отдел			 	- СправочникСсылка.CRM_Отделы	 - Ссылка на отдел
//  ВыбранныйСотрудник	 - СправочникСсылка.Сотрудники	 - Администратор
// 
// Возвращаемое значение:
//  Строка - Идентификатор трафика
//
&НаСервере
Функция СоздатьЗаписьТрафика(Отдел, ВыбранныйСотрудник)
	
	ЗаписьТрафик = РегистрыСведений.Renault_Трафик.СоздатьМенеджерЗаписи();
			
	ЗаписьТрафик.Период = ТекущаяДата();
	Идентификатор = Новый УникальныйИдентификатор();
	ЗаписьТрафик.ТипТрафика = Объект.ТипТрафика;
	ЗаписьТрафик.Идентификатор = Идентификатор;
	ЗаписьТрафик.Менеджер = ВыбранныйСотрудник;
	ЗаписьТрафик.Администратор = ВыбранныйСотрудник;
	ЗаписьТрафик.Отдел = ?(ЗначениеЗаполнено(Отдел), Отдел, Объект.Отдел);
	ЗаписьТрафик.ПервичныйПовторный = Перечисления.CRM_ПервичныйПовторный.Первичный;
	ЗаписьТрафик.Представление = Клиент_ФИО;
	ЗаписьТрафик.Обработан = Истина;
	ЗаписьТрафик.ДилерскийЦентр = Объект.ДилерскийЦентр;
	ЗаписьТрафик.Клиент = Объект.Клиент;	
	
	ЗаписьТрафик.Записать();
	
	Возврат ЗаписьТрафик.Идентификатор;
	
КонецФункции // СоздатьЗаписьТрафика()

#КонецОбласти

#Область ОбработчикиКомандПодвалаФормы

&НаКлиенте
Процедура СводныйОтчет(Команда)
	
	ФормаИнф = ПолучитьОбщуюФорму("CRM_ФормаINF",,);
	ФормаИнф.ИДК = Число(Объект.IDK);
	ФормаИнф.Открыть();
	
КонецПроцедуры // СводныйОтчет()

&НаКлиенте
Процедура ВажнаяСделка(Команда)
	
	Объект.Важность = Не Объект.Важность;
	ОбновитьЦветКнопкиВажность();
	СохранитьРабочийЛист();
	
КонецПроцедуры // ВажнаяСделка()

&НаКлиенте
Процедура КлиентУпущен(Команда)
	
	//Проверка, факта закрытия рл
	Если Объект.ЛистЗакрыт Тогда
		Если Не Renault_РаботаСПравамиПользователя.ЕстьПравоИспользоватьАрмРОП(ПараметрыСеанса.Пользователь)Тогда
			Предупреждение("Данный рабочий лист закрыт. Для изменения причины закрытия обратитесь к руководителю.");
			Возврат;
		Иначе
			Объект.ЛистЗакрыт = Не Объект.ЛистЗакрыт;
			Период = ТекущаяДата();
			Если Объект.ЛистЗакрыт Тогда
				Объект.АвторЗакрытия = ТекМенеджер;
			Иначе
				Объект.АвторЗакрытия = Неопределено;
			КонецЕсли;
			ЗаписатьРабочийЛист();
			ОбновитьЦветКнопокРОП();
		
		КонецЕсли;
		
	КонецЕсли;
	
	//Проверка существования запроса на закрытие "продажа"
	Если Объект.ЗапросНаЗакрытие И Объект.ПричинаЗакрытия = Справочники.CRM_ПричиныЗакрытияРЛ.УспешнаяПродажа Тогда		
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "По рабочему листу существует запрос на закрытие по другой причине, он будет отменен. Продолжить?";
		Ответ = Вопрос(Текст, Режим, 0); 
		Если Ответ = КодВозвратаДиалога.Нет Тогда		
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	//Проверка существования запроса на закрытие "упущен"
	Если Объект.ЗапросНаЗакрытие И Объект.ПричинаЗакрытия <> Справочники.CRM_ПричиныЗакрытияРЛ.УспешнаяПродажа Тогда
		Объект.ЗапросНаЗакрытие = Ложь;
		Объект.ПричинаЗакрытия = Неопределено;
		ОбновитьОтображениеКнопокЗакрытия();
		Возврат;
	КонецЕсли;
	
	Если НЕ Объект.ТипРабочегоЛиста = Перечисления.Renault_ТипыРабочихЛистов.TradeIn Тогда
	
		//Проверим на наличие незакрытых событий
		Если ЕстьСобытияПоРЛ() Тогда
			Предупреждение("Перед закрытием рабочего листа необходимо закрыть все события");
			Возврат;
		КонецЕсли;
		Если НовыйАвтомобиль = 1 Тогда
			Если Не ЗначениеЗаполнено(Объект.ТипПродажиВыкупа) 
			или (Не ЗначениеЗаполнено(Объект.Гарантия) ИЛИ (Объект.Гарантия <> "Нет" и не ЗначениеЗаполнено(Объект.СрокГарантии))) Тогда
			Предупреждение("Для успешного закрытия рабочего листа по продажи необходимо заполнить тип продажи и гарантию для статистики.");
			Возврат;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если Не ЗначениеЗаполнено(Объект.ТипПродажиВыкупа)  Тогда
			Предупреждение("Для успешного закрытия рабочего листа по приему необходимо заполнить тип выкупа для статистики.");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Если ПометитьНеВыполненныеЗаявкиНаСервис() Тогда
        Возврат;
    КонецЕсли;
	ФормаВвода = Объект.Ссылка.ПолучитьФорму("ФормаВыбораПричиныЗакрытияРабочегоЛиста");
	Ответ = ФормаВвода.ОткрытьМодально();
	Если ЗначениеЗаполнено(Ответ) Тогда
		Объект.ПричинаЗакрытия = Ответ.ПричинаЗакрытия;
		Объект.КомментарийЗакрытия = Ответ.КомментарийЗакрытия;
		Объект.ЗапросНаЗакрытие = Истина;
		Объект.ДатаЗапросаНаЗакрытие = ТекущаяДата();
		СохранитьРабочийЛист();
	КонецЕсли;
	
	ОбновитьОтображениеКнопокЗакрытия();
	
КонецПроцедуры // КлиентУпущен()

&НаКлиенте
Процедура УспешнаяПродажа(Команда)
	
	//Проверка, факта закрытия рл
	Если Объект.ЛистЗакрыт Тогда
		Предупреждение("Данный рабочий лист закрыт. Для изменения причины закрытия обратитесь к руководителю.");
		Возврат;
	КонецЕсли;
	
	//Проверка существования запроса на закрытие "упущен"
	Если Объект.ЗапросНаЗакрытие И Объект.ПричинаЗакрытия <> Справочники.CRM_ПричиныЗакрытияРЛ.УспешнаяПродажа Тогда		
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "По рабочему листу существует запрос на закрытие по другой причине, он будет отменен. Продолжить?";
		Ответ = Вопрос(Текст, Режим, 0); 
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	//Проверка существования запроса на закрытие "продажа"
	Если Объект.ЗапросНаЗакрытие И Объект.ПричинаЗакрытия = Справочники.CRM_ПричиныЗакрытияРЛ.УспешнаяПродажа Тогда
		Объект.ЗапросНаЗакрытие = Ложь;
		Объект.ПричинаЗакрытия = Неопределено;
		ОбновитьОтображениеКнопокЗакрытия();
		Возврат;
	КонецЕсли;
	
	//Проверим на наличие незакрытых событий
	Если Объект.ТипРабочегоЛиста = Перечисления.Renault_ТипыРабочихЛистов.TradeIn Тогда
		Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн) Тогда
			ЕстьПоступление = ПроверитьНаличиеПоступленияНаСклад(ЗаявкаНаТрейдИн.Автомобиль);
			Если Не ЕстьПоступление Тогда
				Предупреждение("Для успешного закрытия рабочего листа по приему необходимо оформить поступление автомобиля на склад");
				Возврат;
			КонецЕсли;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.ТипПродажиВыкупа)  Тогда
			Предупреждение("Для успешного закрытия рабочего листа по приему необходимо заполнить тип выкупа для статистики.");
			Возврат;
		КонецЕсли;
	ИначеЕсли Объект.ТипРабочегоЛиста = Перечисления.Renault_ТипыРабочихЛистов.Продажа и НовыйАвтомобиль = 1 Тогда
		Если Не ЗначениеЗаполнено(Объект.ТипПродажиВыкупа) 
			или (Не ЗначениеЗаполнено(Объект.Гарантия) ИЛИ (Объект.Гарантия <> "Нет" и не ЗначениеЗаполнено(Объект.СрокГарантии))) Тогда
			Предупреждение("Для успешного закрытия рабочего листа по продажи необходимо заполнить тип выкупа и гарантию для статистики.");
			Возврат;
		КонецЕсли;
	Иначе
	//Проверка отметки этапа Выдача
	ЗаписьВыдача = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	ЗаписьВыдача.IDK = Объект.IDK;
	ЗаписьВыдача.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ВыдачаАвтомобиля;
	ЗаписьВыдача.Прочитать();
	Если Не ЗаписьВыдача.Выбран() Тогда
		Предупреждение("Перед закрытием рабочего листа необходимо оформление выдачи");
		Возврат;
	КонецЕсли;
	КонецЕсли;

	//проверка наличия не выполненных заявок на установку доп. оборудования
	Если ПометитьНеВыполненныеЗаявкиНаСервис() тогда
        Возврат;
    КонецЕсли;

	Объект.ЗапросНаЗакрытие = Истина;
	Объект.ДатаЗапросаНаЗакрытие = ТекущаяДата();
	Объект.ПричинаЗакрытия = Справочники.CRM_ПричиныЗакрытияРЛ.УспешнаяПродажа;
	Объект.КомментарийЗакрытия = "";
	ОбновитьОтображениеКнопокЗакрытия();	
	
КонецПроцедуры // УспешнаяПродажа()

&НаКлиенте
Процедура ПодборАвто(Команда)
	
	// создаем новую заявку
	ЗаявкаДок = Документы.CRM_ЗаявкаНаПодборАвтомобиля.СоздатьДокумент();
	
	ЗаявкаДок.Менеджер 			= ТекМенеджер;
	ЗаявкаДок.Модель 			= Объект.МодельАвтомобиля;
	ЗаявкаДок.Комплектация 		= Объект.Комплектация;
	ЗаявкаДок.Цвет 				= Объект.Цвет;
	ЗаявкаДок.РабочийЛист 		= Объект.IDK;
	ЗаявкаДок.Статус 			= Перечисления.CRM_СтатусыЗаявокАвтосклад.НеПринятаКРаботе;
	
	Форма = ЗаявкаДок.ПолучитьФорму("ФормаДокумента_Менеджер");
	Форма.Открыть();
	
КонецПроцедуры // ПодборАвто()

&НаКлиенте
Процедура ДобавитьСобытие(Команда)
	
	СоздатьНовоеСобытие();
	
КонецПроцедуры // ДобавитьСобытие()

#КонецОбласти

#Область ОбработчикиКомандВоронки

&НаКлиенте
Процедура ВзятТелефон(Команда)
	
	Форма = Объект.Ссылка.ПолучитьФорму("ФормаВводаТелефона",, ЭтаФорма);
	Форма.ТелефонПоУмолчанию = Объект.Телефон;
	Форма.Клиент = Объект.Клиент;
	Объект.Телефон = Форма.ОткрытьМодально();
	Объект.Телефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(Объект.Клиент);
	СохранитьДанныеКлиентаПриСменеТелефона();
	Воронка_ОбновитьВзятТелефон();
	
КонецПроцедуры // ВзятТелефон()

&НаКлиенте
Процедура ВзятEmail(Команда)
	
	Форма = Объект.Ссылка.ПолучитьФорму("ФормаВводаEmail",, ЭтаФорма);
	Форма.EmailПоУмолчанию = Объект.Email;
	Форма.Клиент = Объект.Клиент;
	Объект.Email = Форма.ОткрытьМодально();
	Объект.Email = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(Объект.Клиент);
	СохранитьДанныеКлиентаПриСменеEmail();
	Воронка_ОбновитьВзятEmail();

	
КонецПроцедуры // ВзятEmail()

&НаКлиенте
Процедура ПосещениеАвтосалона(Команда)
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ПосещениеАвтосалона;
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		//Отменим эту встречу или возврат
		ФормаПодтверждения = Объект.Ссылка.ПолучитьФорму("ФормаПодтверждения");
		ФормаПодтверждения.Заголовок = "Отменить выполнение этапа 'Посещение автосалона'?";
		Ответ = ФормаПодтверждения.ОткрытьМодально();
		Если ЗначениеЗаполнено(Ответ) Тогда
			Renault_CRM.Воронка_ПосещениеАвтосалона__Снять(Объект.IDK);
		КонецЕсли;
	Иначе
		//Проверим наличие напоминания
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	CRM_СобытияПоРабочимЛистам.Ссылка
		|ИЗ
		|	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
		|ГДЕ
		|	CRM_СобытияПоРабочимЛистам.IDK = &IDK
		|	И CRM_СобытияПоРабочимЛистам.ВидСобытия = &ВидСобытия
		|	И CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания";
		Запрос.УстановитьПараметр("IDK", Объект.IDK);
		Запрос.УстановитьПараметр("ВидСобытия", Справочники.CRM_ВидыСобытий.Встреча);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			//Откроем форму завершения события
			Событие = Выборка.Ссылка;
			Событие.ПолучитьФорму("ФормаЗавершенияСобытия").Открыть();
		Иначе
			//Создадим событие или выполним этап
			ФормаВыбораДействия = Объект.Ссылка.ПолучитьФорму("ФормаВыбораДействия");
			Ответ = ФормаВыбораДействия.ОткрытьМодально();
			Если ЗначениеЗаполнено(Ответ) Тогда
				Если Ответ = "Выполнить" Тогда
					Renault_CRM.Воронка_ПосещениеАвтосалона_Установить(Объект.IDK);
					Renault_CRM.Статистика_Установить(Справочники.CRM_ЭтапыПродаж.ПосещениеАвтосалона, Объект.IDK);
				ИначеЕсли Ответ = "Напоминание" Тогда
					СобытиеОбъект = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
					СобытиеОбъект.IDK = Объект.IDK;
					СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.Встреча;
					СобытиеОбъект.Сотрудник = Объект.Сотрудник;
					СобытиеОбъект.Отдел = Объект.Отдел;
					СобытиеОбъект.ДилерскийЦентр = Объект.ДилерскийЦентр;
					СобытиеОбъект.Подразделение = Объект.Подразделение;
					ФормаСобытия = СобытиеОбъект.ПолучитьФорму("ФормаСозданияСобытия");
					ФормаСобытия.Открыть();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущийЭлемент.Имя = "ПосещениеАвтосалонаТрейдИн" Тогда
		Воронка_ОбновитьПосещениеАвтосалона(Истина);
	Иначе
		Воронка_ОбновитьПосещениеАвтосалона();
	КонецЕсли;
	
КонецПроцедуры // ПосещениеАвтосалона()

&НаКлиенте
Процедура Презентация(Команда)
	
	Если Не ПроверитьСоздатьПосещение() Тогда
		Возврат
	КонецЕсли;
	
	Renault_CRM.Воронка_ПрезентацияАвтомобиля_УстановитьСнять(Объект.IDK);
	Renault_CRM.Статистика_УстановитьСнять(Справочники.CRM_ЭтапыПродаж.ПрезентацияАвтомобиля, Объект.IDK);
	Воронка_ОбновитьПрезентацияАвтомобиля();
	
КонецПроцедуры // Презентация()

&НаКлиенте
Процедура ТестДрайвПродажа(Команда)
	
	Если Не ПроверитьСоздатьПосещение() Тогда
		Возврат
	КонецЕсли;
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ТестДрайв;
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		//Откроем список тест-драйвов
		ТекущийЭлемент = Элементы.ТестДрайв;
		СменитьСтраницу(Команда);
	Иначе
		//Проверим наличие напоминания
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	CRM_СобытияПоРабочимЛистам.Ссылка
		|ИЗ
		|	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
		|ГДЕ
		|	CRM_СобытияПоРабочимЛистам.IDK = &IDK
		|	И CRM_СобытияПоРабочимЛистам.ВидСобытия = &ВидСобытия
		|	И CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания";
		Запрос.УстановитьПараметр("IDK", Объект.IDK);
		Запрос.УстановитьПараметр("ВидСобытия", Справочники.CRM_ВидыСобытий.ТестДрайв);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			//Откроем форму завершения события
			Событие = Выборка.Ссылка;
			Событие.ПолучитьФорму("ФормаЗавершенияСобытия").Открыть();
		Иначе
			СоздатьЗаписьНаТестДрайв();
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьСписокТестДрайвов();
	Воронка_ОбновитьТестДрайв();
	
КонецПроцедуры // ТестДрайвПродажа()

&НаКлиенте
Процедура ОткрытьСписокТестДрайв(Команда)
	
	ТекущийЭлемент = Элементы.ТестДрайв;
	СменитьСтраницу(Команда);
	
КонецПроцедуры // ОткрытьСписокТестДрайв()

&НаКлиенте
Процедура СинхронизироватьCПланшетом(Команда)
	
	Возврат;
	
	// Отправка
	
	Трафик = РегистрыСведений.Renault_Трафик.СоздатьНаборЗаписей();
	Трафик.Отбор.Идентификатор.Установить(Объект.IDТрафика);
	Трафик.Прочитать();
	ДатаОбращения = Неопределено;
	Если Трафик.Количество() <> 0 Тогда
		ДатаОбращения = Трафик[0].Период;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		КлиентскиеДанные = Новый Структура;
		КлиентскиеДанные.Вставить("Идентификатор", Строка(Объект.Клиент.УникальныйИдентификатор()));
		КлиентскиеДанные.Вставить("Имя", Объект.Клиент.Имя);
		КлиентскиеДанные.Вставить("Фамилия", Объект.Клиент.Фамилия);
		КлиентскиеДанные.Вставить("Отчество", Объект.Клиент.Отчество);
		КлиентскиеДанные.Вставить("Телефон", Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(Объект.Клиент));
		КлиентскиеДанные.Вставить("Email", Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(Объект.Клиент));
		КлиентскиеДанные.Вставить("ДатаРождения", Объект.Клиент.ДатаРождения);
		Renault_РаботаСSalesTablet.ОбновитьДанныеПоТрафику(Объект.ДилерскийЦентр, КлиентскиеДанные, ДатаОбращения);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_ЗаписиНаТестДрайв.Регистратор
	|ИЗ
	|	РегистрСведений.CRM_ЗаписиНаТестДрайв КАК CRM_ЗаписиНаТестДрайв
	|ГДЕ
	|	CRM_ЗаписиНаТестДрайв.IDK = &IDK";
	Запрос.УстановитьПараметр("IDK", Объект.IDK);
	ВыборкаТД = Запрос.Выполнить().Выбрать();
	Пока ВыборкаТД.Следующий() Цикл
		ТД = ВыборкаТД.Регистратор;
		Renault_РаботаСSalesTablet.ОбновитьДанныеТестДрайв(ТД);
	КонецЦИкла;
	
	// Получение
	СинхронизироватьПланшетТД();
	СинхронизироватьПланшетКП();
		
	ОбновитьСписокКП();
	ОбновитьСписокТестДрайвов();
	
КонецПроцедуры // СинхронизироватьCПланшетом()

&НаКлиенте
Процедура КоммерческоеПредложение(Команда)
	
	ТекущийЭлемент = Элементы.КоммерческиеПредложения;
	СменитьСтраницу(Команда);
	
КонецПроцедуры // КоммерческоеПредложение()

&НаКлиенте
Процедура ОткрытьСписокКП(Команда)
	
	ТекущийЭлемент = Элементы.КоммерческиеПредложения;
	СменитьСтраницу(Команда);
	
КонецПроцедуры // ОткрытьСписокКП()

&НаКлиенте
Процедура ОткрытьАвтосклад(Команда)
	//Корзюков начало

	ДилерскийЦентрПользователя = Renault_РаботаСПравамиПользователя.ДилерскийЦентрПоУмолчанию(ПараметрыСеанса.Пользователь);
		
		Если Не ЗначениеЗаполнено(ДилерскийЦентрПользователя) Тогда
			#Если Клиент Тогда
				Предупреждение("Для пользователя не задан дилерский центр!");
			#конецЕсли
			Возврат;
		КонецЕсли;
		
		Если ДилерскийЦентрПользователя.Автосклад_ИспользоватьНовуюФормуСклада = Истина Тогда
			
			Обр = Обработки.Renault_АРМ_Автосклад_Упр.Создать();
			Обр = Новый Структура;
			Обр.Вставить("Клиент",Объект.Клиент);
			Обр.Вставить("НомерРабочегоЛиста",Объект.IDK);
			ПолучитьФорму("Обработка.Renault_АРМ_Автосклад_Упр.Форма.ФормаДинамическийСписок",Обр,).Открыть();
			//Обр = Обработки.Renault_АРМ_Автосклад.Создать();
			//Обр.Клиент 				= Объект.Клиент;
			//Обр.НомерРабочегоЛиста 	= Объект.IDK;
			//Обр.ПолучитьФорму("Обработка.Renault_АРМ_Автосклад_Упр.Форма.ФормаДинамическийСписок").Открыть();

			
		Иначе
			Обр = Обработки.Renault_АРМ_Автосклад.Создать();
			Обр.Клиент 				= Объект.Клиент;
	        Обр.НомерРабочегоЛиста 	= Объект.IDK;
	        Обр.ПолучитьФорму().Открыть();


		КонецЕсли;

     //Корзюков конец

	
	
	КонецПроцедуры // ОткрытьАвтосклад()

&НаКлиенте
Процедура ДополнительноеОборудование(Команда)
	
	Если ТаблицаКП.Количество() > 0 Тогда
		
		СтруктураПоиска = Новый Структура("ОсновноеКП", Истина);
		НайденныеСтроки = ТаблицаКП.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаОсновноеКП = НайденныеСтроки[0];
		Иначе
			СтрокаОсновноеКП = Неопределено;
		КонецЕсли;
		
		Если СтрокаОсновноеКП = Неопределено Тогда
			Если ТаблицаКП.Количество()=1 Тогда
				СтрокаОсновноеКП = ТаблицаКП[0];
			Иначе
				Сообщить("Не выбрано основное коммерческое предложение");
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаОсновноеКП.Ссылка.ИнтересовалсяОборудованием Тогда		
			ОткрытьФормуКомПредложения(СтрокаОсновноеКП, Истина);	
		Иначе
			Сообщить("Клиент не интересовался оборудованием");
		КонецЕсли;
		
	Иначе
		Сообщить("Нет коммерческих предложений по рабочему листу");
	КонецЕсли;
	
КонецПроцедуры // ДополнительноеОборудование()

&НаКлиенте
Процедура ПродленнаяГарантия(Команда)
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаПрГарантию;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		ОткрытьЗначение(Запись.Объект);
	Иначе
	
		Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
		Запись.IDK = Объект.IDK;
		Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаПрГарантиюВыполнена;
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			ОткрытьЗначение(Запись.Объект);
		Иначе
				Док = Документы.Renault_CRM_ЗаявкаНаГарантию.СоздатьДокумент();
				Док.РабочийЛист = Объект.IDK;
				Док.ДилерскийЦентр = Объект.ДилерскийЦентр;
				Док.Клиент = Объект.Клиент;
								
				Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
				Запись.IDK = Объект.IDK;
				Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.КоммерческоеПредложение;
				Запись.Прочитать();
				
				Если Запись.Выбран() И ЗначениеЗаполнено(Запись.Объект) Тогда
					
					КПОбъект = Запись.Объект.ПолучитьОбъект();
					Если КПОбъект.Состав.Количество() > 1 Тогда
						
						Ответ = КПОбъект.Состав.Выгрузить().ВыбратьСтроку("В коммерческом предложении более одного автомобиля. Выберите подходящий.");
						Если ЗначениеЗаполнено(Ответ) Тогда
							КонфигурацияОбъект = Ответ.Конфигурация;
							Сумма = Ответ.Сумма;
						Иначе
							КонфигурацияОбъект = Справочники.CRM_КонфигурацииАвтомобилей.ПустаяСсылка();
						КонецЕсли;
						
					Иначе
						
						КонфигурацияОбъект = КПОбъект.Состав[0].Конфигурация;
						Сумма = КПОбъект.Состав[0].Сумма;
						
					КонецЕсли;
					
					Если ЗначениеЗаполнено(КонфигурацияОбъект) Тогда
						Запрос = Новый запрос("ВЫБРАТЬ
						                      |	CRM_СостояниеАвтомобилейПроизводителя_v2.DATE_MADC КАК ДатаВыпуска
						                      |ИЗ
						                      |	РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
						                      |ГДЕ
						                      |	CRM_СостояниеАвтомобилейПроизводителя_v2.VIN = &Вин");
						Запрос.УстановитьПараметр("Вин", ?(ЗначениеЗаполнено(КонфигурацияОбъект.Автомобиль), КонфигурацияОбъект.Автомобиль.VIN, Объект.VINАвтомобилей));
						ВыборкаДаты = Запрос.Выполнить().Выбрать();
						Если ВыборкаДаты.Следующий() Тогда
							Док.ДатаВыпуска = ВыборкаДаты.ДатаВыпуска;
						КонецЕсли;
						
						Док.Модель = КонфигурацияОбъект.Модель;
						Док.Версия = КонфигурацияОбъект.Версия;
						Док.Цвет = КонфигурацияОбъект.Цвет;
					КонецЕсли;
					
				КонецЕсли;
				
				ОткрытьЗначение(Док);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры // ПродленнаяГарантия()

&НаКлиенте
Процедура ТрейдИн(Команда)
	
	НовыйТрейдИН = Не ЗначениеЗаполнено(Объект.СвязаныйIDK); 
	
	ТекСотрудник = DMS_ОбращенияКлиентов.ВернутьТекущегоСотрудника();
	
	НадписьСоздатьРабочийЛистТрейдИнНажатие(Неопределено);
	
	Если НовыйТрейдИН Тогда
		Событие = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
		Событие.IDK = Объект.IDK;
		Событие.Дата = ТекущаяДата();
		Событие.Автор = ТекСотрудник;
		Событие.ВидСобытия = Справочники.CRM_ВидыСобытий.Прочее;
		Событие.Комментарий = "Создание заявки на трейд-ин";
		Событие.ДатаНапоминания = ТекущаяДата();
		Событие.ДатаЗакрытия = ТекущаяДата();
		Событие.КомментарийЗакрытия = "Выполнено";
		Событие.АвторЗакрытия = ТекСотрудник;
		Событие.Сотрудник = ТекСотрудник;
		Событие.ДилерскийЦентр = Объект.ДилерскийЦентр;
		Событие.Записать();
		ОбновитьВоронкуИСписки();
	КонецЕсли;
	
КонецПроцедуры // ТрейдИн()

&НаКлиенте
Процедура ТрейдИнИзФормы () Экспорт 
	
	ТрейдИн(Неопределено);	
	
КонецПроцедуры

&НаКлиенте
Процедура Лизинг(Команда)
	
	
	
КонецПроцедуры // Лизинг()

&НаКлиенте
Процедура ОпределитьСпособПокупки(Команда) 
	
	СтраховкаКредит(?(ТекущийЭлемент.Имя="Кредит",Справочники.CRM_ВидыСобытий.Кредит,Справочники.CRM_ВидыСобытий.КонсультацияОФУ));
	
КонецПроцедуры // ОпределитьСпособПокупки()

&НаКлиенте
Процедура ОткрытьСписокДО(Команда)
	
	Форма = Документы.Renault_CRM_ОбращениеВАвтоСервис.ПолучитьФорму("СтатусыЗаявокНаДокомплектацию");
	Форма.IDK = Объект.IDK;
	Форма.Открыть();	
	
КонецПроцедуры // ОткрытьСписокДО()

&НаКлиенте
Процедура ОткрытьСписокКредитПредложений(Команда)
	
	РазрешениеНаКредит=Справочники.CRM_ВидыСобытий.ЕстьРазрешение(Справочники.CRM_ВидыСобытий.Кредит,"Просмотр");

	Если РазрешениеНаКредит Тогда
		ФормаПолисовКлиента = Документы.Renault_ЗаявкаНаКредит.ПолучитьФормуСписка();
		ФормаПолисовКлиента.ДокументСписок.Отбор.РабочийЛист.ВидСравнения = ВидСравнения.Равно;
	    ФормаПолисовКлиента.ДокументСписок.Отбор.РабочийЛист.Значение = Объект.IDK;
	    ФормаПолисовКлиента.ДокументСписок.Отбор.РабочийЛист.Использование = Истина;
	    ФормаПолисовКлиента.Открыть();
	Иначе 
		Сообщить("У Вас нет прав на просмотр данных по событию Кредит");
	КонецЕсли; 
	
КонецПроцедуры // ОткрытьСписокКредитПредложений()

&НаКлиенте
Процедура ОткрытьСписокПолисов(Команда)
	
	Если ТипЗнч(Объект.Клиент) = Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты") Тогда
		Сообщить("Страховые полисы не вводятся на потенциальных контрагентов");
		Возврат;
	КонецЕсли;
	
	РазрешениеНаСтраховку = Справочники.CRM_ВидыСобытий.ЕстьРазрешение(Справочники.CRM_ВидыСобытий.КонсультацияОФУ,"Просмотр");

	Если РазрешениеНаСтраховку Тогда
		ФормаПолисовКлиента = Документы.Renault_СтраховойПолис.ПолучитьФормуСписка();
		ФормаПолисовКлиента.ДокументСписок.Отбор.Контрагент.ВидСравнения = ВидСравнения.Равно;
	    ФормаПолисовКлиента.ДокументСписок.Отбор.Контрагент.Значение = Объект.Клиент;
	    ФормаПолисовКлиента.ДокументСписок.Отбор.Контрагент.Использование = Истина;
	    ФормаПолисовКлиента.Открыть();
	Иначе
		Сообщить("У Вас нет прав на просмотр данных по событию Консультация ОФУ");
	КонецЕсли;

	
КонецПроцедуры // ОткрытьСписокПолисов()

&НаКлиенте
Процедура ДКП(Команда)
	
	////ВазСистем Тарасов 20.11.2020 14:35:38 Инцидент #DMSREN-996
	////{
	////Старый код:
	//Если Не ПроверитьСоздатьПосещение() Тогда
	//	Возврат
	//КонецЕсли;
	////Новый код:
	////}
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_Договор.Ссылка
	|ИЗ
	|	Документ.Renault_Договор КАК CRM_Договор
	|ГДЕ
	|	CRM_Договор.РабочийЛист = &IDK
	|	И НЕ CRM_Договор.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	CRM_Договор.Дата УБЫВ";
	Запрос.УстановитьПараметр("IDK", Объект.IDK);
	Выборка = Запрос.Выполнить().Выбрать();
	КоличествоДоговоров = Выборка.Количество();
	
	Если КоличествоДоговоров = 1 Тогда
		//откроем карточку
		Выборка.Следующий();
		Договор = Выборка.Ссылка;
		Договор.ПолучитьФорму().Открыть();
	ИначеЕсли КоличествоДоговоров > 1 Тогда
		
		//Открываем список
		Элементы.ГруппаСтраницыИнформации.ТекущаяСтраница = Элементы.ГруппаСтраницаДоговорыСКлиентом;
		
	Иначе
		
		//ВазСистем Тарасов 20.11.2020 14:35:38 Инцидент #DMSREN-996
		//{
		//Старый код:
		//Новый код:
		Если Не ПроверитьСоздатьПосещение("Нет посещения Клиентом дилерского центра. Создать посещение?") Тогда
			//Возврат
		КонецЕсли;
		//}

		// DMSREN-1366
		//создадим новый
		//Если Не ЗначениеЗаполнено(Объект.Клиент.ФормаСобственности) Тогда
		//	Предупреждение("У клиента не указана форма собственности.");
		//	Возврат;
		//КонецЕсли;
		
		СоздатьНовыйДоговор();
		
	КонецЕсли;
	
КонецПроцедуры // ДКП()

&НаКлиенте
Процедура РегистрацияВБазеРеноРоссия(Команда)
	
	Если ЗначениеЗаполнено(КорпКлиент) Тогда
		
		Renault_CRM.Воронка_РегистрацияВБазеРеноРоссия_УстановитьСнять(Объект.IDK);
	Иначе
		ТекущийЭлемент = Элементы.КОРП;
		СменитьСтраницу(Команда);
	КонецЕсли;
	
	Воронка_ОбновитьРегистрациюКлиентаВБазеРеноРоссия();
	
КонецПроцедуры // РегистрацияВБазеРеноРоссия()

&НаКлиенте
Процедура ОткрытьСписокДоговоров(Команда)
	
	ТекущийЭлемент = Элементы.ДоговорыСКлиентом;
	СменитьСтраницу(Команда);
	
КонецПроцедуры // ОткрытьСписокДоговоров()

&НаКлиенте
Процедура РасторжениеПредварительногоКонтракта(Команда)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_ДоговорНаПродажуАвтомобиля.Ссылка
	|ИЗ
	|	Справочник.CRM_ДоговорНаПродажуАвтомобиля КАК CRM_ДоговорНаПродажуАвтомобиля
	|ГДЕ
	|	CRM_ДоговорНаПродажуАвтомобиля.IDK = &IDK";
	Запрос.УстановитьПараметр("IDK", Объект.IDK);
	Выборка = Запрос.Выполнить().Выбрать();
	КоличествоДоговоров = Выборка.Количество();
	
	Если КоличествоДоговоров = 1 Тогда
		//откроем карточку
		Выборка.Следующий();
		Договор = Выборка.Ссылка;
		Договор.ПолучитьФорму("ФормаЭлемента").Открыть();
	ИначеЕсли КоличествоДоговоров > 1 Тогда
		//Будем показывать список
	Иначе
		//создадим новый
		ДоговорОбъектНового = Справочники.CRM_ДоговорНаПродажуАвтомобиля.СоздатьЭлемент();
		ДоговорОбъектНового.Дата = ТекущаяДата();
		ДоговорОбъектНового.IDK = Объект.IDK;
		ДоговорОбъектНового.Статус = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Расторгнут;
		ДоговорОбъектНового.Наименование = "Договор по РЛ №" + Строка(Объект.IDK);
		ДоговорОбъектНового.Клиент = Объект.Клиент;
		ДоговорОбъектНового.ПолучитьФорму("ФормаЭлемента").Открыть();
	КонецЕсли;
	
КонецПроцедуры // РасторжениеПредварительногоКонтракта()

&НаКлиенте
Процедура ОткрытьICM(Команда)
	
	СправочникСсылка = Неопределено;
	VIN = ВернутьVINПоАвтомобилям();
	Если Не ЗначениеЗаполнено(VIN) тогда
		//DMSREN-715
		Предупреждение("Не установлен VIN автомобиля.");
		
		
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаVIN",
		ЭтотОбъект);	
		
		ПоказатьВопрос(Оповещение,
		"Хотите вводить VIN вручную?",
		РежимДиалогаВопрос.ДаНет,
		0,
		КодВозвратаДиалога.Да, 
		"Проверка VIN" 
		);    
		//DMSREN-715
		Возврат;
	КонецЕсли;	
	
	ТаблицаОТС = Renault_АвтосервисСервер.Renault_ОбработатьОТС(VIN);
	Если ТаблицаОТС.Количество()>0 тогда
	Для Каждого Строка из ТаблицаОТС Цикл
		СправочникСсылка = Справочники.СервисныеКампании.НайтиПоКоду(Строка.НомерОТС);
		Если НЕ ЗначениеЗаполнено(СправочникСсылка) Тогда
			Элемент = Справочники.СервисныеКампании.СоздатьЭлемент();
			Элемент.Код = Строка.НомерОТС;
			Элемент.Наименование = Строка.НаименованиеОТС + " (" + Строка.ИндексЦветОТС + ")";
			Элемент.Комментарий = Строка.ОписаниеОТС + Символы.ПС + "Номер технической ноты: " +Строка(Строка.НомерТехническойНоты);
			Элемент.Записать();
			СправочникСсылка = Элемент.Ссылка; 
		КонецЕсли;
		Запись = РегистрыСведений.ВыполнениеСервисныхКампаний.СоздатьМенеджерЗаписи();
		Запись.VIN = VIN;
		Запись.СервиснаяКампания = СправочникСсылка;
		Запись.Прочитать();
		Если не Запись.Выбран() Тогда
			Запись.Записать();	
		КонецЕсли;
		Renault_АвтосервисСервер.ЗарегистрироватьПроверкуICMВЖурнале(VIN,"Договор купли-продажи",СправочникСсылка);
		КонецЦикла;
	Иначе
		Renault_АвтосервисСервер.ЗарегистрироватьПроверкуICMВЖурнале(VIN,"Договор купли-продажи",СправочникСсылка);
	КонецЕСли;
	ОбновитьДатуICM(Истина);
	
КонецПроцедуры // ОткрытьICM()

&НаКлиенте
Процедура MyRenault(Команда)
	
	Renault_CRM.Воронка_РегистрацияВMyRenault_УстановитьСнять(Объект.IDK);
	Renault_CRM.Статистика_УстановитьСнять(Справочники.CRM_ЭтапыПродаж.РегистрацияВMYRenault, Объект.IDK);
	Воронка_ОбновитьMyRenault();
	
КонецПроцедуры // MyRenault()

&НаКлиенте
Процедура ОткрытьMyRenault(Команда)
	
	Renault_CRM.РегистрацияВMyRenault(Объект.Клиент, Неопределено, Неопределено, Объект.IDK);
	
КонецПроцедуры // ОткрытьMyRenault()

&НаКлиенте
Процедура ОткрытьSara(Команда)
	
	Renault_CRM.РегистрацияВSARA(Объект.Клиент, Неопределено, Неопределено, Объект.IDK);
	
КонецПроцедуры // ОткрытьSara()

&НаКлиенте
Процедура ВыдачаАвтомобиля(Команда)
	
	Если Не ПроверитьСоздатьПосещение("Нет посещения Клиентом дилерского центра. Создать посещение?") Тогда
		//ВазСистем Тарасов 21.12.2020 8:21:53 Инцидент #DMSREN-996
		//{
		//Старый код:
		//Возврат
		//Новый код:
		//}
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_ЗаконтрактованныеАвтомобили.VIN,
	               |	Renault_ЗаконтрактованныеАвтомобили.Регистратор,
	               |	ВЫБОР
	               |		КОГДА Renault_ЗаконтрактованныеАвтомобили.ДатаСнятияРезерва = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Выбран,
	               |	Renault_ЗаконтрактованныеАвтомобили.Автомобиль
	               |ИЗ
	               |	РегистрСведений.Renault_ЗаконтрактованныеАвтомобили.СрезПоследних КАК Renault_ЗаконтрактованныеАвтомобили
	               |ГДЕ
	               |	Renault_ЗаконтрактованныеАвтомобили.РабочийЛист = &РабочийЛист
	               |	И Renault_ЗаконтрактованныеАвтомобили.ДатаСнятияРезерва = ДАТАВРЕМЯ(1, 1, 1)";
	Запрос.УстановитьПараметр("РабочийЛист", Объект.IDK);
	СписокАвтоНаВыдачу = Запрос.Выполнить().Выгрузить();
	
	Если СписокАвтоНаВыдачу.Количество() > 1 Тогда
		Элементы.ГруппаСтраницыИнформации.ТекущаяСтраница = Элементы.ГруппаСтраницаДоговорыСКлиентом;
	Иначе
		//Проверим наличие напоминания
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	CRM_СобытияПоРабочимЛистам.Ссылка
		               |ИЗ
		               |	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
		               |ГДЕ
		               |	CRM_СобытияПоРабочимЛистам.IDK = &IDK
		               |	И CRM_СобытияПоРабочимЛистам.ВидСобытия = &ВидСобытия
		               |	И CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
		               |	И CRM_СобытияПоРабочимЛистам.Объект.Статус <> ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыДокументаЗаписьНаВыдачу.Отменено)
					   |
		               |УПОРЯДОЧИТЬ ПО
		               |	CRM_СобытияПоРабочимЛистам.ДатаНапоминания";
		Запрос.УстановитьПараметр("IDK", Объект.IDK);
		Запрос.УстановитьПараметр("ВидСобытия", Справочники.CRM_ВидыСобытий.Выдача);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			//Откроем форму завершения события
			Событие = Выборка.Ссылка;
			Событие.ПолучитьФорму("ФормаЗавершенияСобытия").Открыть();
		Иначе
			СоздатьЗаписьНаВыдачу();
		КонецЕсли;
	КонецЕсли;
	
	Воронка_ОбновитьВыдачу();	
	
КонецПроцедуры // ВыдачаАвтомобиля()

&НаКлиенте
Процедура ОткрытьСписокВыдач(Команда)
	
	ТекущийЭлемент = Элементы.ДоговорыСКлиентом;
	СменитьСтраницу(Команда);
	
КонецПроцедуры // ОткрытьСписокВыдач()

&НаКлиенте
Процедура РасторжениеДКП(Команда)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CRM_ДоговорНаПродажуАвтомобиля.Ссылка
	|ИЗ
	|	Справочник.CRM_ДоговорНаПродажуАвтомобиля КАК CRM_ДоговорНаПродажуАвтомобиля
	|ГДЕ
	|	CRM_ДоговорНаПродажуАвтомобиля.IDK = &IDK";
	Запрос.УстановитьПараметр("IDK", Объект.IDK);
	Выборка = Запрос.Выполнить().Выбрать();
	КоличествоДоговоров = Выборка.Количество();
	
	Если КоличествоДоговоров = 1 Тогда
		//откроем карточку
		Выборка.Следующий();
		Договор = Выборка.Ссылка;
		Договор.ПолучитьФорму("ФормаЭлемента").Открыть();
	ИначеЕсли КоличествоДоговоров > 1 Тогда
		//Будем показывать список
	Иначе
		//создадим новый
		ДоговорОбъектНового = Справочники.CRM_ДоговорНаПродажуАвтомобиля.СоздатьЭлемент();
		ДоговорОбъектНового.Дата = ТекущаяДата();
		ДоговорОбъектНового.IDK = Объект.IDK;
		ДоговорОбъектНового.Статус = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Расторгнут;
		ДоговорОбъектНового.Наименование = "Договор по РЛ №" + Строка(Объект.IDK);
		ДоговорОбъектНового.Клиент = Объект.Клиент;
		ДоговорОбъектНового.ПолучитьФорму("ФормаЭлемента").Открыть();
	КонецЕсли;
	
КонецПроцедуры // РасторжениеДКП()

&НаКлиенте
Процедура ЗвонокВежливости1(Команда)
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗвонокВежливости3дня;
	Запись.Прочитать();
	
	Если НЕ Запись.Выбран() Тогда
		//Проверим наличие напоминания
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	CRM_СобытияПоРабочимЛистам.Ссылка
		|ИЗ
		|	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
		|ГДЕ
		|	CRM_СобытияПоРабочимЛистам.IDK = &IDK
		|	И CRM_СобытияПоРабочимЛистам.ВидСобытия = &ВидСобытия
		|	И CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания";
		Запрос.УстановитьПараметр("IDK", Объект.IDK);
		Запрос.УстановитьПараметр("ВидСобытия", Справочники.CRM_ВидыСобытий.ЗвонокВежливости3);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			//Откроем форму завершения события
			Событие = Выборка.Ссылка;
			Событие.ПолучитьФорму("ФормаЗавершенияСобытия").Открыть();
		Иначе
			СоздатьЗвонокВежливости3();
		КонецЕсли;
	КонецЕсли;
	
	Воронка_ОбновитьЗвонокВежливости3();
	
КонецПроцедуры // ЗвонокВежливости1()

&НаКлиенте
Процедура ЗвонокВежливости2(Команда)
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗвонокВежливости30Дней;
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		//пока непонятно что делать
	Иначе
		//Проверим наличие напоминания
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	CRM_СобытияПоРабочимЛистам.Ссылка
		|ИЗ
		|	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
		|ГДЕ
		|	CRM_СобытияПоРабочимЛистам.IDK = &IDK
		|	И CRM_СобытияПоРабочимЛистам.ВидСобытия = &ВидСобытия
		|	И CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания";
		Запрос.УстановитьПараметр("IDK", Объект.IDK);
		Запрос.УстановитьПараметр("ВидСобытия", Справочники.CRM_ВидыСобытий.ЗвонокВежливости30);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			//Откроем форму завершения события
			Событие = Выборка.Ссылка;
			Событие.ПолучитьФорму("ФормаЗавершенияСобытия").Открыть();
		Иначе
			СоздатьЗвонокВежливости30();
		КонецЕсли;
	КонецЕсли;
	
	Воронка_ОбновитьЗвонокВежливости30();
	
КонецПроцедуры // ЗвонокВежливости2()

&НаКлиенте
Процедура ЗвонокВежливости3(Команда)
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;	
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗвонокВежливости360Дней;
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		//пока непонятно что делать
		//Renault_CRM.Воронка_ЗвонокВежливости3дня_УстановитьСнять(IDK);
	Иначе
		//Проверим наличие напоминания
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	CRM_СобытияПоРабочимЛистам.Ссылка
		|ИЗ
		|	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
		|ГДЕ
		|	CRM_СобытияПоРабочимЛистам.IDK = &IDK
		|	И CRM_СобытияПоРабочимЛистам.ВидСобытия = &ВидСобытия
		|	И CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания";
		Запрос.УстановитьПараметр("IDK", Объект.IDK);
		Запрос.УстановитьПараметр("ВидСобытия", Справочники.CRM_ВидыСобытий.ЗвонокВежливости360);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			//Откроем форму завершения события
			Событие = Выборка.Ссылка;
			Событие.ПолучитьФорму("ФормаЗавершенияСобытия").Открыть();
		Иначе
			СоздатьЗвонокВежливости360();
		КонецЕсли;
	КонецЕсли;
	
	Воронка_ОбновитьЗвонокВежливости360();
	
КонецПроцедуры // ЗвонокВежливости3()

// Беседин 19.10.21 заявка 1082
&НаКлиенте
Процедура ЗвонокВежливостиНов(Команда)
	
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗвонокВежливостиНовый;
	Запись.Прочитать();
	
	Если НЕ Запись.Выбран() Тогда
		//Проверим наличие напоминания
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	CRM_СобытияПоРабочимЛистам.Ссылка
		|ИЗ
		|	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
		|ГДЕ
		|	CRM_СобытияПоРабочимЛистам.IDK = &IDK
		|	И CRM_СобытияПоРабочимЛистам.ВидСобытия = &ВидСобытия
		|	И CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания";
		Запрос.УстановитьПараметр("IDK", Объект.IDK);
		Запрос.УстановитьПараметр("ВидСобытия", Справочники.CRM_ВидыСобытий.ЗвонокВежливостиНовый);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			//Откроем форму завершения события
			Событие = Выборка.Ссылка;
			Событие.ПолучитьФорму("ФормаЗавершенияСобытия").Открыть();
		Иначе
			СоздатьЗвонокВежливостиНов();
		КонецЕсли;
	КонецЕсли;
	
	Воронка_ОбновитьЗвонокВежливостиНов();
	
КонецПроцедуры // ЗвонокВежливостиНов()


&НаКлиенте
Процедура ЗвонокВежливостиДР(Команда)
	
	СтрокаЗВ = Объект.ДилерскийЦентр.ЗвонкиВежливости.Найти("Звонок ДР", "ЗвонокНомер");
	Выход = Ложь;
	Если СтрокаЗВ <> Неопределено Тогда
		Если НЕ СтрокаЗВ.ДелатьЗвонок Тогда
			Выход = Истина;
		КонецЕсли;		
	Иначе
		Выход = Истина;
	КонецЕсли;
	
	Если Выход Тогда
		Элементы.ЗвонокВежливостиДР.Доступность = Ложь;
		Возврат;
	Иначе
		Элементы.ЗвонокВежливостиДР.Доступность = Истина;
	КонецЕсли;	
	
	КлиентДатаРождения = Объект.Клиент.ДатаРождения;
	Если ЗначениеЗаполнено(КлиентДатаРождения) Тогда
		ДатаЗвонкаДР = Документы.CRM_СобытияПоРабочимЛистам.ПолучитьБлижайшуюДатуДР(КлиентДатаРождения); 		
				
		Если ЗначениеЗаполнено(ДатаЗвонкаДр) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			               |	CRM_СобытияПоРабочимЛистам.Ссылка
			               |ИЗ
			               |	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
			               |ГДЕ
			               |	CRM_СобытияПоРабочимЛистам.IDK = &РабочийЛист
			               |	И CRM_СобытияПоРабочимЛистам.ВидСобытия = ЗНАЧЕНИЕ(Справочник.CRM_ВидыСобытий.ЗвонокВежливостиДР)
			               |	И CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
			               |	И CRM_СобытияПоРабочимЛистам.ДатаНапоминания = &ДатаНапоминания
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	CRM_СобытияПоРабочимЛистам.ДатаНапоминания";
			Запрос.УстановитьПараметр("РабочийЛист", Объект.IDK);
			Запрос.УстановитьПараметр("ДатаНапоминания", ДатаЗвонкаДР);
			Результат = Запрос.Выполнить();
				
			Если НЕ Результат.Пустой() Тогда
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				
				Событие = Выборка.Ссылка;
				ФормаСобытия = Событие.ПолучитьФорму("ФормаЗавершенияСобытия");
				ФормаСобытия.ЭлементыФормы.КнопкаПеренести.Доступность = Ложь;
				ФормаСобытия.Открыть();
			Иначе
				ВопросПользователю = Вопрос("Назначить звонок вежливости на дату - " + ДатаЗвонкаДР + "?", РежимДиалогаВопрос.ДаНет);
				
				Если ВопросПользователю = КодВозвратаДиалога.Да Тогда
					СобытиеОбъект = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
					СобытиеОбъект.IDK = Объект.IDK;
					СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.ЗвонокВежливостиДР;
					СобытиеОбъект.Сотрудник = Объект.Сотрудник;
					СобытиеОбъект.Отдел = Объект.Отдел;
					СобытиеОбъект.ДилерскийЦентр = Объект.ДилерскийЦентр;
					СобытиеОбъект.Подразделение = Объект.Подразделение;
					СобытиеОбъект.Автор = ПараметрыСеанса.Пользователь.Сотрудник;
					СобытиеОбъект.Дата = ТекущаяДата();
					СобытиеОбъект.ДатаНапоминания = ДатаЗвонкаДР;
					СобытиеОбъект.Комментарий = "Звонок на день рождения";
					СобытиеОбъект.Обработано = Ложь;
					СобытиеОбъект.ЗавершеноУспешно = Ложь;
					СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);	
					
					Сообщить("Назначен звонок на день рождения, на дату - " + Формат(ДатаЗвонкаДР, "ДЛФ=D") + ".");
				КонецЕсли;				
			КонецЕсли;				
		Иначе
			Сообщить("Не определена дата звонка!");
		КонецЕсли;
	Иначе
		Сообщить("Не заполнена дата рождения у клиента!");
	КонецЕсли;
	
	Воронка_ОбновитьЗвонокВежливостиДР();
	
КонецПроцедуры // ЗвонокВежливостиДР()

&НаКлиенте
Процедура ПредварительныйКонтракт(Команда)
	
	
	
КонецПроцедуры // ПредварительныйКонтракт()

&НаКлиенте
Процедура ВзятТелефонТрейдИн(Команда)
	
	Форма = Объект.Ссылка.ПолучитьФорму("ФормаВводаТелефона", ЭтаФорма);
	Форма.ТелефонПоУмолчанию = Объект.Телефон;
	Форма.Клиент = Объект.Клиент;
	Объект.Телефон = Форма.ОткрытьМодально();
	Объект.Телефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(Объект.Клиент);
	СохранитьДанныеКлиентаПриСменеТелефона(Истина); 	
	
КонецПроцедуры // ВзятТелефонТрейдИн()

&НаКлиенте
Процедура ВзятEmailТрейдИн(Команда)
	
	Форма = Объект.Ссылка.ПолучитьФорму("ФормаВводаEmail", ЭтаФорма);
	Форма.EmailПоУмолчанию = Объект.Email;
	Форма.Клиент = Объект.Клиент;
	Объект.Email = Форма.ОткрытьМодально();
	Объект.Email = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(Объект.Клиент);
	СохранитьДанныеКлиентаПриСменеEmail(Истина);
	
КонецПроцедуры // ВзятEmailТрейдИн()

&НаКлиенте
Процедура ЗаполнениеИнформацииОбАвтомобилеТрейдИн(Команда)
	
	Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн) Тогда
		 
		ПараметрыОткрытияФормы = Новый Структура();	
		ПараметрыОткрытияФормы.Вставить("Сессия", СессияТрейдИн);
		ПараметрыОткрытияФормы.Вставить("ЗаявкаНаТрейдИн", ЗаявкаНаТрейдИн);
		ПараметрыОткрытияФормы.Вставить("Производитель", ПроизводительТрейдИн);
		ПараметрыОткрытияФормы.Вставить("ГодВыпуска", ГодВыпускаТрейдИн);
		ПараметрыОткрытияФормы.Вставить("Модель", МодельТрейдИн);
		
		Форма = Объект.Ссылка.ПолучитьФорму("ФормаРаботыСТрейдИн");
		
		Форма.IDРабочегоЛиста = Объект.ID;
		Форма.Отдел = Объект.Отдел;
		
		Форма.ПараметрыОткрытия = ПараметрыОткрытияФормы;
		Форма.Открыть(); 
	Иначе
		Сообщить("Не создана заявка на трейд-ин!");
	КонецЕсли;
	
КонецПроцедуры // ЗаполнениеИнформацииОбАвтомобилеТрейдИн()

&НаКлиенте
Процедура ПредварительнаяОценкаТрейдИн(Команда)
	
	Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн) Тогда
		Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн.Автомобиль) Тогда
			ДокументПредварительнаяОценка = АктуальныйДокументПредварительнойОценки();
			
			ДокументОбъект = Неопределено;
			Если ЗначениеЗаполнено(ДокументПредварительнаяОценка) Тогда
				ВопросПользователю = Вопрос("Найден актуальный документ предварительной оценки, открыть его (да) или создать новый (нет)?", РежимДиалогаВопрос.ДаНет);
				
				Если ВопросПользователю = КодВозвратаДиалога.Да Тогда
						ДокументОбъект = ДокументПредварительнаяОценка.ПолучитьОбъект();
				КонецЕсли;
			КонецЕсли;
			
			Если ДокументОбъект = Неопределено Тогда
				ДокументОбъект = Документы.Renault_ПредварительнаяОценкаАвтомобиляТрейдИн.СоздатьДокумент();
				ДокументОбъект.ЗаявкаНаТрейдИн = ЗаявкаНаТрейдИн;
				ДокументОбъект.Дата = ТекущаяДата();
			КонецЕсли;
			
			ФормаДокумента = ДокументОбъект.ПолучитьФорму("ФормаДокумента");
			ФормаДокумента.ДокументЗаполняетсяИзРабочегоЛиста = Истина;
			ФормаДокумента.Сессия = СессияТрейдИн;
			ФормаДокумента.ПараметрыОповещения = Новый Структура("ЭтоВыбор", Ложь);
			ФормаДокумента.Открыть();		
		Иначе
			Сообщить("Необходимо внести данные по автомобилю!");			
		КонецЕсли;		
	Иначе
		Сообщить("Не выбрана заявка на трейд-ин!");
	КонецЕсли;
	
КонецПроцедуры // ПредварительнаяОценкаТрейдИн()

&НаКлиенте
Процедура ОткрытьСписокПредварительныхОценокТрейдИн(Команда)
	
	Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн) Тогда
		ФормаВыбора = Документы.Renault_ПредварительнаяОценкаАвтомобиляТрейдИн.ПолучитьФормуВыбора("ФормаВыбора");
		ФормаВыбора.Отбор.ЗаявкаНаТрейдИн.ВидСравнения = ВидСравнения.Равно;
		ФормаВыбора.Отбор.ЗаявкаНаТрейдИн.Значение = ЗаявкаНаТрейдИн;
		ФормаВыбора.Отбор.ЗаявкаНаТрейдИн.Использование = Истина;
		ФормаВыбора.ЭлементыФормы.ДокументСписок.НастройкаОтбора.ЗаявкаНаТрейдИн.Доступность = Ложь;

		ДокументПредварительнаяОценка = ФормаВыбора.ОткрытьМодально();
		
		Если НЕ ЗначениеЗаполнено(ДокументПредварительнаяОценка) Тогда
			Возврат;
		КонецЕсли;
				
		ФормаПредварительнаяОценка = ДокументПредварительнаяОценка.ПолучитьФорму("ФормаДокумента");
		ФормаПредварительнаяОценка.ДокументЗаполняетсяИзРабочегоЛиста = Истина;
		ФормаПредварительнаяОценка.ПараметрыОповещения = Новый Структура("ЭтоВыбор", Истина);
		ФормаПредварительнаяОценка.Сессия = СессияТрейдИн;
		ФормаПредварительнаяОценка.Открыть();				
	Иначе
		Сообщить("Не выбрана заявка на трейд-ин.");
	КонецЕсли;	
	
КонецПроцедуры // ОткрытьСписокПредварительныхОценокТрайдИн()

&НаКлиенте
Процедура ВизуальныйОсмотрТрейдИн(Команда)
	
	  Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн) Тогда
		Автомобиль = ЗаявкаНаТрейдИн.Автомобиль;
				
		Если НЕ ЗначениеЗаполнено(Автомобиль) Тогда
			Сообщить("В заявке на трейд-ин не указан автомобиль!");
			Возврат;
		КонецЕсли;		
				
		Форма = Объект.Ссылка.ПолучитьФорму("ФормаРаботыСТрейдИн");
		
		Форма.IDРабочегоЛиста = Объект.ID;
		Форма.IDK = Объект.IDK;
		Форма.Отдел = Объект.Отдел;
		
		Форма.ПараметрыОткрытия = ЗаявкаНаТрейдИн;
		Форма.Открыть();		
	Иначе
		Сообщить("Не выбрана заявка на трейд-ин!");	
	КонецЕсли;
	
КонецПроцедуры // ВизуальныйОсмотрТрейдИн()

&НаКлиенте
Процедура ОценкаСервисомТрейдИн(Команда)
	
	Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн) Тогда
		Если Не ЗначениеЗаполнено(ЗаявкаНаТрейдИн.ДилерскийЦентр) Тогда
			Предупреждение("Необходимо указать дилерский центр");
			Возврат;
		КонецЕсли;
	
		Если Не ЗначениеЗаполнено(ЗаявкаНаТрейдИн.Клиент) Тогда
			Предупреждение("Необходимо указать клиента");
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ЗаявкаНаТрейдИн.Автомобиль) Тогда
			Предупреждение("Необходимо указать автомобиль");
			Возврат;
		КонецЕсли;
		
		Если ТипЗнч(ЗаявкаНаТрейдИн.Клиент) = Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты") Тогда
			Ответ = Вопрос("Для записи автомобиля на диагоностику клиент должен быть контрагентом. " + Символы.ПС + "Вы хотите перевести потенциального клиента в контрагенты?", РежимДиалогаВопрос.ДаНет ,,, "Вопрос");
			
			Если Ответ <> КодВозвратаДиалога.Да Тогда
				Возврат;
			КонецЕсли;
			
			ТекКлиент = ЗаявкаНаТрейдИн.Клиент;
			Если обЗначениеНеЗаполнено(ТекКлиент.Фамилия) И обЗначениеНеЗаполнено(ТекКлиент.Имя) И обЗначениеНеЗаполнено(ТекКлиент.Отчество) Тогда
				Ошибки = "Одно из полей ФИО должно быть заполнено. Заполните ФИО.";
				Сообщить(Ошибки, СтатусСообщения.Важное);
				Возврат;
			КонецЕсли;
			
			ЗаявкаНаТрейдИнОбъект = ЗаявкаНаТрейдИн.ПолучитьОбъект();
			ЗаявкаНаТрейдИнОбъект.Клиент = CRM_Редубликация.СоздатьКонтрагентаНаОснованииПотенциальногоКлиента(ЗаявкаНаТрейдИн.Клиент);			
			ЗаявкаНаТрейдИнОбъект.Записать();
			
			Запись = РегистрыСведений.Renault_КлиентыНаЗамену.СоздатьМенеджерЗаписи();
			Запись.Клиент = ЗаявкаНаТрейдИн.Клиент;
			Запись.Записать();	
							
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	CRM_Договор.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.Renault_Договор КАК CRM_Договор
			|ГДЕ
			|	CRM_Договор.РабочийЛист = &IDK
			|	И НЕ CRM_Договор.ПометкаУдаления
			|
			|УПОРЯДОЧИТЬ ПО
			|	CRM_Договор.Дата УБЫВ";
			Запрос.УстановитьПараметр("IDK", Объект.СвязаныйIDK);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Если НЕ Выборка.Ссылка.КлиентДоговораОтличаетсяОтКлиентаРЛ Тогда
					ДоговорДок = Выборка.Ссылка.ПолучитьОбъект();
					ДоговорДок.Клиент = ЗаявкаНаТрейдИн.Клиент;
			        ДоговорДок.КлиентДоговора = ЗаявкаНаТрейдИн.Клиент;
					ДоговорДок.DMS_ДоговорВзаиморасчетов = CRM_Редубликация.НайтиСоздатьДоговорВзаиморасчетов(ЗаявкаНаТрейдИн.Клиент, Выборка.Ссылка);
					Попытка
						ДоговорДок.Записать();
					Исключение
					КонецПопытки;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Оповестить("ОбновитьРабочийЛистПослеЗаписиКонтрагента");
			Объект.Клиент = ЗаявкаНаТрейдИн.Клиент;
			Если ЗначениеЗаполнено(Объект.СвязаныйIDK) тогда
				СвязаныйIDKДок =  Документы.Renault_РабочийЛист.НайтиПоРеквизиту("IDK",Объект.СвязаныйIDK);
				Если СвязаныйIDKДок <>  Документы.Renault_РабочийЛист.ПустаяСсылка() тогда
					
					СвязаныйIDKОбъект =   СвязаныйIDKДок.ПолучитьОбъект();
					СвязаныйIDKОбъект.Клиент = ЗаявкаНаТрейдИн.Клиент;
					СвязаныйIDKОбъект.Записать();
				КонецЕсли;
			КонецЕсли;	
			ОбновитьКнопкиТипКлиента();

		КонецЕсли; 
		
		СоздатьОбращениеВСервис();		
				
	Иначе
		Сообщить("Не выбрана заявка на трейд-ин!");	
	КонецЕсли;
	
КонецПроцедуры // ОценкаСервисомТрейдИн()

&НаКлиенте
Процедура ПроверкаЮрЧистотыТрейдИн(Команда)
	
	Возврат; // Так как функция находятся в разработке.
	
	Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн) Тогда	
		ЭтапПроверкаЮридическойЧистоты = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнПроверкаЮридическойЧистоты;
		
		Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
		Запись.IDK = Объект.IDK;	
		Запись.ЭтапПродаж = ЭтапПроверкаЮридическойЧистоты;
		Запись.Прочитать();
		
		Если Не Запись.Выбран() Тогда
			ТекущаяДата = ТекущаяДата();
			ТекСотрудник = DMS_ОбращенияКлиентов.ВернутьТекущегоСотрудника();
			
			Событие = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
			Событие.IDK = Объект.IDK;
			Событие.Дата = ТекущаяДата;
			Событие.Автор = ТекСотрудник;
			Событие.ВидСобытия = Справочники.CRM_ВидыСобытий.Прочее;
			Событие.Комментарий = "Проверка юридической чистоты по трейд-ин";
			Событие.ДатаНапоминания = ТекущаяДата;
			Событие.ДатаЗакрытия = ТекущаяДата;
			Событие.КомментарийЗакрытия = "Выполнено";
			Событие.АвторЗакрытия = ТекСотрудник;
			Событие.Сотрудник = ЗаявкаНаТрейдИн.МенеджерЗаявитель;
			Событие.ДилерскийЦентр = Объект.ДилерскийЦентр;
			Событие.Записать();
			
			Запись.IDK = Объект.IDK;
			Запись.Объект = ЗаявкаНаТрейдИн;
			Запись.ЭтапПродаж = ЭтапПроверкаЮридическойЧистоты; 
			Запись.ДилерскийЦентр = Объект.ДилерскийЦентр;
			Запись.ДатаВыполнения = ТекущаяДата;
			Запись.Записать();
		КонецЕсли;	
		
		ОбновитьВоронкуИСпискиТрейдИн(); 		
	Иначе
		Сообщить("Не выбрана заявка на трейд-ин!");	
	КонецЕсли;
	
КонецПроцедуры // ПроверкаЮрЧистотыТрейдИн()

&НаКлиенте
Процедура КалькуляцияТрейдИн(Команда, ВнешнийВызовЗаявкаНаТрейдИн=Неопределено, ВнешниййВызовIDK=Неопределено)
	
	Если ВнешнийВызовЗаявкаНаТрейдИн <> Неопределено Тогда
		ЗаявкаНаТрейдИн = ВнешнийВызовЗаявкаНаТрейдИн; 
	КонецЕсли;
	
	Если ВнешниййВызовIDK <> Неопределено Тогда
		Объект.IDK = ВнешниййВызовIDK; 
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн) Тогда
		Автомобиль = ЗаявкаНаТрейдИн.Автомобиль;
		Клиент = ЗаявкаНаТрейдИн.Клиент;
		
		Если НЕ ЗначениеЗаполнено(Автомобиль) Тогда
			Сообщить("В заявке на трейд-ин не указан автомобиль!");
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Клиент) Тогда
			Сообщить("В заявке на трейд-ин не указан клиент!");
			Возврат;
		КонецЕсли;	
		
		Калькуляция = СоздатьКалькуляцию();
				
		Если ЗначениеЗаполнено(Калькуляция)Тогда
			ПересчитатьСтоимостьВосстановления();
			
			ЭтапСозданиеКалькуляции = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнКалькуляция;
			
			Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
			Запись.IDK = Объект.IDK;	
			Запись.ЭтапПродаж = ЭтапСозданиеКалькуляции;
			Запись.Прочитать();
			
			Если Не Запись.Выбран() Тогда
				ТекущаяДата = ТекущаяДата();
				ТекСотрудник = DMS_ОбращенияКлиентов.ВернутьТекущегоСотрудника();
				
				Событие = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
				Событие.IDK = Объект.IDK;
				Событие.Дата = ТекущаяДата;
				Событие.Автор = ТекСотрудник;
				Событие.ВидСобытия = Справочники.CRM_ВидыСобытий.Прочее;
				Событие.Комментарий = "Создание калькуляции по трейд-ин";
				Событие.ДатаНапоминания = ТекущаяДата;
				Событие.ДатаЗакрытия = ТекущаяДата;
				Событие.КомментарийЗакрытия = "Выполнено";
				Событие.АвторЗакрытия = ТекСотрудник;
				Событие.Сотрудник = ЗаявкаНаТрейдИн.МенеджерЗаявитель;
				Событие.ДилерскийЦентр = Объект.ДилерскийЦентр;
				Событие.Записать();
				
				Запись.IDK = Объект.IDK;
				Запись.Объект = ЗаявкаНаТрейдИн;
				Запись.ЭтапПродаж = ЭтапСозданиеКалькуляции; 
				Запись.ДилерскийЦентр = Объект.ДилерскийЦентр;
				Запись.ДатаВыполнения = ТекущаяДата;
				Запись.Записать();
			КонецЕсли;
			
			ОбновитьВоронкуИСпискиТрейдИн();
		КонецЕсли;		 		
	Иначе
		Сообщить("Не выбрана заявка на трейд-ин!");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокКалькуляцийТрейдИн(Команда)
	
	Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн) Тогда
		Заявки = НайтиЗаявки();

		Если Заявки.Количество() > 1 Тогда			
			Форма = ПолучитьОбщуюФорму("Renault_ФормаВыбораПлиткой");
			СписокВыбора = Новый СписокЗначений;
				
			СписокВыбора.ЗагрузитьЗначения(Заявки.ВыгрузитьКолонку("Заявка"));
				
			Форма.Заголовок = "Выберите в какую заявку добавляем.";
			Форма.СписокВыбора = СписокВыбора;
			
			Заявка = Форма.ОткрытьМодально();
			Если НЕ ЗначениеЗаполнено(Заявка) Тогда
				Предупреждение("Не выбрана заявка!");
				Возврат;
			КонецЕсли; 				
		ИначеЕсли Заявки.Количество() = 1 Тогда		
			Заявка = Заявки[0].Заявка;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(Заявка) Тогда 		
			Сообщить("Нет заявки в автосервис!");
			Возврат;		
		КонецЕсли;
	
		Калькуляции = ПолучитьКалькуляцииПоЗаявке(Заявка); 
		
		Если Калькуляции.Количество() > 0 Тогда
			ФормаВыбора = Документы.Renault_Калькуляция.ПолучитьФормуВыбора();
			ФормаВыбора.Отбор.Ссылка.ВидСравнения = ВидСравнения.ВСписке;
			ФормаВыбора.Отбор.Ссылка.Значение = Калькуляции;
			ФормаВыбора.Отбор.Ссылка.Использование = Истина;
			ФормаВыбора.ЭлементыФормы.ДокументСписок.НастройкаОтбора.Ссылка.Доступность = Ложь;

			Калькуляция = ФормаВыбора.ОткрытьМодально();
			
			Если НЕ ЗначениеЗаполнено(Калькуляция) Тогда
				Возврат;
			КонецЕсли;
					
			ФормаКалькуляции = Калькуляция.ПолучитьФорму("ФормаДокумента");
			ФормаКалькуляции.ОткрытьМодально();
		Иначе
			Сообщить("Калькуляции не найдены!");
		КонецЕсли;		 			
	Иначе
		Сообщить("Не выбрана заявка на трейд-ин.");
	КонецЕсли;
	
КонецПроцедуры // ОткрытьСписокКалькуляцийТрейдИн()

&НаКлиенте
Процедура ПредложениеВыкупаТрейдИн(Команда)
	
	Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн) Тогда
		Автомобиль = ЗаявкаНаТрейдИн.Автомобиль;
		Клиент = ЗаявкаНаТрейдИн.Клиент;
		
		Если НЕ ЗначениеЗаполнено(Автомобиль) Тогда
			Сообщить("В заявке на трейд-ин не указан автомобиль!");
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Клиент) Тогда
			Сообщить("В заявке на трейд-ин не указан клиент!");
			Возврат;
		КонецЕсли;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Renault_ПредложениеВыкупаАвтомобиляТрейдИн.Ссылка
		|ИЗ
		|	Документ.Renault_ПредложениеВыкупаАвтомобиляТрейдИн КАК Renault_ПредложениеВыкупаАвтомобиляТрейдИн
		|ГДЕ
		|	Renault_ПредложениеВыкупаАвтомобиляТрейдИн.ЗаявкаНаТрейдИн = &ЗаявкаНаТрейдИн
		|
		|УПОРЯДОЧИТЬ ПО
		|	Renault_ПредложениеВыкупаАвтомобиляТрейдИн.Дата УБЫВ";
		Запрос.УстановитьПараметр("ЗаявкаНаТрейдИн", ЗаявкаНаТрейдИн);
		Результат = Запрос.Выполнить();
		
		ЕстьПредложениеВыкупа = Не Результат.Пустой();
			
		Если ЕстьПредложениеВыкупа Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			ДокументПредложениеВыкупа = Выборка.Ссылка.ПолучитьОБъект();
		Иначе
			ДокументПредложениеВыкупа = Документы.Renault_ПредложениеВыкупаАвтомобиляТрейдИн.СоздатьДокумент();
			ДокументПредложениеВыкупа.Дата = ТекущаяДата();
			ДокументПредложениеВыкупа.ЗаявкаНаТрейдИн = ЗаявкаНаТрейдИн;
		КонецЕсли;
				
		ФормаДокумента = ДокументПредложениеВыкупа.ПолучитьФорму("ФормаДокумента");
		ФормаДокумента.ДокументЗаполняетсяИзРабочегоЛиста = Истина;
		ФормаДокумента.Открыть();
	Иначе
		Сообщить("Не выбрана заявка на трейд-ин!");	
	КонецЕсли;
	
КонецПроцедуры // ПредложениеВыкупаТрейдИн()

&НаКлиенте
Процедура ОткрытьСписокПредложенийВыкупаТрейдИн(Команда)
	
	Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн) Тогда
		ФормаВыбора = Документы.Renault_ПредложениеВыкупаАвтомобиляТрейдИн.ПолучитьФормуВыбора("ФормаВыбора");
		ФормаВыбора.Отбор.ЗаявкаНаТрейдИн.ВидСравнения = ВидСравнения.Равно;
		ФормаВыбора.Отбор.ЗаявкаНаТрейдИн.Значение = ЗаявкаНаТрейдИн;
		ФормаВыбора.Отбор.ЗаявкаНаТрейдИн.Использование = Истина;
		ФормаВыбора.ЭлементыФормы.ДокументСписок.НастройкаОтбора.ЗаявкаНаТрейдИн.Доступность = Ложь;

		ДокументПредложениеВыкупа = ФормаВыбора.ОткрытьМодально();
		
		Если НЕ ЗначениеЗаполнено(ДокументПредложениеВыкупа) Тогда
			Возврат;
		КонецЕсли;
				
		ФормаПредложениеВыкупа = ДокументПредложениеВыкупа.ПолучитьФорму("ФормаДокумента");
		ФормаПредложениеВыкупа.ДокументЗаполняетсяИзРабочегоЛиста = Истина;
		ФормаПредложениеВыкупа.ОткрытьМодально(); 			
	Иначе
		Сообщить("Не выбрана заявка на трейд-ин.");
	КонецЕсли;
	
КонецПроцедуры // ОткрытьСписокПредложенийВыкупаТрейдИн()

&НаКлиенте
Процедура ДоговорСКлиентомТрейдИн(Команда)
	
	Если Не ЗначениеЗаполнено(ЗаявкаНаТрейдИн) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Клиент) Тогда
		Сообщить("Для принятия автомобиля по Trade-in должен быть указан клиент.");
	КонецЕсли;
	
	Если ТипЗнч(Объект.Клиент) = Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты") Тогда
		
		Ответ = Вопрос("Для принятия автомобиля по Trade-in клиент должен быть контрагентом. "+Символы.ПС+"Вы хотите перевести потенциального клиента в контрагенты?",РежимДиалогаВопрос.ДаНет,,,"Вопрос");
		
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
		
		Клиент = CRM_Редубликация.СоздатьКонтрагентаНаОснованииПотенциальногоКлиента(Объект.Клиент);
		Объект.Клиент = Клиент;
		//ЭтаФорма.Записать();
		Запись = РегистрыСведений.Renault_КлиентыНаЗамену.СоздатьМенеджерЗаписи();
		Запись.Клиент = Клиент;
		Запись.Записать();
		ЗаявкаОб = ЗаявкаНаТрейдИн.ПолучитьОбъект();
		ЗаявкаОб.Клиент = Клиент;
		ЗаявкаОб.Записать();
		
		ЗаявкаНаТрейдИн = ЗаявкаОб.ССылка;
	КонецЕсли;
	
	Ошибки = "";
	
	Поступление = Renault_СПробегомКлиент.ОформитьПокупкуАвтомобиля(ЗаявкаНаТрейдИн, Ошибки);
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		Предупреждение(Ошибки);
		Возврат;
	КонецЕсли;
	
	Если Поступление = Документы.ПоступлениеАвтомобилей.ПустаяСсылка() Тогда
		Возврат;
	КонецЕсли;
	
	Поступление.ПолучитьФорму().ОткрытьМодально();
	Попытка
		Набор = РегистрыСведений.ЦеныАвтомобилей.СоздатьНаборЗаписей();
	 	Набор.Отбор.Регистратор.Установить(Поступление.Ссылка);
		СтрНабор = Набор.Добавить();
		СтрНабор.Регистратор = Поступление.Ссылка;
		СтрНабор.Период=Поступление.Дата;
		СтрНабор.ТипЦен=Справочники.ТипыЦен.ОсновнойТипЦенПродажи;
		СтрНабор.Автомобиль=ЗаявкаНаТрейдИн.Автомобиль;
		СтрНабор.Цена=ЗаявкаНаТрейдИн.ОриентировочнаяЦенаСреднее;
		Набор.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	Если ЗначениеЗаполнено(Поступление.ДатаОперации) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	CRM_ДополнительнаяИнформацияПоАвтомобилям.КодАвтомобиляВыкупа КАК ПорядковыйНомер
		|ИЗ
		|	РегистрСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям КАК CRM_ДополнительнаяИнформацияПоАвтомобилям
		|ГДЕ
		|	ПОДСТРОКА(CRM_ДополнительнаяИнформацияПоАвтомобилям.КодАвтомобиляВыкупа, 2, 4) = &BIR
		|	И CRM_ДополнительнаяИнформацияПоАвтомобилям.Автомобиль = &Автомобиль";
		
		BIR = ЗаявкаНаТрейдИн.ДилерскийЦентр.BIR;
		Автомобиль = ЗаявкаНаТрейдИн.Автомобиль;
		
		Запрос.УстановитьПараметр("BIR", Прав(BIR, 4));
		Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			КодифицироватьАвтомобиль(Автомобиль, Поступление.ДатаОперации, BIR, ЗаявкаНаТрейдИн.ТипОперацииTradeIn);
		КонецЕсли;
		
	КонецЕсли;
		
	Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = Объект.IDK;
	Запись.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнДоговорСКлиентом;
	Запись.ДатаВыполнения = ТекущаяДата();
	Запись.Записать();
	
	ЗаявкаОб = ЗаявкаНаТрейдИн.ПолучитьОбъект();
	ЗаявкаОб.Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.ОформлениеЗавершено;
	ЗаявкаОб.Записать();
	
	//проверим является ли поступивший автомобиль законтрактованым ранее, если да снимем с него резерв	
	Если ЗаявкаНаТрейдИн.Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.ОформлениеЗавершено Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ЗаконтрактованныеАвтомобили.Период,
		|	Renault_ЗаконтрактованныеАвтомобили.VIN,
		|	Renault_ЗаконтрактованныеАвтомобили.Автомобиль,
		|	Renault_ЗаконтрактованныеАвтомобили.РабочийЛист,
		|	Renault_ЗаконтрактованныеАвтомобили.Регистратор
		|ИЗ
		|	РегистрСведений.Renault_ЗаконтрактованныеАвтомобили КАК Renault_ЗаконтрактованныеАвтомобили
		|ГДЕ
		|	Renault_ЗаконтрактованныеАвтомобили.Автомобиль = &Автомобиль
		|	И Renault_ЗаконтрактованныеАвтомобили.ДатаСнятияРезерва = ДАТАВРЕМЯ(1, 1, 1)";
		   
		Запрос.УстановитьПараметр("Автомобиль", ЗаявкаНаТрейдИн.Автомобиль);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДоговорРегистратор = Выборка.Регистратор;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДоговорРегистратор) Тогда
			НаборЗаписейРезервы = РегистрыСведений.Renault_ЗаконтрактованныеАвтомобили.СоздатьНаборЗаписей();
			НаборЗаписейРезервы.Отбор.Регистратор.Установить(ДоговорРегистратор);
			НаборЗаписейРезервы.Прочитать();
			Для Каждого Запись ИЗ НаборЗаписейРезервы Цикл
				Запись.ДатаСнятияРезерва = ТекущаяДата(); 
			КонецЦикла;
			НаборЗаписейРезервы.Записать();
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьВоронкуИСпискиТрейдИн();
	
КонецПроцедуры // ДоговорСКлиентомТрейдИн()

#КонецОбласти

#Область ОбработчкиКомандФормы

&НаКлиенте
Процедура СменитьСтраницу(Команда)
	
	ИмяПредыдущейКнопки = СтрЗаменить(Элементы.ГруппаСтраницыИнформации.ТекущаяСтраница.Имя, "ГруппаСтраница", "");
	Элементы[ИмяПредыдущейКнопки].ЦветФона 	= ЦветСерый;
	Элементы[ИмяПредыдущейКнопки].ЦветРамки = ЦветСерый;
	
	ИмяТекущейКнопки = ЭтаФорма.ТекущийЭлемент.Имя;
	Элементы[ИмяТекущейКнопки].ЦветФона 	= ЦветРено;
	Элементы[ИмяТекущейКнопки].ЦветРамки 	= ЦветРено;
	
	Элементы.ГруппаСтраницыИнформации.ТекущаяСтраница = Элементы["ГруппаСтраница" + ИмяТекущейКнопки];
	
КонецПроцедуры // СменитьСтраницу()

&НаКлиенте
Процедура ВыбратьЭлемент(Команда)
	
	ИмяЭлемента = СтрЗаменить(ТекущийЭлемент.Имя, "Выбрать", "");
	ПутьКДанным = ПолучитьПутьКДаннымЭлемента(ИмяЭлемента);
	ИмяФормыВыбора = ПолучитьИмяФормыВыбораЭлемента(ПутьКДанным);
	
	ФормаВыбора = ПолучитьФорму(ИмяФормыВыбора);
	ВыбранноеЗначение = ФормаВыбора.ОткрытьМодально();
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		
		Если Лев(ПутьКДанным, 7) = "Объект." Тогда
			Объект[СтрЗаменить(ПутьКДанным, "Объект.", "")] = ВыбранноеЗначение;
		Иначе
			ЭтаФорма[ПутьКДанным] = ВыбранноеЗначение;
		КонецЕсли;
		
		Если ПутьКДанным = "Клиент_ФИО" ИЛИ ПутьКДанным = "Клиент_Корпоративный" Тогда
			Объект.Клиент = ВыбранноеЗначение;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ВыбратьЭлемент()

&НаКлиенте
Процедура ОткрытьЭлемент(Команда)
	
	ИмяЭлемента = СтрЗаменить(ТекущийЭлемент.Имя, "Открыть", "");
	ПутьКДанным = ПолучитьПутьКДаннымЭлемента(ИмяЭлемента);
	
	СсылкаНаОбъект = ПолучитьСсылкуНаОбъект(ПутьКДанным);
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		СсылкаНаОбъект.ПолучитьФорму().Открыть();
	КонецЕсли;
	
КонецПроцедуры // ОткрытьЭлемент()

&НаКлиенте
Процедура ОчиститьЭлемент(Команда)
	
	ИмяЭлемента = СтрЗаменить(ТекущийЭлемент.Имя, "Очистить", "");
	ПутьКДанным = ПолучитьПутьКДаннымЭлемента(ИмяЭлемента);
	
	Если Лев(ПутьКДанным, 7) = "Объект." Тогда
		Объект[СтрЗаменить(ПутьКДанным, "Объект.", "")] = Неопределено;
	Иначе
		ЭтаФорма[ПутьКДанным] = Неопределено;
	КонецЕсли;
	
КонецПроцедуры // ОчиститьЭлемент()

&НаКлиенте
Процедура ВвестиЧисловойЭлемент(Команда)
	
	ИмяЭлемента = СтрЗаменить(ТекущийЭлемент.Имя, "Ввести", "");
	ПутьКДанным = ПолучитьПутьКДаннымЭлемента(ИмяЭлемента);
	
	ВведенноеЧисло = 0;
	
	Если ВвестиЧисло(ВведенноеЧисло) Тогда
		
		Если Лев(ПутьКДанным, 7) = "Объект." Тогда
			Объект[СтрЗаменить(ПутьКДанным, "Объект.", "")] = ВведенноеЧисло;
		Иначе
			ЭтаФорма[ПутьКДанным] = ВведенноеЧисло;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ВвестиЧисловойЭлемент()

&НаКлиенте
Процедура ВвестиЭлементДата(Команда)
	
	ИмяЭлемента = СтрЗаменить(ТекущийЭлемент.Имя, "Ввести", "");
	ПутьКДанным = ПолучитьПутьКДаннымЭлемента(ИмяЭлемента);
	
	ВведеннаяДата = 0;
	
	Если ВвестиДату(ВведеннаяДата) Тогда
		
		Если Лев(ПутьКДанным, 7) = "Объект." Тогда
			Объект[СтрЗаменить(ПутьКДанным, "Объект.", "")] = ВведеннаяДата;
		Иначе
			ЭтаФорма[ПутьКДанным] = ВведеннаяДата;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ВвестиЭлементДата()

&НаКлиенте
Процедура ВыбратьЭлементИзСписка(Команда)
	
	ИмяЭлемента = СтрЗаменить(ТекущийЭлемент.Имя, "Выбрать", "");
	ПутьКДанным = ПолучитьПутьКДаннымЭлемента(ИмяЭлемента);
	ВыбранноеЗначение = ЭтаФорма.ВыбратьИзСписка(Элементы[ИмяЭлемента].СписокВыбора, Элементы[ИмяЭлемента]);
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		
		Если Лев(ПутьКДанным, 7) = "Объект." Тогда
			Объект[СтрЗаменить(ПутьКДанным, "Объект.", "")] = ВыбранноеЗначение.Значение;
		Иначе
			ЭтаФорма[ПутьКДанным] = ВыбранноеЗначение.Значение;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ВыбратьЭлементИзСписка()

&НаКлиенте
Процедура СоздатьЗаявкуТрейдИн(Команда)
	
	Если ПроверитьСозданныеЗаявкиТрейдИн() Тогда
		ВопросПользователю = Вопрос("Для рабочего листа уже существует заявка на трейд-ин, создать новую заявку?", РежимДиалогаВопрос.ДаНет);
		
		Если ВопросПользователю = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;		
	КонецЕсли;
	
	СписокСотрудниковТрейдИн = ПолучитьСотрудниковОтделаТрейдИн();
	
	Если СписокСотрудниковТрейдИн.НайтиПоЗначению(Объект.Сотрудник) = Неопределено Тогда
	
		ФормаСписка = Обработки.Renault_ARM_Администратор.ПолучитьФорму("ФормаВыбораИзСпискаПлиткой");
		ФормаСписка.Список = СписокСотрудниковТрейдИн;
		ФормаСписка.Заголовок = "Выбор менеджера или отдела";
		
		ФормаСписка.ЭтоВыборСотрудника = Истина;
		ФормаСписка.КнопокВСтроке = 2;
		ФормаСписка.ВысотаКнопки = 40;
		Ответ = ФормаСписка.ОткрытьМодально();
		Если ЗначениеЗаполнено(Ответ) Тогда
			МенеджерТрейдИн = Ответ;
		Иначе
			Предупреждение("Для создания заявки необходимо выбрать менеджера трейд-ин или отдел.");
			Возврат;
		КонецЕсли;
	
	Иначе
		
		МенеджерТрейдИн = Объект.Сотрудник;
	
	КонецЕсли;
	
	СоздатьЗаявкуТрейдИнНаСервере(МенеджерТрейдИн);
	
КонецПроцедуры // СоздатьЗаявкуТрейдИн()

&НаКлиенте
Процедура РозничныйКлиент(Команда)
	
	Если Объект.ТипКлиента = Перечисления.Renault_ТипыКлиентов.КорпоративныйКлиент Тогда
		Renault_CRM.Воронка_РегистрацияВMyRenault_Снять(Объект.IDK);
		Renault_CRM.Статистика_Снять(Справочники.CRM_ЭтапыПродаж.РегистрацияВMYRenault, Объект.IDK);
		
		Renault_CRM.Воронка_РегистрацияВБазеРеноРоссия_Снять(Объект.IDK);
	КонецЕсли;
	
	Объект.ТипКлиента = Перечисления.Renault_ТипыКлиентов.РозничныйКлиент; 
	
	ОбновитьКнопкиТипКлиента();
	
	ИзменитьФормуСобственностиКлиента(Перечисления.ФормыСобственности.ЧастноеЛицо);
	ОбновитьЗаголовок_КнопкаКредит("Кредит");
	
КонецПроцедуры // РозничныйКлиент()

&НаКлиенте
Процедура КорпоративныйКлиент(Команда)
	
	Если Объект.ТипКлиента = Перечисления.Renault_ТипыКлиентов.РозничныйКлиент Тогда
		Renault_CRM.Воронка_РегистрацияВMyRenault_Снять(Объект.IDK);
		Renault_CRM.Статистика_Снять(Справочники.CRM_ЭтапыПродаж.РегистрацияВMYRenault, Объект.IDK);
	КонецЕсли;
	
	Объект.ТипКлиента = Перечисления.Renault_ТипыКлиентов.КорпоративныйКлиент;
	
	ОбновитьКнопкиТипКлиента();
	
	ИзменитьФормуСобственностиКлиента(Перечисления.ФормыСобственности.ЮридическоеЛицо);
	ОбновитьЗаголовок_КнопкаКредит("Лизинг");
	
	Воронка_ОбновитьMYRenault();
	
КонецПроцедуры // КорпоративныйКлиент()

&НаКлиенте
Процедура ТипТрейдИнТрейдИн(Команда)
	
	ТипОперацииТрейдИн = Перечисления.Renault_ТипыОперацийТрейдИн.TradeIn;
	ОбновитьКнопкиТипТрейдИн();
	УстановитьТипОперацииВЗаявкеНаТрейдИн(ТипОперацииТрейдИн);
	
КонецПроцедуры // ТипТрейдИнТрейдИн()

&НаКлиенте
Процедура ТипТрейдИнВыкуп(Команда)
	
	ТипОперацииТрейдИн = Перечисления.Renault_ТипыОперацийТрейдИн.Выкуп;
	ОбновитьКнопкиТипТрейдИн();
	УстановитьТипОперацииВЗаявкеНаТрейдИн(ТипОперацииТрейдИн);
	
КонецПроцедуры // ТипТрейдИнВыкуп()

&НаКлиенте
Процедура ТипТрейдИнКомиссия(Команда)
	
	ТипОперацииТрейдИн = Перечисления.Renault_ТипыОперацийТрейдИн.Комиссия;
	ОбновитьКнопкиТипТрейдИн();
	УстановитьТипОперацииВЗаявкеНаТрейдИн(ТипОперацииТрейдИн);
	
КонецПроцедуры // ТипТрейдИнКомиссия()

&НаКлиенте
Процедура НовыйАвтомобильПриИзменении(Элемент)
	
	Объект.ПродажаБУ = НовыйАвтомобиль = 1;
	ПараметрыУправленияСтраницами = Новый Структура("ТипРабочегоЛиста", Объект.ТипРабочегоЛиста);

	ОбновитьИнтерфейсТрейдИн(, ПараметрыУправленияСтраницами);
	ОбновитьПоляДляСтатистики();
	
КонецПроцедуры // НовыйАвтомобильПриИзменении()

&НаКлиенте
Процедура КарточкаКлиента(Команда)
	
	Если Объект.Клиент <> Неопределено Тогда
		Профиль = Справочники.Renault_ПрофилиКлиентов.СохранитьКлиентаВПрофиль(Объект.Клиент);
		Профиль.ПолучитьФорму(, ЭтаФорма).Открыть();
	КонецЕсли;
	
КонецПроцедуры // КарточкаКлиента()

&НаКлиенте
Процедура КлиентыРабочегоЛиста(Команда)
	
	Форма = РегистрыСведений.Renault_РабочиеЛисты.ПолучитьФорму("ФормаКлиентыРабочегоЛиста");
	Форма.РабочийЛист = Объект.IDK;
	Форма.КлиентРабочегоЛиста = Объект.Клиент;
	Форма.ОткрытьМодально();
	
КонецПроцедуры // КлиентыРабочегоЛиста()

&НаКлиенте
Процедура Позвонить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Клиент) Тогда
		Возврат;
	КонецЕсли;	
	
	ИспользуемаяТелефония = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ИспользуемаяТелефония;
	
	Если ИспользуемаяТелефония = "" ИЛИ ИспользуемаяТелефония = "СофтФон" Тогда
		Если НЕ ОбПраво("сфпИспользоватьСофтФон") Тогда		
			Возврат;
		КонецЕсли;	
		СписокОбъектов = Новый СписокЗначений;
		СписокОбъектов.Добавить(Объект.Клиент, Объект.Клиент);
		ТекАТС = Константы.CRM_ИспользуемыйСофтФон.Получить();
		Если (ТекАТС = Перечисления.CRM_ИспользуемыйСофтФон.СофтФон3) Тогда //DMSREN-370 было Перечисления.CRM_ИспользуемыйСофтФон.СофтФон2
			сфпСофтФонПроКлиент.сфпПозвонитьВыбравТелефон(СписокОбъектов); //DMSCOR-1550 сфпФормаТелефонВнешняяПанель не используется с 5.1.16
		ИначеЕсли (ТекАТС = Перечисления.CRM_ИспользуемыйСофтФон.СофтФонПроф) И НЕ (РарусСофтФонПроф = Неопределено) Тогда
			РарусСофтФонПроф.ПозвонитьВыбравТелефон(СписокОбъектов);
		КонецЕсли;
	ИначеЕсли ИспользуемаяТелефония = "БИТФон" Тогда
		Выполнить("бит_БитфонКлиент.ОткрытьБитфонНачатьРазговор(Клиент)");	
	КонецЕсли; 
	
КонецПроцедуры // Позвонить()

&НаКлиенте
Процедура ОтправитьСМС(Команда)
	
	//Renault_ОбщийМодуль.ОтправитьСМСИзКарточкиКонтрагента(Объект.Клиент, ЭтаФорма);
	Если ЗначениеЗаполнено(Объект.Клиент) тогда
		Форма = ПолучитьФорму("Справочник.DMS_ШаблоныSMS.Форма.ФормаSMSРЛ");
		Форма.Контрагент = Объект.Клиент;
		Форма.НомерТелефона = Renault_УправлениеКонтактнойИнформацией.НормализацияНомераТелефона(Клиент_Телефон, Объект.ДилерскийЦентр);
		
		Форма.Email = Клиент_Email;
		Форма.Менеджер = Объект.Сотрудник;
		
		// +++ ВГА 08.11.2021 DMSREN-1336
		//Форма.Открыть();
		Результат = Форма.ОткрытьМодально();
		ЗафиксироватьРезультатОтправкиСМС(Результат);
		// --- ВГА 08.11.2021 DMSREN-1336
	КонецЕсли;
	
КонецПроцедуры // ОтправитьСМС()

&НаСервере
Процедура ЗафиксироватьРезультатОтправкиСМС(Результат) // ВГА 08.11.2021 DMSREN-1336
	
	Если Результат = Неопределено ИЛИ ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Результат.Свойство("ОтправленныеСообщения") ИЛИ НЕ Результат.Свойство("ОписаниеОшибки") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДата();
	ТекСотрудник = DMS_ОбращенияКлиентов.ВернутьТекущегоСотрудника();
	
	Событие = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
	Событие.IDK = Объект.IDK;
	Событие.Дата = ТекущаяДата;
	Событие.Автор = ТекСотрудник;
	Событие.ВидСобытия = Справочники.CRM_ВидыСобытий.ОтправкаСМС;
	Событие.ДатаНапоминания = ТекущаяДата;
	Событие.ДатаЗакрытия = ТекущаяДата;
	Событие.АвторЗакрытия = ТекСотрудник;
	Событие.Сотрудник = ТекСотрудник;
	Событие.ДилерскийЦентр = Объект.ДилерскийЦентр;
	Событие.Подразделение = Объект.Подразделение;
	Событие.Отдел = Объект.Отдел;
	Событие.Комментарий = "Отправка СМС из рабочего листа";
	Событие.Обработано = Истина;
		
	Если Результат.ОтправленныеСообщения.Количество() <> 0 И ПустаяСтрока(Результат.ОписаниеОшибки) Тогда
		Событие.КомментарийЗакрытия = "СМС отправлено";
		Событие.ЗавершеноУспешно = Истина;
	Иначе
		Событие.КомментарийЗакрытия = "СМС не отправлено";
		Событие.ЗавершеноУспешно = Ложь;
		
		Если НЕ ПустаяСтрока(Результат.ОписаниеОшибки) Тогда
			Событие.Комментарий = СтрШаблон("%1%2(%3)", Событие.Комментарий, Символы.ПС, Результат.ОписаниеОшибки);
		КонецЕсли;
		Сообщить("Не удалось отправить СМС. Подробности см. в событии");
	КонецЕсли;
	
	Попытка
		Событие.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ЗаписьЖурналаРегистрации(Документы.CRM_СобытияПоРабочимЛистам, 
	        УровеньЖурналаРегистрации.Ошибка, , ,
	        "Ошибка записи документа");
	КонецПопытки;
	
	ОбновитьСписокСобытий();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформация(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Клиент) Тогда
		Возврат;
	КонецЕсли;

	////Параметры записи КИ для редактирования
	НаборКонтактнойИнформации = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	НаборКонтактнойИнформации.Отбор.Объект.Установить(Объект.Клиент);
	НаборКонтактнойИнформации.Отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.Телефон);     
	НаборКонтактнойИнформации.Прочитать();
	
	Для Каждого ЗаписьРегистра Из НаборКонтактнойИнформации Цикл
		//Найдем телефон по умолчанию в наборе записей
		Если ЗаписьРегистра.ЗначениеПоУмолчанию=Истина Тогда
			 ЗаписьРегистраДляРедактирования=ЗаписьРегистра;
			 
			СтруктураТелефона = Renault_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруТелефонаПоПолям(ЗаписьРегистраДляРедактирования.Представление, Объект.ДилерскийЦентр);

			Если Не ЗначениеЗаполнено(ЗаписьРегистраДляРедактирования.Поле1) Тогда								
				ЗаписьРегистраДляРедактирования.Поле1 = СтруктураТелефона.Поле1
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ЗаписьРегистраДляРедактирования.Поле2) Тогда
				ЗаписьРегистраДляРедактирования.Поле2 = СтруктураТелефона.Поле2;
				ЗаписьРегистраДляРедактирования.Поле3 = СтруктураТелефона.Поле3;
			КонецЕсли;

			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗаписьРегистраДляРедактирования=Неопределено Тогда
		//Если телефона по умолчанию не найдено, то создадим новый
		ЗаписьРегистраДляРедактирования=НаборКонтактнойИнформации;
		СтруктураНовойЗаписи=Новый Структура;
		СтруктураНовойЗаписи.Вставить("Объект",Объект.Клиент);
		СтруктураНовойЗаписи.Вставить("Тип",Перечисления.ТипыКонтактнойИнформации.Телефон);
		СтруктураНовойЗаписи.Вставить("Вид",Объект.ДилерскийЦентр.ОсновнойВидТелефонаКлиента);
	КонецЕсли;
	
	ОбработкаРедактированияКонтактнойИнформации = Обработки.Renault_РедактированиеКонтактнойИнформации.Создать();
	ОбработкаРедактированияКонтактнойИнформации.РедактированиеБезВладельца=Истина;
	ОбработкаРедактированияКонтактнойИнформации.Объект=Объект.Клиент;
	ОбработкаРедактированияКонтактнойИнформации.мНаборЗаписейКонтактнойИнформации=НаборКонтактнойИнформации;
	ОбработкаРедактированияКонтактнойИнформации.РедактироватьЗапись(ЗаписьРегистраДляРедактирования,,ЭтаФорма,СтруктураНовойЗаписи);
	ОбработкаРедактированияКонтактнойИнформации.ЗапуститьФорму(ЭтаФорма);
	
КонецПроцедуры // КонтактнаяИнформация()

&НаКлиенте
Процедура ВвестиEmailКлиента(Команда)
	
	Форма = Объект.Ссылка.ПолучитьФорму("ФормаВводаEmail", ЭтаФорма);
	Форма.EmailПоУмолчанию = Объект.Email;
	Форма.Клиент = Объект.Клиент;
	Объект.Email = Форма.ОткрытьМодально();
	Объект.Email = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(Объект.Клиент);
	СохранитьДанныеКлиентаПриСменеEmail();
	Воронка_ОбновитьВзятEmail();
	
	
КонецПроцедуры // ВвестиEmailКлиента()

&НаКлиенте
Процедура СогласиеНаОбработкуПД(Команда)
	
	Если Объект.Клиент.Пустая() Тогда 
		Сообщить("Клиент не записан"); 
		Возврат 
	КонецЕсли;
	
	Оповещение=Новый ОписаниеОповещения("ОбновитьСогласиеНаОД",ЭтаФорма);
	
	Если ЗначениеЗаполнено(ДокументСогласиеНаОбработкуПерсональныхДанных) тогда
		ОткрытьЗначение(ДокументСогласиеНаОбработкуПерсональныхДанных);	
	иначе
		ОткрытьФорму("Документ.DMS_СогласиеНаОбработкуПерсональныхДанных.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", Новый Структура("ФизическоеЛицо",Объект.Клиент)),ЭтаФорма,2,,,Оповещение); 
	КонецЕсли;
	
КонецПроцедуры // СогласиеНаОбработкуПД()

&НаКлиенте
Процедура ПерейтиКОформлениюКорп(Команда)
	
	Элементы.ГруппаСтраницыИнформации.ТекущаяСтраница = Элементы.ГруппаСтраницаКОРП;
	
	Для Каждого ТекущийЭлемент из Элементы.ГруппаМеню.ПодчиненныеЭлементы Цикл
		
		Если ТекущийЭлемент.Имя = "КОРП" Тогда
			ТекущийЭлемент.ЦветФона = ЦветРено;
		Иначе
			ТекущийЭлемент.ЦветФона = Новый Цвет(156, 166, 178);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПерейтиКОформлениюКорп()

&НаКлиенте
Процедура НадписьСоздатьРабочийЛистПродажаНажатие(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СвязаныйIDK) И Объект.СвязаныйIDK <> Объект.IDK Тогда
		
		СвязанныйРЛ = Renault_CRM.докПолучитьСвязанныйРабочийЛист(Объект.СвязаныйIDK);
		
		Если СвязанныйРЛ <> Неопределено Тогда
			
			Если Не ЗначениеЗаполнено(СвязанныйРЛ.СвязаныйIDK) Тогда
				
				Renault_CRM.докЗаписатьСвязанныйIDKРабочегоЛиста(СвязанныйРЛ, Объект.IDK);
				
			КонецЕсли;
			
			СвязанныйРЛ.ПолучитьФорму().Открыть();
			
			ОбработкаОповещенияФормыЗаписи();
		
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	СписокОтделов = ПолучитьСписокОтделов(Ложь);
	
	ОтделПродаж = Справочники.CRM_Отделы.ПустаяСсылка();
	
	КолОтделов = СписокОтделов.Количество();
	
	Если КолОтделов = 1 Тогда
		ОтделПродаж = СписокОтделов[0].Значение; 			
	Иначе		
		ФормаСписка = Обработки.Renault_ARM_Администратор.ПолучитьФорму("ФормаВыбораИзСпискаПлиткой");
		ФормаСписка.Список = СписокОтделов;
		ФормаСписка.Заголовок = "Выбор отдела";
		ФормаСписка.КнопокВСтроке = 2;
		ФормаСписка.ВысотаКнопки = 40;
		ФормаСписка.ЭтоВыборСотрудника = Ложь;
		Ответ = ФормаСписка.ОткрытьМодально();
		Если ЗначениеЗаполнено(Ответ) Тогда
			ОтделПродаж = Ответ;
		Иначе
			Предупреждение("Необходимо выбрать менеджера.");
			Возврат
		КонецЕсли; 		
	КонецЕсли; 	 
	
	Список = Renault_CRM.ПолучитьСписокСотрудниковПоОтделу(ОтделПродаж);
	ФормаСписка = Обработки.Renault_ARM_Администратор.ПолучитьФорму("ФормаВыбораИзСпискаПлиткой");
	ФормаСписка.Список = Список;
	ФормаСписка.Заголовок = "Выбор менеджера";
	ФормаСписка.КнопокВСтроке = 2;
	ФормаСписка.ВысотаКнопки = 40;
	ФормаСписка.ЭтоВыборСотрудника = Истина;
	Ответ = ФормаСписка.ОткрытьМодально();
	Если ЗначениеЗаполнено(Ответ) Тогда
		ВыбранныйСотрудник = Ответ;
	Иначе
		Предупреждение("Необходимо выбрать менеджера.");
		Возврат
	КонецЕсли;
	                   
	Идентификатор = СоздатьЗаписьТрафика(ОтделПродаж, ВыбранныйСотрудник);
	
	РабочийЛистСсылка = Renault_CRM.докСоздатьРабочийЛистПоТрафику(Идентификатор, ,Перечисления.Renault_ТипыРабочихЛистов.Продажа);
	
	Renault_CRM.докЗаписатьСвязанныйIDKРабочегоЛиста(РабочийЛистСсылка, Объект.IDK);
	
	Объект.СвязаныйIDK = РабочийЛистСсылка.IDK;
	
	Элементы.НадписьСоздатьРабочийЛистПродажа.Заголовок = "Открыть связаный рабочий лист";
	ЗаписатьРабочийЛист();
	
КонецПроцедуры // НадписьСоздатьРабочийЛистПродажаНажатие()

&НаКлиенте
Процедура НадписьПривязатьРабочийЛистПродажаНажатие(Элемент)
	
	ОткрытьПоискЛистов();
	
	ОбработкаОповещенияФормыЗаписи();
	
КонецПроцедуры // НадписьПривязатьРабочийЛистПродажаНажатие()

&НаКлиенте
Процедура НадписьСоздатьРабочийЛистТрейдИнНажатие(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СвязаныйIDK) И Объект.СвязаныйIDK <> Объект.IDK Тогда
		
		СвязанныйРЛ = Renault_CRM.докПолучитьСвязанныйРабочийЛист(Объект.СвязаныйIDK);
		
		Если СвязанныйРЛ <> Неопределено Тогда
			
			Если Не ЗначениеЗаполнено(СвязанныйРЛ.СвязаныйIDK) Тогда
				
				Renault_CRM.докЗаписатьСвязанныйIDKРабочегоЛиста(СвязанныйРЛ, Объект.IDK);
				
			КонецЕсли;
			
			СвязанныйРЛ.ПолучитьФорму().Открыть();
			
			ОбработкаОповещенияФормыЗаписи();
		
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОтделТрейдИн = Справочники.CRM_Отделы.ПустаяСсылка();
	
	СписокОтделов = ПолучитьСписокОтделов(Истина);
	
	Если СписокОтделов.Количество() > 0 Тогда
		ОтделТрейдИн = СписокОтделов[0].Значение;
	КонецЕсли;
	
	Список = Renault_CRM.ПолучитьСписокСотрудниковПоОтделу(ОтделТрейдИн);
	Список.Добавить(?(ЗначениеЗаполнено(ОтделТрейдИн), ОтделТрейдИн, Объект.Отдел));
	
	ФормаСписка = Обработки.Renault_ARM_Администратор.ПолучитьФорму("ФормаВыбораИзСпискаПлиткой");
	ФормаСписка.Список = Список;
		
		
	ФормаСписка.Заголовок = "Выбор менеджера или отдела";
		
	ФормаСписка.ЭтоВыборСотрудника = Истина;
	ФормаСписка.КнопокВСтроке = 2;
	ФормаСписка.ВысотаКнопки = 40;
	Ответ = ФормаСписка.ОткрытьМодально();
	Если ЗначениеЗаполнено(Ответ) Тогда
		СотрудникВыбор = Ответ;
	Иначе
		Предупреждение("Необходимо выбрать менеджера или отдел.");
		Возврат
	КонецЕсли;
	
	Идентификатор = СоздатьЗаписьТрафика(ОтделТрейдИн, СотрудникВыбор);
	
	// Трояновский К.Е. 06.08.2019 15:38:27 {
	//РабочийЛистСсылка = Renault_CRM.СоздатьРабочийЛистПоТрафику(Идентификатор,,Перечисления.Renault_ТипыРабочихЛистов.TradeIn);
	РабочийЛистСсылка = Renault_CRM.докСоздатьРабочийЛистПоТрафику(Идентификатор,,Перечисления.Renault_ТипыРабочихЛистов.TradeIn);
	// Трояновский К.Е. 06.08.2019 15:38:27 }
	
	Renault_CRM.докЗаписатьСвязанныйIDKРабочегоЛиста(РабочийЛистСсылка, Объект.IDK);
	
	Объект.СвязаныйIDK = РабочийЛистСсылка.IDK;
	Элементы.НадписьСоздатьРабочийЛистТрейдИн.Заголовок = "Открыть связаный рабочий лист";
	
	СоздатьЗаписьВоронкиПродаж(Справочники.CRM_ЭтапыПродаж.ИнтересКТрейдИн);
	
	ЗаписатьРабочийЛист();
	
КонецПроцедуры // НадписьСоздатьРабочийЛистТрейдИнНажатие()

&НаКлиенте
Процедура ПривязатьСоздатьРабочийЛистТрейдИнНажатие(Элемент)
	
	ОткрытьПоискЛистов();
	
КонецПроцедуры // ПривязатьСоздатьРабочийЛистТрейдИнНажатие()

&НаКлиенте
Процедура СписокСобытий(Команда)
	
	ТекущийЭлемент = Элементы.СобытияПоРабочемуЛисту;
	СменитьСтраницу(Команда);
	
КонецПроцедуры // СписокСобытий()

&НаКлиенте
Процедура ДобавитьСобытиеБыстро(Команда)
	
	СоздатьНовоеСобытие();
	
КонецПроцедуры // ДобавитьСобытиеБыстро()

&НаКлиенте
Процедура ЗакрытьСледСобытие(Команда)
	
	Если ЗначениеЗаполнено(IDСледСобытия) Тогда
		
		Ответ = Вопрос("Ввести результат события?", РежимДиалогаВопрос.ДаНет);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			
			мФорма = IDСледСобытия.ПолучитьФорму("ФормаЗавершенияСобытия");
			
			Если мФорма.Открыта() Тогда
				Предупреждение("Данное событие уже открыто!");
				Возврат;
			КонецЕсли;
			
			Ответ = мФорма.ОткрытьМодально();
			
			Если ЗначениеЗаполнено(Ответ) Тогда
				
				Ответ = Вопрос("Ввести новое событие?", РежимДиалогаВопрос.ДаНет);
				Если Ответ = КодВозвратаДиалога.Да Тогда
					СоздатьНовоеСобытие();
				Иначе
					ОбновитьСписокСобытий();
				КонецЕсли;
				
				Renault_CRM.ОчиститьПроверкуПоРЛ(Объект.IDK);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ЗакрытьСледСобытие()

&НаКлиенте
Процедура СобытиеОтправкаНаОценкуТрейдИн(Команда)
	
	СписокСобытий = ПолучитьСписокСобытийТрейдИн(Объект.IDK);
	
	КолСобытий = СписокСобытий.Количество();
	
	Если КолСобытий > 0 Тогда
		
		Если КолСобытий = 1 Тогда
			ТекСобытие = СписокСобытий[0]; 			
		Иначе
			ФормаСписка = Обработки.Renault_ARM_Администратор.ПолучитьФорму("ФормаВыбораИзСпискаПлиткой");
			ФормаСписка.Список = СписокСобытий;
			ФормаСписка.Заголовок = "Выбор не обработанных событий отправки оценки трайд-ин";
			ФормаСписка.КнопокВСтроке = 1;
			ФормаСписка.ВысотаКнопки = 40;
			ФормаСписка.ЭтоВыборСотрудника = Ложь;
			ТекСобытие = ФормаСписка.ОткрытьМодально();    			 		
		КонецЕсли; 		
		
		Если ТекСобытие <> Неопределено Тогда
			Ответ = ТекСобытие.ПолучитьФорму("ФормаЗавершенияСобытия").ОткрытьМодально();
			
			Если ЗначениеЗаполнено(Ответ) Тогда				
				Ответ = Вопрос("Ввести новое событие?", РежимДиалогаВопрос.ДаНет);
				
				Если Ответ = КодВозвратаДиалога.Да Тогда
					СоздатьНовоеСобытие();
				Иначе
					ОбновитьСписокСобытий();
				КонецЕсли;  
				
				Renault_CRM.ОчиститьПроверкуПоРЛ(Объект.IDK);   				
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		Сообщить("Нет не обработанных отправок на оценку трейд-ин!");
		ОбновитьСписокСобытий();
		
	КонецЕсли;
	
КонецПроцедуры // СобытиеОтправкаНаОценкуТрейдИн()

&НаКлиенте
Процедура ПерепланироватьСобытие(Команда)
	
	ТабличныйДокумент    = Элементы.ПолеСписокСобытий;
	ТекущаяОбласть       = ТабличныйДокумент.ТекущаяОбласть;
	
	СобытиеСсылка = Неопределено;
	СтруктураРасшифровки = ТекущаяОбласть.Расшифровка;
	Если ТипЗнч(СтруктураРасшифровки) = Тип("Структура") Тогда
		СтруктураРасшифровки.Свойство("СобытиеСсылка", СобытиеСсылка);	
	ИначеЕсли ТипЗнч(СтруктураРасшифровки) = Тип("ДокументСсылка.CRM_СобытияПоРабочимЛистам") Тогда
		СобытиеСсылка = СтруктураРасшифровки;
	КонецЕсли;
	
	Если СобытиеСсылка = Неопределено Тогда
		Сообщить("Необходимо выделить строку с событием.");
		Возврат;
	КонецЕсли;
	
	Если СобытиеСсылка.Обработано Тогда
		Сообщить("Событие не подлежит редактированию.");
		Возврат;
	КонецЕсли;
	Если СтруктураРасшифровки.ВидСобытия = Справочники.CRM_ВидыСобытий.Выдача Тогда
		СсылкаНового = Документы.CRM_СобытияПоРабочимЛистам.ПеренестиСобытие(СтруктураРасшифровки);
		Если  СсылкаНового <> Неопределено Тогда
			Если СтруктураРасшифровки.Объект <> Неопределено Тогда
				ДокОбъект = СтруктураРасшифровки.Объект.ПолучитьОбъект();
				ДокОбъект.ДатаНачала = СсылкаНового.ДатаНапоминания;
				ДокОбъект.Статус = Перечисления.CRM_СтатусыДокументаЗаписьНаВыдачу.Черновик;
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		КонецЕсли;
	Иначе
		ФормаВыбора = Справочники.Renault_ПричиныПерепланированияСобытий.ПолучитьФормуВыбора(, ЭтаФорма, ЭтаФорма.КлючУникальности);
		
		ФормаВыбора.Заголовок = "Укажите причину перепланирования события";
		
		Причина = ФормаВыбора.ОткрытьМодально();
		
		Если Причина = Неопределено Тогда
			Сообщить("Необходимо указать причину перепланирования события");
			Возврат;
		ИначеЕсли Причина.ЭтоГруппа Тогда
			Сообщить("Необходимо выбрать элемент, а не группу.");
			Возврат;
		КонецЕсли;
		
		ФормаСобытия = СобытиеСсылка.ПолучитьФорму("ФормаСозданияСобытия");
		ФормаСобытия.ЭтоПерепланирование = Истина;
		ФормаСобытия.ПричинаПерепланирования = Причина;
		ФормаСобытия.ОткрытьМодально();
	КонецЕсли;
	Оповестить("ОбновитьРабочийЛист");
	
КонецПроцедуры // ПерепланироватьСобытие()

&НаКлиенте
Процедура ОткрытьКонфигураторПолный(Команда)
	
	Если Модифицированность Тогда 
		ЗаписатьРабочийЛист();
	КонецЕсли;

	ФормаРабочийСтол = Обработки.CRM_АРМ_Конфигуратор.ПолучитьФорму("Форма",ЭтаФорма);
	Если Объект.ПродажаБУ Тогда 
		ФормаРабочийСтол.ЭтоТрейдИН = Истина;
		ФормаРабочийСтол.Модель = Объект.АвтомобильБУ.Модель;
		ФормаРабочийСтол.Версия = Объект.АвтомобильБУ.ВариантКомплектации;
		ФормаРабочийСтол.Цвет  =  Объект.АвтомобильБУ.Цвет;
		ФормаРабочийСтол.ТипКП = Перечисления.Renault_ТипКП.АвтомобильСПробегом;
		Если ЗначениеЗаполнено(Объект.АвтомобильБУ) Тогда
			ФормаРабочийСтол.Автомобиль = Объект.АвтомобильБУ;
		Иначе
			Предупреждение("Не выбран автомобиль, печать КП не возможна");
			Возврат;
		КонецЕсли;
	Иначе
		
		ЗаявкиПоРабочемуЛисту = ПолучитьЗаявкиПоРабочемуЛисту(Объект.IDK);
		
		Если ЗначениеЗаполнено(ЗаявкиПоРабочемуЛисту.ЗаявкаНаГарантию) Тогда
			ФормаРабочийСтол.ЗаявкаНаГарантию = ЗаявкиПоРабочемуЛисту.ЗаявкаНаГарантию;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗаявкиПоРабочемуЛисту.ЗаявкаНаСтраховкуОсаго) Тогда
			ФормаРабочийСтол.ЗаявкаНаСтраховку = ЗаявкиПоРабочемуЛисту.ЗаявкаНаСтраховкуОсаго;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗаявкиПоРабочемуЛисту.ЗаявкаНаСтраховкуКаско) Тогда
			ФормаРабочийСтол.ЗаявкаНаСтраховкуКАСКО = ЗаявкиПоРабочемуЛисту.ЗаявкаНаСтраховкуКаско;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗаявкиПоРабочемуЛисту.ЗаявкаНаТрейдИн) Тогда
			ФормаРабочийСтол.ЗаявкаНаТрейдИн = ЗаявкиПоРабочемуЛисту.ЗаявкаНаТрейдИн;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗаявкиПоРабочемуЛисту.ЗаявкаНаКредит) Тогда
			ФормаРабочийСтол.ЗаявкаНаКредит = ЗаявкиПоРабочемуЛисту.ЗаявкаНаКредит;
		КонецЕсли;
		
		ФормаРабочийСтол.ТипКП = Перечисления.Renault_ТипКП.НовыйАвтомобиль;
	КонецЕсли;
	ФормаРабочийСтол.ТекущийКлиент = Объект.Клиент;
	ФормаРабочийСтол.ТекущийРабочийЛист = Объект.IDK; 
	ФормаРабочийСтол.Открыть();
	
КонецПроцедуры // ОткрытьКонфигураторПолный()

&НаКлиенте
Процедура ОткрытьКонфигураторВыбранноеПолный(Команда)
	
	Если Модифицированность Тогда 
		ЗаписатьРабочийЛист();
	КонецЕсли;
	
	Если Элементы.ТаблицаКП.ТекущиеДанные<> Неопределено Тогда  //Блинков Было изменено условие т.к. не корректно отрабатывало Заполенено (т.к. мутабильный тип данных) DMSREN-738
		ОткрытьФормуКомПредложения(Элементы.ТаблицаКП.ТекущиеДанные);
	КонецЕсли;
	
	
	
КонецПроцедуры // ОткрытьКонфигураторВыбранноеПолный()

&НаКлиенте
Процедура УдалитьКоммерческоеПредложение(Команда)
	
	Если НЕ Объект.ДилерскийЦентр.ВозможностьУдаленияКП Тогда
		Сообщить("Запрещено удалять ком. предложения из раб. листа");
		Возврат;
	КонецЕсли;
	
	Если Элементы.ТаблицаКП.ТекущиеДанные<> Неопределено Тогда   //Блинков Было изменено условие т.к. не корректно отрабатывало Заполенено (т.к. мутабильный тип данных) DMSREN-738
		Ответ = Вопрос("Вы уверены что хотите удалить данное предложение из списка?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			СсылкаКП = Элементы.ТаблицаКП.ТекущиеДанные.Ссылка;
			
			//Удалим движения
			Набор = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьНаборЗаписей();
			Набор.Отбор.IDK.Установить(Объект.IDK);
			Набор.Прочитать();
			Для Каждого Запись ИЗ Набор Цикл
				Если Запись.Объект = СсылкаКП Тогда
					НовоеКП = ЗаменитьКП(СсылкаКП);
					Если ЗначениеЗаполнено(НовоеКП) Тогда
						Запись.Объект = НовоеКП;
						Запись.ДатаВыполнения = НовоеКП.Дата;
					Иначе
						Набор.Удалить(Запись);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Набор.Записать();
			
			КПОбъект = СсылкаКП.ПолучитьОбъект();
			КПОбъект.ПометкаУдаления = Истина;
			КПОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
			ОбновитьСписокКП();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // УдалитьКоммерческоеПредложение()

&НаКлиенте
Процедура СоздатьРезерв(Команда)
	
	Если Элементы.ТаблицаКП.ТекущиеДанные = Неопределено Тогда		
		Возврат;		
	КонецЕсли;
	
	КП = Элементы.ТаблицаКП.ТекущиеДанные.Ссылка;	
	ЕСли Не ЗначениеЗаполнено(КП) Тогда		
		Возврат;		
	КонецЕсли;
	
	Если КП.Состав.Количество() = 0 Тогда
		Возврат 
	КонецЕсли;
	
	Авто = КП.Состав[0].Конфигурация.Автомобиль;
	
	Если Не ЗначениеЗаполнено(Авто) Тогда		
		Предупреждение("Создание резерва возможно только на основе предложения на существующий автомобиль.");
		Возврат;		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ЗаявкиНаРезервАвтомобиля.Регистратор
	|ИЗ
	|	РегистрСведений.Renault_ЗаявкиНаРезервАвтомобиля КАК Renault_ЗаявкиНаРезервАвтомобиля
	|ГДЕ
	|	Renault_ЗаявкиНаРезервАвтомобиля.VIN = &VIN
	|	И Renault_ЗаявкиНаРезервАвтомобиля.Менеджер = &Менеджер
	|	И Renault_ЗаявкиНаРезервАвтомобиля.СтатусРезерва = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыРезервовАвтомобилей.ЗаявкаНаРезерв)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Renault_УтвержденныеРезервы.Регистратор
	|ИЗ
	|	РегистрСведений.Renault_УтвержденныеРезервы КАК Renault_УтвержденныеРезервы
	|ГДЕ
	|	Renault_УтвержденныеРезервы.VIN = &VIN
	|	И Renault_УтвержденныеРезервы.ДатаСнятияСРезерва >= &ТекущаяДата";
	
	Запрос.УстановитьПараметр("VIN", Авто.VIN);
	Запрос.УстановитьПараметр("Менеджер", ПараметрыСеанса.Пользователь.Сотрудник);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Результат = Запрос.Выполнить();	
	Если Не Результат.Пустой() Тогда
		Предупреждение("Автомобиль" + Авто + " уже находится в резерве");	
		Возврат;
	КонецЕсли;
	
	НовыйАвто = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ОстаткиАвтомобилейОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	               |	ОстаткиАвтомобилейОстатки.СкладКомпании
	               |ИЗ
	               |	РегистрНакопления.ОстаткиАвтомобилей.Остатки(, Автомобиль = &АВтомобиль) КАК ОстаткиАвтомобилейОстатки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_РеквизитыСкладовКомпании КАК Renault_РеквизитыСкладовКомпании
	               |		ПО ОстаткиАвтомобилейОстатки.СкладКомпании = Renault_РеквизитыСкладовКомпании.СкладКомпании
	               |			И (Renault_РеквизитыСкладовКомпании.СкладПодержанныхАвто = ИСТИНА)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОстаткиАвтомобилейОстатки.СкладКомпании";
	
	Запрос.УстановитьПараметр("Автомобиль", Авто);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		НовыйАвто = Ложь;
	КонецЕсли;
	
	Если НовыйАвто Тогда
		BIR_Distri = СокрЛП(Объект.ДилерскийЦентр.BIR_Distri);	
		МассивСкладовДилера = Объект.ДилерскийЦентр.СкладыДилера.ВыгрузитьКолонку("Склад");
		АвтоДанные = CRM_Сервер.Автосклад_ПолучитьТаблицуПоСостояниюАвтомобилей(Авто.VIN,МассивСкладовДилера, BIR_Distri,Истина, Истина, Ложь, Ложь);
		
		Если НЕ ЗначениеЗаполнено(АвтоДанные) Тогда		
			Предупреждение("Автомобиль нельзя поставить в резерв");
			Возврат;		
		КонецЕсли;
		
		ТекущиеДанные = АвтоДанные[0];
		
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить(КодВозвратаДиалога.Да,"Ознакомлен");
		СписокКнопок.Добавить(КодВозвратаДиалога.Отмена,"Отмена");
		Если ТекущиеДанные.СтатусТСМ = "TCM 15m+" Тогда
			Ответ = Вопрос("Данный автомобиль произведен более 15 месяцев назад. "+Символы.ПС+"Такой автомобиль может быть продан только как уцененный, т.е. не отвечающий требованиям нового автомобиля и со сроком действия гарантии, указанной в системе ICM.  "+Символы.ПС+"При создании договора необходимо это учитывать, а так же ознакомиться с датой окончания гарантии в ICM.",СписокКнопок);			
			Если Ответ = КодВозвратаДиалога.Отмена Тогда
				Возврат;
			КонецЕсли;
		ИначеЕсли ТекущиеДанные.СтатусТСМ = "TCM 14m+" Тогда	
			Ответ = Вопрос("Данный автомобиль произведен более 14 месяцев назад.  "+Символы.ПС+"Такой автомобиль может быть продан только как уцененный, т.е. не отвечающий требованиям нового автомобиля и со сроком действия гарантии, указанной в системе ICM.  "+Символы.ПС+"При создании договора необходимо это учитывать, а так же ознакомиться с датой окончания гарантии в ICM.",СписокКнопок);
			Если Ответ = КодВозвратаДиалога.Отмена Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;  
		
		
		Если ТекущиеДанные.Отозван Тогда
			ВопросПользователю = Вопрос("По автомобилю есть невыполненные отзывные ноты, всё равно продолжить?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
			Если ВопросПользователю = КодВозвратаДиалога.Нет Тогда
				Возврат;	
			КонецЕсли;		
		КонецЕсли;
	КонецЕсли;
	
	МаксимальноеКоличествоДнейРезерва = Renault_РаботаСПравамиПользователя.МаксимальноеКоличествоДнейРезерва(ПараметрыСеанса.Пользователь);			
	КомментарийКЗаявке = "";
	
	ДнейРезерваПоУмолчанию = ПараметрыСеанса.Renault_ПраваПользователя.Автосклад_КоличествоДнейРезерваПоУмолчанию;
	Если ДнейРезерваПоУмолчанию = 0 Тогда
		ДнейРезерваПоУмолчанию = МаксимальноеКоличествоДнейРезерва;
		Если МаксимальноеКоличествоДнейРезерва = 0 Тогда
			ДнейРезерваПоУмолчанию = 3;
		КонецЕсли;
	КонецЕсли;
	
	ДатаСнятияСРезерва = ТекущаяДата() + ДнейРезерваПоУмолчанию*60*60*24;	
	Если ВвестиДату(ДатаСнятияСРезерва, "Укажите до какой даты установить резерв") Тогда
		
		Если МаксимальноеКоличествоДнейРезерва <> 0 И ДатаСнятияСРезерва - ТекущаяДата() > МаксимальноеКоличествоДнейРезерва*60*60*24 Тогда
			Предупреждение("Оформление резерва невозможно. Максимальное число дней резерва для вас - " + Строка(МаксимальноеКоличествоДнейРезерва));
			Возврат;
		КонецЕсли;
		
		Если ВвестиСтроку(КомментарийКЗаявке, "Введите комментарий к заявке на резерв...", , Истина) Тогда 			
			МенеджерРезерва = ПараметрыСеанса.Пользователь.Сотрудник;			
		Иначе			
			Возврат;			
		КонецЕсли;		
	Иначе				
		Возврат;		
	КонецЕсли;
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_УтвержденныеРезервы.Регистратор	
	|ИЗ
	|	РегистрСведений.Renault_УтвержденныеРезервы КАК Renault_УтвержденныеРезервы
	|ГДЕ
	|	Renault_УтвержденныеРезервы.VIN = &VIN";
	
	Запрос.УстановитьПараметр("VIN", Авто.VIN);
	
	Результат = Запрос.Выполнить();	
	Если Не Результат.Пустой() Тогда
		Предупреждение("Автомобиль" + Авто + " уже находится в резерве");	
		Возврат;
	КонецЕсли;		
	
	НовЗаявка = Документы.Renault_РезервированиеАвтомобилей.СоздатьДокумент();	
	НовЗаявка.VIN = Авто.VIN;
	НовЗаявка.Автомобиль = Авто;
	НовЗаявка.Дата = ТекущаяДата();
	НовЗаявка.Автор = ПараметрыСеанса.Пользователь;
	НовЗаявка.Менеджер = ПараметрыСеанса.Пользователь.Сотрудник;
	НовЗаявка.Клиент = Объект.Клиент;
	НовЗаявка.РабочийЛист = Объект.IDK;
	
	ЕстьПравоСразуРезервироватьАвтомобиль = ПараметрыСеанса.Renault_ПраваПользователя.РезервироватьАвтомобильБезСогласования;
	
	Если ЕстьПравоСразуРезервироватьАвтомобиль Тогда
		НовЗаявка.Контролер = ПараметрыСеанса.Пользователь;
		НовЗаявка.СтатусРезерва = Перечисления.CRM_СтатусыРезервовАвтомобилей.РезервУтвержден;
	Иначе
		НовЗаявка.СтатусРезерва = Перечисления.CRM_СтатусыРезервовАвтомобилей.ЗаявкаНаРезерв;
	КонецЕсли;
	
	НовЗаявка.Комментарий = КомментарийКЗаявке;
	НовЗаявка.ДатаСнятияРезерва = ДатаСнятияСРезерва;
	
	НовЗаявка.Записать(РежимЗаписиДокумента.Проведение);	

	ОбновитьСписокРезервов();
	
КонецПроцедуры // СоздатьРезерв()

&НаКлиенте
Процедура СоздатьДоговорПоРезерву(Команда)
	
	Если Элементы.ТаблицаКП.ТекущаяСтрока = Неопределено Тогда
	
		//Создадим новый
		ТекДанные = Элементы.Резервы.ТекущиеДанные;
		
		Если ТекДанные = Неопределено Тогда
			Предупреждение("Для создания договора необходимо выбрать автомобили из резерва.");
			Возврат;
		КонецЕсли;
		
		ДоговорОбъектНового = Документы.Renault_Договор.СоздатьДокумент();
		ДоговорОбъектНового.Дата = ТекущаяДата();
		ДоговорОбъектНового.ДатаДоговора = ТекущаяДата();	
		ДоговорОбъектНового.РабочийЛист = Объект.IDK;
		ДоговорОбъектНового.СтатусДоговора = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Черновик;
		ДоговорОбъектНового.Клиент = Объект.Клиент;
		ДоговорОбъектНового.ДилерскийЦентр = Объект.ДилерскийЦентр;
		Стр = ДоговорОбъектНового.СоставДоговора.Добавить();
		Стр.Автомобиль = ТекДанные.Автомобиль;
		Стр.Идентификатор = Новый УникальныйИдентификатор;
		Стр.VIN = ТекДанные.VIN;
		ФормаДоговора = ДоговорОбъектНового.ПолучитьФорму();
		ФормаДоговора.ПерезаполнитьДоговор = Истина;
		ФормаДоговора.Открыть();
	Иначе
		КП = Элементы.ТаблицаКП.ТекущиеДанные.ССылка;		
		Если Не ЗначениеЗаполнено(КП) Тогда			
			Возврат;			
		КонецЕсли;
		
		Если КП.Состав.Количество() = 0 Тогда
			Возврат
		КонецЕсли;
		
		Авто = КП.Состав[0].Конфигурация.Автомобиль;		
		Если НЕ ЗначениеЗаполнено(Авто) Тогда			
			Предупреждение("Создание резерва и договора возможно только на основе предложения на существующий автомобиль.");
			Возврат;			
		КонецЕсли;
		
		BIR_Distri = СокрЛП(Объект.ДилерскийЦентр.BIR_Distri);		
		МассивСкладовДилера = Объект.ДилерскийЦентр.СкладыДилера.ВыгрузитьКолонку("Склад");		
		АвтоДанные = CRM_Сервер.Автосклад_ПолучитьТаблицуПоСостояниюАвтомобилей(Авто.VIN,МассивСкладовДилера, BIR_Distri, Истина, Истина, Ложь, Ложь);
		
		Если Не ЗначениеЗаполнено(АвтоДанные) Тогда			
			Предупреждение("Автомобиль нельзя поставить в резерв и соответственно создать договор");
			Возврат;			
		КонецЕсли;		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_УтвержденныеРезервы.Регистратор		
		|ИЗ
		|	РегистрСведений.Renault_УтвержденныеРезервы КАК Renault_УтвержденныеРезервы
		|ГДЕ
		|	Renault_УтвержденныеРезервы.VIN = &VIN";
		
		Запрос.УстановитьПараметр("VIN", Авто.VIN);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Не Результат.Пустой() Тогда			
			
		Иначе			
			
			ТекущиеДанные = АвтоДанные[0];		
			СписокКнопок = Новый СписокЗначений;
			СписокКнопок.Добавить(КодВозвратаДиалога.Да, "Ознакомлен");
			СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
			Если ТекущиеДанные.СтатусТСМ = "TCM 15m+" Тогда
				Ответ = Вопрос("Данный автомобиль произведен более 15 месяцев назад. "+Символы.ПС+"Такой автомобиль может быть продан только как уцененный, т.е. не отвечающий требованиям нового автомобиля и со сроком действия гарантии, указанной в системе ICM.  "+Символы.ПС+"При создании договора необходимо это учитывать, а так же ознакомиться с датой окончания гарантии в ICM.",СписокКнопок);			
				Если Ответ = КодВозвратаДиалога.Отмена Тогда
					Возврат;
				КонецЕсли;
			ИначеЕсли ТекущиеДанные.СтатусТСМ = "TCM 14m+" Тогда	
				Ответ = Вопрос("Данный автомобиль произведен более 14 месяцев назад.  "+Символы.ПС+"Такой автомобиль может быть продан только как уцененный, т.е. не отвечающий требованиям нового автомобиля и со сроком действия гарантии, указанной в системе ICM.  "+Символы.ПС+"При создании договора необходимо это учитывать, а так же ознакомиться с датой окончания гарантии в ICM.",СписокКнопок);
				Если Ответ = КодВозвратаДиалога.Отмена Тогда
					Возврат;
				КонецЕсли;
			КонецЕсли;  		
			
			Если ТекущиеДанные.Отозван Тогда
				ВопросПользователю = Вопрос("По автомобилю есть невыполненные отзывные ноты, всё равно продолжить?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
				Если ВопросПользователю = КодВозвратаДиалога.Нет Тогда
					Возврат;	
				КонецЕсли;		
			КонецЕсли;
				
				МаксимальноеКоличествоДнейРезерва = Renault_РаботаСПравамиПользователя.МаксимальноеКоличествоДнейРезерва(ПараметрыСеанса.Пользователь);			
			КомментарийКЗаявке = "";
			
			ДнейРезерваПоУмолчанию = ПараметрыСеанса.Renault_ПраваПользователя.Автосклад_КоличествоДнейРезерваПоУмолчанию;
			Если ДнейРезерваПоУмолчанию = 0 Тогда
				ДнейРезерваПоУмолчанию = МаксимальноеКоличествоДнейРезерва;
				Если МаксимальноеКоличествоДнейРезерва = 0 Тогда
					ДнейРезерваПоУмолчанию = 3;
				КонецЕсли;
			КонецЕсли;
			
			ДатаСнятияСРезерва = ТекущаяДата() + ДнейРезерваПоУмолчанию*60*60*24;
			
			Если ВвестиДату(ДатаСнятияСРезерва, "Укажите до какой даты установить резерв") Тогда
				
				Если МаксимальноеКоличествоДнейРезерва <> 0 И ДатаСнятияСРезерва - ТекущаяДата() > МаксимальноеКоличествоДнейРезерва*60*60*24 Тогда
					Предупреждение("Оформление резерва невозможно. Максимальное число дней резерва для вас - " + Строка(МаксимальноеКоличествоДнейРезерва));
					Возврат;
				КонецЕсли;
				
				Если ВвестиСтроку(КомментарийКЗаявке, "Введите комментарий к заявке на резерв...", , Истина) Тогда 				
					МенеджерРезерва = ПараметрыСеанса.Пользователь.Сотрудник;				
				Иначе				
					Возврат;				
				КонецЕсли;	
			Иначе					
				Возврат;			
			КонецЕсли;					
			
			НовЗаявка = Документы.Renault_РезервированиеАвтомобилей.СоздатьДокумент();
			
			НовЗаявка.VIN = Авто.VIN;
			НовЗаявка.Автомобиль = Авто;
			НовЗаявка.Дата = ТекущаяДата();
			НовЗаявка.Автор = ПараметрыСеанса.Пользователь;
			НовЗаявка.Менеджер = ПараметрыСеанса.Пользователь.Сотрудник;
			НовЗаявка.Клиент = Объект.Клиент;
			НовЗаявка.РабочийЛист = Объект.IDK;
			
			ЕстьПравоСразуРезервироватьАвтомобиль = ПараметрыСеанса.Renault_ПраваПользователя.РезервироватьАвтомобильБезСогласования;
			
			Если ЕстьПравоСразуРезервироватьАвтомобиль Тогда
				НовЗаявка.Контролер = ПараметрыСеанса.Пользователь;
				НовЗаявка.СтатусРезерва = Перечисления.CRM_СтатусыРезервовАвтомобилей.РезервУтвержден;
			Иначе
				НовЗаявка.СтатусРезерва = Перечисления.CRM_СтатусыРезервовАвтомобилей.ЗаявкаНаРезерв;
			КонецЕсли;
			
			НовЗаявка.Комментарий = КомментарийКЗаявке;
			НовЗаявка.ДатаСнятияРезерва = ДатаСнятияСРезерва;			
			НовЗаявка.Записать(РежимЗаписиДокумента.Проведение);			
			
			ОбновитьСписокРезервов();
		КонецЕсли;
		
		ДоговорОбъектНового = Документы.Renault_Договор.СоздатьДокумент();
		ДоговорОбъектНового.Дата = ТекущаяДата();
		ДоговорОбъектНового.ДатаДоговора = ТекущаяДата();	
		ДоговорОбъектНового.РабочийЛист = Объект.IDK;
		ДоговорОбъектНового.СтатусДоговора = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Черновик;
		ДоговорОбъектНового.Клиент = Объект.Клиент;
		ДоговорОбъектНового.ДилерскийЦентр = Объект.ДилерскийЦентр;
		Стр = ДоговорОбъектНового.СоставДоговора.Добавить();
		Стр.Автомобиль = Авто;
		Стр.Идентификатор = Новый УникальныйИдентификатор;
		Стр.VIN = Авто.VIN;
		ФормаДоговора = ДоговорОбъектНового.ПолучитьФорму();
		ФормаДоговора.ПерезаполнитьДоговор = Истина;
		
		//Коммерческие акции
		Для каждого Стр Из КП.СкидкиКонфигурации Цикл
			Скидки = ДоговорОбъектНового.СкидкиДоговора.Добавить();
			ЗаполнитьЗначенияСвойств(Скидки, Стр);
			Скидки.Идентификатор = Стр.Акция.УникальныйИдентификатор();
			СкидкиРасшифровка = ДоговорОбъектНового.СкидкиRenualtРасшифровка.Добавить();
			СкидкиРасшифровка.Акция = Стр.Акция;
			СкидкиРасшифровка.ЗначениеСкидки = Стр.СуммаСкидки;
			СкидкиРасшифровка.Вид = Стр.Акция.Наименование;
			СкидкиРасшифровка.КоммерческаяАкцияGUID = Стр.Акция.УникальныйИдентификатор();
			СкидкиРасшифровка.Идентификатор = Стр.Акция.УникальныйИдентификатор();
			СкидкиРасшифровка.Флажок = Истина;
		КонецЦикла;
		
		ФормаДоговора.Открыть();
		
	КонецЕсли;
	
КонецПроцедуры // СоздатьДоговорПоРезерву()

&НаКлиенте
Процедура СоздатьВыдачу(Команда)
	
	// на всякий случай обновим список выдач, он может быть неактуален, если с рабочим листом работает несколько человек одновременно
	ОбновитьСписокВыдач();
	
	//ВазСистем Тарасов 13.12.2020 17:42:23 Инцидент #DMSREN-1046
	//{
	//Старый код:
	//Если ТипЗнч(Объект.Клиент) = Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты") Тогда
	//	Сообщить("Планирование выдачи для потенциального клиента невозможно");
	//	Возврат;
	//КонецЕсли;
	//Новый код:
	//}
	
	Строка = Элементы.Договоры.ТекущиеДанные;
	
	// ++ начало Давыдов А. 2020-04-30
	Если Строка = Неопределено Тогда
		Если Договоры.Количество() = 1 Тогда
			Строка = Договоры[0];
		Иначе
			Сообщить("Для планирования выдачи укажите договор!");
		КонецЕсли;  
	КонецЕсли;  
	
	// DMSREN-678 - сделаем проверку на повторную выдачу авто. По-хорошему, надо вычищать повторные проверки.
	// но тогда много где много чего найдется переделывать. Поэтому, просто вставлю свою проверку.
	// Рекомендуется использовать ее.
	Если Строка = Неопределено Тогда
		Возврат;
	Иначе 
		ТекстСообщения = "";
		Если CRM_Сервер.ЕстьВыданныеАвтомобили(Объект.IDK, Строка.VIN, Истина, ТекстСообщения) Тогда
			Сообщить("По данному VIN: " + Строка.VIN + " уже существует выдача.");
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	// -- конец Давыдов А.
	
		Если Строка <> Неопределено Тогда
		СтруктураПоиска = Новый Структура("Автомобили", Строка.VIN);
		НайденныеСтроки = Выдачи.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаТаблицыВыдачи = НайденныеСтроки[0];
		Иначе
			СтрокаТаблицыВыдачи = Неопределено;
		КонецЕсли;
		
		Если СтрокаТаблицыВыдачи = Неопределено Тогда
			СоздатьЗаписьНаВыдачу(Строка.VIN);
		Иначе
			Если СтрокаТаблицыВыдачи.Статус	= Перечисления.CRM_СтатусыДокументаЗаписьНаВыдачу.Отменено Тогда
				Ответ = Вопрос("По данному VIN: " + Строка.VIN + " уже существует отмененная выдача. Хотите снова запланировать?",РежимДиалогаВопрос.ДаНет);
				Если Ответ = КодВозвратаДиалога.Да Тогда
					СтруктураПоиска = Новый Структура("Автомобили", Строка.VIN);
					НайденныеСтроки = Выдачи.НайтиСтроки(СтруктураПоиска);
					СобытиеОбъект = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
					СобытиеОбъект.Обработано = Ложь;
					СобытиеОбъект.ДатаЗакрытия = Дата(1,1,1);
					СобытиеОбъект.КомментарийЗакрытия = "";
					СобытиеОбъект.Объект = НайденныеСтроки[0].Ссылка;
					СобытиеОбъект.ДоговорНаПродажуАвтомобиля = Строка.Ссылка;
					СобытиеОбъект.IDK = Объект.IDK;
					ФормаСобытия = СобытиеОбъект.ПолучитьФорму("ФормаСозданияСобытия");
					ФормаСобытия.ОткрытьМодально();
					ОбновитьСписокВыдач();
				КонецЕсли;
			Иначе 
				Сообщить("По данному VIN: " + Строка.VIN + " уже существует выдача.");
			КонецЕсли;
		КонецЕсли;
		
		ОбновитьСписокКонтрактов();
		
	КонецЕсли;
	
КонецПроцедуры // СоздатьВыдачу()

&НаКлиенте
Процедура ИзменитьВыдачу(Команда)
	
	Перем НоваяДатаВыдачи;
	
	ТекДанные = Элементы.Выдачи.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		
		ВвестиДату(НоваяДатаВыдачи, "Введите новую дату выдачи", ЧастиДаты.Дата);
		
		ДокСсылка = CRM_Сервер.ПолучитьАктуальноеСобытиеВыдачи(Элементы.Выдачи.ТекущиеДанные.Ссылка);
		СобытиеОбъект = ДокСсылка.ПолучитьОбъект();		
		СобытиеОбъект.ДатаЗакрытия = НоваяДатаВыдачи;
		СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Если ДокСсылка = Неопределено Тогда
				
				Сообщить ("Не удалось отменить Событие выдача");
			иначе

		ВыдачаОбъект = СобытиеОбъект.Объект.ПолучитьОбъект();
		ВыдачаОбъект.ДатаВыдачи = НоваяДатаВыдачи;
		ВыдачаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		
		ОбновитьВоронкуИСписки();
		
	КонецЕсли;
	
КонецПроцедуры // ИзменитьВыдачу()

&НаКлиенте
Процедура ОтменитьВыдачу(Команда)
	
	ТекДанные = Элементы.Выдачи.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		
		Ответ = Вопрос("Отменить выдачу?", РежимДиалогаВопрос.ДаНет);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
		
			ДокСсылка = CRM_Сервер.ПолучитьАктуальноеСобытиеВыдачи(Элементы.Выдачи.ТекущиеДанные.Ссылка);
			ЗаписьНаВыдачу = Элементы.Выдачи.ТекущиеДанные.Ссылка.ПолучитьОбъект();
			ЗаписьНаВыдачу.Статус = Перечисления.CRM_СтатусыДокументаЗаписьНаВыдачу.Отменено;
			ЗаписьНаВыдачу.Записать(РежимЗаписиДокумента.Проведение);
			
			Если ДокСсылка = Неопределено Тогда
				
				Сообщить ("Не удалось отменить Событие выдача");
			иначе
				СобытиеОбъект = ДокСсылка.ПолучитьОбъект();
				СобытиеОбъект.Обработано = Истина;
				СобытиеОбъект.КомментарийЗакрытия = "Выдача отменена";
				СобытиеОбъект.ДатаЗакрытия = ТекущаяДата();
				СобытиеОбъект.ЗавершеноУспешно = Ложь;
				СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
			КонецЕсли;
			
			ОбновитьВоронкуИСписки();
			
		КонецЕсли;
		
		ОбновитьСписокКонтрактов();
	КонецЕсли;

	
КонецПроцедуры // ОтменитьВыдачу()

&НаКлиенте
Процедура ЗапланироватьОплату(Команда)
	
	ОткрытьФорму("Обработка.Renault_КалендарьСобытий.Форма.ГрафикОплат", Новый Структура("IDK", Объект.IDK));
	
КонецПроцедуры // ЗапланироватьОплату()

&НаКлиенте
Процедура ДобавитьКомментарийРОП(Команда)
	
	Если НЕ ЗначениеЗаполнено(КомментарийРОП) Тогда
		Предупреждение("Поле комментарий пустое!!!");
		Возврат;
	КонецЕсли;
	
	Комент = РегистрыСведений.CRM_РезолюцииПоРабочимЛистам.СоздатьМенеджерЗаписи();
	Комент.Период       = ТекущаяДата();
	Комент.Дата         = ТекущаяДата();
	Комент.IDK          = Объект.IDK;
	Комент.ID           = СокрЛП(Новый УникальныйИдентификатор); 
	Комент.Сотрудник         = ПараметрыСеанса.Пользователь.Сотрудник;
	Комент.Комментарий       = СокрЛП(КомментарийРОП);
	Комент.Подразделение     = ПараметрыСеанса.ПодразделениеКомпании;
	Комент.Комментарий       = СокрЛП(КомментарийРОП);
	Комент.Записать();
	КомментарийРОП = "";
	ОбновитьКомментарийРезолюция();
	
КонецПроцедуры  // ДобавитьКомментарийРОП()

&НаКлиенте
Процедура ИзменитьМенеджера(Команда)
	
	Список = Renault_CRM.ПолучитьСписокСотрудниковПоОтделу(Объект.Отдел);
	ФормаСписка = Обработки.Renault_ARM_Администратор.ПолучитьФорму("ФормаВыбораИзСпискаПлиткой");
	ФормаСписка.Список = Список;
	ФормаСписка.Заголовок = "Выбор менеджера";
	ФормаСписка.КнопокВСтроке = 2;
	ФормаСписка.ВысотаКнопки = 40;
	ФормаСписка.ЭлементыФормы.Отмена.Заголовок = "Отмена";
	Ответ = ФормаСписка.ОткрытьМодально();
	Если ЗначениеЗаполнено(Ответ) Тогда
		Объект.Сотрудник = Ответ;
		ЗаписатьРабочийЛист();
		
		
		//Перенес это в модуль объекта, т.к. выглядит нелогично...
		Возврат;
		
		
		//Также изменим исполнителя у всех событий по рабочему листу
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_СобытияПоРабочимЛистам.Ссылка
		|ИЗ
		|	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
		|ГДЕ
		|	CRM_СобытияПоРабочимЛистам.IDK = &IDK
		|	И CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ";
		Запрос.УстановитьПараметр("IDK", Объект.IDK);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ЗаписьСобытие = Выборка.Ссылка.ПолучитьОбъект();
			ЗаписьСобытие.Сотрудник = Объект.Сотрудник;
			ЗаписьСобытие.Записать();
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ИзменитьМенеджера()

&НаКлиенте
Процедура ПодтвердитьЗакрытие(Команда)
	
	Объект.ЛистЗакрыт = Не Объект.ЛистЗакрыт;
	Период = ТекущаяДата();
	Если Объект.ЛистЗакрыт Тогда
		АвторЗакрытия = ТекМенеджер;
	Иначе
		АвторЗакрытия = Неопределено;
	КонецЕсли;
	ЗаписатьРабочийЛист();
	ОбновитьЦветКнопокРОП();
	
КонецПроцедуры // ПодтвердитьЗакрытие()

&НаКлиенте
Процедура СоздатьКонтрагента(Команда)
	
	Ответ = Вопрос("Будет создан новый контрагент. Продолжить?", РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		КлиентДоговора = Объект.Клиент;
		Контрагент = CRM_Редубликация.СоздатьКонтрагентаНаОснованииПотенциальногоКлиента(КлиентДоговора);
		КонтрагентОбъект = Контрагент.ПолучитьОбъект();
		КонтрагентОбъект.ИНН = Объект.Клиент.ИНН;
		Если ЗначениеЗаполнено(Объект.ДилерскийЦентр) Тогда
			КонтрагентОбъект.Родитель = Объект.ДилерскийЦентр.КаталогСозданияКонтрагентов;
		КонецЕсли;
		КонтрагентОбъект.Записать();
		
		Запись = РегистрыСведений.Renault_КлиентыНаЗамену.СоздатьМенеджерЗаписи();
		Запись.Клиент = КлиентДоговора;
		Запись.Записать();
		
		Оповестить("ОбновитьРабочийЛистПослеЗаписиКонтрагента");
		
		ОбновитьКнопкиТипКлиента();
		
	КонецЕсли;
	
КонецПроцедуры // СоздатьКонтрагента()

&НаКлиенте
Процедура ВыбратьКонтрагентаИзСправочника(Команда)
	
	ФормаВыбораКонтрагента = Справочники.Контрагенты.ПолучитьФормуВыбора(, ЭтаФорма);
	ФормаВыбораКонтрагента.РежимВыбора = Истина;
	НовыйКонтрагент = ФормаВыбораКонтрагента.ОткрытьМодально();
	
	Если ЗначениеЗаполнено(НовыйКонтрагент) Тогда
		ТекстВопроса = "Установить выбранного контрагента для данного договора?";
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
		КлиентДоговора = Объект.Клиент;
		Если ЗначениеЗаполнено(КлиентДоговора) Тогда
			Если ТипЗнч(КлиентДоговора) = Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты") Тогда
				КлиентОбъект = КлиентДоговора.ПолучитьОбъект();
				КлиентОбъект.Контрагент = НовыйКонтрагент;
				КлиентОбъект.Записать();
			КонецЕсли;
			Запись = РегистрыСведений.Renault_КлиентыНаЗамену.СоздатьМенеджерЗаписи();
			Запись.Клиент = КлиентДоговора;
			Запись.Записать();
		КонецЕсли;
		Оповестить("ОбновитьРабочийЛистПослеЗаписиКонтрагента");
	КонецЕсли;
	
КонецПроцедуры // ВыбратьКонтрагентаИзСправочника()

&НаКлиенте
Процедура ОтправитьНаСогласование(Команда)
	
	ДанныеЗаполнены = ДанныеКорпКлиентаЗаполнены(КорпКлиент);
	Если НЕ ДанныеЗаполнены Тогда
		ФормаКорпКлиента = Справочники.Renault_КорпоративныеКлиенты.ПолучитьФорму(
					"Renault_ФормаКорпоративногоКлиента",,
					КорпКлиент.Контрагент.УникальныйИдентификатор());
		Если ФормаКорпКлиента <> Неопределено Тогда
			Если ФормаКорпКлиента.Открыта() Тогда
				ФормаКорпКлиента.Активизировать();
			КонецЕсли;
		Иначе
			ФормаКорпКлиента = КорпКлиент.ПолучитьФорму("Renault_ФормаКорпоративногоКлиента");
			ФормаКорпКлиента.СправочникОбъект = КорпКлиент.Контрагент.ПолучитьОбъект();
			ФормаКорпКлиента.СферыДеятельности = КорпКлиент.СферыДеятельности.Выгрузить();
			ФормаКорпКлиента.Автопарк = КорпКлиент.Автопарк.Выгрузить();
			ФормаКорпКлиента.Открыть();
		КонецЕсли;
		Элементы.Клиент_ФИОКОРП.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	КорпКлиентОбъект = КорпКлиент.ПолучитьОбъект();
	КорпКлиентОбъект.Состояние = Перечисления.Renault_СостоянияСогласованияКлиента.НаСогласовании;
	КорпКлиентОбъект.Записать();
	ОбновитьСтатусКорпКлиента();
	
	ОбновитьКнопкиТипКлиента();
	
	Если ЗначениеЗаполнено(КорпКлиент.Идентификатор) Тогда
		КлиентОбъект = КорпКлиент.ПолучитьОбъект();
		КлиентОбъект.Состояние = Перечисления.Renault_СостоянияСогласованияКлиента.Согласован;
		КлиентОбъект.Записать();
		КорпКлиентСтатус = Строка(КорпКлиент.Состояние);
	КонецЕсли;
	
КонецПроцедуры // ОтправитьНаСогласование()

&НаКлиенте
Процедура ОбновитьСтатусКлиента(Команда)
	
	ОбновитьСтатусКорпКлиента();
	
КонецПроцедуры // ОбновитьСтатусКлиента()

&НаКлиенте
Процедура ПерейтиКЗаявкамНаСкидки(Команда)
	
	ПараметрыФормы = Новый	Структура;
	ПараметрыФормы.Вставить("Клиент", КорпКлиент);
	ПараметрыФормы.Вставить("РабочийЛист", Объект.IDK);
	ОткрытьФорму("Обработка.Renault_АРМ_КорпоративныеСкидки.Форма.ФормаЗаявкиКлиента", ПараметрыФормы);
	
КонецПроцедуры // ПерейтиКЗаявкамНаСкидки()

&НаКлиенте
Процедура ОтправитьКомментарий(Команда)
	
	Если Не ЗначениеЗаполнено(НовыйКомментарий) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаДобавления = ТекущаяУниверсальнаяДата();
	
	РегистрыСведений.RenaultFlotte_ИсторияКомментариев.ДобавитьКомментарий(
		КорпКлиент.ИдЗаявки,
		НовыйКомментарий,
		ПараметрыСеанса.Renault_ПраваПользователя.ДилерскийЦентр,
		ДатаДобавления);
	
	ЗаполнитьСписокКомментариев();
	НовыйКомментарий = "";
	
КонецПроцедуры // ОтправитьКомментарий()

&НаКлиенте
Процедура Клиент_ФИОНачалоВыбора(Команда)
	
	ФормаВыбораКонтрагента = Справочники.Контрагенты.ПолучитьФормуВыбора(, ЭтаФорма);
	ФормаВыбораКонтрагента.РежимВыбора = Истина;
	ВыбранныйКонтрагент = ФормаВыбораКонтрагента.ОткрытьМодально();

	Если ЗначениеЗаполнено(ВыбранныйКонтрагент) Тогда
		ТекстВопроса = "Установить выбранного контрагента для данного рабочего листа?";	
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0);	
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
		
		Если Справочники.Renault_ПрофилиКлиентов.Используются() Тогда
			Профиль = Справочники.Renault_ПрофилиКлиентов.СохранитьКлиентаВПрофиль(ВыбранныйКонтрагент);
			Справочники.Renault_ПрофилиКлиентов.ДобавитьКлиента(Профиль, ВыбранныйКонтрагент);
		КонецЕсли;
		
		ЗаменитьКонтрагента(ВыбранныйКонтрагент);
		
		//Записать();
		ЭтаФорма.ОбновитьОтображениеДанных();
		ПрочитатьДанныеКлиентаСервер();
		
	КонецЕсли;
	
	//Заменим клиента в заявку ТрейдИн если она есть
    Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн) Тогда
        
        лЗаявкаНаТрейдИн = ЗаявкаНаТрейдИн.ПолучитьОбъект();
        лЗаявкаНаТрейдИн.Клиент = Объект.Клиент;
        
        Попытка
            лЗаявкаНаТрейдИн.Записать();
        Исключение
            
        КонецПопытки;
        
	КонецЕсли;
	
	СогласиеНаОПД();
	
КонецПроцедуры // Клиент_ФИОНачалоВыбора()

&НаКлиенте
Процедура Клиент_ФИООткрытие(Команда)
	
	Если ТипЗнч(Объект.Клиент) = Тип("СправочникСсылка.Контрагенты") Тогда
		Если Объект.ТипКлиента = Перечисления.Renault_ТипыКлиентов.КорпоративныйКлиент Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Renault_КорпоративныеКлиенты.Ссылка
			|ИЗ
			|	Справочник.Renault_КорпоративныеКлиенты КАК Renault_КорпоративныеКлиенты
			|ГДЕ
			|	Renault_КорпоративныеКлиенты.Контрагент = &Контрагент";
			Запрос.УстановитьПараметр("Контрагент", Объект.Клиент);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				КорпКлиент  = Выборка.Ссылка;
				КонтрагентСсылка = КорпКлиент.Контрагент;
				ФормаКорпКлиента = Справочники.Renault_КорпоративныеКлиенты.ПолучитьФорму(
					"Renault_ФормаКорпоративногоКлиента",,
					КорпКлиент.Контрагент.УникальныйИдентификатор());
				ФормаКорпКлиента.СправочникОбъект = КонтрагентСсылка.ПолучитьОбъект();
				ФормаКорпКлиента.СферыДеятельности = КорпКлиент.СферыДеятельности.Выгрузить();
				ФормаКорпКлиента.Автопарк = КорпКлиент.Автопарк.Выгрузить();
				ФормаКорпКлиента.КлючУникальности = КорпКлиент.Контрагент.УникальныйИдентификатор(); 
				ФормаКорпКлиента.ОткрытьМодально();
			Иначе
				Объект.Клиент.ПолучитьФорму("Renault_Форма", ЭтаФорма).Открыть();
			КонецЕсли;
		Иначе
			Объект.Клиент.ПолучитьФорму("Renault_Форма", ЭтаФорма).Открыть();
		КонецЕсли;
	Иначе
		Renault_CRM.ОткрытьКарточкуКлиента(Объект.Клиент,);
	КонецЕсли;
	
КонецПроцедуры // Клиент_ФИООткрытие()

&НаКлиенте
Процедура Клиент_КорпоративныйКонтЛицоФИОНачалоВыбора(Команда)

	Если ТипЗнч(Объект.Клиент) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		ФормаВыбора = Справочники.Контрагенты.ПолучитьФормуВыбора("ФормаСписка", ЭтаФорма);
		
		ФормаВыбора.Отбор.ВидКонтрагента.ВидСравнения = ВидСравнения.Равно;
		ФормаВыбора.Отбор.ВидКонтрагента.Значение = Перечисления.ВидыКонтрагентов.КонтактноеЛицо;
		ФормаВыбора.Отбор.ВидКонтрагента.Использование = Истина;
		
		ФормаВыбора.Отбор.ВидОтношений.ВидСравнения = ВидСравнения.Равно;
		ФормаВыбора.Отбор.ВидОтношений.Значение = Справочники.ВидыВзаимоотношений.КонтактноеЛицо;
		ФормаВыбора.Отбор.ВидОтношений.Использование = Истина;

		ФормаВыбора.Отбор.ФормаСобственности.ВидСравнения = ВидСравнения.Равно;
		ФормаВыбора.Отбор.ФормаСобственности.Значение = Перечисления.ФормыСобственности.ЧастноеЛицо;
		ФормаВыбора.Отбор.ФормаСобственности.Использование = Истина; 
		
		ФормаВыбора.Отбор.ВедушийКонтрагент.ВидСравнения = ВидСравнения.Равно;
		ФормаВыбора.Отбор.ВедушийКонтрагент.Значение = Объект.Клиент;
		ФормаВыбора.Отбор.ВедушийКонтрагент.Использование = Истина;
		
		ФормаВыбора.ЭлементыФормы.Список.НастройкаОтбора.ВидКонтрагента.Доступность = Ложь;
		ФормаВыбора.ЭлементыФормы.Список.НастройкаОтбора.ВидОтношений.Доступность = Ложь;
		ФормаВыбора.ЭлементыФормы.Список.НастройкаОтбора.ФормаСобственности.Доступность = Ложь;
		ФормаВыбора.ЭлементыФормы.Список.НастройкаОтбора.ВедушийКонтрагент.Доступность = Ложь;
		ФормаВыбора.ЭлементыФормы.Список.ИерархическийПросмотр = Ложь;
		
		КонтЛицо = ФормаВыбора.ОткрытьМодально();
		
		Если КонтЛицо <> Неопределено Тогда
			Клиент_КорпоративныйКонтЛицо = КонтЛицо;
			Клиент_КорпоративныйКонтЛицоФИО = Клиент_КорпоративныйКонтЛицо.Наименование;
		КонецЕсли;
		
	КонецЕсли; 
	
	Если ТипЗнч(Объект.Клиент) = Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты") Тогда
		
		ФормаВыбора = Справочники.CRM_ПотенциальныеКонтрагенты.ПолучитьФормуВыбора(, ЭтаФорма);
		
		Отбор = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидКонтрагента");
		Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Отбор.ПравоеЗначение = Перечисления.ВидыКонтрагентов.КонтактноеЛицо;
		Отбор.Использование = Истина;		
		Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		Отбор = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОтношений");
		Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Отбор.ПравоеЗначение = Справочники.ВидыВзаимоотношений.КонтактноеЛицо;
		Отбор.Использование = Истина;		
		Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		Отбор = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФормаСобственности");
		Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Отбор.ПравоеЗначение = Перечисления.ФормыСобственности.ЧастноеЛицо;
		Отбор.Использование = Истина;		
		Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		Отбор = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Renault_ВедушийКонтрагент");
		Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Отбор.ПравоеЗначение = Объект.Клиент;
		Отбор.Использование = Истина;		
		Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;		
		
		КонтЛицо = ФормаВыбора.ОткрытьМодально();
		
		Если КонтЛицо <> Неопределено Тогда
			Клиент_КорпоративныйКонтЛицо = КонтЛицо;
			Клиент_КорпоративныйКонтЛицоФИО = Клиент_КорпоративныйКонтЛицо.Наименование;
		КонецЕсли;
		
	КонецЕсли;
	
	Клиент_КорпоративныйКонтЛицоФИОПриИзменении(Неопределено);
	
КонецПроцедуры // Клиент_КорпоративныйКонтЛицоФИОНачалоВыбора()

&НаКлиенте
Процедура Клиент_КорпоративныйКонтЛицоФИООткрытие(Команда)
	
	Если ЗначениеЗаполнено(Клиент_КорпоративныйКонтЛицо) Тогда
		
		Если ТипЗнч(Объект.Клиент) = Тип("СправочникСсылка.Контрагенты") Тогда
			Клиент_КорпоративныйКонтЛицо.ПолучитьФорму("Renault_Форма", ЭтаФорма).Открыть();		
		КонецЕсли;        

		Если ТипЗнч(Объект.Клиент) = Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты") Тогда
	    	Клиент_КорпоративныйКонтЛицо.ПолучитьФорму(, ЭтаФорма).Открыть();		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // Клиент_КорпоративныйКонтЛицоФИООткрытие()

&НаКлиенте
Процедура Клиент_СфераДеятельностиНачалоВыбора(Команда)
	
	ФормаСфераДеятельности = Справочники.Renault_СферыДеятельностиКлиентов.ПолучитьФормуВыбора("ФормаВыбора");
	Ответ = ФормаСфераДеятельности.ОткрытьМодально();
	Если Ответ <> Неопределено Тогда
		Клиент_СфераДеятельности = Ответ;
	КонецЕсли;
	
	Клиент_АвтопаркПриИзменении(Неопределено);
	
КонецПроцедуры // Клиент_СфераДеятельностиНачалоВыбора()

&НаКлиенте
Процедура МодельАвтомобиляНачалоВыбора(Команда)
	
	Пред = Объект.МодельАвтомобиля;
	ТаблицаМоделей = Renault_CRM.ПолучитьТаблицуМоделей();
	Ответ = ТаблицаМоделей.ВыбратьСтроку("Выбор модели автомобиля");
	Если Ответ <> Неопределено Тогда
		Объект.МодельАвтомобиля = Ответ.Модель;
	КонецЕсли;
	Если Пред <> Объект.МодельАвтомобиля Тогда	
		Объект.Комплектация = Справочники.ВариантыКомплектации.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры // МодельАвтомобиляНачалоВыбора()

&НаКлиенте
Процедура КомплектацияНачалоВыбора(Команда)
	
	ТаблицаВерсий = Renault_CRM.ПолучитьТаблицуВерсий(Объект.МодельАвтомобиля);
	Ответ = ТаблицаВерсий.ВыбратьСтроку("Выбор версии автомобиля");
	Если Ответ <> Неопределено Тогда
		Объект.Комплектация = Ответ.Версия;
	КонецЕсли;
	
КонецПроцедуры // КомплектацияНачалоВыбора()

&НаКлиенте
Процедура ЦветНачалоВыбора(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.МодельАвтомобиля) Тогда    
		Предупреждение("Предварительно необходимо выбрать модель");
		Возврат;
	КонецЕсли;
	ФормаЦвета = Справочники.Renault_НаборЦветов.ПолучитьФормуВыбора("ФормаВыбора");
	ФормаЦвета.СправочникСписок.Отбор.Владелец.Значение = Объект.МодельАвтомобиля;
	ФормаЦвета.СправочникСписок.Отбор.Владелец.Использование = Истина;
	Ответ = ФормаЦвета.ОткрытьМодально();
	Если Ответ <> Неопределено Тогда
		Объект.Цвет = Ответ;
	КонецЕсли;
	
КонецПроцедуры // ЦветНачалоВыбора()

&НаКлиенте
Процедура АвтомобильБУНачалоВыбора(Команда)
	
	Ответ = ОткрытьФормуМодально("Документ.Renault_РабочийЛист.Форма.ФормаВыбораАвтомобиляБУ");
	Если Ответ <> Неопределено Тогда
		Объект.АвтомобильБУ = Ответ;
	КонецЕсли;
	
КонецПроцедуры // АвтомобильБУНачалоВыбора()

&НаКлиенте
Процедура ПроизводительТрейдИнВыбратьИзСписка(Команда)
	
	ВыбратьЭлементИзСписка(Команда);
	ПроизводительТрейдИнПриИзменении(Неопределено);
	
КонецПроцедуры // ПроизводительТрейдИнВыбратьИзСписка()

&НаКлиенте
Процедура ГодВыпускаТрейдИнВыбратьИзСписка(Команда)
	
	ВыбратьЭлементИзСписка(Команда);
	ГодВыпускаТрейдИнПриИзменении(Неопределено);
	
КонецПроцедуры // ГодВыпускаТрейдИнВыбратьИзСписка()

&НаКлиенте
Процедура МодельТрейдИнНачалоВыбораИзСписка(Команда)
	
	ВыбратьЭлементИзСписка(Команда);
	МодельТрейдИнПриИзменении(Неопределено);
	
КонецПроцедуры // МодельТрейдИнНачалоВыбораИзСписка()

&НаКлиенте
Процедура ОжидаемаяСтоимостьКлиентаТрейдИнНачалоВыбора(Команда)
	
	ВвестиЧисловойЭлемент(Команда);
	ОжидаемаяСтоимостьКлиентаТрейдИнПриИзменении(Неопределено);
	
КонецПроцедуры // ОжидаемаяСтоимостьКлиентаТрейдИнНачалоВыбора()

&НаКлиенте
Процедура ОчиститьАвтопарк(Команда)
	
	Клиент_АвтопаркПриИзменении(Неопределено);
	
КонецПроцедуры // ОчиститьАвтопарк()

&НаКлиенте
Процедура ОчиститьМодельАвтомобиля(Команда)
	
	ОчиститьЭлемент(Команда);
	
КонецПроцедуры // ОчиститьМодельАвтомобиля()

&НаКлиенте
Процедура ОчиститьКомплектация(Команда)
	
	ОчиститьЭлемент(Команда);
	
КонецПроцедуры // ОчиститьКомплектация()

&НаКлиенте
Процедура ОчиститьЦвет(Команда)
	
	ОчиститьЭлемент(Команда);
	
КонецПроцедуры // ОчиститьЦвет()

&НаКлиенте
Процедура ОчиститьАвтомобильБУ(Команда)
	
	ОчиститьЭлемент(Команда);
	
КонецПроцедуры // ОчиститьАвтомобильБУ()

&НаКлиенте
Процедура ОчиститьПроизводительТрейдИн(Команда)
	
	ОчиститьЭлемент(Команда);
	ПроизводительТрейдИнПриИзменении(Неопределено);
	
КонецПроцедуры // ОчиститьПроизводительТрейдИн()

&НаКлиенте
Процедура ОчиститьГодВыпускаТрейдИн(Команда)
	
	ОчиститьЭлемент(Команда);
	ГодВыпускаТрейдИнПриИзменении(Неопределено);
	
КонецПроцедуры // ОчиститьГодВыпускаТрейдИн()

&НаКлиенте
Процедура ОчиститьМодельТрейдИн(Команда)
	
	ОчиститьЭлемент(Команда);
	МодельТрейдИнПриИзменении(Неопределено);
	
КонецПроцедуры // ОчиститьМодельТрейдИн()

&НаКлиенте
Процедура ОчиститьОжидаемаяСтоимостьКлиентаТрейдИн(Команда)
	
	ОчиститьЭлемент(Команда);
	ОжидаемаяСтоимостьКлиентаТрейдИнПриИзменении(Неопределено);
	
КонецПроцедуры // ОчиститьОжидаемаяСтоимостьКлиентаТрейдИн()

&НаКлиенте
Процедура ВыбратьПервичныйИнтересМодель(Команда)
	
	//ВыбратьЭлемент(Команда); 
	
	ТаблицаМоделей = ПолучитьТаблицуПервичныйИнтерес();
	Ответ = ТаблицаМоделей.ВыбратьСтроку("Выбор модели автомобиля");
	Если Ответ <> Неопределено Тогда
		Объект.ПервичныйИнтересМодель = Ответ.Модель;
	КонецЕсли;
	
	ПервичныйИнтересМодельПриИзменении(Неопределено);
	
КонецПроцедуры // ВыбратьПервичныйИнтересМодель()

&НаКлиенте
Процедура ОчиститьПервичныйИнтересМодель(Команда)
	
	ОчиститьЭлемент(Команда);
	ПервичныйИнтересМодельПриИзменении(Неопределено);
	
КонецПроцедуры // ОчиститьПервичныйИнтересМодель()

&НаКлиенте
Процедура ВыбратьКлиент_ИсточникИнформации(Команда)
	
	СписокВыбора = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсточникиИнформации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CRM_ИсточникиИнформации КАК ИсточникиИнформации
	|ГДЕ
	|	ИсточникиИнформации.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИсточникиИнформации.Наименование";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	ВыбранныйЭлемент = ВыбратьИзСписка(СписокВыбора, Элементы.Клиент_ИсточникИнформации, СписокВыбора.НайтиПоЗначению(Клиент_ИсточникИнформации));
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Клиент_ИсточникИнформации = ВыбранныйЭлемент.Значение;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	
	//СохранитьИсточникИнформации();
	
	//ОбработкаОповещенияФормыЗаписи();
	
	Клиент_ИсточникИнформацииПриИзменении(Неопределено);
	
КонецПроцедуры // ВыбратьКлиент_ИсточникИнформации()

&НаКлиенте
Процедура ВыбратьГарантия(Команда)
	
	ВыбратьЭлементИзСписка(Команда);
	ПервичныйИнтересМодельПриИзменении(Неопределено);
	
КонецПроцедуры // ВыбратьГарантия()

&НаКлиенте
Процедура ВводКомментарияОК(Команда)
	
	Если НЕ ЗначениеЗаполнено(ТекстНовогоКомментария) ТОгда
		Предупреждение("Не заполнен текст комментария!");
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.CRM_Комментарии.ДобавитьКомментарий(ТекстНовогоКомментария,Объект.IDK,ИдентификаторКомментарияРодителя);
	
	ТекстНовогоКомментария = "";
	ИдентификаторКомментарияРодителя = Неопределено;
	ОбновитьКомментарий();
	Элементы.ГруппаСобытиеКомментарииСтраницы.ТекущаяСтраница = Элементы.ГруппаСобытиеКомментарииСтраницаКомментарии;
	
КонецПроцедуры // ВводКомментарияОК()

&НаКлиенте
Процедура ВводКомментарияОтмена(Команда)
	
	ТекстНовогоКомментария = "";
	ИдентификаторКомментарияРодителя = Неопределено;
	Элементы.ГруппаСобытиеКомментарииСтраницы.ТекущаяСтраница = Элементы.ГруппаСобытиеКомментарииСтраницаКомментарии;
	
КонецПроцедуры // ВводКомментарияОтмена()

&НаКлиенте
Процедура ОткрытьДоговор(Команда)
	Если Элементы.Договоры.ТекущиеДанные<> Неопределено Тогда
		ДокСсылка = Элементы.Договоры.ТекущиеДанные.Ссылка;
	Иначе 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокСсылка) Тогда
		ДокСсылка.ПолучитьФорму().Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВыдачу(Команда)
	
	//ДокСсылка = Элементы.Выдачи.ТекущиеДанные.Ссылка;
	//Если ЗначениеЗаполнено(ДокСсылка) Тогда
	//	ОткрытьЗначение(ДокСсылка);
	//КонецЕсли;
	//Блинков DMSREN-678 открытие обработки выдачи АМ
	Если Элементы.Выдачи.ТекущиеДанные<> Неопределено Тогда  
		ДокСсылка = Элементы.Выдачи.ТекущиеДанные.Ссылка;
	Иначе 
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(ДокСсылка) Тогда
	ФормаОбработки = Обработки.Renault_АРМ_ВыдачаАвтомобилей.ПолучитьФорму("Форма");
	ФормаОбработки.ТекЗаписьНаВыдачу = ДокСсылка;
	ФормаОбработки.НачалоПериода =   НачалоДня(ДокСсылка.ДатаНачала);
	ФормаОбработки.КонецПериода =   КонецДня(ДокСсылка.ДатаНачала);
	ФормаОбработки.Открыть();
	КонецЕсли;
	//Блинков DMSREN-678
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитовШапкиФормы

&НаКлиенте
Процедура Клиент_ТелефонПриИзменении(Элемент)
	
	Объект.Телефон = Renault_УправлениеКонтактнойИнформацией.НормализацияНомераТелефона(Клиент_Телефон, Объект.ДилерскийЦентр);
	ПровестиДедубликацию("Телефон");
	СохранитьДанныеКлиентаПриСменеТелефона(); //временно не используем - надо отладить функционал
	Воронка_ОбновитьВзятТелефон();
	
КонецПроцедуры // Клиент_ТелефонПриИзменении()

&НаКлиенте
Процедура Клиент_ФИОПриИзменении(Элемент)
	
	//На всякий случай обработаем случай, когда у рабочего листа не заполнен клиент
	//Это ошибка, но происхождение ее непонятно
	ЗаписьТрафик = Renault_CRM.ПолучитьЗаписьТрафикаПоID(Объект.IDТрафика);
	Если ЗаписьТрафик <> Неопределено И ЗначениеЗаполнено(ЗаписьТрафик.Клиент) Тогда
		Объект.Клиент = ЗаписьТрафик.Клиент;
		Клиент = ЗаписьТрафик.Клиент;
		ЗаписатьРабочийЛист();
	Иначе	
		//Если и там не заполнен - создадим нового потенциального
		Если ЗаписьТрафик = Неопределено Тогда
			Предупреждение("Ошибка. Нет трафика по рабочему листу. Обратитесь в поддержку DMS.");
			Клиент_ФИО = "";
			Возврат;
		КонецЕсли;
		Клиент = CRM_Сервер.СоздатьПотенциальногоКонтрагентаПоТрафику(Объект.IDТрафика);
		Объект.Клиент = Клиент;
		ЗаписатьРабочийЛист();
		ЗаписьТрафик.Клиент = Клиент;
		ЗаписьТрафик.Записать();
	КонецЕсли;
	
	ПровестиДедубликацию("ФИО");
	Клиент = Объект.Клиент;
	Если ТипЗнч(Клиент) = Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты") Тогда
		СохранитьДанныеКлиента();
	ИначеЕсли ТипЗнч(Клиент) = Тип("СправочникСсылка.Контрагенты") Тогда
		Клиент_ФИО = Клиент.Наименование;
	КонецЕсли;
	
	Если Клиент_ФИО <> Клиент.Наименование Тогда
		
		Клиент_ФИО = Клиент.Наименование;
		
	КонецЕсли;
	
	//Заменим клиента в заявку ТрейдИн если она есть
	Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн) Тогда
		
		лЗаявкаНаТрейдИн = ЗаявкаНаТрейдИн.ПолучитьОбъект();
		лЗаявкаНаТрейдИн.Клиент = Клиент;
		
		Попытка
			лЗаявкаНаТрейдИн.Записать();
		Исключение
			
		КонецПопытки;
		
	КонецЕсли;
	
	ОбновитьСтатусКорпКлиента();
	
КонецПроцедуры // Клиент_ФИОПриИзменении()

&НаКлиенте
Процедура Клиент_EmailПриИзменении(Элемент)
	
	Объект.Email = Клиент_Email;//Блинков DMSREN-745
	
	Шаблон = ".+@.+\..+";
	
	RegExp = Новый COMОбъект("VBScript.RegExp");
	RegExp.MultiLine = Ложь;
	RegExp.Global = Истина;
	RegExp.IgnoreCase = Истина;
	RegExp.Pattern = Шаблон;
	Если RegExp.Test(Объект.Email) ИЛИ Объект.Email = "" Тогда
		ПровестиДедубликацию("EMail");	// pu02028 #ИЗМ000001
		СохранитьДанныеКлиентаПриСменеEmail();
		Воронка_ОбновитьВзятEmail();
	Иначе
		Сообщить("Некорректный адрес E-Mail");
		ЭтаФорма.ТекущийЭлемент = Элемент;
	КонецЕсли;
	
КонецПроцедуры // Клиент_EmailПриИзменении()

&НаКлиенте
Процедура ДокументСогласиеНаОбработкуПерсональныхДанныхНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Документ.DMS_СогласиеНаОбработкуПерсональныхДанных.ФормаОбъекта",Новый Структура("Ключ",СогласиеНаОПД()),ЭтаФорма,1,,,Новый ОписаниеОповещения("ЗавершениеРедактированияПД",ЭтаФорма));
	
КонецПроцедуры // ДокументСогласиеНаОбработкуПерсональныхДанныхНажатие()

&НаКлиенте
Процедура Клиент_КорпоративныйКонтЛицоФИОПриИзменении(Элемент)
	
	СохранитьДанныеКонтактногоЛица();
	
КонецПроцедуры // Клиент_КорпоративныйКонтЛицоФИОПриИзменении()

&НаКлиенте
Процедура Клиент_АвтопаркПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(КорпКлиент) Тогда
		
		ОбновитьДанныеКорпКлиента();
		
	КонецЕсли;
	
КонецПроцедуры // Клиент_АвтопаркПриИзменении()

&НаКлиенте
Процедура ПроизводительТрейдИнПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн) Тогда
		ЗаявкаНаТрейдИнОбъект = ЗаявкаНаТрейдИн.ПолучитьОбъект();
	Иначе
		Сообщить("Необходимо создать заявку на трейд-ин!");
		Возврат;
	КонецЕсли;
	
	ЗаявкаНаТрейдИнОбъект.ПроизводительКод = ПроизводительТрейдИн;
	ЗаявкаНаТрейдИнОбъект.МесяцВыпуска = "06";
	ЗаявкаНаТрейдИнОбъект.ГодВыпуска = "";
	ЗаявкаНаТрейдИнОбъект.МодельКод = "";
	ЗаявкаНаТрейдИнОбъект.ТипКузоваКод = "";
	ЗаявкаНаТрейдИнОбъект.ДвигательКод = "";
	ЗаявкаНаТрейдИнОбъект.КППКод = "";
	ЗаявкаНаТрейдИнОбъект.МодификацияКод = "";
	ЗаявкаНаТрейдИнОбъект.Опции.Очистить();
	ЗаявкаНаТрейдИнОбъект.ОриентировочнаяЦена = 0;  
	ЗаявкаНаТрейдИнОбъект.ОжиданиеСтоимостиКлиента = 0;
	ЗаявкаНаТрейдИнОбъект.Автомобиль = ПредопределенноеЗначение("Справочник.Автомобили.ПустаяСсылка");
	ЗаявкаНаТрейдИнОбъект.Цвет = ""; 
	ЗаявкаНаТрейдИнОбъект.VIN = "";
	ЗаявкаНаТрейдИнОбъект.ГосНомер = "";
	ЗаявкаНаТрейдИнОбъект.СрокДействия = "";
	ЗаявкаНаТрейдИнОбъект.ОценкаСостояния = ""; 
	ЗаявкаНаТрейдИнОбъект.Пробег = "";
	ЗаявкаНаТрейдИнОбъект.КоличествоВладельцевПоПТС = "";
	ЗаявкаНаТрейдИнОбъект.СостояниеШин = "";
	ЗаявкаНаТрейдИнОбъект.НаличиеАварий = Ложь;
	ЗаявкаНаТрейдИнОбъект.ОригиналПТС = Ложь;
	ЗаявкаНаТрейдИнОбъект.Металик = Ложь;
	ЗаявкаНаТрейдИнОбъект.Записать();
	
	ГодВыпускаТрейдИн = "";
	МодельТрейдИн = "";
	ОжидаемаяСтоимостьКлиентаТрейдИн = 0;
	
	Значение = ЗначениеЗаполнено(ПроизводительТрейдИн);
	Если Значение Тогда		
		ЗаполнитьСписокВыбораЭлемента("ГодВыпускаТрейдИн");
	КонецЕсли; 	
	
	ПараметрыУправленияЭлементами = Новый Структура();
	ПараметрыУправленияЭлементами.Вставить("ГодВыпускаТрейдИн", 						Значение);
	ПараметрыУправленияЭлементами.Вставить("ВыбратьГодВыпускаТрейдИн", 					Значение);
	ПараметрыУправленияЭлементами.Вставить("МодельТрейдИн", 							ЗначениеЗаполнено(ГодВыпускаТрейдИн));
	ПараметрыУправленияЭлементами.Вставить("ВыбратьМодельТрейдИн", 						ЗначениеЗаполнено(ГодВыпускаТрейдИн));
	ПараметрыУправленияЭлементами.Вставить("ОжидаемаяСтоимостьКлиентаТрейдИн", 			ЗначениеЗаполнено(МодельТрейдИн));
	ПараметрыУправленияЭлементами.Вставить("ВвестиОжидаемаяСтоимостьКлиентаТрейдИн", 	ЗначениеЗаполнено(МодельТрейдИн));

	ОбновитьИнтерфейсТрейдИн(ПараметрыУправленияЭлементами);
	
КонецПроцедуры // ПроизводительТрейдИнПриИзменении()

&НаКлиенте
Процедура ГодВыпускаТрейдИнПриИзменении(Элемент)
	
	ПриИзмененииДатыВыпуска();
	
КонецПроцедуры // ГодВыпускаТрейдИнПриИзменении()

&НаКлиенте
Процедура МодельТрейдИнПриИзменении(Элемент) 
	
	Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн) Тогда
		ЗаявкаНаТрейдИнОбъект = ЗаявкаНаТрейдИн.ПолучитьОбъект();
	Иначе
		Сообщить("Необходимо создать заявку на трейд-ин!");
		Возврат;
	КонецЕсли;
	
	ЗаявкаНаТрейдИнОбъект.МодельКод = МодельТрейдИн;
	ЗаявкаНаТрейдИнОбъект.ТипКузоваКод = "";
	ЗаявкаНаТрейдИнОбъект.ДвигательКод = "";
	ЗаявкаНаТрейдИнОбъект.КППКод = "";
	ЗаявкаНаТрейдИнОбъект.МодификацияКод = "";
	ЗаявкаНаТрейдИнОбъект.Опции.Очистить();
	ЗаявкаНаТрейдИнОбъект.ОриентировочнаяЦена = 0;  
	ЗаявкаНаТрейдИнОбъект.ОжиданиеСтоимостиКлиента = 0;
	ЗаявкаНаТрейдИнОбъект.Автомобиль = ПредопределенноеЗначение("Справочник.Автомобили.ПустаяСсылка");
	ЗаявкаНаТрейдИнОбъект.Цвет = ""; 
	ЗаявкаНаТрейдИнОбъект.VIN = "";
	ЗаявкаНаТрейдИнОбъект.ГосНомер = "";
	ЗаявкаНаТрейдИнОбъект.СрокДействия = "";
	ЗаявкаНаТрейдИнОбъект.ОценкаСостояния = ""; 
	ЗаявкаНаТрейдИнОбъект.Пробег = "";
	ЗаявкаНаТрейдИнОбъект.КоличествоВладельцевПоПТС = "";
	ЗаявкаНаТрейдИнОбъект.СостояниеШин = "";
	ЗаявкаНаТрейдИнОбъект.НаличиеАварий = Ложь;
	ЗаявкаНаТрейдИнОбъект.ОригиналПТС = Ложь;
	ЗаявкаНаТрейдИнОбъект.Металик = Ложь; 
	ЗаявкаНаТрейдИнОбъект.Записать();
	
	ОжидаемаяСтоимостьКлиентаТрейдИн = 0;
	
	Значение = ЗначениеЗаполнено(МодельТрейдИн);
	
	ПараметрыУправленияЭлементами = Новый Структура();
	ПараметрыУправленияЭлементами.Вставить("ОжидаемаяСтоимостьКлиентаТрейдИн", Значение);

	ОбновитьИнтерфейсТрейдИн(ПараметрыУправленияЭлементами);
	
КонецПроцедуры // МодельТрейдИнПриИзменении()

&НаКлиенте
Процедура ОжидаемаяСтоимостьКлиентаТрейдИнПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн) Тогда
		ЗаявкаНаТрейдИнОбъект = ЗаявкаНаТрейдИн.ПолучитьОбъект();
	Иначе
		Сообщить("Необходимо создать заявку на трейд-ин!");
		Возврат;
	КонецЕсли;
	
	ЗаявкаНаТрейдИнОбъект.ОжиданиеСтоимостиКлиента = ОжидаемаяСтоимостьКлиентаТрейдИн;	
	ЗаявкаНаТрейдИнОбъект.Записать();
	
КонецПроцедуры // ОжидаемаяСтоимостьКлиентаТрейдИнПриИзменении()

&НаКлиенте
Процедура ПервичныйИнтересМодельПриИзменении(Элемент)
	
	//При изменении первичного интереса будем записывать изменение первичного интереса в трафик			
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.Renault_Трафик КАК Renault_Трафик
	|ГДЕ
	|	Renault_Трафик.Идентификатор = &Идентификатор";
	Запрос.УстановитьПараметр("Идентификатор", Объект.IDТрафика);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаписьТрафик = РегистрыСведений.Renault_Трафик.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ЗаписьТрафик, Выборка);
		ЗаписьТрафик.Прочитать();
		ЗаписьТрафик.ПервичныйИнтерес = Объект.ПервичныйИнтересМодель;
		ЗаписьТрафик.Записать();
		ЗаписатьРабочийЛист();
		
	КонецЕсли;
	
	Если ТекущийЭлемент.Имя = "ВыбратьГарантия" И Объект.Гарантия = "Нет" Тогда
		СрокГарантии = 0;
		Элементы.СрокГарантии.Доступность = Ложь
	Иначе
		Элементы.СрокГарантии.Доступность = Истина
	КонецЕсли; 
	
	ОбработкаОповещенияФормыЗаписи();
	
КонецПроцедуры // ПервичныйИнтересМодельПриИзменении()

&НаКлиенте
Процедура Клиент_ИсточникИнформацииПриИзменении(Элемент)
	
	
	//+++
	//Сохраняем данные когда сохраняется документ
	ЭтаФорма.Модифицированность = Истина;
	Возврат;
	//---
	СохранитьИсточникИнформации();
	
	//При изменении источника информации будем записывать изменение источника информации в трафик
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.Renault_Трафик КАК Renault_Трафик
	|ГДЕ
	|	Renault_Трафик.Идентификатор = &Идентификатор";
	Запрос.УстановитьПараметр("Идентификатор", Объект.IDТрафика);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаписьТрафик = РегистрыСведений.Renault_Трафик.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ЗаписьТрафик, Выборка);
		ЗаписьТрафик.Прочитать();
		ЗаписьТрафик.ПервичныйИнтерес = Клиент_ИсточникИнформации;
		ЗаписьТрафик.Записать();
		ЗаписатьРабочийЛист();
		
	КонецЕсли;
	
	ОбработкаОповещенияФормыЗаписи();
	
КонецПроцедуры // Клиент_ИсточникИнформацииПриИзменении()

&НаКлиенте
Процедура Клиент_ГородПриИзменении(Элемент)
	
	ЭтаФорма.Модифицированность = Истина;
	//СохранитьГород();
	
КонецПроцедуры // Клиент_ГородПриИзменении()

&НаКлиенте
Процедура ТаблоКоментарииОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Расшифровка = "ДобавитьКомментарий" Тогда
		
		Элементы.ГруппаСобытиеКомментарииСтраницы.ТекущаяСтраница = Элементы.ГруппаСобытиеКомментарииСтраницаВводКомментария;		
		ЭтаФорма.ТекущийЭлемент = Элементы.ТекстНовогоКомментария;
		
	ИначеЕсли Расшифровка = "СортировкаКомментариевПоДате" Тогда  //Блинков DMSREN-786 Обработка именения сортировки
		
		СортировкаКомментариевПоДате = НЕ СортировкаКомментариевПоДате;
		ОбновитьКомментарий();
		
	Иначе
		
		ИдентификаторКомментарияРодителя = Расшифровка;
		ЭтаФорма.ТекущийЭлемент = Элементы.ТекстНовогоКомментария;
		Элементы.ГруппаСобытиеКомментарииСтраницы.ТекущаяСтраница = Элементы.ГруппаСобытиеКомментарииСтраницаВводКомментария;
		
	КонецЕсли;
	
КонецПроцедуры // ТаблоКоментарииОбработкаРасшифровки()

&НаКлиенте
Процедура ПолеСписокСобытийОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТабличныйДокумент    = Элементы.ПолеСписокСобытий;
	ТекущаяОбласть       = ТабличныйДокумент.ТекущаяОбласть;
	
	Если ТипЗнч(Расшифровка) = Тип("ДокументСсылка.CRM_СобытияПоРабочимЛистам") 
		И (Расшифровка.Обработано) Тогда// ИЛИ Расшифровка.ВидСобытия = Справочники.CRM_ВидыСобытий.Выдача) Тогда //DMSREN-365
		Если  Вопрос("Открыть результат события?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			ФормаЗавершенияСобытия = Расшифровка.ПолучитьФорму("ФормаЗавершенияСобытия");
			//ФормаЗавершенияСобытия.ТолькоПросмотр = Истина;
			ФормаЗавершенияСобытия.ЭлементыФормы.КнопкаУспешно.Доступность = Ложь;
			ФормаЗавершенияСобытия.ЭлементыФормы.КнопкаНеуспешно.Доступность = Ложь;
			ФормаЗавершенияСобытия.ЭлементыФормы.ТабличноеПолеАвтоДляВыдачи.Доступность = Ложь;
			ФормаЗавершенияСобытия.ЭлементыФормы.ДиалогКомментария.Доступность = Ложь;
			ФормаЗавершенияСобытия.ЭлементыФормы.КнопкаЗакрыть.Доступность = Истина;
			ФормаЗавершенияСобытия.ЭлементыФормы.ДатаЗакрытия.Доступность = Истина;
			ФормаЗавершенияСобытия.ЭлементыФормы.ДатаЗакрытия.ТолькоПросмотр = Ложь;
			ФормаЗавершенияСобытия.ЭлементыФормы.Комментарий.ТолькоПросмотр = Истина;
			ФормаЗавершенияСобытия.ЭлементыФормы.Сотрудник.ТолькоПросмотр = Истина;
			ФормаЗавершенияСобытия.Открыть();
			//ФормаЗавершенияСобытия.ОткрытьМодально();	

		КонецЕсли;
		
	ИначеЕсли ТекущаяОбласть.Лево = 17 тогда // DMSREN-1362 
		если ЗначениеЗаполнено(Расшифровка) тогда
			Парам = Новый Структура;
			Парам.Вставить("ID", Расшифровка);
			ФормаОбр = ПолучитьФорму("Обработка.Renault_АРМ_ContactCenter.Форма", Парам);
			//ФормаОбр = Обработки.Renault_АРМ_ContactCenter.ПолучитьФорму("Форма");
			//ФормаОбр.ИДТрафика = ID;
			ФормаОбр.Открыть();
		КонецЕсли;
	иначе
		
		ТекСобытие = Расшифровка;
		Ответ = ТекСобытие.ПолучитьФорму("ФормаЗавершенияСобытия",ЭтаФорма,УникальныйИдентификатор).ОткрытьМодально();
		
		Если ЗначениеЗаполнено(Ответ) Тогда
			
			Ответ = Вопрос("Ввести новое событие?", РежимДиалогаВопрос.ДаНет);
			Если Ответ = КодВозвратаДиалога.Да Тогда
				СоздатьНовоеСобытие();
			Иначе
				ОбновитьСписокСобытий();
			КонецЕсли;
			
			Renault_CRM.ОчиститьПроверкуПоРЛ(Объект.IDK);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПолеСписокСобытийОбработкаРасшифровки()

&НаКлиенте
Процедура ТаблицаКПВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//Если Поле.Имя <> "ОсновноеКП" Тогда
	//
	//	Если Модифицированность Тогда 
	//		ЗаписатьРабочийЛист();
	//	КонецЕсли;
	//
	//	ОткрытьФормуКомПредложения(Элементы.ТаблицаКП.ТекущиеДанные);
	//
	//КонецЕсли;
	
КонецПроцедуры // ТаблицаКПВыбор()

&НаКлиенте
Процедура ТаблицаКПОсновноеКППриИзменении(Элемент)
	
	УстановитьОсновноеКП(Элементы.ТаблицаКП.ТекущиеДанные.Ссылка, Элементы.ТаблицаКП.ТекущиеДанные.ОсновноеКП);
	
КонецПроцедуры // ТаблицаКПОсновноеКППриИзменении()

&НаКлиенте
Процедура ТаблоТестДрайвОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТабличныйДокумент    = Элементы.ТаблоТестДрайв;
	ТекущаяОбласть       = ТабличныйДокумент.ТекущаяОбласть;
	Если ТекущаяОбласть.Лево = 8 Тогда
		
		НомерДокумента = Расшифровка;
		CRM_Клиент.ДополнитьСтроку(НомерДокумента, 9, " ");
		ДокументСсылка = Документы.CRM_ЗаписьНаТестДрайв.НайтиПоНомеру(НомерДокумента);
		Если ЗначениеЗаполнено(ДокументСсылка) Тогда
			
			//Иначе печатаем типовой вариант
			МассивДокументов = Новый Массив;
			МассивДокументов.Добавить(ДокументСсылка);
			
			Форма = Документы.CRM_ЗаписьНаТестДрайв.ПолучитьФорму("ФормаЗаполненияДанныхДляПечати", ЭтаФорма);
			Форма.СсылкаНаОбъект = ДокументСсылка;
			Если НЕ Форма.ОткрытьМодально() = Истина Тогда
				Возврат;
			КонецЕсли;
			
			CRM_Клиент.ПечатьДокументаВыборФормы(МассивДокументов, "Документ.CRM_ЗаписьНаТестДрайв");
			
		КонецЕсли;
		
	ИначеЕсли ТекущаяОбласть.Лево = 9 Тогда
		
		ДокСобытие = Расшифровка;
		Ответ = ДокСобытие.ПолучитьФорму("ФормаЗавершенияСобытия").ОткрытьМодально();
		
	КонецЕсли;
	
КонецПроцедуры // ТаблоТестДрайвОбработкаРасшифровки()

&НаКлиенте
Процедура ДоговорыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//ДокСсылка = Элементы.Договоры.ТекущиеДанные.Ссылка;
	//ДокСсылка.ПолучитьФорму().Открыть();
	
КонецПроцедуры // ДоговорыВыбор()

&НаКлиенте
Процедура ВыдачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//ДокСсылка = Элементы.Выдачи.ТекущиеДанные.Ссылка;
	//Если ДокСсылка.Обработано = Ложь Тогда
	//	ДокСсылка.ПолучитьФорму("ФормаЗавершенияСобытия").Открыть();
	//КонецЕсли;
	
КонецПроцедуры // ВыдачиВыбор()

&НаКлиенте
Процедура Клиент_ИННПриИзменении(Элемент)
	
	УстановитьДоступностьРеквизитовКорпКлиента(Ложь);
	
	КонтрагентПоиск = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", Клиент_ИНН);
	Если Не ЗначениеЗаполнено(КонтрагентПоиск) Тогда
		
		Клиент_ИНН = СтрЗаменить(Клиент_ИНН, " ", "");
		СохранениеКонтрагентовСОшибочнымИНН = обПраво("СохранениеКонтрагентовСОшибочнымИНН", Права);
		Если СохранениеКонтрагентовСОшибочнымИНН <> Перечисления.ВидыКонтроля.НеКонтролировать Тогда
			ОшибкаИНН = ПроверкаИНН(Клиент_ИНН);
			Если ОшибкаИНН <> "" Тогда
				Если СохранениеКонтрагентовСОшибочнымИНН = Перечисления.ВидыКонтроля.Предупреждать Тогда
					ОтветНаПредупреждение=Вопрос(ОшибкаИНН + "
												|Вы хотите отправить запрос?",
												РежимДиалогаВопрос.ДаНет,,
												КодВозвратаДиалога.Нет,
												"Внимание");
					Если ОтветНаПредупреждение<>КодВозвратаДиалога.Да Тогда
						Отказ=Истина;
						Клиент_ИНН = "";
						Возврат;
					КонецЕсли;
				Иначе
					Сообщить(ОшибкаИНН); 
					Отказ=Истина;
					Клиент_ИНН = "";
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ДанныеПоКонтрагентуВЦентрБазе = RenaultFlotte_ОтправкаЗагрузкаКлиентов.ПоискКонтрагентаВDictionary(Клиент_ИНН);
		
		Если ДанныеПоКонтрагентуВЦентрБазе.Количество()>0 Тогда
			
			СостояниеКорпКлиента = ДанныеПоКонтрагентуВЦентрБазе.Состояние;
			
			Если СостояниеКорпКлиента = "В черном списке" Тогда
				
				Сообщить("Клиент не соответствует критериям корпоративного клиента");
				
			Иначе
				
				ЗагрузитьКорпоративногоКлиента(ДанныеПоКонтрагентуВЦентрБазе);
				Элементы.НадписьКОРПКлиентНайденный.Заголовок = Строка(КонтрагентПоиск);
				Элементы.НадписьКОРПКлиентНайденный.Гиперссылка = Истина;
				Сообщить("Клиент найден в центральной базе корп. продаж и загружен");
				
				//если у клиента уже есть идентификатор, 
				//то у него можно менять только контактные лица и контактную информацию
				УстановитьДоступностьРеквизитовКорпКлиента(Истина);
				
			КонецЕсли;
			
		Иначе
			
			Сообщить("Клиент ранее не обращался в Renault");
			
			Элементы.НадписьКОРПКлиентНайденный.Заголовок = "Контрагент не найден";
			Элементы.НадписьКОРПКлиентНайденный.Гиперссылка = Ложь;
			
		КонецЕсли;
		
	Иначе
		Элементы.НадписьКОРПКлиентНайденный.Заголовок = Строка(КонтрагентПоиск);
		Элементы.НадписьКОРПКлиентНайденный.Гиперссылка = Истина;
	КонецЕсли;
	
КонецПроцедуры // Клиент_ИННПриИзменении()

&НаКлиенте
Процедура Клиент_ФИОКОРПОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(КорпКлиент) Тогда
		КонтрагентСсылка = КорпКлиент.Контрагент;
		ФормаКорпКлиента = Справочники.Renault_КорпоративныеКлиенты.ПолучитьФорму(
			"Renault_ФормаКорпоративногоКлиента",,
			КорпКлиент.Контрагент.УникальныйИдентификатор());
		ФормаКорпКлиента.СправочникОбъект = КонтрагентСсылка.ПолучитьОбъект();
		ФормаКорпКлиента.СферыДеятельности = КорпКлиент.СферыДеятельности.Выгрузить();
		ФормаКорпКлиента.Автопарк = КорпКлиент.Автопарк.Выгрузить();
		ФормаКорпКлиента.КлючУникальности = КорпКлиент.Контрагент.УникальныйИдентификатор();
		ФормаКорпКлиента.ОткрытьМодально();
		
		Элементы.Клиент_ФИОКОРП.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры // Клиент_ФИОКОРПОткрытие()

&НаКлиенте
Процедура ЗаголовокНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("Взять рабочий лист в работу?", Режим, 0);
		Если Ответ = КодВозвратаДиалога.Да Тогда			
			Объект.Сотрудник = ПараметрыСеанса.Пользователь.Сотрудник;	
			Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
				Если Объект.ТипРабочегоЛиста = ПредопределенноеЗначение("Перечисление.Renault_ТипыРабочихЛистов.TradeIn") Тогда
					СтруктураОтбора = Новый Структура();
					СтруктураОтбора.Вставить("РабочийЛист", Объект.IDK);
					Выборка = Документы.Renault_ЗаявкаНаТрейдИн.Выбрать(,, СтруктураОтбора);
					
					Если Выборка.Следующий() И НЕ ЗначениеЗаполнено(Выборка.МенеджерТрейдИн) И Не Выборка.ПометкаУдаления Тогда					
						ДокЗаявкаПоТрейдИн = Выборка.Ссылка.ПолучитьОбъект();
						ДокЗаявкаПоТрейдИн.МенеджерТрейдИн = Объект.Сотрудник;
						Попытка
							ДокЗаявкаПоТрейдИн.Записать(РежимЗаписиДокумента.Запись);
						Исключение
							Сообщить("Не удалось указать менеджера по трейд-ин в заявке № "+Выборка.Номер);
						КонецПопытки;
					КонецЕсли;	
					
					РазблокироватьРЛ();
					
				ИначеЕсли Объект.ТипРабочегоЛиста = ПредопределенноеЗначение("Перечисление.Renault_ТипыРабочихЛистов.Продажа") Тогда
					Объект.Сотрудник = ПараметрыСеанса.Пользователь.Сотрудник;
					
					Попытка
						Записать();
						РазблокироватьРЛ();
					Исключение
						Сообщить("Не удалось указать сотрудника в рабочем листе № "+Выборка.Номер);
					КонецПопытки;
					
				КонецЕсли;	
			Иначе
				Сообщить("У текущего пользователя 1С не заполнен сотрудник");
			КонецЕсли;
			ОбновитьЗаголовок();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура УдалитьЗаполнитьРеквизиты(Команда)
	
	// TO DO Форму тоже удалить, это для тестирования
	Форма = Объект.Ссылка.ПолучитьФорму("ФормаЗаполненияРеквизитов");
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияИзменения(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		лФорма = ПолучитьФорму("Обработка.Renault_внЖурналРегистрации.Форма.ФормаОбычная");
		лФорма.ОбъектОтбораСсылка = Объект.Ссылка;
		лФорма.Открыть();
	Иначе
		Предупреждение("Необходимо записать рабочий лист");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("ОбновитьРабочиеЛисты");
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	ОбновитьДанныеCRM_КлиентскиеДанные();

КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеCRM_КлиентскиеДанные()
	
	Если Не ЗначениеЗаполнено(Объект.Клиент) Тогда 
		Возврат;
	КонецЕсли;
	ОбновитьДанные = Ложь;
	МенеджерЗаписи = РегистрыСведений.CRM_КлиентскиеДанные.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Клиент = Объект.Клиент;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		ОбновитьДанные = ?(МенеджерЗаписи.Город <> Клиент_Город Или МенеджерЗаписи.ИсточникИнформации <> Клиент_ИсточникИнформации,Истина,Ложь);
	//ВазСистем Тарасов 09.12.2020 11:53:24 Инцидент #DMSREN-1039
	//{
	//Старый код:
	//Новый код:
	Иначе 
		ОбновитьДанные = Истина;
	//}
	КонецЕсли; 	

	Если Не ОбновитьДанные Тогда 
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи.Клиент = Объект.Клиент; // DMSREN-1154
	МенеджерЗаписи.Город = Клиент_Город;
	МенеджерЗаписи.ИсточникИнформации = Клиент_ИсточникИнформации;
	МенеджерЗаписи.Записать();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.Renault_Трафик КАК Renault_Трафик
	|ГДЕ
	|	Renault_Трафик.Идентификатор = &Идентификатор";
	Запрос.УстановитьПараметр("Идентификатор", Объект.IDТрафика);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() и ЗначениеЗаполнено(Клиент_ИсточникИнформации) Тогда // DMSREN-1154
		
		ЗаписьТрафик = РегистрыСведений.Renault_Трафик.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ЗаписьТрафик, Выборка);
		ЗаписьТрафик.Прочитать();
		ЗаписьТрафик.ИсточникИнформации = Клиент_ИсточникИнформации;  // DMSREN-1154
		ЗаписьТрафик.Записать();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(IDСледСобытия) Тогда
		СлужНастройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
		Если СлужНастройки.ЗапретНаЗакрытиеРЛБезСобытий тогда 
			Предупреждение("Согласно настройкам вашего ДЦ запрещено закрытие РЛ без назначения следующего события");
			Отказ = ИСТИНА;
		иначе
			Ответ = Вопрос("Ввести новое событие?", РежимДиалогаВопрос.ДаНет);
			Если Ответ = КодВозвратаДиалога.Да Тогда
				СоздатьНовоеСобытие();
				Отказ = ИСТИНА;
				//Иначе
				//	ОбновитьСписокСобытий();
			КонецЕсли; 		
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЕмейл(Команда)
	
	//Емейл = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(ДокументОбъект.Клиент); 
	
	если ЗначениеЗаполнено(Клиент_Email) тогда
		
		сПараметры = Новый Структура;
		сПараметры.Вставить("ДЦ", Объект.ДилерскийЦентр);
		сПараметры.Вставить("Клиент_Email", Клиент_Email);
		Ответ = ОткрытьФормуМодально("Документ.Renault_Договор.Форма.ФормаОтвета", сПараметры, ЭтаФорма);
		Если Ответ <> Неопределено и Ответ.Результат Тогда
			ПоказатьПредупреждение(, "Ответ успешно отправлен");
		КонецЕсли; 
		
	иначе
		
		ПоказатьПредупреждение(, "У клиента не указан e-mail. Отправка невозможна");  		
		
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуПервичныйИнтерес()

	 ДоступнаРОП = Renault_РаботаСПравамиПользователя.ЕстьПравоИспользоватьАрмРОП(ПараметрыСеанса.Пользователь);

	 Запрос = Новый запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	CRM_ДилерскиеЦентрыПервичныйИнтерес.ПервичныйИнтерес.Ссылка КАК Модель,
	                |	CRM_ДилерскиеЦентрыПервичныйИнтерес.ПервичныйИнтерес.Модель.Артикул КАК Код
	                |ИЗ
	                |	Справочник.CRM_ДилерскиеЦентры.ПервичныйИнтерес КАК CRM_ДилерскиеЦентрыПервичныйИнтерес
	                |ГДЕ
	                |	CRM_ДилерскиеЦентрыПервичныйИнтерес.Ссылка = &ДЦ
	                |	И (CRM_ДилерскиеЦентрыПервичныйИнтерес.ПервичныйИнтерес.Модель.Артикул <> ""002""
	                |			ИЛИ &ДоступнаРОП)
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	CRM_ДилерскиеЦентрыПервичныйИнтерес.ПервичныйИнтерес.Наименование";
	 Запрос.УстановитьПараметр("ДоступнаРОП",ДоступнаРОП); 
	 Запрос.УстановитьПараметр("ДЦ",Объект.ДилерскийЦентр);
	 
	 возврат запрос.Выполнить().Выгрузить();
	 
КонецФункции



