////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с запросами

// Отправка GET Запроса на получение количества страниц. Ипсользуется при большом объеме данных с разделением на страницы 
//
// Параметры:
//  Запрос               - Строка - Запрос, который отправляется для получения данных.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключения - Ссылка на настройку подключения для получения параметров авторизации.
// 
// Возвращаемое значение:
//  КоличествоСтраниц - Количество страниц в списке объектов. 
//
Функция ПолучитьКоличествоСтраницИзОтвета(Запрос,НастройкаПодключения) Экспорт

	Ответ = GETЗапрос(Запрос,НастройкаПодключения);
	
	Если ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		КоличествоСтраниц = Ответ.Заголовки.Получить("X-Pagination-Page-Count");  
        Если КоличествоСтраниц = Неопределено Тогда
			КоличествоСтраниц = Ответ.Заголовки.Получить("x-pagination-page-count");  
	    КонецЕсли;
		КоличествоСтраниц = Число(КоличествоСтраниц);
	Иначе
		КоличествоСтраниц = 1;
	КонецЕсли;
	
	Возврат КоличествоСтраниц;   
	
КонецФункции

// Функция преобразует строку в Base64-строку.
//
// Параметры
//  Строка - Строка - входная строка.
//
// Возвращаемое значение:
//  Строка - строка, закодированная по алгоритму base64.
//
Функция КодироватьСтрокуВBase64(ИсходнаяСтрока) Экспорт
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ЗаписьТекста 	   = Новый ЗаписьТекста(ИмяВременногоФайла);
	ЗаписьТекста.Записать(ИсходнаяСтрока);
	ЗаписьТекста.Закрыть();
	Результат = Base64Строка(Новый ДвоичныеДанные(ИмяВременногоФайла)); 
	
	УдалитьФайлы(ИмяВременногоФайла);  
	
	Результат = СтрЗаменить(Результат,"77u/","");
	Возврат Результат;
	
конецфункции

// Функция преобразует строку в URL-строку.
//
// Параметры
//  Строка - Строка - входная строка.
//
// Возвращаемое значение:
//  Строка - строка, преобразованная в формат URL.
//
Функция СтрокаВФорматеURL(СтрокаДляКодировки) Экспорт  
	
	Возврат КодироватьСтроку(СтрокаДляКодировки,СпособКодированияСтроки.КодировкаURL);
	 
КонецФункции

// Функция получение заголовков запроса из HTTP запроса.
//
// Параметры
//  Заголовки - Структура - входная структура заголовков.
//
// Возвращаемое значение:
//  СтрокаЗаголовков - строка заголовков запроса.
//
Функция ПолучитьСтрокуЗаголовков(Заголовки) 

	СтрокаЗаголовков="";	
	Для Каждого КлючЗначение Из Заголовки Цикл
		СтрокаЗаголовков=СтрокаЗаголовков+?(ЗначениеЗаполнено(СтрокаЗаголовков),Символы.ПС,"")+КлючЗначение.Ключ+":"+КлючЗначение.Значение;
	КонецЦикла;
	
	Возврат СтрокаЗаголовков;  
	
КонецФункции

// Функция формирование строки параметров для HTTP запроса.
//
// Параметры
//  Параметры - Структура - входная структура параметров.
//
// Возвращаемое значение:
//  СтрокаПараметров - строка параметров.
//
Функция СформироватьСтрокуПараметровЗапроса(Параметры) Экспорт  
	
	СтрокаПараметров = "";
	Для каждого Параметр Из Параметры Цикл
		Если ЗначениеЗаполнено(Параметр.Значение) Тогда
			СтрокаПараметров = СтрокаПараметров + Параметр.Ключ + "=" + СтрокаВФорматеURL(Параметр.Значение) + "&";
		КонецЕсли;
	КонецЦикла;
	СтрокаПараметров = Лев(СтрокаПараметров,СтрДлина(СтрокаПараметров) - 1);
	Возврат СтрокаПараметров;
	
КонецФункции

// Функция формирует массив успешных запросов для формирования логов.
//
// Возвращаемое значение:
//  КодыУспешныхЗапросов - массив успешных кодов.
//
Функция ПолучитьКодыУспешногоВыполненияЗапроса() Экспорт

	КодыУспешныхЗапросов = Новый Массив;
	КодыУспешныхЗапросов.Добавить(200);
	КодыУспешныхЗапросов.Добавить(201);
	Возврат КодыУспешныхЗапросов;  
	
КонецФункции

// Функция формирует массив успешных запросов для формирования логов.
//
// Параметры
//  HTTPответ - HTTPОтвет - ответ на запрос.
//
// Возвращаемое значение:
//  Булево - возвращает значение: Истина, если запрос прошел успешно; Ложь, если запрос вернул ошибку.
//
Функция ПроверитьУспешностьВыполненияЗапроса(HTTPответ) Экспорт
	
	Если HTTPответ = Неопределено Тогда 
		Возврат ложЬ;
	КонецЕсли;
	
	КодыУспешныхЗапросов = ПолучитьКодыУспешногоВыполненияЗапроса();
	
	Возврат КодыУспешныхЗапросов.Найти(HTTPОтвет.КодСостояния)<>Неопределено;
	
КонецФункции

// Функция получения параметров подключения для выполнения запросов
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключения - Ссылка на настройку подключения для получения параметров авторизации.
// 
// Возвращаемое значение:
//  СтруктураПараметров - Структура с параметрами подключения. 
//
Функция ПолучитьПараметрыПодключения(НастройкаПодключения) Экспорт
	
	СтруктураПараметров=новый Структура;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Инфотек_НастройкиПодключения.АдресСайта,
	|	Инфотек_НастройкиПодключения.УровеньЛогирования,
	|	Инфотек_НастройкиПодключения.ИспользоватьHTTPS,
	|	Инфотек_НастройкиПодключения.Логин,
	|	Инфотек_НастройкиПодключения.Пароль,
	|	Инфотек_НастройкиПодключения.КлючAPI,
	|	Инфотек_НастройкиПодключения.Ссылка
	|ИЗ
	|	Справочник.Инфотек_НастройкиПодключения КАК Инфотек_НастройкиПодключения
	|ГДЕ
	|	Инфотек_НастройкиПодключения.Ссылка = &НастройкаПодключения";
	Запрос.УстановитьПараметр("НастройкаПодключения", НастройкаПодключения);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтруктураПараметров.Вставить("Адрес",Выборка.АдресСайта);
			СтруктураПараметров.Вставить("Логин",Выборка.Логин);
			СтруктураПараметров.Вставить("Пароль",Выборка.Пароль);
			СтруктураПараметров.Вставить("КлючAPI",Выборка.КлючAPI);
			СтруктураПараметров.Вставить("ИспользоватьHTTPS",Выборка.ИспользоватьHTTPS);
			СтруктураПараметров.Вставить("УровеньЛогирования",Выборка.УровеньЛогирования);
			СтруктураПараметров.Вставить("Ссылка",Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Возврат СтруктураПараметров;    
	
КонецФункции

// Запись логов запроса в регистр сведений 
//                           
// Параметры:
//  ПараметрыПодключения - Структура - Параметры настроек для выполнения запроса.
//  HTTPЗапрос           - HTTPЗапрос - HTTP-запрос, отправляемый через объект HTTPСоединение.   
//  HTTPОтвет            - HTTPОтвет - ответ на запрос.
//  ДатаНачала           - Дата - Дата начала выполнения запроса.
//  ДатаОкончания        - Дата - Дата окончания выполнения запроса.    
//  HTTPФункция          - Строка - GET/POST/PUT функция выполнения запросов.
//  Документ             - ДокументСсылка - Ссылка на документ для фиксации состояния выгрузки в регистр.
//
Процедура ЗафиксироватьЛогЗапроса(ПараметрыПодключения,HTTPЗапрос,HTTPОтвет,ДатаНачала,ДатаОкончания,HTTPФункция,Документ = Неопределено)

	ВариантЛогирования = ПараметрыПодключения.УровеньЛогирования;;
	
	Если HTTPОтвет = Неопределено Тогда 
		Ошибка = Истина;
	Иначе 
		Ошибка = Не ПроверитьУспешностьВыполненияЗапроса(HTTPОтвет);
	КонецЕсли;       

	Если СтрНайти(HTTPОтвет.ПолучитьТелоКакСтроку(),"""success"":false") > 0 Тогда
		Ошибка = Истина;	
	КонецЕсли;	
	
	Если Документ <> Неопределено Тогда
		ЗаписьСостояния = РегистрыСведений.Инфотек_СостояниеВыгружаемыхДокументов.СоздатьМенеджерЗаписи();
		ЗаписьСостояния.Документ = Документ;
		ЗаписьСостояния.НастройкаПодключения = ПараметрыПодключения.Ссылка;
		ЗаписьСостояния.Передан = Не Ошибка; 	
		Если Ошибка = Истина Тогда
			ЗаписьСостояния.ОписаниеОшибки = HTTPОтвет.ПолучитьТелоКакСтроку();  
			ЗаписьСостояния.Запрос = HTTPЗапрос.АдресРесурса;
		КонецЕсли;
		ЗаписьСостояния.Записать();
	КонецЕсли;
	
	Если ВариантЛогирования = Перечисления.Инфотек_УровниЛогирования.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Ошибка И ВариантЛогирования = Перечисления.Инфотек_УровниЛогирования.Ошибки Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьЛога = РегистрыСведений.Инфотек_ЛогиЗапросов.СоздатьМенеджерЗаписи();
	ЗаписьЛога.HTTPФункция = HTTPФункция;
	ЗаписьЛога.Сервер = ПараметрыПодключения.Адрес;
	ЗаписьЛога.НачалоЗапроса = ДатаНачала;
	ЗаписьЛога.КонецЗапроса = ДатаОкончания;
	ЗаписьЛога.Идентификатор = Новый УникальныйИдентификатор;
	ЗаписьЛога.Запрос = HTTPЗапрос.АдресРесурса;
	ЗаписьЛога.ТелоЗапроса = HTTPЗапрос.ПолучитьТелоКакСтроку();
	ЗаписьЛога.НастройкаПодключения = ПараметрыПодключения.Ссылка;
	ЗаписьЛога.КодСостояния = ?(HTTPОтвет = Неопределено,300,HTTPОтвет.КодСостояния);
	ЗаписьЛога.ИспользоватьHttps = ПараметрыПодключения.ИспользоватьHTTPS;
	ЗаписьЛога.Ошибка = Ошибка;
	ЗаписьЛога.ЗаголовкиЗапроса = ПолучитьСтрокуЗаголовков(HTTPЗапрос.Заголовки);
	ЗаписьЛога.ЗаголовкиОтвета = ?(HTTPОтвет=Неопределено,"",ПолучитьСтрокуЗаголовков(HTTPОтвет.Заголовки));
	ЗаписьЛога.ТелоОтвета = ?(HTTPОтвет = Неопределено,"См. журнал регистрации.",HTTPОтвет.ПолучитьТелоКакСтроку());		
	ЗаписьЛога.Записать(Истина);
	
КонецПроцедуры

// GET Запрос получения данных
//                           
// Параметры:
//  Запрос               - Строка - Запрос для получения данных.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключения - Ссылка на настройку подключения для получения параметров авторизации.
//  АвторизацияПоАПИ     - Булево - Если истина подключение по токену, иначе по логину и паролю.
//
// Возвращаемое значение:
//  Результат - HTTPОтвет сервера на GET запрос. 
//
Функция GETЗапрос(Запрос,НастройкаПодключения,АвторизацияПоАПИ = Ложь) Экспорт

	ПараметрыПодключения = ПолучитьПараметрыПодключения(НастройкаПодключения);
	
	Если ПараметрыПодключения.ИспользоватьHTTPS Тогда
		HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.Адрес,,,,,,Новый ЗащищенноеСоединениеOpenSSL,Ложь);
	Иначе
		HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.Адрес);
	КонецЕсли;
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Host",ПараметрыПодключения.Адрес);
	Если ЗначениеЗаполнено(ПараметрыПодключения.КлючAPI) Тогда
		Заголовки.Вставить("Authorization", "Bearer " + ПараметрыПодключения.КлючAPI);
	Иначе
		Заголовки.Вставить("Authorization", "Basic " + КодироватьСтрокуВBase64(ПараметрыПодключения.Логин + ":" + ПараметрыПодключения.Пароль));
	КонецЕсли;
	Заголовки.Вставить("Accept", "application/json");
	Заголовки.Вставить("Connection", "Keep-Alive");
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");

	HTTPЗапрос    = Новый HTTPЗапрос(Запрос,Заголовки);
	НачалоЗапроса = ТекущаяДатаСеанса();	
	
	Попытка
		Результат = HTTPСоединение.Получить(HTTPЗапрос);
	Исключение
		// исключение здесь говорит о том, что запрос не дошел до HTTP-Сервера
		Сообщить("_ Произошла сетевая ошибка!");
		Сообщить(ОписаниеОшибки());
		//ВызватьИсключение;
		Результат = Неопределено;
	КонецПопытки;
	КонецЗапроса = ТекущаяДатаСеанса();
	ЗафиксироватьЛогЗапроса(ПараметрыПодключения,HTTPЗапрос,Результат,НачалоЗапроса,КонецЗапроса,"GET");
	
	Возврат Результат;
	
КонецФункции

// POST запрос отправки данных      
//                           
// Параметры:
//  Запрос               - Строка - Запрос для получения данных.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключения - Ссылка на настройку подключения для получения параметров авторизации.
//  ТелоЗапроса          - Строка - Тело запроса на отправку в формате JSON.
//  АвторизацияПоАПИ     - Булево - Если истина подключение по токену, иначе по логину и паролю.
//  Документ             - ДокументСсылка - Ссылка на документ для фиксации состояния выгрузки в регистр.
//
// Возвращаемое значение:
//  Результат - HTTPОтвет сервера на POST запрос 
//
Функция POSTЗапрос(Запрос,НастройкаПодключения,ТелоЗапроса,АвторизацияПоАПИ = Ложь,Документ = Неопределено) Экспорт
	
	ПараметрыПодключения = ПолучитьПараметрыПодключения(НастройкаПодключения);
	
	Если ПараметрыПодключения.ИспользоватьHTTPS Тогда
		HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.Адрес,,,,,,Новый ЗащищенноеСоединениеOpenSSL,Ложь);
	Иначе
		HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.Адрес);
	КонецЕсли;
	
	Заголовки = Новый Соответствие();
	
	Заголовки.Вставить("Host",ПараметрыПодключения.Адрес);
	Если ЗначениеЗаполнено(ПараметрыПодключения.КлючAPI) Тогда
		Заголовки.Вставить("Authorization", "Bearer " + ПараметрыПодключения.КлючAPI);
	иначе
		Заголовки.Вставить("Authorization", "Basic " + КодироватьСтрокуВBase64(ПараметрыПодключения.Логин + ":" + ПараметрыПодключения.Пароль));
	КонецЕсли;
	Заголовки.Вставить("Accept", "application/json");
	Заголовки.Вставить("Connection", "Keep-Alive");
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	HTTPЗапрос        = Новый HTTPЗапрос(Запрос,Заголовки);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса,КодировкаТекста.UTF8,ИспользованиеByteOrderMark.НеИспользовать);
	
	Попытка		
		НачалоЗапроса = ТекущаяДата();
		Результат     = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		КонецЗапроса  = ТекущаяДата();
		ЗафиксироватьЛогЗапроса(ПараметрыПодключения,HTTPЗапрос,Результат,НачалоЗапроса,КонецЗапроса,"POST",Документ);
	Исключение
		// исключение здесь говорит о том, что запрос не дошел до HTTP-Сервера
		Сообщить("_ Произошла сетевая ошибка! " + ОписаниеОшибки());
		//ВызватьИсключение;
		Результат = Неопределено;
	КонецПопытки;
	
	Возврат Результат;

КонецФункции

// PUT запрос отправки данных      
//                           
// Параметры:
//  Запрос               - Строка - Запрос для получения данных.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключения - Ссылка на настройку подключения для получения параметров авторизации.
//  ТелоЗапроса          - Строка - Тело запроса на отправку в формате JSON.
//  АвторизацияПоАПИ     - Булево - Если истина подключение по токену, иначе по логину и паролю.
//  Документ             - ДокументСсылка - Ссылка на документ для фиксации состояния выгрузки в регистр.
//
// Возвращаемое значение:
//  Результат - HTTPОтвет сервера на PUT запрос. 
//
Функция PUTЗапрос(Запрос,НастройкаПодключения,ТелоЗапроса,АвторизацияПоАПИ = Ложь,Документ = Неопределено) Экспорт
	
	ПараметрыПодключения = ПолучитьПараметрыПодключения(НастройкаПодключения);
	
	Если ПараметрыПодключения.ИспользоватьHTTPS Тогда
		HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.Адрес,,,,,,Новый ЗащищенноеСоединениеOpenSSL,Ложь);
	Иначе
		HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.Адрес);
	КонецЕсли;
		
	Заголовки = Новый Соответствие;  
	
	Заголовки.Вставить("Host",ПараметрыПодключения.Адрес);
	Если ЗначениеЗаполнено(ПараметрыПодключения.КлючAPI) Тогда
		Заголовки.Вставить("Authorization", "Bearer " + ПараметрыПодключения.КлючAPI);
	иначе
		Заголовки.Вставить("Authorization", "Basic " + КодироватьСтрокуВBase64(ПараметрыПодключения.Логин + ":" + ПараметрыПодключения.Пароль));
	КонецЕсли;
	Заголовки.Вставить("Accept", "application/json");
	Заголовки.Вставить("Connection", "Keep-Alive");
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	HTTPЗапрос        = Новый HTTPЗапрос(Запрос,Заголовки);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса,КодировкаТекста.UTF8,ИспользованиеByteOrderMark.НеИспользовать);   
	
	Попытка		
		НачалоЗапроса = ТекущаяДата();
		Результат     = HTTPСоединение.Записать(HTTPЗапрос);
		КонецЗапроса  = ТекущаяДата();
		ЗафиксироватьЛогЗапроса(ПараметрыПодключения,HTTPЗапрос,Результат,НачалоЗапроса,КонецЗапроса,"PUT",Документ);
	Исключение
		// исключение здесь говорит о том, что запрос не дошел до HTTP-Сервера
		Сообщить("_ Произошла сетевая ошибка!");
		//ВызватьИсключение;
		Результат = Неопределено;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Отправка запросов повторно из логов обмена      
//                           
// Параметры:
//  ЗаписьЛогаЗапроса - Запись РегистрСведений.Инфотек_ЛогиЗапросов - запись лога, из которой необходимо повторно отправить запрос.
//
Процедура ПовторнаяОтправкаHTTPЗапроса(ЗаписьЛогаЗапроса) Экспорт

	ВыполнитьHTTPЗапрос(ЗаписьЛогаЗапроса.НастройкаПодключения,ЗаписьЛогаЗапроса.Сервер,ЗаписьЛогаЗапроса.Запрос,
	ЗаписьЛогаЗапроса.ТелоЗапроса,ЗаписьЛогаЗапроса.HTTPФункция);	

КонецПроцедуры

// Функция отправки HTTP запроса      
//                           
// Параметры:
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключения - Ссылка на настройку подключения для получения параметров авторизации.
//  АдресСервера         - Строка - Адрес для отправки запроса.
//  Запрос               - Строка - Запрос для получения данных.
//  ТелоЗапроса          - Строка - Тело запроса на отправку в формате JSON.
//  HTTPФункция          - Строка - Функция для отправки запроса.
//
// Возвращаемое значение:
//  Результат - HTTPОтвет сервера на PUT запрос. 
//
Функция ВыполнитьHTTPЗапрос(НастройкаПодключения,АдресСервера,Запрос,ТелоЗапроса,HTTPФункция = "GET") 

	ПараметрыПодключения = ПолучитьПараметрыПодключения(НастройкаПодключения);
	Если ПараметрыПодключения.ИспользоватьHTTPS Тогда                                                                               
		HTTPСоединение = Новый HTTPСоединение(АдресСервера,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	Иначе
		HTTPСоединение = Новый HTTPСоединение(АдресСервера);
	КонецЕсли;
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Host", ПараметрыПодключения.Адрес);
	Если ЗначениеЗаполнено(ПараметрыПодключения.КлючAPI) Тогда
		Заголовки.Вставить("Authorization", "Bearer " + ПараметрыПодключения.КлючAPI);
	иначе
		Заголовки.Вставить("Authorization", "Basic " + КодироватьСтрокуВBase64(ПараметрыПодключения.Логин + ":" + ПараметрыПодключения.Пароль));
	КонецЕсли;
	Заголовки.Вставить("Accept", "application/json");
	Заголовки.Вставить("Connection", "Keep-Alive");
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");

	HTTPЗапрос     = Новый HTTPЗапрос(Запрос,Заголовки);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса,КодировкаТекста.UTF8,ИспользованиеByteOrderMark.НеИспользовать);
	
	НачалоЗапроса=ТекущаяДатаСеанса();	
	Попытка
		Если ВРег(HTTPФункция)="GET" Тогда
			Результат      = HTTPСоединение.Получить(HTTPЗапрос);
		ИначеЕсли ВРег(HTTPФункция)="POST" Тогда
			Результат      = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		ИначеЕсли ВРег(HTTPФункция)="DELETE" Тогда
			Результат      = HTTPСоединение.Удалить(HTTPЗапрос);
		ИначеЕсли ВРег(HTTPФункция)="PUT" Тогда 
			Результат      = HTTPСоединение.Записать(HTTPЗапрос);
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Исключение
		// исключение здесь говорит о том, что запрос не дошел до HTTP-Сервера
		Сообщить("_ Произошла сетевая ошибка!"+ОписаниеОшибки());
		//ВызватьИсключение;
		Результат = Неопределено;
	КонецПопытки;
	КонецЗапроса=ТекущаяДатаСеанса();
	ЗафиксироватьЛогЗапроса(ПараметрыПодключения,HTTPЗапрос,Результат,НачалоЗапроса,КонецЗапроса,HTTPФункция);
	
	Возврат Результат; 
	
КонецФункции
