&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыФормы=Новый Структура("ТабПроценки",Параметры.ТабПроценки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.ЗакрыватьПриЗакрытииВладельца=Истина;
	ВладелецОбъект = ЭтаФорма.ВладелецФормы.Объект;
	Попытка
	   ЗаполнитьЗначенияСвойств(Объект,ВладелецОбъект,,
	   "ЗаявкаНаОформление,ЗаявкаПоставщику,ОчищеннаяТаблица,УточнениеПоиска, РезультатПоискаОнлайн");
    Исключение		
	КонецПопытки;	
	СборДанныхНаСервере();
КонецПроцедуры

&НаСервере
Процедура СборДанныхНаСервере()
	Обработка=РеквизитФормыВЗначение("Объект");
	Текст = Обработка.ПолучитьСписокПроценок();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Текст);
	Проценки = ПрочитатьJSON(ЧтениеJSON, Ложь);
	Если Проценки=Неопределено Тогда
		Сообщить("Ошибки в данных, загрузка не выполнена");
		Возврат;
	КонецЕсли;
	ТабПроценки = ДанныеФормыВЗначение(ПараметрыФормы.ТабПроценки,Тип("ТаблицаЗначений"));
	Для Каждого Стр Из Проценки Цикл
		Нов=ГрупповаяЗагрузка.Добавить();
		Нов.Сайт = Стр.Сайт;
		Нов.Данные = Стр;
		Нов.Загружать = Ложь;
	КонецЦикла;
	ГрупповаяЗагрузка.Сортировать("Сайт");	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузку(Команда)
	ЭтаФорма.Закрыть(ГрупповаяЗагрузка);
КонецПроцедуры  

&НаСервере
Процедура ВыполнитьНаСервере()
	Обработка=РеквизитФормыВЗначение("Объект");
	Для Каждого Стр Из ГрупповаяЗагрузка Цикл
		Если Стр.Загружать Тогда
			ПараметрыФормы.Вставить(Стр.Наименование);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


