Перем Права Экспорт;
//////////////////////////////////////////////////////

// Функция проверяет попадание текущей области и области подвала на страницу
//
// Параметры:
// ТабДокумент 			 - табличный документ, в который выводится информация, подготовленная к печати
// Область 				 - текущая или массив текущих областей, предназначенных для вывода в данный момент
// ОбластьШапка 			 - область или массив областей, выступающих в качестве шапки и
// которые будут выводиться на каждой странице
// ОбластьПодвал 			 - область, которая будет выводиться в качестве подвала на каждой странице
// НомерСтраницы 			 - номер печатаемой страницы
// ТекстЗаголовка 			 - текст, выводимый как подпись к шапке очередного листа
// СтруктураИтоговПоСтранице - структура содержащая, накопленные итоги по текущей странице
//					 	 	 значение ключа структуры должно совпадать с идентификатором реквизита табличной части документа
// мсвДопОбластиПодвала  - подвальная часть макета. Проверка попадания последней строки таблицы на страницу
//							общего подвала Если = Неопределено, то проверка не осуществляется
// ВсегоСтраниц 			 - количество страниц выводимой
//
//Возвращаемое значение:
// Число - текущий номер страницы
//
Функция ВывестиГоризонтальнуюОбласть(ТабДокумент, Область, ОбластьШапка = Неопределено, ОбластьПодвал = Неопределено, НомерСтраницы = 1,
	СтруктураИтоговПоСтранице = Неопределено, Права = Неопределено, мсвДопОбластиПодвала = Неопределено) Экспорт
	
	Попытка
		ПраваПользователя = Права.Права;
		ЭтотОбъект = Права;
	Исключение
		ПраваПользователя=Права;
		//ЭтотОбъект=Неопределено;
	КонецПопытки; 
	
	//ИспользоватьРазбиениеНаСтраницы = обПраво("ИспользоватьРазбиениеНаСтраницы", ПраваПользователя,, ЭтотОбъект);	
	////если не разбиваем, выводим и все
	//Если Не ИспользоватьРазбиениеНаСтраницы Тогда
	//	ТабДокумент.Вывести(Область);
	//	Возврат НомерСтраницы;
	//КонецЕсли;
	
	//запишем их в один массив
	МассивОбластейДляПроверки = Новый Массив;
	МассивОбластейДляПроверки.Добавить(Область);
	Если ОбластьПодвал <> Неопределено Тогда
		МассивОбластейДляПроверки.Добавить(ОбластьПодвал);
	КонецЕсли;
	Если мсвДопОбластиПодвала <> Неопределено Тогда
		Для Каждого ТекОбласть Из мсвДопОбластиПодвала Цикл
			МассивОбластейДляПроверки.Добавить(ТекОбласть);
		КонецЦикла;
	КонецЕсли;
	
	Попытка
		//проверим, помещаются ли на странице
		РезультатПроверки = ТабДокумент.ПроверитьВывод(МассивОбластейДляПроверки);		
		//если не помещаются, то ...
		Если НЕ РезультатПроверки Тогда
			// здесь ОбластьПодвал - это подвал с итогами по странице!!!!
			//дкВывестиИтогиПоСтранице(ТабДокумент, ОбластьПодвал, СтруктураИтоговПоСтранице, Права); //выводим итог по странице!!!
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц(); //переходим на следующую страницу
			НомерСтраницы = НомерСтраницы + 1;
			Если ОбластьШапка <> Неопределено Тогда
				ТабДокумент.Вывести(ОбластьШапка); //выводим шапку таблицы
			КонецЕсли;
		КонецЕсли;
	Исключение
		Сообщить("Ошибка при проверке вывода документа!", СтатусСообщения.Внимание);
	КонецПопытки;
	
	//выводим текущую область
	ТабДокумент.Вывести(Область);
	
	Возврат НомерСтраницы;
КонецФункции // дкВывестиГоризонтальнуюОбласть()

Функция ПечатьВедомостьУРВ(ТабДокумент) Экспорт
	ТаблицаСотрудников = ДанныеЗаПериод.Выгрузить();
	//Вывод табличной части Товары
	Если ТаблицаСотрудников.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Макет = ПолучитьМакет("ВедомостьУРВ");
	
	//Вывод области Договор
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Начало = Формат(ДатаНачала, "ДЛФ=ДД");
	ОбластьШапка.Параметры.Конец = Формат(ДатаКонца, "ДЛФ=ДД");
	Если ПереключательПодразделение = 0 Тогда
		ОбластьШапка.Параметры.Подразделение = "Подразделение компании: " + Подразделение.Наименование;
		ТекстЗаголовка = "Ведомость УРВ по подразделению " + Подразделение.Наименование + " от " + Формат(ТекущаяДата(), "ДФ=дд.ММ.гггг");
	Иначе
		Если Отдел.Родитель = Справочники.Сотрудники.ПустаяСсылка() Тогда
			ОтделРодитель = "";
		Иначе
			ОтделРодитель = Отдел.Родитель.Наименование + " - ";
		КонецЕсли;		
		ОбластьШапка.Параметры.Отдел = "Отдел: " + ОтделРодитель + Отдел.Наименование;
		ТекстЗаголовка = "Ведомость УРВ по отделу " + ОтделРодитель + Отдел.Наименование + " от " + Формат(ТекущаяДата(), "ДФ=дд.ММ.гггг");
	Конецесли;
	
	ТабДокумент.Вывести(ОбластьШапка);
	
	ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ШапкаТаблицы);	
	//заполним параметры шапки таблицы для следующего листа
	НомерСтраницы = 2;
	НомерСтраницыПред = 2;
	ШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	ШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 			
	
	СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	Ном	= 0;
	Для каждого СтрокаСотрудник Из ТаблицаСотрудников Цикл
		Ном = Ном + 1;
		СтрокаТаблицы.Параметры.Ном = Ном;
		СтрокаТаблицы.Параметры.Сотрудник = СтрокаСотрудник.Сотрудник.Наименование;
		СтрокаТаблицы.Параметры.ДнейПоГрафику = СтрокаСотрудник.ПоПлану;
		СтрокаТаблицы.Параметры.ДнейФакт = СтрокаСотрудник.Отработан;
		СтрокаТаблицы.Параметры.ЧасовПоГрафику = СтрокаСотрудник.ПродолжительностьГрафик;
		СтрокаТаблицы.Параметры.ЧасовФакт = СтрокаСотрудник.Продолжительность;
		СтрокаТаблицы.Параметры.Прогулов = СтрокаСотрудник.Прогул;
		СтрокаТаблицы.Параметры.Опозданий = СтрокаСотрудник.Опоздал;
		СтрокаТаблицы.Параметры.УходовРаньше = СтрокаСотрудник.РаньшеУшел;
		СтрокаТаблицы.Параметры.БезОтметки = СтрокаСотрудник.НеОтметился;			
		
		НомерСтраницы = ВывестиГоризонтальнуюОбласть(ТабДокумент, СтрокаТаблицы, ШапкаТаблицы,, НомерСтраницы,, Права);
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			НомерСтраницыПред = НомерСтраницы;
			ШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли;
	КонецЦикла;
	ТабДокумент.Защита = Истина;
	Возврат ТабДокумент;
КонецФункции

Функция ПечатьКонтольСотрудниковПоФото(ТабДокумент,ТекСтрока) Экспорт
	ТЗГрафик = ТекущиеОтметки.Выгрузить();
	
	
	Отбор = Новый Структура();
	Отбор.Вставить("Сотрудник",ТекСтрока.Сотрудник);
	
	ТЗСотрудник = ТЗГрафик.СкопироватьКолонки();
	
	ТЗГрафик = ТЗГрафик.НайтиСтроки(Отбор); 
	
	Для Каждого Строка Из ТЗГрафик   Цикл
	    НоваястрокаТЗ = ТЗСотрудник.Добавить();
	    ЗаполнитьЗначенияСвойств(НоваястрокаТЗ, Строка);
    КонецЦикла;
	
    ТЗСотрудник.Сортировать("ДатаРаботы,Сотрудник");

	
	Макет = ПолучитьМакет("ВедомостьФотоПоСотруднику");
	НайденнаяСтрока = ТЗСотрудник.Найти(ТекСтрока.Сотрудник, "Сотрудник"); 
	ШапкаТаблицы = Макет.ПолучитьОбласть("Шапка");
	
	
	ШапкаТаблицы.Параметры.ФИО = НайденнаяСтрока.Сотрудник;
	ШапкаТаблицы.Параметры.Должность = НайденнаяСтрока.Сотрудник.Должность;	
	
	
	Если НайденнаяСтрока.ПутьКОстновнойФото <>"" тогда
			Попытка
			ШапкаТаблицы.Рисунки.ФотоСотрудника.Картинка =Новый Картинка(ПолучитьФотоОсновное(НайденнаяСтрока.ПутьКОстновнойФото).Получить());
		Исключение
			КонецПопытки;
	КонецЕсли;	

	ТабДокумент.Вывести(ШапкаТаблицы);
	
	ШапкаТаблицыГраф = Макет.ПолучитьОбласть("ШапкаТаблицыГраф|Отметка");
	ТабДокумент.Вывести(ШапкаТаблицыГраф);
	Номер =1;
	ДанныеЗаПериодСот = ДанныеЗаПериод.Выгрузить();
	СводПоСотруднику = ДанныеЗаПериодСот.Найти(ТекСтрока.Сотрудник, "Сотрудник");
	//Для Каждого стрсот из СводПоСотруднику цикл	
		СтрокаТаблицыГраф = Макет.ПолучитьОбласть("СтрокаТаблицыГраф|Отметка");
		СтрокаТаблицыГраф.Параметры.Заполнить(СводПоСотруднику);
		СтрокаТаблицыГраф.Параметры.Номер = Номер;
		ТабДокумент.Вывести(СтрокаТаблицыГраф);
		//Номер = Номер + 1;
	//КонецЦикла;	
	
	ПустаяСтрок = Макет.ПолучитьОбласть("ПустаяСтрок");
	ТабДокумент.Вывести(ПустаяСтрок);

	
	ВыводитьШапкуТаблицы = 0;
	ФлагПервыйВыавод = Истина;
	
	

	Для Каждого стр из ТЗСотрудник цикл
		//Если Стр.ПоПлану =0  тогда
		//	Продолжить;
		//КонецЕсли;	
		Если  ВыводитьШапкуТаблицы = 4 тогда
			ФотоЦелый = Макет.ПолучитьОбласть("ФотоЦел");
			ВыводитьШапкуТаблицы = 0;
			//Фото = Макет.ПолучитьОбласть("Фото");
 
	
		КонецЕсли;
		МФот = ПолучитьФото(стр.ПутькФайлуПриход,стр.ПутькФайлуУход);
		//Если ФлагПервыйВыавод и ВыводитьШапкуТаблицы <> 4 тогда
		Если  ВыводитьШапкуТаблицы = 0  тогда 
			Если ФлагПервыйВыавод тогда
				ФотоЦелый = Макет.ПолучитьОбласть("ФотоЦел");
				ФлагПервыйВыавод = Ложь;
			КонецЕсли;	
			//ФотоЦелый.Параметры.ДатаТек = Формат(стр.ДатаРаботы,"ДФ=dd.MM");
			//ФотоЦелый.Параметры.ДеньТек = Формат(стр.ДатаРаботы,"ДФ=дддд");
			ФотоЦелый.Параметры.Дата0= Формат(стр.ДатаРаботы,"ДФ=dd.MM");
	
			//ФотоЦелый.Параметры.СотрудникЦел0 = стр.Сотрудник;
			//ФотоЦелый.Параметры.ДолжностьЦел0 = НРег(стр.Сотрудник.Должность.Наименование);
			ФотоЦелый.Параметры.ПриходЦел0 = Формат(стр.НачалоРаботы,"ДФ=HH:mm");
			ФотоЦелый.Параметры.УходЦел0 =   Формат(стр.КонецРаботы, "ДФ=HH:mm");
			Если МФот[0] <> "" тогда
				ФотоЦелый.Рисунки.ФотоНачЦел0.Картинка =Новый Картинка(МФот[0].Получить())
			КонецЕсли;
			Если МФот[1] <> "" тогда
				ФотоЦелый.Рисунки.ФотоКонЦел0.Картинка =Новый Картинка(МФот[1].Получить())
			КонецЕсли;	
			//Попытка
			//	Если стр.ПутьКОстновнойФото <>"" тогда
			//		ФотоЦелый.Рисунки.ФотоСотЦел0.Картинка =Новый Картинка(ПолучитьФотоОсновное(Стр.ПутьКОстновнойФото).Получить())
			//	КонецЕсли;	
			//Исключение
			//КонецПопытки;	
		ИначеЕсли ВыводитьШапкуТаблицы = 1 тогда
			//ФотоЦелый.Параметры.СотрудникЦел1 = стр.Сотрудник;
			//ФотоЦелый.Параметры.ДолжностьЦел1 = НРег(стр.Сотрудник.Должность.Наименование);
			ФотоЦелый.Параметры.Дата1= Формат(стр.ДатаРаботы,"ДФ=dd.MM");

			ФотоЦелый.Параметры.ПриходЦел1 = Формат(стр.НачалоРаботы,"ДФ=HH:mm");
			ФотоЦелый.Параметры.УходЦел1 =   Формат(стр.КонецРаботы, "ДФ=HH:mm");
			Если МФот[0] <> "" тогда
				ФотоЦелый.Рисунки.ФотоНачЦел1.Картинка =Новый Картинка(МФот[0].Получить())
			КонецЕсли;
			Если МФот[1] <> "" тогда
				ФотоЦелый.Рисунки.ФотоКонЦел1.Картинка =Новый Картинка(МФот[1].Получить())
			КонецЕсли;	
			
		ИначеЕсли ВыводитьШапкуТаблицы = 2 тогда
			//ФотоЦелый.Параметры.СотрудникЦел2 = стр.Сотрудник;
			//ФотоЦелый.Параметры.ДолжностьЦел2 = НРег(стр.Сотрудник.Должность.Наименование);
			ФотоЦелый.Параметры.Дата2= Формат(стр.ДатаРаботы,"ДФ=dd.MM");

			ФотоЦелый.Параметры.ПриходЦел2 = Формат(стр.НачалоРаботы,"ДФ=HH:mm");
			ФотоЦелый.Параметры.УходЦел2 =   Формат(стр.КонецРаботы, "ДФ=HH:mm");
			Если МФот[0] <> "" тогда
				ФотоЦелый.Рисунки.ФотоНачЦел2.Картинка =Новый Картинка(МФот[0].Получить())
			КонецЕсли;
			
			Если МФот[1] <> "" тогда
				ФотоЦелый.Рисунки.ФотоКонЦел2.Картинка =Новый Картинка(МФот[1].Получить())
			КонецЕсли;	
			
		ИначеЕсли ВыводитьШапкуТаблицы = 3 тогда
			//ФотоЦелый.Параметры.СотрудникЦел3 = стр.Сотрудник;
			//ФотоЦелый.Параметры.ДолжностьЦел3 = НРег(стр.Сотрудник.Должность.Наименование);
			ФотоЦелый.Параметры.Дата3 = Формат(стр.ДатаРаботы,"ДФ=dd.MM");

			ФотоЦелый.Параметры.ПриходЦел3 = Формат(стр.НачалоРаботы,"ДФ=HH:mm");
			ФотоЦелый.Параметры.УходЦел3 =   Формат(стр.КонецРаботы, "ДФ=HH:mm");
			Если МФот[0] <> "" тогда
				ФотоЦелый.Рисунки.ФотоНачЦел3.Картинка =Новый Картинка(МФот[0].Получить())
			КонецЕсли;
			
			Если МФот[1] <> "" тогда
				ФотоЦелый.Рисунки.ФотоКонЦел3.Картинка =Новый Картинка(МФот[1].Получить())
			КонецЕсли;	
				//ИначеЕсли ВыводитьШапкуТаблицы = 4 тогда
			//	ВыводитьШапкуТаблицы = 0;
			//	ТабДокумент.Вывести(ФотоЦелый);
			Если не  ТабДокумент.ПроверитьВывод(ФотоЦелый) ТОГДА
				 ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;	
			ТабДокумент.Вывести(ФотоЦелый);
			
			//Продолжить;
		КонецЕсли;
		

		
		
		
		ВыводитьШапкуТаблицы = ВыводитьШапкуТаблицы+1;
		
			
	КонецЦикла;	
	
	Если ВыводитьШапкуТаблицы<>0 тогда
		ТабДокумент.Вывести(ФотоЦелый);	
	КонецЕсли;
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.Защита = Истина;
	ТабДокумент.ОтображатьСетку = Ложь;
	ТабДокумент.ТолькоПросмотр = Истина;
	 
	Возврат ТабДокумент;

КонецФункции

Функция ПечатьКонтольПоПодразделению(ТабДокумент) Экспорт

	Макет = ПолучитьМакет("ВедомостьФотоПодраздления");
		
	ШапкаТаблицы = Макет.ПолучитьОбласть("Шапка");
	//Иерархия = "";
	//Если Подразделение = Справочники.ПодразделенияКомпании.ПустаяСсылка() тогда

	//Иначе
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ПодразделенияКомпании.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	//	|ГДЕ
	//	|	ПодразделенияКомпании.Ссылка = &Ссылка
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ПодразделенияКомпании.Ссылка
	//	|ИТОГИ ПО
	//	|	Ссылка ТОЛЬКО ИЕРАРХИЯ";
	//
	//Запрос.УстановитьПараметр("Ссылка", Подразделение);
	//Результат = Запрос.Выполнить();
	//
	//ВыборкаСИерархией=Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией,"Ссылка");
	//
	//Дерево=Новый ДеревоЗначений;
	//Дерево.Колонки.Добавить("Подразделение");
	//ВыбратьЭлементыВИерархии(ВыборкаСИерархией,Дерево);
	//
	//КонецЕсли;	
	ШапкаТаблицы.Параметры.Отдел = ?(Подразделение = Справочники.ПодразделенияКомпании.ПустаяСсылка(),Отдел, Подразделение);
	ШапкаТаблицы.Параметры.Период = Формат(ДатаНачала,"ДФ=dd.MM")+" - "+Формат(ДатаКонца,"ДФ=dd.MM");	
	ТабДокумент.Вывести(ШапкаТаблицы);
	
	ШапкаТаблицыГраф = Макет.ПолучитьОбласть("ШапкаТаблицыГраф|Отметка");
	ТабДокумент.Вывести(ШапкаТаблицыГраф);
	
	ТЗОтделы = ДанныеЗаПериод.Выгрузить();
	ТЗОтделы.Колонки.Добавить("Отдел");
	инд = 0;
	Для Каждого стр Из ДанныеЗаПериод Цикл
		ТЗОтделы[инд].Отдел = стр.Сотрудник.Родитель;
		инд = инд + 1;
	КонецЦикла;
	ТЗОтделы.Свернуть("Отдел");
	ТЗОтделы.Сортировать("Отдел");
	
	СтрокаТаблицыГраф = Макет.ПолучитьОбласть("СтрокаТаблицыГраф|Отметка");
	ОбластьСтрокаОтдел = Макет.ПолучитьОбласть("СтрокаОтдел");
	Для Каждого СтрокаОтдел Из ТЗОтделы Цикл
		Если СтрокаОтдел.Отдел.Пустая() Тогда
			ОбластьСтрокаОтдел.Параметры.Отдел = "Отдел не указан";
		Иначе
			ОбластьСтрокаОтдел.Параметры.Отдел = СтрокаОтдел.Отдел.Наименование;
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьСтрокаОтдел);
		
		Номер = 1;
		Для Каждого стр из ДанныеЗаПериод Цикл
			Если СтрокаОтдел.Отдел = стр.Сотрудник.Родитель Тогда
				СтрокаТаблицыГраф.Параметры.Заполнить(стр);
				СтрокаТаблицыГраф.Параметры.Номер = Номер;
				Если стр.НеОтметился > 0 Или стр.Опоздал > 0 Или стр.РаньшеУшел > 0 Или стр.Прогул > 0 Тогда
					СтрокаТаблицыГраф.Область().ЦветФона = WebЦвета.ТусклоРозовый;
				Иначе
					СтрокаТаблицыГраф.Область().ЦветФона = WebЦвета.Белый;
				КонецЕсли;
				ТабДокумент.Вывести(СтрокаТаблицыГраф);
				Номер = Номер + 1;
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ПустаяСтрок = Макет.ПолучитьОбласть("ПустаяСтрок");
	ТабДокумент.Вывести(ПустаяСтрок);

	ТЗГрафик = ТекущиеОтметки.Выгрузить();
    ТЗГрафик.Сортировать("ДатаРаботы,Сотрудник");
	Для Каждого СтрокаОтдел Из ТЗОтделы Цикл
		Если СтрокаОтдел.Отдел.Пустая() Тогда
			ОбластьСтрокаОтдел.Параметры.Отдел = "Отдел не указан";
		Иначе
			ОбластьСтрокаОтдел.Параметры.Отдел = СтрокаОтдел.Отдел.Наименование;
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьСтрокаОтдел);
		
		ВыводитьШапкуТаблицы = 0;
		ФлагПервыйВыавод = Истина;
		Для Каждого стр из ТЗГрафик Цикл
			Если Не СтрокаОтдел.Отдел = стр.Сотрудник.Родитель Тогда Продолжить; КонецЕсли;
			
			//Если Стр.ПоПлану =0  тогда
			//	Продолжить;
			//КонецЕсли;	
			Если  ВыводитьШапкуТаблицы = 4 тогда
				ФотоЦелый = Макет.ПолучитьОбласть("ФотоЦел");
				ВыводитьШапкуТаблицы = 0;
				//Фото = Макет.ПолучитьОбласть("Фото");
			КонецЕсли;
			МФот = ПолучитьФото(стр.ПутькФайлуПриход,стр.ПутькФайлуУход);
			//Если ФлагПервыйВыавод и ВыводитьШапкуТаблицы <> 4 тогда
			Если  ВыводитьШапкуТаблицы = 0  тогда 
				Если ФлагПервыйВыавод тогда
					ФотоЦелый = Макет.ПолучитьОбласть("ФотоЦел");
					ФлагПервыйВыавод = Ложь;
				КонецЕсли;	
			    ФотоЦелый.Параметры.ДатаТек = Формат(стр.ДатаРаботы,"ДФ=dd.MM");
				ФотоЦелый.Параметры.ДеньТек = Формат(стр.ДатаРаботы,"ДФ=дддд");
					
				ФотоЦелый.Параметры.СотрудникЦел0 = стр.Сотрудник;
				ФотоЦелый.Параметры.ДолжностьЦел0 = НРег(стр.Сотрудник.Должность.Наименование);
				ФотоЦелый.Параметры.ПриходЦел0 = Формат(стр.НачалоРаботы,"ДФ=HH:mm");
				ФотоЦелый.Параметры.УходЦел0 =   Формат(стр.КонецРаботы, "ДФ=HH:mm");
				Если МФот[0] <> "" тогда
					ФотоЦелый.Рисунки.ФотоНачЦел0.Картинка =Новый Картинка(МФот[0].Получить())
				КонецЕсли;
				Если МФот[1] <> "" тогда
					ФотоЦелый.Рисунки.ФотоКонЦел0.Картинка =Новый Картинка(МФот[1].Получить())
				КонецЕсли;	
				Попытка
					Если стр.ПутьКОстновнойФото <>"" тогда
						ФотоЦелый.Рисунки.ФотоСотЦел0.Картинка =Новый Картинка(ПолучитьФотоОсновное(Стр.ПутьКОстновнойФото).Получить())
					КонецЕсли;	
				Исключение
				КонецПопытки;	
			ИначеЕсли ВыводитьШапкуТаблицы = 1 тогда
				ФотоЦелый.Параметры.СотрудникЦел1 = стр.Сотрудник;
				ФотоЦелый.Параметры.ДолжностьЦел1 = НРег(стр.Сотрудник.Должность.Наименование);
				ФотоЦелый.Параметры.ПриходЦел1 = Формат(стр.НачалоРаботы,"ДФ=HH:mm");
				ФотоЦелый.Параметры.УходЦел1 =   Формат(стр.КонецРаботы, "ДФ=HH:mm");
				Если МФот[0] <> "" тогда
					ФотоЦелый.Рисунки.ФотоНачЦел1.Картинка =Новый Картинка(МФот[0].Получить())
				КонецЕсли;
				Если МФот[1] <> "" тогда
					ФотоЦелый.Рисунки.ФотоКонЦел1.Картинка =Новый Картинка(МФот[1].Получить())
				КонецЕсли;	
				Попытка
					Если стр.ПутьКОстновнойФото <>"" тогда
						ФотоЦелый.Рисунки.ФотоСотЦел1.Картинка =Новый Картинка(ПолучитьФотоОсновное(Стр.ПутьКОстновнойФото).Получить())
					КонецЕсли;	
				Исключение
				КонецПопытки;
			ИначеЕсли ВыводитьШапкуТаблицы = 2 тогда
				ФотоЦелый.Параметры.СотрудникЦел2 = стр.Сотрудник;
				ФотоЦелый.Параметры.ДолжностьЦел2 = НРег(стр.Сотрудник.Должность.Наименование);
				ФотоЦелый.Параметры.ПриходЦел2 = Формат(стр.НачалоРаботы,"ДФ=HH:mm");
				ФотоЦелый.Параметры.УходЦел2 =   Формат(стр.КонецРаботы, "ДФ=HH:mm");
				Если МФот[0] <> "" тогда
					ФотоЦелый.Рисунки.ФотоНачЦел2.Картинка =Новый Картинка(МФот[0].Получить())
				КонецЕсли;
				
				Если МФот[1] <> "" тогда
					ФотоЦелый.Рисунки.ФотоКонЦел2.Картинка =Новый Картинка(МФот[1].Получить())
				КонецЕсли;	
				Попытка
					Если стр.ПутьКОстновнойФото <>"" тогда
						ФотоЦелый.Рисунки.ФотоСотЦел2.Картинка =Новый Картинка(ПолучитьФотоОсновное(Стр.ПутьКОстновнойФото).Получить())
					КонецЕсли;	
				Исключение
				КонецПопытки;
			ИначеЕсли ВыводитьШапкуТаблицы = 3 тогда
				ФотоЦелый.Параметры.СотрудникЦел3 = стр.Сотрудник;
				ФотоЦелый.Параметры.ДолжностьЦел3 = НРег(стр.Сотрудник.Должность.Наименование);
				ФотоЦелый.Параметры.ПриходЦел3 = Формат(стр.НачалоРаботы,"ДФ=HH:mm");
				ФотоЦелый.Параметры.УходЦел3 =   Формат(стр.КонецРаботы, "ДФ=HH:mm");
				Если МФот[0] <> "" тогда
					ФотоЦелый.Рисунки.ФотоНачЦел3.Картинка =Новый Картинка(МФот[0].Получить())
				КонецЕсли;
				
				Если МФот[1] <> "" тогда
					ФотоЦелый.Рисунки.ФотоКонЦел3.Картинка =Новый Картинка(МФот[1].Получить())
				КонецЕсли;	
				Попытка
					Если стр.ПутьКОстновнойФото <>"" тогда
						ФотоЦелый.Рисунки.ФотоСотЦел3.Картинка =Новый Картинка(ПолучитьФотоОсновное(Стр.ПутьКОстновнойФото).Получить())
					КонецЕсли;	
				Исключение
				КонецПопытки;
				//ИначеЕсли ВыводитьШапкуТаблицы = 4 тогда
				//	ВыводитьШапкуТаблицы = 0;
				//	ТабДокумент.Вывести(ФотоЦелый);
				Если не  ТабДокумент.ПроверитьВывод(ФотоЦелый) ТОГДА
					 ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;	
				
				ТабДокумент.Вывести(ФотоЦелый);
			КонецЕсли;
			ВыводитьШапкуТаблицы = ВыводитьШапкуТаблицы + 1;
			//КонецЕсли;	
			//Если ФлагПервыйВыавод тогда
			//	ШапкаФотоТаблица = Макет.ПолучитьОбласть("ШапкаФото|ШапкаТаблицы");
			//	ТабДокумент.Вывести(ШапкаФотоТаблица);
			//	
			//КонецЕсли;
			//
			//Если ВыводитьШапкуТаблицы = 4 тогда
			//	
			//	ШапкаФотоТаблица = Макет.ПолучитьОбласть("ШапкаФото|ШапкаТаблицы");
			//	ТабДокумент.Вывести(ШапкаФотоТаблица);
			//КонецЕсли;
			//
			//
			//ШапкаТаблицыОтметка = Макет.ПолучитьОбласть("ШапкаФото|Отметка");
			//ШапкаТаблицыОтметка.Параметры.Сотрудник = стр.Сотрудник;
			//ШапкаТаблицыОтметка.Параметры.Должность = стр.Сотрудник.Должность;
			//СтрФотоСотр = ТЗФотоСотрудников.Найти(стр.Сотрудник,"Объект");
			//Если СтрФотоСотр <> Неопределено тогда
			//	ШапкаТаблицыОтметка.Параметры.ФотоСот.Картинка = СтрФотоСотр.Данные.Получить();
			//КонецЕсли;
			//
			//ТабДокумент.Присоединить(ШапкаТаблицыОтметка);
			//Если ФлагПервыйВыавод тогда
			//	ШапкаТаблицыВремя = Макет.ПолучитьОбласть("Фото|ШапкаТаблицы");
			//	ШапкаТаблицыВремя.Параметры.ДатаТек = Формат(стр.ДатаРаботы,"ДФ=dd.MM");
			//	ШапкаТаблицыВремя.Параметры.ДеньТек = Формат(стр.ДатаРаботы,"ДФ=дддд");
			//	ТабДокумент.Вывести(ШапкаТаблицыВремя);
			//	ФлагПервыйВыавод = Ложь ;
			//КонецЕсли;
			//
			//Если ВыводитьШапкуТаблицы = 4 тогда
			//	
			//	ШапкаТаблицыВремя = Макет.ПолучитьОбласть("Фото|ШапкаТаблицы");
			//	ШапкаТаблицыВремя.Параметры.ДатаТек = Формат(стр.ДатаРаботы,"ДФ=dd.MM");
			//	ШапкаТаблицыВремя.Параметры.ДеньТек = Формат(стр.ДатаРаботы,"ДФ=дддд");
			//	Если Не ТабДокумент.ПроверитьВывод(ШапкаТаблицыВремя) тогда
			//		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			//	КонецЕсли;
			//	ТабДокумент.Вывести(ШапкаТаблицыВремя);
			//	ВыводитьШапкуТаблицы = 0 ;
			//	//ИначеЕсли ВыводитьШапкуТаблицы <> 4 и НЕ ФлагПервыйВыавод тогда
			//	//		ШапкаТаблицыВремя = Макет.ПолучитьОбласть("Фото|ШапкаТаблицы");
			//	//	ШапкаТаблицыВремя.Параметры.ДатаТек = Формат(стр.ДатаРаботы,"ДФ=dd.MM");
			//	//	ШапкаТаблицыВремя.Параметры.ДеньТек = Формат(стр.ДатаРаботы,"ДФ=дддд");
			//	//	ТабДокумент.Присоединить(ШапкаТаблицыВремя);
			//	
			//КонецЕсли;
			//
			//ШапкаТаблицыОтметка = Макет.ПолучитьОбласть("Фото|Отметка");
			////ШапкаТаблицыОтметка.Параметры.Сотрудник = стр.Сотрудник;
			////ШапкаТаблицыОтметка.Параметры.Должность = стр.Сотрудник.Должность;
			//ВыделениеПриход = Ложь;
			//ВыделениеУход = Ложь;
			//Если (Стр.Отработан = 0 и Стр.ПоПлану = 1) или Стр.Прогул = 1 или Стр.Опоздал = 1 или Стр.НеОтметился = 1 тогда
			//	ВыделениеПриход = Истина;
			//КонецЕсли;	 
			////
			////Если ВыделениеПриход тогда
			////	ШапкаТаблицыОтметка.ТекущаяОбласть.ЦветТекста = WebЦвета.Красный;
			////КонецЕсли;
			//
			//Если (Стр.Отработан = 0 и Стр.ПоПлану = 1) или Стр.Прогул = 1 или Стр.РаньшеУшел = 1 или Стр.НеОтметился = 1 тогда
			//	ВыделениеУход = Истина;
			//КонецЕсли;
			//
			////Если ВыделениеУход тогда
			////ШапкаТаблицыОтметка.ТекущаяОбласть.ЦветТекста = WebЦвета.Красный;
			//
			////КонецЕсли;
			//
			//ШапкаТаблицыОтметка.Параметры.Приход = Формат(стр.НачалоРаботы,"ДЛФ=T");
			//ШапкаТаблицыОтметка.Параметры.Уход =   Формат(стр.КонецРаботы, "ДЛФ=T");
			//
			//ТабДокумент.Присоединить(ШапкаТаблицыОтметка);
			//
			//ВыводитьШапкуТаблицы  =  ВыводитьШапкуТаблицы+1;		
		КонецЦикла; // цикл по сотрудникам	
	КонецЦикла; // цикл по отделам
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.Защита = Истина;
	ТабДокумент.ОтображатьСетку = Ложь;
	
	Возврат ТабДокумент;
	
КонецФункции

Процедура ВыбратьЭлементыВИерархии(ВыборкаСИерархией,Дерево)
    Пока ВыборкаСИерархией.Следующий() Цикл
        Если ВыборкаСИерархией.ТипЗаписи()=ТипЗаписиЗапроса.ИтогПоИерархии Тогда
            Строка=Дерево.Строки.Добавить();
            Строка.Номенклатура=ВыборкаСИерархией.Ссылка;
            ВыбратьЭлементыВИерархии (ВыборкаСИерархией.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией,"Ссылка"),Строка);
        ИначеЕсли ВыборкаСИерархией.ТипЗаписи()=ТипЗаписиЗапроса.ИтогПоГруппировке Тогда
            //Тут на самом деле есть еще один уровень, но нам он может потребоваться, 
            //только если нужно взять данные на уровне записи
            //Если это нужно, здесь обходим один элемент, забираем из него данные
            //Выборка=ВыборкаСИерархией.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам
            //Пока ВыборкаСледующий() Цикл
            //    Строка=Дерево.Строки.Добавить();
            //    Строка.Номенклатура=ВыборкаСИерархией.Ссылка;
            //КонецЦикла;
            Строка=Дерево.Строки.Добавить();
            Строка.Номенклатура=ВыборкаСИерархией.Ссылка;
        КонецЕсли;   
    КонецЦикла;
КонецПроцедуры

Функция ПолучитьФото( ПутькФайлуПриход, ПутькФайлуУход)
	мПуть = Новый Массив;
	мПуть.Добавить("");
	мПуть.Добавить("");
	
	
	Если ПутькФайлуПриход <> ""тогда
		мПуть[0] = ОбщиеСервер.ПолучитьФайлИзХранилища(ПутькФайлуПриход);
	КонецЕсли;	
	Если ПутькФайлуУход <> ""тогда
		мПуть[1] = ОбщиеСервер.ПолучитьФайлИзХранилища(ПутькФайлуУход);
	КонецЕсли;	
	
	
	Возврат мПуть; 
	
КонецФункции

Функция ПолучитьФотоОсновное( Путь)
	Картинка = "";
	Если Путь <> ""тогда
		Попытка
			Картинка = ОбщиеСервер.ПолучитьФайлИзХранилища(Константы.ПустьКХранилищюСканов.Получить()+Путь);
		Исключение
		КонецПопытки;	
	КонецЕсли;	
	
	Возврат Картинка; 
	
КонецФункции
//////////////////////////////////////////////////////////////////////
Права = Неопределено;
#Если Клиент Тогда
	Права = глПрава;
#КонецЕсли
