///////////////////////////////////////////////////////////////////////////////
// Модуль формы элемента справочника "Комментарии (CRM инфотек)"
//
///////////////////////////////////////////////////////////////////////////////
		   
#Область ОбработчикиСобытийЭлементовФормы
		   
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если ПустаяСтрока(СокрЛП(Объект.Комментарий)) Тогда
	    Объект.Комментарий = Объект.Наименование;
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	 Объект.Комментарий =  Объект.Наименование;   

КонецПроцедуры

#КонецОбласти