
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Вставить содержимое обработчика.
	Если Параметры.Свойство("СхемаКомпоновки") Тогда
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Параметры.СхемаКомпоновки));
	КонецЕсли;
	
	Если Параметры.Свойство("ПоляГруппировки") И (НЕ Параметры.ПоляГруппировки = Неопределено) Тогда
		Для Каждого ТекГруппировка Из Параметры.ПоляГруппировки.Элементы Цикл
			ПоляГруппировки.Добавить(ТекГруппировка.Поле);
		КонецЦикла;
	КонецЕсли;
	
	Если Параметры.Свойство("ТолькоРесурсы") Тогда
		ТолькоРесурсы = Параметры.ТолькоРесурсы;
	КонецЕсли;
	
	Если Параметры.Свойство("ПолеГруппировки") Тогда
		ПолеГруппировки = Параметры.ПолеГруппировки;
	КонецЕсли;
	
	Если Параметры.Свойство("ВидПолей") Тогда
		ВидПолей = Параметры.ВидПолей;
		Если ВидПолей = "Выбор" Тогда
			Элементы.ГруппаПоляВыбора.ТекущаяСтраница = Элементы.ГруппаВыбор;
		ИначеЕсли ВидПолей = "ДопПоля" Тогда
			Элементы.ГруппаПоляВыбора.ТекущаяСтраница = Элементы.ГруппаВыбор;
		ИначеЕсли ВидПолей = "Порядок" Тогда
			Элементы.ГруппаПоляВыбора.ТекущаяСтраница = Элементы.ГруппаПорядок;
		ИначеЕсли ВидПолей = "ПоляГруппировок" Тогда
			Элементы.ГруппаПоляВыбора.ТекущаяСтраница = Элементы.ГруппаПоляГруппировки;
			КомпоновщикНастроек.ЗагрузитьНастройки(Параметры.НастройкиОтчета);
			СтрокаСтруктуры = ОтчетыСервер.КомпоновщикПолучитьПервуюСтрокуСтруктурыПоПолю(КомпоновщикНастроек.Настройки.Структура);
			Если НЕ СтрокаСтруктуры = Неопределено Тогда
				Элементы.КомпоновщикНастроекНастройки.ТекущаяСтрока = КомпоновщикНастроек.Настройки.ПолучитьИдентификаторПоОбъекту(СтрокаСтруктуры);
			КонецЕсли;
			//Элементы.КомпоновщикНастроекНастройки.ТекущаяСтрока = Параметры.ТекущаяСтрока;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("Поле") Тогда
		Если ВидПолей = "ДопПоля" Тогда
			ДоступноеПоле = КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.НайтиПоле(Параметры.Поле);
			Если НЕ ДоступноеПоле = Неопределено Тогда
				ИдентификаторСтроки = КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.ПолучитьИдентификаторПоОбъекту(ДоступноеПоле);
				Элементы.ДоступныеПоляВыбора.ТекущаяСтрока = ИдентификаторСтроки;
			КонецЕсли;
		ИначеЕсли ВидПолей = "Порядок" Тогда
			ДоступноеПоле = КомпоновщикНастроек.Настройки.ДоступныеПоляПорядка.НайтиПоле(Параметры.Поле);
			Если НЕ ДоступноеПоле = Неопределено Тогда
				ИдентификаторСтроки = КомпоновщикНастроек.Настройки.ДоступныеПоляПорядка.ПолучитьИдентификаторПоОбъекту(ДоступноеПоле);
				Элементы.ДоступныеПоляПорядка.ТекущаяСтрока = ИдентификаторСтроки;
			КонецЕсли;
		ИначеЕсли ВидПолей = "ПоляГруппировок" Тогда
			ДоступноеПоле = КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.НайтиПоле(Параметры.Поле);
			Если НЕ ДоступноеПоле = Неопределено Тогда
				//ИдентификаторСтроки = КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.ПолучитьИдентификаторПоОбъекту(ДоступноеПоле);
				//Элементы.ДоступныеПоляГруппировок.ТекущаяСтрока = ИдентификаторСтроки;
				Элементы.ДоступныеПоляГруппировок.ТекущаяСтрока = 3;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОграничения(ДоступныеПоляВыбора, ОграниченияИспользованияПолей, УстановленоОграничение = Ложь)
	
	СистемноеПоле = Новый ПолеКомпоновкиДанных("СистемныеПоля");
	Для Каждого ТекПоле Из ДоступныеПоляВыбора Цикл
		
		Если ТекПоле.Папка Тогда
			ПустаяГруппа = Ложь;
			УстановитьОграничения(ТекПоле.Элементы, ОграниченияИспользованияПолей, ПустаяГруппа);
			Если НЕ ПустаяГруппа Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекПоле.Ресурс Тогда
			Продолжить;
		КонецЕсли;
		
		Если (НЕ ТолькоРесурсы) И ТекПоле.Поле = СистемноеПоле Тогда
			Продолжить;
		КонецЕсли;
		
		УстановленоОграничение = Истина;
		
		НовоеОграничение = ОграниченияИспользованияПолей.Добавить();
		НовоеОграничение.Поле        = ТекПоле.Поле;
		НовоеОграничение.Доступность = (НЕ ПоляГруппировки.НайтиПоЗначению(ТекПоле.Поле) = Неопределено);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВидПолей = "ДопПоля" Тогда
		ДоступныеПоляВыбора = КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора;
		ОграниченияИспользованияПолей = Элементы.ДоступныеПоляВыбора.ОграниченияИспользования;
	ИначеЕсли ВидПолей = "Порядок" Тогда
		ДоступныеПоляВыбора = КомпоновщикНастроек.Настройки.ДоступныеПоляПорядка;
		ОграниченияИспользованияПолей = Элементы.ДоступныеПоляПорядка.ОграниченияИспользования;
	ИначеЕсли ВидПолей = "ПоляГруппировок" Тогда
		ДоступныеПоляВыбора = КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок;
		ОграниченияИспользованияПолей = Элементы.ДоступныеПоляГруппировок.ОграниченияИспользования;
	КонецЕсли;
	
	Если ВидПолей = "Выбор" Тогда
		
		ДоступныеПоляВыбора = КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора;
		ОграниченияИспользованияПолей = Элементы.ДоступныеПоляВыбора.ОграниченияИспользования;
		
		Если НЕ ПолеГруппировки = Неопределено Тогда
			ПоляВетки = КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.НайтиПоле(ПолеГруппировки);
			Если ПоляВетки.Элементы.Количество()>0 Тогда
				ИдентификаторПоля = ДоступныеПоляВыбора.ПолучитьИдентификаторПоОбъекту(ПоляВетки.Элементы[0]);
				Элементы.ДоступныеПоляВыбора.ТекущаяСтрока = ИдентификаторПоля;
			КонецЕсли;
			
			РодительГруппировки = КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.НайтиПоле(ПолеГруппировки);
			Пока НЕ РодительГруппировки = Неопределено Цикл
				Если РодительГруппировки.Родитель = Неопределено Тогда
					Для Каждого ТекПоле Из КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
						НовоеОграничение = ОграниченияИспользованияПолей.Добавить();
						НовоеОграничение.Поле        = ТекПоле.Поле;
						НовоеОграничение.Доступность = Ложь;
					КонецЦикла;
				Иначе
					Для Каждого ТекПоле Из РодительГруппировки.Родитель.Элементы Цикл
						НовоеОграничение = ОграниченияИспользованияПолей.Добавить();
						НовоеОграничение.Поле        = ТекПоле.Поле;
						НовоеОграничение.Доступность = Ложь;
					КонецЦикла;
				КонецЕсли;
				РодительГруппировки = РодительГруппировки.Родитель;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли НЕ ВидПолей = "ПоляГруппировок" Тогда
		
		УстановитьОграничения(ДоступныеПоляВыбора.Элементы, ОграниченияИспользованияПолей);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыбранноеПоле = Неопределено;
	Если ВидПолей = "Выбор" Тогда
		ИдентификаторОбъекта = Элементы.ДоступныеПоляВыбора.ТекущаяСтрока;
		
		Если ИдентификаторОбъекта = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ВыбранноеПоле = КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.ПолучитьОбъектПоИдентификатору(ИдентификаторОбъекта);
		
		Если НЕ ВыбранноеПоле = Неопределено И (НЕ ВыбранноеПоле.Поле = ПолеГруппировки) Тогда
			Если ВыбранноеПоле.Папка Тогда
				Если Элементы.ДоступныеПоляВыбора.Развернут(ИдентификаторОбъекта) Тогда
					Элементы.ДоступныеПоляВыбора.Свернуть(ИдентификаторОбъекта);
				Иначе
					Элементы.ДоступныеПоляВыбора.Развернуть(ИдентификаторОбъекта);
				КонецЕсли;
				Возврат;
			КонецЕсли;
			Результат = Новый Структура("Поле, Заголовок", ВыбранноеПоле.Поле, ВыбранноеПоле.Заголовок);
		КонецЕсли;
		
	ИначеЕсли ВидПолей = "ДопПоля" Тогда
		ИдентификаторОбъекта = Элементы.ДоступныеПоляВыбора.ТекущаяСтрока;
		
		Если ИдентификаторОбъекта = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ВыбранноеПоле = КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.ПолучитьОбъектПоИдентификатору(ИдентификаторОбъекта);
		
		Если НЕ ВыбранноеПоле = Неопределено И (НЕ ВыбранноеПоле.Поле = ПолеГруппировки) Тогда
			Если ВыбранноеПоле.Папка Тогда
				Если Элементы.ДоступныеПоляВыбора.Развернут(ИдентификаторОбъекта) Тогда
					Элементы.ДоступныеПоляВыбора.Свернуть(ИдентификаторОбъекта);
				Иначе
					Элементы.ДоступныеПоляВыбора.Развернуть(ИдентификаторОбъекта);
				КонецЕсли;
				Возврат;
			КонецЕсли;
			Результат = Новый Структура("Поле, Заголовок", ВыбранноеПоле.Поле, ВыбранноеПоле.Заголовок);
		КонецЕсли;
		
	ИначеЕсли ВидПолей = "Порядок" Тогда
		ИдентификаторОбъекта = Элементы.ДоступныеПоляПорядка.ТекущаяСтрока;
		
		Если ИдентификаторОбъекта = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ВыбранноеПоле = КомпоновщикНастроек.Настройки.ДоступныеПоляПорядка.ПолучитьОбъектПоИдентификатору(ИдентификаторОбъекта);
		
		Если НЕ ВыбранноеПоле = Неопределено И (НЕ ВыбранноеПоле.Поле = ПолеГруппировки) Тогда
			Если ВыбранноеПоле.Папка Тогда
				Если Элементы.ДоступныеПоляПорядка.Развернут(ИдентификаторОбъекта) Тогда
					Элементы.ДоступныеПоляПорядка.Свернуть(ИдентификаторОбъекта);
				Иначе
					Элементы.ДоступныеПоляПорядка.Развернуть(ИдентификаторОбъекта);
				КонецЕсли;
				Возврат;
			КонецЕсли;
			Результат = Новый Структура("Поле, Заголовок", ВыбранноеПоле.Поле, ВыбранноеПоле.Заголовок);
		КонецЕсли;
		
	ИначеЕсли ВидПолей = "ПоляГруппировок" Тогда
		ИдентификаторОбъекта = Элементы.ДоступныеПоляГруппировок.ТекущаяСтрока;
		
		Если ИдентификаторОбъекта = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ВыбранноеПоле = КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.ПолучитьОбъектПоИдентификатору(ИдентификаторОбъекта);
		
		Если НЕ ВыбранноеПоле = Неопределено И (НЕ ВыбранноеПоле.Поле = ПолеГруппировки) Тогда
			Если ВыбранноеПоле.Папка Тогда
				Если Элементы.ДоступныеПоляГруппировок.Развернут(ИдентификаторОбъекта) Тогда
					Элементы.ДоступныеПоляГруппировок.Свернуть(ИдентификаторОбъекта);
				Иначе
					Элементы.ДоступныеПоляГруппировок.Развернуть(ИдентификаторОбъекта);
				КонецЕсли;
				Возврат;
			КонецЕсли;
			Результат = Новый Структура("Поле, Заголовок", ВыбранноеПоле.Поле, ВыбранноеПоле.Заголовок);
		КонецЕсли;
		
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеПоляВыбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Результат = Неопределено;
	
	СтандартнаяОбработка = Ложь;
	ВыбранноеПоле = КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.ПолучитьОбъектПоИдентификатору(ВыбраннаяСтрока);
	Если НЕ ВыбранноеПоле = Неопределено И (НЕ ВыбранноеПоле.Поле = ПолеГруппировки) Тогда
		Если ВыбранноеПоле.Папка Тогда
			Если Элементы.ДоступныеПоляВыбора.Развернут(ВыбраннаяСтрока) Тогда
				Элементы.ДоступныеПоляВыбора.Свернуть(ВыбраннаяСтрока);
			Иначе
				Элементы.ДоступныеПоляВыбора.Развернуть(ВыбраннаяСтрока);
			КонецЕсли;
			Возврат;
		КонецЕсли;
		Результат = Новый Структура("Поле, Заголовок", ВыбранноеПоле.Поле, ВыбранноеПоле.Заголовок);
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеПоляПорядкаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Результат = Неопределено;
	
	СтандартнаяОбработка = Ложь;
	ВыбранноеПоле = КомпоновщикНастроек.Настройки.ДоступныеПоляПорядка.ПолучитьОбъектПоИдентификатору(ВыбраннаяСтрока);
	Если НЕ ВыбранноеПоле = Неопределено И (НЕ ВыбранноеПоле.Поле = ПолеГруппировки) Тогда
		Если ВыбранноеПоле.Папка Тогда
			Если Элементы.ДоступныеПоляПорядка.Развернут(ВыбраннаяСтрока) Тогда
				Элементы.ДоступныеПоляПорядка.Свернуть(ВыбраннаяСтрока);
			Иначе
				Элементы.ДоступныеПоляПорядка.Развернуть(ВыбраннаяСтрока);
			КонецЕсли;
			Возврат;
		КонецЕсли;
		Результат = Новый Структура("Поле, Заголовок", ВыбранноеПоле.Поле, ВыбранноеПоле.Заголовок);
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеПоляГруппировокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбранноеПоле = КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.ПолучитьОбъектПоИдентификатору(ВыбраннаяСтрока);
	Если НЕ ВыбранноеПоле = Неопределено И (НЕ ВыбранноеПоле.Поле = ПолеГруппировки) Тогда
		Если ВыбранноеПоле.Папка Тогда
			Если Элементы.ДоступныеПоляГруппировок.Развернут(ВыбраннаяСтрока) Тогда
				Элементы.ДоступныеПоляГруппировок.Свернуть(ВыбраннаяСтрока);
			Иначе
				Элементы.ДоступныеПоляГруппировок.Развернуть(ВыбраннаяСтрока);
			КонецЕсли;
			Возврат;
		КонецЕсли;
		СтруктураПоля = Новый Структура("Поле, Заголовок", ВыбранноеПоле.Поле, ВыбранноеПоле.Заголовок);
	КонецЕсли;
	
	Закрыть(СтруктураПоля);
	
КонецПроцедуры
