
// Возвращает строку списка полей.
//
// Параметры:
//	СоответствиеПолей - Соответствие - соттветствие полей.
//	
// Возвращаемое значение - Строка - преобразованное соответствие в строку.
//
Функция ПреобразоватьСписокПолейВСтроку(СоответствиеПолей) Экспорт
	
	Результат = "";
	Для Каждого Элемент Из СоответствиеПолей Цикл
		
		Значение = Элемент.Значение;
		Если ПустаяСтрока(Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		Результат = Результат + ?(Результат = "", "", Символы.ПС) + 
			Элемент.Представление + "=" + СтрЗаменить(Значение, Символы.ПС, Символы.ПС + Символы.Таб);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает список значений. Преобразует строку полей в список значений.
//
// Параметры:
//	СтрокаПолей - Строка - строка полей.
//
// Возвращаемое значение - Список значений - список значений полей.
//
Функция ПреобразоватьСтрокуВСписокПолей(СтрокаПолей) Экспорт
	
	Результат = Новый СписокЗначений;
	ПоследнийЭлемент = Неопределено;
	
	Для Итерация = 1 По СтрЧислоСтрок(СтрокаПолей) Цикл
		ПолученнаяСтрока = СтрПолучитьСтроку(СтрокаПолей, Итерация);
		Если Лев(ПолученнаяСтрока, 1) = Символы.Таб Тогда
			Если ПоследнийЭлемент <> Неопределено Тогда
				ПоследнийЭлемент.Значение = ПоследнийЭлемент.Значение + Символы.ПС + Сред(ПолученнаяСтрока, 2);
			КонецЕсли;
		Иначе
			ПозицияСимвола = Найти(ПолученнаяСтрока, "=");
			Если ПозицияСимвола <> 0 Тогда
				ПоследнийЭлемент = Результат.Добавить(Сред(ПолученнаяСтрока, ПозицияСимвола + 1), Лев(ПолученнаяСтрока, ПозицияСимвола - 1));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//#Если Сервер Тогда
Функция ТелефонКлиента(Клиент) Экспорт
	
	Менеджер = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	Менеджер.Объект = Клиент;
	Менеджер.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	Менеджер.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый;
	Менеджер.Прочитать();
	Возврат Менеджер.Представление;
	
КонецФункции

Функция АдресКлиента(Клиент) Экспорт

    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	КонтактнаяИнформация.Представление
    |ИЗ
    |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
    |ГДЕ
    |	КонтактнаяИнформация.Объект = &Объект
    |	И КонтактнаяИнформация.Тип = &Тип
    |	И КонтактнаяИнформация.ЗначениеПоУмолчанию = Истина";
    Запрос.УстановитьПараметр("Объект", Клиент);
    Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Представление;
    Иначе
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ первые 1
        |	КонтактнаяИнформация.Представление
        |ИЗ
        |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
        |ГДЕ
        |	КонтактнаяИнформация.Объект = &Объект
        |	И КонтактнаяИнформация.Тип = &Тип";
        Запрос.УстановитьПараметр("Объект", Клиент);
        Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
        Выборка = Запрос.Выполнить().Выбрать();
        Если Выборка.Следующий() Тогда
            Возврат Выборка.Представление;
        Иначе
            Возврат "";
        КонецЕсли;
    КонецЕсли;

КонецФункции
//#КонецЕсли

// Процедура создает или перезаписывает телефон клиента, используемый по умолчанию
Процедура ЗаписатьОсновнойТелефонКлиента(ПредставлениеТелефона, Клиент) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	СтруктураНомераТелефона = РазобратьНомерТелефонаВСтруктуру(ПредставлениеТелефона);
	ЕстьЗначениеПоУмолчанию = Ложь;
	Набор = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	Набор.Отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.Телефон);
	Набор.Отбор.Объект.Установить(Клиент);
	Набор.Прочитать();
	Для Каждого Запись Из Набор Цикл
		Если Запись.ЗначениеПоУмолчанию Тогда
			ЕстьЗначениеПоУмолчанию = Истина;
			Если ЗначениеЗаполнено(ПредставлениеТелефона) Тогда
				Если СтруктураНомераТелефона<>Неопределено Тогда
					Запись.Поле1 = СтруктураНомераТелефона.КодСтраны;
					Запись.Поле2 = СтруктураНомераТелефона.КодГорода;
					Запись.Поле3 = СтруктураНомераТелефона.НомерТелефона;
					Запись.Поле4 = СтруктураНомераТелефона.Внутренний;
				КонецЕсли;
				Запись.Представление = ПредставлениеТелефона;
			Иначе
				Набор.Удалить(Запись);
			КонецЕсли;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьЗначениеПоУмолчанию = Истина Тогда
		Если ЗначениеЗаполнено(ПредставлениеТелефона) Тогда
			Если Набор.Количество() = 0 Тогда
				Запись = Набор.Добавить();
				Запись.Объект = Клиент;
				Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
				Запись.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый;
				Запись.ЗначениеПоУмолчанию = Истина;
				Если СтруктураНомераТелефона<>Неопределено Тогда
					Запись.Поле1 = СтруктураНомераТелефона.КодСтраны;
					Запись.Поле2 = СтруктураНомераТелефона.КодГорода;
					Запись.Поле3 = СтруктураНомераТелефона.НомерТелефона;
					Запись.Поле4 = СтруктураНомераТелефона.Внутренний;
				КонецЕсли;
				Запись.Представление = ПредставлениеТелефона;
			Иначе
				Записано = Ложь;
				Для Каждого Запись ИЗ Набор Цикл
					Если Запись.Представление = ПредставлениеТелефона Тогда
						Запись.ЗначениеПоУмолчанию = Истина;
						Записано = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если НЕ Записано = Истина Тогда
					Для Каждого Запись ИЗ Набор Цикл
						Если Запись.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый Тогда
							Если СтруктураНомераТелефона<>Неопределено Тогда
								Запись.Поле1 = СтруктураНомераТелефона.КодСтраны;
								Запись.Поле2 = СтруктураНомераТелефона.КодГорода;
								Запись.Поле3 = СтруктураНомераТелефона.НомерТелефона;
								Запись.Поле4 = СтруктураНомераТелефона.Внутренний;
							КонецЕсли;
							Запись.Представление = ПредставлениеТелефона;
							Запись.ЗначениеПоУмолчанию = Истина;
							Записано = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если НЕ Записано = Истина Тогда
						Запись = Набор.Добавить();
						Запись.Объект = Клиент;
						Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
						Запись.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый;
						Если СтруктураНомераТелефона<>Неопределено Тогда
							Запись.Поле1 = СтруктураНомераТелефона.КодСтраны;
							Запись.Поле2 = СтруктураНомераТелефона.КодГорода;
							Запись.Поле3 = СтруктураНомераТелефона.НомерТелефона;
							Запись.Поле4 = СтруктураНомераТелефона.Внутренний;
						КонецЕсли;
						Запись.Представление = ПредставлениеТелефона;
						Запись.ЗначениеПоУмолчанию = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Набор.Записать();
	
	КлиентОбъект = Клиент.ПолучитьОбъект();
	КлиентОбъект.ОсновнойТелефон = ПредставлениеТелефона;
	КлиентОбъект.Записать();
	
КонецПроцедуры

// Процедура создает или перезаписывает электронную почту клиента, используемую по умолчанию
Процедура ЗаписатьОсновнойEmailКлиента(ПредставлениеEmail, Клиент) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	// Сначала выберем все почтовые адреса клиента и поищем значение по умолчанию.
	// Если нашли, то переписываем представление или удаляем запись если ПредставлениеEmail = ""
	ЕстьЗначениеПоУмолчанию = Ложь;
	Набор = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	Набор.Отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Набор.Отбор.Объект.Установить(Клиент);
	Набор.Прочитать();
	Для Каждого Запись Из Набор Цикл
		Если Запись.ЗначениеПоУмолчанию Тогда
			ЕстьЗначениеПоУмолчанию = Истина;
			Если ЗначениеЗаполнено(ПредставлениеEmail) Тогда
				Запись.Представление = ПредставлениеEmail;
			Иначе
				Набор.Удалить(Запись);
			КонецЕсли;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Если значение по умолчанию не нашли, но надо записать ( если ЗначениеЗаполнено(ПредставлениеEmail)),
	// то либо добавляем новую запись если их вообще нет,
	// либо проходимся по существующим - сначала ищем запись с таким же адресом, чтобы отметить основным
	// если такой нет, то перезаписываем адрес домашней почты
	Если НЕ ЕстьЗначениеПоУмолчанию = Истина Тогда
		Если ЗначениеЗаполнено(ПредставлениеEmail) Тогда
			Если Набор.Количество() = 0 Тогда
				Запись = Набор.Добавить();
				Запись.Объект = Клиент;
				Запись.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
				Запись.Вид = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний;
				Запись.ЗначениеПоУмолчанию = Истина;
				Запись.Представление = ПредставлениеEmail;
			Иначе
				Записано = Ложь;
				Для Каждого Запись ИЗ Набор Цикл
					Если Запись.Представление = ПредставлениеEmail Тогда
						Запись.ЗначениеПоУмолчанию = Истина;
						Записано = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если НЕ Записано = Истина Тогда
					Для Каждого Запись ИЗ Набор Цикл
						Если Запись.Вид = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний Тогда
							Запись.Представление = ПредставлениеEmail;
							Запись.ЗначениеПоУмолчанию = Истина;
							Записано = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если НЕ Записано = Истина Тогда
						Запись = Набор.Добавить();
						Запись.Объект = Клиент;
						Запись.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
						Запись.Вид = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний;
						Запись.Представление = ПредставлениеEmail;
						Запись.ЗначениеПоУмолчанию = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Набор.Записать();
	
КонецПроцедуры

Функция ПолучитьОсновнойТелефонКлиента(Клиент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление КАК Телефон
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Клиент
	|	И КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.ЗначениеПоУмолчанию = Истина";
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Возврат Результат.Выгрузить()[0].Телефон;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК Телефон
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Клиент
		|	И КонтактнаяИнформация.Тип = &Тип";
		Запрос.УстановитьПараметр("Клиент", Клиент);
		Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Возврат Результат.Выгрузить()[0].Телефон;
		Иначе
			Возврат "";
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьОсновнойEmailКлиента(Клиент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление КАК Email
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Клиент
	|	И КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.ЗначениеПоУмолчанию = Истина";
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Возврат Результат.Выгрузить()[0].Email;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК Email
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Клиент
		|	И КонтактнаяИнформация.Тип = &Тип";
		Запрос.УстановитьПараметр("Клиент", Клиент);
		Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Возврат Результат.Выгрузить()[0].Email;
		Иначе
			Возврат "";
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьМаксимальнуюДлинуВнутреннегоНомера()

    Попытка
        Длина = Константы.CRM_МаксимальнаяДлинаВнутреннегоНомера.Получить();
    Исключение  // Константы нет
        Длина = 4;
    КонецПопытки;

    Возврат Длина;

КонецФункции

Функция РазобратьНомерТелефонаВСтруктуру(ПредставлениеТелефона) Экспорт
	
	ПреобразовыватьТелефон = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ИспользоватьТиповойФорматТелефонов;

	СтруктураНомераТелефона = Неопределено;
	
	Если НЕ ПустаяСтрока(ПредставлениеТелефона) Тогда
		
		МаксимальнаяДлинаВнутреннегоНомера = ПолучитьМаксимальнуюДлинуВнутреннегоНомера();
		
		СтруктураНомераТелефона = Новый Структура;
		СтруктураНомераТелефона.Вставить("КодСтраны",		"");
		СтруктураНомераТелефона.Вставить("КодГорода",		"");
		СтруктураНомераТелефона.Вставить("НомерТелефона",	"");
		СтруктураНомераТелефона.Вставить("Внутренний",	"");
		СтруктураНомераТелефона.Вставить("Представление",	"");
				
		// попытаемся разложить телефонный номер, если получится
		// на составляющие, если номер введен правильно
		// т.е. полностью 8(или 7, +7)903 7721122, то будем по нему звонить
		// номер должен прийти в следующем формате +7(903)7721122 или 8(903)7721122
		НомерТелефона = ПредставлениеТелефона;
		
		СтрокаЦифр = "0123456789";
		ОчищенныйНомер = "";
		ДлинаНомера = СтрДлина(НомерТелефона);
		
		Для НомерСимвола = 1 По ДлинаНомера Цикл
			ТекущийСимвол = Сред(НомерТелефона, НомерСимвола, 1);
			Если Найти(СтрокаЦифр, ТекущийСимвол) > 0 Тогда
				ОчищенныйНомер = ОчищенныйНомер + ТекущийСимвол;
			КонецЕсли;
		КонецЦикла;
		
		НомерТелефона = ОчищенныйНомер;
		
	    ДлинаНомераТелефона = СтрДлина(СокрЛП(НомерТелефона));
		
	    ЭтоВнутренний = (ДлинаНомераТелефона <= МаксимальнаяДлинаВнутреннегоНомера);

		Если ЭтоВнутренний Тогда
			СтруктураНомераТелефона.Внутренний = НомерТелефона;
		Иначе
			
			// удалим + если есть
			Если не ПреобразовыватьТелефон Тогда
				ПредставлениеТелефона = СтрЗаменить(ПредставлениеТелефона, "+", "");
			КонецЕсли;
			
			НомКодГородаНачало = Найти(ПредставлениеТелефона, "(");
			НомКодГородаКонец = Найти(ПредставлениеТелефона, ")");
				
			// если был просто введен номер, то передадим его и позвоним
			// если был введен как полный разберем
			Если НомКодГородаНачало = 0 И НомКодГородаКонец = 0 Тогда
				ПредставлениеТелефона = ?(Лев(ПредставлениеТелефона, 1) = "7", "+" + ПредставлениеТелефона, ПредставлениеТелефона);
				СтруктураНомераТелефона.НомерТелефона = ПредставлениеТелефона;
			Иначе
				КодСтраны = СокрЛП(Лев(ПредставлениеТелефона, НомКодГородаНачало-1));
				СтруктураНомераТелефона.КодСтраны = ?(Лев(КодСтраны, 1) = "7", "+" + КодСтраны, КодСтраны);
				СтруктураНомераТелефона.КодГорода = СокрЛП(Сред(ПредставлениеТелефона, НомКодГородаНачало+1, НомКодГородаКонец-НомКодГородаНачало-1));
				СтруктураНомераТелефона.НомерТелефона = Прав(ПредставлениеТелефона, СтрДлина(ПредставлениеТелефона)-НомКодГородаКонец);
				ПредставлениеТелефона = ?(Лев(ПредставлениеТелефона, 1) = "7", "+" + ПредставлениеТелефона, ПредставлениеТелефона);
			КонецЕсли;
			
		КонецЕсли;
						
	КонецЕсли;
	
	Возврат СтруктураНомераТелефона;
	
КонецФункции	

//v+
Функция СуществуютДублиТелефона(ВладелецТелефона,Телефон) Экспорт
	Если ТипЗнч(Телефон)=Тип("Строка") Тогда
		Индекс=Renault_ОбщиеФункции.ПреобразоватьНомерДляСохранения(Телефон,СтрДлина(Телефон));
	ИначеЕсли ТипЗнч(Телефон)=Тип("Число") Тогда
		Индекс=Телефон;
	Иначе Возврат Ложь КонецЕсли;
	Если Индекс=0 Тогда Возврат Ложь КонецЕсли;
	
	Запрос=Новый Запрос("Выбрать Первые 1 1 Из РегистрСведений.КонтактнаяИнформация ГДЕ CRM_ПолеХраненияНомера=&Индекс И Объект<>&ВладелецТелефона И Объект <> NULL");
	Запрос.УстановитьПараметр("Индекс",Индекс);
	Запрос.УстановитьПараметр("ВладелецТелефона",ВладелецТелефона);
	Результат=Запрос.Выполнить();
	Если Результат.Пустой() Тогда Возврат Ложь 
		
	Иначе
		Сообщить("Обнаружены дубли телефона "+Телефон);
		Возврат Истина	
	КонецЕсли;
КонецФункции	
//v-

Функция НормализацияНомераТелефона(НомерТелефона,ДилерскийЦентр) Экспорт
	
	Телефон = CRM_Сервер.Renault_CRM_СкорректироватьТелефонПриЗаписи(НомерТелефона);
	Телефон = СтрЗаменить(Телефон, "+", "");
	
	Если НЕ ПустаяСтрока(Телефон) Тогда
		
		ПервыйСимволТелефона = ДилерскийЦентр.ПервыйСимволТелефона;
		
		Если НЕ ПустаяСтрока(ПервыйСимволТелефона) Тогда
			
			КодСтраны = СокрЛП(Лев(Телефон, 1));
			Если (КодСтраны<>"7" И КодСтраны<>"8") Тогда
				Телефон = ПервыйСимволТелефона + Телефон;
			ИначеЕсли КодСтраны="7" Или КодСтраны="8" Тогда
				Телефон = ПервыйСимволТелефона + Прав(Телефон,СтрДлина(Телефон)-1);
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат Телефон;
		
	Иначе
		
		Возврат НомерТелефона;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСтруктуруТелефонаПоПолям(НомерТелефона,ДилерскийЦентр) Экспорт
	
	СтруктураТелефона = Новый Структура;
	СтруктураТелефона.Вставить("Поле1",);
	СтруктураТелефона.Вставить("Поле2",);
	СтруктураТелефона.Вставить("Поле3",);

	СтруктураТелефона.Поле1 = ?(ЛЕВ(НомерТелефона,1) = "+", ЛЕВ(НомерТелефона,2),ЛЕВ(НомерТелефона,1));
	Если ЗначениеЗаполнено(ДилерскийЦентр) Тогда
		Если ЗначениеЗаполнено(ДилерскийЦентр.ПервыйСимволТелефона) Тогда
			СтруктураТелефона.Поле1 = ДилерскийЦентр.ПервыйСимволТелефона;
		КонецЕсли;
	КонецЕсли;

	Если СтрНайти(НомерТелефона,"(") = 0 Тогда
		Если СтрНайти(ЛЕВ(НомерТелефона, СтрДлина(ДилерскийЦентр.ПервыйСимволТелефона)),ДилерскийЦентр.ПервыйСимволТелефона) = 0 Тогда
			Если СтрДлина(НомерТелефона) = 11 Тогда
				СтруктураТелефона.Поле2 = СРеД(НомерТелефона,2,3);
				СтруктураТелефона.Поле3 = СРЕД(НомерТелефона,5);
			Иначе
				СтруктураТелефона.Поле2 = ЛЕВ(НомерТелефона,3);
				СтруктураТелефона.Поле3 = СРЕД(НомерТелефона,4,СтрДлина(НомерТелефона));
			КонецЕсли;
		Иначе
			СтруктураТелефона.Поле2 = СРЕД(НомерТелефона,СтрДлина(ДилерскийЦентр.ПервыйСимволТелефона)+1,3);
			СтруктураТелефона.Поле3 = СРЕД(НомерТелефона,СтрДлина(ДилерскийЦентр.ПервыйСимволТелефона)+4,СтрДлина(НомерТелефона));
		КонецЕсли;	
	Иначе
		СтруктураТелефона.Поле2 = СРЕД(НомерТелефона,СтрНайти(НомерТелефона,"("),5);
		СтруктураТелефона.Поле3 = СРЕД(НомерТелефона,СтрНайти(НомерТелефона,"(")+6,СтрДлина(НомерТелефона));
	КонецЕсли;
	
	Возврат СтруктураТелефона;
	
КонецФункции