Перем мЭтоНовый;
// Общий журнал

Перем Права Экспорт;

Перем Организация Экспорт;

Функция ПолучитьСписокПечатныхФорм() Экспорт
	Возврат Новый СписокЗначений();	
КонецФункции
//Конец необходимых для общих журналов

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	мЭтоНовый = ЭтоНовый();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)    	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	Если мЭтоНовый Тогда 
		РегистрыСведений.CRM_СтатусыКлиентскихЗаявок.УстановитьСтатусЗаявки(Ссылка, Перечисления.CRM_СтатусыКлиентскихЗаявок.НаРассмотрение);
	Иначе
		ТекущийСтатус = РегистрыСведений.CRM_СтатусыКлиентскихЗаявок.ПолучитьСтатусЗаявки(Ссылка);
		Если ТекущийСтатус = Перечисления.CRM_СтатусыКлиентскихЗаявок.Утверждена Тогда 
			РегистрыСведений.CRM_СтатусыКлиентскихЗаявок.УстановитьСтатусЗаявки(Ссылка, Перечисления.CRM_СтатусыКлиентскихЗаявок.НаРедактирование);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

