Процедура ПередЗаписью(Отказ, Замещение)
	Если ЭтотОбъект.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON();
	Для Каждого ТекСтрока из ЭтотОбъект Цикл
		ЧтениеJSON.УстановитьСтроку(ТекСтрока.ТелоЗапроса);
		Попытка
			стСобытие = ПрочитатьJSON(ЧтениеJSON);
		Исключение
			ТекСтрока.НужноВыгрузить = Ложь;
			Продолжить;
		КонецПопытки;
		ТекСтрока.НужноВыгрузить = ЗначениеЗаполнено(стСобытие.client_id) И ЗначениеЗаполнено(стСобытие.car_id);
	КонецЦикла;
КонецПроцедуры
