Процедура ЗаполнитьТаблицуПоказателей(ТаблицаПоказателей) Экспорт
	
	МакетНастроек = ПолучитьМакет("ExpenceCode");
	
	НачальнаяСтрока = 2;
	КонечнаяСтрока = МакетНастроек.ВысотаТаблицы;
	
	Счетчик = 0;
	
	Для НомерСтроки=НачальнаяСтрока По КонечнаяСтрока Цикл
		Счетчик = Счетчик + 1;
		
		//НоваяСтрока = ТаблицаПоказателей.Добавить();
		ТекКатегория 	= НайтиПоКоду(СокрЛП(МакетНастроек.Область(НомерСтроки, 1).Текст));
		ТекНаименование = МакетНастроек.Область(НомерСтроки, 2).Текст;
		
		//
		СтрокаКодов = СокрЛП(МакетНастроек.Область(НомерСтроки, 3).Текст);
		
		Если Найти(СтрокаКодов, ",")>0 Тогда
			МассивКодов = Renault_ОбщийМодуль.РазложитьСтрокуВМассив(СтрокаКодов, ",");
			
			МассивСтатейЗатрат = Новый Массив;
			Для Каждого элМассива из МассивКодов Цикл
				ЭлСтатьяЗатрат = Справочники.EDR_ВидыРасходов.НайтиПоКоду(СокрЛП(элМассива));
				
				Если НЕ ЭлСтатьяЗатрат = Справочники.EDR_ВидыРасходов.ПустаяСсылка() тогда
					
					НоваяСтрока = ТаблицаПоказателей.Добавить();
					НоваяСтрока.Категория 	 = ТекКатегория;
					НоваяСтрока.Наименование = ТекНаименование;
					
					НоваяСтрока.ExpenceCode = ЭлСтатьяЗатрат;
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			НоваяСтрока = ТаблицаПоказателей.Добавить();
			НоваяСтрока.Категория 	 = ТекКатегория;
			НоваяСтрока.Наименование = ТекНаименование;
			
			ЭлСтатьяЗатрат = Справочники.EDR_ВидыРасходов.НайтиПоКоду(СокрЛП(СтрокаКодов));
			
			Если НЕ ЭлСтатьяЗатрат = Справочники.EDR_ВидыРасходов.ПустаяСсылка() тогда
				НоваяСтрока.ExpenceCode = ЭлСтатьяЗатрат;
			Иначе
				НоваяСтрока.ExpenceCode = Null;
			КонецЕсли;
			
		КонецЕсли;
		
		//
		
	КонецЦикла;
	
	//%+ Дата изменения - 09.04.2012 14:14:56; Автор - Окипний Андрей Евгеньевич
	//
	// Описание изменений
	//  Добавлен алгоритм выбора кодов из табличных частей элементов самого справочника
	//%-
	
	// Комментарий 
	//Дата создания - 09.04.2012 14:17:23; Автор - Окипний Андрей Евгеньевич
	//Формирование выполняем с помощью запроса. находим все элементы с таб частями.
	//Дублирования строк не удаляем, так же как строки где ExpenceCode = null
	//они так же нужны.
	//
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	EDR_КатегорииСчетовВидыРасходов.Ссылка КАК Категория,
	|	EDR_КатегорииСчетовВидыРасходов.Ссылка.Наименование,
	|	EDR_КатегорииСчетовВидыРасходов.КодСтатьиРасходов КАК ExpenceCode
	|ПОМЕСТИТЬ ТЗ_Из_Справочника
	|ИЗ
	|	Справочник.EDR_КатегорииСчетов.ВидыРасходов КАК EDR_КатегорииСчетовВидыРасходов
	|ГДЕ
	|	EDR_КатегорииСчетовВидыРасходов.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И EDR_КатегорииСчетовВидыРасходов.КодСтатьиРасходов.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаКодов.Категория,
	|	ТаблицаКодов.Наименование,
	|	ТаблицаКодов.ExpenceCode
	|ПОМЕСТИТЬ ВремТЗ
	|ИЗ
	|	&ТаблицаКодов КАК ТаблицаКодов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТЗ.Категория,
	|	ВремТЗ.Наименование,
	|	ВремТЗ.ExpenceCode
	|ИЗ
	|	ВремТЗ КАК ВремТЗ
	|ГДЕ
	|	(НЕ ВремТЗ.ExpenceCode ЕСТЬ NULL )
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЗ_Из_Справочника.Категория,
	|	ТЗ_Из_Справочника.Наименование,
	|	ТЗ_Из_Справочника.ExpenceCode
	|ИЗ
	|	ТЗ_Из_Справочника КАК ТЗ_Из_Справочника
	|ГДЕ
	|	(НЕ ТЗ_Из_Справочника.ExpenceCode ЕСТЬ NULL )
	|	И (НЕ ТЗ_Из_Справочника.ExpenceCode = НЕОПРЕДЕЛЕНО)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТЗ_Из_Справочника
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремТЗ"
	;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТаблицаКодов",ТаблицаПоказателей);
	
	ТаблицаПоказателей = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////
// помогашки

Функция ПолучитьОписаниеТипов() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("СправочникСсылка.EDR_КатегорииСчетов"));
	Массив.Добавить(Тип("Строка"));
	
	СтрокаНаименования = Новый КвалификаторыСтроки(100);
	
	ОписаниеТипа = Новый ОписаниеТипов(массив, , СтрокаНаименования);
	
	Возврат ОписаниеТипа;
	
КонецФункции // ПолучитьОписаниеТипов()
