
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр=Истина; //акции не редактируются
	
	Эл=СовместимостьАкций.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Эл.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	Эл.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("КоммерческаяАкция1");
	Эл.ПравоеЗначение=Объект.Ссылка;
		
	УправлениеЭлементами();
КонецПроцедуры

Процедура УправлениеЭлементами()
	Элементы.СовместимостьАкций.Доступность=НЕ Объект.КомбинируемаПолностью И Не Объект.Ссылка.Пустая();
	Элементы.ГруппаСовместимостьАкций.Доступность=НЕ Объект.КомбинируемаПолностью И Не Объект.Ссылка.Пустая();
	Элементы.УсловияОбъект.Видимость=Объект.ВладелецАкции=Перечисления.DMS_ВладельцыСервисов.Автомобиль;
КонецПроцедуры	

&НаКлиенте
Процедура КомбинируемаПолностьюПриИзменении(Элемент) УправлениеЭлементами() КонецПроцедуры

Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	СовместимостьАкций.Отбор.Элементы[0].ПравоеЗначение=Объект.Ссылка;
	УправлениеЭлементами();
КонецПроцедуры

&НаКлиенте
Процедура ВладелецАкцииПриИзменении(Элемент) УправлениеЭлементами() КонецПроцедуры
