
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СоставМетаданных=Renault_ПередачаДанныхВСторонниеСистемы.СоставМетаданных();
	Для Каждого Эл Из СоставМетаданных Цикл
		Элементы.Тип.СписокВыбора.Добавить(Эл.Ключ,Эл.Значение,,БиблиотекаКартинок[Эл.Ключ]);	
	КонецЦикла;
	
	//Элементы.Тип.СписокВыбора.Добавить("Документ");
	//Элементы.Тип.СписокВыбора.Добавить("Справочник");
	ИмяРеквизитаДляПередачи=Параметры.ИмяРеквизитаДляПередачи;
	
	Если Параметры.Свойство("ИмяМД") И Параметры.ИмяМД<>"" Тогда
		СтруктураМД=Renault_ПередачаДанныхВСторонниеСистемы.СтруктураМетаданных(Параметры.ИмяМД);
		Если СтруктураМД=Неопределено Тогда Возврат КонецЕсли;
		//Тип=СтрЗаменить(СтрЗаменить(СтруктураМД.Тип,"Справочники","Справочник"),"Документы","Документ");
		
		//Ключ="";
		//Для Каждого Эл Из СоставМетаданных Цикл
		//	Если Эл.Значение=СтруктураМД.Тип Тогда
		//		Ключ=Эл.Ключ;
		//		Прервать
		//	КонецЕсли;
		//КонецЦикла;
		
		//Тип=?(СтруктураМД.Тип="","",Ключ);
		Тип=СтруктураМД.Тип;
		Вид=СтруктураМД.Вид;
		Виды=СписокМетаданных();
		Если СтруктураМД.Таблица<>Неопределено Тогда Вид=Вид+"."+СтруктураМД.Таблица КонецЕсли;	
		//Элементы.Виды.ТекущийЭлемент=Вид;
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	Виды.Очистить();
	Виды=СписокМетаданных();
КонецПроцедуры
Функция СписокМетаданных()
	Если Тип="" Тогда Возврат "" КонецЕсли;
	Сп=Новый СписокЗначений;
	СоставМетаданных=Renault_ПередачаДанныхВСторонниеСистемы.СоставМетаданных();
	Для Каждого МД Из Метаданные[СоставМетаданных[Тип]] Цикл 
		//не все регистры одинаково хороши. Подчиненные регистратору не выгружаем
		Если Найти(МД.Имя,"РегистрСведений.")>0 И МД.РежимЗаписи=Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору Тогда Продолжить КонецЕсли;
		Синоним=?(МД.Синоним="",МД.Имя,МД.Синоним);
		Сп.Добавить(МД.Имя,Синоним,?(МД.Имя=Вид,Истина,Ложь),БиблиотекаКартинок.Реквизит);
		Попытка //попытка заполнения ТЧ (в регистрах нет ТЧ)
			Для Каждого ТЧ Из МД.ТабличныеЧасти Цикл Сп.Добавить(МД.Имя+"."+ТЧ.Имя,Синоним+" ("+?(ТЧ.Синоним="",ТЧ.Имя,ТЧ.Синоним)+")",?(МД.Имя=Вид,Истина,Ложь),БиблиотекаКартинок.ВложеннаяТаблица) КонецЦикла
		Исключение КонецПопытки	
	КонецЦикла;	
	Возврат Сп
КонецФункции	

&НаКлиенте
Процедура кнОК(Команда) ВладелецФормы.Объект[ИмяРеквизитаДляПередачи]=Тип+"."+Элементы.Виды.ТекущиеДанные.Значение; Закрыть(); КонецПроцедуры

&НаКлиенте
Процедура ВидыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) ВладелецФормы.Объект[ИмяРеквизитаДляПередачи]=Тип+"."+Элементы.Виды.ТекущиеДанные.Значение; Закрыть() КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элемент=Виды.НайтиПоЗначению(Вид);
	Если Элемент=Неопределено Тогда Возврат КонецЕсли;
	Индекс=Виды.Индекс(Виды.НайтиПоЗначению(Вид));
	Элементы.Виды.ТекущаяСтрока=Индекс;
КонецПроцедуры

