
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
	//Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ВладелецФайла")  Тогда
	
		 ВладелецФайла = ДанныеЗаполнения.ВладелецФайла;
	
	 КонецЕсли; 
	 
	 Если ДанныеЗаполнения = Неопределено Тогда
	 
	 	ДатаСоздания = ТекущаяДата();
		Автор 		 = ПараметрыСеанса.Пользователь;
	 
	 КонецЕсли; 
		 
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДатаСоздания = ТекущаяДата();
	Автор 		 = ПараметрыСеанса.Пользователь;
	
КонецПроцедуры
