&НаКлиенте
Перем Почта, Профиль, Протокол;

#Область ОбработкаСобытий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НомерЛиста=1;НачальнаяСтрока=1;
	ЗаполнитьЗначенияСвойств(ЭтаФорма,Параметры.Авторизация,"validity,period");
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Параметры.Авторизация.settings);
	Результат = ПрочитатьJSON(ЧтениеJSON,Ложь);
	ЧтениеJSON.Закрыть();
	ЗаполнитьЗначенияСвойств(ЭтаФорма,Результат);
	КодПрайса=Параметры.Сайт;
	Источник=Параметры.Источник;
	ЭтаФорма.Заголовок=ЭтаФорма.Заголовок+" "+Параметры.НаименованиеСайт;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.ЗакрыватьПриЗакрытииВладельца=Истина;
	ЗаполнитьЗначенияСвойств(Объект,ВладелецФормы.Объект,"ВнешняяОбработка");
	Если Источник="FILE" Тогда
		Элементы.ГруппаИсточники.ТекущаяСтраница=Элементы.ГруппаFile;
		Элементы.Справка.Видимость=Ложь;
	ИначеЕсли Источник="EMAIL" Тогда
		ВладелецФормы.ФормыПАВставить("ПрайсНастройкаУФ",ЭтаФорма);
		Элементы.ГруппаИсточники.ТекущаяСтраница=Элементы.ГруппаEmail;
		Запрос="{""action"":""getUserEmail"", ""schema"":""mail""}";
		ВладелецФормы.СендерОтправить(Запрос); //ПолучениеАдресовПользователя
		ВидимостьКодировки=Не Пустаястрока(Вложение) и НРЕГ(Прав(Вложение,4))=".csv";
		Элементы.Кодировка.Видимость=ВидимостьКодировки;
	Иначе
		Отказ=Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучательОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	//ВыбранноеЗначение=ВыбранноеЗначение.email;
	СтандартнаяОбработка=Ложь;
	Получатель=ВыбранноеЗначение.email;
	ПолучательПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПолучательОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Поз=Найти(Текст,"@");
	Если Поз<2 Тогда
		ДанныеВыбора=Новый СписокЗначений;
		ДанныеВыбора.Добавить(Новый Структура("Значение,ПометкаУдаления,Предупреждение",Получатель,Истина,"Адрес не содержит имя пользователя"));
		СтандартнаяОбработка=ложь;
	Иначе
		Сервер=Сред(Текст,Поз+1);
		Поз=Найти(Сервер,".");
		Если Поз<2 или Поз=СтрДлина(Сервер) Тогда
			ДанныеВыбора=Новый СписокЗначений;
			ДанныеВыбора.Добавить(Новый Структура("Значение,ПометкаУдаления,Предупреждение",Получатель,Истина,"Адрес содержит ошибочное имя сервера"));
			СтандартнаяОбработка=ложь;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательОткрытие(Элемент, СтандартнаяОбработка)
	Если ПочтаПодключена Тогда
		Почта.Отключиться();
		ПочтаПодключена=Ложь;
	КонецЕсли;
	Стандартнаяобработка=Ложь;
	ОО=Новый ОписаниеОповещения("ПослеЗакрытияПочты",ЭтаФорма);
	ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ПочтаНастройкаУФ",
	Новый Структура("email",Получатель),ЭтаФорма.ВладелецФормы,"ПочтаНастройкаУФ",ВариантОткрытияОкна.ОтдельноеОкно,,ОО,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПочты(Данные,Доп) Экспорт
	Если Не ПочтаПодключена Тогда
		Для Каждого Стр Из Элементы.Получатель.СписокВыбора Цикл
			Если Стр.Представление=Получатель Тогда
				ПодключитьПочту(Стр.Значение);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
Конецпроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	
	Если ПочтаПодключена Тогда
		Почта.Отключиться();
		ПочтаПодключена=Ложь;
	КонецЕсли;
	НоваяПочта=Истина;
	
	Для Каждого Стр Из Элементы.Получатель.СписокВыбора Цикл
		Если Стр.Представление=Получатель Тогда
			ПодключитьПочту(Стр.Значение);
			НоваяПочта=Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НоваяПочта Тогда
		ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ПочтаНастройкаУФ",
		Новый Структура("email",Получатель),ЭтаФорма.ВладелецФормы,"ПочтаНастройкаУФ",ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Конецесли;
	ПочтовыйЯщик="";
	Отправитель="";
КонецПроцедуры

&НаКлиенте
Процедура ОтправительОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Поз=Найти(Текст,"@");
	Если Поз<2 Тогда
		ДанныеВыбора=Новый СписокЗначений;
		ДанныеВыбора.Добавить(Новый Структура("Значение,ПометкаУдаления,Предупреждение",Получатель,Истина,"Адрес не содержит имя пользователя"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПочтовыйЯщикПриИзменении(Элемент)
	Отправитель="";
	Если ПочтаПодключена и Не ПустаяСтрока(ПочтовыйЯщик) Тогда
		Почта.ТекущийПочтовыйЯщик=ПочтовыйЯщик;
		ЗагрузитьОтправителей();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФайлШаблонНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Оповещение=Новый ОписаниеОповещения("ФайлЗагрузкиВыбор",ЭтаФорма);
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл, где хранится прайс-лист";
	Диалог.Фильтр = "Файлы Excel (*.xls,*.xlsx, *.csv)|*.xls;*.xlsx;*.csv|XLSX (*.xlsx)|*.xlsx|XLS (*.xls)|*.xls|CSV (*.csv)|*.csv"; 
	Диалог.ПолноеИмяФайла = ФайлШаблон;
    Диалог.МножественныйВыбор = Ложь;
	Диалог.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ФайлЗагрузкиВыбор(Файлы,Доп=Неопределено) Экспорт
	Если Файлы<>Неопределено и Файлы.Количество()>0 Тогда
		ФайлШаблон=СтрЗаменить(Файлы[0],"\","/");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФайлШаблонПриИзменении(Элемент)
	ФайлШаблон=СтрЗаменить(ФайлШаблон,"\","/");
	Тип=Нрег(Прав(ФайлШаблон,4));
	ZipАрхив=Тип=".zip";
	Если Тип=".csv" тогда НомерЛиста=1;КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВложениеПриИзменении(Элемент)
	Тип=Нрег(Прав(Вложение,4));
	ZipАрхив=Тип=".zip";
	ВидимостьКодировки=Тип=".csv";
	Элементы.Кодировка.Видимость=ВидимостьКодировки;
	Если Тип=".csv" тогда 
		НомерЛиста=1;
		Кодировка="win1251";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Если Источник="EMAIL" Тогда
		Если ПочтаПодключена Тогда
			Почта.Отключиться();
		КонецЕсли;		
		ВладелецФормы.ФормыПАУдалить("ПрайсНастройкаУФ");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКоманд

&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	Если Источник="EMAIL" Тогда
		Если не ПочтаПодключена Тогда
			Ошибки="Почта не подключена. Настройте почту получателя.";
		ИначеЕсли ПустаяСтрока(ПочтовыйЯщик) Тогда
			Ошибки="Не определен почтовый ящик для выемки почты";
		ИначеЕсли ПустаяСтрока(Отправитель) Тогда
			Ошибки="Не определен отправитель почты";
		ИначеЕсли ПустаяСтрока(Вложение) Тогда
			Ошибки="Не определен маска имени файла во вложении";
		Иначе
			Ошибки="";
		КонецЕсли;
		Если Ошибки<>"" Тогда
			ПоказатьПредупреждение(,Ошибки);
			Возврат;
		КонецЕсли;
		
		Если ПоискОграничен Тогда
			Запрос=Новый Структура("Прочитанные",Ложь);
		Иначе
			Запрос=Новый Структура("Отправитель,Прочитанные",Отправитель,Ложь);
			Если Не Пустаястрока(Тема) Тогда
				Запрос.Вставить("Тема",Тема);
			Конецесли;
		КонецЕсли;
		Попытка
			Состояние("Чтение почты. Ждите ...");
			Заголовки0=Почта.ПолучитьЗаголовки(Запрос);
			Колво=Заголовки0.Количество();
			ЕСли Колво=0 Тогда
				Состояние();
				ПоказатьПредупреждение(,"Не найдено ни одного не прочитанного письма указанного отправителя по указанной теме
				|Возможно данное письмо уже было прочитано, тогда отметьте его как непрочитанное");
				Возврат;
			КонецЕсли;
			Заголовки=Почта.Выбрать(Ложь,Заголовки0,Ложь);
		Исключение
			Ошибка=ОписаниеОшибки();
			Состояние();
			Сообщить("При чтении заголовков по протоколу IMAP произошла ошибка:"+символы.ПС+Ошибка);
			Возврат;
		Конецпопытки;
			
		Для Каждого Стр Из Заголовки Цикл
			Если ПоискОграничен Тогда
				Если Стр.Отправитель.Адрес<>Отправитель Тогда Продолжить;КонецЕсли;
				Если Не Пустаястрока(Тема) и Найти(Стр.Тема,Тема)=0 Тогда Продолжить;КонецЕсли;
			КонецЕсли;
			Для Каждого Вл из Стр.Вложения Цикл
				Если СравнитьПоМаске(Вл.ИмяФайла,Вложение) Тогда
					Сообщение=Стр;
					ТекВложение=Вл;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если Сообщение<>Неопределено Тогда
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		Если Сообщение=Неопределено Тогда
			Состояние();
			ПоказатьПредупреждение(,"Не найдено ни одного не прочитанного письма указанного отправителя по указанной теме с указанныи шаблоном вложения");
			Возврат;
		КонецЕсли;
			
		ИмяФайла=КаталогВременныхФайлов()+"\"+ТекВложение.ИмяФайла;
		УдалитьФайлы(ИмяФайла);
		ОО=Новый ОписаниеОповещения(?(zipАрхив,"РаспаковкаФайла","ЗагрузкаФайла"),ЭтаФорма,Новый Структура("ИмяФайла,Сообщение",ИмяФайла,Сообщение));
		ТекВложение.Данные.НачатьЗапись(ОО,ИмяФайла);
		Состояние();
	ИначеЕсли Источник="FILE" Тогда
		Если ПустаяСтрока(ФайлШаблон) Тогда
			ПоказатьПредупреждение(,"Не определено имя файла");
			Возврат;
		ИначеЕсли НомерЛиста=0 Тогда 			
			ПоказатьПредупреждение(,"Не определен номер листа");
		КонецЕсли;
		
		Если zipАрхив Тогда
			РаспаковкаФайла(Новый Структура("ИмяФайла",ФайлШаблон));
		Иначе
			ЗагрузкаФайла(Новый Структура("ИмяФайла",ФайлШаблон));
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	jset=Новый Структура("КолАртикул,КолКодТовара,КолКратность,КолМинПартия,КолНаименование,"
	+"КолНаличие,КолПроизводитель,КолСрокДоставки,КолЦена,НомерЛиста,НачальнаяСтрока,Производитель,"
	+?(Источник="EMAIL","Отправитель,Получатель,ПочтовыйЯщик,Тема,Вложение,Кодировка","ФайлШаблон"));
	ЗаполнитьЗначенияСвойств(jset,ЭтаФорма);
	jset.Вставить("ZipАрхив",?(ZipАрхив,1,0));
	//ЗаписьJSON=Новый ЗаписьJSON;
	//ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	//ЗаписатьJSON(ЗаписьJSON,jset);
	Запрос=Новый Структура("action,schema,idPrice,validity,period,settings",
	"update","pricelists",Сред(КодПрайса,3),validity,period,jset); //ЗаписьJSON.Закрыть());
	ВладелецФормы.СендерОтправить(Запрос);
	ЭтаФорма.Закрыть();
КонецПроцедуры

#Конецобласти

#Область ЭкспортныеПроцедуры
&НаКлиенте
Процедура ПолучениеАдресовПользователя(Данные) Экспорт
	Элементы.Получатель.СписокВыбора.Очистить();
	Для Каждого Стр из Данные Цикл
		Элементы.Получатель.СписокВыбора.Добавить(Стр,Стр.email);
		Если Получатель=Стр.email тогда
			ПодключитьПочту(Стр);
		КонецЕсли;
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПолучательСоздан(Данные,Доп=Неопределено) Экспорт
	Если Данные<>Неопределено Тогда
		Элементы.Получатель.СписокВыбора.Добавить(Данные,Данные.email);
		Получатель=Данные.email;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПолучателя(НоваяПочта,Данные) Экспорт
	Если НоваяПочта Тогда
		Стр=Элементы.Получатель.СписокВыбора.Добавить(Данные,Данные.email);
	Иначе	
		Для Каждого Стр Из Элементы.Получатель.СписокВыбора Цикл
			Если Стр.Представление=Получатель Тогда
				ЗаполнитьЗначенияСвойств(Стр.Значение,Данные);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ПодключитьПочту(Стр.Значение);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПолучателя() Экспорт
	Для Каждого Стр Из Элементы.Получатель.СписокВыбора Цикл
		Если Стр.Представление=Получатель Тогда
			Элементы.Получатель.СписокВыбора.Удалить(Стр);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Получатель="";
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПрайсЛистОчистить(ПрайсЛист)
	ПрайсЛист.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаФайла(Данные) Экспорт
	ИмяФайла=Данные.ИмяФайла;
	Состояние("Чтение данных из документа Excel ...");
	Попытка	   
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ИмяФайла);	
		ExcelЛист = Excel.Sheets(НомерЛиста);	   
		ExcelЛист.Activate();
	Исключение	   
		Сообщить("Ошибка при открытии файла Excel. "+ОписаниеОшибки()); 
		Возврат;
	КонецПопытки;
	
	Если ПрайсЛист.ВысотаТаблицы>0 Тогда
		ПрайсЛистОчистить(ПрайсЛист);
		ПрайсЛист.Область().Видимость=Истина;
		ПрайсЛист.ФиксацияСверху=0;
	КонецЕсли;
	
	Попытка
		//xlLastCell = 11;   	
		//ActiveCell = Excel.ActiveCell.SpecialCells(xlLastCell);
		UsedRange=Excel.ActiveSheet.UsedRange;
		Строк = Мин(UsedRange.Rows.Count,30);    // ограничим 30 строк
		Колонок=Мин(UsedRange.Columns.Count,50); // ограничим 50 колонок
		Для КолНом = 1 По Колонок Цикл
			ПрайсЛист.Область("C"+КолНом).ШиринаКолонки=ExcelЛист.Columns(КолНом).ColumnWidth;
		КонецЦикла;
		
		Область = ExcelЛист.Range(ExcelЛист.Cells(1,1), ExcelЛист.Cells(Строк,Колонок));
		Массив = Область.Value.Выгрузить();
		Для СтрН = 1 по Строк Цикл
			Для КолН = 1 по Колонок Цикл
				Ячейка="R"+СтрН+"C"+КолН;
				Значение=Массив[КолН-1][СтрН-1];
				Если Значение<>Неопределено И НЕ Пустаястрока(Значение) Тогда
					Если ТипЗнч(Значение)=Тип("Число") Тогда
						Значение=Формат(Значение,"ЧН=;ЧГ=");
					КонецЕсли;
					ПрайсЛист.Область(Ячейка+":"+Ячейка).Текст = Значение;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;	
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	//Excel.WorkBooks.Close();
	Excel.DisplayAlerts = 0;
    Excel.Quit();
    Excel.DisplayAlerts = 1;
	Excel = Неопределено;
	Состояние();
	
	// Если файл - вложение - удаляем его из Каталога временных файлов
	Если Данные.Свойство("Сообщение") Тогда
		УдалитьФайлы(ИмяФайла);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура РаспаковкаФайла(ИмяФайла) Экспорт
	ПоказатьПредупреждение(,"Извините, механизм работы с zip-файлами не реализован, обратитесь к разработчикам");
КонецПроцедуры

#КонецОбласти

#Область ФункциональныеПроцедуры
&НаКлиенте
Процедура ПодключитьПочту(Стр)
	Профиль=Новый ИнтернетПочтовыйПрофиль;
	Если Не Пустаястрока(Стр.imapServer) и Стр.imapPort<>0 Тогда 
		Профиль.АдресСервераIMAP = Стр.imapServer;
		Профиль.ПортIMAP = Стр.imapPort;
		Профиль.ПользовательIMAP = Стр.email;
		Профиль.ПарольIMAP = Стр.password;
		Профиль.ИспользоватьSSLIMAP = Стр.isSSL<>0;
		Протокол = ПротоколИнтернетПочты.IMAP;
		ПоискОграничен = Стр.imapServer="imap.mail.ru";
	Иначе
		Предупреждение("Не определены сервера для подключения почты");
		ПочтаПодключена=Ложь;
		Возврат;
	КонецЕсли;
	
	Почта = Новый ИнтернетПочта;
	Попытка
		Почта.Подключиться(Профиль,Протокол);
		ПочтаПодключена=Истина;
	Исключение
		Ошибка=ОписаниеОшибки();
		Протокол=Неопределено;
		ПочтаПодключена=Ложь;
		Сообщить("Ошибки при подключении почты:"+Символы.ПС+Ошибка);
	Конецпопытки;
	
	// Читаем почтовые ящики
	Элементы.ПочтовыйЯщик.СписокВыбора.ЗагрузитьЗначения(Почта.ПолучитьПочтовыеЯщики());
	Строка=Элементы.ПочтовыйЯщик.СписокВыбора.НайтиПоЗначению("INBOX");
	Если Строка<>Неопределено тогда Строка.Представление="Входящие";КонецЕсли;
	Если не ПустаяСтрока(ПочтовыйЯщик) Тогда
		Почта.ТекущийПочтовыйЯщик=ПочтовыйЯщик;
		ЗагрузитьОтправителей();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОтправителей()
	Заголовки=Почта.ПолучитьЗаголовки(Новый Структура("ПослеДатыОтправления",ДобавитьМесяц(ТекущаяДата(),-4)));
	Список=Элементы.Отправитель.СписокВыбора;
	Список.Очистить();
	Для каждого Стр из Заголовки Цикл
		ТекОтправитель=?(ТипЗнч(Стр.Отправитель)=Тип("Строка"),Стр.Отправитель,Стр.Отправитель.Адрес);
		Если Список.НайтиПоЗначению(ТекОтправитель)=Неопределено Тогда
			Список.Добавить(ТекОтправитель);
		КонецЕсли;
	КонецЦикла;
	Список.СортироватьПоЗначению();
КонецПроцедуры

&НаКлиенте
// Сравнивает текст с маской: ? - один символ, * - любое количество символов
Функция СравнитьПоМаске(Текст,Маска)
	Шаблон=СтрЗаменить(Маска,"?",Символы.ПС+"?"+Символы.ПС);
	Шаблон=СтрЗаменить(Шаблон,"*",Символы.ПС+"*"+Символы.ПС);
	Строка=Текст;
	Звезда=Ложь;
	Кол=СтрЧислоСтрок(Шаблон);
	Если ПустаяСтрока(СтрПолучитьСтроку(Шаблон,Кол)) Тогда Кол=Кол-1;КонецЕсли;
	Для Инд=1 по Кол Цикл
		Стр=СтрПолучитьСтроку(Шаблон,Инд);
		Если Стр="?" Тогда
			Строка=Сред(Строка,2);
		ИначеЕсли Стр="*" Тогда
			Звезда=Истина;
		Иначе
			Если Звезда Тогда
				Поз=Найти(Строка,Стр);
				Если Поз=0 Тогда 
					Возврат Ложь;
				Иначе 
					строка=Сред(Строка,Поз); 
				КонецЕсли;
			    Звезда=Ложь;
			КонецЕсли;
			Длина=СтрДлина(Стр);
			Если Лев(Строка,Длина)=Стр Тогда
				Строка=Сред(Строка,Длина+1);
			Иначе 
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Строка="" или Звезда;
КонецФункции


#КонецОбласти
