Процедура Сформировать() Экспорт
	табДок = Новый ТабличныйДокумент;
	НовОтчет=Отчеты.РеализацияЧерезРасширениеЗН.Создать();
	НовОтчет.СкомпоноватьРезультат(табДок);
	#Если Клиент Тогда
		Попытка
			табДок.Показать();
		Исключение
			//
		КонецПопытки;	
	#КонецЕсли	
	ВремКаталог = КаталогВременныхФайлов();
	ИмяФайла = Формат(ТекущаяДата(),"ДЛФ=DT");
	ИмяФайла = СтрЗаменить(ИмяФайла," ","");
	ИмяФайла = СтрЗаменить(ИмяФайла,".","");
	ИмяФайла = СтрЗаменить(ИмяФайла,":","");
	ИмяФайла = СокрЛП(КаталогВременныхФайлов()+ИмяФайла+".XLS");
	Попытка
		табДок.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.XLS);
		#Если Клиент Тогда
			Сообщить("Файл записан: <<"+ИмяФайла+">>"); 
		#КонецЕсли
	Исключение
		#Если Клиент Тогда
			Сообщить("ОШИБКА! Файл не записан: <<"+ИмяФайла+">>",СтатусСообщения.ОченьВажное);
		#КонецЕсли 
		Возврат;
	КонецПопытки;	
	НаписатьИОтправитьПисьмаЗамечанийПоСписку(ИмяФайла);
КонецПроцедуры

Процедура НаписатьИОтправитьПисьмаЗамечанийПоСписку(ИмяФайлаЗамечанийЭксел) Экспорт
	
	Сотр =ПараметрыСеанса.Пользователь.Сотрудник;
	
	АдресЭлПочты = НайтиЭлАдрес(Сотр);
	
	Сообщить("Адрес электронной почты : "+АдресЭлПочты+" для "+Сотр);
	
	ЭтоПервый  = Истина;
	мКому = Новый Массив;
	мКопии = Новый Массив;
	
	АдресЭлПочты = "vladimir.bondarenko.2004@inbox.ru";
	мКому.Добавить(АдресЭлПочты);
	АдресЭлПочты = "tetechnical_management@sokolmotors.ru";
	мКому.Добавить(АдресЭлПочты);
	
	//Для каждого Эл Из ПолучателиПисем Цикл
	//	АдресЭлПочты = Эл.АдресЭлПочты;
	//    Если обЗначениеНеЗаполнено(АдресЭлПочты) Тогда
	//		Продолжить;
	//	КонецЕсли;  
	//	Если ЭтоПервый Тогда
	//  		мКому.Добавить(АдресЭлПочты);
	//		ЭтоПервый=Ложь;
	// 	Иначе	
	// 		мКопии.Добавить(АдресЭлПочты);	 
	// 	КонецЕсли; 
	// КонецЦикла; 
	
	СсылкаДляПисьма = "";
	Суть = "Ознакомьтесь отчет по своему ДЦ. Письмо сформировано: "+ТекущаяДата();
	ТемаПисьма = Суть;
	
	СоздатьИОтправитьЭлПисьмо(мКому,мКопии,ТемаПисьма,Суть,СсылкаДляПисьма,ИмяФайлаЗамечанийЭксел);
	
КонецПроцедуры

Процедура СоздатьИОтправитьЭлПисьмо(мКому,МКопия, Тема, Тело,Основание,ИмяФайлаЭксель) Экспорт 
	ЭлПисьмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
	ЭлПисьмо.ОтправительПредставление = "Альфа авто <1c@sokolmotors.ru>" ;
	//Для Каждого стр из мКому цикл
	//	ЭлПисьмо.ПолучателиПредставление =  ЭлПисьмо.ПолучателиПредставление +?( ЭлПисьмо.ПолучателиПредставление="",стр,";"+стр); 
	//КонецЦикла;  
	Для Каждого стр из мКому цикл
		СтрокаПолуатели = ЭлПисьмо.Получатели.Добавить();
		СтрокаПолуатели.АдресЭлектроннойПочты=стр;
		СтрокаПолуатели.Представление=стр;
		СтрокаПолуатели.КодГруппыАдреса             =Перечисления.КодГруппыАдресаЭлектронногоПисьма.Кому ;
		ЭлПисьмо.ПолучателиПредставление =  ЭлПисьмо.ПолучателиПредставление +?( ЭлПисьмо.ПолучателиПредставление="",стр,";"+стр); 
	КонецЦикла;
	Для Каждого стр из МКопия цикл
		СтрокаПолуатели = ЭлПисьмо.Получатели.Добавить();
		СтрокаПолуатели.АдресЭлектроннойПочты=стр;
		СтрокаПолуатели.Представление=стр;
		СтрокаПолуатели.КодГруппыАдреса             =Перечисления.КодГруппыАдресаЭлектронногоПисьма.Копии ;
	КонецЦикла;
	
	ЭлПисьмо.Тема = Тема;
	ЭлПисьмо.ТекстПисьма= Тело;
	ЭлПисьмо.ДокументОснование = Основание;
	ЭлПисьмо.УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.Альфа;
	ЭлПисьмо.ГруппаПисем = Справочники.ГруппыПисемЭлектроннойПочты.НайтиПоНаименованию("Исходящие");
	ЭлПисьмо.Важность = Перечисления.Важность.Высокая;
	//ЭлПисьмо.ДатаОтправления =ТекущаяДата();
	ЭлПисьмо.Дата = ТекущаяДата()  ;
	ЭлПисьмо.ХозОперация = Справочники.ХозОперации.ЭлектронноеПисьмо;
	ЭлПисьмо.УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.Альфа;	
	ЭлПисьмо.Организация =   ПараметрыСеанса.Пользователь.Организация;
	ЭлПисьмо.ПодразделениеКомпании = ПараметрыСеанса.Пользователь.Подразделение;
	ЭлПисьмо.Автор   = ПараметрыСеанса.Пользователь;
	ЭлПисьмо.ФорматТекста = Перечисления.ФорматТекста.ПростойТекст; 
	
	ЭлПисьмо.ЕстьВложения=Истина;
	
	МассивВложений = Новый Массив;
	МассивВложений.Добавить(ИмяФайлаЭксель);
	
	ДобавитьВложенияВПисьмо(ЭлПисьмо.ПрикрепленныеФайлы, МассивВложений);
	
	Попытка
		ЭлПисьмо.Записать();
	Исключение
		#Если Клиент Тогда
		Форма = ЭлПисьмо.ПолучитьФорму("ФормаДокумента");
		Если Не Форма.Открыта() Тогда
			Форма.ОткрытьМодально();
 		КонецЕсли; 	
		#КонецЕсли 
	КонецПопытки;	
	СтруктураРежимовОбмена = Новый Структура("Получить, Отправить", Ложь, Истина);
	СоединениеСПочтовымСервером = эпПодключитьсяКПочтовомуСерверу(ЭлПисьмо.УчетнаяЗапись, СтруктураРежимовОбмена);
	Если СоединениеСПочтовымСервером <> Неопределено Тогда
		Если эпОтправитьПисьмо(ЭлПисьмо.ЭтотОбъект, СоединениеСПочтовымСервером) Тогда
			эпОтключитьсяОтПочтовогоСервера(СоединениеСПочтовымСервером);
			//Закрыть();
		Иначе
			эпОтключитьсяОтПочтовогоСервера(СоединениеСПочтовымСервером);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры	

Процедура ДобавитьВложенияВПисьмо(ПрикрепленныеФайлы, МассивВложений)
	
	Для Каждого ПолученноеИмяФайла Из МассивВложений Цикл
		
		ИмяФайла = ПолученноеИмяФайла;
		
		Файл = Новый Файл(ИмяФайла);
		
		Пока Найти(ИмяФайла,"\")>0 Цикл
			ИмяФайла = Прав(ИмяФайла,СтрДлина(ИмяФайла) - Найти(ИмяФайла,"\"));
		КонецЦикла;	
		
		//Если Файл.Размер() > 26214400 Тогда
		//	
		//	Ответ = Вопрос("Размер добавляемого файла """ + ИмяФайла + """
		//	|больше 25 Mb. Добавить ?", РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Нет,"Внимание!");
		//	Если Ответ = КодВозвратаДиалога.Нет Тогда
		//		Продолжить;
		//	ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
		//		Возврат;
		//	КонецЕсли; 
		//КонецЕсли;
		
		НоваяСтрока = ПрикрепленныеФайлы.Добавить();
		НоваяСтрока.Имя = ОбрезатьИмяФайла(ИмяФайла, 100, Истина);
		
		//#Если Клиент Тогда 
		Состояние("Добавляется файл: " + НоваяСтрока.Имя);
		//#КонецЕсли
		ДвоичныйФайл = Новый ДвоичныеДанные(Файл.ПолноеИмя);
		НоваяСтрока.Файл = ПолучитьХранилищеЗначений(ДвоичныйФайл);
		//НоваяСтрока.Файл = Новый ХранилищеЗначения(Новый ДвоичныеДанные(Файл.ПолноеИмя), Новый СжатиеДанных());
		НоваяСтрока.Размер = Файл.Размер();
		
		//Попытка
		//	УдалитьФайлы(ПолученноеИмяФайла);
		//Исключение
		//	Сообщить("Не удалось удалить файл: " +	ПолученноеИмяФайла);
		//КонецПопытки
		
	КонецЦикла;
	
КонецПроцедуры // ДобавитьВложенияВПисьмо()


Функция НайтиЭлАдрес(ВыбСотрудник) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	КИ.Объект КАК Объект,
	|	КИ.Вид КАК Вид,
	|	КИ.Представление КАК Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КИ
	|ГДЕ
	|	КИ.Объект = &ВыбСотрудник
	|	И КИ.Вид = &ВыбВид";
	
	Запрос.УстановитьПараметр("ВыбСотрудник", ВыбСотрудник);
	Запрос.УстановитьПараметр("ВыбВид", Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Представление;
	КонецЦикла;
	
	Возврат ""; 
	
КонецФункции	

// Функция корректно обрезает имя файла если оно  больше 100 символов, 
// чтобы осталось расширение. (рфОбрезатьИмяФайла("ОченьДлинноеИмяФайла.txt",20) -> ОченьДлинноеИмяФ.txt)
//
// Параметры
//  ИмяФайла 		   – Строка, содержащая имя файла, неважно с именем каталога или без.
//  КоличествоСимволов – Число, кол-во символов, до которого необходимо урезать имя файла.
//  ВыводитьСообщение  – Булево, признак необходимости вывести сообщение что имя файла обрезано.
//
// Возвращаемое значение:
//  Строка   – обрезанное имя файла.
//
Функция ОбрезатьИмяФайла(Знач ИмяФайла, КоличествоСимволов, ВыводитьСообщение=Ложь) Экспорт
	
	Если СтрДлина(ИмяФайла) > КоличествоСимволов Тогда
		Если ВыводитьСообщение Тогда
			Сообщить("Имя файла """+ИмяФайла+""" обрезано, так как его длина больше "+КоличествоСимволов+" символов", СтатусСообщения.Информация);
		КонецЕсли; 
		РасширениеФайла = рфПолучитьРасширениеФайла(ИмяФайла);
		СамоИмяФайла = Лев(ИмяФайла, СтрДлина(ИмяФайла)-СтрДлина(РасширениеФайла)-1);
		СамоИмяФайла = Лев(СамоИмяФайла, КоличествоСимволов-СтрДлина(РасширениеФайла)-1);
		ИмяФайла = СамоИмяФайла + "." + РасширениеФайла;
	КонецЕсли;
	
	Возврат ИмяФайла;
	
КонецФункции // ОбрезатьИмяФайла()

Функция ПолучитьХранилищеЗначений(Файл)
	
	Возврат Новый ХранилищеЗначения(Файл, Новый СжатиеДанных());
	
КонецФункции