
&НаКлиенте
Процедура Готово(Команда)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ПрошлыйГод", ПрошлыйГод);
	СтруктураВозврата.Вставить("НомерДокумента", Номер);
	
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗаголовокПоля") Тогда
		Элементы.Номер.Заголовок = Параметры.ЗаголовокПоля;
	КонецЕсли;
	
	Если Параметры.Свойство("Номер") Тогда
		ЭтаФорма.Номер = Параметры.Номер;
	КонецЕсли;                           
	
КонецПроцедуры
