
Процедура ЗаписатьЗапросА2А (Ключ, ТелоЗапроса) Экспорт
	
	Менеджер = РегистрыСведений.Renault_ЗапросыAp2Ap.СоздатьМенеджерЗаписи();
	Менеджер.Ключ = Ключ;
	Менеджер.ТекстЗапроса = Новый ХранилищеЗначения(ТелоЗапроса, Новый СжатиеДанных(9));
	Менеджер.Записать();
	
КонецПроцедуры

Функция ПроверитьНаличиеОтвета (Ключ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗапросыAp2Ap.ТекстОтвета
	|ИЗ
	|	РегистрСведений.Renault_ЗапросыAp2Ap КАК ЗапросыAp2Ap
	|ГДЕ
	|	ЗапросыAp2Ap.Ключ = &Ключ
	|	И ЗапросыAp2Ap.Обработан";
	Запрос.УстановитьПараметр("Ключ", Ключ);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ТекстОтвета.Получить();
	
КонецФункции

Функция ПроверитьНаличиеЗароса () Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗапросыAp2Ap.Ключ,
	|	ЗапросыAp2Ap.ТекстЗапроса
	|ИЗ
	|	РегистрСведений.Renault_ЗапросыAp2Ap КАК ЗапросыAp2Ap
	|ГДЕ
	|	НЕ ЗапросыAp2Ap.Обработан";
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Выгрузить();
	
КонецФункции

Процедура ЗаписатьОтветА2А ( СтрокаТЗ) Экспорт
	
	Менеджер = РегистрыСведений.Renault_ЗапросыAp2Ap.СоздатьМенеджерЗаписи();
	Менеджер.Ключ = СтрокаТЗ.Ключ;
	Менеджер.ТекстОтвета = СтрокаТЗ.ТекстОтвета;
	Менеджер.ТекстЗапроса = СтрокаТЗ.ТекстЗапроса;
	Менеджер.Обработан = Истина;
	Менеджер.Записать();
	
КонецПроцедуры