
//Перем ПоследовательностиОтчета Экспорт;                // последовательности отчета


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

Функция ПолучитьСвойства() Экспорт
	
	СтруктураСвойств = Новый Структура;
	СтруктураСвойств.Вставить("СкладКомпании");
	СтруктураСвойств.Вставить("Номенклатура");
	СтруктураСвойств.Вставить("Организация");
	СтруктураСвойств.Вставить("ХарактеристикаНоменклатуры");
	СтруктураСвойств.Вставить("Подразделение");
	СтруктураСвойств.Вставить("Партия");
	СтруктураСвойств.Вставить("ПериодРегистратор");
	
	Возврат СтруктураСвойств;
	
КонецФункции

// Стандартная процедура настройки схемы компоновщика данных
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ОтчетыСервер.ЗаполнитьНачальныеОстатки(ЭтотОбъект);
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) Экспорт
	
	ОтчетыСервер.ВывестиОтчет(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

//ПоследовательностиОтчета = Новый Структура();
//ПоследовательностиОтчета.Вставить("ГраницыПартий");

