
////#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗаказНаряд") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, 
			"ЗаказНаряд,СемействоАвтомобиля,ГотовностьКОтправке,ЛКМ,OTS,ПовторнаяОтправка,Отправлен,ПробегАвтомобиля,ДатаОткрытия,РангАвторабот,ДатаЗакрытия,Автомобиль");
	КонецЕсли;
	
	СтавкаБезНДС = Справочники.СтавкиНДС.БезНДС;
	
	ЗаполнитьСчетаПоОтбору();
	ЗаполнитьИнцидентыПоОтбору();
	ЗаполнитьСоответствияПоОтбору();
	ЗаполнитьТоварыПоОтбору();
	ЗаполнитьРаботыПоОтбору();
	ЗаполнитьФотографииПоОтбору();
	
	ОписаниеТипаКатегорий = Справочники.EDR_КатегорииСчетов.ПолучитьОписаниеТипов();
	ОписаниеТипаРасходов  = Справочники.EDR_ВидыРасходов.ПолучитьОписаниеТипов();
	
	мТаблицаСоответствийКатегорий = ТаблицаСоответствийКатегорий.Выгрузить();
	
	//Заполняем таблицу соответствий категорий статьям расходов
	Справочники.EDR_КатегорииСчетов.ЗаполнитьТаблицуПоказателей(мТаблицаСоответствийКатегорий);
	
	ТаблицаСоответствийКатегорий.Загрузить(мТаблицаСоответствийКатегорий);
	
	ПаттернЛитераловНомеров = "ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	
	Элементы.РезультатДиагностик.МаксимальноеЗначение = 100;
	Элементы.ОписаниеОперации.МаксимальноеЗначение 	  = 80;
	Элементы.КомментарийОперации.МаксимальноеЗначение = 350;
	
	НастроитьКолонкуНомерСогласованияИнцидентов();
	
	ЗаполнитьСлужебныеРеквизитыТаблицыИнциденты();
	
	ЗаполнитьСлужебныеРеквизитыТаблицыТовары();
	
	ЗаполнитьСлужебныеРеквизитыТаблицыРаботы();
	
	ОбновитьСпискиВыбораИнцидентов();
	
	Если Отправлен Или ПовторнаяОтправка Тогда
		
		Для каждого ТекущаяСтрока Из ТаблицаСчетов Цикл
			ТекущаяСтрока.Отправлен = Истина;
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	УстановитьДоступность();
	
	УстановитьВидимость();
	
	ОбновитьСпискиВыбораСчетов();
	
	// Перенесено в УстановитьДоступность()
	//Если Отправлен и НЕ ПовторнаяОтправка Тогда
	//	
	//	Элементы.ТаблицаТоваровЗаполнитьЦеныПоАктуальномуТарифу.Доступность = Ложь;
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		Если ВыбранноеЗначение.Свойство("Счет") Тогда
			
			Попытка
				
				//Заменяемый Идентификатор
				мИдентификаторСчета = ВыбранноеЗначение.ИдентификаторСчета;
				
				//Нужно пройтись по таблице соответствий и поменять старый идентификатор на новый.
				
				СтруктураПоиска = Новый Структура("ИдентификаторСчета", ВыбранноеЗначение.Счет);
				
				мВыбранныйСчет = ТаблицаСчетов.НайтиСтроки(СтруктураПоиска);
				
				ВыбранныйСчет = мВыбранныйСчет[0].Счет;
				
				СтруктураИспользованияСчета = ПроверитьИспользованиеСчета(мИдентификаторСчета);
				
				//Массив идентификаторов
				МассивИдентификаторов = СтруктураИспользованияСчета["Соответствия"];
				
				Для каждого Идентификатор из МассивИдентификаторов Цикл
					
					мСтрокаТаб = ТаблицаСоответствий.НайтиСтроки(Новый Структура("Идентификатор", Идентификатор));
					СтрокаТаб = мСтрокаТаб[0];
					СтрокаТаб.Счет = ВыбранныйСчет;
					СтрокаТаб.ИдентификаторСчета = ВыбранныйСчет;
					
				КонецЦикла;
				
				СтрокиУдаления = ТаблицаСчетов.НайтиСтроки(Новый Структура("ИдентификаторСчета", мИдентификаторСчета));
				
				Для каждого СтрокаУдаления Из СтрокиУдаления Цикл
					СтрокаУдаления.Удален = Истина;
				КонецЦикла; 
				Модифицированность = Истина;
			Исключение
				
				Предупреждение(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				Возврат;
				
			КонецПопытки;
			
		ИначеЕсли ВыбранноеЗначение.Свойство("Инцидент") Тогда 
			
			Попытка
				
				//ЗаменяемыйИдентификатор
				ИдентификаторИнцидента = ВыбранноеЗначение.ИдентификаторИнцидента;
				
				//Нужно пройтись по всем таблицам и поменять старый идентификатор на новый.
				мВыбранныйИнцидент = ТаблицаИнцидентов.НайтиСтроки(Новый Структура("ИдентификаторИнцидента", ВыбранноеЗначение.Инцидент));
				
				ВыбранныйИнцидент = мВыбранныйИнцидент[0].Инцидент;
				
				СтруктураИспользованияИнцидента = ПроверитьИспользованиеИнцидента(ИдентификаторИнцидента);
				
				//Массив товаров
				МассивТоваров = СтруктураИспользованияИнцидента["Товары"];
				
				Для каждого ИдентификаторТовара из МассивТоваров Цикл
					
					СтрокиТаб = ТаблицаТоваров.НайтиСтроки(Новый Структура("ИдентификаторТовара", ИдентификаторТовара));
					СтрокаТаб = СтрокиТаб[0];
					
					СтрокаТаб.Инцидент = ВыбранныйИнцидент;
					СтрокаТаб.ИдентификаторИнцидента = ВыбранноеЗначение.Инцидент;
					
					//Для переназначенных инцидентов сбрасываем все флаги
					СтрокаТаб.ПричинаОбращения = Ложь;
					
				КонецЦикла;
				
				//Массив работ
				МассивРабот = СтруктураИспользованияИнцидента["Работы"];
				
				Для каждого ИдентификаторРаботы из МассивРабот Цикл
					
					СтрокиТаб = ТаблицаРаботы.НайтиСтроки(Новый Структура("ИдентификаторРаботы", ИдентификаторРаботы));
					СтрокаТаб = СтрокиТаб[0];
					
					СтрокаТаб.Инцидент = ВыбранныйИнцидент;
					СтрокаТаб.ИдентификаторИнцидента = ВыбранноеЗначение.Инцидент;
					
				КонецЦикла;
				
				//Таблица Соответствий
				МассивИнцидентов = СтруктураИспользованияИнцидента["Соответствия"];
				
				Для каждого Идентификатор из МассивИнцидентов Цикл
					
					СтрокиТаб = ТаблицаСоответствий.НайтиСтроки(Новый Структура("Идентификатор", Идентификатор));
					СтрокаТаб = СтрокиТаб[0];
					
					СтрокаТаб.Инцидент = ВыбранныйИнцидент;
					СтрокаТаб.ИдентификаторИнцидента = ВыбранноеЗначение.Инцидент;
					
				КонецЦикла;
				
				СтрокиУдаления = ТаблицаИнцидентов.НайтиСтроки(Новый Структура("ИдентификаторИнцидента", ИдентификаторИнцидента));
				
				Для каждого СтрокаУдаления Из СтрокиУдаления Цикл
					СтрокаУдаления.Удален = Истина;
				КонецЦикла;
				Модифицированность = Истина;
				
			Исключение
				
				Предупреждение(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		
		//Отказ = Истина;
		Режим = РежимДиалогаВопрос.ДаНет;
		
		ТекстВопроса = "Существуют измененные записи. Закрытие формы приведет к утере изменений. " + Символы.ПС + "Сохранить записи автоматически?";
		
		//Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтаФорма, Параметры);
		//ПоказатьВопрос(Оповещение, "Существуют измененные записи. Закрытие формы приведет к утере изменений. " + Символы.ПС + "Сохранить записи автоматически?", Режим, 0);
		
		Результат = Вопрос(ТекстВопроса,Режим,0);
		
		ПередЗакрытиемЗавершение(Результат, Параметры, Отказ, СтандартнаяОбработка);
		
		Если Не Отказ Тогда
			
			Оповестить("ОбновитьСписок", ПараметрыСеанса.Пользователь);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

////#КонецОбласти

////#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИзменения(Команда, Отказ = Ложь, Закрытие = Ложь)
	
	//Отказ = Ложь;
	//
	//ПроверитьЗаполнениеОтзывнойНоты(Отказ);
	//
	//Если Отказ Тогда
	//	Возврат;
	//КонецЕсли;
	
	Отказ = Ложь;
	
	ПроверитьЗаполнениеНоменклатуры(Отказ);
	ПроверитьЗаполнениеАвтоработы(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		УдалитьНедопустимыеСимволыВКомментарих();
	КонецЕсли;
	
	ЗаполнитьВТабличныхЧастяхЗаказНаряд();
	
	//ИнициализироватьОбмен();
	
	ТаблицаОшибок.Очистить();
	ТаблицаОшибокРаботыТовары.Очистить();
	
	Если Не Модифицированность Тогда
		Закрыть();
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = "";
	
	Если ЛКМ Тогда
		
		Успешно = РассчетЛКМ(ТекстОшибки);
		
		Если Не Успешно Тогда
			Отказ = Истина;
			Предупреждение(ТекстОшибки, 20);
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Отказ = Ложь;
	
	Успешно = ПроверитьНаКорректность(,Отказ);
	
	Если Не Успешно Тогда
		
		Отказ = Истина;
		
		Если ТаблицаОшибок.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		#Если ТолстыйКлиентУправляемоеПриложение ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
			
			ВывестиОшибкиСКД();
			
			ПараметрыФормы = Новый Структура("ТабличныйДокумент",ТабличныйДокумент);
			ОткрытьФорму("Обработка.EDR_АРМПоГарантииNew.Форма.ФормаОтчет",ПараметрыФормы,ЭтаФорма);
			
		#Иначе
			
			ТекстОшибки = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='По заказ-наряду:"
"""%1"""
"Запись изменений прервана по причине:';en='According to the order, as well as:"
"""%1"""
"Record changes canceled due to:'"),
				"№ "+СокрЛП(ЗаказНаряд.Номер) + " от " + Формат(ЗаказНаряд.Дата,"ДФ=dd.MM.yyyy; ДП=-"));
			
			Для каждого ТекущаяСтрокаОшибки Из ТаблицаОшибок Цикл
				ТекстОшибки = ТекстОшибки + Символы.ПС + СокрЛП(ТекущаяСтрокаОшибки.ОписаниеОшибки) + ";";
			КонецЦикла;
			
			ТекстОшибки = Лев(ТекстОшибки, СтрДлина(ТекстОшибки) - 1);
			Сообщить(ТекстОшибки, 20);
			
		#КонецЕсли
		
		Возврат;
		
	КонецЕсли;
	
	Успешно = ЗаписатьИнформациюВРегистры();
	
	Если Не Успешно Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Попытка
		ЗаписатьУдалитьИзображенияЗаказНаряда();
	Исключение
		Предупреждение(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	Модифицированность = Ложь;
	
	ИнициализироватьОбмен();
	
	Если Не Закрытие Тогда
		ОповеститьОВыборе("ОбновитьСписок");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	//Отказ = Ложь;
	//
	//ПроверитьЗаполнениеОтзывнойНоты(Отказ);
	//
	//Если Отказ Тогда
	//	Возврат;
	//КонецЕсли; 
	
	Отказ = Ложь;
	
	ПроверитьЗаполнениеНоменклатуры(Отказ);
	ПроверитьЗаполнениеАвтоработы(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		УдалитьНедопустимыеСимволыВКомментарих();
	КонецЕсли;
	
	ЗаполнитьВТабличныхЧастяхЗаказНаряд();
	
	ИнициализироватьОбмен();
	
	ЭтоОшибкиРаботыТовары = Ложь;
	
	ТаблицаОшибок.Очистить();
	ТаблицаОшибокРаботыТовары.Очистить();
	
	Если Не Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = "";
	
	Если ЛКМ Тогда
		
		Успешно = РассчетЛКМ(ТекстОшибки);
		
		Если Не Успешно Тогда
			
			Предупреждение(ТекстОшибки, 20);
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Отказ = Ложь;
	
	Успешно = ПроверитьНаКорректность(ЭтоОшибкиРаботыТовары, Отказ);
	
	Если Не Успешно Тогда 
		
		Если ЭтоОшибкиРаботыТовары Тогда
			
			Предупреждение("Есть несоответствия по работам и/или номенклатуре!");
			ВывестиОшибкиСКД();
			
			Если ТаблицаОшибок.Количество() <> 0 Тогда
				
				ПараметрыФормы = Новый Структура("ТабличныйДокумент", ТабличныйДокумент);
				ОткрытьФорму("Обработка.EDR_АРМПоГарантииNew.Форма.ФормаОтчет", ПараметрыФормы, ЭтаФорма);
				
			КонецЕсли;
			
			Если Отказ Тогда
				Возврат;
			КонецЕсли;
			
		Иначе
			
			ВывестиОшибкиСКД();
			
			Если ТаблицаОшибок.Количество() <> 0 Тогда
				
				ПараметрыФормы = Новый Структура("ТабличныйДокумент", ТабличныйДокумент);
				ОткрытьФорму("Обработка.EDR_АРМПоГарантииNew.Форма.ФормаОтчет", ПараметрыФормы, ЭтаФорма);
				
			КонецЕсли;
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Если Не Успешно Тогда
	//		
	//	Если ТаблицаОшибок.Количество() = 0 Тогда
	//		Возврат;	
	//	КонецЕсли; 
	//	
	//	//#Если Сервер ИЛИ ТолстыйКлиентУправляемоеПриложение ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	//		
	//		ВывестиОшибкиСКД();
	//		
	//		ПараметрыФормы = Новый Структура("ТабличныйДокумент",ТабличныйДокумент);
	//		ОткрытьФорму("Обработка.EDR_АРМПоГарантииNew.Форма.ФормаОтчет",ПараметрыФормы,ЭтаФорма);
	//		
	//	//#Иначе
	//	//				
	//	//	ТекстОшибки = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	//	//		НСтр("ru = 'По заказ-наряду:
	//	//		|""%1""
	//	//		|Запись изменений прервана по причине:'"),
	//	//		"№ "+СокрЛП(ЗаказНаряд.Номер) + " от " + Формат(ЗаказНаряд.Дата,"ДФ=dd.MM.yyyy; ДП=-"));
	//	//	
	//	//	Для каждого ТекущаяСтрокаОшибки Из ТаблицаОшибок Цикл
	//	//		ТекстОшибки = ТекстОшибки+Символы.ПС+СокрЛП(ТекущаяСтрокаОшибки.ОписаниеОшибки)+";";		
	//	//	КонецЦикла;
	//	//	
	//	//	ТекстОшибки = Лев(ТекстОшибки,СтрДлина(ТекстОшибки-1);
	//	//	Предупреждение(ТекстОшибки,20);
	//	//	
	//	//#КонецЕсли
	//	
	//	Возврат;
	//	
	//КонецЕсли; 
	
	Успешно = ЗаписатьИнформациюВРегистры();
	
	Если Не Успешно Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ЗаписатьУдалитьИзображенияЗаказНаряда();
	Исключение
		Предупреждение(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	Модифицированность = Ложь;
	
	ПриСозданииНаСервере(Ложь, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображение(Команда)
	
	Фильтр = ФильтрФайловИзображений();
	
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ВыборФайла.МножественныйВыбор = Ложь;
	ВыборФайла.Заголовок = НСтр("ru='Выбор файла';en='file selection'");
	ВыборФайла.Фильтр = ?(ЗначениеЗаполнено(Фильтр), Фильтр, НСтр("ru='Все файлы';en='All files'") + " (*.*)|*.*");
	
	Если ВыборФайла.Выбрать() Тогда
		
		ПрисоединенныйФайл = ВыборФайла.ВыбранныеФайлы[0];
		
		ПоказатьОповещениеПользователя(
			НСтр("ru='Создание:';en='Creature:'"),,
			//ПолучитьНавигационнуюСсылку(ПрисоединенныйФайл),
			ПрисоединенныйФайл,
			БиблиотекаКартинок.Информация32);
		
		Файл = Новый Файл(ПрисоединенныйФайл);
		
		Если Файл.Существует() Тогда
			
			ДвоичныеДанныеИзображения = Новый ДвоичныеДанные(ПрисоединенныйФайл);
			
			ИзображениеGUID = СокрЛП(Новый УникальныйИдентификатор);
			
			Успешно = ЗаписатьФайлНаСервере(ЗаказНаряд, ПрисоединенныйФайл, Файл.Имя, ИзображениеGUID, ДвоичныеДанныеИзображения);
			
			Если Успешно Тогда
				
				НоваяСтрока = ТаблицаФотографий.Добавить();
				
				НоваяСтрока.ЗаказНаряд  	   = ЗаказНаряд;
				НоваяСтрока.UID 	    	   = ИзображениеGUID;
				НоваяСтрока.ИмяФайла    	   = Файл.Имя;
				НоваяСтрока.НоваяСтрока 	   = Истина;
				НоваяСтрока.ПолноеНаименование = Файл.ПолноеИмя;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьDiversCode(Команда)
	
	Отбор = Новый Структура("Тип", ПредопределенноеЗначение("Перечисление.EDR_ТипDiversCode.P"));
	
	ПараметрыФормы = Новый Структура("Отбор,ИсключитьIP", Отбор, Истина);
	
	ОткрытьФорму("Обработка.EDR_АРМПоГарантииNew.Форма.ФормаВыборDiversCode", ПараметрыФормы, Элементы.ТаблицаТоваров);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПричиннойДетали(Команда)
	
	ФормаПодбора = ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаСписка",,Элементы.ТаблицаТоваров);
	ФормаПодбора.РежимВыбора 		= Истина;
	
	ФормаПодбора.ЗакрыватьПриВыборе = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьСписокДеталей(Команда)
	
	Режим = Новый СписокЗначений;
	
	Режим.Добавить("Восстановить", "Да, восстановить");
	Режим.Добавить("НеВосстановить", "Нет,не восстановить");
	
	//Оповещение = Новый ОписаниеОповещения("ВосстановитьСписокДеталейЗавершение", ЭтаФорма, Параметры);
	
	ТекстВопроса = "Работы по текущему заказ-наряду будут восстановлены до первоначального состояния!" + Символы.ПС + "Все внесенные изменения будут утераны." + Символы.ПС + "Продолжить?";
	
	//ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
	
	Результат = Вопрос(ТекстВопроса,Режим,0);
	
	ВосстановитьСписокДеталейЗавершение(Результат, Параметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьРаботы(Команда)
	
	Режим = Новый СписокЗначений;
	
	Режим.Добавить("Восстановить", "Да, восстановить");
	Режим.Добавить("НеВосстановить", "Нет,не восстановить");
	
	ТекстВопроса = "Материалы по текущему заказ-наряду будут восстановлены до первоначального состояния!" + Символы.ПС + "Все внесенные изменения будут утераны." + Символы.ПС + "Продолжить?";
	
	//Оповещение = Новый ОписаниеОповещения("ВосстановитьРаботыЗавершение", ЭтаФорма, Параметры);
	
	//ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
	
	Результат = Вопрос(ТекстВопроса,Режим,0);
	
	ВосстановитьРаботыЗавершение(Результат, Параметры);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИнцидентыICM(Команда)
	
	Renault_Открытый.Меню_ICM(Автомобиль, ПробегАвтомобиля);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьDiversCodeРаботы(Команда)
	
	Отбор = Новый Структура("Тип", ПредопределенноеЗначение("Перечисление.EDR_ТипDiversCode.M"));
	
	ПараметрыФормы = Новый Структура("Отбор,ИсключитьIP", Отбор, Истина);
	
	ОткрытьФорму("Обработка.EDR_АРМПоГарантииNew.Форма.ФормаВыборDiversCode", ПараметрыФормы, Элементы.ТаблицаРаботы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЭлектрическиеРаботы(Команда)
	
	НоваяСтрока = ТаблицаРаботы.Добавить();
	НоваяСтрока.НеСтандартнаяОперация = Истина;
	НоваяСтрока.ЗаказНаряд			  = ЗаказНаряд;
	НоваяСтрока.Артикул				  = "1777";
	НоваяСтрока.ИдентификаторРаботы	  = Строка(Новый УникальныйИдентификатор());
	
	СтруктураПараметров = Новый Структура("СтрокаПоУмолчанию, СтрокаРабот", "1777 - электрические работы", НоваяСтрока);
	
	Подсказка = "Введите наименование выполненных работ";
	//Оповещение = Новый ОписаниеОповещения("ПослеВводаСтроки",ЭтаФорма ,СтруктураПараметров);
	//ПоказатьВводСтроки(Оповещение, "", Подсказка, 0, Истина);
	Текст = "";
	Результат = ВвестиСтроку(Текст, Подсказка, 0, Истина);
	
	ПослеВводаСтроки(Текст, СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМеханическиеРаботы(Команда)
	
	НоваяСтрока = ТаблицаРаботы.Добавить();
	НоваяСтрока.НеСтандартнаяОперация = Истина;
	НоваяСтрока.ЗаказНаряд			  = ЗаказНаряд;
	НоваяСтрока.Артикул				  = "1888";
	НоваяСтрока.ИдентификаторРаботы	  = Строка(Новый УникальныйИдентификатор());
	
	СтруктураПараметров = Новый Структура("СтрокаПоУмолчанию,СтрокаРабот", "1888 - механические работы", НоваяСтрока);
	
	Подсказка = "Введите наименование выполненных работ";
	//Оповещение = Новый ОписаниеОповещения("ПослеВводаСтроки",ЭтаФорма ,СтруктураПараметров);
	//ПоказатьВводСтроки(Оповещение, "", Подсказка, 0, Истина);
	Текст = "";
	Результат = ВвестиСтроку(Текст, Подсказка, 0, Истина);
	ПослеВводаСтроки(Текст, СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОкраску(Команда)
	
	НоваяСтрока = ТаблицаРаботы.Добавить();
	НоваяСтрока.НеСтандартнаяОперация = Истина;
	НоваяСтрока.ЗаказНаряд			  = ЗаказНаряд;
	НоваяСтрока.Артикул				  = "9499";
	НоваяСтрока.ИдентификаторРаботы	  = Строка(Новый УникальныйИдентификатор());
	
	НоваяСтрока.РаботаПоЛКМ = Истина;
	
	СтруктураПараметров = Новый Структура("СтрокаПоУмолчанию, СтрокаРабот", "9499 - окраска", НоваяСтрока);
	
	Подсказка = "Введите наименование выполненных работ";
	//Оповещение = Новый ОписаниеОповещения("ПослеВводаСтроки",ЭтаФорма ,СтруктураПараметров);
	//ПоказатьВводСтроки(Оповещение, "", Подсказка, 0, Истина);
	Текст = "";
	Результат = ВвестиСтроку(Текст, Подсказка, 0, Истина);
	
	ПослеВводаСтроки(Текст, СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаICM(Команда)
	
	ФормаОТО = ПолучитьОбщуюФорму("Renault_НапоминаниеПроверкиОТО");
	ФормаОТО.Пробег = ПробегАвтомобиля;
	ФормаОТО.VIN = Автомобиль.VIN;
	ФормаОТО.Автомобиль = Автомобиль;
	ФормаОТО.Открыть();

КонецПроцедуры

////#КонецОбласти

////#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура OTSПриИзменении(Элемент)
	
	УстановитьВидимость();
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПовторнаяОтправкаПриИзменении(Элемент)
	
	// Ковалев ЕС ++
	// При установке галочки включаем видимость
	НастроитьКолонкуНомерСогласованияИнцидентов();
	// Ковалев ЕС -- //---
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура СемействоАвтомобиляПриИзменении(Элемент)
	
	СемействоАвтомобиляПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗаблокироватьДанныеФормыДляРедактирования();
	ДобавитьИзображениеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправленПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура АвтомобильНажатие(Элемент, СтандартнаяОбработка)
	
	Renault_Открытый.Меню_ICM(Автомобиль, ПробегАвтомобиля);
	
КонецПроцедуры

////#КонецОбласти

////#Область ОбработчикиСобытийТаблицыФормыТаблицаФотографий

&НаКлиенте
Процедура ТаблицаФотографийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекущаяСтрока = Элементы.ТаблицаФотографий.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока.НоваяСтрока = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФотографийПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = Элементы.ТаблицаФотографий.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока.Удалить 	  = Не ТекущаяСтрока.Удалить;
	ТекущаяСтрока.НоваяСтрока = Ложь;
	
	Отказ = Истина;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФотографийПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаФотографий.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	СтруктураПоиска = Новый Структура("ЗаказНаряд, UID, ИмяФайла");
	ЗаполнитьЗначенияСвойств(СтруктураПоиска,ТекущаяСтрока);
	
	ХранилищеКартинки = ПолучитьДвоичныеДанныеИзображения(СтруктураПоиска);
	
	Если ХранилищеКартинки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.ПолноеНаименование) Тогда
		ДвоичныеДанныеИзображение = Новый ДвоичныеДанные(СокрЛП(ТекущаяСтрока.ПолноеНаименование));
	Иначе 
		
		ИмяОткрываемогоФайла = КаталогВременныхФайлов() + ТекущаяСтрока.ИмяФайла;
		
		СтруктураПоиска = Новый Структура("ЗаказНаряд, UID, ИмяФайла");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекущаяСтрока);
		
		ХранилищеКартинки = ПолучитьДвоичныеДанныеИзображения(СтруктураПоиска);
		
		Если ХранилищеКартинки = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ФайлКартинки = ХранилищеКартинки.Получить();
		
		Попытка
			ФайлКартинки.Записать(ИмяОткрываемогоФайла);
		Исключение
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			Предупреждение( Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='При записи временного файла изображения"
"""%1"""
"произошла ошибка:"
"""%2"".';en='When recording the temporary image file"
"""%1"""
"An error has occurred:"
"""% 2"".'"),
			ИмяОткрываемогоФайла,
			ИнформацияОбОшибке.Описание));
			
			Возврат;
			
		КонецПопытки;
		
		ТекущаяСтрока.ПолноеНаименование = ИмяОткрываемогоФайла;
		
		ДвоичныеДанныеИзображение = Новый ДвоичныеДанные(СокрЛП(ТекущаяСтрока.ПолноеНаименование));
		
	КонецЕсли; 
	
	АдресКартинки = ПоместитьВоВременноеХранилище(ДвоичныеДанныеИзображение);
	
КонецПроцедуры

////#КонецОбласти

////#Область ОбработчикиСобытийТаблицыФормыТаблицаИнцидентовИКомментарии

&НаКлиенте
Процедура ТаблицаИнцидентовИКомментарииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИнцидентовИКомментарииПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИнцидентовИКомментарииПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаИнцидентовИКомментарии.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Комментарий1 = ПолучитьПараметр_Булево_ExpenceCode(ЗаказНаряд, неопределено, ТекущаяСтрока.ИдентификаторИнцидента, "Control_Comm1");
	Комментарий2 = ПолучитьПараметр_Булево_ExpenceCode(ЗаказНаряд, неопределено, ТекущаяСтрока.ИдентификаторИнцидента, "Control_Comm2");
	Комментарий3 = ПолучитьПараметр_Булево_ExpenceCode(ЗаказНаряд, неопределено, ТекущаяСтрока.ИдентификаторИнцидента, "Control_Comm3");
	
	Если Комментарий1 
		или Комментарий2
		или Комментарий3 тогда
		
		Элементы.КомментарийОперации.АвтоОтметкаНезаполненного = Истина;
		Элементы.КомментарийОперации.АвтоВыборНезаполненного   = Истина;
		
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.КомментарийОперации) тогда
			
			Элементы.КомментарийОперации.ЦветФона = Новый Цвет(255,0,0);
			
		Иначе
			
			Элементы.КомментарийОперации.ЦветФона = Новый Цвет(255,255,255);
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ОписаниеЖалобы) тогда
			
			Элементы.ОписаниеЖалобы.ЦветФона = Новый Цвет(255,0,0);
			
		Иначе
			
			Элементы.ОписаниеЖалобы.ЦветФона = Новый Цвет(255,255,255);
			
		КонецЕсли;
		
	Иначе
		
		Элементы.КомментарийОперации.АвтоОтметкаНезаполненного = Ложь;
		Элементы.КомментарийОперации.АвтоВыборНезаполненного = Ложь;
		
	КонецЕсли;
	
	ЖалобаКлиента = ПолучитьПараметр_Булево_ExpenceCode(ЗаказНаряд, неопределено, ТекущаяСтрока.ИдентификаторИнцидента,"Control_CustomerReq");
	
	Если ЖалобаКлиента тогда
		
		Элементы.ОписаниеЖалобы.АвтоОтметкаНезаполненного = Истина;
		Элементы.ОписаниеЖалобы.АвтоВыборНезаполненного = Истина;
		
	Иначе
		
		Элементы.ОписаниеЖалобы.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ОписаниеЖалобы.АвтоВыборНезаполненного = Ложь;
		
	КонецЕсли;

	ОбновитьЗаголовкиКомментариевОбращения(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСоответствийИнцидентПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаСоответствий.ТекущиеДанные;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ЗаказНаряд", ЗаказНаряд);
	Отбор.Вставить("Инцидент", ТекущаяСтрока.Инцидент);
	
	НайденныеИнциденты = ТаблицаИнцидентов.НайтиСтроки(Отбор);
	
	ТекущаяСтрока.ИдентификаторИнцидента = НайденныеИнциденты[0].ИдентификаторИнцидента;
	
	//Теперь нужно обновить таблицу соответствий
	ОбновитьТаблицуПараметровВидовРасходов();
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатДиагностикПриИзменении(Элемент)
	
	ОбновитьЗаголовкиКомментариевОбращения();
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийОперацииПриИзменении(Элемент)
	
	ОбновитьЗаголовкиКомментариевОбращения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеЖалобыАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	
	//Элементы.ОписаниеЖалобы.Заголовок = "Жалоба клиента: 	 Осталось символов: "	 + Формат(80  - СтрДлина(Текст),"ЧЦ=10; ЧН=-; ЧГ="); 	

КонецПроцедуры

&НаКлиенте
Процедура ОписаниеЖалобыОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Элементы.ОписаниеЖалобы.ЦветФона = Новый Цвет(255,255,255);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатДиагностикАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	
	//Элементы.РезультатДиагностик.Заголовок = "Результат диагностики: 	Осталось символов: " + Формат(100 - СтрДлина(Текст),"ЧЦ=10; ЧН=-; ЧГ="); 	
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийОперацииАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	
	//Элементы.КомментарийОперации.Заголовок = "Комментарии к инциденту: 	Осталось символов: " + Формат(350 - СтрДлина(Текст),"ЧЦ=10; ЧН=-; ЧГ="); 	

КонецПроцедуры

////#КонецОбласти

////#Область ОбработчикиСобытийТаблицыФормыТаблицаСоответствий

&НаКлиенте
Процедура ТаблицаСоответствийПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = Элементы.ТаблицаСоответствий.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока.Удален = Не ТекущаяСтрока.Удален;
	Модифицированность = Истина;
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСоответствийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	НоваяСтрока = ТаблицаСоответствий.Добавить();
	НоваяСтрока.Идентификатор = Строка(Новый УникальныйИдентификатор());
	НоваяСтрока.ЗаказНаряд    = ЗаказНаряд;
	
	ОбновитьТаблицуПараметровВидовРасходов();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСоответствийПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьТаблицуПараметровВидовРасходов();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСоответствийВидРасходовПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаСоответствий.ТекущиеДанные;
	
	Если ТекущаяСтрока.ВидРасходов <> ПредопределенноеЗначение("Справочник.EDR_ВидыРасходов.Ex57")
		И ТекущаяСтрока.Процент <> 100 Тогда
		
		ТекущаяСтрока.Процент = 100;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСоответствийСчетПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаСоответствий.ТекущиеДанные;
	
	СтруктураПоиска = Новый Структура("ЗаказНаряд,Счет", ЗаказНаряд, ТекущаяСтрока.Счет);
		
	НайденныеСчета = ТаблицаСчетов.НайтиСтроки(СтруктураПоиска);
	
	Если НайденныеСчета.Количество() = 0 Тогда
		ТекущаяСтрока.ЗаказНаряд = ЗаказНаряд;
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока, НайденныеСчета[0]);
	
	Если ТекущаяСтрока.ВидРасходов <> ПредопределенноеЗначение("Справочник.EDR_ВидыРасходов.Ex57")
		И ТекущаяСтрока.Процент <> 100 Тогда 
		
		ТекущаяСтрока.Процент = 100;
		
	КонецЕсли;
	
КонецПроцедуры

////#КонецОбласти

////#Область ОбработчикиСобытийТаблицыФормыТаблицаИнцидентов

&НаКлиенте
Процедура ТаблицаИнцидентовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	//сразу отказываемся от добавления строки "стандартным способом"
	Отказ = Истина;
	
	НоваяСтрока = ТаблицаИнцидентов.Добавить();
	НоваяСтрока.Инцидент   = ПолучитьСледующийНомерИнцидента();
	НоваяСтрока.ЗаказНаряд = ЗаказНаряд;
	
	НоваяСтрока.ИдентификаторИнцидента = Строка(Новый УникальныйИдентификатор());
	
	ЗаполнитьСлужебныеРеквизитыТаблицыИнциденты();
	
	//Обновляем список выбора
	//
	ОбновитьСпискиВыбораИнцидентов();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИнцидентовПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = Элементы.ТаблицаИнцидентов.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекущаяСтрока.Удален тогда
		
		Успешно = Ложь;
		
		СтруктураПоиска = Новый Структура("ЗаказНаряд, Удален", ЗаказНаряд, Ложь);
		
		СтрокиИнцидентов = ТаблицаИнцидентов.НайтиСтроки(СтруктураПоиска);
		
		Если СтрокиИнцидентов.Количество() = 1 тогда 
			
			Предупреждение("У заказ-наряда " + ЗаказНаряд.Номер + " только один действующий инцидент. Удаление не возможно.", 5);
			Отказ = Истина;
			Возврат;
			
		ИначеЕсли СтрокиИнцидентов.Количество() = 0 тогда 
			
			Предупреждение("У заказ-наряда " + ЗаказНаряд.Номер + " нет действующих инцидентов. Удаление не возможно.", 5);
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;
		
		СтруктураИспользованияИнцидента = ПроверитьИспользованиеИнцидента(ТекущаяСтрока.ИдентификаторИнцидента);
		
		Если СтруктураИспользованияИнцидента["ЕстьИспользование"]= истина тогда
			ВыбратьДругойИнцидент(СтруктураИспользованияИнцидента, ТекущаяСтрока.ИдентификаторИнцидента, Успешно);
		Иначе //Использования еще нет
			Успешно = Истина;
		КонецЕсли;
		
		Если Успешно тогда
			
			ТекущаяСтрока.Удален = Истина;
			
		КонецЕсли;
		
	Иначе
		
		ТекущаяСтрока.Удален = Ложь;
		
	КонецЕсли;
	
	Модифицированность = Истина;
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИнцидентовПослеУдаления(Элемент)
	
	ОбновитьСпискиВыбораИнцидентов();
	ЗаполнитьСлужебныеРеквизитыТаблицыИнциденты();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИнцидентовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьСпискиВыбораИнцидентов();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИнцидентовИнцидентПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаИнцидентов.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.Инцидент) Тогда
		Возврат;
	КонецЕсли;
	
	//Для начала смотрим, есть ли запись в таблице соответствий
	НайденноеСоответствие = ТаблицаСоответствий.НайтиСтроки(Новый Структура("ИдентификаторИнцидента", ТекущаяСтрока.ИдентификаторИнцидента));
	Если НайденноеСоответствие.Количество() > 0 тогда
			//При вводе новых инцидентов нужно переформировывать таблицу параметров
		ОбновитьТаблицуПараметровВидовРасходов();
	Иначе
		
		Предупреждение("Для инцидента: <" + СокрЛП(ТекущаяСтрока.Инцидент) + ">, не указана привязка к счету.", 15);
	КонецЕсли;
	
КонецПроцедуры

////#КонецОбласти

////#Область ОбработчикиСобытийТаблицыФормыТаблицаСчетов

&НаКлиенте
Процедура ТаблицаСчетовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	//Оповещение = Новый ОписаниеОповещения("ТаблицаСчетовПередНачаломДобавленияЗавершение",ЭтаФорма);
	
	ТекстВопроса = "Внимание!" + Символы.ПС + "Не рекомендуется использовать несколько заявок в заказ-наряде!" + 
	Символы.ПС + "Продолжить?";
	
	//ПоказатьВопрос(Оповещение,ТекстВопроса,РежимДиалогаВопрос.ДаНет,0);
	
	Результат = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0);
	ТаблицаСчетовПередНачаломДобавленияЗавершение(Результат, Параметры);
	
КонецПроцедуры
 
&НаКлиенте
Процедура ТаблицаСчетовКатегорияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаСчетов.ТекущиеДанные;
	
	НастроитьТаблицуСчетов(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСчетовВидРасходовПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаСчетов.ТекущиеДанные;
	
	НастроитьТаблицуСчетов(ТекущаяСтрока);
	//Теперь нужно настроить поведение всех таблиц с этим видом расходов
	
	ТекстСообщения = "";
	
	Отказ = ПроверитьГарантийныеСроки(ТекущаяСтрока.ВидРасходов, ТекстСообщения);
	
	Если Отказ тогда
		
		Предупреждение(ТекстСообщения);
		
		ТекущаяСтрока.ВидРасходов = ВидРасходовПустаяСсылка;
		Возврат; //Дальше не продолжаем
		
	КонецЕсли;
	
	НастроитьКолонкуНомерСогласованияИнцидентов();
	
	ЗаполнитьСлужебныеРеквизитыТаблицыИнциденты();
	
	//Нужно обновить таблицу параметров
	ОбновитьТаблицуПараметровВидовРасходов();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСчетовПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = Элементы.ТаблицаСчетов.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекущаяСтрока.Удален тогда
		
		Успешно = Ложь;
		
		СтруктураПоиска = Новый Структура("ЗаказНаряд, Удален", ЗаказНаряд, Ложь);
		
		СтрокиНаУдаление = ТаблицаСчетов.НайтиСтроки(СтруктураПоиска);
		
		Если СтрокиНаУдаление.Количество() = 1 тогда 
			Предупреждение("У заказ-наряда " + ЗаказНаряд.Номер + " только один действующий счет. Удаление не возможно.", 5);
			Отказ = Истина;
			Возврат;
			
		ИначеЕсли СтрокиНаУдаление.Количество() = 0 тогда 
			Предупреждение("У заказ-наряда " + ЗаказНаряд.Номер + " нет действующих счетов. Удаление не возможно.", 5);
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;
		
		СтруктураИспользованияСчетов = ПроверитьИспользованиеСчета(ТекущаяСтрока.ИдентификаторСчета);
		
		Если СтруктураИспользованияСчетов["ЕстьИспользование"] = Истина тогда
			ВыбратьДругойСчет(СтруктураИспользованияСчетов,ТекущаяСтрока.ИдентификаторСчета, Успешно);
		ИначеЕсли СтруктураИспользованияСчетов["ЕстьИспользование"] = Ложь тогда
			Успешно = Истина;
		КонецЕсли;
		
		Если Успешно тогда
			ТекущаяСтрока.Удален = Истина;
		КонецЕсли;
	Иначе
		ТекущаяСтрока.Удален = Ложь;
	КонецЕсли;
	
	Отказ = Истина;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСчетовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НоваяСтрока Тогда
		УстановитьВидимость();
	КонецЕсли;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСчетовПослеУдаления(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

////#КонецОбласти

////#Область ОбработчикиСобытийТаблицыФормыТовары

&НаКлиенте
Процедура ТаблицаТоваровОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.EDR_DiversCode") Тогда
		
		НоваяСтрока = ТаблицаТоваров.Добавить();
		НоваяСтрока.DiversCode   		= ВыбранноеЗначение;
		НоваяСтрока.Артикул 	 		= ВыбранноеЗначение.Код;
		НоваяСтрока.Номенклатура 		= ВыбранноеЗначение.Наименование;
		НоваяСтрока.ЗаказНаряд   		= ЗаказНаряд;
		НоваяСтрока.СтавкаНДС 	 		= СтавкаБезНДС;
		НоваяСтрока.ИдентификаторТовара = Строка(Новый УникальныйИдентификатор());
		
		Модифицированность = Истина;
		
		ЗаполнитьСлужебныеРеквизитыТаблицыТовары();
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Номенклатура") Тогда 
		
		НоваяСтрока = ТаблицаТоваров.Добавить();
		
		НоваяСтрока.Цена 		= 0;
		НоваяСтрока.СуммаСкидки = 0;
		НоваяСтрока.СуммаНДС 	= 0;
		НоваяСтрока.СуммаВсего  = 0;
		НоваяСтрока.Количество  = 1;
		
		НоваяСтрока.ЗапретСнятияПричины = Истина;
		НоваяСтрока.ПричинаОбращения 	= Истина;
		НоваяСтрока.НеВключатьВСчет 	= Истина;
		
		НоваяСтрока.Артикул 			= ВыбранноеЗначение.Артикул;
		НоваяСтрока.Номенклатура 		= ВыбранноеЗначение;
		
		//добавляем ссылку на текущий заказ
		НоваяСтрока.ЗаказНаряд			= ЗаказНаряд;
		
		НоваяСтрока.СтавкаНДС 			= СтавкаБезНДС;
		НоваяСтрока.ИдентификаторТовара = Строка(Новый УникальныйИдентификатор());
		
		Модифицированность = Истина;
		
		ЗаполнитьСлужебныеРеквизитыТаблицыТовары();
		
	КонецЕсли;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Тип("СправочникСсылка.Номенклатура") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ФормаПодбора = ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаСписка",,Элементы.ТаблицаТоваровНоменклатура);
		ФормаПодбора.РежимВыбора 		= Истина;
		
		ФормаПодбора.ЗакрыватьПриВыборе = Истина;
		
	ИначеЕсли ВыбранноеЗначение = Тип("СправочникСсылка.EDR_DiversCode") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Отбор = Новый Структура("Тип", ПредопределенноеЗначение("Перечисление.EDR_ТипDiversCode.P"));
		
		ПараметрыФормы = Новый Структура("Отбор, ИсключитьIP", Отбор, Истина);
		
		ОткрытьФорму("Обработка.EDR_АРМПоГарантииNew.Форма.ФормаВыборDiversCode", ПараметрыФормы, Элементы.ТаблицаТоваровНоменклатура);
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		ТекущаяСтрока = Элементы.ТаблицаТоваров.ТекущиеДанные;
		
		//Заполняем поля по умолчанию или очистим которые былы заполнены ранее
		ТекущаяСтрока.Цена 	      = 0;
		ТекущаяСтрока.СуммаСкидки = 0;
		ТекущаяСтрока.СуммаНДС    = 0;
		ТекущаяСтрока.СуммаВсего  = 0;
		ТекущаяСтрока.Количество  = 1;
		
		ТекущаяСтрока.ЗапретСнятияПричины = Истина;
		ТекущаяСтрока.ПричинаОбращения 	  = Истина;
		ТекущаяСтрока.НеВключатьВСчет 	  = Истина;
		
		ТекущаяСтрока.Артикул 	   = ВыбранноеЗначение.Артикул;
		ТекущаяСтрока.Номенклатура = ВыбранноеЗначение;
		ТекущаяСтрока.ЗаказНаряд   = ЗаказНаряд;
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.EDR_DiversCode") Тогда
		
		ТекущаяСтрока = Элементы.ТаблицаТоваров.ТекущиеДанные;
		
		//Очистим поля которые былы заполнены ранее
		ТекущаяСтрока.Цена 		  = 0;
		ТекущаяСтрока.СуммаСкидки = 0;
		ТекущаяСтрока.СуммаНДС 	  = 0;
		ТекущаяСтрока.СуммаВсего  = 0;
		ТекущаяСтрока.Количество  = 1;
		
		ТекущаяСтрока.DiversCode   = ВыбранноеЗначение;
		ТекущаяСтрока.Артикул 	   = ВыбранноеЗначение.Код;
		ТекущаяСтрока.Номенклатура = ВыбранноеЗначение.Наименование;
		
		//добавляем ссылку на текущий заказ
		ТекущаяСтрока.ЗаказНаряд	= ЗаказНаряд;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровИнцидентПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаТоваров.ТекущиеДанные;
	
	СтруктураПоиска = Новый Структура("ЗаказНаряд, Инцидент", ЗаказНаряд, ТекущаяСтрока.Инцидент);
	
	СтрокиИнцидентов = ТаблицаИнцидентов.НайтиСтроки(СтруктураПоиска);
	
	Если СтрокиИнцидентов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаИнцидентов = СтрокиИнцидентов[0];
	
	Если Не ТекущаяСтрока.СтрокаИзЗаказНаряда Тогда
		
		//Отрабатываем логику доступа из параметров ExpenceCode
		ИдентификаторИнцидента = СтрокаИнцидентов.ИдентификаторИнцидента;
		
		DiversCodePart = ПолучитьПараметр_Булево_ExpenceCode(ЗаказНаряд, неопределено, ИдентификаторИнцидента, "Control_DiverPart");
		
		Если НЕ DiversCodePart тогда //Использовать Diverse code нельзя
			
			Предупреждение("У выбранного инцидента запрещено использование ""Diverse code"" для деталей");
			ТекущаяСтрока.Инцидент = "-";
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ТекущаяСтрока.ИдентификаторИнцидента = СтрокаИнцидентов.ИдентификаторИнцидента;
	
	СтруктураПоиска = Новый Структура("ИдентификаторИнцидента, ПричинаОбращения", ТекущаяСтрока.ИдентификаторИнцидента, Истина);
	
	НайденныеСтрокиПричин = ТаблицаТоваров.НайтиСтроки(СтруктураПоиска);
	
	Если НайденныеСтрокиПричин.Количество() > 1 Тогда
		
		МассивСтрок = Новый Массив;
		
		Для каждого СтрокаПричин Из НайденныеСтрокиПричин Цикл
			
			СтруктураСтроки = Новый Структура("ЗаказНаряд,ИдентификаторИнцидента,ИдентификаторТовара,Артикул,Номенклатура,Инцидент");
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, СтрокаПричин);
			
			МассивСтрок.Добавить(СтруктураСтроки);
			
		КонецЦикла;
		
		ПараметрыФормы = Новый Структура("МассивСтрок", МассивСтрок);
		
		ОткрытьФорму("Обработка.EDR_АРМПоГарантииNew.Форма.ФормаВыбораПричин", ПараметрыФормы, Элементы.ТаблицаТоваровИнцидент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровИнцидентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		СтруктураПоиска = Новый Структура("ИдентификаторИнцидента, ПричинаОбращения", ВыбранноеЗначение.ИдентификаторИнцидента, Истина);
		
		НайденныеСтрокиПричин = ТаблицаТоваров.НайтиСтроки(СтруктураПоиска);
		
		Для каждого СтрокаПричины Из НайденныеСтрокиПричин Цикл
			
			Если НЕ СтрокаПричины.ИдентификаторТовара = ВыбранноеЗначение.ИдентификаторТовара тогда
				СтрокаПричины.Удален = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаТоваров.ТекущиеДанные;
	
	СтруктураСтроки = Новый Структура("Количество, Цена, СуммаНДС, СуммаВсего, СтавкаНДС, СуммаСкидки");
	
	ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекущаяСтрока);
	
	РассчитатьСтоимостьТоваров(СтруктураСтроки);
	
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтруктураСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровЦенаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаТоваров.ТекущиеДанные;
	
	СтруктураСтроки = Новый Структура("Количество, Цена, СуммаНДС, СуммаВсего, СтавкаНДС, СуммаСкидки");
	
	ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекущаяСтрока);
	
	РассчитатьСтоимостьТоваров(СтруктураСтроки);
	
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтруктураСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровСуммаСкидкиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаТоваров.ТекущиеДанные;
	
	СтруктураСтроки = Новый Структура("Количество, Цена, СуммаНДС, СуммаВсего, СтавкаНДС, СуммаСкидки");
	
	ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекущаяСтрока);
	
	РассчитатьСтоимостьТоваров(СтруктураСтроки);
	
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтруктураСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровСтавкаНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаТоваров.ТекущиеДанные;
	
	СтруктураСтроки = Новый Структура("Количество, Цена, СуммаНДС, СуммаВсего, СтавкаНДС, СуммаСкидки");
	
	ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекущаяСтрока);
	
	РассчитатьСтоимостьТоваров(СтруктураСтроки);
	
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтруктураСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущаяСтрока = Элементы.ТаблицаТоваров.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока.Удален = Не ТекущаяСтрока.Удален;
	
	Если ТекущаяСтрока.Удален Тогда
		
		ТекущаяСтрока.НеВключатьВСчет  = Ложь;
		ТекущаяСтрока.ПричинаОбращения = Ложь;
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровЗапретСнятияПричиныПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаТоваров.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекущаяСтрока.Удален И ТекущаяСтрока.ЗапретСнятияПричины тогда
		
		ТекущаяСтрока.НеВключатьВСчет  = Истина;
		ТекущаяСтрока.ПричинаОбращения = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровПричинаОбращенияПриИзменении(Элемент)
	
	ЗаполнитьСлужебныеРеквизитыТаблицыТовары();
	
КонецПроцедуры

////#КонецОбласти

////#Область ОбработчикиСобытийТаблицыФормыРаботы

&НаКлиенте
Процедура ТаблицаРаботыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.EDR_DiversCode") Тогда
		
		НоваяСтрока = ТаблицаРаботы.Добавить();
		
		НоваяСтрока.DiversCode = ВыбранноеЗначение;
		НоваяСтрока.Артикул    = ВыбранноеЗначение.Код;
		НоваяСтрока.Работа 	   = ВыбранноеЗначение.Наименование;
		НоваяСтрока.ЗаказНаряд = ЗаказНаряд;
		
		НоваяСтрока.ИдентификаторРаботы = Строка(Новый УникальныйИдентификатор());
		
		Модифицированность = Истина;
		
		ЗаполнитьСлужебныеРеквизитыТаблицыРаботы();
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРаботыНормочасНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ТаблицаРаботы.ТекущиеДанные;
	
	Если ТекущаяСтрока.НеСтандартнаяОперация 
		И Не ЗначениеЗаполнено(ТекущаяСтрока.Нормочас) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ОткрытьФорму("Справочник.Нормочасы.ФормаВыбора",,Элементы.ТаблицаРаботыНормочас);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРаботыРаботаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ТаблицаРаботы.ТекущиеДанные;
	
	Если ТекущаяСтрока.НеСтандартнаяОперация 
		И Не ЗначениеЗаполнено(ТекущаяСтрока.Работа) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТекущаяСтрока.Работа = "";
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРаботыРаботаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРаботыАртикулПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаРаботы.ТекущиеДанные;
	
	Если ТекущаяСтрока.Артикул = "1777"
		Или ТекущаяСтрока.Артикул = "1888"
		Или ТекущаяСтрока.Артикул = "1999"
		Или ТекущаяСтрока.Артикул = "8888"
		Или ТекущаяСтрока.Артикул = "9499" Тогда
		
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.Работа) Тогда
			
			ТекущаяСтрока.Работа = "<Операция не закодирована>";
			
		КонецЕсли;
		
		Если ТекущаяСтрока.Артикул = "1999"
			Или ТекущаяСтрока.Артикул = "9499" Тогда
			ТекущаяСтрока.РаботаПоЛКМ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРаботыИнцидентПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаРаботы.ТекущиеДанные;
	
	СтруктураПоиска = Новый Структура("ЗаказНаряд, Инцидент", ЗаказНаряд, ТекущаяСтрока.Инцидент);
	
	НайденныеСтроки = ТаблицаИнцидентов.НайтиСтроки(СтруктураПоиска);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаИнцидента = НайденныеСтроки[0];
	
	ИдентификаторИнцидента = СтрокаИнцидента.ИдентификаторИнцидента;
	
	Если Не ТекущаяСтрока.СтрокаИзЗаказНаряда Тогда
		
		//Это Diverse code. Нужно проверить право на использование инцидента
		DiversCodeLabor = ПолучитьПараметр_Булево_ExpenceCode(Неопределено, Неопределено, ИдентификаторИнцидента, "Control_DiverOper");
		
		Если НЕ DiversCodeLabor тогда //Использовать Diverse code нельзя
			
			Предупреждение("У выбранного инцидента использование для работ ""Diverse code"" запрещено.");
			ТекущаяСтрока.Инцидент = "-";
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ТекущаяСтрока.ИдентификаторИнцидента = ИдентификаторИнцидента;
	
	ЗаполнитьСлужебныеРеквизитыТаблицыРаботы();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРаботыКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаРаботы.ТекущиеДанные;
	
	СтруктураСтроки = Новый Структура("Количество, Коэффициент, Цена, СуммаНДС, СуммаВсего, СтавкаНДС, СуммаСкидки");
	
	ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекущаяСтрока);
	
	РассчитатьСтоимостьРабот(СтруктураСтроки);
	
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтруктураСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРаботыКоэффициентПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаРаботы.ТекущиеДанные;
	
	СтруктураСтроки = Новый Структура("Количество, Коэффициент, Цена, СуммаНДС, СуммаВсего, СтавкаНДС, СуммаСкидки");
	
	ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекущаяСтрока);
	
	РассчитатьСтоимостьРабот(СтруктураСтроки);
	
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтруктураСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРаботыНормочасПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаРаботы.ТекущиеДанные;
	
	ТекущаяСтрока.Цена = ПолучитьРеквизитСсылки(ТекущаяСтрока.Нормочас, "Цена");
	
	СтруктураСтроки = Новый Структура("Количество, Коэффициент, Цена, СуммаНДС, СуммаВсего, СтавкаНДС, СуммаСкидки");
	
	ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекущаяСтрока);
	
	РассчитатьСтоимостьРабот(СтруктураСтроки);
	
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтруктураСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРаботыЦенаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаРаботы.ТекущиеДанные;
	
	СтруктураСтроки = Новый Структура("Количество, Коэффициент, Цена, СуммаНДС, СуммаВсего, СтавкаНДС, СуммаСкидки");
	
	ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекущаяСтрока);
	
	РассчитатьСтоимостьРабот(СтруктураСтроки);
	
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтруктураСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРаботыСтавкаНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаРаботы.ТекущиеДанные;
	
	СтруктураСтроки = Новый Структура("Количество,Коэффициент,Цена,СуммаНДС,СуммаВсего,СтавкаНДС,СуммаСкидки");
	
	ЗаполнитьЗначенияСвойств(СтруктураСтроки,ТекущаяСтрока);
	
	РассчитатьСтоимостьРабот(СтруктураСтроки);
	
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока,СтруктураСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРаботыСуммаСкидкиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаРаботы.ТекущиеДанные;
	
	СтруктураСтроки = Новый Структура("Количество,Коэффициент,Цена,СуммаНДС,СуммаВсего,СтавкаНДС,СуммаСкидки");
	
	ЗаполнитьЗначенияСвойств(СтруктураСтроки,ТекущаяСтрока);
	
	РассчитатьСтоимостьРабот(СтруктураСтроки);
	
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока,СтруктураСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРаботыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРаботыПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = Элементы.ТаблицаРаботы.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ТекущаяСтрока.Удален = Не ТекущаяСтрока.Удален;
	
	Если ТекущаяСтрока.Удален Тогда
		
		ТекущаяСтрока.ПричинаОбращения = Ложь;
		ТекущаяСтрока.РаботаПоЛКМ 	   = Ложь;
		
	КонецЕсли; 
	
	Отказ = Истина;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРаботыПриАктивизацииЯчейки(Элемент)
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрока.НеСтандартнаяОперация 
		И Элемент.ТекущийЭлемент.Имя = "ТаблицаРаботыАртикул" Тогда
		
		Элементы.ТаблицаРаботыАртикул.РежимВыбораИзСписка = Истина;
		
		Элементы.ТаблицаРаботыАртикул.КнопкаСпискаВыбора = Истина;
		
		Элементы.ТаблицаРаботыАртикул.СписокВыбора.Очистить();
		
		Элементы.ТаблицаРаботыАртикул.СписокВыбора.Добавить("1777", "1777");
		Элементы.ТаблицаРаботыАртикул.СписокВыбора.Добавить("1888", "1888");
		Элементы.ТаблицаРаботыАртикул.СписокВыбора.Добавить("8888", "8888");

		
		Если ТекущаяСтрока.РаботаПоЛКМ тогда
			Элементы.ТаблицаРаботыАртикул.СписокВыбора.Добавить("1999", "1999");
		КонецЕсли;
		
	ИначеЕсли Не ТекущаяСтрока.НеСтандартнаяОперация 
		И Элемент.ТекущийЭлемент.Имя = "ТаблицаРаботыАртикул" Тогда
		
		Элементы.ТаблицаРаботыАртикул.РежимВыбораИзСписка = Ложь;
		
		Элементы.ТаблицаРаботыАртикул.КнопкаСпискаВыбора = Ложь;
		
		Элементы.ТаблицаРаботыАртикул.СписокВыбора.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРаботыПричинаОбращенияПриИзменении(Элемент)
	
	ЗаполнитьСлужебныеРеквизитыТаблицыРаботы();
	
КонецПроцедуры

////#КонецОбласти

////#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьТаблицуСчетов(ТекущаяСтрока)
	
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.Категория) Тогда
		Возврат;
	КонецЕсли; 
	
	мТекущаяСтрокаСчетов = ТаблицаСчетов.НайтиСтроки(Новый Структура("ИдентификаторСчета", ТекущаяСтрока.ИдентификаторСчета));
	
	ТекущаяСтрокаСчетов = мТекущаяСтрокаСчетов[0];
	
	СтруктураПоиска = Новый Структура("Категория", ТекущаяСтрока.Категория);
	СоответствиеКатегорииРасходам = ТаблицаСоответствийКатегорий.НайтиСтроки(СтруктураПоиска);
	
	Если СоответствиеКатегорииРасходам.Количество() = 0 Тогда
		СоответствиеКатегорииРасходам = ДополнитьТаблицуСоответствийКатегорий(ТекущаяСтрока.Категория);
	КонецЕсли; 
	
	
	Если СоответствиеКатегорииРасходам.Количество() = 0 тогда
		
		ТекстСообщения = "Нет данных по доступным видам расходов для данной категории """ + СокрЛП(ТекущаяСтрока.Категория) + """. Проверте корректность введенных данных.";
		
		Предупреждение(ТекстСообщения,15);
		
		Возврат;
		
	КонецЕсли;
	
	Если СоответствиеКатегорииРасходам.Количество() > 1 Тогда 
		
		//Сформируем массив с найденными кодами статей расходов
		МассивРасходов = Новый Массив;
		
		Для каждого элМассива из СоответствиеКатегорииРасходам цикл
			МассивРасходов.Добавить(элМассива.ExpenceCode);
		КонецЦикла;
		
		//теперь ищем по массиву
		Если ЗначениеЗаполнено(ТекущаяСтрока.ВидРасходов) И МассивРасходов.Найти(ТекущаяСтрока.ВидРасходов) = Неопределено тогда //если вернулся индекс элемента тогда все нормально
			
			ТекстСообщения = "Данный вид расходов не предназначен для выбранной категории." + Символы.ПС;
			ТекстСообщения = ТекстСообщения + "Для категории - " + СокрЛП(ТекущаяСтрока.Категория) + " доступны только следующие";
			
			ТекстСообщения = ТекстСообщения + "Виды расходов:" + Символы.ПС;
			
			Для Каждого элМассива из МассивРасходов Цикл
				Если НЕ элМассива = неопределено тогда
					ТекстСообщения = ТекстСообщения + "	Код " + элМассива.Код + "  " + элМассива.Наименование + Символы.ПС;
				КонецЕсли;
			КонецЦикла;
			
			Предупреждение(ТекстСообщения,,"Ошибка ввода данных!");
			
			//Такой комбинации быть не может, очищаем, помечаем красным
			ТекущаяСтрокаСчетов.ВидРасходов = ВидРасходовПустаяСсылка;
			
		КонецЕсли;
		
	ИначеЕсли СоответствиеКатегорииРасходам.Количество() = 1 Тогда 
		
		Если ЗначениеЗаполнено(СоответствиеКатегорииРасходам[0].ExpenceCode) тогда
			
			//ВИД РАСХОДОВ ЕСТЬ НО НЕ СООТВЕТСВУЕТ
			Если ЗначениеЗаполнено(ТекущаяСтрока.ВидРасходов) И СоответствиеКатегорииРасходам[0].ExpenceCode <> ТекущаяСтрока.ВидРасходов тогда 
				
				Предупреждение("Введеный вид расходов не соответствует предопределенному в категории!" + Символы.ПС +
				"Ошибочные данные будут автоматически исправлены.", 15);
				
				ТекущаяСтрокаСчетов.ВидРасходов = СоответствиеКатегорииРасходам.ExpenceCode;
				
			КонецЕсли;
			
		Иначе //Вид расходов не определен
			
			//Вид расходов отсутствует, значит поле не должно заполняться
			Если ЗначениеЗаполнено(ТекущаяСтрока.ВидРасходов) тогда
				
				Предупреждение("Для категории - " + СокрЛП(ТекущаяСтрока.Категория) + " вид расходов не заполняется." + Символы.ПС + 
				"Вид расходов будет очищен.", 15);	
				ТекущаяСтрокаСчетов.ВидРасходов = ВидРасходовПустаяСсылка;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		//Вид расходов отсутствует, значит поле не должно заполняться
		Если ЗначениеЗаполнено(ТекущаяСтрока.ВидРасходов) тогда
			ТекущаяСтрокаСчетов.ВидРасходов = ВидРасходовПустаяСсылка;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьТаблицуПараметровВидовРасходов();
	
КонецПроцедуры // НастроитьТаблицуСчетов()

////#Область ПриИзмененииРеквизитов

&НаСервере
Процедура СемействоАвтомобиляПриИзмененииНаСервере()
	
	РангАвторабот = СемействоАвтомобиля.КлассАвтомобиля;
	
КонецПроцедуры

////#КонецОбласти

////#Область ЗаполнениеТаблиц

&НаСервере
Процедура ЗаполнитьСчетаПоОтбору()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Счета.ЗаказНаряд,
	|	Счета.Invoice КАК Счет,
	|	Счета.Invoice КАК СчетДоИзменения,
	|	Счета.Invoice КАК СчетДоНачалаРедактирования,
	|	Счета.GUID КАК ИдентификаторСчета,
	|	Счета.Категория,
	|	Счета.ДатаИнвойса,
	|	Счета.Expense_code КАК ВидРасходов,
	|	Счета.СчетФактура,
	|	Счета.Expense_code.Type КАК Type
	|ИЗ
	|	РегистрСведений.EDR_Invoices КАК Счета
	|ГДЕ
	|	Счета.ЗаказНаряд = &ЗаказНаряд"
	);
	Запрос.УстановитьПараметр("ЗаказНаряд", ЗаказНаряд);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаСчетов.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры //ЗаполнитьСчетаПоОтбору()

&НаСервере
Процедура ЗаполнитьИнцидентыПоОтбору()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Мероприятия.ЗаказНаряд,
	|	Мероприятия.Intervention КАК Инцидент,
	|	Мероприятия.GUID КАК ИдентификаторИнцидента,
	|	Мероприятия.RC_code КАК КодОщущенияКлиента,
	|	Мероприятия.Function_Code КАК ФункциональныйКод,
	|	Мероприятия.OTS_number КАК ОтзывнаяНота,
	|	Мероприятия.НомерСФ,
	|	Мероприятия.ДатаСФ,
	|	Мероприятия.ПробегПриУстановке,
	|	Мероприятия.ОписаниеОперации,
	|	Мероприятия.ОписаниеЖалобы,
	|	Мероприятия.КомментарийОперации,
	|	Мероприятия.РезультатДиагностики,
	|	Мероприятия.НомерСогласования
	|ИЗ
	|	РегистрСведений.EDR_Interventions КАК Мероприятия
	|ГДЕ
	|	Мероприятия.ЗаказНаряд = &ЗаказНаряд"
	);
	Запрос.УстановитьПараметр("ЗаказНаряд", ЗаказНаряд);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаИнцидентов.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры //ЗаполнитьИнцидентыПоОтбору()

&НаСервере
Процедура ЗаполнитьСоответствияПоОтбору()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоответствияСчетов.ЗаказНаряд,
	|	СоответствияСчетов.Intervention КАК ИдентификаторИнцидента,
	|	СоответствияСчетов.Invoice КАК ИдентификаторСчета,
	|	Счета.Invoice КАК Счет,
	|	Счета.Категория,
	|	Счета.Expense_code КАК ВидРасходов,
	|	Мероприятия.Intervention КАК Инцидент,
	|	СоответствияСчетов.Процент,
	|	СоответствияСчетов.GUID КАК Идентификатор,
	|	Счета.Expense_code.Type КАК Type
	|ИЗ
	|	РегистрСведений.EDR_СоответствияИнвойсов КАК СоответствияСчетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.EDR_Invoices КАК Счета
	|		ПО СоответствияСчетов.Invoice = Счета.GUID
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.EDR_Interventions КАК Мероприятия
	|		ПО СоответствияСчетов.Intervention = Мероприятия.GUID
	|ГДЕ
	|	СоответствияСчетов.ЗаказНаряд = &ЗаказНаряд"
	);
	Запрос.УстановитьПараметр("ЗаказНаряд", ЗаказНаряд);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаСоответствий.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры //ЗаполнитьСоответствияПоОтбору()

&НаСервере
Процедура ЗаполнитьТоварыПоОтбору()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	EDR_ТоварыДоп.ЗаказНаряд,
	|	ВЫБОР
	|		КОГДА EDR_ТоварыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА EDR_ТоварыДоп.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|						ТОГДА EDR_ТоварыДоп.DiversCode.Наименование
	|					ИНАЧЕ EDR_ТоварыДоп.Номенклатура
	|				КОНЕЦ
	|		ИНАЧЕ ЗаказНарядТовары.Номенклатура
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА EDR_Interventions.Intervention ЕСТЬ NULL 
	|			ТОГДА ""-""
	|		ИНАЧЕ EDR_Interventions.Intervention
	|	КОНЕЦ КАК Инцидент,
	|	ВЫБОР
	|		КОГДА EDR_ТоварыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА EDR_ТоварыДоп.Количество
	|		ИНАЧЕ ЗаказНарядТовары.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА EDR_ТоварыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА 1
	|		ИНАЧЕ ЗаказНарядТовары.Коэффициент
	|	КОНЕЦ КАК Коэффициент,
	|	ВЫБОР
	|		КОГДА EDR_ТоварыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА EDR_ТоварыДоп.Цена
	|		ИНАЧЕ ЗаказНарядТовары.Цена
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА EDR_ТоварыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА 0
	|		ИНАЧЕ ЗаказНарядТовары.СуммаСкидки
	|	КОНЕЦ КАК СуммаСкидки,
	|	ВЫБОР
	|		КОГДА EDR_ТоварыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА EDR_ТоварыДоп.СуммаНДС
	|		ИНАЧЕ ЗаказНарядТовары.СуммаНДС
	|	КОНЕЦ КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА EDR_ТоварыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА EDR_ТоварыДоп.СуммаВсего
	|		ИНАЧЕ ЗаказНарядТовары.СуммаВсего
	|	КОНЕЦ КАК СуммаВсего,
	|	EDR_ТоварыДоп.ПричинаОбращения,
	|	EDR_ТоварыДоп.NotInvoiced КАК НеВключатьВСчет,
	|	EDR_ТоварыДоп.GUID_Товара КАК ИдентификаторТовара,
	|	ВЫБОР
	|		КОГДА EDR_Interventions.Intervention ЕСТЬ NULL 
	|			ТОГДА """"
	|		ИНАЧЕ EDR_ТоварыДоп.GUID_Инцидента
	|	КОНЕЦ КАК ИдентификаторИнцидента,
	|	ВЫБОР
	|		КОГДА EDR_ТоварыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА EDR_ТоварыДоп.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|						ТОГДА EDR_ТоварыДоп.DiversCode.Код
	|					ИНАЧЕ EDR_ТоварыДоп.Номенклатура.Артикул
	|				КОНЕЦ
	|		ИНАЧЕ ЗаказНарядТовары.Номенклатура.Артикул
	|	КОНЕЦ КАК Артикул,
	|	ВЫБОР
	|		КОГДА EDR_ТоварыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА EDR_ТоварыДоп.СтавкаНДС
	|		ИНАЧЕ ЗаказНарядТовары.СтавкаНДС
	|	КОНЕЦ КАК СтавкаНДС,
	|	EDR_ТоварыДоп.СтрокаИзЗаказНаряда,
	|	EDR_ТоварыДоп.DiversCode,  EDR_ТоварыДоп.СрочныйТариф,
	|	ВЫБОР
	|		КОГДА EDR_ТоварыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|				И EDR_ТоварыДоп.ПричинаОбращения = ИСТИНА
	|				И EDR_ТоварыДоп.NotInvoiced = ИСТИНА
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗапретСнятияПричины
	|ИЗ
	|	РегистрСведений.EDR_ТоварыДоп КАК EDR_ТоварыДоп
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.EDR_Interventions КАК EDR_Interventions
	|		ПО EDR_ТоварыДоп.GUID_Инцидента = EDR_Interventions.GUID
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
	|		ПО EDR_ТоварыДоп.ЗаказНаряд = ЗаказНарядТовары.Ссылка
	|			И EDR_ТоварыДоп.Номенклатура = ЗаказНарядТовары.Номенклатура
	|ГДЕ
	|	EDR_ТоварыДоп.ЗаказНаряд = &ЗаказНаряд"
	);
	Запрос.УстановитьПараметр("ЗаказНаряд", ЗаказНаряд);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаТоваров.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // ЗаполнитьТоварыПоОтбору(ЗаказНаряды)

&НаСервере
Процедура ЗаполнитьРаботыПоОтбору()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	EDR_РаботыДоп.ЗаказНаряд,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА EDR_РаботыДоп.АртикулНестандартнойОперации = """"
	|						ТОГДА EDR_РаботыДоп.DiversCode.Наименование
	|					ИНАЧЕ EDR_РаботыДоп.НаименованиеНеСтандартнойОперации
	|				КОНЕЦ
	|		ИНАЧЕ ЗаказНарядРаботы.Работа
	|	КОНЕЦ КАК Работа,
	|	ВЫБОР
	|		КОГДА EDR_Interventions.Intervention ЕСТЬ NULL 
	|			ТОГДА ""-""
	|		ИНАЧЕ EDR_Interventions.Intervention
	|	КОНЕЦ КАК Инцидент,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА EDR_РаботыДоп.Количество
	|		ИНАЧЕ ЗаказНарядРаботы.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА EDR_РаботыДоп.Коэффициент = 0
	|							ИЛИ EDR_РаботыДоп.Коэффициент ЕСТЬ NULL 
	|						ТОГДА 1
	|					ИНАЧЕ EDR_РаботыДоп.Коэффициент
	|				КОНЕЦ
	|		ИНАЧЕ ЗаказНарядРаботы.Коэффициент
	|	КОНЕЦ КАК Коэффициент,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА EDR_РаботыДоп.СуммаСкидки
	|		ИНАЧЕ ЗаказНарядРаботы.СуммаСкидки
	|	КОНЕЦ КАК СуммаСкидки,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА EDR_РаботыДоп.СуммаНДС
	|		ИНАЧЕ ЗаказНарядРаботы.СуммаНДС
	|	КОНЕЦ КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА EDR_РаботыДоп.СуммаВсего
	|		ИНАЧЕ ЗаказНарядРаботы.СуммаВсего
	|	КОНЕЦ КАК СуммаВсего,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА EDR_РаботыДоп.Нормочас
	|		ИНАЧЕ ЗаказНарядРаботы.Нормочас
	|	КОНЕЦ КАК Нормочас,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА EDR_РаботыДоп.Сумма
	|		ИНАЧЕ ЗаказНарядРаботы.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА EDR_Interventions.Intervention ЕСТЬ NULL 
	|			ТОГДА """"
	|		ИНАЧЕ EDR_РаботыДоп.GUID_Инцидента
	|	КОНЕЦ КАК ИдентификаторИнцидента,
	|	EDR_РаботыДоп.GUID_Работы КАК ИдентификаторРаботы,
	|	EDR_РаботыДоп.ПричинаОбращения,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА EDR_РаботыДоп.АртикулНестандартнойОперации = """"
	|						ТОГДА EDR_РаботыДоп.DiversCode.Код
	|					ИНАЧЕ EDR_РаботыДоп.АртикулНестандартнойОперации
	|				КОНЕЦ
	|		ИНАЧЕ ЗаказНарядРаботы.Работа.Артикул
	|	КОНЕЦ КАК Артикул,
	|	EDR_РаботыДоп.РаботаПоЛКМ,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда = ЛОЖЬ
	|			ТОГДА EDR_РаботыДоп.СтавкаНДС
	|		ИНАЧЕ ЗаказНарядРаботы.СтавкаНДС
	|	КОНЕЦ КАК СтавкаНДС,
	|	EDR_РаботыДоп.СтрокаИзЗаказНаряда,
	|	EDR_РаботыДоп.DiversCode,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.АртикулНестандартнойОперации = """"
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК НеСтандартнаяОперация,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.Цена = 0
	|			ТОГДА ВЫБОР
	|					КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда
	|						ТОГДА ЗаказНарядРаботы.Цена
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ EDR_РаботыДоп.Цена
	|	КОНЕЦ КАК Цена
	|ИЗ
	|	РегистрСведений.EDR_РаботыДоп КАК EDR_РаботыДоп
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.EDR_Interventions КАК EDR_Interventions
	|		ПО EDR_РаботыДоп.GUID_Инцидента = EDR_Interventions.GUID
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
	|		ПО EDR_РаботыДоп.ЗаказНаряд = ЗаказНарядРаботы.Ссылка
	|			И EDR_РаботыДоп.GUID_Работы = ЗаказНарядРаботы.ИдентификаторРаботы
	|ГДЕ
	|	EDR_РаботыДоп.ЗаказНаряд = &ЗаказНаряд"
	);
	Запрос.УстановитьПараметр("ЗаказНаряд", ЗаказНаряд);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаРаботы.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры //ЗаполнитьРаботыПоОтбору(ЗаказНаряды)

&НаСервере
Процедура ЗаполнитьФотографииПоОтбору()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрикрепленныеФото.ЗаказНаряд,
	|	ПрикрепленныеФото.UID,
	|	ПрикрепленныеФото.ИмяФайла
	|ИЗ
	|	РегистрСведений.EDR_ПрикрепленныеФото КАК ПрикрепленныеФото
	|ГДЕ
	|	ПрикрепленныеФото.ЗаказНаряд = &ЗаказНаряд";
	
	Запрос.УстановитьПараметр("ЗаказНаряд", ЗаказНаряд);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаФотографий.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // ЗаполнитьФотографииПоОтбору()

&НаСервере
Функция ОбновитьТаблицуПараметровВидовРасходов() Экспорт
	
	Запрос = Новый Запрос;
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	//Счета в МВТ
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаСчетов.ЗаказНаряд,
	|	ТаблицаСчетов.ИдентификаторСчета,
	|	ТаблицаСчетов.ВидРасходов
	|ПОМЕСТИТЬ ТаблицаСчетов
	|ИЗ
	|	&ТаблицаСчетов КАК ТаблицаСчетов"
	;
	Запрос.УстановитьПараметр("ТаблицаСчетов", ТаблицаСчетов.Выгрузить());
	Запрос.Выполнить();
	
	//Соответствия в МВТ
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаСоответствий.ЗаказНаряд,
	|	ТаблицаСоответствий.ИдентификаторСчета,
	|	ТаблицаСоответствий.ИдентификаторИнцидента
	|ПОМЕСТИТЬ ТаблицаСоответствий
	|ИЗ
	|	&ТаблицаСоответствий КАК ТаблицаСоответствий"
	;
	Запрос.УстановитьПараметр("ТаблицаСоответствий", ТаблицаСоответствий.Выгрузить());
	Запрос.Выполнить();
	
	//В запросе заглушены проверки Control_Comm#
	//по требованию гарантийного департамента
	//Для всех видов расходов, кроме 91 OTS, комментарий обязателен!
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаСчетов.ЗаказНаряд КАК ИдентификаторЗаказа,
	|	ТаблицаСчетов.ИдентификаторСчета,
	|	ТаблицаСоответствий.ИдентификаторИнцидента,
	|	ТаблицаСчетов.ВидРасходов,
	|	ТаблицаСчетов.ВидРасходов.Type КАК Type,
	|	ТаблицаСчетов.ВидРасходов.MinAgeDay КАК MinAgeDay,
	|	ТаблицаСчетов.ВидРасходов.MaxAgeDay КАК MaxAgeDay,
	|	ТаблицаСчетов.ВидРасходов.Control_TAPV КАК Control_TAPV,
	|	ТаблицаСчетов.ВидРасходов.Control_NewV КАК Control_NewV,
	|	ТаблицаСчетов.ВидРасходов.Control_EC КАК Control_EC,
	|	ТаблицаСчетов.ВидРасходов.Control_Part КАК Control_Part,
	|	ТаблицаСчетов.ВидРасходов.Control_MD КАК Control_MD,
	|	ВЫБОР
	|		КОГДА ТаблицаСчетов.ВидРасходов = ЗНАЧЕНИЕ(Справочник.EDR_ВидыРасходов.Ex91)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Control_Comm1,
	|	ВЫБОР
	|		КОГДА ТаблицаСчетов.ВидРасходов = ЗНАЧЕНИЕ(Справочник.EDR_ВидыРасходов.Ex91)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Control_Comm2,
	|	ВЫБОР
	|		КОГДА ТаблицаСчетов.ВидРасходов = ЗНАЧЕНИЕ(Справочник.EDR_ВидыРасходов.Ex91)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Control_Comm3,
	|	ТаблицаСчетов.ВидРасходов.Control_Indicator КАК Control_Indicator,
	|	ТаблицаСчетов.ВидРасходов.Control_DiverPart КАК Control_DiverPart,
	|	ТаблицаСчетов.ВидРасходов.Control_DiverOper КАК Control_DiverOper,
	|	ТаблицаСчетов.ВидРасходов.Control_CustomerReq КАК Control_CustomerReq
	|ИЗ
	|	ТаблицаСчетов КАК ТаблицаСчетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСоответствий КАК ТаблицаСоответствий
	|		ПО ТаблицаСчетов.ЗаказНаряд = ТаблицаСоответствий.ЗаказНаряд
	|			И ТаблицаСчетов.ИдентификаторСчета = ТаблицаСоответствий.ИдентификаторСчета
	|ГДЕ
	|	ТаблицаСчетов.ВидРасходов <> ЗНАЧЕНИЕ(Справочник.EDR_ВидыРасходов.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСоответствий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСчетов";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	//Уничтожаем менеджер
	МВТ = Неопределено;
	//
КонецФункции // ОбновитьТаблицуПараметровВидовРасходов()

////#КонецОбласти

////#Область Оформление

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ШрифтУдаления = Новый Шрифт(ШрифтыСтиля.ШрифтТекста, "ШрифтУдаления",,,,, Истина);
	
	УсловноеОформление.Элементы.Очистить();
	
	//
	
////#Область Реквизитыформы
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ГотовностьКОтправке.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отправлен");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255,255,255));
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РангАвторабот.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отправлен");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255,255,255));
	
////#КонецОбласти
	
////#Область ТаблицаФотографии
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаФотографийИмяФайла.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаФотографий.Удалить");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтрицательногоЧисла);
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт",		 ШрифтУдаления);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаФотографийИмяФайла.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаФотографий.НоваяСтрока");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Зеленый);
	
////#КонецОбласти
	
////#Область ТаблицаСчетов
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаСчетовСчет.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаСчетовДатаИнвойса.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаСчетовКатегория.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаСчетовВидРасходов.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаСчетов.Удален");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтрицательногоЧисла);
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт",		 ШрифтУдаления);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаСчетовВидРасходов.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаСчетов.ВидРасходов");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(190,190,190));
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаСчетовСчет.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаСчетов.Отправлен");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаСчетовВидРасходов.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаСчетов.ВидРасходов");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255,69,0));
	
////#КонецОбласти
	
////#Область ТаблицаИнцидентов
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаИнцидентовИнцидент.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаИнцидентовКодОщущенияКлиента.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаИнцидентовФункциональныйКод.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаИнцидентовОтзывнаяНота.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаИнцидентовНомерСогласования.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаИнцидентовНомерСФ.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаИнцидентовДатаСФ.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаИнцидентовПробегПриУстановке.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.Удален");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтрицательногоЧисла);
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт",		 ШрифтУдаления);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона",   Новый Цвет(160,160,160));
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаИнцидентовОтзывнаяНота.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("OTS");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(160,160,160));
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаИнцидентовКодОщущенияКлиента.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.Удален");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.ЕстьСоответствие");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.Control_EC");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.КодОщущенияКлиента");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона",   	 Новый Цвет(255,60,0));
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаИнцидентовКодОщущенияКлиента.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.Удален");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.ЕстьСоответствие");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;                                              
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.Control_EC");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона",   	 Новый Цвет(160,160,160));
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаИнцидентовНомерСогласования.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.НомерСогласованияОбязателен");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.ЕстьСоответствие");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.НомерСогласования");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 0, 0));
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаИнцидентовНомерСогласования.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.НомерСогласованияОбязателен");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.ЕстьСоответствие");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;                                              
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(160,160,160));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//   
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаИнцидентовНомерСФ.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.Удален");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.ЕстьСоответствие");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно; 
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.Type");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "Parts";
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.НомерСФ");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 0, 0));
	
	//   
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаИнцидентовДатаСФ.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.Удален");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.ЕстьСоответствие");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно; 
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.Type");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "Parts";
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.ДатаСФ");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 0, 0));
	
	//   
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаИнцидентовПробегПриУстановке.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.Удален");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.ЕстьСоответствие");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно; 
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.Type");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "Parts";
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.ПробегПриУстановке");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 0, 0));
	
	//   
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаИнцидентовПробегПриУстановке.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаИнцидентовНомерСФ.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаИнцидентовДатаСФ.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.Удален");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.ЕстьСоответствие");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно; 
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.Type");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "";
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона",   	 Новый Цвет(187, 184, 205));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаИнцидентовИнцидент.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаИнцидентовКодОщущенияКлиента.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаИнцидентовФункциональныйКод.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаИнцидентовОтзывнаяНота.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаИнцидентовНомерСогласования.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаИнцидентовНомерСФ.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаИнцидентовДатаСФ.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаИнцидентовПробегПриУстановке.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.Удален");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаИнцидентов.ЕстьСоответствие");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 105, 180));
	
////#КонецОбласти
	
////#Область ТаблицаСоответствий
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаСоответствийСчет.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаСоответствийКатегория.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаСоответствийВидРасходов.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаСоответствийИнцидент.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаСоответствийПроцент.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаСоответствий.Удален");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтрицательногоЧисла);
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт",		 ШрифтУдаления);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона",   Новый Цвет(160,160,160));
	
	//
	
	СписокВидовРасходов = Новый СписокЗначений;
	СписокВидовРасходов.Добавить(Справочники.EDR_ВидыРасходов.Ex57);
	СписокВидовРасходов.Добавить(Справочники.EDR_ВидыРасходов.Ex58);
	СписокВидовРасходов.Добавить(Справочники.EDR_ВидыРасходов.Ex11);
	СписокВидовРасходов.Добавить(Справочники.EDR_ВидыРасходов.Ex19);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаСоответствийПроцент.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаСоответствий.Удален");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаСоответствий.ВидРасходов");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = СписокВидовРасходов;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр",    Ложь);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаСоответствийПроцент.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаСоответствий.Удален");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаСоответствий.ВидРасходов");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
	
	ОтборЭлемента.ПравоеЗначение = СписокВидовРасходов;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр",    Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона",   Новый Цвет(160,160,160));
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстВторостепеннойНадписи);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст",      "-");
	
////#КонецОбласти
	
////#Область ТаблицаРаботы
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыАртикул.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыРабота.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыИнцидент.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыПричинаОбращения.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыРаботаПоЛКМ.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыКоличество.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыКоэффициент.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыНормочас.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыЦена.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыСтавкаНДС.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыСуммаСкидки.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыСуммаНДС.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыСуммаВсего.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаРаботы.Удален");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтрицательногоЧисла);
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт",		 ШрифтУдаления);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыРаботаПоЛКМ.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЛКМ");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Ложь);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыРаботаПоЛКМ.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЛКМ");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыПричинаОбращения.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыРаботаПоЛКМ.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаРаботы.Удален");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыАртикул.Имя);
	
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыРаботаПоЛКМ.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаРаботы.Удален");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаРаботы.СтрокаИзЗаказНаряда");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаРаботы.НеСтандартнаяОперация");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	
	//Элемент = УсловноеОформление.Элементы.Добавить();
	//
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыРаботаПоЛКМ.Имя);
	
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыКоличество.Имя);
	
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыКоэффициент.Имя);
	
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыНормочас.Имя);
	
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыЦена.Имя);
	
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыСтавкаНДС.Имя);
	
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыСуммаСкидки.Имя);
	
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыСуммаНДС.Имя);
	
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыСуммаВсего.Имя);
	
	//ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаРаботы.Удален");
	//ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение = Ложь;
	
	//ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаРаботы.СтрокаИзЗаказНаряда");
	//ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение = Ложь;
	
	//ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаРаботы.НеСтандартнаяОперация");
	//ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение = Ложь;
	
	//Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(250,234,181));
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыРаботаПоЛКМ.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыКоличество.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыКоэффициент.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыНормочас.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыЦена.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыСтавкаНДС.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыСуммаСкидки.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыСуммаНДС.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыСуммаВсего.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаРаботы.Удален");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаРаботы.СтрокаИзЗаказНаряда");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаРаботы.НеСтандартнаяОперация");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Ложь);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыПричинаОбращения.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаРаботы.Удален");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаРаботы.НеСтандартнаяОперация");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыРаботаПоЛКМ.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыКоличество.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыКоэффициент.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыНормочас.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыЦена.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыСтавкаНДС.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыСуммаСкидки.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыСуммаНДС.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыСуммаВсего.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаРаботы.Удален");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаРаботы.НеСтандартнаяОперация");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	                                     
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	//Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона",		 Новый Цвет(250,234,181));
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыРаботаПоЛКМ.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыКоличество.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыКоэффициент.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыНормочас.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыЦена.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыСтавкаНДС.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыСуммаСкидки.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыСуммаНДС.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыСуммаВсего.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаРаботы.Удален");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаРаботы.НеСтандартнаяОперация");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	                                     
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(250,234,181));
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыАртикул.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыРабота.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаРаботы.Удален");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаРаботы.СтрокаИзЗаказНаряда");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаРаботы.НеСтандартнаяОперация");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	                                     
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Ложь);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыКоличество.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыКоэффициент.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыНормочас.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыЦена.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыСтавкаНДС.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыСуммаСкидки.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыСуммаНДС.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыСуммаВсего.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаРаботы.Удален");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаРаботы.СтрокаИзЗаказНаряда");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаРаботы.НеСтандартнаяОперация");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	                                     
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыПричинаОбращения.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаРаботы.ЗапретВводаПричиныОбращения");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	                                     
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыПричинаОбращения.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаРаботы.ЗапретВводаПричиныОбращения");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаРаботы.НеСтандартнаяОперация");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	                                     
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Ложь);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаРаботыИнцидент.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаРаботы.ИдентификаторИнцидента");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	                                     
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255,60,0));
		
////#КонецОбласти

////#Область ТаблицаТоваров

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровАртикул.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровDiversCode.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровНоменклатура.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровИнцидент.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровПричинаОбращения.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровКоличество.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровЦена.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровСуммаСкидки.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровСтавкаНДС.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровСуммаНДС.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровСуммаВсего.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаТоваров.Удален");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	                                     
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтрицательногоЧисла);
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт",		 ШрифтУдаления);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровАртикул.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровDiversCode.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровНоменклатура.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровИнцидент.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровПричинаОбращения.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровКоличество.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровЦена.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровСуммаСкидки.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровСтавкаНДС.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровСуммаНДС.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровСуммаВсего.Имя); 

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаТоваров.Удален");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаТоваров.СтрокаИзЗаказНаряда");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаТоваров.Артикул");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "IP";
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровАртикул.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровDiversCode.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровНоменклатура.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровПричинаОбращения.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровЦена.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровСуммаСкидки.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровСтавкаНДС.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровСуммаНДС.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровСуммаВсего.Имя); 

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаТоваров.Удален");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаТоваров.СтрокаИзЗаказНаряда");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаТоваров.ЗапретСнятияПричины");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	                                     
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровАртикул.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаТоваров.Удален");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаТоваров.СтрокаИзЗаказНаряда");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаТоваров.Артикул");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = "IP";

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаТоваров.ЗапретСнятияПричины");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	                                     
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровDiversCode.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровКоличество.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровЦена.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровСуммаСкидки.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровСтавкаНДС.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровСуммаНДС.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровСуммаВсего.Имя); 

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаТоваров.Удален");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаТоваров.СтрокаИзЗаказНаряда");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаТоваров.Артикул");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = "IP";

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаТоваров.ЗапретСнятияПричины");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	                                     
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(250,234,181));
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровПричинаОбращения.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаТоваров.ЗапретВводаПричиныОбращения");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	                                     
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровИнцидент.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаТоваров.ИдентификаторИнцидента");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	                                     
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255,60,0));
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровКоличество.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровЦена.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровСуммаСкидки.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровСтавкаНДС.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровСуммаНДС.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровСуммаВсего.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаТоваров.ЗапретСнятияПричины");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	                                     
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", 		 Новый Цвет(160,160,160));
	
////#КонецОбласти

КонецПроцедуры // УстановитьУсловноеОформление()

&НаКлиенте
Процедура ОбновитьЗаголовкиКомментариевОбращения(ЭтоАктивация = Ложь)
	
	ТекущаяСтрока = Элементы.ТаблицаИнцидентовИКомментарии.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Элементы.РезультатДиагностик.Заголовок = "Результат диагностики: 	Осталось символов: " + Формат(100 - СтрДлина(ТекущаяСтрока.РезультатДиагностики),"ЧЦ=10; ЧН=-; ЧГ="); 	
	Элементы.ОписаниеЖалобы.Заголовок      = "Жалоба клиента: 	 Осталось символов: "	 + Формат(80  - СтрДлина(ТекущаяСтрока.ОписаниеЖалобы),"ЧЦ=10; ЧН=-; ЧГ="); 	
	Элементы.КомментарийОперации.Заголовок = "Комментарии к инциденту: 	Осталось символов: " + Формат(350 - СтрДлина(ТекущаяСтрока.КомментарийОперации),"ЧЦ=10; ЧН=-; ЧГ="); 	
	
	Если Не ЭтоАктивация И Не Модифицированность Тогда
		Модифицированность = Истина;
	КонецЕсли; 
	
КонецПроцедуры // ОбновитьЗаголовкиКомментариевОбращения()

&НаСервере
Процедура УстановитьДоступность()

	Элементы.ГотовностьКОтправке.ТолькоПросмотр = Отправлен;	
	Элементы.РангАвторабот.ТолькоПросмотр 		= Отправлен;	
	Элементы.ПовторнаяОтправка.ТолькоПросмотр   = Не Отправлен;
	
	Элементы.ТаблицаИнцидентовОтзывнаяНота.ТолькоПросмотр = Не OTS;
	
	Элементы.ТаблицаСчетовКоманднаяПанель.Доступность = (Не Отправлен Или ПовторнаяОтправка);
	Элементы.ТаблицаСчетовКонтекстноеМеню.Доступность = (Не Отправлен Или ПовторнаяОтправка);
	
	Элементы.ТаблицаТоваров.ТолькоПросмотр 						 = Отправлен И Не ПовторнаяОтправка;
	Элементы.ТаблицаТоваровДобавитьDiversCode.Доступность 		 = Не Отправлен;
	Элементы.ТаблицаТоваровВосстановитьСписокДеталей.Доступность = (Не Отправлен Или ПовторнаяОтправка);
	
	Элементы.ТаблицаРаботы.ТолькоПросмотр 					   = Отправлен И Не ПовторнаяОтправка;
	Элементы.ТаблицаРаботыДобавитьDiversCodeРаботы.Доступность = Не Отправлен;
	Элементы.ТаблицаРаботыВосстановитьРаботы.Доступность       = (Не Отправлен Или ПовторнаяОтправка);
	
	Элементы.ТаблицаИнцидентов.ТолькоПросмотр = (Отправлен И Не ПовторнаяОтправка);
	
	Для каждого ЭлементКоманднойПанели Из Элементы.ТаблицаИнцидентовКоманднаяПанель.ПодчиненныеЭлементы Цикл
		
		Если ЭлементКоманднойПанели = Элементы.ТаблицаИнцидентовКомандаИнцидентыICM Тогда
			Продолжить;
		КонецЕсли; 
		
		ЭлементКоманднойПанели.Доступность = (Не Отправлен Или ПовторнаяОтправка);
	
	КонецЦикла; 
	
	Для каждого ЭлементКоманднойПанели Из Элементы.ТаблицаИнцидентовКонтекстноеМеню.ПодчиненныеЭлементы Цикл
		
		Если ЭлементКоманднойПанели = Элементы.ТаблицаИнцидентовКомандаИнцидентыICM Тогда
			Продолжить;
		КонецЕсли; 
		
		ЭлементКоманднойПанели.Доступность = (Не Отправлен Или ПовторнаяОтправка);
	
	КонецЦикла; 
	
	Элементы.ТаблицаСоответствий.ТолькоПросмотр = (Отправлен И Не ПовторнаяОтправка);
	
	Элементы.ТаблицаИнцидентовИКомментарии.ТолькоПросмотр = (Отправлен И Не ПовторнаяОтправка);
	Элементы.ГруппаКомментарииКИнцидентам.ТолькоПросмотр  = (Отправлен И Не ПовторнаяОтправка);	
	
	Если Отправлен и НЕ ПовторнаяОтправка Тогда
		Элементы.ТаблицаТоваровЗаполнитьЦеныПоАктуальномуТарифу.Доступность = Ложь;
	Иначе
		Элементы.ТаблицаТоваровЗаполнитьЦеныПоАктуальномуТарифу.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры // УстановитьДоступность()

&НаСервере
Процедура УстановитьВидимость()

	ВСчетахЕстьТипParts = (ТаблицаСчетов.НайтиСтроки(Новый Структура("Type","Parts")).Количество() > 0);
	
	Элементы.ТаблицаИнцидентовНомерСФ.Видимость 		   = ВСчетахЕстьТипParts;
	Элементы.ТаблицаИнцидентовДатаСФ.Видимость 			   = ВСчетахЕстьТипParts;
	Элементы.ТаблицаИнцидентовПробегПриУстановке.Видимость = ВСчетахЕстьТипParts;
	
	Элементы.ТаблицаИнцидентовОтзывнаяНота.Видимость = OTS;
	
КонецПроцедуры // УстановитьВидимость()

////#КонецОбласти

////#Область Информирование

&НаСервере
Процедура ВывестиОшибкиСКД() Экспорт
	
	ТабличныйДокумент.Очистить();
	
	мОбъект = РеквизитФормыВЗначение("Объект");
	
	СхемаКомпоновкиДанных = мОбъект.ПолучитьМакет("МакетОписанияОшибок");
	
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ВнешнийНаборДанных = Новый Структура("ТаблицаОшибок", ТаблицаОшибок.Выгрузить());
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);	
	
КонецПроцедуры // ВывестиОшибки()

&НаСервере
Процедура ЗаписьЖурнала(ПараметрыЖурнала, УровеньЖурнала = Неопределено, ИмяСобытия = "", 
	Знач КомментарийСПараметрами = "", ИнформацияОбОшибке = Неопределено, 
	Параметр1 = Неопределено, 
	Параметр2 = Неопределено, 
	Параметр3 = Неопределено, 
	Параметр4 = Неопределено
	) Экспорт
	
	// Определение уровня журнала регистрации на основе типа переданного сообщения об ошибке
	Если ТипЗнч(УровеньЖурнала) <> Тип("УровеньЖурналаРегистрации") Тогда
		Если ТипЗнч(ИнформацияОбОшибке) = Тип("Строка") Тогда
			УровеньЖурнала = УровеньЖурналаРегистрации.Предупреждение;
		ИначеЕсли ТипЗнч(ИнформацияОбОшибке) = Тип("ИнформацияОбОшибке") Тогда
			УровеньЖурнала = УровеньЖурналаРегистрации.Ошибка;
		Иначе
			УровеньЖурнала = УровеньЖурналаРегистрации.Информация;
		КонецЕсли;
	КонецЕсли;
	
	// Комментарий для журнала регистрации и пользователя
	Если Параметр1 <> Неопределено Тогда
		КомментарийСПараметрами = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		КомментарийСПараметрами, Параметр1, Параметр2, Параметр3, Параметр4);
	КонецЕсли;
	
	Если ТипЗнч(ИнформацияОбОшибке) = Тип("ИнформацияОбОшибке") Тогда
		Если КомментарийСПараметрами = "" Тогда
			ТестСообщенияПользователю = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
			КомментарийСПараметрами = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		Иначе
			ТестСообщенияПользователю = КомментарийСПараметрами + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
			КомментарийСПараметрами = КомментарийСПараметрами + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		КонецЕсли;
	Иначе
		Если ТипЗнч(ИнформацияОбОшибке) = Тип("Строка") И ИнформацияОбОшибке <> "" Тогда
			КомментарийСПараметрами = КомментарийСПараметрами + Символы.ПС + ИнформацияОбОшибке;
		КонецЕсли;
		ТестСообщенияПользователю = КомментарийСПараметрами;
	КонецЕсли;
	
	// Журнал регистрации 
	УстановитьПривилегированныйРежим(Истина);
	ЗаписьЖурналаРегистрации(
	ПараметрыЖурнала.ГруппаСобытий + ?(ИмяСобытия = "", "", ". "+ ИмяСобытия), 
	УровеньЖурнала, 
	ПараметрыЖурнала.Метаданные, 
	ПараметрыЖурнала.Данные, 
	КомментарийСПараметрами);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если УровеньЖурнала = УровеньЖурналаРегистрации.Ошибка ИЛИ УровеньЖурнала = УровеньЖурналаРегистрации.Предупреждение Тогда
		Если УровеньЖурнала = УровеньЖурналаРегистрации.Ошибка Тогда
			ПараметрыЖурнала.Вставить("БылиОшибки", Истина);
		Иначе
			ПараметрыЖурнала.Вставить("БылиПредупреждения", Истина);
		КонецЕсли;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СокрЛП(ТестСообщенияПользователю); //  + Символы.ПС + Символы.ПС + НСтр("ru='Подробности см. в журнале регистрации.';en='For details, see. In the log.'")
		Сообщение.УстановитьДанные(ПараметрыЖурнала.Данные);
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВЖурналНаСервере(СсылкаНаОбъект,мУровень = "Информация",мКомментарий)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыЖурнала = Новый Структура("ГруппаСобытий, Метаданные, Данные");
	ПараметрыЖурнала.ГруппаСобытий = СокрЛП(СсылкаНаОбъект);
	ПараметрыЖурнала.Метаданные    = СсылкаНаОбъект.Метаданные();
	ПараметрыЖурнала.Данные        = СсылкаНаОбъект;
	
	ЗаписьЖурнала(ПараметрыЖурнала, УровеньЖурналаРегистрации[мУровень], , ,мКомментарий);
	
КонецПроцедуры // ЗаписатьВЖурналНаСервере()

////#КонецОбласти

////#Область Фотографии

&НаКлиенте
Процедура ДобавитьИзображениеНаКлиенте()
	
	ТекущаяСтрока = Элементы.ТаблицаФотографий.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.ИмяФайла) Тогда
		ПросмотретьПрисоединенныйФайл(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьПрисоединенныйФайл(ТекущаяСтрока)
	
	ОчиститьСообщения();
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.ИмяФайла) Тогда
		
		// Открытие Файла.
		Если ЗначениеЗаполнено(ТекущаяСтрока.ПолноеНаименование) Тогда
			ИмяОткрываемогоФайла = СокрЛП(ТекущаяСтрока.ПолноеНаименование);
		Иначе 
			ИмяОткрываемогоФайла = КаталогВременныхФайлов() + ТекущаяСтрока.ИмяФайла;
			
			СтруктураПоиска = Новый Структура("ЗаказНаряд,UID,ИмяФайла");
			ЗаполнитьЗначенияСвойств(СтруктураПоиска,ТекущаяСтрока);
			
			ХранилищеКартинки = ПолучитьДвоичныеДанныеИзображения(СтруктураПоиска);
			
			Если ХранилищеКартинки = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			ФайлКартинки = ХранилищеКартинки.Получить();
			
			Попытка
				ФайлКартинки.Записать(ИмяОткрываемогоФайла);		
			Исключение
				
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				Предупреждение( Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='При открытии файла"
"""%1"""
"произошла ошибка:"
"""%2"".';en='When you open a file"
"""%1"""
"An error has occurred:"
"""% 2"".'"),
					ИмяОткрываемогоФайла,
				ИнформацияОбОшибке.Описание));
				
			КонецПопытки;
			
		КонецЕсли; 
		
		Попытка
			ЗапуститьПриложение(ИмяОткрываемогоФайла);
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			Предупреждение(Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='При открытии файла"
"""%1"""
"произошла ошибка:"
"""%2"".';en='When you open a file"
"""%1"""
"An error has occurred:"
"""% 2"".'"),
				ИмяОткрываемогоФайла,
				ИнформацияОбОшибке.Описание));
		КонецПопытки;
		
		ТекущаяСтрока.ПолноеНаименование = ИмяОткрываемогоФайла;
		
	Иначе
		ТекстСообщения = НСтр("ru='Отсутствует изображение для просмотра';en='No picture to show'");
		Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "АдресКартинки");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДвоичныеДанныеИзображения(ПараметрыПоиска)

	Запрос = Новый Запрос;
	
	Для каждого ПараметрЗапроса Из ПараметрыПоиска Цикл
		Запрос.УстановитьПараметр(ПараметрЗапроса.Ключ,ПараметрЗапроса.Значение);	
	КонецЦикла;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
		|	ПрикрепленныеФото.Данные
		|ИЗ
		|	РегистрСведений.EDR_ПрикрепленныеФото КАК ПрикрепленныеФото
		|ГДЕ
		|	ПрикрепленныеФото.ЗаказНаряд = &ЗаказНаряд
		|	И ПрикрепленныеФото.UID = &UID
		|	И ПрикрепленныеФото.ИмяФайла ПОДОБНО &ИмяФайла";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	Если ВыборкаДетальныеЗаписи.Следующий() И ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
		Возврат ВыборкаДетальныеЗаписи.Данные;
	КонецЕсли; 
	
	Возврат Неопределено;

КонецФункции // ПолучитьДвоичныеДанныеИзображения()

&НаСервере
Процедура ЗаписатьУдалитьИзображенияЗаказНаряда(Отменить = Ложь)

	Для каждого ТекущаяСтрока Из ТаблицаФотографий Цикл
				
		Если Отменить И ТекущаяСтрока.НоваяСтрока Тогда
		
			НаборЗаписей = РегистрыСведений.EDR_ПрикрепленныеФото.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ЗаказНаряд.Установить(ТекущаяСтрока.ЗаказНаряд);
			НаборЗаписей.Отбор.UID.Установить(ТекущаяСтрока.UID);
			
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			
			НаборЗаписей.Записать(Истина);
			
		ИначеЕсли Не Отменить И ТекущаяСтрока.Удалить Тогда 
		
			НаборЗаписей = РегистрыСведений.EDR_ПрикрепленныеФото.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ЗаказНаряд.Установить(ТекущаяСтрока.ЗаказНаряд);
			НаборЗаписей.Отбор.UID.Установить(ТекущаяСтрока.UID);
			
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			
			НаборЗаписей.Записать(Истина);
			
		КонецЕсли; 
		
		ИмяФайлаУдаления = КаталогВременныхФайлов()+СокрЛП(ТекущаяСтрока.ИмяФайла);
		
		Файл = Новый Файл(ИмяФайлаУдаления);
		
		Если Файл.Существует() Тогда
			
			Попытка
				УдалитьФайлы(ИмяФайлаУдаления);
			Исключение
				ЗаписьЖурналаРегистрации("Удаление временного файла изображения",УровеньЖурналаРегистрации.Ошибка,,,КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));	
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла; 		

КонецПроцедуры // ЗаписатьУдалитьИзображенияЗаказНаряда()

&НаСервере
Функция ФильтрФайловИзображений()
	Возврат НСтр("ru = 'Все картинки (*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf)|*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf"
		                            + "|Формат bmp(*.bmp*;*.dib;*.rle)|*.bmp;*.dib;*.rle"
		                            + "|Формат GIF(*.gif*)|*.gif"
		                            + "|Формат JPEG(*.jpeg;*.jpg)|*.jpeg;*.jpg"
		                            + "|Формат PNG(*.png*)|*.png"
		                            + "|Формат TIFF(*.tif)|*.tif"
		                            + "|Формат icon(*.ico)|*.ico"
		                            + "|Формат метафайл(*.wmf;*.emf)|*.wmf;*.emf"
		                            + "|Все файлы(*.*)|*.*'");
									
								КонецФункции

&НаСервереБезКонтекста
Функция ЗаписатьФайлНаСервере(ЗаказНаряд,ПутьКФайлу,ИмяФайла,ИзображениеGUID,ДвоичныеДанныеИзображения)
	
	Попытка
		
		ХранилищеИзображения = Новый ХранилищеЗначения(Новый Картинка(ДвоичныеДанныеИзображения),Новый СжатиеДанных(9));
		
		НаборЗаписей = РегистрыСведений.EDR_ПрикрепленныеФото.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ЗаказНаряд.Установить(ЗаказНаряд);
		НаборЗаписей.Отбор.UID.Установить(ИзображениеGUID);
		
		НоваяСтрока = НаборЗаписей.Добавить();
		НоваяСтрока.UID 	   = ИзображениеGUID;
		НоваяСтрока.ЗаказНаряд = ЗаказНаряд;
		НоваяСтрока.Данные 	   = ХранилищеИзображения;
		НоваяСтрока.ИмяФайла   = ИмяФайла;
		
		НаборЗаписей.Записать(Истина);
		
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции // ЗаписатьФайлНаСервере()

////#КонецОбласти

////#Область СохранениеИзмененийПоДокументу

////#Область РасчетЛКМ

&НаСервере
Функция РассчетЛКМ(ТекстОшибки)
	
	//получим стоимость окраски
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидРемонта", ЗаказНаряд.ВидРемонта);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидыРемонта.ЦенаЛКМ
		|ИЗ
		|	РегистрСведений.Renault_ВидыРемонтаДопРеквизиты КАК ВидыРемонта
		|ГДЕ
		|	ВидыРемонта.ВидРемонта = &ВидРемонта
		|	И ЕСТЬNULL(ВидыРемонта.ЦенаЛКМ, 0) <> 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ЦенаКраски = 490;
	
	Если Выборка.Следующий() Тогда
		ЦенаКраски = Выборка.ЦенаЛКМ;
	КонецЕсли;
	
	РезультатЗапроса = Неопределено;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТекДата",		ТекущаяДата());
	Запрос.УстановитьПараметр("ЗаказНаряд",		ЗаказНаряд);
	Запрос.УстановитьПараметр("ТаблицаРабот",	ТаблицаРаботы.Выгрузить());
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаРабот.ИдентификаторРаботы,
	|	ТаблицаРабот.ЗаказНаряд,
	|	ТаблицаРабот.Работа
	|ПОМЕСТИТЬ ТЗРабот
	|ИЗ
	|	&ТаблицаРабот КАК ТаблицаРабот
	|ГДЕ
	|	ТаблицаРабот.ЗаказНаряд = &ЗаказНаряд
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЗРабот.ИдентификаторРаботы,
	|	ТЗРабот.ЗаказНаряд,
	|	ТЗРабот.Работа,
	|	Автоработы.Артикул
	|ПОМЕСТИТЬ ВремТЗ
	|ИЗ
	|	ТЗРабот КАК ТЗРабот
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Автоработы КАК Автоработы
	|		ПО ТЗРабот.Работа = Автоработы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТЗРабот
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремТЗ.ИдентификаторРаботы,
	|	ВремТЗ.Работа
	|ИЗ
	|	РегистрСведений.OPERACODE_НормыРабот.СрезПоследних(&ТекДата, ВидРабот = ЗНАЧЕНИЕ(Перечисление.OPERACODE_ВидыРабот.P)) КАК OPERACODE_НормыРаботСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремТЗ КАК ВремТЗ
	|		ПО OPERACODE_НормыРаботСрезПоследних.КодПоКаталогу = ВремТЗ.Артикул
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремТЗ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаМалярныхРабот = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаМалярныхРабот.Следующий() Цикл
		
		НайденныеСтроки = ТаблицаРаботы.НайтиСтроки(Новый Структура("ИдентификаторРаботы, РаботаПоЛКМ", ВыборкаМалярныхРабот.ИдентификаторРаботы, Ложь));
		
		Для каждого СтрокаРабот Из НайденныеСтроки Цикл
			СтрокаРабот.РаботаПоЛКМ = Истина;
		КонецЦикла; 
		
	КонецЦикла; 
	
	РезультатЗапроса = Неопределено;
	
	СтруктураПоиска = Новый Структура("ЗаказНаряд,РаботаПоЛКМ",ЗаказНаряд,Истина);
	
	СтрокиДляПокраски = ТаблицаРаботы.НайтиСтроки(СтруктураПоиска);
	
	Если СтрокиДляПокраски.Количество() = 0 Тогда
		
		ТекстОшибки = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='По заказ-наряду:"
"""%1"""
"Запись изменений прервана по причине:"
"""%2"".';en='According to the order, as well as:"
"""%1"""
"Record changes canceled due to:"
"""% 2"".'"),
			"№ "+СокрЛП(ЗаказНаряд.Номер) + " от " + Формат(ЗаказНаряд.Дата,"ДФ=dd.MM.yyyy; ДП=-"),
			"Не указаны работы для расчета количества ЛКМ");
			
		Возврат Ложь;
		
	КонецЕсли;
	
	СтрокиДляПокраски = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаРабот", ТаблицаРаботы.Выгрузить());
	Запрос.УстановитьПараметр("ЦенаКраски",	  ЦенаКраски);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(ТаблицаРабот.ЗаказНаряд КАК Документ.ЗаказНаряд) КАК ЗаказНаряд,
		|	ВЫРАЗИТЬ(ТаблицаРабот.ИдентификаторИнцидента КАК СТРОКА(50)) КАК ИдентификаторИнцидента,
		|	ВЫРАЗИТЬ(ТаблицаРабот.Инцидент КАК СТРОКА(1)) КАК Инцидент,
		|	ВЫРАЗИТЬ(ТаблицаРабот.СтавкаНДС КАК Справочник.СтавкиНДС) КАК СтавкаНДС,
		|	ВЫРАЗИТЬ(ТаблицаРабот.Количество КАК ЧИСЛО(15, 3)) КАК Количество,
		|	ВЫРАЗИТЬ(ТаблицаРабот.Коэффициент КАК ЧИСЛО(7, 2)) КАК Коэффициент,
		|	ВЫРАЗИТЬ(ТаблицаРабот.РаботаПоЛКМ КАК БУЛЕВО) КАК РаботаПоЛКМ
		|ПОМЕСТИТЬ мТаблицаРабот
		|ИЗ
		|	&ТаблицаРабот КАК ТаблицаРабот
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	мТаблицаРабот.ИдентификаторИнцидента КАК ИдентификаторИнцидента,
		|	мТаблицаРабот.Инцидент КАК Инцидент,
		|	мТаблицаРабот.ЗаказНаряд
		|ИЗ
		|	мТаблицаРабот КАК мТаблицаРабот
		|ГДЕ
		|	мТаблицаРабот.РаботаПоЛКМ
		|
		|СГРУППИРОВАТЬ ПО
		|	мТаблицаРабот.ЗаказНаряд,
		|	мТаблицаРабот.ИдентификаторИнцидента,
		|	мТаблицаРабот.Инцидент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	мТаблицаРабот.СтавкаНДС КАК СтавкаНДС,
		|	мТаблицаРабот.ЗаказНаряд
		|ИЗ
		|	мТаблицаРабот КАК мТаблицаРабот
		|ГДЕ
		|	мТаблицаРабот.РаботаПоЛКМ
		|
		|СГРУППИРОВАТЬ ПО
		|	мТаблицаРабот.ЗаказНаряд,
		|	мТаблицаРабот.СтавкаНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	мТаблицаРабот.ЗаказНаряд КАК ЗаказНаряд,
		|	СУММА(мТаблицаРабот.Количество * мТаблицаРабот.Коэффициент) КАК Длительность,
		|	мТаблицаРабот.СтавкаНДС КАК СтавкаНДС,
		|	ЕСТЬNULL(мТаблицаРабот.СтавкаНДС.Ставка, 0) КАК СтавкаПоНДС,
		|	мТаблицаРабот.Инцидент
		|ПОМЕСТИТЬ ВТ_Расчет
		|ИЗ
		|	мТаблицаРабот КАК мТаблицаРабот
		|ГДЕ
		|	мТаблицаРабот.РаботаПоЛКМ
		|
		|СГРУППИРОВАТЬ ПО
		|	мТаблицаРабот.ЗаказНаряд,
		|	мТаблицаРабот.СтавкаНДС,
		|	ЕСТЬNULL(мТаблицаРабот.СтавкаНДС.Ставка, 0),
		|	мТаблицаРабот.Инцидент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ мТаблицаРабот
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Расчет.ЗаказНаряд КАК ЗаказНаряд,
		|	ВТ_Расчет.Длительность КАК КоличествоКраски,
		|	ВТ_Расчет.СтавкаНДС КАК СтавкаНДС,
		|	ВТ_Расчет.СтавкаПоНДС КАК СтавкаПоНДС,
		|	ВТ_Расчет.Длительность * &ЦенаКраски * (1 - ВТ_Расчет.СтавкаПоНДС / 100) КАК СтоимостьКраски,
		|	ВТ_Расчет.Длительность * &ЦенаКраски * (ВТ_Расчет.СтавкаПоНДС / 100) КАК НДСКраски
		|ИЗ
		|	ВТ_Расчет КАК ВТ_Расчет";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаИнцидентов   = РезультатЗапроса[1].Выбрать();
	
	//Временно... если будут проблемы, то раскоментировать
	//Если ВыборкаИнцидентов.Количество() > 1 Тогда
	//		
	//	ТекстОшибки = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	//		НСтр("ru = 'По заказ-наряду:
	//		|""%1""
	//		|Запись изменений прервана по причине:
	//		|""%2"".'"),
	//		"№ "+СокрЛП(ЗаказНаряд.Номер) + " от " + Формат(ЗаказНаряд.Дата,"ДФ=dd.MM.yyyy; ДП=-"),
	//		"Работы для расчета количества ЛКМ распределены на несколько инцидентов");
	//		
	//	Возврат Ложь;
	//		
	//КонецЕсли; 
	
	ВыборкаСтавокНДС = РезультатЗапроса[2].Выбрать();
	
	//Временно... если будут проблемы, то раскоментировать
	//Если ВыборкаСтавокНДС.Количество() > 1 Тогда
	//		
	//	ТекстОшибки = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	//		НСтр("ru = 'По заказ-наряду:
	//		|""%1""
	//		|Запись изменений прервана по причине:
	//		|""%2"".'"),
	//		"№ "+СокрЛП(ЗаказНаряд.Номер) + " от " + Формат(ЗаказНаряд.Дата,"ДФ=dd.MM.yyyy; ДП=-"),
	//		"Работы для расчета количества ЛКМ распределены на несколько ставок НДС");
	//		
	//	Возврат Ложь;
	//	
	//КонецЕсли; 
	
	ВыборкаРасчет = РезультатЗапроса[5].Выбрать();
	ВыборкаРасчет.Следующий();
	
	Пока ВыборкаИнцидентов.Следующий() Цикл
		
		СтруктураПоиска = Новый Структура("ЗаказНаряд, РаботаПоЛКМ, Инцидент", ЗаказНаряд, Истина, ВыборкаИнцидентов.Инцидент);
		
		НайденныеСтроки = ТаблицаРаботы.НайтиСтроки(СтруктураПоиска);
		
		СколькоВсегоКоличество = 0;
		
		Для Каждого Строка из НайденныеСтроки Цикл
			
			СколькоВсегоКоличество = СколькоВсегоКоличество+Строка.Количество * Строка.Коэффициент;
			
		КонецЦикла;
		
		Если НайденныеСтроки.Количество() > 0  Тогда
			ПравильнаяСтрока = НайденныеСтроки[0];
			
			КоличествоКраски = СколькоВсегоКоличество;
			СтоимостьКраски  = ЦенаКраски*КоличествоКраски;
			НДСКраски        = ВыборкаРасчет.НДСКраски;
			СтавкаНДС        = ВыборкаРасчет.СтавкаНДС;
			
		Иначе 
			
			КоличествоКраски = ВыборкаРасчет.КоличествоКраски;
			СтоимостьКраски  = ВыборкаРасчет.СтоимостьКраски;
			НДСКраски        = ВыборкаРасчет.НДСКраски;
			СтавкаНДС        = ВыборкаРасчет.СтавкаНДС;
			
		КонецЕсли; 
		
		СтруктураПоиска = Новый Структура("ЗаказНаряд, Артикул, Инцидент",ЗаказНаряд, "IP", ВыборкаИнцидентов.Инцидент);
		
		НайденныеСтроки = ТаблицаТоваров.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() > 0  Тогда
			СтрокаСКраской = НайденныеСтроки[0];
		Иначе 
			СтрокаСКраской = ТаблицаТоваров.Добавить();
		КонецЕсли; 
		
		СтрокаСКраской.ЗаказНаряд			  = ЗаказНаряд;
		СтрокаСКраской.ИдентификаторИнцидента = ВыборкаИнцидентов.ИдентификаторИнцидента;
		СтрокаСКраской.Инцидент				  = ВыборкаИнцидентов.Инцидент;
		СтрокаСКраской.ИдентификаторТовара	  = Строка(Новый УникальныйИдентификатор());
		СтрокаСКраской.Артикул				  = Справочники.EDR_DiversCode.IP.Код;
		СтрокаСКраской.DiversCode			  = Справочники.EDR_DiversCode.IP;
		СтрокаСКраской.Номенклатура			  = Справочники.EDR_DiversCode.IP.Наименование;
		СтрокаСКраской.Количество			  = КоличествоКраски;
		СтрокаСКраской.СуммаВсего			  = СтоимостьКраски;
		СтрокаСКраской.СтавкаНДС			  = СтавкаНДС;
		СтрокаСКраской.Цена					  = ЦенаКраски;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // РассчетЛКМ()

////#КонецОбласти

////#Область ПроверкаКорректности

&НаСервере
Функция ПроверитьНаКорректность(ЭтоОшибкиРаботыТовары = Ложь, Отказ = Ложь)
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	СтруктураПараметров = Новый Структура("ЗаказНаряд,СемействоАвтомобиля,ГотовностьКОтправке,ЛКМ,OTS,ПовторнаяОтправка,Отправлен,ПробегАвтомобиля,ДатаОткрытия");
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, ЭтаФорма);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Для каждого ТекущийПараметр Из СтруктураПараметров Цикл
		Запрос.УстановитьПараметр(ТекущийПараметр.Ключ,ТекущийПараметр.Значение);
	КонецЦикла; 
	
	Запрос.УстановитьПараметр("ТекущаяДата",	   НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Заявки", 		   ТаблицаСчетов.Выгрузить());
	Запрос.УстановитьПараметр("Инциденты",		   ТаблицаИнцидентов.Выгрузить());
	Запрос.УстановитьПараметр("СоответсвияСчетов", ТаблицаСоответствий.Выгрузить());
	Запрос.УстановитьПараметр("ТабНоменклатура",   ТаблицаТоваров.Выгрузить());
	Запрос.УстановитьПараметр("Работы", 		   ТаблицаРаботы.Выгрузить());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&ЗаказНаряд КАК ЗаказНаряд,
	|	&OTS КАК OTS,
	|	&ГотовностьКОтправке КАК ГотовностьКОтправке,
	|	&ПовторнаяОтправка КАК ПовторнаяОтправка,
	|	&Отправлен КАК Отправлен,
	|	&ДатаОткрытия КАК ДатаОткрытия,
	|	&СемействоАвтомобиля КАК СемействоАвтомобиля,
	|	&ЛКМ КАК ЛКМ,
	|	&ПробегАвтомобиля КАК ПробегАвтомобиля,
	|	ВЫБОР
	|		КОГДА &Отправлен = ИСТИНА
	|				И &ПовторнаяОтправка = ИСТИНА
	|			ТОГДА ИСТИНА
	|		КОГДА &Отправлен = ИСТИНА
	|				И &ПовторнаяОтправка = ЛОЖЬ
	|			ТОГДА ЛОЖЬ
	|		КОГДА &Отправлен = ЛОЖЬ
	|				И &ПовторнаяОтправка = ЛОЖЬ
	|				И &ГотовностьКОтправке = ИСТИНА
	|			ТОГДА ИСТИНА
	|	КОНЕЦ КАК ПризнакОтбора
	|ПОМЕСТИТЬ ЗаказНаряды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказНаряды.ЗаказНаряд,
	|	ЗаказНаряды.OTS,
	|	ЗаказНаряды.ГотовностьКОтправке,
	|	ЗаказНаряды.ПовторнаяОтправка,
	|	ЗаказНаряды.Отправлен,
	|	ЗаказНаряды.ДатаОткрытия,
	|	ЗаказНаряды.СемействоАвтомобиля,
	|	ЗаказНаряды.ЛКМ,
	|	ЗаказНаряды.ПробегАвтомобиля,
	|	&ТекущаяДата,
	|	ВЫБОР
	|		КОГДА ЗаказНаряды.ПовторнаяОтправка
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РАЗНОСТЬДАТ(&ТекущаяДата, ЗаказНаряды.ДатаОткрытия, ДЕНЬ) < 30
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|	КОНЕЦ КАК ТребоватьСогласование
	|ПОМЕСТИТЬ ПаттерныЗН
	|ИЗ
	|	ЗаказНаряды КАК ЗаказНаряды
	|ГДЕ
	|	ЗаказНаряды.ПризнакОтбора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ЗаказНаряды"
	;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	//Получаем паттерн Заявок в менеджер ВТ
	ТекстЗапроса = "ВЫБРАТЬ
	|	Заявки.ЗаказНаряд,
	|	Заявки.Счет,
	|	Заявки.ИдентификаторСчета,
	|	Заявки.Категория,
	|	Заявки.ДатаИнвойса,
	|	Заявки.ВидРасходов,
	|	Заявки.Удален,
	|	Заявки.СчетФактура
	|ПОМЕСТИТЬ Заявки
	|ИЗ
	|	&Заявки КАК Заявки
	|ГДЕ
	|	Не Заявки.Удален
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Заявки.ЗаказНаряд КАК ЗаказНаряд,
	|	Заявки.Счет,
	|	Заявки.ИдентификаторСчета,
	|	Заявки.Категория,
	|	Заявки.ДатаИнвойса,
	|	Заявки.ВидРасходов,
	|	Заявки.Удален,
	|	Заявки.СчетФактура
	|ПОМЕСТИТЬ ПаттерныЗаявок
	|ИЗ
	|	Заявки КАК Заявки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПаттерныЗН КАК ПаттерныЗН
	|		ПО Заявки.ЗаказНаряд = ПаттерныЗН.ЗаказНаряд
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Заявки"
	;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	//Получаем паттерн соответсвий в менеджер ВТ
	//Из соответсвия потом получим какие инциденты нам нужны.
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СоответсвияСчетов.ЗаказНаряд,
	|	СоответсвияСчетов.ИдентификаторСчета,
	|	СоответсвияСчетов.ИдентификаторИнцидента,
	|	СоответсвияСчетов.Процент,
	|	СоответсвияСчетов.ВидРасходов,
	|	СоответсвияСчетов.Категория
	|ПОМЕСТИТЬ Распределения
	|ИЗ
	|	&СоответсвияСчетов КАК СоответсвияСчетов
	|ГДЕ
	|	СоответсвияСчетов.Удален = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПаттерныРаспределения.ЗаказНаряд,
	|	ПаттерныРаспределения.ИдентификаторСчета,
	|	ПаттерныРаспределения.ИдентификаторИнцидента,
	|	ПаттерныРаспределения.Процент,
	|	ПаттерныРаспределения.ВидРасходов,
	|	ПаттерныРаспределения.Категория
	|ПОМЕСТИТЬ ПаттерныРаспределения
	|ИЗ
	|	Распределения КАК ПаттерныРаспределения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПаттерныЗН КАК ПаттерныЗН
	|		ПО ПаттерныРаспределения.ЗаказНаряд = ПаттерныЗН.ЗаказНаряд
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Распределения"
	;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	//Получаем паттерн инцидентов в менеджер ВТ
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Инциденты.Инцидент,
	|	Инциденты.ИдентификаторИнцидента,
	|	Инциденты.КодОщущенияКлиента,
	|	Инциденты.ФункциональныйКод,
	|	Инциденты.НомерСогласования,
	|	Инциденты.ОтзывнаяНота,
	|	Инциденты.НомерСФ,
	|	Инциденты.ДатаСФ,
	|	Инциденты.ПробегПриУстановке,
	|	Инциденты.ОписаниеОперации,
	|	Инциденты.ОписаниеЖалобы,
	|	Инциденты.КомментарийОперации,
	|	Инциденты.ЗаказНаряд
	|ПОМЕСТИТЬ Инциденты
	|ИЗ
	|	&Инциденты КАК Инциденты
	|ГДЕ
	|	Инциденты.Удален = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПаттерныРаспределения.ИдентификаторИнцидента,
	|	ПаттерныРаспределения.ВидРасходов.Control_Indicator КАК ТребоватьПричину,
	|	ПаттерныРаспределения.ВидРасходов
	|ПОМЕСТИТЬ ВТТребоватьПричину
	|ИЗ
	|	ПаттерныРаспределения КАК ПаттерныРаспределения
	|ГДЕ
	|	(ПаттерныРаспределения.ВидРасходов.Control_Indicator = ИСТИНА
	|			ИЛИ ПаттерныРаспределения.ВидРасходов = ЗНАЧЕНИЕ(Справочник.EDR_ВидыРасходов.Ex91))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Инциденты.ЗаказНаряд,
	|	Инциденты.Инцидент,
	|	Инциденты.ИдентификаторИнцидента,
	|	Инциденты.КодОщущенияКлиента,
	|	Инциденты.ФункциональныйКод,
	|	Инциденты.НомерСогласования,
	|	Инциденты.ОтзывнаяНота,
	|	Инциденты.НомерСФ,
	|	Инциденты.ДатаСФ,
	|	Инциденты.ПробегПриУстановке,
	|	Инциденты.ОписаниеОперации,
	|	Инциденты.ОписаниеЖалобы,
	|	Инциденты.КомментарийОперации,
	|	ВЫБОР
	|		КОГДА ВТТребоватьПричину.ТребоватьПричину = ИСТИНА
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТребоватьПричину,
	|	ВЫБОР
	|		КОГДА ВТТребоватьПричину.ВидРасходов = ЗНАЧЕНИЕ(Справочник.EDR_ВидыРасходов.Ex91)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТребоватьЖалобуКомментарий,
	|	ВТТребоватьПричину.ВидРасходов
	|ПОМЕСТИТЬ ПаттерныИнцидентов
	|ИЗ
	|	Инциденты КАК Инциденты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПаттерныЗН КАК ПаттерныЗН
	|		ПО Инциденты.ЗаказНаряд = ПаттерныЗН.ЗаказНаряд
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТребоватьПричину КАК ВТТребоватьПричину
	|		ПО Инциденты.ИдентификаторИнцидента = ВТТребоватьПричину.ИдентификаторИнцидента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТТребоватьПричину
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Инциденты"
	;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	ТекстЗапроса = "
	|Выбрать * 
	|ПОМЕСТИТЬ ПаттерныНоменклатуры
	|Из
	|  &ТабНоменклатура как ТабНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|Выбрать * 
	|ПОМЕСТИТЬ ПаттерныРабот
	|Из
	|  &Работы как ТабРаботы"
	;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	///////////////////////////////////
	////	Начинаем проверки
	//
	
	ДатаРелиза = Константы.EDR_ДатаРелиза.Получить();
	
	Если НЕ ЗначениеЗаполнено(ДатаРелиза) тогда
		
		НС = ТаблицаОшибок.Добавить();
		НС.ЗаказНаряд	  = "-";
		НС.Заявка		  = "-";
		НС.Инцидент		  = "-";
		НС.Объект		  = "Константа ""Дата релиза""";
		НС.ОписаниеОшибки = "Не заполнена константа Дата релиза.";
		
	КонецЕсли;
	
	ПроверитьВалюты(МВТ, ТаблицаОшибок);
	
	ПроверитьПроизводителей(МВТ, ТаблицаОшибок);
	
	ПроверитьНомераСогласования(МВТ, ТаблицаОшибок);
	
	ПроверитьПустыеКомментарии(МВТ, ТаблицаОшибок);
	
	ПроверитьЗаполнениеПолейИнцидентов(МВТ, ТаблицаОшибок, Отказ);
	
	ПроверитьЗаполнениеКатегорииЗаявок(МВТ, ТаблицаОшибок);
	
	ПроверитьЗаполнениеКодСтатьиРасходовЗаявок(МВТ, ТаблицаОшибок);
	
	ПроверитьПустыеЗаявки(МВТ, ТаблицаОшибок);
	
	ПроверитьПотерянныеИнциденты(МВТ, ТаблицаОшибок);
	
	ПроверитьКодРасходов_19(МВТ, ТаблицаОшибок);
	
	ПроверитьНоменклатуруИАвтоработыНаСоответствие(МВТ, ТаблицаОшибок,ТаблицаОшибокРаботыТовары);
	
	ПроверитьПричиныОбращения(МВТ, ТаблицаОшибок);
	
	Если ТаблицаОшибок.Количество() > 0 тогда //Есть ошибки
		
		ВсеНормально = Ложь;
		
		Если ТаблицаОшибокРаботыТовары.Количество() = ТаблицаОшибок.Количество() Тогда
			ЭтоОшибкиРаботыТовары = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТаблицаОшибок.Количество() > 0 тогда //Есть ошибки
		Возврат Ложь;
	КонецЕсли;
	
	//Удаляем все временные таблицы
	МВТ = Неопределено;
		
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ПроверитьВалюты(МВТ, ТаблицаОшибок) 

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ПаттерныЗН.ЗаказНаряд.ВалютаДокумента КАК Валюта
	|ПОМЕСТИТЬ ОшибкиВалюты
	|ИЗ
	|	ПаттерныЗН КАК ПаттерныЗН
	|ГДЕ
	|	""RUB"" = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""-"" КАК ЗаказНаряд,
	|	""-"" КАК Заявка,
	|	""-"" КАК Инцидент,
	|	""Валюта "" + ОшибкиВалюты.Валюта.Наименование КАК Объект,
	|	""Не заполнен код валюты по ISO"" КАК ОписаниеОшибки
	|ИЗ
	|	ОшибкиВалюты КАК ОшибкиВалюты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОшибкиВалюты"
	;
	Запрос.Текст = ТекстЗапроса;
	
	СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок);
	
КонецПроцедуры // ПроверитьВалюты(МВТ, ТаблицаОшибок)

&НаСервере
Процедура ПроверитьПроизводителей(МВТ, ТаблицаОшибок) 

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ПаттерныЗН.ЗаказНаряд,
	|	ПаттерныЗН.ЗаказНаряд.Автомобиль КАК Автомобиль
	|ПОМЕСТИТЬ ВТПроизводители
	|ИЗ
	|	ПаттерныЗН КАК ПаттерныЗН
	|ГДЕ
	|	ПаттерныЗН.ЗаказНаряд.Автомобиль.Модель.Производитель = ЗНАЧЕНИЕ(Справочник.Производители.ПустаяСсылка)
	//Добавлена проверка на Марку MO 2015.01.12
	| И ПаттерныЗН.ЗаказНаряд.Автомобиль.Модель НЕ В (&МоделиМарки)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПаттерныЗН.ЗаказНаряд.Автомобиль,
	|	ПаттерныЗН.ЗаказНаряд
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПроизводители.ЗаказНаряд,
	|	""-"" КАК Заявка,
	|	""-"" КАК Инцидент,
	|	ВТПроизводители.Автомобиль КАК Объект,
	|	""У модели автомобиля не указан производитель"" КАК ОписаниеОшибки
	|ИЗ
	|	ВТПроизводители КАК ВТПроизводители
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПроизводители"
	;
	
	//Добавлена проверка на Марку MO 2015.01.12
	Запрос.УстановитьПараметр("МоделиМарки", Справочники.CRM_МаркаАвтомобиля.RENAULT.МоделиАвтомобилей.ВыгрузитьКолонку("Модель"));	
	
	Запрос.Текст = ТекстЗапроса;
	
	СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок);
	
КонецПроцедуры // ПроверитьПроизводителей(МВТ, ТаблицаОшибок)

&НаСервере
Процедура ПроверитьНомераСогласования(МВТ, ТаблицаОшибок)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПаттерныЗН.ЗаказНаряд КАК ЗаказНаряд,
	|	ПаттерныЗН.ТребоватьСогласование
	|ПОМЕСТИТЬ Заказы
	|ИЗ
	|	ПаттерныЗН КАК ПаттерныЗН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПаттерныРаспределения.ИдентификаторСчета,
	|	ПаттерныРаспределения.ИдентификаторИнцидента,
	|	ПаттерныРаспределения.ЗаказНаряд,
	|	ПаттерныРаспределения.ВидРасходов
	|ПОМЕСТИТЬ Распределение
	|ИЗ
	|	ПаттерныРаспределения КАК ПаттерныРаспределения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Заказы КАК Заказы
	|		ПО ПаттерныРаспределения.ЗаказНаряд = Заказы.ЗаказНаряд
	|ГДЕ
	|	ПаттерныРаспределения.ВидРасходов = ЗНАЧЕНИЕ(Справочник.EDR_ВидыРасходов.Ex57)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПаттерныИнцидентов.ЗаказНаряд,
	|	ПаттерныИнцидентов.Инцидент,
	|	ПаттерныИнцидентов.НомерСогласования
	|ПОМЕСТИТЬ ИнцидентыБезСогласования
	|ИЗ
	|	ПаттерныИнцидентов КАК ПаттерныИнцидентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Распределение КАК Распределение
	|		ПО ПаттерныИнцидентов.ИдентификаторИнцидента = Распределение.ИдентификаторИнцидента
	|ГДЕ
	|	ПаттерныИнцидентов.НомерСогласования = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Заказы.ЗаказНаряд
	|ПОМЕСТИТЬ ЗаказыСОбязательнымСогласованием
	|ИЗ
	|	Заказы КАК Заказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Распределение КАК Распределение
	|		ПО Заказы.ЗаказНаряд = Распределение.ЗаказНаряд
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Заказы.ЗаказНаряд
	|ИЗ
	|	Заказы КАК Заказы
	|ГДЕ
	|	Заказы.ТребоватьСогласование = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Заказы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Распределение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыСОбязательнымСогласованием.ЗаказНаряд КАК ЗаказНаряд,
	|	ИнцидентыБезСогласования.Инцидент КАК Инцидент,
	|	""-"" КАК Заявка,
	|	""Номер согласования"" КАК Объект,
	|	""Не заполнен номер согласования"" КАК ОписаниеОшибки
	|ИЗ
	|	ЗаказыСОбязательнымСогласованием КАК ЗаказыСОбязательнымСогласованием
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИнцидентыБезСогласования КАК ИнцидентыБезСогласования
	|		ПО ЗаказыСОбязательнымСогласованием.ЗаказНаряд = ИнцидентыБезСогласования.ЗаказНаряд
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ЗаказыСОбязательнымСогласованием
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ИнцидентыБезСогласования"
	;
	
	Запрос.Текст = ТекстЗапроса;
	
	СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьПустыеКомментарии(МВТ, ТаблицаОшибок)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	// Комментарий 
	//Дата создания - 09.04.2012 16:31:25; Автор - Окипний Андрей Евгеньевич
	//
	//Выполним поиск пустых комментариев и жалоб клиента
	//Всю проверку сделаем одним пакетным запросом. 
	//
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПаттерныИнцидентов.ИдентификаторИнцидента,
	|	ПаттерныИнцидентов.ЗаказНаряд,
	|	ПаттерныИнцидентов.Инцидент,
	|	ПаттерныИнцидентов.КодОщущенияКлиента,
	|	ПаттерныИнцидентов.ФункциональныйКод,
	|	ПаттерныИнцидентов.НомерСогласования,
	|	ПаттерныИнцидентов.ОтзывнаяНота,
	|	ПаттерныИнцидентов.НомерСФ,
	|	ПаттерныИнцидентов.ДатаСФ,
	|	ПаттерныИнцидентов.ПробегПриУстановке,
	|	ПаттерныИнцидентов.ОписаниеОперации,
	|	ПаттерныИнцидентов.ОписаниеЖалобы,
	|	ПаттерныИнцидентов.КомментарийОперации,
	|	ПаттерныИнцидентов.ТребоватьЖалобуКомментарий,
	|	ПаттерныИнцидентов.ВидРасходов
	|ПОМЕСТИТЬ ВремИнциденты
	|ИЗ
	|	ПаттерныИнцидентов КАК ПаттерныИнцидентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремИнциденты.ЗаказНаряд,
	|	ВремИнциденты.Инцидент,
	|	""-"" КАК Заявка,
	|	""Комментарий"" КАК Объект,
	|	""Не указан комментарий"" КАК ОписаниеОшибки
	|ПОМЕСТИТЬ ОшибкиКомментарии
	|ИЗ
	|	ВремИнциденты КАК ВремИнциденты
	|ГДЕ
	|	ВремИнциденты.КомментарийОперации = """"
	|	И ВремИнциденты.ТребоватьЖалобуКомментарий = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремИнциденты.ЗаказНаряд,
	|	ВремИнциденты.Инцидент,
	|	""-"" КАК Заявка,
	|	""Жалоба клиента"" КАК Объект,
	|	""Не указана жалоба клиента"" КАК ОписаниеОшибки
	|ПОМЕСТИТЬ ОшибкиЖалобы
	|ИЗ
	|	ВремИнциденты КАК ВремИнциденты
	|ГДЕ
	|	ПОДСТРОКА(ВремИнциденты.ОписаниеЖалобы, 0, 1000) = """"
	|	И ВремИнциденты.ТребоватьЖалобуКомментарий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОшибкиКомментарии.ЗаказНаряд КАК ЗаказНаряд,
	|	ОшибкиКомментарии.Инцидент КАК Инцидент,
	|	ОшибкиКомментарии.Заявка КАК Заявка,
	|	ОшибкиКомментарии.Объект КАК Объект,
	|	ОшибкиКомментарии.ОписаниеОшибки КАК ОписаниеОшибки
	|ИЗ
	|	ОшибкиКомментарии КАК ОшибкиКомментарии
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОшибкиЖалобы.ЗаказНаряд,
	|	ОшибкиЖалобы.Инцидент,
	|	ОшибкиЖалобы.Заявка,
	|	ОшибкиЖалобы.Объект,
	|	ОшибкиЖалобы.ОписаниеОшибки
	|ИЗ
	|	ОшибкиЖалобы КАК ОшибкиЖалобы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОшибкиКомментарии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОшибкиЖалобы"
	;
	
	Запрос.Текст = ТекстЗапроса;
	
	СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеПолейИнцидентов(МВТ, ТаблицаОшибок, Отказ = Ложь)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	// Комментарий 
	//Дата создания - 10.04.2012 10:41:41; Автор - Окипний Андрей Евгеньевич
	//Выполним поиск пустых комментариев и жалоб клиента
	//Всю проверку сделаем одним пакетным запросом. 
	//
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВремИнциденты.ИдентификаторИнцидента,
	|	ВремИнциденты.ЗаказНаряд,
	|	ВремИнциденты.Инцидент,
	|	ВремИнциденты.КодОщущенияКлиента,
	|	ВремИнциденты.ФункциональныйКод,
	|	ВремИнциденты.ОтзывнаяНота
	|ПОМЕСТИТЬ ВремТЗ_OTS_ФК_КОК
	|ИЗ
	|	ВремИнциденты КАК ВремИнциденты
	|ГДЕ
	|	ВремИнциденты.ВидРасходов <> &ВидРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТЗ_OTS_ФК_КОК.ЗаказНаряд,
	|	ВремТЗ_OTS_ФК_КОК.Инцидент,
	|	""-"" КАК Заявка,
	|	""Функциональный код"" КАК Объект,
	|	""Не заполнен функциональный код"" КАК ОписаниеОшибки
	|ПОМЕСТИТЬ ОшибкиФК
	|ИЗ
	|	ВремТЗ_OTS_ФК_КОК КАК ВремТЗ_OTS_ФК_КОК
	|ГДЕ
	|	ВремТЗ_OTS_ФК_КОК.ФункциональныйКод = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказНаряды.ЗаказНаряд
	|ПОМЕСТИТЬ Заказы_с_OTS
	|ИЗ
	|	ПаттерныЗН КАК ЗаказНаряды
	|ГДЕ
	|	ЗаказНаряды.OTS = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТЗ_OTS_ФК_КОК.ЗаказНаряд,
	|	ВремТЗ_OTS_ФК_КОК.Инцидент,
	|	""-"" КАК Заявка,
	|	""Отзывная нота"" КАК Объект,
	|	""Не указана отзывная компания"" КАК ОписаниеОшибки
	|ПОМЕСТИТЬ ОшибкиOTS
	|ИЗ
	|	ВремТЗ_OTS_ФК_КОК КАК ВремТЗ_OTS_ФК_КОК
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Заказы_с_OTS КАК Заказы_с_OTS
	|		ПО ВремТЗ_OTS_ФК_КОК.ЗаказНаряд = Заказы_с_OTS.ЗаказНаряд
	|ГДЕ
	|	ВремТЗ_OTS_ФК_КОК.ОтзывнаяНота = ЗНАЧЕНИЕ(Справочник.СервисныеКампании.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Заказы_с_OTS
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПроверкиКОК.ИдентификаторИнцидента
	|ПОМЕСТИТЬ ТаблицаПроверкиКОК
	|ИЗ
	|	&ТаблицаПроверкиКОК КАК ТаблицаПроверкиКОК
	|ГДЕ
	|	ТаблицаПроверкиКОК.Control_EC = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТЗ_OTS_ФК_КОК.ЗаказНаряд,
	|	ВремТЗ_OTS_ФК_КОК.Инцидент,
	|	""-"" КАК Заявка,
	|	""Код ощущения/жалобы клиента"" КАК Объект,
	|	""Не заполнено поле """"Код ощущения\жалобы клиента"""""" КАК ОписаниеОшибки
	|ПОМЕСТИТЬ ОшибкиКОК
	|ИЗ
	|	ВремТЗ_OTS_ФК_КОК КАК ВремТЗ_OTS_ФК_КОК
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПроверкиКОК КАК ТаблицаПроверкиКОК
	|		ПО ВремТЗ_OTS_ФК_КОК.ИдентификаторИнцидента = ТаблицаПроверкиКОК.ИдентификаторИнцидента
	|ГДЕ
	|	ВремТЗ_OTS_ФК_КОК.КодОщущенияКлиента = ЗНАЧЕНИЕ(Справочник.EDR_КодыОщущенийКлиента.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаПроверкиКОК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОшибкиФК.ЗаказНаряд,
	|	ОшибкиФК.Инцидент,
	|	ОшибкиФК.Заявка,
	|	ОшибкиФК.Объект,
	|	ОшибкиФК.ОписаниеОшибки
	|ИЗ
	|	ОшибкиФК КАК ОшибкиФК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОшибкиOTS.ЗаказНаряд,
	|	ОшибкиOTS.Инцидент,
	|	ОшибкиOTS.Заявка,
	|	ОшибкиOTS.Объект,
	|	ОшибкиOTS.ОписаниеОшибки
	|ИЗ
	|	ОшибкиOTS КАК ОшибкиOTS
	|ГДЕ
	|	ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОшибкиКОК.ЗаказНаряд,
	|	ОшибкиКОК.Инцидент,
	|	ОшибкиКОК.Заявка,
	|	ОшибкиКОК.Объект,
	|	ОшибкиКОК.ОписаниеОшибки
	|ИЗ
	|	ОшибкиКОК КАК ОшибкиКОК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОшибкиOTS
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОшибкиКОК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОшибкиФК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремТЗ_OTS_ФК_КОК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремИнциденты"
	;
	
	ТаблицаПараметровВидовРасходов = ОбновитьТаблицуПараметровВидовРасходов();
	
	Запрос.УстановитьПараметр("ТаблицаПроверкиКОК", ТаблицаПараметровВидовРасходов);
	Запрос.УстановитьПараметр("ВидРасходов", Справочники.EDR_ВидыРасходов.Ex91);
	Запрос.Текст = ТекстЗапроса;
	
	СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок);
	
	Отказ = Ложь;
	
	ПроверитьЗаполнениеОтзывнойНоты(Отказ,Истина);
	
КонецПроцедуры // ПроверитьЗаполнениеПолейИнцидентов(МВТ, ТаблицаОшибок)

&НаСервере
Процедура ПроверитьЗаполнениеКатегорииЗаявок(МВТ, ТаблицаОшибок)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	// Комментарий 
	//Дата создания - 10.04.2012 13:19:03; Автор - Окипний Андрей Евгеньевич
	//Выполним поиск пустых категорий в таблице заявок
	//Всю проверку сделаем одним пакетным запросом. 
	//
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПаттерныЗаявок.ЗаказНаряд,
	|	ПаттерныЗаявок.Счет КАК Заявка,
	|	""-"" КАК Инцидент,
	|	""Категория"" КАК Объект,
	|	""Не заполнено поле """"Категория"""""" КАК ОписаниеОшибки
	|ИЗ
	|	ПаттерныЗаявок КАК ПаттерныЗаявок
	|ГДЕ
	|	ПаттерныЗаявок.Категория = ЗНАЧЕНИЕ(Справочник.EDR_КатегорииСчетов.ПустаяСсылка)"
	;
	Запрос.Текст = ТекстЗапроса;
	
	СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок);
	
КонецПроцедуры // ПроверитьЗаполнениеКатегорииЗаявок(МВТ, ТаблицаОшибок)

&НаСервере
Процедура ПроверитьЗаполнениеКодСтатьиРасходовЗаявок(МВТ, ТаблицаОшибок) 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	// Комментарий 
	//Дата создания - 10.04.2012 13:19:03; Автор - Окипний Андрей Евгеньевич
	//Выполним поиск пустых Кодов статей расходов в таблице заявок
	//Всю проверку сделаем одним пакетным запросом. 
	//
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПаттерныЗаявок.ЗаказНаряд,
	|	ПаттерныЗаявок.Счет,
	|	ПаттерныЗаявок.Категория,
	|	ПаттерныЗаявок.ВидРасходов
	|ПОМЕСТИТЬ ВремЗаявки
	|ИЗ
	|	ПаттерныЗаявок КАК ПаттерныЗаявок
	|ГДЕ
	|	ПаттерныЗаявок.ВидРасходов = ЗНАЧЕНИЕ(Справочник.EDR_ВидыРасходов.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСоответствийКатегорий.ExpenceCode,
	|	ТаблицаСоответствийКатегорий.Категория
	|ПОМЕСТИТЬ ВремТабПрименяемости
	|ИЗ
	|	&ТаблицаСоответствийКатегорий КАК ТаблицаСоответствийКатегорий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТабПрименяемости.Категория,
	|	ВремТабПрименяемости.ExpenceCode
	|ПОМЕСТИТЬ ВсеСоответствия
	|ИЗ
	|	ВремТабПрименяемости КАК ВремТабПрименяемости
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	EDR_КатегорииСчетовВидыРасходов.КодСтатьиРасходов,
	|	EDR_КатегорииСчетовВидыРасходов.Ссылка
	|ИЗ
	|	Справочник.EDR_КатегорииСчетов.ВидыРасходов КАК EDR_КатегорииСчетовВидыРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеСоответствия.Категория,
	|	ВсеСоответствия.ExpenceCode
	|ПОМЕСТИТЬ НеПустыеСоответствия
	|ИЗ
	|	ВсеСоответствия КАК ВсеСоответствия
	|ГДЕ
	|	(НЕ ВсеСоответствия.ExpenceCode = НЕОПРЕДЕЛЕНО)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеСоответствия.ExpenceCode,
	|	ВсеСоответствия.Категория
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВсеСоответствия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НеПустыеСоответствия.Категория КАК СоответствиеКатегория,
	|	КОЛИЧЕСТВО(НеПустыеСоответствия.ExpenceCode) КАК КоличествоСоответсвий
	|ПОМЕСТИТЬ ПодсчитанныеВхождения
	|ИЗ
	|	НеПустыеСоответствия КАК НеПустыеСоответствия
	|
	|СГРУППИРОВАТЬ ПО
	|	НеПустыеСоответствия.Категория
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремТабПрименяемости
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НеПустыеСоответствия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремЗаявки.ЗаказНаряд,
	|	ВремЗаявки.Счет КАК Заявка,
	|	""-"" КАК Инцидент,
	|	""Вид расходов"" КАК Объект,
	|	""Не заполнено обязательное поле """"Вид расходов"""""" КАК ОписаниеОшибки
	|ИЗ
	|	ВремЗаявки КАК ВремЗаявки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПодсчитанныеВхождения КАК ПодсчитанныеВхождения
	|		ПО ВремЗаявки.Категория = ПодсчитанныеВхождения.СоответствиеКатегория
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремЗаявки"
	;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТаблицаСоответствийКатегорий", ТаблицаСоответствийКатегорий.Выгрузить());
	
	СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок);
	
КонецПроцедуры // ПроверитьЗаполнениеКодСтатьиРасходовЗаявок(МВТ, ТаблицаОшибок)

&НаСервере
Процедура ПроверитьПустыеЗаявки(МВТ, ТаблицаОшибок) 

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	// Комментарий 
	//Дата создания - 10.04.2012 13:19:03; Автор - Окипний Андрей Евгеньевич
	//Выполним поиск пустых Кодов статей расходов в таблице заявок
	//Всю проверку сделаем одним пакетным запросом. 
	//
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПаттерныЗаявок.ЗаказНаряд,
	|	ПаттерныЗаявок.Счет,
	|	ПаттерныЗаявок.ИдентификаторСчета
	|ПОМЕСТИТЬ ВремЗаявки
	|ИЗ
	|	ПаттерныЗаявок КАК ПаттерныЗаявок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПаттерныРаспределения.ИдентификаторСчета,
	|	ПаттерныРаспределения.ИдентификаторИнцидента
	|ПОМЕСТИТЬ ВремРаспределения
	|ИЗ
	|	ПаттерныРаспределения КАК ПаттерныРаспределения
	|ГДЕ
	|	(НЕ ПаттерныРаспределения.ИдентификаторИнцидента ЕСТЬ NULL )
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремЗаявки.ЗаказНаряд,
	|	ВремЗаявки.Счет КАК Заявка,
	|	""-"" КАК Инцидент,
	|	""Инцидент"" КАК Объект,
	|	""Для заявки не найдены инциденты"" КАК ОписаниеОшибки
	|ИЗ
	|	ВремЗаявки КАК ВремЗаявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремРаспределения КАК ВремРаспределения
	|		ПО ВремЗаявки.ИдентификаторСчета = ВремРаспределения.ИдентификаторСчета
	|ГДЕ
	|	ВремРаспределения.ИдентификаторСчета ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремЗаявки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремРаспределения"
	;
	Запрос.Текст = ТекстЗапроса;
	
	СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок);
	
КонецПроцедуры // ПроверитьПустыеЗаявки(МВТ, ТаблицаОшибок)

&НаСервере
Процедура ПроверитьПотерянныеИнциденты(МВТ, ТаблицаОшибок) 

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	// Комментарий 
	//Дата создания - 10.04.2012 13:19:03; Автор - Окипний Андрей Евгеньевич
	//Выполним поиск пустых Кодов статей расходов в таблице заявок
	//Всю проверку сделаем одним пакетным запросом. 
	//
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПаттерныИнцидентов.ИдентификаторИнцидента,
	|	ПаттерныИнцидентов.Инцидент,
	|	ПаттерныИнцидентов.ЗаказНаряд
	|ПОМЕСТИТЬ ВремИнциденты
	|ИЗ
	|	ПаттерныИнцидентов КАК ПаттерныИнцидентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПаттерныРаспределения.ИдентификаторСчета,
	|	ПаттерныРаспределения.ИдентификаторИнцидента
	|ПОМЕСТИТЬ ВремРаспределения
	|ИЗ
	|	ПаттерныРаспределения КАК ПаттерныРаспределения
	|ГДЕ
	|	(НЕ ПаттерныРаспределения.ИдентификаторИнцидента ЕСТЬ NULL )
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремИнциденты.ЗаказНаряд,
	|	""-"" КАК Заявка,
	|	ВремИнциденты.Инцидент КАК Инцидент,
	|	""Заявка"" КАК Объект,
	|	""Для инцидента не найдены заявки"" КАК ОписаниеОшибки
	|ИЗ
	|	ВремИнциденты КАК ВремИнциденты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремРаспределения КАК ВремРаспределения
	|		ПО ВремИнциденты.ИдентификаторИнцидента = ВремРаспределения.ИдентификаторИнцидента
	|ГДЕ
	|	ВремРаспределения.ИдентификаторСчета ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремИнциденты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремРаспределения"
	;
	Запрос.Текст = ТекстЗапроса;
	
	СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок);
	
КонецПроцедуры // ПроверитьПотерянныеИнциденты(МВТ, ТаблицаОшибок)

&НаСервере
Процедура ПроверитьКодРасходов_19(МВТ, ТаблицаОшибок) 

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ПаттерныРаспределения.ИдентификаторИнцидента,
	|	ПаттерныРаспределения.ВидРасходов
	|ПОМЕСТИТЬ Соответствия
	|ИЗ
	|	ПаттерныРаспределения КАК ПаттерныРаспределения
	|ГДЕ
	|	ПаттерныРаспределения.ВидРасходов = ЗНАЧЕНИЕ(Справочник.EDR_ВидыРасходов.Ex19)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПаттерныИнцидентов.ИдентификаторИнцидента,
	|	ПаттерныИнцидентов.НомерСФ,
	|	ПаттерныИнцидентов.ДатаСФ,
	|	ПаттерныИнцидентов.ПробегПриУстановке,
	|	ПаттерныИнцидентов.ЗаказНаряд,
	|	ПаттерныИнцидентов.Инцидент
	|ПОМЕСТИТЬ Инциденты_19
	|ИЗ
	|	ПаттерныИнцидентов КАК ПаттерныИнцидентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Соответствия КАК Соответствия
	|		ПО ПаттерныИнцидентов.ИдентификаторИнцидента = Соответствия.ИдентификаторИнцидента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Соответствия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Инциденты_19.ЗаказНаряд КАК ЗаказНаряд,
	|	""-"" КАК Заявка,
	|	Инциденты_19.Инцидент,
	|	""Номер Заказ-наряда установки детали"" КАК Объект,
	|	""Не указан номер заказ-наряда по установке гарантийной детали."" КАК ОписаниеОшибки
	|ИЗ
	|	Инциденты_19 КАК Инциденты_19
	|ГДЕ
	|	Инциденты_19.НомерСФ = """"
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Инциденты_19.ЗаказНаряд,
	|	""-"",
	|	Инциденты_19.Инцидент,
	|	""Дата Заказ-наряда установки детали"",
	|	""Не указана дата заказ-наряда по установке гарантийной детали.""
	|ИЗ
	|	Инциденты_19 КАК Инциденты_19
	|ГДЕ
	|	Инциденты_19.ДатаСФ = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Инциденты_19.ЗаказНаряд,
	|	""-"",
	|	Инциденты_19.Инцидент,
	|	""Пробег при установке детали"",
	|	""Не указан Пробег по заказ-наряду установки гарантийной детали.""
	|ИЗ
	|	Инциденты_19 КАК Инциденты_19
	|ГДЕ
	|	Инциденты_19.ПробегПриУстановке = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Инциденты_19"
	;
	Запрос.Текст = ТекстЗапроса;
	
	СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок);
	
КонецПроцедуры // ПроверитьКодРасходов_19(МВТ, ТаблицаОшибок)

&НаСервере
Процедура ПроверитьНоменклатуруИАвтоработыНаСоответствие(МВТ, ТаблицаОшибок,ТаблицаОшибокРаботыТовары) 

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ПаттерныНоменклатуры.ИдентификаторИнцидента,
	               |	ПаттерныНоменклатуры.Номенклатура,
	               |	ПаттерныНоменклатуры.Артикул,
	               |	ПаттерныНоменклатуры.DiversCode
	               |ПОМЕСТИТЬ ВремТЗТолькоНоменклатура
	               |ИЗ
	               |	ПаттерныНоменклатуры КАК ПаттерныНоменклатуры
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
	               |		ПО ПаттерныНоменклатуры.Номенклатура = спрНоменклатура.Ссылка
	               |ГДЕ
	               |	ПаттерныНоменклатуры.Удален = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВремТЗТолькоНоменклатура.ИдентификаторИнцидента,
	               |	ВремТЗТолькоНоменклатура.Номенклатура,
	               |	ВремТЗТолькоНоменклатура.Артикул,
	               |	ВЫБОР
	               |		КОГДА TariffPR_НоменклатураСрезПоследних.Реферанс ЕСТЬ NULL 
	               |				И EDR_DiversCode.Ссылка ЕСТЬ NULL 
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Реферанс_НЕ_Renault,
	               |	EDR_DiversCode.Ссылка КАК DiversCode
	               |ПОМЕСТИТЬ ВремТЗНоменклатура
	               |ИЗ
	               |	ВремТЗТолькоНоменклатура КАК ВремТЗТолькоНоменклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_TariffPR_Номенклатура.СрезПоследних(&ТекДата, ) КАК TariffPR_НоменклатураСрезПоследних
	               |		ПО ВремТЗТолькоНоменклатура.Артикул = TariffPR_НоменклатураСрезПоследних.Реферанс
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.EDR_DiversCode КАК EDR_DiversCode
	               |		ПО ВремТЗТолькоНоменклатура.DiversCode = EDR_DiversCode.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВремТЗТолькоНоменклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПаттерныРабот.ИдентификаторИнцидента,
	               |	ПаттерныРабот.Работа,
	               |	ПаттерныРабот.Артикул
	               |ПОМЕСТИТЬ ВремТЗТолькоАвтоработыРаботы
	               |ИЗ
	               |	ПаттерныРабот КАК ПаттерныРабот
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Автоработы КАК Автоработы
	               |		ПО ПаттерныРабот.Работа = Автоработы.Ссылка
	               |ГДЕ
	               |	ПаттерныРабот.Удален = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВремТЗТолькоАвтоработыРаботы.ИдентификаторИнцидента,
	               |	ВремТЗТолькоАвтоработыРаботы.Работа,
	               |	ВремТЗТолькоАвтоработыРаботы.Артикул,
	               |	ВЫБОР
	               |		КОГДА OPERACODE_НормыРаботСрезПоследних.КодПоКаталогу ЕСТЬ NULL 
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Реферанс_НЕ_Renault
	               |ПОМЕСТИТЬ ВремТЗРабота
	               |ИЗ
	               |	ВремТЗТолькоАвтоработыРаботы КАК ВремТЗТолькоАвтоработыРаботы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.OPERACODE_НормыРабот.СрезПоследних(&ТекДата, ) КАК OPERACODE_НормыРаботСрезПоследних
	               |		ПО ВремТЗТолькоАвтоработыРаботы.Артикул = OPERACODE_НормыРаботСрезПоследних.КодПоКаталогу
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВремТЗТолькоАвтоработыРаботы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВремТЗНоменклатура.Номенклатура КАК НоменклатураРабота,
	               |	ВремТЗНоменклатура.Артикул,
	               |	ВремТЗНоменклатура.ИдентификаторИнцидента
	               |ПОМЕСТИТЬ ВремТЗНоменклатураРабота
	               |ИЗ
	               |	ВремТЗНоменклатура КАК ВремТЗНоменклатура
	               |ГДЕ
	               |	ВремТЗНоменклатура.Реферанс_НЕ_Renault = ИСТИНА
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВремТЗРабота.Работа,
	               |	ВремТЗРабота.Артикул,
	               |	ВремТЗРабота.ИдентификаторИнцидента
	               |ИЗ
	               |	ВремТЗРабота КАК ВремТЗРабота
	               |ГДЕ
	               |	ВремТЗРабота.Реферанс_НЕ_Renault = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВремТЗНоменклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВремТЗРабота
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПаттерныИнцидентов.ЗаказНаряд,
	               |	"" - "" КАК Заявка,
	               |	ПаттерныИнцидентов.Инцидент,
	               |	ВЫБОР
	               |		КОГДА ВремТЗНоменклатураРабота.НоменклатураРабота ССЫЛКА Справочник.Автоработы
	               |			ТОГДА ""Работа  - № по каталогу ["" + ВремТЗНоменклатураРабота.Артикул + ""]""
	               |		ИНАЧЕ ""Номенклатура - реферанс ["" + ВремТЗНоменклатураРабота.Артикул + ""]""
	               |	КОНЕЦ КАК Объект,
	               |	ВЫБОР
	               |		КОГДА ВремТЗНоменклатураРабота.НоменклатураРабота ССЫЛКА Справочник.Автоработы
	               |			ТОГДА ""Работа Не акцептована RENAULT. Или не загружена в OPERACODE""
	               |		ИНАЧЕ ""Номенклатура Не акцептована RENAULT. Или не загружена в Tarif PR""
	               |	КОНЕЦ КАК ОписаниеОшибки
	               |ИЗ
	               |	ПаттерныИнцидентов КАК ПаттерныИнцидентов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремТЗНоменклатураРабота КАК ВремТЗНоменклатураРабота
	               |		ПО ПаттерныИнцидентов.ИдентификаторИнцидента = ВремТЗНоменклатураРабота.ИдентификаторИнцидента
	               |ГДЕ
	               |	ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВремТЗНоменклатураРабота"
	;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок,ТаблицаОшибокРаботыТовары);
	
КонецПроцедуры // ПроверитьНоменклатуруИАвтоработыНаСоответствие(МВТ, ТаблицаОшибок)

&НаСервере
Процедура ПроверитьПричиныОбращения(МВТ, ТаблицаОшибок)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ПаттерныНоменклатуры.Номенклатура КАК НоменклатураРабота,
	|	ПаттерныНоменклатуры.ИдентификаторИнцидента
	|ПОМЕСТИТЬ ВремТЗТоварыРаботы
	|ИЗ
	|	ПаттерныНоменклатуры КАК ПаттерныНоменклатуры
	|ГДЕ
	|	ПаттерныНоменклатуры.ПричинаОбращения = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПаттерныРабот.Работа,
	|	ПаттерныРабот.ИдентификаторИнцидента
	|ИЗ
	|	ПаттерныРабот КАК ПаттерныРабот
	|ГДЕ
	|	ПаттерныРабот.ПричинаОбращения = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПаттерныИнцидентов.Инцидент,
	|	ПаттерныИнцидентов.ИдентификаторИнцидента,
	|	ПаттерныИнцидентов.ЗаказНаряд,
	|	КОЛИЧЕСТВО(ВремТЗТоварыРаботы.НоменклатураРабота) КАК НоменклатураРабота
	|ПОМЕСТИТЬ ТЗПосчитаныхПричин
	|ИЗ
	|	ПаттерныИнцидентов КАК ПаттерныИнцидентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремТЗТоварыРаботы КАК ВремТЗТоварыРаботы
	|		ПО ПаттерныИнцидентов.ИдентификаторИнцидента = ВремТЗТоварыРаботы.ИдентификаторИнцидента
	|ГДЕ
	|	ПаттерныИнцидентов.ТребоватьПричину = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ПаттерныИнцидентов.Инцидент,
	|	ПаттерныИнцидентов.ИдентификаторИнцидента,
	|	ПаттерныИнцидентов.ЗаказНаряд
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремТЗТоварыРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗПосчитаныхПричин.ЗаказНаряд,
	|	""-"" КАК Заявка,
	|	ТЗПосчитаныхПричин.Инцидент,
	|	""Причина обращения"" КАК Объект,
	|	ВЫБОР
	|		КОГДА ТЗПосчитаныхПричин.НоменклатураРабота > 1
	|			ТОГДА ""больше""
	|		КОГДА ТЗПосчитаныхПричин.НоменклатураРабота < 1
	|			ТОГДА ""меньше""
	|		ИНАЧЕ ""норма""
	|	КОНЕЦ КАК Отклонение
	|ПОМЕСТИТЬ РасчетПоказателей
	|ИЗ
	|	ТЗПосчитаныхПричин КАК ТЗПосчитаныхПричин
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТЗПосчитаныхПричин
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетПоказателей.ЗаказНаряд,
	|	РасчетПоказателей.Заявка,
	|	РасчетПоказателей.Инцидент,
	|	РасчетПоказателей.Объект,
	|	ВЫБОР
	|		КОГДА РасчетПоказателей.Отклонение = ""меньше""
	|			ТОГДА ""У инцидента не указана причина обращения. Причина обращения обязательна.""
	|		КОГДА РасчетПоказателей.Отклонение = ""больше""
	|			ТОГДА ""У инцидента две или более причин обращения. Возможна только одна причина обращения.""
	|	КОНЕЦ КАК ОписаниеОшибки
	|ИЗ
	|	РасчетПоказателей КАК РасчетПоказателей
	|ГДЕ
	|	РасчетПоказателей.Отклонение <> ""норма""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РасчетПоказателей"
	;
	
	Запрос.Текст = ТекстЗапроса;
	
	СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок);
	
КонецПроцедуры // ПроверитьПричиныОбращения(МВТ, ТаблицаОшибок)

&НаСервере
Процедура СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок,ТаблицаОшибокРаботыТовары = Неопределено)

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НС = ТаблицаОшибок.Добавить();
		ЗаполнитьЗначенияСвойств(НС, ВЫборка);
		
		Если ТаблицаОшибокРаботыТовары <> Неопределено Тогда
			НС = ТаблицаОшибокРаботыТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Выборка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // СформироватьЗаписиОшибок(Запрос, ТаблицаОшибок)

&НаСервере
Функция ДополнитьТаблицуСоответствийКатегорий(Категория) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	EDR_КатегорииСчетовВидыРасходов.Ссылка КАК Категория,
	|	EDR_КатегорииСчетовВидыРасходов.Ссылка.Наименование,
	|	EDR_КатегорииСчетовВидыРасходов.КодСтатьиРасходов КАК ExpenceCode
	|ИЗ
	|	Справочник.EDR_КатегорииСчетов.ВидыРасходов КАК EDR_КатегорииСчетовВидыРасходов
	|ГДЕ
	|	EDR_КатегорииСчетовВидыРасходов.Ссылка = &Категория");
	
	Запрос.УстановитьПараметр("Категория", Категория);
	Выборка = Запрос.Выполнить().Выбрать();
	
	//Дополняем таблицу
	Пока Выборка.Следующий() Цикл
		НС = ТаблицаСоответствийКатегорий.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Выборка);
	КонецЦикла;
	
	//Теперь повторяем отбор
	Отбор = Новый Структура("Категория", Категория);
	
	Возврат ТаблицаСоответствийКатегорий.НайтиСтроки(Отбор);
	
КонецФункции

////#КонецОбласти

////#Область ЗаписьДанныхВРегистры

&НаСервере
Функция ЗаписатьИнформациюВРегистры()
	
	НачатьТранзакцию();
	
	Попытка
		
		ЗаписьИзмененийПоСчетам();
		ЗаписьИзмененийПоИнцидентам();
		ЗаписьИзмененийПоРаботам();
		ЗаписьИзмененийПоТоварам();
		ЗаписьИзмененийПоСоответствиям();
		ЗаписьИзмененийПоЗаказНарядам();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ЗаписатьВЖурналНаСервере(ЗаказНаряд,"Ошибка",ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ОтменитьТранзакцию();
		
		Возврат Ложь;
		
	КонецПопытки;
		
	Возврат Истина;
	
КонецФункции // ЗаписатьИнформациюВРегистры()

&НаСервере
Процедура ЗаписьИзмененийПоСчетам()
	
	////нужно отработать номер заявки при повторной отправке.
	Если ПовторнаяОтправка Тогда
	
		СтруктураПоиска = Новый Структура("ЗаказНаряд,Удален",ЗаказНаряд,Ложь);
		
		СтрокиСчетов = ТаблицаСчетов.НайтиСтроки(СтруктураПоиска);
		
		Для каждого ТекущаяСтрокаСчета Из СтрокиСчетов Цикл
			
			НомерЗаявкиПаттерн = EDR_КешируемыеЗначения.ПолучитьНомерДляПечати(ЗаказНаряд);
			НовыйНомер = Прав(НомерЗаявкиПаттерн, 4) + "P";
			
			Если Найти(ТекущаяСтрокаСчета.Счет, НомерЗаявкиПаттерн) = 0 Тогда
				
				Если СтрДлина(ТекущаяСтрокаСчета.Счет) > 5 Тогда
				
					НовыйНомер = Лев(ТекущаяСтрокаСчета.Счет, СтрДлина(ТекущаяСтрокаСчета.Счет) - 1) + "P";
					ТекущаяСтрокаСчета.Счет = НовыйНомер;
					
				ИначеЕсли СтрДлина(ТекущаяСтрокаСчета.Счет) <= 5 Тогда
					
					ТекущаяСтрокаСчета.Счет = ТекущаяСтрокаСчета.Счет + "P";
					
				КонецЕсли;
				
			Иначе
			
				ТекущаяСтрокаСчета.Счет = СтрЗаменить(ТекущаяСтрокаСчета.Счет, НомерЗаявкиПаттерн, НовыйНомер);
				
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	//Измененные строки
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаСчетов",ТаблицаСчетов.Выгрузить());
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаСчетов.ЗаказНаряд КАК ЗаказНаряд,
		|	ТаблицаСчетов.Удален КАК Удален,
		|	ТаблицаСчетов.ИдентификаторСчета КАК GUID,
		|	ТаблицаСчетов.Категория КАК Категория,
		|	ТаблицаСчетов.ДатаИнвойса КАК ДатаИнвойса,
		|	ТаблицаСчетов.ВидРасходов КАК Expense_code,
		|	ТаблицаСчетов.СчетФактура КАК СчетФактура,
		|	ТаблицаСчетов.Счет КАК Invoice,
		|	ТаблицаСчетов.СчетДоИзменения КАК СчетДоИзменения
		|ПОМЕСТИТЬ мТаблицаСчетов
		|ИЗ
		|	&ТаблицаСчетов КАК ТаблицаСчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	мТаблицаСчетов.ЗаказНаряд КАК ЗаказНаряд,
		|	мТаблицаСчетов.СчетДоИзменения КАК Invoice,
		|	мТаблицаСчетов.GUID КАК GUID,
		|	мТаблицаСчетов.СчетФактура КАК СчетФактура
		|ИЗ
		|	мТаблицаСчетов КАК мТаблицаСчетов
		|ГДЕ
		|	НЕ мТаблицаСчетов.Удален
		|	И мТаблицаСчетов.СчетДоИзменения <> """"
		|	И мТаблицаСчетов.СчетДоИзменения <> мТаблицаСчетов.Invoice
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	мТаблицаСчетов.ЗаказНаряд,
		|	мТаблицаСчетов.GUID,
		|	мТаблицаСчетов.ДатаИнвойса,
		|	мТаблицаСчетов.Expense_code,
		|	мТаблицаСчетов.СчетФактура,
		|	мТаблицаСчетов.Invoice,
		|	мТаблицаСчетов.Категория
		|ИЗ
		|	мТаблицаСчетов КАК мТаблицаСчетов
		|ГДЕ
		|	НЕ мТаблицаСчетов.Удален
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	мТаблицаСчетов.GUID
		|ИЗ
		|	мТаблицаСчетов КАК мТаблицаСчетов
		|ГДЕ
		|	мТаблицаСчетов.Удален";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаСтарыхСчетов = РезультатЗапроса[1].Выбрать();
	
	Пока ВыборкаСтарыхСчетов.Следующий() Цикл
		
		СтруктураПараметровУдаления = Новый Структура;
		
		Для каждого ТекущаяКолонка Из РезультатЗапроса[1].Колонки  Цикл		
			СтруктураПараметровУдаления.Вставить(ТекущаяКолонка.Имя,ВыборкаСтарыхСчетов[ТекущаяКолонка.Имя]);	
		КонецЦикла; 
		
		УдалитьСтарыеСчета(СтруктураПараметровУдаления);
		
	КонецЦикла;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса[2].Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураПараметров = Новый Структура;
		
		Для каждого ТекущаяКолонка Из РезультатЗапроса[2].Колонки  Цикл		
			СтруктураПараметров.Вставить(ТекущаяКолонка.Имя,ВыборкаДетальныеЗаписи[ТекущаяКолонка.Имя]);	
		КонецЦикла; 
		
		РегистрыСведений.EDR_Invoices.ОбновитьИнвойс(СтруктураПараметров);
		
	КонецЦикла;
	
	//Удаленные строки
	
	ВыборкаУдаления = РезультатЗапроса[3].Выбрать();
	
	Пока ВыборкаУдаления.Следующий() Цикл
		РегистрыСведений.EDR_Invoices.УдалитьИнвойс(ВыборкаУдаления.GUID);
	КонецЦикла; 
	
КонецПроцедуры // ЗаписьИзмененийПоСчетам()

&НаСервере
Процедура ЗаписьИзмененийПоИнцидентам()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаИнцидентов",ТаблицаИнцидентов.Выгрузить());
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ                
		|	ТаблицаИнцидентов.ЗаказНаряд КАК ЗаказНаряд,
		|	ТаблицаИнцидентов.ИдентификаторИнцидента КАК GUID,
		|	ТаблицаИнцидентов.Инцидент КАК Intervention,
		|	ТаблицаИнцидентов.КодОщущенияКлиента КАК RC_code,
		|	ТаблицаИнцидентов.ФункциональныйКод КАК Function_Code,
		|	ТаблицаИнцидентов.ОтзывнаяНота КАК OTS_number,
		|	ТаблицаИнцидентов.НомерСогласования КАК НомерСогласования,
		|	ТаблицаИнцидентов.НомерСФ КАК НомерСФ,
		|	ТаблицаИнцидентов.ДатаСФ КАК ДатаСФ,
		|	ТаблицаИнцидентов.ПробегПриУстановке КАК ПробегПриУстановке,
		|	ТаблицаИнцидентов.ОписаниеОперации КАК ОписаниеОперации,
		|	ТаблицаИнцидентов.ОписаниеЖалобы КАК ОписаниеЖалобы,
		|	ТаблицаИнцидентов.КомментарийОперации КАК КомментарийОперации,
		|	ТаблицаИнцидентов.РезультатДиагностики КАК РезультатДиагностики,
		|	ТаблицаИнцидентов.Удален КАК Удален
		|ПОМЕСТИТЬ мТаблицаИнцидентов
		|ИЗ
		|	&ТаблицаИнцидентов КАК ТаблицаИнцидентов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	мТаблицаИнцидентов.ЗаказНаряд,
		|	мТаблицаИнцидентов.GUID,
		|	мТаблицаИнцидентов.Intervention,
		|	мТаблицаИнцидентов.RC_code,
		|	мТаблицаИнцидентов.Function_Code,
		|	мТаблицаИнцидентов.OTS_number,
		|	мТаблицаИнцидентов.НомерСогласования,
		|	мТаблицаИнцидентов.НомерСФ,
		|	мТаблицаИнцидентов.ДатаСФ,
		|	мТаблицаИнцидентов.ПробегПриУстановке,
		|	мТаблицаИнцидентов.ОписаниеОперации,
		|	мТаблицаИнцидентов.ОписаниеЖалобы,
		|	мТаблицаИнцидентов.КомментарийОперации,
		|	мТаблицаИнцидентов.РезультатДиагностики
		|ИЗ
		|	мТаблицаИнцидентов КАК мТаблицаИнцидентов
		|ГДЕ
		|	НЕ мТаблицаИнцидентов.Удален
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	мТаблицаИнцидентов.ЗаказНаряд,
		|	мТаблицаИнцидентов.GUID
		|ИЗ
		|	мТаблицаИнцидентов КАК мТаблицаИнцидентов
		|ГДЕ
		|	мТаблицаИнцидентов.Удален";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаИзмененийСтрок = РезультатЗапроса[1].Выбрать();
	
	Пока ВыборкаИзмененийСтрок.Следующий() Цикл
		
		СтруктураПараметров = Новый Структура;
		
		Для каждого ТекущаяКолонка Из РезультатЗапроса[1].Колонки  Цикл		
			СтруктураПараметров.Вставить(ТекущаяКолонка.Имя,ВыборкаИзмененийСтрок[ТекущаяКолонка.Имя]);	
		КонецЦикла; 
		
		РегистрыСведений.EDR_Interventions.ОбновитьИнцидент(СтруктураПараметров);
		
	КонецЦикла;
	
	ВыборкаУдаленияСтрок = РезультатЗапроса[2].Выбрать();
	
	//Измененные строки
	Пока ВыборкаУдаленияСтрок.Следующий() Цикл
		РегистрыСведений.EDR_Interventions.УдалитьИнцидент(ВыборкаУдаленияСтрок.GUID);
	КонецЦикла;
	

КонецПроцедуры // ЗаписьИзмененийПоИнцидентам()

&НаСервере
Процедура ЗаписьИзмененийПоТоварам()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаТоваров",ТаблицаТоваров.Выгрузить());
	Запрос.Текст =                           
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаТоваров.ЗаказНаряд КАК ЗаказНаряд,
		|	ТаблицаТоваров.ИдентификаторТовара КАК GUID_Товара,
		|	ТаблицаТоваров.ИдентификаторИнцидента КАК GUID_Инцидента,
		|	ТаблицаТоваров.НеВключатьВСчет КАК NotInvoiced,
		|	ТаблицаТоваров.DiversCode КАК DiversCode,
		|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	ТаблицаТоваров.Количество КАК Количество,
		|	ТаблицаТоваров.ПричинаОбращения КАК ПричинаОбращения,
		|	ТаблицаТоваров.СтавкаНДС КАК СтавкаНДС,
		|	ТаблицаТоваров.СтрокаИзЗаказНаряда КАК СтрокаИзЗаказНаряда,
		|	ТаблицаТоваров.СуммаВсего КАК СуммаВсего,
		|	ТаблицаТоваров.СуммаНДС КАК СуммаНДС,
		|	ТаблицаТоваров.СуммаСкидки КАК СуммаСкидки,
		|	ТаблицаТоваров.Цена КАК Цена, ТаблицаТоваров.СрочныйТариф как СрочныйТариф,
		|	ТаблицаТоваров.Удален КАК Удален
		|ПОМЕСТИТЬ мТаблицаТоваров
		|ИЗ
		|	&ТаблицаТоваров КАК ТаблицаТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	мТаблицаТоваров.ЗаказНаряд КАК ЗаказНаряд,
		|	мТаблицаТоваров.GUID_Товара КАК GUID_Товара,
		|	мТаблицаТоваров.GUID_Инцидента КАК GUID_Инцидента,
		|	мТаблицаТоваров.NotInvoiced КАК NotInvoiced,
		|	мТаблицаТоваров.DiversCode КАК DiversCode,
		|	мТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	мТаблицаТоваров.Количество КАК Количество,
		|	мТаблицаТоваров.ПричинаОбращения КАК ПричинаОбращения,
		|	мТаблицаТоваров.СтавкаНДС КАК СтавкаНДС,
		|	мТаблицаТоваров.СтрокаИзЗаказНаряда КАК СтрокаИзЗаказНаряда,
		|	мТаблицаТоваров.СуммаВсего КАК СуммаВсего,
		|	мТаблицаТоваров.СуммаНДС КАК СуммаНДС,
		|	мТаблицаТоваров.СуммаСкидки КАК СуммаСкидки,
		|	мТаблицаТоваров.Цена КАК Цена,  мТаблицаТоваров.СрочныйТариф как СрочныйТариф
		|ИЗ
		|	мТаблицаТоваров КАК мТаблицаТоваров
		|ГДЕ
		|	НЕ мТаблицаТоваров.Удален";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РегистрыСведений.EDR_ТоварыДоп.ОбновитьТовары(РезультатЗапроса.Выгрузить(), ЗаказНаряд);
	
КонецПроцедуры // ЗаписьИзмененийПоТоварам()

&НаСервере
Процедура ЗаписьИзмененийПоРаботам()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаРабот",ТаблицаРаботы.Выгрузить());
	Запрос.Текст =                 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаРабот.ЗаказНаряд КАК ЗаказНаряд,
		|	ТаблицаРабот.ИдентификаторРаботы КАК GUID_Работы,
		|	ТаблицаРабот.ИдентификаторИнцидента КАК GUID_Инцидента,
		|	ТаблицаРабот.DiversCode КАК DiversCode,
		|	ТаблицаРабот.Артикул КАК Артикул,
		|	ТаблицаРабот.Инцидент КАК Инцидент,
		|	ТаблицаРабот.Количество КАК Количество,
		|	ТаблицаРабот.Коэффициент КАК Коэффициент,
		|	ВЫРАЗИТЬ(ТаблицаРабот.НеСтандартнаяОперация КАК БУЛЕВО) КАК НеСтандартнаяОперация,
		|	ТаблицаРабот.Нормочас КАК Нормочас,
		|	ТаблицаРабот.Цена КАК Цена,
		|	ТаблицаРабот.ПричинаОбращения КАК ПричинаОбращения,
		|	ТаблицаРабот.Работа КАК Работа,
		|	ТаблицаРабот.РаботаПоЛКМ КАК РаботаПоЛКМ,
		|	ТаблицаРабот.СтавкаНДС КАК СтавкаНДС,
		|	ТаблицаРабот.СтрокаИзЗаказНаряда КАК СтрокаИзЗаказНаряда,
		|	ТаблицаРабот.СуммаВсего КАК СуммаВсего,
		|	ТаблицаРабот.СуммаНДС КАК СуммаНДС,
		|	ТаблицаРабот.СуммаСкидки КАК СуммаСкидки,
		|	ТаблицаРабот.Удален
		|ПОМЕСТИТЬ мТаблицаРабот
		|ИЗ
		|	&ТаблицаРабот КАК ТаблицаРабот
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	мТаблицаРабот.ЗаказНаряд,
		|	мТаблицаРабот.GUID_Работы,
		|	мТаблицаРабот.GUID_Инцидента,
		|	мТаблицаРабот.DiversCode,
		|	мТаблицаРабот.Артикул,
		|	мТаблицаРабот.Инцидент,
		|	мТаблицаРабот.Количество,
		|	мТаблицаРабот.Коэффициент,
		|	мТаблицаРабот.НеСтандартнаяОперация,
		|	мТаблицаРабот.Нормочас,
		|	мТаблицаРабот.Цена,
		|	мТаблицаРабот.ПричинаОбращения,
		|	мТаблицаРабот.Работа,
		|	мТаблицаРабот.РаботаПоЛКМ,
		|	мТаблицаРабот.СтавкаНДС,
		|	мТаблицаРабот.СтрокаИзЗаказНаряда,
		|	мТаблицаРабот.СуммаВсего,
		|	мТаблицаРабот.СуммаНДС,
		|	мТаблицаРабот.СуммаСкидки,
		|	ВЫБОР
		|		КОГДА мТаблицаРабот.НеСтандартнаяОперация
		|			ТОГДА мТаблицаРабот.Артикул
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК АртикулНестандартнойОперации,
		|	ВЫБОР
		|		КОГДА мТаблицаРабот.НеСтандартнаяОперация
		|			ТОГДА мТаблицаРабот.Работа
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК НаименованиеНеСтандартнойОперации
		|ИЗ
		|	мТаблицаРабот КАК мТаблицаРабот
		|ГДЕ
		|	НЕ мТаблицаРабот.Удален";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РегистрыСведений.EDR_РаботыДоп.ОбновитьРаботы(РезультатЗапроса.Выгрузить(), ЗаказНаряд);
	
КонецПроцедуры // ЗаписьИзмененийПоРаботам()

&НаСервере
Процедура ЗаписьИзмененийПоСоответствиям()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаСоответствия",ТаблицаСоответствий.Выгрузить());
	Запрос.Текст =                 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаСоответствия.ЗаказНаряд КАК ЗаказНаряд,
		|	ТаблицаСоответствия.ИдентификаторСчета КАК Invoice,
		|	ТаблицаСоответствия.ИдентификаторИнцидента КАК intervention,
		|	ТаблицаСоответствия.Счет КАК Счет,
		|	ТаблицаСоответствия.Категория КАК Категория,
		|	ТаблицаСоответствия.ВидРасходов КАК ВидРасходов,
		|	ТаблицаСоответствия.Инцидент КАК Инцидент,
		|	ТаблицаСоответствия.Процент КАК Процент,
		|	ТаблицаСоответствия.Идентификатор КАК GUID,
		|	ТаблицаСоответствия.Удален
		|ПОМЕСТИТЬ мТаблицаСоответствия
		|ИЗ
		|	&ТаблицаСоответствия КАК ТаблицаСоответствия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	мТаблицаСоответствия.ЗаказНаряд,
		|	мТаблицаСоответствия.Invoice,
		|	мТаблицаСоответствия.intervention,
		|	мТаблицаСоответствия.Счет,
		|	мТаблицаСоответствия.Категория,
		|	мТаблицаСоответствия.ВидРасходов,
		|	мТаблицаСоответствия.Инцидент,
		|	мТаблицаСоответствия.Процент,
		|	мТаблицаСоответствия.GUID
		|ИЗ
		|	мТаблицаСоответствия КАК мТаблицаСоответствия
		|ГДЕ
		|	НЕ мТаблицаСоответствия.Удален
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	мТаблицаСоответствия.ЗаказНаряд,
		|	мТаблицаСоответствия.GUID
		|ИЗ
		|	мТаблицаСоответствия КАК мТаблицаСоответствия
		|ГДЕ
		|	мТаблицаСоответствия.Удален";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаЗаписи = РезультатЗапроса[1].Выбрать();
	
	Пока ВыборкаЗаписи.Следующий() Цикл
		
		СтруктураПараметров = Новый Структура;
		
		Для каждого ТекущаяКолонка Из РезультатЗапроса[1].Колонки  Цикл		
			СтруктураПараметров.Вставить(ТекущаяКолонка.Имя,ВыборкаЗаписи[ТекущаяКолонка.Имя]);	
		КонецЦикла; 
		
		РегистрыСведений.EDR_СоответствияИнвойсов.ОбновитьСоответствие(СтруктураПараметров);
		
	КонецЦикла; 
	
	ВыборкаУдаленияСтрок = РезультатЗапроса[2].Выбрать();
	
	Пока ВыборкаУдаленияСтрок.Следующий() Цикл
		РегистрыСведений.EDR_СоответствияИнвойсов.УдалитьСоответствие(ВыборкаУдаленияСтрок.GUID);
	КонецЦикла; 
	
КонецПроцедуры // ЗаписьИзмененийПоСоответствиям()

&НаСервере
Процедура ЗаписьИзмененийПоЗаказНарядам()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЗаказНаряд",			  ЗаказНаряд);
	СтруктураПараметров.Вставить("ПробегАвтомобиля",	  ПробегАвтомобиля);
	СтруктураПараметров.Вставить("ДатаЗакрытия",		  ДатаЗакрытия);
	СтруктураПараметров.Вставить("OTS",					  OTS);
	СтруктураПараметров.Вставить("Гарантия",	   	      Истина); //Тут только гарантия
	СтруктураПараметров.Вставить("ДатаОткрытия",		  ДатаОткрытия);
	СтруктураПараметров.Вставить("ОтправленВСистему_GCM", Отправлен);
	СтруктураПараметров.Вставить("СемействоАвтомобиля",	  СемействоАвтомобиля);
	СтруктураПараметров.Вставить("РангАвторабот",		  РангАвторабот);
	СтруктураПараметров.Вставить("ГотовностьКОтправке",	  ГотовностьКОтправке);
	СтруктураПараметров.Вставить("ПовторнаяОтправка",	  ПовторнаяОтправка);
	
	РегистрыСведений.EDR_ЗаказНаряды.ОбновиитьЗаказНарядВРегистре(СтруктураПараметров);
	
КонецПроцедуры

////#КонецОбласти

&НаСервере
Процедура ЗаполнитьВТабличныхЧастяхЗаказНаряд()

	Для каждого ТекущаяСтрока Из ТаблицаСчетов Цикл
		ТекущаяСтрока.ЗаказНаряд = ЗаказНаряд;
	КонецЦикла;
	
	Для каждого ТекущаяСтрока Из ТаблицаИнцидентов Цикл
		ТекущаяСтрока.ЗаказНаряд = ЗаказНаряд;
	КонецЦикла;
	
	Для каждого ТекущаяСтрока Из ТаблицаТоваров Цикл
		ТекущаяСтрока.ЗаказНаряд = ЗаказНаряд;
	КонецЦикла;
	
	Для каждого ТекущаяСтрока Из ТаблицаРаботы Цикл
		ТекущаяСтрока.ЗаказНаряд = ЗаказНаряд;
	КонецЦикла;
	
	Для каждого ТекущаяСтрока Из ТаблицаСоответствий Цикл
		ТекущаяСтрока.ЗаказНаряд = ЗаказНаряд;
	КонецЦикла;
	
	Для каждого ТекущаяСтрока Из ТаблицаФотографий Цикл
		ТекущаяСтрока.ЗаказНаряд = ЗаказНаряд;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьВТабличныхЧастяхЗаказНаряд()

////#КонецОбласти

////#Область Прочее

&НаСервере
Функция ПолучитьПараметр_Булево_ExpenceCode(ИдентификаторЗаказа = Неопределено, ИдентификаторСчета = Неопределено, ИдентификаторИнцидента = Неопределено, Параметр) Экспорт
	
	Отбор = Новый Структура;
	
	Если ЗначениеЗаполнено(ИдентификаторЗаказа) тогда
		
		Отбор.Вставить("ИдентификаторЗаказа", ИдентификаторЗаказа);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторСчета) тогда
		
		Отбор.Вставить("ИдентификаторСчета", ИдентификаторСчета);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторИнцидента) тогда
		
		Отбор.Вставить("ИдентификаторИнцидента", ИдентификаторИнцидента);
		
	КонецЕсли;
	
	ТаблицаПараметровВидовРасходов = ОбновитьТаблицуПараметровВидовРасходов();
	
	ТекСтроки = ТаблицаПараметровВидовРасходов.НайтиСтроки(Отбор);
	
	Если ЗначениеЗаполнено(ИдентификаторЗаказа) тогда //Для заказа возвращаем истину, если Истина есть хоть в одной строке.
		Если ТекСтроки.Количество() > 1 тогда
			
			Для каждого ТекСтрока из ТекСтроки Цикл
				ТекЗначение = ТекСтрока[Параметр];
				
				//Если значение хоть раз принимает значение Истина
				//Возвращаем Истина
				Если ТекЗначение тогда  
					
					Возврат ТекЗначение;
					
				КонецЕсли;
				
			КонецЦикла;
			
			//Если все еще тут, значит в цикле истину не нашли возвращаем последнее знвачение
			Возврат ТекЗначение;
		
		ИначеЕсли ТекСтроки.Количество() = 0 тогда //Если строки еще нет - возвращаем ложь
			
			Возврат ложь;
			
		Иначе
			
			ТекСтрока = ТекСтроки[0];
			Возврат ТекСтрока[Параметр];
			
		КонецЕсли;
		
	Иначе //Для счета и инцидента наоборот, возвращаем ложь, если ложь есть хоть в одной строке
		
		//Несколько строк может быть только с несколькими счетами
		Если ТекСтроки.Количество() > 1 тогда
			
			Для каждого ТекСтрока из ТекСтроки Цикл
				ТекЗначение = ТекСтрока[Параметр];
				
				//Если значение хоть раз принимает значение ложь
				//Возвращаем ложь
				Если НЕ ТекЗначение тогда  
					
					Возврат ТекЗначение;
					
				КонецЕсли;
				
			КонецЦикла;
			
			//Если все еще тут, значит в цикле ложь не нашли возвращаем последнее знвачение
			Возврат ТекЗначение;
			
		ИначеЕсли ТекСтроки.Количество() = 0 тогда //Если строки еще нет - возвращаем ложь
			
			Возврат ложь;
			
		Иначе
			
			ТекСтрока = ТекСтроки[0];
			Возврат ТекСтрока[Параметр];
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПроверитьГарантийныеСроки(ВидРасходов,ТекстСообщения = "")
	
	//Если поле Вид расходов очистили, не зачем ругаться.
	Если НЕ ЗначениеЗаполнено(ВидРасходов) тогда 
		Возврат Ложь; 
	КонецЕсли;
	
	//Проверим, какой код выбрали, если это 19 код - гарантия на деталь.
	//Нужно проверять гарантию не по продаже автомобиля, а по продаже детали.
	//для этой проверки нужно выбрать инциденты и проверить дату заказ наряда по 
	//которому деталь устанавливалась.
	Если СокрЛП(ВидРасходов.Код) = "19" ИЛИ СокрЛП(ВидРасходов.Код) = "79" тогда
		
		//Пока просто выходим
		Возврат Ложь;
		
	////DMS + 
	//ИначеЕсли ВидРасходов = Справочники.EDR_ВидыРасходов.Ex94 тогда
	//	
	//	//Обновим данные по автомобилю
	//	//Теперь посчитаем количество прошедших гарантийных дней
	//	ДатаНачалаГарантииТекущегоАвто = ЗаказНаряд.Автомобиль.ДатаНачалаГарантии; //нулевой может быть только у не проданного автомобиля.
	//	
	//	ДатаЗаказНаряд = НачалоДня(?(ЗначениеЗаполнено(ЗаказНаряд.ДатаЗакрытия),ЗаказНаряд.ДатаЗакрытия,ЗаказНаряд.ДатаНачала));
	//	
	//	Если ЗначениеЗаполнено(ДатаНачалаГарантииТекущегоАвто) тогда
	//		ДнейГарантииТекущегоАвто = (((ДатаЗаказНаряд - НачалоДня(ДатаНачалаГарантииТекущегоАвто))/60)/60)/24;
	//	КонецЕсли;
	//	
	//	//Для начала смотрим возможность использования с новым автомобилем.
	//	//для этого поле начала гарантии должно быть не пустым
	//	НовыеАвтоРазрешены = ВидРасходов.Control_NewV;
	//	
	//	Если НЕ НовыеАвтоРазрешены 
	//		и НЕ ЗначениеЗаполнено(ДатаНачалаГарантииТекущегоАвто) тогда
	//		ТекстСообщения = "Для выбранной статьи расходов не разрешено использование новых автомобилей." + Символы.ПС +
	//		"Для автомобиля - " + ЗаказНаряд.Автомобиль.Наименование + ". Не указана дата начала гарантии." + Символы.ПС + 
	//		"Проверте корректность заполнения данных у автомобиля, или выберите другую статью расходов.";
	//		
	//		Возврат Истина;
	//		
	//	КонецЕсли;
	//	
	//	//Теперь смотрим, что дней с начала гарантии больше чем дней минимально возможных
	//	МинимумДней = ВидРасходов.MinAgeDay;
	//	
	//	Если МинимумДней <> 0 
	//		и МинимумДней > ДнейГарантииТекущегоАвто тогда
	//		ТекстСообщения = "Гарантийный срок автомобиля составляет - " + ДнейГарантииТекущегоАвто + "дней." + Символы.ПС + 
	//		"Минимальный срок для гантийного случая составляет - " + МинимумДней + " дней." + Символы.ПС + 
	//		"Проверте корректность заполнения данных у автомобиля, или выберите другую статью расходов.";
	//		
	//		Возврат Истина;
	//		
	//	КонецЕсли;
	//	
	//	//Теперь смотрим что дней гарантии меньше максимально возможных
	//	МаксимумДней = ВидРасходов.MaxAgeDay;
	//	
	//	Если НЕ ЗначениеЗаполнено(ДнейГарантииТекущегоАвто) ИЛИ (МаксимумДней <> 9999 
	//		и МаксимумДней < ДнейГарантииТекущегоАвто) тогда
	//		ТекстСообщения = "Гарантийный срок автомобиля составляет - " + ДнейГарантииТекущегоАвто + "дней." + Символы.ПС + 
	//		"Максимальный срок для гантийного случая составляет - " + МаксимумДней + " дней." + Символы.ПС + 
	//		"Проверте корректность заполнения данных у автомобиля, или выберите другую статью расходов.";
	//		
	//		Возврат Истина;
	//		
	//	КонецЕсли;
	////DMS - 
	Иначе
		//Обновим данные по автомобилю
		//Теперь посчитаем количество прошедших гарантийных дней
		ДатаНачалаГарантииТекущегоАвто = ЗаказНаряд.Автомобиль.ДатаНачалаГарантии; //нулевой может быть только у не проданного автомобиля.
		
		Если ЗначениеЗаполнено(ДатаНачалаГарантииТекущегоАвто) тогда
			
			ДнейГарантииТекущегоАвто = (((НачалоДня(ЗаказНаряд.ДатаСоздания) - НачалоДня(ДатаНачалаГарантииТекущегоАвто))/60)/60)/24;
			
		КонецЕсли;
		
		//Для начала смотрим возможность использования с новым автомобилем.
		//для этого поле начала гарантии должно быть не пустым
		НовыеАвтоРазрешены = ВидРасходов.Control_NewV;
		
		Если НЕ НовыеАвтоРазрешены 
			и НЕ ЗначениеЗаполнено(ДатаНачалаГарантииТекущегоАвто) тогда
			ТекстСообщения = "Для выбранной статьи расходов не разрешено использование новых автомобилей." + Символы.ПС +
			"Для автомобиля - " + ЗаказНаряд.Автомобиль.Наименование + ". Не указана дата начала гарантии." + Символы.ПС + 
			"Проверте корректность заполнения данных у автомобиля, или выберите другую статью расходов.";
			
			Возврат Истина;
			
		КонецЕсли;
		
		//Теперь смотрим, что дней с начала гарантии больше чем дней минимально возможных
		МинимумДней = ВидРасходов.MinAgeDay;
		
		Если МинимумДней <> 0 
			и МинимумДней > ДнейГарантииТекущегоАвто тогда
			ТекстСообщения = "Гарантийный срок автомобиля составляет - " + ДнейГарантииТекущегоАвто + "дней." + Символы.ПС + 
			"Минимальный срок для гантийного случая составляет - " + МинимумДней + " дней." + Символы.ПС + 
			"Проверте корректность заполнения данных у автомобиля, или выберите другую статью расходов.";
			
			Возврат Истина;
			
		КонецЕсли;
		
		//Теперь смотрим что дней гарантии меньше максимально возможных
		МаксимумДней = ВидРасходов.MaxAgeDay;
		
		Если НЕ ЗначениеЗаполнено(ДнейГарантииТекущегоАвто) ИЛИ (МаксимумДней <> 9999 
			и МаксимумДней < ДнейГарантииТекущегоАвто) тогда
			ТекстСообщения = "Гарантийный срок автомобиля составляет - " + ДнейГарантииТекущегоАвто + "дней." + Символы.ПС + 
			"Максимальный срок для гантийного случая составляет - " + МаксимумДней + " дней." + Символы.ПС + 
			"Проверте корректность заполнения данных у автомобиля, или выберите другую статью расходов.";
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Если все еще тут, значит все нормально.
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура НастроитьКолонкуНомерСогласованияИнцидентов()
	
	//Инициализация флага
	Отображать = Ложь;
	
	//При просрочке более 30 дней, заказ наряд может быть уже отправлен, поэтому расчитывать просрочку 
	//для отправленных нет смысла
	Если Не Отправлен тогда
		//Теперь смотрим на сколько запаздывает начало заказ наряда от текущей даты
		//если запоздание более или равно 30 дней - нужно колонку открывать
		
		ДатаНачала	  = НачалоДня(ЗаказНаряд.ДатаСоздания);
		ДнейПросрочки = Число(?(ТекущаяДата() - ДатаНачала = 0,1, ТекущаяДата() - ДатаНачала))/60/60/24;
		
		Если Окр(ДнейПросрочки) >= 30 тогда
			Отображать = Истина;
		КонецЕсли;
		
	Иначе
		
		Отображать = ПовторнаяОтправка;
				
	КонецЕсли;
	
	
	//Если Отображать уже истина - нет смысла выполнять запрос.
	Если НЕ Отображать тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ТабСчета.ЗаказНаряд,
		|	ТабСчета.ВидРасходов
		|ПОМЕСТИТЬ ТабСчетов
		|ИЗ
		|	&ТабСчета КАК ТабСчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ТабСчетов.ВидРасходов = ЗНАЧЕНИЕ(Справочник.EDR_ВидыРасходов.Ex57)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьКод57
		|ИЗ
		|	ТабСчетов КАК ТабСчетов
		|ГДЕ
		|	ТабСчетов.ВидРасходов = ЗНАЧЕНИЕ(Справочник.EDR_ВидыРасходов.Ex57)
		|	И ТабСчетов.ЗаказНаряд = &ЗаказНаряд
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТабСчетов"
		);
		Запрос.УстановитьПараметр("ТабСчета",   ТаблицаСчетов.Выгрузить());
		Запрос.УстановитьПараметр("ЗаказНаряд", ЗаказНаряд);
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() и Результат.ЕстьКод57 тогда
			Отображать = Истина
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ТаблицаИнцидентовНомерСогласования.Видимость = Отображать;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьИспользованиеСчета(ИдентификаторСчета) Экспорт
	
	СтруктураРезультата = Новый Структура;
	
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	//Таблицы в Менеджер
	//Соответствия
	ТекстЗапроса = "ВЫБРАТЬ * ПОМЕСТИТЬ ВТСоответствия
	|ИЗ
	|	&ТаблицаСоответствий КАК ТаблицаСоответствий";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТаблицаСоответствий",ТаблицаСоответствий.Выгрузить());
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТСоответствия.Идентификатор,
	|	ВТСоответствия.ИдентификаторСчета
	|ИЗ
	|	ВТСоответствия КАК ВТСоответствия
	|ГДЕ
	|	ВТСоответствия.ИдентификаторСчета = &ИдентификаторСчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСоответствия";
	
	Запрос.УстановитьПараметр("ИдентификаторСчета",ИдентификаторСчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИдентификаторов = РезультатЗапроса.Выбрать();
	
	МассивИдентификаторов = Новый Массив;
	
	Пока ВыборкаИдентификаторов.Следующий() Цикл
		МассивИдентификаторов.Добавить(ВыборкаИдентификаторов.Идентификатор);	
	КонецЦикла; 
	
	СтруктураРезультата.Вставить("Соответствия",МассивИдентификаторов);
	
	Если МассивИдентификаторов.Количество() > 0 тогда
		СтруктураРезультата.Вставить("ЕстьИспользование", Истина);
	Иначе
		СтруктураРезультата.Вставить("ЕстьИспользование", Ложь);
	КонецЕсли;
	
	Возврат СтруктураРезультата;
	
КонецФункции

&НаКлиенте
Процедура ВыбратьДругойСчет(СтруктураИспользованияСчета,ИдентификаторСчета,Успешно)
	
	МодифицированностьДо = Модифицированность;
	
	Для каждого ТекущаяСтрока Из ТаблицаСчетов Цикл
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ЗаказНаряд) Тогда
			ТекущаяСтрока.ЗаказНаряд = ЗаказНаряд;
		КонецЕсли; 		
	КонецЦикла; 
	
	//СтруктураПоиска = Новый Структура("ЗаказНаряд,Удален",ЗаказНаряд,Ложь);
	
	//СтрокиСчетовПоИдентификатору = ТаблицаСчетов.НайтиСтроки(СтруктураПоиска);
	
	СписокСчетов = Новый СписокЗначений;
	
	Для каждого ТекущаяСтрока Из ТаблицаСчетов Цикл
		
		Если ИдентификаторСчета <> ТекущаяСтрока.ИдентификаторСчета Тогда
			СписокСчетов.Добавить(ТекущаяСтрока.ИдентификаторСчета,ТекущаяСтрока.Счет);
		КонецЕсли; 
				
	КонецЦикла; 
		
	ПараметрыФормы = Новый Структура("СписокСчетов,ИдентификаторСчета",СписокСчетов,ИдентификаторСчета);
	
	ОткрытьФорму("Обработка.EDR_АРМПоГарантииNew.Форма.ФормаВыбораСчета",ПараметрыФормы,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСчетовПередНачаломДобавленияЗавершение(Результат, Параметры) Экспорт 

    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	
	НоваяСтрока = ТаблицаСчетов.Добавить();
	НоваяСтрока.Счет		= ПолучитьСледующийНомерСчета();
	НоваяСтрока.ДатаИнвойса = ЗаказНаряд.ДатаОкончания;
	НоваяСтрока.ЗаказНаряд  = ЗаказНаряд;
	
	НоваяСтрока.ИдентификаторСчета = Строка(Новый УникальныйИдентификатор());
	
	ОбновитьСпискиВыбораСчетов();
	
	Модифицированность = Истина;
	
КонецПроцедуры // ТаблицаСчетовПередНачаломДобавленияЗавершение()

&НаСервере
Процедура ОбновитьСпискиВыбораСчетов()
	
	Отбор = Новый Структура("ЗаказНаряд",ЗаказНаряд);
	МассивСчетов = ТаблицаСчетов.Выгрузить(Отбор,"Счет").ВыгрузитьКолонку("Счет");
	
	Элементы.ТаблицаСоответствийСчет.СписокВыбора.ЗагрузитьЗначения(МассивСчетов);	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСледующийНомерСчета() Экспорт
	
	Отбор = Новый Структура("ЗаказНаряд", ЗаказНаряд);
	
	СчетаЗаказа = ТаблицаСчетов.НайтиСтроки(Отбор);
	
	ПаттернСозданныхСчетов = "";
	
	СвободныеЛитералы = Строка(ПаттернЛитераловНомеров);
	
	Для каждого ТекСчет из СчетаЗаказа Цикл
		СвободныеЛитералы = СтрЗаменить(СвободныеЛитералы, Прав(ТекСчет.Счет, 1),"");
	КонецЦикла;
	
	ТекущийЛитерал = Лев(СвободныеЛитералы, 1);
	
	НомерДокумента = "" + EDR_КешируемыеЗначения.ПолучитьНомерДляПечати(ЗаказНаряд) + ТекущийЛитерал;
	
	Возврат НомерДокумента;
	
КонецФункции //ПолучитьСледующийНомерСчета(ТекущийЗаказ)

&НаКлиенте
Процедура ВыбратьДругойИнцидент(СтруктураИспользованияИнцидента,ИдентификаторИнцидента,Успешно)
	
	МодифицированностьДо = Модифицированность;
	
	Для каждого ТекущаяСтрока Из ТаблицаИнцидентов Цикл
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ЗаказНаряд) Тогда
			ТекущаяСтрока.ЗаказНаряд = ЗаказНаряд;
		КонецЕсли; 		
	КонецЦикла; 
	
	Модифицированность = МодифицированностьДо;
	
	Успешно = Ложь;
		
	СписокИнцидентов = Новый СписокЗначений;
	
	//СтруктураПоиска = Новый Структура("ЗаказНаряд,Удален",ЗаказНаряд,Ложь);
	
	//СтрокиИнцидентов = ТаблицаИнцидентов.НайтиСтроки(СтруктураПоиска);
	
	Для каждого ТекущаяСтрока Из ТаблицаИнцидентов Цикл
		
		Если ИдентификаторИнцидента <> ТекущаяСтрока.ИдентификаторИнцидента Тогда
			СписокИнцидентов.Добавить(ТекущаяСтрока.ИдентификаторИнцидента,ТекущаяСтрока.Инцидент);
		КонецЕсли; 
				
	КонецЦикла; 
		
	ПараметрыФормы = Новый Структура("СписокИнцидентов,ИдентификаторИнцидента",СписокИнцидентов,ИдентификаторИнцидента);
	
	ОткрытьФорму("Обработка.EDR_АРМПоГарантииNew.Форма.ФормаВыбораИнцидента",ПараметрыФормы,ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСледующийНомерИнцидента() Экспорт
	
	//Первоначальная инициализация
	ТекущийЛитерал = неопределено;
		
	Отбор = Новый Структура("ЗаказНаряд", ЗаказНаряд);
	
	ИнцидентыЗаказа = ТаблицаИнцидентов.НайтиСтроки(Отбор);
	
	СвободныеЛитералы = Строка(ПаттернЛитераловНомеров);
	
	Для каждого ТекИнцидент из ИнцидентыЗаказа Цикл
		
		СвободныеЛитералы = СтрЗаменить(СвободныеЛитералы, ТекИнцидент.Инцидент, "");
		
	КонецЦикла;
	
	ТекущийЛитерал = Лев(СвободныеЛитералы, 1);
	
	Возврат ТекущийЛитерал;
	
КонецФункции // ПолучитьСледующийНомерИнцидента(ТекущийЗаказ)

&НаСервере
Процедура ОбновитьСпискиВыбораИнцидентов()
	
	//Выпадающий список Инцидентов для работ, товаров и соответствия.
	ОтборСтрок = Новый Структура("ЗаказНаряд,Удален",ЗаказНаряд,Ложь);
	
	МассивИнцидентов = ТаблицаИнцидентов.Выгрузить(ОтборСтрок,"Инцидент").ВыгрузитьКолонку("Инцидент");
	
	Элементы.ТаблицаТоваровИнцидент.СписокВыбора.ЗагрузитьЗначения(МассивИнцидентов);
	Элементы.ТаблицаРаботыИнцидент.СписокВыбора.ЗагрузитьЗначения(МассивИнцидентов);
	Элементы.ТаблицаСоответствийИнцидент.СписокВыбора.ЗагрузитьЗначения(МассивИнцидентов);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьИспользованиеИнцидента(ИдентификаторИнцидента) Экспорт
	
	СтруктураРезультата = Новый Структура;
	
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	//Таблицы в Менеджер
	//Товары
	ТекстЗапроса = "ВЫБРАТЬ * ПОМЕСТИТЬ ВТТовары
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТаблицаТоваров",ТаблицаТоваров.Выгрузить());
	Запрос.Выполнить();
	
	//Работы
	ТекстЗапроса = "ВЫБРАТЬ * ПОМЕСТИТЬ ВТРаботы
	|ИЗ
	|	&ТаблицаРабот КАК ТаблицаРабот";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТаблицаРабот",ТаблицаРаботы.Выгрузить());
	Запрос.Выполнить();

	//Соответствия
	ТекстЗапроса = "ВЫБРАТЬ * ПОМЕСТИТЬ ВТСоответствия
	|ИЗ
	|	&ТаблицаСоответствий КАК ТаблицаСоответствий";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТаблицаСоответствий",ТаблицаСоответствий.Выгрузить());
	Запрос.Выполнить();
	
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТТовары.ИдентификаторТовара,
	|	ВТТовары.Номенклатура,
	|	ВТТовары.ИдентификаторИнцидента
	|ИЗ
	|	ВТТовары КАК ВТТовары
	|ГДЕ
	|	ВТТовары.ИдентификаторИнцидента = &ИдентификаторИнцидента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТТовары";
	
	Запрос.УстановитьПараметр("ИдентификаторИнцидента",ИдентификаторИнцидента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТовары = РезультатЗапроса.Выбрать();
	
	МассивТоваров = Новый Массив;
	
	Пока ВыборкаТовары.Следующий() Цикл
		МассивТоваров.Добавить(ВыборкаТовары.ИдентификаторТовара);	
	КонецЦикла; 
	
	СтруктураРезультата.Вставить("Товары",МассивТоваров);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТРаботы.ИдентификаторРаботы,
	|	ВТРаботы.Работа,
	|	ВТРаботы.ИдентификаторИнцидента
	|ИЗ
	|	ВТРаботы КАК ВТРаботы
	|ГДЕ
	|	ВТРаботы.ИдентификаторИнцидента = &ИдентификаторИнцидента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТРаботы";
	Запрос.УстановитьПараметр("ИдентификаторИнцидента",ИдентификаторИнцидента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаРабот = РезультатЗапроса.Выбрать();
	
	МассивРабот = Новый Массив;
	
	Пока ВыборкаРабот.Следующий() Цикл
		МассивРабот.Добавить(ВыборкаРабот.ИдентификаторРаботы);	
	КонецЦикла; 
		
	СтруктураРезультата.Вставить("Работы",МассивРабот);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТСоответствия.Идентификатор,
	|	ВТСоответствия.ИдентификаторИнцидента
	|ИЗ
	|	ВТСоответствия КАК ВТСоответствия
	|ГДЕ
	|	ВТСоответствия.ИдентификаторИнцидента = &ИдентификаторИнцидента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСоответствия";
	Запрос.УстановитьПараметр("ИдентификаторИнцидента",ИдентификаторИнцидента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИнцидентов = РезультатЗапроса.Выбрать();
	
	МассивИнцидентов = Новый Массив;
	
	Пока ВыборкаИнцидентов.Следующий() Цикл
		МассивИнцидентов.Добавить(ВыборкаИнцидентов.Идентификатор);	
	КонецЦикла; 
	
	СтруктураРезультата.Вставить("Соответствия",МассивИнцидентов);
	
	Если МассивТоваров.Количество() > 0 
	 или МассивРабот.Количество() > 0 
	 или МассивИнцидентов.Количество() > 0 тогда
		СтруктураРезультата.Вставить("ЕстьИспользование", Истина);
	Иначе
		СтруктураРезультата.Вставить("ЕстьИспользование", Ложь);
	КонецЕсли;
	
	Возврат СтруктураРезультата;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСлужебныеРеквизитыТаблицыИнциденты()

	Для каждого ТекущаяСтрока Из ТаблицаИнцидентов Цикл
		
		//Отрабатываем логику доступа из параметров ExpenceCode
		ТекущаяСтрока.Control_EC = ПолучитьПараметр_Булево_ExpenceCode(ЗаказНаряд,,ТекущаяСтрока.ИдентификаторИнцидента,"Control_EC");
		
		//Если Не ТекущаяСтрока.Control_EC Тогда
		//	ТекущаяСтрока.КодОщущенияКлиента = Неопределено;
		//КонецЕсли; 
		
		НайденныеСтрокиСоответствия = ТаблицаСоответствий.НайтиСтроки(Новый Структура("ИдентификаторИнцидента,Type",ТекущаяСтрока.ИдентификаторИнцидента,"Parts")); 
		
		ТекущаяСтрока.ЕстьСоответствие = (ТаблицаСоответствий.НайтиСтроки(Новый Структура("ИдентификаторИнцидента",ТекущаяСтрока.ИдентификаторИнцидента)).Количество() > 0);
		
		ТекущаяСтрока.Type = ?(НайденныеСтрокиСоответствия.Количество()>0,"Parts","");
		
		ТекущаяСтрока.НомерСогласованияОбязателен = НастроитьДоступКолонкеНомерСогласованияИнцидентов(ТекущаяСтрока.ИдентификаторИнцидента);
		
		//ТекущаяСтрока.НомерСогласования = "";
		
	КонецЦикла; 	

КонецПроцедуры // ЗаполнитьСлужебныеРеквизитыТаблицыИнциденты()

&НаСервере
Функция НастроитьДоступКолонкеНомерСогласованияИнцидентов(ТекущийИнцидент)
	
	ОтображатьКолонку = Элементы.ТаблицаИнцидентовНомерСогласования.Видимость;
	
	//Колонка видна, значит ищем счет по номеру инцидента
	Если ОтображатьКолонку тогда
				
		//Смотрим повторная отправка или нет
		Если ПовторнаяОтправка тогда
			
			Возврат Истина; //Продолжать проверку далее нет смысла.
			
		КонецЕсли;
		
		//Теперь смотрим на сколько запаздывает начало заказ наряда от текущей даты
		//если запоздание более или равно 30 дней - нужно обязательно заполнять поле
		ДатаНачала    = НачалоДня(ЗаказНаряд.ДатаСоздания);
		ДнейПросрочки = Число(?(ТекущаяДата() - ДатаНачала = 0,1, ТекущаяДата() - ДатаНачала))/60/60/24;
	
		Если Окр(ДнейПросрочки) >= 30 тогда
			Возврат Истина
		КонецЕсли;
		
		//Если все еще тут, значит проверяем по ExCode
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ТабСоответствий.ИдентификаторИнцидента,
		|	ТабСоответствий.ИдентификаторСчета,
		|	ТабСоответствий.ЗаказНаряд,
		|	ТабСоответствий.Инцидент,
		|	ТабСоответствий.Счет
		|ПОМЕСТИТЬ ТабСоответствий
		|ИЗ
		|	&ТабСоответствий КАК ТабСоответствий
		|ГДЕ
		|	ТабСоответствий.ЗаказНаряд = &ЗаказНаряд
		|	И ТабСоответствий.ИдентификаторИнцидента = &ИдентификаторИнцидента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабСчета.ЗаказНаряд,
		|	ТабСчета.ВидРасходов,
		|	ТабСчета.ИдентификаторСчета,
		|	ТабСчета.Счет
		|ПОМЕСТИТЬ ТабСчетов
		|ИЗ
		|	&ТабСчета КАК ТабСчета
		|ГДЕ
		|	ТабСчета.ЗаказНаряд = &ЗаказНаряд
		|	И ТабСчета.ВидРасходов = ЗНАЧЕНИЕ(Справочник.EDR_ВидыРасходов.Ex57)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ТабСчетов.ВидРасходов = ЗНАЧЕНИЕ(Справочник.EDR_ВидыРасходов.Ex57)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьКод57
		|ИЗ
		|	ТабСоответствий КАК ТабСоответствий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабСчетов КАК ТабСчетов
		|		ПО ТабСоответствий.ИдентификаторСчета = ТабСчетов.ИдентификаторСчета
		|			И ТабСоответствий.ЗаказНаряд = ТабСчетов.ЗаказНаряд
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТабСчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТабСоответствий"
		);
		
		Запрос.УстановитьПараметр("ТабСоответствий", ТаблицаСоответствий.Выгрузить());
		Запрос.УстановитьПараметр("ТабСчета", 		 ТаблицаСчетов.Выгрузить());
		
		Запрос.УстановитьПараметр("ЗаказНаряд", 			ЗаказНаряд);
		Запрос.УстановитьПараметр("ИдентификаторИнцидента", ТекущийИнцидент);
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() и Результат.ЕстьКод57 тогда
			
			Возврат Истина
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ложь;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРеквизитСсылки(Ссылка,ИмяРеквизита)

	Возврат Ссылка[ИмяРеквизита];

КонецФункции // ПолучитьРеквизитСсылки()

&НаКлиенте
Процедура ВосстановитьСписокДеталейЗавершение(Результат, Параметры) Экспорт 
	
	Если Результат = "НеВосстановить" Тогда
        Возврат;
    КонецЕсли;
	
	ТекстОшибок = "";
	
	ВосстановитьСписокДеталейНаСервере(ТекстОшибок);
	
	Если ТекстОшибок <> "" Тогда
		Предупреждение(ТекстОшибок,15,"Возникла ошибка");
	КонецЕсли; 
	
	Модифицированность = Истина;
	
КонецПроцедуры // ВосстановитьСписокДеталейЗавершение()

&НаСервере
Процедура ВосстановитьСписокДеталейНаСервере(ТекстСообщения)

	//Удаляем текущие записи.
	РегистрыСведений.EDR_ТоварыДоп.УдалитьЗаписиПоЗаказНаряду(ЗаказНаряд);
	
	СтруктураПоискаИнцидентов = Новый Структура("ЗаказНаряд,Инцидент",ЗаказНаряд,"A");
	
	НайденныеСтроки = ТаблицаИнцидентов.НайтиСтроки(СтруктураПоискаИнцидентов);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	СтрокаИнцидентов = НайденныеСтроки[0];
	
	GUID_Инцидента = СтрокаИнцидентов.ИдентификаторИнцидента;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("GUID_Инцидента", GUID_Инцидента);
	Запрос.УстановитьПараметр("ЗаказНаряд", 	ЗаказНаряд);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Товары.Ссылка КАК ЗаказНаряд,
		|	Товары.Номенклатура КАК Номенклатура,
		|	&GUID_Инцидента КАК GUID_Инцидента,
		|	ИСТИНА КАК СтрокаИзЗаказНаряда
		|ИЗ
		|	Документ.ЗаказНаряд.Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &ЗаказНаряд";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Попытка
		
		//Теперь Передаем таблицу в менеджер регистра и записываем
		Результат = РегистрыСведений.EDR_ТоварыДоп.ЗаписатьТовары(РезультатЗапроса.Выгрузить());
		
		Если Результат тогда
			ПриСозданииНаСервере(Ложь,Ложь);
		Иначе
			ТекстСообщения = "Не удалось записать";
		КонецЕсли;
		
	Исключение
		ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
		
КонецПроцедуры // ВосстановитьСписокДеталейНаСервере()

&НаКлиенте
Процедура ВосстановитьРаботыЗавершение(Результат, Параметры) Экспорт 
	
	Если Результат = "НеВосстановить" Тогда
        Возврат;
    КонецЕсли;
	
	ТекстОшибок = "";
	
	ВосстановитьРаботыЗавершениеНаСервере(ТекстОшибок);
	
	Если ТекстОшибок <> "" Тогда
		Предупреждение(ТекстОшибок,15,"Возникла ошибка");
	КонецЕсли; 
	
	Модифицированность = Истина;
	
КонецПроцедуры // ВосстановитьСписокДеталейЗавершение()

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, Параметры, Отказ, СтандартнаяОбработка) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		
		Модифицированность = Ложь;
		
		//Закрыть();
		
		Возврат;
		
	Иначе 
		
		//Отказ = Истина;
		//СтандартнаяОбработка = Ложь;
		СохранитьИзменения(Неопределено, Отказ, Истина);
		
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытиемЗавершение()

&НаСервере
Процедура ВосстановитьРаботыЗавершениеНаСервере(ТекстСообщения)

	//Удаляем текущие записи.
	РегистрыСведений.EDR_РаботыДоп.УдалитьЗаписиПоЗаказНаряду(ЗаказНаряд);
	
	СтруктураПоискаИнцидентов = Новый Структура("ЗаказНаряд, Инцидент", ЗаказНаряд, "A");
	
	НайденныеСтроки = ТаблицаИнцидентов.НайтиСтроки(СтруктураПоискаИнцидентов);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаИнцидентов = НайденныеСтроки[0];
	
	GUID_Инцидента = СтрокаИнцидентов.ИдентификаторИнцидента;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("GUID_Инцидента", GUID_Инцидента);
	Запрос.УстановитьПараметр("ЗаказНаряд", 	ЗаказНаряд);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Работы.Ссылка КАК ЗаказНаряд,
		|	Работы.ИдентификаторРаботы КАК GUID_Работы,
		|	&GUID_Инцидента КАК GUID_Инцидента,
		|	ИСТИНА КАК СтрокаИзЗаказНаряда
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК Работы
		|ГДЕ
		|	Работы.Ссылка = &ЗаказНаряд";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Попытка
		
		//Теперь Передаем таблицу в менеджер регистра и записываем
		Результат = РегистрыСведений.EDR_РаботыДоп.ЗаписатьРаботы(РезультатЗапроса.Выгрузить());
		
		Если Результат тогда
			ПриСозданииНаСервере(Ложь,Ложь);
		Иначе
			ТекстСообщения = "Не удалось записать";
		КонецЕсли;
		
	Исключение
		
		ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
КонецПроцедуры // ВосстановитьРаботыЗавершениеНаСервере()

&НаСервере
Процедура РассчитатьСтоимостьТоваров(ТекущаяСтрока)
	
	НДС_В_Сумме = ЗаказНаряд.ТипЦен.ЦенаВключаетНДС;
	
	Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	
	Если НДС_В_Сумме тогда
		
		Сумма	   = Сумма - ТекущаяСтрока.СуммаСкидки;
		СуммаНДС   = Сумма - (100 *Сумма / (100 + ТекущаяСтрока.СтавкаНДС.Ставка)); 
		СуммаВсего = Сумма; //НДС в сумме, значит ничего прибавлять уже не надо
		
	Иначе
		
		Сумма      = Сумма - ТекущаяСтрока.СуммаСкидки;
		СуммаНДС   = Сумма * ТекущаяСтрока.СтавкаНДС.Ставка / 100;
		СуммаВсего = Сумма + СуммаНДС;
		
	КонецЕсли;
	
	ТекущаяСтрока.СуммаНДС   = СуммаНДС;
	ТекущаяСтрока.СуммаВсего = СуммаВсего;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСтоимостьРабот(ТекущаяСтрока)
	
	НДС_В_Сумме = ЗаказНаряд.ТипЦен.ЦенаВключаетНДС;
	
	Попытка
		
		Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент * ТекущаяСтрока.Цена;
		
	Исключение
		
		Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
		
	КонецПопытки;
	
	Если НДС_В_Сумме тогда
		
		Сумма      = Сумма - ТекущаяСтрока.СуммаСкидки;
		СуммаНДС   = Сумма - (100 *Сумма / (100 + ТекущаяСтрока.СтавкаНДС.Ставка)); 
		СуммаВсего = Сумма; //НДС в сумме, значит ничего прибавлять уже не надо
		
	Иначе
		
		Сумма 	   = Сумма - ТекущаяСтрока.СуммаСкидки;
		СуммаНДС   = Сумма * ТекущаяСтрока.СтавкаНДС.Ставка / 100;
		СуммаВсего = Сумма + СуммаНДС;
		
	КонецЕсли;
	
	ТекущаяСтрока.СуммаНДС  = СуммаНДС;
	ТекущаяСтрока.СуммаВсего = СуммаВсего;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСтроки(Строка, СтруктураПараметров) Экспорт 
	
	СтрокаРабот = СтруктураПараметров.СтрокаРабот;
	
	Если Строка = Неопределено Или Строка = "" Тогда
		СтруктураПараметров.СтрокаРабот.Работа = "<Операция не закодирована> " + СтруктураПараметров.СтрокаПоУмолчанию;	
	Иначе
		СтруктураПараметров.СтрокаРабот.Работа = Строка;
	КонецЕсли;
	
КонецПроцедуры // ПослеВводаСтроки()

&НаСервере
Процедура ЗаполнитьСлужебныеРеквизитыТаблицыТовары()
	
	Для каждого ТекущаяСтрока Из ТаблицаТоваров Цикл
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.ИдентификаторИнцидента) тогда
			
			ТекущаяСтрока.Control_Indicator = ПолучитьПараметр_Булево_ExpenceCode(ЗаказНаряд, неопределено, ТекущаяСтрока.ИдентификаторИнцидента, "Control_Indicator");
			
			Если ТекущаяСтрока.Control_Indicator Тогда
				
				СтруктураПоиска = Новый Структура("ЗаказНаряд, ИдентификаторИнцидента, ПричинаОбращения", ЗаказНаряд, ТекущаяСтрока.ИдентификаторИнцидента, Истина);
				
				СтрокиНайденные = ТаблицаТоваров.НайтиСтроки(СтруктураПоиска);
				
				Если СтрокиНайденные.Количество() > 0 
					И Не ТекущаяСтрока.ПричинаОбращения Тогда
					
					ТекущаяСтрока.ЗапретВводаПричиныОбращения = Истина;
					
				КонецЕсли;
				
			Иначе 
				
				ТекущаяСтрока.ЗапретВводаПричиныОбращения = Истина;
				
			КонецЕсли;
			
		Иначе 
			ТекущаяСтрока.ЗапретВводаПричиныОбращения = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьСлужебныеРеквизитыТаблицыТовары()

&НаСервере
Процедура ЗаполнитьСлужебныеРеквизитыТаблицыРаботы()
	
	Для каждого ТекущаяСтрока Из ТаблицаРаботы Цикл
		
		ТекущаяСтрока.ЗапретВводаПричиныОбращения = Ложь;
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.ИдентификаторИнцидента) тогда
			
			ТекущаяСтрока.Control_Indicator = ПолучитьПараметр_Булево_ExpenceCode(ЗаказНаряд, неопределено, ТекущаяСтрока.ИдентификаторИнцидента, "Control_Indicator");
			
			Если ТекущаяСтрока.Control_Indicator Тогда
				
				СтруктураПоиска = Новый Структура("ЗаказНаряд, ИдентификаторИнцидента, ПричинаОбращения", ЗаказНаряд, ТекущаяСтрока.ИдентификаторИнцидента, Истина);
				
				СтрокиНайденные = ТаблицаТоваров.НайтиСтроки(СтруктураПоиска);
				
				Если СтрокиНайденные.Количество() > 0 
					И Не ТекущаяСтрока.ПричинаОбращения Тогда
					
					ТекущаяСтрока.ЗапретВводаПричиныОбращения = Истина;
					
				КонецЕсли;
				
			Иначе
				
				ТекущаяСтрока.ЗапретВводаПричиныОбращения = Истина;
				
			КонецЕсли;
			
		Иначе
			
			ТекущаяСтрока.ЗапретВводаПричиныОбращения = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьСлужебныеРеквизитыТаблицыРаботы()

&НаСервере
Процедура ЗаполнитьСлужебныеРеквизитыСтрокиТаблицыРаботы(ТекущаяСтрока)
	
	ТекущаяСтрока.ЗапретВводаПричиныОбращения = Ложь;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.ИдентификаторИнцидента) тогда
		
		ТекущаяСтрока.Control_Indicator = ПолучитьПараметр_Булево_ExpenceCode(ЗаказНаряд,неопределено,ТекущаяСтрока.ИдентификаторИнцидента,"Control_Indicator");
		
		Если ТекущаяСтрока.Control_Indicator Тогда
			
			СтруктураПоиска = Новый Структура("ЗаказНаряд,ИдентификаторИнцидента,ПричинаОбращения",ЗаказНаряд,ТекущаяСтрока.ИдентификаторИнцидента,Истина);
			
			СтрокиНайденные = ТаблицаТоваров.НайтиСтроки(СтруктураПоиска);
			
			Если СтрокиНайденные.Количество() > 0 
				И Не ТекущаяСтрока.ПричинаОбращения Тогда
				
				ТекущаяСтрока.ЗапретВводаПричиныОбращения = Истина;
				
			КонецЕсли; 
			
		Иначе 
			
			ТекущаяСтрока.ЗапретВводаПричиныОбращения = Истина;
			
		КонецЕсли; 
		
	Иначе 
		ТекущаяСтрока.ЗапретВводаПричиныОбращения = Истина;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСлужебныеРеквизитыТаблицыРаботы()

&НаСервере
Процедура ИнициализироватьОбмен()
	
	// обмен теперь выполняется регламентным заданием
	Возврат;
	
	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(Неопределено);
	ФоновыеЗадания.Выполнить("DMS_ВыгрузкаДанныхАвтосервиса.ВыгрузкаДанныхПоГарантии", ПараметрыЗадания,,"Синхронизация гарантийных заявок Renault");
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеОтзывнойНоты(Отказ,СформироватьТаблицуОшибок = Ложь)

	Если Не OTS Тогда
		Возврат;
	КонецЕсли;
	
	Если ТаблицаСчетов.Количество() <= 1 Тогда
		Возврат;
	КонецЕсли; 
	
	СтруктураПоиска = Новый Структура("ВидРасходов", Справочники.EDR_ВидыРасходов.Ex91);
	
	ТаблицаСчетов_Ex91 = ТаблицаСчетов.Выгрузить(СтруктураПоиска);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаСчетов_Ex91",   ТаблицаСчетов_Ex91);
	Запрос.УстановитьПараметр("мТаблицаИнцидентов",   ТаблицаИнцидентов.Выгрузить());
	Запрос.УстановитьПараметр("мТаблицаСоответствий", ТаблицаСоответствий.Выгрузить());
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	мТаблицаСчетов.ИдентификаторСчета,
		|	мТаблицаСчетов.ВидРасходов
		|ПОМЕСТИТЬ ТаблицаСчетов
		|ИЗ
		|	&ТаблицаСчетов_Ex91 КАК мТаблицаСчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	мТаблицаИнцидентов.ИдентификаторИнцидента,
		|	мТаблицаИнцидентов.ОтзывнаяНота,
		|	мТаблицаИнцидентов.Инцидент,
		|	мТаблицаИнцидентов.ЗаказНаряд
		|ПОМЕСТИТЬ ТаблицаИнцидентов
		|ИЗ
		|	&мТаблицаИнцидентов КАК мТаблицаИнцидентов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	мТаблицаСоответствий.ИдентификаторИнцидента,
		|	мТаблицаСоответствий.ИдентификаторСчета,
		|	мТаблицаСоответствий.ВидРасходов
		|ПОМЕСТИТЬ ТаблицаСоответсвий
		|ИЗ
		|	&мТаблицаСоответствий КАК мТаблицаСоответствий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаСоответсвий.ИдентификаторИнцидента,
		|	ТаблицаСоответсвий.ИдентификаторСчета,
		|	ТаблицаСоответсвий.ВидРасходов
		|ПОМЕСТИТЬ СчетаEx91
		|ИЗ
		|	ТаблицаСоответсвий КАК ТаблицаСоответсвий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСчетов КАК ТаблицаСчетов
		|		ПО ТаблицаСоответсвий.ИдентификаторСчета = ТаблицаСчетов.ИдентификаторСчета
		|			И (ТаблицаСчетов.ВидРасходов = ЗНАЧЕНИЕ(Справочник.EDR_ВидыРасходов.Ex91))
		|			И ТаблицаСоответсвий.ВидРасходов = ТаблицаСчетов.ВидРасходов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ТаблицаИнцидентов.ИдентификаторИнцидента КАК ИдентификаторИнцидента,
		|	ТаблицаИнцидентов.ОтзывнаяНота,
		|	ТаблицаИнцидентов.Инцидент,
		|	""В таблице 'Инциденты' для инцидента: '"" + ТаблицаИнцидентов.Инцидент + ""' не указана отзывная нота"" КАК ОписаниеОшибки,
		|	""-"" КАК Заявка,
		|	""Отзывная нота"" КАК Объект,
		|	ТаблицаИнцидентов.ЗаказНаряд КАК ЗаказНаряд
		|ИЗ
		|	СчетаEx91 КАК СчетаEx91
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаИнцидентов КАК ТаблицаИнцидентов
		|		ПО (ТаблицаИнцидентов.ОтзывнаяНота = ЗНАЧЕНИЕ(Справочник.СервисныеКампании.ПустаяСсылка))
		|			И СчетаEx91.ИдентификаторИнцидента = ТаблицаИнцидентов.ИдентификаторИнцидента
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИдентификаторИнцидента
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Отказ = Ложь;
	
	ВыборкаОшибок = Запрос.Выполнить().Выбрать();
	
	Если СформироватьТаблицуОшибок Тогда
		
		Пока ВыборкаОшибок.Следующий() Цикл
			
			НоваяСтрока = ТаблицаОшибок.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаОшибок);
			
			Если ТаблицаОшибокРаботыТовары <> Неопределено Тогда
				НоваяСтрокаРаботыТовары = ТаблицаОшибокРаботыТовары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаРаботыТовары, ВыборкаОшибок);
			КонецЕсли;
			
			Отказ = Истина;
			
		КонецЦикла;
		
	Иначе 
		
		Пока ВыборкаОшибок.Следующий() Цикл
			Сообщить(СокрЛП(ВыборкаОшибок.ОписаниеОшибки), СтатусСообщения.Внимание);
			Отказ = Истина;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеОтзывнойНоты()

&НаКлиенте
Процедура ТаблицаТоваровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если Поле = Элементы.ТаблицаТоваровПричинаОбращения Тогда
		Элементы.ТаблицаТоваров.Обновить();
		
		Модифицированность = Истина;
		
	//С подачи ЮАГ делаем возможность выбора детали по Diverscode
	ИначеЕсли Поле = Элементы.ТаблицаТоваровАртикул Или Поле = Элементы.ТаблицаТоваровDiversCode Тогда
		
		ТипDiversCode = "Детали";
		РедактированиеСтроки = Истина;
		
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Тип", ПредопределенноеЗначение("Перечисление.EDR_ТипDiversCode.P")));
		
		Ответ = ОткрытьФормуМодально("Обработка.EDR_АРМПоГарантииNew.Форма.ФормаВыборDiversCode",ПараметрыФормы);
		//ФормаВыбора.ЗначениеОтбора = ПредопределенноеЗначение("Перечисление.EDR_ТипDiversCode.P");
		//Ответ = ФормаВыбора.ОткрытьМодально();
		
		Если ЗначениеЗаполнено(Ответ) Тогда
			
			ТекущаяСтрока.DiversCode = Ответ.Ссылка;
			ТекущаяСтрока.СтрокаИзЗаказНаряда = ЛОЖЬ;
			//ВыбраннаяСтрока.Номенклатура = Ответ.Наименование;
			
		КонецЕсли;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтарыеСчета(СтруктураПараметров)
	
	НаборУдаления = РегистрыСведений.EDR_Invoices.СоздатьНаборЗаписей();
	
	Для каждого ИзмерениеРегистра Из СтруктураПараметров Цикл
		НаборУдаления.Отбор[ИзмерениеРегистра.Ключ].Установить(ИзмерениеРегистра.Значение);
	КонецЦикла;
	
	НаборУдаления.Очистить();
	
	НаборУдаления.Записать(Истина);
	
КонецПроцедуры // УдалитьСтарыеСчета()

&НаКлиенте
Процедура ПроверитьЗаполнениеНоменклатуры(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ТекущаяСтрока Из ТаблицаТоваров Цикл
		
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
			
			Отказ = Истина;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Отказ Тогда
		Сообщить("В табличной части 'Товары' не заполнена номенклатура!", СтатусСообщения.Внимание);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеНоменклатуры()

&НаКлиенте
Процедура ПроверитьЗаполнениеАвтоработы(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ТекущаяСтрока Из ТаблицаРаботы Цикл
		
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.Работа) Тогда
			
			Отказ = Истина;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Отказ Тогда
		Сообщить("В табличной части 'Работы' не заполнена работа!", СтатусСообщения.Внимание);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеАвтоработы()

&НаСервереБезКонтекста
Функция ЕстьТакойНомерЗаявки(СчетДляПроверки, ЗаказНарядПроверки)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Invoice", 	СчетДляПроверки);
	Запрос.УстановитьПараметр("ЗаказНаряд", ЗаказНарядПроверки);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	EDR_Invoices.Invoice
		|ИЗ
		|	РегистрСведений.EDR_Invoices КАК EDR_Invoices
		|ГДЕ
		|	EDR_Invoices.Invoice = &Invoice
		|	И EDR_Invoices.ЗаказНаряд <> &ЗаказНаряд";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции // ЕстьТакойНомерЗаявки()

&НаКлиенте
Функция ПроверитьНомерЗаявки(СтрокаПроверки)
	
	Для А = 1 По СтрДлина(СтрокаПроверки) Цикл
		
		КодСимвола = КодСимвола(Сред(СтрокаПроверки, А, 1));
		
		Если ((КодСимвола < 65) Или (КодСимвола > 90 И КодСимвола < 97) Или (КодСимвола > 122)) И НЕ (КодСимвола >= 48 И КодСимвола <= 57) Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции // ПроверитьНомерЗаявки()

&НаКлиенте
Процедура ТаблицаСчетовСчетПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаСчетов.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ТекущаяСтрока.Счет = СтрЗаменить(ТекущаяСтрока.Счет, " ", "");
	
	Если ЕстьТакойНомерЗаявки(ТекущаяСтрока.Счет,ЗаказНаряд) Тогда
		
		ТекстСообщения = "В базе уже существует заявка с номером: " + СокрЛП(ТекущаяСтрока.Счет) + Символы.НПП + "Продолжить?";
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос(ТекстСообщения, Режим, 0);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ТекущаяСтрока.СчетДоНачалаРедактирования = ТекущаяСтрока.Счет;
		Иначе 
			ТекущаяСтрока.Счет = ТекущаяСтрока.СчетДоНачалаРедактирования;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекущаяСтрока.Счет) Тогда
		
		ЕстьОшибка = ПроверитьНомерЗаявки(ТекущаяСтрока.Счет);
		
		Если Не ЕстьОшибка Тогда
			
			СтрокиСоотвествия = ТаблицаСоответствий.НайтиСтроки(Новый Структура("ИдентификаторСчета", ТекущаяСтрока.ИдентификаторСчета));
			
			Для каждого СтрокаЗамены Из СтрокиСоотвествия Цикл
				СтрокаЗамены.Счет = ТекущаяСтрока.Счет;
			КонецЦикла;
			
			ОбновитьСпискиВыбораСчетов();
			
			Возврат;
			
		КонецЕсли;
		
		ТекстВопроса = "В номере счета должен содержать только латинские буквы и цифры" + Символы.НПП + "Продолжить?";
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос(ТекстВопроса, Режим, 0);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ТекущаяСтрока.СчетДоНачалаРедактирования = ТекущаяСтрока.Счет;
			Возврат;
		КонецЕсли;
		
		ТекущаяСтрока.Счет = ТекущаяСтрока.СчетДоНачалаРедактирования;
		
	КонецЕсли;
	
	СтрокиСоотвествия = ТаблицаСоответствий.НайтиСтроки(Новый Структура("ИдентификаторСчета", ТекущаяСтрока.ИдентификаторСчета));
	
	Для каждого СтрокаЗамены Из СтрокиСоотвествия Цикл
		СтрокаЗамены.Счет = ТекущаяСтрока.Счет;
	КонецЦикла;
	
	ОбновитьСпискиВыбораСчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНедопустимыеСимволыВКомментарих() //РезультатДиагностики,ОписаниеЖалобы,ОписаниеОперации,КомментарийОперации
	
	Для каждого ТекущаяСтрока Из ТаблицаИнцидентов Цикл
		
		ТекущаяСтрока.РезультатДиагностики = УдалитьНедопустимыеСимволы(ТекущаяСтрока.РезультатДиагностики);
		ТекущаяСтрока.ОписаниеЖалобы 	   = УдалитьНедопустимыеСимволы(ТекущаяСтрока.ОписаниеЖалобы);
		ТекущаяСтрока.ОписаниеОперации 	   = УдалитьНедопустимыеСимволы(ТекущаяСтрока.ОписаниеОперации);
		ТекущаяСтрока.КомментарийОперации  = УдалитьНедопустимыеСимволы(ТекущаяСтрока.КомментарийОперации);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция УдалитьНедопустимыеСимволы(СтроковоеЗначение)
	
	ЗначениеСтроки = СокрЛП(СтроковоеЗначение);
	
	ЗначениеСтроки = СтрЗаменить(ЗначениеСтроки, Символы.ВК, "");
	ЗначениеСтроки = СтрЗаменить(СокрЛП(ЗначениеСтроки), Символы.ВТаб, "");
	ЗначениеСтроки = СтрЗаменить(СокрЛП(ЗначениеСтроки), Символы.НПП, "");
	ЗначениеСтроки = СтрЗаменить(СокрЛП(ЗначениеСтроки), Символы.ПС, "");
	ЗначениеСтроки = СтрЗаменить(СокрЛП(ЗначениеСтроки), Символы.ПФ, "");
	ЗначениеСтроки = СтрЗаменить(СокрЛП(ЗначениеСтроки), Символы.Таб, "");
	
	Возврат СокрЛП(ЗначениеСтроки);
	
КонецФункции // УдалитьНедопустимыеСимволы()

&НаКлиенте
Процедура ОписаниеЖалобыПриИзменении(Элемент)
//	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеОперацииПриИзменении(Элемент)
	//Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьЦеныПоАктуальномуТарифуНаСервере()
	
	ВебСервис = Renault_АвтосервисСерверПовтИспользования.ПолучитьПроксиPartsCostHist();
	BIR = DMS_ВыгрузкаEDRСервер.ПолучитьИдентификаторBIRПоОрганизации(ЗаказНаряд.Организация);
	Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
	
	ТаблицаИзменений = Новый ТаблицаЗначений;
	
	ТаблицаИзменений.Колонки.Добавить("Артикул");
	ТаблицаИзменений.Колонки.Добавить("Номенклатура");
	ТаблицаИзменений.Колонки.Добавить("СтараяЦена",,"Старая цена");
	ТаблицаИзменений.Колонки.Добавить("НоваяЦена",, "Новая цена");
	ТаблицаИзменений.Колонки.Добавить("ДатаТарифа", , "Дата тарифа");
	ТаблицаИзменений.Колонки.Добавить("СрочныйТариф", , "Срочный тариф");

	
	Для Каждого Реферанс из ТаблицаТоваров Цикл
		
		Если ЗначениеЗаполнено(Реферанс.DiversCode) Тогда
			
			Продолжить;
				
		КонецЕсли;
		
		НовыйЦены = Сериализатор.ПрочитатьXDTO(ВебСервис.GetPriceHistory(BIR, Реферанс.Артикул));
			
		Результат = ПолучитьАктуальнуюЦенуЗаПериод(НовыйЦены, ДатаОткрытия);
		
		Если ЗначениеЗаполнено(Результат) Тогда
				
			НоваяСтрока = ТаблицаИзменений.Добавить();
			НоваяСтрока.Артикул = Реферанс.Артикул;
			НоваяСтрока.Номенклатура = Реферанс.Номенклатура;
			НоваяСтрока.СтараяЦена = Реферанс.Цена;
			Если ЗначениеЗаполнено(Реферанс.ЗаказНаряд) и ЗначениеЗаполнено(Реферанс.ЗаказНаряд.ТипЦен) 
					и Реферанс.ЗаказНаряд.ТипЦен.ЦенаВключаетНДС Тогда
				СуммаНДС   = Реферанс.Цена - (100 *Реферанс.Цена / (100 + Реферанс.СтавкаНДС.Ставка)); 
				НоваяСтрока.СтараяЦена = НоваяСтрока.СтараяЦена - СуммаНДС; 
			КонецЕсли;
			
			Если Реферанс.СрочныйТариф=Истина Тогда
				НоваяСтрока.НоваяЦена = Результат.PNCU;
			Иначе
				НоваяСтрока.НоваяЦена = Результат.PNC;
			КонецЕсли;
			НоваяСтрока.ДатаТарифа = Результат.Период;
			НоваяСтрока.СрочныйТариф = Реферанс.СрочныйТариф;
		
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаИзменений;
	
КонецФункции

&НаСервере
Функция ПолучитьАктуальнуюЦенуЗаПериод(ТаблицаЦен, Дата)
	
	Запрос = Новый Запрос;
	МВТ = Новый МенеджерВременныхТаблиц;
	
	ТаблицаЦен.Сортировать("Период Убыв");
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ТаблицаЦена.Артикул,
	               |	ТаблицаЦена.Период,
	               |	ТаблицаЦена.PCL,
	               |	ТаблицаЦена.PNC,
	               |	ТаблицаЦена.PNCU
	               |ПОМЕСТИТЬ ПредВыбор
	               |ИЗ
	               |	&ТаблицаЦена КАК ТаблицаЦена
	               |ГДЕ
	               |	ТаблицаЦена.PNCU > 0
	               |	И ТаблицаЦена.Период <= &ДатаОткрытия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПредВыбор.Артикул,
	               |	ПредВыбор.Период,
	               |	ПредВыбор.PCL,
	               |	ПредВыбор.PNC,
	               |	ПредВыбор.PNCU
	               |ИЗ
	               |	ПредВыбор КАК ПредВыбор";
	
	Запрос.УстановитьПараметр("ТаблицаЦена", ТаблицаЦен);
	Запрос.УстановитьПараметр("ДатаОткрытия", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат = Новый Структура;
		Результат.Вставить("Период", Выборка.Период);
		Результат.Вставить("PNCU", Выборка.PNCU);
		Результат.Вставить("PNC", Выборка.PNC);
		
		Возврат Результат;
		
	Иначе
		
		Возврат Неопределено;
		
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьЦеныПоАктуальномуТарифу(Команда)
	ТаблицаИзменений = ЗаполнитьЦеныПоАктуальномуТарифуНаСервере();
	
	Если ЗначениеЗаполнено(ТаблицаИзменений) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ТаблицаИзменений",ТаблицаИзменений);
		ПараметрыФормы.Вставить("ДатаОткрытияЗаказНаряда", ДатаОткрытия);
		
		Результат = ОткрытьФормуМодально("Обработка.EDR_АРМПоГарантииNew.Форма.ФормаРазницыЦен", 
		ПараметрыФормы, ЭтаФорма);
		
		Если ЗначениеЗаполнено(Результат) Тогда
			
			Для Каждого Строка из Результат Цикл
				
				Если Строка.ИзменятьЦену Тогда
					
					СтруктураОтбора = Новый Структура;
					СтруктураОтбора.Вставить("Артикул", Строка.Артикул);
					
					СтрокиДляИзмения = ТаблицаТоваров.НайтиСтроки(СтруктураОтбора);
					
					Для Каждого СтрокаДляИзменения из СтрокиДляИзмения Цикл
						
						Если ЗначениеЗаполнено(СтрокаДляИзменения.DiversCode) Тогда
							Продолжить;
							
						КонецЕсли;
							
						СтрокаДляИзменения.Цена = Строка.НоваяЦена;
						СтрокаДляИзменения.СтрокаИзЗаказНаряда = Ложь;
						 
						СтруктураСтроки = Новый Структура("Количество, Цена, СуммаНДС, СуммаВсего, СтавкаНДС, СуммаСкидки");
						
						ЗаполнитьЗначенияСвойств(СтруктураСтроки, СтрокаДляИзменения);
						//  Вариант, когда расчет идет по ставке 20% и от настроек типа цен
						// СтруктураСтроки["СтавкаНДС"] = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
						// Если ЗаказНаряд.ТипЦен.ЦенаВключаетНДС Тогда
						// 		СтруктураСтроки["Цена"] =  СтруктураСтроки["Цена"] * (100 + СтруктураСтроки["СтавкаНДС"].Ставка) / 100;
						// КонецЕсли;
						
						//  Вариант когда, в GM отправляются значения без НДС
						СтруктураСтроки["СтавкаНДС"] = Справочники.СтавкиНДС.БезНДС;

						РассчитатьСтоимостьТоваров(СтруктураСтроки);
						
						ЗаполнитьЗначенияСвойств(СтрокаДляИзменения, СтруктураСтроки);
						
						Модифицированность = Истина;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

//При изменении хотя бы одной строки таблицы товаров - все строки переводим в режим ручного ввода и записи.
&НаКлиенте
Процедура ТаблицаТоваровПриИзменении(Элемент)
	
	Для каждого Строка Из ТаблицаТоваров Цикл
		Строка.СтрокаИзЗаказНаряда = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьУслугиПоГарантийномуРемонту(Команда)
	НоваяСтрока = ТаблицаРаботы.Добавить();
	НоваяСтрока.НеСтандартнаяОперация = Истина;
	НоваяСтрока.ЗаказНаряд			  = ЗаказНаряд;
	НоваяСтрока.Артикул				  = "8888";
	НоваяСтрока.ИдентификаторРаботы	  = Строка(Новый УникальныйИдентификатор());
	
	НоваяСтрока.Работа = "Доп. услуги по гарантийному ремонту";
	
	//СтруктураПараметров = Новый Структура("СтрокаПоУмолчанию,СтрокаРабот", "8888 - Доп. услуги по гарантийному ремонту", НоваяСтрока);
	//
	//Подсказка = "Введите наименование выполненных работ";
	////Оповещение = Новый ОписаниеОповещения("ПослеВводаСтроки",ЭтаФорма ,СтруктураПараметров);
	////ПоказатьВводСтроки(Оповещение, "", Подсказка, 0, Истина);
	//Текст = "";
	//Результат = ВвестиСтроку(Текст, Подсказка, 0, Истина);
	//ПослеВводаСтроки(Текст, СтруктураПараметров);

КонецПроцедуры


////#КонецОбласти

////#КонецОбласти

