//Предназначена для выбора одного или нескольких значений из списка выбора
// представленный строкой, списком выбора или массивом
// Параметры:  - структура с элементами 
//	СписокЗначений - типы:
//		СписокЗначений
//		Массив - представление совпадает со значением
//		Строка - значения разделяются разделителем 1
//			представления отделяются от значений разделителем 2
//			если представление отсутствует = значению
//  
//	Групповой - признак того, что значение может содержать несколько строк
//
//	ТекущееЗначение 
//		Еели групповой - аналогичны СпискуЗначений, но не содержат представлений
//		Иначе - значение
//	Разделители Может быть 3-й символ - разделитель текущего значения, умолч = 1.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ТипЗнч(Параметры.СписокЗначений)=Тип("Строка") Тогда	
		Разделители=СокрП(Параметры.Разделители);
		Длина=СтрДлина(Разделители);
		Р1=?(Длина>0,Лев(Разделители,1),";");
		Р2=?(Длина>1,сред(Разделители,2,1),"-");
		Р3=?(Длина>2,сред(Разделители,3,1),Р1);
	КонецЕсли;	
	Если Не ЗначениеЗаполнено(Параметры.СписокЗначений) Тогда
		Если Параметры.ФормаВыбора Тогда
			Отказ=Истина; Возврат;
		КонецЕсли;
		Рез=?(ТипЗнч(Параметры.СписокЗначений)=Тип("СписокЗначений"),Новый СписокЗначений,
		?(ТипЗнч(Параметры.СписокЗначений)=Тип("Массив"),Новый Массив,""));
	ИначеЕсли ТипЗнч(Параметры.СписокЗначений)=Тип("Строка") Тогда
		Если Р1<>Символы.ПС Тогда
	    	СписокЗначений=СтрЗаменить(Параметры.СписокЗначений,Р1,Символы.ПС)
		КонецЕсли;
		Если Прав(СписокЗначений,1)=Р1 Тогда 
			СписокЗначений=Лев(СписокЗначений,СтрДлина(СписокЗначений)-1); 
		КонецЕсли;
		КолСтр=СтрЧислоСтрок(СписокЗначений);
		Для НСтр=1 по КолСтр Цикл
			Стр=СтрПолучитьСтроку(СписокЗначений,НСтр);
			Поз=Найти(Стр,Р2);
			Нов=Список.Добавить(); 
			Если Поз=0 Тогда
				Нов.Значение=Стр;
				Нов.Представление=Стр;
			Иначе
				Нов.Значение=Лев(Стр,Поз-1);
				Нов.Представление=Сред(Стр,Поз+1);
			КонецЕсли;
		КонецЦикла;
		Рез="";
	ИначеЕсли ТипЗнч(Параметры.СписокЗначений)=Тип("СписокЗначений") Тогда
		Для Каждого Стр Из Параметры.СписокЗначений Цикл
			Нов=Список.Добавить(); 
			Нов.Значение=Стр.Значение;
			Нов.Представление=?(ПустаяСтрока(Стр.Представление),Строка(Стр.Значение),Стр.Представление);
		КонецЦикла;
		Рез=Новый СписокЗначений;
	ИначеЕсли ТипЗнч(Параметры.СписокЗначений)=Тип("Массив") Тогда
		Для Каждого Эл Из Параметры.СписокЗначений Цикл
			Нов=Список.Добавить(); 
			Нов.Значение=Эл;
			Нов.Представление=Строка(Эл);
		КонецЦикла;
		Рез=Новый Массив;
	Иначе
		Отказ=Истина;Возврат;
	КонецЕсли;
	
	ФормаВыбора=Параметры.ФормаВыбора;
	Если Не ФормаВыбора Тогда Возврат;КонецЕсли;
		
	Групповой=Параметры.Групповой;
	Если Групповой Тогда
		Если ЗначениеЗаполнено(Параметры.ТекущееЗначение) Тогда
			Если ТипЗнч(Параметры.ТекущееЗначение)=Тип("Строка") Тогда
				Если Р3<>Символы.ПС Тогда
			    	ТекущееЗначение=СтрЗаменить(Параметры.ТекущееЗначение,Р3,Символы.ПС)
				КонецЕсли;
				КолСтр=СтрЧислоСтрок(ТекущееЗначение);
				Для НСтр=1 по КолСтр Цикл
					Стр=СтрПолучитьСтроку(ТекущееЗначение,НСтр);
					ТекСтр=Список.НайтиСтроки(Новый Структура("Значение",Стр));
					Если ТекСтр.Количество()>0 Тогда
						ТекСтр[0].Вкл=Истина;
					Иначе 
						ТекСтр=Список.Добавить();
						ТекСтр.Значение=Стр;
						ТекСтр.Представление=Стр;
						ТекСтр.Вкл=Истина;
					КонецЕсли;
				КонецЦикла;
				Рез="";
			ИначеЕсли ТипЗнч(Параметры.ТекущееЗначение)=Тип("СписокЗначений") Тогда
				Для Каждого Стр Из Параметры.ТекущееЗначение Цикл
					ТекСтр=Список.НайтиСтроки(Новый Структура("Значение",Стр.Значение));
					Если ТекСтр.Количество()>0 Тогда
						ТекСтр[0].Вкл=Истина;
					КонецЕсли;
				КонецЦикла;
				Рез=Новый СписокЗначений;
			ИначеЕсли ТипЗнч(Параметры.ТекущееЗначение)=Тип("Массив") Тогда
				Для Каждого Эл Из Параметры.ТекущееЗначение Цикл
					ТекСтр=Список.НайтиСтроки(Новый Структура("Значение",Эл));
					Если ТекСтр.Количество()>0 Тогда
						ТекСтр[0].Вкл=Истина;
					КонецЕсли;
				КонецЦикла;
				Рез=Новый Массив;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Параметры.ТекущееЗначение)=Тип("Строка") Тогда
			Рез="";
		ИначеЕсли ТипЗнч(Параметры.ТекущееЗначение)=Тип("Массив") Тогда
			Рез=Новый Массив;
		ИначеЕсли ТипЗнч(Параметры.ТекущееЗначение)=Тип("СписокЗначений") Тогда
			Рез=Новый СписокЗначений;
		КонецЕсли;
	Иначе
		Рез=Неопределено;
		Если ЗначениеЗаполнено(Параметры.ТекущееЗначение) Тогда
			ТекСтр=Список.НайтиСтроки(Новый Структура("Значение",Параметры.ТекущееЗначение));
			Если ТекСтр.Количество()>0 Тогда
				ТекСтр[0].Вкл=Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ФормаВыбора Тогда
		Элементы.Список.ПоложениеКоманднойПанели=ПоложениеКоманднойПанелиЭлементаФормы.Нет;
		Элементы.СписокЗначение.Видимость=Ложь;
		Элементы.СписокЗначение.ТолькоПросмотр=Истина;
		Элементы.СписокПредставление.ТолькоПросмотр=Истина;
	Иначе
		ЭтаФорма.ПоложениеКоманднойПанели=ПоложениеКоманднойПанелиФормы.Нет;
		Элементы.СписокВкл.Видимость=Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВклПриИзменении(Элемент)
	Если Не Групповой и Элементы.Список.ТекущиеДанные.Вкл Тогда
		Для Каждого Стр Из Список Цикл
			Стр.Вкл=ЛОжь;
		КонецЦикла;
		Элементы.Список.ТекущиеДанные.Вкл=Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗначения(Команда)
	Для Каждого Стр Из Список Цикл
		Если Не Стр.Вкл Тогда Продолжить;КонецЕсли;
		Если Не Групповой Тогда 
			ЭтаФорма.Закрыть(Стр.Значение);
			Возврат;
		КонецЕсли;
		ЕСли ТипЗнч(Рез)=Тип("Строка") Тогда
			Рез=Рез+Р3+Стр.Значение;
		ИначеЕсли ТипЗнч(Рез)=Тип("Массив") Тогда
			Рез.Добавить(Стр.Значение);
		ИначеЕсли ТипЗнч(Рез)=Тип("СписокЗначений") Тогда
			Рез.Добавить(Стр.Значение,Стр.Представление);
		КонецЕсли;
	КонецЦикла;
	
	Если ТипЗнч(Рез)=Тип("Строка") И СтрДлина(Рез)>0 Тогда
		Рез=Сред(Рез,2);
	КонецЕсли;
	
	ЭтаФорма.Закрыть(Рез);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИВыйти(Команда)
	Если ТипЗнч(Рез)=Тип("Строка") Тогда
		Для Каждого Стр Из Список Цикл
			Рез=Рез+Р1+Стр.Значение+?(ПустаяСтрока(Стр.Представление) ИЛИ Стр.Значение=Стр.Представление,"",Р2+Стр.Представление);
		КонецЦикла;
		Если Не ПустаяСтрока(Рез) ТОгда
			Рез=Сред(Рез,2);
		КонецЕсли;
	ИначеЕсли ТипЗнч(Рез)=Тип("Массив") Тогда
		Для Каждого Стр Из Список Цикл
			Рез.Добавить(Стр.Значение);
		КонецЦикла;
	ИначеЕсли ТипЗнч(Рез)=Тип("СписокЗначений") Тогда
		Для Каждого Стр Из Список Цикл
			Рез.Добавить(Стр.Значение,Стр.Представление);
		КонецЦикла;
	КонецЕсли;
	ЭтаФорма.Закрыть(Рез);
		
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Не ФормаВыбора Тогда Возврат;КонецЕсли;
	ТекДан=Элементы.Список.ТекущиеДанные;
	Если ТекДан=Неопределено Тогда Возврат;КонецЕсли;
	ЕСли ТекДан.Вкл Тогда 
		ТекДан.Вкл=Ложь;
	ИначеЕсли Групповой тогда
		ТекДан.Вкл=Истина;
	Иначе
		Завершать=Истина;
		Для Каждого Стр Из Список Цикл
			Если Стр.Вкл=Истина Тогда 
				Стр.Вкл=Ложь;Завершать=Ложь;
			КонецЕсли;
		КонецЦикла;
		ТекДан.Вкл=Истина;
		Если Завершать Тогда
			ЭтаФорма.Закрыть(ТекДан.Значение);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
