
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ПОДПИСОК НА СОБЫТИЯ

Процедура Renault_ЗаказПоставщикуПриЗаписиСтатусПриЗаписи(Источник, Отказ) Экспорт

    Если НЕ Отказ Тогда

        МенеджерЗаписи = РегистрыСведений.Renault_СтатусыЗаказовПоставщику.СоздатьМенеджерЗаписи();
        МенеджерЗаписи.ЗаказПоставщику = Источник.Ссылка;
        МенеджерЗаписи.Прочитать();

        Если Не МенеджерЗаписи.Выбран() Тогда // Делаем новую запись
            МенеджерЗаписи.ЗаказПоставщику = Источник.Ссылка;
            МенеджерЗаписи.Статус          = Перечисления.Renault_СтатусыЗаказаПоставщику.Новый;
            МенеджерЗаписи.Записать(Истина);
        КонецЕсли;

    КонецЕсли;

КонецПроцедуры


Функция ЗаказОтправленВРено(ЗаказСсылка) Экспорт

    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказСсылка);
    Запрос.УстановитьПараметр("СтатусНового",    Перечисления.Renault_СтатусыЗаказаПоставщику.Новый);

    Запрос.Текст = "ВЫБРАТЬ
                   |    Renault_СтатусыЗаказовПоставщику.ЗаказПоставщику,
                   |    Renault_СтатусыЗаказовПоставщику.Статус
                   |ИЗ
                   |    РегистрСведений.Renault_СтатусыЗаказовПоставщику КАК Renault_СтатусыЗаказовПоставщику
                   |ГДЕ
                   |    Renault_СтатусыЗаказовПоставщику.ЗаказПоставщику = &ЗаказПоставщику
                   |    И НЕ Renault_СтатусыЗаказовПоставщику.Статус = &СтатусНового";

     Возврат Не Запрос.Выполнить().Пустой();

КонецФункции


Функция НайтиДилераРПартс(DMD) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("DMD", DMD);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Renault_НастройкиОбменаССайтом.ДилерскийЦентр
	               |ИЗ
	               |	РегистрСведений.Renault_НастройкиОбменаССайтом КАК Renault_НастройкиОбменаССайтом
	               |ГДЕ
	               |	Renault_НастройкиОбменаССайтом.DMD = &DMD";
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Возврат Результат.Выгрузить()[0].ДилерскийЦентр;
	Иначе
		Возврат Справочники.CRM_ДилерскиеЦентры.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРАВА И НАСТРОЙКИ

Функция ЕстьПравоАРМЗапчастиСнабжение() Экспорт

    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
    Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
                   |    Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗЧ_АРМСнабжение КАК Право
                   |ИЗ
                   |    РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
                   |ГДЕ
                   |    Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
    Выборка = Запрос.Выполнить().Выбрать();

    Если Выборка.Следующий() Тогда
        Возврат Выборка.Право;

    Иначе
        Возврат Истина;

    КонецЕсли;

КонецФункции

Функция ЕстьПравоАРМЗапчастиСклад() Экспорт

    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
    Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
                   |    Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗЧ_АРМСклад КАК Право
                   |ИЗ
                   |    РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
                   |ГДЕ
                   |    Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
    Выборка = Запрос.Выполнить().Выбрать();

    Если Выборка.Следующий() Тогда
        Возврат Выборка.Право;

    Иначе
        Возврат Истина;

    КонецЕсли;

КонецФункции

Функция ЕстьПравоАРМЗапчастиРеноПартс() Экспорт

    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
    Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
                   |    Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗЧ_АРМРеноПартс КАК Право
                   |ИЗ
                   |    РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
                   |ГДЕ
                   |    Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
    Выборка = Запрос.Выполнить().Выбрать();

    Если Выборка.Следующий() Тогда
        Возврат Выборка.Право;

    Иначе
        Возврат Истина;

    КонецЕсли;

КонецФункции

Функция ЕстьПравоАРМЗапчастиРекламации() Экспорт

    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
    Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
                   |    Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗЧ_АРМРекламации КАК Право
                   |ИЗ
                   |    РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
                   |ГДЕ
                   |    Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
    Выборка = Запрос.Выполнить().Выбрать();

    Если Выборка.Следующий() Тогда
        Возврат Выборка.Право;

    Иначе
        Возврат Истина;

    КонецЕсли;
КонецФункции

Функция ЕстьПравоАРМЗапчастиРеализации() Экспорт

    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
    Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
                   |    Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗЧ_АРМРеализации КАК Право
                   |ИЗ
                   |    РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
                   |ГДЕ
                   |    Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
    Выборка = Запрос.Выполнить().Выбрать();

    Если Выборка.Следующий() Тогда
        Возврат Выборка.Право;

    Иначе
        Возврат Истина;

    КонецЕсли;
КонецФункции

Функция ПолучитьПраваАРМЗапчасти() Экспорт

    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
    Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
                   |    Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗЧ_АРМКаталог КАК Каталог,
                   |    Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗЧ_АРМСнабжение КАК Снабжение,
                   |    Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗЧ_АРМСклад КАК Склад,
                   |    Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗЧ_АРМРеноПартс КАК РеноПартс,
                   |    Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗЧ_АРМРекламации КАК Рекламации,
                   |    Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗЧ_АРМКладовщика КАК АРМКладовщика,
                   |    Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗЧ_АРМЛогиста КАК АРМЛогиста,
				   |    Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗЧ_АРМРеализации КАК АРМРеализации
                   |ИЗ
                   |    РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
                   |ГДЕ
                   |    Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
    Выборка = Запрос.Выполнить().Выбрать();

    Ответ = Новый Структура("Каталог, Снабжение, Склад, РеноПартс, Рекламации, АРМКладовщика, АРМЛогиста, АРМРеализации",
                            Истина, Истина, Истина, Истина, Истина, Истина, Истина, Истина);

    Если Выборка.Следующий() Тогда
        ЗаполнитьЗначенияСвойств(Ответ, Выборка);
    КонецЕсли;

    Возврат Ответ;

КонецФункции
