&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТЧ=ЗначениеИзСтрокиВнутр(Параметры.ТЧ);
	Объявления.Загрузить(ТЧ);
	
КонецПроцедуры

&НаКлиенте
Процедура кнОпубликовать(Команда)
	
	Если Опубликовать() Тогда
		ВладелецФормы.ОбновитьОпубликованныеVIN();
		Закрыть();
	Иначе
		Сообщить("Не удалось опубликовать объявления",СтатусСообщения.Внимание);
	КонецЕсли;
	
КонецПроцедуры

Функция Опубликовать()
	
	//вариант с внешней базой
	//Для Каждого Стр Из Объявления Цикл
	//	Запись=ВнешниеИсточникиДанных.ExtDMS.Таблицы.advertisement.СоздатьОбъект();
	//	ЗаполнитьЗначенияСвойств(Запись,Стр);
	//	Запись.Записать();
	//КонецЦикла;	
	
	//вариант с http service
	ТЧ=Объявления.Выгрузить();
	ТЧ.ЗаполнитьЗначения(ТекущаяДата(), "ДатаПубликации");
	Если Renault_ОбщиеФункцииСервер.ExtDMS("add", ТЧ) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

