Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Renault_ПланПродаж
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ПланПродаж.Регистратор
	|ИЗ
	|	РегистрСведений.Renault_ПланПродаж КАК Renault_ПланПродаж
	|ГДЕ
	|	Renault_ПланПродаж.ТипПериода = &ТипПериода
	|	И Renault_ПланПродаж.ПериодПлан = &ПериодПлан
	|	И Renault_ПланПродаж.Регистратор <> &Регистратор
	|	И Renault_ПланПродаж.Настройка = &Настройка";
	Запрос.УстановитьПараметр("ПериодПлан", Период);
	Запрос.УстановитьПараметр("ТипПериода", ТипПериода);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("Настройка", Настройка);
	Результат = Запрос.Выполнить();
	Если не Результат.Пустой() Тогда 
		Отказ = Истина;
		ВызватьИсключение "Этап продаж в данном периоде имеется";
	КонецЕсли;
	
	Движения.Renault_ПланПродаж.Записывать = Истина;
	Движения.Renault_ПланПродаж.Очистить();
	Для Каждого ТекСтрокаПланПродаж Из ПланПродаж Цикл
		Движение = Движения.Renault_ПланПродаж.Добавить();
		Движение.ДилерскиеЦентры = ТекСтрокаПланПродаж.ДилерскиеЦентры;
		Движение.Отделы = ТекСтрокаПланПродаж.Отделы;
		Движение.Менеджеры = ТекСтрокаПланПродаж.Менеджеры;
		Движение.Модели = ТекСтрокаПланПродаж.Модели;
		Движение.ТипыМоделей = ТекСтрокаПланПродаж.ТипыМоделей;
		Движение.ПериодПлан = Период;
		Движение.ТипПериода = ТипПериода;
		Движение.ГаммаМоделей = ТекСтрокаПланПродаж.ГаммаМоделей;
		Движение.Количество = ТекСтрокаПланПродаж.Количество;
		Движение.КоличествоRenault = ТекСтрокаПланПродаж.КоличествоRenault;
		Движение.Настройка = Настройка;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
