
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Параметры.Свойство("ОбластьПоиска",     ОбластьПоиска);
	Параметры.Свойство("ДлительностьРабот", ДлительностьРабот);
	Параметры.Свойство("Цех",               Цех);
	Параметры.Свойство("Сотрудник",         Сотрудник);
	Параметры.Свойство("РабочийДокумент",   РабочийДокумент);
	Параметры.Свойство("ДилерскийЦентр",    ДилерскийЦентр);
	Параметры.Свойство("ИнтервалСлота",     ИнтервалСлота);
	Параметры.Свойство("ТолькоРаботающие",  ТолькоРаботающие);
	
	Если ИнтервалСлота = 0 Тогда
		ИнтервалСлота = 20 * 60; 
	КонецЕсли; 
		
	ДатаПлан = ТекущаяДатаСеанса() + 7 * 86400;
	
	РассчитатьДоступныеСлоты(РабочийДокумент, ДатаПлан);
	ДобавитьВыбранныеСлоты("Слот1");
	ДобавитьЭлементыФормы();
	ИзменитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПланПриИзменении(Элемент)
		
	Если НачалоДня(ДатаПлан) < НачалоДня(ТекущаяДатаСеанса()) Тогда
		ДатаПлан = ТекущаяДатаСеанса();	
	КонецЕсли;	
	
	ДоступныеСлоты.Очистить();
	ВыбранныеСлоты.Очистить();
	
	РассчитатьДоступныеСлоты(РабочийДокумент, ДатаПлан);
	ДобавитьВыбранныеСлоты("Слот1");
	ДобавитьЭлементыФормы();
	ИзменитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СлотНажатие(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ИмяТекст        = Элемент.Имя;
	ИмяТекст        = СтрЗаменить(ИмяТекст, "_Слоты", "");
	ИмяГруппыВыбора = Сред(ИмяТекст, 0, СтрНайти(ИмяТекст, "_") - 1);	
	ИмяГруппы       = СтрЗаменить(ИмяТекст, ИмяГруппыВыбора + "_", "");
	ИмяСлота        = НавигационнаяСсылкаФорматированнойСтроки;
	
	ДобавитьВыбранныеСлоты(ИмяСлота);
	ДобавитьЭлементыФормы();
	ИзменитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандШапкиФормы

&НаКлиенте
Процедура Готово(Команда)
	
	Результат = Новый Массив;
	
	Для Каждого ТекСтрока Из ВыбранныеСлоты Цикл
		НовЭлемент = Новый Структура();
		НовЭлемент.Вставить("Документ",       ТекСтрока.Документ);
		НовЭлемент.Вставить("Этап",           ТекСтрока.Этап);
		НовЭлемент.Вставить("IDЭтапа",        ТекСтрока.IDЭтапа);
		НовЭлемент.Вставить("Цех",            ТекСтрока.Цех);
		НовЭлемент.Вставить("ВремяНачала",    ТекСтрока.ВремяНачала);
		НовЭлемент.Вставить("ВремяОкончания", ТекСтрока.ВремяОкончания);
		
		Результат.Добавить(НовЭлемент);
	КонецЦикла; 
	
	Закрыть(Результат);
	
КонецПроцедуры
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьЗаголовокГруппы(Документ, Этап, Длительность)
	
	Часы   = 0;
	Минуты = 0;
	ДлительностьВЧасах = Длительность;
	
	Если Цел(ДлительностьВЧасах) <> ДлительностьВЧасах Тогда
		Часы = Цел(ДлительностьВЧасах);
		Минуты = (Длительность - Часы) * 3600 / 60;
	Иначе
		Часы = ДлительностьВЧасах;
	КонецЕсли;	
	
	ВремяТекст = ?(Часы <> 0, "" + Часы + " ч. ", "") + ?(Минуты <> 0, "" + Минуты + " м.", "");
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.Renault_CRM_ПриемкаАвтомобиля") Тогда
		Возврат "Приемка (" + СокрЛП(ВремяТекст) + ")"; 
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.Renault_CRM_ВыдачаАвтомобиля") Тогда 
		Возврат "Выдача (" + СокрЛП(ВремяТекст) + ")"
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.Renault_CRM_ЗаявкаНаМойку") Тогда 
		Возврат "Работы, мойка (" + СокрЛП(ВремяТекст) + ")"
	Иначе
		Возврат "Работы, " + Этап + " (" + СокрЛП(ВремяТекст) + ")";  
	КонецЕсли; 
	
КонецФункции

&НаСервере
Процедура РассчитатьДоступныеСлоты(Знач РабочийДокументРасчета, Знач ДатаНачалаРасчета)  
	//Время начала для последующих документов сдвигаем в процедуре ДобавитьДоступныеСлоты() 
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	//ОбработкаОбъект.ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя(); 
	ОбработкаОбъект.ДилерскийЦентр = ДилерскийЦентр; 	
	
	// Если выбрали ДатаПлан совпадающую с текущем днем, то перезаполняем ТекДатаПлан, 
	// т.е. начало выбора слотов, исходя из текущего времени и интервалов слотов.
	ТекДатаПлан = ДатаНачалаРасчета;
	
	Если НачалоДня(ДатаНачалаРасчета) = НачалоДня(ТекущаяДатаСеанса()) Тогда
		ТекущихМинут = Окр(Минута(ТекущаяДатаСеанса()), -1);
		ИнтервалСлотаМинуты = ИнтервалСлота / 60;

		Если ТекущихМинут <> 0 Тогда	
			КратностьМинут = ТекущихМинут/ИнтервалСлотаМинуты;
			
			Если КратностьМинут <= 1 Тогда
				ТекущихМинут = ИнтервалСлотаМинуты;
			Иначе
				ТекущихМинут = Цел(ТекущихМинут) + ИнтервалСлотаМинуты; 
				Если ТекущихМинут > 60 Тогда
					ТекущихМинут = 60;
				КонецЕсли;	
			КонецЕсли;
		Иначе
			ТекущихМинут = ИнтервалСлотаМинуты;
		КонецЕсли;
	
		ТекДатаПлан = Дата(Год(ДатаПлан), Месяц(ДатаПлан), День(ДатаПлан), Час(ТекущаяДатаСеанса()) + ?(ТекущихМинут = 60, 1, 0), ?(ТекущихМинут = 60, 0, ТекущихМинут), 0);
	КонецЕсли;	
	
	// Добавляем данные по слотам по каждому этапу, 
	// исходя из первоначального этапа, выбранного на таблице планировщика
	ПорядковыйНомерГруппы = ВыбранныеСлоты.Количество() + 1;
	
	Если ТипЗнч(РабочийДокументРасчета) = Тип("ДокументСсылка.Renault_CRM_ПриемкаАвтомобиля") Тогда 
		ДобавитьДоступныеСлоты(РабочийДокументРасчета, 1, ПорядковыйНомерГруппы, ТекДатаПлан);
		
		Запрос = Новый Запрос;
		Запрос.Текст = ОбработкаОбъект.ТекстЗапросаПоСвязаннымДокументам();
		
		Запрос.УстановитьПараметр("Обращение",       РабочийДокументРасчета.Обращение);
		Запрос.УстановитьПараметр("РабочийДокумент", РабочийДокументРасчета);
		
		Результат = Запрос.Выполнить();
		
		ВыборкаРабочийДокумент = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		// Мойка
		Пока ВыборкаРабочийДокумент.НайтиСледующий(2, "Порядок") Цикл
			ДобавитьДоступныеСлоты(ВыборкаРабочийДокумент.РабочийДокумент, 2, ПорядковыйНомерГруппы, ТекДатаПлан);
		КонецЦикла;
		
		// Заявки на сервис
		Пока ВыборкаРабочийДокумент.НайтиСледующий(3, "Порядок") Цикл
			ДобавитьДоступныеСлоты(ВыборкаРабочийДокумент.РабочийДокумент, 3, ПорядковыйНомерГруппы, ТекДатаПлан);
		КонецЦикла;
		
		// Выдача
		Пока ВыборкаРабочийДокумент.НайтиСледующий(4, "Порядок") Цикл
			ДобавитьДоступныеСлоты(ВыборкаРабочийДокумент.РабочийДокумент, 4, ПорядковыйНомерГруппы, ТекДатаПлан);
		КонецЦикла;	
		
	ИначеЕсли ТипЗнч(РабочийДокументРасчета) = Тип("ДокументСсылка.Renault_CRM_ЗаявкаНаМойку") Тогда
		ДобавитьДоступныеСлоты(РабочийДокументРасчета, 2, ПорядковыйНомерГруппы, ТекДатаПлан);
		
		Запрос = Новый Запрос;
		Запрос.Текст = ОбработкаОбъект.ТекстЗапросаПоСвязаннымДокументам();
		
		Запрос.УстановитьПараметр("Обращение",       РабочийДокументРасчета.Обращение);
		Запрос.УстановитьПараметр("РабочийДокумент", РабочийДокументРасчета);
		
		Результат = Запрос.Выполнить();
		
		ВыборкаРабочийДокумент = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		// Если есть еще мойки
		Пока ВыборкаРабочийДокумент.НайтиСледующий(2, "Порядок") Цикл
			НайденныеСтроки = ВыбранныеСлоты.НайтиСтроки(Новый Структура("Документ", ВыборкаРабочийДокумент.РабочийДокумент));

			Если ВыборкаРабочийДокумент.РабочийДокумент = РабочийДокументРасчета ИЛИ НайденныеСтроки.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			ДобавитьДоступныеСлоты(ВыборкаРабочийДокумент.РабочийДокумент, 2, ПорядковыйНомерГруппы, ТекДатаПлан);
		КонецЦикла;
		
		// Заявки на сервис
		Пока ВыборкаРабочийДокумент.НайтиСледующий(3, "Порядок") Цикл
			ДобавитьДоступныеСлоты(ВыборкаРабочийДокумент.РабочийДокумент, 3, ПорядковыйНомерГруппы, ТекДатаПлан);
		КонецЦикла;
		
		// Выдача
		Пока ВыборкаРабочийДокумент.НайтиСледующий(4, "Порядок") Цикл
			ДобавитьДоступныеСлоты(ВыборкаРабочийДокумент.РабочийДокумент, 4, ПорядковыйНомерГруппы, ТекДатаПлан);
		КонецЦикла;	
		
	ИначеЕсли ТипЗнч(РабочийДокументРасчета) = Тип("ДокументСсылка.Renault_CRM_ЗаявкаНаСервис") Тогда 		
		ДобавитьДоступныеСлоты(РабочийДокументРасчета, 3, ПорядковыйНомерГруппы, ТекДатаПлан);
		
		Запрос = Новый Запрос;
		Запрос.Текст = ОбработкаОбъект.ТекстЗапросаПоСвязаннымДокументам();	
		
		Запрос.УстановитьПараметр("Обращение",       РабочийДокументРасчета.Обращение);
		Запрос.УстановитьПараметр("РабочийДокумент", РабочийДокументРасчета);
		
		Результат = Запрос.Выполнить();
		
		ВыборкаРабочийДокумент = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
		// Если есть еще заявки на сервис
		Пока ВыборкаРабочийДокумент.НайтиСледующий(3, "Порядок") Цикл
			НайденныеСтроки = ВыбранныеСлоты.НайтиСтроки(Новый Структура("Документ", ВыборкаРабочийДокумент.РабочийДокумент));

			Если ВыборкаРабочийДокумент.РабочийДокумент = РабочийДокументРасчета ИЛИ НайденныеСтроки.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			ДобавитьДоступныеСлоты(ВыборкаРабочийДокумент.РабочийДокумент, 3, ПорядковыйНомерГруппы, ТекДатаПлан);
		КонецЦикла;
		
		// Выдача
		Пока ВыборкаРабочийДокумент.НайтиСледующий(4, "Порядок") Цикл
			ДобавитьДоступныеСлоты(ВыборкаРабочийДокумент.РабочийДокумент, 4, ПорядковыйНомерГруппы, ТекДатаПлан);
		КонецЦикла;	
		
	ИначеЕсли ТипЗнч(РабочийДокументРасчета) = Тип("ДокументСсылка.Renault_CRM_ВыдачаАвтомобиля") Тогда
		ДобавитьДоступныеСлоты(РабочийДокументРасчета, 4, ПорядковыйНомерГруппы, ТекДатаПлан);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДоступныеСлоты(Документ, Порядок, ПорядковыйНомерГруппы, Знач ДатаНачала) 

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ДилерскийЦентр = ДилерскийЦентр;
	
	МассивЭтапов = Новый Массив;
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.Renault_CRM_ПриемкаАвтомобиля") 
		ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.Renault_CRM_ВыдачаАвтомобиля") Тогда
		
		НовыйЭтап = Новый Структура;
		НовыйЭтап.Вставить("ИмяЭтапа", "Этап 1");
		НовыйЭтап.Вставить("IDЭтапа", "");
		НовыйЭтап.Вставить("Длительность", Документ.ВремяОкончания - Документ.ВремяНачала);
		НовыйЭтап.Вставить("ОбластьПоиска", "Сотрудники");
		
		МассивЭтапов.Добавить(НовыйЭтап);
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.Renault_CRM_ЗаявкаНаСервис") Тогда 
		РаботыМойки = ОбработкаОбъект.ПолучитьСписокРаботМойки();			
		ДокОбъект = Документ.ПолучитьОбъект();
		
		Для Инд = 0 По ДокОбъект.Этапы.Количество() - 1 Цикл
			ТекСтрока = ДокОбъект.Этапы[Инд]; 
						
			//Пропускаем мойки
			СтрокиСоставаЭтапа = ДокОбъект.СоставЭтапа.НайтиСтроки(Новый Структура("IDЭтапа", ТекСтрока.IDЭтапа));
			Если СтрокиСоставаЭтапа.Количество() > 0 Тогда
				СтрокиРаботы = ДокОбъект.Работы.НайтиСтроки(Новый Структура("IDРаботы", СтрокиСоставаЭтапа[0].IDРаботы));
				Если СтрокиРаботы.Количество() > 0 И РаботыМойки.Найти(СтрокиРаботы[0].Работа) <> Неопределено Тогда
					Продолжить;
				КонецЕсли; 
			КонецЕсли; 
			
			НайденныеСтроки = ВыбранныеСлоты.НайтиСтроки(Новый Структура("IDЭтапа", ТекСтрока.IDЭтапа));
			Если НайденныеСтроки.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НовыйЭтап = Новый Структура;
			НовыйЭтап.Вставить("ИмяЭтапа", ТекСтрока.Этап);
			НовыйЭтап.Вставить("IDЭтапа", ТекСтрока.IDЭтапа);
			НовыйЭтап.Вставить("Длительность", ТекСтрока.КонецЭтапа - ТекСтрока.НачалоЭтапа);
			НовыйЭтап.Вставить("ОбластьПоиска", "Цеха");
			
			МассивЭтапов.Добавить(НовыйЭтап);
		КонецЦикла; 
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.Renault_CRM_ЗаявкаНаМойку") Тогда
		НовыйЭтап = Новый Структура;
		НовыйЭтап.Вставить("ИмяЭтапа", "Мойка");
		НовыйЭтап.Вставить("IDЭтапа", "");
		НовыйЭтап.Вставить("Длительность", Документ.ВремяОкончания - Документ.ВремяНачала);
		НовыйЭтап.Вставить("ОбластьПоиска", "Мойки");
		
		МассивЭтапов.Добавить(НовыйЭтап);
		
	КонецЕсли; 
	
	
	Для ИндексЭтапов = 0 По МассивЭтапов.ВГраница() Цикл
		ТекЭтап = МассивЭтапов[ИндексЭтапов]; 
		
		ДопПарам = Новый Структура;
		ДопПарам.Вставить("ДлительностьРабот"	, ТекЭтап.Длительность / 3600);
		ДопПарам.Вставить("ДатаОкончания"		, КонецДня(ДатаНачала)); 
		ДопПарам.Вставить("ТолькоРаботающие"	, ТолькоРаботающие);
		
		ТаблицаСлотов = ОбработкаОбъект.ПолучитьТаблицуСвободныхИнтервалов(ДатаНачала, ТекЭтап.ОбластьПоиска, ДопПарам);			
		
		// Если на дату начала нет слотов, то выполняем расчет на следующий день, 
		// до тех пор пока не найдем свободное время хотя бы по одному цеху.
		Счет = 0;
		Пока ТаблицаСлотов.Количество() = 0 Цикл //--- проверить
			Счет = Счет + 1;

			ДатаНачала = ДатаНачала + 86400;
			ДопПарам.Вставить("ДатаОкончания", КонецДня(ДатаНачала));  
			
			ТаблицаСлотов = ОбработкаОбъект.ПолучитьТаблицуСвободныхИнтервалов(ДатаНачала, ТекЭтап.ОбластьПоиска, ДопПарам);			
			
			Если Счет = 10 Тогда
				// Сделано на всякий случай, если при будущем изменении кода получения свбодных слотов или в других случаях возникнет зацикливание
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		
		ТаблицаСлотов.Сортировать("Цех,ВремяНачала");
		ТаблицаЦехов = ТаблицаСлотов.Скопировать(, "Цех");
		ТаблицаЦехов.Свернуть("Цех");
		
		НомерСлота = ДоступныеСлоты.Количество() + 1;	
		НомерГруппыВыбора = Формат(ПорядковыйНомерГруппы, "ЧГ=0");
		
		Для Инд = 0 По ТаблицаЦехов.Количество() - 1 Цикл   
			ТекЦех = ТаблицаЦехов[Инд].Цех;
			
			НайденныеСтроки = ТаблицаСлотов.НайтиСтроки(Новый Структура("Цех", ТекЦех));
			
			Для Каждого ТекСтрока Из НайденныеСтроки Цикл
				ТекВремяНачала	  = ТекСтрока.ВремяНачала;
				ТекВремяОкончания = ТекВремяНачала + ТекЭтап.Длительность;
				
				Пока ТекВремяОкончания < ТекСтрока.ВремяОкончания Цикл				
					НовСтрока = ДоступныеСлоты.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтрока);
					
					НовСтрока.Порядок         = Порядок;
					НовСтрока.Документ        = Документ;
					НовСтрока.ВремяНачала     = ТекВремяНачала;
					НовСтрока.ВремяОкончания  = ТекВремяОкончания;
					НовСтрока.ИмяСлота        = "Слот" + Формат(НомерСлота, "ЧГ=0");
					НовСтрока.Цех             = ТекСтрока.Цех;
					НовСтрока.ИмяГруппы       = "ГруппаЦех" + НомерГруппыВыбора + "_" + Формат(Инд + 1, "ЧГ=0");
					НовСтрока.ИмяГруппыВыбора = "ГруппаВыбора" + НомерГруппыВыбора;
					НовСтрока.Длительность    = ТекЭтап.Длительность / 3600;
					НовСтрока.Этап            = ТекЭтап.ИмяЭтапа;
					НовСтрока.IDЭтапа         = ТекЭтап.IDЭтапа;
					
					НомерСлота = НомерСлота + 1;
					
					ТекВремяНачала    = ТекВремяНачала + ИнтервалСлота;
					ТекВремяОкончания = ТекВремяНачала + ТекЭтап.Длительность;
				КонецЦикла; 
			КонецЦикла; 
		КонецЦикла;
		
		ПорядковыйНомерГруппы = ПорядковыйНомерГруппы + 1;
	КонецЦикла; 	
		
КонецПроцедуры

&НаСервере
Процедура ДобавитьВыбранныеСлоты(ИмяСлота)
	
	Счет = 0;
	ЕстьНеВыбранныеСлоты = Истина;
	
	Пока ЕстьНеВыбранныеСлоты Цикл
		Счет = Счет + 1;
		
		// Заполняем и проверяем выбранный слот
		НайденныеСтроки = ДоступныеСлоты.НайтиСтроки(Новый Структура("ИмяСлота", ИмяСлота));
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		СтрокаДоступные = НайденныеСтроки[0]; 
		НайденныеСтроки = ВыбранныеСлоты.НайтиСтроки(Новый Структура("ИмяГруппыВыбора", СтрокаДоступные.ИмяГруппыВыбора));
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаВыбранные = ВыбранныеСлоты.Добавить();
			
		ИначеЕсли НайденныеСтроки[0].ИмяСлота = СтрокаДоступные.ИмяСлота Тогда
			Возврат;
			
		Иначе	
			СтрокаВыбранные = НайденныеСтроки[0];
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаВыбранные, СтрокаДоступные);
		
		ТекущееИмяГруппыВыбора    = СтрокаВыбранные.ИмяГруппыВыбора;
		ТекущееВремяОкончания     = СтрокаВыбранные.ВремяОкончания;
		ПредыдущееВремяОкончания  = СтрокаВыбранные.ВремяОкончания;
		
		// Перезаполняем данные по группам выбора, начиная со следующей группы
		ПересчетСДокумента     = Неопределено;
		ГруппыВыбораНаУдаление = Новый Массив;
		
		КоличествоСтрок  = ВыбранныеСлоты.Количество();
		ИндексСледСтроки = ВыбранныеСлоты.Индекс(СтрокаВыбранные) + 1;
		
		Если ИндексСледСтроки < КоличествоСтрок Тогда
			Для Инд = ИндексСледСтроки По КоличествоСтрок - 1 Цикл 
				Если НачалоДня(ВыбранныеСлоты[Инд].ВремяНачала) = НачалоДня(ДатаПлан) Тогда
					Продолжить;
				КонецЕсли;
				
				Если ПересчетСДокумента = Неопределено Тогда
					ПересчетСДокумента = ВыбранныеСлоты[Инд].Документ;	
				КонецЕсли;
				
				ГруппыВыбораНаУдаление.Добавить(ВыбранныеСлоты[Инд].ИмяГруппыВыбора);
			КонецЦикла;
			
			Если ГруппыВыбораНаУдаление.Количество() > 0 Тогда
				Для Каждого СтрокаМ Из ГруппыВыбораНаУдаление Цикл
					НайденныеСтроки = ДоступныеСлоты.НайтиСтроки(Новый Структура("ИмяГруппыВыбора", СтрокаМ));
					Для Каждого СтрокаКоллекции Из НайденныеСтроки Цикл
						ДоступныеСлоты.Удалить(СтрокаКоллекции);		
					КонецЦикла;
					
					НайденныеСтроки = ВыбранныеСлоты.НайтиСтроки(Новый Структура("ИмяГруппыВыбора", СтрокаМ));
					Для Каждого СтрокаКоллекции Из НайденныеСтроки Цикл
						ВыбранныеСлоты.Удалить(СтрокаКоллекции);		
					КонецЦикла;
				КонецЦикла;
				
				РассчитатьДоступныеСлоты(ПересчетСДокумента, НачалоДня(СтрокаВыбранные.ВремяНачала)); 
			КонецЕсли;	
		КонецЕсли;
		
		// Заполняем выбранные слоты
		КоличествоСтрок = ДоступныеСлоты.Количество() - 1;
		Для Инд = ДоступныеСлоты.Индекс(СтрокаДоступные) По КоличествоСтрок Цикл 
			СтрокаДоступные = ДоступныеСлоты[Инд];
			
			Если ТекущееИмяГруппыВыбора <> СтрокаДоступные.ИмяГруппыВыбора Тогда
				НайденныеСтроки = ВыбранныеСлоты.НайтиСтроки(Новый Структура("ИмяГруппыВыбора", СтрокаДоступные.ИмяГруппыВыбора));
				СтрокаВыбранные = ?(НайденныеСтроки.Количество() = 0, ВыбранныеСлоты.Добавить(), НайденныеСтроки[0]);
				
				ЗаполнитьЗначенияСвойств(СтрокаВыбранные, СтрокаДоступные);
				
				Если ТекущееВремяОкончания <= СтрокаДоступные.ВремяНачала Тогда 
					ПредыдущееВремяОкончания = ТекущееВремяОкончания;
					ТекущееИмяГруппыВыбора   = СтрокаДоступные.ИмяГруппыВыбора;
					ТекущееВремяОкончания    = СтрокаДоступные.ВремяОкончания;
				Иначе
					СтрокаВыбранные.ИмяСлота = "";
					СтрокаВыбранные.ВремяНачала    = Дата(1,1,1);
					СтрокаВыбранные.ВремяОкончания = Дата(1,1,1);
				КонецЕсли;
			Иначе
				Если СтрокаВыбранные.ВремяНачала > СтрокаДоступные.ВремяНачала И ПредыдущееВремяОкончания <= СтрокаДоступные.ВремяНачала Тогда 			
					ЗаполнитьЗначенияСвойств(СтрокаВыбранные, СтрокаДоступные);
					
					ТекущееИмяГруппыВыбора = СтрокаДоступные.ИмяГруппыВыбора;
					ТекущееВремяОкончания  = СтрокаДоступные.ВремяОкончания;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		// Перезаполняем данные по группам выбора, исходя из доступных слотов
		ЕстьНеВыбранныеСлоты   = Ложь;
		ПересчетСДокумента  = Неопределено;
		ГруппыВыбораНаУдаление = Новый Массив;
		
		КоличествоСтрок = ВыбранныеСлоты.Количество() - 1;
		Для Инд = 0 По КоличествоСтрок Цикл 
			СтрокаВыбранные = ВыбранныеСлоты[Инд];
			
			Если СтрокаВыбранные.ВремяНачала = Дата(1,1,1) ИЛИ ПересчетСДокумента <> Неопределено Тогда				
				Если ПересчетСДокумента = Неопределено Тогда
					ЕстьНеВыбранныеСлоты  = Истина;
					ПересчетСДокумента = СтрокаВыбранные.Документ;
				КонецЕсли;
				
				ГруппыВыбораНаУдаление.Добавить(СтрокаВыбранные.ИмяГруппыВыбора);
			КонецЕсли;	
		КонецЦикла;
		
		Если ЕстьНеВыбранныеСлоты Тогда
			Для Каждого СтрокаМ Из ГруппыВыбораНаУдаление Цикл
				НайденныеСтроки = ДоступныеСлоты.НайтиСтроки(Новый Структура("ИмяГруппыВыбора", СтрокаМ));
				Для Каждого СтрокаКоллекции Из НайденныеСтроки Цикл
					ДоступныеСлоты.Удалить(СтрокаКоллекции);		
				КонецЦикла;
				
				НайденныеСтроки = ВыбранныеСлоты.НайтиСтроки(Новый Структура("ИмяГруппыВыбора", СтрокаМ));
				Для Каждого СтрокаКоллекции Из НайденныеСтроки Цикл
					ВыбранныеСлоты.Удалить(СтрокаКоллекции);		
				КонецЦикла;
			КонецЦикла;
			
			НомерСлота = ДоступныеСлоты.Количество() + 1;
			ИмяСлота = "Слот" + Формат(НомерСлота, "ЧГ=0");
			
			РассчитатьДоступныеСлоты(ПересчетСДокумента, НачалоДня(ПредыдущееВремяОкончания) + 86400); 
		КонецЕсли; 	
		
		Если Счет = 20 Тогда
			// Сделано на всякий случай, если при будущем изменении кода получения свободных слотов  или в других случаях возникнет зацикливание
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементыФормы()

	//---
	// Удаляем добавленные элементы формы и реквизиты формы
	ЭлементыФормыНаУдаление  = Новый Массив;
	РеквизитыФормыНаУдаление = Новый Массив;
	
	Для Каждого ЭлементФормы Из Элементы Цикл
		Если СтрНайти(ЭлементФормы.Имя, "ГруппаВыбора") > 0  Тогда
			Если СтрНайти(ЭлементФормы.Имя, "_") = 0 И ТипЗнч(ЭлементФормы) = Тип("ГруппаФормы") Тогда
				ЭлементыФормыНаУдаление.Добавить(ЭлементФормы);
			ИначеЕсли СтрНайти(ЭлементФормы.Имя, "_") > 0 И ТипЗнч(ЭлементФормы) = Тип("ПолеФормы") Тогда
				РеквизитыФормыНаУдаление.Добавить(ЭлементФормы.Имя);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;	
	
	Для Каждого ЭлементФормы Из ЭлементыФормыНаУдаление Цикл
		Элементы.Удалить(ЭлементФормы);
	КонецЦикла;	
	
	ИзменитьРеквизиты(, РеквизитыФормыНаУдаление); 
	
	// Добавляем новые элементы формы и реквизиты формы
	МассивРеквизитов = Новый Массив; 
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ФорматированнаяСтрока"));
	ОписаниеТиповФорматированныхСтрок = Новый ОписаниеТипов(МассивТипов);
	
	ГруппыИсполнителейТЗ = ДоступныеСлоты.Выгрузить(, "ИмяГруппыВыбора, ИмяГруппы, Цех"); 
	ГруппыИсполнителейТЗ.Свернуть("ИмяГруппыВыбора, ИмяГруппы, Цех");
	
	Для Индекс = 0 По ГруппыИсполнителейТЗ.Количество() - 1 Цикл
		ТекСтрокаВыбора = ГруппыИсполнителейТЗ[Индекс]; 
		ЦветФонаГруппы  = Новый Цвет();
		
		НайденнаяСтрока = ВыбранныеСлоты.НайтиСтроки(Новый Структура("ИмяГруппыВыбора", ТекСтрокаВыбора.ИмяГруппыВыбора));		
		Если НайденнаяСтрока.Количество() > 0 Тогда 			
			Если ТипЗнч(НайденнаяСтрока[0].Документ) = Тип("ДокументСсылка.Renault_CRM_ПриемкаАвтомобиля") Тогда
				ЦветФонаГруппы = Параметры.ЦветПриемки;
				
			ИначеЕсли ТипЗнч(НайденнаяСтрока[0].Документ) = Тип("ДокументСсылка.Renault_CRM_ЗаявкаНаСервис") 
				ИЛИ ТипЗнч(НайденнаяСтрока[0].Документ) = Тип("ДокументСсылка.Renault_CRM_ЗаявкаНаМойку") Тогда
				ЦветФонаГруппы = Параметры.ЦветРаботы;
				
			ИначеЕсли ТипЗнч(НайденнаяСтрока[0].Документ) = Тип("ДокументСсылка.Renault_CRM_ВыдачаАвтомобиля")  Тогда
				ЦветФонаГруппы = Параметры.ЦветВыдачи;
			КонецЕсли; 
		КонецЕсли;	
		
		ГруппаВыбораПервая = Элементы.Найти(ТекСтрокаВыбора.ИмяГруппыВыбора);
		
		Если ГруппаВыбораПервая = Неопределено Тогда
			ГруппаВыбораПервая = Элементы.Добавить(ТекСтрокаВыбора.ИмяГруппыВыбора, Тип("ГруппаФормы"), Элементы.ГруппаСлоты);
			ГруппаВыбораПервая.Заголовок                = СформироватьЗаголовокГруппы(НайденнаяСтрока[0].Документ, НайденнаяСтрока[0].Этап, НайденнаяСтрока[0].Длительность);
			ГруппаВыбораПервая.ШрифтЗаголовка           = Новый Шрифт("Arial", 11, Истина);
			ГруппаВыбораПервая.Вид                      = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаВыбораПервая.РастягиватьПоГоризонтали = Истина;
			ГруппаВыбораПервая.Группировка              = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			ГруппаВыбораПервая.ЦветФона                 = ЦветФонаГруппы;
		КонецЕсли;
				
		МассивРеквизитов.Добавить(Новый РеквизитФормы(ТекСтрокаВыбора.ИмяГруппыВыбора + "_" + ТекСтрокаВыбора.ИмяГруппы + "_Слоты", ОписаниеТиповФорматированныхСтрок, "", "", Ложь));
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивРеквизитов); 
	
	Для Индекс = 0 По ГруппыИсполнителейТЗ.Количество() - 1 Цикл
		ТекСтрокаВыбора = ГруппыИсполнителейТЗ[Индекс]; 
		
		ОтборСтрок = Новый Структура();
		ОтборСтрок.Вставить("ИмяГруппыВыбора", ТекСтрокаВыбора.ИмяГруппыВыбора);
		ОтборСтрок.Вставить("ИмяГруппы",       ТекСтрокаВыбора.ИмяГруппы);
		ОтборСтрок.Вставить("Цех",             ТекСтрокаВыбора.Цех);
		
		КоличествоСлотов = ДоступныеСлоты.НайтиСтроки(ОтборСтрок).Количество();
		
		НовыйЭлемент = Элементы.Добавить(ТекСтрокаВыбора.ИмяГруппыВыбора + "_" + ТекСтрокаВыбора.ИмяГруппы + "_Слоты", Тип("ПолеФормы"), Элементы[ТекСтрокаВыбора.ИмяГруппыВыбора]);
		НовыйЭлемент.Вид                      = ВидПоляФормы.ПолеНадписи;
		НовыйЭлемент.Заголовок                = Строка(ТекСтрокаВыбора.Цех) + Символы.ПС 
		+ ?(КоличествоСлотов > 50, Символы.ПС, "") + ?(КоличествоСлотов > 70, Символы.ПС, "") + ?(КоличествоСлотов > 90, Символы.ПС, "") + ?(КоличествоСлотов > 150, Символы.ПС + Символы.ПС, ""); 
		НовыйЭлемент.ШрифтЗаголовка           = Новый Шрифт("Arial", 11, Истина);
		НовыйЭлемент.ПоложениеЗаголовка       = ПоложениеЗаголовкаЭлементаФормы.Лево;
		НовыйЭлемент.ПутьКДанным              = ТекСтрокаВыбора.ИмяГруппыВыбора + "_" + ТекСтрокаВыбора.ИмяГруппы + "_Слоты";
		НовыйЭлемент.АвтоМаксимальнаяШирина   = Ложь;
		НовыйЭлемент.АвтоМаксимальнаяВысота   = Ложь;
		НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
		НовыйЭлемент.РастягиватьПоВертикали   = Истина;
		НовыйЭлемент.МаксимальнаяВысота       = 3 
		+ ?(КоличествоСлотов > 50, 1, 0) + ?(КоличествоСлотов > 70, 2, 0) + ?(КоличествоСлотов > 90, 2, 0) + ?(КоличествоСлотов > 120, 2, 0) + ?(КоличествоСлотов > 150, 2, 0);
		НовыйЭлемент.УстановитьДействие("ОбработкаНавигационнойСсылки", "СлотНажатие");
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ИзменитьЭлементыФормы()

	Если ДоступныеСлоты.Количество() > 0 Тогда 
		СлотыМассив = Новый Массив;
		СчетСлотов  = 10;
		ГруппаВыбораПервая = ДоступныеСлоты[0].ИмяГруппыВыбора;
		ГруппаВыбораВторая = ДоступныеСлоты[0].ИмяГруппы;
		
		ПредДоступноеВремяНачала    = Дата(1,1,1);
		
		Если ВыбранныеСлоты.Количество() > 0 Тогда
			ПредВыбранноеВремяОкончания = ВыбранныеСлоты[0].ВремяОкончания;
			ТекВыбранноеВремяОкончания  = ВыбранныеСлоты[0].ВремяОкончания;
		Иначе
			ПредВыбранноеВремяОкончания = Дата(1,1,1);
			ТекВыбранноеВремяОкончания  = Дата(1,1,1);
		КонецЕсли;
		
		ЭтаФорма[ГруппаВыбораПервая + "_" + ГруппаВыбораВторая + "_Слоты"] = Новый ФорматированнаяСтрока("");
		
		Для Инд = 0 По ДоступныеСлоты.Количество() - 1 Цикл		 
			СтрокаДоступныйСлот = ДоступныеСлоты[Инд];
			
			Если СтрокаДоступныйСлот.ИмяГруппыВыбора <> ГруппаВыбораПервая Тогда
				ПредВыбранноеВремяОкончания = ТекВыбранноеВремяОкончания;
			КонецЕсли;	
			
			Если СтрокаДоступныйСлот.ИмяГруппыВыбора <> ГруппаВыбораПервая ИЛИ СтрокаДоступныйСлот.ИмяГруппы <> ГруппаВыбораВторая Тогда
				ЭтаФорма[ГруппаВыбораПервая + "_" + ГруппаВыбораВторая + "_Слоты"] = Новый ФорматированнаяСтрока(СлотыМассив);
				Элементы[ГруппаВыбораПервая + "_" + ГруппаВыбораВторая + "_Слоты"].Заголовок = СокрЛП(Элементы[ГруппаВыбораПервая + "_" + ГруппаВыбораВторая + "_Слоты"].Заголовок) 
				+ Символы.ПС + ?(СчетСлотов > 50, Символы.ПС, "") + ?(СчетСлотов > 70, Символы.ПС, "") + ?(СчетСлотов > 90, Символы.ПС, "") + ?(СчетСлотов > 120, Символы.ПС, "") + ?(СчетСлотов > 150, Символы.ПС + Символы.ПС, "");
				
				СлотыМассив = Новый Массив;
				СчетСлотов  = 0;
				
				ГруппаВыбораПервая = СтрокаДоступныйСлот.ИмяГруппыВыбора;
				ГруппаВыбораВторая = СтрокаДоступныйСлот.ИмяГруппы;
			КонецЕсли;	
			
			ВыбранныйСлот = Ложь;
			СтрокаВыбранныйСлот = Неопределено;
			
			Для Каждого СтрокаВыбранныйСлот Из ВыбранныеСлоты Цикл					
				Если СтрокаДоступныйСлот.ИмяСлота = СтрокаВыбранныйСлот.ИмяСлота Тогда					
					ВыбранныйСлот = Истина;
					
					Если СтрокаВыбранныйСлот.ВремяОкончания <> Дата(1,1,1) Тогда
						ТекВыбранноеВремяОкончания = СтрокаВыбранныйСлот.ВремяОкончания;
					КонецЕсли;
					
					ИсходныйЗаголовокГруппы = Элементы[ГруппаВыбораПервая].Заголовок;
					ПозицияСкобкиВЗаголовке = СтрНайти(ИсходныйЗаголовокГруппы, ")");
					
					ДатаГруппыТекст = ?(СтрокаВыбранныйСлот.ВремяНачала = Дата(1,1,1), "", " планирование на " + Формат(СтрокаВыбранныйСлот.ВремяНачала, "ДФ=дд") + "." + Формат(СтрокаВыбранныйСлот.ВремяНачала, "ДФ=ММ"));
					Элементы[ГруппаВыбораПервая].Заголовок = Сред(ИсходныйЗаголовокГруппы, 1, ПозицияСкобкиВЗаголовке) + ДатаГруппыТекст;	
										
					Прервать;
				КонецЕсли;	
			КонецЦикла;	
			
			Если СтрокаДоступныйСлот.ИмяГруппыВыбора = "ГруппаВыбора1" ИЛИ ПредВыбранноеВремяОкончания <= СтрокаДоступныйСлот.ВремяНачала Тогда
				ВремяСлота = Формат(СтрокаДоступныйСлот.ВремяНачала, "ДФ=ЧЧ:мм");
				
				Если Час(ПредДоступноеВремяНачала) <> Час(СтрокаДоступныйСлот.ВремяНачала) Тогда
					ПредДоступноеВремяНачала = СтрокаДоступныйСлот.ВремяНачала;
					НачалоЧаса = Истина;
				Иначе
					НачалоЧаса = Ложь;
				КонецЕсли;	
				
				Если НачалоЧаса И СлотыМассив.Количество() > 0 Тогда
					СлотыМассив.Добавить("   ");	
				КонецЕсли;	
				
				Если ВыбранныйСлот Тогда
					СлотыМассив.Добавить(Новый ФорматированнаяСтрока(ВремяСлота, Новый Шрифт("Arial", 13, Истина), Новый Цвет(178, 34, 34), , СтрокаДоступныйСлот.ИмяСлота));
				Иначе
					СлотыМассив.Добавить(Новый ФорматированнаяСтрока(ВремяСлота, Новый Шрифт("Arial", 10, ?(НачалоЧаса, Истина, Ложь)), , , СтрокаДоступныйСлот.ИмяСлота));
				КонецЕсли;	
				
				СчетСлотов = СчетСлотов + 1;
				СлотыМассив.Добавить("  ");	
			КонецЕсли;
			
			Если Инд = ДоступныеСлоты.Количество() - 1 Тогда
				ЭтаФорма[ГруппаВыбораПервая + "_" + ГруппаВыбораВторая + "_Слоты"] = Новый ФорматированнаяСтрока(СлотыМассив);
				Элементы[ГруппаВыбораПервая + "_" + ГруппаВыбораВторая + "_Слоты"].Заголовок = СокрЛП(Элементы[ГруппаВыбораПервая + "_" + ГруппаВыбораВторая + "_Слоты"].Заголовок) 
				+ Символы.ПС + ?(СчетСлотов > 50, Символы.ПС, "") + ?(СчетСлотов > 70, Символы.ПС, "") + ?(СчетСлотов > 90, Символы.ПС, "") + ?(СчетСлотов > 120, Символы.ПС, "") + ?(СчетСлотов > 150, Символы.ПС + Символы.ПС, "");  
			КонецЕсли;
			
		КонецЦикла; 
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
