// Функция получения возможных состояний заказ-нарядов
//
// Возвращаемое значение:
//   <ТаблицаЗначений>   - таблица значений состояний заказ-нарядов
//
Функция ПолучитьТаблицуВидовРемонтовЗаказНарядов() Экспорт
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ВидыРемонта.Ссылка КАК ВидРемонта,
	                    |	ВидыРемонта.Представление КАК ВидРемонтаПредставление
	                    |ИЗ
	                    |	Справочник.ВидыРемонта КАК ВидыРемонта
	                    |ГДЕ
	                    |	ВидыРемонта.ПометкаУдаления = ЛОЖЬ
						|"+?(зфЗащищенныеФункцииСервер.ПодсистемаДоступна("ЗащитаАвтосалон"),"","И ВидыРемонта.Ссылка<>ЗНАЧЕНИЕ(Справочник.ВидыРемонта.КомплектацияАвтомобиля)")+"
	                    |АВТОУПОРЯДОЧИВАНИЕ");
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ПолучитьТаблицуВидовСостоянийЗаказНарядов()

// Функция получения возможных состояний заказ-нарядов
//
// Возвращаемое значение:
//   <ТаблицаЗначений>   - таблица значений состояний заказ-нарядов
//
Функция ПолучитьТаблицуВидовСостоянийЗаказНарядов() Экспорт
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ВидыСостоянийЗаказНарядов.Ссылка КАК ВидыСостоянийЗаказНарядов,
	                    |	ВидыСостоянийЗаказНарядов.Представление КАК ВидыСостоянийЗаказНарядовПредставление
	                    |ИЗ
	                    |	Справочник.ВидыСостоянийЗаказНарядов КАК ВидыСостоянийЗаказНарядов
	                    |ГДЕ
	                    |	ВидыСостоянийЗаказНарядов.ПометкаУдаления = ЛОЖЬ
	                    |
	                    |УПОРЯДОЧИТЬ ПО
	                    |	ВидыСостоянийЗаказНарядов.Порядок");
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ПолучитьТаблицуВидовСостоянийЗаказНарядов()

