
&НаКлиенте
Процедура ЗапчастиПромоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(
		РегистрыСведений.Renault_Промоакции.ПолучитьПромоакции(
			Объект.Дата, Элементы.Запчасти.ТекущиеДанные.Номенклатура)
			);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапчастиПромоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Элементы.Запчасти.ТекущиеДанные.Промо = ВыбранноеЗначение;
	
КонецПроцедуры
