// Модуль документа РабочийЛистОтделаСтрахования

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;					// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;		// Переменная для накопления результатов проведения по модулям наборов записей
Перем ИмяРеквизитаКода Экспорт;     	// Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/атрикула в ТЧ
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования
Перем ОбработкаРасчетСкидок Экспорт;	// Переменная для хранения ссылки на обработку "Расчет скидок". Данная обработка содержит необходимые
Перем СписокСтатусов Экспорт;			// Список статусов рабочих листов

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА


// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Автор",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("МенеджерОтделаСтрахования",1);
	ОбязательныеРеквизиты.Вставить("Статус",1);
	ОбязательныеРеквизиты.Вставить("ВидОплаты",1);
	ОбязательныеРеквизиты.Вставить("Страхователь",1);
	ОбязательныеРеквизиты.Вставить("ПредставлениеТелефона",1);
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("Организация",1);
	
	ОбязательноеСтрахование=Новый Структура();
	//Бондаренко++ 20260610
	//ОбязательноеСтрахование.Вставить("ОбъектСтрахования",		3);
	//Бондаренко-- 20260610
	ОбязательноеСтрахование.Вставить("ПрограммаСтрахования",	3);
	ОбязательныеРеквизиты.Вставить("ВариантыСтрахования",  ОбязательноеСтрахование);	
	
	Возврат ОбязательныеРеквизиты;
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Проверяет корректность заполнения объекта.
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры:
//  Ошибки       - строка, в случае некорректного заполнения содержит описанием возникших ошибок, 
//  ДопРеквизиты - структура, на вход может быть передана структура с дополнительными реквизитами для проверки,
//  Заполнение   - булево, флаг проверки, 
//  Уникальность - булево, флаг проверки.
//
// Возвращаемое значение:
//  Булево - Возвращает Истина если все заполнено корректно и Ложь иначе.
// 
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	Возврат Результат;	
КонецФункции // ПроверитьКорректность()
 
// Функция проверяет, допустимо ли изменение объекта
//
// Параметры:
//  БлокироватьРеквизиты - структура, структура блокируемых на изменение реквизитов.
//
// Возвращаемое значение:
// Булево - Возвращает Истина, если изменения возможны, ложь иначе
//          Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
//
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции // ДоступностьИзменения()

// Возвращает список возможных хозяйственных операций документа
// Вовращаемое значение: 
//  СписокЗначений. 
//  Строка списка: Значение - имя предопределенного элемента; 
//				   Представление - красивое его представление
// 				   "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("РабочийЛистОтделаСтрахования","Рабочий лист отдела страхования",Истина);
	//Бондаренко++ 20260610
	СписокХозОпераций.Добавить("РабочийЛистОтделаСтрахованияРасторжениеСП","Рабочий лист отдела страхования Расторжение СП",Истина);
    //Бондаренко-- 20260610
	Возврат СписокХозОпераций;
КонецФункции // ПолучитьСписокХозОпераций()

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка			– Имя реквизита документа с полным путем (например Тавары.Номенклатура).
//  ЭтаФорма	– Форма				– Ссылка на форму документа. Если значение неопределено, производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Стркутура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	Если Имя="Страхователь" Тогда
		Результат	= дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		
		#Если Клиент Тогда
		КодРегиона = "";
		КодГорода = "";
		НомерТелефона = "";
		ВнутреннийНомер = "";
		ПредставлениеТелефона = "";
		ВидТелефона = Неопределено;
		Если ЗначениеЗаполнено(Страхователь) Тогда
			Телефоны = киПолучитьСписокТелефоновОбъекта(Страхователь);
			Если Телефоны<>Неопределено И Телефоны.Количество()>0 Тогда
				ЗаполнитьЗначенияСвойств(ЭтотОбъект,Телефоны[0].Значение);
			КонецЕсли;
		КонецЕсли; 
		#КонецЕсли
		
		Возврат Результат;

	ИначеЕсли Имя="ВариантыСтрахования.ПрограммаСтрахования" Тогда
		Результат	= Истина;
		// Вид страхования и страховую компанию следует получить из программы страхования
		Если НЕ обЗначениеНеЗаполнено(ТекСтрока.ПрограммаСтрахования) Тогда
			ТекСтрока.ВидСтрахования	= ТекСтрока.ПрограммаСтрахования.ВидСтрахования;
 			//Бондаренко++ 20251028
 			ТекСтрока.СтраховаяКомпания = ТекСтрока.ПрограммаСтрахования.Партнер;
			ТекСтрока.Страховщик		= ТекСтрока.ПрограммаСтрахования.Партнер.БанкКонтрагент;
			//Бондаренко-- 20251028
			ТекСтрока.ПроцентКомиссии	= ТекСтрока.ПрограммаСтрахования.Вознаграждение;
			//Бондаренко++ 20260707
			ОбработкаРеквизита("ВариантыСтрахования.ПроцентКомиссии",ТекСтрока,ЭтаФорма);
			//Бондаренко-- 20260707
 		КонецЕсли;
		Возврат Результат;
	ИначеЕсли Имя="ВариантыСтрахования.ВидСтрахования" Тогда
		Результат	= Истина;
		// Программа страхования должна соответствовать виду страхования
		Если НЕ обЗначениеНеЗаполнено(ТекСтрока.ВидСтрахования) И
			НЕ обЗначениеНеЗаполнено(ТекСтрока.ПрограммаСтрахования) И
			Текстрока.ВидСтрахования<>ТекСтрока.ПрограммаСтрахования.ВидСтрахования Тогда
			ТекСтрока.ПрограммаСтрахования	= Справочники.ПрограммыСтрахования.ПустаяСсылка();
		КонецЕсли;
		Возврат Результат;
	ИначеЕсли Имя="ВариантыСтрахования.Страховщик" Тогда
		Результат	= Истина;
		// Страховщик должна соответствовать виду страхования
		Если НЕ обЗначениеНеЗаполнено(ТекСтрока.Страховщик) И
			НЕ обЗначениеНеЗаполнено(ТекСтрока.ПрограммаСтрахования) И
			Текстрока.Страховщик<>ТекСтрока.ПрограммаСтрахования.СтраховаяКомпания Тогда
			ТекСтрока.ПрограммаСтрахования	= Справочники.ПрограммыСтрахования.ПустаяСсылка();
		КонецЕсли;
		Возврат Результат;
		
	ИначеЕсли Имя="ВариантыСтрахования.СтраховаяСумма" Тогда
		Результат	= Истина;
		
		Если ТипЗнч(ДопПараметры)<>Тип("Структура") Тогда
			ДопПараметры 			= Новый Структура;
		КонецЕсли;
		
		Если ТекСтрока.Тариф>0 Тогда
			ДопПараметры.Вставить("РассчитыватьСуммуПремии",Ложь);
 			ТекСтрока.ПроцентКомиссии = ТекСтрока.Тариф;
 		Иначе	
			ДопПараметры.Вставить("РассчитыватьСуммуПремии",Истина);
 			ТекСтрока.ПроцентКомиссии = ТекСтрока.ПрограммаСтрахования.Вознаграждение;
		КонецЕсли;
		
		Результат=ОбработкаРеквизита("ВариантыСтрахования.СуммаПремии",ТекСтрока,ЭтаФорма,ДопПараметры);
		
		Если ТекСтрока.СуммаБрутто=0 Тогда
			ТекСтрока.СуммаБрутто	= ТекСтрока.СтраховаяСумма;
			Результат=ОбработкаРеквизита("ВариантыСтрахования.СуммаБрутто",ТекСтрока,ЭтаФорма,ДопПараметры) И Результат;
			ТекСтрока.СуммаНетто	= 0;
		КонецЕсли;
		
		Результат=ОбработкаРеквизита("ВариантыСтрахования.СуммаСкидкиСтроки",ТекСтрока,ЭтаФорма,ДопПараметры) И Результат;
		Возврат Результат;
		
	ИначеЕсли Имя="ВариантыСтрахования.Тариф" Тогда	
		Результат	= Истина;
		
		Если ТипЗнч(ДопПараметры)<>Тип("Структура") Тогда
			ДопПараметры 			= Новый Структура;
		КонецЕсли;
		Если ТекСтрока.СтраховаяСумма>0 Тогда
			ДопПараметры.Вставить("РассчитыватьСуммуПремии",Ложь);
			Если ТекСтрока.Тариф > 0 Тогда
				ТекСтрока.ПроцентКомиссии = ТекСтрока.Тариф;	
 			Иначе
				ТекСтрока.ПроцентКомиссии = ТекСтрока.ПрограммаСтрахования.Вознаграждение;	
			КонецЕсли;
  			Результат=ОбработкаРеквизита("ВариантыСтрахования.СуммаПремии",ТекСтрока,ЭтаФорма,ДопПараметры);
		КонецЕсли;
		Возврат Результат;
		
	ИначеЕсли Имя="ВариантыСтрахования.СуммаНетто" Тогда
		Результат	= Истина;
		
		ТекСтрока.СуммаКомиссии	= ТекСтрока.СуммаБрутто - ТекСтрока.СуммаНетто - ТекСтрока.СуммаСкидкиСтроки;
		
		Возврат Результат;
		
	ИначеЕсли Имя="ВариантыСтрахования.СуммаБрутто" Тогда
		Результат	= Истина;
		
		//Бондаренко++ 20260619
		//ТекСтрока.СуммаНетто	= ТекСтрока.СуммаБрутто - Окр(ТекСтрока.СуммаБрутто*ТекСтрока.ПроцентКомиссии/100,2);
		ТекСтрока.СуммаНетто	= ТекСтрока.СуммаБрутто - Окр(ТекСтрока.СуммаБрутто*(ТекСтрока.ПроцентКомиссии-ТекСтрока.УменьшениеПроцентаКВ)/100,2);
		//Бондаренко-- 20260619
		
		Результат=ОбработкаРеквизита("ВариантыСтрахования.СуммаНетто",ТекСтрока,ЭтаФорма,ДопПараметры) И Результат;
		
		ТекСтрока.СуммаКомиссии = ТекСтрока.СуммаБрутто - ТекСтрока.СуммаНетто - ТекСтрока.СуммаСкидкиСтроки;
		
		РассчитыватьСуммуПремии	= Истина;
		Если ТипЗнч(ДопПараметры)=Тип("Структура") И ДопПараметры.Свойство("РассчитыватьСуммуПремии") Тогда
			РассчитыватьСуммуПремии	= ДопПараметры.РассчитыватьСуммуПремии;	
		КонецЕсли;
		
		Если РассчитыватьСуммуПремии Тогда
			ТекСтрока.СуммаПремии	= ТекСтрока.СуммаБрутто - ТекСтрока.СуммаСкидкиСтроки;
		КонецЕсли;
	
		Возврат Результат;
		
	ИначеЕсли Имя="ВариантыСтрахования.ПроцентКомиссии" Тогда
		Результат	= Истина;
		Если ТекСтрока.ПроцентКомиссии>100 Тогда
			ТекСтрока.ПроцентКомиссии	= 100;
		КонецЕсли;
		Результат=ОбработкаРеквизита("ВариантыСтрахования.СуммаБрутто",ТекСтрока,ЭтаФорма,ДопПараметры) И Результат;
		Возврат Результат;
	//Бондаренко++ 20260619	
	ИначеЕсли Имя="ВариантыСтрахования.УменьшениеПроцентаКВ" Тогда
		Результат	= Истина;
		Если ТекСтрока.УменьшениеПроцентаКВ > ТекСтрока.ПроцентКомиссии Тогда
			ТекСтрока.УменьшениеПроцентаКВ = ТекСтрока.ПроцентКомиссии;
		КонецЕсли;
		Результат=ОбработкаРеквизита("ВариантыСтрахования.СуммаБрутто",ТекСтрока,ЭтаФорма,ДопПараметры) И Результат;
		Возврат Результат;
	//Бондаренко-- 20260619		
 	ИначеЕсли Имя="ВариантыСтрахования.СуммаКомиссии" Тогда
		Результат				= Истина;
		ТекСтрока.СуммаБрутто 	= ТекСтрока.СуммаКомиссии + ТекСтрока.СуммаНетто + ТекСтрока.СуммаСкидкиСтроки;
		Результат=ОбработкаРеквизита("ВариантыСтрахования.СуммаБрутто",ТекСтрока,ЭтаФорма,ДопПараметры) И Результат;
		Возврат Результат;
		
	ИначеЕсли Имя="ВариантыСтрахования.СуммаПремии" Тогда
		Результат				= Истина;
		ТекСтрока.СуммаБрутто	= ТекСтрока.СуммаПремии + ТекСтрока.СуммаСкидкиСтроки;
		ТекСтрока.СуммаНетто	= 0;
		Результат=ОбработкаРеквизита("ВариантыСтрахования.СуммаБрутто",ТекСтрока,ЭтаФорма,ДопПараметры) И Результат;
		Возврат Результат;
		
	ИначеЕсли Имя="ВариантыСтрахования.ПроцентСкидкиСтроки" Тогда	
		Результат	= Истина;
		#Если Клиент Тогда 			
		// Скидка не может быть выше 100%
		Если ТекСтрока.ПроцентСкидкиСтроки > 100 Тогда
			ТекСтрока.ПроцентСкидки = 100;	
		КонецЕсли;
		
		СуммаБезСкидки				= ТекСтрока.СуммаБрутто;
		ТекСтрока.СуммаСкидкиСтроки	= Окр(СуммаБезСкидки * ТекСтрока.ПроцентСкидкиСтроки / 100, 2);
		
		Если ТипЗнч(ДопПараметры) <> Тип("Структура") Тогда
			ДопПараметры = Новый Структура;
		КонецЕсли;
		ДопПараметры.Вставить("ПересчитыватьПроцент", Ложь);
			
		Результат=ОбработкаРеквизита("ВариантыСтрахования.СуммаСкидкиСтроки",ТекСтрока,ЭтаФорма,ДопПараметры) И Результат;			
		#КонецЕсли
		Возврат Результат;
		
	ИначеЕсли Имя="ВариантыСтрахования.СуммаСкидкиСтроки" Тогда
		Результат	= Истина;
		#Если Клиент Тогда		 						
			// Проверим дополнительные параметры, возможно пересчитывать процент не нужно. 			
			Попытка // Определим необходимость обратного расчета процента скидки.
				ПересчитыватьПроцент = ДопПараметры.ПересчитыватьПроцент;
			Исключение 
				ПересчитыватьПроцент = Истина;
			КонецПопытки;
			
			Если ПересчитыватьПроцент Тогда
				СуммаБезСкидки = ТекСтрока.СуммаБрутто;
				ТекСтрока.ПроцентСкидкиСтроки = ?(СуммаБезСкидки = 0, 0, Окр(ТекСтрока.СуммаСкидкиСтроки * 100 / СуммаБезСкидки,2));
			КонецЕсли;
			Результат=ОбработкаРеквизита("ВариантыСтрахования.СуммаБрутто",ТекСтрока,ЭтаФорма,ДопПараметры) И Результат;
		#КонецЕсли				
		Возврат Результат;
		
	//Бондаренко-- 20250805
	ИначеЕсли Имя = "ВариантыСтрахования.АгентПодразделение" Тогда	
		Если Не обЗначениеНеЗаполнено(ТекСтрока.АгентПодразделение) Тогда
			ЕстьПодчиненные = Справочники.ПодразделенияКомпании.СМГ_ЕстьПодчиненныеПодразделения(ТекСтрока.АгентПодразделение);
			Если ЕстьПодчиненные Тогда
				СМГ_Сообщить("ОШИБКА! Запрещено использовать подразделение """+СокрЛП(ТекСтрока.АгентПодразделение)+""" из группы """+СокрЛП(ТекСтрока.АгентПодразделение.Родитель)+""".",СтатусСообщения.ОченьВажное);
				ТекСтрока.АгентПодразделение = "";
			КонецЕсли;
			//Бондаренко++ 20250712
			Если обЗначениеНеЗаполнено(ТекСтрока.СтраховаяКомпания) Тогда
				ТекСтрока.СтраховаяКомпания = Справочники.БанкиЛкПартнеры.НайтиПоРеквизиту("БанкКонтрагент",ТекСтрока.ПрограммаСтрахование.СтраховаяКомпания);
			КонецЕсли;
			Если НЕ обЗначениеНеЗаполнено(ТекСтрока.АгентПодразделение) Тогда 
				Если НЕ обЗначениеНеЗаполнено(ТекСтрока.СтраховаяКомпания) Тогда	
					ТекСтрока.ДоговорКв = НайтиСоздатьДоговорПродажаПД(ТекСтрока.АгентПодразделение,ТекСтрока.СтраховаяКомпания.БанкКонтрагент);
				КонецЕсли;
			КонецЕсли;
			//Бондаренко++ 20250712
		КонецЕсли;	
	//Бондаренко-- 20250805
	//Бондаренко-- 20251106
	ИначеЕсли Имя = "ЭтоПролонгация" Тогда
		Для каждого Стр Из ВариантыСтрахования Цикл
			Стр.ЭтоПролонгация = ЭтотОбъект.ЭтоПролонгация;
		КонецЦикла;
	//Бондаренко-- 20251106	
	Иначе	
		Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()

//Бондаренко++ 20251031
Функция НайтиСоздатьДоговорПродажаПД(Подр,Контр) Экспорт
	
	Дог_ = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыВзаиморасчетов.Ссылка КАК Договор,
	|	ДоговорыВзаиморасчетов.ЭтоГруппа КАК ЭтоГруппа,
	|	ДоговорыВзаиморасчетов.ПометкаУдаления КАК ПометкаУдаления,
	|	ДоговорыВзаиморасчетов.ВидДоговора КАК ВидДоговора,
	|	ДоговорыВзаиморасчетов.ДатаНачала КАК ДатаНачала,
	|	ДоговорыВзаиморасчетов.ДатаКонца КАК ДатаКонца,
	|	ДоговорыВзаиморасчетов.Владелец КАК Владелец,
	|	ДоговорыВзаиморасчетов.Организация КАК Организация,
	|	ДоговорыВзаиморасчетов.ДляПервичныхДокументов КАК ДляПервичныхДокументов
	|ИЗ
	|	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|ГДЕ
	|	НЕ ДоговорыВзаиморасчетов.ПометкаУдаления
	|	И НЕ ДоговорыВзаиморасчетов.ЭтоГруппа
	|	И ДоговорыВзаиморасчетов.Владелец = &Владелец
	|	И ДоговорыВзаиморасчетов.Организация = &Организация
	|	И ДоговорыВзаиморасчетов.ВидДоговора = &ВидДоговора
	|	И ДоговорыВзаиморасчетов.ДляПервичныхДокументов";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоров.Продажа);
	Запрос.УстановитьПараметр("Владелец", Контр);
	Запрос.УстановитьПараметр("Организация", Подр.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Дог_ = ВыборкаДетальныеЗаписи.Договор;
		//СМГ_Сообщить("Договор найден");
		Прервать;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(Дог_) Тогда
		
		//СМГ_Сообщить("Договор НЕ найден",СтатусСообщения.ОченьВажное);
		
		Дог_ = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();		
		
		Дог_.Заполнить("");
		
		Дог_.Владелец = Контр;
		Дог_.Организация = Подр.Организация;
		Дог_.Подразделение = Подр;
		Дог_.ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
		
		//Бондаренко++ 20250801
		Дог_.ДляАвтомобилей = Истина;
		Дог_.ДляАвтосалона = Истина;
		Дог_.ДляПервичныхДокументов = Истина;
		//Бондаренко-- 20250801
		
		Дог_.СформироватьНаименование();
		
		//Бондаренко-- 20250801
		//Дог_.Внутренний = Истина;
		Дог_.Внутренний = Ложь;
		//Бондаренко-- 20250801
		
		Дог_.УстановитьНовыйКод("");
		
		Попытка
			Дог_.Записать();		
		Исключение
			СМГ_Сообщить("ОШИБКА! Не удалось создать договор <<Продажа ПД>> для контрагента <<"+СокрЛП(Контр)+">> по организации <<"+СокрЛП(Подр.Организация)+">>.");
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Дог_.Ссылка;    	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
КонецФункции // НайтиСоздатьДоговорПродажаПД(Подр,Контр)
//Бондаренко-- 20251031


// Функция возвращает сотрудника на основании переданного пользователя
//
Функция ПолучитьСотрудникаПоПользователю(ТекущийПользователь) Экспорт
	ТекущийСотрудник	= Справочники.Сотрудники.ПустаяСсылка();
	
	Если НЕ обЗначениеНеЗаполнено(ТекущийПользователь) И НЕ ПустаяСтрока(ТекущийПользователь.Наименование) Тогда
		Если обЗначениеНеЗаполнено(ТекущийПользователь.Сотрудник) Тогда
			ТекущийСотрудник	= Справочники.Сотрудники.НайтиПоНаименованию(ТекущийПользователь.Наименование, Истина);
			Если обЗначениеНеЗаполнено(ТекущийСотрудник) Тогда
				// Создадим нового сотрудника
				СотрудникОбъект	= Справочники.Сотрудники.СоздатьЭлемент();
				СотрудникОбъект.УстановитьНовыйКод();
				СотрудникОбъект.Наименование	= ТекущийПользователь.Наименование;
				СотрудникОбъект.Организация= ПараметрыСеанса.Организация;
				СотрудникОбъект.Подразделение	= ПараметрыСеанса.ПодразделениеКомпании;
				СотрудникОбъект.Должность		= Справочники.Должности.Неопределена;
				Попытка
					СотрудникОбъект.Записать();
					ТекущийСотрудник	= СотрудникОбъект.Ссылка;
				Исключение КонецПопытки;
			КонецЕсли;
		Иначе
			ТекущийСотрудник	= ТекущийПользователь.Сотрудник;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекущийСотрудник;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

#Если Клиент Тогда

// Функция осуществляет печать произвольного документа.
// Можно направить печать на экран или принтер, а также распечатать необходмое количество копий.
//
// Параметры:
//	ЭтотОбъект							- ДокументОбъект	- Документ для печати
//	НазваниеПечатнойФормы 				- Строка			- Название печатной формы, если пусто, то по умолчанию
//	КоличествоЭкземпляров				- Число				- Количество экземпляров документа
//	НаПринтер							- Булево			- Признак отправки документа на принтер без отображения его на экране
//  Документ 	  						- ТабличныйДокумент	- Макет печатной формы
//
// Возвращаемое значение:
//   ТабличныйДокумент	- Сформированная печатная форма
//
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции // Печать()

// Возвращает доступные варианты печати документа
// Вовращаемое значение: 
//  Струткура, каждая строка которой
//  соответствует одному из вариантов печати
//  Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм() Экспорт
	СтруктураМакетов=Новый Структура();
	Возврат СтруктураМакетов;
КонецФункции // ПолучитьСписокПечатныхФорм()

#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события при установке новго номера
//
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Обработчик события заполнения
//
Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
	
	//Бондаренко++ 20260610
	Если Не обЗначениеНеЗаполнено(Основание) Тогда
		Если ТипЗнч(Основание)=Тип("ДокументСсылка.РабочийЛист") Тогда
			ХозОперация	= Справочники.ХозОперации.РабочийЛистОтделаСтрахования;		
		ИначеЕсли ТипЗнч(Основание)=Тип("ДокументСсылка.РабочийЛистОтделаСтрахования") Тогда	
			ХозОперация	= Справочники.ХозОперации.РабочийЛистОтделаСтрахованияРасторжениеСП;	
		КонецЕсли;
	Иначе
	    ХозОперация	= Справочники.ХозОперации.РабочийЛистОтделаСтрахования;		
	КонецЕсли;
	//Бондаренко-- 20260610
 	
 	// Ввод на основании рабочего листа или рабочего листа отдела страхования
	Если ТипЗнч(Основание)=Тип("ДокументСсылка.РабочийЛист") Тогда
		МенеджерОтделаСтрахования	= Основание.Менеджер;
		ПричинаОтказа				= Основание.ПричинаОтказа;
		ВидОплаты					= Основание.ВидОплаты;
		
		ВидТелефона 				= Основание.ВидТелефона;
		КодРегиона					= Основание.КодРегиона;
		КодГорода					= Основание.КодГорода;	
		НомерТелефона				= Основание.НомерТелефона;
		ВнутреннийНомер				= Основание.ВнутреннийНомер;
		ПредставлениеТелефона		= Основание.ПредставлениеТелефона;	
		
		Страхователь				= Основание.Контрагент;
		
		Если ТипЗнч(Основание)=Тип("ДокументСсылка.РабочийЛист") Тогда
			Если НЕ обЗначениеНеЗаполнено(Основание.Автомобиль) Тогда
				НоваяСтрока				= ВариантыСтрахования.Добавить();
				//Бондаренко++ 20251030
				Если НЕ обЗначениеНеЗаполнено(Основание.Автомобиль) Тогда
					НоваяСтрока.ОбъектСтрахования	= Основание.Автомобиль;
				Иначе
					НоваяСтрока.ОбъектСтрахования	= Основание.Модель;
				КонецЕсли;
				//Бондаренко++ 20251030
			КонецЕсли;
		КонецЕсли;
	//Бондаренко++ 20260610	
	ИначеЕсли ТипЗнч(Основание)=Тип("ДокументСсылка.РабочийЛистОтделаСтрахования") Тогда 
		
		МенеджерОтделаСтрахования	=  ПараметрыСеанса.Пользователь.Сотрудник;
		ПричинаОтказа				= Основание.ПричинаОтказа;
		ВидОплаты					= Основание.ВидОплаты;
		
		ВидТелефона 				= Основание.ВидТелефона;
		КодРегиона					= Основание.КодРегиона;
		КодГорода					= Основание.КодГорода;	
		НомерТелефона				= Основание.НомерТелефона;
		ВнутреннийНомер				= Основание.ВнутреннийНомер;
		ПредставлениеТелефона		= Основание.ПредставлениеТелефона;	
		
		Страхователь				= Основание.Страхователь;
	//Бондаренко-- 20260610
	
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события при копировании
//
Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриКопировании()

// Обработчик события перед записью
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда Возврат; КонецЕсли;
	
	//Бондаренко++ 20251008
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Возврат;		
	КонецЕсли;
	
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		Если РежимЗаписи = РежимЗаписиДокумента.Запись ИЛИ РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Если Не Статус = Справочники.СтатусыРабочегоЛиста.Отказ Тогда
				//Бондаренко++ 20251111
				Если Не обЗначениеНеЗаполнено(ДокументОснование) Тогда
				//Бондаренко-- 20251111
					ЕстьДублиРЛКО = ПроверитьНаДублиРЛОC(ДокументОснование);
					Если ЕстьДублиРЛКО Тогда
						СМГ_Сообщить("Ошибка! Есть дубли РЛОС. Текущий документ не может быть записан.",СтатусСообщения.ОченьВажное);
						Отказ = Истина;
						Возврат;
					КонецЕсли;
				//Бондаренко++ 20251111
				КонецЕсли;
				//Бондаренко-- 20251111
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Бондаренко-- 20251008
	
	//Бондаренко++ 20260611
	Если СуммаДокумента <> ВариантыСтрахования.Итог("СуммаКомиссии") Тогда
		СуммаДокумента = ВариантыСтрахования.Итог("СуммаКомиссии"); 
 	КонецЕсли;
 	//Бондаренко-- 20260611
 	
КонецПроцедуры // ПередЗаписью()

//Бондаренко++ 20251008
Функция ПроверитьНаДублиРЛОC(ДокОсн)

	Фл_ = Ложь;

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РабочийЛистОтделаСтрахования.Ссылка КАК РЛОС,
	               |	РабочийЛистОтделаСтрахования.ДокументОснование КАК ДокументОснование,
	               |	РабочийЛистОтделаСтрахования.ПометкаУдаления КАК ПометкаУдаления,
	               |	РабочийЛистОтделаСтрахования.Статус КАК Статус
	               |ИЗ
	               |	Документ.РабочийЛистОтделаСтрахования КАК РабочийЛистОтделаСтрахования
	               |ГДЕ
	               |	РабочийЛистОтделаСтрахования.ДокументОснование = &ДокументОснование
	               |	И НЕ РабочийЛистОтделаСтрахования.Ссылка = &Ссылка
	               |	И НЕ РабочийЛистОтделаСтрахования.ПометкаУдаления
	               |	И НЕ РабочийЛистОтделаСтрахования.Статус = &СтатусОтказ";
	
	Запрос.УстановитьПараметр("ДокументОснование",ДокОсн);
	Запрос.УстановитьПараметр("Ссылка",Ссылка); 
	Запрос.УстановитьПараметр("СтатусОтказ",Справочники.СтатусыРабочегоЛиста.Отказ);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для каждого Стр Из ТЗ Цикл
		СМГ_Сообщить("ОШИБКА! Есть подчиненный к "+ДокОсн+" и не помеченный на удаление документ "+Стр.РЛОС,СтатусСообщения.ОченьВажное);
		Фл_ = Истина;
 	КонецЦикла;
	
	Возврат Фл_;
 		 
КонецФункции // ПроверитьНаДублиРЛОC(ДокОсн)
//Бондаренко-- 20251008	

// Обработчик события при записи
//
Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	СМГ_ПриЗаписи();
КонецПроцедуры // ПриЗаписи()

//Бондаренко++ 20251029
Процедура СМГ_ПриЗаписи()
	
	РабочийЛистОткорректирован = Ложь;
	
	Если Не обЗначениеНеЗаполнено(ДокументОснование) Тогда
		Если ТипЗНЧ(ДокументОснование) = Тип("ДокументСсылка.РабочийЛист") Тогда
			ДокОснОбъект = ДокументОснование.ПолучитьОбъект();
			Если ДокОснОбъект.ДатаРеализацииАвтомобиля <> Дата(1,1,1) ИЛИ Не обЗначениеНеЗаполнено(ДокОснОбъект.РеализацияАвтомобиля) Тогда
				Если СообщатьОбИзмененииРЛ Тогда	
	 				СМГ_Сообщить("Внимание! Автомобиль по <<"+ДокОснОбъект+">> уже продан. РЛ корректировать запрещено.",СтатусСообщения.Информация);
					Возврат;
	 			КонецЕсли;
			КонецЕсли;
			Если ТипЗНЧ(Страхователь) = Тип("СправочникСсылка.Контрагенты") Тогда
				Если ТипЗНЧ(ДокументОснование.Контрагент) <> Тип("СправочникСсылка.Контрагенты") Тогда
					ДокОснОбъект.Контрагент = Страхователь;
					ДокОснОбъект.Лид = Страхователь;
					РабочийЛистОткорректирован = Истина;
				КонецЕсли;			
			КонецЕсли;			
			Если СокрЛП(ДокументОснование.КонтактныйТелефон) <> СокрЛП(ПредставлениеТелефона) Тогда
				ДокОснОбъект.КонтактныйТелефон = СокрЛП(ПредставлениеТелефона);
				ДокОснОбъект.ПредставлениеТелефонаЛида = СокрЛП(ПредставлениеТелефона);
				РабочийЛистОткорректирован = Истина;
			КонецЕсли; 
			
			Если Не ДокОснОбъект.ЕстьДополнительныеСтраховыеПолисы Тогда
				ДокОснОбъект.ЕстьДополнительныеСтраховыеПолисы = Истина;
				РабочийЛистОткорректирован = Истина;
			КонецЕсли; 
 			
			Если НЕ обЗначениеНеЗаполнено(ДокОснОбъект.ПрограммаКАСКО) Тогда
				ДокОснОбъект.КАСКО = Ложь;
 				ДокОснОбъект.ПрограммаКАСКО="";
				ДокОснОбъект.СуммаКаско=0;
				ДокОснОбъект.НаличныеПрограммаКАСКО=Ложь;
				ДокОснОбъект.КВКаско=0;
				ДокОснОбъект.СвязанСКредитКАСКО=Ложь;
 				ДокОснОбъект.СтраховаяКомпанияКАСКО = "";
				ДокОснОбъект.АгентПодразделениеКАСКО = "";
				//Бондаренко++ 20251031
				ДокОснОбъект.ДоговорКвКАСКО = "";
				//Бондаренко-- 20251031
 				РабочийЛистОткорректирован=Истина;
			КонецЕсли;
			Если НЕ обЗначениеНеЗаполнено(ДокОснОбъект.ПрограммаОСАГО) Тогда
			    ДокОснОбъект.ОСАГО = Ложь;
				ДокОснОбъект.ПрограммаОСАГО="";
				ДокОснОбъект.СуммаОСАГО=0;
				ДокОснОбъект.НаличныеПрограммаОСАГО=Ложь;
				ДокОснОбъект.КВосаго=0;
				ДокОснОбъект.СвязанСКредитОСАГО=Ложь;
 				ДокОснОбъект.СтраховаяКомпанияОСАГО = "";
				ДокОснОбъект.АгентПодразделениеОСАГО = "";
				//Бондаренко++ 20251031
				ДокОснОбъект.ДоговорКвОСАГО = "";
				//Бондаренко-- 20251031
 				РабочийЛистОткорректирован=Истина;
			КонецЕсли;
			Если НЕ обЗначениеНеЗаполнено(ДокОснОбъект.ПрограммаСтрахованиеЖизни) Тогда
 				ДокОснОбъект.ПрограммаСтрахованиеЖизни = "";
				ДокОснОбъект.СуммаСтрахованиеЖизни=0;
				ДокОснОбъект.НаличныеПрограммаСЖ=Ложь;
				ДокОснОбъект.КВСЖ=0;
				ДокОснОбъект.СвязанСКредитСЖ=Ложь;
 				ДокОснОбъект.СтраховаяКомпанияСЖ = "";
				ДокОснОбъект.АгентПодразделениеСЖ = ""; 
				//Бондаренко++ 20251031
				ДокОснОбъект.ДоговорКвСЖ = "";
				//Бондаренко-- 20251031
 				РабочийЛистОткорректирован=Истина;
			КонецЕсли;
			Если ДокОснОбъект.ИныеСтраховыеПродукты.Количество() > 0 Тогда
				ДокОснОбъект.ИныеСтраховыеПродукты.Очистить();
			КонецЕсли;
			//Бондаренко-- 20250513
			Для каждого Стр Из ВариантыСтрахования Цикл
				Если обЗначениеНеЗаполнено(Стр.ПрограммаСтрахования) Тогда
					Продолжить;
				КонецЕсли;
				Если Стр.ПрограммаСтрахования.ВидСтрахования = Перечисления.ВидыСтрахования.КАСКО Тогда
					Если НЕ ДокОснОбъект.КАСКО Тогда
						ДокОснОбъект.КАСКО = Истина;
						РабочийЛистОткорректирован = Истина;						
					КонецЕсли;
					Если ДокОснОбъект.ПрограммаКАСКО <> Стр.ПрограммаСтрахования Тогда
						ДокОснОбъект.ПрограммаКАСКО = Стр.ПрограммаСтрахования;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;	
					Если ДокОснОбъект.СуммаКаско <> Стр.СтраховаяСумма Тогда
						ДокОснОбъект.СуммаКаско = Стр.СтраховаяСумма;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					Если ДокОснОбъект.НаличныеПрограммаКАСКО <> Стр.Наличные Тогда
						ДокОснОбъект.НаличныеПрограммаКАСКО = Стр.Наличные;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					Если ДокОснОбъект.КВКаско <> Стр.СуммаКомиссии Тогда
						ДокОснОбъект.КВКаско = Стр.СуммаКомиссии;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					Если ДокОснОбъект.СвязанСКредитКАСКО Тогда
						ДокОснОбъект.СвязанСКредитКАСКО = Ложь;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					//Бондаренко++ 20250724
					Если ДокОснОбъект.СтраховаяКомпанияКАСКО <> Стр.СтраховаяКомпания Тогда
						ДокОснОбъект.СтраховаяКомпанияКАСКО = Стр.СтраховаяКомпания;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					Если ДокОснОбъект.АгентПодразделениеКАСКО <> Стр.АгентПодразделение Тогда 
						ДокОснОбъект.АгентПодразделениеКАСКО = Стр.АгентПодразделение;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					//Бондаренко++ 20251031
					Если ДокОснОбъект.ДоговорКвКАСКО <> Стр.ДоговорКв Тогда 
						ДокОснОбъект.ДоговорКвКАСКО = Стр.ДоговорКв;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
 					//Попытка
					//	ДокОснОбъект.ДоговорКвКАСКО = ДокОснОбъект.НайтиСоздатьДоговорПрочий(ДокОснОбъект.АгентПодразделениеКАСКО,ДокОснОбъект.СтраховаяКомпанияКАСКО.БанкКонтрагент);
					//	РабочийЛистОткорректирован = Истина;
					//Исключение
					//КонецПопытки;
					//Бондаренко++ 20251031
					//Бондаренко-- 20250724	
				ИначеЕсли Стр.ПрограммаСтрахования.ВидСтрахования = Перечисления.ВидыСтрахования.ОСАГО Тогда
					Если НЕ ДокОснОбъект.ОСАГО Тогда
						ДокОснОбъект.ОСАГО = Истина;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					Если ДокОснОбъект.ПрограммаОСАГО <> Стр.ПрограммаСтрахования Тогда
						ДокОснОбъект.ПрограммаОСАГО = Стр.ПрограммаСтрахования;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					Если ДокОснОбъект.СуммаОсаго <> Стр.СтраховаяСумма Тогда
						ДокОснОбъект.СуммаОсаго = Стр.СтраховаяСумма;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					Если ДокОснОбъект.НаличныеПрограммаОСАГО <> Стр.Наличные Тогда
						ДокОснОбъект.НаличныеПрограммаОСАГО = Стр.Наличные;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					Если ДокОснОбъект.КВОсаго <> Стр.СуммаКомиссии Тогда
						ДокОснОбъект.КВОсаго = Стр.СуммаКомиссии;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					Если ДокОснОбъект.СвязанСКредитОСАГО Тогда
						ДокОснОбъект.СвязанСКредитОСАГО = Ложь;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					//Бондаренко++ 20250724
					Если ДокОснОбъект.СтраховаяКомпанияОСАГО <> Стр.СтраховаяКомпания Тогда
						ДокОснОбъект.СтраховаяКомпанияОСАГО = Стр.СтраховаяКомпания;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					Если ДокОснОбъект.АгентПодразделениеОСАГО <> Стр.АгентПодразделение Тогда 
						ДокОснОбъект.АгентПодразделениеОСАГО = Стр.АгентПодразделение;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					//Бондаренко++ 20251031
					Если ДокОснОбъект.ДоговорКвОСАГО <> Стр.ДоговорКв Тогда 
						ДокОснОбъект.ДоговорКвКАСКО = Стр.ДоговорКв;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
 					//Попытка
					//	ДокОснОбъект.ДоговорКвОСАГО = ДокОснОбъект.НайтиСоздатьДоговорПрочий(ДокОснОбъект.АгентПодразделениеОСАГО,ДокОснОбъект.СтраховаяКомпанияОСАГО.БанкКонтрагент);
					//	РабочийЛистОткорректирован = Истина;
					//Исключение
					//КонецПопытки;
 					//Бондаренко-- 20251031	
				ИначеЕсли Стр.ПрограммаСтрахования.ВидСтрахования = Перечисления.ВидыСтрахования.СтрахованиеЖизни Тогда  
					Если ДокОснОбъект.ПрограммаСтрахованиеЖизни <> Стр.ПрограммаСтрахования Тогда
						ДокОснОбъект.ПрограммаСтрахованиеЖизни = Стр.ПрограммаСтрахования;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					Если ДокОснОбъект.СуммаСтрахованиеЖизни <> Стр.СтраховаяСумма Тогда
						ДокОснОбъект.СуммаСтрахованиеЖизни = Стр.СтраховаяСумма;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					Если ДокОснОбъект.НаличныеПрограммаСЖ <> Стр.Наличные Тогда
						ДокОснОбъект.НаличныеПрограммаСЖ = Стр.Наличные;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					Если ДокОснОбъект.КВСЖ <> Стр.СуммаКомиссии Тогда
						ДокОснОбъект.КВСЖ = Стр.СуммаКомиссии;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					Если ДокОснОбъект.СвязанСКредитСЖ Тогда
						ДокОснОбъект.СвязанСКредитСЖ = Ложь;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					//Бондаренко++ 20250724
					Если ДокОснОбъект.СтраховаяКомпанияСЖ <> Стр.СтраховаяКомпания Тогда
						ДокОснОбъект.СтраховаяКомпанияСЖ = Стр.СтраховаяКомпания;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					Если ДокОснОбъект.АгентПодразделениеСЖ <> Стр.АгентПодразделение Тогда 
						ДокОснОбъект.АгентПодразделениеСЖ = Стр.АгентПодразделение;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					//Бондаренко++ 20251031
					Если ДокОснОбъект.ДоговорКвСЖ <> Стр.ДоговорКв Тогда 
						ДокОснОбъект.ДоговорКвСЖ = Стр.ДоговорКв;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					//Попытка
					//	ДокОснОбъект.ДоговорКвСЖ = ДокОснОбъект.НайтиСоздатьДоговорПрочий(ДокОснОбъект.АгентПодразделениеСЖ,ДокОснОбъект.СтраховаяКомпанияСЖ.БанкКонтрагент);
					//	РабочийЛистОткорректирован = Истина;
					//Исключение
					//КонецПопытки;
					//Бондаренко-- 20251031	
				Иначе
					ИнойСтрахПродукт = ДокОснОбъект.ИныеСтраховыеПродукты.Добавить();
					ИнойСтрахПродукт.ПрограммаСтрахования = Стр.ПрограммаСтрахования;
					ИнойСтрахПродукт.СуммаСтрахования = Стр.СтраховаяСумма;
					ИнойСтрахПродукт.Наличные = Стр.Наличные;
					ИнойСтрахПродукт.КВ = Стр.СуммаКомиссии;
					ИнойСтрахПродукт.СвязанСКредитом = Ложь;
					//Бондаренко++ 20250724	
					ИнойСтрахПродукт.СтраховаяКомпания = Стр.СтраховаяКомпания;
					ИнойСтрахПродукт.АгентПодразделение = Стр.АгентПодразделение;
					//Бондаренко++ 20251031
					ИнойСтрахПродукт.ДоговорКв = Стр.ДоговорКв;
					//Попытка
					//	ИнойСтрахПродукт.ДоговорКв = ДокОснОбъект.НайтиСоздатьДоговорПрочий(Стр.АгентПодразделение,Стр.СтраховаяКомпания.БанкКонтрагент);
					//Исключение
					//КонецПопытки;
					//Бондаренко-- 20251031
					РабочийЛистОткорректирован = Истина;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если РабочийЛистОткорректирован Тогда
		Попытка
			ДокОснОбъект.Записать(РежимЗаписиДокумента.Запись);
			
			//Бондаренко++ 20250724	
			Если СообщатьОбИзмененииРЛ Тогда	
				//Бондаренко-- 20250806		
				СМГ_Сообщить("Внимание! Откорректирован <<"+ДокОснОбъект+">>",СтатусСообщения.Информация);
				//Бондаренко++ 20250806	
			КонецЕсли;
			//Бондаренко-- 20250724
			
		Исключение
			СМГ_Сообщить("ОШИБКА! Не удалось откорректировать <<"+ДокОснОбъект+">>",СтатусСообщения.ОченьВажное);
		КонецПопытки;
		
	КонецЕсли;
 	
КонецПроцедуры
//Бондаренко-- 20251029

// Обработчик события перед удалением
//
Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()

// Обработчик события удаления проведения
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события проведения
//
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда Возврат; КонецЕсли;
	
	// Проведение по регистру сведений Журнал событий
	Если НЕ Отказ Тогда
		Если НЕ орЖурналСостояний(Ссылка, Статус) Тогда
			Отказ=Истина;
			Возврат;
		КонецЕсли; 
	КонецЕсли;	
	
	// выведем сообщения об ошибках и предупреждениях
	дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
	
КонецПроцедуры // ОбработкаПроведения()

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
// сохранение ссылки на коллекцию прав, настроек и окружения
Права                 = Неопределено;
ОбработкаРасчетСкидок = Неопределено;

// Список статусов рабочего листа
СписокСтатусов	= Новый СписокЗначений;
ЗапросСтатусов		= Новый Запрос();
		ЗапросСтатусов.Текст= "ВЫБРАТЬ
		                      |	СтатусыРабочегоЛиста.Ссылка КАК Ссылка,
		                      |	СтатусыРабочегоЛиста.Наименование КАК Наименование
		                      |ИЗ
		                      |	Справочник.СтатусыРабочегоЛиста КАК СтатусыРабочегоЛиста
		                      |ГДЕ
		                      |	СтатусыРабочегоЛиста.ИспользоватьВРабочемЛистеОтделаСтрахования
		                      |	И НЕ СтатусыРабочегоЛиста.ПометкаУдаления
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	СтатусыРабочегоЛиста.ПорядокВОтчете УБЫВ";
ВыборкаСтатусов	= ЗапросСтатусов.Выполнить().Выбрать();
Пока ВыборкаСтатусов.Следующий() Цикл
	СписокСтатусов.Добавить(ВыборкаСтатусов.Ссылка);	
КонецЦикла;

#Если Клиент Тогда
Права = глПрава;
ОбработкаРасчетСкидок = Обработки.РасчетСкидок.Создать();
#КонецЕсли
