
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СчетчикСообщений = 0;
	
	ПраваПользователя = ПараметрыСеанса.Renault_ПраваПользователя;
	
	СтруктураНастроекСписка = Новый Структура;
	ОтображаемыеТипыТрафика = Новый Структура;
	ОтображаемыеТипыТрафика.Вставить("ПоказыватьОК", Истина);
	ОтображаемыеТипыТрафика.Вставить("ПоказыватьПочту", Истина);
	ОтображаемыеТипыТрафика.Вставить("ПоказыватьЛиды", Истина);
	СтруктураНастроекСписка.Вставить("ОтображаемыеТипыТрафика", ОтображаемыеТипыТрафика);
	СтруктураНастроекСписка.Вставить("ВыводитьВсеНеобработанные", Истина);
	
	ПоказыватьОК = Истина;
	ПоказыватьПочту = Истина;
	ПоказыватьЛиды = Истина;
	ПоказыватьСертификатыКонтроля = Истина;
	ВыводитьВсеНеобработанные = Истина;
	
	РольПользователя = ПраваПользователя.ПраваИНастройки.КонтактЦентр_РольПользователя;
	ПолныйДоступКLMT = РольДоступна("ПолныеПрава");
	ПериодДанных.Вариант = ВариантСтандартногоПериода.ЭтотМесяц;
	ОтборДЦ = Renault_CRM.ПолучитьДилерскийЦентрПользователя();;
	ОбновитьТаблицуНаСервере();
	Если РольПользователя = Перечисления.Renault_КонтактЦентр_РолиПользователей.Менеджер Тогда
		Элементы.ГруппаИсполнители.ТекущаяСтраница = Элементы.ГруппаТрафикМенеджер;
		Элементы.ГруппаТрафикАдминистратор.Видимость = Ложь;
	Иначе
		Элементы.ГруппаИсполнители.ТекущаяСтраница = Элементы.ГруппаТрафикАдминистратор;
		Элементы.ГруппаТрафикМенеджер.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ГруппаОбработкаСообщений.Видимость = Ложь;
	
	Элементы.СообщениеШаблон1.Видимость = Ложь;
	Элементы.СообщениеШаблон2.Видимость = Ложь;
	Элементы.СообщениеШаблон3.Видимость = Ложь;
	
	// Если передаем ID, то пытаемся открыть вкладку с выбранным трафиком
	Если Параметры.Свойство("ID") Тогда
		ID = Параметры.ID;
		Если ТипЗнч(ID) = Тип("Строка") Тогда
			Если ЗначениеЗаполнено(ID) Тогда
				Элементы.ГруппаОбработкаСообщений.Видимость = Истина;
				ДобавитьСтраницу(ID);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДатуАктуальности() Экспорт
	
	ПолучитьДатуАктуальностиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДатуАктуальностиНаСервере()
	
	Набор = РегистрыСведений.Renault_ДатыАктуальностиКонтактЦентр.СоздатьНаборЗаписей();
	Набор.Отбор.ТипТрафика.Установить(Справочники.CRM_ТипТрафика.ЛидRenault);
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
		ДатаАктуальности = '00010101';
	Иначе
		ДатаАктуальности = Набор[0].ДатаАктуальности;
	КонецЕсли;
	
	ЗадержкаПолучения = ТекущаяДата() - ДатаАктуальности;
	
	ДатаРегЗадания = Константы.Renault_ДатаОбновленияКЦ.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуНаСервере()
	
	Отбор = Новый Структура;
	ТекущаяСтраница = Элементы.ГруппаСтрМенеджер.ТекущаяСтраница;
	
	Если ТекущаяСтраница = Элементы.ГруппаМойТрафик Тогда
		//Отбор.Вставить();
	ИначеЕсли ТекущаяСтраница = Элементы.ГруппаВОбработкеМенеджер Тогда
		
	ИначеЕсли ТекущаяСтраница = Элементы.ГруппаВсеВходящие Тогда
		
	ИначеЕсли ТекущаяСтраница = Элементы.ГруппаВсеМенеджер Тогда
		
	КонецЕсли;
	
	Массив = Новый Массив;
	Массив.Добавить(СписокВОбработке);
	Массив.Добавить(СписокВОбработкеАдминистратор);
	Массив.Добавить(СписокВсе);
	Массив.Добавить(СписокВсеАдминистратор);
	Массив.Добавить(СписокВсеВходящие);
	Массив.Добавить(СписокВходящие);
	Массив.Добавить(СписокМойТрафик);
	Массив.Добавить(СписокНазначенные);
	Для Каждого Сп ИЗ Массив Цикл
		Сп.Параметры.УстановитьЗначениеПараметра("НачалоПериода", ПериодДанных.ДатаНачала);
		Сп.Параметры.УстановитьЗначениеПараметра("КонецПериода", ПериодДанных.ДатаОкончания);
		//Сп.Параметры.УстановитьЗначениеПараметра("Сотрудник", ПараметрыСеанса.Пользователь.Сотрудник);
		Сп.Параметры.УстановитьЗначениеПараметра("ПоказыватьОК", ПоказыватьОК);
		Сп.Параметры.УстановитьЗначениеПараметра("ПоказыватьПочту", ПоказыватьПочту);
		Сп.Параметры.УстановитьЗначениеПараметра("ПоказыватьЛиды", ПоказыватьЛиды);
		Если Сп.Параметры.Элементы.Найти("ВыводитьВсеНеобработанные") <> Неопределено Тогда
			Сп.Параметры.УстановитьЗначениеПараметра("ВыводитьВсеНеобработанные", ВыводитьВсеНеобработанные);
		КонецЕсли;
		Если Сп.Параметры.Элементы.Найти("Сотрудник") <> Неопределено Тогда
			Сп.Параметры.УстановитьЗначениеПараметра("Сотрудник", ПараметрыСеанса.Пользователь.Сотрудник);
		КонецЕсли;
		Если Сп.Параметры.Элементы.Найти("ОтборДЦ") <> Неопределено Тогда
			Сп.Параметры.УстановитьЗначениеПараметра("ОтборДЦ", ОтборДЦ);
		КонецЕсли;
		Если Сп.Параметры.Элементы.Найти("ОтборПриоритет") <> Неопределено Тогда
			Сп.Параметры.УстановитьЗначениеПараметра("ОтборПриоритет", ОтборПриоритет);
		КонецЕсли;
		Если Сп.Параметры.Элементы.Найти("ОтборОтдел") <> Неопределено Тогда
			Сп.Параметры.УстановитьЗначениеПараметра("ОтборОтдел", ОтборОтдел);
		КонецЕсли;
		Если Сп.Параметры.Элементы.Найти("ТекущаяДата") <> Неопределено Тогда
			Сп.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
		КонецЕсли;
		Если Сп.Параметры.Элементы.Найти("ПустаяДата") <> Неопределено Тогда
			Сп.Параметры.УстановитьЗначениеПараметра("ПустаяДата", '00010101');
		КонецЕсли;
		Если Сп.Параметры.Элементы.Найти("ПоказыватьСертификатыКонтроля") <> Неопределено Тогда
			Сп.Параметры.УстановитьЗначениеПараметра("ПоказыватьСертификатыКонтроля", ПоказыватьСертификатыКонтроля);
		КонецЕсли;
		Если Сп.Параметры.Элементы.Найти("НаименованиеСертификат") <> Неопределено Тогда
			Сп.Параметры.УстановитьЗначениеПараметра("НаименованиеСертификат", "Сертификат контроля");
		КонецЕсли;
	КонецЦикла;
	
	УстановитьЗаголовки();
	
	
	//СписокМойТрафик.Параметры.УстановитьЗначениеПараметра("НачалоПериода", ПериодДанных.ДатаНачала);
	//СписокМойТрафик.Параметры.УстановитьЗначениеПараметра("КонецПериода", ПериодДанных.ДатаОкончания);
	//СписокМойТрафик.Параметры.УстановитьЗначениеПараметра("Сотрудник", ПараметрыСеанса.Пользователь.Сотрудник);
	////Список.Параметры.УстановитьЗначениеПараметра("ПоказатьТрафикПоМенеджерам", Истина);//ПоказатьТрафикПоМенеджерам);
	//
	////Список.Параметры.УстановитьЗначениеПараметра("ИспользуетсяОК", ПраваПользователя.РаботаетОнлайнКонсультант);
	////Список.Параметры.УстановитьЗначениеПараметра("ИспользуютсяЛиды", ПраваПользователя.РаботаютЛиды);
	////Список.Параметры.УстановитьЗначениеПараметра("ИспользуетсяПочта", ПраваПользователя.РаботаетПочта);
	//
	//СписокМойТрафик.Параметры.Элементы.Найти(.УстановитьЗначениеПараметра("ПоказыватьОК", СтруктураНастроекСписка.ОтображаемыеТипыТрафика.ПоказыватьОК);
	//СписокМойТрафик.Параметры.УстановитьЗначениеПараметра("ПоказыватьПочту", СтруктураНастроекСписка.ОтображаемыеТипыТрафика.ПоказыватьПочту);
	//СписокМойТрафик.Параметры.УстановитьЗначениеПараметра("ПоказыватьЛиды", СтруктураНастроекСписка.ОтображаемыеТипыТрафика.ПоказыватьЛиды);
	//СписокМойТрафик.Параметры.УстановитьЗначениеПараметра("ВыводитьВсеНеобработанные", СтруктураНастроекСписка.ВыводитьВсеНеобработанные);
	//
	////Список.Параметры.УстановитьЗначениеПараметра("НастройкиКонтактЦентра", НастройкиКонтактЦентра);
	//СписокМойТрафик.Параметры.УстановитьЗначениеПараметра("ШаблонПользователя", ПраваПользователя.ПраваИНастройки);
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = СписокВходящие.ТекстЗапроса;
	//Запрос.УстановитьПараметр("НачалоПериода", ПериодДанных.ДатаНачала);
	//Запрос.УстановитьПараметр("КонецПериода", ПериодДанных.ДатаОкончания);
	////Запрос.УстановитьПараметр("Сотрудник", ПараметрыСеанса.Пользователь.Сотрудник);
	//Запрос.УстановитьПараметр("ПоказыватьОК", СтруктураНастроекСписка.ОтображаемыеТипыТрафика.ПоказыватьОК);
	//Запрос.УстановитьПараметр("ПоказыватьПочту", СтруктураНастроекСписка.ОтображаемыеТипыТрафика.ПоказыватьПочту);
	//Запрос.УстановитьПараметр("ПоказыватьЛиды", СтруктураНастроекСписка.ОтображаемыеТипыТрафика.ПоказыватьЛиды);
	//Запрос.УстановитьПараметр("ВыводитьВсеНеобработанные", СтруктураНастроекСписка.ВыводитьВсеНеобработанные);
	////Запрос.УстановитьПараметр("ШаблонПользователя", ПраваПользователя.ПраваИНастройки);
	//Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовки()
	
	РольПользователя = ПраваПользователя.ПраваИНастройки.КонтактЦентр_РольПользователя;
	Если РольПользователя = Перечисления.Renault_КонтактЦентр_РолиПользователей.Менеджер Тогда
		
		Элементы.ГруппаМойТрафик.Заголовок = "Мой трафик (" + ПросчитатьКоличествоЛидов(СписокМойТрафик) + ")";
		Элементы.ГруппаВОбработкеМенеджер.Заголовок = "В обработке (" + ПросчитатьКоличествоЛидов(СписокВОбработке) + ")";
		Элементы.ГруппаВсеВходящие.Заголовок = "Все свободные (" + ПросчитатьКоличествоЛидов(СписокВсеВходящие) + ")";
		Элементы.ГруппаВсеМенеджер.Заголовок = "Все (" + ПросчитатьКоличествоЛидов(СписокВсе) + ")";
		
	Иначе
		
		Элементы.ГруппаВходящие.Заголовок = "Входящие (" + ПросчитатьКоличествоЛидов(СписокВходящие) + ")";
		Элементы.ГруппаНазначенные.Заголовок = "Назначенные (" + ПросчитатьКоличествоЛидов(СписокНазначенные) + ")";
		Элементы.ГруппаВОбработке.Заголовок = "В обработке (" + ПросчитатьКоличествоЛидов(СписокВОбработкеАдминистратор) + ")";
		Элементы.ГруппаВсе.Заголовок = "Все (" + ПросчитатьКоличествоЛидов(СписокВсеАдминистратор) + ")";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПросчитатьКоличествоЛидов(Список)
	
	Запрос = Новый Запрос;
	Запрос.Текст = Список.ТекстЗапроса;
	Для Каждого СтрПараметр ИЗ Список.Параметры.Элементы Цикл
		Запрос.УстановитьПараметр(Строка(СтрПараметр.Параметр), СтрПараметр.Значение);
	КонецЦикла;
	Возврат Запрос.Выполнить().Выгрузить().Количество();
	
КонецФункции

&НаКлиенте
Процедура ПериодДанныхПриИзменении(Элемент)
	
	ОбновитьТаблицуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтрМенеджерПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ОбновитьТаблицуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтрАдминистраторПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ОбновитьТаблицуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьЛидыПриИзменении(Элемент)
	
	Если ПоказыватьЛиды = Истина Тогда
		Элементы.ПоказыватьЛидыАдминистратор.ЦветТекстаЗаголовка = Новый Цвет();
		Элементы.ПоказыватьЛиды.ЦветТекстаЗаголовка = Новый Цвет();
		Элементы.ПоказыватьЛидыАдминистратор.ШрифтЗаголовка = Новый Шрифт(, 10);
		Элементы.ПоказыватьЛиды.ШрифтЗаголовка = Новый Шрифт(, 10);
	Иначе
		Элементы.ПоказыватьЛидыАдминистратор.ЦветТекстаЗаголовка = Новый Цвет(255, 0, 0);
		Элементы.ПоказыватьЛиды.ЦветТекстаЗаголовка = Новый Цвет(255, 0, 0);
		Элементы.ПоказыватьЛидыАдминистратор.ШрифтЗаголовка = Новый Шрифт(, 10, Истина);
		Элементы.ПоказыватьЛиды.ШрифтЗаголовка = Новый Шрифт(, 10, Истина);
	КонецЕсли;
	
	ОбновитьТаблицуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьОКПриИзменении(Элемент)
	
	Если ПоказыватьОК = Истина Тогда
		Элементы.ПоказыватьОКАдминистратор.ЦветТекстаЗаголовка = Новый Цвет();
		Элементы.ПоказыватьОК.ЦветТекстаЗаголовка = Новый Цвет();
		Элементы.ПоказыватьОКАдминистратор.ШрифтЗаголовка = Новый Шрифт(, 10);
		Элементы.ПоказыватьОК.ШрифтЗаголовка = Новый Шрифт(, 10);
	Иначе
		Элементы.ПоказыватьОКАдминистратор.ЦветТекстаЗаголовка = Новый Цвет(255, 0, 0);
		Элементы.ПоказыватьОК.ЦветТекстаЗаголовка = Новый Цвет(255, 0, 0);
		Элементы.ПоказыватьОКАдминистратор.ШрифтЗаголовка = Новый Шрифт(, 10, Истина);
		Элементы.ПоказыватьОК.ШрифтЗаголовка = Новый Шрифт(, 10, Истина);
	КонецЕсли;
	
	ОбновитьТаблицуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьПочтуПриИзменении(Элемент)
	
	Если ПоказыватьПочту = Истина Тогда
		Элементы.ПоказыватьПочтуАдминистратор.ЦветТекстаЗаголовка = Новый Цвет();
		Элементы.ПоказыватьПочту.ЦветТекстаЗаголовка = Новый Цвет();
		Элементы.ПоказыватьПочтуАдминистратор.ШрифтЗаголовка = Новый Шрифт(, 10);
		Элементы.ПоказыватьПочту.ШрифтЗаголовка = Новый Шрифт(, 10);
	Иначе
		Элементы.ПоказыватьПочтуАдминистратор.ЦветТекстаЗаголовка = Новый Цвет(255, 0, 0);
		Элементы.ПоказыватьПочту.ЦветТекстаЗаголовка = Новый Цвет(255, 0, 0);
		Элементы.ПоказыватьПочтуАдминистратор.ШрифтЗаголовка = Новый Шрифт(, 10, Истина);
		Элементы.ПоказыватьПочту.ШрифтЗаголовка = Новый Шрифт(, 10, Истина);
	КонецЕсли;
	
	ОбновитьТаблицуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьСертификатыКонтроляАдминистраторПриИзменении(Элемент)
	
	Если ПоказыватьСертификатыКонтроля = Истина Тогда
		Элементы.ПоказыватьСертификатыКонтроляАдминистратор.ЦветТекстаЗаголовка = Новый Цвет();
		Элементы.ПоказыватьСертификатыКонтроля.ЦветТекстаЗаголовка = Новый Цвет();
		Элементы.ПоказыватьСертификатыКонтроляАдминистратор.ШрифтЗаголовка = Новый Шрифт(, 10);
		Элементы.ПоказыватьСертификатыКонтроля.ШрифтЗаголовка = Новый Шрифт(, 10);
	Иначе
		Элементы.ПоказыватьСертификатыКонтроляАдминистратор.ЦветТекстаЗаголовка = Новый Цвет(255, 0, 0);
		Элементы.ПоказыватьСертификатыКонтроля.ЦветТекстаЗаголовка = Новый Цвет(255, 0, 0);
		Элементы.ПоказыватьСертификатыКонтроляАдминистратор.ШрифтЗаголовка = Новый Шрифт(, 10, Истина);
		Элементы.ПоказыватьСертификатыКонтроля.ШрифтЗаголовка = Новый Шрифт(, 10, Истина);
	КонецЕсли;
	
	ОбновитьТаблицуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьВсеНеобработанныеПриИзменении(Элемент)
	
	ОбновитьТаблицуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Элементы.ГруппаОбработкаСообщений.Видимость = Истина;
	
	ТекДанные = Элемент.ТекущиеДанные;
	ДобавитьСтраницу(ТекДанные);
	
КонецПроцедуры

// В качестве параметра возможны:
//		1. строка списка трафика,
//		2. ИД трафика (строка), если вызывается открытие конкретного трафика
&НаСервере
Процедура ДобавитьСтраницу(ТекДанные)
	
	Если ТипЗнч(ТекДанные) = Тип("Строка") Тогда
		Запись = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ТекДанные);
		
		ВходящиеПараметры = Новый Структура;
		ВходящиеПараметры.Вставить("Идентификатор", Запись.Идентификатор);
		ВходящиеПараметры.Вставить("ТипТрафика", Запись.ТипТрафика);
		ВходящиеПараметры.Вставить("Клиент", Запись.Клиент);
	Иначе
		ВходящиеПараметры = Новый Структура;
		ВходящиеПараметры.Вставить("Идентификатор", ТекДанные.Идентификатор);
		ВходящиеПараметры.Вставить("ТипТрафика", ТекДанные.ТипТрафика);
		ВходящиеПараметры.Вставить("Клиент", ТекДанные.Клиент);
	КонецЕсли;
	
	ИдентификаторТрафика = ВходящиеПараметры.Идентификатор;
	ИДТрафика = ИдентификаторТрафика;
	ТипТрафика = ВходящиеПараметры.ТипТрафика;
	
	ТабСоответствий = РеквизитФормыВЗначение("ТаблицаСоответствийТрафикаИСтраниц");
	СтрСоответствия = ТабСоответствий.Найти(ИдентификаторТрафика, "ИдентификаторТрафика");
	Если СтрСоответствия <> Неопределено Тогда
		Элементы.ГруппаИсполнители.ТекущаяСтраница = Элементы.ГруппаОбработкаСообщений;
		ИмяСтраницы = СтрСоответствия.ИмяСтраницы;
		Элементы.ГруппаСообщения.ТекущаяСтраница = Элементы[ИмяСтраницы];
		ОбновитьДанные(ИмяСтраницы);
		Возврат;
	КонецЕсли;
	
	НовыйАлгоритмФормированияСтраниц = Истина;
	
	Если НовыйАлгоритмФормированияСтраниц Тогда
		ЕстьЗаполнение = Ложь;
		
		Если ТипТрафика = Справочники.CRM_ТипТрафика.Email Тогда
			КлонироватьСтраницу("Шаблон1", СчетчикСообщений, ВходящиеПараметры);
			
			//Видимость+доступность кнопок раздела "Ответственный"
			РольПользователя = ПраваПользователя.ПраваИНастройки.КонтактЦентр_РольПользователя;
			Если РольПользователя = Перечисления.Renault_КонтактЦентр_РолиПользователей.Администратор Тогда
				Элементы["КнОтказаться" + СчетчикСообщений].Видимость = Ложь;
				Элементы["КнВзятьСебе" + СчетчикСообщений].Видимость = Ложь;
			ИначеЕсли РольПользователя = Перечисления.Renault_КонтактЦентр_РолиПользователей.Менеджер и не ЗначениеЗаполнено(Лид_Ответственный) Тогда
				Элементы["КнНазначить" + СчетчикСообщений].Видимость = Ложь;
				Элементы["КнОтказаться" + СчетчикСообщений].Видимость = Ложь;
				Элементы["Ответственный" + СчетчикСообщений].Видимость = Ложь;
				Элементы["ОтветитьEmail" + СчетчикСообщений].Доступность = Ложь;
				Элементы["ОтветитьТелефон" + СчетчикСообщений].Доступность = Ложь;
			Иначе
				Элементы["КнВзятьСебе" + СчетчикСообщений].Видимость = Ложь;
				Элементы["КнНазначить" + СчетчикСообщений].Видимость = Ложь;
			КонецЕсли;
			
			ЕстьЗаполнение = Истина;
		ИначеЕсли ТипТрафика = Справочники.CRM_ТипТрафика.ЛидRenault Тогда
			КлонироватьСтраницу("Шаблон2", СчетчикСообщений, ВходящиеПараметры);
			
			//Видимость кнопок
			ЕстьРЛ = ЕстьРЛПоТрафику();
			Элементы["КнОткрытьРЛ" + СчетчикСообщений].Видимость = ЕстьРЛ;
			Элементы["КнСоздатьРЛ" + СчетчикСообщений].Видимость = Не ЕстьРЛ;
			
			//Дополнительная команда
			ЭтаФорма.Команды.Добавить("СвернутьГруппу" + СчетчикСообщений).Действие = "СвернутьГруппу";
			Элементы["КнСвернутьГруппу" + СчетчикСообщений].ИмяКоманды = "СвернутьГруппу" + СчетчикСообщений;
			
			//Видимость+доступность кнопок раздела "Ответственный"
			РольПользователя = ПраваПользователя.ПраваИНастройки.КонтактЦентр_РольПользователя;
			Если РольПользователя = Перечисления.Renault_КонтактЦентр_РолиПользователей.Администратор Тогда
				Элементы["КнОтказаться" + СчетчикСообщений].Видимость = Ложь;
				Элементы["КнВзятьСебе" + СчетчикСообщений].Видимость = Ложь;
			ИначеЕсли РольПользователя = Перечисления.Renault_КонтактЦентр_РолиПользователей.Менеджер и не ЗначениеЗаполнено(Лид_Ответственный) Тогда
				Элементы["КнНазначить" + СчетчикСообщений].Видимость = Ложь;
				Элементы["КнОтказаться" + СчетчикСообщений].Видимость = Ложь;
				Элементы["Ответственный" + СчетчикСообщений].Видимость = Ложь;
				Элементы["ОтветитьEmail" + СчетчикСообщений].Доступность = Ложь;
				Элементы["ОтветитьТелефон" + СчетчикСообщений].Доступность = Ложь;
			Иначе
				Элементы["КнВзятьСебе" + СчетчикСообщений].Видимость = Ложь;
				Элементы["КнНазначить" + СчетчикСообщений].Видимость = Ложь;
			КонецЕсли;
			
			ЕстьЗаполнение = Истина;
			
		//ИначеЕсли ТипТрафика = Справочники.CRM_ТипТрафика.OnlineКонсультант Тогда
		КонецЕсли;
		
		Если ЕстьЗаполнение Тогда		
			НовСоответствие = ТабСоответствий.Добавить();
			НовСоответствие.ИдентификаторТрафика = ИдентификаторТрафика;
			НовСоответствие.ИмяСтраницы = "Сообщение" + СчетчикСообщений;
			
			ЗначениеВРеквизитФормы(ТабСоответствий, "ТаблицаСоответствийТрафикаИСтраниц");
			
			СчетчикСообщений = СчетчикСообщений + 1;
			
			Элементы.ГруппаИсполнители.ТекущаяСтраница = Элементы.ГруппаОбработкаСообщений;
			
			ТекСтр = Элементы.ГруппаСообщения.ТекущаяСтраница.Имя;
			ОбновитьДанные(ТекСтр);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	//ДанныеКлиента = ПолучитьДанныеКлиента(ВходящиеПараметры.Клиент);
	
	Если ТипТрафика = Справочники.CRM_ТипТрафика.Email Тогда
		НовСтраницаСообщение = Элементы.Добавить("Сообщение" + СчетчикСообщений, Тип("ГруппаФормы"), Элементы.ГруппаСообщения);
		НовСтраницаСообщение.Заголовок = ВходящиеПараметры.Клиент;
		НовСтраницаСообщение.Картинка = БиблиотекаКартинок.Renault_mail_lead;
		
		НовКнопка = Элементы.Добавить("КнопкаЗакрыть" + СчетчикСообщений, Тип("КнопкаФормы"), НовСтраницаСообщение);
		НовКнопка.ИмяКоманды = "ЗакрытьСтраницу";
		НовКнопка.Картинка = БиблиотекаКартинок.Renault_Close_32;
		НовКнопка.Отображение = ОтображениеКнопки.КартинкаИТекст;
		НовКнопка.Заголовок = "Закрыть";
		НовКнопка.ЦветФона = Новый Цвет(231, 231, 231);
		НовКнопка.ЦветТекста = Новый Цвет(49, 52, 49);
		
		НовЭлемент = Элементы.Добавить("КнЗакрытьТрафик" + СчетчикСообщений, Тип("КнопкаФормы"), НовСтраницаСообщение);
		НовЭлемент.ИмяКоманды = "ЗакрытьТрафик";
		НовЭлемент.Заголовок = "Закрыть трафик";
		НовЭлемент.ЦветФона = Новый Цвет(231, 231, 231);
		НовЭлемент.ЦветТекста = Новый Цвет(49, 52, 49);
		//отсюда сворачиваем
		Группа = ВернутьСворачиваемуюГруппу(НовСтраницаСообщение);		

		//Данные клиента
		//НовГруппаПараметры = Элементы.Добавить("ГруппаПараметры" + СчетчикСообщений, Тип("ГруппаФормы"), НовСтраницаСообщение);
		НовГруппаПараметры = Элементы.Добавить("ГруппаПараметры" + СчетчикСообщений, Тип("ГруппаФормы"), Группа);
		НовГруппаПараметры.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НовГруппаКлиент = Элементы.Добавить("ГруппаКлиент" + СчетчикСообщений, Тип("ГруппаФормы"), НовГруппаПараметры);
		НовГруппаКлиент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НовЭлемент = Элементы.Добавить("ПолеФИО" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаКлиент);
		НовЭлемент.ПутьКДанным = "Клиент_ФИО";
		НовЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		
		НовЭлемент = Элементы.Добавить("ПолеПол" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаКлиент);
		НовЭлемент.ПутьКДанным = "Клиент_Пол";
		НовЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		
		НовЭлемент = Элементы.Добавить("ПолеТелефон" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаКлиент);
		НовЭлемент.ПутьКДанным = "Клиент_Телефон";
		НовЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		
		НовЭлемент = Элементы.Добавить("ПолеEmail" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаКлиент);
		НовЭлемент.ПутьКДанным = "Клиент_Email";
		НовЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		
		НовГруппаОсновная = Элементы.Добавить("ГруппаОсновная" + СчетчикСообщений, Тип("ГруппаФормы"), НовСтраницаСообщение);
		НовГруппаОсновная.Вид = ВидГруппыФормы.Страницы;
		
		НовГруппаСообщение = Элементы.Добавить("ГруппаСообщение" + СчетчикСообщений, Тип("ГруппаФормы"), НовГруппаОсновная);
		НовГруппаСообщение.Вид = ВидГруппыФормы.Страница;
		НовГруппаСообщение.Заголовок = "Переписка с клиентом";
		
		НовЭлемент = Элементы.Добавить("ОтветитьEmail" + СчетчикСообщений, Тип("КнопкаФормы"), НовГруппаСообщение);
		НовЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		НовЭлемент.Заголовок = "Ответить по e-mail";
		НовЭлемент.ИмяКоманды = "ОтветитьEmail";
		
		НовЭлемент = Элементы.Добавить("ИсторияПереписки" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаСообщение);
		НовЭлемент.Вид = ВидПоляФормы.ПолеТабличногоДокумента;
		НовЭлемент.ПутьКДанным = "ИсторияПереписки";
		
		НовГруппаИстория = Элементы.Добавить("ГруппаИстория" + СчетчикСообщений, Тип("ГруппаФормы"), НовГруппаОсновная);
		НовГруппаИстория.Вид = ВидГруппыФормы.Страница;
		НовГруппаИстория.Заголовок = "Продуктовая история";
		НовЭлемент = Элементы.Добавить("ПродИстория" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаИстория);
		НовЭлемент.Вид = ВидПоляФормы.ПолеТабличногоДокумента;
		НовЭлемент.ПутьКДанным = "ПродИстория";
		
		
		Элементы.ГруппаИсполнители.ТекущаяСтраница = Элементы.ГруппаОбработкаСообщений;
		Элементы.ГруппаСообщения.ТекущаяСтраница = НовСтраницаСообщение;
		
	ИначеЕсли ТипТрафика = Справочники.CRM_ТипТрафика.ЛидRenault Тогда
		
		ЖирныйШрифт = Новый Шрифт( , , Истина);
		
		НовСтраницаСообщение = Элементы.Добавить("Сообщение" + СчетчикСообщений, Тип("ГруппаФормы"), Элементы.ГруппаСообщения);
		НовСтраницаСообщение.Заголовок = ВходящиеПараметры.Клиент;
		//НовСтраницаСообщение.Картинка = Вычислить(Renault_ОбщиеФункцииСервер.МультибрендПараметрыОформления().Логотип_mini_5);
		
		//Лид = Документы.Renault_Лид.НайтиПоРеквизиту("ТрафикИД", ИДТрафика);
		//ДатаЗагрузкиЛида = Лид.ДатаЗаогрузки;
		//КритическаяДата = Лид.КритическаяДата;
		//ПримечаниеVIN = Лид.VIN;
		//ПримечаниеМодель = Лид.Модель;
		//ПримечаниеДвигатель = Лид.Мотор;
		//ПримечаниеПробег = Лид.Пробег;
		//Лид_Приоритет = Лид.Приоритет;
		//КатегорияЛида = Лид.Теги;
		//ИсточникЛида = Лид.Канал;
		//Лид_ВидТип = Лид.ВидУслуги.Тип;
		//Лид_ВидКлассификация = Лид.ВидУслуги.Классификация;
		//Лид_ПродПримечание = Лид.ПовторныхЛидов;
		//Лид_ПримечаниеДилера = Лид.ПримечаниеДилера;
		//Лид_Ответственный = Лид.Менеджер;
		
		НовКнопка = Элементы.Добавить("КнопкаЗакрыть" + СчетчикСообщений, Тип("КнопкаФормы"), НовСтраницаСообщение);
		НовКнопка.ИмяКоманды = "ЗакрытьСтраницу";
		НовКнопка.Картинка = БиблиотекаКартинок.Renault_Close_32;
		НовКнопка.Отображение = ОтображениеКнопки.КартинкаИТекст;
		НовКнопка.Заголовок = "Закрыть";
		НовКнопка.ЦветФона = Новый Цвет(231, 231, 231);
		НовКнопка.ЦветТекста = Новый Цвет(49, 52, 49);
		
		//отсюда надо закрыть	
		Группа = ВернутьСворачиваемуюГруппу(НовСтраницаСообщение);		
		//Группа параметры
		//НовГруппаПараметры = Элементы.Добавить("ГруппаПараметры" + СчетчикСообщений, Тип("ГруппаФормы"), НовСтраницаСообщение);
		НовГруппаПараметры = Элементы.Добавить("ГруппаПараметры" + СчетчикСообщений, Тип("ГруппаФормы"), Группа);
		НовГруппаПараметры.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НовГруппаПараметры.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		НовГруппаПараметры.Отображение = ОтображениеОбычнойГруппы.Нет;
		НовГруппаПараметры.ОтображатьЗаголовок = Ложь;
		НовГруппаПараметры.ШиринаПодчиненныхЭлементов = ШиринаПодчиненныхЭлементовФормы.Одинаковая;
		
		//Лево
		НовГруппаВажное = Элементы.Добавить("ГруппаВажное" + СчетчикСообщений, Тип("ГруппаФормы"), НовГруппаПараметры);
		НовГруппаВажное.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НовГруппаВажное.Отображение = ОтображениеОбычнойГруппы.Нет;
		НовГруппаВажное.ОтображатьЗаголовок = Ложь;
		
		НовЭлемент = Элементы.Добавить("ДатаЗагрузки" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаВажное);
		НовЭлемент.ПутьКДанным = "ДатаЗагрузкиЛида";
		НовЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовЭлемент.Формат = "ДФ='dd.MMMM.yyyy HH:mm""ч.'";
		НовЭлемент.Заголовок = "Получен";
		НовЭлемент.Ширина = 20;
		НовЭлемент.ШрифтЗаголовка = ЖирныйШрифт;
		
		НовЭлемент = Элементы.Добавить("КритическаяДата" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаВажное);
		НовЭлемент.ПутьКДанным = "КритическаяДата";
		НовЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовЭлемент.Формат = "ДФ='dd.MMMM.yyyy HH:mm""ч.'";
		НовЭлемент.Заголовок = "Ответить до";
		НовЭлемент.Ширина = 20;
		НовЭлемент.ШрифтЗаголовка = ЖирныйШрифт;
		НовЭлемент.ЦветТекста = Новый Цвет(255, 0, 0);
		НовЭлемент.Шрифт = Новый Шрифт(, , , , Истина);
		
		НовЭлемент = Элементы.Добавить("Приоритет" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаВажное);
		НовЭлемент.ПутьКДанным = "Лид_Приоритет";
		НовЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовЭлемент.Заголовок = "Вероятность продажи";
		НовЭлемент.ШрифтЗаголовка = ЖирныйШрифт;
		
		НовЭлемент = Элементы.Добавить("КатегорияЛида" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаВажное);
		НовЭлемент.ПутьКДанным = "КатегорияЛида";
		НовЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовЭлемент.Заголовок = "Категория";
		НовЭлемент.ШрифтЗаголовка = ЖирныйШрифт;
		
		НовЭлемент = Элементы.Добавить("ИсточникЛида" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаВажное);
		НовЭлемент.ПутьКДанным = "ИсточникЛида";
		НовЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовЭлемент.Заголовок = "Источник лида";
		НовЭлемент.ШрифтЗаголовка = ЖирныйШрифт;
		
		НовГруппаТипВид = Элементы.Добавить("ГруппаТипВид" + СчетчикСообщений, Тип("ГруппаФормы"), НовГруппаВажное);
		НовГруппаТипВид.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НовГруппаТипВид.Отображение = ОтображениеОбычнойГруппы.Нет;
		НовГруппаТипВид.ОтображатьЗаголовок = Ложь;
		НовГруппаТипВид.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		
		НовЭлемент = Элементы.Добавить("ВидТип" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаТипВид);
		НовЭлемент.ПутьКДанным = "Лид_ВидТип";
		НовЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
		НовЭлемент.Заголовок = "Тип";
		НовЭлемент.ШрифтЗаголовка = ЖирныйШрифт;
		
		НовЭлемент = Элементы.Добавить("ЛидВидДекорация" + СчетчикСообщений, Тип("ДекорацияФормы"), НовГруппаТипВид);
		НовЭлемент.Заголовок = "/";
		НовЭлемент.Вид = ВидДекорацииФормы.Надпись;
		
		НовЭлемент = Элементы.Добавить("ВидКлассификация" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаТипВид);
		НовЭлемент.ПутьКДанным = "Лид_ВидКлассификация";
		НовЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		
		НовГруппаОтветственный = Элементы.Добавить("ГруппаОтветственный" + СчетчикСообщений, Тип("ГруппаФормы"), НовГруппаВажное);
		НовГруппаОтветственный.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НовГруппаОтветственный.Отображение = ОтображениеОбычнойГруппы.Нет;
		НовГруппаОтветственный.ОтображатьЗаголовок = Ложь;
		НовГруппаОтветственный.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		НовГруппаОтветственный.РастягиватьПоГоризонтали = Истина;
		
		НовЭлемент = Элементы.Добавить("Ответственный" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаОтветственный);
		НовЭлемент.ПутьКДанным = "Лид_Ответственный";
		НовЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовЭлемент.Заголовок = "Ответственный";
		НовЭлемент.ШрифтЗаголовка = ЖирныйШрифт;
		НовЭлемент.Ширина = 30;
		
		НовЭлемент = Элементы.Добавить("КнОтказаться" + СчетчикСообщений, Тип("КнопкаФормы"), НовГруппаОтветственный);
		НовЭлемент.ИмяКоманды = "Отказаться";
		НовЭлемент.Заголовок = "Отказаться";
		НовЭлемент.ЦветФона = Новый Цвет(231, 231, 231);
		НовЭлемент.ЦветТекста = Новый Цвет(49, 52, 49);
		
		НовЭлемент = Элементы.Добавить("КнНазначить" + СчетчикСообщений, Тип("КнопкаФормы"), НовГруппаОтветственный);
		НовЭлемент.ИмяКоманды = "НазначитьОтветственногоИзЛида";
		НовЭлемент.Заголовок = "Назначить";
		НовЭлемент.ЦветФона = Новый Цвет(231, 231, 231);
		НовЭлемент.ЦветТекста = Новый Цвет(49, 52, 49);
		
		НовЭлемент = Элементы.Добавить("КнВзятьСебе" + СчетчикСообщений, Тип("КнопкаФормы"), НовГруппаОтветственный);
		НовЭлемент.ИмяКоманды = "ВзятьСебе";
		НовЭлемент.Заголовок = "Взять себе";
		НовЭлемент.ЦветФона = Новый Цвет(231, 231, 231);
		НовЭлемент.ЦветТекста = Новый Цвет(49, 52, 49);
		
		НовЭлемент = Элементы.Добавить("ДилерскийЦентр" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаВажное);
		НовЭлемент.ПутьКДанным = "ДилерскийЦентр";
		НовЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовЭлемент.Заголовок = "Дилерский центр";
		НовЭлемент.ШрифтЗаголовка = ЖирныйШрифт;
		
		НовГруппаКнопки = Элементы.Добавить("ГруппаКнопки" + СчетчикСообщений, Тип("ГруппаФормы"), НовГруппаВажное);
		НовГруппаКнопки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НовГруппаКнопки.Отображение = ОтображениеОбычнойГруппы.Нет;
		НовГруппаКнопки.ОтображатьЗаголовок = Ложь;
		НовГруппаКнопки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		
		Если НЕ ЕстьРЛПоТрафику() Тогда
			НовЭлемент = Элементы.Добавить("КнСоздатьРЛ" + СчетчикСообщений, Тип("КнопкаФормы"), НовГруппаКнопки);
			НовЭлемент.ИмяКоманды = "СоздатьРЛ";
			НовЭлемент.Заголовок = "Создать РЛ";
			НовЭлемент.ЦветФона = Новый Цвет(231, 231, 231);
			НовЭлемент.ЦветТекста = Новый Цвет(49, 52, 49);
		Иначе
			НовЭлемент = Элементы.Добавить("КнОткрытьРЛ" + СчетчикСообщений, Тип("КнопкаФормы"), НовГруппаКнопки);
			НовЭлемент.ИмяКоманды = "ОткрытьРЛ";
			НовЭлемент.Заголовок = "Открыть РЛ";
			НовЭлемент.ЦветФона = Новый Цвет(231, 231, 231);
			НовЭлемент.ЦветТекста = Новый Цвет(49, 52, 49);
		КонецЕсли;
		
		НовЭлемент = Элементы.Добавить("КнЗакрытьЛид" + СчетчикСообщений, Тип("КнопкаФормы"), НовГруппаКнопки);
		НовЭлемент.ИмяКоманды = "ЗакрытьЛид";
		НовЭлемент.Заголовок = "Закрыть лид";
		НовЭлемент.ЦветФона = Новый Цвет(231, 231, 231);
		НовЭлемент.ЦветТекста = Новый Цвет(49, 52, 49);
		
		НовЭлемент = Элементы.Добавить("КнСохранитьИзменения" + СчетчикСообщений, Тип("КнопкаФормы"), НовГруппаКнопки);
		НовЭлемент.ИмяКоманды = "СохранитьИзменения";
		НовЭлемент.Заголовок = "Сохранить изменения";
		НовЭлемент.ЦветФона = Новый Цвет(231, 231, 231);
		НовЭлемент.ЦветТекста = Новый Цвет(49, 52, 49);
		
		КомандаКнопка = ЭтаФорма.Команды.Добавить("СвернутьГруппу"+СчетчикСообщений);
		КомандаКнопка.Действие = "СвернутьГруппу";
		КомандаКнопка.Заголовок = "Свернуть группу "+СчетчикСообщений;
		
		НовЭлемент = Элементы.Добавить("КнСвернутьГруппу" + СчетчикСообщений, Тип("КнопкаФормы"), НовГруппаКнопки);
		НовЭлемент.ИмяКоманды = "СвернутьГруппу"+СчетчикСообщений;
		НовЭлемент.Заголовок = "Свернуть данные клиента";
		НовЭлемент.ЦветФона = Новый Цвет(231, 231, 231);
		НовЭлемент.ЦветТекста = Новый Цвет(49, 52, 49);
		//все что до этого надо свернуть
		
		//Центр
		НовГруппаКлиент = Элементы.Добавить("ГруппаКлиент" + СчетчикСообщений, Тип("ГруппаФормы"), НовГруппаПараметры);
		НовГруппаКлиент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НовГруппаКлиент.Заголовок = "Клиент";
		НовГруппаКлиент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		
		НовГруппаКлиентЛево = Элементы.Добавить("ГруппаКлиентЛево" + СчетчикСообщений, Тип("ГруппаФормы"), НовГруппаКлиент);
		НовГруппаКлиентЛево.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НовГруппаКлиентЛево.Отображение = ОтображениеОбычнойГруппы.Нет;
		НовГруппаКлиентЛево.ОтображатьЗаголовок = Ложь;
		
		НовГруппаКлиентПраво = Элементы.Добавить("ГруппаКлиентПраво" + СчетчикСообщений, Тип("ГруппаФормы"), НовГруппаКлиент);
		НовГруппаКлиентПраво.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НовГруппаКлиентПраво.Отображение = ОтображениеОбычнойГруппы.Нет;
		НовГруппаКлиентПраво.ОтображатьЗаголовок = Ложь;
		
		НовЭлемент = Элементы.Добавить("ПолеФИО" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаКлиентЛево);
		НовЭлемент.ПутьКДанным = "Клиент_ФИО";
		НовЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовЭлемент.Заголовок = "ФИО";
		НовЭлемент.ШрифтЗаголовка = ЖирныйШрифт;
		
		НовЭлемент = Элементы.Добавить("ПолеПол" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаКлиентЛево);
		НовЭлемент.ПутьКДанным = "Клиент_Пол";
		НовЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовЭлемент.Заголовок = "Пол";
		НовЭлемент.ШрифтЗаголовка = ЖирныйШрифт;
		
		НовЭлемент = Элементы.Добавить("ПолеКлиентДР" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаКлиентЛево);
		НовЭлемент.ПутьКДанным = "Клиент_ДР";
		НовЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовЭлемент.Заголовок = "ДР";
		НовЭлемент.ШрифтЗаголовка = ЖирныйШрифт;
		
		НовЭлемент = Элементы.Добавить("ПолеТелефон" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаКлиентЛево);
		НовЭлемент.ПутьКДанным = "Клиент_Телефон";
		НовЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовЭлемент.Заголовок = "Тел";
		НовЭлемент.ШрифтЗаголовка = ЖирныйШрифт;
		
		НовЭлемент = Элементы.Добавить("ПолеEmail" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаКлиентЛево);
		НовЭлемент.ПутьКДанным = "Клиент_Email";
		НовЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовЭлемент.Заголовок = "e-mail";
		НовЭлемент.ШрифтЗаголовка = ЖирныйШрифт;
		
		НовЭлемент = Элементы.Добавить("КнопкаВЧерныйСписок" + СчетчикСообщений, Тип("КнопкаФормы"), НовГруппаКлиентЛево);
		НовЭлемент.ИмяКоманды = "ВЧерныйСписок";
		НовЭлемент.Заголовок = "В черный список";
		НовЭлемент.Отображение = ОтображениеКнопки.КартинкаИТекст;
		НовЭлемент.Картинка = БиблиотекаКартинок.Остановить;
		НовЭлемент.ЦветФона = Новый Цвет(231, 231, 231);
		НовЭлемент.ЦветТекста = Новый Цвет(49, 52, 49);
		
		НовЭлемент = Элементы.Добавить("ПолеMyRenault" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаКлиентПраво);
		НовЭлемент.ПутьКДанным = "Клиент_MyRenault";
		НовЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовЭлемент.Заголовок = "MyRenault";
		НовЭлемент.ШрифтЗаголовка = ЖирныйШрифт;
		
		НовЭлемент = Элементы.Добавить("ПолеЛид_ПродПримечание" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаКлиентПраво);
		НовЭлемент.ПутьКДанным = "Лид_ПродПримечание";
		НовЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовЭлемент.Заголовок = "Обращений клиента за 3 месяца";
		НовЭлемент.ШрифтЗаголовка = ЖирныйШрифт;	
		
		//Право
		НовГруппаПримечания = Элементы.Добавить("ГруппаПримечания" + СчетчикСообщений, Тип("ГруппаФормы"), НовГруппаПараметры);
		НовГруппаПримечания.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НовГруппаПримечания.Заголовок = "Статус обработки";
		
		НовЭлемент = Элементы.Добавить("ПолеПримечаниеДилера" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаПримечания);
		НовЭлемент.ПутьКДанным = "Лид_ПримечаниеДилера";
		НовЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовЭлемент.ПодсказкаВвода = "Примечание к лиду";
		НовЭлемент.МногострочныйРежим = Истина;
		НовЭлемент.Высота = 3;
		НовЭлемент.РастягиватьПоВертикали = Ложь;
		
		НовГруппаАвтомобиль = Элементы.Добавить("ГруппаАвтомобиль" + СчетчикСообщений, Тип("ГруппаФормы"), НовГруппаПримечания);
		НовГруппаАвтомобиль.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НовГруппаАвтомобиль.Заголовок = "Автомобиль";
		
		НовЭлемент = Элементы.Добавить("ПолеПримечаниеVIN" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаАвтомобиль);
		НовЭлемент.ПутьКДанным = "ПримечаниеVIN";
		НовЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовЭлемент.Заголовок = "VIN";
		НовЭлемент.ШрифтЗаголовка = ЖирныйШрифт;
		
		НовЭлемент = Элементы.Добавить("ПолеПримечаниеМодель" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаАвтомобиль);
		НовЭлемент.ПутьКДанным = "ПримечаниеМодель";
		НовЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовЭлемент.Заголовок = "Модель";
		НовЭлемент.ШрифтЗаголовка = ЖирныйШрифт;
		
		НовЭлемент = Элементы.Добавить("ПолеПримечаниеДвигатель" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаАвтомобиль);
		НовЭлемент.ПутьКДанным = "ПримечаниеДвигатель";
		НовЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовЭлемент.Заголовок = "Двигатель";
		НовЭлемент.ШрифтЗаголовка = ЖирныйШрифт;
		
		НовЭлемент = Элементы.Добавить("ПолеПримечаниеПробег" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаАвтомобиль);
		НовЭлемент.ПутьКДанным = "ПримечаниеПробег";
		НовЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовЭлемент.Заголовок = "Пробег";
		НовЭлемент.ШрифтЗаголовка = ЖирныйШрифт;
		
		//Низ
		
		НовГруппаОсновная = Элементы.Добавить("ГруппаОсновная" + СчетчикСообщений, Тип("ГруппаФормы"), НовСтраницаСообщение);
		НовГруппаОсновная.Вид = ВидГруппыФормы.Страницы;
		
		НовГруппаСообщение = Элементы.Добавить("ГруппаСообщение" + СчетчикСообщений, Тип("ГруппаФормы"), НовГруппаОсновная);
		НовГруппаСообщение.Вид = ВидГруппыФормы.Страница;
		НовГруппаСообщение.Заголовок = "Переписка с клиентом";
		
		НовГруппаКоманды = Элементы.Добавить("ГруппаКоманды" + СчетчикСообщений, Тип("ГруппаФормы"), НовГруппаСообщение);
		НовГруппаКоманды.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НовГруппаКоманды.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		НовГруппаКоманды.Отображение = ОтображениеОбычнойГруппы.Нет;
		НовГруппаПараметры.ОтображатьЗаголовок = Ложь;
		
		НовЭлемент = Элементы.Добавить("ОтветитьEmail" + СчетчикСообщений, Тип("КнопкаФормы"), НовГруппаКоманды);
		НовЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		НовЭлемент.Заголовок = "Ответить по e-mail";
		НовЭлемент.Отображение = ОтображениеКнопки.КартинкаИТекст;
		НовЭлемент.Картинка = БиблиотекаКартинок.ОтправитьПочту;
		НовЭлемент.ИмяКоманды = "ОтветитьEmail";
		НовЭлемент.ЦветФона = Новый Цвет(231, 231, 231);
		НовЭлемент.ЦветТекста = Новый Цвет(49, 52, 49);
		
		НовЭлемент = Элементы.Добавить("ОтветитьТелефон" + СчетчикСообщений, Тип("КнопкаФормы"), НовГруппаКоманды);
		НовЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		НовЭлемент.Заголовок = "Ответить по телефону";
		НовЭлемент.Отображение = ОтображениеКнопки.КартинкаИТекст;
		НовЭлемент.Картинка = БиблиотекаКартинок.ТелефонныйЗвонок;
		НовЭлемент.ИмяКоманды = "ОтветитьПоТелефону";
		НовЭлемент.ЦветФона = Новый Цвет(231, 231, 231);
		НовЭлемент.ЦветТекста = Новый Цвет(49, 52, 49);
		
		НовЭлемент = Элементы.Добавить("ИсторияПереписки" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаСообщение);
		НовЭлемент.Вид = ВидПоляФормы.ПолеТабличногоДокумента;
		НовЭлемент.ПутьКДанным = "ИсторияПереписки";
		
		НовГруппаИстория = Элементы.Добавить("ГруппаИстория" + СчетчикСообщений, Тип("ГруппаФормы"), НовГруппаОсновная);
		НовГруппаИстория.Вид = ВидГруппыФормы.Страница;
		НовГруппаИстория.Заголовок = "Продуктовая история";
		
		НовЭлемент = Элементы.Добавить("ПродИстория" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаИстория);
		НовЭлемент.Вид = ВидПоляФормы.ПолеТабличногоДокумента;
		НовЭлемент.ПутьКДанным = "ПродИстория";
		
		
		Элементы.ГруппаИсполнители.ТекущаяСтраница = Элементы.ГруппаОбработкаСообщений;
		Элементы.ГруппаСообщения.ТекущаяСтраница = НовСтраницаСообщение;
		
		РольПользователя = ПраваПользователя.ПраваИНастройки.КонтактЦентр_РольПользователя;
		Если РольПользователя = Перечисления.Renault_КонтактЦентр_РолиПользователей.Администратор Тогда
			Элементы["КнОтказаться" + СчетчикСообщений].Видимость = Ложь;
			Элементы["КнВзятьСебе" + СчетчикСообщений].Видимость = Ложь;
		ИначеЕсли РольПользователя = Перечисления.Renault_КонтактЦентр_РолиПользователей.Менеджер и не ЗначениеЗаполнено(Лид_Ответственный) Тогда
			Элементы["КнНазначить" + СчетчикСообщений].Видимость = Ложь;
			Элементы["КнОтказаться" + СчетчикСообщений].Видимость = Ложь;
			//Элементы.НазначитьСвой.Видимость = Ложь;
			Элементы["Ответственный" + СчетчикСообщений].Видимость = Ложь;
			Элементы["ОтветитьEmail" + СчетчикСообщений].Доступность = Ложь;
			Элементы["ОтветитьТелефон" + СчетчикСообщений].Доступность = Ложь;
		Иначе
			Элементы["КнВзятьСебе" + СчетчикСообщений].Видимость = Ложь;
			Элементы["КнНазначить" + СчетчикСообщений].Видимость = Ложь;
			//Элементы.НазначитьСвой.Видимость = Ложь;
		КонецЕсли;
		
	ИначеЕсли ТипТрафика = Справочники.CRM_ТипТрафика.OnlineКонсультант Тогда
		
		НовСтраницаСообщение = Элементы.Добавить("Сообщение" + СчетчикСообщений, Тип("ГруппаФормы"), Элементы.ГруппаСообщения);
		НовСтраницаСообщение.Заголовок = ВходящиеПараметры.Клиент;
		НовСтраницаСообщение.Картинка = БиблиотекаКартинок.Renault_chat_lead;
		
		НовКнопка = Элементы.Добавить("КнопкаЗакрыть" + СчетчикСообщений, Тип("КнопкаФормы"), НовСтраницаСообщение);
		НовКнопка.ИмяКоманды = "ЗакрытьСтраницу";
		НовКнопка.Картинка = БиблиотекаКартинок.Renault_Close_32;
		НовКнопка.Отображение = ОтображениеКнопки.КартинкаИТекст;
		НовКнопка.Заголовок = "Закрыть";
		НовКнопка.ЦветФона = Новый Цвет(231, 231, 231);
		НовКнопка.ЦветТекста = Новый Цвет(49, 52, 49);
		
		//Отсюда сворачиваем
		Группа = ВернутьСворачиваемуюГруппу(НовСтраницаСообщение);
		//Данные клиента
		//НовГруппаПараметры = Элементы.Добавить("ГруппаПараметры" + СчетчикСообщений, Тип("ГруппаФормы"), НовСтраницаСообщение);
		НовГруппаПараметры = Элементы.Добавить("ГруппаПараметры" + СчетчикСообщений, Тип("ГруппаФормы"), Группа);
		НовГруппаПараметры.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НовГруппаКлиент = Элементы.Добавить("ГруппаКлиент" + СчетчикСообщений, Тип("ГруппаФормы"), НовГруппаПараметры);
		НовГруппаКлиент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НовЭлемент = Элементы.Добавить("ПолеФИО" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаКлиент);
		НовЭлемент.ПутьКДанным = "Клиент_ФИО";
		НовЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		
		НовЭлемент = Элементы.Добавить("ПолеПол" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаКлиент);
		НовЭлемент.ПутьКДанным = "Клиент_Пол";
		НовЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		
		НовЭлемент = Элементы.Добавить("ПолеТелефон" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаКлиент);
		НовЭлемент.ПутьКДанным = "Клиент_Телефон";
		НовЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		
		НовЭлемент = Элементы.Добавить("ПолеEmail" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаКлиент);
		НовЭлемент.ПутьКДанным = "Клиент_Email";
		НовЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		
		НовГруппаОсновная = Элементы.Добавить("ГруппаОсновная" + СчетчикСообщений, Тип("ГруппаФормы"), НовСтраницаСообщение);
		НовГруппаОсновная.Вид = ВидГруппыФормы.Страницы;
		
		НовГруппаСообщение = Элементы.Добавить("ГруппаСообщение" + СчетчикСообщений, Тип("ГруппаФормы"), НовГруппаОсновная);
		НовГруппаСообщение.Вид = ВидГруппыФормы.Страница;
		НовГруппаСообщение.Заголовок = "Переписка с клиентом";
		
		//НовЭлемент = Элементы.Добавить("ОтветитьEmail" + СчетчикСообщений, Тип("КнопкаФормы"), НовГруппаСообщение);
		//НовЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		//НовЭлемент.Заголовок = "Ответить по e-mail";
		//НовЭлемент.ИмяКоманды = "ОтветитьEmail";
		
		НовЭлемент = Элементы.Добавить("ИсторияПереписки" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаСообщение);
		НовЭлемент.Вид = ВидПоляФормы.ПолеТабличногоДокумента;
		НовЭлемент.ПутьКДанным = "ИсторияПереписки";
		
		НовЭлемент = Элементы.Добавить("ПолеВводаСообщения" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаСообщение);
		НовЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовЭлемент.УстановитьДействие("ОкончаниеВводаТекста", "ПолеВводаСообщенияОкончаниеВвода");
		
		НовГруппаИстория = Элементы.Добавить("ГруппаИстория" + СчетчикСообщений, Тип("ГруппаФормы"), НовГруппаОсновная);
		НовГруппаИстория.Вид = ВидГруппыФормы.Страница;
		НовГруппаИстория.Заголовок = "Продуктовая история";
		НовЭлемент = Элементы.Добавить("ПродИстория" + СчетчикСообщений, Тип("ПолеФормы"), НовГруппаИстория);
		НовЭлемент.Вид = ВидПоляФормы.ПолеТабличногоДокумента;
		НовЭлемент.ПутьКДанным = "ПродИстория";
		
		
		Элементы.ГруппаИсполнители.ТекущаяСтраница = Элементы.ГруппаОбработкаСообщений;
		Элементы.ГруппаСообщения.ТекущаяСтраница = НовСтраницаСообщение;
		
	КонецЕсли;
	
	//ТабСоответствий = РеквизитФормыВЗначение("ТаблицаСоответствийТрафикаИСтраниц");
	
	// Создадим таблицу "Рабочие листы"	
	НовГруппаРабочиеЛисты = Элементы.Добавить("ГруппаРабочиеЛисты" + СчетчикСообщений, Тип("ГруппаФормы"), НовГруппаОсновная);
	НовГруппаРабочиеЛисты.Вид = ВидГруппыФормы.Страница;
	НовГруппаРабочиеЛисты.Заголовок = "Рабочие листы";
	
	ТаблицаРЛ = Элементы.Добавить("ТЗН" + СчетчикСообщений, Тип("ТаблицаФормы"), НовГруппаРабочиеЛисты);
	ТаблицаРЛ.ПутьКДанным = "ТаблицаРабочиеЛисты";
	ТаблицаРЛ.Отображение = ОтображениеТаблицы.Список;
	ТаблицаРЛ.ТолькоПросмотр = Истина;
	ТаблицаРЛ.КоманднаяПанель.Видимость = Ложь;
	
	ТЗ = ТаблицаРабочиеЛисты.Выгрузить();
	
	Для Каждого Колонка Из ТЗ.Колонки Цикл        
		
		НовыйЭлемент = Элементы.Добавить("ТЗН" + СчетчикСообщений + "_" + Колонка.Имя, Тип("ПолеФормы"), ТаблицаРЛ);       
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "ТаблицаРабочиеЛисты." + Колонка.Имя;
		
		Если Найти(Колонка.Имя, "ID") Тогда
			НовыйЭлемент.Видимость = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаРЛ.УстановитьДействие("Выбор","ТаблицаРабочиеЛистыВыбор");
	
	// Создадим таблицу "Лиды и рабочие листы с тем же E-Mail"	
	НовГруппаРабочиеЛисты = Элементы.Добавить("ГруппаЛиды" + СчетчикСообщений, Тип("ГруппаФормы"), НовГруппаОсновная);
	НовГруппаРабочиеЛисты.Вид = ВидГруппыФормы.Страница;
	НовГруппаРабочиеЛисты.Заголовок = "Лиды и рабочие листы с тем же клиентом, телефоном, E-Mail";
	
	ТаблицаРЛ = Элементы.Добавить("ТЗЛ" + СчетчикСообщений, Тип("ТаблицаФормы"), НовГруппаРабочиеЛисты);
	ТаблицаРЛ.ПутьКДанным = "ТаблицаЛиды";
	ТаблицаРЛ.Отображение = ОтображениеТаблицы.Список;
	ТаблицаРЛ.ТолькоПросмотр = Истина;
	ТаблицаРЛ.КоманднаяПанель.Видимость = Ложь;
	
	ТЗ = ТаблицаЛиды.Выгрузить();
	
	Для Каждого Колонка Из ТЗ.Колонки Цикл        
		
		НовыйЭлемент = Элементы.Добавить("ТЗЛ" + СчетчикСообщений + "_" + Колонка.Имя, Тип("ПолеФормы"), ТаблицаРЛ);       
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "ТаблицаЛиды." + Колонка.Имя;
		
		Если Найти(Колонка.Имя, "ID") Тогда
			НовыйЭлемент.Видимость = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаРЛ.УстановитьДействие("Выбор","ТаблицаЛидыВыбор");
	
	НовСоответствие = ТабСоответствий.Добавить();
	НовСоответствие.ИдентификаторТрафика = ИдентификаторТрафика;
	НовСоответствие.ИмяСтраницы = "Сообщение" + СчетчикСообщений;
	
	ЗначениеВРеквизитФормы(ТабСоответствий, "ТаблицаСоответствийТрафикаИСтраниц");
	
	СчетчикСообщений = СчетчикСообщений + 1;
	
	ТекСтр = Элементы.ГруппаСообщения.ТекущаяСтраница.Имя;
	ОбновитьДанные(ТекСтр);	
КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаСообщенияОкончаниеВвода()
	
	
	
КонецПроцедуры

&НаСервере
Процедура ИсторияПерепискиЗаполнить()
	
	ИсторияПереписки.Очистить();
	Макет = Обработки.Renault_АРМ_ContactCenter.ПолучитьМакет("МакетИсторияПереписки");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсторияПерепискиСКлиентом.Сообщение,
	|	ИсторияПерепискиСКлиентом.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ИсторияПерепискиСКлиентом.ЭтоОтветДилера
	|			ТОГДА ""Исполнитель""
	|		ИНАЧЕ ""Клиент""
	|	КОНЕЦ КАК Отправитель,
	|	ВЫБОР
	|		КОГДА ИсторияПерепискиСКлиентом.ЭтоОтветДилера
	|			ТОГДА ИсторияПерепискиСКлиентом.ПользовательДилера
	|		ИНАЧЕ ИсторияПерепискиСКлиентом.Объект.Клиент
	|	КОНЕЦ КАК ПользовательДилера,
	|	ВЫБОР КОГДА ИсторияПерепискиСКлиентом.ТипОтветаДилера = ЗНАЧЕНИЕ(Перечисление.Renault_ТипыОтветовДилера.Email) ТОГДА
	|		""(по e-mail)""
	|	КОГДА ИсторияПерепискиСКлиентом.ТипОтветаДилера = ЗНАЧЕНИЕ(Перечисление.Renault_ТипыОтветовДилера.Телефон) ТОГДА
	|		""(по телефону)""
	|	КОНЕЦ КАК ТипОтветаДилера
	|ИЗ
	|	РегистрСведений.Renault_ИсторияПерепискиСКлиентом КАК ИсторияПерепискиСКлиентом
	|ГДЕ
	|	ИсторияПерепискиСКлиентом.Объект = &Объект
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	Запрос.УстановитьПараметр("Объект", Документы.Renault_Лид.НайтиПоРеквизиту("ТрафикИД", ИДТрафика));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Область = Макет.ПолучитьОбласть("Сообщение");
		ЗаполнитьЗначенияСвойств(Область.Параметры, Выборка, , "Отправитель");
		Если Выборка.Отправитель = "Клиент" Тогда
			Область.Параметры.Отправитель = "Клиент";
			Область.Области.Сообщение.ЦветФона = Новый Цвет(255, 237, 159);
		иначе
			Область.Параметры.Отправитель = "Исполнитель: " + Выборка.ПользовательДилера;
			
		КонецЕсли;
		ИсторияПереписки.Вывести(Область);
		
	КонецЦикла;
	
	НайтиСсылкуНаКонфигурациюКлиента();  // DMSREN-1217
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеКлиента(Клиент)
	
	Если ЗначениеЗаполнено(Клиент) Тогда
		Клиент_ФИО = Клиент.Наименование;
		Клиент_Пол = Клиент.Пол;
		Клиент_Телефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(Клиент);
		Клиент_Email = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(Клиент);
		//Клиент_ДР = '00010101';
	Иначе
		Клиент_ФИО = "";
		Клиент_Пол = Перечисления.ПолФизическихЛиц.ПустаяСсылка();
		Клиент_Телефон = "";
		Клиент_Email = "";
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗакрытьСтраницу(Команда)
	
	ЗакрытьСтраницуСервер();
	Если Элементы.ГруппаСообщения.ПодчиненныеЭлементы.Количество() = 0 Тогда
		Элементы.ГруппаОбработкаСообщений.Видимость = Ложь;
		Если ЭтоАдминистратор() Тогда
			Элементы.ГруппаИсполнители.ТекущаяСтраница = Элементы.ГруппаТрафикАдминистратор;
		Иначе
			Элементы.ГруппаИсполнители.ТекущаяСтраница = Элементы.ГруппаТрафикМенеджер;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоАдминистратор()
	
	РольПользователя = ПраваПользователя.ПраваИНастройки.КонтактЦентр_РольПользователя;
	Если РольПользователя = Перечисления.Renault_КонтактЦентр_РолиПользователей.Менеджер Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗакрытьСтраницуСервер()
	
	Элементы.Удалить(Элементы.ГруппаСообщения.ТекущаяСтраница);
	ТабСоответствий = РеквизитФормыВЗначение("ТаблицаСоответствийТрафикаИСтраниц");
	СтрСоответствия = ТабСоответствий.Найти(ИДТрафика, "ИдентификаторТрафика");
	Если СтрСоответствия <> Неопределено Тогда
		ТабСоответствий.Удалить(СтрСоответствия);
		ЗначениеВРеквизитФормы(ТабСоответствий, "ТаблицаСоответствийТрафикаИСтраниц");
	КонецЕсли;
	Если Элементы.ГруппаСообщения.ПодчиненныеЭлементы.Количество() > 3 Тогда
		//Элементы.ГруппаСообщения.ТекущаяСтраница = Элементы.ГруппаСообщения.ПодчиненныеЭлементы[0];
		Элементы.ГруппаСообщения.ТекущаяСтраница = Элементы.ГруппаСообщения.ПодчиненныеЭлементы[Элементы.ГруппаСообщения.ПодчиненныеЭлементы.Количество()-1]; // DMSREN-1293. переходим на последний элемент, а не на первый
		ТекСтр = Элементы.ГруппаСообщения.ТекущаяСтраница.Имя;
		ОбновитьДанные(ТекСтр);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветитьEmail(Команда)
	
	Лид_Ответ = "";
	сПараметры = Новый Структура;
	сПараметры.Вставить("Лид_Ответ", Лид_Ответ);
	сПараметры.Вставить("ИДТрафика", ИДТрафика);
	сПараметры.Вставить("Лид_ТекущийЛид", ПолучитьЛидПоТрафику(ИДТрафика));
	сПараметры.Вставить("Клиент_Email", Клиент_Email);
	Оповещение = Новый ОписаниеОповещения("ЗакрытиеФормыОтветНаЕмаил", ЭтаФорма);
	ОткрытьФорму("Обработка.Renault_АРМ_ContactCenter.Форма.ФормаОтвета", сПараметры, ЭтаФорма,,,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормыОтветНаЕмаил(Ответ, ПараметрыОтвета) Экспорт
	
	Если Ответ <> Неопределено и Ответ.Результат Тогда
		Лид_Ответ = Ответ.Лид_Ответ;
		Лид_ЗаголовокОтвета = Ответ.Заголовок;
		ОтправитьОтветНаЛидНаСервере(Лид_Ответ,Лид_ЗаголовокОтвета, "Email");
		ОбновитьСостояниеЛида();
		ПоказатьПредупреждение(, "Ответ успешно отправлен");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОтправитьОтветНаЛидНаСервере(Лид_Ответ, Лид_ЗаголовокОтвета = "", ТипОтвета)
	
		//Сохраним в историю сообщений
		Запись = РегистрыСведений.Renault_ИсторияПерепискиСКлиентом.СоздатьМенеджерЗаписи();
		Запись.Период = ТекущаяДата();// + (Объект.ДилерскийЦентр.РазницаВремениСМосквой *3600);
		Запись.Объект = Документы.Renault_Лид.НайтиПоРеквизиту("ТрафикИД", ИДТрафика);
		Запись.Сообщение = Renault_ОнлайнКонсультант.ПолучитьТекстИзHTML(Лид_Ответ);
		Запись.Заголовок = Лид_ЗаголовокОтвета;
		Запись.ПользовательДилера = ПараметрыСеанса.Пользователь;
		Запись.ТипОтветаДилера = Перечисления.Renault_ТипыОтветовДилера[ТипОтвета];
		Запись.ЭтоОтветДилера = Истина;
		Запись.Email = ?(ТипОтвета = "Email", Документы.Renault_Лид.НайтиПоРеквизиту("ТрафикИД", ИДТрафика).КлиентАдресЭлектроннойПочты, "");
		Запись.Идентификатор = Новый УникальныйИдентификатор;
		Запись.Записать();
		//
		РеквизитФормыВЗначение("Объект").ОтметитьТрафикЛМТПочтаОтвеченным(ИДТрафика);
		////Сохраним факт отправки лида
		//ЛидОбъект = Объект.ПолучитьОбъект();
		//ЛидОбъект.ОтветОтправлен = Истина;
		//Если Не ЗначениеЗаполнено(ЛидОбъект.ДатаОтветаДилера) Тогда
		//	ЛидОбъект.ДатаОтветаДилера = ТекущаяДатаСеанса()+ (Объект.ДилерскийЦентр.РазницаВремениСМосквой*3600);
		//	ЛидОбъект.ТипПервогоОтвета = Перечисления.ТипыОтветовДилера[ТипОтвета];
		//КонецЕсли;
		//ЛидОбъект.Записать();
		//
		//Лид_ОтветОтправлен = Истина;
		//КонтактЦентрСервер.ЗарегистрироватьОбработкуЛида(ЛидОбъект);
		//ТЗЛидов = Новый ТаблицаЗначений;
		//ТЗЛидов.Колонки.Добавить("Лид", новый ОписаниеТипов("ДокументСсылка.ЛидRenault"));
		//СтрокаТЗ = ТЗЛидов.Добавить();
		//СтрокаТЗ.Лид = ЛидОбъект.Ссылка;
		//мПараметры = Новый Массив;
		//мПараметры.Добавить(ТЗЛидов);
		//мПараметры.Добавить("Ответ исполнителя");
		//ФоновыеЗадания.Выполнить("КонтактЦентрСервер.РазослатьОповещенияПоПочтеКоординатор", мПараметры);
		ИсторияПерепискиЗаполнить();
		//Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ОбновитьСостояниеЛида()
	
	//Если Объект.ЛидЗакрыт Тогда
	//	ЭтотОбъект.Заголовок ="Лид " + Объект.Номер +"(Закрыт)";
	//ИначеЕсли Объект.ОтветОтправлен Тогда
	//	ЭтотОбъект.Заголовок ="Лид " + Объект.Номер +" (В обработке)";
	//ИначеЕсли ТекущаяДата() - Объект.КритическаяДата > 1 Тогда
	//	ЭтотОбъект.Заголовок ="Лид " + Объект.Номер +" (Просрочен)";
	//иначе
	//	ЭтотОбъект.Заголовок ="Лид " + Объект.Номер +" (Новый)";
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветитьПоТелефону(Команда)
	
	ОтветПоТелефонуАктивен = Истина;
	сПараметры = Новый Структура;
	сПараметры.Вставить("Лид_ТекущийЛид", ПолучитьЛидПоТрафику(ИДТрафика));
	
	// Беседин 09.12.21 завка 1179
	Оповещение = Новый ОписаниеОповещения("ЗакрытиеФормыОтветНаТелефон", ЭтаФорма);
	ОткрытьФорму("Обработка.Renault_АРМ_ContactCenter.Форма.ФормаОтветаТелефонВеб",сПараметры, ЭтаФорма,,,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормыОтветНаТелефон(Ответ, ПараметрыОтвета) Экспорт
	
	Если Ответ <> Неопределено и Ответ.Результат Тогда
		Лид_Ответ = Ответ.Лид_Ответ;
		ОтправитьОтветНаЛидНаСервере(Лид_Ответ,,"Телефон");
		ОбновитьСостояниеЛида();
		ПоказатьПредупреждение(, "Ответ успешно записан");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьОтветственного(Команда)
	
	ТекСписок = ПолучитьТекСписок();
	Если ТекСписок = "" Тогда
		Возврат;
	КонецЕсли;
	ТекДанные = Элементы[ТекСписок].ТекущиеДанные;
	//Оповещение = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыВыбораОтветственного", ЭтаФорма, ТекДанные.Идентификатор);
	//ОткрытьФорму("Обработка.Renault_АРМ_ContactCenter.Форма.ФормаВыбораОтветственного", , ЭтаФорма, , , , Оповещение);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИдТрафика", ТекДанные.Идентификатор);
	ДополнительныеПараметры.Вставить("ЭтоЛид", Истина);
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыПодбораСотрудника", ЭтаФорма, ДополнительныеПараметры);
	ПараметрыФормы = Новый Структура("ДилерскийЦентр",ОтборДЦ);
	ОткрытьФорму("Обработка.Renault_АРМ_ContactCenter.Форма.ФормаПодбораСотрудников",ПараметрыФормы , ЭтаФорма, , , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьОтветственногоИзЛида(Команда)
	
	//Оповещение = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыВыбораОтветственного", ЭтаФорма, ИДТрафика);
	//ОткрытьФорму("Обработка.Renault_АРМ_ContactCenter.Форма.ФормаВыбораОтветственного", , ЭтаФорма, , , , Оповещение);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИдТрафика", ИДТрафика);
	ДополнительныеПараметры.Вставить("ЭтоЛид", СтрНайти(Команда.Имя, "НеЛид") = 0);
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыПодбораСотрудника", ЭтаФорма, ДополнительныеПараметры);
	ПараметрыФормы = Новый Структура("ДилерскийЦентр",ОтборДЦ);
	ОткрытьФорму("Обработка.Renault_АРМ_ContactCenter.Форма.ФормаПодбораСотрудников",ПараметрыФормы , ЭтаФорма, , , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыПодбораСотрудника(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		НазначитьНаМенеджераНаСервере(Результат, ДополнительныеПараметры.ИДТрафика, ДополнительныеПараметры.ЭтоЛид);
		Элементы.СписокВходящие.Обновить();
		Если Элементы.ГруппаИсполнители.ТекущаяСтраница = Элементы.ГруппаОбработкаСообщений Тогда
			Лид_Ответственный = Результат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте
//Процедура ОбработатьЗакрытиеФормыВыбораОтветственного(Параметр, ИДТрафика) Экспорт
//	
//	Если ЗначениеЗаполнено(Параметр) Тогда
//		НазначитьНаМенеджераНаСервере(Параметр, ИДТрафика);
//		Элементы.СписокВходящие.Обновить();
//		Если Элементы.ГруппаИсполнители.ТекущаяСтраница = Элементы.ГруппаОбработкаСообщений Тогда
//			Лид_Ответственный = Параметр;
//		КонецЕсли;
//	КонецЕсли;
//	
//КонецПроцедуры

&НаСервере
Процедура НазначитьНаМенеджераНаСервере(ВыбранныйМенеджер, ВыбранныйТрафикID, ЭтоЛид = Истина)
	
	Запись = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ВыбранныйТрафикID);
	Запись.Менеджер = ВыбранныйМенеджер;
	Запись.Администратор = ПараметрыСеанса.Пользователь.Сотрудник; // DMSREN-276 17.09.2019
	Запись.Записать();
	
	Если ЭтоЛид Тогда
		Лид = Документы.Renault_Лид.НайтиПоРеквизиту("ТрафикИД", ВыбранныйТрафикID);
		
		Если НЕ ЗначениеЗаполнено(Лид) Тогда
			Сообщить("Не найден лид для трафика " + ВыбранныйТрафикID);
		Иначе
			Об = Лид.ПолучитьОбъект();
			Об.Менеджер = ВыбранныйМенеджер;
			Об.Записать();
		КонецЕсли;
	КонецЕсли;
	
	Renault_ОнлайнКонсультант.ПослатьПочтовоеСообщениеПользователю_КЦ(Запись, Запись.Менеджер, "Назначен лид");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтветственногоНаСервере(Ответственный = Неопределено, ЭтоЛид = Истина)
	
	Если ЭтоЛид Тогда
		Лид = Документы.Renault_Лид.НайтиПоРеквизиту("ТрафикИД", ИДТрафика);
		
		Если Ответственный = Неопределено Тогда
			Ответственный = Справочники.Сотрудники.ПустаяСсылка();
		КонецЕсли;
		//Если ЗначениеЗаполнено(Лид.Ответственный) Тогда
		//	СохранитьИзмененениеОтветственного(Лид);
		//КонецЕсли;
		ЛидОбъект = Лид.ПолучитьОбъект();
		ЛидОбъект.Менеджер = Ответственный;
		ЛидОбъект.Записать();
	КонецЕсли;
	
	Запись = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ИДТрафика);
	Запись.Менеджер = Ответственный;
	Запись.Записать();
	//Лид_Ответственный = Ответственный;
	//КонтактЦентрСервер.РазослатьОповещенияПоПочтеПользователь(Лид, "Назначен лид");
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТекСписок()
	
	Ответ = "";
	
	Если Элементы.ГруппаИсполнители.ТекущаяСтраница = Элементы.ГруппаТрафикМенеджер Тогда
		
		Если Элементы.ГруппаСтрМенеджер.ТекущаяСтраница = Элементы.ГруппаМойТрафик Тогда
			Ответ = "СписокМойТрафик";
		ИначеЕсли Элементы.ГруппаСтрМенеджер.ТекущаяСтраница = Элементы.ГруппаВОбработкеМенеджер Тогда
			Ответ = "СписокВОбработке";
		ИначеЕсли Элементы.ГруппаСтрМенеджер.ТекущаяСтраница = Элементы.ГруппаВсеМенеджер Тогда
			Ответ = "СписокМойТрафик";
		КонецЕсли;
		
	ИначеЕсли Элементы.ГруппаИсполнители.ТекущаяСтраница = Элементы.ГруппаТрафикАдминистратор Тогда
		
		Если Элементы.ГруппаСтрАдминистратор.ТекущаяСтраница = Элементы.ГруппаВходящие Тогда
			Ответ = "СписокВходящие";
		ИначеЕсли Элементы.ГруппаСтрАдминистратор.ТекущаяСтраница = Элементы.ГруппаНазначенные Тогда
			Ответ = "СписокНазначенные";
		ИначеЕсли Элементы.ГруппаСтрАдминистратор.ТекущаяСтраница = Элементы.ГруппаВОбработке Тогда
			//Ответ = "СписокМойТрафик";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

&НаКлиенте
Процедура ГруппаСообщенияПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ТекСтр = Элементы.ГруппаСообщения.ТекущаяСтраница.Имя;
	ОбновитьДанные(ТекСтр);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанные(ТекСтр)
	
	Клиент_ФИО = "";
	Клиент_Пол = "";
	Клиент_Телефон = "";
	Клиент_Email = "";
	Клиент_ДР = '00010101';
	ДатаЗагрузкиЛида = '00010101';
	КритическаяДата = '00010101';
	Лид_Приоритет = "";
	КатегорияЛида = "";
	ИсточникЛида = "";
	ДилерскийЦентр = Справочники.CRM_ДилерскиеЦентры.ПустаяСсылка();
	Лид = Документы.Renault_Лид.ПустаяСсылка();
	Лид_ВидТип = Перечисления.Renault_ТипыЛидов.ПустаяСсылка();
	Лид_ВидКлассификация = Справочники.Renault_КлассификацияЛидов.ПустаяСсылка();
	Лид_ПродПримечание = "";
	Лид_ВЧерномСписке = Ложь;
	Лид_ПримечаниеДилера = "";
	Лид_Ответственный = Справочники.Сотрудники.ПустаяСсылка();
	
	СтрСоответствие = РеквизитФормыВЗначение("ТаблицаСоответствийТрафикаИСтраниц").Найти(ТекСтр, "ИмяСтраницы");
	ИДТрафика = СтрСоответствие.ИдентификаторТрафика;
	
	Запись = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ИДТрафика);
	ДилерскийЦентр = Запись.ДилерскийЦентр;
	
	ТипТрафика = Запись.ТипТрафика;
	
	ПолучитьДанныеКлиента(Запись.Клиент);
	
	Если ТипТрафика = Справочники.CRM_ТипТрафика.ЛидRenault Тогда
		
		Лид = Документы.Renault_Лид.НайтиПоРеквизиту("ТрафикИД", ИДТрафика);
		ДатаЗагрузкиЛида = Лид.ДатаЗаогрузки;
		КритическаяДата = Лид.КритическаяДата;
		ПримечаниеVIN = Лид.VIN;
		ПримечаниеМодель = Лид.Модель;
		ПримечаниеДвигатель = Лид.Мотор;
		ПримечаниеПробег = Лид.Пробег;
		Лид_Приоритет = Лид.Приоритет;
		КатегорияЛида = Лид.Теги;
		ИсточникЛида = Лид.Канал;
		Лид_ВидТип = Лид.ВидУслуги.Тип;
		Лид_ВидКлассификация = Лид.ВидУслуги.Классификация;
		Лид_ПродПримечание = Лид.ПовторныхЛидов;
		Клиент_ДР = Лид.КлиентДеньРождения;
		Клиент_Email = Лид.КлиентАдресЭлектроннойПочты;
		Клиент_Телефон = Лид.КлиентМобильныйТелефон;
		Лид_ПримечаниеДилера = Лид.ПримечаниеДилера;
		Лид_Ответственный = Лид.Менеджер;
		
		ПродИсторияЗаполнить(Лид.Ссылка, СтрЗаменить(СтрСоответствие.ИмяСтраницы, "Сообщение", ""));
		
		ИсторияПерепискиЗаполнить();
		
		Лид_ВЧерномСписке = ПочтаВЧерномСписке(Лид.КлиентАдресЭлектроннойПочты);
		
	ИначеЕсли ТипТрафика = Справочники.CRM_ТипТрафика.Email Тогда
		
		Запись = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ИДТрафика);
		Лид_Ответственный = Запись.Менеджер;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_Трафик.Клиент,
		|	Renault_Трафик.ДилерскийЦентр.BIR КАК BIR,
		|	Renault_ТрафикПисьма.ДатаПоступления КАК ДатаСообщения,
		|	Renault_ТрафикПисьма.ТемаПисьма,
		|	Renault_ТрафикПисьма.ТекстПисьма КАК ТекстПисьма,
		|	Renault_ТрафикПисьма.ФорматТекста КАК ФорматТекста,
		|	Renault_ТрафикПисьма.ПочтаКлиента КАК Email,
		|	Renault_ТрафикПисьма.УчетнаяЗапись КАК УчетнаяЗаписьПисьмо
		|ИЗ
		|	РегистрСведений.Renault_ТрафикПисьма КАК Renault_ТрафикПисьма
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_Трафик КАК Renault_Трафик
		|		ПО Renault_ТрафикПисьма.ИдТрафика = Renault_Трафик.Идентификатор
		|ГДЕ
		|	Renault_ТрафикПисьма.ИдТрафика = &ИдТрафика
		|УПОРЯДОЧИТЬ ПО
		|	Renault_ТрафикПисьма.ДатаПоступления УБЫВ";
		Запрос.УстановитьПараметр("ИдТрафика", ИДТрафика);
		Табл = Запрос.Выполнить().Выгрузить();
		
		ИсторияПерепискиЗаполнить();
		
		Если Табл.Количество() > 0 Тогда
			
			Клиент_Email = Табл[0].Email;			
			Макет = Обработки.Renault_АРМ_ContactCenter.ПолучитьМакет("МакетИсторияПереписки");
			
			Область = Макет.ПолучитьОбласть("Сообщение");
			Область.Параметры.Период = Табл[0].ДатаСообщения;
			Область.Параметры.Сообщение = Табл[0].ТекстПисьма;
			ИсторияПереписки.Вывести(Область);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ДопЗапрос = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_РабочиеЛисты.ID,
	|	Renault_РабочиеЛисты.Клиент,
	|	Renault_РабочиеЛисты.Сотрудник,
	|	Renault_РабочиеЛисты.ЛистЗакрыт,
	|	"""" КАК Почта,
	|	"""" КАК Телефон,
	|	Renault_РабочиеЛисты.ДатаID КАК Дата,
	|	Renault_РабочиеЛисты.IDK
	|ИЗ
	|	Документ.Renault_РабочийЛист КАК Renault_РабочиеЛисты
	|ГДЕ
	|	Renault_РабочиеЛисты.Клиент = &Клиент";
	Запрос.УстановитьПараметр("Клиент", Запись.Клиент);
	ТаблицаРабочиеЛисты.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Если ЗначениеЗаполнено(СокрЛП(Клиент_Email)) Тогда
		ДопЗапрос = ДопЗапрос + "
		|	ИЛИ КонтактнаяИнформация.Представление ПОДОБНО ""%"" + &EMail + ""%""";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СокрЛП(Клиент_Телефон)) Тогда
		ДопЗапрос = ДопЗапрос + "
		|	ИЛИ КонтактнаяИнформация.Представление ПОДОБНО ""%"" + &Телефон + ""%""";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект КАК Клиент
	|ПОМЕСТИТЬ втКлиенты
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	(КонтактнаяИнформация.Объект.Наименование ПОДОБНО ""%"" + &Наименование + ""%""" + ДопЗапрос + ")
	|	И (КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
	|			ИЛИ КонтактнаяИнформация.Объект ССЫЛКА Справочник.CRM_ПотенциальныеКонтрагенты)
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтактнаяИнформация.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.Представление
	|ПОМЕСТИТЬ втТелефон
	|ИЗ
	|	втКлиенты КАК втКлиенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО втКлиенты.Клиент = КонтактнаяИнформация.Объект
	|ГДЕ
	|	КонтактнаяИнформация.Тип = &ТипТелефон
	|	И КонтактнаяИнформация.ЗначениеПоУмолчанию
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.Представление
	|ПОМЕСТИТЬ втПочта
	|ИЗ
	|	втКлиенты КАК втКлиенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО втКлиенты.Клиент = КонтактнаяИнформация.Объект
	|ГДЕ
	|	КонтактнаяИнформация.Тип = &ТипПочта
	|	И КонтактнаяИнформация.ЗначениеПоУмолчанию
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втКлиенты.Клиент,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Renault_РабочиеЛисты.IDK, 0) <> 0
	|			ТОГДА Renault_РабочиеЛисты.IDK
	|		ИНАЧЕ Renault_Лид.Ссылка
	|	КОНЕЦ КАК Лид,
	|	ВЫБОР
	|		КОГДА втКлиенты.Клиент ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Потенциальный,
	|	втТелефон.Представление КАК Телефон,
	|	втПочта.Представление КАК EMail,
	|	Renault_РабочиеЛисты.Ссылка КАК РабочийЛист
	|ПОМЕСТИТЬ втДанные
	|ИЗ
	|	втКлиенты КАК втКлиенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_Лид КАК Renault_Лид
	|		ПО втКлиенты.Клиент = Renault_Лид.Клиент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_РабочийЛист КАК Renault_РабочиеЛисты
	|		ПО втКлиенты.Клиент = Renault_РабочиеЛисты.Клиент
	|		ЛЕВОЕ СОЕДИНЕНИЕ втТелефон КАК втТелефон
	|		ПО втКлиенты.Клиент = втТелефон.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПочта КАК втПочта
	|		ПО втКлиенты.Клиент = втПочта.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанные.Клиент,
	|	втДанные.Лид,
	|	втДанные.Потенциальный,
	|	втДанные.Телефон,
	|	втДанные.EMail,
	|	втДанные.РабочийЛист
	|ИЗ
	|	втДанные КАК втДанные
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ЕСТЬNULL(втДанные.Лид, 0) = 0
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	Запрос.УстановитьПараметр("EMail", СокрЛП(Клиент_Email));
	Запрос.УстановитьПараметр("Телефон", СокрЛП(Клиент_Телефон));
	Запрос.УстановитьПараметр("Наименование", СокрЛП(Клиент_ФИО));
	Запрос.УстановитьПараметр("ТипПочта", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("ТипТелефон", Перечисления.ТипыКонтактнойИнформации.Телефон);
	ТаблицаЛиды.Загрузить(Запрос.Выполнить().Выгрузить());
	                                                          
	// { DMSREN-1217. Управление видимостью ссылки на конфигурацию клиента
	ЭлементСсылкаНаКонфигурацию = Элементы.Найти("ПолеСсылкаНаКонфигурацию" + СтрЗаменить(СтрСоответствие.ИмяСтраницы, "Сообщение", ""));
	Если ЭлементСсылкаНаКонфигурацию <> Неопределено тогда
		ЭлементСсылкаНаКонфигурацию.Видимость = ЗначениеЗаполнено(СсылкаНаКонфигурациюКлиента);		
	КонецЕсли;
	// DMSREN-1217 } 
	// { DMSREN-1178
	ЭлементФормы = Элементы.Найти("ПрикрепитьКРЛ" + СтрЗаменить(СтрСоответствие.ИмяСтраницы, "Сообщение", ""));
	Если ЭлементФормы <> Неопределено И ЗначениеЗаполнено(Лид.РабочийЛистПрикрепленый) тогда
		ЭлементФормы.Заголовок = "Прикреплен к РЛ №" + Лид.РабочийЛистПрикрепленый.IDK;
		ЭлементФормы.Доступность = ИСТИНА;
	КонецЕсли;
	// DMSREN-1178 }
КонецПроцедуры

Функция ПочтаВЧерномСписке(Адрес)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ЗаблокированныйТрафик.IDТрафика
	|ИЗ
	|	РегистрСведений.Renault_ЗаблокированныйТрафик КАК Renault_ЗаблокированныйТрафик
	|ГДЕ
	|	Renault_ЗаблокированныйТрафик.ЭлектронныйАдрес = &ЭлектронныйАдрес";
	Запрос.УстановитьПараметр("ЭлектронныйАдрес", Адрес);
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервере 
Процедура ПродИсторияЗаполнить(Лид, НомерСообщения)
	
	ПродИстория.Очистить();
	Макет = Обработки.Renault_АРМ_ContactCenter.ПолучитьМакет("МакетПродИстория");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СервиснаяИстория.VIN,
	|	СервиснаяИстория.Модель,
	|	СервиснаяИстория.Версия,
	|	СервиснаяИстория.ДатаЗаписи,
	|	СервиснаяИстория.ОписаниеРабот
	|ПОМЕСТИТЬ Вт_ТЗ
	|ИЗ
	|	РегистрСведений.Renault_СервиснаяИстория КАК СервиснаяИстория
	|ГДЕ
	|	СервиснаяИстория.Лид = &Лид
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт_ТЗ.Модель КАК Модель,
	|	Вт_ТЗ.ДатаЗаписи КАК Период,
	|	Вт_ТЗ.ОписаниеРабот КАК Сообзщение,
	|	Вт_ТЗ.VIN КАК VIN,
	|	Вт_ТЗ.Версия КАК ВариантКомплектации
	|ИЗ
	|	Вт_ТЗ КАК Вт_ТЗ
	|
	|УПОРЯДОЧИТЬ ПО
	//|	Модель,
	|	Вт_ТЗ.ДатаЗаписи УБЫВ";
	Запрос.УстановитьПараметр("Лид", Лид);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		//Элементы.ГруппаИстория.Видимость = Ложь;
		Элементы["ПродИстория" + НомерСообщения].Видимость = Ложь;
	Иначе
		Выборка = Результат.Выбрать();
		Счетчик = 0;
		Пока Выборка.Следующий() Цикл
			
			Область = Макет.ПолучитьОбласть("Шаблон");
			ЗаполнитьЗначенияСвойств(Область.Параметры, Выборка);
			Область.Параметры.Автомобиль = "" + Выборка.Модель + " " + Выборка.ВариантКомплектации;
			//Если Счетчик%2 = 0 Тогда 
			//	Область.Области.Шаблон.ЦветФона = Новый Цвет(255, 237, 159);
			//КонецЕсли;  
			ПродИстория.Вывести(Область);
			Счетчик = Счетчик +1;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВЧерныйСписок(Команда)
	
	Если НЕ ЗначениеЗаполнено(Клиент_Email) Тогда
		ПоказатьПредупреждение(, "У клиента отсутсвует электронная почта");
		Возврат;
	КонецЕсли;
	
	Лид_ВЧерномСписке = Не Лид_ВЧерномСписке;
	Если Лид_ВЧерномСписке Тогда
		Причина = "";
		ВвестиСтроку(Причина, "Введите причину внесения в черный список");
		ДобавитьВЧерныйСписокНаСервере(Истина, Причина);
		ПоказатьПредупреждение(, "Вы больше не будете получать сообщения с этой электронной почты");
	Иначе
		ДобавитьВЧерныйСписокНаСервере(Ложь);
		ПоказатьПредупреждение(, "Электронная почта исключена из черного списка");
	КонецЕсли;
	//ОбновитьОтображениеЛид();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВЧерныйСписокНаСервере(ВключитьВЧС = Истина, ПричинаБлокировки = "")
	
	Если ВключитьВЧС = Истина Тогда
		Мен = РегистрыСведений.Renault_ЗаблокированныйТрафик.СоздатьМенеджерЗаписи();
		Мен.Идентификатор = Новый УникальныйИдентификатор;
		Мен.IDТрафика = ИДТрафика;
		Мен.ЭлектронныйАдрес = Клиент_Email;
		Мен.ПризнакБлокировки = 1;
		Мен.ПричинаБлокировки = ПричинаБлокировки;
		Мен.Пользователь = ПараметрыСеанса.Пользователь;
		Мен.ДатаБлокировки = ТекущаяДата();
		Мен.Записать();
	Иначе //исключим
		Набор = РегистрыСведений.Renault_ЗаблокированныйТрафик.СоздатьНаборЗаписей();
		Набор.Отбор.IDТрафика.Установить(ИДТрафика);
		Набор.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВзятьСебе(Команда)
	
	ЭтоЛид = СтрНайти(Команда.Имя, "НеЛид") = 0;
	
	Если Элементы.ГруппаИсполнители.ТекущаяСтраница = Элементы.ГруппаОбработкаСообщений Тогда
		
		ВзятьСебеНаСервере(ИДТрафика, ЭтоЛид);
		
	Иначе
		
		Если Элементы.ГруппаИсполнители.ТекущаяСтраница.Имя = "ГруппаТрафикМенеджер" Тогда
			Если Элементы.ГруппаСтрМенеджер.ТекущаяСтраница.Имя = "ГруппаМойТрафик" Тогда
				ИмяСписка = "СписокМойТрафик";
			ИначеЕсли Элементы.ГруппаСтрМенеджер.ТекущаяСтраница.Имя = "ГруппаВОбработкеМенеджер" Тогда
				ИмяСписка = "СписокВОбработке";
			ИначеЕсли Элементы.ГруппаСтрМенеджер.ТекущаяСтраница.Имя = "ГруппаВсеВходящие" Тогда
				ИмяСписка = "СписокВсеВходящие";
			ИначеЕсли Элементы.ГруппаСтрМенеджер.ТекущаяСтраница.Имя = "ГруппаВсеМенеджер" Тогда
				ИмяСписка = "СписокВсе";
			Иначе
				Возврат;
			КонецЕсли;
		ИначеЕсли Элементы.ГруппаИсполнители.ТекущаяСтраница.Имя = "ГруппаТрафикАдминистратор" Тогда
			Если Элементы.ГруппаСтрАдминистратор.ТекущаяСтраница.Имя = "ГруппаВходящие" Тогда
				ИмяСписка = "СписокВходящие";
			ИначеЕсли Элементы.ГруппаСтрАдминистратор.ТекущаяСтраница.Имя = "ГруппаНазначенные" Тогда
				ИмяСписка = "СписокНазначенные";
			ИначеЕсли Элементы.ГруппаСтрАдминистратор.ТекущаяСтраница.Имя = "ГруппаВОбработке" Тогда
				ИмяСписка = "СписокВОбработкеАдминистратор1";
			ИначеЕсли Элементы.ГруппаСтрАдминистратор.ТекущаяСтраница.Имя = "ГруппаВсе" Тогда
				ИмяСписка = "СписокВсеАдминистратор1";
			Иначе
				Возврат;
			КонецЕсли;
		Иначе
			Возврат;
		КонецЕсли;
		
		ТекДанные = Элементы[ИмяСписка].ТекущиеДанные;
		
		ИдентификаторТрафика = ТекДанные.Идентификатор;
		
		ВзятьСебеНаСервере(ИдентификаторТрафика, ЭтоЛид);
		
		Элементы[ИмяСписка].Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВзятьСебеНаСервере(ИдентификаторТрафика, ЭтоЛид = Истина)
	
	ТекПользователь = ПараметрыСеанса.Пользователь;
	
	Запись = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ИдентификаторТрафика);
	Запись.Менеджер = ТекПользователь.Сотрудник;
	Запись.Записать();
	
	Renault_ОнлайнКонсультант.ПослатьПочтовоеСообщениеПользователю_КЦ(Запись, Запись.Менеджер, "Назначен лид");
	
	Если ЭтоЛид Тогда
		Лид = Документы.Renault_Лид.НайтиПоРеквизиту("ТрафикИД", ИдентификаторТрафика);
		Об = Лид.ПолучитьОбъект();
		Об.Менеджер = ТекПользователь.Сотрудник;
		Об.Записать();
	КонецЕсли;
	
	Если Элементы.ГруппаИсполнители.ТекущаяСтраница = Элементы.ГруппаОбработкаСообщений Тогда
		
		ТабСоответствий = РеквизитФормыВЗначение("ТаблицаСоответствийТрафикаИСтраниц");
		СтрСоответствия = ТабСоответствий.Найти(ИдентификаторТрафика, "ИдентификаторТрафика");
		Индекс = Число(Сред(СтрСоответствия.ИмяСтраницы, 10));
		
		//ЗаполнитьОтветственногоНаСервере(ТекПользователь, Документы.Renault_Лид.НайтиПоРеквизиту("ТрафикИД", ИДТрафика));
		//Лид_Ответственный = ТекПользователь;
		Элементы["Ответственный" + Индекс].Видимость = Истина;
		Элементы["КнОтказаться" + Индекс].Видимость = Истина;
		Элементы["КнВзятьСебе" + Индекс].Видимость = Ложь;
		Элементы["ОтветитьEmail" + Индекс].Доступность = Истина;
		Элементы["ОтветитьТелефон" + Индекс].Доступность = Истина;
		Лид_Ответственный = ТекПользователь.Сотрудник;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПолучитьДатуАктуальности();
	
	ПодключитьОбработчикОжидания("ПолучитьДатуАктуальности", 180);
	
	Элементы.ОтборДЦ.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокДЦ());
	Элементы.ОтборДЦ1.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокДЦ());
	Элементы.ОтборДЦ2.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокДЦ());
	Элементы.ОтборДЦ3.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокДЦ());
	Элементы.ОтборДЦ4.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокДЦ());
	Элементы.ОтборДЦ5.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокДЦ());
	Элементы.ОтборДЦ6.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокДЦ());
	Элементы.ОтборДЦ7.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокДЦ());
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокДЦ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДилерскиеЦентры.Ссылка
	|ИЗ
	|	Справочник.CRM_ДилерскиеЦентры КАК ДилерскиеЦентры
	|ГДЕ ПометкаУдаления = Ложь";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура ОбновитьТрафик(Команда)
	
	ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
	Ответ = ВыполнитьЗадание("Renault_ОнлайнКонсультант.Renault_КонтактЦентр_LMT");
	
	Если ОшибкаПолученияДанных Тогда
		ФормаДлительнойОперации = ПолучитьФорму("Обработка.Renault_АРМ_ContactCenter.Форма.ДлительнаяОперация");
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = УникальныйИдентификаторЗадания Тогда
			ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		КонецЕсли;
		ОткрытьФорму("Обработка.Renault_АРМ_ContactCenter.Форма.ФормаОшибкиПолученияДанных");
	КонецЕсли;
	
	Если Ответ <> Неопределено и Ответ = Истина Тогда
		//ОбновитьСписокТрафика();
		//ОбновитьЧат();
		//ПрочитатьДанныеКлиента();
	ИначеЕсли не ОшибкаПолученияДанных Тогда 
		ПодключитьОбработчикОжидания("ВыполнениеДлительнойОперацииLMT", 1, Истина);
		ФормаДлительнойОперации = ОткрытьФормуДлительнойОперации(ЭтаФорма, УникальныйИдентификаторЗадания, "LMT");
	КонецЕсли;
	//ОбновитьТрафикНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТрафикНаСервере()
	
	//ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
	//мПараметры = Новый Массив;
	//мПараметры.Добавить(" ");
	//Задание = ФоновыеЗадания.Выполнить("Renault_ОнлайнКонсультант.Renault_КонтактЦентр_LMT", мПараметры);
	//УникальныйИдентификаторЗадания = Задание.УникальныйИдентификатор;
	//Ответ = ЗаданиеВыполнено(УникальныйИдентификаторЗадания);
	//Ответ = ВыполнитьЗадание();
	//Если Ответ <> Неопределено и Ответ = Истина Тогда
	//	//ОбновитьСписокТрафика();
	//	//ОбновитьЧат();
	//	//ПрочитатьДанныеКлиента();
	//ИначеЕсли не ОшибкаПолученияДанных Тогда 
	//	ПодключитьОбработчикОжидания("ВыполнениеДлительнойОперацииLMT", 1, Истина);
	//	ФормаДлительнойОперации = ОткрытьФормуДлительнойОперации(ЭтаФорма, УникальныйИдентификаторЗадания, "LMT");
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьЗадание(ИмяЗадания)
	
	мПараметры = Новый Массив;
	мПараметры.Добавить(" ");
	Задание = ФоновыеЗадания.Выполнить(ИмяЗадания, мПараметры);
	УникальныйИдентификаторЗадания = Задание.УникальныйИдентификатор;
	Ответ = ЗаданиеВыполнено(УникальныйИдентификаторЗадания);
	
	Возврат Ответ;
	
КонецФункции

&НаКлиенте
Процедура ВыполнениеДлительнойОперацииLMT()
	
	Ответ = ЗаданиеВыполнено(УникальныйИдентификаторЗадания);
	
	Парам = Новый Структура;
	Парам.Вставить("ИдентификаторЗадания", УникальныйИдентификаторЗадания);
	
	ФормаДлительнойОперации = ПолучитьФорму("Обработка.Renault_АРМ_ContactCenter.Форма.ДлительнаяОперация", Парам, ЭтаФорма, УникальныйИдентификаторЗадания);
	
	Если ОшибкаПолученияДанных Тогда
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = УникальныйИдентификаторЗадания Тогда
			ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		КонецЕсли;
		ОткрытьФорму("Обработка.Renault_АРМ_ContactCenter.Форма.ФормаОшибкиПолученияДанных");
	КонецЕсли;
	
	Если Ответ <> Неопределено и Ответ = Истина Тогда
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = УникальныйИдентификаторЗадания Тогда
			ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			ПолучитьДатуАктуальности();
		КонецЕсли;
		ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		Ответ = ВыполнитьЗадание("Renault_ОнлайнКонсультант.Renault_КонтактЦентр_Почта");
		
		Если ОшибкаПолученияДанных Тогда
			Если ФормаДлительнойОперации.Открыта() 
				И ФормаДлительнойОперации.ИдентификаторЗадания = УникальныйИдентификаторЗадания Тогда
				ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			КонецЕсли;
			ОткрытьФорму("Обработка.Renault_АРМ_ContactCenter.Форма.ФормаОшибкиПолученияДанных");
		КонецЕсли;
		
		Если Ответ <> Неопределено и Ответ = Истина Тогда
			//ОбновитьСписокТрафика();
			//ОбновитьЧат();
			//ПрочитатьДанныеКлиента();
		иначеЕсли не ОшибкаПолученияДанных Тогда
			ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
			ПодключитьОбработчикОжидания("ВыполнениеДлительнойОперацииПочта", ПараметрыОбработчика.ТекущийИнтервал, Истина);
			ФормаДлительнойОперации = ОткрытьФормуДлительнойОперации(ЭтаФорма, УникальныйИдентификаторЗадания, "почты");
		КонецЕсли;
	ИначеЕсли Не ОшибкаПолученияДанных Тогда
		ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		ПодключитьОбработчикОжидания("ВыполнениеДлительнойОперацииLMT", ПараметрыОбработчика.ТекущийИнтервал, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнениеДлительнойОперацииПочта()
	
	Ответ = ЗаданиеВыполнено(УникальныйИдентификаторЗадания);
	
	Парам = Новый Структура;
	Парам.Вставить("ИдентификаторЗадания", УникальныйИдентификаторЗадания);
	
	ФормаДлительнойОперации = ПолучитьФорму("Обработка.Renault_АРМ_ContactCenter.Форма.ДлительнаяОперация", Парам, ЭтаФорма, УникальныйИдентификаторЗадания);
	
	Если ОшибкаПолученияДанных Тогда
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = УникальныйИдентификаторЗадания Тогда
			ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		КонецЕсли;
		ОткрытьФорму("Обработка.Renault_АРМ_ContactCenter.Форма.ФормаОшибкиПолученияДанных");
	КонецЕсли;
	
	Если Ответ <> Неопределено и Ответ = Истина Тогда
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = УникальныйИдентификаторЗадания Тогда
			ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			ПолучитьДатуАктуальности();
		КонецЕсли;
		//ОбновитьСписокТрафика();
		//ОбновитьЧат();
		//ПрочитатьДанныеКлиента();
	ИначеЕсли Не ОшибкаПолученияДанных Тогда
		ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		ПодключитьОбработчикОжидания("ВыполнениеДлительнойОперацииПочта", ПараметрыОбработчика.ТекущийИнтервал, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации)
	
	Если ТипЗнч(ФормаДлительнойОперации) = Тип("УправляемаяФорма") Тогда
		Если ФормаДлительнойОперации.Открыта() Тогда
			ФормаДлительнойОперации.Закрыть();
		КонецЕсли;
	КонецЕсли;
	ФормаДлительнойОперации = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Функция ОткрытьФормуДлительнойОперации(Знач ВладелецФормы, Знач ИдентификаторЗадания, ЗаголовокФормы) 
	
	ФормаДлительнойОперации = ПолучитьФорму("Обработка.Renault_АРМ_ContactCenter.Форма.ДлительнаяОперация", , ЭтаФорма, ИдентификаторЗадания);
	Если ФормаДлительнойОперации.Открыта() Тогда
		ФормаДлительнойОперации = ОткрытьФорму(
			"Обработка.Renault_АРМ_ContactCenter.Форма.ДлительнаяОперация",
			Новый Структура("ИдентификаторЗадания, ЗаголовокФормы", ИдентификаторЗадания, ЗаголовокФормы), 
			ВладелецФормы);
	Иначе
		ФормаДлительнойОперации.ВладелецФормы        = ВладелецФормы;
		ФормаДлительнойОперации.ИдентификаторЗадания = ИдентификаторЗадания;
		ФормаДлительнойОперации.ЗаголовокФормы		 = ЗаголовокФормы;
		ФормаДлительнойОперации.Открыть();
	КонецЕсли;
	
	Возврат ФормаДлительнойОперации;
	
КонецФункции

&НаСервере
Процедура ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания)
	
	ПараметрыОбработчикаОжидания = Новый Структура(
		"МинимальныйИнтервал,МаксимальныйИнтервал,ТекущийИнтервал,КоэффициентУвеличенияИнтервала", 1, 15, 1, 1.4);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания) 
	
	ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.ТекущийИнтервал * ПараметрыОбработчикаОжидания.КоэффициентУвеличенияИнтервала;
	Если ПараметрыОбработчикаОжидания.ТекущийИнтервал > ПараметрыОбработчикаОжидания.МаксимальныйИнтервал Тогда
		ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.МаксимальныйИнтервал;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаданиеВыполнено(Знач ИдентификаторЗадания)
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	ОшибкаПолученияДанных = Ложь;
	Если Задание <> Неопределено
		И Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОперацияНеВыполнена = Истина;
	ПоказатьПолныйТекстОшибки = Ложь;
	Если Задание = Неопределено Тогда
		ОшибкаПолученияДанных = Истина;
	Иначе
		Если Задание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
			ОшибкаПолученияДанных = Истина;
		ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	//Если ОшибкаПолученияДанных Тогда
	//	Если ФормаДлительнойОперации.Открыта() 
	//		И ФормаДлительнойОперации.ИдентификаторЗадания = УникальныйИдентификаторЗадания Тогда
	//		ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
	//	КонецЕсли;
	//	ОткрытьФорму("Обработка.Renault_АРМ_ОнлайнКонсультант.Форма.ФормаОшибкиПолученияДанных");
	//КонецЕсли;
	
	//Если ПоказатьПолныйТекстОшибки Тогда
	//	ТекстОшибки = КраткоеПредставлениеОшибки(ПолучитьИнформациюОбОшибке(Задание.ИнформацияОбОшибке));
	//	ВызватьИсключение(ТекстОшибки);
	//ИначеЕсли ОперацияНеВыполнена Тогда
	//	ВызватьИсключение(НСтр("ru = 'Не удалось выполнить данную операцию. 
	//	                             |Подробности см. в Журнале регистрации.'"));
	//КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОтборДЦПриИзменении(Элемент)
	
	ОбновитьТаблицуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьЛид(Команда)
	
	Если НЕ ТрафикЛМТПочтаОтвеченный(ИДТрафика) Тогда
		ПоказатьПредупреждение( ,"Перез закрытием необходимо обработать лид!");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЕстьРЛПоТрафику() И НЕ ЗначениеЗаполнено(Лид.РабочийЛистПрикрепленый) И Лид_ВидКлассификация.Наименование <> "Сертификат контроля" Тогда
		
		ПараметрыОповещения = Новый Структура;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораСоздаватьРЛ", ЭтаФорма, ПараметрыОповещения);
		ПоказатьВопрос(ОписаниеОповещения, "По лиду не создан рабочий лист! Вы уверены, что хотите закрыть лид без создания рабочего листа?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ПараметрыОповещения = Новый Структура();
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораПричиныЗакрытияПриЗакрытииФормы", ЭтаФорма, ПараметрыОповещения);
		
		ОткрытьФорму("Справочник.Renault_РезультатОбработки.ФормаВыбора",,ЭтаФорма,,,,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьТрафик(Команда)
	
	Ответ = Вопрос("Вы уверены что хотите закрыть трафик?", РежимДиалогаВопрос.ДаНет, 0);
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗакрытьТрафикНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗакрытьТрафикНаСервере()
	
	Запись = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ИДТрафика);
	Запись.Обработан = Истина;
	Запись.Закрытый = Истина;
	Запись.Записать();
	
КонецПроцедуры

&НаСервере
Функция ЕстьРЛПоТрафику()
	
	РЛ = РеквизитФормыВЗначение("Объект").ПолучитьРабочийЛистПоТрафику(ИДТрафика);
	Возврат РЛ <> Неопределено;
	
КонецФункции

&НаСервере
Функция ТрафикЛМТПочтаОтвеченный(ИДТрафика)
	
	ЕстьОтвет = РеквизитФормыВЗначение("Объект").ТрафикЛМТПочтаОтвеченный(ИДТрафика);
	Возврат ЕстьОтвет;
	
КонецФункции

&НаКлиенте
Процедура ПослеВыбораСоздаватьРЛ(Результат, ПараметрыОповещения) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		//ПослеВыбораПричиныЗакрытияПриЗакрытииФормы(Справочники.Renault_РезультатОбработки.ПустаяСсылка(), Новый Структура);
		ПараметрыОповещения = Новый Структура();
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораПричиныЗакрытияПриЗакрытииФормы", ЭтаФорма, ПараметрыОповещения);
		//
		ОткрытьФорму("Справочник.Renault_РезультатОбработки.ФормаВыбора",,ЭтаФорма,,,, ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПричиныЗакрытияПриЗакрытииФормы(Значение, Параметры) Экспорт
	
	Если Значение <> Неопределено Тогда
		ПеренестиЛидВАрхив(Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПеренестиЛидВАрхив(Лид_ПричинаЗакрытия)
	
	ЛидСсылка = Документы.Renault_Лид.НайтиПоРеквизиту("ТрафикИД", ИДТрафика);
	ЛидОбъект = ЛидСсылка.ПолучитьОбъект();
	ЛидОбъект.ТрафикОбработан = Истина;
	ЛидОбъект.ДатаЗакрытия = ТекущаяДата();
	ЛидОбъект.РезультатОбработки = Лид_ПричинаЗакрытия;
	ЛидОбъект.Записать();
	
	Запись = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ИДТрафика);
	Запись.Обработан = Истина;
	Запись.Закрытый = Истина;
	Запись.Записать();
	
	//ОбновитьСостояниеЛида();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьИзмененияНаСервере()
	
	Запись = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ИДТрафика);
	Если Запись = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Запись.ТипТрафика = Справочники.CRM_ТипТрафика.ЛидRenault Тогда
		Лид = Документы.Renault_Лид.НайтиПоРеквизиту("ТрафикИД", ИДТрафика);
		Если ЗначениеЗаполнено(Лид) Тогда
			ЛидОбъект = Лид.ПолучитьОбъект();
			ЛидОбъект.ПримечаниеДилера = Лид_ПримечаниеДилера;
			//ЛидОбъект.КлиентФИО = Клиент_ФИО;
			ЛидОбъект.КлиентАдресЭлектроннойПочты = Клиент_Email;
			Клиент = ЛидОбъект.Клиент;
			Если ЗначениеЗаполнено(Клиент) Тогда
				КлиентОб = Клиент.ПолучитьОбъект();
				КлиентОб.Наименование = Клиент_ФИО;
				КлиентОб.Пол = Клиент_Пол;
				КлиентОб.Записать();
			КонецЕсли;
			//ЛидОбъект.кКлиентПол = Клиент_Пол;
			ЛидОбъект.КлиентДеньРождения = Клиент_ДР;
			ЛидОбъект.КлиентМобильныйТелефон = Клиент_Телефон;
			ЛидОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	
	СохранитьИзмененияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьГруппу(Команда)
	ГруппаФормы = Элементы["ГруппаШапка"+СтрЗаменить(Команда.Имя,"СвернутьГруппу","")];
	ГруппаФормы.Скрыть();
КонецПроцедуры

&НаКлиенте
Процедура Отказаться(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьОтказОтветственного", ЭтаФорма, СтрНайти(Команда.Имя, "НеЛид") = 0);
	ПоказатьВопрос(Оповещение,"Вы действительно хотите отказаться?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтказОтветственного(Параметр, ЭтоЛид) Экспорт
	
	Если Параметр = КодВозвратаДиалога.Да Тогда
		ЗаполнитьОтветственногоНаСервере(,ЭтоЛид);
		ЗакрытьСтраницу(ЭтаФорма.Команды.ЗакрытьСтраницу);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРЛ(Команда)
	
	// Трояновский К.Е. 07.08.2019 12:00:02 {
	//РЛ = Renault_КонтактЦентр_Общий.СоздатьРабочийЛистПоТрафику(ИДТрафика);
	РЛ = Renault_CRM.докСоздатьРабочийЛистПоТрафику(ИДТрафика);
	// Трояновский К.Е. 07.08.2019 12:00:02 }
	Если НЕ (РЛ = Неопределено) Тогда 
		// Трояновский К.Е. 07.08.2019 12:00:36 {
		//Форм = РЛ.ПолучитьФорму("ФормаЗаписи", , "ФормаЗаписи" + Строка(РЛ.IDK));		
		Форм = РЛ.ПолучитьФорму("ФормаДокумента", , "ФормаДокумента" + Строка(РЛ.IDK));
		// Трояновский К.Е. 07.08.2019 12:00:36 }
		Если Форм.Открыта() Тогда
			Форм.Активизировать();
		Иначе
			Форм.Открыть();
		КонецЕсли;
		//ЗакрытьТрафик(ИДТрафика, ПредопределенноеЗначение("Справочник.Renault_РезультатОбработки.СозданРабочийЛист"), ТипВыбранногоТрафика);
		//НачальноеОтображаениеЧатаИДанныхКлиента();
		//ОбновитьСписокТрафика();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРЛ(Команда)
	
	//РЛ = Renault_КонтактЦентр_Общий.НайтиРабочийЛистПоТрафику(ИДТрафика);
	РЛ = Renault_CRM.докНайтиРабочийЛистПоТрафику(ИДТрафика);
	Если НЕ (РЛ = Неопределено) Тогда 
		Форм = РЛ.ПолучитьФорму("ФормаДокумента", , "ФормаДокумента" + Строка(РЛ.IDK));
		Если Форм.Открыта() Тогда
			Форм.Активизировать();
		Иначе
			Форм.Открыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПриоритетПриИзменении(Элемент)
	
	ОбновитьТаблицуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЛидКонтекст(Команда)
	
	Если Элементы.ГруппаИсполнители.ТекущаяСтраница.Имя = "ГруппаТрафикМенеджер" Тогда
		Если Элементы.ГруппаСтрМенеджер.ТекущаяСтраница.Имя = "ГруппаМойТрафик" Тогда
			ИмяСписка = "СписокМойТрафик";
		ИначеЕсли Элементы.ГруппаСтрМенеджер.ТекущаяСтраница.Имя = "ГруппаВОбработкеМенеджер" Тогда
			ИмяСписка = "СписокВОбработке";
		ИначеЕсли Элементы.ГруппаСтрМенеджер.ТекущаяСтраница.Имя = "ГруппаВсеВходящие" Тогда
			ИмяСписка = "СписокВсеВходящие";
		ИначеЕсли Элементы.ГруппаСтрМенеджер.ТекущаяСтраница.Имя = "ГруппаВсеМенеджер" Тогда
			ИмяСписка = "СписокВсе";
		Иначе
			Возврат;
		КонецЕсли;
	ИначеЕсли Элементы.ГруппаИсполнители.ТекущаяСтраница.Имя = "ГруппаТрафикАдминистратор" Тогда
		Если Элементы.ГруппаСтрАдминистратор.ТекущаяСтраница.Имя = "ГруппаВходящие" Тогда
			ИмяСписка = "СписокВходящие";
		ИначеЕсли Элементы.ГруппаСтрАдминистратор.ТекущаяСтраница.Имя = "ГруппаНазначенные" Тогда
			ИмяСписка = "СписокНазначенные";
		ИначеЕсли Элементы.ГруппаСтрАдминистратор.ТекущаяСтраница.Имя = "ГруппаВОбработке" Тогда
			ИмяСписка = "СписокВОбработкеАдминистратор1";
		ИначеЕсли Элементы.ГруппаСтрАдминистратор.ТекущаяСтраница.Имя = "ГруппаВсе" Тогда
			ИмяСписка = "СписокВсеАдминистратор1";
		Иначе
			Возврат;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаОбработкаСообщений.Видимость = Истина;
	
	ТекДанные = Элементы[ИмяСписка].ТекущиеДанные;
	ДобавитьСтраницу(ТекДанные);
	
	//ОткрытьЛид(Элементы[ИмяСписка].ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтделПриИзменении(Элемент)
	
	ОбновитьТаблицуНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЛидПоТрафику(ИДТрафика)
	
	Возврат Документы.Renault_Лид.НайтиПоРеквизиту("ТрафикИД", ИДТрафика);
	
КонецФункции

&НаКлиенте
Процедура СкачатьИнструкцию(Команда)
	
	ЗапуститьПриложение("http://dms.renault.ru/support/LMT-doc-1.0.pdf");

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЧерныйСписок(Команда)
	
	Форма = РегистрыСведений.Renault_ЗаблокированныйТрафик.ПолучитьФормуСписка();
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРабочиеЛистыВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)

	Если Не(ВыбраннаяСтрока = Неопределено) Тогда
		
		СтандартнаяОбработка = Ложь;
		РЛ = Renault_CRM.докПолучитьЗаписьРЛПоIDK(Элемент.ТекущиеДанные.IDK);
		Форма = РЛ.ПолучитьФорму();
		
		Если Форма.Открыта() тогда
			Форма.Активизировать();
		Иначе
			Форма.Открыть();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЛидыВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)

	Если Не(ВыбраннаяСтрока = Неопределено) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если Найти(Колонка.Имя, "Лид") Тогда
			
			Если ТипЗнч(Элемент.ТекущиеДанные.Лид) = Тип("Число") Тогда
				РЛ = Renault_CRM.докПолучитьЗаписьРЛПоIDK(Элемент.ТекущиеДанные.Лид);
				Форма = РЛ.ПолучитьФорму();
			Иначе
				Форма = Элемент.ТекущиеДанные.Лид.ПолучитьФорму("ФормаДокумента");
			КонецЕсли;
			
			Если Форма.Открыта() тогда
				Форма.Активизировать();
			Иначе
				Форма.Открыть();
			КонецЕсли;
			
		ИначеЕсли Найти(Колонка.Имя, "Клиент") Тогда
			
			Если Элемент.ТекущиеДанные.Потенциальный Тогда
				Форма = Элемент.ТекущиеДанные.Клиент.ПолучитьФорму("ФормаЭлементаУпр");
			Иначе
				Форма = Элемент.ТекущиеДанные.Клиент.ПолучитьФорму("ФормаЭлемента");
			КонецЕсли;
			
			Если Форма.Открыта() тогда
				Форма.Активизировать();
			Иначе
				Форма.Открыть();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВернутьСворачиваемуюГруппу(Родитель)
	Группа = Элементы.Добавить("ГруппаШапка"+СчетчикСообщений,Тип("ГруппаФормы"),Родитель);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
	Группа.ЗаголовокСвернутогоОтображения = "Развернуть";
	Группа.Заголовок = Родитель.Заголовок;
	Группа.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
	Группа.Подсказка = "Развернуть данные клиента"; 
	Шрифт = Новый Шрифт(,);
	Группа.ШрифтЗаголовка = Шрифт;
	
	Возврат Группа;
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОткрытьЛид" Тогда
		Элементы.ГруппаОбработкаСообщений.Видимость = Истина;
		ДобавитьСтраницу(Параметр.ID);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура КлонироватьСтраницу(ИмяШаблона, НомерСтраницы, ВходящиеПараметры)
	ИсходныйШаблон = Элементы.Найти("Сообщение" + ИмяШаблона);
	
	НоваяСтраница = КлонироватьЭлемент(ИсходныйШаблон, СтрЗаменить(ИсходныйШаблон.Имя, ИмяШаблона, НомерСтраницы), ИсходныйШаблон.Родитель, ВходящиеПараметры);
	НоваяСтраница.Видимость = Истина;
	
	Для Каждого ПодчиненныйЭлемент Из ИсходныйШаблон.ПодчиненныеЭлементы Цикл
		КлонироватьПодчиненныеЭлементыРекурсивно(ПодчиненныйЭлемент, ИмяШаблона, НомерСтраницы, ВходящиеПараметры, НоваяСтраница);
	КонецЦикла;
	
	Элементы.ГруппаСообщения.ТекущаяСтраница = НоваяСтраница;
КонецПроцедуры

&НаСервере
Процедура КлонироватьПодчиненныеЭлементыРекурсивно(ИсходныйЭлемент, ИмяШаблона, НомерСтраницы, ВходящиеПараметры, НовыйРодитель)
	НовыйЭлемент = КлонироватьЭлемент(ИсходныйЭлемент, СтрЗаменить(ИсходныйЭлемент.Имя, ИмяШаблона, НомерСтраницы), НовыйРодитель, ВходящиеПараметры);
	
	Если ТипЗнч(ИсходныйЭлемент) = Тип("ГруппаФормы") Или ТипЗнч(ИсходныйЭлемент) = Тип("ТаблицаФормы") Тогда
		Для Каждого ПодчиненныйЭлемент Из ИсходныйЭлемент.ПодчиненныеЭлементы Цикл
			КлонироватьПодчиненныеЭлементыРекурсивно(ПодчиненныйЭлемент, ИмяШаблона, НомерСтраницы, ВходящиеПараметры, НовыйЭлемент);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция КлонироватьЭлемент(ИсходныйЭлемент, НовоеИмя, НовыйРодитель, ВходящиеПараметры)
	ТипЭлемента = ТипЗнч(ИсходныйЭлемент);	
	НовыйЭлемент = Элементы.Добавить(НовоеИмя, ТипЭлемента, НовыйРодитель);
	
	СписокСобытий = Новый Массив;
	
	Если ТипЭлемента = Тип("ГруппаФормы") Тогда
    	НовыйЭлемент.Вид = ИсходныйЭлемент.Вид;
		
		Если ИсходныйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа Тогда
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ИсходныйЭлемент,,"ПутьКДаннымЗаголовка");
		ИначеЕсли ИсходныйЭлемент.Вид = ВидГруппыФормы.Страницы Тогда
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ИсходныйЭлемент,, "ТекущаяСтраница");
			СписокСобытий.Добавить("ПриСменеСтраницы");
		ИначеЕсли ИсходныйЭлемент.Вид = ВидГруппыФормы.Страница Тогда
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ИсходныйЭлемент,, "ПутьКДаннымЗаголовка");
		ИначеЕсли ИсходныйЭлемент.Вид = ВидГруппыФормы.ГруппаКолонок Тогда
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ИсходныйЭлемент,, "ПутьКДаннымШапки");
		Иначе
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ИсходныйЭлемент);
		КонецЕсли;
	ИначеЕсли ТипЭлемента = Тип("ПолеФормы") Тогда
		НовыйЭлемент.Вид = ИсходныйЭлемент.Вид;
		
		Если ЗначениеЗаполнено(ИсходныйЭлемент.ПутьКДанным) Тогда
			НовыйЭлемент.ПутьКДанным = ИсходныйЭлемент.ПутьКДанным;
		КонецЕсли;

		Если ИсходныйЭлемент.Вид = ВидПоляФормы.ПолеВвода Тогда
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ИсходныйЭлемент,, "ВыделенныйТекст, СвязьПоТипу, ПутьКДанным");
			ЗаполнитьКоллекциюСвойств(НовыйЭлемент.СписокВыбора, ИсходныйЭлемент.СписокВыбора);
		ИначеЕсли ИсходныйЭлемент.Вид = ВидПоляФормы.ПолеПереключателя Тогда
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ИсходныйЭлемент,, "ПутьКДанным");
			ЗаполнитьКоллекциюСвойств(НовыйЭлемент.СписокВыбора, ИсходныйЭлемент.СписокВыбора);
		ИначеЕсли ИсходныйЭлемент.Вид = ВидПоляФормы.ПолеТекстовогоДокумента Тогда
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ИсходныйЭлемент,,"ВыделенныйТекст, ПутьКДанным");
		ИначеЕсли ИсходныйЭлемент.Вид = ВидПоляФормы.ПолеФорматированногоДокумента Тогда
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ИсходныйЭлемент,,"ВыделенныйТекст, ПутьКДанным");
		Иначе
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ИсходныйЭлемент,, "ПутьКДанным");
		КонецЕсли; 
		
		СписокСобытий.Добавить("ПриИзменении");
		СписокСобытий.Добавить("НачалоВыбора");
		СписокСобытий.Добавить("НачалоВыбораИзСписка");
		СписокСобытий.Добавить("Очистка");
		СписокСобытий.Добавить("Регулирование");
		СписокСобытий.Добавить("Открытие");
		СписокСобытий.Добавить("Создание");
		СписокСобытий.Добавить("ОбработкаВыбора");
		СписокСобытий.Добавить("ИзменениеТекстаРедактирования");
		СписокСобытий.Добавить("АвтоПодбор");
		СписокСобытий.Добавить("ОкончаниеВводаТекста");	
	ИначеЕсли ТипЭлемента = Тип("ТаблицаФормы") Тогда
		Если ЗначениеЗаполнено(ИсходныйЭлемент.ПутьКДанным) Тогда
			НовыйЭлемент.ПутьКДанным = ИсходныйЭлемент.ПутьКДанным;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, ИсходныйЭлемент,, "ПутьКДаннымКартинкиСтроки, ДополнительныеПараметрыСоздания, ЗапросОбновления, ПутьКДанным");

		СписокСобытий.Добавить("ПриИзменении");
		СписокСобытий.Добавить("Выбор");
		СписокСобытий.Добавить("ПриАктивизацииСтроки");
		СписокСобытий.Добавить("ВыборЗначения");
		СписокСобытий.Добавить("ПриАктивизацииПоля");
		СписокСобытий.Добавить("ПриАктивизацииЯчейки");
		СписокСобытий.Добавить("ПередНачаломДобавления");
		СписокСобытий.Добавить("ПередНачаломИзменения");
		СписокСобытий.Добавить("ПередУдалением");
		СписокСобытий.Добавить("ПриНачалеРедактирования");
		СписокСобытий.Добавить("ПередОкончаниемРедактирования");
		СписокСобытий.Добавить("ПриОкончанииРедактирования");
		СписокСобытий.Добавить("ОбработкаВыбора");
		СписокСобытий.Добавить("ПередРазворачиванием");
		СписокСобытий.Добавить("ПередСворачиванием");
		СписокСобытий.Добавить("ПриСменеТекущегоРодителя");
		СписокСобытий.Добавить("ОбработкаЗаписиНового");
		СписокСобытий.Добавить("ОбработкаЗапросаОбновления");
		СписокСобытий.Добавить("НачалоПеретаскивания");
		СписокСобытий.Добавить("ПроверкаПеретаскивания");
		СписокСобытий.Добавить("ОкончаниеПеретаскивания");
		СписокСобытий.Добавить("Перетаскивание");
	ИначеЕсли ТипЭлемента = Тип("КнопкаФормы") Тогда
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, ИсходныйЭлемент);
	ИначеЕсли ТипЭлемента = Тип("ДекорацияФормы") Тогда
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, ИсходныйЭлемент);
		
		СписокСобытий.Добавить("Нажатие");
		СписокСобытий.Добавить("НачалоПеретаскивания");
		СписокСобытий.Добавить("ПроверкаПеретаскивания");
		СписокСобытий.Добавить("ОкончаниеПеретаскивания");
		СписокСобытий.Добавить("Перетаскивание");
	КонецЕсли;
	
	Если СтрДлина(НовыйЭлемент.Заголовок) - СтрДлина(СтрЗаменить(НовыйЭлемент.Заголовок, "%", "")) = 2 Тогда
		НовыйЭлемент.Заголовок = Вычислить(СтрЗаменить(НовыйЭлемент.Заголовок, "%", ""));
	КонецЕсли;
		
	Для Каждого Событие Из СписокСобытий Цикл
		Попытка
			Обработчик = ИсходныйЭлемент.ПолучитьДействие(Событие);
			
			Если ЗначениеЗаполнено(Обработчик) Тогда
				НовыйЭлемент.УстановитьДействие(Событие, Обработчик);
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Возврат НовыйЭлемент;
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьКоллекциюСвойств(КоллекцияПриемник, КоллекцияИсточник) 
    
    Для Каждого Элемент Из КоллекцияИсточник Цикл
        ЗаполнитьЗначенияСвойств(КоллекцияПриемник.Добавить(), Элемент);
    КонецЦикла;
    
КонецПроцедуры

&НаСервере
Процедура НайтиСсылкуНаКонфигурациюКлиента()
	СсылкаНаКонфигурациюКлиента = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсторияПерепискиСКлиентом.Сообщение КАК Сообщение,
		|	ИсторияПерепискиСКлиентом.Период КАК Период
		|ИЗ
		|	РегистрСведений.Renault_ИсторияПерепискиСКлиентом КАК ИсторияПерепискиСКлиентом
		|ГДЕ
		|	ИсторияПерепискиСКлиентом.Объект = &Объект
		|	И НЕ ИсторияПерепискиСКлиентом.ЭтоОтветДилера
		|	И ИсторияПерепискиСКлиентом.Сообщение ПОДОБНО &ТекстСсылки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	Запрос.УстановитьПараметр("ТекстСсылки","%https://ru.co.rplug.renault.com/%");
	Запрос.УстановитьПараметр("Объект",Документы.Renault_Лид.НайтиПоРеквизиту("ТрафикИД", ИДТрафика));
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	если ВыборкаДетальныеЗаписи.Следующий() тогда
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		ТекстСсылки = "";
		ПозицияНачалоСсылки = СтрНайти(НРег(ВыборкаДетальныеЗаписи.Сообщение), "https://ru.co.rplug.renault.com/");
		
		Если ПозицияНачалоСсылки > 0 Тогда
			ТекстСсылки = СокрЛП(Сред(ВыборкаДетальныеЗаписи.Сообщение, ПозицияНачалоСсылки));
			
			ТекстСсылки = СтрЗаменить(ТекстСсылки, " ", Символы.ПС);
			ТекстСсылки = СтрЗаменить(ТекстСсылки, Символы.НПП, Символы.ПС);
			ТекстСсылки = СтрПолучитьСтроку(ТекстСсылки, 1);
			
			СсылкаНаКонфигурациюКлиента = ТекстСсылки;
					
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПолеСсылкаНаКонфигурациюШаблон2Нажатие(Элемент) // DMSREN-1217
	ЗапуститьПриложение(СсылкаНаКонфигурациюКлиента);
КонецПроцедуры

&НаСервере
Процедура ПрикрепитьКРЛНаСервере()
	
	ЗаписьТрафик = Renault_CRM.ПолучитьЗаписьТрафикаПоID(ИДТрафика);
		
		Если ЗаписьТрафик <> Неопределено Тогда
							
				Если ЗначениеЗаполнено(ВыбранныйРЛДляПрикрепления) Тогда			
					
					ЗаписьТрафик.ПервичныйПовторный = Перечисления.CRM_ПервичныйПовторный.Повторный;
					//Заполнить клиента в трафике
					ЗаписьТрафик.Клиент = ВыбранныйРЛДляПрикрепления.Клиент;
					//Отметить трафик как закрытый
					ЗаписьТрафик.Обработан = Истина;
					//Обновим менеджера (или останется тот же, или перекинется на того, кто в рабочем листе
					ЗаписьТрафик.Менеджер = ВыбранныйРЛДляПрикрепления.Сотрудник;
					// собственно, связь с рабочим листом
					ЗаписьТрафик.РабочийЛист = ВыбранныйРЛДляПрикрепления;
					
					ЗаписьТрафик.Записать();
					СоздатьСобытиеПрикрепленияПовторногоТрафика(ВыбранныйРЛДляПрикрепления.IDK);
					
					Если ЗначениеЗаполнено(Лид) тогда
						ОбъектЛид = Лид.ПолучитьОбъект();
						ОбъектЛид.РабочийЛистПрикрепленый = ВыбранныйРЛДляПрикрепления;
						ОбъектЛид.Записать();
					КонецЕсли;
					
				КонецЕсли;
		КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьКРЛ(Команда)
	
	Если Не ЗначениеЗаполнено(Лид.РабочийЛистПрикрепленый) тогда
		ПрикрепитьКРЛНаСервере();
		Предупреждение("Лид прикреплен к РЛ №" + ВыбранныйРЛДляПрикрепления.IDK);
		ТекСтр = Элементы.ГруппаСообщения.ТекущаяСтраница.Имя;
		ОбновитьДанные(ТекСтр);
	иначе
		Форм = Лид.РабочийЛистПрикрепленый.ПолучитьФорму("ФормаДокумента");
		Форм.Открыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТЗЛШаблон2ПриАктивизацииСтроки(Элемент)
	// { Установим доступность кнопки прикрепления в зависимости от того выбран ли в истории РЛ

	если ЗначениеЗаполнено(Лид.РабочийЛистПрикрепленый) тогда 
		возврат; 
	КонецЕсли;
	ВыбранныйРЛДляПрикрепления = Элемент.ТекущиеДанные.РабочийЛист;
	КнопкаПрикрепленияРЛ = Элементы.Найти(СтрЗаменить(Элемент.Имя,"ТЗЛ","ПрикрепитьКРЛ"));
	если КнопкаПрикрепленияРЛ <> неопределено тогда
			КнопкаПрикрепленияРЛ.Доступность = ЗначениеЗаполнено(ВыбранныйРЛДляПрикрепления);
	КонецЕсли;
	// }
КонецПроцедуры

&НаСервере
Процедура СоздатьСобытиеПрикрепленияПовторногоТрафика(м_РабочийЛист)
	
	ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
	
	Док = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
	Док.ОбменДанными.Загрузка = Истина;
	Док.Дата = ТекущаяДата();
	Док.Автор = ПараметрыСеанса.Пользователь;
	Док.Сотрудник = ПараметрыСеанса.Пользователь;
	Док.IDK = м_РабочийЛист;
	Док.ВидСобытия = Справочники.CRM_ВидыСобытий.Прикреплен;
	Док.Комментарий = "Прикреплен лид от " + Лид.ДатаЗаогрузки;
	Док.ДилерскийЦентр = ДилерскийЦентр;
	Док.ЛидПрикрепленный = Лид;
	Док.Обработано = Истина;
	Попытка
		Док.Записать();
	Исключение
		ЗаписьЖурналаРегистрации(Документы.CRM_СобытияПоРабочимЛистам, 
        УровеньЖурналаРегистрации.Ошибка, , ,
        "Ошибка записи документа");
	КонецПопытки;
	
	Запись = РегистрыСведений.Renault_СтатистикаВыполненияЭтаповПродаж.СоздатьМенеджерЗаписи();
	Запись.IDK = м_РабочийЛист;
	Запись.ДатаВыполнения = ТекущаяДата();
	Запись.ДилерскийЦентр = ДилерскийЦентр;
	Запись.Записать();
	
КонецПроцедуры



