// Семенихин 05.11.2024 +++++
Процедура ПередЗаписью(Отказ, Замещение)
	// проверка для предотвращения попытки полной очистки регистра
	Если ЭтотОбъект.Количество() = 0 Тогда
		Если ОбЗначениеНеЗаполнено(ЭтотОбъект.Отбор.Автомобиль.Значение) И
			ОбЗначениеНеЗаполнено(ЭтотОбъект.Отбор.ВидЗначения.Значение) Тогда
			СтрокаОтказа = "ВНИМАНИЕ! Отменена попытка полной очистки регистра!";
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

	Для Каждого Запись Из ЭтотОбъект Цикл
		Если ОбЗначениеНеЗаполнено(Запись.Автомобиль) Тогда
			Отказ = Истина;
			СтрокаОтказа = "Не заполнено поле ""Автомобиль"". Запись Характеристики автомобиля невозможна!";
			Прервать;
		КонецЕсли; 
		
		Если Запись.Автомобиль.ЭтоГруппа Тогда
			Отказ = Истина;
			СтрокаОтказа = "Нельзя использовать группу в качестве объекта Характеристики автомобилей.";
			Прервать;
		КонецЕсли;
		
		Если ОбЗначениеНеЗаполнено(Запись.ВидЗначения) Тогда
			Отказ = Истина;
			СтрокаОтказа = "Не заполнено поле ""ВидЗначения"". Запись Характеристики автомобиля невозможна!";
			Прервать;
		КонецЕсли;
		
		Если ОбЗначениеНеЗаполнено(Запись.Значение) И ТипЗнч(Запись.Значение) <> Тип("Булево") И ТипЗнч(Запись.Значение) <> Тип("Число") Тогда
			Отказ = Истина;
			СтрокаОтказа = "Не заполнено значение Характеристики автомобиля " + Строка(Запись.ВидЗначения) + ". Запись невозможна!";
			Прервать;
		КонецЕсли;
		
		Запись.КтоВнес = ПараметрыСеанса.Пользователь;
		Запись.КогдаВнес = ТекущаяДата();
	КонецЦикла;
	
	Если Отказ Тогда
		Сообщить(СтрокаОтказа);
	КонецЕсли; 
КонецПроцедуры
// Семенихин 05.11.2024 -----