
Функция СМГ_НайтиПоПодразделениюИКомпьютеру(ПодразделениеОрганизации, Компьютер=Неопределено) Экспорт
	
	//Бондаренко++ 20251118
	Если Не обПраво("ОпределениеККМпоОрганизации") Тогда
	//Бондаренко-- 20251118	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КассыККМ.Ссылка
		|ИЗ
		|	Справочник.КассыККМ КАК КассыККМ
		|ГДЕ
		|	КассыККМ.Компьютер = &Компьютер
		|	И КассыККМ.Подразделение = &Подразделение";
		
		Если Компьютер = Неопределено Тогда 
			Компьютер = ПараметрыСеанса.Компьютер; 
		КонецЕсли;
		Запрос.УстановитьПараметр("Компьютер", Компьютер);
		Запрос.УстановитьПараметр("Подразделение", ПодразделениеОрганизации);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;          
	//Бондаренко++ 20251118
	КонецЕсли;
	//Бондаренко-- 20251118
 	
	//Бондаренко++ 20240217
	Если обПраво("ОпределениеККМпоОрганизации") Тогда
		КассаККМ = Неопределено;
		КассаККМ = СМГ_НайтиКассыПоОрганизации(ПодразделениеОрганизации);
		Если КассаККМ <> Неопределено Тогда
			Возврат КассаККМ;
		КонецЕсли;
	КонецЕсли;
	//Бондаренко-- 20240217
	
	Возврат Неопределено;
  	
КонецФункции 

Функция СМГ_НайтиКассыПоОрганизации(ПодразделениеОрганизации) Экспорт
	
 	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоступныеКассыККМ.Сотрудник КАК Сотрудник,
	|	ДоступныеКассыККМ.Организация КАК Организация,
	|	ДоступныеКассыККМ.КассаККМ КАК КассаККМ
	|ИЗ
	|	РегистрСведений.ДоступныеКассыККМ КАК ДоступныеКассыККМ
	|ГДЕ
	|	ДоступныеКассыККМ.Сотрудник = &Сотрудник
	|	И ДоступныеКассыККМ.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", ПодразделениеОрганизации.Организация);
	Запрос.УстановитьПараметр("Сотрудник", ПараметрыСеанса.Пользователь.Сотрудник);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если ТЗ.Количество() = 0 Тогда
		Возврат Неопределено;
	ИначеЕсли ТЗ.Количество() = 1 Тогда
		Возврат ТЗ[0].КассаККМ;
	Иначе	
	    // Надо выбирать кассу
		СЗ = Новый СписокЗначений;
		
		Для каждого Стр Из ТЗ Цикл
		    СЗ.Добавить(Стр.КассаККМ); 
		КонецЦикла;	
		
		ВыбЭлемент = СЗ.ВыбратьЭлемент("Выберите кассу...",ВыбЭлемент);
		
		Если ВыбЭлемент <> Неопределено Тогда
 			Возврат ВыбЭлемент.Значение;
		Иначе
			Возврат Неопределено;
 		КонецЕсли;
 		 
	КонецЕсли;
 	
КонецФункции //СМГ_НайтиКассыПоОрганизации(Организация) 

 