Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ЗаполнитьЗначенияСвойств(ЭтаФорма,Параметры);
	Если Параметры.Свойство("Сервис") Тогда Сервис=Параметры.Сервис КонецЕсли;
	Если Параметры.Свойство("ТипСервиса") Тогда ТипСервиса=Параметры.ТипСервиса КонецЕсли;
	Если Параметры.Свойство("ФиксированнаяСтоимость") Тогда ФиксированнаяСтоимость=Параметры.ФиксированнаяСтоимость КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура кнОК(Команда) Закрыть(Новый Структура("Сервис,ТипСервиса,ФиксированнаяСтоимость",Сервис,ТипСервиса,ФиксированнаяСтоимость)) КонецПроцедуры
