Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Статус) Тогда
		Сообщить("Не указан статус документа!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	РазрешеноИзменятьСтатус = РазрешеноИзменятьСтатус();
	Если НЕ РазрешеноИзменятьСтатус Тогда
		Если ЭтоНовый() Тогда
			Если Статус = Перечисления.Renault_СтатусыПредложенийОВыкупеТрейдИн.Утвержден Тогда
				Сообщить("Нет прав на утверждение документа!");
				Отказ = Истина;
			КонецЕсли;
		Иначе
			Если Статус <> Ссылка.Статус Тогда
				Сообщить("Нет прав на изменение статуса документа!");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры    

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Функция РазрешеноИзменятьСтатус() Экспорт
	Права = ПараметрыСеанса.Renault_ПраваПользователя;
	
	Возврат Права.РазрешитьИзменятьСтатусПредложенийОВыкупеТрейдИн;
КонецФункции
