
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ЗакрыватьПриВыборе = Истина;
	ЭтаФорма.Заголовок = "Выбор номенклатуры для рекламации из " + Параметры.Поступление;
	
	Поступление = Параметры.Поступление;
	
	ЗаполнитьТоварамиИзПоступления();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварамиИзПоступления()
	ТоварыИзПоступления.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Поступление);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеТоваровТовары.НомерСтроки КАК НомерСтроки,
	               |	ПоступлениеТоваровТовары.Номенклатура,
	               |	ПоступлениеТоваровТовары.Количество,
	               |	ПоступлениеТоваровТовары.ЕдиницаИзмерения,
	               |	ПоступлениеТоваровТовары.Коэффициент,
	               |	ПоступлениеТоваровТовары.Цена,
	               |	ПоступлениеТоваровТовары.ХарактеристикаНоменклатуры,
	               |	ПоступлениеТоваровТовары.СуммаВсего
	               |ИЗ
	               |	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
	               |ГДЕ
	               |	ПоступлениеТоваровТовары.Ссылка = &Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТоварыИзПоступления.Добавить(),Выборка);	
	КонецЦикла;
	
	ВидимостьХарактеристики = Ложь;
	Для каждого стр Из ТоварыИзПоступления Цикл
		Если ЗначениеЗаполнено(стр.ХарактеристикаНоменклатуры) Тогда
			ВидимостьХарактеристики = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ТоварыХарактеристикаНоменклатуры.Видимость = ВидимостьХарактеристики;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элементы.Товары.ТекущиеДанные<>Неопределено Тогда
		ВыбранаНоменклатура(Элементы.Товары.ТекущиеДанные.НомерСтроки);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбрать(Команда)
	Если Элементы.Товары.ТекущиеДанные<>Неопределено Тогда
		ВыбранаНоменклатура(Элементы.Товары.ТекущиеДанные.НомерСтроки);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбранаНоменклатура(НомерСтроки)
	ДанныеЗаполнения = Новый Структура("Поступление,НомерСтрокиИзПоступления",Поступление,НомерСтроки);
	ПФ = Новый Структура("Основание",ДанныеЗаполнения);
	ОткрытьФорму("Документ.Renault_Рекламация.ФормаОбъекта",ПФ,,Новый УникальныйИдентификатор);
	
	Закрыть();
КонецПроцедуры


