
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Если Не ЗначениеЗаполнено(Объект.Владелец) Тогда
	//	Объект.Владелец=Справочники.Renault_КредитныеПредложения.РНБанк();
	//КонецЕсли;	
	
	//Запрос=Новый Запрос;
	//Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
	//Запрос.Текст="
	//|Выбрать Различные Модель
	//|Из РегистрСведений.ТарифНаКомплектацииАвтомобилей.СрезПоследних
	//|ГДЕ
	//|	ДоступноКЗаказуВПроизводство
	//|	И Тариф В(
	//|		Выбрать Ссылка Из Справочник.ТарифыНаАвтомобили 
	//|		ГДЕ 
	//|			Активен	
	//|			И Страна.Код=""643""
	//|			И (&ТекДата Между НачалоДействия И ОкончаниеДействия
	//|			ИЛИ (&ТекДата>=НачалоДействия И ОкончаниеДействия=ДатаВремя(1,1,1,0,0,0)))
	//|	)
	//|Упорядочить ПО Модель.Наименование
	//|";
	////Элементы.Модель.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Модель"));
	//Для Каждого Стр Из Запрос.Выполнить().Выгрузить() Цикл
	//	Элементы.Модель.СписокВыбора.Добавить(Стр.Модель,""+Стр.Модель+" ("+Стр.Модель.Артикул+")")
	//КонецЦикла;
	
	УправлениеЭлементами();
	
КонецПроцедуры

Процедура УправлениеЭлементами()
	Элементы.Модели.Доступность=Объект.ВидУслуги.НеобходимОбъектСтрахования;
КонецПроцедуры	

&НаКлиенте
Процедура ВидУслугиПриИзменении(Элемент) УправлениеЭлементами() КонецПроцедуры
