Перем ВыборкаКоммерческихПредложений;
Перем BIR;
Перем ПланОбмена;

Перем АдресСервераWS;
Перем ПользовательСервераWS;
Перем ПарольСервераWS;

Перем Обработчик;

Процедура ОбработкаНаСервере() Экспорт
	
	BIR = Renault_ОбщийМодуль.ПолучитьBIRБазыДанных();
	//*//СокрЛП(Renault_ОбщийМодуль.ПолучитьИдентификатор(НастройкаОбмена.Организация));
	
	Если НЕ ЗначениеЗаполнено(BIR) тогда
		Renault_Открытый.СообщитьПользователю("Не заполнен BIR3M для организации " + 
			НастройкаОбмена.Организация.Наименование + ". Отправка коммерческих предложений прервана.",
			СтатусСообщения.ОченьВажное, //Статус для сообщения пользователю
			ЭтотОбъект, //Для установки объекта в журнал регистрации
			УровеньЖурналаРегистрации.Ошибка, //Уровень журнала регистрации
			, //Метаданные для журнала регистрации
			НастройкаОбмена.Организация //Ссылка на объект для журнала регистрации
			);
		Возврат;
		
	КонецЕсли;
	
	ПланОбмена = НастройкаОбмена.ПланОбмена;
	
	МассивКоммПредложений = ПолучитьИзмененияИзПланаОбмена();
	
	Если НЕ МассивКоммПредложений.Количество() = 0 тогда
		
		ПолучитьОбработчикССервера();
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	Если Обработчик = Неопределено тогда
		
		Renault_Открытый.СообщитьПользователю(
		"Не удалось получить обработчик ""commoffer"" По причине:" + Символы.ПС + ОписаниеОшибки() + " Отправка коммерческих предложений прервана.",
			СтатусСообщения.ОченьВажное, //Статус для сообщения пользователю
			ЭтотОбъект, //Для установки объекта в журнал регистрации
			УровеньЖурналаРегистрации.Ошибка, //Уровень журнала регистрации
			, //Метаданные для журнала регистрации
			НастройкаОбмена.Организация //Ссылка на объект для журнала регистрации
			);
			
		Возврат
		
	КонецЕсли;
	
	//Если Все еще тут, значит все прошло нормально - Можно работать.
	ПодготовитьОбработчик(Обработчик);
	
		//Специфичные
	Попытка
	
		Обработчик.МассивПредложений = МассивКоммПредложений;
		Обработчик.BIR				 = BIR;
		
	Исключение КонецПопытки;
	
	Результат = Обработчик.ОтправитьДанные();
	
	Если Результат Тогда //Регистрация прошла успешно. Нужно удалить регистрацию объектов в плане обмена
		
		ПланыОбмена.УдалитьРегистрациюИзменений(ПланОбмена);
		
	КонецЕсли;
	
КонецПроцедуры

////@+ Функция ПолучитьИзмененияИзПланаОбмена()
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Функция ТипФункции=""
//         ИнструкцииПрепроцессору=""
//         ДатаCоздания="21.06.2013 12:16:05" Автор="Окипний Андрей Евгеньевич">
// <Имя>ПолучитьИзмененияИзПланаОбмена()</Имя>
//
// <Описание>
//  <!-- Вставить описание -->
// </Описание>
//
// </Параметры>
//  <!-- Без параметров -->
//
//  <Результат>
//  	<ИмяРезультата>МассивКоммПредложений</ИмяРезультата>
//  	<ТипРезультата><!-- Укажите тип возвращаемого параметра --></ТипРезультата>
//  	<ОписаниеРезультата><!-- описание результата -->
//                 <!-- продолжение описания результата --></ОписаниеРезультата>
//  </Результат>
//</Функция>
//</Автодок>
//</xml>
//@-
Функция ПолучитьИзмененияИзПланаОбмена()
	
	//Первоначальная инициализация
	МассивКоммПредложений = Новый Массив;
	
	// Комментарий 
	//Дата создания - 21.06.2013 12:18:45; Автор - Окипний Андрей Евгеньевич
	//
	//Нужно создать фиктивную запись файла XML.
	//базе этого из плана обмена не выковырять изменения.
	//
	ФайлДанных = ПолучитьИмяВременногоФайла("xml");
	
	Запись_XML = Новый ЗаписьXML;
	Запись_XML.ОткрытьФайл(ФайлДанных);
	Запись_XML.ЗаписатьОбъявлениеXML();
	
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	ЗаписьСообщения.НачатьЗапись(Запись_XML, ПланОбмена);
	
	//Получаем данные из плана обмена
	Выборка = ПланыОбмена.ВыбратьИзменения(ЗаписьСообщения.Получатель, ЗаписьСообщения.НомерСообщения);
	
	//Пробежимся по выборке и распределим данные по массивам
	Пока Выборка.Следующий() Цикл
		
		Данные = Выборка.Получить();
		
		МассивКоммПредложений.Добавить(Данные.Ссылка);
		
	КонецЦикла;
	
	Возврат МассивКоммПредложений;
	
КонецФункции // ПолучитьИзмененияИзПланаОбмена()

////@+ Процедура ПолучитьОбработчикССервера()
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Процедура ТипПроцедуры=""
//           ИнструкцииПрепроцессору=""
//           ДатаCоздания="21.06.2013 14:03:27" Автор="Окипний Андрей Евгеньевич">
// <Имя>ПолучитьОбработчикССервера()</Имя>
//
// <Описание>
//  <!-- Вставить описание -->
// </Описание>
// </Параметры>
//  <!-- Без параметров -->
//</Процедура>
//</xml>
//@-
Процедура ПолучитьОбработчикССервера()
	
	ОбработкаПолученияОбработчиков = Обработки.Renault_GetBin_WS.Создать();
	ПодготовитьОбработчик(ОбработкаПолученияОбработчиков);
	
	Обработчик = ОбработкаПолученияОбработчиков.ПолучитьОбработчик("commoffer");
	
КонецПроцедуры // ПолучитьОбработчикССервера()

////@+ Процедура ПодготовитьОбработчик()
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Процедура ТипПроцедуры=""
//           ИнструкцииПрепроцессору=""
//           ДатаCоздания="24.06.2013 11:34:48" Автор="Окипний Андрей Евгеньевич">
// <Имя>ПодготовитьОбработчик()</Имя>
//
// <Описание>
//  <!-- Вставить описание -->
// </Описание>
// </Параметры>
//  <!-- Без параметров -->
//</Процедура>
//</xml>
//@-
Процедура ПодготовитьОбработчик(Обработка)
	
	//Реквизиты которые обязательно есть во всех обработках для работы с WS
	Обработка.АдресWS	 = СокрЛП(АдресСервераWS);
	Обработка.ЛогинWS	 = СокрЛП(ПользовательСервераWS);
	Обработка.ПарольWS	 =  СокрЛП(ПарольСервераWS);
	
КонецПроцедуры // ПодготовитьОбработчик()

АдресСервераWS			 = Константы.Renault_АдресWebСервисов.Получить();
ПользовательСервераWS	 = Константы.Renault_ЛогинВебСервиса.Получить();
ПарольСервераWS			 = Константы.Renault_ПарольВебСервиса.Получить();