//////////////////////////////////////////////////////////////////////////////// 
// Модуль определяет "интерфейс" для обработки ОбновлениеКонфигурации, состоящий 
// из переопределяемых процедур и функций. Изменению подлежит код процедур и функций
// (реализация "интерфейса"), который разрабатывается под конкретную конфигурацию.

//////////////////////////////////////////////////////////////////////////////// 
// ФУНКЦИИ ДЛЯ ОБРАБОТКИ СОБЫТИЙ ПРОЦЕДУРЫ ОБНОВЛЕНИЯ
// 

// Проверить, что информационную базу можно обновить.
// Например, если выясняется, что обновление конфигурации не пройдет или 
// будет идти с проблемами, то пользователю выдается предупреждение, и 
// предлагается самостоятельно устранить причины, после чего 
// повторить попытку обновления.
//
// Параметры
//   ВыдаватьСообщения  – Булево – определяет, может ли функция выводить 
//                                 сообщения/диалоги или от нее требуется 
//                                 вернуть только результат проверки.
//
// Возвращаемое значение:
//   Булево   – признак готовности ИБ к проведению обновления.
//
// Пример реализации:
// 
//	Результат = ПроверитьКорректностьДанных();
//	Если НЕ Результат И ВыдаватьСообщения Тогда
//		Предупреждение("Конфигурация не может быть обновлена, так как ...");
//	КонецЕсли; 
//	Возврат Результат;
//
Функция ГотовностьКОбновлениюКонфигурации(Знач ВыдаватьСообщения) Экспорт
	Возврат Истина;	// результат по умолчанию
КонецФункции 

// Возвращает Истина, если при первом запуске системы необходимо выполнить 
// подключение к Интернету и проверить обновление.
//
// Возвращаемое значение:
//   Булево   - признак необходимости выполнения проверки обновления через
//              Интернет.
//
Функция ПроверятьОбновлениеЧерезИнтернетПриПервомЗапуске() Экспорт
	Возврат Ложь; // значение по умолчанию
КонецФункции
 
//////////////////////////////////////////////////////////////////////////////// 
// ФУНКЦИИ ДЛЯ ПРОВЕРКИ НАЛИЧИЯ И ПОЛУЧЕНИЯ ОБНОВЛЕНИЙ
// 

// Получить адрес веб-страницы с информацией о том, как получить доступ к 
// пользовательскому разделу на сайте поставщика конфигурации.
//
// Возвращаемое значение:
//   Строка   – адрес веб-страницы.
//
Функция АдресСтраницыИнформацииОПолученииДоступаКПользовательскомуСайту() Экспорт
	Возврат "http://users.v8.1c.ru/Rules.aspx";
КонецФункции 

// Получить имя файла с информацией о доступном обновлении на сайте поставщика
// конфигурации.
//
// Возвращаемое значение:
//   Строка   – имя файла.
//
Функция ИмяФайлаПроверкиНаличияОбновления(Знач ВерсияПроверкиОбновления = Неопределено) Экспорт
	
	ИмяФайла = "UpdInfo.txt";
	//ИмяФайла = "1.1.1.1";
	Возврат ИмяФайла;
	
КонецФункции

// Получить имя файла с информацией о доступном обновлении на сайте поставщика
// конфигурации.
//
// Возвращаемое значение:
//   Строка   – имя файла.
//
Функция ИмяZipФайлаСпискаШаблонов(Знач ВерсияПроверкиОбновления = Неопределено) Экспорт
	
	ИмяФайла = "v8upd11.zip";
	Возврат ИмяФайла;
	
КонецФункции

// Получить имя файла с информацией о описании обновления на сайте поставщика
// конфигурации.
//
// Возвращаемое значение:
//   Строка   – имя файла.
//
Функция ИмяФайлаОписанияОбновления(Знач ВерсияПроверкиОбновления = Неопределено) Экспорт
	
	ИмяФайла = "news.htm";
	Возврат ИмяФайла;
	
КонецФункции

// Получить имя файла с информацией о описании обновления на сайте поставщика
// конфигурации.
//
// Возвращаемое значение:
//   Строка   – имя файла.
//
Функция ИмяФайлаПорядкаОбновления(Знач ВерсияПроверкиОбновления = Неопределено) Экспорт
	
	ИмяФайла = "update.htm";
	Возврат ИмяФайла;
	
КонецФункции

// Получить короткое имя (идентификатор) конфигурации.
//
// Возвращаемое значение:
//   Строка   – короткое имя конфигурации.
//
Функция КороткоеИмяКонфигурации() Экспорт
	
#Если ТолстыйКлиентОбычноеПриложение Тогда
	Возврат "DMS";
#Иначе
	Возврат "";
#КонецЕсли
	
КонецФункции 

// Получить адрес веб-сервера поставщика конфигурации, на котором находится
// информация о доступных обновлениях.
//
// Возвращаемое значение:
//   Строка   – адрес веб-сервера.
//
// Пример реализации:
// 
//	Возврат "localhost";  // локальный веб-сервер для тестирования.
//
Функция АдресСервераДляПроверкиНаличияОбновления() Экспорт
	//Возврат "217.23.136.84/reporthub/dms/release/download/";
	Возврат "217.23.136.84";
КонецФункции 

// Получить адрес страницы на веб-сервере поставщика конфигурации, на которой находится
// информация о доступных обновлениях.
//
// Возвращаемое значение:
//   Строка   – адрес веб-страницы.
//
// Пример реализации:
// 
//	Возврат "/1c.ru/buhplace/ITSREPV/V8Update/Configs/" + КороткоеИмяКонфигурации() + "/";  
//
Функция АдресРесурсовДляПроверкиНаличияОбновления(ВерсияПроверкиОбновления = Неопределено, ПроверитьОбновленияДля83 = Ложь) Экспорт
	
	//ЗачитыватьИзНастройки = Истина;
	//Результат = ПолучитьНастройкуПоИмени("АдресРесурсовДляПроверкиНаличияОбновления", ЗачитыватьИзНастройки);
	//
	//Если НЕ ЗначениеЗаполнено(Результат) Тогда
	//	//Результат = "/ipp/ITSREPV/V8Update/Configs/" + КороткоеИмяКонфигурации() + "/";
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(ВерсияПроверкиОбновления) Тогда
	//	//Версия редакции для проверки наличия обновления задана явно
	//	Результат = Результат + ВерсияПроверкиОбновления + "/";
	//Иначе
	//	// Определение редакции конфигурации
	//	ПодстрокиВерсии = Renault_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Метаданные.Версия, ".");
	//	Если ПодстрокиВерсии.Количество() > 1 Тогда
	//		Результат = Результат + ПодстрокиВерсии[0] + ПодстрокиВерсии[1] + "/";
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Если ПроверитьОбновленияДля83 Тогда
	//	Результат = Результат + "83/";
	//Иначе
	//	// Определение версии платформы
	//	СисИнфо = Новый СистемнаяИнформация;
	//	ПодстрокиВерсии = Renault_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СисИнфо.ВерсияПриложения, ".");
	//	Если Число(ПодстрокиВерсии[0]) >= 8 И Число(ПодстрокиВерсии[1]) >= 2 Тогда
	//		Результат = Результат + ПодстрокиВерсии[0] + ПодстрокиВерсии[1] + "/";
	//	КонецЕсли;
	//КонецЕсли;
	//Возврат Результат;
	
	Возврат "/reporthub/media/dms_releases/";
	
КонецФункции 

// Получить адрес сервера обновлений.
//
// Возвращаемое значение:
//   Строка   – адрес веб-сервера.
//
// Пример реализации:
// 
//	Возврат "localhost";  // локальный веб-сервер для тестирования.
//
Функция АдресСервераОбновлений() Экспорт
	
	// По умолчанию используем адрес, указанный в свойствах конфигурации.
	СерверОбновлений = СтрЗаменить(Метаданные.АдресКаталогаОбновлений, "http://", "");  
	Позиция = Найти(СерверОбновлений, "/");
	Если Позиция > 0 Тогда
		СерверОбновлений = Лев(СерверОбновлений, Позиция - 1);
	КонецЕсли;
	Возврат СерверОбновлений;

КонецФункции 

// Получить адрес каталога файлов обновления на сервере обновлений.
//
// Возвращаемое значение:
//   Строка   – адрес каталога на веб-сервере.
//
Функция АдресКаталогаШаблоновНаСервереОбновлений() Экспорт
	
	// По умолчанию используем адрес, указанный в свойствах конфигурации.
	СерверОбновлений = СтрЗаменить(Метаданные.АдресКаталогаОбновлений, "http://", "");  
	Позиция = Найти(СерверОбновлений, "/");
	Если Позиция > 0 Тогда
		КаталогШаблоновНаСервере = Сред(СерверОбновлений, Позиция, СтрДлина(СерверОбновлений));
		Если Прав(КаталогШаблоновНаСервере, 1) = "/" Тогда
			КаталогШаблоновНаСервере = Сред(КаталогШаблоновНаСервере, 1, СтрДлина(КаталогШаблоновНаСервере));
		КонецЕсли;
	Иначе
		КаталогШаблоновНаСервере = "";
	КонецЕсли;
	Возврат КаталогШаблоновНаСервере;
	
КонецФункции 

// Получить адрес каталога файлов обновления на альтернативном сервере обновлений.
//
// Возвращаемое значение:
//   Строка   – адрес каталога на веб-сервере.
//
Функция АльтернативныйКаталогШаблоновНаСервереОбновлений() Экспорт
    Возврат "/upload/tmplts/";
КонецФункции 

// Записывает сообщение в журнал регистрации
Процедура ЗаписатьОшибкуВЖурналРегистрации(Событие, ТекстОшибки) Экспорт
	
	ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////// 
// ФУНКЦИИ ДЛЯ РАБОТЫ С ИНТЕРНЕТОМ
// 

// Открыть веб-страницу из указанного адреса.
//
// Параметры
//  Адрес         – Строка – URL или имя файла
//                           <продолжение описания параметра>
//  Заголовок     – Строка – заголовок окна.
//  ВладелецФормы - Форма  - родительская формы.
//
// Пример реализации:
// 
//  // с использованием обработки Обозреватель
//#Если ТолстыйКлиентОбычноеПриложение Тогда
//	Обозреватель = Обработки.Обозреватель.ПолучитьФорму("Форма");
//	Обозреватель.СтартоваяСтраница = Адрес;
//	Если Заголовок <> Неопределено Тогда
//		Обозреватель.Заголовок = Заголовок;
//	КонецЕсли; 
//	Обозреватель.ВладелецФормы = ВладелецФормы;
//	Обозреватель.Открыть();
//#КонецЕсли	
//
Процедура ОткрытьВебСтраницу(Знач Адрес, Знач Заголовок = Неопределено, 
	Знач ВладелецФормы = Неопределено) Экспорт
	
#Если ТолстыйКлиентОбычноеПриложение Тогда
	ЗапуститьПриложение(Адрес);
#КонецЕсли	

КонецПроцедуры
 
//////////////////////////////////////////////////////////////////////////////// 
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ЭЛЕКТРОННОЙ ПОЧТОЙ
// 

// Имеются ли в конфигурации функции для отправки электронной почты. 
//
// Возвращаемое значение:
//   Булево   – признак, что в конфигурации реализована отправка эл. почты.
//
// Пример реализации:
// 
//	//Пример реализации на основе модуля УправлениеЭлектроннойПочтой.
//	ИспользованиеВстроенногоПочтовогоКлиента = Константы.ИспользованиеВстроенногоПочтовогоКлиента.Получить();
//	Возврат ИспользованиеВстроенногоПочтовогоКлиента;
//
Функция НаличиеЭлектроннойПочты() Экспорт
	
	Возврат Ложь;
	
КонецФункции	

// Отправляет письмо эл. почты (неинтерактивно). 
//
// Параметры
//  ИмяПользователя  – строка – имя пользователя-отправителя.
//  АдресНазначения  – строка – эл. почтовый адрес назначения.
//  УспешноеОбновление  – Булево – признак того, успешное или неуспешное обновление.
//
//  Если операция завершилась неуспешно, то процедура выбрасывает исключение.
//
// Пример реализации:
// 
// // Пример реализации на основе модуля УправлениеЭлектроннойПочтой.
//
//Пользователь = Справочники.Пользователи.НайтиПоКоду(ИмяПользователя);
//Если Пользователь = Справочники.Пользователи.ПустаяСсылка() Тогда
//	ВызватьИсключение "Ошибка при подготовке письма электронной почты: неизвестный пользователь " + ИмяПользователя + ".";
//КонецЕсли; 
//
//СписокДоступныхЗаписей = УправлениеЭлектроннойПочтой.ПроверитьУчетныеЗаписиДляОтправкиПисем(Пользователь);
//Если СписокДоступныхЗаписей.Количество() = 0 Тогда
//	ВызватьИсключение "Ошибка при подготовке письма электронной почты: нет доступных учетных записей.";
//КонецЕсли;
//
//СтруктураНовогоПисьма = Новый Структура;
//Если НЕ ПустаяСтрока(АдресНазначения) Тогда
//	СписокКому = Новый СписокЗначений;
//	СписокКому.Добавить(АдресНазначения, АдресНазначения);
//	СтруктураНовогоПисьма.Вставить("Кому", СписокКому);
//КонецЕсли; 
//СтруктураНовогоПисьма.Вставить("Тело"     , Текст);
//СтруктураНовогоПисьма.Вставить("ВидТекста", ?(ФорматHTML, Перечисления.ВидыТекстовЭлектронныхПисем.HTML, Перечисления.ВидыТекстовЭлектронныхПисем.Текст));
//СтруктураНовогоПисьма.Вставить("Тема"     , Тема);
//
//Письмо = УправлениеЭлектроннойПочтой.НаписатьПисьмо(
//	Пользователь, // ТекущийПользователь, 
//	СтруктураНовогоПисьма, // СтруктураНовогоПисьма = Неопределено, 
//	,// ПеренестиВложенияИзОснования = Ложь, 
//	,// Копирование = Ложь,
//	,// ТекущийЭлементХТМЛ = Ложь, 
//	,// Дополнительно = Неопределено, 
//	,// ФормаВладелец = Неопределено, 
//	,// ПодписьПодТекстом = Ложь,
//	Ложь); // ОткрыватьПисьмо = Истина
//Если Письмо = Неопределено Тогда
//	ВызватьИсключение "Ошибка при подготовке письма электронной почты.";
//КонецЕсли; 
//
//СоответствиеПисем = Новый Соответствие();
//
//СсылкаНаПисьмо = Неопределено;
//Письмо.Свойство("ПисьмоСсылка", СсылкаНаПисьмо);
//Если ЗначениеЗаполнено(СсылкаНаПисьмо) Тогда   
//	СоответствиеПисем.Вставить(СсылкаНаПисьмо); 
//КонецЕсли;
//
//ТекстОшибок = "";
//УправлениеЭлектроннойПочтой.ОтправитьПисьма(
//	СоответствиеПисем, // Письма
//	глЗначениеПеременной("глСоответствиеТекстовЭлектронныхПисем"),// СоответствиеТекстовЭлектронныхПисем
//	Пользователь, // ТекущийПользователь 
//	Ложь, // Знач ПоказыватьОкноВыполнения = Истина, 
//	ТекстОшибок); //ТекстОшибок = "");
//Если НЕ ПустаяСтрока(ТекстОшибок) Тогда
//	ВызватьИсключение "Ошибка при отправке письма электронной почты: " + ТекстОшибок;
//КонецЕсли; 
//
Процедура ОтправитьЭлектроннуюПочту(Знач ИмяПользователя, 
	Знач АдресНазначения, Знач Тема, Знач Текст, Знач ФорматHTML) Экспорт
	
	ВызватьИсключение "Отсутствует возможность отправки электронной почты."; 	
	
КонецПроцедуры	

// Проверяет наличие учетной записи для отправки эл. почты 
// и при необходимости предлагает создать новую уч. запись.
//
// Параметры
//  ИмяПользователя  – строка – имя пользователя-отправителя, 
//								для которого проверяется уч. запись.
//
// Возвращаемое значение:
//   Булево   – Ложь, если операция завершилась неуспешно. Подробности ошибки 
//				записываются в журнал регистрации.
//
// Пример реализации:
//
//	// Пример реализации на основе модуля УправлениеЭлектроннойПочтой.
//	
//	Пользователь = Справочники.Пользователи.НайтиПоКоду(ИмяПользователя);
//	Если Пользователь = Справочники.Пользователи.ПустаяСсылка() Тогда
//		Возврат Ложь;
//	КонецЕсли; 
//	
//#Если ТолстыйКлиентОбычноеПриложение Тогда	
//	СписокДоступныхЗаписей = УправлениеЭлектроннойПочтой.ПроверитьУчетныеЗаписиДляОтправкиПисем(Пользователь);
//	Возврат СписокДоступныхЗаписей.Количество() > 0;
//#Иначе
//	Возврат Истина;
//#КонецЕсли
//
Функция ПроверитьУчетныеЗаписиДляОтправкиПисем(Знач ИмяПользователя) Экспорт

	Возврат Ложь; 	

КонецФункции 

//////////////////////////////////////////////////////////////////////////////// 
// ОБРАБОТЧИКИ СОБЫТИЙ ИНТЕРАКТИВНОЙ РАБОТЫ В ФОРМЕ ПОМОЩНИКА
// 

// Обработчик вызывается перед завершением работы системы при обновлении конфигурации из помощника.
//
// Пример реализации:
// #Если ТолстыйКлиентОбычноеПриложение Тогда
//		  глЗапрашиватьПодтверждениеПриЗакрытии = Ложь;
// #КонецЕсли
//
Процедура ПередЗавершениемРаботыСистемы() Экспорт
	
//#Если ТолстыйКлиентОбычноеПриложение Тогда
//	глЗначениеПеременной("глЗапрашиватьПодтверждениеПриЗакрытии");
//	глЗначениеПеременнойУстановить("глЗапрашиватьПодтверждениеПриЗакрытии", Ложь);
//#КонецЕсли

КонецПроцедуры

Функция ПолучитьНастройкуПоИмени(Знач ИмяНастройки, Знач Зачитывать) Экспорт

	Результат = Неопределено;
#Если ТолстыйКлиентОбычноеПриложение Тогда
	Если Зачитывать Тогда
		Результат = ВосстановитьЗначение("ОбновлениеКонфигурации_Тестирование_" + ИмяНастройки);
	КонецЕсли;
#КонецЕсли	
	Возврат Результат;
	
КонецФункции

Процедура ПараметрыАутентификацииАдминистратораОбновления(ПараметрыАутентификацииАдминистратораОбновления, ВерсияПроверкиОбновления) Экспорт
	
	
КонецПроцедуры

Функция ВыполнятьСжатиеИБ(ВерсияПроверкиОбновления) Экспорт
	
	Возврат Ложь;
	
КонецФункции

Функция КонфигурацияПослеОбновленияПоддерживаетБСП(ВерсияПроверкиОбновления) Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Возвращает Истина если конфигурация запущена под управлением платформы 8.3.
//
Функция ЭтоПлатформа83() Экспорт
	
	Информация = Новый СистемнаяИнформация;
	Возврат Лев(Информация.ВерсияПриложения, 3) = "8.3";
	
КонецФункции

// Сравнить две строки версий.
//
// Параметры
//  СтрокаВерсии1  – Строка – номер версии в формате РР.{П|ПП}.ЗЗ.СС
//  СтрокаВерсии2  – Строка – второй сравниваемый номер версии
//
// Возвращаемое значение:
//   Число   – больше 0, если СтрокаВерсии1 > СтрокаВерсии2; 0, если версии равны.
//
Функция СравнитьВерсии(Знач СтрокаВерсии1, Знач СтрокаВерсии2) Экспорт
	
	Строка1 = ?(ПустаяСтрока(СтрокаВерсии1), "0.0.0.0", СтрокаВерсии1);
	Строка2 = ?(ПустаяСтрока(СтрокаВерсии2), "0.0.0.0", СтрокаВерсии2);
	Версия1 = Renault_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Строка1, ".");
	Если Версия1.Количество() <> 4 Тогда
		ВызватьИсключение Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		                    НСтр("ru = 'Неправильный формат строки версии: %1'"), СтрокаВерсии1);
	КонецЕсли;
	Версия2 = Renault_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Строка2, ".");
	Если Версия2.Количество() <> 4 Тогда
		ВызватьИсключение Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	                         НСтр("ru = 'Неправильный формат строки версии: %1'"), СтрокаВерсии2);
	КонецЕсли;
	
	Результат = 0;
	Для Разряд = 0 По 3 Цикл
		Результат = Число(Версия1[Разряд]) - Число(Версия2[Разряд]);
		Если Результат <> 0 Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

Функция РекомендуемаяВерсияПлатформы() Экспорт
	
	Возврат "8.3.6.2449";
	
КонецФункции


