////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции общего назначения

// Функция хеширования строки 
//                           
// Параметры:
//  СтрокаПреобразования - Строка - Для хеширования.
//
// Возвращаемое значение:
//  Строка - Преобразованная после хеширования.  
//  
Функция ПолучитьХэшСтроки(СтрокаПреобразования) Экспорт 
	
	Хеширование = Новый ХешированиеДанных(ХешФункция.MD5);
	Хеширование.Добавить(СтрокаПреобразования);
	
	Возврат СтрЗаменить(Хеширование.ХешСумма," ","");  
	
КонецФункции

// Функция провереяет электронную почту на корректность 
//                           
// Параметры:
//  АдресЭП - Строка - Адрес электронной почты, строка для преобразования.
//
// Возвращаемое значение:
//  Булево  
//  
Функция АдресЭлектроннойПочтыВалиден(АдресЭП) Экспорт

    ЛатинскиеБуквы = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ";
    Цифры = "0123456789";
    //ищем крайний справа символ @ для правильного выделения локальной и доменной части
    ИндексСобаки = Найти(АдресЭП,"@");

    //1. строка адреса вообще не содержит разделителя
    Если ИндексСобаки = 0 Тогда
        Возврат ЛОЖЬ;
    КонецЕсли;

    УрезаемаяСтрока = Сред(АдресЭП, ИндексСобаки+1);

    Пока Найти(УрезаемаяСтрока,"@") > 0 Цикл
        ИндексСобаки = ИндексСобаки + Найти(УрезаемаяСтрока,"@");
        УрезаемаяСтрока = Сред(УрезаемаяСтрока, ИндексСобаки+1);
    КонецЦикла;

    ДоменнаяЧасть = Сред(АдресЭП, ИндексСобаки+1);
    ЛокальнаяЧасть = Лев(АдресЭП, ИндексСобаки-1);

    //2. Проверяем длину локальной части

    Если СтрДлина(ЛокальнаяЧасть) < 1 ИЛИ СтрДлина(ЛокальнаяЧасть) > 64 Тогда
        Возврат ЛОЖЬ;
    КонецЕсли;

    //3. Проверяем длину доменной части

    Если СтрДлина(ДоменнаяЧасть) < 1 ИЛИ СтрДлина(ДоменнаяЧасть) > 255 Тогда
        Возврат ЛОЖЬ;
    КонецЕсли;

    //4. Проверяем что локальная части не начинается и не заканчивается на "."

    Если Лев(ЛокальнаяЧасть, 1) = "." ИЛИ Прав(ЛокальнаяЧасть, 1) = "." Тогда
        Возврат ЛОЖЬ;
    КонецЕсли;

    //5. Локальная части не содержит 2 или более "." подряд

    Если Найти(ЛокальнаяЧасть, "..") > 0 Тогда
        Возврат ЛОЖЬ;
    КонецЕсли;

    //Проверка доменной части

    //6. Доменная часть не начинается с точки

    Если Лев(ДоменнаяЧасть, 1) = "." Тогда
        Возврат ЛОЖЬ;
    КонецЕсли;

    //7. Доменная часть не содержит 2 или более "." подряд

    Если Найти(ДоменнаяЧасть, "..") > 0 Тогда
        Возврат ЛОЖЬ;
    КонецЕсли;

    //8. Проверка частей доменной части
    //каждая часть начинается с буквы и заканчивается буквой или цифрой
    //каждая часть длиной не более 63 символов

    ИдентификаторыДоменнойЧасти = атСервер.РазложитьСтрокуВМассивПодстрок(ДоменнаяЧасть, ".");
    Для Каждого ИдентификаторДомена ИЗ ИдентификаторыДоменнойЧасти Цикл

        Если СтрДлина(ИдентификаторДомена) > 63 Тогда
            Возврат ЛОЖЬ;
        КонецЕсли;

        Если Найти(ЛатинскиеБуквы, Лев(ИдентификаторДомена,1)) = 0 И Найти(Цифры, Лев(ИдентификаторДомена,1)) = 0  Тогда
            Возврат ЛОЖЬ;
        КонецЕсли;

        Если Найти(ЛатинскиеБуквы, Прав(ИдентификаторДомена,1)) = 0 И Найти(Цифры, Прав(ИдентификаторДомена,1)) = 0 Тогда
            Возврат ЛОЖЬ;
        КонецЕсли;
	КонецЦикла;
	
    Возврат ИСТИНА;

КонецФункции

// Функция получения строки адреса из структуры реквизитов  
//                           
// Параметры:
//  СтруктураАдрес - Структура, Строка табличной части - Структура реквизитов адреса.
//
// Возвращаемое значение:
//  Адрес - Строка представления адреса.  
// 
Функция СформироватьПредставлениеАдреса(СтруктураАдрес) Экспорт
	
	Адрес = "";
	zip_code =  УбратьКавычки(СтруктураАдрес.ZipCode);
	address  =  УбратьКавычки(СтруктураАдрес.Region);  
	district =  УбратьКавычки(СтруктураАдрес.District);
	city     =  УбратьКавычки(СтруктураАдрес.City);
	locality =  УбратьКавычки(СтруктураАдрес.Locality);
	street   =  УбратьКавычки(СтруктураАдрес.Street);
	house    =  УбратьКавычки(СтруктураАдрес.House);
	housing  =  УбратьКавычки(СтруктураАдрес.Housing);
	flat     =  УбратьКавычки(СтруктураАдрес.Flat); 
	
	Адрес = ?(НЕ ЗначениеЗаполнено(zip_code),"",zip_code);
	Адрес = ?(НЕ ЗначениеЗаполнено(address),", ",address);
	Адрес = ?(НЕ ЗначениеЗаполнено(district),Адрес,Адрес + ", " + district);
	Адрес = ?(НЕ ЗначениеЗаполнено(city),Адрес,Адрес + ", " + city);
	Адрес = ?(НЕ ЗначениеЗаполнено(street),Адрес,Адрес + ", " + street);
	Адрес = ?(НЕ ЗначениеЗаполнено(house),Адрес,Адрес + ", д." + house);
	Адрес = ?(НЕ ЗначениеЗаполнено(housing),Адрес,Адрес + ", крп." + housing);
	Адрес = ?(НЕ ЗначениеЗаполнено(flat),Адрес,Адрес + ", кв." + flat);
	
	Возврат Адрес;
	
КонецФункции

// Функция убирает кавычки из строки  
//                           
// Параметры:
//  ЭлементСтруктуры - Строка - Строка для преобразования.
//
// Возвращаемое значение:
//  ЭлементСтруктуры - Преобразованная строка.  
// 
Функция УбратьКавычки(ЭлементСтруктуры) Экспорт   
	
	ЭлементСтруктуры = СтрЗаменить(ЭлементСтруктуры,"""","");
	ЭлементСтруктуры =?(Найти(ЭлементСтруктуры,"null"),"",ЭлементСтруктуры);
	
	Возврат ЭлементСтруктуры;
	
КонецФункции

// Функция преобразовывает номер телефона к формату передачи данных в DNM 
//                           
// Параметры:
//  Телефон - Строка - Номер телефона.
//
// Возвращаемое значение:
//  СтТелефон - Преобразованный номер телефона.  
//  
Функция ПреобразоватьНомерТелефона(Телефон) Экспорт

	СтТелефон = Телефон;
	Если  СтрДлина(СтТелефон) > 9 Тогда
		// Оставляем только цифры 
		СтруктураНомера = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(СтТелефон);
		КодСтраны = СтруктураНомера.КодСтраны;
		Если СтруктураНомера.КодСтраны = "8" Или СтруктураНомера.КодСтраны = "+8" Тогда
			КодСтраны = "+7";	 
		КонецЕсли;
		СтТелефон = КодСтраны + СтруктураНомера.КодГорода + СтруктураНомера.НомерТелефона;		
	КонецЕсли;  
	
	Возврат СтТелефон;  
	
КонецФункции

// Функция убирает лишние символы из строки, оставляет только цифры 
//                           
// Параметры:
//  мояСтрока - Строка - для преобразования данных.
//
// Возвращаемое значение:
//  Результат - Преобразованная строка.  
//  
Функция ПолучитьТолькоЦифры (Знач мояСтрока) Экспорт
	
	ДлинаСтроки = СтрДлина(мояСтрока);
	Результат = "";
	Для Индекс = 1 по ДлинаСтроки Цикл
		Символ = Сред(мояСтрока, Индекс, 1);
		Если Найти("1234567890", Символ)>0 Тогда
			Результат = Результат + Символ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;    
	
КонецФункции

// Функция преобразования строки в тип "Дата" 
//                           
// Параметры:   
//  ДатаСтрокой - Строка - для преобразования.
//
// Возвращаемое значение:
//  ПолученнаяДата - "Дата" после преобразования
//
Функция ПреобразоватьСтрокуВДату(ДатаСтрокой) Экспорт
	
	Если Не ДатаСтрокой = "null" Тогда
		ДатаСтрокой = СтрЗаменить(ДатаСтрокой, ".","");
		ДатаСтрокой = СтрЗаменить(ДатаСтрокой, "-","");
		ДатаСтрокой = СтрЗаменить(ДатаСтрокой, ":","");
		ДатаСтрокой = СтрЗаменить(ДатаСтрокой, " ","");
		Если Найти(ДатаСтрокой,"T") Тогда
			ПолученнаяДата  =Дата(Лев(ДатаСтрокой,НАйти(ДатаСтрокой,"T")-1));
			Возврат ПолученнаяДата;			
		Иначе
			Если СтрДлина(ДатаСтрокой)<14 Тогда
				//перекроить дату
				//переделать культурно для даты рождения
				Если СтрДлина(ДатаСтрокой)=6 Тогда
					//010180
					Год   = Прав(ДатаСтрокой,2);
					Месяц = Сред(ДатаСтрокой,3,2);
					День  = Лев(ДатаСтрокой,2);
					
					ДатаСтрокойНов = "19"+Год+""+Месяц+""+День;
					ПолученнаяДата = Дата(ДатаСтрокойНов);
				ИначеЕсли СтрДлина(ДатаСтрокой)=8 Тогда
					//1990-04-04
					ПолученнаяДата = Дата(ДатаСтрокой);  
				КонецЕсли;
			Иначе
				ПолученнаяДата = Дата(ДатаСтрокой);
			КонецЕсли;
			Возврат ПолученнаяДата;
		КонецЕсли;
	Иначе
		Возврат null
	КонецЕсли;
	
КонецФункции

// Функция получения модели автомобиля из документа  
//                           
// Параметры:
//  Документ - ДокументСсылка - Ссылка на документ.
//
// Возвращаемое значение:
//  Модель  
//  
Функция ПолучитьМодельИзДокумента(Документ) Экспорт
	
	Модель = Неопределено;
	
	Если  ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказНаряд") ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаявкаНаРемонт") Тогда
		Модель = Документ.Автомобиль.Модель;
	КонецЕсли;
	
	Возврат Модель;
	
КонецФункции

//функция, получения ссылки на корень дерева документов
//
// Параметр:
//	Док		- ДокументСсылка	- Переданный документ
//
// Возвращаемое значение:
//	ДокументСсылка		- Корень документа
//
Функция ПолучитьКореньДокумента(Док, ТаблицаКонтроляПовтора, ОписаниеТиповДокументов) 
	
	Перем ЗнРеквизит; // Значение реквизита
	ЗнРеквизит  =  Неопределено;
	ВидДок  =  Док.Метаданные().Имя;
	
	//обходим реквизиты в поисках подходящего корня
	Для Каждого Реквизит Из Метаданные.Документы[ВидДок].Реквизиты Цикл
		ЗнРеквизит  =  Док[Реквизит.Имя];
		Если ПроверкаПодчиненияРеквизиту(Док,ЗнРеквизит,ТаблицаКонтроляПовтора,ОписаниеТиповДокументов) Тогда
			ТаблицаКонтроляПовтора.Добавить(ЗнРеквизит);
			Возврат ПолучитьКореньДокумента(ЗнРеквизит,ТаблицаКонтроляПовтора,ОписаниеТиповДокументов);
		КонецЕсли;
	КонецЦикла; 
	
	//если в реквизитах ничего не было найдено, обходим реквизиты табличных частей
	//перебираем все ТЧ
	Для Каждого ТЧ Из Метаданные.Документы[ВидДок].ТабличныеЧасти Цикл
		//перебираем все строки ТЧ
		Для ИндексСтроки = 0 По Док[ТЧ.Имя].Количество()-1 Цикл
			//перебираем все реквизиты строки
			Для Каждого РеквизитТЧ Из ТЧ.Реквизиты Цикл
				ИмяРеквизитТЧ  =  Метаданные.Документы[ВидДок].ТабличныеЧасти[ТЧ.Имя].Реквизиты[РеквизитТЧ.Имя];
				ЗнРеквизит =  Док[ТЧ.Имя][ИндексСтроки][ИмяРеквизитТЧ.Имя];
				Если ПроверкаПодчиненияРеквизиту(Док,ЗнРеквизит,ТаблицаКонтроляПовтора,ОписаниеТиповДокументов) Тогда
					ТаблицаКонтроляПовтора.Добавить(ЗнРеквизит);
					Возврат ПолучитьКореньДокумента(ЗнРеквизит,ТаблицаКонтроляПовтора,ОписаниеТиповДокументов);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла; 
	
	Возврат Док;
	
КонецФункции // ПолучитьКореньДокумента()

//функция проверяет, может ли документ являться подчиненным реквизиту
//
// Параметр:
//	Док		- ДокументСсылка	- Переданный документ
//	Док		- Реквизит			- Переданный реквизит
//
// Возвращаемое значение:
//	Булево						- Результат проверки
//
Функция ПроверкаПодчиненияРеквизиту(ДокументСсылка,ЗнРеквизит,ТаблицаКонтроляПовтора,ОписаниеТиповДок)
	
	Если (ЗнРеквизит <> Неопределено) И  (ОписаниеТиповДок.СодержитТип(ТипЗнч(ЗнРеквизит))) Тогда
		Если (ЗнРеквизит<>Документы[ЗнРеквизит.Метаданные().Имя].ПустаяСсылка()) И (ЗнРеквизит<>ДокументСсылка) Тогда
			
			//проверка на дубль
			Если НЕ (ТаблицаКонтроляПовтора.Найти(ЗнРеквизит) = Неопределено) Тогда
				Возврат Ложь;
			КонецЕсли;
			
			//проверка, что текущий документ может быть подчиненным для предполагаемого корня 
			ТекстЗапроса = "ВЫБРАТЬ
			               |	ПодчиненныеДокументы.Ссылка КАК Документ
			               |ИЗ
			               |	КритерийОтбора.ПодчиненныеДокументы(&Основание) КАК ПодчиненныеДокументы
			               |ГДЕ
			               |	ПодчиненныеДокументы.Ссылка = &ДокументСсылка";
			Запрос = Новый Запрос(ТекстЗапроса);
			Запрос.УстановитьПараметр("Основание",ЗнРеквизит);
			Запрос.УстановитьПараметр("ДокументСсылка",ДокументСсылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Количество() > 0 Тогда
				Возврат Истина;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;  
	
КонецФункции // ПолучитьКореньДокумента()

// Функция проверки заказ наряда на вид ремонта дополнительное оборудование из настроек подключения.
// Используется для определения необходимости обновить склад автомобилей в CRM
//                           
// Параметры:
//  ЗаказНаряд           - ДокументСсылка.ЗаказНаряд - Ссылка на заказ наряд.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключения - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  МассивВозврата - массив объектов виды ремонта ТО из CRM.  
// 
Функция ЭтоДополнительноеОборудование(ЗаказНаряд,НастройкаПодключения) Экспорт
	
	ЭтоДополнительноеОборудование = Ложь;
	Если НастройкаПодключения.ВидыРемонтаДополнительноеОборудование.Количество()= 0 Тогда
		Возврат ЭтоДополнительноеОборудование;
	Иначе
		Для Каждого СтрокаВидаРемонта из НастройкаПодключения.ВидыРемонтаДополнительноеОборудование Цикл
			Если СтрокаВидаРемонта.ВидРемонта = ЗаказНаряд.ВидРемонта Тогда
				ЭтоДополнительноеОборудование = Истина;
			КонецЕсли
		КонецЦикла;
	КонецЕсли;
	Возврат ЭтоДополнительноеОборудование;
	
КонецФункции

// Возвращает массив подчиненных документов.
//
// Параметры: 
//  Основание	 - ДокументСсылка. Тот документ подчиненных для которого ищем
//	МассивВидов	 - Массив. Массив строк с видами подчиненных документов. Если МассивВидов не определен, то возвращаются все подчиненные документы
//
// Возвращаемое значение: 
//  Массив ссылок документов
//
Функция ПолучитьМассивПодчиненных(Основание,МассивВидов = Неопределено,ТолькоНеПомеченные = Ложь) Экспорт
	
	// проверим на пустое основание
	Если Не ЗначениеЗаполнено(Основание) Тогда
		Возврат Неопределено;
	КонецЕсли;
	// получим массив подчиненных документов
	//МассивПодчиненных = КритерииОтбора.ПодчиненныеДокументы.Найти(Основание);
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПодчиненныеДокументы.Ссылка
	|ИЗ
	|	КритерийОтбора.ПодчиненныеДокументы(&Основание) КАК ПодчиненныеДокументы";
	Запрос.УстановитьПараметр("Основание", Основание);
	МассивПодчиненных = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	// если задан фильтр на виды документов, то пропустим полученный массив через этот фильтр
	Если (МассивВидов <> Неопределено) И (МассивПодчиненных.Количество() > 0) Тогда
		ТекИндекс = 0;
		Пока ТекИндекс <= МассивПодчиненных.ВГраница() Цикл
			НайденВФильтре = Ложь;
			Для Сч = 0 По МассивВидов.ВГраница() Цикл
				Если МассивПодчиненных[ТекИндекс].Ссылка.Метаданные().Имя = МассивВидов[Сч] Тогда
					НайденВФильтре = Истина; Прервать;
				КонецЕсли;
			КонецЦикла;
			Если НайденВФильтре И (НЕ ТолькоНеПомеченные ИЛИ НЕ МассивПодчиненных[ТекИндекс].Ссылка.ПометкаУдаления) Тогда 
				ТекИндекс = ТекИндекс + 1; 
			Иначе 
				МассивПодчиненных.Удалить(ТекИндекс);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивПодчиненных;   
	
КонецФункции 

// Процедура вывода сообщения  
//                           
// Параметры:
//  ТекстСообщения       - Строка - Текст выводимого сообщения.
//  Статус               - СтатусСообщения - Определяет набор статусов сообщений, обозначаемых пиктограммами при выводе сообщений в окно сообщений.
//  Заголовок            - Строка - Заголовок сообщения.
//  РасшифровкаСообщения - Строка - Расшифровка выводимого сообщения.
//
Процедура Сообщение(Знач ТекстСообщения,Статус = Неопределено,Заголовок = "",РасшифровкаСообщения = Неопределено) Экспорт
	
	ДублироватьСообщениеВЖурналРегистрации(ТекстСообщения,Статус,Заголовок);
	Сообщить(ТекстСообщения,Статус);
	
КонецПроцедуры 

// Процедура определения важности события по статусу сообщения  
//                           
// Параметры:
//  Статус - СтатусСообщения - Определяет набор статусов сообщений, обозначаемых пиктограммами при выводе сообщений в окно сообщений.
//
Функция ОпределитьВажностьСобытияЖурналаРегистрации(Статус) 
	                                 
	ВидСобытия = УровеньЖурналаРегистрации.Информация;
	Если Статус = СтатусСообщения.Внимание Тогда
		ВидСобытия = УровеньЖурналаРегистрации.Предупреждение;
	ИначеЕсли Статус = СтатусСообщения.Важное или  Статус = СтатусСообщения.ОченьВажное Тогда
		ВидСобытия = УровеньЖурналаРегистрации.Ошибка;
	КонецЕсли;
	
	Возврат  ВидСобытия;  
	
КонецФункции

// Процедура вывода сообщения в журнал регистрации  
//                           
// Параметры:
//  ТекстСообщения - Строка - Текст выводимого сообщения.
//  Статус         - СтатусСообщения - Определяет набор статусов сообщений, обозначаемых пиктограммами при выводе сообщений в окно сообщений.
//  Заголовок      - Строка - Заголовок сообщения.
//
Процедура ДублироватьСообщениеВЖурналРегистрации(ТекстСообщения,Статус,Заголовок="")

	Важность = ОпределитьВажностьСобытияЖурналаРегистрации(Статус);
	Если Заголовок <> "" Тогда
		ЗаписьЖурналаРегистрации("Сообщение",УровеньЖурналаРегистрации.Примечание,,,Заголовок);
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Сообщение",Важность,,,ТекстСообщения);

КонецПроцедуры

// Функция провереяет Гос номер на корректность: не должно быть латиницы 
//                           
// Параметры:
//  ГосНомер - Строка - Адрес электронной почты, строка для преобразования.
//
// Возвращаемое значение:
//  Булево  
//  
Функция ГосНомерВалиден(ГосНомер) Экспорт

	НедопустимыеСимволы = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ";
	
	Для Сч = 1 по СтрДлина(ГосНомер) Цикл
		Символ = Сред(ГосНомер, Сч, 1);
		Если СтрНайти(НедопустимыеСимволы, Символ) > 0 Тогда
			Возврат Ложь;		  
		КонецЕсли;
	КонецЦикла; 

	Возврат Истина;
	
КонецФункции

// Создает копию экземпляра указанного объекта.
//
// Параметры:
//  Источник - Произвольный - объект, который необходимо скопировать.
//
// Возвращаемое значение:
//  Произвольный - копия объекта, переданного в параметре Источник.
//
// Примечание:
//  Функцию нельзя использовать для объектных типов (СправочникОбъект, ДокументОбъект и т.п.).
Функция СкопироватьРекурсивно(Источник) Экспорт
	
	Перем Приемник;
	
	ТипИсточника = ТипЗнч(Источник);
	Если ТипИсточника = Тип("Структура") Тогда
		Приемник = СкопироватьСтруктуру(Источник);
	ИначеЕсли ТипИсточника = Тип("Соответствие") Тогда
		Приемник = СкопироватьСоответствие(Источник);
	ИначеЕсли ТипИсточника = Тип("Массив") Тогда
		Приемник = СкопироватьМассив(Источник);
	ИначеЕсли ТипИсточника = Тип("СписокЗначений") Тогда
		Приемник = СкопироватьСписокЗначений(Источник);
		#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		ИначеЕсли ТипИсточника = Тип("ТаблицаЗначений") Тогда
			Приемник = Источник.Скопировать();
		#КонецЕсли
	Иначе
		Приемник = Источник;
	КонецЕсли;
	
	Возврат Приемник;
	
КонецФункции

// Создает копию значения типа Структура.
//
// Параметры:
//  СтруктураИсточник - Структура - копируемая структура.
// 
// Возвращаемое значение:
//  Структура - копия исходной структуры.
//
Функция СкопироватьСтруктуру(СтруктураИсточник) Экспорт
	
	СтруктураРезультат = Новый Структура;
	
	Для Каждого КлючИЗначение Из СтруктураИсточник Цикл
		СтруктураРезультат.Вставить(КлючИЗначение.Ключ, СкопироватьРекурсивно(КлючИЗначение.Значение));
	КонецЦикла;
	
	Возврат СтруктураРезультат;
	
КонецФункции

// Создает копию значения типа Соответствие.
//
// Параметры:
//  СоответствиеИсточник - Соответствие - соответствие, копию которого необходимо получить.
// 
// Возвращаемое значение:
//  Соответствие - копия исходного соответствия.
//
Функция СкопироватьСоответствие(СоответствиеИсточник) Экспорт
	
	СоответствиеРезультат = Новый Соответствие;
	
	Для Каждого КлючИЗначение Из СоответствиеИсточник Цикл
		СоответствиеРезультат.Вставить(КлючИЗначение.Ключ, СкопироватьРекурсивно(КлючИЗначение.Значение));
	КонецЦикла;
	
	Возврат СоответствиеРезультат;

КонецФункции

// Создает копию значения типа Массив.
//
// Параметры:
//  МассивИсточник - Массив - массив, копию которого необходимо получить.
// 
// Возвращаемое значение:
//  Массив - копия исходного массива.
//
Функция СкопироватьМассив(МассивИсточник) Экспорт
	
	МассивРезультат = Новый Массив;
	
	Для Каждого Элемент Из МассивИсточник Цикл
		МассивРезультат.Добавить(СкопироватьРекурсивно(Элемент));
	КонецЦикла;
	
	Возврат МассивРезультат;
	
КонецФункции

// Создает копию значения типа СписокЗначений.
//
// Параметры:
//  СписокИсточник - СписокЗначений - список значений, копию которого необходимо получить.
// 
// Возвращаемое значение:
//  СписокЗначений - копия исходного списка значений.
//
Функция СкопироватьСписокЗначений(СписокИсточник) Экспорт
	
	СписокРезультат = Новый СписокЗначений;
	
	Для Каждого ЭлементСписка Из СписокИсточник Цикл
		СписокРезультат.Добавить(
			СкопироватьРекурсивно(ЭлементСписка.Значение), 
			ЭлементСписка.Представление, 
			ЭлементСписка.Пометка, 
			ЭлементСписка.Картинка);
	КонецЦикла;
	
	Возврат СписокРезультат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с регистром соответствия объектов 1С и CRM (DNM) системы

// Функция получения идентификатора CRM (DNM) из регистра по объекту 1С
//                           
// Параметры:
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//  Объект               - Характеристика ПланыВидовХарактеристик.Инфотек_ВидыОбъектов - Вид объекта хранящегося в регистре.
//  ВидОбъекта           - Ссылка ПланыВидовХарактеристик.Инфотек_ВидыОбъектов - Ссылка на объект для получения идентификатора.
//  ОбъектУточнения      - Характеристика ПланыВидовХарактеристик.Инфотек_ВидыОбъектов - Вид вспомогательного объекта хранящегося в регистре
//  ВидОбъектаУточнения  - Ссылка ПланыВидовХарактеристик.Инфотек_ВидыОбъектов - Ссылка на объект уточнения для получения идентификатора.
//
// Возвращаемое значение:
//  Идентификатор - Идентификатор объекта из DNM системы. 
//                   
Функция ПолучитьИдентификаторСоответствияПоОбъекту(НастройкаПодключения,Объект,ВидОбъекта,ВидОбъектаУточнения = Неопределено,ОбъектУточнения=Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Инфотек_СоответствиеОбъектов.ВидОбъекта,
	|	Инфотек_СоответствиеОбъектов.Объект,
	|	Инфотек_СоответствиеОбъектов.Идентификатор
	|ИЗ
	|	РегистрСведений.Инфотек_СоответствиеОбъектов КАК Инфотек_СоответствиеОбъектов
	|ГДЕ
	|	Инфотек_СоответствиеОбъектов.ВидОбъекта = &ВидОбъекта
	|	И Инфотек_СоответствиеОбъектов.Объект = &Объект
	|	И Инфотек_СоответствиеОбъектов.ВидОбъектаУточнения = &ВидОбъектаУточнения
	|	И Инфотек_СоответствиеОбъектов.ОбъектУточнения = &ОбъектУточнения
	|	И Инфотек_СоответствиеОбъектов.НастройкаПодключения = &НастройкаПодключения";       
	Запрос.УстановитьПараметр("Объект",Объект);
	Запрос.УстановитьПараметр("ВидОбъекта",ВидОбъекта);
	Запрос.УстановитьПараметр("ВидОбъектаУточнения",?(ВидОбъектаУточнения = Неопределено,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.ПустаяСсылка(),ВидОбъектаУточнения));
	Запрос.УстановитьПараметр("ОбъектУточнения",ОбъектУточнения);
	Запрос.УстановитьПараметр("НастройкаПодключения",НастройкаПодключения);
		
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Идентификатор = Строка(Результат.Идентификатор); 
		Идентификатор = СтрЗаменить(Идентификатор,Символы.НПП,"");
		Возврат Идентификатор
	Иначе
		Возврат "";
	КонецЕсли;   
	
КонецФункции

// Функция получения объекта 1С по идентификатору CRM (DNM) из регистра
//                           
// Параметры:
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//  Идентификатор - Число/Строка - Идентификатор объекта из DNM системы.
//  ВидОбъекта    - Ссылка ПланыВидовХарактеристик.Инфотек_ВидыОбъектов - Ссылка на объект для получения ID.
//
// Возвращаемое значение:
//  Объект - Объект 1С из регистра сведений. 
//    
Функция ПолучитьОбъектПоИдентификаторуСоответствия(НастройкаПодключения,Идентификатор,ВидОбъекта) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Инфотек_СоответствиеОбъектов.ВидОбъекта КАК ВидОбъекта,
	|	Инфотек_СоответствиеОбъектов.Объект КАК Объект,
	|	Инфотек_СоответствиеОбъектов.Идентификатор КАК Идентификатор
	|ИЗ
	|	РегистрСведений.Инфотек_СоответствиеОбъектов КАК Инфотек_СоответствиеОбъектов
	|ГДЕ
	|	Инфотек_СоответствиеОбъектов.ВидОбъекта = &ВидОбъекта
	|	И Инфотек_СоответствиеОбъектов.Идентификатор = &Идентификатор
	|	И Инфотек_СоответствиеОбъектов.НастройкаПодключения = &НастройкаПодключения";       
	Запрос.УстановитьПараметр("Идентификатор",Идентификатор);
	Запрос.УстановитьПараметр("ВидОбъекта",ВидОбъекта);
	Запрос.УстановитьПараметр("НастройкаПодключения",НастройкаПодключения);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Объект;
	Иначе
		Запрос.УстановитьПараметр("Идентификатор",Число(Идентификатор));
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			Возврат Результат.Объект;
		Иначе	
			Возврат Неопределено;
		КонецЕсли; 
	КонецЕсли;
КонецФункции

// Функция получения таблицы из регистра соответствий объектов 1С и CRM (DNM) системы
//                           
// Параметры:
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//  ВидОбъекта           - Ссылка ПланыВидовХарактеристик.Инфотек_ВидыОбъектов - Ссылка на объект для получения ID.
//
// Возвращаемое значение:
//  ТаблицаСоответствий - Таблица записей регистра соответствий объектов 1С и DNM системы. 
//    
Функция ПолучитьТаблицуСоответствийПоВидуОбъекта(НастройкаПодключения, ВидОбъекта) Экспорт  
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Инфотек_СоответствиеОбъектов.ВидОбъекта,
	|	Инфотек_СоответствиеОбъектов.Объект,
	|	Инфотек_СоответствиеОбъектов.Идентификатор,
	|	Инфотек_СоответствиеОбъектов.ВидОбъектаУточнения,
	|	Инфотек_СоответствиеОбъектов.ОбъектУточнения
	|ИЗ
	|	РегистрСведений.Инфотек_СоответствиеОбъектов КАК Инфотек_СоответствиеОбъектов
	|ГДЕ
	|	Инфотек_СоответствиеОбъектов.ВидОбъекта = &ВидОбъекта
	|	И Инфотек_СоответствиеОбъектов.НастройкаПодключения = &НастройкаПодключения";
	Запрос.УстановитьПараметр("ВидОбъекта",ВидОбъекта);
	Запрос.УстановитьПараметр("НастройкаПодключения",НастройкаПодключения);
	
	ТаблицаСоответствий = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаСоответствий; 
	
КонецФункции

// Функция получения объекта 1С по идентификатору CRM (DNM) из таблицы соответствий 
//                           
// Параметры:
//  Идентификатор       - Число/Строка - Идентификатор объекта из DNM системы.
//  ТаблицаСоответствий - Таблица значений - Таблица записей регистра соответствий объектов 1С и DNM системы. 
//
// Возвращаемое значение:
//  Объект - Объект 1С из таблицы соответствий.  
//  
Функция НайтиОбъектПоИдентификаторуВТаблицеСоответствий(Идентификатор,ТаблицаСоответствий) Экспорт

	НайденнаяСтрока = ТаблицаСоответствий.Найти(Идентификатор,"Идентификатор");
	Если НайденнаяСтрока = Неопределено Тогда
		Возврат 0;
	Иначе
		Возврат НайденнаяСтрока.Объект;
	КонецЕсли;  
	
КонецФункции

// Запись в регистр соответствий объектов 1С и идентификаторов CRM (DNM)  
//                           
// Параметры:
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//  Объект               - Характеристика ПланыВидовХарактеристик.Инфотек_ВидыОбъектов - Вид объекта хранящегося в регистре.
//  ВидОбъекта           - Ссылка ПланыВидовХарактеристик.Инфотек_ВидыОбъектов - Ссылка на объект для получения идентификатора.
//  Идентификатор        - Число/Строка - Идентификатор объекта из DNM системы.
//  ОбъектУточнения      - Характеристика ПланыВидовХарактеристик.Инфотек_ВидыОбъектов - Вид вспомогательного объекта хранящегося в регистре
//  ВидОбъектаУточнения  - Ссылка ПланыВидовХарактеристик.Инфотек_ВидыОбъектов - Ссылка на объект уточнения для получения идентификатора.
//
Процедура ЗаписатьСоответствиеОбъектов(НастройкаПодключения,Объект,ВидОбъекта,Идентификатор,ВидОбъектаУточнения=Неопределено,ОбъектУточнения=Неопределено) Экспорт 

	ЗаписьИдентификаторов = РегистрыСведений.Инфотек_СоответствиеОбъектов.СоздатьМенеджерЗаписи();
	ЗаписьИдентификаторов.ВидОбъекта = ВидОбъекта;
	ЗаписьИдентификаторов.Объект = Объект;
	ЗаписьИдентификаторов.Идентификатор = Идентификатор;
	ЗаписьИдентификаторов.ВидОбъектаУточнения = ВидОбъектаУточнения;
	ЗаписьИдентификаторов.ОбъектУточнения = ОбъектУточнения;
	ЗаписьИдентификаторов.НастройкаПодключения = НастройкаПодключения;	
	ЗаписьИдентификаторов.Записать(Истина);    
	
КонецПроцедуры

// Удаление записей из регистра соответствий объектов 1С и идентификаторов DNM по виду объекта 
//                           
// Параметры:
//  ВидОбъекта           - Ссылка ПланыВидовХарактеристик.Инфотек_ВидыОбъектовDNM - Ссылка на объект для получения идентификатора.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
Процедура ОчиститьСоответствияПоВидуОбъекта(ВидОбъекта,НастройкаПодключения) Экспорт

	НаборЗаписей = РегистрыСведений.Инфотек_СоответствиеОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.НастройкаПодключения.Установить(НастройкаПодключения,Истина);
	НаборЗаписей.Отбор.ВидОбъекта.Установить(ВидОбъекта,Истина);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать(Истина);        
	
КонецПроцедуры

