
//Регламентное задание "Обмен данными с Дилерским порталом"
Процедура ВыполнитьОбменДанными(Параметр1 = Неопределено) Экспорт
	
	 ВыгрузкаЗаявокНаАвтомобили();
	 
	 ЗагрузкаСообщенийОбмена();
	 
	 ЗагрузитьСпрПричинНеВозможностиВыдачи();
	 
	 ЗагрузитьДанныеПлатногоХранения ();
	 
	 РегистрыСведений.DMS_МониторингРегламентныхЗаданий.ЗавершениеЗадания(
	 ПредопределенноеЗначение("Справочник.DMS_НастройкаРегламентныхЗаданий.ОбменДаннымиСДилерскимПорталом"),
	 ТекущаяДатаСеанса());
КонецПроцедуры
 
Функция ПолучитьПланОбмена()
		
	Выборка = ПланыОбмена.Renault_CRM.Выбрать();
	ЭтаБаза = ПланыОбмена.Renault_CRM.ЭтотУзел();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка <> ЭтаБаза Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция ПолучитьПрокси()
    
 //   Попытка
 //   	Определение = WSСсылки.DealerPortalWS.ПолучитьWSОпределения();
 //   	ВебСервис = Новый WSПрокси(Определение, Определение.Сервисы[0].URIПространстваИмен,Определение.Сервисы[0].Имя,Определение.Сервисы[0].ТочкиПодключения[0].Имя);       
 //   	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
 //
 //   	ЛогинWS = Настройки.ЛогинДоступаКВебСервисам;
 //   	ПарольWS = Настройки.ПарольДоступаКВебСервисам;
 //   	ВебСервис.Пользователь = ЛогинWS;
 //   	ВебСервис.Пароль = ПарольWS;
 //   	Возврат ВебСервис;

 //   Исключение
		Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
		АдресWS = Настройки.АдресWsGate + "ws/DealerPortal.1cws?wsdl"; 
		ЛогинWS = Настройки.ЛогинДоступаКВебСервисам;
		ПарольWS = Настройки.ПарольДоступаКВебСервисам;
		Определение = Новый WSОпределения(АдресWS,ЛогинWS, ПарольWS);
		ВебСервис = Новый WSПрокси(Определение, Определение.Сервисы[0].URIПространстваИмен,Определение.Сервисы[0].Имя,Определение.Сервисы[0].ТочкиПодключения[0].Имя);       
		ВебСервис.Пользователь = ЛогинWS;
		ВебСервис.Пароль = ПарольWS;
		Возврат ВебСервис;
		
	//КонецПопытки;

	                         
КонецФункции

//Выгрузка заявок на автомобили в дилерский портал, с последующей отправкой в DistriNet
Процедура ВыгрузкаЗаявокНаАвтомобили() Экспорт
	
	Попытка 
		
		ПланОбмена = ПолучитьПланОбмена();
		
		Если ЗначениеЗаполнено(ПланОбмена) тогда
			ВыполнитьОтправкуЗаявокНаАвтомобили(ПланОбмена);
			ВыполнитьОтправкуЗаявокНаОтгрузку(ПланОбмена);

		Иначе
			Renault_Открытый.СообщитьПользователю("Выгрузка отменена, не удалось определить план обмена",,"Регламентное задание ""Выгрузка заявок на автомобили""");
		КонецЕсли;
		
	Исключение
		
		Инфо = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(
		"Регламентное задание ""Выгрузка заявок на Дилерский портал""",
		УровеньЖурналаРегистрации.Ошибка,,,
		ПодробноеПредставлениеОшибки(Инфо));
		ВызватьИсключение;
	КонецПопытки;          
	
КонецПроцедуры

Процедура ВыполнитьОтправкуЗаявокНаАвтомобили(ПланОбмена)
	
	ВебСервис = ПолучитьПрокси();
	Сериализатор = Новый СериализаторXDTO(ВебСервис.ФабрикаXDTO);
	
	РезультатВыполнения = Новый Структура();
	Server = СтрокаСоединенияИнформационнойБазы();
	BIR = Renault_ОбщийМодуль.ПолучитьBIRБазыДанных();
	
	//Получим ссылки на все изменения
	ФильтрВыборки = Новый Массив;
	ФильтрВыборки.Добавить(Метаданные.Документы.DMS_ЗаявкаНаАвтомобиль);
	Выборка = ПланыОбмена.ВыбратьИзменения(ПланОбмена, 2, ФильтрВыборки);
	
	//Посчитаем количество изменений
	ОбщееКоличество = 0;
	Пока Выборка.Следующий() Цикл
		ОбщееКоличество = ОбщееКоличество + 1;
	КонецЦикла;
	Выборка.Сбросить();
	
	//Заполним таблицы первоначальной информацией из плана обмена
	Счетчик = 0; ВсегоПередано = 0;
	Пока Выборка.Следующий() Цикл
		
		Если Счетчик = 0 Тогда
		
			//Инициализируем таблицы
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	DMS_ЗаявкаНаАвтомобиль.Ссылка,
			|	ЛОЖЬ КАК УдаленнаяЗапись
			|ИЗ
			|	Документ.DMS_ЗаявкаНаАвтомобиль КАК DMS_ЗаявкаНаАвтомобиль";
			ТаблицаЗаявкаНаАвтомобиль = Запрос.Выполнить().Выгрузить();
			ТаблицаЗаявкаНаАвтомобиль.Очистить();
			ТаблицаЗаявкаНаАвтомобиль_ДляУдаленияРегистрации = ТаблицаЗаявкаНаАвтомобиль.Скопировать();
			
		КонецЕсли;
		
		ЭлементИзмененныхДанных = Выборка.Получить();
		
		//формируем общую таблицу для отправки
		Если ТипЗнч(ЭлементИзмененныхДанных.Ссылка) = Тип("ДокументСсылка.DMS_ЗаявкаНаАвтомобиль") Тогда
			Стр = ТаблицаЗаявкаНаАвтомобиль.Добавить();
			Стр.Ссылка = ЭлементИзмененныхДанных.Ссылка;
			Если ТипЗнч(ЭлементИзмененныхДанных) =  Тип("УдалениеОбъекта") Тогда
				Стр.УдаленнаяЗапись = Истина;
			Иначе
				Стр.УдаленнаяЗапись = Ложь;
			КонецЕсли;
			Стр = ТаблицаЗаявкаНаАвтомобиль_ДляУдаленияРегистрации.Добавить();
			Стр.Ссылка = ЭлементИзмененныхДанных.Ссылка;
		КонецЕсли;

		
		Счетчик = Счетчик + 1;
		ВсегоПередано = ВсегоПередано + 1;
		
		Если Счетчик = 1000 ИЛИ ВсегоПередано = ОбщееКоличество Тогда
			
			ОтправитьТаблицуЗаявкаНаАвтомобиль(ТаблицаЗаявкаНаАвтомобиль, BIR, ВебСервис, ПланОбмена, Server);
			
			Счетчик = 0;
			
		КонецЕсли;
		
	КонецЦикла;                      
		
КонецПроцедуры // ВыполнитьОтправкуДанныхВЦентраль()

Процедура ВыполнитьОтправкуЗаявокНаОтгрузку(ПланОбмена)
	
	ВебСервис = ПолучитьПрокси();
	Сериализатор = Новый СериализаторXDTO(ВебСервис.ФабрикаXDTO);
	
	РезультатВыполнения = Новый Структура();
	Server = СтрокаСоединенияИнформационнойБазы();
	BIR = Renault_ОбщийМодуль.ПолучитьBIRБазыДанных();
	
	//Получим ссылки на все изменения
	ФильтрВыборки = Новый Массив;
	ФильтрВыборки.Добавить(Метаданные.Документы.DMS_ЗаявкаНаОтгрузку);
	Выборка = ПланыОбмена.ВыбратьИзменения(ПланОбмена, 2, ФильтрВыборки);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	DMS_ЗаявкаНаОтгрузку.Ссылка
		|ИЗ
		|	Документ.DMS_ЗаявкаНаОтгрузку КАК DMS_ЗаявкаНаОтгрузку
		|ГДЕ
		|	DMS_ЗаявкаНаОтгрузку.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	Период = Новый СтандартныйПериод;
	Период.Вариант = ВариантСтандартногоПериода.Месяц;
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	Выборка = Запрос.Выполнить().Выбрать();
	
	//Посчитаем количество изменений
	ОбщееКоличество = 0;
	Пока Выборка.Следующий() Цикл
		ОбщееКоличество = ОбщееКоличество + 1;
	КонецЦикла;
	Выборка.Сбросить();
	
	//Заполним таблицы первоначальной информацией из плана обмена
	Счетчик = 0; ВсегоПередано = 0;
	Пока Выборка.Следующий() Цикл
		
		Если Счетчик = 0 Тогда
		
			//Инициализируем таблицы
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ первые 1
			|	DMS_ЗаявкаНаОтгрузку.Ссылка,
			|	ЛОЖЬ КАК УдаленнаяЗапись
			|ИЗ
			|	Документ.DMS_ЗаявкаНаОтгрузку КАК DMS_ЗаявкаНаОтгрузку";
			ТаблицаЗаявкаНаОтгрузку = Запрос.Выполнить().Выгрузить();
			ТаблицаЗаявкаНаОтгрузку.Очистить();
			ТаблицаЗаявкаНаОтгрузку_ДляУдаленияРегистрации = ТаблицаЗаявкаНаОтгрузку.Скопировать();
			
		КонецЕсли;
		
		ЭлементИзмененныхДанных = Выборка.Ссылка.ПолучитьОбъект();
		
		//формируем общую таблицу для отправки
		Если ТипЗнч(ЭлементИзмененныхДанных.Ссылка) = Тип("ДокументСсылка.DMS_ЗаявкаНаОтгрузку") Тогда
			Стр = ТаблицаЗаявкаНаОтгрузку.Добавить();
			Стр.Ссылка = ЭлементИзмененныхДанных.Ссылка;
			Если ТипЗнч(ЭлементИзмененныхДанных) =  Тип("УдалениеОбъекта") Тогда
				Стр.УдаленнаяЗапись = Истина;
			Иначе
				Стр.УдаленнаяЗапись = Ложь;
			КонецЕсли;
		КонецЕсли;

		
		Счетчик = Счетчик + 1;
		ВсегоПередано = ВсегоПередано + 1;
		
		Если Счетчик = 1000 ИЛИ ВсегоПередано = ОбщееКоличество Тогда
			
			ОтправитьТаблицуЗаявкаНаОтгрузку(ТаблицаЗаявкаНаОтгрузку, BIR, ВебСервис, ПланОбмена, Server);
			
			Счетчик = 0;
			
		КонецЕсли;
		
	КонецЦикла;                      
		
КонецПроцедуры

Процедура ОтправитьТаблицуЗаявкаНаОтгрузку(ТаблицаДанных, BIR, ВебСервис, ПланОбмена, Server)
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Ссылка,
	|	Таблица.УдаленнаяЗапись
	|ПОМЕСТИТЬ Врем
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&BIR КАК BIR,
	|	Врем.УдаленнаяЗапись КАК УдаленнаяЗапись,
	|	DMS_ЗаявкаНаОтгрузку.ПометкаУдаления КАК ПометкаУдаления,
	|	DMS_ЗаявкаНаОтгрузку.Номер,
	|	DMS_ЗаявкаНаОтгрузку.Дата,
	|	DMS_ЗаявкаНаОтгрузку.ДатаОтгрузки,
	|	DMS_ЗаявкаНаОтгрузку.VIN,
	|	DMS_ЗаявкаНаОтгрузку.ТочкаОтгрузки,
	|	DMS_ЗаявкаНаОтгрузку.АдресОтгрузки
	|ИЗ
	|	Врем КАК Врем
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.DMS_ЗаявкаНаОтгрузку КАК DMS_ЗаявкаНаОтгрузку
	|		ПО (DMS_ЗаявкаНаОтгрузку.Ссылка = Врем.Ссылка)";
	Запрос.УстановитьПараметр("Таблица", ТаблицаДанных);
	Запрос.УстановитьПараметр("BIR", BIR);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	ТаблицаРезультатыОбработки = Запрос.Выполнить().Выгрузить();

	
	Фабрика = ВебСервис.ФабрикаXDTO;
	Сериализатор = Новый СериализаторXDTO(Фабрика);
	Результат = Сериализатор.ЗаписатьXDTO(ТаблицаРезультатыОбработки);
	ДанныеОтправлены = ВебСервис.SetData("SetOrderOnShip", Результат, Server);
	
	Если ДанныеОтправлены = Истина Тогда
		Для Каждого КлючевыеПоля из ТаблицаДанных Цикл
			ПланыОбмена.УдалитьРегистрациюИзменений(ПланОбмена, КлючевыеПоля.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьТаблицуЗаявкаНаАвтомобиль(ТаблицаДанных, BIR, ВебСервис, ПланОбмена, Server)
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Ссылка,
	|	Таблица.УдаленнаяЗапись
	|ПОМЕСТИТЬ Врем
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&BIR КАК BIR,
	|	Врем.Ссылка КАК Ссылка,
	|	Врем.УдаленнаяЗапись КАК УдаленнаяЗапись,
	|	DMS_ЗаявкаНаАвтомобиль.ПометкаУдаления КАК ПометкаУдаления,
	|	DMS_ЗаявкаНаАвтомобиль.Номер,
	|	DMS_ЗаявкаНаАвтомобиль.Дата,
	|	DMS_ЗаявкаНаАвтомобиль.DataAra,
	|	DMS_ЗаявкаНаАвтомобиль.NumCl,
	|	DMS_ЗаявкаНаАвтомобиль.VIN,
	|	ВЫБОР
	|		КОГДА НЕ АдресКлиентаОсновной.Представление ЕСТЬ NULL
	|			ТОГДА АдресКлиентаОсновной.Представление
	|		ИНАЧЕ ЕСТЬNULL(АдресКлиента.Представление, """")
	|	КОНЕЦ КАК АдресПредставление,
	|	DMS_ЗаявкаНаАвтомобиль.ДатаЖелаемойПоставки,
	|	DMS_ЗаявкаНаАвтомобиль.Город,
	|	DMS_ЗаявкаНаАвтомобиль.Дом,
	|	DMS_ЗаявкаНаАвтомобиль.Индекс,
	|	DMS_ЗаявкаНаАвтомобиль.Квартира,
	|	DMS_ЗаявкаНаАвтомобиль.Комментарий,
	|	DMS_ЗаявкаНаАвтомобиль.Корпус,
	|	DMS_ЗаявкаНаАвтомобиль.НаселенныйПункт,
	|	DMS_ЗаявкаНаАвтомобиль.НомерDevis,
	|	DMS_ЗаявкаНаАвтомобиль.Опции,
	|	DMS_ЗаявкаНаАвтомобиль.ПродавецСтрока,
	|	DMS_ЗаявкаНаАвтомобиль.Район,
	|	DMS_ЗаявкаНаАвтомобиль.РегистрируемВMyRenault,
	|	DMS_ЗаявкаНаАвтомобиль.СогласиеНаКоммуникацию,
	|	DMS_ЗаявкаНаАвтомобиль.Страна,
	|	DMS_ЗаявкаНаАвтомобиль.Счет,
	|	DMS_ЗаявкаНаАвтомобиль.ТипДома,
	|	DMS_ЗаявкаНаАвтомобиль.ТипКвартиры,
	|	DMS_ЗаявкаНаАвтомобиль.ТипКорпуса,
	|	DMS_ЗаявкаНаАвтомобиль.Улица,
	|	DMS_ЗаявкаНаАвтомобиль.НомерОрдера,
	|	DMS_ЗаявкаНаАвтомобиль.ДатаПрикрепления,
	|	DMS_ЗаявкаНаАвтомобиль.ДатаОткрепления,
	|	DMS_ЗаявкаНаАвтомобиль.ДатаПродажи,
	|	DMS_ЗаявкаНаАвтомобиль.ДатаСозданияЗаявки,
	|	DMS_ЗаявкаНаАвтомобиль.Аннулирована,
	|	DMS_ЗаявкаНаАвтомобиль.ДатаАннуляции,
	|	DMS_ЗаявкаНаАвтомобиль.ОбычнаяСделка,
	|	DMS_ЗаявкаНаАвтомобиль.Конверсия,
	|	DMS_ЗаявкаНаАвтомобиль.Лизинг,
	|	DMS_ЗаявкаНаАвтомобиль.Кузовостроитель,
	|	DMS_ЗаявкаНаАвтомобиль.ЛизинговаяКомпания,
	|	DMS_ЗаявкаНаАвтомобиль.ПерепродажаОформлена,
	|	DMS_ЗаявкаНаАвтомобиль.Представление,
	|	DMS_ЗаявкаНаАвтомобиль.Версия.Артикул КАК ВерсияАртикул,
	|	DMS_ЗаявкаНаАвтомобиль.Цвет.Артикул КАК ЦветАртикул,
	|	DMS_ЗаявкаНаАвтомобиль.Цвет.Наименование КАК ЦветНаименование,
	|	DMS_ЗаявкаНаАвтомобиль.ЦветСалона.Артикул КАК ЦветСалонаАртикул,
	|	DMS_ЗаявкаНаАвтомобиль.ЦветСалона.Наименование КАК ЦветСалонаНаименование,
	|	DMS_ЗаявкаНаАвтомобиль.Модель.Артикул КАК МодельАртикул,
	|	DMS_ЗаявкаНаАвтомобиль.КоммерческаяАкция1.Код КАК КоммерческаяАкция1Код,
	|	DMS_ЗаявкаНаАвтомобиль.КоммерческаяАкция2.Код КАК КоммерческаяАкция2Код,
	|	DMS_ЗаявкаНаАвтомобиль.КоммерческаяАкция3.Код КАК КоммерческаяАкция3Код,
	|	DMS_ЗаявкаНаАвтомобиль.КоммерческаяАкция4.Код КАК КоммерческаяАкция4Код,
	|	DMS_ЗаявкаНаАвтомобиль.КоммерческаяАкция5.Код КАК КоммерческаяАкция5Код,
	|	DMS_ЗаявкаНаАвтомобиль.ВариантСалона.Артикул КАК ВариантСалонаАртикул,
	|	ПРЕДСТАВЛЕНИЕ(DMS_ЗаявкаНаАвтомобиль.ТипАвтомобиля),
	|	DMS_ЗаявкаНаАвтомобиль.СпособОплаты.Наименование,
	|	DMS_ЗаявкаНаАвтомобиль.ТипЗаявки.Наименование,
	|	DMS_ЗаявкаНаАвтомобиль.Клиент.Наименование,
	|	DMS_ЗаявкаНаАвтомобиль.Клиент.НаименованиеПолное,
	|	DMS_ЗаявкаНаАвтомобиль.Клиент.Фамилия,
	|	DMS_ЗаявкаНаАвтомобиль.Клиент.Имя,
	|	DMS_ЗаявкаНаАвтомобиль.Клиент.Отчество,
	|	DMS_ЗаявкаНаАвтомобиль.Клиент.ОсновнойТелефон,
	|	ПРЕДСТАВЛЕНИЕ(DMS_ЗаявкаНаАвтомобиль.Клиент.ВидКонтрагента),
	|	DMS_ЗаявкаНаАвтомобиль.Клиент.ДатаРождения,
	|	DMS_ЗаявкаНаАвтомобиль.Клиент.ИНН,
	|	ПРЕДСТАВЛЕНИЕ(DMS_ЗаявкаНаАвтомобиль.Клиент.ФормаСобственности),
	|	DMS_ЗаявкаНаАвтомобиль.Модель.Наименование,
	|	DMS_ЗаявкаНаАвтомобиль.ВариантСалона.Наименование,
	|	DMS_ЗаявкаНаАвтомобиль.Версия.Наименование,
	|	DMS_ЗаявкаНаАвтомобиль.Версия.НаименованиеПолное,
	|	КонтактнаяИнформация.Представление КАК КлиентЕмаил,
	|	DMS_ЗаявкаНаАвтомобиль.Клиент,
	|	ПРЕДСТАВЛЕНИЕ(DMS_ЗаявкаНаАвтомобиль.Клиент.Пол) КАК КлиентПол,
	|	ПодтверждающиеДокументы.Серия КАК ПаспортСерия,
	|	ПодтверждающиеДокументы.Номер КАК ПаспортНомер,
	|	ПодтверждающиеДокументы.ДатаВыдачи КАК ПаспортДатаВыдачи,
	|	DMS_ЗаявкаНаАвтомобиль.ДилерскийЦентр,
	|	DMS_ЗаявкаНаАвтомобиль.ЦентрализованныйКонтракт,
	|	DMS_ЗаявкаНаАвтомобиль.РегистрируемВКорпПортале
	|ИЗ
	|	Врем КАК Врем
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.DMS_ЗаявкаНаАвтомобиль КАК DMS_ЗаявкаНаАвтомобиль
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|			ПО DMS_ЗаявкаНаАвтомобиль.Клиент = КонтактнаяИнформация.Объект
	|				И (КонтактнаяИнформация.ЗначениеПоУмолчанию = ИСТИНА)
	|				И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресКлиентаОсновной
	|			ПО (DMS_ЗаявкаНаАвтомобиль.Клиент = КонтактнаяИнформация.Объект)
	|				И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|				И (КонтактнаяИнформация.ЗначениеПоУмолчанию = ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				КонтактнаяИнформация.Объект КАК Объект,
	|				МАКСИМУМ(КонтактнаяИнформация.Представление) КАК Представление
	|			ИЗ
	|				РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|			ГДЕ
	|				КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|				И КонтактнаяИнформация.Объект В (ВЫБРАТЬ
    |                          	Врем.Ссылка.Клиент
    |                          ИЗ
    |                          	Врем КАК Врем)
	|			
	|			СГРУППИРОВАТЬ ПО
	|				КонтактнаяИнформация.Объект) КАК АдресКлиента
	|			ПО DMS_ЗаявкаНаАвтомобиль.Клиент = АдресКлиента.Объект
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|			ПО DMS_ЗаявкаНаАвтомобиль.Клиент = ПодтверждающиеДокументы.Владелец
	|				И (ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Паспорт))
	|				И (ПодтверждающиеДокументы.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|					ИЛИ ПодтверждающиеДокументы.ДатаОкончания > &ТекущаяДата
	|					ИЛИ ПодтверждающиеДокументы.Текущий = ИСТИНА)
	|		ПО (DMS_ЗаявкаНаАвтомобиль.Ссылка = Врем.Ссылка)";
	Запрос.УстановитьПараметр("Таблица", ТаблицаДанных);
	Запрос.УстановитьПараметр("BIR", BIR);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	ТаблицаРезультатыОбработки = Запрос.Выполнить().Выгрузить();

	
	Фабрика = ВебСервис.ФабрикаXDTO;
	
	ТаблицаРезультатыОбработки.Колонки.Добавить("UID", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "UID", 40);
	ТаблицаРезультатыОбработки.Колонки.Добавить("КлиентUID", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "UID", 40);
	ТаблицаРезультатыОбработки.Колонки.Добавить("Пользователь");
	ТаблицаРезультатыОбработки.Колонки.Добавить("ДЦUID", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "UID", 40);
	ТаблицаРезультатыОбработки.Колонки.Добавить("ДилерскийЦентрНаименование");
	ТаблицаРезультатыОбработки.Колонки.Добавить("ДилерскийЦентрBIR");

	// КовалевЕС от 31.01.20 {
	// Добавлено для переноса параметров расчета минимальной даты поставки
	// Сделано не через запрос, т.к. он по ни понятным причинам не открывается в консоли.	
	ТаблицаРезультатыОбработки.Колонки.Добавить("ДатаОтсчета",     Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаРезультатыОбработки.Колонки.Добавить("НазваниеДаты",    Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(150)));
	ТаблицаРезультатыОбработки.Колонки.Добавить("СрокДоставки",    Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
	ТаблицаРезультатыОбработки.Колонки.Добавить("СрокНаСкладе",    Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
	ТаблицаРезультатыОбработки.Колонки.Добавить("СрокПодготовки",  Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
	ТаблицаРезультатыОбработки.Колонки.Добавить("ОписаниеРасчета", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(200)));
	ТаблицаРезультатыОбработки.Колонки.Добавить("МинимальнаяДатаПоставки", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаРезультатыОбработки.Колонки.Добавить("ЛокальноВДМС",    Новый ОписаниеТипов("Булево"));
	// КовалевЕС от 31.01.20 } 
	
	Для Каждого СтрокаТЗ ИЗ ТаблицаРезультатыОбработки Цикл
		Если ЗначениеЗаполнено(СтрокаТЗ.Ссылка) Тогда
			СтрокаТЗ.UID = Строка(СтрокаТЗ.Ссылка.УникальныйИдентификатор());
		КонецЕсли; 

		Если ЗначениеЗаполнено(СтрокаТЗ.ДилерскийЦентр) Тогда
			СтрокаТЗ.ДЦUID = Строка(СтрокаТЗ.ДилерскийЦентр.УникальныйИдентификатор());
			СтрокаТЗ.ДилерскийЦентрНаименование =  СтрокаТЗ.ДилерскийЦентр.Наименование;
			СтрокаТЗ.ДилерскийЦентрBIR = СтрокаТЗ.ДилерскийЦентр.BIR;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТЗ.Клиент) Тогда
			СтрокаТЗ.КлиентUID = Строка(СтрокаТЗ.Клиент.УникальныйИдентификатор());
		КонецЕсли;
		СтрокаТЗ.Пользователь = ВебСервис.Пользователь;
		
		// КовалевЕС от 31.01.20 {
		// Добавлено для переноса параметров расчета минимальной даты поставки
		// Сделано не через запрос, т.к. он по ни понятным причинам не открывается в консоли.
		Если ЗначениеЗаполнено(СтрокаТЗ.Ссылка) Тогда
			ПараметрыРасчета = РегистрыСведений.DMS_АрхивРасчетовМинДатыПоставки.ПолучитьПараметрыРасчетаМинДатыПоставки(СтрокаТЗ.Ссылка, СтрокаТЗ.VIN);
			
			Если ПараметрыРасчета <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(СтрокаТЗ, ПараметрыРасчета,, "VIN");
			КонецЕсли;
 		КонецЕсли;
		// КовалевЕС от 31.01.20 } 
	КонецЦикла;
	
	ТаблицаРезультатыОбработки.Колонки.Удалить("Ссылка");
	ТаблицаРезультатыОбработки.Колонки.Удалить("Клиент");
	ТаблицаРезультатыОбработки.Колонки.Удалить("ДилерскийЦентр");
	
	Сериализатор = Новый СериализаторXDTO(Фабрика);
	Результат = Сериализатор.ЗаписатьXDTO(ТаблицаРезультатыОбработки);
	ДанныеОтправлены = ВебСервис.SetData("SetOrderOnAuto", Результат, Server);
	
	Если ДанныеОтправлены = Истина Тогда
		Для Каждого КлючевыеПоля из ТаблицаДанных Цикл
			ПланыОбмена.УдалитьРегистрациюИзменений(ПланОбмена, КлючевыеПоля.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьАдресаДоставки (Параметр1 = Неопределено) Экспорт
	
	Попытка 
		
		Сервер = СтрокаСоединенияИнформационнойБазы();
		ВебСервис = ПолучитьПрокси();
		ВыборкаДилеров = Справочники.CRM_ДилерскиеЦентры.Выбрать();
		
		Пока ВыборкаДилеров.Следующий() Цикл
			
			ПакетXDTO = ВебСервис.GetAdressOnShip(Лев(ВыборкаДилеров.BIR,8),Сервер);
			ТаблицаДанных = СериализаторXDTO.ПрочитатьXDTO(ПакетXDTO);
			Если ТаблицаДанных.Количество() > 0 Тогда
				Набор = РегистрыСведений.DMS_АдресаРазгрузкиДилеров.СоздатьНаборЗаписей();
				Набор.Отбор.BIR.Установить(Лев(ВыборкаДилеров.BIR,8));
				Набор.Загрузить(ТаблицаДанных);
				Набор.Записать();
			КонецЕсли;
		КонецЦикла;
		РегистрыСведений.DMS_МониторингРегламентныхЗаданий.ЗавершениеЗадания(
		ПредопределенноеЗначение("Справочник.DMS_НастройкаРегламентныхЗаданий.ЗагрузитьАдресаДоставки"),
		ТекущаяДатаСеанса());
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗагрузитьСпрПричинНеВозможностиВыдачи () Экспорт 
	
	Попытка 
		
		Сервер = СтрокаСоединенияИнформационнойБазы();
		ВебСервис = ПолучитьПрокси();
			
			ПакетXDTO = ВебСервис.GetDicshNotIssuing();
			ТаблицаДанных = СериализаторXDTO.ПрочитатьXDTO(ПакетXDTO);
			Для Каждого СтрТЗ из ТаблицаДанных Цикл 
				
				СпрПричин = Справочники.Renault_ПричиныНеВыдачи.НайтиПоРеквизиту("ЦентралныйКод", СтрТЗ.UID);
				Если СпрПричин = Справочники.Renault_ПричиныНеВыдачи.ПустаяСсылка() Тогда
					СпрОбъект = Справочники.Renault_ПричиныНеВыдачи.СоздатьЭлемент();
					СпрОбъект.ЦентралныйКод = СтрТЗ.UID;
					СпрОбъект.УстановитьНовыйКод();
				Иначе
					СпрОбъект = СпрПричин.ПолучитьОбъект();
				КонецЕсли;

				СпрОбъект.Активный = СтрТЗ.Активный;
				СпрОбъект.Наименование = СтрТЗ.Наименование;
				СпрОбъект.Длительность = СтрТЗ.ДниНаУстранения;
				СпрОбъект.Записать();
			КонецЦикла;
		Исключение
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗагрузитьДанныеПлатногоХранения () Экспорт
	
	ДатаАкуальности = Константы.Renault_ДатаАктуальностиДанныхПлатногоХраненияАвто.Получить();
	
	ВебСервер = ПолучитьПрокси ();
	МассивБир = Renault_ЗагрузкаДанныхОбАвтомобиляхПроизводителя.ПолучитьМассивБирДляПолученияДанных();
	ТЗXDTO = ВебСервер.GetPayVins (СериализаторXDTO.ЗаписатьXDTO(МассивБир), ДатаАкуальности);
	
	ТЗДанных = СериализаторXDTO.ПрочитатьXDTO(ТЗXDTO);
		
	Для Каждого СтрТЗ из ТЗДанных Цикл
		
		МенеджерЗаписей = РегистрыСведений.Renault_ПлатноеХранениеАвтоНаСкладе.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписей, СтрТЗ);
		МенеджерЗаписей.Записать();	
		
	КонецЦикла;
	
	Константы.Renault_ДатаАктуальностиДанныхПлатногоХраненияАвто.Установить(НачалоДня(ТекущаяДата()));
КонецПроцедуры
//+++ DMS

Процедура ЗагрузкаСообщенийОбмена() Экспорт
	
	Попытка 
		
		Сервер = СтрокаСоединенияИнформационнойБазы();
		ВебСервис = ПолучитьПроксиСОтбором();
		ВыборкаДилеров = Справочники.CRM_ДилерскиеЦентры.Выбрать();
		
		Пока ВыборкаДилеров.Следующий() Цикл
			
			//Получим номера документов "Заявка на автомобиль" для получения с портала
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	CRM_СобытияПоРабочимЛистамАвтомобилиДляВыдачи.VIN
			               |ПОМЕСТИТЬ втВыдачи
			               |ИЗ
			               |	Документ.CRM_СобытияПоРабочимЛистам.АвтомобилиДляВыдачи КАК CRM_СобытияПоРабочимЛистамАвтомобилиДляВыдачи
			               |ГДЕ
			               |	CRM_СобытияПоРабочимЛистамАвтомобилиДляВыдачи.Ссылка.ВидСобытия = ЗНАЧЕНИЕ(Справочник.CRM_ВидыСобытий.Выдача)
			               |	И CRM_СобытияПоРабочимЛистамАвтомобилиДляВыдачи.Ссылка.ЗавершеноУспешно = ИСТИНА
			               |	И CRM_СобытияПоРабочимЛистамАвтомобилиДляВыдачи.Ссылка.ПометкаУдаления = ЛОЖЬ
			               |	И CRM_СобытияПоРабочимЛистамАвтомобилиДляВыдачи.Ссылка.Дата >= ДАТАВРЕМЯ(2019, 1, 1)
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	DMS_ЗаявкаНаАвтомобиль.Номер
			               |ИЗ
			               |	Документ.DMS_ЗаявкаНаАвтомобиль КАК DMS_ЗаявкаНаАвтомобиль
			               |ГДЕ
			               |	DMS_ЗаявкаНаАвтомобиль.BIR ПОДОБНО ""%"" + &BIR + ""%""
			               |	И DMS_ЗаявкаНаАвтомобиль.Дата >= ДАТАВРЕМЯ(2019, 1, 1)
			               |	И НЕ DMS_ЗаявкаНаАвтомобиль.VIN В
			               |				(ВЫБРАТЬ
			               |					втВыдачи.VIN
			               |				ИЗ
			               |					втВыдачи КАК втВыдачи)";
			Запрос.УстановитьПараметр("BIR", Лев(ВыборкаДилеров.BIR,8));
			НомераДокументов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номер");
			
			НомераДокументовДляОтправки = СериализаторXDTO.ЗаписатьXDTO(НомераДокументов);
			
			ПакетXDTO = ВебСервис.GetDataFromPortalToDealer(Лев(ВыборкаДилеров.BIR,8),Сервер, НомераДокументовДляОтправки);
			//ПакетXDTO = ВебСервис.GetDataFromPortalToDealer(Лев(ВыборкаДилеров.BIR,8),Сервер);
			ТаблицаДанных = СериализаторXDTO.ПрочитатьXDTO(ПакетXDTO);
			Если ТаблицаДанных.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			МассивОбработанных = Новый Массив;
			Для Каждого СтрокаЗаявки из ТаблицаДанных Цикл
				UpdateOrderOnAuto (СтрокаЗаявки);
				МассивОбработанных.Добавить(СтрокаЗаявки.DPUID);
			КонецЦикла;
			
			МассивОбработанных = СериализаторXDTO.ЗаписатьXDTO(МассивОбработанных);
			
			ВебСервис.ConfirmProcessingOrder(МассивОбработанных);
		КонецЦикла;
	Исключение 
		Инфо = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(
		"Загрузка сообщений обмена",
		УровеньЖурналаРегистрации.Ошибка,Метаданные.РегламентныеЗадания.DMS_ОбменДаннымиСДилерскимПорталом,,
		ПодробноеПредставлениеОшибки(Инфо));
	КонецПопытки;


КонецПроцедуры

Процедура ОбработатьОдноСообщение(ДанныеСообщения)
	
	ДвоичныеДанныеФайла = ДанныеСообщения.Данные.Получить();
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	ДвоичныеДанныеФайла.Записать(ИмяВременногоФайла);
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяВременногоФайла);
	ЧтениеXML.Прочитать();
	ЧтениеXML.Прочитать(); // пропуск тэга Message
	Пока ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Цикл
		ТипXDTO = ФабрикаXDTO.Тип(ДанныеСообщения.ПространствоИменДанных, ЧтениеXML.Имя);
		ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипXDTO);
		СтрокаДляВыполнения = ДанныеСообщения.ИмяКомандыОбработки + "(ОбъектXDTO);";
		Выполнить(СтрокаДляВыполнения);
	КонецЦикла;
	ЧтениеXML.Закрыть();
	УдалитьФайлы(ИмяВременногоФайла);
	
КонецПроцедуры

//обновление заявки на автомобиль 
Процедура UpdateOrderOnAuto(СтрЗаявки)
	
	//Закометим по заявке DMSREN-861
	// НАЧАЛО DMSCOR-1678 13.02.2020
	//Если ЗначениеЗаполнено(СтрЗаявки.eshopid) тогда
	//	ЗаписьЖурналаРегистрации("Загрузка и обновление заявок на автомобиль с дилерского портала",УровеньЖурналаРегистрации.Ошибка,,,"Заявки из Онлайн Щоурум не создаются в базе: " + СтрЗаявки.eshopid);
	//	Возврат;
	//КонецЕсли;
	// КОНЕЦ DMSCOR-1678 13.02.2020
	
	Если ЗначениеЗаполнено(СтрЗаявки.UID) тогда
		Заявка = Документы.DMS_ЗаявкаНаАвтомобиль.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрЗаявки.UID)).ПолучитьОбъект();
		Если Заявка <> Неопределено тогда 
			//обновим заявку
			ОбновитьЗаявку(Заявка,СтрЗаявки);
		Иначе 
			//если заявка не найдена по УИД	
			ЗаписьЖурналаРегистрации("Загрузка и обновление заявок на автомобиль с дилерского портала",УровеньЖурналаРегистрации.Ошибка,,,"Не найдена заявка на автомобиль по ГУИД: " + СтрЗаявки.UID);
		КонецЕсли;		
	Иначе//если УИД дилера на заполнен - заявка изначально создана на портале.
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	DMS_ЗаявкаНаАвтомобиль.Ссылка
		|ИЗ
		|	Документ.DMS_ЗаявкаНаАвтомобиль КАК DMS_ЗаявкаНаАвтомобиль
		|ГДЕ
		|	DMS_ЗаявкаНаАвтомобиль.UID = &UID";
		
		Запрос.УстановитьПараметр("UID", СтрЗаявки.DPUID);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Заявка = Выборка.Ссылка.ПолучитьОбъект();	
			ОбновитьЗаявку(Заявка,СтрЗаявки);
		Иначе
			//Автомобиль = Справочники.Автомобили.НайтиПоРеквизиту("VIN",СтрЗаявки.VIN);
			//Если ЗначениеЗаполнено(Автомобиль) тогда //загружаем заявку только если найден автомобиль по VIN.
				Заявка = Документы.DMS_ЗаявкаНаАвтомобиль.СоздатьДокумент();
				ОбновитьЗаявку(Заявка,СтрЗаявки);
			//КонецЕсли;
		КонецЕсли;;
	КонецЕсли;
	
КонецПроцедуры	

//загрузка заявки на отгрузку 
Процедура SetOrderOnShip(ОбъектXDTO)
	
	ТаблицаЗаявок = СериализаторXDTO.ПрочитатьXDTO(ОбъектXDTO);
	
	Для каждого СтрЗаявки из ТаблицаЗаявок Цикл
		ЗаявкаСсылка = Документы.DMS_ЗаявкаНаОтгрузку.НайтиПоРеквизиту("VIN", СтрЗаявки.VIN);
		Если ЗаявкаСсылка = Документы.DMS_ЗаявкаНаОтгрузку.ПустаяСсылка() Тогда
			Заявка 	= Документы.DMS_ЗаявкаНаОтгрузку.СоздатьДокумент();
		Иначе
			Заявка = ЗаявкаСсылка.ПолучитьОбъект();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Заявка,СтрЗаявки,,"Номер");
		Заявка.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
		Заявка.ОбменДанными.Загрузка = Истина;
		Заявка.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура SetAdressOnShip(ОбъектXDTO)
	
	ТаблицаАдресов = СериализаторXDTO.ПрочитатьXDTO(ОбъектXDTO);
	Для каждого СтрТаб из ТаблицаАдресов Цикл
		Запись = РегистрыСведений.DMS_АдресаРазгрузкиДилеров.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись,СтрТаб);
		Запись.Записать();
	КонецЦикла;
	
КонецПроцедуры	

Процедура ОбновитьЗаявку(Заявка,СтрЗаявки)
	
		ЦветСалона = Справочники.DMS_ЦветаСалона.НайтиПоРеквизиту("Артикул",СтрЗаявки.ЦветСалонаАртикул);
		Если ЦветСалона = Справочники.DMS_ЦветаСалона.ПустаяСсылка() и ЗначениеЗаполнено(СтрЗаявки.ЦветСалонаАртикул) тогда
			НовыйЦветСалона = Справочники.DMS_ЦветаСалона.СоздатьЭлемент();
			НовыйЦветСалона.Артикул = СтрЗаявки.ЦветСалонаАртикул;
			НовыйЦветСалона.Наименование = СтрЗаявки.ЦветСалонаАртикул;
			НовыйЦветСалона.Записать();
			ЦветСалона = НовыйЦветСалона.Ссылка;
		КонецЕсли;
		
		Цвет = Справочники.Цвета.НайтиПоРеквизиту("Артикул",СтрЗаявки.ЦветАртикул);
		Если Цвет = Справочники.Цвета.ПустаяСсылка() и ЗначениеЗаполнено(СтрЗаявки.ЦветНаименование) тогда
				НовыйЦвет = Справочники.Цвета.СоздатьЭлемент();
				НовыйЦвет.Артикул = СтрЗаявки.ЦветАртикул;
				НовыйЦвет.Наименование = СтрЗаявки.ЦветНаименование;
				НовыйЦвет.Записать();
				Цвет = НовыйЦвет.Ссылка;
		КонецЕсли;
		
		Модель = Справочники.Модели.НайтиПоРеквизиту("Артикул",СтрЗаявки.МодельАртикул);
		Если Модель = Справочники.Модели.ПустаяСсылка()  и ЗначениеЗаполнено(СтрЗаявки.МодельНаименование)тогда
			НоваяМодель = Справочники.Модели.СоздатьЭлемент();
			НоваяМодель.Артикул = СтрЗаявки.МодельАртикул;
			НоваяМодель.Наименование = СтрЗаявки.МодельНаименование;
			НоваяМодель.ВалютаУчета = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
			НоваяМодель.Записать();
			Модель = НоваяМодель.Ссылка;
		КонецЕсли;
		
		ВариантКомплектации = Справочники.ВариантыКомплектации.НайтиПоРеквизиту("Артикул",СтрЗаявки.ВерсияАртикул,,Модель);  // DMSREN-785
		Если ВариантКомплектации = Справочники.ВариантыКомплектации.ПустаяСсылка() и ЗначениеЗаполнено(СтрЗаявки.ВерсияНаименование)тогда
			НовыйВариант = Справочники.ВариантыКомплектации.СоздатьЭлемент();
			НовыйВариант.Артикул = СтрЗаявки.ВерсияАртикул;
			НовыйВариант.Наименование = СтрЗаявки.ВерсияНаименование;
			НовыйВариант.НаименованиеПолное = СтрЗаявки.ВерсияНаименованиеПолное;
			НовыйВариант.Владелец = Модель;
			НовыйВариант.ВалютаУчета = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
			НовыйВариант.Записать();
			ВариантКомплектации = НовыйВариант.Ссылка;
		КонецЕсли;
		
		ВариантСалона = Справочники.DMS_ВариантыСалона.НайтиПоРеквизиту("Артикул",СтрЗаявки.ВариантСалонаАртикул);
		Если ВариантСалона = Справочники.DMS_ВариантыСалона.ПустаяСсылка() и ЗначениеЗаполнено(СтрЗаявки.ВариантСалонаНаименование) тогда
			НовыйВариант = Справочники.DMS_ВариантыСалона.СоздатьЭлемент();
			НовыйВариант.Артикул = СтрЗаявки.ВариантСалонаАртикул;
			НовыйВариант.Наименование = СтрЗаявки.ВариантСалонаНаименование;
			НовыйВариант.Записать();
			ВариантыСалона = НовыйВариант.Ссылка;
		КонецЕсли;
				
		ЗаполнитьЗначенияСвойств(Заявка,СтрЗаявки,,"Номер");
		Заявка.НомерDMS  =  СтрЗаявки.Номер;
		Заявка.UID = СтрЗаявки.DPUID;
		Заявка.Модель = Модель;
		Заявка.Цвет = Цвет;
		Заявка.ЦветСалона = ЦветСалона;
		Заявка.Версия = ВариантКомплектации;
		Заявка.ВариантСалона = ВариантСалона;
		Заявка.КоммерческаяАкция1 = Справочники.DMS_КоммерческиеАкции.НайтиПоКоду(СтрЗаявки.КоммерческаяАкция1Код);
		Заявка.КоммерческаяАкция2 = Справочники.DMS_КоммерческиеАкции.НайтиПоКоду(СтрЗаявки.КоммерческаяАкция2Код);
		Заявка.КоммерческаяАкция3 = Справочники.DMS_КоммерческиеАкции.НайтиПоКоду(СтрЗаявки.КоммерческаяАкция3Код);
		Заявка.КоммерческаяАкция4 = Справочники.DMS_КоммерческиеАкции.НайтиПоКоду(СтрЗаявки.КоммерческаяАкция4Код);
		Заявка.КоммерческаяАкция5 = Справочники.DMS_КоммерческиеАкции.НайтиПоКоду(СтрЗаявки.КоммерческаяАкция5Код);
		Заявка.ТипЗаявки = Справочники.DMS_ТипыЗаявки.НайтиПоНаименованию(СтрЗаявки.ТипЗаявки);
		
		Если НЕ ЗначениеЗаполнено(Заявка.Клиент) Тогда
			Заявка.Клиент = СоздатьОбновитьКлиента(СтрЗаявки);
		КонецЕсли;
		
		// НАЧАЛО DMSCOR-1601 18.12.2019
		Если НЕ ЗначениеЗаполнено(Заявка.Клиент) Тогда
			ЗаписьЖурналаРегистрации(
			"Загрузка сообщений обмена",
			УровеньЖурналаРегистрации.Ошибка,Метаданные.РегламентныеЗадания.DMS_ОбменДаннымиСДилерскимПорталом,,
			"Нет данных по клиенту в заявке на автомобиль по VIN " + СтрЗаявки.VIN + Символы.ПС + "Данные по заявке не были обновлены. Проверьте данные на дилерском портале");
			Возврат;
		КонецЕсли;
		// КОНЕЦ DMSCOR-1601 18.12.2019
		
		Заявка.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;  // не регистрируем для обмена.
		
		Если Заявка.Аннулирована ИЛИ СтрЗаявки.УдаленнаяЗапись ИЛИ Заявка.ПометкаУдаления Тогда
			Заявка.ПометкаУдаления = Истина;
			Заявка.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Иначе
			Заявка.ПометкаУдаления = Ложь; //DMSCOR-1601
			Заявка.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		
КонецПроцедуры

Функция СоздатьОбновитьКлиента(СтрЗаявки)
	
	ГруппаКлиентовДП = Справочники.Контрагенты.НайтиПоНаименованию("Клиенты с Дилерского портала",Истина);
	Если НЕ ЗначениеЗаполнено(ГруппаКлиентовДП) Тогда
		НовГруппа = Справочники.Контрагенты.СоздатьГруппу();
		НовГруппа.Наименование = "Клиенты с Дилерского портала";
		НовГруппа.Записать();
		ГруппаКлиентовДП = НовГруппа.Ссылка;
	КонецЕсли;
		
	//пропробуем найти клиента по договору купли-продажи
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ДоговорСоставДоговора.Ссылка.КлиентДоговора КАК Клиент
		|ИЗ
		|	Документ.Renault_Договор.СоставДоговора КАК Renault_ДоговорСоставДоговора
		|ГДЕ
		|	Renault_ДоговорСоставДоговора.VIN = &VIN";
	
	Запрос.УстановитьПараметр("VIN", СтрЗаявки.VIN);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Клиент;
	КонецЕсли;
	
	//пропробуем найти клиента по ИНН/ФИО
	Если СтрЗаявки.КлиентФормаСобственностиПредставление = "Юридическое лицо" Тогда
		ВидКлиента = Перечисления.ФормыСобственности.ЮридическоеЛицо;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Клиент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ИНН = &ИНН";
		
		Запрос.УстановитьПараметр("ИНН",СтрЗаявки.КлиентИНН);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Клиент;
		КонецЕсли;
	Иначе
		ВидКлиента = Перечисления.ФормыСобственности.ЧастноеЛицо;	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Клиент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Фамилия = &Фамилия
		|	И Контрагенты.Имя = &Имя
		|	И Контрагенты.Отчество = &Отчество";
		
		Запрос.УстановитьПараметр("Фамилия",СтрЗаявки.КлиентФамилия);
		Запрос.УстановитьПараметр("Имя",СтрЗаявки.КлиентИмя);
		Запрос.УстановитьПараметр("Отчество",СтрЗаявки.КлиентОтчество);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Клиент;
		ИначеЕсли ЗначениеЗаполнено(СтрЗаявки.КлиентТелефон) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	КонтактнаяИнформация.Объект
			|ИЗ
			|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
			|ГДЕ
			|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
			|	И КонтактнаяИнформация.Представление = &Телефон
			|	И ТИПЗНАЧЕНИЯ(КонтактнаяИнформация.Объект) = ТИП(Справочник.Контрагенты)";
			
			Запрос.УстановитьПараметр("Телефон", СтрЗаявки.КлиентТелефон);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Возврат Выборка.Объект;	
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;	
	
	// НАЧАЛО DMSCOR-1601 18.12.2019
	Если НЕ ЗначениеЗаполнено(СтрЗаявки.КлиентНаименование) И НЕ ЗначениеЗаполнено(СтрЗаявки.КлиентНаименованиеПолное) И НЕ ЗначениеЗаполнено(СтрЗаявки.КлиентИНН)
		И НЕ ЗначениеЗаполнено(СтрЗаявки.КлиентФамилия) И НЕ ЗначениеЗаполнено(СтрЗаявки.КлиентИмя) И НЕ ЗначениеЗаполнено(СтрЗаявки.КлиентОтчество) Тогда
			
		Возврат Справочники.Контрагенты.ПустаяСсылка();
		
	КонецЕсли;
	// КОНЕЦ DMSCOR-1601 18.12.2019
	
	КлиентФамилия = ОпределитьТолькоФамилию(СтрЗаявки.КлиентФамилия);
	
	КлиентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
	КлиентОбъект.Родитель = ГруппаКлиентовДП;
	КлиентОбъект.ИНН = СтрЗаявки.КлиентИНН;
	КлиентОбъект.Наименование = СокрЛП(КлиентФамилия) + " " + СокрЛП(СтрЗаявки.КлиентИмя) + " " + СокрЛП(СтрЗаявки.КлиентОтчество); //DMSREN-447 //СтрЗаявки.КлиентНаименование;
	КлиентОбъект.НаименованиеПолное = 
		?(ЗначениеЗаполнено(СтрЗаявки.КлиентНаименованиеПолное),
			СтрЗаявки.КлиентНаименованиеПолное,
			СтрЗаявки.КлиентНаименование);
	КлиентОбъект.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Спрашивать;
	КлиентОбъект.Фамилия = СокрЛП(КлиентФамилия);
	КлиентОбъект.Имя = СокрЛП(СтрЗаявки.КлиентИмя);
	КлиентОбъект.Отчество = СокрЛП(СтрЗаявки.КлиентОтчество);
	КлиентОбъект.ФормаСобственности = ВидКлиента;
	КлиентОбъект.УстановитьНовыйКод();
	
	Если СтрЗаявки.КлиентПол = "Мужской" тогда
		КлиентОбъект.Пол = Перечисления.ПолФизическихЛиц.Мужской;
	ИначеЕсли СтрЗаявки.КлиентПол = "Женский" тогда
		КлиентОбъект.Пол = Перечисления.ПолФизическихЛиц.Женский;	
	Иначе
		КлиентОбъект.Пол = Перечисления.ПолФизическихЛиц.НеУказан;
	КонецЕсли;
	КлиентОбъект.ДатаРождения = СтрЗаявки.КлиентДатаРождения;
	
	КлиентОбъект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель;
	
	КлиентОбъект.Записать();
	
	Клиент = КлиентОбъект.Ссылка;
	
	Попытка
		ДилерскийЦентр = Справочники.CRM_ДилерскиеЦентры.НайтиПоРеквизиту("BIR", СтрЗаявки.BIR);
	Исключение
		ДилерскийЦентр = Справочники.CRM_ДилерскиеЦентры.ПустаяСсылка();
	КонецПопытки;
	
	//запишем контактную информацию
	Если Клиент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
		Если ЗначениеЗаполнено(СтрЗаявки.КлиентАдрес) Тогда
			Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
			Запись.Вид = Справочники.ВидыКонтактнойИнформации.АдресФактический;
			Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
			Запись.Объект = Клиент;
			Запись.Представление = СтрЗаявки.КлиентАдрес;
			Запись.Записать();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрЗаявки.КлиентТелефон) Тогда
			Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
			Запись.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый;
			Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			Запись.Объект = Клиент;
			Запись.Представление = СтрЗаявки.КлиентТелефон;
			
			// Крайнев МА [DMSCOR-972] 09.01.2018 +++
			СтруктураТелефона = Renault_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруТелефонаПоПолям(Запись.Представление, ДилерскийЦентр);

			Если Не ЗначениеЗаполнено(Запись.Поле1) Тогда								
				Запись.Поле1 = СтруктураТелефона.Поле1
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Запись.Поле2) Тогда
				Запись.Поле2 = СтруктураТелефона.Поле2;
				Запись.Поле3 = СтруктураТелефона.Поле3;
			КонецЕсли;
			// Крайнев МА ---
			
			Запись.Записать();
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(СтрЗаявки.КлиентАдрес) Тогда
			Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
			Запись.Вид = Справочники.ВидыКонтактнойИнформации.АдресЮридический;
			Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
			Запись.Объект = Клиент;
			Запись.Представление = СтрЗаявки.КлиентАдрес;
			Запись.Записать();
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрЗаявки.КлиентТелефон) Тогда
			Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
			Запись.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонРабочий;
			Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			Запись.Объект = Клиент;
			Запись.Представление = СтрЗаявки.КлиентТелефон;
			
			// Крайнев МА [DMSCOR-972] 09.01.2018 +++
			СтруктураТелефона = Renault_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруТелефонаПоПолям(Запись.Представление, ДилерскийЦентр);

			Если Не ЗначениеЗаполнено(Запись.Поле1) Тогда								
				Запись.Поле1 = СтруктураТелефона.Поле1
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Запись.Поле2) Тогда
				Запись.Поле2 = СтруктураТелефона.Поле2;
				Запись.Поле3 = СтруктураТелефона.Поле3;
			КонецЕсли;
			// Крайнев МА ---
			
			Запись.Записать();
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрЗаявки.КлиентEmail) Тогда
		Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		Запись.Вид = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий;
		Запись.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		Запись.Объект = Клиент;
		Запись.Представление = СтрЗаявки.КлиентEmail;
		Запись.Записать();
	КонецЕсли;
	
	Возврат Клиент;
	
КонецФункции

Функция ВернутьСписокДоступныхКоммерческихАкций(VIN) Экспорт
	Попытка 
		СписокАкций = Новый СписокЗначений;
		ВебСервис = ПолучитьПрокси();
		ТаблицаРезультат = СериализаторXDTO.ПрочитатьXDTO(ВебСервис.GetCommCampagin(VIN));
		
		Для каждого Стр из ТаблицаРезультат Цикл
			Акция = Справочники.DMS_КоммерческиеАкции.НайтиПоКоду(Стр.Код);
			Если Акция = Справочники.DMS_КоммерческиеАкции.ПустаяСсылка() тогда
				НовЭл = Справочники.DMS_КоммерческиеАкции.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(НовЭл,Стр);
				НовЭл.Записать();
				Акция = НовЭл.Ссылка;
			КонецЕсли;			
			СписокАкций.Добавить(Акция);
		КонецЦикла;
		
		Акция = Справочники.DMS_КоммерческиеАкции.НайтиПоКоду("0000");
		Если Акция = Справочники.DMS_КоммерческиеАкции.ПустаяСсылка() тогда
				НовЭл = Справочники.DMS_КоммерческиеАкции.СоздатьЭлемент();
				НовЭл.Код = "0000";
				НовЭл.Наименование = "Без коммерч. акции";
				НовЭл.Записать();
				Акция = НовЭл.Ссылка;
		КонецЕсли;	
			
		Если СписокАкций.НайтиПоЗначению(Акция) = Неопределено Тогда
			СписокАкций.Добавить(Акция);
		КонецЕсли;
		
	Исключение
		
		#Если Клиент Тогда	
			Сообщить("Не удалось получить список доступных коммерческий акции для VIN. " + ОписаниеОшибки()); 
		#Иначе
			ТекстОшибки = "При получении данных для VIN "+ VIN +  " возникла ошибка: "+ ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("Ошибка получения доступных коммерческий акции",УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки); 	
		#КонецЕсли
	КонецПопытки;
	Возврат СписокАкций;
КонецФункции

//*** DMS           

Процедура ПолучитьКонфигурациюПоVIN(ПараметрыВызоваСервера, АдресХранилища) Экспорт
	
	Сериализатор = Новый СериализаторXDTO (ФабрикаXDTO);
	Прокси = ПолучитьПрокси();
	
	ОтветXDTO = Прокси.GetEquipment (ПараметрыВызоваСервера.VIN, ПараметрыВызоваСервера.Счет);
	сОтвет = Сериализатор.ПрочитатьXDTO(ОтветXDTO);
	ПоместитьВоВременноеХранилище(сОтвет, АдресХранилища);
	
КонецПроцедуры

Процедура ОтправитьЗаявкуВДилерскийПортал (ПараметрыВызоваСервера, АдресХранилища) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПОДСТРОКА(DMS_ЗаявкаНаАвтомобиль.ДилерскийЦентр.BIR, 1, 8) КАК BIR,
	|	DMS_ЗаявкаНаАвтомобиль.Ссылка КАК Ссылка,
	|	DMS_ЗаявкаНаАвтомобиль.ПометкаУдаления КАК ПометкаУдаления,
	|	DMS_ЗаявкаНаАвтомобиль.Номер,
	|	DMS_ЗаявкаНаАвтомобиль.Дата,
	|	DMS_ЗаявкаНаАвтомобиль.DataAra,
	|	DMS_ЗаявкаНаАвтомобиль.NumCl,
	|	DMS_ЗаявкаНаАвтомобиль.VIN,
	|	DMS_ЗаявкаНаАвтомобиль.ДатаЖелаемойПоставки,
	|	DMS_ЗаявкаНаАвтомобиль.Город,
	|	DMS_ЗаявкаНаАвтомобиль.Дом,
	|	DMS_ЗаявкаНаАвтомобиль.Индекс,
	|	DMS_ЗаявкаНаАвтомобиль.Квартира,
	|	DMS_ЗаявкаНаАвтомобиль.Комментарий,
	|	DMS_ЗаявкаНаАвтомобиль.Корпус,
	|	DMS_ЗаявкаНаАвтомобиль.НаселенныйПункт,
	|	DMS_ЗаявкаНаАвтомобиль.НомерDevis,
	|	DMS_ЗаявкаНаАвтомобиль.Опции,
	|	DMS_ЗаявкаНаАвтомобиль.ПродавецСтрока,
	|	DMS_ЗаявкаНаАвтомобиль.Район,
	|	DMS_ЗаявкаНаАвтомобиль.РегистрируемВMyRenault,
	|	DMS_ЗаявкаНаАвтомобиль.СогласиеНаКоммуникацию,
	|	DMS_ЗаявкаНаАвтомобиль.Страна,
	|	DMS_ЗаявкаНаАвтомобиль.Счет,
	|	DMS_ЗаявкаНаАвтомобиль.ТипДома,
	|	DMS_ЗаявкаНаАвтомобиль.ТипКвартиры,
	|	DMS_ЗаявкаНаАвтомобиль.ТипКорпуса,
	|	DMS_ЗаявкаНаАвтомобиль.Улица,
	|	DMS_ЗаявкаНаАвтомобиль.НомерОрдера,
	|	DMS_ЗаявкаНаАвтомобиль.ДатаПрикрепления,
	|	DMS_ЗаявкаНаАвтомобиль.ДатаОткрепления,
	|	DMS_ЗаявкаНаАвтомобиль.ДатаПродажи,
	|	DMS_ЗаявкаНаАвтомобиль.ДатаСозданияЗаявки,
	|	DMS_ЗаявкаНаАвтомобиль.Аннулирована,
	|	DMS_ЗаявкаНаАвтомобиль.ДатаАннуляции,
	|	DMS_ЗаявкаНаАвтомобиль.ОбычнаяСделка,
	|	DMS_ЗаявкаНаАвтомобиль.Конверсия,
	|	DMS_ЗаявкаНаАвтомобиль.Лизинг,
	|	DMS_ЗаявкаНаАвтомобиль.Кузовостроитель,
	|	DMS_ЗаявкаНаАвтомобиль.ЛизинговаяКомпания,
	|	DMS_ЗаявкаНаАвтомобиль.ПерепродажаОформлена,
	|	DMS_ЗаявкаНаАвтомобиль.Представление,
	|	DMS_ЗаявкаНаАвтомобиль.Версия.Артикул КАК ВерсияАртикул,
	|	DMS_ЗаявкаНаАвтомобиль.Цвет.Артикул КАК ЦветАртикул,
	|	DMS_ЗаявкаНаАвтомобиль.Цвет.Наименование КАК ЦветНаименование,
	|	DMS_ЗаявкаНаАвтомобиль.ЦветСалона.Артикул КАК ЦветСалонаАртикул,
	|	DMS_ЗаявкаНаАвтомобиль.ЦветСалона.Наименование КАК ЦветСалонаНаименование,
	|	DMS_ЗаявкаНаАвтомобиль.Модель.Артикул КАК МодельАртикул,
	|	DMS_ЗаявкаНаАвтомобиль.КоммерческаяАкция1.Код КАК КоммерческаяАкция1Код,
	|	DMS_ЗаявкаНаАвтомобиль.КоммерческаяАкция2.Код КАК КоммерческаяАкция2Код,
	|	DMS_ЗаявкаНаАвтомобиль.КоммерческаяАкция3.Код КАК КоммерческаяАкция3Код,
	|	DMS_ЗаявкаНаАвтомобиль.КоммерческаяАкция4.Код КАК КоммерческаяАкция4Код,
	|	DMS_ЗаявкаНаАвтомобиль.КоммерческаяАкция5.Код КАК КоммерческаяАкция5Код,
	|	DMS_ЗаявкаНаАвтомобиль.ВариантСалона.Артикул КАК ВариантСалонаАртикул,
	|	ПРЕДСТАВЛЕНИЕ(DMS_ЗаявкаНаАвтомобиль.ТипАвтомобиля),
	|	DMS_ЗаявкаНаАвтомобиль.СпособОплаты.Наименование,
	|	DMS_ЗаявкаНаАвтомобиль.ТипЗаявки.Наименование,
	|	DMS_ЗаявкаНаАвтомобиль.Клиент.Наименование,
	|	DMS_ЗаявкаНаАвтомобиль.Клиент.НаименованиеПолное,
	|	DMS_ЗаявкаНаАвтомобиль.Клиент.Фамилия,
	|	DMS_ЗаявкаНаАвтомобиль.Клиент.Имя,
	|	DMS_ЗаявкаНаАвтомобиль.Клиент.Отчество,
	|	DMS_ЗаявкаНаАвтомобиль.Клиент.ОсновнойТелефон,
	|	ПРЕДСТАВЛЕНИЕ(DMS_ЗаявкаНаАвтомобиль.Клиент.ВидКонтрагента),
	|	DMS_ЗаявкаНаАвтомобиль.Клиент.ДатаРождения,
	|	DMS_ЗаявкаНаАвтомобиль.Клиент.ИНН,
	|	ПРЕДСТАВЛЕНИЕ(DMS_ЗаявкаНаАвтомобиль.Клиент.ФормаСобственности),
	|	DMS_ЗаявкаНаАвтомобиль.Модель.Наименование,
	|	DMS_ЗаявкаНаАвтомобиль.ВариантСалона.Наименование,
	|	DMS_ЗаявкаНаАвтомобиль.Версия.Наименование,
	|	DMS_ЗаявкаНаАвтомобиль.Версия.НаименованиеПолное,
	|	КонтактнаяИнформация.Представление КАК КлиентЕмаил,
	|	DMS_ЗаявкаНаАвтомобиль.Клиент,
	|	ПРЕДСТАВЛЕНИЕ(DMS_ЗаявкаНаАвтомобиль.Клиент.Пол) КАК КлиентПол,
	|	ПодтверждающиеДокументы.Серия КАК ПаспортСерия,
	|	ПодтверждающиеДокументы.Номер КАК ПаспортНомер,
	|	ПодтверждающиеДокументы.ДатаВыдачи КАК ПаспортДатаВыдачи,
	|	DMS_ЗаявкаНаАвтомобиль.ДилерскийЦентр,
	|	DMS_ЗаявкаНаАвтомобиль.РегистрируемВКорпПортале,
	|	КонтактнаяИнформацияАдрес.Представление КАК АдресПредставление,
	|	DMS_АрхивРасчетовМинДатыПоставки.ДатаОтсчета,
	|	DMS_АрхивРасчетовМинДатыПоставки.НазваниеДаты,
	|	DMS_АрхивРасчетовМинДатыПоставки.СрокДоставки,
	|	DMS_АрхивРасчетовМинДатыПоставки.СрокНаСкладе,
	|	DMS_АрхивРасчетовМинДатыПоставки.СрокПодготовки,
	|	DMS_АрхивРасчетовМинДатыПоставки.МинимальнаяДатаПоставки,
	|	DMS_АрхивРасчетовМинДатыПоставки.ОписаниеРасчета
	|ИЗ
	|	Документ.DMS_ЗаявкаНаАвтомобиль КАК DMS_ЗаявкаНаАвтомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО DMS_ЗаявкаНаАвтомобиль.Клиент = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.ЗначениеПоУмолчанию = ИСТИНА)
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|		ПО DMS_ЗаявкаНаАвтомобиль.Клиент = ПодтверждающиеДокументы.Владелец
	|			И (ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Паспорт))
	|			И (ПодтверждающиеДокументы.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ ПодтверждающиеДокументы.ДатаОкончания > &ТекущаяДата
	|				ИЛИ ПодтверждающиеДокументы.Текущий = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияАдрес
	|		ПО DMS_ЗаявкаНаАвтомобиль.Клиент = КонтактнаяИнформацияАдрес.Объект
	|			И (КонтактнаяИнформацияАдрес.ЗначениеПоУмолчанию = ИСТИНА)
	|			И (КонтактнаяИнформацияАдрес.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.DMS_АрхивРасчетовМинДатыПоставки КАК DMS_АрхивРасчетовМинДатыПоставки
	|		ПО DMS_ЗаявкаНаАвтомобиль.Ссылка = DMS_АрхивРасчетовМинДатыПоставки.ЗаявкаНаАвтомобиль
	|			И DMS_ЗаявкаНаАвтомобиль.VIN = DMS_АрхивРасчетовМинДатыПоставки.VIN
	|ГДЕ
	|	DMS_ЗаявкаНаАвтомобиль.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрыВызоваСервера.Ссылка);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	ТаблицаРезультатыОбработки = Запрос.Выполнить().Выгрузить();

	ВебСервис = ПолучитьПрокси();
	Server = СтрокаСоединенияИнформационнойБазы();
	Фабрика = ВебСервис.ФабрикаXDTO;
	
	ТаблицаРезультатыОбработки.Колонки.Добавить("UID", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "UID", 40);
	ТаблицаРезультатыОбработки.Колонки.Добавить("КлиентUID", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "UID", 40);
	ТаблицаРезультатыОбработки.Колонки.Добавить("Пользователь");
	ТаблицаРезультатыОбработки.Колонки.Добавить("ДЦUID", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "UID", 40);
	ТаблицаРезультатыОбработки.Колонки.Добавить("ДилерскийЦентрНаименование");
	ТаблицаРезультатыОбработки.Колонки.Добавить("ДилерскийЦентрBIR");

	Для Каждого СтрокаТЗ ИЗ ТаблицаРезультатыОбработки Цикл
		Если ЗначениеЗаполнено(СтрокаТЗ.Ссылка) Тогда
			СтрокаТЗ.UID = Строка(СтрокаТЗ.Ссылка.УникальныйИдентификатор());
		КонецЕсли; 

		Если ЗначениеЗаполнено(СтрокаТЗ.ДилерскийЦентр) Тогда
			СтрокаТЗ.ДЦUID = Строка(СтрокаТЗ.ДилерскийЦентр.УникальныйИдентификатор());
			СтрокаТЗ.ДилерскийЦентрНаименование =  СтрокаТЗ.ДилерскийЦентр.Наименование;
			СтрокаТЗ.ДилерскийЦентрBIR = СтрокаТЗ.ДилерскийЦентр.BIR;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТЗ.Клиент) Тогда
			СтрокаТЗ.КлиентUID = Строка(СтрокаТЗ.Клиент.УникальныйИдентификатор());
		КонецЕсли;
		СтрокаТЗ.Пользователь = ВебСервис.Пользователь;
	КонецЦикла;
	ТаблицаРезультатыОбработки.Колонки.Удалить("Ссылка");
	ТаблицаРезультатыОбработки.Колонки.Удалить("Клиент");
	ТаблицаРезультатыОбработки.Колонки.Удалить("ДилерскийЦентр");
		
	Сериализатор = Новый СериализаторXDTO(Фабрика);
	Результат = Сериализатор.ЗаписатьXDTO(ТаблицаРезультатыОбработки);
	ДанныеОтправлены = ВебСервис.PutOrderOnAuto(Результат, Server);
	
	сОтвет = Сериализатор.ПрочитатьXDTO(ДанныеОтправлены);
	ПоместитьВоВременноеХранилище(сОтвет, АдресХранилища);
КонецПроцедуры

// +++ Кудинов И.  22.08.2016 
Процедура GetVersionsInteriorColor(ПараметрыВызоваСервера, АдресХранилища) Экспорт
	
	Сериализатор = Новый СериализаторXDTO (ФабрикаXDTO);
	Struct = Сериализатор.ЗаписатьXDTO(ПараметрыВызоваСервера);
	Прокси = ПолучитьПрокси();
	                   
	ОтветXDTO = Прокси.GetVersionsInteriorColor (Struct);
	сОтвет = Сериализатор.ПрочитатьXDTO(ОтветXDTO);
	ПоместитьВоВременноеХранилище(сОтвет, АдресХранилища);
	
КонецПроцедуры  
// --- Кудинов И.  22.08.2016

// Крайнев МА 16.11.2018 +++
Функция ПолучитьПроксиСОтбором()
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	АдресWS = Настройки.АдресWsGate + "ws/DealerPortalSelection.1cws?wsdl"; 
	ЛогинWS = Настройки.ЛогинДоступаКВебСервисам;
	ПарольWS = Настройки.ПарольДоступаКВебСервисам;
	Определение = Новый WSОпределения(АдресWS,ЛогинWS, ПарольWS);
	ВебСервис = Новый WSПрокси(Определение, Определение.Сервисы[0].URIПространстваИмен,Определение.Сервисы[0].Имя,Определение.Сервисы[0].ТочкиПодключения[0].Имя);       
	ВебСервис.Пользователь = ЛогинWS;
	ВебСервис.Пароль = ПарольWS;
	Возврат ВебСервис;
	
КонецФункции
// Крайнев МА 16.11.2018 ---


// Формирование даты желаемой поставки
Функция РассчитатьМинимальныйСрокПоставкиНаДилерскомПортале(VIN, BIR, КорпКлиен = Ложь, КодМодели = "", ВозвратПараметровРасчета = Ложь) Экспорт
	
	Попытка
		ВебСервис       = ПолучитьПрокси();
		ПолученныйОтвет = ВебСервис.GetDeliveryDateNew(VIN, BIR, КорпКлиен, КодМодели, ВозвратПараметровРасчета); 
		Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
		ПолученнаяДата = Сериализатор.ПрочитатьXDTO(ПолученныйОтвет);

		Если ТипЗнч(ПолученнаяДата) = Тип("Дата") Тогда
			ПараметрыРасчета = Новый Структура;
			ПараметрыРасчета.Вставить("МинимальнаяДатаПоставки", ПолученнаяДата);
			
		ИначеЕсли ТипЗнч(ПолученнаяДата) = Тип("Структура") Тогда
			ПараметрыРасчета = ПолученнаяДата;
		Иначе
			ПараметрыРасчета = Новый Структура;
			ПараметрыРасчета.Вставить("МинимальнаяДатаПоставки", Дата(1,1,1));
		КонецЕсли;
	Исключение
		ПараметрыРасчета = Новый Структура;
		ПараметрыРасчета.Вставить("МинимальнаяДатаПоставки", Дата(1,1,1));			
	КонецПопытки;
	
	Возврат ПараметрыРасчета; 
	
КонецФункции

// ВАЖНО! 
// Во избежание появления заявок на автомобиль с некорректной датой желаемой поставки,
// алгоритм расчета "Минимальной даты поставки" в текущей конфигурации "ДМС", 
// должен строго совпадать с алгоритмом расчета в конфигурации "Дилерский портал".
// Если меняется алгоритм расчета в одной конфигурации, то изменения обязательно необходимо внести и в другую конфигурацию.
//
&НаСервере
Функция РассчитатьМинимальныйСрокПоставки(VIN, Счет, КорпКлиен = Ложь, КодМодели = "", ВозвратПараметровРасчета = Ложь) Экспорт
	
	BIR = Прав(Счет, 4);
	
	СрокНаСкладе    = 7 + ?(КорпКлиен, 3, 0);
	СрокПодготовки  = ?(КорпКлиен, 10, 5);
	СрокДоставки    = 1;
	ДопСрок         = 0;
	ТекстДопСрок    = "";
	ДатаОтсчета     = Дата(1,1,1);
	НазваниеДаты    = "";
	ОписаниеРасчета = "";
	
	МинимальнаяДатаПоставки = Дата(1,1,1);
		
	Если ЗначениеЗаполнено(VIN) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	CRM_СостояниеАвтомобилейПроизводителя_v2.VIN,
		|	CRM_СостояниеАвтомобилейПроизводителя_v2.DATE_MADPREV,
		|	CRM_СостояниеАвтомобилейПроизводителя_v2.SKLAD,
		|	CRM_СостояниеАвтомобилейПроизводителя_v2.MODEL,
		|	CRM_СостояниеАвтомобилейПроизводителя_v2.DATE_RECU,
		|	CRM_СостояниеАвтомобилейПроизводителя_v2.DATE_PLAN,
		|	CRM_СостояниеАвтомобилейПроизводителя_v2.DATE_FACT,
		|	CRM_СостояниеАвтомобилейПроизводителя_v2.ID_RECEIVER,
		|	CRM_СостояниеАвтомобилейПроизводителя_v2.GTD,
		|	CRM_СостояниеАвтомобилейПроизводителя_v2.IS_TRANSFER
		|ИЗ
		|	РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
		|ГДЕ
		|	CRM_СостояниеАвтомобилейПроизводителя_v2.VIN = &VIN";
		
		Запрос.УстановитьПараметр("VIN", VIN);
		
		ВыборкаСклад = Запрос.Выполнить().Выбрать();
		ВыборкаСклад.Следующий();

		Если ВыборкаСклад.SKLAD = "PDI" И (ВыборкаСклад.MODEL = "79H" ИЛИ ВыборкаСклад.MODEL = "J1C" ИЛИ ВыборкаСклад.MODEL = "HAH") Тогда
			ДопСрок = 2; 
			ТекстДопСрок = " + " + ДопСрок + " дн. для склада PDI";
		КонецЕсли;			
		
		Если НЕ ЗначениеЗаполнено(ВыборкаСклад.SKLAD) или ВыборкаСклад.SKLAD = "VAZ"  Тогда
			СрокДоставки = ПолучитьСрокДоставки(BIR, ВыборкаСклад.MODEL);
		Иначе
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	МАКСИМУМ(ВложенныйЗапрос.СрокДоставкиПоТочке) КАК СрокДоставкиПоТочке,
			|	МАКСИМУМ(ВложенныйЗапрос.СрокДоставкиБезТочки) КАК СрокДоставкиБезТочки
			|ИЗ
			|	(ВЫБРАТЬ
			|		ЕСТЬNULL(МИНИМУМ(АдресаРазгрузкиДилеров.СрокДоставки), 0) КАК СрокДоставкиПоТочке,
			|		NULL КАК СрокДоставкиБезТочки
			|	ИЗ
			|		РегистрСведений.DMS_АдресаРазгрузкиДилеров КАК АдресаРазгрузкиДилеров
			|	ГДЕ
			|		ПОДСТРОКА(АдресаРазгрузкиДилеров.BIR, 5, 4) = &BIR
			|		И АдресаРазгрузкиДилеров.SKLAD_CODE = &SKLAD
			|		И АдресаРазгрузкиДилеров.idТочка = &ID_RECEIVER
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		NULL,
			|		ЕСТЬNULL(МИНИМУМ(АдресаРазгрузкиДилеров.СрокДоставки), 0)
			|	ИЗ
			|		РегистрСведений.DMS_АдресаРазгрузкиДилеров КАК АдресаРазгрузкиДилеров
			|	ГДЕ
			|		ПОДСТРОКА(АдресаРазгрузкиДилеров.BIR, 5, 4) = &BIR
			|		И АдресаРазгрузкиДилеров.SKLAD_CODE = &SKLAD) КАК ВложенныйЗапрос";
			
			Запрос.УстановитьПараметр("BIR", BIR);
			Запрос.УстановитьПараметр("SKLAD", ВыборкаСклад.SKLAD);
			Запрос.УстановитьПараметр("ID_RECEIVER", ВыборкаСклад.ID_RECEIVER);
			
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			
			Если Выборка.Следующий() Тогда
				СрокДоставки = ?(Выборка.СрокДоставкиПоТочке = 0, Выборка.СрокДоставкиБезТочки, Выборка.СрокДоставкиПоТочке);
			КонецЕсли;
		КонецЕсли;
		
		ИмпортБезГТД   = ПолучитьСтатусАМ(ВыборкаСклад);
		СрокНаСкладе   = ?(ИмпортБезГТД, 10, 7) + ?(КорпКлиен, 3, 0);
		СрокДоставки   = ?(ЗначениеЗаполнено(СрокДоставки),СрокДоставки,0);
		
		// Обрабатываем полученные данные и формируем даты
		DATE_PLAN = ВыборкаСклад.DATE_PLAN;
		Если DATE_PLAN = "" Тогда
			DATE_PLAN = ДАта(1,1,1);
		ИначеЕсли ТипЗнч(ВыборкаСклад.DATE_PLAN) = Тип("Строка")  Тогда
			DATE_PLAN = ПолучитьДатуИзСтроки(ВыборкаСклад.DATE_PLAN);
		КонецЕсли;
		
		DATE_RECU = ВыборкаСклад.DATE_RECU;
		Если DATE_RECU = "" Тогда
			DATE_RECU = ДАта(1,1,1);
		ИначеЕсли ТипЗнч(ВыборкаСклад.DATE_RECU) = Тип("Строка")  Тогда
			DATE_RECU = ПолучитьДатуИзСтроки(ВыборкаСклад.DATE_RECU);
		КонецЕсли;
		
		DATE_MADPREV = ВыборкаСклад.DATE_MADPREV;
		Если DATE_MADPREV = "" Тогда
			DATE_MADPREV = ДАта(1,1,1);
		ИначеЕсли ТипЗнч(ВыборкаСклад.DATE_MADPREV) = Тип("Строка") Тогда
			DATE_MADPREV = ПолучитьДатуИзСтроки(ВыборкаСклад.DATE_MADPREV);
		КонецЕсли;
		
		DATE_FACT = ВыборкаСклад.DATE_FACT;
		Если DATE_FACT = "" Тогда
			DATE_FACT = ДАта(1,1,1);
		ИначеЕсли ТипЗнч(ВыборкаСклад.DATE_FACT) = Тип("Строка") Тогда
			DATE_FACT = ПолучитьДатуИзСтроки(ВыборкаСклад.DATE_FACT);
		КонецЕсли;
		
		// Расчет по производственному календарю, т.е. только по рабочим дням
		Если ЗначениеЗаполнено(DATE_FACT) Тогда
			DATE_FACT_ПоКалендарю = ДатаПоКалендарю(DATE_FACT, СрокДоставки + СрокПодготовки);
						
			Если ТекущаяДата() >= DATE_FACT_ПоКалендарю Тогда
				МинимальнаяДатаПоставки = ДатаПоКалендарю(ТекущаяДата(), СрокПодготовки);
				ДатаОтсчета     = ТекущаяДата();
				НазваниеДаты    = "DATE_FACT";
				ОписаниеРасчета = "Дата отсчета + Срок подгодовки";
			Иначе
				МинимальнаяДатаПоставки = ДатаПоКалендарю(DATE_FACT, СрокДоставки + СрокПодготовки);
				ДатаОтсчета     = DATE_FACT;
				НазваниеДаты    = "DATE_FACT";
				ОписаниеРасчета = "Дата отсчета + Срок доставки + Срок подготовки";
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(DATE_RECU) И ЗначениеЗаполнено(DATE_PLAN) Тогда
			Попытка
				ДопТрансфер = ?(ВыборкаСклад.IS_TRANSFER, СрокНаСкладе + 3, 0);
			Исключение	
				ДопТрансфер = 0;
			КонецПопытки;

			МинимальнаяДатаПоставки = ДатаПоКалендарю(DATE_PLAN, СрокДоставки + СрокПодготовки + ДопТрансфер + ДопСрок);
			ДатаОтсчета     = DATE_PLAN;
			НазваниеДаты    = "DATE_PLAN";
			ОписаниеРасчета = "Дата отсчета + Срок доставки + Срок подгодовки" + ?(ДопТрансфер > 0, " + (Срок на складе + 3 дня)", "") + ТекстДопСрок;
			
		ИначеЕсли ЗначениеЗаполнено(DATE_RECU) И ЗначениеЗаполнено(ВыборкаСклад.SKLAD) Тогда
			ДатаОтсчета     = ТекущаяДата();
			МинимальнаяДатаПоставки = ДатаПоКалендарю(ДатаОтсчета, СрокНаСкладе + СрокДоставки + СрокПодготовки + ДопСрок);
			НазваниеДаты    = "Текущая дата";
			ОписаниеРасчета = "Дата отсчета + Срок на складе + Срок доставки + Срок подготовки" + ТекстДопСрок;
			
		ИначеЕсли ЗначениеЗаполнено(DATE_MADPREV) Тогда
			МинимальнаяДатаПоставки = ДатаПоКалендарю(DATE_MADPREV, СрокНаСкладе + СрокДоставки + СрокПодготовки);
			ДатаОтсчета     = DATE_MADPREV;
			НазваниеДаты    = "DATE_MADPREV";
			ОписаниеРасчета = "Дата отсчета + Срок на складе + Срок доставки + Срок подготовки";
			
		Иначе
			МинимальнаяДатаПоставки = Дата(1,1,1);
		КонецЕсли;
		
	Иначе
		РДПередачи = Дата(1,1,1);
		КолвоДней = 0;
		НеделяМесяца = Цел(День(ТекущаяДата()) / 7);
		НеделяМесяца = ?(НеделяМесяца = 0, 1, НеделяМесяца);
		
		СрокДоставкиПередачи = ПолучитьСрокДоставки(BIR, КодМодели); 
		
		// Определяем 15 число текущего или следующего месяца
		Если НеделяМесяца = 1 ИЛИ НеделяМесяца = 2 Тогда
			РДПередачи = Дата(Год(ТекущаяДата()), Месяц(ТекущаяДата()), 15);                   
		ИначеЕсли НеделяМесяца = 3 ИЛИ НеделяМесяца = 4 Тогда
			РДПередачи = ДобавитьМесяц(Дата(Год(ТекущаяДата()), Месяц(ТекущаяДата()), 15), 1); 
		КонецЕсли;
		
		// Варианты определения даты начала передачи автомобиля, исходя из кода модели
		// Старый вариант, оставлено для истории:
		//Если (КодМодели = "KQ2" ИЛИ КодМодели = "MAU" ИЛИ КодМодели = "MRO" 
		//	ИЛИ КодМодели = "TWZ" ИЛИ КодМодели = "67F" ИЛИ КодМодели = "67P") Тогда 
		//	КолвоДней = (62 + 35 + 7 + ?(КорпКлиент, 14, 5) + СрокДоставкиПередачи) * 86400;
		//	МинимальнаяДатаПоставки = РДПередачи + КолвоДней;
		//	
		//ИначеЕсли КодМодели = "ZGH" Тогда
		//	КолвоДней =(62 + 70 + 7 + ?(КорпКлиент, 14, 5) + СрокДоставкиПередачи) * 86400;
		//	МинимальнаяДатаПоставки = РДПередачи + КолвоДней;
		//	
		//Иначе
		//	КолвоДней = (93 + 7 + ?(КорпКлиент, 7, 5) + СрокДоставкиПередачи) * 86400;
		//	МинимальнаяДатаПоставки = РДПередачи + КолвоДней;
		//КонецЕсли;
		
		// Новый вариант
		КолвоДней = (45 + ?(КорпКлиен, 14, 5) + СрокДоставкиПередачи + 7) * 86400;
		МинимальнаяДатаПоставки = РДПередачи + КолвоДней;

	КонецЕсли;
	
	// Временный код, для того чтобы всегда была заполнена минимальная дата поставки
	Если МинимальнаяДатаПоставки = Дата(1,1,1) Тогда
		ДатаОтсчета     = ДобавитьМесяц(ТекущаяДата(), 2);
		МинимальнаяДатаПоставки = ДатаПоКалендарю(ДатаОтсчета, СрокНаСкладе + СрокДоставки + СрокПодготовки + ДопСрок);
		НазваниеДаты    = "Текущая дата + 2 месяца";
		ОписаниеРасчета = "Дата отсчета + Срок на складе + Срок доставки + Срок подготовки" + ТекстДопСрок;
	КонецЕсли;		

	Если ВозвратПараметровРасчета Тогда
		ПараметрыРасчета = Новый Структура;
		ПараметрыРасчета.Вставить("VIN",                     VIN);
		ПараметрыРасчета.Вставить("ДатаОтсчета",             ДатаОтсчета);
		ПараметрыРасчета.Вставить("НазваниеДаты",            НазваниеДаты);
		ПараметрыРасчета.Вставить("СрокДоставки",            СрокДоставки);
		ПараметрыРасчета.Вставить("СрокНаСкладе",            СрокНаСкладе);
		ПараметрыРасчета.Вставить("СрокПодготовки",          СрокПодготовки);
		ПараметрыРасчета.Вставить("ОписаниеРасчета",         ОписаниеРасчета);
		ПараметрыРасчета.Вставить("МинимальнаяДатаПоставки", МинимальнаяДатаПоставки);
		ПараметрыРасчета.Вставить("ЛокальноВДМС",            Истина);
		
		Возврат ПараметрыРасчета;					
	КонецЕсли;
	
	Возврат МинимальнаяДатаПоставки;
	
КонецФункции 

&НаСервере
Функция ПолучитьСтатусАМ(ВыборкаСклад)
	
	Если (ВыборкаСклад.MODEL ="67F" 
		или ВыборкаСклад.MODEL  = "67P"
			или ВыборкаСклад.MODEL ="ZGH"
				или ВыборкаСклад.MODEL ="TWZ"
					или ВыборкаСклад.MODEL ="MAU") и Не ЗначениеЗаполнено(ВыборкаСклад.GTD) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Возвращает дату, которая отличается указанной даты ДатаОт на количество дней,
// входящих в указанный график или производственный календарь ГрафикРаботы.
//
// Параметры:
//	 ГрафикРаботы	- СправочникСсылка.Календари, СправочникСсылка.ПроизводственныеКалендари - график или 
//                    производственный календарь, который необходимо использовать для расчета даты.
//	 ДатаОт			- Дата - дата, от которой нужно рассчитать количество дней.
//	 КоличествоДней	- Число - количество дней, на которые нужно увеличить дату начала.
//	 ВызыватьИсключение - Булево - если Истина, вызвать исключение в случае незаполненного графика.
//
// Возвращаемое значение:
//	 Дата, Неопределено - дата, увеличенная на количество дней, входящих в график.
//	                      Если выбранный график не заполнен, и ВызыватьИсключение = Ложь, возвращается Неопределено.
//
&НаСервере
Функция ДатаПоКалендарю(Знач ДатаОт, Знач КоличествоДней, ВызыватьИсключение = Истина) Экспорт
	
	ДатаОт = НачалоДня(ДатаОт);
	
	Если КоличествоДней = 0 Тогда
		Возврат ДатаОт;
	КонецЕсли;
	
	МассивДней = Новый Массив;
	МассивДней.Добавить(КоличествоДней);
	
	МассивДат = ДатыПоКалендарю(ДатаОт, МассивДней, , ВызыватьИсключение);
	
	Возврат ?(МассивДат <> Неопределено И МассивДат.Количество() > 0, МассивДат[0], Неопределено);
	
КонецФункции // ДатаПоКалендарю()

// Возвращает количество дней для доставки
//
// Параметры:
//  BIR_ID		 - Строка	 - BIR дилера
//  КодМоделиП	 - Строка	 - Код модели
// 
// Возвращаемое значение:
//  Число - Количество дней доставки
//
&НаСервере
Функция ПолучитьСрокДоставки(BIR_ID, КодМоделиП) Экспорт
		
	Если КодМоделиП = "46L" ИЛИ КодМоделиП =  "46B" ТОГДА
		ПараметрПоискаСклад = "TLT";
	ИначеЕсли КодМоделиП = "79H" ИЛИ КодМоделиП = "HAH" ИЛИ КодМоделиП = "J1C" ТОГДА
		ПараметрПоискаСклад = "CLE";
	Иначе
		ПараметрПоискаСклад = "PLP";
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	АдресаРазгрузкиДилеров.СрокДоставки КАК СрокДоставки
		|ИЗ
		|	РегистрСведений.DMS_АдресаРазгрузкиДилеров КАК АдресаРазгрузкиДилеров
		|ГДЕ
		|	ПОДСТРОКА(АдресаРазгрузкиДилеров.BIR, 5, 4) = &BIR
		|	И АдресаРазгрузкиДилеров.SKLAD_CODE = &SKLAD_CODE
		|
		|УПОРЯДОЧИТЬ ПО
		|	АдресаРазгрузкиДилеров.idТочка";
	
	Запрос.УстановитьПараметр("BIR",        BIR_ID);
	Запрос.УстановитьПараметр("SKLAD_CODE", ПараметрПоискаСклад);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.СрокДоставки;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции // ПолучитьСрокДоставки()

// Возвращает даты, которые отличаются от указанной даты ДатаОт на количество дней,
// входящих в указанный график ГрафикРаботы.
//
// Параметры:
//	 ГрафикРаботы	- СправочникСсылка.Календари, СправочникСсылка.ПроизводственныеКалендари - график или 
//                    производственный календарь, который необходимо использовать для расчета дат.
//	 ДатаОт			- Дата - дата, от которой нужно рассчитать количество дней.
//	 МассивДней		- Массив - количество дней (Число), на которые нужно увеличить дату начала.
//	 РассчитыватьСледующуюДатуОтПредыдущей	- Булево - нужно ли рассчитывать следующую дату от предыдущей или
//											           все даты рассчитываются от переданной даты.
//	 ВызыватьИсключение - Булево - если Истина, вызвать исключение в случае незаполненного графика.
//
// Возвращаемое значение:
//	 Неопределено, Массив - массив дат, увеличенных на количество дней, входящих в график,
//	                        Если график ГрафикРаботы не заполнен, и ВызыватьИсключение = Ложь, возвращается Неопределено.
//
&НаСервере
Функция ДатыПоКалендарю(Знач ДатаОт, Знач МассивДней, Знач РассчитыватьСледующуюДатуОтПредыдущей = Ложь, ВызыватьИсключение = Истина) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СоздатьВТПриращениеДней(МенеджерВременныхТаблиц, МассивДней, РассчитыватьСледующуюДатуОтПредыдущей);
	
	// Алгоритм работает следующим образом:
	// Получаем все дни календаря, следующие после даты отсчета.
	// Для каждого из таких дней рассчитываем количество дней, включенных в график с даты отсчета.
	// Отбираем рассчитанное таким образом количество по таблице приращения дней.
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	// По производственному календарю.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КалендарныеГрафики.ДатаКалендаря КАК ДатаГрафика
	|ПОМЕСТИТЬ ВТПоследующиеДатыГрафика
	|ИЗ
	|	РегистрСведений.DMS_ПроизводственныйКалендарь КАК КалендарныеГрафики
	|ГДЕ
	|	КалендарныеГрафики.ДатаКалендаря >= &ДатаОт
	|	И КалендарныеГрафики.ВидДня В (ЗНАЧЕНИЕ(Перечисление.DMS_ВидыДнейПроизводственногоКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.DMS_ВидыДнейПроизводственногоКалендаря.Предпраздничный))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоследующиеДатыГрафика.ДатаГрафика,
	|	КОЛИЧЕСТВО(КалендарныеГрафики.ДатаГрафика) - 1 КАК КоличествоДнейВключенныхВГрафик
	|ПОМЕСТИТЬ ВТПоследующиеДатыГрафикаСКоличествомДней
	|ИЗ
	|	ВТПоследующиеДатыГрафика КАК ПоследующиеДатыГрафика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПоследующиеДатыГрафика КАК КалендарныеГрафики
	|		ПО (КалендарныеГрафики.ДатаГрафика <= ПоследующиеДатыГрафика.ДатаГрафика)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоследующиеДатыГрафика.ДатаГрафика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриращениеДней.ИндексСтроки,
	|	ЕСТЬNULL(ПоследующиеДни.ДатаГрафика, НЕОПРЕДЕЛЕНО) КАК ДатаПоКалендарю
	|ИЗ
	|	ВТПриращениеДней КАК ПриращениеДней
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоследующиеДатыГрафикаСКоличествомДней КАК ПоследующиеДни
	|		ПО ПриращениеДней.КоличествоДней = ПоследующиеДни.КоличествоДнейВключенныхВГрафик
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПриращениеДней.ИндексСтроки";
	
	Запрос.УстановитьПараметр("ДатаОт", НачалоДня(ДатаОт));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивДат = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивДат.Добавить(Выборка.ДатаПоКалендарю);
	КонецЦикла;
	
	Возврат МассивДат;
	
КонецФункции // ДатыПоКалендарю()

// Создает временную таблицу ВТПриращениеДней, в которой для каждого элемента из МассивДней 
// формируется строка с индексом элемента и значением - количеством дней.
// 
// Параметры:
//	- МенеджерВременныхТаблиц,
//	- МассивДней - массив, количество дней,
//	- РассчитыватьСледующуюДатуОтПредыдущей - необязательный, по умолчанию Ложь.
//
&НаСервере
Процедура СоздатьВТПриращениеДней(МенеджерВременныхТаблиц, Знач МассивДней, Знач РассчитыватьСледующуюДатуОтПредыдущей = Ложь) Экспорт
	
	ПриращениеДней = Новый ТаблицаЗначений;
	ПриращениеДней.Колонки.Добавить("ИндексСтроки", Новый ОписаниеТипов("Число"));
	ПриращениеДней.Колонки.Добавить("КоличествоДней", Новый ОписаниеТипов("Число"));
	
	КоличествоДней = 0;
	НомерСтроки = 0;
	Для Каждого СтрокаДней Из МассивДней Цикл
		КоличествоДней = КоличествоДней + СтрокаДней;
		
		Строка = ПриращениеДней.Добавить();
		Строка.ИндексСтроки			= НомерСтроки;
		Если РассчитыватьСледующуюДатуОтПредыдущей Тогда
			Строка.КоличествоДней	= КоличествоДней;
		Иначе
			Строка.КоличествоДней	= СтрокаДней;
		КонецЕсли;
			
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриращениеДней.ИндексСтроки,
	|	ПриращениеДней.КоличествоДней
	|ПОМЕСТИТЬ ВТПриращениеДней
	|ИЗ
	|	&ПриращениеДней КАК ПриращениеДней";
	
	Запрос.УстановитьПараметр("ПриращениеДней",	ПриращениеДней);
	
	Запрос.Выполнить();
	
КонецПроцедуры // СоздатьВТПриращениеДней()

// Конвертирует строку в дату
//
// Параметры:
//  СтрокаДата	 - Строка	 - Строка с датой
// 
// Возвращаемое значение:
//  Дата - Сконвертированная дата
//
&НаСервере
Функция ПолучитьДатуИзСтроки(СтрокаДата)
	
	ЧастиСтроки1 = Renault_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаДата, " ");
	ЧастиСтроки2 = Renault_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ЧастиСтроки1[0], "/");
	Если ЧастиСтроки2.Количество() < 3 Тогда
		ЧастиСтроки2 = Renault_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ЧастиСтроки1[0], ".");
	КонецЕсли;

	Если Число(ЧастиСтроки2[1])<=12 Тогда
		ДатаВозврат = Дата(ЧастиСтроки2[2], ЧастиСтроки2[1], ЧастиСтроки2[0]);
	Иначе
		ДатаВозврат = Дата(ЧастиСтроки2[2], ЧастиСтроки2[0], ЧастиСтроки2[1]);
	КонецЕсли;
	
	Возврат ДатаВозврат;
	
КонецФункции // ПолучитьДатуИзСтроки()

// Загружает производственный календарь из дилерского портала
//
// Параметры:
//  Год	 - Число	 - Год календаря
//
Процедура ЗагрузитьДанныеПроизводственногоКалендаря(Год) Экспорт
	
	ВебСервер = ПолучитьПрокси();
	МассивБир = Renault_ЗагрузкаДанныхОбАвтомобиляхПроизводителя.ПолучитьМассивБирДляПолученияДанных();
	ТЗXDTO = ВебСервер.GetCalendar(Год);
	
	ТаблицаДанных = СериализаторXDTO.ПрочитатьXDTO(ТЗXDTO);
	
	НаборЗаписей = РегистрыСведений.DMS_ПроизводственныйКалендарь.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Год.Установить(Год);
	
	НаборЗаписейПеренесенные = РегистрыСведений.DMS_ПеренесенныеРабочиеДни.СоздатьНаборЗаписей();
	НаборЗаписейПеренесенные.Отбор.Год.Установить(Год);
	НаборЗаписейПеренесенные.Записать();
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Год = Год;
		НоваяЗапись.ДатаКалендаря = СтрокаТаблицы.Дата;

		Если СтрокаТаблицы.ВидДня = 1 Тогда
			НоваяЗапись.ВидДня = Перечисления.DMS_ВидыДнейПроизводственногоКалендаря.Рабочий;
		ИначеЕсли СтрокаТаблицы.ВидДня = 2 Тогда
			НоваяЗапись.ВидДня = Перечисления.DMS_ВидыДнейПроизводственногоКалендаря.Суббота;
		ИначеЕсли СтрокаТаблицы.ВидДня = 3 Тогда
			НоваяЗапись.ВидДня = Перечисления.DMS_ВидыДнейПроизводственногоКалендаря.Воскресенье;
		ИначеЕсли СтрокаТаблицы.ВидДня = 4 Тогда
			НоваяЗапись.ВидДня = Перечисления.DMS_ВидыДнейПроизводственногоКалендаря.Предпраздничный;
		ИначеЕсли СтрокаТаблицы.ВидДня = 5 Тогда
			НоваяЗапись.ВидДня = Перечисления.DMS_ВидыДнейПроизводственногоКалендаря.Праздник;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ДатаПереноса) Тогда
			
			Если СтрокаТаблицы.ВидДня = 2 
					ИЛИ СтрокаТаблицы.ВидДня = 3
					ИЛИ СтрокаТаблицы.ВидДня = 5 Тогда
					
				НайденнаяСтрока = ТаблицаДанных.Найти(СтрокаТаблицы.ДатаПереноса, "Дата");
				
				Если НайденнаяСтрока <> Неопределено 
						И НайденнаяСтрока.ВидДня = 1 Тогда
					
					МенеджерЗаписиПереносы = РегистрыСведений.DMS_ПеренесенныеРабочиеДни.СоздатьМенеджерЗаписи();	
					МенеджерЗаписиПереносы.Год 			= Год;
					МенеджерЗаписиПереносы.РабочийДень 	= НайденнаяСтрока.Дата;
					МенеджерЗаписиПереносы.ВыходнойДень = СтрокаТаблицы.Дата;
					МенеджерЗаписиПереносы.Записать();
					
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры // ЗагрузитьДанныеПроизводственногоКалендаря()

Функция ОпределитьТолькоФамилию(КлиентФамилия)
	
	Фамилия = СокрЛП(КлиентФамилия);
	
	Пробел = Найти(Фамилия, " ");
	
	Если Пробел Тогда
		Фамилия = Лев(Фамилия, Пробел - 1);
	КонецЕсли;
	
	Возврат Фамилия;
	
КонецФункции
