
//////////////////////////////////////////////////////
//ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтоКлиентСервернаяБаза = Не Найти(СтрокаСоединенияИнформационнойБазы(), "File=");
	//СисИнфо = Новый СистемнаяИнформация;
	//ЭтоWindows = СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86 ИЛИ СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86_64;
	
	Результат = "";
	ОписаниеОшибки = "";
	
	Если ТипЗнч(Параметры.РезультатыЗапуска)="Массив" тогда
		РезультатыЗапуска = Параметры.РезультатыЗапуска;
	Иначе	
		РезультатыЗапуска = новый Массив;
		Для Каждого Решение из ЛицензированиеПоддержка.ПолучитьСписокРешений() Цикл
			ПараметрыФормы = Новый Структура("ОписаниеОшибки,КодОшибки, ПрограммноеОткрытиеФормы, ИмяОбработки, ИмяРешения","",0,Истина, Решение.Ключ, Решение.Значение);
			РезультатыЗапуска.Добавить(ПараметрыФормы);
		КонецЦикла;
		
	КонецЕсли;
	
	
	Для Каждого РезультатЗапуска из РезультатыЗапуска Цикл
		Результат = РезультатЗапуска.ОписаниеОшибки;
		КодОшибки = РезультатЗапуска.КодОшибки;
		
		Если ПустаяСтрока(Результат) Тогда
			Попытка
				Обработка = ЛицензированиеСервер.ПолучитьЗащищеннуюОбработку(РезультатЗапуска.ИмяОбработки, Результат);
			Исключение
				Результат = ОписаниеОшибки();
			КонецПопытки
		КонецЕсли;
		
		Если ПустаяСтрока(Результат) Тогда
			Если Обработка.Компонента.ЗащитаАктивна() Тогда
				Результат = "";
				Результат = СформироватьОписаниеСостоянияСистемыЗащиты(Результат);
			Иначе
				Элементы.КомандаАктивироватьПакетЛицензий.Доступность = Ложь;
			КонецЕсли;
		Иначе
			Элементы.КомандаАктивироватьПакетЛицензий.Доступность = Ложь;
			Результат = СформироватьОписаниеСостоянияСистемыЗащиты(Результат);
		КонецЕсли;
		Если ОписаниеОшибки<>"" Тогда
			ОписаниеОшибки = ОписаниеОшибки + Символы.ПС+Символы.ПС;	
		КонецЕсли;	
			
		ОписаниеОшибки = ОписаниеОшибки + РезультатЗапуска.ИмяРешения + Символы.ПС + Результат;
	КонецЦикла;
	
	//ОписаниеОшибки = Параметры.ОписаниеОшибки;
	//КодОшибки = Параметры.КодОшибки;
	//Объект.ИмяОбработки = Параметры.ИмяОбработки;
	//
	//	
	//Если ПустаяСтрока(ОписаниеОшибки) Тогда
	//	Попытка
	//		Обработка = ЛицензированиеСервер.ПолучитьЗащищеннуюОбработку(Объект.ИмяОбработки, ОписаниеОшибки);
	//	Исключение
	//		ОписаниеОшибки = ОписаниеОшибки();
	//	КонецПопытки
	//КонецЕсли;
	//
	//Если ПустаяСтрока(ОписаниеОшибки) Тогда
	//	Если Обработка.Компонента.ЗащитаАктивна() Тогда
	//		ОписаниеОшибки = "";
	//		ОписаниеОшибки = СформироватьОписаниеСостоянияСистемыЗащиты(ОписаниеОшибки);
	//	Иначе
	//		Элементы.КомандаАктивироватьПакетЛицензий.Доступность = Ложь;
	//	КонецЕсли;
	//Иначе
	//	Элементы.КомандаАктивироватьПакетЛицензий.Доступность = Ложь;
	//	ОписаниеОшибки = СформироватьОписаниеСостоянияСистемыЗащиты(ОписаниеОшибки);
	//КонецЕсли;
	Если ЭтоКлиентСервернаяБаза Тогда
		Элементы.КомандаУстановитьСерверЛицензирования.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////
// КОМАНДЫ ФОРМЫ

// Вызов мастера активации ключа защиты
&НаКлиенте
Процедура КомандаАктивироватьКлюч(Команда)
	ФормаАктивации = ПолучитьФорму("Обработка.УправлениеЛицензированием.Форма.ФормаАктивацииКлючаЗащиты",,ЭтаФорма);
	Результат = ФормаАктивации.ОткрытьМодально();
	ОписаниеОшибки = Результат;
	
	Если ОписаниеОшибки = "" Тогда
		//перезапуск защиты
		ОбновитьПовторноИспользуемыеЗначения();
		
		ПодключитьОбработчикОжидания("Таймаут", 2, Истина);
		
		//#Если ТолстыйКлиентОбычноеПриложение Тогда
		//	ОписаниеОшибки = "";
		//	КодОшибки = 0;
		//	
		//	КлиентскаяСсылка = ЛицензированиеСервер.ПолучитьКлючКлиентскойСсылки(ОписаниеОшибки);
		//	Если КлиентскаяСсылка=Неопределено Тогда
		//		ОписаниеОшибки = СформироватьОписаниеСостоянияСистемыЗащиты(ОписаниеОшибки);
		//		Возврат;
		//	КонецЕсли;
		//	
		//	Ссылка = ЛицензированиеКлиент.ИнформацияОКлиенте(КлиентскаяСсылка);
		//	
		//	ЛицензированиеСервер.УстановитьКлиентскуюСсылку(Ссылка,ОписаниеОшибки);
		//#КонецЕсли
		
		СписокРешений = ЛицензированиеПоддержка.ПолучитьСписокРешений();
		РезультатыЗапуска = новый Массив;
		Ошибка = Ложь;
		
		Для Каждого Решение Из СписокРешений Цикл
			
			ОписаниеОшибки = "";
			КодОшибки = 0;
			
			#Если ТолстыйКлиентОбычноеПриложение Тогда
				
				ОписаниеОшибки = "";
				КодОшибки = 0;
				
				// Проверка и разбор длинного имени
				ИмяОбработки = Решение.Ключ;
				ИмяМакетаХранилища = "";
				ИмяМакетаПараметровЛицензирования = "";
				КороткоеИмяОбработки = "";
				Если НЕ ЛицензированиеСервер.РазделитьИмяОбработки(ИмяОбработки, ИмяМакетаХранилища, ИмяМакетаПараметровЛицензирования, КороткоеИмяОбработки) Тогда
					ОписаниеОшибки = "Неверный формат имени обработки:"+Символы.ПС+ИмяОбработки;
					КодОшибки = 1;
					Возврат;
				КонецЕсли;	
				КлючПродукта = ИмяМакетаХранилища+"."+ИмяМакетаПараметровЛицензирования;
				
				Если НЕ ЛицензированиеКлиент.ВыполнитьПривязкуКлиента(КлючПродукта, ОписаниеОшибки) Тогда
					ОписаниеОшибки = СформироватьОписаниеСостоянияСистемыЗащиты(ОписаниеОшибки);
					Возврат;
				КонецЕсли;
				
			#КонецЕсли

			
			РезультатОписаниеОшибки = "";
			КодОшибки = 0;
			ЛицензированиеСервер.НачалоРаботыСистемыЛицензирования(Решение.Ключ, РезультатОписаниеОшибки, КодОшибки);
			Если ОписаниеОшибки<>"" Тогда
				Ошибка = Истина;
			КонецЕсли;
			ПараметрыФормы = Новый Структура("ОписаниеОшибки,КодОшибки, ПрограммноеОткрытиеФормы, ИмяОбработки, ИмяРешения",РезультатОписаниеОшибки,КодОшибки,Истина, Решение.Ключ, Решение.Значение);
			РезультатыЗапуска.Добавить(ПараметрыФормы); 
			
		КонецЦикла;
		
		Для Каждого РезультатЗапуска из РезультатыЗапуска Цикл
			Результат = РезультатЗапуска.ОписаниеОшибки;
			КодОшибки = РезультатЗапуска.КодОшибки;
			
			Если ПустаяСтрока(Результат) Тогда
				Результат = СформироватьОписаниеСостоянияСистемыЗащиты(Результат);
			КонецЕсли;
			
			Если ОписаниеОшибки<>"" Тогда
				ОписаниеОшибки = ОписаниеОшибки + Символы.ПС+Символы.ПС;	
			КонецЕсли;	
			
			ОписаниеОшибки = ОписаниеОшибки + РезультатЗапуска.ИмяРешения + Символы.ПС + Результат;
		КонецЦикла;
		
		//ОписаниеОшибки = "";
		//КодОшибки = 0;
		//Если ЛицензированиеСервер.НачалоРаботыСистемыЛицензирования(Объект.ИмяОбработки, ОписаниеОшибки,КодОшибки) Тогда
		//	Если Параметры.ПрограммноеОткрытиеФормы Тогда
		//		Закрыть(Ложь);
		//	КонецЕсли;
		//КонецЕсли;
		ОписаниеОшибки = СформироватьОписаниеСостоянияСистемыЗащиты(ОписаниеОшибки);
	КонецЕсли;
КонецПроцедуры

// Перезапуск защиты
&НаКлиенте
Процедура Перезапустить(Команда)
	
	ОписаниеОшибки = "";
	//Если Параметры.ПрограммноеОткрытиеФормы Тогда
	//	//при запуске системы произошла ошибка старта защиты
	//	
	//	ОбновитьПовторноИспользуемыеЗначения();
	//	
	//	#Если ТолстыйКлиентОбычноеПриложение Тогда
	//		
	//		ОписаниеОшибки = "";
	//		КодОшибки = 0;
	//		
	//		Если НЕ ЛицензированиеКлиент.ВыполнитьПривязкуКлиента(ОписаниеОшибки) Тогда
	//			ОписаниеОшибки = СформироватьОписаниеСостоянияСистемыЗащиты(ОписаниеОшибки);
	//			Возврат;
	//		КонецЕсли;

	//	#КонецЕсли

	//	ОписаниеОшибки = "";
	//	КодОшибки = 0;
	//	Если ЛицензированиеСервер.НачалоРаботыСистемыЛицензирования(Объект.ИмяОбработки, ОписаниеОшибки, КодОшибки) Тогда
	//		Закрыть(Ложь);
	//	Иначе			
	//  		ОписаниеОшибки = СформироватьОписаниеСостоянияСистемыЗащиты(ОписаниеОшибки);
	//	КонецЕсли;
	//Иначе
		// интерактивно вызвана обработка управления лицензированием
		
		//перезапуск защиты
		ОтключитьсяОтСервераЛицензирования();
		ОбновитьПовторноИспользуемыеЗначения();
		
		//#Если ТолстыйКлиентОбычноеПриложение Тогда
		//	
		//	ОписаниеОшибки = "";
		//	КодОшибки = 0;
		//	
		//	Если НЕ ЛицензированиеКлиент.ВыполнитьПривязкуКлиента(ОписаниеОшибки) Тогда
		//		ОписаниеОшибки = СформироватьОписаниеСостоянияСистемыЗащиты(ОписаниеОшибки);
		//		Возврат;
		//	КонецЕсли;
		//	
		//#КонецЕсли

		
		СписокРешений = ЛицензированиеПоддержка.ПолучитьСписокРешений();
		РезультатыЗапуска = новый Массив;
		Ошибка = Ложь;
		
		Для Каждого Решение Из СписокРешений Цикл
			
			#Если ТолстыйКлиентОбычноеПриложение Тогда
				
				ОписаниеОшибки = "";
				КодОшибки = 0;
				
				// Проверка и разбор длинного имени
				ИмяОбработки = Решение.Ключ;
				ИмяМакетаХранилища = "";
				ИмяМакетаПараметровЛицензирования = "";
				КороткоеИмяОбработки = "";
				Если НЕ ЛицензированиеСервер.РазделитьИмяОбработки(ИмяОбработки, ИмяМакетаХранилища, ИмяМакетаПараметровЛицензирования, КороткоеИмяОбработки) Тогда
					ОписаниеОшибки = "Неверный формат имени обработки:"+Символы.ПС+ИмяОбработки;
					КодОшибки = 1;
					Возврат;
				КонецЕсли;	
				КлючПродукта = ИмяМакетаХранилища+"."+ИмяМакетаПараметровЛицензирования;
				
				Если НЕ ЛицензированиеКлиент.ВыполнитьПривязкуКлиента(КлючПродукта, ОписаниеОшибки) Тогда
					ОписаниеОшибки = СформироватьОписаниеСостоянияСистемыЗащиты(ОписаниеОшибки);
					Возврат;
				КонецЕсли;
				
			#КонецЕсли

			РезультатОписаниеОшибки = "";
			КодОшибки = 0;
						
			ЛицензированиеСервер.НачалоРаботыСистемыЛицензирования(Решение.Ключ, РезультатОписаниеОшибки, КодОшибки);
			Если РезультатОписаниеОшибки<>"" Тогда
				Ошибка = Истина;
			КонецЕсли;
			ПараметрыФормы = Новый Структура("ОписаниеОшибки,КодОшибки, ПрограммноеОткрытиеФормы, ИмяОбработки, ИмяРешения",РезультатОписаниеОшибки,КодОшибки,Истина, Решение.Ключ, Решение.Значение);
			РезультатыЗапуска.Добавить(ПараметрыФормы); 
					
		КонецЦикла;

		Для Каждого РезультатЗапуска из РезультатыЗапуска Цикл
			Результат = РезультатЗапуска.ОписаниеОшибки;
			КодОшибки = РезультатЗапуска.КодОшибки;
			
			Если ПустаяСтрока(Результат) Тогда
				Результат = СформироватьОписаниеСостоянияСистемыЗащиты(Результат);
			КонецЕсли;
			
			Если ОписаниеОшибки<>"" Тогда
				ОписаниеОшибки = ОписаниеОшибки + Символы.ПС+Символы.ПС;	
			КонецЕсли;	
			
			ОписаниеОшибки = ОписаниеОшибки + РезультатЗапуска.ИмяРешения + Символы.ПС + Результат;
		КонецЦикла;

		
		//ОписаниеОшибки = "";
		//КодОшибки = 0;
		//ЛицензированиеСервер.НачалоРаботыСистемыЛицензирования(Объект.ИмяОбработки, ОписаниеОшибки, КодОшибки);
		//Если ОписаниеОшибки="" Тогда
		//	Элементы.КомандаАктивироватьПакетЛицензий.Доступность = Истина;
		//КонецЕсли;
		ОписаниеОшибки = СформироватьОписаниеСостоянияСистемыЗащиты(ОписаниеОшибки);
		
		Если НЕ Ошибка Тогда
			Закрыть(Ложь);
		КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

// Завершение работы
&НаКлиенте
Процедура ЗавершитьРаботу(Команда)
	Если Параметры.ПрограммноеОткрытиеФормы ИЛИ ЭтаФорма.МодальныйРежим Тогда
		Закрыть(Истина)
	Иначе
		ЗавершитьРаботуСистемы(Ложь);
	КонецЕсли;
КонецПроцедуры

// Вызов мастера настройки сервера лицензирования
&НаКлиенте
Процедура КомандаНастройкаСервера(Команда)
	
	ФормаНастройки = ПолучитьФорму("Обработка.УправлениеЛицензированием.Форма.ФормаНастройкиСервераЗащиты",,ЭтаФорма);
	
	Результат = ФормаНастройки.ОткрытьМодально();
	
	Если НЕ Результат = Неопределено Тогда
		//были выполнены действия по настройке подключения к серверу
		ОписаниеОшибки = Результат;
		Если ОписаниеОшибки = "" Тогда
			//перезапуск защиты
			ОтключитьсяОтСервераЛицензирования();
			ОбновитьПовторноИспользуемыеЗначения();
			
			//#Если ТолстыйКлиентОбычноеПриложение Тогда
			//	
			//	ОписаниеОшибки = "";
			//	КодОшибки = 0;
			//	
			//	КлиентскаяСсылка = ЛицензированиеСервер.ПолучитьКлючКлиентскойСсылки(ОписаниеОшибки);
			//	Если КлиентскаяСсылка=Неопределено Тогда
			//		ОписаниеОшибки = СформироватьОписаниеСостоянияСистемыЗащиты(ОписаниеОшибки);
			//		Возврат;
			//	КонецЕсли;
			//	
			//	Ссылка = ЛицензированиеКлиент.ИнформацияОКлиенте(КлиентскаяСсылка);
			//	ЛицензированиеСервер.УстановитьКлиентскуюСсылку(Ссылка, ОписаниеОшибки);
			//	
			//#КонецЕсли
			
			СписокРешений = ЛицензированиеПоддержка.ПолучитьСписокРешений();
			РезультатыЗапуска = новый Массив;
			Ошибка = Ложь;
			
			Для Каждого Решение Из СписокРешений Цикл
				
				#Если ТолстыйКлиентОбычноеПриложение Тогда
					
					ОписаниеОшибки = "";
					КодОшибки = 0;
					
					// Проверка и разбор длинного имени
					ИмяОбработки = Решение.Ключ;
					ИмяМакетаХранилища = "";
					ИмяМакетаПараметровЛицензирования = "";
					КороткоеИмяОбработки = "";
					Если НЕ ЛицензированиеСервер.РазделитьИмяОбработки(ИмяОбработки, ИмяМакетаХранилища, ИмяМакетаПараметровЛицензирования, КороткоеИмяОбработки) Тогда
						ОписаниеОшибки = "Неверный формат имени обработки:"+Символы.ПС+ИмяОбработки;
						КодОшибки = 1;
						Возврат;
					КонецЕсли;	
					КлючПродукта = ИмяМакетаХранилища+"."+ИмяМакетаПараметровЛицензирования;
					
					Если НЕ ЛицензированиеКлиент.ВыполнитьПривязкуКлиента(КлючПродукта, ОписаниеОшибки) Тогда
						ОписаниеОшибки = СформироватьОписаниеСостоянияСистемыЗащиты(ОписаниеОшибки);
						Возврат;
					КонецЕсли;
					
				#КонецЕсли

				
				РезультатОписаниеОшибки = "";
				КодОшибки = 0;
				ЛицензированиеСервер.НачалоРаботыСистемыЛицензирования(Решение.Ключ, РезультатОписаниеОшибки, КодОшибки);
				Если РезультатОписаниеОшибки<>"" Тогда
					Ошибка = Истина;
				КонецЕсли;
				ПараметрыФормы = Новый Структура("ОписаниеОшибки,КодОшибки, ПрограммноеОткрытиеФормы, ИмяОбработки, ИмяРешения",РезультатОписаниеОшибки,КодОшибки,Истина, Решение.Ключ, Решение.Значение);
				РезультатыЗапуска.Добавить(ПараметрыФормы); 
				
			КонецЦикла;
			
			Для Каждого РезультатЗапуска из РезультатыЗапуска Цикл
				Результат = РезультатЗапуска.ОписаниеОшибки;
				КодОшибки = РезультатЗапуска.КодОшибки;
				
				Если ПустаяСтрока(Результат) Тогда
					Результат = СформироватьОписаниеСостоянияСистемыЗащиты(Результат);
				КонецЕсли;
				
				Если ОписаниеОшибки<>"" Тогда
					ОписаниеОшибки = ОписаниеОшибки + Символы.ПС+Символы.ПС;	
				КонецЕсли;	
				
				ОписаниеОшибки = ОписаниеОшибки + РезультатЗапуска.ИмяРешения + Символы.ПС + Результат;
			КонецЦикла;

			//ОписаниеОшибки = "";
			//КодОшибки = 0;
			//Если ЛицензированиеСервер.НачалоРаботыСистемыЛицензирования(Объект.ИмяОбработки, ОписаниеОшибки,КодОшибки) Тогда
			//	Если Параметры.ПрограммноеОткрытиеФормы Тогда
			//		Закрыть(Ложь);
			//	КонецЕсли;		
			//КонецЕсли;
			Если НЕ Ошибка И Параметры.ПрограммноеОткрытиеФормы Тогда
				Закрыть(Ложь);
			Иначе
				ОписаниеОшибки = СформироватьОписаниеСостоянияСистемыЗащиты(ОписаниеОшибки);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаАктивироватьПакетЛицензий(Команда)
	Если ВРег(ЛицензированиеСервер.АдресСервераЛицензирования()) = "*AUTO" Тогда
		
		Предупреждение("В режиме автоматического поиска сервера лицензирования невозможна активация лицензий!
		         |Требуется явно указать сервер лицензирования.");
		Возврат;
	КонецЕсли;
	ФормаАктивации = ПолучитьФорму("Обработка.УправлениеЛицензированием.Форма.ФормаАктивацииЛицензий",,ЭтаФорма);
	Результат = ФормаАктивации.ОткрытьМодально();
	ОписаниеОшибки = СформироватьОписаниеСостоянияСистемыЗащиты(Результат);
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьСерверЛицензирования(Команда)
	
	#Если НЕ ВебКлиент Тогда
		Если Вопрос("Сервер лицензирования конфигураций будет установлен на этом компьютере.
			|Пользователь должен иметь права администратора компьютера.
			|Установить?", РежимДиалогаВопрос.ДаНет) =  КодВозвратаДиалога.Да Тогда
			
			ДанныеФайла = ПолучитьДанныеФайла();
			
			ИмяКаталога = КаталогВременныхФайлов();
			ИмяВременногоФайла = ИмяКаталога + "setup.exe";
			Попытка
				ДанныеФайла.Записать(ИмяВременногоФайла);
			Исключение
				Предупреждение("Невозможно записать файл " + ИмяВременногоФайла, 10);
				Возврат;
			КонецПопытки;		
			ИмяПриложения = ИмяВременногоФайла;
			ЗапуститьПриложение(ИмяПриложения);
			//КомандаСистемы(ИмяПриложения + " /local")
		КонецЕсли;
	#Иначе
		  Предупреждение("В веб-клиенте недоступна установка сервера защиты");
		  Возврат;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИнформация(Команда)
	ФормаИнформации = ПолучитьФорму("Обработка.УправлениеЛицензированием.Форма.ИнформацияОПараметрахЛицензирования",,ЭтаФорма);
	Если НЕ ФормаИнформации = Неопределено Тогда
	ФормаИнформации.ОткрытьМодально();
    КонецЕсли;
КонецПроцедуры

/////////////////////////////////////////////////
//ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьОписаниеСостоянияСистемыЗащиты(ОписаниеОшибки)
	Если ПустаяСтрока(ОписаниеОшибки) Тогда
		ОписаниеОшибки = "Лицензия получена от сервера: """ + ЛицензированиеСервер.ПараметрСеансаАдресСервераЛицензирования() + """";
	КонецЕсли;
		
	Возврат "[" + ТекущаяДата() + "]: " + ОписаниеОшибки;
КонецФункции

&НаСервере
Процедура ОтключитьсяОтСервераЛицензирования()
	ОписаниеОшибки = "";
	
	СписокРешений = ЛицензированиеПоддержка.ПолучитьСписокРешений();
	Для Каждого Решение Из СписокРешений Цикл
		ЛицензированиеСервер.ОсвободитьЛицензию(Решение.Ключ, ОписаниеОшибки);
	КонецЦикла;

	
//	ЛицензированиеСервер.ОсвободитьЛицензию(Объект.ИмяОбработки, ОписаниеОшибки);
//	ПараметрыСеанса.ИдентификаторСертификата = "";
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеФайла()
	ДвоичныеДанные = ПолучитьОбщийМакет("ДистрибутивСервераЛицензирования");
	Возврат ДвоичныеДанные;
КонецФункции

&НаКлиенте
Процедура Таймаут()
	//Служебная функция. Зарезервировано.
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СисИнфо = Новый СистемнаяИнформация;
	ЭтоWindows = СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86 ИЛИ СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86_64;
	
	Если НЕ ЭтоWindows Тогда
		Элементы.КомандаУстановитьСерверЛицензирования.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры
