
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ сфпСофтФонПроСервер.сфпИспользоватьЗаписьПереговоров() Тогда
		Отказ = Истина;
	ИначеЕсли Параметры.Свойство("МассивЗаписей") Тогда
		СписокЗаписей = Новый СписокЗначений;
		Для Каждого ЭлементМассива Из Параметры.МассивЗаписей Цикл
			СписокЗаписей.Добавить(ЭлементМассива.ИдентификаторЗаписи);
		КонецЦикла;	
		ЭлементыОтбора = Список.Отбор.Элементы;
		Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
			Если ЭлементОтбора.Представление = "ОтборПоСпискуЗаписей" Тогда
				ЭлементОтбора.ПравоеЗначение = СписокЗаписей;
				ЭлементОтбора.Использование = Истина;
				Прервать;
			КонецЕсли;	
		КонецЦикла;
	Иначе
		ТекПользователь		= сфпСофтФонПроСервер.сфпТекущийПользователь();
		МассивПользователей	= сфпСофтФонПроСервер.сфпПолучитьМассивПрослушиваемыхПользователей(ТекПользователь);
		СписокПользователей	= Новый СписокЗначений;
		Для Каждого ПользовательМассива Из МассивПользователей Цикл
			СписокПользователей.Добавить(ПользовательМассива);
		КонецЦикла;	
		ЭлементыОтбора = Список.Отбор.Элементы;
		Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
			Если ЭлементОтбора.Представление = "ОтборПоСпискуПользователей" Тогда
				ЭлементОтбора.ПравоеЗначение = СписокПользователей;
				ЭлементОтбора.Использование = Истина;
				Прервать;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТД = Элемент.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	ИначеЕсли ТД.ИдентификаторЗаписи = "-1" Тогда
		Предупреждение("Отсутствует запись разговора для данного телефонного звонка!");
		Возврат;
	КонецЕсли;	
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("ИдентификаторЗвонка",		ТД.ИдентификаторЗвонка);
	СтруктураЗаписи.Вставить("ИдентификаторЗаписи",		ТД.ИдентификаторЗаписи);
	СтруктураЗаписи.Вставить("НачалоЗаписи",			ТД.НачалоЗаписи);
	СтруктураЗаписи.Вставить("НомерВнТелефона",			ТД.НомерВнТелефона);
	СтруктураЗаписи.Вставить("ИмяЛинии",				ТД.ИмяЛинии);
	Если НЕ (сфпФормаТелефонВнешняяПанель = Неопределено) Тогда
		сфпФормаТелефонВнешняяПанель.ПолучитьФайлРазговора(СтруктураЗаписи);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры
