&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	Если Параметры.Свойство("Родитель") Тогда Объект.Родитель=Параметры.Родитель КонецЕсли;	//установка родителя для нового объекта
	Если Объект.Правило<>Null Тогда Правило=Справочники.Renault_Правила.ПолучитьСсылку(Объект.Правило) КонецЕсли;
	ОтборРеквизитов()
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи) Объект.Правило=?(Правило.Пустая(),NULL,Правило.УникальныйИдентификатор()) КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи) 
	ВнешниеИсточникиДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблицы.ОбъектыМД.СоздатьРеквизитыОбъектаМетаданных(Объект.Ссылка);
	ОбновитьОбъект();
	ОтборРеквизитов();
	Элементы.Реквизиты.Обновить();
КонецПроцедуры
Процедура ОбновитьОбъект() ЗначениеВРеквизитФормы(РеквизитФормыВЗначение("Объект"),"Объект") КонецПроцедуры	
Процедура ОтборРеквизитов()
	Реквизиты.Отбор.Элементы.Очистить();
	Отбор=Реквизиты.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование=Истина;                        
	Отбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ОбъектМД");
	Отбор.ПравоеЗначение=Объект.Ссылка;
КонецПроцедуры

//отбор родителя по текущей базе
&НаКлиенте
Процедура РодительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	//ДанныеВыбора=ВнешниеИсточникиДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблицы.ОбъектыМД.ПолучитьДанныеВыбора(Новый Структура("БазаДанных",Renault_ПередачаДанныхВСторонниеСистемы.ТекущаяБазаДанных()));
	////удалить этот элемент из списка выбора, т.к. он не может быть родителем себе
	//Если Не Объект.Ссылка.Пустая() Тогда 
	//	ДанныеВыбора.Удалить(ДанныеВыбора.Индекс(ДанныеВыбора.НайтиПоЗначению(Объект.Ссылка)));
	//КонецЕсли;
	
	Структура=Новый Структура;
	Структура.Вставить("БазаДанных",Renault_ПередачаДанныхВСторонниеСистемы.ТекущаяБазаДанных());
	Структура.Вставить("РежимВыбора",Истина);
	ОткрытьФорму("ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.ОбъектыМД.ФормаВыбора",Структура,ЭтаФорма,,,,Новый ОписаниеОповещения("Выбор_ВнешниеМетаданные",ЭтаФорма));
КонецПроцедуры
Процедура Выбор_ВнешниеМетаданные(Значение,Параметр) Если Объект.Ссылка=Значение Тогда Сообщить("Элемент не может быть родителем себе",СтатусСообщения.Информация) Иначе Объект.Родитель=Значение КонецЕсли; КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекБаза=Renault_ПередачаДанныхВСторонниеСистемы.ТекущаяБазаДанных();
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Если Объект.БазаДанных<>ТекБаза Тогда
			Сообщить("Метаданные другой базы не доступны для редактирования",СтатусСообщения.Информация);
			ТолькоПросмотр=Истина;
			Элементы.Команды.Доступность=Ложь;
			Элементы.Реквизиты.ТолькоПросмотр=Истина;
			Элементы.кнЗаполнитьРеквизиты.Доступность=Ложь;
			Элементы.КнВкл.Доступность=Ложь;
			Элементы.КнВыкл.Доступность=Ложь;
			//Элементы.РеквизитыКнВклГр.Доступность=Ложь;
			//Элементы.РеквизитыКнВыклГр.Доступность=Ложь;
		КонецЕсли;
	Иначе
		Объект.БазаДанных=ТекБаза;
	КонецЕсли;	
	
	//способ заполнения
	СпособЗаполнения=?(ПустаяСтрока(Объект.ТекстЗапроса),"ПоМД","ПоЗапросу");
	РежимыЗаполненияРеквизитов("");
	
КонецПроцедуры

&НаКлиенте
Процедура РежимыЗаполненияРеквизитов(Элемент) //переключение способов заполнения
	ПоЗапросу=?(СпособЗаполнения="ПоМД",Ложь,Истина);
	Элементы.СтрТекстЗапроса.Видимость=ПоЗапросу;
	Элементы.кнЗаписатьПредопределенныеРеквизиты.Видимость=Не ПоЗапросу;
	Элементы.кнЗаписатьРеквизитыМД.Видимость=Не ПоЗапросу;
	Элементы.кнЗаписатьРеквизитыМДИПредопределенные.Видимость=Не ПоЗапросу;
	Элементы.кнЗаписатьРеквизитыПоЗапросу.Видимость=ПоЗапросу;
КонецПроцедуры

//подбор объекта метаданных
&НаКлиенте
Процедура МетаданныеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ОткрытьФорму("Справочник.Renault_КонвертацияДанных.Форма.ПодборМД",Новый Структура("ИмяМД,ИмяРеквизитаДляПередачи",Объект.Имя,"Имя"),ЭтаФорма);
КонецПроцедуры

//формирование записей таблицы РеквизитыОбъектов1С
&НаКлиенте
Процедура кнЗаполнитьРеквизиты(Команда)
	ТекстОшибки="";
	Если Объект.Ссылка.ТекстЗапроса<>Объект.ТекстЗапроса Тогда ТекстОшибки="Объект не записан"; Возврат КонецЕсли;
	Если НЕ ВнешниеИсточникиДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблицы.ОбъектыМД.ЗаполнитьРеквизитыОбъекта(Объект.Ссылка,ТекстОшибки,Команда.Имя) Тогда Сообщить(ТекстОшибки,СтатусСообщения.Внимание) КонецЕсли; 
	кнВыполнитьПроверкуРеквизитов(Команда);
	Элементы.Реквизиты.Обновить();
КонецПроцедуры

//интерфейс
&НаКлиенте
Процедура кнВкл(Команда)
	Сп=Новый СписокЗначений; Сп.ЗагрузитьЗначения(Элементы.Реквизиты.ВыделенныеСтроки);
	
	Если Команда.Имя="кнВклГр" Тогда УстановитьАктивность(Истина,"")
	ИначеЕсли Команда.Имя="кнВыклГр" Тогда УстановитьАктивность(Ложь,"")
	ИначеЕсли Команда.Имя="кнВкл" Тогда УстановитьАктивность(Истина,Сп)
	ИначеЕсли Команда.Имя="кнВыкл" Тогда УстановитьАктивность(Ложь,Сп)
	КонецЕсли;	
	Элементы.Реквизиты.Обновить()
КонецПроцедуры
Процедура УстановитьАктивность(Флаг,СпРеквизитов)
	Если СпРеквизитов="" Тогда
		Запрос=Новый Запрос("Выбрать Ссылка Из ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.РеквизитыМД Где ОбъектМД=&ОбъектМД");
		Запрос.УстановитьПараметр("ОбъектМД",Объект.Ссылка);
	Иначе
		Запрос=Новый Запрос("Выбрать Ссылка Из ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.РеквизитыМД Где Ссылка В(&СпРеквизитыМД)");
		Запрос.УстановитьПараметр("СпРеквизитыМД",СпРеквизитов.ВыгрузитьЗначения());
	КонецЕсли;	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись=Выборка.Ссылка.ПолучитьОбъект();
		Запись.Активно=Флаг;
		Запись.Записать();
	КонецЦикла;	
КонецПроцедуры	

&НаКлиенте
Процедура кнОбновить(Команда) Объект.ТекстЗапроса=ТекстЗапроса(); Элементы.Реквизиты.Обновить(); КонецПроцедуры
Функция ТекстЗапроса() Возврат Объект.Ссылка.ТекстЗапроса КонецФункции

&НаКлиенте
Процедура кнВыполнитьПроверкуРеквизитов(Команда) ВнешниеИсточникиДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблицы.ОбъектыМД.ВыполнитьПроверку(Объект.Ссылка) КонецПроцедуры

&НаКлиенте
Процедура РодительОчистка(Элемент, СтандартнаяОбработка) СтандартнаяОбработка=Ложь; Объект.Родитель=ПустаяСсылка() КонецПроцедуры
Функция ПустаяСсылка() Возврат ВнешниеИсточникиДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблицы.ОбъектыМД.ПустаяСсылка() КонецФункции

&НаКлиенте
Процедура кнСправка(Команда) Renault_ПередачаДанныхВСторонниеСистемы.ПоказатьСправку(ЭтаФорма,Справочники.Renault_КонвертацияДанных.ПолучитьМакет("СправкаОбъектыМД").ПолучитьТекст(),"Справка по составлению текста запроса") КонецПроцедуры

//построить запрос автоматически
&НаКлиенте
Процедура кнАвтоТекстЗапроса(Команда) 
	Если Команда.Имя="кнАвтоТекстЗапросаВсе" Тогда Режим=0 //Вообще все, в т.ч. общие реквизиты
	ИначеЕсли Команда.Имя="кнАвтоТекстЗапросаПредопределенные" Тогда Режим=1 //предопределенные реквизиты
	ИначеЕсли Команда.Имя="кнАвтоТекстЗапросаМД" Тогда Режим=2 //реквизиты метаданных
	ИначеЕсли Команда.Имя="кнАвтоТекстЗапросаПредопределенныеИМД" Тогда Режим=3 //предопределенные реквизиты и реквизиты метаданных
	КонецЕсли;	
	АвтоТекстЗапроса(Режим)
КонецПроцедуры
Процедура АвтоТекстЗапроса(Режим)
	МД=Renault_ПередачаДанныхВСторонниеСистемы.МетаданныеИзСтроки(Объект.Имя);
	Если МД=Неопределено Тогда Сообщить("Текст запроса не может быть заполнен автоматически т.к. метаданные с таким именем отсутствуют",СтатусСообщения.Информация); Возврат КонецЕсли;
	
	СпРеквизитов=Новый Массив;
	Если Режим=0 Тогда СпРеквизитов.Добавить("*")
	ИначеЕсли Режим=1 Тогда //предопределенные реквизиты
		СпРеквизитов=Renault_ПередачаДанныхВСторонниеСистемы.СписокПредопределенныхРеквизитов(Объект.Имя).ВыгрузитьЗначения();
	ИначеЕсли Режим=2 Тогда //реквизиты метаданных
		Для Каждого Реквизит Из МД.Реквизиты Цикл СпРеквизитов.Добавить(Реквизит.Имя) КонецЦикла
	ИначеЕсли Режим=3 Тогда //предопределенные реквизиты и реквизиты метаданных
		СпРеквизитов=Renault_ПередачаДанныхВСторонниеСистемы.СписокПредопределенныхРеквизитов(Объект.Имя).ВыгрузитьЗначения();
		Для Каждого Реквизит Из МД.Реквизиты Цикл СпРеквизитов.Добавить(Реквизит.Имя) КонецЦикла
	КонецЕсли;	
	
	Объект.ТекстЗапроса="Выбрать"+Символы.ПС+Символы.Таб+Renault_ПередачаДанныхВСторонниеСистемы.МассивВСтроку(СпРеквизитов,","+Символы.ПС+Символы.Таб)+Символы.ПС+"Из "+Объект.Имя;
КонецПроцедуры

&НаКлиенте
Процедура кнОчиститьЗапрос(Команда) Объект.ТекстЗапроса="" КонецПроцедуры

//конструктор запроса
&НаКлиенте
Процедура кнКонструкторЗапроса(Команда)
	КонструкторЗапроса=Новый КонструкторЗапроса;
	КонструкторЗапроса.АвтодобавлениеПредставлений=Ложь;
	Попытка
		ТекстЗапроса=Объект.ТекстЗапроса; //Элементы.ТекстЗапроса.Заголовок;
		Если ТекстЗапроса<>"" Тогда КонструкторЗапроса.Текст=ТекстЗапроса КонецЕсли;
		Если КонструкторЗапроса.ОткрытьМодально() Тогда Объект.ТекстЗапроса=КонструкторЗапроса.Текст КонецЕсли;
	Исключение
        Предупреждение(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура кнКомментарий(Команда) Справочники.Renault_Правила.УстановитьКомментарий(ЭтаФорма,Элементы.ТекстЗапроса,Объект.ТекстЗапроса) КонецПроцедуры
&НаКлиенте
Процедура кнУдалитьКомментарий(Команда) Справочники.Renault_Правила.УдалитьКомментарий(ЭтаФорма,Элементы.ТекстЗапроса,Объект.ТекстЗапроса) КонецПроцедуры
