Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
	//Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	////$+ Комментарий ДатаCоздания - 11.06.2013 11:25:33, Автор - Администратор Nissan
	//<xml version="1.0" encoding="UTF-8">
	//<Автодок>
	//<Комментарий ДатаCоздания="11.06.2013 11:25:33" Автор="Администратор Nissan">
	//
	// Идентификатор нужен для передачи данных в дилерские базы через WS
	//
	//</Комментарий>
	//</Автодок>
	//</xml>
	//$-
	Если НЕ ЗначениеЗаполнено(Идентификатор) тогда
		Идентификатор = Строка(Новый УникальныйИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры
