// Модуль справочника Номенклатура

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;	// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем ОсновнаяЕдиницаИзмеренияОбязательная Экспорт; // Основная единица измерения
Перем НовыйЭлемент;

Перем РегистрНомер;
Перем ФлагУспешно;

// Рекурсивно перебирает состав всех наборов, входящих в табличную часть переданного элемента
//
// Параметры:
//   Набор - СправочникСсылка.Номенклатура, набор/комплект, в составе которого делает поиск.
//
// Возвращаемое значение:
//   Булево - Истина - Текущий объект входит в состав набора или его составляющих  
//   	      Ложь   - Текущий объект не входит в состав набора или его составляющих  
//
Функция	ПроверитьКольцевыеСсылки(Набор) Экспорт
	Для Каждого Строка Из Набор.СоставНабора Цикл
		Если Строка.Номенклатура = ЭтотОбъект.Ссылка Тогда
			Возврат Истина;
		ИначеЕсли Строка.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Набор ИЛИ Строка.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Комплект Тогда
			Если ПроверитьКольцевыеСсылки(Строка.Номенклатура) Тогда
				Возврат Истина;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	Возврат Ложь;
КонецФункции // ПроверитьКольцевыеСсылки()	

// Возвращает структуру обязательных / уникальных реквизитов элемента
// Если ДляЭлемента = Истина, возвращаемая структура содержит реквизиты для проверки элемента
// Если ДляГруппы = Истина, аналогично для группы
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 3-Уникальный
//
// Параметры:
//  ДляЭлемента	– Булево			– Возвращаемая структура должна содержать реквизиты для проверки элемента.
//  ДляГруппы	– Булево 			– Возвращаемая структура должна содержать реквизиты для проверки группы элементов.
//
// Возвращаемое значение:
//   ОбязательныеРеквизиты   		– Структура, содержащая реквизиты для проверки элемента или группы элементов.
//
Функция ПолучитьОбязательныеРеквизиты(ДляЭлемента=Истина, ДляГруппы=Ложь) Экспорт
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Код",1);
	ОбязательныеРеквизиты.Вставить("Наименование",1);

	Если ДляЭлемента Тогда
		
		//Гэндальф+++
		//Бондаренко++ 20230111
		Если ВидНоменклатуры<>Перечисления.ВидыНоменклатуры.Услуга Тогда
		//Бондаренко-- 20230111	
			ОбязательныеРеквизиты.Вставить("Производитель",1);
		//Бондаренко++ 20230111	
		КонецЕсли;             
	    //Бондаренко-- 20230111
		
 		Если НЕ РольДоступна("СМ_NIRAX") Тогда
			ОбязательныеРеквизиты.Вставить("Родитель",1);
 		КонецЕсли;
 		//Гэндальф---
		
		ОбязательныеРеквизиты.Вставить("ТипНоменклатуры",1);
		ОбязательныеРеквизиты.Вставить("ВидНоменклатуры",1);
		ОбязательныеРеквизиты.Вставить("СтавкаНДС",1);
		ОбязательныеРеквизиты.Вставить("БазоваяЕдиницаИзмерения",1);
		//Если ЭтоНовый()=Ложь Тогда
		Если ОсновнаяЕдиницаИзмеренияОбязательная Тогда
			ОбязательныеРеквизиты.Вставить("ОсновнаяЕдиницаИзмерения",1);
		КонецЕсли;
		Если ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга Тогда
			ОбязательныеРеквизиты.Вставить("СпособРаспределенияДопРасходов",1);
		КонецЕсли;
		Если СпособРаспределенияДопРасходов = Перечисления.СпособыРаспределенияДопРасходов.НаДоходыИРасходы Тогда
			ОбязательныеРеквизиты.Вставить("СтатьяДопРасходов",1);
		КонецЕсли;
		//Гэндальф+++
		//Если обПраво("НомерПоКаталогуУникальный",Права) Тогда
		//	ОбязательныеРеквизиты.Вставить("Артикул",3);
		//КонецЕсли; 
		Если обПраво("НомерПоКаталогуУникальный",Права) и ВидНоменклатуры<>Перечисления.ВидыНоменклатуры.Услуга Тогда
			//Бондаренко++ 20260811
			ОбязательныеРеквизиты.Вставить("Артикул",3);
 			//Бондаренко++ 20220902
			//Если НЕ РольДоступна("СМ_NIRAX") Тогда
				//Бондаренко-- 20220902	
				//ОбязательныеРеквизиты.Вставить("Артикул",3);
 				//Если Производитель = Справочники.Производители.LADA_ ИЛИ Производитель = Справочники.Производители.NISSAN_       
				//	//Бондаренко++ 20221122
				//	ИЛИ Производитель = Справочники.Производители.CHERY_ ИЛИ Производитель = Справочники.Производители.TOTACHI_  
				//	//Бондаренко++ 20221122
				//	ИЛИ Производитель = Справочники.Производители.RENAULT_ ИЛИ Производитель = Справочники.Производители.DATSUN_ Тогда
				//	ОбязательныеРеквизиты.Вставить("Артикул",1);	 
				//	ОбязательныеРеквизиты.Вставить("ПроизводительПлюсАртикул",3);	 
				//КонецЕсли;
 				//Бондаренко++ 20220902	
			//КонецЕсли;
			//Бондаренко-- 20220902
			//Бондаренко-- 20260811
		КонецЕсли;
		//Гэндальф---
  		ОбязательныеРеквизиты.Вставить("ВалютаУчета",1);
		Если СоставНабора.Количество() > 0 Тогда
			Если ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Комплект ИЛИ ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Набор Тогда
				ОбязательныеСоставНабора = Новый Структура();
				ОбязательныеСоставНабора.Вставить("Номенклатура",3);
				ОбязательныеСоставНабора.Вставить("Количество",1);
				ОбязательныеРеквизиты.Вставить("СоставНабора",ОбязательныеСоставНабора);
			КонецЕсли;
		КонецЕсли;
		
		// Проверка на уникальность строк в табличной части "Состав набора".
		Если (ВидНоменклатуры=Перечисления.ВидыНоменклатуры.Комплект) ИЛИ (ВидНоменклатуры=Перечисления.ВидыНоменклатуры.Набор) Тогда 
			ОбязательныеТовары = Новый Структура();
			ОбязательныеТовары.Вставить("Номенклатура", 3);
			ОбязательныеТовары.Вставить("ХарактеристикаНоменклатуры", 2);
			ОбязательныеРеквизиты.Вставить("СоставНабора", ОбязательныеТовары);
		КонецЕсли;
		
		ОбязательныеЯчейки = Новый Структура;
		ОбязательныеЯчейки.Вставить("СкладКомпании",3);
		ОбязательныеЯчейки.Вставить("ЯчейкаХранения",1);
		ОбязательныеРеквизиты.Вставить("ЯчейкиХранения",ОбязательныеЯчейки);
	КонецЕсли;
		
	Если ДляГруппы Тогда
	КонецЕсли;

	Возврат ОбязательныеРеквизиты;
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Проверяет корректность заполнения объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры:
//  Ошибки 			– Строка		– Описание ошибок.
//  ДопРеквизиты	– Структура		– Дополнительные реквизиты для проверки.
//  Заполнение		– Булево		– Флаг для проверки заполнения.
//  Уникальность	– Булево		– Флаг для проверки уникальности.
//
// Возвращаемое значение:
//   Булево				   			– Правильность заполнения объекта.
//
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	
	Результат = спПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);  
	//++ Галактионов 26 12 2023
	Если РольДоступна("ПолныеПрава")Тогда
		Возврат Ложь;
	КонецЕсли; 
	//-- Галактионов 26 12 2023
	Если НЕ ЭтоГруппа Тогда
		Если НЕ ЭтоНовый() Тогда
			//попытаемся найти движения регистров накопления, в которых участвовала эта номенклатура
			ФлагУчастияВДвижениях = Ложь;
			Для Н = 0 По Метаданные.РегистрыНакопления.Количество()-1 Цикл
				Регистр = Метаданные.РегистрыНакопления.Получить(Н);
				Измерения = Регистр.Измерения;
				Для Каждого Измерение Из Измерения Цикл
					Если Измерение.Тип.СодержитТип(ТипЗнч(ЭтотОбъект.Ссылка)) Тогда
						Если спУчастиеВДвижениях(Регистр.Имя, Измерение.Имя, ЭтотОбъект.Ссылка)Тогда
							ФлагУчастияВДвижениях = Истина;
							Прервать;
						КонецЕсли;	
					КонецЕсли;	
				КонецЦикла;
				Если ФлагУчастияВДвижениях Тогда
					Прервать;
				КонецЕсли;	
			КонецЦикла;
			
			Если ФлагУчастияВДвижениях Тогда
				//Проверяем возможное изменение типа номенклатуры
				СтарыйТипНоменклатуры = ЭтотОбъект.Ссылка.ТипНоменклатуры;
				Если СтарыйТипНоменклатуры <> ТипНоменклатуры Тогда				
					//Бондаренко++ 20190507
					Если Не обЗначениеНеЗаполнено(СтарыйТипНоменклатуры) Тогда
					//Бондаренко-- 20190507
						Если ТипНоменклатуры.ИспользованиеЕдиницИзмерения = 1 ИЛИ
							СтарыйТипНоменклатуры.ИспользованиеЕдиницИзмерения = 1 Тогда
							Результат = Ложь;
						КонецЕсли;
						Если ТипНоменклатуры.ИспользованиеХарактеристик = 1 ИЛИ
							СтарыйТипНоменклатуры.ИспользованиеХарактеристик = 1 Тогда
							Результат = Ложь;
						КонецЕсли;
						Если ТипНоменклатуры.ИспользованиеХарактеристик <> СтарыйТипНоменклатуры.ИспользованиеХарактеристик Тогда
							Результат = Ложь;
						КонецЕсли;
						Если НЕ Результат Тогда
							дкДобавитьОшибку(Ошибки, "По данной номенклатуре есть движения регистров! Нельзя изменять тип номенклатуры!");
						КонецЕсли;
					//Бондаренко++ 20190507	
					КонецЕсли; 
				    //Бондаренко-- 20190507
				КонецЕсли;			
			КонецЕсли;   		
			
			//проверка прочих активов. Если введен в эксплуатацию, то нельзя изменять вид номенклатуры
			Если ВидНоменклатуры<>Ссылка.ВидНоменклатуры Тогда
				ВидНоменклатурыПрочийАктив = Перечисления.ВидыНоменклатуры.ПрочиеАктивы;
				Если Ссылка.ВидНоменклатуры=ВидНоменклатурыПрочийАктив И ВидНоменклатуры<>ВидНоменклатурыПрочийАктив Тогда
					//проверяем, были ли движения по прочим активам
					Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
					|	ПрочиеАктивыВЭксплуатацииОбороты.ПрочийАктив КАК Актив
					|ИЗ
					|	РегистрНакопления.ПрочиеАктивыВЭксплуатации.Обороты КАК ПрочиеАктивыВЭксплуатацииОбороты
					|ГДЕ
					|	ПрочиеАктивыВЭксплуатацииОбороты.ПрочийАктив.Номенклатура = &Номенклатура");
					Запрос.УстановитьПараметр("Номенклатура", Ссылка);
					Рез = Запрос.Выполнить();
					Если НЕ Рез.Пустой() Тогда
						дкДобавитьОшибку(Ошибки, "По прочему активу <" + Рез.Выгрузить()[0].Актив + ">, соответствующему данной номенклатуре, есть движения регистра <Прочие активы в эксплуатации>! Нельзя изменять вид номенклатуры!");
						Результат = Ложь;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		
		Если (ВидНоменклатуры=Перечисления.ВидыНоменклатуры.Комплект) ИЛИ (ВидНоменклатуры=Перечисления.ВидыНоменклатуры.Набор) Тогда 
			Для Каждого ТекСтрока Из СоставНабора Цикл  	
				Если ТекСтрока.Номенклатура.ТипНоменклатуры.ИспользованиеХарактеристик<=2 Тогда
					Если ТекСтрока.ХарактеристикаНоменклатуры.Пустая() И 
						(обЗначениеНеЗаполнено(ТекСтрока.Номенклатура.ТипНоменклатуры.АвтоСписаниеХарактеристик) ИЛИ
						ТекСтрока.Номенклатура.ТипНоменклатуры.АвтоСписаниеХарактеристик = Перечисления.РежимыАвтоСписанияХарактеристик.РучноеСписание) Тогда
						дкДобавитьОшибку(Ошибки, "Таблица <Состав набора> значение колонки <Характеристика номенклатуры> не заполнено! Строка: " + ТекСтрока.НомерСтроки);	
						Результат = Ложь;
					ИначеЕсли (НЕ обЗначениеНеЗаполнено(ТекСтрока.Номенклатура.ТипНоменклатуры.АвтоСписаниеХарактеристик)) И
						(НЕ ТекСтрока.Номенклатура.ТипНоменклатуры.АвтоСписаниеХарактеристик = Перечисления.РежимыАвтоСписанияХарактеристик.РучноеСписание) Тогда
						 Результат = Истина;   
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
			
	Возврат Результат;
КонецФункции // ПроверитьКорректность()
 
// Функция проверяет, допустимо ли изменение объекта
// Возвращает Истина, если изменения возможны, ложь иначе
// Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
//
// Параметры:
//  БлокироватьРеквизиты	– Строка	– Блокируемые на изменение реквизиты объекта.
//
// Возвращаемое значение:
//   Булево		   					– Допустимость изменения объекта.
//
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок
	Возврат Истина;
КонецФункции // ДоступностьИзменения()

// Обработка изменения реквизитов справочников
//
// Параметры:
//  Имя			– Строка			– Имя реквизита справочника с полным путем.
//  ЭтаФорма	– Форма				– Ссылка на форму справочника. Если значение неопределено,
//									  производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части справочника, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей справочников.
//  ДопПараметры	– Структура		– Структура, содержащая дополнительные параметры обработки реквизита.
//
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
//
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	// ОБРАБОТКА РЕКВИЗИТОВ СПРАВОЧНИКОВ
	Если Имя="СоставНабора.Номенклатура" Тогда
		Если ТекСтрока.Номенклатура.Пустая() Тогда
			ТекСтрока.ХарактеристикаНоменклатуры = Неопределено;
			Возврат Истина;
		Иначе
			Если ТекСтрока.Количество=0 Тогда
				ТекСтрока.Количество  = 1;	
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ТекСтрока.ХарактеристикаНоменклатуры.Пустая() Тогда
			Если (ТекСтрока.ХарактеристикаНоменклатуры.Владелец<>ТекСтрока.Номенклатура) И (ТекСтрока.ХарактеристикаНоменклатуры.Владелец<>ТекСтрока.Номенклатура.ТипНоменклатуры) Тогда
				ТекСтрока.ХарактеристикаНоменклатуры = Неопределено;
				ЭтотОбъект.ОбработкаРеквизита("СоставНабора.ХарактеристикаНоменклатуры", ТекСтрока, ЭтаФорма);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Имя="СоставНабора.ХарактеристикаНоменклатуры" Тогда
		
	ИначеЕсли Имя="Артикул"
		ИЛИ Имя="Производитель" Тогда
		АртикулДляПоиска = Справочники.Номенклатура.ПреобразоватьВАртикулДляПоиска(Артикул,Производитель);   
		
	ИначеЕсли Имя="СтавкаНДС" Тогда
		
		// Выведем предупреждение
		#Если Клиент Тогда
			Если НЕ ПроверитьКорректностьСтавкиНДС() Тогда
				Сообщить("Выбрана недействительная ставка НДС!", СтатусСообщения.Внимание);
			КонецЕсли;
		#КонецЕсли	
		
		
	Иначе
		Возврат спОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()

// Функция получения ячейки хранения
//
// Параметры:
//	Склад - склад для которого определяется ячейка
//
// Возвращает ссылку на ячейку если такая нашлась или пусиую ссылку
//
Функция ПолучитьЯчейкуХранения(Склад=Неопределено) Экспорт
	
	ЯчРез=Справочники.ЯчейкиХранения.ПустаяСсылка();
	
	Если ЭтоНовый() ИЛИ ЭтоГруппа ИЛИ Склад=Неопределено Тогда
		Возврат ЯчРез;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("СкладКомпании",Склад);
	МассивСтрок = ЯчейкиХранения.НайтиСтроки(СтруктураПоиска);
	Если МассивСтрок.Количество() > 0 Тогда
		ЯчРез = МассивСтрок[0].ЯчейкаХранения;
		Возврат ЯчРез;
	КонецЕсли;
	
	//Бондаренко++ 20200325
	Если МассивСтрок.Количество() = 0 Тогда
 		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СхемыИерархическихСкладовСклады.СкладКомпании,
		|	СхемыИерархическихСкладовСклады.Ссылка.ДилерскийЦентр
		|ИЗ
		|	Справочник.СхемыИерархическихСкладов.Склады КАК СхемыИерархическихСкладовСклады
		|ГДЕ
		|	СхемыИерархическихСкладовСклады.Ссылка.ДилерскийЦентр = &ДилерскийЦентр"; 
		// Холышевская ++ 04.04.2026 #10598
		// БЫЛО
		//Запрос.УстановитьПараметр("ДилерскийЦентр", Склад.Подразделение.ДилерскийЦентр);
		// СТАЛО 
		ДЦ = Склад.Подразделение.ДилерскийЦентр;
		Если ДЦ = Справочники.ДилерскиеЦентры.Шолохова237 Тогда
			ДЦ = Справочники.ДилерскиеЦентры.НайтиПоКоду("000000019");
		КонецЕсли;
 		Запрос.УстановитьПараметр("ДилерскийЦентр", ДЦ); 
		// Холышевская -- 04.04.2026
 		РезультатЗапроса = Запрос.Выполнить();
 		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
 		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтруктураПоиска = Новый Структура("СкладКомпании",ВыборкаДетальныеЗаписи.СкладКомпании);
			МассивСтрок = ЯчейкиХранения.НайтиСтроки(СтруктураПоиска);
			Если МассивСтрок.Количество() > 0 Тогда
				ЯчРез = МассивСтрок[0].ЯчейкаХранения;
				Возврат ЯчРез;
			КонецЕсли;
 		КонецЦикла;
 	КонецЕсли;
	//Бондаренко-- 20200325
	
	Возврат ЯчРез;
	
КонецФункции

// функция ищет в справочнике "Единицы измерения" единицу для объекта которая соответствует его
// базовой единице измерения
//
// Параметры:
//	Номенклатура - СправочникСсылка - Ссылка на элемент номенклатуры
//
// Возвращаемое значение:
//	СправочникСсылка - Единица измерения
//
Функция ПолучитьЕдиницуИзмеренияПоБазовой() Экспорт
	
	// посмотрим как у нас хранятся единицы измерения
	Если ЭтотОбъект.ТипНоменклатуры.ИспользованиеЕдиницИзмерения=1 Тогда // подчинены типу номенклатуры
		ВладелецЕдиниц = ЭтотОбъект.ТипНоменклатуры;
		БазоваяЕдиница = ЭтотОбъект.ТипНоменклатуры.ОсновнаяБазоваяЕдиницаИзмерения;
	Иначе // подчинены номенклатуре
		ВладелецЕдиниц = ЭтотОбъект.Ссылка;
		БазоваяЕдиница = ЭтотОбъект.БазоваяЕдиницаИзмерения;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВладелецЕдиниц) Тогда
		Возврат Справочники.ЕдиницыИзмерения.ПустаяСсылка();
	КонецЕсли;
	
	// ищем единицу
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕдиницыИзмерения.Ссылка,
	|	ЕдиницыИзмерения.Коэффициент КАК Коэффициент,
	|	ВЫБОР
	|		КОГДА ЕдиницыИзмерения.Наименование = &ЕдиницаПоКлассификатору ТОГДА
	|			0
	|		ИНАЧЕ
	|			1
	|	КОНЕЦ КАК ПолеСортировки
	|ИЗ
	|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|ГДЕ
	|	ЕдиницыИзмерения.Владелец = &ВладелецЕдиниц И 
	|	ЕдиницыИзмерения.ПометкаУдаления = ЛОЖЬ И 
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору = &БазоваяЕдиницаИзмерения
	|УПОРЯДОЧИТЬ ПО
	|	Коэффициент ВОЗР,
	|	ПолеСортировки ВОЗР
	|");
	
	Запрос.УстановитьПараметр("ВладелецЕдиниц",          ВладелецЕдиниц);
	Запрос.УстановитьПараметр("БазоваяЕдиницаИзмерения", БазоваяЕдиница);
	Запрос.УстановитьПараметр("ЕдиницаПоКлассификатору", БазоваяЕдиница.Наименование);
	Выборка = Запрос.Выполнить().Выбрать();
	// если нашли, то вернем единицу, иначе создадим новую
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		// не нашли - создаем новую
		НоваяЕдиница=Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
		НоваяЕдиница.Владелец=ВладелецЕдиниц;
		НоваяЕдиница.УстановитьНовыйКод("");
		НоваяЕдиница.ЕдиницаПоКлассификатору=БазоваяЕдиница;
		НоваяЕдиница.Коэффициент=1;
		НоваяЕдиница.Точность=2;
		НоваяЕдиница.Наименование=СокрЛП(БазоваяЕдиница);
		НоваяЕдиница.Записать();
		Возврат НоваяЕдиница.Ссылка;
	КонецЕсли;
	
КонецФункции // ПолучитьЕдиницуИзмеренияПоБазовой()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СТАНДАРТНЫХ СОБЫТИЙ ОБЪЕКТА

// Стандартный обработчик заполнения при вводе нового на основании
Процедура ОбработкаЗаполнения(Основание) Экспорт
	Если ТипЗнч(Основание) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	РодительскаяГруппа=ЭтотОбъект.Родитель;
	Если ЭтотОбъект.ЭтоГруппа=Ложь Тогда
		Пока РодительскаяГруппа<>Новый(ТипЗнч(РодительскаяГруппа)) Цикл
			Если РодительскаяГруппа.СтавкаНДС<>Новый(ТипЗнч(СтавкаНДС)) И СтавкаНДС=Новый(ТипЗнч(СтавкаНДС)) Тогда
				СтавкаНДС=РодительскаяГруппа.СтавкаНДС;
			КонецЕсли; 
			Если РодительскаяГруппа.ТипНоменклатуры<>Новый(ТипЗнч(ТипНоменклатуры)) И ТипНоменклатуры=Новый(ТипЗнч(ТипНоменклатуры)) Тогда
				ТипНоменклатуры = РодительскаяГруппа.ТипНоменклатуры;
				БазоваяЕдиницаИзмерения = ТипНоменклатуры.ОсновнаяБазоваяЕдиницаИзмерения;
			КонецЕсли; 
			Если РодительскаяГруппа.ВидНоменклатуры<>Новый(ТипЗнч(ВидНоменклатуры)) И ВидНоменклатуры=Новый(ТипЗнч(ВидНоменклатуры)) Тогда
				ВидНоменклатуры = РодительскаяГруппа.ВидНоменклатуры;
			КонецЕсли; 
			Если РодительскаяГруппа.ВалютаУчета<>Новый(ТипЗнч(ВалютаУчета)) И ВалютаУчета=Новый(ТипЗнч(ВалютаУчета)) Тогда
				ВалютаУчета = РодительскаяГруппа.ВалютаУчета;
			КонецЕсли;
			Если (НЕ обЗначениеНеЗаполнено(РодительскаяГруппа.СпособРаспределенияДопРасходов)) И (обЗначениеНеЗаполнено(СпособРаспределенияДопРасходов)) Тогда
				СпособРаспределенияДопРасходов=РодительскаяГруппа.СпособРаспределенияДопРасходов;
			КонецЕсли; 
			Если (НЕ обЗначениеНеЗаполнено(РодительскаяГруппа.СтатьяДопРасходов)) И (обЗначениеНеЗаполнено(СтатьяДопРасходов)) Тогда
				СтатьяДопРасходов=РодительскаяГруппа.СтатьяДопРасходов;
			КонецЕсли; 
			Если (НЕ обЗначениеНеЗаполнено(РодительскаяГруппа.ПроцентНаценки)) И (обЗначениеНеЗаполнено(ПроцентНаценки)) Тогда
				ПроцентНаценки=РодительскаяГруппа.ПроцентНаценки;
			КонецЕсли; 
			РодительскаяГруппа=РодительскаяГруппа.Родитель;
		КонецЦикла; 

		Если СтавкаНДС=Новый(ТипЗнч(СтавкаНДС)) Тогда 
			//Бондаренко++ 20260122
 			//СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
			СтавкаНДС = Справочники.СтавкиНДС.НДС22Процента;
			//Бондаренко-- 20260122
 		КонецЕсли; 
		Если ВидНоменклатуры=Неопределено Тогда
			ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар;
		КонецЕсли;
	Иначе	// Это группа
		// копируем параметры по умолчанию от группы верхнего уровня
		ТипНоменклатуры =	РодительскаяГруппа.ТипНоменклатуры;
		ВидНоменклатуры =	РодительскаяГруппа.ВидНоменклатуры;
		ВалютаУчета =		РодительскаяГруппа.ВалютаУчета;
		СтавкаНДС =			РодительскаяГруппа.СтавкаНДС;
		ПроцентНаценки =	РодительскаяГруппа.ПроцентНаценки;
	КонецЕсли; 
	Если (НЕ обЗначениеНеЗаполнено(ТипНоменклатуры)) И (обЗначениеНеЗаполнено(ВидНоменклатуры)) Тогда
		ОбработкаРеквизита("ТипНоменклатуры");
	КонецЕсли; 
	Если ЭтотОбъект.ЭтоГруппа=Ложь И БазоваяЕдиницаИзмерения=Новый(ТипЗнч(БазоваяЕдиницаИзмерения)) Тогда
		БазоваяЕдиницаИзмерения = Константы.ОсновнаяЕдиницаИзмеренияКоличества;
	КонецЕсли;
	Если обЗначениеНеЗаполнено(ВалютаУчета) Тогда
		ВалютаУчета = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	КонецЕсли; 
	Если НЕ спОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
	Если ЭтотОбъект.ЭтоГруппа=Ложь И ЭтоНовый() Тогда
		ОсновнаяЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
	КонецЕсли;
	
	//Бондаренко++ 20230512
	Если ЭтоНовый() И ЭтотОбъект.ЭтоГруппа=Ложь Тогда
 		Если обЗначениеНеЗаполнено(ЭтотОбъект.Родитель) Тогда
			ЭтотОбъект.Родитель=Справочники.Номенклатура.NIRAX;
 		КонецЕсли;	
	КонецЕсли;	
 	//Бондаренко-- 20220512
	
КонецПроцедуры // ОбработкаЗаполнения()

// Стандартный обработчик копирования объекта
Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ спПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
	
	Если НЕ ОбъектКопирования.ЭтоГруппа Тогда
		// Затираем артикул - все равно он будет новый
		Артикул = "";
		//Так же очищаем таблицу ячеек, т.к. они привязаны к другой карточке
		ЯчейкиХранения.Очистить();
		//Бондаренко++ 20190226
		ТипНоменклатурыДляПланирования="";
		//Бондаренко-- 20190226
	КонецЕсли;
КонецПроцедуры // ПриКопировании()

//Бондаренко++ 20260812
Функция ПроверитьДублиПоАртикулуАЦ(АртикулАЦ)
	
	ЕстьДубли_ = Ложь;
	
	Если НЕ обЗначениеНеЗаполнено(ТипНоменклатуры) Тогда

		Запрос = Новый Запрос;  
		
		Если ТипНоменклатуры.ВедетсяМаркировка Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Номенклатура.Ссылка КАК Ссылка,
			|	Номенклатура.Артикул КАК Артикул,
			|	Номенклатура.Код КАК Код,
			|	Номенклатура.АртикулАЦ КАК АртикулАЦ,
			|	Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
			|	Номенклатура.Наименование КАК Наименование,
			|	Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
			|	Номенклатура.ТипНоменклатуры.ВедетсяМаркировка КАК ВедетсяМаркировка
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.Ссылка <> &ТекЭл
			|	И Номенклатура.АртикулАЦ = &АртикулАЦ
			|	И Номенклатура.ВидНоменклатуры <> &ВидНоменклатурыУслуга
			|	И Номенклатура.ТипНоменклатуры.ВедетсяМаркировка";
		Иначе
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Номенклатура.Ссылка КАК Ссылка,
			|	Номенклатура.Артикул КАК Артикул,
			|	Номенклатура.Код КАК Код,
			|	Номенклатура.АртикулАЦ КАК АртикулАЦ,
			|	Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
			|	Номенклатура.Наименование КАК Наименование,
			|	Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
			|	Номенклатура.ТипНоменклатуры.ВедетсяМаркировка КАК ВедетсяМаркировка
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.Ссылка <> &ТекЭл
			|	И Номенклатура.АртикулАЦ = &АртикулАЦ
			|	И Номенклатура.ВидНоменклатуры <> &ВидНоменклатурыУслуга
			|	И НЕ Номенклатура.ТипНоменклатуры.ВедетсяМаркировка";	
 		КонецЕсли;
  		
		Запрос.УстановитьПараметр("ТекЭл",Ссылка);
		Запрос.УстановитьПараметр("АртикулАЦ",АртикулАЦ);
		Запрос.УстановитьПараметр("ВидНоменклатурыУслуга",Перечисления.ВидыНоменклатуры.Услуга);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			#Если НаКлиенте Тогда
				Сообщить("ОШИБКА! Обнаружен дубль по АртикулуАЦ = <"+СокрЛП(АртикулАЦ)+
				">. Код: <"+СокрЛП(ВыборкаДетальныеЗаписи.Код)+
				">, Артикул: <"+СокрЛП(ВыборкаДетальныеЗаписи.Артикул)+
				">, Наименование: <"+СокрЛП(ВыборкаДетальныеЗаписи.Наименование)+">.",СтатусСообщения.ОченьВажное											
				);
			#КонецЕсли 
			ЕстьДубли_ = Истина;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ЕстьДубли_;
   
КонецФункции // ПроверитьДублиПоАртикулуАЦ(АртикулАЦ)
//Бондаренко-- 20260812


// Стандартный обработчик ПередЗаписью элемента справочника
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоГруппа Тогда
		// Надо принудительно сформировать артикул для поиска
		АртикулДляПоиска = Справочники.Номенклатура.ПреобразоватьВАртикулДляПоиска(Артикул, Производитель);
	КонецЕсли;
	
	Если ЭтоНовый() И ПустаяСтрока(Код) Тогда
		УстановитьНовыйКод();
	КонецЕсли;
	//++Галактионов 16 12 2023 Временное отключение проверки
	Если Не РольДоступна("ПолныеПрава") 
		// Холышевская ++ 08.04.2026 
		И НЕ обПраво("ИзменениеТипаНоменклатуры",Права,,ЭтотОбъект) 
		// Холышевская -- 08.04.2026
		Тогда
		Если НЕ спПередЗаписью(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	КонецЕсли;
	//--Галактионов 16 12 2023 Временное отключение проверки
	Если НЕ ЭтоГруппа Тогда
		Если ВидНоменклатуры<>Перечисления.ВидыНоменклатуры.Набор И ВидНоменклатуры<>Перечисления.ВидыНоменклатуры.Комплект Тогда
			СоставНабора.Очистить();
		КонецЕсли; 
	КонецЕсли;
	
	Если ВидНоменклатуры<>Перечисления.ВидыНоменклатуры.Услуга Тогда
		СпособРаспределенияДопРасходов=Неопределено;
		СтатьяДопРасходов=Неопределено;
		Если НЕ ЭтоГруппа Тогда
			ВидПлатежа=Неопределено;
		КонецЕсли; 
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		Если ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга ИЛИ ТипНоменклатуры.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга Тогда
			Если ЗначениеЗаполнено(КодТНВЭД) Тогда
				КодТНВЭД = Справочники.КлассификаторТНВЭД.ПустаяСсылка();
			КонецЕсли; 
  		КонецЕсли;
	КонецЕсли;
	
	Если (НЕ ЭтоГруппа) И (ЭтоНовый()) Тогда
		Автор=ПараметрыСеанса.Пользователь;
		Дата=ТекущаяДата();
	КонецЕсли; 
	
	//Бондаренко++ 20190513
	Если НЕ обЗначениеНеЗаполнено(СтавкаНДС) Тогда
		Если СтавкаНДС.Ставка = 18 Тогда
	    	Попытка	СтавкаНДС=Справочники.СтавкиНДС.НДС22Процента;	Исключение	КонецПопытки;
 		КонецЕсли; 
	КонецЕсли; 
 	//Бондаренко-- 20190513
	
	//Бондаренко++ 20260122
	Если НЕ обЗначениеНеЗаполнено(СтавкаНДС) Тогда
		Если СтавкаНДС.Ставка = 20 Тогда
	    	Попытка	СтавкаНДС=Справочники.СтавкиНДС.НДС22Процента;	Исключение	КонецПопытки;
 		КонецЕсли; 
	КонецЕсли; 
 	//Бондаренко-- 20260122
	
 	//Корельский{
	Если НЕ ЭтоНовый() Тогда
		ЗаписатьСтарыеЯчейки();
   	КонецЕсли;
	//}
	
	НовыйЭлемент = ЭтоНовый();
	
	//Бондаренко 20151001 ++
	 
	Если (НЕ ЭтоГруппа) Тогда
 		ФлагУспешно = Истина;
 		Попытка
			НаборЗаписей = РегистрыСведений.НомерШК.СоздатьНаборЗаписей(); 
		Исключение
			ФлагУспешно=Ложь;
		КонецПопытки;
		
		Если ФлагУспешно Тогда
			НаборЗаписей.Прочитать(); 
			РегистрНомер = 0;
			Для Каждого Запись из НаборЗаписей Цикл 
				РегистрНомер = Макс(Запись.Номер,РегистрНомер); 
			КонецЦикла; 
		КонецЕсли;
	КонецЕсли;
	//Бондаренко 20151001 --
	
	//Бондаренко 20160324 ++
	Если НЕ обЗначениеНеЗаполнено(Артикул) Тогда
		АртикулАЦ = Артикул;
 		АртикулАЦ = СтрЗаменить(АртикулАЦ," ","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,"~","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,"`","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,"!","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,"@","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,"""","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,"#","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,"№","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,";","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,"$","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,"%","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,"^","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,":","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,"?","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,"*","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,"(","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,")","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,"_","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,"-","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,"+","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,"=","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,"|","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,"\","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,"/","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,"{","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,"[","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,"}","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,"]","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,":","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,";","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,"'","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,"<","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,"'","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,">","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,",","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,".","");
		АртикулАЦ = СтрЗаменить(АртикулАЦ,"?","");
	КонецЕсли; 	
 	//Бондаренко 20160324 --
	
	//Бондаренко++ 20260812
	Если Не РольДоступна("ПолныеПрава") Тогда 
		Если (НЕ ЭтоГруппа) Тогда
			Если обПраво("АртикулАЦУникальный",Права) Тогда
				Если ЭтоНовый() Тогда
					Если НЕ обЗначениеНеЗаполнено(АртикулАЦ) Тогда
						Если ВидНоменклатуры<>Перечисления.ВидыНоменклатуры.Услуга Тогда
							ЕстьДублиПоАртикулуАЦ = Ложь; 
							ЕстьДублиПоАртикулуАЦ = ПроверитьДублиПоАртикулуАЦ(АртикулАЦ);
							Если ЕстьДублиПоАртикулуАЦ Тогда
								Отказ = Истина;
								Возврат;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
	//Бондаренко-- 20260812
	
	//Бондаренко++ 20190128
	Если (НЕ ЭтоГруппа) Тогда
		ПравильныйПроизводительПлюсАртикул = СокрЛП(Производитель.Код)+"+"+СокрЛП(Артикул);
		Если ПроизводительПлюсАртикул <> ПравильныйПроизводительПлюсАртикул Тогда
			ПроизводительПлюсАртикул = ПравильныйПроизводительПлюсАртикул;
		КонецЕсли; 
 		#Если НаКлиенте Тогда
			//Сообщить("ПроизводительПлюсАртикул ="+ПроизводительПлюсАртикул);
		#КонецЕсли
	КонецЕсли;	
  	//Бондаренко-- 20190128	
     
	//Гэндальф+++

 	Если Не обПраво("РедактированиеВсейНоменклатуры",Права,,ЭтотОбъект) тогда
		Если Ссылка.Родитель <> ЭтотОбъект.Родитель тогда
			Корень =  ОбщиеСервер.НайтиКорень(Ссылка);
			ЗапретНаРедактирование = обПолучитьЗначениеСвойства(ЭтотОбъект,"ЗапретНаРедактированиеПодчиненых");
			Если ЗапретНаРедактирование тогда
				#Если НаКлиенте Тогда
					Отказ = Истина; 
					Сообщить("Из этой группы запрещенно перемещать номенклатуру");
				#КонецЕсли 
 			КонецЕсли;	
		КонецЕсли;
 	КонецЕсли;
	//Гэндальф---  
	
	//Бондаренко++ 20230512
	Если обЗначениеНеЗаполнено(ЭтотОбъект.Родитель) И ЭтотОбъект.ЭтоГруппа=Ложь Тогда
		Попытка ЭтотОбъект.Родитель = Справочники.Номенклатура.NIRAX; Исключение КонецПопытки; 
 	КонецЕсли;
 	//Бондаренко++ 20230512	
	
	//Бондаренко++ 20221126
	Попытка
		ЭтотОбъект.Наименование       = СокрЛП ( ЭтотОбъект.Наименование);
		ЭтотОбъект.Наименование       = СокрЛП ( Врег ( Сред (ЭтотОбъект.Наименование,      1,1) ) + Сред ( ЭтотОбъект.Наименование      ,2) );
		ЭтотОбъект.НаименованиеИностранное = СокрЛП ( ЭтотОбъект.НаименованиеИностранное);
		ЭтотОбъект.НаименованиеИностранное = СокрЛП ( Врег ( Сред (ЭтотОбъект.НаименованиеИностранное,1,1) ) + Сред ( ЭтотОбъект.НаименованиеИностранное,2) );	
		ЭтотОбъект.НаименованиеПолное = СокрЛП ( ЭтотОбъект.НаименованиеПолное);
		ЭтотОбъект.НаименованиеПолное = СокрЛП ( Врег ( Сред (ЭтотОбъект.НаименованиеПолное,1,1) ) + Сред ( ЭтотОбъект.НаименованиеПолное,2) );	
	Исключение
	КонецПопытки;
 	//Бондаренко-- 20221126
 	
КонецПроцедуры // ПередЗаписью()

//Бондаренко 20151008 ++
//Функция	ПроверитьСкладскойПризнак(ДЦ);
//	
//	Запрос = Новый Запрос();
//	
//	Запрос.Текст = "ВЫБРАТЬ
//	|	НоменклатураСкладскиеПризнаки.Ссылка,
//	|	НоменклатураСкладскиеПризнаки.ДилерскийЦентр,
//	|	НоменклатураСкладскиеПризнаки.СкладскойПризнак
//	|ИЗ
//	|	Справочник.Номенклатура.СкладскиеПризнаки КАК НоменклатураСкладскиеПризнаки
//	|ГДЕ
//	|	НоменклатураСкладскиеПризнаки.Ссылка = &ВыбСсылка
//	|	И НоменклатураСкладскиеПризнаки.ДилерскийЦентр = &ВыбДЦ";
//	
// 	Запрос.УстановитьПараметр("ВыбСсылка", Ссылка);
//	Запрос.УстановитьПараметр("ВыбДЦ", ДЦ);
//	
//	Возврат Запрос.Выполнить().Выгрузить().Количество(); 
//	
//КонецФункции	
//Бондаренко 20151008 --


// Стандартный обработчик ПриЗаписи элемента справочника
Процедура ПриЗаписи(Отказ)
	Если НЕ спПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	
	// зарегистрируем изменение товара в оборудовании
	//уоУстановитьМоментИзменения(Ссылка,ТекущаяДата());
	//Корельский
	//Бондаренко++ 20211214
	Если Не ЭтотОбъект.ПометкаУдаления Тогда
	//Бондаренко-- 20211214	
		Если ЗначениеЗаполнено(ЭтотОбъект.ОсновнаяЕдиницаИзмерения) Тогда
			ПроверитьЗаписатьШтрихкод();
		КонецЕсли;
	//Бондаренко++ 20211214	
	КонецЕсли;                 	
    //Бондаренко-- 20211214
  	//}
	//Бондаренко 20151008 ++
	//ДЦ = ПараметрыСеанса.ПодразделениеКомпании.ДилерскийЦентр;
	//Если ЗначениеЗаполнено(ДЦ) Тогда
	// 	Если Ссылка.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар Тогда
	//		Если ПроверитьСкладскойПризнак(ДЦ) = 0 Тогда
	//			//Сообщить("ОШИБКА! Не задан складской признак для текущей номенклатуры по дилерскому центру "+ДЦ,СтатусСообщения.ОченьВажное);
	//			//Отказ = Истина;
	//		КонецЕсли;	
	//	КонецЕсли;		
	//КонецЕсли;		
	//Бондаренко 20151008 --
	
КонецПроцедуры // ПриЗаписи()

// Стандартный обработчик ПередУдалением элемента
Процедура ПередУдалением(Отказ)
	Если НЕ спПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()

// Стандартный обработчик ПриУстановкеНовогоКода элемента
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриУстановкеНовогоКода()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

#Если Клиент Тогда
	
// Процедура открывает автокаталог
Процедура ОткрытьАвтокаталог() Экспорт
	Если обЗначениеНеЗаполнено(ЭтотОбъект) Тогда Возврат; КонецЕсли;
	Если ЭтотОбъект.ЭтоГруппа Тогда Возврат; КонецЕсли;
	
	//Если объект автокаталога не создан - создадим
	Если глАвтокаталог=Неопределено Тогда
		Попытка
			глАвтокаталог=Новый COMОбъект("AutoCat10.AutoDealer");
		Исключение
			Сообщить("Ошибка подключения к системе автокаталога: "+ОписаниеОшибки());
			Возврат;
		КонецПопытки; 
	КонецЕсли; 
	
	//Получим применяемость детали
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НоменклатураПрименяемость.Модель КАК Модель
	|ИЗ
	|	РегистрСведений.НоменклатураПрименяемость КАК НоменклатураПрименяемость
	|ГДЕ
	|	НоменклатураПрименяемость.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура",ЭтотОбъект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Сообщить("У номенклатуры <"+СокрЛП(ЭтотОбъект.Ссылка)+"> применяемость по моделям не задана.");
		Возврат;
	КонецЕсли;
	Модель=Выборка.Модель.Наименование;
	//Получим производителя модели
	Позиция=Найти(Модель," ");
	Завод=?(Позиция=0,Модель,Лев(Модель,Позиция-1));
	//Формирование параметра запуска автокаталога
	МассивПараметров = Новый Массив();
	Если обЗначениеНеЗаполнено(ЭтотОбъект.КартинкаАвтокаталога) Тогда
	Иначе
		//разберем на параметры
		Картинка = ЭтотОбъект.КартинкаАвтокаталога + ",";
		Пока Истина Цикл
			ПозицияРазделителя = Найти(Картинка, ",");
			Если ПозицияРазделителя = 0 Тогда
				Прервать;
			КонецЕсли;
			МассивПараметров.Добавить(Лев(Картинка, ПозицияРазделителя - 1));
			Картинка = Сред(Картинка, ПозицияРазделителя + 1);
		КонецЦикла;
	КонецЕсли;
	//проверим достаточно ли параметров для запуска
	Если МассивПараметров.Количество() <> 4 Тогда
		Сообщить("Неверный идентификатор детали автокаталога.");
		Возврат;
	КонецЕсли;
	
	Попытка
		//Попытаемся запустить автокаталог
		глАвтокаталог.GetPicture(Число(МассивПараметров[0]), Число(МассивПараметров[1]), Число(МассивПараметров[2]),
								Строка(МассивПараметров[3]));
		//Запуск удался - выходим
		Возврат;
	Исключение
		//При запуске автокаталога произошла ошибка
		глАвтокаталог=Неопределено;
		//Попробуем создать объект автокаталога еще раз
		Попытка
			глАвтокаталог=Новый COMОбъект("AutoCat10.AutoDealer");
		Исключение
			Сообщить("Ошибка подключения к системе автокаталога: "+ОписаниеОшибки());
			Возврат;
		КонецПопытки; 
	КонецПопытки; 
	Попытка
		//Попытаемся запустить автокаталог еще раз
		глАвтокаталог.GetPicture(Число(МассивПараметров[0]), Число(МассивПараметров[1]), Число(МассивПараметров[2]),
								Строка(МассивПараметров[3]));
		//Запуск удался - выходим
		Возврат;
	Исключение
		//Повторный запуск тоже не удался
		Сообщить("Ошибка при инициализации автокаталога: "+ОписаниеОшибки());
		Возврат;
	КонецПопытки; 
КонецПроцедуры // ОткрытьАвтокаталог()

#КонецЕсли

// Функция возвращает идентификатор группы аналогов
Функция ИдентификаторГруппыАналогов() Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
				 |	ГруппыАналогов.ИдентификаторГруппы КАК ИдентификаторГруппы
				 |ИЗ
				 |	РегистрСведений.ГруппыАналогов КАК ГруппыАналогов
				 |ГДЕ
				 |	ГруппыАналогов.Артикул=&Артикул";
	Запрос.УстановитьПараметр("Артикул",Артикул);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ИдентификаторГруппы;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции // ИдентификаторГруппыАналогов() 

//Получает идентификатор группы аналогов и если группы нет, генерирует новый идентификатор
Функция ПолучитьИдентификаторГруппыАналогов() Экспорт
	ИДГруппы=ИдентификаторГруппыАналогов();
	Если ИДГруппы=Неопределено Тогда
		ИДГруппы=СокрЛП(Новый УникальныйИдентификатор);
	КонецЕсли; 
	Возврат ИДГруппы;
КонецФункции // ПолучитьИдентификаторГруппыАналогов() 


//Гэндальф+++
Процедура ЗаписатьУпущеныйСпрос() Экспорт 
  	Запрос=Новый Запрос("
			|ВЫБРАТЬ
			|	ОстаткиТоваровКомпанииОстатки.СкладКомпании КАК СкладКомпании,
			|	СУММА(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток) КАК Количество,
			|	СУММА(ОстаткиТоваровКомпанииОстатки.РезервОстаток) КАК Резерв,
			|	СУММА(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток)-СУММА(ОстаткиТоваровКомпанииОстатки.РезервОстаток) КАК Остаток,
			|	ВЫБОР
			|		КОГДА ОстаткиТоваровКомпанииОстатки.СкладКомпании.Розничный=ИСТИНА
			|			ТОГДА СУММА(ОстаткиТоваровКомпанииОстатки.СуммаРознОстаток)
			|			ИНАЧЕ 0
			|	КОНЕЦ КАК СуммаРозн,
			|	ВЫБОР
			|		КОГДА ОстаткиТоваровКомпанииОстатки.СкладКомпании.Розничный=ИСТИНА
			|			ТОГДА 
			|				ВЫБОР
			|					КОГДА (СУММА(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток) ЕСТЬ NULL) ИЛИ СУММА(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток)=0
			|						ТОГДА 0
			|						ИНАЧЕ СУММА(ОстаткиТоваровКомпанииОстатки.СуммаРознОстаток)/СУММА(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток)
			|				КОНЕЦ
			|			ИНАЧЕ 0
			|	КОНЕЦ КАК ЦенаРозничная
			|ИЗ
			|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, Номенклатура=&Номенклатура) КАК ОстаткиТоваровКомпанииОстатки
			|СГРУППИРОВАТЬ ПО ОстаткиТоваровКомпанииОстатки.СкладКомпании
			|УПОРЯДОЧИТЬ ПО
			|	ОстаткиТоваровКомпанииОстатки.СкладКомпании
			|");
			Запрос.УстановитьПараметр("Номенклатура",Ссылка);
			Остатки=Запрос.Выполнить().Выгрузить();
			
			Если Остатки.Количество()=0 и Артикул <>"" тогда
				
				     НовыйУпущенныйСпрос = РегистрыСведений.УпущенныйСпрос.СоздатьМенеджерЗаписи();
				    НовыйУпущенныйСпрос.Артикул=Артикул;
				    НовыйУпущенныйСпрос.Автор=Автор;
				    НовыйУпущенныйСпрос.Количество=1;
				    НовыйУпущенныйСпрос.Комментарий=Комментарий;
				    НовыйУпущенныйСпрос.Номенклатура=Ссылка;
				    НовыйУпущенныйСпрос.Причина=Справочники.ПричиныУпущенногоСпроса.ОтсутствуетНаСкладе;
				    НовыйУпущенныйСпрос.ИсточникЗапроса=Справочники.ИсточникиЗапроса.Клиент;
				    НовыйУпущенныйСпрос.Период=ТекущаяДата();
				    НовыйУпущенныйСпрос.Записать(Истина);

			КонецЕсли;	
		КонецПроцедуры
		
Функция ПроверитьКоректностьЯчеек() Экспорт 
    ЕстьЯчейки = Ложь;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураЯчейкиХранения.Ссылка
		|ИЗ
		|	Справочник.Номенклатура.ЯчейкиХранения КАК НоменклатураЯчейкиХранения
		|ГДЕ
		|	НоменклатураЯчейкиХранения.ЯчейкаХранения В(&ЯчейкаХранения)
		|	И НоменклатураЯчейкиХранения.Ссылка <> &Ссылка";

	Запрос.УстановитьПараметр("ЯчейкаХранения", ЯчейкиХранения.ВыгрузитьКолонку("ЯчейкаХранения"));
    Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЕстьЯчейки = Истина
	КонецЦикла;

	Возврат ЕстьЯчейки;
КонецФункции			
//Гэндальф---

//Бондаренко 20151020 ++
// Функция, приводящая строку к необходимой длине строки символом
//
// Параметры:
//  Реж    - число -  1 - добавлять символы слева, 2 - справа, 3 - слева и справа
//  Стр    - строка - строка которую редактируем,
//  Символ - строка - символ, который вставляем,
//  Длина  - Число - длина до которой приводим.
//
// Возвращаемое значение:
//  Стр - строка - результат редактирования строки.
//
Функция СтрокаПривести(Стр,Символ,Длина,Реж=1)
	ДопСтр=""; Сч=Длина-СтрДлина(Стр);
	Если Сч>0  Тогда
		Для к=1 По Сч Цикл
			ДопСтр=ДопСтр+Символ;
		КонецЦикла;
		Если Реж=1 Тогда Возврат ДопСтр+Стр;
		ИначеЕсли Реж=2 Тогда Возврат Стр+ДопСтр;
		Иначе к=Окр(Сч/2); Возврат Лев(ДопСтр,к)+Стр+Прав(ДопСтр,Сч-к);
		КонецЕсли;
	Иначе Возврат Стр;
	КонецЕсли;
КонецФункции // СтрокаПривести()
  
// Вычисляет контрольную цифру EAN-13/EAN-8  GOAN
// Возвращает штрих-код с контрольной цифрой
//
// Параметры:
//  Код - строка - код, по которому вычисляем контрольную цифру.
//
// Возвращаемое значение:
//  Рез - Строка - штрих-код с контрольной цифрой. 
//
Функция EAN13(Код) Экспорт
	ШтрКод = Формат(Число(Код),"ЧН=; ЧВН=; ЧГ=0; ЧЦ="+?(СтрДлина(Код)<8,"7","12"));
	Четн = 0; Нечетн = 0;
	Если СтрДлина(Код)=7 Тогда Итераций = 4; 
	Иначе Итераций = 6; 
	КонецЕсли;
	Для Индекс=1 По Итераций Цикл
		Четн=Четн+Сред(ШтрКод,2*Индекс,1);
		Нечетн=Нечетн+Сред(ШтрКод,2*Индекс-1,1);
	КонецЦикла;
	Если СтрДлина(Код)=7 Тогда Нечетн=Нечетн*3; 
	Иначе Четн=Четн*3;
	КонецЕсли;
	КонтЦифра=10-(Четн+Нечетн)%10;
	Если КонтЦифра=10 Тогда КонтЦифра=0;КонецЕсли;
	Рез=ШтрКод+Строка(КонтЦифра);
	Возврат Рез;
КонецФункции // EAN13()
//Бондаренко 20151020 --

//Корельский {
Процедура ПроверитьЗаписатьШтрихкод() Экспорт
	Если ЗначениеЗаполнено(Артикул) ТОгда
		ЗапросШтрихкода = Новый Запрос();
		ЗапросШтрихкода.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		                        |	ШтрихКоды.ШтрихКод
		                        |ИЗ
		                        |	РегистрСведений.ШтрихКоды КАК ШтрихКоды
		                        |ГДЕ
		                        |	ШтрихКоды.Объект = &Объект
		                        |	И ШтрихКоды.ЕдиницаИзмерения = &ЕдиницаИзмерения
		                        |	И ШтрихКоды.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)";
		ЗапросШтрихкода.УстановитьПараметр("Объект", Ссылка);
		ЗапросШтрихкода.УстановитьПараметр("ЕдиницаИзмерения", ОсновнаяЕдиницаИзмерения);
		Если ЗапросШтрихкода.Выполнить().Пустой() Тогда
			//Нужно создать штрихкод
			МенеджерЗаписиНовгоШтрихкода = РегистрыСведений.ШтрихКоды.СоздатьМенеджерЗаписи();
			МенеджерЗаписиНовгоШтрихкода.Активность = истина;
			МенеджерЗаписиНовгоШтрихкода.ВыгружатьВОборудование = истина;
			МенеджерЗаписиНовгоШтрихкода.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмерения;
			МенеджерЗаписиНовгоШтрихкода.Объект = Ссылка;
			МенеджерЗаписиНовгоШтрихкода.ШтрихКод = Артикул;
			
			//Бондаренко 20151002 ++
			Если ФлагУспешно Тогда
				ПрефиксКода = "20";
				КодПоПорядку=Ложь;
				Попытка
					МенеджерЗаписиНовгоШтрихкода.ШтрихКод = EAN13(Строка(ПрефиксКода) + СтрокаПривести(СокрЛП(СтрЗаменить(РегистрНомер+1,Символы.НПП,"")),"0", 10, 1));
					КодПоПорядку=Истина;
				Исключение	
					//
				КонецПопытки;
				
				Если КодПоПорядку Тогда
					
					НаборЗаписей =  РегистрыСведений.НомерШК.СоздатьНаборЗаписей();
					НаборЗаписей.Записать();
					
					НаборЗаписей =  РегистрыСведений.НомерШК.СоздатьНаборЗаписей();
					НоваяЗапись = НаборЗаписей.Добавить(); 
					НоваяЗапись.Номер = РегистрНомер + 1; 
					НаборЗаписей.Записать();	
					
				КонецЕсли;	
			КонецЕсли;	
			//Бондаренко 20151002 --
			
			МенеджерЗаписиНовгоШтрихкода.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
			
			МенеджерЗаписиНовгоШтрихкода.Записать();
			#Если Клиент Тогда
			//Бондаренко 20151002 ++
			//Временно отключил
			Сообщить("Номенклатуре (" + Артикул + ") "+Наименование + " присвоен штрихкод " + МенеджерЗаписиНовгоШтрихкода.ШтрихКод);
 			//Бондаренко 20151002 --
			#КонецЕсли

		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
//}

//Корельский {
Процедура ЗаписатьСтарыеЯчейки()
	ЗапросЯчеек = Новый Запрос();
	ЗапросЯчеек.МенеджерВременныхТаблиц = новый МенеджерВременныхТаблиц;
	ЗапросЯчеек.Текст = "ВЫБРАТЬ
	                    |	ЯчейкиХранения.ЯчейкаХранения,
	                    |	ЯчейкиХранения.СкладКомпании
	                    |ПОМЕСТИТЬ ЯчейкиНовые
	                    |ИЗ
	                    |	&ЯчейкиХранения КАК ЯчейкиХранения
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	НоменклатураЯчейкиХранения.СкладКомпании,
	                    |	НоменклатураЯчейкиХранения.ЯчейкаХранения
	                    |ИЗ
	                    |	Справочник.Номенклатура.ЯчейкиХранения КАК НоменклатураЯчейкиХранения
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ ЯчейкиНовые КАК ЯчейкиНовые
	                    |		ПО НоменклатураЯчейкиХранения.СкладКомпании = ЯчейкиНовые.СкладКомпании
	                    |			И НоменклатураЯчейкиХранения.ЯчейкаХранения = ЯчейкиНовые.ЯчейкаХранения
	                    |ГДЕ
	                    |	НоменклатураЯчейкиХранения.Ссылка = &Номенклатура
						|	И ЯчейкиНовые.ЯчейкаХранения ЕСТЬ NULL";
	ЗапросЯчеек.УстановитьПараметр("ЯчейкиХранения", ЯчейкиХранения.Выгрузить());
	ЗапросЯчеек.УстановитьПараметр("Номенклатура", Ссылка);
	
	РезультатЗапроса = ЗапросЯчеек.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		НаборЗаписейРегистра = РегистрыСведений.ИсторияСкладскихЯчеек.СоздатьНаборЗаписей();
		НаборЗаписейРегистра.Отбор.Номенклатура.Установить(Ссылка);
		НаборЗаписейРегистра.Прочитать();
		
		ВыборкаИзЗапроса = РезультатЗапроса.Выбрать();
		Пока ВыборкаИзЗапроса.Следующий() Цикл
			СтрокаНабораЗаписей = НаборЗаписейРегистра.Добавить();
			СтрокаНабораЗаписей.Номенклатура = Ссылка;
			СтрокаНабораЗаписей.СкладКомпании = ВыборкаИзЗапроса.СкладКомпании;
			СтрокаНабораЗаписей.НомерЯчейки = ВыборкаИзЗапроса.ЯчейкаХранения.Код;
			СтрокаНабораЗаписей.Пользователь = ПараметрыСеанса.Пользователь;
			СтрокаНабораЗаписей.Период = ТекущаяДата();
		КонецЦикла;
		
 		НаборЗаписейРегистра.Записать();
  	КонецЕсли;
КонецПроцедуры
//}

// Проверим корректность ставки НДС для устранения ситуации выбора ставки НДС 18%
//
Функция ПроверитьКорректностьСтавкиНДС() Экспорт
	
	// По закону с 01.01.2019 вместо ставки НДС 18% необходимо использовать ставку НДС 20%.
	
	ТекДата = ТекущаяДатаСеанса();
	
	СтавкаНДСНоменклатуры = СтавкаНДС.Ставка;
	
	// !!!_Переход на ставку НДС 20%
	// После 01.01.2019 убрать проверку на ввод ставки НДС 20%
	Если ТекДата < Дата("20190101") Тогда
		Если СтавкаНДСНоменклатуры = 20 Тогда
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Если СтавкаНДСНоменклатуры = 18 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ПроверитьКорректностьСтавкиНДС()

#Если Клиент Тогда

	// Процедура формирует отчет "Остатки и обороты партий товаров",
// с отбором по указанной номенклатуре
Процедура ОтчетОстаткиИОборотыПартийТоваров() Экспорт
	
	Если Ссылка.Пустая() ИЛИ Ссылка.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли; 
	
	// заполним параметры отчета
	Отчет = Отчеты.ОстаткиИОборотыПартийТоваров.Создать();
	Отчет.ЗаполнитьНачальныеНастройки();
	
	МетаданныеОтчета  = Отчет.Метаданные();
	ВариантОтчета     = Отчет.СхемаКомпоновкиДанных.ВариантыНастроек.ОстаткиИОбороты;
	НастройкиВарианта = ВариантОтчета.Настройки;
	
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания",        КонецДня(ТекущаяДата()));
	
	ИмяФормыОтчета = МетаданныеОтчета.ПолноеИмя() + ".Форма";
	
	Показатели      = НастройкиВарианта.Выбор;
	ОтборОтчета     = НастройкиВарианта.Отбор;
	СтруктураОтчета = НастройкиВарианта.Структура;
	
	Для Каждого ТекПоказатель Из Показатели.Элементы Цикл
		Если СокрЛП(ТекПоказатель.Поле) = "Приход" ИЛИ СокрЛП(ТекПоказатель.Поле) = "Расход" Тогда
			ТекПоказатель.Использование = Истина;
		Иначе
			ТекПоказатель.Использование = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	// фильтры
	ОтборОтчета.Элементы.Очистить();
	
	ТекОтбор = ОтборОтчета.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ТекОтбор.Использование  = Истина;
	ТекОтбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Номенклатура");
	ТекОтбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ТекОтбор.ПравоеЗначение = Ссылка;
	
	СтруктураОтчета.Очистить();
	
	ТаблицаОтчета = СтруктураОтчета.Добавить(Тип("ТаблицаКомпоновкиДанных"));
	
	ГруппировкаСклад = ОтчетыСервер.СКД_ДобавитьГруппировку(ТаблицаОтчета.Строки, "СкладКомпании");
	ОтчетыСервер.СКД_ДобавитьГруппировку(ГруппировкаСклад.Структура, "ПериодРегистратор");
	
	НастройкиВарианта.ПараметрыВывода.УстановитьЗначениеПараметра("РасположениеРеквизитов", РасположениеРеквизитовКомпоновкиДанных.Отдельно);
	
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Вариант",                 НастройкиВарианта);
	СтруктураПараметров.Вставить("ЗаполнитьНастроки",       Ложь);
	СтруктураПараметров.Вставить("КлючВарианта",            ВариантОтчета.Имя);
	СтруктураПараметров.Вставить("ПредставлениеВарианта",   ВариантОтчета.Представление);
	СтруктураПараметров.Вставить("СформироватьПриОткрытии", Истина);
	СтруктураПараметров.Вставить("ВариантЗагрузкиПериода",  "ВариантСтандартногоПериода.ПроизвольныйПериод");
	
	ОткрытьФорму(ИмяФормыОтчета, СтруктураПараметров);
	
КонецПроцедуры // ОтчетОстаткиИОборотыПартийТоваров()

#КонецЕсли


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли

ОсновнаяЕдиницаИзмеренияОбязательная=Ложь;
НовыйЭлемент = Ложь;
ФлагУспешно = Истина;
