
&НаКлиенте
Процедура кмПолучитьДанные(Команда)
	
	Состояние("Получение данных");
	
	Если НЕ ЭтаФорма.Объект.НастройкаПотока.Пустая() тогда
		
		Результат = ПолучитьДанныеИзДрайвераНаСервере();
		
		Если Результат тогда
			
			ТекстРезультат = "Данные получены." + Символы.ПС +
			"Всего записей:" + ПолучитьКоличествоЗаписейНаСервере();
			
		иначе
			
			ТекстРезультат = "Данные не получены."+ Символы.ПС + "Описание ошибки в окне служебных сообщений.";
			
		КонецЕсли;
		
		Состояние("Получение данных завершено.");
		Предупреждение(ТекстРезультат);
		
	Иначе
		
		Предупреждение("Не выбрана настройка потока!", 10);
		
	КонецЕсли;
	
КонецПроцедуры


////@+ Функция ПолучитьДанныеИзДрайвераСрв()
// Дата создания - 28.05.2012 11:37:43; 
// Автор - Окипний Андрей Евгеньевич
//
// Описание функции
// Функция создает копию объекта обработки на стороне сервера
// и вызывает функцию получения данных из модуля объекта.
// затем передает полученные данные в таблицу форму
//
// Параметры
//  Без параметров
//
// Возвращаемое значение
//  Результат  - Булево - Истина: Успешно, Ложь: не успешно
//
//@-
&НаСервере
Функция ПолучитьДанныеИзДрайвераНаСервере() 
	
	//Первоначальная инициализация
	Результат = неопределено;
	
	мОбъект = РеквизитФормыВЗначение("Объект");
	
	Результат = мОбъект.ПолучитьДанныеИзДрайвераУпр();
	
	ЭтаФорма.Объект.ТаблицаSedr.Загрузить(мОбъект.ТаблицаSedr.Выгрузить());
	
	Возврат Результат;
	
КонецФункции // ПолучитьДанныеИзДрайвераСрв()


////@+ Функция ПолучитьКоличествоЗаписейНаСервере()
// Дата создания - 28.05.2012 11:49:36; 
// Автор - Окипний Андрей Евгеньевич
//
// Описание функции
// Функция посредник. Обращается к функции в модуле объекта
//
// Параметры
//  Без параметров
//
// Возвращаемое значение
//  КоличествоЗаписей  - Число - Глобальная переменная объекта,
//					которая хранит количество считанных записей
//@-
&НаСервере
Функция ПолучитьКоличествоЗаписейНаСервере() 
	
	Возврат ЭтаФорма.Объект.ТаблицаSedr.Количество();
	
КонецФункции // ПолучитьКоличествоЗаписейНаСервере()

&НаКлиенте
Процедура ТаблицаSedrПриАктивизацииСтроки(Элемент)
	
	Если НЕ Элемент.ТекущиеДанные = неопределено тогда
		ЭтаФорма.Элементы.ИнформерБлокировки.Видимость = Элемент.ТекущиеДанные.IS_QUALITY_BLOCKED;
	КонецЕсли;
	
КонецПроцедуры

//Козлво Е.А. Начало 13.07.2016
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отказ = НЕ Renault_РаботаСПравамиПользователя.ЕстьПравоНаРаботуСоСлужебнымиФункциямиRenault();
КонецПроцедуры
//Козлов Е.А. Конец

