Процедура ОбновитьПоЗаявке() Экспорт
	
	ЭтотОбъект.Автомобиль = ЭтотОбъект.ЗаявкаНаСервис.Автомобиль;
	ЭтотОбъект.Клиент = ЭтотОбъект.ЗаявкаНаСервис.Клиент;
	ЭтотОбъект.ЗаказНаряд = ЭтотОбъект.ЗаявкаНаСервис.ЗаказНаряд;
	ЭтотОбъект.Примечание = ЭтотОбъект.ЗаявкаНаСервис.Обращение.Примечание;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Renault_CRM_ЗаявкаНаСервисСоставЭтапа.Ссылка,
	               |	Renault_CRM_ЗаявкаНаСервисСоставЭтапа.IDРаботы,
	               |	Renault_CRM_ЗаявкаНаСервисСоставЭтапа.IDЭтапа
	               |ПОМЕСТИТЬ тРабЭтапы
	               |ИЗ
	               |	Документ.Renault_CRM_ЗаявкаНаСервис.СоставЭтапа КАК Renault_CRM_ЗаявкаНаСервисСоставЭтапа
	               |ГДЕ
	               |	Renault_CRM_ЗаявкаНаСервисСоставЭтапа.Ссылка = &РабочийДокумент
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Renault_CRM_ЗаявкаНаСервисСоставЭтапа.Ссылка,
	               |	Renault_CRM_ЗаявкаНаСервисСоставЭтапа.IDРаботы,
	               |	Renault_CRM_ЗаявкаНаСервисСоставЭтапа.IDЭтапа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.Ссылка,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.Работа,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.Длительность,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.Нормочас,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.Цена,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.Сумма,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.ИдентификаторРаботы,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.ДлительностьЗН,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.IDРаботы,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.НомерСтроки,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.Работа.Артикул КАК Артикул,
	               |	т2.IDЭтапа
	               |ПОМЕСТИТЬ тЭтапСводно
	               |ИЗ
	               |	Документ.Renault_CRM_ЗаявкаНаСервис.Работы КАК Renault_CRM_ЗаявкаНаСервисРаботы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ тРабЭтапы КАК т2
	               |		ПО (т2.Ссылка = Renault_CRM_ЗаявкаНаСервисРаботы.Ссылка)
	               |			И (т2.IDРаботы = Renault_CRM_ЗаявкаНаСервисРаботы.IDРаботы)
	               |ГДЕ
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.Ссылка = &РабочийДокумент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	т3.Ссылка,
	               |	т3.IDЭтапа,
	               |	СУММА(т3.Длительность) КАК СумДлительность,
	               |	СУММА(т3.ДлительностьЗН) КАК СумДлительностьЗН,
	               |	КОЛИЧЕСТВО(т3.IDРаботы) КАК КолРаботы,
	               |	МИНИМУМ(т3.Работа) КАК МинРабота,
	               |	МАКСИМУМ(т3.Работа) КАК МаксРабота
	               |ПОМЕСТИТЬ тОписаниеЭтапа
	               |ИЗ
	               |	тЭтапСводно КАК т3
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	т3.Ссылка,
	               |	т3.IDЭтапа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	               |	Renault_АвтосервисЦехШтампЧасыИсполнители.РабочийДокумент,
	               |	Renault_АвтосервисЦехШтампЧасыИсполнители.IDЭтапа,
	               |	Renault_АвтосервисЦехШтампЧасыИсполнители.ВремяНачало,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Renault_АвтосервисЦехШтампЧасыИсполнители.Исполнитель) КАК КолвоИсполнителей,
	               |	МИНИМУМ(Renault_АвтосервисЦехШтампЧасыИсполнители.Исполнитель) КАК МинИсполнитель,
	               |	МАКСИМУМ(Renault_АвтосервисЦехШтампЧасыИсполнители.Исполнитель) КАК МаксИсполнитель
	               |ПОМЕСТИТЬ тИсполнители
	               |ИЗ
	               |	РегистрСведений.Renault_АвтосервисЦехШтампЧасыИсполнители КАК Renault_АвтосервисЦехШтампЧасыИсполнители
	               |ГДЕ
	               |	Renault_АвтосервисЦехШтампЧасыИсполнители.РабочийДокумент = &РабочийДокумент
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Renault_АвтосервисЦехШтампЧасыИсполнители.РабочийДокумент,
	               |	Renault_АвтосервисЦехШтампЧасыИсполнители.IDЭтапа,
	               |	Renault_АвтосервисЦехШтампЧасыИсполнители.ВремяНачало
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	               |	т1.ТипПериода,
	               |	т1.ОписаниеПериода,
	               |	т1.РабочийДокумент,
	               |	т1.IDЭтапа,
	               |	тОписаниеЭтапа.СумДлительность,
	               |	тОписаниеЭтапа.СумДлительностьЗН,
	               |	тОписаниеЭтапа.КолРаботы,
	               |	тОписаниеЭтапа.МинРабота,
	               |	тОписаниеЭтапа.МаксРабота,
	               |	т1.Цех,
	               |	т1.Исполнитель,
	               |	т1.МинИсполнитель,
	               |	т1.МаксИсполнитель,
	               |	т1.КолвоИсполнителей,
	               |	т1.ВремяНачало,
	               |	т1.ВремяОкончание,
	               |	т1.Длительность,
	               |	т1.Статус,
	               |	т1.Пользователь,
	               |	т1.Комментарий
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		1 КАК ТипПериода,
	               |		""Работа"" КАК ОписаниеПериода,
	               |		Renault_АвтосервисЦехШтампЧасыПродуктивные.РабочийДокумент КАК РабочийДокумент,
	               |		Renault_АвтосервисЦехШтампЧасыПродуктивные.IDЭтапа КАК IDЭтапа,
	               |		Renault_АвтосервисЦехШтампЧасыПродуктивные.Цех КАК Цех,
	               |		Renault_АвтосервисЦехШтампЧасыПродуктивные.Исполнитель КАК Исполнитель,
	               |		т1.МинИсполнитель КАК МинИсполнитель,
	               |		т1.МаксИсполнитель КАК МаксИсполнитель,
	               |		т1.КолвоИсполнителей КАК КолвоИсполнителей,
	               |		Renault_АвтосервисЦехШтампЧасыПродуктивные.ВремяНачало КАК ВремяНачало,
	               |		Renault_АвтосервисЦехШтампЧасыПродуктивные.ВремяОкончание КАК ВремяОкончание,
	               |		Renault_АвтосервисЦехШтампЧасыПродуктивные.Длительность КАК Длительность,
	               |		Renault_АвтосервисЦехШтампЧасыПродуктивные.СтатусАвтоработы КАК Статус,
	               |		Renault_АвтосервисЦехШтампЧасыПродуктивные.Пользователь КАК Пользователь,
	               |		Renault_АвтосервисЦехШтампЧасыПродуктивные.Комментарий КАК Комментарий
	               |	ИЗ
	               |		РегистрСведений.Renault_АвтосервисЦехШтампЧасыПродуктивные КАК Renault_АвтосервисЦехШтампЧасыПродуктивные
	               |			ЛЕВОЕ СОЕДИНЕНИЕ тИсполнители КАК т1
	               |			ПО (т1.РабочийДокумент = Renault_АвтосервисЦехШтампЧасыПродуктивные.РабочийДокумент)
	               |				И (т1.IDЭтапа = Renault_АвтосервисЦехШтампЧасыПродуктивные.IDЭтапа)
	               |				И (т1.ВремяНачало = Renault_АвтосервисЦехШтампЧасыПродуктивные.ВремяНачало)
	               |	ГДЕ
	               |		Renault_АвтосервисЦехШтампЧасыПродуктивные.РабочийДокумент = &РабочийДокумент
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		2,
	               |		""Пауза"",
	               |		Renault_АвтосервисЦехШтампЧасыПростои.РабочийДокумент,
	               |		Renault_АвтосервисЦехШтампЧасыПростои.IDЭтапа,
	               |		Renault_АвтосервисЦехШтампЧасыПростои.Цех,
	               |		Renault_АвтосервисЦехШтампЧасыПростои.Исполнитель,
	               |		Renault_АвтосервисЦехШтампЧасыПростои.Исполнитель,
	               |		Renault_АвтосервисЦехШтампЧасыПростои.Исполнитель,
	               |		1,
	               |		Renault_АвтосервисЦехШтампЧасыПростои.ВремяНачало,
	               |		Renault_АвтосервисЦехШтампЧасыПростои.ВремяОкончание,
	               |		Renault_АвтосервисЦехШтампЧасыПростои.Длительность,
	               |		Renault_АвтосервисЦехШтампЧасыПростои.ТипПростоя,
	               |		Renault_АвтосервисЦехШтампЧасыПростои.Пользователь,
	               |		Renault_АвтосервисЦехШтампЧасыПростои.Комментарий
	               |	ИЗ
	               |		РегистрСведений.Renault_АвтосервисЦехШтампЧасыПростои КАК Renault_АвтосервисЦехШтампЧасыПростои
	               |	ГДЕ
	               |		Renault_АвтосервисЦехШтампЧасыПростои.РабочийДокумент = &РабочийДокумент) КАК т1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ тОписаниеЭтапа КАК тОписаниеЭтапа
	               |		ПО (тОписаниеЭтапа.Ссылка = т1.РабочийДокумент)
	               |			И (тОписаниеЭтапа.IDЭтапа = т1.IDЭтапа)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	т1.ВремяНачало";
	Запрос.УстановитьПараметр("РабочийДокумент",ЭтотОбъект.ЗаявкаНаСервис);
	ЭтотОбъект.ИсторияЗаявки.Очистить();
	ЭтотОбъект.ИсторияЗаявки.Загрузить(Запрос.Выполнить().Выгрузить());
	н1 = 0 ;
	Для каждого с1 из ЭтотОбъект.ИсторияЗаявки Цикл
		н1 = н1 + 1;
		с1.НомерСтр = н1 ;
		с1.ИсполнительОтбор = с1.Исполнитель;
		с1.Исполнитель = с1.МинИсполнитель;
		с1.МинИсполнитель = с1.МаксИсполнитель;
		
		Если с1.КолвоИсполнителей=1 Тогда
			с1.МинИсполнитель = Справочники.Сотрудники.ПустаяСсылка();
			с1.МаксИсполнитель = Справочники.Сотрудники.ПустаяСсылка();
		ИначеЕсли с1.КолвоИсполнителей=2 Тогда
			
			с1.МаксИсполнитель = Справочники.Сотрудники.ПустаяСсылка();

		КонецЕсли;
		
		
	КонецЦикла;
	
	
КонецПроцедуры
