
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
	//Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)  	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Если Не ЭтоНовый() Тогда
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Renault_ПланПродаж.Настройка
	//	|ИЗ
	//	|	РегистрСведений.Renault_ПланПродаж КАК Renault_ПланПродаж
	//	|ГДЕ
	//	|	Renault_ПланПродаж.Настройка = &Ссылка";
	//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//	Результат = Запрос.Выполнить();
	//	Если Не Результат.Пустой() Тогда
	//		Отказ = Истина;
	//		ВызватьИсключение "По данной настройке есть введеный план. Запись не возможна";
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры  

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры
