Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения (Отказ, Режим)
	
	Если ЗначениеЗаполнено(ТрафикИД) Тогда
		ЗаписьТрафика = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ТрафикИД);
		Если НЕ ЗаписьТрафика = Неопределено Тогда
			ЗаписьТрафика.Удалить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ЗначениеЗаполнено(ТрафикИД) Тогда
		ЗаписьТрафика = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ТрафикИД);
		Если НЕ ЗаписьТрафика = Неопределено Тогда
			ЗаписьТрафика.Удалить();
		КонецЕсли;
	КонецЕсли;
	Мен = РегистрыСведений.Renault_Трафик.СоздатьМенеджерЗаписи();
	Мен.Период = Дата; 
	Мен.Идентификатор = ТрафикИД;
	Мен.ТипТрафика = ТипТрафика;
	Мен.Обработан = ТрафикОбработан;
	Мен.Отдел = Отдел;
	Мен.Менеджер = Менеджер;
	Мен.Администратор = Администратор;
	Мен.Клиент = Клиент;
	Мен.ПервичныйПовторный = ПервичныйПовторный;
	Мен.ДилерскийЦентр = ДилерскийЦентр;
	Мен.Представление = Строка(Клиент); //ИсточникИнформации; // DMSREN-276 17.09.2019
	Мен.Комментарий = Комментарий;
	Мен.ПервичныйИнтерес = ПервичныйИнтерес;
	Мен.ИсточникИнформации = ИсточникИнформации;
	
	// Заполним отдел в трафике если он не заполнен в документе
	Если НЕ ЗначениеЗаполнено(Мен.Отдел) Тогда
		
		Если ВидУслуги.Тип = Перечисления.Renault_ТипыЛидов.ПродажиАвтомобилей Тогда
			Мен.Отдел = Renault_CRM.ПолучитьОтделАвтосалона(ДилерскийЦентр);
		ИначеЕсли ВидУслуги.Тип = Перечисления.Renault_ТипыЛидов.Сервис Тогда
			Мен.Отдел = Renault_CRM.ПолучитьОтделСервиса(ДилерскийЦентр);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Мен.Отдел) Тогда
			Мен.Отдел = Renault_CRM.ПолучитьОтделАвтосалона(ДилерскийЦентр);
		КонецЕсли;
		
	КонецЕсли;
	
	Попытка
		Мен.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Функция НайтиСоздатьИИ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_ИсточникиИнформации.Ссылка
	|ИЗ
	|	Справочник.CRM_ИсточникиИнформации КАК CRM_ИсточникиИнформации
	|ГДЕ
	|	CRM_ИсточникиИнформации.КлассификацияПроизводителя = &КлассификацияПроизводителя";
	Запрос.УстановитьПараметр("КлассификацияПроизводителя", Перечисления.CRM_КлассификацияИИ.ЛМТ);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Нов = Справочники.CRM_ИсточникиИнформации.СоздатьЭлемент();
		Нов.КлассификацияПроизводителя = Перечисления.CRM_КлассификацияИИ.ЛМТ;
		Нов.Наименование = " Из системы LMT";
		Нов.Записать();
		Возврат Нов.Ссылка;
	КонецЕсли;
	
КонецФункции