// Функция получения возможных состояний заказ-нарядов
//
// Возвращаемое значение:
//   <ТаблицаЗначений>   - таблица значений состояний заказ-нарядов
//
Функция ПолучитьТаблицуВидовРемонтовЗаказНарядов() Экспорт
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ВидыРемонта.Ссылка КАК ВидРемонта,
	                    |	ВидыРемонта.Представление КАК ВидРемонтаПредставление
	                    |ИЗ
	                    |	Справочник.ВидыРемонта КАК ВидыРемонта
	                    |ГДЕ
	                    |	ВидыРемонта.ПометкаУдаления = ЛОЖЬ
						|"+?(зфЗащищенныеФункцииСервер.ПодсистемаДоступна("ЗащитаАвтосалон"),"","И ВидыРемонта.Ссылка<>ЗНАЧЕНИЕ(Справочник.ВидыРемонта.КомплектацияАвтомобиля)")+"
	                    |АВТОУПОРЯДОЧИВАНИЕ");
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ПолучитьТаблицуВидовСостоянийЗаказНарядов()

// Функция получения возможных состояний заказ-нарядов
//
// Возвращаемое значение:
//   <ТаблицаЗначений>   - таблица значений состояний заказ-нарядов
//
Функция ПолучитьТаблицуВидовСостоянийЗаказНарядов() Экспорт
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ВидыСостоянийЗаказНарядов.Ссылка КАК ВидыСостоянийЗаказНарядов,
	                    |	ВидыСостоянийЗаказНарядов.Представление КАК ВидыСостоянийЗаказНарядовПредставление
	                    |ИЗ
	                    |	Справочник.ВидыСостоянийЗаказНарядов КАК ВидыСостоянийЗаказНарядов
	                    |ГДЕ
	                    |	ВидыСостоянийЗаказНарядов.ПометкаУдаления = ЛОЖЬ
	                    |	И ВидыСостоянийЗаказНарядов.НедоступноДляВыбора = ЛОЖЬ
	                    |
	                    |УПОРЯДОЧИТЬ ПО
	                    |	ВидыСостоянийЗаказНарядов.Порядок");
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ПолучитьТаблицуВидовСостоянийЗаказНарядов()

// функция парсинга строки с доп. кодами
Функция РабобратьСтрокуДопКодов(стрДопКодов) Экспорт
	ВремТЗ = Новый ТаблицаЗначений();
	ВремТЗ.Колонки.Добавить("ДопКод");
	Стр = СтрЗаменить(стрДопКодов, ";", ",");
	Стр = СтрЗаменить(Стр, " ", "");
	ПозицияРазделителя = Найти(Стр,",");
	
	Пока ПозицияРазделителя <> 0 Цикл
		НоваяСтрока= ВремТЗ.Добавить();
		НоваяСтрока.ДопКод = Лев(Стр,ПозицияРазделителя - 1);
		Стр = Сред(Стр,ПозицияРазделителя+1);
		ПозицияРазделителя = Найти(Стр,",");
	КонецЦикла;
	
	НоваяСтрока= ВремТЗ.Добавить();
	НоваяСтрока.ДопКод = Стр;
	
	
	Возврат ВремТЗ;
КонецФункции

// Процедура открытия калькуляции Audatex
Процедура ОткрытьКалькуляцию(ЭтаФорма, Ссылка, ОткрытиеИзДокумента = Ложь, ДокументОбъект = Неопределено) Экспорт
	// поищем связанные дела
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбменСAudaPadWebСрезПоследних.Автор,
	|	ОбменСAudaPadWebСрезПоследних.ЗаказНаряд,
	|	ОбменСAudaPadWebСрезПоследних.ИдентификаторДела,
	|	ОбменСAudaPadWebСрезПоследних.ИдентификаторЗадания,
	|	ОбменСAudaPadWebСрезПоследних.Период
	|ИЗ
	|	РегистрСведений.ОбменСAudaPadWeb.СрезПоследних(, ЗаказНаряд = &ЗаказНаряд) КАК ОбменСAudaPadWebСрезПоследних";
	Запрос.УстановитьПараметр("ЗаказНаряд", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ФормаДиалога = РегистрыСведений.ОбменСAudaPadWeb.ПолучитьФорму("ФормаПользовательскогоСценария",ЭтаФорма);
		ФормаДиалога.РегистрСведенийМенеджерЗаписи.ЗаказНаряд = Ссылка;
		Если ОткрытиеИзДокумента Тогда
			ФормаДиалога.ДокументОбъект = ДокументОбъект;
			ФормаДиалога.ОткытиеИзДокумента	= Истина;
		КонецЕсли;
		ФормаДиалога.Открыть();
	Иначе
		ТекСтрока = Запрос.Выполнить().Выгрузить()[0];
		МенеджерРегистра	= РегистрыСведений.ОбменСAudaPadWeb.СоздатьМенеджерЗаписи();
		МенеджерРегистра.Период					= ТекСтрока.Период;
		МенеджерРегистра.Автор 					= ТекСтрока.Автор;
		МенеджерРегистра.ЗаказНаряд				= ТекСтрока.ЗаказНаряд;			
		МенеджерРегистра.ИдентификаторДела		= ТекСтрока.ИдентификаторДела;
		МенеджерРегистра.Идентификаторзадания	= ТекСтрока.Идентификаторзадания;
		МенеджерРегистра.Прочитать();
		
		ФормаОбмена	= МенеджерРегистра.ПолучитьФорму("ФормаПользовательскогоСценария", ЭтаФорма);
		ФормаОбмена.РегистрСведенийМенеджерЗаписи	= МенеджерРегистра;
		ФормаОбмена.Открыть();

	КонецЕсли;
КонецПроцедуры