
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.РекламнаяКампания) Тогда
		НаименованиеРекламнойКампании = Объект.РекламнаяКампания.Наименование;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеРекламнойКампанииНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.РекламнаяКампания) Тогда
		
		ПараметрыФормы = Новый Структура("Ключ",Объект.РекламнаяКампания);
		
		ОткрытьФорму("Документ.DMS_РекламнаяКампания.Форма.ФормаДокумента",ПараметрыФормы,ЭтаФорма);
		
	КонецЕсли; 
	
КонецПроцедуры
 
&НаКлиенте
Процедура НаименованиеРекламнойКампанииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФорму("Документ.DMS_РекламнаяКампания.ФормаВыбора",,Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеРекламнойКампанииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.DMS_РекламнаяКампания") 
		И ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		НаименованиеРекламнойКампании = ПолучитьРеквизитСсылки(ВыбранноеЗначение,"Наименование");
		Объект.РекламнаяКампания = ВыбранноеЗначение;
		ЗаполнитьНаОснованииРекламнойКампании();
	Иначе 
	
		Объект.Модели.Очистить();
		
		НаименованиеРекламнойКампании = "";
		Объект.РекламнаяКампания = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитСсылки(Ссылка,ИмяРеквизита)

	Возврат Ссылка[ИмяРеквизита];

КонецФункции // ПолучитьРеквизитСсылки()

&НаКлиенте
Процедура НаименованиеРекламнойКампанииОчистка(Элемент, СтандартнаяОбработка)
	
	Объект.Модели.Очистить();
	
	Объект.РекламнаяКампания = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеРекламнойКампанииОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.РекламнаяКампания) Тогда
		
		ПараметрыФормы = Новый Структура("Ключ",Объект.РекламнаяКампания);
		
		ОткрытьФорму("Документ.DMS_РекламнаяКампания.Форма.ФормаДокумента",ПараметрыФормы,ЭтаФорма);
		
	Иначе 
		ОткрытьФорму("Документ.DMS_РекламнаяКампания.ФормаВыбора",,Элемент);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаОснованииРекламнойКампании()
	
	Объект.Модели.Очистить();
	
	мОбъект = РеквизитФормыВЗначение("Объект");
	
	мОбъект.Заполнить(Объект.РекламнаяКампания);
	
	ЗначениеВРеквизитФормы(мОбъект,"Объект");	
	
КонецПроцедуры // ЗаполнитьНаОснованииРекламнойКампании()

&НаСервере
Функция ОтправитьНаСогласованиеНаСервере(Ссылка)
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Предмет", Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
		|	СогласованиеОтчетов.Ссылка КАК Ссылка
		|ИЗ
		|	БизнесПроцесс.DMS_СогласованиеОтчетовПоРекламнойКампании КАК СогласованиеОтчетов
		|ГДЕ
		|	СогласованиеОтчетов.Предмет = &Предмет
		|	И НЕ СогласованиеОтчетов.ПометкаУдаления
		|	И НЕ СогласованиеОтчетов.Стартован
		|	И НЕ СогласованиеОтчетов.Завершен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли; 
	
	БизнесПроцесс = БизнесПроцессы.DMS_СогласованиеОтчетовПоРекламнойКампании.СоздатьБизнесПроцесс();
	БизнесПроцесс.Заполнить(Ссылка);
	
	БизнесПроцессСсылка = БизнесПроцессы.DMS_СогласованиеОтчетовПоРекламнойКампании.ПолучитьСсылку();
	БизнесПроцесс.УстановитьСсылкуНового(БизнесПроцессСсылка);
	БизнесПроцесс.ОбменДанными.Загрузка = Истина;
	БизнесПроцесс.Записать();
	
	Возврат БизнесПроцессСсылка;
	
КонецФункции

&НаКлиенте
Процедура ОтправитьНаСогласование(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Предупреждение("Сначала необходимо записать отчет",15,"Внимание");
		Возврат;
	КонецЕсли; 
	
	СсылкаБизнесПроцесс = ОтправитьНаСогласованиеНаСервере(Объект.Ссылка);
	
	ПараметрыФормы = Новый Структура("Ключ",СсылкаБизнесПроцесс);	
	ОткрытьФорму("БизнесПроцесс.DMS_СогласованиеОтчетовПоРекламнойКампании.Форма.ФормаБизнесПроцесса",ПараметрыФормы,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура МоделиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура МоделиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

