
Процедура СоздатьЗадачуRenault(Параметры) Экспорт
	
	Задача = Документы.Renault_Задачи.СоздатьДокумент();
	Задача.Автор = Параметры.Автор;
	Задача.Дата = ТекущаяДата();
	Задача.ВидЗадачи = Параметры.ВидЗадачи;
	Задача.ДокументОснование = Параметры.ДокументОснование;
	
	Если Параметры.Приоритет = Неопределено Тогда
		Приоритет = Перечисления.DMS_ВариантыВажностиЗадачи.Обычная;
	КонецЕсли;
	
	Задача.Комментарий  = Параметры.Комментарий;
	Задача.Приоритет 	= Параметры.Приоритет;
	Задача.Содержание   = Параметры.Содержание;
	Если НЕ ЗначениеЗаполнено(Параметры.Исполнители) Тогда
		Возврат;
	ИначеЕсли ТипЗнч(Параметры.Исполнители) = Тип("СправочникСсылка.Пользователи") Тогда
		НовыйИсполнитель = Задача.Пользователи.Добавить();
		НовыйИсполнитель.Пользователь      = Параметры.Исполнители;
		НовыйИсполнитель.ДатаНачалаПлан    = Параметры.ДатаНачала;
		НовыйИсполнитель.ДатаОкончанияПлан = Параметры.ДатаОкончания;
		НовыйИсполнитель.СостояниеЗадачи   = Перечисления.СостоянияСобытий.Запланировано;
		СтрПояснение = "";
		Если Параметры.Свойство("Пояснение", СтрПояснение) Тогда
			НовыйИсполнитель.Пояснение = СтрПояснение;
		Иначе
			НовыйИсполнитель.Пояснение = Параметры.ВидЗадачи.Наименование;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Параметры.Исполнители) = Тип("СправочникСсылка.Сотрудники") Тогда
		НовыйИсполнитель = Задача.Пользователи.Добавить();
		НовыйИсполнитель.Пользователь      = Renault_CRM.ПолучитьПользователяПоСотруднику(Параметры.Исполнители);
		НовыйИсполнитель.ДатаНачалаПлан    = Параметры.ДатаНачала;
		НовыйИсполнитель.ДатаОкончанияПлан = Параметры.ДатаОкончания;
		НовыйИсполнитель.СостояниеЗадачи   = Перечисления.СостоянияСобытий.Запланировано;
		СтрПояснение = "";
		Если Параметры.Свойство("Пояснение", СтрПояснение) Тогда
			НовыйИсполнитель.Пояснение = СтрПояснение;
		Иначе
			НовыйИсполнитель.Пояснение = Параметры.ВидЗадачи.Наименование;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Параметры.Исполнители) = Тип("Массив") Тогда 
		Для Каждого Исполнитель из Параметры.Исполнители Цикл
			НовыйИсполнитель = Задача.Пользователи.Добавить();
			НовыйИсполнитель.Пользователь      = Исполнитель.Пользователь;
			НовыйИсполнитель.ДатаНачалаПлан    = Параметры.ДатаНачала;
			НовыйИсполнитель.ДатаОкончанияПлан = Параметры.ДатаОкончания;
			НовыйИсполнитель.СостояниеЗадачи   = Перечисления.СостоянияСобытий.Запланировано;
			НовыйИсполнитель.Пояснение         = Параметры.ВидЗадачи.Наименование;
		КонецЦикла;
	Иначе
		Возврат;
	КонецЕсли;
	
	Задача.Записать();
	
КонецПроцедуры

//подписка на событие Renault_ЗадачиОФУ. Запись заявок на кредит и на страховку 
Процедура Renault_ЗадачиОФУПриЗаписи(Источник, Отказ) Экспорт
     	
	Если Источник.ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	Задачи.Renault_События.ВыполнитьЗадачу(Источник.Задача, ПараметрыСеанса.Пользователь);
	
КонецПроцедуры

//подписка на событие Renault_ЗадачиКСО. Запись заявок на кредит и на страховку 
Процедура Renault_ЗадачиКСОПриЗаписи(Источник, Отказ) Экспорт
	
	Задачи.Renault_События.ВыполнитьЗадачу(Источник.Задача, ПараметрыСеанса.Пользователь);
	
КонецПроцедуры
