
//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
// Функция возвращает адрес хранилища внешней панели
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	Строка	- Адрес хранилища внешней панели
//
Функция ВернутьХранилищеВнешнейПанели()
	Макет = ПолучитьОбщийМакет("сфпУстановщикВнешнейПанелиСофтФон");
	Адрес = ПоместитьВоВременноеХранилище(Макет);
	Возврат Адрес;
КонецФункции // ВернутьХранилищеВнешнейПанели()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ФОРМЫ

&НаКлиенте
// Процедура - обработчик события "Нажатие" элемента формы "ДекорацияПодробнаяИнформация"
//
Процедура ДекорацияПодробнаяИнформация(Элемент)
	ЗапуститьПриложение("http://rarus.ru/1c-crm/1c-rarus-softfon-prof-redaktsiya-2/");
КонецПроцедуры // ДекорацияПодробнаяИнформация()

&НаКлиенте
// Процедура - обработчик события "Нажатие" элемента формы "ДекорацияАдресCRM"
//
Процедура ДекорацияАдресCRM(Элемент)
	ЗапуститьПриложение("mailto:crm@rarus.ru");
КонецПроцедуры // ДекорацияАдресCRM()

&НаКлиенте
// Процедура - обработчик события "Нажатие" элемента формы "ДекорацияАдресРарус"
//
Процедура ДекорацияАдресРарус(Элемент)
	ЗапуститьПриложение("http://rarus.ru");
КонецПроцедуры // ДекорацияАдресРарус()

&НаКлиенте
// Процедура - обработчик события "Нажатие" элемента формы "ДекорацияПодробнаяИнформацияСМС"
//
Процедура ДекорацияПодробнаяИнформацияСМС(Элемент)
	ЗапуститьПриложение("http://rarus.ru/1c-crm/sms-kom-1/");
КонецПроцедуры // ДекорацияПодробнаяИнформацияСМС()

&НаКлиенте
// Процедура - обработчик события "Нажатие" элемента формы "ДекорацияНастройкаПодключенияСофтФон"
//
Процедура ДекорацияНастройкаПодключенияСофтФон(Элемент)
	ФормаНастроек = ПолучитьФорму("ОбщаяФорма.сфпФормаНастроек");
	Если ФормаНастроек.Открыта() Тогда
		ФормаНастроек.Активировать();
	Иначе
		ФормаНастроек.Открыть();
	КонецЕсли;	
КонецПроцедуры // ДекорацияНастройкаПодключенияСофтФон()

&НаКлиенте
// Процедура - обработчик события "Нажатие" элемента формы "ДекорацияНастройкаПодключенияСМС"
//
Процедура ДекорацияНастройкаПодключенияСМС(Элемент)
	ФормаНастроек = ПолучитьФорму("ОбщаяФорма.смсФормаНастроек");
	Если ФормаНастроек.Открыта() Тогда
		ФормаНастроек.Активировать();
	Иначе
		ФормаНастроек.Открыть();
	КонецЕсли;	
КонецПроцедуры // ДекорацияНастройкаПодключенияСМС()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД ФОРМЫ

&НаКлиенте
// Процедура - обработчик команды формы "ПовторитьПодключение"
//
Процедура ПовторитьПодключение(Команда)
	Если сфпСофтФонПроСервер.сфпИспользоватьСофтФон() Тогда
		Если сфпСофтФонПроСервер.сфпПолучитьЗначениеПоУмолчаниюПользователя("ИспользоватьСофтФон") Тогда
		#Если Вебклиент Тогда
		Состояние(Нстр("ru = 'Работа СофтФона невозможна в web-клиенте!'"));
		#Иначе
		РезультатПодключения = Ложь;
		Попытка	
			сфпФормаТелефонВнешняяПанель = ПолучитьФорму("Обработка.сфпСофтФонВнешняяПанель.Форма.Форма");
			РезультатПодключения = сфпФормаТелефонВнешняяПанель.Подключиться();
		Исключение	
		КонецПопытки;
		Если РезультатПодключения Тогда
			Состояние = Нстр("ru = 'Успешно подключились к внешней панели СофтФон'");
			Закрыть();
			ОписаниеОшибки = "";
		Иначе		
			ОписаниеОшибки = Нстр("ru = 'Не удалось подключиться к внешней панели СофтФон'");
		КонецЕсли;
		#КонецЕсли
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры // ПовторитьПодключение()

&НаКлиенте
// Процедура - обработчик команды формы "УстановитьВнешнююПанель"
//
Процедура УстановитьВнешнююПанель(Команда)
	#Если Вебклиент Тогда
	Предупреждение(Нстр("ru = 'Работа СофтФона возможна только в тонком клиенте 1С'"), 60);
	#Иначе
	Попытка 
		Состояние(Нстр("ru = 'Установка внешней панели СофтФон'"));
		АдресХранилища = ВернутьХранилищеВнешнейПанели();
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);
		ВременныйФайл = ПолучитьИмяВременногоФайла("exe"); 
		ДвоичныеДанные.Записать(ВременныйФайл);
		КодВозврата = Неопределено;
		ЗапуститьПриложение(ВременныйФайл, , Истина, КодВозврата);
		Если НЕ (КодВозврата = Неопределено) Тогда
			ОписаниеОшибки = "";
			ПовторитьПодключение(Неопределено);
		КонецЕсли;	
	Исключение
		ОписаниеОшибки = Нстр("ru = 'Не удалось запустить установку панели СофтФон'");
	КонецПопытки;
	#КонецЕсли
КонецПроцедуры // УстановитьВнешнююПанель()

&НаКлиенте
// Процедура - обработчик команды формы "УстановитьВнешнююПанельИзИнтернета"
//
Процедура УстановитьВнешнююПанельИзИнтернета(Команда)
	#Если Вебклиент Тогда
	Предупреждение(Нстр("ru = 'Работа СофтФона возможна только в тонком клиенте 1С'"),60);
	#Иначе
	ЗапуститьПриложение("http://rarus.ru/1c-crm/1c-rarus-softfon-prof-redaktsiya-2/");
	#КонецЕсли
КонецПроцедуры // УстановитьВнешнююПанельИзИнтернета()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("ВидФормы") Тогда
		Отказ = Истина;
	ИначеЕсли Параметры.ВидФормы = "СофтФон" Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСофтФон;
		Элементы.ДекорацияНастройкаПодключенияСофтФон.Гиперссылка = ПравоДоступа("Администрирование", Метаданные);
		Если Параметры.Свойство("ТекстОшибки") Тогда
			ОписаниеОшибки = Параметры.ТекстОшибки;
		КонецЕсли;
	ИначеЕсли Параметры.ВидФормы = "СМС" Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСМС;
		Элементы.ДекорацияНастройкаПодключенияСМС.Гиперссылка = ПравоДоступа("Администрирование", Метаданные);
	Иначе
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
// Процедура - обработчик события формы "ПриОткрытии"
//
Процедура ПриОткрытии(Отказ)
	Если НЕ (сфпФормаТелефонВнешняяПанель = Неопределено) И сфпФормаТелефонВнешняяПанель.Открыта() Тогда
		сфпФормаТелефонВнешняяПанель.Закрыть();
	КонецЕсли;	
	сфпФормаТелефонВнешняяПанель = Неопределено;
	ПанельСофтФон = Неопределено;
КонецПроцедуры // ПриОткрытии()
