////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// Флаг того, что нужно обновить кэш следующих статусов, так как произошли
// изменения в цепочке статусов
Перем НужноОбновитьКэш;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
	//Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ)
	
	НужноОбновитьКэш = Ложь;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Нельзя менять предыдущий статус предопределенного статуса
	Если Предопределенный И ПредыдущийСтатус <> Ссылка.ПредыдущийСтатус Тогда
		Renault_AdvancedКлиент.СообщитьОбОшибке("Нельзя менять предыдущий статус предопределенного статуса." , Отказ);
		Возврат;
	КонецЕсли;
	
	// Проверим, нужно ли обновить кэш
	Если НЕ Отказ Тогда
		Если ПредыдущийСтатус <> Ссылка.ПредыдущийСтатус Тогда
			НужноОбновитьКэш = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// Проверки ниже необходимы только для не предопределенных статусов
	Если Предопределенный Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПредыдущийСтатус) Тогда
		Возврат;
	КонецЕсли;
	
	// Статус не может ссылаться сам на себя
	Если ПредыдущийСтатус = Ссылка Тогда
		Renault_AdvancedКлиент.СообщитьОбОшибке("Необходимо выбрать статус отличный от текущего, статус не может ссылаться сам на себя." , Отказ);
		Возврат;
	КонецЕсли;
	
	// Проверим, чтобы выбранный предыдущий статус уже не является предыдущим для другого статуса
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтатусыЗапчастей.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Renault_Advanced_СтатусыЗапчастей КАК СтатусыЗапчастей
	|ГДЕ
	|	СтатусыЗапчастей.ПредыдущийСтатус = &ПредыдущийСтатус
	|	И СтатусыЗапчастей.Ссылка <> &Ссылка";
	
	Если ПредыдущийСтатус.Предопределенный Тогда
		Запрос.Текст = Запрос.Текст + " И СтатусыЗапчастей.Предопределенный = &Предопределенный";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПредыдущийСтатус", ПредыдущийСтатус);
	Запрос.УстановитьПараметр("Предопределенный", Предопределенный);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	          
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Renault_AdvancedКлиент.СообщитьОбОшибке("Выбранный предыдущий статус уже используется для статуса """ + Выборка.Ссылка + """.", Отказ);
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события "ПриЗаписи".
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НужноОбновитьКэш Тогда
		Renault_ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("СледующиеСтатусыЗапчастей",, Новый Соответствие);
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()