
Функция ПолучитьПоследнийНомер(ВидДог, Дата, ПродолжатьНумерациюВСледующемГоду = Истина, НачальныйНомер = 1) Экспорт
	
	//Получим последний номер этого года
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.ВидДоговора.Установить(ВидДог);
	Набор.Отбор.Период.Установить(НачалоГода(Дата));
	Набор.Прочитать();
	Ответ = -1;
	
	// Если в этом году еще не было договоров
	Если Набор.Количество() = 0 Тогда
		Если ПродолжатьНумерациюВСледующемГоду Тогда
			Набор2 = СоздатьНаборЗаписей();
			Набор2.Отбор.ВидДоговора.Установить(ВидДог);
			Набор2.Отбор.Период.Установить(ДобавитьМесяц(НачалоГода(Дата), -12));
			Набор2.Прочитать();
			Если Набор2.Количество() = 0 Тогда
				Ответ = НачальныйНомер;
			Иначе
				Ответ = Набор2[0].ПоследнийНомер + 1;
			КонецЕсли;
		Иначе
			Ответ = НачальныйНомер;
		КонецЕсли;
		НовыйНомер = Набор.Добавить();
	// иначе увеличиваем на единицу
	Иначе
		НовыйНомер = Набор[0];
		Ответ = Набор[0].ПоследнийНомер + 1;
	КонецЕсли;
	НовыйНомер.ПоследнийНомер = Ответ;
	НовыйНомер.ВидДоговора = ВидДог;
	НовыйНомер.Период = НачалоГода(Дата);
	Набор.Записать(Истина);
	
	Возврат Ответ;
	
КонецФункции
