
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мОбъект = РеквизитФормыВЗначение("Объект");
	
	мЦвет = мОбъект.ЦветФона.Получить();
	
	Если мЦвет <> Неопределено Тогда
		ЦветФона = мЦвет;
	Иначе 
		ЦветФона = ЦветаСтиля.ЦветРамки;
	КонецЕсли; 
	
	мЦветТекста = мОбъект.ЦветТекста.Получить();
	
	Если мЦветТекста <> Неопределено Тогда
		ЦветТекста = мЦветТекста;
	Иначе 
		ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
	КонецЕсли; 
	
	мШрифт = мОбъект.ШрифтТекста.Получить();
	
	Если мШрифт <> Неопределено Тогда
		Шрифт = мШрифт;
	Иначе 
		Шрифт = ШрифтыСтиля.ОбычныйШрифтТекста;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ЦветФона    = Новый ХранилищеЗначения(ЦветФона,Новый СжатиеДанных(9));
	ТекущийОбъект.ЦветТекста  = Новый ХранилищеЗначения(ЦветТекста,Новый СжатиеДанных(9));
	ТекущийОбъект.ШрифтТекста = Новый ХранилищеЗначения(Шрифт,Новый СжатиеДанных(9));
	
КонецПроцедуры
