Процедура ЗаписатьПараметры(СтруктураПараметров) Экспорт	
	МЗ = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ,СтруктураПараметров);
	МЗ.Прочитать(); //Всегда считываем
КонецПроцедуры

Функция ПолучитьСемействоАвтомобиля(Автомобиль) Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Renault_АвтомобилиДопРеквизиты.СемействоАвтомобиля КАК СемействоАвтомобиля
	|ИЗ
	|	РегистрСведений.Renault_АвтомобилиДопРеквизиты КАК Renault_АвтомобилиДопРеквизиты
	|ГДЕ
	|	Renault_АвтомобилиДопРеквизиты.Автомобиль = &Автомобиль"
	);
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.СемействоАвтомобиля;
	Иначе
		Результат = Справочники.Renault_СемействаАвтомобилей.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКритерииПоАвтомобилю(Автомобиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_АвтомобилиДопРеквизиты.Автомобиль,
	               |	Renault_АвтомобилиДопРеквизиты.СемействоАвтомобиля,
	               |	Renault_АвтомобилиДопРеквизиты.СалонныйФильтр,
	               |	Renault_АвтомобилиДопРеквизиты.ГУР,
	               |	Renault_АвтомобилиДопРеквизиты.AC,
	               |	Renault_АвтомобилиДопРеквизиты.АвтоПринятоНаСклад,
	               |	Renault_АвтомобилиДопРеквизиты.ЗамечаниеПриемки,
	               |	Renault_АвтомобилиДопРеквизиты.ДатаПриемкиНаСклад,
	               |	Renault_АвтомобилиДопРеквизиты.КодМоделиДвигателя,
	               |	Renault_АвтомобилиДопРеквизиты.ИндексМоделиДвигателя,
	               |	Renault_АвтомобилиДопРеквизиты.КодМоделиКПП,
	               |	Renault_АвтомобилиДопРеквизиты.ИндексМоделиКПП,
	               |	Renault_АвтомобилиДопРеквизиты.КодТипаКузова,
	               |	Renault_АвтомобилиДопРеквизиты.Фаза,
	               |	Renault_АвтомобилиДопРеквизиты.ABS,
	               |	Renault_АвтомобилиДопРеквизиты.Продавец,
	               |	Renault_АвтомобилиДопРеквизиты.ТипДвигателя,
	               |	Renault_АвтомобилиДопРеквизиты.ТипТоплива,
				   |	Renault_АвтомобилиДопРеквизиты.ТипПривода,
				   |	Renault_АвтомобилиДопРеквизиты.РегионЭксплуатации,   
				   |	Renault_АвтомобилиДопРеквизиты.ДатаНачалаОСАГО,
				   |	Renault_АвтомобилиДопРеквизиты.ДатаОкончанияОСАГО,
				   |	Renault_АвтомобилиДопРеквизиты.ДатаНачалаКАСКО,
				   |	Renault_АвтомобилиДопРеквизиты.ДатаОкончанияКАСКО
	               |ИЗ
	               |	РегистрСведений.Renault_АвтомобилиДопРеквизиты КАК Renault_АвтомобилиДопРеквизиты
	               |ГДЕ
	               |	Renault_АвтомобилиДопРеквизиты.Автомобиль = &Автомобиль";
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
				   
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

