&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Заголовок=Параметры.Заголовок;
	
	Если Параметры.Свойство("КомпоновщикНастроек") Тогда
		КомпоновщикНастроек=Параметры.КомпоновщикНастроек;
	ИначеЕсли Параметры.Свойство("ИсточникДоступныхНастроек") Тогда
		КомпоновщикНастроек.Инициализировать(Параметры.ИсточникДоступныхНастроек);	
	Иначе
		Сообщить("Не инициализирован компоновщик настроек",СтатусСообщения.Внимание);
	КонецЕсли;	
	
	Элементы.грФиксированныеНастройкиОтбор.Видимость=Параметры.Свойство("ФиксированныеНастройкиОтбор");
	Элементы.грНастройкиОтбор.Видимость=Параметры.Свойство("НастройкиОтбор");
	
	Если Параметры.Свойство("Настройки") Тогда КомпоновщикНастроек.ЗагрузитьНастройки(Параметры.Настройки) КонецЕсли;
	Если Параметры.Свойство("ПользовательскиеНастройки") Тогда КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(Параметры.ПользовательскиеНастройки) КонецЕсли;
	Если Параметры.Свойство("ФиксированныеНастройки") Тогда КомпоновщикНастроек.ЗагрузитьФиксированныеНастройки(Параметры.ФиксированныеНастройки) КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура кнОК(Команда) Закрыть(КомпоновщикНастроек) КонецПроцедуры

&НаКлиенте
Процедура кнОтмена(Команда) Закрыть() КонецПроцедуры

