Функция РНБанк() Экспорт
	Спр=Справочники.Банки.НайтиПоКоду("044525147");
	Если Спр.Пустая() Тогда
		Спр=Справочники.Банки.СоздатьЭлемент();
		Спр.Наименование="АО ""РН БАНК""";
		Спр.Код="044525147";
		Спр.Город="Г. МОСКВА";
		Спр.КоррСчет="30101810545250000147";
		Спр.Записать();
		Возврат Спр.Ссылка
	Иначе Возврат Спр КонецЕсли
КонецФункции	

Функция ОптимальноеКредитноеПредложение(Банк="",Автомобиль,Комплектация="",ЭтоПовторныйКлиентБанка=Ложь,ПрограммаCRM=Ложь, ДляНовогоАвтомобиля=Истина, ГодВыпуска="") Экспорт

	Если Банк<>"" И Банк<>РНБанк() Тогда
		Сообщить("Выбор оптимального предложения пока возможен только для банка "+РНБанк(),СтатусСообщения.Информация);
		Возврат Неопределено
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Автомобиль) тогда
		Возврат Справочники.Renault_КредитныеПредложения.ПустаяСсылка();
	КонецЕСли;	
	
	//++ DMSREN-118
	
	//Отформатируем ГодВыпуска
	Если ТипЗнч(ГодВыпуска) = Тип("Дата") Тогда
		ГодВыпуска = Формат(Год(ГодВыпуска), "ЧГ=0")
	ИначеЕсли ТипЗнч(ГодВыпуска) = Тип("Строка") Тогда
		ГодВыпуска = СтрЗаменить(ГодВыпуска, " ", "")
	ИначеЕсли ТипЗнч(ГодВыпуска) = Тип("Число") Тогда
		ГодВыпуска = Формат(ГодВыпуска, "ЧГ=0")
	Иначе
		ГодВыпуска = ""
	КонецЕсли; 
	
	Если ГодВыпуска = "" И ТипЗнч(Автомобиль) = Тип("СправочникСсылка.Автомобили") Тогда
		Если ЗначениеЗаполнено(Автомобиль.ГодВыпуска) Тогда
			ГодВыпуска = Формат(Год(Автомобиль.ГодВыпуска), "ЧГ=0")
		Иначе
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	CRM_СостояниеАвтомобилейПроизводителя_v2.DATE_RECU
			|ИЗ
			|	РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
			|ГДЕ
			|	CRM_СостояниеАвтомобилейПроизводителя_v2.Автомобиль = &Автомобиль";
			Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
			РезультатЗапроса = Запрос.Выполнить().Выбрать();
			Если РезультатЗапроса.Следующий() И ЗначениеЗаполнено(РезультатЗапроса.DATE_RECU) Тогда
				ГодВыпуска = ?(РезультатЗапроса.Следующий(), Формат(Год(РезультатЗапроса.DATE_RECU), "ЧГ=0"), "")
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ГодВыпуска = "" Тогда
		Сообщить("Не найден год выпуска автомобиля!");
		Возврат Справочники.Renault_КредитныеПредложения.ПустаяСсылка()
	КонецЕсли;
	
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("РНБанк",РНБанк());
	Запрос.УстановитьПараметр("Модель",Автомобиль.Модель);
	Запрос.УстановитьПараметр("Комплектация",Комплектация);
	//Запрос.УстановитьПараметр("ЭтоПовторныйКлиентБанка",ЭтоПовторныйКлиентБанка);
	//Запрос.УстановитьПараметр("ПрограммаCRM",ПрограммаCRM);
	Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
	Запрос.УстановитьПараметр("ДляНовогоАвтомобиля", ДляНовогоАвтомобиля);
	Запрос.УстановитьПараметр("ГодыВыпуска", "%" + ГодВыпуска + "%");
	Запрос.УстановитьПараметр("ДляПовторногоКлиента", ЭтоПовторныйКлиентБанка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_КредитныеПредложения.Ссылка КАК Ссылка,
	|	Renault_КредитныеПредложения.СрокПоУмолчанию,
	|	Renault_КредитныеПредложения.ПервоначальныйВзносПоУмолчанию
	|ПОМЕСТИТЬ ПредложенияПоУсловиям
	|ИЗ
	|	Справочник.Renault_КредитныеПредложения.ДоступныеВариантыКомплектации КАК Renault_КредитныеПредложенияДоступныеВариантыКомплектации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_КредитныеПредложения КАК Renault_КредитныеПредложения
	|		ПО Renault_КредитныеПредложенияДоступныеВариантыКомплектации.Ссылка = Renault_КредитныеПредложения.Ссылка
	|ГДЕ
	|	Renault_КредитныеПредложения.Владелец = &РНБанк
	|	"+?(Комплектация=""," И ВариантКомплектации.Владелец=&Модель"," И ВариантКомплектации=&Комплектация")+"
	//|	И Renault_КредитныеПредложенияДоступныеВариантыКомплектации.ВариантКомплектации = &ВариантКомплектации
	|	И Renault_КредитныеПредложения.ДляНовогоАвтомобиля = &ДляНовогоАвтомобиля
	|	И &ТекДата МЕЖДУ Renault_КредитныеПредложения.Ссылка.ДатаНачалаПредложения И Renault_КредитныеПредложения.Ссылка.ДатаОкончанияПредложения
	|	И Renault_КредитныеПредложения.ГодыВыпуска ПОДОБНО &ГодыВыпуска
	|	И Renault_КредитныеПредложения.ДляПовторногоКлиента = &ДляПовторногоКлиента
	|	И НЕ Renault_КредитныеПредложения.Наименование ПОДОБНО ""%ДФО%""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_КредитныеПредложения.Ссылка КАК Ссылка,
	|	Renault_КредитныеПредложенияКредитныеСтавки.МаркетинговаяСтавка КАК МаркетинговаяСтавка,
	|	Renault_КредитныеПредложения.СрокПоУмолчанию,
	|	Renault_КредитныеПредложенияКредитныеСтавки.СрокКредитаОт,
	|	Renault_КредитныеПредложенияКредитныеСтавки.СрокКредитаДо,
	|	Renault_КредитныеПредложения.ПервоначальныйВзносПоУмолчанию,
	|	Renault_КредитныеПредложенияКредитныеСтавки.ПервоначальныйВзносОт,
	|	Renault_КредитныеПредложенияКредитныеСтавки.ПервоначальныйВзносДо
	|ПОМЕСТИТЬ ПредложенияПоПараметрамПоУмолчанию
	|ИЗ
	|	ПредложенияПоУсловиям КАК Renault_КредитныеПредложения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Renault_КредитныеПредложения.КредитныеСтавки КАК Renault_КредитныеПредложенияКредитныеСтавки
	|		ПО (Renault_КредитныеПредложения.СрокПоУмолчанию МЕЖДУ Renault_КредитныеПредложенияКредитныеСтавки.СрокКредитаОт И Renault_КредитныеПредложенияКредитныеСтавки.СрокКредитаДо)
	|			И (Renault_КредитныеПредложения.ПервоначальныйВзносПоУмолчанию МЕЖДУ Renault_КредитныеПредложенияКредитныеСтавки.ПервоначальныйВзносОт И Renault_КредитныеПредложенияКредитныеСтавки.ПервоначальныйВзносДо)
	|			И Renault_КредитныеПредложения.Ссылка = Renault_КредитныеПредложенияКредитныеСтавки.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПредложенияПоПараметрамПоУмолчанию.Ссылка,
	|	ПредложенияПоПараметрамПоУмолчанию.МаркетинговаяСтавка КАК МаркетинговаяСтавка,
	|	ПредложенияПоПараметрамПоУмолчанию.СрокПоУмолчанию,
	|	ПредложенияПоПараметрамПоУмолчанию.СрокКредитаОт,
	|	ПредложенияПоПараметрамПоУмолчанию.СрокКредитаДо,
	|	ПредложенияПоПараметрамПоУмолчанию.ПервоначальныйВзносПоУмолчанию,
	|	ПредложенияПоПараметрамПоУмолчанию.ПервоначальныйВзносОт,
	|	ПредложенияПоПараметрамПоУмолчанию.ПервоначальныйВзносДо
	|ИЗ
	|	ПредложенияПоПараметрамПоУмолчанию КАК ПредложенияПоПараметрамПоУмолчанию
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПредложенияПоУсловиям КАК ПредложенияПоУсловиям
	|		ПО ПредложенияПоПараметрамПоУмолчанию.Ссылка = ПредложенияПоУсловиям.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	МаркетинговаяСтавка";
	 
	//Запрос.Текст="
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ	Ссылка
	//|ПОМЕСТИТЬ Предложения
	//|ИЗ Справочник.Renault_КредитныеПредложения.ДоступныеВариантыКомплектации
	//|ГДЕ
	//|	Ссылка.Владелец=&РНБанк
	//|	"+?(Комплектация=""," И ВариантКомплектации.Владелец=&Модель"," И ВариантКомплектации=&Комплектация")+"
	//|	И Ссылка.ДляПовторногоКлиента=&ЭтоПовторныйКлиентБанка
	//|	И Ссылка.ПрограммаCRM=&ПрограммаCRM
	//|	И &ТекДата Между Ссылка.ДатаНачалаПредложения И Ссылка.ДатаОкончанияПредложения
	//|;
	//|
	//|ВЫБРАТЬ ПЕРВЫЕ 1
	//|	КредитныеСтавки.МаркетинговаяСтавка
	//|ПОМЕСТИТЬ Ставка
	//|ИЗ Справочник.Renault_КредитныеПредложения.КредитныеСтавки КредитныеСтавки
	//|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Предложения Предложения ПО Предложения.Ссылка=КредитныеСтавки.Ссылка
	//|УПОРЯДОЧИТЬ ПО КредитныеСтавки.МаркетинговаяСтавка ВОЗР
	//|;
	//|
	//|ВЫБРАТЬ ПЕРВЫЕ 1
	//|	КредитныеСтавки.ПервоначальныйВзносОт
	//|ПОМЕСТИТЬ Взнос
	//|ИЗ Справочник.Renault_КредитныеПредложения.КредитныеСтавки КредитныеСтавки
	//|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Предложения Предложения ПО Предложения.Ссылка=КредитныеСтавки.Ссылка
	//|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Ставка Ставка ПО Ставка.МаркетинговаяСтавка=КредитныеСтавки.МаркетинговаяСтавка
	//|УПОРЯДОЧИТЬ ПО КредитныеСтавки.ПервоначальныйВзносОт ВОЗР
	//|;
	//|	
	//|ВЫБРАТЬ ПЕРВЫЕ 1
	//|	КредитныеСтавки.СрокКредитаДо,
	//|	КредитныеСтавки.СрокКредитаОт
	//|ПОМЕСТИТЬ Срок
	//|ИЗ Справочник.Renault_КредитныеПредложения.КредитныеСтавки КредитныеСтавки
	//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Предложения Предложения ПО Предложения.Ссылка=КредитныеСтавки.Ссылка
	//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Ставка Ставка ПО Ставка.МаркетинговаяСтавка=КредитныеСтавки.МаркетинговаяСтавка
	//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Взнос Взнос ПО Взнос.ПервоначальныйВзносОт=КредитныеСтавки.ПервоначальныйВзносОт
	//|УПОРЯДОЧИТЬ ПО КредитныеСтавки.СрокКредитаДо УБЫВ
	//|;
	//|
	//|ВЫБРАТЬ Первые 1 КредитныеСтавки.Ссылка
	//|ИЗ Справочник.Renault_КредитныеПредложения.КредитныеСтавки КредитныеСтавки
	//|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Предложения Предложения ПО Предложения.Ссылка=КредитныеСтавки.Ссылка
	//|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Ставка Ставка ПО Ставка.МаркетинговаяСтавка=КредитныеСтавки.МаркетинговаяСтавка
	//|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Взнос Взнос ПО Взнос.ПервоначальныйВзносОт=КредитныеСтавки.ПервоначальныйВзносОт
	//|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Срок Срок ПО Срок.СрокКредитаДо=КредитныеСтавки.СрокКредитаДо
	//|";
	
	Выборка=Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Справочники.Renault_КредитныеПредложения.ПустаяСсылка())
	
КонецФункции

