
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Дата1") Тогда Дата1=Параметры.Дата1 КонецЕсли;
	Если Параметры.Свойство("Дата2") Тогда Дата2=Параметры.Дата2 КонецЕсли;
	Год=Год(ТекущаяДата());
	Месяц=НачалоМесяца(ТекущаяДата());
	Квартал=НачалоКвартала(ТекущаяДата());
	День=ТекущаяДата();
	
	НачальноеЗначениеИнтервала();
	НачальноеЗначениеПериода();
	ОбновитьПериод();
	Элементы.грИнтервалы.Видимость=Истина;
	Элементы.грПериоды.Видимость=Ложь;
	
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ) Интерфейс() КонецПроцедуры
&НаКлиенте
Процедура Интерфейс()
	МассивАкт=Новый Массив;
	МассивПас=Новый Массив;
	Если Элементы.грИнтервалы.Видимость Тогда
		МассивАкт.Добавить(Элементы.кнИнтервалы);
		МассивПас.Добавить(Элементы.кнПериоды);
	ИначеЕсли Элементы.грПериоды.Видимость Тогда
		МассивПас.Добавить(Элементы.кнИнтервалы);
		МассивАкт.Добавить(Элементы.кнПериоды);
	КонецЕсли;	
	МассивАкт.Добавить(Элементы.кнОК);
	МассивПас.Добавить(Элементы.кнОтмена);
	
	Renault_ОбщиеФункции.МультибрендЗадатьОформление(МассивАкт,"ЦветФона","ОсновнойЦвет");
	Renault_ОбщиеФункции.МультибрендЗадатьОформление(МассивАкт,"ЦветРамки","ОсновнойЦвет");
	Renault_ОбщиеФункции.МультибрендЗадатьОформление(МассивПас,"ЦветФона","ДопЦвет1");
	Renault_ОбщиеФункции.МультибрендЗадатьОформление(МассивПас,"ЦветРамки","ДопЦвет1");

КонецПроцедуры	

&НаКлиенте
Процедура ВыбратьРежим(Команда)
	Если ТекущийЭлемент.Имя="кнИнтервалы" Тогда
		Элементы.грИнтервалы.Видимость=Истина;
		Элементы.грПериоды.Видимость=Ложь;
	ИначеЕсли ТекущийЭлемент.Имя="кнПериоды" Тогда
		Элементы.грИнтервалы.Видимость=Ложь;
		Элементы.грПериоды.Видимость=Истина;
	КонецЕсли;	
	Интерфейс();	
КонецПроцедуры

Процедура НачальноеЗначениеИнтервала()
	ПроизвольныйИнтервал1=Ложь;
	ПроизвольныйИнтервал2=Ложь;
	
	Если Дата1='00010101' Тогда ИнтервалДата1=0
	ИначеЕсли Дата1=НачалоГода(ТекущаяДата()) Тогда ИнтервалДата1=1
	ИначеЕсли Дата1=НачалоКвартала(ТекущаяДата()) Тогда ИнтервалДата1=2
	ИначеЕсли Дата1=НачалоМесяца(ТекущаяДата()) Тогда ИнтервалДата1=3
	ИначеЕсли Дата1=НачалоНедели(ТекущаяДата()) Тогда ИнтервалДата1=4
	ИначеЕсли Дата1=НачалоДня(ТекущаяДата()) Тогда ИнтервалДата1=5
	Иначе
		ИнтервалДата1=100;
		ПроизвольныйИнтервал1=Истина;
	КонецЕсли;

	Если Дата2='00010101' Тогда ИнтервалДата2=0
	ИначеЕсли Дата2=НачалоДня(КонецГода(ТекущаяДата())) Тогда ИнтервалДата2=1
	ИначеЕсли Дата2=НачалоДня(КонецКвартала(ТекущаяДата())) Тогда ИнтервалДата2=2
	ИначеЕсли Дата2=НачалоДня(КонецМесяца(ТекущаяДата())) Тогда ИнтервалДата2=3
	ИначеЕсли Дата2=НачалоДня(КонецНедели(ТекущаяДата())) Тогда ИнтервалДата2=4
	ИначеЕсли Дата2=НачалоДня(КонецДня(ТекущаяДата())) Тогда ИнтервалДата2=5
	Иначе
		ИнтервалДата2=100;
		ПроизвольныйИнтервал2=Истина;
	КонецЕсли;
	
	ДоступностьЭлементов();	
КонецПроцедуры	
Процедура НачальноеЗначениеПериода()
	ПроизвольныйИнтервал=Ложь;
	
	Если Дата1=НачалоГода(Дата1) И Дата2=НачалоДня(КонецГода(Дата2)) И Год(Дата1)=Год(Дата2) Тогда Период=0
	ИначеЕсли Дата1=НачалоКвартала(Дата1) И Дата2=НачалоДня(КонецКвартала(Дата2)) И НачалоКвартала(Дата1)=НачалоДня(НачалоКвартала(Дата2)) Тогда Период=1
	ИначеЕсли Дата1=НачалоМесяца(Дата1) И Дата2=НачалоДня(КонецМесяца(Дата2)) И НачалоМесяца(Дата1)=НачалоДня(НачалоМесяца(Дата2)) Тогда Период=2
	//ИначеЕсли Дата1=НачалоДня(Дата1) И Дата2=КонецДня(Дата2) И НачалоДня(Дата1)=НачалоДня(Дата2) Тогда Период=3
	ИначеЕсли Дата1=Дата2 и Дата1<>'00010101' Тогда Период=3
	Иначе
		Период=100;
		ПроизвольныйИнтервал=Истина;
	КонецЕсли;
	
	ДоступностьЭлементов();	
КонецПроцедуры
Процедура ДоступностьЭлементов()
	
	Элементы.ИнтервалДата1.Доступность=НЕ ПроизвольныйИнтервал1;
	Элементы.ИнтервалДата2.Доступность=НЕ ПроизвольныйИнтервал2;
	Элементы.Дата1.Доступность=ПроизвольныйИнтервал1;
	Элементы.Дата2.Доступность=ПроизвольныйИнтервал2;
	
	Элементы.Период.Доступность=НЕ ПроизвольныйИнтервал;
	Элементы.Дата3.Доступность=ПроизвольныйИнтервал;
	Элементы.Дата4.Доступность=ПроизвольныйИнтервал;
	
	Если Период=0 Тогда
		Элементы.Год.Доступность=Истина;
		Элементы.Квартал.Доступность=Ложь;
		Элементы.Месяц.Доступность=Ложь;
		Элементы.День.Доступность=Ложь;
		Элементы.сНачалаГода.Доступность=Ложь;
		Элементы.сНачалаКвартала.Доступность=Ложь;
		Элементы.сНачалаМесяца.Доступность=Ложь;
		Элементы.Дата3.Доступность=Ложь;
		Элементы.Дата4.Доступность=Ложь;
	ИначеЕсли Период=1 Тогда
		Элементы.Год.Доступность=Ложь;
		Элементы.Квартал.Доступность=Истина;
		Элементы.Месяц.Доступность=Ложь;
		Элементы.День.Доступность=Ложь;
		Элементы.сНачалаГода.Доступность=Истина;
		Элементы.сНачалаКвартала.Доступность=Ложь;
		Элементы.сНачалаМесяца.Доступность=Ложь;
		Элементы.Дата3.Доступность=Ложь;
		Элементы.Дата4.Доступность=Ложь;
	ИначеЕсли Период=2 Тогда
		Элементы.Год.Доступность=Ложь;
		Элементы.Квартал.Доступность=Ложь;
		Элементы.Месяц.Доступность=Истина;
		Элементы.День.Доступность=Ложь;
		Элементы.сНачалаГода.Доступность=Истина;
		Элементы.сНачалаКвартала.Доступность=Истина;
		Элементы.сНачалаМесяца.Доступность=Ложь;
		Элементы.Дата3.Доступность=Ложь;
		Элементы.Дата4.Доступность=Ложь;
	ИначеЕсли Период=3 Тогда
		Элементы.Год.Доступность=Ложь;
		Элементы.Квартал.Доступность=Ложь;
		Элементы.Месяц.Доступность=Ложь;
		Элементы.День.Доступность=Истина;
		Элементы.сНачалаГода.Доступность=Истина;
		Элементы.сНачалаКвартала.Доступность=Истина;
		Элементы.сНачалаМесяца.Доступность=Истина;
		Элементы.Дата3.Доступность=Ложь;
		Элементы.Дата4.Доступность=Ложь;
	Иначе
		Элементы.Год.Доступность=Ложь;
		Элементы.Квартал.Доступность=Ложь;
		Элементы.Месяц.Доступность=Ложь;
		Элементы.День.Доступность=Ложь;
		Элементы.сНачалаГода.Доступность=Ложь;
		Элементы.сНачалаКвартала.Доступность=Ложь;
		Элементы.сНачалаМесяца.Доступность=Ложь;
		Элементы.Дата3.Доступность=Истина;
		Элементы.Дата4.Доступность=Истина;
	КонецЕсли;
	
	Элементы.сНачалаГода.Доступность=(Квартал>'00010101'); 
	Элементы.сНачалаКвартала.Доступность=(Месяц>'00010101'); 
	Элементы.сНачалаМесяца.Доступность=(День>'00010101');	
	
КонецПроцедуры

//Процедура ОбновитьПериод() ПериодТекст="Установлен период "+Формат(Дата1,"ДФ=dd.MM.yyyy")+" - "+Формат(Дата2,"ДФ=dd.MM.yyyy") КонецПроцедуры
Процедура ОбновитьПериод() Заголовок="Установлен период "+Формат(Дата1,"ДФ=dd.MM.yyyy")+" - "+Формат(Дата2,"ДФ=dd.MM.yyyy") КонецПроцедуры

&НаКлиенте
Процедура кнОК(Команда) Закрыть(Новый Структура("Дата1,Дата2",Дата1,КонецДня(Дата2))) КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииИнтервала(Элемент)
	
	Если Элемент.Имя="ПроизвольныйИнтервал1" Тогда ИнтервалДата1=100
	ИначеЕсли Элемент.Имя="ПроизвольныйИнтервал2" Тогда ИнтервалДата2=100
	ИначеЕсли Элемент.Имя="ИнтервалДата1" Тогда
		Если ИнтервалДата1=0 Тогда Дата1='00010101'
		ИначеЕсли ИнтервалДата1=1 Тогда Дата1=НачалоГода(ТекущаяДата())
		ИначеЕсли ИнтервалДата1=2 Тогда Дата1=НачалоКвартала(ТекущаяДата())
		ИначеЕсли ИнтервалДата1=3 Тогда	Дата1=НачалоМесяца(ТекущаяДата())
		ИначеЕсли ИнтервалДата1=4 Тогда Дата1=НачалоНедели(ТекущаяДата())
		ИначеЕсли ИнтервалДата1=5 Тогда Дата1=НачалоДня(ТекущаяДата())
		КонецЕсли;
	ИначеЕсли Элемент.Имя="ИнтервалДата2" Тогда
		Если ИнтервалДата2=0 Тогда Дата2='00010101'
		ИначеЕсли ИнтервалДата2=1 Тогда Дата2=КонецГода(ТекущаяДата())
		ИначеЕсли ИнтервалДата2=2 Тогда Дата2=КонецКвартала(ТекущаяДата())
		ИначеЕсли ИнтервалДата2=3 Тогда	Дата2=КонецМесяца(ТекущаяДата())
		ИначеЕсли ИнтервалДата2=4 Тогда Дата2=КонецНедели(ТекущаяДата())
		ИначеЕсли ИнтервалДата2=5 Тогда Дата2=КонецДня(ТекущаяДата())
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьПериод();
	НачальноеЗначениеПериода();
	
КонецПроцедуры
&НаКлиенте
Процедура ПриИзмененииПериода(Элемент)

	Если Элемент.Имя="ПроизвольныйИнтервал" Тогда 
		Период=100;
		Если ПроизвольныйИнтервал Тогда
			ИнтервалДата1=100;
			ИнтервалДата2=100;
			ПроизвольныйИнтервал1=Истина;
			ПроизвольныйИнтервал2=Истина;
		Иначе
			ПроизвольныйИнтервал1=Ложь;
			ПроизвольныйИнтервал2=Ложь;
		КонецЕсли;	
	Иначе
		Если Период=0 Тогда ГодПриИзменении(Элемент)
		ИначеЕсли Период=1 Тогда КварталПриИзменении(Элемент)
		ИначеЕсли Период=2 Тогда МесяцПриИзменении(Элемент)
		ИначеЕсли Период=3 Тогда ДеньПриИзменении(Элемент)
		КонецЕсли;	
	КонецЕсли;
	
	ОбновитьПериод();
	НачальноеЗначениеИнтервала();
	
КонецПроцедуры

//год
&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	ТекДата=Дата(Формат(Год,"ЧЦ=4; ЧВН=; ЧГ=0")+"0101000000");
	Дата1=НачалоГода(ТекДата);
	Дата2=КонецГода(ТекДата);
	НачальноеЗначениеИнтервала();
	ОбновитьПериод();
КонецПроцедуры
&НаКлиенте
Процедура ГодРегулирование(Элемент, Направление, СтандартнаяОбработка) ГодПриИзменении(Элемент) КонецПроцедуры

//квартал
&НаКлиенте
Процедура КварталПриИзменении(Элемент)
	Дата1=НачалоКвартала(Квартал);
	Дата2=КонецКвартала(Квартал);
	НачальноеЗначениеИнтервала();
	ОбновитьПериод();
КонецПроцедуры
&НаКлиенте
Процедура КварталРегулирование(Элемент, Направление, СтандартнаяОбработка) 
	СтандартнаяОбработка=Ложь;
	Квартал=НачалоКвартала( ?(Направление>0, КонецКвартала(Квартал)+1, НачалоКвартала(Квартал)-1 ) ); 
	КварталПриИзменении(Элемент);
КонецПроцедуры

//месяц
&НаКлиенте
Процедура МесяцПриИзменении(Элемент) 
	Дата1=НачалоМесяца(Месяц); 
	Дата2=КонецМесяца(Месяц); 
	НачальноеЗначениеИнтервала();
	ОбновитьПериод();
КонецПроцедуры
&НаКлиенте
Процедура МесяцРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Месяц=НачалоМесяца( ?(Направление>0, ДобавитьМесяц(Месяц,1) ,  ДобавитьМесяц(Месяц,-1) )	);
	МесяцПриИзменении(Элемент);
КонецПроцедуры

//день
&НаКлиенте
Процедура ДеньПриИзменении(Элемент) 
	Дата1=НачалоДня(День); 
	Дата2=КонецДня(День); 
	НачальноеЗначениеИнтервала();
	ОбновитьПериод();
КонецПроцедуры
&НаКлиенте
Процедура ДеньРегулирование(Элемент, Направление, СтандартнаяОбработка) 
	СтандартнаяОбработка=Ложь;
	День=НачалоДня( ?(Направление>0, КонецДня(День)+1 , НачалоДня(День)-1 ) );
	ДеньПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалСНачалаГодаПриИзменении(Элемент) Дата1=НачалоГода(Дата1); НачальноеЗначениеИнтервала(); ОбновитьПериод() КонецПроцедуры
&НаКлиенте
Процедура ИнтервалСНачалаКварталаПриИзменении(Элемент) Дата1=НачалоКвартала(Дата1); НачальноеЗначениеИнтервала(); ОбновитьПериод() КонецПроцедуры
&НаКлиенте
Процедура ИнтервалСНачалаМесяцаПриИзменении(Элемент) Дата1=НачалоМесяца(Дата1); НачальноеЗначениеИнтервала(); ОбновитьПериод() КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент) Если Элемент.Имя="Дата3" Или Элемент.Имя="Дата4" Тогда НачальноеЗначениеИнтервала() Иначе НачальноеЗначениеПериода() КонецЕсли; ОбновитьПериод(); КонецПроцедуры
&НаКлиенте
Процедура ДатаРегулирование(Элемент, Направление, СтандартнаяОбработка) ДатаПриИзменении(Элемент) КонецПроцедуры


