
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	запрос = Новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	DMS_ШаблоныSMS.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.DMS_ШаблоныSMS КАК DMS_ШаблоныSMS
	               |ГДЕ
	               |	DMS_ШаблоныSMS.Источник = ""РЛ""
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	DMS_ШаблоныSMS.Наименование";
	выборка = запрос.Выполнить().Выбрать();
	СписокШаблонов = Новый СписокЗначений;
	Пока выборка.Следующий() цикл
		Элементы.Шаблон.СписокВыбора.Добавить(выборка.Ссылка);	
	КонецЦикла;
	
	//Элементы.Шаблон.СписокВыбора = СписокШаблонов;
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПриИзменении(Элемент)
	
	Текст = Шаблон.ШаблонСообщения;
	Текст = СтрЗаменить(Текст,"[Клиент]", Контрагент);
	Текст = СтрЗаменить(Текст, "[Телефон]", НомерТелефона);
	
	Текст = СтрЗаменить(Текст, "[Email]", Email);
	Текст = СтрЗаменить(Текст, "[Менеджер]", Менеджер);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормы(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Функция ОтправитьНаСервере()
	
	Получатели = Новый Массив;
	Получатели.Добавить(НомерТелефона);
	
	Возврат DMS_ОтправкаSMS.ОтправитьSMS(Получатели, Текст);
	
КонецФункции

&НаКлиенте
Процедура Отправить(Команда)
	
	Закрыть(ОтправитьНаСервере());
	
КонецПроцедуры

