Процедура УстановитьПараметры()
	
	ПараметрДатаОкончания = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаОкончания");
	
	Если Не ПараметрДатаОкончания = Неопределено Тогда
		ПараметрДатаОкончания.Значение = НачалоДня(НачалоДня(ТекущаяДата())-1);
	КонецЕсли;
	
	ПараметрДатаНачала = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНачала");
	
	Если Не ПараметрДатаНачала = Неопределено Тогда
		ПараметрДатаНачала.Значение = НачалоДня(Дата(2017,1,1,0,0,0));
	КонецЕсли;
 	
	//ПараметрДатаОкончания = Новый ПараметрКомпоновкиДанных("ДатаОкончания");
	//ДатаОкончания         = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрДатаОкончания).Значение;
 	//КурсВалюты = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаОкончания, Новый Структура("Валюта",ВалютаОтчета));
	//КурсВалютыОтчета = КурсВалюты.Курс / ?(КурсВалюты.Кратность = 0,1,КурсВалюты.Кратность);
	//КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КурсВалютыОтчета", КурсВалютыОтчета);
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) Экспорт
	
	УстановитьПараметры();
	
	ОтчетыСервер.ВывестиОтчет(ЭтотОбъект, СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры
