
Функция NDBPartsGet(NDBPartsGetRequest)
	// Вставить содержимое обработчика.
	NDBPartsGetType = ФабрикаXDTO.Тип("http://wa.dms.webservice/NDBPartsGetRequest", "NDBPartsGetResponse");
	NDBPartsGet = ФабрикаXDTO.Создать(NDBPartsGetType);   
	
    ТаблицаОщибок = Новый ТаблицаЗначений;
    ТаблицаОщибок.Колонки.Добавить("Код",	 Новый ОписаниеТипов("Строка"));
    ТаблицаОщибок.Колонки.Добавить("ТекстОшибки",		 Новый ОписаниеТипов("Строка"));  
	
	Попытка
    	КодДилера = NDBPartsGetRequest.NDBPartsGet.DealerID;
    Исключение
    	КодДилера = "";
    КонецПопытки;       
    Попытка
    	ТипЗапроса = NDBPartsGetRequest.NDBPartsGet.RequestType;
    Исключение
    	НоваяСтрока = ТаблицаОщибок.Добавить();
		НоваяСтрока.Код = "WA03";
		НоваяСтрока.ТекстОшибки = "Не задан тип запроса RequestType";
		NDBPartsGet = обПолучитьВозвратWAError("http://wa.dms.webservice/NDBPartsGetRequest",NDBPartsGetRequest,NDBPartsGet,"-1",ТаблицаОщибок);
		Возврат NDBPartsGet;    
    КонецПопытки;  

	Попытка
    	ДатаЗапросаС = NDBPartsGetRequest.NDBPartsGet.RequestDateTimeFromLocal;
    Исключение
    	ДатаЗапросаС = Дата('00010101');
	КонецПопытки;    
	
	Попытка
    	ДатаЗапросаПо = NDBPartsGetRequest.NDBPartsGet.RequestDateTimeToLocal;
    Исключение
    	ДатаЗапросаПо = Дата('00010101');
    КонецПопытки;       

	ArrayNDBPartsType = ФабрикаXDTO.Тип("http://wa.dms.webservice/NDBPartsGetRequest", "ArrayOfNDBPart");
   	ArrayNDBParts = ФабрикаXDTO.Создать(ArrayNDBPartsType); 
	
    Если ТипЗапроса="1" Тогда
		СписокТиповСклада = Новый Массив();
		СписокТиповСклада.Добавить(Перечисления.ТипыСкладов.ЗапЧасти);
		СписокТиповСклада.Добавить(Перечисления.ТипыСкладов.Витрина);
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПартииТоваровКомпанииОстатки.Номенклатура,
		               |	ЦеныСрезПоследних.Цена,
		               |	ПартииТоваровКомпанииОстатки.КоличествоОстаток,
		               |	ПартииТоваровКомпанииОстатки.СуммаОстаток,
		               |	ВЫБОР
		               |		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
		               |			ТОГДА ""2""
		               |		ИНАЧЕ ""3""
		               |	КОНЕЦ КАК ТипВхДокумента,
		               |	ВЫБОР
		               |		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
		               |			ТОГДА ПартииТоваровКомпанииОстатки.Партия.ВхДокНомер
		               |		ИНАЧЕ """"
		               |	КОНЕЦ КАК НомерВхДокумента
		               |ИЗ
		               |	РегистрНакопления.ПартииТоваровКомпании.Остатки(
		               |			&ДатаВыборки,
		               |			Номенклатура.Производитель В ИЕРАРХИИ (&Производитель)
		               |				И СкладКомпании.ТипСклада В (&СписокТиповСклада)
		               |				И СкладКомпании.Подразделение.ДилерИД = &КодДилера) КАК ПартииТоваровКомпанииОстатки
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(
		               |				&ДатаВыборки,
		               |				ТипЦен = &ТипЦен
		               |					И ПодразделениеКомпании.ДилерИД = &КодДилера) КАК ЦеныСрезПоследних
		               |		ПО ПартииТоваровКомпанииОстатки.Номенклатура = ЦеныСрезПоследних.Номенклатура
		               |ГДЕ
		               |	ПартииТоваровКомпанииОстатки.КоличествоОстаток > 0";
					   
		Запрос.УстановитьПараметр("Производитель", Справочники.Производители.Hyundai);
		Запрос.УстановитьПараметр("ТипЦен", Справочники.ТипыЦен.ОсновнойТипЦенПродажи);
		Запрос.УстановитьПараметр("КодДилера", КодДилера);
		Запрос.УстановитьПараметр("СписокТиповСклада", СписокТиповСклада);
		Запрос.УстановитьПараметр("ДатаВыборки", КонецДня(ДатаЗапросаПо));

	    Выборка = Запрос.Выполнить().Выбрать();
		
	    Если Выборка.Количество() = 0 Тогда                         		
			NDBPartsGet = обПолучитьВозвратWAError("http://wa.dms.webservice/NDBPartsGetRequest", NDBPartsGetRequest, NDBPartsGet, "0", ТаблицаОщибок);
			Возврат NDBPartsGet;  		
		Иначе
			Пока Выборка.Следующий() Цикл
				Если ЗначениеЗаполнено(Выборка.Цена) Тогда
					Цена = Выборка.Цена;			
				Иначе
					Цена = 0;			
				КонецЕсли;  			
			    NDBPartType = ФабрикаXDTO.Тип("http://wa.dms.webservice/NDBPartsGetRequest", "NDBPart");
	   			NDBPart = ФабрикаXDTO.Создать(NDBPartType);
				NDBPart.Date = ДатаЗапросаПо;
				NDBPart.DealerID = КодДилера;
				Если КодДилера = "RC536" Тогда
					NDBPart.DealerName = "Avtokom Shakhty";
				ИначеЕсли КодДилера = "RC294" Тогда
					NDBPart.DealerName = "Avtokom-Don";
				Иначе
					NDBPart.DealerName = "";
				КонецЕсли;					
				NDBPart.PartNumber = Выборка.Номенклатура.Артикул;
				NDBPart.PartDescription = Выборка.Номенклатура.Наименование;
				NDBPart.QuantityOnHand = Формат(Выборка.КоличествоОстаток, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
				NDBPart.PurchasePrice = Формат(Выборка.СуммаОстаток / Выборка.КоличествоОстаток, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
				NDBPart.UnitPrice = Формат(Цена, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
				NDBPart.PartType = "1";
	            NDBPart.DocumentType = Выборка.ТипВхДокумента;
				NDBPart.DocumentNo = Выборка.НомерВхДокумента;
	            ArrayNDBParts.NDBPart.Добавить(NDBPart);      			
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ТипЗапроса="2" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Продажи.Номенклатура,
		               |	Продажи.Количество,
		               |	Продажи.Сумма,
		               |	Продажи.Себестоимость,
		               |	Продажи.Период КАК Дата,
		               |	Продажи.Регистратор.Номер КАК Номер,
		               |	ВЫБОР
		               |		КОГДА Продажи.Партия ССЫЛКА Документ.ПоступлениеТоваров
		               |			ТОГДА Продажи.Партия.ВхДокНомер
		               |		ИНАЧЕ Продажи.Партия.Номер
		               |	КОНЕЦ КАК НомерВхДокумента
		               |ИЗ
		               |	РегистрНакопления.Продажи КАК Продажи
		               |ГДЕ
		               |	Продажи.Номенклатура.Производитель В ИЕРАРХИИ(&Производитель)
		               |	И Продажи.ХозОперация = &ХозОпреация
		               |	И Продажи.ПодразделениеКомпании.ДилерИД = &КодДилера
		               |	И НЕ Продажи.Покупатель.НашаФирма
		               |	И Продажи.Период МЕЖДУ &ДатаНачала И &ДатаОкончания";
					   
		Запрос.УстановитьПараметр("Производитель", Справочники.Производители.Hyundai);
		Запрос.УстановитьПараметр("ХозОпреация", Справочники.ХозОперации.РеализацияТоваров);
		Запрос.УстановитьПараметр("КодДилера", КодДилера);
		Запрос.Параметры.Вставить("ДатаНачала", НачалоДня(ДатаЗапросаС));
		Запрос.Параметры.Вставить("ДатаОкончания", КонецДня(ДатаЗапросаПо));
		
	    Выборка = Запрос.Выполнить().Выбрать();
		
	    Если Выборка.Количество() = 0 Тогда                         		
			NDBPartsGet = обПолучитьВозвратWAError("http://wa.dms.webservice/NDBPartsGetRequest", NDBPartsGetRequest, NDBPartsGet, "0", ТаблицаОщибок);
			Возврат NDBPartsGet;  		
		Иначе
			Пока Выборка.Следующий() Цикл	
			    NDBPartType = ФабрикаXDTO.Тип("http://wa.dms.webservice/NDBPartsGetRequest", "NDBPart");
	   			NDBPart = ФабрикаXDTO.Создать(NDBPartType);
				NDBPart.Date = Выборка.Дата;
				NDBPart.DealerID = КодДилера;
				Если КодДилера = "RC536" Тогда
					NDBPart.DealerName = "Avtokom Shakhty";
				ИначеЕсли КодДилера = "RC294" Тогда
					NDBPart.DealerName = "Avtokom-Don";
				Иначе
					NDBPart.DealerName = "";
				КонецЕсли;					
				NDBPart.PartNumber = Выборка.Номенклатура.Артикул;
				NDBPart.PartDescription = Выборка.Номенклатура.Наименование;
				NDBPart.QuantityOnHand = Формат(Выборка.Количество, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
				NDBPart.PurchasePrice = Формат(Выборка.Себестоимость / Выборка.Количество, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
				NDBPart.UnitPrice = Формат(Выборка.Сумма / Выборка.Количество, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
				NDBPart.PartType = "1";
	            NDBPart.DocumentType = "1";
				NDBPart.DocumentNo = Выборка.НомерВхДокумента;
	            ArrayNDBParts.NDBPart.Добавить(NDBPart);      			
			КонецЦикла;
		КонецЕсли;
		
	Иначе		
    	НоваяСтрока = ТаблицаОщибок.Добавить();
		НоваяСтрока.Код = "WA03";
		НоваяСтрока.ТекстОшибки = "Неверный тип запроса RequestType";
		NDBPartsGet = обПолучитьВозвратWAError("http://wa.dms.webservice/NDBPartsGetRequest",NDBPartsGetRequest,NDBPartsGet,"-1",ТаблицаОщибок);
		Возврат NDBPartsGet;    
	КонецЕсли;

	NDBPartsGet.NDBParts = ArrayNDBParts;
	NDBPartsGet = обПолучитьВозвратWAError("http://wa.dms.webservice/NDBPartsGetRequest", NDBPartsGetRequest, NDBPartsGet, "1", ТаблицаОщибок);
	Возврат NDBPartsGet;      
КонецФункции
