 //Модуль документа ПоступлениеТоваров
 
 ////////////////////////////////////////////////////////////////////////////////
 // ПЕРЕМЕННЫЕ ОБЪЕКТА
 
 Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
 Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
 Перем ИмяРеквизитаКода Экспорт;     // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/артикула в ТЧ
 Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования
 
 ////////////////////////////////////////////////////////////////////////////////
 // ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА
 
 // Возвращает соответствие в котором перечислены виды номенклатуры, которые нельзя вводить
 // в таблицу товаров. Если таких нет, то возвращает неопределено
 //
 // Возвращаемое значение:
 //  Результат - соответствие.
 //
 Функция ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры() Экспорт
	 Результат=Неопределено;
	 Если ХозОперация=Справочники.ХозОперации.ПоступлениеТоваровКомиссия Тогда
		 Результат=Новый Соответствие();
		 Результат.Вставить(Перечисления.ВидыНоменклатуры.Услуга,0);
	 КонецЕсли;
	 
	 Возврат Результат;
 КонецФункции // ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры()
 
 // Возвращает структуру обязательных / уникальных реквизитов документа
 // Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
 // Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
 Функция ПолучитьОбязательныеРеквизиты() Экспорт
	 // Обязательные поля таблицы товаров
	 ОбязательныеТовары=Новый Структура();
	 ОбязательныеТовары.Вставить("Номенклатура",3);
	 ОбязательныеТовары.Вставить("Характеристика",3);
	 ОбязательныеТовары.Вставить("Количество",1);
	 ОбязательныеТовары.Вставить("ЕдиницаИзмерения",3);
	 ОбязательныеТовары.Вставить("Коэффициент",1);
	 ОбязательныеТовары.Вставить("Цена",1);
	 ОбязательныеТовары.Вставить("Сумма",1);
 	ОбязательныеТовары.Вставить("СуммаВсего",1);
 
	 
	 // Обязательные реквизиты документа
	 ОбязательныеРеквизиты=Новый Структура();
	 ОбязательныеРеквизиты.Вставить("Организация",1);
	 ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	 ОбязательныеРеквизиты.Вставить("Автор",1);
	 ОбязательныеРеквизиты.Вставить("ВалютаДокумента",1);
	 ОбязательныеРеквизиты.Вставить("КурсДокумента",1);
 	 //ОбязательныеРеквизиты.Вставить("Контрагент",1);
	 ОбязательныеРеквизиты.Вставить("ТипЦен",1);
	 ОбязательныеРеквизиты.Вставить("ХозОперация",1);
	 //ОбязательныеРеквизиты.Вставить("ДоговорВзаиморасчетов",1);
	 ОбязательныеРеквизиты.Вставить("ДилерскийЦентр",1);
	 ОбязательныеРеквизиты.Вставить("Товары",ОбязательныеТовары);
	 
	 //Гэндальф+++
	 //ОбязательныеРеквизиты.Вставить("ВхДокНомер",1);
	 //ОбязательныеРеквизиты.Вставить("ВхДокДата",1);
	 //Гэндальф---
	 Возврат ОбязательныеРеквизиты;
 КонецФункции // ПолучитьОбязательныеРеквизиты()
 
 // Проверяет корректность заполнения объекта.
 // может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
 // (могут быть и другие необязательные)
 // Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
 //
 // Параметры:
 //  Ошибки       - строка, в случае некорректного заполнения содержит описанием возникших ошибок, 
 //  ДопРеквизиты - структура, на вход может быть передана структура с дополнительными реквизитами для проверки,
 //  Заполнение   - булево, флаг проверки, 
 //  Уникальность - булево, флаг проверки.
 //
 // Возвращаемое значение:
 //  Булево - Возвращает Истина если все заполнено корректно и Ложь иначе.
 // 
 Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	 // Здесь могут быть определены дополнительные к стандартным обязательным реквизитам условия проверки
	 //Гэндальф+++
	 //БЫЛО
	 //Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность, Истина);
	 //СТАЛО
	 Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Ложь, Истина);
	 //Гэндальф--
	 
	 // Проведем проверку соответствия организации документа организациям некоторых реквизитов документа.
	 // Такую проверку необходимо осуществлять, если баланс в системе ведется по организации,
	 // или если установлен способ контроля корректности
	 // договора и склада документа. Причем, если способ контроля выбран "Контроль по организации и подразделению", то
	 // дополнительно осуществляется проверка соответствия подразделений.
	 Если Результат Тогда
		 СпособКонтроляКорректности = обПраво("КонтрольКорректностиДоговораИСкладаДокумента", Права,,ЭтотОбъект);	
		 КонтрольОтсутствует        = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольОтсутствует);
		 БалансВедетсяПоОрганизации = (Константы.СпособВеденияБаланса.Получить()=Перечисления.СпособВеденияБаланса.ПоОрганизации);
		 
		 Если БалансВедетсяПоОрганизации ИЛИ НЕ КонтрольОтсутствует Тогда
			 КонтрольПоПодразделению = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольПоОрганизацииИПодразделению);
			 
			 КонтролируемыеРеквизиты = Новый Структура();
			 
			 КонтролируемыеРеквизитыШапки = Новый Структура();
			 //Гэндальф+++
			 //КонтролируемыеРеквизитыШапки.Вставить("СкладКомпании",         КонтрольПоПодразделению);
			 Если ХозОперация <> Справочники.ХозОперации.УслугиСтороннихОрганизаций и ХозОперация <> Справочники.ХозОперации.УслугиПоСубподряду тогда
				 КонтролируемыеРеквизитыШапки.Вставить("СкладКомпании",         КонтрольПоПодразделению);
			 КонецЕсли;	
			 //Гэндальф---
			 КонтролируемыеРеквизитыШапки.Вставить("ДоговорВзаиморасчетов", КонтрольПоПодразделению);
			 КонтролируемыеРеквизиты.Вставить("КонтролируемыеРеквизитыШапки",КонтролируемыеРеквизитыШапки);		
			 
			 Результат = дкПроверитьКорректностьПоОрганизации(ЭтотОбъект,КонтролируемыеРеквизиты,Ошибки) И Результат;
		 КонецЕсли;  		
	 КонецЕсли;
	 
	 Если ХозОперация = Справочники.ХозОперации.УслугиСтороннихОрганизаций ИЛИ 
		 ХозОперация = Справочники.ХозОперации.УслугиПоСубподряду Тогда
		 Запрос = Новый Запрос;
		 Запрос.УстановитьПараметр("Услуга", Перечисления.ВидыНоменклатуры.Услуга);
		 Запрос.УстановитьПараметр("НаДиР", Перечисления.СпособыРаспределенияДопРасходов.НаДоходыИРасходы);
		 Запрос.УстановитьПараметр("СписокНоменклатуры", Товары.ВыгрузитьКолонку("Номенклатура"));
		 Запрос.Текст = "ВЫБРАТЬ
		 |	Номенклатура.Ссылка
		 |ИЗ
		 |	Справочник.Номенклатура КАК Номенклатура
		 |ГДЕ
		 |	(Номенклатура.ВидНоменклатуры <> &Услуга
		 |	ИЛИ Номенклатура.СпособРаспределенияДопРасходов <> &НаДиР)
		 |	И Номенклатура.Ссылка В (&СписокНоменклатуры)";
		 РезультатЗапроса = Запрос.Выполнить();
		 Если НЕ РезультатЗапроса.Пустой() Тогда
			 Выборка = РезультатЗапроса.Выбрать();
			 Пока Выборка.Следующий() Цикл
				 дкДобавитьОшибку(Ошибки,"Номенклатура " + СокрЛП(Выборка.Ссылка) + "не является услугой, относящейся на доходы и расходы");
			 КонецЦикла;	
			 Результат = Ложь;
		 КонецЕсли;
	 КонецЕсли;
	 
	 Если ХозОперация = Справочники.ХозОперации.УслугиПоСубподряду Тогда
		 Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
			 Если обЗначениеНеЗаполнено(ДокументОснование) Тогда
				 дкДобавитьОшибку(Ошибки,"Документ-основание не заполнено");
				 Результат = Ложь;
			 КонецЕсли; 
		 Иначе 
			 Для каждого СтрокаТоваров Из Товары Цикл
				 Если обЗначениеНеЗаполнено(СтрокаТоваров.ЗаказНаряд) Тогда
					 дкДобавитьОшибку(Ошибки,"У работы по субподряду <"+СокрЛП(СтрокаТоваров.Номенклатура)+"> не указан заказ-наряд, в рамках которого данная работы была выполнена");
					 Результат = Ложь;
				 КонецЕсли; 
			 КонецЦикла; 
		 КонецЕсли;
	 КонецЕсли;
	 
	 Возврат Результат;
 КонецФункции // ПроверитьКорректность()
 
 // Функция проверяет, допустимо ли изменение объекта
 //
 // Параметры:
 //  БлокироватьРеквизиты - структура, структура блокируемых на изменение реквизитов.
 //
 // Возвращаемое значение:
 // Булево - Возвращает Истина, если изменения возможны, ложь иначе
 //          Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
 //
 Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
	 // Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	 Возврат Истина;
 КонецФункции // ДоступностьИзменения()
 
 // Возвращает список возможных хозяйственных операций документа
 // Возвращаемое значение: 
 //  СписокЗначений. 
 //  Строка списка: Значение - имя предопределенного элемента; 
 //				   Представление - красивое его представление
 // 				   "Помеченная" строка - ХО по умолчанию.
 Функция ПолучитьСписокХозОпераций() Экспорт
	 СписокХозОпераций = Новый СписокЗначений;
	 СписокХозОпераций.Добавить("ПоступлениеТМЦсотрудников","Поступление ТМЦ сотрудников",Истина);
	 Возврат СписокХозОпераций;
 КонецФункции // ПолучитьСписокХозОпераций()
 
 // формирует движения документа по партионным регистрам
 //
 // Параметры:
 //  Режим           - режим проведения (оперативный/неоперативный)
 //  ДокументСсылка  - ссылка на документ который надо допровести по партиям
 //
 // Возвращаемое значение:
 //  Возвращает Истина - все ОК, ложь - чего-то не так
 //
 Функция ПровестиПоПартиям(Режим,ДокументСсылка) Экспорт
	 Отказ=Ложь;
	 
	 // получим шапку документа
	 ШапкаДокумента=ПолучитьШапкуДокумента(ДокументСсылка);
	 
	 // посчитаем суммы товаров и услуг
	 Запрос=Новый Запрос("
	 |ВЫБРАТЬ
	 |	ВЫБОР КОГДА ДокументТовары.Номенклатура.ВидНоменклатуры=&Услуга И ДокументТовары.Номенклатура.СпособРаспределенияДопРасходов=&НаДоходыРасходы ТОГДА &Услуга ИНАЧЕ &Товар КОНЕЦ КАК ВидНоменклатуры,
	 |	ВЫБОР КОГДА ДокументТовары.Номенклатура.ВидНоменклатуры=&Услуга ТОГДА ДокументТовары.Номенклатура.СтатьяДопРасходов ИНАЧЕ NULL КОНЕЦ КАК СтатьяДопРасходов,
	 |	СУММА(ДокументТовары.СуммаВсего) КАК СуммаВсего
	 |ИЗ
	 |	Документ.ПоступлениеТоваров.Товары 	КАК ДокументТовары
	 |
	 |ГДЕ  
	 |	ДокументТовары.Ссылка = &ДокументСсылка
	 |
	 |СГРУППИРОВАТЬ ПО 
	 |	ВЫБОР КОГДА ДокументТовары.Номенклатура.ВидНоменклатуры=&Услуга И ДокументТовары.Номенклатура.СпособРаспределенияДопРасходов=&НаДоходыРасходы ТОГДА &Услуга ИНАЧЕ &Товар КОНЕЦ,
	 |	ВЫБОР КОГДА ДокументТовары.Номенклатура.ВидНоменклатуры=&Услуга ТОГДА ДокументТовары.Номенклатура.СтатьяДопРасходов ИНАЧЕ NULL КОНЕЦ
	 |
	 |ИТОГИ ПО ВидНоменклатуры
	 |");
	 Запрос.УстановитьПараметр("ДокументСсылка",ШапкаДокумента.Ссылка);
	 Запрос.УстановитьПараметр("Услуга",Перечисления.ВидыНоменклатуры.Услуга);
	 Запрос.УстановитьПараметр("Товар",Перечисления.ВидыНоменклатуры.Товар);
	 Запрос.УстановитьПараметр("НаДоходыРасходы",Перечисления.СпособыРаспределенияДопРасходов.НаДоходыИРасходы);
	 ДеревоДоходовИРасходов=Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	 
	 ВедетсяБалансПоПодразделению = (Константы.СпособВеденияБаланса.Получить() = Перечисления.СпособВеденияБаланса.ПоПодразделению);
	 
	 // проверим, если подразделение проводиться по партиям "отложенно", то дальше не идем
	 НаборЗаписейДопроведениеПоПартиям=Движения.ДопроведениеПоПартиям;
	 НаборЗаписейДопроведениеПоПартиям.ДокументОбъект=ЭтотОбъект;
	 НаборЗаписейДопроведениеПоПартиям.ШапкаДокумента=ШапкаДокумента;
	 Отказ=НЕ НаборЗаписейДопроведениеПоПартиям.Зафиксировать() ИЛИ Отказ;
	 Если НаборЗаписейДопроведениеПоПартиям.НеПроводитьПартии Тогда
		 НайденнаяСтрокаТоваров=ДеревоДоходовИРасходов.Строки.Найти(Перечисления.ВидыНоменклатуры.Товар,"ВидНоменклатуры");
		 НайденнаяСтрокаУслуг=ДеревоДоходовИРасходов.Строки.Найти(Перечисления.ВидыНоменклатуры.Услуга,"ВидНоменклатуры");
		 Если ШапкаДокумента.ХозОперация<>Справочники.ХозОперации.ПоступлениеТоваровКомиссия И ШапкаДокумента.ХозОперация<>Справочники.ХозОперации.ПоступлениеБезвозмездное И
			 (НайденнаяСтрокаТоваров<>Неопределено ИЛИ НайденнаяСтрокаУслуг<>Неопределено) Тогда
			 // Доходы и расходы на себестоимость не оприходованных партий
			 СуммаВсего=?(НайденнаяСтрокаТоваров<>Неопределено,НайденнаяСтрокаТоваров.СуммаВсего,0)+?(НайденнаяСтрокаУслуг<>Неопределено,НайденнаяСтрокаУслуг.СуммаВсего,0);
			 НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
			 НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
			 // в случае если ведется баланс по подразделению передадим подразделение соответствующее корреспонденции
			 Если ВедетсяБалансПоПодразделению Тогда
				 НаборЗаписейДоходыИРасходы.ПодразделениеКомпании=ШапкаДокумента.СкладКомпании.ПодразделениеКомпании;
			 КонецЕсли;
			 НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
			 НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СебестоимостьНеоприходованныхПартий;
			 НаборЗаписейДоходыИРасходы.ВУпрВалюте = Ложь;
			 НаборЗаписейДоходыИРасходы.Расход = СуммаВсего;
			 НаборЗаписейДоходыИРасходы.Приход();
		 КонецЕсли;
		 Возврат НЕ Отказ;
	 КонецЕсли;
	 
	 // определим необходимость формирования корректирующих проводок
	 
	 
	 НаборЗаписейПартии=Движения.ПартииТоваровКомпании;
	 НаборЗаписейПартии.ДокументОбъект=ЭтотОбъект;
	 НаборЗаписейПартии.СкладКомпании=ШапкаДокумента.СкладКомпании;
	 НаборЗаписейПартии.ЕстьСтавкаНДС=Истина;
	 Если ШапкаДокумента.ХозОперация=Справочники.ХозОперации.ПоступлениеТоваровКомиссия Тогда
		 НаборЗаписейПартии.СтатусПартии=Перечисления.СтатусыПартий.ТоварПринятыйКомиссия;
	 Иначе
		 НаборЗаписейПартии.СтатусПартии=Перечисления.СтатусыПартий.ТоварКупленный;
	 КонецЕсли;
	 НаборЗаписейПартии.ПоБазовомуКоличеству=Истина;
	 НаборЗаписейПартии.ШапкаДокумента=ШапкаДокумента;	
	 НаборЗаписейПартии.РежимДопРасходы	= 1;	
	 Отказ=НЕ НаборЗаписейПартии.Приход() ИЛИ Отказ;
	 
	 // запишем в ДоходыИРасходы услуги стоимость которых не распределяется на себестоимость поступления
	 НайденнаяСтрокаУслуг=ДеревоДоходовИРасходов.Строки.Найти(Перечисления.ВидыНоменклатуры.Услуга,"ВидНоменклатуры");
	 Если НайденнаяСтрокаУслуг<>Неопределено Тогда
		 СуммаУслуг = 0;
		 Для Каждого СтрокаУслуги Из НайденнаяСтрокаУслуг.Строки Цикл
			 НаборЗаписейДиР = Движения.ДоходыИРасходы;
			 НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
			 // в случае если ведется баланс по подразделению передадим подразделение соответствующее корреспонденции
			 Если ВедетсяБалансПоПодразделению Тогда
				 НаборЗаписейДиР.Подразделение=ШапкаДокумента.СкладКомпании.Подразделение;
			 КонецЕсли;
			 НаборЗаписейДиР.ШапкаДокумента = ШапкаДокумента;
			 НаборЗаписейДиР.СтатьяДоходовИРасходов = СтрокаУслуги.СтатьяДопРасходов;
			 НаборЗаписейДиР.ВУпрВалюте = (ШапкаДокумента.ВалютаДокумента=Константы.ВалютаУправленческогоУчетаКомпании.Получить());
			 НаборЗаписейДиР.Расход = СтрокаУслуги.СуммаВсего;
			 СуммаУслуг = СуммаУслуг+СтрокаУслуги.СуммаВсего;
			 Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		 КонецЦикла;
		 
		 // способ ведения не по подразделениям то ничего не будем корректировать
	 КонецЕсли;
	 
	 // при безвозмездном поступлении сумму на доходы и расходы
	 Если ШапкаДокумента.ХозОперация=Справочники.ХозОперации.ПоступлениеБезвозмездное Тогда
		 НайденнаяСтрокаТоваров=ДеревоДоходовИРасходов.Строки.Найти(Перечисления.ВидыНоменклатуры.Товар,"ВидНоменклатуры");
		 СуммаСебестоимости = 0;
		 Если НайденнаяСтрокаТоваров<>Неопределено Тогда
			 НаборЗаписейДиР = Движения.ДоходыИРасходы;
			 НаборЗаписейДиР.ДокументОбъект         = ЭтотОбъект;
			 // в случае если ведется баланс по подразделению передадим подразделение соответствующее корреспонденции
			 Если ВедетсяБалансПоПодразделению Тогда
				 НаборЗаписейДиР.Подразделение          = ШапкаДокумента.СкладКомпании.Подразделение;
			 КонецЕсли;
			 НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.Себестоимость;
			 НаборЗаписейДиР.ШапкаДокумента         = ШапкаДокумента;
			 НаборЗаписейДиР.ВУпрВалюте             = Ложь;
			 НаборЗаписейДиР.Доход                  = НайденнаяСтрокаТоваров.СуммаВсего;
			 СуммаСебестоимости                     = СуммаСебестоимости+НайденнаяСтрокаТоваров.СуммаВсего;
			 Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		 КонецЕсли;  		
	 КонецЕсли;
	 
	 // двигаем границу последовательности партий
	 СвойствоСкладКомпанииБыл = неопределено;
	 ДополнительныеСвойства.Свойство("СкладКомпанииБыл",СвойствоСкладКомпанииБыл);
	 Если Режим<>РежимПроведенияДокумента.Оперативный ИЛИ ЗначениеЗаполнено(СвойствоСкладКомпанииБыл) Тогда
		 // если идет допроведение, то надо получить те значения которые были раньше
		 Если Ссылка<>ДокументСсылка Тогда
			 Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ СкладКомпании ИЗ РегистрНакопления.ПартииТоваровКомпании ГДЕ Регистратор=&Ссылка");
			 Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
			 Результат = Запрос.Выполнить(); СкладКомпанииБыл=Неопределено;
			 Если НЕ Результат.Пустой() Тогда
				 СкладКомпанииБыл = Результат.Выгрузить().ВыгрузитьКолонку("СкладКомпании");
			 КонецЕсли;
			 ДополнительныеСвойства.Вставить("СкладКомпанииБыл",СкладКомпанииБыл);
			 ДополнительныеСвойства.МоментВремениБыл = ДокументСсылка.МоментВремени();
		 КонецЕсли;
		 
		 НаборЗаписейГраницыПартий = РегистрыСведений.ГраницыПартий.СоздатьНаборЗаписей();
		 Если Режим<>РежимПроведенияДокумента.Оперативный Тогда
			 НаборЗаписейГраницыПартий.СкладКомпании		= ШапкаДокумента.СкладКомпании;
			 НаборЗаписейГраницыПартий.МоментВремени		= ШапкаДокумента.Дата;
			 НаборЗаписейГраницыПартий.СкладКомпанииБыл	= ДополнительныеСвойства.СкладКомпанииБыл;
			 НаборЗаписейГраницыПартий.МоментВремениБыл	= ДополнительныеСвойства.МоментВремениБыл;
		 Иначе
			 НаборЗаписейГраницыПартий.СкладКомпании		= ДополнительныеСвойства.СкладКомпанииБыл;
			 НаборЗаписейГраницыПартий.МоментВремени		= ДополнительныеСвойства.МоментВремениБыл;
			 НаборЗаписейГраницыПартий.СкладКомпанииБыл	= Неопределено;
			 НаборЗаписейГраницыПартий.МоментВремениБыл	= Неопределено;
		 КонецЕсли;
		 НаборЗаписейГраницыПартий.ДокументСсылка	= ШапкаДокумента.Ссылка;
		 НаборЗаписейГраницыПартий.ИзменитьГраницу();
	 КонецЕсли;
	 
	 Возврат НЕ Отказ;
 КонецФункции // ПровестиПоПартиям()
 
 // Обработка изменения реквизитов документа
 // Параметры
 //  Имя			– Строка – Имя реквизита документа с полным путем (например Товары.Номенклатура).
 //  ЭтаФорма	– Форма	 – Ссылка на форму документа. Если значение неопределено,
 //                         производится программная обработка реквизитов.
 //  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
 //										 Имеет смысл только для табличных частей документов.
 //  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
 // Возвращаемое значение:
 //   Булево   – Результат выполнения обработки.
 Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	 // ОБРАБОТКА РЕКВИЗИТОВ ДОКУМЕНТА
	 Если  Имя="ПодразделениеКомпании" Тогда
		 Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		 Возврат Рез;
		 
	 Иначе Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		 
	 КонецЕсли;
 КонецФункции // ОбработкаРеквизита()
 
 // возвращает выборку по шапке
 //
 // Параметры:
 //  ДокументСсылка - Ссылка на документ для которого получаем шапку.
 //
 // Возвращаемое значение:
 //  Выборка - выборка по шапке
 //
 Функция ПолучитьШапкуДокумента(ДокументСсылка)
	 Запрос=Новый Запрос("
	 |ВЫБРАТЬ
	 |	Док.Ссылка КАК Ссылка,
	 |	Док.Дата КАК Дата,
	 |	Док.ВалютаДокумента КАК ВалютаДокумента,
	 |	Док.КурсДокумента КАК КурсДокумента,
	 |	Док.ТипЦен КАК ТипЦен,
	 |	Док.ХозОперация КАК ХозОперация,
	 |	Док.КурсВалютыУпр КАК КурсВалютыУпр,
	 |	Док.КурсВалютыВзаиморасчетов КАК КурсВалютыВзаиморасчетов,
	 |	Док.МоментВремени КАК МоментВремени,
	 |	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
	 |	Док.Проект КАК Проект,
	 /////////// ПРИВАТ ////////////
	 |	Док.СкладКомпании КАК СкладКомпании,
	 |	Док.СуммаДокумента КАК СуммаДокумента,
	 |	Док.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	 |	Док.ДокументОснование КАК ДокументОснование
	 |
	 |ИЗ
	 |	Документ."+Метаданные().Имя+" КАК Док
	 |ГДЕ
	 |	Док.Ссылка=&Ссылка
	 |");
	 Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	 Выборка=Запрос.Выполнить().Выбрать(); Выборка.Следующий();
	 
	 Возврат Выборка;
 КонецФункции // ПолучитьШапкуДокумента()
 
 // заполнение свойств из документа основания
 Процедура ЗаполнитьСвойстваНаОсновании(Основание) Экспорт
	 //зарезервировано для описания заполнения свойств из свойств основания
 КонецПроцедуры
 
 // Проверка - а нет ли в документе тех позиций, которые не включены в ассортимент данного подразделения
 // в прайс данного склада? Если есть - сообщаем ошибки
 //
 // Параметры:
 //  РежимЗаписи - режим записи документа.
 //
 // Возвращаемое значение:
 //  Булево - результат успешной проверки
 //
 Функция ПроверитьАссортиментПодразделения(РежимЗаписи) Экспорт
	 ФлагСоответствияАссортимента = Истина;
	 Если ((РежимЗаписи=РежимЗаписиДокумента.Запись) ИЛИ (РежимЗаписи=РежимЗаписиДокумента.Проведение)) И (обПраво("КонтролироватьАссортиментПодразделения",Права,,ЭтотОбъект)<> Перечисления.ВидыКонтроля.НеКонтролировать) Тогда
		 Если (РежимЗаписи = РежимЗаписиДокумента.Проведение) ИЛИ (НЕ обПраво("КонтролироватьЗаполнениеТолькоПриПроведении",Права,,ЭтотОбъект)) тогда
			 ТаблицаОтсутствующихВАссортименте=Товары.Выгрузить();
			 ТаблицаОтсутствующихВАссортименте.Свернуть("Номенклатура","");
			 
			 Запрос = Новый Запрос("
			 |ВЫБРАТЬ
			 |	ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура КАК Номенклатура
			 |ИЗ
			 |	РегистрСведений.ОграничениеАссортиментаПодразделения.СрезПоследних(&Дата,ПодразделениеКомпании=&ПодразделениеКомпании И Номенклатура В (&Номенклатура)) КАК ОграничениеАссортиментаПодразделенияСрезПоследних
			 |ГДЕ
			 |	ОграничениеАссортиментаПодразделенияСрезПоследних.Состояние=&Введен
			 |");
			 Запрос.УстановитьПараметр("Дата", Дата);
			 Запрос.УстановитьПараметр("Введен", Перечисления.СостоянияТовараВАссортименте.Введен);
			 ТекПодразделение=ПодразделениеКомпании;
			 Пока НЕ обЗначениеНеЗаполнено(ТекПодразделение) Цикл
				 Запрос.УстановитьПараметр("ПодразделениеКомпании",ТекПодразделение);
				 Запрос.УстановитьПараметр("Номенклатура",ТаблицаОтсутствующихВАссортименте.ВыгрузитьКолонку("Номенклатура"));
				 Результат = Запрос.Выполнить();
				 Если НЕ Результат.Пустой() Тогда
					 Выборка=Результат.Выбрать();
					 Пока Выборка.Следующий() Цикл
						 НайденнаяСтрока=ТаблицаОтсутствующихВАссортименте.Найти(Выборка.Номенклатура,"Номенклатура");
						 Если НайденнаяСтрока<>Неопределено Тогда
							 ТаблицаОтсутствующихВАссортименте.Удалить(НайденнаяСтрока);
						 КонецЕсли;
					 КонецЦикла;
				 КонецЕсли;
				 Если ТаблицаОтсутствующихВАссортименте.Количество()=0 Тогда Прервать; КонецЕсли;
				 ТекПодразделение=ТекПодразделение.Родитель;
			 КонецЦикла;
			 
			 Если (ТаблицаОтсутствующихВАссортименте.Количество()>0) тогда
				 ФлагСоответствияАссортимента = НЕ (обПраво("КонтролироватьАссортиментПодразделения",Права,,ЭтотОбъект)=Перечисления.ВидыКонтроля.Запрещать);
			 КонецЕсли;
			 ИмяКолонкиКода=дкПолучитьПараметрыРежимаВыводаКодаВДокументах(,ЭтотОбъект).Имя;
			 Для Каждого СтрокаТовар Из ТаблицаОтсутствующихВАссортименте Цикл
				 Сообщить("["+дкПолучитьЗначениеКолонкиКода(СтрокаТовар.Номенклатура,ИмяКолонкиКода,ЭтотОбъект)+"] "+СокрЛП(СтрокаТовар.Номенклатура)+" Не входит в ассортимент подразделения.",?(ФлагСоответствияАссортимента,СтатусСообщения.Информация,СтатусСообщения.Важное));
			 КонецЦикла;
		 КонецЕсли;
	 КонецЕсли;
	 Возврат ФлагСоответствияАссортимента;
 КонецФункции	
 #Если Клиент Тогда
	 
 ////////////////////////////////////////////////////////////////////////////////
 // ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА
	 
 //Функция печати этикеток и ценников
	 // 
	 // Параметры:
	 //  ТабДокумент - табличный документ.
	 //
 Функция ПечатьЭтикетокИЦенников(ТабДокумент) Экспорт
		 //СтруктураПараметров=Неопределено;
		 //Если НЕ обЗначениеНеЗаполнено(СкладКомпании) И СкладКомпании.Розничный Тогда
		 //	СтруктураПараметров=Новый Структура("ИмяРеквизитаЦена,ТипЦен","ЦенаРозничная",СкладКомпании.ТипЦенРозничнойТорговли);
		 //КонецЕсли;
		 //дкПечатьЭтикетокИЦенников(ЭтотОбъект,СтруктураПараметров);
	 КонецФункции // ПечатьЭтикетокИЦенников()
	 
 // Формирует табличный документ 
	 // 
	 // Параметры:
	 //  ТабДокумент - табличный документ.
	 //
	 // Возвращаемое значение:
	 //  ТабДокумент - возвращает сформированный табличный документ.
	 //
 Функция ПечатьПоступлениеТоваров(ТабДокумент) Экспорт
		 //  Макет = ПолучитьМакет("ПоступлениеТоваров");
		 //  
		 //  //для начала настроим макет
		 //  ОбластьШапкаТаблицы = дкПривестиМакетПечатнойФормы(ЭтотОбъект,Макет);
		 //  ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
		 //  
		 //  //вывод заголовка документа
		 //  ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		 //  ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		 //  
		 //  ТекстЗаголовка = дкПолучитьПредставление(ЭтотОбъект);
		 //  
		 //  ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		 //  ОбластьМакета.Параметры.ПредставлениеПоставщика	= спПолучитьПредставление(Контрагент);
		 //  Если НЕ обЗначениеНеЗаполнено(ПодразделениеКомпании) И НЕ обЗначениеНеЗаполнено(ПодразделениеКомпании.КПП) Тогда
		 //  	СтрокаПредставления = спПолучитьПредставление(Организация);
		 //  	ОбластьМакета.Параметры.ПредставлениеПокупателя	= СтрЗаменить(СтрокаПредставления, Организация.КПП, ПодразделениеКомпании.КПП);
		 //  Иначе	
		 //  	ОбластьМакета.Параметры.ПредставлениеПокупателя	= спПолучитьПредставление(Организация);
		 //  КонецЕсли;
		 //  ОбластьМакета.Параметры.ПредставлениеСклада		= спПолучитьНаименование(СкладКомпании);
		 //  
		 //  //вывод свойств
		 //  СтрокаСвойств = дкПолучитьСтрокуСвойствДокумента(ЭтотОбъект);
		 //  ОбластьМакета.Параметры.СтрокаСвойств = СтрокаСвойств;
		 //  ТабДокумент.Вывести(ОбластьМакета);
		 //  
		 //  //сразу два, т.к. выводим на второй странице только
		 //  НомерСтраницы = 2;
		 //  НомерСтраницыПред = НомерСтраницы;
		 //  
		 //  //теперь выводим шапку
		 //  ТабДокумент.Вывести(ОбластьШапкаТаблицы);
		 //  
		 //  //готовим области строки
		 //  ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		 //  
		 //  ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		 //
		 //  //заполним параметры шапки таблицы для следующего листа
		 //  ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		 //  ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		 //  
		 //  ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		 //  
		 //  //перебор строк
		 //  ВыборкаТабличнойЧасти = ЭтотОбъект.Товары;
		 //  Для каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
		 //  	//заполняем данные строки
		 //  	СтруктураСтроки = дкПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТабличнойЧасти,ЭтотОбъект);
		 //  	ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);
		 //  	
		 //  	//доп. области
		 //  	мсвДопОбластиПодвала = Неопределено;
		 //  	Если ВыборкаТабличнойЧасти.Индекс(СтрокаТабличнойЧасти) = ВыборкаТабличнойЧасти.Количество()-1 Тогда
		 //  		мсвДопОбластиПодвала = Новый Массив;
		 //  		мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
		 //  	КонецЕсли;
		 //  	
		 //  	//выводим строку, делая проверку попадания на лист
		 //  	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице,
		 //  	НомерСтраницы, СтруктураИтоговПоСтранице, ЭтотОбъект, мсвДопОбластиПодвала);
		 //  	
		 //	//добавляем итоги
		 //  	дкДобавитьИтогиПоСтранице(СтрокаТабличнойЧасти,СтруктураИтоговПоСтранице);
		 //  КонецЦикла;
		 //  
		 //  //выводим последний подвал, если страниц больше единицы
		 //
		 //  //итоги
		 //СуммаВсего = ВыборкаТабличнойЧасти.Итог("СуммаВсего");
		 //  ОбластьПодвал.Параметры.СуммаВсего = Формат(СуммаВсего,ФорматВыводаСуммы);
		 //  НДСВсего = ВыборкаТабличнойЧасти.Итог("СуммаНДС");
		 //  ОбластьПодвал.Параметры.НДСВсего = Формат(НДСВсего,ФорматВыводаСуммы);
		 //  ОбластьПодвал.Параметры.СуммаПрописью = "Всего наименований "+ВыборкаТабличнойЧасти.Количество()+" на сумму " + обЧислоПрописью(СуммаВсего,ЭтотОбъект.ВалютаДокумента);
		 //  
		 //  // Выводим представления и расшифровки подписей
		 //  Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"ОтпустилКонтрагент");
		 //  Отпустил.Вставить("ОтпустилПредставление", ?(обЗначениеНеЗаполнено(Отпустил.ОтпустилКонтрагент),"","/ "+ Отпустил.ОтпустилКонтрагентПредставление));
		 //  //Отпустил.ОтпустилПредставление = ?(обЗначениеНеЗаполнено(Отпустил.Отпустил),"","/ "+ Отпустил.ОтпустилПредставление);
		 //  ОбластьПодвал.Параметры.Заполнить(Отпустил);
		 //  Получил  = дкОтветственноеЛицо(ЭтотОбъект,"Получил");
		 //  Получил.ПолучилПредставление = ?(обЗначениеНеЗаполнено(Получил.Получил),"","/ "+ Получил.ПолучилПредставление);
		 //  ОбластьПодвал.Параметры.Заполнить(Получил);
		 //  
		 //  НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвал, , , НомерСтраницы,,ЭтотОбъект);
		 //  
		 //  Возврат ТабДокумент;
	 КонецФункции // ПечатьПоступлениеТоваров()
	 
 // Формирует табличный документ 
	 // 
	 // Параметры:
	 //  ТабДокумент - табличный документ.
	 //
	 // Возвращаемое значение:
	 //  ТабДокумент - возвращает сформированный табличный документ.
	 //
 Функция ПечатьРаскладочныйЛист(ТабДокумент) Экспорт
		 Макет = ПолучитьМакет("РаскладочныйЛист");
		 
		 ВыборкаТабличнойЧасти = ЭтотОбъект.Товары;
		 
		 //Настроим макет
		 ОбластьШапкаТаблицы = дкПривестиМакетПечатнойФормы(ЭтотОбъект,Макет);
		 
		 //вывод заголовка документа
		 ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		 ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		 
		 ТекстЗаголовка = дкПолучитьПредставление(ЭтотОбъект, "Раскладочный лист");
		 
		 ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		 Если НЕ обЗначениеНеЗаполнено(ПодразделениеКомпании) И НЕ обЗначениеНеЗаполнено(ПодразделениеКомпании.КПП) Тогда
			 СтрокаПредставления = спПолучитьПредставление(Организация);
			 ОбластьМакета.Параметры.ПредставлениеПокупателя	= СтрЗаменить(СтрокаПредставления, Организация.КПП, ПодразделениеКомпании.КПП);
		 Иначе	
			 ОбластьМакета.Параметры.ПредставлениеПокупателя	= спПолучитьПредставление(Организация);
		 КонецЕсли;
		 
		 //вывод свойств
		 СтрокаСвойств = дкПолучитьСтрокуСвойствДокумента(ЭтотОбъект);
		 ОбластьМакета.Параметры.СтрокаСвойств = СтрокаСвойств;
		 ТабДокумент.Вывести(ОбластьМакета);
		 
		 //сразу два, т.к. выводим на второй странице только
		 НомерСтраницы = 2;
		 НомерСтраницыПред = НомерСтраницы;
		 
		 //теперь выводим шапку
		 ТабДокумент.Вывести(ОбластьШапкаТаблицы);
		 
		 //готовим области строки
		 ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		 
		 ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		 СтруктураИтоговПоСтранице = Новый Структура();
		 
		 //заполним параметры шапки таблицы для следующего листа
		 ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		 ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		 
		 ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		 
		 //перебор строк
		 Для каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
			 //заполняем данные строки
			 СтруктураСтроки = дкПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТабличнойЧасти,ЭтотОбъект);
			 //В возвращаемой структуре нет ключа "Ячейка", создадим его
			 СтруктураСтроки.Вставить("Ячейка");
			 //Если ЯчейкаХранения не определена для данной номенклатуры, то печатаем пробел
			 ЯчейкаДляПечати = СокрЛП(СтрокаТабличнойЧасти.Ячейка.Код);
			 СтруктураСтроки.Ячейка 	= ?(обЗначениеНеЗаполнено(ЯчейкаДляПечати)," ",ЯчейкаДляПечати);
			 
			 // +++++ Соколмоторс +++++
			 СтруктураСтроки.Вставить("Производитель");
			 Производитель = СтрокаТабличнойЧасти.Номенклатура.Производитель;
			 СтруктураСтроки.Производитель = ?(обЗначениеНеЗаполнено(Производитель), "", Производитель.Наименование);		
			 // ----- Соколмоторс -----		
			 
			 ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);
			 
			 //доп. области
			 мсвДопОбластиПодвала = Неопределено;
			 Если ВыборкаТабличнойЧасти.Индекс(СтрокаТабличнойЧасти) = ВыборкаТабличнойЧасти.Количество()-1 Тогда
				 мсвДопОбластиПодвала = Новый Массив;
				 мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
			 КонецЕсли;
			 
			 //выводим строку, делая проверку попадания на лист
			 НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице,
			 НомерСтраницы, СтруктураИтоговПоСтранице, ЭтотОбъект, мсвДопОбластиПодвала);
			 
			 //инициализация итогов по странице
			 Если НомерСтраницы <> НомерСтраницыПред Тогда
				 СтруктураИтоговПоСтранице = Новый Структура();
				 НомерСтраницыПред = НомерСтраницы;
				 ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			 КонецЕсли;
		 КонецЦикла;
		 
		 //Итогов по странице на этой печатной форме нет, но выводим для прорисовки завершающей чёрной линии снизу страницы
		 дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьМакетаИтогоПоСтранице,СтруктураИтоговПоСтранице,ЭтотОбъект);
		 
		 // Выводим представления и расшифровки подписей
		 Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"ОтпустилКонтрагент");
		 Отпустил.Вставить("ОтпустилПредставление", ?(обЗначениеНеЗаполнено(Отпустил.ОтпустилКонтрагент),"","/ "+ Отпустил.ОтпустилКонтрагентПредставление));
		 //Отпустил.ОтпустилПредставление = ?(обЗначениеНеЗаполнено(Отпустил.Отпустил),"","/ "+ Отпустил.ОтпустилПредставление);
		 ОбластьПодвал.Параметры.Заполнить(Отпустил);
		 Получил  = дкОтветственноеЛицо(ЭтотОбъект,"Получил");
		 Получил.ПолучилПредставление = ?(обЗначениеНеЗаполнено(Получил.Получил),"","/ "+ Получил.ПолучилПредставление);
		 ОбластьПодвал.Параметры.Заполнить(Получил);
		 
		 НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвал, , , НомерСтраницы,,ЭтотОбъект);
		 
		 Возврат ТабДокумент;
	 КонецФункции // ПечатьРаскладочныйЛист()
	 
 // Формирует печатную форму "ТОРГ-12"
	 // 
	 // Параметры:
	 //  ТабДокумент - табличный документ.
	 //
	 // Возвращаемое значение:
	 //  ТабДокумент - возвращает сформированный табличный документ.
	 //
 Функция ПечатьТОРГ12(ТабДокумент) Экспорт
		 
		 ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы", Права,,ЭтотОбъект);
		 ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества", Права,,ЭтотОбъект);
		 
		 // Зададим параметры макета
		 ТабДокумент.ПолеСверху = 0;
		 ТабДокумент.ПолеСлева  = 0;
		 ТабДокумент.ПолеСнизу  = 0;
		 ТабДокумент.ПолеСправа = 0;
		 ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		 
		 Макет = ПолучитьОбщийМакет("ТОРГ12");
		 
		 ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		 ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		 
		 СтруктураПредставления1=Новый Структура(
		 "Наименование,ИНН,КПП,АдресЮридический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		 "","ИНН ","КПП ","","тел.: ","р/с ","в банке ","БИК ","к/с "
		 );
		 СтруктураПредставления2=Новый Структура(
		 "Наименование,ИНН,КПП,АдресФактический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		 "","ИНН ","КПП ","","тел.: ","р/с ","в банке ","БИК ","к/с "
		 );
		 
		 // получим р/с из свойств документа
		 РасчетныйСчетДокумента=обПолучитьЗначениеСвойства(ЭтотОбъект, "РасчетныйСчет", Неопределено);
		 
		 // Правим, что автоматом не заполнилось, или заполнилось неправильно
		 ОбластьМакета.Параметры.ОрганизацияПредставление= спПолучитьПредставление(ЭтотОбъект.Сотрудник,СтруктураПредставления1);
		 ОбластьМакета.Параметры.ПодразделениеКомпании	= Неопределено;
		 ОбластьМакета.Параметры.Поставщик				= обПолучитьЗначениеСвойства(ЭтотОбъект,"ПоставщикКонтрагент",ЭтотОбъект.Сотрудник);
		 ОбластьМакета.Параметры.ПоставщикПредставление	= спПолучитьПредставление(ОбластьМакета.Параметры.Поставщик,СтруктураПредставления2);
		 
		 ОбластьМакета.Параметры.Грузополучатель				= обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузополучатель",ЭтотОбъект.ПодразделениеКомпании);
		 ОбластьМакета.Параметры.ГрузополучательПредставление= спПолучитьПредставление(ОбластьМакета.Параметры.Грузополучатель,СтруктураПредставления2,РасчетныйСчетДокумента);
		 ОбластьМакета.Параметры.Плательщик					= обПолучитьЗначениеСвойства(ЭтотОбъект,"Плательщик",ЭтотОбъект.Организация);
		 ОбластьМакета.Параметры.ПлательщикПредставление		= спПолучитьПредставление(ОбластьМакета.Параметры.Плательщик,СтруктураПредставления2);
		 
		 //дальше заполнить Шапку
		 ОбластьМакета.Параметры.КодПоОКПО				= ЭтотОбъект.Сотрудник.КодПоОКПО;
		 Если ТипЗнч(ОбластьМакета.Параметры.Грузополучатель)=Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
			 ОбластьМакета.Параметры.ГрузополучательПоОКПО	= ОбластьМакета.Параметры.Грузополучатель.Организация.КодПоОКПО;
		 Иначе
			 ОбластьМакета.Параметры.ГрузополучательПоОКПО	= ОбластьМакета.Параметры.Грузополучатель.КодПоОКПО;
		 КонецЕсли;
		 ОбластьМакета.Параметры.ПоставщикПоОКПО			= ОбластьМакета.Параметры.Поставщик.КодПоОКПО;
		 Если ТипЗнч(ОбластьМакета.Параметры.Плательщик)=Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
			 ОбластьМакета.Параметры.ПлательщикПоОКПО		= ОбластьМакета.Параметры.Плательщик.Организация.КодПоОКПО;
		 Иначе
			 ОбластьМакета.Параметры.ПлательщикПоОКПО		= ОбластьМакета.Параметры.Плательщик.КодПоОКПО;
		 КонецЕсли;
		 
		 ОбластьМакета.Параметры.ОснованиеДата = "";
		 ОбластьМакета.Параметры.ОснованиеНомер = ""; 	
		 ОбластьМакета.Параметры.Номер = дкПолучитьНомерДляПечати(ЭтотОбъект);	
		 
		 ТабДокумент.Вывести(ОбластьМакета);
		 
		 НомерСтраницы	= 2;
		 НомерСтраницыПред = НомерСтраницы;
		 КоличествоСтрокНаТекущейСтранице=0;
		 
		 ОбластьЗаголовокТаблицы	= Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		 ОбластьСтрока			= Макет.ПолучитьОбласть("Строка");
		 ОбластьИтоги			= Макет.ПолучитьОбласть("ИтогоПоСтранице");
		 ОбластьВсего			= Макет.ПолучитьОбласть("Всего");
		 //!!! TimR: В новой пф данное поле не выводится
		 //ОбластьВсегоСтавкаНДС	= Макет.ПолучитьОбласть("ВсегоСтавкаНДС");
		 
		 СтруктураИтоговПоСтранице = Новый Структура("ИтогКоличествоПоСтранице,ИтогСуммыПоСтранице,ИтогНДСПоСтранице,ИтогСуммыСНДСПоСтранице",0,0,0,0);		
		 
		 ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);	
		 
		 ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		 
		 //заполним параметры шапки таблицы для следующего листа
		 ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		 
		 ВыборкаСтрок = ЭтотОбъект.Товары;
		 
		 КоличествоСтрок = ВыборкаСтрок.Количество();
		 
		 // инициализация итогов по документу
		 ИтогоКоличество = 0;
		 ИтогоСумма      = 0;
		 ИтогоНДС        = 0;
		 ИтогоСуммаСНДС  = 0;
		 
		 СоответствиеИтоговПоставкамНДС = Новый Соответствие();
		 
		 // Выводим многострочную часть документа
		 Для каждого СтрокаТоваров Из ВыборкаСтрок Цикл
			 //заполняем данные строки
			 СтруктураСтроки = дкПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТоваров,ЭтотОбъект);
			 ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);
			 ОбластьСтрока.Параметры.БазоваяЕдиницаНаименование	= СтрокаТоваров.ЕдиницаИзмерения;
			 ОбластьСтрока.Параметры.БазоваяЕдиницаКодПоОКЕИ		= СтрокаТоваров.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;
			 ОбластьСтрока.Параметры.Количество					= Формат(СтрокаТоваров.КоличествоБазовое,ФорматВыводаКоличества);
			 ОбластьСтрока.Параметры.КоличествоМест				= Формат(СтрокаТоваров.Количество,ФорматВыводаКоличества);
			 ОбластьСтрока.Параметры.КоличествоВОдномМесте		= Формат(СтрокаТоваров.Коэффициент,ФорматВыводаКоличества);
			 
			 //доп. области
			 мсвДопОбластиПодвала = Неопределено;
			 Если ВыборкаСтрок.Индекс(СтрокаТоваров) = ВыборкаСтрок.Количество()-1 Тогда
				 мсвДопОбластиПодвала = Новый Массив;
				 мсвДопОбластиПодвала.Добавить(ОбластьВсего);
				 //!!! TimR: В новой пф данное поле не выводится
				 //мсвДопОбластиПодвала.Добавить(ОбластьВсегоСтавкаНДС);
				 мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
			 КонецЕсли;
			 
			 Если КоличествоСтрокНаТекущейСтранице=0 Тогда
				 ТабДокумент.Вывести(ОбластьСтрока);
			 Иначе
				 //выводим строку, делая проверку попадания на лист		
				 НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрока, ОбластьЗаголовокТаблицы, ОбластьИтоги,
				 НомерСтраницы, СтруктураИтоговПоСтранице, ЭтотОбъект, мсвДопОбластиПодвала);
			 КонецЕсли; 
			 
			 // увеличим итоги по странице
			 СтруктураСтрокиИтогов = Новый Структура("ИтогКоличествоПоСтранице,ИтогСуммыПоСтранице,ИтогНДСПоСтранице,ИтогСуммыСНДСПоСтранице");
			 СтруктураСтрокиИтогов.ИтогКоличествоПоСтранице = СтрокаТоваров.КоличествоБазовое;
			 СтруктураСтрокиИтогов.ИтогСуммыПоСтранице      = СтрокаТоваров.СуммаВсего-СтрокаТоваров.СуммаНДС;
			 СтруктураСтрокиИтогов.ИтогНДСПоСтранице		   = СтрокаТоваров.СуммаНДС;
			 СтруктураСтрокиИтогов.ИтогСуммыСНДСПоСтранице   = СтрокаТоваров.СуммаВсего;
			 
			 //инициализация итогов по странице
			 Если НомерСтраницы <> НомерСтраницыПред Тогда
				 СтруктураИтоговПоСтранице = Новый Структура("ИтогКоличествоПоСтранице,ИтогСуммыПоСтранице,ИтогНДСПоСтранице,ИтогСуммыСНДСПоСтранице",0,0,0,0);
				 НомерСтраницыПред = НомерСтраницы;
				 КоличествоСтрокНаТекущейСтранице=0;
				 ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			 Иначе
				 КоличествоСтрокНаТекущейСтранице=КоличествоСтрокНаТекущейСтранице+1;
			 КонецЕсли;
			 //добавляем итоги
			 дкДобавитьИтогиПоСтранице(СтруктураСтрокиИтогов,СтруктураИтоговПоСтранице);
			 
			 // итоги по ставкам НДС
			 Если НЕ обЗначениеНеЗаполнено(СтрокаТоваров.СтавкаНДС) Тогда
				 Если СоответствиеИтоговПоставкамНДС[СтрокаТоваров.СтавкаНДС] = Неопределено Тогда
					 СоответствиеИтоговПоставкамНДС.Вставить(СтрокаТоваров.СтавкаНДС,0);
				 КонецЕсли;
				 СоответствиеИтоговПоставкамНДС[СтрокаТоваров.СтавкаНДС] = СоответствиеИтоговПоставкамНДС[СтрокаТоваров.СтавкаНДС] + СтрокаТоваров.СуммаНДС;
			 КонецЕсли;
		 КонецЦикла;
		 
		 //выводим последний подвал, если страниц больше единицы
		 Если НомерСтраницы > 1 Тогда
			 дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьИтоги,СтруктураИтоговПоСтранице,ЭтотОбъект);
		 КонецЕсли;
		 
		 // Выводим итоги по документу в целом
		 ОбластьВсего.Параметры.ИтогКоличество = Формат(ВыборкаСтрок.Итог("КоличествоБазовое"), ФорматВыводаКоличества);
		 ОбластьВсего.Параметры.ИтогСуммы      = Формат(ВыборкаСтрок.Итог("СуммаВсего")-ВыборкаСтрок.Итог("СуммаНДС"), ФорматВыводаСуммы);
		 ОбластьВсего.Параметры.ИтогНДС        = Формат(ВыборкаСтрок.Итог("СуммаНДС"), ФорматВыводаСуммы);
		 ОбластьВсего.Параметры.ИтогСуммыСНДС  = Формат(ВыборкаСтрок.Итог("СуммаВсего"), ФорматВыводаСуммы);
		 ТабДокумент.Вывести(ОбластьВсего);
		 
		 //!!! TimR: В новой пф данное поле не выводится
		 //// выведем итоги по ставкам НДС
		 //Для Каждого ЭлементСоответствия Из СоответствиеИтоговПоставкамНДС Цикл
		 //	ОбластьВсегоСтавкаНДС.Параметры.СтавкаНДС = "Итого по ставке НДС: "+
		 //	дкПолучитьПредставлениеСтавкиНДС(ЭлементСоответствия.Ключ,"%");
		 //	ОбластьВсегоСтавкаНДС.Параметры.ИтогНДС = Формат(ЭлементСоответствия.Значение,ФорматВыводаСуммы);
		 //	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьВсегоСтавкаНДС, , , НомерСтраницы,,ЭтотОбъект);
		 //КонецЦикла;
		 
		 // Выводим подвал документа
		 ОбластьПодвал.Параметры.Заполнить(ЭтотОбъект);
		 ОбластьПодвал.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ЧислоПрописью(КоличествоСтрок, ,",,,,,,,,0");
		 ОбластьПодвал.Параметры.СуммаПрописью = обЧислоПрописью(ЭтотОбъект.Товары.Итог("СуммаВсего"),ЭтотОбъект.ВалютаДокумента);
		 
		 Доверенность = обПолучитьЗначениеСвойства(ЭтотОбъект,"Доверенность");
		 Если НЕ обЗначениеНеЗаполнено(Доверенность) Тогда
			 ОбластьПодвал.Параметры.ДоверенностьНомер = ?(ПустаяСтрока(Доверенность.Серия),"",Доверенность.Серия + "-") + Доверенность.Номер;
			 ОбластьПодвал.Параметры.ДоверенностьДата  = Доверенность.ДатаВыдачи;
			 ОбластьПодвал.Параметры.ДоверенностьВыдана= Доверенность.КемВыдан;
		 КонецЕсли; 
		 
		 ДатаОтгрузки=обПолучитьЗначениеСвойства(ЭтотОбъект,"ДатаОтгрузки",Дата('00010101'));
		 ДатаОтгрузки=?(обЗначениеНеЗаполнено(ДатаОтгрузки),"""___""____________ 20___",Формат(ДатаОтгрузки,"ДФ=dd.MM.yyyy"));
		 ОбластьПодвал.Параметры.ДатаОтгрузки = ДатаОтгрузки;
		 
		 // Заполним информацию о руководителях организации
		 ГлавныйБухгалтер = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер);
		 ОбластьПодвал.Параметры.Заполнить(ГлавныйБухгалтер);
		 
		 Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"ОтпустилКонтрагент");
		 Отпустил.Вставить("ОтпустилПредставление", Отпустил.ОтпустилКонтрагентПредставление);
		 ОбластьПодвал.Параметры.Заполнить(Отпустил);
		 
		 Получил = дкОтветственноеЛицо(ЭтотОбъект,"Получил");
		 ОбластьПодвал.Параметры.Заполнить(Получил);
		 
		 НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвал, , , НомерСтраницы,,ЭтотОбъект);
		 
		 ТабДокумент.АвтоМасштаб = Истина;
		 
		 Возврат ТабДокумент;
		 
	 КонецФункции // ПечатьТОРГ12()
	 
 // Формирует печатную форму "ТОРГ-1"
	 // 
	 // Параметры:
	 //  ТабДокумент - табличный документ.
	 //
	 // Возвращаемое значение:
	 //  ТабДокумент - возвращает сформированный табличный документ.
	 //
 Функция ПечатьТОРГ1(ТабДокумент) Экспорт
		 Макет = ПолучитьОбщийМакет("ТОРГ1");
		 
		 ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
		 ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества",Права,,ЭтотОбъект);	
		 
		 ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		 ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		 
		 СтруктураПредставления1=Новый Структура(
		 "Наименование,ИНН,КПП,АдресЮридический,ТелефонРабочий",
		 "","ИНН ","КПП ","","тел.: "
		 );
		 СтруктураПредставления2=Новый Структура(
		 "Наименование,ИНН,КПП,АдресФактический,ТелефонРабочий",
		 "","ИНН ","КПП ","","тел.: "
		 );
		 
		 // Правим, что автоматом не заполнилось, или заполнилось неправильно
		 Если НЕ обЗначениеНеЗаполнено(ПодразделениеКомпании) И НЕ обЗначениеНеЗаполнено(ПодразделениеКомпании.КПП) Тогда
			 СтрокаПредставления = спПолучитьПредставление(ОбластьМакета.Параметры.Организация,СтруктураПредставления1);
			 ОбластьМакета.Параметры.ОрганизацияПредставление = СтрЗаменить(СтрокаПредставления, Организация.КПП, ПодразделениеКомпании.КПП);
		 Иначе	
			 ОбластьМакета.Параметры.ОрганизацияПредставление	= спПолучитьПредставление(ОбластьМакета.Параметры.Организация,СтруктураПредставления1);
		 КонецЕсли;
		 ОбластьМакета.Параметры.КодПоОКПО					= ОбластьМакета.Параметры.Организация.КодПоОКПО;
		 ОбластьМакета.Параметры.ВидДеятельностиПоОКДП		= ОбластьМакета.Параметры.Организация.КодПоОКДП;
		 
		 ОбластьМакета.Параметры.Номер			= ?(обЗначениеНеЗаполнено(ЭтотОбъект.ВхДокНомер),дкПолучитьНомерДляПечати(ЭтотОбъект), ЭтотОбъект.ВхДокНомер);
		 ОбластьМакета.Параметры.Дата			= ?(обЗначениеНеЗаполнено(ЭтотОбъект.ВхДокНомер),ЭтотОбъект.Дата, ЭтотОбъект.ВхДокДата);
		 ОбластьМакета.Параметры.МестоПриемки	= ЭтотОбъект.СкладКомпании;
		 
		 // Заполним информацию о руководителе организации
		 Руководитель = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.Руководитель);
		 ОбластьМакета.Параметры.Заполнить(Руководитель);
		 ТабДокумент.Вывести(ОбластьМакета);
		 
		 ОбластьМакета = Макет.ПолучитьОбласть("Введение");
		 
		 ОбластьМакета.Параметры.Грузоотправитель				= обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузоотправитель",ЭтотОбъект.Сотрудник);
		 ОбластьМакета.Параметры.ГрузоотправительПредставление	= спПолучитьПредставление(ОбластьМакета.Параметры.Грузоотправитель,СтруктураПредставления2);
		 
		 ОбластьМакета.Параметры.Поставщик				= ЭтотОбъект.Сотрудник;
		 ОбластьМакета.Параметры.ПоставщикПредставление	= спПолучитьПредставление(ОбластьМакета.Параметры.Поставщик,СтруктураПредставления1);
		 
		 Производитель = дкОтветственноеЛицо(ЭтотОбъект,"Производитель");
		 ОбластьМакета.Параметры.Заполнить(Производитель);
		 
		 СтраховаяКомпания = дкОтветственноеЛицо(ЭтотОбъект,"СтраховаяКомпания");
		 ОбластьМакета.Параметры.Заполнить(СтраховаяКомпания);
		 
		 Параметры = Новый Структура;
		 Параметры.Вставить("СопроводительныеДокументы"	, обПолучитьЗначениеСвойства(ЭтотОбъект,"СопроводительныеДокументы"));
		 Параметры.Вставить("СпособДоставки"				, обПолучитьЗначениеСвойства(ЭтотОбъект,"СпособДоставки"));
		 Параметры.Вставить("НомерТранспортногоСредства"	, обПолучитьЗначениеСвойства(ЭтотОбъект,"НомерТранспортногоСредства"));
		 Параметры.Вставить("ДатаОтправления"			, обПолучитьЗначениеСвойства(ЭтотОбъект,"ДатаОтправления"));
		 ОбластьМакета.Параметры.Заполнить(Параметры);
		 
		 ТабДокумент.Вывести(ОбластьМакета);
		 ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		 
		 //переменные управляющие постраничным выводом
		 СтрокНаСтранице = 41;
		 СтрокШапки      = 5;
		 СтрокПодвала    = 3;
		 НомерСтраницы   = 1;	
		 
		 ОбластьЗаголовокТаблицы	= Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		 ОбластьСтрока			= Макет.ПолучитьОбласть("Строка");
		 ОбластьИтоги			= Макет.ПолучитьОбласть("ИтогоПоСтранице");
		 ОбластьВсего			= Макет.ПолучитьОбласть("Всего");
		 ОбластьСтрокаСертификата= Макет.ПолучитьОбласть("СтрокаСертификата");
		 
		 ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
		 ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
		 
		 ВыборкаСтрок = ЭтотОбъект.Товары;
		 
		 КоличествоСтрок = ВыборкаСтрок.Количество();
		 Если КоличествоСтрок = 1 Тогда
			 ПереноситьПоследнююСтроку = 0;
		 Иначе
			 ЦелыхСтраницСПодвалом     = Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
			 ЦелыхСтраницБезПодвала    = Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
			 ПереноситьПоследнююСтроку = ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
		 КонецЕсли;
		 
		 // Определим имя показываемой колонки кода
		 ИмяКолонкиКода = дкПолучитьПараметрыРежимаВыводаКодаВДокументах(,ЭтотОбъект).Имя;
		 
		 // инициализация итогов по странице
		 ИтогоКоличествоНаСтранице	= 0;
		 ИтогоСуммаНаСтранице		= 0;
		 ИтогоНДСНаСтранице			= 0;
		 ИтогоСНДСНаСтранице			= 0;
		 ИтогоМассаБруттоНаСтранице = 0;
		 
		 // инициализация итогов по документу
		 ИтогоКоличество  = 0;
		 ИтогоСумма       = 0;
		 ИтогоНДС         = 0;
		 ИтогоСНДС        = 0;
		 Ном              = 0;
		 ИтогоМассаБрутто = 0;
		 
		 
		 // Выводим многострочную часть документа
		 Для каждого СтрокаТоваров Из ВыборкаСтрок Цикл
			 Ном = Ном + 1;
			 ЦелаяСтраница = (СтрокШапки + Ном - 1) / СтрокНаСтранице;
			 
			 Если (ЦелаяСтраница = Цел(ЦелаяСтраница))
				 ИЛИ ((ПереноситьПоследнююСтроку = 1) И (Ном = КоличествоСтрок)) Тогда
				 ОбластьИтоги.Параметры.ПоставкаКоличествоПоСтранице  = Формат(ИтогоКоличествоНаСтранице,ФорматВыводаКоличества);
				 ОбластьИтоги.Параметры.ПоставкаМассаБруттоПоСтранице = ИтогоМассаБруттоНаСтранице;
				 ОбластьИтоги.Параметры.ПоставкаСтоимостьПоСтранице   = Формат(ИтогоСуммаНаСтранице,ФорматВыводаСуммы);
				 ОбластьИтоги.Параметры.СуммаНДСПоСтранице            = Формат(ИтогоНДСНаСтранице,ФорматВыводаСуммы);
				 ОбластьИтоги.Параметры.СуммаСНДСПоСтранице           = Формат(ИтогоСНДСНаСтранице,ФорматВыводаСуммы);
				 ТабДокумент.Вывести(ОбластьИтоги);
				 
				 // очистим итоги по странице
				 ИтогоКоличествоНаСтранице	= 0;
				 ИтогоМассаБруттоНаСтранице	= 0;
				 ИтогоСуммаНаСтранице		= 0;
				 ИтогоНДСНаСтранице			= 0;
				 ИтогоСуммаСНДСНаСтранице	= 0;
				 
				 НомерСтраницы = НомерСтраницы + 1;
				 ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				 ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
				 ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
			 КонецЕсли;
			 
			 ОбластьСтрока.Параметры.Заполнить(СтрокаТоваров);
			 ОбластьСтрока.Параметры.ТоварНаименование             = спПолучитьНаименование(СтрокаТоваров.Номенклатура);
			 ОбластьСтрока.Параметры.ТоварКод                      = дкПолучитьЗначениеКолонкиКода(СтрокаТоваров.Номенклатура,ИмяКолонкиКода,ЭтотОбъект);
			 ОбластьСтрока.Параметры.ЕдиницаИзмеренияНаименование  = СтрокаТоваров.ЕдиницаИзмерения;
			 ОбластьСтрока.Параметры.ЕдиницаИзмеренияКодПоОКЕИ     = СтрокаТоваров.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код; 
			 
			 //ОбластьСтрокаТовара.Параметры.ПоставкаКоличествоВОдномМесте = 1;
			 ОбластьСтрока.Параметры.ПоставкаКоличествоВОдномМесте	= Формат(СтрокаТоваров.Коэффициент,ФорматВыводаКоличества);
			 ОбластьСтрока.Параметры.ПоставкаКоличествоМест			= Формат(СтрокаТоваров.КоличествоБазовое,ФорматВыводаКоличества);
			 МассаБруттоСтр											= СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения.Вес * СтрокаТоваров.Количество;
			 ОбластьСтрока.Параметры.ПоставкаМассаБрутто				= МассаБруттоСтр;
			 ОбластьСтрока.Параметры.СуммаСНДС						= Формат(СтрокаТоваров.СуммаВсего,ФорматВыводаСуммы);
			 ОбластьСтрока.Параметры.ПоставкаСтоимость				= Формат(СтрокаТоваров.Сумма,ФорматВыводаСуммы);
			 ОбластьСтрока.Параметры.Цена							= Формат(СтрокаТоваров.Цена,ФорматВыводаСуммы);
			 ОбластьСтрока.Параметры.СуммаНДС						= Формат(СтрокаТоваров.СуммаНДС,ФорматВыводаСуммы);
			 ТабДокумент.Вывести(ОбластьСтрока);
			 
			 // увеличим итоги по странице
			 ИтогоКоличествоНаСтранице  = ИтогоКоличествоНаСтранице  + СтрокаТоваров.КоличествоБазовое;
			 ИтогоМассаБруттоНаСтранице = ИтогоМассаБруттоНаСтранице + МассаБруттоСтр;
			 ИтогоСуммаНаСтранице       = ИтогоСуммаНаСтранице       + СтрокаТоваров.Сумма;
			 ИтогоНДСНаСтранице         = ИтогоНДСНаСтранице         + СтрокаТоваров.СуммаНДС;
			 ИтогоСНДСНаСтранице        = ИтогоСНДСНаСтранице        + СтрокаТоваров.СуммаВсего;
			 
			 // увеличим итоги по странице
			 ИтогоКоличество  = ИтогоКоличество  + СтрокаТоваров.КоличествоБазовое;
			 ИтогоМассаБрутто = ИтогоМассаБрутто + МассаБруттоСтр;
			 ИтогоСумма       = ИтогоСумма       + СтрокаТоваров.Сумма;
			 ИтогоНДС         = ИтогоНДС         + СтрокаТоваров.СуммаНДС;
			 ИтогоСНДС        = ИтогоСНДС        + СтрокаТоваров.СуммаВсего;
		 КонецЦикла;
		 
		 // Выводим итоги по последней странице
		 ОбластьИтоги.Параметры.ПоставкаКоличествоПоСтранице  = Формат(ИтогоКоличествоНаСтранице,ФорматВыводаКоличества);;
		 ОбластьИтоги.Параметры.ПоставкаМассаБруттоПоСтранице = ИтогоМассаБруттоНаСтранице;
		 ОбластьИтоги.Параметры.ПоставкаСтоимостьПоСтранице   = Формат(ИтогоСуммаНаСтранице,ФорматВыводаСуммы);
		 ОбластьИтоги.Параметры.СуммаНДСПоСтранице            = Формат(ИтогоНДСНаСтранице,ФорматВыводаСуммы);
		 ОбластьИтоги.Параметры.СуммаСНДСПоСтранице           = Формат(ИтогоСНДСНаСтранице,ФорматВыводаСуммы);
		 ТабДокумент.Вывести(ОбластьИтоги);
		 
		 // Выводим итоги по всему документу
		 ОбластьВсего.Параметры.ПоставкаКоличество  = Формат(ИтогоКоличество,ФорматВыводаКоличества);
		 ОбластьВсего.Параметры.ПоставкаМассаБрутто = ИтогоМассаБрутто;
		 ОбластьВсего.Параметры.ПоставкаСтоимость   = Формат(ИтогоСумма,ФорматВыводаСуммы);
		 ОбластьВсего.Параметры.СуммаНДС            = Формат(ИтогоНДС,ФорматВыводаСуммы);
		 ОбластьВсего.Параметры.СуммаСНДС           = Формат(ИтогоСНДС,ФорматВыводаСуммы);
		 ТабДокумент.Вывести(ОбластьВсего);
		 
		 ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		 
		 // Выводим подвал документа
		 ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		 ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		 
		 // Комиссия
		 ПредседательКомиссии = дкОтветственноеЛицо(ЭтотОбъект,"ПредседательКомиссии");
		 ОбластьМакета.Параметры.Заполнить(ПредседательКомиссии);
		 
		 ЧленКомиссии1 = дкОтветственноеЛицо(ЭтотОбъект,"ЧленКомиссии1");
		 ОбластьМакета.Параметры.Заполнить(ЧленКомиссии1);
		 
		 ЧленКомиссии2 = дкОтветственноеЛицо(ЭтотОбъект,"ЧленКомиссии2");
		 ОбластьМакета.Параметры.Заполнить(ЧленКомиссии2);
		 
		 // Бухгалтер
		 ГлавныйБухгалтер = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер);
		 ОбластьМакета.Параметры.Заполнить(ГлавныйБухгалтер);
		 
		 // Кладовщик
		 МОЛ = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.МОЛ);
		 ОбластьМакета.Параметры.Заполнить(МОЛ);
		 ТабДокумент.Вывести(ОбластьМакета);
		 
		 // Зададим параметры макета
		 ТабДокумент.ПолеСверху = 0;
		 ТабДокумент.ПолеСлева  = 15;
		 ТабДокумент.ПолеСнизу  = 0;
		 ТабДокумент.ПолеСправа = 0;
		 ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		 
		 Возврат ТабДокумент;
	 КонецФункции // ПечатьТОРГ1()
	 
 // Формирует печатную форму "ТОРГ-2"
	 // 
	 // Параметры:
	 //  ТабДокумент - табличный документ.
	 //
	 // Возвращаемое значение:
	 //  ТабДокумент - возвращает сформированный табличный документ.
	 //
 Функция ПечатьТОРГ2(ТабДокумент) Экспорт
		 Перем тзВрем; // Временная таблица значений
		 Перем ФорматВыводаСуммы; // Строка формата вывода суммы
		 Перем ФорматВыводаКоличества; // Строка формата вывода количества
		 
		 ФорматВыводаСуммы      = обПраво("ФорматВыводаСуммы",     Права,,ЭтотОбъект);
		 ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества",Права,,ЭтотОбъект);
		 
		 // Получим табличную часть за исключением услуг
		 тзВрем = Товары.Выгрузить();
		 тзВрем.Колонки.Добавить("Брутто", Новый ОписаниеТипов("Число",
		 Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)));
		 мсвУдалить = Новый Массив;
		 Для каждого ТекСтрока Из тзВрем Цикл
			 Если ТекСтрока.Номенклатура.ВидНоменклатуры=Перечисления.ВидыНоменклатуры.Услуга Тогда
				 мсвУдалить.Добавить(ТекСтрока);
				 Продолжить;
			 КонецЕсли;
			 ТекСтрока.Брутто = ТекСтрока.Количество * ТекСтрока.ЕдиницаИзмерения.Вес;
		 КонецЦикла;
		 Для каждого ТекСтрока Из мсвУдалить Цикл
			 тзВрем.Удалить(ТекСтрока);	   
		 КонецЦикла;
		 
		 Макет = ПолучитьОбщийМакет("ТОРГ2");
		 
		 ОбластьСтраница1 = Макет.ПолучитьОбласть("ШапкаСтраница1");
		 ОбластьСтраница1.Параметры.Заполнить(ЭтотОбъект);
		 
		 Параметры = Новый Структура;
		 
		 СтруктураПредставления1=Новый Структура(
		 "Наименование,ИНН,КПП,АдресЮридический,ТелефонРабочий",
		 "","ИНН ","КПП ","","тел.: "
		 );
		 СтруктураПредставления2=Новый Структура(
		 "Наименование,ИНН,КПП,АдресФактический,ТелефонРабочий",
		 "","ИНН ","КПП ","","тел.: "
		 );
		 
		 // Правим, что автоматом не заполнилось, или заполнилось неправильно
		 Если НЕ обЗначениеНеЗаполнено(ПодразделениеКомпании) И НЕ обЗначениеНеЗаполнено(ПодразделениеКомпании.КПП) Тогда
			 СтрокаПредставления = спПолучитьПредставление(Организация, СтруктураПредставления1);
			 Параметры.Вставить("ОрганизацияПредставление", СтрЗаменить(СтрокаПредставления, Организация.КПП, ПодразделениеКомпании.КПП));
		 Иначе	
			 Параметры.Вставить("ОрганизацияПредставление", спПолучитьПредставление(Организация, СтруктураПредставления1));
		 КонецЕсли;
		 Параметры.Вставить("КодПоОКПО",				 Организация.КодПоОКПО);
		 Параметры.Вставить("ВидДеятельностиПоОКДП",	 Организация.КодПоОКДП);
		 
		 Параметры.Вставить("ПредставлениеДокумента", дкПолучитьПредставление(Ссылка));
		 Параметры.Вставить("Номер",	 дкПолучитьНомерДляПечати(ЭтотОбъект));
		 Параметры.Вставить("Дата",	 Дата);
		 
		 
		 ДатаОтправления = обПолучитьЗначениеСвойства(ЭтотОбъект, ПланыВидовХарактеристик.СвойстваОбъектов.ДатаОтправления, "");
		 Если ДатаОтправления<>"" Тогда
			 ДатаОтправления = "Дата отправления товара: " + Формат(ДатаОтправления, "ДЛФ=DD");
		 Иначе
			 ДатаОтправления = "Дата отправления товара " + " ""_______""  _____________________ _______ г.";
		 КонецЕсли;
		 
		 Параметры.Вставить("ДатаОтправления", ДатаОтправления);
		 
		 
		 // Счет-фактура, если есть.
		 МассивВидов=Новый Массив(1); МассивВидов[0]="СчетФактураПолученный"; 
		 МассивПодчиненных = дкПолучитьМассивПодчиненных(Ссылка, МассивВидов);
		 Если МассивПодчиненных.Количество()>0 Тогда
			 // нашли
			 СФ=МассивПодчиненных[0].Ссылка;
			 Попытка
				 НомерСФ = дкПолучитьНомерДляПечати(СФ);
				 ДатаСФ  = Формат(СФ.Дата, "ДЛФ=DD");
			 Исключение
				 НомерСФ = "";
				 ДатаСФ  = """" + "_______"  + """" + "  __________________________  " + "__________ г.";
			 КонецПопытки; 
		 Иначе
			 НомерСФ = "";
			 ДатаСФ  = """" + "_______"  + """" + "  __________________________  " + "__________ г.";
		 КонецЕсли; 
		 
		 Параметры.Вставить("НомерСФ", НомерСФ);
		 Параметры.Вставить("ДатаСФ",  ДатаСФ);
		 
		 ОбластьСтраница1.Параметры.Заполнить(Параметры);
		 
		 ТабДокумент.Вывести(ОбластьСтраница1);
		 ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		 
		 // ВТОРАЯ СТРАНИЦА
		 НомерСтраницы     = 3;
		 НомерСтраницыПред = НомерСтраницы;
		 
		 ОбластьНомерСтроки = Макет.ПолучитьОбласть("НомерСтраницы");
		 ОбластьНомерСтроки.Параметры.НомерСтраницы = "Страница: " + 2; 
		 ТабДокумент.Вывести(ОбластьНомерСтроки);
		 
		 ОбластьСтраница2   = Макет.ПолучитьОбласть("ШапкаСтраница2"); 
		 ОбластьСтраница2.Параметры.КоличествоМестПоДокументу = Формат(тзВрем.Итог("КоличествоБазовое"), ФорматВыводаКоличества);
		 ОбластьСтраница2.Параметры.Брутто                    = Формат(тзВрем.Итог("Брутто"),           ФорматВыводаКоличества);    
		 ТабДокумент.Вывести(ОбластьСтраница2);
		 
		 // ВЫВОДИМ ТАБЛИЧНУЮ ЧАСТЬ
		 ОбластьШапкаТЧ = Макет.ПолучитьОбласть("ШапкаТабличнойЧасти"); 
		 ТабДокумент.Вывести(ОбластьШапкаТЧ);
		 // Для последующего вывода
		 ОбластьШапкаТЧ.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
		 
		 // получаем макет строки
		 ОбластьСтрока = Макет.ПолучитьОбласть("Строка1");
		 
		 //перебор строк
		 ВыборкаТабличнойЧасти = Товары;
		 Для каждого СтрокаТабличнойЧасти Из тзВрем Цикл
			 
			 //заполняем данные строки
			 СтруктураСтроки = дкПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТабличнойЧасти,ЭтотОбъект);
			 ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);
			 
			 // Рассчитаем цену.
			 ОбластьСтрока.Параметры.Цена = Формат(СтрокаТабличнойЧасти.СуммаВсего / СтрокаТабличнойЧасти.Количество, ФорматВыводаСуммы);
			 
			 ОбластьСтрока.Параметры.КодЕдиницыПоОКЕИ = "" + СокрЛП(СтруктураСтроки.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код);
			 ОбластьСтрока.Параметры.Артикул          = "" + СтруктураСтроки.Номенклатура.Артикул;
			 
			 //выводим строку, делая проверку попадания на лист
			 НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрока, ОбластьШапкаТЧ, , НомерСтраницы, ,ЭтотОбъект);  		
			 
			 //инициализация итогов по странице
			 Если НомерСтраницы <> НомерСтраницыПред Тогда
				 НомерСтраницыПред = НомерСтраницы;
				 ОбластьШапкаТЧ.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			 КонецЕсли; 		
		 КонецЦикла;
		 
		 
		 // ВЫВОДИМ 3-Ю СТРАНИЦУ
		 ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
		 ОбластьНомерСтроки = Макет.ПолучитьОбласть("НомерСтраницы");
		 ОбластьНомерСтроки.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		 ТабДокумент.Вывести(ОбластьНомерСтроки);
		 
		 ОбластьСтраница3   = Макет.ПолучитьОбласть("ШапкаСтраница3"); 	
		 ТабДокумент.Вывести(ОбластьСтраница3);
		 
		 НомерСтраницы = НомерСтраницы + 1;
		 
		 // ВЫВОДИМ ПРОДОЛЖЕНИЕ ТАБЛИЧНОЙ ЧАСТИ
		 ОбластьШапкаТЧ = Макет.ПолучитьОбласть("ШапкаТабличнойЧасти2"); 
		 ТабДокумент.Вывести(ОбластьШапкаТЧ);
		 // Для последующего вывода
		 ОбластьШапкаТЧ.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
		 
		 // получаем макет строки
		 ОбластьСтрока = Макет.ПолучитьОбласть("Строка2");
		 
		 //перебор строк
		 Для каждого СтрокаТабличнойЧасти Из тзВрем Цикл
			 //заполняем данные строки
			 СтруктураСтроки = дкПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТабличнойЧасти,ЭтотОбъект);
			 ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);		
			 ОбластьСтрока.Параметры.Артикул = "" + СтруктураСтроки.Номенклатура.Артикул;
			 
			 //выводим строку, делая проверку попадания на лист
			 НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрока, ОбластьШапкаТЧ, , НомерСтраницы, ,ЭтотОбъект);  		
			 
			 //инициализация итогов по странице
			 Если НомерСтраницы <> НомерСтраницыПред Тогда
				 НомерСтраницыПред = НомерСтраницы;
				 ОбластьШапкаТЧ.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			 КонецЕсли; 		
		 КонецЦикла;
		 
		 
		 // ВЫВОДИМ 4-Ю СТРАНИЦУ
		 ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		 ОбластьНомерСтроки = Макет.ПолучитьОбласть("НомерСтраницы");
		 ОбластьНомерСтроки.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		 ТабДокумент.Вывести(ОбластьНомерСтроки);
		 
		 ОбластьСтраница4 = Макет.ПолучитьОбласть("ШапкаСтраница4");
		 
		 ГлавныйБухгалтер = дкОтветственноеЛицо(ЭтотОбъект,"ГлавныйБухгалтер");
		 ОбластьСтраница4.Параметры.Заполнить(ГлавныйБухгалтер);
		 
		 // Комиссия
		 ПредседательКомиссии = дкОтветственноеЛицо(ЭтотОбъект,"ПредседательКомиссии");
		 ОбластьСтраница4.Параметры.Заполнить(ПредседательКомиссии);
		 
		 ЧленКомиссии1 = дкОтветственноеЛицо(ЭтотОбъект,"ЧленКомиссии1");
		 ОбластьСтраница4.Параметры.Заполнить(ЧленКомиссии1);
		 
		 ЧленКомиссии2 = дкОтветственноеЛицо(ЭтотОбъект,"ЧленКомиссии2");
		 ОбластьСтраница4.Параметры.Заполнить(ЧленКомиссии2);
		 
		 ТабДокумент.Вывести(ОбластьСтраница4); 
		 
		 
		 // Зададим параметры макета
		 ТабДокумент.ПолеСверху = 0;
		 ТабДокумент.ПолеСлева  = 15;
		 ТабДокумент.ПолеСнизу  = 0;
		 ТабДокумент.ПолеСправа = 0;
		 ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		 
		 Возврат ТабДокумент;	
	 КонецФункции // ПечатьТОРГ2()
	 
 // Формирует печатную форму "ТОРГ-4"
	 // 
	 // Параметры:
	 //  ТабДокумент - табличный документ.
	 //
	 // Возвращаемое значение:
	 //  ТабДокумент - возвращает сформированный табличный документ.
	 //
 Функция ПечатьТОРГ4(ТабДокумент) Экспорт
		 Макет = ПолучитьОбщийМакет("ТОРГ4");
		 
		 ФорматВыводаСуммы      = обПраво("ФорматВыводаСуммы",     Права,,ЭтотОбъект);
		 ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества",Права,,ЭтотОбъект);
		 
		 ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		 ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		 
		 СтруктураПредставления1=Новый Структура(
		 "Наименование,ИНН,АдресЮридический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		 "","ИНН ","","тел.: ","р/с ","в банке ","БИК ","к/с "
		 );
		 СтруктураПредставления2=Новый Структура(
		 "Наименование,ИНН,АдресФактический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		 "","ИНН ","","тел.: ","р/с ","в банке ","БИК ","к/с "
		 );
		 
		 ОбластьМакета.Параметры.ОрганизацияПредставление		= спПолучитьПредставление(ОбластьМакета.Параметры.Организация,СтруктураПредставления1);
		 ОбластьМакета.Параметры.ОрганизацияПоОКПО 				= ЭтотОбъект.Организация.КодПоОКПО;
		 ОбластьМакета.Параметры.ПодразделениеКомпании			= ЭтотОбъект.ПодразделениеКомпании;
		 ОбластьМакета.Параметры.ПоставщикПредставление			= спПолучитьПредставление(ЭтотОбъект.Сотрудник,СтруктураПредставления1);
		 ОбластьМакета.Параметры.Поставщик						= ЭтотОбъект.Сотрудник;
		 
		 ОбластьМакета.Параметры.Грузоотправитель				= обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузоотправитель",ЭтотОбъект.Сотрудник);
		 ОбластьМакета.Параметры.ГрузоотправительПредставление	= спПолучитьПредставление(ОбластьМакета.Параметры.Грузоотправитель,СтруктураПредставления2);
		 
		 ОбластьМакета.Параметры.Номер			= ?(обЗначениеНеЗаполнено(ЭтотОбъект.ВхДокНомер),дкПолучитьНомерДляПечати(ЭтотОбъект), ЭтотОбъект.ВхДокНомер);
		 ОбластьМакета.Параметры.Дата			= ?(обЗначениеНеЗаполнено(ЭтотОбъект.ВхДокНомер),ЭтотОбъект.Дата, ЭтотОбъект.ВхДокДата);
		 ОбластьМакета.Параметры.МестоПриемки	= ЭтотОбъект.СкладКомпании;
		 
		 // Заполним информацию о руководителе организации
		 Руководитель = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.Руководитель);
		 ОбластьМакета.Параметры.Заполнить(Руководитель);
		 
		 ТабДокумент.Вывести(ОбластьМакета);
		 
		 //переменные управляющие постраничным выводом
		 СтрокНаСтранице = 23;
		 СтрокШапки      = 20;
		 СтрокПодвала    = 7;
		 НомерСтраницы   = 1;
		 
		 ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		 ОбластьСтрока           = Макет.ПолучитьОбласть("Строка");
		 ОбластьИтоги            = Макет.ПолучитьОбласть("ИтогиПоСтранице");
		 ОбластьВсего            = Макет.ПолучитьОбласть("Всего");
		 
		 ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
		 ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
		 
		 ВыборкаСтрок = ЭтотОбъект.Товары;
		 
		 КоличествоСтрок = ВыборкаСтрок.Количество();
		 Если КоличествоСтрок = 1 Тогда
			 ПереноситьПоследнююСтроку = 0;
		 Иначе
			 ЦелыхСтраницСПодвалом     = Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
			 ЦелыхСтраницБезПодвала    = Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
			 ПереноситьПоследнююСтроку = ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
		 КонецЕсли;
		 
		 // Определим имя показываемой колонки кода
		 ИмяКолонкиКода = дкПолучитьПараметрыРежимаВыводаКодаВДокументах(,ЭтотОбъект).Имя;
		 
		 // инициализация итогов по странице
		 ИтогоМассаБруттоПоСтранице = 0;
		 ИтогоКоличествоПоСтранице  = 0;
		 ИтогоСуммаПоСтранице       = 0;
		 
		 // инициализация итогов по документу
		 ИтогоМассаБрутто = 0;
		 ИтогоКоличество  = 0;
		 ИтогоСумма       = 0;
		 Ном              = 0;
		 
		 // Выводим многострочную часть документа
		 Для каждого СтрокаТоваров Из ВыборкаСтрок Цикл
			 Ном = Ном + 1;
			 ЦелаяСтраница = (СтрокШапки + Ном - 1) / СтрокНаСтранице;
			 
			 Если (ЦелаяСтраница = Цел(ЦелаяСтраница))
				 ИЛИ ((ПереноситьПоследнююСтроку = 1) И (Ном = КоличествоСтрок)) Тогда
				 ОбластьИтоги.Параметры.ИтогоМассаБруттоПоСтранице = ИтогоМассаБруттоПоСтранице;
				 ОбластьИтоги.Параметры.ИтогоШтукПоСтранице        = Формат(ИтогоКоличествоПоСтранице,ФорматВыводаКоличества);
				 ОбластьИтоги.Параметры.ИтогоСтоимостьПоСтранице   = Формат(ИтогоСуммаПоСтранице,ФорматВыводаСуммы);
				 ТабДокумент.Вывести(ОбластьИтоги);
				 
				 // очистим итоги по странице
				 ИтогоБруттоПоСтранице     = 0;
				 ИтогоКоличествоПоСтранице = 0;
				 ИтогоСуммаПоСтранице      = 0;
				 
				 НомерСтраницы = НомерСтраницы + 1;
				 ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				 ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
				 ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
			 КонецЕсли;
			 
			 ОбластьСтрока.Параметры.Заполнить(СтрокаТоваров);
			 ОбластьСтрока.Параметры.ТоварНаименование				= спПолучитьНаименование(СтрокаТоваров.Номенклатура);
			 ОбластьСтрока.Параметры.ТоварКод						= дкПолучитьЗначениеКолонкиКода(СтрокаТоваров.Номенклатура,ИмяКолонкиКода,ЭтотОбъект);
			 ОбластьСтрока.Параметры.ЕдиницаИзмеренияНаименование	= СтрокаТоваров.ЕдиницаИзмерения;
			 ОбластьСтрока.Параметры.ЕдиницаИзмеренияКодПоОКЕИ		= СтрокаТоваров.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;
			 
			 МассаБруттоСтр											= СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения.Вес * СтрокаТоваров.Количество;
			 ОбластьСтрока.Параметры.МассаБрутто						= МассаБруттоСтр;
			 ОбластьСтрока.Параметры.КоличествоМест					= Формат(СтрокаТоваров.Количество,ФорматВыводаКоличества);
			 ОбластьСтрока.Параметры.КоличествоВОдномМесте			= Формат(СтрокаТоваров.Коэффициент,ФорматВыводаКоличества);
			 ОбластьСтрока.Параметры.КоличествоШтук					= Формат(СтрокаТоваров.КоличествоБазовое,ФорматВыводаКоличества);
			 ОбластьСтрока.Параметры.Цена							= Формат(СтрокаТоваров.Цена,ФорматВыводаСуммы);
			 ОбластьСтрока.Параметры.Стоимость						= Формат(СтрокаТоваров.Сумма,ФорматВыводаСуммы);
			 ТабДокумент.Вывести(ОбластьСтрока);
			 
			 // увеличим итоги по странице
			 ИтогоМассаБруттоПоСтранице = ИтогоМассаБруттоПоСтранице + МассаБруттоСтр;
			 ИтогоКоличествоПоСтранице  = ИтогоКоличествоПоСтранице  + СтрокаТоваров.КоличествоБазовое;
			 ИтогоСуммаПоСтранице       = ИтогоСуммаПоСтранице       + СтрокаТоваров.Сумма;
			 
			 // увеличим итоги по документу
			 ИтогоМассаБрутто = ИтогоМассаБрутто + МассаБруттоСтр;
			 ИтогоКоличество  = ИтогоКоличество  + СтрокаТоваров.КоличествоБазовое;
			 ИтогоСумма       = ИтогоСумма       + СтрокаТоваров.Сумма;
		 КонецЦикла;
		 
		 // Выводим итоги по последней странице
		 ОбластьИтоги.Параметры.ИтогоМассаБруттоПоСтранице = ИтогоМассаБруттоПоСтранице;
		 ОбластьИтоги.Параметры.ИтогоШтукПоСтранице        = Формат(ИтогоКоличествоПоСтранице,ФорматВыводаКоличества);
		 ОбластьИтоги.Параметры.ИтогоСтоимостьПоСтранице   = Формат(ИтогоСуммаПоСтранице,ФорматВыводаСуммы);
		 ТабДокумент.Вывести(ОбластьИтоги);
		 
		 // Выводим итоги по документу в целом
		 ОбластьВсего.Параметры.ИтогоМассаБрутто = ИтогоМассаБрутто;
		 ОбластьВсего.Параметры.ИтогоШтук        = Формат(ИтогоКоличество,ФорматВыводаКоличества);
		 ОбластьВсего.Параметры.ИтогоСтоимость   = Формат(ИтогоСумма,ФорматВыводаСуммы);
		 ТабДокумент.Вывести(ОбластьВсего);
		 
		 // Выводим подвал документа
		 ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		 ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		 
		 // Комиссия
		 ПредседательКомиссии = дкОтветственноеЛицо(ЭтотОбъект,"ПредседательКомиссии");
		 ОбластьМакета.Параметры.Заполнить(ПредседательКомиссии);
		 
		 ЧленКомиссии1 = дкОтветственноеЛицо(ЭтотОбъект,"ЧленКомиссии1");
		 ОбластьМакета.Параметры.Заполнить(ЧленКомиссии1);
		 
		 ЧленКомиссии2 = дкОтветственноеЛицо(ЭтотОбъект,"ЧленКомиссии2");
		 ОбластьМакета.Параметры.Заполнить(ЧленКомиссии2);
		 
		 // Кладовщик
		 МОЛ = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.МОЛ);
		 ОбластьМакета.Параметры.Заполнить(МОЛ);
		 
		 ТабДокумент.Вывести(ОбластьМакета);
		 
		 // Зададим параметры макета
		 ТабДокумент.ПолеСверху = 0;
		 ТабДокумент.ПолеСлева  = 15;
		 ТабДокумент.ПолеСнизу  = 0;
		 ТабДокумент.ПолеСправа = 0;
		 ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		 
		 Возврат ТабДокумент;
	 КонецФункции // ПечатьТОРГ4()
	 
 // Формирует печатную форму "ТОРГ13"
	 // 
	 // Параметры:
	 //  ТабДокумент - табличный документ.
	 //
	 // Возвращаемое значение:
	 //  ТабДокумент - возвращает сформированный табличный документ.
	 //
 Функция ПечатьТОРГ13(ТабДокумент) Экспорт
		 Макет = ПолучитьОбщийМакет("ТОРГ13");
		 
		 ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
		 ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества",Права,,ЭтотОбъект);
		 
		 СтруктураПредставления=Новый Структура(
		 "Наименование,ИНН,АдресЮридический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		 "","ИНН ","","тел.: ","р/с ","в банке ","БИК ","к/с "
		 );
		 
		 ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		 ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		 ОбластьМакета.Параметры.ОрганизацияПредставление	= спПолучитьПредставление(ЭтотОбъект.Организация,СтруктураПредставления);
		 ОбластьМакета.Параметры.ОрганизацияПоОКПО			= ЭтотОбъект.Организация.КодПоОКПО;
		 ОбластьМакета.Параметры.ОтправительПодразделение	= обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузоотправитель",ЭтотОбъект.Сотрудник);
		 ОбластьМакета.Параметры.ПолучательПодразделение		= обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузополучатель",ЭтотОбъект.СкладКомпании);
		 ОбластьМакета.Параметры.Номер = дкПолучитьНомерДляПечати(ЭтотОбъект);
		 ТабДокумент.Вывести(ОбластьМакета);
		 
		 СтрокНаСтранице = 25;
		 СтрокШапки      = 12;
		 СтрокПодвала    = 5;
		 НомерСтраницы   = 1;
		 
		 // Выводим заголовок таблицы
		 ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		 ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
		 ТабДокумент.Вывести(ЗаголовокТаблицы);
		 
		 ВыборкаСтрокТовары = ЭтотОбъект.Товары.Выгрузить();
		 
		 КоличествоСтрок = ВыборкаСтрокТовары.Количество();
		 Если КоличествоСтрок = 1 Тогда
			 ПереноситьПоследнююСтроку	= 0;
		 Иначе
			 ЦелыхСтраницСПодвалом		= Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
			 ЦелыхСтраницБезПодвала		= Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
			 ПереноситьПоследнююСтроку	= ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
		 КонецЕсли;
		 
		 // Определим имя показываемой колонки кода
		 ИмяКолонкиКода = дкПолучитьПараметрыРежимаВыводаКодаВДокументах(,ЭтотОбъект).Имя;
		 
		 // инициализация итогов по странице
		 ИтогКоличествоМестПоСтранице = 0;
		 ИтогМассаБруттоПоСтранице    = 0;
		 ИтогМассыНеттоПоСтранице     = 0;
		 ИтогСуммыПоСтранице          = 0;
		 
		 // инициализация итогов по документу
		 ИтогоКоличество  = 0;
		 ИтогоМассаБрутто = 0;
		 ИтогоМассаНетто  = 0;
		 ИтогоСумма       = 0;
		 Ном = 0;
		 
		 // Выводим многострочную часть документа
		 ОбластьИтоговПоСтранице	= Макет.ПолучитьОбласть("ИтогиПоСтранице");
		 ОбластьМакета			= Макет.ПолучитьОбласть("Строка");
		 
		 Для каждого СтрокаТовар Из ВыборкаСтрокТовары Цикл
			 Ном = Ном + 1;
			 ЦелаяСтраница	= (СтрокШапки + Ном - 1) / СтрокНаСтранице;
			 
			 Если (ЦелаяСтраница = Цел(ЦелаяСтраница))
				 ИЛИ ((ПереноситьПоследнююСтроку = 1) И (Ном = КоличествоСтрок)) Тогда
				 ОбластьИтоговПоСтранице.Параметры.ИтогКоличествоМестПоСтранице = Формат(ИтогКоличествоМестПоСтранице,ФорматВыводаКоличества);
				 ОбластьИтоговПоСтранице.Параметры.ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице;
				 ОбластьИтоговПоСтранице.Параметры.ИтогМассыНеттоПоСтранице     = ИтогМассыНеттоПоСтранице;
				 ОбластьИтоговПоСтранице.Параметры.ИтогСуммыПоСтранице          = Формат(ИтогСуммыПоСтранице,ФорматВыводаСуммы);
				 ТабДокумент.Вывести(ОбластьИтоговПоСтранице);
				 
				 // инициализация итогов по странице
				 ИтогКоличествоМестПоСтранице = 0;
				 ИтогМассаБруттоПоСтранице    = 0;
				 ИтогМассаНеттоПоСтранице     = 0;
				 ИтогСуммыПоСтранице          = 0;
				 
				 НомерСтраницы = НомерСтраницы + 1;
				 ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				 ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
				 ТабДокумент.Вывести(ЗаголовокТаблицы);
			 КонецЕсли;
			 
			 ОбластьМакета.Параметры.Заполнить(СтрокаТовар);
			 ОбластьМакета.Параметры.ТоварНаименование			= спПолучитьНаименование(СтрокаТовар.Номенклатура);
			 ОбластьМакета.Параметры.ТоварКод					= дкПолучитьЗначениеКолонкиКода(СтрокаТовар.Номенклатура,ИмяКолонкиКода,ЭтотОбъект);
			 ОбластьМакета.Параметры.ЕдиницаИзмерения			= СтрокаТовар.ЕдиницаИзмерения;
			 ОбластьМакета.Параметры.ЕдиницаИзмеренияКодПоОКЕИ	= СтрокаТовар.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;
			 
			 ОбластьМакета.Параметры.КоличествоВОдномМесте		= Формат(СтрокаТовар.Коэффициент,ФорматВыводаКоличества);
			 ОбластьМакета.Параметры.КоличествоМест				= Формат(СтрокаТовар.Количество,ФорматВыводаКоличества);
			 МассаБруттоСтр										= СтрокаТовар.Номенклатура.ОсновнаяЕдиницаИзмерения.Вес * СтрокаТовар.Количество;
			 ОбластьМакета.Параметры.МассаБрутто					= МассаБруттоСтр;
			 Сумма												= СтрокаТовар.Количество * СтрокаТовар.Цена - ?(ЭтотОбъект.ТипЦен.ЦенаВключаетНДС,СтрокаТовар.СуммаНДС,0);
			 ОбластьМакета.Параметры.Цена						= Формат(Сумма/(СтрокаТовар.Количество),ФорматВыводаСуммы);
			 ОбластьМакета.Параметры.Сумма						= Формат(Сумма,ФорматВыводаСуммы);
			 
			 ТабДокумент.Вывести(ОбластьМакета);
			 
			 // Обновим итоги по странице
			 ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице + СтрокаТовар.Количество;
			 ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице    + МассаБруттоСтр;
			 ИтогМассыНеттоПоСтранице     = ИтогМассыНеттоПоСтранице     + 0;
			 ИтогСуммыПоСтранице          = ИтогСуммыПоСтранице          + Сумма;
			 
			 // Обновим итоги по документу
			 ИтогоКоличество  = ИтогоКоличество  + СтрокаТовар.Количество;
			 ИтогоМассаБрутто = ИтогоМассаБрутто + МассаБруттоСтр;
			 ИтогоМассаНетто  = ИтогоМассаНетто  + 0;
			 ИтогоСумма       = ИтогоСумма       + Сумма;
		 КонецЦикла;
		 
		 ОбластьИтоговПоСтранице.Параметры.ИтогКоличествоМестПоСтранице = Формат(ИтогКоличествоМестПоСтранице,ФорматВыводаКоличества);
		 ОбластьИтоговПоСтранице.Параметры.ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице;
		 ОбластьИтоговПоСтранице.Параметры.ИтогМассыНеттоПоСтранице     = ИтогМассыНеттоПоСтранице;
		 ОбластьИтоговПоСтранице.Параметры.ИтогСуммыПоСтранице          = Формат(ИтогСуммыПоСтранице,ФорматВыводаКоличества);
		 ТабДокумент.Вывести(ОбластьИтоговПоСтранице);
		 
		 // Выводим итоги по документу в целом
		 ОбластьМакета = Макет.ПолучитьОбласть("Всего");
		 ОбластьМакета.Параметры.ИтогоКоличествоМест = Формат(ИтогоКоличество,ФорматВыводаКоличества);
		 ОбластьМакета.Параметры.ИтогоМассаБрутто    = ИтогоМассаБрутто;
		 ОбластьМакета.Параметры.ИтогоМассаНетто     = ИтогоМассаНетто;
		 ОбластьМакета.Параметры.ИтогоСумма          = Формат(ИтогоСумма,ФорматВыводаСуммы);
		 ТабДокумент.Вывести(ОбластьМакета);
		 
		 // Выводим подвал документа
		 ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		 ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		 // текст без копеек (не Сто 00   , а   просто Сто)
		 ПараметрыПрописиНаРусскомОбщ = ЭтотОбъект.ВалютаДокумента.ПараметрыПрописиНаРусском;
		 ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусскомОбщ, "1", "0");
		 ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "2", "0");
		 ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "3", "0");
		 ОбластьМакета.Параметры.ИтогоСуммаПрописью = ЧислоПрописью(Цел(ИтогоСумма), "L=ru_RU; НП=Ложь; НД=Ложь", ПараметрыПрописиНаРусском);
		 //ОбластьМакета.Параметры.ИтогоСуммаКоп      = Формат(Цел((ИтогоСумма-Цел(ИтогоСумма))*100), "ЧЦ=2; ЧН=00");
		 
		 ОбщаяСумма = ЧислоПрописью(ИтогоСумма, "L=ru_RU; НП=Ложь; НД=Истина", ПараметрыПрописиНаРусскомОбщ);
		 ОбластьМакета.Параметры.ИтогоСуммаКоп      = СокрЛП(СтрЗаменить(ОбщаяСумма,ОбластьМакета.Параметры.ИтогоСуммаПрописью,""));
		 
		 Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"ОтпустилКонтрагент");
		 Отпустил.Вставить("ОтпустилПредставление", Отпустил.ОтпустилКонтрагентПредставление);
		 ОбластьМакета.Параметры.Заполнить(Отпустил);
		 
		 Получил = дкОтветственноеЛицо(ЭтотОбъект,"Получил");
		 ОбластьМакета.Параметры.Заполнить(Получил);
		 
		 ТабДокумент.Вывести(ОбластьМакета);
		 
		 // Зададим параметры макета
		 ТабДокумент.ПолеСверху = 0;
		 ТабДокумент.ПолеСлева  = 15;
		 ТабДокумент.ПолеСнизу  = 0;
		 ТабДокумент.ПолеСправа = 0;
		 ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		 
		 Возврат ТабДокумент;
	 КонецФункции // ПечатьТОРГ13()
	 
 // Формирует печатную форму "М-4"
	 // 
	 // Параметры:
	 //  ТабДокумент - табличный документ.
	 //
	 // Возвращаемое значение:
	 //  ТабДокумент - возвращает сформированный табличный документ.
	 //
 Функция ПечатьМ4(ТабДокумент) Экспорт
		 Макет = ПолучитьОбщийМакет("М4");
		 
		 ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
		 ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества",Права,,ЭтотОбъект);
		 
		 // выводим шапку
		 ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		 ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		 
		 СтруктураПредставления=Новый Структура(
		 "Наименование,ИНН,АдресЮридический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		 "","ИНН ","","тел.: ","р/с ","в банке ","БИК ","к/с "
		 );
		 
		 // Правим, что автоматом не заполнилось, или заполнилось неправильно
		 ОбластьМакета.Параметры.ОрганизацияПредставление= спПолучитьПредставление(ОбластьМакета.Параметры.Организация,СтруктураПредставления);
		 ОбластьМакета.Параметры.ОрганизацияПоОКПО		= Организация.КодПоОКПО;
		 ОбластьМакета.Параметры.Номер = дкПолучитьНомерДляПечати(ЭтотОбъект);
		 ТабДокумент.Вывести(ОбластьМакета);
		 
		 // выводим заголовок документа
		 ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокДокумента");
		 ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		 ОбластьМакета.Параметры.ДатаСоставления			= Формат(Дата, "ДФ = дд.ММ.гггг");
		 ОбластьМакета.Параметры.МестоПриемки			= ДилерскийЦентр;
		 СтраховаяКомпания = дкОтветственноеЛицо(ЭтотОбъект,"СтраховаяКомпания");
		 ОбластьМакета.Параметры.Заполнить(СтраховаяКомпания);
		 ТабДокумент.Вывести(ОбластьМакета);
		 
		 //переменные управляющие постраничным выводом
		 СтрокНаСтранице = 23;
		 СтрокШапки      = 10;
		 СтрокПодвала    = 6;
		 НомерСтраницы   = 1;		
		 
		 ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		 ОбластьСтрока           = Макет.ПолучитьОбласть("Строка");
		 ОбластьИтогиПоСтранице  = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		 ОбластьПодвалСтраницы=Макет.ПолучитьОбласть("ПодвалСтраницы");
		 
		 // выводим заголовок таблицы
		 ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
		 ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
		 
		 ВыборкаСтрок = ЭтотОбъект.Товары;
		 
		 КоличествоСтрок = ВыборкаСтрок.Количество();
		 Если КоличествоСтрок = 1 Тогда
			 ПереноситьПоследнююСтроку = 0;
		 Иначе
			 ЦелыхСтраницСПодвалом     = Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
			 ЦелыхСтраницБезПодвала    = Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
			 ПереноситьПоследнююСтроку = ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
		 КонецЕсли;
		 
		 // Определим имя показываемой колонки кода
		 ИмяКолонкиКода = дкПолучитьПараметрыРежимаВыводаКодаВДокументах(,ЭтотОбъект).Имя;
		 
		 // инициализация итогов по странице
		 ИтогоКоличествоПринятоПоСтранице = 0;
		 ИтогоСуммаБезНДСПоСтранице       = 0;
		 ИтогоСуммаНДСПоСтранице 		 = 0;
		 ИтогоВсегоСНДСПоСтранице		 = 0;
		 Ном 							 = 0;
		 
		 // инициализация итогов по документу
		 ИтогоКоличествоПринято 	= 0;
		 ИтогоСуммаБезНДС       	= 0;
		 ИтогоСуммаНДС		   	= 0;
		 ИтогоВсегоСНДС			= 0;
		 
		 // проверим, входит ли НДС в стоимость	
		 ЦенаВключаетНДС = ТипЦен.ЦенаВключаетНДС;
		 
		 // Выводим многострочную часть документа
		 Для каждого СтрокаТабличнойЧасти Из ВыборкаСтрок Цикл
			 Ном = Ном + 1;
			 ЦелаяСтраница = (СтрокШапки + Ном - 1) / СтрокНаСтранице;
			 
			 Если (ЦелаяСтраница = Цел(ЦелаяСтраница))
				 ИЛИ ((ПереноситьПоследнююСтроку = 1) И (Ном = КоличествоСтрок)) Тогда
				 ОбластьИтогиПоСтранице.Параметры.ИтогоКоличествоПринято = Формат(ИтогоКоличествоПринятоПоСтранице,ФорматВыводаКоличества);
				 ОбластьИтогиПоСтранице.Параметры.ИтогоСуммаБезНДС = Формат(ИтогоСуммаБезНДСПоСтранице,ФорматВыводаСуммы);
				 ОбластьИтогиПоСтранице.Параметры.ИтогоСуммаНДС = Формат(ИтогоСуммаНДСПоСтранице,ФорматВыводаСуммы);
				 ОбластьИтогиПоСтранице.Параметры.ИтогоВсегоСНДС = Формат(ИтогоВсегоСНДСПоСтранице,ФорматВыводаСуммы);
				 ТабДокумент.Вывести(ОбластьИтогиПоСтранице);
				 ТабДокумент.Вывести(ОбластьПодвалСтраницы);
				 
				 // очистим итоги по странице
				 ИтогоКоличествоПринятоПоСтранице = 0;
				 ИтогоСуммаБезНДСПоСтранице       = 0;
				 ИтогоСуммаНДСПоСтранице 		 = 0;
				 ИтогоВсегоСНДСПоСтранице		 = 0;
				 
				 НомерСтраницы = НомерСтраницы + 1;
				 ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				 ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
				 ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
			 КонецЕсли;
			 
			 ОбластьСтрока.Параметры.Заполнить(СтрокаТабличнойЧасти);
			 ОбластьСтрока.Параметры.ТоварНаименование				= спПолучитьНаименование(СтрокаТабличнойЧасти.Номенклатура);
			 ОбластьСтрока.Параметры.ТоварКод						= дкПолучитьЗначениеКолонкиКода(СтрокаТабличнойЧасти.Номенклатура,ИмяКолонкиКода,ЭтотОбъект);
			 ОбластьСтрока.Параметры.ЕдиницаИзмеренияКод				= СтрокаТабличнойЧасти.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;
			 ОбластьСтрока.Параметры.ЕдиницаИзмеренияНаименование	= СтрокаТабличнойЧасти.ЕдиницаИзмерения;
			 ОбластьСтрока.Параметры.КоличествоПринято				= Формат(СтрокаТабличнойЧасти.Количество,ФорматВыводаКоличества);
			 ОбластьСтрока.Параметры.Цена		= Формат(СтрокаТабличнойЧасти.Цена - СтрокаТабличнойЧасти.СуммаНДС/СтрокаТабличнойЧасти.Количество,ФорматВыводаСуммы);
			 ОбластьСтрока.Параметры.ВсегоСНДС		= Формат(СтрокаТабличнойЧасти.СуммаВсего,ФорматВыводаСуммы);
			 ТабДокумент.Вывести(ОбластьСтрока);
			 
			 
			 // увеличим итоги по документу
			 ИтогоКоличествоПринято	= ИтогоКоличествоПринято + СтрокаТабличнойЧасти.Количество;
			 ИтогоВсегоСНДС			= ИтогоВсегоСНДС + СтрокаТабличнойЧасти.СуммаВсего;
			 
		 КонецЦикла;
		 
		 // выводим итоги по последней странице
		 ОбластьИтогиПоСтранице.Параметры.ИтогоКоличествоПринято = Формат(ИтогоКоличествоПринятоПоСтранице,ФорматВыводаКоличества);
		 ОбластьИтогиПоСтранице.Параметры.ИтогоСуммаБезНДС = Формат(ИтогоСуммаБезНДСПоСтранице,ФорматВыводаСуммы);
		 ОбластьИтогиПоСтранице.Параметры.ИтогоСуммаНДС = Формат(ИтогоСуммаНДСПоСтранице,ФорматВыводаСуммы);
		 ОбластьИтогиПоСтранице.Параметры.ИтогоВсегоСНДС = Формат(ИтогоВсегоСНДСПоСтранице,ФорматВыводаСуммы);
		 ТабДокумент.Вывести(ОбластьИтогиПоСтранице);
		 
		 // Выводим итоги по документу
		 ОбластьМакетаИтого = Макет.ПолучитьОбласть("Итого");
		 ОбластьМакетаИтого.Параметры.ИтогоКоличествоПринято = Формат(ИтогоКоличествоПринято,ФорматВыводаКоличества);
		 ОбластьМакетаИтого.Параметры.ИтогоСуммаБезНДС = Формат(ИтогоСуммаБезНДС,ФорматВыводаСуммы);
		 ОбластьМакетаИтого.Параметры.ИтогоСуммаНДС = Формат(ИтогоСуммаНДС,ФорматВыводаСуммы);
		 ОбластьМакетаИтого.Параметры.ИтогоВсегоСНДС = Формат(ИтогоВсегоСНДС,ФорматВыводаСуммы);
		 ТабДокумент.Вывести(ОбластьМакетаИтого);
		 
		 // выводим подвал
		 ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		 
		 Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"ОтпустилКонтрагент");
		 Отпустил.Вставить("ОтпустилПредставление", Отпустил.ОтпустилКонтрагентПредставление);
		 ОбластьМакета.Параметры.Заполнить(Отпустил);
		 
		 Получил = дкОтветственноеЛицо(ЭтотОбъект,"Получил");
		 ОбластьМакета.Параметры.Заполнить(Получил);
		 
		 ТабДокумент.Вывести(ОбластьМакета);
		 
		 // Зададим параметры макета
		 
		 ТабДокумент.ПолеСверху = 0;
		 ТабДокумент.ПолеСлева  = 0;
		 ТабДокумент.ПолеСнизу  = 0;
		 ТабДокумент.ПолеСправа = 0;
		 ТабДокумент.АвтоМасштаб=Истина;
		 ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		 
		 Возврат ТабДокумент;
	 КонецФункции // ПечатьМ4()
	 
 Функция КонтактнаяИнформация(Объект, Вид)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Вид = &Вид
	|	И КонтактнаяИнформация.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Вид", Вид);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Представление;
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции
	 
 Функция ПечатьАктПриемаПередачиТмцРаботнику(ТабДокумент) Экспорт
		 
	 Макет = ПолучитьМакет("АктПриемаПередачиТмцРаботнику");
	 
	 //Макет.Параметры.МинимСрокВыполненияЗаказа = СрокПоставкиДней;
	 //Макет.Параметры.МаксСрокВыполненияЗаказа = СрокПоставкиДней;
	 
	 ОбластьМакета = Макет.ПолучитьОбласть("Заголовок"); 
	 
	 ОбластьМакета.Параметры.ТекстЗаголовка	= дкПолучитьПредставление(ЭтотОбъект, "");
	 ОбластьМакета.Параметры.ТекстЗаголовка	= ЭтотОбъект.Номер+" от "+Формат(ЭтотОбъект.Дата,"ДЛФ=DD");
	 
  	 ЗапросПД = Новый Запрос;
	 
	 ЗапросПД.Текст = "ВЫБРАТЬ
	 |	ПодтверждающиеДокументы.Серия,
	 |	ПодтверждающиеДокументы.Номер,
	 |	ПодтверждающиеДокументы.ДатаВыдачи,
	 |	ПодтверждающиеДокументы.КемВыдан
	 |ИЗ
	 |	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	 |ГДЕ
	 |	ПодтверждающиеДокументы.Владелец = &Владелец
	 |	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = &ВидПодтверждающегоДокумента";
	 
	 ЗапросПД.УстановитьПараметр("Владелец", ЭтотОбъект.Сотрудник);
	 ЗапросПД.УстановитьПараметр("ВидПодтверждающегоДокумента",Перечисления.ВидыДокументов.Паспорт);
	 Результат = ЗапросПД.Выполнить().Выбрать();
	 Если Результат.Следующий() Тогда	
		 Опаспорте = Результат.Серия+" "+Результат.Номер+", выдан "+Формат(Результат.ДатаВыдачи, "ДЛФ=Д")+ " г. " + Результат.КемВыдан;
	 КонецЕсли;	
	 ОбластьМакета.Параметры.ПредставлениеСотрудника	= ""+ЭтотОбъект.Сотрудник+", паспорт "+Опаспорте;
	 
	 //+", зарегистрирован: "+киПолучитьПредставлениеКИ(ЭтотОбъект.Сотрудник, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
 	 //+", телефон "+	 КонтактнаяИнформация(ЭтотОбъект.Сотрудник, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный)+", E-mail: "+
	 //КонтактнаяИнформация(ЭтотОбъект.Сотрудник, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий)+" "+
	 //КонтактнаяИнформация(ЭтотОбъект.Сотрудник, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний);
	 
	 ОбластьМакета.Параметры.ПредставлениеОрганизации	= ""+ЭтотОбъект.Организация+" ( Дилерский центр: "+ЭтотОбъект.ДилерскийЦентр+" )";
	 
	Руководитель = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.Руководитель);
		Если ЗначениеЗаполнено(Руководитель) И ТипЗнч(Руководитель)=Тип("Структура") Тогда
			Должность = ", в лице";
			Если ЗначениеЗаполнено(Руководитель.РуководительДолжность) Тогда
				Должность = Должность + " " + СокрЛП(НРег(Руководитель.РуководительДолжность));
			КонецЕсли;
			ОбластьМакета.Параметры.РуководительДолжность = Должность;
			РуководительПредставление = Руководитель.РуководительПредставление;
			ДоверенностьРуководителя = спПолучитьПодтверждающийДокументОбъектаПоВиду(Руководитель.Руководитель,Перечисления.ВидыДокументов.Доверенность);
			Если ЗначениеЗаполнено(ДоверенностьРуководителя) Тогда
				РуководительПредставление = РуководительПредставление + ", действующего  на основании Доверенности №" + ДоверенностьРуководителя.Номер + " от "
											+ Формат(ДоверенностьРуководителя.ДатаВыдачи,"ДЛФ=D"); 
			Иначе
				РуководительПредставление = РуководительПредставление + ", действующего  на основании Устава"; 		
			КонецЕсли;
			ОбластьМакета.Параметры.РуководительПредставление = РуководительПредставление;
		КонецЕсли;

	 
	 //ОбластьМакета.Параметры.основаниеДеятельности = "Устава";
	 //спПолучитьПредставление(ЭтотОбъект.Организация,Новый Структура("АдресЮридический"))+", "+
	 //киПолучитьПредставлениеКИ(ЭтотОбъект.Организация,Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	 
	 ОбластьМакета.Параметры.ПредставлениеГорода = "г.Ростов-на-Дону";
	 ОбластьМакета.Параметры.ПредставлениеДаты =  Формат(ЭтотОбъект.Дата,"ДЛФ=DD");
	 
	 ТабДокумент.Вывести(ОбластьМакета);
	 
	 ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"); 
	 ТабДокумент.Вывести(ОбластьМакета);	
	 
	 ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	 
	 СуммаВсего = 0;
	 
	 ВыборкаТабличнойЧасти = ЭтотОбъект.Товары;
	 Для каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
		 //    //заполняем данные строки
		 СтруктураСтроки = дкПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТабличнойЧасти,ЭтотОбъект);
		 ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);
		 ОбластьМакета.Параметры.ТоварНаименование = СтрЗаменить(СтруктураСтроки.ТоварНаименование,", "+СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры.Наименование,"");
		 ОбластьМакета.Параметры.ИнвНомер = СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры.Наименование;
		 СуммаВсего = СуммаВсего + СтрокаТабличнойЧасти.СуммаВсего;
		 ТабДокумент.Вывести(ОбластьМакета);		
	 КонецЦикла;
	 
	 //итоги
	 ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	 СуммаВсего = ВыборкаТабличнойЧасти.Итог("СуммаВсего");
	 ОбластьМакета.Параметры.СуммаВсего = Формат(СуммаВсего,"ЧЦ=15; ЧДЦ=2");
	 //
	 ОбластьМакета.Параметры.СуммаПрописью = "Всего наименований "+ВыборкаТабличнойЧасти.Количество()+" с итоговым количеством "+ЧислоПрописью(ВыборкаТабличнойЧасти.Итог("Количество"), ,",,,,,,,,0")+
	                                         "на сумму " + обЧислоПрописью(СуммаВсего,ЭтотОбъект.ВалютаДокумента);
	 //ОбластьМакета.Параметры.ОтпустилПредставление = ЭтотОбъект.Автор;
	 //ОбластьМакета.Параметры.ПолучилПредставление = ЭтотОбъект.Сотрудник;
	 
	 ТабДокумент.Вывести(ОбластьМакета);	
	 
	 Возврат ТабДокумент;
	 
 КонецФункции // ПечатьАктПриемаПередачиТМЦРаботнику()
	 
 // Функция осуществляет печать произвольного документа.
	 // Можно направить печать на экран или принтер, а также распечатать необходимое количество копий.
	 //
	 // Параметры:
	 //	ЭтотОбъект							- ДокументОбъект	- Документ для печати
	 //	НазваниеПечатнойФормы 				- Строка			- Название печатной формы, если пусто, то по умолчанию
	 //	КоличествоЭкземпляров				- Число				- Количество экземпляров документа
	 //	НаПринтер							- Булево			- Признак отправки документа на принтер без отображения его на экране
	 //  Документ 	  						- ТабличныйДокумент	- Макет печатной формы
	 //
	 // Возвращаемое значение:
	 //   ТабличныйДокумент	- Сформированная печатная форма
	 //
 Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
		 Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
 КонецФункции // Печать()
	 
 // Возвращает доступные варианты печати документа
	 // Возвращаемое значение: 
	 //  Структура, каждая строка которой
	 //  соответствует одному из вариантов печати
	 //  Первый элемент структуры - форма по умолчанию
 Функция ПолучитьСписокПечатныхФорм() Экспорт
		 СтруктураМакетов=Новый Структура();
		 СтруктураМакетов.Вставить("АктПриемаПередачиТмцРаботнику", "Акт приёма-передачи ТМЦ работнику");
		 //СтруктураМакетов.Вставить("М4", "М-4 (Приходный ордер)");
		 Возврат СтруктураМакетов;
 КонецФункции // ПолучитьСписокПечатныхФорм()
	 
 #КонецЕсли
 
 // Если Клиент Тогда - завершена клиентская часть
 
 ////////////////////////////////////////////////////////////////////////////////
 // ОБРАБОТЧИКИ СОБЫТИЙ
 
 Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	 Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
 КонецПроцедуры // ПриУстановкеНовогоНомера()
 
 //Бондаренко 20160318 ++
 Функция НайтиОрганизациюПоРегиструСведений(ВыбДЦ)
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	НастройкаПродажиТоваровПриБезвозмездномПоступлении.ДилерскийЦентр,
	 |	НастройкаПродажиТоваровПриБезвозмездномПоступлении.ОрганизацияПокупатель,
	 |	НастройкаПродажиТоваровПриБезвозмездномПоступлении.ПодразделениеОрганизацииПокупателя,
	 |	НастройкаПродажиТоваровПриБезвозмездномПоступлении.СкладОрганизацииПокупателя
	 |ИЗ
	 |	РегистрСведений.НастройкаПродажиТоваровПриБезвозмездномПоступлении КАК НастройкаПродажиТоваровПриБезвозмездномПоступлении
	 |ГДЕ
	 |	НастройкаПродажиТоваровПриБезвозмездномПоступлении.ДилерскийЦентр = &ВыбДЦ";
	 
	 Запрос.УстановитьПараметр("ВыбДЦ", ВыбДЦ);
	 
	 Результат = Запрос.Выполнить().Выгрузить();
	 
	 Возврат Результат;
	 
 КонецФункции // НайтиОрганизациюПоФрагментуНаименования()
 
 Функция НайтиКонтраИдоговорПоРегиструСведений(ВыбОрганизация,ВыбКонтрагент)
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ДоговорыКонтрагентовПоУмолчанию.КонтрагентДляДоговора,
	 |	ДоговорыКонтрагентовПоУмолчанию.Организация,
	 |	ДоговорыКонтрагентовПоУмолчанию.ДоговорПоставки
	 |ИЗ
	 |	РегистрСведений.ДоговорыКонтрагентовПоУмолчанию КАК ДоговорыКонтрагентовПоУмолчанию
	 |ГДЕ
	 |	ДоговорыКонтрагентовПоУмолчанию.Организация = &ВыбОрганизация
	 |	И ДоговорыКонтрагентовПоУмолчанию.КонтрагентДляДоговора = &ВыбКонтрагент";
	 
	 Запрос.УстановитьПараметр("ВыбОрганизация", ВыбОрганизация);
	 Запрос.УстановитьПараметр("ВыбКонтрагент", ВыбКонтрагент);
	 
	 Результат = Запрос.Выполнить().Выгрузить();
	 
	 Возврат Результат;
	 
 КонецФункции // НайтиОрганизациюПоФрагментуНаименования()
 
 //Бондаренко 20160318 --
 
 
 // Процедура - обработчик ввода на основании
 Процедура ОбработкаЗаполнения(Основание) Экспорт
	 
	 Рез=дкОбработкаЗаполнения(ЭтотОбъект, Основание,,ТипЗнч(Основание)<>Тип("ДокументСсылка.КорректировкаЗаказаПоставщику"));
	 
	 //Бондаренко-- 20191113
	 Если ТипЗнч(Основание) = Тип("ДокументСсылка.СписаниеТоваров") Тогда
		 
		 ОснованиеОбъект = Основание.ПолучитьОбъект();
		 
		 //ТЗ_Себест =  ОснованиеОбъект.Движения.Продажи.Выгрузить();
		 //ТЗ_Себест.ВыбратьСтроку();
		 //ТЗ_Себест.Свернуть("Номенклатура","СуммаУпр,Количество");  
 		 
		 Для Каждого СтрокаТовары Из Товары Цикл
			 СуммаСписания = дкПолучитьСуммуСписания(Основание, "ПартииТоваровКомпании", , СтрокаТовары.Номенклатура,, СтрокаТовары.НомерСтроки);
			 СтрокаТовары.Сумма = СуммаСписания;
			 СтрокаТовары.СуммаВсего = СуммаСписания;
			 Если СтрокаТовары.КоличествоБазовое <> 0 Тогда
				 СтрокаТовары.Цена = СтрокаТовары.СуммаВсего/СтрокаТовары.КоличествоБазовое;
			 ИначеЕсли 	СтрокаТовары.Количество*СтрокаТовары.Коэффициент <> 0 Тогда
				 СтрокаТовары.Цена = СтрокаТовары.СуммаВсего/(СтрокаТовары.Количество*СтрокаТовары.Коэффициент);
			 КонецЕсли; 
		 КонецЦикла;
		 
	 КонецЕсли;
	 //Бондаренко-- 20191113
 	 
	 Если ЭтоНовый() Тогда
		 ТипЦен=обПраво("ОсновнойТипЦенЗакупки",Права,,ЭтотОбъект);
		 Менеджер=ПараметрыСеанса.Пользователь.Сотрудник;
		 ХозОперация=Справочники.ХозОперации.ПоступлениеТМЦ;
	 КонецЕсли;
	 
 КонецПроцедуры // ОбработкаЗаполнения()
 
 Процедура ПриКопировании(ОбъектКопирования)
	 Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
	 ВхДокДата = '00010101';
	 ВхДокНомер = "";
	 //Бондаренко++ 20161011 #11446
	 ПроводитьПриНаличииОшибок=Ложь;
	 //Бондаренко-- 20161011 #11446
	 //Гэндальф+++
	 Если ЗначениеЗаполнено(ПодразделениеКомпании) Тогда
		 Если обПолучитьПраваИНастройкиПользователя(ПодразделениеКомпании, "ЗакрытиеЗаказовПоПодразделению", ЭтотОбъект) Тогда
			 ЗакрытиеЗаказовПоПодразделению = Перечисления.ВариантыОтветов.Да;
		 Иначе
			 ЗакрытиеЗаказовПоПодразделению = Перечисления.ВариантыОтветов.Нет;
		 КонецЕсли;
		 СпособКонтроляКорректностиДоговораИСклада = обПолучитьПраваИНастройкиПользователя(ПодразделениеКомпании, "КонтрольКорректностиДоговораИСкладаДокумента", ЭтотОбъект);
		 ЗакрытиеЗаказовПоОрганизации = Ложь;
	 КонецЕсли; 
	 //Гэндальф---
 КонецПроцедуры // ПриКопировании()
 
 Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	 
	 Если ОбменДанными.Загрузка Тогда
		 Возврат;
	 КонецЕсли;
	 
 КонецПроцедуры // ПередЗаписью()
 
 Процедура ПриЗаписи(Отказ)
	 Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
 КонецПроцедуры // ПриЗаписи()
 
 Процедура ПередУдалением(Отказ)
	 Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	 Если Отказ = Ложь Тогда
		 Если Константы.ПартияТоваровОтрицательныхОстатков.Получить() = Ссылка Тогда
			 #Если Клиент Тогда
				 Сообщить("Документ является документом партии отрицательных остатков и не может быть удалён");
			 #КонецЕсли
			 Отказ = Истина;
		 КонецЕсли;
	 КонецЕсли;
 КонецПроцедуры // ПередУдалением()
 
 Процедура ОбработкаУдаленияПроведения(Отказ)
	 Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
 КонецПроцедуры // ОбработкаУдаленияПроведения()
 
 Процедура ОбработкаПроведения(Отказ, Режим)
	 
	 Движения.ТМЦПереданныеСотрудникам.Очистить();
	 
	 Для Каждого ТекСтрокаТовары Из Товары Цикл
		 
		 Движение = Движения.ТМЦПереданныеСотрудникам.Добавить();
		 
		 Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		 Движение.Период = Дата;
		 Движение.Сотрудник = Сотрудник;
		 Движение.ДилерскийЦентр = ДилерскийЦентр;
		 Движение.ПартияТМЦ = Ссылка;
		 Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		 Движение.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
		 
		 Движение.Количество = ТекСтрокаТовары.Количество;
		 Движение.Сумма = ТекСтрокаТовары.СуммаВсего;
		 Движение.ХозОперация = ХозОперация;
		  
	 КонецЦикла;
	 
 КонецПроцедуры // ОбработкаПроведения()
 
 
 //Гэндальф---
 
 //Бондаренко++ 20180131 
 
 // Получить остатки номенклатуры
 // Номенклатура - СправочникСсылка на номенклатуру
 // Возвращаемое значение Число - остаток номенклатуры
 Функция ПолучитьОстаткиНоменклатурыНаСкладах(Знач СкладКомпании,Номенклатура) Экспорт
	 
	 //Будем считать что остаток нулевой
	 ОстатокНоменклатуры=0;
	 СтруктураОтбора = Новый Структура("Номенклатура",Номенклатура);
	 Если Не ЗначениеЗаполнено(СкладКомпании) Тогда
		 СкладКомпании=Справочники.СкладыКомпании.ПустаяСсылка();
	 КонецЕсли;
	 СтруктураОтбора.Вставить("СкладКомпании", СкладКомпании);
	 
	 СписокСкладовДилерскогоЦентра = Новый СписокЗначений;
	 СписокСкладовДилерскогоЦентра.Добавить(СкладКомпании);
	 
	 ДЦ = СкладКомпании.Подразделение.ДилерскийЦентр;
	 Если Не обЗначениеНеЗаполнено(ДЦ) Тогда
		 СписокСкладовДилерскогоЦентра = СписокСкладовДЦ(ДЦ);
	 КонецЕсли; 
	 
	 Попытка 
		 ДатаОстатков = ЭтотОбъект.Дата;
	 Исключение
		 ДатаОстатков = ТекущаяДата();
	 КонецПопытки; 
	 
	 Запрос = Новый Запрос;
	 
	 //Запрос.Текст = "ВЫБРАТЬ
	 //|	ОстаткиТоваровКомпанииОстатки.СкладКомпании КАК СкладКомпании,
	 //|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток-ОстаткиТоваровКомпанииОстатки.РезервОстаток КАК Остаток
	 //|ИЗ
	 //|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(&ДатаОстатков,"+?(ЗначениеЗаполнено(СкладКомпании),"СкладКомпании=&СкладКомпании И ","")+" Номенклатура = &Номенклатура  ) КАК ОстаткиТоваровКомпанииОстатки
	 //|";
	 
	 Запрос.Текст = "ВЫБРАТЬ
	 |	ОстаткиТоваровКомпанииОстатки.СкладКомпании КАК СкладКомпании,
	 |	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток-ОстаткиТоваровКомпанииОстатки.РезервОстаток КАК Остаток
	 |ИЗ
	 |	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(,"+?(ЗначениеЗаполнено(СкладКомпании),"СкладКомпании В (&СписокСкладовДилерскогоЦентра) И ","")+" Номенклатура = &Номенклатура) КАК ОстаткиТоваровКомпанииОстатки
	 |";
	 
	 
	 //Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании);
	 Запрос.УстановитьПараметр("СписокСкладовДилерскогоЦентра", СписокСкладовДилерскогоЦентра);
	 
	 Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	 Запрос.УстановитьПараметр("ДатаОстатков", КонецДня(ДатаОстатков));
	 
	 ВыборкаОстатковНоменклатурыНаСкладах=Запрос.Выполнить().Выбрать();
	 
	 Пока ВыборкаОстатковНоменклатурыНаСкладах.Следующий() Цикл
		 ОстатокНоменклатуры=ОстатокНоменклатуры + ВыборкаОстатковНоменклатурыНаСкладах.Остаток;
	 КонецЦикла; 
	 
	 Возврат ОстатокНоменклатуры;
	 
 КонецФункции
 
 Функция СписокСкладовДЦ(ВыбДЦ)
	 
	 //Сообщить("Работает список складов ДЦ");
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	СкладыКомпании.Ссылка,
	 |	СкладыКомпании.Подразделение.ДилерскийЦентр
	 |ИЗ
	 |	Справочник.СкладыКомпании КАК СкладыКомпании
	 |ГДЕ
	 |	СкладыКомпании.Подразделение.ДилерскийЦентр = &ВыбДЦ";
	 
	 Запрос.УстановитьПараметр("ВыбДЦ", ВыбДЦ);
	 
	 СписокСкладов = Новый СписокЗначений;
	 
	 //ТЗ = Запрос.Выполнить().Выгрузить();
	 // ТЗ.ВыбратьСтроку();
	 
	 СписокСкладов.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	 
	 //Сообщить("Список складов ДЦ: "+СписокСкладов);
	 
	 Возврат СписокСкладов;
	 
 КонецФункции // СписокСкладовДЦ()
 
 // Получить остатки номенклатуры
 // Номенклатура - СправочникСсылка на номенклатуру
 //  
 // Возвращаемое значение Число - остаток номенклатуры
 Процедура ПолучитьОстаткиЗаказаНоменклатурыНаСкладах(Знач РодительПодразделения,Знач ПодразделениеКомпании,Номенклатура,ДатаОстатков,ВсегоЗаказано,Просрочено) Экспорт
	 
	 //Будем считать что остаток нулевой
	 ОстатокЗаказаНоменклатуры=0;
	 ОстатокЗаказаНоменклатурыПросрочено=0;
	 ДатаМинусМесяц = ДобавитьМесяц(ДатаОстатков,-1);
	 
	 СтруктураОтбора = Новый Структура("Номенклатура",Номенклатура);
	 
	 Запрос = Новый Запрос;
	 
	 Запрос.Текст = "ВЫБРАТЬ
	 |	ЗаказыПоставщикамОстатки.ЗаказаноОстаток КАК Остаток,
	 |	ЗаказыПоставщикамОстатки.ЗаказПоставщику.ПодразделениеКомпании КАК ПодразделениеКомпании,
	 |	ЗаказыПоставщикамОстатки.ЗаказПоставщику,
	 |	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Дата КАК ДатаЗаказа
	 |ИЗ
	 |	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	 |			&ДатаОстатков,
	 |			Номенклатура = &Номенклатура
	 |				 ) КАК ЗаказыПоставщикамОстатки";
	 
	 //Бондаренко 20160421 ++			   
	 Если РодительПодразделения = ПодразделениеКомпании Тогда
		 Запрос.Текст = Запрос.Текст + "
		 | ГДЕ ЗаказыПоставщикамОстатки.ЗаказПоставщику.ПодразделениеКомпании = &ПодразделениеКомпании";
		 Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	 Иначе	
		 Запрос.Текст = Запрос.Текст + "
		 | ГДЕ ЗаказыПоставщикамОстатки.ЗаказПоставщику.ПодразделениеКомпании В ИЕРАРХИИ (&РодительПодразделения)";
		 Запрос.УстановитьПараметр("РодительПодразделения", РодительПодразделения); 
	 КонецЕсли; 			   
	 //Бондаренко 20160421 --
	 
	 Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	 Запрос.УстановитьПараметр("ДатаОстатков", КонецДня(ДатаОстатков));
	 
	 ВыборкаОстатковЗаказа=Запрос.Выполнить().Выбрать();
	 
	 Пока ВыборкаОстатковЗаказа.Следующий() Цикл
		 Если ВыборкаОстатковЗаказа.ДатаЗаказа < ДатаМинусМесяц Тогда
			 ОстатокЗаказаНоменклатурыПросрочено=ОстатокЗаказаНоменклатурыПросрочено + ВыборкаОстатковЗаказа.Остаток;
		 КонецЕсли;	
		 ОстатокЗаказаНоменклатуры=ОстатокЗаказаНоменклатуры + ВыборкаОстатковЗаказа.Остаток;		
	 КонецЦикла;
	 
	 ВсегоЗаказано = ОстатокЗаказаНоменклатуры;
	 Просрочено 	  = ОстатокЗаказаНоменклатурыПросрочено;	
	 
 КонецПроцедуры //ПолучитьОстаткиЗаказаНоменклатурыНаСкладах()
 
 Функция НайтиОсновнойСклад(Подразделение)
	 
	 НайденныйСклад = Справочники.СкладыКомпании.ПустаяСсылка();
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	СкладыКомпании.Ссылка,
	 |	СкладыКомпании.Подразделение,
	 |	СкладыКомпании.Основной
	 |ИЗ
	 |	Справочник.СкладыКомпании КАК СкладыКомпании
	 |ГДЕ
	 |	СкладыКомпании.ЭтоГруппа = ЛОЖЬ
	 |	И СкладыКомпании.Основной = ИСТИНА
	 |	И СкладыКомпании.Подразделение = &ВыбПодразделение";
	 
	 Запрос.УстановитьПараметр("ВыбПодразделение", Подразделение);
	 
	 Результат = Запрос.Выполнить();
	 
	 ВыборкаДетальныеЗаписи = Результат.Выбрать();
	 
	 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 НайденныйСклад = ВыборкаДетальныеЗаписи.Ссылка;
		 Возврат НайденныйСклад; 
	 КонецЦикла;
	 
	 Возврат НайденныйСклад; 
	 
 КонецФункции // НайтиОсновнойСклад()
 //Бондаренко-- 20180131
 
 ////////////////////////////////////////////////////////////////////////////////
 // ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
 
 // сохранение ссылки на коллекцию прав, настроек и окружения
 Права = Неопределено;
 #Если Клиент Тогда
	 Права = глПрава;
 #КонецЕсли
