Функция ПоискПоследнейЗаписи(Отбор) Экспорт
	Запрос				= Новый Запрос; 
	ТекстЗапроса		= ПолучитьТекстЗапроса();
	ДинамическоеУсловие = "";
	КоличествоЭлементов = Отбор.Количество();
	ТекущееКоличество 	= 1; 
	
	Для Каждого Строка Из Отбор Цикл
		ДинамическоеУсловие = ДинамическоеУсловие + СтрШаблон(" %1 = &%1 ",Строка.Ключ) + ?(ТекущееКоличество <> КоличествоЭлементов,"И","");
		Запрос.УстановитьПараметр(Строка.Ключ,Строка.Значение);
		ТекущееКоличество	= ТекущееКоличество + 1;
	КонецЦикла;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#ДинамическоеУсловие#",ДинамическоеУсловие);
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции

Функция ПолучитьТекстЗапроса()
	Возврат "ВЫБРАТЬ
		|	SM_ПроблемныеКлиенты.УникальныйИдентификатор КАК УникальныйИдентификатор,
		|	МАКСИМУМ(SM_ПроблемныеКлиенты.Период) КАК Период
		|ПОМЕСТИТЬ SM_ПоискПоследнейЗаписиПоУИД
		|ИЗ
		|	РегистрСведений.SM_ПроблемныеКлиенты КАК SM_ПроблемныеКлиенты
		|ГДЕ
		|	SM_ПроблемныеКлиенты.УникальныйИдентификатор В
		|			(ВЫБРАТЬ
		|				SM_ПоискПоДинамическомуОтбору.УникальныйИдентификатор
		|			ИЗ
		|				РегистрСведений.SM_ПроблемныеКлиенты.СрезПоследних(&ТекущаяДата, #ДинамическоеУсловие#) КАК SM_ПоискПоДинамическомуОтбору)
		|
		|СГРУППИРОВАТЬ ПО
		|	SM_ПроблемныеКлиенты.УникальныйИдентификатор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	SM_ПроблемныеКлиенты.Период КАК Период,
		|	SM_ПроблемныеКлиенты.УникальныйИдентификатор КАК УникальныйИдентификатор,
		|	SM_ПроблемныеКлиенты.ФИО КАК ФИО,
		|	SM_ПроблемныеКлиенты.НомерТелефона КАК НомерТелефона,
		|	SM_ПроблемныеКлиенты.Контрагент КАК Контрагент,
		|	SM_ПроблемныеКлиенты.Подразделение КАК Подразделение,
		|	SM_ПроблемныеКлиенты.Автор КАК Автор,
		|	SM_ПроблемныеКлиенты.Причина КАК Причина,
		|	SM_ПроблемныеКлиенты.Активный КАК Активный
		|ИЗ
		|	SM_ПоискПоследнейЗаписиПоУИД КАК SM_ПоискПоследнейЗаписиПоУИД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SM_ПроблемныеКлиенты КАК SM_ПроблемныеКлиенты
		|		ПО SM_ПоискПоследнейЗаписиПоУИД.УникальныйИдентификатор = SM_ПроблемныеКлиенты.УникальныйИдентификатор
		|			И SM_ПоискПоследнейЗаписиПоУИД.Период = SM_ПроблемныеКлиенты.Период";
КонецФункции