
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	//Дилер = Справочники.CRM_ДилерскиеЦентры.НайтиПоКоду("000000001");
	
	//ИДДилера = Строка(Дилер.УникальныйИдентификатор());
	//
	//Таблица = Renault_АвтосервисСерверСинхрСПланшетом.ПолучитьИспользованиеПланшета_Подробно(ИДДилера, ДатаНачала, ДатаОкончания, ИсполнительИД);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_CRM_ПриемкаАвтомобиля.Ссылка КАК Приемка,
		|	Renault_CRM_ЗаявкаНаСервис.Ссылка КАК Заявка,
		|	Renault_CRM_ВыдачаАвтомобиля.Ссылка КАК Выдача,
		|	Renault_CRM_ПриемкаАвтомобиля.ВремяНачала КАК StartTime,
		|	Renault_CRM_ВыдачаАвтомобиля.ВремяНачала КАК EndTime,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(Renault_CRM_ВыдачаАвтомобиля.Клиент) = ТИП(Справочник.CRM_ПотенциальныеКонтрагенты)
		|			ТОГДА Renault_CRM_ВыдачаАвтомобиля.Клиент.Фамилия + "" "" + Renault_CRM_ВыдачаАвтомобиля.Клиент.Имя + "" "" + Renault_CRM_ВыдачаАвтомобиля.Клиент.Отчество
		|		ИНАЧЕ Renault_CRM_ВыдачаАвтомобиля.Клиент.Фамилия + "" "" + Renault_CRM_ВыдачаАвтомобиля.Клиент.Имя + "" "" + Renault_CRM_ВыдачаАвтомобиля.Клиент.Отчество
		|	КОНЕЦ КАК FullName,
		|	1 КАК TabletAll,
		|	Renault_CRM_ЗаявкаНаСервис.ОбновленСПланшета КАК TabletWithResult,
		|	""-"" КАК OperationID,
		|	"""" КАК ЗН
		|ИЗ
		|	Документ.Renault_CRM_ПриемкаАвтомобиля КАК Renault_CRM_ПриемкаАвтомобиля
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ВыдачаАвтомобиля КАК Renault_CRM_ВыдачаАвтомобиля
		|		ПО Renault_CRM_ПриемкаАвтомобиля.Обращение = Renault_CRM_ВыдачаАвтомобиля.Обращение
		|			И (НЕ Renault_CRM_ПриемкаАвтомобиля.ПометкаУдаления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
		|		ПО Renault_CRM_ПриемкаАвтомобиля.Обращение = Renault_CRM_ЗаявкаНаСервис.Обращение
		|			И (НЕ Renault_CRM_ЗаявкаНаСервис.ПометкаУдаления)
		|ГДЕ
		|	Renault_CRM_ВыдачаАвтомобиля.ВремяНачала МЕЖДУ &Дата1 И &Дата2
		|	И НЕ Renault_CRM_ВыдачаАвтомобиля.ПометкаУдаления
		|	И Renault_CRM_ВыдачаАвтомобиля.Машиноместо = &МастерПриемщик
		|	И Renault_CRM_ВыдачаАвтомобиля.ДилерскийЦентр = &Дилер
		|
		|УПОРЯДОЧИТЬ ПО
		|	EndTime";
	
	Запрос.УстановитьПараметр("Дилер", Дилер);
	Запрос.УстановитьПараметр("Дата1", ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", ДатаОкончания);
	Запрос.УстановитьПараметр("МастерПриемщик", Справочники.Сотрудники.ПолучитьСсылку(Новый УникальныйИдентификатор(ИсполнительИД)));
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	СтандартнаяОбработка = Ложь;
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	ВнешийНабор = Новый Структура("ТаблицаПланшет", Таблица);
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,ВнешийНабор);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры
