&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	////Элементы.Список.РежимВыбора=Истина;
	//
	////Если Параметры.Свойство("спКП") Тогда
	////	Эл=Список.Параметры.Элементы.Найти("спКП");
	////	Эл.Значение=Параметры.спКП;
	////	Эл.Использование=Истина;
	////КонецЕсли;
	////
	////Если Параметры.Свойство("ВидЗадачи") Тогда
	////	Эл=Список.Параметры.Элементы.Найти("ВидЗадачи");
	////	Эл.Значение=Параметры.ВидЗадачи;
	////	Эл.Использование=Истина;
	////КонецЕсли;
	//
	//Если Параметры.Свойство("спКП") Тогда
	//	Отбор=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	Отбор.ВидСравнения=ВидСравненияКомпоновкиДанных.ВСписке;
	//	Отбор.Использование=Истина;
	//	Отбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("КП");
	//	Отбор.ПравоеЗначение=Параметры.спКП;
	//КонецЕсли;
	//
	////Если Параметры.Свойство("ВидСобытия") Тогда
	////	ВидСобытия=Параметры.ВидСобытия;
	////	
	////	Парам=Список.Параметры.Элементы.Найти("ВидСобытия");
	////	Парам.Значение=ВидСобытия;
	////	Парам.Использование=Истина;
	////	
	////	//ГруппаИЛИ=Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	////	//ГруппаИЛИ.Использование=Истина;
	////	//ГруппаИЛИ.ТипГруппы=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	////	//
	////	//Отбор=ГруппаИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	////	//Отбор.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	////	//Отбор.Использование=Истина;
	////	//Отбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ВидЗадачи");
	////	//Отбор.ПравоеЗначение=Параметры.ВидЗадачи;
	////	//
	////	//Отбор=ГруппаИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	////	//Отбор.ВидСравнения=ВидСравненияКомпоновкиДанных.НеЗаполнено;
	////	//Отбор.Использование=Истина;
	////	//Отбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ЗадачаСсылка");
	////КонецЕсли;

	//Парам=Список.Параметры.Элементы.Найти("ВидыСобытий");
	//Парам.Значение=Сп;
	//Парам.Использование=Истина;
	
	Если Параметры.Свойство("спКП") Тогда спКП=Параметры.спКП КонецЕсли;
	Если Параметры.Свойство("ВидСобытия") Тогда ВидСобытия=Параметры.ВидСобытия КонецЕсли;	
	ОбновитьТаблицу();
	
КонецПроцедуры

Процедура ОбновитьТаблицу()
	Запрос=Новый Запрос;
	
	Сп=Новый Массив;
	Сп.Добавить(Справочники.CRM_ВидыСобытий.Кредит);
	Сп.Добавить(Справочники.CRM_ВидыСобытий.Страховка);
	Сп.Добавить(Справочники.CRM_ВидыСобытий.КонсультацияОФУ);
	
	Запрос.УстановитьПараметр("ВидыСобытий",Сп);
	Запрос.УстановитьПараметр("спКП",спКП.ВыгрузитьЗначения());
	
	Запрос.Текст="
	|Выбрать
	|	КП.Ссылка.Дата Дата,
	|	КП.Ссылка.Сумма Сумма,
		
	|	Выбор Когда СоставКП.Конфигурация.Модель=Значение(Справочник.Модели.ПустаяСсылка) Тогда
	|		СоставКП.Конфигурация.Автомобиль.Наименование+"" ""+СоставКП.Конфигурация.Автомобиль.VIN
	|	Иначе
	|		СоставКП.Конфигурация.Наименование+"" ""+СоставКП.Конфигурация.Модель.Наименование+"" ""+СоставКП.Конфигурация.Версия.Наименование
	|	Конец Конфигурация,

	|	ВЫБОР КОГДА ЕСТЬNULL(Воронка.IDK,0)>0 ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ ОсновноеКП,
	|	КП.Ссылка КП,
		
	|	Задача.Ссылка ЗадачаСсылка,
	|	Задача.ВидСобытия,
	|	Задача.Наименование Задача,
	|	Задача.Исполнитель,
	|	Задача.Сотрудник,
	|	Задача.Состояние
		//Задача.СостояниеЗадачи

	|ИЗ Документ.CRM_КоммерческоеПредложение КП
	|Левое Соединение Документ.CRM_КоммерческоеПредложение.Состав СоставКП
	|По КП.Ссылка=СоставКП.Ссылка

	|Левое Соединение Задача.Renault_События Задача 
	|По КП.Ссылка=Задача.Объект И Не Задача.ПометкаУдаления И Задача.ВидСобытия В(&ВидыСобытий)

	|Левое Соединение РегистрСведений.CRM_ВоронкаПродаж Воронка
	|По КП.Ссылка=Воронка.Объект И Воронка.ЭтапПродаж=Значение(Справочник.CRM_ЭтапыПродаж.КоммерческоеПредложение)

	|ГДЕ СоставКП.НомерСтроки=1 "+?(спКП.Количество()>0,"И КП.Ссылка В(&спКП)","");
	Табл.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры	

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	//ОповеститьОВыборе(ВыбраннаяСтрока);
	//Закрыть(ВыбраннаяСтрока);
	//ВладелецФормы.Выбор_КП(ВыбраннаяСтрока,ВидСобытия);
	
	ТекЗадача=Табл.НайтиПоИдентификатору(ВыбраннаяСтрока).ЗадачаСсылка;
	
	ОбластиПрименения=Новый Массив;
	ОбластиПрименения.Добавить(Перечисления.Renault_ОбластиПрименения.ОФУ);
	ОбластиПрименения.Добавить(Перечисления.Renault_ОбластиПрименения.Общие);
	
	Задачи.Renault_События.ОткрытьЗадачу(ТекЗадача,ЭтаФорма,ОбластиПрименения);
КонецПроцедуры

&НаКлиенте
Процедура кнДействияКнопок(Команда)
	ТекЗадача=Элементы.Табл.ТекущиеДанные.ЗадачаСсылка;
	Если Команда.Имя="кнНазначитьИсполнителя" Тогда
		Если ТекЗадача.Пустая() Тогда Возврат КонецЕсли;
		
		Сотрудник=Renault_ОбщиеФункции.ПолучитьМенеджераОФУ(ЭтаФорма,ТекЗадача.Сотрудник);
		Если Сотрудник=Неопределено Тогда Возврат КонецЕсли;
		Если Не Задачи.Renault_События.УстановитьАдресацию(ТекЗадача,Сотрудник) Тогда Возврат КонецЕсли;
		
	ИначеЕсли Команда.Имя="кнСоздатьЗадачу" Тогда
		//Если НЕ ТекЗадача.Пустая() Тогда Возврат КонецЕсли;
		
		//может быть задача создана по другому виду события, найдем и переделаем...
		Если Не ТекЗадача.Пустая() И ТекЗадача.ВидСобытия<>ВидСобытия Тогда
			ТекЗадача=Задачи.Renault_События.НайтиЗадачуОФУ(Элементы.Табл.ТекущиеДанные.КП,ВидСобытия); 
		КонецЕсли;	
		Задачи.Renault_События.СоздатьОткрытьЗадачуОФУ(ТекЗадача,Элементы.Табл.ТекущиеДанные.КП,ЭтаФорма,ВидСобытия);
		
	//ИначеЕсли Команда.Имя="кнСостояние" Тогда
	//	Если ТекЗадача.Пустая() Тогда Возврат КонецЕсли;
	//ИначеЕсли Команда.Имя="кнОбновить" Тогда
		
	ИначеЕсли Команда.Имя="кнУдалитьЗадачу" Тогда
		Если ТекЗадача.Пустая() Тогда Возврат КонецЕсли;
		
		Если Не Задачи.Renault_События.УдалитьЗадачу(ТекЗадача) Тогда Возврат КонецЕсли;
		
	КонецЕсли;
	ОбновитьТаблицу();
КонецПроцедуры

//&НаКлиенте
//Процедура СоздатьОткрытьЗадачу(Задача,КП) // создать новую или открыть существующую задачу (страховки / кредита)
//	//если задача существует - открываем
//	Если НЕ Задача.Пустая() Тогда ОткрытьЗадачу(Задача); Возврат КонецЕсли;
//	
//	//иначе создаем новую
//	Отдел=Renault_ОбщиеФункции.ПолучитьОтделОФУ(ЭтаФорма);
//	Если Не ЗначениеЗаполнено(Отдел) Тогда Возврат КонецЕсли;
//	Если ТипЗнч(Отдел)=Тип("СправочникСсылка.CRM_Отделы") Тогда
//		Задача=Задачи.Renault_События.СоздатьНовую(КП,ВидСобытия,,,,Отдел);
//		ПоказатьОповещениеПользователя("Создана задача КСО",ПолучитьНавигационнуюСсылку(Задача),,БиблиотекаКартинок.Задача);
//	Иначе
//		ПоказатьОповещениеПользователя("Не выбран отдел КСО, задача не создана");
//	КонецЕсли;
//КонецПроцедуры

//&НаКлиенте
//Процедура ОткрытьЗадачу(Ссылка)
//	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда Возврат КонецЕсли;
//	ОбластиПрименения=Новый Массив;
//	ОбластиПрименения.Добавить(Перечисления.Renault_ОбластиПрименения.ОФУ);
//	ОбластиПрименения.Добавить(Перечисления.Renault_ОбластиПрименения.Общие);
//	Парам=Новый Структура("Ключ,ОбластиПрименения",Ссылка,ОбластиПрименения);
//	//Если Renault_ОбщиеФункции.СтараяПлатформа() Тогда
//	ОткрытьФорму("Задача.Renault_События.ФормаОбъекта",Парам,ЭтаФорма,УникальныйИдентификатор);
//КонецПроцедуры	


&НаКлиенте
Процедура ПриЗакрытии()
	
	Если ВладелецФормы<>Неопределено Тогда
		ВладелецФормы.УправлениеКнопкамиОФУ() 
	КонецЕсли;
	
КонецПроцедуры //перерисовать цвета кнопок
