////http service gate
//Функция ExtDMS(action,Значение) Экспорт
//	
//	Пользователь=Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ЛогинДоступаКВебСервисам;
//	Пароль=Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ПарольДоступаКВебСервисам;
//	
//	//ЗаписьJSON=Новый ЗаписьJSON;
//	//ЗаписьJSON.УстановитьСтроку();
//	//ЗаписатьJSON(ЗаписьJSON,Значение);
//	//value=ЗаписьJSON.Закрыть();
//	
//	value=ЗначениеВСтрокуВнутр(Значение); //value=КодироватьСтроку(ЗначениеВСтрокуВнутр(Значение),СпособКодированияСтроки.КодировкаURL);
//	
//	URL="/advertisement/hs/ads/"+action; //+"/"+value; //URL="/advertisement/hs/ads/?access_point=0&reason=0";
//	Заголовки=Новый Соответствие;
//	Заголовки.Вставить("Content-Type","text/html; charset=UTF-8");
//	
//	ТекстОшибки="Не удалось установить соединение с сервисом: ";
//	
//	Соединение=Новый HTTPСоединение("89.108.111.89",8080,Пользователь,Пароль);
//	Запрос=Новый HTTPЗапрос(URL,Заголовки);
//	
//	//GET
//	//Ответ=Соединение.Получить(Запрос);
//	
//	//POST
//	Запрос.УстановитьТелоИзСтроки(value);
//	Ответ=Соединение.ОтправитьДляОбработки(Запрос);
//	
//	Если Ответ.КодСостояния=200 Тогда Возврат ЗначениеИзСтрокиВнутр(Ответ.ПолучитьТелоКакСтроку())
//	ИначеЕсли Ответ.КодСостояния=400 Тогда Сообщить(ТекстОшибки+"не верный запрос",СтатусСообщения.Внимание);
//	ИначеЕсли Ответ.КодСостояния=401 Тогда Сообщить(ТекстОшибки+"не авторизован",СтатусСообщения.Внимание);
//	ИначеЕсли Ответ.КодСостояния=500 Тогда Сообщить(ТекстОшибки+"ошибка на сервере",СтатусСообщения.Внимание);
//	//Иначе Сообщить(ТекстОшибки+Ответ.ПолучитьТелоКакСтроку(),СтатусСообщения.Внимание);
//	Иначе Сообщить("Не удалось установить соединение с сервисом",СтатусСообщения.Внимание);
//	КонецЕсли;
//КонецФункции	
