Перем ТаблицаБСО;

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Если НЕ ЗначениеЗаполнено(СтраховаяКомпания) Тогда
		Сообщить("Не указана страховая компания!");
		Отказ=истина;
		Возврат;
	КонецЕсли;	
		
	Если ПередатьНаТочкуПродажи Тогда
		ТаблицаБСО=Renault_УчетБСО.ПолучитьТаблицуБСОПоТабЧасти(БСО, Организация, СтраховаяКомпания, ТочкаПродаж);
	Иначе
		ТаблицаБСО=Renault_УчетБСО.ПолучитьТаблицуБСОПоТабЧасти(БСО, Организация, СтраховаяКомпания);
	КонецЕсли;
	
	ЕстьБСОНаТочках=ложь;
	ЕстьБСОВОрганизации=Renault_УчетБСО.ПроверитьНаличиеБСО(Дата, ТаблицаБСО, Организация, СтраховаяКомпания);
	Если ПередатьНаТочкуПродажи Тогда
		ЕстьБСОНаТочках=Renault_УчетБСО.ПроверитьНаличиеБСОНаТочках(Ссылка, ТаблицаБСО, Организация, неопределено, ТочкаПродаж);
	КонецЕсли;
	
	Если ЕстьБСОВОрганизации ИЛИ ЕстьБСОНаТочках Тогда 
		Отказ=Истина;
		Возврат 
	КонецЕсли;
	
	Движения.Renault_СтатусыБСО.Записывать=Истина;
	Движения.Renault_СтатусыБСО.Очистить();
	Движения.Renault_БСОВОрганизации.Записывать=Истина;
	Движения.Renault_БСОВОрганизации.Очистить();
	Движения.Renault_БСОНаТочкеПродаж.Записывать=Истина;
	Движения.Renault_БСОНаТочкеПродаж.Очистить();
	
	Для Каждого ТекСтрокаБСО Из ТаблицаБСО Цикл
		// регистр Renault_СтатусыБСО		
		Движение = Движения.Renault_СтатусыБСО.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.СтраховаяКомпания = СтраховаяКомпания;
		Движение.ТипБСО = ТекСтрокаБСО.ТипБСО;
		Движение.СерияБСО = ТекСтрокаБСО.СерияБСО;
		Движение.НомерБСО = ТекСтрокаБСО.НомерБСО;
		Движение.Статус = Перечисления.Renault_СтатусыБСО.Чистый;
		
		// регистр Renault_БСОВОрганизации Приход
		Движение = Движения.Renault_БСОВОрганизации.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.СтраховаяКомпания = СтраховаяКомпания;
		Движение.ТипБСО = ТекСтрокаБСО.ТипБСО;
		Движение.СерияБСО = ТекСтрокаБСО.СерияБСО;
		Движение.НомерБСО = ТекСтрокаБСО.НомерБСО;
		Движение.Количество = ТекСтрокаБСО.Количество;
		
		// регистр Renault_БСОНаТочкеПродаж Приход
		Если ПередатьНаТочкуПродажи Тогда 
			Движение = Движения.Renault_БСОНаТочкеПродаж.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.ТочкаПродаж = ТочкаПродаж;
			Движение.СтраховаяКомпания = СтраховаяКомпания;
			Движение.ТипБСО = ТекСтрокаБСО.ТипБСО;
			Движение.СерияБСО = ТекСтрокаБСО.СерияБСО;
			Движение.НомерБСО = ТекСтрокаБСО.НомерБСО;
			Движение.Количество = ТекСтрокаБСО.Количество;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Печать() Экспорт
	Renault_УчетБСО.ПечатьАктаПриемаПередачиБСО(Дата, Номер, СтраховаяКомпания, Организация, БСО);
КонецПроцедуры	

//Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
//	
//	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
//		
//		Если НЕ ЗначениеЗаполнено(СтраховаяКомпания) Тогда
//			Сообщить("Не указана страховая компания!");
//			Отказ  = истина;
//			Возврат;
//		КонецЕсли;	
//		
//		//ЕстьБСОВОрганизации = ложь;
//		//ЕстьБСОНаТочке = ложь;
//		ЕстьБСОНаТочках = ложь;
//		
//		Если ПередатьНаТочкуПродажи Тогда
//			ТаблицаБСО = Renault_УчетБСО.ПолучитьТаблицуБСОПоТабЧасти(БСО, Организация, СтраховаяКомпания, ТочкаПродаж);
//		Иначе
//			ТаблицаБСО = Renault_УчетБСО.ПолучитьТаблицуБСОПоТабЧасти(БСО, Организация, СтраховаяКомпания);
//		КонецЕсли;
//		
//		ЕстьБСОВОрганизации = Renault_УчетБСО.ПроверитьНаличиеБСО(Дата, ТаблицаБСО, Организация, СтраховаяКомпания);
//		
//		Если ПередатьНаТочкуПродажи Тогда
//			ЕстьБСОНаТочках = Renault_УчетБСО.ПроверитьНаличиеБСОНаТочках(Ссылка, ТаблицаБСО, Организация, неопределено, ТочкаПродаж);
//			//ЕстьБСОНаТочке = Renault_УчетБСО.ПроверитьНаличиеБСО(Дата, ТаблицаБСО, Организация, СтраховаяКомпания, ТочкаПродаж);
//		КонецЕсли;
//		
//		//Отказ = ЕстьБСОВОрганизации ИЛИ ЕстьБСОНаТочке;
//		Отказ = ЕстьБСОВОрганизации ИЛИ ЕстьБСОНаТочках;
//		
//	КонецЕсли;
//	
//КонецПроцедуры


