//Перем XML_Полный;
////Перем ТаблицаДляВыгрузки;
//Перем ТаблицаАвто;


Функция Avitoget(Запрос)
	
	сзПодразделенияСДочерними = СМ_ПубликацияОбъявлений.ПолучитьСписокПодразделенийСДочернимиИзЗапроса(Запрос);
	
	//Бондаренко++ 20220524
	сзМаркиАвто = СМ_ПубликацияОбъявлений.ПолучитьСписокМарокИзЗапроса(Запрос);
	//Бондаренко-- 20220524
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/xml; charset=utf-8");
	Ответ.Заголовки.Вставить("Connection", "Keep-Alive");
	Ответ.УстановитьТелоИзСтроки(СМ_ПубликацияОбъявлений.ПолучитьXMLОбъявленийAvito(сзПодразделенияСДочерними, сзМаркиАвто, Запрос));
	
	Возврат Ответ;
	
КонецФункции

Функция AutoruLCVget(Запрос)
	
	сзПодразделенияСДочерними = СМ_ПубликацияОбъявлений.ПолучитьСписокПодразделенийСДочернимиИзЗапроса(Запрос); 
	
	//Бондаренко++ 20220524
	сзМаркиАвто = СМ_ПубликацияОбъявлений.ПолучитьСписокМарокИзЗапроса(Запрос);
	//Бондаренко-- 20220524
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/xml; charset=utf-8");
	Ответ.Заголовки.Вставить("Connection", "Keep-Alive");
	Ответ.УстановитьТелоИзСтроки(СМ_ПубликацияОбъявлений.ПолучитьXMLОбъявленийAutoruLCV(сзПодразделенияСДочерними,сзМаркиАвто,Запрос));
	
	Возврат Ответ;
КонецФункции

Функция AutoruNewget(Запрос)
	сзПодразделенияСДочерними = СМ_ПубликацияОбъявлений.ПолучитьСписокПодразделенийСДочернимиИзЗапроса(Запрос);
	
	//Бондаренко++ 20220524
	сзМаркиАвто = СМ_ПубликацияОбъявлений.ПолучитьСписокМарокИзЗапроса(Запрос);
	//Бондаренко-- 20220524
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/xml; charset=utf-8");
	Ответ.Заголовки.Вставить("Connection", "Keep-Alive");
	Ответ.УстановитьТелоИзСтроки(СМ_ПубликацияОбъявлений.ПолучитьXMLОбъявленийAutoruNew(сзПодразделенияСДочерними,сзМаркиАвто,Запрос));
	
	Возврат Ответ;
КонецФункции

Функция AutoruUsedget(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция Photoget(Запрос)
	
	Vin = Запрос.ПараметрыURL["VIN"];
	Если Vin=Неопределено Тогда
		Ответ = Новый HTTPСервисОтвет(400,"ОШИБКА! Не заполнен VIN.");
		Возврат Ответ;
	КонецЕсли; 
	ImageNumber = Запрос.ПараметрыURL["ImageNumber"];
	ImageNumber = Сред(ImageNumber,1,СтрДлина(ImageNumber)-4);
	Если ImageNumber=Неопределено Тогда
		Ответ = Новый HTTPСервисОтвет(400,"ОШИБКА! Не заполнен ImageNumber.");
		Возврат Ответ;
	КонецЕсли;
	
	//Бондаренко++ 20220613
	//Картинка =  ПолучитьФотоАвтомобиля(Vin,ImageNumber);
	Картинка =  СМ_ПубликацияОбъявлений.ПолучитьФотоАвтомобиля(VIN,ImageNumber);
	//Бондаренко-- 20220613
	
	Если Картинка="" Тогда
		Ответ = Новый HTTPСервисОтвет(204,"ОШИБКА! Фотографии не существует.");
		Возврат Ответ;
	КонецЕсли; 
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "image/jpeg");
	Ответ.УстановитьТелоИзДвоичныхДанных(Картинка);
	Возврат Ответ;
	
	Возврат "";
	
КонецФункции

Функция TDealerNewget(Запрос)
	сзПодразделенияСДочерними = СМ_ПубликацияОбъявлений.ПолучитьСписокПодразделенийСДочернимиИзЗапроса(Запрос); 
	//Бондаренко++ 20220315
	сзМаркиАвто = СМ_ПубликацияОбъявлений.ПолучитьСписокМарокИзЗапроса(Запрос);
	//Бондаренко-- 20220315
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/xml; charset=utf-8");
	Ответ.Заголовки.Вставить("Connection", "Keep-Alive");
	Ответ.УстановитьТелоИзСтроки(СМ_ПубликацияОбъявлений.ПолучитьXMLОбъявленийTdealerNew(сзПодразделенияСДочерними,сзМаркиАвто,Запрос));
	
	Возврат Ответ;
КонецФункции

//Бондаренко++ 20220531
Функция AutoruLkget(Запрос)
	
	ТаблицаДляВыгрузки = СМ_ПубликацияОбъявлений.ПолучитьТаблицуЛичногоКабинетаАвтоРуИзЗапроса(Запрос);
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/xml; charset=utf-8");
	Ответ.Заголовки.Вставить("Connection", "Keep-Alive");
	Ответ.УстановитьТелоИзСтроки(СМ_ПубликацияОбъявлений.ПолучитьXMLОбъявленийAutoruLk(ТаблицаДляВыгрузки,Запрос));
	
	Возврат Ответ;
КонецФункции 

//Бондаренко++ 20230314
Функция AutoruLk1get(Запрос)
	
	ТаблицаДляВыгрузки = СМ_ПубликацияОбъявлений.ПолучитьТаблицуЛичногоКабинетаАвтоРуИзЗапроса(Запрос);
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/xml; charset=utf-8");
	Ответ.Заголовки.Вставить("Connection", "Keep-Alive");
	Ответ.УстановитьТелоИзСтроки(СМ_ПубликацияОбъявлений.ПолучитьXMLОбъявленийAutoruLk1(ТаблицаДляВыгрузки,Запрос));
	
	Возврат Ответ;
КонецФункции
//Бондаренко-- 20230314
 
//Бондаренко++ 20220613
Функция DromLkget(Запрос)
	
	ТаблицаДляВыгрузки = СМ_ПубликацияОбъявлений.ПолучитьТаблицуЛичногоКабинетаДромИзЗапроса(Запрос);
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/xml; charset=utf-8");
	Ответ.Заголовки.Вставить("Connection", "Keep-Alive");
	
	Ответ.УстановитьТелоИзСтроки(СМ_ПубликацияОбъявлений.ПолучитьXMLОбъявленийDromLk(ТаблицаДляВыгрузки,Запрос));
	
	Возврат Ответ;
КонецФункции  // DromLkget(Запрос)

//Бондаренко++ 20230314
Функция DromLk1get(Запрос)
	
	ТаблицаДляВыгрузки = СМ_ПубликацияОбъявлений.ПолучитьТаблицуЛичногоКабинетаДромИзЗапроса(Запрос);
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/xml; charset=utf-8");
	Ответ.Заголовки.Вставить("Connection", "Keep-Alive");
	
	Ответ.УстановитьТелоИзСтроки(СМ_ПубликацияОбъявлений.ПолучитьXMLОбъявленийDromLk1(ТаблицаДляВыгрузки,Запрос));
	
	Возврат Ответ;
КонецФункции  // DromLk1get(Запрос)
//Бондаренко++ 20230314

 //Бондаренко++ 20220603
Функция AvitoLkget(Запрос)
	//Бондаренко++ 20220630
	//ТаблицаДляВыгрузки = ПолучитьТаблицуЛичногоКабинетаАвитоИзЗапроса(Запрос);
	//Бондаренко-- 20220630
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/xml; charset=utf-8");
	Ответ.Заголовки.Вставить("Connection", "Keep-Alive");
	
	//Бондаренко++ 20220630
	//Ответ.УстановитьТелоИзСтроки(ПолучитьXMLОбъявленийAvitoLk(ТаблицаДляВыгрузки,Запрос));
	Ответ.УстановитьТелоИзСтроки(СМ_ПубликацияОбъявлений.ПолучитьXMLОбъявленийAvitoLk(Запрос));
	//Бондаренко-- 20220630
	
	Возврат Ответ;
КонецФункции  

 //Бондаренко++ 20220719
Функция AutoruLCVLkget(Запрос)
  	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/xml; charset=utf-8");
	Ответ.Заголовки.Вставить("Connection", "Keep-Alive");
	
	Ответ.УстановитьТелоИзСтроки(СМ_ПубликацияОбъявлений.ПолучитьXMLОбъявленийAutoruLCVLk(Запрос));
 	
	Возврат Ответ;
	
КонецФункции
 //Бондаренко-- 20220719 
 
  //Бондаренко++ 20230314
Функция AutoruLCVLk1get(Запрос)
  	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/xml; charset=utf-8");
	Ответ.Заголовки.Вставить("Connection", "Keep-Alive");
	
	Ответ.УстановитьТелоИзСтроки(СМ_ПубликацияОбъявлений.ПолучитьXMLОбъявленийAutoruLCVLk1(Запрос));
 	
	Возврат Ответ;
	
КонецФункции
 //Бондаренко-- 20230314


 //Бондаренко++ 20221215
Функция AvitoZapLkget(Запрос)

	Ответ = Новый HTTPСервисОтвет(200);
 	Ответ.Заголовки.Вставить("Content-Type", "text/xml; charset=utf-8");
	Ответ.Заголовки.Вставить("Connection", "Keep-Alive");
	
	Ответ.УстановитьТелоИзСтроки(СМ_ПубликацияОбъявлений.ПолучитьXMLОбъявленийAvitoZapLk(Запрос));
	
	Возврат Ответ;
	
КонецФункции 
//Бондаренко-- 20221215

 //Бондаренко++ 20230314
 Функция AvitoLk1get(Запрос)
	//Бондаренко++ 20220630
	//ТаблицаДляВыгрузки = ПолучитьТаблицуЛичногоКабинетаАвитоИзЗапроса(Запрос);
	//Бондаренко-- 20220630
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/xml; charset=utf-8");
	Ответ.Заголовки.Вставить("Connection", "Keep-Alive");
	
	//Бондаренко++ 20220630
	//Ответ.УстановитьТелоИзСтроки(ПолучитьXMLОбъявленийAvitoLk(ТаблицаДляВыгрузки,Запрос));
	Ответ.УстановитьТелоИзСтроки(СМ_ПубликацияОбъявлений.ПолучитьXMLОбъявленийAvitoLk1(Запрос));
	//Бондаренко-- 20220630
	
	Возврат Ответ;
КонецФункции  


Функция AutoruLkget1(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции
//Бондаренко-- 20230314

//Бондаренко++ 20230705
Функция LegoCarLkget(Запрос)
 	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/xml; charset=utf-8");
	Ответ.Заголовки.Вставить("Connection", "Keep-Alive");
	
 	Ответ.УстановитьТелоИзСтроки(СМ_ПубликацияОбъявлений.ПолучитьXMLОбъявленийLegoCarLk(Запрос,Истина));
 	
	Возврат Ответ;
КонецФункции
//Бондаренко-- 20230705