
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьУпр)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьУпр(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьУпр(ТабДок, ПараметрКоманды)
	Справочники.DMS_КарточкиКлиентов.ПечатьАктУпр(ТабДок, ПараметрКоманды);
КонецПроцедуры
