
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	////извращения для совместимости 8.2
	//СИ=Новый СистемнаяИнформация;
	//Если Число(Сред(СИ.ВерсияПриложения,3,1))<3 Тогда
	//	Элементы.кнСписка.Видимость=Ложь;
	//	ПоложениеКоманднойПанели=ПоложениеКоманднойПанелиФормы.Верх;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура кнДобавить(Команда)
	ОткрытьФорму(ОсновнаяТаблица()+".ФормаОбъекта",,ЭтаФорма,УникальныйИдентификатор,,,Новый ОписаниеОповещения("Оповещение",ЭтаФорма,"Обновить"),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
КонецПроцедуры

&НаКлиенте
Процедура кнИзменить(Команда) 
	Парам=Новый Структура("Ключ",Элементы.Список.ТекущаяСтрока);
	ОткрытьФорму(ОсновнаяТаблица()+".ФормаОбъекта",Парам,ЭтаФорма,УникальныйИдентификатор,,,Новый ОписаниеОповещения("Оповещение",ЭтаФорма,"Обновить"),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура кнОтбор(Команда)
	Источник=Renault_ОбщиеФункции.ИсточникДанныхФормы(ЭтаФорма,"Список");
	Renault_ОбщиеФункции.ОткрытьФормуОтбора(ЭтаФорма,Источник,Список.КомпоновщикНастроек,"Оповещение","Отбор",Истина);
КонецПроцедуры

&НаКлиенте
Процедура кнУдалить(Команда) Удалить() КонецПроцедуры
Процедура Удалить()
	Если Элементы.Список.ТекущаяСтрока=Неопределено Тогда Возврат КонецЕсли;
	Элементы.Список.ТекущаяСтрока.ПолучитьОбъект().УстановитьПометкуУдаления(НЕ Элементы.Список.ТекущаяСтрока.ПометкаУдаления);
	Элементы.Список.Обновить();
КонецПроцедуры	

&НаКлиенте
Процедура кнПериод(Команда)
	НастройкаПериода=Новый НастройкаПериода;
	НастройкаПериода.ДатаНачала=Элементы.Список.Период.ДатаНачала;
	НастройкаПериода.ДатаОкончания=Элементы.Список.Период.ДатаОкончания;
	НастройкаПериода.ВариантПериода=ВариантПериода.ПроизвольныйИнтервал;
	НастройкаПериода.Редактировать();
	Элементы.Список.Период.ДатаНачала=НастройкаПериода.ДатаНачала;
	Элементы.Список.Период.ДатаОкончания=НастройкаПериода.ДатаОкончания;
КонецПроцедуры

Процедура Оповещение(Парам1,Парам2) Экспорт
	Если Парам2="Обновить" Тогда Элементы.Список.Обновить()
	ИначеЕсли Парам2="Отбор" Тогда
		Если Парам1=Неопределено Тогда Возврат КонецЕсли;		
		Список.КомпоновщикНастроек.ЗагрузитьНастройки(Парам1.Настройки);
	КонецЕсли;
КонецПроцедуры

Функция ОсновнаяТаблица() Возврат ?(Список.ПроизвольныйЗапрос,"",Список.ОсновнаяТаблица) КонецФункции	