
Функция ПолучитьИсториюСоообщений(вхКлиент,ФормаОткрыта)Экспорт
	ТаблицаСообщений = Новый ТаблицаЗначений();
	Если не ФормаОткрыта Тогда
		Клиент = ПривестиКТипу("Клиент",вхКлиент);
	КонецЕсли;
	Запрос = новый Запрос("ВЫБРАТЬ
	                      |	Renault_ОК_Сообщения.id_mess,
	                      |	Renault_ОК_Сообщения.is_for КАК Кому,
	                      |	Renault_ОК_Сообщения.is_from КАК ОтКого,
	                      |	Renault_ОК_Сообщения.wr_date КАК ДатаСообщения,
	                      |	Renault_ОК_Сообщения.id_user КАК ИдПользователя,
	                      |	Renault_ОК_Сообщения.Обработано,
	                      |	Renault_ОК_Сообщения.Клиент,
	                      |	Renault_ОК_Сообщения.IDТрафика,
	                      |	Renault_ОК_Сообщения.messages КАК Сообщение,
	                      |	Renault_ОК_Сообщения.Внутренний,
	                      |	Renault_ОК_Сообщения.ИмяПользователя КАК ИмяПользователя,
	                      |	Renault_ОК_Сообщения.Клиент.Наименование КАК НаименованиеКлиента
	                      |ИЗ
	                      |	РегистрСведений.Renault_ОК_Сообщения КАК Renault_ОК_Сообщения
	                      |ГДЕ
	                      |	Renault_ОК_Сообщения.Клиент = &Клиент
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДатаСообщения");
	Запрос.УстановитьПараметр("Клиент",Клиент);
	ТаблицаСоообщений = Запрос.Выполнить().Выбрать();
	Возврат ТаблицаСоообщений;
	
КонецФункции
Функция ПолучитьИсториюЛидов(вхКлиент,ФормаОткрыта)Экспорт
	Если не ФормаОткрыта Тогда
		Клиент = ПривестиКТипу("Клиент",вхКлиент);
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_Трафик.Клиент,
	               |	Renault_WebLMT.INT_COMMENTAIRE КАК Сообщение,
	               |	Renault_WebLMT.TYPE_LEAD КАК Тип,
	               |	Renault_WebLMT.SOUS_TYPE_LEAD КАК ПодТип,
	               |	Renault_Трафик.Период КАК ДатаСообщения,
	               |	Renault_Трафик.Комментарий,
	               |	1 КАК ВидСообщения
	               |ИЗ
	               |	РегистрСведений.Renault_WebLMT КАК Renault_WebLMT
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_Трафик КАК Renault_Трафик
	               |		ПО Renault_WebLMT.ИдТрафика = Renault_Трафик.Идентификатор
	               |ГДЕ
	               |	Renault_Трафик.Клиент = &Клиент
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Renault_Трафик.Клиент,
	               |	Renault_ОтветыНаЛиды.Ответ,
	               |	"""",
	               |	"""",
	               |	Renault_ОтветыНаЛиды.ДатаОтвета,
	               |	Renault_Трафик.Комментарий,
	               |	Renault_ОтветыНаЛиды.ВидСообщения
	               |ИЗ
	               |	РегистрСведений.Renault_ОтветыНаЛиды КАК Renault_ОтветыНаЛиды
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_Трафик КАК Renault_Трафик
	               |		ПО Renault_ОтветыНаЛиды.ИдТрафика = Renault_Трафик.Идентификатор
	               |ГДЕ
	               |	Renault_Трафик.Клиент = &Клиент
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаСообщения";
	Запрос.УстановитьПараметр("Клиент", Клиент);
	//Запрос.УстановитьПараметр("ИдТрафика", ВыбранныйТрафикID);
	Табл = Запрос.Выполнить().Выгрузить();
	Возврат Табл;
КонецФункции

Процедура ДобавитьТэгШтмл(КодШтмл,Тэг,УровеньТэга = 0, СтруктураПараметров = Неопределено, СтрокаСодержимогоТэга="", ТребуетЗакрытия = Ложь) Экспорт
	НачалоТега ="<"+Тэг;
	АтрибутыТега ="";
	КонецТега =">";
	Если НЕ(СтруктураПараметров = Неопределено) Тогда
		Для Каждого СоответсвиеПараметра Из СтруктураПараметров Цикл
			АтрибутыТега =АтрибутыТега+" "+ СоответсвиеПараметра.Ключ+"="+СоответсвиеПараметра.Значение;	
		КонецЦикла;
	КонецЕсли;
	КодШтмл = КодШтмл+Символы.ПС;
	Если (УровеньТэга >= 0) И (УровеньТэга <=8)Тогда 
		Для ит = 0 по УровеньТэга Цикл
			КодШтмл=КодШтмл+Символы.Таб;
		КонецЦикла;
	КонецЕсли;
	КодШтмл = КодШтмл+НачалоТега+АтрибутыТега+КонецТега;
	Если СтрДлина(СтрокаСодержимогоТэга)> 0 Тогда
	   КодШтмл =КодШтмл+СтрокаСодержимогоТэга;
   	КонецЕсли;
	Если ТребуетЗакрытия Тогда
		КодШтмл = КодШтмл+"</"+Тэг+КонецТега;
	КонецЕсли;
		
КонецПроцедуры

Функция СтруктураПараметровКартинки(СсылкаНаКартинку ="", Ширина ="", Высота ="", Класс="") Экспорт
	Ответ = Новый Структура();	
	Если ЗначениеЗаполнено(СсылкаНаКартинку) Тогда
		Ответ.Вставить("src",СсылкаНаКартинку);
	КонецЕсли;
	Если ЗначениеЗаполнено(Ширина) Тогда
		Ответ.Вставить("width",Ширина);
	КонецЕсли;
	Если ЗначениеЗаполнено(Высота) Тогда
		Ответ.Вставить("height",Высота);
	КонецЕсли;
	Если ЗначениеЗаполнено(Класс) Тогда
		Ответ.Вставить("class",Класс);
	КонецЕсли;
	Если ЗначениеЗаполнено(Ответ) Тогда
		Возврат Ответ;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция СтруктураПараметровТаблицы(Ширина ="", Высота ="", Класс="") Экспорт
	Ответ = Новый Структура();	
	Если ЗначениеЗаполнено(Ширина) Тогда
		Ответ.Вставить("width",Ширина);
	КонецЕсли;
	Если ЗначениеЗаполнено(Высота) Тогда
		Ответ.Вставить("height",Высота);
	КонецЕсли;
	Если ЗначениеЗаполнено(Класс) Тогда
		Ответ.Вставить("class",Класс);
	КонецЕсли;
	Если ЗначениеЗаполнено(Ответ) Тогда
		Возврат Ответ;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция СтруктураПараметровЯчейки(Ширина ="", Высота ="", Класс="", ВыравниваниеПоГоризонтали="", ВыравниваниеПоВертикали="") Экспорт
	Ответ = Новый Структура();	
	Если ЗначениеЗаполнено(Ширина) Тогда
		Ответ.Вставить("width",Ширина);
	КонецЕсли;
	Если ЗначениеЗаполнено(Высота) Тогда
		Ответ.Вставить("height",Высота);
	КонецЕсли;
	Если ЗначениеЗаполнено(Класс) Тогда
		Ответ.Вставить("class",Класс);
	КонецЕсли;
	Если ЗначениеЗаполнено(ВыравниваниеПоГоризонтали) Тогда
		Ответ.Вставить("align",ВыравниваниеПоГоризонтали);
	КонецЕсли;
	Если ЗначениеЗаполнено(ВыравниваниеПоВертикали) Тогда
		Ответ.Вставить("valign",ВыравниваниеПоВертикали);
	КонецЕсли;

	Если ЗначениеЗаполнено(Ответ) Тогда
		Возврат Ответ;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция СтруктураПараметровТелаДокумента(Класс="", ПриЗагрузке="") Экспорт
	Ответ = Новый Структура();	
	Если ЗначениеЗаполнено(Класс) Тогда
		Ответ.Вставить("class",Класс);
	КонецЕсли;
	Если ЗначениеЗаполнено(ПриЗагрузке) Тогда
		Ответ.Вставить("onload",ПриЗагрузке);
	КонецЕсли;

	Если ЗначениеЗаполнено(Ответ) Тогда
		Возврат Ответ;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция СтруктураПараметровМета(Кодировка="") Экспорт
	Ответ = Новый Структура();	
	Если ЗначениеЗаполнено(Кодировка) Тогда
		Ответ.Вставить("charset",Кодировка);
	КонецЕсли;
	Если ЗначениеЗаполнено(Ответ) Тогда
		Возврат Ответ;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ОписаниеКласса (ИмяКласса,Параметры,УровеньТэга = 0) Экспорт
	Ответ ="";
	Если (УровеньТэга >= 0) И (УровеньТэга <=8)Тогда 
		Для ит = 0 по УровеньТэга Цикл
			Ответ=Ответ+Символы.Таб;
		КонецЦикла;
	КонецЕсли;
    Ответ =Ответ+ "."+ИмяКласса+" {"+Символы.ПС+Параметры+Символы.ПС+"}";
	Возврат Ответ;
КонецФункции

Функция ОписаниеФункции (ИмяФункции, Параметры, УровеньТэга = 0) Экспорт
	Ответ ="";
	Если (УровеньТэга >= 0) И (УровеньТэга <=8)Тогда 
		Для ит = 0 по УровеньТэга Цикл
			Ответ=Ответ+Символы.Таб;
		КонецЦикла;
	КонецЕсли;
    Ответ =Ответ+ "function "+ИмяФункции+" {"+Символы.ПС+Параметры+Символы.ПС+"}";
	Возврат Ответ;
КонецФункции


Функция ПривестиКТипу(Реквизит, Значение) Экспорт
	Мета = Метаданные();
	рекв = Мета.Реквизиты[Реквизит];
	Возврат Рекв.Тип.ПривестиЗначение(Значение);
КонецФункции
