
// Формирует значения по умолчанию реквизитов плательщика и получателя для банковских платежных документов
//
// Параметры
//  Плательщик  		– <СправочникСсылка.Организации>/<СправочникСсылка.Контрагенты> – плательщик, владелец банковского счета
//  СчетПлательщика		– <СправочникСсылка.БанковскиеСчета> – банковский счет плательщика
//  Получатель  		– <СправочникСсылка.Организации>/<СправочникСсылка.Контрагенты> – получатель, владелец банковского счета
//  СчетПолучателя		– <СправочникСсылка.БанковскиеСчета> – банковский счет получателя
//  ПеречислениеВБюджет	– <Булево> – флаг перечисления в бюджет
//
// Возвращаемое значение:
//   <Структура>		– структура строковых реквизитов плательщика и получателя
//						  ключи структуры: 
//							ТекстПлательщика, ИННПлательщика, КПППлательщика, 
//							ТекстПолучателя, ИННПолучателя, КПППолучателя
//							НаименованиеБанкаПлательщика, НомерСчетаПлательщика, БикБанкаПлательщика, СчетБанкаПлательщика 
//							НаименованиеБанкаПолучателя, НомерСчетаПолучателя, БикБанкаПолучателя, СчетБанкаПолучателя
//
Функция СформироватьАвтоЗначенияРеквизитовПлательщикаПолучателя(Плательщик, СчетПлательщика, Получатель, СчетПолучателя, ПеречислениеВБюджет = Ложь) Экспорт

	ЗначенияРеквизитов = Новый Структура;
	
	ЗначенияРеквизитов.Вставить("ТекстПлательщика", "");
	
	ЗначенияРеквизитов.Вставить("ИННПлательщика", "");

	ЗначенияРеквизитов.Вставить("КПППлательщика", "");
	
	ЗначенияРеквизитов.Вставить("ТекстПолучателя", "");
	
	ЗначенияРеквизитов.Вставить("ИННПолучателя", "");

	ЗначенияРеквизитов.Вставить("КПППолучателя", "");
	ЗначенияРеквизитов.Вставить("НаименованиеБанкаПлательщика","");
	ЗначенияРеквизитов.Вставить("НомерСчетаПлательщика", "");
	ЗначенияРеквизитов.Вставить("БикБанкаПлательщика", "");
	ЗначенияРеквизитов.Вставить("СчетБанкаПлательщика", "");

	ЗначенияРеквизитов.Вставить("НаименованиеБанкаПолучателя", "");
	ЗначенияРеквизитов.Вставить("НомерСчетаПолучателя", "");
	ЗначенияРеквизитов.Вставить("БикБанкаПолучателя", "");
	ЗначенияРеквизитов.Вставить("СчетБанкаПолучателя", "");
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции //СформироватьАвтоЗначенияРеквизитовПлательщикаПолучателя()
