Функция СоздатьИнцидент(СтруктураПараметров) Экспорт
	
	МЗ = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ,СтруктураПараметров);
	МЗ.Прочитать(); //Всегда считываем
	
	ЗаполнитьЗначенияСвойств(МЗ,СтруктураПараметров);
	Если НЕ ЗначениеЗаполнено(МЗ.GUID) тогда //нужно добавить GUID
		GUID = Новый УникальныйИдентификатор();
		МЗ.GUID = Строка(GUID);
		
		МЗ.Записать(Истина);
	Иначе
		GUID = Новый УникальныйИдентификатор();
	КонецЕсли;
	
	Возврат Строка(GUID);
	
КонецФункции

Функция ИнцидентыСуществуют(ЗаказНаряд) Экспорт
	
	НЗ = СоздатьНаборЗаписей();
	НЗ.Отбор.ЗаказНаряд.Установить(ЗаказНаряд);
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь
	КонецЕсли;
	
КонецФункции

Процедура ОбновитьИнцидент(СтруктураПараметров) Экспорт
	
	МЗ = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ,СтруктураПараметров,"ЗаказНаряд,GUID,Intervention","RC_code,Function_Code,OTS_number,НомерСФ,ДатаСФ,ПробегПриУстановке");
	МЗ.Прочитать(); //Всегда считываем
	
	ЗаполнитьЗначенияСвойств(МЗ,СтруктураПараметров);
	Если НЕ ЗначениеЗаполнено(МЗ.GUID) тогда //нужно добавить GUID
		GUID = Новый УникальныйИдентификатор();
		МЗ.GUID = Строка(GUID);
	КонецЕсли;
	
	МЗ.Записать(Истина);
	
КонецПроцедуры

Процедура УдалитьИнцидент(ИдентификаторИнцидента) Экспорт
	
	НЗ = СоздатьНаборЗаписей();
	НЗ.Отбор.GUID.Установить(ИдентификаторИнцидента);
	НЗ.Прочитать();
	НЗ.Очистить();
	НЗ.Записать();
	
КонецПроцедуры

Процедура УдалитьЗаписиПоЗаказНаряду(ЗаказНаряд) Экспорт
	
	НЗ = СоздатьНаборЗаписей();
	НЗ.Отбор.ЗаказНаряд.Установить(ЗаказНаряд);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 тогда
		
		НЗ.Очистить();
		НЗ.Записать();
		
	КонецЕсли;
	
КонецПроцедуры
