//общие функции
//#Область ОбщиеФункции
Функция ИмяЗакладки() Возврат ПунктыМеню[ТекущаяЗакладкаМеню].Значение КонецФункции
Функция ИмяСписка() Возврат "сп"+ИмяЗакладки() КонецФункции 
Функция ТекстЗапросИсточникаДанных(ИмяСписка) Возврат ?(ЭтаФорма[ИмяСписка].ПроизвольныйЗапрос,ЭтаФорма[ИмяСписка].ТекстЗапроса,"") КонецФункции	
Функция ПолучитьИсточникНаСервере(ИмяСписка) Возврат Renault_ОбщиеФункции.ИсточникДанныхФормы(ЭтаФорма,ИмяСписка) КонецФункции
Функция ПолучитьПроизвольныйИсточникНаСервере(ИмяСписка) Возврат Renault_ОбщиеФункции.ПроизвольныйИсточникДанных(ТекстЗапросИсточникаДанных(ИмяСписка)) КонецФункции
//#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Дата1=НачалоМесяца(ТекущаяДата());
	Дата2=ТекущаяДата();
	УстановитьЗаголовок();

	ДилерскийЦентр=Renault_РаботаСПравамиПользователя.ДилерскийЦентрПоУмолчанию(Renault_ОбщиеФункцииСервер.ТекущийПользователь());
	Отдел=Renault_CRM.ПолучитьОтделАвтосалона();
	
	// Проверка на доступ к работе с АРМ
	Если НЕ Renault_РаботаСПравамиПользователя.ЕстьПравоИспользоватьАрмРесепшена(Renault_ОбщиеФункцииСервер.ТекущийПользователь()) Тогда
		Сообщить("У вас нет прав на запуск АРМ Администратор зала");
		Отказ=Истина;
		Возврат
	КонецЕсли;
	
	ПунктыМеню.Добавить("РегистрацияТрафика");
	ПунктыМеню.Добавить("Трафик");
	ПунктыМеню.Добавить("ТестДрайв");
	ПунктыМеню.Добавить("Диаграммы");
	ПунктыМеню.Добавить("Фото");
	Если ДилерскийЦентр.ИспользуетАвтосервис Тогда
		ПунктыМеню.Добавить("ЗаписьНаСервис");
	КонецЕсли;
	
	ТекущаяЗакладкаМеню=0;
	УстановитьПараметрыСписков();
	УстановитьОтбор();
	
	ТекущийРежимДиаграммы=Элементы.кнСпДиаграммы.ПодчиненныеЭлементы[0].Имя;
	ПередатьФотоСотрудников();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	Если Не Renault_РаботаСПравамиПользователя.ЕстьПравоОткрытияПодсистемыАвтосервиса(ПараметрыСеанса.Пользователь) тогда
		Сообщить("Недостаточно прав доступа.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	//брендовое оформление
	Массив=Новый Массив;
	Для Каждого Эл Из Элементы.кнМеню.ПодчиненныеЭлементы Цикл Массив.Добавить(Эл) КонецЦикла;	
	
	Renault_ОбщиеФункции.МультибрендЗадатьОформление(Массив,"ЦветФона","ДопЦвет2");
	Renault_ОбщиеФункции.МультибрендЗадатьОформление(Массив,"ЦветРамки","ДопЦвет2");
	Renault_ОбщиеФункции.МультибрендЗадатьОформление(Массив,"ЦветТекста","ЦветТекста");
	
	//Массив=Новый Массив;
	//Массив.Добавить(Элементы.кнОтбор);
	//Массив.Добавить(Элементы...);
	//Renault_ОбщиеФункции.МультибрендЗадатьОформление(Массив,"ЦветФона","ОсновнойЦвет");
	
	Массив=Новый Массив;
	Массив.Добавить(Элементы.Logo);
	Renault_ОбщиеФункции.МультибрендЗадатьОформление(Массив,"Картинка","Логотип");
	
	УправлениеМеню();
	
	//условное оформление задач
	//Эл=спЗадачи.УсловноеОформление.Элементы.Добавить();
	//Эл.Оформление.Элементы[0].Значение=Новый Цвет(255,207,0); //цвет фона
	//Эл.Оформление.Элементы[0].Использование=Истина;
	//Отбор=Эл.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//Отбор.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	//Отбор.Использование=Истина;                        
	//Отбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Исполнитель");
	//Отбор.ПравоеЗначение=Renault_ОбщиеФункцииСервер.ТекущийПользователь();
	
	//загрузка файлов картинок
	мАдресаФайлов=ПолучитьАдресаИзСтроки();
	
	Каталог=КаталогВременныхФайлов()+"img"; СоздатьКаталог(Каталог);
	НКол=1;
	Поля="<tr>";
	Для Н=1 По мАдресаФайлов.Количество() Цикл
		Адрес=мАдресаФайлов[Н-1];
		ИмяФайла=Каталог+"\img"+Формат(Н,"ЧГ=0");
		
		МассивОписаний=Новый Массив; 
		МассивОписаний.Добавить(Новый ОписаниеПередаваемогоФайла(ИмяФайла,Адрес));
		Если ПолучитьФайлы(МассивОписаний,,,Ложь) Тогда
			Если НКол=4 Тогда Поля=Поля+"</tr><tr>"; НКол=1 КонецЕсли;
			Поля=Поля+"<td><IMG src='"+ИмяФайла+"'></td>";
		КонецЕсли;	

		НКол=НКол+1;	
	КонецЦикла;
	Поля=Поля+"</tr>";
	
	ФотоТекстHTML="<HTML><BODY><TABLE width='100%'><TBODY>"+Поля+"</TBODY></TABLE></BODY></HTML>";
	ОтчетДиаграмма();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресаИзСтроки()
	
	Возврат ЗначениеИзСтрокиВнутр(АдресаФайлов);
	
КонецФункции

Процедура УстановитьЗаголовок() Заголовок="АРМ Администратор ("+Renault_ОбщиеФункцииСервер.ПериодСтрокой(Дата1,Дата2)+")" КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьДиаграммуМенеджера(Элемент="") ДиаграммаМенеджеров() КонецПроцедуры
Процедура ДиаграммаМенеджеров() 
	
	ЦветАкт=Вычислить(Renault_ОбщиеФункцииСервер.МультибрендПараметрыОформления().ОсновнойЦвет);
	ЦветДоп1=Вычислить(Renault_ОбщиеФункцииСервер.МультибрендПараметрыОформления().ДопЦвет1);
	ЦветДоп2=Вычислить(Renault_ОбщиеФункцииСервер.МультибрендПараметрыОформления().ДопЦвет2);
	
	Если ПереключательДиаграммМенеджера=0 или ПереключательДиаграммМенеджера=1 Тогда //Распределение посещений, //Распределение звонков
		
		ДиаграммаПоМенеджерам.Обновление=Ложь;
		ДиаграммаПоМенеджерам.Очистить();
		ДиаграммаПоМенеджерам.АвтоТранспонирование=Ложь;
		
		Запрос=Новый Запрос("
		|ВЫБРАТЬ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Идентификатор) Количество, Представление(Менеджер) Сотрудник
		|ИЗ РегистрСведений.Renault_Трафик
		|ГДЕ Период МЕЖДУ &НачПериода И &КонПериода И Отдел=&Отдел И ТипТрафика=&ТипТрафика
		|СГРУППИРОВАТЬ ПО Менеджер");
		Запрос.УстановитьПараметр("НачПериода", Дата1);
		Запрос.УстановитьПараметр("КонПериода", КонецДня(Дата2));
		Запрос.УстановитьПараметр("ТипТрафика", ?(ПереключательДиаграммМенеджера=0,Справочники.CRM_ТипТрафика.ПосещениеАвтосалона,Справочники.CRM_ТипТрафика.Звонок));
		Запрос.УстановитьПараметр("ПервичныйПовторный", Перечисления.CRM_ПервичныйПовторный.Первичный);
		Запрос.УстановитьПараметр("Отдел",Отдел);
		Серия=ДиаграммаПоМенеджерам.УстановитьСерию("МА");
		Результат = Запрос.Выполнить();
		Таблица = Результат.Выгрузить();
		
		СреднееЗначение = Таблица.Итог("Количество")/?(Таблица.Количество()=0,1,Таблица.Количество());
		НовСрЗн = Таблица.Добавить();
		НовСрЗн.Сотрудник = "Средний показатель";
		НовСрЗн.Количество = СреднееЗначение;
		Таблица.Сортировать("Количество убыв, Сотрудник убыв");
		
		//Всего = ДиаграммаПоМенеджерам.Серии.Добавить("Сумма");
		Для каждого Строка из Таблица Цикл 
			Точка = ДиаграммаПоМенеджерам.Точки.Добавить(СокрЛП(Строка.Сотрудник)); 
			Если НЕ Строка.Сотрудник="Средний показатель" Тогда
				Если Строка.Количество>=Окр(СреднееЗначение) Тогда
					Точка.Цвет=ЦветАкт; //Желтый
				Иначе
					Точка.Цвет=ЦветДоп2; //Темно-серый
				КонецЕсли;
			Иначе
				Точка.Цвет=ЦветДоп1; //Серый
			КонецЕсли;
			Точка.ПриоритетЦвета = Истина;
			ДиаграммаПоМенеджерам.УстановитьЗначение(Точка, Серия, Строка.Количество);
		КонецЦикла;
		
		ДиаграммаПоМенеджерам.ЦветРамки=Новый Цвет(255,255,255);
		ДиаграммаПоМенеджерам.ПоложениеПодписей=ПоложениеПодписейКДиаграмме.Край;
		ДиаграммаПоМенеджерам.АвтоТранспонирование=Истина;
		ДиаграммаПоМенеджерам.ПодписиШкалыЗначенийИзмерительнойДиаграммыВдольШкалы=Истина;
		ДиаграммаПоМенеджерам.ОтображениеЗначенияИзмерительнойДиаграммы=ОтображениеЗначенияИзмерительнойДиаграммы.Сектор;
		ДиаграммаПоМенеджерам.ПоложениеПодписейШкалыЗначенийИзмерительнойДиаграммы=ПоложениеПодписейШкалыЗначенийИзмерительнойДиаграммы.НаШкале;
		ДиаграммаПоМенеджерам.АвтоУстановкаТекстаТочек=Истина;
		ДиаграммаПоМенеджерам.АвтоУстановкаИменТочек=Истина;
		ДиаграммаПоМенеджерам.ВидПодписей=ВидПодписейКДиаграмме.Значение;
		ДиаграммаПоМенеджерам.Обновление=Истина;
		
		Элементы.ДиаграммаПоМенеджерам.Видимость=Истина;
		Элементы.АктивностьМенеджеров.Видимость=Ложь;
		
	ИначеЕсли ПереключательДиаграммМенеджера=2 Тогда //Статусы менеджеров
		СписокСотрудников=Renault_CRM.ПолучитьСписокСотрудниковПоОтделу(Отдел);
		АктивностьМенеджеров.Загрузить(Renault_CRM.ПолучитьСтатусыСотрудников(СписокСотрудников.ВыгрузитьЗначения()).Скопировать());
		
		Элементы.ДиаграммаПоМенеджерам.Видимость=Ложь;
		Элементы.АктивностьМенеджеров.Видимость=Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПередатьФотоСотрудников()
	МассивАдресовФайлов=Новый Массив;
	Запрос=Новый Запрос("Выбрать * Из РегистрСведений.КартинкиИФайлы ГДЕ Картинка И Объект В(
	|	Выбрать Различные Сотрудник Из Справочник.CRM_ДилерскиеЦентры.СотрудникиДляОтображенияВСтатусБареАдминистартора
	|	ГДЕ Не Сотрудник.ПометкаУдаления И НЕ Сотрудник.ЭтоГруппа И Сотрудник.Подразделение В(&спПодразделения)
	|)");
	Запрос.УстановитьПараметр("спПодразделения",Отдел.Подразделения.ВыгрузитьКолонку("Подразделение"));
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//динамическое добавление элементов
		//Эл=Элементы.Добавить("img"+Формат(Н,"ЧГ=0"),Тип("ДекорацияФормы"),Элементы.спФото);
		//Эл.Вид=ВидДекорацииФормы.Картинка;
		//Эл.Картинка=?(Выборка.ДанныеВоВнешнемФайле,Новый Картинка(Выборка.ИмяФайла),Выборка.Данные.Получить());
		
		Если Выборка.ДанныеВоВнешнемФайле Тогда ИмяФайла=Выборка.ИмяФайла
		Иначе
			ИмяФайла=ПолучитьИмяВременногоФайла();
			Выборка.Данные.Получить().Записать(ИмяФайла);
		КонецЕсли;
		
		МассивАдресовФайлов.Добавить(ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайла),УникальныйИдентификатор));
	КонецЦикла;
	АдресаФайлов=ЗначениеВСтрокуВнутр(МассивАдресовФайлов);
КонецПроцедуры	

Процедура УстановитьОтбор()
	
	//трафик
	Эл=спТрафик.Отбор.Элементы[0]; Эл.ПравоеЗначение=ДилерскийЦентр; Эл.Использование=Не ДилерскийЦентр.Пустая();
	Эл=спТрафик.Отбор.Элементы[1]; Эл.ПравоеЗначение=Отдел; Эл.Использование=Не Отдел.Пустая();
	
	//тестдрайв
	Эл=спТестДрайв.Отбор.Элементы[0]; Эл.ПравоеЗначение=ДилерскийЦентр; Эл.Использование=Не ДилерскийЦентр.Пустая();
	
	////отбор по задачам где по исполнителю либо с пустым исполнителем но своим отделом	
	//Права=ПараметрыСеанса.Renault_ПраваПользователя;
	//спЗадачи.Отбор.Элементы.Очистить();
	//
	////Если ВключенОтборЗадачи Тогда 
	//	ГруппаОтбораИли=спЗадачи.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	//	ГруппаОтбораИли.Использование=Истина;
	//	ГруппаОтбораИли.ТипГруппы=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	//	
	//	ЭлементОтбора=ГруппаОтбораИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	//	ЭлементОтбора.Использование=Истина;
	//	ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Исполнитель");
	//	ЭлементОтбора.ПравоеЗначение=Renault_ОбщиеФункцииСервер.ТекущийПользователь();
	//	
	//	ЭлементОтбора=ГруппаОтбораИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	//	ЭлементОтбора.Использование=Истина;
	//	ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Автор");
	//	ЭлементОтбора.ПравоеЗначение=Renault_ОбщиеФункцииСервер.ТекущийПользователь();
	//	
	//	ГруппаОтбораИ=ГруппаОтбораИли.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	//	ГруппаОтбораИ.Использование=Истина;
	//	ГруппаОтбораИ.ТипГруппы=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	//	
	//	//ДилерскийЦентр
	//	ЭлементОтбора=ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	//	ЭлементОтбора.Использование=Истина;
	//	ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ДилерскийЦентр");
	//	ЭлементОтбора.ПравоеЗначение=Renault_CRM.ПолучитьДилерскийЦентрПользователя(Renault_ОбщиеФункцииСервер.ТекущийПользователь());

	//	//Подразделение
	//	ЭлементОтбора=ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	//	ЭлементОтбора.Использование=Истина;
	//	ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Подразделение");
	//	ЭлементОтбора.ПравоеЗначение=Renault_ОбщиеФункцииСервер.ТекущийПользователь().Сотрудник.Подразделение;
	//	
	//	//Отдел
	//	ЭлементОтбора=ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	//	ЭлементОтбора.Использование=Истина;
	//	ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Отдел");
	//	ЭлементОтбора.ПравоеЗначение=Renault_РаботаСПравамиПользователя.ОтделпоУмолчанию(Renault_ОбщиеФункцииСервер.ТекущийПользователь());
	//	
	//	//Сотрудник пустой или сотрудник текущего пользователя
	//	ЭлементОтбора=ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.ВСписке;
	//	ЭлементОтбора.Использование=Истина;
	//	ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Сотрудник");
	//	Сп=Новый СписокЗначений;
	//	Сп.Добавить(Справочники.Пользователи.ПустаяСсылка());
	//	Сп.Добавить(Renault_ОбщиеФункции.СотрудникПользователя(Renault_ОбщиеФункцииСервер.ТекущийПользователь()));
	//	ЭлементОтбора.ПравоеЗначение=Сп;
	//	
	////Иначе 	
	////	спЗадачи.Отбор.Элементы.Очистить()
	////КонецЕсли;

	////отбор по видам задач
	//Массив=Новый Массив;
	//Массив.Добавить(Перечисления.Renault_ОбластиПрименения.Общие);
	//Массив.Добавить(Перечисления.Renault_ОбластиПрименения.ОФУ);
	//Сп=Новый СписокЗначений;
	//Сп.ЗагрузитьЗначения(Справочники.CRM_ВидыСобытий.РазрешенныеВидыСобытийПоОбластямПрименения(Массив,"Просмотр"));
	//ЭлементОтбора=спЗадачи.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	//ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.ВСписке;
	//ЭлементОтбора.Использование=Истина;
	//ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ВидСобытия");
	//ЭлементОтбора.ПравоеЗначение=Сп;
	//
	//ЭлементОтбора=спЗадачи.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	//ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.Использование=Истина;
	//ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Выполнена");
	//ЭлементОтбора.ПравоеЗначение=Ложь;
	//
	////НаборКнопокСписка(); //для того чтобы обновить состав и подсказки тех кнопок что были не видны
	//
	//УстановитьПараметрыСписков();
	//
	////ГруппаОтбораИ=спСтраховыеПолисы.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	////ГруппаОтбораИ.Использование=Истина;
	////ГруппаОтбораИ.ТипГруппы=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	////
	////ЭлементОтбора=ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	////ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	////ЭлементОтбора.Использование=Истина;
	////ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ДатаНачалаСтрахования");
	////ЭлементОтбора.ПравоеЗначение=КонецДня(ТекущаяДата());
	////
	////ЭлементОтбора=ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	////ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	////ЭлементОтбора.Использование=Истина;
	////ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ДатаОкончанияСтрахования");
	////ЭлементОтбора.ПравоеЗначение=ДобавитьМесяц(НачалоМесяца(ТекущаяДата()),-1);
	////
	////ЭлементОтбора=ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	////ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	////ЭлементОтбора.Использование=Истина;
	////ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ДатаОкончанияСтрахования");
	////ЭлементОтбора.ПравоеЗначение=ДобавитьМесяц(КонецМесяца(ТекущаяДата()),1);
	
КонецПроцедуры
Процедура УстановитьПараметрыСписков()
	
	//трафик
	Эл=спТрафик.Параметры.Элементы.Найти("Дата1");
	Эл.Значение=?(Дата1='00010101','20000101',Дата1);
	Эл.Использование=Истина;
	
	Эл=спТрафик.Параметры.Элементы.Найти("Дата2");
	Эл.Значение=?(Дата2='00010101',КонецГода(ТекущаяДата()),КонецДня(Дата2));
	Эл.Использование=Истина;
	
	//тестдрайв
	Эл=спТестДрайв.Параметры.Элементы.Найти("Дата1");
	Эл.Значение=?(Дата1='00010101','20000101',Дата1);
	Эл.Использование=Истина;
	
	Эл=спТестДрайв.Параметры.Элементы.Найти("Дата2");
	Эл.Значение=?(Дата2='00010101',КонецГода(ТекущаяДата()),КонецДня(Дата2));
	Эл.Использование=Истина;

	//записьНаСервис
	Эл=спЗаписьНаСервис.Параметры.Элементы.Найти("Дата1");
	Эл.Значение=?(Дата1='00010101','20000101',Дата1);
	Эл.Использование=Истина;
	
	Эл=спЗаписьНаСервис.Параметры.Элементы.Найти("Дата2");
	Эл.Значение=?(Дата2='00010101',КонецГода(ТекущаяДата()),КонецДня(Дата2));
	Эл.Использование=Истина;
	
КонецПроцедуры	

&НаКлиенте
Процедура НажатиеКнМеню(Элемент) 
	Для Н=0 По ПунктыМеню.Количество()-1 Цикл
		Если Найти(ТекущийЭлемент.Имя,ПунктыМеню[Н].Значение)>0 Тогда ТекущаяЗакладкаМеню=Н; Прервать КонецЕсли;	
	КонецЦикла;
	УправлениеМеню();
КонецПроцедуры
&НаКлиенте
Процедура УправлениеМеню()
	//скрыть или показать пункты меню в зависимости от набора прав
	Для Каждого Эл Из Элементы.кнМеню.ПодчиненныеЭлементы Цикл Эл.Видимость=ПунктыМеню.НайтиПоЗначению(Сред(Эл.Имя,3))<>Неопределено КонецЦикла;	
	
	//скрыть показать списки
	Для Н=0 По ПунктыМеню.Количество()-1 Цикл 
		Эл=Элементы.Найти("сп"+ПунктыМеню[Н]);
		Если Эл=Неопределено Тогда Продолжить КонецЕсли;
		Эл.Видимость=Н=ТекущаяЗакладкаМеню;
	КонецЦикла;	
	
	//цвета кнопок меню
	ПарамОфр=Renault_ОбщиеФункции.МультибрендПараметрыОформления();
	//Вкл=Новый Цвет(255,207,0);
	Вкл=Вычислить(ПарамОфр.ОсновнойЦвет);
	//Выкл=Вычислить(ПарамОфр.ДопЦвет1);
	//ВыклСерый=Вычислить(ПарамОфр.ДопЦвет1);
	Выкл=Новый Цвет(189,195,206);
	ВыклСерый=Новый Цвет(231,231,231);
	
	Для Н=1 По Элементы.кнМеню.ПодчиненныеЭлементы.Количество() Цикл
		Эл=Элементы.кнМеню.ПодчиненныеЭлементы[Н-1];
		Если НЕ Эл.Видимость Тогда Продолжить КонецЕсли;
		ЭтоТекущаяЗакладка=Сред(Эл.Имя,3)=ПунктыМеню[ТекущаяЗакладкаМеню].Значение;
		Эл.ЦветФона=?(ЭтоТекущаяЗакладка,Вкл,Выкл);  //?(Н=ТекущаяЗакладкаМеню,Вкл,Выкл);
		Эл.ЦветРамки=?(ЭтоТекущаяЗакладка,Вкл,Выкл);
	КонецЦикла;
	
	ИмяЗакладки=ИмяЗакладки();
	Если ИмяЗакладки="РегистрацияТрафика" Тогда
		Элементы.грРегТрафика.Видимость=Истина;
		Элементы.кнОтбор.Видимость=Ложь;
		ОбновитьДиаграммуМенеджера();
	ИначеЕсли ИмяЗакладки="Фото" Тогда
		Элементы.кнОтбор.Видимость=Ложь;
	ИначеЕсли ИмяЗакладки="Диаграммы" Тогда
		Элементы.кнОтбор.Видимость=Ложь;
	Иначе
		Элементы.грРегТрафика.Видимость=Ложь;
		Элементы.кнОтбор.Видимость=Истина;
	КонецЕсли;
	
	//кнопки отчета-диаграммы
	Для Каждого Эл Из Элементы.кнСпДиаграммы.ПодчиненныеЭлементы Цикл
		Эл.ЦветРамки=?(Эл.Имя=ТекущийРежимДиаграммы,Вкл,ВыклСерый);
		Эл.ЦветФона=?(Эл.Имя=ТекущийРежимДиаграммы,Вкл,ВыклСерый);
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Процедура НажатиеКнМенюСписка(Элемент)
	ИмяПунктаМеню=ИмяЗакладки();
	ИмяСписка=ИмяСписка();
	
	Если ТекущийЭлемент.Имя="кнОбновить" Тогда //это действие по умолчанию всегда
		Элементы[ИмяСписка].Обновить();
	ИначеЕсли ТекущийЭлемент.Имя="кнОтбор" Тогда
		
	//	Если ИмяПунктаМеню="Отчеты" Тогда
	//		Renault_ОбщиеФункции.ОткрытьКомпоновщикНастроек(ЭтаФорма,КомпоновщикНастроекОтчета,"ОтборОтчета")
	//	Иначе //динамические списки
	//		
	//		Если Renault_ОбщиеФункции.СтараяПлатформа() Тогда
	//			Сообщить("Функционал не доступен",СтатусСообщения.Информация);
	//			Возврат
	//		КонецЕсли;	

	Если ИмяПунктаМеню="Трафик" Тогда 
		Источник=ПолучитьИсточникНаСервере(ИмяСписка); 
	Иначе 
		Источник=ПолучитьПроизвольныйИсточникНаСервере(ИмяСписка);
	КонецЕсли;	
	
	Renault_ОбщиеФункции.ОткрытьФормуОтбора(ЭтаФорма,Источник,ЭтаФорма[ИмяСписка].КомпоновщикНастроек,"ОтборСписка",ИмяСписка,,Истина)
		
	ИначеЕсли ТекущийЭлемент.Имя="кнПериод" Тогда	
		Стр=ОткрытьФормуМодально("ОбщаяФорма.Renault_ВыборПериода",Новый Структура("Дата1,Дата2",Дата1,Дата2),ЭтаФорма,УникальныйИдентификатор);
		Если ТипЗнч(Стр)=Тип("Структура") Тогда
			Дата1=Стр.Дата1;
			Дата2=КонецДня(Стр.Дата2);
			УстановитьПараметрыСписков();
			УстановитьЗаголовок();
		КонецЕсли;	
		
	ИначеЕсли ТекущийЭлемент.Имя="кнПосещение" Тогда
		ОткрытьФорму("Обработка.Renault_ARM_Администратор.Форма.РегистрацияУПР",,ЭтаФорма)
	ИначеЕсли ТекущийЭлемент.Имя="кнЗвонок" Тогда
		ОткрытьФорму("Обработка.Renault_ARM_Администратор.Форма.РегистрацияУПР",,ЭтаФорма)
	ИначеЕсли ТекущийЭлемент.Имя="кнEMAIL" Тогда
		ОткрытьФорму("Обработка.Renault_ARM_Администратор.Форма.РегистрацияУПР",,ЭтаФорма)
	ИначеЕсли ТекущийЭлемент.Имя="кнЛидRenault" Тогда
		ОткрытьФорму("Обработка.Renault_АРМ_ОнлайнКонсультант.Форма",,ЭтаФорма)
	ИначеЕсли ТекущийЭлемент.Имя="кнКонсультант" Тогда
		ОткрытьФорму("Обработка.Renault_АРМ_ОнлайнКонсультант.Форма",,ЭтаФорма)
	ИначеЕсли ТекущийЭлемент.Имя="кнСоцсети" Тогда	
		ОткрытьФорму("Обработка.Renault_АРМ_ОнлайнКонсультант.Форма",,ЭтаФорма)
	
	Иначе 
		Сообщить("Действие кнопки еще не настроено"); Возврат
	КонецЕсли;
	
	//обновление списка - при любом действии кнопок списка
	Если ИмяПунктаМеню="РегистрацияТрафика" Тогда ОбновитьДиаграммуМенеджера()
	ИначеЕсли ИмяПунктаМеню="Диаграммы" Тогда ОтчетДиаграмма()
	//Иначе Элементы[ИмяСписка].Обновить() 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСписка(КомпНастроек,ИмяСписка) Экспорт
	Если КомпНастроек=Неопределено Тогда Возврат КонецЕсли;		
	ЭтаФорма[ИмяСписка].КомпоновщикНастроек.ЗагрузитьФиксированныеНастройки(КомпНастроек.ФиксированныеНастройки);
	УстановитьПараметрыСписков();
	//Если ИмяСписка="спСтраховыеПолисы" Тогда
	//	спСтраховыеПолисы.Параметры.Элементы.Найти("ТекущаяДата").Значение=ТекущаяДата();
	//	спСтраховыеПолисы.Параметры.Элементы.Найти("ТекущаяДата").Использование=Истина;
	//	спСтраховыеПолисы.Параметры.Элементы.Найти("Пролонгация").Значение=ТолькоПролонгация;
	//	спСтраховыеПолисы.Параметры.Элементы.Найти("Пролонгация").Использование=Истина;
	//КонецЕсли;	
	
	//ЭтаФорма[ИмяСписка].КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.Настройки);
	//ЭтаФорма[ИмяСписка].КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(КомпоновщикНастроек.ПользовательскиеНастройки);
	//ЭтаФорма[ИмяСписка].КомпоновщикНастроек.ЗагрузитьФиксированныеНастройки(КомпоновщикНастроек.ФиксированныеНастройки);
КонецПроцедуры

&НаКлиенте
Процедура РаботаСоСписком(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ИмяСписка=ИмяСписка();
	Если ИмяСписка = "спТрафик" Тогда
		РасшифроватьТрафик(ВыбраннаяСтрока, Поле.Имя);
	ИначеЕсли ИмяСписка = "спТестДрайв" Тогда
		РасшифроватьТестДрайв(Поле.Имя);
	ИначеЕсли ИмяСписка = "спЗаписьНаСервис" Тогда
		РасшифроватьЗаписьНаСервис(Поле.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифроватьТрафик(ВыбраннаяСтрока, ИмяПоля)
			
	Если ИмяПоля = "спТрафикМенеджер" Тогда
		
		УстановитьМенеджера(ВыбраннаяСтрока, Отдел);
		
	ИначеЕсли ИмяПоля = "спТрафикКомментарий" Тогда
		
		УстановитьКомментарий(ВыбраннаяСтрока);
		
	ИначеЕсли ИмяПоля = "спТрафикТрафикУпущен" Тогда
		
		УстановитьОтметкуУпущен(ВыбраннаяСтрока);
		
	ИначеЕсли ИмяПоля = "спТрафикЕстьЗамечание" Тогда
		
		УстановитьЗамечание(ВыбраннаяСтрока);
		
	ИначеЕсли ИмяПоля = "спТрафикТД" Тогда
		
		УстановитьТД(ВыбраннаяСтрока);
			
	ИначеЕсли ИмяПоля = "спТрафикОтдел" Тогда

		УстановитьОтдел(ВыбраннаяСтрока);	
				
	КонецЕсли;

	Элементы.спТрафик.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура РасшифроватьТестДрайв(ИмяПоля)
	
	Запись = Элементы.спТестДрайв.ТекущиеДанные;

	Если ИмяПоля = "спТестДрайвЗаписьНаТестДрайв" Тогда
		
		////Печать
		ДокументСсылка = Запись.ЗаписьНаТестДрайв;
		Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		//	
		//	//Иначе печатаем типовой вариант
			МассивДокументов = Новый Массив;
			МассивДокументов.Добавить(ДокументСсылка);
		//	
		    #Если ТолстыйКлиентОбычноеПриложение Тогда
			Форма = ПолучитьФорму("Документ.CRM_ЗаписьНаТестДрайв.Форма.ФормаЗаполненияДанныхДляПечати");
			Форма.СсылкаНаОбъект = ДокументСсылка;
			Если НЕ Форма.ОткрытьМодально() = Истина Тогда
				Возврат;
			КонецЕсли;		
			CRM_Клиент.ПечатьДокументаВыборФормы(МассивДокументов, "Документ.CRM_ЗаписьНаТестДрайв");
			
			#КонецЕсли

		КонецЕсли;
		
	ИначеЕсли ИмяПоля = "спТестДрайвСобытиеПоРабочемуЛисту" Тогда
		
		//Печать
		#Если ТолстыйКлиентОбычноеПриложение Тогда
		П=Новый Структура("ключ", Запись.СобытиеПоРабочемуЛисту);
		Ответ = ОткрытьФормуМодально("Документ.CRM_СобытияПоРабочимЛистам.Форма.ФормаЗавершенияСобытия", П);
		#КонецЕсли

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РасшифроватьЗаписьНаСервис(ИмяПоля)
	
	Запись = Элементы.спЗаписьНаСервис.ТекущиеДанные;

	Если ИмяПоля = "спЗаписьНаСервисКлиент" Тогда
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
		Ответ = Запись.Клиент.ПолучитьФорму("Renault_Форма").ОткрытьМодально();
		#КонецЕсли

	ИначеЕсли ИмяПоля = "спЗаписьНаСервисАвтомобиль" Тогда
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
		Ответ = Запись.Автомобиль.ПолучитьФорму("ФормаЭлемента").ОткрытьМодально();
		#КонецЕсли

	ИначеЕсли ИмяПоля = "спЗаписьНаСервисДокумент" Тогда
		
		Если ПроверитьСостояниеНаНезавершенность(Запись.Документ) Тогда
			
			#Если ТолстыйКлиентОбычноеПриложение Тогда
			Ответ = Запись.Документ.ПолучитьФорму("ФормаЗавершенияСобытия").ОткрытьМодально();
			#КонецЕсли
		
		Иначе
			
			Вопрос(НСтр("ru = 'Запись уже имеет необходимый статус.'"), РежимДиалогаВопрос.ОК,,,"Предупреждение.");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьСостояниеНаНезавершенность(ДокументСостояние)
	Возврат ДокументСостояние.Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Заявка ИЛИ ДокументСостояние.Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.ПустаяСсылка() ;
КонецФункции

&НаКлиенте
Процедура УстановитьМенеджера(Запись, Отдел)
	
	//Выберем менеджера	
	Если  ЗаписьСуществуетИНеОбработана(Запись) Тогда
		
		Список = Renault_CRM.ПолучитьСписокСотрудниковПоОтделу(Отдел);
		
		ТаблицаСоСтатусом = ПолучитьСтатусыСотрудников(Список, ДилерскийЦентр);		
		
		Парам = Новый Структура;
		Парам.Вставить("Список",ТаблицаСоСтатусом);
		Парам.Вставить("Заголовок", "Выбор менеджера");
		Парам.Вставить("КоличествоЭлементовВСтроке",2);
		
		ФормаСписка = ПолучитьФорму("ОбщаяФорма.Renault_ДиалогВыбораСпискаЗначений", Парам);
		ФормаСписка.Элементы.Закрыть.Заголовок = "Отмена/Очистка";
		Ответ = ФормаСписка.ОткрытьМодально();
			
		УстановитьМенеджераНаСервере(Запись, Ответ);
					
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаписьСуществуетИНеОбработана(Запись)
	 Возврат Запись <> Неопределено И Не Запись.Обработан;
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьМенеджераНаСервере(ЗаписьТрафика, Ответ) 
	
	Запись = Renault_CRM.ПолучитьЗаписьТрафикаПоID(ЗаписьТрафика.Идентификатор);
	ЗаписьЗадача = Renault_CRM.ПолучитьЗаписьЗадачиПоIDТрафика(ЗаписьТрафика.Идентификатор);

	Если ЗначениеЗаполнено(Ответ) Тогда
		Запись.Менеджер = Ответ;
		Запись.Записать();
		
		//Если есть задача по трафику, в ней также необходимо изменить менеджера
		Если ЗаписьЗадача <> Неопределено Тогда
			ЗаписьЗадача.Менеджер = Ответ;
			ЗаписьЗадача.Записать();
		КонецЕсли;
	Иначе
		
		Запись.Менеджер = Справочники.Сотрудники.ПустаяСсылка();
		Запись.Записать();
		
		//Если есть задача по трафику, в ней также необходимо изменить менеджера
		Если ЗаписьЗадача <> Неопределено Тогда
			ЗаписьЗадача.Менеджер = Справочники.Сотрудники.ПустаяСсылка();
			ЗаписьЗадача.Записать();
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКомментарий(Запись)
	
	Если ЗаписьСуществуетИНеОбработана(Запись) Тогда
		//Укажем комментарий
		ФормаВводаЗамечания = ПолучитьФорму("Обработка.Renault_ARM_Администратор.Форма.ФормаВводаКомментарияУПР");
		ФормаВводаЗамечания.Заголовок = "Ввод комментария";
		ФормаВводаЗамечания.Текст = Элементы.спТрафик.ТекущиеДанные.Комментарий; 
		Ответ = ФормаВводаЗамечания.ОткрытьМодально();
		Если ЗначениеЗаполнено(Ответ) Или Ответ = "" Тогда
			
			УстановитьКомментарийНаСервере(Запись, Ответ);
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьКомментарийНаСервере(ЗаписьТрафика, Ответ)

	Запись = Renault_CRM.ПолучитьЗаписьТрафикаПоID(ЗаписьТрафика.Идентификатор);
	ЗаписьЗадача = Renault_CRM.ПолучитьЗаписьЗадачиПоIDТрафика(ЗаписьТрафика.Идентификатор);

	Запись.Комментарий = Ответ;
	Запись.Записать();
			
	//Если есть задача по трафику, в ней также необходимо изменить комментарий
	Если ЗаписьЗадача <> Неопределено Тогда
		ЗаписьЗадача.Комментарий = Ответ;
		ЗаписьЗадача.Записать();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗамечание(Запись)
	
	ТекстЗамечания = ПолучитьЗамечаниеНаСервере(Запись);
		
	ФормаВводаЗамечания = ПолучитьФорму("Обработка.Renault_ARM_Администратор.Форма.ФормаВводаКомментарияУПР");
	ФормаВводаЗамечания.Заголовок = "Ввод замечания менеджеру";
	Если ТекстЗамечания <> Неопределено Тогда
		ФормаВводаЗамечания.Текст = ТекстЗамечания; 
	КонецЕсли;
	Ответ = ФормаВводаЗамечания.ОткрытьМодально();
	Если ЗначениеЗаполнено(Ответ) Тогда
		ЗаписатьЗамечаниеНаСервере(Запись, Ответ);
	ИначеЕсли Ответ = "" Тогда
		УдалитьЗамечаниеНаСервере(Запись);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗамечаниеНаСервере(Запись)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_ЗамечанияМенеджерам.Период,
	               |	CRM_ЗамечанияМенеджерам.Менеджер,
	               |	CRM_ЗамечанияМенеджерам.ИдентификаторТрафика,
	               |	CRM_ЗамечанияМенеджерам.ТекстЗамечания
	               |ИЗ
	               |	РегистрСведений.CRM_ЗамечанияМенеджерам КАК CRM_ЗамечанияМенеджерам
	               |ГДЕ
	               |	CRM_ЗамечанияМенеджерам.ИдентификаторТрафика = &ИдентификаторТрафика
	               |	И CRM_ЗамечанияМенеджерам.Менеджер = &Менеджер";
	Запрос.УстановитьПараметр("Менеджер", Запись.Менеджер);
	Запрос.УстановитьПараметр("ИдентификаторТрафика", Запись.Идентификатор);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ТекстЗамечания;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьЗамечаниеНаСервере(Запись, ТекстЗамечания)

 	ЗаписьЗамечание = РегистрыСведений.CRM_ЗамечанияМенеджерам.СоздатьМенеджерЗаписи();
	ЗаписьЗамечание.Период = ТекущаяДата();
	ЗаписьЗамечание.ИдентификаторТрафика = Запись.Идентификатор;
	ЗаписьЗамечание.Менеджер = Запись.Менеджер;
	ЗаписьЗамечание.ТекстЗамечания = ТекстЗамечания;
	ЗаписьЗамечание.Записать();
 
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьЗамечаниеНаСервере(Запись)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_ЗамечанияМенеджерам.Период,
	               |	CRM_ЗамечанияМенеджерам.Менеджер,
	               |	CRM_ЗамечанияМенеджерам.ИдентификаторТрафика,
	               |	CRM_ЗамечанияМенеджерам.ТекстЗамечания
	               |ИЗ
	               |	РегистрСведений.CRM_ЗамечанияМенеджерам КАК CRM_ЗамечанияМенеджерам
	               |ГДЕ
	               |	CRM_ЗамечанияМенеджерам.ИдентификаторТрафика = &ИдентификаторТрафика
	               |	И CRM_ЗамечанияМенеджерам.Менеджер = &Менеджер";
	Запрос.УстановитьПараметр("Менеджер", Запись.Менеджер);
	Запрос.УстановитьПараметр("ИдентификаторТрафика", Запись.Идентификатор);
	
	ЗаписьЗамечание = РегистрыСведений.CRM_ЗамечанияМенеджерам.СоздатьМенеджерЗаписи();

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЗаписьЗамечание, Выборка);
		ЗаписьЗамечание.Прочитать();
		Если ЗаписьЗамечание.Выбран() Тогда
			ЗаписьЗамечание.Удалить();
		КонецЕсли;
	КонецЕсли;
 
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметкуУпущен(Запись)
	
	Если Запись <> Неопределено Тогда
		
		ЕстьПризнакУпущен = ПолучитьПризнакУпущенНаСервере(Запись);
					
		Если ЕстьПризнакУпущен Тогда
			//Если Трафик упущен - можно отменить
			ФормаПодтверждения = ПолучитьФорму("Обработка.Renault_ARM_Администратор.Форма.ФормаПодтвержденияУПР");
			ФормаПодтверждения.Заголовок = "Отменить признак 'Упущен'?";
			Ответ = ФормаПодтверждения.ОткрытьМодально();
			Если ЗначениеЗаполнено(Ответ) Тогда			
				ОтменитьПризнакУпущенНаСервере(Запись);
			КонецЕсли;
		ИначеЕсли ЗаписьСуществуетИНеОбработана(Запись) Тогда
			//Отметим как упущенный	
			ФормаВводаЗамечания = ПолучитьФорму("Обработка.Renault_ARM_Администратор.Форма.ФормаВводаПричиныУпущенногоКлиентаУПР");
			ФормаВводаЗамечания.Заголовок = "Ввод причины упущенного клиента";
			Ответ = ФормаВводаЗамечания.ОткрытьМодально();
			Если ЗначениеЗаполнено(Ответ) Тогда
				ОтметитьКакУпущенныйНаСервере(Запись, Ответ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПризнакУпущенНаСервере(Запись)
	
	Запрос = Новый Запрос;
				
	Запрос.УстановитьПараметр("Идентификатор", Запись.Идентификатор);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	РегистрСведений.Renault_Трафик.СрезПоследних КАК Renault_ТрафикСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_УпущенныйТрафик КАК CRM_УпущенныйТрафик
	|		ПО Renault_ТрафикСрезПоследних.Идентификатор = CRM_УпущенныйТрафик.ИдентификаторТрафика
	|			И (Renault_ТрафикСрезПоследних.Идентификатор = &Идентификатор)";
	
	Результат = Запрос.Выполнить();
	Возврат Не Результат.Пустой();

КонецФункции

&НаСервереБезКонтекста
Функция ОтменитьПризнакУпущенНаСервере(ЗаписьТрафика)
	
	Запись = Renault_CRM.ПолучитьЗаписьТрафикаПоID(ЗаписьТрафика.Идентификатор);

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	*
		|ИЗ
		|	РегистрСведений.CRM_УпущенныйТрафик КАК CRM_УпущенныйТрафик
		|ГДЕ
		|	CRM_УпущенныйТрафик.ИдентификаторТрафика = &ИдентификаторТрафика";
	Запрос.УстановитьПараметр("ИдентификаторТрафика", Запись.Идентификатор);
	ВыборкаУпущен = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаУпущен.Следующий() Тогда
		ЗаписьУпущен = РегистрыСведений.CRM_УпущенныйТрафик.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ЗаписьУпущен, ВыборкаУпущен);
		ЗаписьУпущен.Прочитать();
		ЗаписьУпущен.Удалить();
		Запись.Обработан = Ложь;
		Запись.Записать();	
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОтметитьКакУпущенныйНаСервере(ЗаписьТрафика, Ответ)
	
	Запись = Renault_CRM.ПолучитьЗаписьТрафикаПоID(ЗаписьТрафика.Идентификатор);

	ЗаписьУпущен = РегистрыСведений.CRM_УпущенныйТрафик.СоздатьМенеджерЗаписи();
	ЗаписьУпущен.Период = ТекущаяДата();
	ЗаписьУпущен.ИдентификаторТрафика = ЗаписьТрафика.Идентификатор;
	ЗаписьУпущен.Менеджер = Запись.Менеджер;
	ЗаписьУпущен.ДилерскийЦентр = Запись.ДилерскийЦентр;
	ЗаписьУпущен.Комментарий = Ответ.ТекстКомментарияУпущен;
	ЗаписьУпущен.Причина = Ответ.ПричинаУпущенногоКлиента;
	ЗаписьУпущен.АвторКомментария = Запись.Администратор;
	ЗаписьУпущен.ВидУпущения = Перечисления.CRM_ТипыУпущенияТрафика.Администратор;
	ЗаписьУпущен.Записать();
	
	Запись.Обработан = Истина;
	Запись.Записать();

КонецПроцедуры
			
&НаКлиенте
Процедура УстановитьТД(Запись)
	
	Если ЗаписьНеОбработанаМенеджерВыбран(Запись) Тогда
		
		//ОткрытьФорму("Документ.CRM_СобытияПоРабочимЛистам.Форма.ФормаСозданияСобытия",
		//Новый Структура("ВидСобытия, Сотрудник, ДилерскийЦентр, Отдел, ИдТрафика, ЗапретитьИзменияВидаСобытия", ВидСобытияТестДрайв(), Запись.Менеджер,Запись.ДилерскийЦентр,Запись.Отдел, Запись.Идентификатор, Истина));
		
		//СобытиеОбъект = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
		//СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.ТестДрайв;
		//СобытиеОбъект.Сотрудник = Запись.Менеджер;
		//СобытиеОбъект.ДилерскийЦентр = Запись.ДилерскийЦентр;
		//СобытиеОбъект.Отдел = Запись.Отдел;
		#Если Клиент Тогда
		#Иначе
		ФормаСобытия = ПолучитьФорму("Документ.CRM_СобытияПоРабочимЛистам.Форма.ФормаСозданияСобытия");
		ФормаСобытия.ИдТрафика = ПолучитьИдентификаторТрафика(Запись);
		ФормаСобытия.ЗапретитьИзменияВидаСобытия = Истина;
		ДанныеФормы = ФормаСобытия.Объект;	
		ЗарегистрироватьСобытиеПоРабЛисту(ДанныеФормы, Запись);
		КопироватьДанныеФормы(ДанныеФормы, ФормаСобытия.Объект);

		ФормаСобытия.Открыть();
		#КонецЕсли

	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаписьНеОбработанаМенеджерВыбран(Запись)
	 Возврат Не Запись.Обработан И ЗначениеЗаполнено(Запись.Менеджер);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИдентификаторТрафика(Запись)
	 Возврат Запись.Идентификатор;
КонецФункции

&НаСервере
Процедура ЗарегистрироватьСобытиеПоРабЛисту(НовыйОбъект, Запись)
	
	//СобытиеОбъект = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
	НовыйОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.ТестДрайв;
	НовыйОбъект.Сотрудник = Запись.Менеджер;
	НовыйОбъект.ДилерскийЦентр = Запись.ДилерскийЦентр;
	НовыйОбъект.Отдел = Запись.Отдел;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВидСобытияТестДрайв()
	Возврат	Справочники.CRM_ВидыСобытий.ТестДрайв;
КонецФункции

&НаКлиенте
Процедура УстановитьОтдел(Запись)
	
	Если ЗаписьСуществуетИНеОбработана(Запись) Тогда
		
		//Заблокируем форму от изменения
		ЭтаФорма.ТолькоПросмотр = Истина;
		
		Список = Renault_CRM.ПолучитьСписокПрочихОтделовЦентра(Элементы.спТрафик.ТекущиеДанные.ДилерскийЦентр);

		Парам=Новый Структура;
		Парам.Вставить("Список",Список);
		Парам.Вставить("Заголовок", "Выбор отдела");

		ФормаСписка = ПолучитьФорму("ОбщаяФорма.Renault_ДиалогВыбораСпискаЗначений", Парам);
		
		Ответ = ФормаСписка.ОткрытьМодально();
		Если ЗначениеЗаполнено(Ответ) Тогда
			мОтдел = Ответ;
			
			Если ИспользуетсяАвтосервис(Элементы.спТрафик.ТекущиеДанные.Отдел, мОтдел, Элементы.спТрафик.ТекущиеДанные.ДилерскийЦентр) Тогда
				
				Если ОтделСервиса(мОтдел) Тогда
					ЗаписьНаСервис = ИСТИНА;
				Иначе
					ЗаписьНаСервис = Ложь;
				КонецЕсли;
				
				ТрафикУпущен = ПолучитьПризнакУпущенНаСервере(Запись);
								
				Если ЗаписьНаСервис И
					Не ТрафикУпущен Тогда
					
					ТекстВопроса = "Будет создан документ ""Обращение в авто сервис (Renault CRM)"". Продолжить?";
					Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
						Сообщить("Не удалось изменить отдел");
						Возврат;
					КонецЕсли;
					
					ВариантыОтвета = Новый СписокЗначений;
					ВариантыОтвета.Добавить("Да", "Да");
					ВариантыОтвета.Добавить("Нет", "Нет / Не знаю");
					
					Если Вопрос("Была жалоба при обращении клиента?", ВариантыОтвета) = "Да" Тогда
						ЕстьЖалоба = Истина;
					КонецЕсли;

					ЗафиксироватьОбращениеНаСервере(Запись, ЕстьЖалоба, мОтдел);
					
				Иначе
					ЗафиксироватьОтделНаСервере(Запись, мОтдел);
				КонецЕсли;
				
			Иначе	
				ЗафиксироватьОтделНаСервере(Запись, мОтдел);
			КонецЕсли;
						
		КонецЕсли;
		
		ЭтаФорма.ТолькоПросмотр = Ложь;
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ИспользуетсяАвтосервис(Отдел, мОтдел, ДилерскийЦентр)
	
	Возврат ДилерскийЦентр.ИспользуетАвтосервис И Отдел.КлассификацияRenault <> мОтдел.КлассификацияRenault;
	
КонецФункции
			
&НаСервереБезКонтекста
Процедура ЗафиксироватьОбращениеНаСервере(ЗаписьТрафика, ЕстьЖалоба, мОтдел)
	
	Запись = Renault_CRM.ПолучитьЗаписьТрафикаПоID(ЗаписьТрафика.Идентификатор);

	Документ = Документы.Renault_CRM_ОбращениеВАвтоСервис.СоздатьДокумент();
					
	Документ.Дата = ТекущаяДата();
	Документ.ВидОбращения = Справочники.Renault_ВидыОбращенийВАвтосервис.СРешепшен;
	Документ.ДилерскийЦентр = Запись.ДилерскийЦентр;
	Документ.Менеджер = Справочники.Пользователи.НайтиПоРеквизиту("Сотрудник", Запись.Администратор);
	
	ФИО = Запись.Представление;
	
	Если ТипЗнч(Запись.Клиент) = Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты") 
		ИЛИ ТипЗнч(Запись.Клиент) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		Документ.Клиент = Запись.Клиент;
	Иначе
		Документ.Клиент = ФИО;
	КонецЕсли;
	
	Модель = Запись.ПервичныйИнтерес;
	Если ЗначениеЗаполнено(Модель) Тогда
		МодельНаименование = Модель.Наименование;
	Иначе
		МодельНаименование = "";
	КонецЕсли;
	
	Документ.Примечание = Запись.Комментарий + ?(ЗначениеЗаполнено(Модель), " Модель: " + МодельНаименование, "");     
	Документ.ПервичныйПовторный = Запись.ПервичныйПовторный;
	Документ.ОбращениеОбработано = Ложь;
	
	Попытка
		Документ.ИдентификаторТрафика = ЗаписьТрафика.Идентификатор;
	Исключение
	Конецпопытки;
		
	Документ.Жалоба = ЕстьЖалоба;
	
	Телефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(Запись.Клиент);
	
	Попытка
		Документ.ТелефонПримечание = Телефон;
	Исключение
		Документ.Примечание = Документ.Примечание + " Телефон клиента: " + Телефон;
	КонецПопытки;
	
	НачатьТранзакцию();
	
	Запись.Отдел = мОтдел;
	Запись.Записать();
	
	Документ.Записать();
	
	Напоминание = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
	Напоминание.Отправитель = Запись.Администратор;
	Напоминание.Подробнее = Документ.Ссылка;
	Напоминание.Адресаты.Добавить().Сотрудник = Запись.Менеджер;
	Напоминание.ДатаОтправки = ТекущаяДата();
	Напоминание.Комментарий = Запись.Комментарий;
	Напоминание.ВидСообщения = Справочники.Renault_ВидСообщения.НовыйКлиентБезМенеджера;
	Напоминание.ПоказыватьС = ТекущаяДата();
	Напоминание.ПоказыватьПо = ТекущаяДата();
	Напоминание.Наименование = ФИО;
	Напоминание.Сообщение = "На вас назначен клиент: " + ФИО + " | " + Запись.Комментарий + ?(ЗначениеЗаполнено(Модель), " | " + МодельНаименование, "");
	
	Напоминание.Записать();
	
	ЗафиксироватьТранзакцию();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗафиксироватьОтделНаСервере(ЗаписьТрафика, мОтдел);
	
	Запись = Renault_CRM.ПолучитьЗаписьТрафикаПоID(ЗаписьТрафика.Идентификатор);

	Запись.Отдел = мОтдел;
					
	Попытка
		Запись.Записать();
	Исключение
		Сообщить("Ошибка записи. Не удалось изменить отдел");
	КонецПопытки;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтделСервиса(Отдел)
	Возврат Отдел.КлассификацияRenault = Перечисления.CRM_КлассификацияОтделов.ОтделСервиса;
КонецФункции

&НаКлиенте
Процедура ПереключениеДиаграммы(Команда) 
	ТекущийРежимДиаграммы=ТекущийЭлемент.Имя; 
	УправлениеМеню(); 
	Элементы.ОтчетДиаграмма.Видимость=?(ТекущийРежимДиаграммы="ТрафикПоПериодам" или ТекущийРежимДиаграммы="ТрафикВРазрезах",Ложь,Истина);
	Если ТекущийРежимДиаграммы="ТрафикПоПериодам" Тогда
		ОткрытьФорму("Отчет.Renault_ТрафикПоПериодам.Форма.Форма",,ЭтаФорма,УникальныйИдентификатор);
	ИначеЕсли ТекущийРежимДиаграммы="ТрафикВРазрезах" Тогда
		ОткрытьФорму("Отчет.Renault_ТрафикВРазрезах.Форма.ФормаОтчета",,ЭтаФорма,УникальныйИдентификатор);
	Иначе ОтчетДиаграмма() 
	КонецЕсли;	
КонецПроцедуры
Процедура ОтчетДиаграмма()
	
	ОтчетДиаграмма.Очистить();
	ОтчетДиаграмма.Обновление=Ложь;
	ОтчетДиаграмма.АвтоТранспонирование=Ложь;
	ОтчетДиаграмма.АвтоУстановкаИменТочек=Истина;
	
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Дата1",Дата1);
	Запрос.УстановитьПараметр("Дата2",КонецДня(?(Дата2='00010101',ТекущаяДата(),Дата2)));
	Запрос.УстановитьПараметр("Отдел",Отдел);
	
	Если ТекущийРежимДиаграммы="ПТпоМенеджерам" Тогда
		Точка=ОтчетДиаграмма.УстановитьТочку("- количество первичного трафика -");
		Запрос.Текст="
		|Выбрать
		|	ЕстьNULL(Менеджер, ""Не указан"") Менеджер,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Идентификатор) Количество,
		|	0 КАК Процент
		|ИЗ РегистрСведений.Renault_Трафик
		|ГДЕ Период МЕЖДУ &Дата1 И &Дата2 И Отдел=&Отдел
		|СГРУППИРОВАТЬ ПО Менеджер";
		Табл=Запрос.Выполнить().Выгрузить();
		Всего=Табл.Итог("Количество");
		Для Каждого Строка Из Табл Цикл
			Если Не ЗначениеЗаполнено(Строка.Менеджер) Тогда Строка.Менеджер="Не указан"; КонецЕсли;
			Серия=ОтчетДиаграмма.УстановитьСерию(Строка(Строка.Менеджер));
			Серия.Текст=""+Строка.Менеджер;
			ОтчетДиаграмма.УстановитьЗначение(Точка,Серия,Строка.Количество);
			Строка.Процент=Окр(100*Строка.Количество/Всего,2);
		КонецЦикла;
		
	ИначеЕсли ТекущийРежимДиаграммы="ПТпоМоделям" Тогда
		Точка=ОтчетДиаграмма.УстановитьТочку("- количество первичного трафика -");
		Запрос.Текст="
		|Выбрать
		|	ЕСТЬNULL(Renault_Трафик.ПервичныйИнтерес, ""Не указан"") КАК Модель,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Renault_Трафик.Идентификатор) КАК Количество,
		|	0 КАК Процент
		|ИЗ РегистрСведений.Renault_Трафик КАК Renault_Трафик
		|ГДЕ Renault_Трафик.Период МЕЖДУ &Дата1 И &Дата2 И Renault_Трафик.Отдел = &Отдел
		|СГРУППИРОВАТЬ ПО ЕСТЬNULL(Renault_Трафик.ПервичныйИнтерес, ""Не указан"")";
		Табл = Запрос.Выполнить().Выгрузить();
		Всего=Табл.Итог("Количество");
		Для Каждого Строка Из Табл Цикл
			Если Не ЗначениеЗаполнено(Строка.Модель) Тогда Строка.Модель = "Не указан"; КонецЕсли;
			ОтчетДиаграмма.УстановитьЗначение(Точка, ОтчетДиаграмма.УстановитьСерию(Строка(Строка.Модель)), Строка.Количество);
			Строка.Процент = Окр(100 * Строка.Количество / Всего, 2);
		КонецЦикла;
	ИначеЕсли ТекущийРежимДиаграммы="ПТ_ОП_ИИ" Тогда
		Точка=ОтчетДиаграмма.УстановитьТочку("- количество первичного трафика -");
		Запрос.Текст="
		|Выбрать
		|	ЕстьNULL(Renault_Трафик.ИсточникИнформации, ""Не указан"") КАК ИсточникИнформации,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Renault_Трафик.Идентификатор) КАК Количество,
		|	0 КАК Процент
		|ИЗ РегистрСведений.Renault_Трафик КАК Renault_Трафик
		|ГДЕ Renault_Трафик.Период МЕЖДУ &Дата1 И &Дата2 И Renault_Трафик.Отдел = &Отдел
		|СГРУППИРОВАТЬ ПО Renault_Трафик.ИсточникИнформации";
		Табл=Запрос.Выполнить().Выгрузить();
		Всего=Табл.Итог("Количество");
		Для Каждого Строка Из Табл Цикл
			Если Не ЗначениеЗаполнено(Строка.ИсточникИнформации) Тогда Строка.ИсточникИнформации = "Не указан"; КонецЕсли;
			ОтчетДиаграмма.УстановитьЗначение(Точка, ОтчетДиаграмма.УстановитьСерию(Строка(Строка.ИсточникИнформации)), Строка.Количество);
			Строка.Процент = Окр(100 * Строка.Количество / Всего, 2);
		КонецЦикла;
	ИначеЕсли ТекущийРежимДиаграммы="ТДпоМенедж" Тогда
		Точка=ОтчетДиаграмма.УстановитьТочку("- количество тест-драйвов -");
		Запрос.Текст="
		|Выбрать
		|	0 КАК Процент,
		|	CRM_ПроведенныйТестДрайв.Сотрудник КАК Менеджер,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CRM_ПроведенныйТестДрайв.ID) КАК Количество
		|ИЗ РегистрСведений.CRM_ПроведенныйТестДрайв КАК CRM_ПроведенныйТестДрайв
		|ГДЕ CRM_ПроведенныйТестДрайв.Дата МЕЖДУ &Дата1 И &Дата2
		|СГРУППИРОВАТЬ ПО CRM_ПроведенныйТестДрайв.Сотрудник";
		Табл = Запрос.Выполнить().Выгрузить();
		Всего=Табл.Итог("Количество");
		Для Каждого Строка Из Табл Цикл
			Если Не ЗначениеЗаполнено(Строка.Менеджер) Тогда Строка.Менеджер = "Не указан"; КонецЕсли;
			ОтчетДиаграмма.УстановитьЗначение(Точка, ОтчетДиаграмма.УстановитьСерию(Строка(Строка.Менеджер)), Строка.Количество);
			Строка.Процент = Окр(100 * Строка.Количество / Всего, 2);
		КонецЦикла;
	ИначеЕсли ТекущийРежимДиаграммы="ТДпоМоделям" Тогда
		Точка=ОтчетДиаграмма.УстановитьТочку("- количество тест-драйвов -");
		Запрос.Текст="
		|Выбрать
		|	0 КАК Процент,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CRM_ПроведенныйТестДрайв.ID) КАК Количество,
		|	CRM_ПроведенныйТестДрайв.МодельАвтомобиля КАК Модель
		|ИЗ РегистрСведений.CRM_ПроведенныйТестДрайв КАК CRM_ПроведенныйТестДрайв
		|ГДЕ CRM_ПроведенныйТестДрайв.Дата МЕЖДУ &Дата1 И &Дата2
		|СГРУППИРОВАТЬ ПО CRM_ПроведенныйТестДрайв.МодельАвтомобиля";
		Табл=Запрос.Выполнить().Выгрузить();
		Всего=Табл.Итог("Количество");
		Для Каждого Строка Из Табл Цикл
			Если Не ЗначениеЗаполнено(Строка.Модель) Тогда Строка.Модель = "Не указан"; КонецЕсли;
			ОтчетДиаграмма.УстановитьЗначение(Точка, ОтчетДиаграмма.УстановитьСерию(Строка(Строка.Модель)), Строка.Количество);
			Строка.Процент = Окр(100 * Строка.Количество / Всего, 2);
		КонецЦикла;
	КонецЕсли;
	
	ОтчетДиаграмма.Обновление=Истина;
КонецПроцедуры	

&НаКлиенте
Процедура ПриЗакрытии()
	//удалить временные картинки
	УдалитьФайлы(КаталогВременныхФайлов()+"img","*.*");
КонецПроцедуры

&НаСервереБезКонтекста
Функция	ПолучитьСтатусыСотрудников(Список, ДилерскийЦентр)
	
	ТаблицаСтатусы = Renault_CRM.ПолучитьСтатусыСотрудников(Список);
	
	ТаблицаСоСтатусом = Renault_CRM.ПолучитьПредставлениеСотрудниковСоСтатусами(Список, ТаблицаСтатусы, ДилерскийЦентр);

	Возврат ТаблицаСоСтатусом;
	
КонецФункции

&НаКлиенте
Процедура кнСтарыйИнтерфейс(Команда) ОткрытьФорму("Обработка.Renault_ARM_Администратор.Форма.Форма") КонецПроцедуры
