&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СтрокаПоиска") Тогда СтрокаПоиска=Параметры.СтрокаПоиска КонецЕсли;
	Если Параметры.Свойство("Регион") Тогда Регион=Параметры.Регион КонецЕсли;
	Если Параметры.Свойство("Индустрия") Тогда Индустрия=Параметры.Индустрия КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Регион.СписокВыбора.Добавить("","Все");
	
	Элементы.Регион.СписокВыбора.Добавить("77","Москва");
	Элементы.Регион.СписокВыбора.Добавить("50","Московская область");
	Элементы.Регион.СписокВыбора.Добавить("78","Санкт-Петербург");
	Элементы.Регион.СписокВыбора.Добавить("54","Новосибирская область");
	
	Элементы.Регион.СписокВыбора.Добавить("01","Республика Адыгея");
	Элементы.Регион.СписокВыбора.Добавить("02","Республика Башкортостан");
	Элементы.Регион.СписокВыбора.Добавить("03","Республика Бурятия");
	Элементы.Регион.СписокВыбора.Добавить("04","Республика Алтай");
	Элементы.Регион.СписокВыбора.Добавить("05","Республика Дагестан");
	Элементы.Регион.СписокВыбора.Добавить("06","Республика Ингушетия");
	Элементы.Регион.СписокВыбора.Добавить("07","Кабардино-Балкарская республика");
	Элементы.Регион.СписокВыбора.Добавить("08","Республика Калмыкия");
	Элементы.Регион.СписокВыбора.Добавить("09","Карачаево-Черкесская республика");
	Элементы.Регион.СписокВыбора.Добавить("10","Республика Карелия");
	Элементы.Регион.СписокВыбора.Добавить("11","Республика Коми");
	Элементы.Регион.СписокВыбора.Добавить("12","Республика Марий Эл");
	Элементы.Регион.СписокВыбора.Добавить("13","Республика Мордовия");
	Элементы.Регион.СписокВыбора.Добавить("14","Республика Саха (Якутия)");
	Элементы.Регион.СписокВыбора.Добавить("15","Республика Северная Осетия — Алания");
	Элементы.Регион.СписокВыбора.Добавить("16","Республика Татарстан");
	Элементы.Регион.СписокВыбора.Добавить("17","Республика Тыва");
	Элементы.Регион.СписокВыбора.Добавить("18","Удмуртская республика");
	Элементы.Регион.СписокВыбора.Добавить("19","Республика Хакасия");
	Элементы.Регион.СписокВыбора.Добавить("20","Чеченская республика");
	Элементы.Регион.СписокВыбора.Добавить("21","Чувашская республика");
	Элементы.Регион.СписокВыбора.Добавить("22","Алтайский край");
	Элементы.Регион.СписокВыбора.Добавить("23","Краснодарский край");
	Элементы.Регион.СписокВыбора.Добавить("24","Красноярский край");
	Элементы.Регион.СписокВыбора.Добавить("25","Приморский край");
	Элементы.Регион.СписокВыбора.Добавить("26","Ставропольский край");
	Элементы.Регион.СписокВыбора.Добавить("27","Хабаровский край");
	Элементы.Регион.СписокВыбора.Добавить("28","Амурская область");
	Элементы.Регион.СписокВыбора.Добавить("29","Архангельская область");
	Элементы.Регион.СписокВыбора.Добавить("30","Астраханская область");
	Элементы.Регион.СписокВыбора.Добавить("31","Белгородская область");
	Элементы.Регион.СписокВыбора.Добавить("32","Брянская область");
	Элементы.Регион.СписокВыбора.Добавить("33","Владимирская область");
	Элементы.Регион.СписокВыбора.Добавить("34","Волгоградская область");
	Элементы.Регион.СписокВыбора.Добавить("35","Вологодская область");
	Элементы.Регион.СписокВыбора.Добавить("36","Воронежская область");
	Элементы.Регион.СписокВыбора.Добавить("37","Ивановская область");
	Элементы.Регион.СписокВыбора.Добавить("38","Иркутская область");
	Элементы.Регион.СписокВыбора.Добавить("39","Калининградская область");
	Элементы.Регион.СписокВыбора.Добавить("40","Калужская область");
	Элементы.Регион.СписокВыбора.Добавить("41","Камчатский край");
	Элементы.Регион.СписокВыбора.Добавить("42","Кемеровская область");
	Элементы.Регион.СписокВыбора.Добавить("43","Кировская область");
	Элементы.Регион.СписокВыбора.Добавить("44","Костромская область");
	Элементы.Регион.СписокВыбора.Добавить("45","Курганская область");
	Элементы.Регион.СписокВыбора.Добавить("46","Курская область");
	Элементы.Регион.СписокВыбора.Добавить("47","Ленинградская область");
	Элементы.Регион.СписокВыбора.Добавить("48","Липецкая область ");
	Элементы.Регион.СписокВыбора.Добавить("49","Магаданская область");
	//Элементы.Регион.СписокВыбора.Добавить("50","Московская область");
	Элементы.Регион.СписокВыбора.Добавить("51","Мурманская область");
	Элементы.Регион.СписокВыбора.Добавить("52","Нижегородская область");
	Элементы.Регион.СписокВыбора.Добавить("53","Новгородская область");
	//Элементы.Регион.СписокВыбора.Добавить("54","Новосибирская область");
	Элементы.Регион.СписокВыбора.Добавить("55","Омская область");
	Элементы.Регион.СписокВыбора.Добавить("56","Оренбургская область");
	Элементы.Регион.СписокВыбора.Добавить("57","Орловская область");
	Элементы.Регион.СписокВыбора.Добавить("58","Пензенская область");
	Элементы.Регион.СписокВыбора.Добавить("59","Пермский край ");
	Элементы.Регион.СписокВыбора.Добавить("60","Псковская область");
	Элементы.Регион.СписокВыбора.Добавить("61","Ростовская область");
	Элементы.Регион.СписокВыбора.Добавить("62","Рязанская область ");
	Элементы.Регион.СписокВыбора.Добавить("63","Самарская область");
	Элементы.Регион.СписокВыбора.Добавить("64","Саратовская область");
	Элементы.Регион.СписокВыбора.Добавить("65","Сахалинская область");
	Элементы.Регион.СписокВыбора.Добавить("66","Свердловская область");
	Элементы.Регион.СписокВыбора.Добавить("67","Смоленская область");
	Элементы.Регион.СписокВыбора.Добавить("68","Тамбовская область");
	Элементы.Регион.СписокВыбора.Добавить("69","Тверская область");
	Элементы.Регион.СписокВыбора.Добавить("70","Томская область ");
	Элементы.Регион.СписокВыбора.Добавить("71","Тульская область ");
	Элементы.Регион.СписокВыбора.Добавить("72","Тюменская область");
	Элементы.Регион.СписокВыбора.Добавить("73","Ульяновская область");
	Элементы.Регион.СписокВыбора.Добавить("74","Челябинская область ");
	Элементы.Регион.СписокВыбора.Добавить("75","Забайкальский край ");
	Элементы.Регион.СписокВыбора.Добавить("76","Ярославская область");
	//Элементы.Регион.СписокВыбора.Добавить("77","Москва");
	//Элементы.Регион.СписокВыбора.Добавить("78","Санкт-Петербург");
	Элементы.Регион.СписокВыбора.Добавить("79","Еврейская автономная область");
	
	Элементы.Регион.СписокВыбора.Добавить("83","Ненецкий автономный округ");
	Элементы.Регион.СписокВыбора.Добавить("86","Ханты-Мансийский автономный округ - Югра");
	Элементы.Регион.СписокВыбора.Добавить("87","Чукотский автономный округ");
	Элементы.Регион.СписокВыбора.Добавить("89","Ямало-Ненецкий автономный округ");
	
	//Элементы.Регион.СписокВыбора.Добавить("91","Республика Крым"); не признана
	//Элементы.Регион.СписокВыбора.Добавить("92","Севастополь"); не признана

	Элементы.Индустрия.СписокВыбора.Добавить("","Все");
	Элементы.Индустрия.СписокВыбора.Добавить("sS","Строительство");
	Элементы.Индустрия.СписокВыбора.Добавить("sT","Транспорт");
	Элементы.Индустрия.СписокВыбора.Добавить("sM","Медиа");
	Элементы.Индустрия.СписокВыбора.Добавить("sI","ИТ и связь");
	Элементы.Индустрия.СписокВыбора.Добавить("sF","Финансы");
	Элементы.Индустрия.СписокВыбора.Добавить("sZ","Здравоохранение");
	Элементы.Индустрия.СписокВыбора.Добавить("sE","Образование");
	Элементы.Индустрия.СписокВыбора.Добавить("sK","Культура");
	Элементы.Индустрия.СписокВыбора.Добавить("sG","Госуправление");
	Элементы.Индустрия.СписокВыбора.Добавить("sO","Объединения");
	Элементы.Индустрия.СписокВыбора.Добавить("cT","Вся торговля");
	Элементы.Индустрия.СписокВыбора.Добавить("cT1","Автотранспорт и ГСМ");
	Элементы.Индустрия.СписокВыбора.Добавить("cT2","Продукты питания");
	Элементы.Индустрия.СписокВыбора.Добавить("cT3","Промтовары");
	Элементы.Индустрия.СписокВыбора.Добавить("cT4","Прочая торговля");
	Элементы.Индустрия.СписокВыбора.Добавить("cU","Все услуги");
	Элементы.Индустрия.СписокВыбора.Добавить("cU1","Право и бухучет");
	Элементы.Индустрия.СписокВыбора.Добавить("cU2","Реклама");
	Элементы.Индустрия.СписокВыбора.Добавить("cU3","Недвижимость");
	Элементы.Индустрия.СписокВыбора.Добавить("cU4","Гостиницы и рестораны");
	Элементы.Индустрия.СписокВыбора.Добавить("cU5","Туризм");
	Элементы.Индустрия.СписокВыбора.Добавить("cU6","Аренда и прокат");
	Элементы.Индустрия.СписокВыбора.Добавить("cU7","Производственные услуги");
	Элементы.Индустрия.СписокВыбора.Добавить("cU8","Социальные услуги");
	Элементы.Индустрия.СписокВыбора.Добавить("cU9","Бытовые услуги");
	Элементы.Индустрия.СписокВыбора.Добавить("cU10","Прочие услуги");
	Элементы.Индустрия.СписокВыбора.Добавить("cP","Все производство");
	Элементы.Индустрия.СписокВыбора.Добавить("cP1","Разведка и добыча");
	Элементы.Индустрия.СписокВыбора.Добавить("cP2","Энергетика и водоснабжение");
	Элементы.Индустрия.СписокВыбора.Добавить("cP3","Металлургия");
	Элементы.Индустрия.СписокВыбора.Добавить("cP4","Машиностроение");
	Элементы.Индустрия.СписокВыбора.Добавить("cP5","Приборостроение");
	Элементы.Индустрия.СписокВыбора.Добавить("cP6","Химическое производство");
	Элементы.Индустрия.СписокВыбора.Добавить("cP7","Легкая промышленность");
	Элементы.Индустрия.СписокВыбора.Добавить("cP8","Пищевое производство");
	Элементы.Индустрия.СписокВыбора.Добавить("cP9","Лесное хозяйство и деревопереработка");
	Элементы.Индустрия.СписокВыбора.Добавить("cP10","Сельское хозяйство");
	Элементы.Индустрия.СписокВыбора.Добавить("cP11","Прочие производства");

	Если СтрокаПоиска<>"" Тогда кнПоиск("")	КонецЕсли;	
	
КонецПроцедуры

//+интерфейс
&НаКлиенте
Процедура ЗадатьОтбор(Элемент) НомерСтраницы=1; Поиск(СтрокаПоиска) КонецПроцедуры
&НаКлиенте
Процедура кнПоиск(Команда) НомерСтраницы=1; Поиск(СтрокаПоиска) КонецПроцедуры
&НаКлиенте
Процедура СтрокаПоискаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка) НомерСтраницы=1; Поиск(Текст) КонецПроцедуры
&НаКлиенте
Процедура кнВыбрать(Команда) Выбор() КонецПроцедуры
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) Выбор() КонецПроцедуры
//-интерфейс

&НаКлиенте
Процедура Выбор() //возврат структуры 
	Стр=Список.НайтиПоИдентификатору(Элементы.Список.ТекущаяСтрока); 
	Закрыть(Новый Структура("Наименование,ИНН,ОГРН,Адрес,ДатаРегистрации",Стр.Наименование,Стр.ИНН,Стр.ОГРН,РазобратьАдрес(Стр.Адрес),Стр.ДатаРегистрации)) 
КонецПроцедуры

//+онлайн сервис
Процедура Поиск(СтрПоиска)
	Список.Очистить();
	//URL="https://focus.kontur.ru/search?query="+КодироватьСтроку(СтрокаПоиска,СпособКодированияСтроки.КодировкаURL,"UTF8")+"&industry="+Индустрия+"&region="+Регион+"&pagenum="+Формат(НомерСтраницы,"ЧГ=0");
	//IE.navigate(URL);
	//Пока IE.readyState<4 Цикл КонецЦикла;
	//Для каждого li Из IE.document.getElementsByTagName("ul").item(6).getElementsByTagName("li") Цикл
	//	Сообщить(li.getElementsByTagName("a").item(0).innerText);
	//КонецЦикла;	
	
	СтрокаПоиска=СтрПоиска; //восстановим  значение
	
	Таймаут=5;
	Попытка
		Соединение=Новый HTTPСоединение("focus.kontur.ru",,,,,Таймаут,Новый ЗащищенноеСоединениеOpenSSL);				
		HTTPЗапрос=Новый HTTPЗапрос("search?query="+СтрПоиска+"&industry="+Индустрия+"&region="+Регион+"&pagenum="+Формат(НомерСтраницы,"ЧГ=0"));	
		HTTPОтвет=Соединение.Получить(HTTPЗапрос);
	Исключение
		Сообщить(ОписаниеОшибки(),СтатусСообщения.Внимание);
		Возврат
	КонецПопытки;
	
	Если Не HTTPОтвет.КодСостояния=302 И (HTTPОтвет.КодСостояния<200 Или HTTPОтвет.КодСостояния>=300) Тогда
		Сообщить(Renault_СтроковыеФункцииКлиентСервер.ИзвлечьТекстИзHTML(HTTPОтвет.ПолучитьТелоКакСтроку()),СтатусСообщения.Внимание);
		Возврат
	КонецЕсли;
	
	ЧтениеHTML=Новый ЧтениеHTML;
	ЧтениеHTML.УстановитьСтроку(HTTPОтвет.ПолучитьТелоКакСтроку());
	ПостроительDOM=Новый ПостроительDOM;
	ДокументHTML=ПостроительDOM.Прочитать(ЧтениеHTML);
	ЧтениеHTML.Закрыть();
	
	Попытка 
		СписокЭлементов=ДокументHTML.ПолучитьЭлементыПоИмени("ul")[5].ПолучитьЭлементыПоИмени("li"); //список найденных 
		Если СписокЭлементов[0].ПолучитьЭлементыПоИмени("a").Количество()=0 Тогда Возврат КонецЕсли;  //ничего не нашлось
		Если СписокЭлементов[0].ПолучитьЭлементыПоИмени("p").Количество()=0 Тогда Возврат КонецЕсли; //нет реквизитов
	Исключение Возврат КонецПопытки;
	
	Для Каждого Эл Из СписокЭлементов Цикл
		Реквизиты=Эл.ПолучитьЭлементыПоИмени("p");
		Строка=Список.Добавить();
		Строка.Наименование=Эл.ПолучитьЭлементыПоИмени("a")[0].ТекстовоеСодержимое;
		
		СтрокаИнформации="";
		Для Н=1 По Реквизиты.Количество()-1 Цикл
			Реквизит=Реквизиты[Н];
			Если Реквизит.ИмяКласса="noMargin darkgreen" Тогда
				Строка.Информация=СтрокаИнформации;
				Строка.Адрес=Реквизит.ТекстовоеСодержимое;
				Если Строка.Адрес<>"" Тогда
					Строка.СсылкаАдреса="https://focus.kontur.ru"+Реквизит.ПолучитьЭлементыПоИмени("a")[0].Гиперссылка;
					//Ссылка Google Строка.СсылкаАдреса="https://www.google.ru/maps/place/"+КодироватьСтроку(Реквизит.ТекстовоеСодержимое,СпособКодированияСтроки.КодировкаURL,"UTF8");
					//Ссылка Yandex Строка.СсылкаАдреса="https://yandex.ru/maps/?text="+КодироватьСтроку(Реквизит.ТекстовоеСодержимое,СпособКодированияСтроки.КодировкаURL,"UTF8");
				КонецЕсли;	
					
				Реквизит=Реквизиты[Н+1];
				
				Строка.ИмяИНН="ИНН";
				Строка.ИмяОГРН="ОГРН";
				Строка.ИмяДатаРегистрации="Регистрация";
				
				Если Реквизит.ДочерниеУзлы.Количество()>0 Тогда
					Строка.ИНН=Сред(Реквизит.ДочерниеУзлы[1].ТекстовоеСодержимое,6);
				КонецЕсли;	
				
				Если Реквизит.ДочерниеУзлы.Количество()>2 Тогда
					Подстрока=СокрЛП(Реквизит.ДочерниеУзлы[3].ТекстовоеСодержимое);
					Поз=Найти(Подстрока,Символ(8211));
					Строка.ОГРН=СокрЛП(Сред(Подстрока,7,Поз-8));
					Строка.ДатаРегистрации=ПреобразованиеДаты(СокрЛП(Сред(Подстрока,Поз+1)));
				КонецЕсли;	
				
				Прервать
			Иначе
				СтрокаИнформации=СтрокаИнформации+?(СтрокаИнформации="","",Символы.ПС)+СокрЛП(Реквизит.ТекстовоеСодержимое);
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЦикла;
	
КонецПроцедуры
Функция ПреобразованиеДаты(Текст)
	Текст=СтрЗаменить(Текст,".",Символы.ПС);
	Если СтрЧислоСтрок(Текст)<>3 Тогда Возврат "" КонецЕсли;
	Возврат Дата(СтрПолучитьСтроку(Текст,3)+СтрПолучитьСтроку(Текст,2)+СтрПолучитьСтроку(Текст,1))
КонецФункции	
//-онлайн сервис

//+навигация
&НаКлиенте
Процедура кнСледующий(Команда) НомерСтраницы=НомерСтраницы+1; Поиск(СтрокаПоиска) КонецПроцедуры
&НаКлиенте
Процедура кнПредыдущий(Команда) НомерСтраницы=Макс(НомерСтраницы-1,1); Поиск(СтрокаПоиска) КонецПроцедуры
&НаКлиенте
Процедура НомерСтраницыПриИзменении(Элемент) Поиск(СтрокаПоиска) КонецПроцедуры
//-навигация

//+Адрес
Функция РазобратьАдрес(Строка)
	Поз=Найти(Строка,"Филиал:"); Если Поз>0 Тогда Строка=Сред(Строка,Поз+8) КонецЕсли;
	Представление=Строка;
	Индекс=Лев(Строка,6); Строка=Сред(Строка,8);
	
	Область=""; Район=""; Город=""; Улица=""; Дом=""; Строение=""; Корпус=""; Офис="";
	ЕстьОбласть=Ложь; ЕстьРайон=Ложь; ЕстьГород=Ложь; ЕстьУлица=Ложь; ЕстьДом=Ложь; ЕстьКорпус=Ложь; ЕстьСтроение=Ложь;
	
	Строка=СтрЗаменить(Строка,",",Символы.ПС);
	Для Н=1 По СтрЧислоСтрок(Строка) Цикл
		Подстрока=СтрПолучитьСтроку(Строка,Н);
		
		Если Не ЕстьОбласть Тогда СтрОбласть=НайтиОбласть(Подстрока); Если СтрОбласть<>"" Тогда Область=СтрОбласть; ЕстьОбласть=Истина; Продолжить КонецЕсли КонецЕсли;
		Если Не ЕстьРайон Тогда СтрРайон=НайтиРайон(Подстрока); Если СтрРайон<>"" Тогда Район=СтрРайон; ЕстьРайон=Истина; Продолжить КонецЕсли КонецЕсли;	
		Если Не ЕстьГород Тогда СтрГород=НайтиГород(Подстрока); Если СтрГород<>"" Тогда Город=СтрГород; ЕстьГород=Истина; Продолжить КонецЕсли КонецЕсли;
		Если Не ЕстьУлица Тогда СтрУлица=НайтиУлица(Подстрока); Если СтрУлица<>"" Тогда Улица=СтрУлица; ЕстьУлица=Истина; Продолжить КонецЕсли КонецЕсли;
		
		Если Не ЕстьДом Тогда 
			СтрДом=НайтиДом(Подстрока); 
			Если СтрДом<>"" Тогда Дом=СтрДом; 
				ЕстьДом=Истина; 
				Подстрока=СтрЗаменить(Подстрока,СтрДом,""); //продолжить анализ этой строки, но без значения идентифицированного здесь
			КонецЕсли 
		КонецЕсли;
		
		Если Не ЕстьКорпус Тогда СтрКорпус=НайтиКорпус(Подстрока); Если СтрКорпус<>"" Тогда Корпус=СтрКорпус; ЕстьКорпус=Истина; Продолжить КонецЕсли КонецЕсли;
		Если Не ЕстьСтроение Тогда СтрСтроение=НайтиСтроение(Подстрока); Если СтрСтроение<>"" Тогда Строение=СтрСтроение; ЕстьСтроение=Истина; Продолжить КонецЕсли КонецЕсли;
		СтрОфис=НайтиОфис(Подстрока); Если СтрОфис<>"" Тогда Офис=СтрОфис КонецЕсли;
		
	КонецЦикла;	
	
	Возврат Новый Структура("Представление,Индекс,Область,Район,Город,Улица,Дом,Строение,Корпус,Офис",Представление,Индекс,Область,Район,Город,Улица,Дом,Строение,Корпус,Офис)
КонецФункции
Функция НайтиОбласть(Подстрока)
	Если Найти(Подстрока," обл")>0 Или Найти(Подстрока,"респ ")>0 или Найти(Подстрока," край")>0
		ИЛИ Найти(Подстрока," ао")>0	
	Тогда
		//Стр=СтрЗаменить(Подстрока," обл","");
		//Стр=СтрЗаменить(Стр,"респ ","");
		//Стр=СтрЗаменить(Стр," край","");
		//Стр=СтрЗаменить(Стр," ао","");
		Возврат СокрЛП(Подстрока) //Стр
	Иначе Возврат "" КонецЕсли;	
КонецФункции
Функция НайтиРайон(Подстрока)
	Если Найти(Подстрока," р-н")>0 ИЛИ Найти(Подстрока," Район")>0 Тогда
		//Стр=СтрЗаменить(Подстрока," р-н","");
		Возврат СокрЛП(Подстрока) //Стр
	Иначе Возврат "" КонецЕсли;	
КонецФункции
Функция НайтиГород(Подстрока)
	Если Найти(Подстрока,"г ")>0 ИЛИ Найти(Подстрока,"д ")>0 ИЛИ Найти(Подстрока,"с ")>0 ИЛИ Найти(Подстрока,"п ")>0 ИЛИ Найти(Подстрока,"пгт ")>0 Тогда
		//Стр=СтрЗаменить(Подстрока,"г ","");
		//Стр=СтрЗаменить(Подстрока,"д ","");
		//Стр=СтрЗаменить(Подстрока,"с ","");
		//Стр=СтрЗаменить(Подстрока,"п ","");
		//Стр=СтрЗаменить(Подстрока,"пгт ","");
		Возврат СокрЛП(Подстрока) //Стр
	Иначе Возврат "" КонецЕсли;	
КонецФункции	
Функция НайтиУлица(Подстрока)
	Если Найти(Подстрока," ул ")>0 Или Найти(Подстрока," щ ")>0 Или Найти(Подстрока," пер ")>0 Или Найти(Подстрока," пр-кт ")>0 или Найти(Подстрока," проезд ")>0 Тогда
		//Стр=СтрЗаменить(Подстрока,"ул ","");
		Возврат СокрЛП(Подстрока) //Стр
	Иначе Возврат "" КонецЕсли;	
КонецФункции
Функция НайтиДом(Знач Подстрока)
	//Стр=Подстрока;
	//Для Н=0 По 9 Цикл Стр=СтрЗаменить(Стр,Строка(Н),"") КонецЦикла;
	//Стр=СтрЗаменить(Стр," ","")
	//Стр=СтрЗаменить(Стр,"/","")
	//Если СокрЛП(Стр)="" Тогда Возврат СокрЛП(Подстрока) Иначе Возврат "" КонецЕсли;
	
	Поз=Найти(Подстрока," корп "); Если Поз>0 Тогда Подстрока=Лев(Подстрока,Поз-1) КонецЕсли;	
	Поз=Найти(Подстрока," стр "); Если Поз>0 Тогда Подстрока=Лев(Подстрока,Поз-1) КонецЕсли;	
	
	Возврат СокрЛП(Подстрока)
КонецФункции
Функция НайтиКорпус(Подстрока)
	Поз=Найти(Подстрока," корп ");
	Если Поз>0 Тогда
		Стр=Сред(Подстрока,Поз+6);
		Возврат СокрЛП(Стр)
	Иначе Возврат "" КонецЕсли;	
КонецФункции
Функция НайтиСтроение(Подстрока)
	Поз=Найти(Подстрока," стр ");
	Если Поз>0 Тогда
		Стр=Сред(Подстрока,Поз+5);
		Возврат СокрЛП(Стр)
	Иначе Возврат "" КонецЕсли;	
КонецФункции
Функция НайтиОфис(Подстрока)
	//Если Найти(Подстрока,"оф ")>0 или Найти(Подстрока,"комн ")>0 или Найти(Подстрока,"кв ")>0 Тогда
		Стр=СтрЗаменить(Подстрока,"оф","");
		Стр=СтрЗаменить(Стр,"комн","");
		Стр=СтрЗаменить(Стр,"кв","");
		Возврат СокрЛП(Стр)
	//Иначе Возврат "" КонецЕсли;	
КонецФункции
//-Адрес