Перем ТаблицаБСО;

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	ТаблицаБСО = Renault_УчетБСО.ПолучитьТаблицуБСОПоТабЧасти(БСО, Организация, неопределено, ТочкаПродаж);
	ЕстьБСОВОрганизации = Renault_УчетБСО.ПроверитьНаличиеБСО(Дата, ТаблицаБСО, Организация, неопределено, неопределено, истина);
	ЕстьБСОНаТочках = Renault_УчетБСО.ПроверитьНаличиеБСОНаТочках(Ссылка, ТаблицаБСО, Организация, неопределено, ТочкаПродаж);
	Если НЕ ЕстьБСОВОрганизации ИЛИ ЕстьБСОНаТочках Тогда
		Отказ=Истина;
		Возврат
	КонецЕсли;	
	
	// регистр Renault_СтатусыБСО
	Движения.Renault_СтатусыБСО.Записывать = Истина;
	Движения.Renault_СтатусыБСО.Очистить();
	мСтатус = Перечисления.Renault_СтатусыБСО.Чистый;
	Для Каждого ТекСтрокаБСО Из ТаблицаБСО Цикл
		Движение = Движения.Renault_СтатусыБСО.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.СтраховаяКомпания = ТекСтрокаБСО.СтраховаяКомпания;
		Движение.ТипБСО = ТекСтрокаБСО.ТипБСО;
		Движение.СерияБСО = ТекСтрокаБСО.СерияБСО;
		Движение.НомерБСО = ТекСтрокаБСО.НомерБСО;
		Движение.Статус = мСтатус;
	КонецЦикла;

	// регистр Renault_БСОНаТочкеПродаж Приход
	Движения.Renault_БСОНаТочкеПродаж.Записывать = Истина;
	Движения.Renault_БСОНаТочкеПродаж.Очистить();
	Для Каждого ТекСтрокаБСО Из ТаблицаБСО Цикл
		Движение = Движения.Renault_БСОНаТочкеПродаж.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ТочкаПродаж = ТочкаПродаж;
		Движение.СтраховаяКомпания = ТекСтрокаБСО.СтраховаяКомпания;
		Движение.ТипБСО = ТекСтрокаБСО.ТипБСО;
		Движение.СерияБСО = ТекСтрокаБСО.СерияБСО;
		Движение.НомерБСО = ТекСтрокаБСО.НомерБСО;
		Движение.Количество = ТекСтрокаБСО.Количество;
	КонецЦикла;

КонецПроцедуры

Процедура Печать() Экспорт
	
	Renault_УчетБСО.ПечатьАктаПриемаПередачиБСО(Дата, Номер, Организация, ТочкаПродаж, БСО);
	
КонецПроцедуры
