
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивКлиентов = Параметры.Клиенты.ВыгрузитьЗначения();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_ЦентрализованныеРассылки.Идентификатор,
	               |	Renault_ЦентрализованныеРассылки.НазваниеКампании КАК Событие,
	               |	Renault_ЦентрализованныеРассылки.ДатаРассылки КАК Дата
	               |ИЗ
	               |	РегистрСведений.Renault_ЦентрализованныеРассылки КАК Renault_ЦентрализованныеРассылки
	               |ГДЕ
	               |	Renault_ЦентрализованныеРассылки.Объект В(&МассивКлиентов)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	"""",
	               |	Renault_CommunicationCenter_Обзвон.СхемаОбзвона.Наименование,
	               |	Renault_CommunicationCenter_Обзвон.Дата
	               |ИЗ
	               |	Документ.Renault_CommunicationCenter_Обзвон КАК Renault_CommunicationCenter_Обзвон
	               |ГДЕ
	               |	Renault_CommunicationCenter_Обзвон.Клиент В(&МассивКлиентов)
	               |	И Renault_CommunicationCenter_Обзвон.Дата <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |	И Renault_CommunicationCenter_Обзвон.СхемаОбзвона.ТипКоммуникации = &ТипКоммуникации";
	Запрос.УстановитьПараметр("МассивКлиентов", МассивКлиентов);
	Запрос.УстановитьПараметр("ТипКоммуникации", Перечисления.ВидыСобытий.ЭлектронноеПисьмо);
	
	ТаблицаВзаимодействия.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВзаимодействияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	
	
КонецПроцедуры


