
Функция ПараметрыHTTPСоединения(Сервер="GATE", Бренд = Неопределено) Экспорт
	
	НаименованиеБренда = ?(Бренд = Неопределено, ПараметрыСеанса.DMS_Бренд.ИмяПредопределенныхДанных, Бренд.ИмяПредопределенныхДанных);
	Если Сервер = "GATE" Тогда
		зн = Справочники.Renault_СлужебныеНастройкиБазыДанных[НаименованиеБренда];
		Возврат Новый Структура("URL, serviceName, port, login, password, SSL", зн.HTTP_URL, зн.HTTP_ServiceName, ?(ЗначениеЗаполнено(зн.HTTP_port), Число(зн.HTTP_port), 0), зн.ЛогинДоступаКВебСервисам, зн.ПарольДоступаКВебСервисам, зн.ИспользоватьЗащищенноеСоединение);
	Иначе
		//... может быть однажды
	КонецЕсли;
	
КонецФункции

//Массив БИРы дилера
Функция BIRs() Экспорт
	
	Запрос = Новый Запрос("Выбрать BIR Из Справочник.CRM_ДилерскиеЦентры ГДЕ НЕ ПометкаУдаления И BIR<>""""");
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("BIR");
	
КонецФункции

Функция Производители() Экспорт
	
	Если Метаданные.Имя = "Автосалон5" Тогда
		
		Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		                    |	CRM_ДилерскиеЦентры.Бренд КАК Производитель
		                    |ИЗ
		                    |	Справочник.CRM_ДилерскиеЦентры КАК CRM_ДилерскиеЦентры
		                    |ГДЕ
		                    |	CRM_ДилерскиеЦентры.ПометкаУдаления = ЛОЖЬ");
		
	ИначеЕсли Метаданные.Имя = "УправлениеТорговлей" Тогда
		
		Запрос = Новый Запрос("Выбрать Различные Производитель Из РегистрСведений.DMS_ДилерскиеЦентры");
		
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Производитель");
	
КонецФункции
