
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	метаНом = Метаданные.Справочники.Номенклатура.Реквизиты;
	Имена=Новый Структура("ор_Производитель,асПроизводитель,Производитель,Поставщик,ор_Поставщик");
	Для Каждого Стр Из Имена Цикл
		Если метаНом.Найти(Стр.Ключ)<>Неопределено Тогда
			имяПроизводитель=Стр.Ключ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Имена=Новый Структура("ор_НомерПоКаталогу,НомерПоКаталогу,АртикулПроизводителя,Артикул,АртикулДляПоиска");
	Для Каждого Стр Из Имена Цикл
		Если метаНом.Найти(Стр.Ключ)<>Неопределено Тогда
			имяАртикул=Стр.Ключ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если метаНом.Найти("АртикулДляПоиска")<>Неопределено Тогда
		имяАртикулДляПоиска="АртикулДляПоиска";
	Иначе
		имяАртикулДляПоиска=имяАртикул;
	КонецЕсли;
	Настройки=ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","Дубликаты",,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
	Если Настройки=Неопределено Тогда
		Шаблон="&А_Удалить";
		ПометитьНаУдаление=Истина;
	Иначе
		Шаблон=Настройки.Шаблон;
		ПометитьНаУдаление=Настройки.ПометитьНаУдаление;
	КонецЕсли;
	Производители=ЭтаФорма.Параметры.Производители;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаНоменклатуры Тогда
		Элементы.СтраницаДубликаты.Видимость=Истина;
		Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаДубликаты;
		Отказ=Истина;
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаДубликаты Тогда
		Элементы.СтраницаПроизводители.Видимость=Истина;
		Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаПроизводители;
		Отказ=Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНастройкиНаСервере(Настройки)
	ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса","Дубликаты",Настройки,,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Элемент)
	СохранитьНастройкиНаСервере(Новый Структура("Шаблон,ПометитьНаУдаление",Шаблон,ПометитьНаУдаление));
КонецПроцедуры

&НаКлиенте
Процедура ДубликатыПриАктивизацииСтроки(Элемент)
	ТекДан=Элементы.Дубликаты.ТекущиеДанные;
	Если ТекДан=Неопределено Тогда 
		Элементы.ПоказатьНоменклатуру.Доступность=Ложь;
		НеБренд = Истина;
	Иначе
		Элементы.ПоказатьНоменклатуру.Доступность=Истина;
		НеБренд =  ТекДан.Производитель <> Бренд;
	КонецЕсли;
	Элементы.ИзменитьБренд.Доступность=НеБренд;
	Элементы.УдалитьДубликат.Доступность=НеБренд;
КонецПроцедуры

&НаСервере
Процедура ПроизводителиВыборНаСервере(Список)
	
	ОбновитьНоменклатуруНаСервере(Список);
	
	Дубликаты.Очистить();
	Для Каждого Стр Из Список Цикл
		Нов=Дубликаты.Добавить();
		Нов.Производитель=Стр.Значение;
		Нов.Пометка=Нов.Производитель.ПометкаУдаления;
		Нов.Номенклатур=Номенклатура.НайтиСтроки(Новый Структура("Производитель",Нов.Производитель)).Количество();
	КонецЦикла;
	Бренд=Дубликаты[0].Производитель;
КонецПроцедуры

&НаКлиенте
Процедура ПроизводителиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДан=Элементы.Производители.ТекущиеДанные;
	ПроизводителиВыборНаСервере(ТекДан.Значение);
	Элементы.СтраницаДубликаты.Видимость=Истина;
	Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаДубликаты;
	
	// Отобразим на владельце выбранный бренд
	ТаблицаСинонимов=ЭтаФорма.ВладелецФормы.ТаблицаСинонимов;
	ЭлТаблицаСинонимов=ЭтаФорма.ВладелецФормы.Элементы.ТаблицаСинонимов;
	Для Каждого Стр Из ТаблицаСинонимов.ПолучитьЭлементы() Цикл
		Если Стр.Синоним=ТекДан.Представление Тогда
			СтрБренд=Стр;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ЭлТаблицаСинонимов.ТекущаяСтрока=СтрБренд.ПолучитьИдентификатор();
	ЭлТаблицаСинонимов.Обновить();
	ЭлТаблицаСинонимов.Развернуть(ЭлТаблицаСинонимов.ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНоменклатуруНаСервере(Список)
	Запрос=Новый Запрос(
	"ВЫБРАТЬ
	  |	Номенклатура.Ссылка КАК Номенклатура,
	  |	Номенклатура."+имяАртикул+" КАК Артикул,
	  |	Номенклатура."+имяАртикулДляПоиска+" КАК АртикулДляПоиска,
	  |	Номенклатура."+имяПроизводитель+" КАК Производитель,
	  |	Номенклатура.ПометкаУдаления КАК Пометка
	  |ИЗ
	  |	Справочник.Номенклатура КАК Номенклатура
	  |ГДЕ
	  |	Номенклатура."+имяПроизводитель+" В(&Производители)
	  |УПОРЯДОЧИТЬ ПО
  	  |	АртикулДляПоиска"
	);
	Запрос.УстановитьПараметр("Производители",Список);
	Выб=Запрос.Выполнить().Выбрать();
	Номенклатура.Очистить();
	Пока Выб.Следующий() Цикл
		Нов=Номенклатура.Добавить();
		ЗаполнитьЗначенияСвойств(Нов,Выб);
		Нов.АртикулДляПоиска=ПодготовитьНомер(Нов.АртикулДляПоиска);
	КонецЦикла;
	Номенклатура.Сортировать("АртикулДляПоиска");
	ТекАртикул=Неопределено;
	ТекСтр=Неопределено;
	Для Каждого Стр Из Номенклатура Цикл
		Если ТекАртикул=Стр.АртикулДляПоиска Тогда
			Стр.Дубликат=Истина;
			Если ТекСтр<>Неопределено Тогда
				ТекСтр.Дубликат=Истина;
				ТекСтр=Неопределено;
			КонецЕсли;
		Иначе
			ТекАртикул=Стр.АртикулДляПоиска;
			ТекСтр=Стр;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНоменклатуру(Команда)
	Массив=Новый Массив();
	для Каждого Стр Из Дубликаты Цикл
		Массив.Добавить(Стр.Производитель);
	КонецЦикла;
	ОбновитьНоменклатуруНаСервере(Массив);
КонецПроцедуры

&НаСервере
Процедура ОбновитьДубликатыНаСервере()
	Массив=Дубликаты.Выгрузить(,"Производитель").ВыгрузитьКолонку("Производитель");
	ОбновитьНоменклатуруНаСервере(Массив);
	Для Каждого Стр Из Дубликаты Цикл
		Стр.Пометка=Стр.Производитель.ПометкаУдаления;
		Стр.Номенклатур=Номенклатура.НайтиСтроки(Новый Структура("Производитель",Стр.Производитель)).Количество();
	КонецЦикла;
	Бренд=Дубликаты[0].Производитель;
	
Конецпроцедуры
	
&НаКлиенте
Процедура ОбновитьДубликаты(Команда)
	ОбновитьДубликатыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	Если Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаНоменклатуры Тогда
		Элементы.СтраницаДубликаты.Видимость=Истина;
		Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаДубликаты;
	Иначе
		Элементы.СтраницаПроизводители.Видимость=Истина;
		Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаПроизводители;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНоменклатуру(Команда)
	ТекДан=Элементы.Дубликаты.ТекущиеДанные;
	Если ТекДан=Неопределено Тогда Возврат;КонецЕсли;
	Элементы.Номенклатура.ОтборСтрок=Новый ФиксированнаяСтруктура("Производитель",ТекДан.Производитель);
	Элементы.Декорация3.Заголовок=Строка(ТекДан.Производитель);
	Элементы.СтраницаНоменклатуры.Видимость=Истина;
	Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаНоменклатуры;
КонецПроцедуры

&НаКлиенте
Процедура ДубликатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьНоменклатуру(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьБренд(Команда)
	// Бренд нужно менять в ТаблицаСинонимов, Производители[ТекБренд], Дубликаты
	ТекДан=Элементы.Дубликаты.ТекущиеДанные;
	Если ТекДан=Неопределено или ТекДан.Производитель=Бренд Тогда Возврат;КонецЕсли;
	Синоним =ВРЕГ(СокрП(ТекДан.Производитель)); //Имя нового бренда
	
	// Работаем с Таблицей синонимов
	ТаблицаСинонимов=ЭтаФорма.ВладелецФормы.ТаблицаСинонимов;
	Эл=ЭтаФорма.ВладелецФормы.Элементы.ТаблицаСинонимов;
	// Проверка соответствия бренда с текущей строкой таблицы синонимов
	СтрБренд=Эл.ТекущиеДанные;
	Если СтрБренд.Производитель<>Бренд ТОгда
		Сообщить("Потеря синхронизации по бренду");
		Возврат;
	КонецЕсли;
	// Ищем новый бренд
	ТекСтр=Эл.ТекущаяСтрока;
	//Эл.Развернуть(Элементы.ТаблицаСинонимов.ТекущаяСтрока);
	Для Каждого Стр Из СтрБренд.ПолучитьЭлементы() Цикл 
		Если ВРЕГ(Стр.Синоним)=Синоним Тогда
			СтрСин=Стр;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	// Меняем местами старый и новый бренд
	СтрСин.Синоним=СтрБренд.Синоним;
	СтрБренд.Производитель=ТекДан.Производитель;
	СтрБренд.Синоним=Синоним;
	ЭтаФорма.ВладелецФормы.Модифицированность=Истина;
	
	// Работаем с таблицей Производители	
	// Ищем текущий бренд
	ТекПро=Элементы.Производители.ТекущиеДанные;
	Если ТекПро<>СтрСин.Синоним Тогда
		Для Каждого Стр из Производители Цикл
			Если Стр.Представление=СтрСин.Синоним Тогда
				ТекПро=Стр;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Стр.Представление=Синоним;
	
	// В списке ищем новый бренд
	Список=Стр.Значение;
	СтрПро=Список.НайтиПоЗначению(ТекДан.Производитель);
	// Меняем их местами с старым брендом
	Струк=Новый Структура("Значение,Представление,Пометка",
	СтрПро.Значение,СтрПро.Представление,СтрПро.Пометка);
	ЗаполнитьЗначенияСвойств(СтрПро,Список[0]);
	ЗаполнитьЗначенияСвойств(Список[0],Струк);
	
	// Меняем бред и новый бренд в дубликатах
	Бренд=ТекДан.Производитель;
	Струк=Новый Структура("Производитель,Номенклатур,Пометка");
	ЗаполнитьЗначенияСвойств(Струк,Дубликаты[0]);
	ЗаполнитьЗначенияСвойств(Дубликаты[0],ТекДан,"Производитель,Номенклатур,Пометка");
	ЗаполнитьЗначенияСвойств(ТекДан,Струк);
	
	Элементы.Дубликаты.ТекущаяСтрока=Дубликаты[0];
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПодготовитьНомер(СтрНомерВх) Экспорт
	
	СтрНомер=Стрзаменить(СокрЛП(строка(СтрНомерВх)),символы.НПП,"");
	СтрНомер=Стрзаменить(СтрНомер,",","");
	СтрНомер=Стрзаменить(СтрНомер,")","");
	СтрНомер=Стрзаменить(СтрНомер,"(","");
	СтрНомер=Стрзаменить(СтрНомер,"-","");
	СтрНомер=Стрзаменить(СтрНомер,".","");
	СтрНомер=Стрзаменить(СтрНомер," ","");
	СтрНомер=Стрзаменить(СтрНомер,"""","");
	СтрНомер=Стрзаменить(СтрНомер,"'","");
	СтрНомер=Стрзаменить(СтрНомер,":","");
	СтрНомер=Стрзаменить(СтрНомер,";","");
	СтрНомер=Стрзаменить(СтрНомер,"/","");
	СтрНомер=Стрзаменить(СтрНомер,"|","");
	СтрНомер=Стрзаменить(СтрНомер,"\","");
	СтрНомер=Стрзаменить(СтрНомер,"!","");
	СтрНомер=Стрзаменить(СтрНомер,"#","");
	СтрНомер=Стрзаменить(СтрНомер,"№","");
	СтрНомер=Стрзаменить(СтрНомер,"?","");
	СтрНомер=Стрзаменить(СтрНомер,"*","");
	СтрНомер=Стрзаменить(СтрНомер,">","");
	СтрНомер=Стрзаменить(СтрНомер,"<","");	
	СтрНомер=Стрзаменить(СтрНомер,"_","");	
	Возврат ВРЕГ(СтрНомер);
	
Конецфункции

&НаСервере
Процедура УдалитьДубликатНаСервере(Производитель)
	// Выгрузить строки номенклатуры Дубликата
	Строки = Номенклатура.НайтиСтроки(Новый Структура("Производитель",Производитель));
	Для Каждого Стр Из Строки Цикл
		Артикул=Неопределено;
		ЕСли Стр.Дубликат Тогда
			// Если строка Дубликат тогда ищем его у бренда
			Дубли=Номенклатура.НайтиСтроки(Новый Структура("Производитель,АртикулДляПоиска",Бренд,Стр.АртикулДляПоиска));
			Если Дубли.Количество()>0 Тогда
				// Если есть у бренда - определяем новый артикул из шаблона:
				Если ПустаяСтрока(Шаблон) Тогда
					Артикул=стр.Артикул;
				Иначе	
					Артикул = СтрЗаменить(Шаблон,"&A",стр.Артикул);
					Артикул = СтрЗаменить(Артикул,"&А",стр.Артикул);
					//Артикул = СтрЗаменить(Артикул,"&К",стр.АртикулДляПоиска);
					//Артикул = СтрЗаменить(Артикул,"&K",стр.АртикулДляПоиска);
					//Артикул = СтрЗаменить(Артикул,"&П",стр.Производитель);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ОбНом=Стр.Номенклатура.ПолучитьОбъект();
		обНом[имяПроизводитель]=Бренд;
		Если Артикул<>Неопределено Тогда
			обНом[имяАртикул]=Артикул;
			АртикулДляПоиска=ПодготовитьНомер(Артикул);
			Если имяАртикул<>имяАртикулДляПоиска Тогда
				обНом[имяАртикулДляПоиска]=АртикулДляПоиска;
			КонецЕсли;
			Если ПометитьНаУдаление Тогда
				ОбНом.ПометкаУдаления=Истина;
			КонецЕсли;
		КонецЕсли;
		Попытка
			ОбНом.Записать();
		Исключение
			Сообщить("Ошибка при записи номенклатуры: "+ОписаниеОшибки());
			Продолжить;
		Конецпопытки;
		Стр.Производитель=Бренд;
		Если Артикул<>Неопределено Тогда
			Стр.Дубликат=Ложь;
			Стр.Артикул=Артикул;
			Стр.АртикулДляПоиска=АртикулДляПоиска;
			Если ПометитьНаУдаление Тогда
				Стр.Пометка=Стр.Номенклатура.ПометкаУдаления;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Об=Производитель.Получитьобъект();
	Об.ПометкаУдаления=Истина;
	Попытка
		Об.Записать();
	Исключение
	Конецпопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДубликат(Команда)
	ТекДан=Элементы.Дубликаты.ТекущиеДанные;
	Если ТекДан=Неопределено или ТекДан.Производитель=Бренд Тогда Возврат;КонецЕсли;
	УдалитьДубликатНаСервере(ТекДан.Производитель);
	ТекДан.Номенклатур=Номенклатура.НайтиСтроки(Новый Структура("Производитель",ТекДан.Производитель)).Количество();
	ТекДан.Пометка=Истина;
	Дубликаты[0].Номенклатур=Номенклатура.НайтиСтроки(Новый Структура("Производитель",Бренд)).Количество();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДубликаты(Команда)
	Для Каждого Стр Из Дубликаты Цикл
		Если Стр.Производитель=Бренд Тогда Продолжить;КонецЕсли;
		УдалитьДубликатНаСервере(Стр.Производитель);
		Стр.Номенклатур=Номенклатура.НайтиСтроки(Новый Структура("Производитель",Стр.Производитель)).Количество();
		Стр.Пометка=Истина;
	КонецЦикла;
	Дубликаты[0].Номенклатур=Номенклатура.НайтиСтроки(Новый Структура("Производитель",Бренд)).Количество();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНоменклатуру(Команда)
	ТекДан=Элементы.Номенклатура.ТекущиеДанные;
	Если ТекДан=Неопределено Тогда Возврат; КонецЕсли;
	ОО = Новый ОписаниеОповещения("ИзменениеНоменклатуры",ЭтаФорма,ТекДан.Номенклатура);
	ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта",Новый Структура("Ключ",ТекДан.Номенклатура),ЭтаФорма,,,,ОО);
КонецПроцедуры

&НаСервере
Процедура ИзменитьНоменклатуруНаСервере(Ссылка)
	Строки=Номенклатура.НайтиСтроки(Новый Структура("Номенклатура",Ссылка));
	Если Строки.Количество()>0 Тогда
		Стр=Строки[0];
		Если Стр.Артикул=Ссылка[имяАртикул] Тогда
			Если Стр.Производитель<>Ссылка[имяПроизводитель] Тогда
				Стр.Производитель=Ссылка[имяПроизводитель];
			КонецЕсли;
			Стр.Пометка=ссылка.ПометкаУдаления;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Массив=Дубликаты.Выгрузить(,"Производитель").ВыгрузитьКолонку("Производитель");
	ОбновитьНоменклатуруНаСервере(Массив);
КонецПроцедуры
	
&НаКлиенте
Процедура ИзменениеНоменклатуры(Ответ,Ссылка) Экспорт
	ИзменитьНоменклатуруНаСервере(Ссылка);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПометитьНаСервере(ссылка)
	Об=ссылка.ПолучитьОбъект();
	Об.ПометкаУдаления=Не Об.ПометкаУдаления;
	Попытка
		Об.Записать();
	Исключение
	Конецпопытки;
	Возврат Ссылка.ПометкаУдаления;
КонецФункции

&НаКлиенте
Процедура ПометитьПроизводителя(Команда)
	ТекДан=Элементы.Дубликаты.ТекущиеДанные;
	Если ТекДан=Неопределено Тогда возврат;КонецЕсли;
	ТекДан.Пометка=ПометитьНаСервере(ТекДан.Производитель);
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНоменклатуру(Команда)
	ТекДан=Элементы.Номенклатура.ТекущиеДанные;
	Если ТекДан=Неопределено Тогда возврат;КонецЕсли;
	ТекДан.Пометка=ПометитьНаСервере(ТекДан.Номенклатура);
КонецПроцедуры


