
&НаКлиенте
Процедура МоделиПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Модели.ТекущаяСтрока = Неопределено ИЛИ ЭтаФорма.ТолькоПросмотр Тогда
		
		Элементы.РаботыКоманднаяПанель.Доступность = ЛОЖЬ;
		Элементы.НоменклатураКоманднаяПанель.Доступность = ЛОЖЬ;
		
	Иначе
		
		Элементы.РаботыКоманднаяПанель.Доступность = Истина;
		Элементы.НоменклатураКоманднаяПанель.Доступность = Истина;
		
	КонецЕсли;
	
	СписокНоменклатура.Очистить();
	СписокРаботы.Очистить();
	СписокВариантыКомплектации.Очистить();
	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда
		Если НЕ Элемент.ТекущиеДанные.УИД = "" Тогда
			Отбор = Новый Структура;
			Отбор.Вставить("УИД", Элемент.ТекущиеДанные.УИД);
			МассивСтрок = Объект.Номенклатура.НайтиСтроки(Отбор);
			Для Каждого Строка ИЗ МассивСтрок Цикл
				НоваяСтрока = СписокНоменклатура.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			КонецЦикла;
			МассивСтрок = Объект.Работы.НайтиСтроки(Отбор);
			Для Каждого Строка ИЗ МассивСтрок Цикл
				НоваяСтрока = СписокРаботы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			КонецЦикла;
			МассивСтрок = Объект.ВариантыКомплектации.НайтиСтроки(Отбор);
			Для Каждого Строка ИЗ МассивСтрок Цикл
				НоваяСтрока = СписокВариантыКомплектации.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				Если Строка.ГУР = -1 Тогда
					НоваяСтрока.ГУР = "Не используется";
				ИначеЕсли Строка.ГУР = 0 Тогда
					НоваяСтрока.ГУР = "Нет";
				ИначеЕсли Строка.ГУР = 1 Тогда
					НоваяСтрока.ГУР = "Да";
				КонецЕсли;
				Если Строка.АС = -1 Тогда
					НоваяСтрока.АС = "Не используется";
				ИначеЕсли Строка.АС = 0 Тогда
					НоваяСтрока.АС = "Нет";
				ИначеЕсли Строка.АС = 1 Тогда
					НоваяСтрока.АС = "Да";
				КонецЕсли;
				Если Строка.СФ = -1 Тогда
					НоваяСтрока.СФ = "Не используется";
				ИначеЕсли Строка.СФ = 0 Тогда
					НоваяСтрока.СФ = "Нет";
				ИначеЕсли Строка.СФ = 1 Тогда
					НоваяСтрока.СФ = "Да";
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МоделиПриИзменении(Элемент)
	
	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда
		Если Элемент.ТекущиеДанные.УИД = "" Тогда
			Элемент.ТекущиеДанные.УИД = Новый УникальныйИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	ТекущийУИД = Элементы.Модели.ТекущиеДанные.УИД;
	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда
		Если Элемент.ТекущиеДанные.УИД = "" Тогда
			Элемент.ТекущиеДанные.УИД = ТекущийУИД;
		КонецЕсли;
	КонецЕсли;
	
	ПерезаписатьСтрокиНоменклатура(ТекущийУИД);
	Элементы.Модели.ТекущиеДанные.СтоимостьВсего = ПолучитьИтогНоменклатура(ТекущийУИД) + ПолучитьИтогРаботы(ТекущийУИД);
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыПриИзменении(Элемент)
	
	ТекущийУИД = Элементы.Модели.ТекущиеДанные.УИД;
	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда
		Если Элемент.ТекущиеДанные.УИД = "" Тогда
			Элемент.ТекущиеДанные.УИД = ТекущийУИД;
		КонецЕсли;
	КонецЕсли;
	
	ПерезаписатьСтрокиРаботы(ТекущийУИД);
	Элементы.Модели.ТекущиеДанные.СтоимостьВсего = ПолучитьИтогНоменклатура(ТекущийУИД) + ПолучитьИтогРаботы(ТекущийУИД);
	
КонецПроцедуры

&НаСервере
Процедура ПерезаписатьСтрокиНоменклатура(УИД)
	
	Отбор = Новый Структура;
	Отбор.Вставить("УИД", УИД);
	Строки = Объект.Номенклатура.НайтиСтроки(Отбор);
	Для Каждого Строка ИЗ Строки Цикл
		Объект.Номенклатура.Удалить(Строка);
	КонецЦикла;
	Для Каждого Элемент ИЗ СписокНоменклатура Цикл
		НоваяСтрока = Объект.Номенклатура.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПерезаписатьСтрокиРаботы(УИД)
	
	Отбор = Новый Структура;
	Отбор.Вставить("УИД", УИД);
	Строки = Объект.Работы.НайтиСтроки(Отбор);
	Для Каждого Строка ИЗ Строки Цикл
		Объект.Работы.Удалить(Строка);
	КонецЦикла;
	Для Каждого Элемент ИЗ СписокРаботы Цикл
		НоваяСтрока = Объект.Работы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИтогНоменклатура(ТекущийУИД)
	
	Таблица = ДанныеФормыВЗначение(СписокНоменклатура, Тип("ТаблицаЗначений"));
	Возврат Таблица.Итог("Стоимость");
	
КонецФункции

&НаСервере
Функция ПолучитьИтогРаботы(ТекущийУИД)
	
	Таблица = ДанныеФормыВЗначение(СписокРаботы, Тип("ТаблицаЗначений"));
	Если Объект.СтоимостьВключаетРаботы = Истина Тогда
		Отбор = Новый Структура();
		Отбор.Вставить("ЭтоРаботаДилера", Ложь);
		//МассивСтрок = Таблица.НайтиСтроки(Отбор);
		Результат = Таблица.Скопировать(Отбор);
		Возврат Результат.Итог("СтоимостьРаботы");
	Иначе
		Возврат Таблица.Итог("СтоимостьРаботы");
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура МоделиПередУдалением(Элемент, Отказ)
	
	Отбор = Новый Структура;
	Отбор.Вставить("УИД", Элемент.ТекущиеДанные.УИД);
	Строки = Объект.Номенклатура.НайтиСтроки(Отбор);
	Для Каждого Строка ИЗ Строки Цикл
		Объект.Номенклатура.Удалить(Строка);
	КонецЦикла;
	Строки = Объект.Работы.НайтиСтроки(Отбор);
	Для Каждого Строка ИЗ Строки Цикл
		Объект.Работы.Удалить(Строка);
	КонецЦикла;
	Строки = Объект.ВариантыКомплектации.НайтиСтроки(Отбор);
	Для Каждого Строка ИЗ Строки Цикл
		Объект.ВариантыКомплектации.Удалить(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЦены(Команда)
	
	// Здесь открываем Эксель
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЦеныПолностью(Команда)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура МоделиВариантКомплектацииНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ФормаВыбора = ПолучитьФорму("Справочник.ВариантыКомплектации.ФормаВыбора");
	
КонецПроцедуры

&НаКлиенте
Процедура МоделиВариантКомплектацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ФормаВыбора = ПолучитьФорму("Справочник.ВариантыКомплектации.ФормаВыбора");
	Отбор = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Модель");
	Отбор.ПравоеЗначение = Элемент.Родитель.ТекущиеДанные.Модель;
	Ответ = ФормаВыбора.ОткрытьМодально();
	Если ЗначениеЗаполнено(Ответ) Тогда
		Элементы.Модели.ТекущиеДанные.ВариантКомплектации = Ответ;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Элементы.Модели.ТекущаяСтрока = Неопределено ИЛИ ЭтаФорма.ТолькоПросмотр Тогда
		
		Элементы.РаботыКоманднаяПанель.Доступность = ЛОЖЬ;
		Элементы.НоменклатураКоманднаяПанель.Доступность = ЛОЖЬ;
		
	Иначе
		
		Элементы.РаботыКоманднаяПанель.Доступность = Истина;
		Элементы.НоменклатураКоманднаяПанель.Доступность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураРеферансПриИзменении(Элемент)

	ТекДанные = Элементы.Номенклатура.ТекущиеДанные;

	Настройки = Renault_CRM.ПолучитьНастройкиЗапчастей();
	ТипЦенPCL = Настройки.ТипЦенPCL;
	ТипЦенPNC = Настройки.ТипЦенPNC;
	Реф       = ТекДанные.Реферанс;

	ЦенаPCL = Renault_АвтосервисОбщий.ПолучитьЦенуТоваров(Реф, ТипЦенPCL);
	ЦенаPNC = Renault_АвтосервисОбщий.ПолучитьЦенуТоваров(Реф, ТипЦенPNC);

	ТекДанные.PCL_БезНДС = ЦенаPCL;
	ТекДанные.PNC_БезНДС = ЦенаPNC;
	ТекДанные.Артикул    = Реф.Артикул;
	ТекДанные.Стоимость  = ТекДанные.Количество * ТекДанные.PCL_БезНДС;

КонецПроцедуры


&НаКлиенте
Процедура НормализоватьЦены(Команда)
	
	НормализоватьНаСервере();
	МоделиПриАктивизацииСтроки(Элементы.Модели);
	
КонецПроцедуры

&НаСервере
Процедура НормализоватьНаСервере()
	
	Настройки = Renault_CRM.ПолучитьНастройкиЗапчастей();
	ТипЦен = Настройки.ТипЦенPCL;
	
	Для Каждого Строка ИЗ Объект.Модели Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("УИД", Строка.УИД);
		СтрокиНоменклатуры = Объект.Номенклатура.НайтиСтроки(Отбор); // находим строки с номенклатурой
		РазницаЦен = 0;
		Для Каждого СтрокаНоменклатуры ИЗ СтрокиНоменклатуры Цикл
			СтараяЦена = СтрокаНоменклатуры.PCL_БезНДС;
			Если ЗначениеЗаполнено(СтрокаНоменклатуры.Реферанс) Тогда // если есть номенклатура, то берем её цену из базы
				СтрокаНоменклатуры.PCL_БезНДС = Renault_АвтосервисОбщий.ПолучитьЦенуТоваров(СтрокаНоменклатуры.Реферанс, ТипЦен);
			КонецЕсли;
			РазницаЦен = РазницаЦен + (СтрокаНоменклатуры.PCL_БезНДС - СтараяЦена); // получаем разницу между новой и старой ценами
		КонецЦикла;
		
		Если РазницаЦен <> 0 Тогда // Вычтем из стоимости работ полученную разницу
			ОстатокДляВычета = РазницаЦен;
			СуммаРабот = 0;
			СтрокиРабот = Объект.Работы.НайтиСтроки(Отбор);
			Для Каждого СтрокаРаботы ИЗ СтрокиРабот Цикл
				СуммаРабот = СуммаРабот + СтрокаРаботы.СтоимостьРаботы;
			КонецЦикла;
			Для Каждого СтрокаРаботы ИЗ СтрокиРабот Цикл
				ВычитаемаяЧасть = РазницаЦен * СтрокаРаботы.СтоимостьРаботы / СуммаРабот;
				СтрокаРаботы.СтоимостьРаботы = СтрокаРаботы.СтоимостьРаботы - ВычитаемаяЧасть;
				УстановитьНовуюЦену(СтрокаРаботы.Работа, СтрокаРаботы.СтоимостьРаботы, ТипЦен);
				ОстатокДляВычета = ОстатокДляВычета - ВычитаемаяЧасть;
			КонецЦикла;
			СтрокаРаботы.СтоимостьРаботы = СтрокаРаботы.СтоимостьРаботы - ОстатокДляВычета;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьНовуюЦену(Авторабота, Цена, ТипЦен)
	
	ИзменениеЦен = Документы.ИзменениеЦенАвторабот.СоздатьДокумент();
	НоваяРабота = ИзменениеЦен.Автоработы.Добавить();
	НоваяРабота.Авторабота = Авторабота;
	//НоваяРабота.Нормочас = Нормочас;
	//ЦенаНормочаса = (ЦенаИтого - ЦенаСвязанных);
	НоваяРабота.Цена = Цена;
	
	ИзменениеЦен.Автор = ПараметрыСеанса.Пользователь;
	ИзменениеЦен.Организация = ПараметрыСеанса.Пользователь.Организация;
	ИзменениеЦен.ТипЦен = ТипЦен;
	ИзменениеЦен.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	ИзменениеЦен.КурсДокумента = 1;
	ИзменениеЦен.ХозОперация = Справочники.ХозОперации.УстановкаЦенАвтоработКомпании;
	ИзменениеЦен.Дата = ТекущаяДата();
	ИзменениеЦен.ДатаНачалаДействия = ТекущаяДата();
	ИзменениеЦен.ПодразделениеКомпании = ПараметрыСеанса.Пользователь.Подразделение;
	ИзменениеЦен.УстановитьНовыйНомер();
	ИзменениеЦен.Записать();
	ИзменениеЦен.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураРеферансНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	АналогиИЗамены = НайтиАналогиЗамены(Элемент.Родитель.ТекущиеДанные.Реферанс);
	Если АналогиИЗамены.Количество() = 0 Тогда
		Предупреждение("По данной номенклатуре нет замен или аналогов!");
	Иначе
		Ответ = АналогиИЗамены.ВыбратьЭлемент("Выберите замену для номенклатуры");
		Если Ответ <> Неопределено Тогда
			Элемент.Родитель.ТекущиеДанные.Реферанс = Ответ.Значение;
			НоменклатураРеферансПриИзменении(Элемент);
			НоменклатураПриИзменении(Элемент.Родитель)
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НайтиАналогиЗамены(НоменклатураСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыАналогов.ИдентификаторГруппы
	|ПОМЕСТИТЬ ВремТЗ
	|ИЗ
	|	РегистрСведений.ГруппыАналогов КАК ГруппыАналогов
	|ГДЕ
	|	ГруппыАналогов.Артикул = &Артикул
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка
	|ИЗ
	|	РегистрСведений.ГруппыАналогов КАК ГруппыАналогов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремТЗ КАК ВремТЗ
	|		ПО (ВремТЗ.ИдентификаторГруппы = ГруппыАналогов.ИдентификаторГруппы)
	|			И (ГруппыАналогов.Артикул <> &Артикул)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО (Номенклатура.Артикул = ГруппыАналогов.Артикул)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Замены КАК Замены
	|		ПО (Замены.АртикулЗамены = Номенклатура.Артикул)
	|ГДЕ
	|	Замены.Артикул = &Артикул";
	Запрос.УстановитьПараметр("Артикул", НоменклатураСсылка.Артикул);
	Результат = Запрос.Выполнить().Выгрузить();
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("Ссылка"));
	Возврат Список;
	
КонецФункции

&НаКлиенте
Процедура РаботыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Элемент.ТекущиеДанные.ЭтоРаботаДилера = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьВключаетРаботыПриИзменении(Элемент)
	
	Для Каждого СтрокаМодель ИЗ Объект.Модели Цикл
		СтрокаМодель.СтоимостьВсего = ПолучитьИтогЗЧ(СтрокаМодель.УИД) + ПолучитьИтогРабот(СтрокаМодель.УИД);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИтогЗЧ(УИД)
	
	Отбор = Новый Структура;
	Отбор.Вставить("УИД", УИД);
	Строки = Объект.Номенклатура.Выгрузить(Отбор);
	Возврат Строки.Итог("Стоимость");
	
КонецФункции

&НаСервере
Функция ПолучитьИтогРабот(УИД)
	
	Отбор = Новый Структура;
	Отбор.Вставить("УИД", УИД);
	Строки = Объект.Работы.Выгрузить(Отбор);
	Если Объект.СтоимостьВключаетРаботы = Истина Тогда
		Отбор = Новый Структура();
		Отбор.Вставить("ЭтоРаботаДилера", Ложь);
		Результат = Строки.Скопировать(Отбор);
		Возврат Результат.Итог("СтоимостьРаботы");
	Иначе
		Возврат Строки.Итог("СтоимостьРаботы");
	КонецЕсли;
	
КонецФункции



