Функция ПолучитьПрокси() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	//ДанныеПодключения = Справочники.Renault_ПараметрыПодключенияКСервисам.ПолучитьПараметрыПодключенияПоСсылке(
	//	Справочники.Renault_ПараметрыПодключенияКСервисам.WSGate,
	//	"Flotte.1cws");
	//Адрес = ДанныеПодключения.Адрес;
	//ЛогинWS = ДанныеПодключения.Логин;
	//ПарольWS = ДанныеПодключения.Пароль;
	//
	//WSОпределение = Новый WSОпределения(
	//	СокрЛП(Адрес),
	//	СокрЛП(ЛогинWS),
	//	СокрЛП(ПарольWS));
	//ВебСервис = Новый WSПрокси(
	//	WSОпределение, 
	//	"http://renault.ru/FlotteCentral", 
	//	"Renault_Flotte", 
	//	"Renault_FlotteSoap12", 
	//	3600);
	//ВебСервис.Пользователь = СокрЛП(ЛогинWS);
	//ВебСервис.Пароль = СокрЛП(ПарольWS);
	//Возврат ВебСервис;
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	
	ПарольWS = Настройки.ПарольДоступаКВебСервисам;
	ЛогинWS = Настройки.ЛогинДоступаКВебСервисам;
	
	АдресWS = Настройки.КЦАдресСервера;
	СообщениеОбОшибке = "";
	
	ВСОпределение = Новый WSОпределения(СокрЛП(АдресWS) + "ws/Flotte.1cws?wsdl",
									СокрЛП(ЛогинWS), СокрЛП(ПарольWS));
	
	ВебСервис = Новый WSПрокси(
		ВСОпределение, 
		"http://renault.ru/FlotteCentral", 
		"Renault_Flotte", 
		"Renault_FlotteSoap12", 
		3600);
		
	ВебСервис.Пользователь	 = СокрЛП(ЛогинWS);
	ВебСервис.Пароль		 = СокрЛП(ПарольWS);
	
	Возврат ВебСервис;
	
КонецФункции

