////@+ Функция ПолучитьИдентификатор(Организация)
// Дата создания - 16.05.2012 11:48:33; Автор - Окипний Андрей Евгеньевич
//
// Описание функции
// Функция получает Идентификатор дилера (BIR)
//
// Параметры
//  Организация  - СправочникЭлемент.Ссылка  - Ссылка на организацию
//
// Возвращаемое значение
//  ИдентификаторДилера  - Строка(9) - Строковое значение BIR 
//                 нормализованное до 9 символов
//@-
Функция ПолучитьИдентификатор(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПОДСТРОКА(CRM_ДилерскиеЦентры.BIR, 1, 8) КАК BIR
	|ИЗ
	|	Справочник.CRM_ДилерскиеЦентры КАК CRM_ДилерскиеЦентры
	|ГДЕ
	|	CRM_ДилерскиеЦентры.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация", Организация);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.BIR;
	
КонецФункции // ПолучитьИдентификатор(Организация)

////@+ Функция РазложитьСтрокуВСписок(Знач ИсходнаяСтрока, Разделитель = ";")
// Дата создания - 16.05.2012 11:44:23; Автор - Окипний Андрей Евгеньевич
//
// Описание функции
//  Функция "расщепляет" строку на подстроки, используя заданный 
//  разделитель. Разделитель может иметь любую длину. 
//  
//  Например, 
//   РазложитьСтрокуВМассивПодстрок(",ку,,,му", ",") возвратит массив значений из пяти элементов, 
//   три из которых - пустые строки.
//
// Параметры
//  ИсходнаяСтрока  - Строка (неограниченная) - Строка, которую необходимо 
//                 разложить на составляющие
//  Разделитель  - Строка - Строковое представление разделителя
//                 <продолжение описания параметра>
//
// Возвращаемое значение
//  СписокСтрок  - СписокЗначений - Список значений с элементами полученными 
//                 из переданной строки
//@-
Функция РазложитьСтрокуВСписок(Знач ИсходнаяСтрока, Разделитель = ";") Экспорт
	
	//Сначала получаем массив
	МассивСтрок = РазложитьСтрокуВМассив(ИсходнаяСтрока, Разделитель);
	
	//Теперь массив загружаем в СписокЗначений
	СписокСтрок = Новый СписокЗначений;
	СписокСтрок.ЗагрузитьЗначения(МассивСтрок);

	Возврат СписокСтрок;
	
КонецФункции // РазложитьСтрокуВСписок(Знач ИсходнаяСтрока, Разделитель = ";")

////@+ Функция РазложитьСтрокуВМассив(Знач Стр, Разделитель = ",")
// Дата создания - 16.05.2012 11:32:11; Автор - Окипний Андрей Евгеньевич
//
// Описание функции
//  Функция "расщепляет" строку на подстроки, используя заданный 
//  разделитель. Разделитель может иметь любую длину. 
//  
//  Например, 
//   РазложитьСтрокуВМассивПодстрок(",ку,,,му", ",") возвратит массив значений из пяти элементов, 
//   три из которых - пустые строки.
//
// Параметры
//  Стр  - Строка - строка, которую необходимо разложить на подстроки. 
//						Параметр передается по значению.
//  Разделитель  - Строка-разделитель, по умолчанию - запятая.
//
// Возвращаемое значение
//  МассивСтрок  - Массив - массив значений, элементы которого - подстроки
//
//@-
Функция РазложитьСтрокуВМассив(Знач Стр, Разделитель = ",") Экспорт
	
	МассивСтрок = Новый Массив();
	
	Если Разделитель = " " Тогда
		
		Стр = СокрЛП(Стр);
		
		Пока Истина Цикл
			
			Поз = Найти(Стр,Разделитель);
			
			Если Поз=0 Тогда
				
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
				
			КонецЕсли;
			
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
			
		КонецЦикла;
		
	Иначе
		
		ДлинаРазделителя = СтрДлина(Разделитель);
		
		Пока Истина Цикл
			
			Поз = Найти(Стр,Разделитель);
			
			Если Поз=0 Тогда
				
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
				
			КонецЕсли;
			
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции // РазложитьСтрокуВМассив(Знач Стр, Разделитель = ",")

// Функция возвращает значение свойства для переданного объекта
//
// Параметры:
//	Объект   			- ДокументСсылка, СправочникСсылка 	- Ссылка на документ или справочник,
//						для которого получается значение свойства
//  Свойство 			- Строка 							- Свойство, значение которого необходимо получить
// 	ЗначениеПоУмолчанию - Неопределено 						- Значение по умолчанию, которое возвращает функция,
//						если значения свойства или свойства не существует
//
// Возвращаемое значение:
//	Неопределено - Значение свойства для данного объекта или переданное значение по умолчанию
//
Функция ПолучитьЗначениеСвойства(Объект,Свойство,ЗначениеПоУмолчанию=Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Объект) ИЛИ НЕ ЗначениеЗаполнено(Свойство) Тогда Возврат ЗначениеПоУмолчанию КонецЕсли;
	
	Попытка
		ОбъектСсылка = Объект.Ссылка
	Исключение
		Возврат ЗначениеПоУмолчанию	
	КонецПопытки;
	
	// Найдем ссылку на переданное свойство
	
	ТипЗначения=ТипЗнч(Свойство);
	Если ТипЗначения=Тип("ПланВидовХарактеристикСсылка.СвойстваОбъектов") Тогда
		СвойствоСсылка = Свойство 
	ИначеЕсли ТипЗначения=Тип("Строка") Тогда
		// Поиск предопределенного или по наименованию
		Попытка		СвойствоСсылка = ПланыВидовХарактеристик.СвойстваОбъектов[СокрЛП(Свойство)];
		Исключение	СвойствоСсылка = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию(СокрЛП(Свойство),Истина);
		КонецПопытки; 
	ИначеЕсли ТипЗначения=Тип("Число") Тогда
		// Поиск по коду
		СвойствоСсылка = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду(Свойство);
	Иначе СвойствоСсылка = ПланыВидовХарактеристик.СвойстваОбъектов.ПустаяСсылка()
	КонецЕсли;
	
	Если СвойствоСсылка.Пустая() Тогда Возврат ЗначениеПоУмолчанию КонецЕсли;
	
	// Если свойство найдено, осталось только получить его значение
	СтруктураОтбора = Новый Структура("Объект,Свойство",ОбъектСсылка,СвойствоСсылка);
	ЗначениеСвойства = РегистрыСведений.ЗначенияСвойствОбъектов.Получить(СтруктураОтбора).Значение;
	ВозвратЗначениеПоУмолчанию = ?(ЗначениеПоУмолчанию = Неопределено,ПустоеЗначениеТипа(СвойствоСсылка.ТипЗначения.Типы()[0]),ЗначениеПоУмолчанию);
	
	Возврат ?(ЗначениеСвойства = Неопределено,ВозвратЗначениеПоУмолчанию,ЗначениеСвойства);
	
КонецФункции // ПолучитьЗначениеСвойства()

Функция ПустоеЗначениеТипа(ЗаданныйТип) Экспорт
	
	Если ЗаданныйТип = Тип("Число") Тогда
		Возврат 0;
		
	ИначеЕсли ЗаданныйТип = Тип("Строка") Тогда
		Возврат "";
		
	ИначеЕсли ЗаданныйТип = Тип("Дата") Тогда
		Возврат '00010101000000';
		
	ИначеЕсли ЗаданныйТип = Тип("Булево") Тогда
		Возврат Ложь;
		
	Иначе
		Возврат Новый (ЗаданныйТип);
		
	КонецЕсли;
	
КонецФункции // ПустоеЗначениеТипа();

Процедура НазначитьТип(Значение, ТипЗначения) Экспорт
	
	Если ТипЗнч(ТипЗначения.ПривестиЗначение())<>ТипЗнч(Значение) Тогда
		Значение = ТипЗначения.ПривестиЗначение();
	КонецЕсли;
	
КонецПроцедуры

Процедура Запись_ЗаказПоставщику_В_Регистр_при_проведенииОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	//ВОЗВРАТ; //Временно, пока не внедрен SAPPR
	
	КС_8 = Новый КвалификаторыСтроки(8);
	КС_10 = Новый КвалификаторыСтроки(10);
	КС_18 = Новый КвалификаторыСтроки(18);
	КС_20 = Новый КвалификаторыСтроки(20);
	Попытка
		мТипов = Новый Массив;
		мТипов.Добавить(Справочники.ТипыЗаказов.ZMP2Гарантийный);
		мТипов.Добавить(Справочники.ТипыЗаказов.ZMP2Срочный);
		мТипов.Добавить(Справочники.ТипыЗаказов.ZMP4Складской);
	Исключение
		Возврат
	КонецПопытки;

	Если мТипов.Найти(Источник.ТипЗаказа) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Менеджер = РегистрыСведений.Renault_ДопРеквизитыЗаказаПоставщику.СоздатьМенеджерЗаписи();
	Менеджер.ЗаказПоставщику = Источник.Ссылка;
	Менеджер.Прочитать();
	
	Если Менеджер.ОтправлятьВRenault  тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ЗаказПоставщикуТовары.Номенклатура.Артикул КАК Артикул,
		                      |	ЗаказПоставщикуТовары.Количество,
		                      |	ЗаказПоставщикуТовары.Коэффициент,
		                      |	ЗаказПоставщикуТовары.ПримечаниеНоменклатура,
		                      |	ЗаказПоставщикуТовары.Ссылка КАК ЗаказПоставщику,
		                      |	ЗаказПоставщикуТовары.НомерСтроки КАК ITM_NUMBER,
		                      |	Renault_ДопТабЧастиЗаказПоставщику.ВИН КАК TEXT_LINE,
		                      |	Renault_ДопРеквизитыЗаказаПоставщику.ДатаВыдачиПодменногоАвтомобиля КАК ДатаВыдачи,
		                      |	Renault_ДопРеквизитыЗаказаПоставщику.ТипЗаказаSappr,
		                      |	CRM_ДилерскиеЦентрыПодразделенияОрганизации.Ссылка КАК ДилерскийЦентр
		                      |ПОМЕСТИТЬ ВремТЗ
		                      |ИЗ
		                      |	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_ДилерскиеЦентры.ПодразделенияОрганизации КАК CRM_ДилерскиеЦентрыПодразделенияОрганизации
		                      |		ПО ЗаказПоставщикуТовары.Ссылка.ПодразделениеКомпании = CRM_ДилерскиеЦентрыПодразделенияОрганизации.Подразделение
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ДопТабЧастиЗаказПоставщику КАК Renault_ДопТабЧастиЗаказПоставщику
		                      |		ПО ЗаказПоставщикуТовары.Номенклатура = Renault_ДопТабЧастиЗаказПоставщику.Номенклатура
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КаталогРеферансов КАК Renault_КаталогРеферансов
		                      |		ПО ЗаказПоставщикуТовары.Номенклатура = Renault_КаталогРеферансов.Номенклатура
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ДопРеквизитыЗаказаПоставщику КАК Renault_ДопРеквизитыЗаказаПоставщику
		                      |		ПО ЗаказПоставщикуТовары.Ссылка = Renault_ДопРеквизитыЗаказаПоставщику.ЗаказПоставщику
		                      |ГДЕ
		                      |	ЗаказПоставщикуТовары.Ссылка = &СсылкаНаЗаказ
		                      |	И Renault_ДопТабЧастиЗаказПоставщику.ЗаказПоставщику = &СсылкаНаЗаказ
		                      |	И Renault_КаталогРеферансов.НаличиеВSAPе
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Артикул
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	SAPPR_Заказано.MATERIAL КАК MATERIAL
		                      |ПОМЕСТИТЬ НЗОтправленные
		                      |ИЗ
		                      |	РегистрСведений.SAPPR_Заказано КАК SAPPR_Заказано
		                      |ГДЕ
		                      |	SAPPR_Заказано.ЗаказПоставщику.Ссылка = &СсылкаНаЗаказ
		                      |	И SAPPR_Заказано.Отправлен = ИСТИНА
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	MATERIAL
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ВремТЗ.ЗаказПоставщику,
		                      |	ВремТЗ.ЗаказПоставщику.Организация КАК Организация,
		                      |	ВремТЗ.ITM_NUMBER,
		                      |	ВремТЗ.ТипЗаказаSappr КАК DOC_TYPE,
		                      |	ВремТЗ.ЗаказПоставщику.Номер КАК Номер,
		                      |	ВЫРАЗИТЬ("" "" КАК СТРОКА(10)) КАК PURCH_NO_C,
		                      |	ВремТЗ.Артикул КАК MATERIAL,
		                      |	ВремТЗ.Количество * ВремТЗ.Коэффициент КАК REQ_QTY,
		                      |	ВремТЗ.TEXT_LINE КАК TEXT_LINE,
		                      |	ВЫРАЗИТЬ("" "" КАК СТРОКА(20)) КАК SERIAL_NO,
		                      |	ВЫРАЗИТЬ("" "" КАК СТРОКА(10)) КАК SHIP_PART,
		                      |	ВремТЗ.ДатаВыдачи,
		                      |	ВремТЗ.ДилерскийЦентр.BIR КАК BIR
		                      |ИЗ
		                      |	ВремТЗ КАК ВремТЗ
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ НЗОтправленные КАК НЗОтправленные
		                      |		ПО ВремТЗ.Артикул = НЗОтправленные.MATERIAL
		                      |ГДЕ
		                      |	НЗОтправленные.MATERIAL ЕСТЬ NULL 
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |УНИЧТОЖИТЬ НЗОтправленные
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |УНИЧТОЖИТЬ ВремТЗ"
		);
		Запрос.УстановитьПараметр("СсылкаНаЗаказ", Источник.Ссылка);
		
		ТабРезультат = Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаТЗ из ТабРезультат Цикл
			СтрокаТЗ.SHIP_PART = ПолучитьСИТизБИР(СтрокаТЗ.BIR);
			СтрокаТЗ.PURCH_NO_C = ""+Лев(ПолучитьСИТизБИР(СтрокаТЗ.BIR),2)+ Прав(СтрокаТЗ.Номер,8);
		КонецЦикла;
		
		//%+ Изменения ДатаИзменения - 27.03.2013 10:33:33, Автор - Окипний Андрей Евгеньевич
		//<xml version="1.0" encoding="UTF-8">
		//<Автодок>
		//<Изменения ДатаИзменения="27.03.2013 10:33:33" Автор="Окипний Андрей Евгеньевич">
		//
		// <Описание>
		//  В поле SERIAL_NO попадает дата для подменного авто. её нужно "отформатить" - удалить "временную "часть
		//  Для этого пробежимся по таблице и проверим на дату.
		// </Описание>
		//
		//</Изменения>
		//</Автодок>
		//</xml>
		//%-
		//
		//Для каждого строкаТЗ  Из ТабРезультат Цикл
		//	
		//	Если ЗначениеЗаполнено(СтрокаТЗ.ДатаВыдачи) тогда
		//		
		//		СтрокаТЗ.SERIAL_NO = Формат(СтрокаТЗ.ДатаВыдачи, "ДФ=dd.MM.yyyy");
		//		
		//	КонецЕсли;
		//	
		//КонецЦикла;
		
		//создаем набор записей
		НЗ = РегистрыСведений.SAPPR_Заказано.СоздатьНаборЗаписей();
		//Устанавливаем отбор по заказу
		НЗ.Отбор.ЗаказПоставщику.Установить(Источник.Ссылка);
		НЗ.Отбор.Отправлен.Установить(Ложь);
		//Считываем
		НЗ.Прочитать();
		
		//ТабРезультат.Колонки.Добавить("SHIP_PART", Новый ОписаниеТипов("Строка",,КС_10));
		ТабРезультат.Колонки.Добавить("REQ_DATE", Новый ОписаниеТипов("Строка",,КС_8));

		//Заполняем одинаковые значения
		ТабРезультат.ЗаполнитьЗначения(Источник.Ссылка, "ЗаказПоставщику");
		ТабРезультат.ЗаполнитьЗначения(Источник.Организация, "Организация");
		Если Источник.ТипЗаказа = Справочники.ТипыЗаказов.ZMP4Складской 
			или Источник.ТипЗаказа = Справочники.ТипыЗаказов.ZMP4ПрямаяПоставка
				или Источник.ТипЗаказа = Справочники.ТипыЗаказов.ZMP9Промо Тогда
			ТабРезультат.ЗаполнитьЗначения(Формат(Источник.СрокПоставки,"ДФ=ггггММдд"), "REQ_DATE");
		КонецЕсли;
		Если Источник.ТипЗаказа = Справочники.ТипыЗаказов.ZMP2Гарантийный и ЗначениеЗаполнено(Менеджер.ДатаВыдачиПодменногоАвтомобиля) Тогда
			
			ТабРезультат.ЗаполнитьЗначения(Формат(Менеджер.ДатаВыдачиПодменногоАвтомобиля,"ДФ=ггггММдд"), "SERIAL_NO");
			
		КонецЕсли;
		
		//Получим номер Ship-to party :)
		//BIR = ПолучитьЗначениеСвойства(Источник.Организация, "BIR3M");
		//SiteNr = ПолучитьЗначениеСвойства(Источник.Организация, "BIR3M");
		
		//SHIP_PART = Строка(SiteNr) + Строка(BIR);
		//ТабРезультат.ЗаполнитьЗначения(SHIP_PART, "SHIP_PART");
		
		//Таблица готова для записи в регистр
		//Заполняем текущими данными
		НЗ.Загрузить(ТабРезультат);
		
		НЗ.Записать();
	КонецЕсли;

КонецПроцедуры

////@+ Процедура SAPPR_Запись_ЗаказПоставщику_В_Регистр_при_удаленииПроведенияОбработкаУдаленияПроведения(Источник, Отказ)
//Дата создания - 14.05.2012 16:51:17; Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Процедура производит удаление не отправленных записей из регистра сведений SAPPR_Заказано.
//
// Параметры
//  Источник  - ДокументОбъект.ЗаказПоставщику - документ, который вызвал процедуру по подписке
//
//  Отказ  - Булево - При программном установлении в Истина - выполнение процедуры прекращается.
//
//@-
Процедура SAPPR_Запись_ЗаказПоставщику_В_Регистр_при_удаленииПроведенияОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	//ВОЗВРАТ; //Временно, пока не внедрен SAPPR
	
	// Комментарий 
	//Дата создания - 14.05.2012 16:49:19; Автор - Окипний Андрей Евгеньевич
	//При отмене проведения нужно удалять строки документа, но только те, которые не отправлены.
	//
	Менеджер = РегистрыСведений.Renault_ДопРеквизитыЗаказаПоставщику.СоздатьМенеджерЗаписи();
	Менеджер.ЗаказПоставщику = Источник.Ссылка;
	Менеджер.Прочитать();
	Если Менеджер.ОтправлятьВRenault тогда
		
		//создаем набор записей
		НЗ = РегистрыСведений.SAPPR_Заказано.СоздатьНаборЗаписей();
		//Устанавливаем отбор по заказу
		НЗ.Отбор.ЗаказПоставщику.Установить(Источник.Ссылка);
		НЗ.Отбор.Отправлен.Установить(Ложь);
		
		//Считываем                            
		НЗ.Прочитать();
		НЗ.Очистить();
		НЗ.Записать();
		
	КонецЕсли;
	
КонецПроцедуры // SAPPR_Запись_ЗаказПоставщику_В_Регистр_при_удаленииПроведенияОбработкаУдаленияПроведения(Источник, Отказ)

////@+ Процедура ПодпискаНаСобытиеЗаписьНоменклатуры_TariffPRПриЗаписи(Источник, Отказ)
//Дата создания - 16.05.2012 11:22:37; Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Процедура выполняет подстановку ссылки на номенклатуру в регистр сведений Renault_TariffPR_Номенклатура
//
// Параметры
//  Источник  - СправочникЭлементОбъект - Объект элемента справочника "Номенклатура"
//
//  Отказ  - Булево - флаг отказа от выполнения
//  При установки в ИСТИНА - происходит отказ от выполнения процедуры.
//@-
Процедура ПодпискаНаСобытиеЗаписьНоменклатуры_TariffPRПриЗаписи(Источник, Отказ) Экспорт
	
	ВОЗВРАТ; //Временно, пока не внедрен TARIFPR
	
	//Для груп не выполняем
	Если Источник.ЭтоГруппа тогда возврат КонецЕсли;
	
	//Для помеченных на удаление так же не вызываем
	Если Источник.ПометкаУдаления тогда возврат КонецЕсли;
	
	//Нужно просмотреть № по каталогу (Артикул)
	//и прописать ссылку на эту работу в регистр Renault_TariffPR_Номенклатура
	Если ЗначениеЗаполнено(Источник.Артикул) тогда //№ по каталогу указан
			
			//Создаем набор записей регистра сведений, которые будем переписывать.
			НаборЗаписей = РегистрыСведений.Renault_TariffPR_Номенклатура.СоздатьНаборЗаписей();
			
			//Устанавливаем отбор и считываем
			НаборЗаписей.Отбор.Реферанс.Установить(СокрЛП(Источник.Артикул));
			НаборЗаписей.Прочитать();
			
			//Выгрузим в таблицу значений для пакетной обработки.
			ВремТЗ = НаборЗаписей.Выгрузить();
			Если ВремТЗ.Количество() > 0 тогда
				
				ВремТЗ.ЗаполнитьЗначения(Источник.Ссылка,"Номенклатура");
				
				НаборЗаписей.Загрузить(ВремТЗ);
				НаборЗаписей.Записать();
				
			КонецЕсли;
			
		КонецЕсли;

КонецПроцедуры // ПодпискаНаСобытиеЗаписьНоменклатуры_TariffPRПриЗаписи(Источник, Отказ)

////@+ Процедура OPERACODE_СопоставлениеАвтоработАвтоработыПриЗаписи(Источник, Отказ)
//Дата создания - 16.05.2012 11:28:25; Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Процедура выполняет подстановку ссылки на автоработу в регистр сведений OPERACODE_НормыРабот
//
// Параметры
//  Источник  - СправочникЭлементОбъект - Объект элемента справочника "Автоработы"
//                 <продолжение описания параметра>
//  Отказ  - Булево - флаг отказа от выполнения
//  При установки в ИСТИНА - происходит отказ от выполнения процедуры.
//@-
Процедура OPERACODE_СопоставлениеАвтоработАвтоработыПриЗаписи(Источник, Отказ) Экспорт
	
	ВОЗВРАТ; //Временно, пока не внедрен OPERCODE
	
	//Для груп не выполняем
	Если Источник.ЭтоГруппа тогда возврат КонецЕсли;
	
	//Для помеченных на удаление так же не вызываем
	Если Источник.ПометкаУдаления тогда возврат КонецЕсли;
	
	//Нужно просмотреть № по каталогу (Артикул)
	//и прописать ссылку на эту работу в регистр OPERACODE_НормыРабот
	Если ЗначениеЗаполнено(Источник.Артикул) тогда //№ по каталогу указан
			
			//Создаем набор записей регистра сведений, которые будем переписывать.
			НаборЗаписей = РегистрыСведений.OPERACODE_НормыРабот.СоздатьНаборЗаписей();
			
			//Устанавливаем отбор и считываем
			НаборЗаписей.Отбор.КодПоКаталогу.Установить(СокрЛП(Источник.Артикул));
			НаборЗаписей.Прочитать();
			
			//Выгрузим в таблицу значений для пакетной обработки.
			ВремТЗ = НаборЗаписей.Выгрузить();
			Если ВремТЗ.Количество() > 0 тогда
				ВремТЗ.ЗаполнитьЗначения(Источник.Ссылка,"Авторабота");
				
				НаборЗаписей.Загрузить(ВремТЗ);
				НаборЗаписей.Записать();
			КонецЕсли;
		КонецЕсли;

КонецПроцедуры // OPERACODE_СопоставлениеАвтоработАвтоработыПриЗаписи(Источник, Отказ)

Процедура ПолучитьТекстЗаголовкаИРасписанияРегламентнойНастройки(Задание, ТекстЗаголовка, ТекстРасписания, РассписаниеАктивно) Экспорт
	
	РассписаниеАктивно = Ложь;
	
	ТекстЗаголовка = "Дополнительные настройки расписания ...";
	
	Если Задание = Неопределено Тогда
		
		ТекстРасписания = "<Расписание не задано>";
		
	Иначе
		
		Если Задание.Использование Тогда
			ПрефиксРасписания = "Расписание: ";
			РассписаниеАктивно = Истина;
		Иначе
			ПрефиксРасписания = "Расписание (НЕ АКТИВНО): ";
		КонецЕсли;
		
		ТекстРасписания = ПрефиксРасписания + Строка(Задание.Расписание);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПредставлениеСотрудника() Экспорт
	
	Пользователь = ПараметрыСеанса.Пользователь;
	
	Если НЕ ЗначениеЗаполнено(Пользователь) тогда
		Возврат "<Текущий пользователь не определен>";
	КонецЕсли;
	
	Сотрудник = Пользователь.Сотрудник;
	
	
	Если НЕ ЗначениеЗаполнено(Сотрудник) тогда
		
		ПредставлениеСотрудника = "Пользователь <" + СокрЛП(Пользователь.Наименование) +">. Сотрудник не назначен.";
		
	Иначе
		
		ПредставлениеСотрудника = СокрЛП(Сотрудник.Наименование);
		
	КонецЕсли;
	
	Возврат ПредставлениеСотрудника;
	
КонецФункции

//////////////////////////////////////////////////////////////
//			Регламентные задания

Процедура РассылкаОповещенийККП(Парам=Неопределено) Экспорт
	
	Попытка 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	DMS_ЭтапыККПИсполнители.Сотрудник,
		|	DMS_ЭтапыККПИсполнители.Ссылка КАК ЭтапККП
		|ИЗ
		|	Справочник.DMS_ЭтапыККП.Исполнители КАК DMS_ЭтапыККПИсполнители
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка";
		
		ИсполнителиЭтаповККП = Запрос.Выполнить().Выгрузить();
		ИсполнителиЭтаповККП.Индексы.Добавить("ЭтапККП");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	DMS_КартаКачестваПоставки.Ссылка,
		|	DMS_КартаКачестваПоставки.ВыполненПриемкаАвтомобиля,
		|	DMS_КартаКачестваПоставки.ВыполненПланированиеПредпродажнойПодготовки,
		|	DMS_КартаКачестваПоставки.ВыполненПредпродажнаяПодготовка,
		|	DMS_КартаКачестваПоставки.ВыполненТоржественнаяВыдача
		|ИЗ
		|	Документ.DMS_КартаКачестваПоставки КАК DMS_КартаКачестваПоставки
		|ГДЕ
		|	DMS_КартаКачестваПоставки.ВыполненТоржественнаяВыдача = ЛОЖЬ";
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если НЕ Выборка.ВыполненПриемкаАвтомобиля Тогда
				Этап = Справочники.DMS_ЭтапыККП.ПриемкаАвтомобиля;  
			ИначеЕсли НЕ Выборка.ВыполненПланированиеПредпродажнойПодготовки Тогда
				Этап = Справочники.DMS_ЭтапыККП.ПланированиеПредпродажнойПодготовки;  
			ИначеЕсли НЕ Выборка.ВыполненПредпродажнаяПодготовка Тогда
				Этап = Справочники.DMS_ЭтапыККП.ПредпродажнаяПодготовка;  
			ИначеЕсли НЕ Выборка.ВыполненТоржественнаяВыдача Тогда
				Этап = Справочники.DMS_ЭтапыККП.ТоржественнаяВыдача;  
			Иначе
				Продолжить;
			КонецЕсли;
			
			УИД = Строка(Выборка.Ссылка.УникальныйИдентификатор());

			МассивИсполнителей = ИсполнителиЭтаповККП.НайтиСтроки(Новый Структура("ЭтапККП",Этап));
			Если МассивИсполнителей.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			//формируются оповещения о запланированных этапах ККП
			ДатаСобытия = ТекущаяДата();
			Напоминание = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
			Напоминание.Отправитель = "Система";
			Напоминание.ДатаОтправки = ДатаСобытия;
			Напоминание.Комментарий = Этап.Наименование;
			Напоминание.ВидСообщения = Справочники.Renault_ВидСообщения.НазначениеЭтапаККП;
			Напоминание.ПоказыватьС = ДатаСобытия;
			Напоминание.ПоказыватьПо = ДатаСобытия+900;
			Напоминание.Наименование = "Назначение этапа ККП";
			Напоминание.Сообщение = "Вам назначен этап ККП";
			Напоминание.ИдентификаторОбъекта = УИД;
				
			Для каждого Сотр из МассивИсполнителей Цикл
				
				//Сообщение для обработки Renault_ПанельСообщений - не используется.
				//МенеджерРС = РегистрыСведений.Renault_СообщенияСотрудникам.СоздатьМенеджерЗаписи();
				//МенеджерРС.УИД  = УИД;
				//МенеджерРС.ВидСообщения = Справочники.Renault_ВидСообщения.НазначениеЭтапаККП;
				//МенеджерРС.Получатель = Сотр.Пользователь;
				//МенеджерРС.ДатаСобытия = ДатаСобытия;
				//МенеджерРС.ТекстСообщения = "Вам назначен этап ККП: "+Этап.Наименование;
				//МенеджерРС.ВыполнитьОдному = Истина;
				//МенеджерРС.Записать();
				
				Напоминание.Адресаты.Добавить().Сотрудник = Сотр.Сотрудник;
				
			КонецЦикла;
			
			Напоминание.Записать();
				
		КонецЦикла;
		
		ЗаписьЖурналаРегистрации("Рассылка оповещений ККП",,,,"Успешно выполнена рассылка оповещений по этапам ККП");	
	Исключение
		ЗаписьЖурналаРегистрации("Рассылка оповещений ККП",,,,ОписаниеОшибки());	
	КонецПопытки

КонецПроцедуры

	
//////////////////////////////////////////////////////////////
//			Подписки на события

Функция ПолучитьBIRБазыДанных() Экспорт
	
	Возврат Константы.Renault_BIR_db.Получить();
	
КонецФункции

Функция ПолучитьBIRДилерскогоЦентра(ДилерскийЦентр) Экспорт
	
	Возврат ДилерскийЦентр.BIR;
	
КонецФункции

Процедура RenaultДействие() Экспорт
	// Вставить содержимое обработчика.
	Форм = ПолучитьОбщуюФорму("Renault_МоиНастройки");
	Форм.Открыть();
КонецПроцедуры

Процедура Renault_АвтосервисПриЗаписиЗаказНарядаПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен 
	 И Источник.ВидРемонта = Справочники.ВидыРемонта.КомплектацияАвтомобиля 
	 И Не Отказ Тогда
		
		ШапкаДокумента = Источник.ПолучитьШапкуДокумента(Источник.Ссылка);
		ВидРемонта = Источник.ВидРемонта;
		
		//Если НЕ обЗначениеНеЗаполнено(ВидРемонта) Тогда
		//	Если ВидРемонта.ТипРемонта=Перечисления.ТипыРемонта.Бесплатный И ВидРемонта<>Справочники.ВидыРемонта.КомплектацияАвтомобиля Тогда
		//		НаСебестоимость=ВидРемонта.НаСебестоимость;
		//	Иначе
		//		НаСебестоимость=Ложь;
		//	КонецЕсли;
		//Иначе
		//	НаСебестоимость=Ложь;
		//КонецЕсли;
		
		ВалютаРегл=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(); 
		СтруктураКурса = обКурсДляВалюты(ВалютаРегл,ШапкаДокумента.МоментВремени);
		КурсРегл	   = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
		ВалютаУпр=Константы.ВалютаУправленческогоУчетаКомпании.Получить(); 
		Попытка
			КурсУпр=ШапкаДокумента.КурсВалютыУпр;
		Исключение
			КурсУпр=Неопределено;
		КонецПопытки; 
		Если КурсУпр=Неопределено ИЛИ обЗначениеНеЗаполнено(КурсУпр) Тогда
			СтруктураКурса = обКурсДляВалюты(ВалютаУпр,ШапкаДокумента.МоментВремени);
			КурсУпр		   = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
		КонецЕсли;
		
		ТаблицаТовары = Источник.Товары;
		
		НаборЗаписей = РегистрыНакопления.КомплектацияАвтомобилей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Значение=ШапкаДокумента.Ссылка;
		НаборЗаписей.Отбор.Регистратор.Использование=Истина;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ОстаткиАвтомобилейОстатки.СкладКомпании КАК СкладКомпании,
		|	ОстаткиАвтомобилейОстатки.Партия КАК Партия,
		|	ОстаткиАвтомобилейОстатки.СтатусПартии КАК СтатусПартии,
		|	ОстаткиАвтомобилейОстатки.ГТД КАК ГТД
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(&НаДату, Автомобиль = &Автомобиль) КАК ОстаткиАвтомобилейОстатки
		|ГДЕ
		|	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0";
		Запрос.УстановитьПараметр("НаДату",ШапкаДокумента.МоментВремени);
		Запрос.УстановитьПараметр("Автомобиль",ШапкаДокумента.Автомобиль);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ПартияКомплектуемогоАвтомобиля=Выборка.Партия;
			СтатусПартииКомплектуемогоАвтомобиля=Выборка.СтатусПартии;
			ГТДКомплектуемогоАвтомобиля=Выборка.ГТД;
			АвтомобильСкладКомпании=Выборка.СкладКомпании;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТоварыВПроизводствеОстатки.Цех.Организация КАК Организация,
		               |	ТоварыВПроизводствеОстатки.Цех КАК Цех,
		               |	ТоварыВПроизводствеОстатки.Номенклатура КАК Номенклатура,
		               |	ТоварыВПроизводствеОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		               |	ТоварыВПроизводствеОстатки.СтатусПартии КАК СтатусПартии,
		               |	ТоварыВПроизводствеОстатки.Партия КАК Партия,
		               |	ТоварыВПроизводствеОстатки.Партия.Контрагент КАК Поставщик,
		               |	ТоварыВПроизводствеОстатки.Партия.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		               |	ТоварыВПроизводствеОстатки.ГТД КАК ГТД,
		               |	СУММА(ТоварыВПроизводствеОстатки.КоличествоОстаток) КАК Количество,
		               |	СУММА(ТоварыВПроизводствеОстатки.СуммаОстаток) КАК Сумма,
		               |	СУММА(ТоварыВПроизводствеОстатки.СуммаУпрОстаток) КАК СуммаУпр,
		               |	СУММА(ТоварыВПроизводствеОстатки.СуммаНДСОстаток) КАК СуммаНДС
		               |ИЗ
		               |	РегистрНакопления.ТоварыВПроизводстве.Остатки(, ЗаказНаряд = &ЗаказНаряд) КАК ТоварыВПроизводствеОстатки
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТоварыВПроизводствеОстатки.Цех,
		               |	ТоварыВПроизводствеОстатки.Номенклатура,
		               |	ТоварыВПроизводствеОстатки.ХарактеристикаНоменклатуры,
		               |	ТоварыВПроизводствеОстатки.СтатусПартии,
		               |	ТоварыВПроизводствеОстатки.Партия,
		               |	ТоварыВПроизводствеОстатки.Партия.Контрагент,
		               |	ТоварыВПроизводствеОстатки.Партия.ДоговорВзаиморасчетов,
		               |	ТоварыВПроизводствеОстатки.ГТД
		               |
		               |ДЛЯ ИЗМЕНЕНИЯ";
		Запрос.УстановитьПараметр("ЗаказНаряд",ШапкаДокумента.Ссылка);
		// Наложим блокировку на считываемые данные
		СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрНакопления", "ТоварыВПроизводстве");
		ЗначенияБлокировки = Новый Соответствие;
		ЗначенияБлокировки.Вставить("Период", Новый Диапазон(, ШапкаДокумента.Дата)); 
		ЗначенияБлокировки.Вставить("ЗаказНаряд", ШапкаДокумента.Ссылка); 
		обУстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки);
		тзДеталиВПроизводстве = Запрос.Выполнить().Выгрузить();
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
					 |	ЗаказНарядТовары.Номенклатура,
					 |	ЗаказНарядТовары.ХарактеристикаНоменклатуры,
					 |	ЗаказНарядТовары.СтавкаНДС,
					 |	СУММА(ЗаказНарядТовары.Количество * ЗаказНарядТовары.Коэффициент) КАК Количество,
					 |	СУММА(ЗаказНарядТовары.СуммаНДС) КАК СуммаНДС,
					 |	СУММА(ЗаказНарядТовары.СуммаСкидки + ЗаказНарядТовары.СуммаСкидкиСтроки + ЗаказНарядТовары.СуммаСкидкиБонусами) КАК СуммаСкидки,
					 |	СУММА(ЗаказНарядТовары.СуммаВсего) КАК СуммаВсего
					 |ИЗ
					 |	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
					 |ГДЕ
					 |	ЗаказНарядТовары.Ссылка = &ЗаказНаряд
					 |СГРУППИРОВАТЬ ПО
					 |	ЗаказНарядТовары.Номенклатура,
					 |	ЗаказНарядТовары.ХарактеристикаНоменклатуры,
					 |	ЗаказНарядТовары.СтавкаНДС";
		Запрос.УстановитьПараметр("ЗаказНаряд",ШапкаДокумента.Ссылка);
		тзДеталиЗаказНаряда=Запрос.Выполнить().Выгрузить();
		Сообщение="";
		Для каждого СтрокаЗаказНаряда Из тзДеталиЗаказНаряда Цикл
			
			СуммаПродажи=Окр(обПересчет(СтрокаЗаказНаряда.СуммаВсего,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаРегл,КурсРегл),2);
			СуммаПродажиУпр=Окр(обПересчет(СтрокаЗаказНаряда.СуммаВсего,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,КурсУпр),2);
			СуммаНДСПродажи=Окр(обПересчет(СтрокаЗаказНаряда.СуммаНДС,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаРегл,КурсРегл),2);
			СуммаСкидкиПродажи=Окр(обПересчет(СтрокаЗаказНаряда.СуммаСкидки,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаРегл,КурсРегл),2);
			СтрокиВПроизводстве=тзДеталиВПроизводстве.НайтиСтроки(Новый Структура("Номенклатура,ХарактеристикаНоменклатуры",СтрокаЗаказНаряда.Номенклатура,СтрокаЗаказНаряда.ХарактеристикаНоменклатуры));
			ОсталосьСписать=СтрокаЗаказНаряда.Количество; Списано=0;
			
			//Если НаСебестоимость Тогда
			//	СуммаНаСебестоимость=СуммаНаСебестоимость+СуммаПродажи;
			//	СуммаУпрНаСебестоимость=СуммаУпрНаСебестоимость+СуммаПродажиУпр;
			//	СуммаНДСНаСебестоимость=СуммаНДСНаСебестоимость+СуммаНДСПродажи;
			//КонецЕсли;
			
			Для каждого СтрокаВПроизводстве Из СтрокиВПроизводстве Цикл
				
				Списывается = Мин(ОсталосьСписать,СтрокаВПроизводстве.Количество);
				
				ОсталосьСписать=ОсталосьСписать-Списывается;
				Списано=Списано+Списывается;
				Сумма=?(СтрокаВПроизводстве.Количество=0,0,Окр((СтрокаВПроизводстве.Сумма*Списывается)/СтрокаВПроизводстве.Количество,2));
				СуммаУпр=?(СтрокаВПроизводстве.Количество=0,0,Окр((СтрокаВПроизводстве.СуммаУпр*Списывается)/СтрокаВПроизводстве.Количество,2));
				СуммаНДС=?(СтрокаВПроизводстве.Количество=0,0,Окр((СтрокаВПроизводстве.СуммаНДС*Списывается)/СтрокаВПроизводстве.Количество,2));
				
				СтрокаВПроизводстве.Количество=СтрокаВПроизводстве.Количество-Списывается;
				СтрокаВПроизводстве.Сумма=СтрокаВПроизводстве.Сумма-Сумма;
				СтрокаВПроизводстве.СуммаУпр=СтрокаВПроизводстве.СуммаУпр-СуммаУпр;
				СтрокаВПроизводстве.СуммаНДС=СтрокаВПроизводстве.СуммаНДС-СуммаНДС;
				
				Если СтрокаВПроизводстве.Количество=0 Тогда
					Сумма=Сумма+СтрокаВПроизводстве.Сумма;
					СуммаУпр=СуммаУпр+СтрокаВПроизводстве.СуммаУпр;
					СуммаНДС=СуммаНДС+СтрокаВПроизводстве.СуммаНДС;
				КонецЕсли;
				
				НоваяЗаписьКомплектацияАвтомобилей=НаборЗаписей.Добавить();
				НоваяЗаписьКомплектацияАвтомобилей.ВидДвижения=ВидДвиженияНакопления.Приход;
				НоваяЗаписьКомплектацияАвтомобилей.Период=ШапкаДокумента.Дата;
				НоваяЗаписьКомплектацияАвтомобилей.Регистратор=ШапкаДокумента.Ссылка;
				НоваяЗаписьКомплектацияАвтомобилей.Автомобиль=ШапкаДокумента.Автомобиль;
				НоваяЗаписьКомплектацияАвтомобилей.СкладКомпании=АвтомобильСкладКомпании;
				НоваяЗаписьКомплектацияАвтомобилей.Номенклатура=СтрокаВПроизводстве.Номенклатура;
				НоваяЗаписьКомплектацияАвтомобилей.ХарактеристикаНоменклатуры=СтрокаВПроизводстве.ХарактеристикаНоменклатуры;
				НоваяЗаписьКомплектацияАвтомобилей.СтатусПартии=Перечисления.СтатусыПартий.ТоварКупленный;
				НоваяЗаписьКомплектацияАвтомобилей.Партия=СтрокаВПроизводстве.Партия;
				НоваяЗаписьКомплектацияАвтомобилей.ГТД=СтрокаВПроизводстве.ГТД;
				НоваяЗаписьКомплектацияАвтомобилей.ХозОперация=ШапкаДокумента.ХозОперация;
				НоваяЗаписьКомплектацияАвтомобилей.СтавкаНДС=СтрокаЗаказНаряда.СтавкаНДС;
				НоваяЗаписьКомплектацияАвтомобилей.Количество=Списывается;
				НоваяЗаписьКомплектацияАвтомобилей.Сумма=Сумма;
				НоваяЗаписьКомплектацияАвтомобилей.СуммаНДС=СуммаНДС;
				НоваяЗаписьКомплектацияАвтомобилей.СуммаУпр=СуммаУпр;
				СуммаПродажи=(СтрокаЗаказНаряда.СуммаВсего*НоваяЗаписьКомплектацияАвтомобилей.Количество)/СтрокаЗаказНаряда.Количество;
				НоваяЗаписьКомплектацияАвтомобилей.СуммаПродажи=Окр(обПересчет(СуммаПродажи,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаРегл,КурсРегл),2);
				НоваяЗаписьКомплектацияАвтомобилей.СуммаПродажиУпр=Окр(обПересчет(СуммаПродажи,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,КурсУпр),2);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьРегистрыАвтосервиса() Экспорт
	
	ШагПланирования = 60;
	ТекВремя = ТекущаяДата();
	
	//ДЦ = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
	//АвтосервисНачалоРабочегоДня = ДЦ.АвтосервисНачалоРабочегоДня;
	//АвтосервисКонецРабочегоДня = ДЦ.АвтосервисКонецРабочегоДня;
	//НачалоРабочегоДня = НачалоДня(ТекущаяДата()) + 3600 * Час(АвтосервисНачалоРабочегоДня) + 60 * Минута(АвтосервисНачалоРабочегоДня) + Секунда(АвтосервисНачалоРабочегоДня);
	//КонецРабочегоДня = НачалоДня(ТекущаяДата()) + 3600 * Час(АвтосервисКонецРабочегоДня) + 60 * Минута(АвтосервисКонецРабочегоДня) + Секунда(АвтосервисКонецРабочегоДня);
	//НачалоРабочегоДня = НачалоДня(ТекущаяДата()) + 8*3600;
	//КонецРабочегоДня = НачалоРабочегоДня + 14*3600;
	
	//Запишем просроченные работы в регистр
	////////////////////////////////////////
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СправочникДЦ.Ссылка,
	|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(&НачалоДня, ЧАС, ЧАС(СправочникДЦ.НачалоРабочегоДня)), МИНУТА, МИНУТА(СправочникДЦ.НачалоРабочегоДня)), СЕКУНДА, СЕКУНДА(СправочникДЦ.НачалоРабочегоДня)) КАК НачалоРабочегоДня,
	|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(&НачалоДня, ЧАС, ЧАС(СправочникДЦ.КонецРабочегоДня)), МИНУТА, МИНУТА(СправочникДЦ.КонецРабочегоДня)), СЕКУНДА, СЕКУНДА(СправочникДЦ.КонецРабочегоДня)) КАК КонецРабочегоДня
	|ПОМЕСТИТЬ ТаблицаДЦ
	|ИЗ
	|	Справочник.CRM_ДилерскиеЦентры.АвтосервисГрафикРабот КАК СправочникДЦ
	|ГДЕ
	|	СправочникДЦ.ДеньНедели = &ДеньНедели
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_АвтосервисПланРабот.ДилерскийЦентр,
	|	ТаблицаДЦ.НачалоРабочегоДня КАК НачалоРабочегоДня,
	|	ТаблицаДЦ.КонецРабочегоДня КАК КонецРабочегоДня,
	|	Renault_АвтосервисПланРабот.РабочийДокумент,
	|	Renault_АвтосервисПланРабот.Цех,
	//|	Renault_АвтосервисПланРабот.Авторабота,
	|	Renault_АвтосервисПланРабот.ВремяНачала,
	|	Renault_АвтосервисПланРабот.ВремяОкончания,
	|	Renault_АвтосервисПланРабот.Длительность,
	|	Renault_АвтосервисПланРабот.ЭтапРабот,
	|	Renault_АвтосервисСтатусыРаботСрезПоследних.СтатусРаботы,
	|	Renault_АвтосервисПланРабот.Обращение
	|ИЗ
	|	РегистрСведений.Renault_АвтосервисПланРабот КАК Renault_АвтосервисПланРабот
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДЦ КАК ТаблицаДЦ
	|		ПО (ТаблицаДЦ.Ссылка = Renault_АвтосервисПланРабот.ДилерскийЦентр)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_АвтосервисСтатусыРабот.СрезПоследних КАК Renault_АвтосервисСтатусыРаботСрезПоследних
	|		ПО Renault_АвтосервисПланРабот.Цех = Renault_АвтосервисСтатусыРаботСрезПоследних.Цех
	|			И Renault_АвтосервисПланРабот.РабочийДокумент = Renault_АвтосервисСтатусыРаботСрезПоследних.РабочийДокумент
	|			И Renault_АвтосервисПланРабот.ЭтапРабот = Renault_АвтосервисСтатусыРаботСрезПоследних.ЭтапРабот
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_АвтосервисПланОперативный.СрезПоследних КАК Renault_АвтосервисПланОперативныйСрезПоследних
	|		ПО Renault_АвтосервисПланРабот.Цех = Renault_АвтосервисПланОперативныйСрезПоследних.Цех
	|			И Renault_АвтосервисПланРабот.РабочийДокумент = Renault_АвтосервисПланОперативныйСрезПоследних.РабочийДокумент
	|			И Renault_АвтосервисПланРабот.ЭтапРабот = Renault_АвтосервисПланОперативныйСрезПоследних.ЭтапРабот
	|ГДЕ
	|	ВЫБОР
	|			КОГДА Renault_АвтосервисПланОперативныйСрезПоследних.ВремяНачала ЕСТЬ NULL 
	|				ТОГДА Renault_АвтосервисПланРабот.ВремяНачала <= &ТекДата
	|			ИНАЧЕ Renault_АвтосервисПланОперативныйСрезПоследних.ВремяНачала <= &ТекДата
	|		КОНЕЦ";
				   
	Запрос.УстановитьПараметр("ТекДата", ТекВремя);
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ТекВремя));
	Запрос.УстановитьПараметр("ДеньНедели", ДеньНедели(ТекВремя));
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.СтатусРаботы = Справочники.Renault_СтатусыАвторабот.РаботаЗапланирована Тогда
			Запись = РегистрыСведений.Renault_АвтосервисСтатусыРабот.СоздатьМенеджерЗаписи();
			Запись.ДилерскийЦентр = Выборка.ДилерскийЦентр;
			Запись.РабочийДокумент = Выборка.РабочийДокумент;
			Запись.Цех = Выборка.Цех;
			Запись.ЭтапРабот = Выборка.ЭтапРабот;
			Запись.Обращение = Выборка.Обращение;
			Запись.СтатусРаботы = Справочники.Renault_СтатусыАвторабот.РаботаПросрочена;
			Запись.Период = ТекВремя;
			Запись.Записать();
		КонецЕсли;
		
		Запись = Неопределено;
		
		Если НЕ Выборка.СтатусРаботы = Справочники.Renault_СтатусыАвторабот.РаботаЗакончена
			И НЕ Выборка.СтатусРаботы = Справочники.Renault_СтатусыАвторабот.РаботаОбед
			И НЕ Выборка.СтатусРаботы = Справочники.Renault_СтатусыАвторабот.РаботаПростой Тогда
			
			Если ТекВремя > Выборка.КонецРабочегоДня
				И Выборка.СтатусРаботы = Справочники.Renault_СтатусыАвторабот.РаботаНачата Тогда
				Запись = РегистрыСведений.Renault_АвтосервисСтатусыРабот.СоздатьМенеджерЗаписи();
				Запись.ДилерскийЦентр = Выборка.ДилерскийЦентр;
				Запись.РабочийДокумент = Выборка.РабочийДокумент;
				//Запись.ДатаВремяИзменения = ТекВремя;
				Запись.Цех = Выборка.Цех;
				Запись.ЭтапРабот = Выборка.ЭтапРабот;
				Запись.Обращение = Выборка.Обращение;
				
				Если ТипЗнч(Выборка.РабочийДокумент) = Тип("ДокументСсылка.Renault_CRM_ПриемкаАвтомобиля")
					ИЛИ ТипЗнч(Выборка.РабочийДокумент) = Тип("ДокументСсылка.Renault_CRM_ВыдачаАвтомобиля") Тогда
					
					Запись.СтатусРаботы = Справочники.Renault_СтатусыАвторабот.РаботаЗакончена;
					Док = Выборка.РабочийДокумент.Ссылка.ПолучитьОбъект();
					Док.Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Выполнен;
					Док.Записать();
					
				ИначеЕсли ТипЗнч(Выборка.РабочийДокумент) = Тип("ДокументСсылка.Renault_CRM_ЗаявкаНаПодменныйАвто") Тогда
					
					Запись.СтатусРаботы = Выборка.СтатусРаботы;
					
				Иначе
					
					Запись.СтатусРаботы = Справочники.Renault_СтатусыАвторабот.РаботаПауза;
					
				КонецЕсли;	
					
				Запись.Период = ТекВремя;
				Запись.Записать();
			КонецЕсли;
			
			//получим факт
			Запрос = Новый Запрос();
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Renault_АвтосервисФактОперативный.Период,
			|	Renault_АвтосервисФактОперативный.Авторабота,
			|	Renault_АвтосервисФактОперативный.Цех,
			|	Renault_АвтосервисФактОперативный.РабочийДокумент,
			|	Renault_АвтосервисФактОперативный.ЭтапРабот,
			|	Renault_АвтосервисФактОперативный.ВремяНачала,
			|	Renault_АвтосервисФактОперативный.ВремяОкончания
			|ИЗ
			|	РегистрСведений.Renault_АвтосервисФактОперативный КАК Renault_АвтосервисФактОперативный
			|ГДЕ
			|	Renault_АвтосервисФактОперативный.РабочийДокумент = &РабочийДокумент
			|	И Renault_АвтосервисФактОперативный.Цех = &Цех
			|	И Renault_АвтосервисФактОперативный.ЭтапРабот = &ЭтапРабот";
			
			Запрос.УстановитьПараметр("РабочийДокумент", Выборка.РабочийДокумент);
			Запрос.УстановитьПараметр("Цех", Выборка.Цех);
			Запрос.УстановитьПараметр("ЭтапРабот", Выборка.ЭтапРабот);
			
			ВыборкаФакт = Запрос.Выполнить().Выбрать();
			
			Факт = 0;
			
			Пока ВыборкаФакт.Следующий() Цикл
				
				 Факт = Факт + (ВыборкаФакт.ВремяОкончания - ВыборкаФакт.ВремяНачала);
				
			КонецЦикла;
			
			НаборПлан = РегистрыСведений.Renault_АвтосервисПланОперативный.СоздатьНаборЗаписей();
			НаборПлан.Отбор.РабочийДокумент.Установить(Выборка.РабочийДокумент);
			НаборПлан.Отбор.ЭтапРабот.Установить(Выборка.ЭтапРабот);
			НаборПлан.Отбор.Цех.Установить(Выборка.Цех);
			НаборПлан.Прочитать();
			
			Если НаборПлан.Количество() <> 0 Тогда
				Запись = НаборПлан[0];
			Иначе
				Запись = НаборПлан.Добавить();
			КонецЕсли;
			Запись.ДилерскийЦентр = Выборка.ДилерскийЦентр;
			Запись.ВремяНачала = ТекВремя;
			Запись.ЭтапРабот = Выборка.ЭтапРабот;
			Запись.Цех = Выборка.Цех;
			Запись.РабочийДокумент = Выборка.РабочийДокумент;
			Запись.Обращение = Выборка.Обращение;
			
			ТекущийКонецРабочегоДня = Выборка.КонецРабочегоДня;
			ИнтервалМеждуРабочимиДнями = Выборка.НачалоРабочегоДня - Выборка.КонецРабочегоДня + 86400;
			Длительность = ((Выборка.ВремяОкончания - Выборка.ВремяНачала) - Факт);
			Пока Запись.ВремяОкончания > ТекущийКонецРабочегоДня Цикл
				Длительность = Длительность - ИнтервалМеждуРабочимиДнями;
				ТекущийКонецРабочегоДня = ТекущийКонецРабочегоДня + 86400;
			КонецЦикла;
			
			Если Длительность < 0 Тогда
				Запись.ВремяОкончания = ТекВремя + ШагПланирования;
			Иначе
				Запись.ВремяОкончания = ТекВремя + Длительность;
			КонецЕсли;
			
			Запись.Длительность = Длительность / 3600;
			
			ТекущийКонецРабочегоДня = Выборка.КонецРабочегоДня;
			ТекущееНачалоРабочегоДня = Выборка.НачалоРабочегоДня;
			ИнтервалМеждуРабочимиДнями = Выборка.НачалоРабочегоДня - Выборка.КонецРабочегоДня + 86400;
			Пока Запись.ВремяОкончания > ТекущийКонецРабочегоДня Цикл
				ПереносимаяЧасть = Запись.ВремяОкончания - ТекущийКонецРабочегоДня;
				Запись.ВремяОкончания = ТекущееНачалоРабочегоДня + 86400 + ПереносимаяЧасть;
				//Запись.Длительность = (Запись.ВремяОкончания - Запись.ВремяНачала - (Выборка.НачалоРабочегоДня - Выборка.КонецРабочегоДня + 86400)) / 3600;
				ТекущийКонецРабочегоДня = ТекущийКонецРабочегоДня + 86400;
				ТекущееНачалоРабочегоДня = ТекущееНачалоРабочегоДня + 86400;
			КонецЦикла;
			
			Запись.Период = ТекВремя;
			НаборПлан.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Неопределено;
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_АвтосервисСтатусыРаботСрезПоследних.ДилерскийЦентр,
	|	Renault_АвтосервисСтатусыРаботСрезПоследних.Период,
	|	Renault_АвтосервисСтатусыРаботСрезПоследних.Цех,
//	|	Renault_АвтосервисСтатусыРаботСрезПоследних.Авторабота,
	|	Renault_АвтосервисСтатусыРаботСрезПоследних.РабочийДокумент,
	|	Renault_АвтосервисСтатусыРаботСрезПоследних.СтатусРаботы,
	|	Renault_АвтосервисСтатусыРаботСрезПоследних.Обращение,
	|	Renault_АвтосервисСтатусыРаботСрезПоследних.ЭтапРабот,
	|	ЕСТЬNULL(Renault_АвтосервисФактОперативныйСрезПоследних.ВремяОкончания, &ПустаяДата) КАК ВремяОкончания
	|ИЗ
	|	РегистрСведений.Renault_АвтосервисСтатусыРабот.СрезПоследних КАК Renault_АвтосервисСтатусыРаботСрезПоследних
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_АвтосервисФактОперативный.СрезПоследних КАК Renault_АвтосервисФактОперативныйСрезПоследних
	|	ПО Renault_АвтосервисФактОперативныйСрезПоследних.РабочийДокумент = Renault_АвтосервисСтатусыРаботСрезПоследних.РабочийДокумент
	|	И Renault_АвтосервисФактОперативныйСрезПоследних.ЭтапРабот = Renault_АвтосервисСтатусыРаботСрезПоследних.ЭтапРабот
	|ГДЕ
	|	Renault_АвтосервисСтатусыРаботСрезПоследних.СтатусРаботы = &СтатусРаботы";
				   
	Запрос.УстановитьПараметр("СтатусРаботы", Справочники.Renault_СтатусыАвторабот.РаботаНачата);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Макс(Выборка.ВремяОкончания, ТекВремя) - Мин(Выборка.ВремяОкончания, ТекВремя) < ШагПланирования Тогда
			Набор = РегистрыСведений.Renault_АвтосервисФактОперативный.СоздатьНаборЗаписей();
			Набор.Отбор.Обращение.Установить(Выборка.Обращение);
			Набор.Отбор.РабочийДокумент.Установить(Выборка.РабочийДокумент);
			Набор.Отбор.Цех.Установить(Выборка.Цех);
			Набор.Отбор.ЭтапРабот.Установить(Выборка.ЭтапРабот);
			Набор.Прочитать();
			Для Каждого Запись ИЗ Набор Цикл
				Если Запись.ВремяОкончания = Выборка.ВремяОкончания Тогда
					Запись.Период = ТекВремя;
					Запись.ВремяОкончания = ТекВремя + ШагПланирования;
				КонецЕсли;
			КонецЦикла;
			Набор.Записать();
		Иначе
			Запись = РегистрыСведений.Renault_АвтосервисФактОперативный.СоздатьМенеджерЗаписи();
			Запись.ДилерскийЦентр = Выборка.ДилерскийЦентр;
			Запись.РабочийДокумент = Выборка.РабочийДокумент;
			Запись.Цех = Выборка.Цех;
			Запись.ВремяНачала = ТекВремя;
			Запись.Период = ТекВремя;
			Запись.ВремяОкончания = ТекВремя + ШагПланирования;
			Запись.ЭтапРабот = Выборка.ЭтапРабот;
			Запись.Обращение = Выборка.Обращение;
			Запись.Записать();
		КонецЕсли;
		
	КонецЦикла;

	
КонецПроцедуры

Процедура Renault_СобытияОбработкаПроведенияЗаказНарядаОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	ТекущийДЦ = Renault_РаботаСПравамиПользователя.ДилерскийЦентрПоУмолчанию(ПараметрыСеанса.Пользователь);
	
	ВалютаРегл = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	СтруктураКурса = обКурсДляВалюты(ВалютаРегл, Источник.Дата);
	КурсРегл = СтруктураКурса.Курс/?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	ВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	Если Источник.КурсВалютыУпр = 0 Тогда
		СтруктураКурса = обКурсДляВалюты(ВалютаУпр, Источник.Дата);
		КурсУпр = СтруктураКурса.Курс/?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	Иначе
		КурсУпр = Источник.КурсВалютыУпр;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийДЦ) Тогда
		
		ВидРемонта = Источник.ВидРемонта;
		СостояниеЗН = Источник.Состояние;
		Отбор = Новый Структура;
		Отбор.Вставить("ВидРемонта", ВидРемонта);
		Отбор.Вставить("СостояниеЗН", СостояниеЗН);
		
		МассивСтрок = ТекущийДЦ.АвтосервисНастройкиЗаписиЗН.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() > 0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТоварыВПроизводствеОстатки.Цех.Организация КАК Организация,
			|	ТоварыВПроизводствеОстатки.Цех КАК Цех,
			|	ТоварыВПроизводствеОстатки.Номенклатура КАК Номенклатура,
			|	ТоварыВПроизводствеОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ТоварыВПроизводствеОстатки.СтатусПартии КАК СтатусПартии,
			|	ТоварыВПроизводствеОстатки.Партия КАК Партия,
			|	ТоварыВПроизводствеОстатки.Партия.Контрагент КАК Поставщик,
			|	ТоварыВПроизводствеОстатки.Партия.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
			|	ТоварыВПроизводствеОстатки.ГТД КАК ГТД,
			|	СУММА(ТоварыВПроизводствеОстатки.КоличествоОстаток) КАК Количество,
			|	СУММА(ТоварыВПроизводствеОстатки.СуммаОстаток) КАК Сумма,
			|	СУММА(ТоварыВПроизводствеОстатки.СуммаУпрОстаток) КАК СуммаУпр,
			|	СУММА(ТоварыВПроизводствеОстатки.СуммаНДСОстаток) КАК СуммаНДС
			|ИЗ
			|	РегистрНакопления.ТоварыВПроизводстве.Остатки(, ЗаказНаряд = &ЗаказНаряд) КАК ТоварыВПроизводствеОстатки
			|
			|СГРУППИРОВАТЬ ПО
			|	ТоварыВПроизводствеОстатки.Цех,
			|	ТоварыВПроизводствеОстатки.Номенклатура,
			|	ТоварыВПроизводствеОстатки.ХарактеристикаНоменклатуры,
			|	ТоварыВПроизводствеОстатки.СтатусПартии,
			|	ТоварыВПроизводствеОстатки.Партия,
			|	ТоварыВПроизводствеОстатки.Партия.Контрагент,
			|	ТоварыВПроизводствеОстатки.Партия.ДоговорВзаиморасчетов,
			|	ТоварыВПроизводствеОстатки.ГТД,
			|	ТоварыВПроизводствеОстатки.Цех.Организация
			|
			|ДЛЯ ИЗМЕНЕНИЯ";
			Запрос.УстановитьПараметр("ЗаказНаряд", Источник.Ссылка);
			тзДеталиВПроизводстве = Запрос.Выполнить().Выгрузить();
			
			Набор = РегистрыНакопления.КомплектацияАвтомобилей.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Значение = Источник.Ссылка;
			Набор.Отбор.Регистратор.Использование = Истина;
			Набор.Очистить();
			
			Для Каждого СтрокаТовара ИЗ Источник.Товары Цикл
				ОсталосьСписать = СтрокаТовара.Количество;
				СтрокиВПроизводстве = тзДеталиВПроизводстве.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", СтрокаТовара.Номенклатура, СтрокаТовара.ХарактеристикаНоменклатуры));
				Для Каждого СтрокаВПроизводстве ИЗ СтрокиВПроизводстве Цикл
					Списывается = Мин(ОсталосьСписать, СтрокаВПроизводстве.Количество);
					НоваяЗаписьКомплектацияАвтомобилей = Набор.Добавить();
					НоваяЗаписьКомплектацияАвтомобилей.ВидДвижения = ВидДвиженияНакопления.Приход;
					НоваяЗаписьКомплектацияАвтомобилей.Период = Источник.Дата;
					НоваяЗаписьКомплектацияАвтомобилей.Регистратор = Источник.Ссылка;
					НоваяЗаписьКомплектацияАвтомобилей.Автомобиль = Источник.Автомобиль;
					НоваяЗаписьКомплектацияАвтомобилей.СкладКомпании = СтрокаТовара.СкладКомпании;
					НоваяЗаписьКомплектацияАвтомобилей.Номенклатура = СтрокаВПроизводстве.Номенклатура;
					НоваяЗаписьКомплектацияАвтомобилей.ХарактеристикаНоменклатуры = СтрокаВПроизводстве.ХарактеристикаНоменклатуры;
					НоваяЗаписьКомплектацияАвтомобилей.СтатусПартии = Перечисления.СтатусыПартий.ТоварКупленный;
					НоваяЗаписьКомплектацияАвтомобилей.Партия = СтрокаВПроизводстве.Партия;
					НоваяЗаписьКомплектацияАвтомобилей.ГТД = СтрокаВПроизводстве.ГТД;
					НоваяЗаписьКомплектацияАвтомобилей.ХозОперация = Источник.ХозОперация;
					НоваяЗаписьКомплектацияАвтомобилей.СтавкаНДС = СтрокаТовара.СтавкаНДС;
					НоваяЗаписьКомплектацияАвтомобилей.Количество = СтрокаВПроизводстве.Количество;
					НоваяЗаписьКомплектацияАвтомобилей.Сумма = ?(СтрокаВПроизводстве.Количество = 0, 0, Окр((СтрокаВПроизводстве.Сумма*Списывается)/СтрокаВПроизводстве.Количество, 2));
					НоваяЗаписьКомплектацияАвтомобилей.СуммаНДС = ?(СтрокаВПроизводстве.Количество = 0, 0, Окр((СтрокаВПроизводстве.СуммаНДС*Списывается)/СтрокаВПроизводстве.Количество, 2));
					НоваяЗаписьКомплектацияАвтомобилей.СуммаУпр = ?(СтрокаВПроизводстве.Количество = 0, 0, Окр((СтрокаВПроизводстве.СуммаУпр*Списывается)/СтрокаВПроизводстве.Количество, 2));
					СуммаПродажи = (СтрокаТовара.СуммаВсего*НоваяЗаписьКомплектацияАвтомобилей.Количество)/СтрокаВПроизводстве.Количество;
					НоваяЗаписьКомплектацияАвтомобилей.СуммаПродажи = Окр(обПересчет(СуммаПродажи, Источник.ВалютаДокумента, Источник.КурсДокумента, ВалютаРегл, КурсРегл), 2);
					НоваяЗаписьКомплектацияАвтомобилей.СуммаПродажиУпр = Окр(обПересчет(СуммаПродажи, Источник.ВалютаДокумента, Источник.КурсДокумента, ВалютаУпр, КурсУпр), 2);
				КонецЦикла;
			КонецЦикла;
			
			Набор.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура Renault_СобытиеОбработкаПроведенияЗаказПоставщикуПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	//ВОЗВРАТ; //Временно, пока не внедрен SAPPR
	
	Если Источник.ДополнительныеСвойства.Свойство("ЗагрузкаСтатуса") 
		или не ЗначениеЗаполнено(Источник.Ссылка) Тогда
			Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	SAPPR_Заказано.Отправлен
	|ИЗ
	|	РегистрСведений.SAPPR_Заказано КАК SAPPR_Заказано
	|ГДЕ
	|	SAPPR_Заказано.ЗаказПоставщику = &ЗаказПоставщику
	|	И SAPPR_Заказано.Отправлен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Renault_ИсторияВыгрузкиЗаказов.ВОбработке
	|ИЗ
	|	РегистрСведений.Renault_ИсторияВыгрузкиЗаказов КАК Renault_ИсторияВыгрузкиЗаказов
	|ГДЕ
	|	Renault_ИсторияВыгрузкиЗаказов.ЗаказПоставщику = &ЗаказПоставщику
	|	И Renault_ИсторияВыгрузкиЗаказов.Отправлено";
	Запрос.УстановитьПараметр("ЗаказПоставщику", Источник.Ссылка);
	Результат = Запрос.Выполнить();
	Если не Результат.Пустой() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_КаталогРеферансов.Номенклатура
		|ИЗ
		|	РегистрСведений.Renault_КаталогРеферансов КАК Renault_КаталогРеферансов
		|ГДЕ
		|	НЕ Renault_КаталогРеферансов.НаличиеВSAPе
		|	И Renault_КаталогРеферансов.Номенклатура В(&Номенклатура)";
		Запрос.УстановитьПараметр("Номенклатура", Источник.Товары.ВыгрузитьКолонку("Номенклатура"));
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат;
		КонецЕсли; 
		
		Выборка = Результат.Выбрать();
		Если Выборка.Количество() = Источник.Товары.Количество() Тогда
			Менеджер = РегистрыСведений.Renault_ДопРеквизитыЗаказаПоставщику.СоздатьМенеджерЗаписи();
			Менеджер.ЗаказПоставщику = Источник.Ссылка;
			Менеджер.Прочитать();
			Если Менеджер.ОтправлятьВRenault Тогда
				Набор = РегистрыСведений.Renault_ДопТабЧастиЗаказПоставщику.СоздатьНаборЗаписей();
				Набор.Отбор.ЗаказПоставщику.Установить(Источник.Ссылка);
				Набор.Прочитать();
				ТаблицаRenault = Набор.Выгрузить();
				Для Каждого СтрокаТЧ из ТаблицаRenault Цикл
					Если Не ЗначениеЗаполнено(СтрокаТЧ.ВИН) Тогда
						Отказ = Истина;
						#Если Клиент тогда
							Предупреждение("Поля VIN обязательны для заполнения",,"Ошибка");
						#КонецЕсли
						Возврат;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Возврат;
		КонецЕсли;
		
		Форма = Обработки.Renault_ARM_Запчасти.ПолучитьФорму("ФормаРедНоменклатуры");
		Пока Выборка.Следующий() Цикл
			Набор = РегистрыСведений.Renault_ДопТабЧастиЗаказПоставщику.СоздатьНаборЗаписей();
			Набор.Отбор.ЗаказПоставщику.Установить(Источник.Ссылка);
			Набор.Прочитать();
			ТаблицаRenault = Набор.Выгрузить();
			СтрокаДопТаб = ТаблицаRenault.Найти(Выборка.Номенклатура,"Номенклатура");
			СтрокаТЧ = Форма.Таблица.Добавить();
			СтрокаТЧ.Номенклатура = Выборка.Номенклатура;
			Если СтрокаДопТаб <> Неопределено Тогда
				СтрокаТЧ.ВИН = СтрокаДопТаб.ВИН;
				СтрокаТЧ.Автомобиль = СтрокаДопТаб.Автомобиль;
				СтрокаТЧ.Комментарий = СтрокаДопТаб.Комментарий;
			КонецЕсли;
		КонецЦикла;
		Ответ = Форма.ОткрытьМодально();
		Попытка
			Таблица = ДанныеФормыВЗначение(Ответ,Тип("ТаблицаЗначений"));
			Ответ = Истина;
		Исключение
			Отказ = Истина;
			Ответ = Ложь;
		КонецПопытки;
		Если Ответ Тогда
			ДокументОбъект = Источник.Скопировать();
			ДокументОбъект.Товары.Очистить();
			Для Каждого СтрокаТЗ Из Таблица Цикл
				НайденаяСтрока = Источник.Товары.Найти(СтрокаТЗ.Номенклатура,"Номенклатура");
				СтрокаТЧ = ДокументОбъект.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, НайденаяСтрока);
				Источник.Товары.Удалить(НайденаяСтрока);
				//Набор = РегистрыСведений.Renault_ДопТабЧастиЗаказПоставщику.СоздатьНаборЗаписей();
				//Набор.Отбор.ЗаказПоставщику.Установить(Источник.Ссылка);
				//Набор.Отбор.Номенклатура.Установить(СтрокаТЗ.Номенклатура);   
				//Набор.Записать();
				
				//СтрокаТЧ = ДокументОбъект.ТаблицаRenault.Добавить();
				//ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаТЗ);
				
				//СтрокаТабРено = Источник.ТаблицаRenault.Найти(СтрокаТЗ.Номенклатура,"Номенклатура");
				//Источник.ТаблицаRenault.Удалить(СтрокаТабРено);
			КонецЦикла;
			ДокументОбъект.Дата = Источник.Дата;
			ДокументОбъект.УстановитьНовыйНомер();
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Менеджер = РегистрыСведений.Renault_ДопРеквизитыЗаказаПоставщику.СоздатьМенеджерЗаписи();
			Менеджер.ЗаказПоставщику = ДокументОбъект.Ссылка;
			Менеджер.Прочитать();
			Менеджер.ЗаказПоставщику = ДокументОбъект.Ссылка;
			Менеджер.ТипЗаказаSappr = Перечисления.SAPPR_ВидЗаказаПоставщику[Лев(Справочники.ТипыЗаказов.ПолучитьИмяПредопределенного(ДокументОбъект.ТипЗаказа),4)];
			Менеджер.Записать();
			#Если Клиент тогда
				Предупреждение("Создан документ №"+ДокументОбъект.Номер+ " от " + ДокументОбъект.Дата+" с реферансами, недоступными для заказа в SAP. Для отправки заказа подтвердите его!",,"Предупреждение");
				ФормаДокумента = ПолучитьОбщуюФорму("Renault_ФормаДокументаЗаказПоставшику");
				ФормаДокумента.ДокументОбъект = ДокументОбъект;
				ФормаДокумента.ЭлементыФормы.ТипЗаказа.ТолькоПросмотр = Истина;
				ФормаДокумента.УчитыватьКратность = Истина;
				ФормаДокумента.ЭлементыФормы.Контрагент.ТолькоПросмотр = Истина;
				ФормаДокумента.ЭлементыФормы.КоманднаяПанельТовары.Кнопки.Renault.Доступность = Истина;
				ФормаДокумента.Открыть();
			#КонецЕсли
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСИТизБИР (БИРПолный) Экспорт
	Если СтрДлина(СокрЛП(БИРПолный)) = 12 Тогда
		Возврат ""+ Прав(БИРПолный,2) + Лев(БИРПолный, 8);
	КонецЕсли;
	Возврат "";
КонецФункции

Процедура Renault_ПоступлениеАвтомобилейВводСобытияОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	ОсновныяНастройка = Справочники.Renault_ОбщиеНастройкиБазыДанных.ЭтаБаза;
	Если ОсновныяНастройка.ИспользоватьМодифицированныйФункционалВыдачи Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ЗаконтрактованныеАвтомобилиСрезПоследних.Автомобиль,
		|	Renault_ЗаконтрактованныеАвтомобилиСрезПоследних.РабочийЛист,
		|	Renault_ЗаконтрактованныеАвтомобилиСрезПоследних.Клиент,
		|	Renault_ЗаконтрактованныеАвтомобилиСрезПоследних.Менеджер,
		|	Renault_РабочиеЛисты.Отдел,
		|	Renault_РабочиеЛисты.ДилерскийЦентр,
		|	Renault_ЗаконтрактованныеАвтомобилиСрезПоследних.VIN,
		|	CRM_СобытияПоРабочимЛистам.Ссылка КАК СобытиеСогласование
		|ИЗ
		|	РегистрСведений.Renault_ЗаконтрактованныеАвтомобили.СрезПоследних КАК Renault_ЗаконтрактованныеАвтомобилиСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
		|		ПО Renault_ЗаконтрактованныеАвтомобилиСрезПоследних.РабочийЛист = Renault_РабочиеЛисты.IDK
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
		|		ПО (CRM_СобытияПоРабочимЛистам.IDK = Renault_ЗаконтрактованныеАвтомобилиСрезПоследних.РабочийЛист)
		|			И ((CRM_СобытияПоРабочимЛистам.Комментарий ПОДОБНО &КомментарийСогласование)
		|				ИЛИ (CRM_СобытияПоРабочимЛистам.ВидСобытия = &ВидСобытия))
		|ГДЕ
		|	Renault_ЗаконтрактованныеАвтомобилиСрезПоследних.Автомобиль В(&Автомобили)
		|	И Renault_ЗаконтрактованныеАвтомобилиСрезПоследних.ДатаСнятияРезерва = ДАТАВРЕМЯ(1, 1, 1)";
		Запрос.УстановитьПараметр("Автомобили", Источник.Автомобили.ВыгрузитьКолонку("Автомобиль"));
		Запрос.УстановитьПараметр("КомментарийСогласование", "Согласовать дату выдачи автомобиля%");
		Запрос.УстановитьПараметр("ВидСобытия", Справочники.CRM_ВидыСобытий.Выдача);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.СобытиеСогласование) Тогда
				Продолжить;
			КонецЕсли;
			ДокСобытие = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
			ДокСобытие.IDK = Выборка.РабочийЛист;
			ДокСобытие.Автор = ПараметрыСеанса.Пользователь.Сотрудник;
			ДокСобытие.Сотрудник = Выборка.Менеджер;
			ДокСобытие.ВидСобытия = Справочники.CRM_ВидыСобытий.Прозвон;
			ДокСобытие.Дата = ТекущаяДата();
			ДокСобытие.ДатаНапоминания = ТекущаяДата();
			ДокСобытие.ДилерскийЦентр = Выборка.ДилерскийЦентр;
			ДокСобытие.Комментарий = "Согласовать дату выдачи автомобиля " + Выборка.Автомобиль + " VIN " + Выборка.VIN;
			ДокСобытие.Отдел = Выборка.Отдел;
			ДокСобытие.Подразделение = ?(ТипЗнч(Выборка.Менеджер)= Тип("Строка"),Справочники.ПодразделенияКомпании.ПустаяСсылка(),Выборка.Менеджер.Подразделение);
			ДокСобытие.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;
	КонецЕсли;
	
	//+++ DMS
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Автомобили.Автомобиль,
		|	Автомобили.VIN
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.ПоступлениеАвтомобилей.Автомобили КАК Автомобили
		|ГДЕ
		|	Автомобили.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Renault_Договор.РабочийЛист,
		|	Renault_Договор.VIN,
		|	ВТ.Автомобиль,
		|	Renault_РабочиеЛисты.Сотрудник,
		|	Renault_РабочиеЛисты.Отдел,
		|	Renault_РабочиеЛисты.ДилерскийЦентр,
		|	Renault_РабочиеЛисты.Подразделение
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_Договор КАК Renault_Договор
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_СообщенияПользователю КАК Renault_СообщенияПользователю
		|			ПО Renault_Договор.VIN = Renault_СообщенияПользователю.ИдентификаторОбъекта
		|				И (Renault_СообщенияПользователю.ВидСообщения = ЗНАЧЕНИЕ(Справочник.Renault_ВидСообщения.Автосклад_АвтомобильПоступилНаСкладДилера))
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
		|			ПО Renault_Договор.РабочийЛист = Renault_РабочиеЛисты.IDK
		|		ПО ВТ.VIN = Renault_Договор.VIN
		|ГДЕ
		|	НЕ Renault_Договор.Ссылка ЕСТЬ NULL 
		|	И НЕ Renault_РабочиеЛисты.Сотрудник ЕСТЬ NULL 
		|	И Renault_СообщенияПользователю.Ссылка ЕСТЬ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	Renault_Договор.VIN,
		|	ВТ.Автомобиль,
		|	Renault_Договор.РабочийЛист,
		|	Renault_РабочиеЛисты.Сотрудник,
		|	Renault_РабочиеЛисты.Отдел,
		|	Renault_РабочиеЛисты.ДилерскийЦентр,
		|	Renault_РабочиеЛисты.Подразделение";
		
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() тогда
		ТекСотрудник = ПараметрыСеанса.Пользователь.Сотрудник;
		ДатаСобытия = ТекущаяДата();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Комментарий = "Согласовать дату выдачи автомобиля " + Выборка.Автомобиль;
			//СобытиеОбъект = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
			//СобытиеОбъект.IDK = Выборка.РабочийЛист;
			//СобытиеОбъект.Дата = ДатаСобытия;
			//СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.Прозвон;
			//СобытиеОбъект.Сотрудник = Выборка.Сотрудник;
			//СобытиеОбъект.Автор = ТекСотрудник;
			//СобытиеОбъект.Отдел = Выборка.Отдел;
			//СобытиеОбъект.ДилерскийЦентр = Выборка.ДилерскийЦентр;
			//СобытиеОбъект.Подразделение = Выборка.Подразделение;
			//СобытиеОбъект.Комментарий = Комментарий;
			//СобытиеОбъект.ДатаНапоминания = ДатаСобытия;
			//СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			Напоминание = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
			Напоминание.Отправитель = ТекСотрудник;
			Напоминание.Адресаты.Добавить().Сотрудник = Выборка.Сотрудник;
			Напоминание.ДатаОтправки = ДатаСобытия;
			Напоминание.Комментарий = Комментарий;
			Напоминание.ВидСообщения = Справочники.Renault_ВидСообщения.Автосклад_АвтомобильПоступилНаСкладДилера;
			Напоминание.ПоказыватьС = ДатаСобытия;
			Напоминание.Наименование = Формат(Строка(Выборка.РабочийЛист),"ЧГ=");
			Напоминание.Сообщение = "Автомобиль поступил на склад";
			Напоминание.ИдентификаторОбъекта = Выборка.VIN;
			Напоминание.Записать();
			
		КонецЦикла;
		
	КонецЕсли;
	//--- DMS
	
	//v+
	Если НЕ Отказ Тогда
		//Для Каждого Стр Из Источник.Автомобили Цикл
		//	Движение=Источник.Движения.ЦеныАвтомобилей.Добавить();
		//	Движение.Период=Источник.Дата;
		//	Движение.ТипЦен=Справочники.ТипыЦен.ОсновнойТипЦенЗакупки;
		//	Движение.Автомобиль=Стр.Автомобиль;
		//	Движение.Цена=Стр.СуммаВсего;
		//КонецЦикла;	
	КонецЕсли;	
	//v-
	
КонецПроцедуры

Процедура ВыгрузкаОстаткаРеноПартс(СтруктураПараметров = Неопределено) Экспорт
	
	Обработка = Обработки.Renault_ВыгрузкаОстаткаРеноПартс.Создать();
	Обработка.ВыполнитьВыгрузку();
	
КонецПроцедуры

Процедура Renault_РеализацияТоваровОбработкаПроведенияОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт

    Если ЗначениеЗаполнено(Источник.ДокументОснование) и ТипЗнч(Источник.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда

        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ
        |	Renault_ЗаказЗапчастейПокупателя.ЗаказПокупателя
        |ИЗ
        |	Документ.Renault_ЗаказЗапчастейПокупателя КАК Renault_ЗаказЗапчастейПокупателя
        |ГДЕ
        |	Renault_ЗаказЗапчастейПокупателя.ЗаказПокупателя = &ЗаказПокупателя";
        Запрос.УстановитьПараметр("ЗаказПокупателя", Источник.ДокументОснование);

        Результат = Запрос.Выполнить();

        Если Результат.Пустой() Тогда
            Возврат;
        КонецЕсли;

        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ
        |	ЗаказыПокупателейОбороты.Номенклатура,
        |	ЗаказыПокупателейОбороты.ЗаказаноПриход,
        |	РеализацияТоваровТовары.Количество
        |ИЗ
        |	РегистрНакопления.ЗаказыПокупателей.Обороты КАК ЗаказыПокупателейОбороты
        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
        |		ПО ЗаказыПокупателейОбороты.Номенклатура = РеализацияТоваровТовары.Номенклатура
        |ГДЕ
        |	ЗаказыПокупателейОбороты.Заказ = &Заказ
        |	И РеализацияТоваровТовары.Ссылка = &Ссылка";
        Запрос.УстановитьПараметр("Заказ", Источник.ДокументОснование);
        Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);

        Движения = Источник.Движения.Renault_РеализацияПоЗаказам;
        Движения.Записывать = Истина;

        Выборка = Запрос.Выполнить().Выбрать();
        Пока Выборка.Следующий() Цикл

            СтрокаДвижений = Движения.Добавить(); 
            СтрокаДвижений.Период = Источник.Дата;
            СтрокаДвижений.Заказ = Источник.ДокументОснование;
            СтрокаДвижений.Номенклатура = Выборка.Номенклатура;
            СтрокаДвижений.Количество = Выборка.Количество;

        КонецЦикла;

    КонецЕсли;

КонецПроцедуры

Процедура Renault_ПеремещениеАвтомобилейОбработкаПроведенияОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ИспользоватьПродвинутыйМеханизмПеремещений Тогда
	
		СкладЭвакуатор = Константы.Renault_СкладЭвакуатор.Получить();
		
		Если НЕ Отказ Тогда
			
			Если Источник.СкладКомпании.Renault_Территория = Источник.СкладПолучатель.Renault_Территория Тогда
				
				ОстаткиАвтомобилей = ПолучитьТаблицуОстаткиАвтомобилей(Источник);
				
				Источник.Движения.ОстаткиАвтомобилей.Прочитать();
				Источник.Движения.ОстаткиАвтомобилей.Загрузить(ОстаткиАвтомобилей);
				Источник.Движения.ОстаткиАвтомобилей.Записать();
				//ЗанятьМестаАвтомобилей(Источник);
			Иначе
				
				Если СкладЭвакуатор.Пустая() Тогда
					Сообщить("Склад-эвакуатор не выбран!", СтатусСообщения.Важное);
					Отказ = Истина;
				КонецЕсли;
				
				Если Не Отказ Тогда
					
					Если Источник.DMS_Статус = Перечисления.Renault_СтатусыЗаявкиНаПеремещение.ВПути Тогда
						
						Источник.Движения.ОстаткиАвтомобилей.Очистить();
						Источник.Движения.ОстаткиАвтомобилей.Записать();
						
						ОстаткиАвтомобилей = ПолучитьТаблицуОстаткиАвтомобилейСписание(СкладЭвакуатор, Источник);
						
						Источник.Движения.ОстаткиАвтомобилей.Прочитать();
						Источник.Движения.ОстаткиАвтомобилей.Загрузить(ОстаткиАвтомобилей);
						Источник.Движения.ОстаткиАвтомобилей.Записать();
						
						Если НЕ РегистрыСведений.Renault_РазмещениеАвтомобилей.ОсвободитьПарковочноеМесто(Источник.Автомобили.ВыгрузитьКолонку("Автомобиль")) Тогда
							Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось очистить парковочные места автомобилей. Документ:" + Источник.Ссылка, Неопределено, "", Отказ);
							Возврат;
						КонецЕсли;
						
					ИначеЕсли Источник.DMS_Статус = Перечисления.Renault_СтатусыЗаявкиНаПеремещение.Закрыто Тогда
						
						Источник.Движения.ОстаткиАвтомобилей.Очистить();
						Источник.Движения.ОстаткиАвтомобилей.Записать();
						
						ОстаткиАвтомобилей = ПолучитьТаблицуОстаткиАвтомобилейСписание(СкладЭвакуатор, Источник);
						
						Источник.Движения.ОстаткиАвтомобилей.Прочитать();
						Источник.Движения.ОстаткиАвтомобилей.Загрузить(ОстаткиАвтомобилей);

						Источник.Движения.ОстаткиАвтомобилей.Записать();
						
						ОстаткиАвтомобилей = ПолучитьТаблицуОстаткиАвтомобилейПоступление(СкладЭвакуатор, Источник);						
						
						Для Каждого Строка Из ОстаткиАвтомобилей Цикл
							НоваяСтрока = Источник.Движения.ОстаткиАвтомобилей.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
							НоваяСтрока.Период = ТекущаяДата();
						КонецЦикла;	
						
						Источник.Движения.ОстаткиАвтомобилей.Записать();
						ЗанятьМестаАвтомобилей(Источник);
						ЗаписатьНачисленияВодителям(Источник);
						
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
			Если Не Отказ Тогда
				ЗаписатьОтметкиВПланПеремещений(Источник);			
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьТаблицуОстаткиАвтомобилейПоступление(СкладЭвакуатор, Источник)
	
	ОбщийЗапрос = Новый Запрос;
	
	ОбщийЗапрос.Текст = 
	"ВЫБРАТЬ
	|	ТабЧастьАвтомобили.Автомобиль КАК Автомобиль,
	|	ТабЧастьАвтомобили.Ссылка.Ссылка КАК Ссылка,
	|	ТабЧастьАвтомобили.Ссылка.ДатаОперации КАК ДатаОперации,
	|	ТабЧастьАвтомобили.Ссылка.СкладКомпании КАК СкладИз1,
	|	&СкладВ КАК СкладВ,
	|	&СкладИЗ КАК СкладИз
	|ПОМЕСТИТЬ ВТ_ТабЧасть
	|ИЗ
	|	Документ.ПеремещениеАвтомобилей.Автомобили КАК ТабЧастьАвтомобили
	|ГДЕ
	|	ТабЧастьАвтомобили.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АвтоНаСкладахОстатки.Автомобиль КАК Автомобиль,
	|	АвтоНаСкладахОстатки.СкладКомпании КАК СкладКомпании,
	|	АвтоНаСкладахОстатки.Партия КАК Партия,
	|	АвтоНаСкладахОстатки.КоличествоОстаток КАК Количество,
	|	АвтоНаСкладахОстатки.СтатусПартии КАК СтатусПартии,
	|	АвтоНаСкладахОстатки.СуммаОстаток КАК Сумма,
	|	АвтоНаСкладахОстатки.СуммаУпрОстаток КАК СуммаУпр,
	|	АвтоНаСкладахОстатки.СуммаНДСОстаток КАК СуммаНДС,
	|	АвтоНаСкладахОстатки.ГТД КАК ГТД
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(
	|			&ДатаОперации,
	|			СкладКомпании = &СкладИЗ
	|				И Автомобиль В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Табл.Автомобиль
	|					ИЗ
	|						ВТ_ТабЧасть КАК Табл)) КАК АвтоНаСкладахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТабЧасть.Ссылка КАК Регистратор,
	|	ВТ_ТабЧасть.ДатаОперации КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВТ_Остатки.Автомобиль КАК Автомобиль,
	|	ВТ_Остатки.СкладКомпании КАК СкладКомпании,
	|	ВТ_Остатки.Партия КАК Партия,
	|	ВТ_Остатки.Количество КАК Количество,
	|	ВТ_Остатки.СтатусПартии КАК СтатусПартии,
	|	&ХозОперация КАК ХозОперация,
	|	ВТ_Остатки.Сумма КАК Сумма,
	|	ВТ_Остатки.СуммаУпр КАК СуммаУпр,
	|	ВТ_Остатки.СуммаНДС КАК СуммаНДС,
	|	ВТ_Остатки.ГТД КАК ГТД
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТабЧасть КАК ВТ_ТабЧасть
	|		ПО ВТ_Остатки.Автомобиль = ВТ_ТабЧасть.Автомобиль
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТабЧасть.Ссылка,
	|	ВТ_ТабЧасть.ДатаОперации,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ВТ_Остатки.Автомобиль,
	|	ВТ_ТабЧасть.СкладВ,
	|	ВТ_Остатки.Партия,
	|	ВТ_Остатки.Количество,
	|	ВТ_Остатки.СтатусПартии,
	|	&ХозОперация,
	|	ВТ_Остатки.Сумма,
	|	ВТ_Остатки.СуммаУпр,
	|	ВТ_Остатки.СуммаНДС,
	|	ВТ_Остатки.ГТД
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТабЧасть КАК ВТ_ТабЧасть
	|		ПО ВТ_Остатки.Автомобиль = ВТ_ТабЧасть.Автомобиль";
	
	ОбщийЗапрос.УстановитьПараметр("Ссылка", 		Источник.Ссылка);
	ОбщийЗапрос.УстановитьПараметр("ДатаОперации",	ТекущаяДата());
	ОбщийЗапрос.УстановитьПараметр("СкладИЗ",		СкладЭвакуатор);
	ОбщийЗапрос.установитьПараметр("СкладВ", Источник.СкладПолучатель);
	ОбщийЗапрос.УстановитьПараметр("ХозОперация",Источник.ХозОперация);

	Возврат ОбщийЗапрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьТаблицуОстаткиАвтомобилей(Источник)
	
	ОбщийЗапрос = Новый Запрос;
	
	ОбщийЗапрос.Текст = 
	"ВЫБРАТЬ
	|	ТабЧастьАвтомобили.Автомобиль КАК Автомобиль,
	|	ТабЧастьАвтомобили.Ссылка.Ссылка КАК Ссылка,
	|	ТабЧастьАвтомобили.Ссылка.ДатаОперации КАК ДатаОперации,
	|	ТабЧастьАвтомобили.Ссылка.СкладПолучатель КАК СкладВ,
	|	ТабЧастьАвтомобили.Ссылка.СкладКомпании КАК СкладИз
	|ПОМЕСТИТЬ ВТ_ТабЧасть
	|ИЗ
	|	Документ.ПеремещениеАвтомобилей.Автомобили КАК ТабЧастьАвтомобили
	|ГДЕ
	|	ТабЧастьАвтомобили.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АвтоНаСкладахОстатки.Автомобиль КАК Автомобиль,
	|	АвтоНаСкладахОстатки.СкладКомпании КАК СкладКомпании,
	|	АвтоНаСкладахОстатки.Партия КАК Партия,
	|	АвтоНаСкладахОстатки.КоличествоОстаток КАК Количество,
	|	АвтоНаСкладахОстатки.СуммаОстаток КАК Сумма,
	|	АвтоНаСкладахОстатки.СуммаУпрОстаток КАК СуммаУпр,
	|	АвтоНаСкладахОстатки.СуммаНДСОстаток КАК СуммаНДС,
	|	АвтоНаСкладахОстатки.СтатусПартии КАК СтатусПартии,
	|	АвтоНаСкладахОстатки.ГТД КАК ГТД
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(
	|			&ДатаОперации,
	|			СкладКомпании = &СкладИЗ
	|				И Автомобиль В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Табл.Автомобиль
	|					ИЗ
	|						ВТ_ТабЧасть КАК Табл)) КАК АвтоНаСкладахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТабЧасть.Ссылка КАК Регистратор,
	|	ВТ_ТабЧасть.ДатаОперации КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВТ_Остатки.Автомобиль КАК Автомобиль,
	|	ВТ_Остатки.СкладКомпании КАК СкладКомпании,
	|	ВТ_Остатки.Партия КАК Партия,
	|	ВТ_Остатки.Количество КАК Количество,
	|	&ХозОперация КАК ХозОперация,
	|	ВТ_Остатки.Сумма КАК Сумма,
	|	ВТ_Остатки.СуммаУпр КАК СуммаУпр,
	|	ВТ_Остатки.СуммаНДС КАК СуммаНДС,
	|	ВТ_Остатки.СтатусПартии КАК СтатусПартии,
	|	ВТ_Остатки.ГТД КАК ГТД
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТабЧасть КАК ВТ_ТабЧасть
	|		ПО ВТ_Остатки.Автомобиль = ВТ_ТабЧасть.Автомобиль
	|			И ВТ_Остатки.СкладКомпании = ВТ_ТабЧасть.СкладИз
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТабЧасть.Ссылка,
	|	ВТ_ТабЧасть.ДатаОперации,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ВТ_Остатки.Автомобиль,
	|	ВТ_ТабЧасть.СкладВ,
	|	ВТ_Остатки.Партия,
	|	ВТ_Остатки.Количество,
	|	&ХозОперация,
	|	ВТ_Остатки.Сумма,
	|	ВТ_Остатки.СуммаУпр,
	|	ВТ_Остатки.СуммаНДС,
	|	ВТ_Остатки.СтатусПартии,
	|	ВТ_Остатки.ГТД
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТабЧасть КАК ВТ_ТабЧасть
	|		ПО ВТ_Остатки.Автомобиль = ВТ_ТабЧасть.Автомобиль
	|			И ВТ_Остатки.СкладКомпании = ВТ_ТабЧасть.СкладИз";
	
	ОбщийЗапрос.УстановитьПараметр("Ссылка", 		Источник.Ссылка);
	ОбщийЗапрос.УстановитьПараметр("ДатаОперации",	Источник.Дата);
	ОбщийЗапрос.УстановитьПараметр("СкладИз",		Источник.СкладКомпании);
	ОбщийЗапрос.УстановитьПараметр("ХозОперация",Источник.ХозОперация);
	
	Возврат ОбщийЗапрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьТаблицуОстаткиАвтомобилейСписание(СкладЭвакуатор, Источник)
	
	ОбщийЗапрос = Новый Запрос;
	
	ОбщийЗапрос.Текст = 
	"ВЫБРАТЬ
	|	ТабЧастьАвтомобили.Автомобиль КАК Автомобиль,
	|	ТабЧастьАвтомобили.Ссылка.Ссылка КАК Ссылка,
	|	ТабЧастьАвтомобили.Ссылка.ДатаОперации КАК ДатаОперации,
	|	ТабЧастьАвтомобили.Ссылка.СкладКомпании КАК СкладИз,
	|	ТабЧастьАвтомобили.Ссылка.СкладПолучатель КАК СкладВ1,
	|	&СкладЭвакуатор КАК СкладВ
	|ПОМЕСТИТЬ ВТ_ТабЧасть
	|ИЗ
	|	Документ.ПеремещениеАвтомобилей.Автомобили КАК ТабЧастьАвтомобили
	|ГДЕ
	|	ТабЧастьАвтомобили.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АвтоНаСкладахОстатки.Автомобиль КАК Автомобиль,
	|	АвтоНаСкладахОстатки.СкладКомпании КАК Склад,
	|	АвтоНаСкладахОстатки.Партия КАК Партия,
	|	АвтоНаСкладахОстатки.КоличествоОстаток КАК Количество,
	|	АвтоНаСкладахОстатки.СтатусПартии КАК СтатусПартии,
	|	АвтоНаСкладахОстатки.СуммаОстаток КАК Сумма,
	|	АвтоНаСкладахОстатки.СуммаУпрОстаток КАК СуммаУпр,
	|	АвтоНаСкладахОстатки.СуммаНДСОстаток КАК СуммаНДС,
	|	АвтоНаСкладахОстатки.ГТД КАК ГТД
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(
	|			&ДатаОперации,
	|			СкладКомпании = &СкладИЗ
	|				И Автомобиль В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Табл.Автомобиль
	|					ИЗ
	|						ВТ_ТабЧасть КАК Табл)) КАК АвтоНаСкладахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТабЧасть.Ссылка КАК Регистратор,
	|	ВТ_ТабЧасть.ДатаОперации КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВТ_Остатки.Автомобиль КАК Автомобиль,
	|	ВТ_Остатки.Склад КАК СкладКомпании,
	|	ВТ_Остатки.Партия КАК Партия,
	|	ВТ_Остатки.Количество КАК Количество,
	|	ВТ_Остатки.СтатусПартии КАК СтатусПартии,
	|	&ХозОперация КАК ХозОперация,
	|	ВТ_Остатки.Сумма КАК Сумма,
	|	ВТ_Остатки.СуммаУпр КАК СуммаУпр,
	|	ВТ_Остатки.СуммаНДС КАК СуммаНДС,
	|	ВТ_Остатки.ГТД КАК ГТД
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТабЧасть КАК ВТ_ТабЧасть
	|		ПО ВТ_Остатки.Автомобиль = ВТ_ТабЧасть.Автомобиль
	|			И ВТ_Остатки.Склад = ВТ_ТабЧасть.СкладИз
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТабЧасть.Ссылка,
	|	ВТ_ТабЧасть.ДатаОперации,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ВТ_Остатки.Автомобиль,
	|	ВТ_ТабЧасть.СкладВ,
	|	ВТ_Остатки.Партия,
	|	ВТ_Остатки.Количество,
	|	ВТ_Остатки.СтатусПартии,
	|	&ХозОперация,
	|	ВТ_Остатки.Сумма,
	|	ВТ_Остатки.СуммаУпр,
	|	ВТ_Остатки.СуммаНДС,
	|	ВТ_Остатки.ГТД
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТабЧасть КАК ВТ_ТабЧасть
	|		ПО ВТ_Остатки.Автомобиль = ВТ_ТабЧасть.Автомобиль
	|			И ВТ_Остатки.Склад = ВТ_ТабЧасть.СкладИз";
	
	ОбщийЗапрос.УстановитьПараметр("Ссылка", 		Источник.Ссылка);
	ОбщийЗапрос.УстановитьПараметр("ДатаОперации",	Источник.Дата);
	ОбщийЗапрос.УстановитьПараметр("СкладИз",		Источник.СкладКомпании);
	ОбщийЗапрос.установитьПараметр("СкладЭвакуатор", СкладЭвакуатор);
	ОбщийЗапрос.УстановитьПараметр("ХозОперация",Источник.ХозОперация);

	Возврат ОбщийЗапрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура Renault_ПеремещениеАвтомобилейОбработкаУдаленияПроведенияОбработкаУдаленияПроведения(Источник, Отказ) Экспорт

	Если Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ИспользоватьПродвинутыйМеханизмПеремещений Тогда

		Для Каждого Стр Из Источник.Автомобили Цикл
			
			Если ЗначениеЗаполнено(Стр.DMS_Потребность) Тогда
				НаборЗ = РегистрыСведений.Renault_ПланПеремещения.СоздатьНаборЗаписей();
				НаборЗ.Отбор.ПотребностьПеремещения.Установить(Стр.DMS_Потребность);
				НаборЗ.Прочитать();
				Для Каждого СтрокаАвто Из НаборЗ Цикл
					Если СтрокаАвто.Автомобиль = Стр.Автомобиль Тогда
						СтрокаАвто.Перемещено = Ложь;
						СтрокаАвто.ДокументПеремещения = Документы.ПеремещениеАвтомобилей.ПустаяСсылка();
					КонецЕсли;
				КонецЦикла;
				НаборЗ.Записать();
				
				//Если Источник.DMS_Статус = Перечисления.Renault_СтатусыЗаявкиНаПеремещение.Закрыто Тогда
					ПотребностьОбъект = Стр.DMS_Потребность.ПолучитьОбъект();
					ПотребностьОбъект.Статус = Перечисления.Renault_СтатусыЗаявкиНаПеремещение.Заявка;
					ПотребностьОбъект.Записать();
				//КонецЕсли;
			
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	Renault_РазмещениеАвтомобилей.Склад,
			|	Renault_РазмещениеАвтомобилей.Место,
			|	Renault_РазмещениеАвтомобилей.Автомобиль
			|ИЗ
			|	РегистрСведений.Renault_РазмещениеАвтомобилей КАК Renault_РазмещениеАвтомобилей
			|ГДЕ
			|	Renault_РазмещениеАвтомобилей.Место = &Место
			|	И Renault_РазмещениеАвтомобилей.Автомобиль = &Автомобиль";
			
			Запрос.УстановитьПараметр("Автомобиль", Стр.Автомобиль);
			Запрос.УстановитьПараметр("Место", Стр.DMS_Место);

			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			
			Пока Выборка.Следующий() Цикл
			
				НаборРазмещение = РегистрыСведений.Renault_РазмещениеАвтомобилей.СоздатьНаборЗаписей();
				НаборРазмещение.Отбор.Склад.Установить(ВЫборка.Склад);
				НаборРазмещение.Отбор.Место.Установить(Выборка.Место);
				НаборРазмещение.Прочитать();
				
				Если НаборРазмещение.Количество()>0 Тогда
					НаборРазмещение[0].Автомобиль = Справочники.Автомобили.ПустаяСсылка();
					НаборРазмещение.Записать();
				КонецЕсли;
			
			КонецЦикла;

		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗанятьМестаАвтомобилей(Источник)
	
	Для Каждого СтрокаАвтомобили Из Источник.Автомобили Цикл
		
		
		НаборЗаписейПоТерритории = РегистрыСведений.Renault_РазмещениеАвтомобилей.СоздатьНаборЗаписей();
		НаборЗаписейПоТерритории.Отбор.Склад.Установить(?(ЗначениеЗаполнено(Источник.СкладПолучатель.Renault_Территория), Источник.СкладПолучатель.Renault_Территория, Источник.СкладПолучатель));
		НаборЗаписейПоТерритории.Отбор.Место.Установить(СтрокаАвтомобили.DMS_Место);
		НаборЗаписейПоТерритории.Прочитать();
		
		Если НаборЗаписейПоТерритории.Количество()>0 Тогда
			НаборЗаписейПоТерритории[0].Автомобиль = СтрокаАвтомобили.Автомобиль;
			НаборЗаписейПоТерритории.Записать();
		Иначе
			НаборЗаписейПоСкладу = РегистрыСведений.Renault_РазмещениеАвтомобилей.СоздатьНаборЗаписей();
			НаборЗаписейПоСкладу.Отбор.Склад.Установить(Источник.СкладПолучатель);
			НаборЗаписейПоСкладу.Отбор.Место.Установить(СтрокаАвтомобили.DMS_Место);
			НаборЗаписейПоСкладу.Прочитать();
			
			Если НаборЗаписейПоСкладу.Количество()>0 Тогда
				НаборЗаписейПоСкладу[0].Автомобиль = СтрокаАвтомобили.Автомобиль;
				НаборЗаписейПоСкладу.Записать();
			Иначе
				Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Парковочное место " + СтрокаАвтомобили.DMS_Место + " на складе и территории отсутствует!!!");
			КонецЕсли;	
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьНачисленияВодителям(Источник)
	
	Источник.Движения.Renault_НачисленияВодителей.Записывать = Истина;
	Источник.Движения.Renault_НачисленияВодителей.Очистить();
	
	Движение = Источник.Движения.Renault_НачисленияВодителей.Добавить();
	Движение.Период = Источник.Дата;
	Движение.ОбратныйРейс = Источник.DMS_ОбратныйРейс;
	Движение.Водитель = Источник.DMS_Водитель;
	Движение.Маршрут = Источник.Автомобили[0].DMS_Потребность.Маршрут;
	Если Источник.Автомобили.Количество() = 1 Тогда
		Движение.ТипМаршрута = Перечисления.Renault_ТипМаршрута.Прямой1;
	ИначеЕсли Источник.Автомобили.Количество() = 2 Тогда
		Движение.ТипМаршрута = Перечисления.Renault_ТипМаршрута.Прямой2;
	КонецЕсли;
	
КонецПроцедуры

Процедура Renault_ПеремещениеТоваровОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	//Если Источник.ОбменДанными.Загрузка
	//	ИЛИ Отказ Тогда
	//	
	//	Возврат;
	//КонецЕсли;
	//
	//Запрос = Новый Запрос;
	//		
	//Запрос.УстановитьПараметр("Перемещение", Источник.Ссылка); 
	//		
	//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//			   |	ИСТИНА
	//			   |ИЗ
	//			   |	РегистрСведений.Renault_СтатусыПеремещений КАК Renault_СтатусыПеремещений
	//			   |ГДЕ
	//			   |	Renault_СтатусыПеремещений.Перемещение = &Перемещение";
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Если Не Выборка.Следующий() Тогда
	//	Запись = РегистрыСведений.Renault_СтатусыПеремещения.СоздатьМенеджерЗаписи();
	//	Запись.Перемещение = Источник.Ссылка;
	//	Запись.Статус = Справочники.Renault_СтатусыПеремещения.ВПути;
	//	Запись.Ответственный = ПараметрыСеанса.Пользователь;
	//	Запись.Период = ТекущаяДата();
	//	Запись.ВремяИзменения = ТекущаяДата();
	//	Запись.Записать();
	//КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьПисьмоИзКарточкиКонтрагента(Контрагент, ФормаРодитель) Экспорт
	
	ТекстСообщения = "";
	
	ЗаголовокПисьма = Константы.DMS_ШаблонЗаголовкаПисьма.Получить();
	
	BIR = Renault_ОбщийМодуль.ПолучитьBIRБазыДанных();
	
	ФормаСообщений = ПолучитьОбщуюФорму("Renault_ФормаОтправкиСообщенийКлиенту", ФормаРодитель);
	СписокПараметров = Новый СписокЗначений;
	СписокПараметров.Добавить(Контрагент);
	СписокПараметров.Добавить(Справочники.Автомобили.ПустаяСсылка());
	ФормаСообщений.СписокПараметров = СписокПараметров;
	ТекстСообщения = ФормаСообщений.ОткрытьМодально();
	
	ПочтаКлиента = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(Контрагент);
	
	Если Не ЗначениеЗаполнено(ПочтаКлиента) Тогда
		
		#Если Клиент Тогда
			Предупреждение("У клиента не указан адрес электронной почты");
		#КонецЕсли
		Возврат;
		
	КонецЕсли;
	
	//Для Каждого СтрокаЗначений ИЗ ТекущийКонтакт.ОснованиеДляКонтакта_Значения Цикл
	//	Тег = "<" + СтрокаЗначений.ИмяКолонки + ">";
	//	ЗаголовокПисьма = СтрЗаменить(ЗаголовокПисьма, Тег, Строка(СтрокаЗначений.Значение));
	//КонецЦикла;
	
	ЗаголовокПисьма = Строка(Renault_CRM.ПолучитьДилерскийЦентрПользователя());
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		
		ТаблицаСообщений = Новый ТаблицаЗначений;
		ТаблицаСообщений.Колонки.Добавить("Получатели");
		ТаблицаСообщений.Колонки.Добавить("ТекстСообщения");
		ТаблицаСообщений.Колонки.Добавить("BIR");
		ТаблицаСообщений.Колонки.Добавить("ТипТекстаСообщения");
		
		НоваяСтрока = ТаблицаСообщений.Добавить();
		НоваяСтрока.BIR = BIR; // "99999999";
		СсылкаНаКартинку = " <IMG src=""http://app.renault.ru/pixel.php?subid="+ ПочтаКлиента + "&campaign=" + "no" + "&bir="+BIR+""">";
		НоваяСтрока.ТекстСообщения = ЗаголовокПисьма  + Символы.ПС + ТекстСообщения +СсылкаНаКартинку;
		
		НоваяСтрока.ТипТекстаСообщения = "HTML";
		
		Получатели = Новый ТаблицаЗначений;
		Получатели.Колонки.Добавить("Адрес");
		
		СтрокаПолучатели = Получатели.Добавить();
		СтрокаПолучатели.Адрес = ПочтаКлиента;
		
		НоваяСтрока.Получатели = Получатели;
		
		DMS_ВзаимодействияСКлиентом.ВыполнитьРассылкуПисем(ТаблицаСообщений);
		
	КонецЕсли;

	
КонецПроцедуры

Процедура ОтправитьСМСИзКарточкиКонтрагента(Контрагент, ФормаРодитель) Экспорт
	
	  ТелефонКлиента = Renault_АвтосервисОбщий.Renault_ВыбратьТелефон(Контрагент);
	
	Если НЕ ЗначениеЗаполнено(ТелефонКлиента) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДЦ = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
	
	Если Не ЗначениеЗаполнено(ДЦ) Тогда
		
		#Если Клиент Тогда
		
			Предупреждение("У пользователя не указан дилерский центр");
		
		#КонецЕсли
		
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = "";
	
	ФормаСообщений = ПолучитьОбщуюФорму("Renault_ФормаОтправкиСообщенийКлиенту", ФормаРодитель);
	СписокПараметров = Новый СписокЗначений;
	СписокПараметров.Добавить(Контрагент);
	СписокПараметров.Добавить(Справочники.Автомобили.ПустаяСсылка());
	ФормаСообщений.СписокПараметров = СписокПараметров;
	
	ТекстСообщения = ФормаСообщений.ОткрытьМодально();
	
	//Если ЕстьСообщение = Истина Тогда
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		ТаблицаСообщений = Новый ТаблицаЗначений;
		ТаблицаСообщений.Колонки.Добавить("Получатели");
		ТаблицаСообщений.Колонки.Добавить("ТекстСообщения");
		ТаблицаСообщений.Колонки.Добавить("BIR");
		НоваяСтрока = ТаблицаСообщений.Добавить();
		НоваяСтрока.BIR = ДЦ.BIR;
		
		НоваяСтрока.ТекстСообщения = ТекстСообщения;
		Получатели = Новый ТаблицаЗначений;
		Получатели.Колонки.Добавить("Телефон");
		СтрокаПолучатель = Получатели.Добавить();
		СтрокаПолучатель.Телефон = ТелефонКлиента;
		НоваяСтрока.Получатели = Получатели;
		
		ТаблицаКВозврату = DMS_ВзаимодействияСКлиентом.ВыполнитьРассылкуСМС(ТаблицаСообщений);
		
		Для Каждого Строка ИЗ ТаблицаКВозврату Цикл
			СтруктураРезультата = Строка.Результат;
			МассивСтруктурРезультата = СтруктураРезультата.ОтправленныеСообщения;
			Для Каждого СтруктураРезультата ИЗ МассивСтруктурРезультата Цикл
				ИдентификаторСообщения = СтруктураРезультата.ИдентификаторСообщения;
			КонецЦикла;
		КонецЦикла;
				
	КонецЕсли;

	
КонецПроцедуры

Процедура НайтиСогласиеНаобработку(Контрагент, ЭтаФорма) Экспорт
	
	ДЦ = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
	
	Если НЕ ЗначениеЗаполнено(ДЦ) Тогда
		
		Сообщить("Не указан дилерский центр пользователя");
		
		Возврат;
		
	КонецЕсли;
	
	Ошибка = "";
	
	ФИОПОиск = Контрагент.Наименование;
	
	ТаблицаРезультат = Renault_РаботаСSalesTablet.ПолучитьТаблицуСоглашения(ДЦ, ФИОПОиск, Контрагент.ДатаРождения, Ошибка);
	
	
	Если Не ЗначениеЗаполнено(ТаблицаРезультат) И ЗначениеЗаполнено(Ошибка) Тогда
		
		Сообщить("При поиске произошла ошибка: " + Строка(Ошибка));
		Возврат;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ТаблицаРезультат) Тогда
		
		Сообщить("Нет данных по этому клиенту");
		Возврат;
		
	КонецЕсли;
	
	Форма = ПолучитьОбщуюФорму("Renault_ПоискСогласияНаОбработкуПД");
	
	ТаблицаКлиенты = Форма.ТаблицаКлиенты.Скопировать();
	
	Для Каждого Стр из ТаблицаРезультат Цикл
		
		НовСтр = ТаблицаКлиенты.Добавить();
		НовСтр.ИмяФайлаНаСервере = Стр.ИмяФайла;
		НовСтр.ДатаСогласия = Стр.ДатаСогласия;
		НовСтр.ФИО = Контрагент.Наименование;
		НовСтр.Датарождения = Контрагент.ДатаРождения;
		
	КонецЦикла;
	
	Форма.ТаблицаКлиенты = ТаблицаКлиенты;
	
	Форма.Открыть();	
	
КонецПроцедуры

Функция ПолучитьНомераСотрудника(Сотрудник)
	
	
	ТекСотрудник = Сотрудник;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КонтактнаяИнформация.Представление КАК Номер
	                      |ИЗ
	                      |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	                      |ГДЕ
	                      |	КонтактнаяИнформация.Тип = &Тип
	                      |	И КонтактнаяИнформация.Вид.Наименование ПОДОБНО ""Внутренний%""
	                      |	И КонтактнаяИнформация.Объект = &Объект");
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Объект",ТекСотрудник);
	
	Номер = "Номер не указан!  ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 тогда
		Номер = "";
		Пока Выборка.Следующий() Цикл
			Номер = Номер + Выборка.Номер +"; ";
		КонецЦикла;
	КонецЕсли;
	
	Номер = Лев(Номер,СтрДлина(Номер)-2);
	
	Возврат Номер;
	
КонецФункции


Процедура ПозвонитьИзКарточкиКонтрагента(Контрагент) Экспорт
	
	ТелефонКлиента = Renault_АвтосервисОбщий.Renault_ВыбратьТелефон(Контрагент);
	Если НЕ ЗначениеЗаполнено(ТелефонКлиента) Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = Новый Структура;
	Параметры.Вставить("Телефон", ТелефонКлиента);
	Параметры.Вставить("ВнутреннийНомер", ПолучитьНомераСотрудника(ПараметрыСеанса.Пользователь.Сотрудник));
	
	#Если Клиент Тогда		
		Оповестить("Renault_Позвонить", ТелефонКлиента);  
	#КонецЕсли
КонецПроцедуры

Процедура НастроитьКнопкиВКарточкеКонтрагента(Контрагент, Форма) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Тип,
	|	КонтактнаяИнформация.Представление,
	|	КонтактнаяИнформация.Комментарий
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Контрагент";
//	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	КонтактыКлиента = Запрос.Выполнить().Выгрузить();
	
	ТелефоныКлиента = КонтактыКлиента.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон)); 
	
	Если ТелефоныКлиента.Количество() > 0 Тогда
		
		ЕстьТелефон = Истина;
		
	Иначе
		
		ЕстьТелефон = Ложь;

	КонецЕсли;
	
	EmailКлиента = КонтактыКлиента.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты));
	
	Если EmailКлиента.Количество() > 0 Тогда 
		
		ЕстьEmail = Истина;
		
	Иначе
		
		ЕстьEmail = Ложь;
		
	КонецЕсли;
	
	Форма.ЭлементыФормы.кнЗвонок.Доступность = ЕстьТелефон;
	Форма.ЭлементыФормы.кнСМС.Доступность = ЕстьТелефон;
	Форма.ЭлементыФормы.кнПочта.Доступность = ЕстьEmail;
		
КонецПроцедуры

// [ВОРОБЬЕВ]] 07.02.2017 17:28:49 +++
Процедура Renault_ПоступлениеТоваровСозданиеЗаказа(Источник, Отказ, РежимПроведения) Экспорт
	
	Если ЗначениеЗаполнено(ПараметрыСеанса.DMS_Бренд) Тогда
		СоздаватьЗаказы = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].СоздаватьЗаказыДляПоступленияТоваров;
		Если НЕ СоздаватьЗаказы Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Источник.ОбменДанными.Загрузка
		ИЛИ Отказ
		ИЛИ НЕ Источник.ДополнительныеСвойства.Свойство("ЗаписьИзФормы") Тогда
	
		Возврат;
	КонецЕсли;
	
	// Проверям, что заказами поставщику закрыты все поступившие товары
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаРаспределено.Номенклатура,
	               |	ТаблицаРаспределено.Заказано,
	               |	ТаблицаРаспределено.ХарактеристикаНоменклатуры
	               |ПОМЕСТИТЬ ВТ_ТаблицаРаспределено
	               |ИЗ
	               |	&РаспределеноПоЗаказам КАК ТаблицаРаспределено
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Поступило.Номенклатура,
	               |	Поступило.Количество,
	               |	Поступило.ХарактеристикаНоменклатуры
	               |ПОМЕСТИТЬ ВТ_Поступило
	               |ИЗ
	               |	&ОстаткиПоступление КАК Поступило
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Поступило.Номенклатура,
	               |	Поступило.ХарактеристикаНоменклатуры,
	               |	Поступило.Количество - ЕСТЬNULL(ВТ_ТаблицаРаспределено.Заказано, 0) КАК Нераспределено
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТ_Поступило.Номенклатура КАК Номенклатура,
	               |		СУММА(ВТ_Поступило.Количество) КАК Количество,
	               |		ВТ_Поступило.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	               |	ИЗ
	               |		ВТ_Поступило КАК ВТ_Поступило
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВТ_Поступило.Номенклатура,
	               |		ВТ_Поступило.ХарактеристикаНоменклатуры) КАК Поступило
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВТ_ТаблицаРаспределено.Номенклатура КАК Номенклатура,
	               |			СУММА(ВТ_ТаблицаРаспределено.Заказано) КАК Заказано,
	               |			ВТ_ТаблицаРаспределено.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	               |		ИЗ
	               |			ВТ_ТаблицаРаспределено КАК ВТ_ТаблицаРаспределено
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ВТ_ТаблицаРаспределено.Номенклатура,
	               |			ВТ_ТаблицаРаспределено.ХарактеристикаНоменклатуры) КАК ВТ_ТаблицаРаспределено
	               |		ПО Поступило.Номенклатура = ВТ_ТаблицаРаспределено.Номенклатура
	               |			И Поступило.ХарактеристикаНоменклатуры = ВТ_ТаблицаРаспределено.ХарактеристикаНоменклатуры
	               |ГДЕ
	               |	Поступило.Количество - ЕСТЬNULL(ВТ_ТаблицаРаспределено.Заказано, 0) > 0";
	
	Запрос.УстановитьПараметр("РаспределеноПоЗаказам", Источник.Движения.ЗаказыПоставщикам.Выгрузить());
	Запрос.УстановитьПараметр("ОстаткиПоступление", Источник.Движения.ОстаткиТоваровКомпании.Выгрузить());
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
	#Если Клиент Тогда
		Если Вопрос("Есть назакрытые позиции. Создать заказ поставщику?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			
			Отказ = Истина;	
			Сообщить("Проведение без создания заказа невозможно.");
			
			Возврат;
			
		КонецЕсли;	
	#КонецЕсли
	
	ИначеЕсли Результат.Пустой() Тогда
		Возврат; // все ок
	КонецЕсли;
	
	ЗаказПоставщику = Документы.ЗаказПоставщику.СоздатьДокумент();
	
	ДатаЗаказа = ?(Источник.Дата = НачалоДня(Источник.Дата), НачалоДня(Источник.Дата-1), НачалоДня(Источник.Дата));
	
	ЗаказПоставщику.Дата = ДатаЗаказа; // дата должна быть меньше даты поступления, иначе не распределится
	ЗаказПоставщику.Комментарий = "#Создан автоматически при проведении поступления: " + Источник.Ссылка;
	ЗаказПоставщику.Заполнить(Источник.Ссылка);
	//ЗаказПоставщику.ДокументОснование = Неопределено;
	
	ЗаказПоставщику.Товары.Очистить();

	ВыборкаНераспределено = Результат.Выбрать();
	Пока ВыборкаНераспределено.Следующий() Цикл
		СтрокаПоступления = Источник.Товары.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", ВыборкаНераспределено.Номенклатура, ВыборкаНераспределено.ХарактеристикаНоменклатуры))[0];
		
		СтрокаТовары = ЗаказПоставщику.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТовары, СтрокаПоступления); 

		СтрокаТовары.Количество = ВыборкаНераспределено.Нераспределено / СтрокаТовары.Коэффициент;
		ЗаказПоставщику.ОбработкаРеквизита("Товары.Количество", СтрокаТовары);
	КонецЦикла;

    // Очищаем, чтобы небыло сообщения о том, что документ проведен раньше документа основания
    //ЗаказПоставщику.ДокументОснование = Неопределено; 
    // Озеров: Пусть все-таки выдает сообщение, зато видим иерархию.

	ЗаказПоставщику.Записать(РежимЗаписиДокумента.Проведение);

	Источник.ДополнительныеСвойства.Вставить("ЗаказСоздан");
	Источник.ДополнительныеСвойства.Вставить("ЗаказПоставщику", ЗаказПоставщику.Ссылка);
	
КонецПроцедуры

Процедура Renault_ЗаписьПлановыхДатПоступленияПоЗаказуПоставщикуОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	НаборЗаписей = РегистрыСведений.Renault_ПлановыеДатыПоступления.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заказ.Установить(Источник.Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Для каждого СтрокаТовары Из Источник.Товары Цикл
		Если Не ЗначениеЗаполнено(СтрокаТовары.Renault_ДатаПоступления) Тогда
			Продолжить;
		КонецЕсли;
		
		Запись = НаборЗаписей.Добавить();
		Запись.Номенклатура = СтрокаТовары.Номенклатура;
		Запись.Характеристика = СтрокаТовары.ХарактеристикаНоменклатуры;
		Запись.Заказ = Источник.Ссылка;
		Запись.КлючСтроки = СтрокаТовары.НомерСтроки;
		Запись.ДатаПоступления = СтрокаТовары.Renault_ДатаПоступления;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура Renault_ЗаписьПлановыхДатПоступленияПоЗаказуПоставщикуОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	НаборЗаписей = РегистрыСведений.Renault_ПлановыеДатыПоступления.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заказ.Установить(Источник.Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
КонецПроцедуры

// [[ВОРОБЬЕВ]] --- 

//подписка перед записью регистра сведений КонтактнаяИнформация. Запрет дублей телефонов
Процедура РегСведений_КонтактнаяИнформацияИндексТелефоновПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Если Renault_ОбщиеФункцииСервер.ЭтоФоновоеЗадание() Тогда Возврат КонецЕсли;
	
	//// Преобразуем телефон к стандартному виду
	Для Каждого СтрРег Из Источник Цикл
		
		Если СтрРег.Тип <> Renault_ОбщиеФункцииСервер.ПолучитьТипТелефон() Тогда
			Продолжить;
		КонецЕсли;
		
		Индекс = ПреобразоватьНомерДляСохранения(СтрРег.Представление, СтрДлина(СтрРег.Представление));
		Если Индекс = СтрРег.CRM_ПолеХраненияНомера Тогда
			Продолжить;
		КонецЕсли;
		СтрРег.CRM_ПолеХраненияНомера = Индекс;
		//@++ ВасильевВА
		СтрРег.Представление = СтрЗаменить(СтрРег.Представление," ","");
		//@--
		
	КонецЦикла;
	
	//Если Renault_ОбщиеФункцииСервер.ОтключатьДедубликациюПоКонтактам() Тогда
	//	Возврат;
	//КонецЕсли;
	//
	////локальные дубли
	//Т = Источник.Выгрузить();
	//ТТ = Т.СкопироватьКолонки("Объект,CRM_ПолеХраненияНомера");
	//Для Каждого Стр Из Т.НайтиСтроки(Новый Структура("Тип", Renault_ОбщиеФункцииСервер.ПолучитьТипТелефон())) Цикл
	//	ЗаполнитьЗначенияСвойств(ТТ.Добавить(), Стр);
	//КонецЦикла;
	//
	//ИсходноеКолВо = ТТ.Количество();
	//ТТ.Свернуть("Объект,CRM_ПолеХраненияНомера");
	//
	//Если ИсходноеКолВо <> ТТ.Количество() Тогда
	//	Сообщить("Обнаружены дубли телефонов", СтатусСообщения.Внимание);
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;
	//
	//Renault_ОбщиеФункцииСервер.ПолучитьДублиНаСервере(ТТ);
	
КонецПроцедуры

Функция ПреобразоватьНомерДляСохранения(Знач НомерТелефона, ЧислоСимволов) Экспорт
	
	Префикс = "1";
	ТолькоЦифрыНомера = "";
	Для а = 1 По СтрДлина(НомерТелефона) Цикл
		Если СтрЧислоВхождений("1234567890", Сред(НомерТелефона,а,1)) > 0 Тогда
			ТолькоЦифрыНомера = ТолькоЦифрыНомера + Сред(НомерТелефона,а,1);
		КонецЕсли;
	КонецЦикла;

	НомерТелефона = ТолькоЦифрыНомера;
	Возврат ?(НЕ ЗначениеЗаполнено(НомерТелефона), 0, Число(Префикс + Прав(СокрЛП(НомерТелефона), ЧислоСимволов)));
	
КонецФункции


Процедура DMS_РеализацияАвтомобилейОбработкаПроведенияОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если НЕ РегистрыСведений.Renault_РазмещениеАвтомобилей.ОсвободитьПарковочноеМесто(Источник.Автомобили.ВыгрузитьКолонку("Автомобиль")) Тогда
	КонецЕсли;

КонецПроцедуры

Процедура DMS_ПеремещениеАвтомобилейПриЗаписиПередЗаписью1(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ИспользоватьПродвинутыйМеханизмПеремещений Тогда
		
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			
			Если Источник.DMS_Статус = Источник.Ссылка.DMS_Статус Тогда
				Отказ = Renault_ОбщегоНазначенияКлиентСервер.ПроверитьДатуОперации(Источник);
			КонецЕсли;
			
			Если Источник.СкладКомпании.Renault_Территория = Источник.СкладПолучатель.Renault_Территория Тогда
				Источник.DMS_Статус = Перечисления.Renault_СтатусыЗаявкиНаПеремещение.Закрыто;
			КонецЕсли;
			
		ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			Источник.DMS_Статус = Перечисления.Renault_СтатусыЗаявкиНаПеремещение.ВПути;
		КонецЕсли;
						
		Если Источник.DMS_Статус = Перечисления.Renault_СтатусыЗаявкиНаПеремещение.Закрыто Тогда
			Источник.DMS_Принял = ПараметрыСеанса.Пользователь;
		ИначеЕсли Источник.DMS_Статус = Перечисления.Renault_СтатусыЗаявкиНаПеремещение.ВПути Тогда
			Если Источник.СкладКомпании.Renault_Территория = Источник.СкладПолучатель.Renault_Территория Тогда
				Источник.DMS_Принял = ПараметрыСеанса.Пользователь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура DMS_ПеремещениеАвтомобилейПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
	
	
КонецПроцедуры

Процедура ЗаписатьОтметкиВПланПеремещений(Источник)
	
	Для Каждого СтрокаАвтомобили Из Источник.Автомобили Цикл
		
		Если ЗначениеЗаполнено(СтрокаАвтомобили.DMS_Потребность) Тогда
			текДатаПоступления = СтрокаАвтомобили.DMS_Потребность.ЖелаемаяДатаПеремещения + (СтрокаАвтомобили.DMS_Потребность.ВремяПоступления - Дата('00010101')); 
			МенеджерЗаписи = РегистрыСведений.Renault_ПланПеремещения.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ПотребностьПеремещения = СтрокаАвтомобили.DMS_Потребность;
			МенеджерЗаписи.ДатаПлан = текДатаПоступления;
			МенеджерЗаписи.Прочитать();
			
			Если МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.ДокументПеремещения = Источник.Ссылка;
				МенеджерЗаписи.Перемещено = Истина;
				МенеджерЗаписи.Записать();
			КонецЕсли;
			
			Если Источник.DMS_Статус = Перечисления.Renault_СтатусыЗаявкиНаПеремещение.Закрыто Тогда
				ПотребностьОбъект = СтрокаАвтомобили.DMS_Потребность.ПолучитьОбъект();
				ПотребностьОбъект.Статус = Перечисления.Renault_СтатусыЗаявкиНаПеремещение.Закрыто;
				ПотребностьОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЗаписатьОтметкиВПланПеремещений()

Функция ПолучитьПарковочноеМесто(Автомобиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_РазмещениеАвтомобилей.Место
	|ИЗ
	|	РегистрСведений.Renault_РазмещениеАвтомобилей КАК Renault_РазмещениеАвтомобилей
	|ГДЕ
	|	Renault_РазмещениеАвтомобилей.Автомобиль = &Автомобиль";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Место;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Процедура DMS_ВыводИзЭксплуатацииАвтомобилейОбработкаПроведенияОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
		
	Для Каждого ТекСтрока Из Источник.Активы Цикл
		Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(ТекСтрока.Автомобиль, Перечисления.ВидАвтомобиля.DMS_ДемоПродажа, Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля, Источник.Дата);
	КонецЦикла;
		
КонецПроцедуры

//проверка блокировки автомобиля
//где Объект - VIN(Автомобиль)/Модель/ВариантКомплектации
Функция Блокировка(Объект) Экспорт
	Если ТипЗнч(Объект)=Тип("Строка") Тогда
		Запрос=Новый Запрос("ВЫБРАТЬ * ИЗ РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 ГДЕ IS_BLOCKED=ИСТИНА И VIN=&VIN");
		Запрос.УстановитьПараметр("VIN",Объект);
	Иначе
		Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 * ИЗ РегистрСведений.DMS_БлокировкаПродажиАвтомобилей ГДЕ "
		+?(ТипЗнч(Объект)=Тип("СправочникСсылка.Модели"),"Модель","ВариантКомплектации")+"=&Объект");
		Запрос.УстановитьПараметр("Объект",Объект);
	КонецЕсли;	
	Возврат Не Запрос.Выполнить().Пустой()
КонецФункции