
Функция ПолучениеДанных(УзелОбмена,КодУзла,Данные,НомерОтправленного,СообщениеОбОшибке)
	
	Попытка
		НомерОтправленного = DMS_ОбменДаннымиСДМСервер.ПолучениеДанных(УзелОбмена,КодУзла,Данные,НомерОтправленного);
		СообщениеОбОшибке = "";
	Исключение
		НомерОтправленного = 0;
	 	СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("Загрузка данных для 'Система дилерского медиапланирования, редакция 1.0'",УровеньЖурналаРегистрации.Информация,,,СообщениеОбОшибке);
	КонецПопытки;
	
	ЗаписьЖурналаРегистрации("Загрузка данных для 'Система дилерского медиапланирования, редакция 1.0'",УровеньЖурналаРегистрации.Информация,,,"Выполнено успешно");
	
КонецФункции

Функция ОтправкаДанных(УзелОбмена,КодУзла,ПравилаОбмена,Данные,СообщениеОбОшибке)
		
	Попытка
		Данные = DMS_ОбменДаннымиСДМСервер.ОтправкаДанных(УзелОбмена,КодУзла,ПравилаОбмена);
	Исключение
		Данные = Новый ХранилищеЗначения(Неопределено);
	 	СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("Выгрузка данных для 'Система дилерского медиапланирования, редакция 1.0'",УровеньЖурналаРегистрации.Ошибка,,,СообщениеОбОшибке);
	КонецПопытки;
	
	ЗаписьЖурналаРегистрации("Выгрузка данных для 'Система дилерского медиапланирования, редакция 1.0'",УровеньЖурналаРегистрации.Информация,,,"Выполнено успешно");
	
КонецФункции

Функция НомерОтправленного(УзелОбмена, КодУзла, НомерОтправленного,СообщениеОбОшибке)
		
	Попытка
		НомерОтправленного = DMS_ОбменДаннымиСДМСервер.НомерОтправленного(УзелОбмена,КодУзла);
	Исключение
		НомерОтправленного = 0;
	 	СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("Получение номера отправленного для 'Система дилерского медиапланирования, редакция 1.0'",УровеньЖурналаРегистрации.Ошибка,,,СообщениеОбОшибке);
	КонецПопытки;
	
	ЗаписьЖурналаРегистрации("Получение номера отправленного для 'Система дилерского медиапланирования, редакция 1.0'",УровеньЖурналаРегистрации.Информация,,,"Выполнено успешно");
	
КонецФункции
