Процедура ДобавитьЗапись(Параметры) Экспорт
	//ЕстьАктивныйЭтап = РегистрыСведений.SM_ЭтапСогласования.ЕстьАктивныйЭтап(Параметры.УникальныйИдентификатор);
	//Если ЕстьАктивныйЭтап И ЕстьАктивныеЗаписиПоТекущемуЭтапу(Параметры) Тогда
	//	Возврат;
	//КонецЕсли;
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Параметры);
	МенеджерЗаписи.Записать();	
КонецПроцедуры

Функция ПолучитьПараметры() Экспорт
	Параметры = Новый Структура;
	Параметры.Вставить("НомерЭтапа"				, 	);
	Параметры.Вставить("УникальныйИдентификатор",	);
	Параметры.Вставить("Согласующий"			,	);
	Параметры.Вставить("Ответ"					,	);
	Параметры.Вставить("ДатаОтвета"				,	);
	Параметры.Вставить("Причина"				,	);
	Возврат Параметры;
КонецФункции

Функция ЗаполнитьПараметрыПоУмолчанию(Параметры) Экспорт
	Параметры.Вставить("НомерЭтапа"				, 	);
	Параметры.Вставить("УникальныйИдентификатор",	);
	Параметры.Вставить("Согласующий"			,	);
	Параметры.Вставить("Ответ"					,Перечисления.SM_СтатусыСогласования.ПустаяСсылка());
	Параметры.Вставить("ДатаОтвета"				,Дата(1,1,1));
КонецФункции 

Функция ЕстьАктивныеЗаписиПоТекущемуЭтапу(Параметры) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	SM_СогласующиеЭтап.НомерЭтапа КАК НомерЭтапа,
		|	SM_СогласующиеЭтап.УникальныйИдентификатор КАК УникальныйИдентификатор,
		|	SM_СогласующиеЭтап.Согласующий КАК Согласующий,
		|	SM_СогласующиеЭтап.Ответ КАК Ответ,
		|	SM_СогласующиеЭтап.ДатаОтвета КАК ДатаОтвета
		|ИЗ
		|	РегистрСведений.SM_СогласующиеЭтап КАК SM_СогласующиеЭтап
		|ГДЕ
		|	SM_СогласующиеЭтап.НомерЭтапа = &НомерЭтапа
		|	И Выразить(SM_СогласующиеЭтап.УникальныйИдентификатор Как Строка(100)) = Выразить(&УникальныйИдентификатор Как Строка(100))
		|	И SM_СогласующиеЭтап.Ответ = ЗНАЧЕНИЕ(Перечисление.SM_СтатусыСогласования.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("НомерЭтапа"				, Параметры.НомерЭтапа);
	Запрос.УстановитьПараметр("УникальныйИдентификатор"	, Параметры.УникальныйИдентификатор);
	
	Пустой = Запрос.Выполнить().Пустой();
	
	Возврат Не Пустой;
КонецФункции

Функция ПолучитьАктивныеЗаписи(Параметры) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	SM_СогласующиеЭтап.НомерЭтапа КАК НомерЭтапа,
		|	SM_СогласующиеЭтап.УникальныйИдентификатор КАК УникальныйИдентификатор,
		|	SM_СогласующиеЭтап.Согласующий КАК Согласующий,
		|	SM_СогласующиеЭтап.Ответ КАК Ответ,
		|	SM_СогласующиеЭтап.ДатаОтвета КАК ДатаОтвета
		|ИЗ
		|	РегистрСведений.SM_СогласующиеЭтап КАК SM_СогласующиеЭтап
		|ГДЕ
		|	SM_СогласующиеЭтап.НомерЭтапа = &НомерЭтапа
		|	И Выразить(SM_СогласующиеЭтап.УникальныйИдентификатор Как Строка(100)) = Выразить(&УникальныйИдентификатор Как Строка(100))
		|	И SM_СогласующиеЭтап.Ответ = ЗНАЧЕНИЕ(Перечисление.SM_СтатусыСогласования.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("НомерЭтапа"				, Параметры.НомерЭтапа);
	Запрос.УстановитьПараметр("УникальныйИдентификатор"	, Параметры.УникальныйИдентификатор);
	
	ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаЗначений;
КонецФункции

Процедура ИзменитьЗапись(Параметры) Экспорт
	МенеджерЗаписи = РегистрыСведений.SM_СогласующиеЭтап.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Параметры);
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Параметры);
		МенеджерЗаписи.Записать();
	КонецЕсли;
КонецПроцедуры

Функция ВсеСогласующиеОтветилиПоТекущемуЭтапу(Параметры) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(SM_СогласующиеЭтап.Согласующий) КАК КоличествоУчастников,
		|	КОЛИЧЕСТВО(ВЫБОР
		|			КОГДА SM_СогласующиеЭтап.Ответ <> ЗНАЧЕНИЕ(Перечисление.SM_СтатусыСогласования.ПустаяСсылка)
		|					И SM_СогласующиеЭтап.ДатаОтвета <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА 1
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК КоличествоОтветов
		|ПОМЕСТИТЬ ВТ_Итоги
		|ИЗ
		|	РегистрСведений.SM_СогласующиеЭтап КАК SM_СогласующиеЭтап
		|ГДЕ
		|	SM_СогласующиеЭтап.НомерЭтапа = &НомерЭтапа
		|	И SM_СогласующиеЭтап.УникальныйИдентификатор = &УникальныйИдентификатор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итоги.КоличествоОтветов = ВТ_Итоги.КоличествоУчастников КАК ВсеОтветили
		|ИЗ
		|	ВТ_Итоги КАК ВТ_Итоги";
	
	Запрос.УстановитьПараметр("НомерЭтапа"				, Параметры.НомерЭтапа);
	Запрос.УстановитьПараметр("УникальныйИдентификатор"	, Параметры.УникальныйИдентификатор);
	
	ВсеОтветили = Запрос.Выполнить().Выгрузить()[0].ВсеОтветили;
	
	Возврат ВсеОтветили;
КонецФункции

Функция ПолучитьОтветыСогласующих(Параметры)Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	SM_СогласующиеЭтап.НомерЭтапа КАК НомерЭтапа,
		|	SM_СогласующиеЭтап.УникальныйИдентификатор КАК УникальныйИдентификатор,
		|	SM_СогласующиеЭтап.Согласующий КАК Согласующий,
		|	SM_СогласующиеЭтап.Ответ КАК Ответ,
		|	SM_СогласующиеЭтап.ДатаОтвета КАК ДатаОтвета,
		|	SM_СогласующиеЭтап.Причина КАК Причина
		|ИЗ
		|	РегистрСведений.SM_СогласующиеЭтап КАК SM_СогласующиеЭтап
		|ГДЕ
		|	SM_СогласующиеЭтап.НомерЭтапа = &НомерЭтапа
		|	И SM_СогласующиеЭтап.УникальныйИдентификатор = &УникальныйИдентификатор
		|	И SM_СогласующиеЭтап.Ответ <> ЗНАЧЕНИЕ(Перечисление.SM_СтатусыСогласования.ПустаяСсылка)
		|	И SM_СогласующиеЭтап.ДатаОтвета <> ДАТАВРЕМЯ(1, 1, 1)";
	
	Запрос.УстановитьПараметр("НомерЭтапа"				, Параметры.НомерЭтапа);
	Запрос.УстановитьПараметр("УникальныйИдентификатор"	, Параметры.УникальныйИдентификатор);
	
	ТаблицаОтветов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаОтветов;
КонецФУнкции 

Функция ПолучитьВсехСогласующихПоТекущемуЭтапу(Параметры) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	SM_СогласующиеЭтап.НомерЭтапа КАК НомерЭтапа,
		|	SM_СогласующиеЭтап.УникальныйИдентификатор КАК УникальныйИдентификатор,
		|	SM_СогласующиеЭтап.Согласующий КАК Согласующий,
		|	SM_СогласующиеЭтап.Ответ КАК Ответ,
		|	SM_СогласующиеЭтап.ДатаОтвета КАК ДатаОтвета,
		|	SM_СогласующиеЭтап.Причина КАК Причина
		|ИЗ
		|	РегистрСведений.SM_СогласующиеЭтап КАК SM_СогласующиеЭтап
		|ГДЕ
		|	SM_СогласующиеЭтап.НомерЭтапа = &НомерЭтапа
		|	И (ВЫРАЗИТЬ(SM_СогласующиеЭтап.УникальныйИдентификатор КАК СТРОКА(100))) = (ВЫРАЗИТЬ(&УникальныйИдентификатор КАК СТРОКА(100)))";
	
	Запрос.УстановитьПараметр("НомерЭтапа"				, Параметры.НомерЭтапа);
	Запрос.УстановитьПараметр("УникальныйИдентификатор"	, Параметры.УникальныйИдентификатор);
	
	ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаЗначений;
КонецФункции

Функция ПолучитьТекущийОтветСотрудника(Параметры) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	SM_СогласующиеЭтап.НомерЭтапа КАК НомерЭтапа,
		|	SM_СогласующиеЭтап.УникальныйИдентификатор КАК УникальныйИдентификатор,
		|	SM_СогласующиеЭтап.Согласующий КАК Согласующий,
		|	SM_СогласующиеЭтап.Ответ КАК Ответ,
		|	SM_СогласующиеЭтап.ДатаОтвета КАК ДатаОтвета,
		|	SM_СогласующиеЭтап.Причина КАК Причина
		|ИЗ
		|	РегистрСведений.SM_СогласующиеЭтап КАК SM_СогласующиеЭтап
		|ГДЕ
		|	SM_СогласующиеЭтап.УникальныйИдентификатор = &УникальныйИдентификатор
		|	И SM_СогласующиеЭтап.НомерЭтапа = &НомерЭтапа
		|	И SM_СогласующиеЭтап.Согласующий = &Согласующий";
	
	Запрос.УстановитьПараметр("НомерЭтапа"				, Параметры.НомерЭтапа);
	Запрос.УстановитьПараметр("Согласующий"				, Параметры.Согласующий);
	Запрос.УстановитьПараметр("УникальныйИдентификатор"	, Параметры.УникальныйИдентификатор);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции