#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////#Область ПрограммныйИнтерфейс

// Добавляет строку с результатом согласования рецензента в тч РезультатыСогласования
//
// Параметры:
//	ТочкаМаршрута         - ТочкаМаршрутаБизнесПроцессаСсылка.СогласованиеЦенНоменклатуры
//	Рецензент             - СправочникСсылка.Пользователи - исполнитель задачи по согласованию
//	РезультатСогласования - ПеречислениеСсылка.РезультатыСогласования
//	Комментарий           - Строка - комментарий рецензента
//	ДатаИсполнения        - Дата - дата выполнения задачи по согласованию рецензентом
//
Процедура ДобавитьРезультатСогласования(Знач ЗадачаИсполнителя,
	                                    Знач Исполнитель,
	                                    Знач РезультатСогласования,
	                                    Знач Комментарий,
	                                    Знач ДатаСобытия,
										Знач НомерИтерации,
										Знач ТочкаМаршрута) Экспорт
	
	НоваяСтрока                       = РезультатыСогласования.Добавить();
	НоваяСтрока.ЗадачаИсполнителя     = ЗадачаИсполнителя;
	НоваяСтрока.Исполнитель           = Исполнитель;
	НоваяСтрока.РезультатСогласования = РезультатСогласования;
	НоваяСтрока.Комментарий           = Комментарий;
	НоваяСтрока.ДатаСобытия           = ДатаСобытия;
	НоваяСтрока.НомерИтерации         = НомерИтерации;
	НоваяСтрока.ТочкаМаршрута         = ТочкаМаршрута;
		
КонецПроцедуры

////#КонецОбласти

////#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Дата согласования должна быть не меньше даты документа
	Если ЗначениеЗаполнено(ДатаСогласования) И ДатаСогласования < НачалоДня(Дата) Тогда
		
		ТекстОшибки = НСтр("ru='Дата согласования должна быть не меньше даты бизнес-процесса %Дата%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Дата%", Формат(Дата,"ДЛФ=DD"));
		
		Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			"ДатаСогласования",
			,
			Отказ);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Предмет) Тогда
	
	Запрос = Новый Запрос("ВЫБРАТЬ
		|	мОтчет.Ссылка КАК Предмет,
		|	ВЫБОР
		|		КОГДА мОтчет.ПометкаУдаления
		|				ИЛИ мОтчет.Согласован
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьОшибкиСогласован,
		|	мОтчет.ПометкаУдаления КАК ПометкаУдаления,
		|	ЕСТЬNULL(СтатусыОтчетов.Статус, ЗНАЧЕНИЕ(Справочник.DMS_СтатусыОтчетовПоРекламнойКампании.ПустаяСсылка)) КАК Статус
		|ИЗ
		|	Документ.DMS_ОтчетПоРекламнойКампании КАК мОтчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.DMS_СтатусыОтчетовПоРекламнойКампании.СрезПоследних КАК СтатусыОтчетов
		|		ПО (СтатусыОтчетов.РекламнаяКампания = мОтчет.РекламнаяКампания)
		|			И мОтчет.Ссылка = СтатусыОтчетов.ОтчетПоКампании
		|ГДЕ
		|	мОтчет.Ссылка = &ДокументОснование");
		
	Запрос.УстановитьПараметр("ДокументОснование", Предмет);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
		// Документ уже согласован или помечен на удаление - нет смысла начинать согласование
		Если Выборка.ЕстьОшибкиСогласован Тогда
			
			ТекстОшибки = НСтр("ru='Отчет %Предмет% не нуждается в согласовании макетов'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Предмет%", Выборка.Предмет);
			
			ВызватьИсключение ТекстОшибки;
			
		ИначеЕсли ЗначениеЗаполнено(Выборка.Статус) И Выборка.Статус <> Справочники.DMS_СтатусыОтчетовПоРекламнойКампании.Заявлен 
			И Выборка.Статус <> Справочники.DMS_СтатусыОтчетовПоРекламнойКампании.БезДействия Тогда 
			
			ТекстОшибки = НСтр("ru='По отчету кампании %Предмет% уже запущен процесс согласования макетов'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Предмет%", Выборка.Предмет);
			
			ВызватьИсключение ТекстОшибки;
			
		ИначеЕсли Выборка.ПометкаУдаления Тогда
			
			ТекстОшибки = НСтр("ru='Отчет %Предмет% не может быть согласован, т.к. помечен на удаление'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Предмет%", Выборка.Предмет);
			
			ВызватьИсключение ТекстОшибки;
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		ЗаполнитьДокументПоОтбору(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.DMS_ОтчетПоРекламнойКампании") Тогда
		ЗаполнитьБизнесПроцессНаОснованииОтчетаПоРекламнойКампании(ДанныеЗаполнения);
	КонецЕсли;
	
	ИнициализироватьБизнесПроцесс();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДатаНачала            = Дата(1,1,1);
	ДатаОкончания         = Дата(1,1,1);
	РезультатСогласования = Перечисления.DMS_РезультатыСогласования.ПустаяСсылка();
		
	РезультатыСогласования.Очистить();
	
	ИнициализироватьБизнесПроцесс();
	
КонецПроцедуры

////#КонецОбласти


////#Область ИнициализацияБизнесПроцесса

Процедура ЗаполнитьБизнесПроцессНаОснованииОтчетаПоРекламнойКампании(Предмет)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
		|	мОтчет.Ссылка КАК Предмет,
		|	ВЫБОР
		|		КОГДА мОтчет.ПометкаУдаления
		|				ИЛИ мОтчет.Согласован
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьОшибкиСогласован,
		|	мОтчет.ПометкаУдаления КАК ПометкаУдаления,
		|	ЕСТЬNULL(СтатусыОтчетов.Статус, ЗНАЧЕНИЕ(Справочник.DMS_СтатусыОтчетовПоРекламнойКампании.ПустаяСсылка)) КАК Статус,
		|	Неопределено КАК Исполнитель
		|ИЗ
		|	Документ.DMS_ОтчетПоРекламнойКампании КАК мОтчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.DMS_СтатусыОтчетовПоРекламнойКампании.СрезПоследних КАК СтатусыОтчетов
		|		ПО (СтатусыОтчетов.РекламнаяКампания = мОтчет.РекламнаяКампания)
		|			И мОтчет.Ссылка = СтатусыОтчетов.ОтчетПоКампании
		|ГДЕ
		|	мОтчет.Ссылка = &ДокументОснование");
	
	Запрос.УстановитьПараметр("ДокументОснование", Предмет);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	// Документ уже согласован или помечен на удаление - нет смысла начинать согласование
	Если Выборка.ЕстьОшибкиСогласован Тогда
		
		ТекстОшибки = НСтр("ru='Отчет %Предмет% не нуждается в согласовании макетов'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Предмет%", Выборка.Предмет);
		
		ВызватьИсключение ТекстОшибки;
		
	ИначеЕсли ЗначениеЗаполнено(Выборка.Статус) И Выборка.Статус <> Справочники.DMS_СтатусыОтчетовПоРекламнойКампании.Заявлен 
		И Выборка.Статус <> Справочники.DMS_СтатусыОтчетовПоРекламнойКампании.БезДействия Тогда 
		
		ТекстОшибки = НСтр("ru='По отчету кампании %Предмет% уже запущен процесс согласования макетов'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Предмет%", Выборка.Предмет);
		
		ВызватьИсключение ТекстОшибки;
		
	ИначеЕсли Выборка.ПометкаУдаления Тогда
		
		ТекстОшибки = НСтр("ru='Отчет %Предмет% не может быть согласован, т.к. помечен на удаление'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Предмет%", Выборка.Предмет);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
КонецПроцедуры

Процедура ЗаполнитьДокументПоОтбору(Знач ДанныеЗаполнения)
	
	Если ДанныеЗаполнения.Свойство("Предмет") Тогда
		
		ТипПредмета = ТипЗнч(ДанныеЗаполнения.Предмет);
		
		Если ТипПредмета = Тип("ДокументСсылка.DMS_ОтчетПоРекламнойКампании") Тогда
			ЗаполнитьБизнесПроцессНаОснованииОтчетаПоРекламнойКампании(ДанныеЗаполнения.Предмет);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьБизнесПроцесс()
	
	Дата		  = ТекущаяДатаСеанса();
	Автор 		  = DMS_РекламныеКампанииСервер.ТекущийПользователь();
	НомерИтерации = 0;
	
	УведомитьИсполнителя = Истина;
	
КонецПроцедуры

////#КонецОбласти

////#Область Прочее

Процедура ЗаполнитьЗадачу(Задача,ТочкаМаршрута,мАвтор,мИсполнитель,мНаименование ="")
	
	Задача.Дата 	= ТекущаяДатаСеанса();
	Задача.Автор 	= мАвтор;
	Задача.Описание = Наименование;
	Задача.Важность = Важность;
	Задача.Предмет  = Предмет;
	
	Задача.Наименование   = ?(мНаименование = "",Наименование,мНаименование);
	Задача.БизнесПроцесс  = ЭтотОбъект.Ссылка;
	Задача.ТочкаМаршрута  = ТочкаМаршрута;
	Задача.Исполнитель    = мИсполнитель;	
		
КонецПроцедуры

////#КонецОбласти

////#Область КартаМаршрута

Процедура СтартПередСтартом(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	ДатаНачала = ТекущаяДатаСеанса();
	
КонецПроцедуры

Процедура ПодготовкаИтерацииСогласованияОбработка(ТочкаМаршрутаБизнесПроцесса)
		
	УстановитьПривилегированныйРежим(Истина);
	
	Отказ = Ложь;                                                                                                  
	
	DMS_РекламныеКампанииСервер.ОтразитьСтатусОтчетаПоРекламнойКампании(Ссылка,Предмет,ТекущаяДатаСеанса(),Справочники.DMS_СтатусыОтчетовПоРекламнойКампании.НаСогласовании,Отказ);
	
	Если Отказ Тогда
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецЕсли; 
	
	НомерИтерации = НомерИтерации + 1;
	
	ПовторитьСогласование = Ложь;
	
	Записать();
	
КонецПроцедуры

Процедура СогласоватьПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;                       
	
	Задача = Задачи.DMS_ЗадачаИсполнителя.СоздатьЗадачу();
	
	Если Наименование = "" И ЗначениеЗаполнено(Предмет) Тогда
		мНаименование = СокрЛП(Предмет);
	Иначе 
		мНаименование = "";
	КонецЕсли; 
	
	ЗаполнитьЗадачу(Задача,БизнесПроцессы.DMS_СогласованиеОтчетовПоРекламнойКампании.ТочкиМаршрута.Согласовать,Автор,Исполнитель,мНаименование);

	ЗадачаСсылка = Задачи.DMS_ЗадачаИсполнителя.ПолучитьСсылку();
	Задача.УстановитьСсылкуНового(ЗадачаСсылка);
	
	ФормируемыеЗадачи.Добавить(Задача);
	
	Если УведомитьИсполнителя И НомерИтерации = 1 Тогда
		DMS_РекламныеКампанииСервер.СформироватьУведомлениеИсполнителяОНовойЗадаче(Задача,ЗадачаСсылка);
	КонецЕсли; 
	
	НоваяСтрока = РезультатыСогласования.Добавить();
	НоваяСтрока.НомерИтерации         = НомерИтерации;
	НоваяСтрока.ЗадачаИсполнителя     = ЗадачаСсылка;
	НоваяСтрока.Исполнитель           = Задача.Исполнитель;
	НоваяСтрока.Комментарий		      = Наименование;
	НоваяСтрока.ДатаСобытия		      = ТекущаяДатаСеанса();
	НоваяСтрока.РезультатСогласования = Перечисления.DMS_РезультатыСогласования.НеСогласовано;
	
КонецПроцедуры

Процедура ПодготовкаИтерацииКомментарийОбработка(ТочкаМаршрутаБизнесПроцесса)
		
	УстановитьПривилегированныйРежим(Истина);
	
	Отказ = Ложь;
	
	DMS_РекламныеКампанииСервер.ОтразитьСтатусОтчетаПоРекламнойКампании(Ссылка,Предмет,ТекущаяДатаСеанса(),Справочники.DMS_СтатусыОтчетовПоРекламнойКампании.КомментарииОтMMR,Отказ);
	
	Если Отказ Тогда
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецЕсли; 
		
	ПовторитьСогласование = Ложь;
	
	Записать();
	
КонецПроцедуры

Процедура ОзнакомитьсяСКомментариемПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	Задача = Задачи.DMS_ЗадачаИсполнителя.СоздатьЗадачу();
	ЗаполнитьЗадачу(Задача,БизнесПроцессы.DMS_СогласованиеОтчетовПоРекламнойКампании.ТочкиМаршрута.ОзнакомитьсяСКомментарием,Исполнитель,Автор);
	
	ЗадачаСсылка = Задачи.DMS_ЗадачаИсполнителя.ПолучитьСсылку();
	Задача.УстановитьСсылкуНового(ЗадачаСсылка);
	
	ФормируемыеЗадачи.Добавить(Задача);
		
	НоваяСтрока = РезультатыСогласования.Добавить();
	НоваяСтрока.НомерИтерации         = НомерИтерации;
	НоваяСтрока.ЗадачаИсполнителя     = ЗадачаСсылка;
	НоваяСтрока.Исполнитель           = Задача.Исполнитель;
	НоваяСтрока.Комментарий		      = Наименование;
	НоваяСтрока.ДатаСобытия		      = ТекущаяДатаСеанса();
	НоваяСтрока.РезультатСогласования = Перечисления.DMS_РезультатыСогласования.ОзнакомленСКомменатрием;

КонецПроцедуры

Процедура ПодготовкаИтерацииОзнакомлениеСКомментариемОбработка(ТочкаМаршрутаБизнесПроцесса)
		
	УстановитьПривилегированныйРежим(Истина);
	
	Отказ = Ложь;
	
	DMS_РекламныеКампанииСервер.ОтразитьСтатусОтчетаПоРекламнойКампании(Ссылка,Предмет,ТекущаяДатаСеанса(),Справочники.DMS_СтатусыОтчетовПоРекламнойКампании.НаСогласовании,Отказ);
	
	Если Отказ Тогда
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецЕсли; 
	
	НомерИтерации = НомерИтерации + 1;
	
	//ПовторитьСогласование = Ложь;
	
	Записать();
	
КонецПроцедуры

Процедура УсловиеСогласованПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = (РезультатСогласования = Перечисления.DMS_РезультатыСогласования.Согласовано);	
КонецПроцедуры

Процедура ЗавершениеПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДатаЗавершения = ТекущаяДатаСеанса();
	
	СправочникОбъект = Предмет.ПолучитьОбъект();
	СправочникОбъект.ОбменДанными.Загрузка = Истина;
	СправочникОбъект.Согласован = Истина;
	СправочникОбъект.Записать();
	
КонецПроцедуры

Процедура ЗавершениеНеСогласованПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	ДатаЗавершения = ТекущаяДатаСеанса();
КонецПроцедуры

Процедура ОтправленКомментарийПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = (РезультатСогласования = Перечисления.DMS_РезультатыСогласования.ОтправленКомментарий);	
КонецПроцедуры

Процедура ПодготовкаИтерацииОзнакомленияОбработка(ТочкаМаршрутаБизнесПроцесса)
		
	УстановитьПривилегированныйРежим(Истина);
	
	Отказ = Ложь;
	
	DMS_РекламныеКампанииСервер.ОтразитьСтатусОтчетаПоРекламнойКампании(Ссылка,Предмет,ТекущаяДатаСеанса(),Справочники.DMS_СтатусыОтчетовПоРекламнойКампании.Согласован,Отказ);
	
	Если Отказ Тогда
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОзнакомитьсяСРезультатомСогласованияПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	Задача = Задачи.DMS_ЗадачаИсполнителя.СоздатьЗадачу();
	ЗаполнитьЗадачу(Задача,БизнесПроцессы.DMS_СогласованиеОтчетовПоРекламнойКампании.ТочкиМаршрута.ОзнакомитьсяСРезультатомСогласования,Исполнитель,Автор);
	
	ЗадачаСсылка = Задачи.DMS_ЗадачаИсполнителя.ПолучитьСсылку();
	Задача.УстановитьСсылкуНового(ЗадачаСсылка);
	
	ФормируемыеЗадачи.Добавить(Задача);
		
	НоваяСтрока = РезультатыСогласования.Добавить();
	НоваяСтрока.НомерИтерации         = НомерИтерации;
	НоваяСтрока.ЗадачаИсполнителя     = ЗадачаСсылка;
	НоваяСтрока.Исполнитель           = Задача.Исполнитель;
	НоваяСтрока.Комментарий		      = Наименование;
	НоваяСтрока.ДатаСобытия		      = ТекущаяДатаСеанса();
	НоваяСтрока.РезультатСогласования = Перечисления.DMS_РезультатыСогласования.Согласовано;

КонецПроцедуры

Процедура ПодготовкаИтерацииОзнакомленияСОтказомОбработка(ТочкаМаршрутаБизнесПроцесса)
		
	УстановитьПривилегированныйРежим(Истина);
	
	Отказ = Ложь;
	
	DMS_РекламныеКампанииСервер.ОтразитьСтатусОтчетаПоРекламнойКампании(Ссылка,Предмет,ТекущаяДатаСеанса(),Справочники.DMS_СтатусыОтчетовПоРекламнойКампании.НеСогласован,Отказ);
	
	Если Отказ Тогда
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецЕсли; 
		
КонецПроцедуры

Процедура ОзнакомитьсяСОтказомПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	Задача = Задачи.DMS_ЗадачаИсполнителя.СоздатьЗадачу();
	ЗаполнитьЗадачу(Задача,БизнесПроцессы.DMS_СогласованиеОтчетовПоРекламнойКампании.ТочкиМаршрута.ОзнакомитьсяСОтказом,Исполнитель,Автор);
	
	ЗадачаСсылка = Задачи.DMS_ЗадачаИсполнителя.ПолучитьСсылку();
	Задача.УстановитьСсылкуНового(ЗадачаСсылка);
	
	ФормируемыеЗадачи.Добавить(Задача);
		
	НоваяСтрока = РезультатыСогласования.Добавить();
	НоваяСтрока.НомерИтерации         = НомерИтерации;
	НоваяСтрока.ЗадачаИсполнителя     = ЗадачаСсылка;
	НоваяСтрока.Исполнитель           = Задача.Исполнитель;
	НоваяСтрока.Комментарий		      = Наименование;
	НоваяСтрока.ДатаСобытия		      = ТекущаяДатаСеанса();
	НоваяСтрока.РезультатСогласования = Перечисления.DMS_РезультатыСогласования.НеСогласовано;

КонецПроцедуры

Процедура ОтправитьЗановоПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ПовторитьСогласование;
КонецПроцедуры

Процедура СогласоватьОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
	Результат = Истина;
КонецПроцедуры

Процедура СогласоватьСДополнениемОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
	Результат = Истина;
КонецПроцедуры

Процедура ОзнакомитьсяСКомментариемОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
	Результат = Истина;
КонецПроцедуры

Процедура ОзнакомитьсяСРезультатомСогласованияОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
	Результат = Истина;
КонецПроцедуры

Процедура ОзнакомитьсяСОтказомПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Результат = Истина;
КонецПроцедуры

Процедура ПодготовкаИтерацииЗавершенияСогласованияОбработка(ТочкаМаршрутаБизнесПроцесса)
		
	УстановитьПривилегированныйРежим(Истина);
	
	Отказ = Ложь;
	
	DMS_РекламныеКампанииСервер.ОтразитьСтатусОтчетаПоРекламнойКампании(Ссылка,Предмет,ТекущаяДатаСеанса(),Справочники.DMS_СтатусыОтчетовПоРекламнойКампании.НеСогласован,Отказ);
	
	Если Отказ Тогда
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецЕсли; 
		
КонецПроцедуры

////#КонецОбласти

#КонецЕсли
