//+обработка событий браузера
&НаКлиенте
Функция ОбработкаСобытия(ДокументHTML,Форма,IDK=0, ТипСобытия = "") Экспорт
	
	Событие = ПолучитьПараметрыСобытияИзДокумента(ДокументHTML);
	Если Событие.Имя = "select" Тогда
		eventНовый(Событие.Параметры,Форма, IDK, ТипСобытия);
	ИначеЕсли Событие.Имя = "eventClick" Тогда
		eventВыбор(Событие.Параметры,Форма); 
	ИначеЕсли Событие.Имя = "eventDrop" Тогда
		eventПеремещение(Событие.Параметры, Форма)
	ИначеЕсли Событие.Имя = "eventResize" Тогда
		eventИзменениеРазмера(Событие.Параметры, Форма)
	ИначеЕсли Событие.Имя = "eventOnContextMenu" Тогда
		
	ИначеЕсли Событие.Имя = "onViewChange" Тогда
		
	КонецЕсли;
	
	Возврат Событие;
	
КонецФункции

&НаКлиенте 
Функция ПолучитьПараметрыСобытияИзДокумента(ДокументHTML)
	
	//Имена событий:
	//	"select" - "создание нового"
	//	"eventClick" - "выбор существующего"
	//	"eventDrop" - "перемещение"
	//	"eventResize" - "изменение размера"
	//	"eventOnContextMenu" - "правая кнопка"
	//	"onViewChange" - "изменение вида календаря"
	
	ПустоеСобытие = Новый Структура("Имя,Параметры","","");

	Попытка
		ИмяСобытия = ДокументHTML.defaultView.eval("eventName");
		Количество = ДокументHTML.defaultView.eval("eventCount");
	Исключение
		ИмяСобытия = "";
		Количество = 0;
	КонецПопытки;
	
	// ----  new for WebKit
	Вебкит = ложь;
	Если НЕ ЗначениеЗаполнено(ИмяСобытия) Тогда
		
		Попытка
			ИмяСобытия = ДокументHTML.defaultView.eventName;
			Количество = ДокументHTML.defaultView.eventCount;
			Вебкит = истина;
		Исключение
			ИмяСобытия = "";
			Количество = 0;
		КонецПопытки;

	КонецЕсли;
	// -----
	
	Если НЕ ЗначениеЗаполнено(ИмяСобытия) Тогда
		Возврат ПустоеСобытие;
	КонецЕсли;
	
	// Из COMОбъекта переводим в массив
	ПараметрыСобытия = Новый Массив;
	Для Индекс = 1 По Количество Цикл
		Если Вебкит Тогда
			ПараметрыСобытия.Добавить( ДокументHTML.defaultView.getEventParam(Формат(Индекс-1,"ЧН=0;ЧГ=")));
		Иначе
			ПараметрыСобытия.Добавить( ДокументHTML.defaultView.eval("getEventParam("+Формат(Индекс-1,"ЧН=0;ЧГ=")+")") );
		КонецЕсли;
	КонецЦикла;
	
	ОчиститьПараметрыСобытияИзДокумента(ДокументHTML);
	
	Событие = Новый Структура("Имя,Параметры", ИмяСобытия, ПараметрыСобытия);
	Если ИмяСобытия = "select" И Количество = 3 Тогда
		Возврат Событие;
	ИначеЕсли ИмяСобытия = "eventClick" И Количество = 1 Тогда
		Возврат Событие;
	ИначеЕсли ИмяСобытия = "eventDrop" И Количество = 4 Тогда
		Возврат Событие;
	ИначеЕсли ИмяСобытия = "eventResize" И Количество = 3 Тогда
		Возврат Событие;
	ИначеЕсли ИмяСобытия = "eventOnContextMenu" И Количество = 2 Тогда
		Возврат Событие;
	ИначеЕсли ИмяСобытия = "onViewChange" И Количество = 2 Тогда
		Возврат Событие;
	Иначе
		Возврат ПустоеСобытие;
	КонецЕсли;
	
КонецФункции

&НаКлиенте 
Процедура ОчиститьПараметрыСобытияИзДокумента(ДокументHTML)
	
	Попытка
		ДокументHTML.parentWindow.eval("clearEventParam()");
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Функция СтруктураИдентификатора(Идентификатор)
	
	Возврат Новый Структура("Префикс,Номер", Лев(Идентификатор,2), Сред(Идентификатор,4));
	
КонецФункции

Функция ТипОбъектаСобытия(ВидыСобытий)
	
	Массив = Новый Массив;
	Массив.Добавить(Справочники.CRM_ВидыСобытий.ОтправкаДокументовВБанк);
	Массив.Добавить(Перечисления.Renault_ОбластиПрименения.ОФУ);
			
	Для Каждого Эл Из ВидыСобытий Цикл 
		Если Массив.Найти(Эл.Значение)<>Неопределено Тогда
			Возврат "ЗД";
		КонецЕсли;
	КонецЦикла;
	Возврат "РЛ";
	
КонецФункции

&НаКлиенте 
Процедура eventНовый(Параметры, Форма, IDK = 0, ТипСобытия = "")
	
	НачалоСобытия = Дата(Параметры[0]);
	ОкончаниеСобытия = Дата(Параметры[1]);
	ВесьДень = Параметры[2];
	
	//вид события определяем по первому элемента списка видов события календаря
	ВидСобытия = Справочники.CRM_ВидыСобытий.Прочее;
	Для Каждого Эл Из Форма.Календарь.ВидыСобытий Цикл
		Если ТипЗнч(Эл.Значение) = Тип("СправочникСсылка.CRM_ВидыСобытий") Тогда
			ВидСобытия = Эл.Значение;
			Прервать
		КонецЕсли;	
	КонецЦикла;
	
	//ОбластиПрименения = Новый Массив;
	//Для Каждого Эл Из Форма.Календарь.ВидыСобытий Цикл
	//	Если ТипЗнч(Эл.Значение) = Тип("ПеречислениеСсылка.Renault_ОбластиПрименения") Тогда ОбластиПрименения.Добавить(Эл.Значение); КонецЕсли;	
	//КонецЦикла;
			
	Если ТипСобытия = "ОФУ" Тогда
		
		ЗначенияЗаполнения=Новый Структура("Дата,ДатаЗакрытия,ВидСобытия,ОбластьПрименения", НачалоСобытия, ОкончаниеСобытия, ВидСобытия, Перечисления.Renault_ОбластиПрименения.ОФУ);
		ОткрытьФорму("Задача.Renault_События.ФормаОбъекта", ЗначенияЗаполнения, Форма);
		
	Иначе
		
		Док = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
		Док.ВидСобытия = ВидСобытия;
		Док.IDK        = IDK;
		Док.ДатаНапоминания = НачалоСобытия;
		Док.Длительность = Окр((ОкончаниеСобытия-НачалоСобытия)/60, 0);
		Док.ПолучитьФорму("ФормаСозданияСобытия",Форма,1).Открыть();
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура eventВыбор(Параметры, Форма)
	
	СтрИд = СтруктураИдентификатора(Параметры[0]);
	Если ТипОбъектаСобытия(Форма.Календарь.ВидыСобытий)= "ЗД" Тогда
		ОткрытьФорму("Задача.Renault_События.ФормаОбъекта", Новый Структура("Ключ", Задачи.Renault_События.НайтиПоНомеру(СтрИд.Номер)), Форма)
	Иначе
		Док = Документы.CRM_СобытияПоРабочимЛистам.НайтиПоНомеру(СтрИд.Номер);
		ФормаЗавершенияСобытия = Док.ПолучитьФорму("ФормаЗавершенияСобытия", Форма);
		Если Док.Обработано Тогда
			ФормаЗавершенияСобытия.ЭлементыФормы.КнопкаУспешно.Доступность = Ложь;
			ФормаЗавершенияСобытия.ЭлементыФормы.КнопкаНеуспешно.Доступность = Ложь;
			ФормаЗавершенияСобытия.ЭлементыФормы.ТабличноеПолеАвтоДляВыдачи.Доступность = Ложь;
			ФормаЗавершенияСобытия.ЭлементыФормы.ДиалогКомментария.Доступность = Ложь;
			ФормаЗавершенияСобытия.ЭлементыФормы.КнопкаЗакрыть.Доступность = Истина;
			ФормаЗавершенияСобытия.ЭлементыФормы.ДатаЗакрытия.Доступность = Истина;
			ФормаЗавершенияСобытия.ЭлементыФормы.ДатаЗакрытия.ТолькоПросмотр = Ложь;
			ФормаЗавершенияСобытия.ЭлементыФормы.Комментарий.ТолькоПросмотр = Истина;
			ФормаЗавершенияСобытия.ЭлементыФормы.Сотрудник.ТолькоПросмотр = Истина;
		КонецЕсли;
		ФормаЗавершенияСобытия.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура eventПеремещение(Параметры, Форма)
	
	СтрИд = СтруктураИдентификатора(Параметры[0]);
	КоличествоДней = Параметры[1];
	КоличествоМинут = Параметры[2];
	ВесьДень = Параметры[3];
	
	Если СтрИд.Префикс = "РЛ" Тогда
		Док = Документы.CRM_СобытияПоРабочимЛистам.НайтиПоНомеру(СтрИд.Номер).ПолучитьОбъект();
		Если Док.ДатаНапоминания < ТекущаяДата() Тогда
			ПоказатьПредупреждение(, "Нельзя переносить прошедшие события!");
			Возврат;
		КонецЕсли;
		Док.ДатаНапоминания = Док.ДатаНапоминания + КоличествоДней*86400 + КоличествоМинут*60;
		Если Док.ДатаНапоминания < ТекущаяДата() Тогда
			ПоказатьПредупреждение(, "Нельзя переносить на прошлое время!");
			Возврат;
		КонецЕсли;
		Док.Записать();
	ИначеЕсли СтрИд.Префикс = "ЗД" Тогда
		Док = Задачи.Renault_События.НайтиПоНомеру(СтрИд.Номер).ПолучитьОбъект();
		Док.Дата = Док.Дата + КоличествоДней*86400 + КоличествоМинут*60;
		Если Док.Дата<ТекущаяДата() Тогда  
			Сообщить("Нелья создавать события задним числом ",СтатусСообщения.Внимание);
			Оповестить("ОбновитьСобытия",,Форма);
			Возврат;
        КонецЕсли;
		Док.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура eventИзменениеРазмера(Параметры, Форма)
	
	СтрИд=СтруктураИдентификатора(Параметры[0]);
	КоличествоДней=Параметры[1];
	КоличествоМинут=Параметры[2];
	
	Если СтрИд.Префикс="РЛ" Тогда
		Док=Документы.CRM_СобытияПоРабочимЛистам.НайтиПоНомеру(СтрИд.Номер).ПолучитьОбъект();
		Док.Длительность=Док.Длительность+КоличествоМинут;
		Док.Записать();
	ИначеЕсли СтрИд.Префикс="ЗД" Тогда
		Док=Задачи.Renault_События.НайтиПоНомеру(СтрИд.Номер).ПолучитьОбъект();
		Док.Длительность=Док.Длительность+КоличествоМинут;
		Если Док.Дата<ТекущаяДата() Тогда 
			Сообщить("Нелья создавать события задним числом ",СтатусСообщения.Внимание);
			Оповестить("ОбновитьСобытия",,Форма);
			Возврат;
        КонецЕсли;
		Док.Записать();
	КонецЕсли;
	
КонецПроцедуры	
//-обработка событий браузера

//+ интерфейс
Функция ПериодСтрокой(Календарь, ОднойСтрокой=Ложь) Экспорт
	
	Если Календарь.ВидКалендаря=1 Тогда //день 
		Возврат Формат(Календарь.ДатаКалендаря,"ДЛФ=DD")
	ИначеЕсли Календарь.ВидКалендаря=2 Тогда //неделя
		Если ОднойСтрокой Тогда
			Возврат Формат(Календарь.НачалоПериода,"ДЛФ=D")+" - "+Формат(Календарь.ОкончаниеПериода,"ДЛФ=D")
		Иначе
			Возврат "с "+Формат(Календарь.НачалоПериода,"ДЛФ=D")+Символы.ПС+"по "+Формат(Календарь.ОкончаниеПериода,"ДЛФ=D") 
		КонецЕсли;
	ИначеЕсли Календарь.ВидКалендаря=3 Тогда //месяц
		Если ОднойСтрокой Тогда
			Возврат Формат(Календарь.НачалоПериода,"ДЛФ=D")+" - "+Формат(Календарь.ОкончаниеПериода,"ДЛФ=D")
		Иначе
			Возврат "с "+Формат(Календарь.НачалоПериода,"ДЛФ=D")+Символы.ПС+"по "+Формат(Календарь.ОкончаниеПериода,"ДЛФ=D")
		КонецЕсли;
	Иначе // повестка дня
	КонецЕсли;
	
КонецФункции

Процедура УстановитьПериод(Календарь) Экспорт
	
	Если Календарь.ВидКалендаря=1 Тогда //день
		Календарь.НачалоПериода=Календарь.ДатаКалендаря;
		Календарь.ОкончаниеПериода=КонецДня(Календарь.ДатаКалендаря);
	ИначеЕсли Календарь.ВидКалендаря=2 Тогда //неделя
		Календарь.НачалоПериода=НачалоНедели(Календарь.ДатаКалендаря);
		Календарь.ОкончаниеПериода=КонецДня(КонецНедели(Календарь.ДатаКалендаря));
	ИначеЕсли Календарь.ВидКалендаря=3 Тогда //месяц
		Календарь.НачалоПериода=НачалоМесяца(Календарь.ДатаКалендаря);
		Календарь.ОкончаниеПериода=КонецДня(КонецМесяца(Календарь.ДатаКалендаря));
	Иначе // повестка дня
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьИнтервалРабочегоВремени(Календарь) Экспорт  //продолжительность рабочего дня пользователя
	
	Если Календарь.Сотрудник.Пустая() Тогда
		Возврат
	КонецЕсли;
	Если Календарь.Сотрудник.ГрафикРаботы.Пустая() Тогда
		Возврат
	КонецЕсли;
	График = Календарь.Сотрудник.ГрафикРаботы;
	
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("График",График);
	Если График.Фиксированный Тогда
		Запрос.УстановитьПараметр("Дата1",Календарь.НачалоПериода);
		Запрос.УстановитьПараметр("Дата2",Календарь.ОкончаниеПериода);
		Запрос.Текст="
		|Выбрать 
		|	Минимум(Час(НачалоРабочегоВремени)) ВремяНачала,
		|	Максимум(Час(КонецРабочегоВремени)) ВремяКонца
		|Из РегистрСведений.ГрафикРаботКалендарный	
		|ГДЕ График=&График И ВидИнтервала=Значение(Справочник.ВидыИнтервалов.Работа) И Дата Между &Дата1 И &Дата2
		|";
	Иначе 
		Запрос.Текст="
		|Выбрать
		|	Минимум(Час(НачалоРабочегоВремени)) ВремяНачала,
		|	Максимум(Час(КонецРабочегоВремени)) ВремяКонца
		|Из Справочник.ГрафикиРаботы.Смещение
		|ГДЕ Ссылка=&График И ВидДня=Значение(Перечисление.ВидДня.Рабочий)
		|";
	КонецЕсли;	
	Выборка=Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Календарь.НачалоРабочегоВремени=Выборка.ВремяНачала;
	Календарь.ОкончаниеРабочегоВремени=Выборка.ВремяКонца;
	
КонецПроцедуры
//- интерфейс
