
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДТ_ВзаиморасчетыСотрудники Приход
	Движения.ДТ_ВзаиморасчетыСотрудники.Записывать = Истина;
	Движения.ДТ_ВзаиморасчетыСотрудники.Очистить();
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Движение = Движения.ДТ_ВзаиморасчетыСотрудники.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
		Движение.Должность = ТекСтрокаНачисления.Должность;
		Движение.Подразделение = Подразделение;
		Движение.Сумма = ТекСтрокаНачисления.Сумма;
		Движение.ВидРасчета = Перечисления.ДТ_ВидыРасчетов.Управленческие;
		
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
