//Модуль полностью закомментирован по задаче //DMSREN-241

//////получает файл PDF от сервиса VAZ
////Функция ДанныеГарантийногоТалона(Автомобиль) Экспорт
////	Перем Ответ;
////	VIN=DMS_Автомобили.Автомобиль(Автомобиль,"VIN");
////	Если DMS_DataExchange.sendMessage(DMS_ОбщиеПовторныеФункции.ПараметрыHTTPСоединения(,Справочники.Производители.VAZ),"ConsolidationHTTP","VAZ_GuaranteeDocs.ГарантийныйТалон",DMS_DataExchange.newPackage(VIN),Ответ) Тогда
////		Возврат ПоместитьВоВременноеХранилище(Ответ)
////	Иначе	
////		Сообщить(Ответ);		 
////		Возврат Неопределено	
////	КонецЕсли
////КонецФункции	

//Функция Паспорт(Контрагент)
//	
//	Запрос=Новый Запрос("Выбрать Ссылка ИЗ Справочник.ПодтверждающиеДокументы ГДЕ Владелец=&Контрагент И НЕ Устаревший И НЕ ПометкаУдаления");
//	Запрос.УстановитьПараметр("Контрагент",Контрагент);
//	Выборка=Запрос.Выполнить().Выбрать();
//	Возврат ?(Выборка.Следующий(),Новый Структура("Дата,Номер,Серия,Выдан",Выборка.Ссылка.ДатаВыдачи,Выборка.Ссылка.Номер,Выборка.Ссылка.Серия,Выборка.Ссылка.КемВыдан),Новый Структура("Дата,Номер,Серия,Выдан",Дата(1,1,1),"","",""))
//	
//КонецФункции


//Функция Телефон(Контрагент)
//	
//	Запрос=Новый Запрос("Выбрать Первые 1 Представление Из РегистрСведений.КонтактнаяИнформация ГДЕ Объект=&Контрагент И Тип=Значение(Перечисление.ТипыКонтактнойИнформации.Телефон) Упорядочить По ЗначениеПоУмолчанию Убыв");
//	Запрос.УстановитьПараметр("Контрагент",Контрагент);
//	Выборка=Запрос.Выполнить().Выбрать();
//	Если Выборка.Следующий() и ЗначениеЗаполнено(Выборка.Представление) Тогда
//		Возврат Выборка.Представление;
//	Иначе
//		ВызватьИсключение "Не заполнен телефон покупателя";
//	КонецЕсли;
//	
//КонецФункции

//Функция Email(Контрагент)
//	
//	Запрос=Новый Запрос("Выбрать Первые 1 Представление Из РегистрСведений.КонтактнаяИнформация ГДЕ Объект=&Контрагент И Тип=Значение(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты) Упорядочить По ЗначениеПоУмолчанию Убыв");
//	Запрос.УстановитьПараметр("Контрагент",Контрагент);
//	Выборка=Запрос.Выполнить().Выбрать();
//	Если Выборка.Следующий() и ЗначениеЗаполнено(Выборка.Представление) Тогда
//		Возврат Выборка.Представление;
//	Иначе
//		ВызватьИсключение "Не заполнен EMAIL покупателя";
//	КонецЕсли;
//	
//КонецФункции

//Функция Адрес(Контрагент)
//	Запрос=Новый Запрос;
//	Запрос.УстановитьПараметр("Контрагент",Контрагент);
//	Запрос.Текст="
//	|Выбрать Первые 1
//	|	Представление
//	|ИЗ(
//	|	Выбрать Первые 1 Представление, 1 Порядок Из РегистрСведений.КонтактнаяИнформация 
//	|	ГДЕ Объект=&Контрагент И ЗначениеПоУмолчанию 
//	|	И Вид В(Значение(Справочник.ВидыКонтактнойИнформации.АдресИностранный),
//	|			Значение(Справочник.ВидыКонтактнойИнформации.АдресПочтовый),
//	|			Значение(Справочник.ВидыКонтактнойИнформации.АдресФактический),
//	|			Значение(Справочник.ВидыКонтактнойИнформации.АдресЮридический))
//	|	Объединить
//	|	Выбрать Первые 1 Представление, 2 Порядок Из РегистрСведений.КонтактнаяИнформация 
//	|	ГДЕ Объект=&Контрагент 
//	|	И Вид В(Значение(Справочник.ВидыКонтактнойИнформации.АдресИностранный),
//	|			Значение(Справочник.ВидыКонтактнойИнформации.АдресПочтовый),
//	|			Значение(Справочник.ВидыКонтактнойИнформации.АдресФактический),
//	|			Значение(Справочник.ВидыКонтактнойИнформации.АдресЮридический))
//	|)ЗП
//	|Упорядочить По Порядок
//	|";	
//	Выборка=Запрос.Выполнить().Выбрать();
//	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Представление) Тогда
//		Возврат Выборка.Представление
//	Иначе
//		ВызватьИсключение "Не заполнен адрес покупателя";
//	КонецЕсли;
//	
//КонецФункции

//Функция Договор(VIN,Дата)
//	Запрос=Новый Запрос("Выбрать Первые 1 Ссылка Из Документ.Renault_Договор.СоставДоговора ГДЕ VIN=&VIN И Ссылка.Дата<=КонецПериода(&Дата,День) Упорядочить По Ссылка.Дата Убыв");
//	Запрос.УстановитьПараметр("VIN",VIN);
//	Запрос.УстановитьПараметр("Дата",Дата);
//	Выборка=Запрос.Выполнить().Выбрать();
//	Возврат ?(Выборка.Следующий(),Выборка.Ссылка,Документы.Renault_Договор.ПустаяСсылка())
//КонецФункции

//Функция CUSTOMER_FIO(Контрагент,Автомобиль)
//	
//	Если Контрагент.ФормаСобственности=Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда
//		Запрос=Новый Запрос;
//		Запрос.УстановитьПараметр("Контрагент",Контрагент);
//		Запрос.УстановитьПараметр("Автомобиль",Автомобиль);
//		Запрос.Текст="Выбрать Первые 1 ДоверенноеЛицо Из РегистрСведений.Renault_Advanced_ДоверенныеЛицаКонтрагентов.СрезПоследних(,Владелец=&Контрагент И Автомобиль=&Автомобиль)";
//		Выборка=Запрос.Выполнить().Выбрать();
//		Возврат ?(Выборка.Следующий(),Выборка.ДоверенноеЛицо.Наименование,"")
//	Иначе 
//		Возврат Контрагент.Наименование 
//	КонецЕсли	
//	
//КонецФункции

//Функция РеализацияПоАвтомобилю(Автомобиль)
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
//	               |	РеализацияАвтомобилейАвтомобили.Ссылка
//	               |ИЗ
//	               |	Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
//	               |ГДЕ
//	               |	РеализацияАвтомобилейАвтомобили.Автомобиль = &Автомобиль
//	               |	И РеализацияАвтомобилейАвтомобили.Ссылка.Проведен";
//	Запрос.УстановитьПараметр("Автомобиль",Автомобиль);
//	Результат = Запрос.Выполнить();
//	Если Результат.Пустой() тогда 
//		возврат Документы.РеализацияАвтомобилей.ПустаяСсылка(); 
//	КонецЕсли;
//	Выборка = Результат.Выбрать();
//	Выборка.Следующий();
//	Возврат Выборка.Ссылка;
//	
//КонецФункции	

//#Область СобытияАВТОВАЗ
////ВАЗовские события проведения и удаление проведения
//Процедура ПодпискаНаСобытие(Источник,Отказ,РежимПроведения="") Экспорт
//	//* для документа приобретение товаров и услуг при отмене проведения установка сво-ва "ПередачаДанныхАвтоВаз" не предусмотрена,
//	// это должно быть по аналогии поступления из обработки.
//	Если НЕ Источник.ДополнительныеСвойства.Свойство("ПередачаДанныхАвтоВаз") Тогда Возврат КонецЕсли;
//	
//	//*проверка выполняется при установке доп сво-ва "ПередачаДанныхАвтоВаз"
//	//Если НЕ DMS_ОбщиеФункцииСервер.ЭтоVAZ(Источник.Организация) Тогда Возврат Истина КонецЕсли; 
//	
//	//Если ТипЗнч(Источник)=Тип("ДокументОбъект.ПриобретениеТоваровУслуг") ИЛИ ТипЗнч(Источник)=Тип("ДокументОбъект.ПоступлениеТоваров") Тогда 
//	//	//из автосклада обработка создание поступления
//	//	Если Не ВыгрузкаПоступленийАвтомобилей(Источник,Отказ) Тогда Сообщить("Передача данных производителю не выполнена") КонецЕсли
//	//ИначеЕсли ТипЗнч(Источник)=Тип("ДокументОбъект.DMS_ОптовыеПродажиАвтомобилей") Тогда
//		Если Не ВыгрузкаОптовойПродажиАвтомобилей(Источник,Отказ) Тогда Сообщить("Передача данных производителю не выполнена") КонецЕсли
//	//ИначеЕсли ТипЗнч(Источник)=Тип("ЗадачаОбъект.DMS_События") Тогда
//	//	Если Не ВыгрузкаВыдачиАвтомобиля(Источник,Отказ) Тогда Сообщить("Передача данных производителю не выполнена") КонецЕсли
//	//КонецЕсли;	
//КонецПроцедуры

//Функция ВыгрузкаОптовойПродажиАвтомобилей(Источник,Отказ) //из DMS_ОптовыеПродажиАвтомобилей 
//	//Если НЕ DMS_ОбщиеФункцииСервер.ЭтоVAZ(Источник.ДилерскийЦентр) Тогда Возврат Истина КонецЕсли;
//	
//	Клиент = Источник.Клиент.BIR;
//	КонтрагентBIR=Источник.Клиент.BIR;
//	
//	Если Не ЗначениеЗаполнено(КонтрагентBIR) Тогда
//		Отказ=Истина;
//		Сообщить("Не заполнен BIR дилера (покупателя)");
//	Иначе
//		//проверка BIR_DNT
//		Для Каждого Автомобиль Из Источник.Состав.ВыгрузитьКолонку("Автомобиль") Цикл
//			BIR_DNT=Автомобиль.BIR_DNT;
//			Если НЕ ПустаяСтрока(BIR_DNT) И BIR_DNT<>КонтрагентBIR Тогда
//				Отказ=Истина;
//				Сообщить("BIR покупателя не равен BIR по версии Дистринет ("+BIR_DNT+"<>"+КонтрагентBIR+")");
//			КонецЕсли;	
//		КонецЦикла;
//	КонецЕсли;
//	
//	Если Отказ Тогда Возврат Ложь КонецЕсли;
//	
//	Массив=Новый Массив; 
//	Для Каждого Стр Из Источник.Автомобили Цикл
//		VIN=Стр.Автомобиль.VIN;
//		Если Не ЗначениеЗаполнено(VIN) Тогда
//			Отказ=Истина;
//			Сообщить("Не найдена информация по автомобилю "+Стр.Автомобиль+" на складе");
//			Возврат Ложь;
//		КонецЕсли;
//		
//		Данные=СтруктураПередачиАтомобиля(VIN,Стр.Автомобиль,Источник.Клиент,Источник.Контрагент,Источник.Договор,Источник.Организация,Источник.ДилерскийЦентр,?(Источник.Проведен,1,0),"51",КонтрагентBIR,Источник.Дата);
//		Если Данные=Неопределено Тогда
//			Отказ=Истина;
//			Возврат Ложь
//		КонецЕсли;
//		
//		Массив.Добавить(Данные);
//	КонецЦикла;	
//	
//	Если ПередачаДанных("LADA_Services.deliveryAuto",Массив) Тогда Возврат Истина
//	Иначе
//		Отказ=Истина;
//		Возврат Ложь
//	КонецЕсли	
//	
//КонецФункции
//Функция ВыгрузкаВыдачиАвтомобиля(Источник,Отказ) //из события Торжественная выдача 
////	//Если НЕ DMS_ОбщиеФункцииСервер.ЭтоVAZ(Источник.ДилерскийЦентр) Тогда Возврат Истина КонецЕсли;
////	
////	////найдем документ выдача по РЛ
////	//Запрос=Новый Запрос("Выбрать Ссылка Из Документ.DMS_ВыдачаАвтомобиля ГДЕ РабочийЛист=&РабочийЛист И Не ПометкаУдаления");
////	//Запрос.УстановитьПараметр("РабочийЛист",Источник.РабочийЛист);
////	
////	//найдем выдачу по событию
////	Выдача=DMS_Продажа.ПолучитьДокументВыдачаПоСобытию(Источник);
////	Если Выдача.Пустая() Тогда
////		Отказ=Истина;
////		Сообщить("Не найден документ выдача автомобиля");
////		Возврат Ложь
////	КонецЕсли;
////	
////	////поиск события выдачи
////	//Запрос=Новый Запрос("Выбрать Событие Из Документ.DMS_ВыдачаАвтомобиля.Этапы ГДЕ Ссылка=&Выдача И Событие.ВидСобытия=Значение(Справочник.DMS_ВидыСобытий.ТоржественнаяВыдача)");
////	//Запрос.УстановитьПараметр("Выдача",Выдача);
////	//Выборка=Запрос.Выполнить().Выбрать();
////	//Если НЕ Выборка.Следующий() Тогда
////	//	Отказ=Истина;
////	//	Сообщить("Не завершен этап выдачи");
////	//	Возврат Ложь
////	//Иначе
////	//	СобытиеВыдачи=Выборка.Событие	
////	//КонецЕсли;
////	
////	VIN=DMS_Автомобили.Автомобиль(Выдача.Автомобиль, "VIN");
////	Если Не ЗначениеЗаполнено(VIN) Тогда
////		Отказ=Истина;
////		Сообщить("Не найдена информация по автомобилю на складе");
////		Возврат Ложь;
////	КонецЕсли;
////	
//	//Данные=СтруктураПередачиАтомобиля(VIN,Выдача.Автомобиль,Выдача.Клиент,Выдача.Контрагент,Выдача.Договор,Выдача.Организация,Выдача.ДилерскийЦентр,?(Источник.Выполнена,1,0),"50",,Источник.ДатаВыполнения);
//	//Если Данные=Неопределено Тогда
//	//	Отказ=Истина;
//	//	Возврат Ложь
//	//КонецЕсли;

////	Массив=Новый Массив; 
////	Массив.Добавить(Данные);
////	
////	Если ПередачаДанных("LADA_Services.deliveryAuto",Массив) Тогда Возврат Истина
////	Иначе
////		Отказ=Истина;
////		Возврат Ложь
////	КонецЕсли	
////	
//КонецФункции
//Функция СтруктураПередачиАтомобиля(Автомобиль,
//	Дилер,
//	OPER_TYPE,
//	PAYTYPE_CODE,
//	ДатаАктаПриемаПередачи='00010101',
//	НомерАктаПриемаПередачи="",
//	ЦенаАвто,
//	ДатаГарТалона='00010101',
//	МенеджерФИО,
//	Покупатель,
//	Корпоративный,	
//	Кредит=Ложь,
//	Утилизация=Ложь,
//	TradeIn=Ложь	
//	)
//	
//	СтрАвто=Новый Структура;
//	
//	ДокументРеализации=РеализацияПоАвтомобилю(Автомобиль);
//	Если ДокументРеализации.Пустая() Тогда Сообщить("Не найдена реализация автомобиля"); Возврат Неопределено КонецЕсли;
//	ДокументПоступления=ПоступлениеПоАвтомобилю(Автомобиль);
//	Если ДокументПоступления.Пустая() Тогда Сообщить("Не найдено поступление автомобиля"); Возврат Неопределено КонецЕсли;
//	Договор=Договор(Автомобиль.VIN,ДокументРеализации.Дата);
//    Если Договор.Пустая() тогда Сообщить("Не найден договор на автомобиль"); Возврат Неопределено КонецЕсли;
//	ДанныеПаспорта 	= Паспорт(Покупатель);
//	Адрес 			= Адрес(Покупатель);
//	Телефон			= Телефон(Покупатель);
//	Email			= Email(Покупатель);
////	Кредит=?(ЗначениеЗаполнено(Договор.КредитныйДоговор), Истина, Ложь);
////	Утилизация=?(ЗначениеЗаполнено(Договор.Утилизация), Истина, Ложь);
////	TradeIn=?(ЗначениеЗаполнено(Договор.ДоговорTradeIn), Истина, Ложь);		
////	
////	//СтрАвто.Вставить("OPER_TYPE",?(Выдача.Проведен,1,0)); //Тип операции. 1-создание новой записи продажи, 0-анулирование записи продажи.
//	СтрАвто.Вставить("OPER_TYPE",OPER_TYPE); //Тип операции. 1-создание новой записи продажи, 0-анулирование записи продажи.
//	СтрАвто.Вставить("VIN",Автомобиль.VIN);
//	СтрАвто.Вставить("GUID_ARRIVAL",Строка(ДокументПоступления.УникальныйИдентификатор())); //идентификатор поступления
//	СтрАвто.Вставить("GUID_DELIVERY",Строка(ДокументРеализации.УникальныйИдентификатор())); //идентификатор реализации
//	СтрАвто.Вставить("GUID_DISTRICT",0); //код региона покупателя
//	СтрАвто.Вставить("ACTIONTYPE_CODE",""); //идентификатор скидки
//	СтрАвто.Вставить("PAYTYPE_CODE",PAYTYPE_CODE);
//	СтрАвто.Вставить("SSDATE",Договор.ДатаДоговора); 
//	СтрАвто.Вставить("SSNO",Договор.НомерДоговора);
//	СтрАвто.Вставить("PSADATE",ДатаАктаПриемаПередачи);
//	СтрАвто.Вставить("PSANO",НомерАктаПриемаПередачи);
//	СтрАвто.Вставить("PRICE",ЦенаАвто);
//	СтрАвто.Вставить("GTDATE", ДатаГарТалона);
//	СтрАвто.Вставить("SALESMAN_FIO",ВРег(МенеджерФИО));
//	
//	СтрАвто.Вставить("CUSTOMER_INN", Покупатель.ИНН);
//	Если Покупатель.ФормаСобственности=Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
//		СтрАвто.Вставить("CUSTOMER_NAME","");
//	    СтрАвто.Вставить("CUSTOMER_FIO",ВРег(Покупатель.Наименование));
//	Иначе
//		СтрАвто.Вставить("CUSTOMER_NAME",ВРег(Покупатель.Наименование));
//	    СтрАвто.Вставить("CUSTOMER_FIO", "");
//	КонецЕсли;
//	
//	СтрАвто.Вставить("CUSTOMER_ADDRESS",?(Адрес=Неопределено,"",Адрес));
//	СтрАвто.Вставить("PASDATE",ДанныеПаспорта.ДатаВыдачи);
//	СтрАвто.Вставить("PASNO",ДанныеПаспорта.Номер);
//	СтрАвто.Вставить("PASSERIA",ДанныеПаспорта.Серия);
//	СтрАвто.Вставить("PASOVD",ДанныеПаспорта.Выдан);
//	СтрАвто.Вставить("CUSTOMER_PHONE",?(ЗначениеЗаполнено(Телефон),Телефон,""));
//	СтрАвто.Вставить("CUSTOMER_MOPHONE",?(ЗначениеЗаполнено(Телефон),Телефон,""));
//	СтрАвто.Вставить("CUSTOMER_EMAIL",?(Email=Неопределено,"",Email));
//	СтрАвто.Вставить("CORPORATIONREC",?(Корпоративный,1,0)); //Признак продажи корпоративным клиентам (0 - нет, 1 - корпоративным клиентам)
//	СтрАвто.Вставить("CREDITREC",Кредит); //Признак продажи  в кредит  (0 - нет, 1 - в кредит)
//	СтрАвто.Вставить("SALEREC",Не Кредит); //Признак продажи за наличные  (0 - нет, 1 - за наличные)
//	СтрАвто.Вставить("SOGLASIEREC", ?(DMS_CRM.СогласиеНаОбработкуПерсональныхДанных(Организация,Клиент)=Неопределено,0,1) ); //Признак Согласие покупателя на обработку персональных данных и участие в опросах.  (0 - нет, 1 - согласен)
//	СтрАвто.Вставить("LADAASSISTANCE","КАРТА НЕ ВЫДАВАЛАСЬ"); //Номер карты LADA Assistance. Если карта не выдана написать КАРТА НЕ ВЫДАВАЛАСЬ
//	СтрАвто.Вставить("LADAINSURANCE",0); //Признак продажи по программе LADA INSURANCE. (0 - нет, 1 - LADA INSURANCE)
//	СтрАвто.Вставить("FLAG_UTIL",?(Утилизация,1,0)); //Признак договор по утилизации (0 - нет, 1 - утилизация)
//	СтрАвто.Вставить("FLAG_TRADEIN",?(TradeIn,1,0)); //Признак договор trade-in (0 - нет, 1 - trade-in)
//	СтрАвто.Вставить("PRIZN_PO_SUDU",0); //Признак оформления продажи по решению суда (0 - нет, 1 - решение суда)
//	СтрАвто.Вставить("ACTION_JSON", JSonАкции(Договор)); 
//	СтрАвто.Вставить("ACTION_XML", XMLАкции(Договор));
//	СтрАвто.Вставить("dealer_bir_code", ДилерскийЦентр.BIR);
//	СтрАвто.Вставить("cust_bir_code", КонтрагентBIR);
//	СтрАвто.Вставить("PRICE_RRC", DMS_Автомобили.ПолучитьСтоимостьБазы(Автомобиль) + DMS_Автомобили.ПолучитьДополнительныеОпцииПроизводителя(Автомобиль).Итог("Стоимость"));
//	Возврат СтрАвто
//КонецФункции

//Процедура ПересчитатьЦенуВариантаКомплектации()
//	
//	ЦенаВариантаКомплектации = 0;
//	Запрос = Новый Запрос;
//	Если ЭтоТрейдИН Тогда

//		Запрос = Новый Запрос;
//		Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ЦеныАвтомобилейСрезПоследних.Цена как ЦенаКлиентская
//		|ИЗ
//		|	РегистрСведений.ЦеныАвтомобилей.СрезПоследних(
//		|			,
//		|			ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)
//		|				И Автомобиль = &Автомобиль) КАК ЦеныАвтомобилейСрезПоследних";
//		Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
//	Иначе
//		
//		Запрос.УстановитьПараметр("Модель", Модель);
//		Запрос.УстановитьПараметр("ВариантКомплектации", Версия);
//		Запрос.УстановитьПараметр("Тариф", ТекущийТариф);
//		Запрос.Текст =
//		"ВЫБРАТЬ
//		|	Renault_ТарифНаКомплектацииАвтомобилей.ЦенаКлиентская
//		|ИЗ
//		|	РегистрСведений.Renault_ТарифНаКомплектацииАвтомобилей.СрезПоследних(, Тариф = &Тариф) КАК Renault_ТарифНаКомплектацииАвтомобилей
//		|ГДЕ
//		|	Renault_ТарифНаКомплектацииАвтомобилей.Модель = &Модель
//		|	И Renault_ТарифНаКомплектацииАвтомобилей.ВариантКомплектации = &ВариантКомплектации
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	Renault_ТарифНаКомплектацииАвтомобилей.Период УБЫВ";
//	КонецЕсли;
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	Если Выборка.Следующий() Тогда
//		ЦенаВариантаКомплектации = Выборка.ЦенаКлиентская;
//	Иначе
//		ЦенаВариантаКомплектации = 0;
//	КонецЕсли;
//	
//КонецПроцедуры

////Функция ВыгрузкаПоступленийАвтомобилей(Источник,Отказ) //подписка на событие проведение и удаление проведения
////	
////	//ТекстОшибки="Передача данных в АТОВАЗ не выполнена."+Символы.ПС;
////	
////	//* уже проверено
////	//Если ТипЗнч(Источник)=Тип("ДокументОбъект.ПриобретениеТоваровУслуг") ИЛИ ТипЗнч(Источник)=Тип("ДокументОбъект.ПоступлениеТоваров") Тогда
////	//	Сообщить("Не верный источник данных");
////	//	Отказ=Истина;
////	//	Возврат Ложь 
////	//КонецЕсли;	
////	
////	//* уже проверено
////	//Если НЕ DMS_ОбщиеФункцииСервер.ЭтоVAZ(Источник.Организация) Тогда 
////	//	Сообщить("Производитель организации "+Источник.Организация+" отличается от допустимого");
////	//	Отказ=Истина;
////	//	Возврат Ложь 
////	//КонецЕсли;
////	
////	BIR=DMS_ДилерскиеЦентры.ДилерскийЦентр(Источник.Организация,"BIR");
////	Если Не ЗначениеЗаполнено(BIR) Тогда
////		Сообщить("Не определен BIR организации "+Источник.Организация);
////		Отказ=Истина;
////		Возврат Ложь
////	КонецЕсли;	
////	
////	Массив=Новый Массив;
////	Для Каждого Стр Из Источник.Товары Цикл
////		Массив.Добавить( Новый Структура("arrivaldate,no,dealer_inn,dealer_filial,dealer_name,vin,firstarrival,guid_arrival,guid_delivery,notes,oper_type,dealer_bir_code",
////			Источник.Дата,
////			Источник.Номер,
////			Источник.Организация.ИНН,
////			BIR, //ПараметрыСеанса.ДилерскийЦентр.BIR,
////			Источник.Организация.НаименованиеПолное, //ПараметрыСеанса.ДилерскийЦентр.НаименованиеДляПечати,
////			DMS_Автомобили.Автомобиль(Стр.Номенклатура,"VIN"),
////			?(ЗначениеЗаполнено(DMS_ОбщиеФункцииСервер.ПолучитьЗначениеДополнительногоРеквизита(Источник.Партнер,"КонтрагентBIR")),0,1),
////			Строка(Источник.Ссылка.УникальныйИдентификатор()),
////			"",
////			Источник.Комментарий,
////			?(Источник.Проведен,1,0),
////			DMS_ДилерскиеЦентры.ДилерскийЦентр(Источник.Организация,"BIR")
////		));
////	КонецЦикла;	
////	
////	Если ПередачаДанных("LADA_Services.arrivalAuto",Массив) Тогда Возврат Истина
////	Иначе
////		Отказ=Истина;
////		Возврат Ложь
////	КонецЕсли
////	
////КонецФункции
//#КонецОбласти

//#Область СлужебныеФункции
////Функция ПередачаДанных(Сервис,Данные,Ошибка="") Экспорт
////	Если НЕ ДанныеКорректны(Данные) Тогда Возврат Ложь КонецЕсли; //проверка данных на неопределено и NULL
////	
////	Если DMS_DataExchange.sendMessage(DMS_ОбщиеПовторныеФункции.ПараметрыHTTPСоединения(,Справочники.Производители.VAZ),,Сервис,DMS_DataExchange.newPackage(Данные),Ошибка) Тогда Возврат Истина
////	Иначе	
////		WriteLogEvent(Сервис,EventLogLevel.Error,,,Ошибка);
////		Сообщить("Ошибка передачи данных "+Сервис+": "+Ошибка,СтатусСообщения.Внимание);
////		Возврат Ложь
////	КонецЕсли
////КонецФункции

////Функция ДанныеКорректны(Данные) //проверка данных на неопределено и NULL
////	Если ТипЗнч(Данные)=Тип("Массив") Тогда
////		ЕстьОшибка=Ложь;
////		Для Каждого Эл Из Данные Цикл
////			Если Не ДанныеКорректны(Эл) Тогда
////				ЕстьОшибка=Истина;
////				Прервать
////			КонецЕсли
////		КонецЦикла;
////		Возврат Не ЕстьОшибка
////	ИначеЕсли ТипЗнч(Данные)=Тип("Структура") Тогда
////		ЕстьОшибка=Ложь;
////		Для Каждого Эл Из Данные Цикл
////			Если Не ДанныеКорректны(Эл.Значение) Тогда
////				ЕстьОшибка=Истина;
////				Сообщить("Ошибка в элементе "+Эл.Ключ);
////				Прервать
////			КонецЕсли	
////		КонецЦикла;
////		Возврат Не ЕстьОшибка
////	ИначеЕсли ТипЗнч(Данные)=Тип("ТаблицаЗначений") Тогда
////		ЕстьОшибка=Ложь;
////		Для Каждого Стр Из Данные Цикл
////			Для Каждого Кол Из Данные.Колонки Цикл
////				Если Не ДанныеКорректны(Стр[Кол.Имя]) Тогда
////					ЕстьОшибка=Истина;
////					Сообщить("Ошибка в колонке "+Кол.Имя);
////					Прервать
////				КонецЕсли	
////			КонецЦикла;
////			Если ЕстьОшибка Тогда Прервать КонецЕсли;
////		КонецЦикла;
////		Возврат Не ЕстьОшибка
////	Иначе
////		Если Данные=NULL или Данные=Неопределено Тогда
////			Сообщить("Не верные данные");
////			Возврат Ложь
////		Иначе Возврат Истина		
////		КонецЕсли
////	КонецЕсли;	
////КонецФункции	

////Функция Скидки(Договор)
////	Если Договор.Пустая() Тогда Возврат "" КонецЕсли;
////	СтрАкции="";
////	Для Каждого Стр Из Договор.КоммерческиеАкции Цикл 
////		СтрАкции=СтрАкции+?(СтрАкции="","",",")+Стр.Акция.Наименование 
////	КонецЦикла;
////	Возврат СтрАкции
////КонецФункции
//Функция JSonАкции(Договор)
//	ЗаписьJSON=Новый ЗаписьJSON;
//    ЗаписьJSON.УстановитьСтроку();
//    ЗаписатьJSON(ЗаписьJSON, СтруктураДоговора(Договор));
//    СтрокаДляОтвета = ЗаписьJSON.Закрыть();
//	Возврат ВРЕГ(СтрокаДляОтвета)
//КонецФункции
//Функция XMLАкции(Договор)
//	ЗаписьXML=Новый ЗаписьXML;
//    ЗаписьXML.УстановитьСтроку();
//	ЗаписьXML.ЗаписатьОбъявлениеXML();
//    СериализаторXDTO.ЗаписатьXML(ЗаписьXML, СтруктураДоговора(Договор));
//    СтрокаДляОтвета = ЗаписьXML.Закрыть();
//	Возврат ВРЕГ(СтрокаДляОтвета)
//КонецФункции
//Функция СтруктураДоговора(Договор)
//	Если Договор=Неопределено Тогда
//		СтруктураОтвета=Новый Структура("Actions",Новый Массив)	
//	Иначе
//		СтруктураОтвета=Новый Структура;
//		МассивАкций=Новый Массив;
//		Для Каждого Стр Из Договор.КоммерческиеАкции Цикл 
//			МассивАкций.Добавить(Новый Структура("Action,Discount,DealerPart",Стр.Акция.КодАкции,Стр.СуммаСкидки,Стр.СуммаСкидкиУчастиеДилера)); 
//		КонецЦикла;	
//		
//		Для Каждого СтрСостав Из Договор.Состав Цикл
//			Для Каждого Стр Из СтрСостав.КоммерческоеПредложение.КоммерческиеАкции Цикл 
//				МассивАкций.Добавить(Новый Структура("Action,Discount,DealerPart",Стр.Акция.КодАкции,Стр.СуммаСкидки,Стр.СуммаСкидкиУчастиеДилера)); 
//			КонецЦикла;	
//		КонецЦикла;	
//		
//		СтруктураОтвета.Вставить("Actions", МассивАкций);
//	КонецЕсли;	
//	Возврат СтруктураОтвета
//КонецФункции	
//#КонецОбласти

//// ШИФРОВАНИЕ //////////////////////////////////////////////////////////////////
////
//Функция GetUSBKeyComponentLocation()

//    Перем Постфикс;
//    СистемнаяИнформация = Новый СистемнаяИнформация;

//    Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 тогда
//        Постфикс = "Win32";
//    ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 тогда
//        Постфикс = "Win64";
//    КонецЕсли;

//    Макет = ПолучитьОбщийМакет("КомпонентаЗащиты_Guardant_" + Постфикс);
//    Если Макет = Неопределено тогда
//        ВызватьИсключение("Макет с образом компоненты защиты не найден");
//    КонецЕсли;

//    Возврат Макет.ПолноеИмя();

//КонецФункции
//////////////////////////////////////////////////////////////////////////////////
