// Общий журнал
Перем Права Экспорт;
Перем Организация Экспорт;

Функция ПолучитьСписокПечатныхФорм() Экспорт
	Возврат Новый СписокЗначений();	
КонецФункции
//Конец необходимых для общих журналов

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ОтказУд = ложь;
	ОбработкаУдаленияПроведения(ОтказУд);
	
	НаборЗаявка = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьНаборЗаписей();
	НаборЗаявка.Отбор.IDK.Установить(РабочийЛист);
	НаборЗаявка.Отбор.ЭтапПродаж.Установить(Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИн);
	НаборЗаявкаОдобрена = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьНаборЗаписей();
	НаборЗаявкаОдобрена.Отбор.IDK.Установить(РабочийЛист);
	НаборЗаявкаОдобрена.Отбор.ЭтапПродаж.Установить(Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнОдобрена);
	НаборЗаявкаВыполнена = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьНаборЗаписей();
	НаборЗаявкаВыполнена.Отбор.IDK.Установить(РабочийЛист);
	НаборЗаявкаВыполнена.Отбор.ЭтапПродаж.Установить(Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнВыполнена);

	Если Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.Черновик Тогда
		Нов = НаборЗаявка.Добавить();
		Нов.IDK = РабочийЛист;
		Нов.Объект = ЭтотОбъект.Ссылка;
		Нов.ДатаВыполнения = ЭтотОбъект.Дата;
		Нов.ДилерскийЦентр = ЭтотОбъект.ДилерскийЦентр;
		Нов.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИн;
		НаборЗаявка.Записать();

		НаборЗаявкаВыполнена.Записать();
		НаборЗаявкаОдобрена.Записать();
	Иначе
		Нов = НаборЗаявка.Добавить();
		Нов.IDK = РабочийЛист;
		Нов.Объект = ЭтотОбъект.Ссылка;
		Нов.ДатаВыполнения = ЭтотОбъект.Дата;
		Нов.ДилерскийЦентр = ЭтотОбъект.ДилерскийЦентр;
		Нов.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИн;
		НаборЗаявка.Записать();
		
		Если Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.Одобрена Тогда
			Нов = НаборЗаявкаОдобрена.Добавить();
			Нов.IDK = РабочийЛист;
			Нов.Объект = ЭтотОбъект.Ссылка;
			Нов.ДатаВыполнения = ЭтотОбъект.Дата;
			Нов.ДилерскийЦентр = ЭтотОбъект.ДилерскийЦентр;
			Нов.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнОдобрена;
			НаборЗаявкаОдобрена.Записать();
	
		КонецЕсли;
		Если Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.Выполнена Тогда
			
			Нов = НаборЗаявкаОдобрена.Добавить();
			Нов.IDK = РабочийЛист;
			Нов.Объект = ЭтотОбъект.Ссылка;
			Нов.ДатаВыполнения = ЭтотОбъект.Дата;
			Нов.ДилерскийЦентр = ЭтотОбъект.ДилерскийЦентр;
			Нов.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнОдобрена;
			НаборЗаявкаОдобрена.Записать();

			
			Нов = НаборЗаявкаВыполнена.Добавить();
			Нов.IDK = РабочийЛист;
			Нов.Объект = ЭтотОбъект.Ссылка;
			Нов.ДатаВыполнения = ЭтотОбъект.Дата;
			Нов.ДилерскийЦентр = ЭтотОбъект.ДилерскийЦентр;
			Нов.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнВыполнена;
			НаборЗаявкаВыполнена.Записать();

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_ВоронкаПродаж.IDK,
	               |	CRM_ВоронкаПродаж.ЭтапПродаж,
	               |	CRM_ВоронкаПродаж.ДатаВыполнения,
	               |	CRM_ВоронкаПродаж.Объект
	               |ИЗ
	               |	РегистрСведений.CRM_ВоронкаПродаж КАК CRM_ВоронкаПродаж
	               |ГДЕ
	               |	CRM_ВоронкаПродаж.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Запись.Удалить();
		КонецЕсли;
	КонецЦикла;
		//Оповестить("ОбновитьРабочийЛист");
	
КонецПроцедуры

	Процедура УстановитьСтатус(вхСтатус) Экспорт
	
	Статус = вхСтатус;
	Если Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.Выполнена Тогда
		Черновик=Ложь;
		Одобрена = Истина;
		Закрыта = Истина;
		ВыполненаУспешно = Истина;
	ИначеЕсли  Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.НаРассмотрении Тогда
		Черновик=Ложь;
		Одобрена = Ложь;
		Закрыта = Ложь;
		ВыполненаУспешно = Ложь;
	ИначеЕсли  Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.Одобрена Тогда
		Черновик=Ложь;
		Одобрена = Истина;
		Закрыта = Ложь;
		ВыполненаУспешно = Ложь;
	ИначеЕсли  Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.Отменена Тогда
		Черновик=Ложь;
		//Одобрена = Ложь;
		Закрыта = Истина;
		ВыполненаУспешно = Ложь;
	ИначеЕсли  Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.Черновик Тогда
		Черновик=Истина;
		Одобрена = Ложь;
		Закрыта = Ложь;
		ВыполненаУспешно = Ложь;
	Иначе
		Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.Черновик;
		Черновик=Истина;
		Одобрена = Ложь;
		Закрыта = Ложь;
		ВыполненаУспешно = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры
