&НаКлиенте
Процедура ВыполнитьЗапрос(Команда)
	
	// Создаем HTTPСоединение, параметры оставляем по умолчанию
	Соединение = Новый HTTPСоединение(СерверДляЗапроса);     
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	// Запросим имя файла, который будет сохранен. По умолчанию расширение png
	СтрФильтр = НСтр("ru = 'Файл'") + "(*."+"png"+")|*."+ "png";       
	ДиалогОткрытияФайла.Фильтр = СтрФильтр;
	
	ДиалогОткрытияФайла.Заголовок = "Укажите имя файла";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		// Выполнить GET запрос:
		Соединение.Получить(ТекстДляЗапроса, ДиалогОткрытияФайла.ПолноеИмяФайла);      
		Сообщить("Удачно выполнен GET запрос!");
	Иначе
		Сообщить("Не выбран файл!");
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СерверДляЗапроса = "programmist1s.ru";
	ТекстДляЗапроса = "/wp-content/themes/govpress-new/images/GOODWILL.png";
	
КонецПроцедуры
