
&НаКлиенте
Процедура ВидыРемонтаЦветФонаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ФормаВыбора = Обработки.Renault_ФормаВыбораЦвета.Создать().ПолучитьФорму("ФормаВыбораОбычная");
	ФормаВыбора.РедактируемыйЦвет = Элементы.ВидыРемонта.ТекущиеДанные.ЦветФона;
	
	ЦветФона = ФормаВыбора.ОткрытьМодально();
	Если ЦветФона<>Неопределено Тогда
		Элементы.ВидыРемонта.ТекущиеДанные.ЦветФона = ЦветФона;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПоляЦвета(Элемент)
	
	текЦвет = ЭтаФорма[Элемент.Имя];
		
	Запись[Элемент.Имя] = Renault_Открытый.ЦветВСтроку(текЦвет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПоляВысоты(Элемент)
	
	текВысота = ЭтаФорма[Элемент.Имя];
		
	Запись[Элемент.Имя] = текВысота;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДополнитьНаСервере();
	// Вставить содержимое обработчика.
	//РеквизитыЗаписи = ЭтаФорма.ПолучитьРеквизиты("Запись");
	////	//Элементы.ЦветЗапланированнойРаботы;
	////гром = 1;
	//////ОтобразитьВсеЦвета();
	//////РеквизитыФормы = ЭтаФорма.ПолучитьРеквизиты();	
	////ДобавРеквизиты = Новый Массив();
	////Для Каждого Ресурс Из РеквизитыЗаписи Цикл
	////	Если Найти(Ресурс.Имя,"Цвет") = 1 Тогда
	////		ТекТип = Новый ОписаниеТипов("Цвет");
	////		ТекРеквизит = Новый РеквизитФормы(Ресурс.Имя,ТекТип);
	////		ДобавРеквизиты.Добавить(ТекРеквизит);
	////	КонецЕсли;
	////КонецЦикла;
	////ЭтаФорма.ИзменитьРеквизиты(ДобавРеквизиты);
	//Для Каждого Ресурс Из РеквизитыЗаписи Цикл
	//	Если Найти(Ресурс.Имя,"Цвет") = 1 Тогда
	//		ТекТип = Новый ОписаниеТипов("Цвет");
	//		Поиск = Элементы.Найти(Ресурс.Имя);
	//		Если Не(Поиск = Неопределено) Тогда
	//			Поиск.УстановитьДействие("ПриИзменении","ПриИзмененииПоляЦвета");
	//			Поиск.УстановитьДействие("Очистка","ПоляЦветаОчистка");
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	//ВостановитьВсеЦвета();
	////ЗначениеВРеквизитФормы(Запись,"Запись");
	//		ТекЗначение = Запись[Ресурс.Имя];
	//		Если ТипЗнч(ТекЗначение) = Тип("Строка") Тогда
	//			Если ЗначениеЗаполнено(Запись[Ресурс.Имя]) Тогда
	//				ИмяРекв = ИмяСвязанногоРеквизитаЦвета(Ресурс.имя,РеквизитыФормы);
	//				Если ЗначениеЗаполнено(ИмяРекв) тогда
	//					ЭтаФорма[ИмяРекв] = Renault_Открытый.ПолучитьЦветПоСтроке(Запись[Ресурс.Имя]);
	//				КонецЕсли;
	//				
	//			КонецЕсли;
	//			
	//		КонецЕсли;
	//		
	//	КонецЕсли;	
	//КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьНаСервере()
	
	РеквизитыЗаписи = ЭтаФорма.ПолучитьРеквизиты("Запись");
	Для Каждого Ресурс Из РеквизитыЗаписи Цикл
		Если Найти(Ресурс.Имя,"Цвет") = 1 Тогда
			ТекТип = Новый ОписаниеТипов("Цвет");
			Поиск = Элементы.Найти(Ресурс.Имя);
			Если Не(Поиск = Неопределено) Тогда
				Поиск.УстановитьДействие("ПриИзменении","ПриИзмененииПоляЦвета");
				Поиск.УстановитьДействие("Очистка","ПоляЦветаОчистка");
            КонецЕсли;
			
		ИначеЕсли Найти(Ресурс.Имя, "Высота") = 1 Тогда
			ТекТип = Новый ОписаниеТипов("Число");
			Поиск = Элементы.Найти(Ресурс.Имя);
			Если Не(Поиск = Неопределено) Тогда
				Поиск.УстановитьДействие("ПриИзменении","ПриИзмененииПоляВысоты");
				Поиск.УстановитьДействие("Очистка","ПоляВысотОчистка");
			КонецЕсли;
			
		КонецЕсли;	
			
	КонецЦикла;
	ВостановитьВсеЦвета();
	
	НаборПоВидамРемонта = РегистрыСведений.DMS_ЦветаВидовРемонта.СоздатьНаборЗаписей();
	НаборПоВидамРемонта.Отбор.Пользователь.Установить(Запись.Пользователь);
	НаборПоВидамРемонта.Прочитать();
	
	Для Каждого Стр Из НаборПоВидамРемонта Цикл
		НовСтр = ВидыРемонта.Добавить();
		НовСтр.ВидРемонта = Стр.ВидРемонта;
		НовСтр.ЦветФона   = Renault_Открытый.ПолучитьЦветПоСтроке(Стр.ЦветФона);
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Функция ИмяСвязанногоРеквизитаЦвета(ИскомоеИмя,РеквизитыФормы = Неопределено)
	
	Если не ЗначениеЗаполнено(РеквизитыФормы) Тогда
		РеквизитыФормы = ЭтаФорма.ПолучитьРеквизиты();
	КонецЕсли;
	
	Для Каждого Рекв Из РеквизитыФормы Цикл
		Если Рекв.Имя = ИскомоеИмя Тогда
			Возврат Рекв.Имя;
		КонецЕсли;
	КонецЦикла;
    Возврат Неопределено;
	
КонецФункции


Функция СтруктураЦветовПоУмолчанию();
	
	СтруктураЦветов = Новый Структура;
		
	СтруктураЦветов.Вставить("ЦветФонаМастера", Новый Цвет(204, 255, 204));
	СтруктураЦветов.Вставить("ЦветФонаМастераЗаявка", Новый Цвет(230, 230, 220));
	СтруктураЦветов.Вставить("ЦветФонаМастераВработе", Новый Цвет(200, 250, 160));
	
	СтруктураЦветов.Вставить("ЦветФонаМойка", Новый Цвет(214, 223, 239));
	СтруктураЦветов.Вставить("ЦветФонаМойкаЗаявка", Новый Цвет(214, 223, 239));
	СтруктураЦветов.Вставить("ЦветФонаМойкаВРаботе", Новый Цвет(200, 250, 160));
	
	СтруктураЦветов.Вставить("ЦветФонаРемонт", Новый Цвет(255, 213, 118));
	СтруктураЦветов.Вставить("ЦветФонаРемонтЗаявка", Новый Цвет(230, 230, 220));
	СтруктураЦветов.Вставить("ЦветФонаРемонтВработе", Новый Цвет(200, 250, 160));
	
	//Цвета работ:
	СтруктураЦветов.Вставить("ЦветЗапланированнойРаботы", Новый Цвет(160, 255, 80));
	СтруктураЦветов.Вставить("ЦветПросроченнойРаботы", Новый Цвет(255, 115, 115));
	СтруктураЦветов.Вставить("ЦветАктивнойРаботыПлан", Новый Цвет(255,255,92));
	СтруктураЦветов.Вставить("ЦветАктивнойРаботыФакт", Новый Цвет(255, 153, 70));
	СтруктураЦветов.Вставить("ЦветПриостановленнойРаботы", Новый Цвет(187, 187, 187));
	СтруктураЦветов.Вставить("ЦветЗаконченойРаботы", Новый Цвет(255, 255, 255));
	СтруктураЦветов.Вставить("ЦветРаботыОбед", Новый Цвет(255, 255, 255));
	СтруктураЦветов.Вставить("ЦветРаботыПростой", Новый Цвет(255, 255, 255));
	
	СтруктураЦветов.Вставить("ЦветНеЗапланированнойРаботыВТаблице", Новый Цвет(255,115,115));
	СтруктураЦветов.Вставить("ЦветЗапланированнойРаботыВТаблице", Новый Цвет(255,255,255));
	СтруктураЦветов.Вставить("ЦветЖалобы", Новый Цвет(127,0,55));
	
	СтруктураЦветов.Вставить("ЦветВыделенияФонаПоКлиенту", Новый Цвет(220, 220, 220));
	СтруктураЦветов.Вставить("ЦветФонаПодменныйАвто", Новый Цвет(200, 250, 160));
	СтруктураЦветов.Вставить("ЦветФонаНакладок", Новый Цвет(230, 230, 220));
	СтруктураЦветов.Вставить("ЦветФонаНакладокВнеФокуса", Новый Цвет(255,255,255));
	
	СтруктураЦветов.Вставить("ЦветФонаРемонтНовый", Новый Цвет(255, 213, 118));
	
	СтруктураЦветов.Вставить("ЦветЗапланированнойВыдачи", Новый Цвет(130, 225, 50));
	СтруктураЦветов.Вставить("ЦветПросроченнойВыдачи", Новый Цвет(225, 85, 85));
	
	СтруктураЦветов.Вставить("ЦветФонаДополнительныхПараметровСменыАвтосервиса", Новый Цвет(201,230,246));
	

	Возврат СтруктураЦветов;
	
КонецФункции

&НаКлиенте
Процедура ПоляЦветаОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЦветаУмолч = СтруктураЦветовПоУмолчанию();
	
	// { DMSREN-302 Болдарев Д.Е. от 10.02.2020  
	// Ошибка, если цвет по умолчанию не задан
	// ЭтаФорма[Элемент.Имя] = ЦветаУмолч[Элемент.Имя];
	ЭтаФорма[Элемент.Имя] = ?(ЦветаУмолч.Свойство(Элемент.Имя), ЦветаУмолч[Элемент.Имя], Новый Цвет());
	// } DMSREN-302 Болдарев Д.Е. от 10.02.2020. 
	
	ПриИзмененииПоляЦвета(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПоляВысотОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЦветаУмолч = СтруктураВысотПоУмолчанию();
	ЭтаФорма[Элемент.Имя] = ЦветаУмолч[Элемент.Имя];
	ПриИзмененииПоляВысоты(Элемент);
КонецПроцедуры


&НаКлиенте
Процедура ВостановитьВсеПоУмолчанию(Команда)
	ВостановитьВсеЦвета(Истина);
	ВосстановитьВсеВысоты(Истина);
	ВосстановитьПрочиеНастройки(Истина);
	
КонецПроцедуры

Процедура ОтобразитьВсеЦвета()
	
	РеквизитыЗаписи = ЭтаФорма.ПолучитьРеквизиты("Запись");
	РеквизитыФормы = ЭтаФорма.ПолучитьРеквизиты();	
	
	Для Каждого Ресурс Из РеквизитыЗаписи Цикл
		Если Найти(Ресурс.Имя,"Цвет") = 1 Тогда
			ТекЗначение = Запись[Ресурс.Имя];
			Если ТипЗнч(ТекЗначение) = Тип("Строка") Тогда
				Если ЗначениеЗаполнено(Запись[Ресурс.Имя]) Тогда
					ИмяРекв = ИмяСвязанногоРеквизитаЦвета(Ресурс.имя,РеквизитыФормы);
					Если ЗначениеЗаполнено(ИмяРекв) тогда
						ЭтаФорма[ИмяРекв] = Renault_Открытый.ПолучитьЦветПоСтроке(Запись[Ресурс.Имя]);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли Найти(Ресурс.Имя, "Высота") = 1 Тогда
			ТекЗначение = Запись[Ресурс.Имя];
			Если ТипЗнч(ТекЗначение) = Тип("Число") Тогда
				Если ЗначениеЗаполнено(Запись[Ресурс.Имя]) Тогда
					ИмяРекв = ИмяСвязанногоРеквизитаЦвета(Ресурс.имя,РеквизитыФормы);
					Если ЗначениеЗаполнено(ИмяРекв) тогда
						ЭтаФорма[ИмяРекв] = Запись[Ресурс.Имя];
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

Процедура ВостановитьВсеЦвета(ЗаменятьЦвета = ЛОЖЬ)
	
	ЦветаПоУм = СтруктураЦветовПоУмолчанию();
	Для Каждого Цвет Из ЦветаПоУм Цикл
		Если ЗаменятьЦвета = Истина ИЛИ 
			(Не ЗначениеЗаполнено(Запись[Цвет.Ключ])) Тогда
			Запись[Цвет.Ключ] = Renault_Открытый.ЦветВСтроку(Цвет.Значение);
		КонецЕсли;
	КонецЦикла;	
	ОтобразитьВсеЦвета();

	
КонецПроцедуры 

Процедура ВосстановитьВсеВысоты(ЗаменятьВысоты = Ложь)
	
	ВысотыПоУм = СтруктураВысотПоУмолчанию();
	
	Для Каждого Выс из ВысотыПоУм Цикл
		
		Запись[Выс.Ключ] = Выс.Значение;
		
	КонецЦикла;
	ОтобразитьВсеЦвета();

	
КонецПроцедуры

Процедура ВосстановитьПрочиеНастройки(ЗаменятьНастройки = Ложь)
	
	ЭтаФорма.ПросмотрЦветовДругихПользователей = Ложь;
	
КонецПроцедуры

Функция СтруктураВысотПоУмолчанию();
	
	СтруктураВысот = Новый Структура;

	СтруктураВысот.Вставить("ВысотаСтрокиМастера", 12);
	СтруктураВысот.Вставить("ВысотаСтрокиЦех", 20);
	СтруктураВысот.Вставить("ВысотаСтрокимойка", 12);
	СтруктураВысот.Вставить("ВысотаСтрокиПодменка", 12);
	
	Возврат СтруктураВысот;
	
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(Запись.Пользователь) Тогда
		Запись.Пользователь = ПараметрыСеанса.Пользователь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РедактируемыйЦвет", ЭтаФорма[Элемент.Имя]);
	
	//ОткрытьФорму("Обработка.Renault_ФормаВыбораЦвета.Форма.ФормаВыбораУправляемая", ПараметрыОткрытия); 
	ФормаВыбора = Обработки.Renault_ФормаВыбораЦвета.Создать().ПолучитьФорму("ФормаВыбораОбычная");
	ФормаВыбора.РедактируемыйЦвет = ЭтаФорма[Элемент.Имя];
	
	НовыйЦвет = ФормаВыбора.ОткрытьМодально();
	
	Если НовыйЦвет<>Неопределено Тогда	
		ЭтаФорма[Элемент.Имя] = НовыйЦвет;		
		Запись[Элемент.Имя] = Renault_Открытый.ЦветВСтроку(НовыйЦвет);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	НаборПоВидамРемонта = РегистрыСведений.DMS_ЦветаВидовРемонта.СоздатьНаборЗаписей();
	НаборПоВидамРемонта.Отбор.Пользователь.Установить(ТекущийОбъект.Пользователь);
	НаборПоВидамРемонта.Прочитать();
	НаборПоВидамРемонта.Очистить();
	
	Для Каждого Стр Из ВидыРемонта Цикл
		НовСтр = НаборПоВидамРемонта.Добавить();
		НовСтр.Пользователь = ТекущийОбъект.Пользователь;
		НовСтр.ВидРемонта = Стр.ВидРемонта;
		НовСтр.ЦветФона   =  Renault_Открытый.ЦветВСтроку(Стр.ЦветФона);
	КонецЦикла;
	
	НаборПоВидамРемонта.Записать();
		
КонецПроцедуры
