
&НаКлиенте
Процедура ПриОткрытии(Отказ) ДоступностьЭлементов() КонецПроцедуры

Процедура ДоступностьЭлементов()
	Элементы.ЗначениеСсылка.Видимость=Объект.ВидПравила=Перечисления.Renault_ВидыПравил.Ссылка;
	Элементы.грВыражение.Видимость=НЕ Объект.ВидПравила=Перечисления.Renault_ВидыПравил.Ссылка;
	Элементы.РезультатВычисления.Видимость=НЕ Объект.ВидПравила=Перечисления.Renault_ВидыПравил.Ссылка;
	
	Если Объект.ВидПравила=Перечисления.Renault_ВидыПравил.Булево 
	ИЛИ Объект.ВидПравила=Перечисления.Renault_ВидыПравил.Дата
	ИЛИ Объект.ВидПравила=Перечисления.Renault_ВидыПравил.Строка
	ИЛИ Объект.ВидПравила=Перечисления.Renault_ВидыПравил.Число
	Тогда Элементы.РезультатВычисления.Видимость=Истина Иначе Элементы.РезультатВычисления.Видимость=Ложь КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидПравилаПриИзменении(Элемент) 
	ДоступностьЭлементов(); 
	ЗначениеСтрокаОкончаниеВводаТекста("",Объект.ЗначениеСтрока,"","",""); 
КонецПроцедуры

//&НаКлиенте
//Процедура ЗначениеСтрокаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
//	СтандартнаяОбработка=Истина;
//	Справочники.Renault_Правила.ЗначениеКорректно(Объект.ВидПравила,Текст,РезультатВычисления);
//	Объект.ЗначениеСтрока=Текст;
//КонецПроцедуры

&НаКлиенте
Процедура ЗначениеСтрокаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	СтандартнаяОбработка=Истина;
	Справочники.Renault_Правила.ЗначениеКорректно(Объект.ВидПравила,Текст,РезультатВычисления);
	Объект.ЗначениеСтрока=Текст;
КонецПроцедуры

&НаКлиенте
Процедура кнКомментарий(Команда) Справочники.Renault_Правила.УстановитьКомментарий(ЭтаФорма,Элементы.ЗначениеСтрока,Объект.ЗначениеСтрока) КонецПроцедуры
&НаКлиенте
Процедура кнУдалитьКомментарий(Команда) Справочники.Renault_Правила.УдалитьКомментарий(ЭтаФорма,Элементы.ЗначениеСтрока,Объект.ЗначениеСтрока) КонецПроцедуры

&НаКлиенте
Процедура кнСправка(Команда) Renault_ПередачаДанныхВСторонниеСистемы.ПоказатьСправку(ЭтаФорма,Справочники.Renault_КонвертацияДанных.ПолучитьМакет("СправкаКонвертацияДанных").ПолучитьТекст(),"Справка по составлению текста правил") КонецПроцедуры

&НаКлиенте
Процедура кнОчиститьЗапрос(Команда) Объект.ЗначениеСтрока="" КонецПроцедуры
