
&НаКлиенте
Процедура ФиксацияЗвонка(Команда)                
	
	РеквизитыФормы = Новый Структура("ВремяЗвонка,ИнтересКлиента,НазначенВизит,ТекстОтветаПоТелефону",
										"Время звонка", "интерес клиента", "визит назначен ", "текст ответа");	
	
	//проверка обязательных полей
	
	Если НазначенВизит = Истина Тогда
		РеквизитыФормы.Вставить("ЦельВизита", "цель визита");
		РеквизитыФормы.Вставить("ДатаВизита", "дата визита");
	КонецЕсли;
	
	ТекстОтвета = "";	НеЗаполнено = "";
	Для Каждого КлючИЗНачение ИЗ РеквизитыФормы Цикл
		
		Если НЕ ЗначениеЗаполнено(ЭтаФорма[КлючИЗНачение.Ключ]) Тогда
			НеЗаполнено  = НеЗаполнено + ?(НеЗаполнено = "", "", ", " + Символы.ПС) + КлючИЗНачение.Значение;
		КонецЕсли;
		ТекстОтвета = ТекстОтвета + ?(ТекстОтвета = "", "", ", ") + СокрЛП(КлючИЗНачение.ЗНачение) + ": " + СокрЛП(ЭтаФорма[КлючИЗНачение.Ключ]);
	КонецЦикла;
	
	Если НеЗаполнено <> "" Тогда
		Сообщить("Имеются незаполненные поля:");
		Сообщить(НеЗаполнено);
		Возврат;
	КОнецЕсли;
		
	ОтправкаУспешна = ОтправитьОтвет();
		
	//
	Закрыть(Новый Структура("Результат, Лид_Ответ", Истина, ТекстОтвета));
	
КонецПроцедуры       

&НаСервере
Функция ОтправитьОтвет()
	
	Возврат Renault_ОнлайнКонсультант.ОтправитьОтветТелефонНаЛидВебСервис(Лид_ТекущийЛид, ТекстОтвета);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоШаблону(Команда)

	// в старой форме никуда не вело: обработчика не было, справочник Шаблоны ответов на лиды не сууществует	
	
    // как сделано в старой форме     
	//ШаблонОбъект = ШаблонСсылка.ПолучитьОбъект();
	//Лид_ЗаголовокОтветаПоТелефону = ШаблонОбъект.ЗаголовокПисьма;
	//Лид_ТекстОтветаПоТелефону = ШаблонОбъект.ТекстОтвета;
	//
	//ВыполнитьЗаменуТеговШаблона(Лид_ЗаголовокОтветаПоТелефону);
	//ВыполнитьЗаменуТеговШаблона(Лид_ТекстОтветаПоТелефону);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    // заполнение реквизитов со списками
	//Интерес клиента: выбор из списка (Тест-драйв, Покупка а/м, Обслуживание и ремонт автомобиля, 
	//Покупка аксессуаров и запчастей, Запрос информации, Другое)
	ЭтаФорма.Элементы.ИнтересКлиента.СписокВыбора.Очистить();
	ЭтаФорма.Элементы.ИнтересКлиента.СписокВыбора.Добавить("Тест-драйв");
	ЭтаФорма.Элементы.ИнтересКлиента.СписокВыбора.Добавить("Покупка автомобиля");
	ЭтаФорма.Элементы.ИнтересКлиента.СписокВыбора.Добавить("Обслуживание и ремонт автомобиля");
	ЭтаФорма.Элементы.ИнтересКлиента.СписокВыбора.Добавить("Покупка аксессуаров и запчастей");
	ЭтаФорма.Элементы.ИнтересКлиента.СписокВыбора.Добавить("Запрос информации");
	ЭтаФорма.Элементы.ИнтересКлиента.СписокВыбора.Добавить("Другое");
	
	
	//Цель визита: выбор из списка (Тест-драйв, Коммерческое предложение, Ознакомление с автомобилем, 
	//ТО, Обслуживание автомобиля (другое), Кузовной ремонт, Покупка аксессуаров, Покупка запчастей, Другое)
	ЭтаФорма.Элементы.ЦельВизита.СписокВыбора.Очистить();
	ЭтаФорма.Элементы.ЦельВизита.СписокВыбора.Добавить("Тест-драйв");
	ЭтаФорма.Элементы.ЦельВизита.СписокВыбора.Добавить("Коммерческое предложение");
	ЭтаФорма.Элементы.ЦельВизита.СписокВыбора.Добавить("Ознакомление с автомобилем");
	ЭтаФорма.Элементы.ЦельВизита.СписокВыбора.Добавить("Техобслуживание");
	ЭтаФорма.Элементы.ЦельВизита.СписокВыбора.Добавить("Обслуживание автомобиля (другое)");
	ЭтаФорма.Элементы.ЦельВизита.СписокВыбора.Добавить("Кузовной ремонт");
	ЭтаФорма.Элементы.ЦельВизита.СписокВыбора.Добавить("Покупка аксессуаров");
	ЭтаФорма.Элементы.ЦельВизита.СписокВыбора.Добавить("Покупка запчастей");
	ЭтаФорма.Элементы.ЦельВизита.СписокВыбора.Добавить("Другое");

		
	Если Параметры.Свойство("Лид_ТекущийЛид") Тогда
		Лид_ТекущийЛид = Параметры.Лид_ТекущийЛид;
	КонецЕсли;
	//Элементы.ЗаполнитьПоШаблону.Доступность = ЗначениеЗаполнено(Лид_ТекущийЛид);

	
КонецПроцедуры

&НаКлиенте
Процедура ОтменаОтвета(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЦельВизитаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
  	
КонецПроцедуры

&НаКлиенте
Процедура ИнтересКлиентаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
    
	
КонецПроцедуры

&НаКлиенте
Процедура НазначенВизитПриИзменении(Элемент)
	
    ЭтаФорма.Элементы.ЦельВизита.Доступность = НазначенВизит;
	ЭтаФорма.Элементы.ДатаВизита.Доступность = НазначенВизит;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    НазначенВизит = Истина; 
	НазначенВизитПриИзменении(Неопределено);
	
КонецПроцедуры
