
Функция ПолучитьДанныеПечати(знач МассивДокументов, знач МассивИменМакетов) Экспорт
	
	ДанныеПоВсемОбъектам = Новый Соответствие;
	
	Для Каждого ОбъектСсылка Из МассивДокументов Цикл
		ДанныеОбъектаПоМакетам = Новый Соответствие;
		Для Каждого ИмяМакета Из МассивИменМакетов Цикл
			ДанныеОбъектаПоМакетам.Вставить(ИмяМакета, ПолучитьДанныеОбъекта(ОбъектСсылка, ИмяМакета));
		КонецЦикла;
		ДанныеПоВсемОбъектам.Вставить(ОбъектСсылка, ДанныеОбъектаПоМакетам);
	КонецЦикла;
	
	ОписаниеОбластей = Новый Соответствие;
	ОписаниеОбластей.Вставить(ИмяМакета, ПолучитьОписаниеОбластейМакетаОфисногоДокумента());
	ДвоичныеДанныеМакетов = Новый Соответствие;
	ТипыМакетов = Новый Соответствие;
	
	Для Каждого ИмяМакета Из МассивИменМакетов Цикл
		Если ИмяМакета = "ПФ_DOC_Доверенность" Тогда
			ДвоичныеДанныеМакетов.Вставить(ИмяМакета, Renault_УправлениеПечатью.ПолучитьМакет("Документ.CRM_ЗаписьНаТестДрайв.ПФ_DOC_Доверенность"));
			ТипыМакетов.Вставить(ИмяМакета, "DOC");
		КонецЕсли;
		Если ИмяМакета = "ПФ_DOC_Обязательство" Тогда
			ДвоичныеДанныеМакетов.Вставить(ИмяМакета, Renault_УправлениеПечатью.ПолучитьМакет("Документ.CRM_ЗаписьНаТестДрайв.ПФ_DOC_Обязательство"));
			ТипыМакетов.Вставить(ИмяМакета, "DOC");
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("Данные, Макеты",
							ДанныеПоВсемОбъектам,
							Новый Структура("ОписаниеОбластей, ТипыМакетов, ДвоичныеДанныеМакетов",
											ОписаниеОбластей,
											ТипыМакетов,
											ДвоичныеДанныеМакетов));
	
КонецФункции

Функция ПолучитьДанныеОбъекта(СсылкаНаОбъект, ИмяМакета)
	
	Объект = СсылкаНаОбъект.ПолучитьОбъект();
	
	ДанныеОбъекта = Новый Структура;
	
	Если ИмяМакета = "ПФ_DOC_Обязательство" Тогда
		
		ДанныеОбъекта.Вставить("Город",			Объект.Организация.Город);
		ДанныеОбъекта.Вставить("Дата",			Строка(Формат(Объект.ДатаПроведения, "ДФ='дд ММММ гггг'")));
		ДанныеОбъекта.Вставить("ФИО",			Объект.Клиент.Наименование);
		ДанныеОбъекта.Вставить("Паспорт",		CRM_Сервер.ПолучитьОписаниеДокумента(Объект.Клиент, Перечисления.ВидыДокументов.Паспорт));
		ДанныеОбъекта.Вставить("Адрес",			Renault_УправлениеКонтактнойИнформацией.АдресКлиента(Объект.Клиент));
		ДанныеОбъекта.Вставить("ВУ",			CRM_Сервер.ПолучитьОписаниеДокумента(Объект.Клиент, Перечисления.ВидыДокументов.Удостоверение));
		ДанныеОбъекта.Вставить("Телефон",		Renault_УправлениеКонтактнойИнформацией.ТелефонКлиента(Объект.Клиент));
		ДанныеОбъекта.Вставить("Модель",		Объект.Автомобиль.Модель.Наименование);
		ДанныеОбъекта.Вставить("ГосНомер",		Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Объект.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер));
		ДанныеОбъекта.Вставить("Начало",		Формат(Объект.Начало, "ДФ=ЧЧ:мм"));
		ДанныеОбъекта.Вставить("Окончание",		Формат(Объект.Начало + Объект.Продолжительность*60, "ДФ=ЧЧ:мм"));
		
	ИначеЕсли ИмяМакета = "ПФ_DOC_Доверенность" Тогда
		
		ДанныеОбъекта.Вставить("Организация",	Объект.Организация.НаименованиеПолное);
		ДанныеОбъекта.Вставить("Дата",			Строка(Формат(Объект.ДатаПроведения, "ДФ='дд ММММ гггг'")));
		ДанныеОбъекта.Вставить("РукОтделаПродаж", CRM_Сервер.ПолучитьРуководителяОтделаПродаж(Объект.Организация));
		ДанныеОбъекта.Вставить("ФИО",			Объект.Клиент.Наименование);
		ДанныеОбъекта.Вставить("Паспорт",		CRM_Сервер.ПолучитьОписаниеДокумента(Объект.Клиент, Перечисления.ВидыДокументов.Паспорт));
		ДанныеОбъекта.Вставить("Адрес",			Renault_УправлениеКонтактнойИнформацией.АдресКлиента(Объект.Клиент));
		ДанныеОбъекта.Вставить("Модель",		Объект.Автомобиль.Модель.Наименование);
		ДанныеОбъекта.Вставить("ГодВыпуска",	Формат(Объект.Автомобиль.ГодВыпуска, "ДФ=гггг"));
		ДанныеОбъекта.Вставить("VIN",			Объект.Автомобиль.VIN);
		ДанныеОбъекта.Вставить("НомерКузова",	Объект.Автомобиль.НомерКузова);
		ДанныеОбъекта.Вставить("ГосНомер",		Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Объект.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер));
		ДанныеОбъекта.Вставить("Цвет",			Объект.Автомобиль.Цвет.Наименование);
		ДанныеОбъекта.Вставить("Свидетельство",	CRM_Сервер.ПолучитьОписаниеДокумента(Объект.Клиент, Перечисления.ВидыДокументов.Свидетельство));

	КонецЕсли;
		
	Возврат ДанныеОбъекта;
	
КонецФункции

Функция ПолучитьОписаниеОбластейМакетаОфисногоДокумента()
	
	ОписаниеОбластей = Новый Структура;
	
	Renault_УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Заголовок", "Общая");
	
	Возврат ОписаниеОбластей;
	
КонецФункции

