Функция НайтиСоздатьДанныеПоФазе(Модель, Фаза) Экспорт
	
	Код = Фаза+Лев(Модель.Артикул,3);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Renault_ФазыМоделей.Ссылка ФазаМодели
	|ИЗ
	|	Справочник.Renault_ФазыМоделей КАК Renault_ФазыМоделей
	|ГДЕ
	|	Renault_ФазыМоделей.Модель = &Модель
	|	И Renault_ФазыМоделей.Код = &Код";
	
	Запрос.УстановитьПараметр("Модель", Модель);
	Запрос.УстановитьПараметр("Код", Код);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.ФазаМодели;
		
	КонецЕсли;
	
	Если Фаза = "PHAS1" Тогда
		
		КодФазы = 1;
		
	ИначеЕсли Фаза = "PHAS2" Тогда
		
		КодФазы = 2;
		
	ИначеЕсли Фаза = "PHAS3" Тогда
		
		КодФазы = 3;
		
	Иначе
		
		кодФазы = 1;
		
	КонецЕсли;
	
	НовыйЭлемент = Справочники.Renault_ФазыМоделей.СоздатьЭлемент();
	НовыйЭлемент.Код = Код;
	НовыйЭлемент.Модель = Модель;
	НовыйЭлемент.Фаза = КодФазы;
	НовыйЭлемент.Наименование = Строка(Модель) + " " + Строка(Фаза);
	
	Попытка
	
		НовыйЭлемент.Записать();
		
	Исключение
		
		Возврат Справочники.Renault_ФазыМоделей.ПустаяСсылка();
		
	КонецПопытки;
	
	Возврат НовыйЭлемент.Ссылка;
	
КонецФункции