Перем ИсточникДанных Экспорт;

Перем Идентификатор Экспорт;
Перем ДатаЗагрузки Экспорт;

Перем ТекстовыйДокумент;
Перем Таблица Экспорт;

Перем СоединениеУстановлено Экспорт;

//Пустышка. Нужна для сохранения связи с основной обработкой 
Функция УстановитьСоединение() Экспорт
	
	СоединениеУстановлено = Истина;
	Возврат СоединениеУстановлено;
	
КонецФункции

//Пустышка. Нужна для сохранения связи с основной обработкой 
Процедура ЗакрытьСоединения() Экспорт
	
	возврат;
	
КонецПроцедуры

////////////////////////////////////////////

Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ";") Экспорт
	
	МассивСтрок = Новый Массив();
	
	Если Разделитель = " " Тогда
		
		Стр = СокрЛП(Стр);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
		
	Иначе
		
		ДлинаРазделителя = СтрДлина(Разделитель);
		
		Пока 1=1 Цикл
			
			Поз = Найти(Стр,Разделитель);
			
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьТабличныйДокумент(ТабличныйДокумент) Экспорт
	
	ТабличныйДокумент.Очистить();
	
	СчетчикСтрок = 1;
	
	// Комментарий 
	//Дата создания - 06.06.2012 14:43:58; Автор - Окипний Андрей Евгеньевич
	//Теперь прочитаем файл в объект - текстовый документ
	//
	ТекстовыйДок = Новый ТекстовыйДокумент;
	ТекстовыйДок.Прочитать(ИсточникДанных, "utf-8");
	
	Для ТекущаяСтрока = 1 По ТекстовыйДок.КоличествоСтрок() Цикл
		
		ТекстСтроки = ТекстовыйДок.ПолучитьСтроку(ТекущаяСтрока);
		
		//Строки - разделители пропускаем
		Если Найти(ТекстСтроки, "*S*")<> 0 тогда Продолжить; КонецЕсли;
		
		МассивСтроки = РазложитьСтрокуВМассивПодстрок(ТекстСтроки);
		
		ТекущаяКолонка = 0;
		Для каждого Значение Из МассивСтроки Цикл
			
			ТекущаяКолонка = ТекущаяКолонка + 1;
			ТабличныйДокумент.Область("R" + Формат(СчетчикСтрок, "ЧГ=") +"C" + Формат(ТекущаяКолонка, "ЧГ=")).Текст = Значение;
			
		КонецЦикла;
		
		СчетчикСтрок = СчетчикСтрок + 1;
		
	КонецЦикла;
	
	//сбросим привязку к файлу
	ТекстовыйДок = Неопределено;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицу(ТабличныйДокумент) Экспорт
	
	КоличествоСтрок  = ТабличныйДокумент.ВысотаТаблицы;
	
	Для К = 1 по КоличествоСтрок Цикл
		НС = Таблица.Добавить();
		
		//%+ Дата изменения - 02.07.2012 16:59:08; Автор - Окипний Андрей Евгеньевич
		//
		// Описание изменений
		//  Изменено получение числовых показателей. Их нужно делить на 10
		//
		//%-
		НС.Реферанс	 = СокрЛП(ТабличныйДокумент.Область("R"+Формат(К,"ЧГ=")+"C1").Текст);
		
		НС.Название_реферанса	 = ТабличныйДокумент.Область("R"+Формат(К,"ЧГ=")+"C2").Текст;
		
		НС.Семья		 = СокрЛП(ТабличныйДокумент.Область("R"+Формат(К,"ЧГ=")+"C3").Текст);
		НС.Сегмент		 = СокрЛП(ТабличныйДокумент.Область("R"+Формат(К,"ЧГ=")+"C4").Текст);
	;
		НС.PNC_склад_руб_без_НДС		 = Число(?(ТабличныйДокумент.Область("R"+Формат(К,"ЧГ=")+"C5").Текст = "",0,
							ТабличныйДокумент.Область("R"+Формат(К,"ЧГ=")+"C5").Текст))/10;
		НС.PNC_срочная_руб_без_НДС		 = Число(?(ТабличныйДокумент.Область("R"+Формат(К,"ЧГ=")+"C6").Текст="",0,
											ТабличныйДокумент.Область("R"+Формат(К,"ЧГ=")+"C6").Текст));
											
		НС.PNC_агент_руб_без_НДС		 = Число(?(ТабличныйДокумент.Область("R"+Формат(К,"ЧГ=")+"C7").Текст = "", 0,
											ТабличныйДокумент.Область("R"+Формат(К,"ЧГ=")+"C7").Текст));
											
		НС.PCL_руб_без_НДС				 = Число(?(ТабличныйДокумент.Область("R"+Формат(К,"ЧГ=")+"C8").Текст = "", 0,
											ТабличныйДокумент.Область("R"+Формат(К,"ЧГ=")+"C8").Текст));
											
		НС.CB							 = СокрЛП(ТабличныйДокумент.Область("R"+Формат(К,"ЧГ=")+"C9").Текст);;
		
		НС.Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", НС.Реферанс);
		
	КонецЦикла;
	
	//Теперь удалим строки с пустым реферансом
	НайденнаяСтрока = Таблица.Найти("","Реферанс");
	
	Пока НайденнаяСтрока <> неопределено Цикл
		
		Таблица.Удалить(НайденнаяСтрока);
		
		НайденнаяСтрока = Таблица.Найти("","Реферанс");
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СчитатьДанные() Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ЗаполнитьТабличныйДокумент(ТабличныйДокумент);
	
	ЗаполнитьТаблицу(ТабличныйДокумент);
	
КонецПроцедуры

ДатаЗагрузки = НачалоДня(ТекущаяДата());