
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Идентификатор", СокрЛП(Ссылка.УникальныйИдентификатор()));
	Запрос.УстановитьПараметр("Ссылка",		   Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ШапкаДокумента.Дата КАК Период,
		|	ШапкаДокумента.Ссылка КАК Регистратор,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ШапкаДокумента.Договор КАК Договор,
		|	ШапкаДокумента.ВидОплаты КАК ВидОплаты,
		|	ШапкаДокумента.СпособОплаты КАК СпособОплаты,
		|	ШапкаДокумента.Комментарий КАК Комментарий,
		|	ШапкаДокумента.Сумма КАК Сумма
		|ИЗ
		|	Документ.Renault_ВнесениеОплатыПоДоговору КАК ШапкаДокумента
		|ГДЕ
		|	ШапкаДокумента.Ссылка = &Ссылка
		|	И ШапкаДокумента.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.Renault_ВидыОплат.Договор)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ШапкаДокумента.Дата КАК Период,
		|	ШапкаДокумента.Ссылка КАК Регистратор,
		|	ШапкаДокумента.Дата КАК Дата,
		|	ШапкаДокумента.Договор КАК Договор,
		|	ШапкаДокумента.ВидОплаты КАК ВидОплаты,
		|	ШапкаДокумента.СпособОплаты КАК СпособОплаты,
		|	ШапкаДокумента.Комментарий КАК Комментарий,
		|	ВЫРАЗИТЬ(&Идентификатор КАК СТРОКА(36)) КАК Идентификатор,
		|	ШапкаДокумента.Сумма КАК Сумма
		|ИЗ
		|	Документ.Renault_ВнесениеОплатыПоДоговору КАК ШапкаДокумента
		|ГДЕ
		|	ШапкаДокумента.Ссылка = &Ссылка";
		
	РезультатЗапроса = Запрос.ВыполнитьПакет();
		
	Движения.Renault_ВзаиморасчетыПоДоговорам.Записывать = Истина;
	Движения.Renault_ОплатыАвтомобиляКлиентом.Записывать = Истина;
		
	Движения.Renault_ВзаиморасчетыПоДоговорам.Загрузить(РезультатЗапроса[0].Выгрузить());
	Движения.Renault_ОплатыАвтомобиляКлиентом.Загрузить(РезультатЗапроса[1].Выгрузить());
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(DMS_ДокументОснование) Тогда
		DMS_ДокументОснование = Неопределено;
	КонецЕсли; 
	
	Если ЭтоНовый() Тогда
		DMS_Автор 		 = ПараметрыСеанса.Пользователь;
		DMS_ДатаСоздания = ТекущаяДата();
	КонецЕсли; 
	
КонецПроцедуры   

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	DMS_Автор 		 = ПараметрыСеанса.Пользователь;
	DMS_ДатаСоздания = ТекущаяДата();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	DMS_Автор 		 = ПараметрыСеанса.Пользователь;
	DMS_ДатаСоздания = ТекущаяДата();
	
КонецПроцедуры
