#Если Клиент Тогда
// Модуль отчета
Перем СписокОбъектов Экспорт; // список объектов печати
Перем ИмяОбъекта Экспорт;
	
	
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА
	
	
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА
	
// Стандартная процедура настройки построителя отчета 
//
// Параметры
//  ИмяМакета  – строка – название макета
//  ИмяМакетаПараметров  – строка – название макета параметров
//
Процедура ЗаполнитьНачальныеНастройки(ИмяМакета) Экспорт
	
	ДокументСсылка		= Документы.РабочийЛист.ПустаяСсылка();
	МетаданныеОбъекта	= ДокументСсылка.Метаданные();
	ТекДата				= ТекущаяДата();
	
	НаименованиеОтчета = "Печать документа ";
		
	Текст	= "ВЫБРАТЬ
	     	  |	РабочийЛист.Ссылка												КАК Ссылка,
			  |	МАКСИМУМ(СледующиеСобытия.ДатаНачала) 							КАК ДатаПланируемогоКонтакта,
			  |	МАКСИМУМ(РАЗНОСТЬДАТ(ЕстьNULL(СледующиеСобытия.ДатаНачала, &ПустаяДата), &ТекущаяДата, ДЕНЬ)) КАК ДнейПросрочено
			  |
	     	  |{ВЫБРАТЬ
			  |	Ссылка.*						КАК Ссылка,
	     	  |	Номер							КАК Номер,
	     	  |	Дата							КАК Дата,
			  |	ДнейПросрочено					КАК ДнейПросрочено,
			  |	ДатаПланируемогоКонтакта		КАК ДатаПланируемогоКонтакта,
			  |	Статус.*						КАК Статус,
			  |	ВидКонтакта.*					КАК ВидКонтакта,
			  |	Продавец.*						КАК Продавец,
			  |	НаименованиеКлиента				КАК НаименованиеКлиента,
			  |	Контрагент.*					КАК Контрагент,
			  |	КонтактныйТелефон				КАК КонтактныйТелефон,
			  |	КомуПокупает					КАК КомуПокупает,
			  |	СКемПришел						КАК СКемПришел,
			  |	Автомобиль.*					КАК Автомобиль,
			  |	Модель.*						КАК Модель,
			  |	ВариантКомплектации.*			КАК ВариантКомплектации,
			  |	СуммаЗакупки					КАК СуммаЗакупки,
	     	  |	СуммаПродажи					КАК СуммаПродажи,
			  |	Автор.*							КАК Автор,
	     	  |	Альтернативы.*					КАК Альтернативы,
	     	  |	АнализОтказа					КАК АнализОтказа,	     	  	     	  
	     	  |	Возраст.*						КАК Возраст,
	     	  |	ДокументОснование.*				КАК ДокументОснование,
	     	  |	ДополнительноеОборудование		КАК ДополнительноеОборудование,
	     	  |	ГодВыпускаТрейдИн				КАК ГодВыпускаТрейдИн,
	     	  |	КАСКО							КАК КАСКО,
	     	  |	КоличествоАвтомобилей			КАК КоличествоАвтомобилей,
	     	  |	ВЫРАЗИТЬ(Комментарий КАК СТРОКА(100))	КАК Комментарий,	     	  	     	  	     	  
	     	  |	Интерьер.*						КАК Интерьер,
	     	  |	Маржа							КАК Маржа,	     	  
	     	  |	МодельТрейдИн.*					КАК МодельТрейдИн,	     	  
	     	  |	Организация.*					КАК Организация,
	     	  |	ОСАГО							КАК ОСАГО,
	     	  |	ОсновноеВозражение.*			КАК ОсновноеВозражение,
	     	  |	ОфертаТрейдИн					КАК ОфертаТрейдИн,
	     	  |	ПодразделениеКомпании.*			КАК ПодразделениеКомпании,
	     	  |	Пол.*							КАК Пол,
	     	  |	ПредполагаемыйСрок				КАК ПредполагаемыйСрок,
	     	  |	ПредпочтенияПоКоробкеПередач.*	КАК ПредпочтенияПоКоробкеПередач,
	     	  |	ПредпочтенияПоЦветам			КАК ПредпочтенияПоЦветам,
	     	  |	ПричинаОтказа.*					КАК ПричинаОтказа,
	     	  |	ПробегТрейдИн					КАК ПробегТрейдИн,	     	  
	     	  |	Проект.*						КАК Проект,
	     	  |	ПрочиеУслуги					КАК ПрочиеУслуги,
	     	  |	Реклама.*						КАК Реклама,
	     	  |	РуководительПродавца.*			КАК РуководительПродавца,	     	  	     	  
	     	  |	СуммаДокумента					КАК СуммаДокумента,
	     	  |	ТрейдИн							КАК ТрейдИн,
	     	  |	ХозОперация.*					КАК ХозОперация,
	     	  |	Цвет.*							КАК Цвет,
	     	  |	ЮридическоеЛицо					КАК ЮридическоеЛицо
			  |}
	     	  |ИЗ
	     	  |	Документ.РабочийЛист КАК РабочийЛист
	     	  |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	     	  |			Событие.Ссылка				КАК Событие,
	     	  |			Событие.ДатаНачала			КАК ДатаНачала,
	     	  |			Событие.ДокументОснование	КАК ОснованиеСобытия,
	     	  |			Событие.Тема КАК Тема
	     	  |		ИЗ
	     	  |			Документ.Событие КАК Событие
	     	  |		ГДЕ
	     	  |			Событие.ДокументОснование ССЫЛКА Документ.РабочийЛист
	     	  |			И Событие.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСобытий.Запланировано)) КАК СледующиеСобытия
	     	  |		ПО РабочийЛист.Ссылка = СледующиеСобытия.ОснованиеСобытия
			  |
			  |ГДЕ
			  |	ЕстьNULL(СледующиеСобытия.ДатаНачала, &ПустаяДата) < &ТекущаяДата
			  |	И РабочийЛист.Статус<>ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Отказ)
			  |	
			  |{ГДЕ
	     	  |	РабочийЛист.Номер							КАК Номер,
	     	  |	РабочийЛист.Дата							КАК Дата,
	     	  |	РабочийЛист.Автомобиль.*					КАК Автомобиль,
	     	  |	РабочийЛист.Автор.*							КАК Автор,
	     	  |	РабочийЛист.Альтернативы.*					КАК Альтернативы,
	     	  |	РабочийЛист.АнализОтказа					КАК АнализОтказа,
	     	  |	РабочийЛист.ВариантКомплектации.*			КАК ВариантКомплектации,
	     	  |	РабочийЛист.ВидКонтакта.*					КАК ВидКонтакта,
	     	  |	РабочийЛист.Возраст.*						КАК Возраст,
	     	  |	РабочийЛист.ДокументОснование.*				КАК ДокументОснование,
	     	  |	РабочийЛист.ДополнительноеОборудование		КАК ДополнительноеОборудование,
	     	  |	РабочийЛист.ГодВыпускаТрейдИн				КАК ГодВыпускаТрейдИн,
	     	  |	РабочийЛист.КАСКО							КАК КАСКО,
	     	  |	РабочийЛист.КоличествоАвтомобилей			КАК КоличествоАвтомобилей,
	     	  |	ВЫРАЗИТЬ(РабочийЛист.Комментарий КАК СТРОКА(100))	КАК Комментарий,
	     	  |	РабочийЛист.КомуПокупает					КАК КомуПокупает,
	     	  |	РабочийЛист.КонтактныйТелефон				КАК КонтактныйТелефон,
	     	  |	РабочийЛист.Контрагент.*					КАК Контрагент,
	     	  |	РабочийЛист.Интерьер.*						КАК Интерьер,
	     	  |	РабочийЛист.Маржа							КАК Маржа,
	     	  |	РабочийЛист.Модель.*						КАК Модель,
	     	  |	РабочийЛист.МодельТрейдИн.*					КАК МодельТрейдИн,
	     	  |	РабочийЛист.НаименованиеКлиента				КАК НаименованиеКлиента,
	     	  |	РабочийЛист.Организация.*					КАК Организация,
	     	  |	РабочийЛист.ОСАГО							КАК ОСАГО,
	     	  |	РабочийЛист.ОсновноеВозражение.*			КАК ОсновноеВозражение,
	     	  |	РабочийЛист.ОфертаТрейдИн					КАК ОфертаТрейдИн,
	     	  |	РабочийЛист.ПодразделениеКомпании.*			КАК ПодразделениеКомпании,
	     	  |	РабочийЛист.Пол.*							КАК Пол,
	     	  |	РабочийЛист.ПредполагаемыйСрок				КАК ПредполагаемыйСрок,
	     	  |	РабочийЛист.ПредпочтенияПоКоробкеПередач.*	КАК ПредпочтенияПоКоробкеПередач,
	     	  |	РабочийЛист.ПредпочтенияПоЦветам			КАК ПредпочтенияПоЦветам,
	     	  |	РабочийЛист.ПричинаОтказа.*					КАК ПричинаОтказа,
	     	  |	РабочийЛист.ПробегТрейдИн					КАК ПробегТрейдИн,
	     	  |	РабочийЛист.Продавец.*						КАК Продавец,
	     	  |	РабочийЛист.Проект.*						КАК Проект,
	     	  |	РабочийЛист.ПрочиеУслуги					КАК ПрочиеУслуги,
	     	  |	РабочийЛист.Реклама.*						КАК Реклама,
	     	  |	РабочийЛист.РуководительПродавца.*			КАК РуководительПродавца,
	     	  |	РабочийЛист.СКемПришел						КАК СКемПришел,
	     	  |	РабочийЛист.Статус.*						КАК Статус,
	     	  |	РабочийЛист.СуммаДокумента					КАК СуммаДокумента,
	     	  |	РабочийЛист.СуммаЗакупки					КАК СуммаЗакупки,
	     	  |	РабочийЛист.СуммаПродажи					КАК СуммаПродажи,
	     	  |	РабочийЛист.ТрейдИн							КАК ТрейдИн,
	     	  |	РабочийЛист.ХозОперация.*					КАК ХозОперация,
	     	  |	РабочийЛист.Цвет.*							КАК Цвет,
	     	  |	РабочийЛист.ЮридическоеЛицо					КАК ЮридическоеЛицо,
			  |	Ссылка.*									КАК Ссылка}
			  |
			  |СГРУППИРОВАТЬ ПО
			  |	РабочийЛист.Ссылка
			  |
			  |УПОРЯДОЧИТЬ ПО
			  |	РабочийЛист.Дата
			  |
	     	  |{УПОРЯДОЧИТЬ ПО
	     	  |	Номер							КАК Номер,
	     	  |	Дата							КАК Дата,
			  |	ДнейПросрочено					КАК ДнейПросрочено,
			  |	ДатаПланируемогоКонтакта		КАК ДатаПланируемогоКонтакта,
			  |	Статус.*						КАК Статус,
			  |	ВидКонтакта.*					КАК ВидКонтакта,
			  |	Продавец.*						КАК Продавец,
			  |	НаименованиеКлиента				КАК НаименованиеКлиента,
			  |	Контрагент.*					КАК Контрагент,
			  |	КонтактныйТелефон				КАК КонтактныйТелефон,
			  |	КомуПокупает					КАК КомуПокупает,
			  |	СКемПришел						КАК СКемПришел,
			  |	Автомобиль.*					КАК Автомобиль,
			  |	Модель.*						КАК Модель,
			  |	ВариантКомплектации.*			КАК ВариантКомплектации,
			  |	СуммаЗакупки					КАК СуммаЗакупки,
	     	  |	СуммаПродажи					КАК СуммаПродажи,
			  |	Автор.*							КАК Автор,
	     	  |	Альтернативы.*					КАК Альтернативы,
	     	  |	АнализОтказа					КАК АнализОтказа,	     	  	     	  
	     	  |	Возраст.*						КАК Возраст,
	     	  |	ДокументОснование.*				КАК ДокументОснование,
	     	  |	ДополнительноеОборудование		КАК ДополнительноеОборудование,
	     	  |	ГодВыпускаТрейдИн				КАК ГодВыпускаТрейдИн,
	     	  |	КАСКО							КАК КАСКО,
	     	  |	КоличествоАвтомобилей			КАК КоличествоАвтомобилей,
	     	  |	ВЫРАЗИТЬ(Комментарий КАК СТРОКА(100))	КАК Комментарий,	     	  	     	  	     	  
	     	  |	Интерьер.*						КАК Интерьер,
	     	  |	Маржа							КАК Маржа,	     	  
	     	  |	МодельТрейдИн.*					КАК МодельТрейдИн,	     	  
	     	  |	Организация.*					КАК Организация,
	     	  |	ОСАГО							КАК ОСАГО,
	     	  |	ОсновноеВозражение.*			КАК ОсновноеВозражение,
	     	  |	ОфертаТрейдИн					КАК ОфертаТрейдИн,
	     	  |	ПодразделениеКомпании.*			КАК ПодразделениеКомпании,
	     	  |	Пол.*							КАК Пол,
	     	  |	ПредполагаемыйСрок				КАК ПредполагаемыйСрок,
	     	  |	ПредпочтенияПоКоробкеПередач.*	КАК ПредпочтенияПоКоробкеПередач,
	     	  |	ПредпочтенияПоЦветам			КАК ПредпочтенияПоЦветам,
	     	  |	ПричинаОтказа.*					КАК ПричинаОтказа,
	     	  |	ПробегТрейдИн					КАК ПробегТрейдИн,	     	  
	     	  |	Проект.*						КАК Проект,
	     	  |	ПрочиеУслуги					КАК ПрочиеУслуги,
	     	  |	Реклама.*						КАК Реклама,
	     	  |	РуководительПродавца.*			КАК РуководительПродавца,	     	  	     	  
	     	  |	СуммаДокумента					КАК СуммаДокумента,
	     	  |	ТрейдИн							КАК ТрейдИн,
	     	  |	ХозОперация.*					КАК ХозОперация,
	     	  |	Цвет.*							КАК Цвет,
	     	  |	ЮридическоеЛицо					КАК ЮридическоеЛицо,
	     	  |	Ссылка.*						КАК Ссылка
			  |}
	     	  |ИТОГИ ПО
	     	  |	РабочийЛист.Ссылка КАК Ссылка
	     	  |АВТОУПОРЯДОЧИВАНИЕ";
		
	// установим текст построителя
	ПостроительОтчета.Текст = Текст;
	ПостроительОтчета.Параметры.Вставить("ТекущаяДата",	ТекДата);
	ПостроительОтчета.Параметры.Вставить("ПустаяДата",	Дата(1,1,1));
		
	// перенесем настройки из текста в табл. поля настроек построителя
	ПостроительОтчета.ЗаполнитьНастройки();
		
	// представления полей
	Для каждого ТекПоле Из ПостроительОтчета.ДоступныеПоля Цикл
		ПредставлениеРеквизита = МетаданныеОбъекта.Реквизиты.Найти(ТекПоле.Имя);
		ПредставлениеРеквизита = ?(ПредставлениеРеквизита = Неопределено, "", ПредставлениеРеквизита.Синоним);
		Если ПредставлениеРеквизита <> "" И ПредставлениеРеквизита <> ТекПоле.Имя Тогда
			ТекПоле.Представление = ПредставлениеРеквизита;
		КонецЕсли;
	КонецЦикла;
		
	// отборы
	Для Каждого ЭлементОтбора Из ВнешнийОтбор Цикл
		Если НЕ ЭлементОтбора.Использование Тогда Продолжить; КонецЕсли;
		Попытка
			НовыйОтбор=ПостроительОтчета.Отбор.Добавить(ЭлементОтбора.ПутьКДанным);
		Исключение
			Продолжить;
		КонецПопытки;
		НовыйОтбор.Использование	= ЭлементОтбора.Использование;
		НовыйОтбор.ВидСравнения		= ЭлементОтбора.ВидСравнения;
		НовыйОтбор.Значение			= ЭлементОтбора.Значение;
		НовыйОтбор.ЗначениеПо		= ЭлементОтбора.ЗначениеПо;
		НовыйОтбор.ЗначениеС		= ЭлементОтбора.ЗначениеС;
		НовыйОтбор.Представление	= ЭлементОтбора.Представление;
	КонецЦикла;
		
КонецПроцедуры // ЗаполнитьНачальныеНастройки()
	
// Подготавливает макет вывода для построителя
//
// Параметры
//	ИсходныйМакет - ТабличныйДокумент
//	МакетОформления - ТабличныйДокумент
//
// Возвращаемое значение:
//	КонечныйМакет - ТабличныйДокумент
//
Функция СформатированныйМакетПостроителя(ИсходныйМакет, МакетОформления = Неопределено)
	// установим текст заголовка отчета
	МетаданныеОбъекта						= Документы.РабочийЛист.ПустаяСсылка().Метаданные();
	ИсходныйМакет.Параметры.ЗаголовокОтчета	= "Документ """ + ?(МетаданныеОбъекта.Синоним = "", ИмяОбъекта, МетаданныеОбъекта.Синоним) + """";

	ТекстОтбор		= "";
	Для Каждого ТекОтбор Из ПостроительОтчета.Отбор Цикл
		ТекстОтбор	= ТекстОтбор + ", " + ТекОтбор.Представление + " " + НРег(ТекОтбор.ВидСравнения) + " " + Строка(ТекОтбор.Значение);
	КонецЦикла;
	ИсходныйМакет.Параметры.Отбор	= ?(ПостроительОтчета.Отбор.Количество() > 0, "Отбор: ", "") + Прав(ТекстОтбор, СтрДлина(ТекстОтбор) - 2);
	ТекстКолонки					= "Колонки: ";
	Для Каждого ТекВыбПоле Из ПостроительОтчета.ВыбранныеПоля Цикл
		ТекстКолонки	= ТекстКолонки + ТекВыбПоле.Представление + ", ";
	КонецЦикла;
	ИсходныйМакет.Параметры.Колонки = Лев(ТекстКолонки, СтрДлина(ТекстКолонки) - 2);
		
	//инициализация новых областей
	ОбластьШапка			= Новый ТабличныйДокумент();
	ОбластьСтрока			= Новый ТабличныйДокумент();
	ОбластьСтрокаИерархия	= Новый ТабличныйДокумент();
	ОбластьДетальныеЗаписи	= Новый ТабличныйДокумент();
	ОбластьПодвал			= Новый ТабличныйДокумент();
	//начальная область
	ОбластьШапка.Вывести(ИсходныйМакет.ПолучитьОбласть("ШапкаТаблицы|ОбластьЛеваяГраница"));
	ОбластьСтрокаИерархия.Вывести(ИсходныйМакет.ПолучитьОбласть("СтрокаИерархия|ОбластьЛеваяГраница"));
	ОбластьСтрока.Вывести(ИсходныйМакет.ПолучитьОбласть("Строка|ОбластьЛеваяГраница"));
	ОбластьДетальныеЗаписи.Вывести(ИсходныйМакет.ПолучитьОбласть("Детали|ОбластьЛеваяГраница"));
	ОбластьПодвал.Вывести(ИсходныйМакет.ПолучитьОбласть("Подвал|ОбластьЛеваяГраница"));
	//ширина колонок таблицы
	мсвШирина				= Новый Массив();
	
	тзПредставлений	= Новый ТаблицаЗначений();
	тзПредставлений.Колонки.Добавить("Старое");
	тзПредставлений.Колонки.Добавить("Новое");
	
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "ДнейПросрочено"; НоваяСтрока.Новое= "Дней просрочено";
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "ДатаПланируемогоКонтакта"; НоваяСтрока.Новое= "Дата планируемого контакта";	
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "ВидКонтакта"; НоваяСтрока.Новое= "Вид контакта";		
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "НаименованиеКлиента"; НоваяСтрока.Новое= "Наименование клиента";
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "КонтактныйТелефон"; НоваяСтрока.Новое= "Контактный телефон";	
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "КомуПокупает"; НоваяСтрока.Новое= "Кому покупает";	
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "СКемПришел"; НоваяСтрока.Новое= "С кем пришел";
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "ВариантКомплектации"; НоваяСтрока.Новое= "Вариант комплектации";	
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "СуммаЗакупки"; НоваяСтрока.Новое= "Сумма закупки";	
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "СуммаПродажи"; НоваяСтрока.Новое= "Сумма продажи";	
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "АнализОтказа"; НоваяСтрока.Новое= "Анализ отказа";
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "ДокументОснование"; НоваяСтрока.Новое= "Основание";	
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "ДополнительноеОборудование"; НоваяСтрока.Новое= "Доп. оборудование";
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "ГодВыпускаТрейдИн"; НоваяСтрока.Новое= "Год выпуска Trade-in";
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "КоличествоАвтомобилей"; НоваяСтрока.Новое= "Количество авто";
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "МодельТрейдИн"; НоваяСтрока.Новое= "Модель Trade-in";
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "ОсновноеВозражение"; НоваяСтрока.Новое= "Осн. возражение";	
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "ОфертаТрейдИн"; НоваяСтрока.Новое= "Оферта Trade-in";	
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "ПодразделениеКомпании"; НоваяСтрока.Новое= "Подразделение";	
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "ПредполагаемыйСрок"; НоваяСтрока.Новое= "Предполагаемый срок";	
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "ПредпочтенияПоКоробкеПередач"; НоваяСтрока.Новое= "Предпочтения по КПП";	
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "ПредпочтенияПоЦветам"; НоваяСтрока.Новое= "Предпочтения по цветам";	
	НоваяСтрока		= тзПредставлений.Добавить();
	//НоваяСтрока.Старое= "ПредыдущийАвтомобиль"; НоваяСтрока.Новое= "Предыдущий автомобиль";
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "ПричинаОтказа"; НоваяСтрока.Новое= "Причина отказа";	
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "ПробегТрейдИн"; НоваяСтрока.Новое= "Пробег Trade-in";	
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "ПрочиеУслуги"; НоваяСтрока.Новое= "Прочие услуги";	
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "РуководительПродавца"; НоваяСтрока.Новое= "Руководитель продавца";	
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "СуммаДокумента"; НоваяСтрока.Новое= "Сумма документа";	
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "ЮридическоеЛицо"; НоваяСтрока.Новое= "Юр. лицо";
	НоваяСтрока		= тзПредставлений.Добавить();
	НоваяСтрока.Старое= "ТрейдИн"; НоваяСтрока.Новое= "Trade-in";	
	
	Для Каждого ТекСтрока Из тзПредставлений Цикл
		НайденнаяСтрока 	= ПостроительОтчета.ВыбранныеПоля.Найти(ТекСтрока.Старое);
		Если НайденнаяСтрока<>Неопределено Тогда
			НайденнаяСтрока.Представление	= ТекСтрока.Новое;
		КонецЕсли;
	КонецЦикла;
		
	// присоединяем колонки
	Для Каждого ТекВыбПоле Из ПостроительОтчета.ВыбранныеПоля Цикл
		//определим тип реквизита
		ТипРеквизита = Неопределено;
		Попытка ТипРеквизита = МетаданныеОбъекта.Реквизиты.Найти(ТекВыбПоле.Имя).Тип;
		Исключение
		КонецПопытки;
		//	Найдем область макета, соответствующую типу реквизита		
		Если ТекВыбПоле.Имя = "Ссылка" Тогда
			ИмяКолонки = "РабочийЛист";
		Иначе
			ИмяКолонки = "Произвольный";
		КонецЕсли;
		//получаем области из исходного макета
		ОбластьШапкаКолонка				= ИсходныйМакет.ПолучитьОбласть("ШапкаТаблицы|Область" + ИмяКолонки);
		ОбластьСтрокаИерархияКолонка	= ИсходныйМакет.ПолучитьОбласть("СтрокаИерархия|Область" + ИмяКолонки);
		ОбластьСтрокаКолонка			= ИсходныйМакет.ПолучитьОбласть("Строка|Область" + ИмяКолонки);
		ОбластьДеталиКолонка			= ИсходныйМакет.ПолучитьОбласть("Детали|Область" + ИмяКолонки);
		ОбластьПодвалКолонка			= ИсходныйМакет.ПолучитьОбласть("Подвал|Область" + ИмяКолонки);
		//заполняем ширину колонок
		мсвШирина.Добавить(ОбластьШапкаКолонка.Область().ШиринаКолонки);
		//устанавливаем текст
		ОбластьШапкаКолонка.Область().Текст				= ТекВыбПоле.Представление;
		ОбластьСтрокаКолонка.Область().Текст			= ТекВыбПоле.Имя;
		ОбластьСтрокаИерархияКолонка.Область().Текст	= ТекВыбПоле.Имя;
		ОбластьДеталиКолонка.Область().Текст			= ТекВыбПоле.Имя;
		//присоединяем полученные области к выходному макету		
		ОбластьШапка.Присоединить(ОбластьШапкаКолонка);
		ОбластьСтрока.Присоединить(ОбластьСтрокаКолонка);
		ОбластьСтрокаИерархия.Присоединить(ОбластьСтрокаИерархияКолонка);
		ОбластьДетальныеЗаписи.Присоединить(ОбластьДеталиКолонка);
		ОбластьПодвал.Присоединить(ОбластьПодвалКолонка);
	КонецЦикла;
		
	//присоединяем конечную колонку
	ОбластьШапка.Присоединить(ИсходныйМакет.ПолучитьОбласть("ШапкаТаблицы|ОбластьПраваяГраница"));
	ОбластьСтрокаИерархия.Присоединить(ИсходныйМакет.ПолучитьОбласть("СтрокаИерархия|ОбластьПраваяГраница"));
	ОбластьСтрока.Присоединить(ИсходныйМакет.ПолучитьОбласть("Строка|ОбластьПраваяГраница"));
	ОбластьДетальныеЗаписи.Присоединить(ИсходныйМакет.ПолучитьОбласть("Детали|ОбластьПраваяГраница"));
	ОбластьПодвал.Присоединить(ИсходныйМакет.ПолучитьОбласть("Подвал|ОбластьПраваяГраница"));
		
	//выводим в выходной макет
	КонечныйМакет = Новый ТабличныйДокумент;
	КонечныйМакет.Вывести(ИсходныйМакет.ПолучитьОбласть("Заголовок|ОбластьЛеваяГраница"));
	КонечныйМакет.Вывести(ОбластьШапка);
	КонечныйМакет.Вывести(ОбластьСтрокаИерархия);
	КонечныйМакет.Вывести(ОбластьСтрока);
	КонечныйМакет.Вывести(ОбластьДетальныеЗаписи);
	КонечныйМакет.Вывести(ОбластьПодвал);
		
	//именуем области
	КонечныйМакет.Область(1, , 3, ).Имя = "Заголовок";
	КонечныйМакет.Область(4, , 4, ).Имя = "ШапкаТаблицы";
	КонечныйМакет.Область(5, , 5, ).Имя = "СсылкаИерархия";
	КонечныйМакет.Область(6, , 6, ).Имя = "Ссылка";
	КонечныйМакет.Область(7, , 7, ).Имя = "Детали";
	КонечныйМакет.Область(8, , 8, ).Имя = "Подвал";
	//параметры заполнения
	КонечныйМакет.Область(5, 2, 5, мсвШирина.Количество()+1).Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
	КонечныйМакет.Область(6, 2, 6, мсвШирина.Количество()+1).Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
	КонечныйМакет.Область(7, 2, 7, мсвШирина.Количество()+1).Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
	//расшифровка
	ЗначениеРасшифровки = "Ссылка";
	КонечныйМакет.Область(5, 2, 5, мсвШирина.Количество()+1).ПараметрРасшифровки = ЗначениеРасшифровки;
	КонечныйМакет.Область(6, 2, 6, мсвШирина.Количество()+1).ПараметрРасшифровки = ЗначениеРасшифровки;
	КонечныйМакет.Область(7, 2, 7, мсвШирина.Количество()+1).ПараметрРасшифровки = ЗначениеРасшифровки;
	//автоотступ для иерархии
	КонечныйМакет.Область(5, 2, 5, 2).АвтоОтступ = 1;
	КонечныйМакет.Область(6, 2, 6, 2).АвтоОтступ = 1;
	//корректируем ширину колонок
	Для НомКол = 2 По мсвШирина.Количество()+1 Цикл
		КонечныйМакет.Область(1, НомКол, 1, НомКол).ШиринаКолонки = мсвШирина[НомКол-2];
	КонецЦикла;
		
	//посмотрим, нужно ли оформлять макет
	Если МакетОформления = Неопределено Тогда
		Возврат КонечныйМакет;
	КонецЕсли;
	//оформление
	ОформлениеШапкаТаблицы			= МакетОформления.ПолучитьОбласть("ОформлениеШапки").Область(1, 1);
	ОформлениеСтрока				= МакетОформления.ПолучитьОбласть("ОформлениеИзмерений").Область(8, 1);
	ОформлениеСтрокаИерархия		= МакетОформления.ПолучитьОбласть("ОформлениеИерархии").Область(1, 1);
	ОформлениеПодвал				= МакетОформления.ПолучитьОбласть("ОформлениеИтоги").Область(1, 1);
	КонечныйМакет.Область(4, 2, 4, мсвШирина.Количество()+1).Шрифт		= ОформлениеШапкаТаблицы.Шрифт;
	КонечныйМакет.Область(4, 2, 4, мсвШирина.Количество()+1).ЦветФона	= ОформлениеШапкаТаблицы.ЦветФона;
	КонечныйМакет.Область(5, 2, 5, мсвШирина.Количество()+1).Шрифт		= ОформлениеСтрокаИерархия.Шрифт;
	КонечныйМакет.Область(5, 2, 5, мсвШирина.Количество()+1).ЦветФона	= ОформлениеСтрокаИерархия.ЦветФона;
	КонечныйМакет.Область(6, 2, 6, мсвШирина.Количество()+1).Шрифт		= ОформлениеСтрока.Шрифт;
	КонечныйМакет.Область(6, 2, 6, мсвШирина.Количество()+1).ЦветФона	= ОформлениеСтрока.ЦветФона;
	КонечныйМакет.Область(7, 2, 7, мсвШирина.Количество()+1).Шрифт		= ОформлениеСтрока.Шрифт;
	КонечныйМакет.Область(7, 2, 7, мсвШирина.Количество()+1).ЦветФона	= ОформлениеСтрока.ЦветФона;
	КонечныйМакет.Область(8, 2, 8, мсвШирина.Количество()+1).Шрифт		= ОформлениеПодвал.Шрифт;
	КонечныйМакет.Область(8, 2, 8, мсвШирина.Количество()+1).ЦветФона	= ОформлениеПодвал.ЦветФона;
		
	Возврат КонечныйМакет;
КонецФункции // СформатированныйМакетПостроителя()
	
// формирует отчет в виде табличного документа
//
// Параметры
//  ДокументРезультат – ТабличныйДокумент или ПолеТабличногоДокумента
//
// Возвращаемое значение:
//  Результат - ТабличныйДокумент
//
Функция СформироватьТабличныйДокумент(ДокументРезультат=Неопределено) Экспорт
	
	Отборы				= ПостроительОтчета.Отбор;
	ПоследнийИндекс		= Отборы.Количество()-1;
	Пока ПоследнийИндекс>=0 Цикл
		ТекОтбор		= Отборы[ПоследнийИндекс];
		Если ПустаяСтрока(ТекОтбор.ПутьКДанным) Тогда
			Отборы.Удалить(ПоследнийИндекс);
		КонецЕсли;
		ПоследнийИндекс	= ПоследнийИндекс-1;
	КонецЦикла;
	
	// Проверим входной параметр на корректность
	Если ТипЗнч(ДокументРезультат)<>Тип("ПолеТабличногоДокумента") И
		ТипЗнч(ДокументРезультат)<>Тип("ТабличныйДокумент") Тогда
		ДокументРезультат	= Новый ТабличныйДокумент();
	Иначе	
		ДокументРезультат.Очистить();	
	КонецЕсли;
	// если не выбрано ни одно поле
	Если ПостроительОтчета.ВыбранныеПоля.Количество() = 0 Тогда
		Сообщить("Не выбрано ни одно поле!");
		Возврат ДокументРезультат;
	КонецЕсли;
		
	// получим макеты оформления и результата и обработаем их
	ПостроительОтчета.Макет = Неопределено;
	Попытка
		МакетОформление = ПолучитьОбщийМакет(ИмяМакетаОформленияТабличногоДокумента);
	Исключение
		МакетОформление = Неопределено;
	КонецПопытки;
	МакетРезультат  = ПолучитьМакет("МакетРезультат"); 
	ПостроительОтчета.Макет = СформатированныйМакетПостроителя(МакетРезультат, МакетОформление);
		
	// расшифровка
	ПостроительОтчета.ЗаполнениеРасшифровки = ВидЗаполненияРасшифровкиПостроителяОтчета.Расшифровка;
		
	// установим свойства построителя
	ПостроительОтчета.РазмещениеИзмеренийВСтроках				= ТипРазмещенияИзмерений.Вместе;
	ПостроительОтчета.РазмещениеРеквизитовИзмеренийВСтроках		= ТипРазмещенияРеквизитовИзмерений.Отдельно;
	ПостроительОтчета.РазмещениеРеквизитовИзмеренийВКолонках	= ТипРазмещенияРеквизитовИзмерений.Отдельно;
		
	// выполним запрос
	ПостроительОтчета.Выполнить();
	
	// выведем что получилось
	ПостроительОтчета.Вывести(ДокументРезультат);
		
	// параметры табличного документа
	ДокументРезультат.ФиксацияСверху		= 4;
	ДокументРезультат.ФиксацияСлева			= 2;
	ДокументРезультат.ТолькоПросмотр		= обПраво("ЗащитаПечатныхФорм", глПрава);
	ДокументРезультат.АвтоМасштаб			= Истина;
		
	Возврат ДокументРезультат;
КонецФункции // СформироватьТабличныйДокумент()
	
	
//////////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
ИмяОбъекта			= "РабочийЛист";
СписокОбъектов = Новый Структура();
отОтчетПриИнициализацииОбъекта(ЭтотОбъект);
#КонецЕсли