Процедура АвитоЗагрузкаСправочниковМодуль() Экспорт
	
	ВнутреннийАдресСервера = "https://autoload.avito.ru/format/PartsBrands.xml";
	
  	ИмяФайлаНазначение = ПолучитьИмяВременногоФайла("xml");
	ФайлНаДиске = Новый Файл(ИмяФайлаНазначение);
	
	Для Счетчик = 1 По 10 Цикл
		КопироватьФайл(ВнутреннийАдресСервера,ИмяФайлаНазначение);
  		Если ФайлНаДиске.Существует() Тогда
 			Прервать;
		КонецЕсли;
		Пауза30секунд = 30;
		КонДата = ТекущаяДата() + Пауза30секунд;
  		Пока ТекущаяДата() < КонДата Цикл
      		//...  
  		КонецЦикла;
 	КонецЦикла; 
	
	Если НЕ ФайлНаДиске.Существует() Тогда
		#Если НаКлиенте Тогда
			Попытка
		       Сообщить("ОШИБКА! Информация с сайта не скопирована в файл: <"+СокрЛП(ИмяФайлаНазначение)+">",СтатусСообщения.ОченьВажное);
 			Исключение
				//				
			КонецПопытки;		 
 		#КонецЕсли
  		Возврат;
	Иначе
		#Если НаКлиенте Тогда
			Попытка
		       Сообщить("Информация с сайта скопирована в файл: <"+СокрЛП(ФайлНаДиске.ПолноеИмя)+">");
 			Исключение
				//				
			КонецПопытки;		 
 		#КонецЕсли
	КонецЕсли;  
	
	ёё = 0;
	
	ПроизводительАвито         = Справочники.Марка_Авито.ПустаяСсылка();
 	 
	ёё = 0;
	
	ПротзводительАвито         = Справочники.Марка_Авито.ПустаяСсылка();
 	АртикулМарки       = "";
  	
	ЧтениеXML = Новый ЧтениеXML();
	
	ЧтениеXML.ОткрытьФайл(ИмяФайлаНазначение);
	
 	Пока ЧтениеXML.Прочитать() Цикл
 		
 		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			ТекущееИмя = ЧтениеXML.Имя;
			
			Если ТекущееИмя = "Brand" Тогда 
 				НаименованиеПроизводителя = ЧтениеXML.ПолучитьАтрибут(0);
			Иначе 
				НаименованиеПроизводителя = "";
			КонецЕсли; 
     
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
  			
			Если ТекущееИмя = "Brand" Тогда 
				Если НЕ обЗначениеНеЗаполнено(НаименованиеПроизводителя) Тогда
 	 				ПроизводительАвито = НайтиИлиСоздатьПроизводителяАвито(НаименованиеПроизводителя);
				КонецЕсли;
   			КонецЕсли; 
			
   		КонецЕсли;
		
	КонецЦикла;
	
	ЧтениеXML.Закрыть();	

	
КонецПроцедуры

Функция НайтиИлиСоздатьПроизводителяАвито(Наименование) Экспорт
	
	НовПроизводительАвито = Справочники.Производители_Авито.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Производитель_Авито.Ссылка,
		|	Производитель_Авито.Наименование
		|ИЗ
		|	Справочник.Производители_Авито КАК Производитель_Авито
		|ГДЕ
		|	Производитель_Авито.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовПроизводительАвито = ВыборкаДетальныеЗаписи.Ссылка;
		Возврат НовПроизводительАвито;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовПроизводительАвито) Тогда
		
		НовПроизводительАвито = Справочники.Производители_Авито.СоздатьЭлемент();
		НовПроизводительАвито.УстановитьНовыйКод("ЦБ");
		НовПроизводительАвито.Наименование = Наименование;
		
		Попытка 
			НовПроизводительАвито.Записать(); 
		Исключение  
			//
		КонецПопытки;
		
	КонецЕсли; 
 
	Возврат НовПроизводительАвито.Ссылка;

КонецФункции // НайтиИлиСоздатьМарку(Наименование) 

//Функция НайтиИлиСоздатьМодель(Наименование,Артикул,Марка) Экспорт
//	
//	НовМодель = Справочники.Модели_Авито.ПустаяСсылка();
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	Модель_Авито.Ссылка,
//		|	Модель_Авито.Наименование,
//		|	Модель_Авито.Артикул
//		|ИЗ
//		|	Справочник.Модели_Авито КАК Модель_Авито
//		|ГДЕ
//		|	Модель_Авито.Наименование = &Наименование
//		|	И Модель_Авито.МаркаАвито = &Марка
//		|	И Модель_Авито.Артикул = &Артикул";
//	
//	Запрос.УстановитьПараметр("Наименование", Наименование);
//	Запрос.УстановитьПараметр("Артикул", Артикул);
//	Запрос.УстановитьПараметр("Марка", Марка);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		НовМодель = ВыборкаДетальныеЗаписи.Ссылка;
//		Возврат НовМодель;
//	КонецЦикла;
//	
//	Если обЗначениеНеЗаполнено(НовМодель) Тогда
//		
//		НовМодель = Справочники.Модели_Авито.СоздатьЭлемент();
//		НовМодель.УстановитьНовыйКод("ЦБ");
//		НовМодель.Наименование = Наименование;
//		НовМодель.Артикул = Артикул;
//		НовМодель.МаркаАвито = Марка; 
//		
//		Попытка	НовМодель.Записать(); Исключение КонецПопытки;
//		
//	КонецЕсли; 
// 
//	Возврат НовМодель.Ссылка;

//КонецФункции // НайтиИлиСоздатьМодель(Наименование,Марка)

//Функция НайтиИлиСоздатьМодификацию(Наименование,Артикул,Модель,Генерация) Экспорт
//	
//	НовМодификация = Справочники.Модификации_Авито.ПустаяСсылка();
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	Модификация_Авито.Ссылка,
//		|	Модификация_Авито.Наименование,
//		|	Модификация_Авито.Владелец,
//		|	Модификация_Авито.Артикул,
//		|	Модификация_Авито.ГенерацияАвито
//		|ИЗ
//		|	Справочник.Модификации_Авито КАК Модификация_Авито
//		|ГДЕ
//		|	Модификация_Авито.Наименование = &Наименование
//		|	И Модификация_Авито.Владелец = &Модель
//		|	И Модификация_Авито.Артикул = &Артикул";
//	
//	Запрос.УстановитьПараметр("Наименование", Наименование);
//	Запрос.УстановитьПараметр("Артикул", Артикул);
//	Запрос.УстановитьПараметр("Модель", Модель);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		НовМодификация = ВыборкаДетальныеЗаписи.Ссылка;
//		Если обЗначениеНеЗаполнено(ВыборкаДетальныеЗаписи.ГенерацияАвито) Тогда
//			СпрОбъект = НовМодификация.ПолучитьОбъект(); 
//			СпрОбъект.ГенерацияАвито = Генерация;
//			Попытка	СпрОбъект.Записать(); Исключение КонецПопытки;
// 		КонецЕсли; 

//		Возврат НовМодификация;
//	КонецЦикла;
//	
//	Если обЗначениеНеЗаполнено(НовМодификация) Тогда
//		
//		НовМодификация = Справочники.Модификации_Авито.СоздатьЭлемент();
//		НовМодификация.УстановитьНовыйКод("ЦБ");
//		НовМодификация.Наименование = Наименование;
//		НовМодификация.Артикул = Артикул;
//		НовМодификация.Владелец = Модель; 
//		НовМодификация.ГенерацияАвито = Генерация;
//		
//		Попытка	НовМодификация.Записать(); Исключение КонецПопытки;
//		
//	КонецЕсли; 
// 
//	Возврат НовМодификация.Ссылка;

//КонецФункции // НайтиИлиСоздатьМодификацию(Наименование,Модель)

//Функция НайтиИлиСоздатьГенерацию(Наименование,Артикул,Модель) Экспорт
//	
//	НовГенерация = Справочники.Генерации_Авито.ПустаяСсылка();
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	Генерация_Авито.Ссылка,
//		|	Генерация_Авито.Наименование,
//		|	Генерация_Авито.Владелец,
//		|	Генерация_Авито.Артикул
//		|ИЗ
//		|	Справочник.Генерации_Авито КАК Генерация_Авито
//		|ГДЕ
//		|	Генерация_Авито.Наименование = &Наименование
//		|	И Генерация_Авито.Владелец = &Модель
//		|	И Генерация_Авито.Артикул = &Артикул";
//	
//	Запрос.УстановитьПараметр("Наименование", Наименование);
//	Запрос.УстановитьПараметр("Артикул", Артикул);
//	Запрос.УстановитьПараметр("Модель", Модель);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		НовГенерация = ВыборкаДетальныеЗаписи.Ссылка;
//		Возврат НовГенерация;
//	КонецЦикла;
//	
//	Если обЗначениеНеЗаполнено(НовГенерация) Тогда
//		
//		НовГенерация = Справочники.Генерации_Авито.СоздатьЭлемент();
//		НовГенерация.УстановитьНовыйКод("ЦБ");
//		НовГенерация.Наименование = Наименование;
// 		НовГенерация.Артикул = Артикул;
//		НовГенерация.Владелец = Модель; 
//		
//		Попытка	НовГенерация.Записать(); Исключение КонецПопытки;
//		
//	КонецЕсли; 
// 
//	Возврат НовГенерация.Ссылка;

//КонецФункции // НайтиИлиСоздатьМодификацию(Наименование,Модель)

//Функция НайтиИлиСоздатьКомплектацию(Наименование,Артикул,Модификация,Генерация) Экспорт
//	
//	НовКомплектация = Справочники.Комплектации_Авито.ПустаяСсылка();
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	Комплектация_Авито.Ссылка,
//		|	Комплектация_Авито.Наименование,
//		|	Комплектация_Авито.Владелец,
//		|	Комплектация_Авито.Артикул,
//		|	Комплектация_Авито.ГенерацияАвито
//		|ИЗ
//		|	Справочник.Комплектации_Авито КАК Комплектация_Авито
//		|ГДЕ
//		|	Комплектация_Авито.Наименование = &Наименование
//		|	И Комплектация_Авито.Владелец = &Модификация
//		|	И Комплектация_Авито.Артикул = &Артикул";
//	
//	Запрос.УстановитьПараметр("Наименование", Наименование);
//	Запрос.УстановитьПараметр("Артикул", Артикул);
//	Запрос.УстановитьПараметр("Модификация", Модификация);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		НовКомплектация = ВыборкаДетальныеЗаписи.Ссылка;
//		Если обЗначениеНеЗаполнено(ВыборкаДетальныеЗаписи.ГенерацияАвито) Тогда
//			СпрОбъект = НовКомплектация.ПолучитьОбъект();
//			СпрОбъект.ГенерацияАвито = Генерация;
//			Попытка	СпрОбъект.Записать(); Исключение КонецПопытки;
// 		КонецЕсли; 
//		Возврат НовКомплектация;
//	КонецЦикла;
//	
//	Если обЗначениеНеЗаполнено(НовКомплектация) Тогда
//		
//		НовКомплектация = Справочники.Комплектации_Авито.СоздатьЭлемент();
//		НовКомплектация.УстановитьНовыйКод("ЦБ");
//		НовКомплектация.Наименование = Наименование;
//		НовКомплектация.Артикул = Артикул;
//		НовКомплектация.Владелец = Модификация;
//		НовКомплектация.ГенерацияАвито = Генерация;
//		
//		Попытка	НовКомплектация.Записать(); Исключение	КонецПопытки;
//		
//	КонецЕсли; 
// 
//	Возврат НовКомплектация.Ссылка;

//КонецФункции // НайтиИлиСоздатьКомплектацию(Наименование,Модификация)

//Функция НайтиИлиСоздатьТипКузова(Наименование,Артикул) Экспорт

// 	ТипКузоваАвитоКоммерческий = Справочники.СМ_ТипыКузововАвито.СоздатьЭлемент();
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	СМ_ТипыКузововАвито.Ссылка,
//	|	СМ_ТипыКузововАвито.Наименование,
//	|	СМ_ТипыКузововАвито.Артикул
//	|ИЗ
//	|	Справочник.СМ_ТипыКузововАвито КАК СМ_ТипыКузововАвито
//	|ГДЕ
//	|	СМ_ТипыКузововАвито.Наименование = &Наименование
//	|	И НЕ СМ_ТипыКузововАвито.Коммерческий
//	|	И СМ_ТипыКузововАвито.Артикул = &Артикул";
//	
//	Запрос.УстановитьПараметр("Наименование", Наименование);
//	Запрос.УстановитьПараметр("Артикул", Артикул);
// 	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		ТипКузоваАвитоКоммерческий = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
// 	КонецЦикла;
//	
// 	Если обЗначениеНеЗаполнено(ТипКузоваАвитоКоммерческий.Ссылка) Тогда
//		
//		БылиОшибки = Ложь;
// 		ТипКузоваАвитоКоммерческий.Наименование = Наименование; 
//		ТипКузоваАвитоКоммерческий.Артикул = Артикул; 		
//		ТипКузоваАвитоКоммерческий.Коммерческий = Ложь;		
//		ТипКузоваАвитоКоммерческий.УстановитьНовыйКод();
// 		
//		Попытка	
//			ТипКузоваАвитоКоммерческий.Записать(); 
// 		Исключение    
//			БылиОшибки = Истина;
// 		КонецПопытки;

//		Если Отладка Тогда 	    
//			Если НЕ БылиОшибки Тогда 	    
//	 			СМГ_Сообщить("Записан новый элемент справочника СМ_ТипыКузововАвито  с наименованием = <"+Наименование+">.",СтатусСообщения.ОченьВажное);
//	  		Иначе
//	 			СМГ_Сообщить("ОШИБКА! Не удалось записать элемент справочника СМ_ТипыКузововАвито  с наименованием = <"+Наименование+">.",СтатусСообщения.ОченьВажное);
//			КонецЕсли;
//		КонецЕсли;	
//		
//	КонецЕсли;
// 
//	Если Отладка Тогда 	    
// 		СМГ_Сообщить("Обнаружен элемент справочника СМ_ТипыКузововАвито = <"+ТипКузоваАвитоКоммерческий+">." );
//  	КонецЕсли;
//	
//	Возврат ТипКузоваАвитоКоммерческий.Ссылка;
//	
//КонецФункции // НайтиСоздатьТипКузова(Наименование)
// 