//#Если Сервер Тогда	
Процедура ВыгрузкаДляNissanSmartTools(Параметры = Неопределено) Экспорт
	ОрганизацияАвтопарк = Справочники.Организации.НайтиПоКоду("ЦБ000008"); // ООО Автопарк
	ГруппаПодразделенийОлимп = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001160"); // группа Олимп!!!
	ЗаписьJSON = Новый ЗаписьJSON();
	стЗапись = Новый Структура();
	
	стЗапись.Вставить("outlet_code", "21112401");
	стЗапись.Вставить("email", "Solop_e");
	стЗапись.Вставить("password", "Kot2525kot");
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, стЗапись);
	ВыгрузкаДилераNissan(ЗаписьJSON, ОрганизацияАвтопарк, ГруппаПодразделенийОлимп, "52");
	
	ОрганизацияАвтопаркПлюс = Справочники.Организации.НайтиПоКоду("ЦБ000016"); // ООО Автопарк Плюс
	ГруппаПодразделенийВолгодонск = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000190"); // группа Ниссан Волгодонск!!!
	стЗапись.Вставить("outlet_code", "21115701"); // Волгодонск
	стЗапись.Вставить("email", "dmityayev");
	стЗапись.Вставить("password", "123456N");
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, стЗапись);
	ВыгрузкаДилераNissan(ЗаписьJSON, ОрганизацияАвтопаркПлюс, ГруппаПодразделенийВолгодонск, "72");
КонецПроцедуры

Процедура ВыгрузкаДилераNissan(ЗаписьJSON, Организация, ГруппаПодразделений, КодДилераСтрока)	
	// устанавливаем соединение с сервером
	Таймаут = 120;
	SSL =  Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows(), Новый СертификатыУдостоверяющихЦентровWindows());
	Попытка
	    НТТР = Новый HTTPСоединение("api.nissansmtool.ru", , , , , Таймаут, SSL); // Рабочий сервер
	Исключение
		#Если Клиент Тогда
		Сообщить("Не удалось установить соединение с сервером:" 
		    	+ Символы.ПС + ИнформацияОбОшибке().Описание, СтатусСообщения.Важное);
        #Иначе 
        ЗаписьЖурналаРегистрации("ВыгрузкаSmartTools.HTTPСоединение", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось установить соединение с сервером: " + ОписаниеОшибки()); 
        #КонецЕсли
	    Возврат;
	КонецПопытки;
	
	// Заголовки запросов	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Type", "application/json");
	//ЗаголовкиHTTP.Вставить("Accept", "application/json");
	ЗаголовкиHTTP.Вставить("Connection", "Keep-Alive");
	
	ЗапросHTTP = Новый HTTPЗапрос();
	ЗапросHTTP.Заголовки = ЗаголовкиHTTP;
	
	// получение маркера доступа
	ЗапросHTTP.АдресРесурса = "/api/auth/login";	
	ТелоЗапроса = ЗаписьJSON.Закрыть();	
	ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);		
	
	НТТРОтвет = НТТР.ОтправитьДляОбработки(ЗапросHTTP);
	ТелоОтвета = НТТРОтвет.ПолучитьТелоКакСтроку();	
	КодСостоянияСервера = НТТРОтвет.КодСостояния;
	Если КодСостоянияСервера < 300 Тогда
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
		Попытка
			стОтвет = ПрочитатьJSON(ЧтениеJSON);
		Исключение
			#Если Клиент Тогда
			Сообщить("JSON-парсинг ответа на запрос токена:" + Символы.ПС 
			+ "Код состояния: " + НТТРОтвет.КодСостояния  + Символы.ПС 
			+ "Тело ответа: " + ТелоОтвета, СтатусСообщения.Важное);
	        #Иначе 
	        ЗаписьЖурналаРегистрации("ВыгрузкаSmartTools.ЗапросМаркераДоступа", УровеньЖурналаРегистрации.Ошибка, , , "Парсинг JSON: " + ОписаниеОшибки()); 
	        #КонецЕсли
			Возврат;
		КонецПопытки;
		МаркерДоступа = стОтвет.access_token;
		ТипМаркераДоступа = стОтвет.token_type;
	Иначе
		#Если Клиент Тогда	
		Сообщить("Ошибка запроса токена:" + Символы.ПС 
		+ "Код состояния: " + НТТРОтвет.КодСостояния  + Символы.ПС 
		+ "Тело ответа: " + ТелоОтвета, СтатусСообщения.Важное);
        #Иначе 
        ЗаписьЖурналаРегистрации("ВыгрузкаSmartTools.ЗапросМаркераДоступа", УровеньЖурналаРегистрации.Ошибка, , , "Ошибка запроса токена: " + ТелоОтвета); 
        #КонецЕсли
		Возврат;
	КонецЕсли;
	
	Разделитель = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
	ЗаголовкиHTTP.Вставить("Content-Type", "multipart/form-data; boundary=" + Разделитель);
	ЗаголовкиHTTP.Вставить("Authorization", ТипМаркераДоступа + " " + МаркерДоступа);
	
	// Выгрузить склад дилера
	ЗапросHTTP.АдресРесурса = "/api/v1/configurations/upload";
	ИмяФайлаСодержимогоСклада = ПолучитьИмяВременногоФайла("xls");	
	Если Не СформироватьФайлСодержимогоСклада(ИмяФайлаСодержимогоСклада, Организация) Тогда
		Возврат;
	КонецЕсли;
	ДанныеТелаЗапроса = СформироватьТелоЗапроса(ИмяФайлаСодержимогоСклада, Разделитель);
    РазмерФайлаОтправки = XMLСтрока(ДанныеТелаЗапроса.Размер()); 
    ЗаголовкиHTTP.Вставить("Content-Length", РазмерФайлаОтправки);
	ЗапросHTTP.Заголовки = ЗаголовкиHTTP;
	
	ЗапросHTTP.УстановитьТелоИзДвоичныхДанных(ДанныеТелаЗапроса);
	ТелоЗапроса = ЗапросHTTP.ПолучитьТелоКакСтроку();
	
	НТТРОтвет = НТТР.ОтправитьДляОбработки(ЗапросHTTP);	
	ТелоОтвета = НТТРОтвет.ПолучитьТелоКакСтроку();	
	КодСостоянияСервера = НТТРОтвет.КодСостояния;
	Если КодСостоянияСервера > 299 Тогда
		#Если Клиент Тогда	
		Сообщить("Ошибка выполнения запроса:" + Символы.ПС 
		+ "Код состояния: " + НТТРОтвет.КодСостояния  + Символы.ПС 
		+ "Тело ответа: " + ТелоОтвета, СтатусСообщения.Важное);
        #Иначе 
        ЗаписьЖурналаРегистрации("ВыгрузкаSmartTools.ФайлСклада", УровеньЖурналаРегистрации.Ошибка, , , "Ошибка выполнения запроса: " + ТелоОтвета); 
        #КонецЕсли
	КонецЕсли;	
	УдалитьФайлы(ИмяФайлаСодержимогоСклада);

	// Выгрузить аксессуары
	ЗапросHTTP.АдресРесурса = "/api/v1/dealers/" + КодДилераСтрока + "/accessories/"; 
	ИмяФайлаАксессуаров = ПолучитьИмяВременногоФайла("xls");	
	Если Не СформироватьФайлАксессуаров(ИмяФайлаАксессуаров, ГруппаПодразделений) Тогда
		Возврат;
	КонецЕсли;
	ДанныеТелаЗапроса = СформироватьТелоЗапроса(ИмяФайлаАксессуаров, Разделитель);
    РазмерФайлаОтправки = XMLСтрока(ДанныеТелаЗапроса.Размер()); 
    ЗаголовкиHTTP.Вставить("Content-Length", РазмерФайлаОтправки);
	ЗапросHTTP.Заголовки = ЗаголовкиHTTP;
	
	ЗапросHTTP.УстановитьТелоИзДвоичныхДанных(ДанныеТелаЗапроса);
	ТелоЗапроса = ЗапросHTTP.ПолучитьТелоКакСтроку();
	
	НТТРОтвет = НТТР.ОтправитьДляОбработки(ЗапросHTTP);	
	ТелоОтвета = НТТРОтвет.ПолучитьТелоКакСтроку();	
	КодСостоянияСервера = НТТРОтвет.КодСостояния;
	Если КодСостоянияСервера > 299 Тогда
		#Если Клиент Тогда	
		Сообщить("Ошибка выполнения запроса:" + Символы.ПС 
		+ "Код состояния: " + НТТРОтвет.КодСостояния  + Символы.ПС 
		+ "Тело ответа: " + ТелоОтвета, СтатусСообщения.Важное);
        #Иначе 
        ЗаписьЖурналаРегистрации("ВыгрузкаSmartTools.ФайлСклада", УровеньЖурналаРегистрации.Ошибка, , , "Ошибка выполнения запроса: " + ТелоОтвета); 
        #КонецЕсли
	КонецЕсли;	
	УдалитьФайлы(ИмяФайлаАксессуаров);
		
КонецПроцедуры

Функция СформироватьТелоЗапроса(ИмяФайлаСодержимого, Разделитель)
    ПотокТелоЗапроса = Новый ПотокВПамяти();
    ЗаписьТелоЗапроса = Новый ЗаписьДанных(ПотокТелоЗапроса);
    
    ЗаписьТелоЗапроса.ЗаписатьСтроку("--" + Разделитель);
	ЗаписьТелоЗапроса.ЗаписатьСтроку("Content-Disposition: form-data; name=file; filename=21112401.xls");
    //ЗаписьТелоЗапроса.ЗаписатьСтроку("Content-Type: application/x-octet-stream"); 
    ЗаписьТелоЗапроса.ЗаписатьСтроку("Content-Type: application/octet-stream"); 
    ЗаписьТелоЗапроса.ЗаписатьСтроку(""); 
	
	ЧтениеФайла = Новый ЧтениеДанных(ИмяФайлаСодержимого);
	ДвоичныеДанныеФайла = ЧтениеФайла.Прочитать().ПолучитьДвоичныеДанные();
	ЗаписьТелоЗапроса.Записать(ДвоичныеДанныеФайла);
	ЗаписьТелоЗапроса.ЗаписатьСтроку("");
	
	ЗаписьТелоЗапроса.ЗаписатьСтроку("--" + Разделитель); 
    ЗаписьТелоЗапроса.ЗаписатьСтроку("Content-disposition: form-data; name=message"); 
    ЗаписьТелоЗапроса.ЗаписатьСтроку("Content-Type: text/plain"); 
	ЗаписьТелоЗапроса.ЗаписатьСтроку("");
    ЗаписьТелоЗапроса.ЗаписатьСтроку("Передача файла из базы данных 1С Предприятия");	
   
	ЗаписьТелоЗапроса.ЗаписатьСтроку("");
    ЗаписьТелоЗапроса.ЗаписатьСтроку("--" + Разделитель + "--");
    ЗаписьТелоЗапроса.Закрыть();
    
    Возврат ПотокТелоЗапроса.ЗакрытьИПолучитьДвоичныеДанные();
КонецФункции

Функция СформироватьФайлСодержимогоСклада(ИмяФайла, Организация)		
	ЗапросСклад = Новый Запрос();
	ЗапросСклад.УстановитьПараметр("Организация", Организация);
	ЗапросСклад.УстановитьПараметр("ТипСклада", Перечисления.ТипыСкладов.Автомобильный);
	ЗапросСклад.УстановитьПараметр("МаркаАвтомобилей", Справочники.Марка.NISSAN);
	ЗапросСклад.УстановитьПараметр("ВидАвтомобиля", Перечисления.ВидАвтомобиля.Новый);
	ЗапросСклад.УстановитьПараметр("ДляТестдрайва", ПланыВидовХарактеристик.СвойстваОбъектов.ИспользоватьДляТестДрайва);
	ЗапросСклад.Текст = "ВЫБРАТЬ
	                    |	ОстаткиАвтомобилейОстатки.Автомобиль.Ссылка,
	                    |	ОстаткиАвтомобилейОстатки.Автомобиль.Код,
	                    |	ОстаткиАвтомобилейОстатки.Автомобиль.VIN,
	                    |	ОстаткиАвтомобилейОстатки.Автомобиль.ГодВыпуска,
	                    |	ОстаткиАвтомобилейОстатки.Автомобиль.Модель КАК Модель,
	                    |	ЦеныАвтомобилейСрезПоследних.Цена,
	                    |	ЗначенияСвойствОбъектов.Значение КАК ЗначениеСвойства,
	                    |	ЗначенияСвойствОбъектов.Свойство
	                    |ПОМЕСТИТЬ ОстаткиНовыхАвто
	                    |ИЗ
	                    |	РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилейОстатки
	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныАвтомобилей.СрезПоследних КАК ЦеныАвтомобилейСрезПоследних
	                    |		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ЦеныАвтомобилейСрезПоследних.Автомобиль
	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	                    |		ПО ОстаткиАвтомобилейОстатки.Автомобиль = АвтомобилиСрезПоследних.Автомобиль
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	                    |		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ЗначенияСвойствОбъектов.Объект
	                    |ГДЕ
	                    |	ОстаткиАвтомобилейОстатки.СкладКомпании.Организация = &Организация
	                    |	И ОстаткиАвтомобилейОстатки.СкладКомпании.ТипСклада = &ТипСклада
	                    |	И ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0
	                    |	И АвтомобилиСрезПоследних.Значение = &ВидАвтомобиля
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	ОстаткиНовыхАвто.АвтомобильСсылка КАК Автомобиль,
	                    |	ОстаткиНовыхАвто.АвтомобильКод КАК Код,
	                    |	ОстаткиНовыхАвто.АвтомобильСсылка.ВариантКомплектации.Артикул КАК КодКомплектации,
	                    |	ОстаткиНовыхАвто.АвтомобильСсылка.ЦветКод КАК КодЦвета,
	                    |	ОстаткиНовыхАвто.АвтомобильVIN КАК ВИН,
	                    |	ОстаткиНовыхАвто.АвтомобильГодВыпуска КАК ГодВыпуска,
	                    |	ОстаткиНовыхАвто.Цена,
	                    |	МАКСИМУМ(ВЫБОР
	                    |			КОГДА ОстаткиНовыхАвто.Свойство ЕСТЬ NULL
	                    |				ТОГДА 0
	                    |			КОГДА ОстаткиНовыхАвто.Свойство = &ДляТестдрайва
	                    |				ТОГДА ВЫБОР
	                    |						КОГДА ОстаткиНовыхАвто.ЗначениеСвойства = ИСТИНА
	                    |							ТОГДА 1
	                    |						ИНАЧЕ 0
	                    |					КОНЕЦ
	                    |			ИНАЧЕ 0
	                    |		КОНЕЦ) КАК ДляТестДрайва
	                    |ИЗ
	                    |	ОстаткиНовыхАвто КАК ОстаткиНовыхАвто
	                    |ГДЕ
	                    |	ОстаткиНовыхАвто.Модель.Марка = &МаркаАвтомобилей
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ОстаткиНовыхАвто.АвтомобильСсылка,
	                    |	ОстаткиНовыхАвто.АвтомобильКод,
	                    |	ОстаткиНовыхАвто.АвтомобильVIN,
	                    |	ОстаткиНовыхАвто.АвтомобильГодВыпуска,
	                    |	ОстаткиНовыхАвто.Цена,
	                    |	ОстаткиНовыхАвто.АвтомобильСсылка.ВариантКомплектации.Артикул,
	                    |	ОстаткиНовыхАвто.АвтомобильСсылка.ЦветКод";
		
	Excel = Неопределено;
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
	Исключение
		#Если Клиент Тогда
		Сообщить("Ошибка запуска MS Excel:" + Символы.ПС + ОписаниеОшибки());
        #Иначе 
        ЗаписьЖурналаРегистрации("ВыгрузкаSmartTools.ЗапускExcel", УровеньЖурналаРегистрации.Ошибка, , , "Ошибка запуска MS Excel: " + ОписаниеОшибки()); 
        #КонецЕсли
		Возврат Ложь;
	КонецПопытки;
	WorkBook = Excel.Workbooks.Add();
	WorkSheet = WorkBook.WorkSheets.Item(1);
	
	
	Остатки = ЗапросСклад.Выполнить().Выгрузить();
	КоличествоСтрок = Остатки.Количество();
	нстр = 1; сч = 1;
	Для Каждого СтрокаДанные Из Остатки Цикл
		//Worksheet.Rows(нстр).NumberFormat = "@";
		WorkSheet.Cells(нстр, 1).Value = СтрокаДанные.Код;
		//WorkSheet.Cells(нстр, 2).Value = СтрокаДанные.Модель;
		//WorkSheet.Cells(нстр, 3).Value = СтрокаДанные.ДатаНачалаГарантии;
		//WorkSheet.Cells(нстр, 4).Value = СтрокаДанные.ВидТО;
		//WorkSheet.Cells(нстр, 5).Value = СтрокаДанные.ДатаТО;
		//WorkSheet.Cells(нстр, 6).Value = СтрокаДанные.НомерЗаказНаряда;
		Если СтрДлина(СтрокаДанные.КодКомплектации) = 18 Или СтрДлина(СтрокаДанные.КодКомплектации) = 19 Тогда
			WorkSheet.Cells(нстр, 7).Value = СтрокаДанные.КодКомплектации; // Код комплектации
		Иначе
			Продолжить;
		КонецЕсли;
		
		Если СтрДлина(СтрокаДанные.КодЦвета) = 3 Или СтрДлина(СтрокаДанные.КодЦвета) = 4 Тогда
			WorkSheet.Cells(нстр, 8).Value = СтрокаДанные.КодЦвета; // Код цвета
		Иначе
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДанные.ГодВыпуска) Тогда
			WorkSheet.Cells(нстр, 9).Value = Год(СтрокаДанные.ГодВыпуска) // Год выпуска
		Иначе
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДанные.Цена) Тогда
			WorkSheet.Cells(нстр, 10).Value = СтрокаДанные.Цена; // Цена
		Иначе
			Продолжить;
		КонецЕсли;
		
		//WorkSheet.Cells(нстр, 11).Value = СтрокаДанные.ТелефонКлиента;
		WorkSheet.Cells(нстр, 12).Value = СтрокаДанные.ВИН;
		//WorkSheet.Cells(нстр, 13).Value = СтрокаДанные.АдресКлиента;
		//WorkSheet.Cells(нстр, 14).Value = СтрокаДанные.ВидРемонта;
		WorkSheet.Cells(нстр, 15).Value = 90; // Логистический статус
		WorkSheet.Cells(нстр, 16).Value = СтрокаДанные.ДляТестДрайва; // Для тест-драйва
		WorkSheet.Cells(нстр, 17).Value = 0; // Бонусы продавцу
		WorkSheet.Cells(нстр, 18).Value = 0; // Срочная продажа

		нстр  = нстр + 1;
	КонецЦикла;
	
	xlExcel8 = 56;
	Попытка
		WorkBook.SaveAs(ИмяФайла, xlExcel8);
	Исключение
		#Если Клиент Тогда
		Сообщить("Ошибка при сохранении книги " + ИмяФайла + ":" + Символы.ПС + ОписаниеОшибки());
        #Иначе 
        ЗаписьЖурналаРегистрации("ВыгрузкаSmartTools.СохранениеExcel", УровеньЖурналаРегистрации.Ошибка, , , "Ошибка при сохранении книги: " + ОписаниеОшибки()); 
        #КонецЕсли
		Excel.Quit();
		Возврат Ложь; 
	КонецПопытки;
	
	Excel.Quit();	
	Возврат Истина;
КонецФункции

Функция СформироватьФайлАксессуаров(ИмяФайла, ГруппаПодразделений)
	ГруппаПодразделений = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001160"); // группа Олимп!!!
	ЗапросСклад = Новый Запрос();
	ЗапросСклад.УстановитьПараметр("ГруппаПодразделений", ГруппаПодразделений);
	ЗапросСклад.УстановитьПараметр("ГруппаНиссанДО", Справочники.Номенклатура.НайтиПоКоду("ЦБ269653"));
	ЗапросСклад.УстановитьПараметр("ГруппаНиссан", Справочники.Производители.Nissan);
	ЗапросСклад.УстановитьПараметр("ЦеныПродажи", Справочники.ТипыЦен.ОсновнойТипЦенПродажи);
	ЗапросСклад.Текст = "ВЫБРАТЬ
	                    |	ОстаткиТоваровКомпанииОстатки.Номенклатура.Артикул КАК Артикул,
	                    |	ОстаткиТоваровКомпанииОстатки.Номенклатура.Наименование КАК Наименование,
	                    |	ОстаткиТоваровКомпанииОстатки.Номенклатура.ГруппаАксессуаров.ОбозначениеГруппы КАК Категория,
	                    |	ЦеныСрезПоследних.Цена,
	                    |	ОстаткиТоваровКомпанииОстатки.Номенклатура.ЦенаУстановки КАК ЦенаУстановки,
	                    |	ОстаткиТоваровКомпанииОстатки.Номенклатура.ГруппаАксессуаров.ПриоритетВыдачи КАК ПриоритетВыдачи
	                    |ИЗ
	                    |	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
	                    |			,
	                    |			СкладКомпании.Подразделение В ИЕРАРХИИ (&ГруппаПодразделений)
	                    |				И Номенклатура В ИЕРАРХИИ (&ГруппаНиссанДО)
	                    |				И Номенклатура.Производитель В ИЕРАРХИИ (&ГруппаНиссан)) КАК ОстаткиТоваровКомпанииОстатки
	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(
	                    |				,
	                    |				ТипЦен = &ЦеныПродажи
	                    |					И ПодразделениеКомпании В ИЕРАРХИИ (&ГруппаПодразделений)
	                    |					И Номенклатура В ИЕРАРХИИ (&ГруппаНиссанДО)
	                    |					И Номенклатура.Производитель В ИЕРАРХИИ (&ГруппаНиссан)) КАК ЦеныСрезПоследних
	                    |		ПО ОстаткиТоваровКомпанииОстатки.Номенклатура = ЦеныСрезПоследних.Номенклатура";
		
	Excel = Неопределено;
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
	Исключение
		#Если Клиент Тогда
		Сообщить("Ошибка запуска MS Excel:" + Символы.ПС + ОписаниеОшибки());
        #Иначе 
        ЗаписьЖурналаРегистрации("ВыгрузкаSmartTools.ЗапускExcel", УровеньЖурналаРегистрации.Ошибка, , , "Ошибка запуска MS Excel: " + ОписаниеОшибки()); 
        #КонецЕсли
		Возврат Ложь;
	КонецПопытки;
	WorkBook = Excel.Workbooks.Add();
	WorkSheet = WorkBook.WorkSheets.Item(1);
	
	
	Остатки = ЗапросСклад.Выполнить().Выгрузить();
	// 1-я сторока - Заголовок
	WorkSheet.Cells(1, 1).Value = "Серийный номер*";
	WorkSheet.Cells(1, 2).Value = "Наименование*";
	WorkSheet.Cells(1, 3).Value = "Код модели";
	WorkSheet.Cells(1, 4).Value = "Категория*";
	WorkSheet.Cells(1, 5).Value = "Код комплектации";
	WorkSheet.Cells(1, 6).Value = "Цена (руб.)*";
	WorkSheet.Cells(1, 7).Value = "Цена установки (руб.)*";
	WorkSheet.Cells(1, 8).Value = "nofit";
	WorkSheet.Cells(1, 9).Value = "extrafit";
	WorkSheet.Cells(1, 10).Value = "optionfit";	
	WorkSheet.Cells(1, 11).Value = "Приоритет";
	WorkSheet.Cells(1, 12).Value = "Изображение";
	нстр = 2; сч = 1;
	Для Каждого СтрокаДанные Из Остатки Цикл
		Если ТолькоЦифровойАртикул(СтрокаДанные.Артикул) Тогда
			Продолжить;
		КонецЕсли;
		
		//Worksheet.Cells(нстр, 1).NumberFormat = "@";
		WorkSheet.Cells(нстр, 1).Value = СтрокаДанные.Артикул;
		WorkSheet.Cells(нстр, 2).Value = СтрокаДанные.Наименование;
		//WorkSheet.Cells(нстр, 3).Value = СтрокаДанные.ДатаНачалаГарантии;
		WorkSheet.Cells(нстр, 4).Value = СтрокаДанные.Категория;
		//WorkSheet.Cells(нстр, 5).Value = СтрокаДанные.ДатаТО;
		WorkSheet.Cells(нстр, 6).Value = СтрокаДанные.Цена;
		WorkSheet.Cells(нстр, 7).Value = СтрокаДанные.ЦенаУстановки;
		//WorkSheet.Cells(нстр, 8).Value = СтрокаДанные.ТелефонКлиента;
		//WorkSheet.Cells(нстр, 9).Value = СтрокаДанные.ТелефонКлиента;
		//WorkSheet.Cells(нстр, 10).Value = СтрокаДанные.ТелефонКлиента;	
		WorkSheet.Cells(нстр, 11).Value = СтрокаДанные.ПриоритетВыдачи;
		//WorkSheet.Cells(нстр, 12).Value = СтрокаДанные.ВИН;

		нстр  = нстр + 1;
	КонецЦикла;
	
	xlExcel8 = 56;
	Попытка
		WorkBook.SaveAs(ИмяФайла, xlExcel8);
	Исключение
		#Если Клиент Тогда
		Сообщить("Ошибка при сохранении книги " + ИмяФайла + ":" + Символы.ПС + ОписаниеОшибки());
        #Иначе 
        ЗаписьЖурналаРегистрации("ВыгрузкаSmartTools.СохранениеExcel", УровеньЖурналаРегистрации.Ошибка, , , "Ошибка при сохранении книги: " + ОписаниеОшибки()); 
        #КонецЕсли
		Excel.Quit();
		Возврат Ложь; 
	КонецПопытки;
	
	Excel.Quit();	
	Возврат Истина;
КонецФункции

Функция ТолькоЦифровойАртикул(Артикул)
	Длина = СтрДлина(Артикул);
	Если Длина < 7 Или Длина > 16 Тогда
		Возврат Истина; // арткул не относится к товарам Ниссан
	КонецЕсли;
	// усеченный вариант "0123456789ABCDEFGHJKLMNPRSTUVWXYZ"
	Артикул = ВРег(Артикул);
	Для сч = 1 По Длина Цикл
		Если Найти("ABCDEFGHIJKLMNOPQRSTUVWXYZ", Сред(Артикул, сч, 1)) > 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
		
	Возврат Истина;
КонецФункции