
Перем Шаблоны;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Шаблоны = Renault_РаботаСПравамиПользователя.ПолучитьМоиНастройки(ПараметрыСеанса.Пользователь);
	ЗагрузитьНастройкуДЦ();
	Заголовок ="Мои Настройки (" + ПараметрыСеанса.Пользователь.Наименование + ")";
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкуРесепшен()
	
	Шаблоны = Renault_РаботаСПравамиПользователя.ПолучитьМоиНастройки(ПараметрыСеанса.Пользователь);
	
	Для каждого Шаблон Из Шаблоны Цикл
		ОбШаблона = Шаблон.Ссылка.получитьОбъект();
		ОбШаблона.ЗапускатьПриСтартеАрмАдминистратора = ЗапускатьПриСтартеАРМАдминистартора;
		ОбШаблона.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкуМенеджер()
	
	Шаблоны = Renault_РаботаСПравамиПользователя.ПолучитьМоиНастройки(ПараметрыСеанса.Пользователь);
	
	Для каждого Шаблон Из Шаблоны Цикл
		ОбШаблона = Шаблон.Ссылка.получитьОбъект();
		ОбШаблона.ЗапускатьПриСтартеАрмМенеджера = ЗапускатьПриСтартеАРММенеджера;
		ОбШаблона.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкуРОП()
	
	Шаблоны = Renault_РаботаСПравамиПользователя.ПолучитьМоиНастройки(ПараметрыСеанса.Пользователь);
	
	Для каждого Шаблон Из Шаблоны Цикл
		ОбШаблона = Шаблон.Ссылка.получитьОбъект();
		ОбШаблона.ЗапускатьПриСтартеАрмРОП = ЗапускатьПриСтартеАРМРОПа;
		ОбШаблона.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкуАвтосклад()
	
	Шаблоны = Renault_РаботаСПравамиПользователя.ПолучитьМоиНастройки(ПараметрыСеанса.Пользователь);
	
	Для каждого Шаблон Из Шаблоны Цикл
		ОбШаблона = Шаблон.Ссылка.получитьОбъект();
		ОбШаблона.ЗапускатьПриСтартеАРМАвтосклад = ЗапускатьПриСтартеАРМАвтосклад;
		ОбШаблона.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкуПанельСообщений()
	
	Шаблоны = Renault_РаботаСПравамиПользователя.ПолучитьМоиНастройки(ПараметрыСеанса.Пользователь);
	
	Для каждого Шаблон Из Шаблоны Цикл
		ОбШаблона = Шаблон.Ссылка.получитьОбъект();
		ОбШаблона.ЗапкускатьПриСтартеПанельСообщений = ЗапускатьПриСтартеПанельСообщений;
		ОбШаблона.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкуДЦ()
	
	Если Renault_РаботаСПравамиПользователя.ЕстьПравоИспользоватьАрмМенеджера(ПараметрыСеанса.Пользователь)Тогда
		ЗапускатьПриСтартеАРММенеджера = Renault_РаботаСПравамиПользователя.ЗапускатьПриСтартеАрмМенеджера(ПараметрыСеанса.Пользователь);
		Элементы.ЗапускатьПриСтартеАРММенеджера.Доступность = Истина;
	Иначе
		Элементы.ЗапускатьПриСтартеАРММенеджера.Доступность = Ложь;
	КонецЕсли;
	
	Если Renault_РаботаСПравамиПользователя.ЕстьПравоИспользоватьАрмРесепшена(ПараметрыСеанса.Пользователь)Тогда
		Элементы.ЗапускатьПриСтартеАРМАдминистартора.Доступность = Истина;
		ЗапускатьПриСтартеАРМАдминистартора = Renault_РаботаСПравамиПользователя.ЗапускатьПриСтартеАрмРесепшен(ПараметрыСеанса.Пользователь);
	Иначе
		Элементы.ЗапускатьПриСтартеАРМАдминистартора.Доступность = Ложь;
	КонецЕсли;
	
	Если Renault_РаботаСПравамиПользователя.ЕстьПравоИспользоватьАрмРОП(ПараметрыСеанса.Пользователь)Тогда
		Элементы.ЗапускатьПриСтартеАРМРОПа.Доступность = Истина;
		ЗапускатьПриСтартеАРМРОПа = Renault_РаботаСПравамиПользователя.ЗапускатьПриСтартеАрмРОП(ПараметрыСеанса.Пользователь);
	Иначе
		Элементы.ЗапускатьПриСтартеАРМРОПа.Доступность = Ложь;
	КонецЕсли;
	
	Если Renault_РаботаСПравамиПользователя.ЕстьПравоИспользоватьПанельСообщений(ПараметрыСеанса.Пользователь)Тогда
		Элементы.ЗапускатьПриСтартеПанельСообщений.Доступность = Истина;
		ЗапускатьПриСтартеПанельСообщений = Renault_РаботаСПравамиПользователя.ЗапускатьПриСтартеПанельСообщений(ПараметрыСеанса.Пользователь);
	Иначе
		Элементы.ЗапускатьПриСтартеПанельСообщений.Доступность = Ложь;
	КонецЕсли;
	
	Если Renault_РаботаСПравамиПользователя.ЕстьПравоИспользоватьАрмАвтосклад(ПараметрыСеанса.Пользователь)Тогда
		ЗапускатьПриСтартеАРМАвтосклад = Renault_РаботаСПравамиПользователя.ЗапускатьПриСтартеАрмАвтосклад(ПараметрыСеанса.Пользователь);
		Элементы.ЗапускатьПриСтартеАРМАвтосклад.Доступность = Истина;
	Иначе
		Элементы.ЗапускатьПриСтартеАРМАвтосклад.Доступность = Ложь;
	КонецЕсли;
	
	Если Renault_РаботаСПравамиПользователя.ЕстьПравоИспользоватьАрмКонтактЦентр(ПараметрыСеанса.Пользователь)Тогда
		КЦ_РольПользователя = Renault_РаботаСПравамиПользователя.ПолучитьРольПользователя_КонтактЦентр(ПараметрыСеанса.Пользователь);
		Элементы.КЦ_РольПользователя.Доступность = Истина;
	Иначе
		Элементы.КЦ_РольПользователя.Доступность = Ложь;
	КонецЕсли;
	
	Емаил = Renault_РаботаСПравамиПользователя.ПолучитьЕмаилПользователя(ПараметрыСеанса.Пользователь);
	Телефон = Renault_РаботаСПравамиПользователя.ПолучитьТелефонПользователя(ПараметрыСеанса.Пользователь);
	
 КонецПроцедуры

&НаКлиенте
Процедура ЗапускатьПриСтартеАРМАдминистартораПриИзменении(Элемент)
	
	ЗаписатьНастройкуРесепшен();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапускатьПриСтартеАРММенеджераПриИзменении(Элемент)
	
	ЗаписатьНастройкуМенеджер();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапускатьПриСтартеАРМРОПаПриИзменении(Элемент)
	
	ЗаписатьНастройкуРОП();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапускатьПриСтартеПанельСообщенийПриИзменении(Элемент)
	
	ЗаписатьНастройкуПанельСообщений();
	
КонецПроцедуры

&НаКлиенте
Процедура ЕмаилПриИзменении(Элемент)
	
	ЗаписатьЕмаил();
	
КонецПроцедуры

&НаКлиенте
Процедура ТелефонПриИзменении(Элемент)
	
	ЗаписатьТелефон();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьТелефон()
	
	Renault_РаботаСПравамиПользователя.УстоновитьТелефонПользователя(ПараметрыСеанса.Пользователь, Телефон);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЕмаил()
	
	Renault_РаботаСПравамиПользователя.УстановитьЕмаилПользователя(ПараметрыСеанса.Пользователь,Емаил);
	//Перезапишем пользователя чтобы отправить на сервер его данные
	ПользОб = ПараметрыСеанса.Пользователь.ПолучитьОбъект();
	ПользОб.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапускатьПриСтартеАРМАвтоскладПриИзменении(Элемент)
	
	ЗаписатьНастройкуАвтосклад()
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Настройки = Renault_CRM.ПолучитьНастройкиОтправкиКП(ПараметрыСеанса.Пользователь.Сотрудник);
	УчетнаяЗаписьПочты = Настройки.УчетнаяЗапись;
	ТемаСообщенияКП = Настройки.Тема;
	ТекстСообщенияКП = настройки.Текст;
	
КонецПроцедуры

&НаКлиенте
Процедура УчетнаяЗаписьПочтыПриИзменении(Элемент)
	
	СохранитьНастройки();
	
КонецПроцедуры

Процедура СохранитьНастройки()
	
	Renault_CRM.СохранитьНастройкиОтправкиКП(ПараметрыСеанса.Пользователь.Сотрудник,УчетнаяЗаписьПочты,ТемаСообщенияКП,ТекстСообщенияКП);
	
КонецПроцедуры

&НаКлиенте
Процедура ТемаСообщенияКППриИзменении(Элемент)
	
	СохранитьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстСообщенияКППриИзменении(Элемент)
	
	СохранитьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапускатьПриСтартеАРМАвтосервисПриИзменении(Элемент)
	
	ЗаписатьНастройкуАРМАвтосервис();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкуАРМАвтосервис()
	
	Шаблоны = Renault_РаботаСПравамиПользователя.ПолучитьМоиНастройки(ПараметрыСеанса.Пользователь);
	
	Для каждого Шаблон Из Шаблоны Цикл
		ОбШаблона = Шаблон.Ссылка.получитьОбъект();
		ОбШаблона.Сервис_ОткрыватьАрмАвтосервисаПриОткрытии = ЗапускатьПриСтартеАРМАвтосервис;
		ОбШаблона.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкуИзменениеСтатусовРабот()
	
	Шаблоны = Renault_РаботаСПравамиПользователя.ПолучитьМоиНастройки(ПараметрыСеанса.Пользователь);
	
	Для каждого Шаблон Из Шаблоны Цикл
		ОбШаблона = Шаблон.Ссылка.получитьОбъект();
		ОбШаблона.Сервис_АрмАвтосервис_ОткрыватьФормуИзмененияСтатусаПриОткрытии = ЗапускатьИзменениеСтатусовРабот;
		ОбШаблона.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеСтатусовАвтоработПриИзменении(Элемент)
	
	ЗаписатьНастройкуИзменениеСтатусовРабот();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапускатьПриСтартеИзменениеСтатусовМоекПриИзменении(Элемент)
	
	ЗаписатьНастройкуИзменениеСтатусовМоек();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкуИзменениеСтатусовМоек()
	
	Шаблоны = Renault_РаботаСПравамиПользователя.ПолучитьМоиНастройки(ПараметрыСеанса.Пользователь);
	
	Для каждого Шаблон Из Шаблоны Цикл
		ОбШаблона = Шаблон.Ссылка.получитьОбъект();
		ОбШаблона.Сервис_АрмАвтосервис_ОткрыватьФормуИзмененияСтатусовМоекПриОткрытии = ЗапускатьИзменениеСтатусовМоек;
		ОбШаблона.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КЦ_РольПользователяПриИзменении(Элемент)
	
	Шаблоны = Renault_РаботаСПравамиПользователя.ПолучитьМоиНастройки(ПараметрыСеанса.Пользователь);
	
	Для каждого Шаблон Из Шаблоны Цикл
		ОбШаблона = Шаблон.Ссылка.получитьОбъект();
		ОбШаблона.КонтактЦентр_РольПользователя = КЦ_РольПользователя;
		ОбШаблона.Записать();
	КонецЦикла;
	
	//Перезапишем пользователя чтобы отправить на сервер его данные
	ПользОб = ПараметрыСеанса.Пользователь.ПолучитьОбъект();
	ПользОб.Записать();
	
КонецПроцедуры


