
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	КлючУникальности	= Новый УникальныйИдентификатор();
	ФормаПечати			= ПолучитьОбщуюФорму("ПечатнаяФормаДокументов",,КлючУникальности);
	ТабличныйДокумент	= ФормаПечати.ЭлементыФормы.ТабличныйДокумент; 
	
	ТабДок = Новый ТабличныйДокумент;
	
	ПараметрыКонфигурацииОбщие = ПолучитьДанныеПоКонфигурации(ПараметрКоманды[0]);
	ТипыАвтомобилей = ПолучитьТипыАвтомобилей(ПараметрыКонфигурацииОбщие);
	
	Если Документы.CRM_КоммерческоеПредложение.ЭтоКорпоративныйРабочийЛист(ПараметрКоманды[0]) Тогда
		
		КорпСкидка = 0;
		
		Если ПараметрКоманды[0].Состав.Итог("СуммаСкидки") <> 0 Тогда
			
			Если Вопрос("Ввести дополнительную скидку?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			
				КорпСкидка = 2;
				Если Не ВвестиЧисло(КорпСкидка, "Введите % скидки", 2, 0) Тогда
					Возврат;
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			КорпСкидка = 2;
			Если Не ВвестиЧисло(КорпСкидка, "Введите % скидки", 2, 0) Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Печать(ПараметрКоманды, ТабДок, КорпСкидка, ТипыАвтомобилей);
		
	Иначе
		
		Печать(ПараметрКоманды, ТабДок, 0, ТипыАвтомобилей);
		
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ТабДок);
	
	ФормаПечати.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	ФормаПечати.Объект = ПараметрКоманды[0];
	ФормаПечати.ОбъектПредставление = Строка(ПараметрКоманды[0]);
	ФормаПечати.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура Печать(МассивОбъектов, ТабДок, ПроцентСкидки=0, ТипыАвтомобилей = Неопределено)
	
	Документы.CRM_КоммерческоеПредложение.Печать(МассивОбъектов, ТабДок, ПроцентСкидки, ТипыАвтомобилей);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПоКонфигурации(ДокументКП)
	
	ДанныеПоКонфигурацииОбщие = Новый Соответствие();
	ДанныеПоКонфигурации = Новый Соответствие();
	
	ДилерскийЦентр = ДокументКП.ДилерскийЦентр;
	
	Если ЗначениеЗаполнено(ДокументКП) И ДилерскийЦентр.ПрименятьКоммерческиеАкцииRenault Тогда
		СоставДокКП = ДокументКП.Состав;
		Для Каждого Эл Из СоставДокКП Цикл
			VIN = Эл.Конфигурация.VIN;
			УИДСтрока = Строка(Эл.Конфигурация.УникальныйИдентификатор());
			ДанныеПоКонфигурации.Вставить(УИДСтрока, VIN);
		КонецЦикла;
	КонецЕсли;
	
	ДанныеПоКонфигурацииОбщие.Вставить(ДилерскийЦентр, ДанныеПоКонфигурации); 
	
	Возврат ДанныеПоКонфигурацииОбщие;
	
КонецФункции

&НаКлиенте
Функция ПолучитьТипыАвтомобилей(ПараметрыКонфигурацииОбщие)
	
	ТипыАвтомобилей = Новый Соответствие();
	Если ПараметрыКонфигурацииОбщие <> Неопределено И ПараметрыКонфигурацииОбщие.Количество() > 0 Тогда
		Для Каждого ПараметрКонфигурацииОбщие Из ПараметрыКонфигурацииОбщие Цикл
			ДилерскийЦентр = ПараметрКонфигурацииОбщие.Ключ;
			ПараметрыКонфигурации = ПараметрКонфигурацииОбщие.Значение;
			
			Если ПараметрыКонфигурации <> Неопределено И ПараметрыКонфигурации.Количество() > 0 Тогда
				Для Каждого Эл Из ПараметрыКонфигурации Цикл
					VIN = Эл.Значение;
					ТипАвтомобиля = Renault_ЗагрузкаКоммерческихАкций.УстановитьТипАвтомобиля(VIN, ДилерскийЦентр); 
					
					ТипыАвтомобилей.Вставить(Эл.Ключ, ТипАвтомобиля);
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТипыАвтомобилей;
	
КонецФункции


