Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Renault_ЦеныДопОборудования
	
	Движения.Renault_ЦеныДопОборудования.Записывать = Истина;
	
	Движения.Renault_ЦеныДопОборудования.Очистить();
	
	Для Каждого ТекСтрокаДополнительноеОборудование Из ДополнительноеОборудование Цикл
		
		Движение                 = Движения.Renault_ЦеныДопОборудования.Добавить();
		Движение.Период          = Дата;
		Движение.ДопОборудование = ТекСтрокаДополнительноеОборудование.Оборудование;
		Движение.Модель          = ТекСтрокаДополнительноеОборудование.Модель;
		Движение.Версия          = ТекСтрокаДополнительноеОборудование.Версия;
		Движение.Цена            = ТекСтрокаДополнительноеОборудование.Цена;
		Движение.ДилерскийЦентр  = ТекСтрокаДополнительноеОборудование.ДилерскийЦентр;
		
	КонецЦикла;

КонецПроцедуры
