Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Проверим возможность оформления заявки / утверждения резерва
	//Необходимо проверить только факт контракта автомобиля
	//Остальное проверяется измерениями регистра
	
	Если СтатусРезерва = Перечисления.CRM_СтатусыРезервовАвтомобилей.ЗаявкаНаРезерв 
			ИЛИ СтатусРезерва = Перечисления.CRM_СтатусыРезервовАвтомобилей.РезервУтвержден Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	*
		               |ИЗ
		               |	РегистрСведений.Renault_ЗаконтрактованныеАвтомобили КАК Renault_УтвержденныеРезервы
		               |ГДЕ
		               |	Renault_УтвержденныеРезервы.Автомобиль = &Автомобиль
		               |	И Renault_УтвержденныеРезервы.ДатаСнятияРезерва = ДАТАВРЕМЯ(1, 1, 1)";
					   
		Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда //Есть контракт на этот автомобиль
			Отказ = Истина;
			#Если НаКлиенте Тогда
				Сообщить("Данный автомобиль законтрактован под клиента (рабочий лист № " + Строка(Выборка.РабочийЛист) + ")");
			#КонецЕсли
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	//Движения
		
	Движения.Renault_ЗаявкиНаРезервАвтомобиля.Записывать = Истина;
	Движения.Renault_ЗаявкиНаРезервАвтомобиля.Очистить();
	
	Если СтатусРезерва = Перечисления.CRM_СтатусыРезервовАвтомобилей.ЗаявкаНаРезерв Тогда
		
		Движение = Движения.Renault_ЗаявкиНаРезервАвтомобиля.Добавить();
		Движение.Период = Дата;
		Движение.VIN = VIN;
		Движение.Автомобиль = Автомобиль;
		Движение.Менеджер = Менеджер;
		Движение.Комментарий = Комментарий;
		Движение.Клиент = Клиент;
		Движение.Автор = Автор;
		Движение.Контролер = Контролер;
		Движение.СтатусРезерва = СтатусРезерва;
		Движение.РабочийЛист = РабочийЛист;
		Движение.SedreNum = SedreNum;
		Движение.ДатаСнятияСРезерва = ДатаСнятияРезерва;
		
	КонецЕсли;
	
	Движения.Renault_УтвержденныеРезервы.Записывать = Истина;
	Движения.Renault_УтвержденныеРезервы.Очистить();
	
	Если СтатусРезерва = Перечисления.CRM_СтатусыРезервовАвтомобилей.РезервУтвержден Тогда
		
		//Доделать
		//Было бы неплохо также проверять наличие утвержденного резерва и корректно обрабатывать эту ошибку
		
		Движение = Движения.Renault_УтвержденныеРезервы.Добавить();
		Движение.VIN = VIN;
		Движение.Автомобиль = Автомобиль;
		Движение.Менеджер = Менеджер;
		Движение.Клиент = Клиент;
		Движение.Комментарий = Комментарий;
		Движение.Автор = Автор;
		Движение.Контролер = Контролер;
		Движение.РабочийЛист = РабочийЛист;
		Движение.SedreNum = SedreNum;
		Движение.ДатаРезерва = ТекущаяДата();
		Движение.ДатаСнятияСРезерва = ДатаСнятияРезерва;
		
		//ДЦ = Неопределено;
		//Если ЗначениеЗаполнено(РабочийЛист) Тогда
		//	Набор = РегистрыСведений.Renault_РабочиеЛисты.СоздатьНаборЗаписей();
		//	Набор.Отбор.IDK.Установить(РабочийЛист);
		//	Набор.Прочитать();
		//	Если Набор.Количество() <> 0 Тогда
		//		Запись = Набор[0];
		//		ДЦ = Запись.ДилерскийЦентр;
		//		Если ДЦ.СинхронизированСПланшетомПродавца = Истина Тогда
		//			АвтомобильИД = Строка(Автомобиль.Ссылка.УникальныйИдентификатор());
		//			Renault_РаботаСSalesTablet.УдалитьАвтоИзСклада(АвтомобильИД);
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;
		
	КонецЕсли;
	
	//Сформируем уведомления об изменении статуса
	//1.Для логиста
	
	
	//2.Для менеджера
	
КонецПроцедуры
