&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Правило<>Null Тогда Правило=Справочники.Renault_Правила.ПолучитьСсылку(Объект.Правило) КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Если БазаДанных()<>Renault_ПередачаДанныхВСторонниеСистемы.ТекущаяБазаДанных() Тогда
			Сообщить("Метаданные другой базы не доступны для редактирования",СтатусСообщения.Информация);
			ТолькоПросмотр=Истина;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
Функция БазаДанных() Возврат Объект.ОбъектМД.БазаДанных КонецФункции	

&НаКлиенте
Процедура ОбъектМДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	//ДанныеВыбора=ВнешниеИсточникиДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблицы.ОбъектыМД.ПолучитьДанныеВыбора(Новый Структура("БазаДанных",Renault_ПередачаДанныхВСторонниеСистемы.ТекущаяБазаДанных()));
	Структура=Новый Структура;
	Структура.Вставить("БазаДанных",Renault_ПередачаДанныхВСторонниеСистемы.ТекущаяБазаДанных());
	Структура.Вставить("РежимВыбора",Истина);
	ОткрытьФорму("ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.ОбъектыМД.ФормаВыбора",Структура,ЭтаФорма,,,,Новый ОписаниеОповещения("Выбор_ВнешниеМетаданные",ЭтаФорма));
КонецПроцедуры
Процедура Выбор_ВнешниеМетаданные(Значение,Параметр) Объект.ОбъектМД=Значение КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Правило=?(Правило.Пустая(),NULL,Правило.УникальныйИдентификатор());
КонецПроцедуры

