// Хранит ссылку на документы, сформированные из заказ-наряда, для более быстрого доступа к ним
Перем мСформированныеДокументы;
Перем ЗаказПокупателя;

Функция ПолучитьСписокПечатныхФорм() Экспорт
	СтруктураПечатныхФорм = ПолучитьСтруктуруПечатныхФорм();
	
	//СписокПечатныхФорм = Новый СписокЗначений;
	//
	//Для Каждого Эл Из СтруктураПечатныхФорм Цикл
	//	СписокПечатныхФорм.Добавить(Эл.Ключ, Эл.Значение);
	//КонецЦикла;
	
	Возврат СтруктураПечатныхФорм;
	
КонецФункции

//!
Процедура ПриЗаписи(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_Advanced_ХранениеКолес.Контейнер,
		|	Renault_Advanced_ХранениеКолес.Стеллаж,
		|	Renault_Advanced_ХранениеКолес.Полка,
		|	Renault_Advanced_ХранениеКолес.Ряд,
		|	Renault_Advanced_ХранениеКолес.Договор,
		|	ВЫБОР
		|		КОГДА Renault_Advanced_ХранениеКолес.Контейнер = &Контейнер
		|				И Renault_Advanced_ХранениеКолес.Стеллаж = &Стеллаж
		|				И Renault_Advanced_ХранениеКолес.Полка = &Полка
		|				И Renault_Advanced_ХранениеКолес.Ряд = &Ряд
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Флаг
		|ИЗ
		|	РегистрСведений.Renault_Advanced_ХранениеКолес КАК Renault_Advanced_ХранениеКолес
		|ГДЕ
		|	Renault_Advanced_ХранениеКолес.Договор = &Договор
		|
		|УПОРЯДОЧИТЬ ПО
		|	Флаг УБЫВ";

	Запрос.УстановитьПараметр("Договор", Ссылка);
	Запрос.УстановитьПараметр("Контейнер", Контейнер);
	Запрос.УстановитьПараметр("Полка", Полка);
	Запрос.УстановитьПараметр("Ряд", Ряд);
	Запрос.УстановитьПараметр("Стеллаж", Стеллаж);

	Если ПометкаУдаления Тогда
		
		Ответ = Вопрос("Документ помечен на удаление! Информация о хранении будет удалена"+Символы.ВК+ 
		"без возможности востановления! Продолжить и удалить?",РежимДиалогаВопрос.ОКОтмена,,КодВозвратаДиалога.Отмена);
		
		Если Ответ = КодВозвратаДиалога.Отмена тогда
			
			Отказ = Истина;
			
		Иначе
			
			Результат = Запрос.Выполнить();
			Если Не Результат.Пустой() Тогда //надо "освободить" ячейку
				
				ВыборкаДетальныеЗаписи = Результат.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					НаборЗапХранен = РегистрыСведений.Renault_Advanced_ХранениеКолес.СоздатьМенеджерЗаписи();		   
					НаборЗапХранен.Контейнер = ВыборкаДетальныеЗаписи.Контейнер;
					НаборЗапХранен.Стеллаж   = ВыборкаДетальныеЗаписи.Стеллаж;
					НаборЗапХранен.Полка     = ВыборкаДетальныеЗаписи.Полка;
					НаборЗапХранен.Ряд       = ВыборкаДетальныеЗаписи.Ряд;
					НаборЗапХранен.Договор   = Документы.Renault_Advanced_ДоговорХраненияКолес.ПустаяСсылка();
					НаборЗапХранен.Записать();
				КонецЦикла;
				
			КонецЕсли;		 
		КонецЕсли; 		
	Иначе
		Если Контейнер+Стеллаж+Полка+Ряд = 0 Тогда
			
			Если  ЗначениеЗаполнено(ДатаВыдачиФакт) Тогда //это выдача
				Сообщить("Ячейка хранения не указана. Невозможно оформить выдачу по договору без размещения!");	
				Отказ = Истина;
			КонецЕсли;
			Возврат;
			
		КонецЕсли;
		// проверка наличия информации об этом документе 
		// в регистре  //////////////////////////////////
		
		Результат = Запрос.Выполнить();
	
		Если ЗначениеЗаполнено(ДатаВыдачиФакт) Тогда    //это выдача
			Если Не Результат.Пустой() Тогда //надо "освободить" ячейку
				
				ВыборкаДетальныеЗаписи = Результат.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					НаборЗапХранен = РегистрыСведений.Renault_Advanced_ХранениеКолес.СоздатьМенеджерЗаписи();		   
					НаборЗапХранен.Контейнер = ВыборкаДетальныеЗаписи.Контейнер;
					НаборЗапХранен.Стеллаж   = ВыборкаДетальныеЗаписи.Стеллаж;
					НаборЗапХранен.Полка     = ВыборкаДетальныеЗаписи.Полка;
					НаборЗапХранен.Ряд       = ВыборкаДетальныеЗаписи.Ряд;
					НаборЗапХранен.Договор   = Документы.Renault_Advanced_ДоговорХраненияКолес.ПустаяСсылка();
					НаборЗапХранен.Записать();
				КонецЦикла;
			КонецЕсли;
		Иначе                                           //это не выдача
			НаборЗапХранен = РегистрыСведений.Renault_Advanced_ХранениеКолес.СоздатьМенеджерЗаписи();		   
			НаборЗапХранен.Контейнер = Контейнер;
			НаборЗапХранен.Стеллаж   = Стеллаж;
			НаборЗапХранен.Полка     = Полка;
			НаборЗапХранен.Ряд       = Ряд;
			
			НаборЗапХранен.Прочитать();
			
			Если НаборЗапХранен.Выбран()  
				И НаборЗапХранен.Договор <> Ссылка 
				И Не НаборЗапХранен.Договор = Документы.Renault_Advanced_ДоговорХраненияКолес.ПустаяСсылка() Тогда //ячейка занята
				
				Сообщить("Запись не возможна! Ячейка хранения занята");
				Отказ = Истина;
			Иначе			
				НаборЗапХранен.Контейнер = Контейнер;
				НаборЗапХранен.Стеллаж   = Стеллаж;
				НаборЗапХранен.Полка     = Полка;
				НаборЗапХранен.Ряд       = Ряд;
				НаборЗапХранен.Договор   = Ссылка;
				НаборЗапХранен.Записать();
				Если Не Результат.Пустой() Тогда
					
					ВыборкаДетальныеЗаписи = Результат.Выбрать();
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						Если ВыборкаДетальныеЗаписи.Флаг Тогда
							Продолжить;
						КонецЕсли;
						НаборЗапХранен = РегистрыСведений.Renault_Advanced_ХранениеКолес.СоздатьМенеджерЗаписи();		   
						НаборЗапХранен.Контейнер = ВыборкаДетальныеЗаписи.Контейнер;
						НаборЗапХранен.Стеллаж   = ВыборкаДетальныеЗаписи.Стеллаж;
						НаборЗапХранен.Полка     = ВыборкаДетальныеЗаписи.Полка;
						НаборЗапХранен.Ряд       = ВыборкаДетальныеЗаписи.Ряд;
						НаборЗапХранен.Договор   = Документы.Renault_Advanced_ДоговорХраненияКолес.ПустаяСсылка();
						НаборЗапХранен.Записать();
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

//!
Функция ПолучитьУслугуПоНоменклатуре(АвтоуслугаРаботы) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Автоработы.Ссылка
		|ИЗ
		|	Справочник.Автоработы КАК Автоработы
		|ГДЕ
		|	Автоработы.Номенклатура = &АвтоуслугаРаботы";

	Запрос.УстановитьПараметр("АвтоуслугаРаботы", АвтоуслугаРаботы);
	
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Возврат ?(ВыборкаДетальныеЗаписи.Следующий(), ВыборкаДетальныеЗаписи.Ссылка, Справочники.Автоработы.ПустаяСсылка());
	
КонецФункции // ПолучитьУслугуПоНоменклатуре()

//!
Функция ПечатьАктаПриемаКолес(ГосНомер = "",Телефоны = Неопределено, Выдача=Ложь, АктБезПросрочки = Ложь) Экспорт
	
	ЭтоЮрЛицо = Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо;

	ТабДок = Новый ТабличныйДокумент;
	// Зададим параметры макета
	ТабДок.ПолеСверху              = 0;
	ТабДок.ПолеСлева               = 5;
	ТабДок.ПолеСнизу               = 0;
	ТабДок.ПолеСправа              = 5;
	ТабДок.АвтоМасштаб             = Истина;
	ТабДок.ОриентацияСтраницы      = ОриентацияСтраницы.Портрет;//.Ландшафт;
	
	
	Если АктБезПросрочки Тогда 
		ТабДок = ПечатьАктаОбОказанииУслуг(); 	
		Возврат ТабДок;
	ИначеЕсли Выдача И Не СуммаПросрочки>0 И Не СрокХраненияПросрочка>0 Тогда
		Сообщить("Невозможно распечатать акт возврата с просрочкой по причине:
				  |-Просрочка не зафиксирована!");          
		Возврат Неопределено;
	КонецЕсли;
	
			
	ИмяМакета = ?(Выдача, "АктВозврата", "ПечатьАктаПриемаКолес");
	
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Renault_Advanced_ДоговорХраненияКолес_"+ИмяМакета;

	Макет = ПолучитьМакет(ИмяМакета);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорХраненияКолес.Номер КАК НомерДокумента,
	|	ДоговорХраненияКолес.Дата КАК ДатаДокумента,
	|	ДоговорХраненияКолес.ЗаказНаряд.Номер КАК НомерЗаказНаряда,
	|	ДоговорХраненияКолес.ЗаказНаряд.Дата КАК ДатаЗаказНаряда,
	|	ДоговорХраненияКолес.ЗаказНаряд.Организация КАК Организация,
	|	ДоговорХраненияКолес.ЗаказНаряд.Организация.ОсновнойБанковскийСчет КАК БанковскийСчет,
	|	ДоговорХраненияКолес.ЗаказНаряд.Автомобиль.VIN КАК АМ_VIN,
	|	ДоговорХраненияКолес.Количество,
	|	ДоговорХраненияКолес.СрокХранения,
	|	ДоговорХраненияКолес.Сумма,
	|	ДоговорХраненияКолес.ДатаВыдачи,	
	|	ДоговорХраненияКолес.СрокХраненияПросрочка,
	|	ДоговорХраненияКолес.СуммаПросрочки,
	|	ДоговорХраненияКолес.ДатаВыдачиФакт,
	|	ДоговорХраненияКолес.ВыявленыеНеисправности КАК Комментарий,
	|	"+СформироватьСтрокуПоляЗапроса("МаркаМодель")+" КАК АМ_МаркаМодель,
	|	"+СформироватьСтрокуПоляЗапроса("ИзделиеПредставление", Запрос)+" КАК ИзделиеПредставление,
	|	ВЫБОР
	|		КОГДА ДоговорХраненияКолес.Автопокрышки
	|			ТОГДА ""Автопокрышки""
	|		КОГДА ДоговорХраненияКолес.КолесаВСборе
	|			ТОГДА ""Колеса в сборе""
	|		КОГДА ДоговорХраненияКолес.ТолькоДиски
	|			ТОГДА ""Только диски""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АвтопокрышкиВариант,
	|	ВЫБОР
	|		КОГДА ДоговорХраненияКолес.Автопокрышки
	|			ТОГДА ""Не сданы""
	|		КОГДА ДоговорХраненияКолес.ОригТипДисков
	|			ТОГДА ""Оригинальные""
	|		ИНАЧЕ ""Не оригинальные""
	|	КОНЕЦ КАК ОригТипДисковВыбор,
	|	ВЫБОР
	|		КОГДА ДоговорХраненияКолес.КрепежСдан
	|			ТОГДА ""Крепеж сдан""
	|		ИНАЧЕ ""Крепеж не сдан""
	|	КОНЕЦ КАК КрепежСданВыбор,
	|	ВЫБОР
	|		КОГДА ДоговорХраненияКолес.СупинаторыЕсть
	|			ТОГДА ""Супинаторы сданы""
	|		ИНАЧЕ ""Супинаторы не сданы""
	|	КОНЕЦ КАК СупинаторыЕстьВыбор,
	|	ВЫБОР
	|		КОГДА ДоговорХраненияКолес.СекреткиЕсть
	|			ТОГДА ""Секретки сданы""
	|		ИНАЧЕ ""Секретки не сданы""
	|	КОНЕЦ КАК СекреткиЕстьВыбор,
	|	ВЫБОР
	|		КОГДА ДоговорХраненияКолес.Автопокрышки
	|			ТОГДА ""Без дисков""
	|		КОГДА ДоговорХраненияКолес.ДискСталные
	|			ТОГДА ""Диски сталные""
	|		КОГДА ДоговорХраненияКолес.ДискЛегкосплавные
	|			ТОГДА ""Диски легкосплавные""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ДискСталныеВыбор,
	|	ДоговорХраненияКолес.СтепеньИзноса,
	|	ДоговорХраненияКолес.Новые,
	|	Renault_Advanced_РеквизитыЗаказНаряда.РеквизитыДокумента.Плательщик КАК Контрагент,
	|	Renault_Advanced_РеквизитыЗаказНаряда.РеквизитыДокумента.Плательщик.Сотрудник КАК Контрагент_ФизЛицо,
	|	Автомобили.Значение КАК АМ_ГосНомер
	|ИЗ
	|	Документ.Renault_Advanced_ДоговорХраненияКолес КАК ДоговорХраненияКолес
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_Advanced_РеквизитыЗаказНаряда КАК Renault_Advanced_РеквизитыЗаказНаряда
	|		ПО ДоговорХраненияКолес.ЗаказНаряд = Renault_Advanced_РеквизитыЗаказНаряда.ЗаказНаряд
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили КАК Автомобили
	|		ПО ДоговорХраненияКолес.ЗаказНаряд.Автомобиль = Автомобили.Автомобиль
	|			И (Автомобили.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ГосНомер))
	|ГДЕ
	|	ДоговорХраненияКолес.Ссылка = &ТекущийДокумент";
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	// Заголовок
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	
	ОбластьМакета.Параметры.Заполнить(Шапка);
	
	// Выводим общие реквизиты шапки
	
	Запрос	= Новый Запрос;
	Запрос.Текст	= 		
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.НаименованиеПолное,
	|	Контрагенты.КодПоОКПО,
	|	Контрагенты.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчета,
	|	Контрагенты.ОсновнойБанковскийСчет.Банк.Наименование КАК Банк,
	|	Контрагенты.ОсновнойБанковскийСчет.Банк.КоррСчет КАК КоррСчет,
	|	Контрагенты.ОсновнойБанковскийСчет.Банк.Код КАК БИК
	|ПОМЕСТИТЬ КонтрагентИнфа
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Контрагенты).Ссылка
	|	КОНЕЦ КАК Контрагент,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Телефон)
	|				ТОГДА КонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Телефон,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|					И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.АдресФактический)
	|				ТОГДА КонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК АдресФактический,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|					И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.АдресЮридический)
	|				ТОГДА КонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК АдресЮридический
	|ПОМЕСТИТЬ КонтИнфа
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Контрагент
	|	И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Телефон)
	|				И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.ТелефонКонтактный)
	|			ИЛИ КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|				И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.АдресФактический)
	|			ИЛИ КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|				И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.АдресЮридический))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Контрагенты).Ссылка
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодтверждающиеДокументы.Серия,
	|	ПодтверждающиеДокументы.Номер,
	|	ПодтверждающиеДокументы.ДатаВыдачи,
	|	ПодтверждающиеДокументы.КемВыдан,
	|	ПодтверждающиеДокументы.Владелец КАК Контрагент
	|ПОМЕСТИТЬ ДокументКонтрагента
	|ИЗ
	|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|ГДЕ
	|	ПодтверждающиеДокументы.Владелец = &Контрагент
	|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Паспорт)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтрагентИнфа.ИНН,
	|	КонтрагентИнфа.КПП,
	|	КонтрагентИнфа.НаименованиеПолное КАК ПолноеНаименование,
	|	КонтИнфа.Телефон,
	|	КонтИнфа.АдресФактический КАК АдресФактический,
	|	КонтИнфа.АдресЮридический КАК АдресЮридический,
	|	ДокументКонтрагента.Серия КАК ДокументСерия,
	|	ДокументКонтрагента.Номер КАК ДокументНомер,
	|	ДокументКонтрагента.ДатаВыдачи КАК ДокументДатаВыдачи,
	|	ДокументКонтрагента.КемВыдан КАК ДокументКемВыдан,
	|	КонтрагентИнфа.КодПоОКПО,
	|	КонтрагентИнфа.НомерСчета,
	|	КонтрагентИнфа.Банк,
	|	КонтрагентИнфа.КоррСчет,
	|	КонтрагентИнфа.БИК
	|ИЗ
	|	КонтрагентИнфа КАК КонтрагентИнфа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументКонтрагента КАК ДокументКонтрагента
	|		ПО КонтрагентИнфа.Контрагент = ДокументКонтрагента.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтИнфа КАК КонтИнфа
	|		ПО КонтрагентИнфа.Контрагент = КонтИнфа.Контрагент";
	                                                      
	Запрос.УстановитьПараметр("Контрагент", Шапка.Контрагент);
	Результат =  Запрос.Выполнить();
	СведенияОКонтрагенте = Результат.Выбрать();
	СведенияОКонтрагенте.Следующий();
		
	Запрос	= Новый Запрос;
	Запрос.Текст	= 		
	"ВЫБРАТЬ
	|	Организации.НаименованиеПолное,
	|	Организации.Ссылка КАК Организация,
	|	Организации.ИНН,
	|	Организации.КПП,
	|	Организации.ОГРН,
	|	Организации.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчета,
	|	Организации.ОсновнойБанковскийСчет.Банк.Наименование КАК БанкНаименование,
	|	Организации.ОсновнойБанковскийСчет.Банк.КоррСчет КАК КоррСчет,
	|	Организации.ОсновнойБанковскийСчет.Банк.Код КАК БИК,
	|	Организации.КодПоОКПО
	|ПОМЕСТИТЬ ОрганизацияИнформация
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Организации
	|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Организации).Ссылка
	|	КОНЕЦ КАК Организация,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Телефон)
	|				ТОГДА КонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Телефон,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|				ТОГДА КонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Адрес
	|ПОМЕСТИТЬ ОргКонт
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Организация
	|	И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Телефон)
	|				И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.ТелефонРабочий)
	|			ИЛИ КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|				И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.АдресЮридический))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Организации
	|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Организации).Ссылка
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацияИнформация.НаименованиеПолное КАК ПолноеНаименование,
	|	ОрганизацияИнформация.ИНН КАК ИНН,
	|	ОрганизацияИнформация.КПП КАК КПП,
	|	ОрганизацияИнформация.ОГРН КАК ОГРН,
	|	ОрганизацияИнформация.НомерСчета КАК НомерСчета,
	|	ОрганизацияИнформация.БанкНаименование КАК Банк,
	|	ОрганизацияИнформация.КоррСчет КАК КоррСчет,
	|	ОрганизацияИнформация.БИК КАК БИК,
	|	ОргКонт.Телефон КАК Телефон,
	|	ОргКонт.Адрес КАК АдресЮридический,
	|	ОрганизацияИнформация.КодПоОКПО КАК КодПоОКПО
	|ИЗ
	|	ОрганизацияИнформация КАК ОрганизацияИнформация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОргКонт КАК ОргКонт
	|		ПО ОрганизацияИнформация.Организация = ОргКонт.Организация";
	
	Запрос.УстановитьПараметр("Организация", Шапка.Организация);
	Результат = Запрос.Выполнить();
	СведенияООрганизации = Результат.Выбрать();		
	СведенияООрганизации.Следующий(); 
	
	Руководители = дкОтветственноеЛицо(ЭтотОбъект.ЗаказНаряд.ПолучитьОбъект(), Перечисления.ВидыОбъектовСведений.Руководитель);
	Руководитель = Руководители.РуководительПредставление;
	
	ОбластьМакета.Параметры.Поклажедатель = ?(ЭтоЮрЛицо, "", "Гр-ин(ка) РФ - ") + ВРег(СведенияОКонтрагенте.ПолноеНаименование);
	ОбластьМакета.Параметры.ПолноеНаименованиеОрганизации = СведенияООрганизации.ПолноеНаименование;
	
	ОбластьМакета.Параметры.ДатаДокумента_Прописью  = Формат(Шапка.ДатаДокумента, "ДФ=""дд ММММ гггг""");
 	ОбластьМакета.Параметры.ДатаВыдачи_Прописью  = Формат(Шапка.ДатаВыдачи, "ДФ=""дд ММММ гггг""");
	ОбластьМакета.Параметры.ДатаДокумента = Формат(Шапка.ДатаДокумента, "ДЛФ=D");

	ОбластьМакета.Параметры.ДатаЗаказНаряда = Формат(Шапка.ДатаЗаказНаряда, "ДЛФ=D");
	
	Если Выдача Тогда
		ОбластьМакета.Параметры.ДатаВыдачи = Формат(Шапка.ДатаВыдачи, "ДЛФ=D");
	КонецЕсли;
	ТабДок.Вывести(ОбластьМакета);
	
	//Получим ссылку на счет по З/н при приеме
	//или РТУ по текущему документу при выдаче
	СправочникДанных = Renault_AdvancedСервер.ПолучитьСправочникДанныхЗаказНаряда(ЗаказНаряд);
	СправочникДанныхОбъект = СправочникДанных.ПолучитьОбъект(); 

	Если Выдача Тогда
		сДок = ПолучитьСсылкуНаРТиУ();
	Иначе
		сДок = СправочникДанныхОбъект.ПолучитьСсылкуНаСчетНаОплату();
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаНДС");
	Если ЗначениеЗаполнено(сДок) И СправочникДанных.УчитыватьНДС Тогда
		ОбластьМакета.Параметры.НДС = ?(СправочникДанных.СуммаВключаетНДС, "В том числе НДС", " Сумма НДС")+":";
		ОбластьМакета.Параметры.ВсегоНДС = сДок.Товары.Итог("СуммаНДС");
	Иначе
		ОбластьМакета.Параметры.НДС = "В том числе НДС:";
		ОбластьМакета.Параметры.ВсегоНДС = 0;
	КонецЕсли;
	ТабДок.Вывести(ОбластьМакета);
	
	Если Не Выдача Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("Комплектация");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДок.Вывести(ОбластьМакета);
		Если Не Шапка.Новые Тогда
			
			ОбластьМакета = Макет.ПолучитьОбласть("Износ");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ТабДок.Вывести(ОбластьМакета);
			
		КонецЕсли; 
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Комментарий");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабДок.Вывести(ОбластьМакета);	
	
	Если ЭтоЮрЛицо Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи_ЮЛ");
		ОбластьМакета.Параметры.Контрагент = ВРег(СведенияОКонтрагенте.ПолноеНаименование);
		ОбластьМакета.Параметры.ИННКонтрагента = СведенияОКонтрагенте.ИНН;
		ОбластьМакета.Параметры.КППКонтрагента = СведенияОКонтрагенте.КПП;
		ОбластьМакета.Параметры.КодПоОКПОКонтрагента = СведенияОКонтрагенте.КодПоОКПО;
		ОбластьМакета.Параметры.БанкКонтрагента = СведенияОКонтрагенте.Банк;
		ОбластьМакета.Параметры.БИККонтрагента = СведенияОКонтрагенте.БИК;
		ОбластьМакета.Параметры.КоррСчетКонтрагента = СведенияОКонтрагенте.КоррСчет;
		ОбластьМакета.Параметры.НомерСчетаКонтрагента = СведенияОКонтрагенте.НомерСчета;
		//ОбластьМакета.Параметры.ОГРНКонтрагента = Шапка.Контрагент.ОГРН;
	Иначе	
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи_ФЛ");
		ОбластьМакета.Параметры.Покупатель_ФИО_Полностью = ВРег(СведенияОКонтрагенте.ПолноеНаименование);
		ОбластьМакета.Параметры.ФактическийАдресКонтрагента = СведенияОКонтрагенте.АдресФактический;
		ОбластьМакета.Параметры.пасп_сер   = СведенияОКонтрагенте.ДокументСерия;
		ОбластьМакета.Параметры.пасп_ном   = СведенияОКонтрагенте.ДокументНомер;
		ОбластьМакета.Параметры.КогдаВыдан = ?(ЗначениеЗаполнено(СведенияОКонтрагенте.ДокументДатаВыдачи), Формат(СведенияОКонтрагенте.ДокументДатаВыдачи, "ДЛФ=D"), "Нет даты года");
		ОбластьМакета.Параметры.КемВыдан   = СведенияОКонтрагенте.ДокументКемВыдан;
	КонецЕсли;
	ОбластьМакета.Параметры.ТелефоныКонтрагента = СведенияОКонтрагенте.Телефон;
	ОбластьМакета.Параметры.ЮридическийАдресКонтрагента = СведенияОКонтрагенте.АдресЮридический;
	
	ОбластьМакета.Параметры.ПолноеНаименованиеОрганизации = СведенияООрганизации.ПолноеНаименование;
	ОбластьМакета.Параметры.ИНН = СведенияООрганизации.ИНН;
	ОбластьМакета.Параметры.КПП = СведенияООрганизации.КПП;
	ОбластьМакета.Параметры.ЮридическийАдрес = СведенияООрганизации.АдресЮридический;
	ОбластьМакета.Параметры.НомерСчета = СведенияООрганизации.НомерСчета;
	ОбластьМакета.Параметры.Банк = СведенияООрганизации.Банк;
	ОбластьМакета.Параметры.КоррСчет = СведенияООрганизации.КоррСчет;
	ОбластьМакета.Параметры.БИК = СведенияООрганизации.БИК;
	ОбластьМакета.Параметры.КодПоОКПО = СведенияООрганизации.КодПоОКПО;
	ОбластьМакета.Параметры.Телефоны = СведенияООрганизации.Телефон;
	ОбластьМакета.Параметры.ОГРН = СведенияООрганизации.ОГРН;
	ОбластьМакета.Параметры.ФИОРуководителя = ВРег(Руководитель);

    ТабДок.Вывести(ОбластьМакета);

	Возврат ТабДок;
КонецФункции

//!
Функция ПечатьДляСклада(ПереданыйНомер = "") Экспорт
	
	Если ПереданыйНомер = "" Тогда
				
		Если ЗначениеЗаполнено(ЗаказНаряд) Тогда
			ПереданыйНомер = ЗаказНаряд.Автомобиль.ГосударственныйНомер;
		Иначе
			ПереданыйНомер = "";
		КонецЕсли;	  
		
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ДляСклада");
	
	Госномер = Макет.ПолучитьОбласть("Госномер");
	Госномер.Параметры.ГосномерПар = ПереданыйНомер;
	ТабДок.Вывести(Госномер);

	Идентификат = Макет.ПолучитьОбласть("Документы");
	Идентификат.Параметры.Заполнить(ЭтотОбъект);
	Идентификат.Параметры.ЗаказНаряд = ЗаказНаряд.Номер;
	
	//рисунок  
	ЗапросШтрихКод = Новый Запрос;
	ЗапросШтрихКод.Текст = 
		"ВЫБРАТЬ
		|	ШтрихКоды.ШтрихКод КАК ШтрихКод
		|ИЗ
		|	РегистрСведений.ШтрихКоды КАК ШтрихКоды
		|ГДЕ
		|	ШтрихКоды.Объект = &ЗаказНаряд";	
	ЗапросШтрихКод.УстановитьПараметр("ЗаказНаряд", ЗаказНаряд);	
	РезультатШтрихКод = ЗапросШтрихКод.Выполнить();
	
	ШтрихКод = "";
	Если НЕ РезультатШтрихКод.Пустой() Тогда
		ВыборкаШтрихКод = РезультатШтрихКод.Выбрать();
		ВыборкаШтрихКод.Следующий();
		ШтрихКод = ВыборкаШтрихКод.ШтрихКод; 
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(ШтрихКод) Тогда
		Возврат Новый ТабличныйДокумент;	
	КонецЕсли;
	ТипКода = 1;
	Идентификат.Рисунки.Штрихкод.Объект.ТипКода   = ТипКода;
	Идентификат.Рисунки.Штрихкод.Объект.Сообщение = ШтрихКод;

	ТабДок.Вывести(Идентификат);
	 
    ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	ТабДок.МасштабПечати = 120;
	ТабДок.КоличествоЭкземпляров=5;
	ТабДок.ОтображатьЗаголовки = Ложь;

	Возврат ТабДок; 
КонецФункции	

//!
Функция ПечатьДХ() Экспорт
	
	ЭтоЮрЛицо = Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо;
	
	ТабДок = Новый ТабличныйДокумент;
	// Зададим параметры макета
	ТабДок.ПолеСверху              = 0;
	ТабДок.ПолеСлева               = 5;
	ТабДок.ПолеСнизу               = 0;
	ТабДок.ПолеСправа              = 5;
	ТабДок.АвтоМасштаб             = Истина;
	ТабДок.ОриентацияСтраницы      = ОриентацияСтраницы.Портрет;// .Ландшафт;
	
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Renault_Advanced_ДоговорХраненияКолес_ДоговорХранения";

	Макет = ПолучитьМакет("ДоговорХранения");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорХраненияКолес.Номер КАК НомерДокумента,
	|	ДоговорХраненияКолес.Дата КАК ДатаДокумента,
	|	ДоговорХраненияКолес.ЗаказНаряд.Номер КАК НомерЗаказНаряда,
	|	ДоговорХраненияКолес.ЗаказНаряд.Дата КАК ДатаЗаказНаряда,
	|	ДоговорХраненияКолес.ЗаказНаряд.Организация КАК Организация,
	|	ДоговорХраненияКолес.ЗаказНаряд.Организация.ОсновнойБанковскийСчет КАК БанковскийСчет,
	|	Renault_Advanced_РеквизитыЗаказНаряда.РеквизитыДокумента.Плательщик КАК Контрагент,
	|	Renault_Advanced_РеквизитыЗаказНаряда.РеквизитыДокумента.Плательщик.Сотрудник  КАК Контрагент_ФизЛицо
	|ИЗ
	|	Документ.Renault_Advanced_ДоговорХраненияКолес КАК ДоговорХраненияКолес
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_Advanced_РеквизитыЗаказНаряда КАК Renault_Advanced_РеквизитыЗаказНаряда
	|		ПО ДоговорХраненияКолес.ЗаказНаряд = Renault_Advanced_РеквизитыЗаказНаряда.ЗаказНаряд
	|ГДЕ
	|	ДоговорХраненияКолес.Ссылка = &ТекущийДокумент";
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	// Заголовок
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_Общая");
	
	//ОбластьМакета.Параметры.Месторасположение = Константы.Месторасположение.Получить(); 	
	
	// Выводим общие реквизиты шапки
	Запрос	= Новый Запрос;
	Запрос.Текст	= 		
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.НаименованиеПолное,
	|	Контрагенты.КодПоОКПО,
	|	Контрагенты.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчета,
	|	Контрагенты.ОсновнойБанковскийСчет.Банк.Наименование КАК Банк,
	|	Контрагенты.ОсновнойБанковскийСчет.Банк.КоррСчет КАК КоррСчет,
	|	Контрагенты.ОсновнойБанковскийСчет.Банк.Код КАК БИК
	|ПОМЕСТИТЬ КонтрагентИнфа
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Контрагенты).Ссылка
	|	КОНЕЦ КАК Контрагент,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Телефон)
	|				ТОГДА КонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Телефон,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|					И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.АдресФактический)
	|				ТОГДА КонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК АдресФактический,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|					И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.АдресЮридический)
	|				ТОГДА КонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК АдресЮридический
	|ПОМЕСТИТЬ КонтИнфа
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Контрагент
	|	И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Телефон)
	|				И КонтактнаяИнформация.ЗначениеПоУмолчанию
	|			ИЛИ КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|				И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.АдресФактический)
	|			ИЛИ КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|				И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.АдресЮридический))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Контрагенты).Ссылка
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодтверждающиеДокументы.Серия,
	|	ПодтверждающиеДокументы.Номер,
	|	ПодтверждающиеДокументы.ДатаВыдачи,
	|	ПодтверждающиеДокументы.КемВыдан,
	|	ПодтверждающиеДокументы.Владелец КАК Контрагент
	|ПОМЕСТИТЬ ДокументКонтрагента
	|ИЗ
	|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|ГДЕ
	|	ПодтверждающиеДокументы.Владелец = &Контрагент
	|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Паспорт)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтрагентИнфа.ИНН,
	|	КонтрагентИнфа.КПП,
	|	КонтрагентИнфа.НаименованиеПолное КАК ПолноеНаименование,
	|	КонтИнфа.Телефон,
	|	КонтИнфа.АдресФактический КАК АдресФактический,
	|	КонтИнфа.АдресЮридический КАК АдресЮридический,
	|	ДокументКонтрагента.Серия КАК ДокументСерия,
	|	ДокументКонтрагента.Номер КАК ДокументНомер,
	|	ДокументКонтрагента.ДатаВыдачи КАК ДокументДатаВыдачи,
	|	ДокументКонтрагента.КемВыдан КАК ДокументКемВыдан,
	|	КонтрагентИнфа.КодПоОКПО,
	|	КонтрагентИнфа.НомерСчета,
	|	КонтрагентИнфа.Банк,
	|	КонтрагентИнфа.КоррСчет,
	|	КонтрагентИнфа.БИК
	|ИЗ
	|	КонтрагентИнфа КАК КонтрагентИнфа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументКонтрагента КАК ДокументКонтрагента
	|		ПО КонтрагентИнфа.Контрагент = ДокументКонтрагента.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтИнфа КАК КонтИнфа
	|		ПО КонтрагентИнфа.Контрагент = КонтИнфа.Контрагент";
	                                                      
	Запрос.УстановитьПараметр("Контрагент", Шапка.Контрагент);
	Результат =  Запрос.Выполнить();
	СведенияОКонтрагенте = Результат.Выбрать();
	СведенияОКонтрагенте.Следующий();
		
	Запрос	= Новый Запрос;
	Запрос.Текст	= 		
	"ВЫБРАТЬ
	|	Организации.НаименованиеПолное,
	|	Организации.Ссылка КАК Организация,
	|	Организации.ИНН,
	|	Организации.КПП,
	|	Организации.ОГРН,
	|	Организации.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчета,
	|	Организации.ОсновнойБанковскийСчет.Банк.Наименование КАК БанкНаименование,
	|	Организации.ОсновнойБанковскийСчет.Банк.КоррСчет КАК КоррСчет,
	|	Организации.ОсновнойБанковскийСчет.Банк.Код КАК БИК,
	|	Организации.КодПоОКПО,
	|	Организации.Наименование
	|ПОМЕСТИТЬ ОрганизацияИнформация
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Организации
	|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Организации).Ссылка
	|	КОНЕЦ КАК Организация,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Телефон)
	|				ТОГДА КонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Телефон,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|				ТОГДА КонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Адрес,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|				ТОГДА КонтактнаяИнформация.Поле4
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Город
	|ПОМЕСТИТЬ ОргКонт
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Организация
	|	И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Телефон)
	|				И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.ТелефонРабочий)
	|			ИЛИ КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|				И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.АдресЮридический))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Организации
	|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Организации).Ссылка
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацияИнформация.НаименованиеПолное КАК ПолноеНаименование,
	|	ОрганизацияИнформация.ИНН КАК ИНН,
	|	ОрганизацияИнформация.КПП КАК КПП,
	|	ОрганизацияИнформация.ОГРН КАК ОГРН,
	|	ОрганизацияИнформация.НомерСчета КАК НомерСчета,
	|	ОрганизацияИнформация.БанкНаименование КАК Банк,
	|	ОрганизацияИнформация.КоррСчет КАК КоррСчет,
	|	ОрганизацияИнформация.БИК КАК БИК,
	|	ЕСТЬNULL(ОргКонт.Телефон, """") КАК Телефон,
	|	ЕСТЬNULL(ОргКонт.Адрес, """") КАК АдресЮридический,
	|	ОрганизацияИнформация.КодПоОКПО КАК КодПоОКПО,
	|	ОрганизацияИнформация.Наименование,
	|	ЕСТЬNULL(ОргКонт.Город, """") КАК Город
	|ИЗ
	|	ОрганизацияИнформация КАК ОрганизацияИнформация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОргКонт КАК ОргКонт
	|		ПО ОрганизацияИнформация.Организация = ОргКонт.Организация";
	
	Запрос.УстановитьПараметр("Организация", Шапка.Организация);
	Результат = Запрос.Выполнить();
	СведенияООрганизации = Результат.Выбрать();		
	СведенияООрганизации.Следующий(); 
	
	Руководители = дкОтветственноеЛицо(ЭтотОбъект.ЗаказНаряд.ПолучитьОбъект(), Перечисления.ВидыОбъектовСведений.Руководитель);
	Руководитель = Руководители.РуководительПредставление;
	
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ПолноеНаименованиеОрганизации = СведенияООрганизации.ПолноеНаименование;
	ОбластьМакета.Параметры.ДатаДокумента  = Формат(Шапка.ДатаДокумента, "ДФ=""дд ММММ гггг""");
	ОбластьМакета.Параметры.ДатаЗаказНаряда = Формат(Шапка.ДатаЗаказНаряда, "ДЛФ=D");
	ОбластьМакета.Параметры.ФИОРуководителя = ВРег(Руководитель);
	ОбластьМакета.Параметры.Месторасположение = СведенияООрганизации.Город;
	
	ТабДок.Вывести(ОбластьМакета);
	Если ЭтоЮрЛицо Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Клиент_ЮЛ");
		ОбластьМакета.Параметры.Контрагент = ВРег(СведенияОКонтрагенте.ПолноеНаименование);

	Иначе	
		ОбластьМакета = Макет.ПолучитьОбласть("Клиент_ФЛ");
		ОбластьМакета.Параметры.Покупатель_ФИО_Полностью =  ВРег(СведенияОКонтрагенте.ПолноеНаименование);
		ОбластьМакета.Параметры.пасп_сер   = СведенияОКонтрагенте.ДокументСерия;
		ОбластьМакета.Параметры.пасп_ном   = СведенияОКонтрагенте.ДокументНомер;
		ОбластьМакета.Параметры.КогдаВыдан = ?(ЗначениеЗаполнено(СведенияОКонтрагенте.ДокументДатаВыдачи), Формат(СведенияОКонтрагенте.ДокументДатаВыдачи, "ДЛФ=D"), "Нет даты года");
		ОбластьМакета.Параметры.КемВыдан   = СведенияОКонтрагенте.ДокументКемВыдан;
	КонецЕсли;
	// Шапка
	ТабДок.Вывести(ОбластьМакета);

	ОбластьМакета =  Макет.ПолучитьОбласть("Текст_Общий");
	ОбластьМакета.Параметры.АдресХранителя = ?(СокрЛП(СведенияООрганизации.Город) = "Москва", "109431, г. Москва, ул. Привольная, д. 70", "г. Санкт-Петербург, ул. Ремесленная, д. 17, лит. «Т»"); 
	ТабДок.Вывести(ОбластьМакета);
	//ОбластьМакета =  Макет.ПолучитьОбласть("Текст_Общий");
	//ЭтоМосковскаяБаза = Константы.пацМосковскаяБаза.Получить();
	//ОбластьМакета.Параметры.АдресХранителя = ?(ЭтоМосковскаяБаза,"109431, г. Москва, ул. Привольная, д. 70", "г. Санкт-Петербург, ул. Ремесленная, д. 17, лит. «Т»"); 
	//ТабДок.Вывести(ОбластьМакета);   
	
	Если ЭтоЮрЛицо Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи_ЮЛ");
		ОбластьМакета.Параметры.Контрагент = ВРег(СведенияОКонтрагенте.ПолноеНаименование);
		ОбластьМакета.Параметры.ИННКонтрагента = СведенияОКонтрагенте.ИНН;
		ОбластьМакета.Параметры.КППКонтрагента = СведенияОКонтрагенте.КПП;
		ОбластьМакета.Параметры.КодПоОКПОКонтрагента = СведенияОКонтрагенте.КодПоОКПО;
		ОбластьМакета.Параметры.БанкКонтрагента = СведенияОКонтрагенте.Банк;
		ОбластьМакета.Параметры.БИККонтрагента = СведенияОКонтрагенте.БИК;
		ОбластьМакета.Параметры.КоррСчетКонтрагента = СведенияОКонтрагенте.КоррСчет;
		ОбластьМакета.Параметры.НомерСчетаКонтрагента = СведенияОКонтрагенте.НомерСчета;
		//ОбластьМакета.Параметры.ОГРНКонтрагента = Шапка.Контрагент.ОГРН;
	Иначе	
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи_ФЛ");
		ОбластьМакета.Параметры.Покупатель_ФИО_Полностью = ВРег(СведенияОКонтрагенте.ПолноеНаименование);
		ОбластьМакета.Параметры.ФактическийАдресКонтрагента = СведенияОКонтрагенте.АдресФактический;
		ОбластьМакета.Параметры.пасп_сер   = СведенияОКонтрагенте.ДокументСерия;
		ОбластьМакета.Параметры.пасп_ном   = СведенияОКонтрагенте.ДокументНомер;
		ОбластьМакета.Параметры.КогдаВыдан = ?(ЗначениеЗаполнено(СведенияОКонтрагенте.ДокументДатаВыдачи), Формат(СведенияОКонтрагенте.ДокументДатаВыдачи, "ДЛФ=D"), "Нет даты года");
		ОбластьМакета.Параметры.КемВыдан   = СведенияОКонтрагенте.ДокументКемВыдан;
	КонецЕсли;
	ОбластьМакета.Параметры.ТелефоныКонтрагента = СведенияОКонтрагенте.Телефон;
	ОбластьМакета.Параметры.ЮридическийАдресКонтрагента = СведенияОКонтрагенте.АдресЮридический;
	
	ОбластьМакета.Параметры.ПолноеНаименованиеОрганизации = СведенияООрганизации.ПолноеНаименование;
	ОбластьМакета.Параметры.ИНН = СведенияООрганизации.ИНН;
	ОбластьМакета.Параметры.КПП = СведенияООрганизации.КПП;
	ОбластьМакета.Параметры.ЮридическийАдрес = СведенияООрганизации.АдресЮридический;
	ОбластьМакета.Параметры.НомерСчета = СведенияООрганизации.НомерСчета;
	ОбластьМакета.Параметры.Банк = СведенияООрганизации.Банк;
	ОбластьМакета.Параметры.КоррСчет = СведенияООрганизации.КоррСчет;
	ОбластьМакета.Параметры.БИК = СведенияООрганизации.БИК;
	ОбластьМакета.Параметры.КодПоОКПО = СведенияООрганизации.КодПоОКПО;
	ОбластьМакета.Параметры.Телефоны = СведенияООрганизации.Телефон;
	ОбластьМакета.Параметры.ОГРН = СведенияООрганизации.ОГРН;
	ОбластьМакета.Параметры.ФИОРуководителя = ВРег(Руководитель);
	ОбластьМакета.Параметры.КраткоеНаименованиеОрганизации = СведенияООрганизации.Наименование;

    ТабДок.Вывести(ОбластьМакета);

	Возврат ТабДок;
КонецФункции		 

//! Функция формирует табличный документ с печатной формой акта об
// обказании услуг
//
// Возвращаемое значение:
//  Табличный документ - печатная форма акта
//
Функция ПечатьАктаОбОказанииУслуг() Экспорт 
	
	ЭтоЮрЛицо = Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо;

	ТабДокумент = Новый ТабличныйДокумент;
	
	//Найдем РТУ по З/н	
	обЗН = ЗаказНаряд.ПолучитьОбъект();
	СправочникДанных = Renault_AdvancedСервер.ПолучитьСправочникДанныхЗаказНаряда(ЗаказНаряд);
	СправочникДанныхОбъект = СправочникДанных.ПолучитьОбъект(); 

	РТУ = СправочникДанныхОбъект.ПолучитьСсылкуНаРТиУ();
	
	Если НЕ ЗначениеЗаполнено(РТУ) Тогда
		Если СправочникДанныхОбъект.Работы.Количество() < 2 ИЛИ 
			(СправочникДанныхОбъект.Работы.Количество() = 1 И СправочникДанныхОбъект.СтатусЗаказНаряда <> Справочники.Renault_Advanced_СтатусыЗаказНарядов.Закрыт) Тогда
			Сообщить("Заказ наряд не закрыт!");
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	СчетНаОплату = СправочникДанныхОбъект.ПолучитьСсылкуНаСчетНаОплату();
	
	ЗапросШапка = Новый Запрос;
	ЗапросШапка.УстановитьПараметр("ТекущийДокумент", РТУ);
	ЗапросШапка.УстановитьПараметр("УчитыватьНДС", СправочникДанныхОбъект.УчитыватьНДС);
	ЗапросШапка.УстановитьПараметр("СуммаВключаетНДС", СправочникДанныхОбъект.СуммаВключаетНДС);

	ЗапросШапка.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваров.Номер,
	|	РеализацияТоваров.Дата,
	|	РеализацияТоваров.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	РеализацияТоваров.Контрагент КАК Получатель,
	|	РеализацияТоваров.Организация КАК Поставщик,
	|	РеализацияТоваров.Организация КАК Организация,
	|	РеализацияТоваров.СуммаДокумента,
	|	РеализацияТоваров.ВалютаДокумента,
	|	РеализацияТоваров.КурсВалютыВзаиморасчетов КАК Курс,
	|	1 КАК Кратность,
	|	&УчитыватьНДС КАК УчитыватьНДС,
	|	&СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	Документ.РеализацияТоваров КАК РеализацияТоваров
	|ГДЕ
	|	РеализацияТоваров.Ссылка = &ТекущийДокумент";
	
	Если (Не ЗначениеЗаполнено(РТУ) И СправочникДанныхОбъект.Работы.Количество()>1)
		ИЛИ (Не ЗначениеЗаполнено(РТУ) И СправочникДанныхОбъект.Работы.Количество()=1 И СправочникДанныхОбъект.СтатусЗаказНаряда <> Справочники.Renault_Advanced_СтатусыЗаказНарядов.Закрыт)Тогда
		ЗапросШапка.Текст = СтрЗаменить(ЗапросШапка.Текст,"Документ.РеализацияТоваров","Документ.ЗаказНаряд");  
		ЗапросШапка.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.ЗаказНаряд.Ссылка);
	КонецЕсли;
	
	Шапка = ЗапросШапка.Выполнить().Выбрать();
	Шапка.Следующий();

	Если ЗначениеЗаполнено(РТУ) И СправочникДанныхОбъект.Работы.Количество()=1 Тогда
		
		ЗапросУслуги = Новый Запрос;
		ЗапросУслуги.УстановитьПараметр("ТекущийДокумент", РТУ);
		ЗапросУслуги.УстановитьПараметр("Курс",            Шапка.Курс);
		ЗапросУслуги.УстановитьПараметр("Кратность",       Шапка.Кратность);
		ЗапросУслуги.Текст =
		"ВЫБРАТЬ
		|	РеализацияТоваровТовары.Номенклатура.Наименование КАК Номенклатура,
		|	РеализацияТоваровТовары.Номенклатура.Наименование КАК Товар,
		|	РеализацияТоваровТовары.Количество,
		|	РеализацияТоваровТовары.ЕдиницаИзмерения,
		|	РеализацияТоваровТовары.Цена * &Курс / &Кратность КАК Цена,
		|	РеализацияТоваровТовары.СуммаВсего * &Курс / &Кратность КАК Сумма,
		|	РеализацияТоваровТовары.СтавкаНДС,
		|	РеализацияТоваровТовары.СуммаНДС * &Курс / &Кратность КАК СуммаНДС,
		|	РеализацияТоваровТовары.ПроцентСкидки КАК Скидка,
		|	1 КАК Метка
		|ИЗ
		|	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
		|ГДЕ
		|	РеализацияТоваровТовары.Ссылка = &ТекущийДокумент
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеализацияТоваровТовары.НомерСтроки";

		ТаблицаУслуги = ЗапросУслуги.Выполнить().Выгрузить();
	
	Иначе 
		ЗапросУслуги = Новый Запрос;
		ЗапросУслуги.Текст = "ВЫБРАТЬ
		                     |	ЗаказНарядРаботы.Работа,
		                     |	ЗаказНарядРаботы.Количество,
		                     |	ЗаказНарядРаботы.Цена,
		                     |	ЗаказНарядРаботы.Сумма,
		                     |	ЗаказНарядРаботы.СтавкаНДС,
		                     |	ЗаказНарядРаботы.СуммаНДС,
		                     |	ЗаказНарядРаботы.ПроцентСкидкиНаценки КАК Скидка,
		                     |	ЗаказНарядРаботы.Ссылка.СуммаВключаетНДС
		                     |ИЗ
		                     |	Справочник.Renault_Advanced_ДанныеЗаказНаряда.Работы КАК ЗаказНарядРаботы
		                     |ГДЕ
		                     |	ЗаказНарядРаботы.Ссылка = &Ссылка";
		ЗапросУслуги.УстановитьПараметр("Ссылка", СправочникДанных);					 
		ТаблицаУслуги = ЗапросУслуги.Выполнить().Выгрузить();
		
    КонецЕсли;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Renault_Advanced_ДоговорХраненияКолес_АктБезПросрочки";
	Макет       = ПолучитьМакет("АктБезПросрочки");

	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	Если ЗначениеЗаполнено(РТУ) И СправочникДанных.Работы.Количество()=1 Тогда
		ДатаАкта = Шапка.Дата;
	Иначе
		ДатаАкта = ДатаВыдачиФакт;
	КонецЕсли;
	
	НомерЗаказНаряд = дкПолучитьНомерДляПечати(ЗаказНаряд);
	НомерСчет = дкПолучитьНомерДляПечати(СчетНаОплату);
	
	ОбластьМакета.Параметры.ТекстЗаголовка = "Акт от " + Формат(ДатаАкта, "ДФ=dd.MM.yyyy") + " года"
	+ ?(ЗначениеЗаполнено(СчетНаОплату), " (к счету № " + НомерСчет + " от "+Формат(СчетНаОплату.Дата, "ДФ=dd.MM.yyyy") + ")", "")
	+ Символы.ПС + "к заказ-наряду № " + НомерЗаказНаряд + " от " + Формат(ЗаказНаряд.Дата, "ДФ=dd.MM.yyyy");
	ТабДокумент.Вывести(ОбластьМакета);

	Запрос	= Новый Запрос;
	Запрос.Текст = 		
	"ВЫБРАТЬ
	|	Организации.НаименованиеПолное,
	|	Организации.Ссылка КАК Организация,
	|	Организации.ИНН,
	|	Организации.КПП,
	|	Организации.ОГРН,
	|	Организации.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчета,
	|	Организации.ОсновнойБанковскийСчет.Банк.Наименование КАК БанкНаименование,
	|	Организации.ОсновнойБанковскийСчет.Банк.КоррСчет КАК КоррСчет,
	|	Организации.ОсновнойБанковскийСчет.Банк.Код КАК БИК,
	|	Организации.КодПоОКПО
	|ПОМЕСТИТЬ ОрганизацияИнформация
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Организации
	|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Организации).Ссылка
	|	КОНЕЦ КАК Организация,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Телефон)
	|				ТОГДА КонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Телефон,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|				ТОГДА КонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Адрес
	|ПОМЕСТИТЬ ОргКонт
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Организация
	|	И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Телефон)
	|				И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.ТелефонРабочий)
	|			ИЛИ КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|				И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.АдресЮридический))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Организации
	|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Организации).Ссылка
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацияИнформация.НаименованиеПолное КАК ПолноеНаименование,
	|	ОрганизацияИнформация.ИНН КАК ИНН,
	|	ОрганизацияИнформация.КПП КАК КПП,
	|	ОрганизацияИнформация.ОГРН КАК ОГРН,
	|	ОрганизацияИнформация.НомерСчета КАК НомерСчета,
	|	ОрганизацияИнформация.БанкНаименование КАК Банк,
	|	ОрганизацияИнформация.КоррСчет КАК КоррСчет,
	|	ОрганизацияИнформация.БИК КАК БИК,
	|	ОргКонт.Телефон КАК Телефон,
	|	ОргКонт.Адрес КАК АдресЮридический,
	|	ОрганизацияИнформация.КодПоОКПО КАК КодПоОКПО
	|ИЗ
	|	ОрганизацияИнформация КАК ОрганизацияИнформация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОргКонт КАК ОргКонт
	|		ПО ОрганизацияИнформация.Организация = ОргКонт.Организация";
	Запрос.УстановитьПараметр("Организация", Шапка.Поставщик);
	Результат = Запрос.Выполнить();
	СведенияООрганизации = Результат.Выбрать();		
	СведенияООрганизации.Следующий(); 
	
	Запрос	= Новый Запрос;
	Запрос.Текст = 		
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.НаименованиеПолное,
	|	Контрагенты.КодПоОКПО,
	|	Контрагенты.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчета,
	|	Контрагенты.ОсновнойБанковскийСчет.Банк.Наименование КАК Банк,
	|	Контрагенты.ОсновнойБанковскийСчет.Банк.КоррСчет КАК КоррСчет,
	|	Контрагенты.ОсновнойБанковскийСчет.Банк.Код КАК БИК
	|ПОМЕСТИТЬ КонтрагентИнфа
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Контрагенты).Ссылка
	|	КОНЕЦ КАК Контрагент,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Телефон)
	|				ТОГДА КонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Телефон,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|					И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.АдресФактический)
	|				ТОГДА КонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК АдресФактический,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|					И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.АдресЮридический)
	|				ТОГДА КонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК АдресЮридический
	|ПОМЕСТИТЬ КонтИнфа
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Контрагент
	|	И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Телефон)
	|				И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.ТелефонКонтактный)
	|			ИЛИ КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|				И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.АдресФактический)
	|			ИЛИ КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|				И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.АдресЮридический))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Контрагенты).Ссылка
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодтверждающиеДокументы.Серия,
	|	ПодтверждающиеДокументы.Номер,
	|	ПодтверждающиеДокументы.ДатаВыдачи,
	|	ПодтверждающиеДокументы.КемВыдан,
	|	ПодтверждающиеДокументы.Владелец КАК Контрагент
	|ПОМЕСТИТЬ ДокументКонтрагента
	|ИЗ
	|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|ГДЕ
	|	ПодтверждающиеДокументы.Владелец = &Контрагент
	|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Паспорт)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтрагентИнфа.ИНН,
	|	КонтрагентИнфа.КПП,
	|	КонтрагентИнфа.НаименованиеПолное КАК ПолноеНаименование,
	|	КонтИнфа.Телефон,
	|	КонтИнфа.АдресФактический КАК АдресФактический,
	|	КонтИнфа.АдресЮридический КАК АдресЮридический,
	|	ДокументКонтрагента.Серия КАК ДокументСерия,
	|	ДокументКонтрагента.Номер КАК ДокументНомер,
	|	ДокументКонтрагента.ДатаВыдачи КАК ДокументДатаВыдачи,
	|	ДокументКонтрагента.КемВыдан КАК ДокументКемВыдан,
	|	КонтрагентИнфа.КодПоОКПО,
	|	КонтрагентИнфа.НомерСчета,
	|	КонтрагентИнфа.Банк,
	|	КонтрагентИнфа.КоррСчет,
	|	КонтрагентИнфа.БИК
	|ИЗ
	|	КонтрагентИнфа КАК КонтрагентИнфа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументКонтрагента КАК ДокументКонтрагента
	|		ПО КонтрагентИнфа.Контрагент = ДокументКонтрагента.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтИнфа КАК КонтИнфа
	|		ПО КонтрагентИнфа.Контрагент = КонтИнфа.Контрагент";
	                                                      
	Запрос.УстановитьПараметр("Контрагент", Шапка.Получатель);
	Результат =  Запрос.Выполнить();
	СведенияОКонтрагенте = Результат.Выбрать();
	СведенияОКонтрагенте.Следующий();

	
	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ПредставлениеПоставщика = СведенияООрганизации.ПолноеНаименование + 
								" ИНН " + СведенияООрганизации.ИНН + 
								" КПП " + СведенияООрганизации.КПП + 
								" Адрес: " + СведенияООрганизации.АдресЮридический;
								
	ОбластьМакета.Параметры.ПредставлениеПоставщика = ПредставлениеПоставщика;
	ОбластьМакета.Параметры.Поставщик = Шапка.Поставщик;
	ТабДокумент.Вывести(ОбластьМакета);
	
	ПредставлениеПолучателя = СведенияОКонтрагенте.ПолноеНаименование + 
								?(ЭтоЮрЛицо, " ИНН " + СведенияОКонтрагенте.ИНН + 
								" КПП " + СведенияОКонтрагенте.КПП, "") + 
								" Адрес: " + СведенияОКонтрагенте.АдресФактический;

	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ОбластьМакета.Параметры.ПредставлениеПолучателя = ПредставлениеПолучателя;
	ОбластьМакета.Параметры.Получатель = Шапка.Получатель;                                                                                                                       
	ТабДокумент.Вывести(ОбластьМакета);
	
	ПараметрыПечати = Новый Структура;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	"+СформироватьСтрокуПоляЗапроса("МаркаМодель")+" КАК МаркаМодель,
	|	ДоговорХраненияКолес.ЗаказНаряд.Автомобиль.VIN КАК VIN
	|ИЗ
	|	Документ.Renault_Advanced_ДоговорХраненияКолес КАК ДоговорХраненияКолес
	|ГДЕ
	|	ДоговорХраненияКолес.Ссылка = &ТекущийДокумент";
	Автомобиль = Запрос.Выполнить().Выбрать();
	Автомобиль.Следующий();
	ПараметрыПечати.Вставить("МаркаМодель", Автомобиль.МаркаМодель);
	ПараметрыПечати.Вставить("VIN", Автомобиль.VIN);
   	ПараметрыПечати.Вставить("ГосНомер", Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ЗаказНаряд.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер));
      
	ОбластьМакета = Макет.ПолучитьОбласть("Автомобиль");
	ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
	ТабДокумент.Вывести(ОбластьМакета);

	ЕстьСкидки   = ТаблицаУслуги.Итог("Скидка") <> 0;
	ВалютаПечати = Шапка.ВалютаДокумента;

	// Вывести табличную часть
	Если ЕстьСкидки  Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой");
		ОбластьСтроки = Макет.ПолучитьОбласть("СтрокаСоСкидкой");
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
	КонецЕсли;

	ТабДокумент.Вывести(ОбластьМакета);
	НомерСтроки = 0;

	Для Каждого СтрокаТабличнойЧасти Из ТаблицаУслуги Цикл	

		НомерСтроки = НомерСтроки + 1;

		ОбластьСтроки.Параметры.Заполнить(СтрокаТабличнойЧасти);
		ОбластьСтроки.Параметры.НомерСтроки = НомерСтроки;
		Если СрокХраненияПросрочка > 0 И СуммаПросрочки > 0 И СправочникДанных.Работы.Количество() = 2 Тогда
			Если СтрокаТабличнойЧасти.Работа = Справочники.Автоработы.НайтиПоНаименованию("Хранение колес просроченное", Истина) Тогда
			ОбластьСтроки.Параметры.Товар            = "Сезонное хранение 1месяц, 1комплект " + Размер.ПосадочныйДиаметр + " (просроченное хранение)";
			ОбластьСтроки.Параметры.Количество       = СрокХраненияПросрочка;
			Иначе
			ОбластьСтроки.Параметры.Товар            = "Сезонное хранение 1месяц, 1комплект " + Размер.ПосадочныйДиаметр;
			ОбластьСтроки.Параметры.Количество       = СрокХранения;
			КонецЕсли;
		Иначе
			ОбластьСтроки.Параметры.Товар            = "Сезонное хранение 1месяц, 1комплект " + Размер.ПосадочныйДиаметр;
			ОбластьСтроки.Параметры.Количество       = СрокХранения;
		КонецЕсли;
		
		ОбластьСтроки.Параметры.ЕдиницаИзмерения = "мес"; 
        ОбластьСтроки.Параметры.Цена             = Цена;
		
		Если ЕстьСкидки Тогда
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Скидка) И СтрокаТабличнойЧасти.Скидка <> 100 Тогда
				Скидка = СтрокаТабличнойЧасти.Сумма / (100 - СтрокаТабличнойЧасти.Скидка) * СтрокаТабличнойЧасти.Скидка;
			Иначе
				Скидка = 0;
			КонецЕсли;			
			
			ОбластьСтроки.Параметры.Скидка         = Скидка;
			ОбластьСтроки.Параметры.СуммаБезСкидки = Renault_Advanced_ОбщегоНазначения.ФорматСумм(СтрокаТабличнойЧасти.Сумма + Скидка);
		КонецЕсли;

		ТабДокумент.Вывести(ОбластьСтроки);

	КонецЦикла;

	Если ТаблицаУслуги <> Неопределено Тогда

		тСумма    = ТаблицаУслуги.Итог("Сумма");
		СуммаНДС = ТаблицаУслуги.Итог("СуммаНДС");

	Иначе

		тСумма    = 0;
		СуммаНДС = 0;

	КонецЕсли;

	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	ОбластьМакета.Параметры.Всего = Renault_Advanced_ОбщегоНазначения.ФорматСумм(тСумма);
	ТабДокумент.Вывести(ОбластьМакета);

	Если Шапка.УчитыватьНДС Тогда

		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНДС");
		ОбластьМакета.Параметры.ВсегоНДС = Renault_Advanced_ОбщегоНазначения.ФорматСумм(СуммаНДС);
		ОбластьМакета.Параметры.НДС      = ?(Шапка.СуммаВключаетНДС, "В том числе НДС", " Сумма НДС");
		ТабДокумент.Вывести(ОбластьМакета);

	КонецЕсли;

	СуммаКПрописи = тСумма + ?(Шапка.СуммаВключаетНДС, 0, СуммаНДС);
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
	ОбластьМакета.Параметры.ИтоговаяСтрока ="Всего оказано услуг " + НомерСтроки + ", на сумму " + Renault_Advanced_ОбщегоНазначения.ФорматСумм(СуммаКПрописи, ВалютаПечати);
	ОбластьМакета.Параметры.СуммаПрописью  = Renault_Advanced_ОбщегоНазначения.СформироватьСуммуПрописью(СуммаКПрописи, ВалютаПечати);
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	ТабДокумент.Вывести(ОбластьМакета);

	Возврат ТабДокумент;

КонецФункции // ПечатьАктаОбОказанииУслуг()

//! Функция формирует табличный документ с печатной формой заказа или счета
//
// Возвращаемое значение:
//  Табличный документ - сформированная печатная форма
//
Функция ПечатьСчета(Тип) 	
	Документ = Неопределено;
	
	СправочникДанных = Renault_AdvancedСервер.ПолучитьСправочникДанныхЗаказНаряда(ЗаказНаряд);
	СправочникДанныхОбъект = СправочникДанных.ПолучитьОбъект(); 

	Если Тип = "СчетЗаказ" Тогда
		Документ = СправочникДанныхОбъект.ПолучитьСсылкуНаСчетНаОплату();
	ИначеЕсли Тип = "СчетЗаказДоплата" Тогда
		Если СправочникДанныхОбъект.СтатусЗаказНаряда = Справочники.Renault_Advanced_СтатусыЗаказНарядов.Закрыт
			И СправочникДанныхОбъект.Работы.Количество() = 1 Тогда
			Документ = ПолучитьСсылкуНаЗаказПокупателя();
		ИначеЕсли СправочникДанныхОбъект.Работы.Количество() > 1 Тогда
			Документ = ЭтотОбъект.ЗаказНаряд.Ссылка;
		КонецЕсли; 		
	КонецЕсли;
	
	Если Документ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СоздатьТабличныйДокументПечатиСчетаЗаказа(Тип, ПолучитьПараметрыПечатиСчетаЗаказа(Тип, Документ));
КонецФункции

//!
Функция СоздатьТабличныйДокументПечатиСчетаЗаказа(Тип, ПараметрыПечати)
		
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Renault_Advanced_ДоговорХраненияКолес_СчетЗаказ";

	Макет = ПолучитьМакет("СчетЗаказ");

	// Выводим шапку накладной
	
	СправочникДанных = Renault_AdvancedСервер.ПолучитьСправочникДанныхЗаказНаряда(ЗаказНаряд);
	СправочникДанныхОбъект = СправочникДанных.ПолучитьОбъект(); 

	ОбластьМакета       = Макет.ПолучитьОбласть("ЗаголовокСчета");
	ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
	ОбластьМакета.Параметры.КДоговоруХранения = Renault_Advanced_ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, "К договору хранения");
	ОбластьМакета.Параметры.ТекстЗаголовка =  Renault_Advanced_ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект.ЗаказНаряд, "Счет на оплату");

	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
	ТабДокумент.Вывести(ОбластьМакета);
	
	// Данные по а/м
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка_АМ");
	ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
	ОбластьКодов  = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
	ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
	ОбластьСкидок = Макет.ПолучитьОбласть("ШапкаТаблицы|Скидка");
	ОбластьСуммы  = Макет.ПолучитьОбласть("ШапкаТаблицы|Сумма");

	ОбластьТовар = Макет.ПолучитьОбласть("ШапкаТаблицы|Товар");
	Если Не ПараметрыПечати.ВыводитьКоды И ПараметрыПечати.ЕстьСкидки Тогда
		ОбластьТовар = Макет.ПолучитьОбласть("ШапкаТаблицы|ТоварБезКодов");
	ИначеЕсли НЕ ПараметрыПечати.ЕстьСкидки И ПараметрыПечати.ВыводитьКоды Тогда
		ОбластьТовар = Макет.ПолучитьОбласть("ШапкаТаблицы|ТоварБезСкидок");
	ИначеЕсли НЕ ПараметрыПечати.ЕстьСкидки И НЕ ПараметрыПечати.ВыводитьКоды Тогда
		ОбластьТовар = Макет.ПолучитьОбласть("ШапкаТаблицы|ТоварБезКодовИСкидок");
	КонецЕсли;

	ТабДокумент.Вывести(ОбластьНомера);
	Если ПараметрыПечати.ВыводитьКоды Тогда
		ОбластьКодов.Параметры.ИмяКолонкиКодов = ПараметрыПечати.ИмяКолонкиКодов;
		ТабДокумент.Присоединить(ОбластьКодов);
	КонецЕсли;
	ОбластьТовар.Параметры.Товар = "Товары (работы, услуги)";
	ТабДокумент.Присоединить(ОбластьТовар);
	ТабДокумент.Присоединить(ОбластьДанных);
	Если ПараметрыПечати.ЕстьСкидки Тогда
		ТабДокумент.Присоединить(ОбластьСкидок);
	КонецЕсли;
	ТабДокумент.Присоединить(ОбластьСуммы);

	ОбластьНомера = Макет.ПолучитьОбласть("Строка|НомерСтроки");
	ОбластьКодов  = Макет.ПолучитьОбласть("Строка|КолонкаКодов");
	ОбластьДанных = Макет.ПолучитьОбласть("Строка|Данные");
	ОбластьСкидок = Макет.ПолучитьОбласть("Строка|Скидка");
	ОбластьСуммы  = Макет.ПолучитьОбласть("Строка|Сумма");

	ОбластьТовар = Макет.ПолучитьОбласть("Строка|Товар");
	Если Не ПараметрыПечати.ВыводитьКоды И ПараметрыПечати.ЕстьСкидки Тогда
		ОбластьТовар = Макет.ПолучитьОбласть("Строка|ТоварБезКодов");
	ИначеЕсли НЕ ПараметрыПечати.ЕстьСкидки И ПараметрыПечати.ВыводитьКоды Тогда
		ОбластьТовар = Макет.ПолучитьОбласть("Строка|ТоварБезСкидок");
	ИначеЕсли НЕ ПараметрыПечати.ЕстьСкидки И НЕ ПараметрыПечати.ВыводитьКоды Тогда
		ОбластьТовар = Макет.ПолучитьОбласть("Строка|ТоварБезКодовИСкидок");
	КонецЕсли;

	Для каждого ПараметрыПозиции Из ПараметрыПечати.Позиции Цикл 

		Если не ЗначениеЗаполнено(ПараметрыПозиции.Номенклатура) Тогда
			Сообщить("В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.", СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		ОбластьНомера.Параметры.Заполнить(ПараметрыПозиции);
		ТабДокумент.Вывести(ОбластьНомера);

		Если ПараметрыПечати.ВыводитьКоды Тогда
			ОбластьКодов.Параметры.Заполнить(ПараметрыПозиции);
			ТабДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;

		ОбластьТовар.Параметры.Заполнить(ПараметрыПозиции);
		Если Тип = "СчетЗаказДоплата" и ПараметрыПечати.СрокХраненияПросрочка<>0 и СправочникДанныхОбъект.Работы.Количество()>1 Тогда
			ОбластьТовар.Параметры.Товар = "Сезонное хранение (просроченное) 1месяц, 1комплект " + ПараметрыПечати.Радиус;	
		Иначе			
			ОбластьТовар.Параметры.Товар = "Сезонное хранение 1месяц, 1комплект " + ПараметрыПечати.Радиус;
		КонецЕсли;
		ТабДокумент.Присоединить(ОбластьТовар);
		ОбластьДанных.Параметры.Заполнить(ПараметрыПозиции);

		ОбластьДанных.Параметры.Количество = ?(Тип = "СчетЗаказДоплата", ПараметрыПечати.СрокХраненияПросрочка, ПараметрыПечати.СрокХранения);
		
		Если Тип = "СчетЗаказДоплата" и ПараметрыПечати.СрокХраненияПросрочка<>0 и СправочникДанныхОбъект.Работы.Количество()>1 Тогда
				ОбластьДанных.Параметры.Цена = ПараметрыПозиции.Цена;
		Иначе
				ОбластьДанных.Параметры.Цена = ?(Тип = "СчетЗаказДоплата" и ПараметрыПечати.СрокХраненияПросрочка<>0, ПараметрыПозиции.Цена/ПараметрыПечати.СрокХраненияПросрочка, ПараметрыПечати.ЦенаХранения);
		Конецесли;		
		ТабДокумент.Присоединить(ОбластьДанных);

		Если ПараметрыПечати.ЕстьСкидки Тогда
			ОбластьСкидок.Параметры.Заполнить(ПараметрыПозиции);
			ТабДокумент.Присоединить(ОбластьСкидок);
		КонецЕсли;

		ОбластьСуммы.Параметры.Заполнить(ПараметрыПозиции);
		ТабДокумент.Присоединить(ОбластьСуммы);
		
	КонецЦикла;

	// Вывести Итого
	ОбластьНомера = Макет.ПолучитьОбласть("Итого|НомерСтроки");
	ОбластьКодов  = Макет.ПолучитьОбласть("Итого|КолонкаКодов");
	ОбластьДанных = Макет.ПолучитьОбласть("Итого|Данные");
	ОбластьСкидок = Макет.ПолучитьОбласть("Итого|Скидка");
	ОбластьСуммы  = Макет.ПолучитьОбласть("Итого|Сумма");

	ОбластьТовар = Макет.ПолучитьОбласть("Итого|Товар");
	Если Не ПараметрыПечати.ВыводитьКоды И ПараметрыПечати.ЕстьСкидки Тогда
		ОбластьТовар = Макет.ПолучитьОбласть("Итого|ТоварБезКодов");
	ИначеЕсли НЕ ПараметрыПечати.ЕстьСкидки И ПараметрыПечати.ВыводитьКоды Тогда
		ОбластьТовар = Макет.ПолучитьОбласть("Итого|ТоварБезСкидок");
	ИначеЕсли НЕ ПараметрыПечати.ЕстьСкидки И НЕ ПараметрыПечати.ВыводитьКоды Тогда
		ОбластьТовар = Макет.ПолучитьОбласть("Итого|ТоварБезКодовИСкидок");
	КонецЕсли;

	ТабДокумент.Вывести(ОбластьНомера);
	Если ПараметрыПечати.ВыводитьКоды Тогда
		ТабДокумент.Присоединить(ОбластьКодов);
	КонецЕсли;
	ТабДокумент.Присоединить(ОбластьТовар);
	ТабДокумент.Присоединить(ОбластьДанных);
	Если ПараметрыПечати.ЕстьСкидки Тогда
		ОбластьСкидок.Параметры.Заполнить(ПараметрыПечати);
		ТабДокумент.Присоединить(ОбластьСкидок);
	КонецЕсли;
	ОбластьСуммы.Параметры.Заполнить(ПараметрыПечати);
	ТабДокумент.Присоединить(ОбластьСуммы);

	// Вывести ИтогоНДС
	Если ПараметрыПечати.УчитыватьНДС Тогда
		ОбластьНомера = Макет.ПолучитьОбласть("ИтогоНДС|НомерСтроки");
		ОбластьКодов  = Макет.ПолучитьОбласть("ИтогоНДС|КолонкаКодов");
		ОбластьДанных = Макет.ПолучитьОбласть("ИтогоНДС|Данные");
		ОбластьСкидок = Макет.ПолучитьОбласть("ИтогоНДС|Скидка");
		ОбластьСуммы  = Макет.ПолучитьОбласть("ИтогоНДС|Сумма");

		ОбластьТовар = Макет.ПолучитьОбласть("ИтогоНДС|Товар");
		Если Не ПараметрыПечати.ВыводитьКоды И ПараметрыПечати.ЕстьСкидки Тогда
			ОбластьТовар = Макет.ПолучитьОбласть("ИтогоНДС|ТоварБезКодов");
		ИначеЕсли НЕ ПараметрыПечати.ЕстьСкидки И ПараметрыПечати.ВыводитьКоды Тогда
			ОбластьТовар = Макет.ПолучитьОбласть("ИтогоНДС|ТоварБезСкидок");
		ИначеЕсли НЕ ПараметрыПечати.ЕстьСкидки И НЕ ПараметрыПечати.ВыводитьКоды Тогда
			ОбластьТовар = Макет.ПолучитьОбласть("ИтогоНДС|ТоварБезКодовИСкидок");
		КонецЕсли;

		ТабДокумент.Вывести(ОбластьНомера);
		Если ПараметрыПечати.ВыводитьКоды Тогда
			ТабДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		ОбластьТовар.Параметры.Заполнить(ПараметрыПечати);
		ТабДокумент.Присоединить(ОбластьТовар);
		ОбластьДанных.Параметры.Заполнить(ПараметрыПечати);
		ТабДокумент.Присоединить(ОбластьДанных);
		Если ПараметрыПечати.ЕстьСкидки Тогда
			ТабДокумент.Присоединить(ОбластьСкидок);
		КонецЕсли;
		ОбластьСуммы.Параметры.Заполнить(ПараметрыПечати);
		ТабДокумент.Присоединить(ОбластьСуммы);
		
		ОбластьНомера = Макет.ПолучитьОбласть("ВсегоКОплате|НомерСтроки");
		ОбластьКодов  = Макет.ПолучитьОбласть("ВсегоКОплате|КолонкаКодов");
		ОбластьДанных = Макет.ПолучитьОбласть("ВсегоКОплате|Данные");
		ОбластьСкидок = Макет.ПолучитьОбласть("ВсегоКОплате|Скидка");
		ОбластьСуммы  = Макет.ПолучитьОбласть("ВсегоКОплате|Сумма");

		ОбластьТовар = Макет.ПолучитьОбласть("ВсегоКОплате|Товар");
		Если Не ПараметрыПечати.ВыводитьКоды И ПараметрыПечати.ЕстьСкидки Тогда
			ОбластьТовар = Макет.ПолучитьОбласть("ВсегоКОплате|ТоварБезКодов");
		ИначеЕсли НЕ ПараметрыПечати.ЕстьСкидки И ПараметрыПечати.ВыводитьКоды Тогда
			ОбластьТовар = Макет.ПолучитьОбласть("ВсегоКОплате|ТоварБезСкидок");
		ИначеЕсли НЕ ПараметрыПечати.ЕстьСкидки И НЕ ПараметрыПечати.ВыводитьКоды Тогда
			ОбластьТовар = Макет.ПолучитьОбласть("ВсегоКОплате|ТоварБезКодовИСкидок");
		КонецЕсли;

		ТабДокумент.Вывести(ОбластьНомера);
		Если ПараметрыПечати.ВыводитьКоды Тогда
			ТабДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		ОбластьТовар.Параметры.Заполнить(ПараметрыПечати);
		ТабДокумент.Присоединить(ОбластьТовар);
		ОбластьДанных.Параметры.Заполнить(ПараметрыПечати);
		ТабДокумент.Присоединить(ОбластьДанных);
		Если ПараметрыПечати.ЕстьСкидки Тогда
			ТабДокумент.Присоединить(ОбластьСкидок);
		КонецЕсли;
		ОбластьСуммы.Параметры.Заполнить(ПараметрыПечати);
		ТабДокумент.Присоединить(ОбластьСуммы);
		
	КонецЕсли;

	// Вывести Сумму прописью
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
	ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("ПодвалСчета");
	
	ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
	
	ТабДокумент.Вывести(ОбластьМакета);

	Возврат ТабДокумент;

КонецФункции // СоздатьТабличныйДокументПечатиСчетаЗаказа()

//! Функция помещает в структуру все данные, отображаемые при печати документа.
// Вызывается из функции ПечатьСчетаЗаказа и из веб-приложения
//
// Параметры:
//  Тип - строка, содержит тип печатаемого документа (счет или заказ)
//
// Возвращаемое значение:
//  Структура
//
Функция ПолучитьПараметрыПечатиСчетаЗаказа(Тип, СчетЗаказ) Экспорт
	СправочникДанных = Renault_AdvancedСервер.ПолучитьСправочникДанныхЗаказНаряда(ЗаказНаряд); 
	СправочникДанныхОбъект = СправочникДанных.ПолучитьОбъект();
	
	ПараметрыПечати = Новый Структура;
	Позиции = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", СчетЗаказ);
	Запрос.УстановитьПараметр("Организация", СчетЗаказ.Организация);
	Запрос.УстановитьПараметр("Контрагент", СчетЗаказ.Контрагент);
	//Запрос.УстановитьПараметр("ПустойКонтрагент", Справочники.Контрагенты.ПустаяСсылка());
	Запрос.УстановитьПараметр("УчитыватьНДС", СправочникДанных.УчитыватьНДС);
	Запрос.УстановитьПараметр("СуммаВключаетНДС", СправочникДанных.СуммаВключаетНДС);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Организации
	               |			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Организации).Ссылка
	               |	КОНЕЦ КАК Организация,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Телефон)
	               |				ТОГДА КонтактнаяИнформация.Представление
	               |			ИНАЧЕ """"""""
	               |		КОНЕЦ) КАК Телефон,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	               |				ТОГДА КонтактнаяИнформация.Представление
	               |			ИНАЧЕ """"""""
	               |		КОНЕЦ) КАК Адрес
	               |ПОМЕСТИТЬ ОргКонт
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Организация
	               |	И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Телефон)
	               |				И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.ТелефонРабочий)
	               |			ИЛИ КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	               |				И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.АдресЮридический))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЫБОР
	               |		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Организации
	               |			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Организации).Ссылка
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
	               |			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Контрагенты).Ссылка
	               |	КОНЕЦ КАК Контрагент,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Телефон)
	               |				ТОГДА КонтактнаяИнформация.Представление
	               |			ИНАЧЕ """"""""
	               |		КОНЕЦ) КАК Телефон,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	               |				ТОГДА КонтактнаяИнформация.Представление
	               |			ИНАЧЕ """"""""
	               |		КОНЕЦ) КАК Адрес
	               |ПОМЕСТИТЬ КонтрагентКонт
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Контрагент
	               |	И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Телефон)
	               |				И КонтактнаяИнформация.ЗначениеПоУмолчанию
	               |			ИЛИ КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	               |				И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.АдресФактический))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЫБОР
	               |		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
	               |			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Контрагенты).Ссылка
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СчетНаОплату.Номер,
	               |	СчетНаОплату.Дата,
	               |	СчетНаОплату.ДоговорВзаиморасчетов,
	               |	СчетНаОплату.Организация,
	               |	СчетНаОплату.Контрагент КАК Получатель,
	               |	СчетНаОплату.Организация КАК Грузоотправитель,
	               |	СчетНаОплату.Контрагент КАК Грузополучатель,
	               |	СчетНаОплату.Организация КАК Руководители,
	               |	СчетНаОплату.Организация КАК Поставщик,
	               |	СчетНаОплату.СуммаДокумента,
	               |	СчетНаОплату.ВалютаДокумента,
	               |	&УчитыватьНДС КАК УчитыватьНДС,
	               |	&СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |	ЕСТЬNULL(ОргКонт.Адрес, """") КАК АдресОрганизация,
	               |	ЕСТЬNULL(ОргКонт.Телефон, """") КАК ТелефонОрганизация,
	               |	ЕСТЬNULL(КонтрагентКонт.Телефон, """") КАК ТелефонКонтрагент,
	               |	ЕСТЬNULL(КонтрагентКонт.Адрес, """") КАК АдресКонтрагент
	               |ИЗ
	               |	Документ.СчетНаОплату КАК СчетНаОплату
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ОргКонт КАК ОргКонт
	               |		ПО СчетНаОплату.Организация = ОргКонт.Организация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентКонт КАК КонтрагентКонт
	               |		ПО СчетНаОплату.Контрагент = КонтрагентКонт.Контрагент
	               |ГДЕ
	               |	СчетНаОплату.Ссылка = &ТекущийДокумент";
	Если ТипЗнч(СчетЗаказ) = Тип("ДокументСсылка.ЗаказПокупателя") 	Тогда
	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.СчетНаОплату", "Документ.ЗаказПокупателя");
	ИначеЕсли ТипЗнч(СчетЗаказ) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.СчетНаОплату", "Документ.ЗаказНаряд");
	    Запрос.Текст = СтрЗаменить(Запрос.Текст, "Контрагент КАК Грузополучатель","Организация КАК Грузополучатель");
	КонецЕсли;
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	Если ТипЗнч(СчетЗаказ) = Тип("ДокументСсылка.ЗаказПокупателя") 
		ИЛИ ТипЗнч(СчетЗаказ) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		
		//СтрокаВыборкиПоляСодержания = Renault_Advanced_ОбработкаТабличныхЧастей.ПолучитьЧастьЗапросаДляВыбораСодержания("СчетНаОплату");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", СчетЗаказ);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВложенныйЗапрос.Номенклатура,
		               |	ВЫРАЗИТЬ(ВложенныйЗапрос.Номенклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НаименованиеПолное,
		               |	ВложенныйЗапрос.Номенклатура.Код КАК Код,
		               |	ВложенныйЗапрос.Номенклатура.Артикул КАК Артикул,
		               |	ВложенныйЗапрос.Количество,
		               |	ВложенныйЗапрос.ЕдиницаИзмерения.Представление КАК ЕдиницаИзмерения,
		               |	ВложенныйЗапрос.ПроцентСкидкиНаценки КАК Скидка,
		               |	ВложенныйЗапрос.Цена,
		               |	ВложенныйЗапрос.СуммаНДС,
		               |	ВложенныйЗапрос.Характеристика,
		               |	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
		               |	ВложенныйЗапрос.Метка КАК Метка,
		               |	ВложенныйЗапрос.Сумма
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		СчетНаОплату.Номенклатура КАК Номенклатура,
		               |		СчетНаОплату.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		               |		СчетНаОплату.ПроцентСкидкиСтроки КАК ПроцентСкидкиНаценки,
		               |		СчетНаОплату.Цена КАК Цена,
		               |		СУММА(СчетНаОплату.Количество) КАК Количество,
		               |		СУММА(СчетНаОплату.СуммаНДС) КАК СуммаНДС,
		               |		СчетНаОплату.ХарактеристикаНоменклатуры КАК Характеристика,
		               |		МИНИМУМ(СчетНаОплату.НомерСтроки) КАК НомерСтроки,
		               |		0 КАК Метка,
		               |		СчетНаОплату.СуммаВсего КАК Сумма
		               |	ИЗ
		               |		Документ.СчетНаОплату.Товары КАК СчетНаОплату
		               |	ГДЕ
		               |		СчетНаОплату.Ссылка = &ТекущийДокумент
		               |	
		               |	СГРУППИРОВАТЬ ПО
		               |		СчетНаОплату.Номенклатура,
		               |		СчетНаОплату.ЕдиницаИзмерения,
		               |		СчетНаОплату.ПроцентСкидкиСтроки,
		               |		СчетНаОплату.Цена,
		               |		СчетНаОплату.ХарактеристикаНоменклатуры,
		               |		СчетНаОплату.СуммаВсего) КАК ВложенныйЗапрос
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Метка,
		               |	НомерСтроки";
	
		Если ТипЗнч(СчетЗаказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.СчетНаОплатуПокупателю", "Документ.ЗаказПокупателя");
		КонецЕсли;
	ИначеЕсли ТипЗнч(СчетЗаказ) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
	    Запрос.Текст =  "ВЫБРАТЬ
	                    |	ДанныеЗаказНаряда.Работа КАК Номенклатура,
	                    |	ДанныеЗаказНаряда.Количество,
	                    |	ДанныеЗаказНаряда.Цена,
	                    |	ДанныеЗаказНаряда.СтавкаНДС,
	                    |	ДанныеЗаказНаряда.СуммаНДС,
	                    |	ДанныеЗаказНаряда.ПроцентСкидкиНаценки + ДанныеЗаказНаряда.ПроцентАвтоматическихСкидок КАК Скидка,
	                    |	ВЫРАЗИТЬ(ДанныеЗаказНаряда.Работа.НаименованиеПолное КАК СТРОКА(1000)) КАК НаименованиеПолное,
	                    |	ДанныеЗаказНаряда.Работа.Код КАК Код,
	                    |	ДанныеЗаказНаряда.Работа.Артикул КАК Артикул,
	                    |	ДанныеЗаказНаряда.Сумма
	                    |ИЗ
	                    |	Справочник.Renault_Advanced_ДанныеЗаказНаряда.Работы КАК ДанныеЗаказНаряда
	                    |ГДЕ
	                    |	ДанныеЗаказНаряда.Ссылка = &Ссылка
	                    |	И ДанныеЗаказНаряда.НомерСтроки = &НомерСтроки";
	Запрос.УстановитьПараметр("Ссылка", СправочникДанных);
	Запрос.УстановитьПараметр("НомерСтроки", 2);
	
КонецЕсли;

	ЗапросТовары = Запрос.Выполнить().Выгрузить();

	// Выводим шапку накладной

	ПараметрыПечати.Вставить("УчитыватьНДС", Шапка.УчитыватьНДС);
	//Если Тип = "Счет" Тогда
		ПараметрыПечати.Вставить("ИНН", Шапка.Организация.ИНН);
		ПараметрыПечати.Вставить("КПП", Шапка.Организация.КПП);
		ПредставлениеПоставщикаДляПлатПоручения = "";
		Если ТипЗнч(СчетЗаказ) = Тип("ДокументСсылка.ЗаказПокупателя") 
			ИЛИ ТипЗнч(СчетЗаказ) = Тип("ДокументСсылка.СчетНаОплату")Тогда 
			СтруктурнаяЕдиница = СчетЗаказ.Организация.ОсновнойБанковскийСчет;
		ИначеЕсли ТипЗнч(СчетЗаказ) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
			СтруктурнаяЕдиница = ?(ЗначениеЗаполнено(ЭтотОбъект.ЗаказНаряд.БанковскийСчетОрганизации),ЭтотОбъект.ЗаказНаряд.БанковскийСчетОрганизации, ЭтотОбъект.ЗаказНаряд.Организация.ОсновнойБанковскийСчет);
		КонецЕсли;
		
		Если ТипЗнч(СтруктурнаяЕдиница) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
			Банк       = СтруктурнаяЕдиница.Банк;
			БИК        = Банк.Код;
			КоррСчет   = Банк.КоррСчет;
			ГородБанка = Банк.Город;
			НомерСчета = СтруктурнаяЕдиница.НомерСчета;

			ПараметрыПечати.Вставить("БИКБанкаПолучателя", БИК);
			ПараметрыПечати.Вставить("БанкПолучателя", Банк);
			ПараметрыПечати.Вставить("БанкПолучателяПредставление", СокрЛП(Банк) + " " + ГородБанка);
			ПараметрыПечати.Вставить("СчетБанкаПолучателя", КоррСчет);
			ПараметрыПечати.Вставить("СчетБанкаПолучателяПредставление", КоррСчет);
			ПараметрыПечати.Вставить("СчетПолучателяПредставление", НомерСчета);
			ПараметрыПечати.Вставить("СчетПолучателя", НомерСчета);
		КонецЕсли;
		Если ПустаяСтрока(ПредставлениеПоставщикаДляПлатПоручения) Тогда
			ПредставлениеПоставщикаДляПлатПоручения = Шапка.Организация.НаименованиеПолное;
		КонецЕсли;
		ПараметрыПечати.Вставить("ПредставлениеПоставщикаДляПлатПоручения", ПредставлениеПоставщикаДляПлатПоручения);
	//КонецЕсли; 

	ПараметрыПечати.Вставить("ТекстЗаголовка", Renault_Advanced_ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, "Счет на оплату"));
	ПараметрыПечати.Вставить("ТекстПоставщик", "Поставщик:");
	
	ПредставлениеОрганизицииСтрока = Шапка.Организация.НаименованиеПолное + ", ИНН: " + Шапка.Организация.ИНН + ", КПП: " + Шапка.Организация.КПП + ", Адрес: " + Шапка.АдресОрганизация + ", Телефон: " + Шапка.ТелефонОрганизация;
	
	ПараметрыПечати.Вставить("ПредставлениеПоставщика", ПредставлениеОрганизицииСтрока);
	ПараметрыПечати.Вставить("ПредставлениеГрузоотправителя", ПредставлениеОрганизицииСтрока);
	
	ПредставлениеКонтрагентСтрока = Шапка.Получатель.НаименованиеПолное + ", ИНН: " + Шапка.Получатель.ИНН + ", КПП: " + Шапка.Получатель.КПП + ", Адрес: " + Шапка.АдресКонтрагент + ", Телефон: " + Шапка.ТелефонКонтрагент;
	ПараметрыПечати.Вставить("ТекстПокупатель", "Покупатель:");
	ПараметрыПечати.Вставить("ПредставлениеПолучателя", ПредставлениеКонтрагентСтрока);
	ПараметрыПечати.Вставить("ПредставлениеГрузополучателя", ПредставлениеКонтрагентСтрока);

	ПараметрыПечати.Вставить("ЕстьСкидки", Ложь);
	Для каждого ВыборкаСтрокТовары Из ЗапросТовары Цикл 
		Если ЗначениеЗаполнено(ВыборкаСтрокТовары.Скидка) Тогда
			ПараметрыПечати.ЕстьСкидки = Истина;
			Прервать;
		КонецЕсли; 
	КонецЦикла;

	//Шапка_АМ
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорХраненияКолес.ЗаказНаряд.Автомобиль.VIN КАК АМ_VIN,
	|	"+СформироватьСтрокуПоляЗапроса("МаркаМодель")+" КАК АМ_МаркаМодель,
	|	ДоговорХраненияКолес.СрокХранения,
	|	ДоговорХраненияКолес.СрокХраненияПросрочка,
	|	ДоговорХраненияКолес.Цена КАК ЦенаХранения,
	|	ДоговорХраненияКолес.Размер.Наименование КАК Радиус
	|ИЗ
	|	Документ.Renault_Advanced_ДоговорХраненияКолес КАК ДоговорХраненияКолес
	|ГДЕ
	|	ДоговорХраненияКолес.Ссылка = &ТекущийДокумент";
	Шапка_АМ = Запрос.Выполнить().Выбрать();
	Шапка_АМ.Следующий();
	ПараметрыПечати.Вставить("АМ_ГосНомер", Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Ссылка.ЗаказНаряд.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер, ТекущаяДата()));
	ПараметрыПечати.Вставить("АМ_VIN", Шапка_АМ.АМ_VIN);
	ПараметрыПечати.Вставить("АМ_МаркаМодель", Шапка_АМ.АМ_МаркаМодель);
	ПараметрыПечати.Вставить("СрокХранения", Шапка_АМ.СрокХранения);
	ПараметрыПечати.Вставить("СрокХраненияПросрочка", Шапка_АМ.СрокХраненияПросрочка);
	ПараметрыПечати.Вставить("ЦенаХранения", Шапка_АМ.ЦенаХранения);
	ПараметрыПечати.Вставить("Радиус", Шапка_АМ.Радиус);
	
	//ДопКолонка = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	ПараметрыПечати.Вставить("ВыводитьКоды", Ложь);
	//Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
	//	ПараметрыПечати.ВыводитьКоды = Истина;
	//	Колонка = "Артикул";
	//ИначеЕсли ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
	//	ПараметрыПечати.ВыводитьКоды = Истина;
	//	Колонка = "Код";
	//КонецЕсли;
	//
	//Если ПараметрыПечати.ВыводитьКоды Тогда
	//	ПараметрыПечати.Вставить("ИмяКолонкиКодов", Колонка);
	//КонецЕсли; //пока так, доделать

	тСумма    = 0;
	СуммаНДС = 0;
	ВсегоСкидок    = 0;
	ВсегоБезСкидок = 0;

	Для каждого ВыборкаСтрокТовары Из ЗапросТовары Цикл 
		
		ПараметрыПозиции = Новый Структура;

		ПараметрыПозиции.Вставить("Номенклатура", ВыборкаСтрокТовары.Номенклатура);
		ПараметрыПозиции.Вставить("НомерСтроки", ЗапросТовары.Индекс(ВыборкаСтрокТовары) + 1);

		//Если ПараметрыПечати.ВыводитьКоды Тогда
		//	Если Колонка = "Артикул" Тогда
		//		ПараметрыПозиции.Вставить("Артикул", ВыборкаСтрокТовары.Артикул);
		//	Иначе
		//		ПараметрыПозиции.Вставить("Артикул", ВыборкаСтрокТовары.Код);
		//	КонецЕсли;
		//КонецЕсли; пока так, доделать

		ПараметрыПозиции.Вставить("Количество", ВыборкаСтрокТовары.Количество);
		Если ТипЗнч(СчетЗаказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда 
			ПараметрыПозиции.Вставить("ЕдиницаИзмерения", ВыборкаСтрокТовары.ЕдиницаИзмерения);
		ИначеЕсли ТипЗнч(СчетЗаказ) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
			ПараметрыПозиции.Вставить("ЕдиницаИзмерения", "шт");
		КонецЕсли;

		
		ПараметрыПозиции.Вставить("Цена", ВыборкаСтрокТовары.Цена);
		Если ТипЗнч(СчетЗаказ) <> Тип("ДокументСсылка.ЗаказНаряд") Тогда  
			ПараметрыПозиции.Вставить("Товар", СокрП(ВыборкаСтрокТовары.НаименованиеПолное));
		Иначе
			ПараметрыПозиции.Вставить("Товар", СокрП(ВыборкаСтрокТовары.НаименованиеПолное));
		КонецЕсли;
	
		Скидка = Окр(ВыборкаСтрокТовары.Сумма * ВыборкаСтрокТовары.Скидка / (100 - ВыборкаСтрокТовары.Скидка), 2);

		Если ПараметрыПечати.ЕстьСкидки Тогда
			ПараметрыПозиции.Вставить("Скидка", Скидка);
			ПараметрыПозиции.Вставить("СуммаБезСкидки", ВыборкаСтрокТовары.Сумма + Скидка);
		КонецЕсли;

		ПараметрыПозиции.Вставить("Сумма", ВыборкаСтрокТовары.Сумма); 
		
		тСумма         = тСумма       + ВыборкаСтрокТовары.Сумма;
		СуммаНДС       = СуммаНДС    + ВыборкаСтрокТовары.СуммаНДС;
		ВсегоСкидок    = ВсегоСкидок + Скидка;
		ВсегоБезСкидок = тСумма       + ВсегоСкидок;
		//#Если ВнешнееСоединение Тогда
		//WEBПриложения.ПодготовитьСтруктуруДляВнешнегоСоединения(ПараметрыПозиции);
		//#КонецЕсли //пока так, доделать

		Позиции.Добавить(ПараметрыПозиции);

	КонецЦикла;
	
	ПараметрыПечати.Вставить("Позиции", Позиции);

	// Вывести Итого
	Если ПараметрыПечати.ЕстьСкидки Тогда
		ПараметрыПечати.Вставить("ВсегоСкидок", ВсегоСкидок);
		ПараметрыПечати.Вставить("ВсегоБезСкидок", ВсегоБезСкидок);
	КонецЕсли;
	ПараметрыПечати.Вставить("Всего", Renault_Advanced_ОбщегоНазначения.ФорматСумм(тСумма));

	// Вывести ИтогоНДС
	Если ПараметрыПечати.УчитыватьНДС Тогда
		ПараметрыПечати.Вставить("НДС", ?(Шапка.СуммаВключаетНДС, "В том числе НДС:", "Сумма НДС:"));
		ПараметрыПечати.Вставить("ВсегоНДС", Renault_Advanced_ОбщегоНазначения.ФорматСумм(ЗапросТовары.Итог("СуммаНДС")));
		ПараметрыПечати.Вставить("ВсегоКОплате", Renault_Advanced_ОбщегоНазначения.ФорматСумм(тСумма + ?(Шапка.СуммаВключаетНДС, 0, СуммаНДС)));
	КонецЕсли;

	// Вывести Сумму прописью
	СуммаКПрописи = тСумма + ?(Шапка.СуммаВключаетНДС, 0, СуммаНДС);
	ПараметрыПечати.Вставить("ИтоговаяСтрока", "Всего наименований " + ЗапросТовары.Количество()
	+ ", на сумму " + Renault_Advanced_ОбщегоНазначения.ФорматСумм(СуммаКПрописи, Шапка.ВалютаДокумента));
	ПараметрыПечати.Вставить("СуммаПрописью", Renault_Advanced_ОбщегоНазначения.СформироватьСуммуПрописью(СуммаКПрописи, Шапка.ВалютаДокумента));

	// Вывести подписи
	//Если Тип = "Счет" Тогда
		Руководители = дкОтветственноеЛицо(ЭтотОбъект.ЗаказНаряд.ПолучитьОбъект(), Перечисления.ВидыОбъектовСведений.Руководитель);
		Руководитель = Руководители.РуководительПредставление;
		ДолжностьРуководителя = Руководители.РуководительДолжность.Наименование;
		
		ГлБухгалтеры =  дкОтветственноеЛицо(ЭтотОбъект.ЗаказНаряд.ПолучитьОбъект(), Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер);
		Бухгалтер = ГлБухгалтеры.ГлавныйБухгалтерПредставление;
		//Руководители = Renault_Advanced_РегламентированнаяОтчетность.ОтветственныеЛицаОрганизации(Шапка.Руководители, Шапка.Дата,);
		//Руководитель = Руководители.Руководитель;
		//ДолжностьРуководителя = Руководители.РуководительДолжность;
		//Бухгалтер    = Руководители.ГлавныйБухгалтер;
		
		ПараметрыПечати.Вставить("ФИОРуководителя", 		Руководитель);
		ПараметрыПечати.Вставить("ДолжностьРуководителя", 	ДолжностьРуководителя);
		ПараметрыПечати.Вставить("ФИОБухгалтера", 			Бухгалтер);
		
		Ответственный = СчетЗаказ.Автор;
		Если НЕ ЗначениеЗаполнено(Ответственный.Сотрудник) Тогда
			ФИООтветственный = СокрЛП(Ответственный);  
		Иначе
			ФИООтветственный = Ответственный.Сотрудник;
		КонецЕсли;
		ПараметрыПечати.Вставить("ФИООтветственный", ФИООтветственный);

	//КонецЕсли; 
	
	//#Если ВнешнееСоединение Тогда
	//WEBПриложения.ПодготовитьСтруктуруДляВнешнегоСоединения(ПараметрыПечати);
	//#КонецЕсли пока так, доделать

	Возврат ПараметрыПечати;

КонецФункции //ПолучитьПараметрыПечатиСчетаЗаказа()

//!
Функция ПечатьБирок() Экспорт

	ТабДокумент                     = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Renault_Advanced_ДоговорХраненияКолес_Бирки";
	ТабДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
	Макет                           = ПолучитьМакет("Бирки");
	ОбластьБирки                    = Макет.ПолучитьОбласть("Строка|Столбец");

	ДатаПечати = РабочаяДата;

	ТекСтолбец = 0;
	ТекСтрока  = 0;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорХраненияКолес.Номер КАК НомерДокумента,
	|	ДоговорХраненияКолес.Дата КАК ДатаДокумента,
	|	ДоговорХраненияКолес.ЗаказНаряд.Номер КАК НомерЗаказНаряда,
	|	ДоговорХраненияКолес.ЗаказНаряд.Дата КАК ДатаЗаказНаряда,
	|	ДоговорХраненияКолес.ДатаВыдачи,
	|	ДоговорХраненияКолес.ЗаказНаряд.Организация.Наименование КАК ОрганизацияНаименование,
	|	ДоговорХраненияКолес.ЗаказНаряд.Автомобиль.VIN КАК АМ_VIN,
	|	ДоговорХраненияКолес.Размер.Наименование КАК Радиус,
	|	ДоговорХраненияКолес.Количество,
	|	Renault_Advanced_РеквизитыЗаказНаряда.РеквизитыДокумента.Плательщик КАК Контрагент,
	|	Renault_Advanced_РеквизитыЗаказНаряда.РеквизитыДокумента.Плательщик.НаименованиеПолное КАК Поклажедатель,
	|	"+СформироватьСтрокуПоляЗапроса("ИзделиеПредставление", Запрос)+" КАК ИзделиеПредставление,
	|	Автомобили.Значение КАК АМ_ГосНомер
	|ИЗ
	|	Документ.Renault_Advanced_ДоговорХраненияКолес КАК ДоговорХраненияКолес
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_Advanced_РеквизитыЗаказНаряда КАК Renault_Advanced_РеквизитыЗаказНаряда
	|		ПО ДоговорХраненияКолес.ЗаказНаряд = Renault_Advanced_РеквизитыЗаказНаряда.ЗаказНаряд
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили КАК Автомобили
	|		ПО ДоговорХраненияКолес.ЗаказНаряд.Автомобиль = Автомобили.Автомобиль
	|			И (Автомобили.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ГосНомер))
	|ГДЕ
	|	ДоговорХраненияКолес.Ссылка = &ТекущийДокумент";
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	Для Тмп = 1 По Количество Цикл
		ОбластьБирки.Параметры.Заполнить(Шапка);
		ОбластьБирки.Параметры.Поклажедатель = ВРег(Шапка.Поклажедатель);
		ОбластьБирки.Параметры.ДатаДокумента = Формат(Шапка.ДатаДокумента, "ДЛФ=D");
		ОбластьБирки.Параметры.ДатаВыдачи    = Формат(Шапка.ДатаВыдачи, "ДЛФ=D");
		ОбластьБирки.Параметры.ДатаЗаказНаряда = Формат(Шапка.ДатаЗаказНаряда, "ДЛФ=D");
		
		Если ТекСтолбец = 0 Тогда
			ТабДокумент.Вывести(ОбластьБирки);
		Иначе
			ТабДокумент.Присоединить(ОбластьБирки);
		КонецЕсли;
		
		ТекСтолбец = ТекСтолбец + 1;
		
		Если ТекСтолбец = 2 Тогда
			ТекСтрока  = ТекСтрока + 1;
			ТекСтолбец = 0;
		КонецЕсли;
		
		Если ТекСтрока = 2 Тогда
			ТекСтрока = 0;
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
	КонецЦикла;

	ТабДокумент.ТолькоПросмотр = Истина;

	Возврат ТабДокумент;

КонецФункции // ПечатьБирок()

//!
Функция ПечатьПрайсЛиста() Экспорт
	
	ЭтоЮрЛицо = Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо;
	
	ТабДок = Новый ТабличныйДокумент;
	// Зададим параметры макета
	ТабДок.ПолеСверху              = 0;
	ТабДок.ПолеСлева               = 5;
	ТабДок.ПолеСнизу               = 0;
	ТабДок.ПолеСправа              = 5;
	ТабДок.АвтоМасштаб             = Истина;
	ТабДок.ОриентацияСтраницы      = ОриентацияСтраницы.Портрет;
	
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Renault_Advanced_ДоговорХраненияКолес_ПрайсЛистХранителя";

	Макет = ПолучитьМакет("ПрайсЛистХранителя");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорХраненияКолес.Номер КАК НомерДокумента,
	|	ДоговорХраненияКолес.Дата КАК ДатаДокумента,
	|	ДоговорХраненияКолес.ЗаказНаряд.Организация КАК Организация,
	|	ДоговорХраненияКолес.ЗаказНаряд.Организация.ОсновнойБанковскийСчет КАК БанковскийСчет,
	|	Renault_Advanced_РеквизитыЗаказНаряда.РеквизитыДокумента.Плательщик КАК Контрагент
	|ИЗ
	|	Документ.Renault_Advanced_ДоговорХраненияКолес КАК ДоговорХраненияКолес
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_Advanced_РеквизитыЗаказНаряда КАК Renault_Advanced_РеквизитыЗаказНаряда
	|		ПО ДоговорХраненияКолес.ЗаказНаряд = Renault_Advanced_РеквизитыЗаказНаряда.ЗаказНаряд
	|ГДЕ
	|	ДоговорХраненияКолес.Ссылка = &ТекущийДокумент";
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	// Заголовок
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	
	// Выводим общие реквизиты шапки
	Запрос	= Новый Запрос;
	Запрос.Текст	= 		
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.НаименованиеПолное,
	|	Контрагенты.КодПоОКПО,
	|	Контрагенты.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчета,
	|	Контрагенты.ОсновнойБанковскийСчет.Банк.Наименование КАК Банк,
	|	Контрагенты.ОсновнойБанковскийСчет.Банк.КоррСчет КАК КоррСчет,
	|	Контрагенты.ОсновнойБанковскийСчет.Банк.Код КАК БИК
	|ПОМЕСТИТЬ КонтрагентИнфа
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Контрагенты).Ссылка
	|	КОНЕЦ КАК Контрагент,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Телефон)
	|				ТОГДА КонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Телефон,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|					И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.АдресФактический)
	|				ТОГДА КонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК АдресФактический,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|					И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.АдресЮридический)
	|				ТОГДА КонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК АдресЮридический
	|ПОМЕСТИТЬ КонтИнфа
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Контрагент
	|	И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Телефон)
	|				И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.ТелефонКонтактный)
	|			ИЛИ КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|				И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.АдресФактический)
	|			ИЛИ КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|				И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.АдресЮридический))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Контрагенты).Ссылка
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодтверждающиеДокументы.Серия,
	|	ПодтверждающиеДокументы.Номер,
	|	ПодтверждающиеДокументы.ДатаВыдачи,
	|	ПодтверждающиеДокументы.КемВыдан,
	|	ПодтверждающиеДокументы.Владелец КАК Контрагент
	|ПОМЕСТИТЬ ДокументКонтрагента
	|ИЗ
	|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|ГДЕ
	|	ПодтверждающиеДокументы.Владелец = &Контрагент
	|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Паспорт)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтрагентИнфа.ИНН,
	|	КонтрагентИнфа.КПП,
	|	КонтрагентИнфа.НаименованиеПолное КАК ПолноеНаименование,
	|	КонтИнфа.Телефон,
	|	КонтИнфа.АдресФактический КАК АдресФактический,
	|	КонтИнфа.АдресЮридический КАК АдресЮридический,
	|	ДокументКонтрагента.Серия КАК ДокументСерия,
	|	ДокументКонтрагента.Номер КАК ДокументНомер,
	|	ДокументКонтрагента.ДатаВыдачи КАК ДокументДатаВыдачи,
	|	ДокументКонтрагента.КемВыдан КАК ДокументКемВыдан,
	|	КонтрагентИнфа.КодПоОКПО,
	|	КонтрагентИнфа.НомерСчета,
	|	КонтрагентИнфа.Банк,
	|	КонтрагентИнфа.КоррСчет,
	|	КонтрагентИнфа.БИК
	|ИЗ
	|	КонтрагентИнфа КАК КонтрагентИнфа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументКонтрагента КАК ДокументКонтрагента
	|		ПО КонтрагентИнфа.Контрагент = ДокументКонтрагента.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтИнфа КАК КонтИнфа
	|		ПО КонтрагентИнфа.Контрагент = КонтИнфа.Контрагент";
	                                                      
	Запрос.УстановитьПараметр("Контрагент", Шапка.Контрагент);
	Результат =  Запрос.Выполнить();
	СведенияОКонтрагенте = Результат.Выбрать();
	СведенияОКонтрагенте.Следующий();
		
	Запрос	= Новый Запрос;
	Запрос.Текст	= 		
	"ВЫБРАТЬ
	|	Организации.НаименованиеПолное,
	|	Организации.Ссылка КАК Организация,
	|	Организации.ИНН,
	|	Организации.КПП,
	|	Организации.ОГРН,
	|	Организации.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчета,
	|	Организации.ОсновнойБанковскийСчет.Банк.Наименование КАК БанкНаименование,
	|	Организации.ОсновнойБанковскийСчет.Банк.КоррСчет КАК КоррСчет,
	|	Организации.ОсновнойБанковскийСчет.Банк.Код КАК БИК,
	|	Организации.КодПоОКПО,
	|	Организации.Наименование
	|ПОМЕСТИТЬ ОрганизацияИнформация
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Организации
	|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Организации).Ссылка
	|	КОНЕЦ КАК Организация,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Телефон)
	|				ТОГДА КонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Телефон,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|				ТОГДА КонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Адрес
	|ПОМЕСТИТЬ ОргКонт
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Организация
	|	И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Телефон)
	|				И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.ТелефонРабочий)
	|			ИЛИ КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|				И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.АдресЮридический))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Организации
	|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Организации).Ссылка
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацияИнформация.НаименованиеПолное КАК ПолноеНаименование,
	|	ОрганизацияИнформация.ИНН КАК ИНН,
	|	ОрганизацияИнформация.КПП КАК КПП,
	|	ОрганизацияИнформация.ОГРН КАК ОГРН,
	|	ОрганизацияИнформация.НомерСчета КАК НомерСчета,
	|	ОрганизацияИнформация.БанкНаименование КАК Банк,
	|	ОрганизацияИнформация.КоррСчет КАК КоррСчет,
	|	ОрганизацияИнформация.БИК КАК БИК,
	|	ОргКонт.Телефон КАК Телефон,
	|	ОргКонт.Адрес КАК АдресЮридический,
	|	ОрганизацияИнформация.КодПоОКПО КАК КодПоОКПО,
	|	ОрганизацияИнформация.Наименование
	|ИЗ
	|	ОрганизацияИнформация КАК ОрганизацияИнформация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОргКонт КАК ОргКонт
	|		ПО ОрганизацияИнформация.Организация = ОргКонт.Организация";
	
	Запрос.УстановитьПараметр("Организация", Шапка.Организация);
	Результат = Запрос.Выполнить();
	СведенияООрганизации = Результат.Выбрать();		
	СведенияООрганизации.Следующий(); 
	
	Руководители = дкОтветственноеЛицо(ЭтотОбъект.ЗаказНаряд.ПолучитьОбъект(), Перечисления.ВидыОбъектовСведений.Руководитель);
	Руководитель = Руководители.РуководительПредставление;	
	
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ДатаДокумента  = Формат(Шапка.ДатаДокумента, "ДФ=""дд ММММ гггг""");
	ТабДок.Вывести(ОбластьМакета);
	
	Если ЭтоЮрЛицо Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи_ЮЛ");
		ОбластьМакета.Параметры.Контрагент = ВРег(СведенияОКонтрагенте.ПолноеНаименование);
		ОбластьМакета.Параметры.ИННКонтрагента = СведенияОКонтрагенте.ИНН;
		ОбластьМакета.Параметры.КППКонтрагента = СведенияОКонтрагенте.КПП;
		ОбластьМакета.Параметры.КодПоОКПОКонтрагента = СведенияОКонтрагенте.КодПоОКПО;
		ОбластьМакета.Параметры.БанкКонтрагента = СведенияОКонтрагенте.Банк;
		ОбластьМакета.Параметры.БИККонтрагента = СведенияОКонтрагенте.БИК;
		ОбластьМакета.Параметры.КоррСчетКонтрагента = СведенияОКонтрагенте.КоррСчет;
		ОбластьМакета.Параметры.НомерСчетаКонтрагента = СведенияОКонтрагенте.НомерСчета;
		//ОбластьМакета.Параметры.ОГРНКонтрагента = Шапка.Контрагент.ОГРН;
	Иначе	
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи_ФЛ");
		ОбластьМакета.Параметры.Покупатель_ФИО_Полностью = ВРег(СведенияОКонтрагенте.ПолноеНаименование);
		ОбластьМакета.Параметры.ФактическийАдресКонтрагента = СведенияОКонтрагенте.АдресФактический;
		ОбластьМакета.Параметры.пасп_сер   = СведенияОКонтрагенте.ДокументСерия;
		ОбластьМакета.Параметры.пасп_ном   = СведенияОКонтрагенте.ДокументНомер;
		ОбластьМакета.Параметры.КогдаВыдан = ?(ЗначениеЗаполнено(СведенияОКонтрагенте.ДокументДатаВыдачи), Формат(СведенияОКонтрагенте.ДокументДатаВыдачи, "ДЛФ=D"), "Нет даты года");
		ОбластьМакета.Параметры.КемВыдан   = СведенияОКонтрагенте.ДокументКемВыдан;
	КонецЕсли;
	ОбластьМакета.Параметры.ТелефоныКонтрагента = СведенияОКонтрагенте.Телефон;
	ОбластьМакета.Параметры.ЮридическийАдресКонтрагента = СведенияОКонтрагенте.АдресЮридический;
	
	ОбластьМакета.Параметры.ПолноеНаименованиеОрганизации = СведенияООрганизации.ПолноеНаименование;
	ОбластьМакета.Параметры.ИНН = СведенияООрганизации.ИНН;
	ОбластьМакета.Параметры.КПП = СведенияООрганизации.КПП;
	ОбластьМакета.Параметры.ЮридическийАдрес = СведенияООрганизации.АдресЮридический;
	ОбластьМакета.Параметры.НомерСчета = СведенияООрганизации.НомерСчета;
	ОбластьМакета.Параметры.Банк = СведенияООрганизации.Банк;
	ОбластьМакета.Параметры.КоррСчет = СведенияООрганизации.КоррСчет;
	ОбластьМакета.Параметры.БИК = СведенияООрганизации.БИК;
	ОбластьМакета.Параметры.КодПоОКПО = СведенияООрганизации.КодПоОКПО;
	ОбластьМакета.Параметры.Телефоны = СведенияООрганизации.Телефон;
	ОбластьМакета.Параметры.ОГРН = СведенияООрганизации.ОГРН;
	ОбластьМакета.Параметры.ФИОРуководителя = ВРег(Руководитель); 	

    ТабДок.Вывести(ОбластьМакета);

	Возврат ТабДок;
КонецФункции		 

//!
Функция ПечатьСчетФактуры() Экспорт

	ТабДокумент = Новый ТабличныйДокумент;
	
	////Найдем РТУ по З/н
	//СправочникДанных = Renault_AdvancedСервер.ПолучитьСправочникДанныхЗаказНаряда(ЗаказНаряд);
	//СправочникДанныхОбъект = СправочникДанных.ПолучитьОбъект();

	//обЗН = ЗаказНаряд.ПолучитьОбъект();
	//РТУ = СправочникДанныхОбъект.ПолучитьСсылкуНаРТиУ();
	//
	//Если Не ЗначениеЗаполнено(РТУ) Тогда
	//	Возврат Неопределено;
	//КонецЕсли;
	//СчетФактура = Renault_Advanced_УчетНДС.НайтиПодчиненныйДокумент(РТУ, "СчетФактураВыданный");
	СчетФактура = Renault_Advanced_УчетНДС.НайтиПодчиненныйДокумент(ЗаказНаряд, "СчетФактураВыданный");
	Если Не ЗначениеЗаполнено(СчетФактура) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТабДокумент = Новый ТабличныйДокумент;
	СчетФактураОбъект = СчетФактура.ПолучитьОбъект();
	СчетФактураОбъект.ПечатьСчетФактура(ТабДокумент);
	
	Возврат ТабДокумент; 	
КонецФункции // ()

// Функция собирает данные по документу основанию реализации и возвращает типизированную 
// структуру с данными
// 
Функция СобратьДанныеПоРеализацияТоваровУслуг(ДокОснование, СчетФактура)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокОснование);
	Запрос.УстановитьПараметр("ПустойКонтрагент",  Справочники.Контрагенты.ПустаяСсылка());

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Организация,
	|	Организация                       КАК Поставщик,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(Грузоотправитель, &ПустойКонтрагент) = &ПустойКонтрагент
	|			ТОГДА ""он же"" 
	|		ИНАЧЕ Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	Подразделение                     КАК Подразделение,
	|	Контрагент                        КАК Покупатель,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(Грузополучатель, &ПустойКонтрагент) = &ПустойКонтрагент
	|			ТОГДА Контрагент 
	|		ИНАЧЕ Грузополучатель 
	|	КОНЕЦ КАК Грузополучатель,
	|	СуммаДокумента                    КАК Сумма,
	|	ВалютаДокумента                   КАК Валюта,
	|	УчитыватьНДС                      КАК УчитыватьНДС,
	|	СуммаВключаетНДС                  КАК СуммаВключаетНДС
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &ДокументОснование";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокОснование);
	Запрос.УстановитьПараметр("ПустаяЕдиница", Справочники.ЕдиницыИзмерения.ПустаяСсылка());
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Номенклатура КАК Товар,
	               |	ВЫРАЗИТЬ(РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное КАК СТРОКА(200)) КАК ТоварНаименование,
	               |	РеализацияТоваровУслугТовары.СерияНоменклатуры.СтранаПроисхождения КАК СтранаПроисхождения,
	               |	РеализацияТоваровУслугТовары.СерияНоменклатуры.СтранаПроисхождения.НаименованиеПолное КАК ПредставлениеСтраны,
	               |	РеализацияТоваровУслугТовары.СерияНоменклатуры.НомерГТД КАК НомерГТД,
	               |	РеализацияТоваровУслугТовары.СерияНоменклатуры.НомерГТД.Представление КАК ПредставлениеГТД,
	               |	РеализацияТоваровУслугТовары.ЕдиницаИзмерения.Представление КАК ЕдиницаИзмерения,
	               |	РеализацияТоваровУслугТовары.Количество КАК Количество,
	               |	РеализацияТоваровУслугТовары.Цена КАК Цена,
	               |	РеализацияТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
	               |	РеализацияТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
	               |	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
	               |	РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	               |	РеализацияТоваровУслугТовары.СерияНоменклатуры КАК Серия,
	               |	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
	               |	1 КАК НомерТЧ,
	               |	РеализацияТоваровУслугТовары.СерияНоменклатуры.СтранаПроисхождения.Код КАК СтранаПроисхожденияКод,
	               |	РеализацияТоваровУслугТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Ссылка = &ДокументОснование
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугУслуги.Номенклатура,
	               |	РеализацияТоваровУслугУслуги.Содержание,
	               |	"""",
	               |	NULL,
	               |	NULL,
	               |	"""",
	               |	РеализацияТоваровУслугУслуги.Номенклатура.ЕдиницаХраненияОстатков.Представление,
	               |	ВЫБОР
	               |		КОГДА РеализацияТоваровУслугУслуги.Номенклатура.ЕдиницаХраненияОстатков = &ПустаяЕдиница
	               |			ТОГДА 0
	               |		ИНАЧЕ РеализацияТоваровУслугУслуги.Количество
	               |	КОНЕЦ,
	               |	РеализацияТоваровУслугУслуги.Цена,
	               |	РеализацияТоваровУслугУслуги.СтавкаНДС,
	               |	РеализацияТоваровУслугУслуги.СуммаНДС,
	               |	РеализацияТоваровУслугУслуги.Сумма,
	               |	NULL,
	               |	NULL,
	               |	РеализацияТоваровУслугУслуги.НомерСтроки,
	               |	2,
	               |	NULL,
	               |	РеализацияТоваровУслугУслуги.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору.Код
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка = &ДокументОснование
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерТЧ,
	               |	НомерСтроки";
	
	
	ВыборкаСтрокТовары = Запрос.Выполнить().Выбрать();

	ДанныеДляПечати = Новый Структура();
	ДанныеДляПечати.Вставить("Организация",      Шапка.Организация);
	ДанныеДляПечати.Вставить("Номер",            СчетФактура.Номер);
	ДанныеДляПечати.Вставить("Дата",             СчетФактура.Дата);
	ДанныеДляПечати.Вставить("НомерПРД",         СчетФактура.НомерПлатежноРасчетногоДокумента);
	ДанныеДляПечати.Вставить("ДатаПРД",          СчетФактура.ДатаПлатежноРасчетногоДокумента);
	ДанныеДляПечати.Вставить("Поставщик",        Шапка.Поставщик);
	ДанныеДляПечати.Вставить("Грузоотправитель", Шапка.Грузоотправитель);
	ДанныеДляПечати.Вставить("Подразделение",    Шапка.Подразделение);
	ДанныеДляПечати.Вставить("Покупатель",       Шапка.Покупатель);
	ДанныеДляПечати.Вставить("Грузополучатель",  Шапка.Грузополучатель);
	ДанныеДляПечати.Вставить("Сумма",            Шапка.Сумма);
	ДанныеДляПечати.Вставить("Валюта",           Шапка.Валюта);
	ДанныеДляПечати.Вставить("УчитыватьНДС",     Шапка.УчитыватьНДС);

	Руководители = Renault_Advanced_РегламентированнаяОтчетность.ОтветственныеЛицаОрганизации(Шапка.Организация, Дата,);
	ДанныеДляПечати.Вставить("ФИОРуководителя", Руководители.Руководитель);
	ДанныеДляПечати.Вставить("ФИОГлавногоБухгалтера", Руководители.ГлавныйБухгалтер);

	Товары = ИнициализацияТаблицыСтрок();

	Пока ВыборкаСтрокТовары.Следующий() = 1 Цикл
		Строчка = Товары.Добавить();
		Строчка.Товар               = ВыборкаСтрокТовары.Товар;
		Строчка.ТоварНаименование   = "Сезонное хранение 1месяц, 1комплект "+ Размер.ПосадочныйДиаметр;
		Строчка.СтранаПроисхождения = ВыборкаСтрокТовары.СтранаПроисхождения;
		Строчка.СтранаПроисхожденияКод = ВыборкаСтрокТовары.СтранаПроисхожденияКод;
		Строчка.ПредставлениеСтраны = ?(Не ЗначениеЗаполнено(ВыборкаСтрокТовары.ПредставлениеСтраны), ВыборкаСтрокТовары.СтранаПроисхождения, ВыборкаСтрокТовары.ПредставлениеСтраны);
		Строчка.НомерГТД            = ВыборкаСтрокТовары.НомерГТД;
		Строчка.ПредставлениеГТД    = ВыборкаСтрокТовары.ПредставлениеГТД;
		Строчка.Количество          = СрокХранения;
		Строчка.ЕдиницаИзмерения    = ВыборкаСтрокТовары.ЕдиницаИзмерения;
		Строчка.ЕдиницаИзмеренияКод = ВыборкаСтрокТовары.ЕдиницаИзмеренияКод;
		Строчка.СуммаВключаетНДС	= Шапка.СуммаВключаетНДС;
		Строчка.Цена                = ?(СрокХранения = 0, 0, (ВыборкаСтрокТовары.Сумма - ?(Шапка.СуммаВключаетНДС, ВыборкаСтрокТовары.СуммаНДС, 0)) / СрокХранения);
		Строчка.СтавкаНДС           = ?(Шапка.УчитыватьНДС, ВыборкаСтрокТовары.СтавкаНДС, Перечисления.СтавкиНДС.БезНДС);
		Строчка.СуммаНДС            = ВыборкаСтрокТовары.СуммаНДС;
		Строчка.Сумма               = ВыборкаСтрокТовары.Сумма;
	КонецЦикла;

	ДанныеДляПечати.Вставить("ТабличнаяЧасть", Товары);

	Возврат ДанныеДляПечати;

КонецФункции // СобратьДанныеПоРеализацияТоваровУслуг()

//!
Функция ИнициализацияТаблицыСтрок()

	Товары = Новый ТаблицаЗначений();

	Товары.Колонки.Добавить("Товар");
	Товары.Колонки.Добавить("ТоварНаименование");
	Товары.Колонки.Добавить("СтранаПроисхождения");
	Товары.Колонки.Добавить("СтранаПроисхожденияКод");
	Товары.Колонки.Добавить("ПредставлениеСтраны");
	Товары.Колонки.Добавить("НомерГТД");
	Товары.Колонки.Добавить("ПредставлениеГТД");
	Товары.Колонки.Добавить("Количество");
	Товары.Колонки.Добавить("ЕдиницаИзмерения");
	Товары.Колонки.Добавить("ЕдиницаИзмеренияКод");
	Товары.Колонки.Добавить("СуммаВключаетНДС");
	Товары.Колонки.Добавить("Цена");
	Товары.Колонки.Добавить("СтавкаНДС");
	Товары.Колонки.Добавить("СуммаНДС");
	Товары.Колонки.Добавить("Сумма");

	Возврат Товары;

КонецФункции

//!
Функция СформироватьСтрокуПоляЗапроса(Вариант, Запрос = Неопределено)
	
	Если Вариант = "ИзделиеПредставление" Тогда
		Если Запрос = Неопределено Тогда
			Возврат """";	
		КонецЕсли;
		Запрос.УстановитьПараметр("ДискШирина", ""+ДискШирина);
		Запрос.УстановитьПараметр("ДискВылет_ДискДиаметр", ?(ДискВылет=0 И ДискДиаметр = 0, ""," ET" + ДискВылет +?(ДискДиаметр = 0, "", " "+ДискДиаметр)));

		Возврат "	ВЫБОР
				|		КОГДА ДоговорХраненияКолес.Автопокрышки
				|				ИЛИ ДоговорХраненияКолес.КолесаВСборе
				|			ТОГДА ВЫБОР
				|					КОГДА ДоговорХраненияКолес.Автопокрышки
				|						ТОГДА ""Шина ""
				|					ИНАЧЕ ""Колесо в сборе ""
				|				КОНЕЦ + ДоговорХраненияКолес.Габариты + "" "" + ДоговорХраненияКолес.ИндексНагрузки.Наименование + "" "" + ДоговорХраненияКолес.ИндексСкорости.Наименование + "" "" + ДоговорХраненияКолес.ШинаПроизводитель.Наименование + "" "" + ДоговорХраненияКолес.ТипПокрышки.Наименование
				|		КОГДА ДоговорХраненияКолес.ТолькоДиски
				|			ТОГДА ""Диск"" + "" "" + &ДискШирина + ""*"" + ДоговорХраненияКолес.Размер.Наименование + ВЫБОР
				|					КОГДА ДоговорХраненияКолес.ДискПосадочныйРазмер = ЗНАЧЕНИЕ(Справочник.Renault_Advanced_ПосадочныеРазмерыДисков.ПустаяСсылка)
				|						ТОГДА """"
				|					ИНАЧЕ "" "" + ДоговорХраненияКолес.ДискПосадочныйРазмер.Наименование
				|				КОНЕЦ + &ДискВылет_ДискДиаметр + ВЫБОР
				|					КОГДА ДоговорХраненияКолес.ДискПроизводитель = ЗНАЧЕНИЕ(Справочник.Renault_Advanced_ПроизводителиДисков.ПустаяСсылка)
				|						ТОГДА """"
				|					КОГДА ДоговорХраненияКолес.ДискМодель = ЗНАЧЕНИЕ(Справочник.Renault_Advanced_МоделиДисков.ПустаяСсылка)
				|						ТОГДА "" "" + ДоговорХраненияКолес.ДискПроизводитель.Наименование
				|					ИНАЧЕ "" "" + ДоговорХраненияКолес.ДискПроизводитель.Наименование + "" "" + ДоговорХраненияКолес.ДискМодель.Наименование
				|				КОНЕЦ
				|		ИНАЧЕ """"
				|	КОНЕЦ";
		
	ИначеЕсли Вариант = "МаркаМодель" Тогда
		Возврат "	ВЫБОР
				|		КОГДА ДоговорХраненияКолес.ЗаказНаряд.Автомобиль.Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяССылка)
				|			ТОГДА """"
				|		КОГДА ДоговорХраненияКолес.ЗаказНаряд.Автомобиль.Модель.Производитель = ЗНАЧЕНИЕ(Справочник.Производители.ПустаяССылка)
				|			ТОГДА ДоговорХраненияКолес.ЗаказНаряд.Автомобиль.Модель.Наименование
				|		ИНАЧЕ ДоговорХраненияКолес.ЗаказНаряд.Автомобиль.Модель.Производитель.Наименование + "" "" + ДоговорХраненияКолес.ЗаказНаряд.Автомобиль.Модель.Наименование
				|	КОНЕЦ";		
	КонецЕсли;

КонецФункции

//!
Функция ПечатьПикингЛист() Экспорт
	
	ТабДокумент                     = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Renault_Advanced_ДоговорХраненияКолес_ПикингЛист";
	ТабДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
	Макет                           = ПолучитьМакет("ПикингЛист");

	ДатаПечати = РабочаяДата;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорХраненияКолес.Количество,
		|	ДоговорХраненияКолес.ЗаказНаряд.Номер КАК НомерЗаказНаряда,
		|	ДоговорХраненияКолес.ЗаказНаряд.Дата КАК ДатаЗаказНаряда,
		|	ДоговорХраненияКолес.Контейнер,
		|	ДоговорХраненияКолес.Стеллаж,
		|	ДоговорХраненияКолес.Полка,
		|	ДоговорХраненияКолес.Ряд,
		|	ДоговорХраненияКолес.Номер КАК НомерДокументаВнутренний,
		|	ДоговорХраненияКолес.ЗаказНаряд.ПодразделениеКомпании КАК Затребовал,
		|	ДоговорХраненияКолес.ЗаказНаряд.Автомобиль.VIN КАК VIN,
		|	Renault_Advanced_РеквизитыЗаказНаряда.РеквизитыДокумента.Автоуслуга.Артикул КАК Артикул,
		|	Renault_Advanced_РеквизитыЗаказНаряда.РеквизитыДокумента.Плательщик.НаименованиеПолное КАК Клиент,
		|	Автомобили.Значение КАК ГосНомер,
		|	"+СформироватьСтрокуПоляЗапроса("ИзделиеПредставление", Запрос)+" КАК Наименование
		|	ПОМЕСТИТЬ ДанныеДляЗаполнения 
		|ИЗ
		|	Документ.Renault_Advanced_ДоговорХраненияКолес КАК ДоговорХраненияКолес
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_Advanced_РеквизитыЗаказНаряда КАК Renault_Advanced_РеквизитыЗаказНаряда
		|		ПО ДоговорХраненияКолес.ЗаказНаряд = Renault_Advanced_РеквизитыЗаказНаряда.ЗаказНаряд
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили КАК Автомобили
		|		ПО ДоговорХраненияКолес.ЗаказНаряд.Автомобиль = Автомобили.Автомобиль
		|			И (Автомобили.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ГосНомер))
		|ГДЕ
		|	ДоговорХраненияКолес.Ссылка = &ТекущийДокумент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеДХК.ДатаЗаказНаряда,
		|	ДанныеДХК.НомерДокументаВнутренний,
		|	ДанныеДХК.НомерЗаказНаряда,
		|	ДанныеДХК.Затребовал,
		|	ДанныеДХК.Клиент,
		|	ДанныеДХК.VIN,
		|	ДанныеДХК.ГосНомер,
		|	ПОДСТРОКА(ДанныеДХК.Артикул, 0, 1) КАК Ref1,
		|	ПОДСТРОКА(ДанныеДХК.Артикул, 1, 1) КАК Ref2,
		|	ПОДСТРОКА(ДанныеДХК.Артикул, 2, 1) КАК Ref3,
		|	ПОДСТРОКА(ДанныеДХК.Артикул, 3, 1) КАК Ref4,
		|	ПОДСТРОКА(ДанныеДХК.Артикул, 4, 1) КАК Ref5,
		|	ПОДСТРОКА(ДанныеДХК.Артикул, 5, 1) КАК Ref6,
		|	ПОДСТРОКА(ДанныеДХК.Артикул, 6, 1) КАК Ref7,
		|	ПОДСТРОКА(ДанныеДХК.Артикул, 7, 1) КАК Ref8,
		|	ПОДСТРОКА(ДанныеДХК.Артикул, 8, 1) КАК Ref9,
		|	ПОДСТРОКА(ДанныеДХК.Артикул, 9, 1) КАК Ref10,
		|	ПОДСТРОКА(ДанныеДХК.Артикул, 10, 1) КАК Ref11,
		|	ДанныеДХК.Контейнер,
		|	ДанныеДХК.Стеллаж,
		|	ДанныеДХК.Полка,
		|	ДанныеДХК.Ряд,
		|	ДанныеДХК.Количество,
		|	ДанныеДХК.Наименование
		|ИЗ
		|	ДанныеДляЗаполнения КАК ДанныеДХК";

	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ДатаПечати = Формат(ДатаПечати, "ДЛФ=D");
	ОбластьМакета.Параметры.Склад = "" + Формат(Шапка.Контейнер, "ЧЦ=2; ЧВН=") + "-" 
	                                   + Формат(Шапка.Стеллаж, "ЧЦ=2; ЧВН=") + " " 
									   + Формат(Шапка.Полка, "ЧЦ=2; ЧВН=") + " " 
									   + Формат(Шапка.Ряд, "ЧЦ=2; ЧВН=");
	ТабДокумент.Вывести(ОбластьМакета);
	ТабДокумент.ТолькоПросмотр = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьПикингЛист()

//! Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
	КонецЕсли;

	Если Не Renault_Advanced_РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	// Получить экземпляр документа на печать
	Если ИмяМакета = "ДляСклада" Тогда
		ТабДокумент = ПечатьДляСклада("");
	ИначеЕсли ИмяМакета = "ДоговорХранения" Тогда
		ТабДокумент = ПечатьДХ();
	ИначеЕсли ИмяМакета = "СчетЗаказ" 
		Или ИмяМакета = "СчетЗаказДоплата" Тогда
		ТабДокумент = ПечатьСчета(ИмяМакета);
	ИначеЕсли ИмяМакета = "Бирки" Тогда
		ТабДокумент = ПечатьБирок();
	ИначеЕсли ИмяМакета = "ПрайсЛистХранителя" Тогда
		ТабДокумент = ПечатьПрайсЛиста();
	ИначеЕсли ИмяМакета = "СчетФактура" Тогда
		ТабДокумент = ПечатьСчетФактуры();
	ИначеЕсли ИмяМакета = "ПикингЛист" Тогда
		ТабДокумент = ПечатьПикингЛист();
	ИначеЕсли ИмяМакета = "ПечатьактаПриемаКолес" Тогда
		ТабДокумент = ПечатьАктаПриемаКолес("",  , Ложь);
	ИначеЕсли ИмяМакета = "АктВозврата" 
		Или ИмяМакета = "АктБезПросрочки"
		Тогда
		Если НЕ ЗначениеЗаполнено(ДатаВыдачиФакт) Тогда
			Сообщить("Акт возврата РТИ можно распечатать только после выдачи");
			Возврат;
		КонецЕсли;
		ТабДокумент = ПечатьАктаПриемаКолес("",  , Истина, ИмяМакета = "АктБезПросрочки");
	//ИначеЕсли ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда
	//	
	//	ТабДокумент = Renault_Advanced_УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);
	//	
	//	Если ТабДокумент = Неопределено Тогда
	//		Возврат
	//	КонецЕсли;  пока так, доделать
		
	КонецЕсли;

	//Renault_Advanced_УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, Renault_Advanced_ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);

	//СохранитьЗначение(СокрЛП(ЭтотОбъект.Метаданные().Имя) + "ПечатнаяФорма", ИмяМакета);
	
	//дкПечать(ЭтотОбъект, "АктБезПросрочки", 1, Ложь);
	
	Если ТабДокумент <> Неопределено Тогда 	
		КлючУникальности = Строка(ТекущаяДата()); //уникальность открытых форм будем определять по тек. времени ...
		ПечатнаяФорма = ПолучитьОбщуюФорму("ПечатнаяФормаДокументов", , КлючУникальности);
		Пока ПечатнаяФорма.Открыта() Цикл
			КлючУникальности = КлючУникальности + "0"; //... а если в одну секунду открыли, степень уникальности повысим
			ПечатнаяФорма = ПолучитьОбщуюФорму("ПечатнаяФормаДокументов", , КлючУникальности);
		КонецЦикла;  
		
		ПечатнаяФорма.Объект = Неопределено;
		ПечатнаяФорма.ОбъектПредставление = Строка(ЭтотОбъект.Ссылка);
		ПечатнаяФорма.ЭлементыФормы.ТабличныйДокумент.Вывести(ТабДокумент);
		ПечатнаяФорма.Открыть();
	КонецЕсли;

КонецПроцедуры // Печать

//! Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт 
	СправочникДанных = Renault_AdvancedСервер.ПолучитьСправочникДанныхЗаказНаряда(ЗаказНаряд);
////////////////////
//СтруктураПечатныхФорм = Новый Структура("ПечатьактаПриемаКолес, 
//											|Бирки,
//											|ДоговорХранения,
//											|ПрайсЛистХранителя,
//											|СчетЗаказ,
//											
//											|АктБезПросрочки,														
//											|СчетЗаказДоплата,
//											|СчетФактура,
//											|ПикингЛист,
//											
//											|АктВозврата",
//											"ПечатьактаПриемаКолес",
//	                                        "Бирки",
//											"Договор хранения",
//											"Прайс-лист хранителя",
//											"СчетЗаказ",
//											"АктБезПросрочки",
//											"СчетЗаказДоплата",
//											"СчетФактура",
//											"ПикингЛист",
//											"АктВозврата");
//Возврат СтруктураПечатныхФорм;  //для отладки
/////////////
	Если НЕ Проведен Тогда
		 СтруктураПечатныхФорм = Новый Структура;
	Иначе
		 Если НЕ ЗначениеЗаполнено(ДатаВыдачиФакт) Тогда
			 СтруктураПечатныхФорм = Новый Структура("ПечатьактаПриемаКолес, 
											|Бирки,
											|ДоговорХранения,
											|ПрайсЛистХранителя,
											|СчетЗаказ",
											"Акт приема-передачи",
	                                        "Бирки",
											"Договор хранения",
											"Прайс-лист хранителя",
											"Счет на оплату");
		ИначеЕсли ЗначениеЗаполнено(ДатаВыдачиФакт) И СрокХраненияПросрочка > 0 И СправочникДанных.Работы.Количество() > 1 Тогда 
			
					СтруктураПечатныхФорм = Новый Структура("АктБезПросрочки,														
											|СчетЗаказДоплата,
											|СчетФактура,
											|ПикингЛист",		 
											"Акт оказанных услуг",
											"Счет на оплату (ПРИ ПРОСРОЧКЕ)",
											"Счет-фактура",
											"Пикинг-лист на выдачу хранения");				 			 
		ИначеЕсли ЗначениеЗаполнено(ДатаВыдачиФакт) И СрокХраненияПросрочка > 0 И СправочникДанных.Работы.Количество() = 1 Тогда
											   СтруктураПечатныхФорм = Новый Структура("АктБезПросрочки,														
											|СчетЗаказДоплата,
											|СчетФактура,
											|ПикингЛист,				 			 
											|АктВозврата",
											"Акт оказанных услуг",
											"Счет на оплату (ПРИ ПРОСРОЧКЕ)",
											"Счет-фактура",
											"Пикинг-лист на выдачу хранения",				 			 
											"Акт оказанных услуг (ЕСТЬ ПРОСРОЧКА)");   	
		ИначеЕсли ЗначениеЗаполнено(ДатаВыдачиФакт) И СрокХраненияПросрочка = 0 Тогда 
		СтруктураПечатныхФорм = Новый Структура("АктБезПросрочки,														
											|СчетФактура,
											|ПикингЛист",				 			 
											"Акт оказанных услуг (НЕТ ПРОСРОЧКИ)",
											"Счет-фактура",
											"Пикинг-лист на выдачу хранения");				 			 
		КонецЕсли;
	КонецЕсли;							
										
 Возврат СтруктураПечатныхФорм; 											

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

//!
Функция ПосчитатьСумму(Цена = 0) Экспорт 
	
	Если Не ЗначениеЗаполнено(Размер) Тогда
	    Цена = 0;
		Возврат 0;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныХраненияКолесСрезПоследних.Цена
		|ИЗ
		|	РегистрСведений.Renault_Advanced_ЦеныХраненияКолес.СрезПоследних(
		|			&МоментВремени,
		|			Размер = &Размер
		|				И УдаленноеХранение = &УдаленноеХранение) КАК ЦеныХраненияКолесСрезПоследних";

	Запрос.УстановитьПараметр("МоментВремени", Дата);
	Запрос.УстановитьПараметр("Размер", Размер);
	Запрос.УстановитьПараметр("УдаленноеХранение", УдаленноеХранение);

	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда   
		Цена = ВыборкаДетальныеЗаписи.Цена;
		Сумма = Цена*СрокХранения;
		СуммаСкидки = Сумма * ПроцентСкидкиНаценки / 100;
		Возврат (Сумма-СуммаСкидки); 
	Иначе
		Цена = 0;
		Возврат 0;
	КонецЕсли;
	
КонецФункции

//!
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;

	ПроверитьЗаполнениеРеквизитов(Отказ);
    Если Не Отказ Тогда
		
		мДатаВыдачиФакт = Неопределено;
		мСуммаПросрочки = Неопределено;
		Если ДополнительныеСвойства.Свойство("ДатаВыдачиФакт", мДатаВыдачиФакт) И Не ДатаВыдачиФакт = мДатаВыдачиФакт Тогда
			
			ДатаВыдачиФакт = мДатаВыдачиФакт;	
			
		КонецЕсли;
		Если ДополнительныеСвойства.Свойство("СуммаПросрочки", мСуммаПросрочки) И Не СуммаПросрочки = мСуммаПросрочки Тогда
			
			СуммаПросрочки = мСуммаПросрочки;	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//!
Процедура ПроверитьЗаполнениеРеквизитов(Отказ)

	// проверки заполненности полей
	Если Не ЗначениеЗаполнено(МК) Тогда
		Сообщить("Не заполнен принявший!");	
		Отказ = Истина;
	КонецЕсли;	
	
	Если Не ТолькоДиски И Не ЗначениеЗаполнено(Габариты) Тогда	
		Сообщить("Не заполнены габариты!");
	КонецЕсли;
	
	Если Не Автопокрышки И Не КолесаВСборе И Не ТолькоДиски Тогда	
		Сообщить("Не заполнены Только диски/Автопокрышки/Колеса В Сборе!");
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Количество) Тогда
		Сообщить("Не заполнено Количество!");
		Отказ = Истина;	
	КонецЕсли;
	
	Если Не ТолькоДиски И Не ЗначениеЗаполнено(ШинаПроизводитель) Тогда
		Сообщить("Не заполнен производитель шин!");	
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ТолькоДиски И Не ЗначениеЗаполнено(ТипПокрышки) Тогда
		Сообщить("Не заполнен тип покрышки!");	
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Размер) Тогда
		Сообщить("Не заполнен Размер!");	
		Отказ = Истина;
	КонецЕсли;
	
	Если Не Новые и Не ЗначениеЗаполнено(СтепеньИзноса) Тогда
		Сообщить("Не заполнена степень износа!");	
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ТолькоДиски И Не ЗначениеЗаполнено(ИндексСкорости) Тогда
		Сообщить("Не заполнен Индекс Скорости!");	
	КонецЕсли;
	
	Если Не ТолькоДиски И Не ЗначениеЗаполнено(ИндексНагрузки) Тогда
		Сообщить("Не заполнен Индекс Нагрузки!");	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СрокХранения) Тогда
		Сообщить("Не заполнен Срок хранения!");	
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ Автопокрышки Тогда
		Если Не ОригТипДисков И Не НеОригТипДисков Тогда
			Сообщить("Не заполнены Оригинальные/Неоригинальный тип дисков!");	
			Отказ = Истина;
		КонецЕсли;
		
		Если Не ОригТипДисков И Не НеОригТипДисков Тогда
			Сообщить("Не заполнены Оригинальные/Неоригинальный тип дисков!");	
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Не КрепежСдан И Не КрепежНеСдан Тогда
		Сообщить("Не заполнено Крепеж сдан/не сдан!");	
		Отказ = Истина;
	КонецЕсли;
	
	Если Не СупинаторыЕсть И Не СупинаторовНет Тогда
		Сообщить("Не заполнено Супинаторы есть/нет!");	
		Отказ = Истина;
	КонецЕсли;
	
	Если Не СекреткиЕсть И Не СекретокНет Тогда
		Сообщить("Не заполнено Секретки есть/нет!");	
		Отказ = Истина;
	КонецЕсли;
	
	Если КолесаВСборе Или ТолькоДиски Тогда
		
		Если Не ДискСталные И Не ДискЛегкосплавные Тогда
			Сообщить("Не заполнен тип дисков Стальные/Легкосплавные!");	
			Отказ = Истина;
		КонецЕсли;	
		
	КонецЕсли;
	
	Если КолесаВСборе Или Автопокрышки Тогда  		
		Если Не ЗначениеЗаполнено(ШинаШирина) Тогда
			Сообщить("Не заполнена ширина шин (W)!");	
			Отказ = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ШинаПрофиль) Тогда
			Сообщить("Не заполнен профиль шин (h/w)!");	
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ИндексНагрузки) Тогда
			Renault_Advanced_ОбщегоНазначения.СообщитьОбОшибке("Не заполнен индекс нагрузки(ind G)!", Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ИндексСкорости) Тогда
			Renault_Advanced_ОбщегоНазначения.СообщитьОбОшибке("Не заполнен индекс скорости(ind V)!", Отказ);
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры

//!
Функция ВычислитьСуммуПросрочки(КоличествоИзделий, Дата1, Дата2, ЦенаХраненияВМесяц = 0, РасчетПоДням = Ложь) Экспорт 
	
	Если Дата1 <= Дата2 Или КоличествоИзделий = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Лет		= 0;
	Месяцев	= 0;
	Дней	= 0;     
	РазобратьРазностьДат(Дата1, Дата2, Лет, Месяцев, Дней); 
	
	//если просрочка больше года, не правильно считалось количество месяцев 
	Если Лет > 0 Тогда
		Месяцев = Лет * 12 + Месяцев;
	КонецЕсли;
	
	СрокХраненияПросрочка = Макс(Месяцев, 1);
	
	Если РасчетПоДням Тогда //по дням
		Возврат Дней*ЦенаХраненияВМесяц/30;
	Иначе                   //по месяцам	
		Возврат Макс(Месяцев, 1)*ЦенаХраненияВМесяц;
	КонецЕсли;
	
КонецФункции // ВычислитьСуммуПросрочки()

//! Процедура вычисляет количество лет, месяцев и дней между двумя датами
//
// Параметры
//  Дата1	– дата, первая дата (более поздняя, часто текущая, стаж определяется по состоянию на эту дату)
//  Дата2	– дата, вторая дата (ранняя дата, с нее начинается "течение" стажа)
//  Лет		– Число, в этот параметр будет записано кол-во лет между двумя датами (Дата1-Дата2)
//  Месяцев	– Число, в этот параметр будет записано кол-во месяцев между двумя датами (Дата1-Дата2)
//  Дней	– Число, в этот параметр будет записано кол-во дней между двумя датами (Дата1-Дата2)
//
Процедура РазобратьРазностьДат(Дата1, Дата2, Лет = 0, Месяцев = 0, Дней = 0) Экспорт
	
	Лет		= 0;
	Месяцев	= 0;
	Дней	= 0;
	Если Дата1 > Дата2 Тогда
		
		ВременнаяДата = Дата1;
		Если День(ВременнаяДата) < День(Дата2) Тогда
			Дней = (ВременнаяДата - ДобавитьМесяц(ВременнаяДата,-1))/86400;
			ВременнаяДата = ДобавитьМесяц(ВременнаяДата,-1);
		КонецЕсли;
		Если Месяц(ВременнаяДата) < Месяц(Дата2) Тогда
			ВременнаяДата = ДобавитьМесяц(ВременнаяДата,-12);
			Месяцев = 12;
		КонецЕсли;
		Лет		= Макс(			 Год(ВременнаяДата)		- Год(Дата2),	0);
		Месяцев	= Макс(Месяцев	+ Месяц(ВременнаяДата)	- Месяц(Дата2),	0);
		Дней	= Макс(Дней		+ День(ВременнаяДата)	- День(Дата2),	0);
		
		// скорректируем отображаемое значение, если "вмешалось" разное количество дней в месяцах
		Если Дата2 <> (ДобавитьМесяц(Дата1,-Лет*12-Месяцев)-Дней*86400) Тогда
			Дней = Дней + (День(КонецМесяца(Дата2)) - День(НачалоМесяца(Дата2))) - (День(КонецМесяца(ДобавитьМесяц(Дата1,-1))) - День(НачалоМесяца(ДобавитьМесяц(Дата1,-1))));
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры	// РазобратьРазностьДат

//! Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ) 
	Движения.Renault_Advanced_ИсторияХраненияКолес.Очистить();
	Движения.Renault_Advanced_ПродажиСервиса.Очистить();
	Движения.Записать();
КонецПроцедуры // ОбработкаУдаленияПроведения

//!
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Сформируем структуру реквизитов шапки документа.
	СтруктураШапкиДокумента = Новый Структура;
	СтруктураШапкиДокумента.Вставить("Ссылка", ЭтотОбъект.Ссылка);
	СтруктураШапкиДокумента.Вставить("Дата", ЭтотОбъект.Дата);
	МетаданныеДокумента = ЭтотОбъект.Метаданные();
	Для каждого Реквизит из МетаданныеДокумента.Реквизиты Цикл
		СтруктураШапкиДокумента.Вставить(Реквизит.Имя, ЭтотОбъект[Реквизит.Имя]);
	КонецЦикла; 	
	
	СтруктураШапкиДокумента.Вставить("ВидДокумента", МетаданныеДокумента.Имя);
	СтруктураШапкиДокумента.Вставить("ПредставлениеДокумента", СокрЛП(ЭтотОбъект));
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = Renault_Advanced_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
	Если НЕ Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры

//!
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// регистр Renault_Advanced_ИсторияХраненияКолес 
	Движения.Renault_Advanced_ИсторияХраненияКолес.Очистить();
	Движение = Движения.Renault_Advanced_ИсторияХраненияКолес.Добавить();
	Движение.Период       = СтруктураШапкиДокумента.Дата;
	Движение.ЗаказНаряд   = СтруктураШапкиДокумента.ЗаказНаряд;
	Движение.Контрагент   = СтруктураШапкиДокумента.Контрагент;
	Движение.Размер       = СтруктураШапкиДокумента.Размер;
	Движение.Количество   = СтруктураШапкиДокумента.Количество;
	Движение.СрокХранения = СтруктураШапкиДокумента.СрокХранения;
	Движение.Сумма        = СтруктураШапкиДокумента.Сумма;
	
	СправочникДанных = Renault_AdvancedСервер.ПолучитьСправочникДанныхЗаказНаряда(СтруктураШапкиДокумента.ЗаказНаряд);
	СправочникДанныхОбъект = СправочникДанных.ПолучитьОбъект();
	
	Если ЗначениеЗаполнено(СтруктураШапкиДокумента.ДатаВыдачиФакт) Тогда //выдача
		
		Если (СтруктураШапкиДокумента.СрокХраненияПросрочка>0 
			Или СтруктураШапкиДокумента.СуммаПросрочки >0) Тогда //фиксируем просрочку
			
			Движение = Движения.Renault_Advanced_ИсторияХраненияКолес.Добавить();
			Движение.Период       = СтруктураШапкиДокумента.Дата;
			Движение.ЗаказНаряд   = СтруктураШапкиДокумента.ЗаказНаряд;
			Движение.Контрагент   = СтруктураШапкиДокумента.Контрагент;
			Движение.Размер       = СтруктураШапкиДокумента.Размер;
			Движение.Количество   = СтруктураШапкиДокумента.Количество;
			Движение.СрокХранения = СтруктураШапкиДокумента.СрокХраненияПросрочка;
			Движение.Сумма        = СтруктураШапкиДокумента.СуммаПросрочки;
			Движение.ЭтоДопХранение = Истина;
			
			// регистр Renault_Advanced_ПродажиСервиса 
			обЗН = СтруктураШапкиДокумента.ЗаказНаряд.ПолучитьОбъект();			
 
			СтруктураШапкиДокументаЗН = Renault_Advanced_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(обЗН, СправочникДанныхОбъект);
			
			Движения.Renault_Advanced_ПродажиСервиса.Очистить();
			Движение = Движения.Renault_Advanced_ПродажиСервиса.Добавить();
			Движение.Период         = СтруктураШапкиДокумента.Дата;
			Движение.ЗаказНаряд     = СтруктураШапкиДокумента.ЗаказНаряд;
			Движение.Контрагент     = СтруктураШапкиДокумента.Контрагент;
			Движение.ВидОбслуживания = СтруктураШапкиДокументаЗН.ВидОбслуживания;
			Движение.ВидОплаты       = СтруктураШапкиДокументаЗН.ВидОплаты;
			
			ТекУслуга = ПолучитьУслугуПоНоменклатуре(СтруктураШапкиДокументаЗН.Автоуслуга);
			
			Движение.Номенклатура   = ТекУслуга;
			Движение.Количество     = СтруктураШапкиДокумента.СрокХраненияПросрочка;
			Движение.Сумма          = СтруктураШапкиДокумента.СуммаПросрочки;
			Движение.СуммаБезСкидок = СтруктураШапкиДокумента.СуммаПросрочки;
			Движение.НДС            = Renault_Advanced_УчетНДС.РассчитатьСуммуНДС(СтруктураШапкиДокумента.СуммаПросрочки,
											СтруктураШапкиДокументаЗН.УчитыватьНДС, СтруктураШапкиДокументаЗН.СуммаВключаетНДС,
											Renault_Advanced_УчетНДС.ПолучитьСтавкуНДС(СтруктураШапкиДокументаЗН.Автоуслуга.СтавкаНДС));
			
			Движение.Склад = СтруктураШапкиДокументаЗН.СкладРемзоны;
			Движение.ДоговорКонтрагента = СтруктураШапкиДокументаЗН.ДоговорВзаиморасчетов;
			Движение.Подразделение = СтруктураШапкиДокументаЗН.ПодразделениеКомпании;
			
			ЗаполнитьЗначенияСвойств(Движение, СтруктураШапкиДокументаЗН, "Организация, Контрагент, Плательщик, ВалютаДокумента, Обслуживание");
			
			Если НЕ ЗначениеЗаполнено(Движение.Изделие) И ЗначениеЗаполнено(СтруктураШапкиДокументаЗН.Автомобиль) Тогда
				Движение.Изделие = СтруктураШапкиДокументаЗН.Автомобиль;
			КонецЕсли;
			
			СтруктураШапкиДокументаЗН.Вставить("КурсДвиженийУпр", 1);
			
			Движение.ИсточникИнформацииПриОбращении = СтруктураШапкиДокументаЗН.ИсточникИнформацииПриОбращении;
			Движение.СуммаУпр          = Движение.Сумма* СтруктураШапкиДокументаЗН.КурсДвиженийУпр;
			Движение.СуммаБезСкидокУпр = Движение.СуммаБезСкидок* СтруктураШапкиДокументаЗН.КурсДвиженийУпр;
			Движение.НДСУпр            = Движение.НДС* СтруктураШапкиДокументаЗН.КурсДвиженийУпр;
			
			//////////////////
			//Если зафиксирована просрочка, добавляем сведения об этом в заказ-наряд
			СуммаРабот = Renault_Advanced_УчетНДС.ПолучитьСуммуДокументаСНДС(СправочникДанныхОбъект, "Работы");
			СуммаДогХК = СтруктураШапкиДокумента.Сумма; 
            СтатусЗН = СправочникДанныхОбъект.СтатусЗаказНаряда;
			Если Не СуммаРабот = СуммаДогХК
				И НЕ (СтатусЗН = Справочники.Renault_Advanced_СтатусыЗаказНарядов.Закрыт И СтруктураШапкиДокумента.ЗаказНаряд.Проведен)Тогда
				
				Работы = СправочникДанныхОбъект.Работы; 				
				
				ТекУслуга = Справочники.Автоработы.НайтиПоНаименованию("Хранение колес просроченное", Истина);
				//1) Добавим строку услуги
				НоваяСтрока = Работы.Добавить();
				НоваяСтрока.Работа = ТекУслуга;
				НоваяСтрока.Цена      = СтруктураШапкиДокумента.Цена;
				НоваяСтрока.ОбъемРаботы = 1;
				НоваяСтрока.Сумма      = СтруктураШапкиДокумента.СуммаПросрочки;
				НоваяСтрока.Количество   = СтруктураШапкиДокумента.СрокХраненияПросрочка;
				НоваяСтрока.СтавкаНДС    = СправочникДанныхОбъект.Автоуслуга.СтавкаНДС;  
				НоваяСтрока.СтадияРаботы = Справочники.Renault_Advanced_СтадииРаботы.Выполнено;
				НоваяСтрока.ПроцентСкидкиНаценки = СтруктураШапкиДокумента.ПроцентСкидкиНаценки;
				СправочникДанныхОбъект.ПересчитатьАвтоматическиеСкидки(обЗН);
				СправочникДанныхОбъект.ПересчитатьРучныеСкидкиРаботы();

				Renault_AdvancedКлиент.СохранитьДополнительныеНастройкиСправочникаДанных(ОбЗН.Ссылка, СправочникДанныхОбъект);
				СправочникДанныхОбъект.Наименование = Строка(ОбЗН.Ссылка);
				СправочникДанныхОбъект.Записать();

				обЗН.Записать();
			ИначеЕсли  НЕ СуммаРабот = СуммаДогХК И СтруктураШапкиДокумента.ЗаказНаряд.Проведен Тогда
				СоздатьСопутствующиеДокументы(Движение, СтруктураШапкиДокумента, СтруктураШапкиДокументаЗН, Отказ, Заголовок);
			КонецЕсли;
          ///////////////

		КонецЕсли;
	КонецЕсли;
	
	Если Не Отказ Тогда
		Если ЗначениеЗаполнено(ДатаВыдачиФакт) Тогда //это выдача

			Если НЕ СтруктураШапкиДокумента.ЗаказНаряд.Проведен Тогда

				Если НЕ СправочникДанных.Обслуживание = Справочники.Renault_Advanced_ТипыОбслуживания.Клиентский Тогда
					//попытаемся провести
					обЗН = СтруктураШапкиДокумента.ЗаказНаряд.ПолучитьОбъект();
					
					Если НЕ СправочникДанных.СтатусЗаказНаряда = Справочники.Renault_Advanced_СтатусыЗаказНарядов.Закрыт Тогда
						СправочникДанныхОбъект.СтатусЗаказНаряда = Справочники.Renault_Advanced_СтатусыЗаказНарядов.Закрыт
					КонецЕсли;
					
					Если обЗН.Пробег = 0 Тогда
						обЗН.Пробег = 1;
					КонецЕсли;
					
					обЗН.ДатаЗакрытия = ТекущаяДата();
					
					Renault_AdvancedКлиент.СохранитьДополнительныеНастройкиСправочникаДанных(ОбЗН.Ссылка, СправочникДанныхОбъект);
					СправочникДанныхОбъект.Наименование = Строка(ОбЗН.Ссылка);
					СправочникДанныхОбъект.Записать(); 

					обЗН.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
				
			КонецЕсли; 			
			
		Иначе                                        //это не выдача 	
			//сравним сумму работ по ЗН и сумму ДХК,
			//если они различаются, перезаполним ЗН
			обЗН = СтруктураШапкиДокумента.ЗаказНаряд.ПолучитьОбъект();
			СуммаРабот = Renault_Advanced_УчетНДС.ПолучитьСуммуДокументаСНДС(СправочникДанныхОбъект, "Работы");
			СуммаДогХК = СтруктураШапкиДокумента.Сумма; 
			Если Не СуммаРабот = СуммаДогХК Тогда
				
				Работы = СправочникДанныхОбъект.Работы; 
				
				Работы.Очистить();
				ТекУслуга = ПолучитьУслугуПоНоменклатуре(СправочникДанныхОбъект.Автоуслуга);
				//1) Добавим строку услуги
				НоваяСтрока = Работы.Добавить();
				НоваяСтрока.Работа = ТекУслуга;
				НоваяСтрока.Цена         = СтруктураШапкиДокумента.Цена;
				НоваяСтрока.ОбъемРаботы = 1;
				НоваяСтрока.Количество   = СтруктураШапкиДокумента.СрокХранения;
				НоваяСтрока.СтавкаНДС    = СправочникДанныхОбъект.Автоуслуга.СтавкаНДС;  
				НоваяСтрока.СтадияРаботы = Справочники.Renault_Advanced_СтадииРаботы.Выполнено;
				НоваяСтрока.ПроцентСкидкиНаценки = СтруктураШапкиДокумента.ПроцентСкидкиНаценки;
				СправочникДанныхОбъект.ПересчитатьАвтоматическиеСкидки(обЗН);
				СправочникДанныхОбъект.ПересчитатьРучныеСкидкиРаботы();
				
				Renault_AdvancedКлиент.СохранитьДополнительныеНастройкиСправочникаДанных(ОбЗН.Ссылка, СправочникДанныхОбъект);
				СправочникДанныхОбъект.Наименование = Строка(ОбЗН.Ссылка);
				СправочникДанныхОбъект.Записать(); 

				обЗН.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

//!
Процедура СоздатьСопутствующиеДокументы(СтрокаДвижения, СтруктураШапкиДокумента, СтруктураШапкиДокументаЗН, Отказ, Заголовок)    
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
	Состояние("Формирование сопутствующих документов...");
	#КонецЕсли

	//1) Заказ
	ЗаказПокупателя = ПолучитьСсылкуНаЗаказПокупателя();   
	Если ЗаказПокупателя = Неопределено Тогда
		ЗаказПокупателя = СоздатьЗаказПокупателя(Отказ, Заголовок, СтруктураШапкиДокументаЗН, СтрокаДвижения);
	КонецЕсли;
	
	//2) РТУ и Счет-фактура
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	СформироватьРеализациюТоваровИУслуг(Отказ, Заголовок, СтруктураШапкиДокумента, СтруктураШапкиДокументаЗН, СтрокаДвижения, Истина);
	
КонецПроцедуры

//!
Функция ПолучитьСкладыИзГруппы(ГруппаДоступностиСкладов) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ГруппаДоступностиСкладов) Тогда
		Возврат Справочники.СкладыКомпании.ПустаяСсылка();
	КонецЕсли;
	
	Если ТипЗнч(ГруппаДоступностиСкладов) = Тип("СправочникСсылка.СкладыКомпании") Тогда
		Возврат ГруппаДоступностиСкладов;
	КонецЕсли;
	
	СписокСкладов = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГруппаДоступностиСкладов", ГруппаДоступностиСкладов);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоставГруппДоступностиСкладов.Склад
	|ИЗ
	|	РегистрСведений.Renault_СоставГруппДоступностиСкладов КАК СоставГруппДоступностиСкладов
	|ГДЕ
	|	СоставГруппДоступностиСкладов.ГруппаДоступности = &ГруппаДоступностиСкладов";
	
	СписокСкладов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Склад");
	
	
	Возврат СписокСкладов;
	
КонецФункции // ПолучитьСкладыИзГруппы()

//! Создает заказ покупателя заказ-наряда.
//
Функция СоздатьЗаказПокупателя(Отказ, Заголовок, СтруктураШапкиДокументаЗН, СтрокаДвижения)
		
	Документ = Документы.ЗаказПокупателя.СоздатьДокумент();
	Документ.ОбработкаЗаполнения(Неопределено);
	
	Документ.Организация = СтруктураШапкиДокументаЗН.Организация;
	Документ.ОбработкаРеквизита("Организация");
	
	Документ.ПодразделениеКомпании = СтруктураШапкиДокументаЗН.ПодразделениеКомпании;
	Документ.ДокументОснование = ЗаказНаряд;
	Документ.Комментарий = "Сформирован из документа " + ЗаказНаряд;
	
	Документ.Контрагент = СтруктураШапкиДокументаЗН.Плательщик;
	Документ.ОбработкаРеквизита("Контрагент");
	
	Документ.ДоговорВзаиморасчетов = СтруктураШапкиДокументаЗН.ДоговорПлательщика;
	Документ.ОбработкаРеквизита("ДоговорВзаиморасчетов");
	
	Документ.Проект = СтруктураШапкиДокументаЗН.Проект;
	Документ.ОбработкаРеквизита("Проект");
	
	СписокСкладов = ПолучитьСкладыИзГруппы(СтруктураШапкиДокументаЗН.СкладГруппа);
	Если ТипЗнч(СписокСкладов) = Тип("СправочникСсылка.СкладыКомпании") Тогда
		СкладЗаказаПокупателя = СписокСкладов;
	Иначе
		СкладЗаказаПокупателя = СписокСкладов[0];
	КонецЕсли;	
	 
	Документ.СкладКомпании = СкладЗаказаПокупателя;
	Документ.ОбработкаРеквизита("СкладКомпании");
	
	Документ.ДатаСоздания = ТекущаяДата();
	Документ.ОбработкаРеквизита("ДатаСоздания");
	
	Документ.ТипЦен = СтруктураШапкиДокументаЗН.ТипЦен;
	Документ.ОбработкаРеквизита("ТипЦен");
	
	Документ.Автомобиль = СтруктураШапкиДокументаЗН.Автомобиль;

	Документ.СрокПоставки = ?(ЗначениеЗаполнено(СтруктураШапкиДокументаЗН.ВремяИсполнения), СтруктураШапкиДокументаЗН.ВремяИсполнения, ТекущаяДата());
	Документ.ОбработкаРеквизита("ОтображениеСрокаПоставки");
	
	Документ.Товары.Очистить();
	СтрокаУслуг = Документ.Товары.Добавить();
	СтрокаУслуг.ИдентификаторСтроки = Новый УникальныйИдентификатор; 	
	СтрокаУслуг.Номенклатура = СтруктураШапкиДокументаЗН.Автоуслуга;
	Документ.ОбработкаРеквизита("Товары.Номенклатура", СтрокаУслуг); 
	СтрокаУслуг.ПримечаниеНоменклатура = ?(ЗначениеЗаполнено(СтрокаУслуг.Номенклатура.НаименованиеПолное), СтрокаУслуг.Номенклатура.НаименованиеПолное, СтрокаУслуг.Номенклатура.Наименование); 
	СтрокаУслуг.Цена = СтрокаДвижения.Сумма;
	СтрокаУслуг.Количество = 1;		
	Документ.ОбработкаРеквизита("Товары.Количество", СтрокаУслуг);  	
	СтрокаУслуг.СрокПоставкиВСтроке = ?(ЗначениеЗаполнено(СтруктураШапкиДокументаЗН.ВремяИсполнения), СтруктураШапкиДокументаЗН.ВремяИсполнения, ТекущаяДата());	
	Попытка
		Документ.Записать(РежимЗаписиДокумента.Проведение); 		
		Renault_Advanced_ОбщегоНазначения.СообщитьОбОшибке("Сформирован документ " + Документ.Ссылка, , Заголовок, СтатусСообщения.Информация);
		Renault_Advanced_ОбщегоНазначения.ЗаписатьСвязиЗаказНаряда(Ссылка, Документ.Ссылка);
		
		Возврат Документ.Ссылка;
	Исключение
		Renault_Advanced_ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(), Отказ);
		
		Возврат Документы.ЗаказПокупателя.ПустаяСсылка();
	КонецПопытки;  
КонецФункции // СоздатьЗаказПокупателя()

//! Возвращает ссылку на один из документов заданного типа, сформированных из Заказ-наряда.
//
Функция ПолучитьСсылкуНаСформированныйДокумент(ТипДокумента, Фильтр = Неопределено) Экспорт
	
	Перем СсылкаНаДокумент;
	
	Если ТипЗнч(мСформированныеДокументы) <> Тип("Структура") Тогда
		мСформированныеДокументы = Новый Структура;
	КонецЕсли;
	
	Если НЕ мСформированныеДокументы.Свойство(ТипДокумента, СсылкаНаДокумент) ИЛИ НЕ ЗначениеЗаполнено(СсылкаНаДокумент) ИЛИ СсылкаНаДокумент.ПолучитьОбъект() = Неопределено Тогда
			
		СсылкаНаДокумент = Неопределено;	
	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Регистратор", Ссылка);
	    //Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.ЗаказНаряд.Ссылка);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(СформированныеДокументы.Документ КАК Документ." + ТипДокумента + ") КАК Ссылка
		|ИЗ
		|	РегистрСведений.Renault_Advanced_СформированныеДокументы КАК СформированныеДокументы
		|ГДЕ
		|	СформированныеДокументы.ЗаказНаряд = &Регистратор
		|	И СформированныеДокументы.Документ ССЫЛКА Документ." + ТипДокумента;
		
		Если ЗначениеЗаполнено(Фильтр) Тогда
			Для Каждого СтрокаФильтра Из Фильтр Цикл
				Запрос.УстановитьПараметр(СтрокаФильтра.Ключ, СтрокаФильтра.Значение);
				Запрос.Текст = Запрос.Текст + "
				|И СформированныеДокументы.Документ." + СтрокаФильтра.Ключ + " = &" + СтрокаФильтра.Ключ; 
			КонецЦикла;
		КонецЕсли;
	
		Выборка = Запрос.Выполнить().Выбрать();
	
		Если Выборка.Следующий() Тогда
			СсылкаНаДокумент = Выборка.Ссылка;
			Если НЕ ЗначениеЗаполнено(Фильтр) Тогда 
				мСформированныеДокументы.Вставить(ТипДокумента, СсылкаНаДокумент);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СсылкаНаДокумент;
	
КонецФункции // ПолучитьСсылкуНаСформированныйДокумент()

//! Получает ссылку на документ "Реализация товаров и услуг", сформированный из "Заказ-наряда".
//
Функция ПолучитьСсылкуНаРТиУ() Экспорт
	
	Возврат ПолучитьСсылкуНаСформированныйДокумент("РеализацияТоваров");
	
КонецФункции // ПолучитьСсылкуНаРТиУ()

//!
Функция ПолучитьСсылкуНаЗаказПокупателя() Экспорт
	
	Возврат ПолучитьСсылкуНаСформированныйДокумент("ЗаказПокупателя");
	
КонецФункции // ПолучитьСсылкуНаРТиУ()

//! Получает ссылку на документ "Счет на оплату покупателю", сформированный из "Заказ-наряда".
//
Функция ПолучитьСсылкуНаСчетНаОплату() Экспорт
	
	Перем СчетНаОплатуПокупателю;
	
	Если ТипЗнч(мСформированныеДокументы) <> Тип("Структура") Тогда
		мСформированныеДокументы = Новый Структура;
	КонецЕсли;
	
	Если НЕ мСформированныеДокументы.Свойство("СчетНаОплатуПокупателю", СчетНаОплатуПокупателю) ИЛИ НЕ ЗначениеЗаполнено(СчетНаОплатуПокупателю) ИЛИ СчетНаОплатуПокупателю.ПолучитьОбъект() = Неопределено Тогда
		
		СчетНаОплатуПокупателю = Неопределено;
		
		// Если заказ покупателя по каким-либо причинам не создан, то счет найти мы не сможем - выходим
		ЗаказПокупателя = ПолучитьСсылкуНаСформированныйДокумент("ЗаказПокупателя");
		Если ЗаказПокупателя = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СчетНаОплатуПокупателю.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СчетНаОплату КАК СчетНаОплатуПокупателю
		|ГДЕ
		|	СчетНаОплатуПокупателю.ДокументОснование = &ЗаказПокупателя";
	
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			СчетНаОплатуПокупателю = Выборка.Ссылка;
			мСформированныеДокументы.Вставить("СчетНаОплатуПокупателю", СчетНаОплатуПокупателю);
		КонецЕсли;
	
	КонецЕсли;

	Возврат СчетНаОплатуПокупателю;
	
КонецФункции // ПолучитьСсылкуНаСчетНаОплату()

//! Формирует документ "Реализация товаров и услуг"
//
Процедура СформироватьРеализациюТоваровИУслуг(Отказ, Заголовок, СтруктураШапкиДокумента, СтруктураШапкиДокументаЗН, СтрокаДвижения, ФормироватьСчетФактуру = Истина)
	
	Если ЗаказПокупателя = Неопределено Тогда
		ЗаказПокупателя = ПолучитьСсылкуНаСформированныйДокумент("ЗаказПокупателя");
	КонецЕсли;
	
	Если ЗаказПокупателя = Неопределено Тогда
		// Заказ покупателя не создан, поэтому мы не сможем связать РТиУ с Заказ-нарядом
		Renault_Advanced_ОбщегоНазначения.СообщитьОбОшибке("Не найден документ ""Заказ покупателя"", создание ""Реализации товаров и услуг"" невозможно.", Отказ, Заголовок);
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
	Состояние("Формирование реализации товаров и услуг...");
	#КонецЕсли

	Документ = ПолучитьСсылкуНаРТиУ();
	
	// Проверим, что у нас сумма заказ-наряда отличается от нуля, иначе проводить документы не нужно
	Если СуммаПросрочки = 0 Тогда
		
		Если ЗначениеЗаполнено(Документ) Тогда
			Документ.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	Документ = ?(ЗначениеЗаполнено(Документ), Документ.ПолучитьОбъект(), Документы.РеализацияТоваров.СоздатьДокумент());
	Если Документ.ПометкаУдаления Тогда
		Документ.УстановитьПометкуУдаления(Ложь);
	КонецЕсли;
	
	Документ.ОбработкаЗаполнения(ЗаказПокупателя);  
	Документ.Дата = ДатаВыдачиФакт;
	Документ.СкладКомпании = ЗаказПокупателя.СкладКомпании;
	Документ.ХозОперация = Справочники.ХозОперации.РеализацияТоваров;
	Документ.БлокироватьПерерасчетСкидок = Истина;
	Документ.ДатаСоздания = ТекущаяДата();
	
	Документ.Товары.Очистить();
	
	СтрокаУслуг = Документ.Товары.Добавить();
	СтрокаУслуг.Номенклатура = СтруктураШапкиДокументаЗН.Автоуслуга;
	Документ.ОбработкаРеквизита("Товары.Номенклатура", СтрокаУслуг);
	СтрокаУслуг.Цена = СтрокаДвижения.Сумма;
	СтрокаУслуг.Количество = 1;	
	Документ.ОбработкаРеквизита("Товары.Количество", СтрокаУслуг);
	            	
	Попытка
		Документ.Записать(РежимЗаписиДокумента.Проведение);
		Renault_Advanced_ОбщегоНазначения.ЗаписатьСвязиЗаказНаряда(ЭтотОбъект.Ссылка, Документ.Ссылка);
	Исключение
		Renault_Advanced_ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(), Отказ);
	КонецПопытки;
	
	Если НЕ ФормироватьСчетФактуру ИЛИ НЕ СтруктураШапкиДокументаЗН.ОтражатьВБухгалтерскомУчете ИЛИ Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СчетФактура = Renault_Advanced_УчетНДС.НайтиПодчиненныйДокумент(Документ.Ссылка, "СчетФактураВыданный");
	
	Если ЗначениеЗаполнено(СчетФактура) Тогда
		
		Если НачалоДня(СчетФактура.Дата) = НачалоДня(Дата) Тогда
			Попытка
				СчетФактура.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Отказ = Истина;
			КонецПопытки;
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	СформироватьСчетФактуру(Документ.Ссылка, Отказ);
	
КонецПроцедуры // СформироватьРеализациюТоваровИУслуг()

//! Формирует документ Счет-фактура выданный на основании Реализации товаров и услуг,
// созданной из заказ-наряда.
//
// Параметры:
//   Документ - ДокументОбъект.РеализацияТоваровУслуг - основание для формирование с/ф.
//   Отказ - флаг отказа в проведении.
//
// Возвращаемое значение:
//   ДокументОбъект.СчетФактураВыданный, если проведение документа прошло успешно, иначе -
//     Неопределено.
//
Функция СформироватьСчетФактуру(Документ, Отказ = Ложь)
	СчетФактура = Документы.СчетФактураВыданный.СоздатьДокумент();
	СчетФактура.Заполнить(Документ);
	СчетФактура.ДатаСоздания = ТекущаяДата();
	
	Попытка
		СчетФактура.Записать(РежимЗаписиДокумента.Проведение);
		Возврат СчетФактура;
	Исключение
		Отказ = Истина;
		Возврат Неопределено;
	КонецПопытки;	
КонецФункции // СформироватьСчетФактуру()


