
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МассивВариантовЗамены") Тогда
	
		Для каждого ТекущийВаринт Из Параметры.МассивВариантовЗамены Цикл
		
			НоваяСтрока = ТаблицаВариантовЗамены.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекущийВаринт);
		
		КонецЦикла; 	
		
	Иначе 
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ЗаменыКарты" 
		И Параметр = ЭтаФорма Тогда
	
		Закрыть();
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	СтруктураДанных = Новый Структура("Контрагент,ВидОперации,Дата,КартаИсточник,КартаПриемник,ВидКарты,Номинал,ЗаказНаряд");
	
	Выбран = Ложь;
	
	Для каждого ТекущаяСтрока Из ТаблицаВариантовЗамены Цикл
	
		Если ТекущаяСтрока.Выбрать Тогда
			
			ЗаполнитьЗначенияСвойств(СтруктураДанных,ТекущаяСтрока);
			Выбран = Истина;
			
		КонецЕсли; 
	
	КонецЦикла; 
	
	Если Выбран Тогда
		
		ПараметрыФормы = Новый Структура("ДанныеДляЗаменыДисконтнойКарты,ЗакрыватьПриЗакрытииВладельца",СтруктураДанных,Ложь);
		
		ОткрытьФорму("Документ.DMS_ЗаменаКартЛояльности.Форма.ФормаДокумента",ПараметрыФормы,ЭтаФорма);
				
	Иначе 
		Предупреждение("Выберите вид карты!",15,"Не выбран вид карты");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВариантовЗаменыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВариантовЗаменыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВариантовЗаменыВыбратьПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаВариантовЗамены.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если Не ТекущаяСтрока.Выбрать Тогда
		Возврат;
	КонецЕсли; 
	
	Для каждого СтрокаТаблицы Из ТаблицаВариантовЗамены Цикл
	
		Если СтрокаТаблицы = ТекущаяСтрока Тогда
			Продолжить;
		КонецЕсли; 		
		
		СтрокаТаблицы.Выбрать = Ложь;
		
	КонецЦикла; 
	
КонецПроцедуры
