Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	Если РежимЗаписи<>РежимЗаписиДокумента.Запись Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(DMS_ЗаявкаНаОтгрузку.Ссылка) КАК КоличествоДублей
		|ИЗ
		|	Документ.DMS_ЗаявкаНаОтгрузку КАК DMS_ЗаявкаНаОтгрузку
		|ГДЕ
		|	DMS_ЗаявкаНаОтгрузку.VIN ПОДОБНО &VIN
		|	И DMS_ЗаявкаНаОтгрузку.Ссылка <> &Ссылка
		|	И DMS_ЗаявкаНаОтгрузку.ПометкаУдаления = ЛОЖЬ
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(DMS_ЗаявкаНаОтгрузку.Ссылка) >= 1";
	
	Запрос.УстановитьПараметр("VIN", VIN);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		Сообщить("Обнаружены заявки на отгрузку по данному VIN номеру, запись не возможна");	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры