// Общий журнал

Перем Права Экспорт;

Перем Организация Экспорт;

Функция ПолучитьСписокПечатныхФорм() Экспорт
	
	Возврат Новый СписокЗначений;
	
КонецФункции
//Конец необходимых для общих журналов

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	Для Каждого Строка из Работы Цикл;
		
		Если Строка.Цвет <> Перечисления.Renault_ЦветаСертификатаКонтроля.Красный Тогда
			Строка.Цвет = Перечисления.Renault_ЦветаСертификатаКонтроля.Желтый
		КонецЕсли;
		
	КонецЦикла;

	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Renault_ПоврежденияАвтомобилей.Записывать = Истина;
	Движения.Renault_ПоврежденияАвтомобилей.Очистить();
	Для Каждого Запись Из Работы Цикл
		Движение = Движения.Renault_ПоврежденияАвтомобилей.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Запись);
		Движение.РаботаАктуальна = Запись.РаботаАктуальна;
		Движение.Регистратор = Ссылка;
		Движение.Период = Дата;
		Движение.Автомобиль = Автомобиль;
	КонецЦикла;
	Движения.Записать();
	
	//создание контактов с клиентом
	
	//выбираем работы из сертификата, группируем по датам и подбираем контакты с клиентом на эти даты.
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_СертификатКонтроляРаботы.РекомендуемаяДатаВыполнения
		|ПОМЕСТИТЬ ДатыАкутальныхРабот
		|ИЗ
		|	Документ.Renault_СертификатКонтроля.Работы КАК Renault_СертификатКонтроляРаботы
		|ГДЕ
		|	Renault_СертификатКонтроляРаботы.Ссылка = &Ссылка
		|	И Renault_СертификатКонтроляРаботы.РаботаАктуальна
		|
		|СГРУППИРОВАТЬ ПО
		|	Renault_СертификатКонтроляРаботы.РекомендуемаяДатаВыполнения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Renault_КонтактСКлиентом.ПлановаяДата,
		|	Renault_КонтактСКлиентом.Ссылка КАК Контакт
		|ПОМЕСТИТЬ Контакты
		|ИЗ
		|	Документ.Renault_КонтактСКлиентом КАК Renault_КонтактСКлиентом
		|ГДЕ
		|	Renault_КонтактСКлиентом.ДокументОснование = &Ссылка
		|	И Renault_КонтактСКлиентом.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Контакты.ПлановаяДата,
		|	РаботыДок.РекомендуемаяДатаВыполнения КАК РекомендуемаяДатаВыполнения,
		|	Контакты.Контакт
		|ИЗ
		|	Контакты КАК Контакты
		|		ПОЛНОЕ СОЕДИНЕНИЕ ДатыАкутальныхРабот КАК РаботыДок
		|		ПО (РаботыДок.РекомендуемаяДатаВыполнения = Контакты.ПлановаяДата)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РекомендуемаяДатаВыполнения";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Контакты = Запрос.Выполнить().Выгрузить();
	
	Для каждого Стр из Контакты Цикл
		
		Если НЕ ЗначениеЗаполнено(Стр.Контакт) Тогда
			
			НовыйКонтакт			  		= Документы.Renault_КонтактСКлиентом.СоздатьДокумент();
			НовыйКонтакт.Контрагент   		= Ссылка.Клиент;
			НовыйКонтакт.Автомобиль   		= Ссылка.Автомобиль;
			НовыйКонтакт.Дата 	 	  		= Ссылка.Дата;
			НовыйКонтакт.Кампания	  		= Справочники.Renault_Кампании.РаботаПоСертификатамКонтроля;
			
			НовыйКонтакт.ПлановаяДата 		= Стр.РекомендуемаяДатаВыполнения;
			НовыйКонтакт.Комментарий  		= "Основание: " + Строка(Ссылка);
			НовыйКонтакт.ДокументОснование 	= Ссылка;
			ТекстОснованиеКонтакта = "";
			ТекстОснованиеКонтактаПолный = "Основание: Сертификат контроля " + Строка(Ссылка.Номер) + " от " + Формат(Ссылка.Дата,"ДЛФ=Д")+". Сотрудник, выдавший рекомендацию: " + Строка(Ссылка.Автор) + ". Комментарий: " + СокрЛП(Ссылка.Комментарий) + ". Текст рекомендации: ";
			
			МассивРабот = Работы.НайтиСтроки(Новый Структура("РаботаАктуальна,РекомендуемаяДатаВыполнения",Истина,Стр.РекомендуемаяДатаВыполнения));
			Для каждого СтрРаботы из МассивРабот Цикл
				ТекстОснованиеКонтакта = ТекстОснованиеКонтакта + Строка(СтрРаботы.Работа)+ "; ";
				ТекстОснованиеКонтактаПолный = ТекстОснованиеКонтактаПолный + Строка(СтрРаботы.Работа)+ " (рекомендумая дата выполнения "+Формат(СтрРаботы.РекомендуемаяДатаВыполнения,"ДЛФ=Д")+", процент износа: "+ строка(СтрРаботы.ПроцентИзноса)+", цвет: "+Строка(СтрРаботы.Цвет)+"); " 
			КонецЦикла;
			ТекстОснованиеКонтакта = Лев(ТекстОснованиеКонтакта,СтрДлина(ТекстОснованиеКонтакта)-2);
			ТекстОснованиеКонтактаПолный = Лев(ТекстОснованиеКонтактаПолный,СтрДлина(ТекстОснованиеКонтактаПолный)-2);
			
			НовыйКонтакт.ОснованиеДляКонтакта = ТекстОснованиеКонтактаПолный;
			
			Исполнитель = Автор;
			
			Если ЗначениеЗаполнено(Ссылка.Обращение) И ЗначениеЗаполнено(Ссылка.Обращение.Менеджер) Тогда
				Исполнитель 			  = Ссылка.Обращение.Менеджер;
				НовыйКонтакт.Исполнитель  = Исполнитель.Сотрудник;	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Ссылка.Обращение) Тогда
				Приемка = Документы.Renault_CRM_ПриемкаАвтомобиля.НайтиПоРеквизиту("Обращение",Ссылка.Обращение);
				Если ЗначениеЗаполнено(Приемка) И ЗначениеЗаполнено(Приемка.Машиноместо) Тогда
					НовыйКонтакт.Исполнитель 	= Приемка.Машиноместо;
					Исполнитель = Renault_CRM.ПолучитьПользователяПоСотруднику(Приемка.Машиноместо);
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(НовыйКонтакт.Исполнитель) Тогда
				НовыйКонтакт.Исполнитель = Автор.Сотрудник;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Исполнитель) Тогда
				Исполнитель = Автор;
			КонецЕсли;
			
			НовыйКонтакт.Записать();
			
			////создание задачи
			
			ПараметрыЗадачи = Новый Структура;
			ПараметрыЗадачи.Вставить("Автор",Автор);
			ПараметрыЗадачи.Вставить("Исполнители",Исполнитель);
			ПараметрыЗадачи.Вставить("ВидЗадачи",Справочники.Renault_ТипыЗадач.СвязатьсяСКлиентом);
			ПараметрыЗадачи.Вставить("ДатаНачала",НовыйКонтакт.ПлановаяДата);
			ПараметрыЗадачи.Вставить("ДатаОкончания",НовыйКонтакт.ПлановаяДата);
			ПараметрыЗадачи.Вставить("ДокументОснование",НовыйКонтакт.Ссылка);
			ПараметрыЗадачи.Вставить("Содержание",Справочники.Renault_Кампании.РаботаПоСертификатамКонтроля.Цели);
			ПараметрыЗадачи.Вставить("Приоритет",Перечисления.DMS_ВариантыВажностиЗадачи.Обычная);
			ПараметрыЗадачи.Вставить("Комментарий",Справочники.Renault_Кампании.РаботаПоСертификатамКонтроля.Комментарий);
			ПараметрыЗадачи.Вставить("Пояснение", "Связаться с клиентом " + Ссылка.Клиент + ", автомобиль:" + Ссылка.Автомобиль + " " + ТекстОснованиеКонтактаПолный);
			
			Renault_РаботаСЗадачами.СоздатьЗадачуRenault(ПараметрыЗадачи);
			
		ИначеЕсли Стр.РекомендуемаяДатаВыполнения = NULL Тогда
			
			СтарыйКонтакт = Стр.Контакт.ПолучитьОбъект();
			СтарыйКонтакт.ПометкаУдаления = Истина; 
			СтарыйКонтакт.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
		// Заполнение шапки
		Попытка
			ДилерскийЦентр = Renault_РаботаСПравамиПользователя.ДилерскийЦентрПоУмолчанию(ПараметрыСеанса.Пользователь);
		Исключение
		КонецПопытки;
		Дата = ТекущаяДата();
		Автомобиль = ДанныеЗаполнения.Автомобиль;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Клиент = ДанныеЗаполнения.Контрагент;
		Основание = ДанныеЗаполнения;
		ЗаполнитьПереченьОпераций(); //Сергеев В.Н. DMSREN-1158
		ЗаказНаряд = ДанныеЗаполнения; //Сергеев В.Н. DMSREN-1158
		Для Каждого ТекСтрокаРаботы Из ДанныеЗаполнения.Работы Цикл
			НоваяСтрока = Работы.Добавить();
			НоваяСтрока.Работа = ТекСтрокаРаботы.Работа;
			НоваяСтрока.Сумма = ТекСтрокаРаботы.Сумма;
		КонецЦикла;
	КонецЕсли;
	
	Автор = ПараметрыСеанса.Пользователь;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Автор = ПараметрыСеанса.Пользователь;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ) Экспорт
	
	Движения.Renault_ПоврежденияАвтомобилей.Очистить();
	Движения.Renault_ПоврежденияАвтомобилей.Записать();
	
КонецПроцедуры

Функция Печать(ДокСсылка) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ПолеСправа = 50;
	Если ПараметрыСеанса.DMS_Бренд = Справочники.CRM_МаркаАвтомобиля.LADA Тогда
		Макет = ПолучитьМакет("СертификатКонтроляLADA");
	Иначе
		Макет = ПолучитьМакет("СертификатКонтроля");
	КонецЕсли;
	ПустаяСтрока = Макет.получитьОбласть("ПустаяСтрока");
	КонецРамки = Макет.ПолучитьОбласть("КонецРамки");
	НижнийКолонтикул = Макет.ПолучитьОбласть("НижнийКолонтикул");
	ЧислоДобавленных = 0;
	ДобавитьГлавнуюСтраницу(ТабДок, ДокСсылка, Макет, ЧислоДобавленных);
	
	//ДобавитьНижнийКолонтикул(ТабДок, Макет, 11 - ЧислоДобавленных);
	//ДобавитьНижнийКолонтикул(ТабДок, Макет, 1);
	
	ТабДок1 = Новый ТабличныйДокумент;
	ТабДок1.ПолеСлева = 50;
	
	//ДобавитьСтраницыПеречняОпераций(ТабДок1, ДокСсылка, Макет);
	ДобавитьСтраницыПеречняОперацийПланшет(ТабДок1, ДокСсылка, Макет,Истина);
	//ТабДок1.Вывести(КонецРамки);
	
	ДобавитьНижнийКолонтикул(ТабДок1, Макет, 1);
	
	//ТабДок.ВывестиВертикальныйРазделительСтраниц();
	//ДобавитьГлавнуюСтраницу(ТабДок, ДокСсылка, Макет, ЧислоДобавленных);
	//ДобавитьНижнийКолонтикул(ТабДок,Макет, 11 - ЧислоДобавленных);
	//ТабДок.АвтоМасштаб = Истина;
	ИтоговыйТабДок = Новый ТабличныйДокумент;
	ИтоговыйТабДок.МасштабПечати = 50;
	ИтоговыйТабДок.СохранятьСвойстваОтображения = Истина;
	ИтоговыйТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ИтоговыйТабДок.Присоединить(ТабДок);
	ИтоговыйТабДок.Присоединить(ТабДок1);
	
	Возврат ИтоговыйТабДок;//ТабДок;
	
конецФункции

Процедура ДобавитьГлавнуюСтраницу(ТабДок, ДокСсылка, Макет, ЧислоДобавленных)
	
	Отбор = Новый Структура();
	Отбор.Вставить("Цвет", Перечисления.Renault_ЦветаСертификатаКонтроля.Красный);
	Отбор.Вставить("РаботаАктуальна", Истина);
	СписокВажныхРабот = ДокСсылка.Работы.НайтиСтроки(Отбор);
	
	Отбор = Новый Структура();
	Отбор.Вставить("Цвет", Перечисления.Renault_ЦветаСертификатаКонтроля.Желтый);
	Отбор.Вставить("РаботаАктуальна", Истина);
	СписокВторичныхРабот = ДокСсылка.Работы.НайтиСтроки(Отбор);
	
	ПустаяСтрока = Макет.получитьОбласть("ПустаяСтрока");
	КонецРамки = Макет.ПолучитьОбласть("КонецРамки");
	НижнийКолонтикул = Макет.ПолучитьОбласть("НижнийКолонтикул");
	ОбластьШапки = Макет.ПолучитьОбласть("ШапкаСертификата");
	ОбластьШапки.Параметры.ДатаСертификата = Формат(ПолучитьДатуСертификата(ДокСсылка), "ДФ=""дд/ММ/гггг""");//Формат(ДокСсылка.Дата, "ДФ=""дд/ММ/гггг""");
	ОбластьШапки.параметры.Клиент = Строка(ДокСсылка.Клиент);
	ОбластьШапки.Параметры.НомерЗН = Строка(ДокСсылка.ЗаказНаряд.Номер);
	ОбластьШапки.Параметры.Емаил = Renault_CRM.ПолучитьЕмаилКлиент(ДокСсылка.Клиент);
	ОбластьШапки.Параметры.ГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ДокСсылка.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
	ОбластьШапки.Параметры.Модель = Строка(ДокСсылка.Автомобиль.Модель);
	ОбластьШапки.Параметры.Телефон = Renault_CRM.ПолучитьТелефонКлиент(ДокСсылка.Клиент);
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ ПЕРВЫЕ 1
	//|	Renault_ВыполнениеТО.ДатаПлан
	//|ИЗ
	//|	РегистрСведений.Renault_ВыполнениеТО КАК Renault_ВыполнениеТО
	//|ГДЕ
	//|	Renault_ВыполнениеТО.Автомобиль = &Автомобиль
	//|	И Renault_ВыполнениеТО.ДатаФакт = &ПустаяДата
	//|УПОРЯДОЧИТЬ ПО Renault_ВыполнениеТО.ДатаПлан";
	//Запрос.УстановитьПараметр("Автомобиль", ДокСсылка.Автомобиль);
	//Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	//Выборка = Запрос.Выполнить().Выбрать();
	ДатаСледующегоТО = РегистрыСведений.Renault_ВыполнениеТО.ПолучитьПоследнийТО(ДокСсылка.Автомобиль);
	
	Если ЗначениеЗаполнено(ДатаСледующегоТО) Тогда
		
		//ДатаСледующегоТО = Выборка.ДатаПлан;
		
		//СтрокаДень = Формат(День(ДатаСледующегоТО), "ЧЦ=2; ЧВН=");
		
		ОбластьШапки.Параметры.ДатаСледующегоТО = Формат(ДатаСледующегоТО, "ДФ=dd.MM.yyyy");
		//ОбластьШапки.Параметры.ТОЧисло2 = Прав(СтрокаДень, 1);
		//
		//СтрокаМесяц = Формат(Месяц(ДатаСледующегоТО), "ЧЦ=2; ЧВН=");
		//
		//ОбластьШапки.Параметры.ТОМесяц1 = Лев(СтрокаМесяц, 1);
		//ОбластьШапки.Параметры.ТОМесяц2 = Прав(СтрокаМесяц, 1);
		//
		//СтрокаГод = Формат(Год(ДатаСледующегоТО), "ЧЦ=4; ЧВН=");
		//СтрокаГод = СтрЗаменить(СтрокаГод, Символы.НПП, "");
		//
		//ОбластьШапки.Параметры.ТОГод1 = Сред(СтрокаГод, 1, 1);
		//ОбластьШапки.Параметры.ТОГод2 = Сред(СтрокаГод, 2, 1);
		//ОбластьШапки.Параметры.ТОГод3 = Сред(СтрокаГод, 3, 1);
		//ОбластьШапки.Параметры.ТОГод4 = Сред(СтрокаГод, 4, 1);
		
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьШапки);
	ОбластьШапкаРаботыПервойНеобходимости = Макет.ПолучитьОбласть("ШапкаРаботыПервойНеобходимости");
	ТабДок.Вывести(ОбластьШапкаРаботыПервойНеобходимости);
	
	Для Каждого РаботаПервойНеобходимости Из СписокВажныхРабот Цикл
		
		Если НЕ ЗначениеЗаполнено(РаботаПервойНеобходимости.Работа) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		СтрокаРаботПервойНеобходимости = Макет.ПолучитьОбласть("СтрокаРаботПервойНеобходимости");
		СтрокаРаботПервойНеобходимости.Параметры.Работа = ?(ТипЗнч(РаботаПервойНеобходимости.Работа) = Тип("Строка"), РаботаПервойНеобходимости.Работа, РаботаПервойНеобходимости.Работа.Наименование);
		СтрокаРаботПервойНеобходимости.Параметры.Износ = РаботаПервойНеобходимости.ПроцентИзноса;
		СтрокаРаботПервойНеобходимости.Параметры.ДатаВыполн = ?(ЗначениеЗаполнено(РаботаПервойНеобходимости.РекомендуемаяДатаВыполнения), РаботаПервойНеобходимости.РекомендуемаяДатаВыполнения,"");
		ТабДок.Вывести(СтрокаРаботПервойНеобходимости);
		ЧислоДобавленных = ЧислоДобавленных + 1;
	КонецЦикла;
	ШапкаРаботыВторойНеобходимости = Макет.ПолучитьОбласть("ШапкаРаботыВторойНеобходимости");
	ТабДок.Вывести(ШапкаРаботыВторойНеобходимости);
	Для Каждого РаботаВторойНеобходимости Из СписокВторичныхРабот Цикл
		
		Если НЕ ЗначениеЗаполнено(РаботаВторойНеобходимости.Работа) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		СтрокаРаботВторойНеобходимости = Макет.ПолучитьОбласть("СтрокаРаботВторойНеобходимости");
		СтрокаРаботВторойНеобходимости.Параметры.Работа = ?(ТипЗнч(РаботаВторойНеобходимости.Работа) = Тип("Строка"), РаботаВторойНеобходимости.Работа, РаботаВторойНеобходимости.Работа.Наименование);
		СтрокаРаботВторойНеобходимости.Параметры.Износ = РаботаВторойНеобходимости.ПроцентИзноса;
		СтрокаРаботВторойНеобходимости.Параметры.ДатаВыполн = ?(ЗначениеЗаполнено(РаботаВторойНеобходимости.РекомендуемаяДатаВыполнения),РаботаВторойНеобходимости.РекомендуемаяДатаВыполнения,"");
		ТабДок.Вывести(СтрокаРаботВторойНеобходимости);
		ЧислоДобавленных = ЧислоДобавленных + 1;
	КонецЦикла;
	ОкончаниеГлавнойСтраницы = Макет.ПолучитьОбласть("ОкончаниеГлавнойСтраницы");
	//ОкончаниеГлавнойСтраницы.Параметры.Комментарий = ЭтотОбъект.Комментарий;
	
	СвязаннаяПриемка = Документы.Renault_CRM_ПриемкаАвтомобиля.НайтиПоРеквизиту("Обращение", Обращение);
	
	Если Не ЗначениеЗаполнено(СвязаннаяПриемка) Тогда
		
		МастерПриемщик = ПараметрыСеанса.Пользователь.Сотрудник;
		
	Иначе
		
		МастерПриемщик = СвязаннаяПриемка.Машиноместо;
		
	КонецЕсли;
	
	ОкончаниеГлавнойСтраницы.Параметры.МастерПриемщик = "/" + Строка(МастерПриемщик) + "/";
	ОкончаниеГлавнойСтраницы.Параметры.Клиент = "/" + Строка(ДокСсылка.Клиент) + "/";
	
	ТабДок.Вывести(ОкончаниеГлавнойСтраницы);
	
КонецПроцедуры

Процедура ДобавитьСтраницыПеречняОпераций(ТабДок, ДокСсылка, Макет)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Renault_ПереченьОперацийКСиТО.Группа КАК ИмяГруппы
	|ИЗ
	|	РегистрСведений.Renault_ПереченьОперацийКСиТО КАК Renault_ПереченьОперацийКСиТО";
	Группы = Запрос.Выполнить().Выгрузить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ПереченьОперацийКСиТО.Группа,
	|	Renault_ПереченьОперацийКСиТО.Наименование,
	|	Renault_ПереченьОперацийКСиТО.КС,
	|	Renault_ПереченьОперацийКСиТО.ТО
	|ИЗ
	|	РегистрСведений.Renault_ПереченьОперацийКСиТО КАК Renault_ПереченьОперацийКСиТО";
	Операции = Запрос.Выполнить().Выгрузить();
	ШапкаРекомендованныеРаботы = Макет.ПолучитьОбласть("ШапкаРекомендованныеРаботы");
	ШапкаРекомендованныеРаботы.Параметры.Пробег = Renault_АвтосервисОбщий.Renault_ПолучитьПробег(Автомобиль);
	
	ТабДок.Присоединить(ШапкаРекомендованныеРаботы);
	НачалоОпераций = Макет.ПолучитьОбласть("НачалоОпераций");
	ТабДок.Вывести(НачалоОпераций);
	ШапкаОпераций = Макет.ПолучитьОбласть("ШапкаОпераций");
	ТабДок.Вывести(ШапкаОпераций);
	МассивОписанияГрупп = Новый Массив;
	
	Для Каждого Группа из Группы Цикл
		
		//СтрокаГруппы = Макет.ПолучитьОбласть("СтрокаГруппы");
		//СтрокаГруппы.Параметры.Группа = Группа.ИмяГруппы;
		Отбор = Новый Структура();
		Отбор.Вставить("Группа", Группа.ИмяГруппы);
		ОперацииГруппы = Операции.НайтиСтроки(Отбор);
		ОписаниеГруппы = Новый Структура();
		ОписаниеГруппы.Вставить("НомерСтрокиНачалаГруппы", ТабДок.ВысотаТаблицы+1);
		ОписаниеГруппы.Вставить("КоличествоВГруппе", ОперацииГруппы.Количество());
		ОписаниеГруппы.Вставить("ШиринаЯчейкиГруппы", 6);
		ОписаниеГруппы.Вставить("НачальнаяКолонкаГруппы", 2);
		МассивОписанияГрупп.Добавить(ОписаниеГруппы);
		//ТабДок.Вывести(СтрокаГруппы);
		
		Для Каждого ТекОперация Из ОперацииГруппы Цикл
			
			СтрокаОперации = Макет.ПолучитьОбласть("СтрокаОпераций");
			СтрокаОперации.Параметры.Операция = ТекОперация.Наименование;
			СтрокаОперации.Параметры.Группа = Группа.ИмяГруппы;
			ТабДок.Вывести(СтрокаОперации);
			Если ТекОперация.КС Тогда
				СтрокаКС = Макет.ПолучитьОбласть("СтрокаКС");
				ТабДок.Присоединить(СтрокаКС);
			Иначе
				СтрокаКС = Макет.ПолучитьОбласть("СтрокаКСНет");
				ТабДок.Присоединить(СтрокаКС);
			КонецЕсли;
			Если ТекОперация.ТО  Тогда
				СтрокаТО = Макет.ПолучитьОбласть("СтрокаТО");
				ТабДок.Присоединить(СтрокаТО);
			Иначе
				СтрокаТО = Макет.ПолучитьОбласть("СтрокаТОНет");
				ТабДок.Присоединить(СтрокаТО);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого ОписаниеГруппы Из МассивОписанияГрупп Цикл
		Область = ТабДок.Область(ОписаниеГруппы.НомерСтрокиНачалаГруппы,
								ОписаниеГруппы.НачальнаяКолонкаГруппы,
								ОписаниеГруппы.НомерСтрокиНачалаГруппы + ОписаниеГруппы.КоличествоВГруппе - 1,
								ОписаниеГруппы.НачальнаяКолонкаГруппы + ОписаниеГруппы.ШиринаЯчейкиГруппы);
		Область.Объединить();
		Область.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьНижнийКолонтикул(ТабДок, Макет, КоличествоСтрок)
	
	ПустаяСтрока = Макет.получитьОбласть("ПустаяСтрока");
	КонецРамки = Макет.ПолучитьОбласть("КонецРамки");
	НижнийКолонтикул = Макет.ПолучитьОбласть("НижнийКолонтикул");
	Если КоличествоСтрок > 0 Тогда
		Для Тек = 1 по КоличествоСтрок + 1 Цикл
			ТабДок.вывести(ПустаяСтрока);
		КонецЦикла;
	КонецЕсли;
	ТабДок.вывести(КонецРамки);
	ТабДок.вывести(НижнийКолонтикул);
		
КонецПроцедуры

Процедура ЗаполнитьПоОбращению(ДокОбращения) Экспорт
	
	Работы.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Renault_CRM_ЗаявкаНаСервис.ЗаказНаряд.Ссылка КАК Сслыка
	               |ПОМЕСТИТЬ ЗаказНаряды
	               |ИЗ
	               |	Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
	               |ГДЕ
	               |	Renault_CRM_ЗаявкаНаСервис.Обращение = &Обращение
	               |	И Renault_CRM_ЗаявкаНаСервис.ЗаказНаряд.ПометкаУдаления = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗаказНарядРаботы.Работа КАК Ссылка
	               |ИЗ
	               |	ЗаказНаряды КАК ЗаказНаряды
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
	               |		ПО ЗаказНаряды.Сслыка = ЗаказНарядРаботы.Ссылка
	               |ГДЕ
	               |	НЕ ЗаказНарядРаботы.Работа ЕСТЬ NULL ";
				   
	Запрос.УстановитьПараметр("Обращение", ДокОбращения);
	РаботыЗаказНарядов = Запрос.Выполнить().Выгрузить();
	//МассивВыполненыхРабот = РаботыЗаказНарядов.ВыгрузитьКолонку("Ссылка");
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_CRM_ПриемкаАвтомобиля.Ссылка  КАК Ссылка
	               |ИЗ
	               |	Документ.Renault_CRM_ПриемкаАвтомобиля КАК Renault_CRM_ПриемкаАвтомобиля
	               |ГДЕ
	               |	Renault_CRM_ПриемкаАвтомобиля.Обращение = &Обращение";
				   
	Запрос.УстановитьПараметр("Обращение", ДокОбращения);
	ТаблицаДокиПриемки = Запрос.Выполнить().Выгрузить();
	МассивПриемок = ТаблицаДокиПриемки.ВыгрузитьКолонку("Ссылка");
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_ПоврежденияАвтомобилей.Работа,
	               |	Renault_ПоврежденияАвтомобилей.ПроизвольноеОписание,
	               |	Renault_ПоврежденияАвтомобилей.Цвет,
	               |	Renault_ПоврежденияАвтомобилей.ПроцентИзноса,
	               |	Renault_ПоврежденияАвтомобилей.Важность,
	               |	Renault_ПоврежденияАвтомобилей.РекомендуемаяДатаВыполнения
	               |ИЗ
	               |	РегистрСведений.Renault_ПоврежденияАвтомобилей КАК Renault_ПоврежденияАвтомобилей
	               |ГДЕ
	               |	Renault_ПоврежденияАвтомобилей.РаботаАктуальна = ИСТИНА
	               |	И Renault_ПоврежденияАвтомобилей.Автомобиль = &Автомобиль
	               |	И Renault_ПоврежденияАвтомобилей.Регистратор В(&Регистраторы)";
	Запрос.УстановитьПараметр("Автомобиль", ДокОбращения.Автомобиль);
	Запрос.УстановитьПараметр("Регистраторы", МассивПриемок);
	ТаблицаРабот  = Запрос.Выполнить().Выгрузить();
	Для Каждого Описание Из ТаблицаРабот Цикл
		Поиск = РаботыЗаказНарядов.Найти(Описание.Работа,"Ссылка");
		Если Поиск = Неопределено Тогда 
			Нов = Работы.Добавить();
			ЗаполнитьЗначенияСвойств(Нов,Описание);
		КонецЕсли;
		
	КонецЦикла;
	Дата = ТекущаяДата();
	ДилерскийЦентр = ДокОбращения.ДилерскийЦентр;
	Клиент = ДокОбращения.Клиент;
	Автомобиль = ДокОбращения.Автомобиль;
	Основание = ДокОбращения.Ссылка;
	Обращение = ДокОбращения.Ссылка;
	
КонецПроцедуры

Функция ПолучитьРаботыИзРегистра() Экспорт
	
	ВыборкаРег = РегистрыСведений.Renault_ПоврежденияАвтомобилей.ВыбратьПоРегистратору(Ссылка);
	РаботыДокумента = Новый Массив;
	Пока ВыборкаРег.Следующий() Цикл
		РаботыДокумента.Добавить(ВыборкаРег.Работа);
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ПоврежденияАвтомобилейСрезПоследних.Работа,
	|	Renault_ПоврежденияАвтомобилейСрезПоследних.РаботаАктуальна,
	|	Renault_ПоврежденияАвтомобилейСрезПоследних.Важность,
	|	Renault_ПоврежденияАвтомобилейСрезПоследних.Автомобиль,
	|	Renault_ПоврежденияАвтомобилейСрезПоследних.Цвет,
	|	Renault_ПоврежденияАвтомобилейСрезПоследних.РекомендуемаяДатаВыполнения,
	|	Renault_ПоврежденияАвтомобилейСрезПоследних.ПроцентИзноса,
	|	Renault_ПоврежденияАвтомобилейСрезПоследних.Период КАК ДатаВыдачиРекомендации
	|ИЗ
	|	РегистрСведений.Renault_ПоврежденияАвтомобилей.СрезПоследних(&Период, Автомобиль = &Автомобиль) КАК Renault_ПоврежденияАвтомобилейСрезПоследних
	|ГДЕ
	|	Renault_ПоврежденияАвтомобилейСрезПоследних.РаботаАктуальна = ИСТИНА
	|	И НЕ Renault_ПоврежденияАвтомобилейСрезПоследних.Работа В (&РаботыДокумента)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Renault_ПоврежденияАвтомобилей.Работа,
	|	Renault_ПоврежденияАвтомобилей.РаботаАктуальна,
	|	Renault_ПоврежденияАвтомобилей.Важность,
	|	Renault_ПоврежденияАвтомобилей.Автомобиль,
	|	Renault_ПоврежденияАвтомобилей.Цвет,
	|	Renault_ПоврежденияАвтомобилей.РекомендуемаяДатаВыполнения,
	|	Renault_ПоврежденияАвтомобилей.ПроцентИзноса,
	|	Renault_ПоврежденияАвтомобилей.Период
	|ИЗ
	|	РегистрСведений.Renault_ПоврежденияАвтомобилей КАК Renault_ПоврежденияАвтомобилей
	|ГДЕ
	|	Renault_ПоврежденияАвтомобилей.Регистратор = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("РаботыДокумента", РаботыДокумента);
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Если ЭтоНовый() Тогда
		Запрос.УстановитьПараметр("Период", ТекущаяДата()-1);
	Иначе
		Запрос.УстановитьПараметр("Период", Дата-1);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Автор) Тогда
		Автор = ПараметрыСеанса.Пользователь;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДатуСертификата(ДокСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_CRM_ВыдачаАвтомобиля.ВремяОкончания
	|ИЗ
	|	Документ.Renault_CRM_ВыдачаАвтомобиля КАК Renault_CRM_ВыдачаАвтомобиля
	|ГДЕ
	|	Renault_CRM_ВыдачаАвтомобиля.Обращение = &Обращение
	|	И Renault_CRM_ВыдачаАвтомобиля.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Обращение", ДокСсылка.Обращение);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ВремяОкончания) Тогда
		Возврат Выборка.ВремяОкончания;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокСсылка.ЗаказНаряд) Тогда
		Возврат ДокСсылка.ЗаказНаряд.Дата;
	КонецЕсли;
	
	Возврат ДокСсылка.Дата;
	
КонецФункции

Процедура ЗаполнитьПереченьОпераций() Экспорт

	ПереченьОпераций.Очистить();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	DMS_ПереченьОперацийКСиТО.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.DMS_ПереченьОперацийКСиТО КАК DMS_ПереченьОперацийКСиТО
		|ГДЕ
		|	НЕ DMS_ПереченьОперацийКСиТО.ПометкаУдаления
		|	И НЕ DMS_ПереченьОперацийКСиТО.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПереченьОпераций.Добавить().Операция = Выборка.Ссылка;
	КонецЦикла;
	           
КонецПроцедуры

Функция ПечатьПланшет(ДокСсылка) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ПолеСправа = 50;
	Макет = ПолучитьМакет("СертификатКонтроляПланшет");
	ПустаяСтрока = Макет.получитьОбласть("ПустаяСтрока");
	КонецРамки = Макет.ПолучитьОбласть("КонецРамки");
	НижнийКолонтикул = Макет.ПолучитьОбласть("НижнийКолонтикул");
	ЧислоДобавленных = 0;
	ДобавитьГлавнуюСтраницуПланшет(ТабДок, ДокСсылка, Макет, ЧислоДобавленных);
	
	//ДобавитьНижнийКолонтикул(ТабДок, Макет, 11 - ЧислоДобавленных);
	//ДобавитьНижнийКолонтикул(ТабДок, Макет, 1);
	
	ТабДок1 = Новый ТабличныйДокумент;
	ТабДок1.ПолеСлева = 50;
	
	ДобавитьСтраницыПеречняОперацийПланшет(ТабДок1, ДокСсылка, Макет, Истина);
	//ТабДок1.Вывести(КонецРамки);
	
	ДобавитьНижнийКолонтикул(ТабДок1, Макет, 1);
	
	ИтоговыйТабДок = Новый ТабличныйДокумент;
	ИтоговыйТабДок.МасштабПечати = 50;
	ИтоговыйТабДок.СохранятьСвойстваОтображения = Истина;
	ИтоговыйТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ИтоговыйТабДок.Присоединить(ТабДок);
	ИтоговыйТабДок.Присоединить(ТабДок1);
	
	Возврат ИтоговыйТабДок;//ТабДок;
	
КонецФункции


Процедура ДобавитьГлавнуюСтраницуПланшет(ТабДок, ДокСсылка, Макет, ЧислоДобавленных)

	Отбор = Новый Структура();
	Отбор.Вставить("Цвет", Перечисления.Renault_ЦветаСертификатаКонтроля.Красный);
	Отбор.Вставить("РаботаАктуальна", Истина);
	СписокВажныхРабот = ДокСсылка.Работы.НайтиСтроки(Отбор);
	
	Отбор = Новый Структура();
	Отбор.Вставить("Цвет", Перечисления.Renault_ЦветаСертификатаКонтроля.Желтый);
	Отбор.Вставить("РаботаАктуальна", Истина);
	СписокВторичныхРабот = ДокСсылка.Работы.НайтиСтроки(Отбор);
	
	ПустаяСтрока = Макет.получитьОбласть("ПустаяСтрока");
	КонецРамки = Макет.ПолучитьОбласть("КонецРамки");
	НижнийКолонтикул = Макет.ПолучитьОбласть("НижнийКолонтикул");
	ОбластьШапки = Макет.ПолучитьОбласть("ШапкаСертификата");
	ОбластьШапки.Параметры.ДатаСертификата = Формат(ПолучитьДатуСертификата(ДокСсылка), "ДФ=""дд/ММ/гггг""");//Формат(ДокСсылка.Дата, "ДФ=""дд/ММ/гггг""");
	ОбластьШапки.параметры.Клиент = Строка(ДокСсылка.Клиент);
	ОбластьШапки.Параметры.НомерЗН = Строка(ДокСсылка.ЗаказНаряд.Номер);
	ОбластьШапки.Параметры.Емаил = Renault_CRM.ПолучитьЕмаилКлиент(ДокСсылка.Клиент);
	ОбластьШапки.Параметры.ГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ДокСсылка.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
	ОбластьШапки.Параметры.Модель = Строка(ДокСсылка.Автомобиль.Модель);
	ОбластьШапки.Параметры.Телефон = Renault_CRM.ПолучитьТелефонКлиент(ДокСсылка.Клиент);
	
	ДатаСледующегоТО = РегистрыСведений.Renault_ВыполнениеТО.ПолучитьПоследнийТО(ДокСсылка.Автомобиль);
	
	Если ЗначениеЗаполнено(ДатаСледующегоТО) Тогда
		
		ОбластьШапки.Параметры.ДатаСледующегоТО = Формат(ДатаСледующегоТО, "ДФ=dd.MM.yyyy");
		
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьШапки);
	ОбластьШапкаРаботыПервойНеобходимости = Макет.ПолучитьОбласть("ШапкаРаботыПервойНеобходимости");
	ТабДок.Вывести(ОбластьШапкаРаботыПервойНеобходимости);
	
	Для Каждого РаботаПервойНеобходимости Из СписокВажныхРабот Цикл
		
		Если НЕ ЗначениеЗаполнено(РаботаПервойНеобходимости.Работа) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		СтрокаРаботПервойНеобходимости = Макет.ПолучитьОбласть("СтрокаРаботПервойНеобходимости");
		СтрокаРаботПервойНеобходимости.Параметры.Работа = ?(ТипЗнч(РаботаПервойНеобходимости.Работа) = Тип("Строка"), РаботаПервойНеобходимости.Работа, РаботаПервойНеобходимости.Работа.Наименование);
		СтрокаРаботПервойНеобходимости.Параметры.Износ = РаботаПервойНеобходимости.ПроцентИзноса;
		СтрокаРаботПервойНеобходимости.Параметры.ДатаВыполн = ?(ЗначениеЗаполнено(РаботаПервойНеобходимости.РекомендуемаяДатаВыполнения), РаботаПервойНеобходимости.РекомендуемаяДатаВыполнения,"");
		ТабДок.Вывести(СтрокаРаботПервойНеобходимости);
		ЧислоДобавленных = ЧислоДобавленных + 1;
	КонецЦикла;
	ШапкаРаботыВторойНеобходимости = Макет.ПолучитьОбласть("ШапкаРаботыВторойНеобходимости");
	ТабДок.Вывести(ШапкаРаботыВторойНеобходимости);
	Для Каждого РаботаВторойНеобходимости Из СписокВторичныхРабот Цикл
		
		Если НЕ ЗначениеЗаполнено(РаботаВторойНеобходимости.Работа) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		СтрокаРаботВторойНеобходимости = Макет.ПолучитьОбласть("СтрокаРаботВторойНеобходимости");
		СтрокаРаботВторойНеобходимости.Параметры.Работа = ?(ТипЗнч(РаботаВторойНеобходимости.Работа) = Тип("Строка"), РаботаВторойНеобходимости.Работа, РаботаВторойНеобходимости.Работа.Наименование);
		СтрокаРаботВторойНеобходимости.Параметры.Износ = РаботаВторойНеобходимости.ПроцентИзноса;
		СтрокаРаботВторойНеобходимости.Параметры.ДатаВыполн = ?(ЗначениеЗаполнено(РаботаВторойНеобходимости.РекомендуемаяДатаВыполнения),РаботаВторойНеобходимости.РекомендуемаяДатаВыполнения,"");
		ТабДок.Вывести(СтрокаРаботВторойНеобходимости);
		ЧислоДобавленных = ЧислоДобавленных + 1;
	КонецЦикла;
	
	
	ШапкаРабот = Макет.ПолучитьОбласть("ШапкаРабот");
	ТабДок.Вывести(ШапкаРабот);

	СтрокаРабот = Макет.ПолучитьОбласть("СтрокаРабот");
	
	ДокККР = Документы.DMS_КонтрольКачестваРабот.ПолучитьККРПоОбращению(ДокСсылка.Обращение);
	Если ДокККР = Документы.DMS_КонтрольКачестваРабот.ПустаяСсылка() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНарядРаботы.Ссылка КАК Ссылка,
		|	ЗаказНарядРаботы.Работа КАК НаименованиеРаботы,
		|	ЗаказНарядРаботы.Работа.Артикул КАК Артикул,
		|	ЗаказНарядИсполнители.Исполнитель КАК Исполнитель,
		|	ЗаказНарядРаботы.Ссылка.Состояние КАК Состояние,
		|	ЗаказНарядРаботы.Ссылка.Номер КАК Номер,
		|	ЗаказНарядРаботы.Ссылка.Дата КАК Дата,
		|	ЗаказНарядРаботы.ИдентификаторРаботы КАК ИдентификаторРаботы,
		|	ЗаказНарядРаботы.ПримечаниеРаботы КАК Комментарий,
		|	ЗаказНарядРаботы.Ссылка.Комментарий КАК КомментарийПричина,
		|	ИСТИНА КАК Проверка,
		|	""Готово"" КАК Результат
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Исполнители КАК ЗаказНарядИсполнители
		|		ПО ЗаказНарядРаботы.ИдентификаторРаботы = ЗаказНарядИсполнители.ИдентификаторРаботы
		|ГДЕ
		|	ЗаказНарядРаботы.Ссылка В
		|			(ВЫБРАТЬ
		|				Renault_CRM_ЗаявкаНаСервис.ЗаказНаряд КАК ЗаказНаряд
		|			ИЗ
		|				Документ.Renault_СертификатКонтроля КАК Renault_СертификатКонтроля
		|					ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
		|					ПО
		|						Renault_СертификатКонтроля.Обращение = Renault_CRM_ЗаявкаНаСервис.Обращение
		|			ГДЕ
		|				Renault_СертификатКонтроля.Ссылка = &Ссылка)";
		
		Запрос.УстановитьПараметр("Ссылка", ДокСсылка.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		КомментарийЗаказНаряда = "";
		ПервыйПроход = Истина;
		
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(СтрокаРабот.Параметры,Выборка);
			СтрокаРабот.Параметры.Исполнитель	= ПолучитьФИОИнициалы(СтрокаРабот.Параметры.Исполнитель);
			ТабДок.Вывести(СтрокаРабот);
			Если ПервыйПроход Тогда
				КомментарийЗаказНаряда = Выборка.КомментарийПричина;
				ПервыйПроход = Ложь;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого ОписаниеРаботы Из ДокККР.ВыполненныеРаботы Цикл
			ЗаполнитьЗначенияСвойств(СтрокаРабот.Параметры,ОписаниеРаботы);
		    СтрокаРабот.Параметры.НаименованиеРаботы = ОписаниеРаботы.Работа;
			СтрокаРабот.Параметры.Исполнитель	= ПолучитьФИОИнициалы(СтрокаРабот.Параметры.Исполнитель);
			СтрокаРабот.Параметры.Результат			 = ОписаниеРаботы.Статус;
			ТабДок.Вывести(СтрокаРабот);
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказНаряд.Ссылка КАК Ссылка,
		|	ЗаказНаряд.Номер КАК Номер,
		|	ЗаказНаряд.Дата КАК Дата,
		|	ЗаказНаряд.Комментарий КАК Комментарий
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|ГДЕ
		|	ЗаказНаряд.Ссылка В
		|			(ВЫБРАТЬ
		|				Renault_CRM_ЗаявкаНаСервис.ЗаказНаряд КАК ЗаказНаряд
		|			ИЗ
		|				Документ.Renault_СертификатКонтроля КАК Renault_СертификатКонтроля
		|					ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
		|					ПО
		|						Renault_СертификатКонтроля.Обращение = Renault_CRM_ЗаявкаНаСервис.Обращение
		|			ГДЕ
		|				Renault_СертификатКонтроля.Ссылка = &Ссылка)";
		
		Запрос.УстановитьПараметр("Ссылка", ДокСсылка.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаРаботы = РезультатЗапроса.Выбрать();
		Если ВыборкаРаботы.Следующий() Тогда
			КомментарийЗаказНаряда = ВыборкаРаботы.Комментарий;
		КонецЕсли;
	КонецЕсли;
	Приемка = Документы.Renault_CRM_ПриемкаАвтомобиля.НайтиПоРеквизиту("Обращение",ДокСсылка.Обращение);

	ШапкаПричинаОбращения = Макет.ПолучитьОбласть("ШапкаПричинаОбращения");
	
	ШапкаПричинаОбращения.Параметры.НаименованиеПричины	= ?(ЗначениеЗаполнено(ДокСсылка.Обращение.Примечание),ДокСсылка.Обращение.Примечание,"Отсутствует");
	ШапкаПричинаОбращения.Параметры.Проверка = Истина;			
	ШапкаПричинаОбращения.Параметры.Исполнитель	= ПолучитьФИОИнициалы(Приемка.Машиноместо);		
	ШапкаПричинаОбращения.Параметры.Результат = "Готово";				
	ШапкаПричинаОбращения.Параметры.Комментарий = КомментарийЗаказНаряда;						
																											
	ТабДок.Вывести(ШапкаПричинаОбращения);
	
КонецПроцедуры

Процедура ДобавитьСтраницыПеречняОперацийПланшет(ТабДок, ДокСсылка, Макет, ПроставлятьКартинки = Ложь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	DMS_ПереченьОперацийКСиТО.Ссылка КАК Родитель
	|ИЗ
	|	Справочник.DMS_ПереченьОперацийКСиТО КАК DMS_ПереченьОперацийКСиТО
	|ГДЕ
	|	DMS_ПереченьОперацийКСиТО.ЭтоГруппа";
	Группы = Запрос.Выполнить().Выгрузить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_СертификатКонтроляПереченьОпераций.Операция.Родитель КАК Группа,
	|	Renault_СертификатКонтроляПереченьОпераций.Операция КАК Наименование,
	|	Renault_СертификатКонтроляПереченьОпераций.Операция.КС КАК КС,
	|	Renault_СертификатКонтроляПереченьОпераций.Операция.ТО КАК ТО,
	|	Renault_СертификатКонтроляПереченьОпераций.КС КАК ЗначениеКС,
	|	Renault_СертификатКонтроляПереченьОпераций.ТО КАК ЗначениеТО
	|ИЗ
	|	Документ.Renault_СертификатКонтроля.ПереченьОпераций КАК Renault_СертификатКонтроляПереченьОпераций
	|ГДЕ
	|	Renault_СертификатКонтроляПереченьОпераций.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",ДокСсылка.Ссылка);
	Операции = Запрос.Выполнить().Выгрузить();
	ШапкаРекомендованныеРаботы = Макет.ПолучитьОбласть("ШапкаРекомендованныеРаботы");
	ШапкаРекомендованныеРаботы.Параметры.Пробег = Renault_АвтосервисОбщий.Renault_ПолучитьПробег(ДокСсылка.Автомобиль);
	
	ТабДок.Присоединить(ШапкаРекомендованныеРаботы);
	НачалоОпераций = Макет.ПолучитьОбласть("НачалоОпераций");
	ТабДок.Вывести(НачалоОпераций);
	ШапкаОпераций = Макет.ПолучитьОбласть("ШапкаОпераций");
	ТабДок.Вывести(ШапкаОпераций);
	МассивОписанияГрупп = Новый Массив;
	
	Для Каждого Группа из Группы Цикл
		
		Отбор = Новый Структура();
		Отбор.Вставить("Группа", Группа.Родитель);
		ОперацииГруппы = Операции.НайтиСтроки(Отбор);
		ОписаниеГруппы = Новый Структура();
		ОписаниеГруппы.Вставить("НомерСтрокиНачалаГруппы", ТабДок.ВысотаТаблицы+1);
		ОписаниеГруппы.Вставить("КоличествоВГруппе", ОперацииГруппы.Количество());
		ОписаниеГруппы.Вставить("ШиринаЯчейкиГруппы", 6);
		ОписаниеГруппы.Вставить("НачальнаяКолонкаГруппы", 2);
		МассивОписанияГрупп.Добавить(ОписаниеГруппы);
		//ТабДок.Вывести(СтрокаГруппы);
		
		Для Каждого ТекОперация Из ОперацииГруппы Цикл
			
			СтрокаОперации = Макет.ПолучитьОбласть("СтрокаОпераций");
			СтрокаОперации.Параметры.Операция = ТекОперация.Наименование;
			СтрокаОперации.Параметры.Группа = Группа.Родитель;
			ТабДок.Вывести(СтрокаОперации);
			Если ТекОперация.КС Тогда
				СтрокаКС = Макет.ПолучитьОбласть("СтрокаКС");
				Если ТекОперация.ЗначениеКС И ПроставлятьКартинки Тогда
					СтрокаКС.Области["ЗначениеКС"].Картинка = БиблиотекаКартинок.Renault_Chek;
				КонецЕсли;
				ТабДок.Присоединить(СтрокаКС);
			Иначе
				СтрокаКС = Макет.ПолучитьОбласть("СтрокаКСНет");
				ТабДок.Присоединить(СтрокаКС);
			КонецЕсли;
			Если ТекОперация.ТО  Тогда
				СтрокаТО = Макет.ПолучитьОбласть("СтрокаТО");
				Если ТекОперация.ЗначениеТО И ПроставлятьКартинки Тогда
					СтрокаТО.Области["ЗначениеТО"].Картинка = БиблиотекаКартинок.Renault_Chek;
				КонецЕсли;
				ТабДок.Присоединить(СтрокаТО);
			Иначе
				СтрокаТО = Макет.ПолучитьОбласть("СтрокаТОНет");
				ТабДок.Присоединить(СтрокаТО);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого ОписаниеГруппы Из МассивОписанияГрупп Цикл
		Область = ТабДок.Область(ОписаниеГруппы.НомерСтрокиНачалаГруппы,
								ОписаниеГруппы.НачальнаяКолонкаГруппы,
								ОписаниеГруппы.НомерСтрокиНачалаГруппы + ОписаниеГруппы.КоличествоВГруппе - 1,
								ОписаниеГруппы.НачальнаяКолонкаГруппы + ОписаниеГруппы.ШиринаЯчейкиГруппы);
		Область.Объединить();
		Область.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьФИОИнициалы(Сотрудник)
	
	если не ЗначениеЗаполнено(Сотрудник) тогда
		возврат "";
	КонецЕсли;
	
	ФИО = СтрЗаменить(строка(Сотрудник), " ", Символы.ПС);
	Фамилия = СтрПолучитьСтроку(Фио,1);
	Имя = СтрПолучитьСтроку(Фио,2);
	Отчество = СтрПолучитьСтроку(Фио,3);
	
	возврат Фамилия + ?(ЗначениеЗаполнено(Имя)," " + Лев(Имя,1) + ".", "") + ?(ЗначениеЗаполнено(Отчество)," " + Лев(Отчество,1) + ".", "");
	
КонецФункции

