Функция ПолучитьБСОВОрганизации() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_БСОВОрганизацииОстатки.ТипБСО,
	               |	Renault_БСОВОрганизацииОстатки.СерияБСО,
	               |	Renault_БСОВОрганизацииОстатки.НомерБСО,
	               |	Renault_БСОВОрганизацииОстатки.СтраховаяКомпания,
	               |	ВЫБОР
	               |		КОГДА Renault_СтатусыБСОСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.Renault_СтатусыБСО.ПринятИзСК)
	               |				ИЛИ Renault_СтатусыБСОСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.Renault_СтатусыБСО.ПереданНаТочку)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.Renault_СтатусыБСО.Чистый)
	               |		ИНАЧЕ Renault_СтатусыБСОСрезПоследних.Статус
	               |	КОНЕЦ КАК Статус,
	               |	Renault_СтатусыБСОСрезПоследних.Период,
	               |	ВЫБОР
	               |		КОГДА НЕ Renault_СтраховыеПолисы.СтраховаяКомпания ЕСТЬ NULL 
	               |				ИЛИ НЕ Renault_КвитанцииКПолисам.СтраховаяКомпания ЕСТЬ NULL 
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Использован
	               |ИЗ
	               |	РегистрНакопления.Renault_БСОВОрганизации.Остатки(, Организация = &Организация) КАК Renault_БСОВОрганизацииОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_СтатусыБСО.СрезПоследних(, Организация = &Организация) КАК Renault_СтатусыБСОСрезПоследних
	               |		ПО Renault_БСОВОрганизацииОстатки.Организация = Renault_СтатусыБСОСрезПоследних.Организация
	               |			И Renault_БСОВОрганизацииОстатки.СтраховаяКомпания = Renault_СтатусыБСОСрезПоследних.СтраховаяКомпания
	               |			И Renault_БСОВОрганизацииОстатки.ТипБСО = Renault_СтатусыБСОСрезПоследних.ТипБСО
	               |			И Renault_БСОВОрганизацииОстатки.СерияБСО = Renault_СтатусыБСОСрезПоследних.СерияБСО
	               |			И Renault_БСОВОрганизацииОстатки.НомерБСО = Renault_СтатусыБСОСрезПоследних.НомерБСО
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Renault_СтраховыеПолисы КАК Renault_СтраховыеПолисы
	               |		ПО Renault_БСОВОрганизацииОстатки.Организация = Renault_СтраховыеПолисы.Организация
	               |			И Renault_БСОВОрганизацииОстатки.СерияБСО = Renault_СтраховыеПолисы.СерияБСО
	               |			И Renault_БСОВОрганизацииОстатки.НомерБСО = Renault_СтраховыеПолисы.НомерБСО
	               |			И Renault_БСОВОрганизацииОстатки.СтраховаяКомпания = Renault_СтраховыеПолисы.СтраховаяКомпания
	               |			И Renault_БСОВОрганизацииОстатки.ТипБСО = Renault_СтраховыеПолисы.ТипБСО
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КвитанцииКПолисам КАК Renault_КвитанцииКПолисам
	               |		ПО Renault_БСОВОрганизацииОстатки.СтраховаяКомпания = Renault_КвитанцииКПолисам.СтраховаяКомпания
	               |			И Renault_БСОВОрганизацииОстатки.ТипБСО = Renault_КвитанцииКПолисам.ТипБСО
	               |			И Renault_БСОВОрганизацииОстатки.СерияБСО = Renault_КвитанцииКПолисам.СерияБСО
	               |			И Renault_БСОВОрганизацииОстатки.НомерБСО = Renault_КвитанцииКПолисам.НомерБСО";
				   
	Возврат Запрос.Выполнить().Выгрузить();			   
	
КонецФункции

Процедура ЗаполнитьДокумент(ДокументОбъект, МассивСтрок) Экспорт
	
	ДокументОбъект.ТочкаПродаж = ТочкаПродаж;
	ДокументОбъект.Организация = Организация;
	
	Для Каждого Строка Из МассивСтрок Цикл
		НоваяСтрока = ДокументОбъект.БСО.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.НомерБСОНач = Строка.НомерБСО;
		НоваяСтрока.Количество = 1;
	КонецЦикла;	
	
КонецПроцедуры	

Функция ПолучитьБСОНаТочке() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТочкаПродаж", ТочкаПродаж);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_БСОНаТочкеПродажОстатки.ТипБСО,
	               |	Renault_БСОНаТочкеПродажОстатки.СерияБСО,
	               |	Renault_БСОНаТочкеПродажОстатки.НомерБСО,
	               |	Renault_БСОНаТочкеПродажОстатки.СтраховаяКомпания,
	               |	ВЫБОР
	               |		КОГДА Renault_СтатусыБСОСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.Renault_СтатусыБСО.ПринятИзСК)
	               |				ИЛИ Renault_СтатусыБСОСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.Renault_СтатусыБСО.ПереданНаТочку)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.Renault_СтатусыБСО.Чистый)
	               |		ИНАЧЕ Renault_СтатусыБСОСрезПоследних.Статус
	               |	КОНЕЦ КАК Статус,
	               |	Renault_СтатусыБСОСрезПоследних.Период,
	               |	ВЫБОР
	               |		КОГДА НЕ Renault_СтраховыеПолисы.СтраховаяКомпания ЕСТЬ NULL 
	               |				ИЛИ НЕ Renault_КвитанцииКПолисам.СтраховаяКомпания ЕСТЬ NULL 
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Использован
	               |ИЗ
	               |	РегистрНакопления.Renault_БСОНаТочкеПродаж.Остатки(
	               |			,
	               |			Организация = &Организация
	               |				И ТочкаПродаж = &ТочкаПродаж) КАК Renault_БСОНаТочкеПродажОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_СтатусыБСО.СрезПоследних(, Организация = &Организация) КАК Renault_СтатусыБСОСрезПоследних
	               |		ПО Renault_БСОНаТочкеПродажОстатки.Организация = Renault_СтатусыБСОСрезПоследних.Организация
	               |			И Renault_БСОНаТочкеПродажОстатки.СтраховаяКомпания = Renault_СтатусыБСОСрезПоследних.СтраховаяКомпания
	               |			И Renault_БСОНаТочкеПродажОстатки.ТипБСО = Renault_СтатусыБСОСрезПоследних.ТипБСО
	               |			И Renault_БСОНаТочкеПродажОстатки.СерияБСО = Renault_СтатусыБСОСрезПоследних.СерияБСО
	               |			И Renault_БСОНаТочкеПродажОстатки.НомерБСО = Renault_СтатусыБСОСрезПоследних.НомерБСО
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Renault_СтраховыеПолисы КАК Renault_СтраховыеПолисы
	               |		ПО Renault_БСОНаТочкеПродажОстатки.СтраховаяКомпания = Renault_СтраховыеПолисы.СтраховаяКомпания
	               |			И Renault_БСОНаТочкеПродажОстатки.ТипБСО = Renault_СтраховыеПолисы.ТипБСО
	               |			И Renault_БСОНаТочкеПродажОстатки.СерияБСО = Renault_СтраховыеПолисы.СерияБСО
	               |			И Renault_БСОНаТочкеПродажОстатки.НомерБСО = Renault_СтраховыеПолисы.НомерБСО
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КвитанцииКПолисам КАК Renault_КвитанцииКПолисам
	               |		ПО Renault_БСОНаТочкеПродажОстатки.СтраховаяКомпания = Renault_КвитанцииКПолисам.СтраховаяКомпания
	               |			И Renault_БСОНаТочкеПродажОстатки.ТипБСО = Renault_КвитанцииКПолисам.ТипБСО
	               |			И Renault_БСОНаТочкеПродажОстатки.СерияБСО = Renault_КвитанцииКПолисам.СерияБСО
	               |			И Renault_БСОНаТочкеПродажОстатки.НомерБСО = Renault_КвитанцииКПолисам.НомерБСО";
				   
	Возврат Запрос.Выполнить().Выгрузить();			   
	
КонецФункции

Процедура ЗаполнитьСтраховойПолис(ДокументОбъект, ДанныеЗаполнения) Экспорт
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект, ДанныеЗаполнения);
	
КонецПроцедуры	
