
Функция ПолучитьПриемкуПоОбращению(Обращение) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Renault_CRM_ПриемкаАвтомобиля.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Renault_CRM_ПриемкаАвтомобиля КАК Renault_CRM_ПриемкаАвтомобиля
	|ГДЕ
	|	Renault_CRM_ПриемкаАвтомобиля.Обращение = &Обращение";
	
	Запрос.УстановитьПараметр("Обращение", Обращение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Документы.Renault_CRM_ПриемкаАвтомобиля.СоздатьДокумент().Ссылка;
	
	
КонецФункции
