
&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Объект.Период = ПолучитьДатуПериода (Объект.Период);
КонецПроцедуры

&НаКлиенте
функция ПолучитьДатуПериода (ДатаПериода);
	Если Объект.ТипПериода = ПредопределенноеЗначение("Перечисление.Renault_ТипыПериода.Неделя") Тогда 
		Возврат НачалоНедели(ДатаПериода);
	ИначеЕсли Объект.ТипПериода = ПредопределенноеЗначение("Перечисление.Renault_ТипыПериода.Месяц") Тогда
		Возврат НачалоМесяца(ДатаПериода);
	ИначеЕсли Объект.ТипПериода = ПредопределенноеЗначение("Перечисление.Renault_ТипыПериода.Квартал") Тогда
		Возврат НачалоКвартала(ДатаПериода);
	ИначеЕсли Объект.ТипПериода = ПредопределенноеЗначение("Перечисление.Renault_ТипыПериода.Год") Тогда
		Возврат НачалоГода(ДатаПериода);
	Иначе
		Возврат Дата(1,1,1);
	КонецЕсли;
КонецФункции
