Процедура ЗаполнитьОбновитьСправочник() Экспорт 
	
	Макет = ПолучитьМакет("ДанныеДляЗаполнения");
	Таблица = Renault_АвтосервисОбщий.Renault_МакетВТаблицуЗначений(Макет,,Истина);
	
	Для Каждого Строка ИЗ Таблица Цикл
		
		Если ЗначениеЗаполнено(Справочники.Renault_ХоббиКлиента.НайтиПоНаименованию(Строка.Наименование)) Тогда
			
			Продолжить;
			
		Иначе
			
			НовыйЭлемент = Справочники.Renault_ХоббиКлиента.СоздатьЭлемент();
			НовыйЭлемент.Наименование = Строка.Наименование;
			
			НовыйЭлемент.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры