&НаКлиенте
Перем Почта;

#Область ОбработкаСобытий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("email") Тогда
		email=Параметры.email;
	Иначе
		Отказ=Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	поз=Найти(email,"@");
	Если поз<2 тогда Отказ=Истина;Возврат;КонецЕсли;
	//userName=Лев(email,поз-1);
	//server=сред(email,поз+1);
	ВладелецФормы.ФормыПАВставить("ПочтаНастройкаУФ",ЭтаФорма);
	ЭтаФорма.ЗакрыватьПриЗакрытииВладельца=Истина;
	Запрос="{""action"":""getEmail"", ""schema"":""mail"",""email"":"""+email+"""}";
	//, ""userName"": """+userName+""", ""server"": """+server+"""}";
	ВладелецФормы.СендерОтправить(Запрос);
	
	Запрос="{""action"":""getMailServer"", ""schema"":""mail""}";
	ВладелецФормы.СендерОтправить(Запрос);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Если ПочтаПодключена Тогда
		Почта.Отключиться();
	КонецЕсли;
	ВладелецФормы.ФормыПАУдалить("ПочтаНастройкаУФ");
КонецПроцедуры

&НаКлиенте
Процедура mailServerОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(ЭтаФорма,ВыбранноеЗначение, "imapServer,imapPort,smtpServer,smtpPort,pop3Server,pop3Port,isSSL,mailServer");
	Стандартнаяобработка=Ложь;
	
КонецПроцедуры


&НаКлиенте
Процедура mailServerОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Для каждого Стр из Элементы.mailServer.СписокВыбора Цикл
		Если Текст=Стр.Представление Тогда
			ЗаполнитьЗначенияСвойств(ЭтаФорма,Стр.Значение, "imapServer,imapPort,smtpServer,smtpPort,pop3Server,pop3Port,isSSL");
			Прервать;	
		КонецЕсли;
	КонецЦикла;		
КонецПроцедуры

#КонецОбласти

#Область ЭкспортныеПроцедуры

&НаКлиенте
Процедура ПолучениеНастроекПочты(Рез) Экспорт
	ЗаполнитьЗначенияСвойств(ЭтаФорма,Рез);
КонецПроцедуры		

&НаКлиенте
Процедура ПолучениеПочтовыхСерверов(Данные) Экспорт
	Для Каждого Стр из Данные Цикл
		Элементы.mailServer.СписокВыбора.Добавить(Стр,Стр.mailServer);
	КонецЦикла;
КонецПроцедуры	

&НаКлиенте
Процедура ПочтаСохранена(Код) Экспорт
	ФормаПрайсНастройкаУФ=ВладелецФормы.ФормыПАПолучить("ПрайсНастройкаУФ");
	Если ФормаПрайсНастройкаУФ<>Неопределено Тогда
		ЭтоНовый = idMail=0;
		Если idMail=0 Тогда idMail=Код;КонецЕсли;
		ФормаПрайсНастройкаУФ.ОбновитьДанныеПолучателя(ЭтоНовый,Новый Структура(
		"idMail,email,password,imapServer,imapPort,smtpServer,smtpPort,pop3Server,pop3port,userName,server,mailServer,isSSL",
		idMail,email,password,imapServer,imapPort,smtpServer,smtpPort,pop3Server,pop3port,userName,server,mailServer,?(isSSL,1,0)));
	КонецЕсли;	
	ЭтаФорма.Закрыть();
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКоманд

&НаКлиенте
Процедура Сохранить(Команда)
	Если НеЗаполнено() Тогда 
		Сообщить("Не все реквизиты заполнены");
	Иначе
		Запрос="{""action"":""saveEmail"", ""schema"":""mail"",""email"":"""+email
		+""",""idMail"":"+Формат(idMail,"ЧГ=;ЧН=")+",""password"":"""+password
		+""",""imapServer"":"""+imapServer+""",""imapPort"":"+Формат(imapPort,"ЧГ=;ЧН=")
		+",""smtpServer"":"""+smtpServer+""",""smtpPort"":"+Формат(smtpPort,"ЧГ=;ЧН=")
		+",""pop3Server"":"""+pop3Server+""",""pop3Port"":"+Формат(pop3Port,"ЧГ=;ЧН=")
		+",""userName"":"""+userName+""",""server"":"""+server
		+""",""mailServer"":"""+mailServer+""",""isSSL"":"+?(isSSL,"1","0")+"}";
		ВладелецФормы.СендерОтправить(Запрос);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция НеЗаполнено()
	Возврат ПустаяСтрока(imapServer) или imapPort=0
	или Пустаястрока(userName) или ПустаяСтрока(password);  
КонецФункции

&НаКлиенте
Процедура Подключить(Команда)
	Если НеЗаполнено() Тогда 
		Сообщить("Не все реквизиты заполнены");
		Возврат;
	КонецЕсли;
	
	Если ПочтаПодключена Тогда
		Почта.Отключиться();
		ПочтаПодключена=Ложь;
	КонецЕсли;

	Профиль=Новый ИнтернетПочтовыйПрофиль;
	Профиль.АдресСервераIMAP = imapServer;
	Профиль.ПортIMAP = imapPort;
	Профиль.ПользовательIMAP = email;
	Профиль.ПарольIMAP = password;
	Профиль.ИспользоватьSSLIMAP = isSSL;
	Протокол = ПротоколИнтернетПочты.IMAP;
		
	Почта = Новый ИнтернетПочта;
	Попытка
		Почта.Подключиться(Профиль, Протокол);
		ПочтаПодключена=Истина;
	Исключение
		Ошибка=ОписаниеОшибки();
		Протокол=Неопределено;
		ПочтаПодключена=Ложь;
		Сообщить("Ошибки при подключении почты:"+Символы.ПС+Ошибка);
	Конецпопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Отключить(Команда)
	Почта.Отключиться();
	ПочтаПодключена=Ложь;
	Подключение="";
КонецПроцедуры


&НаКлиенте
Процедура Удалить(Команда)
	ОО=Новый ОписаниеОповещения("Удаление",Этаформа);
	ПоказатьВопрос(ОО,"Внимание!!! После удаления у других пользователей также исчезнет этот email"
		+символы.ПС+"Вы действительно хотите удалить почтовый адрес: "+email,
		РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
КонецПроцедуры
	
&НаКлиенте
Процедура Удаление(Ответ, Доп=Неопределено) Экспорт
	Если Ответ=КодВозвратаДиалога.Да Тогда
		ЕСли ПочтаПодключена Тогда 
			Почта.Отключиться();
			ПочтаПодключена=Ложь;
			Подключение="";
		КонецЕсли;
		Запрос="{""action"":""delEmail"", ""schema"":""mail"",""email"":"""+email+"""}";
		ВладелецФормы.СендерОтправить(Запрос);  // ПочтаУдалена
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПочтаУдалена() Экспорт
	ФормаПрайсНастройкаУФ=ВладелецФормы.ФормыПАПолучить("ПрайсНастройкаУФ");
	Если ФормаПрайсНастройкаУФ<>Неопределено Тогда
		ФормаПрайсНастройкаУФ.УдалитьПолучателя();
	КонецЕсли;
	ЭтаФорма.Закрыть();
КонецПроцедуры	


#КонецОбласти

