
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивКлиентов = Параметры.Клиенты.ВыгрузитьЗначения();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ *
	               |ИЗ
	               |	РегистрСведений.Renault_ЦентрализованныеПродукты КАК Renault_ЦентрализованныеПродукты
	               |ГДЕ
	               |	Renault_ЦентрализованныеПродукты.ТипКарты = ""Пр.гарантия""
	               |	И Renault_ЦентрализованныеПродукты.Клиент В (&МассивКлиентов)";
	Запрос.УстановитьПараметр("МассивКлиентов", МассивКлиентов);
	ТаблицаПродленнаяГарантия.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ *
	               |ИЗ
	               |	РегистрСведений.Renault_ЦентрализованныеПродукты КАК Renault_ЦентрализованныеПродукты
	               |ГДЕ
	               |	Renault_ЦентрализованныеПродукты.ТипКарты = ""SARA""
				   |	И Renault_ЦентрализованныеПродукты.Клиент В (&МассивКлиентов)";
	Запрос.УстановитьПараметр("МассивКлиентов", МассивКлиентов);
	ТаблицаSara.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ *
	               |ИЗ
	               |	РегистрСведений.Renault_ЦентрализованныеПродукты КАК Renault_ЦентрализованныеПродукты
	               |ГДЕ
	               |	Renault_ЦентрализованныеПродукты.ТипКарты = ""Кредит RN-Банка""
				   |	И Renault_ЦентрализованныеПродукты.Клиент В (&МассивКлиентов)";
	Запрос.УстановитьПараметр("МассивКлиентов", МассивКлиентов);
	ТаблицаКредитыRNBank.Загрузить(Запрос.Выполнить().Выгрузить());
	
	НадписьПродленнаяГарантия = "Карты продленной гарантии: " + Строка(ТаблицаПродленнаяГарантия.Количество()) + " шт.";
	НадписьSARA = "Карты Renault Assistance SARA: " + Строка(ТаблицаSara.Количество()) + " шт.";
	НадписьКредит = "Кредиты RN-банк: " + Строка(ТаблицаКредитыRNBank.Количество()) + " шт.";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_КартыЛояльности.Ссылка КАК Карта,
	               |	Renault_КартыЛояльности.DMS_ВидКартыЛояльности КАК ВидКарты,
	               |	DMS_БонусныеБаллыОстатки.НачисленоОстаток КАК ОстатокБаллов
	               |ИЗ
	               |	Справочник.Renault_КартыЛояльности КАК Renault_КартыЛояльности
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.DMS_БонусныеБаллы.Остатки КАК DMS_БонусныеБаллыОстатки
	               |		ПО Renault_КартыЛояльности.Ссылка = DMS_БонусныеБаллыОстатки.КартаЛояльности
	               |ГДЕ
	               |	Renault_КартыЛояльности.Контрагент В(&Контрагент)
	               |	И Renault_КартыЛояльности.Недействительна = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Контрагент", МассивКлиентов);
	
	ТаблицаБонусныеКарты.Загрузить(Запрос.Выполнить().Выгрузить());
	
	НадписьДисконтныеКарты = "Дисконтные карты: " + Строка(ТаблицаБонусныеКарты.Количество()) + " шт.";
	
КонецПроцедуры

&НаКлиенте
Процедура ПродленнаяГарантияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Элементы.ГруппаПродленнаяГарантия.Видимость = Не Элементы.ГруппаПродленнаяГарантия.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьSARAНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Элементы.ГруппаSARA.Видимость = Не Элементы.ГруппаSARA.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьКредитНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Элементы.ГруппаКредит.Видимость = Не Элементы.ГруппаКредит.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьДисконтныеКартыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Элементы.ГруппаДисконтныеКарты.Видимость = Не Элементы.ГруппаДисконтныеКарты.Видимость;
	
КонецПроцедуры
