Функция ПолучитьКодОперацииПоМодели(Модель) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	DMS_КодыОперацийМодели.Ссылка
	               |ИЗ
	               |	Справочник.DMS_КодыОпераций.Модели КАК DMS_КодыОперацийМодели
	               |ГДЕ
	               |	DMS_КодыОперацийМодели.Модель = &Модель";
				   
	Запрос.УстановитьПараметр("Модель", Модель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	Иначе
		
		Возврат Справочники.DMS_КодыОпераций.ПустаяСсылка();		
		
	КонецЕсли;	
	
КонецФункции