
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьТаблицу();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсе(Команда)
	
	Для Каждого Стр Из ЗаявкиНаСервис Цикл
		Стр.Выбран = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для Каждого Стр Из ЗаявкиНаСервис Цикл
		Стр.Выбран = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПометитьНаУдалениеНаСервере()
	
	Для Каждого Стр Из ЗаявкиНаСервис Цикл
		Если Стр.Выбран Тогда
			Док = Стр.Ссылка.ПолучитьОбъект();
			Если Док.Проведен Тогда
				Док.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;
			Док.ПометкаУдаления = Истина;
			Попытка
				Док.Записать(РежимЗаписиДокумента.Запись);
			Исключение
				Сообщить("Не удалось пометить на удаление заявку на сервис №"+Док.Номер);
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьТаблицу();

КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдаление(Команда)
	
	ПометитьНаУдалениеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицу()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_CRM_ЗаявкаНаСервис.Ссылка,
	               |	Renault_CRM_ЗаявкаНаСервис.Состояние,
	               |	Renault_РабочиеЛисты.IDK
	               |ИЗ
	               |	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
	               |		ПО Renault_РабочиеЛисты.IDK = Renault_CRM_ЗаявкаНаСервис.Обращение.IDK
	               |			И (Renault_РабочиеЛисты.ЗапросНаЗакрытие)
	               |			И (Renault_CRM_ЗаявкаНаСервис.Состояние В (&Состояния))
	               |			И (НЕ Renault_CRM_ЗаявкаНаСервис.ПометкаУдаления)";
	
	Состояния = Новый СписокЗначений;
	Состояния.Добавить(Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.ПустаяСсылка());
	Состояния.Добавить(Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Заявка);
	Запрос.УстановитьПараметр("Состояния", Состояния);
	
	Результат = Запрос.Выполнить().Выгрузить();
	ЗаявкиНаСервис.Загрузить(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьТаблицу();
КонецПроцедуры
