
&НаКлиенте
Процедура СписокКонтрагентовПриАктивизацииСтроки(Элемент)

	КонтрагентВидКонтрагента = ?(Элемент.ТекущиеДанные = Неопределено, ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ПустаяСсылка"), Элемент.ТекущиеДанные.Контрагент.ВидКонтрагента);
	КонтрагентНаименование = ?(Элемент.ТекущиеДанные = Неопределено, "", Элемент.ТекущиеДанные.Контрагент.Наименование);
	КонтрагентОсновнойБанковскийСчет = ?(Элемент.ТекущиеДанные = Неопределено, ПредопределенноеЗначение("Справочник.БанковскиеСчета.ПустаяСсылка"), Элемент.ТекущиеДанные.Контрагент.ОсновнойБанковскийСчет);
	КонтрагентВидВзаимоотношений = ?(Элемент.ТекущиеДанные = Неопределено, ПредопределенноеЗначение("Справочник.ВидыВзаимоотношений.ПустаяСсылка"), Элемент.ТекущиеДанные.Контрагент.ВидОтношений);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СписокКонтрагентов.Параметры.УстановитьЗначениеПараметра("Наименование", "%");
	СписокКонтрагентов.Параметры.УстановитьЗначениеПараметра("ПредставлениеКИ", "%");
	СписокКонтрагентов.Параметры.УстановитьЗначениеПараметра("ОтборПоКИ", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискФиоПриИзменении(Элемент)
	
	//СписокКонтрагентов.Параметры.УстановитьЗначениеПараметра("Наименование", "%" + ИтоговаяСтрока + ?(ИтоговаяСтрока = "", "%", ""));
	СписокКонтрагентов.Параметры.УстановитьЗначениеПараметра("Наименование", "%"+СокрЛП(ПоискФио)+"%");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКонтрагентовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные.Тип = "Контрагент" Тогда
		Элемент.ТекущиеДанные.Контрагент.ПолучитьФорму().Открыть();
	ИначеЕсли Элемент.ТекущиеДанные.Тип = "Потенциальный" Тогда
		Форма = ПолучитьФорму("ОбщаяФорма.CRM_ФормаКарточкиКлиента");
		Форма.Клиент = Элемент.ТекущиеДанные.Контрагент;
		Форма.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискТелефонПриИзменении(Элемент)
	
	ИзменитьТекстНаСервере();
	
	//СписокКонтрагентов.Параметры.УстановитьЗначениеПараметра("ОтборПоКИ", ЗначениеЗаполнено(ПоискТелефон));
	Если ЗначениеЗаполнено(ПоискТелефон) Тогда
		СписокКонтрагентов.Параметры.УстановитьЗначениеПараметра("ПредставлениеКИ", "%"+СокрЛП(ПоискТелефон)+"%");
	КонецЕсли;
	
КонецПроцедуры

Процедура ИзменитьТекстНаСервере()
	
	Если ЗначениеЗаполнено(ПоискТелефон) Тогда
		СписокКонтрагентов.ТекстЗапроса = 
			"ВЫБРАТЬ
			|	КонтактнаяИнформация.Объект КАК Контрагент,
			|	КонтактнаяИнформация.Объект.ВидКонтрагента КАК ВидКонтрагента,
			|	КонтактнаяИнформация.Объект.ВидОтношений КАК ВидОтношений,
			|	КонтактнаяИнформация.Объект.Автор КАК Автор,
			|   ВЫБОР
			|      КОГДА КонтактнаяИнформация.Объект Ссылка Справочник.Контрагенты Тогда
			|			""Контрагент""
			|	   ИНАЧЕ
			|			""Потенциальный""
			|	КОНЕЦ КАК Тип,
			|	КонтактнаяИнформация.Объект.Пол КАК Пол,
			|	КонтактнаяИнформация.Представление КАК ПредставлениеКИ
            |
			|ИЗ
			|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
			|ГДЕ
			|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
			|	И КонтактнаяИнформация.Представление ПОДОБНО &ПредставлениеКИ
			|	И (КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты ИЛИ КонтактнаяИнформация.Объект ССЫЛКА Справочник.CRM_ПотенциальныеКонтрагенты)
			|	И КонтактнаяИнформация.Объект.Наименование ПОДОБНО &Наименование";
	Иначе СписокКонтрагентов.ТекстЗапроса = 
			//"ВЫБРАТЬ
			//|	КонтрагентыСКИ.Контрагент,
			//|	КонтрагентыСКИ.Тип,
			//|	КонтрагентыСКИ.ВидОтношений,
			//|	КонтрагентыСКИ.ВидКонтрагента,
			//|	КонтрагентыСКИ.Пол,
			//|	КонтрагентыСКИ.Автор,
			//|	КонтрагентыСКИ.ПредставлениеКИ
			//|ИЗ
			//|	(ВЫБРАТЬ
			"ВЫБРАТЬ
			|		Контрагенты.Контрагент КАК Контрагент,
			|		Контрагенты.Тип КАК Тип,
			|		Контрагенты.ВидОтношений КАК ВидОтношений,
			|		Контрагенты.ВидКонтрагента КАК ВидКонтрагента,
			|		Контрагенты.Пол КАК Пол,
			|		Контрагенты.Автор КАК Автор,
			|		ВЫБОР
			|			КОГДА КонтактнаяИнформация.Представление ЕСТЬ NULL 
			|				ТОГДА """"
			|			ИНАЧЕ КонтактнаяИнформация.Представление
			|		КОНЕЦ КАК ПредставлениеКИ
			|	ИЗ
			|		(ВЫБРАТЬ
			|			CRM_ПотенциальныеКонтрагенты.Ссылка КАК Контрагент,
			|			""Потенциальный"" КАК Тип,
			|			CRM_ПотенциальныеКонтрагенты.ВидОтношений КАК ВидОтношений,
			|			CRM_ПотенциальныеКонтрагенты.ВидКонтрагента КАК ВидКонтрагента,
			|			CRM_ПотенциальныеКонтрагенты.Пол КАК Пол,
			|			CRM_ПотенциальныеКонтрагенты.Автор КАК Автор
			|		ИЗ
			|			Справочник.CRM_ПотенциальныеКонтрагенты КАК CRM_ПотенциальныеКонтрагенты
			|		ГДЕ
			|			CRM_ПотенциальныеКонтрагенты.Наименование ПОДОБНО &Наименование
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			Контрагенты.Ссылка,
			|			""Контрагент"",
			|			Контрагенты.ВидОтношений,
			|			Контрагенты.ВидКонтрагента,
			|			Контрагенты.Пол,
			|			Контрагенты.Автор
			|		ИЗ
			|			Справочник.Контрагенты КАК Контрагенты
			|		ГДЕ
			|			Контрагенты.Наименование ПОДОБНО &Наименование) КАК Контрагенты
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
			|	ПО Контрагенты.Контрагент = КонтактнаяИнформация.Объект
			|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)";
			
	КонецЕсли;
	
КонецПроцедуры
