////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции общего назначения

// Функция преобразования идентификатора в строку     
//                           
// Параметры:
//  Идентификатор - Число - Значение идентификатора.
//
// Возвращаемое значение:
//  Идентификатор - Строка.  
// 
Функция ИдентификаторВСтроку(Знач Идентификатор) Экспорт
	
	Если ТипЗнч(Идентификатор) = Тип("Число") Тогда		
		Возврат Формат(Идентификатор, "ЧГ=");
	ИначеЕсли ТипЗнч(Идентификатор) = Тип("Строка") Тогда
		Идентификатор = СтрЗаменить(Идентификатор, Символы.НПП, "");
	    Возврат Идентификатор;
	КонецЕсли;
	
	Возврат Идентификатор;
	
КонецФункции 

// Функция получения настройки подключения к CRM или DNM по документу 
//                           
// Параметры:   
//  Документ       - ДокументСсылка - Ссылка на выгружаемый документ.
//
// Возвращаемое значение:
//  НастройкаПодключения - Ссылка на настройку подключения к CRM или DNM
//
Функция ПолучитьНастройкуПодключенияПоДокументу(Документ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Инфотек_НастройкиПодключения.Ссылка
	|ИЗ
	|	Справочник.Инфотек_НастройкиПодключения КАК Инфотек_НастройкиПодключения";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		Пока ВыборкаЗапроса.Следующий() Цикл
			НастройкаПодключения = ВыборкаЗапроса.Ссылка;
			ВыгружатьПодразделение = Ложь;
			ВыгружатьОрганзацию = Ложь;
			ВыгружатьВидРемонта = Ложь;
			
			Если ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаказНаряд") ИЛИ ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаявкаНаРемонт") Тогда
				Если НастройкаПодключения.ВидыРемонта.Количество()= 0 Тогда
					ВыгружатьВидРемонта = Истина;
				Иначе
					Для Каждого СтрокаВидРемонта из НастройкаПодключения.ВидыРемонта Цикл
						Если СтрокаВидРемонта.ВидРемонта =  Документ.ВидРемонта Тогда
							ВыгружатьВидРемонта = Истина;
						КонецЕсли
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			
			Если НастройкаПодключения.Подразделения.Количество()= 0 Тогда
				ВыгружатьПодразделение = Истина;
			Иначе
				Для Каждого СтрокаПодразделения из НастройкаПодключения.Подразделения Цикл
					Если СМ_ВыгрузкаВАвтодилер.ВИерархии(Документ.ПодразделениеКомпании, СтрокаПодразделения.Подразделение) Тогда
						ВыгружатьПодразделение = Истина;
					КонецЕсли
				КонецЦикла;
			КонецЕсли;
			
			Если НастройкаПодключения.Организации.Количество()= 0 Тогда
				ВыгружатьОрганзацию = Истина;
			Иначе
				Для Каждого СтрокаОрганизации из НастройкаПодключения.Организации Цикл
					Если СтрокаОрганизации.Организация =  Документ.Организация Тогда
						ВыгружатьОрганзацию = Истина;
					КонецЕсли
				КонецЦикла;
			КонецЕсли;
			
			Если ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаказНаряд") ИЛИ ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаявкаНаРемонт") Тогда
				Если  ВыгружатьОрганзацию И ВыгружатьПодразделение И ВыгружатьВидРемонта Тогда
					Возврат НастройкаПодключения;
				КонецЕсли;
			КонецЕсли;   
			
			Если ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаказНаАвтомобиль") ИЛИ ТипЗнч(Документ) = Тип("ДокументОбъект.РеализацияАвтомобилей") 
				ИЛИ ТипЗнч(Документ) = Тип("ДокументОбъект.ПоступлениеАвтомобилей") ИЛИ ТипЗнч(Документ) = Тип("ДокументОбъект.ПеремещениеАвтомобилей") 
				ИЛИ ТипЗнч(Документ) = Тип("ДокументОбъект.ВозвратПоставщикуАвтомобилей") ИЛИ ТипЗнч(Документ) = Тип("ДокументОбъект.КорректировкаПоступленияАвтомобилей") Тогда
				Если  ВыгружатьОрганзацию И ВыгружатьПодразделение Тогда
					Возврат НастройкаПодключения;
				КонецЕсли;
			КонецЕсли;

		КонецЦикла;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Функция получения настройки подключения к CRM по реквизитам 
//                           
// Параметры:   
//  Организация   - СправочникСсылка.Организации - Ссылка на организацию.
//	Подразделение - СправочникСсылка.ПодразделенияКомпании - Ссылка на подразделение.
//
// Возвращаемое значение:
//  НастройкаПодключения - Ссылка на настройку подключения к CRM или DNM
//
Функция ПолучитьНастройкуПодключенияCRMПоПараметрам(Организация = Неопределено,Подразделение = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Инфотек_НастройкиПодключения.Ссылка
	|ИЗ
	|	Справочник.Инфотек_НастройкиПодключения КАК Инфотек_НастройкиПодключения";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		Пока ВыборкаЗапроса.Следующий() Цикл
			НастройкаПодключения = ВыборкаЗапроса.Ссылка;
			ВыгружатьПодразделение = Ложь;
			ВыгружатьОрганзацию = Ложь;
			
			Если НастройкаПодключения.Подразделения.Количество()= 0 ИЛИ Не ЗначениеЗаполнено(Подразделение) Тогда
				ВыгружатьПодразделение = Истина;
			Иначе
				Для Каждого СтрокаПодразделения из НастройкаПодключения.Подразделения Цикл
					Если СтрокаПодразделения.Подразделение = Подразделение Тогда
						ВыгружатьПодразделение = Истина;
					КонецЕсли
				КонецЦикла;
			КонецЕсли;
			
			Если НастройкаПодключения.Организации.Количество()= 0 ИЛИ Не ЗначениеЗаполнено(Организация) Тогда
				ВыгружатьОрганзацию = Истина;
			Иначе
				Для Каждого СтрокаОрганизации из НастройкаПодключения.Организации Цикл
					Если СтрокаОрганизации.Организация = Организация Тогда
						ВыгружатьОрганзацию = Истина;
					КонецЕсли
				КонецЦикла;
			КонецЕсли;
			
			Если  ВыгружатьОрганзацию И ВыгружатьПодразделение Тогда
				Возврат НастройкаПодключения;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Процедура записи адреса контрагента в регистр сведений
//                           
// Параметры:   
//  СтруктураАдрес - Структура - Адрес контрагента из CRM в виде структуры полей.
//  Контрагент     - СправочникСсылка.Контрагенты - Ссылка на справочник контрагенты для записи адреса.
//  ВидКИ          - СправочникСсылка.ВидыКонтактнойИнформации - Ссылка на справочник вид контактной информации.
//
Процедура ЗаписатьАдрес(СтруктураАдрес,Контрагент,ВидКИ) 
	
	Адрес = "";
	zip_code =  Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАдрес.zipCode);
	address  =  Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАдрес.region);
	city     =  Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАдрес.city);
	street   =  Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАдрес.street);
	house    =  Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАдрес.house);
	building =  Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАдрес.building);
	apartment = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАдрес.apartment); 
	
	Адрес = ?(НЕ ЗначениеЗаполнено(zip_code),"",zip_code);
	Адрес = ?(НЕ ЗначениеЗаполнено(address),", ",address);
	Адрес = ?(НЕ ЗначениеЗаполнено(city),Адрес,Адрес+", "+city);
	Адрес = ?(НЕ ЗначениеЗаполнено(street),Адрес,Адрес+", "+street);
	Адрес = ?(НЕ ЗначениеЗаполнено(house),Адрес,Адрес +", д."+house);
	Адрес = ?(НЕ ЗначениеЗаполнено(building),Адрес,Адрес +", крп."+building);
	Адрес = ?(НЕ ЗначениеЗаполнено(apartment),Адрес,Адрес +", кв."+apartment);
	
	Если адрес<>"" Тогда
		
		СтруктураЗаписи = новый структура();
		СтруктураЗаписи.Вставить("Объект",Контрагент);
		СтруктураЗаписи.Вставить("Тип",Перечисления.ТипыКонтактнойИнформации.Адрес);
		СтруктураЗаписи.Вставить("Вид",ВидКИ);
		СтруктураЗаписи.Вставить("Представление",Адрес);
		СтруктураЗаписи.Вставить("Поле1",zip_code);
		СтруктураЗаписи.Вставить("Поле2",address);
		СтруктураЗаписи.Вставить("Поле4",city);
		СтруктураЗаписи.Вставить("Поле6",street);
		СтруктураЗаписи.Вставить("Поле7",house);
		СтруктураЗаписи.Вставить("Поле8",building);
		СтруктураЗаписи.Вставить("Поле9",apartment);
		
		ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "КонтактнаяИнформация");
	КонецЕсли;
	
КонецПроцедуры

// Процедура добавления записи в регистр сведений
//                           
// Параметры:   
//  СтруктураЗаписи - Структура - Структура полей для записи в регистр.
//  ИмяРегистра     - Строка - Имя регистра сведений.
//
Процедура ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи,Знач ИмяРегистра) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписейРегистраСведений(СтруктураЗаписи, ИмяРегистра);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураЗаписи);
	
	// записываем набор записей
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Функция создания набора записей регистра сведений 
//                           
// Параметры: 
//  СтруктураЗаписи - Структура - Структура полей для записи в регистр.
//  ИмяРегистра - Строка - Имя регистра сведений.
//
// Возвращаемое значение:
//  НаборЗаписей регистра сведений
//
Функция СоздатьНаборЗаписейРегистраСведений(СтруктураЗаписи, ИмяРегистра) Экспорт
	
	МетаданныеРегистра = Метаданные.РегистрыСведений[ИмяРегистра];
	
	НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		
		Если СтруктураЗаписи.Свойство(Измерение.Имя) Тогда
			НаборЗаписей.Отбор[Измерение.Имя].Установить(СтруктураЗаписи[Измерение.Имя]);
		КонецЕсли;
	КонецЦикла;
	
	Возврат НаборЗаписей;
	
КонецФункции

// Функция записи значения в  регистра сведений доплнительные характеристики автомобиля 
//                           
// Параметры: 
//  Значение    - Значение для записи в регистр
//  ВидЗначения - ПеречисленияСсылка.ДополнительнаяИнформацияАвтомобилей - Вид значения характеристики автомобиля.
//  Автомобиль  - Справочник.Автомобили - Ссылка на справочник автомобили.
//  НаДату      - Дата - Дата записи в регистр.
//
// Возвращаемое значение:
//  Отказ
//
Функция ЗаписьЗначенияРегистраСведения(Значение,ВидЗначения,Автомобиль,НаДату=Неопределено) Экспорт
	
	Отказ = Ложь;
	
	Если НаДату = Неопределено Тогда
		НаДату = НачалоДня(ТекущаяДата());
	КонецЕсли; 
	ДатаЗаписи =  НаДату;
	Если ВидЗначения = Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег Тогда
		//При записи нового пробега
		//Получить последний пробег и следующий
		СтруктураОтбора=Новый Структура("Автомобиль,ВидЗначения",Автомобиль,Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
		СтруктураСведений=РегистрыСведений.Автомобили.ПолучитьПоследнее(ДатаЗаписи-24*60*60,СтруктураОтбора);
		Попытка ПробегДо = Число(СтруктураСведений.Значение); Исключение ПробегДо = 0; КонецПопытки;
		СтруктураСведений = РегистрыСведений.Автомобили.ПолучитьПервое(ДатаЗаписи+24*60*60,СтруктураОтбора);
		Попытка ПробегПосле = Число(СтруктураСведений.Значение); Исключение ПробегПосле = 9999999999; КонецПопытки;
		Если Значение<ПробегДо Тогда
			Сообщить("Значение пробега автомобиля не может быть менее старого значения ("+СокрЛП(ПробегДо)+").");
			Отказ = Истина; Возврат Отказ;
		КонецЕсли; 
		Если Значение>ПробегПосле Тогда
			Сообщить("Значение пробега автомобиля не может быть более следующего значения ("+СокрЛП(ПробегПосле)+").");
			Отказ = Истина; Возврат Отказ;
		КонецЕсли; 
	КонецЕсли; 
	
	Если НЕ Отказ Тогда
		//Чтение старого значения регистра
		СтруктураОтбора   = Новый Структура("Автомобиль,ВидЗначения",Автомобиль,ВидЗначения);
		СтруктураСведений = РегистрыСведений.Автомобили.ПолучитьПоследнее(ДатаЗаписи,СтруктураОтбора);
		ЗначениеСтарое    = СтруктураСведений.Значение;
		Записывать = Ложь;
		//Введено значение, а старое отсутствует
		Если НЕ обЗначениеНеЗаполнено(Значение) И ЗначениеСтарое=Неопределено Тогда Записывать=Истина; КонецЕсли; 
		//Значение стерто, а старое значение было введено
		Если обЗначениеНеЗаполнено(Значение) И ЗначениеСтарое<>Неопределено Тогда Записывать=Истина; КонецЕсли; 
		//Введено значение и было введено старое
		Если НЕ обЗначениеНеЗаполнено(Значение) И ЗначениеСтарое<>Неопределено Тогда
			//Значение изменилось
			Если Значение<>ЗначениеСтарое Тогда Записывать=Истина; КонецЕсли; 
		КонецЕсли; 
		Если Записывать Тогда
			//Значение параметра изменилось
			ЗаписьРегСведений=РегистрыСведений.Автомобили.СоздатьМенеджерЗаписи();
			ЗаписьРегСведений.Автомобиль=Автомобиль.Ссылка;
			ЗаписьРегСведений.ВидЗначения=ВидЗначения;
			ЗаписьРегСведений.Значение=Значение;
			ЗаписьРегСведений.Период=ДатаЗаписи;
			ЗаписьРегСведений.Записать();
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат Отказ;
	
КонецФункции // ЗаписьЗначенияРегистраСведения()

// Формирует стандартное наименование договора
// вида Договор поставки №ХХХХХ а Валюте от ДД.ММ.ГГГГ
// Используется как при интерактивном, так и при программном создании
Процедура СформироватьНаименование(НовДоговор) Экспорт
	
	ТекстДеятельности = "";
	Если НовДоговор.ДляАвтосалона И НовДоговор.ДляАвтосервиса Тогда
		ТекстДеятельности = "з\ч, сервис и т\с";
	ИначеЕсли НовДоговор.ДляАвтосервиса Тогда
		ТекстДеятельности = "з\ч и сервис";
	ИначеЕсли НовДоговор.ДляАвтосалона Тогда
		ТекстДеятельности = "т\с";
	ИначеЕсли НовДоговор.Внутренний Тогда
		ТекстДеятельности = "Прочее";
	КонецЕсли;
	
	Если (НовДоговор.ТипДоговора = Перечисления.ТипыДоговоров.ВиртуальныйДоговор) Тогда
		НовДоговор.Наименование = СокрЛП(Строка(НовДоговор.ВидДоговора))
		+ " " + ТекстДеятельности
		+ " в " + НовДоговор.ВалютаВзаиморасчетов.Наименование;
	Иначе
		НовДоговор.Наименование = СокрЛП(Строка(НовДоговор.ВидДоговора))
		+ " " + ТекстДеятельности
		+ ?(ПустаяСтрока(НовДоговор.НомерДоговора),""," № " + СокрЛП(НовДоговор.НомерДоговора))
		+ " в " + НовДоговор.ВалютаВзаиморасчетов.Наименование
		+ " от "+Формат(НовДоговор.ДатаНачала,"ДФ=дд.ММ.гг");
	КонецЕсли;
	
КонецПроцедуры // СформироватьНаименование()

// Функция ищет дубли
// ####### копия из обработки  ПоискИЗаменаДублирующихсяЭлементов
//
// Параметры:
//	ИскомыйОбъект - СправочникСсылка - ссылка на справочник, в котором нужно искать дубли
//  СтруктураПоиска - Структура - набор полей для поиска
//
// Возвращаемое значение:
//  НайденныеОбъекты - ТаблицаЗначений - таблица с найденными объектами
//
Функция обНайтиДубли(ИскомыйОбъект,СтруктураПоиска) Экспорт
	ПоискДублей       = Обработки.ПоискИЗаменаДублирующихсяЭлементов.Создать();
	
	мИскомыйОбъектПоискаДублей   = ИскомыйОбъект;
	мСтруктураПоиска             = СтруктураПоиска;
	
	НайденныеОбъекты = Новый ТаблицаЗначений;
	НайденныеОбъекты.Колонки.Добавить("Ссылка");
	ИмяСправочника = ИскомыйОбъект.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ Разрешенные 
	|	Ссылка*
	|Из Справочник.Контрагенты КАК Спр
	|Где Не Спр.ЭтоГруппа";
//	|Из Справочник." + ИмяСправочника + " КАК Спр
	Попытка
		Если НЕ ИскомыйОбъект.ЭтоНовый() Тогда
			Запрос.Текст = Запрос.Текст + " И Спр.Ссылка<>&ТекСпр";
			Запрос.УстановитьПараметр("ТекСпр",ИскомыйОбъект.Ссылка);
		КонецЕсли;	
	Исключение
	КонецПопытки;
	
	Реквизиты = "";
	СтрокаГде = "";
	ВЗапросеТолькоРавенство = Истина;
	МетаданныеРеквизитов = ИскомыйОбъект.Метаданные().Реквизиты;
	СтруктураИсходныхРеквизитов = Новый Структура;
	
	Для каждого КлючИЗначение Из СтруктураПоиска Цикл
		ИмяРеквизита      = КлючИЗначение.Ключ;
		СтепеньСхожести   = КлючИЗначение.Значение;
		ЗначениеРеквизита = ИскомыйОбъект[ИмяРеквизита];
		
		Если ТипЗнч(ЗначениеРеквизита) = Тип("Строка") Тогда
			ЗначениеРеквизита = СокрЛП(ЗначениеРеквизита);
		КонецЕсли;
		
		МетаданныеРеквизита    = МетаданныеРеквизитов.Найти(ИмяРеквизита);
		ПредставлениеРеквизита = ?(МетаданныеРеквизита = Неопределено,ИмяРеквизита,Строка(МетаданныеРеквизита));
		
		СтруктураИсходногоРеквизита = Новый Структура("ЗначениеРеквизита,СтепеньСхожести,СписокСлов"
		,ЗначениеРеквизита,СтепеньСхожести,ПоискДублей.ПолучитьСписокСлов(ЗначениеРеквизита));
		
		СтруктураИсходныхРеквизитов.Вставить(ИмяРеквизита,СтруктураИсходногоРеквизита);
		
		НайденныеОбъекты.Колонки.Добавить(ИмяРеквизита);
		НайденныеОбъекты.Колонки.Добавить(ИмяРеквизита+"_Флаг");
		
		Реквизиты = Реквизиты+",
		|	"+ ИмяРеквизита;
		
		Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
			Если СтепеньСхожести = "=" Тогда
				ЗнакСравнения = ?(НЕ МетаданныеРеквизита = Неопределено И МетаданныеРеквизита.Тип.СодержитТип(Тип("Строка")) и МетаданныеРеквизита.Тип.КвалификаторыСтроки.Длина = 0,"Подобно","=");
				СтрокаГде = ?(СтрокаГде = "", "",СтрокаГде +" или ")+"Спр."+ИмяРеквизита +" " +ЗнакСравнения+ " &"+ИмяРеквизита;
				Запрос.УстановитьПараметр(""+ИмяРеквизита,ЗначениеРеквизита);
			ИначеЕсли НЕ СтепеньСхожести = Неопределено Тогда
				ВЗапросеТолькоРавенство = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "*", Реквизиты);
	Если ВЗапросеТолькоРавенство И НЕ ПустаяСтрока(СтрокаГде) Тогда
		Запрос.Текст = Запрос.Текст + Символы.ПС + "	И("+СтрокаГде+")";
	КонецЕсли;
	
	ТаблицаСправочника = Запрос.Выполнить().Выгрузить();
	Для каждого Строка Из ТаблицаСправочника Цикл
		СтруктураНайденных = Новый Структура;
		Для каждого КлючИЗначение Из СтруктураИсходныхРеквизитов Цикл
			СтепеньСхожести   = КлючИЗначение.Значение.СтепеньСхожести;
			Если СтепеньСхожести = "=" Тогда
				ИмяРеквизита      = КлючИЗначение.Ключ;
				ЗначениеРеквизита = КлючИЗначение.Значение.ЗначениеРеквизита;
				//KamikadZe begin add 15.05.2016 22:26:01
				Если ИмяРеквизита = "Наименование" ИЛИ ИмяРеквизита = "НаименованиеПолное" Тогда
					Если Врег(ЗначениеРеквизита) = Врег(Строка[ИмяРеквизита]) Тогда
						СтруктураНайденных.Вставить(ИмяРеквизита);
					КонецЕсли;
					Продолжить;
				КонецЕсли;
				//KamikadZe end add
				//Поиск по равному значению
				Если ЗначениеРеквизита = Строка[ИмяРеквизита] Тогда
					СтруктураНайденных.Вставить(ИмяРеквизита);
				КонецЕсли;
			ИначеЕсли НЕ СтепеньСхожести = Неопределено Тогда
				ИмяРеквизита      = КлючИЗначение.Ключ;
				//Поиск по похожим словам
				СписокИскомыхСлов  = КлючИЗначение.Значение.СписокСлов.Скопировать();
				СписокНайденныхСлов = ПоискДублей.ПолучитьСписокСлов(Строка[ИмяРеквизита]);
				Если НЕ ПоискДублей.ПроверитьСловаНаОтличие(СписокИскомыхСлов,СписокНайденныхСлов,СтепеньСхожести) Тогда
					СтруктураНайденных.Вставить(ИмяРеквизита);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ СтруктураНайденных.Количество()=0 Тогда
			НоваяСтрока = НайденныеОбъекты.Добавить();
			НоваяСтрока.Ссылка = Строка.Ссылка;
			Для каждого КлючИЗначение Из СтруктураПоиска Цикл
				ИмяРеквизита    = КлючИЗначение.Ключ;
				НоваяСтрока[ИмяРеквизита] = Строка[ИмяРеквизита];
				НоваяСтрока[ИмяРеквизита+"_Флаг"] = СтруктураНайденных.Свойство(ИмяРеквизита);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НайденныеОбъекты;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции получения данных из CRM

// Функция получения массива видов ремонта ТО из CRM     
//                           
// Параметры:
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключения - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  МассивВозврата - массив объектов виды ремонта ТО из CRM.  
//  
Функция ПолучитьМассивВидовРемонтаТО(НастройкаПодключения) Экспорт      
	
	Запрос = "/yii/api/refWork";
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	МассивВозврата = Новый Массив;
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		СтруктураJson = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);		
		Для каждого Элемент ИЗ СтруктураJson.result Цикл
			МассивВозврата.Добавить(Инфотек_ОбщиеПроцедуры.СкопироватьРекурсивно(Элемент));
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивВозврата;
	
КонецФункции

// Функция получения массива автосалонов из CRM     
//                           
// Параметры:
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключения - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  МассивВозврата - массив объектов автосалоны из CRM.  
//  
Функция ПолучитьМассивАвтосалонов(НастройкаПодключения) Экспорт      
	
	Запрос = "/yii/api/autosalon";
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	МассивВозврата = Новый Массив;
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		СтруктураJson = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);		
		Для каждого Элемент ИЗ СтруктураJson.result Цикл
			МассивВозврата.Добавить(Инфотек_ОбщиеПроцедуры.СкопироватьРекурсивно(Элемент));
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивВозврата;
	
КонецФункции

// Функция получения массива продавцов из CRM     
//                           
// Параметры:
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключения - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  МассивВозврата - массив объектов продавцы из CRM.  
//  
Функция ПолучитьМассивПродавцов(НастройкаПодключения) Экспорт      
	
	Запрос = "/yii/api/seller";
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	МассивВозврата = Новый Массив;
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		СтруктураJson = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);		
		Для каждого Элемент ИЗ СтруктураJson.result Цикл
			МассивВозврата.Добавить(Инфотек_ОбщиеПроцедуры.СкопироватьРекурсивно(Элемент));
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивВозврата;
	
КонецФункции

// Функция получения массива сотрудников из CRM     
//                           
// Параметры:
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  МассивВозврата - массив объектов сотрудников из CRM.  
//  
Функция ПолучитьМассивСотрудников(НастройкаПодключения) Экспорт      
	
	Запрос = "/yii/api/user";
	КоличествоСтраниц = Инфотек_Запросы.ПолучитьКоличествоСтраницИзОтвета(Запрос,НастройкаПодключения);
	
	ТекущаяСтраница = 1;
	МассивВозврата = Новый Массив;
	
	Пока ТекущаяСтраница <= КоличествоСтраниц Цикл
		ЗапросКВыполнению = Запрос + "?UserSearch_page=" + Формат(ТекущаяСтраница,"ЧН=0; ЧГ=0");	
		Ответ = Инфотек_Запросы.GETЗапрос(ЗапросКВыполнению,НастройкаПодключения);
		
		Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
			СтруктураJson = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);		
			Для каждого Элемент ИЗ СтруктураJson.result Цикл
				МассивВозврата.Добавить(Инфотек_ОбщиеПроцедуры.СкопироватьРекурсивно(Элемент));
			КонецЦикла;
		КонецЕсли;
		ТекущаяСтраница = ТекущаяСтраница + 1;
	КонецЦикла;
	
	Возврат МассивВозврата;
	
КонецФункции

// Функция получения массива брендов из CRM     
//                           
// Параметры:
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//  БрендыTradeIn        - Булево - определяет какие сущности получаем из CRM
//
// Возвращаемое значение:
//  МассивВозврата - массив объектов бренды из CRM.  
//  
Функция ПолучитьМассивБрендов(НастройкаПодключения,БрендыTradeIn) Экспорт      
	
	Если БрендыTradeIn = Ложь Тогда
		Запрос = "/yii/api/refBrand";  
	Иначе
		Запрос = "/yii/api/reference/brand";
	КонецЕсли;	
	КоличествоСтраниц = Инфотек_Запросы.ПолучитьКоличествоСтраницИзОтвета(Запрос,НастройкаПодключения);
	
	ТекущаяСтраница = 1;
	МассивВозврата = Новый Массив;
	
	Пока ТекущаяСтраница <= КоличествоСтраниц Цикл        
		Если БрендыTradeIn = Ложь Тогда
			ЗапросКВыполнению = Запрос + "?RefBrandSearch_page=" + Формат(ТекущаяСтраница,"ЧН=0; ЧГ=0");
		Иначе
			ЗапросКВыполнению = Запрос + "?BrandSearch_page=" + Формат(ТекущаяСтраница,"ЧН=0; ЧГ=0");
		КонецЕсли;		
		Ответ = Инфотек_Запросы.GETЗапрос(ЗапросКВыполнению,НастройкаПодключения);
		
		Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
			СтруктураJson = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);		
			Для каждого Элемент ИЗ СтруктураJson.result Цикл
				МассивВозврата.Добавить(Инфотек_ОбщиеПроцедуры.СкопироватьРекурсивно(Элемент));
			КонецЦикла;
		КонецЕсли;
		ТекущаяСтраница = ТекущаяСтраница + 1;
	КонецЦикла;
	
	Возврат МассивВозврата;
	
КонецФункции

// Функция получения массива моделей из CRM     
//                           
// Параметры:
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//  id_бренда            - Число - ID бренда CRM.
//  МоделиTradeIn        - Булево - определяет какие сущности получаем из CRM
//
// Возвращаемое значение:
//  МассивВозврата - массив объектов модели из CRM.  
//  
Функция ПолучитьМассивМоделей(НастройкаПодключения,id_бренда = Неопределено,МоделиTradeIn) Экспорт      
	
	Если МоделиTradeIn = Ложь Тогда
		Если id_бренда = Неопределено Тогда
			Запрос = "/yii/api/refModel";
		Иначе
			id_бренда = Строка(id_бренда);
			id_бренда = СтрЗаменить(id_бренда,Символы.НПП,"");	
			Запрос = "/yii/api/refModel?brand_id=" + Инфотек_Запросы.СтрокаВФорматеURL(id_бренда) + "&is_deleted=0";
		КонецЕсли;
	Иначе
		Если id_бренда = Неопределено Тогда
			Запрос = "/yii/api/reference/model";
		Иначе
			id_бренда = Строка(id_бренда);
			id_бренда = СтрЗаменить(id_бренда,Символы.НПП,"");	
			Запрос = "/yii/api/reference/model?brand_id=" + Инфотек_Запросы.СтрокаВФорматеURL(id_бренда) + "&is_deleted=0";
		КонецЕсли;
   	КонецЕсли;
	КоличествоСтраниц = Инфотек_Запросы.ПолучитьКоличествоСтраницИзОтвета(Запрос,НастройкаПодключения);
	
	ТекущаяСтраница = 1;
	МассивВозврата = Новый Массив;
	
	Пока ТекущаяСтраница <= КоличествоСтраниц Цикл  
		Если МоделиTradeIn = Ложь Тогда
			Если id_бренда = Неопределено Тогда
				ЗапросКВыполнению = Запрос + "?RefModelSearch_page=" + Формат(ТекущаяСтраница,"ЧН=0; ЧГ=0");		
			Иначе
				ЗапросКВыполнению = Запрос + "&RefModelSearch_page=" + Формат(ТекущаяСтраница,"ЧН=0; ЧГ=0");
			КонецЕсли;
		Иначе   
			Если id_бренда = Неопределено Тогда
				ЗапросКВыполнению = Запрос + "?ModelSearch_page=" + Формат(ТекущаяСтраница,"ЧН=0; ЧГ=0");		
			Иначе
				ЗапросКВыполнению = Запрос + "&ModelSearch_page=" + Формат(ТекущаяСтраница,"ЧН=0; ЧГ=0");
			КонецЕсли;	
		КонецЕсли;
		Ответ = Инфотек_Запросы.GETЗапрос(ЗапросКВыполнению,НастройкаПодключения);
		
		Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
			СтруктураJson = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);		
			Для каждого Элемент ИЗ СтруктураJson.result Цикл
				МассивВозврата.Добавить(Инфотек_ОбщиеПроцедуры.СкопироватьРекурсивно(Элемент));
			КонецЦикла;
		КонецЕсли;
		ТекущаяСтраница = ТекущаяСтраница + 1;
	КонецЦикла;
	
	Возврат МассивВозврата;
	
КонецФункции

// Функция получения массива комплектаций из CRM     
//                           
// Параметры:
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключения - Ссылка на настройку подключения для получения параметров авторизации.
//  id_модели            - Число - ID модели CRM.
//
// Возвращаемое значение:
//  МассивВозврата - массив объектов комплектации из CRM.  
//  
Функция ПолучитьМассивКомплектаций(НастройкаПодключения,id_модели = Неопределено) Экспорт   
	
	Если id_модели = Неопределено Тогда
		Запрос = "/yii/api/refEquipment";
	Иначе	
		id_модели = Строка(id_модели);
		id_модели = СтрЗаменить(id_модели,Символы.НПП,"");	
		Запрос = "/yii/api/refEquipment?model_id=" + Инфотек_Запросы.СтрокаВФорматеURL(id_модели);
	КонецЕсли;
	
	КоличествоСтраниц = Инфотек_Запросы.ПолучитьКоличествоСтраницИзОтвета(Запрос,НастройкаПодключения);
	
	ТекущаяСтраница = 1;
	МассивВозврата = Новый Массив;
	
	Пока ТекущаяСтраница <= КоличествоСтраниц Цикл
		Если id_модели = Неопределено Тогда
			ЗапросКВыполнению = Запрос + "?RefEquipmentSearch_page=" + Формат(ТекущаяСтраница,"ЧН=0; ЧГ=0");			
		Иначе
			ЗапросКВыполнению = Запрос + "&status=1&RefEquipmentSearch_page=" + Формат(ТекущаяСтраница,"ЧН=0; ЧГ=0");
		КонецЕсли;
		Ответ = Инфотек_Запросы.GETЗапрос(ЗапросКВыполнению,НастройкаПодключения);
		
		Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
			СтруктураJson = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);		
			Для каждого Элемент ИЗ СтруктураJson.result Цикл
				МассивВозврата.Добавить(Инфотек_ОбщиеПроцедуры.СкопироватьРекурсивно(Элемент));
			КонецЦикла;
		КонецЕсли;
		ТекущаяСтраница = ТекущаяСтраница + 1;
	КонецЦикла;
	
	Возврат МассивВозврата;
	
КонецФункции

// Функция получения массива мест хранения из CRM     
//                           
// Параметры:
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  МассивВозврата - массив объектов мест хранения из CRM.  
//  
Функция ПолучитьМассивМестХранения(НастройкаПодключения) Экспорт      
	
	Запрос = "/yii/api/WarehouseStoragePlace";
	КоличествоСтраниц = Инфотек_Запросы.ПолучитьКоличествоСтраницИзОтвета(Запрос,НастройкаПодключения);
	
	ТекущаяСтраница = 1;
	МассивВозврата = Новый Массив;
	
	Пока ТекущаяСтраница <= КоличествоСтраниц Цикл
		ЗапросКВыполнению = Запрос + "?WHStoragePlaceSearch_page=" + Формат(ТекущаяСтраница,"ЧН=0; ЧГ=0");	
		Ответ = Инфотек_Запросы.GETЗапрос(ЗапросКВыполнению,НастройкаПодключения);
		
		Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
			СтруктураJson = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);		
			Для каждого Элемент ИЗ СтруктураJson.result Цикл
				МассивВозврата.Добавить(Инфотек_ОбщиеПроцедуры.СкопироватьРекурсивно(Элемент));
			КонецЦикла;
		КонецЕсли;
		ТекущаяСтраница = ТекущаяСтраница + 1;
	КонецЦикла;
	
	Возврат МассивВозврата;	  
	
КонецФункции

// Функция получения массива источников обращений из CRM     
//                           
// Параметры:
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  МассивВозврата - массив объектов источники обращений из CRM.  
//  
Функция ПолучитьМассивИсточниковОбращений(НастройкаПодключения) Экспорт      
	
	Запрос = "/yii/api/Source";
	КоличествоСтраниц = Инфотек_Запросы.ПолучитьКоличествоСтраницИзОтвета(Запрос,НастройкаПодключения);
	
	ТекущаяСтраница = 1;
	МассивВозврата = Новый Массив;
	
	Пока ТекущаяСтраница <= КоличествоСтраниц Цикл
		ЗапросКВыполнению = Запрос + "?Source_page=" + Формат(ТекущаяСтраница,"ЧН=0; ЧГ=0");	
		Ответ = Инфотек_Запросы.GETЗапрос(ЗапросКВыполнению,НастройкаПодключения);
		
		Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
			СтруктураJson = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);		
			Для каждого Элемент ИЗ СтруктураJson.result Цикл
				МассивВозврата.Добавить(Инфотек_ОбщиеПроцедуры.СкопироватьРекурсивно(Элемент));
			КонецЦикла;
		КонецЕсли;
		ТекущаяСтраница = ТекущаяСтраница + 1;
	КонецЦикла;
	
	Возврат МассивВозврата;
	
КонецФункции

// Функция получения массива причин отказа из CRM     
//                           
// Параметры:
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  МассивВозврата - массив объектов причин отказа из CRM.  
//  
Функция ПолучитьМассивПричинОтказа(НастройкаПодключения) Экспорт      
	
	Запрос = "/yii/api/ContactResult";
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	МассивВозврата = Новый Массив;
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		СтруктураJson = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);		
		Для каждого Элемент ИЗ СтруктураJson.result Цикл
			МассивВозврата.Добавить(Инфотек_ОбщиеПроцедуры.СкопироватьРекурсивно(Элемент));
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивВозврата;
	
КонецФункции

// Процедура получения массива обращений из CRM     
//                           
// Параметры:
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
Процедура ПолучитьМассивОбращенийCRM(НастройкаПодключения) Экспорт      
	
	МассивОбращений = Новый Массив;
	
	Запрос = "/yii/api/preparedServiceCase?state=0&createdSince=" + Формат(ДобавитьМесяц(ТекущаяДата(),-1),"ДФ=dd.MM.yyyy");
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда  
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку()); 	
		СтруктураJson = ПрочитатьJSON(ЧтениеJSON,Ложь);			
		Для каждого Элемент Из СтруктураJson.result Цикл 
			МассивОбращений.Добавить(Инфотек_ОбщиеПроцедуры.СкопироватьРекурсивно(Элемент));
		КонецЦикла;
	КонецЕсли; 
	Если МассивОбращений.Количество() > 0 Тогда 
		ОбработатьМассивОбращений(МассивОбращений,НастройкаПодключения);
	КонецЕсли;
	МассивОбращений.Очистить();
	
	Запрос = "/yii/api/preparedServiceCase?state=1&createdSince=" + Формат(ДобавитьМесяц(ТекущаяДата(),-1),"ДФ=dd.MM.yyyy");
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда 
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку()); 	
		СтруктураJson = ПрочитатьJSON(ЧтениеJSON,Ложь);			
		Для каждого Элемент Из СтруктураJson.result Цикл 
			МассивОбращений.Добавить(Инфотек_ОбщиеПроцедуры.СкопироватьРекурсивно(Элемент));
		КонецЦикла;
	КонецЕсли;
	Если МассивОбращений.Количество() > 0 Тогда 
		ОбработатьМассивОбращений(МассивОбращений,НастройкаПодключения);
	КонецЕсли;
	
	ЗакрытьЛишниеОбращения(НастройкаПодключения); 
	
КонецПроцедуры

// Процедура обработки массива обращений из CRM, обновление и создание записей регистра     
//                           
// Параметры:
//  МассивОбращений - Массив - Обращения, полученные из CRM.  
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
Процедура ОбработатьМассивОбращений(МассивОбращений,НастройкаПодключения)
	
	Для Каждого Обращение Из МассивОбращений Цикл   
		Если ЗначениеЗаполнено(Обращение.id) Тогда
			МенеджерЗаписи = РегистрыСведений.Инфотек_ОбращенияCRM.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Идентификатор = Обращение.id;
			МенеджерЗаписи.НастройкаПодключения = НастройкаПодключения;     
			МенеджерЗаписи.Статус = Перечисления.Инфотек_СтатусыОбращений.ВРаботе;
			МенеджерЗаписи.Прочитать();
			Если Не МенеджерЗаписи.Выбран() Тогда 
				Если Обращение.state = "1" Тогда 
					МенеджерЗаписи.Статус = Перечисления.Инфотек_СтатусыОбращений.ВРаботе;  
				ИначеЕсли Обращение.state = "0" Тогда 
					МенеджерЗаписи.Статус = Перечисления.Инфотек_СтатусыОбращений.НеВзятВРаботу;
				Иначе
					МенеджерЗаписи.Статус = Перечисления.Инфотек_СтатусыОбращений.ВзятВРаботу;
				КонецЕсли;
			КонецЕсли;     
			СтруктураАвто = Обращение.clientVehicle;
			МенеджерЗаписи.Автомобиль = Инфотек_ИнтеграцияCRMПереопределяемый.НайтиАвтомобильПоСтруктуре(СтруктураАвто,НастройкаПодключения);
			Если Обращение.Свойство("generalClient") Тогда
				
				СтруктураКлиент = Обращение.generalClient;
				Тип = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураКлиент.type);		
				Если Найти(Тип, "individual") <> 0 Тогда
					СтруктураФизЛицо = СтруктураКлиент.primaryPerson;    
					Фамилия = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.lastName);
					Имя = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.firstName);
					Отчество = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.middleName);		
					Наименование  = СокрЛП(Фамилия + " " + Имя + " " + Отчество);
					МассивТелефоны = СтруктураФизЛицо.phones;
					Для каждого Эл из МассивТелефоны Цикл
						Если ЗначениеЗаполнено(Эл.number) Тогда      	
							МенеджерЗаписи.Телефон = Эл.number;
							Контрагент =  Инфотек_ИнтеграцияCRMПереопределяемый.НайтиПоНомеруТелефонаФИО(Эл.number,Наименование);	
							Если Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
								Контрагент = Инфотек_ИнтеграцияCRMПереопределяемый.НайтиПоНомеруТелефона(Эл.number);
							КонецЕсли;	
						КонецЕсли; 	
					КонецЦикла;
					ДатаРожд      = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.birthday);
					Наименование  = Фамилия + " " + Имя + " " + Отчество;
					
					Если ЗначениеЗаполнено(Контрагент) Тогда
						МенеджерЗаписи.Контрагент = Контрагент;
					Иначе 
						Контрагент = Инфотек_ИнтеграцияCRMПереопределяемый.НайтиПоФИОДатеРождения(Наименование,ДатаРожд);			 
						Если ЗначениеЗаполнено(Контрагент) Тогда
							МенеджерЗаписи.Контрагент = Контрагент;              
						Иначе
							МенеджерЗаписи.Контрагент = Фамилия + " " + Имя + " " + Отчество;    
						КонецЕсли;
					КонецЕсли;		
				ИначеЕсли Найти(Тип, "business") <> 0 Тогда			
					СтруктураОрганизация =  СтруктураКлиент.company;			
					НаименованиеКомпании = СтруктураОрганизация.name;
					email  = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураОрганизация.email);
					ИНН    = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураОрганизация.inn);
					КПП    = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураОрганизация.kpp);
					ОКПО   = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураОрганизация.ogrn); 
					
					МассивТелефоны  = СтруктураОрганизация.phones;
					
					//1.Поискать по ОКПО
					Если ЗначениеЗаполнено(ОКПО) Тогда
						Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодПоОКПО",ОКПО);
					КонецЕсли;
					
					//2.Поискать по ИНН
					Если Контрагент = Справочники.Контрагенты.ПустаяСсылка() И ЗначениеЗаполнено(ИНН) Тогда
						Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН",ИНН);
					КонецЕсли;
					
					////3.Поискать по КПП
					//Если Контрагент = Справочники.Контрагенты.ПустаяСсылка() И ЗначениеЗаполнено(КПП) Тогда
					//	Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КПП",КПП);
					//КонецЕсли;    
					
					//4.По номеру телефона
					Если Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
						//Учесть +,7,8
						Для каждого Эл из МассивТелефоны Цикл
							Если ЗначениеЗаполнено(Эл.number) Тогда
								Контрагент = Инфотек_ИнтеграцияCRMПереопределяемый.НайтиПоНомеруТелефона(Эл.number);
								Если Не Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
									Прервать;
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли; 
					Если ЗначениеЗаполнено(Контрагент) Тогда
						МенеджерЗаписи.Контрагент = Контрагент;
					Иначе
						МенеджерЗаписи.Контрагент = НаименованиеКомпании;
					КонецЕсли;			
				КонецЕсли;      
				МенеджерЗаписи.ПричинаОбращения = Инфотек_ОбщиеПроцедуры.УбратьКавычки(Обращение.service_client_statement);      
				Попытка
					ФИОМастера = Обращение.assignee.person;
					ИдентификаторМастера = Обращение.assignee.id;
					Если ЗначениеЗаполнено(ИдентификаторМастера) Тогда
						Мастер = Инфотек_ОбщиеПроцедуры.ПолучитьОбъектПоИдентификаторуСоответствия(НастройкаПодключения,ИдентификаторМастера,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Сотрудник);
						Если ЗначениеЗаполнено(Мастер) Тогда
							МенеджерЗаписи.МастерКонсультант = Мастер;
						КонецЕсли;
					КонецЕсли;
					Если Не ЗначениеЗаполнено(Мастер) Тогда
						ЗапросСотр = новый запрос();
						ЗапросСотр.УстановитьПараметр("парФИО",СокрЛП(ФИОМастера));
						ЗапросСотр.Текст = "ВЫБРАТЬ
						|	Сотрудники.Ссылка,
						|	Сотрудники.Наименование,
						|	Сотрудники.Представление
						|ИЗ
						|	Справочник.Сотрудники КАК Сотрудники
						|ГДЕ
						|	Сотрудники.Наименование ПОДОБНО ""%"" + &парФИО + ""%""";
						
						РезультатСотр = ЗапросСотр.Выполнить().Выбрать();
						Если РезультатСотр.Следующий() Тогда
							МенеджерЗаписи.МастерКонсультант = РезультатСотр.Ссылка;
						КонецЕсли;
					КонецЕсли;	  
				Исключение
				КонецПопытки;
				МенеджерЗаписи.НастройкаПодключения = НастройкаПодключения;
				МенеджерЗаписи.ДатаОбращения = Инфотек_ОбщиеПроцедуры.ПреобразоватьСтрокуВДату(Обращение.createdat);
				МенеджерЗаписи.Идентификатор = Обращение.id;
				МенеджерЗаписи.Записать();
			КонецЕсли;
		КонецЕсли;  
	КонецЦикла;	
	
КонецПроцедуры

// Функция получения массива новых автомобилей на складе из CRM
//                           
// Параметры:   
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  МассивВозврата - Массив автомобилей из CRM
//
Функция ПолучитьМассивНовыхАвтомобилейНаСкладе(НастройкаПодключения) Экспорт
	
	МассивВозврата = Неопределено;
	
	Запрос = "/yii/api/warehouseVehicle?isTradeIn=0&metastatus=present";
 	КоличествоСтраниц = Инфотек_Запросы.ПолучитьКоличествоСтраницИзОтвета(Запрос,НастройкаПодключения);
	
	ТекущаяСтраница = 1;
	МассивВозврата = Новый Массив;

	Пока ТекущаяСтраница <= КоличествоСтраниц Цикл
		ЗапросКВыполнению = "/yii/api/warehouseVehicle?WarehouseVehicle_page=" + Формат(ТекущаяСтраница,"ЧН=0; ЧГ=0") + "&isTradeIn=0&metastatus=present";	
		Ответ = Инфотек_Запросы.GETЗапрос(ЗапросКВыполнению,НастройкаПодключения);	
		Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
			СтруктураJson = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);		
			Для Каждого Элемент ИЗ СтруктураJson.result Цикл
				МассивВозврата.Добавить(Инфотек_ОбщиеПроцедуры.СкопироватьРекурсивно(Элемент));
			КонецЦикла;
		КонецЕсли;
		ТекущаяСтраница = ТекущаяСтраница + 1;
	КонецЦикла;
	
	Возврат МассивВозврата;
	
КонецФункции     

// Функция получения массива подержанных автомобилей на складе из CRM
//                           
// Параметры:   
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  МассивВозврата - Массив автомобилей из CRM
//
Функция ПолучитьМассивБУАвтомобилейНаСкладе(НастройкаПодключения) Экспорт
	
	МассивВозврата = Неопределено;

	МассивВозврата = Новый Массив;
	
	Запрос = "/yii/api/warehouseVehicle?isTradeIn=1&metastatus=waiting";
 	КоличествоСтраниц = Инфотек_Запросы.ПолучитьКоличествоСтраницИзОтвета(Запрос,НастройкаПодключения);
	
	ТекущаяСтраница = 1;

	Пока ТекущаяСтраница <= КоличествоСтраниц Цикл
		ЗапросКВыполнению = "/yii/api/warehouseVehicle?WarehouseVehicle_page=" + Формат(ТекущаяСтраница,"ЧН=0; ЧГ=0") + "&isTradeIn=1&metastatus=waiting";	
		Ответ = Инфотек_Запросы.GETЗапрос(ЗапросКВыполнению,НастройкаПодключения);	
		Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
			СтруктураJson = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);		
			Для Каждого Элемент ИЗ СтруктураJson.result Цикл
				МассивВозврата.Добавить(Инфотек_ОбщиеПроцедуры.СкопироватьРекурсивно(Элемент));
			КонецЦикла;
		КонецЕсли;
		ТекущаяСтраница = ТекущаяСтраница + 1;
	КонецЦикла;

	Запрос = "/yii/api/warehouseVehicle?isTradeIn=1&metastatus=on-sale";
	КоличествоСтраниц = Инфотек_Запросы.ПолучитьКоличествоСтраницИзОтвета(Запрос,НастройкаПодключения);
	
	ТекущаяСтраница = 1;
	
	Пока ТекущаяСтраница <= КоличествоСтраниц Цикл
		ЗапросКВыполнению = "/yii/api/warehouseVehicle?WarehouseVehicle_page=" + Формат(ТекущаяСтраница,"ЧН=0; ЧГ=0") + "&isTradeIn=1&metastatus=on-sale";	
		Ответ = Инфотек_Запросы.GETЗапрос(ЗапросКВыполнению,НастройкаПодключения);	
		Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
			СтруктураJson = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);		
			Для Каждого Элемент ИЗ СтруктураJson.result Цикл
				МассивВозврата.Добавить(Инфотек_ОбщиеПроцедуры.СкопироватьРекурсивно(Элемент));
			КонецЦикла;
		КонецЕсли;
		ТекущаяСтраница = ТекущаяСтраница + 1;
	КонецЦикла;
	
	Возврат МассивВозврата;
	
КонецФункции

// Процедура получения массива рабочих листов из CRM     
//                           
// Параметры:
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
Функция ПолучитьМассивРабочихЛистовCRM(НастройкаПодключения) Экспорт      
	
	МассивРабочихЛистов = Новый Массив;
	
	Запрос = "/yii/api/retailCase?createdSince=" + Формат(НастройкаПодключения.ДатаНачалаЗагрузкиРабочихЛистов,"ДФ=dd.MM.yyyy") + "&scheduledStageType=11";
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда  
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку()); 	
		СтруктураJson = ПрочитатьJSON(ЧтениеJSON,Ложь);			
		Для каждого Элемент Из СтруктураJson.result Цикл 
			МассивРабочихЛистов.Добавить(Инфотек_ОбщиеПроцедуры.СкопироватьРекурсивно(Элемент));
		КонецЦикла;
	КонецЕсли; 
	
	Запрос = "/yii/api/SaleUsedCase?createdSince=" + Формат(НастройкаПодключения.ДатаНачалаЗагрузкиРабочихЛистов,"ДФ=dd.MM.yyyy") + "&scheduledStageType=11";
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда  
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку()); 	
		СтруктураJson = ПрочитатьJSON(ЧтениеJSON,Ложь);			
		Для каждого Элемент Из СтруктураJson.result Цикл 
			МассивРабочихЛистов.Добавить(Инфотек_ОбщиеПроцедуры.СкопироватьРекурсивно(Элемент));
		КонецЦикла;
	КонецЕсли; 
	
	Запрос = "/yii/api/CorporateCase?createdSince=" + Формат(НастройкаПодключения.ДатаНачалаЗагрузкиРабочихЛистов,"ДФ=dd.MM.yyyy") + "&scheduledStageType=11";
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда  
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку()); 	
		СтруктураJson = ПрочитатьJSON(ЧтениеJSON,Ложь);			
		Для каждого Элемент Из СтруктураJson.result Цикл 
			МассивРабочихЛистов.Добавить(Инфотек_ОбщиеПроцедуры.СкопироватьРекурсивно(Элемент));
		КонецЦикла;
	КонецЕсли; 
	
	Возврат МассивРабочихЛистов;

КонецФункции

// Процедура получения массива рабочих листов выкупа из CRM     
//                           
// Параметры:
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
Функция ПолучитьМассивРабочихЛистовВыкупаCRM(НастройкаПодключения) Экспорт      
	
	МассивРабочихЛистов = Новый Массив;
	
	Запрос = "/yii/api/TradeinCase?createdSince=" + Формат(НастройкаПодключения.ДатаНачалаЗагрузкиРабочихЛистов,"ДФ=dd.MM.yyyy") + "&scheduledStageType=5";
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда  
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку()); 	
		СтруктураJson = ПрочитатьJSON(ЧтениеJSON,Ложь);			
		Для Каждого Элемент Из СтруктураJson.result Цикл 
			МассивРабочихЛистов.Добавить(Инфотек_ОбщиеПроцедуры.СкопироватьРекурсивно(Элемент));
		КонецЦикла;
	КонецЕсли; 

	Возврат МассивРабочихЛистов;
	
КонецФункции

// Функция создает/обновляет данные по контрагенту из CRM     
//                           
// Параметры:
//  СтруктураКлиент - Структура - Обращение полученное из CRM.  
// Возвращаемое значение:
//  Контрагент - ссылка на элемент справочника контрагенты.  
//
Функция СоздатьОбновитьКонтрагента(СтруктураКлиент, НастройкаПодключения) Экспорт           
	Тип = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураКлиент.type);		
	
	Если Найти(Тип, "individual") <> 0 Тогда
		СтруктураФизЛицо =  СтруктураКлиент.primaryPerson;
		МассивТелефоны   =  СтруктураФизЛицо.phones;
		
		црмКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
		Контрагент    = Справочники.Контрагенты.ПустаяСсылка();
		
		Фамилия       = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.lastName);
		Имя           = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.firstName);
		Отчество      = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.middleName);	
		Пол           = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.gender);
		ДатаРожд      = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.birthday);
		Наименование  = СокрЛП(Фамилия + " " + Имя + " " + Отчество);
		
		Для Каждого Эл из МассивТелефоны Цикл
			Если ЗначениеЗаполнено(Эл.number) Тогда     
				црмКонтрагент = Инфотек_ИнтеграцияCRMПереопределяемый.НайтиПоНомеруТелефонаФИО(Эл.number,Наименование);
				Если ЗначениеЗаполнено(црмКонтрагент) Тогда  
					Контрагент = црмКонтрагент;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если обЗначениеНеЗаполнено(Контрагент) Тогда
			црмКонтрагент = Инфотек_ИнтеграцияCRMПереопределяемый.НайтиПоФИОДатеРождения(Наименование,ДатаРожд);  
			Если ЗначениеЗаполнено(црмКонтрагент) Тогда
				Контрагент = црмКонтрагент; 
			КонецЕсли;
		КонецЕсли;
		
		НовыйКонтрагент = Ложь;	
		Если обЗначениеНеЗаполнено(Контрагент) Тогда		
			НовКонтрагент = Справочники.Контрагенты.СоздатьЭлемент(); 
			НовыйКонтрагент = Истина;	
			НовКонтрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо;			
			НовКонтрагент.Фамилия  = Фамилия;
			НовКонтрагент.Имя      = Имя;
			НовКонтрагент.Отчество = Отчество;	
			НовКонтрагент.Наименование = СокрЛП(Фамилия + " " + Имя + " " + Отчество);
			НовКонтрагент.НаименованиеПолное = СокрЛП(Фамилия + " " + Имя + " " + Отчество);
			ДатаРождения = Инфотек_ОбщиеПроцедуры.ПреобразоватьСтрокуВДату(ДатаРожд);
			НовКонтрагент.ДатаРождения = ДатаРождения;      
			НовКонтрагент.РекламныйИсточник = Справочники.ИсточникиИнформации.ЛичныйВизит; 
			НовКонтрагент.УстановитьНовыйКод();
			Если ЗначениеЗаполнено(НастройкаПодключения.ГруппаКонтрагентовФизическиеЛица) Тогда
				НовКонтрагент.Родитель = НастройкаПодключения.ГруппаКонтрагентовФизическиеЛица;	
			КонецЕсли;   
			НовКонтрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель; 			
			
		Иначе
			НовКонтрагент = Контрагент.ПолучитьОбъект(); 
			Если НЕ ЗначениеЗаполнено(НовКонтрагент.Фамилия) И ЗначениеЗаполнено(Фамилия) Тогда
				НовКонтрагент.Фамилия  = Фамилия;
				НовКонтрагент.Наименование = СокрЛП(Фамилия + " " + Имя + " " + Отчество);
				НовКонтрагент.НаименованиеПолное = СокрЛП(Фамилия + " " + Имя + " " + Отчество);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(НовКонтрагент.Имя) И ЗначениеЗаполнено(Имя) Тогда
				НовКонтрагент.Имя  = Имя;
				НовКонтрагент.Наименование = СокрЛП(Фамилия + " " + Имя + " " + Отчество);
				НовКонтрагент.НаименованиеПолное = СокрЛП(Фамилия + " " + Имя + " " + Отчество);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(НовКонтрагент.Отчество) И ЗначениеЗаполнено(Отчество) Тогда
				НовКонтрагент.Отчество  = Отчество;
				НовКонтрагент.Наименование = СокрЛП(Фамилия + " " + Имя + " " + Отчество);
				НовКонтрагент.НаименованиеПолное = СокрЛП(Фамилия + " " + Имя + " " + Отчество);
			КонецЕсли; 
			Если НЕ ЗначениеЗаполнено(НовКонтрагент.ДатаРождения) И ЗначениеЗаполнено(ДатаРожд) Тогда
				ДатаРождения = Инфотек_ОбщиеПроцедуры.ПреобразоватьСтрокуВДату(ДатаРожд);
				НовКонтрагент.ДатаРождения = ДатаРождения; 
			КонецЕсли;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Пол) Тогда
			НовКонтрагент.Пол = ?(Пол = "M",Перечисления.ПолФизическихЛиц.Мужской,Перечисления.ПолФизическихЛиц.Женский);
		Иначе
			Если Найти(нрег(Прав(Отчество,3)),"вич") Тогда
				НовКонтрагент.Пол = Перечисления.ПолФизическихЛиц.Мужской;
			ИначеЕсли Найти(нрег(Прав(Отчество,3)),"вна") Тогда
				НовКонтрагент.Пол = Перечисления.ПолФизическихЛиц.Женский;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураФизЛицо.consentProcessingPersonalInformation) Тогда
			Если СтруктураФизЛицо.consentProcessingPersonalInformation = "1" Тогда
				НовКонтрагент.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да;
			Иначе
				НовКонтрагент.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Нет;
			КонецЕсли;
		Иначе
			НовКонтрагент.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Спрашивать;
		КонецЕсли;	 
		
		Если ЗначениеЗаполнено(СтруктураФизЛицо.consentObtainingSmsMailing) Тогда
			Если СтруктураФизЛицо.consentObtainingSmsMailing = "1" Тогда
				НовКонтрагент.СогласиеНаПолучениеSMS = Истина;
			Иначе
				НовКонтрагент.СогласиеНаПолучениеSMS = Ложь;
			КонецЕсли;
		КонецЕсли;	

		Для Каждого Эл Из МассивТелефоны Цикл
			СтруктураЗаписи = Новый структура();
			
			ОсновнойТелефон = Эл.number;
			ТипТелефона     = Эл.type; //1 - рабочий, 2 - мобильный, 3 - факс, 4 - домашний
			Если ТипТелефона = "1" Тогда
				ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонРабочий;
			иначеЕсли ТипТелефона = "2" Тогда
				ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый;
			иначеЕсли ТипТелефона = "3" Тогда
				ВидТелефона = Справочники.ВидыКонтактнойИнформации.Факс;
			иначеЕсли ТипТелефона = "4" Тогда
				ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонДомашний;
			КонецЕсли;
					
			КодСтраны = Лев(ОсновнойТелефон,1);
			СтруктураЗаписи.Вставить("Поле1","+"+КодСтраны);
			
			КодГорода = Сред(ОсновнойТелефон,2,3);
			СтруктураЗаписи.Вставить("Поле2",КодГорода);
			
			НомерТелефона = Сред(ОсновнойТелефон,5);
			СтруктураЗаписи.Вставить("Поле3", НомерТелефона);
			
			СтруктураЗаписи.Вставить("Представление", "+" + КодСтраны + ", " + КодГорода + НомерТелефона);
			НовКонтрагент.ОсновнойТелефон = СтруктураЗаписи.Представление;
			
			НовКонтрагент.ОбменДанными.Загрузка = Истина;
			НовКонтрагент.Записать();
			
			СтруктураЗаписи.Вставить("Объект", НовКонтрагент.Ссылка);
			СтруктураЗаписи.Вставить("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
			СтруктураЗаписи.Вставить("Вид", ВидТелефона);
			СтруктураЗаписи.Вставить("ЗначениеПоУмолчанию", Истина);

			ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "КонтактнаяИнформация");   
		КонецЦикла;
		
		Контрагент = НовКонтрагент.Ссылка;
		
		email = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.email);
		Если ЗначениеЗаполнено(email) Тогда
			СтруктураЗаписи = Новый структура();
			СтруктураЗаписи.Вставить("Объект",Контрагент);
			СтруктураЗаписи.Вставить("Тип",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
			СтруктураЗаписи.Вставить("Вид",Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний);
			СтруктураЗаписи.Вставить("Представление",email);
			ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "КонтактнаяИнформация");
		КонецЕсли;
		
		Если СтруктураФизЛицо.Свойство("address") Тогда 
			СтруктураАдрес = СтруктураФизЛицо.address;
			ЗаписатьАдрес(СтруктураАдрес, Контрагент, Справочники.ВидыКонтактнойИнформации.АдресФактический);
		КонецЕсли;
		
		
		//Вод.удостоверение
		ВодПраваНомер      = СтруктураФизЛицо.driverLicenseNumber;
		ВодПраваДатаВыдачи = СтруктураФизЛицо.driverLicenseIssuedAt;
		ВодПраваВыданы     = СтруктураФизЛицо.driverLicenseIssuedBy;
		ЗапросВодПрава = Новый Запрос;
		ЗапросВодПрава.Текст = 
		"ВЫБРАТЬ
		|	ПодтверждающиеДокументы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
		|ГДЕ
		|	ПодтверждающиеДокументы.Владелец = &Контрагент
		|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Удостоверение)";
		ЗапросВодПрава.УстановитьПараметр("Контрагент", Контрагент);
		РезультатВодПрава = ЗапросВодПрава.Выполнить();
		Если РезультатВодПрава.Пустой() Тогда		
			Если ЗначениеЗаполнено(ВодПраваНомер) И ЗначениеЗаполнено(ВодПраваВыданы)
				И ЗначениеЗаполнено(ВодПраваДатаВыдачи) Тогда
				НовыйПодтверждающийДокумент = Справочники.ПодтверждающиеДокументы.СоздатьЭлемент();
				НовыйПодтверждающийДокумент.Владелец = Контрагент;      
				НовыйПодтверждающийДокумент.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.Удостоверение;
				НовыйПодтверждающийДокумент.Номер = ВодПраваНомер;
				НовыйПодтверждающийДокумент.ДатаВыдачи = Инфотек_ОбщиеПроцедуры.ПреобразоватьСтрокуВДату(ВодПраваДатаВыдачи);
				НовыйПодтверждающийДокумент.КемВыдан =  ВодПраваВыданы;
				НовыйПодтверждающийДокумент.УстановитьНовыйКод();
				НовыйПодтверждающийДокумент.Наименование = НовыйПодтверждающийДокумент.СформироватьНаименование();
				НовыйПодтверждающийДокумент.Записать();
			КонецЕсли;
		КонецЕсли;  
		
		//Паспорт
		Паспорт_Серия      = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.passportSeries);
		Паспорт_Номер      = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.passportNumber);
		Паспорт_ДатаВыдачи = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.passportIssuedAt);
		Паспорт_Выдан      = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.passportIssuedBy);
		ПаспортКодПодразд  = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.passportDepartmentCode);
		ЗапросПаспорт = Новый Запрос;
		ЗапросПаспорт.Текст = 
		"ВЫБРАТЬ
		|	ПодтверждающиеДокументы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
		|ГДЕ
		|	ПодтверждающиеДокументы.Владелец = &Контрагент
		|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Паспорт)";
		ЗапросПаспорт.УстановитьПараметр("Контрагент", Контрагент);
		РезультатПаспорт = ЗапросПаспорт.Выполнить();
		Если РезультатПаспорт.Пустой() Тогда			
			Если ЗначениеЗаполнено(Паспорт_Серия) И ЗначениеЗаполнено(Паспорт_Номер)
				И ЗначениеЗаполнено(Паспорт_Выдан) И ЗначениеЗаполнено(Паспорт_ДатаВыдачи) Тогда
				НовыйПодтверждающийДокумент = Справочники.ПодтверждающиеДокументы.СоздатьЭлемент();
				НовыйПодтверждающийДокумент.Владелец = Контрагент;
				НовыйПодтверждающийДокумент.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.Паспорт;
				НовыйПодтверждающийДокумент.Серия = Паспорт_Серия;
				НовыйПодтверждающийДокумент.Номер = Паспорт_Номер;
				НовыйПодтверждающийДокумент.ДатаВыдачи = Инфотек_ОбщиеПроцедуры.ПреобразоватьСтрокуВДату(Паспорт_ДатаВыдачи);
				НовыйПодтверждающийДокумент.КемВыдан =  Паспорт_Выдан;
				НовыйПодтверждающийДокумент.УстановитьНовыйКод();
				НовыйПодтверждающийДокумент.Наименование = НовыйПодтверждающийДокумент.СформироватьНаименование();
				НовыйПодтверждающийДокумент.Записать();
			КонецЕсли;
		КонецЕсли;   
		
	ИначеЕсли Найти(Тип, "business") <> 0 Тогда
		црмКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
		Контрагент    = Справочники.Контрагенты.ПустаяСсылка();
		
		СтруктураОрганизация =  СтруктураКлиент.company;
		
		НаименованиеКомпании = СтруктураОрганизация.name;
		email  = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураОрганизация.email);
		ИНН    = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураОрганизация.inn);
		КПП    = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураОрганизация.kpp);
		ОКПО   = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураОрганизация.ogrn); 
		
		МассивТелефоны  = СтруктураОрганизация.phones;  
		Если МассивТелефоны.Количество() = 0 Тогда 
			СтруктураФизЛицо =  СтруктураКлиент.primaryPerson;
			МассивТелефоны   =  СтруктураФизЛицо.phones;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИНН) Тогда
			ЦрмКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", ИНН);
		КонецЕсли;

		Если ЗначениеЗаполнено(ОКПО) И обЗначениеНеЗаполнено(ЦрмКонтрагент) Тогда
			ЦрмКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодПоОКПО", ОКПО);
		КонецЕсли;
		
		Если обЗначениеНеЗаполнено(ЦрмКонтрагент) Тогда
			//Создаем
			НовКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
			НовКонтрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо;
			НовКонтрагент.Наименование       = НаименованиеКомпании;
			НовКонтрагент.НаименованиеПолное = НаименованиеКомпании;
			НовКонтрагент.КодПоОКПО          = ОКПО;
			НовКонтрагент.ИНН                = ИНН;
			НовКонтрагент.КПП                = КПП;
			НовКонтрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель;
			НовКонтрагент.РекламныйИсточник = Справочники.ИсточникиИнформации.ЛичныйВизит;
			Если ЗначениеЗаполнено(НастройкаПодключения.ГруппаКонтрагентовЮридическиеЛица) Тогда
				НовКонтрагент.Родитель = НастройкаПодключения.ГруппаКонтрагентовЮридическиеЛица;	
			КонецЕсли;
			НовКонтрагент.УстановитьНовыйКод();
			НовКонтрагент.ОбменДанными.Загрузка = Истина;
			НовКонтрагент.Записать();
			Контрагент = НовКонтрагент.Ссылка;
			
		Иначе
			Контрагент = ЦрмКонтрагент;
		КонецЕсли;
		
		Если СтруктураОрганизация.Свойство("address") Тогда 
			СтруктураАдрес = СтруктураОрганизация.address;
			ЗаписатьАдрес(СтруктураАдрес, Контрагент, Справочники.ВидыКонтактнойИнформации.АдресФактический);
		КонецЕсли;
		Если СтруктураОрганизация.Свойство("juridicalAddress") Тогда 
			СтруктураАдрес = СтруктураОрганизация.juridicalAddress;
			ЗаписатьАдрес(СтруктураАдрес, Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
		КонецЕсли;
		
		ОсновнойТелефон = "";
		Для Каждого Эл Из МассивТелефоны Цикл
			СтруктураЗаписи = Новый Структура();
			
			ОсновнойТелефон = Эл.number;
			ТипТелефона     = Эл.type; //1 - рабочий, 2 - мобильный, 3 - факс, 4 - домашний
			Если ТипТелефона = "1" Тогда
				ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонРабочий;
			иначеЕсли ТипТелефона = "2" Тогда
				ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый;
			иначеЕсли ТипТелефона = "3" Тогда
				ВидТелефона = Справочники.ВидыКонтактнойИнформации.Факс;
			иначеЕсли ТипТелефона = "4" Тогда
				ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонДомашний;
			КонецЕсли;
			
			СтруктураЗаписи.Вставить("Объект", Контрагент);
			СтруктураЗаписи.Вставить("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
			
			СтруктураЗаписи.Вставить("Вид", ВидТелефона);
			СтруктураЗаписи.Вставить("ЗначениеПоУмолчанию", Истина);
			
			КодСтраны = Лев(ОсновнойТелефон,1);
			СтруктураЗаписи.Вставить("Поле1","+"+КодСтраны);
			
			КодГорода = Сред(ОсновнойТелефон,2,3);
			СтруктураЗаписи.Вставить("Поле2",КодГорода);
			
			НомерТелефона = Сред(ОсновнойТелефон,5);
			СтруктураЗаписи.Вставить("Поле3",НомерТелефона);
			
			СтруктураЗаписи.Вставить("Представление", "+" + КодСтраны + ", " + КодГорода + НомерТелефона);
			ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "КонтактнаяИнформация");   
			ОсновнойТелефон = СтруктураЗаписи.Представление;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ОсновнойТелефон) Тогда
			ОбКонтрагент = Контрагент.ПолучитьОбъект();		
			ОбКонтрагент.ОсновнойТелефон = ОсновнойТелефон;
			ОбКонтрагент.ОбменДанными.Загрузка = Истина;
			ОбКонтрагент.Записать();
		КонецЕсли;
	КонецЕсли;		     
	
	Возврат Контрагент;
КонецФункции

////////////////////////////////////////////////////////////////////////////

// Функция получает/создает Договор взаиморасчетов     
//                           
// Параметры:
//  КлиентСсылка - ссылка на элемент справочника Контрагенты
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM
//  ВидДоговора - элемент перечисления Виды договоров
// Возвращаемое значение:
//  Контрагент - ссылка на элемент справочника контрагенты.  
//
Функция ПолучитьСоздатьДоговорВзаиморасчетов(КлиентСсылка, НастройкаПодключения, ВидДоговора)
	ЗапросДоговор = Новый Запрос();
	ЗапросДоговор.УстановитьПараметр("парКонтрагент", КлиентСсылка);
	ЗапросДоговор.УстановитьПараметр("Организация", НастройкаПодключения.Организация);
	ЗапросДоговор.УстановитьПараметр("ВидДоговора", ВидДоговора);
	ЗапросДоговор.Текст = "ВЫБРАТЬ
	                      |	ДоговорыВзаиморасчетов.Ссылка КАК Ссылка,
	                      |	ДоговорыВзаиморасчетов.Владелец КАК Владелец
	                      |ИЗ
	                      |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	                      |ГДЕ
	                      |	ДоговорыВзаиморасчетов.Владелец = &парКонтрагент
	                      |	И НЕ ДоговорыВзаиморасчетов.ПометкаУдаления
	                      |	И ДоговорыВзаиморасчетов.Организация = &Организация
	                      |	И ДоговорыВзаиморасчетов.ВидДоговора = &ВидДоговора";
	
	РезультатДог = ЗапросДоговор.Выполнить();
	Если РезультатДог.Пустой() Тогда	
		НовДоговор = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
		НовДоговор.Владелец = КлиентСсылка;
		НовДоговор.ВидДоговора = ВидДоговора;
		НовДоговор.ВалютаВзаиморасчетов = Справочники.Валюты.НайтиПоКоду("643");;
		НовДоговор.ВидОплаты =  Перечисления.ВидыОплаты.ПроизвольнаяОплата;
		НовДоговор.ДатаНачала = ТекущаяДата();
		НовДоговор.Организация = НастройкаПодключения.Организация;
		НовДоговор.Подразделение = НастройкаПодключения.ПодразделениеОрганизации; 
		НовДоговор.ТипДоговора = Перечисления.ТипыДоговоров.Договор;
		НовДоговор.Основной = Истина;
		НовДоговор.ДляАвтосалона = Истина;    
		НовДоговор.ЕдиницаИзмеренияАвтоработВПечатныхФормах = Перечисления.ЕдиницаИзмеренияАвтоработВПечатныхФормах.ЕдиницаИзмеренияПрочерк;
		СформироватьНаименование(НовДоговор);
		НовДоговор.УстановитьНовыйКод();
		НовДоговор.ОбменДанными.Загрузка = Истина;
		НовДоговор.Записать();
		Возврат НовДоговор.Ссылка;
		
	Иначе
		ВыборкаДоговор = РезультатДог.Выбрать();
		ВыборкаДоговор.Следующий();
		Возврат ВыборкаДоговор.Ссылка;
	КонецЕсли;
КонецФункции

// Функция получает/создает автомобиль для рабочего листа трейд-ин из CRM     
//                           
// Параметры:
//  СтруктураРезультата - резутьтат запроса рабочего листа трейд-ин из CRM
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM
// Возвращаемое значение:
//  Автомобиль - ссылка на элемент справочника Автомобили.  
//
Функция ПолучитьСоздатьАвтомобильТрейдИн(СтруктураРезультата, НастройкаПодключения)
	СтруктураАвто  = СтруктураРезультата.vehicle;  
	VIN            = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАвто.vin);
	ГосНомер       = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАвто.stateNumber); 
	ИдМодели       = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАвто.refModelId);
	ИдКомплектации = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАвто.ref_equipment_id); 
	ГодВыпуска     = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАвто.productionYear);     

	Если обЗначениеНеЗаполнено(VIN) Тогда
		Сообщить("Не указан VIN автомобиля в Рабочем листе TradeIn №" + Строка(СтруктураРезультата.id), СтатусСообщения.Внимание);
		Возврат Справочники.Автомобили.ПустаяСсылка();
	КонецЕсли;
	
	Кузов = "";
	Цвет = ""; 
	Салон = "";
	мМассивИнфо = Неопределено;
	Если СтруктураРезультата.Свойство("vehicleInfo", мМассивИнфо) И ТипЗнч(мМассивИнфо) = Тип("Массив")
		И мМассивИнфо.Количество() > 0 Тогда
		Кузов = Инфотек_ОбщиеПроцедуры.УбратьКавычки(мМассивИнфо[0].series);
		Цвет = Инфотек_ОбщиеПроцедуры.УбратьКавычки(мМассивИнфо[0].color); 
		Салон = Инфотек_ОбщиеПроцедуры.УбратьКавычки(мМассивИнфо[0].skin);
	КонецЕсли;
	
	МодельАвтомобиля = Инфотек_ОбщиеПроцедуры.ПолучитьОбъектПоИдентификаторуСоответствия(НастройкаПодключения,ИдМодели,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Модель);
	Если МодельАвтомобиля = Неопределено Тогда
		СтруктураМодели = Инфотек_ИнтеграцияCRM.ПолучитьМодельПоИдентификатору(НастройкаПодключения, ИдМодели);
		СтруктураБренда = Инфотек_ИнтеграцияCRM.ПолучитьБрендПоИдентификатору(НастройкаПодключения,СтруктураМодели.brand_id);
		МодельАвтомобиля = Справочники.Модели.НайтиПоНаименованию(СтруктураБренда.Name + " " + СтруктураМодели.Name);
		Если обЗначениеНеЗаполнено(МодельАвтомобиля) Тогда
			ЗапросГруппыБренда = Новый Запрос;
			ЗапросГруппыБренда.Текст = 
			"ВЫБРАТЬ
			|	Модели.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Модели КАК Модели
			|ГДЕ
			|	Модели.Наименование = &Наименование
			|	И Модели.ЭтоГруппа = ИСТИНА
			|	И Модели.Родитель = &СторонниеБренды";
			
			ЗапросГруппыБренда.УстановитьПараметр("Наименование", ВРег(СтруктураБренда.Name));
			ЗапросГруппыБренда.УстановитьПараметр("СторонниеБренды", Справочники.Модели.СТОРОННИЕ_БРЕНДЫ);
			РезультатГруппыБренда = ЗапросГруппыБренда.Выполнить();
			Если РезультатГруппыБренда.Пустой() Тогда
				МодельГруппаОбъект = Справочники.Модели.СоздатьЭлемент();
				МодельГруппаОбъект.ЭтоГруппа = Истина;
				МодельГруппаОбъект.Родитель = Справочники.Модели.СТОРОННИЕ_БРЕНДЫ;
				МодельГруппаОбъект.Наименование = ВРег(СтруктураБренда.Name);
				МодельГруппаОбъект.ОбменДанными.Загрузка = Истина;
				МодельГруппаОбъект.Записать();
				ГруппаБренда = МодельГруппаОбъект.Ссылка;
				
			Иначе
				ВыборкаГруппыБренда = РезультатГруппыБренда.Выбрать();
				ВыборкаГруппыБренда.Следующий();
				ГруппаБренда = ВыборкаГруппыБренда.Ссылка;
			КонецЕсли;

			МаркаСсылка = Инфотек_ОбщиеПроцедуры.ПолучитьОбъектПоИдентификаторуСоответствия(НастройкаПодключения,СтруктураМодели.brand_id,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Бренд);
			Если МаркаСсылка = Неопределено Тогда
				МаркаСсылка = Справочники.Марка.НайтиПоНаименованию(ВРег(СтруктураБренда.Name));
			КонецЕсли;
			МодельОбъект = Справочники.Модели.СоздатьЭлемент();
			МодельОбъект.Наименование = СтруктураБренда.Name + " " + СтруктураМодели.Name;    
			МодельОбъект.НаименованиеПолное = СтруктураБренда.Name + " " + СтруктураМодели.Name;  
			МодельОбъект.ВалютаУчета = Справочники.Валюты.НайтиПоКоду("643");
			МодельОбъект.Марка = МаркаСсылка;
			МодельОбъект.КатегорияТС = Справочники.КатегорииТранспортныхСредств.АвтомобилиЛегковые;
			МодельОбъект.Родитель = ГруппаБренда;     
			МодельОбъект.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
			МодельОбъект.УстановитьНовыйКод();
			МодельОбъект.ОбменДанными.Загрузка = Истина;
			МодельОбъект.Записать();
			МодельАвтомобиля = МодельОбъект.Ссылка;
		КонецЕсли;		
	КонецЕсли;

	ДополнительныеРеквизитыАвто = Инфотек_JSON.мПрочитатьJSON(СтруктураАвто.dataJson,Истина);   
	Попытка
		ПаспортАвтомобиля = ДополнительныеРеквизитыАвто.reg.passport;
		НомерДвигателя = ПаспортАвтомобиля.engineNumber;
		НомерКузова = ПаспортАвтомобиля.bodyNumber;
		НомерШасси = ПаспортАвтомобиля.chassisNumber; 
	Исключение   
		ПаспортАвтомобиля = Неопределено;
		НомерКузова = "";
		НомерДвигателя = "";
		НомерШасси = "";
	КонецПопытки;									
	Попытка   
		Пробег = ДополнительныеРеквизитыАвто.main.mileage; 
	Исключение 
		Пробег = ""; 
	КонецПопытки;
	Попытка   
		СвидетельствоОРегистрации = ДополнительныеРеквизитыАвто.reg.certificate; 
	Исключение 
		СвидетельствоОРегистрации = Неопределено; 
	КонецПопытки;
	
	ЗапросАвто = Новый Запрос();
	ЗапросАвто.Текст = 
	"ВЫБРАТЬ
	|	Авто.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Автомобили КАК Авто
	|ГДЕ
	|	НЕ Авто.ПометкаУдаления
	|	И НЕ Авто.ЭтоГруппа
	|	И Авто.VIN ПОДОБНО ""%"" + &VIN + ""%""";
	
	ЗапросАвто.УстановитьПараметр("VIN","%"+VIN+"%");
	РезАвто = ЗапросАвто.Выполнить();
	Если Не РезАвто.Пустой() Тогда
		ВыборкаАвто = РезАвто.Выбрать();
		ВыборкаАвто.Следующий();  
		Автомобиль = ВыборкаАвто.Ссылка.ПолучитьОбъект(); 
		Если ЗначениеЗаполнено(НомерДвигателя) Тогда
			Автомобиль.НомерДвигателя = НомерДвигателя;
		КонецЕсли;	
		Если ЗначениеЗаполнено(НомерКузова) Тогда
			Автомобиль.НомерКузова = НомерКузова;
		КонецЕсли;	
		Если ЗначениеЗаполнено(НомерШасси) Тогда
			Автомобиль.НомерШасси = НомерШасси;
		КонецЕсли;   
		Попытка
			Если ЗначениеЗаполнено(ГодВыпуска) Тогда
				Автомобиль.ГодВыпуска = Дата(ГодВыпуска+"0101");
			КонецЕсли;
		Исключение
		КонецПопытки;
		Попытка
			Если ЗначениеЗаполнено(Цвет) Тогда   
				ЦветАвтомобиля = Справочники.Цвета.НайтиПоНаименованию(Цвет);
				Если ЗначениеЗаполнено(ЦветАвтомобиля) Тогда 
					Автомобиль.Цвет = ЦветАвтомобиля;      

				Иначе
					ЦветАвтомобиля = Справочники.Цвета.СоздатьЭлемент();
					ЦветАвтомобиля.Наименование = Цвет; 
					ЦветАвтомобиля.Артикул = Цвет; 
					ЦветАвтомобиля.ЦветПоГИБДД = Цвет;
					ЦветАвтомобиля.УстановитьНовыйКод();
					ЦветАвтомобиля.Записать();
					Автомобиль.Цвет = ЦветАвтомобиля.Ссылка;  
				КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;		
		Попытка
			Если ЗначениеЗаполнено(Кузов) Тогда   
				ТипКузова = Справочники.ТипыКузовов.НайтиПоНаименованию(Кузов);
				Если ЗначениеЗаполнено(ТипКузова) Тогда 
					Автомобиль.ТипКузова = ТипКузова;   
				Иначе
					ТипКузова = Справочники.ТипыКузовов.СоздатьЭлемент();
					ТипКузова.Наименование = Кузов;  
					ТипКузова.УстановитьНовыйКод();
					ТипКузова.Записать();
					Автомобиль.ТипКузова = ТипКузова.Ссылка;  
				КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;		
		Попытка
			Если ЗначениеЗаполнено(Салон) Тогда   
				ТипСалона = Справочники.ТипыСалона.НайтиПоНаименованию(Салон);
				Если ЗначениеЗаполнено(ТипСалона) Тогда 
					Автомобиль.ТипСалона = ТипСалона;      
				Иначе
					ТипСалона = Справочники.ТипыСалона.СоздатьЭлемент();
					ТипСалона.Наименование = Салон;   
					ТипСалона.УстановитьНовыйКод();
					ТипСалона.Записать();
					Автомобиль.ТипСалона = ТипСалона.Ссылка;  
				КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;		
		
	ИначеЕсли ЗначениеЗаполнено(МодельАвтомобиля) Тогда	
		Автомобиль = Справочники.Автомобили.СоздатьЭлемент();
		Автомобиль.VIN = VIN;
		Автомобиль.НомерКузова = VIN;
		Автомобиль.Модель = МодельАвтомобиля;	
		Автомобиль.ВалютаУчета = Автомобиль.Модель.ВалютаУчета;  
		Автомобиль.ВключатьВПрайсЛист = Перечисления.ВидВключенияВПрайсЛист.ПоУмолчанию;
		Попытка
			Если ЗначениеЗаполнено(ГодВыпуска) Тогда
				Автомобиль.ГодВыпуска = Дата(ГодВыпуска+"0101");
			КонецЕсли;
		Исключение
		КонецПопытки;
		Попытка
			Если ЗначениеЗаполнено(Цвет) Тогда   
				ЦветАвтомобиля = Справочники.Цвета.НайтиПоНаименованию(Цвет);
				Если ЗначениеЗаполнено(ЦветАвтомобиля) Тогда 
					Автомобиль.Цвет = ЦветАвтомобиля; 

				Иначе
					ЦветАвтомобиля = Справочники.Цвета.СоздатьЭлемент();
					ЦветАвтомобиля.Наименование = Цвет; 
					ЦветАвтомобиля.Артикул = Цвет; 
					ЦветАвтомобиля.ЦветПоГИБДД = Цвет;
					ЦветАвтомобиля.УстановитьНовыйКод();
					ЦветАвтомобиля.Записать();
					Автомобиль.Цвет = ЦветАвтомобиля.Ссылка; 
				КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;  
		Попытка
			Если ЗначениеЗаполнено(Кузов) Тогда   
				ТипКузова = Справочники.ТипыКузовов.НайтиПоНаименованию(Кузов);
				Если ЗначениеЗаполнено(ТипКузова) Тогда 
					Автомобиль.ТипКузова = ТипКузова;      

				Иначе
					ТипКузова = Справочники.ТипыКузовов.СоздатьЭлемент();
					ТипКузова.Наименование = Кузов;  
					ТипКузова.УстановитьНовыйКод();
					ТипКузова.Записать();
					Автомобиль.ТипКузова = ТипКузова.Ссылка;     
				КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;
		Попытка
			Если ЗначениеЗаполнено(Салон) Тогда   
				ТипСалона = Справочники.ТипыСалона.НайтиПоНаименованию(Салон);
				Если ЗначениеЗаполнено(ТипСалона) Тогда 
					Автомобиль.ТипСалона = ТипСалона;      
				Иначе
					ТипСалона = Справочники.ТипыСалона.СоздатьЭлемент();
					ТипСалона.Наименование = Салон;    
					ТипСалона.УстановитьНовыйКод();
					ТипСалона.Записать();
					Автомобиль.ТипСалона = ТипСалона.Ссылка;  
				КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;		
		Если ЗначениеЗаполнено(НомерДвигателя) Тогда
			Автомобиль.НомерДвигателя = НомерДвигателя;
		КонецЕсли;	
		Если ЗначениеЗаполнено(НомерКузова) Тогда
			Автомобиль.НомерКузова = НомерКузова;
		КонецЕсли;	
		Если ЗначениеЗаполнено(НомерШасси) Тогда
			Автомобиль.НомерШасси = НомерШасси;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Автомобиль.ВалютаУчета) Тогда
			Автомобиль.ВалютаУчета = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		КонецЕсли;   
		Если ЗначениеЗаполнено(ИдКомплектации) Тогда
			КомплектацияАвтомобиля = Инфотек_ОбщиеПроцедуры.ПолучитьОбъектПоИдентификаторуСоответствия(НастройкаПодключения,ИдКомплектации,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Комплектация);
			Если ЗначениеЗаполнено(КомплектацияАвтомобиля) Тогда
				Автомобиль.ВариантКомплектации = КомплектацияАвтомобиля;
			КонецЕсли;
		КонецЕсли;				
		Наименование = "";
		Если ЗначениеЗаполнено(Автомобиль.Модель) Тогда
			Наименование = Наименование + СокрЛП(Автомобиль.Модель.Наименование);
		КонецЕсли;
		Если ЗначениеЗаполнено(VIN) Тогда
			Если Не ПустаяСтрока(Наименование) Тогда
				Наименование = Наименование + " ";
			КонецЕсли;  
			Наименование = Наименование + "VIN " + СокрЛП(VIN);
		КонецЕсли;
		Если Не ПустаяСтрока(Наименование) Тогда
			Автомобиль.Наименование = Наименование; 
		КонецЕсли;
		Автомобиль.УстановитьНовыйКод();
		
	Иначе
		Сообщить("Не удалось найти/создать модель автомобиля по данным в Рабочем листе TradeIn №" + Строка(СтруктураРезультата.id), СтатусСообщения.Внимание);
		Возврат Справочники.Автомобили.ПустаяСсылка();
	КонецЕсли;
	
	Автомобиль.ОбменДанными.Загрузка = Истина;
	Автомобиль.Записать();				

	Автомобиль = Автомобиль.Ссылка;
	Если ЗначениеЗаполнено(Автомобиль) Тогда
		Попытка 
			Если ПаспортАвтомобиля <> Неопределено Тогда
				ТехПаспорт = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль,Перечисления.ДополнительнаяИнформацияАвтомобилей.ТехПаспорт); 
				Если Не ЗначениеЗаполнено(ТехПаспорт) И ЗначениеЗаполнено(ПаспортАвтомобиля.number) Тогда
					ТехПаспорт = Справочники.ПодтверждающиеДокументы.СоздатьЭлемент();  
					ТехПаспорт.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.ПТС;
					НомерПТС = СтрЗаменить(ПаспортАвтомобиля.number," ","");
					ТехПаспорт.Серия = Лев(НомерПТС,4);
					ТехПаспорт.Номер = Сред(НомерПТС,5);
					ТехПаспорт.ДатаВыдачи = Инфотек_ОбщиеПроцедуры.СтрокаВДатуВремя(ПаспортАвтомобиля.issuedAt,"dd.mm.yyyy");
					ТехПаспорт.КемВыдан = ПаспортАвтомобиля.issuedBy;
					ТехПаспорт.Владелец = Автомобиль;   
					ТехПаспорт.Организация = НастройкаПодключения.Организация; 
					ТехПаспорт.Наименование = Справочники.ПодтверждающиеДокументы.СформироватьНаименованиеПоУмолчанию(ТехПаспорт);								
					ТехПаспорт.Записать();
					Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(Автомобиль,
					ТехПаспорт.Ссылка,Перечисления.ДополнительнаяИнформацияАвтомобилей.ТехПаспорт,
					НачалоДня(ТекущаяДата()));
				КонецЕсли; 
			КонецЕсли;   
			Если СвидетельствоОРегистрации <> Неопределено Тогда	
				СвидетельствоОРегистрацииТС = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль,Перечисления.ДополнительнаяИнформацияАвтомобилей.СвидетельствоОРегистрацииТС);
				Если Не ЗначениеЗаполнено(СвидетельствоОРегистрацииТС) И ЗначениеЗаполнено(СвидетельствоОРегистрации.number) Тогда
					СвидетельствоОРегистрацииТС = Справочники.ПодтверждающиеДокументы.СоздатьЭлемент();  
					СвидетельствоОРегистрацииТС.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.СвидетельствоОРегистрацииТС;
					НомерСТС = СтрЗаменить(СвидетельствоОРегистрации.number," ","");
					СвидетельствоОРегистрацииТС.Серия = Лев(НомерСТС,4);
					СвидетельствоОРегистрацииТС.Номер = Сред(НомерСТС,5);
					СвидетельствоОРегистрацииТС.ДатаВыдачи = Инфотек_ОбщиеПроцедуры.СтрокаВДатуВремя(СвидетельствоОРегистрации.issuedAt,"dd.mm.yyyy");
					СвидетельствоОРегистрацииТС.КемВыдан = СвидетельствоОРегистрации.issuedBy;
					СвидетельствоОРегистрацииТС.Владелец = Автомобиль;   
					СвидетельствоОРегистрацииТС.Организация = НастройкаПодключения.Организация;  
					СвидетельствоОРегистрацииТС.Наименование = Справочники.ПодтверждающиеДокументы.СформироватьНаименованиеПоУмолчанию(СвидетельствоОРегистрацииТС);								
					СвидетельствоОРегистрацииТС.Записать();
					Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(Автомобиль,
					СвидетельствоОРегистрацииТС.Ссылка,Перечисления.ДополнительнаяИнформацияАвтомобилей.СвидетельствоОРегистрацииТС,
					НачалоДня(ТекущаяДата()));
				КонецЕсли;     
			КонецЕсли;
			РезПробег = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьИнфоПоАвто(Автомобиль,Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
			Если РезПробег.Следующий() Тогда
				стрПробег = РезПробег.Значение;
			Иначе
				стрПробег = 0;
			КонецЕсли;
			Если ЗначениеЗаполнено(Пробег) Тогда    
				Если Число(Пробег) > стрПробег Тогда		
					Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(Автомобиль,Число(Пробег),Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег,ТекущаяДата());
				КонецЕсли;
			КонецЕсли;		
			Если ЗначениеЗаполнено(ГосНомер) Тогда 
				Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(Автомобиль,ГосНомер,Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,ТекущаяДата());
			КонецЕсли;			
		Исключение;
		КонецПопытки; 
	КонецЕсли;
	
	Возврат Автомобиль;
КонецФункции

// Функция получает/создает Контрагента для рабочего листа трейд-ин из CRM     
//                           
// Параметры:
//  СтруктураРезультата - резутьтат запроса рабочего листа трейд-ин из CRM
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM
// Возвращаемое значение:
//  Контрагент - ссылка на элемент справочника Контрагенты.  
//
Функция ПолучитьСоздатьКонтрагентаТрейдИн(СтруктураРезультата, НастройкаПодключения)
	СтруктураКлиент = СтруктураРезультата.generalClient;      
	ТипКлиента = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураКлиент.type);
	Если СтрНайти(ТипКлиента,"individual") > 0 Тогда
		МассивТелефоны = СтруктураКлиент.primaryPerson.phones;				
	ИначеЕсли СтрНайти(ТипКлиента, "business") > 0 Тогда
		МассивТелефоны = СтруктураКлиент.company.phones;
	КонецЕсли;
	Если МассивТелефоны = Неопределено Или МассивТелефоны.Количество() = 0 Тогда
		Сообщить("Не указаны телефоны Клиента в Рабочем листе TradeIn №" + Строка(СтруктураРезультата.id), СтатусСообщения.Внимание);
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;			

	Если Найти(ТипКлиента,"individual") <> 0 Тогда	
		СтруктураФизЛицо =  СтруктураКлиент.primaryPerson;
		Фамилия       = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.lastName);
		Имя           = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.firstName);
		Отчество      = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.middleName);	
		Если ЗначениеЗаполнено(Фамилия) И ЗначениеЗаполнено(Имя) И ЗначениеЗаполнено(Отчество) Тогда 
			Возврат Инфотек_ИнтеграцияCRM.СоздатьОбновитьКонтрагента(СтруктураКлиент, НастройкаПодключения);			
			
		Иначе
			Сообщить("Не полностью указано ФИО Клиента в Рабочем листе TradeIn №" + Строка(СтруктураРезультата.id), СтатусСообщения.Внимание);
			Возврат Справочники.Контрагенты.ПустаяСсылка();	
		КонецЕсли;
		
	ИначеЕсли Найти(ТипКлиента,"business") <> 0 Тогда	
		СтруктураОрганизация =  СтруктураКлиент.company;			
		НаименованиеКомпании = СтруктураОрганизация.name;
		email  = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураОрганизация.email);
		ИНН    = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураОрганизация.inn);
		Если ЗначениеЗаполнено(НаименованиеКомпании) И ЗначениеЗаполнено(ИНН) Тогда 
			Возврат Инфотек_ИнтеграцияCRM.СоздатьОбновитьКонтрагента(СтруктураКлиент, НастройкаПодключения);			

		Иначе
			Сообщить("Не указано Наименовиние или ИНН юр. лица в Рабочем листе TradeIn №" + Строка(СтруктураРезультата.id), СтатусСообщения.Внимание);
			Возврат  Справочники.Контрагенты.ПустаяСсылка();	
		КонецЕсли;
	КонецЕсли;
КонецФункции

// Функция получает Предложенную цену из оценки трейд-ин из CRM     
//                           
// Параметры:
//  СтруктураРезультата - резутьтат запроса рабочего листа трейд-ин из CRM
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM
// Возвращаемое значение:
//  Контрагент - ссылка на элемент справочника Контрагенты.  
//
Функция ПолучитьПредложеннуюЦенуТрейдИн(id_CRM, НастройкаПодключения)
	Запрос = "/yii/api/TradeInValuation?caseId=" + id_CRM;
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос, НастройкаПодключения);
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		СтурктураРезультата = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
	Иначе
		Сообщить("Не удалось получить Оценку автомобиля Рабочем листе TradeIn №" + id_CRM, СтатусСообщения.Внимание);
		Возврат 0;	
	КонецЕсли;
	
	Если СтурктураРезультата = Неопределено Тогда
		Сообщить("Не удалось получить Оценку автомобиля Рабочем листе TradeIn №" + id_CRM, СтатусСообщения.Внимание);
		Возврат 0;
	КонецЕсли;
	
	Если Не СтурктураРезультата.success Тогда
		Сообщить("Не удалось получить Оценку автомобиля Рабочем листе TradeIn №" + id_CRM, СтатусСообщения.Внимание);
		Возврат 0;
	Иначе
		СтурктураРезультата = СтурктураРезультата.result;
	КонецЕсли;
	
	Если ТипЗнч(СтурктураРезультата) = Тип("Массив") Тогда
		стОценка = Новый Структура();
		Если СтурктураРезультата.Количество() = 0 Тогда
			Сообщить("Не проведена Оценка автомобиля Рабочем листе TradeIn №" + id_CRM, СтатусСообщения.Внимание);
			Возврат 0;
			
		Иначе
			стОценка = СтурктураРезультата[0];
		КонецЕсли;
		
		ПредложеннаяЦена = Неопределено;
		Если стОценка.Свойство("proposedPrice", ПредложеннаяЦена) Тогда
			Возврат Число(ПредложеннаяЦена);
			
		Иначе
			Сообщить("Не указана Предложенная цена автомобиля Рабочем листе TradeIn №" + id_CRM, СтатусСообщения.Внимание);
			Возврат 0;
		КонецЕсли;
		
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

///////////////////////////////////////////////////////////////////////////////////

// Процедура обработки массива обращений в 1С, проверяет на закрытые обращения в CRM   
//                           
// Параметры:
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
Процедура ЗакрытьЛишниеОбращения(НастройкаПодключения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Инфотек_ОбращенияCRM.Идентификатор КАК Идентификатор,
	|	Инфотек_ОбращенияCRM.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.Инфотек_ОбращенияCRM КАК Инфотек_ОбращенияCRM
	|ГДЕ
	|	Инфотек_ОбращенияCRM.Статус В(&Статусы)";   
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.Инфотек_СтатусыОбращений.ВзятВРаботу);
	МассивСтатусов.Добавить(Перечисления.Инфотек_СтатусыОбращений.НеВзятВРаботу);
	МассивСтатусов.Добавить(Перечисления.Инфотек_СтатусыОбращений.ВРаботе);   
	Запрос.УстановитьПараметр("Статусы", МассивСтатусов); 
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда    
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтруктураОбращения = ПолучитьСтруктуруОбращенияПоИдентификатору(Выборка.Идентификатор,НастройкаПодключения); 
			Если СтруктураОбращения.success Тогда
				СтруктураОбращения = СтруктураОбращения.Result;
				Если СтруктураОбращения.state = "4" Или СтруктураОбращения.state = "3" Или СтруктураОбращения.state = "-1" Тогда
					МенеджерЗаписи = РегистрыСведений.Инфотек_ОбращенияCRM.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Идентификатор = Выборка.Идентификатор;
					МенеджерЗаписи.НастройкаПодключения = НастройкаПодключения;     
					МенеджерЗаписи.Статус = Выборка.Статус;
					МенеджерЗаписи.Прочитать();
					Если Не МенеджерЗаписи.Выбран() Тогда 
						МенеджерЗаписи.Статус = Перечисления.Инфотек_СтатусыОбращений.Завершён;
						МенеджерЗаписи.Записать();
					КонецЕсли;  
				КонецЕсли;  
			КонецЕсли;  
		КонецЦикла;	
	КонецЕсли;       
	
КонецПроцедуры

// Функция получения  бренда по идентификатору из CRM     
//                           
// Параметры:
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//  id_бренда            -  Число/Строка - ID бренда CRM.
//
// Возвращаемое значение:
//  СтруктураРезультат - структура объекта бренд из CRM.  
// 
Функция ПолучитьБрендПоИдентификатору(НастройкаПодключения,id_бренда) Экспорт
	
	id_бренда = Строка(id_бренда);
	id_бренда = СтрЗаменить(id_бренда,Символы.НПП,"");	
	Запрос = "/yii/api/refBrand/" + Инфотек_Запросы.СтрокаВФорматеURL(id_бренда);
	МассивРезультата = Новый Массив;
	СтруктураРезультат = Неопределено;
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		СтруктураJson = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);		
		Возврат СтруктураJson.result;
	КонецЕсли;
	
	Возврат СтруктураРезультат;
	
КонецФункции	

// Функция получения  модели по идентификатору из CRM     
//                           
// Параметры:
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//  id_модели            -  Число/Строка - ID модели CRM.
//
// Возвращаемое значение:
//  СтруктураРезультат - структура объекта модель из CRM.  
// 
Функция ПолучитьМодельПоИдентификатору(НастройкаПодключения,id_модели) Экспорт
	
	id_модели = Строка(id_модели);
	id_модели = СтрЗаменить(id_модели,Символы.НПП,"");	
	Запрос = "/yii/api/refModel/" + Инфотек_Запросы.СтрокаВФорматеURL(id_модели);
	МассивРезультата = Новый Массив;
	СтруктураРезультат = Неопределено;
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		СтруктураJson = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);		
		Возврат СтруктураJson.result;
	КонецЕсли;
	
	Возврат СтруктураРезультат;
	
КонецФункции	

// Функция получения  поколения модели по идентификатору из CRM     
//                           
// Параметры:
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//  id_поколения         - Число/Строка - ID поколения модели CRM.
//
// Возвращаемое значение:
//  СтруктураРезультат - структура объекта поколения из CRM.  
// 
Функция ПолучитьПоколениеМоделиПоИдентификатору(НастройкаПодключения,id_поколения) Экспорт
	
	id_поколения = Строка(id_поколения);
	id_поколения = СтрЗаменить(id_поколения,Символы.НПП,"");	
	Запрос = "/yii/api/refGeneration/" + Инфотек_Запросы.СтрокаВФорматеURL(id_поколения);
	МассивРезультата = Новый Массив;
	СтруктураРезультат = Неопределено;
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		СтруктураJson = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);		
		Возврат СтруктураJson.result;
	КонецЕсли;
	
	Возврат СтруктураРезультат;
	
КонецФункции	

// Функция получения салона по идентификатору из CRM     
//                           
// Параметры:
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//  salon_id             -  Число/Строка - ID салона CRM.
//
// Возвращаемое значение:
//  СтруктураРезультат - структура объекта салон из CRM.  
// 
Функция ПолучитьСалонПоИдентификатору(НастройкаПодключения,salon_id) Экспорт
	
	salon_id = Строка(salon_id);
	salon_id = СтрЗаменить(salon_id,Символы.НПП,"");	
	Запрос = "/yii/api/autosalon/" + Инфотек_Запросы.СтрокаВФорматеURL(salon_id);
	МассивРезультата = Новый Массив;
	СтруктураРезультат = Неопределено;
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		СтруктураJson = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);		
		Возврат СтруктураJson.result; 
	КонецЕсли;
	
	Возврат СтруктураРезультат;
	
КонецФункции	
 
// Функция получения места хранения  по идентификатору из CRM     
//                           
// Параметры:
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//  salon_id             - Число - ID салона CRM.
//
// Возвращаемое значение:
//  СтруктураРезультат - структура объекта салон из CRM.  
// 
Функция ПолучитьМестоХраненияПоИдентификатору(НастройкаПодключения,storagePlace_Id) Экспорт
	
	storagePlace_Id = Строка(storagePlace_Id);
	storagePlace_Id = СтрЗаменить(storagePlace_Id,Символы.НПП,"");	
	Запрос = "/yii/api/WarehouseStoragePlace/" + Инфотек_Запросы.СтрокаВФорматеURL(storagePlace_Id);
	МассивРезультата = Новый Массив;
	СтруктураРезультат = Неопределено;
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		СтруктураJson = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);		
		Возврат СтруктураJson.result;
	КонецЕсли;
	
	Возврат СтруктураРезультат;
	
КонецФункции	

// Функция получения структуры клиента из CRM системы по идентификатору
//                           
// Параметры:   
//  id_Клиента_CRM       - Строка - ID клиента CRM.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  СтурктураРезультата - Структура реквизитов.
//
Функция ПолучитьСтруктуруКлиентаПоИдентификатору(id_Клиента_CRM,НастройкаПодключения) Экспорт
	
	//GET /Client	
	Запрос = "/yii/api/Client/" + id_Клиента_CRM;
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	СтурктураРезультата = Неопределено;
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		СтурктураРезультата = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
	КонецЕсли;
	
	Возврат СтурктураРезультата;
	
КонецФункции 

// Функция получения структуры потребности из CRM системы по идентификатору
//                           
// Параметры:   
//  id_Потребности_CRM     - Строка - ID потребности CRM.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  СтурктураРезультата - Структура реквизитов.
//
Функция ПолучитьСтруктуруПотребностиПоИдентификатору(id_Потребности_CRM,НастройкаПодключения) Экспорт
	
	//GET /RetailNeed	
	Запрос = "/yii/api/RetailNeed/" + id_Потребности_CRM;
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	СтурктураРезультата = Неопределено;
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		СтурктураРезультата = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
	КонецЕсли;
	
	Возврат СтурктураРезультата;
	
КонецФункции  

// Функция получения структуры потребности БУ автомобиля из CRM системы по идентификатору
//                           
// Параметры:   
//  id_Потребности_CRM     - Строка - ID потребности CRM.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  СтурктураРезультата - Структура реквизитов.
//
Функция ПолучитьСтруктуруБУПотребностиПоИдентификатору(id_Потребности_CRM,НастройкаПодключения) Экспорт
	
	//GET /salesCaseNeed	
	Запрос = "/yii/api/salesCaseNeed/" + ИдентификаторВСтроку(id_Потребности_CRM);
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	СтурктураРезультата = Неопределено;
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		СтурктураРезультата = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
	КонецЕсли;
	
	Возврат СтурктураРезультата;
	
КонецФункции  

// Функция получения структуры потребности корпоративных продаж автомобиля из CRM системы по идентификатору
//                           
// Параметры:   
//  id_Потребности_CRM     - Строка - ID потребности CRM.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  СтурктураРезультата - Структура реквизитов.
//
Функция ПолучитьСтруктуруКорпоративнойПотребностиПоИдентификатору(id_Потребности_CRM,НастройкаПодключения) Экспорт
	
	//GET /CorporateNeed	
	Запрос = "/yii/api/CorporateNeed/" + ИдентификаторВСтроку(id_Потребности_CRM);
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	СтурктураРезультата = Неопределено;
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		СтурктураРезультата = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
	КонецЕсли;
	
	Возврат СтурктураРезультата;
	
КонецФункции 

// Функция получения структуры автомобиля TradeIn из CRM системы по идентификатору
//                           
// Параметры:   
//  id_автомобиля_CRM     - Строка - ID автомобиля CRM.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  СтурктураРезультата - Структура реквизитов.
//
Функция ПолучитьСтруктуруАвтомобиляTradeInПоИдентификатору(id_автомобиля_CRM,НастройкаПодключения) Экспорт
	
	//GET /TradeInVehicle	
	Запрос = "/yii/api/tradeInVehicle/" + id_автомобиля_CRM;
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	СтурктураРезультата = Неопределено;
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		СтурктураРезультата = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
	КонецЕсли;
	
	Возврат СтурктураРезультата;
	
КонецФункции 

// Функция получения ID автомобиля из CRM системы по VIN
//                           
// Параметры:   
//  VIN                  - Строка - VIN номер автомобиля.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  Идентификатор - ID автомобиля из CRM
//
Функция ПолучитьИдентфикаторАвтомобиляПоVIN(VIN,НастройкаПодключения) Экспорт
	
	Идентификатор = "";
	
	Запрос = "/yii/api/ClientVehicle?vin=" + Инфотек_Запросы.СтрокаВФорматеURL(СокрЛП(VIN));
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда	
		СтруктураРезультата = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);	
		МассивРезультата = СтруктураРезультата.Result;
		Если МассивРезультата.Количество() = 0 Тогда
			Возврат Идентификатор;
		КонецЕсли;
		СтруктураРезультата = МассивРезультата[0];
		
		Если Не СтруктураРезультата.Свойство("id") Тогда
			Возврат Идентификатор;
		КонецЕсли;
		Идентификатор = СтруктураРезультата.id;
	КонецЕсли;
	
	Возврат Идентификатор;
	
КонецФункции

// Функция получения ID автомобиля на складе из CRM системы по VIN
//                           
// Параметры:   
//  VIN                  - Строка - VIN номер автомобиля.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  Идентификатор - ID автомобиля на складе из CRM
//
Функция ПолучитьИдентфикаторАвтомобиляНаСкладеПоVIN(VIN,НастройкаПодключения) Экспорт
	
	Идентификатор = "";
	
	Запрос = "/yii/api/warehouseVehicle?vin=" + Инфотек_Запросы.СтрокаВФорматеURL(СокрЛП(VIN));
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда	
		СтруктураРезультата = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);	
		МассивРезультата = СтруктураРезультата.Result;
		Если МассивРезультата.Количество() = 0 Тогда
			Возврат Идентификатор;
		КонецЕсли;
		СтруктураРезультата = МассивРезультата[0];
		
		Если Не СтруктураРезультата.Свойство("id") Тогда
			Возврат Идентификатор;
		КонецЕсли;
		Идентификатор = СтруктураРезультата.id;
	КонецЕсли;
	
	Возврат Идентификатор;
	
КонецФункции

// Функция получения структуры автомобиля на складе из CRM системы по VIN
//                           
// Параметры:   
//  VIN                  - Строка - VIN номер автомобиля.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  СтруктураРезультата - структура реквизитов автомобиля из CRM
//
Функция ПолучитьСтруктуруАвтомобиляНаСкладеПоVIN(VIN,НастройкаПодключения) Экспорт
	
	СтруктураРезультата = "";
	
	Запрос = "/yii/api/warehouseVehicle?vin=" + Инфотек_Запросы.СтрокаВФорматеURL(СокрЛП(VIN));
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда	
		СтруктураРезультата = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);	
		МассивРезультата = СтруктураРезультата.Result;
		Если МассивРезультата.Количество() = 0 Тогда
			Возврат СтруктураРезультата;
		КонецЕсли;
		СтруктураРезультата = МассивРезультата[0];
	КонецЕсли;
	
	Возврат СтруктураРезультата;
	
КонецФункции

// Функция получения структуры автомобиля по идентификатору Рабочего Листа TradeIn
//                           
// Параметры:   
//  id_CRM               - Строка - Идентификатор Рабочего Листа TradeIn.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  СтруктураРезультата - структура реквизитов автомобиля из CRM
//
Функция ПолучитьСтруктуруАвтомобиляПоИдентификаторуРЛTradeIn(id_CRM, НастройкаПодключения) Экспорт
	СтруктураРезультата = "";
	Запрос = "/yii/api/tradeInVehicle?caseIds=" + id_CRM;
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);

	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда	
		СтруктураРезультата = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);	
		МассивРезультата = СтруктураРезультата.Result;
		Если МассивРезультата.Количество() = 0 Тогда
			Возврат СтруктураРезультата;
		КонецЕсли;
		СтруктураРезультата = МассивРезультата[0];
	КонецЕсли;
	
	Возврат СтруктураРезультата;
КонецФункции

// Функция получения идентификатора ТО из CRM системы по автомобилю
//                           
// Параметры:   
//  ИдентификаторАвтомобиля   - Строка - идентификатор автомобиля.
//  ИдентификаторВидРемонтаТО - Строка - идентификатор номера вида ремонта.
//  НастройкаПодключения      - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  Идентификатор - Идентификатор ТО из CRM
//
Функция ПолучитьИдентфикаторТОПоАвтомобилю(ИдентификаторАвтомобиля,ИдентификаторВидРемонтаТО,НастройкаПодключения) Экспорт
	
	Идентификатор = "";
	
	Запрос = "/yii/api/vehicleMaintenance?client_vehicle_id=" + Инфотек_Запросы.СтрокаВФорматеURL(СокрЛП(ИдентификаторАвтомобиля)) + "&ref_work_id=" + Инфотек_Запросы.СтрокаВФорматеURL(СокрЛП(ИдентификаторВидРемонтаТО));
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда	
		СтруктураРезультата = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);	
		МассивРезультата = СтруктураРезультата.Result;
		Если МассивРезультата.Количество() = 0 Тогда
			Возврат Идентификатор;
		КонецЕсли;
		СтруктураРезультата = МассивРезультата[0];
	КонецЕсли;
	
	Если Не СтруктураРезультата.Свойство("id") Тогда
		Возврат Идентификатор;
	КонецЕсли;
	Идентификатор = СтруктураРезультата.id;
	
	Возврат Идентификатор;
	
КонецФункции

// Функция получения структуры рабочего листа из CRM системы по идентификатору
//                           
// Параметры:   
//  id_CRM               - Строка - ID рабочего листа CRM.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  СтурктураРезультата - Структура реквизитов.
//
Функция ПолучитьСтруктуруРабочегоЛистаПоИдентификатору(id_CRM,НастройкаПодключения) Экспорт
	
	//GET /RetailCase	
	Запрос = "/yii/api/RetailCase" + "/" + id_CRM;
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	СтурктураРезультата = Неопределено;
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		СтурктураРезультата = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
	КонецЕсли;
	
	Возврат СтурктураРезультата;
	
КонецФункции

// Функция получения структуры рабочего листа корпоративных продаж из CRM системы по идентификатору
//                           
// Параметры:   
//  id_CRM               - Строка - ID рабочего листа CRM.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  СтурктураРезультата - Структура реквизитов.
//
Функция ПолучитьСтруктуруРабочегоЛистаКорпоративныхПродажПоИдентификатору(id_CRM,НастройкаПодключения) Экспорт
	
	//GET /CorporateCase	
	Запрос = "/yii/api/CorporateCase" + "/" + id_CRM;
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	СтурктураРезультата = Неопределено;
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		СтурктураРезультата = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
	КонецЕсли;
	
	Возврат СтурктураРезультата;
	
КонецФункции

// Функция получения структуры рабочего листа б/у из CRM системы по идентификатору
//                           
// Параметры:   
//  id_Обращения_CRM     - Строка - ID рабочего листа CRM.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  СтурктураРезультата - Структура реквизитов.
//
Функция ПолучитьСтруктуруРабочегоЛистаБУПоИдентификатору(id_CRM,НастройкаПодключения) Экспорт
	
	//GET /RetailCase	
	Запрос = "/yii/api/SaleUsedCase" + "/" + id_CRM;
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	СтурктураРезультата = Неопределено;
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		СтурктураРезультата = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
	КонецЕсли;
	
	Возврат СтурктураРезультата;
	
КонецФункции

// Функция получения структуры рабочего листа Trade In из CRM системы по идентификатору
//                           
// Параметры:   
//  id_CRM               - Строка - ID рабочего листа CRM.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  СтурктураРезультата - Структура реквизитов.
//
Функция ПолучитьСтруктуруРабочегоЛистаTradeInПоИдентификатору(id_CRM,НастройкаПодключения) Экспорт
	
	//GET /RetailCase	
	Запрос = "/yii/api/TradeinCase" + "/" + id_CRM;
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	СтурктураРезультата = Неопределено;
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		СтурктураРезультата = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
	КонецЕсли;
	
	Возврат СтурктураРезультата;
	
КонецФункции

// Функция получения событий рабочего листа из CRM по идентификатору     
//                           
// Параметры:
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  МассивВозврата - массив объектов мест хранения из CRM.  
//  
Функция ПолучитьМассивСобытийПоИдентификаторуРабочегоЛиста(id_CRM,НастройкаПодключения) Экспорт      
	
	Запрос = "/yii/api/stage?caseIds=" + id_CRM;
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	МассивВозврата = Новый Массив;
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		СтруктураJson = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);		
		Для каждого Элемент ИЗ СтруктураJson.result Цикл
			МассивВозврата.Добавить(Инфотек_ОбщиеПроцедуры.СкопироватьРекурсивно(Элемент));
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивВозврата;
	
КонецФункции

// Функция получения ID заказ наряда из CRM системы по коду элемента 1С 
//                           
// Параметры:   
//  Код                  - Строка - код заказ наряда.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  Идентификатор - ID заказ наряда из CRM
//
Функция ПолучитьИдентфикаторЗаказНарядаПоКоду(Код,НастройкаПодключения) Экспорт
	
	Идентификатор = "";
	
	//GET /purchase
	Запрос = "/yii/api/purchase?number=" + Инфотек_Запросы.СтрокаВФорматеURL(Код);
	
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		МассивРезультата = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
		
		Если МассивРезультата.Количество()=0 Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
		СтруктураРезультата = МассивРезультата[0];
		
		Если Не СтруктураРезультата.Свойство("id") Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
		Идентификатор = СтруктураРезультата.id;
		
	КонецЕсли;
	
	Возврат Идентификатор;
	
КонецФункции

// Функция получения структуры обращения из CRM системы по идентификатору
//                           
// Параметры:   
//  id_Обращения_CRM     - Строка - ID обращения CRM.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  СтруктураРезультата - Структура реквизитов.
//
Функция ПолучитьСтруктуруОбращенияПоИдентификатору(id_Обращения_CRM,НастройкаПодключения) Экспорт
	
	//GET /preparedServiceCase	
	Запрос = "/yii/api/preparedServiceCase/"+id_Обращения_CRM;
	Ответ = Инфотек_Запросы.GETЗапрос(Запрос,НастройкаПодключения);
	СтруктураРезультата = Неопределено;
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		СтруктураРезультата = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);        
	КонецЕсли;
	
	Возврат СтруктураРезультата;
	
КонецФункции

// Процедура заполнения заявки на ремонт по структуре обращения из CRM 
//                           
// Параметры:   
//  СтруктураРезультата - Структура - Обращение из CRM.
//  ОбДокумент          - ДокументОбъект.ЗаявкаНаРемонт - Объект документ заявка на ремонт.
//  ОбДокументФорма     - Форма - Форма документа заявка на ремонт.
//
Процедура ОбработатьСтруктуруЗаполнитьРеквизитыЗаявки(СтруктураРезультата,НастройкаПодключения,ОбДокумент,ОбДокументФорма,Контрагент = Неопределено,Автомобиль = Неопределено) Экспорт
	
	ОбДокумент.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	ОбДокумент.Заказчик   = Справочники.Контрагенты.ПустаяСсылка();
	ОбДокумент.ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	ОбДокумент.Работы.Очистить();
	ЕстьАвтомобиль = Ложь;
	Если ЗначениеЗаполнено(Автомобиль) И ТипЗнч(Автомобиль) = Тип("СправочникСсылка.Автомобили") Тогда
		ЕстьАвтомобиль = Истина;
	КонецЕсли;
	ЕстьКонтрагент = Ложь;
	Если ЗначениеЗаполнено(Контрагент) И ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		ЕстьКонтрагент = Истина;
	КонецЕсли;
	
	НовДоговор = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	
	црмКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
	
	Если СтруктураРезультата.success Тогда
		
		
		црмРезультат = СтруктураРезультата.result;
		
		СтруктураКлиент = црмРезультат.generalClient;
		
		
		СтруктураАвто = црмРезультат.clientVehicle;
		VIN           = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАвто.vin);
		ГосНомер      = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАвто.reg_number);
		ГодВыпуска    = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАвто.production_year);
		Пробег        = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАвто.mileage);
		ИДАвтом       = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАвто.id);
		ДатаНачалаГарантии = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАвто.warranty_start_at);
		ДатаКонцаГарантии = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАвто.warranty_end_at);
		
		СтруктураМодель = СтруктураАвто.model;
		ИдМодели      = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураМодель.id);
		НаименованиеМодели      = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАвто.brand.name) + " " + Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураМодель.name);
		ИдМарки       = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАвто.brand_id);
		
		Авто = Справочники.Автомобили.ПустаяСсылка();
		
		Если (ЗначениеЗаполнено(VIN) Или ЗначениеЗаполнено(ГосНомер)) И ЕстьАвтомобиль = Ложь Тогда
			ЗапросАвто = Новый Запрос();
			ЗапросАвто.УстановитьПараметр("парДатаЗаписи",ТекущаяДата());
			ЗапросАвто.Текст = 
			"ВЫБРАТЬ
			|	Авто.Ссылка КАК Ссылка,
			|	Авто.VIN КАК VIN,
			|	РС.Значение КАК ГосНомер
			|ИЗ
			|	Справочник.Автомобили КАК Авто
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних(&парДатаЗаписи, ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ГосНомер)) КАК РС
			|		ПО (РС.Автомобиль = Авто.Ссылка)
			|ГДЕ
			|	НЕ Авто.ПометкаУдаления
			|	И НЕ Авто.ЭтоГруппа
			|  "+?(ЗначениеЗаполнено(ГосНомер),"И РС.Значение ПОДОБНО ""%"" + &ГосНомер + ""%""","")+"
			|	И Авто.VIN ПОДОБНО ""%"" + &VIN + ""%""";
			
			ЗапросАвто.УстановитьПараметр("VIN","%"+VIN+"%");
			ЗапросАвто.УстановитьПараметр("ГосНомер","%"+ГосНомер+"%");
			РезАвто = ЗапросАвто.Выполнить().Выбрать();
			Пока РезАвто.Следующий() Цикл
				Авто = РезАвто.Ссылка;
				Прервать;
			КонецЦикла;		 
		ИначеЕсли ЕстьАвтомобиль = Истина Тогда
			Авто = Автомобиль;	
		КонецЕсли;
		
		ИдКлиента = СтруктураКлиент.id;
		
		Тип = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураКлиент.type);
		
		Если Найти(Тип, "individual") <> 0 И ЕстьКонтрагент = Ложь Тогда
			
			СтруктураФизЛицо =  СтруктураКлиент.primaryPerson;
			МассивТелефоны   =  СтруктураФизЛицо.phones;
			
			црмКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
			Контрагент    = Справочники.Контрагенты.ПустаяСсылка();
			Фамилия       = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.lastName);
			Имя           = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.firstName);
			Отчество      = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.middleName);	
			Наименование  = СокрЛП(Фамилия + " " + Имя + " " + Отчество);
			ДатаРожд      = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.birthday);
			
			Для Каждого Эл из МассивТелефоны Цикл
				Если ЗначениеЗаполнено(Эл.number) Тогда     
					црмКонтрагент = Инфотек_ИнтеграцияCRMПереопределяемый.НайтиПоНомеруТелефонаФИО(Эл.number,Наименование);
					Если црмКонтрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
						црмКонтрагент = Инфотек_ИнтеграцияCRMПереопределяемый.НайтиПоНомеруТелефона(Эл.number);  
						Если црмКонтрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
							црмКонтрагент = Инфотек_ИнтеграцияCRMПереопределяемый.НайтиПоФИОДатеРождения(Наименование,ДатаРожд);			 
						КонецЕсли; 	
						Если Не црмКонтрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
							Контрагент = црмКонтрагент; 
							Прервать;
						КонецЕсли;   
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			//по авто
			Если Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
				
				НовКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
				
				НовКонтрагент.Фамилия     = Фамилия;
				НовКонтрагент.Имя         = Имя;
				НовКонтрагент.Отчество    = Отчество;			
				Пол                       = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.gender);
				НовКонтрагент.РекламныйИсточник = Справочники.ИсточникиИнформации.НайтиПоКоду("ЦБ000003"); 			
				НовКонтрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо;
				НовКонтрагент.Наименование = СокрЛП(НовКонтрагент.Фамилия + " " + НовКонтрагент.Имя + " " + НовКонтрагент.Отчество);
				НовКонтрагент.НаименованиеПолное = СокрЛП(НовКонтрагент.Фамилия + " " + НовКонтрагент.Имя + " " + НовКонтрагент.Отчество);
				Если ЗначениеЗаполнено(Пол) Тогда
					НовКонтрагент.Пол = ?(Пол = "M",Перечисления.ПолФизическихЛиц.Мужской,Перечисления.ПолФизическихЛиц.Женский);
				Иначе
					Если Найти(нрег(Прав(НовКонтрагент.Отчество,3)),"вич") Тогда
						НовКонтрагент.Пол = Перечисления.ПолФизическихЛиц.Мужской;
					ИначеЕсли Найти(нрег(Прав(НовКонтрагент.Отчество,3)),"вна") Тогда
						НовКонтрагент.Пол = Перечисления.ПолФизическихЛиц.Женский;
					КонецЕсли;
				КонецЕсли;
				
				ДатаРождения = Инфотек_ОбщиеПроцедуры.ПреобразоватьСтрокуВДату(ДатаРожд);
				
				НовКонтрагент.ДатаРождения = ДатаРождения; 
				НовКонтрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель; 
				НовКонтрагент.УстановитьНовыйКод();
				Если ЗначениеЗаполнено(СтруктураФизЛицо.consentProcessingPersonalInformation) Тогда
					Если СтруктураФизЛицо.consentProcessingPersonalInformation = "1" Тогда
						НовКонтрагент.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да;
					Иначе
						НовКонтрагент.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Нет;
					КонецЕсли;
				Иначе
					НовКонтрагент.СогласиеНаОбработкуПерсональныхДанных =  Перечисления.ВариантыОтветов.Спрашивать;
				КонецЕсли;	 
				Если СтруктураФизЛицо.consentObtainingSmsMailing = "1" Тогда
					НовКонтрагент.СогласиеНаПолучениеSMS = Истина;
				Иначе
					НовКонтрагент.СогласиеНаПолучениеSMS = Ложь;
				КонецЕсли;
				
				НовКонтрагент.Родитель = НастройкаПодключения.ГруппаКонтрагентовФизическиеЛица;
				СтруктураПоиска = Новый Структура("Код,Наименование,НаименованиеПолное, ИНН,ОсновнойТелефон",Неопределено,"=",Неопределено,Неопределено,Неопределено);
				НайденныеОбъекты  = обНайтиДубли(НовКонтрагент,СтруктураПоиска);
				Если НайденныеОбъекты.Количество() > 0 Тогда
					Для Каждого СтрокаКонтрагента Из НайденныеОбъекты Цикл
						НовКонтрагент = СтрокаКонтрагента.Ссылка;
					КонецЦикла;  
				Иначе
					Для Каждого Эл Из МассивТелефоны Цикл
						СтруктураЗаписи = Новый структура();
						
						ОсновнойТелефон = Эл.number;
						ТипТелефона     = Эл.type; //1 - рабочий, 2 - мобильный, 3 - факс, 4 - домашний
						Если ТипТелефона = "1" Тогда
							ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонРабочий;
						иначеЕсли ТипТелефона = "2" Тогда
							ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый;
						иначеЕсли ТипТелефона = "3" Тогда
							ВидТелефона = Справочники.ВидыКонтактнойИнформации.Факс;
						иначеЕсли ТипТелефона = "4" Тогда
							ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонДомашний;
						КонецЕсли;
						
						КодСтраны = Лев(ОсновнойТелефон,1);
						СтруктураЗаписи.Вставить("Поле1","+"+КодСтраны);
						
						КодГорода = Сред(ОсновнойТелефон,2,3);
						СтруктураЗаписи.Вставить("Поле2",КодГорода);
						
						НомерТелефона = Сред(ОсновнойТелефон,5);
						СтруктураЗаписи.Вставить("Поле3",НомерТелефона);
						
						СтруктураЗаписи.Вставить("Представление","+" + КодСтраны + " (" + КодГорода + ") " + НомерТелефона);
						ОсновнойТелефон = "+" + КодСтраны + " (" + КодГорода + ") " + НомерТелефона;   
						НовКонтрагент.ОсновнойТелефон = ОсновнойТелефон; 
						НовКонтрагент.Записать(); 
						Контрагент = НовКонтрагент.Ссылка;
						СтруктураЗаписи.Вставить("Объект",Контрагент);
						СтруктураЗаписи.Вставить("Тип",Перечисления.ТипыКонтактнойИнформации.Телефон);
						
						СтруктураЗаписи.Вставить("Вид",ВидТелефона);
						СтруктураЗаписи.Вставить("ЗначениеПоУмолчанию",Истина);
						
						ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "КонтактнаяИнформация");   
					КонецЦикла;
					//Договор
					НовДоговор = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
					НовДоговор.УстановитьНовыйКод();
					НовДоговор.Владелец      = НовКонтрагент.Ссылка;
					НовДоговор.ВидДоговора   = Перечисления.ВидыДоговоров.Продажа;
					НовДоговор.ВалютаВзаиморасчетов = обДокумент.ВалютаДокумента;
					НовДоговор.ВидОплаты     =  Перечисления.ВидыОплаты.ПроизвольнаяОплата;
					НовДоговор.ДатаНачала    = ТекущаяДата();
					НовДоговор.Организация = ОбДокумент.Организация;
					НовДоговор.Подразделение = ОбДокумент.ПодразделениеКомпании; 
					НовДоговор.ТипДоговора = Перечисления.ТипыДоговоров.Договор;
					НовДоговор.Основной = Истина;
					НовДоговор.ДляАвтосервиса = Истина;    
					НовДоговор.ЕдиницаИзмеренияАвтоработВПечатныхФормах = Перечисления.ЕдиницаИзмеренияАвтоработВПечатныхФормах.ЕдиницаИзмеренияПрочерк;
					СформироватьНаименование(НовДоговор); 
					Попытка
						НовДоговор.Записать();			
					Исключение
					КонецПопытки;   
				КонецЕсли;							
				
				Контрагент = НовКонтрагент.Ссылка;
				
				email       = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.email);
				
				Если ЗначениеЗаполнено(email) Тогда
					СтруктураЗаписи = Новый структура();
					СтруктураЗаписи.Вставить("Объект",Контрагент);
					СтруктураЗаписи.Вставить("Тип",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
					СтруктураЗаписи.Вставить("Вид",Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний);
					СтруктураЗаписи.Вставить("Представление",email);
					ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "КонтактнаяИнформация");
				КонецЕсли;
				
				Если СтруктураФизЛицо.Свойство("address") Тогда 
					СтруктураАдрес = СтруктураФизЛицо.address;
					ЗаписатьАдрес(СтруктураАдрес, Контрагент, Справочники.ВидыКонтактнойИнформации.АдресФактический);
				КонецЕсли;
				
				
				//Вод.удостоверение
				ВодПраваНомер      = СтруктураФизЛицо.driverLicenseNumber;
				ВодПраваВыданы     = СтруктураФизЛицо.driverLicenseIssuedAt;
				ВодПраваДатаВыдачи = СтруктураФизЛицо.driverLicenseIssuedBy;
				
				//Паспорт
				Паспорт_Серия      = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.passportSeries);
				Паспорт_Номер      = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.passportNumber);
				Паспорт_ДатаВыдачи = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.passportIssuedAt);
				Паспорт_Выдан      = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.passportIssuedBy);
				ПаспортКодПодразд  = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.passportDepartmentCode);
				
				Если ЗначениеЗаполнено(Паспорт_Серия) И ЗначениеЗаполнено(Паспорт_Номер)
					И ЗначениеЗаполнено(Паспорт_Выдан) И ЗначениеЗаполнено(Паспорт_ДатаВыдачи) Тогда
					НовыйПодтверждающийДокумент = Справочники.ПодтверждающиеДокументы.СоздатьЭлемент();
					НовыйПодтверждающийДокумент.Владелец = Контрагент;
					НовыйПодтверждающийДокумент.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.Паспорт;
					НовыйПодтверждающийДокумент.Серия = Паспорт_Серия;
					НовыйПодтверждающийДокумент.Номер = Паспорт_Номер;
					НовыйПодтверждающийДокумент.ДатаВыдачи = Инфотек_ОбщиеПроцедуры.ПреобразоватьСтрокуВДату(Паспорт_ДатаВыдачи);
					НовыйПодтверждающийДокумент.КемВыдан =  Паспорт_Выдан;
					НовыйПодтверждающийДокумент.УстановитьНовыйКод();
					НовыйПодтверждающийДокумент.Наименование = НовыйПодтверждающийДокумент.СформироватьНаименование();
					НовыйПодтверждающийДокумент.Записать();
				КонецЕсли;
				
				Для каждого Эл Из МассивТелефоны Цикл
					СтруктураЗаписи = новый структура();
					
					ОсновнойТелефон = Эл.number;
					ТипТелефона     = Эл.type; //1 - рабочий, 2 - мобильный, 3 - факс, 4 - домашний
					Если ТипТелефона = "1" Тогда
						ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонРабочий;
					иначеЕсли ТипТелефона = "2" Тогда
						ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый;
					иначеЕсли ТипТелефона = "3" Тогда
						ВидТелефона = Справочники.ВидыКонтактнойИнформации.Факс;
					иначеЕсли ТипТелефона = "4" Тогда
						ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонДомашний;
					КонецЕсли;
					
					СтруктураЗаписи.Вставить("Объект",Контрагент);
					СтруктураЗаписи.Вставить("Тип",Перечисления.ТипыКонтактнойИнформации.Телефон);
					
					СтруктураЗаписи.Вставить("Вид",ВидТелефона);
					СтруктураЗаписи.Вставить("ЗначениеПоУмолчанию",Истина);
					
					
					КодСтраны = Лев(ОсновнойТелефон,1);
					СтруктураЗаписи.Вставить("Поле1","+"+КодСтраны);
					
					КодГорода = Сред(ОсновнойТелефон,2,3);
					СтруктураЗаписи.Вставить("Поле2",КодГорода);
					
					НомерТелефона = Сред(ОсновнойТелефон,5);
					СтруктураЗаписи.Вставить("Поле3",НомерТелефона);
					
					СтруктураЗаписи.Вставить("Представление","+" + КодСтраны + " (" + КодГорода + ") " + НомерТелефона);
					ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "КонтактнаяИнформация");   
					ОсновнойТелефон = "+" + КодСтраны + " (" + КодГорода + ") " + НомерТелефона;
				КонецЦикла;
				
				Если ЗначениеЗаполнено(ОсновнойТелефон) Тогда
					ОбКонтрагент = Контрагент.ПолучитьОбъект();		
					ОбКонтрагент.ОсновнойТелефон = ОсновнойТелефон;
					ОбКонтрагент.Записать();
				КонецЕсли;
			Иначе
				//Контрагент был найден, возьмем авто
				Если Авто = Справочники.Автомобили.ПустаяСсылка() Тогда
					Запрос = Новый Запрос();
					Запрос.УстановитьПараметр("ПарКлиент",Контрагент);
					Запрос.УстановитьПараметр("парДатаЗаписи",ТекущаяДата());
					Запрос.Текст = "ВЫБРАТЬ
					|	АвтомобилиСрезПоследних.Период,
					|	АвтомобилиСрезПоследних.Автомобиль,
					|	АвтомобилиСрезПоследних.Значение
					|ИЗ
					|	РегистрСведений.Автомобили.СрезПоследних(&парДатаЗаписи, ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Хозяин)) КАК АвтомобилиСрезПоследних
					|ГДЕ
					|	АвтомобилиСрезПоследних.Значение = &ПарКлиент";
					Результат = Запрос.Выполнить().Выбрать();
					Если Результат.Следующий() Тогда       
						Если VIN = Результат.Автомобиль.VIN Тогда
							Авто = Результат.Автомобиль;   
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		ИначеЕсли Найти(Тип, "business") <> 0 И ЕстьКонтрагент = Ложь Тогда
			
			црмКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
			Контрагент    = Справочники.Контрагенты.ПустаяСсылка();
			
			
			СтруктураОрганизация =  СтруктураКлиент.company;
			
			НаименованиеКомпании = СтруктураОрганизация.name;
			email  = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураОрганизация.email);
			ИНН    = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураОрганизация.inn);
			КПП    = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураОрганизация.kpp);
			ОКПО   = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураОрганизация.ogrn); 
			
			
			МассивТелефоны  = СтруктураОрганизация.phones;
			
			//1.Поискать по ОКПО
			Если ЗначениеЗаполнено(ОКПО) Тогда
				ЦрмКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодПоОКПО",ОКПО);
			КонецЕсли;
			
			//2.Поискать по ИНН
			Если ЦрмКонтрагент = Справочники.Контрагенты.ПустаяСсылка() И ЗначениеЗаполнено(ИНН) Тогда
				ЦрмКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН",ИНН);
			КонецЕсли;
			
			////3.Поискать по КПП
			//Если ЦрмКонтрагент = Справочники.Контрагенты.ПустаяСсылка() И ЗначениеЗаполнено(КПП) Тогда
			//	ЦрмКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КПП",КПП);
			//КонецЕсли;
			
			//4.По номеру телефона
			Если ЦрмКонтрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
				//Учесть +,7,8
				Для каждого Эл Из МассивТелефоны Цикл
					Если ЗначениеЗаполнено(Эл.number) Тогда
						црмКонтрагент = Инфотек_ИнтеграцияCRMПереопределяемый.НайтиПоНомеруТелефона(Эл.number);
						Если Не црмКонтрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
							Сообщить("Найден контрагент по номеру телефона: " + црмКонтрагент);
							Контрагент = црмКонтрагент; 
							Прервать;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			иначе
				Контрагент = црмКонтрагент;
			КонецЕсли;
			
			Если Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
				//Создаем
				НовКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
				НовКонтрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо;
				НовКонтрагент.РекламныйИсточник = Справочники.ИсточникиИнформации.НайтиПоКоду("ЦБ000003"); 
				НовКонтрагент.Наименование       = НаименованиеКомпании;
				НовКонтрагент.НаименованиеПолное = НаименованиеКомпании;
				НовКонтрагент.КодПоОКПО          = ОКПО;
				НовКонтрагент.КПП                = КПП;
				НовКонтрагент.ИНН                = ИНН;
				НовКонтрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель;			
				НовКонтрагент.УстановитьНовыйКод();
				НовКонтрагент.Родитель = НастройкаПодключения.ГруппаКонтрагентовЮридическиеЛица;					
				НовКонтрагент.Записать();
				
				//Договор  	
				НовДоговор = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
				НовДоговор.УстановитьНовыйКод();
				НовДоговор.Владелец      = НовКонтрагент.Ссылка;
				НовДоговор.ВидДоговора   = Перечисления.ВидыДоговоров.Продажа;
				НовДоговор.ВалютаВзаиморасчетов = обДокумент.ВалютаДокумента;
				НовДоговор.ВидОплаты     =  Перечисления.ВидыОплаты.ПроизвольнаяОплата;
				НовДоговор.ДатаНачала    = ТекущаяДата();
				НовДоговор.Организация = ОбДокумент.Организация;
				НовДоговор.Подразделение = ОбДокумент.ПодразделениеКомпании; 
				НовДоговор.ТипДоговора = Перечисления.ТипыДоговоров.Договор;
				НовДоговор.Основной = Истина;
				НовДоговор.ДляАвтосервиса = Истина;
				НовДоговор.ЕдиницаИзмеренияАвтоработВПечатныхФормах = Перечисления.ЕдиницаИзмеренияАвтоработВПечатныхФормах.ЕдиницаИзмеренияПрочерк;
				СформироватьНаименование(НовДоговор);    
				Попытка
					НовДоговор.Записать();
				Исключение
				КонецПопытки;  
				
				Контрагент = НовКонтрагент.Ссылка;
				
				Если СтруктураОрганизация.Свойство("address") Тогда 
					СтруктураАдрес = СтруктураОрганизация.address;
					ЗаписатьАдрес(СтруктураАдрес, Контрагент, Справочники.ВидыКонтактнойИнформации.АдресФактический);
				КонецЕсли;
				Если СтруктураОрганизация.Свойство("juridicalAddress") Тогда 
					СтруктураАдрес = СтруктураОрганизация.juridicalAddress;
					ЗаписатьАдрес(СтруктураАдрес, Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
				КонецЕсли;
				
				Для каждого Эл Из МассивТелефоны Цикл
					СтруктураЗаписи = новый структура();
					
					ОсновнойТелефон = Эл.number;
					ТипТелефона     = Эл.type; //1 - рабочий, 2 - мобильный, 3 - факс, 4 - домашний
					Если ТипТелефона = "1" Тогда
						ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонРабочий;
					иначеЕсли ТипТелефона = "2" Тогда
						ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый;
					иначеЕсли ТипТелефона = "3" Тогда
						ВидТелефона = Справочники.ВидыКонтактнойИнформации.Факс;
					иначеЕсли ТипТелефона = "4" Тогда
						ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонДомашний;
					КонецЕсли;
					
					СтруктураЗаписи.Вставить("Объект",Контрагент);
					СтруктураЗаписи.Вставить("Тип",Перечисления.ТипыКонтактнойИнформации.Телефон);
					
					СтруктураЗаписи.Вставить("Вид",ВидТелефона);
					СтруктураЗаписи.Вставить("ЗначениеПоУмолчанию",Истина);
					
					
					КодСтраны = Лев(ОсновнойТелефон,1);
					СтруктураЗаписи.Вставить("Поле1","+" + КодСтраны);
					
					КодГорода = Сред(ОсновнойТелефон,2,3);
					СтруктураЗаписи.Вставить("Поле2",КодГорода);
					
					НомерТелефона = Сред(ОсновнойТелефон,5);
					СтруктураЗаписи.Вставить("Поле3",НомерТелефона);
					
					СтруктураЗаписи.Вставить("Представление","+" + КодСтраны + " (" + КодГорода + ") " + НомерТелефона);
					ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "КонтактнаяИнформация");
					ОсновнойТелефон = "+" + КодСтраны + " (" + КодГорода + ") " + НомерТелефона;
				КонецЦикла;
				
				Если ЗначениеЗаполнено(ОсновнойТелефон) Тогда
					ОбКонтрагент = Контрагент.ПолучитьОбъект(); 
					ОбКонтрагент.ОсновнойТелефон = ОсновнойТелефон;
					ОбКонтрагент.Записать();
				КонецЕсли;
			Иначе
				//Контрагент был найден, возьмем авто
				Если Авто = Справочники.Автомобили.ПустаяСсылка() Тогда
					Запрос = Новый Запрос();
					Запрос.УстановитьПараметр("ПарКлиент",Контрагент);
					Запрос.УстановитьПараметр("парДатаЗаписи",ТекущаяДата());
					Запрос.Текст = "ВЫБРАТЬ
					|	АвтомобилиСрезПоследних.Период,
					|	АвтомобилиСрезПоследних.Автомобиль,
					|	АвтомобилиСрезПоследних.Значение
					|ИЗ
					|	РегистрСведений.Автомобили.СрезПоследних(&парДатаЗаписи, ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Хозяин)) КАК АвтомобилиСрезПоследних
					|ГДЕ
					|	АвтомобилиСрезПоследних.Значение = &ПарКлиент";
					Результат = Запрос.Выполнить().Выбрать();
					Если Результат.Следующий() Тогда
						Если VIN = Результат.Автомобиль.VIN Тогда
							Авто = Результат.Автомобиль;   
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		
		ОбДокумент.Заказчик = Контрагент;
		ОбДокумент.Контрагент = Контрагент;
		Если Не НовДоговор = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка() Тогда
			ОбДокумент.ДоговорВзаиморасчетов = НовДоговор.Ссылка; 	
		Иначе
			//Договор с контрагентом
			ЗапросДоговор = новый запрос();
			ЗапросДоговор.УстановитьПараметр("парКонтрагент", Контрагент);
			ЗапросДоговор.Текст = "ВЫБРАТЬ
			|	ДоговорыВзаиморасчетов.Ссылка,
			|	ДоговорыВзаиморасчетов.Владелец
			|ИЗ
			|	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
			|ГДЕ
			|	ДоговорыВзаиморасчетов.Владелец = &парКонтрагент
			|	И НЕ ДоговорыВзаиморасчетов.ПометкаУдаления";
			РезультатДог = ЗапросДоговор.Выполнить().Выбрать();
			Пока РезультатДог.Следующий() цикл
				ОбДокумент.ДоговорВзаиморасчетов = РезультатДог.Ссылка; 
			КонецЦикла;
		КонецЕсли;
		
		Если Авто = Справочники.Автомобили.ПустаяСсылка() И ЕстьАвтомобиль = Ложь Тогда
			Если ЗначениеЗаполнено(VIN) Тогда
				НовАвто = Справочники.Автомобили.СоздатьЭлемент();
				НовАвто.УстановитьНовыйКод();
				Если Не ЗначениеЗаполнено(VIN) Тогда
					Сообщить("В CRM системе у авто не заполнен VIN!!!");			
				КонецЕсли;
				НовАвто.VIN = VIN;
				НовАвто.НомерКузова = VIN;   
				НовАвто.ВключатьВПрайсЛист = Перечисления.ВидВключенияВПрайсЛист.ПоУмолчанию;
				ЭлМодель = Инфотек_ОбщиеПроцедуры.ПолучитьОбъектПоИдентификаторуСоответствия(НастройкаПодключения,ИдМодели,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Модель);
				ЭлМарка = Инфотек_ОбщиеПроцедуры.ПолучитьОбъектПоИдентификаторуСоответствия(НастройкаПодключения,ИдМарки,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Бренд);
				Если ЗначениеЗаполнено(ЭлМодель) Тогда
					НовАвто.Модель = ЭлМодель; 
				Иначе
					ЭлМодель = Справочники.Модели.НайтиПоНаименованию(СокрЛП(НаименованиеМодели));		
					Если Не ЭлМодель = Справочники.Модели.ПустаяСсылка() Тогда	
						НовАвто.Модель = ЭлМодель.Ссылка;
					Иначе
						Модель = Справочники.Модели.СоздатьЭлемент();
						Модель.Наименование = СокрЛП(НаименованиеМодели);
						Модель.НаименованиеПолное = СокрЛП(НаименованиеМодели);
						Марка = СтруктураАвто.brand.name; 
						Если ЗначениеЗаполнено(ЭлМарка) Тогда
							Модель.Родитель = ЭлМарка;
						Иначе
							ЭлМарка = Справочники.Модели.НайтиПоНаименованию(Марка);
							Если ЭлМарка = Справочники.Модели.ПустаяСсылка() Тогда
								ЭлМарка = Справочники.Модели.СоздатьГруппу();
								ЭлМарка.Наименование = Марка;
								ЭлМарка.Записать();
								Модель.Родитель = ЭлМарка.Ссылка;
							КонецЕсли;
						КонецЕсли;	
						Модель.ВалютаУчета = Справочники.Валюты.НайтиПоКоду("643"); 
						Модель.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;   
						Модель.УстановитьНовыйКод();
						Модель.Записать();
						НовАвто.Модель = Модель.Ссылка;
					КонецЕсли;
				КонецЕсли;
				
				НовАвто.ВалютаУчета = НовАвто.Модель.ВалютаУчета;
				Если Не ЗначениеЗаполнено(НовАвто.ВалютаУчета) Тогда
					НовАвто.ВалютаУчета = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
				КонецЕсли;	
				Если ЗначениеЗаполнено(ДатаНачалаГарантии) Тогда
					НовАвто.ДатаНачалаГарантии = Инфотек_ОбщиеПроцедуры.ПреобразоватьСтрокуВДату(ДатаНачалаГарантии);
				КонецЕсли;
				Если ЗначениеЗаполнено(ДатаКонцаГарантии) Тогда
					НовАвто.ДатаОкончанияГарантии = Инфотек_ОбщиеПроцедуры.ПреобразоватьСтрокуВДату(ДатаКонцаГарантии);
				КонецЕсли;		
				Попытка
					Если ЗначениеЗаполнено(ГодВыпуска) Тогда
						НовАвто.ГодВыпуска = Дата(ГодВыпуска+"0101");
					КонецЕсли;
				Исключение
				КонецПопытки;
				Наименование = "";
				Если ЗначениеЗаполнено(НовАвто.Модель) Тогда
					Наименование = Наименование + СокрЛП(НовАвто.Модель.Наименование);
				КонецЕсли;
				Если ЗначениеЗаполнено(ГосНомер) Тогда
					Если Не ПустаяСтрока(Наименование) Тогда 
						Наименование = Наименование + " "; 
					КонецЕсли; 
					Наименование = Наименование + "№ " + СокрЛП(ГосНомер);
				КонецЕсли;
				Если ЗначениеЗаполнено(VIN) Тогда
					Если Не ПустаяСтрока(Наименование) Тогда
						Наименование = Наименование + " ";
					КонецЕсли;  
					Наименование = Наименование + "VIN " + СокрЛП(VIN);
				КонецЕсли;
				Если Не ПустаяСтрока(Наименование) Тогда
					НовАвто.Наименование = Наименование; 
				КонецЕсли; 
				НовАвто.Записать();
				НачалоТекущегоДня = НачалоДня(ТекущаяДата());			
				Инфотек_ИнтеграцияCRM.ЗаписьЗначенияРегистраСведения(Контрагент,Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин,НовАвто);
				Если ЗначениеЗаполнено(ГосНомер) Тогда
					Инфотек_ИнтеграцияCRM.ЗаписьЗначенияРегистраСведения(ГосНомер,Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,НовАвто);
				КонецЕсли;
				ОбДокумент.Автомобиль = НовАвто.Ссылка;
			Иначе
				ЭлМодель = Справочники.Модели.НайтиПоНаименованию(СокрЛП(НаименованиеМодели));			
				Если ЭлМодель = Справочники.Модели.ПустаяСсылка() Тогда
					ОбДокумент.Автомобиль = СокрЛП(НаименованиеМодели);
				Иначе
					ОбДокумент.Автомобиль = ЭлМодель;				
				КонецЕсли;	
			КонецЕсли;	
		Иначе
			ОбДокумент.Автомобиль = Авто;
		КонецЕсли;
		
		ОбДокумент.ПричинаОбращения = Инфотек_ОбщиеПроцедуры.УбратьКавычки(црмРезультат.service_client_statement);
		
		Если црмРезультат.Свойство("serviceRepairType") Тогда 
			ТипРемонта = црмРезультат.serviceRepairType.name;
			
			ЗапросВР = Новый запрос();
			
			ЗапросВР.Текст = "ВЫБРАТЬ
			|	ВидыРемонта.Ссылка,
			|	ВидыРемонта.ТипРемонта
			|ИЗ
			|	Справочник.ВидыРемонта КАК ВидыРемонта
			|ГДЕ
			|	НЕ ВидыРемонта.ПометкаУдаления
			|	И ВидыРемонта.Наименование ПОДОБНО ""%"" + &ПарНаименование + ""%""";
			ЗапросВР.УстановитьПараметр("ПарНаименование",ТипРемонта);
			
			РезВР = ЗапросВР.Выполнить().Выбрать();
			Если РезВР.Следующий() Тогда
				ОбДокумент.ВидРемонта = РезВР.Ссылка;
			КонецЕсли;
		КонецЕсли;
		//КонецЕсли;
		Если црмРезультат.Свойство("works") Тогда 
			МассивРаботы = црмРезультат.works;
			Для Каждого ЭлРаботы Из МассивРаботы Цикл
				СтруктураРаботы = ЭлРаботы.serviceWork;
				
				НаименованиеРаботы = СтруктураРаботы.name;
				КодРаботы          = СтруктураРаботы.code;
				ВремяВыполнения    = СтруктураРаботы.execution_time;
				НормаВремени       = СтруктураРаботы.standard_execution_time; 
				
				Работа = Справочники.Автоработы.НайтиПоКоду(СокрЛП(КодРаботы));
				
				Если Работа = Справочники.Автоработы.ПустаяСсылка() Тогда
					Сообщить("Внимание! Работа --" + НаименованиеРаботы + "-- не найдена по номеру каталога!");
				Иначе
					НоваяСтрока = ОбДокумент.Работы.Добавить();
					НоваяСтрока.Работа = Работа;
					НоваяСтрока.Количество = 1;
					НоваяСтрока.ИдентификаторРаботы = Новый УникальныйИдентификатор();
					НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС; 
					ОбДокумент.ОбработкаРеквизита("Работы.Работа",НоваяСтрока,ОбДокументФорма);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
		
		ОбДокумент.ПерерасчетЦенАвторабот(Ложь,Новый Структура);
		
		#Если Клиент Тогда
			дкВывестиЗаголовокСуммаДокумента(ОбДокументФорма);
		#КонецЕсли
		
		ФИОМастера = "";
		
		ФИОМастера = црмРезультат.assignee.person;
		ИдентификаторМастера = црмРезультат.assignee.id;
		Если ЗначениеЗаполнено(ИдентификаторМастера) Тогда
			ОбДокумент.Мастер = Инфотек_ОбщиеПроцедуры.ПолучитьОбъектПоИдентификаторуСоответствия(НастройкаПодключения,ИдентификаторМастера,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Сотрудник);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ОбДокумент.Мастер) Тогда
			ЗапросСотр = Новый запрос();
			ЗапросСотр.УстановитьПараметр("парФИО", СокрЛП(ФИОМастера));
			ЗапросСотр.Текст = "ВЫБРАТЬ
			|	Сотрудники.Ссылка,
			|	Сотрудники.Наименование,
			|	Сотрудники.Представление
			|ИЗ
			|	Справочник.Сотрудники КАК Сотрудники
			|ГДЕ
			|	Сотрудники.Наименование ПОДОБНО ""%"" + &парФИО + ""%""";
			
			РезультатСотр = ЗапросСотр.Выполнить().Выбрать();
			Если РезультатСотр.Следующий() Тогда
				ОбДокумент.Мастер = РезультатСотр.Ссылка;
			КонецЕсли;
		КонецЕсли;
		//Диспетчер
		СписокДиспетчер = црмРезультат.author;
		ФИОДиспетчера = СписокДиспетчер.person;
		ИдентификаторДиспетчера = СписокДиспетчер.id;
		Если ЗначениеЗаполнено(ИдентификаторДиспетчера) Тогда
			ОбДокумент.Диспетчер = Инфотек_ОбщиеПроцедуры.ПолучитьОбъектПоИдентификаторуСоответствия(НастройкаПодключения,ИдентификаторДиспетчера,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Сотрудник);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ОбДокумент.Диспетчер) Тогда
			ЗапросСотр = Новый запрос();
			ЗапросСотр.УстановитьПараметр("парФИО", СокрЛП(ФИОДиспетчера));
			ЗапросСотр.Текст = "ВЫБРАТЬ
			|	Сотрудники.Ссылка,
			|	Сотрудники.Наименование,
			|	Сотрудники.Представление
			|ИЗ
			|	Справочник.Сотрудники КАК Сотрудники
			|ГДЕ
			|	Сотрудники.Наименование ПОДОБНО ""%"" + &парФИО + ""%""";
			РезультатДиспетчер = ЗапросСотр.Выполнить().Выбрать();
			Если РезультатДиспетчер.Следующий() Тогда
				ОбДокумент.Диспетчер = РезультатДиспетчер.Ссылка;
			КонецЕсли;  
		КонецЕсли;				
		
		стрПробег = 0;
		РезПробег = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьИнфоПоАвто(ОбДокумент.Автомобиль,Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
		Если РезПробег.Следующий() Тогда
			стрПробег = РезПробег.Значение;
		КонецЕсли;
		Если ЗначениеЗаполнено(Пробег) Тогда
			Если Число(Пробег) > стрПробег Тогда			
				ЗаписьЗначенияРегистраСведения(Число(Пробег),Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег,ОбДокумент.Автомобиль,ОбДокумент.Дата);   
				ОбДокумент.Пробег = Число(Пробег);
			КонецЕсли;
		КонецЕсли;			
	Иначе
		Сообщить("Внимание!!! Не выполнен запрос в CRM!!! Проверьте настройки подключения!", СтатусСообщения.Важное);
	КонецЕсли;	
	
КонецПроцедуры

// Процедура заполнения рабочего листа по структуре рабочего листа из CRM 
//                           
// Параметры:   
//  СтурктураРезультата - Структура - Обращение из CRM.
//  ОбДокумент          - ДокументОбъект.РабочийЛист - Объект документ рабочий лист.
//  ОбДокументФорма     - Форма - Форма документа рабочий лист.
//
Процедура ОбработатьСтруктуруЗаполнитьРеквизитыРабочегоЛиста(СтруктураРезультата, НастройкаПодключения, ОбДокумент, ОбДокументФорма) Экспорт
	Если СтруктураРезультата.success Тогда
		црмРезультат = СтруктураРезультата.result;	
		Если црмРезультат.Свойство("generalClient") Тогда        
			СтруктураКлиент = црмРезультат.generalClient;
			ТипКлиента = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураКлиент.type);
			Если СтрНайти(ТипКлиента,"individual") > 0 Тогда
				МассивТелефоны = СтруктураКлиент.primaryPerson.phones;				
			ИначеЕсли СтрНайти(ТипКлиента, "business") > 0 Тогда
				МассивТелефоны = СтруктураКлиент.company.phones;
			КонецЕсли;
			Если МассивТелефоны = Неопределено Или МассивТелефоны.Количество() = 0 Тогда
				Сообщить("В рабочем листе CRM Автодилер №" + црмРезультат.id + " не указаны телефоны клиента!", СтатусСообщения.Внимание);
				Возврат;
			КонецЕсли;
			
			МассивАвто     = црмРезультат.needs;
			СтруктураАвто  = МассивАвто[0];
			VIN            = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАвто.vin);
			ИдМодели       = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАвто.refModelId);
			ИдКомплектации = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАвто.ref_equipment_id);
			ИдИсточника    = Инфотек_ОбщиеПроцедуры.УбратьКавычки(црмРезультат.informationSourceId);     
			Если ЗначениеЗаполнено(ИдИсточника) Тогда
				ИсточникОбращения = Инфотек_ОбщиеПроцедуры.ПолучитьОбъектПоИдентификаторуСоответствия(НастройкаПодключения,ИдИсточника,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.ИсточникОбращения);
				ОбДокумент.Реклама = ИсточникОбращения; 
			КонецЕсли;
			
			ОбДокумент.Дата = ТекущаяДата();
			ОбДокумент.Инфотек_Идентификатор_CRM = ИдентификаторВСтроку(црмРезультат.id);
			
			Если Найти(ТипКлиента,"individual") <> 0 Тогда	
				СтруктураФизЛицо =  СтруктураКлиент.primaryPerson;
				ОбДокумент.ЮридическоеЛицо = Ложь;
				Фамилия       = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.lastName);
				Имя           = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.firstName);
				Отчество      = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.middleName);	
				Пол           = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.gender);
				Если ЗначениеЗаполнено(Фамилия) И ЗначениеЗаполнено(Имя) И ЗначениеЗаполнено(Отчество) Тогда 
					Контрагент = СоздатьОбновитьКонтрагента(СтруктураКлиент, НастройкаПодключения);			
					ОбДокумент.Контрагент = Контрагент;
					ОбДокумент.ДоговорВзаиморасчетов = ПолучитьСоздатьДоговорВзаиморасчетов(Контрагент, НастройкаПодключения, Перечисления.ВидыДоговоров.Продажа);
					ОбДокумент.Пол = Контрагент.Пол;
					ОбДокумент.ПредставлениеТелефона = киПолучитьПредставлениеКИ(Контрагент,Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
					Если Не ЗначениеЗаполнено(ОбДокумент.ПредставлениеТелефона) Тогда
						ОбДокумент.ПредставлениеТелефона = киПолучитьПредставлениеКИ(Контрагент,Справочники.ВидыКонтактнойИнформации.ТелефонСотовый);
					КонецЕсли; 
					Если Не ЗначениеЗаполнено(ОбДокумент.ПредставлениеТелефона) Тогда
						ОбДокумент.ПредставлениеТелефона = киПолучитьПредставлениеКИ(Контрагент,Справочники.ВидыКонтактнойИнформации.ТелефонДомашний);
					КонецЕсли;
					
				Иначе
					ОбДокумент.Контрагент = Имя;
					Если ЗначениеЗаполнено(Пол) Тогда
						ОбДокумент.Пол = ?(Пол = "M",Перечисления.ПолФизическихЛиц.Мужской,Перечисления.ПолФизическихЛиц.Женский);
					Иначе
						Если Найти(нрег(Прав(Отчество,3)),"вич") Тогда
							ОбДокумент.Пол = Перечисления.ПолФизическихЛиц.Мужской;
						ИначеЕсли Найти(нрег(Прав(Отчество,3)),"вна") Тогда
							ОбДокумент.Пол = Перечисления.ПолФизическихЛиц.Женский;
						КонецЕсли;
					КонецЕсли;   
					Для Каждого Эл Из МассивТелефоны Цикл			
						ОбДокумент.ПредставлениеТелефона = Эл.number;
					КонецЦикла;	
				КонецЕсли;
				
			ИначеЕсли Найти(ТипКлиента,"business") <> 0 Тогда	
				ОбДокумент.ЮридическоеЛицо = Истина;
				СтруктураОрганизация =  СтруктураКлиент.company;			
				НаименованиеКомпании = СтруктураОрганизация.name;
				ИНН    = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураОрганизация.inn);
				Если ЗначениеЗаполнено(НаименованиеКомпании) И ЗначениеЗаполнено(ИНН) Тогда 
					Контрагент = СоздатьОбновитьКонтрагента(СтруктураКлиент, НастройкаПодключения);			
					ОбДокумент.Контрагент = Контрагент;
					ОбДокумент.ПредставлениеТелефона = киПолучитьПредставлениеКИ(Контрагент,Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
					Если Не ЗначениеЗаполнено(ОбДокумент.ПредставлениеТелефона) Тогда
						ОбДокумент.ПредставлениеТелефона = киПолучитьПредставлениеКИ(Контрагент,Справочники.ВидыКонтактнойИнформации.ТелефонСотовый);
					КонецЕсли; 
					Если Не ЗначениеЗаполнено(ОбДокумент.ПредставлениеТелефона) Тогда
						ОбДокумент.ПредставлениеТелефона = киПолучитьПредставлениеКИ(Контрагент,Справочники.ВидыКонтактнойИнформации.ТелефонДомашний);
					КонецЕсли;
				Иначе
					ОбДокумент.Контрагент = НаименованиеКомпании; 
					Для Каждого Эл Из МассивТелефоны Цикл			
						ОбДокумент.ПредставлениеТелефона = Эл.number;
					КонецЦикла;	
				КонецЕсли;
			КонецЕсли;
			
			МодельАвтомобиля = Инфотек_ОбщиеПроцедуры.ПолучитьОбъектПоИдентификаторуСоответствия(НастройкаПодключения,ИдМодели,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Модель);
			Если МодельАвтомобиля <> Неопределено Тогда
				ОбДокумент.Модель = МодельАвтомобиля;   
				
			Иначе
				СтруктураМодели = ПолучитьМодельПоИдентификатору(НастройкаПодключения,ИдМодели);
				МодельАвтомобиля = Справочники.Модели.НайтиПоНаименованию(СтруктураМодели.Name);      
				Если Не ЗначениеЗаполнено(МодельАвтомобиля) Тогда
					СтруктураБренда = ПолучитьБрендПоИдентификатору(НастройкаПодключения,СтруктураМодели.brand_id);
					МодельАвтомобиля = Справочники.Модели.НайтиПоНаименованию(СтруктураБренда.Name + " " + СтруктураМодели.Name);   
				Иначе
					ОбДокумент.Модель = МодельАвтомобиля;
				КонецЕсли;	
				
				Если Не ЗначениеЗаполнено(МодельАвтомобиля) Тогда
					Бренд = Инфотек_ОбщиеПроцедуры.ПолучитьОбъектПоИдентификаторуСоответствия(НастройкаПодключения,СтруктураМодели.brand_id,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Бренд);
					Если Не ЗначениеЗаполнено(Бренд) Тогда
						Бренд = Справочники.Модели.НайтиПоНаименованию(СтруктураБренда.Name);
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Бренд) Тогда
						МодельАвтомобиля = Справочники.Модели.СоздатьЭлемент();
						МодельАвтомобиля.Наименование = Бренд.Наименование + " " + СтруктураМодели.Name;    
						МодельАвтомобиля.НаименованиеПолное = МодельАвтомобиля.Наименование;    
						МодельАвтомобиля.ВалютаУчета = Справочники.Валюты.НайтиПоКоду("643");
						МодельАвтомобиля.Марка = Бренд;
						
						ГруппаРодитель = Справочники.Модели.НайтиПоНаименованию(СтруктураБренда.Name,, Справочники.Модели.АВТОМОБИЛИ_В_ПРОДАЖЕ);
						Если обЗначениеНеЗаполнено(ГруппаРодитель) Тогда
							ГруппаРодитель = Справочники.Модели.АВТОМОБИЛИ_В_ПРОДАЖЕ;
						КонецЕсли;
						
						МодельАвтомобиля.Родитель = ГруппаРодитель;
						МодельАвтомобиля.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
						МодельАвтомобиля.УстановитьНовыйКод();
						МодельАвтомобиля.ОбменДанными.Загрузка = Истина;
						МодельАвтомобиля.Записать();
						МодельАвтомобиля = МодельАвтомобиля.Ссылка;
						ОбДокумент.Модель = МодельАвтомобиля;
						
					Иначе
						Сообщить("Не удалось найти/создать модель " + СтруктураМодели.Name + "!", СтатусСообщения.Внимание);
						Возврат;
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
			Если ЗначениеЗаполнено(ИдКомплектации) Тогда
				КомплектацияАвтомобиля = Инфотек_ОбщиеПроцедуры.ПолучитьОбъектПоИдентификаторуСоответствия(НастройкаПодключения,ИдКомплектации,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Комплектация);
				Если КомплектацияАвтомобиля <> Неопределено Тогда
					ОбДокумент.ВариантКомплектации = КомплектацияАвтомобиля;
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(VIN) Тогда
				ЗапросАвто = Новый Запрос();
				ЗапросАвто.Текст = 
				"ВЫБРАТЬ
				|	Авто.Ссылка КАК Ссылка,
				|	Авто.Модель КАК Модель
				|ИЗ
				|	Справочник.Автомобили КАК Авто
				|ГДЕ
				|	НЕ Авто.ПометкаУдаления
				|	И НЕ Авто.ЭтоГруппа
				|	И Авто.VIN ПОДОБНО ""%"" + &VIN + ""%""";
				ЗапросАвто.УстановитьПараметр("VIN","%"+VIN+"%");
				РезАвто = ЗапросАвто.Выполнить();
				Если Не РезАвто.Пустой() Тогда
					ВыборкаАвто = РезАвто.Выбрать();
					ВыборкаАвто.Следующий();
					ОбДокумент.Автомобиль = ВыборкаАвто.Ссылка;
					ОбДокумент.Модель = ВыборкаАвто.Модель;
					
				ИначеЕсли ЗначениеЗаполнено(МодельАвтомобиля) Тогда	
					НовАвто = Справочники.Автомобили.СоздатьЭлемент();
					НовАвто.УстановитьНовыйКод();
					НовАвто.VIN = VIN;
					НовАвто.НомерКузова = VIN;
					НовАвто.Модель = МодельАвтомобиля;	
					НовАвто.ВалютаУчета = НовАвто.Модель.ВалютаУчета;
					НовАвто.ВключатьВПрайсЛист = Перечисления.ВидВключенияВПрайсЛист.ПоУмолчанию;
					Если Не ЗначениеЗаполнено(НовАвто.ВалютаУчета) Тогда
						НовАвто.ВалютаУчета = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
					КонецЕсли;
					Если ЗначениеЗаполнено(КомплектацияАвтомобиля) Тогда
						НовАвто.ВариантКомплектации = КомплектацияАвтомобиля;
					КонецЕсли;
					Наименование = "";
					Если ЗначениеЗаполнено(НовАвто.Модель) Тогда
						Наименование = Наименование + СокрЛП(НовАвто.Модель.Наименование);
					КонецЕсли;
					Если ЗначениеЗаполнено(VIN) Тогда
						Если НЕ ПустаяСтрока(Наименование) Тогда
							Наименование = Наименование + " ";
						КонецЕсли;  
						Наименование = Наименование + "VIN " + СокрЛП(VIN);
					КонецЕсли;
					Если НЕ ПустаяСтрока(Наименование) Тогда
						НовАвто.Наименование = Наименование; 
					КонецЕсли;
					
					НовАвто.ОбменДанными.Загрузка = Истина;
					НовАвто.Записать();
					ОбДокумент.Автомобиль = НовАвто.Ссылка;
					ОбДокумент.Модель = МодельАвтомобиля;
				КонецЕсли;
				
			ИначеЕсли ЗначениеЗаполнено(МодельАвтомобиля) Тогда	 
				ОбДокумент.Модель = МодельАвтомобиля;	
			КонецЕсли;
			
			Если црмРезультат.type = "5" Тогда
				ОбДокумент.ВидАвтомобиля = Перечисления.ВидАвтомобиля.АвтомобильСПробегом;
				ОбДокумент.ТолькоБУ = Истина;
				ОбДокумент.Модель = Справочники.Модели.АвтоСПробегом;
				Попытка
					ОбДокумент.РРЦ = Число(црмРезультат.contract.sum);
				Исключение
				КонецПопытки;
				
			Иначе
				ОбДокумент.ВидАвтомобиля = Перечисления.ВидАвтомобиля.Новый;
			КонецЕсли;
			
			Попытка
				ФИОМенеджера = "";
				ФИОМенеджера = црмРезультат.assignee.person; 
				Если ФИОМенеджера = Неопределено Тогда
					ФамилияМенеджера       = Инфотек_ОбщиеПроцедуры.УбратьКавычки(црмРезультат.assignee.lastName);
					ИмяМенеджера           = Инфотек_ОбщиеПроцедуры.УбратьКавычки(црмРезультат.assignee.firstName);
					ОтчествоМенеджера      = Инфотек_ОбщиеПроцедуры.УбратьКавычки(црмРезультат.assignee.middleName);	
					ФИОМенеджера = ФамилияМенеджера + " " + ИмяМенеджера + " " + ОтчествоМенеджера;
				КонецЕсли;
				ИдентификаторМенеджера = црмРезультат.assignee.id;  
				Менеджер = Инфотек_ОбщиеПроцедуры.ПолучитьОбъектПоИдентификаторуСоответствия(НастройкаПодключения,ИдентификаторМенеджера,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Сотрудник);
				Если ЗначениеЗаполнено(Менеджер) Тогда			
					ОбДокумент.Менеджер = Менеджер;
				КонецЕсли;	
				Если Не ЗначениеЗаполнено(ОбДокумент.Менеджер) Тогда			
					ЗапросСотр = Новый Запрос();
					ЗапросСотр.УстановитьПараметр("парФИО",СокрЛП(ФИОМенеджера));
					ЗапросСотр.Текст = 
					"ВЫБРАТЬ
					|	Сотрудники.Ссылка,
					|	Сотрудники.Наименование,
					|	Сотрудники.Представление
					|ИЗ
					|	Справочник.Сотрудники КАК Сотрудники
					|ГДЕ
					|	Сотрудники.Наименование ПОДОБНО ""%"" + &парФИО + ""%""";
					РезультатСотр = ЗапросСотр.Выполнить().Выбрать();
					Если РезультатСотр.Следующий() Тогда
						ОбДокумент.Менеджер = РезультатСотр.Ссылка;
					КонецЕсли;
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			Автор = црмРезультат.author;
			ФИОАвтор = црмРезультат.author.person;
			Если ФИОАвтор = Неопределено Тогда
				ФамилияАвтор       = Инфотек_ОбщиеПроцедуры.УбратьКавычки(црмРезультат.author.lastName);
				ИмяАвтор           = Инфотек_ОбщиеПроцедуры.УбратьКавычки(црмРезультат.author.firstName);
				ОтчествоАвтор      = Инфотек_ОбщиеПроцедуры.УбратьКавычки(црмРезультат.author.middleName);	
				ФИОАвтор = ФамилияАвтор + " " + ИмяАвтор + " " + ОтчествоАвтор;
			КонецЕсли;
			
			ИдентификаторАвтора = црмРезультат.author.id;
			АвторСотрудник = Инфотек_ОбщиеПроцедуры.ПолучитьОбъектПоИдентификаторуСоответствия(НастройкаПодключения,ИдентификаторАвтора,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Сотрудник);
			Если ЗначениеЗаполнено(АвторСотрудник) Тогда
				ОбДокумент.Автор = Справочники.Пользователи.НайтиПоРеквизиту("Сотрудник",АвторСотрудник);
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ОбДокумент.Автор) Тогда		
				ЗапросПользователи = Новый запрос();
				ЗапросПользователи.УстановитьПараметр("парФИО",СокрЛП(ФИОАвтор));
				ЗапросПользователи.Текст = 
				"ВЫБРАТЬ
				|	Пользователи.Ссылка,
				|	Пользователи.Наименование,
				|	Пользователи.Представление
				|ИЗ
				|	Справочник.Пользователи КАК Пользователи
				|ГДЕ
				|	Пользователи.Наименование ПОДОБНО ""%"" + &парФИО + ""%""";
				
				РезультатПользователи = ЗапросПользователи.Выполнить().Выбрать();
				Если РезультатПользователи.Следующий() Тогда
					ОбДокумент.Автор = РезультатПользователи.Ссылка;
				КонецЕсли;
			КонецЕсли;
			
			РабочийЛистТрейдИнID = "";
			мСвязанныеРЛ = Новый Массив();
			Если црмРезультат.Свойство("relatedCases", мСвязанныеРЛ) И мСвязанныеРЛ.Количество() > 0 Тогда
				Для Каждого СвязанныйРЛ Из мСвязанныеРЛ Цикл
					Если СвязанныйРЛ.type = "1" Тогда
						РабочийЛистТрейдИнID = СвязанныйРЛ.id;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(РабочийЛистТрейдИнID) Тогда
				стРабочийЛистТрейдИн = ПолучитьСтруктуруРабочегоЛистаTradeInПоИдентификатору(РабочийЛистТрейдИнID, НастройкаПодключения);
				Если Не стРабочийЛистТрейдИн.success Тогда
					Возврат;
				КонецЕсли;
				АвтомобильТрейдИн = ПолучитьСоздатьАвтомобильТрейдИн(стРабочийЛистТрейдИн.result, НастройкаПодключения);
				Если обЗначениеНеЗаполнено(АвтомобильТрейдИн) Тогда
					Возврат;
				Иначе
					ОбДокумент.ТрейдИн = Истина;
				КонецЕсли;
				
				ОбДокумент.СобственникТрейдИн = ПолучитьСоздатьКонтрагентаТрейдИн(стРабочийЛистТрейдИн.result, НастройкаПодключения);
				ОбДокумент.АвтомобильТрейдИн = АвтомобильТрейдИн;
				ОбДокумент.ТрейдИнVIN = АвтомобильТрейдИн.VIN;
				ОбДокумент.МодельТрейдИн = АвтомобильТрейдИн.Модель;
				ОбДокумент.НетОбъявленияВInternet = Истина;
				
				СтруктураАвто  = стРабочийЛистТрейдИн.result.vehicle;
				ДополнительныеРеквизитыАвто = Инфотек_JSON.мПрочитатьJSON(СтруктураАвто.dataJson, Истина);
				Попытка
					ПрогнозСуммыРемонта = Число(ДополнительныеРеквизитыАвто.main.plannedCosts);
				Исключение
					ПрогнозСуммыРемонта = 1;
				КонецПопытки;
				Если ПрогнозСуммыРемонта > 2 Тогда
					ОбДокумент.ПрогнозСуммыРемонта = ПрогнозСуммыРемонта - 2;
				Иначе
					ОбДокумент.ПрогнозСуммыРемонта = 1;
				КонецЕсли;
				ОбДокумент.ПрогнозСуммыМКЦ = 1;
				ОбДокумент.ПрогнозСуммыДетейлинга = 1;
			КонецЕсли;
		КонецЕсли;  
	КонецЕсли;  
КонецПроцедуры

// Процедура заполнения рабочего листа Trade In по структуре рабочего листа из CRM 
//                           
// Параметры:   
//  СтурктураРезультата - Структура - Обращение из CRM.
//  ОбДокумент          - ДокументОбъект.РабочийЛистВыкупаАвтомобиля - Объект документ рабочий лист.
//  ОбДокументФорма     - Форма - Форма документа рабочий лист.
//
Процедура ОбработатьСтруктуруЗаполнитьРеквизитыРабочегоЛистаTradeIn(СтруктураРезультата,НастройкаПодключения,ОбДокумент,ОбДокументФорма) Экспорт
	
	Если СтруктураРезультата.success Тогда
		СтруктураРезультата = СтруктураРезультата.result; 	
		Если СтруктураРезультата.Свойство("generalClient") Тогда        
			СтруктураКлиент = СтруктураРезультата.generalClient;      
			ТипКлиента = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураКлиент.type);
			Если СтрНайти(ТипКлиента,"individual") > 0 Тогда
				МассивТелефоны = СтруктураКлиент.primaryPerson.phones;				
			ИначеЕсли СтрНайти(ТипКлиента, "business") > 0 Тогда
				МассивТелефоны = СтруктураКлиент.company.phones;
			КонецЕсли;
			Если МассивТелефоны = Неопределено Или МассивТелефоны.Количество() = 0 Тогда
				Возврат;
			КонецЕсли;			
			
			СтруктураАвто  = СтруктураРезультата.vehicle;  
			VIN            = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАвто.vin);
			ГосНомер       = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАвто.stateNumber); 
			ИдМодели       = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАвто.refModelId);
			ИдКомплектации = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАвто.ref_equipment_id); 
			ГодВыпуска     = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАвто.productionYear);     
			
			Попытка
				СтруктураДопРеквизитов = СтруктураАвто.warehouseVehicle;
				Цвет                   = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураДопРеквизитов.vehicle_color); 
				Салон                  = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураДопРеквизитов.vehicle_trim);
			Исключение
			КонецПопытки;
			МассивИнфоАвтомобиля = СтруктураРезультата.vehicleInfo;
			Кузов                = Инфотек_ОбщиеПроцедуры.УбратьКавычки(МассивИнфоАвтомобиля[0].series);

			ОбДокумент.Инфотек_Идентификатор_CRM = ИдентификаторВСтроку(СтруктураРезультата.id);   
			ОбДокумент.ГосНомер = ГосНомер; 
			Если Найти(ТипКлиента,"individual") <> 0 Тогда	
				СтруктураФизЛицо =  СтруктураКлиент.primaryPerson;
				Фамилия       = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.lastName);
				Имя           = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.firstName);
				Отчество      = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.middleName);	
				Если ЗначениеЗаполнено(Фамилия) И ЗначениеЗаполнено(Имя) И ЗначениеЗаполнено(Отчество) Тогда 
					Контрагент = Инфотек_ИнтеграцияCRM.СоздатьОбновитьКонтрагента(СтруктураКлиент, НастройкаПодключения);			
					ОбДокумент.Контрагент = Контрагент;
					ОбДокумент.ПредставлениеТелефона = киПолучитьПредставлениеКИ(Контрагент,Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
					Если Не ЗначениеЗаполнено(ОбДокумент.ПредставлениеТелефона) Тогда
						ОбДокумент.ПредставлениеТелефона = киПолучитьПредставлениеКИ(Контрагент,Справочники.ВидыКонтактнойИнформации.ТелефонСотовый);
					КонецЕсли; 
					Если Не ЗначениеЗаполнено(ОбДокумент.ПредставлениеТелефона) Тогда
						ОбДокумент.ПредставлениеТелефона = киПолучитьПредставлениеКИ(Контрагент,Справочники.ВидыКонтактнойИнформации.ТелефонДомашний);
					КонецЕсли;
				Иначе
					ОбДокумент.Контрагент = Имя;
					Для Каждого Эл Из МассивТелефоны Цикл			
						ОбДокумент.ПредставлениеТелефона = Эл.number;
					КонецЦикла;	
				КонецЕсли;
			ИначеЕсли Найти(ТипКлиента,"business") <> 0 Тогда	
				СтруктураОрганизация =  СтруктураКлиент.company;			
				НаименованиеКомпании = СтруктураОрганизация.name;
				email  = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураОрганизация.email);
				ИНН    = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураОрганизация.inn);
				Если ЗначениеЗаполнено(НаименованиеКомпании) И ЗначениеЗаполнено(ИНН) Тогда 
					Контрагент = Инфотек_ИнтеграцияCRM.СоздатьОбновитьКонтрагента(СтруктураКлиент, НастройкаПодключения);	
					ОбДокумент.Контрагент = Контрагент;
					ОбДокумент.ПредставлениеТелефона = киПолучитьПредставлениеКИ(Контрагент,Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
					Если Не ЗначениеЗаполнено(ОбДокумент.ПредставлениеТелефона) Тогда
						ОбДокумент.ПредставлениеТелефона = киПолучитьПредставлениеКИ(Контрагент,Справочники.ВидыКонтактнойИнформации.ТелефонСотовый);
					КонецЕсли; 
					Если Не ЗначениеЗаполнено(ОбДокумент.ПредставлениеТелефона) Тогда
						ОбДокумент.ПредставлениеТелефона = киПолучитьПредставлениеКИ(Контрагент,Справочники.ВидыКонтактнойИнформации.ТелефонДомашний);
					КонецЕсли;
				Иначе
					ОбДокумент.Контрагент = НаименованиеКомпании; 
					Для Каждого Эл Из МассивТелефоны Цикл			
						ОбДокумент.ПредставлениеТелефона = Эл.number;
					КонецЦикла;	
				КонецЕсли;
			КонецЕсли;
			МодельАвтомобиля = Инфотек_ОбщиеПроцедуры.ПолучитьОбъектПоИдентификаторуСоответствия(НастройкаПодключения,ИдМодели,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Модель);
			Если МодельАвтомобиля <> Неопределено Тогда
				ОбДокумент.Модель = МодельАвтомобиля;  
			Иначе
				СтруктураМодели = Инфотек_ИнтеграцияCRM.ПолучитьМодельПоИдентификатору(НастройкаПодключения,ИдМодели);
				МодельАвтомобиля = Справочники.Модели.НайтиПоНаименованию(СтруктураМодели.Name);      
				Если Не ЗначениеЗаполнено(МодельАвтомобиля) Тогда
					СтруктураБренда = Инфотек_ИнтеграцияCRM.ПолучитьБрендПоИдентификатору(НастройкаПодключения,СтруктураМодели.brand_id);
					МодельАвтомобиля = Справочники.Модели.НайтиПоНаименованию(СтруктураБренда.Name + " " + СтруктураМодели.Name);          
				Иначе
					ОбДокумент.Модель = МодельАвтомобиля;   
				КонецЕсли;	 
				Если Не ЗначениеЗаполнено(МодельАвтомобиля) Тогда
					Бренд = Инфотек_ОбщиеПроцедуры.ПолучитьОбъектПоИдентификаторуСоответствия(НастройкаПодключения,СтруктураМодели.brand_id,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Бренд);
					Если Не ЗначениеЗаполнено(Бренд) Тогда
						ЗапросБренда = Новый Запрос;
						ЗапросБренда.Текст = 
						"ВЫБРАТЬ
						|	Модели.Ссылка КАК Ссылка
						|ИЗ
						|	Справочник.Модели КАК Модели
						|ГДЕ
						|	Модели.Наименование = &Наименование
						|	И Модели.ЭтоГруппа = ИСТИНА";
						ЗапросБренда.УстановитьПараметр("Наименование",СтруктураБренда.Name);
						РезультатБренда = ЗапросБренда.Выполнить();
						Если Не РезультатБренда.Пустой() Тогда
							ВыборкаБренда = РезультатБренда.Выбрать();
							ВыборкаБренда.Следующий();
							Бренд = ВыборкаБренда.Ссылка;
						Иначе
							Бренд = Справочники.Модели.НайтиПоКоду("ЦБ00000049");
						КонецЕсли;
					КонецЕсли;
					Если ЗначениеЗаполнено(Бренд) Тогда
						МодельАвтомобиля = Справочники.Модели.СоздатьЭлемент();
						МодельАвтомобиля.Наименование = СтруктураБренда.Name + " " + СтруктураМодели.Name;    
						МодельАвтомобиля.НаименованиеПолное = СтруктураБренда.Name + " " + СтруктураМодели.Name;  
						МодельАвтомобиля.ВалютаУчета = Справочники.Валюты.НайтиПоКоду("643");	
						МодельАвтомобиля.Родитель = Бренд;     
						МодельАвтомобиля.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
						МодельАвтомобиля.УстановитьНовыйКод();
						Попытка 
							МодельАвтомобиля.Записать();
							МодельАвтомобиля = МодельАвтомобиля.Ссылка;
							ОбДокумент.Модель = МодельАвтомобиля;   
						Исключение
						КонецПопытки;
					КонецЕсли;  
				Иначе
					ОбДокумент.Модель = МодельАвтомобиля;   
				КонецЕсли;		
			КонецЕсли;

			Если ЗначениеЗаполнено(VIN) Тогда     
				ОбДокумент.VIN = VIN;
				ДополнительныеРеквизитыАвто = Инфотек_JSON.мПрочитатьJSON(СтруктураАвто.dataJson, Истина);   
				Попытка
					ПаспортАвтомобиля = ДополнительныеРеквизитыАвто.reg.passport;
					НомерДвигателя = ПаспортАвтомобиля.engineNumber;
					НомерКузова = ПаспортАвтомобиля.bodyNumber;
					НомерШасси = ПаспортАвтомобиля.chassisNumber;
				Исключение   
					ПаспортАвтомобиля = Неопределено;
					НомерКузова = "";
					НомерДвигателя = "";
					НомерШасси = "";
				КонецПопытки;									
				Попытка   
					Пробег = ДополнительныеРеквизитыАвто.main.mileage;
					ОбДокумент.Пробег = Число(Пробег);
				Исключение 
					Пробег = ""; 
				КонецПопытки;
				Попытка   
					СвидетельствоОРегистрации = ДополнительныеРеквизитыАвто.reg.certificate; 
				Исключение 
					СвидетельствоОРегистрации = Неопределено; 
				КонецПопытки;
				
				ЗапросАвто = Новый Запрос();
				ЗапросАвто.Текст = 
				"ВЫБРАТЬ
				|	Авто.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.Автомобили КАК Авто
				|ГДЕ
				|	НЕ Авто.ПометкаУдаления
				|	И НЕ Авто.ЭтоГруппа
				|	И Авто.VIN ПОДОБНО ""%"" + &VIN + ""%""";
				ЗапросАвто.УстановитьПараметр("VIN","%"+VIN+"%");
				РезАвто = ЗапросАвто.Выполнить();
				Если Не РезАвто.Пустой() Тогда
					ВыборкаАвто = РезАвто.Выбрать();
					ВыборкаАвто.Следующий();  
					Автомобиль = ВыборкаАвто.Ссылка.ПолучитьОбъект(); 
					Если ЗначениеЗаполнено(НомерДвигателя) Тогда
						Автомобиль.НомерДвигателя = НомерДвигателя;
					КонецЕсли;	
					Если ЗначениеЗаполнено(НомерКузова) Тогда
						Автомобиль.НомерКузова = НомерКузова;
					КонецЕсли;	
					Если ЗначениеЗаполнено(НомерШасси) Тогда
						Автомобиль.НомерШасси = НомерШасси;
					КонецЕсли;   
					Попытка
						Если ЗначениеЗаполнено(ГодВыпуска) Тогда
							Автомобиль.ГодВыпуска = Дата(ГодВыпуска+"0101");
						КонецЕсли;
					Исключение
					КонецПопытки;
					Попытка
						Если ЗначениеЗаполнено(Цвет) Тогда   
							ЦветАвтомобиля = Справочники.Цвета.НайтиПоНаименованию(Цвет);
							Если ЗначениеЗаполнено(ЦветАвтомобиля) Тогда 
								Автомобиль.Цвет = ЦветАвтомобиля;      
								ОбДокумент.Цвет = ЦветАвтомобиля;      
							Иначе
								ЦветАвтомобиля = Справочники.Цвета.СоздатьЭлемент();
								ЦветАвтомобиля.Наименование = Цвет; 
								ЦветАвтомобиля.Артикул = Цвет; 
								ЦветАвтомобиля.ЦветПоГИБДД = Цвет;
								ЦветАвтомобиля.УстановитьНовыйКод();
								ЦветАвтомобиля.Записать();
								Автомобиль.Цвет = ЦветАвтомобиля.Ссылка;  
								ОбДокумент.Цвет = ЦветАвтомобиля.Ссылка;  
							КонецЕсли;
						КонецЕсли;
					Исключение
					КонецПопытки;		
					Попытка
						Если ЗначениеЗаполнено(Кузов) Тогда   
							ТипКузова = Справочники.ТипыКузовов.НайтиПоНаименованию(Кузов);
							Если ЗначениеЗаполнено(ТипКузова) Тогда 
								Автомобиль.ТипКузова = ТипКузова;   
								ОбДокумент.ТипКузова = ТипКузова;
							Иначе
								ТипКузова = Справочники.ТипыКузовов.СоздатьЭлемент();
								ТипКузова.Наименование = Кузов;  
								ТипКузова.УстановитьНовыйКод();
								ТипКузова.Записать();
								Автомобиль.ТипКузова = ТипКузова.Ссылка;  
								ОбДокумент.ТипКузова = ТипКузова.Ссылка;  
							КонецЕсли;
						КонецЕсли;
					Исключение
					КонецПопытки;		
					Попытка
						Если ЗначениеЗаполнено(Салон) Тогда   
							ТипСалона = Справочники.ТипыСалона.НайтиПоНаименованию(Салон);
							Если ЗначениеЗаполнено(ТипСалона) Тогда 
								Автомобиль.ТипСалона = ТипСалона;      
							Иначе
								ТипСалона = Справочники.ТипыСалона.СоздатьЭлемент();
								ТипСалона.Наименование = Салон;   
								ТипСалона.УстановитьНовыйКод();
								ТипСалона.Записать();
								Автомобиль.ТипСалона = ТипСалона.Ссылка;  
							КонецЕсли;
						КонецЕсли;
					Исключение
					КонецПопытки;		
					Автомобиль.Записать();    
					ОбДокумент.Автомобиль = Автомобиль.Ссылка;
				ИначеЕсли ЗначениеЗаполнено(МодельАвтомобиля) Тогда	
					НовАвто = Справочники.Автомобили.СоздатьЭлемент();
					НовАвто.УстановитьНовыйКод();
					НовАвто.VIN = VIN;
					НовАвто.НомерКузова = VIN;
					НовАвто.Модель = МодельАвтомобиля;	
					НовАвто.ВалютаУчета = НовАвто.Модель.ВалютаУчета;  
					НовАвто.ВключатьВПрайсЛист = Перечисления.ВидВключенияВПрайсЛист.ПоУмолчанию;
					Попытка
						Если ЗначениеЗаполнено(ГодВыпуска) Тогда
							НовАвто.ГодВыпуска = Дата(ГодВыпуска+"0101");
						КонецЕсли;
					Исключение
					КонецПопытки;
					Попытка
						Если ЗначениеЗаполнено(Цвет) Тогда   
							ЦветАвтомобиля = Справочники.Цвета.НайтиПоНаименованию(Цвет);
							Если ЗначениеЗаполнено(ЦветАвтомобиля) Тогда 
								НовАвто.Цвет = ЦветАвтомобиля; 
								ОбДокумент.Цвет = ЦветАвтомобиля;
							Иначе
								ЦветАвтомобиля = Справочники.Цвета.СоздатьЭлемент();
								ЦветАвтомобиля.Наименование = Цвет; 
								ЦветАвтомобиля.Артикул = Цвет; 
								ЦветАвтомобиля.ЦветПоГИБДД = Цвет;
								ЦветАвтомобиля.УстановитьНовыйКод();
								ЦветАвтомобиля.Записать();
								НовАвто.Цвет = ЦветАвтомобиля.Ссылка; 
								ОбДокумент.Цвет = ЦветАвтомобиля.Ссылка;
							КонецЕсли;
						КонецЕсли;
					Исключение
					КонецПопытки;  
					Попытка
						Если ЗначениеЗаполнено(Кузов) Тогда   
							ТипКузова = Справочники.ТипыКузовов.НайтиПоНаименованию(Кузов);
							Если ЗначениеЗаполнено(ТипКузова) Тогда 
								НовАвто.ТипКузова = ТипКузова;      
								ОбДокумент.ТипКузова = ТипКузова;
							Иначе
								ТипКузова = Справочники.ТипыКузовов.СоздатьЭлемент();
								ТипКузова.Наименование = Кузов;  
								ТипКузова.УстановитьНовыйКод();
								ТипКузова.Записать();
								НовАвто.ТипКузова = ТипКузова.Ссылка;     
								ОбДокумент.ТипКузова = ТипКузова.Ссылка;
							КонецЕсли;
						КонецЕсли;
					Исключение
					КонецПопытки;
					Попытка
						Если ЗначениеЗаполнено(Салон) Тогда   
							ТипСалона = Справочники.ТипыСалона.НайтиПоНаименованию(Салон);
							Если ЗначениеЗаполнено(ТипСалона) Тогда 
								НовАвто.ТипСалона = ТипСалона;      
							Иначе
								ТипСалона = Справочники.ТипыСалона.СоздатьЭлемент();
								ТипСалона.Наименование = Салон;    
								ТипСалона.УстановитьНовыйКод();
								ТипСалона.Записать();
								НовАвто.ТипСалона = ТипСалона.Ссылка;  
							КонецЕсли;
						КонецЕсли;
					Исключение
					КонецПопытки;		
					Если ЗначениеЗаполнено(НомерДвигателя) Тогда
						НовАвто.НомерДвигателя = НомерДвигателя;
					КонецЕсли;	
					Если ЗначениеЗаполнено(НомерКузова) Тогда
						НовАвто.НомерКузова = НомерКузова;
					КонецЕсли;	
					Если ЗначениеЗаполнено(НомерШасси) Тогда
						НовАвто.НомерШасси = НомерШасси;
					КонецЕсли;
					Если Не ЗначениеЗаполнено(НовАвто.ВалютаУчета) Тогда
						НовАвто.ВалютаУчета = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
					КонецЕсли;   
					Если ЗначениеЗаполнено(ИдКомплектации) Тогда
						КомплектацияАвтомобиля = Инфотек_ОбщиеПроцедуры.ПолучитьОбъектПоИдентификаторуСоответствия(НастройкаПодключения,ИдКомплектации,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Комплектация);
						Если ЗначениеЗаполнено(КомплектацияАвтомобиля) Тогда
							НовАвто.ВариантКомплектации = КомплектацияАвтомобиля;
						КонецЕсли;
					КонецЕсли;				
					Наименование = "";
					Если ЗначениеЗаполнено(НовАвто.Модель) Тогда
						Наименование = Наименование + СокрЛП(НовАвто.Модель.Наименование);
					КонецЕсли;
					Если ЗначениеЗаполнено(VIN) Тогда
						Если Не ПустаяСтрока(Наименование) Тогда
							Наименование = Наименование + " ";
						КонецЕсли;  
						Наименование = Наименование + "VIN " + СокрЛП(VIN);
					КонецЕсли;
					Если Не ПустаяСтрока(Наименование) Тогда
						НовАвто.Наименование = Наименование; 
					КонецЕсли; 
					Попытка
						НовАвто.Записать();
						ОбДокумент.Автомобиль = НовАвто.Ссылка;   
					Исключение
					КонецПопытки;   				
				КонецЕсли; 
				Если ЗначениеЗаполнено(ОбДокумент.Автомобиль) Тогда
					Попытка 
						Если ПаспортАвтомобиля <> Неопределено Тогда
							ТехПаспорт = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ОбДокумент.Автомобиль,Перечисления.ДополнительнаяИнформацияАвтомобилей.ТехПаспорт); 
							Если Не ЗначениеЗаполнено(ТехПаспорт) И ЗначениеЗаполнено(ПаспортАвтомобиля.number) Тогда
								ТехПаспорт = Справочники.ПодтверждающиеДокументы.СоздатьЭлемент();  
								ТехПаспорт.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.ПТС;
								НомерПТС = СтрЗаменить(ПаспортАвтомобиля.number," ","");
								ТехПаспорт.Серия = Лев(НомерПТС,4);
								ТехПаспорт.Номер = Сред(НомерПТС,5);
								ТехПаспорт.ДатаВыдачи = Инфотек_ОбщиеПроцедуры.СтрокаВДатуВремя(ПаспортАвтомобиля.issuedAt,"dd.mm.yyyy");
								ТехПаспорт.КемВыдан = ПаспортАвтомобиля.issuedBy;
								ТехПаспорт.Владелец = ОбДокумент.Автомобиль;   
								ТехПаспорт.Организация = НастройкаПодключения.Организация; 
								ТехПаспорт.Наименование = Справочники.ПодтверждающиеДокументы.СформироватьНаименованиеПоУмолчанию(ТехПаспорт);								
								ТехПаспорт.Записать();
								Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(ОбДокумент.Автомобиль,
								ТехПаспорт.Ссылка,Перечисления.ДополнительнаяИнформацияАвтомобилей.ТехПаспорт,
								НачалоДня(ТекущаяДата()));
							КонецЕсли; 
						КонецЕсли;   
						Если СвидетельствоОРегистрации <> Неопределено Тогда	
							СвидетельствоОРегистрацииТС = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ОбДокумент.Автомобиль,Перечисления.ДополнительнаяИнформацияАвтомобилей.СвидетельствоОРегистрацииТС);
							Если Не ЗначениеЗаполнено(СвидетельствоОРегистрацииТС) И ЗначениеЗаполнено(СвидетельствоОРегистрации.number) Тогда
								СвидетельствоОРегистрацииТС = Справочники.ПодтверждающиеДокументы.СоздатьЭлемент();  
								СвидетельствоОРегистрацииТС.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.СвидетельствоОРегистрацииТС;
								НомерСТС = СтрЗаменить(СвидетельствоОРегистрации.number," ","");
								СвидетельствоОРегистрацииТС.Серия = Лев(НомерСТС,4);
								СвидетельствоОРегистрацииТС.Номер = Сред(НомерСТС,5);
								СвидетельствоОРегистрацииТС.ДатаВыдачи = Инфотек_ОбщиеПроцедуры.СтрокаВДатуВремя(СвидетельствоОРегистрации.issuedAt,"dd.mm.yyyy");
								СвидетельствоОРегистрацииТС.КемВыдан = СвидетельствоОРегистрации.issuedBy;
								СвидетельствоОРегистрацииТС.Владелец = ОбДокумент.Автомобиль;   
								СвидетельствоОРегистрацииТС.Организация = НастройкаПодключения.Организация;  
								СвидетельствоОРегистрацииТС.Наименование = Справочники.ПодтверждающиеДокументы.СформироватьНаименованиеПоУмолчанию(СвидетельствоОРегистрацииТС);								
								СвидетельствоОРегистрацииТС.Записать();
								Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(ОбДокумент.Автомобиль,
								СвидетельствоОРегистрацииТС.Ссылка,Перечисления.ДополнительнаяИнформацияАвтомобилей.СвидетельствоОРегистрацииТС,
								НачалоДня(ТекущаяДата()));
							КонецЕсли;     
						КонецЕсли;
						РезПробег = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьИнфоПоАвто(ОбДокумент.Автомобиль,Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
						Если РезПробег.Следующий() Тогда
							стрПробег = РезПробег.Значение;
						Иначе
							стрПробег = 0;
						КонецЕсли;
						Если ЗначениеЗаполнено(Пробег) Тогда    
							ОбДокумент.Пробег = Число(Пробег);
							Если Число(Пробег) > стрПробег Тогда		
								Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(ОбДокумент.Автомобиль,Число(Пробег),Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег,ТекущаяДата());
							КонецЕсли;
						КонецЕсли;		
						Если ЗначениеЗаполнено(ГосНомер) Тогда 
							Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(ОбДокумент.Автомобиль,ГосНомер,Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,ТекущаяДата());
							ОбДокумент.ГосНомер = ГосНомер;
						КонецЕсли;			
					Исключение;
					КонецПопытки; 
				КонецЕсли;	
			КонецЕсли;	
			
			Попытка
				ФИОМенеджера = "";
				ФИОМенеджера = СтруктураРезультата.assignee.person; 
				Если ФИОМенеджера = Неопределено Тогда
					ФамилияМенеджера       = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураРезультата.assignee.lastName);
					ИмяМенеджера           = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураРезультата.assignee.firstName);
					ОтчествоМенеджера      = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураРезультата.assignee.middleName);	
					ФИОМенеджера = ФамилияМенеджера + " " + ИмяМенеджера + " " + ОтчествоМенеджера;
				КонецЕсли;
				ИдентификаторМенеджера = СтруктураРезультата.assignee.id;  
				Менеджер = Инфотек_ОбщиеПроцедуры.ПолучитьОбъектПоИдентификаторуСоответствия(НастройкаПодключения,ИдентификаторМенеджера,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Сотрудник);
				Если ЗначениеЗаполнено(Менеджер) Тогда			
					ОбДокумент.Менеджер = Менеджер;
					ОбДокумент.Оценщик = ОбДокумент.Менеджер;
				КонецЕсли;	
				//Если Не ЗначениеЗаполнено(ОбДокумент.Менеджер) Тогда			
					ЗапросСотр = Новый Запрос();
					ЗапросСотр.УстановитьПараметр("парФИО",СокрЛП(ФИОМенеджера));
					ЗапросСотр.Текст = 
					"ВЫБРАТЬ
					|	Сотрудники.Ссылка,
					|	Сотрудники.Наименование,
					|	Сотрудники.Представление
					|ИЗ
					|	Справочник.Сотрудники КАК Сотрудники
					|ГДЕ
					|	Сотрудники.Наименование ПОДОБНО ""%"" + &парФИО + ""%""";
					РезультатСотр = ЗапросСотр.Выполнить().Выбрать();
					Если РезультатСотр.Следующий() Тогда
						ОбДокумент.Менеджер = РезультатСотр.Ссылка;
						ОбДокумент.Оценщик = ОбДокумент.Менеджер;
					КонецЕсли;
				//КонецЕсли;
			Исключение
			КонецПопытки;
			
			Автор = СтруктураРезультата.author;
			ФИОАвтор = СтруктураРезультата.author.person;
			Если ФИОАвтор = Неопределено Тогда
				ФамилияАвтор       = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураРезультата.author.lastName);
				ИмяАвтор           = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураРезультата.author.firstName);
				ОтчествоАвтор      = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураРезультата.author.middleName);	
				ФИОАвтор = ФамилияАвтор + " " + ИмяАвтор + " " + ОтчествоАвтор;
			КонецЕсли;
			ИдентификаторАвтора = СтруктураРезультата.author.id;
			АвторСотрудник = Инфотек_ОбщиеПроцедуры.ПолучитьОбъектПоИдентификаторуСоответствия(НастройкаПодключения,ИдентификаторАвтора,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Сотрудник);
			Если ЗначениеЗаполнено(АвторСотрудник) Тогда
				ОбДокумент.Автор = Справочники.Пользователи.НайтиПоРеквизиту("Сотрудник",АвторСотрудник);
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ОбДокумент.Автор) Тогда		
				ЗапросПользователи = Новый запрос();
				ЗапросПользователи.УстановитьПараметр("парФИО",СокрЛП(ФИОАвтор));
				ЗапросПользователи.Текст = 
				"ВЫБРАТЬ
				|	Пользователи.Ссылка,
				|	Пользователи.Наименование,
				|	Пользователи.Представление
				|ИЗ
				|	Справочник.Пользователи КАК Пользователи
				|ГДЕ
				|	Пользователи.Наименование ПОДОБНО ""%"" + &парФИО + ""%""";
				
				РезультатПользователи = ЗапросПользователи.Выполнить().Выбрать();
				Если РезультатПользователи.Следующий() Тогда
					ОбДокумент.Автор = РезультатПользователи.Ссылка;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;  	
	КонецЕсли;   
	
КонецПроцедуры

// Процедура заполнения Поступления автомобилей по структуре рабочего листа Trade In из CRM 
//                           
// Параметры:   
//  СтурктураРезультата - Структура - Обращение из CRM.
//  ОбДокумент          - ДокументОбъект.ПоступлениеАвтомобилей - Объект документ ПоступлениеАвтомобилей.
//  ОбДокументФорма     - Форма - Форма документа ПоступлениеАвтомобилей.
//
Процедура ОбработатьСтруктуруЗаполнитьРеквизитыПоступленияАвтомобилей(СтруктураРезультата,НастройкаПодключения,ОбДокумент,ОбДокументФорма) Экспорт
	Если Не СтруктураРезультата.success Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураРезультата = СтруктураРезультата.result; 	
	Если Не СтруктураРезультата.Свойство("generalClient") Тогда
		Сообщить("Нет данных по Клиенту в Рабочем листе TradeIn №" + Строка(СтруктураРезультата.id), СтатусСообщения.Внимание);
		Возврат;
	Иначе
		ОбДокумент.Инфотек_Идентификатор_CRM = ИдентификаторВСтроку(СтруктураРезультата.id); 
	КонецЕсли;

	Контрагент = ПолучитьСоздатьКонтрагентаТрейдИн(СтруктураРезультата, НастройкаПодключения);
	Если обЗначениеНеЗаполнено(Контрагент) Тогда
		Возврат;
		
	Иначе
		ОбДокумент.Контрагент = Контрагент;
		ОбДокумент.ДоговорВзаиморасчетов = ПолучитьСоздатьДоговорВзаиморасчетов(Контрагент, НастройкаПодключения, Перечисления.ВидыДоговоров.Покупка);
	КонецЕсли;
	
	Автомобиль = ПолучитьСоздатьАвтомобильТрейдИн(СтруктураРезультата, НастройкаПодключения);
	Если обЗначениеНеЗаполнено(Автомобиль) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаАвтомобиль = ОбДокумент.Автомобили.Добавить();
	СтрокаАвтомобиль.Автомобиль = Автомобиль;
	СтрокаАвтомобиль.ИдентификаторАвтомобиля = Новый УникальныйИдентификатор;
	СтрокаАвтомобиль.VIN = Автомобиль.VIN;
	СтрокаАвтомобиль.АвтомобильБУ = Истина;
	СтрокаАвтомобиль.ВидАвтомобиля = Перечисления.ВидАвтомобиля.АвтомобильСПробегом;
	СтрокаАвтомобиль.АвтомобильБезЗаказа = Истина;
	СтрокаАвтомобиль.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
	СтрокаАвтомобиль.Количество = 1;
	СтрокаАвтомобиль.Цена = ПолучитьПредложеннуюЦенуТрейдИн(ОбДокумент.Инфотек_Идентификатор_CRM, НастройкаПодключения);
	ОбДокумент.ОбработкаРеквизита("Автомобили.Цена", СтрокаАвтомобиль);
	
	ФИОМенеджера = "";
	ФИОМенеджера = СтруктураРезультата.assignee.person; 
	Если ФИОМенеджера = Неопределено Тогда
		ФамилияМенеджера       = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураРезультата.assignee.lastName);
		ИмяМенеджера           = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураРезультата.assignee.firstName);
		ОтчествоМенеджера      = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураРезультата.assignee.middleName);	
		ФИОМенеджера = ФамилияМенеджера + " " + ИмяМенеджера + " " + ОтчествоМенеджера;
	КонецЕсли;
	ИдентификаторМенеджера = СтруктураРезультата.assignee.id;  
	Менеджер = Инфотек_ОбщиеПроцедуры.ПолучитьОбъектПоИдентификаторуСоответствия(НастройкаПодключения,ИдентификаторМенеджера,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Сотрудник);
	Если ЗначениеЗаполнено(Менеджер) Тогда			
		ОбДокумент.Менеджер = Менеджер;
		
	Иначе
		ЗапросСотр = Новый Запрос();
		ЗапросСотр.УстановитьПараметр("парФИО",СокрЛП(ФИОМенеджера));
		ЗапросСотр.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка,
		|	Сотрудники.Наименование,
		|	Сотрудники.Представление
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Наименование ПОДОБНО ""%"" + &парФИО + ""%""";
		
		РезультатСотр = ЗапросСотр.Выполнить().Выбрать();
		Если РезультатСотр.Следующий() Тогда
			ОбДокумент.Менеджер = РезультатСотр.Ссылка;
		КонецЕсли;	
	КонецЕсли;	

	Автор = СтруктураРезультата.author;
	ФИОАвтор = СтруктураРезультата.author.person;
	Если ФИОАвтор = Неопределено Тогда
		ФамилияАвтор       = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураРезультата.author.lastName);
		ИмяАвтор           = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураРезультата.author.firstName);
		ОтчествоАвтор      = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураРезультата.author.middleName);	
		ФИОАвтор = ФамилияАвтор + " " + ИмяАвтор + " " + ОтчествоАвтор;
	КонецЕсли;
	ИдентификаторАвтора = СтруктураРезультата.author.id;
	АвторСотрудник = Инфотек_ОбщиеПроцедуры.ПолучитьОбъектПоИдентификаторуСоответствия(НастройкаПодключения,ИдентификаторАвтора,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Сотрудник);
	Если ЗначениеЗаполнено(АвторСотрудник) Тогда
		ОбДокумент.Автор = Справочники.Пользователи.НайтиПоРеквизиту("Сотрудник",АвторСотрудник);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ОбДокумент.Автор) Тогда		
		ЗапросПользователи = Новый запрос();
		ЗапросПользователи.УстановитьПараметр("парФИО",СокрЛП(ФИОАвтор));
		ЗапросПользователи.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка,
		|	Пользователи.Наименование,
		|	Пользователи.Представление
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Наименование ПОДОБНО ""%"" + &парФИО + ""%""";
		
		РезультатПользователи = ЗапросПользователи.Выполнить().Выбрать();
		Если РезультатПользователи.Следующий() Тогда
			ОбДокумент.Автор = РезультатПользователи.Ссылка;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции Формирования, отправки данных в CRM

// Подписка на событие при записи по передаче данных по документам в CRM 
//                           
// Параметры:   
//  Источник - ДокументОбъект - Объект документ.
//	Отказ    - Флаг отказа
//
Процедура Инфотек_ПриЗаписиДокументаПриЗаписи(Источник, Отказ) Экспорт
	Возврат;
	//////////////////////////////////////////////////////////////////
	Попытка
		//KamikadZe begin add 13.02.2024 22:39:36
		Если обПраво("ВыгрузкаВ_СРМ_Автодилер") Тогда
			//KamikadZe end add
			НастройкаПодключения = ПолучитьНастройкуПодключенияПоДокументу(Источник); 
			
			Если НастройкаПодключения <> Неопределено Тогда
				Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказНаряд") И НастройкаПодключения.ВыгрузкаЗаказНарядов = Истина Тогда		
					
					ОписаниеЗаказНаряда = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьОписаниеЗаказНарядаCRM(Источник.Ссылка,НастройкаПодключения);
					Если ОписаниеЗаказНаряда <> Неопределено Тогда
						Успешно = СоздатьОбновитьЗаказНарядВCRM(Источник.Ссылка,ОписаниеЗаказНаряда,НастройкаПодключения);			
						Если Не Успешно Тогда
							Сообщить("Произошла ошибка! Не удалось передать документ в CRM-систему!!!");
						КонецЕсли;
						Если Успешно Тогда
							Для Каждого СтрокаРабот ИЗ Источник.Работы Цикл
								ЗначениеТО = обПолучитьЗначениеСвойства(СтрокаРабот.Работа,НастройкаПодключения.СвойствоЗаказНарядаТО); 
								Если ЗначениеЗаполнено(ЗначениеТО) Тогда
									ИдентификаторВидаРемонтаТО = Инфотек_ОбщиеПроцедуры.ПолучитьИдентификаторСоответствияПоОбъекту(НастройкаПодключения,ЗначениеТО,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.ВидРемонтаТО);
									Если ЗначениеЗаполнено(ИдентификаторВидаРемонтаТО) Тогда
										Прервать;
									КонецЕсли;  
								КонецЕсли;					
							КонецЦикла; 
							Если Не ЗначениеЗаполнено(ИдентификаторВидаРемонтаТО) Тогда      
								ЗначениеТО = обПолучитьЗначениеСвойства(Источник.Ссылка,НастройкаПодключения.СвойствоЗаказНарядаТО); 
								Если ЗначениеЗаполнено(ЗначениеТО) Тогда
									ИдентификаторВидаРемонтаТО = Инфотек_ОбщиеПроцедуры.ПолучитьИдентификаторСоответствияПоОбъекту(НастройкаПодключения,ЗначениеТО,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.ВидРемонтаТО);
								КонецЕсли;
							КонецЕсли;
							Если ЗначениеЗаполнено(ИдентификаторВидаРемонтаТО) Тогда
								Успешно = ОбработатьДанныеПоТО(Источник.Ссылка,ИдентификаторВидаРемонтаТО,НастройкаПодключения);	
								Если Не Успешно Тогда
									Сообщить("Произошла ошибка! Не удалось передать данные по ТО в CRM-систему!!!");
								КонецЕсли;
							КонецЕсли;					
						КонецЕсли;
					КонецЕсли; 
					Если Инфотек_ОбщиеПроцедуры.ЭтоДополнительноеОборудование(Источник.Ссылка,НастройкаПодключения) Тогда
						// Теперь поищем авто в регистре ранее переданных данных
						ID_Автомобиля = Инфотек_ОбщиеПроцедуры.ПолучитьИдентификаторСоответствияПоОбъекту(НастройкаПодключения,Источник.Автомобиль,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.АвтомобильСклада);
						Если Не ЗначениеЗаполнено(ID_Автомобиля) Тогда
							// Не нашли. Теперь поищем авто на складе в CRM по его VIN номеру    
							НастройкаДляПоискаАвто = Справочники.Инфотек_НастройкиПодключения.Выбрать();
							Пока НастройкаДляПоискаАвто.Следующий() Цикл 
								Если НастройкаДляПоискаАвто.Ссылка.ПометкаУдаления = Ложь Тогда 
									ID_Автомобиля = ПолучитьИдентфикаторАвтомобиляНаСкладеПоVIN(Источник.Автомобиль.VIN,НастройкаДляПоискаАвто.Ссылка);    
									Если ЗначениеЗаполнено(ID_Автомобиля) Тогда
										Прервать;
									КонецЕсли;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
						Если ЗначениеЗаполнено(ID_Автомобиля) И Источник.СуммаДокумента > 0 Тогда
							// Обновим дополнительное оборудование
							ОписаниеДополнительногоОборудованияАвтомобиля = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьОписаниеДополнительногоОборудованияАвтомобиля(Источник.Ссылка,ID_Автомобиля,НастройкаПодключения);
							Успешно = СоздатьОбновитьДополнительноеОборудованиеАвтомобиляВCRM(ОписаниеДополнительногоОборудованияАвтомобиля,НастройкаПодключения);			
							Если Не Успешно Тогда
								Сообщить("Произошла ошибка! Не удалось передать дополнительное оборудование автомобиля в CRM-систему!!!");
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;					
				ИначеЕсли  ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаявкаНаРемонт") Тогда
					Если ЗначениеЗаполнено(Источник.Инфотек_ИдентификаторОбращения) Тогда  
						Если Источник.Состояние = Перечисления.СостоянияЗаявкиНаРемонт.Отклонено Тогда  
							Успешно = ЗавершитьОбращениеОтменойИзДокумента(Источник.Ссылка,НастройкаПодключения);
						Иначе
							Успешно = ЗавершитьОбращение(Источник.Ссылка,НастройкаПодключения); 
						КонецЕсли;
					КонецЕсли; 	
					
				ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияАвтомобилей") Тогда	 
					Если Источник.ПометкаУдаления = Истина Тогда 
						МассивРабочихЛистов = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьРабочиеЛистыПоДокументу(Источник.Ссылка);
						Для Индекс = 0 По МассивРабочихЛистов.Количество() - 1 Цикл
							Если ЗначениеЗаполнено(МассивРабочихЛистов[Индекс].Инфотек_Идентификатор_CRM) И МассивРабочихЛистов[Индекс].Инфотек_ОтключитьОбменCRM = Ложь Тогда
								Для Каждого СтрокаАвто Из Источник.Автомобили Цикл		
									Результат = ПодтвердитьВыдачу(Источник.Ссылка,СтрокаАвто.Автомобиль,НастройкаПодключения,МассивРабочихЛистов[Индекс].Инфотек_Идентификатор_CRM);
									Если Результат = Ложь Тогда
										Отказ = Истина;
									КонецЕсли;
								КонецЦикла;
							КонецЕсли;
						КонецЦикла;	
					КонецЕсли;
					
				ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПеремещениеАвтомобилей") Тогда	
					// Здесь все сложнее: перемещение может быть между складами, а может и между дц (т.е. разные CRM учетки)
					Для Каждого СтрокаАвто Из Источник.Автомобили Цикл
						ID_Автомобиля = Инфотек_ОбщиеПроцедуры.ПолучитьИдентификаторСоответствияПоОбъекту(НастройкаПодключения,СтрокаАвто.Автомобиль,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.АвтомобильСклада);
						Выборка = Справочники.Инфотек_НастройкиПодключения.Выбрать();
						Пока Выборка.Следующий() Цикл  
							СтруктураАвтомобиля = ПолучитьСтруктуруАвтомобиляНаСкладеПоVIN(СтрокаАвто.Автомобиль.VIN,НастройкаПодключения);
							Если ЗначениеЗаполнено(СтруктураАвтомобиля) Тогда     
								Прервать;
							КонецЕсли;
						КонецЦикла;	
						Если Не ЗначениеЗаполнено(ID_Автомобиля) Тогда
							Если ЗначениеЗаполнено(СтруктураАвтомобиля) Тогда 
								ID_Автомобиля = СтруктураАвтомобиля.id;
							КонецЕсли;
						КонецЕсли;
						Если ЗначениеЗаполнено(ID_Автомобиля) Тогда   
							ИдентификаторАвтосалонаОтправителя = Инфотек_ОбщиеПроцедуры.ПолучитьИдентификаторСоответствияПоОбъекту(НастройкаПодключения,Источник.СкладКомпании.ПодразделениеКомпании,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Автосалон); 
							ИдентификаторАвтосалонаПолучателя = Инфотек_ОбщиеПроцедуры.ПолучитьИдентификаторСоответствияПоОбъекту(НастройкаПодключения,Источник.СкладПолучатель.ПодразделениеКомпании,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Автосалон); 
							Если ЗначениеЗаполнено(ИдентификаторАвтосалонаОтправителя) И ЗначениеЗаполнено(ИдентификаторАвтосалонаПолучателя) И ИдентификаторАвтосалонаОтправителя <> ИдентификаторАвтосалонаПолучателя Тогда	
								Успешно = ОбновитьАвтосалонАвтомобиляВCRM(ИдентификаторАвтосалонаПолучателя,СтрокаАвто.Автомобиль,ID_Автомобиля,НастройкаПодключения);
								Если Не Успешно Тогда
									Сообщить("Произошла ошибка! Не удалось передать изменение автосалона автомобиля в CRM-систему!!!");
								КонецЕсли;                                                              
							КонецЕсли;	
							ИдентификаторСклада = Инфотек_ОбщиеПроцедуры.ПолучитьИдентификаторСоответствияПоОбъекту(НастройкаПодключения,Источник.СкладПолучатель,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.МестоХранения);		
							Если ЗначениеЗаполнено(ИдентификаторСклада) Тогда
								СтруктураСкладаПеремещения = ПолучитьМестоХраненияПоИдентификатору(НастройкаПодключения,ИдентификаторСклада);
								ОписаниеМестаХранения = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьОписаниеМестаХраненияСклада(СтруктураСкладаПеремещения,Источник.Ссылка,ID_Автомобиля,НастройкаПодключения);
								Успешно = СоздатьОбновитьМестоХраненияНаСкладеВCRM(СтрокаАвто.Автомобиль,ОписаниеМестаХранения,НастройкаПодключения);			
								Если Не Успешно Тогда
									Сообщить("Произошла ошибка! Не удалось передать место хранения автомобиля в CRM-систему!!!");
								КонецЕсли;
								ПередаватьСтатус = Ложь;
								Если ЗначениеЗаполнено(СтруктураАвтомобиля) Тогда
									Если Не ЗначениеЗаполнено(СтруктураАвтомобиля.internalStatusId) ИЛИ (СтруктураАвтомобиля.internalStatusId = 1 ИЛИ СтруктураАвтомобиля.internalStatusId = 6 ИЛИ СтруктураАвтомобиля.internalStatusId = 8) Тогда 
										ПередаватьСтатус = Истина;
									КонецЕсли;
								Иначе
									ПередаватьСтатус = Истина;
								КонецЕсли;
								Если ПередаватьСтатус = Истина Тогда
									ОписаниеСтатусаАвтомобиля = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьОписаниеСтатусаАвтомобиляНаСкладе(Источник.Ссылка,ID_Автомобиля,НастройкаПодключения);
									Успешно = СоздатьОбновитьСтатусАвтомобиляНаСкладеВCRM(СтрокаАвто.Автомобиль,ОписаниеСтатусаАвтомобиля,НастройкаПодключения);			
									Если Не Успешно Тогда
										Сообщить("Произошла ошибка! Не удалось передать статус автомобиля в CRM-систему!!!");
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;		
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Исключение
		Сообщить("Произошла ошибка! Не удалось передать документ в CRM-систему!!!");
	КонецПопытки;
	
КонецПроцедуры

Процедура Инфотек_ПриПроведенииДокументаОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Попытка
		////KamikadZe begin add 13.02.2024 22:39:36
		//Если обПраво("ВыгрузкаВ_СРМ_Автодилер") Тогда
		//	//KamikadZe end add
			НастройкаПодключения = ПолучитьНастройкуПодключенияПоДокументу(Источник); 		
			Если НастройкаПодключения = Неопределено Тогда
				Выборка = Справочники.Инфотек_НастройкиПодключения.Выбрать();
				Выборка.Следующий();
				НастройкаПодключения = Выборка.Ссылка;
			КонецЕсли;
			
			Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказНаАвтомобиль") Тогда	
				//Если Источник.ХозОперация = Справочники.ХозОперации.ЗаказНаАвтомобиль Или Источник.ХозОперация = Справочники.ХозОперации.ЗаказНаАвтомобильОтмена Тогда
				//KamikadZe begin add 05.03.2026 21:28:58
				Если Источник.ХозОперация = Справочники.ХозОперации.ЗаказНаАвтомобиль Или Источник.ХозОперация = Справочники.ХозОперации.ЗаказНаАвтомобильОтмена
					Или Источник.ХозОперация = Справочники.ХозОперации.ЗаказНаАвтомобильИзменение Тогда
				//KamikadZe end add	
					МассивРабочихЛистов = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьРабочиеЛистыПоДокументу(Источник.Ссылка);
					Для Индекс = 0 По МассивРабочихЛистов.Количество() - 1 Цикл
						Если ЗначениеЗаполнено(МассивРабочихЛистов[Индекс].Инфотек_Идентификатор_CRM) И МассивРабочихЛистов[Индекс].Инфотек_ОтключитьОбменCRM = Ложь Тогда
							Результат = ПередатьВCRMДоговор(Источник.Ссылка,НастройкаПодключения,МассивРабочихЛистов[Индекс].Инфотек_Идентификатор_CRM);
							Если Результат = Ложь Тогда
								Отказ = Истина;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;	 
				
			ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияАвтомобилей") Тогда
				МассивРабочихЛистов = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьРабочиеЛистыПоДокументу(Источник.Ссылка);
				Для Индекс = 0 По МассивРабочихЛистов.Количество() - 1 Цикл
					Если ЗначениеЗаполнено(МассивРабочихЛистов[Индекс].Инфотек_Идентификатор_CRM) И МассивРабочихЛистов[Индекс].Инфотек_ОтключитьОбменCRM = Ложь Тогда
						Для Каждого СтрокаАвто Из Источник.Автомобили Цикл		
							Результат = ПодтвердитьВыдачу(Источник.Ссылка,СтрокаАвто.Автомобиль,НастройкаПодключения,МассивРабочихЛистов[Индекс].Инфотек_Идентификатор_CRM);
							Если Результат = Ложь Тогда
								Отказ = Истина;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
				
			ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеАвтомобилей") ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.ВозвратПоставщикуАвтомобилей") 
				ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.КорректировкаПоступленияАвтомобилей") Тогда
				//МассивРабочихЛистов = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьРабочиеЛистыВыкупаПоДокументу(Источник.Ссылка);
				//Для Индекс = 0 По МассивРабочихЛистов.Количество() - 1 Цикл
					Если ЗначениеЗаполнено(Источник.Инфотек_Идентификатор_CRM) Тогда  
						//Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеАвтомобилей") Тогда 
							Для Каждого СтрокаАвто Из Источник.Автомобили Цикл	
								Если СтрокаАвто.АвтомобильБУ = Истина Тогда
									Результат = ПодтвердитьПоступлениеTradeIn(Источник.Ссылка, СтрокаАвто, НастройкаПодключения, Источник.Инфотек_Идентификатор_CRM);
									Если Результат = Ложь Тогда
										Отказ = Истина;
									КонецЕсли; 
								КонецЕсли;
							КонецЦикла;  
							
						//Иначе 
						//	Для Каждого СтрокаАвто Из Источник.Автомобили Цикл	
						//		Результат = ПодтвердитьПоступлениеTradeIn(Источник.Ссылка,СтрокаАвто,НастройкаПодключения,МассивРабочихЛистов[Индекс].Инфотек_Идентификатор_CRM);
						//		Если Результат = Ложь Тогда
						//			Отказ = Истина;
						//		КонецЕсли; 
						//	КонецЦикла;  
						//КонецЕсли;			
					КонецЕсли;
				//КонецЦикла;                  
				//////////////////////////////////////////////////
				Возврат;
				
				Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеАвтомобилей") Тогда
					Для Каждого СтрокаАвто Из Источник.Автомобили Цикл	  
						ID_Автомобиля = Инфотек_ОбщиеПроцедуры.ПолучитьИдентификаторСоответствияПоОбъекту(НастройкаПодключения,СтрокаАвто.Автомобиль,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.АвтомобильСклада);
						Если Не ЗначениеЗаполнено(ID_Автомобиля) Тогда
							НастройкаДляПоискаАвто = Справочники.Инфотек_НастройкиПодключения.Выбрать();
							Пока НастройкаДляПоискаАвто.Следующий() Цикл 
								Если НастройкаДляПоискаАвто.Ссылка.ПометкаУдаления = Ложь Тогда 
									ID_Автомобиля = ПолучитьИдентфикаторАвтомобиляНаСкладеПоVIN(СтрокаАвто.Автомобиль.VIN,НастройкаДляПоискаАвто.Ссылка);    
									Если ЗначениеЗаполнено(ID_Автомобиля) Тогда
										Прервать;
									КонецЕсли;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
						Если СтрокаАвто.АвтомобильБУ = Ложь Тогда
							Если ЗначениеЗаполнено(ID_Автомобиля) И Источник.СуммаДокумента > 0 Тогда
								Успешно = ОбновитьДатуПриходаАвтомобиляВCRM(Источник.Ссылка,СтрокаАвто.Автомобиль,ID_Автомобиля, НастройкаПодключения);			
								Если Не Успешно Тогда
									Сообщить("Произошла ошибка! Не удалось передать дату прихода автомобиля в CRM-систему!!!");
								КонецЕсли;
							КонецЕсли;
							
						Иначе  
							СтруктураВходнойЦены = Новый Структура();
							СтруктураВходнойЦены.Вставить("Цена",СтрокаАвто.СуммаВсего);  
							СтруктураВходнойЦены.Вставить("Идентификатор",ID_Автомобиля); 
							СоздатьОбновитьВходнуюЦенуАвтомобиляВCRM(СтрокаАвто.Автомобиль,СтруктураВходнойЦены,НастройкаПодключения);
						КонецЕсли;
					КонецЦикла; 
				КонецЕсли;	
			КонецЕсли;
		//КонецЕсли;
		
	Исключение
		Сообщить("Произошла ошибка! Не удалось передать документ в CRM-систему!!!");
	КонецПопытки;  
КонецПроцедуры

// Отдел сервиса

// Функция отправки запроса данных по ТО в CRM    
//                           
// Параметры:   
//  ДокЗаказНаряд              - ДокументСсылка - Ссылка на документ заказ наряд, заявка на ремонт.
//  ИдентификаторВидаРемонтаТО - Строка - Идентификатор ТО из CRM.
//  НастройкаПодключения       - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  Булево - Успешна/неудачна отправка запроса.  
// 
Функция ОбработатьДанныеПоТО(ДокЗаказНаряд,ИдентификаторВидаРемонтаТО,НастройкаПодключения) Экспорт
	
	ДанныеДляПередачи = Новый Структура();
	ИдентификаторАвтомобиля = ПолучитьИдентфикаторАвтомобиляПоVIN(ДокЗаказНаряд.Автомобиль.VIN,НастройкаПодключения);
	ИдентификаторТО = ПолучитьИдентфикаторТОПоАвтомобилю(ИдентификаторАвтомобиля,ИдентификаторВидаРемонтаТО,НастройкаПодключения);	
	ДанныеДляПередачи.Вставить("client_vehicle_id",ИдентификаторАвтомобиля);
	ДанныеДляПередачи.Вставить("ref_work_id",ИдентификаторВидаРемонтаТО);
	ДанныеДляПередачи.Вставить("seller_id",Инфотек_ОбщиеПроцедуры.ПолучитьИдентификаторСоответствияПоОбъекту(НастройкаПодключения,ДокЗаказНаряд.ПодразделениеКомпании,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Продавец));
	ДанныеДляПередачи.Вставить("autosalon_id",Инфотек_ОбщиеПроцедуры.ПолучитьИдентификаторСоответствияПоОбъекту(НастройкаПодключения,ДокЗаказНаряд.ПодразделениеКомпании,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Автосалон));
	ДанныеДляПередачи.Вставить("date",Формат(ДокЗаказНаряд.Дата,"ДФ=dd.MM.yyyy"));
	Пробег = "";
	Если ЗначениеЗаполнено(ДокЗаказНаряд.Пробег) Тогда
		Пробег = ДокЗаказНаряд.Пробег;
	Иначе	
		ВыборкаПробег = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьИнфоПоАвто(ДокЗаказНаряд.Автомобиль,Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
		Если ВыборкаПробег.Следующий() Тогда
			Пробег = ВыборкаПробег.Значение;
		КонецЕсли;
	КонецЕсли;
	ДанныеДляПередачи.Вставить("mileage", Пробег);	
	
	ТелоЗапроса = Инфотек_JSON.мЗаписатьJSON(ДанныеДляПередачи,Истина);
	Если ЗначениеЗаполнено(ИдентификаторТО) Тогда
		Запрос = "/yii/api/vehicleMaintenance/" + Формат(ИдентификаторТО,"ЧГ=0");
		Ответ = Инфотек_Запросы.PUTЗапрос(Запрос,НастройкаПодключения,ТелоЗапроса);
	Иначе
		Запрос = "/yii/api/vehicleMaintenance";
		Ответ = Инфотек_Запросы.POSTЗапрос(Запрос,НастройкаПодключения,ТелоЗапроса);
	КонецЕсли;
	
	Результат = Ложь;
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
	
КонецФункции	

// Функция отправки запроса заказ наряда в CRM    
//                           
// Параметры:   
//  ЗаказНаряд           - ДокументСсылка - Ссылка на документ заказ наряд, заявка на ремонт.
//  Описание             - Структура - Структура описания заказ наряда.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  Булево - Успешна/неудачна отправка запроса.  
// 
Функция СоздатьОбновитьЗаказНарядВCRM(ЗаказНаряд,Описание,НастройкаПодключения)  Экспорт
	
	Идентификатор = Описание.Id;
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Идентификатор = ПолучитьИдентфикаторЗаказНарядаПоКоду(Описание.Id,НастройкаПодключения);		
		Если ЗначениеЗаполнено(Идентификатор) Тогда
			Инфотек_ОбщиеПроцедуры.ЗаписатьСоответствиеОбъектов(НастройкаПодключения,ЗаказНаряд.Ссылка,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.ЗаказНаряд,Идентификатор);
		КонецЕсли;
	КонецЕсли;
	
	ДанныеДляПередачи = Новый Структура;
	
	//POST /Package
	
	Запрос = "/yii/api/Package";
	ТелоЗапроса = Инфотек_JSON.мЗаписатьJSON(Описание,Истина);
	ДанныеДляПередачи.Вставить("body", ТелоЗапроса);
	ТелоЗапроса = Инфотек_JSON.мЗаписатьJSON(ДанныеДляПередачи,Истина);
	Ответ = Инфотек_Запросы.POSTЗапрос(Запрос,НастройкаПодключения,ТелоЗапроса);
	Результат = Ложь;
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		Результат = Истина;
		Если НЕ ЗначениеЗаполнено(Идентификатор) Тогда
			СтруктураРезультата = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);		
			Инфотек_ОбщиеПроцедуры.ЗаписатьСоответствиеОбъектов(НастройкаПодключения,ЗаказНаряд.Ссылка,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.ЗаказНаряд,ИдентификаторВСтроку(СтруктураРезультата.result.id));
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция отправки запроса завершения обращения в CRM    
//                           
// Параметры:   
//  ДокументЗаявка       - ДокументСсылка.ЗаявкаНаРемонт - Ссылка на документ заявка на ремонт.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  Булево - Успешна/неудачна отправка запроса.  
// 
Функция ЗавершитьОбращение(ДокументЗаявка,НастройкаПодключения) Экспорт	
	
	ДанныеДляПередачи = Новый Структура();
	ДанныеДляПередачи.Вставить("comment","Заявка сохранена");	
	ТелоЗапроса = Инфотек_JSON.мЗаписатьJSON(ДанныеДляПередачи,Истина);
	Запрос = "/yii/api/preparedServiceStage/finish?case_id=" + ДокументЗаявка.Инфотек_ИдентификаторОбращения + "&type=30";
	Ответ = Инфотек_Запросы.PUTЗапрос(Запрос,НастройкаПодключения,ТелоЗапроса);
	Результат = Ложь;
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		Результат = Истина;  
		МенеджерЗаписи = РегистрыСведений.Инфотек_ОбращенияCRM.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Идентификатор = ДокументЗаявка.Инфотек_ИдентификаторОбращения;
		МенеджерЗаписи.НастройкаПодключения = НастройкаПодключения; 
		МенеджерЗаписи.Статус = Перечисления.Инфотек_СтатусыОбращений.ВРаботе;
		МенеджерЗаписи.Прочитать();  
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Контрагент = ДокументЗаявка.Заказчик;
			МенеджерЗаписи.Автомобиль = ДокументЗаявка.Автомобиль;	  
			МенеджерЗаписи.Статус = Перечисления.Инфотек_СтатусыОбращений.Завершён;
			МенеджерЗаписи.Записать();
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция отправки запроса завершения обращения отменой в CRM из заявки на ремонт 1С    
//                           
// Параметры:   
//  ДокументЗаявка       - ДокументСсылка.ЗаявкаНаРемонт - Ссылка на документ заявка на ремонт.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  Булево - Успешна/неудачна отправка запроса.  
// 
Функция ЗавершитьОбращениеОтменойИзДокумента(ДокументЗаявка,НастройкаПодключения) Экспорт	
	
	ДанныеДляПередачи = Новый Структура();   
	Если ЗначениеЗаполнено(ДокументЗаявка.ПричинаОтказа) Тогда   
		ДанныеДляПередачи.Вставить("comment",ДокументЗаявка.ПричинаОтказа.Наименование);
	Иначе
		ДанныеДляПередачи.Вставить("comment","Заявка отменена");	
	КонецЕсли;
	ДанныеДляПередачи.Вставить("result_id","1");
	
	ТелоЗапроса = Инфотек_JSON.мЗаписатьJSON(ДанныеДляПередачи,Истина);
	Запрос = "/yii/api/PreparedServiceCase/reject?id=" + ДокументЗаявка.Инфотек_ИдентификаторОбращения;
	Ответ = Инфотек_Запросы.PUTЗапрос(Запрос,НастройкаПодключения,ТелоЗапроса);
	Результат = Ложь;
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		Результат = Истина;  
		МенеджерЗаписи = РегистрыСведений.Инфотек_ОбращенияCRM.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Идентификатор = ДокументЗаявка.Инфотек_ИдентификаторОбращения;
		МенеджерЗаписи.НастройкаПодключения = НастройкаПодключения; 
		МенеджерЗаписи.Статус = Перечисления.Инфотек_СтатусыОбращений.ВОтказе;
		МенеджерЗаписи.Прочитать();  
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Контрагент = ДокументЗаявка.Заказчик;
			МенеджерЗаписи.Автомобиль = ДокументЗаявка.Автомобиль;	  
			МенеджерЗаписи.Статус = Перечисления.Инфотек_СтатусыОбращений.Завершён;
			МенеджерЗаписи.Записать();
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция отправки запроса взятия обращения в работу в CRM    
//                           
// Параметры:   
//  ОбращениеCRM         - РегистрСведений.Инфотек_ОбращенияCRM - Менеджер записи.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  Булево - Успешна/неудачна отправка запроса.  
// 
Функция ВзятьОбращениеВРаботу(ОбращениеCRM,НастройкаПодключения) Экспорт	
	
	ДанныеДляПередачи = Новый Структура();
	ТелоЗапроса = Инфотек_JSON.мЗаписатьJSON(ДанныеДляПередачи,Истина);
	Запрос = "/yii/api/PreparedServiceCase/activate?id=" + ОбращениеCRM.Идентификатор;
	Ответ = Инфотек_Запросы.POSTЗапрос(Запрос,НастройкаПодключения,ТелоЗапроса);
	Результат = Ложь;
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция отправки запроса возвращения обращения в работу в CRM    
//                           
// Параметры:   
//  ОбращениеCRM         - РегистрСведений.Инфотек_ОбращенияCRM - Менеджер записи.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  Булево - Успешна/неудачна отправка запроса.  
// 
Функция ВозвращениеОбращенияВРаботу(ОбращениеCRM,НастройкаПодключения) Экспорт	
	
	ДанныеДляПередачи = Новый Структура();
	ТелоЗапроса = Инфотек_JSON.мЗаписатьJSON(ДанныеДляПередачи,Истина);
	Запрос = "/yii/api/PreparedServiceCase/reactivate?id=" + ОбращениеCRM.Идентификатор;
	Ответ = Инфотек_Запросы.POSTЗапрос(Запрос,НастройкаПодключения,ТелоЗапроса);
	Результат = Ложь;
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция отправки запроса завершения обращения консультацией в CRM    
//                           
// Параметры:   
//  ОбращениеCRM         - РегистрСведений.Инфотек_ОбращенияCRM - Менеджер записи.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  Булево - Успешна/неудачна отправка запроса.  
// 
Функция ЗавершитьОбращениеКонсультацией(ОбращениеCRM,НастройкаПодключения) Экспорт	
	
	ДанныеДляПередачи = Новый Структура();
	ДанныеДляПередачи.Вставить("comment",ОбращениеCRM.Комментарий);	
	ТелоЗапроса = Инфотек_JSON.мЗаписатьJSON(ДанныеДляПередачи,Истина);
	Запрос = "/yii/api/preparedServiceStage/finish?case_id=" + ОбращениеCRM.Идентификатор + "&type=21";
	Ответ = Инфотек_Запросы.PUTЗапрос(Запрос,НастройкаПодключения,ТелоЗапроса);
	Результат = Ложь;
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция отправки запроса завершения обращения отменой в CRM    
//                           
// Параметры:   
//  ОбращениеCRM         - РегистрСведений.Инфотек_ОбращенияCRM - Менеджер записи.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  Булево - Успешна/неудачна отправка запроса.  
// 
Функция ЗавершитьОбращениеОтменой(ОбращениеCRM,НастройкаПодключения) Экспорт	
	
	ДанныеДляПередачи = Новый Структура();
	ДанныеДляПередачи.Вставить("comment",ОбращениеCRM.Комментарий);
	ДанныеДляПередачи.Вставить("result_id","1");
	
	ТелоЗапроса = Инфотек_JSON.мЗаписатьJSON(ДанныеДляПередачи,Истина);
	Запрос = "/yii/api/PreparedServiceCase/reject?id=" + ОбращениеCRM.Идентификатор;
	Ответ = Инфотек_Запросы.PUTЗапрос(Запрос,НастройкаПодключения,ТелоЗапроса);
	Результат = Ложь;
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Склад автомобилей

// Функция отправки запроса предачи данных по дополнительному оборудованию автомобиля на складе в CRM    
//                           
// Параметры:   
//  Описание             - Структура - Структура дополнительного оборудования.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  Булево - Успешна/неудачна отправка запроса.  
// 
Функция СоздатьОбновитьДополнительноеОборудованиеАвтомобиляВCRM(Описание,НастройкаПодключения)  Экспорт
	
	Идентификатор = Описание.Идентификатор;
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Идентификатор = ПолучитьИдентфикаторАвтомобиляНаСкладеПоVIN(Описание.Автомобиль.VIN,НастройкаПодключения);		
		Если ЗначениеЗаполнено(Идентификатор) Тогда
			Инфотек_ОбщиеПроцедуры.ЗаписатьСоответствиеОбъектов(НастройкаПодключения,Описание.Автомобиль,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.АвтомобильСклада,Идентификатор);
		КонецЕсли;
	ИначеЕсли Не ЗначениеЗаполнено(Инфотек_ОбщиеПроцедуры.ПолучитьИдентификаторСоответствияПоОбъекту(НастройкаПодключения,Описание.Автомобиль,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.АвтомобильСклада)) Тогда
		Инфотек_ОбщиеПроцедуры.ЗаписатьСоответствиеОбъектов(НастройкаПодключения,Описание.Автомобиль,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.АвтомобильСклада,Идентификатор);	
	КонецЕсли;
	
	СтруктураПередачи = СформироватьСтруктуруДополнительноеОборудованиеАвтомобиляПоОписанию(Описание,НастройкаПодключения);
	Результат = Ложь;
	
	//PUT /warehouseVehicle/updateFromRef
	
	Запрос = "/yii/api/warehouseVehicle/updateFromRef";
	ТелоЗапроса = Инфотек_JSON.мЗаписатьJSON(СтруктураПередачи,Истина);
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		Запрос = Запрос + "/" + Формат(Идентификатор,"ЧГ=0");
		Ответ = Инфотек_Запросы.PUTЗапрос(Запрос,НастройкаПодключения,ТелоЗапроса);
	Иначе
		Возврат Результат;
	КонецЕсли;	
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		Результат = Истина;
		Если Не ЗначениеЗаполнено(Идентификатор) Тогда
			СтруктураРезультата = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);		
			Инфотек_ОбщиеПроцедуры.ЗаписатьСоответствиеОбъектов(НастройкаПодключения,Описание.Автомобиль,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.АвтомобильСклада,ИдентификаторВСтроку(СтруктураРезультата.result.id));
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция отправки запроса обновления даты прихода автомобиля на складе в CRM    
//                           
// Параметры:   
//  Поступление          - ДокументСсылка.ПоступлениеАвтомобилей - Ссылка на документ поступление/возврат автомобиля. 
//  Автомобиль           - СправочникСсылка.Автомобили - Ссылка на автомобиль поступления
//  ID_Автомобиля        - Строка - Идентификатор автомобиля на складе.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  Булево - Успешна/неудачна отправка запроса.  
// 
Функция ОбновитьДатуПриходаАвтомобиляВCRM(Поступление,Автомобиль,ID_Автомобиля,НастройкаПодключения)  Экспорт
	
	СтруктураПередачи = Новый Структура;
	
	//WarehouseVehicleRef  {
	
	//inStock (integer): В наличии на складе
	СтруктураПередачи.Вставить("inStock",1);
	
	//dateReceived (string): Дата прихода на склад
	СтруктураПередачи.Вставить("dateReceived", Формат(Поступление.Дата,"ДФ=dd.MM.yyyy"));
	
	Результат = Ложь;
	
	//PUT /warehouseVehicle/updateFromRef
	
	Запрос = "/yii/api/warehouseVehicle/updateFromRef";
	ТелоЗапроса = Инфотек_JSON.мЗаписатьJSON(СтруктураПередачи,Истина);
	
	Если ЗначениеЗаполнено(ID_Автомобиля) Тогда
		Запрос = Запрос + "/" + Формат(ID_Автомобиля,"ЧГ=0");
		Ответ = Инфотек_Запросы.PUTЗапрос(Запрос,НастройкаПодключения,ТелоЗапроса);
	Иначе
		Возврат Результат;
	КонецЕсли;	
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		Результат = Истина;
		СтруктураРезультата = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);		
		Инфотек_ОбщиеПроцедуры.ЗаписатьСоответствиеОбъектов(НастройкаПодключения,Автомобиль,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.АвтомобильСклада,ИдентификаторВСтроку(СтруктураРезультата.result.id));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция отправки запроса обновления автоаслона автомобиля на складе в CRM    
//                           
// Параметры:   
//  ID_Автосалона        - Строка - Идентификатор автосалона. 
//  ID_Автомобиля        - Строка - Идентификатор автомобиля на складе.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  Булево - Успешна/неудачна отправка запроса.  
// 
Функция ОбновитьАвтосалонАвтомобиляВCRM(ID_Автосалона,Автомобиль,ID_Автомобиля,НастройкаПодключения)  Экспорт
	
	СтруктураПередачи = Новый Структура;
	
	//WarehouseVehicleRef  {
	
	//autosalonId (string): ID автосалона
	СтруктураПередачи.Вставить("autosalonId",ID_Автосалона);
	
	Результат = Ложь;
	
	//PUT /warehouseVehicle/updateFromRef
	
	Запрос = "/yii/api/warehouseVehicle/updateFromRef";
	ТелоЗапроса = Инфотек_JSON.мЗаписатьJSON(СтруктураПередачи,Истина);
	
	Если ЗначениеЗаполнено(ID_Автомобиля) Тогда
		Запрос = Запрос + "/" + Формат(ID_Автомобиля,"ЧГ=0");
		Ответ = Инфотек_Запросы.PUTЗапрос(Запрос,НастройкаПодключения,ТелоЗапроса);
	Иначе
		Возврат Результат;
	КонецЕсли;	
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		Результат = Истина;
		СтруктураРезультата = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);		
		Инфотек_ОбщиеПроцедуры.ЗаписатьСоответствиеОбъектов(НастройкаПодключения,Автомобиль,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.АвтомобильСклада,ИдентификаторВСтроку(СтруктураРезультата.result.id));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция формирования структуры запроса предачи данных по дополнительному оборудованию автомобиля на складе в CRM    
//                           
// Параметры:   
//  Описание             - Структура - Структура дополнительного оборудования.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  Структура - запроса.  
// 
Функция СформироватьСтруктуруДополнительноеОборудованиеАвтомобиляПоОписанию(Описание,НастройкаПодключения)
	
	СтруктураПередачи = Новый Структура;
	
	//WarehouseVehicleRef  {
	
	//equipmentText (string): Список доп. оборудования
	СтруктураПередачи.Вставить("equipmentText",Описание.СтрокаДополнительногоОборудования);
	
	//equipmentPrice (integer): Цена реализации доп. оборудования
	СтруктураПередачи.Вставить("equipmentPrice",Описание.СуммаДополнительногоОборудования);
	
	Если Описание.Свойство("СебестоимостьДополнительногоОборудования") Тогда
		//equipmentInputPrice (integer): Входная цена доп. оборудования
		СтруктураПередачи.Вставить("equipmentInputPrice ",Описание.СебестоимостьДополнительногоОборудования);
	КонецЕсли;
	
	Возврат СтруктураПередачи;
	
КонецФункции

// Функция отправки запроса предачи данных по изменению входной цены автомобиля на складе в CRM    
//                           
// Параметры:   
//  Автомобиль           - СправочникСсылка.Автомобили - Ссылка на автомобиль.
//  Описание             - Структура - Структура цены.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  Булево - Успешна/неудачна отправка запроса.  
// 
Функция СоздатьОбновитьВходнуюЦенуАвтомобиляВCRM(Автомобиль,Описание,НастройкаПодключения)  Экспорт
	
	Идентификатор = Описание.Идентификатор;
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		НастройкаДляПоискаАвто = Справочники.Инфотек_НастройкиПодключения.Выбрать();
		Пока НастройкаДляПоискаАвто.Следующий() Цикл 
			Если НастройкаДляПоискаАвто.Ссылка.ПометкаУдаления = Ложь Тогда 
				Идентификатор = ПолучитьИдентфикаторАвтомобиляНаСкладеПоVIN(Автомобиль.VIN,НастройкаДляПоискаАвто.Ссылка);    
				Если ЗначениеЗаполнено(Идентификатор) Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если ЗначениеЗаполнено(Идентификатор) Тогда
			Инфотек_ОбщиеПроцедуры.ЗаписатьСоответствиеОбъектов(НастройкаПодключения,Автомобиль,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.АвтомобильСклада,Идентификатор);
		КонецЕсли;
	ИначеЕсли Не ЗначениеЗаполнено(Инфотек_ОбщиеПроцедуры.ПолучитьИдентификаторСоответствияПоОбъекту(НастройкаПодключения,Автомобиль,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.АвтомобильСклада)) Тогда
		Инфотек_ОбщиеПроцедуры.ЗаписатьСоответствиеОбъектов(НастройкаПодключения,Автомобиль,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.АвтомобильСклада,Идентификатор);	
	КонецЕсли;
	
	СтруктураПередачи = СформироватьСтруктуруВходнойЦеныАвтомобиляПоОписанию(Описание,НастройкаПодключения);
	Результат = Ложь;
	
	//PUT /warehouseVehicle/updateFromRef
	
	Запрос = "/yii/api/warehouseVehicle/updateFromRef";
	ТелоЗапроса = Инфотек_JSON.мЗаписатьJSON(СтруктураПередачи,Истина);
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		Запрос = Запрос+"/"+Формат(Идентификатор,"ЧГ=0");
		Ответ = Инфотек_Запросы.PUTЗапрос(Запрос,НастройкаПодключения,ТелоЗапроса);
	Иначе
		Возврат Результат;
	КонецЕсли;	
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		Результат = Истина;
		Если Не ЗначениеЗаполнено(Идентификатор) Тогда
			СтруктураРезультата = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);		
			Инфотек_ОбщиеПроцедуры.ЗаписатьСоответствиеОбъектов(НастройкаПодключения,Автомобиль,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.АвтомобильСклада,ИдентификаторВСтроку(СтруктураРезультата.result.id));
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция формирования структуры запроса предачи данных по изменению входной цены автомобиля на складе в CRM    
//                           
// Параметры:   
//  Описание             - Структура - Структура цены.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  Структура - запроса.  
// 
Функция СформироватьСтруктуруВходнойЦеныАвтомобиляПоОписанию(Описание,НастройкаПодключения)
	
	СтруктураПередачи = Новый Структура;
	
	//WarehouseVehicleRef  {
	
	//invoicePrice (string): Цена входная
	СтруктураПередачи.Вставить("invoicePrice",Описание.Цена);
	
	Возврат СтруктураПередачи;
	
КонецФункции

// Функция отправки запроса предачи автомобиля на склад в CRM    
//                           
// Параметры:   
//  Автомобиль           - СправочникСсылка.Автомобили - Ссылка на автомобиль.
//  Описание             - Структура - Структура реквизитов автомобиля.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  Булево - Успешна/неудачна отправка запроса.  
// 
Функция СоздатьОбновитьАвтомобильНаСкладеВCRM(Автомобиль,Описание,НастройкаПодключения)  Экспорт
	
	Идентификатор = Описание.Идентификатор;
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Идентификатор = ПолучитьИдентфикаторАвтомобиляНаСкладеПоVIN(Автомобиль.VIN,НастройкаПодключения);		
		Если ЗначениеЗаполнено(Идентификатор) Тогда
			Инфотек_ОбщиеПроцедуры.ЗаписатьСоответствиеОбъектов(НастройкаПодключения,Автомобиль,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.АвтомобильСклада,Идентификатор);
		КонецЕсли;
	ИначеЕсли Не ЗначениеЗаполнено(Инфотек_ОбщиеПроцедуры.ПолучитьИдентификаторСоответствияПоОбъекту(НастройкаПодключения,Автомобиль,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.АвтомобильСклада)) Тогда
		Инфотек_ОбщиеПроцедуры.ЗаписатьСоответствиеОбъектов(НастройкаПодключения,Автомобиль,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.АвтомобильСклада,Идентификатор);	
	КонецЕсли;
	
	СтруктураПередачи = СформироватьСтруктуруАвтомобиляНаСкладеПоОписанию(Описание,НастройкаПодключения);
	Результат = Ложь;
	
	ТелоЗапроса = Инфотек_JSON.мЗаписатьJSON(СтруктураПередачи,Истина);
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		//PUT /warehouseVehicle/updateFromRef
		Запрос = "/yii/api/warehouseVehicle/updateFromRef";
		Запрос = Запрос+"/"+Формат(Идентификатор,"ЧГ=0");
		Ответ = Инфотек_Запросы.PUTЗапрос(Запрос,НастройкаПодключения,ТелоЗапроса);
	Иначе
		//POST /warehouseVehicle/createFromRef
		Запрос = "/yii/api/warehouseVehicle/createFromRef";		
		Ответ = Инфотек_Запросы.POSTЗапрос(Запрос,НастройкаПодключения,ТелоЗапроса);
	КонецЕсли;	
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		Результат = Истина;
		Если Не ЗначениеЗаполнено(Идентификатор) Тогда
			СтруктураРезультата = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);		
			Инфотек_ОбщиеПроцедуры.ЗаписатьСоответствиеОбъектов(НастройкаПодключения,Автомобиль,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.АвтомобильСклада,ИдентификаторВСтроку(СтруктураРезультата.result.id));
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция формирования структуры запроса предачи данных по изменению цены автомобиля на складе в CRM    
//                           
// Параметры:   
//  Описание             - Структура - Структура цены.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  Структура - запроса.  
// 
Функция СформироватьСтруктуруАвтомобиляНаСкладеПоОписанию(Описание,НастройкаПодключения)
	
	СтруктураПередачи = Новый Структура;
	
	//WarehouseVehicleRef  {
	
	//vin (string): VIN
	СтруктураПередачи.Вставить("vin",Описание.VIN);
	
	//productionYear (string): Год выпуска
	СтруктураПередачи.Вставить("productionYear",Описание.ГодВыпуска);
	
	//modelYearCode (string): Код модельного года
	КодМодельногоГода = Строка(Описание.ГодВыпуска);
	КодМодельногоГода = СтрЗаменить(Описание.ГодВыпуска,Символы.НПП,"");	
	СтруктураПередачи.Вставить("modelYearCode",КодМодельногоГода);
	
	//brandId (integer): ID бренда
	СтруктураПередачи.Вставить("brandId",Описание.ИдентификаторБренда);
	
	//modelId (integer): ID модели
	СтруктураПередачи.Вставить("modelId",Описание.ИдентификаторМодели);
	
	//equipmentId (integer): ID комплектации
	СтруктураПередачи.Вставить("equipmentId",Описание.ИдентификаторКомплектации);
	
	//modificationId (integer): ID модификайии
	СтруктураПередачи.Вставить("modificationId",Описание.ИдентификаторМодификации);
	
	//generationId (integer): ID поколения
	СтруктураПередачи.Вставить("generationId",Описание.ИдентификаторПоколения);
	
	//serieId (integer): ID серии
	СтруктураПередачи.Вставить("serieId",Описание.ИдентификаторСерии);
	
	//colorCode (string): Код цвета
	СтруктураПередачи.Вставить("colorCode",Описание.КодЦвета);
	
	//trimCode (string): Код отделки
	СтруктураПередачи.Вставить("trimCode",Описание.КодОтделки);
	
	//code (string): Код автомобиля
	СтруктураПередачи.Вставить("code",Описание.КодАвтомобиля);
	
	//autosalonId (string): ID автосалона
	Если Описание.Свойство("ИдентификаторСалона") Тогда
		СтруктураПередачи.Вставить("autosalonId", Описание.ИдентификаторСалона);
	Иначе
		СтруктураПередачи.Вставить("autosalonId", Инфотек_ОбщиеПроцедуры.ПолучитьИдентификаторСоответствияПоОбъекту(НастройкаПодключения,НастройкаПодключения,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Автосалон));
	КонецЕсли;	
	
	//dateReceived (string): Дата прихода на склад
	СтруктураПередачи.Вставить("dateReceived",Описание.ДатаПоступления);
	
	Если Описание.Свойство("ВходящаяЦена") Тогда		
		//invoicePrice (string): Входящая стоимость
		СтруктураПередачи.Вставить("invoicePrice",Описание.ВходящаяЦена);
	КонецЕсли;
	
	//fixedPrice (string): Фиксированная стоимость
	СтруктураПередачи.Вставить("fixedPrice",Описание.Цена);
	
	Если Описание.Свойство("ДатаВыдачиПТС") Тогда	
		//ptsIssuedAt (string): Дата выдачи ПТС
		СтруктураПередачи.Вставить("ptsIssuedAt",Описание.ДатаВыдачиПТС);
	КонецЕсли;
	Если Описание.Свойство("НомерПТС") Тогда	
		//ptsNumber (string): номер ПТС
		СтруктураПередачи.Вставить("ptsNumber",Описание.НомерПТС);
	КонецЕсли;
	Если Описание.Свойство("КемВыданПТС") Тогда	
		//ptsIssuedBy (string): Кем выдан ПТС
		СтруктураПередачи.Вставить("ptsIssuedBy",Описание.КемВыданПТС);
	КонецЕсли;
	
	//onSaleAt (string): Дата вывода авто в продажу в формате dd.MM.yyyy
	СтруктураПередачи.Вставить("onSaleAt",Описание.ДатаПоступления);
	
	//engineNumber (string): Номер двигателя
	СтруктураПередачи.Вставить("engineNumber",Описание.НомерДвигателя);
	
	//bodyNumber (string): Номер кузова
	СтруктураПередачи.Вставить("bodyNumber",Описание.НомерКузова);
	
	//comment (string): Примечание
	СтруктураПередачи.Вставить("comment",Описание.Комментарий);
	
	//mileage (integer): Пробег
	СтруктураПередачи.Вставить("mileage",Описание.Пробег);
	
	//inStock (integer): Признак "В наличии"
	СтруктураПередачи.Вставить("inStock",Описание.ПризнакВНаличии);
	
	Если Описание.Свойство("СтрокаДополнительногоОборудования") Тогда			
		//equipmentText (string): Список доп. оборудования
		СтруктураПередачи.Вставить("equipmentText",Описание.СтрокаДополнительногоОборудования);
	КонецЕсли;
	
	Если Описание.Свойство("СуммаДополнительногоОборудования") Тогда			
		//equipmentPrice (integer): Цена реализации доп. оборудования
		СтруктураПередачи.Вставить("equipmentPrice",Описание.СуммаДополнительногоОборудования);
	КонецЕсли;
	
	Если Описание.Свойство("ТрейдИн") Тогда			
		//isTradeIn (integer): Trade-in
		Если Описание.ТрейдИн = Истина Тогда
			СтруктураПередачи.Вставить("isTradeIn",1);
		Иначе
			СтруктураПередачи.Вставить("isTradeIn",0);
		КонецЕсли;	
	КонецЕсли;
	
	//bodyColor (string): Цвет кузова
	СтруктураПередачи.Вставить("bodyColor",Описание.Цвет);
	
	Возврат СтруктураПередачи;
	
КонецФункции

// Функция отправки запроса предачи данных по изменению места хранения автомобиля на складе в CRM    
//                           
// Параметры:   
//  Автомобиль           - СправочникСсылка.Автомобили - Ссылка на автомобиль.
//  Описание             - Структура - Структура места хранения.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  Булево - Успешна/неудачна отправка запроса.  
// 
Функция СоздатьОбновитьМестоХраненияНаСкладеВCRM(Автомобиль,Описание,НастройкаПодключения)  Экспорт
	
	Идентификатор = Описание.Идентификатор;
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Идентификатор = ПолучитьИдентфикаторАвтомобиляНаСкладеПоVIN(Автомобиль.VIN,НастройкаПодключения);		
		Если ЗначениеЗаполнено(Идентификатор) Тогда
			Инфотек_ОбщиеПроцедуры.ЗаписатьСоответствиеОбъектов(НастройкаПодключения,Автомобиль,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.АвтомобильСклада,Идентификатор);
		КонецЕсли;
	ИначеЕсли Не ЗначениеЗаполнено(Инфотек_ОбщиеПроцедуры.ПолучитьИдентификаторСоответствияПоОбъекту(НастройкаПодключения,Автомобиль,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.АвтомобильСклада)) Тогда
		Инфотек_ОбщиеПроцедуры.ЗаписатьСоответствиеОбъектов(НастройкаПодключения,Автомобиль,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.АвтомобильСклада,Идентификатор);	
	КонецЕсли;
	
	СтруктураПередачи = СформироватьСтруктуруМестаХраненияПоОписанию(Описание,НастройкаПодключения);
	Результат = Ложь;
	
	//PUT /warehouseVehicle/saveStoragePlace
	
	Запрос = "/yii/api/warehouseVehicle/saveStoragePlace";
	ТелоЗапроса = Инфотек_JSON.мЗаписатьJSON(СтруктураПередачи,Истина);
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		Запрос = Запрос+"/"+Формат(Идентификатор,"ЧГ=0");
		Ответ = Инфотек_Запросы.PUTЗапрос(Запрос,НастройкаПодключения,ТелоЗапроса);
	Иначе
		Возврат Результат;
	КонецЕсли;	
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		Результат = Истина;
		Если Не ЗначениеЗаполнено(Идентификатор) Тогда
			СтруктураРезультата = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);		
			Инфотек_ОбщиеПроцедуры.ЗаписатьСоответствиеОбъектов(НастройкаПодключения,Автомобиль,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.АвтомобильСклада,ИдентификаторВСтроку(СтруктураРезультата.result.id));
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция формирования структуры запроса предачи данных по изменению места хранения на складе в CRM    
//                           
// Параметры:   
//  Описание             - Структура - Структура места хранения.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  Структура - запроса.  
// 
Функция СформироватьСтруктуруМестаХраненияПоОписанию(Описание,НастройкаПодключения)
	
	СтруктураПередачи = Новый Структура;
	
	//WarehouseVehicleStoragePlace   {
	
	//placeId (integer): ID места хранения
	СтруктураПередачи.Вставить("placeId",Описание.ИдентификаторСклада);
	
	//date (integer): Дата в формате dd.MM.yyyy
	СтруктураПередачи.Вставить("date",Описание.Дата);
	
	Возврат СтруктураПередачи;
	
КонецФункции

// Функция отправки запроса предачи данных по изменению статуса автомобиля на складе в CRM    
//                           
// Параметры:   
//  Автомобиль           - СправочникСсылка.Автомобили - Ссылка на автомобиль.
//  Описание             - Структура - Структура статуса.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  Булево - Успешна/неудачна отправка запроса.  
// 
Функция СоздатьОбновитьСтатусАвтомобиляНаСкладеВCRM(Автомобиль,Описание,НастройкаПодключения)  Экспорт
	
	Идентификатор = Описание.Идентификатор;
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Идентификатор = ПолучитьИдентфикаторАвтомобиляНаСкладеПоVIN(Автомобиль.VIN,НастройкаПодключения);		
		Если ЗначениеЗаполнено(Идентификатор) Тогда
			Инфотек_ОбщиеПроцедуры.ЗаписатьСоответствиеОбъектов(НастройкаПодключения,Автомобиль,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.АвтомобильСклада,Идентификатор);
		КонецЕсли;
	ИначеЕсли Не ЗначениеЗаполнено(Инфотек_ОбщиеПроцедуры.ПолучитьИдентификаторСоответствияПоОбъекту(НастройкаПодключения,Автомобиль,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.АвтомобильСклада)) Тогда
		Инфотек_ОбщиеПроцедуры.ЗаписатьСоответствиеОбъектов(НастройкаПодключения,Автомобиль,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.АвтомобильСклада,Идентификатор);	
	КонецЕсли;
	
	СтруктураПередачи = СформироватьСтруктуруСтатусаПоОписанию(Описание,НастройкаПодключения);
	Результат = Ложь;
	
	//PUT /warehouseVehicle/saveStoragePlace
	
	Запрос = "/yii/api/warehouseVehicle/saveInternalStatus";
	ТелоЗапроса = Инфотек_JSON.мЗаписатьJSON(СтруктураПередачи,Истина);
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		Запрос = Запрос+"/"+Формат(Идентификатор,"ЧГ=0");
		Ответ = Инфотек_Запросы.PUTЗапрос(Запрос,НастройкаПодключения,ТелоЗапроса);
	Иначе
		Возврат Результат;
	КонецЕсли;	
	
	Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		Результат = Истина;
		Если Не ЗначениеЗаполнено(Идентификатор) Тогда
			СтруктураРезультата = Инфотек_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);		
			Инфотек_ОбщиеПроцедуры.ЗаписатьСоответствиеОбъектов(НастройкаПодключения,Автомобиль,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.АвтомобильСклада,ИдентификаторВСтроку(СтруктураРезультата.result.id));
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция формирования структуры статуса автомобиля на складе в CRM    
//                           
// Параметры:   
//  Описание             - Структура - Структура статуса.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  Структура - запроса.  
// 
Функция СформироватьСтруктуруСтатусаПоОписанию(Описание,НастройкаПодключения)
	
	СтруктураПередачи = Новый Структура;
	
	//WarehouseVehicleStoragePlace   {
	
	//statusId (integer): ID внутреннего статуса
	СтруктураПередачи.Вставить("statusId",Описание.Статус);
	
	//date (integer): Дата в формате dd.MM.yyyy
	СтруктураПередачи.Вставить("date",Описание.Дата);
	
	Возврат СтруктураПередачи;
	
КонецФункции

// Отдел продаж

// Функция отправки запроса завершения выдачи по рабочему листу в CRM    
//                           
// Параметры:   
//  Реализация           - ДокументСсылка.РеализацияАвтомобилей - Ссылка на документ реализация автомобиля.  
//  Автомобиль           - СправочникСсылка.Автомобили - Ссылка на автомобиль реализации
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//  id_CRM               - Строка - Идентификатор рабочего листа.
//
// Возвращаемое значение:
//  Булево - Успешна/неудачна отправка запроса.  
// 
Функция ПодтвердитьВыдачу(Реализация, Автомобиль, НастройкаПодключения, id_CRM) Экспорт
	Результат = Ложь;
	ЭтапыРЛ = ПолучитьМассивСобытийПоИдентификаторуРабочегоЛиста(id_CRM,НастройкаПодключения);  
	Если ЭтапыРЛ.Количество() = 0 Тогда
		ВыборкаНастроекПодключения = Справочники.Инфотек_НастройкиПодключения.Выбрать();
		Пока ВыборкаНастроекПодключения.Следующий() Цикл 
			Если ВыборкаНастроекПодключения.ПометкаУдаления = Ложь Тогда 
				ЭтапыРЛ = ПолучитьМассивСобытийПоИдентификаторуРабочегоЛиста(id_CRM,ВыборкаНастроекПодключения.Ссылка);
				Если ЭтапыРЛ.Количество() > 0 Тогда	
					НастройкаПодключения = ВыборкаНастроекПодключения.Ссылка; 
					Прервать;
				КонецЕсли;    
			КонецЕсли;  
		КонецЦикла;
	КонецЕсли;	
	
	Если ЭтапыРЛ.Количество() = 0 Тогда
		Сообщить("Не найдены этапы рабочего листа в CRM системе! Проверьте наличие этапов в рабочем листе, либо принадлежность автосалона CRM учетной записи настройки подключения в 1С!");
		Возврат Результат;
		
	Иначе
		ЕстьВыдача = Ложь;
		Для Каждого ЭлМассива Из ЭтапыРЛ Цикл
			Если ИдентификаторВСтроку(ЭлМассива.type) = "12" И ИдентификаторВСтроку(ЭлМассива.state) <> "4" Тогда
				ЕстьВыдача = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ЕстьДоговор = Ложь;
		Для Каждого ЭлМассива Из ЭтапыРЛ Цикл
			Если ИдентификаторВСтроку(ЭлМассива.type) = "11" И ИдентификаторВСтроку(ЭлМассива.state) <> "4" Тогда
				ЕстьДоговор = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;			
	КонецЕсли;
	
	РабочийЛистБУ = Ложь;	
	РабочийЛистКорпоративныхПродаж = Ложь;      
	
	СтруктураРабочегоЛиста = ПолучитьСтруктуруРабочегоЛистаПоИдентификатору(id_CRM,НастройкаПодключения);  
	Если СтруктураРабочегоЛиста = Неопределено Тогда     
		СтруктураРабочегоЛиста = ПолучитьСтруктуруРабочегоЛистаКорпоративныхПродажПоИдентификатору(id_CRM,НастройкаПодключения);  
		Если СтруктураРабочегоЛиста = Неопределено Тогда
			СтруктураРабочегоЛиста = ПолучитьСтруктуруРабочегоЛистаБУПоИдентификатору(id_CRM,НастройкаПодключения);  
			Если СтруктураРабочегоЛиста = Неопределено Тогда
				Сообщить("Не найден в CRM рабочий лист № " + id_CRM + "; " + " Закрытие этапа не произойдет!");
				Возврат Истина; 
			Иначе
				РабочийЛистБУ = Истина;
			КонецЕсли; 
		Иначе
			РабочийЛистКорпоративныхПродаж = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если РабочийЛистБУ = Истина И НастройкаПодключения.ЗакрытиеЭтаповРабочихЛистовБУCRM = Ложь Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если РабочийЛистБУ = Ложь И НастройкаПодключения.ЗакрытиеЭтаповРабочихЛистовCRM = Ложь Тогда
		Возврат Истина;
	КонецЕсли;                 
	
	Потребность = "";   
	Попытка
		МассивПотребностей = СтруктураРабочегоЛиста.result.needs; 
		Для Каждого СтрокаПотребности Из МассивПотребностей Цикл
			Если СтрокаПотребности.VIN = Автомобиль.VIN Тогда
				Потребность = ИдентификаторВСтроку(СтрокаПотребности.id);
			КонецЕсли;
		КонецЦикла;
	Исключение 
	КонецПопытки;
	
	Если ЗначениеЗаполнено(Автомобиль) И Не ЗначениеЗаполнено(Потребность) И Реализация.ПометкаУдаления = Ложь Тогда
		Сообщить("Запись невозможна! Не соответствие автомобиля в Реализации автомобиля и в Рабочем листе CRM № " + id_CRM);  
		Возврат Истина;
	КонецЕсли;	
	
	Если ЕстьВыдача = Ложь  И ЗначениеЗаполнено(Потребность) И ЕстьДоговор = Истина И Реализация.ПометкаУдаления = Ложь Тогда
		//Выдача планирование этапа
		Если РабочийЛистБУ = Ложь И РабочийЛистКорпоративныхПродаж = Ложь Тогда
			Запрос = "/yii/api/retailStage/schedule?id=" + id_CRM + "&type=12";	
		ИначеЕсли РабочийЛистБУ = Ложь И РабочийЛистКорпоративныхПродаж = Истина Тогда  
			Запрос = "/yii/api/CorporateCase/schedule?id=" + id_CRM + "&type=12";				
		Иначе
			Запрос = "/yii/api/SaleUsedStage/schedule?id=" + id_CRM + "&type=12";	
		КонецЕсли;
		
		СтруктураДанных = Новый Структура();
		Если НачалоДня(ТекущаяДата()) > НачалоДня(Реализация.Дата) Тогда
			СтруктураДанных.Вставить("scheduleAt",Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy") + " " + Формат(КонецДня(ТекущаяДата()),"ДФ=ЧЧ:мм"));
		Иначе	
			СтруктураДанных.Вставить("scheduleAt",Формат(Реализация.Дата,"ДФ=dd.MM.yyyy") + " " + Формат(КонецДня(Реализация.Дата),"ДФ=ЧЧ:мм"));
		КонецЕсли;
		
		СтруктураДанных.Вставить("objectKey","2/" + Потребность);  
		Если ЗначениеЗаполнено(Реализация.Комментарий) Тогда
			СтруктураДанных.Вставить("comment","Передан из 1С: документ № " + Реализация.Номер + " от " + Формат(Реализация.Дата,"ДФ=dd.MM.yyyy") + ", комментарий документа: " + Реализация.Комментарий);
		Иначе
			СтруктураДанных.Вставить("comment","Передан из 1С: документ № " + Реализация.Номер + " от " + Формат(Реализация.Дата,"ДФ=dd.MM.yyyy"));   
		КонецЕсли;
		
		ИдентификаторСотрудника = Инфотек_ОбщиеПроцедуры.ПолучитьИдентификаторСоответствияПоОбъекту(НастройкаПодключения,Реализация.Менеджер,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Сотрудник);
		Если ЗначениеЗаполнено(ИдентификаторСотрудника) Тогда
			СтруктураДанных.Вставить("assistantId",ИдентификаторСотрудника);
		КонецЕсли;
		
		ТелоЗапроса = Инфотек_JSON.мЗаписатьJSON(СтруктураДанных,Истина);
		Ответ = Инфотек_Запросы.POSTЗапрос(Запрос,НастройкаПодключения,ТелоЗапроса);				
		Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
			Результат = Истина;
			ЭтапыРЛ = ПолучитьМассивСобытийПоИдентификаторуРабочегоЛиста(id_CRM,НастройкаПодключения);
			
		Иначе
			Результат = Ложь;
			Сообщить(Ответ.ПолучитьТелоКакСтроку());
		КонецЕсли;   
		
	КонецЕсли;
	
	Для Каждого ЭлМассива Из ЭтапыРЛ Цикл
		Если ИдентификаторВСтроку(ЭлМассива.type) = "12" И ИдентификаторВСтроку(ЭлМассива.state) <> "4" Тогда
			ИДЭтапа       = ИдентификаторВСтроку(ЭлМассива.id); 
			ИДПотребности = ИдентификаторВСтроку(ЭлМассива.need_id);
			ИДМенеджера   = ИдентификаторВСтроку(ЭлМассива.assigneeId);	
			//Выдача завершение этапа
			Если Реализация.ПометкаУдаления = Истина Тогда         
				Если РабочийЛистБУ = Ложь И РабочийЛистКорпоративныхПродаж = Ложь Тогда
					Запрос = "/yii/api/retailStage/cancel?id=" + ИДЭтапа;	
				ИначеЕсли РабочийЛистБУ = Ложь И РабочийЛистКорпоративныхПродаж = Истина Тогда
					Запрос = "/yii/api/CorporateCase/cancel?id=" + ИДЭтапа;						
				Иначе
					Запрос = "/yii/api/SaleUsedStage/cancel?id=" + ИДЭтапа;	
				КонецЕсли;
				СтруктураДанных = Новый Структура(); 
				Если ЗначениеЗаполнено(Реализация.Комментарий) Тогда
					СтруктураДанных.Вставить("comment","Передан из 1С: документ № " + Реализация.Номер + " от " + Формат(Реализация.Дата,"ДФ=dd.MM.yyyy") + ", комментарий документа: " + Реализация.Комментарий);
				Иначе
					СтруктураДанных.Вставить("comment","Передан из 1С: документ № " + Реализация.Номер + " от " + Формат(Реализация.Дата,"ДФ=dd.MM.yyyy"));   
				КонецЕсли;      
				Попытка
					ИдентификаторПричиныОтказа = Инфотек_ОбщиеПроцедуры.ПолучитьИдентификаторСоответствияПоОбъекту(НастройкаПодключения,Реализация.ДокументОснование.ДокументОснование.ПричинаОтказа,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.ПричинаОтказа);
					Если Не ЗначениеЗаполнено(ИдентификаторПричиныОтказа) Тогда
						СтруктураДанных.Вставить("resultId","18");
					Иначе
						СтруктураДанных.Вставить("resultId",ИдентификаторПричиныОтказа);    
					КонецЕсли;
				Исключение			
					СтруктураДанных.Вставить("resultId","18"); 
				КонецПопытки;
				
			Иначе
				Если ИдентификаторВСтроку(ЭлМассива.state) = "3" Тогда
					Сообщить("Этап Выдача рабочего листа закрыт: " + ЭлМассива.closedAt);
					Возврат Истина;
				КонецЕсли;
				
				Если РабочийЛистБУ = Ложь И РабочийЛистКорпоративныхПродаж = Ложь Тогда
					СтруктураПотребности = ПолучитьСтруктуруПотребностиПоИдентификатору(ИдентификаторВСтроку(ЭлМассива.need_id),НастройкаПодключения);   
				ИначеЕсли РабочийЛистБУ = Ложь И РабочийЛистКорпоративныхПродаж = Истина Тогда
					СтруктураПотребности = ПолучитьСтруктуруКорпоративнойПотребностиПоИдентификатору(ИдентификаторВСтроку(ЭлМассива.need_id),НастройкаПодключения);   					
				Иначе	
					СтруктураПотребности = ПолучитьСтруктуруБУПотребностиПоИдентификатору(ИдентификаторВСтроку(ЭлМассива.need_id),НастройкаПодключения);
				КонецЕсли;
				
				Если СтруктураПотребности.result.VIN <> Автомобиль.VIN И НастройкаПодключения.ПроверятьСоответствиеVIN = Истина	Тогда
					Сообщить("Проведение невозможно! Не соответствие автомобиля в Реализации автомобиля и в Рабочем листе CRM № " + id_CRM); 
					Сообщить("Потребность 1С: " + Автомобиль.VIN + "; " + "Потребность CRM: " + СтруктураПотребности.result.VIN);
					Возврат Ложь;
				КонецЕсли;
				
				СтруктураКлиента = ПолучитьСтруктуруКлиентаПоИдентификатору(ИдентификаторВСтроку(ЭлМассива.client_id),НастройкаПодключения);
				Клиент = СтруктураКлиента.result;
				СтруктураФизЛицо = Клиент.primaryPerson;   
				Если НастройкаПодключения.ПроверятьСоответствиеТелефона = Истина Тогда 
					МассивТелефоны = СтруктураФизЛицо.phones;
					Если МассивТелефоны.Количество() = 0 ИЛИ МассивТелефоны = Неопределено Тогда
						СтруктураОрганизация = Клиент.company;
						МассивТелефоны = СтруктураОрганизация.phones;  					
					КонецЕсли; 
					Если МассивТелефоны.Количество() = 0 ИЛИ МассивТелефоны = Неопределено Тогда
						Сообщить("Проведение невозможно! В CRM системе не заполнен телефон контрагента в рабочем листе № " + id_CRM); 
						Возврат Ложь;
					КонецЕсли;  				
					ТелефоныСовпадают = Ложь;   			
					Для Каждого Эл Из МассивТелефоны Цикл
						Если ЗначениеЗаполнено(Эл.number) Тогда
							НомерТелефонаCRM = Эл.number;	 
							НомерТелефонаCRM = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьТелефонЦифрами(НомерТелефонаCRM);
							Если Лев(НомерТелефонаCRM,1) = "7" или Лев(НомерТелефонаCRM,1)= "8" Тогда
								НомерТелефонаCRM = Сред(НомерТелефонаCRM,2);
							КонецЕсли;    
							КонтактнаяИнформация = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьКИ(Реализация.Заказчик,Перечисления.ТипыКонтактнойИнформации.Телефон);
							Пока КонтактнаяИнформация.Следующий() Цикл  
								НомерТелефона = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьТелефонЦифрами(КонтактнаяИнформация.Представление);
								Если Лев(НомерТелефона,1) = "7" или Лев(НомерТелефона,1)= "8" Тогда
									НомерТелефона = Сред(НомерТелефона,2);
								КонецЕсли; 						
								Если НомерТелефонаCRM = НомерТелефона Тогда
									ТелефоныСовпадают = Истина;
								КонецЕсли;
							КонецЦикла; 
							КонтактнаяИнформация = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьКИ(Реализация.Контрагент,Перечисления.ТипыКонтактнойИнформации.Телефон);
							Пока КонтактнаяИнформация.Следующий() Цикл  
								НомерТелефона = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьТелефонЦифрами(КонтактнаяИнформация.Представление);
								Если Лев(НомерТелефона,1) = "7" или Лев(НомерТелефона,1)= "8" Тогда
									НомерТелефона = Сред(НомерТелефона,2);
								КонецЕсли; 						
								Если НомерТелефонаCRM = НомерТелефона Тогда
									ТелефоныСовпадают = Истина;
								КонецЕсли;
							КонецЦикла; 
						КонецЕсли;
					КонецЦикла;        
					Если ТелефоныСовпадают = Ложь Тогда
						Сообщить("Проведение невозможно! Не совпадают телефоны клиента 1С и рабочего листа CRM № " + id_CRM); 
						Сообщить("Номер телефона 1С: " + НомерТелефона + "; " + "Номер телефона CRM: " + НомерТелефонаCRM);
						Возврат Ложь;
					КонецЕсли; 
				КонецЕсли; 
				
				Если НастройкаПодключения.ПроверятьСоответствиеEmail = Истина Тогда 
					emailCRM = СокрЛП(Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.email)); 
					emailСовпадают = Ложь;   
					КонтактнаяИнформация = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьКИ(Реализация.Заказчик,Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
					Пока КонтактнаяИнформация.Следующий() Цикл  
						email = СокрЛП(КонтактнаяИнформация.Представление); 
						Если email = emailCRM Тогда
							emailСовпадают = Истина;
						КонецЕсли;
					КонецЦикла; 	   
					КонтактнаяИнформация = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьКИ(Реализация.Контрагент,Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
					Пока КонтактнаяИнформация.Следующий() Цикл  
						email = СокрЛП(КонтактнаяИнформация.Представление); 
						Если email = emailCRM Тогда
							emailСовпадают = Истина;
						КонецЕсли;
					КонецЦикла; 	
					Если emailСовпадают = Ложь Тогда
						Сообщить("Проведение невозможно! Не совпадают email клиента 1С и рабочего листа CRM № " + id_CRM); 
						Сообщить("Email 1С: " + email + "; " + "Email CRM: " + emailCRM);
						Возврат Ложь;
					КонецЕсли; 
				КонецЕсли;
				
				Тип = Инфотек_ОбщиеПроцедуры.УбратьКавычки(Клиент.type);					
				Если Найти(Тип,"individual") <> 0 И НастройкаПодключения.ПроверятьСоответствиеФИО = Истина Тогда	
					Фамилия  = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.lastName);
					Имя      = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.firstName);
					Отчество = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.middleName);	
					Наименование = Фамилия + " " + Имя + " " + Отчество;
					Если СокрЛП(Наименование) <> СокрЛП(Реализация.Заказчик.Наименование) И СокрЛП(Наименование) <> СокрЛП(Реализация.Контрагент.Наименование) Тогда
						Сообщить("Проведение невозможно! Не совпадают ФИО клиента 1С и рабочего листа CRM № " + id_CRM); 
						Сообщить("ФИО 1С: " + СокрЛП(Реализация.Заказчик.Наименование) + "; " + "ФИО CRM: " + Наименование);
						Возврат Ложь;
					КонецЕсли;
				КонецЕсли;
				
				Если РабочийЛистБУ = Ложь И РабочийЛистКорпоративныхПродаж = Ложь Тогда
					Запрос = "/yii/api/retailStage/finish?id=" + ИДЭтапа;
				ИначеЕсли РабочийЛистБУ = Ложь И РабочийЛистКорпоративныхПродаж = Истина Тогда
					Запрос = "/yii/api/CorporateCase/finish?id=" + ИДЭтапа;	
				Иначе
					Запрос = "/yii/api/SaleUsedStage/finish?id=" + ИДЭтапа;	
				КонецЕсли;
				СтруктураДанных = Новый Структура();
				Если НачалоДня(ТекущаяДата()) > НачалоДня(Реализация.Дата) Тогда
					СтруктураДанных.Вставить("scheduleAt", Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy") + " " + Формат(КонецДня(ТекущаяДата()),"ДФ=ЧЧ:мм"));
				Иначе	
					СтруктураДанных.Вставить("scheduleAt", Формат(Реализация.Дата,"ДФ=dd.MM.yyyy") + " " + Формат(КонецДня(Реализация.Дата),"ДФ=ЧЧ:мм"));
				КонецЕсли;
				Если ЗначениеЗаполнено(Реализация.Комментарий) Тогда
					СтруктураДанных.Вставить("comment","Передан из 1С: документ № " + Реализация.Номер + " от " + Формат(Реализация.Дата,"ДФ=dd.MM.yyyy") + ", комментарий документа: " + Реализация.Комментарий);
				Иначе
					СтруктураДанных.Вставить("comment","Передан из 1С: документ № " + Реализация.Номер + " от " + Формат(Реализация.Дата,"ДФ=dd.MM.yyyy"));   
				КонецЕсли;      
				СтруктураДанных.Вставить("objectKey","2/" + ИДПотребности);
				СтруктураДанных.Вставить("assistantId",ИДМенеджера);
			КонецЕсли;
			
			ТелоЗапроса = Инфотек_JSON.мЗаписатьJSON(СтруктураДанных,Истина);
			Ответ = Инфотек_Запросы.POSTЗапрос(Запрос,НастройкаПодключения,ТелоЗапроса);				
			Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
				Результат = Истина;   
				Если СтрНайти(Ответ.ПолучитьТелоКакСтроку(),"""success"":false") > 0 Тогда
					//Результат = Ложь;
					Сообщить("Не удалось завершить этап Выдача в CRM!" + Символы.ПС + Ответ.ПолучитьТелоКакСтроку());	
				КонецЕсли;			
			Иначе
				Результат = Ложь;
				Сообщить(Ответ.ПолучитьТелоКакСтроку());
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

// Функция отправки запроса завершения контракта по рабочему листу в CRM    
//                           
// Параметры:   
//  Реализация           - ДокументСсылка.ЗаказНаАвтомобиль - Ссылка на документ заказ на автомобиль.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//  id_CRM               - Строка - Идентификатор рабочего листа.
//
// Возвращаемое значение:
//  Булево - Успешна/неудачна отправка запроса.  
// 
Функция ПередатьВCRMДоговор(ЗаказНаАвтомобиль,НастройкаПодключения,id_CRM)
	
	Результат = Ложь;
	ЭтапыРЛ = ПолучитьМассивСобытийПоИдентификаторуРабочегоЛиста(id_CRM,НастройкаПодключения);            
	Если ЭтапыРЛ.Количество() = 0 Тогда
		ВыборкаНастроекПодключения = Справочники.Инфотек_НастройкиПодключения.Выбрать();
		Пока ВыборкаНастроекПодключения.Следующий() Цикл 
			Если ВыборкаНастроекПодключения.ПометкаУдаления = Ложь Тогда 
				ЭтапыРЛ = ПолучитьМассивСобытийПоИдентификаторуРабочегоЛиста(id_CRM,ВыборкаНастроекПодключения.Ссылка);
				Если ЭтапыРЛ.Количество() > 0 Тогда	
					НастройкаПодключения = ВыборкаНастроекПодключения.Ссылка; 
					Прервать;
				КонецЕсли;    
			КонецЕсли;  
		КонецЦикла;
	КонецЕсли;	
	
	ЕстьДоговор = Ложь;
	Если ЭтапыРЛ.Количество() > 0 Тогда	
		Для Каждого ЭлМассива Из ЭтапыРЛ Цикл
			Если ИдентификаторВСтроку(ЭлМассива.type) = "11" И ИдентификаторВСтроку(ЭлМассива.state) <> "4" Тогда
				ЕстьДоговор = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;			
	КонецЕсли;  
	
	РабочийЛистБУ = Ложь;
	РабочийЛистКорпоративныхПродаж = Ложь;
	
	СтруктураРабочегоЛиста = ПолучитьСтруктуруРабочегоЛистаПоИдентификатору(id_CRM,НастройкаПодключения);  
	Если СтруктураРабочегоЛиста = Неопределено Тогда     
		СтруктураРабочегоЛиста = ПолучитьСтруктуруРабочегоЛистаКорпоративныхПродажПоИдентификатору(id_CRM,НастройкаПодключения);  
		Если СтруктураРабочегоЛиста = Неопределено Тогда
			СтруктураРабочегоЛиста = ПолучитьСтруктуруРабочегоЛистаБУПоИдентификатору(id_CRM,НастройкаПодключения);  
			Если СтруктураРабочегоЛиста = Неопределено Тогда
				Сообщить("Не найден в CRM рабочий лист № " + id_CRM + "; " + " Закрытие этапа не произойдет!");
				Результат = Истина;
				Возврат Результат; 
			Иначе
				РабочийЛистБУ = Истина;
			КонецЕсли; 
		Иначе
			РабочийЛистКорпоративныхПродаж = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если РабочийЛистБУ = Истина И НастройкаПодключения.ЗакрытиеЭтаповРабочихЛистовБУCRM = Ложь Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если РабочийЛистБУ = Ложь И НастройкаПодключения.ЗакрытиеЭтаповРабочихЛистовCRM = Ложь Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ЭтапыРЛ.Количество() = 0 Тогда
		Сообщить("Не найдены этапы рабочего листа в CRM системе! Проверьте наличие этапов в рабочем листе, либо принадлежность автосалона CRM учетной записи настройки подключения в 1С!");
		Возврат Результат;
	КонецЕсли;
	
	Если ЗаказНаАвтомобиль.ХозОперация = Справочники.ХозОперации.ЗаказНаАвтомобильИзменение Тогда
		Для Каждого ЭлМассива Из ЭтапыРЛ Цикл
			ИДЭтапа = ИдентификаторВСтроку(ЭлМассива.id); 
			Если ИдентификаторВСтроку(ЭлМассива.type) = "11" И ИдентификаторВСтроку(ЭлМассива.state) <> "4" Тогда		   
				Если РабочийЛистБУ = Ложь И РабочийЛистКорпоративныхПродаж = Ложь Тогда
					Запрос = "/yii/api/retailStage/cancel?id=" + ИДЭтапа;	
				ИначеЕсли РабочийЛистБУ = Ложь И РабочийЛистКорпоративныхПродаж = Истина Тогда 
					Запрос = "/yii/api/CorporateCase/cancel?id=" + ИДЭтапа;	
				Иначе
					Запрос = "/yii/api/SaleUsedStage/cancel?id=" + ИДЭтапа;	
				КонецЕсли;
				СтруктураДанных = Новый Структура(); 
				Попытка
					ИдентификаторПричиныОтказа = Строка(НастройкаПодключения.ИдентфикаторПричиныОтказаОтКонтрактаПоУмолчанию);
					Если Не ЗначениеЗаполнено(ИдентификаторПричиныОтказа) Тогда
						СтруктураДанных.Вставить("resultId","18");
					Иначе
						СтруктураДанных.Вставить("resultId",ИдентификаторПричиныОтказа);    
					КонецЕсли;
				Исключение			
					СтруктураДанных.Вставить("resultId","18"); 
				КонецПопытки;	
				СтруктураДанных.Вставить("comment","Передан из 1С: документ отмена заказа на автомобиль № " + ЗаказНаАвтомобиль.ДокументОснование.Номер + " от " + Формат(ЗаказНаАвтомобиль.ДокументОснование.Дата,"ДФ=dd.MM.yyyy")); 
				
				ТелоЗапроса = Инфотек_JSON.мЗаписатьJSON(СтруктураДанных,Истина);
				Ответ = Инфотек_Запросы.POSTЗапрос(Запрос,НастройкаПодключения,ТелоЗапроса);				
				Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
					Результат = Истина;
				Иначе
					Результат = Ложь;
					Сообщить(Ответ.ПолучитьТелоКакСтроку());
				КонецЕсли; 
				ЕстьДоговор = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;  
	
	Потребность = "";
	Попытка
		МассивПотребностей = СтруктураРабочегоЛиста.result.needs; 
		Для Каждого СтрокаПотребности Из МассивПотребностей Цикл
			Если ЗначениеЗаполнено(ЗаказНаАвтомобиль.Автомобиль.VIN) Тогда
				Если СтрокаПотребности.VIN = ЗаказНаАвтомобиль.Автомобиль.VIN Тогда
					Потребность = ИдентификаторВСтроку(СтрокаПотребности.id); 
				КонецЕсли;
			Иначе
				Потребность = ИдентификаторВСтроку(СтрокаПотребности.id);
			КонецЕсли;
		КонецЦикла;
	Исключение 
	КонецПопытки;
	Если ЗначениеЗаполнено(ЗаказНаАвтомобиль.Автомобиль) И Не ЗначениеЗаполнено(Потребность) И ЗаказНаАвтомобиль.ПометкаУдаления = Ложь Тогда
		Сообщить("Проведение невозможно! Не соответствие потребности заказа на автомобиль и рабочего листа № " + id_CRM);  
		Результат = Ложь;
		Возврат Результат;
	КонецЕсли;
	
	Если ЕстьДоговор = Ложь И ЗначениеЗаполнено(Потребность) И ЗаказНаАвтомобиль.ХозОперация <> Справочники.ХозОперации.ЗаказНаАвтомобильОтмена И ЗаказНаАвтомобиль.ПометкаУдаления = Ложь Тогда
		//Контракт планирование этапа             
		Если РабочийЛистБУ = Ложь И РабочийЛистКорпоративныхПродаж = Ложь Тогда
			Запрос = "/yii/api/retailStage/schedule?id=" + id_CRM + "&type=11";	 
		ИначеЕсли РабочийЛистБУ = Ложь И РабочийЛистКорпоративныхПродаж = Истина Тогда 
			Запрос = "/yii/api/CorporateCase/schedule?id=" + id_CRM + "&type=11";	 
		Иначе
			Запрос = "/yii/api/SaleUsedStage/schedule?id=" + id_CRM + "&type=11";	
		КонецЕсли;
		СтруктураДанных = Новый Структура();       
		Если НачалоДня(ТекущаяДата()) > НачалоДня(ЗаказНаАвтомобиль.Дата) Тогда
			СтруктураДанных.Вставить("scheduleAt",Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy") + " " + Формат(КонецДня(ТекущаяДата()),"ДФ=ЧЧ:мм"));
		Иначе	
			СтруктураДанных.Вставить("scheduleAt",Формат(ЗаказНаАвтомобиль.Дата,"ДФ=dd.MM.yyyy") + " " + Формат(КонецДня(ЗаказНаАвтомобиль.Дата),"ДФ=ЧЧ:мм"));
		КонецЕсли;
		СтруктураДанных.Вставить("objectKey","2/" + Потребность);  
		Если ЗначениеЗаполнено(ЗаказНаАвтомобиль.Комментарий) Тогда
			СтруктураДанных.Вставить("comment","Передан из 1С: документ № " + ЗаказНаАвтомобиль.Номер + " от " + Формат(ЗаказНаАвтомобиль.Дата,"ДФ=dd.MM.yyyy") + ", комментарий документа: " + ЗаказНаАвтомобиль.Комментарий);
		Иначе
			СтруктураДанных.Вставить("comment","Передан из 1С: документ № " + ЗаказНаАвтомобиль.Номер + " от " + Формат(ЗаказНаАвтомобиль.Дата,"ДФ=dd.MM.yyyy")); 	
		КонецЕсли;				
		ИдентификаторСотрудника = Инфотек_ОбщиеПроцедуры.ПолучитьИдентификаторСоответствияПоОбъекту(НастройкаПодключения,ЗаказНаАвтомобиль.Менеджер,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Сотрудник);
		Если ЗначениеЗаполнено(ИдентификаторСотрудника) Тогда
			СтруктураДанных.Вставить("assistantId",ИдентификаторСотрудника);
		КонецЕсли;
		ТелоЗапроса = Инфотек_JSON.мЗаписатьJSON(СтруктураДанных,Истина);
		Ответ = Инфотек_Запросы.POSTЗапрос(Запрос,НастройкаПодключения,ТелоЗапроса);				
		Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
			Результат = Истина;
		Иначе
			Результат = Ложь;
			Сообщить(Ответ.ПолучитьТелоКакСтроку());
		КонецЕсли; 
		ЭтапыРЛ = ПолучитьМассивСобытийПоИдентификаторуРабочегоЛиста(id_CRM,НастройкаПодключения);   
	КонецЕсли;
	
	Для Каждого ЭлМассива Из ЭтапыРЛ Цикл
		Если ИдентификаторВСтроку(ЭлМассива.type) = "11" И ИдентификаторВСтроку(ЭлМассива.state) <> "4" Тогда		   
			ИДЭтапа = ИдентификаторВСтроку(ЭлМассива.id); 
			ИДПотребности = ИдентификаторВСтроку(ЭлМассива.need_id);
			ИДМенеджера = ИдентификаторВСтроку(ЭлМассива.assigneeId);
			//Контракт завершение этапа или отмена этапа   
			Если (ЗаказНаАвтомобиль.ХозОперация = Справочники.ХозОперации.ЗаказНаАвтомобильОтмена И ЗаказНаАвтомобиль.ПометкаУдаления = Ложь) Тогда         
				Если РабочийЛистБУ = Ложь И РабочийЛистКорпоративныхПродаж = Ложь Тогда
					Запрос = "/yii/api/retailStage/cancel?id=" + ИДЭтапа;	
				ИначеЕсли РабочийЛистБУ = Ложь И РабочийЛистКорпоративныхПродаж = Истина Тогда 
					Запрос = "/yii/api/CorporateCase/cancel?id=" + ИДЭтапа;	
				Иначе
					Запрос = "/yii/api/SaleUsedStage/cancel?id=" + ИДЭтапа;	
				КонецЕсли;
				СтруктураДанных = Новый Структура(); 
				Попытка
					ИдентификаторПричиныОтказа = Инфотек_ОбщиеПроцедуры.ПолучитьИдентификаторСоответствияПоОбъекту(НастройкаПодключения,ЗаказНаАвтомобиль.ДокументОснование.ДокументОснование.ПричинаОтказа,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.ПричинаОтказа);
					Если Не ЗначениеЗаполнено(ИдентификаторПричиныОтказа) Тогда
						СтруктураДанных.Вставить("resultId","18");
					Иначе
						СтруктураДанных.Вставить("resultId",ИдентификаторПричиныОтказа);    
					КонецЕсли;
				Исключение			
					СтруктураДанных.Вставить("resultId","18"); 
				КонецПопытки;	
				СтруктураДанных.Вставить("comment","Передан из 1С: документ отмена заказа на автомобиль № " + ЗаказНаАвтомобиль.Номер + " от " + Формат(ЗаказНаАвтомобиль.Дата,"ДФ=dd.MM.yyyy")); 
				
			Иначе 
				Если ЭлМассива.state = "3" Тогда
					Сообщить("Этап рабочего листа Контракт уже закрыт: " + ЭлМассива.closedAt);
					Возврат Истина;
				КонецЕсли;
				
				Если РабочийЛистБУ = Ложь И РабочийЛистКорпоративныхПродаж = Ложь Тогда
					СтруктураПотребности = ПолучитьСтруктуруПотребностиПоИдентификатору(ИдентификаторВСтроку(ЭлМассива.need_id),НастройкаПодключения);   
				ИначеЕсли РабочийЛистБУ = Ложь И РабочийЛистКорпоративныхПродаж = Истина Тогда
					СтруктураПотребности = ПолучитьСтруктуруКорпоративнойПотребностиПоИдентификатору(ИдентификаторВСтроку(ЭлМассива.need_id),НастройкаПодключения);   					
				Иначе	
					СтруктураПотребности = ПолучитьСтруктуруБУПотребностиПоИдентификатору(ИдентификаторВСтроку(ЭлМассива.need_id),НастройкаПодключения);
				КонецЕсли;
				Если СтруктураПотребности.result.VIN <> ЗаказНаАвтомобиль.Автомобиль.VIN И НастройкаПодключения.ПроверятьСоответствиеVIN = Истина Тогда	
					Сообщить("Проведение невозможно! Не соответствие потребности заказа на автомобиль и рабочего листа № " + id_CRM); 
					Сообщить("Потребность 1С: " + ЗаказНаАвтомобиль.Автомобиль.VIN + "; " + "Потребность CRM: " + СтруктураПотребности.result.VIN);
					Результат = Ложь;
					Возврат Результат;
				КонецЕсли;  
				
				СтруктураКлиента = ПолучитьСтруктуруКлиентаПоИдентификатору(ИдентификаторВСтроку(ЭлМассива.client_id),НастройкаПодключения);
				Клиент = СтруктураКлиента.result;
				СтруктураФизЛицо =  Клиент.primaryPerson;  
				Если НастройкаПодключения.ПроверятьСоответствиеТелефона = Истина Тогда
					МассивТелефоны   =  СтруктураФизЛицо.phones;
					Если МассивТелефоны.Количество() = 0 ИЛИ МассивТелефоны = Неопределено Тогда
						СтруктураОрганизация =  Клиент.company;
						МассивТелефоны  = СтруктураОрганизация.phones;  					
					КонецЕсли; 
					Если МассивТелефоны.Количество() = 0 ИЛИ МассивТелефоны = Неопределено Тогда
						Сообщить("Проведение невозможно! В CRM системе не заполнен телефон контрагента в рабочем листе № " + id_CRM); 
						Результат = Ложь;
						Возврат Результат;
					КонецЕсли;  				
					ТелефоныСовпадают = Ложь;
					Для Каждого Эл Из МассивТелефоны Цикл
						Если ЗначениеЗаполнено(Эл.number) Тогда
							НомерТелефонаCRM = Эл.number;	 
							НомерТелефонаCRM = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьТелефонЦифрами(НомерТелефонаCRM);
							Если Лев(НомерТелефонаCRM,1) = "7" или Лев(НомерТелефонаCRM,1)= "8" Тогда
								НомерТелефонаCRM = Сред(НомерТелефонаCRM,2);
							КонецЕсли;   
							КонтактнаяИнформация = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьКИ(ЗаказНаАвтомобиль.Заказчик,Перечисления.ТипыКонтактнойИнформации.Телефон);
							Пока КонтактнаяИнформация.Следующий() Цикл  
								НомерТелефона = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьТелефонЦифрами(КонтактнаяИнформация.Представление);
								Если Лев(НомерТелефона,1) = "7" или Лев(НомерТелефона,1)= "8" Тогда
									НомерТелефона = Сред(НомерТелефона,2);
								КонецЕсли; 						
								Если НомерТелефонаCRM = НомерТелефона Тогда
									ТелефоныСовпадают = Истина;
								КонецЕсли;
							КонецЦикла; 
							КонтактнаяИнформация = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьКИ(ЗаказНаАвтомобиль.Контрагент,Перечисления.ТипыКонтактнойИнформации.Телефон);
							Пока КонтактнаяИнформация.Следующий() Цикл  
								НомерТелефона = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьТелефонЦифрами(КонтактнаяИнформация.Представление);
								Если Лев(НомерТелефона,1) = "7" или Лев(НомерТелефона,1)= "8" Тогда
									НомерТелефона = Сред(НомерТелефона,2);
								КонецЕсли; 						
								Если НомерТелефонаCRM = НомерТелефона Тогда
									ТелефоныСовпадают = Истина;
								КонецЕсли;
							КонецЦикла; 	
						КонецЕсли;
					КонецЦикла;     
					Если ТелефоныСовпадают = Ложь Тогда
						Сообщить("Проведение невозможно! Не совпадают телефоны клиента 1С и рабочего листа CRM № " + id_CRM); 
						Сообщить("Номер телефона 1С: " + НомерТелефона + "; " + "Номер телефона CRM: " + НомерТелефонаCRM);
						Результат = Ложь;
						Возврат Результат;
					КонецЕсли; 
				КонецЕсли;
				
				Если НастройкаПодключения.ПроверятьСоответствиеEmail = Истина Тогда 
					emailCRM = СокрЛП(Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.email)); 
					emailСовпадают = Ложь;     
					КонтактнаяИнформация = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьКИ(ЗаказНаАвтомобиль.Заказчик,Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
					Пока КонтактнаяИнформация.Следующий() Цикл  
						email = СокрЛП(КонтактнаяИнформация.Представление); 
						Если email = emailCRM Тогда
							emailСовпадают = Истина;
						КонецЕсли;
					КонецЦикла; 	   
					КонтактнаяИнформация = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьКИ(ЗаказНаАвтомобиль.Контрагент,Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
					Пока КонтактнаяИнформация.Следующий() Цикл  
						email = СокрЛП(КонтактнаяИнформация.Представление); 
						Если email = emailCRM Тогда
							emailСовпадают = Истина;
						КонецЕсли;
					КонецЦикла; 	
					Если emailСовпадают = Ложь Тогда
						Сообщить("Проведение невозможно! Не совпадают email клиента 1С и рабочего листа CRM № " + id_CRM); 
						Сообщить("Email 1С: " + email + "; " + "Email CRM: " + emailCRM);
						Результат = Ложь;
						Возврат Результат;
					КонецЕсли; 
				КонецЕсли;
				
				Тип = Инфотек_ОбщиеПроцедуры.УбратьКавычки(Клиент.type);					
				Если Найти(Тип, "individual") <> 0 И НастройкаПодключения.ПроверятьСоответствиеФИО = Истина Тогда	
					Фамилия  = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.lastName);
					Имя      = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.firstName);
					Отчество = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.middleName);	
					Наименование = Фамилия + " " + Имя + " " + Отчество;
					Если СокрЛП(Наименование) <> СокрЛП(ЗаказНаАвтомобиль.Заказчик.Наименование) И СокрЛП(Наименование) <> СокрЛП(ЗаказНаАвтомобиль.Контрагент.Наименование) Тогда
						Сообщить("Проведение невозможно! Не совпадают ФИО клиента 1С и рабочего листа CRM № " + id_CRM); 
						Сообщить("ФИО 1С: " + СокрЛП(ЗаказНаАвтомобиль.Заказчик.Наименование) + "; " + "ФИО CRM: " + Наименование);
						Результат = Ложь;
						Возврат Результат;
					КонецЕсли;
				КонецЕсли;
				
				Если РабочийЛистБУ = Ложь И РабочийЛистКорпоративныхПродаж = Ложь Тогда
					Запрос = "/yii/api/retailStage/finish?id=" + ИДЭтапа;	
				ИначеЕсли РабочийЛистБУ = Ложь И РабочийЛистКорпоративныхПродаж = Истина Тогда 
					Запрос = "/yii/api/CorporateCase/finish?id=" + ИДЭтапа;	
				Иначе
					Запрос = "/yii/api/SaleUsedStage/finish?id=" + ИДЭтапа;	
				КонецЕсли;
				СтруктураДанных = Новый Структура();
				Если НачалоДня(ТекущаяДата()) > НачалоДня(ЗаказНаАвтомобиль.Дата) Тогда
					СтруктураДанных.Вставить("scheduleAt", Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy") + " " + Формат(КонецДня(ТекущаяДата()),"ДФ=ЧЧ:мм"));
				Иначе	
					СтруктураДанных.Вставить("scheduleAt", Формат(ЗаказНаАвтомобиль.Дата,"ДФ=dd.MM.yyyy") + " " + Формат(КонецДня(ЗаказНаАвтомобиль.Дата),"ДФ=ЧЧ:мм"));
				КонецЕсли;    
				Если ЗначениеЗаполнено(ЗаказНаАвтомобиль.Комментарий) Тогда
					СтруктураДанных.Вставить("comment","Передан из 1С: документ № " + ЗаказНаАвтомобиль.Номер + " от " + Формат(ЗаказНаАвтомобиль.Дата,"ДФ=dd.MM.yyyy") + ", комментарий документа: " + ЗаказНаАвтомобиль.Комментарий);
				Иначе
					СтруктураДанных.Вставить("comment","Передан из 1С: документ № " + ЗаказНаАвтомобиль.Номер + " от " + Формат(ЗаказНаАвтомобиль.Дата,"ДФ=dd.MM.yyyy")); 	
				КонецЕсли;				
				ИдентификаторСотрудника = Инфотек_ОбщиеПроцедуры.ПолучитьИдентификаторСоответствияПоОбъекту(НастройкаПодключения,ЗаказНаАвтомобиль.Менеджер,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Сотрудник);
				Если ЗначениеЗаполнено(ИдентификаторСотрудника) Тогда
					СтруктураДанных.Вставить("assistantId",ИдентификаторСотрудника);
				КонецЕсли;	
				СтруктураДанных.Вставить("objectKey","2/" + ИДПотребности);
			КонецЕсли;
			
			ТелоЗапроса = Инфотек_JSON.мЗаписатьJSON(СтруктураДанных,Истина);
			Ответ = Инфотек_Запросы.POSTЗапрос(Запрос,НастройкаПодключения,ТелоЗапроса);				
			Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
				Результат = Истина; 
				Если СтрНайти(Ответ.ПолучитьТелоКакСтроку(),"""success"":false") > 0 Тогда
					Сообщить("Не удалось завершить этап Контракт в CRM!" + Символы.ПС + Ответ.ПолучитьТелоКакСтроку(), СтатусСообщения.Внимание);	
				КонецЕсли;			
			Иначе
				Результат = Ложь;
				Сообщить(Ответ.ПолучитьТелоКакСтроку());  
				Возврат Результат;	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;			
	
	Результат = Истина; 
	Возврат Результат;	
КонецФункции

// Функция отправки запроса завершения поступления по рабочему листу TradeIn в CRM    
//                           
// Параметры:   
//  ДокументДвижения     - ДокументСсылка - Ссылка на документ поступление/возврат автомобиля.
//  СтрокаАвто           - Строка табличной части документа
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//  id_CRM               - Строка - Идентификатор рабочего листа.
//
// Возвращаемое значение:
//  Булево - Успешна/неудачна отправка запроса.  
// 
Функция ПодтвердитьПоступлениеTradeIn(ДокументДвижения,СтрокаАвто,НастройкаПодключения,id_CRM) Экспорт
	Результат = Ложь;	
	ЭтапыРЛ = ПолучитьМассивСобытийПоИдентификаторуРабочегоЛиста(id_CRM,НастройкаПодключения);   
	Если ЭтапыРЛ.Количество() = 0 Тогда
		ВыборкаНастроекПодключения = Справочники.Инфотек_НастройкиПодключения.Выбрать();
		Пока ВыборкаНастроекПодключения.Следующий() Цикл 
			Если ВыборкаНастроекПодключения.ПометкаУдаления = Ложь Тогда 
				ЭтапыРЛ = ПолучитьМассивСобытийПоИдентификаторуРабочегоЛиста(id_CRM,ВыборкаНастроекПодключения.Ссылка);
				Если ЭтапыРЛ.Количество() > 0 Тогда	
					НастройкаПодключения = ВыборкаНастроекПодключения.Ссылка; 
					Прервать;
				КонецЕсли;    
			КонецЕсли;  
		КонецЦикла;
	КонецЕсли;	
	
		
	Если ЭтапыРЛ.Количество() = 0 Тогда
		Сообщить("Не найдены этапы рабочего листа в CRM системе! Проверьте наличие этапов в рабочем листе, либо принадлежность автосалона CRM учетной записи настройки подключения в 1С!");
		Возврат Результат;
		
	Иначе
		ЕстьПоступление = Ложь;
		Для Каждого ЭлМассива Из ЭтапыРЛ  Цикл
			Если ИдентификаторВСтроку(ЭлМассива.type) = "5" И ИдентификаторВСтроку(ЭлМассива.state) <> "4" Тогда
				ЕстьПоступление = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;
	
	СтруктураРабочегоЛиста = ПолучитьСтруктуруРабочегоЛистаTradeInПоИдентификатору(id_CRM, НастройкаПодключения);
	Если СтруктураРабочегоЛиста = Неопределено Тогда  
		Сообщить("На портале не найден в CRM рабочий лист № " + id_CRM + "; " + " Закрыть этап Приём невозможно!");
		Возврат Истина;
	КонецЕсли;
	
	Если НастройкаПодключения.ЗакрытиеЭтаповTradeInCRM = Ложь Тогда
		Возврат Истина;
	КонецЕсли;
	
	Автомобиль = СтрокаАвто.Автомобиль;
	АвтомобильCRM = "";   
	Попытка
		СтруктураАвтомобиля = СтруктураРабочегоЛиста.result.Vehicle; 
		Если СтруктураАвтомобиля.vin = Автомобиль.VIN Тогда
			АвтомобильCRM = ИдентификаторВСтроку(СтруктураАвтомобиля.id);
		КонецЕсли;
	Исключение 
	КонецПопытки;             
	
	Если обЗначениеНеЗаполнено(АвтомобильCRM) Тогда
		Сообщить("Закрыть этап Приём невозможно! На портале не найден автомобиль поступления для рабочего листа № " + id_CRM);  
		Возврат Истина;
	КонецЕсли; 
	
	Если ЕстьПоступление = Ложь И ТипЗнч(ДокументДвижения) = Тип("ДокументСсылка.ПоступлениеАвтомобилей") И ДокументДвижения.ПометкаУдаления = Ложь Тогда
		//Поступление планирование этапа
		Запрос = "/yii/api/tradeinStage/schedule?id=" + id_CRM + "&type=5";	
		СтруктураДанных = Новый Структура();  
		Если НачалоДня(ТекущаяДата()) > НачалоДня(ДокументДвижения.Дата) Тогда
			СтруктураДанных.Вставить("scheduleAt",Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy") + " " + Формат(КонецДня(ТекущаяДата()),"ДФ=ЧЧ:мм"));
		Иначе	
			СтруктураДанных.Вставить("scheduleAt",Формат(ДокументДвижения.Дата,"ДФ=dd.MM.yyyy") + " " + Формат(КонецДня(ДокументДвижения.Дата),"ДФ=ЧЧ:мм"));
		КонецЕсли;
		
		СтруктураДанных.Вставить("objectKey","1/" + АвтомобильCRM);  
		Если ЗначениеЗаполнено(ДокументДвижения.Комментарий) Тогда
			СтруктураДанных.Вставить("comment","Передан из 1С: документ № " + ДокументДвижения.Номер + " от " + Формат(ДокументДвижения.Дата,"ДФ=dd.MM.yyyy") + ", комментарий документа: " + ДокументДвижения.Комментарий);
		Иначе
			СтруктураДанных.Вставить("comment","Передан из 1С: документ № " + ДокументДвижения.Номер + " от " + Формат(ДокументДвижения.Дата,"ДФ=dd.MM.yyyy"));   
		КонецЕсли;
		
		ИдентификаторСотрудника = Инфотек_ОбщиеПроцедуры.ПолучитьИдентификаторСоответствияПоОбъекту(НастройкаПодключения,ДокументДвижения.Менеджер,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Сотрудник);
		Если ЗначениеЗаполнено(ИдентификаторСотрудника) Тогда
			СтруктураДанных.Вставить("assistantId",ИдентификаторСотрудника);
		КонецЕсли;
		
		ТелоЗапроса = Инфотек_JSON.мЗаписатьJSON(СтруктураДанных,Истина);
		Ответ = Инфотек_Запросы.POSTЗапрос(Запрос,НастройкаПодключения,ТелоЗапроса);				
		Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
			Результат = Истина;
		Иначе
			Результат = Ложь;
			Сообщить(Ответ.ПолучитьТелоКакСтроку());
		КонецЕсли;   
		ЭтапыРЛ = ПолучитьМассивСобытийПоИдентификаторуРабочегоЛиста(id_CRM,НастройкаПодключения);   
	КонецЕсли;
	
	Для Каждого ЭлМассива из ЭтапыРЛ Цикл
		Если ИдентификаторВСтроку(ЭлМассива.type) = "5" И ИдентификаторВСтроку(ЭлМассива.state) <> "4"  Тогда
			ИДЭтапа       = ИдентификаторВСтроку(ЭлМассива.id); 
			ИДПотребности = ИдентификаторВСтроку(ЭлМассива.client_vehicle_id);
			Если обЗначениеНеЗаполнено(ИДПотребности) Тогда
				ИДПотребности = ИдентификаторВСтроку(СтруктураРабочегоЛиста.result.Vehicle.id); 
			КонецЕсли;
			ИДМенеджера   = ИдентификаторВСтроку(ЭлМассива.assigneeId);	
			//Поступление завершение этапа
			Если (ТипЗнч(ДокументДвижения) = Тип("ДокументСсылка.ПоступлениеАвтомобилей") И ДокументДвижения.ПометкаУдаления = Истина) ИЛИ
				(ТипЗнч(ДокументДвижения) = Тип("ДокументСсылка.ВозвратПоставщикуАвтомобилей") И ДокументДвижения.ПометкаУдаления = Ложь) Тогда  				
				Запрос = "/yii/api/tradeinStage/cancel?id=" + ИДЭтапа;	
				СтруктураДанных = Новый Структура(); 
				Если ЗначениеЗаполнено(ДокументДвижения.Комментарий) Тогда
					СтруктураДанных.Вставить("comment","Передан из 1С: документ № " + ДокументДвижения.Номер + " от " + Формат(ДокументДвижения.Дата,"ДФ=dd.MM.yyyy") + ", комментарий документа: " + ДокументДвижения.Комментарий);
				Иначе
					СтруктураДанных.Вставить("comment","Передан из 1С: документ № " + ДокументДвижения.Номер + " от " + Формат(ДокументДвижения.Дата,"ДФ=dd.MM.yyyy"));   
				КонецЕсли;   
				
			ИначеЕсли ТипЗнч(ДокументДвижения) = Тип("ДокументСсылка.КорректировкаПоступленияАвтомобилей") И ДокументДвижения.ПометкаУдаления = Ложь Тогда 
				Для Каждого СтрокаАвтомобиля Из ДокументДвижения.Автомобили Цикл
					Если СтрокаАвтомобиля.Количество = 0 Тогда
						Запрос = "/yii/api/tradeinStage/cancel?id=" + ИДЭтапа;	
						СтруктураДанных = Новый Структура(); 
						Если ЗначениеЗаполнено(ДокументДвижения.Комментарий) Тогда
							СтруктураДанных.Вставить("comment","Передан из 1С: документ № " + ДокументДвижения.Номер + " от " + Формат(ДокументДвижения.Дата,"ДФ=dd.MM.yyyy") + ", комментарий документа: " + ДокументДвижения.Комментарий);
						Иначе
							СтруктураДанных.Вставить("comment","Передан из 1С: документ № " + ДокументДвижения.Номер + " от " + Формат(ДокументДвижения.Дата,"ДФ=dd.MM.yyyy"));   
						КонецЕсли;   
					КонецЕсли;
				КонецЦикла;
				
			Иначе
				Если ЭлМассива.state = "3" Тогда
					Сообщить("Этап рабочего листа Приём уже закрыт: " + ЭлМассива.closedAt);
					Возврат Истина;
				КонецЕсли;
				
				стАвтомобильCRM = ПолучитьСтруктуруАвтомобиляTradeInПоИдентификатору(ИДПотребности, НастройкаПодключения);
				Если стАвтомобильCRM.result.vin <> Автомобиль.VIN И НастройкаПодключения.ПроверятьСоответствиеVIN = Истина	Тогда
					Сообщить("Проведение невозможно! Не соответствие автомобиля в Поступлении автомобиля и в Рабочем листе TradeIn CRM № " + id_CRM); 
					Сообщить("Потребность 1С: " + Автомобиль.VIN + "; " + "Потребность CRM: " + стАвтомобильCRM.result.VIN);
					Возврат Ложь;
				КонецЕсли;
				
				СтруктураКлиента = ПолучитьСтруктуруКлиентаПоИдентификатору(ИдентификаторВСтроку(ЭлМассива.client_id),НастройкаПодключения);
				Клиент = СтруктураКлиента.result;
				СтруктураФизЛицо =  Клиент.primaryPerson;   
				Если НастройкаПодключения.ПроверятьСоответствиеТелефона = Истина Тогда 
					МассивТелефоны   =  СтруктураФизЛицо.phones;
					Если МассивТелефоны.Количество() = 0 Или МассивТелефоны = Неопределено Тогда
						СтруктураОрганизация =  Клиент.company;
						МассивТелефоны  = СтруктураОрганизация.phones;  					
					КонецЕсли; 
					Если МассивТелефоны.Количество() = 0 Или МассивТелефоны = Неопределено Тогда
						Сообщить("Проведение невозможно! В CRM системе не заполнен телефон контрагента в рабочем листе № " + id_CRM); 
						Возврат Ложь;
					КонецЕсли;
					
					ТелефоныСовпадают = Ложь;
					Для Каждого Эл Из МассивТелефоны Цикл
						Если ЗначениеЗаполнено(Эл.number) Тогда
							НомерТелефонаCRM = Эл.number;	 
							НомерТелефонаCRM = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьТелефонЦифрами(НомерТелефонаCRM);
							Если Лев(НомерТелефонаCRM,1) = "7" или Лев(НомерТелефонаCRM,1)= "8" Тогда
								НомерТелефонаCRM = Сред(НомерТелефонаCRM,2);
							КонецЕсли;  
							КонтактнаяИнформация = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьКИ(ДокументДвижения.Контрагент,Перечисления.ТипыКонтактнойИнформации.Телефон);
							Пока КонтактнаяИнформация.Следующий() Цикл
								НомерТелефона = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьТелефонЦифрами(КонтактнаяИнформация.Представление);
								Если Лев(НомерТелефона,1) = "7" или Лев(НомерТелефона,1)= "8" Тогда
									НомерТелефона = Сред(НомерТелефона,2);
								КонецЕсли; 						
								Если НомерТелефонаCRM = НомерТелефона Тогда
									ТелефоныСовпадают = Истина;
								КонецЕсли;
							КонецЦикла; 	
						КонецЕсли;
					КонецЦикла;        
					Если ТелефоныСовпадают = Ложь Тогда
						Сообщить("Проведение невозможно! Не совпадают телефоны клиента 1С и рабочего листа CRM № " + id_CRM); 
						Сообщить("Номер телефона 1С: " + НомерТелефона + "; " + "Номер телефона CRM: " + НомерТелефонаCRM);
						Возврат Ложь;
					КонецЕсли; 
				КонецЕсли; 
				
				Если НастройкаПодключения.ПроверятьСоответствиеEmail = Истина Тогда 
					emailCRM = СокрЛП(Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.email)); 
					emailСовпадают = Ложь;
					КонтактнаяИнформация = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьКИ(ДокументДвижения.Контрагент,Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
					Пока КонтактнаяИнформация.Следующий() Цикл  
						email = СокрЛП(КонтактнаяИнформация.Представление); 
						Если email = emailCRM Тогда
							emailСовпадают = Истина;
						КонецЕсли;
					КонецЦикла; 	   
					Если emailСовпадают = Ложь Тогда
						Сообщить("Проведение невозможно! Не совпадают email клиента 1С и рабочего листа CRM № " + id_CRM); 
						Сообщить("Email 1С: " + email + "; " + "Email CRM: " + emailCRM);
						Возврат Ложь;
					КонецЕсли; 
				КонецЕсли;
				
				Тип = Инфотек_ОбщиеПроцедуры.УбратьКавычки(Клиент.type);					
				Если Найти(Тип, "individual") <> 0 И НастройкаПодключения.ПроверятьСоответствиеФИО = Истина Тогда	
					Фамилия  = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.lastName);
					Имя      = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.firstName);
					Отчество = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураФизЛицо.middleName);	
					Наименование = Фамилия + " " + Имя + " " + Отчество;
					Если СокрЛП(Наименование) <> СокрЛП(ДокументДвижения.Контрагент.Наименование) Тогда
						Сообщить("Проведение невозможно! Не совпадают ФИО клиента 1С и рабочего листа CRM № " + id_CRM); 
						Сообщить("ФИО 1С: " + СокрЛП(ДокументДвижения.Контрагент.Наименование) + "; " + "ФИО CRM: " + Наименование);
						Возврат Ложь;
					КонецЕсли;
				КонецЕсли;
				
				Запрос = "/yii/api/tradeinStage/finish?id=" + ИДЭтапа;	
				СтруктураДанных = Новый Структура();
				Если НачалоДня(ТекущаяДата()) > НачалоДня(ДокументДвижения.Дата) Тогда
					СтруктураДанных.Вставить("scheduleAt", Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy") + " " + Формат(КонецДня(ТекущаяДата()),"ДФ=ЧЧ:мм"));
				Иначе	
					СтруктураДанных.Вставить("scheduleAt", Формат(ДокументДвижения.Дата,"ДФ=dd.MM.yyyy") + " " + Формат(КонецДня(ДокументДвижения.Дата),"ДФ=ЧЧ:мм"));
				КонецЕсли;
				
				СтруктураДанных.Вставить("acceptanceBuyPrice", СтрокаАвто.СуммаВсего);		
				СтруктураДанных.Вставить("acceptanceSellPrice", 1);      			
				Если ЗначениеЗаполнено(ДокументДвижения.Комментарий) Тогда
					СтруктураДанных.Вставить("comment","Передан из 1С: документ № " + ДокументДвижения.Номер + " от " + Формат(ДокументДвижения.Дата,"ДФ=dd.MM.yyyy") + ", комментарий документа: " + ДокументДвижения.Комментарий);
				Иначе
					СтруктураДанных.Вставить("comment","Передан из 1С: документ № " + ДокументДвижения.Номер + " от " + Формат(ДокументДвижения.Дата,"ДФ=dd.MM.yyyy"));   
				КонецЕсли;
				
				СтруктураДанных.Вставить("objectKey","1/" + ИДПотребности); // было "objectKey","2/"
				СтруктураДанных.Вставить("assistantId",ИДМенеджера);
			КонецЕсли;
			
			ТелоЗапроса = Инфотек_JSON.мЗаписатьJSON(СтруктураДанных,Истина);
			Ответ = Инфотек_Запросы.POSTЗапрос(Запрос,НастройкаПодключения,ТелоЗапроса);				
			Если Инфотек_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
				Результат = Истина;  
				Если СтрНайти(Ответ.ПолучитьТелоКакСтроку(),"""success"":false") > 0 Тогда
					Сообщить("Не удалось завершить этап Приём в CRM!" + Символы.ПС + Ответ.ПолучитьТелоКакСтроку());	
				КонецЕсли;			
				
			Иначе
				Результат = Ложь;
				Сообщить(Ответ.ПолучитьТелоКакСтроку());
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;      
	
	Если Результат = Ложь Тогда  
		Сообщить("Не найден этап Приём автомобиля в CRM, рабочий лист № " + id_CRM + "; " + " либо не удалось закрыть этап!");    
		Результат = Истина;
	КонецЕсли;
	Возврат Результат;
КонецФункции

