
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "Фотография" Тогда
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ИмяФайла = ПолучитьИмяВременногоФайла(ПолучитьРасширение(ТекущиеДанные.Фотография));
		ДвоичныеДанные = ПолучитьДвоичныеДанныеФотографии(ТекущиеДанные.Фотография);
		ДвоичныеДанные.Записать(ИмяФайла);
		ЗапуститьПриложение(ИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРасширение(Фотография)
	Возврат Фотография.Фотография.Расширение;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДвоичныеДанныеФотографии(Фотография)
	
	Возврат Фотография.Фотография.Получить();
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Автомобили") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Автомобили", Параметры.Автомобили);
		Автомобили.ЗагрузитьЗначения(Параметры.Автомобили);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	ПараметрыФормы = Новый Структура;
	Если Автомобили.Количество() = 0 Тогда
		Возврат;
	ИначеЕсли Автомобили.Количество() = 1 Тогда
		ПараметрыФормы.Вставить("Автомобиль", Автомобили[0].Значение);
	Иначе
		Автомобиль = ВыбратьИзСписка(Автомобили);
		Если ЗначениеЗаполнено(Автомобиль) Тогда
			ПараметрыФормы.Вставить("Автомобиль", Автомобиль);
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.Renault_ФотографииАвтомобилей.Форма.ФормаЗаписи", ПараметрыФормы);	
КонецПроцедуры
