Процедура УстановитьАвтоработы() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	OPERACODE_НормыРабот.Период,
	|	OPERACODE_НормыРабот.КодПоКаталогу,
	|	OPERACODE_НормыРабот.Ранг,
	|	ВЫБОР
	|		КОГДА Автоработы.Ссылка ЕСТЬ NULL 
	|			ТОГДА ЗНАЧЕНИЕ(справочник.Автоработы.ПустаяСсылка)
	|		ИНАЧЕ Автоработы.Ссылка
	|	КОНЕЦ КАК Авторабота,
	|	OPERACODE_НормыРабот.Нормочас,
	|	OPERACODE_НормыРабот.ВидРабот,
	|	OPERACODE_НормыРабот.СложностьРабот,
	|	OPERACODE_НормыРабот.Наименование,
	|	OPERACODE_НормыРабот.НаименованиеПолное,
	|	OPERACODE_НормыРабот.ВидНормировки
	|ИЗ
	|	РегистрСведений.OPERACODE_НормыРабот КАК OPERACODE_НормыРабот
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Автоработы КАК Автоработы
	|		ПО OPERACODE_НормыРабот.Авторабота = Автоработы.Ссылка"
	);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	НЗ = СоздатьНаборЗаписей();
	
	НЗ.Прочитать();
	НЗ.Загрузить(Выгрузка);
	НЗ.Записать();
	
	//Для каждого СтрокаАвторабот из СписокАвторабот Цикл
	//	
	//	МЗ = СоздатьМенеджерЗаписи();
	//	
	//	//Заполняем все ключи кроме автоработы и считываем запись
	//	ЗаполнитьЗначенияСвойств(МЗ, СтрокаАвторабот,,"Авторабота");
	//	МЗ.Прочитать();
	//	
	//	//Проставляем автоработу в запись и записываем
	//	//Проверку на существование записи не делаем - она точно есть!
	//	ЗаполнитьЗначенияСвойств(МЗ, СтрокаАвторабот,"Авторабота");
	//	МЗ.Записать();
	//	
	//КонецЦикла;
	
КонецПроцедуры
