
&НаКлиенте
Процедура ОтменитьВсе(Команда)
	ВыбранныеАвто.ЗаполнитьПометки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	ВыбранныеАвто.ЗаполнитьПометки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	Закрыть(ВыбранныеАвто);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Авто") Тогда
		ВыбранныеАвто.ЗагрузитьЗначения(Параметры.Авто);
		ВыбранныеАвто.ЗаполнитьПометки(Истина);
	КонецЕсли;
КонецПроцедуры
