//---интерфейс---
&Клиент
Функция ОткрытьФормуБазыДанных() Экспорт ОткрытьФорму("ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.БазыДанных.ФормаСписка") КонецФункции
&Клиент
Функция ОткрытьФормуОбъектыМД() Экспорт //ОткрытьФорму("ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.ОбъектыМД.ФормаСписка") КонецФункции
КонецФункции
&Клиент
Функция ОткрытьФормуРеквизитыОбъектовМД() Экспорт ОткрытьФорму("ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.РеквизитыМД.ФормаСписка") КонецФункции
&Клиент
Функция ОткрытьФормуСсылки() Экспорт ОткрытьФорму("ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.Ссылки.ФормаСписка") КонецФункции
&Клиент
Функция ОткрытьФормуСправочники() Экспорт ОткрытьФорму("ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.Справочники.ФормаСписка") КонецФункции
&Клиент
Функция ОткрытьФормуДокументы() Экспорт ОткрытьФорму("ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.Документы.ФормаСписка") КонецФункции
&Клиент
Функция ОткрытьФормуЗагрузкаДанных() Экспорт ОткрытьФорму("Справочник.Renault_КонвертацияДанных.Форма.ЗагрузкаДанных") КонецФункции
&Клиент
Функция ОткрытьФормуВыгрузкаДанных() Экспорт ОткрытьФорму("ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.ОбъектыМД.Форма.ВыгрузкаДанных") КонецФункции
&НаКлиенте
Функция ПоказатьСправку(ФормаВладелец,Текст,Заголовок) Экспорт
	Если Renault_ОбщиеФункции.СтараяПлатформа() Тогда Возврат Неопределено 
	Иначе
		Выполнить("ОткрытьФорму(""ОбщаяФорма.Renault_СообщениеHTML"",Новый Структура(""Текст,Заголовок"",Текст,Заголовок),ФормаВладелец,ФормаВладелец.УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.Независимый) ");
	КонецЕсли;
КонецФункции

//---Общие функции---
Функция СоставМетаданных() Экспорт //то чем планируем обмениваться
	Стр=Новый Структура;
	Стр.Вставить("Справочник","Справочники");
	Стр.Вставить("Документ","Документы");
	Стр.Вставить("БизнесПроцесс","БизнесПроцессы");
	Стр.Вставить("Задача","Задачи");
	Стр.Вставить("ПланСчетов","ПланыСчетов");
	Стр.Вставить("ПланОбмена","ПланыОбмена");
	Стр.Вставить("ПланВидовХарактеристик","ПланыВидовХарактеристик");
	Стр.Вставить("РегистрСведений","РегистрыСведений");
	//Стр.Вставить("WSСсылка","WSСсылки");
	//Стр.Вставить("WebСервис","WebСервисы");
	//Стр.Вставить("ВнешнийИсточникДанных","ВнешниеИсточникиДанных");
	//Стр.Вставить("Константа","Константы");
	//Стр.Вставить("Обработка","Обработки");
	//Стр.Вставить("Перечисление","Перечисления");
	//Стр.Вставить("ПланВидовРасчета","ПланыВидовРасчета");
	Возврат Стр
КонецФункции
Функция ИндексКартинкиМД(ТипСтр) Экспорт
	Если ТипСтр="Справочник" Тогда Возврат 14
	ИначеЕсли ТипСтр="Документ" Тогда Возврат 15
	ИначеЕсли ТипСтр="БизнесПроцесс" Тогда Возврат 16
	ИначеЕсли ТипСтр="Задача" Тогда Возврат 17
	ИначеЕсли ТипСтр="ПланСчетов" Тогда Возврат 18
	ИначеЕсли ТипСтр="ПланОбмена" Тогда Возврат 19
	ИначеЕсли ТипСтр="ПланВидовХарактеристик" Тогда Возврат 20
		
	ИначеЕсли ТипСтр="Реквизит" Тогда Возврат 22
	ИначеЕсли ТипСтр="Элемент" Тогда Возврат 22
	ИначеЕсли ТипСтр="ТабличнаяЧасть" Тогда Возврат 21
	ИначеЕсли ТипСтр="РегистрСведений" Тогда Возврат 13 
	ИначеЕсли ТипСтр="ВнешнийИсточникДанных" Тогда Возврат 12
		
	//ИначеЕсли ТипСтр="WSСсылка" Тогда Возврат
	//ИначеЕсли ТипСтр="WebСервис" Тогда Возврат
	//ИначеЕсли ТипСтр="Константа" Тогда Возврат
	//ИначеЕсли ТипСтр="Обработка" Тогда Возврат
	ИначеЕсли ТипСтр="Перечисление" Тогда Возврат 11
	ИначеЕсли ТипСтр="ПланВидовРасчета" Тогда Возврат 21
	
	Иначе Возврат 0 	
	КонецЕсли;	
КонецФункции	
Функция ОписаниеТиповВСтроку(Типы) Экспорт
	Индекс=Типы.Найти(Тип("Null")); Если Индекс<>Неопределено Тогда Типы.Удалить(Индекс) КонецЕсли; //удалить тип NULL для наглядности
	МассивСтрТипов=Новый Массив;
	Для Каждого Тип Из Типы Цикл
		СтрТип=Renault_ПередачаДанныхВСторонниеСистемы.ТипЗначенияВМетаданныеСтрокой(Тип);
		МассивСтрТипов.Добавить(?(СтрТип=Неопределено,Строка(Тип),СтрТип)) 
	КонецЦикла;
	Возврат Renault_ПередачаДанныхВСторонниеСистемы.МассивВСтроку(МассивСтрТипов,Символы.ПС)
КонецФункции	
Функция ПодключениеУстановлено() Экспорт
	Если ВнешниеИсточникиДанных.Renault_ПередачаДанныхВСторонниеСистемы.ПолучитьСостояние()=СостояниеВнешнегоИсточникаДанных.Подключен Тогда Возврат Истина
	Иначе
		//попытка подключения с общими параметрами
		Парам=ВнешниеИсточникиДанных.Renault_ПередачаДанныхВСторонниеСистемы.ПолучитьОбщиеПараметрыСоединения();
		Если Парам.СтрокаСоединения="" Тогда Возврат Ложь КонецЕсли;
		Попытка
			ВнешниеИсточникиДанных.Renault_ПередачаДанныхВСторонниеСистемы.УстановитьСоединение();
			Возврат ВнешниеИсточникиДанных.Renault_ПередачаДанныхВСторонниеСистемы.ПолучитьСостояние()=СостояниеВнешнегоИсточникаДанных.Подключен
		Исключение
			Сообщить("Соединение с внешним источников данных Renault_ПередачаДанныхВСторонниеСистемы не установлено. "+ОписаниеОшибки(),СтатусСообщения.Внимание);
			Возврат Ложь
		КонецПопытки;	
	КонецЕсли;	
	//Возврат ВнешниеИсточникиДанных.Renault_ПередачаДанныхВСторонниеСистемы.ПолучитьСостояние()=СостояниеВнешнегоИсточникаДанных.Подключен
КонецФункции
Функция ИдентификаторБазы() Экспорт //установить/получить уникальный идентификатор базы - как поле в таблице объектов метаданных ОбъектыМД
	Если НЕ ЗначениеЗаполнено(Константы.DMS_ИдентификаторБазы.Получить()) Тогда
		Константы.DMS_ИдентификаторБазы.Установить(Новый УникальныйИдентификатор)
	КонецЕсли;
	Возврат Константы.DMS_ИдентификаторБазы.Получить() 
КонецФункции	
Функция ТекущаяБазаДанных() Экспорт
	UUID=ИдентификаторБазы();
	//ИБ=ВнешниеИсточникиДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблицы.БазыДанных.ПолучитьСсылку(UUID);
	//Если ИБ.Пустая() Тогда 
	Запрос=Новый Запрос("Выбрать Ссылка Из ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.БазыДанных ГДЕ ИдентификаторБазы=&UUID");
	Запрос.УстановитьПараметр("UUID",UUID);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда Возврат Выборка.Ссылка 
	Иначе	
		ИБ=ВнешниеИсточникиДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблицы.БазыДанных.СоздатьОбъект();
		ИБ.ИдентификаторБазы=UUID;
		ИБ.Имя=Метаданные.Имя;
		ИБ.Записать();
		Возврат ИБ.Ссылка
	КонецЕсли;
КонецФункции	
//Функция СтруктураМетаданных(Знач ИмяМД) Экспорт
//	Для Каждого Эл Из СоставМетаданных() Цикл ИмяМД=СтрЗаменить(ИмяМД,Эл.Ключ+".",Эл.Значение+".") КонецЦикла;	
//	ИмяМД=СтрЗаменить(ИмяМД,".",Символы.ПС);
//	ИмяТЧ=СтрПолучитьСтроку(ИмяМД,3);
//	Возврат Новый Структура("Тип,Вид,Таблица",СтрПолучитьСтроку(ИмяМД,1),СтрПолучитьСтроку(ИмяМД,2),?(ИмяТЧ="",Неопределено,ИмяТЧ))
//КонецФункции	
Функция СтруктураМетаданных(ИмяМД,Менеджер=Ложь) Экспорт
	Попытка
		Стр=СтрЗаменить(ИмяМД,".",Символы.ПС);
		Тип=СтрПолучитьСтроку(Стр,1);
		ТипМД=СоставМетаданных()[Тип];
		Вид=СтрПолучитьСтроку(Стр,2);
		ИмяТЧ=СтрПолучитьСтроку(Стр,3);
		СтруктураМД=Новый Структура("Тип,ТипМД,Вид,Таблица",Тип,ТипМД,Вид,Неопределено);
		Если ИмяТЧ<>"" Тогда СтруктураМД.Вставить("Таблица",ИмяТЧ) КонецЕсли;
		Если Менеджер Тогда 
			ТипМ=Вычислить(ТипМД);
			СтруктураМД.Вставить("Менеджер",ТипМ[Вид]) КонецЕсли;
		Возврат СтруктураМД
	Исключение
		Сообщить("Не определены метаданные <"+ИмяМД+"> в составе метаданных для обмена",СтатусСообщения.Внимание);
		Возврат Неопределено
	КонецПопытки
КонецФункции	
Функция МетаданныеИзСтроки(ИмяМД) Экспорт
	СтруктураМД=СтруктураМетаданных(ИмяМД);
	Таблица=?(СтруктураМД.Таблица=Неопределено,"",".ТабличныеЧасти."+СтруктураМД.Таблица);
	Попытка Возврат Вычислить("Метаданные."+СтруктураМД.ТипМД+"."+СтруктураМД.Вид+Таблица) Исключение Возврат Неопределено КонецПопытки;	
КонецФункции	
Функция СсылкаВМетаданныеСтрокой(Ссылка) Экспорт
	МД=Метаданные.НайтиПоТипу(ТипЗнч(Ссылка));
	Если МД=Неопределено Тогда Возврат Неопределено КонецЕсли;
	СтрокаТип=МД.ПолноеИмя();
	Если Найти(СтрокаТип,"Перечисление.")>0 Тогда
		Значение=МД.ЗначенияПеречисления[Перечисления[МД.Имя].Индекс(Ссылка)];
		Возврат "Перечисление."+МД.Имя+"."+Значение.Имя
	КонецЕсли;
	Возврат СтрокаТип
КонецФункции
Функция ТипЗначенияВМетаданныеСтрокой(Тип) Экспорт МД=Метаданные.НайтиПоТипу(Тип); Если МД=Неопределено Тогда Возврат Неопределено Иначе Возврат МД.ПолноеИмя() КонецЕсли КонецФункции
Функция ИмяВнешнейТаблицы(ИмяМД) Если Найти(ИмяМД,"Документ.")>0 Тогда Возврат "Документы" Иначе Возврат "Справочники" КонецЕсли КонецФункции //что не документ то справочник
Функция ОбъектМД(ИмяМД)
	Запрос=Новый Запрос("Выбрать Ссылка Из ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.ОбъектыМД Где БазаДанных.ИдентификаторБазы=&ИдентификаторБазы И Имя=&ИмяМД И Активно");
	Запрос.УстановитьПараметр("ИмяМД",ИмяМД);
	Запрос.УстановитьПараметр("ИдентификаторБазы",ИдентификаторБазы());
	Выборка=Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка
КонецФункции	
Функция РеквизитыОбъекта(ИмяМД)
	Запрос=Новый Запрос("Выбрать Ссылка Из ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.РеквизитыМД Где ОбъектМД.БазаДанных.ИдентификаторБазы=&ИдентификаторБазы И ОбъектМД.Имя=&ИмяМД И Активно");
	Запрос.УстановитьПараметр("ИмяМД",ИмяМД);
	Запрос.УстановитьПараметр("ИдентификаторБазы",ИдентификаторБазы());
	Результат=Запрос.Выполнить();
	Если Результат.Пустой() Тогда Возврат Новый Массив КонецЕсли;
	Возврат Результат.Выгрузить().ВыгрузитьКолонку("Ссылка")
КонецФункции
Функция ТабличныеЧастиОбъекта(ИмяМД)
	Запрос=Новый Запрос("Выбрать Ссылка Из ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.ОбъектыМД Где БазаДанных.ИдентификаторБазы=&ИдентификаторБазы И Имя Подобно &ИмяМД И Активно");
	Запрос.УстановитьПараметр("ИмяМД",ИмяМД+".%");
	Запрос.УстановитьПараметр("ИдентификаторБазы",ИдентификаторБазы());
	Результат=Запрос.Выполнить();
	Если Результат.Пустой() Тогда Возврат Новый Массив КонецЕсли;
	Возврат Результат.Выгрузить().ВыгрузитьКолонку("Ссылка")
КонецФункции	
Функция СтруктураРеквизитовОбъектаМД(ОбъектМД) Экспорт //Структура реквизитов  (ИмяРеквизита + ТипЗначения)
	Перем ТекстЗапросаПоМД;
	ЕстьОшибки=Ложь;
	
	Если ТипЗнч(ОбъектМД)=Тип("Строка") Тогда //для метаданных строкой
		МД=МетаданныеИзСтроки(ОбъектМД);
		Если МД=Неопределено Тогда 
			Сообщить("Метаданные <"+ОбъектМД+"> не определены",СтатусСообщения.Внимание); 
			Возврат Ложь 
		КонецЕсли;
		
		Реквизиты=СписокПредопределенныхРеквизитов(ОбъектМД);
		Для Каждого Реквизит Из МД.Реквизиты Цикл Реквизиты.Добавить(Реквизит.Имя) КонецЦикла;
		
		ТекстЗапросаПоМД="Выбрать Первые 1 "+МассивВСтроку(Реквизиты,","+Символы.ПС+Символы.Таб)+" Из "+ОбъектМД;
		
	ИначеЕсли ПустаяСтрока(ОбъектМД.ТекстЗапроса) Тогда
	//по метаданным
	
		МД=Renault_ПередачаДанныхВСторонниеСистемы.МетаданныеИзСтроки(ОбъектМД.Имя);
		Если МД=Неопределено Тогда 
			Сообщить("Метаданные <"+ОбъектМД.Имя+"> не определены",СтатусСообщения.Внимание); 
			Возврат Ложь 
		КонецЕсли;
		
		//список реквизитов записанных во ВнешнийИсточникДанных
		Запрос=Новый Запрос("Выбрать Имя Из ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.РеквизитыМД Где ОбъектМД.БазаДанных.ИдентификаторБазы=&ИдентификаторБазы И Активно И ОбъектМД=&ОбъектМД");
		Запрос.УстановитьПараметр("ОбъектМД",ОбъектМД.Ссылка);
		Запрос.УстановитьПараметр("ИдентификаторБазы",ИдентификаторБазы());
		Реквизиты=Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Имя");
		
		//Если Реквизиты.Количество()=0 Тогда //если реквизиты не записаны то обязательные реквизиты
		//	Реквизиты=СписокПредопределенныхРеквизитов(ОбъектМД.Имя);
			Если Реквизиты.Количество()=0 Тогда Возврат Новый Структура	КонецЕсли; //если нет обязательных то это табличная часть
		//КонецЕсли;
		
		//проверяем рекувизиты
		Для Каждого Реквизит Из Реквизиты Цикл
			Если МД.Реквизиты.Найти(Реквизит)=Неопределено И СписокПредопределенныхРеквизитов(ОбъектМД.Имя).НайтиПоЗначению(Реквизит)=Неопределено Тогда
				ЕстьОшибки=Истина;
				Сообщить("Не найден реквизит <"+Реквизит+">",СтатусСообщения.Внимание);
			КонецЕсли;
		КонецЦикла;	
		ТекстЗапросаПоМД="Выбрать Первые 1 "+МассивВСтроку(Реквизиты,","+Символы.ПС+Символы.Таб)+" Из "+ОбъектМД.Имя;
	Иначе
	//по запросу
		ТекстЗапросаПоМД="Выбрать Первые 1"+Символы.ПС+Сред(СокрЛП(ОбъектМД.ТекстЗапроса),8);
	КонецЕсли;	
	
	Попытка
		СтрМетаданных=Новый Структура;		
		Запрос=Новый Запрос(ТекстЗапросаПоМД);
		Запрос.УстановитьПараметр("Ссылка",NULL); //предопределенный параметр
		Для Каждого Кол Из Запрос.Выполнить().Выгрузить().Колонки Цикл СтрМетаданных.Вставить(Кол.Имя,Кол.ТипЗначения) КонецЦикла;	
	Исключение
		Сообщить("Ошибка определения структуры реквизитов объекта <"+ОбъектМД+">. "+ОписаниеОшибки(),СтатусСообщения.Внимание);
		Возврат Ложь
	КонецПопытки;	
	
	Возврат ?(ЕстьОшибки,Ложь,СтрМетаданных)
КонецФункции	
Функция СписокПредопределенныхРеквизитов(ИмяМД,ДляЧтения=Ложь) Экспорт //предопределенные реквизиты объектов
	Сп=Новый СписокЗначений;
	МД=МетаданныеИзСтроки(ИмяМД);
	Если МД<>Неопределено Тогда
		СтруктураМД=СтруктураМетаданных(ИмяМД);
		//ВидЗаписи=ВидыЗаписей();
		Если СтруктураМД.Таблица=Неопределено Тогда
			
			Если ДляЧтения Тогда 
				Сп.Добавить("Ссылка");
				Сп.Добавить("Представление");
				Сп.Добавить("ПометкаУдаления");
				Сп.Добавить("ВерсияДанных");
			КонецЕсли;
			
			//Если Найти(ИмяМД,"Справочник.")>0 Тогда
			Если СтруктураМД.Тип="Справочник" Тогда
				Если МД.ДлинаКода>0 Тогда Сп.Добавить("Код") КонецЕсли;
				Если МД.ДлинаНаименования>0 Тогда Сп.Добавить("Наименование") КонецЕсли;
				Если МД.Владельцы.Количество()>0 Тогда Сп.Добавить("Владелец") КонецЕсли;
				Если МД.Иерархический Тогда 
					Сп.Добавить("Родитель");
					Если ДляЧтения И МД.ВидИерархии=Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда Сп.Добавить("ЭтоГруппа") КонецЕсли;
				КонецЕсли;
				Если ДляЧтения Тогда Сп.Добавить("Предопределенный") КонецЕсли;
				
			//ИначеЕсли Найти(ИмяМД,"Документ.")>0 Тогда
			ИначеЕсли СтруктураМД.Тип="Документ" Тогда
				Если МД.ДлинаНомера>0 Тогда Сп.Добавить("Номер") КонецЕсли;
				Сп.Добавить("Дата");
				Если ДляЧтения Тогда Сп.Добавить("Проведен") КонецЕсли;
				
			//ИначеЕсли Найти(ИмяМД,"БизнесПроцесс.")>0 Тогда
			ИначеЕсли СтруктураМД.Тип="БизнесПроцесс" Тогда
				Если МД.ДлинаНомера>0 Тогда Сп.Добавить("Номер") КонецЕсли;
				Сп.Добавить("Дата");
				Сп.Добавить("Завершен");
				Сп.Добавить("ВедущаяЗадача");
				Сп.Добавить("Стартован");
				
			//ИначеЕсли Найти(ИмяМД,"Задача.")>0 Тогда
			ИначеЕсли СтруктураМД.Тип="Задача" Тогда
				Если МД.ДлинаНомера>0 Тогда Сп.Добавить("Номер") КонецЕсли;
				Если МД.ДлинаНаименования>0 Тогда Сп.Добавить("Наименование") КонецЕсли;
				Сп.Добавить("Дата");
				Сп.Добавить("Выполнена");
				Если Метаданные.БизнесПроцессы.Количество()>0 Тогда
					Сп.Добавить("БизнесПроцесс");
					Сп.Добавить("ТочкаМаршрута");
				КонецЕсли;	
				
			//ИначеЕсли Найти(ИмяМД,"ПланСчетов.")>0 Тогда
			ИначеЕсли СтруктураМД.Тип="ПланСчетов" Тогда
				Сп.Добавить("Родитель");
				Если МД.ДлинаКода>0 Тогда Сп.Добавить("Код") КонецЕсли;
				Если МД.ДлинаНаименования>0 Тогда Сп.Добавить("Наименование") КонецЕсли;
				Сп.Добавить("Вид");
				Сп.Добавить("Забалансовый");
				
			//ИначеЕсли Найти(ИмяМД,"ПланОбмена.")>0 Тогда
			ИначеЕсли СтруктураМД.Тип="ПланОбмена" Тогда
				Если МД.ДлинаКода>0 Тогда Сп.Добавить("Код") КонецЕсли;
				Если МД.ДлинаНаименования>0 Тогда Сп.Добавить("Наименование") КонецЕсли;
				Сп.Добавить("НомерОтправленного");
				Сп.Добавить("НомерПринятого");
				Если ДляЧтения Тогда Сп.Добавить("ЭтотУзел") КонецЕсли;
				
			//ИначеЕсли Найти(ИмяМД,"ПланВидовХарактеристик.")>0 Тогда
			ИначеЕсли СтруктураМД.Тип="ПланВидовХарактеристик" Тогда
				Если МД.ДлинаКода>0 Тогда Сп.Добавить("Код") КонецЕсли;
				Если МД.ДлинаНаименования>0 Тогда Сп.Добавить("Наименование") КонецЕсли;
				Если ДляЧтения Тогда
					Сп.Добавить("ТипЗначения");
					Сп.Добавить("Предопределенный");
				КонецЕсли;
				
			//ИначеЕсли Найти(ИмяМД,"РегистрСведений.")>0 Тогда
			ИначеЕсли СтруктураМД.Тип="РегистрСведений" Тогда
				Если МД.ПериодичностьРегистраСведений<>Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда Сп.Добавить("Период") КонецЕсли;
				Если МД.РежимЗаписи=Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору Тогда Сп.Добавить("Регистратор") КонецЕсли;
				Для Каждого Измерение Из МД.Измерения Цикл Сп.Добавить(Измерение.Имя) КонецЦикла;
				Для Каждого Ресурс Из МД.Ресурсы Цикл Сп.Добавить(Ресурс.Имя) КонецЦикла;
				//Для Каждого Реквизит Из МД.Реквизиты Цикл Сп.Добавить(Реквизит.Имя) КонецЦикла;
				
			//ИначеЕсли Найти(ИмяМД,"WSСсылка.")>0 Тогда
			//ИначеЕсли Найти(ИмяМД,"WebСервис.")>0 Тогда
			//ИначеЕсли Найти(ИмяМД,"ВнешнийИсточникДанных.")>0 Тогда
			//ИначеЕсли Найти(ИмяМД,"Константа.")>0 Тогда
			//ИначеЕсли Найти(ИмяМД,"Обработка.")>0 Тогда
			//ИначеЕсли Найти(ИмяМД,"Перечисление.")>0 Тогда
			//ИначеЕсли Найти(ИмяМД,"ПланВидовРасчета.")>0 Тогда
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
	Возврат Сп
КонецФункции
//Функция ПолныйСписокРеквизитовПоМетаданным(ИмяМД,ДляЧтения=Ложь) Экспорт
//	сп=СписокПредопределенныхРеквизитов(ИмяМД,ДляЧтения);
//	МД=МетаданныеИзСтроки(ИмяМД);
//	Для Каждого Реквизит Из МД.Реквизиты Цикл Сп.Добавить(Реквизит.Имя) КонецЦикла;
//	Возврат сп
//КонецФункции	
Функция МассивВСтроку(Массив,Разделитель) Экспорт Стр=""; Для Каждого Эл Из Массив Цикл Стр=Стр+Разделитель+Эл КонецЦикла; Возврат Сред(Стр,СтрДлина(Разделитель)+1) КонецФункции
//Функция СтруктураЗапроса(Знач ТекстЗапроса)
//	Структура=Новый Структура;
//	
//	ТекстЗапроса=СтрЗаменить(ТекстЗапроса,",",Символы.ПС);
//	ТекстЗапроса=СтрЗаменить(ТекстЗапроса," ",Символы.ПС);
//	МассивПолей=Новый Массив;
//	ЧислоСтрок=СтрЧислоСтрок(ТекстЗапроса);
//	
//	Для Н=1 По ЧислоСтрок Цикл
//		Стр=СтрПолучитьСтроку(ТекстЗапроса,Н);
//		Если Стр="" Тогда Продолжить КонецЕсли;
//		
//		Если Врег(Стр)="ВЫБРАТЬ" Тогда
//			Для НН=Н+1 По ЧислоСтрок Цикл
//				Стр=СтрПолучитьСтроку(ТекстЗапроса,НН);
//				
//				ЭтоЧисло=Ложь; Попытка ы=Число(Лев(Стр,1)); ЭтоЧисло=Истина Исключение КонецПопытки; 
//				Если Число(Лев(Стр,1)) Тогда Продолжить КонецЕсли;
//				
//				Если Врег(Стр)="КАК" Тогда Продолжить
//				ИначеЕсли Врег(Стр)="ПЕРВЫЕ" Тогда Продолжить
//				ИначеЕсли Врег(Стр)="ПОМЕСТИТЬ" Тогда Продолжить
//				ИначеЕсли Врег(Стр)="ИЗ" Тогда
//					//источник данных
//					СтрИсточник="";
//					Для ННН=НН+1 По ЧислоСтрок Цикл
//						Стр=СтрПолучитьСтроку(ТекстЗапроса,ННН);
//						
//						Если Врег(Стр)="КАК" Тогда Продолжить
//						ИначеЕсли Врег(Стр)="ГДЕ" Тогда
//							//условия
//							
//							СтрУсловия="";
//							Для НННН=ННН+1 По ЧислоСтрок Цикл
//								Стр=СтрПолучитьСтроку(ТекстЗапроса,НННН);
//								
//							КонецЦикла;	
//							ННН=НННН;
//							
//						КонецЕсли;	
//						СтрИсточник=СтрИсточник+?(СтрИсточник="",""," ")+Стр;
//						
//					КонецЦикла;
//					НН=ННН;
//				КонецЕсли;
//				
//				//поля
//				Если МассивПолей.Найти(Стр)=Неопределено Тогда МассивПолей.Добавить(Стр) КонецЕсли;
//			КонецЕсли;
//			Н=НН;
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	Структура.Вставить("Поля",МассивПолей);
//	Возврат Структура
//КонецФункции
Функция СписокПолейЗапроса(Знач ТекстЗапроса)
	ТекстЗапроса=СтрЗаменить(ТекстЗапроса,",",Символы.ПС);
	ТекстЗапроса=СтрЗаменить(ТекстЗапроса," ",Символы.ПС);
	Массив=Новый Массив;
	Для Н=1 По СтрЧислоСтрок(ТекстЗапроса) Цикл
		Стр=СтрПолучитьСтроку(ТекстЗапроса,Н);
		Если Стр="" Тогда Продолжить КонецЕсли;
		Если Врег(Стр)="ВЫБРАТЬ" Тогда Продолжить КонецЕсли;
		Если Врег(Стр)="КАК" Тогда Продолжить КонецЕсли;
		Если Врег(Стр)="ПЕРВЫЕ" Тогда Продолжить КонецЕсли;
		ЭтоЧисло=Ложь; Попытка ы=Число(Лев(Стр,1)); ЭтоЧисло=Истина Исключение КонецПопытки; 
		Если Число(Лев(Стр,1)) Тогда Продолжить КонецЕсли;
		Если Врег(Стр)="ИЗ" Тогда Прервать КонецЕсли;
		Если Врег(Стр)="ПОМЕСТИТЬ" Тогда Прервать КонецЕсли;
		Если Массив.Найти(Стр)=Неопределено Тогда Массив.Добавить(Стр) КонецЕсли
	КонецЦикла;
	Возврат Массив
КонецФункции	
Функция СтруктураЗапроса(ТекстЗапроса)
	Структура=Новый Структура;
	
	Стр=Врег(ТекстЗапроса);
	Стр=СтрЗаменить(Стр,Символы.ПС," ");
	
	ПозУсловия=Найти(Стр," ГДЕ ");
	Если ПозУсловия>0 Тогда
		СтрУсловий=СокрЛП(Сред(Стр,ПозУсловия+5));
		Структура.Вставить("Условия",СтрУсловий);
		Стр=Лев(Стр,ПозУсловия-1);
	КонецЕсли;	
	
	ПозИЗ=Найти(Стр," ИЗ ");
	Стр=Сред(Стр,ПозИЗ+4);
	СтрИсточник=СокрЛП(?(ПозУсловия=0,Стр,Лев(Стр,ПозУсловия-1)));
	Структура.Вставить("ИсточникДанных",СтрИсточник);
	
	Возврат Структура
КонецФункции	

//---функции выгрузки---
//*************************************************************
//подписка на событие при записи 
Процедура ВыполнитьПередачуДанных(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт //Подписка на событие ПриЗаписи Справочников и возможно Документов
     	
	Если Источник.ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	//Бондаренко++ 20260603
	Если ТипЗНЧ(Источник)=Тип("ДокументОбъект.АктЛогиста") Тогда
		Возврат;
 	КонецЕсли;
	//Бондаренко-- 20260603
	
	Если Не Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ИспользуетсяВыгрузкаДанных Тогда Возврат КонецЕсли;
	//справочники в подписку пока не попадают, документы обрабатываем по событию проведение и отмена проведения
	Если Источник.Ссылка.Пустая() Или РежимЗаписи=РежимЗаписиДокумента.Запись Тогда Возврат КонецЕсли;
	
	//если метаданные объекта не описаны в обмене - выходим
	Если ОбъектМД(СсылкаВМетаданныеСтрокой(Источник.Ссылка))=Неопределено Тогда Возврат КонецЕсли;
	
	Массив=Новый Массив;
	Массив.Добавить(Источник);
	Если Не ВыгрузкаВыполнена(Массив) Тогда Отказ=Истина; КонецЕсли;
КонецПроцедуры
Процедура ВыполнитьПередачуДанныхРегистрСведений(Источник, Отказ, Замещение) Экспорт //Подписка на событие ПриЗаписи РегистровСведений
	//Если Не Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ИспользуетсяВыгрузкаДанных Тогда Возврат КонецЕсли;
	//
	////если метаданные объекта не описаны в обмене - выходим
	//Если ОбъектМД(СсылкаВМетаданныеСтрокой(Источник))=Неопределено Тогда Возврат КонецЕсли;
	//
	//Массив=Новый Массив;
	//Массив.Добавить(Источник);
	//Если Не ВыгрузкаВыполнена(Массив,Замещение) Тогда Отказ=Истина; КонецЕсли;
КонецПроцедуры

//внешний вызов выгрузки по источникам
Функция ВыгрузкаВыполнена(Источники,Перезапись=Ложь) Экспорт //Источники - Выборка с полем ссылки или массив Ссылок
	СоответствиеСсылок=Новый Соответствие;
	НомерПакета=ТекущаяДата();
	Для Каждого Источник Из Источники Цикл
		Попытка //у источника может не быть ссылки (РегистрСведений)
			Если СоответствиеСсылок.Получить(Источник.Ссылка)<>Неопределено Тогда Продолжить КонецЕсли; //Ссылка уже загружена
		Исключение КонецПопытки; 
		
		Если ТипЗнч(Источник)=Тип("ВнешнийИсточникДанныхТаблицаСсылка.Renault_ПередачаДанныхВСторонниеСистемы.ОбъектыМД") Тогда 
		//явно указанный ВнешнийИсточникДанных	
			Если СтруктураМетаданных(Источник.Имя).Тип="РегистрСведений" Тогда
				//РегистрСведений
				внСсылка=ПолучитьВнешнююСсылкуРегистраСведений(Источник,НомерПакета);
				Если внСсылка=Неопределено Тогда Возврат Ложь КонецЕсли;
				Если Не ЗаписатьВнешниеДанныеРегистраСведений(Источник,Неопределено,внСсылка,НомерПакета,СоответствиеСсылок,Перезапись) Тогда Возврат Ложь КонецЕсли;
			Иначе //Объектный тип (Справочник, Док... )
				Запрос=Новый Запрос("Выбрать Ссылка Из "+Источник.Имя);
				Выборка=Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					Если ПолучитьВнешнееЗначение(Выборка.Ссылка,НомерПакета,СоответствиеСсылок,Перезапись)=Неопределено Тогда Возврат Ложь КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;	
			
		ИначеЕсли Метаданные.РегистрыСведений.Содержит(Источник.Метаданные()) Тогда
		//РегистрыСведений
		
			ИмяМД=СсылкаВМетаданныеСтрокой(Источник);
			ОбъектМД=ОбъектМД(ИмяМД);
		
			внСсылка=ПолучитьВнешнююСсылкуРегистраСведений(ОбъектМД,НомерПакета);
			Если внСсылка=Неопределено Тогда Возврат Ложь КонецЕсли;
			Если Не ЗаписатьВнешниеДанныеРегистраСведений(ОбъектМД,Источник,внСсылка,НомерПакета,СоответствиеСсылок,Перезапись) Тогда Возврат Ложь КонецЕсли;
		
		Иначе //Объектный тип (Справочник, Док... )
			Если ПолучитьВнешнееЗначение(Источник.Ссылка,НомерПакета,СоответствиеСсылок,Перезапись)=Неопределено Тогда Возврат Ложь КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	//установка актуального пакета к загрузке
	ТекБаза=ТекущаяБазаДанных().ПолучитьОбъект();
	ТекБаза.Пакет=НомерПакета;
	ТекБаза.Записать();
	
	Возврат Истина
КонецФункции

Функция ПримитивныйТип(Значение1С) //возвращает примитивные типы Иначе - Неопределено
	Тип=ТипЗнч(Значение1С);
	Если Тип=Тип("Булево") Тогда Возврат Строка(Значение1С)
	ИначеЕсли Тип=Тип("Строка") Тогда Возврат СокрЛП(Значение1С)
	ИначеЕсли Тип=Тип("Число") Тогда Возврат Формат(Значение1С,"ЧРД=.; ЧГ=0")
	ИначеЕсли Тип=Тип("Дата") Тогда Возврат Формат(Значение1С,"ДЛФ=DT")
	ИначеЕсли Тип=Тип("ВидСчета") Тогда Если Значение1С=ВидСчета.АктивноПассивный Тогда Возврат "ВидСчета.АктивноПассивный" Иначе Возврат Строка(Значение1С) КонецЕсли
	ИначеЕсли Значение1С=Неопределено Тогда Возврат NULL
	ИначеЕсли Значение1С=NULL Тогда Возврат NULL
	ИначеЕсли СсылкаПустая(Значение1С)=Истина Тогда Возврат NULL 	
	ИначеЕсли Найти(Тип,"(точка маршрута)")>0 Тогда Возврат Значение1С.Имя		
	ИначеЕсли Найти(Строка(Значение1С),"<Объект не найден>")>0 Тогда Сообщить("Не выгружен "+Значение1С+" типа <"+ТипЗначенияВМетаданныеСтрокой(Тип)+">",СтатусСообщения.Внимание); Возврат NULL
	КонецЕсли;
КонецФункции	
Функция ПолучитьВнешнееЗначение(Значение1С,НомерПакета,СоответствиеСсылок,Перезапись) //создает и возвращает Внешнюю Ссылку
	
	//примитивные типы
	зн=ПримитивныйТип(Значение1С); Если зн<>Неопределено Тогда Возврат зн КонецЕсли;
	
	//ссылочные типы
	знСсылки=СоответствиеСсылок.Получить(Значение1С); Если знСсылки<>Неопределено Тогда Возврат знСсылки КонецЕсли; //вернем выгруженное ранее
	
	ИмяМД=СсылкаВМетаданныеСтрокой(Значение1С); //Если ИмяМД=Неопределено Тогда ТекстОшибки="Выгрузка объектов ("+Строка(МД)+") не предусмотрена"; Возврат КонецЕсли;
	Если Найти(ИмяМД,"Перечисление.")>0 Тогда Возврат ИмяМД КонецЕсли; //исключение для перечислений
	ОбъектМД=ОбъектМД(ИмяМД);
	Если ОбъектМД=Неопределено Тогда Сообщить("Не выгружен <"+ИмяМД+"> т.к. не определены внешние метаданные",СтатусСообщения.Внимание); Возврат Неопределено КонецЕсли; //ситуация когда объект передан для выгрузки а метаданные не описаны
	
	////вычислить по правилу Ссылки
	//Если ОбъектМД.Правило<>NULL Тогда
	//	Отказ=Ложь; ТекстОшибки="";
	//	Правило=Справочники.Renault_Правила.ПолучитьСсылку(ОбъектМД.Правило);
	//	ДанныеСсылки=Новый Структура("Значение1С,ОбъектМД,НомерПакета,Перезапись",Значение1С,ОбъектМД,НомерПакета,Перезапись);
	//	внСсылка=ВычислитьПоПравилу(ДанныеСсылки,Правило,ВнешниеИсточникиДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблицы.Ссылки.ПустаяСсылка(),ТекстОшибки,Отказ);
	//	СоответствиеСсылок.Вставить(Значение1С,внСсылка); //кешируем выгруженные ссылки
	//	Если Отказ Тогда
	//		Сообщить("Ошибка вычисления правила <"+Правило+">"+Символы.ПС+Символы.Таб+ТекстОшибки,СтатусСообщения.Внимание);
	//		Возврат Ложь
	//	Иначе Возврат внСсылка КонецЕсли	
	//КонецЕсли;	
	
	//получить данные ссылки
	спРеквизиты=РеквизитыОбъекта(ИмяМД);
	ДанныеСсылки=ПолучитьДанныеСсылки1С(Значение1С,ОбъектМД,ИмяМД,спРеквизиты)[0];
	
	//найти внешнюю ссылку или создать если ее еще нет
	ТребуетсяЗапись=Истина;
	внСсылка=ПолучитьВнешнююСсылку(ОбъектМД,ДанныеСсылки,Значение1С,ТребуетсяЗапись,НомерПакета,Перезапись);
	СоответствиеСсылок.Вставить(Значение1С,внСсылка);
	Если Не ТребуетсяЗапись Тогда Возврат внСсылка КонецЕсли;
	
	ИмяВнТаблХранения=ИмяВнешнейТаблицы(ИмяМД);
	
	//перед записью реквизитов выполняем удаление (удаляются и реквизиты и табличные части)
	Если Не ОчиститьВнешниеРеквизиты(внСсылка.Ссылка,ИмяВнТаблХранения) Тогда Возврат Неопределено КонецЕсли;
	
	//записать реквизиты внешнего объекта
	Если Не ЗаписатьВнешниеРеквизиты(ДанныеСсылки,внСсылка,ИмяВнТаблХранения,спРеквизиты,0,НомерПакета,СоответствиеСсылок,Перезапись) Тогда Возврат Неопределено КонецЕсли; 
	
	//записать табличные части внешнего объекта
	Для Каждого ТЧ Из ТабличныеЧастиОбъекта(ИмяМД) Цикл
		спРеквизиты=РеквизитыОбъекта(ТЧ.Имя);
		НомерСтроки=0;
		ОбъектМДТЧ=ОбъектМД(ТЧ.Имя);
		Если ОбъектМДТЧ=Неопределено Тогда Сообщить("Не выгружена табличная часть <"+ТЧ.Имя+"> т.к. не определены внешние метаданные",СтатусСообщения.Внимание); Возврат Неопределено КонецЕсли; //ситуация когда объект передан для выгрузки а метаданные не описаны		
		Для Каждого ДанныеСтрокиТЧ Из ПолучитьДанныеСсылки1С(Значение1С,ОбъектМДТЧ,ТЧ.Имя,спРеквизиты) Цикл
			НомерСтроки=НомерСтроки+1;
			Если Не ЗаписатьВнешниеРеквизиты(ДанныеСтрокиТЧ,внСсылка,ИмяВнТаблХранения,спРеквизиты,НомерСтроки,НомерПакета,СоответствиеСсылок,Перезапись) Тогда Возврат Неопределено КонецЕсли; 
		КонецЦикла;	
	КонецЦикла;
	
	//программная запись по правилам (совместно или вместо описания реквизитов)
	Если ОбъектМД.Правило<>NULL Тогда
		Отказ=Ложь; ТекстОшибки="";
		Правило=Справочники.Renault_Правила.ПолучитьСсылку(ОбъектМД.Правило);
		Возврат ВычислитьПоПравилу( Новый Структура("Значение1С,ОбъектМД",Значение1С,ОбъектМД) ,Правило,внСсылка,ТекстОшибки,Отказ);
	КонецЕсли;
		
	Возврат внСсылка
КонецФункции
Функция ПолучитьДанныеСсылки1С(Значение1С,ОбъектМД,ИмяМД,спРеквизиты)
	
	//определим основной текст запроса для выборки данных ссылки 
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Значение1С);
	Запрос.УстановитьПараметр("ОбъектМД",ОбъектМД);
	
	//предопределенные реквизиты
	СпПредопределенныхРеквизитов=СписокПредопределенныхРеквизитов(ИмяМД,Истина);
	
	//финальный список реквизитов = СпПредопределенныхРеквизитов + спРеквизиты
	ПолныйСпРекв=СпПредопределенныхРеквизитов.ВыгрузитьЗначения();
	Для Каждого ЭлРекв Из спРеквизиты Цикл
		Если ПолныйСпРекв.Найти(ЭлРекв.Имя)=Неопределено Тогда ПолныйСпРекв.Добавить(ЭлРекв.Имя) КонецЕсли;
	КонецЦикла;
	
	ПолныйСпРекв.Добавить("&ОбъектМД ОбъектМД"); //обязательное поле
	
	////вычисляем произвольный поиск по правилу Ссылки
	//ПроизвольныйПоиск=NULL;
	//Если ОбъектМД.Правило<>NULL Тогда
	//	Отказ=Ложь; ТекстОшибки="";
	//	Правило=Справочники.Renault_Правила.ПолучитьСсылку(ОбъектМД.Правило);
	//	ПроизвольныйПоиск=ВычислитьПоПравилу( Новый Структура("Значение1С,ОбъектМД",Значение1С,ОбъектМД) ,Правило,ПроизвольныйПоиск,ТекстОшибки,Отказ);
	//	// кешировать правила нет необходимости, т.к. кешируются сами объекты - результат вычисления
	//	//Если Отказ Тогда
	//	//	Сообщить("Ошибка вычисления правила <"+Правило+">"+Символы.ПС+Символы.Таб+ТекстОшибки,СтатусСообщения.Внимание);
	//	//	Возврат Ложь
	//	//Иначе Возврат внСсылка КонецЕсли	
	//КонецЕсли;
	//ПолныйСпРекв.Добавить("&ПроизвольныйПоиск ПроизвольныйПоиск"); //обязательное поле
	//Запрос.УстановитьПараметр("ПроизвольныйПоиск",ПроизвольныйПоиск);
	
	СтрРеквизиты=МассивВСтроку(ПолныйСпРекв,","+Символы.ПС+Символы.Таб);
	
	Если ПустаяСтрока(ОбъектМД.ТекстЗапроса) Тогда 
		Запрос.Текст="Выбрать "+Символы.ПС+Символы.Таб+СтрРеквизиты+Символы.ПС+"ИЗ "+ИмяМД+Символы.ПС+"ГДЕ Ссылка=&Ссылка"
	Иначе
		СтруктураЗапроса=СтруктураЗапроса(ОбъектМД.ТекстЗапроса);
		Запрос.Текст="Выбрать "+Символы.ПС+Символы.Таб+СтрРеквизиты+Символы.ПС+"ИЗ "+СтруктураЗапроса.ИсточникДанных+?(СтруктураЗапроса.Свойство("Условия")," ГДЕ "+СтруктураЗапроса.Условия,"");
	КонецЕсли;	
		
	Возврат Запрос.Выполнить().Выгрузить()
КонецФункции	
Функция ПолучитьВнешнююСсылку(ОбъектМД,ДанныеСсылки,Значение1С,ТребуетсяЗапись,НомерПакета,Перезапись) //ищет или создает новую внешнюю ссылку
	//не фатальная ошибка - вернем NULL, фатальная ошибка - вернем Неопределено
//	Если ДанныеСсылки.ОбъектМД=NULL  Тогда Сообщить("Не определены метаданные "+СсылкаВМетаданныеСтрокой(Значение1С)+" для ссылки "+Значение1С); Возврат NULL КонецЕсли;

	Попытка _=Значение1С.Проведен; ЕстьПроведение=Истина Исключение ЕстьПроведение=Ложь КонецПопытки; //проводится ли объект?

	UUID=Значение1С.УникальныйИдентификатор();
	Запрос=Новый Запрос("Выбрать * Из ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.Ссылки ГДЕ UUID=&UUID И ОбъектМД=&ОбъектМД");
	Запрос.УстановитьПараметр("UUID",UUID);
	Запрос.УстановитьПараметр("ОбъектМД",ОбъектМД);
	СсылкаВн=Запрос.Выполнить().Выбрать();
	Если СсылкаВн.Следующий() Тогда
		Если НЕ Перезапись Тогда //проверка версии объекта. если она не изменилась - вернем объект
			Если ЕстьПроведение Тогда
				Если ДанныеСсылки.ВерсияДанных=СсылкаВн.Версия И ДанныеСсылки.ПометкаУдаления=СсылкаВн.ПометкаУдаления И ДанныеСсылки.Проведен=СсылкаВн.Проведен Тогда ТребуетсяЗапись=Ложь; Возврат СсылкаВн.Ссылка КонецЕсли;
			Иначе
				Если ДанныеСсылки.ВерсияДанных=СсылкаВн.Версия И ДанныеСсылки.ПометкаУдаления=СсылкаВн.ПометкаУдаления Тогда ТребуетсяЗапись=Ложь; Возврат СсылкаВн.Ссылка КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		внСсылка=СсылкаВн.Ссылка.ПолучитьОбъект();
	Иначе
		внСсылка=ВнешниеИсточникиДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблицы.Ссылки.СоздатьОбъект();
		внСсылка.UUID=UUID;
	КонецЕсли;
	
	//записать внешнюю ссылку
	Попытка 
		внСсылка.Версия=ДанныеСсылки.ВерсияДанных;
		внСсылка.ПометкаУдаления=ДанныеСсылки.ПометкаУдаления;
		внСсылка.Проведен=?(ЕстьПроведение,Значение1С.Проведен,Ложь);
		Попытка внСсылка.ЭтоГруппа=Значение1С.ЭтоГруппа Исключение внСсылка.ЭтоГруппа=Ложь КонецПопытки;
		//внСсылка.Проведен=?(ВидыЗаписей.Документ=ВидЗаписи,Значение1С.Проведен,Ложь); //ДанныеСсылки.Проведен;
		//внСсылка.ЭтоГруппа=?(ВидыЗаписей.Справочник=ВидЗаписи,Значение1С.ЭтоГруппа,Ложь); //ДанныеСсылки.ЭтоГруппа;
		внСсылка.Представление=ДанныеСсылки.Представление;
		внСсылка.Пакет=НомерПакета;
		
		внСсылка.ОбъектМД=ДанныеСсылки.ОбъектМД;
		//внСсылка.ПроизвольныйПоиск=ДанныеСсылки.ПроизвольныйПоиск;
		
		внСсылка.Записать();
	Исключение
		Сообщить("Не удалось создать внешнюю ссылку для <"+Значение1С+">. "+ОписаниеОшибки());
		Возврат Неопределено
	КонецПопытки;
	
	Возврат внСсылка.Ссылка	
КонецФункции

Функция ПолучитьВнешнююСсылкуРегистраСведений(ОбъектМД,НомерПакета)
	Запрос=Новый Запрос("Выбрать Первые 1 Ссылка Из ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.Ссылки ГДЕ ОбъектМД=&ОбъектМД");	
	Запрос.УстановитьПараметр("ОбъектМД",ОбъектМД);
	Результат=Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		внСсылка=ВнешниеИсточникиДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблицы.Ссылки.СоздатьОбъект();
		внСсылка.UUID=Новый УникальныйИдентификатор;
	Иначе
		Выборка=Результат.Выбрать();
		Выборка.Следующий();
		внСсылка=Выборка.Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	//нет возможности проверить версию, выгружаем все
	Попытка 
		внСсылка.Версия=1;
		внСсылка.ПометкаУдаления=Ложь;
		внСсылка.Проведен=Ложь;
		внСсылка.ЭтоГруппа=Ложь;
		внСсылка.Представление=ОбъектМД.Имя;
		внСсылка.Пакет=НомерПакета;
		внСсылка.ОбъектМД=ОбъектМД;
		внСсылка.Записать();
	Исключение
		Сообщить("Не удалось создать внешнюю ссылку для <"+ОбъектМД+">. "+ОписаниеОшибки());
		Возврат Неопределено
	КонецПопытки;
	
	Возврат внСсылка.Ссылка	
КонецФункции	
Функция НайтиВнешнееЗначение(ОбъектМД,Значение1С,СоответствиеСсылок) //ищет по UUID но не создает - возвращает Внешнюю Ссылку
	//примитивные типы
	зн=ПримитивныйТип(Значение1С); Если зн<>Неопределено Тогда Возврат зн КонецЕсли;
	
	//ссылочные типы
	знСсылки=СоответствиеСсылок.Получить(Значение1С); Если знСсылки<>Неопределено Тогда Возврат знСсылки КонецЕсли; //вернем выгруженное ранее

	UUID=Значение1С.УникальныйИдентификатор();
	Запрос=Новый Запрос("Выбрать Ссылка Из ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.Ссылки ГДЕ UUID=&UUID И ОбъектМД=&ОбъектМД");
	Запрос.УстановитьПараметр("UUID",UUID);
	Запрос.УстановитьПараметр("ОбъектМД",ОбъектМД);
	Выборка=Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка
КонецФункции	
Функция ЗаписатьВнешниеДанныеРегистраСведений(ОбъектМД,НаборЗаписей=Неопределено,внСсылка,НомерПакета,СоответствиеСсылок,Перезапись)
	//НаборЗаписей - набор записей регистра и требуется записать только их. Если отсутствует - выгружаем все записи
	
	ИмяВнТаблХранения=ИмяВнешнейТаблицы(ОбъектМД.Имя);
	спРеквизиты=РеквизитыОбъекта(ОбъектМД.Имя);
	
	//убрать все записи регистра выгруженные ранее
	Если НаборЗаписей=Неопределено Тогда
		Если Перезапись И Не ОчиститьВнешниеРеквизиты(внСсылка,ИмяВнТаблХранения) Тогда Возврат Ложь КонецЕсли;
		//полная выгрузка регистра
		МассивРекв=Новый Массив; Для Каждого Рекв Из спРеквизиты Цикл МассивРекв.Добавить(Рекв.Имя) КонецЦикла; 
		Запрос=Новый Запрос("Выбрать "+МассивВСтроку(МассивРекв,",")+" Из "+ОбъектМД.Имя);
		Выборка=Запрос.Выполнить().Выбрать();
		НомерСтроки=0;
		Пока Выборка.Следующий() Цикл
			НомерСтроки=НомерСтроки+1;
			Если Не ЗаписатьВнешниеРеквизиты(Выборка,внСсылка,ИмяВнТаблХранения,спРеквизиты,НомерСтроки,НомерПакета,СоответствиеСсылок,Перезапись) Тогда Возврат Ложь КонецЕсли;
		КонецЦикла;	
		
	Иначе
		Если НаборЗаписей.Количество()=0 Тогда
			//очистка записей по отбору
			Отбор=Новый Структура;
			Для Каждого Эл Из НаборЗаписей.Отбор Цикл
				//знРеквизита=ПолучитьВнешнееЗначение(Эл.Значение,НомерПакета,СоответствиеСсылок,Перезапись);
				знРеквизита=НайтиВнешнееЗначение(ОбъектМД,Эл.Значение,СоответствиеСсылок);
				Если знРеквизита=Неопределено Тогда Возврат Истина КонецЕсли; //пытались удалить а значения и так нет
				Отбор.Вставить(Эл.Имя,знРеквизита);
			КонецЦикла;	
			Если Не ОчиститьВнешниеРеквизиты(внСсылка,ИмяВнТаблХранения,Отбор) Тогда Возврат Ложь КонецЕсли;
		Иначе 
			//создание записей
			
			//продолжаем дописывать от максимального номера строки
			Запрос=Новый Запрос("Выбрать Максимум(НомерСтроки) МаксНомерСтроки Из ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица."+ИмяВнТаблХранения+" ГДЕ СсылкаНаОбъект=&СсылкаНаОбъект");
			Запрос.УстановитьПараметр("СсылкаНаОбъект",внСсылка);
			НомерСтроки=Запрос.Выполнить().Выгрузить().Итог("МаксНомерСтроки");
			Для Каждого Запись Из НаборЗаписей Цикл
				НомерСтроки=НомерСтроки+1;
				Если Не ЗаписатьВнешниеРеквизиты(Запись,внСсылка,ИмяВнТаблХранения,спРеквизиты,НомерСтроки,НомерПакета,СоответствиеСсылок,Перезапись) Тогда Возврат Ложь КонецЕсли;
			КонецЦикла;	
		КонецЕсли;	
	КонецЕсли;	
	
	//программная запись по правилам (совместно или вместо описания реквизитов)
	Если ОбъектМД.Правило<>NULL Тогда
		Отказ=Ложь; ТекстОшибки="";
		Правило=Справочники.Renault_Правила.ПолучитьСсылку(ОбъектМД.Правило);
		Возврат ВычислитьПоПравилу( Новый Структура("НаборЗаписей,ОбъектМД",НаборЗаписей,ОбъектМД) ,Правило,внСсылка,ТекстОшибки,Отказ);
	КонецЕсли;
	
	Возврат Истина
КонецФункции	

Функция УстановитьНеАктуальностьВерсииСсылки(внСсылка)
	Объект=внСсылка.ПолучитьОбъект();
	Объект.Версия=0;
	Попытка	Объект.Записать() Исключение Возврат Ложь КонецПопытки;
	Возврат Истина
КонецФункции	
Функция СсылкаПустая(Ссылка) Попытка Возврат Ссылка.Пустая() Исключение Возврат Неопределено КонецПопытки КонецФункции

Функция ОчиститьВнешниеРеквизиты(внСсылка,ИмяВнТаблХранения,Отбор=Неопределено)
	Попытка 
		Если Отбор=Неопределено Тогда
			Записи=ВнешниеИсточникиДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблицы[ИмяВнТаблХранения].СоздатьНаборЗаписей();
			Записи.Отбор.СсылкаНаОбъект.ВидСравнения=ВидСравнения.Равно;
			Записи.Отбор.СсылкаНаОбъект.Значение=внСсылка;
			Записи.Отбор.СсылкаНаОбъект.Использование=Истина;
			Записи.Прочитать();
			Записи.Очистить();
			Записи.Записать(Истина);
		Иначе
			//надо найти номера строк где набор реквизитов равен отбору и удалить такие строки
			Индекс=0;
			Запрос=Новый Запрос;
			Запрос.УстановитьПараметр("СсылкаНаОбъект",внСсылка);
			Запрос.Текст="
			|Выбрать Различные ЗП.НомерСтроки 
			|ИЗ ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица."+ИмяВнТаблХранения+" ЗП";
			Для Каждого Эл Из Отбор Цикл 
				СтрИндекс=Формат(Индекс,"ЧН=0; ЧГ=0");
				Запрос.УстановитьПараметр("Реквизит"+СтрИндекс,Эл.Ключ);
				Запрос.УстановитьПараметр("Значение"+СтрИндекс,Эл.Значение);
				Если ТипЗнч(Эл.Значение)=Тип("Строка") Тогда
					УсловиеЗначения="Подстрока(Значение,0,"+СтрДлина(Эл.Значение)+")=&Значение"+СтрИндекс+" И ЗначениеСсылка=Значение(ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.Ссылки.ПустаяСсылка)";
				Иначе
					УсловиеЗначения="Значение Есть NULL И ЗначениеСсылка=&Значение"+СтрИндекс;
				КонецЕсли;	
				Запрос.Текст=Запрос.Текст+"
				|Внутреннее Соединение(
				|	Выбрать НомерСтроки
				|		ИЗ ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица."+ИмяВнТаблХранения+"
				|		ГДЕ СсылкаНаОбъект=&СсылкаНаОбъект И Реквизит.Имя=&Реквизит"+СтрИндекс+" И "+УсловиеЗначения+"
				|)ЗП"+СтрИндекс+"
				|По ЗП.НомерСтроки=ЗП"+СтрИндекс+".НомерСтроки";
				Индекс=Индекс+1;
			КонецЦикла;	
			Запрос.Текст=Запрос.Текст+"
			|ГДЕ СсылкаНаОбъект=&СсылкаНаОбъект
			|";
			Для Каждого Стр Из Запрос.Выполнить().Выгрузить() Цикл
				Записи=ВнешниеИсточникиДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблицы[ИмяВнТаблХранения].СоздатьНаборЗаписей();
				Записи.Отбор.СсылкаНаОбъект.ВидСравнения=ВидСравнения.Равно;
				Записи.Отбор.СсылкаНаОбъект.Значение=внСсылка;
				Записи.Отбор.СсылкаНаОбъект.Использование=Истина;
				Записи.Отбор.НомерСтроки.ВидСравнения=ВидСравнения.Равно;
				Записи.Отбор.НомерСтроки.Значение=Стр.НомерСтроки;
				Записи.Отбор.НомерСтроки.Использование=Истина;
				Записи.Прочитать();
				Записи.Очистить();
				Записи.Записать(Истина);
			КонецЦикла;	
			
		КонецЕсли;	
	Исключение
		Сообщить("Реквизиты ссылки <"+внСсылка+"> не удалось очистить. "+ОписаниеОшибки());
		Возврат Ложь
	КонецПопытки;	
	Возврат Истина
КонецФункции	
Функция ЗаписатьВнешниеРеквизиты(Данные,внСсылка,ИмяВнТаблХранения,спРеквизиты,НомерСтроки,НомерПакета,СоответствиеСсылок,Перезапись)
	Для Каждого Реквизит Из спРеквизиты Цикл
		знРеквизита1С=Данные[Реквизит.Имя];
		
		//вычислить по правилу Реквизита
		Если Реквизит.Правило<>NULL Тогда
			Отказ=Ложь; ТекстОшибки="";
			Правило=Справочники.Renault_Правила.ПолучитьСсылку(Реквизит.Правило);
			знРеквизита1С=ВычислитьПоПравилу(Новый Структура("Данные,спРеквизиты",Данные,спРеквизиты),Правило,знРеквизита1С,ТекстОшибки,Отказ);
			Если Отказ Тогда
				Сообщить("Ошибка вычисления правила <"+Правило+">"+Символы.ПС+Символы.Таб+ТекстОшибки,СтатусСообщения.Внимание);
				Возврат Ложь	
			КонецЕсли;	
		КонецЕсли;	
		
		Если Не ЗаписатьВнешнийРеквизит(знРеквизита1С,Реквизит,внСсылка,ИмяВнТаблХранения,НомерСтроки,НомерПакета,СоответствиеСсылок,Перезапись) Тогда 
			//если не удалось записать реквизит то внешняя ссылка не соответствует версии...
			УстановитьНеАктуальностьВерсииСсылки(внСсылка);
			Возврат Ложь
		КонецЕсли
	КонецЦикла;
	Возврат Истина
КонецФункции
Функция ЗаписатьВнешнийРеквизит(знРеквизита1С,Реквизит,внСсылка,ИмяВнТаблХранения,НомерСтроки,НомерПакета,СоответствиеСсылок,Перезапись)
	Попытка
		Запись=ВнешниеИсточникиДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблицы[ИмяВнТаблХранения].СоздатьМенеджерЗаписи();
		Запись.СсылкаНаОбъект=внСсылка;
		Запись.Реквизит=Реквизит;
		Запись.НомерСтроки=НомерСтроки;
		знРеквизита=ПолучитьВнешнееЗначение(знРеквизита1С,НомерПакета,СоответствиеСсылок,Перезапись);
		Если знРеквизита=Неопределено Тогда 
			ВызватьИсключение "" //сообщение об ошибке уже выдано
		ИначеЕсли знРеквизита=NULL Тогда
			Запись.Значение=NULL;
			Запись.ЗначениеСсылка=ВнешниеИсточникиДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблицы.Ссылки.ПустаяСсылка();
		Иначе
			Если ТипЗнч(знРеквизита)=Тип("Строка") Тогда
				Запись.Значение=знРеквизита;
				Запись.ЗначениеСсылка=ВнешниеИсточникиДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблицы.Ссылки.ПустаяСсылка();
			Иначе
				Запись.Значение=NULL;
				Запись.ЗначениеСсылка=знРеквизита;
			КонецЕсли
		КонецЕсли;
		Запись.Записать(Истина); //при "Записать(Истина)" вероятно надо указывать значения всех полей, иначе 1С не переваривает
	Исключение
		Сообщить("Реквизит <"+Реквизит+"> внешней ссылки <"+внСсылка+"> не записан. "+ОписаниеОшибки());
		Возврат Ложь
	КонецПопытки;	
	Возврат Истина
КонецФункции

//----функции загрузки---
//*************************************************************
//внешний вызов загрузки по номеру последнего пакета
Функция ЗагрузкаВыполнена(НомерПоследнегоЗагруженногоПакета,НомерПоследнегоВыгруженногоПакета,БазаДанных,ТекстОшибки,Отказ,Перезапись=Ложь) Экспорт
	СоответствиеСсылок=Новый Соответствие;
	МаксНомерПакета='00010101';
	Для Каждого ДанныеВнСсылки Из ДанныеКЗагрузке(НомерПоследнегоЗагруженногоПакета,НомерПоследнегоВыгруженногоПакета,БазаДанных) Цикл //таблица ссылок (Внешних данных) без реквизитов + Конвертация к ним без реквизитов
		Если ПолучитьЗначение1С(ДанныеВнСсылки,СоответствиеСсылок,ТекстОшибки,Отказ,Перезапись)<>Неопределено Тогда
			МаксНомерПакета=Макс(МаксНомерПакета,ДанныеВнСсылки.ЗначениеСсылка.Пакет);
		КонецЕсли;	
	КонецЦикла;	
	
	//запоминаем последний загруженный пакет
	Если МаксНомерПакета>'00010101' И Не Отказ Тогда Константы.Renault_НомерЗагруженногоПакета.Установить(МаксНомерПакета) КонецЕсли;	
	Возврат НЕ Отказ
КонецФункции	
Функция ПолучитьЗначение1С(внДанные,СоответствиеСсылок,ТекстОшибки,Отказ,Перезапись) //определение ссылки 1С по внДанные
	
	//примитивные типы (приходит как рекурсивный вызов из реквизитов ссылки)
	Если Не ПустаяСтрока(внДанные.Значение) Тогда Возврат ПреобразованиеПримитивногоТипа(внДанные,ТекстОшибки,Отказ) КонецЕсли; 
	
	//иначе ссылочный тип
	ВнСсылка=внДанные.ЗначениеСсылка;
	Если ВнСсылка.Пустая() Тогда Возврат NULL КонецЕсли;
	Если ВнСсылка.Версия="0" Тогда Сообщить("Ссылка <"+ВнСсылка.Представление+"> не загружена, возникли проблемы при выгрузке",СтатусСообщения.Важное); Возврат Неопределено КонецЕсли;
	Если внДанные.Конвертация=NULL Тогда Возврат Неопределено КонецЕсли; //ошибкой не является если не определена загрузка для выгруженного объекта
	
	//ссылка загружена ранее - вернем ее
	Ссылка1С=СоответствиеСсылок.Получить(ВнСсылка); Если Ссылка1С<>Неопределено Тогда Возврат Ссылка1С КонецЕсли; 
	
	//РегистраСведений
	Если Найти(ВнСсылка.ОбъектМД.Имя,"РегистрСведений.")>0 Тогда Возврат ЗагрузитьРегистрСведений(внДанные,СоответствиеСсылок,ТекстОшибки,Отказ,Перезапись) КонецЕсли;
	
	//Объектные типы
	внДанные.Реквизиты=РеквизитыВнешнегоОбъекта(ВнСсылка); //внешние реквизиты объекта
	
	//программный поиск ссылки
	ПравилоПоиска=Правило(внДанные,"Поиска");
	Если НЕ ПравилоПоиска.Пустая() Тогда 
		Объект1С=ВычислитьПоПравилу(внДанные,ПравилоПоиска,Неопределено,ТекстОшибки,Отказ); //программный поиск ссылки
		//Объект1С=ВычислитьПоПравилу(внДанные,Правило(внДанные),Ссылка1С,ТекстОшибки,Отказ); //программная постобработка
		Если Объект1С=Неопределено Тогда Возврат Неопределено КонецЕсли;
		Ссылка1С=Объект1С.Ссылка;
		
	Иначе //поиск  или создание
		
		//ПоляПоиска=внДанные.Реквизиты.НайтиСтроки(Новый Структура("Поиск",Истина));
		ПоляПоиска=внДанные.Реквизиты.НайтиСтроки(Новый Структура("Поиск,ИмяТЧ",Истина,внДанные.Конвертация.Наименование));
		Объект1С=?(ПоляПоиска.Количество()=0,
			//ПоискПоUUID(ВнСсылка.ОбъектМД.Имя,ВнСсылка.UUID,ВнСсылка.ЭтоГруппа), //поиск по уникальному идентификатору
			//ПоискПоПолям(ВнСсылка.ОбъектМД.Имя,ПоляПоиска,ВнСсылка.ЭтоГруппа,СоответствиеСсылок,Перезапись) //поиск по заданным полям
			ПоискПоUUID(внДанные.Конвертация.Наименование,ВнСсылка.UUID,ВнСсылка.ЭтоГруппа), //поиск по уникальному идентификатору
			ПоискПоПолям(внДанные.Конвертация.Наименование,ПоляПоиска,ВнСсылка.ЭтоГруппа,СоответствиеСсылок,Перезапись) //поиск по заданным полям
		);
		Если Объект1С=Неопределено Тогда Возврат Неопределено КонецЕсли;
		
		//определим ссылку для Объект1С
		Если Объект1С.ЭтоНовый() Тогда
			Если внДанные.ТолькоЧтение Тогда //блокировка записи 
				Ссылка1С=Неопределено //вернем Неопределено, т.к. ссылка нет
			Иначе
				Ссылка1С=Объект1С.ПолучитьСсылкуНового() //вернем будущую ссылку
			КонецЕсли;	
		Иначе
			Ссылка1С=Объект1С.Ссылка
		КонецЕсли;	
	КонецЕсли;
	
	СоответствиеСсылок.Вставить(ВнСсылка,Ссылка1С); //запомним в кэш ** ссылка запоминается на этапе создания а не после записи, иначе возможны зацикливания
	Если внДанные.ТолькоЧтение или (внДанные.ТипЗаписиВнОбъекта="Реквизит" И внДанные.ТолькоЧтениеРеквизит) Тогда Возврат Ссылка1С КонецЕсли; //объект не может быть переписан, вернем как есть
	Если Не Перезапись И Объект1С.Renault_ВерсияВнешнихДанных=ВнСсылка.Версия Тогда Возврат Объект1С.Ссылка КонецЕсли; //если версия не изменилась...	

	//значит объект 1С изменился, требуется перезаписать его реквизиты
	ЗапрещенныйВидИспользования=ЗапрещенныйВидИспользования(Объект1С,внДанные.Конвертация.Наименование); //для справочников не все реквизиты есть у группы и элемента
	ОчисткаОбъекта1С(Объект1С,ЗапрещенныйВидИспользования); //очистим реквизиты и ТЧ
	
	//записать реквизиты
	//данные внешних реквизитов упорядочены по имени метаданного (табличные части сгруппированы) и номеру строки ТЧ
	мдОбъекта1С=Объект1С.Метаданные();
	
	ВиртуальныеТаблицы=Новый ТаблицаЗначений;  //Виртуальные таблицы с именем ИмяМД + Массив строк + правила поиска и конвертации
	ВиртуальныеТаблицы.Колонки.Добавить("Имя");
	ВиртуальныеТаблицы.Колонки.Добавить("ПравилоПоиска");
	ВиртуальныеТаблицы.Колонки.Добавить("Правило");
	ВиртуальныеТаблицы.Колонки.Добавить("ТолькоЧтение");
	ВиртуальныеТаблицы.Колонки.Добавить("Строки");
	
	//сохраним временные переменные, используются для передачи комплексной инфо. по объекту в процедуру записи виртуальных таблиц
	Объект1С.ДополнительныеСвойства.Вставить("ДанныеСсылки",внДанные); //ссылка типа Renault_ПередачаДанныхВСторонниеСистемы.Таблица.Ссылки
	//Объект1С.ДополнительныеСвойства.Вставить("Реквизиты",внДанные.Реквизиты); //структура ключ - имя реквизита
	Объект1С.ДополнительныеСвойства.Вставить("Метаданные",мдОбъекта1С); //метаданные созданной ссылки в 1С
	
	нСтроки=0;	
	Для Каждого ДанныеВнРекв Из внДанные.Реквизиты Цикл
		//*(описано в СКД) Если ДанныеВнРекв.КонвертацияРеквизит=NULL Тогда Продолжить КонецЕсли; //ошибкой не является если не определена загрузка для выгруженного реквизита
		
		//имя табличной части если это реквизит ТЧ
		Если ДанныеВнРекв.НомерСтроки>0 Тогда 
			ИмяТЧ=СтруктураМетаданных(ДанныеВнРекв.ИмяТЧ).Таблица;
			Если ИмяТЧ=Неопределено Тогда 
				//новая виртуальная таблица
				СтрВиртТаб=ВиртуальныеТаблицы.Найти(ДанныеВнРекв.ИмяТЧ,"Имя");
				Если СтрВиртТаб=Неопределено Тогда
					СтрВиртТаб=ВиртуальныеТаблицы.Добавить();
					СтрВиртТаб.Имя=ДанныеВнРекв.ИмяТЧ;
					СтрВиртТаб.ПравилоПоиска=ДанныеВнРекв.ПравилоПоискаТЧ;
					СтрВиртТаб.Правило=ДанныеВнРекв.ПравилоТЧ;
					СтрВиртТаб.ТолькоЧтение=ДанныеВнРекв.ТолькоЧтениеТЧ;
					СтрВиртТаб.Строки=Новый Массив;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
		
		//пропустим лишние реквизиты. Для Справочника - не все реквизиты есть у группы и элемента
		Если ЗапрещенныйВидИспользования<>"" Тогда 
			Если ДанныеВнРекв.НомерСтроки=0 Тогда
				Если мдОбъекта1С.Реквизиты.Найти(ДанныеВнРекв.Реквизит)<>Неопределено И мдОбъекта1С.Реквизиты[ДанныеВнРекв.Реквизит].Использование=ЗапрещенныйВидИспользования Тогда Продолжить КонецЕсли;
			Иначе
				Если ИмяТЧ<>Неопределено И мдОбъекта1С.ТабличныеЧасти[ИмяТЧ].Использование=ЗапрещенныйВидИспользования Тогда Продолжить КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
		
		ЗначениеВнешнейСсылки=ПолучитьЗначение1С(ДанныеВнРекв,СоответствиеСсылок,ТекстОшибки,Отказ,Перезапись); //рекурсия установит Отказ, ошибка может быть критической...
		Если ЗначениеВнешнейСсылки=Неопределено или ЗначениеВнешнейСсылки=NULL Тогда Продолжить КонецЕсли; //но не найденный реквизит пока не проблема
		
		Если ДанныеВнРекв.НомерСтроки=0 Тогда //шапка
			Объект1С[ДанныеВнРекв.Реквизит]=ЗначениеВнешнейСсылки	
		ИначеЕсли ИмяТЧ<>Неопределено Тогда //табличная часть
			Если нСтроки<>ДанныеВнРекв.НомерСтроки Тогда 
				ТекСтрока=Объект1С[ИмяТЧ].Добавить();
				нСтроки=ДанныеВнРекв.НомерСтроки;
			КонецЕсли;
			ТекСтрока[ДанныеВнРекв.Реквизит]=ЗначениеВнешнейСсылки;
		ИначеЕсли ИмяТЧ=Неопределено Тогда //виртуальная таблица	
			Если нСтроки<>ДанныеВнРекв.НомерСтроки Тогда
				ТекСтрокаВТ=Новый Структура;
				СтрВиртТаб.Строки.Добавить(ТекСтрокаВТ);
				нСтроки=ДанныеВнРекв.НомерСтроки;
			КонецЕсли;
			ТекСтрокаВТ.Вставить(ДанныеВнРекв.Реквизит,ЗначениеВнешнейСсылки);
		КонецЕсли;
		
	КонецЦикла;
	
	Объект1С.ДополнительныеСвойства.Вставить("ВиртуальныеТаблицы",ВиртуальныеТаблицы);
	Если Не Отказ Тогда ЗаписатьВиртуальныеТаблицы(Объект1С,ТекстОшибки,Отказ) КонецЕсли; //запись виртуальных таблиц
	Если Не Отказ Тогда Объект1С=ВычислитьПоПравилу(внДанные,Правило(внДанные),Объект1С,ТекстОшибки,Отказ) КонецЕсли; //правило постобработки
		
	//запись объекта
	Попытка
		//если ошибок не случилось то версия объекта обновляется
		Если Не Отказ Тогда Объект1С.Renault_ВерсияВнешнихДанных=ВнСсылка.Версия КонецЕсли;	
		Если Найти(внДанные.Конвертация.Наименование,"Документ.")>0 Тогда
			Объект1С.Записать(?(ВнСсылка.Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.ОтменаПроведения),РежимПроведенияДокумента.Неоперативный);
		Иначе
			Объект1С.Записать();	
		КонецЕсли;
		Объект1С.УстановитьПометкуУдаления(ВнСсылка.ПометкаУдаления);
	Исключение
		Отказ=Истина; //критическая ошибка
		ТекстОшибки=ТекстОшибки+?(ТекстОшибки="","",Символы.ПС)+"Ссылка "+Строка(ВнСсылка.UUID)+" типа <"+ВнСсылка.ОбъектМД.Имя+"> -> <"+внДанные.Конвертация.Наименование+"> не записана."+Символы.ПС+Символы.Таб+ОписаниеОшибки();
		Возврат Неопределено
	КонецПопытки;
	
	Возврат Объект1С.Ссылка
КонецФункции

Функция ЗагрузитьРегистрСведений(внДанные,СоответствиеСсылок,ТекстОшибки,Отказ,Перезапись)
	Если внДанные.Конвертация.ТолькоЧтение Тогда Возврат Истина КонецЕсли;
	СтрМД=СтруктураМетаданных(внДанные.ИмяМД,Истина); 
	Если СтрМД=Неопределено Тогда Возврат Неопределено КонецЕсли;
	
	Записи=СтрМД.Менеджер.СоздатьНаборЗаписей();
	
	//конвертация реквизитов
	Запрос=Новый Запрос("Выбрать ВнешнийРеквизит,Реквизит,Правило,ПравилоПоиска,ТолькоЧтение,Поиск Из Справочник.Renault_КонвертацияДанных.Реквизиты ГДЕ Ссылка=&Конвертация И Ссылка.Активно И Активно");
	Запрос.УстановитьПараметр("Конвертация",внДанные.Конвертация);
	внДанные.Реквизиты=Запрос.Выполнить().Выгрузить();
	
	//данные внешней базы
	ИмяВнТаблХранения=ИмяВнешнейТаблицы(внДанные.Конвертация.ВнешниеМетаданные.Имя);
	
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("СсылкаНаОбъект",внДанные.ЗначениеСсылка);
	Поля="";
	Источники="";
	Итоги="";
	Индекс=0;
	Для Каждого СтрРеквизит Из внДанные.Реквизиты Цикл
		СтрИндекс=Формат(Индекс,"ЧН=0; ЧГ=0");
		
		Поля=Поля+?(Поля="","",",")+"
		|	Реквизит"+СтрИндекс+".Реквизит Реквизит"+СтрИндекс+",
		|	Реквизит"+СтрИндекс+".Значение Значение"+СтрИндекс+",
		|	Реквизит"+СтрИндекс+".ЗначениеСсылка ЗначениеСсылка"+СтрИндекс+",
		|	Выбор Когда Реквизит"+СтрИндекс+".ЗначениеСсылка Есть NULL ИЛИ Реквизит"+СтрИндекс+".ЗначениеСсылка=Значение(ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.Ссылки.ПустаяСсылка) 
		|		Тогда Подстрока(Реквизит"+СтрИндекс+".Значение,0,100) 
		|		Иначе Реквизит"+СтрИндекс+".ЗначениеСсылка 
		|	Конец Группа"+СтрИндекс;
		
		Источники=Источники+"
		|Левое Соединение(
		|	ВЫБРАТЬ
		|		НомерСтроки,
		|		Реквизит,
		|		Значение,
		|		ЗначениеСсылка
		|	ИЗ ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица."+ИмяВнТаблХранения+"
		|	ГДЕ	СсылкаНаОбъект=&СсылкаНаОбъект И Реквизит=&Реквизит"+СтрИндекс+"
		|)Реквизит"+СтрИндекс+" По ЗП.НомерСтроки=Реквизит"+СтрИндекс+".НомерСтроки 
		|";
		Запрос.УстановитьПараметр("Реквизит"+СтрИндекс,СтрРеквизит.ВнешнийРеквизит);
		
		//группировки
		Если СтрРеквизит.Поиск Тогда Итоги=Итоги+?(Итоги="","",", ")+"Группа"+СтрИндекс КонецЕсли;	
		
		Индекс=Индекс+1;
	КонецЦикла;	
	
	Запрос.Текст="
	|Выбрать "+Поля+"
	|ИЗ(Выбрать Различные НомерСтроки Из ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица."+ИмяВнТаблХранения+" ГДЕ СсылкаНаОбъект=&СсылкаНаОбъект)ЗП
	|"+Источники;
	//|Итоги По "+Итоги;
	//|Упорядочить По "+Итоги;
	
	Если внДанные.ПравилоПоиска.Пустая() Тогда //запись НабораЗаписей с отбором по группировкам запроса		
		Запрос.Текст=Запрос.Текст+"
		|Итоги По "+Итоги;
		Измерения=внДанные.Реквизиты.НайтиСтроки(Новый Структура("Поиск",Истина));
		Если ЗагрузитьНаборЗаписейРегистраСведений(0,Измерения,Запрос.Выполнить(),Записи,внДанные,СоответствиеСсылок,ТекстОшибки,Отказ,Перезапись)=Неопределено Тогда Возврат Неопределено КонецЕсли; 
	Иначе //запись НабораЗаписей программным отбором
		Если ВычислитьПоПравилу(внДанные,внДанные.ПравилоПоиска,Записи,ТекстОшибки,Отказ)=Неопределено Тогда Возврат Неопределено КонецЕсли; //программный отбор набора данных
		Записи.Прочитать();
		Записи.Очистить();
		Выборка=Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл //детальные записи выборки
			Если ЗагрузитьЗапистьРегистраСведений(Выборка,Записи,внДанные,СоответствиеСсылок,ТекстОшибки,Отказ,Перезапись)=Неопределено Тогда Возврат Неопределено КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
КонецФункции
Функция ЗагрузитьНаборЗаписейРегистраСведений(НомерГруппировки,Измерения,РезультатЗапроса,Записи,внДанные,СоответствиеСсылок,ТекстОшибки,Отказ,Перезапись)
	ВыборкаГр=РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаГр.Следующий() Цикл
		Если ВыборкаГр.ТипЗаписи()<>ТипЗаписиЗапроса.ДетальнаяЗапись Тогда
			
			//отбор набора записей
			//СтрИндекс=Формат(НомерГруппировки,"ЧН=0; ЧГ=0");
			Измерение=Измерения[НомерГруппировки];
			
			//получим первую детальную запись
			Выборка=ВыборкаГр.Выбрать();
			Выборка.Следующий();
			Пока Выборка.ТипЗаписи()<>ТипЗаписиЗапроса.ДетальнаяЗапись Цикл Выборка.Следующий() КонецЦикла;	
			
			Значение=ПолучитьЗначение1С_РеквизитРегистраСведений(Выборка,НомерГруппировки,Измерение,СоответствиеСсылок,ТекстОшибки,Отказ,Перезапись); Если Значение=Неопределено Тогда Возврат Неопределено КонецЕсли;
			Записи.Отбор[Измерение.Реквизит].ВидСравнения=ВидСравнения.Равно;
			Записи.Отбор[Измерение.Реквизит].Значение=Значение;
			Записи.Отбор[Измерение.Реквизит].Использование=Истина;
			
			Если ЗагрузитьНаборЗаписейРегистраСведений(НомерГруппировки+1,Измерения,ВыборкаГр,Записи,внДанные,СоответствиеСсылок,ТекстОшибки,Отказ,Перезапись)=Неопределено Тогда Возврат Неопределено КонецЕсли; 
		Иначе
		//детальные записи выборки
			Записи.Прочитать();
			Записи.Очистить();
			Если ЗагрузитьЗапистьРегистраСведений(ВыборкаГр,Записи,внДанные,СоответствиеСсылок,ТекстОшибки,Отказ,Перезапись)=Неопределено Тогда Возврат Неопределено КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	Возврат Истина
КонецФункции
Функция ЗагрузитьЗапистьРегистраСведений(Выборка,Записи,внДанные,СоответствиеСсылок,ТекстОшибки,Отказ,Перезапись)
	Выборка.Сбросить();
	Пока Выборка.Следующий() Цикл
		Запись=Записи.Добавить();
		Индекс=0;
		Для Каждого СтрРеквизит Из внДанные.Реквизиты Цикл
			Если Записи.Отбор.Найти(СтрРеквизит.Реквизит)=Неопределено Тогда
				Значение=ПолучитьЗначение1С_РеквизитРегистраСведений(Выборка,Индекс,СтрРеквизит,СоответствиеСсылок,ТекстОшибки,Отказ,Перезапись); Если Значение=Неопределено Тогда Возврат Неопределено КонецЕсли;
				Запись[СтрРеквизит.Реквизит]=Значение;
			Иначе
				Запись[СтрРеквизит.Реквизит]=Записи.Отбор[СтрРеквизит.Реквизит].Значение	
			КонецЕсли;	
			Индекс=Индекс+1;
		КонецЦикла;
	КонецЦикла;
	Возврат ЗаписатьНаборЗаписейРегистраСведений(внДанные,Записи,ТекстОшибки,Отказ)
КонецФункции	
Функция ЗаписатьНаборЗаписейРегистраСведений(внДанные,Записи,ТекстОшибки,Отказ)
	Если ВычислитьПоПравилу(внДанные,внДанные.Правило,Записи,ТекстОшибки,Отказ)=Неопределено Тогда Возврат Неопределено КонецЕсли; //постобработка
	Попытка
		Записи.Записать(Истина);
		Возврат Истина
	Исключение
		Отказ=Истина;
		ТекстОшибки=ТекстОшибки+?(ТекстОшибки="","",Символы.ПС+Символы.Таб)+"Не записан набор записей <"+внДанные.ИмяМД+">"+Символы.ПС+Символы.Таб+ОписаниеОшибки();
		Возврат Неопределено
	КонецПопытки
КонецФункции	
Функция ПолучитьЗначение1С_РеквизитРегистраСведений(Выборка,НомерРеквизита,Измерение,СоответствиеСсылок,ТекстОшибки,Отказ,Перезапись)
	СтрИндекс=Формат(НомерРеквизита,"ЧН=0; ЧГ=0");
	Значение=Выборка["Значение"+СтрИндекс];
	Если Не ПустаяСтрока(Значение) Тогда
	//примитивные типы
		ДанныеВнСсылки=Новый Структура("Значение,ВнешнийТип,ПравилоПоискаРеквизит,ПравилоРеквизит",Значение,Измерение.ВнешнийРеквизит.Тип,Измерение.ПравилоПоиска,Измерение.Правило);
		Возврат ПолучитьЗначение1С(ДанныеВнСсылки,СоответствиеСсылок,ТекстОшибки,Отказ,Перезапись);
	Иначе
	//объектные типы	
		ДанныеВнСсылки=СсылкаВнешнегоОбъекта(Выборка["ЗначениеСсылка"+СтрИндекс]);
		Если ДанныеВнСсылки.Количество()=0 Тогда Возврат NULL
		Иначе Возврат ПолучитьЗначение1С(ДанныеВнСсылки[0],СоответствиеСсылок,ТекстОшибки,Отказ,Перезапись)
		КонецЕсли;	
	КонецЕсли;
КонецФункции	

Функция ПреобразованиеПримитивногоТипа(внДанные,ТекстОшибки,Отказ)
	Если внДанные.ВнешнийТип="Строка" Тогда Значение=внДанные.Значение
	ИначеЕсли внДанные.ВнешнийТип="Число" Тогда Значение=Число(внДанные.Значение)
	ИначеЕсли внДанные.ВнешнийТип="Булево" Тогда Значение=Булево(внДанные.Значение)
	ИначеЕсли внДанные.ВнешнийТип="Дата" Тогда Значение=Дата(внДанные.Значение)
	Иначе
		Попытка Значение=Вычислить(внДанные.Значение) 
		Исключение Значение=внДанные.Значение КонецПопытки
	КонецЕсли;
	
	Значение=ВычислитьПоПравилу(внДанные,внДанные.ПравилоПоискаРеквизит,Значение,ТекстОшибки,Отказ); //программный поиск ссылки
	Возврат ВычислитьПоПравилу(внДанные,внДанные.ПравилоРеквизит,Значение,ТекстОшибки,Отказ); //программная постобработка
КонецФункции	
Функция Правило(Данные,ТипПравила="") //выбор приоритетного правила (переопределение). ТипПравила="Поиска"/""
	Если Данные.ТипЗаписиВнОбъекта="Реквизит" Тогда
		Если Не Данные["Правило"+ТипПравила+"Реквизит"].Пустая() Тогда Возврат Данные["Правило"+ТипПравила+"Реквизит"] //в первую очередь поиск по реквизиту
		Иначе Возврат Данные["Правило"+ТипПравила] //иначе поиск по текущему типу объекта
		КонецЕсли	
	Иначе
		Возврат Данные["Правило"+ТипПравила]
	КонецЕсли;	
КонецФункции	
Функция ВыполнитьСКД(Схема,Параметры) //Внешние данные + Конвертация
	КомпоновщикМакета=Новый КомпоновщикМакетаКомпоновкиДанных;
	Настройки=Схема.НастройкиПоУмолчанию;
	Для Н=0 По Параметры.Количество()-1 Цикл Настройки.ПараметрыДанных.Элементы[Н].Значение=Параметры[Н] КонецЦикла;
	Макет=КомпоновщикМакета.Выполнить(Схема,Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки=Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет,,,Истина);
	ПроцессорВывода=Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Возврат ПроцессорВывода.Вывести(ПроцессорКомпоновки,Истина)
КонецФункции	
Функция ДанныеКЗагрузке(НомерПоследнегоЗагруженногоПакета,НомерПоследнегоВыгруженногоПакета,БазаДанных) //таблица ссылок к загрузке + Конвертация данных к ним
	//выбираем пакеты в диапазоне от >НомерПоследнегоЗагруженногоПакета до <=НомерПоследнегоВыгруженногоПакета 
	Параметры=Новый Массив;
	Параметры.Добавить(БазаДанных);
	Параметры.Добавить(""); // здесь будут храниться реквизиты
	Параметры.Добавить(НомерПоследнегоВыгруженногоПакета);
	Параметры.Добавить(НомерПоследнегоЗагруженногоПакета);
	Возврат ВыполнитьСКД(Справочники.Renault_КонвертацияДанных.ПолучитьМакет("ДанныеКЗагрузке"),Параметры)
КонецФункции	
Функция РеквизитыВнешнегоОбъекта(ВнешняяСсылка) //таблица реквизитов внешнего объекта
	Параметры=Новый Массив;
	Параметры.Добавить(ВнешняяСсылка);
	Параметры.Добавить(""); // здесь будут храниться реквизиты
	Возврат ВыполнитьСКД(Справочники.Renault_КонвертацияДанных.ПолучитьМакет("ДанныеВнешнегоОбъекта"),Параметры)
КонецФункции
Функция СсылкаВнешнегоОбъекта(ЗначениеСсылка) //ссылка внешнего объекта
	Параметры=Новый Массив;
	Параметры.Добавить(ЗначениеСсылка);
	Параметры.Добавить(""); // здесь будут храниться реквизиты
	Возврат ВыполнитьСКД(Справочники.Renault_КонвертацияДанных.ПолучитьМакет("ДанныеВнешнейСсылки"),Параметры)
КонецФункции	

Функция ВычислитьПоПравилу(ДанныеВнСсылки,Правило,Значение,ТекстОшибки,Отказ)//программный поиск ссылки по правилам конвертации
//в переменной "Значение" передано значение определенное по правилу - в случае программной постобработки, в нее же и надо поместить результат
	//Правило=ДанныеВнСсылки.Правило;
	Если Не ЗначениеЗаполнено(Правило) Тогда Возврат Значение
	ИначеЕсли Найти(Строка(Правило),"<Объект не найден>")>0 Тогда 
		Отказ=Истина;
		Сообщить("Удалено ссылка на правило <"+Правило+"> для значения <"+Значение+">",СтатусСообщения.Внимание);
		Возврат Неопределено 
	КонецЕсли;
	Попытка
		ЗначениеПравила=Справочники.Renault_Правила.ПолучитьЗначение(Правило);
		Если Правило.ВидПравила=Перечисления.Renault_ВидыПравил.Формула Тогда
			Возврат Вычислить(ЗначениеПравила)
		ИначеЕсли Правило.ВидПравила=Перечисления.Renault_ВидыПравил.Программа Тогда
			Выполнить(ЗначениеПравила); // в результате должна быть переопределена переменная
			Возврат Значение
		Иначе Возврат ЗначениеПравила //примитивный или ссылочный тип правила	
		КонецЕсли;
	Исключение
		Отказ=Истина; //критическая ошибка
		ТекстОшибки=ТекстОшибки+?(ТекстОшибки="","",Символы.ПС+Символы.Таб)+"Ссылка не определена по правилу <"+Правило+">"+Символы.ПС+Символы.Таб+ОписаниеОшибки();
		Возврат Неопределено
	КонецПопытки;	
КонецФункции	
Функция ПоискПоUUID(ИмяМД,UUID,ЭтоГруппа) //поиск и создание объекта 1С по UUID
	СтрМД=СтруктураМетаданных(ИмяМД,Истина); 
	Если СтрМД=Неопределено Тогда Возврат Неопределено КонецЕсли;
	//Стр=СтрЗаменить(ИмяМД,".",Символы.ПС);
	//СтрМД=Новый Структура("Тип,Вид",СтрПолучитьСтроку(Стр,1),СтрПолучитьСтроку(Стр,2));
	//
	//СоставМетаданных=СоставМетаданных();
	//Если СоставМетаданных.Свойство(СтрМД.Тип)=Неопределено Тогда
	//	Сообщить("Не определен менеджер объекта <"+ИмяМД+">",СтатусСообщения.Внимание); 
	//	Возврат Неопределено
	//КонецЕсли;	
	//Менеджер=СоставМетаданных[СтрМД.Тип][СтрМД.Вид];
	
	ВнутренняяСсылка=СтрМД.Менеджер.ПолучитьСсылку(UUID);
	ВнутреннийОбъект=ВнутренняяСсылка.ПолучитьОбъект();
	Если ВнутреннийОбъект=Неопределено Тогда
	//Если Лев(ВнутренняяСсылка,18)="<Объект не найден>" Тогда
		ВнутреннийОбъект=СоздатьНовыйОбъект(СтрМД.Тип,СтрМД.Менеджер,ЭтоГруппа);
		Если ВнутреннийОбъект=Неопределено Тогда Возврат Неопределено КонецЕсли;
		ВнутреннийОбъект.УстановитьСсылкуНового(ВнутренняяСсылка);
	КонецЕсли;
	Возврат ВнутреннийОбъект
КонецФункции
Функция ПоискПоПолям(ИмяМД,ПоляПоиска,ЭтоГруппа,СоответствиеСсылок,Перезапись) //поиск и создание объекта 1С по UUID
	СтрМД=СтруктураМетаданных(ИмяМД,Истина); 
	Если СтрМД=Неопределено Тогда Возврат Неопределено КонецЕсли;
	
	Построитель=Новый ПостроительЗапроса("Выбрать Первые 1 Ссылка Из "+ИмяМД);
	Построитель.ЗаполнитьНастройки();
	
	Для Каждого СтрПоле Из ПоляПоиска Цикл
		ТекстОшибки="";
		Отказ=Ложь;
		Значение=ПолучитьЗначение1С(СтрПоле,СоответствиеСсылок,ТекстОшибки,Отказ,Перезапись);
		Если Отказ Тогда 
			Сообщить("Не определено поле <"+СтрПоле.Реквизит+"> для поиска Ссылки типа <"+ИмяМД+">:"+Символы.ПС+Символы.Таб+ТекстОшибки,СтатусСообщения.Внимание); 
			Возврат Неопределено 
		КонецЕсли;
		//отбор построителя
		Отбор=Построитель.Отбор.Добавить("Ссылка."+СтрПоле.Реквизит,СтрПоле.Реквизит);
		Отбор.ВидСравнения=ВидСравнения.Равно;
		Отбор.Значение=Значение;
		Отбор.Использование=Истина;
	КонецЦикла;
	
	Построитель.Выполнить();
	Если Построитель.Результат.Пустой() Тогда 
		//Возврат СтрМД.Менеджер.ПустаяСсылка()
		Возврат СоздатьНовыйОбъект(СтрМД.Тип,СтрМД.Менеджер,ЭтоГруппа); //создать новый 
		//Для Каждого Отбор Из Построитель.Отбор Цикл Объект[СтрПоле.Реквизит]=Отбор.Значение КонецЦикла; //заполнить поля поиска - это лишнее т.к. они все равно перетрутся последующим заполнением полей
	Иначе
		Выборка=Построитель.Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка.ПолучитьОбъект()
	КонецЕсли;
	
КонецФункции	
Функция СоздатьНовыйОбъект(Тип,Менеджер,ЭтоГруппа)
	Если Тип="Справочник" Тогда Возврат ?(ЭтоГруппа,Менеджер.СоздатьГруппу(),Менеджер.СоздатьЭлемент())
	ИначеЕсли Тип="Документ" Тогда Возврат Менеджер.СоздатьДокумент()
	ИначеЕсли Тип="ПланВидовХарактеристик" Тогда Возврат Менеджер.СоздатьЭлемент()
	ИначеЕсли Тип="ПланСчетов" Тогда Возврат Менеджер.СоздатьСчет()
	ИначеЕсли Тип="ПланВидовРасчета" Тогда Возврат Менеджер.СоздатьВидРасчета()
	ИначеЕсли Тип="БизнесПроцесс" Тогда Возврат Менеджер.СоздатьБизнесПроцесс()
	ИначеЕсли Тип="Задача" Тогда Возврат Менеджер.СоздатьЗадачу()
	ИначеЕсли Тип="ПланОбмена" Тогда Возврат Менеджер.СоздатьУзел()
	Иначе Сообщить("Для типа метаданных <"+Тип+"> не определен метод создания нового. Обратитесь к разработчику.",СтатусСообщения.Внимание); Возврат Неопределено КонецЕсли
КонецФункции	
Процедура ОчисткаОбъекта1С(Объект1С,ЗапрещенныйВидИспользования)
	Если Не Объект1С.ЭтоНовый() Тогда
		МетаданныеОбъекта=Объект1С.Метаданные();
		Для каждого МД Из МетаданныеОбъекта.Реквизиты Цикл
			Если ЗапрещенныйВидИспользования<>"" И МД.Использование=ЗапрещенныйВидИспользования Тогда Продолжить КонецЕсли;
			Объект1С[МД.Имя]="" 
		КонецЦикла;
		Для каждого МДТЧ Из МетаданныеОбъекта.ТабличныеЧасти Цикл
			Если ЗапрещенныйВидИспользования<>"" И МДТЧ.Использование=ЗапрещенныйВидИспользования Тогда Продолжить КонецЕсли;
			Объект1С[МДТЧ.Имя].Очистить()
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
Функция ЗапрещенныйВидИспользования(Объект1С,ИмяМД) //для справочника не все реквизиты есть у группы и элемента
	Если Найти(ИмяМД,"Справочник.")>0 Тогда 
		Возврат ?(Объект1С.ЭтоГруппа,Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента,Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы)
	Иначе Возврат "" КонецЕсли
КонецФункции

Функция ЗаписатьВиртуальныеТаблицы(Объект1С,ТекстОшибки,Отказ) //запись виртуальных таблиц для Объект1С
	//где:
	//Объект1С - Созданная внутренняя ссылка по данным ДанныеСсылки
	//Объект1С.ДополнительныеСвойства.ВиртуальныеТаблицы - ТаблицаЗначений с описанием виртуальных таблиц
	//Объект1С.ДополнительныеСвойства.ДанныеСсылки - данные внешней ссылки (по СКД)
	//Объект1С.ДополнительныеСвойства.ДанныеРеквизитовСсылки - таблица реквизитов внешнего объекта + Конвертация (по СКД)
	
	Для Каждого ВиртТабл Из Объект1С.ДополнительныеСвойства.ВиртуальныеТаблицы Цикл
		Если ВиртТабл.ТолькоЧтение Тогда Продолжить КонецЕсли;
		ИмяМД=ВиртТабл.Имя;
		Если Найти(ИмяМД,"РегистрСведений.")>0 Тогда
			Менеджер=Вычислить(СтрЗаменить(ИмяМД,"РегистрСведений.","РегистрыСведений."));
			
			Если ВиртТабл.ПравилоПоиска.Пустая() Тогда 
			//построчная запись регистра
				Для Каждого Строка Из ВиртТабл.Строки Цикл
					Запись=Менеджер.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(Запись,Строка);
					Запись=ВычислитьПоПравилу(Объект1С,ВиртТабл.Правило,Запись,ТекстОшибки,Отказ); //постобработка
					Если Отказ Тогда Прервать КонецЕсли;					
					Попытка Запись.Записать()
					Исключение 
						Отказ=Истина;
						ТекстОшибки=ТекстОшибки+?(ТекстОшибки="","",Символы.ПС+Символы.Таб+"Ошибка записи <"+ИмяМД+">:"+Символы.ПС+Символы.Таб+ОписаниеОшибки());
					КонецПопытки;	
				КонецЦикла;
				
			Иначе
			//пакетная запись регистра - набором записей
				//обязательно установить отбор, иначе можно стереть все записи регистра. Пример: НаборЗаписей.Отбор.Объект.Установить(Ссылка)
				НаборЗаписей=ВычислитьПоПравилу(Объект1С,ВиртТабл.ПравилоПоиска,Менеджер.СоздатьНаборЗаписей(),ТекстОшибки,Отказ); //поиск в данном случае - отбор по регистру
				Если Отказ Тогда Сообщить("Ошибка отбора набора записей <"+ИмяМД+">",СтатусСообщения.Внимание); Продолжить КонецЕсли;
				Для Каждого Строка Из ВиртТабл.Строки Цикл ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(),Строка) КонецЦикла;
				НаборЗаписей=ВычислитьПоПравилу(Объект1С,ВиртТабл.Правило,НаборЗаписей,ТекстОшибки,Отказ); //постобработка
				Если Отказ Тогда Сообщить("Ошибка записи набора записей <"+ИмяМД+">",СтатусСообщения.Внимание) Иначе НаборЗаписей.Записать() КонецЕсли;
			КонецЕсли;	

		Иначе
			Отказ=Истина;
			ТекстОшибки=ТекстОшибки+?(ТекстОшибки="","",Символы.ПС+Символы.Таб+"Не задан алгоритм конвертиции для виртуальной таблицы <"+ИмяМД+">");
		КонецЕсли;	
	КонецЦикла;
	//Возврат Не Отказ
КонецФункции	

Процедура Renault_ВыгрузкаДанныхVOC(Парам = Неопределено) Экспорт
	
	ОбработкаВыгрузки = Обработки.Renault_ВыгрузкаВVOC.Создать();
	Настройки = Константы.Renault_НастройкиВыгрузкиVOC.Получить().Получить();
	ЗаполнитьЗначенияСвойств(ОбработкаВыгрузки,Настройки);
	Для каждого Эл из Настройки Цикл
		Если ТипЗнч(Эл.Значение) = Тип("ТаблицаЗначений") Тогда
			ОбработкаВыгрузки[Эл.Ключ].Загрузить(Эл.Значение);
		КонецЕсли;
	КонецЦикла;
	
	
	#Если НЕ Клиент Тогда
		//выгружаем данные за предыдущую неделю
		ОбработкаВыгрузки.КонецПериода = НачалоНедели(ТекущаяДата())-1;
		ОбработкаВыгрузки.НачалоПериода = НачалоНедели(ОбработкаВыгрузки.КонецПериода);		
	#КонецЕсли
	ОбработкаВыгрузки.ВыгрузитьЗаказНаряды();
	 
	ТаблицаДанных = ОбработкаВыгрузки.РезультатПоЗаказНарядам.Выгрузить();
	Если ТаблицаДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ТаблицаДанных.Колонки.Удалить("ЗаказНаряд");
	ТаблицаДанных.Колонки.Удалить("Организация");
	ВременныйФайл = ПолучитьИмяВременногоФайла("xls");
 	ОбработкаВыгрузки.ВыгрузитьЗаказНарядыВФаил(ВременныйФайл,ТаблицаДанных);	
	Данные = Новый ДвоичныеДанные(ВременныйФайл);
	
	ДанныеКОтправке = Новый ХранилищеЗначения(Данные);
	
	ВебСервис = ПолучитьВебСервисВыгрузкиVOC();
	
	BIR = Константы.Renault_BIR_db.Получить();
	
	ТипОтчета = "Заказ-наряды";
	
	Ответ = ВебСервис.UploadVocReport(BIR,ОбработкаВыгрузки.Логин,ОбработкаВыгрузки.Пароль,ДанныеКОтправке,ТипОтчета);
	#Если Клиент Тогда
		Сообщить(Ответ);
	#Иначе	
		Если Ответ <> "Успешно загружен!" Тогда
			ЗаписьЖурналаРегистрации("Регламентное задание Renault_ВыгрузкаДанныхVOC" , УровеньЖурналаРегистрации.Ошибка,,,""+ Ответ);
		КонецЕсли;
	#КонецЕсли
		
КонецПроцедуры

Функция СформироватьТелоЗапроса(Значение)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Значение);
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция ПолучитьВебСервисВыгрузкиVOC()
	
		
	Перем ВебСервис;
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	
	Адрес = Настройки.АдресWsGate+"ws/RenaultReports.1cws?wsdl";
	ПарольWS = Настройки.ПарольДоступаКВебСервисам;
	ЛогинWS = Настройки.ЛогинДоступаКВебСервисам;
	ОпределениеСервиса = Новый WSОпределения(Адрес, ЛогинWS, ПарольWS);
	
	Если Renault_ОбщиеФункции.СтараяПлатформа() Тогда
		Выполнить("ВебСервис=Новый WSПрокси(ОпределениеСервиса,""http://renault-nissan.com/schema/RenaultReports"",""Renault_Reports"",""Renault_ReportsSoap12"",60)");
	Иначе
		Выполнить("ВебСервис=Новый WSПрокси(ОпределениеСервиса,""http://renault-nissan.com/schema/RenaultReports"",""Renault_Reports"",""Renault_ReportsSoap12"",,60)");
	КонецЕсли;	
	
	ВебСервис.Пользователь	 = ЛогинWS;
	ВебСервис.Пароль		 = ПарольWS;
	
	Возврат ВебСервис;
	
КонецФункции
