Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
	//Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

//v+
Процедура ПередЗаписью(Отказ)   	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Козлов Е.А. Начало 19.10.2016
	//События.Свернуть("Событие","Создание,Просмотр,Редактирование");
	События.Свернуть("Событие", "Создание, Просмотр, Редактирование, ВремяОтправкиУтроС, ВремяОтправкиУтроПо, ВремяОтправкиВечерС, ВремяОтправкиВечерПо");
	//Козлов Е.А. Конец
КонецПроцедуры
//v-

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры