
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Renault_ОстаткиПТС Приход
	Движения.Renault_ОстаткиПТС.Записывать = Истина;
	Для Каждого ТекСтрокаСостав Из Состав Цикл
		Движение = Движения.Renault_ОстаткиПТС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад = СкладКомпании;
		Движение.ПТС = ТекСтрокаСостав.ПТС;
		Движение.Количество = 1;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) И ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеАвтомобилей") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
		Для Каждого стр Из ДанныеЗаполнения.Автомобили Цикл
			ПТС = Справочники.ПодтверждающиеДокументы.НайтиПоРеквизиту("Владелец", Стр.Автомобиль);
			Если ПТС.Пустая() Тогда
				Продолжить;
			Иначе
				СтрПТС = Состав.Добавить();
				СтрПТС.ПТС = ПТС;
				СтрПТС.Автомобиль = Стр.Автомобиль;
				СтрПТС.Ответственный = Автор;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	УникальныеПТС = Состав.Выгрузить(, "ПТС");
	УникальныеПТС.Свернуть("ПТС");
	Если УникальныеПТС.Количество() <> Состав.Количество() Тогда
		Сообщить("В списке документов ПТС есть повторяющиеся строки");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
