#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ИспользоватьОтборПоПредставителям Тогда
		Представители.Очистить();
	КонецЕсли;
	
	Если НЕ ИспользоватьОтборПоДилерам Тогда
		ДилерскиеЦентры.Очистить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	РежимВыгрузкиПриНеобходимости = Перечисления.DMS_РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости;
	
	ИспользоватьОтборПоДилерам 		  = Истина;
	ИспользоватьОтборПоПредставителям = Истина;
	
КонецПроцедуры

////#КонецОбласти

#КонецЕсли