
//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
// Процедура заполняет таблицу телефонов для объекта
//
// Параметры:
//	Ссылка	- Произвольный	- ссылка на владельца телефонов
//
Процедура ЗаполнитьТаблицуТелефонов(Ссылка)
	СписокТелефонов.Очистить();
	МассивТелефонов = сфпСофтФонПроСервер.сфпПолучитьСписокТелефоновИФаксов(Ссылка);
	Для Каждого ЭлементМассива Из МассивТелефонов Цикл
		НоваяСтрока					= СписокТелефонов.Добавить();
		НоваяСтрока.Вид 			= ЭлементМассива.Вид;
		НоваяСтрока.Представление	= ЭлементМассива.Представление;
		НоваяСтрока.Ссылка 			= Ссылка;
	КонецЦикла;	
	Если СписокТелефонов.Количество() = 0 Тогда
		ПозвонитьПоНомеру = "";
	Иначе
		ПозвонитьПоНомеру = СписокТелефонов[0].Представление;
	КонецЕсли;
КонецПроцедуры // ЗаполнитьТаблицуТелефонов()

&НаСервере
// Процедура добавляет в таблицу телефонов объекта его внутренний номер
//
// Параметры:
//	Ссылка	- Произвольный	- ссылка на владельца телефонов
//
Процедура ДобавитьВнутреннийНомер(Ссылка)
	Если ПустаяСтрока(Ссылка.сфпТекущийВнутреннийНомер) Тогда Возврат; КонецЕсли;
	Попытка
		ВнутреннийНомер = Число(сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(Ссылка.сфпТекущийВнутреннийНомер));
	Исключение
		ВнутреннийНомер = 0;
	КонецПопытки;	
	Если ВнутреннийНомер = 0 Тогда Возврат; КонецЕсли;
	ОтборНомера = Новый Структура;
	ОтборНомера.Вставить("Представление", Ссылка.сфпТекущийВнутреннийНомер);
	МассивСтрок = СписокТелефонов.НайтиСтроки(ОтборНомера); 
	Если МассивСтрок.Количество() > 0 Тогда Возврат; КонецЕсли;
	НоваяСтрока					= СписокТелефонов.Вставить(0);
	НоваяСтрока.Вид 			= Справочники.ВидыКонтактнойИнформации.ТелефонПользователя;
	НоваяСтрока.Представление	= Ссылка.сфпТекущийВнутреннийНомер;
	НоваяСтрока.Ссылка 			= Ссылка;
	ПозвонитьПоНомеру = СписокТелефонов[0].Представление;
КонецПроцедуры // ДобавитьВнутреннийНомер()
	
&НаКлиенте
// Процедура выполняет действия после выбора номера телефона
//
// Параметры:
//	Нет.
//
Процедура ВыбратьКонтакт()
	Если ПустаяСтрока(ПозвонитьПоНомеру) Тогда
		Возврат;
	ИначеЕсли СписокТелефонов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	НабранныйКонтакт = Новый Структура;
	НабранныйКонтакт.Вставить("Контакт",		СписокТелефонов[0].Ссылка);
	НабранныйКонтакт.Вставить("НомерТелефона",	ПозвонитьПоНомеру);
	Попытка
		Закрыть(НабранныйКонтакт);
	Исключение
	КонецПопытки;
КонецПроцедуры // ВыбратьКонтакт()

&НаКлиенте
// Процедура - обработчик события "ПриАктивизацииСтроки" табличной части "Партнеры"
//
// Параметры:
//	Нет.
//
Процедура ОбработчикПартнерыПриАктивизацииСтроки()
	ТД = Элементы.Партнеры.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	ИначеЕсли ТекущийКонтакт = ТД.Ссылка Тогда
		Возврат;
	КонецЕсли;
	ТекущийКонтакт = ТД.Ссылка;
	ЗаполнитьТаблицуТелефонов(ТД.Ссылка);
КонецПроцедуры // ОбработчикПартнерыПриАктивизацииСтроки()

&НаКлиенте
// Процедура - обработчик события "ПриАктивизацииСтроки" табличной части "КонтактныеЛица"
//
// Параметры:
//	Нет.
//
Процедура ОбработчикКонтактныеЛицаПриАктивизацииСтроки()
	ТД = Элементы.КонтактныеЛица.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	ИначеЕсли ТекущийКонтакт = ТД.Ссылка Тогда
		Возврат;
	КонецЕсли;
	ТекущийКонтакт = ТД.Ссылка;
	ЗаполнитьТаблицуТелефонов(ТД.Ссылка);
КонецПроцедуры // ОбработчикКонтактныеЛицаПриАктивизацииСтроки()

&НаКлиенте
// Процедура - обработчик события "ПриАктивизацииСтроки" табличной части "Пользователи"
//
// Параметры:
//	Нет.
//
Процедура ОбработчикПользователиПриАктивизацииСтроки()
	ТД = Элементы.Пользователи.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	ИначеЕсли ТекущийКонтакт = ТД.Ссылка Тогда
		Возврат;
	КонецЕсли;
	ТекущийКонтакт = ТД.Ссылка;
	ЗаполнитьТаблицуТелефонов(ТД.Ссылка);
	ДобавитьВнутреннийНомер(ТД.Ссылка);
КонецПроцедуры // ОбработчикПользователиПриАктивизацииСтроки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ ДЕЙСТВИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
// Процедура - обработчик события "Выбор" табличной части "Партнеры"
//
// Параметры:
//	Нет.
//
Процедура ПартнерыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьКонтакт();
КонецПроцедуры // ПартнерыВыбор()

&НаКлиенте
// Процедура - обработчики события "ПриАктивизацииСтроки" табличной части "Партнеры"
//
Процедура ПартнерыПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ОбработчикПартнерыПриАктивизацииСтроки", 0.1, Истина);
КонецПроцедуры // ПартнерыПриАктивизацииСтроки()

&НаКлиенте
// Процедура - обработчик события "Выбор" табличной части "КонтактныеЛица"
//
// Параметры:
//	Нет.
//
Процедура КонтактныеЛицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьКонтакт();
КонецПроцедуры // КонтактныеЛицаВыбор()

&НаКлиенте
// Процедура - обработчики события "ПриАктивизацииСтроки" табличной части "КонтактныеЛица"
//
Процедура КонтактныеЛицаПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ОбработчикКонтактныеЛицаПриАктивизацииСтроки", 0.1, Истина);
КонецПроцедуры // КонтактныеЛицаПриАктивизацииСтроки()

&НаКлиенте
// Процедура - обработчик события "Выбор" табличной части "Пользователи"
//
// Параметры:
//	Нет.
//
Процедура ПользователиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьКонтакт();
КонецПроцедуры // ПользователиВыбор()

&НаКлиенте
// Процедура - обработчики события "ПриАктивизацииСтроки" табличной части "Пользователи"
//
Процедура ПользователиПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ОбработчикПользователиПриАктивизацииСтроки", 0.1, Истина);
КонецПроцедуры // ПользователиПриАктивизацииСтроки()

&НаКлиенте
// Процедура - обработчики события "Выбор" элемента формы "СписокТелефонов"
//
Процедура СписокТелефоновВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьКонтакт();
КонецПроцедуры // СписокТелефоновВыбор()

&НаКлиенте
// Процедура - обработчики события "ПриАктивизацииСтроки" элемента формы "СписокТелефонов"
//
Процедура СписокТелефоновПриАктивизацииСтроки(Элемент)
	ТД = Элементы.СписокТелефонов.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		ПозвонитьПоНомеру = "";
	Иначе
		ПозвонитьПоНомеру = ТД.Представление;
	КонецЕсли;
КонецПроцедуры // СписокТелефоновПриАктивизацииСтроки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД ФОРМЫ

&НаКлиенте
// Процедура - обработчик команды формы "Позвонить"
//
Процедура Позвонить(Команда)
	ВыбратьКонтакт();
КонецПроцедуры
