// Модуль документа Сделка

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем ИмяРеквизитаКода Экспорт;     // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/атрикула в ТЧ
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	 
	ОбязательныеРеквизиты.Вставить("Автор",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("Менеджер",1);
	ОбязательныеРеквизиты.Вставить("РуководительМенеджера",1);
	
	ОбязательныеОпции=Новый Структура();
	ОбязательныеОпции.Вставить("Опция",      3);
	ОбязательныеОпции.Вставить("Количество", 1);
	ОбязательныеРеквизиты.Вставить("ОпцииДЦ",  ОбязательныеОпции);
	
	Возврат ОбязательныеРеквизиты;
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Проверяет корректность заполнения объекта.
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры:
//  Ошибки       - строка, в случае некорректного заполнения содержит описанием возникших ошибок, 
//  ДопРеквизиты - структура, на вход может быть передана структура с дополнительными реквизитами для проверки,
//  Заполнение   - булево, флаг проверки, 
//  Уникальность - булево, флаг проверки.
//
// Возвращаемое значение:
//  Булево - Возвращает Истина если все заполнено корректно и Ложь иначе.
// 
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	Возврат Результат;	
КонецФункции // ПроверитьКорректность()

// Проверяет корректность заполнения табличных частей объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
Функция ПроверитьЗаполненностьТЧ(Ошибки="", ДопРеквизиты=Неопределено) Экспорт
	//Документ считаем корректно заполненным, независимо от заполненности табличных частей
	Возврат Истина;
КонецФункции

// Функция проверяет, допустимо ли изменение объекта
//
// Параметры:
//  БлокироватьРеквизиты - структура, структура блокируемых на изменение реквизитов.
//
// Возвращаемое значение:
// Булево - Возвращает Истина, если изменения возможны, ложь иначе
//          Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
//
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции // ДоступностьИзменения()

// Возвращает список возможных хозяйственных операций документа
// Вовращаемое значение: 
//  СписокЗначений. 
//  Строка списка: Значение - имя предопределенного элемента; 
//				   Представление - красивое его представление
// 				   "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("Сделка", "Сделка", Истина);

	Возврат СписокХозОпераций;
КонецФункции // ПолучитьСписокХозОпераций()

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка			– Имя реквизита документа с полным путем (например Тавары.Номенклатура).
//  ЭтаФорма	– Форма				– Ссылка на форму документа. Если значение неопределено, производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Стркутура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	
	//
	НДС20 = Справочники.СтавкиНДС.НайтиПоНаименованию("НДС 20%");
	//
	
	Результат = Истина;
	
	Если Имя="Контрагент" Тогда
		Если ТипЗнч(Контрагент)=Тип("СправочникСсылка.Контрагенты") Тогда
			Результат	= дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);							
		КонецЕсли;
		
		#Если Клиент Тогда
		КодРегиона = "";
		КодГорода = "";
		НомерТелефона = "";
		ВнутреннийНомер = "";
		ПредставлениеТелефона = "";
		ВидТелефона = Неопределено;
		Если ЗначениеЗаполнено(Контрагент) Тогда
			Телефоны = киПолучитьСписокТелефоновОбъекта(Контрагент);
			Если Телефоны<>Неопределено И Телефоны.Количество()>0 Тогда
				ЗаполнитьЗначенияСвойств(ЭтотОбъект,Телефоны[0].Значение);
			КонецЕсли;
		КонецЕсли; 
		#КонецЕсли
		
		Возврат Результат;
		
	ИначеЕсли Имя="ТипЦен" Тогда
		Результат = дкОбработкаРеквизита(ЭтотОбъект, Имя, ТекСтрока, ЭтаФорма, ДопПараметры);
		// Определение цены автомобиля
		Если ЗначениеЗаполнено(Автомобиль) Тогда
			РозничнаяЦена = обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль, ВариантКомплектации", Автомобиль, Справочники.ВариантыКомплектации.ПустаяСсылка()),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
		Иначе
			РозничнаяЦена	= обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль, ВариантКомплектации", Модель, ВариантКомплектации),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
		КонецЕсли;			
		Результат		= ОбработкаРеквизита("СуммаПродажи",ТекСтрока,ЭтаФорма,ДопПараметры) И Результат;
		Возврат Результат;
		
	ИначеЕсли Имя="Автомобиль" Тогда
		Результат = Истина;
		
		Если ЗначениеЗаполнено(Автомобиль) Тогда
			Если ДопПараметры = Неопределено Тогда
				ДопПараметры = Новый Структура;
			КонецЕсли;
			ДопПараметры.Вставить("НеИзменятьЦенуАвтомобиля",Истина);
			Модель				= Автомобиль.Модель;
			ВариантКомплектации	= Автомобиль.ВариантКомплектации;
			Результат			= ОбработкаРеквизита("Модель", ТекСтрока, ЭтаФорма, ДопПараметры);
			Результат			= ОбработкаРеквизита("ВариантКомплектации", ТекСтрока, ЭтаФорма, ДопПараметры);
			ДопПараметры.Удалить("НеИзменятьЦенуАвтомобиля");
			Цвет				= Автомобиль.Цвет;
			ВИН 				= Автомобиль.VIN;
		КонецЕсли;
		
		// Определение цены автомобиля
		Если ЗначениеЗаполнено(Автомобиль) Тогда
			РозничнаяЦена = обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль, ВариантКомплектации", Автомобиль, Справочники.ВариантыКомплектации.ПустаяСсылка()),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
		Иначе
			РозничнаяЦена	= обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль, ВариантКомплектации", Модель, ВариантКомплектации),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
		КонецЕсли;			
		Результат		= ОбработкаРеквизита("СуммаПродажи",ТекСтрока,ЭтаФорма,ДопПараметры) И Результат;
		
		#Если Клиент Тогда
			дкСообщитьОЗаметках(ЭтотОбъект,ЭтотОбъект["Автомобиль"],ЭтаФорма);
		#КонецЕсли
		
		Возврат Результат;
		
	ИначеЕсли Имя="СуммаПродажи" Тогда
		Результат = Истина;
		РассчитатьСуммуВсего();
		Возврат Результат;
		
	ИначеЕсли Имя="Модель" Тогда
		
		Если НЕ обЗначениеНеЗаполнено(Автомобиль) И Автомобиль.Модель<>Модель Тогда
			Автомобиль	= Справочники.Автомобили.ПустаяСсылка();
			ВИН = "";
			Результат	= ОбработкаРеквизита("Автомобиль", ТекСтрока, ЭтаФорма, ДопПараметры);
		КонецЕсли;
		
		Если ВариантКомплектации.Владелец<>Модель Тогда
			ВариантКомплектации	= Справочники.ВариантыКомплектации.ПустаяСсылка();
			Результат			= ОбработкаРеквизита("ВариантКомплектации",ТекСтрока,ЭтаФорма,ДопПараметры);
		КонецЕсли;
		
		// Определение цены автомобиля
		Если ЗначениеЗаполнено(Автомобиль) Тогда
			РозничнаяЦена = обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль, ВариантКомплектации", Автомобиль, Справочники.ВариантыКомплектации.ПустаяСсылка()),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
		Иначе
			РозничнаяЦена	= обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль, ВариантКомплектации", Модель, ВариантКомплектации),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
		КонецЕсли;			
		Результат		= ОбработкаРеквизита("СуммаПродажи",ТекСтрока,ЭтаФорма,ДопПараметры) И Результат;		
		
		Возврат Результат;
		
	ИначеЕсли Имя="ВариантКомплектации" Тогда
		Результат	= Истина;
		
		Если Автомобиль.ВариантКомплектации<>ВариантКомплектации Тогда
			Автомобиль	= Справочники.Автомобили.ПустаяСсылка();
			ВИН = "";
			Результат	= ОбработкаРеквизита("Автомобиль", ТекСтрока, ЭтаФорма, ДопПараметры);
		КонецЕсли;
		
		Если НЕ обЗначениеНеЗаполнено(ВариантКомплектации) Тогда
			Если ВариантКомплектации.Владелец<>Модель Тогда
				Модель		= ВариантКомплектации.Владелец;
				Результат	= ОбработкаРеквизита("Модель",ТекСтрока,ЭтаФорма,ДопПараметры) И Результат;
			КонецЕсли;
		КонецЕсли;
		
		// Определение цены автомобиля
		Если ЗначениеЗаполнено(Автомобиль) Тогда
			РозничнаяЦена = обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль, ВариантКомплектации", Автомобиль, Справочники.ВариантыКомплектации.ПустаяСсылка()),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
		Иначе
			РозничнаяЦена	= обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль, ВариантКомплектации", Модель, ВариантКомплектации),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
		КонецЕсли;			
		Результат		= ОбработкаРеквизита("СуммаПродажи",ТекСтрока,ЭтаФорма,ДопПараметры) И Результат;		
		
		Для Каждого СтрокаТЧ Из ОпцииДЦ Цикл
			Результат = ОбработкаРеквизита("ОпцииДЦ.Опция",СтрокаТЧ,ЭтаФорма,ДопПараметры) И Результат;
		КонецЦикла;
		
		Возврат Результат;
		
	// ОБРАБОТКА РЕКВИЗИТОВ ТАБЛИЧНОЙ ЧАСТИ "ДОПОЛНИТЕЛЬНОЕ ОБОРУДОВАНИЕ АВТОЦЕНТРА"
	ИначеЕсли Имя="ОпцииДЦ.Опция" Тогда
		Результат	= Истина;
		Если ЭтаФорма<>Неопределено Тогда
			Если НЕ обЗначениеНеЗаполнено(ТекСтрока.Опция) Тогда
				 Если ЭтаФорма.ОборудованиеПроизводителя.НайтиПоЗначению(ТекСтрока.Опция)=Неопределено Тогда
					#Если Клиент Тогда
					Если ЭтаФорма<>Неопределено Тогда
						Сообщить("Опция <"+ТекСтрока.Опция+"> недопустима для данного варианта комплектации.");
					КонецЕсли; 
					#КонецЕсли
					ТекСтрока.Опция=Неопределено;
					Возврат ОбработкаРеквизита("ОпцииДЦ.Опция",ТекСтрока,ЭтаФорма,ДопПараметры);
				 КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
		
		// проверим а не набор ли у нас...
		Если НЕ ТекСтрока.Опция.ПризнакНабора Тогда
			// установим количество
			Если ТекСтрока.Количество=0 Тогда ТекСтрока.Количество=1 КонецЕсли;
			// Заполним ставку НДС
			ОсвобожденОтНДС=ПодразделениеКомпании.ОсвобожденОтНДС ИЛИ Организация.ОсвобожденОтНДС;
			Если ОсвобожденОтНДС Тогда
				ТекСтрока.СтавкаНДС=Справочники.СтавкиНДС.БезНДС;
			Иначе
				ТекСтрока.СтавкаНДС=НДС20;//Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
			КонецЕсли;
			// попытаемся получить цену
			ТекСтрока.Цена=обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль,ВариантКомплектации,Опция",Модель,ВариантКомплектации,ТекСтрока.Опция),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
			Результат = ОбработкаРеквизита("ОпцииДЦ.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		Иначе
			// имеем дело с набором, разложим его...
			Набор=ТекСтрока.Опция.СоставНабора;
			КоличествоНабора=ТекСтрока.Количество;
			Если КоличествоНабора=0 Тогда
				КоличествоНабора=1;
			КонецЕсли;
			// удалим строку из табличной части
			ОпцииДЦ.Удалить(ТекСтрока);
			// теперь будем рекурсивно добавлять состав набора
			Для Каждого ОборудованиеИзНабора Из Набор Цикл
				СтрокаТЧ=ОпцииДЦ.Найти(ОборудованиеИзНабора.Опция,"Опция");
				Если СтрокаТЧ=Неопределено Тогда
					СтрокаТЧ=ОпцииДЦ.Добавить();
					СтрокаТЧ.Опция=ОборудованиеИзНабора.Опция;
					СтрокаТЧ.Количество=ОборудованиеИзНабора.Количество*КоличествоНабора;
					ОбработкаРеквизита("ОпцииДЦ.Опция",СтрокаТЧ,ЭтаФорма,ДопПараметры);
					Если обЗначениеНеЗаполнено(СтрокаТЧ.Опция) Тогда
						ОпцииДЦ.Удалить(СтрокаТЧ);
					КонецЕсли; 
				Иначе
					СтрокаТЧ.Количество=СтрокаТЧ.Количество+(ОборудованиеИзНабора.Количество*КоличествоНабора);
					ОбработкаРеквизита("ОпцииДЦ.Количество",СтрокаТЧ,ЭтаФорма,ДопПараметры);
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли;
		Возврат Результат;
		
	ИначеЕсли Имя="ОпцииДЦ.Количество" Тогда
		Результат=ОбработкаРеквизита("ОпцииДЦ.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="ОпцииДЦ.Цена" Тогда
		Результат	= Истина;
		ТекСтрока.Сумма=ТекСтрока.Цена*ТекСтрока.Количество;
		Результат=ОбработкаРеквизита("ОпцииДЦ.СтавкаНДС",ТекСтрока,ЭтаФорма,ДопПараметры);
		Возврат Результат;
		
	ИначеЕсли Имя="ОпцииДЦ.Сумма" Тогда
		ТекСтрока.Цена=?(ТекСтрока.Количество=0,0,ТекСтрока.Сумма/ТекСтрока.Количество);
		Результат=ОбработкаРеквизита("ОпцииДЦ.СтавкаНДС",ТекСтрока,ЭтаФорма,ДопПараметры);
		Возврат Результат;
		
	ИначеЕсли Имя="ОпцииДЦ.СтавкаНДС" Тогда
		СуммаВсегоБезСкидки=ТекСтрока.Сумма;
		// Определим каким образом у нас вычисляется НДС
		ЦенаВключаетНДС=(обЗначениеНеЗаполнено(ТипЦен) ИЛИ ТипЦен.ЦенаВключаетНДС);
		// Расчет НДС
		Если ЦенаВключаетНДС Тогда
			ТекСтрока.СуммаНДС=Окр((СуммаВсегоБезСкидки*ТекСтрока.СтавкаНДС.Ставка)/(100+ТекСтрока.СтавкаНДС.Ставка),2);
		Иначе
			ТекСтрока.СуммаНДС=Окр(СуммаВсегоБезСкидки*ТекСтрока.СтавкаНДС.Ставка/100,2);
		КонецЕсли;
		// В любом случаее идем в секцию "СуммаНДС", т.к. в ней будем произведен расчет суммы всего.
		Результат=ЭтотОбъект.ОбработкаРеквизита("ОпцииДЦ.СуммаНДС",ТекСтрока,ЭтаФорма,ДопПараметры);
		Возврат Результат;
		
	ИначеЕсли Имя="ОпцииДЦ.СуммаНДС" Тогда
		Результат	= Истина;
		СуммаВсегоБезСкидки=ТекСтрока.Сумма;
		// Определим каким образом у нас вычисляется НДС
		ЦенаВключаетНДС=(обЗначениеНеЗаполнено(ТипЦен) ИЛИ ТипЦен.ЦенаВключаетНДС);
		Если ЦенаВключаетНДС Тогда
			ТекСтрока.СуммаВсего=СуммаВсегоБезСкидки;
		Иначе
			ТекСтрока.СуммаВсего=СуммаВсегоБезСкидки+ТекСтрока.СуммаНДС;
		КонецЕсли;
		Возврат Результат;
		
	ИначеЕсли Имя="ОпцииДЦ.СуммаВсего" Тогда
		Результат	= истина;
		// Определим включают ли в себя НДС цены документа
		ЦенаВключаетНДС=(обЗначениеНеЗаполнено(ТипЦен) ИЛИ ТипЦен.ЦенаВключаетНДС);
		// Рассчитаем значение реквизита "Сумма". Если расчет НДС не ведется, то ЦенаВключаетНДС будет всегда Истина. 
		Если ЦенаВключаетНДС Тогда
			ТекСтрока.Сумма=Окр(ТекСтрока.СуммаВсего/(1/100),2);
		Иначе
			Сумма=ТекСтрока.СуммаВсего*100/(100+ТекСтрока.СтавкаНДС.Ставка);
			ТекСтрока.Сумма=Окр(Сумма/(1/100),2);
		КонецЕсли;
		// Пересчитываем цену.
		ТекСтрока.Цена=?(ТекСтрока.Количество=0,0,ТекСтрока.Сумма/ТекСтрока.Количество);
		// Рассчитываем новую сумму НДС. 		
		СуммаВсегоБезСкидки=ТекСтрока.Сумма;
		Если ЦенаВключаетНДС Тогда			
			ТекСтрока.СуммаНДС=Окр((СуммаВсегоБезСкидки*ТекСтрока.СтавкаНДС.Ставка)/(100+ТекСтрока.СтавкаНДС.Ставка),2);
		Иначе
			ТекСтрока.СуммаНДС=Окр(СуммаВсегоБезСкидки*ТекСтрока.СтавкаНДС.Ставка/100,2);
		КонецЕсли;
		Возврат Результат;
		
	ИначеЕсли Имя="Менеджер" Тогда
		Результат	= Истина;
		Возврат Результат;
		
	ИначеЕсли Имя="ХозОперация" Тогда
		Результат	= Истина;
		Возврат Результат;
		
	Иначе	
		Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;		
КонецФункции // ОбработкаРеквизита()

// Функция возвращает сотрудника на основании переданного пользователя
//
Функция ПолучитьСотрудникаПоПользователю(ТекущийПользователь) Экспорт
	ТекущийСотрудник	= Справочники.Сотрудники.ПустаяСсылка();
	
	Если НЕ обЗначениеНеЗаполнено(ТекущийПользователь) И НЕ ПустаяСтрока(ТекущийПользователь.Наименование) Тогда
		Если обЗначениеНеЗаполнено(ТекущийПользователь.Сотрудник) Тогда
			ТекущийСотрудник	= Справочники.Сотрудники.НайтиПоНаименованию(ТекущийПользователь.Наименование, Истина);
			Если обЗначениеНеЗаполнено(ТекущийСотрудник) Тогда
				// Создадим нового сотрудника
				СотрудникОбъект	= Справочники.Сотрудники.СоздатьЭлемент();
				СотрудникОбъект.УстановитьНовыйКод();
				СотрудникОбъект.Наименование	= ТекущийПользователь.Наименование;
				СотрудникОбъект.Организация= ПараметрыСеанса.Организация;
				СотрудникОбъект.Подразделение	= ПараметрыСеанса.ПодразделениеКомпании;
				СотрудникОбъект.Должность		= Справочники.Должности.Неопределена;
				Попытка
					СотрудникОбъект.Записать();
					ТекущийСотрудник	= СотрудникОбъект.Ссылка;
				Исключение КонецПопытки;
			КонецЕсли;
		Иначе
			ТекущийСотрудник	= ТекущийПользователь.Сотрудник;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекущийСотрудник;
КонецФункции

#Если Клиент Тогда

// Функция возвращает данные о контактах с клиентом
//
Функция ПолучитьДанныеОКонтактах(Режим=1, ТолькоОднаЗапись=Истина,ВидСобытия=Неопределено) Экспорт
	Возврат зфРабочийЛистПолучитьДанныеОКонтактах(ЭтотОбъект,Режим,ТолькоОднаЗапись,ВидСобытия);
КонецФункции
	
// Расчет общей балансовой стоимости активов
//
// Возвращаемое значение:
//  СуммаВсего - число - итог по колонке "БалансоваяСтоимость".
//
Функция РассчитатьСуммуВсего() Экспорт
	СуммаПродажи = РозничнаяЦена - СкидкаИмпортера - СкидкаАвтоцентра;
	Если ОпцииДЦ.Количество() > 0 Тогда
		СуммаДокумента = СуммаПродажи + ОпцииДЦ.Итог("СуммаВсего");
	Иначе
		СуммаДокумента = СуммаПродажи;
	КонецЕсли;
	Возврат СуммаДокумента;
КонецФункции // РассчитатьСуммуВсего()

// Выводит сумму по табличной части документа
//
// Параметры:
// ЭтаФорма - форма, форма документа
//
Процедура ВывестиЗаголовокСуммаДокумента(ЭтаФорма) Экспорт	

	Если ЭтаФорма.Модифицированность Тогда
		ВремСумма = РассчитатьСуммуВсего();
	Иначе
		ВремСумма = СуммаДокумента;
	КонецЕсли;		
		
	// обновим надпись валюты и суммы документа
	ТекстВалюта = "";
	Попытка	
		ТекстВалюта = "Валюта: " + СокрЛП(ЭтаФорма.ВалютаДокумента) + " (" + Формат(ЭтаФорма.КурсДокумента,"ЧДЦ = 4") + ")";
		Попытка
			Если ВремСумма <> Неопределено Тогда
				ТекстСумма = " ИТОГО: " + Формат(ВремСумма,"ЧДЦ = 2; ЧН = 0,00");
			КонецЕсли; 
		Исключение
		КонецПопытки;
		ЭтаФорма.ЭлементыФормы.тСуммаДокумента.Заголовок = ТекстВалюта + ТекстСумма;
	Исключение 
	КонецПопытки;
	
	// здесь же установим подписи количества строк в заголовках страниц основной панели
	ТекстЦена = ""; ТекстСкидка = "";
	Попытка
		ТекстЦена = ?(обЗначениеНеЗаполнено(ЭтаФорма.ТипЦен)," < не указан > ",СокрЛП(ЭтаФорма.ТипЦен.Наименование));
	Исключение КонецПопытки;
	ТекстСкидка = "";
	
	Мет = ЭтаФорма.ЭтотОбъект.Метаданные();
	Для Каждого ТаблЧасть Из Мет.ТабличныеЧасти Цикл
		Попытка ЭтаФорма.ЭлементыФормы.ОсновнаяПанель.Страницы[ТаблЧасть.Имя].Заголовок = СокрЛП(ТаблЧасть.Синоним) + " (" + СокрЛП(ЭтаФорма[ТаблЧасть.Имя].Количество()) + " поз.)"; Исключение КонецПопытки;
		// и тут же попытаемся установить текст подвала для колоники "Номенклатура"
		Попытка
			ЭтаФорма.ЭлементыФормы[ТаблЧасть.Имя].Колонки.Цена.ТекстПодвала = ТекстЦена;
		Исключение КонецПопытки;
		Попытка
			ЭтаФорма.ЭлементыФормы[ТаблЧасть.Имя].Колонки.Номенклатура.ТекстПодвала = ?(ПустаяСтрока(ТекстСкидка),"",ТекстСкидка);
		Исключение КонецПопытки;
	КонецЦикла; 
КонецПроцедуры // ВывестиЗаголовокСуммаДокумента()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

// Формирует печатную форму "Чек менеджера"
// Возвращает сформированный табличный документ:
Функция ПечатьМакетЧека(ТабДокумент) Экспорт
	Макет = ПолучитьМакет("МакетЧека");
	
	//зададим параметры макета
	ТабДокумент.ПолеСверху = 10;
	ТабДокумент.ПолеСлева  = 10;
	ТабДокумент.ПолеСнизу  = 10;
	ТабДокумент.ПолеСправа = 10;
	ТабДокумент.ТолькоПросмотр = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	//ТабДокумент.Автомасштаб = Истина;
	
	// Заполняем шапку документа
	ОбластьЧек = Макет.ПолучитьОбласть("Чек");
	
	ОбластьЧек.Параметры.Дата = Формат(Дата, "ДЛФ=Д");	
	
	ОбластьЧек.Параметры.Организация = Организация;
	ОбластьЧек.Параметры.ОрганизацияНаименование = Организация.Наименование;
	ОбластьЧек.Параметры.ЭлПочта = КонтактнаяИнформация(Организация, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
	
	Покупатель = Контрагент;
	Если ТипЗнч(Покупатель) = Тип("СправочникСсылка.Контрагенты") Тогда
		ОбластьЧек.Параметры.Покупатель = Покупатель;
		ОбластьЧек.Параметры.ПокупательФИО = Покупатель.НаименованиеПолное;
	Иначе
		ОбластьЧек.Параметры.ПокупательФИО = Покупатель;
	КонецЕсли;		
	ОбластьЧек.Параметры.ПокупательТелефон = ПредставлениеТелефона;
	
	// Данные автомобиля
	Если Автомобиль <> Неопределено И Не Автомобиль.Пустая() Тогда
		ОбластьЧек.Параметры.ВИН = Автомобиль.VIN;
	КонецЕсли;
	
	ОбластьЧек.Параметры.МаркаМодель = Модель;
	ОбластьЧек.Параметры.Комплектация = ВариантКомплектации;
	ОбластьЧек.Параметры.Цвет = Цвет;
	
	//Вид оплаты
	ОбластьЧек.Параметры.Нал = Формат(ВидОплаты = Перечисления.ВидыОплаты.НаличныйРасчет, "БЛ=нет; БИ=да");
	ОбластьЧек.Параметры.БезНал = Формат(ВидОплаты = Перечисления.ВидыОплаты.БезналичныйРасчет, "БЛ=нет; БИ=да");
	ОбластьЧек.Параметры.Кредит = Формат(ВидОплаты = Перечисления.ВидыОплаты.Кредит, "БЛ=нет; БИ=да");
	ОбластьЧек.Параметры.Обмен = Формат(ВидОплаты = Перечисления.ВидыОплаты.Обмен, "БЛ=нет; БИ=да");
	ОбластьЧек.Параметры.Лизинг = Формат(ВидОплаты = Перечисления.ВидыОплаты.Лизинг, "БЛ=нет; БИ=да");
	
	// Цена и скидки
	ОбластьЧек.Параметры.ЗадатокДата = Формат(ЗадатокДата, "ДЛФ=ДД");
	ОбластьЧек.Параметры.ЗадатокСумма = Формат(ЗадатокСумма, "ЧДЦ=2");
	ОбластьЧек.Параметры.Цена = Формат(РозничнаяЦена, "ЧДЦ=2");
	ОбластьЧек.Параметры.СкидкаИмпортера = Формат(СкидкаИмпортера, "ЧДЦ=2");
	ОбластьЧек.Параметры.Компенсация = Формат(Компенсация, "ЧДЦ=2");
	ОбластьЧек.Параметры.ЦенаСкидка = Формат(РозничнаяЦена - СкидкаИмпортера, "ЧДЦ=2");
	ЦенаДО = РозничнаяЦена - СкидкаИмпортера + ОпцииДЦ.Итог("СуммаВсего");
	ОбластьЧек.Параметры.ЦенаСкидкаДО = Формат(ЦенаДО, "ЧДЦ=2");
	ОбластьЧек.Параметры.СкидкаАвтоцентра = Формат(СкидкаАвтоцентра, "ЧДЦ=2");
	ОбластьЧек.Параметры.СуммаДокумента = Формат(СуммаДокумента, "ЧДЦ=2");
	
	// Кредит
	Если ВидОплаты = Перечисления.ВидыОплаты.Кредит Тогда
		ОбластьЧек.Параметры.Банк = Банк;
		ОбластьЧек.Параметры.СтоимостьКредит = Формат(СтоимостьКредит, "ЧДЦ=2");
		ОбластьЧек.Параметры.ДолгДилеру = Формат(СтоимостьКредит - ПервВзносСумма, "ЧДЦ=2");
		ОбластьЧек.Параметры.ПервВзносДата = Формат(ПервВзносДата, "ДЛФ=ДД");
		ОбластьЧек.Параметры.ПервВзносСумма = Формат(ПервВзносСумма, "ЧДЦ=2");
	КонецЕсли;
	
	// КАСКО
	Если КАСКО Тогда
		ОбластьЧек.Параметры.КАСКОНал = Формат(КАСКОНал, "БЛ=нет; БИ=да");
		ОбластьЧек.Параметры.КАСКОБезНал = Формат(Не КАСКОНал, "БЛ=нет; БИ=да");
		ОбластьЧек.Параметры.КАСКОСумма = Формат(КАСКОСумма, "ЧДЦ=2");
	Иначе
		ОбластьЧек.Параметры.КАСКОНал = "нет";
		ОбластьЧек.Параметры.КАСКОБезНал = "нет";		
	КонецЕсли;
	
	// ОСАГО
	Если ОСАГО Тогда
		ОбластьЧек.Параметры.ОСАГОНал = Формат(ОСАГОНал, "БЛ=нет; БИ=да");
		ОбластьЧек.Параметры.ОСАГОБезНал = Формат(Не ОСАГОНал, "БЛ=нет; БИ=да");
		ОбластьЧек.Параметры.ОСАГОСумма = Формат(ОСАГОСумма, "ЧДЦ=2");
	Иначе
		ОбластьЧек.Параметры.ОСАГОНал = "нет";
		ОбластьЧек.Параметры.ОСАГОБезНал = "нет";		
	КонецЕсли;
	
	ОбластьЧек.Параметры.Подарки = Подарки;
	
	// ДО автоцентра
	Если ОпцииДЦ.Количество() > 0 Тогда
		Имя = "ДОАвтоцентр";
		Для инд = 1 По 12 Цикл
			Если инд > ОпцииДЦ.Количество() Тогда Прервать; КонецЕсли;
			ОбластьЧек.Параметры[Имя + инд] = ОпцииДЦ[инд - 1].Опция;
		КонецЦикла;
	КонецЕсли;
	
	// ДО импортера
	Если ОпцииИмпортер.Количество() > 0 Тогда
		Имя = "ДОИмпортер";
		Для инд = 1 По 9 Цикл
			Если инд > ОпцииИмпортер.Количество() Тогда Прервать; КонецЕсли;
			ОбластьЧек.Параметры[Имя + инд] = ОпцииИмпортер[инд - 1].Опция;
		КонецЦикла;
	КонецЕсли;
	
	// Трэйд ин
	Если ПринимаемоеАвто Тогда
		Если ПереключательTradeIn = 0 Тогда
			ОбластьЧек.Параметры.ТрэйдИн = "(Trade-in)";
		КонецЕсли;
		
		ОбластьЧек.Параметры.ВИНТрэйдИн = ВИНТрэйдИн;
		ОбластьЧек.Параметры.ПТСТрэйдИн = ПТСТрэйдИн;
		ОбластьЧек.Параметры.МодельТрейдИн = МодельТрейдИн;
		ОбластьЧек.Параметры.ОфертаТрейдИн = Формат(ОфертаТрейдИн, "ЧДЦ=2");
		ОбластьЧек.Параметры.ГодВыпускаТрейдИн = Формат(ГодВыпускаТрейдИн, "ДФ='гггг'");
		ОбластьЧек.Параметры.ПробегТрейдИн = ПробегТрейдИн;
		ОбластьЧек.Параметры.ВладельцевТрэйдИн = ВладельцевТрэйдИн;
		
		// Диски и шины
		Если ДЛШиныЛето Тогда
			ОбластьЧек.Параметры.ДЛЛето = "да";
			ОбластьЧек.Параметры.ДЛЛетоРадиус = ДЛРадиусЛето;
			ОбластьЧек.Параметры.ДЛЛетоШины = ДЛШиныЛетоНаимен;
		Иначе
			ОбластьЧек.Параметры.ДЛЛето = "нет";
		КонецЕсли;
		Если ДЛШиныЗима Тогда
			ОбластьЧек.Параметры.ДЛЗима = "да";
			ОбластьЧек.Параметры.ДЛЗимаРадиус = ДЛРадиусЗима;
			ОбластьЧек.Параметры.ДЛЗимаШины = ДЛШиныЗимаНаимен;
		Иначе
			ОбластьЧек.Параметры.ДЛЗима = "нет";
		КонецЕсли;
		Если ДСШиныЛето Тогда
			ОбластьЧек.Параметры.ДСЛето = "да";
			ОбластьЧек.Параметры.ДСЛетоРадиус = ДСРадиусЛето;
			ОбластьЧек.Параметры.ДСЛетоШины = ДСШиныЛетоНаимен;
		Иначе
			ОбластьЧек.Параметры.ДСЛето = "нет";
		КонецЕсли;
		Если ДСШиныЗима Тогда
			ОбластьЧек.Параметры.ДСЗима = "да";
			ОбластьЧек.Параметры.ДСЗимаРадиус = ДСРадиусЗима;
			ОбластьЧек.Параметры.ДСЗимаШины = ДСШиныЗимаНаимен;
		Иначе
			ОбластьЧек.Параметры.ДСЗима = "нет";
		КонецЕсли;
		
		ОбластьЧек.Параметры.Сигнализация = СигнализацияТрэйдИн;
		ОбластьЧек.Параметры.Мультимедиа = МультимедиаТрэйдИн;
		ОбластьЧек.Параметры.Домкрат = Формат(ДомкратТрэйдИн, "БЛ=нет; БИ=да");
		ОбластьЧек.Параметры.ЗапасКлюч = Формат(ЗапКлючТрэйдИн, "БЛ=нет; БИ=да");
		ОбластьЧек.Параметры.СервКнижка = Формат(СервКнижкаТрэйдИн, "БЛ=нет; БИ=да");
		ОбластьЧек.Параметры.Колпаки = Формат(КолпакиТрэйдИн, "БЛ=нет; БИ=да");
		ОбластьЧек.Параметры.НаборИнструментов = Формат(ИнструментыТрэйдИн, "БЛ=нет; БИ=да");
		ОбластьЧек.Параметры.ЗапасБрелок = Формат(ЗапБрелокТрэйдИн, "БЛ=нет; БИ=да");
		ОбластьЧек.Параметры.Руководство = Формат(РуководствоТрэйдИн, "БЛ=нет; БИ=да");
		ОбластьЧек.Параметры.ЗапасКолесо = Формат(ЗапКолесоТрэйдИн, "БЛ=нет; БИ=да");
		
		// ДО Трэйд ин
		Если ОпцииТрэйдИн.Количество() > 0 Тогда
			Имя = "ДОТрэйдИн";
			Для инд = 1 По 6 Цикл
				Если инд > ОпцииТрэйдИн.Количество() Тогда Прервать; КонецЕсли;
				ОбластьЧек.Параметры[Имя + инд] = ОпцииТрэйдИн[инд - 1].Опция;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// Подписи
	ОбластьЧек.Параметры.Менеджер = Менеджер.Наименование;
	ОбластьЧек.Параметры.РуководительМенеджера = РуководительМенеджера.Наименование;
	ОбластьЧек.Параметры.ФинКонсультант = ФинКонсультант.Наименование;
	ОбластьЧек.Параметры.ТехникОП = ТехникОП.Наименование;
	ОбластьЧек.Параметры.АдминистраторОС = АдминистраторОС.Наименование;
	ОбластьЧек.Параметры.КассирОформитель = КассирОформитель.Наименование;
	
	ТабДокумент.Вывести(ОбластьЧек);
	
	// Верхние колонтитулы
	//ТабДокумент.ВерхнийКолонтитул.ВертикальноеПоложение=ВертикальноеПоложение.Низ;
	//ТабДокумент.ВерхнийКолонтитул.Выводить=Истина;
	//ТабДокумент.ВерхнийКолонтитул.НачальнаяСтраница = 2;
	//ТабДокумент.ВерхнийКолонтитул.ТекстСправа="Акт № " + НомерДляПечати + " от " + Дата;
	//ТабДокумент.ВерхнийКолонтитул.Шрифт=Новый Шрифт(ТабДокумент.ВерхнийКолонтитул.Шрифт,,,,Истина,Истина,);
	
	// Нижние колонтитулы
	//ТабДокумент.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
	//ТабДокумент.НижнийКолонтитул.НачальнаяСтраница = 1;
	//ТабДокумент.НижнийКолонтитул.ТекстСлева = "Дата распечатки " + Формат(?(ДокументОбъект.ДатаРаспечатки ='00010101000000', ТекущаяДата(), ДокументОбъект.ДатаРаспечатки),"ДФ = дд.ММ.гггг");
	//ТабДокумент.НижнийКолонтитул.Шрифт = Новый Шрифт(ТабДокумент.ВерхнийКолонтитул.Шрифт,,,,Истина,Истина,);
	//ТабДокумент.НижнийКолонтитул.Выводить = Истина;
	
	Возврат ТабДокумент;
КонецФункции

// Функция осуществляет печать произвольного документа.
// Можно направить печать на экран или принтер, а также распечатать необходмое количество копий.
//
// Параметры:
//	ЭтотОбъект							- ДокументОбъект	- Документ для печати
//	НазваниеПечатнойФормы 				- Строка			- Название печатной формы, если пусто, то по умолчанию
//	КоличествоЭкземпляров				- Число				- Количество экземпляров документа
//	НаПринтер							- Булево			- Признак отправки документа на принтер без отображения его на экране
//  Документ 	  						- ТабличныйДокумент	- Макет печатной формы
//
// Возвращаемое значение:
//   ТабличныйДокумент	- Сформированная печатная форма
//
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции // Печать()

// Возвращает доступные варианты печати документа
// Вовращаемое значение: 
//  Струткура, каждая строка которой
//  соответствует одному из вариантов печати
//  Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм() Экспорт
	СтруктураМакетов=Новый Структура();
	СтруктураМакетов.Вставить("МакетЧека", "Чек менеджера");
	Возврат СтруктураМакетов;
КонецФункции // ПолучитьСписокПечатныхФорм()

Функция КонтактнаяИнформация(Объект, Вид)
	  Запрос = Новый Запрос;
	  Запрос.Текст = "ВЫБРАТЬ
	  |	КонтактнаяИнформация.Представление
	  |ИЗ
	  |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	  |ГДЕ
	  |	КонтактнаяИнформация.Вид = &Вид
	  |	И КонтактнаяИнформация.Объект = &Объект";
	  Запрос.УстановитьПараметр("Объект", Объект);
	  Запрос.УстановитьПараметр("Вид", Вид);
	  Выборка = Запрос.Выполнить().Выбрать();
	  Если Выборка.Следующий() Тогда
		  Возврат Выборка.Представление;
	  Иначе
		  Возврат "";
	  КонецЕсли;
  КонецФункции
  
Функция ФамилияИО(Знач ФИО)
	Если ТипЗнч(ФИО)<>Тип("Строка") Тогда
		Сообщить("Неверная строка передана в ""ФамилияИО(...)!"""); Возврат ФИО;
	КонецЕсли;
 
	// уберем множественные пробелы
	Пока 1=1 Цикл
		ФИО=СокрЛП(СтрЗаменить(ФИО,"  "," "));
		Если Найти(ФИО,"  ")=0 Тогда Прервать КонецЕсли;
	КонецЦикла;
	//ФИО=СокрЛП(НРег(ФИО)); // так удобнее
 
	Фамилия = "";
	Для й = 1 По СтрДлина(ФИО) Цикл
		символс = Сред(ФИО, й, 1);
		Если символс = " " Тогда Прервать КонецЕсли;
		Фамилия = Фамилия + символс;
	КонецЦикла;
	
	ы=й + 1; // перешли пробел
	Имя = "";
	Для й = ы По СтрДлина(ФИО) Цикл
		символс = Сред(ФИО, й, 1);
		Если символс=" " Тогда Прервать КонецЕсли;
		Имя = Имя + символс;
	КонецЦикла;
	
	Если Прав(Имя, 1) = "." Тогда
		Возврат ФИО;
	КонецЕсли;
	
	ы = й + 1; // перешли второй пробел
	Отчество = "";
	Для й = ы По СтрДлина(ФИО) Цикл
		символс = Сред(ФИО, й, 1);
		Если символс = " " Тогда Прервать КонецЕсли;
		Отчество = Отчество + символс;
	КонецЦикла;
 
	Фамилия = ВРег(Лев(Фамилия, 1)) + Сред(Фамилия, 2);
	Возврат Фамилия + " " + ВРег(Лев(Имя, 1)) + "." + ВРег(Лев(Отчество, 1)) + ".";
КонецФункции

#КонецЕсли

// Процедура заполнения табличной части по комплектации
//
Процедура ЗаполнитьКомплектациюАвтомобиля() Экспорт
	// таблица комплектации
	Перем табКомплектация;
	
	Если НЕ ЗначениеЗаполнено(Автомобиль) Тогда
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
		Если (ОпцииДЦ.Количество() <> 0) Тогда
			// зададим вопрос
			Ответ = Вопрос("Очищать табличные части опции?",РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Да);
			Если Ответ = КодВозвратаДиалога.Отмена Тогда
				Возврат;
			ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
				ОпцииДЦ.Очистить();
			КонецЕсли;
		КонецЕсли;
	#КонецЕсли
	
	// получим таблицу комплектации
	НайденыйАвтомобильОбъект = Автомобиль.ПолучитьОбъект();
	Рез = НайденыйАвтомобильОбъект.ПолучитьОпцииИОборудованиеАвтомобиля(табКомплектация);
	
	//если нет данных выйдем
	Если НЕ Рез Тогда
		Возврат;
	КонецЕсли;
	
	// заполнияем ТЧ
	Для Каждого стрКомплектации Из табКомплектация Цикл
		Если ТипЗнч(стрКомплектации.Номенклатура) = Тип("СправочникСсылка.Опции") Тогда
			// добавление в опции
			НоваяСтрока				= ОпцииДЦ.Добавить();
			НоваяСтрока.Опция		= стрКомплектации.Номенклатура;
			ОбработкаРеквизита("ОпцииДЦ.Опция", НоваяСтрока);
			НоваяСтрока.Количество	= стрКомплектации.КоличествоОстаток;
			НоваяСтрока.СуммаВсего	= обПересчет(стрКомплектации.СуммаУпрОстаток, Константы.ВалютаУправленческогоУчетаКомпании.Получить(), ?(обЗначениеНеЗаполнено(КурсВалютыУпр), Дата, КурсВалютыУпр),ВалютаДокумента,Дата,РежимОкругления.Окр15как20);
			ОбработкаРеквизита("ОпцииДЦ.СуммаВсего", НоваяСтрока);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ
// Обработчик события при установке новго номера
//
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Обработчик события заполнения
//
Процедура ОбработкаЗаполнения(Основание) Экспорт
	Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
	Если Не ЗначениеЗаполнено(Основание) Тогда Возврат; КонецЕсли;
	
	ДатаСоздания = ТекущаяДата();
	//СтатусПродажа = Основание.Статус = Справочники.СтатусыРабочегоЛиста.Продажа;
	//СтатусЗадаток = Основание.Статус = Справочники.СтатусыРабочегоЛиста.Сделка;
	
	ДанныеЗаполнения = Основание;
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РабочийЛист") Тогда
		// Заполнение шапки
		Автомобиль = ДанныеЗаполнения.Автомобиль;
		Автор = ДанныеЗаполнения.Автор;
		ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
		ВариантКомплектации = ДанныеЗаполнения.ВариантКомплектации;
		ВидОплаты = ДанныеЗаполнения.ВидОплаты;
		ВидТелефона = ДанныеЗаполнения.ВидТелефона;
		ВнутреннийНомер = ДанныеЗаполнения.ВнутреннийНомер;
		ГодВыпускаТрейдИн = ДанныеЗаполнения.ГодВыпускаТрейдИн;
		КодГорода = ДанныеЗаполнения.КодГорода;
		КодРегиона = ДанныеЗаполнения.КодРегиона;
		Контрагент = ДанныеЗаполнения.Контрагент;
		КурсВалютыУпр = ДанныеЗаполнения.КурсВалютыУпр;
		КурсДокумента = ДанныеЗаполнения.КурсДокумента;
		Менеджер = ДанныеЗаполнения.Менеджер;
		Модель = ДанныеЗаполнения.Модель;
		МодельТрейдИн = ДанныеЗаполнения.МодельТрейдИн;
		НомерТелефона = ДанныеЗаполнения.НомерТелефона;
		Организация = ДанныеЗаполнения.Организация;
		ОфертаТрейдИн = ДанныеЗаполнения.ОфертаТрейдИн;
		ПодразделениеКомпании = ДанныеЗаполнения.ПодразделениеКомпании;
		ПредставлениеТелефона = ДанныеЗаполнения.ПредставлениеТелефона;
		ПробегТрейдИн = ДанныеЗаполнения.ПробегТрейдИн;
		РуководительМенеджера = ДанныеЗаполнения.РуководительМенеджера;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		РозничнаяЦена = ДанныеЗаполнения.СуммаПродажи;
		ТипЦен = ДанныеЗаполнения.ТипЦен;
		Цвет = ДанныеЗаполнения.Цвет;
		Для Каждого ТекСтрокаОпции Из ДанныеЗаполнения.Опции Цикл
			НоваяСтрока = ОпцииДЦ.Добавить();
			НоваяСтрока.Количество = ТекСтрокаОпции.Количество;
			НоваяСтрока.Опция = ТекСтрокаОпции.Опция;
			НоваяСтрока.СтавкаНДС = ТекСтрокаОпции.СтавкаНДС;
			НоваяСтрока.Сумма = ТекСтрокаОпции.Сумма;
			НоваяСтрока.СуммаВсего = ТекСтрокаОпции.СуммаВсего;
			НоваяСтрока.СуммаНДС = ТекСтрокаОпции.СуммаНДС;
			НоваяСтрока.Цена = ТекСтрокаОпции.Цена;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события при копировании
//
Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриКопировании()

// Обработчик события перед записью
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда Возврат; КонецЕсли;
	//Гэндальф+++
	Если ЭтоНовый() тогда		
		ДатаСоздания = ТекущаяДата();
	КонецЕсли;	
	//Гэндальф---
	
	//Если СтатусЗадаток И (Не ЗначениеЗаполнено(ЗадатокДата) Или Не ЗначениеЗаполнено(ЗадатокСумма)) Тогда
	//	Сообщить("Для сделки со статусом Задаток необходимо ввести Дату и Сумму задатка!", СтатусСообщения.Внимание);
	//	Отказ = Истина;
	//КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события при записи
//
Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;	
КонецПроцедуры // ПриЗаписи()

// Обработчик события перед удалением
//
Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()

// Обработчик события удаления проведения
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события проведения
//
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда Возврат; КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права                 = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли
