
//Точка входа. Вызывает регламентное задание во время выполнения
Процедура Renault_ВыгрузкаДанныхКонтактЦентр(Параметр1 = Неопределено) Экспорт
	
	ПланОбмена = ПолучитьПланОбмена();
	
	Если ЗначениеЗаполнено(ПланОбмена) тогда
		ВыполнитьОтправкуДанных(ПланОбмена);
		РегистрыСведений.DMS_МониторингРегламентныхЗаданий.ЗавершениеЗадания(
		ПредопределенноеЗначение("Справочник.DMS_НастройкаРегламентныхЗаданий.ВыгрузкаДанныхКонтактЦентр"),
		ТекущаяДатаСеанса());
	Иначе
		Renault_Открытый.СообщитьПользователю("Формирование отменено, не удалось определить план обмена");
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПланОбмена()
		
	Выборка = ПланыОбмена.Renault_ContactCenter.Выбрать();
	ЭтаБаза = ПланыОбмена.Renault_ContactCenter.ЭтотУзел();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка <> ЭтаБаза Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция ВыполнитьОтправкуДанных(ПланОбмена) Экспорт
	
	ЕстьВыгрузкаСтатистики = Ложь;
	Если Метаданные.ОбщиеМодули.Найти("Renault_ВыгрузкаСтатистики") <> Неопределено Тогда
		ЕстьВыгрузкаСтатистики = Истина;
	КонецЕсли;
	
	ВебСервис = ПолучитьПрокси();
	Сериализатор = Новый СериализаторXDTO(ВебСервис.ФабрикаXDTO);
	
	РезультатВыполнения = Новый Структура();
	Server = СтрокаСоединенияИнформационнойБазы();
	BIR = Константы.Renault_BIR_db.Получить();
	ЗаписьЖурналаРегистрации("Renault_ВыгрузкаДанныхКонтактЦентр.НачалоВыгрузки",
		УровеньЖурналаРегистрации.Информация,,, СтрокаСоединенияИнформационнойБазы()); 
	
	//Получим ссылки на все изменения, с учетом добавленных клиентов
	Выборка = ПланыОбмена.ВыбратьИзменения(ПланОбмена, 2);
	
	//Посчитаем количество изменений
	ОбщееКоличество = 0;
	Пока Выборка.Следующий() Цикл
		ОбщееКоличество = ОбщееКоличество + 1;
	КонецЦикла;
	Выборка.Сбросить();
	
	// если отправлять нечего сделаем пустой прозвон WS для подтверждения что все ок
	Если ОбщееКоличество = 0 Тогда
		ПустаяТаблица = Новый ТаблицаЗначений;
		Фабрика = ВебСервис.ФабрикаXDTO;
		Сериализатор = Новый СериализаторXDTO(Фабрика);
		Результат = Сериализатор.ЗаписатьXDTO(ПустаяТаблица);
		ДанныеОтправлены = ВебСервис.SetData(Результат, "SetConnection");
	КонецЕсли;
	
	//Заполним таблицы первоначальной информацией из плана обмена
	Счетчик = 0; ВсегоПередано = 0;
	Пока Выборка.Следующий() Цикл
		
		Если Счетчик = 0 Тогда
			//Инициализируем таблицы
			ТаблицаРезультатыОбработки = ИнициализироватьТаблицуРезультатыОбработки();
			ТаблицаВидыУслуг = ИнициализироватьТаблицуВидыУслуг();
			ТаблицаТрафикЛиды = ИнициализироватьТаблицуТрафикЛиды();
			ТаблицаТрафикПисьма = ИнициализироватьТаблицуТрафикПисьма();
			ТаблицаОтветыНаЛиды = ИнициализироватьТаблицуОтветыНаЛиды();
			ТаблицаОтветыНаПисьмо = ИнициализироватьТаблицуОтветыНаПисьмо();
			ТаблицаТрафикПоСотрудникам = ИнициализироватьТаблицуТрафикПоСотрудникам();
			ТаблицаТрафикЧат = ИнициализироватьТаблицуТрафикЧат();
			
			ТаблицаНастройкиКЦ = ИнициализироватьТаблицуНАстройкиКЦ();
			
			//Инициализируем таблицы для отмены регистрации
			ТаблицаРезультатыОбработки_ДляУдаленияРегистрации = ТаблицаРезультатыОбработки.Скопировать();
			ТаблицаВидыУслуг_ДляУдаленияРегистрации = ТаблицаВидыУслуг.Скопировать();
			ТаблицаТрафикЛиды_ДляУдаленияРегистрации = ТаблицаТрафикЛиды.Скопировать();
			ТаблицаТрафикПисьма_ДляУдаленияРегистрации = ТаблицаТрафикПисьма.Скопировать();
			ТаблицаОтветыНаЛиды_ДляУдаленияРегистрации = ТаблицаОтветыНаЛиды.Скопировать();
			ТаблицаОтветыНаПисьмо_ДляУдаленияРегистрации = ТаблицаОтветыНаПисьмо.Скопировать();
			ТаблицаТрафикПоСотрудникам_ДляУдаленияРегистрации = ТаблицаТрафикПоСотрудникам.Скопировать();
			ТаблицаТрафикЧат_ДляУдаленияРегистрации = ТаблицаТрафикЧат.Скопировать();
			
			ТаблицаНастройкиКЦ_ДляУдаленияРегистрации = ТаблицаНастройкиКЦ.Скопировать();
			
			// отправим данные по дц
			//ОтправитьТаблицуДЦ(BIR, ВебСервис, ПланОбмена);
			
		КонецЕсли;
		
		ЭлементИзмененныхДанных = Выборка.Получить();
		ДобавитьЭлементВТаблицуДляОтправки(ЭлементИзмененныхДанных, 
			ТаблицаРезультатыОбработки,	ТаблицаРезультатыОбработки_ДляУдаленияРегистрации,
			ТаблицаВидыУслуг,			ТаблицаВидыУслуг_ДляУдаленияРегистрации,
			ТаблицаТрафикЛиды,			ТаблицаТрафикЛиды_ДляУдаленияРегистрации,
			ТаблицаТрафикПисьма,		ТаблицаТрафикПисьма_ДляУдаленияРегистрации,
			ТаблицаОтветыНаЛиды,		ТаблицаОтветыНаЛиды_ДляУдаленияРегистрации,
			ТаблицаОтветыНаПисьмо,		ТаблицаОтветыНаПисьмо_ДляУдаленияРегистрации,
			ТаблицаТрафикПоСотрудникам,	ТаблицаТрафикПоСотрудникам_ДляУдаленияРегистрации,
			ТаблицаТрафикЧат,			ТаблицаТрафикЧат_ДляУдаленияРегистрации,
			ТаблицаНастройкиКЦ,			ТаблицаНастройкиКЦ_ДляУдаленияРегистрации
		);
		
		Счетчик = Счетчик + 1;
		ВсегоПередано = ВсегоПередано + 1;
		
		Если Счетчик = 1000 ИЛИ ВсегоПередано = ОбщееКоличество Тогда
			
			Попытка 
				
				Если ЕстьВыгрузкаСтатистики = Ложь Тогда
					
					// если нет выгрузки трафика отправим вручную трафик, который участвует в контакт-центре
					ТаблицаТрафикКОтправке = ОтправитьТаблицуТрафик(ТаблицаТрафикЛиды, ТаблицаТрафикПисьма, ТаблицаОтветыНаЛиды, ТаблицаОтветыНаПисьмо, ТаблицаТрафикЧат, BIR, ВебСервис);
					ОтправитьТаблицуКлиенты(ТаблицаТрафикКОтправке, BIR, ВебСервис);
					
				КонецЕсли;
				
				ОтправитьТаблицуРезультатыОбработки(ТаблицаРезультатыОбработки, ТаблицаРезультатыОбработки_ДляУдаленияРегистрации, BIR, ВебСервис, ПланОбмена);
				ОтправитьТаблицуВидыУслуг(ТаблицаВидыУслуг, ТаблицаВидыУслуг_ДляУдаленияРегистрации, BIR, ВебСервис, ПланОбмена);
				ОтправитьТаблицуТрафикЛиды(ТаблицаТрафикЛиды, ТаблицаТрафикЛиды_ДляУдаленияРегистрации, BIR, ВебСервис, ПланОбмена);
				ОтправитьТаблицуТрафикПисьма(ТаблицаТрафикПисьма, ТаблицаТрафикПисьма_ДляУдаленияРегистрации, BIR, ВебСервис, ПланОбмена);
				ОтправитьТаблицуОтветыНаЛиды(ТаблицаОтветыНаЛиды, ТаблицаОтветыНаЛиды_ДляУдаленияРегистрации, BIR, ВебСервис, ПланОбмена);
				ОтправитьТаблицуОтветыНаПисьмо(ТаблицаОтветыНаПисьмо, ТаблицаОтветыНаПисьмо_ДляУдаленияРегистрации, BIR, ВебСервис, ПланОбмена);
				ОтправитьТаблицуТрафикПоСотрудникам(ТаблицаТрафикПоСотрудникам, ТаблицаТрафикПоСотрудникам_ДляУдаленияРегистрации, BIR, ВебСервис, ПланОбмена);
				ОтправитьТаблицуТрафикЧат(ТаблицаТрафикЧат, ТаблицаТрафикЧат_ДляУдаленияРегистрации, BIR, ВебСервис, ПланОбмена);
				ОтправитьТаблицуНастройкиКЦ(ТаблицаНастройкиКЦ, ТаблицаНастройкиКЦ_ДляУдаленияРегистрации, BIR, ВебСервис, ПланОбмена);
				
			Исключение
				ЗаписьЖурналаРегистрации("Renault_ВыгрузкаДанныхКонтактЦентр", УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
			Счетчик = 0;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации("Renault_ВыгрузкаДанныхКонтактЦентр.ОкончаниеВыгрузки", УровеньЖурналаРегистрации.Информация,,, СтрокаСоединенияИнформационнойБазы()); 
	
	Возврат РезультатВыполнения;
	
КонецФункции // ВыполнитьОтправкуДанныхВЦентраль()

Процедура ДобавитьЭлементВТаблицуДляОтправки(ЭлементИзмененныхДанных, 
			ТаблицаРезультатыОбработки,	ТаблицаРезультатыОбработки_ДляУдаленияРегистрации,
			ТаблицаВидыУслуг,			ТаблицаВидыУслуг_ДляУдаленияРегистрации,
			ТаблицаТрафикЛиды,			ТаблицаТрафикЛиды_ДляУдаленияРегистрации,
			ТаблицаТрафикПисьма,		ТаблицаТрафикПисьма_ДляУдаленияРегистрации,
			ТаблицаОтветыНаЛиды,		ТаблицаОтветыНаЛиды_ДляУдаленияРегистрации,
			ТаблицаОтветыНаПисьмо,		ТаблицаОтветыНаПисьмо_ДляУдаленияРегистрации,
			ТаблицаТрафикПоСотрудникам,	ТаблицаТрафикПоСотрудникам_ДляУдаленияРегистрации,
			ТаблицаТрафикЧат,			ТаблицаТрафикЧат_ДляУдаленияРегистрации,
			ТаблицаНастройкиКЦ,			ТаблицаНастройкиКЦ_ДляУдаленияРегистрации
	)
	
	Если ТипЗнч(ЭлементИзмененныхДанных) =  Тип("УдалениеОбъекта") Тогда
		
		Если ТипЗнч(ЭлементИзмененныхДанных.Ссылка) = Тип("СправочникСсылка.Renault_РезультатОбработки") Тогда
			ДобавитьУдалениеСсылочногоТипа(ЭлементИзмененныхДанных, ТаблицаРезультатыОбработки, ТаблицаРезультатыОбработки_ДляУдаленияРегистрации);
			
		ИначеЕсли ТипЗнч(ЭлементИзмененныхДанных.Ссылка) = Тип("СправочникСсылка.Renault_ВидУслуги") Тогда
			ДобавитьУдалениеСсылочногоТипа(ЭлементИзмененныхДанных, ТаблицаВидыУслуг, ТаблицаВидыУслуг_ДляУдаленияРегистрации);
			
		ИначеЕсли ТипЗнч(ЭлементИзмененныхДанных.Ссылка) = Тип("ДокументСсылка.Renault_Лид") Тогда
			ДобавитьУдалениеСсылочногоТипа(ЭлементИзмененныхДанных, ТаблицаТрафикЛиды, ТаблицаТрафикЛиды_ДляУдаленияРегистрации);
			
		ИначеЕсли ТипЗнч(ЭлементИзмененныхДанных.Ссылка) = Тип("СправочникСсылка.Renault_НастройкиОнлайнКонсультанта") Тогда
			ДобавитьУдалениеСсылочногоТипа(ЭлементИзмененныхДанных, ТаблицаНастройкиКЦ, ТаблицаНастройкиКЦ_ДляУдаленияРегистрации);
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ЭлементИзмененныхДанных) =  Тип("СправочникОбъект.Renault_РезультатОбработки") Тогда
		ДобавитьИзменениеСсылочногоТипа(ЭлементИзмененныхДанных, ТаблицаРезультатыОбработки, ТаблицаРезультатыОбработки_ДляУдаленияРегистрации);
		
	ИначеЕсли ТипЗнч(ЭлементИзмененныхДанных) =  Тип("СправочникОбъект.Renault_ВидУслуги") Тогда
		ДобавитьИзменениеСсылочногоТипа(ЭлементИзмененныхДанных, ТаблицаВидыУслуг, ТаблицаВидыУслуг_ДляУдаленияРегистрации);
		
	ИначеЕсли ТипЗнч(ЭлементИзмененныхДанных) =  Тип("ДокументОбъект.Renault_Лид") Тогда
		ДобавитьИзменениеСсылочногоТипа(ЭлементИзмененныхДанных, ТаблицаТрафикЛиды, ТаблицаТрафикЛиды_ДляУдаленияРегистрации);
		
	ИначеЕсли ТипЗнч(ЭлементИзмененныхДанных) =  Тип("СправочникОбъект.Renault_НастройкиОнлайнКонсультанта") Тогда
		ДобавитьИзменениеСсылочногоТипа(ЭлементИзмененныхДанных, ТаблицаНастройкиКЦ, ТаблицаНастройкиКЦ_ДляУдаленияРегистрации);
		
	ИначеЕсли ТипЗнч(ЭлементИзмененныхДанных) = Тип("РегистрСведенийНаборЗаписей.Renault_ТрафикПисьма") Тогда
		ДобавитьУдалениеНабораРегистра(ЭлементИзмененныхДанных, ТаблицаТрафикПисьма, ТаблицаТрафикПисьма_ДляУдаленияРегистрации);
		
	ИначеЕсли ТипЗнч(ЭлементИзмененныхДанных) = Тип("РегистрСведенийНаборЗаписей.Renault_ОтветыНаЛиды") Тогда
		ДобавитьУдалениеНабораРегистра(ЭлементИзмененныхДанных, ТаблицаОтветыНаЛиды, ТаблицаОтветыНаЛиды_ДляУдаленияРегистрации);
		
	ИначеЕсли ТипЗнч(ЭлементИзмененныхДанных) = Тип("РегистрСведенийНаборЗаписей.Renault_ОтветыНаПисьмо") Тогда
		ДобавитьУдалениеНабораРегистра(ЭлементИзмененныхДанных, ТаблицаОтветыНаПисьмо, ТаблицаОтветыНаПисьмо_ДляУдаленияРегистрации);
		
	ИначеЕсли ТипЗнч(ЭлементИзмененныхДанных) = Тип("РегистрСведенийНаборЗаписей.Renault_ТрафикПоСотрудникам") Тогда
		ДобавитьУдалениеНабораРегистра(ЭлементИзмененныхДанных, ТаблицаТрафикПоСотрудникам, ТаблицаТрафикПоСотрудникам_ДляУдаленияРегистрации);
		
	ИначеЕсли ТипЗнч(ЭлементИзмененныхДанных) = Тип("РегистрСведенийНаборЗаписей.Renault_ОК_Сообщения") Тогда
		ДобавитьУдалениеНабораРегистра(ЭлементИзмененныхДанных, ТаблицаТрафикЧат, ТаблицаТрафикЧат_ДляУдаленияРегистрации);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьУдалениеСсылочногоТипа(ЭлементИзмененныхДанных, Таблица, Таблица_ДляУдаленияРегистрации)
	
	Стр = Таблица.Добавить();
	Стр.Ссылка = ЭлементИзмененныхДанных.Ссылка;
	Стр.УдаленнаяЗапись = Истина;
	
	Стр = Таблица_ДляУдаленияРегистрации.Добавить();
	Стр.Ссылка = ЭлементИзмененныхДанных.Ссылка;
	
КонецПроцедуры

Процедура ДобавитьИзменениеСсылочногоТипа(ЭлементИзмененныхДанных, Таблица, Таблица_ДляУдаленияРегистрации)
	
	Стр = Таблица.Добавить();
	Стр.Ссылка = ЭлементИзмененныхДанных.Ссылка;
	Стр.УдаленнаяЗапись = Ложь;
	Если Таблица.Колонки.Найти("ТрафикИД") <> Неопределено Тогда
		Стр.ТрафикИД = ЭлементИзмененныхДанных.ТрафикИД;
	КонецЕсли;
	
	Стр = Таблица_ДляУдаленияРегистрации.Добавить();
	Стр.Ссылка = ЭлементИзмененныхДанных.Ссылка;
	
КонецПроцедуры

Процедура ДобавитьУдалениеНабораРегистра(ЭлементИзмененныхДанных, Таблица, Таблица_ДляУдаленияРегистрации)
	
	Измерения = ЭлементИзмененныхДанных.Метаданные().Измерения;
	
	//Удаленные записи
	Если ЭлементИзмененныхДанных.Количество() = 0 Тогда
		//Для отправки
		Стр = Таблица.Добавить();
		Стр.УдаленнаяЗапись = Истина;
		Для Каждого Измерение ИЗ Измерения Цикл
			Стр[Измерение.Имя] = ЭлементИзмененныхДанных.Отбор[Измерение.Имя].Значение;
		КонецЦикла;
		
		//Для удаления регистрации
		Стр = Таблица_ДляУдаленияРегистрации.Добавить();
		Стр.УдаленнаяЗапись = Истина;
		Для Каждого Измерение ИЗ Измерения Цикл
			Стр[Измерение.Имя] = ЭлементИзмененныхДанных.Отбор[Измерение.Имя].Значение;
		КонецЦикла;
		
	КонецЕсли;
	
	//Новые и измененные записи
	Для Каждого ЗаписьНабораИзмененныхДанных Из ЭлементИзмененныхДанных Цикл
		//Для отправки
		Стр = Таблица.Добавить();
		Стр.УдаленнаяЗапись = Ложь;
		Для Каждого Измерение ИЗ Измерения Цикл
			Стр[Измерение.Имя] = ЗаписьНабораИзмененныхДанных[Измерение.Имя];
		КонецЦикла;
		
		//Для удаления регистрации
		Стр = Таблица_ДляУдаленияРегистрации.Добавить();
		Стр.УдаленнаяЗапись = Ложь;
		Для Каждого Измерение ИЗ Измерения Цикл
			Стр[Измерение.Имя] = ЗаписьНабораИзмененныхДанных[Измерение.Имя];
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

//////////////
//Инициализация таблиц для отправки

Функция ИнициализироватьТаблицуРезультатыОбработки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Renault_РезультатОбработки.Ссылка,
	|	ЛОЖЬ КАК УдаленнаяЗапись
	|ИЗ
	|	Справочник.Renault_РезультатОбработки КАК Renault_РезультатОбработки";
	ТаблицаРезультатыОбработки = Запрос.Выполнить().Выгрузить();
	ТаблицаРезультатыОбработки.Очистить();
	Возврат ТаблицаРезультатыОбработки;
	
КонецФункции

Функция ИнициализироватьТаблицуВидыУслуг()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Renault_ВидУслуг.Ссылка,
	|	ЛОЖЬ КАК УдаленнаяЗапись
	|ИЗ
	|	Справочник.Renault_ВидУслуги КАК Renault_ВидУслуг";
	ТаблицаВидыУслуг = Запрос.Выполнить().Выгрузить();
	ТаблицаВидыУслуг.Очистить();
	Возврат ТаблицаВидыУслуг;
	
КонецФункции

Функция ИнициализироватьТаблицуТрафикЛиды()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Renault_Лид.Ссылка КАК Ссылка,
	|	Renault_Лид.ТрафикИД КАК ТрафикИД,
	|	ЛОЖЬ КАК УдаленнаяЗапись
	|ИЗ
	|	Документ.Renault_Лид КАК Renault_Лид";
	ТаблицаТрафикЛиды = Запрос.Выполнить().Выгрузить();
	ТаблицаТрафикЛиды.Очистить();
	Возврат ТаблицаТрафикЛиды;
	
КонецФункции

Функция ИнициализироватьТаблицуТрафикПисьма()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Renault_ТрафикПисьма.ИдентификаторПисьма,
	|	Renault_ТрафикПисьма.ИдТрафика,
	|	Renault_ТрафикПисьма.ДатаПоступления,
	|	Renault_ТрафикПисьма.ТрафикПросмотрен,
	|	Renault_ТрафикПисьма.ДатаПросмотра,
	|	Renault_ТрафикПисьма.РезультатОбработки,
	|	ЛОЖЬ КАК УдаленнаяЗапись
	|ИЗ
	|	РегистрСведений.Renault_ТрафикПисьма КАК Renault_ТрафикПисьма";
	ТаблицаТрафикПисьма = Запрос.Выполнить().Выгрузить();
	ТаблицаТрафикПисьма.Очистить();
	Возврат ТаблицаТрафикПисьма;
	
КонецФункции

Функция ИнициализироватьТаблицуОтветыНаЛиды()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛОЖЬ КАК УдаленнаяЗапись,
	|	Renault_ОтветыНаЛиды.ИдТрафика,
	|	Renault_ОтветыНаЛиды.ДатаОтвета,
	|	Renault_ОтветыНаЛиды.ВидСообщения,
	|	Renault_ОтветыНаЛиды.Ответ,
	|	Renault_ОтветыНаЛиды.ИдентификаторПисьма
	|ИЗ
	|	РегистрСведений.Renault_ОтветыНаЛиды КАК Renault_ОтветыНаЛиды
	|ГДЕ
	|	Renault_ОтветыНаЛиды.Отправлен = ЛОЖЬ";
	ТаблицаОтветыНаЛиды = Запрос.Выполнить().Выгрузить();
	//ТаблицаОтветыНаЛиды.Очистить();
	Возврат ТаблицаОтветыНаЛиды;
	
КонецФункции

Функция ИнициализироватьТаблицуОтветыНаПисьмо()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛОЖЬ КАК УдаленнаяЗапись,
	|	Renault_ОтветыНаПисьмо.ИдТрафика,
	|	Renault_ОтветыНаПисьмо.ДатаОтвета,
	|	Renault_ОтветыНаПисьмо.ВидСообщения,
	|	Renault_ОтветыНаПисьмо.Ответ,
	|	Renault_ОтветыНаПисьмо.ИдентификаторПисьма
	|ИЗ
	|	РегистрСведений.Renault_ОтветыНаПисьмо КАК Renault_ОтветыНаПисьмо";
	ТаблицаОтветыНаПисьмо = Запрос.Выполнить().Выгрузить();
	ТаблицаОтветыНаПисьмо.Очистить();
	Возврат ТаблицаОтветыНаПисьмо;
	
КонецФункции

Функция ИнициализироватьТаблицуТрафикПоСотрудникам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛОЖЬ КАК УдаленнаяЗапись,
	|	Renault_ТрафикПоСотрудникам.ИдТрафика,
	|	Renault_ТрафикПоСотрудникам.Сотрудник,
	|	Renault_ТрафикПоСотрудникам.Просмотрен,
	|	Renault_ТрафикПоСотрудникам.Отвечен,
	|	Renault_ТрафикПоСотрудникам.ДатаПросмотра
	|ИЗ
	|	РегистрСведений.Renault_ТрафикПоСотрудникам КАК Renault_ТрафикПоСотрудникам";
	ТаблицаТрафикПоСотрудникам = Запрос.Выполнить().Выгрузить();
	ТаблицаТрафикПоСотрудникам.Очистить();
	Возврат ТаблицаТрафикПоСотрудникам;
	
КонецФункции

Функция ИнициализироватьТаблицуТрафикЧат()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛОЖЬ КАК УдаленнаяЗапись,
	|	Renault_ОК_Сообщения.id_mess,
	|	Renault_ОК_Сообщения.IDТрафика
	//|	Renault_ТрафикПоСотрудникам.Сотрудник,
	//|	Renault_ТрафикПоСотрудникам.Просмотрен,
	//|	Renault_ТрафикПоСотрудникам.Отвечен,
	//|	Renault_ТрафикПоСотрудникам.ДатаПросмотра
	|ИЗ
	|	РегистрСведений.Renault_ОК_Сообщения КАК Renault_ОК_Сообщения";
	ТаблицаТрафикЧат = Запрос.Выполнить().Выгрузить();
	ТаблицаТрафикЧат.Очистить();
	Возврат ТаблицаТрафикЧат;
	
КонецФункции

Функция ИнициализироватьТаблицуНастройкиКЦ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛОЖЬ КАК УдаленнаяЗапись,
	|	Renault_НастройкиОнлайнКонсультанта.Ссылка
	|ИЗ
	|	Справочник.Renault_НастройкиОнлайнКонсультанта КАК Renault_НастройкиОнлайнКонсультанта";
	ТаблицаНастройкиКЦ = Запрос.Выполнить().Выгрузить();
	ТаблицаНастройкиКЦ.Очистить();
	Возврат ТаблицаНастройкиКЦ;
	
КонецФункции


//////////////
//Отправка таблиц данных

Функция ОтправитьТаблицуТрафик(ТаблицаТрафикЛиды, ТаблицаТрафикПисьма, ТаблицаОтветыНаЛиды, ТаблицаОтветыНаПисьмо, ТаблицаТрафикЧат, BIR, ВебСервис)
	
	//Если ТаблицаДанных.Количество() = 0 Тогда
	//	Возврат;
	//КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТрафикЛиды.ТрафикИД
	|ПОМЕСТИТЬ ВремТаблицаТрафикЛиды
	|ИЗ
	|	&ТаблицаТрафикЛиды КАК ТаблицаТрафикЛиды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТрафикПисьма.ИдТрафика
	|ПОМЕСТИТЬ ВремТаблицаТрафикПисьма
	|ИЗ
	|	&ТаблицаТрафикПисьма КАК ТаблицаТрафикПисьма
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаОтветыНаЛиды.ИдТрафика
	|ПОМЕСТИТЬ ВремТаблицаОтветыНаЛиды
	|ИЗ
	|	&ТаблицаОтветыНаЛиды КАК ТаблицаОтветыНаЛиды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаОтветыНаПисьмо.ИдТрафика
	|ПОМЕСТИТЬ ВремТаблицаОтветыНаПисьмо
	|ИЗ
	|	&ТаблицаОтветыНаПисьмо КАК ТаблицаОтветыНаПисьмо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТрафикЧат.IDТрафика КАК ИдТрафика
	|ПОМЕСТИТЬ ВремТаблицаТрафикЧат
	|ИЗ
	|	&ТаблицаТрафикЧат КАК ТаблицаТрафикЧат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТаблицаТрафикЛиды.ТрафикИД КАК ИдТрафика
	|ПОМЕСТИТЬ Врем
	|ИЗ
	|	ВремТаблицаТрафикЛиды КАК ВремТаблицаТрафикЛиды
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВремТаблицаТрафикПисьма.ИдТрафика
	|ИЗ
	|	ВремТаблицаТрафикПисьма КАК ВремТаблицаТрафикПисьма
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВремТаблицаОтветыНаЛиды.ИдТрафика
	|ИЗ
	|	ВремТаблицаОтветыНаЛиды КАК ВремТаблицаОтветыНаЛиды
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВремТаблицаОтветыНаПисьмо.ИдТрафика
	|ИЗ
	|	ВремТаблицаОтветыНаПисьмо КАК ВремТаблицаОтветыНаПисьмо
	|;
	|
	|ВЫБРАТЬ
	|	ВремТаблицаТрафикЧат.ИдТрафика
	|ИЗ
	|	ВремТаблицаТрафикЧат КАК ВремТаблицаТрафикЧат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Врем.ИдТрафика
	|ПОМЕСТИТЬ ВремТаб
	|ИЗ
	|	Врем КАК Врем
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&BIR КАК ИдентификаторИБ,
	|	ЛОЖЬ КАК УдаленнаяЗапись,
	|	Renault_Трафик.Период КАК Период,
	|	Renault_Трафик.Идентификатор КАК Идентификатор,
	|	Renault_Трафик.ТипТрафика КАК ТипТрафикаСсылка,
	|	Renault_Трафик.Обработан КАК Обработан,
	|	Renault_Трафик.Отдел КАК ОтделСсылка,
	|	Renault_Трафик.Менеджер КАК МенеджерСсылка,
	|	Renault_Трафик.Администратор КАК АдминистраторСсылка,
	|	Renault_Трафик.Клиент КАК КлиентСсылка,
	|	Renault_Трафик.ПервичныйПовторный КАК ПервичныйПовторный,
	|	Renault_Трафик.ДилерскийЦентр КАК ДилерскийЦентрСсылка,
	|	Renault_Трафик.Представление КАК Представление,
	|	Renault_Трафик.Комментарий КАК Комментарий,
	|	Renault_Трафик.ПервичныйИнтерес КАК ПервичныйИнтересСсылка,
	|	Renault_Трафик.ИсточникИнформации КАК ИсточникИнформацииСсылка
	|ИЗ
	|	ВремТаб КАК ВремТаб
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_Трафик КАК Renault_Трафик
	|		ПО (Renault_Трафик.Идентификатор = ВремТаб.ИдТрафика)";
	Запрос.УстановитьПараметр("ТаблицаТрафикЛиды", ТаблицаТрафикЛиды);
	Запрос.УстановитьПараметр("ТаблицаТрафикПисьма", ТаблицаТрафикПисьма);
	Запрос.УстановитьПараметр("ТаблицаОтветыНаЛиды", ТаблицаОтветыНаЛиды);
	Запрос.УстановитьПараметр("ТаблицаОтветыНаПисьмо", ТаблицаОтветыНаПисьмо);
	Запрос.УстановитьПараметр("ТаблицаТрафикЧат", ТаблицаТрафикЧат);
	Запрос.УстановитьПараметр("BIR", BIR);
	ТаблицаТрафик = Запрос.Выполнить().Выгрузить();
	
	Фабрика = ВебСервис.ФабрикаXDTO;
	
	ТаблицаТрафик.Колонки.Добавить("ТипТрафикаНаименование", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "ТипТрафикаНаименование", 40);
	ТаблицаТрафик.Колонки.Добавить("МенеджерНаименование", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "МенеджерНаименование", 40);
	ТаблицаТрафик.Колонки.Добавить("АдминистраторНаименование", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "АдминистраторНаименование", 40);
	ТаблицаТрафик.Колонки.Добавить("ПервичныйПовторныйСтрока", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "ПервичныйПовторныйСтрока", 40);
	ТаблицаТрафик.Колонки.Добавить("UIDОтдел", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "UIDОтдел", 40);
	ТаблицаТрафик.Колонки.Добавить("UIDДилерскийЦентр", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "UIDДилерскийЦентр", 40);
	ТаблицаТрафик.Колонки.Добавить("UIDКлиент", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "UIDКлиент", 40);
	ТаблицаТрафик.Колонки.Добавить("UIDПервичныйИнтерес", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "UIDПервичныйИнтерес", 40);
	ТаблицаТрафик.Колонки.Добавить("UIDИсточникИнформации", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "UIDИсточникИнформации", 40);
	Для Каждого СтрокаТЗ ИЗ ТаблицаТрафик Цикл
		Если ЗначениеЗаполнено(СтрокаТЗ.ТипТрафикаСсылка) Тогда
			СтрокаТЗ.ТипТрафикаНаименование = СтрокаТЗ.ТипТрафикаСсылка.Наименование;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТЗ.МенеджерСсылка) Тогда
			СтрокаТЗ.МенеджерНаименование = СтрокаТЗ.МенеджерСсылка.Наименование;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТЗ.АдминистраторСсылка) Тогда
			СтрокаТЗ.АдминистраторНаименование = СтрокаТЗ.АдминистраторСсылка.Наименование;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТЗ.ПервичныйПовторный) Тогда
			СтрокаТЗ.ПервичныйПовторныйСтрока = ИмяЗначенияПеречисления(СтрокаТЗ.ПервичныйПовторный);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТЗ.ОтделСсылка) Тогда
			СтрокаТЗ.UIDОтдел = Строка(СтрокаТЗ.ОтделСсылка.УникальныйИдентификатор());
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТЗ.ДилерскийЦентрСсылка) Тогда
			СтрокаТЗ.UIDДилерскийЦентр = Строка(СтрокаТЗ.ДилерскийЦентрСсылка.УникальныйИдентификатор());
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТЗ.КлиентСсылка) Тогда
			СтрокаТЗ.UIDКлиент = Строка(СтрокаТЗ.КлиентСсылка.УникальныйИдентификатор());
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТЗ.ПервичныйИнтересСсылка) Тогда
			СтрокаТЗ.UIDПервичныйИнтерес = Строка(СтрокаТЗ.ПервичныйИнтересСсылка.УникальныйИдентификатор());
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТЗ.ИсточникИнформацииСсылка) Тогда
			СтрокаТЗ.UIDИсточникИнформации = Строка(СтрокаТЗ.ИсточникИнформацииСсылка.УникальныйИдентификатор());
		КонецЕсли;
	КонецЦикла;
	ТаблицаТрафик.Колонки.Удалить("ТипТрафикаСсылка");
	ТаблицаТрафик.Колонки.Удалить("МенеджерСсылка");
	ТаблицаТрафик.Колонки.Удалить("АдминистраторСсылка");
	ТаблицаТрафик.Колонки.Удалить("ПервичныйПовторный");
	ТаблицаТрафик.Колонки.Удалить("ОтделСсылка");
	ТаблицаТрафик.Колонки.Удалить("ДилерскийЦентрСсылка");
	ТаблицаТрафик.Колонки.Удалить("КлиентСсылка");
	ТаблицаТрафик.Колонки.Удалить("ПервичныйИнтересСсылка");
	ТаблицаТрафик.Колонки.Удалить("ИсточникИнформацииСсылка");
	
	Сериализатор = Новый СериализаторXDTO(Фабрика);
	Результат = Сериализатор.ЗаписатьXDTO(ТаблицаТрафик);
	ДанныеОтправлены = ВебСервис.SetData(Результат, "SetOKTraffic");
	
	Возврат ТаблицаТрафик;
	
	//Если ДанныеОтправлены = Истина Тогда
	//	ОтменитьРегистрациюТрафикЛиды(Таблица_ДляУдаленияРегистрации, ПланОбмена);
	//КонецЕсли;
	
КонецФункции

Процедура ОтправитьТаблицуКлиенты(ТаблицаТрафикКОтправке, BIR, ВебСервис)
	
	Если ТаблицаТрафикКОтправке.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивИД = ТаблицаТрафикКОтправке.ВыгрузитьКолонку("Идентификатор");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Renault_Трафик.Клиент КАК Ссылка,
	|	ЛОЖЬ КАК УдаленнаяЗапись
	|ПОМЕСТИТЬ ДанныеКлиентов
	|ИЗ РегистрСведений.Renault_Трафик КАК Renault_Трафик
	|ГДЕ Renault_Трафик.Идентификатор В (&МассивИД)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеКлиентов.Ссылка,
	|	ПодтверждающиеДокументы.Серия КАК ПаспортСерия,
	|	ПодтверждающиеДокументы.Номер КАК ПаспортНомер,
	|	ПодтверждающиеДокументы.ДатаВыдачи КАК ПаспортДатаВыдачи,
	|	ПодтверждающиеДокументы.КемВыдан КАК ПаспортКемВыдан,
	|	Контрагенты.Наименование КАК Наименование,
	|	Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
	|	Контрагенты.Фамилия КАК Фамилия,
	|	Контрагенты.Имя КАК Имя,
	|	Контрагенты.Отчество КАК Отчество,
	|	Контрагенты.ФормаСобственности КАК ФормаСобственности,
	|	Контрагенты.ИНН КАК ИНН,
	|	&BIR КАК ИдентификаторИБ,
	|	ЛОЖЬ КАК ЭтоПотенциальный,
	//|	&ПустаяСсылка КАК КонтрагентСсылка,
	|	ЛОЖЬ КАК Архив,
	|	""                                             "" КАК ФормаСобственностиСтрока,
	|	Контрагенты.ПометкаУдаления КАК ПометкаУдаления,
	|	ДанныеКлиентов.УдаленнаяЗапись
	|ИЗ
	|	ДанныеКлиентов КАК ДанныеКлиентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|		ПО (&ВидПодтверждающегоДокумента = ПодтверждающиеДокументы.ВидПодтверждающегоДокумента)
	|			И ДанныеКлиентов.Ссылка = ПодтверждающиеДокументы.Владелец
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДанныеКлиентов.Ссылка = Контрагенты.Ссылка";
	Запрос.УстановитьПараметр("МассивИД", МассивИД);
	Запрос.УстановитьПараметр("ПустаяСсылка", Справочники.Контрагенты.ПустаяСсылка());
	Запрос.УстановитьПараметр("ВидПодтверждающегоДокумента", Перечисления.ВидыДокументов.Паспорт);
	Запрос.УстановитьПараметр("BIR", BIR);
	ТаблицаКлиенты = Запрос.Выполнить().Выгрузить();
	
	Фабрика = ВебСервис.ФабрикаXDTO;
	
	ТаблицаКлиенты.Колонки.Добавить("UID", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "UID", 40);
	ТаблицаКлиенты.Колонки.Добавить("UIDКонтрагент", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "UIDКонтрагент", 40);
	Для Каждого Строка Из ТаблицаКлиенты Цикл
		
		Строка.UID = Строка(Строка.Ссылка.УникальныйИдентификатор());
		Строка.UIDКонтрагент = "";
		
		Если ЗначениеЗаполнено(Строка.ФормаСобственности) Тогда
			Строка.ФормаСобственностиСтрока = ИмяЗначенияПеречисления(Строка.ФормаСобственности);
		КонецЕсли;
	КонецЦикла;
	ТаблицаКлиенты.Колонки.Удалить("Ссылка");
	ТаблицаКлиенты.Колонки.Удалить("ФормаСобственности");
	
	Сериализатор = Новый СериализаторXDTO(Фабрика);
	Результат = Сериализатор.ЗаписатьXDTO(ТаблицаКлиенты);
	ДанныеОтправлены = ВебСервис.SetData(Результат, "SetOKClients");
	
	//Если ДанныеОтправлены = Истина Тогда
	//	ОтменитьРегистрациюТрафикЛиды(Таблица_ДляУдаленияРегистрации, ПланОбмена);
	//КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьТаблицуРезультатыОбработки(ТаблицаДанных, Таблица_ДляУдаленияРегистрации, BIR, ВебСервис, ПланОбмена)
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Ссылка,
	|	Таблица.УдаленнаяЗапись
	|ПОМЕСТИТЬ Врем
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|ВЫБРАТЬ
	|	&BIR КАК ИдентификаторИБ,
	|	Врем.Ссылка КАК Ссылка,
	|	Врем.УдаленнаяЗапись КАК УдаленнаяЗапись,
	|	Renault_РезультатОбработки.Наименование КАК Наименование,
	|	Renault_РезультатОбработки.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Врем КАК Врем
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_РезультатОбработки КАК Renault_РезультатОбработки
	|	ПО Renault_РезультатОбработки.Ссылка = Врем.Ссылка";
	Запрос.УстановитьПараметр("Таблица", ТаблицаДанных);
	Запрос.УстановитьПараметр("BIR", BIR);
	ТаблицаРезультатыОбработки = Запрос.Выполнить().Выгрузить();
	
	Фабрика = ВебСервис.ФабрикаXDTO;
	
	ТаблицаРезультатыОбработки.Колонки.Добавить("UID", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "UID", 40);
	Для Каждого СтрокаТЗ ИЗ ТаблицаРезультатыОбработки Цикл
		Если ЗначениеЗаполнено(СтрокаТЗ.Ссылка) Тогда
			СтрокаТЗ.UID = Строка(СтрокаТЗ.Ссылка.УникальныйИдентификатор());
		КонецЕсли;
	КонецЦикла;
	ТаблицаРезультатыОбработки.Колонки.Удалить("Ссылка");
	
	Сериализатор = Новый СериализаторXDTO(Фабрика);
	Результат = Сериализатор.ЗаписатьXDTO(ТаблицаРезультатыОбработки);
	ДанныеОтправлены = ВебСервис.SetData(Результат, "SetOKProcessingResults");
	
	Если ДанныеОтправлены = Истина Тогда
		ОтменитьРегистрациюСправочникаДокумента(Таблица_ДляУдаленияРегистрации, ПланОбмена);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьТаблицуВидыУслуг(ТаблицаДанных, Таблица_ДляУдаленияРегистрации, BIR, ВебСервис, ПланОбмена)
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Ссылка,
	|	Таблица.УдаленнаяЗапись
	|ПОМЕСТИТЬ Врем
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|ВЫБРАТЬ
	|	&BIR КАК ИдентификаторИБ,
	|	Врем.Ссылка КАК Ссылка,
	|	Врем.УдаленнаяЗапись КАК УдаленнаяЗапись,
	|	Renault_ВидУслуги.Наименование КАК Наименование,
	|	Renault_ВидУслуги.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Врем КАК Врем
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_ВидУслуги КАК Renault_ВидУслуги
	|	ПО Renault_ВидУслуги.Ссылка = Врем.Ссылка";
	Запрос.УстановитьПараметр("Таблица", ТаблицаДанных);
	Запрос.УстановитьПараметр("BIR", BIR);
	ТаблицаВидыУслуг = Запрос.Выполнить().Выгрузить();
	
	Фабрика = ВебСервис.ФабрикаXDTO;
	
	ТаблицаВидыУслуг.Колонки.Добавить("UID", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "UID", 40);
	Для Каждого СтрокаТЗ ИЗ ТаблицаВидыУслуг Цикл
		Если ЗначениеЗаполнено(СтрокаТЗ.Ссылка) Тогда
			СтрокаТЗ.UID = Строка(СтрокаТЗ.Ссылка.УникальныйИдентификатор());
		КонецЕсли;
	КонецЦикла;
	ТаблицаВидыУслуг.Колонки.Удалить("Ссылка");
	
	Сериализатор = Новый СериализаторXDTO(Фабрика);
	Результат = Сериализатор.ЗаписатьXDTO(ТаблицаВидыУслуг);
	ДанныеОтправлены = ВебСервис.SetData(Результат, "SetOKTypesOfLeads");
	
	Если ДанныеОтправлены = Истина Тогда
		ОтменитьРегистрациюСправочникаДокумента(Таблица_ДляУдаленияРегистрации, ПланОбмена);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьТаблицуТрафикЛиды(ТаблицаДанных, Таблица_ДляУдаленияРегистрации, BIR, ВебСервис, ПланОбмена)
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&BIR КАК ИдентификаторИБ,
	|	Таблица.Ссылка,
	|	Таблица.УдаленнаяЗапись
	|ПОМЕСТИТЬ Врем
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|ВЫБРАТЬ
	|	&BIR КАК ИдентификаторИБ,
	|	Врем.Ссылка КАК Ссылка,
	|	Renault_Лид.ТрафикИД КАК ИдТрафика,
	|	Врем.УдаленнаяЗапись КАК УдаленнаяЗапись,
	|	Renault_Лид.ВидУслуги КАК ВидУслугиСсылка,
	|	Renault_Лид.Услуга КАК Услуга,
	|	Renault_Лид.НомерЛида КАК НомерЛида,
	|	Renault_Лид.Сообщение КАК Сообщение,
	|	Renault_Лид.РезультатОбработки КАК РезультатОбработкиСсылка,
	|	Renault_Лид.ДатаПоступления КАК ДатаПоступления
	|ИЗ
	|	Врем КАК Врем
	|ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_Лид КАК Renault_Лид
	|	ПО Renault_Лид.Ссылка = Врем.Ссылка";
	Запрос.УстановитьПараметр("Таблица", ТаблицаДанных);
	Запрос.УстановитьПараметр("BIR", BIR);
	ТаблицаТрафикЛиды = Запрос.Выполнить().Выгрузить();
	
	Фабрика = ВебСервис.ФабрикаXDTO;
	
	ТаблицаТрафикЛиды.Колонки.Добавить("ВидУслуги", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "ВидУслуги", 40);
	ТаблицаТрафикЛиды.Колонки.Добавить("РезультатОбработки", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "РезультатОбработки", 40);
	Для Каждого СтрокаТЗ ИЗ ТаблицаТрафикЛиды Цикл
		Если ЗначениеЗаполнено(СтрокаТЗ.ВидУслугиСсылка) Тогда
			СтрокаТЗ.ВидУслуги = Строка(СтрокаТЗ.ВидУслугиСсылка.УникальныйИдентификатор());
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТЗ.РезультатОбработкиСсылка) Тогда
			СтрокаТЗ.РезультатОбработки = Строка(СтрокаТЗ.РезультатОбработкиСсылка.УникальныйИдентификатор());
		КонецЕсли;
	КонецЦикла;
	ТаблицаТрафикЛиды.Колонки.Удалить("ВидУслугиСсылка");
	ТаблицаТрафикЛиды.Колонки.Удалить("РезультатОбработкиСсылка");
	ТаблицаТрафикЛиды.Колонки.Удалить("Ссылка");
	
	Сериализатор = Новый СериализаторXDTO(Фабрика);
	Результат = Сериализатор.ЗаписатьXDTO(ТаблицаТрафикЛиды);
	ДанныеОтправлены = ВебСервис.SetData(Результат, "SetOKTrafficLeads");
	
	Если ДанныеОтправлены = Истина Тогда
		ОтменитьРегистрациюСправочникаДокумента(Таблица_ДляУдаленияРегистрации, ПланОбмена);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьТаблицуТрафикПисьма(ТаблицаДанных, Таблица_ДляУдаленияРегистрации, BIR, ВебСервис, ПланОбмена)
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&BIR КАК ИдентификаторИБ,
	|	Таблица.ИдентификаторПисьма,
	|	Таблица.ИдТрафика,
	|	Таблица.УдаленнаяЗапись
	|ПОМЕСТИТЬ Врем
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|ВЫБРАТЬ
	|	&BIR КАК ИдентификаторИБ,
	|	Врем.ИдентификаторПисьма КАК ИдентификаторПисьма,
	|	Renault_ТрафикПисьма.ИдТрафика КАК ИдТрафика,
	|	Врем.УдаленнаяЗапись КАК УдаленнаяЗапись,
	|	Renault_ТрафикПисьма.ДатаПоступления КАК ДатаПоступления,
	|	Renault_ТрафикПисьма.ТрафикПросмотрен КАК ТрафикПросмотрен,
	|	Renault_ТрафикПисьма.ДатаПросмотра КАК ДатаПросмотра,
	|	Renault_ТрафикПисьма.РезультатОбработки КАК РезультатОбработкиСсылка
	|ИЗ
	|	Врем КАК Врем
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ТрафикПисьма КАК Renault_ТрафикПисьма
	|	ПО Renault_ТрафикПисьма.ИдентификаторПисьма = Врем.ИдентификаторПисьма
	|	И Renault_ТрафикПисьма.ИдТрафика = Врем.ИдТрафика";
	Запрос.УстановитьПараметр("Таблица", ТаблицаДанных);
	Запрос.УстановитьПараметр("BIR", BIR);
	ТаблицаТрафикПисьма = Запрос.Выполнить().Выгрузить();
	
	Фабрика = ВебСервис.ФабрикаXDTO;
	
	ТаблицаТрафикПисьма.Колонки.Добавить("РезультатОбработки", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "РезультатОбработки", 40);
	Для Каждого СтрокаТЗ ИЗ ТаблицаТрафикПисьма Цикл
		Если ЗначениеЗаполнено(СтрокаТЗ.РезультатОбработкиСсылка) Тогда
			СтрокаТЗ.РезультатОбработки = Строка(СтрокаТЗ.РезультатОбработкиСсылка.УникальныйИдентификатор());
		КонецЕсли;
	КонецЦикла;
	ТаблицаТрафикПисьма.Колонки.Удалить("РезультатОбработкиСсылка");
	
	Сериализатор = Новый СериализаторXDTO(Фабрика);
	Результат = Сериализатор.ЗаписатьXDTO(ТаблицаТрафикПисьма);
	ДанныеОтправлены = ВебСервис.SetData(Результат, "SetOKTrafficLetters");
	
	Если ДанныеОтправлены = Истина Тогда
		ОтменитьРегистрациюТрафикПисьма(Таблица_ДляУдаленияРегистрации, ПланОбмена);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьТаблицуОтветыНаЛиды(ТаблицаДанных, Таблица_ДляУдаленияРегистрации, BIR, ВебСервис, ПланОбмена)
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&BIR КАК ИдентификаторИБ,
	|	Таблица.ИдТрафика,
	|	Таблица.ДатаОтвета,
	|	Таблица.ВидСообщения,
	|	Таблица.УдаленнаяЗапись
	|ПОМЕСТИТЬ Врем
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&BIR КАК ИдентификаторИБ,
	|	Врем.ИдТрафика КАК ИдТрафика,
	|	Врем.ДатаОтвета КАК ДатаОтвета,
	|	Врем.ВидСообщения КАК ВидСообщения,
	|	Врем.УдаленнаяЗапись КАК УдаленнаяЗапись,
	|	Renault_Лид.Ссылка.НомерЛида КАК LeadID,
	|	Renault_ОтветыНаЛиды.Ответ
	|ИЗ
	|	Врем КАК Врем
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ОтветыНаЛиды КАК Renault_ОтветыНаЛиды
	|		ПО Врем.ИдТрафика = Renault_ОтветыНаЛиды.ИдТрафика
	|			И Врем.ДатаОтвета = Renault_ОтветыНаЛиды.ДатаОтвета
	|			И Врем.ВидСообщения = Renault_ОтветыНаЛиды.ВидСообщения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_Лид КАК Renault_Лид
	|		ПО Врем.ИдТрафика = Renault_Лид.ТрафикИД";
	Запрос.УстановитьПараметр("Таблица", ТаблицаДанных);
	Запрос.УстановитьПараметр("BIR", BIR);
	ТаблицаОтветыНаЛиды = Запрос.Выполнить().Выгрузить();
	
	Фабрика = ВебСервис.ФабрикаXDTO;
	
	//ТаблицаОтветыНаЛиды.Колонки.Добавить("LeadID", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "UID", 40);
	//Для Каждого СтрокаТЗ ИЗ ТаблицаОтветыНаЛиды Цикл
	//	Если ЗначениеЗаполнено(СтрокаТЗ.Лид) Тогда
	//		СтрокаТЗ.LeadID = СтрокаТЗ.Лид.НомерЛида;
	//	КонецЕсли;
	//КонецЦикла;
	//ТаблицаОтветыНаЛиды.Колонки.Удалить("Лид");
	
	Сериализатор = Новый СериализаторXDTO(Фабрика);
	Результат = Сериализатор.ЗаписатьXDTO(ТаблицаОтветыНаЛиды);
	ДанныеОтправлены = ВебСервис.SetData(Результат, "SetLeadReply");
	
	Если ДанныеОтправлены = Истина Тогда
		ОтменитьРегистрациюОтветыНаЛиды(Таблица_ДляУдаленияРегистрации, ПланОбмена);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьТаблицуОтветыНаПисьмо(ТаблицаДанных, Таблица_ДляУдаленияРегистрации, BIR, ВебСервис, ПланОбмена)
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&BIR КАК ИдентификаторИБ,
	|	Таблица.ИдТрафика,
	|	Таблица.ДатаОтвета,
	|	Таблица.ВидСообщения,
	|	Таблица.УдаленнаяЗапись
	|ПОМЕСТИТЬ Врем
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|ВЫБРАТЬ
	|	&BIR КАК ИдентификаторИБ,
	|	Renault_ОтветыНаПисьмо.ИдТрафика КАК ИдТрафика,
	|	Renault_ОтветыНаПисьмо.ДатаОтвета КАК ДатаОтвета,
	|	Renault_ОтветыНаПисьмо.ВидСообщения КАК ВидСообщения,
	|	Врем.УдаленнаяЗапись КАК УдаленнаяЗапись
	|ИЗ
	|	Врем КАК Врем
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ОтветыНаПисьмо КАК Renault_ОтветыНаПисьмо
	|	ПО Renault_ОтветыНаПисьмо.ИдТрафика = Врем.ИдТрафика";
	Запрос.УстановитьПараметр("Таблица", ТаблицаДанных);
	Запрос.УстановитьПараметр("BIR", BIR);
	ТаблицаОтветыНаПисьмо = Запрос.Выполнить().Выгрузить();
	
	Фабрика = ВебСервис.ФабрикаXDTO;
	
	//ТаблицаОтветыНаПисьмо.Колонки.Добавить("UID", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "UID", 40);
	//Для Каждого СтрокаТЗ ИЗ ТаблицаОтветыНаПисьмо Цикл
	//	СтрокаТЗ.UID = Строка(СтрокаТЗ.ТипДвигателя.УникальныйИдентификатор());
	//КонецЦикла;
	//ТаблицаОтветыНаПисьмо.Колонки.Удалить("ТипДвигателя");
	
	Сериализатор = Новый СериализаторXDTO(Фабрика);
	Результат = Сериализатор.ЗаписатьXDTO(ТаблицаОтветыНаПисьмо);
	ДанныеОтправлены = ВебСервис.SetData(Результат, "SetLetterReply");
	
	Если ДанныеОтправлены = Истина Тогда
		ОтменитьРегистрациюОтветыНаПисьмо(Таблица_ДляУдаленияРегистрации, ПланОбмена);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьТаблицуТрафикПоСотрудникам(ТаблицаДанных, Таблица_ДляУдаленияРегистрации, BIR, ВебСервис, ПланОбмена)
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.ИдТрафика КАК ИдТрафика,
	|	ВЫРАЗИТЬ(Таблица.Сотрудник КАК Справочник.Сотрудники) КАК Сотрудник,
	|	Таблица.УдаленнаяЗапись КАК УдаленнаяЗапись
	|ПОМЕСТИТЬ Врем
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&BIR КАК ИдентификаторИБ,
	|	Врем.ИдТрафика КАК ИдТрафика,
	|	Врем.Сотрудник КАК СотрудникСсылка,
	|	Врем.Сотрудник.Наименование КАК СотрудникНаименование,
	|	Врем.УдаленнаяЗапись КАК УдаленнаяЗапись,
	|	ЕСТЬNULL(Renault_ТрафикПоСотрудникам.Просмотрен, ЛОЖЬ) КАК Просмотрен,
	|	ЕСТЬNULL(Renault_ТрафикПоСотрудникам.Отвечен, ЛОЖЬ) КАК Отвечен,
	|	ЕСТЬNULL(Renault_ТрафикПоСотрудникам.ДатаПросмотра, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПросмотра
	|ИЗ
	|	Врем КАК Врем
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ТрафикПоСотрудникам КАК Renault_ТрафикПоСотрудникам
	|		ПО Врем.ИдТрафика = Renault_ТрафикПоСотрудникам.ИдТрафика
	|			И Врем.Сотрудник = Renault_ТрафикПоСотрудникам.Сотрудник";
	
	Запрос.УстановитьПараметр("Таблица", ТаблицаДанных);
	Запрос.УстановитьПараметр("BIR", BIR);
	ТаблицаТрафикПоСотрудникам = Запрос.Выполнить().Выгрузить();
	
	Фабрика = ВебСервис.ФабрикаXDTO;
	
	ТаблицаТрафикПоСотрудникам.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "Сотрудник", 40);
	Для Каждого СтрокаТЗ ИЗ ТаблицаТрафикПоСотрудникам Цикл
		СтрокаТЗ.Сотрудник = СтрокаТЗ.СотрудникНаименование;
	КонецЦикла;
	ТаблицаТрафикПоСотрудникам.Колонки.Удалить("СотрудникСсылка");
	ТаблицаТрафикПоСотрудникам.Колонки.Удалить("СотрудникНаименование");
	
	Сериализатор = Новый СериализаторXDTO(Фабрика);
	Результат = Сериализатор.ЗаписатьXDTO(ТаблицаТрафикПоСотрудникам);
	ДанныеОтправлены = ВебСервис.SetData(Результат, "SetOKManagerTraffic");
	
	Если ДанныеОтправлены = Истина Тогда
		ОтменитьРегистрациюТрафикПоСотрудникам(Таблица_ДляУдаленияРегистрации, ПланОбмена);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьТаблицуТрафикЧат(ТаблицаДанных, Таблица_ДляУдаленияРегистрации, BIR, ВебСервис, ПланОбмена)
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&BIR КАК ИдентификаторИБ,
	|	Таблица.id_mess,
	//|	Таблица.IDТрафика,
	|	Таблица.УдаленнаяЗапись
	|ПОМЕСТИТЬ Врем
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|ВЫБРАТЬ
	|	&BIR КАК ИдентификаторИБ,
	//|	Врем.УдаленнаяЗапись КАК УдаленнаяЗапись,
	//|	Renault_ОК_Сообщения.id_mess КАК id_mess,
	|	Renault_ОК_Сообщения.IDТрафика КАК ИдТрафика,
	//|	Renault_ОК_Сообщения.is_for КАК is_for,
	//|	Renault_ОК_Сообщения.is_from КАК is_from,
	|	МИНИМУМ(ВЫБОР КОГДА Renault_ОК_Сообщения.is_from = 1 ТОГДА Renault_ОК_Сообщения.wr_date КОНЕЦ) КАК ДатаВремяПервогоСообщения,
	|	МИНИМУМ(ВЫБОР КОГДА Renault_ОК_Сообщения.is_from = 2 ТОГДА Renault_ОК_Сообщения.wr_date КОНЕЦ) КАК ДатаВремяПервогоОтвета
	|ИЗ
	|	Врем КАК Врем
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ОК_Сообщения КАК Renault_ОК_Сообщения
	|	ПО Renault_ОК_Сообщения.id_mess = Врем.id_mess
	|ГДЕ Renault_ОК_Сообщения.Внутренний = ЛОЖЬ
	|СГРУППИРОВАТЬ ПО
	|	Renault_ОК_Сообщения.IDТрафика";
	Запрос.УстановитьПараметр("Таблица", ТаблицаДанных);
	Запрос.УстановитьПараметр("BIR", BIR);
	ТаблицаТрафикЧат = Запрос.Выполнить().Выгрузить();
	
	Фабрика = ВебСервис.ФабрикаXDTO;
	
	ТаблицаТрафикЧат.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "Сотрудник", 40);
	Для Каждого СтрокаТЗ ИЗ ТаблицаТрафикЧат Цикл
		СтрокаТЗ.Сотрудник = СтрокаТЗ.СотрудникСсылка.Наименование;
	КонецЦикла;
	ТаблицаТрафикЧат.Колонки.Удалить("СотрудникСсылка");
	
	Сериализатор = Новый СериализаторXDTO(Фабрика);
	Результат = Сериализатор.ЗаписатьXDTO(ТаблицаТрафикЧат);
	ДанныеОтправлены = ВебСервис.SetData(Результат, "SetOKTrafficChat");
	
	Если ДанныеОтправлены = Истина Тогда
		ОтменитьРегистрациюТрафикЧат(Таблица_ДляУдаленияРегистрации, ПланОбмена);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьТаблицуДЦ(BIR, ВебСервис, ПланОбмена)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_ДилерскиеЦентры.Ссылка,
	|	CRM_ДилерскиеЦентры.Бир_ЛМТ
	|ИЗ
	|	Справочник.CRM_ДилерскиеЦентры КАК CRM_ДилерскиеЦентры
	|ГДЕ
	|	CRM_ДилерскиеЦентры.ПометкаУдаления = ЛОЖЬ";
	ТаблицаДЦ = Запрос.Выполнить().Выгрузить();
	
	Фабрика = ВебСервис.ФабрикаXDTO;
	
	ТаблицаДЦ.Колонки.Добавить("ДилерскийЦентр", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "ДилерскийЦентр", 40);
	Для Каждого СтрокаТЗ ИЗ ТаблицаДЦ Цикл
		СтрокаТЗ.ДилерскийЦентр = Строка(СтрокаТЗ.Ссылка.УникальныйИдентификатор());
	КонецЦикла;
	ТаблицаДЦ.Колонки.Удалить("Ссылка");
	
	Сериализатор = Новый СериализаторXDTO(Фабрика);
	Результат = Сериализатор.ЗаписатьXDTO(ТаблицаДЦ);
	ДанныеОтправлены = ВебСервис.SetData(Результат, "SetDealer");
	
КонецПроцедуры

Процедура ОтправитьТаблицуНастройкиКЦ(ТаблицаДанных, Таблица_ДляУдаленияРегистрации, BIR, ВебСервис, ПланОбмена)
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Ссылка,
	|	Таблица.УдаленнаяЗапись
	|ПОМЕСТИТЬ Врем
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|ВЫБРАТЬ
	|	&BIR КАК ИдентификаторИБ,
	|	Врем.Ссылка КАК Ссылка,
	|	Врем.УдаленнаяЗапись КАК УдаленнаяЗапись,
	|	АдресатыСлужебныхСообщений.Пользователь.Наименование КАК Наименование,
	|	АдресатыСлужебныхСообщений.Пользователь КАК ПользовательСсылка,
	|	АдресатыСлужебныхСообщений.Email КАК Email,
	|	АдресатыСлужебныхСообщений.Телефон КАК Телефон
	|ИЗ
	|	Врем КАК Врем
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_НастройкиОнлайнКонсультанта.АдресатыСлужебныхСообщений КАК АдресатыСлужебныхСообщений
	|	ПО АдресатыСлужебныхСообщений.Ссылка = Врем.Ссылка";
	Запрос.УстановитьПараметр("Таблица", ТаблицаДанных);
	Запрос.УстановитьПараметр("BIR", BIR);
	ТаблицаНастройкиКЦ = Запрос.Выполнить().Выгрузить();
	
	Фабрика = ВебСервис.ФабрикаXDTO;
	
	ТаблицаНастройкиКЦ.Колонки.Добавить("UID", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "UID", 40);
	ТаблицаНастройкиКЦ.Колонки.Добавить("ПользовательUID", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)), "ПользовательUID", 40);
	Для Каждого СтрокаТЗ ИЗ ТаблицаНастройкиКЦ Цикл
		Если ЗначениеЗаполнено(СтрокаТЗ.Ссылка) Тогда
			СтрокаТЗ.UID = Строка(СтрокаТЗ.Ссылка.УникальныйИдентификатор());
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТЗ.ПользовательСсылка) Тогда
			СтрокаТЗ.ПользовательUID = Строка(СтрокаТЗ.ПользовательСсылка.УникальныйИдентификатор());
		КонецЕсли;
	КонецЦикла;
	ТаблицаНастройкиКЦ.Колонки.Удалить("Ссылка");
	ТаблицаНастройкиКЦ.Колонки.Удалить("ПользовательСсылка");
	
	Сериализатор = Новый СериализаторXDTO(Фабрика);
	Результат = Сериализатор.ЗаписатьXDTO(ТаблицаНастройкиКЦ);
	ДанныеОтправлены = ВебСервис.SetData(Результат, "SetOKSettings");
	
	Если ДанныеОтправлены = Истина Тогда
		ОтменитьРегистрациюСправочникаДокумента(Таблица_ДляУдаленияРегистрации, ПланОбмена);
	КонецЕсли;
	
КонецПроцедуры


Процедура ЗаполнитьПустымиЗначениями(СтрокаОтправки)
	
	Для Каждого Свойство ИЗ СтрокаОтправки.Свойства() Цикл
		Если НЕ ТипЗнч(СтрокаОтправки[Свойство.Имя]) = Тип("СписокXDTO") Тогда
			СтрокаОтправки[Свойство.Имя] = "";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтменитьРегистрациюСправочникаДокумента(ТаблицаОписание, ПланОбмена)

	Для Каждого КлючевыеПоля из ТаблицаОписание Цикл
		
		ПланыОбмена.УдалитьРегистрациюИзменений(ПланОбмена, КлючевыеПоля.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтменитьРегистрациюТрафикПоСотрудникам(ТаблицаОписание, ПланОбмена)
	
	Для Каждого КлючевыеПоля из ТаблицаОписание Цикл
		Набор = РегистрыСведений.Renault_ТрафикПоСотрудникам.СоздатьНаборЗаписей();
		Набор.Отбор.ИдТрафика.Установить(КлючевыеПоля.ИдТрафика);
		Набор.Отбор.Сотрудник.Установить(КлючевыеПоля.Сотрудник);
		ПланыОбмена.УдалитьРегистрациюИзменений(ПланОбмена, Набор);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтменитьРегистрациюТрафикПисьма(ТаблицаОписание, ПланОбмена)
	
	Для Каждого КлючевыеПоля из ТаблицаОписание Цикл
		Набор = РегистрыСведений.Renault_ТрафикПисьма.СоздатьНаборЗаписей();
		Набор.Отбор.ИдентификаторПисьма.Установить(КлючевыеПоля.ИдентификаторПисьма);
		Набор.Отбор.ИдТрафика.Установить(КлючевыеПоля.ИдТрафика);
		ПланыОбмена.УдалитьРегистрациюИзменений(ПланОбмена, Набор);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтменитьРегистрациюОтветыНаЛиды(ТаблицаОписание, ПланОбмена)
	
	Для Каждого КлючевыеПоля из ТаблицаОписание Цикл
		Если КлючевыеПоля.УдаленнаяЗапись = Неопределено или КлючевыеПоля.УдаленнаяЗапись Тогда
			Набор = РегистрыСведений.Renault_ОтветыНаЛиды.СоздатьНаборЗаписей();
			Набор.Отбор.ИдТрафика.Установить(КлючевыеПоля.ИдТрафика);
			Набор.Отбор.ДатаОтвета.Установить(КлючевыеПоля.ДатаОтвета);
			Набор.Отбор.ВидСообщения.Установить(КлючевыеПоля.ВидСообщения);
			ПланыОбмена.УдалитьРегистрациюИзменений(ПланОбмена, Набор);
		Иначе
			Набор = РегистрыСведений.Renault_ОтветыНаЛиды.СоздатьНаборЗаписей();
			Набор.Отбор.ИдТрафика.Установить(КлючевыеПоля.ИдТрафика);
			Набор.Отбор.ДатаОтвета.Установить(КлючевыеПоля.ДатаОтвета);
			Набор.Отбор.ВидСообщения.Установить(КлючевыеПоля.ВидСообщения);
			Набор.Прочитать();
			Если Набор.Количество() <> 0 Тогда
				Для Каждого СтрокаНД из Набор Цикл
					СтрокаНД.Отправлен = Истина;
				КонецЦикла;
				Набор.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтменитьРегистрациюОтветыНаПисьмо(ТаблицаОписание, ПланОбмена)
	
	Для Каждого КлючевыеПоля из ТаблицаОписание Цикл
		Набор = РегистрыСведений.Renault_ОтветыНаПисьмо.СоздатьНаборЗаписей();
		Набор.Отбор.ИдТрафика.Установить(КлючевыеПоля.ИдТрафика);
		Набор.Отбор.ДатаОтвета.Установить(КлючевыеПоля.ДатаОтвета);
		Набор.Отбор.ВидСообщения.Установить(КлючевыеПоля.ВидСообщения);
		ПланыОбмена.УдалитьРегистрациюИзменений(ПланОбмена, Набор);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтменитьРегистрациюТрафикЧат(ТаблицаОписание, ПланОбмена)
	
	Для Каждого КлючевыеПоля из ТаблицаОписание Цикл
		Набор = РегистрыСведений.Renault_ОК_Сообщения.СоздатьНаборЗаписей();
		Набор.Отбор.id_mess.Установить(КлючевыеПоля.id_mess);
		ПланыОбмена.УдалитьРегистрациюИзменений(ПланОбмена, Набор);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПрокси()
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	ПарольWS = Настройки.ПарольДоступаКВебСервисам;
	ЛогинWS = Настройки.ЛогинДоступаКВебСервисам;
	
	Адрес = Настройки.КЦАдресСервера;
	ОпределениеСервиса = Новый WSОпределения(СокрЛП(Адрес) + "ws/ContactCenter.ws?wsdl", ЛогинWS, ПарольWS);
	ВебСервис = Новый WSПрокси(
		ОпределениеСервиса, 
		"http://renault-nissan.com/schema/ContactCenter", 
		"Renault_ContactCenter",
		"Renault_ContactCenterSoap12",
		3600);
	ВебСервис.Пользователь	 = ЛогинWS;
	ВебСервис.Пароль		 = ПарольWS;
	
	Возврат ВебСервис;
	
КонецФункции

Функция ИмяЗначенияПеречисления(Значение) Экспорт
 
	 ОбъектМетаданных = Значение.Метаданные();
	 
	 ИндексЗначения = Перечисления[ОбъектМетаданных.Имя].Индекс(Значение);
	 
	 Возврат ОбъектМетаданных.ЗначенияПеречисления[ИндексЗначения].Имя;
 
КонецФункции
