
Функция ВыполнитьРассылку(ПочтовыйАдрес = "") Экспорт
	
	Ответ = Неопределено;
	
	// Сформируем табличный документ к отправке
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Renault_ТрафикПоСотрудникам.ИдТрафика
	|ПОМЕСТИТЬ ОтвеченныеЛиды
	|ИЗ РегистрСведений.Renault_ТрафикПоСотрудникам КАК Renault_ТрафикПоСотрудникам
	|ГДЕ Renault_ТрафикПоСотрудникам.Отвечен = ИСТИНА
	|;
	|ВЫБРАТЬ
	|	Renault_Трафик.Идентификатор,
	|	Renault_Трафик.ДилерскийЦентр КАК ДЦ,
	|	Renault_Лид.ДатаЗаогрузки КАК ДатаПоступления,
	|	Представление(Renault_Лид.ВидУслуги.Классификация) КАК Тип,
	|	Представление(Renault_Лид.ВидУслуги.Тип) КАК ПодТип,
	|	КонтактнаяИнформация.Представление КАК Email
	|ИЗ
	|	РегистрСведений.Renault_Трафик КАК Renault_Трафик
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_Лид КАК Renault_Лид
	|		ПО Renault_Трафик.Идентификатор = Renault_Лид.ТрафикИД
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтвеченныеЛиды
	|		ПО Renault_Трафик.Идентификатор = ОтвеченныеЛиды.ИдТрафика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО Renault_Трафик.Клиент = КонтактнаяИнформация.Объект
	|		И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|ГДЕ
	|	Renault_Трафик.ТипТрафика = &ТипТрафика
	|	И ОтвеченныеЛиды.ИдТрафика ЕСТЬ NULL";
	Запрос.УстановитьПараметр("ТипТрафика", Справочники.CRM_ТипТрафика.ЛидRenault);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Макет = ПолучитьМакет("Макет");
	ТабДок = Новый ТабличныйДокумент;
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(ОбластьШапка);
	Пока Выборка.Следующий() Цикл
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Выборка);
		ТабДок.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ВремКаталог = КаталогВременныхФайлов();
	ИмяВремФайла = ПолучитьИмяВременногоФайла("XLS");
	ТабДок.Записать(ИмяВремФайла, ТипФайлаТабличногоДокумента.XLS);
	
	ТаблицаВложений = Новый ТаблицаЗначений;
	ТаблицаВложений.Колонки.Добавить("Данные");
	ТаблицаВложений.Колонки.Добавить("Расширение");
	Файл = Новый Файл(ИмяВремФайла);
	Расширение = Сред(Файл.Расширение, 2);
	Данные = Новый ДвоичныеДанные(ИмяВремФайла);
	НоваяСтрокаВложения = ТаблицаВложений.Добавить();
	НоваяСтрокаВложения.Данные = Данные;
	НоваяСтрокаВложения.Расширение = Расширение;
	
	// найдем кому отправлять
	Если ПочтовыйАдрес = "" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_НастройкиОнлайнКонсультантаАвтоматическоеНапоминание.Пользователь,
		|	Renault_НастройкиОнлайнКонсультантаАвтоматическоеНапоминание.Email,
		|	Renault_НастройкиОнлайнКонсультантаАвтоматическоеНапоминание.Расписание,
		|	ЕСТЬNULL(Renault_КонтактЦентр_ПоследниеРассылкиОповещений.ПоследняяОтправка, &ПустаяДата) КАК ПоследняяОтправка
		|ИЗ
		|	Справочник.Renault_НастройкиОнлайнКонсультанта.АвтоматическоеНапоминание КАК Renault_НастройкиОнлайнКонсультантаАвтоматическоеНапоминание
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КонтактЦентр_ПоследниеРассылкиОповещений КАК Renault_КонтактЦентр_ПоследниеРассылкиОповещений
		|		ПО Renault_НастройкиОнлайнКонсультантаАвтоматическоеНапоминание.Пользователь = Renault_КонтактЦентр_ПоследниеРассылкиОповещений.Пользователь";
		Запрос.УстановитьПараметр("ПустаяДата", '00010101');
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаРасписание = Выборка.Расписание;
			ТекущийДень = ДеньНедели(ТекущаяДата());
			Если ТекущийДень = 1 Тогда
				ЕстьВРасписании = Найти(СтрокаРасписание, "Пн");
			ИначеЕсли ТекущийДень = 2 Тогда
				ЕстьВРасписании = Найти(СтрокаРасписание, "Вт");
			ИначеЕсли ТекущийДень = 3 Тогда
				ЕстьВРасписании = Найти(СтрокаРасписание, "Ср");
			ИначеЕсли ТекущийДень = 4 Тогда
				ЕстьВРасписании = Найти(СтрокаРасписание, "Чт");
			ИначеЕсли ТекущийДень = 5 Тогда
				ЕстьВРасписании = Найти(СтрокаРасписание, "Пт");
			ИначеЕсли ТекущийДень = 6 Тогда
				ЕстьВРасписании = Найти(СтрокаРасписание, "Сб");
			ИначеЕсли ТекущийДень = 7 Тогда
				ЕстьВРасписании = Найти(СтрокаРасписание, "Вс");
			КонецЕсли;
			Если ЕстьВРасписании = 0 Тогда
				Продолжить;
			КонецЕсли;
			ИндексВремя = Найти(СтрокаРасписание, "Время:");
			Если ИндексВремя = 0 Тогда
				Продолжить;
			КонецЕсли;
			СтрокаРасписание = Сред(СтрокаРасписание, ИндексВремя + 6);
			МассивВрем = Renault_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаРасписание, ",");
			Для Каждого Время ИЗ МассивВрем Цикл
				Инд = Найти(Время, ":");
				Час = Число(Лев(Время, Инд-1));
				Время = Сред(Время, Инд+1);
				Инд = Найти(Время, ":");
				Минута = Число(Лев(Время, Инд-1));
				Время = Сред(Время, Инд+1);
				Секунда = Число(Время);
				ТребуемоеВремяВыполнения = НачалоДня(ТекущаяДата()) + Час * 3600 + Минута * 60 + Секунда;
				Если ТекущаяДата() >= ТребуемоеВремяВыполнения И Выборка.ПоследняяОтправка <= ТребуемоеВремяВыполнения Тогда
					//////////
					Ответ = ОтправитьПисьмо(Выборка.Email, ТаблицаВложений, Выборка.Пользователь);
					
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	Иначе
		
		Ответ = ОтправитьПисьмо(ПочтовыйАдрес, ТаблицаВложений, Справочники.Пользователи.ПустаяСсылка());
		
	КонецЕсли;
	
	Возврат ТабДок;
	
КонецФункции

Функция ОтправитьПисьмо(Email, ТаблицаВложений, Пользователь)
	
	ТекстСообщения = "Имеются неотвеченные лиды!";
	ТемаПисьма = "Неотвеченные лиды";
	ДопПараметры = Новый Структура;
	
	//Ответ = Renault_ОнлайнКонсультант.ОтправитьОтветНаЛидВебСервис(ТекстСообщения, Неопределено, Выборка.Email, ТемаПисьма, ТаблицаВложений, ДопПараметры);
	Ответ = Renault_ОнлайнКонсультант.ОтправитьПочтовоеСообщениеЧерезЦентральныйСервер(ТекстСообщения, Неопределено, Email, ТемаПисьма, ТаблицаВложений, ДопПараметры, Ложь);
	
	// отметим факт отправки
	Если Ответ = Истина Тогда
		Запись = РегистрыСведений.Renault_КонтактЦентр_ПоследниеРассылкиОповещений.СоздатьМенеджерЗаписи();
		Запись.Пользователь = Пользователь;
		Запись.Прочитать();
		Запись.Пользователь = Пользователь;
		Запись.ПоследняяОтправка = ТекущаяДата();
		Запись.Записать();
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции