
&НаКлиенте
Процедура Выгрузить(Команда)
	ВыгрузитьНаСервере();
КонецПроцедуры


&НаСервере
Процедура ВыгрузитьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОбработкаНаСервере();
	//Предупреждение("Данные отправлены.");
	
КонецПроцедуры


&НаКлиенте
Процедура ЗарегистрироватьИзменения(Команда)
	
	ЗарегистрироватьИзмененияНаСервере(Объект.ПланОбмена);
	Состояние("Данные зарегистрированы.");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗарегистрироватьИзмененияНаСервере(ПланОбмена)
	
	ПланыОбмена.ЗарегистрироватьИзменения(ПланОбмена);	
	
КонецПроцедуры

