
Функция ОбработатьТекстОтвета(Текст)
	
	РезультатПроверки = Неопределено;
	
	РезультатыОтветов = Новый Соответствие;
	
	РезультатыОтветов.Вставить("exist"         , 1); //адрес существует
	РезультатыОтветов.Вставить("does not exist", 2); //адрес не существует
	РезультатыОтветов.Вставить("check failed"  , 3); //проверить не удалось
	РезультатыОтветов.Вставить("кey is wrong"  , 4); //неверный ключ
	
	Если Текст <> "" Тогда
		
		ПозицияСимволаДвоеточие = Найти(Текст, ":");
		ДлинаСтроки = СтрДлина(Текст);
		КолвоВыбираемыхСимволов = ДлинаСтроки - ПозицияСимволаДвоеточие - 3;
		РезультатТекст = Сред(Текст, ПозицияСимволаДвоеточие + 2, КолвоВыбираемыхСимволов);
		
		Для Каждого КлючИЗначение Из РезультатыОтветов Цикл
			Если РезультатТекст = КлючИЗначение.Ключ Тогда 
				РезультатПроверки = РезультатыОтветов.Получить(КлючИЗначение.Ключ);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат РезультатПроверки;
		
КонецФункции

