Процедура ЗагрузитьСсылкиЮтуб(Отладка,ТолькоСОстаткомАвто) Экспорт
	
	//Бондаренко++ 20200521
	//СерверДляЗапроса = "207.246.94.5";
 	СерверДляЗапроса = "tizerdev.ru";
	///// https://tizerdev.ru/api/product_data?id=
	//Бондаренко-- 20200521
	
	Для Сч = 1 По 11 Цикл
		
		ОбработкаПрерыванияПользователя();
		
		ФайлСтрокой = ПолучитьИмяВременногоФайла("json"); 
		
		Если      Сч =   1 Тогда    апи = "/api/product_data?id=131"; //Сокол Моторс Рено Шахты
		ИначеЕсли Сч =   2 Тогда	апи = "/api/product_data?id=132"; //Geely Сокол Моторс Шахты
		ИначеЕсли Сч =   3 Тогда	апи = "/api/product_data?id=133"; //Ниссан Сокол Моторс Шахты
 		ИначеЕсли Сч =   4 Тогда	апи = "/api/product_data?id=191"; //Autosale Шолохова
		ИначеЕсли Сч =   5 Тогда	апи = "/api/product_data?id=194"; //Автолига Форд
		ИначеЕсли Сч =   6 Тогда	апи = "/api/product_data?id=195"; //Лада Рассвет
		ИначеЕсли Сч =   7 Тогда	апи = "/api/product_data?id=196"; //Лада Таганрог
		ИначеЕсли Сч =   8 Тогда	апи = "/api/product_data?id=197"; //СоколМоторс Волгодонск
		ИначеЕсли Сч =   9 Тогда	апи = "/api/product_data?id=201"; //Сузуки Сокол Моторс Ростов
		ИначеЕсли Сч =  10 Тогда	апи = "/api/product_data?id=202"; //Дельта Моторс Хендэ См
		ИначеЕсли Сч =  11 Тогда	апи = "/api/product_data?id=203"; //Гамма Джип Фиат Ростов
		КонецЕсли; 
		
		//Соединение = Новый HTTPсоединение(СерверДляЗапроса,8081,,,,,Новый ЗащищенноеСоединениеOpenSSL());
		Соединение = Новый HTTPсоединение(СерверДляЗапроса,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
		Соединение.Получить(апи, ФайлСтрокой);
		
		Если Отладка Тогда
			#Если Клиент Тогда
				Сообщить("Удачно выполнен GET запрос!");
			#КонецЕсли
		Конецесли;	
		
		ИмяФайла = ФайлСтрокой;
		
		Если Отладка Тогда
			#Если Клиент Тогда
				Сообщить(СокрЛП(Сч)+").Чтение файла "+ИмяФайла);
			#КонецЕсли
		Конецесли;	
		
		ЧтениеИзJSON(ИмяФайла);
		
		Попытка
			УдалитьФайлы(ФайлСтрокой,"*.json");
		Исключение
			#Если Клиент Тогда
			Сообщить(ОписаниеОшибки());
			#КонецЕсли
		КонецПопытки;
		
	КонецЦикла; 
	
	#Если Клиент Тогда
		Сообщить("Обработка завершена "+Формат(ТекущаяДата(),"ДЛФ=DDT"));
	#КонецЕсли
	
КонецПроцедуры

Процедура ЧтениеИзJSON(ИмяФайла) Экспорт
	url_эталон = "";
	тЧтение = Новый ЧтениеJSON;
	тЧтение.ОткрытьФайл(ИмяФайла);
	Пока тЧтение.Прочитать() Цикл
		Если Отладка Тогда
			#Если Клиент Тогда
				Сообщить("Тип текущего элемента " + тЧтение.ТипТекущегоЗначения);
			#КонецЕсли
		КонецЕсли; 
		Если тЧтение.ТипТекущегоЗначения = ТипЗначенияJSON.ИмяСвойства Тогда
			Имя  = тЧтение.ТекущееЗначение;
			Если Отладка Тогда
				#Если Клиент Тогда
					Сообщить("Имя = " + Имя );
				#КонецЕсли
			КонецЕсли; 
		КонецЕсли;
		Если тЧтение.ТипТекущегоЗначения = ТипЗначенияJSON.Булево ИЛИ
			тЧтение.ТипТекущегоЗначения = ТипЗначенияJSON.Строка ИЛИ 
			тЧтение.ТипТекущегоЗначения = ТипЗначенияJSON.Число ИЛИ 
			тЧтение.ТипТекущегоЗначения = ТипЗначенияJSON.Комментарий Тогда
			ТекущееЗначение = тЧтение.ТекущееЗначение;
			Если Отладка Тогда
				#Если Клиент Тогда
					Сообщить("Значение = " + ТекущееЗначение);
				#КонецЕсли
			КонецЕсли; 
			Если Имя = "vin" Тогда
				#Если Клиент Тогда
					Сообщить("vin = "+ТекущееЗначение);
				#КонецЕсли
				Если ТолькоСОстаткомАвто Тогда
					СЗ_авто = Новый СписокЗначений;
					СЗ_авто = НайтиВсеАвтоПоКраткомуVIN(Врег(ТекущееЗначение));
					Для каждого ТекАвто Из СЗ_авто Цикл
						ТекАвтОбъект = ТекАвто.Значение.ПолучитьОбъект();
						ТекАвтОбъект.СсылкаНаВидео = url_эталон;
 						Попытка
							ТекАвтОбъект.Записать();
							#Если Клиент Тогда
								Сообщить("Записан "+ТекАвтОбъект+" с видео "+ТекАвтОбъект.СсылкаНаВидео,СтатусСообщения.Важное);
							#КонецЕсли
						Исключение
							Если Отладка Тогда
								#Если Клиент Тогда
									Сообщить("ОШИБКА! Не записан "+ТекАвтОбъект,СтатусСообщения.ОченьВажное);					
								#КонецЕсли
							КонецЕсли;
						КонецПопытки;
 					КонецЦикла; 
					url_эталон = "";
 				Иначе
					ТекАвто = Справочники.Автомобили.НайтиПоРеквизиту("КраткийVIN",Врег(ТекущееЗначение));
					Если Не обЗначениеНеЗаполнено(ТекАвто) Тогда
						ТекАвтОбъект = ТекАвто.ПолучитьОбъект();
						ТекАвтОбъект.СсылкаНаВидео = url_эталон;
 						Попытка
							ТекАвтОбъект.Записать();
							#Если Клиент Тогда
								Сообщить("Записан "+ТекАвтОбъект+" с видео "+ТекАвтОбъект.СсылкаНаВидео,СтатусСообщения.Важное);
							#КонецЕсли
						Исключение
							Если Отладка Тогда
								#Если Клиент Тогда
									Сообщить("ОШИБКА! Не записан "+ТекАвтОбъект,СтатусСообщения.ОченьВажное);					
								#КонецЕсли
							КонецЕсли;
						КонецПопытки;
						url_эталон = "";
					КонецЕсли; 
				КонецЕсли; 
			ИначеЕсли Имя = "url" Тогда
				Если Отладка Тогда
					#Если Клиент Тогда
						Сообщить("url = "+ТекущееЗначение);
					#КонецЕсли
				КонецЕсли;
				url_эталон = ТекущееЗначение;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	тЧтение.Закрыть(); 	   
	
КонецПроцедуры

Функция НайтиВсеАвтоПоКраткомуVIN(СемизначныйVIN)
 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль,
		|	ОстаткиАвтомобилейОстатки.КоличествоОстаток,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.КраткийVIN
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилейОстатки
		|ГДЕ
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ЭтоГруппа = ЛОЖЬ
		|	И ОстаткиАвтомобилейОстатки.Автомобиль.КраткийVIN = &КраткийVIN";
	
	Запрос.УстановитьПараметр("КраткийVIN", СемизначныйVIN);
	
	СЗ = Новый СписокЗначений;
	
	СЗ.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Автомобиль"));
	
	Возврат СЗ;
	
 КонецФункции // НайтиВсеАвтоПоКраткомуVIN()

