
Процедура ОбновитьСправочник() Экспорт 

	Макет = ПолучитьМакет("ДанныеСправочника");
	//ОбластьГрупп = Макет.ПолучитьОбласть("Группы");
	//
	//НачальнаяСтрока = 2;
	//КонечнаяСтрока = ОбластьГрупп.ВысотаТаблицы;
	//
	//Для НомерСтроки = НачальнаяСтрока По КонечнаяСтрока Цикл
	//	
	//	Код = Число(СокрЛП(ОбластьГрупп.Область(НомерСтроки, 1).Текст));
	//	Наименование = ОбластьГрупп.Область(НомерСтроки, 2).Текст;
	//	
	//	Если НайтиПоКоду(Код).Пустая() Тогда
	//		НоваяГруппа = СоздатьГруппу();
	//		НоваяГруппа.Код = Код;
	//		НоваяГруппа.Наименование = Наименование;
	//		НоваяГруппа.Записать();
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
	ОбластьЭлементов = Макет.ПолучитьОбласть("Элементы");
	
	НачальнаяСтрока = 2;
	КонечнаяСтрока = ОбластьЭлементов.ВысотаТаблицы;
	
	Для НомерСтроки = НачальнаяСтрока По КонечнаяСтрока Цикл
		
		ИмяПредопределенное = СокрЛП(ОбластьЭлементов.Область(НомерСтроки, 1).Текст);
		Наименование = ОбластьЭлементов.Область(НомерСтроки, 2).Текст;
		Описание = ОбластьЭлементов.Область(НомерСтроки, 3).Текст;
		Расписание = ОбластьЭлементов.Область(НомерСтроки, 4).Текст;
		//КодГруппы = Число(СокрЛП(ОбластьЭлементов.Область(НомерСтроки, 4).Текст));
		ИспользованиеИндекс = Число(ОбластьЭлементов.Область(НомерСтроки, 5).Текст);

		Использование = ОбластьЭлементов.Область(НомерСтроки, 6).Текст;
		//ТО = ОбластьЭлементов.Область(НомерСтроки, 6).Текст = "Истина";
		ЭлементСсылка = НайтиПоНаименованию(Наименование);
		
		Если Не ЭлементСсылка.Пустая() Тогда
			ЭлементОбъект = ЭлементСсылка.ПолучитьОбъект();
			ЭлементОбъект.Описание = Описание;
			ЭлементОбъект.Расписание = Расписание;
			ЭлементОбъект.Использование = Перечисления.DMS_ИспользованиеРегЗаданий[ИспользованиеИндекс];
			ЭлементОбъект.Записать();
		КонецЕсли;
		
		//Если НайтиПоКоду(Код).Пустая() Тогда
		//	НовыйЭлемент = СоздатьЭлемент();
		//	НовыйЭлемент.Код = Код;
		//	НовыйЭлемент.Наименование = Наименование;
		//	НовыйЭлемент.Родитель = НайтиПоКоду(КодГруппы);
		//	НовыйЭлемент.КС = КС;
		//	НовыйЭлемент.ТО = ТО;
		//	НовыйЭлемент.Записать();
		//КонецЕсли;
	КонецЦикла;


КонецПроцедуры
