
Функция ФормированиеОтчет()
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("СкладКомпании",Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании"));
	ТаблицаЗначений.Колонки.Добавить("Номенклатура" ,Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаЗначений.Колонки.Добавить("Документ"     ,Новый ОписаниеТипов("ДокументСсылка.ПеремещениеТоваров"));
	ТаблицаЗначений.Колонки.Добавить("ОстатокНаТекущийДокумент",Новый ОписаниеТипов("Число"));
	ТаблицаЗначений.Колонки.Добавить("КоличествоБазовое",Новый ОписаниеТипов("Число"));
	ТаблицаЗначений.Колонки.Добавить("ИтоговыйОстаток",Новый ОписаниеТипов("Число"));
	ТаблицаЗначений.Колонки.Добавить("СуммаРасход",Новый ОписаниеТипов("Число"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОстаткиТоваровКомпанииОстатки.СкладКомпании КАК СкладКомпании,
	               |	ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	               |	ВложенныйЗапрос.Дата КАК Дата,
	               |	ЕСТЬNULL(ВложенныйЗапрос.КоличествоБазовое, 0) КАК КоличествоБазовое,
	               |	ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	               |	ВложенныйЗапрос.Ссылка КАК Ссылка,
	               |	ВложенныйЗапрос1.СуммаРасход КАК СуммаРасход
	               |ИЗ
	               |	РегистрНакопления.ОстаткиТоваровКомпании.Остатки КАК ОстаткиТоваровКомпанииОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
	               |			ПеремещениеТоваровТовары.Количество КАК Количество,
	               |			ПеремещениеТоваровТовары.КоличествоБазовое КАК КоличествоБазовое,
	               |			ПеремещениеТоваровТовары.Ссылка.Дата КАК Дата,
	               |			ПеремещениеТоваровТовары.Ссылка.СкладПолучатель КАК СкладПолучатель,
	               |			ПеремещениеТоваровТовары.Ссылка КАК Ссылка
	               |		ИЗ
	               |			Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары) КАК ВложенныйЗапрос
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ПартииТоваровКомпанииОбороты.СуммаРасход КАК СуммаРасход,
	               |				ПартииТоваровКомпанииОбороты.Номенклатура КАК Номенклатура,
	               |				ПартииТоваровКомпанииОбороты.Регистратор КАК Регистратор
	               |			ИЗ
	               |				РегистрНакопления.ПартииТоваровКомпании.Обороты(, , Регистратор, ) КАК ПартииТоваровКомпанииОбороты) КАК ВложенныйЗапрос1
	               |			ПО ВложенныйЗапрос.Ссылка = ВложенныйЗапрос1.Регистратор
	               |				И ВложенныйЗапрос.Номенклатура = ВложенныйЗапрос1.Номенклатура
	               |		ПО ОстаткиТоваровКомпанииОстатки.Номенклатура = ВложенныйЗапрос.Номенклатура
	               |			И ОстаткиТоваровКомпанииОстатки.СкладКомпании = ВложенныйЗапрос.СкладПолучатель
	               |ГДЕ
	               |	ОстаткиТоваровКомпанииОстатки.СкладКомпании.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.Экспедитор)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата УБЫВ
	               |ИТОГИ ПО
	               |	СкладКомпании,
	               |	Номенклатура";         
	
	ОбходПоСкладКомпании = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"СкладКомпании");
	
	Пока ОбходПоСкладКомпании.Следующий() Цикл	
		ОбходПоНоменклатуре = ОбходПоСкладКомпании.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Номенклатура");	
		Пока ОбходПоНоменклатуре.Следующий() Цикл
			ОбходПоДокументам = ОбходПоНоменклатуре.Выбрать();
			СуммаБазовогоКоличество = 0;
			ВывестиОдинРаз = Истина;
			Пока ОбходПоДокументам.Следующий() Цикл 	
				Остаток = ОбходПоДокументам.КоличествоОстаток;
				НоваяСтрокаТаблицы = ТаблицаЗначений.Добавить();
				НоваяСтрокаТаблицы.СкладКомпании            = ОбходПоДокументам.СкладКомпании;
				НоваяСтрокаТаблицы.Номенклатура             = ОбходПоДокументам.Номенклатура;
				НоваяСтрокаТаблицы.Документ                 = ОбходПоДокументам.Ссылка;
				НоваяСтрокаТаблицы.ОстатокНаТекущийДокумент = ?(ВывестиОдинРаз,Остаток,Остаток-СуммаБазовогоКоличество);
				НоваяСтрокаТаблицы.КоличествоБазовое        = ОбходПоДокументам.КоличествоБазовое;
				НоваяСтрокаТаблицы.СуммаРасход              = ОбходПоДокументам.СуммаРасход;
				СуммаБазовогоКоличество = СуммаБазовогоКоличество + ОбходПоДокументам.КоличествоБазовое;
				НоваяСтрокаТаблицы.ИтоговыйОстаток          = Остаток - СуммаБазовогоКоличество;
				
				ВывестиОдинРаз = Ложь;	
				Если (Остаток - СуммаБазовогоКоличество) <= 0 Тогда 
					Прервать;
				КонецЕсли;				
			КонецЦикла;
		КонецЦикла; 
	КонецЦикла;
	
	Возврат ТаблицаЗначений;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
    ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(ЭтотОбъект.СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ВнешниеНаборыДанных = Новый Структура;
    ВнешниеНаборыДанных.Вставить("Таблица",ФормированиеОтчет());
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных,ДанныеРасшифровки,Истина); 
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		
КонецПроцедуры
