
Функция ПолучитьПрокси() Экспорт
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	
	// Сериализация полученной таблицы и передача ее в web-сервис
	Адрес = Настройки.АдресWsGate+"ws/GetDealerNews.1cws?wsdl";
	ПарольWS = Настройки.ПарольДоступаКВебСервисам;
	ЛогинWS = Настройки.ЛогинДоступаКВебСервисам;
	ОпределениеСервиса = Новый WSОпределения(Адрес, ЛогинWS, ПарольWS);
	ВебСервис = Новый WSПрокси(
		ОпределениеСервиса, 
		"http://renault-nissan.com/schema/GetDealerNews", 
		"Renault_GetDealerNews",
		"Renault_GetDealerNewsSoap12",
		3600);
	ВебСервис.Пользователь	 = ЛогинWS;
	ВебСервис.Пароль		 = ПарольWS;
	
	Возврат ВебСервис;
	                         
КонецФункции

// +++ Кудинов И.  02.08.2016

Процедура ПолучитьДанныеМаркетинговыхАкцийСервиса(ПараметрыВызоваСервера, АдресХранилища) Экспорт 
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	ПарольWS = Настройки.ПарольДоступаКВебСервисам;
	ЛогинWS = Настройки.ЛогинДоступаКВебСервисам;
	Адрес = Настройки.АдресWsGate;
	ОпределениеСервиса = Новый WSОпределения(СокрЛП(Адрес) + "ws/ServicesActionTab.ws?wsdl", ЛогинWS, ПарольWS);
	ВебСервис = Новый WSПрокси(
	ОпределениеСервиса, 
	"http://renault-nissan.com/schema/ServicesActionTab", 
	"Renault_ServicesActionTab",
	"Renault_ServicesActionTabSoap12",
	3600);
	ВебСервис.Пользователь  = ЛогинWS;
	ВебСервис.Пароль   = ПарольWS;
	
	ДЗ_XDTO = ВебСервис.GetData("Logan");
	ДЗ = СериализаторXDTO.ПрочитатьXDTO(ДЗ_XDTO);
	ПоместитьВоВременноеХранилище(ДЗ, АдресХранилища);
	
КонецПроцедуры

// --- Кудинов И.  02.08.2016