
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = Ложь;
	
	ВыполнитьОбменНаСервере(ПараметрКоманды,Отказ);	
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбменНаСервере(УзелОбмена,Отказ)
	
	ДлительнаяОперация = Ложь;
	ДлительнаяОперацияЗавершена = Ложь;
	ИдентификаторФайлаСообщенияВСервисе = "";
	ИдентификаторДлительнойОперации = "";
		
	ПараметрыАутентификации = Неопределено;
	
	ВидТранспорта = РегистрыСведений.DMS_НастройкиТранспортаОбмена.ВидТранспортаСообщенийОбменаПоУмолчанию(УзелОбмена);
	
	DMS_ОбменДаннымиСДМСервер.ВыполнитьОбменДаннымиДляУзлаИнформационнойБазы(Отказ,УзелОбмена,Истина,Ложь,ВидТранспорта,ДлительнаяОперация,ИдентификаторДлительнойОперации,ИдентификаторФайлаСообщенияВСервисе,ДлительнаяОперацияЗавершена,ПараметрыАутентификации);	
	
	DMS_ОбменДаннымиСДМСервер.ВыполнитьОбменДаннымиДляУзлаИнформационнойБазы(Отказ,УзелОбмена,Ложь,Истина,ВидТранспорта,ДлительнаяОперация,ИдентификаторДлительнойОперации,ИдентификаторФайлаСообщенияВСервисе,ДлительнаяОперацияЗавершена,ПараметрыАутентификации);	

КонецПроцедуры // ВыполнитьОбменНаСервере()
 
