//ТипСоздаваемыхОбъектов = Конвертация или ОбъектыМД

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	ИерархическийСписок="Иерархия";
	ТипСоздаваемыхОбъектов=Параметры.ТипСоздаваемыхОбъектов; 
	Если ТипСоздаваемыхОбъектов="Конвертация" Тогда
		//ИерархическийСписок="Список";
		//Элементы.ИерархическийСписок.Видимость=Ложь;
		Заголовок="Выбор метаданных для загрузки";
		
		//собственную базу данных выбирать нельзя - т.к. мы выбираем источник
		Запрос=Новый Запрос("Выбрать Ссылка ИЗ ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.БазыДанных ГДЕ Ссылка<>&ТекБаза"); 
		Запрос.УстановитьПараметр("ТекБаза",Renault_ПередачаДанныхВСторонниеСистемы.ТекущаяБазаДанных());
		Элементы.БазаДанных.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		Элементы.БазаДанных.РежимВыбораИзСписка=Истина;
		
		Если Элементы.БазаДанных.СписокВыбора.Количество()=1 Тогда БазаДанных=Элементы.БазаДанных.СписокВыбора[0].Значение КонецЕсли;
		
	Иначе
		Элементы.БазаДанных.Видимость=Ложь;
		//ИерархическийСписок="Иерархия";
		Заголовок="Выбор метаданных для выгрузки";
	КонецЕсли;	
	ПостроитьДерево();
КонецПроцедуры
Процедура ПостроитьДерево()
	ДеревоМетаданных.ПолучитьЭлементы().Очистить();
	
	Для Каждого Эл Из Renault_ПередачаДанныхВСторонниеСистемы.СоставМетаданных() Цикл
		ЭлКорень=ДеревоМетаданных.ПолучитьЭлементы().Добавить();
		ЭлКорень.Имя=Эл.Ключ;
		ЭлКорень.Картинка=Renault_ПередачаДанныхВСторонниеСистемы.ИндексКартинкиМД(Эл.Ключ);
		
		Для Каждого МД из Метаданные[Эл.Значение] Цикл
			//не все регистры одинаково хороши. Подчиненные регистратору не выгружаем
			Если Найти(МД.Имя,"РегистрСведений.")>0 И МД.РежимЗаписи=Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору Тогда Продолжить КонецЕсли;
			
			ЭлОбъект=ЭлКорень.ПолучитьЭлементы().Добавить();
			ЭлОбъект.Имя=МД.Имя;
			ЭлОбъект.Вкл=ПроверкаСуществованияОбъекта(ПолучитьИмяМД(ЭлОбъект.ПолучитьИдентификатор()));
			ЭлОбъект.Картинка=Renault_ПередачаДанныхВСторонниеСистемы.ИндексКартинкиМД("Элемент");
			
			//табличные части
			Если Найти(Эл.Значение,"Регистр")>0 Тогда Продолжить КонецЕсли;
			Для Каждого ТЧ Из Метаданные[Эл.Значение][МД.Имя].ТабличныеЧасти Цикл
				ЭлТЧ=ЭлОбъект.ПолучитьЭлементы().Добавить();
				ЭлТЧ.Имя=ТЧ.Имя;
				ЭлТЧ.Вкл=ВнешниеИсточникиДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблицы.ОбъектыМД.МДСуществует(ПолучитьИмяМД(ЭлТЧ.ПолучитьИдентификатор()));
				ЭлТЧ.Картинка=Renault_ПередачаДанныхВСторонниеСистемы.ИндексКартинкиМД("ТабличнаяЧасть");
			КонецЦикла;	
		КонецЦикла;	
	КонецЦикла;	
		
КонецПроцедуры	

Функция ПроверкаСуществованияОбъекта(ИмяМД)
	Если ТипСоздаваемыхОбъектов="ОбъектыМД" Тогда Возврат ВнешниеИсточникиДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблицы.ОбъектыМД.МДСуществует(ИмяМД)
	ИначеЕсли ТипСоздаваемыхОбъектов="Конвертация" Тогда Возврат Справочники.Renault_КонвертацияДанных.МДСуществует(ИмяМД) КонецЕсли
КонецФункции	

&НаКлиенте
Процедура ДеревоМетаданныхВклПриИзменении(Элемент) ОтметитьЭлементы(Элементы.ДеревоМетаданных.ТекущиеДанные.ПолучитьИдентификатор())
КонецПроцедуры
Процедура ОтметитьЭлементы(Строка)
	ТекДанные=ДеревоМетаданных.НайтиПоИдентификатору(Строка);
	Родитель=ДеревоМетаданных.НайтиПоИдентификатору(Строка).ПолучитьРодителя();
	Если Родитель=Неопределено Тогда 
		//Элементы.ДеревоМетаданных.ТекущиеДанные.Вкл=Ложь
		Для Каждого Эл Из ТекДанные.ПолучитьЭлементы() Цикл 
			Если ВключатьТЧ Тогда Для Каждого ПодчЭл Из Эл.ПолучитьЭлементы() Цикл ПодчЭл.Вкл=ТекДанные.Вкл КонецЦикла КонецЕсли; //табличные части
			Эл.Вкл=ТекДанные.Вкл;
			ОтметитьЭлементы(Эл.ПолучитьИдентификатор());
		КонецЦикла;	
	Иначе
		ИмяМД=ПолучитьИмяМД(Строка);
		УстановитьПодчиненныеМД(ИмяМД,ТекДанные.Вкл,Новый Массив);
		Если ВключатьТЧ Тогда Для Каждого ПодчЭл Из ТекДанные.ПолучитьЭлементы() Цикл ПодчЭл.Вкл=ТекДанные.Вкл КонецЦикла КонецЕсли; //табличные части
	КонецЕсли;
КонецПроцедуры	
Процедура УстановитьПодчиненныеМД(ИмяМД,Вкл,МассивОбработанных)
	СтруктураМетаданных=Renault_ПередачаДанныхВСторонниеСистемы.СтруктураРеквизитовОбъектаМД(ИмяМД);
	Для Каждого Эл Из СтруктураМетаданных Цикл
		МассивТипов=Эл.Значение.Типы();
		//удалить тип NULL из списка типов для корректного определения составных типов
		Индекс=МассивТипов.Найти(Тип("Null")); Если Индекс<>Неопределено Тогда МассивТипов.Удалить(Индекс) КонецЕсли;	
		
		Для Каждого Тип Из МассивТипов Цикл
			ВложенныйИмяМД=Renault_ПередачаДанныхВСторонниеСистемы.ТипЗначенияВМетаданныеСтрокой(Тип);
			Если ВложенныйИмяМД=Неопределено Тогда Продолжить //примитивные типы не проверяем
			ИначеЕсли ВложенныйИмяМД=ИмяМД Тогда Продолжить //ссылку на себя проверять не надо 
			ИначеЕсли МассивОбработанных.Найти(ВложенныйИмяМД)<>Неопределено Тогда Продолжить КонецЕсли; //предотвращение зацикливания
			
			Строка=НайтиСтрокуПоЗначению(ДеревоМетаданных.ПолучитьЭлементы(),ВложенныйИмяМД); Если Строка=Неопределено Тогда Продолжить КонецЕсли;
			Строка.Вкл=Вкл;
			
			Если ВключатьТЧ Тогда Для Каждого ПодчЭл Из Строка.ПолучитьЭлементы() Цикл ПодчЭл.Вкл=Вкл КонецЦикла КонецЕсли;	//табличные части
			
			МассивОбработанных.Добавить(ВложенныйИмяМД);
			УстановитьПодчиненныеМД(ПолучитьИмяМД(Строка.ПолучитьИдентификатор()),Вкл,МассивОбработанных); //рекурсия на вложения
		КонецЦикла;
		
	КонецЦикла;	
КонецПроцедуры	

Функция НайтиСтрокуПоЗначению(ЭлементыДерева,ИмяМД) //рекурсивный поиск по строкам дерева
	Для Каждого Эл Из ЭлементыДерева Цикл
		Если ПолучитьИмяМД(Эл.ПолучитьИдентификатор())=ИмяМД Тогда 
			Возврат ДеревоМетаданных.НайтиПоИдентификатору(Эл.ПолучитьИдентификатор())
		Иначе 
			Значение=НайтиСтрокуПоЗначению(Эл.ПолучитьЭлементы(),ИмяМД);
			Если Значение<>Неопределено Тогда Возврат Значение КонецЕсли; //если значение найдено - вернем его, иначе продолжим поиск по другим веткам
		КонецЕсли
	КонецЦикла
КонецФункции	

Функция ПолучитьИмяМД(ИдСтроки)
	Родитель=ДеревоМетаданных.НайтиПоИдентификатору(ИдСтроки).ПолучитьРодителя();
	Если Родитель=Неопределено Тогда Возврат ДеревоМетаданных.НайтиПоИдентификатору(ИдСтроки).Имя
	Иначе
		Возврат ПолучитьИмяМД(Родитель.ПолучитьИдентификатор())+"."+ДеревоМетаданных.НайтиПоИдентификатору(ИдСтроки).Имя
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура кнЗаписать(Команда) 
	Если ТипСоздаваемыхОбъектов="Конвертация" И БазаДанных.Пустая() Тогда 
		Сообщить("НЕ выбрана база данных",СтатусСообщения.Информация)
	Иначе
		ЗаписатьМД(Команда.Имя)	
	КонецЕсли;
КонецПроцедуры
Процедура ЗаписатьМД(ИмяКоманды)
	Для Каждого Стр Из ДеревоМетаданных.ПолучитьЭлементы() Цикл
		Для Каждого Эл Из Стр.ПолучитьЭлементы() Цикл
			Если Не Эл.Вкл Тогда Продолжить КонецЕсли;
			ИмяМД=ПолучитьИмяМД(Эл.ПолучитьИдентификатор());
			
			Если ТипСоздаваемыхОбъектов="ОбъектыМД" Тогда
				ИмяРаздела=Renault_ПередачаДанныхВСторонниеСистемы.СтруктураМетаданных(ИмяМД).ТипМД;
				//ИмяРаздела=Лев(ИмяМД,Макс(Найти(ИмяМД,".")-1,0));
				Раздел=?(ИерархическийСписок="Иерархия",ВнешниеИсточникиДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблицы.ОбъектыМД.СоздатьРаздел(ИмяРаздела),Неопределено);
			Иначе
				Раздел=Неопределено
			КонецЕсли;	
			Родитель=СозданиеОбъекта(ИмяМД,ИмяКоманды,Раздел);
			
			Для Каждого ЭлТЧ Из Эл.ПолучитьЭлементы() Цикл
				Если Не ЭлТЧ.Вкл Тогда Продолжить КонецЕсли;
				ИмяМД=ПолучитьИмяМД(ЭлТЧ.ПолучитьИдентификатор());
				СозданиеОбъекта(ИмяМД,ИмяКоманды,?(ИерархическийСписок="Иерархия",Родитель,Неопределено));
			КонецЦикла;	
		КонецЦикла;	
	КонецЦикла;
	Сообщить("Метаданные сформированы",СтатусСообщения.Информация);
КонецПроцедуры	

Функция СозданиеОбъекта(ИмяМД,ИмяКоманды,Родитель)
	Если ТипСоздаваемыхОбъектов="ОбъектыМД" Тогда
		Возврат ВнешниеИсточникиДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблицы.ОбъектыМД.СоздатьМД(ИмяМД,ИмяКоманды,Родитель)
	ИначеЕсли ТипСоздаваемыхОбъектов="Конвертация" Тогда
		Возврат Справочники.Renault_КонвертацияДанных.СоздатьМД(ИмяМД,БазаДанных,Родитель=Неопределено)
	КонецЕсли	
КонецФункции	

&НаКлиенте
Процедура кнОбновить(Команда) 
	ПостроитьДерево();
	Для Каждого Эл Из ДеревоМетаданных.ПолучитьЭлементы() Цикл
		Элементы.ДеревоМетаданных.Развернуть(Эл.ПолучитьИдентификатор());
	КонецЦикла;	
КонецПроцедуры

//+включить табличные части
//&НаКлиенте
//Процедура ВключатьТЧПриИзменении(Элемент) ВклТЧ(ДеревоМетаданных.ПолучитьЭлементы()) КонецПроцедуры
//&НаКлиенте
//Функция ВклТЧ(Элементы)
//	Для Каждого Эл Из Элементы Цикл
//		Если СтрЧислоВхождений(ПолучитьИмяМД(Эл.ПолучитьИдентификатор()),".")>1 Тогда Эл.Вкл=ВключатьТЧ КонецЕсли;
//		ВклТЧ(Эл.ПолучитьЭлементы());
//	КонецЦикла;	
//КонецФункции	
//-включить табличные части
