// получить удаляемые кнопки
Функция УдаляемыеКнопкиЗаполнения() Экспорт
	
	УдаляемыеКнопки = Новый Массив();
	УдаляемыеКнопки.Добавить("ЗаполнитьИзКорзины");
	УдаляемыеКнопки.Добавить("ВыгрузитьВКорзину");
	УдаляемыеКнопки.Добавить("ЗаполнитьИзТСД");
	УдаляемыеКнопки.Добавить("ЗаполнитьИзФайла");
	
	Возврат УдаляемыеКнопки;
	
КонецФункции

#Область ИнформацияОДокументе

//************************//
// ИНФОРМАЦИЯ О ДОКУМЕНТЕ //
//************************//


// Возвращает доступные варианты печати документа
// Параметры:
//	ДокументСсылка - Ссылка на документ печати
// Возвращаемое значение:
//	Структура, каждая строка которой соответствует одному из вариантов печати. Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм(ДокументСсылка) Экспорт
	
	СтруктураМакетов = Новый Структура();
	
	СтруктураМакетов.Вставить("ПоступлениеТоваров", "Приходная накладная");
	
	СтруктураМакетов.Вставить("УКД", "Универсальный корректировочный документ");
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСписокПечатныхФорм()


#КонецОбласти