&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Renault_БСО_УчетБСО.ЗаполнитьЗначениямиПоУмолчанию(Объект);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Автор) Тогда
		Элементы.Автор.ТолькоПросмотр = Истина;
	КонецЕсли;	
КонецПроцедуры

//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	РасчитатьКоличествоБСО();
//КонецПроцедуры 

&НаКлиенте
Процедура БланкСтрогойОтчетностиПриИзменении(Элемент)
	Серия = Объект.Серия;
	
	Если ЗначениеЗаполнено(Серия) Тогда	
		ВладелецСерии = Renault_БСО_УчетБСО.ЗначениеРеквизитаСущности(Серия, "Владелец");
		
		Если Объект.БланкСтрогойОтчетности <> ВладелецСерии Тогда
			Объект.Серия = ПредопределенноеЗначение("Справочник.Renault_БСО_СерииБланковСтрогойОтчетности.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Подразделение = Объект.Подразделение;
	
	Если ЗначениеЗаполнено(Подразделение) Тогда	
		ОрганизацияПодразделения = Renault_БСО_УчетБСО.ЗначениеРеквизитаСущности(Подразделение, "Организация");
		
		Если Объект.Организация <> ОрганизацияПодразделения Тогда
			Объект.Подразделение = ПредопределенноеЗначение("Справочник.ПодразделенияКомпании.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Организация = Объект.Организация;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		СтандартнаяОбработка = Ложь;
			
		ФормаВыбора = Справочники.ПодразделенияКомпании.ПолучитьФормуВыбора(, Элемент);
		ФормаВыбора.Отбор.Организация.ВидСравнения = ВидСравнения.Равно;
		ФормаВыбора.Отбор.Организация.Значение = Организация;
		ФормаВыбора.Отбор.Организация.Использование = Истина;
		ФормаВыбора.ЭлементыФормы.Список.НастройкаОтбора.Организация.Доступность = Ложь;
		ФормаВыбора.Открыть();
	КонецЕсли;
КонецПроцедуры

//&НаКлиенте
//Процедура СерияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	БСО = Объект.БланкСтрогойОтчетности;
//	
//	Если ЗначениеЗаполнено(БСО) Тогда
//		СтандартнаяОбработка = Ложь;
//			
//		ФормаВыбора = Справочники.Renault_БСО_СерииБланковСтрогойОтчетности.ПолучитьФормуВыбора(, Элемент);
//		ФормаВыбора.Отбор.Владелец.ВидСравнения = ВидСравнения.Равно;
//		ФормаВыбора.Отбор.Владелец.Значение = БСО;
//		ФормаВыбора.Отбор.Владелец.Использование = Истина;
//		ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.Владелец.Доступность = Ложь;
//		ФормаВыбора.Открыть();
//	КонецЕсли;
//КонецПроцедуры 

&НаКлиенте
Процедура СписокБСОПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Строка = Элементы.СписокБСО.ТекущиеДанные;
		//Строка.ДатаПоступления = Объект.Дата;
		//Строка.Количество = 1;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокБСОНомерБСОПриИзменении(Элемент)
	Строка = Элементы.СписокБСО.ТекущиеДанные;
	Строка.НомерБСО = Renault_БСО_УчетБСО.ПреобразоватьВНомерБСО(Строка.НомерБСО); 
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	НомерНачало = Объект.НомерБСОНачальный;
	НомерКонец = Объект.НомерБСОКонечный;
	
	Выход = Ложь;
	
	Если НЕ ЗначениеЗаполнено(НомерНачало) Тогда
		Сообщить("Не указан начальный номер!");
		Выход = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НомерКонец) Тогда
		Сообщить("Не указан конечный номер!");
		Выход = Истина;
	КонецЕсли;   
	
	Если НомерНачало > НомерКонец Тогда
		Сообщить("Начальный нормер больше конечного номера!");
		Выход = Истина;
	КонецЕсли;
	
	Если Выход Тогда
		Возврат;
	КонецЕсли;
	
	ТабСписокБСО = Объект.СписокБСО;
	
	Если ТабСписокБСО.Количество() > 0 Тогда
		ВопросПользователю = Вопрос("Перед заполнением старые данные табличного поля будут удалены, продолжить?", РежимДиалогаВопрос.ДаНет);
		
		Если ВопросПользователю = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	//ДатаПоступления = Объект.Дата;	
	
	ТабСписокБСО.Очистить();
	
	Для Счетчик = НомерНачало По НомерКонец Цикл
		Строка = ТабСписокБСО.Добавить();
		Строка.НомерБСО = Renault_БСО_УчетБСО.ПреобразоватьВНомерБСО(Счетчик);
		//Строка.ДатаПоступления = ДатаПоступления;
		//Строка.Количество = 1;
	КонецЦикла;
	
	//РасчитатьКоличествоБСО();
	
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияУчетБСО(Команда)
	Renault_БСО_УчетБСО.ПоказатьДвиженияДокумента(Объект.Ссылка, "РегистрНакопления", "Renault_БСО_УчетБланковСтрогойОтчетности");
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияСтатусыБСО(Команда)
	Renault_БСО_УчетБСО.ПоказатьДвиженияДокумента(Объект.Ссылка, "РегистрСведений", "Renault_БСО_СтатусыБСО");
КонецПроцедуры

//&НаКлиенте
//Процедура СписокБСОПриИзменении(Элемент)
//	РасчитатьКоличествоБСО();
//КонецПроцедуры

//&НаКлиенте
//Процедура РасчитатьКоличествоБСО() КоличествоБСО = Строка(Объект.СписокБСО.Итог("Количество")) + " шт." КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Оповестить("ОбновитьДанныеАРМ_Учет_БСО");
КонецПроцедуры

