
Процедура ПересчитатьСкидку(ДанныеПересчета, ЧтоИзменилось) Экспорт
	
	МашинаНайдена = Ложь;
	Если ТипЗнч(ДанныеПересчета.Заявка) = Тип("ДокументСсылка.ЗаявкаНаКорпоративнуюСкидку") Тогда
		ЗаявкаОбъект = ДанныеПересчета.Заявка.ПолучитьОбъект();
	ИначеЕсли ТипЗнч(ДанныеПересчета.Заявка) = Тип("ДокументОбъект.ЗаявкаНаКорпоративнуюСкидку") Тогда
		ЗаявкаОбъект = ДанныеПересчета.Заявка;
	Иначе
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаЗаявки Из ЗаявкаОбъект.ТаблицаВИН Цикл
		Если СтрокаЗаявки.Автомобиль = ДанныеПересчета.Автомобиль Тогда
			МашинаНайдена = Истина;
			Прервать;	
		КонецЕсли;
	КонецЦикла;
	Если Не МашинаНайдена Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьСкидкуВСтрокеТЗ (ДанныеПересчета, СтрокаЗаявки, ЧтоИзменилось);
	
	ЗаявкаОбъект.Записать();
	
КонецПроцедуры

Процедура ПересчитатьСкидкуВСтрокеТЗ (ДанныеПересчета, СтрокаЗаявки, ЧтоИзменилось) Экспорт
	
	Если ЧтоИзменилось = "СуммаСкидки" Тогда
		МаржаДилерПроцент = 100 - СтрокаЗаявки.МаржаПроцентRenault;
		СтрокаЗаявки.СуммаСкидки = ДанныеПересчета.СуммаСкидки;
		СтрокаЗаявки.МаржаПроцент = Строка(СтрокаЗаявки.МаржаПроцентRenault) + "/" + Строка(МаржаДилерПроцент);
		СтрокаЗаявки.УчастиеДилера = Окр(СтрокаЗаявки.СуммаСкидки * МаржаДилерПроцент/100,0, РежимОкругления.Окр15как20);
		СтрокаЗаявки.МаржаСумма = СтрокаЗаявки.ЦенаPVC - СтрокаЗаявки.ЦенаPVR - СтрокаЗаявки.УчастиеДилера;
		СтрокаЗаявки.УчастиеRenault = СтрокаЗаявки.СуммаСкидки - СтрокаЗаявки.УчастиеДилера;
		СтрокаЗаявки.ЦенаФактура = СтрокаЗаявки.ЦенаPVR - СтрокаЗаявки.УчастиеRenault;
		СтрокаЗаявки.ЦенаFlotte = СтрокаЗаявки.ЦенаPVC - СтрокаЗаявки.СуммаСкидки;
		СтрокаЗаявки.ПроцентСкидки = 100 * (СтрокаЗаявки.СуммаСкидки/СтрокаЗаявки.ЦенаPVC);
		СтрокаЗаявки.МаржаДилераПроцент = 100 * (СтрокаЗаявки.ЦенаFlotte - СтрокаЗаявки.ЦенаФактура) / СтрокаЗаявки.ЦенаPVC;
	КонецЕсли;
	
	Если ЧтоИзменилось = "ПроцентСкидки" Тогда
		СтрокаЗаявки.ПроцентСкидки = ДанныеПересчета.ПроцентСкидки;
		НоваяКлиентскаяЦена = СтрокаЗаявки.ЦенаPVC * (100 - СтрокаЗаявки.ПроцентСкидки)/100;
		СтрокаЗаявки.СуммаСкидки = СтрокаЗаявки.ЦенаPVC - НоваяКлиентскаяЦена;
		МаржаДилерПроцент = 100 - СтрокаЗаявки.МаржаПроцентRenault;
		СтрокаЗаявки.МаржаПроцент = Строка(СтрокаЗаявки.МаржаПроцентRenault) + "/" + Строка(МаржаДилерПроцент);
		СтрокаЗаявки.УчастиеДилера = Окр(СтрокаЗаявки.СуммаСкидки * МаржаДилерПроцент/100,0, РежимОкругления.Окр15как20);
		СтрокаЗаявки.МаржаСумма = СтрокаЗаявки.ЦенаPVC - СтрокаЗаявки.ЦенаPVR - СтрокаЗаявки.УчастиеДилера;
		СтрокаЗаявки.УчастиеRenault = СтрокаЗаявки.СуммаСкидки - СтрокаЗаявки.УчастиеДилера;
		СтрокаЗаявки.ЦенаФактура = СтрокаЗаявки.ЦенаPVR - СтрокаЗаявки.УчастиеRenault;
		СтрокаЗаявки.ЦенаFlotte = СтрокаЗаявки.ЦенаPVC - СтрокаЗаявки.СуммаСкидки;
		Если СтрокаЗаявки.ЦенаPVC > 0 Тогда
			СтрокаЗаявки.МаржаДилераПроцент = 100 * (СтрокаЗаявки.ЦенаFlotte - СтрокаЗаявки.ЦенаФактура) / СтрокаЗаявки.ЦенаPVC;
		КонецЕсли;
	КонецЕсли;
	
	Если ЧтоИзменилось = "УчастиеRenault" Тогда
		СтрокаЗаявки.МаржаПроцентRenault = 0;
		СтрокаЗаявки.УчастиеRenault = ДанныеПересчета.УчастиеRenault;
		СтрокаЗаявки.УчастиеДилера = СтрокаЗаявки.СуммаСкидки - СтрокаЗаявки.УчастиеRenault;
		СтрокаЗаявки.ЦенаФактура = СтрокаЗаявки.ЦенаPVR - СтрокаЗаявки.УчастиеRenault;
		СтрокаЗаявки.МаржаДилераПроцент = 100 * (СтрокаЗаявки.ЦенаFlotte - СтрокаЗаявки.ЦенаФактура) / СтрокаЗаявки.ЦенаPVC;
	КонецЕсли;
	
	Если ЧтоИзменилось = "МаржаПроцентRenault" Тогда
		СтрокаЗаявки.МаржаПроцентRenault = ДанныеПересчета.МаржаПроцент;
		МаржаДилерПроцент = 100 - СтрокаЗаявки.МаржаПроцентRenault;
		СтрокаЗаявки.МаржаПроцент = Строка(СтрокаЗаявки.МаржаПроцентRenault) + "/" + Строка(МаржаДилерПроцент);
		СтрокаЗаявки.УчастиеДилера = Окр(СтрокаЗаявки.СуммаСкидки * МаржаДилерПроцент / 100,0, РежимОкругления.Окр15как20);
		СтрокаЗаявки.МаржаСумма = СтрокаЗаявки.ЦенаPVC - СтрокаЗаявки.ЦенаPVR - СтрокаЗаявки.УчастиеДилера;
		СтрокаЗаявки.УчастиеRenault = СтрокаЗаявки.СуммаСкидки - СтрокаЗаявки.УчастиеДилера;
		СтрокаЗаявки.ЦенаФактура = СтрокаЗаявки.ЦенаPVR - СтрокаЗаявки.УчастиеRenault;
		СтрокаЗаявки.ЦенаFlotte = СтрокаЗаявки.ЦенаPVC - СтрокаЗаявки.СуммаСкидки;
		СтрокаЗаявки.МаржаДилераПроцент = 100 * (СтрокаЗаявки.ЦенаFlotte - СтрокаЗаявки.ЦенаФактура) / СтрокаЗаявки.ЦенаPVC;
	КонецЕсли;
	
	Если ЧтоИзменилось = "ЦенаFlotte" Тогда
		МаржаДилерПроцент = 100 - СтрокаЗаявки.МаржаПроцентRenault;
		СтрокаЗаявки.ЦенаFlotte = ДанныеПересчета.ЦенаFlotte;
		СтрокаЗаявки.СуммаСкидки = СтрокаЗаявки.ЦенаPVC - ДанныеПересчета.ЦенаFlotte;
		СтрокаЗаявки.ПроцентСкидки = 100 * (СтрокаЗаявки.СуммаСкидки/СтрокаЗаявки.ЦенаPVC);
		СтрокаЗаявки.МаржаПроцент = Строка(СтрокаЗаявки.МаржаПроцентRenault) + "/" + Строка(МаржаДилерПроцент);
		СтрокаЗаявки.УчастиеДилера = Окр(СтрокаЗаявки.СуммаСкидки * МаржаДилерПроцент/100,0, РежимОкругления.Окр15как20);
		СтрокаЗаявки.МаржаСумма = СтрокаЗаявки.ЦенаPVC - СтрокаЗаявки.ЦенаPVR - СтрокаЗаявки.УчастиеДилера;
		СтрокаЗаявки.УчастиеRenault = СтрокаЗаявки.СуммаСкидки - СтрокаЗаявки.УчастиеДилера;
		СтрокаЗаявки.ЦенаФактура = СтрокаЗаявки.ЦенаPVR - СтрокаЗаявки.УчастиеRenault;
		СтрокаЗаявки.ПроцентСкидки = 100 * (СтрокаЗаявки.СуммаСкидки/СтрокаЗаявки.ЦенаPVC);
		СтрокаЗаявки.МаржаДилераПроцент = 100 * (СтрокаЗаявки.ЦенаFlotte - СтрокаЗаявки.ЦенаФактура) / СтрокаЗаявки.ЦенаPVC;
	КонецЕсли;
	
	Если ЧтоИзменилось = "ЦенаФактура" Тогда
		
		МаржаДилерПроцент = 100 - СтрокаЗаявки.МаржаПроцентRenault;
		ДанныеПересчета.УчастиеRenault = (СтрокаЗаявки.ЦенаPVR - ДанныеПересчета.ЦенаФактура) * (1 - МаржаДилерПроцент/100);
		ПересчитатьСкидкуВСтрокеТЗ (ДанныеПересчета, СтрокаЗаявки, "УчастиеRenault");
		
	КонецЕсли;
	
КонецПроцедуры
