Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	//// регистр Renault_ЗаявкиНаКорпоративнуюСкидку
	//Движения.Renault_ЗаявкиНаКорпоративнуюСкидку.Записывать = Истина;
	//Движения.Renault_ЗаявкиНаКорпоративнуюСкидку.Очистить();
	//Для Каждого ТекСтрокаТаблицаВИН Из ТаблицаВИН Цикл
	//	Движение = Движения.Renault_ЗаявкиНаКорпоративнуюСкидку.Добавить();
	//	Движение.Период = Дата;
	//	Движение.Клиент = Клиент;
	//	Движение.ТипЗаявки = ТипЗаявки;
	//	Движение.Статус = Статус;
	//	ЗаполнитьЗначенияСвойств(Движение,ТекСтрокаТаблицаВИН);
	//	//Движение.ВИН = ТекСтрокаТаблицаВИН.ВИН;
	//	//Движение.Автомобиль = ТекСтрокаТаблицаВИН.Автомобиль;
	//	//Движение.ПроцентСкидки = ТекСтрокаТаблицаВИН.ПроцентСкидки;
	//	//Движение.ЦенаPVC = ТекСтрокаТаблицаВИН.ЦенаPVC;
	//	//Движение.ЦенаFlotte = ТекСтрокаТаблицаВИН.ЦенаFlotte;
	//	//Движение.СуммаСкидки = ТекСтрокаТаблицаВИН.СуммаСкидки;
	//	//Движение.МаржаПроцент = ТекСтрокаТаблицаВИН.МаржаПроцент;
	//	//Движение.МаржаСумма = ТекСтрокаТаблицаВИН.МаржаСумма;
	//	//Движение.УчастиеДилера = ТекСтрокаТаблицаВИН.УчастиеДилера;
	//	//Движение.МаржаПроцентRenault = ТекСтрокаТаблицаВИН.МаржаПроцентRenault;
	//	//Движение.УчастиеRenault = ТекСтрокаТаблицаВИН.УчастиеRenault;
	//	//Движение.ЦенаФактура = ТекСтрокаТаблицаВИН.ЦенаФактура;
	//	//Движение.ЦенаPVR = ТекСтрокаТаблицаВИН.ЦенаPVR;
	//	//Движение.ПроцентДилера = ТекСтрокаТаблицаВИН.ПроцентДилера;
	//	//Движение.ПроцентРено = ТекСтрокаТаблицаВИН.ПроцентРено;
	//	//Движение.МаржаДилераПроцент = ТекСтрокаТаблицаВИН.МаржаДилераПроцент;
	//	//Движение.Автор = Автор;
	//	//Движение.Кузовостроитель = Кузовостроитель;
	//	//Движение.ЛизинговаяКомпания = ЛизинговаяКомпания;
	//	//Движение.Адрес = Адрес;
	//	//Движение.ДатаОтправки = ДатаОтправки;
	//	//Движение.ТипОтгрузки = ТипОтгрузки;
	//КонецЦикла;
	
КонецПроцедуры
