//@++ Васильев ВА
//&НаСервере
//Функция СформироватьОтчетНаСервере(Ссылка) Экспорт
//	
//	СхемаКомпоновкиДанных = ПолучитьМакет("СхемаКомпоновкиДляДокумента");
//	
//    КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
//    КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
//    Настройки = КомпоновщикНастроек.Настройки;
//    
//    Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Заявка", Ссылка);
//    
//    ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
//    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
//    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);

//    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
//    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);

//    Результат = Новый ТабличныйДокумент();
//    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
//    ПроцессорВывода.УстановитьДокумент(Результат);

//    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
//    
//    Возврат Результат;
//	
//КонецФункции
