
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ИсключитьIP") Тогда
		ИсключитьIP = Параметры.ИсключитьIP;
	Иначе 
		ИсключитьIP = Ложь;
	КонецЕсли; 
	
	Список.Параметры.УстановитьЗначениеПараметра("ИсключитьIP",ИсключитьIP);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОповеститьОВыборе(ВыбраннаяСтрока);	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если Не ЗначениеЗаполнено(ТекущаяСтрока) Тогда
		Возврат;
	КонецЕсли; 
	
	ОповеститьОВыборе(ТекущаяСтрока);
	
КонецПроцедуры
