
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Автомобиль") Тогда
		Запись.Автомобиль = Параметры.Автомобиль;
	КонецЕсли;
	
	Элементы.Фотография.Видимость = ЗначениеЗаполнено(Запись.Фотография); 
	Элементы.ФотографияПуть.Видимость = Не Элементы.Фотография.Видимость;
	
	Элементы.Фотография.Доступность = ЗначениеЗаполнено(Запись.Ракурс);
	Элементы.ФотографияПуть.Доступность = ЗначениеЗаполнено(Запись.Ракурс);
	
КонецПроцедуры

&НаКлиенте
Процедура ФотографияПутьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = НСтр("ru = 'Изображения'; en = 'Images'")
	    + "(*.jpg)|*.jpg;*.jpeg";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите изображение";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
	    МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
	    Для Каждого ИмяФайла Из МассивФайлов Цикл
	       ФотографияПуть = ИмяФайла;
	    КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Запись.Ракурс) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.Фотография) И Не ЗначениеЗаполнено(ФотографияПуть) Тогда
		Отказ=Истина;
	КонецЕсли;
	
	Если Отказ Тогда Возврат КонецЕсли;
	
	Если ЗначениеЗаполнено(ФотографияПуть) Тогда
		ПараметрыЗаписи.Вставить("Фотография", Новый ДвоичныеДанные(ФотографияПуть));
		ПараметрыЗаписи.Вставить("Расширение", ПолучитьРасширениеФайла_(ФотографияПуть));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РакурсПриИзменении(Элемент)
	
	Элементы.Фотография.Доступность = ЗначениеЗаполнено(Запись.Ракурс);
	Элементы.ФотографияПуть.Доступность = ЗначениеЗаполнено(Запись.Ракурс);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыЗаписи.Свойство("Фотография") Тогда
		ФотографияОбъект = Справочники.Renault_ФотографииАвтомобилей.СоздатьЭлемент();
		ФотографияОбъект.Автомобиль = ТекущийОбъект.Автомобиль;
		ФотографияОбъект.Фотография = Новый ХранилищеЗначения(ПараметрыЗаписи.Фотография);
		ФотографияОбъект.Расширение = ПараметрыЗаписи.Расширение;
		ФотографияОбъект.Записать();
	КонецЕсли;
	
	ТекущийОбъект.Фотография = ФотографияОбъект.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьРасширениеФайла_(Знач ИмяФайла)
	
	Файл = Новый Файл(ИмяФайла);
	РасширениеФайла = ?(ПустаяСтрока(Файл.Расширение), Файл.Расширение, Прав(Файл.Расширение, СтрДлина(Файл.Расширение)-1));
	
	Возврат РасширениеФайла;
	
КонецФункции

&НаКлиенте
Процедура ФотографияПутьОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(ФотографияПуть) Тогда
		ЗапуститьПриложение(ФотографияПуть);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФотографияОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИмяФайла = ПолучитьИмяВременногоФайла(ПолучитьРасширение(Запись.Фотография));
	ДвоичныеДанные = ПолучитьДвоичныеДанныеФотографии(Запись.Фотография);
	ДвоичныеДанные.Записать(ИмяФайла);
	
	ЗапуститьПриложение(ИмяФайла);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРасширение(Фотография)
	Возврат Фотография.Фотография.Расширение;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДвоичныеДанныеФотографии(Фотография)
	
	Возврат Фотография.Фотография.Получить();
	
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Запись.Ракурс) И ЗначениеЗаполнено(Запись.Фотография) Тогда
		СтруктураВозврата = Новый Структура();
		СтруктураВозврата.Вставить("Ракурс", Запись.Ракурс);
		СтруктураВозврата.Вставить("Фотография", Запись.Фотография);
		
		Оповестить("ЗаписьФотографии", СтруктураВозврата);
	КонецЕсли;
	
КонецПроцедуры

