////&+ Модуль - Модуль менеджера |Объект - ОплатыПенейВАФМ
//Дата создания - 28.04.2012 10:18:09; Автор - Администратор
// Описание модуля
//  В модуле прописаны процедуры записи строк в регистр и удалении из регистра
//
//&-

////@+ Процедура ПроизвестиЗаписьвРегистр(ТаблицаЗаписей)
//Дата создания - 28.04.2012 9:46:34; Автор - Администратор
// 
// Описание процедуры
//  Процедура производит запись в регистр переданной таблицы
//
// Параметры
//  ТаблицаЗаписей  - ТаблицаЗначений - ТЗ в котором содержатся 
//                 строки из таблицы Пени с проставленной оплатой
//@-
Процедура ПроизвестиЗаписьвРегистр(ТаблицаЗаписей) Экспорт

	Для каждого СтрокаТЗ из ТаблицаЗаписей Цикл
		
		МЗ = СоздатьМенеджерЗаписи();
		
		МЗ.НомерДокумента = СтрокаТЗ.Invoice;
		МЗ.ПлатежноеПоручение = СтрокаТЗ.ПлатежноеПоручение;
		
		МЗ.Прочитать();
		
		// Комментарий 
		//Дата создания - 28.04.2012 10:22:54; Автор - Администратор
		//Заполним все возможное
		//
		ЗаполнитьЗначенияСвойств(МЗ, СтрокаТЗ);
		
		//теперь запоним адресно.
		МЗ.НомерДокумента = СтрокаТЗ.Invoice;
		МЗ.СуммаПлатежа = СтрокаТЗ.ПлатежноеПоручение.СуммаДокумента;
		МЗ.ДатаДокумента = СтрокаТЗ.ПлатежноеПоручение.Дата;
		
		МЗ.Записать();
	КонецЦикла;
	
КонецПроцедуры // ПроизвестиЗаписьвРегистр(ТаблицаЗаписей)

////@+ Процедура УдалитьЗаписьОбОплате(НомерДокумента)
//Дата создания - 28.04.2012 12:16:03; Автор - Администратор
// 
// Описание процедуры
//  Процедура удаляет записи по номеру инвойса
//
// Параметры
//  НомерДокумента  - Строка(20) - Строка с номером Инвойса
//
//@-
Процедура УдалитьЗаписьОбОплате(НомерДокумента) Экспорт

	НЗ = СоздатьНаборЗаписей();
	
	НЗ.Отбор.НомерДокумента.Установить(НомерДокумента);
	
	НЗ.Прочитать();
	НЗ.Очистить();
	НЗ.Записать();

КонецПроцедуры // УдалитьЗаписьОбОплате(НомерДокумента)
