
&НаСервере
Процедура УстановитьЗаголовкиВкладок()
	
	сПараметров = Новый Структура;
	сПараметров.Вставить("ПоказыватьУдаленныеЗаписи", ПоказыватьУдаленныеЗаписи);

	КоличествоЧерновиков = Справочники.Renault_КорпоративныеКлиенты.ПолучитьКоличествоКлиентов(
		Перечисления.Renault_СостоянияСогласованияКлиента.Черновик,
		сПараметров);
	КоличествоНаСогласовании = Справочники.Renault_КорпоративныеКлиенты.ПолучитьКоличествоКлиентов(
		Перечисления.Renault_СостоянияСогласованияКлиента.НаСогласовании,
		сПараметров);
	КоличествоСогласованные = Справочники.Renault_КорпоративныеКлиенты.ПолучитьКоличествоКлиентов(
		Перечисления.Renault_СостоянияСогласованияКлиента.Согласован,
		сПараметров);
	КоличествоНеСогласованные = Справочники.Renault_КорпоративныеКлиенты.ПолучитьКоличествоКлиентов(
		Перечисления.Renault_СостоянияСогласованияКлиента.НеСогласован,
		сПараметров);
		
	Элементы.ГруппаЧерновики.Заголовок = "Черновики";
	Элементы.ГруппаНаСогласовании.Заголовок = "На согласовании";
	Элементы.ГруппаСогласованные.Заголовок = "Согласованные";
	Элементы.ГруппаНесогласованные.Заголовок = "Не согласованные";
	
	Если КоличествоЧерновиков > 0 Тогда
		Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"Черновики (%1)",
			Строка(КоличествоЧерновиков));
	КонецЕсли;		
	Если КоличествоНаСогласовании > 0 Тогда
		Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"На согласовании (%1)",
			Строка(КоличествоНаСогласовании));
	КонецЕсли;
	Если КоличествоСогласованные > 0 Тогда
		Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"Согласованные (%1)",
			Строка(КоличествоСогласованные));
	КонецЕсли;
	Если КоличествоНеСогласованные > 0 Тогда
		Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"Не согласованные (%1)",
			Строка(КоличествоНеСогласованные));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЧерновикиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыВЗапросах()
	
	СписокЧерновики.Параметры.УстановитьЗначениеПараметра("Состояние", Перечисления.Renault_СостоянияСогласованияКлиента.Черновик);
	СписокНаСогласовании.Параметры.УстановитьЗначениеПараметра("Состояние", Перечисления.Renault_СостоянияСогласованияКлиента.НаСогласовании);
	СписокСогласованные.Параметры.УстановитьЗначениеПараметра("Состояние", Перечисления.Renault_СостоянияСогласованияКлиента.Согласован);
	СписокНеСогласованные.Параметры.УстановитьЗначениеПараметра("Состояние", Перечисления.Renault_СостоянияСогласованияКлиента.НеСогласован);
	
	СписокЧерновики.Параметры.УстановитьЗначениеПараметра("ПоказыватьВсе", Истина);
	СписокНаСогласовании.Параметры.УстановитьЗначениеПараметра("ПоказыватьВсе", Истина);
	СписокСогласованные.Параметры.УстановитьЗначениеПараметра("ПоказыватьВсе", Истина);
	СписокНеСогласованные.Параметры.УстановитьЗначениеПараметра("ПоказыватьВсе", Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗаголовкиВкладок();
	УстановитьОтборыВЗапросах();	
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздать(Команда)
	
	//@++ Васильев ВА
	Форма = ПолучитьФорму("Справочник.Renault_КорпоративныеКлиенты.Форма.Renault_ФормаКорпоративногоКлиента");
	Форма.СправочникОбъект = Справочники.Контрагенты.СоздатьЭлемент(); 
	Форма.Открыть();
	//@++
	 	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_КорпоративныеКлиенты" Тогда
		Элементы.СписокЧерновики.Обновить();
		Элементы.СписокНаСогласовании.Обновить();	
		Элементы.СписокСогласованные.Обновить();
		Элементы.СписокНеСогласованные.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЧерновикиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьКарточкуКлиента(Элемент.ТекущиеДанные.Контрагент, Элемент.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточкуКлиента(КонтрагентСсылка, ТекущиеДанные)
	//@++ Васильев ВА
	Форма = ПолучитьФорму("Справочник.Renault_КорпоративныеКлиенты.Форма.Renault_ФормаКорпоративногоКлиента");
	Форма.Ключ = КонтрагентСсылка;
	Форма.СферыДеятельности = ТекущиеДанные.Ссылка.СферыДеятельности.Выгрузить();
	Форма.Автопарк = ТекущиеДанные.Ссылка.Автопарк.Выгрузить();
	Форма.Открыть();
	//@++	
КонецПроцедуры

&НаКлиенте
Процедура СписокНаСогласованииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьКарточкуКлиента(Элемент.ТекущиеДанные.Контрагент, Элемент.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСогласованныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьКарточкуКлиента(Элемент.ТекущиеДанные.Контрагент, Элемент.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура СписокНеСогласованныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьКарточкуКлиента(Элемент.ТекущиеДанные.Контрагент, Элемент.ТекушиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура КомандаИзменить(Команда)
	
	ТекущийКлиент = Неопределено;
	Если Элементы.ГруппаСпискиКлиентов.ТекущаяСтраница = Элементы.ГруппаЧерновики Тогда
		ТекущиеДанные = Элементы.СписокЧерновики.ТекущиеДанные;
	ИначеЕсли Элементы.ГруппаСпискиКлиентов.ТекущаяСтраница = Элементы.ГруппаНаСогласовании Тогда
		ТекущиеДанные = Элементы.СписокНаСогласовании.ТекущиеДанные;
	ИначеЕсли Элементы.ГруппаСпискиКлиентов.ТекущаяСтраница = Элементы.ГруппаСогласованные Тогда
		ТекущиеДанные = Элементы.СписокСогласованные.ТекущиеДанные;
	ИначеЕсли Элементы.ГруппаСпискиКлиентов.ТекущаяСтраница = Элементы.ГруппаНесогласованные Тогда
		ТекущиеДанные = Элементы.СписокНеСогласованные.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтрагентСсылка = ТекущиеДанные.Контрагент;
	ОткрытьКарточкуКлиента(КонтрагентСсылка, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	РежимВопроса = РежимДиалогаВопрос.ДаНет;
	Ответ = Вопрос("Удалить данного клиента?", РежимВопроса, 0);
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;	
	КонецЕсли;
	
	ТекущийКлиент = Неопределено;
	Если Элементы.ГруппаСпискиКлиентов.ТекущаяСтраница = Элементы.ГруппаЧерновики Тогда
		ТекущиеДанные = Элементы.СписокЧерновики.ТекущиеДанные;
	ИначеЕсли Элементы.ГруппаСпискиКлиентов.ТекущаяСтраница = Элементы.ГруппаНаСогласовании Тогда
		ТекущиеДанные = Элементы.СписокНаСогласовании.ТекущиеДанные;
	ИначеЕсли Элементы.ГруппаСпискиКлиентов.ТекущаяСтраница = Элементы.ГруппаСогласованные Тогда
		ТекущиеДанные = Элементы.СписокСогласованные.ТекущиеДанные;
	ИначеЕсли Элементы.ГруппаСпискиКлиентов.ТекущаяСтраница = Элементы.ГруппаНесогласованные Тогда
		ТекущиеДанные = Элементы.СписокНеСогласованные.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КорпоративныйКлиентСсылка = ТекущиеДанные.Ссылка;
	ИзменитьПометкуУдаленияКлиента(КорпоративныйКлиентСсылка);
	Оповестить("Запись_КорпоративныеКлиенты");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьПометкуУдаленияКлиента(КорпоративныйКлиентСсылка)
	
	КорпоративныйКлиент = КорпоративныйКлиентСсылка.ПолучитьОбъект();
	Контрагент = КорпоративныйКлиент.Контрагент.ПолучитьОбъект();
	КорпоративныйКлиент.УстановитьПометкуУдаления(Не КорпоративныйКлиент.ПометкаУдаления);
	Контрагент.УстановитьПометкуУдаления(Не Контрагент.ПометкаУдаления);
	
КонецПроцедуры

