//+общие функции
Функция ТекстЗапросИсточникаДанных(ИмяСписка) Возврат ?(ЭтаФорма[ИмяСписка].ПроизвольныйЗапрос,ЭтаФорма[ИмяСписка].ТекстЗапроса,"") КонецФункции	
Функция ПолучитьИсточникНаСервере(ИмяСписка) Возврат Renault_ОбщиеФункции.ИсточникДанныхФормы(ЭтаФорма,ИмяСписка) КонецФункции
Функция ПолучитьПроизвольныйИсточникНаСервере(ИмяСписка) Возврат Renault_ОбщиеФункции.ПроизвольныйИсточникДанных(ТекстЗапросИсточникаДанных(ИмяСписка)) КонецФункции
//-общие функции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.РежимВыбора Тогда 
		Элементы.Список.РежимВыбора=Истина 
	Иначе 
		//Элементы.кнВыбрать.Видимость=Ложь 
	КонецЕсли; //DMSREN-1112 Сергеев В.Н.
	//отбор списка по владельцу - банку
	Банк=?(Параметры.Свойство("Банк"),Параметры.Банк,Справочники.Renault_КредитныеПредложения.РНБанк());
	БанкПредопределен=НЕ Банк.Пустая();
	Список.Параметры.Элементы.Найти("Банк").Использование=Истина;
	Список.Параметры.Элементы.Найти("Банк").Значение=Банк;
	УстановитьОтбор(Параметры);
	УправлениеЭлементами();
КонецПроцедуры

Процедура УстановитьОтбор(Параметры)
	
	//период действия предложения
	ГруппаОтбораИ=Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораИ.Использование=Истина;
	ГруппаОтбораИ.ТипГруппы=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ГруппаОтбораИ.Представление="Период действия предложения";
	
	Поле=ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Поле.Использование=Истина;
	Поле.ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	Поле.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ДатаНачалаПредложения");
	Поле.ПравоеЗначение=НачалоДня(ТекущаяДата());
	
	Поле=ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Поле.Использование=Истина;
	Поле.ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	Поле.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ДатаОкончанияПредложения");
	Поле.ПравоеЗначение=НачалоДня(ТекущаяДата());
	
	//модель
	Поле=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Поле.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	Поле.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ДоступныеВариантыКомплектации.ВариантКомплектации.Владелец");
	Поле.Использование=Параметры.Свойство("Модель");
	//++DMSREN-120
	Если Параметры.Свойство("Модель") Тогда
		Если ТипЗнч(Параметры.Модель) = Тип("СправочникСсылка.Автомобили") Тогда
			Поле.ПравоеЗначение = Параметры.Модель.Модель
		ИначеЕсли ТипЗнч(Параметры.Модель) = Тип("СправочникСсылка.ВариантыКомплектации") Тогда
			Поле.ПравоеЗначение = Параметры.Модель
		КонецЕсли;
	Иначе
		Поле.ПравоеЗначение = Справочники.Модели.ПустаяСсылка()
	КонецЕсли; 
	//--DMSREN-120
	Поле.Представление="Модель";
	
	//Комплектация
	Поле=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Поле.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	Поле.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ДоступныеВариантыКомплектации.ВариантКомплектации");
	Поле.Использование=Параметры.Свойство("Комплектация");
	Поле.ПравоеЗначение=?(Параметры.Свойство("Комплектация"),Параметры.Комплектация,Справочники.ВариантыКомплектации.ПустаяСсылка());
	Поле.Представление="Комплектация";
	
	//повторный клиент
	ЭлОтбора=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлОтбора.Использование=Параметры.Свойство("ПовторныйКлиентБанка");
	ЭлОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	ЭлОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Ссылка.ДляПовторногоКлиента");
	//++ DMSREN-131
	Если Параметры.Свойство("ПовторныйКлиентБанка") И Параметры.ПовторныйКлиентБанка Тогда
		ЭлОтбора.ПравоеЗначение=Истина;
	Иначе
		ЭлОтбора.ПравоеЗначение=Ложь;
	КонецЕсли;
	//Элементы.ДляПовторногоКлиента.Видимость=Не Параметры.Свойство("ПовторныйКлиентБанка");
	//-- DMSREN-131
	ЭлОтбора.Представление="Для повторного клиента";
	
	//++DMSREN-132 Исключить из списка предложения для ДФО
	ЭлОтбора=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.НеСодержит;
	ЭлОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Ссылка.Наименование");
	ЭлОтбора.Использование=Истина;
	ЭлОтбора.ПравоеЗначение="ДФО";
	ЭлОтбора.Представление="Не для ДФО";
	//--DMSREN-132
	
	//клиент CRM
	ЭлОтбора=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	ЭлОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Ссылка.ПрограммаCRM");
	ЭлОтбора.Использование=Параметры.Свойство("ПрограммаCRM");
	ЭлОтбора.ПравоеЗначение=Истина;
	ЭлОтбора.Представление="Программа CRM";
	Элементы.ПрограммаCRM.Видимость=Не Параметры.Свойство("ПрограммаCRM");
	
	//новый автомобиль
	ЭлОтбора=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	ЭлОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Ссылка.ДляНовогоАвтомобиля");
	ЭлОтбора.Использование=Параметры.Свойство("НовыйАвтомобиль");
	ЭлОтбора.ПравоеЗначение=Истина;
	ЭлОтбора.Представление="Для нового автомобиля";
	Элементы.ДляНовогоАвтомобиля.Видимость=Не Параметры.Свойство("НовыйАвтомобиль");
	
	//ТребуетсяКАСКО
	ЭлОтбора=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	ЭлОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Ссылка.ТребуетсяКАСКО");
	ЭлОтбора.Использование=Ложь;
	ЭлОтбора.ПравоеЗначение=Истина;
	ЭлОтбора.Представление="Требуется КАСКО";
	
	//Baloon
	ЭлОтбора=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	ЭлОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Ссылка.Baloon");
	ЭлОтбора.Использование=Ложь;
	ЭлОтбора.ПравоеЗначение=Истина;
	ЭлОтбора.Представление="Baloon (отложенный платеж)";
	
	////отбор пакетов
	//Параметр=Пакеты.Параметры.Элементы.Найти("Модель");
	//Параметр.Значение=?(Параметры.Свойство("Модель"),Параметры.Модель,Справочники.Модели.ПустаяСсылка());
	//Параметр.Использование=Истина;
	
КонецПроцедуры	

Процедура УправлениеЭлементами()
	Элементы.грБанк.Доступность=НЕ БанкПредопределен; //Элементы.грБанк.Видимость=НЕ БанкПредопределен; //Банк.Пустая();
	//Элементы.Банк.Доступность=Банк.Пустая(); - управляем только видимостью при ПриСозданииНаСервере
	Элементы.СсылкаВладелец.Видимость=Банк.Пустая();
	//Элементы.СсылкаКод.Видимость=НЕ Элементы.Список.РежимВыбора; 
	Элементы.кнОтказатьсяОтРНБанка.Видимость=Банк=Справочники.Renault_КредитныеПредложения.РНБанк();
КонецПроцедуры	

&НаКлиенте
Процедура кнОтбор(Команда)
	ИмяСписка="Список";
	//Источник=Renault_ОбщиеФункции.ИсточникДанныхФормы(ЭтаФорма,ИмяСписка);
	Источник=ПолучитьИсточникНаСервере(ИмяСписка); 
	
	СтрПараметры=Новый Структура;
	СтрПараметры.Вставить("ИмяСписка",ИмяСписка);
	СтрПараметры.Вставить("ПараметрыСписка",Список.Параметры.Элементы);
	
	Renault_ОбщиеФункции.ОткрытьФормуОтбора(ЭтаФорма,Источник,ЭтаФорма[ИмяСписка].КомпоновщикНастроек,"ОтборСписка",СтрПараметры,,Истина)
КонецПроцедуры
&НаКлиенте
Процедура ОтборСписка(КомпНастроек,Параметры) Экспорт
	Если КомпНастроек=Неопределено Тогда Возврат КонецЕсли;		
	ЭтаФорма[Параметры.ИмяСписка].КомпоновщикНастроек.ЗагрузитьФиксированныеНастройки(КомпНастроек.ФиксированныеНастройки);
	Для Н=0 по ЭтаФорма[Параметры.ИмяСписка].Параметры.Элементы.Количество()-1 Цикл
		Эл=ЭтаФорма[Параметры.ИмяСписка].Параметры.Элементы[Н];
		Эл.Значение=Параметры.ПараметрыСписка[Н].Значение;
		Эл.Использование=Параметры.ПараметрыСписка[Н].Использование;
	КонецЦикла;
	//ЭтаФорма[ИмяСписка].КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.Настройки);
	//ЭтаФорма[ИмяСписка].КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(КомпоновщикНастроек.ПользовательскиеНастройки);
	//ЭтаФорма[ИмяСписка].КомпоновщикНастроек.ЗагрузитьФиксированныеНастройки(КомпоновщикНастроек.ФиксированныеНастройки);
КонецПроцедуры

&НаКлиенте
Процедура БанкПриИзменении(Элемент) 
	Список.Параметры.Элементы.Найти("Банк").Значение=Банк; 
	УправлениеЭлементами();
КонецПроцедуры

&НаКлиенте
Процедура кнОтказатьсяОтРНБанка(Команда)
	Если Не ВвестиСтроку(КомментарийПричиныОтказаОтРНБанка,"Причина отказа от услуг РН Банка",,Истина) Тогда Возврат КонецЕсли;
	БанкПредопределен=Ложь;
	Если ВладелецФормы<>Неопределено Тогда 
		ВладелецФормы.КомментарийПричиныОтказаОтРНБанка=КомментарийПричиныОтказаОтРНБанка
	КонецЕсли;	
	Банк="";
	
	//++DMSREN-121
	Элементы.Создать.Доступность = Истина;
	//--DMSREN-121
	
	УправлениеЭлементами();
КонецПроцедуры

&НаКлиенте
Процедура кнЗагрузитьИзКлассификатора(Команда) Если Renault_РН_БАНК.РегЗадание_ЗагрузкаКредитныхПредложенийРНБанка(,Истина) Тогда Элементы.Список.Обновить() КонецЕсли КонецПроцедуры

//&НаКлиенте
//Процедура СписокПриАктивизацииСтроки(Элемент)
//	//отбор пакетов
//	Параметр=Пакеты.Параметры.Элементы.Найти("КредитноеПредложение");
//	Параметр.Значение=?(Элементы.Список.ТекущаяСтрока=Неопределено,Справочники.Renault_КредитныеПредложения.ПустаяСсылка(),Элементы.Список.ТекущаяСтрока.Ссылка);
//	Параметр.Использование=Истина;
//КонецПроцедуры


