
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Настройки =  КомпоновщикНастроек.ПолучитьНастройки();
	
	Параметры = Настройки.ПараметрыДанных.Элементы;
	
	ПараметрДатаНачала 	   = Параметры.Найти("ДатаНачала");
	ПараметрДатаОкончания  = Параметры.Найти("ДатаОкончания");
	ПараметрДилерскийЦентр = Параметры.Найти("ДилерскийЦентр");
	ПараметрКлиент = Параметры.Найти("Клиент");
	ПараметрМенеджер = Параметры.Найти("Менеджер");
	ПараметрОплатаТолькоДилерскимЦентром = Параметры.Найти("ОплатаТолькоДилерскимЦентром");
    ПараметрОплатаТолькоКлиентом = Параметры.Найти("ОплатаТолькоКлиентом");
	
	ПараметрДатаНачала.Значение     = ДатаНачала;
	ПараметрДатаОкончания.Значение  = ?(ДатаОкончания = Дата('00010101'), ДатаОкончания, КонецДня(ДатаОкончания));
	ПараметрДилерскийЦентр.Значение = ДилерскийЦентр;
	ПараметрКлиент.Значение = Клиент;
	ПараметрМенеджер.Значение = Менеджер;
	ПараметрОплатаТолькоДилерскимЦентром.Значение = ТолькоОплаченныеДилерскимЦентром;
	ПараметрОплатаТолькоКлиентом.Значение = ТолькоОплаченныеКлиентом;

	КомпоновщикМакет = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	Макет = КомпоновщикМакет.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет, , ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);	
КонецПроцедуры
