Процедура ЗаполнитьПоУмолчанию() Экспорт
	
	ПодключениеGate = Справочники.Renault_ПараметрыПодключенияКСервисам.WSGate.ПолучитьОбъект();
	ПодключениеGate.Наименование = "WSGate Flotte";
	ПодключениеGate.АдресСервера = "http://gate.rnlt.ru/renault-ws-gate/ws/";
	ПодключениеGate.Логин = "FlotteServiceUser";
	ПодключениеGate.Пароль = "FlotteServiceUser";
	ПодключениеGate.Записать();
	
	// Трояновский К.Е. 26.02.2019 17:48:34 {
	//TO DO
	//ПодключениеOrders = Справочники.Renault_ПараметрыПодключенияКСервисам.WSGate.ПолучитьОбъект();
	//ПодключениеOrders.Наименование = "Orders";
	//ПодключениеOrders.АдресСервера = "";
	//ПодключениеOrders.ИмяСервиса = "";
	//ПодключениеOrders.Логин = "";
	//ПодключениеOrders.Пароль = "";
	//ПодключениеOrders.Записать();	
	// Трояновский К.Е. 26.02.2019 17:48:34 }
	
КонецПроцедуры

Функция ПолучитьПараметрыПодключенияПоСсылке(ПодключениеСсылка, ИмяПубликацииСервиса) Экспорт
	
	АдресСервера = ПодключениеСсылка.АдресСервера;
	Адрес = АдресСервера + ИмяПубликацииСервиса + "?wsdl";
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Адрес", Адрес);
	СтруктураВозврата.Вставить("Логин", ПодключениеСсылка.Логин);
	СтруктураВозврата.Вставить("Пароль", ПодключениеСсылка.Пароль);
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьПараметрыПодключенияПоИмени(Имя, ИмяПубликацииСервиса) Экспорт
	
	Ссылка = Справочники.Renault_ПараметрыПодключенияКСервисам.НайтиПоНаименованию(Имя);	
	Возврат ПолучитьПараметрыПодключенияПоСсылке(Ссылка, ИмяПубликацииСервиса);
	
КонецФункции