// Функция обновляет индекс полнотекстового поиска
Функция ОбновитьИндексПоиска() Экспорт
	Результат = Ложь;
	ПоискРазрешен = (ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить);
	Если НЕ ПоискРазрешен Тогда
		ПоискРазрешен = РазрешитьПолнотекстовыйПоиск(Истина, Ложь);
	КонецЕсли;
	Если ПоискРазрешен Тогда
		Если НЕ ПолнотекстовыйПоиск.ИндексАктуален() Тогда
			Попытка
				#Если Клиент Тогда
					Сообщить("Обновляется индекс полнотекстового поиска. Это может занять продолжительное время, пожалуйста подождите...", СтатусСообщения.Информация);
				#КонецЕсли
				ПолнотекстовыйПоиск.ОбновитьИндекс();
				#Если Клиент Тогда
					Сообщить("Обновление индекса завершено.", СтатусСообщения.Информация);
				#КонецЕсли
				Результат = Истина;
			Исключение
				#Если Клиент Тогда
					Сообщить("Ошибка при обновление индекса!"+Символы.ПС+ОписаниеОшибки(),СтатусСообщения.Внимание);
				#КонецЕсли
			КонецПопытки;
		Иначе
			#Если Клиент Тогда
				Сообщить("Индекс полнотекстового поиска находится в актуальном состоянии, обновление не требуется.",СтатусСообщения.Обычное);
			#КонецЕсли
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции

// Функция включает полнотекстовый поиск
Функция РазрешитьПолнотекстовыйПоиск(ВыводитьСообщение = Истина, ОбновитьИндекс = Истина) Экспорт
	ПоискРазрешен = (ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить);
	Если ПоискРазрешен Тогда
		Возврат Истина;
	КонецЕсли;
	
	#Если Клиент Тогда
		// проверка необходимых прав
		Если НЕ ПравоДоступа("Администрирование", Метаданные) Тогда
			Текст = "Полнотекстовый поиск в настоящий момент запрещен.
			|Для разрешения операций с полнотекстовым поиском необходимы административные права.
			|Обратитесь к администратору баз данных.";
			Предупреждение(Текст,, "Полнотекстовый поиск");
			Возврат Ложь;
		КонецЕсли;
		
		Если ВыводитьСообщение Тогда
			Текст = "Полнотекстовый поиск в настоящий момент запрещен.
			|Разрешить полнотекстовый поиск?";
			Ответ = Вопрос(Текст, РежимДиалогаВопрос.ОКОтмена,,,"Полнотекстовый поиск");
			Если Ответ = КодВозвратаДиалога.Отмена Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	#КонецЕсли

	
	ПовторВключенияПоиска = Истина;
	
	Пока ПовторВключенияПоиска цикл
		ПовторВключенияПоиска = Ложь;
		Попытка
			ПолнотекстовыйПоиск.УстановитьРежимПолнотекстовогоПоиска(РежимПолнотекстовогоПоиска.Разрешить);
			Если ОбновитьИндекс Тогда
				#Если Клиент Тогда
					Сообщить("Обновляется индекс полнотекстового поиска. Это может занять продолжительное время, пожалуйста подождите...", СтатусСообщения.Информация);
				#КонецЕсли
				
				ПолнотекстовыйПоиск.ОбновитьИндекс();
				#Если Клиент Тогда
					Сообщить("Обновление индекса завершено.", СтатусСообщения.Информация);
				#КонецЕсли
				
			КонецЕсли;
		Исключение
			Инфо = ИнформацияОбОшибке();
			Описание = Инфо.Описание;
			Если Инфо.Причина <> Неопределено Тогда
				Описание = Инфо.Причина.Описание;
			КонецЕсли;
			#Если Клиент Тогда
				Если Найти(Описание, "Ошибка исключительной блокировки информационной базы.") > 0 Тогда
					Текст = "Ошибка исключительной блокировки информационной базы.
					|Закройте все остальные подключения к базе и повторите попытку.";
					Ответ = Вопрос(Текст,РежимДиалогаВопрос.ПовторитьОтмена,,, "Полнотекстовый поиск");
					Если Ответ = КодВозвратаДиалога.Повторить Тогда
						ПовторВключенияПоиска = Истина;
					КонецЕсли;
				Иначе
					Предупреждение(Описание,, "Полнотекстовый поиск");
				КонецЕсли;
			#КонецЕсли
			
		КонецПопытки;
	КонецЦикла;
	
	ПоискРазрешен = (ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить);
	Возврат ПоискРазрешен;
КонецФункции

// Функция поиска текста с использованием возможности полнотекстового поиска.
//
// Параметры: 
// 	ЧтоИщем - Строка - искомое значение. 
//  ГдеИщем - Массив состоящий из полных имен объектов метаданных. 
//	Например: 
//	ГдеИщем = Новый Массив;
//	ГдеИщем.Добавить(Метаданные.Справочники.Контрагенты.ПолноеИмя());
//	ГдеИщем.Добавить(Метаданные.Справочники.CRM_ПотенциальныеКонтрагенты.ПолноеИмя());
//
// Возвращаемое значение - таблица значений, содержащая результаты поиска.
//
Функция ВыполнитьПоиск(ЧтоИщем, ГдеИщем = Неопределено, ПрименитьНечеткийПоиск = Истина, Нечеткость = 25, РазмерПорции = 5, ПоискПоВхождениям = Ложь, ПолучатьОписание = Истина, УбиратьПовторы = Ложь) Экспорт

	РезультатПоиска = Новый ТаблицаЗначений;
	РезультатПоиска.Колонки.Добавить("НомерСтроки");
	РезультатПоиска.Колонки.Добавить("Значение");
	РезультатПоиска.Колонки.Добавить("Описание");
	РезультатПоиска.Колонки.Добавить("Представление");
	РезультатПоиска.Колонки.Добавить("Синоним");
	РезультатПоиска.Колонки.Добавить("ЗначениеКартинки");
	РезультатПоиска.Колонки.Добавить("HTMLОтображение");

	ТаблицаМетаданныхВывода = Новый ТаблицаЗначений;
	ТаблицаМетаданныхВывода.Колонки.Добавить("ПолноеИмя");	
	
	Если обЗначениеНеЗаполнено(ЧтоИщем) Тогда 
		Возврат РезультатПоиска;
	КонецЕсли;
	  
	
	Если ГдеИщем = Неопределено или ГдеИщем.количество()=0 тогда 
		ИспользоватьОграничения = Ложь;	
		МассивГдеИщем = Новый Массив();
	Иначе
		ИспользоватьОграничения = Истина;	
		МассивГдеИщем = Новый Массив();
		
		Для каждого ЭлГдеИщем из ГдеИщем Цикл
			стрТМВ = ТаблицаМетаданныхВывода.Добавить();
			стрТМВ.ПолноеИмя = ЭлГдеИщем;
			МассивГдеИщем.Добавить(Метаданные.НайтиПоПолномуИмени(ЭлГдеИщем));
		КонецЦикла;
	КонецЕсли;
	
	СписокПоиска = ПолнотекстовыйПоиск.СоздатьСписок("");
	
	СписокПоиска.ОбластьПоиска = МассивГдеИщем;
	
	Если ПрименитьНечеткийПоиск = Истина Тогда
		СписокПоиска.ПорогНечеткости = Нечеткость;
	Иначе	
		СписокПоиска.ПорогНечеткости = 0;
	КонецЕсли;
	
	Если ПоискПоВхождениям Тогда
		СписокПоиска.СтрокаПоиска = ПоискПоВхождениямПреобразоватьСтроку(ЧтоИщем);
	Иначе
		СписокПоиска.СтрокаПоиска = ЧтоИщем;
	КонецЕсли;
	
	СписокПоиска.ПолучатьОписание = ПолучатьОписание;
	СписокПоиска.РазмерПорции = РазмерПорции;
	СписокПоиска.ПерваяЧасть();
	
	РезультатПоиска.Очистить();
	РезультатПоискаНачальнаяПозиция = 0;
	РезультатПоискаПолноеКоличество = Неопределено;
	РезультатПоискаСлишкомМногоРезультатов = СписокПоиска.СлишкомМногоРезультатов();
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("ИспользоватьОграничения",ИспользоватьОграничения);
	ПараметрыПоиска.Вставить("УбиратьПовторы",УбиратьПовторы);
	ПараметрыПоиска.Вставить("СписокПоиска",СписокПоиска);
	ПараметрыПоиска.Вставить("РезультатПоиска",РезультатПоиска);
	ПараметрыПоиска.Вставить("ТаблицаМетаданныхВывода",ТаблицаМетаданныхВывода);
	
	Возврат ВыгрузитьРезультатВТаблицу(ПараметрыПоиска);
	
КонецФункции // ВыполнитьПоиск()

// Функция преобразует строку поиска - если в строке нет служебных символов, то все неключевые слова заключает в "*"
//
// Параметры:
//  СтрокаПоиска	- строка - строка, которую следует преобразовать
//	
// Возвращаемое значение - строка - преобразованная строка
//
Функция ПоискПоВхождениямПреобразоватьСтроку(СтрокаПоиска);
	СтрокаСлужебныхСимволов = "&|,~()*#!/+-";
	СписокСлужебныхСлов = Новый Массив(8);
	СписокСлужебныхСлов.Вставить(1,"И");
	СписокСлужебныхСлов.Вставить(2,"ИЛИ");
	СписокСлужебныхСлов.Вставить(3,"НЕ");
	СписокСлужебныхСлов.Вставить(4,"РЯДОМ");
	СписокСлужебныхСлов.Вставить(5,"AND");
	СписокСлужебныхСлов.Вставить(6,"OR");
	СписокСлужебныхСлов.Вставить(7,"NOT");
	СписокСлужебныхСлов.Вставить(8,"NEAR");
	
	Для Счетчик=1 По СтрДлина(СтрокаСлужебныхСимволов) Цикл
		Если Найти(СтрокаПоиска, Сред(СтрокаСлужебныхСимволов,Счетчик,1))<>0 Тогда 
			Возврат СтрокаПоиска;		
		КонецЕсли;
	КонецЦикла;
	НоваяСтрокаПоиска = "";
	Пока СтрДлина(СтрокаПоиска) <> 0 Цикл
		Лексема = "";
		Символ = Лев(СтрокаПоиска,1);
		СтрокаПоиска = Сред(СтрокаПоиска,2);
		Пока Символ<>" " И Символ<>"" Цикл
			Лексема = Лексема + Символ;
			Символ = Лев(СтрокаПоиска,1);
			СтрокаПоиска = Сред(СтрокаПоиска,2);
		КонецЦикла;
		Если СписокСлужебныхСлов.Найти(Лексема)=Неопределено И Лексема<>"" Тогда
			НоваяСтрокаПоиска = НоваяСтрокаПоиска + "*"+Лексема + "* ";
		Иначе
			НоваяСтрокаПоиска = НоваяСтрокаПоиска + Лексема + " ";
		КонецЕсли;
	КонецЦикла;
	
	Возврат СокрП(НоваяСтрокаПоиска);
КонецФункции //ПоискПоВхождениямПреобразоватьСтроку

Функция ВыгрузитьРезультатВТаблицу(ПараметрыПоиска)
	
	РезультатПоиска =  ПараметрыПоиска.РезультатПоиска;
	СписокПоиска = ПараметрыПоиска.СписокПоиска;
	ИспользоватьОграничения =ПараметрыПоиска.ИспользоватьОграничения;
	ТаблицаМетаданныхВывода =ПараметрыПоиска.ТаблицаМетаданныхВывода;
	УбиратьПовторы = ПараметрыПоиска.УбиратьПовторы;
	РезультатПоискаПолноеКоличество = Неопределено;
	
	ИспользоватьОграниченияНаРезультат = (ИспользоватьОграничения И (ТаблицаМетаданныхВывода.Количество()<>0) );
	ЭлементРезультата = Новый Структура;
	ЭлементРезультата.Вставить("Значение");
	ЭлементРезультата.Вставить("Синоним");
	ЭлементРезультата.Вставить("Метаданные");
	ЭлементРезультата.Вставить("Описание");
	ЭлементРезультата.Вставить("Представление");
	
	Для каждого ЭлементСпискаПолнотекстовогоПоиска из СписокПоиска цикл
		
		ЗаполнитьЗначенияСвойств(ЭлементРезультата, ЭлементСпискаПолнотекстовогоПоиска);
		ЭлементРезультата.Синоним = ЭлементСпискаПолнотекстовогоПоиска.Метаданные.Синоним;
		
		СтрокаТабличнойЧасти = Неопределено;
		Если ИспользоватьОграниченияНаРезультат Тогда
			// В ЭлементРезультата уже заполнены значения ЭлементСпискаПолнотекстовогоПоиска.
			// Посмотрим, надо ли его менять.
			СтрокаТабличнойЧасти = ТаблицаМетаданныхВывода.Найти(ЭлементСпискаПолнотекстовогоПоиска.Метаданные.ПолноеИмя(),"ПолноеИмя");
			Если СтрокаТабличнойЧасти=Неопределено Тогда
				Если Найти(ЭлементРезультата.Метаданные.ПолноеИмя(), "Регистр")>0 Тогда
					// Значит найденным значением является запись регистра. Поскольку,
					// пользователь не возжелал выводить данный объект, 
					// то проходимся по измерениям текущей записи регистра, возможно что-то подойдет.
					Для Каждого ИзмерениеМетаданные Из ЭлементРезультата.Метаданные.Измерения Цикл
						ЗначениеИзмерения = ЭлементРезультата.Значение[ИзмерениеМетаданные.Имя];
						Если НЕ обЗначениеНеЗаполнено(ЗначениеИзмерения) И (Найти(Строка(ТипЗнч(ЗначениеИзмерения)), "ссылка")>0)Тогда
							СтрокаТабличнойЧасти = ТаблицаМетаданныхВывода.Найти(ЗначениеИзмерения.Метаданные().ПолноеИмя(),"ПолноеИмя");
							Если СтрокаТабличнойЧасти<>Неопределено Тогда
								ЭлементРезультата.Описание      = "Регистр """ + ЭлементРезультата.Метаданные.Синоним + """ (" + ЭлементРезультата.Представление + "): " + ЭлементРезультата.Описание; 
								ЭлементРезультата.Значение      = ЗначениеИзмерения;
								ЭлементРезультата.Представление = Строка(ЗначениеИзмерения);																
								ЭлементРезультата.Синоним       = ЭлементРезультата.Значение.Метаданные().Синоним;                                          								
								Прервать; 									
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;						
				Иначе         
					// Значит найденным значением является какой-либо объект. 
					// Если это справочник, то сперва проверим его владельца.
					Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ЭлементРезультата.Значение)) Тогда
						Если НЕ обЗначениеНеЗаполнено(ЭлементРезультата.Значение.Владелец) Тогда
							СтрокаТабличнойЧасти = ТаблицаМетаданныхВывода.Найти(ЭлементРезультата.Значение.Владелец.Метаданные().ПолноеИмя(),"ПолноеИмя");
							Если СтрокаТабличнойЧасти<>Неопределено Тогда
								ЭлементРезультата.Описание      = "Справочник """ + ЭлементРезультата.Метаданные.Синоним + """ (" + ЭлементРезультата.Значение + """): " + ЭлементРезультата.Описание;
								ЭлементРезультата.Значение      = ЭлементРезультата.Значение.Владелец;	
								ЭлементРезультата.Представление = Строка(ЭлементРезультата.Значение);																
								ЭлементРезультата.Синоним       = ЭлементРезультата.Значение.Метаданные().Синоним;								
							КонецЕсли; 						
						КонецЕсли;
					КонецЕсли;   				
					
					// Значит проходимся по реквизитам объекта.
					Если СтрокаТабличнойЧасти=Неопределено Тогда				
						Для Каждого РеквизитМетаданные Из ЭлементРезультата.Метаданные.Реквизиты Цикл
							ЗначениеРеквизита = ЭлементРезультата.Значение[РеквизитМетаданные.Имя];
							Если НЕ обЗначениеНеЗаполнено(ЗначениеРеквизита) И (Найти(Строка(ТипЗнч(ЗначениеРеквизита)), "ссылка")>0)Тогда
								СтрокаТабличнойЧасти = ТаблицаМетаданныхВывода.Найти(ЗначениеРеквизита.Метаданные().ПолноеИмя(),"ПолноеИмя");
								Если СтрокаТабличнойЧасти<>Неопределено Тогда
									ЭлементРезультата.Описание      = ЭлементРезультата.Представление + ": " + ЭлементРезультата.Описание;
									ЭлементРезультата.Значение      = ЗначениеРеквизита;	
									ЭлементРезультата.Представление = Строка(ЭлементРезультата.Значение);																
									ЭлементРезультата.Синоним       = ЭлементРезультата.Значение.Метаданные().Синоним;	
									Прервать;
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;   						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли; 						
			
			// Если не нашли подходящий объект для вывода, то пропускаем
			Если СтрокаТабличнойЧасти=Неопределено Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли; // ИспользоватьОграниченияНаРезультат
		
		НоваяСтрока = Неопределено;
		Если УбиратьПовторы Тогда
			НоваяСтрока = РезультатПоиска.Найти(ЭлементРезультата.Значение, "Значение");
			Если НоваяСтрока<>Неопределено Тогда
				НоваяСтрока.Описание = НоваяСтрока.Описание + ", " + ЭлементРезультата.Описание;
			КонецЕсли;
		КонецЕсли;
		Если НоваяСтрока = Неопределено Тогда
			НоваяСтрока = РезультатПоиска.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементРезультата);
			НоваяСтрока.НомерСтроки = РезультатПоиска.Количество();
			
			ЗначениеКартинки = Неопределено;
			#Если Клиент тогда
				Если ТипЗнч(НоваяСтрока.Значение) = Тип("РегистрСведенийКлючЗаписи.КонтактнаяИнформация") Тогда
					Для каждого ТипКИ из Перечисления.ТипыКонтактнойИнформации цикл
						Если Найти(НоваяСтрока.Представление, "; " + Строка(ТипКИ) + ";") > 0 Тогда
							
							ЗначениеКартинки = киПолучитьКартинкуТипаКИ(ТипКИ);
							
							Прервать;
						КонецЕсли;
					КонецЦикла;
				ИначеЕсли ТипЗнч(НоваяСтрока.Значение)<>Тип("Строка") Тогда
					
					ФормаЗначения = НоваяСтрока.Значение.ПолучитьФорму();
					Если ТипЗнч(ФормаЗначения) = Тип("УправляемаяФорма") тогда
						ЗначениеКартинки = Неопределено;	
					Иначе
						ЗначениеКартинки = ФормаЗначения.КартинкаЗаголовка;
						Если ЗначениеКартинки.Вид = ВидКартинки.Пустая Тогда
							ТипОбъекта = Лев(НоваяСтрока.Значение.Метаданные().ПолноеИмя(),Найти(НоваяСтрока.Значение.Метаданные().ПолноеИмя(),".")-1);
							ЗначениеКартинки = обВернутьСтандартнуюКартинку(ТипОбъекта);
							
						КонецЕсли;
					КонецЕсли;
					ФормаЗначения = Неопределено;
				КонецЕсли;
				
				Если ЗначениеКартинки = Неопределено Тогда
					ТипОбъекта = Лев(НоваяСтрока.Значение,Найти(НоваяСтрока.Значение,"КлючЗаписи")-1);
					
					ЗначениеКартинки = обВернутьСтандартнуюКартинку(ТипОбъекта);
				КонецЕсли;
			#КонецЕсли
		
			НоваяСтрока.ЗначениеКартинки = ЗначениеКартинки;
			
			СтрHTML = "<tr>
					|  <td><font face=""MS Sans Serif"" size=""1"">
					|	<a id=""FullTextSearchListItem"" href=./"+(НоваяСтрока.НомерСтроки-1)+">";
			СтрHTML = СтрHTML + НоваяСтрока.Представление +"</a>&nbsp;("+ НоваяСтрока.Синоним +")<br>"+Символы.ПС;
			СтрHTML = СтрHTML + ?(СписокПоиска.ПолучатьОписание,НоваяСтрока.Описание,"");
			СтрHTML = СтрHTML + "
					|  </font></td>
					|</tr>";
			НоваяСтрока.HTMLОтображение = СтрHTML;
			
		КонецЕсли;
		
	КонецЦикла; // Для каждого ЭлементСпискаПолнотекстовогоПоиска из СписокПоиска цикл
	
	Если РезультатПоискаПолноеКоличество = Неопределено Тогда
		Если ((СписокПоиска.НачальнаяПозиция()+СписокПоиска.Количество()) = СписокПоиска.ПолноеКоличество()) Тогда
			РезультатПоискаПолноеКоличество = РезультатПоиска.Количество();
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатПоиска;
	
КонецФункции // ВыгрузитьРезультатВТаблицу()

Функция ПредложитьВыборПохожих(ЧтоИщем, ГдеИщем) Экспорт
	
	Результат = ВыполнитьПоиск(ЧтоИщем,ГдеИщем,истина,,,истина,,истина);
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		
		Результат.Сортировать("Значение");
		
		Возврат ЧтоИщем;
		
	Иначе
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции

Функция НайтиДублиКлиентов_НЕПолнотекстовый(ТекстПоиска) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.НаименованиеПолное ПОДОБНО &ТекстПоиска
	               |	ИЛИ Контрагенты.Наименование ПОДОБНО &ТекстПоиска";
				   
				  Запрос.УстановитьПараметр("ТекстПоиска", "%" + ТекстПоиска + "%");
				  
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция НайтиДубли(ТекстПоиска) Экспорт
	
	
	ГдеИщем = Новый Массив;
	ГдеИщем.Добавить(Метаданные.Справочники.Контрагенты.ПолноеИмя());
	ГдеИщем.Добавить(Метаданные.Справочники.CRM_ПотенциальныеКонтрагенты.ПолноеИмя());
	ГдеИщем.Добавить(Метаданные.РегистрыСведений.DMS_ДанныеФизическихЛиц.ПолноеИмя());
	
	мТекстПоиска = СокрЛП(ТекстПоиска);
	
	Попытка
		Результат = Renаult_ПолнотекстовыйПоиск.ВыполнитьПоиск(мТекстПоиска,ГдеИщем,Истина,30,20,Истина);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
		Результат.Сортировать("Представление Возр");
	
	Если ЗначениеЗаполнено(Результат) Тогда
				
		МассивРезультат = Результат.ВыгрузитьКолонку("Значение");	
				
		Возврат МассивРезультат;
		
	Иначе
		
	НаименованиеКонтрагента = ТекстПоиска;
		
	КонтрагентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
	КонтрагентОбъект.Наименование 		= НаименованиеКонтрагента;
	КонтрагентОбъект.НаименованиеПолное = НаименованиеКонтрагента;
	
	ПоискДублей = Обработки.ПоискИЗаменаДублирующихсяЭлементов.Создать();
	
	СтруктураПоиска = Новый Структура("Код,Наименование,НаименованиеПолное, ИНН,ОсновнойТелефон",Неопределено,"=",Неопределено,Неопределено,Неопределено);
	НайденныеОбъекты  = ПоискДублей.НайтиДубли(КонтрагентОбъект,СтруктураПоиска);
	
	СтруктураПоиска = Новый Структура("Код,Наименование,НаименованиеПолное, ИНН,ОсновнойТелефон",Неопределено,Неопределено,"=",Неопределено,Неопределено);
	
	Для Каждого Объект из ПоискДублей.НайтиДубли(КонтрагентОбъект,СтруктураПоиска) цикл
		
		НайденныйОбъект = НайденныеОбъекты.Найти(Объект.Ссылка, "Ссылка");
		
		Если (НайденныйОбъект <> Неопределено) тогда
			
			Для Каждого Колонка Из НайденныеОбъекты.Колонки Цикл
				
				Если ТипЗнч(НайденныйОбъект[Колонка.Имя]) = Тип("Булево") И НЕ НайденныйОбъект[Колонка.Имя] И Объект[Колонка.Имя] Тогда	
					НайденныйОбъект[Колонка.Имя] = Истина;
				КонецЕсли;
				
			КонецЦикла; 
			
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрока = НайденныеОбъекты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Объект);
		
	КонецЦикла;
	
		Возврат НайденныеОбъекты.ВыгрузитьКолонку("Ссылка");
		
	КонецЕсли;	
	
КонецФункции
	
Функция НайтиСписокПоТелефону(Телефон) Экспорт
	
	// Текст запроса для построения временной таблицы
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_НормализованныеКонтактыДляПоиска.Объект КАК Контрагент,
	               |	Renault_НормализованныеКонтактыДляПоиска.Данные
	               |ИЗ
	               |	РегистрСведений.Renault_НормализованныеКонтактыДляПоиска КАК Renault_НормализованныеКонтактыДляПоиска
	               |ГДЕ
	               |	Renault_НормализованныеКонтактыДляПоиска.Данные ПОДОБНО &Фрагмент";
	
	Фрагмент = Телефон;
	
	Фрагмент = СтрЗаменить(Фрагмент, "+", "");
	Фрагмент = СтрЗаменить(Фрагмент, "-", "");
	Фрагмент = СтрЗаменить(Фрагмент, ".", "");
	Фрагмент = СтрЗаменить(Фрагмент, "*", "");
	Фрагмент = СтрЗаменить(Фрагмент, " ", "");
	Фрагмент = СтрЗаменить(Фрагмент, "(", "");
	Фрагмент = СтрЗаменить(Фрагмент, ")", "");
	
	Если Найти(Фрагмент, "7") = 1 ИЛИ Найти(Фрагмент, "8") = 1 Тогда
		
		Фрагмент = Прав(Фрагмент, СтрДлина(Фрагмент) - 1);
		
	КонецЕсли;
	
	Если НЕ Renault_СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Фрагмент, Истина, Истина) Тогда
		
		Возврат Новый ТаблицаЗначений;
		
	КонецЕсли;

	Запрос.УстановитьПараметр("Фрагмент", "%" + Фрагмент + "%");
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Функция НайтиСписокПоEmail(Email) Экспорт
	
	// Текст запроса для построения временной таблицы
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_НормализованныеКонтактыДляПоиска.Объект КАК Контрагент,
	               |	Renault_НормализованныеКонтактыДляПоиска.Данные
	               |ИЗ
	               |	РегистрСведений.Renault_НормализованныеКонтактыДляПоиска КАК Renault_НормализованныеКонтактыДляПоиска
	               |ГДЕ
	               |	Renault_НормализованныеКонтактыДляПоиска.Данные ПОДОБНО &Фрагмент";
	
	Фрагмент = Email;
	
	Фрагмент = СтрЗаменить(Фрагмент, "+", "");
	Фрагмент = СтрЗаменить(Фрагмент, "-", "");
	Фрагмент = СтрЗаменить(Фрагмент, ".", "");
	Фрагмент = СтрЗаменить(Фрагмент, "*", "");
	Фрагмент = СтрЗаменить(Фрагмент, " ", "");
	Фрагмент = СтрЗаменить(Фрагмент, "(", "");
	Фрагмент = СтрЗаменить(Фрагмент, ")", "");
	
	//Если Найти(Фрагмент, "7") = 1 ИЛИ Найти(Фрагмент, "8") = 1 Тогда
	//	
	//	Фрагмент = Прав(Фрагмент, СтрДлина(Фрагмент) - 1);
	//	
	//КонецЕсли;
	
	//Если НЕ Renault_СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Фрагмент, Истина, Истина) Тогда
	//	
	//	Возврат Новый ТаблицаЗначений;
	//	
	//КонецЕсли;

	Запрос.УстановитьПараметр("Фрагмент", "%" + Фрагмент + "%");
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции
