#Если наСервере тогда
Функция ПолучитьКаталогиСервера(НачальныйКаталог = Неопределено) Экспорт
	
	Если НЕ НачальныйКаталог = неопределено тогда
		СписокКаталогов = Renault_ОбщийМодуль.РазложитьСтрокуВСписок(НачальныйКаталог, "\");
	КонецЕсли;
	
	//Для получения дерева будем использовать VBScript
	//В попытке, потому что в связке WIN(64) + 1Cserv(64) не создается MSScriptControl
	//Для таких случаев переключаемся на WScript.Shell (64)
	Попытка
		scrptCtrl = Новый COMОбъект("MSScriptControl.ScriptControl");
		scrptCtrl.language="vbscript";
		
		scrptCtrl.addcode(ПолучитьКодДляИсполненияWSScriptControl(НачальныйКаталог));
		//Результатом выполнения скрипта является массив с именем всех папок на компьютере
		МассивКаталогов = ScrptCtrl.Run("RunCodeIn1C");
		
	Исключение
		
		scrptCtrl = Новый COMОбъект("WScript.Shell");
		
		//Так как работаем через shell
		//Нужно для начала сохранить скрипт на диск, а затем запустить
		ИмяВременногоСкрипта = ПолучитьИмяВременногоФайла("vbs");
		
		ИмяФайлаСтруктурыКаталогов = КаталогВременныхФайлов() + "FoldersArray.txt";
		//Попробуем удалить, для начала
		УдалитьФайлы(ИмяФайлаСтруктурыКаталогов);
		
		Скрипт = Новый ТекстовыйДокумент;
		Скрипт.УстановитьТекст(ПолучитьКодДляИсполненияWScriptShell(НачальныйКаталог, ИмяФайлаСтруктурыКаталогов));
		Скрипт.Записать(ИмяВременногоСкрипта, КодировкаТекста.ANSI);
		
		МассивКаталогов = ScrptCtrl.Run(ИмяВременногоСкрипта,0, Истина);
		
		ТекстСтруктуры = Новый ЧтениеТекста;
		ТекстСтруктуры.Открыть(ИмяФайлаСтруктурыКаталогов);
		
		МассивКаталогов = Новый Массив;
		
		Стр = ТекстСтруктуры.ПрочитатьСтроку();
		
		Пока Стр<>Неопределено Цикл
		
			МассивКаталогов.Добавить(Стр);
			Стр = ТекстСтруктуры.ПрочитатьСтроку();
		
		КонецЦикла;
		
		ТекстСтруктуры.Закрыть();
		ТекстСтруктуры = Неопределено;
		
		УдалитьФайлы(ИмяВременногоСкрипта);
		УдалитьФайлы(ИмяФайлаСтруктурыКаталогов);
		
	КонецПопытки;
	
	//теперь этот массив нужно разложить в дерево значений
	СтруктураКаталогов = Новый ДеревоЗначений;
	СтруктураКаталогов.Колонки.Добавить("Каталог");
	
	//Если выбирали каталоги с установкой начального каталога у нас возникает проблема с 
	//построением дерева. Поэтому на основании списка каталогов, который получили из Начального каталога
	//создаем первую структуру.
	
	Если НЕ НачальныйКаталог = Неопределено тогда
		Строки = СтруктураКаталогов.Строки;
		Для каждого Каталог Из СписокКаталогов Цикл
		
			НС = Строки.Добавить();
			НС.Каталог = СокрЛП(Каталог.Значение);
			
			//Углубляемся
			Строки = НС.Строки;
		КонецЦикла; 
	КонецЕсли;
	
	//Теперь создаем структуру из полученного массива
	Для каждого стрМассива из МассивКаталогов Цикл
		ВремСтрока = Строка(стрМассива); //Отвяжемся от массива, чтобы можно было вносить изменения в строку
		
		СписокКаталогов = Renault_ОбщийМодуль.РазложитьСтрокуВСписок(ВремСтрока,"\");
		
		КоличествоКаталогов = СписокКаталогов.Количество();
		
		Если НЕ КоличествоКаталогов = 0 тогда
			
			СформироватьСтруктуруКаталогов(СписокКаталогов, СтруктураКаталогов);
			
		КонецЕсли;
	
	КонецЦикла;
	
	ПроверитьКорниНаПустыеСтроки(СтруктураКаталогов);
	
	Возврат ЗначениеВСтрокуВнутр(СтруктураКаталогов);
	
КонецФункции

Процедура СформироватьСтруктуруКаталогов(СписокКаталогов,СтруктураКаталогов)
	
	СтрокиСтруктуры = СтруктураКаталогов.Строки;
	
	Для каждого строкаСписка из СписокКаталогов Цикл
		
		Если НЕ ЗначениеЗаполнено(строкаСписка.Значение) тогда продолжить КонецЕсли;
		
		Отбор = Новый Структура("Каталог", строкаСписка.Значение);
		
		МассивСтрок = СтрокиСтруктуры.НайтиСтроки(Отбор); //В каждом поиске должна быть только 1 Строка
		
		Если МассивСтрок.Количество() > 0 Тогда 
			СтрокиСтруктуры = МассивСтрок[0].Строки;
		Иначе
			НС = СтрокиСтруктуры.Добавить();
			НС.Каталог = строкаСписка.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьКорниНаПустыеСтроки(СтруктураКаталогов)
	
	//Удалим пустые строки из корня (без подчиненных каталогов)
	Сч = 0;
	Пока Сч <= СтруктураКаталогов.Строки.Количество() -1 Цикл
		
		СтрокаСтруктуры = СтруктураКаталогов.Строки[Сч];
		Если СтрокаСтруктуры.Строки.Количество() = 0 тогда 
			СтруктураКаталогов.Строки.Удалить(СтрокаСтруктуры);
			
			Продолжить;
			
		КонецЕсли;
		
		Сч = Сч + 1;
	КонецЦикла;
	
КонецПроцедуры

//Процедура ПроверитьСоздатьКаталог
//
//Параметры
// АдресКаталога - Строка. Переменная содержит полное имя каталога, который нужно создать
// НовыеСубКаталоги - СписокЗначений. Имена каталоговкоторые нужно создать в проверяемом каталоге
//
Процедура ПроверитьСоздатьКаталог(АдресКаталога, НовыеСубКаталоги = Неопределено) Экспорт
	
	//Проверяем корневой каталог
	Каталог = Новый Файл(АдресКаталога);
	
	Если НЕ Каталог.Существует() тогда
		СоздатьКаталог(АдресКаталога);
	КонецЕсли;
	
	АдресКаталога = ?(Прав(АдресКаталога, 1) = "\",АдресКаталога, АдресКаталога + "\");
	
	
	//Проверяем подчиненные
	Если НЕ НовыеСубКаталоги = Неопределено тогда //Адреса каталогов переданны
		
		Для каждого СубКаталог из НовыеСубКаталоги Цикл
			
			АдресСубКаталога = АдресКаталога + СубКаталог.Значение;
			
			Каталог = Новый Файл(АдресСубКаталога);
	
			Если НЕ Каталог.Существует() тогда
				СоздатьКаталог(АдресСубКаталога);
			КонецЕсли

		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьКодДляИсполненияWSScriptControl(НачальныйКаталог)
	
	КодДляИсполнения = "
	|Function GetSubFolderList (oSubFolder, FolderArray, maxFolderCount)
	|	On Error Resume Next
	|	SubFolders = oSubFolder.SubFolders.Count
	|
	//Добавляем саму папку, только если она не системная или скрытая
	|	If (oSubFolder.attributes <> 4) and (oSubFolder.attributes <> 2) and (oSubFolder.attributes <> 22) then
	|		ReDim Preserve FolderArray(UBound(FolderArray) + 1)
	|		FolderArray(UBound(FolderArray)) = oSubFolder
	|
	|		If maxFolderCount <= 5 then
	|		
	|			If SubFolders > 0 then
	//Теперь добавляем вложенные
	|				Set tempSubfolders = oSubFolder.SubFolders
	|				For Each oFolder In tempSubfolders
	|					GetSubFolderList oFolder, FolderArray, maxFolderCount
	|				Next
	|			End If
	|		End If
	|	End If
	|End Function
	|
	|Function RunCodeIn1C()
	|	Dim fso1
	|	
	|	Set fso1 = CreateObject(""Scripting.FileSystemObject"")";
	
	Если НЕ ЗначениеЗаполнено(НачальныйКаталог) тогда //Работаем по всем дискам.
		КодДляИсполнения = КодДляИсполнения +"
			|	Set oDrives = fso1.Drives
			|
			//Создаем массив для дисков
			|	diskArray = Array()
			|
			|	For Each i In oDrives
			
			//Добавляем Название диска в массив 
			// но только если он имеет тип 2 - fixed
			//Сам массив при этом увеличиваем на единицу.
			|		SET Drv = fso1.GetDrive(i)
			|		If Drv.DriveType = 2 then
			|			ReDim Preserve diskArray(UBound(diskArray) + 1)
			|			diskArray(UBound(diskArray)) = i & ""\""
			|		End If
			|	Next
			//По дискам перебираем структуру папок
			|	FolderArray = Array()
			|
			|	For Each i In diskArray
			|		Set oFolders = fso1.GetFolder(i)
			//Добавляем сам диск как папку
			|		ReDim Preserve FolderArray(UBound(FolderArray) + 1)
			|		FolderArray(UBound(FolderArray)) = i
			|
			|		Set oSubfolders = oFolders.SubFolders
			|		For Each oFolder In oSubFolders
			|			GetSubFolderList oFolder, FolderArray, 1
			|		Next
			|	Next
			|";
	Иначе //Устанавливаем стартовый каталог и работаем только от него.
		КодДляИсполнения = КодДляИсполнения +"
			|	FolderArray = Array()
			|	Set oFolders = fso1.GetFolder(""" + НачальныйКаталог + """)
			|
			|	Set oSubfolders = oFolders.SubFolders
			|	For Each oFolder In oSubFolders
			|		GetSubFolderList oFolder, FolderArray, 1
			|	Next";

	КонецЕсли;
		
	КодДляИсполнения = КодДляИсполнения +"
	|
	|	RunCodeIn1C = FolderArray
	|End Function
	|
	|";
	
	Возврат КодДляИсполнения;
	
КонецФункции

Функция ПолучитьКодДляИсполненияWScriptShell(НачальныйКаталог, ФайлКаталогов)
	
	КодДляИсполнения = "
	|Dim fso1
	|
	|Set fso1 = CreateObject(""Scripting.FileSystemObject"")
	|Set tf   = fso1.CreateTextFile(""" + ФайлКаталогов + """, True)";
	Если НЕ ЗначениеЗаполнено(НачальныйКаталог) тогда //Работаем по всем дискам.
		КодДляИсполнения = КодДляИсполнения +"
		|	Set oDrives = fso1.Drives
		|
		|'//Создаем массив для дисков
		|	diskArray = Array()
		|
		|	For Each i In oDrives
		|'//Добавляем Название диска в массив 
		|'// но только если он имеет тип 2 - fixed
		|'//Сам массив при этом увеличиваем на единицу.
		|		SET Drv = fso1.GetDrive(i)
		|		If Drv.DriveType = 2 then
		|			ReDim Preserve diskArray(UBound(diskArray) + 1)
		|			diskArray(UBound(diskArray)) = i & ""\""
		|		End If
		|	Next
		|'//По дискам перебираем структуру папок
		|
		|	FolderArray = """"
		|
		|	For Each i In diskArray
		|		Set oFolders = fso1.GetFolder(i)
		|'//Добавляем сам диск как папку
		|		FolderArray = FolderArray & i & vbCrLf
		|
		|		Set oSubfolders = oFolders.SubFolders
		|		For Each oFolder In oSubFolders
		|			GetSubFolderList oFolder, FolderArray, 1
		|		Next
		|	Next
		|
		|	tf.write(FolderArray)
		|	tf.Close
		|";
	Иначе //Устанавливаем стартовый каталог и работаем только от него.
		КодДляИсполнения = КодДляИсполнения +"
		|	FolderArray = """"
		|	Set oFolders = fso1.GetFolder(""" + НачальныйКаталог + """)
		|
		|	Set oSubfolders = oFolders.SubFolders
		|	For Each oFolder In oSubFolders
		|		GetSubFolderList oFolder, FolderArray, 1
		|	Next
		|
		|	tf.write(FolderArray)
		|	tf.Close
		|";
	КонецЕсли;
	
	КодДляИсполнения = КодДляИсполнения +"
	|
	|Function GetSubFolderList (oSubFolder, FolderArray, maxFolderCount)
	|	On Error Resume Next
	|	SubFolders = oSubFolder.SubFolders.Count
	|
	|'//Добавляем саму папку, только если она не системная или скрытая
	|	If (oSubFolder.attributes <> 4) and (oSubFolder.attributes <> 2) and (oSubFolder.attributes <> 22) then
	|		FolderArray = FolderArray & oSubFolder & vbCrLf
	|		If maxFolderCount <= 5 then
	|			If SubFolders > 0 then
	|				Set tempSubfolders = oSubFolder.SubFolders
	|				For Each oFolder In tempSubfolders
	|					GetSubFolderList oFolder, FolderArray, maxFolderCount
	|				Next
	|			End If
	|		End If
	|	End If
	|End Function"
	;
	
	Возврат КодДляИсполнения;
	
КонецФункции

#КонецЕсли


