
#Область ОбработчикиКомандФормы

// Выполняет заполнение параметров снабжения по умолчанию для выбранного склада из макета "ПараметрыПоУмолчанию"
//
&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	
	Форма = ПолучитьФорму("Справочник.СкладыКомпании.ФормаВыбора");
	РезультатВыбора = Форма.ОткрытьМодально();
	
	Если РезультатВыбора <> Неопределено Тогда
		Если Вопрос(НСтр("ru = 'Выполнить заполнение по умолчанию для склада '; en = 'ZZZ'; fr = 'ZZZ'") + """" + РезультатВыбора.Наименование + """?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			ЗаполнитьПоУмолчаниюНаСервере(РезультатВыбора);
			Элементы.Список.Обновить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПоУмолчанию()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - Заполнить по умолчанию на сервере
//
&НаСервереБезКонтекста
Процедура ЗаполнитьПоУмолчаниюНаСервере(Склад)
	
	ТабличиныйДокументПараметры = РегистрыСведений.Renault_ПараметрыСнабженияНоменклатуры.ПолучитьМакет("ПараметрыПоУмолчанию");
	
	НаборЗаписей = РегистрыСведений.Renault_ПараметрыСнабженияНоменклатуры.СоздатьНаборЗаписей();
	
	Для сч = 2 По ТабличиныйДокументПараметры.ВысотаТаблицы Цикл
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.СкладКомпании 							= Склад;
		НоваяЗапись.КлассABC 								= Перечисления.Renault_ABCКлассификация[ТабличиныйДокументПараметры.Область(сч, 1).Текст];
		НоваяЗапись.КлассXYZ 								= Перечисления.Renault_XYZКлассификация[ТабличиныйДокументПараметры.Область(сч, 2).Текст];
		НоваяЗапись.ЦеноваяГруппа 							= Число(ТабличиныйДокументПараметры.Область(сч, 3).Текст);
		НоваяЗапись.ЧастотнаяГруппа 						= Число(ТабличиныйДокументПараметры.Область(сч, 4).Текст);
		НоваяЗапись.ИспользоватьФиксированныйСтраховойЗапас = ? (ТабличиныйДокументПараметры.Область(сч, 5).Текст = "Да", Истина, Ложь);
		НоваяЗапись.СрокПокрытияСтраховогоЗапаса			= Число(ТабличиныйДокументПараметры.Область(сч, 6).Текст);
		НоваяЗапись.УровеньСервиса							= Число(ТабличиныйДокументПараметры.Область(сч, 7).Текст);;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры // ЗаполнитьПоУмолчаниюНаСервере()

#КонецОбласти
