
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("КорзинаАвторабот") Тогда
		
		мКорзина = КорзинаАвторабот.Выгрузить();
		
		Для каждого ТекущаяСтрока Из Параметры.КорзинаАвторабот Цикл
			
			НоваяСтрока = мКорзина.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекущаяСтрока);
			
		КонецЦикла;
		
		мКорзина.Свернуть("Авторабота,ВремяВыполнения,Нормочас,Цена", "Количество");
		
		КорзинаАвторабот.Загрузить(мКорзина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	АдресХранлища = ПоместитьВоВременноеХранилищеНаСервере();
	
	ОповеститьОВыборе(АдресХранлища);
	
КонецПроцедуры

&НаКлиенте
Процедура КорзинаАвтоработПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КорзинаАвтоработПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьВоВременноеХранилищеНаСервере()
	
	СтруктураОтбора = Новый Структура("Выбрать", Истина);
	
	Возврат ПоместитьВоВременноеХранилище(КорзинаАвторабот.Выгрузить(СтруктураОтбора, "Авторабота,ВремяВыполнения,Нормочас,Цена,Количество"), Новый УникальныйИдентификатор);
	
КонецФункции // ПоместитьВоВременноеХранилищеНаСервере()
 
