Процедура Renault_ПроверкаБлокировкиАвтомобиляПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	//К+    //На вермя проведения старых документов, потом убрать
	ПроводитьБезПроверок = Renault_AdvancedСервер.РазрешитьПроводитьЗаказНарядБезОпределенныхПроверок();
	Если ПроводитьБезПроверок Тогда
		Возврат;
	КонецЕсли;
	//К-

	#Если НЕ Клиент Тогда
		
		Возврат;
		
	#КонецЕсли
	
	 Если Источник.ОбменДанными.Загрузка = Истина Тогда
        
        //Сообщить("ОбменДанными.Загрузка...");
        Возврат;
        
    КонецЕсли;
	
	Если Renault_AdvancedСервер.АвтомобильЗаблокирован(Источник.Автомобиль) Тогда
		
		Сообщить("Автомобиль заблокирован");
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура Renault_ПроверкаБлокировкиКонтрагентаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	//К+    //На вермя проведения старых документов, потом убрать
	ПроводитьБезПроверок = Renault_AdvancedСервер.РазрешитьПроводитьЗаказНарядБезОпределенныхПроверок();
	Если ПроводитьБезПроверок Тогда
		Возврат;
	КонецЕсли;
	//К-

	#Если НЕ Клиент Тогда
		
		Возврат;
		
	#КонецЕсли
	
	Если Источник.ОбменДанными.Загрузка = Истина Тогда
        
        //Сообщить("ОбменДанными.Загрузка...");
        Возврат;
        
    КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказНаряд") Тогда
		
		Контрагент = Источник.Контрагент;
		
	Иначе
		
		Контрагент = Источник.Клиент;
		
		
	КонецЕсли;
	
	
	Если Renault_AdvancedСервер.КонтрагентЗаблокирован(Контрагент) Тогда
		
		Сообщить("Контрагент заблокирован");
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

//Козлов Е.А. Начало 21.07.2016

///Мои Начало
Функция ПолучитьРеквизитыДоговора(ДоговорКонтрагента) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.Автодоговор,
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.ИндивидуальныеУсловияПоНаборам,
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.ОтправкаДокументов,
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.ПечатьПодтвержденияУщерба,
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.ПечатьСтраховщик,
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.ПродажаСтраховогоПолиса,
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.ВедениеВзаиморасчетов,
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.ВестиПоДокументамРасчетовСКонтрагентом,
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.ВидАгентскогоДоговора,
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.ВидВзаиморасчетов,
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.ВидУсловийДоговора,
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.ДержатьРезервБезОплатыОграниченноеВремя,
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.ДопустимоеЧислоДнейЗадолженности,
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.КонтролироватьДенежныеСредстваКомитента,
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.КонтролироватьСуммуЗадолженности,
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.КонтролироватьЧислоДнейЗадолженности,
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.НаименованиеДляСчетаФактурыНаАванс,
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.ОбособленныйУчетТоваровПоЗаказамПокупателей,
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.ОсновнаяСтатьяДвиженияДенежныхСредств,
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.Гарантийный,
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.Страховой,
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.ТипЦенСклад,
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.ПорядокРегистрацииСчетовФактурНаАвансПоДоговору,
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.РасчетыВУсловныхЕдиницах,
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.РеализацияНаЭкспорт,
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.СпособРасчетаКомиссионногоВознаграждения,
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.ТипЦен,
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.УчетАгентскогоНДС,
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.ЧислоДнейРезерваБезОплаты
		|ИЗ
		|	РегистрСведений.Renault_Advanced_РеквизитыДоговоровКонтрагентов КАК Renault_Advanced_РеквизитыДоговоровКонтрагентов
		|ГДЕ
		|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.ДоговорКонтрагента = &ДоговорКонтрагента";	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента); 	
	Результат = Запрос.Выполнить();
	
	Выборка = Неопределено;
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();		
		Выборка.Следующий();
	КонецЕсли;
	
	Возврат Выборка;	
КонецФункции

Процедура ЗаписатьРеквизитыДоговора(ФормаДоговора, Договор) Экспорт
	Если ФормаДоговора <> Неопределено И ЗначениеЗаполнено(Договор) Тогда
		Если ФормаДоговора.СправочникОбъект.Ссылка = Договор Тогда
			Запись = РегистрыСведений.Renault_Advanced_РеквизитыДоговоровКонтрагентов.СоздатьМенеджерЗаписи();
			Запись.ДоговорКонтрагента = Договор;
			ЗаполнитьЗначенияСвойств(Запись, ФормаДоговора);
			
			Запись.Записать();			
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьСписокПоляВыбора(ПолеВыбора, Список) Экспорт 
	ПрошлоеЗначение = ПолеВыбора.Значение;
	ПолеВыбора.СписокВыбора = Список;
	Если ЗначениеЗаполнено(ПрошлоеЗначение) Тогда
		Если  Список.НайтиПоЗначению(ПрошлоеЗначение) <> Неопределено Тогда
			Если НЕ ПолеВыбора.Значение = ПрошлоеЗначение Тогда
				ПолеВыбора.Значение = ПрошлоеЗначение;
			КонецЕсли;
		Иначе
			ПолеВыбора.Значение = Неопределено;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

//Используется для: ЗаказНаряд, ДоговорВзаиморасчетов
Функция ПолучитьРеквизитОбъекта(СсылкаНаОбъект, ИмяРеквизита) Экспорт
	ЗначениеРеквизита = Неопределено;
	
	ЭтоРеквизитОбъекта = Истина;
	
	МетаданныеОбъекта = СсылкаНаОбъект.Метаданные();
	Если МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизита) = Неопределено Тогда
		ЭтоРеквизитОбъекта = Ложь;
	КонецЕсли;

	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ЗаказНаряд") Тогда		
		Если ЭтоРеквизитОбъекта Тогда
			ТекстЗапроса = 
				"ВЫБРАТЬ
				|	ЗаказНарядДок." + ИмяРеквизита + " КАК " + ИмяРеквизита + "
				|ИЗ
				|	Документ.ЗаказНаряд КАК ЗаказНарядДок
				|ГДЕ
				|	ЗаказНарядДок.Ссылка = &СсылкаНаОбъект";
		КонецЕсли;		 
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.ДоговорыВзаиморасчетов") Тогда
		Если ЭтоРеквизитОбъекта Тогда
			ТекстЗапроса = 
				"ВЫБРАТЬ
				|	ДоговорыВзаиморасчетов." + ИмяРеквизита + " КАК " + ИмяРеквизита + "
				|ИЗ
				|	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
				|ГДЕ
				|	ДоговорыВзаиморасчетов.Ссылка = &СсылкаНаОбъект";
		Иначе
			ТекстЗапроса = 
				"ВЫБРАТЬ
				|	Renault_Advanced_РеквизитыДоговоровКонтрагентов." + ИмяРеквизита + " КАК " + ИмяРеквизита + "
				|ИЗ
				|	РегистрСведений.Renault_Advanced_РеквизитыДоговоровКонтрагентов КАК Renault_Advanced_РеквизитыДоговоровКонтрагентов
				|ГДЕ
				|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.ДоговорКонтрагента = &СсылкаНаОбъект";			
		КонецЕсли;		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);		
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();			
		Выборка.Следующий();
		
		ЗначениеРеквизита = Выборка[ИмяРеквизита];			
	Иначе
		Если Не ЭтоРеквизитОбъекта Тогда
			Если ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.ДоговорыВзаиморасчетов") Тогда
				ЗначениеРеквизита = Метаданные.РегистрыСведений.Renault_Advanced_РеквизитыДоговоровКонтрагентов.Ресурсы.Найти(ИмяРеквизита).Тип.ПривестиЗначение(); 
			ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
				ЗначениеРеквизита = Метаданные.Документы.ЗаказНаряд.Реквизиты.Найти(ИмяРеквизита).Тип.ПривестиЗначение(); 
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеРеквизита;	
КонецФункции
///Мои Конец



// Функция возвращает список значений видов договоров взаиморасчетов когда
// контрагент не является ни поставщиком не покупателем.
//
// Параметры
//  НЕТ
//
// Возвращаемое значение:
//   СписокЗначений
//
Функция ПолучитьСписокВидовДоговоровВзаиморасчетовПрочее() Экспорт

	СписокПеречисления = Новый СписокЗначений;
	
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоров.Прочее);
	
	Возврат СписокПеречисления;

КонецФункции // ПолучитьСписокВидовДоговоровВзаиморасчетовПрочее()

// Функция возвращает список значений видов договоров взаиморасчетов для поставщика.
//
// Параметры
//  НЕТ
//
// Возвращаемое значение:
//   СписокЗначений
//
Функция ПолучитьСписокВидовДоговоровВзаиморасчетовДляПоставщика() Экспорт

	СписокПеречисления = Новый СписокЗначений;
	
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоров.Покупка);
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоров.СКомитентом);
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоров.Прочее);
	
	Возврат СписокПеречисления;

КонецФункции // ПолучитьСписокВидовДоговоровВзаиморасчетовДляПоставщика()

// Функция возвращает список значений видов договоров взяиморасчетов для покупателя.
//
// Параметры
//  НЕТ
//
// Возвращаемое значение:
//   СписокЗначений
//
Функция ПолучитьСписокВидовДоговоровВзаиморасчетовДляПокупателя() Экспорт

	СписокПеречисления = Новый СписокЗначений;
	
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоров.Продажа);
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоров.СКомиссионером);
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоров.Прочее);
	
	Возврат СписокПеречисления;

КонецФункции // ПолучитьСписокВидовДоговоровВзаиморасчетовДляПокупателя()

Функция ПолучитьСписокВидовДоговоровВзаиморасчетовДляПокупателяИПоставщика() Экспорт

	СписокПеречисления = Новый СписокЗначений;
	
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоров.Продажа);
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоров.СКомиссионером);
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоров.Покупка);
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоров.СКомитентом);
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоров.Прочее);
	
	Возврат СписокПеречисления;

КонецФункции // ПолучитьСписокВидовДоговоровВзаиморасчетовДляПокупателя()

// Функция формирует список элементов перечисления
//
// Параметры
//  ИмяПеречисления - имя перечисления, как оно задано в конфигураторе
//
// Возвращаемое значение:
//   СписокЗначений - список элементов перечисления
//
Функция ПолучитьСписокЭлементовПеречисления(ИмяПеречисления) Экспорт

	СписокЭлементовПеречисления = Новый СписокЗначений;
	
	Попытка
		КоллекцияЭлементовПеречисления = Перечисления[ИмяПеречисления];
	Исключение
		Возврат СписокЭлементовПеречисления;
	КонецПопытки;
	
	Для каждого ЭлементПеречисления Из КоллекцияЭлементовПеречисления Цикл
		СписокЭлементовПеречисления.Добавить(ЭлементПеречисления, Строка(ЭлементПеречисления));
	КонецЦикла;
	
	Возврат СписокЭлементовПеречисления;

КонецФункции // ПолучитьСписокЭлементовПеречисления()

//Козлов Е.А. Начало 27.07.2016
//////////////////////////////////////////////Реквизиты заказ-наряда/////////////////////////////////////

Функция ПолучитьКомплектациюРаботы(Авторабота, ТипКомплектации) Экспорт
	Если ТипКомплектации = "Работы" Тогда
		ДопУсловие = "Справочник.Автоработы";
		ДопНазвание = "Работа";
	ИначеЕсли ТипКомплектации = "Запчасти" Тогда
		ДопУсловие = "Справочник.Номенклатура";
		ДопНазвание = "Запчасть";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвязанныеРаботы.СвязаннаяРабота КАК " + ДопНазвание + ",
		|	СвязанныеРаботы.Количество
		|ИЗ
		|	РегистрСведений.СвязанныеРаботы КАК СвязанныеРаботы
		|ГДЕ
		|	СвязанныеРаботы.Авторабота = &Авторабота
		|	И СвязанныеРаботы.СвязаннаяРабота ССЫЛКА " + ДопУсловие + ""; 	
	Запрос.УстановитьПараметр("Авторабота", Авторабота); 	
	Результат = Запрос.Выполнить();
	
	ТабСвязанных = Результат.Выгрузить();
	
	Возврат ТабСвязанных;
КонецФункции

Функция ПолучитьДанныеПоЦенообразованиюАвторабот(ТипЦенРабот, Авторабота, Знач Модель, ДоговорВзаиморасчетов, Цех, ВидРемонта, ВалютаДокумента, КурсДокумента) Экспорт
	ДанныеПоЦенамРаботы = орПолучитьЦенуАвтоработы(ТипЦенРабот, Авторабота, Модель, ДоговорВзаиморасчетов, Цех, ВидРемонта, , ВалютаДокумента, КурсДокумента);
	
	//ТекСтрока.Нормочас=ЦенаРаботы.Нормочас;
	//ТекСтрока.Коэффициент=?(обЗначениеНеЗаполнено(ЦенаРаботы.НормаВремени),ТекСтрока.Коэффициент,ЦенаРаботы.НормаВремени);
	//ТекСтрока.Цена=ЦенаРаботы.Цена;
	Возврат ДанныеПоЦенамРаботы;
КонецФункции

Функция ПолучитьЦенуНоменклатуры(ТипЦен, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ПодразделениеКомпании, ВалютаДокумента, КурсДокумента) Экспорт
	
	ЦенаНоменклатура = обПолучитьЦену(ТипЦен, Номенклатура, ТекущаяДата(), , ВалютаДокумента, КурсДокумента, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ПодразделениеКомпании);

	Если ЦенаНоменклатура = 0 Тогда
		ЦенаНоменклатура = ПолучитьЦенуНоменклатурыПростоеВычисление(ТипЦен, Номенклатура);
	КонецЕсли;	
	
	Возврат ЦенаНоменклатура;
КонецФункции

Функция ПолучитьЦенуНоменклатурыПростоеВычисление(ТипЦен, Номенклатура)
	Цена = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЦеныСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.Цены.СрезПоследних(
		|			,
		|			Номенклатура = &Номенклатура
		|				И ТипЦен = &ТипЦен) КАК ЦеныСрезПоследних";	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ТипЦен", ТипЦен);	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();		
		Выборка.Следующий();
		
		Цена = Выборка.Цена;
	КонецЕсли;
	
	Возврат Цена;	
КонецФункции

Функция ОписаниеОрганизации(СписокСведений, Список = "", СПрефиксом = Истина) Экспорт

	Если ПустаяСтрока(Список) Тогда
		Список = "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет";
	КонецЕсли;

	Результат = "";

	СоответствиеПараметров = Новый Соответствие();
	СоответствиеПараметров.Вставить("ПолноеНаименование", " ");
	СоответствиеПараметров.Вставить("ИНН",                " ИНН ");
	СоответствиеПараметров.Вставить("КПП",                " КПП ");
	СоответствиеПараметров.Вставить("Свидетельство",			" ");
	СоответствиеПараметров.Вставить("СвидетельствоДатаВыдачи",	" от ");
	СоответствиеПараметров.Вставить("ЮридическийАдрес",   " ");
	СоответствиеПараметров.Вставить("ФактическийАдрес",   " ");
	СоответствиеПараметров.Вставить("Телефоны",           " тел.: ");
	СоответствиеПараметров.Вставить("НомерСчета",         " р/с ");
	СоответствиеПараметров.Вставить("Банк",               " в банке ");
	СоответствиеПараметров.Вставить("БИК",                " БИК ");
	СоответствиеПараметров.Вставить("КоррСчет",           " к/с ");
	СоответствиеПараметров.Вставить("КодПоОКПО",          " Код по ОКПО ");

	Список          = Список + ?(Прав(Список, 1) = ",", "", ",");
	ЧислоПараметров = СтрЧислоВхождений(Список, ",");

	Для Счетчик = 1 по ЧислоПараметров Цикл

		ПозЗапятой = Найти(Список, ",");

		Если ПозЗапятой > 0  Тогда
			ИмяПараметра = Лев(Список, ПозЗапятой - 1);
			Список = Сред(Список, ПозЗапятой + 1, СтрДлина(Список));

			Попытка
				СтрокаДополнения = "";
				СписокСведений.Свойство(ИмяПараметра, СтрокаДополнения);

				Если ПустаяСтрока(СтрокаДополнения) Тогда
					Продолжить;
				КонецЕсли;

				Префикс = СоответствиеПараметров[ИмяПараметра];
				Если Не ПустаяСтрока(Результат)  Тогда
					Результат = Результат + ",";
				КонецЕсли; 

				Результат = Результат + ?(СПрефиксом = Истина, Префикс, "") + СтрокаДополнения;
			Исключение
				#Если Клиент Тогда
					Сообщить("Не удалось определить значение параметра организации: " + ИмяПараметра, СтатусСообщения.Внимание);
				#КонецЕсли
			КонецПопытки;

		КонецЕсли;

	КонецЦикла;

	Возврат СокрЛП(Результат);

КонецФункции // ОписаниеОрганизации()

Функция ДанныеПоОрганизации(Организация) Экспорт
	Запрос	= Новый Запрос;
	Запрос.Текст	= 		
	"ВЫБРАТЬ
	|	Организации.НаименованиеПолное,
	|	Организации.ИНН,
	|	Организации.КПП,
	|	Организации.ОсновнойБанковскийСчет.Банк.Наименование КАК Банк,
	|	Организации.ОсновнойБанковскийСчет.Банк.Код КАК БИК,
	|	Организации.ОсновнойБанковскийСчет.Банк.КоррСчет КАК КоррСчет,
	|	Организации.Ссылка КАК Организация,
	|	Организации.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчета,
	|	Организации.КодПоОКПО
	|ПОМЕСТИТЬ ОрганизацияДанные
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Организации
	|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Организации).Ссылка
	|	КОНЕЦ КАК Организация,
	|	КонтактнаяИнформация.Представление КАК ТелефонОрганизации
	|ПОМЕСТИТЬ ОрганизацияТелефон
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Организация
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И КонтактнаяИнформация.ЗначениеПоУмолчанию
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Организации
	|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Организации).Ссылка
	|	КОНЕЦ КАК Организация,
	|	КонтактнаяИнформация.Представление КАК АдресЮридический
	|ПОМЕСТИТЬ ОрганизацияАдресЮр
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Организация
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЮридический)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Организации
	|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Организации).Ссылка
	|	КОНЕЦ КАК Организация,
	|	КонтактнаяИнформация.Представление КАК АдресФактический
	|ПОМЕСТИТЬ ОрганизацияАдресФакт
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Организация
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресФактический)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацияДанные.НаименованиеПолное КАК ПолноеНаименование,
	|	ОрганизацияДанные.ИНН КАК ИНН,
	|	ОрганизацияДанные.КПП КАК КПП,
	|	ОрганизацияДанные.КодПоОКПО КАК КодПоОКПО,
	|	ОрганизацияДанные.НомерСчета КАК НомерСчета,
	|	ОрганизацияДанные.Банк КАК Банк,
	|	ОрганизацияДанные.БИК КАК БИК,
	|	ОрганизацияДанные.КоррСчет КАК КоррСчет,
	|	ЕСТЬNULL(ОрганизацияТелефон.ТелефонОрганизации, """") КАК Телефоны,
	|	ЕСТЬNULL(ОрганизацияАдресЮр.АдресЮридический, """") КАК ЮридическийАдрес,
	|	ЕСТЬNULL(ОрганизацияАдресФакт.АдресФактический, """") КАК ФактическийАдрес
	|ИЗ
	|	ОрганизацияДанные КАК ОрганизацияДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОрганизацияАдресЮр КАК ОрганизацияАдресЮр
	|		ПО ОрганизацияДанные.Организация = ОрганизацияАдресЮр.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОрганизацияТелефон КАК ОрганизацияТелефон
	|		ПО ОрганизацияДанные.Организация = ОрганизацияТелефон.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОрганизацияАдресФакт КАК ОрганизацияАдресФакт
	|		ПО ОрганизацияДанные.Организация = ОрганизацияАдресФакт.Организация";
	Запрос.УстановитьПараметр("Организация", Организация);
	Результат = Запрос.Выполнить();	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	ДанныеОрганизации = Новый Структура("ПолноеНаименование, ИНН, КПП, КодПоОКПО, НомерСчета, Банк, БИК, КоррСчет, Телефоны, ЮридическийАдрес, ФактическийАдрес");
	
	ЗаполнитьЗначенияСвойств(ДанныеОрганизации, Выборка);
		
	Возврат ДанныеОрганизации;	
КонецФункции

Функция ДанныеПоКонтрагенту(Контрагент) Экспорт
	Запрос	= Новый Запрос;
	Запрос.Текст = 		
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	Контрагенты.НаименованиеПолное,
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.КодПоОКПО,
	|	Контрагенты.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчета,
	|	Контрагенты.ОсновнойБанковскийСчет.Банк.Наименование КАК Банк,
	|	Контрагенты.ОсновнойБанковскийСчет.Банк.Код КАК БИК,
	|	Контрагенты.ОсновнойБанковскийСчет.Банк.КоррСчет КАК КоррСчет
	|ПОМЕСТИТЬ КонтрагентДанные
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Контрагенты).Ссылка
	|	КОНЕЦ КАК Контрагент,
	|	КонтактнаяИнформация.Представление КАК ТелефонКонтрагент
	|ПОМЕСТИТЬ КонтрагентТелефон
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Контрагент
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И КонтактнаяИнформация.ЗначениеПоУмолчанию
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Контрагенты).Ссылка
	|	КОНЕЦ КАК Контрагент,
	|	КонтактнаяИнформация.Представление КАК АдресЮридический
	|ПОМЕСТИТЬ КонтрагентАдресЮр
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Контрагент
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЮридический)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Контрагенты).Ссылка
	|	КОНЕЦ КАК Контрагент,
	|	КонтактнаяИнформация.Представление КАК АдресФактический
	|ПОМЕСТИТЬ КонтрагентАдресФакт
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Контрагент
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресФактический)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтрагентДанные.НаименованиеПолное КАК ПолноеНаименование,
	|	КонтрагентДанные.ИНН КАК ИНН,
	|	КонтрагентДанные.КПП КАК КПП,
	|	КонтрагентДанные.КодПоОКПО КАК КодПоОКПО,
	|	КонтрагентДанные.НомерСчета КАК НомерСчета,
	|	КонтрагентДанные.Банк КАК Банк,
	|	КонтрагентДанные.БИК КАК БИК,
	|	КонтрагентДанные.КоррСчет КАК КоррСчет,
	|	ЕСТЬNULL(КонтрагентТелефон.ТелефонКонтрагент, """") КАК Телефоны,
	|	ЕСТЬNULL(КонтрагентАдресЮр.АдресЮридический, """") КАК ЮридическийАдрес,
	|	ЕСТЬNULL(КонтрагентАдресФакт.АдресФактический, """") КАК ФактическийАдрес
	|ИЗ
	|	КонтрагентДанные КАК КонтрагентДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентАдресФакт КАК КонтрагентАдресФакт
	|		ПО КонтрагентДанные.Контрагент = КонтрагентАдресФакт.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентАдресЮр КАК КонтрагентАдресЮр
	|		ПО КонтрагентДанные.Контрагент = КонтрагентАдресЮр.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентТелефон КАК КонтрагентТелефон
	|		ПО КонтрагентДанные.Контрагент = КонтрагентТелефон.Контрагент";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Результат = Запрос.Выполнить();	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	ДанныеКонтрагента = Новый Структура("ПолноеНаименование, ИНН, КПП, КодПоОКПО, НомерСчета, Банк, БИК, КоррСчет, Телефоны, ЮридическийАдрес, ФактическийАдрес");
	
	ЗаполнитьЗначенияСвойств(ДанныеКонтрагента, Выборка);
		
	Возврат ДанныеКонтрагента;		
КонецФункции

//К+
Процедура СформироватьДвиженияПоЗакрытиюВнутреннегоЗаказаПокупателя(ИсточникОбъект, Отказ, РежимПроведения) Экспорт
	Если НЕ Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ВключитьФункционалСписанияВнутреннихЗаказовПокупателя Тогда
		Возврат;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписаниеТоваровТовары.Номенклатура,
		|	СписаниеТоваровТовары.ХарактеристикаНоменклатуры,
		|	СУММА(ВЫБОР
		|			КОГДА ЕдиницыИзмерения.Коэффициент ЕСТЬ NULL 
		|					ИЛИ ЕдиницыИзмерения.Коэффициент = 0
		|				ТОГДА СписаниеТоваровТовары.Количество
		|			ИНАЧЕ СписаниеТоваровТовары.Количество * ЕдиницыИзмерения.Коэффициент
		|		КОНЕЦ) КАК Количество,
		|	СписаниеТоваровТовары.Ссылка,
		|	СписаниеТоваровТовары.Ссылка.СкладКомпании,
		|	СписаниеТоваровТовары.Ссылка.Дата
		|ПОМЕСТИТЬ ВТ_ТабЧастьТовары
		|ИЗ
		|	Документ.СписаниеТоваров.Товары КАК СписаниеТоваровТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		|		ПО СписаниеТоваровТовары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
		|ГДЕ
		|	СписаниеТоваровТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	СписаниеТоваровТовары.Номенклатура,
		|	СписаниеТоваровТовары.ХарактеристикаНоменклатуры,
		|	СписаниеТоваровТовары.Ссылка,
		|	СписаниеТоваровТовары.Ссылка.СкладКомпании,
		|	СписаниеТоваровТовары.Ссылка.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(Renault_СписанияВнутреннихЗаказовПокупателя.ЗаказПокупателя) КАК ЗаказПокупателя,
		|	Renault_СписанияВнутреннихЗаказовПокупателя.СписаниеТоваров
		|ПОМЕСТИТЬ ВТ_ЗаказыПокупателя
		|ИЗ
		|	РегистрСведений.Renault_СписанияВнутреннихЗаказовПокупателя КАК Renault_СписанияВнутреннихЗаказовПокупателя
		|ГДЕ
		|	Renault_СписанияВнутреннихЗаказовПокупателя.СписаниеТоваров = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Renault_СписанияВнутреннихЗаказовПокупателя.СписаниеТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТабЧастьТовары.Номенклатура,
		|	ВТ_ТабЧастьТовары.ХарактеристикаНоменклатуры,
		|	ВТ_ТабЧастьТовары.Количество,
		|	ВТ_ТабЧастьТовары.СкладКомпании,
		|	ВТ_ЗаказыПокупателя.ЗаказПокупателя,
		|	ВТ_ТабЧастьТовары.Дата
		|ПОМЕСТИТЬ ВТ_ДанныеДляСписания
		|ИЗ
		|	ВТ_ЗаказыПокупателя КАК ВТ_ЗаказыПокупателя
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТабЧастьТовары КАК ВТ_ТабЧастьТовары
		|		ПО ВТ_ЗаказыПокупателя.СписаниеТоваров = ВТ_ТабЧастьТовары.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказыПокупателейОстатки.Контрагент,
		|	ВЫБОР
		|		КОГДА ЗаказыПокупателейОстатки.Заказ ССЫЛКА Документ.ЗаказПокупателя
		|			ТОГДА ВЫРАЗИТЬ(ЗаказыПокупателейОстатки.Заказ КАК Документ.ЗаказПокупателя).Ссылка
		|	КОНЕЦ КАК Заказ,
		|	ЗаказыПокупателейОстатки.Номенклатура,
		|	ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры,
		|	ЗаказыПокупателейОстатки.СкладКомпании,
		|	ЗаказыПокупателейОстатки.ЗаказаноОстаток КАК Заказано,
		|	ЗаказыПокупателейОстатки.РезервОстаток КАК Резерв,
		|	ЗаказыПокупателейОстатки.РезервСвободныйОстаток КАК РезервСвободный,
		|	ЗаказыПокупателейОстатки.СуммаОстаток КАК Сумма,
		|	ЗаказыПокупателейОстатки.СуммаУпрОстаток КАК СуммаУпр
		|ПОМЕСТИТЬ ВТ_ОстаткиПоЗаказам
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей.Остатки(
		|			&МоментВремени,
		|			(Номенклатура, ХарактеристикаНоменклатуры, СкладКомпании, Заказ) В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					ВТ_ДанныеДляСписания.Номенклатура,
		|					ВТ_ДанныеДляСписания.ХарактеристикаНоменклатуры,
		|					ВТ_ДанныеДляСписания.СкладКомпании,
		|					ВТ_ДанныеДляСписания.ЗаказПокупателя
		|				ИЗ
		|					ВТ_ДанныеДляСписания КАК ВТ_ДанныеДляСписания)) КАК ЗаказыПокупателейОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОстаткиПоЗаказам.Контрагент КАК Контрагент,
		|	ВТ_ОстаткиПоЗаказам.Заказ КАК Заказ,
		|	ВТ_ОстаткиПоЗаказам.Номенклатура КАК Номенклатура,
		|	ВТ_ОстаткиПоЗаказам.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ОстаткиПоЗаказам.СкладКомпании КАК СкладКомпании,
		|	ВЫБОР
		|		КОГДА ВТ_ОстаткиПоЗаказам.Резерв > ВТ_ДанныеДляСписания.Количество
		|			ТОГДА ВТ_ДанныеДляСписания.Количество
		|		ИНАЧЕ ВТ_ОстаткиПоЗаказам.Заказано
		|	КОНЕЦ КАК Заказано,
		|	ВЫБОР
		|		КОГДА ВТ_ОстаткиПоЗаказам.Резерв > ВТ_ДанныеДляСписания.Количество
		|			ТОГДА ВТ_ДанныеДляСписания.Количество
		|		ИНАЧЕ ВТ_ОстаткиПоЗаказам.Резерв
		|	КОНЕЦ КАК Резерв,
		|	ВЫБОР
		|		КОГДА ВТ_ОстаткиПоЗаказам.РезервСвободный > ВТ_ДанныеДляСписания.Количество
		|			ТОГДА ВТ_ДанныеДляСписания.Количество
		|		ИНАЧЕ ВТ_ОстаткиПоЗаказам.РезервСвободный
		|	КОНЕЦ КАК РезервСвободный,
		|	ВЫБОР
		|		КОГДА ВТ_ОстаткиПоЗаказам.Заказано = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_ОстаткиПоЗаказам.Сумма * ВЫБОР
		|				КОГДА ВТ_ОстаткиПоЗаказам.Резерв > ВТ_ДанныеДляСписания.Количество
		|					ТОГДА ВТ_ДанныеДляСписания.Количество
		|				ИНАЧЕ ВТ_ОстаткиПоЗаказам.Заказано
		|			КОНЕЦ / ВТ_ОстаткиПоЗаказам.Заказано
		|	КОНЕЦ КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВТ_ОстаткиПоЗаказам.Заказано = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_ОстаткиПоЗаказам.СуммаУпр * ВЫБОР
		|				КОГДА ВТ_ОстаткиПоЗаказам.Резерв > ВТ_ДанныеДляСписания.Количество
		|					ТОГДА ВТ_ДанныеДляСписания.Количество
		|				ИНАЧЕ ВТ_ОстаткиПоЗаказам.Заказано
		|			КОНЕЦ / ВТ_ОстаткиПоЗаказам.Заказано
		|	КОНЕЦ КАК СуммаУпр,
		|	ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗакрытиеЗаказовПокупателей) КАК ХозОперация,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказов.ЗакрытиеЗаказа) КАК ВидОперации,
		|	ВТ_ДанныеДляСписания.Дата КАК Период
		|ИЗ
		|	ВТ_ДанныеДляСписания КАК ВТ_ДанныеДляСписания
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОстаткиПоЗаказам КАК ВТ_ОстаткиПоЗаказам
		|		ПО ВТ_ДанныеДляСписания.Номенклатура = ВТ_ОстаткиПоЗаказам.Номенклатура
		|			И ВТ_ДанныеДляСписания.ХарактеристикаНоменклатуры = ВТ_ОстаткиПоЗаказам.ХарактеристикаНоменклатуры
		|			И ВТ_ДанныеДляСписания.СкладКомпании = ВТ_ОстаткиПоЗаказам.СкладКомпании
		|			И ВТ_ДанныеДляСписания.ЗаказПокупателя = ВТ_ОстаткиПоЗаказам.Заказ"; 	
	Запрос.УстановитьПараметр("МоментВремени", ИсточникОбъект.МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", ИсточникОбъект.Ссылка);  	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Движения = ИсточникОбъект.Движения;
		Движения.ЗаказыПокупателей.Записывать = Истина;
		Движения.ЗаказыПокупателей.Очистить();
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Движение = Движения.ЗаказыПокупателей.ДобавитьРасход();
			ЗаполнитьЗначенияСвойств(Движение, Выборка); 
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры
//К-

