
#Область ПрограммныйИнтерфейс

Процедура СфомрироватьФайлУведомления(Форма, Документ, Действие) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Документ.Ссылка)
		ИЛИ Форма.Модифицированность Тогда
		Сообщить("Перед выполнением необходимо записать документ!");
		Возврат;
	КонецЕсли;
	
	Если Действие = "УведомлениеОбОстатках" Тогда
		СформироватьУведомлениеОбОстаткахПрослеживаемогоТовара(Документ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучениеКаталогаФайлов(ИмяФайла, Расширение = "xml", Фильтр = "(*.xml)|*.xml")
	
	Результат = Ложь;
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбора.Заголовок = "Сохранить файл ...";
	ДиалогВыбора.ПолноеИмяФайла = ИмяФайла;
	ДиалогВыбора.Расширение = Расширение;
	ДиалогВыбора.Фильтр = Фильтр;
	
	Если ДиалогВыбора.Выбрать()
		И НЕ ПустаяСтрока(ДиалогВыбора.ПолноеИмяФайла) Тогда
		ИмяФайла =  ДиалогВыбора.ПолноеИмяФайла;
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура СформироватьУведомлениеОбОстаткахПрослеживаемогоТовара(Документ)
	
	Если НЕ Документ.Организация.ФормаСобственности = Перечисления.ФормыСобственности.ЧастныйПредприниматель
		И НЕ Документ.Организация.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда
		Сообщить("Для данного вида организации нет возможности сделать выгрузку уведомления, т.к. не является юридическим лицом или индивидуальным предпринимателем!");
		Возврат;
	КонецЕсли;
	
	СтруктураОтбора=Новый Структура("Организация,Объект", Документ.Организация, Перечисления.ВидыОбъектовСведений.Руководитель);
	СтруктураСведений=РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(РабочаяДата,СтруктураОтбора);
	Руководитель=СтруктураСведений.Значение;
	
	Если НЕ ЗначениеЗаполнено(Руководитель) Тогда
		Сообщить("У организации не указан руководитель для подписания!");
		Возврат;
	КонецЕсли;
	
	ЭтоИП = Документ.Организация.ФормаСобственности = Перечисления.ФормыСобственности.ЧастныйПредприниматель;
	
	// Сформируем идентификатор данные
	КодНалоговогоОргана = Документ.Организация.КодИМНС;
	
	ИННКПП = СокрЛП(Документ.Организация.ИНН) + ?(ЭтоИП, "", СокрЛП(Документ.Организация.КПП));
	
	ИдентификаторФайла = СтрШаблон("ON_UVOSTTOV_%1_%1_%2_%3_%4",
		КодНалоговогоОргана, ИННКПП, Формат(ТекущаяДата(), "ДФ=yyyyMMdd"), Документ.Ссылка.УникальныйИдентификатор());
	
	ИмяФайла = ИдентификаторФайла;
	
	Если НЕ ПолучениеКаталогаФайлов(ИмяФайла) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.ОткрытьФайл(ИмяФайла, "windows-1251");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	// Данные о файле
	ЗаписьXML.ЗаписатьНачалоЭлемента("Файл");
	ЗаписьXML.ЗаписатьАтрибут("xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьАтрибут("ИдФайл", ИдентификаторФайла);
	ЗаписьXML.ЗаписатьАтрибут("ВерсПрог", "Альфа-Авто: Автосалон+Автосервис+Автозапчасти ПРОФ, редакция 5.1 " + Метаданные.Версия);
	ЗаписьXML.ЗаписатьАтрибут("ВерсФорм", "5.01");
	
	// Данные о документе уведомлении
	ЗаписьXML.ЗаписатьНачалоЭлемента("Документ");
	ЗаписьXML.ЗаписатьАтрибут("КНД", "1169011");
	ЗаписьXML.ЗаписатьАтрибут("НомУвед", дкПолучитьНомерДляПечати(Документ));
	ЗаписьXML.ЗаписатьАтрибут("ДатаУвед", Формат(Документ.Дата, "ДФ=dd.MM.yyyy"));
	ЗаписьXML.ЗаписатьАтрибут("НомКорр", "0");
	
	// Данные об организации
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвНП");
	
	Если ЭтоИП Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("СведИП");
		ЗаписьXML.ЗаписатьАтрибут("ИННФЛ", СокрЛП(Документ.Организация.ИНН));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	Иначе
		ЗаписьXML.ЗаписатьНачалоЭлемента("СведЮЛ");
		ЗаписьXML.ЗаписатьАтрибут("НаимОрг", обЗаменитьСпециальныеСимволыXML(СокрЛП(Документ.Организация.НаименованиеПолное)));
		ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", СокрЛП(Документ.Организация.ИНН));
		ЗаписьXML.ЗаписатьАтрибут("КПП", СокрЛП(Документ.Организация.КПП));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	// Подписант данных
	ЗаписьXML.ЗаписатьНачалоЭлемента("Подписант");
	ЗаписьXML.ЗаписатьАтрибут("ПрПодп", "1");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ФИО");
	МассивФИО = СтрРазделить(Руководитель.Наименование, " ");
	ЗаписьXML.ЗаписатьАтрибут("Фамилия", МассивФИО[0]);
	ЗаписьXML.ЗаписатьАтрибут("Имя", ?(МассивФИО.Количество() > 1, МассивФИО[1], ""));
	ЗаписьXML.ЗаписатьАтрибут("Отчество", ?(МассивФИО.Количество() > 2, МассивФИО[2], ""));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	// Товары
	НаименованиеТоваров = "";
	Если Документ.Товары.Количество() = 1 Тогда
		НаименованиеТоваров = СокрЛП(Документ.Товары[0].Номенклатура.Наименование);
	Иначе
		НаименованиеТоваров = СокрЛП(Документ.КодТНВЭД.Наименование);
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УведОстатТов");
	ЗаписьXML.ЗаписатьАтрибут("НаимПервичДок", Документ.ПервичныйДокумент.ХозОперация.Наименование);
	ЗаписьXML.ЗаписатьАтрибут("НомПервичДок", дкПолучитьНомерДляПечати( Документ.ПервичныйДокумент));
	ЗаписьXML.ЗаписатьАтрибут("ДатаПервичДок", Формат(Документ.Дата, "ДФ=dd.MM.yyyy"));
	ЗаписьXML.ЗаписатьАтрибут("НаимТовДок", НаименованиеТоваров);
	ЗаписьXML.ЗаписатьАтрибут("КодТНВЭД", СокрЛП(Документ.КодТНВЭД.Код));
	ЗаписьXML.ЗаписатьАтрибут("КолТоварДок", Формат(Документ.Товары.Итог("Количество"), "ЧЦ=18; ЧДЦ=6; ЧРД=.; ЧГ=0"));
	ЗаписьXML.ЗаписатьАтрибут("ЕдинИзмерДок", ?(ЗначениеЗаполнено(Документ.ЕдиницаИзмерения), Документ.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код, "796"));
	ЗаписьXML.ЗаписатьАтрибут("ЕдинИзмерКол", ?(ЗначениеЗаполнено(Документ.ЕдиницаИзмеренияПрослеживаемости), Документ.ЕдиницаИзмеренияПрослеживаемости.Код, "796"));
	ЗаписьXML.ЗаписатьАтрибут("КоличТоварКол", Формат(Документ.Товары.Итог("КоличествоПрослеживаемости"), "ЧЦ=18; ЧДЦ=6; ЧРД=.; ЧГ=0"));
	ЗаписьXML.ЗаписатьАтрибут("СтТоварБезНДС", Формат(Документ.Товары.Итог("Сумма"), "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0"));
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.Закрыть();
	Сообщить("Сформирован файл: " + ИмяФайла);
	
КонецПроцедуры

#КонецОбласти
