Перем НужноМенятьПодчиненные;

Процедура ПередЗаписью(Отказ)
	ИдентификаторДляЯрлыкаДляПроверки = ПривестиИдентификатор(ИдентификаторДляЯрлыка);
	
	Если Ссылка.ИдентификаторДляЯрлыка <> ИдентификаторДляЯрлыкаДляПроверки Тогда
		ИдентификаторДляЯрлыка = ИдентификаторДляЯрлыкаДляПроверки;
		Код = Владелец.Код + "-"+ИдентификаторДляЯрлыка;
	КонецЕсли;
	
	Если Ссылка.Код <> Код ИЛИ ПометкаУдаления Тогда
		НужноМенятьПодчиненные = истина;
	КонецЕсли;
КонецПроцедуры

Функция ПривестиИдентификатор(Идентификатор)
	Попытка 
		Идентификатор = Формат(Число(СокрЛП(Идентификатор)), "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0");
	Исключение
		Идентификатор = СокрЛП(Идентификатор);
	КонецПопытки;
	Возврат Идентификатор;
КонецФункции

Процедура ПриЗаписи(Отказ)
	Если НЕ ОТказ И НужноМенятьПодчиненные <> Неопределено И НужноМенятьПодчиненные  Тогда
		НачатьТранзакцию();
		Попытка
			ЗапросПодчиненных = Новый Запрос();
			ЗапросПодчиненных.Текст = "ВЫБРАТЬ
			                          |	ЯчейкиХранения.Ссылка
			                          |ИЗ
			                          |	Справочник.ЯчейкиХранения КАК ЯчейкиХранения
			                          |ГДЕ
			                          |	ЯчейкиХранения.Полка = &Полка";
			ЗапросПодчиненных.УстановитьПараметр("Полка", Ссылка);
			
			ВыборкаПодчиненных = ЗапросПодчиненных.Выполнить().Выбрать();
			Пока ВыборкаПодчиненных.Следующий() Цикл
				ПодчиненныйОбъект = ВыборкаПодчиненных.Ссылка.ПолучитьОбъект();
				ПодчиненныйОбъект.Код = Код + "-" + ПодчиненныйОбъект.НомерЯчейки;
				ПодчиненныйОбъект.ПометкаУдаления = ПодчиненныйОбъект.ПометкаУдаления ИЛИ ПометкаУдаления;
				ПодчиненныйОбъект.Записать();
			КонецЦикла;
		Исключение
			Сообщить(ОписаниеОшибки());
			ОтменитьТранзакцию();
			Отказ = истина;
			Сообщить("Не удалось изменить идентификатор для вложенных элементов. Смена имени полки невозможна");
			Возврат;
		КонецПопытки;
		ЗафиксироватьТранзакцию();
	КонецЕсли;
КонецПроцедуры