
&НаКлиенте
Процедура FILEКаталогОбменаИнформациейНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим);
	
	ДиалогОткрытия.Каталог = "";
	ДиалогОткрытия.МножественныйВыбор = Ложь;
	ДиалогОткрытия.Заголовок = "Выберите каталог";
	
	Если ДиалогОткрытия.Выбрать() Тогда
		Запись.FILEКаталогОбменаИнформацией = ДиалогОткрытия.Каталог;
	КонецЕсли	
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыДоступаВИнтернет(Команда)
	
	ОткрытьФорму("РегистрСведений.DMS_НастройкиТранспортаОбмена.Форма.ПараметрыПроксиСервера",,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("ЗаписатьИЗакрыть");
	Записать(ПараметрыЗаписи);
	
	Закрыть();
	
КонецПроцедуры

