

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	БазовыеЦвета= ЗначениеИзСтрокиВнутр(ЭтотОбъект.ПолучитьМакет("БазовыеЦвета").ПолучитьТекст());
	РедактируемыйЦвет = Новый Цвет(130, 170, 190); // Для примера!
	
КонецПроцедуры


&НаКлиенте
Процедура РедактируемыйЦветНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Результат = ВыбратьИзСписка(БазовыеЦвета, Элемент, БазовыеЦвета.НайтиПоЗначению(РедактируемыйЦвет));
	Если Результат <> Неопределено Тогда
		
		Если ТипЗнч(Результат.Значение) = Тип("Строка") Тогда
			ПараметрыФормы = Новый Структура("РедактируемыйЦвет", РедактируемыйЦвет);
			ОткрытьФормуМодально("ВнешняяОбработка.Цвета.Форма.ФормаВыбораУправляемая", ПараметрыФормы, Элементы.РедактируемыйЦвет);
		Иначе
			РедактируемыйЦвет = Результат.Значение;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйЦветОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Цвет") Тогда
		РедактируемыйЦвет = ВыбранноеЗначение;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры
