&НаСервере
Процедура ОбновитьСтруктуруНастроекВСпискеНаСервере()
	
//	ХранилищеОбщихНастроек.Удалить("ПомощникАвтобизнеса", "ФильтрОнлайнСтруктура",ПользователиИнформационнойБазы.ТекущийПользователь());
	ЗначениеНастроек = ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса", "ФильтрОнлайнСтруктура",,ПользователиИнформационнойБазы.ТекущийПользователь().Имя); 	
	
	Если ТипЗнч(ЗначениеНастроек) = Тип("Соответствие") Тогда		 	
		 Объект.ФильтрОнлайнВид = ЗначениеНастроек.Получить("ФильтрОнлайнВид");	 
		 Объект.ФильтрОнлайнКвоСтрок = ЗначениеНастроек.Получить("ФильтрОнлайнКвоСтрок");		 		
	 Иначе
		 Объект.ФильтрОнлайнВид = 1;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьСтруктуруНастроекВСпискеНаСервере();	
   
КонецПроцедуры


&НаСервере
Процедура СохранитьНастройкиФильтраОнлайнНаСервере()
	
	Настройки = Новый Соответствие;    
	Настройки.Вставить("ФильтрОнлайнВид", Объект.ФильтрОнлайнВид);
	Настройки.Вставить("ФильтрОнлайнКвоСтрок", Объект.ФильтрОнлайнКвоСтрок);
			 	
	ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса", "ФильтрОнлайнСтруктура", Настройки,,ПользователиИнформационнойБазы.ТекущийПользователь().Имя); //ОбщегоНазначения.
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьФильтр(Команда)   
   НастройкиВерны = Истина;
   
   Если (Объект.ФильтрОнлайнВид <> 1) И (Объект.ФильтрОнлайнКвоСтрок = 0) Тогда
	   НастройкиВерны = Ложь;
	   сообщить("Количество строк для данного вида фильтра не может быть равно нулю.");
   КонецЕсли;
      
   Если НастройкиВерны Тогда
	   Если Объект.ФильтрОнлайнВид = 1 Тогда
		   Объект.ФильтрОнлайнКвоСтрок = 0;
	   КонецЕсли;
	   
       СохранитьНастройкиФильтраОнлайнНаСервере();
       ЭтаФорма.Закрыть("ОК");
   КонецЕсли;
   
   
КонецПроцедуры
