


Процедура ПолучитьСписокСинонимовНажатие()
	Обработка=РеквизитФормыВЗначение("Объект");
	Обработка.ПолучитьСинонимы();
	УстановитьПривилегированныйРежим(Истина);
	
	Синонимы = ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","Синонимы",,"Администратор");	
	Если Синонимы <> Неопределено Тогда
		ТаблицаСинонимов.Загрузить(Синонимы);
	КонецЕсли;
	Элементы.ЗагрузитьСправочникСинонимов.Доступность = ТаблицаСинонимов.Количество() = 0;
	Элементы.ОсновныеДействияФормыВыполнить.Доступность = ТаблицаСинонимов.Количество() > 0;
	ИспользоватьСинонимы = ТаблицаСинонимов.Количество() > 0;
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
КонецПроцедуры

Процедура ТаблицаСинонимовПроизводительНачалоВыбора(Элемент, СтандартнаяОбработка)
	Если НЕ Метаданные.Справочники.Найти("ЗначенияСвойствОбъектов") = Неопределено Тогда
		Если ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") Тогда
			СсылкаПСО = СвойствоПроизводитель();
			СтандартнаяОбработка = Ложь;
			Форма = Справочники.ЗначенияСвойствОбъектов.ПолучитьФормуВыбора();
			Форма.Отбор.Владелец.Значение = СсылкаПСО;
			Форма.Отбор.Владелец.Использование = Истина;
			Форма.Отбор.Владелец.ВидСравнения=ВидСравнения.Равно;
			Значение = Форма.ОткрытьМодально();
			Если ЗначениеЗаполнено(Значение) Тогда
				Элемент.Значение = Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция СвойствоПроизводитель()
	Запрос=Новый Запрос(
	"ВЫБРАТЬ
	|	СвойстваОбъектов.Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектов
	|ГДЕ
	|	СвойстваОбъектов.Наименование = &Наименование
	|	И СвойстваОбъектов.НазначениеСвойства = &НазначениеСвойства");
	Запрос.УстановитьПараметр("Наименование","Производитель");
	Запрос.УстановитьПараметр("НазначениеСвойства",ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
	Выб=Запрос.Выполнить().Выбрать();
	Выб.Следующий();
	Возврат Выб.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии()
	
	
	ПолучитьИзХранилища();	
	
	
	//Если ТаблицаСинонимов.Количество() > 0 Тогда
	Элементы.ЗагрузитьСправочникСинонимов.Доступность = ТаблицаСинонимов.Количество() = 0;
	Элементы.ОсновныеДействияФормыВыполнить.Доступность = ТаблицаСинонимов.Количество() > 0;	
	//КонецЕсли;
	Данные=ПолучитьДанные();
	Если ТипЗнч(Данные)=Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Объект,Данные);
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьДанные()
	УстановитьПривилегированныйРежим(Истина);
	Данные = ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","ОбъектMySQL");
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	Возврат Данные;
КонецФункции

Процедура ПолучитьИзХранилища()
	УстановитьПривилегированныйРежим(Истина);
	Синонимы = ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","Синонимы",,"Администратор");
	Если Синонимы <> Неопределено Тогда
		
		ТаблицаСинонимов.Загрузить( Синонимы);
	Иначе
		Синонимы = Новый ТаблицаЗначений;
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.Производители"));
		Синонимы.Колонки.Добавить("Производитель",Новый ОписаниеТипов(Массив));
		Синонимы.Колонки.Добавить("Бренд");
		Синонимы.Колонки.Добавить("Синоним");
		ТаблицаСинонимов.Загрузить( Синонимы);
		
	КонецЕсли;
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса","Синонимы",ТаблицаСинонимов.Выгрузить(),,"Администратор");	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроизводителейИСинонимов() Экспорт
	
	//УстановитьПривилегированныйРежим(Истина);
	//ТаблицаСинонимов = ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","Синонимы",,"Администратор");
	//
	//Если ПривилегированныйРежим() Тогда
	//	УстановитьПривилегированныйРежим(Ложь);
	//КонецЕсли;
	
	Пустая=Справочники.Номенклатура.ПустаяСсылка();
	Реквизиты=Пустая.Метаданные().Реквизиты;
	Естьор_Производитель=Реквизиты.Найти("ор_Производитель")<>Неопределено;
	ЕстьПроизводитель=НЕ Естьор_Производитель И Реквизиты.Найти("Производитель")<>Неопределено;
	ЕстьСвойства=Метаданные.Справочники.Найти("ЗначенияСвойствОбъектов")<>Неопределено 
	И Метаданные.ПланыВидовХарактеристик.Найти("СвойстваОбъектов")<>Неопределено;
	Естьор_Поставщик=Реквизиты.Найти("Поставщик")<>Неопределено;
	ЕстьПоставщик=Не Естьор_Поставщик И Реквизиты.Найти("Поставщик")<>Неопределено;
	Если Естьор_Производитель Тогда
		ПроизводительРекв="ор_Производитель";
		ПроизводителиСпр=Пустая.ор_Производитель.Метаданные().Имя;
	ИначеЕсли ЕстьПроизводитель Тогда
		ПроизводительРекв="Производитель";
		ПроизводителиСпр=Пустая.Производитель.Метаданные().Имя;
	ИначеЕсли Естьор_Поставщик Тогда
		ПроизводительРекв="Поставщик";
		ПроизводителиСпр=Пустая.Поставщик.Метаданные().Имя;
	Иначе
		ЕстьСвойства=Метаданные.Справочники.Найти("ЗначенияСвойствОбъектов")<>Неопределено 
		И Метаданные.ПланыВидовХарактеристик.Найти("СвойстваОбъектов")<>Неопределено;
		
	КонецЕсли;
	Таблица = ТаблицаСинонимов.Выгрузить();
	Если Естьор_Производитель ИЛИ ЕстьПроизводитель ИЛИ Естьор_Поставщик Тогда
		//Для Каждого Стр из ТаблицаСинонимов Цикл
		//	Стр.Производитель = ПроизводителиСпр.ПустаСсылка();
		//КонецЦикла;
		// Ищем производителя
		Запрос=Новый Запрос(
		"ВЫБРАТЬ
		|	Производители.Ссылка
		|ИЗ
		|	Справочник."+ПроизводителиСпр+" КАК Производители
		|Где
		|   Производители.ПометкаУдаления = ЛОЖЬ
		|	И НЕ Производители.Ссылка В (&Ссылка)");
		Запрос.УстановитьПараметр("Ссылка",Таблица.ВыгрузитьКолонку("Производитель"));
		
		//Выб=Запрос.Выполнить().Выбрать();
		//
		//Пока Выб.Следующий() Цикл
		//	Масс = ТаблицаСинонимов.НайтиСтроки(Новый Структура("Синоним",ВРег(Выб.Ссылка.Наименование)));
		//	Если Масс.Количество() > 0 Тогда
		//		Если ЗначениеЗаполнено(Масс[0].Производитель) Тогда
		//			Ответ = Вопрос(Выб.Ссылка.Наименование+" и "+Масс[0].Производитель.Наименование+" являются синонимами? Если ""ДА"" тогда"+" "+Выб.Ссылка.Наименование+" будет помечен на удаление.",РежимДиалогаВопрос.ДаНет);
		//			Если Ответ = КодВозвратаДиалога.Нет Тогда
		//				Масс[0].Производитель = Выб.Ссылка;
		//			ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
		//				Об = Выб.Ссылка.ПолучитьОбъект();
		//				Об.ПометкаУдаления = Истина;
		//				Об.Записать();
		//			КонецЕсли;	
		//		Иначе
		//			Бренд = Масс[0].Бренд;
		//			Масс1 = ТаблицаСинонимов.НайтиСтроки(Новый Структура("Бренд",Масс[0].Бренд));
		//			Для Каждого Стр Из Масс1 Цикл
		//				Стр.Производитель = Выб.Ссылка;
		//			КонецЦикла;
		//		КонецЕсли;
		//	Иначе
		//		Стр = ТаблицаСинонимов.Добавить();
		//		Стр.Производитель = Выб.Ссылка;
		//		Стр.Синоним = ВРег(Выб.Ссылка.Наименование);
		//	КонецЕсли;
		//КонецЦикла;
	ИначеЕсли ЕстьСвойства Тогда
		СсылкаПСО = СвойствоПроизводитель(); //ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Производитель",Истина);
		Если НЕ(СсылкаПСО = Неопределено ИЛИ СсылкаПСО.Пустая()) Тогда
			//Для Каждого Стр из ТаблицаСинонимов Цикл
			//	Стр.Производитель = Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка();
			//КонецЦикла;
			Запрос=Новый Запрос(
			"ВЫБРАТЬ
			|	ЗначенияСвойствОбъектов.Ссылка
			|ИЗ
			|	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
			|ГДЕ
			|	ЗначенияСвойствОбъектов.Владелец = &Владелец
			|	И ЗначенияСвойствОбъектов.ПометкаУдаления = ЛОЖЬ
			|	И НЕ ЗначенияСвойствОбъектов.Ссылка В (&Ссылка)");
			Запрос.УстановитьПараметр("Владелец",ССылкаПСО);
			Запрос.УстановитьПараметр("Ссылка",Таблица.ВыгрузитьКолонку("Производитель"));
			//Выб=Запрос.Выполнить().Выбрать();
			//Пока Выб.Следующий() Цикл
			//	Масс = ТаблицаСинонимов.НайтиСтроки(Новый Структура("Синоним",Выб.Ссылка.Наименование));
			//	Если Масс.Количество() > 0 Тогда
			//		Если ЗначениеЗаполнено(Масс[0].Производитель) Тогда
			//			Ответ = Вопрос(Выб.Ссылка.Наименование+" и "+Масс[0].Производитель.Наименование+" являются синонимами? Если ""ДА"" тогда"+" "+Выб.Ссылка.Наименование+" будет помечен на удаление.",РежимДиалогаВопрос.ДаНет);
			//			Если Ответ = КодВозвратаДиалога.Нет Тогда
			//				Масс[0].Производитель = Выб.Ссылка;
			//			ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
			//				Об = Выб.Ссылка.ПолучитьОбъект();
			//				Об.ПометкаУдаления = Истина;
			//				Об.Записать();
			//			КонецЕсли;	
			//		Иначе
			//			Бренд = Масс[0].Бренд;
			//			Масс1 = ТаблицаСинонимов.НайтиСтроки(Новый Структура("Бренд",Масс[0].Бренд));
			//			Для Каждого Стр Из Масс1 Цикл
			//				Стр.Производитель = Выб.Ссылка;
			//			КонецЦикла;
			//		КонецЕсли;
			//	Иначе
			//		Стр = ТаблицаСинонимов.Добавить();
			//		Стр.Производитель = Выб.Ссылка;
			//		Стр.Синоним = ВРег(Выб.Ссылка.Наименование);
			//	КонецЕсли;
			//КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаПроизводителей.Загрузить( Запрос.Выполнить().Выгрузить());
		
	
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСправочникСинонимов(Команда)
	ПолучитьСписокСинонимовНажатие()
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеДействияФормыВыполнить(Команда)
	Таблицапроизводителей.Очистить();
	ОбработкаПроизводителейИСинонимов();
	Режим = РежимДиалогаВопрос.ДаНет;
	
		
	Для Каждого Выб из ТаблицаПроизводителей Цикл
		Масс = ТаблицаСинонимов.НайтиСтроки(Новый Структура("Синоним",Строка(Выб.Ссылка)));
		Если Масс.Количество() > 0 Тогда
			Если ЗначениеЗаполнено(Масс[0].Производитель) Тогда
				Текст = Строка(Выб.Ссылка)+" и "+Строка(Масс[0].Производитель)+" являются синонимами? Если ""ДА"" тогда"+" "+Строка(Выб.Ссылка)+" будет помечен на удаление."; 
				Ответ = Вопрос(Текст,Режим);
				Если Ответ = КодВозвратаДиалога.Нет Тогда
					Масс[0].Производитель = Выб.Ссылка;
				ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
					ПометитьНаУдаление(Выб.Ссылка);
					
				КонецЕсли;	
			Иначе
				Бренд = Масс[0].Бренд;
				Масс1 = ТаблицаСинонимов.НайтиСтроки(Новый Структура("Бренд",Масс[0].Бренд));
				Для Каждого Стр Из Масс1 Цикл
					Стр.Производитель = Выб.Ссылка;
				КонецЦикла;
			КонецЕсли;
		Иначе
			Стр = ТаблицаСинонимов.Добавить();
			Стр.Производитель = Выб.Ссылка;
			Стр.Синоним = ВРег(Строка(Выб.Ссылка));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПометитьНаУдаление(Ссылка)
	Об = Ссылка.ПолучитьОбъект();
	Об.ПометкаУдаления = Истина;
	Об.Записать();
КонецПроцедуры



&НаКлиенте
Процедура ПередЗакрытием1(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ВладелецФормы.Объект.ИспользоватьСинонимы = Объект.ИспользоватьСинонимы;
	ПередЗакрытием(Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСинонимовПроизводительПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСинонимовВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСинонимовПриИзменении(Элемент)
	Производитель(Элемент.ТекущиеДанные.Производитель);
	
КонецПроцедуры

Процедура Производитель(Элемент)
	Если НЕ ТипЗнч(Элемент) = Тип("СправочникСсылка.Производители") Тогда
		Элемент = Справочники.Производители.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры




