	
Функция АвтомобильЗаблокирован(Автомобиль) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_ЗаблокированныеАвтомобилиСрезПоследних.Автомобиль.Ссылка
	               |ИЗ
	               |	РегистрСведений.Renault_ЗаблокированныеАвтомобили.СрезПоследних КАК Renault_ЗаблокированныеАвтомобилиСрезПоследних
	               |ГДЕ
	               |	Renault_ЗаблокированныеАвтомобилиСрезПоследних.Заблокирован = ИСТИНА
	               |	И Renault_ЗаблокированныеАвтомобилиСрезПоследних.Автомобиль = &Автомобиль";
				   
				   Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
				   
				   Выборка = Запрос.Выполнить().Выбрать();
				   
				   Если Выборка.Следующий() Тогда
					   
					   Возврат Истина;
					   
				   Иначе
					   
					   Возврат Ложь;
					   
				КонецЕсли;
	
КонецФункции
	
Функция КонтрагентЗаблокирован(Контрагент) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_ЗаблокированныеКонтрагентыСрезПоследних.Контрагент
	               |ИЗ
	               |	РегистрСведений.Renault_ЗаблокированныеКонтрагенты.СрезПоследних(, ) КАК Renault_ЗаблокированныеКонтрагентыСрезПоследних
	               |ГДЕ
	               |	Renault_ЗаблокированныеКонтрагентыСрезПоследних.Заблокирован = ИСТИНА
	               |	И Renault_ЗаблокированныеКонтрагентыСрезПоследних.Контрагент = &Контрагент";
				   
				   Запрос.УстановитьПараметр("Контрагент", Контрагент);
				   
				   Выборка = Запрос.Выполнить().Выбрать();
				   
				   Если Выборка.Следующий() Тогда
					   
					   Возврат Истина;
					   
				   Иначе
					   
					   Возврат Ложь;
					   
				КонецЕсли;
	
КонецФункции

//Козлов Е.А Начало 21.07.2016

Функция ПолучитьВалютуРегУчета() Экспорт
	Возврат Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
КонецФункции

////Обработчики событий документа ЗаказНаряд для Advanced

Процедура ПриКопированииЗаказНаряда(ИсточникОбъект, ОбъектКопирования) Экспорт
	ИсточникОбъект.Автор = ПараметрыСеанса.Пользователь;
	
	ИсточникОбъект.ДатаНачала = "";
	ИсточникОбъект.ДатаЗакрытия = "";	
КонецПроцедуры

Процедура ОбработкаЗаполненияЗаказНаряда(ИсточникОбъект, Основание) Экспорт
КонецПроцедуры

Процедура ПередУдалениемЗаказНаряда(ИсточникОбъект, Отказ) Экспорт
КонецПроцедуры 


//Процедура ОткрытиеАльтернативнойФормыЗаказНаряда(ДокументОбъект, ВидФормы, Параметры = Неопределено) Экспорт
//	Если ВидФормы = "ФормаДокумента" Тогда
//		Форма = Обработки.Renault_Advanced_ЗаказНаряд.ПолучитьФорму("ФормаДокумента");
//		Форма.ДокументОбъект = ДокументОбъект;
//		Если ЗначениеЗаполнено(Параметры) Тогда
//			Форма.ОбъектКопирования = Параметры;
//		КонецЕсли;
//		Форма.Открыть();
//	КонецЕсли;	
//КонецПроцедуры

#Если Клиент Тогда
Процедура ОткрытиеАльтернативнойФормыСпискаЗаказНаряда(ВидФормы, Владелец = Неопределено) Экспорт
	Если ВидФормы = "ФормаСпискаУпр" Тогда
		Форма = ПолучитьФорму("Обработка.Renault_Advanced_ЗаказНаряд.Форма.ФормаСпискаУпр"); 				
	ИначеЕсли ВидФормы = "ФормаВыбораУпр" Тогда
		Форма = ПолучитьФорму("Обработка.Renault_Advanced_ЗаказНаряд.Форма.ФормаВыбораУпр", , Владелец);
	КонецЕсли;
	
	Форма.Открыть();
КонецПроцедуры
#КонецЕсли

Функция ПолучитьКлючСвязиСРаботой(Работы, Запчасть) Экспорт

	КлючСвязи = Неопределено;
	
	Если Работы.Количество() > 0 Тогда
		СписокРабот = Новый Массив;
		
		Для Каждого СтрокаРабот Из Работы Цикл
			СписокРабот.Добавить(СтрокаРабот.Работа);
		КонецЦикла;	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	СвязанныеРаботы.Авторабота КАК Работа
			|ИЗ
			|	РегистрСведений.СвязанныеРаботы КАК СвязанныеРаботы
			|ГДЕ
			|	СвязанныеРаботы.Авторабота В(&СписокРабот)
			|	И СвязанныеРаботы.СвязаннаяРабота = &Запчасть";		
		Запрос.УстановитьПараметр("Запчасть", Запчасть);
		Запрос.УстановитьПараметр("СписокРабот", СписокРабот);   		
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			
			Работа = Выборка.Работа;
			
			Для Каждого СтрокаРабот Из Работы Цикл
				Если СтрокаРабот.Работа = Работа Тогда
					КлючСвязи = СтрокаРабот.КлючСвязи;
					Прервать;
				КонецЕсли;				
			КонецЦикла; 			
		КонецЕсли;		
	КонецЕсли;
	
	Возврат КлючСвязи;
КонецФункции

Процедура ЗаполнитьДанныеДокументаЗаказНарядДляСтатистики(СправочникДанных, ЗаказНарядОбъект) Экспорт
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Renault_Advanced_ДанныеЗаказНарядаЗапчасти.НомерСтроки КАК НомерСтроки,
	//	|	Renault_Advanced_ДанныеЗаказНарядаЗапчасти.Номенклатура КАК Номенклатура,
	//	|	Renault_Advanced_ДанныеЗаказНарядаЗапчасти.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//	|	Renault_Advanced_ДанныеЗаказНарядаЗапчасти.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//	|	Renault_Advanced_ДанныеЗаказНарядаЗапчасти.Коэффициент КАК Коэффициент,
	//	|	Renault_Advanced_ДанныеЗаказНарядаЗапчасти.Количество КАК Количество,
	//	|	Renault_Advanced_ДанныеЗаказНарядаЗапчасти.Цена КАК Цена,
	//	|	Renault_Advanced_ДанныеЗаказНарядаЗапчасти.СтавкаНДС КАК СтавкаНДС,
	//	|	Renault_Advanced_ДанныеЗаказНарядаЗапчасти.СуммаНДС КАК СуммаНДС,
	//	|	Renault_Advanced_ДанныеЗаказНарядаЗапчасти.Сумма КАК СуммаВсего,
	//	|	Renault_Advanced_ДанныеЗаказНарядаЗапчасти.Сумма + Renault_Advanced_ДанныеЗаказНарядаЗапчасти.Цена * Renault_Advanced_ДанныеЗаказНарядаЗапчасти.Количество * Renault_Advanced_ДанныеЗаказНарядаЗапчасти.РезультирующаяСкидка / 100 КАК Сумма,
	//	|	Renault_Advanced_ДанныеЗаказНарядаЗапчасти.РезультирующаяСкидка КАК ПроцентСкидкиСтроки,
	//	|	Renault_Advanced_ДанныеЗаказНарядаЗапчасти.Цена * Renault_Advanced_ДанныеЗаказНарядаЗапчасти.Количество * Renault_Advanced_ДанныеЗаказНарядаЗапчасти.РезультирующаяСкидка / 100 КАК СуммаСкидкиСтроки,
	//	|	Renault_Advanced_ДанныеЗаказНарядаЗапчасти.Ссылка.СкладГруппа КАК СкладКомпании
	//	|ПОМЕСТИТЬ ДанныеПоЗапчастям
	//	|ИЗ
	//	|	Справочник.Renault_Advanced_ДанныеЗаказНаряда.Запчасти КАК Renault_Advanced_ДанныеЗаказНарядаЗапчасти
	//	|ГДЕ
	//	|	Renault_Advanced_ДанныеЗаказНарядаЗапчасти.Ссылка = &СправочникДанных
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	Renault_Advanced_ДанныеЗаказНарядаЗапчастиКлиента.НомерСтроки КАК НомерСтроки,
	//	|	Renault_Advanced_ДанныеЗаказНарядаЗапчастиКлиента.Номенклатура КАК Номенклатура,
	//	|	Renault_Advanced_ДанныеЗаказНарядаЗапчастиКлиента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//	|	Renault_Advanced_ДанныеЗаказНарядаЗапчастиКлиента.ЕдиницаИзмерения.Коэффициент КАК Коэффициент,
	//	|	Renault_Advanced_ДанныеЗаказНарядаЗапчастиКлиента.Количество КАК Количество
	//	|ПОМЕСТИТЬ ДанныеПоЗапчастямКлиента
	//	|ИЗ
	//	|	Справочник.Renault_Advanced_ДанныеЗаказНаряда.ЗапчастиКлиента КАК Renault_Advanced_ДанныеЗаказНарядаЗапчастиКлиента
	//	|ГДЕ
	//	|	Renault_Advanced_ДанныеЗаказНарядаЗапчастиКлиента.Ссылка = &СправочникДанных
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	Renault_Advanced_ДанныеЗаказНарядаРаботы.НомерСтроки КАК НомерСтроки,
	//	|	Renault_Advanced_ДанныеЗаказНарядаРаботы.Работа КАК Работа,
	//	|	Renault_Advanced_ДанныеЗаказНарядаРаботы.ЦенаНормоЧаса КАК Цена,
	//	|	Renault_Advanced_ДанныеЗаказНарядаРаботы.Количество КАК Количество,
	//	|	Renault_Advanced_ДанныеЗаказНарядаРаботы.ОбъемРаботы КАК Коэффициент,
	//	|	Renault_Advanced_ДанныеЗаказНарядаРаботы.Сумма + Renault_Advanced_ДанныеЗаказНарядаРаботы.Цена * Renault_Advanced_ДанныеЗаказНарядаРаботы.Количество * Renault_Advanced_ДанныеЗаказНарядаРаботы.РезультирующаяСкидка / 100 КАК Сумма,
	//	|	Renault_Advanced_ДанныеЗаказНарядаРаботы.СтавкаНДС КАК СтавкаНДС,
	//	|	Renault_Advanced_ДанныеЗаказНарядаРаботы.СуммаНДС КАК СуммаНДС,
	//	|	Renault_Advanced_ДанныеЗаказНарядаРаботы.Сумма КАК СуммаВсего,
	//	|	Renault_Advanced_ДанныеЗаказНарядаРаботы.РезультирующаяСкидка КАК ПроцентСкидкиСтроки,
	//	|	Renault_Advanced_ДанныеЗаказНарядаРаботы.Цена * Renault_Advanced_ДанныеЗаказНарядаРаботы.Количество * Renault_Advanced_ДанныеЗаказНарядаРаботы.РезультирующаяСкидка / 100 КАК СуммаСкидкиСтроки,
	//	|	""00000000-0000-0000-0000-000000000000"" КАК ИдентификаторРаботы,
	//	|	Renault_Advanced_ДанныеЗаказНарядаРаботы.КлючСвязи КАК КлючСвязи,
	//	|	ЗНАЧЕНИЕ(Справочник.Нормочасы.Рубль) КАК Нормочас
	//	|ПОМЕСТИТЬ ДанныеПоРаботам
	//	|ИЗ
	//	|	Справочник.Renault_Advanced_ДанныеЗаказНаряда.Работы КАК Renault_Advanced_ДанныеЗаказНарядаРаботы
	//	|ГДЕ
	//	|	Renault_Advanced_ДанныеЗаказНарядаРаботы.Ссылка = &СправочникДанных
	//	|
	//	|ИНДЕКСИРОВАТЬ ПО
	//	|	КлючСвязи
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	Renault_Advanced_ДанныеЗаказНарядаИсполнители.КлючСвязи КАК КлючСвязи,
	//	|	ЕСТЬNULL(Цеха.Ссылка, ЗНАЧЕНИЕ(Справочник.Цеха.ПустаяСсылка)) КАК Цех,
	//	|	СУММА(Renault_Advanced_ДанныеЗаказНарядаИсполнители.ФактическаяДлительностьРабот) КАК ФактическаяДлительностьРабот,
	//	|	МАКСИМУМ(""00000000-0000-0000-0000-000000000000"") КАК ИдентификаторРаботы,
	//	|	Renault_Advanced_ДанныеЗаказНарядаИсполнители.Исполнитель.Сотрудник КАК Исполнитель
	//	|ПОМЕСТИТЬ ДанныеПоИсполнителям
	//	|ИЗ
	//	|	Справочник.Renault_Advanced_ДанныеЗаказНаряда.Исполнители КАК Renault_Advanced_ДанныеЗаказНарядаИсполнители
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Цеха КАК Цеха
	//	|		ПО Renault_Advanced_ДанныеЗаказНарядаИсполнители.Ссылка.СкладРемзоны = Цеха.СкладКомпании
	//	|ГДЕ
	//	|	Renault_Advanced_ДанныеЗаказНарядаИсполнители.Ссылка = &СправочникДанных
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	Renault_Advanced_ДанныеЗаказНарядаИсполнители.Исполнитель.Сотрудник,
	//	|	Renault_Advanced_ДанныеЗаказНарядаИсполнители.КлючСвязи,
	//	|	ЕСТЬNULL(Цеха.Ссылка, ЗНАЧЕНИЕ(Справочник.Цеха.ПустаяСсылка))
	//	|
	//	|ИНДЕКСИРОВАТЬ ПО
	//	|	КлючСвязи
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВЫБОР
	//	|		КОГДА Renault_Advanced_ДанныеЗаказНаряда.СтатусЗаказНаряда В (ЗНАЧЕНИЕ(Справочник.Renault_Advanced_СтатусыЗаказНарядов.ВОжиданииЗапчастей), ЗНАЧЕНИЕ(Справочник.Renault_Advanced_СтатусыЗаказНарядов.ВРаботе), ЗНАЧЕНИЕ(Справочник.Renault_Advanced_СтатусыЗаказНарядов.ВРемзоне), ЗНАЧЕНИЕ(Справочник.Renault_Advanced_СтатусыЗаказНарядов.ПредварительнаяЗапись))
	//	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.ВРаботе)
	//	|		КОГДА Renault_Advanced_ДанныеЗаказНаряда.СтатусЗаказНаряда = ЗНАЧЕНИЕ(Справочник.Renault_Advanced_СтатусыЗаказНарядов.Выполнен)
	//	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.ВРаботе)
	//	|		КОГДА Renault_Advanced_ДанныеЗаказНаряда.СтатусЗаказНаряда = ЗНАЧЕНИЕ(Справочник.Renault_Advanced_СтатусыЗаказНарядов.Закрыт)
	//	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.ВРаботе)
	//	|		КОГДА Renault_Advanced_ДанныеЗаказНаряда.СтатусЗаказНаряда В (ЗНАЧЕНИЕ(Справочник.Renault_Advanced_СтатусыЗаказНарядов.ОткрытЗаявка), ЗНАЧЕНИЕ(Справочник.Renault_Advanced_СтатусыЗаказНарядов.ЗакрытЗаявка), ЗНАЧЕНИЕ(Справочник.Renault_Advanced_СтатусыЗаказНарядов.Аннулирован), ЗНАЧЕНИЕ(Справочник.Renault_Advanced_СтатусыЗаказНарядов.АннулированЗаявка))
	//	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Заявка)
	//	|		КОГДА Renault_Advanced_ДанныеЗаказНаряда.СтатусЗаказНаряда В (ЗНАЧЕНИЕ(Справочник.Renault_Advanced_СтатусыЗаказНарядов.Открыт), ЗНАЧЕНИЕ(Справочник.Renault_Advanced_СтатусыЗаказНарядов.СогласованиеССК))
	//	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.НачатьРаботу)
	//	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.ПустаяСсылка)
	//	|	КОНЕЦ КАК Состояние,
	//	|	Renault_Advanced_ДанныеЗаказНаряда.ВидОбслуживания.ВидРемонта КАК ВидРемонта,
	//	|	ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд) КАК ХозОперация,
	//	|	ВЫБОР
	//	|		КОГДА Renault_Advanced_ДанныеЗаказНаряда.ВидОплаты = ЗНАЧЕНИЕ(Справочник.Renault_Advanced_ВидыВзаиморасчетов.Безналичный)
	//	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.БезналичныйРасчет)
	//	|		КОГДА Renault_Advanced_ДанныеЗаказНаряда.ВидОплаты = ЗНАЧЕНИЕ(Справочник.Renault_Advanced_ВидыВзаиморасчетов.Наличный)
	//	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.НаличныйРасчет)
	//	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.ПроизвольнаяОплата)
	//	|	КОНЕЦ КАК ВидОплаты,
	//	|	Renault_Advanced_ДанныеЗаказНаряда.ЗаказНаряд.Автор.Сотрудник КАК Менеджер,
	//	|	Renault_Advanced_ДанныеЗаказНаряда.ЗаполненМастером.Сотрудник КАК Мастер,
	//	|	Renault_Advanced_ДанныеЗаказНаряда.ЗаполненДиспетчером.Сотрудник КАК Диспетчер,
	//	|	Renault_Advanced_ДанныеЗаказНаряда.ЗаказНаряд.ТипЦен КАК ТипЦенРабот,
	//	|	Renault_Advanced_ДанныеЗаказНаряда.ЗаказНаряд.Контрагент КАК Заказчик,
	//	|	Renault_Advanced_ДанныеЗаказНаряда.ВидОбслуживания КАК ВидОбслуживания
	//	|ИЗ
	//	|	Справочник.Renault_Advanced_ДанныеЗаказНаряда КАК Renault_Advanced_ДанныеЗаказНаряда
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыРемонта КАК ВидыРемонта
	//	|		ПО Renault_Advanced_ДанныеЗаказНаряда.ОсновныеРаботы.Наименование = ВидыРемонта.Наименование
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
	//	|		ПО Renault_Advanced_ДанныеЗаказНаряда.ЗаказНаряд = Renault_CRM_ЗаявкаНаСервис.ЗаказНаряд
	//	|			И (НЕ Renault_CRM_ЗаявкаНаСервис.ПометкаУдаления)
	//	|ГДЕ
	//	|	Renault_Advanced_ДанныеЗаказНаряда.Ссылка = &СправочникДанных
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ДанныеПоЗапчастям.НомерСтроки КАК НомерСтроки,
	//	|	ДанныеПоЗапчастям.Номенклатура КАК Номенклатура,
	//	|	ДанныеПоЗапчастям.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//	|	ДанныеПоЗапчастям.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//	|	ДанныеПоЗапчастям.Коэффициент КАК Коэффициент,
	//	|	ДанныеПоЗапчастям.Количество КАК Количество,
	//	|	ДанныеПоЗапчастям.Цена КАК Цена,
	//	|	ДанныеПоЗапчастям.СтавкаНДС КАК СтавкаНДС,
	//	|	ДанныеПоЗапчастям.СуммаНДС КАК СуммаНДС,
	//	|	ДанныеПоЗапчастям.Сумма КАК Сумма,
	//	|	ДанныеПоЗапчастям.СуммаВсего КАК СуммаВсего,
	//	|	ДанныеПоЗапчастям.ПроцентСкидкиСтроки КАК ПроцентСкидкиСтроки,
	//	|	ДанныеПоЗапчастям.СуммаСкидкиСтроки КАК СуммаСкидкиСтроки,
	//	|	ДанныеПоЗапчастям.СкладКомпании КАК СкладКомпании,
	//	|	ДанныеПоЗапчастям.ПроцентСкидкиСтроки КАК ПроцентСкидки,
	//	|	ДанныеПоЗапчастям.СуммаСкидкиСтроки КАК СуммаСкидки
	//	|ИЗ
	//	|	ДанныеПоЗапчастям КАК ДанныеПоЗапчастям
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ДанныеПоЗапчастямКлиента.НомерСтроки КАК НомерСтроки,
	//	|	ДанныеПоЗапчастямКлиента.Номенклатура КАК Номенклатура,
	//	|	ДанныеПоЗапчастямКлиента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//	|	ДанныеПоЗапчастямКлиента.Коэффициент КАК Коэффициент,
	//	|	ДанныеПоЗапчастямКлиента.Количество КАК Количество
	//	|ИЗ
	//	|	ДанныеПоЗапчастямКлиента КАК ДанныеПоЗапчастямКлиента
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ДанныеПоРаботам.НомерСтроки КАК НомерСтроки,
	//	|	ДанныеПоРаботам.Работа КАК Работа,
	//	|	ДанныеПоРаботам.Цена КАК Цена,
	//	|	ДанныеПоРаботам.Количество КАК Количество,
	//	|	ДанныеПоРаботам.Коэффициент КАК Коэффициент,
	//	|	ДанныеПоРаботам.Сумма КАК Сумма,
	//	|	ДанныеПоРаботам.СтавкаНДС КАК СтавкаНДС,
	//	|	ДанныеПоРаботам.СуммаНДС КАК СуммаНДС,
	//	|	ДанныеПоРаботам.СуммаВсего КАК СуммаВсего,
	//	|	ДанныеПоРаботам.ПроцентСкидкиСтроки КАК ПроцентСкидкиСтроки,
	//	|	ДанныеПоРаботам.СуммаСкидкиСтроки КАК СуммаСкидкиСтроки,
	//	|	ДанныеПоРаботам.ИдентификаторРаботы КАК ИдентификаторРаботы,
	//	|	ДанныеПоРаботам.КлючСвязи КАК КлючСвязи,
	//	|	ДанныеПоРаботам.Нормочас КАК Нормочас,
	//	|	ДанныеПоРаботам.СуммаСкидкиСтроки КАК СуммаСкидки,
	//	|	ДанныеПоРаботам.ПроцентСкидкиСтроки КАК ПроцентСкидки
	//	|ИЗ
	//	|	ДанныеПоРаботам КАК ДанныеПоРаботам
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ДанныеПоИсполнителям.Исполнитель КАК Исполнитель,
	//	|	ДанныеПоИсполнителям.КлючСвязи КАК КлючСвязи,
	//	|	ДанныеПоИсполнителям.Цех КАК Цех,
	//	|	ДанныеПоИсполнителям.ФактическаяДлительностьРабот КАК ФактическаяДлительностьРабот,
	//	|	ДанныеПоИсполнителям.ИдентификаторРаботы КАК ИдентификаторРаботы
	//	|ИЗ
	//	|	ДанныеПоИсполнителям КАК ДанныеПоИсполнителям
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеПоРаботам КАК ДанныеПоРаботам
	//	|		ПО ДанныеПоИсполнителям.КлючСвязи = ДанныеПоРаботам.КлючСвязи
	//	|ИТОГИ
	//	|	СУММА(ФактическаяДлительностьРабот)
	//	|ПО
	//	|	КлючСвязи";
	//Запрос.УстановитьПараметр("СправочникДанных", СправочникДанных);
	//Результат = Запрос.ВыполнитьПакет();
	//
	//КоличествоПакетов = Результат.Количество();
	//
	////ОбщиеРеквизиты
	//РезультатОбщиеРеквизиты = Результат[КоличествоПакетов - 5];
	//Если НЕ РезультатОбщиеРеквизиты.Пустой() Тогда
	//	Выборка = РезультатОбщиеРеквизиты.Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		ЗаказНарядОбъект.Состояние = Выборка.Состояние; //Нельзя закрыть заказ (типовой) так как может быть корректировка.
	//		ЗаказНарядОбъект.ХозОперация = Выборка.ХозОперация;
	//		ЗаказНарядОбъект.ВидОплаты = Выборка.ВидОплаты;
	//		ЗаказНарядОбъект.Менеджер = Выборка.Менеджер;
	//		ЗаказНарядОбъект.Мастер = Выборка.Мастер;
	//		ЗаказНарядОбъект.Диспетчер = Выборка.Диспетчер;
	//		ЗаказНарядОбъект.ТипЦенРабот = Выборка.ТипЦенРабот;
	//		ЗаказНарядОбъект.Заказчик = Выборка.Заказчик;
	//		ЗаказНарядОбъект.КурсДокумента = 1;
	//		ЗаказНарядОбъект.КурсВалютыУпр = 1;
	//		ЗаказНарядОбъект.СписаниеТоваровПоСебестоимости = Истина;
	//		ЗаказНарядОбъект.РегламентированныйУчет = Истина;
	//		ЗаказНарядОбъект.ДатаСоздания = ?(ЗаказНарядОбъект.Дата < ЗаказНарядОбъект.ДатаНачала, ЗаказНарядОбъект.Дата, ЗаказНарядОбъект.ДатаНачала) - 1;			
	//		
	//		ВидРемонта = Выборка.ВидРемонта;
	//				
	//		Если Не ЗначениеЗаполнено(Выборка.ВидРемонта) Тогда
	//			
	//			ВидРемонта = Справочники.ВидыРемонта.НайтиПоНаименованию(Выборка.ВидОбслуживания.Наименование);
	//			Если Не ЗначениеЗаполнено(ВидРемонта) Тогда
	//				ВидРемонтаОбъект = Справочники.ВидыРемонта.СоздатьЭлемент();
	//				ВидРемонтаОбъект.Наименование = Выборка.ВидОбслуживания.Наименование;
	//				ВидРемонтаОбъект.ТипРемонта = Перечисления.ТипыРемонта.Платный; 
	//				ВидРемонтаОбъект.Записать();	
	//				ВидРемонта = ВидРемонтаОбъект.Ссылка;
	//			КонецЕсли;
	//			ВидОбслуживанияОбъект = Выборка.ВидОбслуживания.ПолучитьОбъект();
	//			ВидОбслуживанияОбъект.ВидРемонта = ВидРемонта;
	//			ВидОбслуживанияОбъект.Записать();
	//		КонецЕсли;

	//		ЗаказНарядОбъект.ВидРемонта = ВидРемонта;
	//		
	//	КонецЦикла;
	//КонецЕсли;
	//	
	////Товары	
	//ЗаказНарядОбъект.Товары.Очистить();
	//
	//РезультатЗапчасти = Результат[КоличествоПакетов - 4];
	//Если НЕ РезультатЗапчасти.Пустой() Тогда
	//	ТаблицаЗапчастей = РезультатЗапчасти.Выгрузить();
	//	ЗаказНарядОбъект.Товары.Загрузить(ТаблицаЗапчастей);		
	//КонецЕсли;
	//
	////МатериалыЗаказчика	
	//ЗаказНарядОбъект.МатериалыЗаказчика.Очистить();
	//
	//РезультатЗапчастиКлиента = Результат[КоличествоПакетов - 3];
	//Если НЕ РезультатЗапчастиКлиента.Пустой() Тогда
	//	ТаблицаЗапчастейКлиента = РезультатЗапчастиКлиента.Выгрузить();
	//	ЗаказНарядОбъект.МатериалыЗаказчика.Загрузить(ТаблицаЗапчастейКлиента);		
	//КонецЕсли;
	//
	////Работы
	//ЗаказНарядОбъект.Работы.Очистить();
	//
	//РезультатРаботы = Результат[КоличествоПакетов - 2];
	//Если НЕ РезультатРаботы.Пустой() Тогда	
	//	ТаблицаРабот = РезультатРаботы.Выгрузить();
	//	
	//	Для Каждого Эл Из ТаблицаРабот Цикл
	//		УИД = Эл.Работа.УникальныйИдентификатор();
	//		Эл.ИдентификаторРаботы = Строка(УИД);			
	//	КонецЦикла;		
	//	
	//	ЗаказНарядОбъект.Работы.Загрузить(ТаблицаРабот);
	//КонецЕсли;
	//
	////Исполнители
	//ЗаказНарядОбъект.Исполнители.Очистить();
	//
	//РезультатИсполнители = Результат[КоличествоПакетов - 1];
	//Если НЕ РезультатИсполнители.Пустой() Тогда
	//	ВыборкаИтоги = РезультатИсполнители.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//	
	//	Пока ВыборкаИтоги.Следующий() Цикл		
	//		ОбщаяФактическаяДлительностьРабот = ВыборкаИтоги.ФактическаяДлительностьРабот;
	//		КлючСвязи = ВыборкаИтоги.КлючСвязи;
	//		
	//		Выборка = ВыборкаИтоги.Выбрать();
	//		
	//		Счетчик = 1;
	//		КолЗаписей = Выборка.Количество();
	//		ПроцентСумма = 0;
	//		Процент = 0;
	//		Пока Выборка.Следующий() Цикл
	//			Стр = ЗаказНарядОбъект.Исполнители.Добавить();
	//			
	//			ИдентификаторРаботы = "00000000-0000-0000-0000-000000000000";
	//			
	//			Если Счетчик = КолЗаписей Тогда
	//				Процент = 100 - ПроцентСумма;
	//			Иначе		
	//				Если ОбщаяФактическаяДлительностьРабот<>0 Тогда
	//					Процент = Окр(100 * Выборка.ФактическаяДлительностьРабот / ОбщаяФактическаяДлительностьРабот, 2);
	//				КонецЕсли;	
	//			КонецЕсли;
	//			ПроцентСумма = ПроцентСумма + Процент; 
	//			
	//			НайденнаяСтрока = ТаблицаРабот.Найти(КлючСвязи, "КлючСвязи");
	//			
	//			Если НайденнаяСтрока <> Неопределено Тогда
	//				ИдентификаторРаботы = НайденнаяСтрока.ИдентификаторРаботы;	
	//			КонецЕсли;
	//			
	//			Стр.Исполнитель = Выборка.Исполнитель;
	//			Стр.Цех = Выборка.Цех;
	//			Стр.Процент = Процент;
	//			Стр.ИдентификаторРаботы = ИдентификаторРаботы; 			
	//			
	//			Счетчик = Счетчик + 1;			
	//		КонецЦикла;
	//	КонецЦикла;
	//КонецЕсли;
	//
	//ЗаказНарядОбъект.Записать();
	
КонецПроцедуры

Функция НайтиАвтомобильКонтрагента(Контрагент) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль
	|ИЗ
	|	РегистрСведений.Автомобили.СрезПоследних(, ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Хозяин)) КАК АвтомобилиСрезПоследних
	|ГДЕ
	|	АвтомобилиСрезПоследних.Значение = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Выборка.Следующий();
	
	Если Выборка.Количество() = 1 Тогда
		Возврат Выборка.Автомобиль;
	Иначе
		Возврат Справочники.Автомобили.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции // НайтиАвтомобильКонтрагента()


Процедура ЗаполнитьРеквизитыДоговораВРегистре(Договор)
	
	ЗаписьДанныхДоговора = РегистрыСведений.Renault_Advanced_РеквизитыДоговоровКонтрагентов.СоздатьНаборЗаписей();
	ЗаписьДанныхДоговора.Отбор.ДоговорКонтрагента.Установить(Договор);
	ЗаписьДанныхДоговора.Прочитать();
	
	Если ЗаписьДанныхДоговора.Количество() = 0 Тогда
		ЗаписьПоДоговоруНовая = ЗаписьДанныхДоговора.Добавить();
		ЗаписьПоДоговоруНовая.ДоговорКонтрагента = Договор;
		ЗаполнитьЗначенияСвойств(ЗаписьПоДоговоруНовая, Договор);
   		ЗаписьПоДоговоруНовая.ВедениеВзаиморасчетов = Перечисления.Renault_Advanced_ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам;  
		ЗаписьДанныхДоговора.Записать();
	КонецЕсли;

КонецПроцедуры

 //Функция служебная, нужна на время проведения старых ЗН
Функция РазрешитьПроводитьЗаказНарядБезОпределенныхПроверок() Экспорт
	Значение = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_Advanced_ЗначенияДополнительныхПравПользователя.Значение
		|ИЗ
		|	РегистрСведений.Renault_Advanced_ЗначенияДополнительныхПравПользователя КАК Renault_Advanced_ЗначенияДополнительныхПравПользователя
		|ГДЕ
		|	Renault_Advanced_ЗначенияДополнительныхПравПользователя.Право = ЗНАЧЕНИЕ(ПланВидовХарактеристик.Renault_Advanced_ПраваПользователей.РазрешитьПроводитьЗаказНарядБезПроверокСлужебныйНеВключать)
		|	И Renault_Advanced_ЗначенияДополнительныхПравПользователя.Пользователь = &Пользователь";   	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда	
		Выборка = Результат.Выбрать(); 		
		Выборка.Следующий();
		
		Значение = Выборка.Значение;
	КонецЕсли;
	
	Возврат Значение;	 
КонецФункции
////////////////////////////////////////////////////

//Козлов Е.А. Конец

// Функция возвращает возможность проведения платежного документа без указания ссылки
// на заявку.
//
// Параметры:
//  нет.
//
// Возвращаемое значение:
//  Истина - если можно проводить, иначе Ложь.
//
Функция ЕстьРазрешениеПроводитьБезЗаявки() Экспорт

	СписокФильтров = Renault_Advanced_УправлениеПользователями.ПолучитьЗначениеПраваДляТекущегоПользователя(ПланыВидовХарактеристик.Renault_Advanced_ПраваПользователей.РазрешитьПроведениеПлатежаБезЗаявки, Истина);

	Возврат НЕ СписокФильтров.НайтиПоЗначению(Истина) = Неопределено;

КонецФункции // ЕстьРазрешениеПроводитьБезЗаявки()

// Проверяет остатки по регистрам "ЗаявкиНаРасходованиеСредств" и "ДенежныеСредстваВРезерве"
// по переданной в параметре заявке и управляет значением отказа в проведении платежного документа
//
// Параметры
//  ЗаявкаНаРасходованиеСредств	:Документ.ЗаявкаНаРасходованиеСредств  – заявка, для которой формируются остатки
//  Дата						:Дата –дата, на которую формируются остатки
//  Отказ						:Булево –отказ в проведении документа
//  Заголовок					:Строка –представление документа при проведении
//  БанковскийСчетКасса			:Банковский счет, касса - место списания денежных средств
//  СуммаДокумента				:Число - сумма денежных средств к списанию
//  СуммаВзаиморасчетов			:Число - сумма взаиморасчетов по документу
//
Процедура ПроверитьОстаткиПоЗаявке(Дата,Отказ,Заголовок,ПараметрыДокумента,ЕстьРазрешение) Экспорт
	
	ДоговорКонтрагента = ПараметрыДокумента.ДоговорКонтрагента;
	Сделка = ПараметрыДокумента.Сделка;
	ДокументПланированияПлатежа = ПараметрыДокумента.ДокументПланированияПлатежа;
	СуммаДокумента = ПараметрыДокумента.СуммаДокумента;
	ВалютаДокумента = ПараметрыДокумента.ВалютаДокумента;
	
	// Проверяем соответствие суммы взаиморасчетов документа сумме взаиморасчетов в ТЧ заявки

	Если ЕстьРазрешение И НЕ ЗначениеЗаполнено(ДокументПланированияПлатежа) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЕстьРазрешение И НЕ ЗначениеЗаполнено(ДокументПланированияПлатежа) Тогда
		
		ТекстСообщения = "Договор: " + ДоговорКонтрагента 
		+ ", сделка: " + ?(ЗначениеЗаполнено(Сделка), Сделка, "не указана")
		+ ": не указана заявка.";
		
		Renault_Advanced_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ, Заголовок);	
		
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ЕстьРазрешение И НЕ ДокументПланированияПлатежа.Проведен Тогда
		
		Renault_Advanced_ОбщегоНазначения.СообщитьОбОшибке(Строка(ДокументПланированияПлатежа)+" не проведена.", Отказ, Заголовок);	
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	ТекстУсловия = "ЗаявкаНаРасходование = &ДокументЗаявка";
	
	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		ТекстУсловия = ТекстУсловия + "
		|И ДоговорКонтрагента = &ДоговорКонтрагента";
		Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Сделка) Тогда
		ТекстУсловия = ТекстУсловия + "
		|И (Сделка = &Сделка ИЛИ Сделка=Неопределено)";
		Запрос.УстановитьПараметр("Сделка", Сделка);
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкиНаРасходованиеСредствОстатки.СуммаОстаток КАК СуммаОстаток
				   |	
	               |ИЗ
	               |	РегистрНакопления.Renault_Advanced_ЗаявкиНаРасходованиеСредств.Остатки(, " + ТекстУсловия + " ) КАК ЗаявкиНаРасходованиеСредствОстатки";
	
	Запрос.УстановитьПараметр("ДокументЗаявка", ДокументПланированияПлатежа);
	 		
	РезультатЗапроса = Запрос.Выполнить();
	ВыбраннаяЗаявка  = РезультатЗапроса.Выбрать();
	
	Если НЕ ВыбраннаяЗаявка.Следующий() Тогда
		ОстатокПоЗаявке = 0;
	Иначе
		ОстатокПоЗаявке = ?(ВыбраннаяЗаявка.СуммаОстаток = NULL, 0, ВыбраннаяЗаявка.СуммаОстаток);
	КонецЕсли;
	
	Если ВалютаДокумента <> ДокументПланированияПлатежа.ВалютаДокумента 
		И ОстатокПоЗаявке <> 0 Тогда
	
		ОстатокПоЗаявке = обПересчет(ОстатокПоЗаявке,ДокументПланированияПлатежа.ВалютаДокумента,Дата,ВалютаДокумента,Дата);	
	
	КонецЕсли;
	
	Если ОстатокПоЗаявке < СуммаДокумента Тогда
		ВалютаПлатежа = ВалютаДокумента;

		ТекстОшибки = "Договор: " + ДоговорКонтрагента + ", сделка: " + ?(ЗначениеЗаполнено(Сделка), Сделка, "не указана") + "
		|Сумма превышает остаток по заявке.
		|Текущий остаток = " + Формат(ОстатокПоЗаявке, "ЧЦ=15; ЧДЦ=2; ЧН=") + " " + ВалютаПлатежа + "
		|Сумма = "+Формат(СуммаДокумента, "ЧЦ=15; ЧДЦ=2; ЧН=") + " " + ВалютаПлатежа;
		
		Если ЕстьРазрешение Тогда
			Renault_Advanced_ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, , Заголовок, СтатусСообщения.Информация);
		Иначе
			Renault_Advanced_ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, Отказ, Заголовок);
		КонецЕсли;

	КонецЕсли;
		
КонецПроцедуры // ПроверитьОстаткиПоЗаявке()

Функция ЕстьПравоСразуРезервироватьАвтомобиль(Пользователь) Экспорт
	Значение = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки
		|ПОМЕСТИТЬ ВТПраваИНастройкиПользователя
		|ИЗ
		|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
		|ГДЕ
		|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Renault_Advanced_ЗначенияДополнительныхПравПользователя.Значение КАК Значение
		|ИЗ
		|	ВТПраваИНастройкиПользователя КАК ВТПраваИНастройкиПользователя
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_Advanced_ЗначенияДополнительныхПравПользователя КАК Renault_Advanced_ЗначенияДополнительныхПравПользователя
		|		ПО ВТПраваИНастройкиПользователя.ПраваИНастройки = Renault_Advanced_ЗначенияДополнительныхПравПользователя.Пользователь
		|			И (Renault_Advanced_ЗначенияДополнительныхПравПользователя.Право = ЗНАЧЕНИЕ(ПланВидовХарактеристик.Renault_Advanced_ПраваПользователей.РазрешитьСтавитьАвтомобильВРезерв))";
	Запрос.УстановитьПараметр("Пользователь", Пользователь);  	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();  		
		Выборка.Следующий();	
		
		Значение = Выборка.Значение;
	КонецЕсли; 
	
	Возврат Значение;
КонецФункции

// Проверяет выполнение необходимых для проведения условий - все работы имеют стадию
// "Выполнено" и все запчасти умеют статус "Установлен".
//
//Процедура ПроверитьВозможностьПроведения(Отказ, Заголовок = "", ЭтоЗакрытие = Ложь) Экспорт
Процедура ПроверитьВозможностьПроведения(Источник, Отказ, ЭтоЗакрытие = Ложь, СтатусВыполнено = Ложь) Экспорт
	
	Если СтатусВыполнено Тогда
		ТекстСообщения = "Установить статус ""Выполнено"" можно только тогда, когда установлены все запчасти и выполнены все работы.";		
	Иначе		
		ТекстСообщения = "Документ можно " + ?(ЭтоЗакрытие, "закрыть", "провести") + " только тогда, когда установлены все запчасти и выполнены все работы.";
	КонецЕсли;

	// Определим максимально возможный статус
	//МаксимальныйСтатусУстановлен = Renault_Advanced_СтатусыЗапчастей.НайтиСледующийСтатус(Справочники.Renault_Advanced_СтатусыЗапчастей.Установлен);
	//Если МаксимальныйСтатусУстановлен = Неопределено Тогда
		МаксимальныйСтатусУстановлен = Справочники.Renault_Advanced_СтатусыЗапчастей.Установлен;
	//КонецЕсли;
	
	// Сначала проверим табличную часть "Запчасти", потому что это
	// быстрее.
	Для Каждого СтрокаТабличнойЧасти Из Источник.Товары Цикл
		Если СтрокаТабличнойЧасти.DMS_Статус <> МаксимальныйСтатусУстановлен Тогда
			Renault_Advanced_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ, "");
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	// Теперь проверим, все ли работы выполнены.	
	Если Источник.Работы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПроверитьВозможностьПроведения()

Функция ЭтоУслуга(Работа) Экспорт 
		
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Автоработы.Ссылка
	               |ИЗ
	               |	Справочник.Автоработы КАК Автоработы
	               |ГДЕ
	               |	Автоработы.Ссылка В ИЕРАРХИИ (&Услуги)
	               |	И Автоработы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Работа);
	Запрос.УстановитьПараметр("Услуги", Справочники.Автоработы.НайтиПоНаименованию("Услуги", Истина));
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		Результат = Истина;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

// В наборе записей рассчитывает управленческие суммы из сумм взаиморасчетов
//
Процедура РассчитатьУправленческиеСуммы(ЗаказНарядОбъект, НаборЗаписей, НаборРесурсов)
	
	СписокРесурсов = Новый Структура(НаборРесурсов);
	
	Для Каждого Движение Из НаборЗаписей Цикл
		Для Каждого Ресурс Из СписокРесурсов Цикл
			Движение[Ресурс.Ключ + "Упр"] = Движение[Ресурс.Ключ] * ЗаказНарядОбъект.КурсВалютыУпр;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры // РассчитатьУправленческиеСуммы()

Функция ИспользуетсяКлючСвязи(Свойство) Экспорт
	
	Возврат (Свойство = Перечисления.Renault_Advanced_СвойстваСпискаИсполнителей.Индивидуальный) ИЛИ (Свойство = Перечисления.Renault_Advanced_СвойстваСпискаИсполнителей.Копированием);
	
КонецФункции 

Процедура ИзвлечьЗначения(Строка, Массив, Разделитель, СимволКавычки, СтрокаФайла) Экспорт
	
	ПоискПоля = 0;
	АнализПоля = 1;
	АнализПоляСКавычкой = 2;
	ЗавершениеАнализаПоляСКавычкой = 3;
	
	Массив = Новый Массив;
	Если Строка = Неопределено ИЛИ СтрДлина(Строка) = 0 Тогда
		Массив.Добавить("");
		Возврат;
	КонецЕсли;
	
	Состояние = ПоискПоля;
	
	ЗначениеПоля = "";
	НачальнаяПозиция = 1;
	КонечнаяПозиция = СтрДлина(Строка);
	Индекс = 1;
	
	Пока Индекс <= КонечнаяПозиция Цикл
		
		ТекущийСимвол = Сред(Строка, Индекс, 1);
		
		Если Состояние = ПоискПоля Тогда
			
			Если ТекущийСимвол = СимволКавычки Тогда
				Состояние = АнализПоляСКавычкой;
				НачальнаяПозиция = Индекс + 1;
				ЗначениеПоля = "";
				Индекс = НайтиВПодстроке(Строка, НачальнаяПозиция, СимволКавычки);
				Продолжить;
				
			Иначе
				Если ТекущийСимвол = Разделитель Тогда
					Массив.Добавить("");
				Иначе
					Состояние = АнализПоля;
					НачальнаяПозиция = Индекс;
					Индекс = НайтиВПодстроке(Строка, НачальнаяПозиция, Разделитель);
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли Состояние = АнализПоля Тогда
			
			Если ТекущийСимвол = Разделитель Тогда
				Массив.Добавить(Сред(Строка, НачальнаяПозиция, Индекс - НачальнаяПозиция));
				Состояние = ПоискПоля;
			КонецЕсли;
			
		ИначеЕсли Состояние = АнализПоляСКавычкой Тогда
			
			Если ТекущийСимвол = СимволКавычки Тогда
				Состояние = ЗавершениеАнализаПоляСКавычкой;
				ЗначениеПоля = ЗначениеПоля + Сред(Строка, НачальнаяПозиция, Индекс - НачальнаяПозиция);
			КонецЕсли;
			
		ИначеЕсли Состояние = ЗавершениеАнализаПоляСКавычкой Тогда
			
			Если ТекущийСимвол = Разделитель Тогда
				Массив.Добавить(ЗначениеПоля);
				Состояние = ПоискПоля;
			ИначеЕсли ТекущийСимвол = СимволКавычки Тогда
				Состояние = АнализПоляСКавычкой;
				ЗначениеПоля = ЗначениеПоля + СимволКавычки;
				НачальнаяПозиция = Индекс + 1;
				Индекс = НайтиВПодстроке(Строка, НачальнаяПозиция, СимволКавычки);
				Продолжить;
			Иначе
				ВызватьИсключение("Не найден разделитель """ + Разделитель + """ в строке " + СтрокаФайла + ".");
			КонецЕсли;
			
		КонецЕсли;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	Если Состояние = АнализПоляСКавычкой Тогда
		ВызватьИсключение("Нет закрывающей скобки в строке " + СтрокаФайла + ".");
	КонецЕсли;
	
	Если Состояние = ЗавершениеАнализаПоляСКавычкой Тогда
		Массив.Добавить(ЗначениеПоля);
	ИначеЕсли Состояние = АнализПоля Тогда
		Массив.Добавить(Сред(Строка, НачальнаяПозиция, Индекс - НачальнаяПозиция));
	КонецЕсли;
	
КонецПроцедуры // ИзвлечьЗначения()

Функция ПолучитьЗначение(Колонка, Значения, Колонки) Экспорт
	
	Индекс = Колонки.Получить(Колонка);
	
	Если Индекс = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат Значения[Индекс];
	КонецЕсли;
	
КонецФункции // ПолучитьЗначение()

Функция НайтиВПодстроке(Стр1, Поз1, ИскомыйСимвол)
	
	Стр = Сред(Стр1, Поз1);
	Поз = Найти(Стр, ИскомыйСимвол);
	Если Поз = 0 Тогда
		Возврат СтрДлина(Стр1) + 1;
	КонецЕсли;
	  
	Возврат Поз1 + Поз - 1;
	
КонецФункции // НайтиВПодстроке()

Функция ПолучитьСкладыИзГруппы(ГруппаДоступностиСкладов, мСоставыГруппДоступностиСкладов = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(ГруппаДоступностиСкладов) Тогда
		Возврат Справочники.СкладыКомпании.ПустаяСсылка();
	КонецЕсли;
	
	Если ТипЗнч(ГруппаДоступностиСкладов) = Тип("СправочникСсылка.СкладыКомпании") Тогда
		Возврат ГруппаДоступностиСкладов;
	КонецЕсли;
	
	Если ТипЗнч(мСоставыГруппДоступностиСкладов) <> Тип("Соответствие") Тогда
		мСоставыГруппДоступностиСкладов = Новый Соответствие;
	КонецЕсли;
	
	СписокСкладов = мСоставыГруппДоступностиСкладов.Получить(ГруппаДоступностиСкладов);
	
	Если СписокСкладов <> Неопределено Тогда
		Возврат СписокСкладов;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГруппаДоступностиСкладов", ГруппаДоступностиСкладов);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоставГруппДоступностиСкладов.Склад
	|ИЗ
	|	РегистрСведений.Renault_СоставГруппДоступностиСкладов КАК СоставГруппДоступностиСкладов
	|ГДЕ
	|	СоставГруппДоступностиСкладов.ГруппаДоступности = &ГруппаДоступностиСкладов";
	
	СписокСкладов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Склад");
	
	мСоставыГруппДоступностиСкладов.Вставить(ГруппаДоступностиСкладов, СписокСкладов);
	
	Возврат СписокСкладов;
	
КонецФункции // ПолучитьСкладыИзГруппы()

Процедура ЗаполнитьРеквизитыПоУмолчанию(ЗаказНаряд) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗначенияРеквизитовЗаказНарядовПоУмолчанию.*
	|ИЗ
	|	РегистрСведений.Renault_Advanced_ЗначенияРеквизитовЗаказНарядовПоУмолчанию КАК ЗначенияРеквизитовЗаказНарядовПоУмолчанию
	|ГДЕ
	|	(ЗначенияРеквизитовЗаказНарядовПоУмолчанию.Пользователь = &Пользователь
	|			ИЛИ ЗначенияРеквизитовЗаказНарядовПоУмолчанию.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗначенияРеквизитовЗаказНарядовПоУмолчанию.Пользователь УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		МетаданныеРегистра = Метаданные.РегистрыСведений.Renault_Advanced_ЗначенияРеквизитовЗаказНарядовПоУмолчанию;
		
		Для Каждого Ресурс Из МетаданныеРегистра.Ресурсы Цикл
			Попытка
				Если Не ЗначениеЗаполнено(ЗаказНаряд[Ресурс.Имя]) Тогда ЗаказНаряд[Ресурс.Имя] = Выборка[Ресурс.Имя]; КонецЕсли;
			Исключение
				Если Не ЗначениеЗаполнено(ЗаказНаряд["DMS_"+Ресурс.Имя]) Тогда ЗаказНаряд["DMS_"+Ресурс.Имя] = Выборка[Ресурс.Имя]; КонецЕсли;
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСсылкуНаСчетНаОплату(ЗаказПокупателя) Экспорт
	
	СчетНаОплатуПокупателю = Неопределено;
	
	// Если заказ покупателя по каким-либо причинам не создан, то счет найти мы не сможем - выходим
	Если НЕ ЗначениеЗаполнено(ЗаказПокупателя) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетНаОплатуПокупателю.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СчетНаОплату КАК СчетНаОплатуПокупателю
	|ГДЕ
	|	СчетНаОплатуПокупателю.ДокументОснование = &ЗаказПокупателя";

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СчетНаОплатуПокупателю = Выборка.Ссылка;
	КонецЕсли;

	Возврат СчетНаОплатуПокупателю;
	
КонецФункции // ПолучитьСсылкуНаСчетНаОплату()

Функция СформироватьТабличнуюЧастьУслуг(ЗаказНаряд, ТолькоУслуги = Ложь, ДляРеализации = Ложь)
	
	Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("Ссылка", ЗаказНаряд);
	Запрос.УстановитьПараметр("Автоуслуга", ЗаказНаряд.DMS_Автоуслуга);
	
	Запрос.УстановитьПараметр("ДляРелизации", ДляРеализации);
	
	//Если Модифицированность() Тогда
		Запрос.УстановитьПараметр("Запчасти", ЗаказНаряд.Товары.Выгрузить());
		Запрос.УстановитьПараметр("Работы", ЗаказНаряд.Работы.Выгрузить());
	//КонецЕсли;
	
	Запрос.УстановитьПараметр("АвтоУслугаЗапчастей", ЗаказНаряд.DMS_АвтоУслугаЗапчастей);
	Запрос.Текст =
	"ВЫБРАТЬ
	//|	ВЫБОР КОГДА &ДляРелизации = ИСТИНА И &АвтоУслугаЗапчастей <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) ТОГДА &АвтоУслугаЗапчастей ИНАЧЕ &Автоуслуга КОНЕЦ КАК Номенклатура,
	|   &Автоуслуга КАК Номенклатура,
	|	ЗаказНарядЗапчасти.Цена * ЗаказНарядЗапчасти.Количество КАК СуммаБезСкидок,
	|	ЗаказНарядЗапчасти.Сумма,
	|	ВЫБОР КОГДА ЗаказНарядЗапчасти.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка) ТОГДА ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС) ИНАЧЕ ЗаказНарядЗапчасти.СтавкаНДС КОНЕЦ КАК СтавкаНДС,
	|	ЗаказНарядЗапчасти.СуммаНДС
	|ПОМЕСТИТЬ Запчасти
	|ИЗ
	|	&Запчасти КАК ЗаказНарядЗапчасти
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказНарядРаботы.Работа КАК Номенклатура,
	|	ЗаказНарядРаботы.Цена * ЗаказНарядРаботы.Количество КАК СуммаБезСкидок,
	|	ЗаказНарядРаботы.Сумма,
	|	ВЫБОР КОГДА ЗаказНарядРаботы.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка) ТОГДА ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС) ИНАЧЕ ЗаказНарядРаботы.СтавкаНДС КОНЕЦ КАК СтавкаНДС,
	|	ЗаказНарядРаботы.СуммаНДС
	|ПОМЕСТИТЬ Работы
	|ИЗ
	|	&Работы КАК ЗаказНарядРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабличныеЧасти.Номенклатура,
	|	СУММА(ТабличныеЧасти.СуммаБезСкидок) КАК Цена,
	|	СУММА(ТабличныеЧасти.Сумма) КАК Сумма,
	|	ТабличныеЧасти.СтавкаНДС КАК СтавкаНДС, 
	|	СУММА(ТабличныеЧасти.СуммаНДС) КАК СуммаНДС,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА СУММА(ТабличныеЧасти.СуммаБезСкидок) = 0 ТОГДА 0 ИНАЧЕ (1 - СУММА(ТабличныеЧасти.Сумма) / СУММА(ТабличныеЧасти.СуммаБезСкидок)) * 100 КОНЕЦ КАК ЧИСЛО(5, 2)) КАК ПроцентСкидкиНаценки
	|ИЗ
	|	(" + ?(ТолькоУслуги, "", "ВЫБРАТЬ
	|		Запчасти.Номенклатура КАК Номенклатура,
	|		Запчасти.СуммаБезСкидок КАК СуммаБезСкидок,
	|		Запчасти.Сумма КАК Сумма,
	|		Запчасти.СтавкаНДС КАК СтавкаНДС,
	|		Запчасти.СуммаНДС КАК СуммаНДС
	|	ИЗ
	|		Запчасти КАК Запчасти
	|	
	|	ОБЪЕДИНИТЬ ВСЕ") + "
	|	
	|	ВЫБРАТЬ
	//|		ВЫБОР КОГДА &ДляРелизации = ИСТИНА И Работы.Номенклатура.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) ТОГДА Работы.Номенклатура.Номенклатура ИНАЧЕ &Автоуслуга КОНЕЦ КАК Номенклатура,
	|       &Автоуслуга КАК Номенклатура,
	|		Работы.СуммаБезСкидок,
	|		Работы.Сумма,
	|		Работы.СтавкаНДС,
	|		Работы.СуммаНДС
	|	ИЗ
	|		Работы КАК Работы) КАК ТабличныеЧасти
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабличныеЧасти.Номенклатура,
	|	ТабличныеЧасти.СтавкаНДС";
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции // СформироватьТабличнуюЧастьУслуг()



