&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ПараметрыСеанса.Renault_ПраваПользователя.СотрудникОФУ И Не ПараметрыСеанса.Renault_ПраваПользователя.РуководительОФУ Тогда 
		Отказ = Истина;
		Сообщить("Нет прав на Учет БСО",СтатусСообщения.Внимание);
		Возврат
	КонецЕсли;
	
	
	Если Объект.Ссылка.Пустая() Тогда
		Если Не ЗначениеЗаполнено(Объект.Агент) Тогда
			Объект.Агент = ПараметрыСеанса.Пользователь;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
			Объект.Организация = ПараметрыСеанса.Организация;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.ТочкаПродаж) Тогда
			Объект.ТочкаПродаж = ПараметрыСеанса.ПодразделениеКомпании;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.Состояние) Тогда
			Объект.Состояние = Перечисления.Renault_СтатусыСтраховыхПолисов.Открыт;
		КонецЕсли;
		//Объект.КвитанцияБСО=Справочники.Renault_БСО_НаименованияБланковСтрогойОтчетности.Квитанция;
		//Объект.ПолисБСО=Документы.Renault_СтраховойПолис.ПолучитьНаименованиеБСО(Объект); - станет известно после выбора вида страховки
		Объект.ДатаВыдачи = ТекущаяДата();
	КонецЕсли;	
	
	УправлениеЭлементами();
	УстановитьПараметрыДинамическогоСпискаБСО();
	УстановитьПараметрыДинамическогоСпискаВзаиморасчеты();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Если Объект.Автомобиль.Пустая() Тогда ТС=Объект.ТранспортноеСредство Иначе ТС=Объект.Автомобиль КонецЕсли; 
	//УправлениеЭлементами();
КонецПроцедуры

Процедура УправлениеЭлементами()
	
	БезОграничения = Объект.ВидДействияДоговора=1;
	Элементы.ЛицаДопущенныеКУправлениюТС.Доступность = НЕ БезОграничения;
	//Если Объект.ПолисБСО.Пустая() Тогда
	//	Объект.ПолисБСО=Документы.Renault_СтраховойПолис.ПолучитьНаименованиеБСО(Объект);
	//КонецЕсли;
	
	//Элементы.НомерКвитанции.СписокВыбора.ЗагрузитьЗначения(ПолучитьНомераБСО(Объект.КвитанцияБСО,Объект.СерияКвитанции));	
	//Элементы.НомерПолиса.СписокВыбора.ЗагрузитьЗначения(ПолучитьНомераБСО(Объект.ПолисБСО,Объект.СерияПолиса));
	
	//расторжение
	Расторжение = ДокументРасторжения();
	Элементы.Расторжение.Видимость = НЕ Расторжение.Пустая();
	Элементы.СуммаНДС.Доступность = Не Объект.Организация.ОсвобожденОтНДС;
	Элементы.кнСостояние.Заголовок = ?(Объект.Состояние.Пустая(), "Состояние не определено","Состояние" + Символы.ПС + Объект.Состояние);
	Элементы.СуммаДоплаты.Доступность = Не Объект.ЗаменаБезДоплаты;
	//СтрЗаказПокупателя=?(Объект.ЗаказПокупателя.Пустая(),"Создать заказ покупателя",Объект.ЗаказПокупателя);
	
КонецПроцедуры	

Процедура УстановитьПараметрыДинамическогоСпискаБСО()
	
	ДвиженияБСО.Параметры.Элементы.Найти("СтраховаяКомпания").Значение=Объект.СтраховаяКомпания;
	ДвиженияБСО.Параметры.Элементы.Найти("СтраховаяКомпания").Использование = Истина;
	
	ДвиженияБСО.Параметры.Элементы.Найти("ТипБСО").Значение = Объект.ТипБСО;
	ДвиженияБСО.Параметры.Элементы.Найти("ТипБСО").Использование = Истина;
	ДвиженияБСО.Параметры.Элементы.Найти("СерияБСО").Значение = Объект.СерияБСО;
	ДвиженияБСО.Параметры.Элементы.Найти("СерияБСО").Использование = Истина;
	ДвиженияБСО.Параметры.Элементы.Найти("НомерБСО").Значение = Объект.НомерБСО;
	ДвиженияБСО.Параметры.Элементы.Найти("НомерБСО").Использование = Истина;
	
	//ДвиженияБСО.Параметры.Элементы.Найти("кТипБСО").Значение=Объект.ТипБСО_Квитанция;
	//ДвиженияБСО.Параметры.Элементы.Найти("кТипБСО").Использование=Истина;
	//ДвиженияБСО.Параметры.Элементы.Найти("кСерияБСО").Значение=Объект.СерияБСО_Квитанция;
	//ДвиженияБСО.Параметры.Элементы.Найти("кСерияБСО").Использование=Истина;
	//ДвиженияБСО.Параметры.Элементы.Найти("кНомерБСО").Значение=Объект.НомерБСО_Квитанция;
	//ДвиженияБСО.Параметры.Элементы.Найти("кНомерБСО").Использование=Истина;
	
КонецПроцедуры

Процедура УстановитьПараметрыДинамическогоСпискаВзаиморасчеты()
	
	//Взаиморасчеты.Параметры.Элементы.Найти("ЗаказПокупателя").Использование=Истина;
	//Взаиморасчеты.Параметры.Элементы.Найти("ЗаказПокупателя").Значение=Объект.ЗаказПокупателя;
	Взаиморасчеты.Параметры.Элементы.Найти("Договор").Использование = Истина;
	Взаиморасчеты.Параметры.Элементы.Найти("Договор").Значение = Объект.ЗаказПокупателя.ДоговорВзаиморасчетов;
	
КонецПроцедуры

Функция ДокументРасторжения()
	
	Запрос = Новый Запрос("Выбрать Регистратор Из РегистрСведений.Renault_РасторгнутыеПолисы ГДЕ СтраховойПолис=&Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Регистратор
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции

//&НаКлиенте
//Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
//	//Если ТипЗнч(ТС)=Тип("СправочникСсылка.Автомобили") Тогда Объект.Автомобиль=ТС Иначе Объект.ТранспортноеСредство=ТС КонецЕсли;
//КонецПроцедуры

&НаКлиенте
Процедура кнПечать(Команда)
	
	Документы.Renault_СтраховойПолис.Печать(Объект, ЭтаФорма);
	
КонецПроцедуры

////+остатки БСО
//&НаКлиенте
//Процедура СерияКвитанцииПриИзменении(Элемент) УправлениеЭлементами() КонецПроцедуры
//&НаКлиенте
//Процедура СерияПолисаПриИзменении(Элемент) УправлениеЭлементами() КонецПроцедуры

//Функция ПолучитьНомераБСО(НаименованиеБСО,СерияБСО)
//	Запрос=Новый Запрос("Выбрать НомерБСО ИЗ РегистрНакопления.Renault_БСО_УчетБланковСтрогойОтчетности.Остатки ГДЕ Организация=&Организация И Подразделение=&Подразделение И НаименованиеБСО=&НаименованиеБСО И СерияБСО=&СерияБСО");
//	Запрос.УстановитьПараметр("Организация",Объект.Организация);
//	Запрос.УстановитьПараметр("Подразделение",Объект.Подразделение);
//	Запрос.УстановитьПараметр("НаименованиеБСО",НаименованиеБСО);
//	Запрос.УстановитьПараметр("СерияБСО",СерияБСО);
//	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерБСО")
//КонецФункции	

//&НаКлиенте
//Процедура ВидДействияДоговораПриИзменении(Элемент) УправлениеЭлементами() КонецПроцедуры

//&НаКлиенте
//Процедура кнУчетБСО(Команда) ОткрытьФорму("Обработка.Renault_БСО_АРМ_УчетБСО.Форма",,ЭтаФорма,) КонецПроцедуры
////-остатки БСО

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если РежимПодбора И НЕ Объект.Ссылка.Пустая() Тогда
		ВладелецФормы.Объект.ФинансовыеУслуги.НайтиПоИдентификатору(ИдСтрокиВладельца).СтраховойПолис = Объект.Ссылка;
		ВладелецФормы.Элементы.ФинансовыеУслуги.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура кнПрикрепитьСкан(Команда)
	//Форма=ПолучитьФорму("РегистрСведений.КартинкиИФайлы.Форма.ФормаЗаписи");
	//Форма.Объект=Объект.Ссылка;
	//Форма.ОткрытьМодально();
	Форма = ПолучитьФорму("РегистрСведений.Renault_КартинкиИФайлы.Форма.ФормаСписка");
	Форма.Отбор.Объект.Значение = Объект.Ссылка;
	Форма.Отбор.Объект.Использование = Истина;
	Форма.Отбор.Объект.ВидСравнения = ВидСравнения.Равно;
	Форма.Открыть();
	
КонецПроцедуры

//открыть документ расторжения
&НаКлиенте
Процедура РасторжениеНажатие(Элемент, СтандартнаяОбработка)
	ОткрытьЗначение(ДокументРасторжения())
КонецПроцедуры

&НаКлиенте
Процедура кнСостояние(Состояние="")
	
	Если ТипЗнч(Состояние) = Тип("КомандаФормы") Тогда
		Состояния = Новый СписокЗначений;
		Для Каждого Эл Из Перечисления.Renault_СтатусыСтраховыхПолисов Цикл
			Состояния.Добавить(Эл);
		КонецЦикла;
		Если ЗначениеЗаполнено(Объект.Состояние) Тогда
			Состояния.НайтиПоЗначению(Объект.Состояние).Пометка = Истина;
		КонецЕсли;
		Парам = Новый Структура;
		Парам.Вставить("Список", Состояния);
		Парам.Вставить("Заголовок", "Состояние страхового полиса");
		Парам.Вставить("МножественныйВыбор", Ложь);
		//Парам.Вставить("КоличествоЭлементовВСтроке",3);
		Парам.Вставить("ШиринаЭлемента", 14);
		Парам.Вставить("ВысотаЭлемента", 2);
		Состояние = ОткрытьФормуМодально("ОбщаяФорма.Renault_ДиалогВыбораСпискаЗначений", Парам,ЭтаФорма);
	КонецЕсли;
	
	Если Состояние <> Неопределено Тогда
		//СтароеСостояние=Объект.Состояние;
		Объект.Состояние = Состояние;
		Модифицированность = Истина;
		//Если НЕ ИзменитьСостояние() Тогда Объект.Состояние=СтароеСостояние КонецЕсли;
	КонецЕсли;
	УправлениеЭлементами();
	
КонецПроцедуры

&НаКлиенте
Процедура ФинансоваяУслугаПриИзменении(Элемент)
	
	ЗаполнитьПараметрыФинУслуги();
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыФинУслуги()
	
	Объект.СтраховаяКомпания = Объект.ФинансоваяУслуга.Владелец;
	Объект.ВидСтрахования = Объект.ФинансоваяУслуга.ВидУслуги;
	Объект.ОплатаСК = ?(ТипЗнч(Объект.ФинансоваяУслуга.Владелец) = Тип("СправочникСсылка.Банки"), Истина, Ложь);
	
КонецПроцедуры

////заказ покупателя
//&НаКлиенте
//Процедура ЗаказПокупателяНажатие(Элемент, СтандартнаяОбработка) 
//	СтандартнаяОбработка=Ложь; 
//	Если Объект.ЗаказПокупателя.Пустая() Тогда 
//		Если Не СоздатьЗаказПокупателя() Тогда
//			//Форма=ПолучитьФорму("Документ.ЗаказПокупателя.ФормаОбъекта",,ЭтаФорма,УникальныйИдентификатор);
//			//Док=НовыйЗаказПокупателя();
//			//КопироватьДанныеФормы(Док,Форма.Объект);
//			//Форма.Открыть();
//			НовыйЗаказПокупателя().ПолучитьФорму().Открыть();
//		КонецЕсли;	
//	Иначе ОткрытьЗначение(Объект.ЗаказПокупателя) КонецЕсли 
//КонецПроцедуры
//Функция СоздатьЗаказПокупателя()
//	Док=НовыйЗаказПокупателя();
//	Попытка
//		Док.Записать();
//		УправлениеЭлементами();
//		Возврат Истина
//	Исключение
//		Возврат Ложь
//	КонецПопытки;	
//КонецФункции
//Функция НовыйЗаказПокупателя()
//	Док=Документы.ЗаказПокупателя.СоздатьДокумент();
//	Док.Автомобиль=Объект.Автомобиль;
//	Док.Автор=ПараметрыСеанса.Пользователь;
//	Док.ВалютаДокумента=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
//	Док.ВидОплаты=Объект.ВидОплаты;
//	Док.Дата=ТекущаяДата();
//	Док.ДатаОперации=Док.Дата;
//	
//	Док.ДоговорВзаиморасчетов=Объект.Контрагент.ОсновнойДоговорВзаиморасчетов;
//	Док.КурсВалютыУпр=1;
//	Док.КурсДокумента=1;
//	Док.Контрагент=Объект.Контрагент;
//	
//	Док.Менеджер=ПараметрыСеанса.Пользователь;
//	Док.Организация=Объект.Организация;
//	Док.ПодразделениеКомпании=Объект.ТочкаПродаж;
//	Док.СкладКомпании=Справочники.Renault_ОбщиеНастройкиБазыДанных.ЭтаБаза.ОсновнойСкладРеализации;
//	
//	Док.СуммаДокумента=Объект.СуммаПремии;
//	//Док.ТипЗаказа=Справочники.ТипыЗаказов.
//	Док.ХозОперация=Справочники.ХозОперации.ЗаказПокупателя;
//	
//	Строка=Док.Товары.Добавить();
//	Строка.Количество=1;
//	Строка.ЕдиницаИзмерения=Объект.ФинансоваяУслуга.ВидУслуги.Номенклатура.ОсновнаяЕдиницаИзмерения;
//	Строка.Коэффициент=1;
//	Строка.Номенклатура=Объект.ФинансоваяУслуга.ВидУслуги.Номенклатура;
//	Строка.СтавкаНДС=Объект.ФинансоваяУслуга.ВидУслуги.Номенклатура.СтавкаНДС;
//	Строка.Сумма=Объект.СуммаПремии;
//	Строка.СуммаВсего=Объект.СуммаПремии;
//	Строка.СуммаНДС=Объект.СуммаНДС;
//	Строка.Цена=Объект.СуммаПремии;
//КонецФункции	

&НаКлиенте
Процедура кнЗаполнитьГрафик(Команда)
	
	ЗаполнитьГрафик();
	
КонецПроцедуры

Процедура ЗаполнитьГрафик()
	
	Модуль = РеквизитФормыВЗначение("Объект");
	
	Если ЗначениеЗаполнено(Объект.АлгоритмРассрочки) Тогда
		Объект.ГрафикОплаты.Очистить();
		//НачДата = ДатаСтрахования;
		Для Каждого Строка Из Объект.АлгоритмРассрочки.Алгоритмы Цикл
			НоваяСтрока = Объект.ГрафикОплаты.Добавить();
			НоваяСтрока.ДатаОплаты = ДобавитьМесяц(Объект.ДатаНачалаСтрахования,Строка.КоличествоМесяцев);
			НоваяСтрока.Сумма = Модуль.ПолучитьСуммуДокумента() * Строка.Процент / 100;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте
//Процедура ЗаказПокупателяНажатие(Элемент, СтандартнаяОбработка) СтандартнаяОбработка=Ложь; ОткрытьЗначение(Объект.ЗаказПокупателя) КонецПроцедуры
&НаКлиенте
Процедура кнСформироватьЗаказПокупателя(Команда)
	
	Если НЕ Объект.ЗаказПокупателя.Пустая() или СформироватьЗаказПокупателя() Тогда
		ОткрытьЗначение(Объект.ЗаказПокупателя);
	КонецЕсли
	
КонецПроцедуры

Функция СформироватьЗаказПокупателя()
	
	Если Объект.Ссылка.Пустая() Тогда
		Сообщить("Документ не записан", СтатусСообщения.Информация);
		Возврат Ложь;
	КонецЕсли;
	Модуль = РеквизитФормыВЗначение("Объект");
	Отказ = Ложь;
	Попытка
		Модуль.СформироватьЗаказПокупателя(Отказ);
	Исключение
		//Предупреждение("При формировании заказа произошла ошибка, подробности в служебных сообщенниях!");
		Возврат Ложь;
	КонецПопытки;
	
	Если НЕ Отказ Тогда
		ЗначениеВРеквизитФормы(Модуль, "Объект");
		Модифицированность = Истина;
		УстановитьПараметрыДинамическогоСпискаВзаиморасчеты();
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СтраховаяКомпанияПриИзменении(Элемент)
	УстановитьПараметрыДинамическогоСпискаБСО()
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииБСО(Элемент)
	УстановитьПараметрыДинамическогоСпискаБСО()
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПокупателяПриИзменении(Элемент)
	УстановитьПараметрыДинамическогоСпискаВзаиморасчеты()
КонецПроцедуры

//+пересчет сумм документа
&НаКлиенте
Процедура ПлатежнаяИнформацияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПересчитатьСуммы()
КонецПроцедуры

&НаКлиенте
Процедура ПлатежнаяИнформацияИзменение(Элемент)
	ПересчитатьСуммы()
КонецПроцедуры

&НаКлиенте
Процедура ЗаменяемыйПолисПриИзменении(Элемент)
	ПересчитатьСуммы()
КонецПроцедуры

&НаКлиенте
Процедура ЗаменаБезДоплатыПриИзменении(Элемент)
	ПересчитатьСуммы();
	УправлениеЭлементами()
КонецПроцедуры

Процедура ПересчитатьСуммы()
	
	//Объект.СтраховаяСумма=Объект.ПлатежнаяИнформация.Итог("СтраховаяСумма");
	//Объект.СуммаПремии=Объект.ПлатежнаяИнформация.Итог("СтраховаяПремия");
	
	//доплата
	Если ЗначениеЗаполнено(Объект.ЗаменяемыйПолис) Тогда
		Объект.СуммаДоплаты = ?(Объект.ЗаменаБезДоплаты, 0, Объект.СуммаПремии - Объект.ЗаменяемыйПолис.СуммаДокумента);
	Иначе
		Объект.СуммаДоплаты=0;
	КонецЕсли;	
	
	Объект.СуммаДокумента = РеквизитФормыВЗначение("Объект").ПолучитьСуммуДокумента();
	Если Не Объект.Организация.ОсвобожденОтНДС Тогда
		// Трояновский К.Е. 15.02.2019 12:00:12 {
		// Закомментировано по DMSCOR-1087
		//Если Объект.Дата >= '20190101' Тогда
		//	Объект.СуммаНДС=Объект.СуммаДокумента*20/120;
		//Иначе
		//	Объект.СуммаНДС=Объект.СуммаДокумента*18/118;
		//КонецЕсли;
		Объект.СуммаНДС = Объект.СуммаДокумента * Справочники.СтавкиНДС.ОсновнаяСтавкаНДС.Ставка / (100 + Справочники.СтавкиНДС.ОсновнаяСтавкаНДС.Ставка);
		// Трояновский К.Е. 15.02.2019 12:00:12 }
	КонецЕсли;
	
КонецПроцедуры
//-пересчет сумм документа
	
&НаКлиенте
Процедура ДвиженияБСОВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элементы.ДвиженияБСО.ТекущиеДанные.Документ)
КонецПроцедуры

&НаКлиенте
Процедура ВзаиморасчетыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элементы.Взаиморасчеты.ТекущиеДанные.Документ)
КонецПроцедуры

&НаКлиенте
Процедура ЛицаДопущенныеКУправлениюТСПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Объект.ЛицаДопущенныеКУправлениюТС.Количество() = 0 Тогда
		Отказ = Истина;
		ДобавитьВодительскоеУдостоверениеКонтрагента();
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьВодительскоеУдостоверениеКонтрагента() Экспорт
	
	СтрЛицДопУпр = Объект.ЛицаДопущенныеКУправлениюТС.Добавить();
	СтрЛицДопУпр.ВодительскоеУдостоверение = ВодительскоеУдостоверение(Объект.Контрагент);
	СтрЛицДопУпр.ГодНачалаВодительскогоСтажа = СтрЛицДопУпр.ВодительскоеУдостоверение.ДатаВыдачи;
	СтрЛицДопУпр.ЛицоДопущенное = Объект.Контрагент;
	СтрЛицДопУпр.ВодительскийСтаж = Год(Объект.Дата) - Год(СтрЛицДопУпр.ГодНачалаВодительскогоСтажа);
	
КонецПроцедуры	

Функция ВодительскоеУдостоверение(Контрагент)
	
	Запрос = Новый Запрос("Выбрать Ссылка
						|Из Справочник.ПодтверждающиеДокументы
						|ГДЕ Владелец=&Контрагент И НЕ ПометкаУдаления
						|	И ВидПодтверждающегоДокумента=Значение(Перечисление.ВидыДокументов.Удостоверение)");
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура ВодительскоеУдостоверениеПриИзменении(Элемент)
	
	Элементы.ЛицаДопущенныеКУправлениюТС.ТекущиеДанные.ГодНачалаВодительскогоСтажа = Элементы.ЛицаДопущенныеКУправлениюТС.ТекущиеДанные.ВодительскоеУдостоверение.ДатаВыдачи;
	Элементы.ЛицаДопущенныеКУправлениюТС.ТекущиеДанные.ВодительскийСтаж = Год(Объект.Дата) - Год(Элементы.ЛицаДопущенныеКУправлениюТС.ТекущиеДанные.ГодНачалаВодительскогоСтажа);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетДатыОкончанияСтрахования(Элемент)
	
	Если Объект.ТипПериодаСтрахования = Перечисления.DMS_ПериодичностьДействияБаллов.Год Тогда
		Объект.ДатаОкончанияСтрахования = ДобавитьМесяц(Объект.ДатаНачалаСтрахования, 12 * Объект.СрокСтрахования) - 86400
	ИначеЕсли Объект.ТипПериодаСтрахования = Перечисления.DMS_ПериодичностьДействияБаллов.Месяц Тогда
		Объект.ДатаОкончанияСтрахования = ДобавитьМесяц(Объект.ДатаНачалаСтрахования, Объект.СрокСтрахования) - 86400
	ИначеЕсли Объект.ТипПериодаСтрахования = Перечисления.DMS_ПериодичностьДействияБаллов.День Тогда
		Объект.ДатаОкончанияСтрахования = Объект.ДатаНачалаСтрахования + Объект.СрокСтрахования * 86400 - 86400
	КонецЕсли;
	
	Если Объект.ДатаНачалаИспользованияТС1 = '00010101' И Объект.ДатаОкончанияИспользованияТС1 = '00010101' Тогда 
		Объект.ДатаНачалаИспользованияТС1 = Объект.ДатаНачалаСтрахования;
		Объект.ДатаОкончанияИспользованияТС1 = Объект.ДатаОкончанияСтрахования;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Ссылка.Пустая() Тогда
		Если Не Объект.БезФраншизы И Объект.СуммаФраншизы = 0 Тогда
			Сообщить("Укажите сумму франшизы или отметьте, что полис без франшизы!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВодительскоеУдостоверениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.ЛицаДопущенныеКУправлениюТС.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекДанные.ЛицоДопущенное) Тогда
		ЗначениеОтбора = Новый Структура("Владелец", ТекДанные.ЛицоДопущенное);
		ПараметрыВыбораИзСписка = Новый Структура("Отбор", ЗначениеОтбора);
		ОткрытьФорму("Справочник.ПодтверждающиеДокументы.ФормаВыбора", ПараметрыВыбораИзСписка, Элемент);
	Иначе
		ОткрытьФорму("Справочник.ПодтверждающиеДокументы.ФормаВыбора",, Элемент);
	КонецЕсли;
	
КонецПроцедуры
