
Процедура СоздатьПлатежи() Экспорт

	Если не ЗначениеЗаполнено(Кошелек) Тогда
		Сообщить("Не заполнен кошелец");
		Возврат;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(СтатьяРасходаОсновногоДолга) Тогда
		Сообщить("Не заполнена статья расходов по основному долгу");
		Возврат;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(СтатьяРасходаПроцентов) Тогда
		Сообщить("Не заполнена статья расходов по процентам");
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент из Платежи Цикл
		НовыйЭлемент = Справочники
	КонецЦикла;
	
КонецПроцедуры

Процедура РассчитатьПлатежи() Экспорт
	
	Платежи.Очистить();
	
	МесячныйПроцент = ГодовойПроцент/12;
	
	ПервыйВзносСумма = Стоимость*ПервыйВзнос/100;
	
	ТекущийДолг = Стоимость - ПервыйВзносСумма;
	
	СуммаКредита = ТекущийДолг;
	
	ТекущаяДата = ДобавитьМесяц(ДатаПолучения,1)+1*24*60*60;
	
	Если не АннуитетныеПлатежи Тогда
		
		Если СрокКредита = 0 Тогда
			Возврат;
		Иначе
			СуммаПогашенияОсновногоДолга = Окр(ТекущийДолг/(СрокКредита),2);
		КонецЕсли;
		
		СчетчикПериодов = 0;
		Пока ТекущийДолг > 0 Цикл
			СчетчикПериодов = СчетчикПериодов + 1;
			ОплатаПроцентов = ТекущийДолг*МесячныйПроцент/100;
			НоваяСтрока = Платежи.Добавить();
			НоваяСтрока.Месяц = Формат(ТекущаяДата,"ДФ=""ММММ гггг""");
			НоваяСтрока.Дата = ТекущаяДата;
			НоваяСтрока.Проценты = ОплатаПроцентов;
			Если СчетчикПериодов = СрокКредита*12 Тогда
				НоваяСтрока.ОсновнойДолг = ТекущийДолг;
			Иначе
				НоваяСтрока.ОсновнойДолг = СуммаПогашенияОсновногоДолга;
			КонецЕсли;
			НоваяСтрока.ИтогоВыплаты = НоваяСтрока.Проценты + НоваяСтрока.ОсновнойДолг;
			ТекущийДолг = ТекущийДолг - НоваяСтрока.ОсновнойДолг;
			НоваяСтрока.ДолгБанку = ТекущийДолг;
			ТекущаяДата = ДобавитьМесяц(ТекущаяДата,1);
		КонецЦикла;
		
	Иначе
		
		Если МесячныйПроцент = 0 И Не СрокКредита = 0 Тогда
			Коэффициент = 0;
			ЕжемесячныеВыплаты = Окр(ТекущийДолг/(СрокКредита),2);
		ИначеЕсли СрокКредита = 0 Тогда
			Возврат;
		Иначе
			Коэффициент = (МесячныйПроцент/100*Pow((1+МесячныйПроцент/100),СрокКредита))/(Pow((1+МесячныйПроцент/100),СрокКредита)-1);
			ЕжемесячныеВыплаты = Окр(Коэффициент*ТекущийДолг,2);
		КонецЕсли;
		
		Для к = 1 по СрокКредита Цикл
			НоваяСтрока = Платежи.Добавить();
			НоваяСтрока.Месяц = Формат(ТекущаяДата,"ДФ=""ММММ гггг""");
			НоваяСтрока.Дата = ТекущаяДата;
			НоваяСтрока.Проценты = Окр(ТекущийДолг*МесячныйПроцент/100,2);
			Если к = СрокКредита Тогда
				НоваяСтрока.ОсновнойДолг = ТекущийДолг;
			Иначе
				НоваяСтрока.ОсновнойДолг = ЕжемесячныеВыплаты-НоваяСтрока.Проценты;
			КонецЕсли;
			НоваяСтрока.ИтогоВыплаты = НоваяСтрока.ОсновнойДолг + НоваяСтрока.Проценты;
			ТекущийДолг = ТекущийДолг - НоваяСтрока.ОсновнойДолг;
			НоваяСтрока.ДолгБанку = ТекущийДолг;
			ТекущаяДата = ДобавитьМесяц(ТекущаяДата,1);
		КонецЦикла;
		
	КонецЕсли;
	
	Если Платежи.Количество() > 0 Тогда
		
		ЕжемесПлатеж = Платежи[0].ИтогоВыплаты;
		
	КонецЕсли;
	
КонецПроцедуры 