Процедура ПередЗаписью(Отказ, Замещение)
	Если ЭтотОбъект.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON();
	Для Каждого ТекСтрока из ЭтотОбъект Цикл
		ЧтениеJSON.УстановитьСтроку(ТекСтрока.ТелоЗапроса);
		Попытка
			стСобытие = ПрочитатьJSON(ЧтениеJSON);
		Исключение
			ТекСтрока.НужноВыгрузить = Ложь;
			Сообщить(ОписаниеОшибки(), СтатусСообщения.Внимание);
			Продолжить;
		КонецПопытки;
		
		Если стСобытие.Свойство("worksheet_id") Тогда
			ТекСтрока.НужноВыгрузить = ЗначениеЗаполнено(стСобытие.worksheet_id);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
