Функция ПолучитьСписокКлиентовПроизвольногоЗапроса(СхемаОбзвона) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = СхемаОбзвона.ТекстПроизвольногоЗапроса;
	
	Для Каждого Стр Из СхемаОбзвона.ПараметрыПроизвольногоЗапроса Цикл
		
		Если ЗначениеЗаполнено(Стр.ЗначениеПараметра) Тогда
			Запрос.УстановитьПараметр(Стр.Параметр, Стр.ЗначениеПараметра);
		Иначе
			Запрос.УстановитьПараметр(Стр.Параметр, Стр.Список.Получить());
		КонецЕсли;
		
	КонецЦикла;
		
	Результат = Запрос.Выполнить().Выгрузить();		
		
	Возврат Результат;

КонецФункции

Функция ЕстьОшибкиВПроизвольномЗапросе(ТекстПроизвольногоЗапроса, ПараметрыПроизвольногоЗапроса) Экспорт
	
	Запрос       = Новый Запрос;
	Запрос.Текст = ТекстПроизвольногоЗапроса;
	
	Для Каждого Стр Из ПараметрыПроизвольногоЗапроса Цикл
		
		Если ЗначениеЗаполнено(Стр.Список) Тогда
			Запрос.УстановитьПараметр(Стр.Параметр, Стр.Список.Получить());
		Иначе
			Запрос.УстановитьПараметр(Стр.Параметр, Стр.ЗначениеПараметра);
		КонецЕсли;
		
	КонецЦикла;

	Попытка
		Результат = Запрос.Выполнить().Выгрузить();
		
		Если Результат.Колонки.Найти("Клиент") = Неопределено Тогда
			Сообщить("В запросе нет поля результата Клиент");
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Истина;
	КонецПопытки;
	
КонецФункции

Функция ПолучитьСписокКлиентовВыборки(СхемаОбзвона) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаДляВыборки(СхемаОбзвона);
	
	Запрос.УстановитьПараметр("СхемаОбзвона", СхемаОбзвона);
	
	ПлановаяДата = СхемаОбзвона.ОкончаниеПериода;
		
	Если НЕ СхемаОбзвона.Одноразовая Тогда
		
		ПлановаяДата = НачалоДня(ТекущаяДата()) + СхемаОбзвона.ДнейНаОбзвон * 86400;
				
	КонецЕсли;

	Если ЗначениеЗаполнено(СхемаОбзвона.ДилерскийЦентр) Тогда
		Запрос.УстановитьПараметр("Организация", СхемаОбзвона.ДилерскийЦентр.Организация);
		Запрос.УстановитьПараметр("ДилерскийЦентр", СхемаОбзвона.ДилерскийЦентр);
	КонецЕсли;

    Запрос.УстановитьПараметр("ПлановаяДата", ПлановаяДата);	
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
    Запрос.УстановитьПараметр("Телефон", Перечисления.ТипыКонтактнойИнформации.Телефон);	
    Запрос.УстановитьПараметр("Емаил", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);	
	
	Если ЗначениеЗаполнено(СхемаОбзвона.Событие) Тогда
		Запрос.УстановитьПараметр("Событие", СхемаОбзвона.Событие);
		Запрос.УстановитьПараметр("ДнейДо", СхемаОбзвона.ДнейДоСобытия);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(СхемаОбзвона.ВидКонтрагента) Тогда
		Запрос.УстановитьПараметр("ФормаСобственности",СхемаОбзвона.ВидКонтрагента);
	КонецЕсли;
			
	Пол = Новый СписокЗначений;
	
	Если СхемаОбзвона.ПолМужской Тогда
		Пол.Добавить(Перечисления.ПолФизическихЛиц.Мужской);
	КонецЕсли;
	
	Если СхемаОбзвона.ПолЖенский Тогда
		Пол.Добавить(Перечисления.ПолФизическихЛиц.Женский);
	КонецЕсли;
	
	Если Пол.Количество()=1 Тогда 
		Запрос.УстановитьПараметр("Пол",Пол);
	КонецЕсли;
	
	Если СхемаОбзвона.ВидКонтрагента = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
		Запрос.УстановитьПараметр("СогласиеНаОбработкуПерсональныхДанных", Перечисления.ВариантыОтветов.Да);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СхемаОбзвона.ПоследнийТО) Тогда 
		Запрос.УстановитьПараметр("ПоследнийВидТО",СхемаОбзвона.ПоследнийТО);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СхемаОбзвона.ПоследнийЗаездОт) Тогда 
		Запрос.УстановитьПараметр("ПоследнийЗаездОт",СхемаОбзвона.ПоследнийЗаездОт);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СхемаОбзвона.ПоследнийЗаездДо) Тогда 
		Запрос.УстановитьПараметр("ПоследнийЗаездДо",СхемаОбзвона.ПоследнийЗаездДо);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СхемаОбзвона.ВозрастОт) Тогда 
		Запрос.УстановитьПараметр("ВозрастОт",СхемаОбзвона.ВозрастОт);
		Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СхемаОбзвона.ВозрастДо) И СхемаОбзвона.ВозрастДо<>80 Тогда
		Запрос.УстановитьПараметр("ВозрастДо",СхемаОбзвона.ВозрастДо);
		Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СхемаОбзвона.ПробегОт) Тогда 
		Запрос.УстановитьПараметр("ПробегОт",СхемаОбзвона.ПробегОт);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СхемаОбзвона.ПробегДо) Тогда
		Запрос.УстановитьПараметр("ПробегДо",СхемаОбзвона.ПробегДо);
	КонецЕсли;

	
	Если ЗначениеЗаполнено(СхемаОбзвона.ГодВыпускаОт) Тогда 
		Запрос.УстановитьПараметр("ГодВыпускаОт",СхемаОбзвона.ГодВыпускаОт);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СхемаОбзвона.ГодВыпускаДо) Тогда 
		Запрос.УстановитьПараметр("ГодВыпускаДо",СхемаОбзвона.ГодВыпускаДо);
	КонецЕсли;
	
	Если СхемаОбзвона.Модели.Количество()>0 Тогда
		Запрос.УстановитьПараметр("Модель",СхемаОбзвона.Модели.ВыгрузитьКолонку("Модель"));
	КонецЕсли;
	
	Если СхемаОбзвона.Версии.Количество()>0 Тогда
		Запрос.УстановитьПараметр("Версия",СхемаОбзвона.Версии.ВыгрузитьКолонку("Версия"));
	КонецЕсли;
		
	Если СхемаОбзвона.ТипыКПП.Количество()>0 Тогда 
		Запрос.УстановитьПараметр("ТипКПП",СхемаОбзвона.ТипыКПП.ВыгрузитьКолонку("ТипКПП"));
	КонецЕсли;
	
	Если СхемаОбзвона.ТипыКузова.Количество()>0 Тогда 
		Запрос.УстановитьПараметр("ТипКузова",СхемаОбзвона.ТипыКузова.ВыгрузитьКолонку("ТипКузова"));
	КонецЕсли;
	
	Если СхемаОбзвона.ТипыДвигателей.Количество()>0 Тогда 
		Запрос.УстановитьПараметр("ТипДвигателя",СхемаОбзвона.ТипыДвигателей.ВыгрузитьКолонку("ТипДвигателя"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СхемаОбзвона.ДатаНачалаГарантии) Тогда 
		Запрос.УстановитьПараметр("ДатаНачалаГарантии",СхемаОбзвона.ДатаНачалаГарантии);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СхемаОбзвона.ДатаОкончанияГарантии) Тогда 
		Запрос.УстановитьПараметр("ДатаОкончанияГарантии",СхемаОбзвона.ДатаОкончанияГарантии);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СхемаОбзвона.ДатаРегистрацииОт) Тогда
		Запрос.УстановитьПараметр("ДатаРегистрацииОт",СхемаОбзвона.ДатаРегистрацииОт);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СхемаОбзвона.ДатаРегистрацииДо) Тогда 
		Запрос.УстановитьПараметр("ДатаРегистрацииДо",СхемаОбзвона.ДатаРегистрацииДо);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СхемаОбзвона.ПробегОт) Тогда 
		Запрос.УстановитьПараметр("ПробегОт",СхемаОбзвона.ПробегОт);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СхемаОбзвона.ПробегДо) Тогда 
		Запрос.УстановитьПараметр("ПробегДо",СхемаОбзвона.ПробегДо);
	КонецЕсли;
	
    Если СхемаОбзвона.СервисныеКампании.Количество()>0 Тогда
		Запрос.УстановитьПараметр("СервисныеКампании",СхемаОбзвона.СервисныеКампании.Выгрузить());
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СхемаОбзвона.Опции) Тогда
		Запрос.УстановитьПараметр("Опции",СхемаОбзвона.Опции.ВыгрузитьКолонку("Опция"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СхемаОбзвона.Оборудование) Тогда
		Запрос.УстановитьПараметр("Оборудование",СхемаОбзвона.Оборудование.ВыгрузитьКолонку("Оборудование"));
	КонецЕсли;
	
	ТабДопСегментацияПоКлиенту = Новый ТаблицаЗначений;
	ТабДопСегментацияПоКлиенту.Колонки.Добавить("Реквизит",);
	ТабДопСегментацияПоКлиенту.Колонки.Добавить("Значение",);
	
	Для Каждого Стр Из СхемаОбзвона.ДопСегментацияПоКлиенту Цикл
		
		Поиск = Новый Структура("Значение",  Стр.Реквизит);
		СущСтроки = ТабДопСегментацияПоКлиенту.НайтиСтроки(Поиск);
		
		Если СущСтроки.Количество()=0 Тогда
		
			НовСтрока = ТабДопСегментацияПоКлиенту.Добавить();
			
			НовСтрока.Реквизит = Стр.Реквизит;
			НовСтрока.Значение = Стр.Значение;
		
		Иначе
			
			НовСтрока = СущСтроки[0];
			СущЗначение = НовСтрока.Значение;
			
			Если Типзнч(СущЗначение) <> Тип("СписокЗначений") Тогда
								
				СущЗначение = Новый СписокЗначений;
				СущЗначение.Добавить(НовСтрока.Значение);
				
			КонецЕсли;
			
			СущЗначение.Добавить(Стр.Значение);
				
			НовСтрока.Значение = СущЗначение;
		
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Стр Из СхемаОбзвона.ДопСегментацияПоАвтомобилю Цикл
					
		Поиск = Новый Структура("Реквизит",  Стр.Реквизит);
		СущСтроки = ТабДопСегментацияПоКлиенту.НайтиСтроки(Поиск);
		
		Если СущСтроки.Количество()=0 Тогда
		
			НовСтрока = ТабДопСегментацияПоКлиенту.Добавить();
			
			НовСтрока.Реквизит = Стр.Реквизит;
			НовСтрока.Значение = Стр.Значение;
		
		Иначе
			
			НовСтрока = СущСтроки[0];
			СущЗначение = НовСтрока.Значение;
			
			Если Типзнч(СущЗначение) <> Тип("СписокЗначений") Тогда
								
				СущЗначение = Новый СписокЗначений;
				СущЗначение.Добавить(НовСтрока.Значение);
				
			КонецЕсли;
			
			СущЗначение.Добавить(Стр.Значение);
				
			НовСтрока.Значение = СущЗначение;
		
		КонецЕсли;
					
	КонецЦикла;
	
	Для Каждого Стр Из СхемаОбзвона.ДопСегментацияПоПолису Цикл
					
		Поиск = Новый Структура("Реквизит",  Стр.Реквизит);
		СущСтроки = ТабДопСегментацияПоКлиенту.НайтиСтроки(Поиск);
		
		Если СущСтроки.Количество()=0 Тогда
		
			НовСтрока = ТабДопСегментацияПоКлиенту.Добавить();
			
			НовСтрока.Реквизит = Стр.Реквизит;
			НовСтрока.Значение = Стр.Значение;
		
		Иначе
			
			НовСтрока = СущСтроки[0];
			СущЗначение = НовСтрока.Значение;
			
			Если Типзнч(СущЗначение) <> Тип("СписокЗначений") Тогда
								
				СущЗначение = Новый СписокЗначений;
				СущЗначение.Добавить(НовСтрока.Значение);
				
			КонецЕсли;
			
			СущЗначение.Добавить(Стр.Значение);
				
			НовСтрока.Значение = СущЗначение;
		
		КонецЕсли;
					
	КонецЦикла;
	
	Для Каждого Стр Из ТабДопСегментацияПоКлиенту Цикл 
		Запрос.УстановитьПараметр(Стр.Реквизит, Стр.Значение);	
	КонецЦикла;
	
	ТабРезультат = Запрос.Выполнить().Выгрузить();
	
	Возврат ТабРезультат;
	
КонецФункции

Функция ПолучитьСписокКлиентоПоЗадачам(СхемаОбзвона) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Renault_События.Контрагент КАК Клиент
	               |ИЗ
	               |	Задача.Renault_События КАК Renault_События
	               |ГДЕ
	               |	Renault_События.Объект = &СхемаОбзвона
	               |	И НЕ Renault_События.ПометкаУдаления
	               |	И НЕ Renault_События.Контрагент В (&Контрагент)";
	
	Запрос.УстановитьПараметр("СхемаОбзвона", СхемаОбзвона);
	
	КонтрагентСписок = Новый СписокЗначений;
	КонтрагентСписок.Добавить(Справочники.CRM_ПотенциальныеКонтрагенты.ПустаяСсылка());
	КонтрагентСписок.Добавить(Справочники.Контрагенты.ПустаяСсылка());
	КонтрагентСписок.Добавить(Неопределено);
	КонтрагентСписок.Добавить(Null);
	
	Запрос.УстановитьПараметр("Контрагент", КонтрагентСписок);
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

Функция ПолучитьТекстЗапросаДляВыборки(СхемаОбзвона) 
		
	ЕстьОтборПоПолису = Ложь;
	
	Если СхемаОбзвона.ДопСегментацияПоПолису.Количество()>0 ИЛИ СхемаОбзвона.Событие = "Дней до окончания полиса" 
		                                                    ИЛИ СхемаОбзвона.Событие = "Дней до очередного взноса по полису" 
			                                                ИЛИ СхемаОбзвона.Событие = "Дней с момента окончания последнего полиса"  
															ИЛИ СхемаОбзвона.НетПолисов Тогда
		ЕстьОтборПоПолису = Истина;
	КонецЕсли;
    
	ТекстЗапросаДляВыборки = "";
	
	Если ЕстьОтборПоПолису Тогда  //отбор по страховому полису
		
		ТекстЗапросаДляВыборки = ДополнитьТекстОтборомПоПолису(СхемаОбзвона);
				
	Иначе //отбор по контрагенту
		
		Если ЗначениеЗаполнено(СхемаОбзвона.ДилерскийЦентр) Тогда
			ТекстЗапросаДляВыборки = ТекстЗапросаДляВыборки+
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	 		|	Контрагенты.Ссылка
	 		|ПОМЕСТИТЬ ВТКлиенты
	 		|ИЗ
	 		|	Справочник.Контрагенты КАК Контрагенты
	 		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	 		|		ПО Контрагенты.ОсновнойДоговорВзаиморасчетов = ДоговорыВзаиморасчетов.Ссылка
	 		|			И (НЕ ДоговорыВзаиморасчетов.ПометкаУдаления)
	 		|			И (ДоговорыВзаиморасчетов.Организация = &Организация)
	 		|ГДЕ
	 		|	НЕ Контрагенты.ПометкаУдаления";
		Иначе
			ТекстЗапросаДляВыборки = ТекстЗапросаДляВыборки+
	 		" ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 		|	Контрагенты.Ссылка
	 		|ПОМЕСТИТЬ ВТКлиенты
	 		|ИЗ
	 		|	Справочник.Контрагенты КАК Контрагенты
	 		|ГДЕ
	 		|	НЕ Контрагенты.ПометкаУдаления ";
		КонецЕсли;
		
	КонецЕсли;
	
	//отбор по контрагенту
	
    ТекстЗапросаДляВыборки = ТекстЗапросаДляВыборки + ДополнитьТекстОтборомПоКонтрагенту(СхемаОбзвона);
	
	//отбор по автомобилю
	
    ТекстЗапросаДляВыборки = ТекстЗапросаДляВыборки + ДополнитьТекстОтборомПоАвтомобилю(СхемаОбзвона);	
	
	//отбор по сервисным кампаниям и по событиям
	
	ТекстЗапросаДляВыборки = ТекстЗапросаДляВыборки + ДополнитьТекстОтборомПоСобытиям(СхемаОбзвона);
	
	ТекстЗапросаДляВыборки = ТекстЗапросаДляВыборки	+
	"
	|ИНДЕКСИРОВАТЬ ПО
	|	Клиент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ Различные
	|	ВТКлиентыИтог.Клиент КАК Клиент,
	|   isnull(КонтактнаяИнформация.Представление,"""") КАК Телефон,
	|   isnull(КонтактнаяИнформацияЕмаил.Представление,"""") КАК ЕмаилКлиента
	|ИЗ
	|	ВТКлиентыИтог КАК ВТКлиентыИтог
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|	ПО ВТКлиентыИтог.Клиент = КонтактнаяИнформация.Объект
	|		И (КонтактнаяИнформация.Тип = &Телефон)
	|		И (КонтактнаяИнформация.ЗначениеПоУмолчанию) 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияЕмаил
	|	ПО ВТКлиентыИтог.Клиент = КонтактнаяИнформацияЕмаил.Объект
	|		И (КонтактнаяИнформацияЕмаил.Тип = &Емаил)
	|		И (КонтактнаяИнформацияЕмаил.ЗначениеПоУмолчанию) ";
	
	Возврат ТекстЗапросаДляВыборки;
	
КонецФункции

Функция ДополнитьТекстОтборомПоПолису(СхемаОбзвона)
	
	Если СхемаОбзвона.НетПолисов Тогда
		
		ТекстДополнения = 
		"
		|ВЫБРАТЬ РАЗЛИЧНЫЕ                                                                                              
	 	|	СтраховойПолис.Контрагент КАК Ссылка
	 	|ПОМЕСТИТЬ ВТСтраховыеПолисы
	 	|ИЗ
	 	|	Документ.Renault_СтраховойПолис КАК СтраховойПолис
	 	|ГДЕ
	 	|	СтраховойПолис.Проведен "
		+?(ЗначениеЗаполнено(СхемаОбзвона.ДилерскийЦентр), " И СтраховойПолис.Организация = &Организация ", "")
		+
		"
		|;
	    |
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
 		|	Контрагенты.Ссылка
 		|ПОМЕСТИТЬ ВТКлиенты
 		|ИЗ
 		|	Справочник.Контрагенты КАК Контрагенты
		| ЛЕВОЕ СОЕДИНЕНИЕ ВТСтраховыеПолисы КАК ВТСтраховыеПолисы
		| ПО ВТСтраховыеПолисы.Ссылка = Контрагенты.Ссылка
		| ГДЕ
	    |	НЕ Контрагенты.ПометкаУдаления 
		|   И isnull(ВТСтраховыеПолисы.Ссылка, Значение(Справочник.Контрагенты.ПустаяСсылка)) = Значение(Справочник.Контрагенты.ПустаяСсылка) ";

		Возврат ТекстДополнения;
		
	КонецЕсли;
	
	Если СхемаОбзвона.Событие = "Дней до очередного взноса по полису" Тогда
		
		ТекстДополнения = 

		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Renault_СтраховойПолисГрафикОплаты.Ссылка.Контрагент КАК Ссылка
		|ПОМЕСТИТЬ ВТСтраховыеПолисы
		|ИЗ
		|	Документ.Renault_СтраховойПолис.ГрафикОплаты КАК Renault_СтраховойПолисГрафикОплаты
		|ГДЕ
		|	Renault_СтраховойПолисГрафикОплаты.Ссылка.Проведен "
		+?(ЗначениеЗаполнено(СхемаОбзвона.ДилерскийЦентр), " И Renault_СтраховойПолисГрафикОплаты.Ссылка.Организация = &Организация ", "")
		+
		"
		|	И ВЫБОР
		|			КОГДА Renault_СтраховойПолисГрафикОплаты.Ссылка.ДатаОкончанияСтрахования <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					И Renault_СтраховойПолисГрафикОплаты.Ссылка.ДатаОкончанияСтрахования <= &ТекущаяДата
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И Renault_СтраховойПолисГрафикОплаты.ДатаОплаты >= &ТекущаяДата
		|	И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), НАЧАЛОПЕРИОДА(Renault_СтраховойПолисГрафикОплаты.ДатаОплаты, ДЕНЬ), ДЕНЬ) "+СхемаОбзвона.ВидСравненияПоСобытию+" &ДнейДо "
	
	ИначеЕсли СхемаОбзвона.Событие = "Дней с момента окончания последнего полиса" Тогда
		
		ТекстДополнения = 
			
	 	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 	|	СтраховойПолис.Контрагент КАК Ссылка,
	 	|	МАКСИМУМ(СтраховойПолис.ДатаОкончанияСтрахования) КАК ДатаОкончанияСтрахования
	 	|ПОМЕСТИТЬ ВТПоследниеСтраховыеПолисы
	 	|ИЗ
	 	|	Документ.Renault_СтраховойПолис КАК СтраховойПолис
	 	|ГДЕ
	 	|	СтраховойПолис.Проведен "
		+?(ЗначениеЗаполнено(СхемаОбзвона.ДилерскийЦентр), " И СтраховойПолис.Организация = &Организация ", "")
		+
		"
	 	|
	 	|СГРУППИРОВАТЬ ПО
	 	|	СтраховойПолис.Контрагент
	 	|;
	 	|
	 	|////////////////////////////////////////////////////////////////////////////////
	 	|ВЫБРАТЬ
	 	|	ВТПоследниеСтраховыеПолисы.Ссылка
	 	|ПОМЕСТИТЬ ВТСтраховыеПолисы
	 	|ИЗ
	 	|	ВТПоследниеСтраховыеПолисы КАК ВТПоследниеСтраховыеПолисы
	 	|ГДЕ
	 	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВТПоследниеСтраховыеПолисы.ДатаОкончанияСтрахования, ДЕНЬ), НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), ДЕНЬ) "+СхемаОбзвона.ВидСравненияПоСобытию+" &ДнейДо " ;
		
	Иначе

		ТекстДополнения = 
			
	 	"ВЫБРАТЬ РАЗРЕШЕННЫЕ                                                                                              
	 	|	СтраховойПолис.Контрагент КАК Ссылка
	 	|ПОМЕСТИТЬ ВТСтраховыеПолисы
	 	|ИЗ
	 	|	Документ.Renault_СтраховойПолис КАК СтраховойПолис
	 	|ГДЕ
	 	|	 "//СтраховойПолис.Проведен
		+?(ЗначениеЗаполнено(СхемаОбзвона.ДилерскийЦентр), "  СтраховойПолис.Организация = &Организация ", "");
	
	КонецЕсли;

	Если СхемаОбзвона.Событие = "Дней до окончания полиса" Тогда
		
		ТекстДополнения = ТекстДополнения+
		"	
		|   И СтраховойПолис.ДатаОкончанияСтрахования > &ТекущаяДата
		|   И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), НАЧАЛОПЕРИОДА(СтраховойПолис.ДатаОкончанияСтрахования, ДЕНЬ), ДЕНЬ) "+СхемаОбзвона.ВидСравненияПоСобытию+" &ДнейДо "
			
	КонецЕсли;
			
	Если СхемаОбзвона.ДопСегментацияПоПолису.Количество()>0 Тогда
	
		ОбработанныйПараметр = Новый СписокЗначений;
					
		Для Каждого Стр Из СхемаОбзвона.ДопСегментацияПоПолису Цикл 
			
			Если ОбработанныйПараметр.НайтиПоЗначению(Стр.Реквизит) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
				
			ЕстьКовычка = Ложь;
			
			ВидСравненияПоля = ОпределитьВидСравнения(Стр.ВидСравнения);
			
			Если ВидСравненияПоля = Неопределено Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Если Найти(ВидСравненияПоля,"(")>0 Тогда
				
				ЕстьКовычка = Истина;
								
			КонецЕсли;
							
			ТекстДополнения = ТекстДополнения+
			"	
			|   И СтраховойПолис."+Стр.Реквизит+" "+ВидСравненияПоля+" &"+Стр.Реквизит+?(ЕстьКовычка, ") "," "); 
			
			ОбработанныйПараметр.Добавить(Стр.Реквизит);
			
		КонецЦикла;
		
	КонецЕсли;	
	
	ТекстДополнения = ТекстДополнения+

	"
	|;
    |
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	ВТСтраховыеПолисы.Ссылка
	|ПОМЕСТИТЬ ВТКлиенты
	|ИЗ
	|	ВТСтраховыеПолисы КАК ВТСтраховыеПолисы
	| ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	| ПО ВТСтраховыеПолисы.Ссылка = Контрагенты.Ссылка
	| ГДЕ
    |	НЕ Контрагенты.ПометкаУдаления ";
			
	Возврат ТекстДополнения;

КонецФункции

Функция ДополнитьТекстОтборомПоКонтрагенту(СхемаОбзвона)
	
	Пол = Новый СписокЗначений;
	
	Если СхемаОбзвона.ПолМужской Тогда	
		Пол.Добавить(Перечисления.ПолФизическихЛиц.Мужской);
	КонецЕсли;
	
	Если СхемаОбзвона.ПолЖенский Тогда	
		Пол.Добавить(Перечисления.ПолФизическихЛиц.Женский);
	КонецЕсли;
	
	ЕстьОтборПоПолу = ?(Пол.Количество()=1, Истина, Ложь);

	ТекстДополнения = ""
	
	+?(СхемаОбзвона.ВидКонтрагента = Перечисления.ФормыСобственности.ЧастноеЛицо, 
	"	
	|   И Контрагенты.СогласиеНаОбработкуПерсональныхДанных = &СогласиеНаОбработкуПерсональныхДанных ",
	"")
	+?(СхемаОбзвона.Событие = "Дней до дня рождения", 
	"	
	|   И 	РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(Контрагенты.ДатаРождения, ГОД, ГОД(НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)) - ГОД(Контрагенты.ДатаРождения)), НАЧАЛОПЕРИОДА(&ТекущаяДата,ДЕНЬ), ДЕНЬ)  "+СхемаОбзвона.ВидСравненияПоСобытию+" &ДнейДО ",  
	"")
	+?(ЗначениеЗаполнено(СхемаОбзвона.ВидКонтрагента), 
	"	
	|   И Контрагенты.ФормаСобственности = &ФормаСобственности ",  
	"")
	+?(ЕстьОтборПоПолу, 
	"	
	|   И Контрагенты.Пол В (&Пол) ", 
	"")
	+?(ЗначениеЗаполнено(СхемаОбзвона.ВозрастОт), 
	"	
	|   И РАЗНОСТЬДАТ(Контрагенты.ДатаРождения, &ТекущаяДата, ГОД) >= &ВозрастОт ", 
	"")
    +?(ЗначениеЗаполнено(СхемаОбзвона.ВозрастДо) И СхемаОбзвона.ВозрастДо<>80, 
	"	
	|   И РАЗНОСТЬДАТ(Контрагенты.ДатаРождения, &ТекущаяДата, ГОД) <= &ВозрастДо ", 
	"");
	
	ОбработанныйПараметр = Новый СписокЗначений;
	
	Для Каждого Стр Из СхемаОбзвона.ДопСегментацияПоКлиенту Цикл 
		
		Если ОбработанныйПараметр.НайтиПоЗначению(Стр.Реквизит) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
			
		ЕстьКовычка = Ложь;
		
		ВидСравненияПоля = ОпределитьВидСравнения(Стр.ВидСравнения);
		
		Если ВидСравненияПоля = Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если Найти(ВидСравненияПоля,"(")>0 Тогда
			
			ЕстьКовычка = Истина;
							
		КонецЕсли;
						
		ТекстДополнения = ТекстДополнения+
		"	  
		|   И Контрагенты."+Стр.Реквизит+" "+ВидСравненияПоля+" &"+Стр.Реквизит+?(ЕстьКовычка, ") "," "); 
		
		ОбработанныйПараметр.Добавить(Стр.Реквизит);
		
	КонецЦикла;

	Возврат ТекстДополнения;
	
КонецФункции

Функция ДополнитьТекстОтборомПоАвтомобилю(СхемаОбзвона)
		
	ТекстДополнения =
	
	"
	|;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |	ВТКлиенты.Ссылка,
    |	isnull(АвтомобилиСрезПоследних.Автомобиль, Значение(Справочник.Автомобили.ПустаяСсылка)) КАК Автомобиль
    |ПОМЕСТИТЬ ВТКлиентыИАвтомобили
    |ИЗ
    |	ВТКлиенты КАК ВТКлиенты
    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних(	,
	|	ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Хозяин)
	|		И Значение ССЫЛКА Справочник.Контрагенты) КАК АвтомобилиСрезПоследних
	|		ПО ВТКлиенты.Ссылка = АвтомобилиСрезПоследних.Значение 				
    |ГДЕ
	|   Истина "
	+?(ЗначениеЗаполнено(СхемаОбзвона.ГодВыпускаОт), 
	"	
	|   И ГОД(АвтомобилиСрезПоследних.Автомобиль.ГодВыпуска) >= ГОД(&ГодВыпускаОт) ", 
	"")
    +?(ЗначениеЗаполнено(СхемаОбзвона.ГодВыпускаДо), 
	"	
	|   И ГОД(АвтомобилиСрезПоследних.Автомобиль.ГодВыпуска) <= ГОД(&ГодВыпускаДо) ", 
	"")
    +?(СхемаОбзвона.Модели.Количество()>0, 
	"	
	|   И АвтомобилиСрезПоследних.Автомобиль.Модель В (&Модель) ", 
	"")
    +?(СхемаОбзвона.Версии.Количество()>0, 
	"	
	|   И АвтомобилиСрезПоследних.Автомобиль.ВариантКомплектации В (&Версия) ", 
	"")
	+?(СхемаОбзвона.ТипыКПП.Количество()>0, 
	"	
	|   И АвтомобилиСрезПоследних.Автомобиль.ТипКПП В (&ТипКПП) ", 
	"")
    +?(СхемаОбзвона.ТипыКузова.Количество()>0, 
	"	
	|   И АвтомобилиСрезПоследних.Автомобиль.ТипКузова В (&ТипКузова) ", 
	"")
    +?(СхемаОбзвона.ТипыДвигателей.Количество()>0, 
	"	
	|   И АвтомобилиСрезПоследних.Автомобиль.ТипДвигателя В (&ТипДвигателя) ", 
	"")
    +?(ЗначениеЗаполнено(СхемаОбзвона.ДатаНачалаГарантии), 
	"	
	|   И АвтомобилиСрезПоследних.Автомобиль.ДатаНачалаГарантии >= НАЧАЛОПЕРИОДА(&ДатаНачалаГарантии, ДЕНЬ) ", 
	"")
    +?(ЗначениеЗаполнено(СхемаОбзвона.ДатаОкончанияГарантии), 
	"	
	|   И АвтомобилиСрезПоследних.Автомобиль.ДатаОкончанияГарантии <= КонецПериода(&ДатаОкончанияГарантии, ДЕНЬ) ", 
	"")
    +?(ЗначениеЗаполнено(СхемаОбзвона.ДатаРегистрацииОт), 
	"	
	|   И АвтомобилиСрезПоследних.Автомобиль.ДатаРегистрации >= НАЧАЛОПЕРИОДА(&ДатаРегистрацииОт, ДЕНЬ) ", 
	"")
    +?(ЗначениеЗаполнено(СхемаОбзвона.ДатаРегистрацииДо), 
	"	
	|   И АвтомобилиСрезПоследних.Автомобиль.ДатаРегистрации <= КонецПериода(&ДатаРегистрацииДо, ДЕНЬ) ", 
	"");
	
	ОбработанныйПараметр = Новый СписокЗначений;

	Для Каждого Стр Из СхемаОбзвона.ДопСегментацияПоАвтомобилю Цикл 
						
		Если ОбработанныйПараметр.НайтиПоЗначению(Стр.Реквизит) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ЕстьКовычка = Ложь;
		
		ВидСравненияПоле = ОпределитьВидСравнения(Стр.ВидСравнения);
		
		Если ВидСравненияПоле = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Найти(ВидСравненияПоле,"(")>0 Тогда
			ЕстьКовычка = Истина;
		КонецЕсли;
					
		ТекстДополнения = ТекстДополнения+
		"	
		|   И АвтомобилиСрезПоследних.Автомобиль."+Стр.Реквизит+" "+ВидСравненияПоле+" &"+Стр.Реквизит+?(ЕстьКовычка, ") "," "); 
		
		ОбработанныйПараметр.Добавить(Стр.Реквизит);
							
	КонецЦикла;
	
	Возврат ТекстДополнения;
	
КонецФункции

Функция ДополнитьТекстОтборомПоСобытиям(СхемаОбзвона)
	
    ТекстДополнения = ""
	
	+ ?(СхемаОбзвона.СервисныеКампании.Количество()>0,
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СервисныеКампании.СервиснаяКампания,
	|	СервисныеКампании.ДатаНачала,
	|	СервисныеКампании.ДатаОкончания
	|ПОМЕСТИТЬ ВТОтборСервисныеКампании
	|ИЗ
	|	&СервисныеКампании КАК СервисныеКампании
	|   ",
	"")
	+?(ЗначениеЗаполнено(СхемаОбзвона.ПоследнийЗаездОт) или ЗначениеЗаполнено(СхемаОбзвона.ПоследнийЗаездДо), 
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
    | ВЫБРАТЬ
	|	ЗаказНаряд.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ЗаказНаряд.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЗаказНаряд.Дата
	|		ИНАЧЕ ЗаказНаряд.ДатаНачала
	|	КОНЕЦ КАК ДатаЗаезда
	|ПОМЕСТИТЬ ПодИтог
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКлиентыИАвтомобили как ВТКлиентыИАвтомобили
	|	ПО ЗаказНаряд.Контрагент = ВТКлиентыИАвтомобили.Ссылка
	|   И  ЗаказНаряд.Автомобиль = ВТКлиентыИАвтомобили.Автомобиль "
	+?(ЗначениеЗаполнено(СхемаОбзвона.ДилерскийЦентр), " И  ЗаказНаряд.Организация = &Организация ", "")
	+
	"
	|			
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Renault_CRM_ЗаявкаНаСервис.ЗаказНаряд.Контрагент,
	|	Renault_CRM_ПриемкаАвтомобиля.ВремяНачала
	|ИЗ
	|	Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ОбращениеВАвтоСервис КАК Renault_CRM_ОбращениеВАвтоСервис
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ПриемкаАвтомобиля КАК Renault_CRM_ПриемкаАвтомобиля
	|			ПО (Renault_CRM_ПриемкаАвтомобиля.Обращение = Renault_CRM_ОбращениеВАвтоСервис.Ссылка)
	|		ПО Renault_CRM_ЗаявкаНаСервис.Обращение = Renault_CRM_ОбращениеВАвтоСервис.Ссылка
    |	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКлиентыИАвтомобили как ВТКлиентыИАвтомобили
	|	ПО Renault_CRM_ЗаявкаНаСервис.ЗаказНаряд.Контрагент = ВТКлиентыИАвтомобили.Ссылка
	|   И  Renault_CRM_ЗаявкаНаСервис.ЗаказНаряд.Автомобиль = ВТКлиентыИАвтомобили.Автомобиль "
	+?(ЗначениеЗаполнено(СхемаОбзвона.ДилерскийЦентр), " И  Renault_CRM_ЗаявкаНаСервис.ЗаказНаряд.Организация = &Организация ", "")
	+
	"
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодИтог.Контрагент КАК Контрагент,
	|	МАКСИМУМ(ПодИтог.ДатаЗаезда) КАК ДатаЗаезда
	|ПОМЕСТИТЬ ВТПоследниеДатыЗаездов
	|ИЗ
	|	ПодИтог КАК ПодИтог
	|
	|СГРУППИРОВАТЬ ПО
	|	ПодИтог.Контрагент",
	"")
	+?(СхемаОбзвона.Событие = "Дней до срока по рекомендации",
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
    |РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), НАЧАЛОПЕРИОДА(Повреждения.РекомендуемаяДатаВыполнения, ДЕНЬ), ДЕНЬ) КАК РекомендуемаяДатаВыполненияРекомендации,
    |ВТКлиентыИАвтомобили.Ссылка КАК Контрагент
	|ПОМЕСТИТЬ ВТДатыВыполненияРекомендации
    |ИЗ
    | РегистрСведений.Renault_ПоврежденияАвтомобилей.СрезПоследних(, РаботаАктуальна = ИСТИНА) КАК Повреждения
	| ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКлиентыИАвтомобили КАК ВТКлиентыИАвтомобили
	| ПО ВТКлиентыИАвтомобили.Автомобиль = Повреждения.Автомобиль 
	| И  Повреждения.РекомендуемаяДатаВыполнения>&ТекущаяДата
	| И  ВТКлиентыИАвтомобили.Автомобиль <> Значение(Справочник.Автомобили.ПустаяСсылка) ",
	"")
	+?(СхемаОбзвона.Событие = "Дней до тест-драйва" или СхемаОбзвона.Событие = "Дней до выдачи",
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	| ВЫБРАТЬ
	|	ВТКлиентыИАвтомобили.Ссылка КАК Контрагент,
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), НАЧАЛОПЕРИОДА(CRM_СобытияПоРабочимЛистам.ДатаНапоминания, ДЕНЬ, ДЕНЬ) КАК ДнейДо
	|ПОМЕСТИТЬ ВТСобытие
	|ИЗ
	|	ВТКлиентыИАвтомобили КАК ВТКлиентыИАвтомобили
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
	|			ПО Renault_РабочиеЛисты.IDK = CRM_СобытияПоРабочимЛистам.IDK
	|				И (ВЫБОР КОГДА &Событие = ""Дней до тест-драйва"" Тогда
	|                CRM_СобытияПоРабочимЛистам.ВидСобытия = Значение(Справочник.CRM_ВидыСобытий.ТестДрайв)
	|                Иначе CRM_СобытияПоРабочимЛистам.ВидСобытия = Значение(Справочник.CRM_ВидыСобытий.Выдача) 
	|                Конец)
	|               И CRM_СобытияПоРабочимЛистам.ДатаНапоминания>&ТекущаяДата
	|		ПО ВТКлиентыИАвтомобили.Ссылка = Renault_РабочиеЛисты.Клиент "
	+?(ЗначениеЗаполнено(СхемаОбзвона.ДилерскийЦентр), " И  Renault_РабочиеЛисты.ДилерскийЦентр = &ДилерскийЦентр ", "")
	+
	"
	| И  ВТКлиентыИАвтомобили.Автомобиль <> Значение(Справочник.Автомобили.ПустаяСсылка) ",
	"")
	+?(СхемаОбзвона.Событие = "Дней после тест-драйва" или СхемаОбзвона.Событие = "Дней после выдачи",
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	| ВЫБРАТЬ
	|	ВТКлиентыИАвтомобили.Ссылка КАК Контрагент,
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(CRM_СобытияПоРабочимЛистам.ДатаНапоминания, ДЕНЬ), НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), ДЕНЬ) КАК  ДнейПосле
	|ПОМЕСТИТЬ ВТСобытие
	|ИЗ
	|	ВТКлиентыИАвтомобили КАК ВТКлиентыИАвтомобили
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
	|			ПО Renault_РабочиеЛисты.IDK = CRM_СобытияПоРабочимЛистам.IDK
	|				И (ВЫБОР КОГДА &Событие = ""Дней до тест-драйва"" Тогда
	|                CRM_СобытияПоРабочимЛистам.ВидСобытия = Значение(Справочник.CRM_ВидыСобытий.ТестДрайв)
	|                Иначе CRM_СобытияПоРабочимЛистам.ВидСобытия = Значение(Справочник.CRM_ВидыСобытий.Выдача) 
	|                Конец)
	|		ПО ВТКлиентыИАвтомобили.Ссылка = Renault_РабочиеЛисты.Клиент "
	+?(ЗначениеЗаполнено(СхемаОбзвона.ДилерскийЦентр), " И  Renault_РабочиеЛисты.ДилерскийЦентр = &ДилерскийЦентр ", "")
	+
	"
	| И  ВТКлиентыИАвтомобили.Автомобиль <> Значение(Справочник.Автомобили.ПустаяСсылка) ",
	"")
	+?(СхемаОбзвона.Событие = "Дней с момента обращения",
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(Renault_CRM_ОбращениеВАвтоСервис.Дата, ДЕНЬ), НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), ДЕНЬ) КАК ДнейСМоментаОбращенияВАвтосервис,
	|	ВТКлиентыИАвтомобили.Ссылка
	|ПОМЕСТИТЬ ВТОбращения
	|ИЗ
	|	ВТКлиентыИАвтомобили КАК ВТКлиентыИАвтомобили
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ОбращениеВАвтоСервис КАК Renault_CRM_ОбращениеВАвтоСервис
	|		ПО ВТКлиентыИАвтомобили.Автомобиль = Renault_CRM_ОбращениеВАвтоСервис.Автомобиль "
	+?(ЗначениеЗаполнено(СхемаОбзвона.ДилерскийЦентр), " И  Renault_CRM_ОбращениеВАвтоСервис.ДилерскийЦентр = &ДилерскийЦентр ", "")
	+
	"
	| И  ВТКлиентыИАвтомобили.Автомобиль <> Значение(Справочник.Автомобили.ПустаяСсылка) ",
	"")
	+?(СхемаОбзвона.Событие = "Дней с момента визита",
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(Renault_CRM_ВыдачаАвтомобиля.ВремяОкончания, ДЕНЬ), НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), ДЕНЬ) КАК ДнейСМоментаВизита,
	|	ВТКлиентыИАвтомобили.Ссылка
	|ПОМЕСТИТЬ ВТОбращения
	|ИЗ
	|	ВТКлиентыИАвтомобили КАК ВТКлиентыИАвтомобили
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ОбращениеВАвтоСервис КАК Renault_CRM_ОбращениеВАвтоСервис
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ВыдачаАвтомобиля КАК Renault_CRM_ВыдачаАвтомобиля
	|			ПО Renault_CRM_ОбращениеВАвтоСервис.Ссылка = Renault_CRM_ВыдачаАвтомобиля.Обращение
	|		ПО ВТКлиентыИАвтомобили.Автомобиль = Renault_CRM_ОбращениеВАвтоСервис.Автомобиль "
	+?(ЗначениеЗаполнено(СхемаОбзвона.ДилерскийЦентр), " И  Renault_CRM_ОбращениеВАвтоСервис.ДилерскийЦентр = &ДилерскийЦентр ", "")
	+
	"
	| И  ВТКлиентыИАвтомобили.Автомобиль <> Значение(Справочник.Автомобили.ПустаяСсылка) ",
	"")
	+?(СхемаОбзвона.Событие = "Дней до записи на приемку",
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), НАЧАЛОПЕРИОДА(Renault_CRM_ПриемкаАвтомобиля.ВремяНачала, ДЕНЬ), ДЕНЬ) КАК ДнейДоЗаписиНаПриемку,
	|	ВТКлиентыИАвтомобили.Ссылка
	|ПОМЕСТИТЬ ВТОбращения
	|ИЗ
	|	ВТКлиентыИАвтомобили КАК ВТКлиентыИАвтомобили
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ОбращениеВАвтоСервис КАК Renault_CRM_ОбращениеВАвтоСервис
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ПриемкаАвтомобиля КАК Renault_CRM_ПриемкаАвтомобиля
	|			ПО Renault_CRM_ОбращениеВАвтоСервис.Ссылка = Renault_CRM_ПриемкаАвтомобиля.Обращение
	|            И Renault_CRM_ПриемкаАвтомобиля.ВремяНачала>&ТекущаяДата
	|		ПО ВТКлиентыИАвтомобили.Автомобиль = Renault_CRM_ОбращениеВАвтоСервис.Автомобиль "
	+?(ЗначениеЗаполнено(СхемаОбзвона.ДилерскийЦентр), " И  Renault_CRM_ОбращениеВАвтоСервис.ДилерскийЦентр = &ДилерскийЦентр ", "")
	+
	"
	| И  ВТКлиентыИАвтомобили.Автомобиль <> Значение(Справочник.Автомобили.ПустаяСсылка) ",
	"")
	+?(СхемаОбзвона.Событие = "Дней с даты продажи",
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ПродажиАвтомобилей.Период, ДЕНЬ), НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), ДЕНЬ) КАК ДнейСПродажи,
	|	ВТКлиентыИАвтомобили.Ссылка
	|ПОМЕСТИТЬ ВТПродажаАвто
	|ИЗ
	|	ВТКлиентыИАвтомобили КАК ВТКлиентыИАвтомобили
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПродажиАвтомобилей КАК ПродажиАвтомобилей
	|		ПО ВТКлиентыИАвтомобили.Автомобиль = ПродажиАвтомобилей.Автомобиль "
	+?(ЗначениеЗаполнено(СхемаОбзвона.ДилерскийЦентр), " И  ПродажиАвтомобилей.ПодразделениеКомпании.Организация = &Организация ", "")
	+
	"
	| И  ВТКлиентыИАвтомобили.Автомобиль <> Значение(Справочник.Автомобили.ПустаяСсылка) ",
	"")
	+?(СхемаОбзвона.Событие = "Дней с момента закрытия заказ-наряда",
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ЗаказНаряд.ДатаЗакрытия, ДЕНЬ), НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), ДЕНЬ) КАК ДнейСМоментаЗакрытияЗаказНаряда,
	|	ВТКлиентыИАвтомобили.Ссылка
	|ПОМЕСТИТЬ ВТЗакрытиеЗН
	|ИЗ
	|	ВТКлиентыИАвтомобили КАК ВТКлиентыИАвтомобили
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд КАК ЗаказНаряд
	|		ПО ВТКлиентыИАвтомобили.Автомобиль = ЗаказНаряд.Автомобиль "
	+?(ЗначениеЗаполнено(СхемаОбзвона.ДилерскийЦентр), " И  ЗаказНаряд.Организация = &Организация ", ""),
	"")
	+?(ЗначениеЗаполнено(СхемаОбзвона.ПоследнийТО),
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	| ВЫБРАТЬ
    | МАКСИМУМ(Renault_КодировкиТО.ВидТО) КАК ВидТО,
    | ПродажиОбороты.Покупатель
	| ПОМЕСТИТЬ ВТПоследниеТО
    | ИЗ
    |    РегистрНакопления.Продажи.Обороты(,, Регистратор, ) КАК ПродажиОбороты
	|    ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КодировкиТО КАК Renault_КодировкиТО
	|    ПО (Renault_КодировкиТО.АртикулРаботы = ПродажиОбороты.Авторабота.Артикул)
	|    ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд КАК ЗаказНаряд
	|    ПО ПродажиОбороты.Регистратор = ЗаказНаряд.Ссылка "
	+?(ЗначениеЗаполнено(СхемаОбзвона.ДилерскийЦентр), " И  ЗаказНаряд.Организация = &Организация ", "")
	+
	"
    |    ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКлиентыИАвтомобили КАК ВТКлиентыИАвтомобили
	|    ПО ПродажиОбороты.Покупатель = ВТКлиентыИАвтомобили.Ссылка
	|
    |СГРУППИРОВАТЬ ПО
    |ПродажиОбороты.Покупатель ",
	"")
	+
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТКлиентыИАвтомобили.Ссылка как Клиент
	|   ПОМЕСТИТЬ ВТКлиентыИтог
	|ИЗ
	|	ВТКлиентыИАвтомобили КАК ВТКлиентыИАвтомобили "
	+?(ЗначениеЗаполнено(СхемаОбзвона.ПробегОт) ИЛИ ЗначениеЗаполнено(СхемаОбзвона.ПробегДо),
	"
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних(	,
	|	ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Пробег)
	|		) КАК АвтомобилиПробеги
	|		ПО ВТКлиентыИАвтомобили.Автомобиль = АвтомобилиПробеги.Автомобиль ",
	"")
	+?(ЗначениеЗаполнено(СхемаОбзвона.ПробегОт),
	"
	|       И  (АвтомобилиПробеги.Значение >=&ПробегОт) ",
    "")
	+?(ЗначениеЗаполнено(СхемаОбзвона.ПробегДо),
	"
	|       И  (АвтомобилиПробеги.Значение <=&ПробегДо) ",
	"")
	+?(ЗначениеЗаполнено(СхемаОбзвона.ПоследнийЗаездОт) или ЗначениеЗаполнено(СхемаОбзвона.ПоследнийЗаездДо), 
	"
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПоследниеДатыЗаездов КАК ВТПоследниеДатыЗаездов
	|       ПО ВТКлиентыИАвтомобили.Ссылка = ВТПоследниеДатыЗаездов.Контрагент ",
	"")
	+?(ЗначениеЗаполнено(СхемаОбзвона.ПоследнийЗаездОт),
	"
	|        И ВТПоследниеДатыЗаездов.ДатаЗаезда >=&ПоследнийЗаездОт ",
	"")
	+?(ЗначениеЗаполнено(СхемаОбзвона.ПоследнийЗаездДо),
	"
	|        И ВТПоследниеДатыЗаездов.ДатаЗаезда <=&ПоследнийЗаездДо ",	
	"")
	+?(СхемаОбзвона.Событие = "Дней до срока по рекомендации",
	"
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДатыВыполненияРекомендации КАК ВТДатыВыполненияРекомендации
	|       ПО ВТКлиентыИАвтомобили.Ссылка = ВТДатыВыполненияРекомендации.Контрагент 
	|       И ВТДатыВыполненияРекомендации.РекомендуемаяДатаВыполненияРекомендации "+СхемаОбзвона.ВидСравненияПоСобытию+" &ДнейДО ",	
	"")
	+?(СхемаОбзвона.Событие = "Дней до тест-драйва" или СхемаОбзвона.Событие = "Дней до выдачи",
	"
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСобытие КАК ВТСобытие
	|       ПО ВТКлиентыИАвтомобили.Ссылка = ВТСобытие.Контрагент 
	|       И  ВТСобытие.ДнейДо "+СхемаОбзвона.ВидСравненияПоСобытию+" &ДнейДО ",
	"")
	+?(СхемаОбзвона.Событие = "Дней после тест-драйва" или СхемаОбзвона.Событие = "Дней после выдачи",
	"
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСобытие КАК ВТСобытие
	|       ПО ВТКлиентыИАвтомобили.Ссылка = ВТСобытие.Контрагент 
	|       И ВТСобытие.ДнейПосле "+СхемаОбзвона.ВидСравненияПоСобытию+" &ДнейДо ",
	"")
	+?(СхемаОбзвона.Событие = "Дней до записи на приемку",
	"
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбращения КАК ВТОбращения
	|	    ПО ВТКлиентыИАвтомобили.Ссылка = ВТОбращения.Ссылка
	|	    И ВТОбращения.ДнейДоЗаписиНаПриемку "+СхемаОбзвона.ВидСравненияПоСобытию+" &ДнейДО ",
	"")
	+?(СхемаОбзвона.Событие = "Дней с момента визита",
	"
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбращения КАК ВТОбращения
	|       ПО ВТКлиентыИАвтомобили.Ссылка = ВТОбращения.Ссылка
	|	    И (ВТОбращения.ДнейСМоментаВизита "+СхемаОбзвона.ВидСравненияПоСобытию+" &ДнейДО) ",
	"")
    +?(СхемаОбзвона.Событие = "Дней с момента обращения",
	"
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбращения КАК ВТОбращения
	|       ПО ВТКлиентыИАвтомобили.Ссылка = ВТОбращения.Ссылка
	|       И (ВТОбращения.ДнейСМоментаОбращенияВАвтосервис "+СхемаОбзвона.ВидСравненияПоСобытию+" &ДнейДО) ",
	"")
    +?(СхемаОбзвона.Событие = "Дней с даты продажи",
	"
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПродажаАвто КАК ВТПродажаАвто
	|       ПО ВТКлиентыИАвтомобили.Ссылка = ВТПродажаАвто.Ссылка
	|	    И (ВТПродажаАвто.ДнейСПродажи "+СхемаОбзвона.ВидСравненияПоСобытию+" &ДнейДО) ",
	"")
	 +?(СхемаОбзвона.Событие = "Дней с момента закрытия заказ-наряда",
	"
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗакрытиеЗН КАК ВТЗакрытиеЗН
	|       ПО ВТКлиентыИАвтомобили.Ссылка = ВТЗакрытиеЗН.Ссылка
	|	    И (ВТЗакрытиеЗН.ДнейСМоментаЗакрытияЗаказНаряда "+СхемаОбзвона.ВидСравненияПоСобытию+" &ДнейДО) ",
	"")
	+?(ЗначениеЗаполнено(СхемаОбзвона.ПоследнийТО),
	"
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПоследниеТО КАК ВТПоследниеТО
	|       ПО ВТКлиентыИАвтомобили.Ссылка = ВТПоследниеТО.Покупатель 
	|       И  ВТПоследниеТО.ВидТО = &ПоследнийВидТО ",				
	"")
	+ ?(СхемаОбзвона.СервисныеКампании.Количество()>0,
	"
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВыполнениеСервисныхКампаний КАК ВыполнениеСервисныхКампаний
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборСервисныеКампании КАК ВТОтборСервисныеКампании
	|			ПО ВТОтборСервисныеКампании.СервиснаяКампания = ВыполнениеСервисныхКампаний.СервиснаяКампания
	|				И (ВЫБОР КОГДА ВТОтборСервисныеКампании.ДатаНачала<>ДатаВремя(1,1,1,0,0,0) Тогда
	|                  ВыполнениеСервисныхКампаний.ДатаВыполнения >= ВТОтборСервисныеКампании.ДатаНачала иначе истина конец)
	|               И (ВЫБОР КОГДА ВТОтборСервисныеКампании.ДатаОкончания<>ДатаВремя(1,1,1,0,0,0) Тогда
	|                   ВыполнениеСервисныхКампаний.ДатаВыполнения  <= ВТОтборСервисныеКампании.ДатаОкончания иначе истина конец)
	|		ПО ВТКлиентыИАвтомобили.Автомобиль.VIN = ВыполнениеСервисныхКампаний.VIN ",
	"")
	+ ?(СхемаОбзвона.Опции.Количество()>0,
	"
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОпцииВариантовКомплектации КАК ОпцииВариантовКомплектации
	|		ПО (ВТКлиентыИАвтомобили.Автомобиль.ВариантКомплектации = ОпцииВариантовКомплектации.ВариантКомплектации)
	|			И (ОпцииВариантовКомплектации.Опция В (&Опции))
	|			И (ОпцииВариантовКомплектации.ВидВключения = 2) ",
	"")
	+ ?(СхемаОбзвона.Оборудование.Количество()>0,
	"
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.КомплектацияАвтомобилей КАК КомплектацияАвтомобилей
	|		ПО (ВТКлиентыИАвтомобили.Автомобиль = КомплектацияАвтомобилей.Автомобиль)
	|			И (КомплектацияАвтомобилей.Номенклатура В (&Оборудование))
	|			И (КомплектацияАвтомобилей.Регистратор ССЫЛКА Документ.ВводОстатковАвтомобилей
	|				ИЛИ КомплектацияАвтомобилей.Регистратор ССЫЛКА Документ.ЗаказНаряд
	|				ИЛИ КомплектацияАвтомобилей.Регистратор ССЫЛКА Документ.ИнвентаризацияАвтомобилей
	|				ИЛИ КомплектацияАвтомобилей.Регистратор ССЫЛКА Документ.ПоступлениеАвтомобилей)
	|			И (КомплектацияАвтомобилей.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|			И (КомплектацияАвтомобилей.Количество <> 0)" , 
	"");
	
	Возврат ТекстДополнения;

КонецФункции

Функция АктуализироватьРаботуПоСхеме(СхемаОбзвона) Экспорт
	
	//если последний день работы схемы то актуализируем список необработанных 
	//если период закончился тогда схему завершаем
	Если СхемаОбзвона.Завершена или СхемаОбзвона.ПометкаУдаления Тогда
		
		ЗавершитьРаботуПоСхеме(СхемаОбзвона);
		
	ИначеЕсли ЗначениеЗаполнено(СхемаОбзвона.ОкончаниеПериода) Тогда
		
		Если НачалоДня(СхемаОбзвона.ОкончаниеПериода) <= НачалоДня(ТекущаяДата()) Тогда
					
			ЗавершитьРаботуПоСхеме(СхемаОбзвона);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НЕ СхемаОбзвона.Завершена;
		
КонецФункции

Процедура ЗавершитьРаботуПоСхеме(СхемаОбзвона)
	
	Если Не СхемаОбзвона.Завершена Тогда
		СхемаОбзвонаОбъект = СхемаОбзвона.ПолучитьОбъект();
		СхемаОбзвонаОбъект.Завершена = Истина;
		Попытка
			СхемаОбзвонаОбъект.Записать();
		Исключение
			ТекстСообщения = "Ошибка при завершении схемы обзвона " + СхемаОбзвонаОбъект.Наименование;
			ЗаписьЖурналаРегистрации("Завершение схемы обзвона", УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
	//завершаем напоминания
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_СообщенияПользователю.Ссылка
	               |ИЗ
	               |	Справочник.Renault_СообщенияПользователю КАК Renault_СообщенияПользователю
	               |ГДЕ
	               |	Renault_СообщенияПользователю.СхемаОбзвона = &СхемаОбзвона
	               |	И НЕ Renault_СообщенияПользователю.Обработано
	               |	И Renault_СообщенияПользователю.ВидСообщения = ЗНАЧЕНИЕ(Справочник.Renault_ВидСообщения.CommunicationCenter_Обзвон)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Renault_События.Ссылка
	               |ИЗ
	               |	Задача.Renault_События КАК Renault_События
	               |ГДЕ
	               |	Renault_События.Объект = &СхемаОбзвона
	               |	И Renault_События.ВидСобытия В (&ВидыСобытий)
	               |	И НЕ Renault_События.Выполнена";
	
	Запрос.УстановитьПараметр("СхемаОбзвона", СхемаОбзвона);
	
	ВидыСобытий = Новый СписокЗначений;
	ВидыСобытий.Добавить(Справочники.CRM_ВидыСобытий.ПлановаяПролонгация);
	ВидыСобытий.Добавить(Справочники.CRM_ВидыСобытий.КлиентыСервиса);
	ВидыСобытий.Добавить(Справочники.CRM_ВидыСобытий.УтеряннаяБаза);
	ВидыСобытий.Добавить(Справочники.CRM_ВидыСобытий.НапоминаниеОВзносе);
	
	Запрос.УстановитьПараметр("ВидыСобытий", ВидыСобытий);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Напоминание = Выборка.Ссылка.ПолучитьОбъект();
		
		Если ТипЗнч(Выборка.Ссылка) = Тип("ЗадачаСсылка.Renault_События") Тогда
			Напоминание.Выполнена    = Истина;
			Напоминание.Состояние    = Справочники.Renault_Состояния.ЗавершеноУспешно;
			Напоминание.ДатаЗакрытия = ТекущаяДата();
		Иначе 
			Напоминание.Обработано = Истина;
		КонецЕсли;
		
		Попытка
			Напоминание.Записать();
	    Исключение
			ТекстСообщения = "Не удалось установить признак выполнения у напоминания/задачи " + Напоминание.Код;
			ЗаписьЖурналаРегистрации("Завершение схемы обзвона", УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
		КонецПопытки;
		
	КонецЦикла;
		
КонецПроцедуры

Функция ОпределитьВидСравнения(ВидСравнения)
	
	Если ВидСравнения = "Больше" Тогда
		СтрокаСравнения = ">";
	ИначеЕсли ВидСравнения = "Больше или равно" Тогда
		СтрокаСравнения = ">=";
    ИначеЕсли ВидСравнения = "Меньше" Тогда
		СтрокаСравнения = "<";
    ИначеЕсли ВидСравнения = "Меньше или равно" Тогда
		СтрокаСравнения = "<=";
    ИначеЕсли ВидСравнения = "Не равно" Тогда
		СтрокаСравнения = "<>";
    ИначеЕсли ВидСравнения = "Равно" Тогда
		СтрокаСравнения = "=";
	ИначеЕсли ВидСравнения = "В списке" Тогда
		СтрокаСравнения = "В (";		
	ИначеЕсли ВидСравнения = "Не в списке" Тогда
		СтрокаСравнения = "НЕ В (";
	ИначеЕсли ВидСравнения = "В группе" Тогда
		СтрокаСравнения = "В Иерархии (";
	ИначеЕсли ВидСравнения = "Не в группе" Тогда
		СтрокаСравнения = "НЕ В Иерархии (";
	ИначеЕсли ВидСравнения = "Содержит" Тогда
		СтрокаСравнения = "ПОДОБНО";
	ИначеЕсли ВидСравнения = "Заполнено" Тогда
		СтрокаСравнения = "<>";
	ИначеЕсли ВидСравнения = "НЕ Заполнено" Тогда
		СтрокаСравнения = "=";
    Иначе
		СтрокаСравнения = Неопределено;
	КонецЕсли;
	
	Возврат СтрокаСравнения;

КонецФункции

Процедура СоздатьНапоминания(СхемаОбзвона) Экспорт
	
	Если СхемаОбзвона.НеНапоминать Тогда
		Возврат;
	КонецЕсли;
	
	Если СхемаОбзвона.НапоминаниеЗадачами Тогда
		
		СоздатьЗадачи(СхемаОбзвона);
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Исполнители.Исполнитель
	               |ПОМЕСТИТЬ ВТИсполнители
	               |ИЗ
	               |	&Исполнители КАК Исполнители
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Сотрудники.Ссылка КАК Пользователь
	               |ПОМЕСТИТЬ ВТИсполнителиПодразделенияОтделы
	               |ИЗ
	               |	ВТИсполнители КАК ВТИсполнители
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_Отделы.Подразделения КАК CRM_ОтделыПодразделения
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	               |			ПО CRM_ОтделыПодразделения.Подразделение = Сотрудники.Подразделение
	               |				И (Сотрудники.ФлагУволен = ЛОЖЬ)
	               |				И (Сотрудники.ПометкаУдаления = ЛОЖЬ)
	               |		ПО ВТИсполнители.Исполнитель = CRM_ОтделыПодразделения.Ссылка
	               |ГДЕ
	               |	ВТИсполнители.Исполнитель ССЫЛКА Справочник.CRM_Отделы
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Пользователи.Сотрудник
	               |ИЗ
	               |	ВТИсполнители КАК ВТИсполнители
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	               |		ПО ВТИсполнители.Исполнитель = Пользователи.Ссылка
	               |ГДЕ
	               |	ВТИсполнители.Исполнитель ССЫЛКА Справочник.Пользователи
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Сотрудники.Ссылка
	               |ИЗ
	               |	ВТИсполнители КАК ВТИсполнители
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	               |		ПО ВТИсполнители.Исполнитель = Сотрудники.Подразделение
	               |			И (Сотрудники.ФлагУволен = ЛОЖЬ)
	               |			И (Сотрудники.ПометкаУдаления = ЛОЖЬ)
	               |ГДЕ
	               |	ВТИсполнители.Исполнитель ССЫЛКА Справочник.ПодразделенияКомпании
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТИсполнителиПодразделенияОтделы.Пользователь,
	               |	ЕСТЬNULL(Renault_СообщенияПользователю.Ссылка, ЗНАЧЕНИЕ(Справочник.Renault_СообщенияПользователю.ПустаяСсылка)) КАК Ссылка
	               |ИЗ
	               |	ВТИсполнителиПодразделенияОтделы КАК ВТИсполнителиПодразделенияОтделы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_СообщенияПользователю КАК Renault_СообщенияПользователю
	               |		ПО ВТИсполнителиПодразделенияОтделы.Пользователь = Renault_СообщенияПользователю.Получатель
	               |			И (Renault_СообщенияПользователю.ВидСообщения = ЗНАЧЕНИЕ(Справочник.Renault_ВидСообщения.CommunicationCenter_Обзвон))
	               |			И (Renault_СообщенияПользователю.СхемаОбзвона = &СхемаОбзвона)";			   
					   				   
	Запрос.УстановитьПараметр("СхемаОбзвона", СхемаОбзвона);
	Запрос.УстановитьПараметр("Исполнители", СхемаОбзвона.Исполнители);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			Напоминание = Выборка.Ссылка.ПолучитьОбъект();
		Иначе		
			Напоминание = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
			Напоминание.Отправитель = ПараметрыСеанса.Пользователь;
			Напоминание.Получатель   = Выборка.Пользователь;
			Напоминание.СхемаОбзвона         = СхемаОбзвона;
			НовАдресат = Напоминание.Адресаты.Добавить();
			НовАдресат.Сотрудник   = Выборка.Пользователь;
			Напоминание.ВидСообщения = Справочники.Renault_ВидСообщения.CommunicationCenter_Обзвон;
            Напоминание.ИдентификаторОбъекта = Новый УникальныйИдентификатор();
			Напоминание.ДатаОтправки = ТекущаяДата();
		КонецЕсли;	
		
		Напоминание.Обработано   = Ложь;
		Напоминание.Комментарий  = "Коммуникация по схеме "+СхемаОбзвона.Наименование;
		Напоминание.ПоказыватьС  = СхемаОбзвона.НачалоПериода;
		Если ЗначениеЗаполнено(СхемаОбзвона.ОкончаниеПериода) Тогда
			Напоминание.ПоказыватьПо = КонецДня(СхемаОбзвона.ОкончаниеПериода);
		КонецЕсли;	
		Напоминание.Наименование = "Коммуникация по схеме "+СхемаОбзвона.Наименование;
		Напоминание.Сообщение    = "Есть необработанные клиенты по схеме "+СхемаОбзвона.Наименование;
		Напоминание.Записать();
		
		Сообщить("Актуализировано напоминание пользователю " + Выборка.Пользователь.Наименование+ " о коммуникации");
		
	КонецЦикла;

КонецПроцедуры

Процедура СоздатьЗадачи(СхемаОбзвона)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Исполнители.Исполнитель
	               |ПОМЕСТИТЬ ВТИсполнители
	               |ИЗ
	               |	&Исполнители КАК Исполнители
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТИсполнители.Исполнитель КАК Пользователь,
	               |	ЕСТЬNULL(Renault_События.Ссылка, ЗНАЧЕНИЕ(Задача.Renault_События.ПустаяСсылка)) КАК Ссылка
	               |ИЗ
	               |	ВТИсполнители КАК ВТИсполнители
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Renault_События КАК Renault_События
	               |		ПО (Renault_События.Объект = &СхемаОбзвона)
	               |			И (Renault_События.ВидСобытия В (&ВидыСобытий))
	               |			И (ВЫБОР
	               |				КОГДА ВТИсполнители.Исполнитель ССЫЛКА Справочник.Пользователи
	               |					ТОГДА Renault_События.Сотрудник = ВЫРАЗИТЬ(ВТИсполнители.Исполнитель КАК Справочник.Пользователи).Сотрудник
	               |				КОГДА ВТИсполнители.Исполнитель ССЫЛКА Справочник.ПодразделенияКомпании
	               |					ТОГДА Renault_События.Подразделение = ВТИсполнители.Исполнитель
	               |				ИНАЧЕ Renault_События.Отдел = ВТИсполнители.Исполнитель
	               |			КОНЕЦ)";				   
					   
	Запрос.УстановитьПараметр("СхемаОбзвона", СхемаОбзвона);
	Запрос.УстановитьПараметр("Исполнители", СхемаОбзвона.Исполнители);
	
	ВидыСобытий = Новый СписокЗначений;
	ВидыСобытий.Добавить(Справочники.CRM_ВидыСобытий.ПлановаяПролонгация);
	ВидыСобытий.Добавить(Справочники.CRM_ВидыСобытий.КлиентыСервиса);
	ВидыСобытий.Добавить(Справочники.CRM_ВидыСобытий.УтеряннаяБаза);
	ВидыСобытий.Добавить(Справочники.CRM_ВидыСобытий.НапоминаниеОВзносе);
	
	Запрос.УстановитьПараметр("ВидыСобытий", ВидыСобытий);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			ЗадачаНаПролонгацию = Выборка.Ссылка.ПолучитьОбъект();
		Иначе		
			ЗадачаНаПролонгацию = Задачи.Renault_События.СоздатьЗадачу();
			ЗадачаНаПролонгацию.Наименование = СхемаОбзвона.Наименование;
			ЗадачаНаПролонгацию.Объект       = СхемаОбзвона;
			ЗадачаНаПролонгацию.ВидСобытия   = СхемаОбзвона.ВидСобытия;
			ЗадачаНаПролонгацию.Дата         = ТекущаяДата();
			ЗадачаНаПролонгацию.Автор        = ПараметрыСеанса.Пользователь;
			ЗадачаНаПролонгацию.Состояние    = Справочники.Renault_Состояния.ПринятКИсполнению;
			
		КонецЕсли;	
		
		ЗадачаНаПролонгацию.ДилерскийЦентр = СхемаОбзвона.ДилерскийЦентр;
			
		Если ТипЗнч(Выборка.Пользователь) = Тип("СправочникСсылка.CRM_Отделы") Тогда
			ЗадачаНаПролонгацию.Отдел     = Выборка.Пользователь;
		ИначеЕсли ТипЗнч(Выборка.Пользователь) = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
			ЗадачаНаПролонгацию.Подразделение = Выборка.Пользователь;
		Иначе
			ЗадачаНаПролонгацию.Сотрудник = Выборка.Пользователь.Сотрудник;
		КонецЕсли;
			
		ЗадачаНаПролонгацию.Записать();
	
		Сообщить("Актуализирована задача пользователя " + Выборка.Пользователь.Наименование+ " о коммуникации");
		
	КонецЦикла;

КонецПроцедуры

Функция ПерезаполнитьСписокКлиентовВыборки(СхемаОбзвона) Экспорт
	
	Если СхемаОбзвона.ТипКоммуникации = Перечисления.ВидыСобытий.ТелефонныйЗвонок
		И СхемаОбзвона.ШагиСхемы.Количество()=0 Тогда
		Возврат Неопределено;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СхемаОбзвона.ТекстПроизвольногоЗапроса) Тогда
		КлиентыДляОбзвона = ПолучитьСписокКлиентовПроизвольногоЗапроса(СхемаОбзвона);
	Иначе
		КлиентыДляОбзвона = ПолучитьСписокКлиентовВыборки(СхемаОбзвона);
	КонецЕсли;
	
	Возврат КлиентыДляОбзвона;
	
КонецФункции	

Функция ПолучитьТекстСМСДляКлиента(ТекстСМС = "", Контрагент, СхемаОбзвона = Неопределено, ВычисляемыеВставкиВТекстШаблона = Неопределено) Экспорт
	
	Если ТекстСМС = "" И СхемаОбзвона = Неопределено Тогда
		Возврат "";
	ИначеЕсли ТекстСМС = "" Тогда
		Если ЗначениеЗаполнено(СхемаОбзвона.ТекстСМС) Тогда
			ТекстСМС = СхемаОбзвона.ТекстСМС;
		Иначе
			Возврат "";
		КонецЕсли;
	КонецЕсли;
	
	Если Контрагент.ЭтоГруппа Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстСМСВычисляемый = ТекстСМС;
	
	Для Каждого Стр Из ВычисляемыеВставкиВТекстШаблона Цикл
		
		ПараметрДляВычисления = "";
		
		Попытка
			Если Стр.ЭтоФункция Тогда
				Выполнить(СтрЗаменить(Стр.Формула, Символы.ПС,""));
			Иначе
				ПараметрДляВычисления = Вычислить(Стр.Формула);
			КонецЕсли;
		Исключение
			Сообщить("Не удалось вычислить параметр "+Стр.Параметр);
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		ТекстСМСВычисляемый = СтрЗаменить(ТекстСМСВычисляемый, "{"+Стр.Параметр+"}", ПараметрДляВычисления);
				
	КонецЦикла;	
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("МакетСМС");
	
	ОбластьСМС = Макет.ПолучитьОбласть("ОбластьСМС");
	ОбластьСМС.Область("R1C1:R9C6").Текст = ТекстСМСВычисляемый;
	ОбластьСМС.Параметры.Заполнить(Контрагент);
		
	ТабДок.Вывести(ОбластьСМС);
	
	ТекстРезультат = ТабДок.ТекущаяОбласть.Текст;
		
	Возврат ТекстРезультат;
	
КонецФункции

Функция ПолучитьСхемуПоУид(УИД) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Renault_CommunicationCenter_СхемыОбзвона.Ссылка
	|ИЗ
	|	Справочник.Renault_CommunicationCenter_СхемыОбзвона КАК Renault_CommunicationCenter_СхемыОбзвона
	|ГДЕ
	|	Renault_CommunicationCenter_СхемыОбзвона.УИД = &УИД
	|	И НЕ Renault_CommunicationCenter_СхемыОбзвона.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("УИД", УИД);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе	
		Возврат Результат.Выгрузить()[0].Ссылка;
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьШагиПоГрафСхеме(СхемаОбзвона, ГрафическаяСхема, ТаблицаДействий = Неопределено) Экспорт
	
	ПометитьСуществующиеШагиНаУдаление(СхемаОбзвона);
	
	ТаблицаЛиний = ПолучитьПорядокЭлементовСхемы(ГрафическаяСхема.ЭлементыГрафическойСхемы);
	
	Если ТаблицаЛиний = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокСозданныхШагов = Новый ТаблицаЗначений;
	СписокСозданныхШагов.Колонки.Добавить("СозданныйШагСхемы",);
	СписокСозданныхШагов.Колонки.Добавить("Наименование",);
	
	СправочникСхема = СхемаОбзвона.ПолучитьОбъект();
	СправочникСхема.ШагиСхемы.Очистить();
	
	Для Каждого СтрЭлемент Из ТаблицаЛиний Цикл
		
		Если ТипЗнч(СтрЭлемент.ПредыдущийШаг) = Тип("ВариантЭлементаГрафическойСхемыВыборВарианта") Тогда			
			СуществующийШаг = СписокСозданныхШагов.НайтиСтроки(Новый Структура("Наименование", СтрЭлемент.ПредыдущийШаг.Наименование));			
		Иначе			
			СуществующийШаг = СписокСозданныхШагов.НайтиСтроки(Новый Структура("Наименование", СтрЭлемент.ПредыдущийШаг.Имя));
		КонецЕсли;

		Если СуществующийШаг.Количество() = 0 Тогда
			ПредыдущийШаг              = Справочники.Renault_CommunicationCenter_ШагиСхемОбзвона.СоздатьЭлемент(); //предыдущий
			ПредыдущийШаг.Владелец     = СхемаОбзвона;
			ПредыдущийШаг.Наименование = ?(ТипЗнч(СтрЭлемент.ПредыдущийШаг) = Тип("ВариантЭлементаГрафическойСхемыВыборВарианта"),СтрЭлемент.ПредыдущийШаг.Наименование,СтрЭлемент.ПредыдущийШаг.Имя);
			ПредыдущийШаг.Содержание   = СОКРЛП(СтрЭлемент.ПредыдущийШаг.Наименование);
			ПредыдущийШаг.Вид          = Строка(ТипЗнч(СтрЭлемент.ПредыдущийШаг));
			СтрокаБлока = ТаблицаДействий.Найти(ПредыдущийШаг.Наименование, "ЭлементСхемы");
			Если СтрокаБлока<>Неопределено Тогда
				ПредыдущийШаг.Действие              = СтрокаБлока.Действие;
				ПредыдущийШаг.НазначениеОпросов     = СтрокаБлока.НазначениеОпросов;
				ПредыдущийШаг.СхемаОбзвонаВторичная = СтрокаБлока.СхемаОбзвонаВторичная;
			КонецЕсли;			
			ПредыдущийШаг.Записать();
			НовШаг                   = СписокСозданныхШагов.Добавить();
			НовШаг.СозданныйШагСхемы = ПредыдущийШаг.Ссылка;
			НовШаг.Наименование      = ПредыдущийШаг.Наименование;
		Иначе
			ПредыдущийШаг = СуществующийШаг[0].СозданныйШагСхемы;
		КонецЕсли;
				
		Если ТипЗнч(СтрЭлемент.Шаг) = Тип("ВариантЭлементаГрафическойСхемыВыборВарианта") Тогда			
			СуществующийШаг = СписокСозданныхШагов.НайтиСтроки(Новый Структура("Наименование", СтрЭлемент.Шаг.Наименование));			
		Иначе			
			СуществующийШаг = СписокСозданныхШагов.НайтиСтроки(Новый Структура("Наименование", СтрЭлемент.Шаг.Имя));
		КонецЕсли;

		Если СуществующийШаг.Количество() = 0 Тогда
			Шаг = Справочники.Renault_CommunicationCenter_ШагиСхемОбзвона.СоздатьЭлемент(); //текущий
			Шаг.Владелец     = СхемаОбзвона;
			Шаг.Наименование = СтрЭлемент.Шаг.Имя;
			Шаг.Содержание   = СОКРЛП(СтрЭлемент.Шаг.Наименование);
			Шаг.Вид          = Строка(ТипЗнч(СтрЭлемент.Шаг));
			СтрокаБлока = ТаблицаДействий.Найти(Шаг.Наименование, "ЭлементСхемы");
			Если СтрокаБлока<>Неопределено Тогда
				Шаг.Действие          = СтрокаБлока.Действие;
				Шаг.НазначениеОпросов = СтрокаБлока.НазначениеОпросов;
				Шаг.СхемаОбзвонаВторичная = СтрокаБлока.СхемаОбзвонаВторичная;
			КонецЕсли;
			Шаг.Записать();
			НовШаг                   = СписокСозданныхШагов.Добавить();
			НовШаг.СозданныйШагСхемы = Шаг.Ссылка;
			НовШаг.Наименование      = Шаг.Наименование;
		Иначе
			Шаг = СуществующийШаг[0].СозданныйШагСхемы;
        КонецЕсли;
		
		Если ТипЗнч(СтрЭлемент.СледующийШаг) = Тип("ВариантЭлементаГрафическойСхемыВыборВарианта") Тогда			
			СуществующийШаг = СписокСозданныхШагов.НайтиСтроки(Новый Структура("Наименование", СтрЭлемент.СледующийШаг.Наименование));			
		Иначе			
			СуществующийШаг = СписокСозданныхШагов.НайтиСтроки(Новый Структура("Наименование", СтрЭлемент.СледующийШаг.Имя));
		КонецЕсли;
		
		Если СуществующийШаг.Количество() = 0 Тогда
			СледующийШаг = Справочники.Renault_CommunicationCenter_ШагиСхемОбзвона.СоздатьЭлемент(); //следующий
			СледующийШаг.Владелец     = СхемаОбзвона;
			СледующийШаг.Наименование = ?(ТипЗнч(СтрЭлемент.СледующийШаг) = Тип("ВариантЭлементаГрафическойСхемыВыборВарианта"), СтрЭлемент.СледующийШаг.Наименование,СтрЭлемент.СледующийШаг.Имя);
			СледующийШаг.Содержание   = СОКРЛП(СтрЭлемент.СледующийШаг.Наименование);
			СледующийШаг.Вид          = Строка(ТипЗнч(СтрЭлемент.СледующийШаг));
			СтрокаБлока = ТаблицаДействий.Найти(СледующийШаг.Наименование, "ЭлементСхемы");
			Если СтрокаБлока<>Неопределено Тогда
				СледующийШаг.Действие          = СтрокаБлока.Действие;
				СледующийШаг.НазначениеОпросов = СтрокаБлока.НазначениеОпросов;
				СледующийШаг.СхемаОбзвонаВторичная = СтрокаБлока.СхемаОбзвонаВторичная;
			КонецЕсли;
			СледующийШаг.Записать();
		    НовШаг                   = СписокСозданныхШагов.Добавить();
			НовШаг.СозданныйШагСхемы = СледующийШаг.Ссылка;
			НовШаг.Наименование      = СледующийШаг.Наименование;
		Иначе
			СледующийШаг = СуществующийШаг[0].СозданныйШагСхемы;		
		КонецЕсли;
			
		НовСтрока = СправочникСхема.ШагиСхемы.Добавить();  //предыдущий и текущий 
		НовСтрока.ШагСхемы = ПредыдущийШаг.Ссылка;
		НовСтрока.Вид      = ПредыдущийШаг.Вид;
		НовСтрока.СледующийШаг = Шаг.Ссылка;
				
		НовСтрока = СправочникСхема.ШагиСхемы.Добавить(); //текущий и следующий  
		НовСтрока.ШагСхемы = Шаг.Ссылка;
		НовСтрока.Вид      = Шаг.Вид;
		НовСтрока.СледующийШаг = СледующийШаг.Ссылка;
				
		//Завершение записываем отдельно
		Если ТипЗнч(СтрЭлемент.СледующийШаг) = Тип("ЭлементГрафическойСхемыЗавершение") Тогда
			НовСтрока = СправочникСхема.ШагиСхемы.Добавить();  
			НовСтрока.ШагСхемы = СледующийШаг.Ссылка;
			НовСтрока.Вид      = СледующийШаг.Вид;
		КонецЕсли;
		
	КонецЦикла;
	
	СправочникСхема.Записать();
		
КонецПроцедуры

Функция ПолучитьПорядокЭлементовСхемы(ЭлементыГрафическойСхемы) Экспорт
	
	//получим варианты след. шагов по линиям,
	//если по точкам линии нельзя определить следующий и предыдущий шаг, значит выдаем сообщение пользователю о том,
	//что линию надо подсоединить к блоку
	
	ВлевоНачало  = 0;
	ВверхНачало  = 0;
	
	ВлевоКонец  = 0;
	ВверхКонец  = 0;
	
	ТаблицаЛиний = Новый ТаблицаЗначений;
	ТаблицаЛиний.Колонки.Добавить("Шаг",);
	ТаблицаЛиний.Колонки.Добавить("Влево",);
	ТаблицаЛиний.Колонки.Добавить("Вверх",);
	ТаблицаЛиний.Колонки.Добавить("Высота",);
	ТаблицаЛиний.Колонки.Добавить("Ширина",);
	ТаблицаЛиний.Колонки.Добавить("ПредыдущийШаг",);
	ТаблицаЛиний.Колонки.Добавить("СледующийШаг",);
	ТаблицаЛиний.Колонки.Добавить("ВыборВарианта",);
	ТаблицаЛиний.Колонки.Добавить("ЕстьВыборВарианта",);
		
	ТаблицаБлоков = Новый ТаблицаЗначений;
	ТаблицаБлоков.Колонки.Добавить("ЭлементСхемы",);
	ТаблицаБлоков.Колонки.Добавить("Влево",);
    ТаблицаБлоков.Колонки.Добавить("Вверх",);
    ТаблицаБлоков.Колонки.Добавить("Высота",);
    ТаблицаБлоков.Колонки.Добавить("Ширина",);
    ТаблицаБлоков.Колонки.Добавить("ВыборВарианта",);

	ЛинииСОшибкой = Новый СписокЗначений;
	
	Для Каждого СтрЭлемент Из ЭлементыГрафическойСхемы Цикл
		
		Если ТипЗнч(СтрЭлемент) = Тип("ЭлементГрафическойСхемыСоединительнаяЛиния") 
			ИЛИ  ТипЗнч(СтрЭлемент) = Тип("ЭлементГрафическойСхемыДекоративнаяЛиния") Тогда
			
			НовСтрока = ТаблицаЛиний.Добавить();
			НовСтрока.Шаг = СтрЭлемент;
			НовСтрока.Влево = СтрЭлемент.НачалоЛево;
	        НовСтрока.Вверх = СтрЭлемент.НачалоВерх;
	        НовСтрока.Высота = СтрЭлемент.КонецВерх;
	        НовСтрока.Ширина = СтрЭлемент.КонецЛево;
	        НовСтрока.ЕстьВыборВарианта = Ложь;

		Иначе
			
			НовСтрока = ТаблицаБлоков.Добавить();
			НовСтрока.ЭлементСхемы = СтрЭлемент;
			НовСтрока.Влево = СтрЭлемент.Лево;
	        НовСтрока.Вверх = СтрЭлемент.Верх;
	        НовСтрока.Высота = СтрЭлемент.Высота+СтрЭлемент.Верх;
	        НовСтрока.Ширина = СтрЭлемент.Ширина+СтрЭлемент.Лево;

			Если ТипЗнч(СтрЭлемент) = Тип("ЭлементГрафическойСхемыВыборВарианта") Тогда
				
				НовСтрока.Высота = СтрЭлемент.Высота+СтрЭлемент.Верх-СтрЭлемент.Элементы.Количество()*20;
				
				ВысотаЭлемента = 20+НовСтрока.Высота; 
				ВверхЭлемента  = НовСтрока.Высота;
				
				Для Каждого СтрВариант Из СтрЭлемент.Элементы Цикл
					
					НовСтрока = ТаблицаБлоков.Добавить();
					НовСтрока.ЭлементСхемы = СтрВариант;
					НовСтрока.Влево = СтрЭлемент.Лево;
			        НовСтрока.Вверх  = ВверхЭлемента;
			        НовСтрока.Высота = ВысотаЭлемента;
			        НовСтрока.Ширина = СтрЭлемент.Ширина+СтрЭлемент.Лево;
					НовСтрока.ВыборВарианта = СтрЭлемент;
					
					ВверхЭлемента  = ВверхЭлемента+20;
					ВысотаЭлемента = ВысотаЭлемента+20;		
					
				КонецЦикла;
				
			КонецЕсли;

		КонецЕсли;	
							
	КонецЦикла;
		
	Для Каждого Стр Из ТаблицаЛиний Цикл
		
		ВлевоНачало  = Стр.Влево;
		ВверхНачало  = Стр.Вверх;	
			
		ВлевоКонец  = Стр.Ширина;
		ВверхКонец  = Стр.Высота;
		
		Если Стр.Шаг.ЦветЛинии = Новый Цвет(255,0,0) Тогда
			 Стр.Шаг.ЦветЛинии = ЦветаСтиля.ЦветРамки;
		КонецЕсли;
		
		Для Каждого СтрБлок Из ТаблицаБлоков Цикл  //ищем блоки линий
		
			Если СтрБлок.Влево<=ВлевоНачало
				И ВлевоНачало<=СтрБлок.Ширина 
				И СтрБлок.Вверх<=ВверхНачало
				И ВверхНачало<=СтрБлок.Высота Тогда //проверяем начало линии 

			    Стр.ПредыдущийШаг = СтрБлок.ЭлементСхемы;
				
				Если СтрБлок.ВыборВарианта<>Неопределено Тогда
					Стр.ВыборВарианта = СтрБлок.ВыборВарианта;
					Стр.ЕстьВыборВарианта = Истина;
				КонецЕсли;
								
			КонецЕсли;
			
			Если СтрБлок.Влево<=ВлевоКонец
				И ВлевоКонец<=СтрБлок.Ширина 
				И СтрБлок.Вверх<=ВверхКонец
				И ВверхКонец<=СтрБлок.Высота Тогда //проверяем Конец линии 

			    Стр.СледующийШаг = СтрБлок.ЭлементСхемы;
								
			КонецЕсли;	
			
		КонецЦикла;
		
		Если Стр.ПредыдущийШаг = Неопределено ИЛИ Стр.СледующийШаг = Неопределено Тогда
			Если ЛинииСОшибкой.НайтиПоЗначению(Стр.Шаг) = Неопределено Тогда
				ЛинииСОшибкой.Добавить(Стр.Шаг);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;	
	
	//добавляем строки с вариантами
	СтрокиВариантов = ТаблицаЛиний.НайтиСтроки(Новый Структура("ЕстьВыборВарианта", Истина));
	
	Для Каждого СтрокаВарианта Из СтрокиВариантов Цикл
		НовСтрока = ТаблицаЛиний.Добавить();
		НовСтрока.Шаг = СтрокаВарианта.ПредыдущийШаг;
		НовСтрока.ПредыдущийШаг = СтрокаВарианта.ВыборВарианта;
		НовСтрока.СледующийШаг  = СтрокаВарианта.Шаг;
	КонецЦикла;	
	
	ТаблицаЛиний.Сортировать("ПредыдущийШаг");
	
	Для Каждого ОшибкаЛинии Из ЛинииСОшибкой Цикл
		ОшибкаЛинии.Значение.ЦветЛинии = Новый Цвет(255,0,0);
	КонецЦикла;	
	
	Если ЛинииСОшибкой.Количество()>0 Тогда
		Сообщить("Есть линии не соединенные с блоками схемы!");
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ТаблицаЛиний;
	
КонецФункции

Процедура ПометитьСуществующиеШагиНаУдаление(СхемаОбзвона)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Renault_CommunicationCenter_ШагиСхемОбзвона.Ссылка
	|ИЗ
	|	Справочник.Renault_CommunicationCenter_ШагиСхемОбзвона КАК Renault_CommunicationCenter_ШагиСхемОбзвона
	|ГДЕ
	|	Renault_CommunicationCenter_ШагиСхемОбзвона.Владелец = &Владелец
	|	И НЕ Renault_CommunicationCenter_ШагиСхемОбзвона.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Владелец", СхемаОбзвона);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ШагСхемы = Выборка.Ссылка.ПолучитьОбъект();
		ШагСхемы.ПометкаУдаления = Истина;
		ШагСхемы.Записать();		
	
	КонецЦикла;
	
КонецПроцедуры

Функция ПроверитьКлиентаНаОтказОтКонтакта(ТекущийКлиент) Экспорт
	
	Запись = РегистрыСведений.CRM_КлиентскиеДанные.СоздатьНаборЗаписей();			
	Запись.Отбор.Клиент.Установить(ТекущийКлиент);
	Запись.Прочитать();
		
	Если Запись.Количество() >0 Тогда
		Если Запись[0].ОтказОтКонтакта = Истина Тогда
			Возврат Истина;	
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции
