Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
	//Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
	
		Если Не ПометкаУдаления Тогда
			
			Если ШагиСхемы.Количество() > 0 Тогда
			
				Поиск = Новый Структура("Вид", "Элемент графической схемы Старт");
				
				Если ШагиСхемы.НайтиСтроки(Поиск).Количество() = 0 Тогда
					
					Сообщить("На графической схеме обзвона отсутствуют Старт, запись отменена!");
					
					Отказ = Истина;
					
				ИначеЕсли ШагиСхемы.НайтиСтроки(Поиск).Количество()>1 Тогда
					
					Сообщить("На графической схеме обзвона указано несколько шагов Старт, запись отменена!");
					
					Отказ = Истина;
					
				Иначе
				КонецЕсли;
				
				Поиск = Новый Структура("Вид", "Элемент графической схемы Завершение");
				
				Если ШагиСхемы.НайтиСтроки(Поиск).Количество() = 0 Тогда
					
					Сообщить("На графической схеме обзвона отсутствуют Завершение, запись отменена!");
					
					Отказ = Истина;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если СпособПолученияКлиентов = Перечисления.DMS_СпособыПолученияКлиентовДляСхемКоммуникации.Отбор Тогда			
				Справочники.Renault_CommunicationCenter_СхемыОбзвона.ПерезаполнитьСписокКлиентовВыборки(Ссылка);
			КонецЕсли;
							
			Если Не Завершена И НЕ ОбменДанными.Загрузка Тогда
				
				Если Исполнители.Количество()>0 Тогда
					Справочники.Renault_CommunicationCenter_СхемыОбзвона.СоздатьНапоминания(Ссылка);
				КонецЕсли;
				
				Если Не Предопределенный Тогда
																           				
					Если ТипКоммуникации = Перечисления.ВидыСобытий.ТелефонныйЗвонок И ШагиСхемы.Количество() = 0 Тогда 
					Иначе	
						Если DMS_РекламныеКампанииВызовСервера.ОтправитьСхемуКоммуникацииВDictionary(Ссылка) Тогда
							ЗаписьЖурналаРегистрации("Отправление схемы коммуникации на Dictionary завершено успешно",,,);
						Иначе
							ЗаписьЖурналаРегистрации("Отправление схемы коммуникации на Dictionary не выполнено",,,);						
						КонецЕсли;
					КонецЕсли;	
						
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

