//Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка) 
//	СтандартнаяОбработка=Ложь; 
//	Поля.Добавить("Наименование"); 
//	Поля.Добавить("ЗначениеСтрока"); 
//	Поля.Добавить("ВидПравила"); 
//	Поля.Добавить("ЭтоГруппа");
//КонецПроцедуры
//Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) 
//	СтандартнаяОбработка=Ложь; 
//	Если Данные.ЭтоГруппа Тогда
//		Представление=Данные.Наименование	
//	Иначе
//		Если Данные.ВидПравила=Перечисления.Renault_ВидыПравил.Формула Тогда Представление=Данные.Наименование+" (формула)";	
//		ИначеЕсли Данные.ВидПравила=Перечисления.Renault_ВидыПравил.Программа Тогда Представление=Данные.Наименование+" (программа)";
//		Иначе Представление=Данные.ЗначениеСтрока;
//		КонецЕсли;	
//	КонецЕсли;	
//КонецПроцедуры

Функция ЗначениеКорректно(ВидПравила,ЗначениеСтрока,Результат) Экспорт
	Если ВидПравила=Перечисления.Renault_ВидыПравил.Ссылка Тогда Возврат Истина
	ИначеЕсли ВидПравила=Перечисления.Renault_ВидыПравил.Булево Тогда
		Попытка Результат=Булево(ЗначениеСтрока) Исключение Результат="Не верное значение булево!"; Возврат Ложь КонецПопытки;	
	ИначеЕсли ВидПравила=Перечисления.Renault_ВидыПравил.Дата Тогда
		Попытка Результат=Дата(ЗначениеСтрока) Исключение Результат="Не верная дата!"; Возврат Ложь КонецПопытки;	
	ИначеЕсли ВидПравила=Перечисления.Renault_ВидыПравил.Строка Тогда Возврат Истина
	ИначеЕсли ВидПравила=Перечисления.Renault_ВидыПравил.Число Тогда 
		Попытка Результат=Число(ЗначениеСтрока) Исключение Результат="Не верное число!"; Возврат Ложь КонецПопытки;	
	ИначеЕсли ВидПравила=Перечисления.Renault_ВидыПравил.Программа Тогда
		Если ПустаяСтрока(ЗначениеСтрока)=Истина Тогда Результат="Текст программы не задан!" КонецЕсли;
	ИначеЕсли ВидПравила=Перечисления.Renault_ВидыПравил.Формула Тогда
		Если ПустаяСтрока(ЗначениеСтрока)=Истина Тогда Результат="Текст формулы не задан!" КонецЕсли;
	КонецЕсли;
	Возврат Истина
КонецФункции

Функция ПолучитьЗначение(Правило) Экспорт
	Если Правило.ВидПравила=Перечисления.Renault_ВидыПравил.Ссылка Тогда Возврат Правило.ЗначениеСсылка
	ИначеЕсли Правило.ВидПравила=Перечисления.Renault_ВидыПравил.Булево Тогда Возврат Булево(Правило.ЗначениеСтрока)
	ИначеЕсли Правило.ВидПравила=Перечисления.Renault_ВидыПравил.Дата Тогда Возврат Дата(Правило.ЗначениеСтрока)
	ИначеЕсли Правило.ВидПравила=Перечисления.Renault_ВидыПравил.Программа Тогда Возврат Правило.ЗначениеСтрока
	ИначеЕсли Правило.ВидПравила=Перечисления.Renault_ВидыПравил.Формула Тогда Возврат Правило.ЗначениеСтрока
	ИначеЕсли Правило.ВидПравила=Перечисления.Renault_ВидыПравил.Строка Тогда Возврат Правило.ЗначениеСтрока
	ИначеЕсли Правило.ВидПравила=Перечисления.Renault_ВидыПравил.Число Тогда Возврат Число(Правило.ЗначениеСтрока)
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура УстановитьКомментарий(Форма,ПолеФормы,РеквизитОбъекта) Экспорт
    Текст=ПолеФормы.ТекстРедактирования;
	Если Текст="" Тогда Возврат КонецЕсли;
    
    НачалоСтроки = 0; НачалоКолонки = 0; КонецСтроки = 0; КонецКолонки = 0;
    ПолеФормы.ПолучитьГраницыВыделения(НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки);		
    
    ТекстовыйДокумент = Новый ТекстовыйДокумент;
    ТекстовыйДокумент.УстановитьТекст(Текст);
    МаксимальныйОтступ = 0;
    МинимальныйОтступ = 0;
    Для i = НачалоСтроки По КонецСтроки Цикл
        Строка = ТекстовыйДокумент.ПолучитьСтроку(i);
        Строка = СтрЗаменить(Строка, "  ", "    ");
        СимволовСлева = Найти(Строка, СокрЛП(Строка));
        МаксимальныйОтступ = Макс(СимволовСлева, МаксимальныйОтступ);
        МинимальныйОтступ = ?(МинимальныйОтступ = 0, МаксимальныйОтступ, МинимальныйОтступ);
        МинимальныйОтступ  = Мин(МаксимальныйОтступ, МинимальныйОтступ );
    КонецЦикла;
    
    ТексДляВыделения = "";
    Для i = НачалоСтроки По КонецСтроки Цикл
        Строка = ТекстовыйДокумент.ПолучитьСтроку(i);
        Строка = СтрЗаменить(Строка, "  ", "    ");
        Строка = Лев(Строка, МинимальныйОтступ-1) + "//" + Сред(Строка, МинимальныйОтступ);
        ТекстовыйДокумент.ЗаменитьСтроку(i, Строка);
        ТексДляВыделения = ТексДляВыделения + Символы.ПС + Строка;
    КонецЦикла;
    
    НовыйТекст = ТекстовыйДокумент.ПолучитьТекст();
    РеквизитОбъекта=НовыйТекст;
    
    Форма.ТекущийЭлемент = ПолеФормы;
    Форма.ОбновитьОтображениеДанных();    
    ПолеФормы.УстановитьГраницыВыделения(НачалоСтроки, 1, КонецСтроки, СтрДлина(СокрП(Строка)+1));
КонецПроцедуры
&НаКлиенте
Процедура УдалитьКомментарий(Форма,ПолеФормы,РеквизитОбъекта) Экспорт
    Текст=ПолеФормы.ТекстРедактирования;
	Если Текст="" Тогда Возврат КонецЕсли;
    
    НачалоСтроки = 0; НачалоКолонки = 0; КонецСтроки = 0; КонецКолонки = 0;
    ПолеФормы.ПолучитьГраницыВыделения(НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки);		
    
    ТекстовыйДокумент = Новый ТекстовыйДокумент;
    ТекстовыйДокумент.УстановитьТекст(Текст);
    
    Для i = НачалоСтроки По КонецСтроки Цикл
        Строка = ТекстовыйДокумент.ПолучитьСтроку(i);
        Вхождение = Найти(Строка, "//");
        Если Вхождение > 0 Тогда
            Строка = Лев(Строка, Вхождение-1) + Сред(Строка, Вхождение + 2);
        КонецЕсли; 
        ТекстовыйДокумент.ЗаменитьСтроку(i, Строка);
    КонецЦикла;
    
    РеквизитОбъекта = ТекстовыйДокумент.ПолучитьТекст();
    Форма.ТекущийЭлемент = ПолеФормы;
    Форма.ОбновитьОтображениеДанных();    
    ПолеФормы.УстановитьГраницыВыделения(НачалоСтроки, 1, КонецСтроки, СтрДлина(СокрП(Строка)+1));
	
КонецПроцедуры
