// Отправляет SMS через P1SMS.
//
// Параметры:
//  НомераПолучателей - Массив - номера получателей в формате +7ХХХХХХХХХХ;
//  Текст 			  - Строка - текст сообщения, длиной не более 480 символов;
//  ИмяОтправителя 	  - Строка - имя отправителя, которое будет отображаться вместо номера входящего SMS;
//  Логин			  - Строка - логин пользователя услуги отправки sms;
//  Пароль			  - Строка - пароль пользователя услуги отправки sms.
//
// Возвращаемое значение:
//  Структура: ОтправленныеСообщения - Массив структур: НомерОтправителя.
//                                                  ИдентификаторСообщения.
//             ОписаниеОшибки        - Строка - пользовательское представление ошибки, если пустая строка,
//                                          то ошибки нет.
Функция ОтправитьSMS(НомераПолучателей, Текст, ИмяОтправителя, Логин, Пароль) Экспорт
	
	Результат = Новый Структура("ОтправленныеСообщения,ОписаниеОшибки", Новый Массив, "");
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Login", Логин);
	ПараметрыЗапроса.Вставить("Password", Пароль);
	ПараметрыЗапроса.Вставить("Source", ИмяОтправителя);
	ПараметрыЗапроса.Вставить("Text", Текст);
	
	Для Каждого НомерПолучателя Из НомераПолучателей Цикл
		
		    Соединение = Новый HTTPСоединение("admin.p1sms.ru/apiSms/",,,,,, Новый ЗащищенноеСоединениеOpenSSL());
			Запрос = Новый HTTPЗапрос("create");
			Запрос.Заголовки.Вставить("Content-Type", "application/json");
			Запрос.Заголовки.Вставить("accept", "application/json");
			//Запрос.УстановитьТелоИзСтроки("{""apiKey"": ""yzD1KpFJfET9OxBxD2jPxDhi5nBEA0C8vsklEZiCuxQZIblDDe5KgJ8j6mvy"",""sms"":[{""channel"":""char"",""phone"":""79276100311"",""text"":""СМС тест"",""sender"":""VIRTA""}]}","utf-8", ИспользованиеByteOrderMark.НеИспользовать);
			Запрос.УстановитьТелоИзСтроки("{""apiKey"": """+Логин+""",""sms"":[{""channel"":""char"",""phone"":"""+НомерПолучателя+""",""text"":"""+Текст+""",""sender"":"""+ИмяОтправителя+"""}]}","utf-8", ИспользованиеByteOrderMark.НеИспользовать);
			Ответ = Соединение.ОтправитьДляОбработки(Запрос);
			ТелоОтвет = Ответ.ПолучитьТелоКакСтроку();

	КонецЦикла;
	
	//Результат.ОписаниеОшибки = СокрП(Результат.ОписаниеОшибки);
	//Если Не ПустаяСтрока(Результат.ОписаниеОшибки) Тогда
	//	ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка SMS'", Renault_ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
	//		УровеньЖурналаРегистрации.Ошибка, , , Результат.ОписаниеОшибки);
	//КонецЕсли;
	//
	
	Возврат Результат;
	
КонецФункции
