
&НаКлиенте
Процедура КомандаОк(Команда)
	
	Закрыть(СписокЗначений);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ЭтаФорма.СписокЗначений.ЗагрузитьЗначения(Параметры.СписокВыбора.ВыгрузитьЗначения());
	ЭтаФорма.СписокЗначений                   = Параметры.СписокВыбора;
	ЭтаФорма.СписокЗначений.ТипЗначения       = Параметры.ТипЗначения;
	ЭтаФорма.СписокЗначений.ДоступныеЗначения = Параметры.ДоступныеЗначения;
	ТолькоГруппы                              = Параметры.ТолькоГруппы;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначенийЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ТолькоГруппы Тогда
		Элемент.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
	КонецЕсли;
	
КонецПроцедуры
