////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;							// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования
Перем ВводИзАРМРесепшен;						// Переменная хранит флаг, был ли введен данный документ из АРМ Ресепшен
Перем РегистрацияЗвонковИКонтактов;				// Переменная хранит структуру при вводе на основании из АРМ Ресепшн
Перем ЗаписанНовыйДокумент Экспорт;				// Флаг записи нового документа
Перем ЭтоОбычныйМОП;							// Флаг пользователя без права Корпоративных продаж или Полных прав

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	// Обязательные поля таблицы товаров
	ОбязательныеТовары=Новый Структура();
	ОбязательныеТовары.Вставить("Номенклатура",3);
	ОбязательныеТовары.Вставить("Количество",1);
	ОбязательныеТовары.Вставить("ЕдиницаИзмерения",3);
	ОбязательныеТовары.Вставить("Коэффициент",1);
	ОбязательныеТовары.Вставить("ХарактеристикаНоменклатуры",2);
	
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты = Новый Структура();
	ОбязательныеРеквизиты.Вставить("Организация", 1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании", 1);
	ОбязательныеРеквизиты.Вставить("Автор", 1);
	ОбязательныеРеквизиты.Вставить("ХозОперация", 1);
	//ОбязательныеРеквизиты.Вставить("Тема", 1);
	ОбязательныеРеквизиты.Вставить("ВидСобытия", 1);
	ОбязательныеРеквизиты.Вставить("Приоритет", 1);
	ОбязательныеРеквизиты.Вставить("Состояние", 1);
	ОбязательныеРеквизиты.Вставить("ТипСообщения", 1);
	ОбязательныеРеквизиты.Вставить("ДатаНачала", 1);
	ОбязательныеРеквизиты.Вставить("Товары",ОбязательныеТовары);
	
	//Бондаренко++ 20170902
	Если НЕ обЗначениеНеЗаполнено(ДокументОснование) Тогда
		Если ТипЗНЧ(ДокументОснование)=Тип("ДокументСсылка.ЗаказПокупателя") Тогда
 			ОбязательныеРеквизиты.Вставить("Комментарий", 1);
			ОбязательныеРеквизиты.Вставить("ВнутреннийНомер", 1);
			ОбязательныеРеквизиты.Вставить("ДатаВремяЗвонка", 1);
 		КонецЕсли;	
	КонецЕсли;
	//Бондаренко-- 20170902
	
	//Гэндальф+++
	
	//ОбязательныеРеквизиты.Вставить("Комментарий", 1);
	//ОбязательныеРеквизиты.Вставить("Тема", 1);

    Если  обПраво("ПроверкаДокументовИСправочников",Права,,ЭтотОбъект) тогда
    //Гэндальф---
	// + КМ
	Если РегистрацияЗвонковИКонтактов = Неопределено и ВидСобытия = Перечисления.ВидыСобытий.ТестДрайв Тогда

		// Обязательные поля таблицы автомобилей
		ОбязательныеАвтомобили=Новый Структура();
		ОбязательныеАвтомобили.Вставить("Автомобиль",3);
		ОбязательныеАвтомобили.Вставить("Количество",1);
		ОбязательныеРеквизиты.Вставить("Автомобили",ОбязательныеАвтомобили);
	КонецЕсли;		
	// - КМ
	//Гэндальф+++
	КонецЕсли;
	//Гэндальф---

	Возврат ОбязательныеРеквизиты;
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Проверяет корректность заполнения объекта.
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры:
//  Ошибки       - строка, в случае некорректного заполнения содержит описанием возникших ошибок, 
//  ДопРеквизиты - структура, на вход может быть передана структура с дополнительными реквизитами для проверки,
//  Заполнение   - булево, флаг проверки, 
//  Уникальность - булево, флаг проверки.
//
// Возвращаемое значение:
//  Булево - Возвращает Истина если все заполнено корректно и Ложь иначе.
// 
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	// Здесь могут быть определены дополнительные к стандартным обязательным реквизитам условия проверки
	// проверим что Дата окончания не меньше даты начала
	Если НЕ обЗначениеНеЗаполнено(ДатаОкончания) И ДатаОкончания < ДатаНачала  и   обПраво("ПроверкаДокументовИСправочников",Права,,ЭтотОбъект) Тогда
		дкДобавитьОшибку(Ошибки,"Дата окончания события не может быть меньше даты начала!");
		Возврат Ложь;	
	КонецЕсли;
	
	Возврат дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность, Истина);
КонецФункции // ПроверитьКорректность()

// Возвращает список возможных хозяйственных операций документа
// Возвращаемое значение: 
//  СписокЗначений. 
//  Строка списка: Значение - имя предопределенного элемента; 
//				   Представление - красивое его представление
// 				   "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("Событие", "Событие", Истина);
	Возврат СписокХозОпераций;
КонецФункции // ПолучитьСписокХозОпераций()

// Функция проверяет, допустимо ли изменение объекта
//
// Параметры:
//  БлокироватьРеквизиты - структура, структура блокируемых на изменение реквизитов.
//
// Возвращаемое значение:
// Булево - Возвращает Истина, если изменения возможны, ложь иначе
//          Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
//
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции // ДоступностьИзменения()

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка – Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	– Форма	 – Ссылка на форму документа. Если значение неопределено,
//                         производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	Рез=Истина;
	
	//ОБРАБОТКА ТАБЛИЧНОЙ ЧАСТИ "АВТОМОБИЛИ"
		
	Если Имя="ДатаНачала" Тогда
		Если ДатаОкончания <= ДатаНачала Тогда
			ДатаОкончания = ДатаНачала + 900;
		КонецЕсли;
		Продолжительность = Окр((ДатаОкончания - ДатаНачала) / 3600, 2);
		
	ИначеЕсли Найти(Имя,"Товары.")=1 Тогда
		Если ТипЗнч(ДопПараметры)<>Тип("Структура") Тогда
			ДопПараметры=Новый Структура;
		КонецЕсли;
		ДопПараметры.Вставить("ПересчитатьЦену",Ложь);
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);	
		
	ИначеЕсли Имя="Автомобили.Автомобиль" Тогда
		//Проставим количество
		Если ТекСтрока.Количество<>1 Тогда
			ТекСтрока.Количество=1;
		КонецЕсли;
		
		// заметки
		#Если Клиент Тогда
			дкСообщитьОЗаметках(ЭтотОбъект,ТекСтрока.Автомобиль,ЭтаФорма);
		#КонецЕсли
		
	Иначе 
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);	
	КонецЕсли;
	
	Возврат Рез;
КонецФункции // ОбработкаРеквизита()

// заполнение свойств из документа основания
Процедура ЗаполнитьСвойстваНаОсновании(Основание) Экспорт
 //зарезервировано для описания заполнения свойств из свойств основания
КонецПроцедуры


#Если Клиент Тогда

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

// Формирует табличный документ 
// 
// Параметры:
//  ТабДокумент - табличный документ.
//
// Возвращаемое значение:
//  ТабДокумент - возвращает сформированный табличный документ.
//
Функция ПечатьСобытие(ТабДокумент) Экспорт
	
	Макет = ПолучитьМакет("Событие");
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаДокумента");
	ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
	ОбластьМакета.Параметры.ТекстЗаголовка = дкПолучитьПредставление(ЭтотОбъект);
	//вывод свойств
	СтрокаСвойств = дкПолучитьСтрокуСвойствДокумента(ЭтотОбъект);
	ОбластьМакета.Параметры.СтрокаСвойств = СтрокаСвойств;
	ТабДокумент.Вывести(ОбластьМакета);
	
	Если Пользователи.Количество() > 0 Тогда
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("ПустаяСтрока"));
		Область = Макет.ПолучитьОбласть("СтрокаПользователи");
		Для Каждого ТекСтрокаПользователи Из Пользователи Цикл
			Если ТекСтрокаПользователи.НомерСтроки = 1 Тогда
				Область.Параметры.НазваниеСтроки = "Пользователи:";
			Иначе
				Область.Параметры.НазваниеСтроки = " ";
			КонецЕсли;
			Область.Параметры.СтрокаПользователей = ТекСтрокаПользователи.Пользователь;
			ТабДокумент.Вывести(Область);
		КонецЦикла;
	КонецЕсли;	
	
	Если СторонниеЛица.Количество() > 0 Тогда
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("ШапкаСторонниеЛица"));
		Область = Макет.ПолучитьОбласть("СтрокаСторонниеЛица");
		Для Каждого ТекСтрокаСторонниеЛица Из СторонниеЛица Цикл
			Если  обЗначениеНеЗаполнено(ТекСтрокаСторонниеЛица.Контрагент)Тогда
				Область.Параметры.Контрагент = " ";
				Область.Параметры.КонтрагентСсылка = Неопределено;
			Иначе
				Область.Параметры.Контрагент = спПолучитьНаименование(ТекСтрокаСторонниеЛица.Контрагент);
				Область.Параметры.КонтрагентСсылка = ТекСтрокаСторонниеЛица.Контрагент;
			КонецЕсли;
			Если обЗначениеНеЗаполнено(ТекСтрокаСторонниеЛица.КонтактноеЛицо)Тогда
				ТекущееКонтактноеЛицо = " ";
			Иначе
				ТекущееКонтактноеЛицо = ТекСтрокаСторонниеЛица.КонтактноеЛицо;
			КонецЕсли;
			Если обЗначениеНеЗаполнено(ТекСтрокаСторонниеЛица.КонтактнаяИнформация)Тогда
				ТекущаяКонтактнаяИнформация = " ";
			Иначе	
				ТекущаяКонтактнаяИнформация = СокрЛП(ТекСтрокаСторонниеЛица.КонтактнаяИнформация);
			КонецЕсли;
			
			Область.Параметры.КонтактноеЛицо = ТекущееКонтактноеЛицо;
			Область.Параметры.КонтактнаяИнформация = ТекущаяКонтактнаяИнформация;
			ТабДокумент.Вывести(Область);	
		КонецЦикла;
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("ВерхняяГраница"));
	КонецЕсли;	
	
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаСодержание");
	Если ФорматТекста = Перечисления.ФорматТекста.ПростойТекст Тогда
		ОбластьМакета.Параметры.Содержание = Содержание;			
	Иначе			
		ОбластьМакета.Параметры.Содержание = обПолучитьТекст(Содержание);
	КонецЕсли;
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаРезультат");
	Если ФорматТекста = Перечисления.ФорматТекста.ПростойТекст Тогда
		ОбластьМакета.Параметры.Результат = Результат;			
	Иначе			
		ОбластьМакета.Параметры.Результат = обПолучитьТекст(Результат);
	КонецЕсли;
	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабДокумент;
	
КонецФункции// ПечатьСобытие(ТабДокумент) Экспорт

// Функция осуществляет печать произвольного документа.
// Можно направить печать на экран или принтер, а также распечатать необходимое количество копий.
//
// Параметры:
//	ЭтотОбъект							- ДокументОбъект	- Документ для печати
//	НазваниеПечатнойФормы 				- Строка			- Название печатной формы, если пусто, то по умолчанию
//	КоличествоЭкземпляров				- Число				- Количество экземпляров документа
//	НаПринтер							- Булево			- Признак отправки документа на принтер без отображения его на экране
//  Документ 	  						- ТабличныйДокумент	- Макет печатной формы
//
// Возвращаемое значение:
//   ТабличныйДокумент	- Сформированная печатная форма
//
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции // ПечатьСобытие()

// Возвращает доступные варианты печати документа
// Возвращаемое значение: 
//  Структура, каждая строка которой
//  соответствует одному из вариантов печати
//  Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм() Экспорт
	СтруктураМакетов=Новый Структура();
	СтруктураМакетов.Вставить("Событие", "Событие");
	Возврат СтруктураМакетов;
КонецФункции // ПолучитьСписокПечатныхФорм()

#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Процедура - обработчик ввода на основании
Процедура ОбработкаЗаполнения(Основание) Экспорт
	ФорматТекста = Перечисления.ФорматТекста.ПростойТекст; // Семенихин 05.03.2021
	
	ТипЗначенияОснование = ТипЗнч(Основание);
	
	Если ТипЗначенияОснование=Тип("Структура") Тогда	
		ИмяСтруктуры	= Неопределено;
		Основание.Свойство("Имя", ИмяСтруктуры);
		Если ИмяСтруктуры="РегистрацияЗвонковИКонтактов" Тогда
			
			ВводИзАРМРесепшен = Истина;
			
			ВидСобытия = Основание.ВидКонтакта;
			Если ТипСообщения.Пустая() Тогда
				ТипСообщения = Перечисления.ТипыСообщений.Входящее;
			КонецЕсли;
			ДатаНачала	= Основание.ДатаДень;
			Тема		= Основание.Примечание;
			
			//Если ЗначениеЗаполнено(Основание.Сотрудник) Тогда
			//	СтрокаПользователь				= Пользователи.Добавить();
			//	СтрокаПользователь.Пользователь	= Справочники.Пользователи.НайтиПоРеквизиту("Сотрудник",Основание.Сотрудник);
			//КонецЕсли;
			
			Если ЗначениеЗаполнено(Основание.Участник) Тогда
				СтрокаПользователь				= Пользователи.Добавить();
				СтрокаПользователь.Пользователь	= Справочники.Пользователи.НайтиПоРеквизиту("Сотрудник",Основание.Участник); 			
			КонецЕсли;
			
			Контрагент						= Основание.Контрагент;
			СторонниеЛицаСтрока				= СторонниеЛица.Добавить();
			СторонниеЛицаСтрока.Контрагент	= Основание.Контрагент;
			Тема							= Основание.ПредметОбращения;
			Содержание						= Основание.Примечание;
			Если ЗначениеЗаполнено(Основание.Модель) Тогда
				МодельСтрока = Автомобили.Добавить();
				МодельСтрока.Автомобиль = Основание.Модель;
				ОбработкаРеквизита("Автомобили.Автомобиль",МодельСтрока,,Новый Структура("ТабличнаяЧасть",Автомобили));
			КонецЕсли;
			
			КодГорода             = Основание.КодГорода;
			КодРегиона            = Основание.КодРегиона;
			ВнутреннийНомер       = Основание.ВнутреннийНомер;
			ПредставлениеТелефона = Основание.ПредставлениеТелефона;
			НомерТелефона         = Основание.НомерТелефона;
			ВидТелефона           = Основание.ВидТелефона;
			Попытка
				ТипКлиента = Основание.ТипКлиента;
			Исключение
			КонецПопытки;
			
			// + КМ
			Если Основание.Свойство("ДокументОснование") Тогда
				ДокументОснование = Основание.ДокументОснование;
				
				//Бондаренко++ 20170809
				ВидСобытия = Перечисления.ВидыСобытий.ТелефонныйЗвонок;
				ТипСообщения = Перечисления.ТипыСообщений.Исходящее;
				Приоритет = Перечисления.Важность.Средняя;
				//Бондаренко-- 20170809
 			КонецЕсли;
			// - КМ  
			
			// Холышевская ++ 24.06.2026
			Если ЗначениеЗаполнено(Основание.Реклама) Тогда
				ИсточникИнформации = Основание.Реклама; 
			КонецЕсли;
			// Холышевская -- 24.06.2026
			
			РегистрацияЗвонковИКонтактов = Основание;
		КонецЕсли;
		
		//не требуется вызов дкОбработкаЗаполнения()
		Возврат;	
		
	ИначеЕсли ТипЗначенияОснование=Тип("СправочникСсылка.Контрагенты") Тогда
		
		// вызов обработчиков из дкОбработкаЗаполнения()
		дкОбработкаЗаполненияПоУмолчанию(ЭтотОбъект,Основание,Ложь,Ложь);
		
		Если Основание.ЭтоГруппа Тогда 
			Возврат;
		КонецЕсли;
		
		// вызов обработчиков из дкОбработкаЗаполнения()
		дкДокументыНаОснованииКонтрагентов(ЭтотОбъект,Основание,Результат);
		
		//заполним реквизит контрагент или реквизит контактное лицо
		Если Основание.Ссылка.ВидКонтрагента = Перечисления.ВидыКонтрагентов.КонтактноеЛицо Тогда
			КонтактноеЛицо = Основание.Ссылка;
		Иначе
			Контрагент	= Основание.Ссылка;
			СторонниеЛицаСтрока = СторонниеЛица.Добавить();
			СторонниеЛицаСтрока.Контрагент = Основание.Ссылка;
		КонецЕсли;
		//найдем основной номер телефона
		ТекстЗапроса = "ВЫБРАТЬ
		               |	КонтактнаяИнформация.Представление
		               |ИЗ
		               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		               |ГДЕ
		               |	КонтактнаяИнформация.Объект.Ссылка = &Контрагент
		               |	И КонтактнаяИнформация.ЗначениеПоУмолчанию = &Истина
		               |	И КонтактнаяИнформация.Тип = &ТипКИ";
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Контрагент",Основание.Ссылка);
		Запрос.УстановитьПараметр("Истина",Истина);
		Запрос.УстановитьПараметр("ТипКИ",Перечисления.ТипыКонтактнойИнформации.Телефон);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		КонтактнаяИнформация = "";
		Пока Выборка.Следующий() Цикл
			КонтактнаяИнформация = Выборка.представление;
			Прервать;
		КонецЦикла;
		Если НЕ Основание.Ссылка.ВидКонтрагента = Перечисления.ВидыКонтрагентов.КонтактноеЛицо Тогда
			СторонниеЛицаСтрока.ВладелецКИ = Основание.Ссылка;
			СторонниеЛицаСтрока.КонтактнаяИнформация = КонтактнаяИнформация;
			СторонниеЛицаСтрока.ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Телефон;
		КонецЕсли;
		
		Если Пользователи.Количество() = 0 Тогда
			СтрокаПользователь = Пользователи.Добавить();
			СтрокаПользователь.Пользователь = ПараметрыСеанса.Пользователь;
		КонецЕсли;
		
		//не требуется вызов дкОбработкаЗаполнения()
		Возврат;
		
	КонецЕсли;
	
	Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗначенияОснование=Тип("ДокументСсылка.Событие") Тогда 	
		ВидСобытия = Основание.ВидСобытия;
		Приоритет = Основание.Приоритет;
		Состояние = Основание.Состояние;
		ФорматТекста = Основание.ФорматТекста;
		ДокументОснование = Основание.Ссылка;
		СторонниеЛица.Загрузить(Основание.СторонниеЛица.Выгрузить());
		Пользователи.Загрузить(Основание.Пользователи.Выгрузить());
		ПереносСтроки = ?(Основание.ФорматТекста = Перечисления.ФорматТекста.HTML,"<BR>",Символы.ПС);
		Содержание = ПереносСтроки + "---------- Исходное событие ----------" + ПереносСтроки;
		Содержание = Содержание + "Дата: " + Основание.Дата + ПереносСтроки;
	 	Содержание = Содержание + "Тема: " + Основание.Тема + ПереносСтроки + ПереносСтроки;
		ТелоHTML = обПолучитьТелоHTML(Основание.Содержание);
		Если НЕ ПустаяСтрока(ТелоHTML) Тогда
			Содержание = Содержание + ТелоHTML;	
		КонецЕсли;	
		Результат = ПереносСтроки +  "------- Достигнутые результаты -------" + ПереносСтроки;
		
		ТелоHTML = обПолучитьТелоHTML(Основание.Результат);
		Если НЕ ПустаяСтрока(ТелоHTML) Тогда
			Результат = Результат + ТелоHTML;
		КонецЕсли;	
		Тема = Основание.Тема;			
		ТипСообщения = ?(Основание.ТипСообщения = Перечисления.ТипыСообщений.Входящее,Перечисления.ТипыСообщений.Исходящее, Перечисления.ТипыСообщений.Входящее);
		
	ИначеЕсли ТипЗначенияОснование=Тип("ДокументСсылка.ЭлектронноеПисьмо") Тогда
		Тема = Основание.Тема;
		Если Основание.СтатусПисьма = Перечисления.СтатусыСообщений.Входящее Тогда
			ТипСообщения = Перечисления.ТипыСообщений.Входящее;
		Иначе
			ТипСообщения = Перечисления.ТипыСообщений.Исходящее;
		КонецЕсли;
		ВидСобытия = Перечисления.ВидыСобытий.ЭлектронноеПисьмо;				
		ФорматТекста = Основание.ФорматТекста;
		Содержание = Основание.ТекстПисьма;				
		Результат = "";
		
	ИначеЕсли ТипЗначенияОснование=Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда	
		
		Если Основание.ХозОперация=Справочники.ХозОперации.ЗаказНаАвтомобильИзменение Тогда
			ВидСобытия	= Перечисления.ВидыСобытий.ЗаменаАвтомобиля;
			
		ИначеЕсли Основание.ХозОперация=Справочники.ХозОперации.ЗаказНаАвтомобильПереуступка Тогда
			ВидСобытия	= Перечисления.ВидыСобытий.ПереуступкаАвтомобиля;
			
		ИначеЕсли Основание.ХозОперация=Справочники.ХозОперации.ЗаказНаАвтомобильОтмена Тогда
			ВидСобытия	= Перечисления.ВидыСобытий.ОтказОтАвтомобиля;
			
		Иначе
			ВидСобытия	= Перечисления.ВидыСобытий.ВыдачаАвтомобиля;	
		КонецЕсли;	
		ТипСообщения	= Перечисления.ТипыСообщений.Исходящее;	
        Тема			= Строка(Основание);		
		//ДатаНачала		= ТекущаяДата();
		//ОбработкаРеквизита("ДатаНачала");
				
		КонтрагентОснования = Основание.Заказчик;		
		Если (КонтрагентОснования<>Неопределено) И (ТипЗнч(КонтрагентОснования)=Тип("СправочникСсылка.Контрагенты")) Тогда 			
			Если СторонниеЛица.Найти(КонтрагентОснования, "Контрагент")=Неопределено Тогда
				НоваяСтрока				= СторонниеЛица.Добавить();
				НоваяСтрока.Контрагент	= КонтрагентОснования;
				Контрагент				= КонтрагентОснования;
			КонецЕсли; 				
		КонецЕсли;
		
		МестоВыдачиАвтомобиля	= Перечисления.МестаВыдачиАвтомобилей.Салон;
		
		ЗаказНаАвтомобиль	= Основание;
		ОбработкаРеквизита("ЗаказНаАвтомобиль");
		
		АвторВыдачиАвтомобиля	= Основание.Автор;
		ОбработкаРеквизита("АвторВыдачиАвтомобиля");
		
		Если обЗначениеНеЗаполнено(Автомобили) Тогда
			Автомобиль	= Основание.Автомобиль;
			ОбработкаРеквизита("Автомобиль");
		КонецЕсли;
		
	ИначеЕсли ТипЗначенияОснование=Тип("ДокументСсылка.РабочийЛист") ИЛИ
		ТипЗначенияОснование=Тип("ДокументСсылка.РабочийЛистКредитногоОтдела") ИЛИ
		ТипЗначенияОснование=Тип("ДокументСсылка.РабочийЛистОтделаСтрахования") Тогда

		ВидСобытия			= Перечисления.ВидыСобытий.ТелефонныйЗвонок;	
		ТипСообщения		= Перечисления.ТипыСообщений.Исходящее;	
		Тема				= Строка(Основание);		
		
		Если обЗначениеНеЗаполнено(ДатаНачала) Тогда
			ДатаНачала		= ТекущаяДата();
			ОбработкаРеквизита("ДатаНачала");
			ДатаОкончания	= ДатаНачала+600;
		КонецЕсли;			
		
		// Попытаемся определить контрагента.
		Контрагент	= Неопределено;
		Если ТипЗначенияОснование=Тип("ДокументСсылка.РабочийЛист") Тогда
			Контрагент			= Основание.Контрагент;
			Автомобиль			= Основание.Автомобиль;
			Продавец			= Основание.Менеджер;
			ИсточникИнформации 	= Основание.Реклама;
			
		ИначеЕсли ТипЗначенияОснование=Тип("ДокументСсылка.РабочийЛистКредитногоОтдела") Тогда
			Контрагент	= Основание.Клиент;
			Продавец	= Основание.МенеджерКредитногоОтдела;
			
		ИначеЕсли ТипЗначенияОснование=Тип("ДокументСсылка.РабочийЛистОтделаСтрахования") Тогда
			Контрагент	= Основание.Страхователь;
			Продавец	= Основание.МенеджерОтделаСтрахования;
		КонецЕсли;
		
		Если (Контрагент<>Неопределено) И (ТипЗнч(Контрагент)=Тип("СправочникСсылка.Контрагенты")) Тогда 			
			Если СторонниеЛица.Найти(КонтрагентОснования, "Контрагент")=Неопределено Тогда
				НоваяСтрока				= СторонниеЛица.Добавить();
				НоваяСтрока.Контрагент	= Контрагент;
			КонецЕсли; 				
		КонецЕсли;
		
	// + КМ
	ИначеЕсли ТипЗначенияОснование=Тип("ДокументСсылка.РабочийЛистСервиса") Тогда

		ВидСобытия		= Перечисления.ВидыСобытий.ТелефонныйЗвонок;
		ТипСообщения	= Перечисления.ТипыСообщений.Исходящее;	
		Тема			= Строка(Основание);
		Содержание		= Основание.КонтактнаяИнформацияПроактивногоКонтакта;
		Результат		= Строка(Основание.РезультатКонтакта);
		
		Если обЗначениеНеЗаполнено(ДатаНачала) Тогда
			ДатаНачала		= ТекущаяДата();
			ОбработкаРеквизита("ДатаНачала");
			ДатаОкончания	= ДатаНачала+600;
		КонецЕсли;			
		
		Контрагент	= Основание.Контрагент;
		Автомобиль	= Основание.Автомобиль;
		Продавец	= Основание.Менеджер;
				
		Если (Контрагент<>Неопределено) И (ТипЗнч(Контрагент)=Тип("СправочникСсылка.Контрагенты")) Тогда 			
			Если СторонниеЛица.Найти(КонтрагентОснования, "Контрагент")=Неопределено Тогда
				НоваяСтрока				= СторонниеЛица.Добавить();
				НоваяСтрока.Контрагент	= Контрагент;
			КонецЕсли; 				
		КонецЕсли;
	// - КМ
		
	Иначе // Все остальные документы.
		Если ВидСобытия.Пустая() Тогда
			ВидСобытия = Перечисления.ВидыСобытий.ТелефонныйЗвонок;	
		КонецЕсли;
		
		Если ТипСообщения.Пустая() Тогда
			ТипСообщения = Перечисления.ТипыСообщений.Исходящее;	
		КонецЕсли;
		
		//Если обЗначениеНеЗаполнено(ДатаНачала) Тогда
		//	ДатаНачала = ТекущаяДата();
		//	ОбработкаРеквизита("ДатаНачала");
		//КонецЕсли;
		
		Если ПустаяСтрока(Тема) Тогда
			Тема = Строка(Основание);	
		КонецЕсли;
		
		// Попытаемся определить контрагента.
		КонтрагентОснования = Неопределено;
		Попытка
			КонтрагентОснования = Основание.Заказчик;
		Исключение
			Попытка
				КонтрагентОснования = Основание.Контрагент;
			Исключение
				Попытка
					КонтрагентОснования = Основание.ВладелецТовара;
				Исключение
				КонецПопытки;
			КонецПопытки;
		КонецПопытки;
		
		Если (КонтрагентОснования<>Неопределено) И (ТипЗнч(КонтрагентОснования)=Тип("СправочникСсылка.Контрагенты")) Тогда 			
			Если СторонниеЛица.Найти(КонтрагентОснования, "Контрагент")=Неопределено Тогда
				НоваяСтрока				= СторонниеЛица.Добавить();
				НоваяСтрока.Контрагент	= КонтрагентОснования;
				Контрагент				= КонтрагентОснования;
			КонецЕсли; 				
		КонецЕсли;
		
		//Бондаренко++ 20180713
		Если ТипЗначенияОснование=Тип("ДокументСсылка.ЗаказНаряд") Тогда
			Если Основание.ВидРемонта = Справочники.ВидыРемонта.КузовнойРемонт Тогда
				ВидСобытия = Перечисления.ВидыСобытий.Тендер;	
 			КонецЕсли; 
		КонецЕсли; 
		//Бондаренко-- 20180713
		
	КонецЕсли;
	
	//Свернем ТЧ товаров, т.к. в документе-основании могут быть дубли строк
	Товары.Свернуть("Номенклатура,ЕдиницаИзмерения,Коэффициент,ХарактеристикаНоменклатуры","Количество");
	
	Если НЕ ВводИзАРМРесепшен И Пользователи.Количество() = 0 Тогда
		СтрокаПользователь = Пользователи.Добавить();
		СтрокаПользователь.Пользователь = ПараметрыСеанса.Пользователь;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриКопировании()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//Бондаренко++ 20240314
	Если Не обЗначениеНеЗаполнено(ПодразделениеКомпании) Тогда
		Если Не обЗначениеНеЗаполнено(Организация) Тогда
			Если Организация <> ПодразделениеКомпании.Организация Тогда	
				Организация = ПодразделениеКомпании.Организация;
				Комментарий = СокрЛП(Комментарий)+" / "+СокрЛП(Организация)+" / "+СокрЛП(Номер);
				Попытка
				   УстановитьНовыйНомер("");
 				Исключение
 				КонецПопытки;
 		    КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ОбПраво("НеКорректироватьЛишнееПриЗаписиРЛилиСобытия") Тогда
		Возврат;
 	КонецЕсли;
 	//Бондаренко-- 20240314
	
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда Возврат; КонецЕсли;
	
	СМГ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	
	//Бондаренко++ 20240314
 	Если ОбПраво("НеКорректироватьЛишнееПриЗаписиРЛилиСобытия") Тогда
		Возврат;
 	КонецЕсли;
 	//Бондаренко-- 20240314
	
	Если НЕ Отказ Тогда
		Если НЕ орЖурналСостояний(Ссылка,Состояние) Тогда
			Отказ=Истина;
			дкУстановитьЗначениеДополнительногоСвойства(ЭтотОбъект,Отказ);
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	
	Если РегистрацияЗвонковИКонтактов <> Неопределено И РегистрацияЗвонковИКонтактов.Имя = "РегистрацияЗвонковИКонтактов" Тогда
		НаборЗаписей = РегистрыСведений.РегистрацияЗвонковИКонтактов.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Автор.Установить(РегистрацияЗвонковИКонтактов.Автор);
		НаборЗаписей.Отбор.ДатаДень.Установить(РегистрацияЗвонковИКонтактов.ДатаДень); 
		НаборЗаписей.Отбор.ДатаВремя.Установить(РегистрацияЗвонковИКонтактов.ДатаВремя); 
		НаборЗаписей.Отбор.Сотрудник.Установить(РегистрацияЗвонковИКонтактов.Сотрудник);
		НаборЗаписей.Прочитать();
		//Бондаренко++ 20190716
		Если НаборЗаписей.Количество()>0 Тогда
		//Бондаренко-- 20190716	
			НаборЗаписей[0].ДокументСобытие = Ссылка;
			НаборЗаписей.Записать();
		//Бондаренко++ 20190716	
		КонецЕсли; 
	    //Бондаренко-- 20190716
 	КонецЕсли;
	
	#Если Клиент Тогда
		Оповестить("ДокументСобытиеПриЗаписи", ЭтотОбъект,);
	#КонецЕсли
	
	///////// Эта проверка должна быть последней!
	// Семенихин 24.05.2021 +++++
	Если Не Отказ Тогда
		СМГ_ПриЗаписи(Отказ);
	КонецЕсли;	
	// Семенихин 24.05.2021 -----
КонецПроцедуры // ПриЗаписи()

Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Бондаренко++ 20240314
 	Если ОбПраво("НеКорректироватьЛишнееПриЗаписиРЛилиСобытия") Тогда
		Возврат;
 	КонецЕсли;
 	//Бондаренко-- 20240314
 	
	// Заполним График работы ресурсов
	
	// Очистим регистр
	НаборЗаписейГрафикРаботыРесурсов = РегистрыСведений.ГрафикРаботыРесурсов.СоздатьНаборЗаписей();
	НаборЗаписейГрафикРаботыРесурсов.ДокументОбъект = ЭтотОбъект;
	НаборЗаписейГрафикРаботыРесурсов.ОтменаПроведения();
	
	НаборЗаписей = Новый ТаблицаЗначений;
	НаборЗаписей.Колонки.Добавить("Ресурс1");
	НаборЗаписей.Колонки.Добавить("Ресурс2");
	НаборЗаписей.Колонки.Добавить("Объект");
	НаборЗаписей.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата",, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	НаборЗаписей.Колонки.Добавить("НачалоРабочегоВремени", Новый ОписаниеТипов("Дата",, Новый КвалификаторыДаты(ЧастиДаты.Время)));
	НаборЗаписей.Колонки.Добавить("КонецРабочегоВремени", Новый ОписаниеТипов("Дата",, Новый КвалификаторыДаты(ЧастиДаты.Время)));
	НаборЗаписей.Колонки.Добавить("Продолжительность", Новый ОписаниеТипов("Дата",, Новый КвалификаторыДаты(ЧастиДаты.Время)));
	НаборЗаписей.Колонки.Добавить("КоличествоНатуральныхЕдиниц", Новый ОписаниеТипов("Число"));
	НаборЗаписей.Колонки.Добавить("НапомнитьЗа", Новый ОписаниеТипов("Дата",, Новый КвалификаторыДаты(ЧастиДаты.Время)));
	
	// SHMI ++
	НаборЗаписей.Колонки.Добавить("Авторабота");
	// SHMI --
	
	// Перебираем пользователей
	Для Каждого СтрокаПользователи Из Пользователи Цикл
		Если НЕ обЗначениеНеЗаполнено(ДатаОкончания) Тогда
			Если НачалоДня(ДатаОкончания) - НачалоДня(ДатаНачала) = 0 Тогда
				// Начало окончание в одном дне
				СтрокаГрафикаРаботыРесурсов = НаборЗаписей.Добавить();
				СтрокаГрафикаРаботыРесурсов.Ресурс1 = СтрокаПользователи.Пользователь;
				СтрокаГрафикаРаботыРесурсов.Объект = Ссылка;
				СтрокаГрафикаРаботыРесурсов.Дата = НачалоДня(ДатаНачала);
				СтрокаГрафикаРаботыРесурсов.НачалоРабочегоВремени = '00010101' + (ДатаНачала - НачалоДня(ДатаНачала));
				СтрокаГрафикаРаботыРесурсов.КонецРабочегоВремени = '00010101' + (ДатаОкончания - НачалоДня(ДатаОкончания));
				СтрокаГрафикаРаботыРесурсов.Продолжительность = '00010101' + (СтрокаГрафикаРаботыРесурсов.КонецРабочегоВремени - СтрокаГрафикаРаботыРесурсов.НачалоРабочегоВремени);
			Иначе
				Разница = (НачалоДня(ДатаОкончания) - НачалоДня(ДатаНачала)) / 60 / 60 / 24;
				ТекущийДень = НачалоДня(ДатаНачала);
				Пока Разница >= 0 Цикл
					СтрокаГрафикаРаботыРесурсов = НаборЗаписей.Добавить();
					СтрокаГрафикаРаботыРесурсов.Ресурс1 = СтрокаПользователи.Пользователь;
					СтрокаГрафикаРаботыРесурсов.Объект = Ссылка;
					СтрокаГрафикаРаботыРесурсов.Дата = ТекущийДень;					
					
					// Установим НачалоРабочегоВремени 
					Если ТекущийДень = НачалоДня(ДатаНачала) Тогда
						СтрокаГрафикаРаботыРесурсов.НачалоРабочегоВремени = '00010101' + (ДатаНачала - НачалоДня(ДатаНачала));
					Иначе
						СтрокаГрафикаРаботыРесурсов.НачалоРабочегоВремени = '00010101';
					КонецЕсли;
					
					// Установим КонецРабочегоВремени
					Если ТекущийДень = НачалоДня(ДатаОкончания) Тогда
						СтрокаГрафикаРаботыРесурсов.КонецРабочегоВремени = '00010101' + (ДатаОкончания - НачалоДня(ДатаОкончания));
					Иначе
						СтрокаГрафикаРаботыРесурсов.КонецРабочегоВремени = '00010101235959';
					КонецЕсли;
					
					// Посчитаем Продолжительность
					СтрокаГрафикаРаботыРесурсов.Продолжительность = '00010101' + (СтрокаГрафикаРаботыРесурсов.КонецРабочегоВремени - СтрокаГрафикаРаботыРесурсов.НачалоРабочегоВремени);
					ТекущийДень = ТекущийДень + 1*60*60*24;
					Разница = Разница - 1;
				КонецЦикла;
			КонецЕсли;
		Иначе
			// Дата окончания не заполнена
			СтрокаГрафикаРаботыРесурсов = НаборЗаписей.Добавить();
			СтрокаГрафикаРаботыРесурсов.Ресурс1 = СтрокаПользователи.Пользователь;
			СтрокаГрафикаРаботыРесурсов.Объект = Ссылка;
			СтрокаГрафикаРаботыРесурсов.Дата = НачалоДня(ДатаНачала);
			СтрокаГрафикаРаботыРесурсов.НачалоРабочегоВремени = '00010101' + (ДатаНачала - НачалоДня(ДатаНачала));
			СтрокаГрафикаРаботыРесурсов.КонецРабочегоВремени  = СтрокаГрафикаРаботыРесурсов.НачалоРабочегоВремени;
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписейГрафикРаботыРесурсов.НаборЗаписей = НаборЗаписей;
	НаборЗаписейГрафикРаботыРесурсов.Проведение();
КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)
	// Очистим регистр ГрафикРаботыРесурсов
	НаборЗаписейГрафикРаботыРесурсов = РегистрыСведений.ГрафикРаботыРесурсов.СоздатьНаборЗаписей();
	НаборЗаписейГрафикРаботыРесурсов.ДокументОбъект = ЭтотОбъект;
	НаборЗаписейГрафикРаботыРесурсов.ОтменаПроведения();
	
		//Гэндальф+++
	Если ВидСобытия = Перечисления.ВидыСобытий.ВыдачаАвтомобиля и Состояние = Перечисления.СостоянияСобытий.Завершено тогда
		ЗаписатьВыдачуВРЛ(Ложь);		
	КонецЕсли;	
		//Гэндальф---
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Процедура выбора и открытия нужного оповещения. 
// Или для создания нового, если выбран пункт меню "создать"
//
// Параметры:
//	Объект			- Объект	- Объект для которого выбирается/создается напоминание
//	ДопПараметры	- Структура	- Структура, для создания нового напоминания
//								  (см. описание реквизита в функции опСоздатьОповещение)
//	Форма			- Форма		- Форма объекта
//	Элемент			- Элемент	- Элемент формы, рядом с которым выводится меню выбора из списка
//
Процедура АвтоВыборОповещения(Объект, ДопПараметры) Экспорт
#Если Клиент тогда
	Перем СписокОповещений; // Список оповещений
	СписокОповещений = Новый СписокЗначений;
	Если НЕ Объект.Ссылка.Пустая() тогда
		Запрос = Новый Запрос;
		Запрос.Текст = " 
		|ВЫБРАТЬ
		|	Напоминания.Пользователь,
		|	Напоминания.Автор,
		|	Напоминания.Завершено,
		|	Напоминания.РеальнаяДатаОповещения КАК РеальнаяДатаОповещения,
		|	Напоминания.Объект,
		|	Напоминания.ДатаОповещения,
		|	Напоминания.Тема
		|ИЗ
		|	РегистрСведений.Напоминания КАК Напоминания
		|ГДЕ
		|	Напоминания.Объект = &Объект
		|	И (НЕ Напоминания.Завершено)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеальнаяДатаОповещения
		|";
		Запрос.УстановитьПараметр("Объект", Объект);
		ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
		Для каждого стр Из ТаблицаРезультата Цикл
			текОповещение = Новый Структура;
			КолВо =  ТаблицаРезультата.Колонки.Количество()-1;
			//Для поле=0 по КолВо Цикл
			//	текОповещение.Вставить(ТаблицаРезультата.Колонки[поле].Имя,Стр[поле]);
			//КонецЦикла;
			Флаг = Истина;
			итератор = 0;
			Пока Флаг цикл
				Если итератор > КолВо тогда
					Прервать;
				КонецЕсли;
				текОповещение.Вставить(ТаблицаРезультата.Колонки[итератор].Имя,Стр[итератор]);
               итератор = итератор +1;
			КонецЦикла;	
			текДата = Формат(текОповещение.РеальнаяДатаОповещения, "ДЛФ=D");
			текЗаголовок = текДата+" "+СокрЛП(текОповещение.Тема);
			Если НЕ обЗначениеНЕЗаполнено(текОповещение.Пользователь) Тогда
				текЗаголовок = текЗаголовок + " (Получатель: " + текОповещение.Пользователь.Наименование + ")";
			КонецЕсли;
			СписокОповещений.Добавить(текОповещение, текЗаголовок,,БиблиотекаКартинок.ОповещениеИзменить);

		КонецЦикла;
	КонецЕсли;
	
	СписокОповещений.Добавить(Неопределено, "Создать новое напоминание",,БиблиотекаКартинок.Оповещение);
	
	текДействие = "Создать";
	текДанные = ДопПараметры;
	
	Если СписокОповещений.Количество() > 1 Тогда // иначе нужно создать новое
		//РезВыбора = Форма.ВыбратьИзМеню(СписокОповещений, Элемент);
		//Если РезВыбора = Неопределено Тогда
		//	возврат;
		//ИначеЕсли РезВыбора.Значение <> Неопределено тогда // выбран НЕ пункт "создать"
		//	текДействие = "Изменить";
		//	текДанные = РезВыбора.Значение;
		//КонецЕсли;
		//Для Каждого стр из СписокОповещений цикл
		//	стр.
		//	
		//КонецЦикла;	
		Возврат;
	КонецЕсли;
	
	Если текДействие = "Создать" Тогда		
		Если ДопПараметры.Свойство("СписокПользователей") Тогда
			//Если Вопрос("Создать напоминание для всех пользователей?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
				текДанные.Удалить("СписокПользователей");
			//КонецЕсли;
		КонецЕсли;
		АвтоСоздатьОповещение(Объект, текДанные);
	ИначеЕсли текДействие = "Изменить" Тогда
		опОткрытьОповещение(Объект, текДанные);
	КонецЕсли;
#КонецЕсли
КонецПроцедуры // опВыборОповещения()

Процедура АвтоСоздатьОповещение(Объект=Неопределено, ДопПараметры=Неопределено, Форма=Неопределено) Экспорт
#Если Клиент тогда
	ЭтоНовыйОбъект = Ложь;
	Попытка ЭтоНовыйОбъект = Форма.ЭтотОбъект.ЭтоНовый(); Исключение КонецПопытки;
	Если ЭтоНовыйОбъект Тогда
		Ответ = Вопрос("Объект еще не записан, создание для него нового напоминания не возможно.
						|Записать объект?", РежимДиалогаВопрос.ДаНет);
		Отказ = Истина;
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Попытка Отказ = НЕ Форма.ЗаписатьВФорме(); Исключение КонецПопытки;
		КонецЕсли;
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.Напоминания.СоздатьМенеджерЗаписи();
	//МенеджерЗаписи.СрокДоНачала = ПлановаяДатаВыдачи-2400;
	Если Объект <> Неопределено Тогда		
		МенеджерЗаписи.Объект = Объект;
	КонецЕсли;
	Если ТипЗнч(ДопПараметры) = Тип("Структура") Тогда
		МетаИзмерения = Метаданные.РегистрыСведений.Напоминания.Измерения;
		МетаРесурсы = Метаданные.РегистрыСведений.Напоминания.Ресурсы;
		Для Каждого Параметр Из ДопПараметры Цикл
			МетаОбъект = МетаИзмерения.Найти(Параметр.Ключ);
			Если (МетаОбъект<>Неопределено) тогда
				МенеджерЗаписи[МетаОбъект.Имя] = Параметр.Значение;
			Иначе
				МетаОбъект = МетаРесурсы.Найти(Параметр.Ключ);
				Если (МетаОбъект<>Неопределено) тогда
					МенеджерЗаписи[МетаОбъект.Имя] = Параметр.Значение;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если обЗначениеНеЗаполнено(МенеджерЗаписи.ДатаНачала) Тогда
			МенеджерЗаписи.ДатаНачала = ТекущаяДата();
		КонецЕсли;
		Если обЗначениеНеЗаполнено(МенеджерЗаписи.ДатаОповещения) Тогда
			МенеджерЗаписи.ДатаОповещения =ДатаНачала-1800;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(МенеджерЗаписи.РеальнаяДатаОповещения) Тогда
			МенеджерЗаписи.РеальнаяДатаОповещения = Макс(ТекущаяДата(), МенеджерЗаписи.ДатаОповещения - МенеджерЗаписи.СрокДоНачала);
		КонецЕсли;
			//МенеджерЗаписи.ВидНапоминания = Перечисления.ВидыНапоминаний.Выдача;
			МенеджерЗаписи.УдалитьПоИстеченииСрока = Истина;
		текФорма = МенеджерЗаписи.ПолучитьФорму();
		// занесем список переданных пользователей
		//ДопПараметры.Свойство("СписокПользователей", текФорма.Пользователи); 
		//текФорма.Открыть();
		МенеджерЗаписи.Записать();
	Иначе	
		текФорма = МенеджерЗаписи.ПолучитьФорму();
		текФорма.Открыть();
	КонецЕсли;
#КонецЕсли
КонецПроцедуры // опСоздатьОповещение()

Функция ЗаписатьВыдачуВРЛ (Флаг) Экспорт 
	Если Флаг тогда
		Если ТипЗнч(ДокументОснование.Ссылка) = Тип("ДокументСсылка.РабочийЛист") тогда
			Если   ДокументОснование.Ссылка.Статус = Справочники.СтатусыРабочегоЛиста.Продажа и Состояние = Перечисления.СостоянияСобытий.Завершено тогда
				Объект = ДокументОснование.Ссылка.ПолучитьОбъект();
				Объект.Автомобиль = Автомобиль;
				Объект.ОбработкаРеквизита("Автомобиль");
				Объект.МашинаВыдана = Истина;
				Попытка
					Объект.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					Возврат Ложь;
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;

	Иначе
	  	Если ТипЗнч(ДокументОснование.Ссылка) = Тип("ДокументСсылка.РабочийЛист") тогда
			Объект = ДокументОснование.Ссылка.ПолучитьОбъект();
			Объект.МашинаВыдана = Ложь;
			Попытка
				Объект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Возврат Ложь;
			КонецПопытки;	
		КонецЕсли;
	КонецЕсли;
    Возврат Истина;
КонецФункции

Функция  ЗаполнитьНапоминаниеиСоздатьНопоминание(ДатаНапоминания,Пользаватель) Экспорт 
		Данные = Новый Структура;
		Данные.Вставить("Пользователь", Пользаватель);
		Данные.Вставить("Автор",Пользаватель );
		Данные.Вставить("Объект", ЭтотОбъект.Ссылка);
		Данные.Вставить("Завершено", Ложь);
		Данные.Вставить("ДатаНачала", ДатаНапоминания-900);
		Данные.Вставить("ТипПериода","00");
		//Данные.Вставить("СрокДоНачала", 0*86400);
		Данные.Вставить("Тема", "Напомнить о событие "+Контрагент);
		//формируем текст напоминания
		Стр = "Вид события: " + " напоминание клиенту" + "." + Символы.ПС + Символы.ПС + Контрагент + ", " + Автомобиль;
		Данные.Вставить("Описание", Стр);
		
		СписокПользователей = Новый СписокЗначений;
		СписокПользователей.Добавить(ПараметрыСеанса.Пользователь);
		Данные.Вставить("СписокПользователей", СписокПользователей);

		
		Возврат Данные;
КонецФункции	
	
Процедура ОбновитьРЛ()  Экспорт 
	Попытка
		Если ТипЗнч(ДокументОснование.Ссылка) = Тип("ДокументСсылка.РабочийЛист") тогда
			Объект = ДокументОснование.Ссылка.ПолучитьОбъект() ;
			Объект.ДатаИзменения = ТекущаяДата();
			Если ВидСобытия = Перечисления.ВидыСобытий.ТестДрайв и Состояние = Перечисления.СостоянияСобытий.Завершено тогда
				Объект.ТестДрайв = Истина;
			КонецЕсли;	
			Попытка
				Объект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				
			КонецПопытки;	
			НоваяЗапись = РегистрыСведений.ИсторияСостоянияРабочегоЛиста.СоздатьМенеджерЗаписи();
			НоваяЗапись.Период = ТекущаяДата();
			НоваяЗапись.РабочийЛист = ДокументОснование.Ссылка;
			НоваяЗапись.Статус = ДокументОснование.Статус;
			НоваяЗапись.Документ = Ссылка;
			НоваяЗапись.Значение = Содержание;
			
			НоваяЗапись.Записать(Истина);
			
		КонецЕсли;	
	Исключение
	КонецПопытки;
КонецПроцедуры	

Процедура СоздатьСобытияВежливости() Экспорт 
	
	Попытка
				
		Если ТипЗнч(ДокументОснование.Ссылка) = Тип("ДокументСсылка.РабочийЛист") И ДокументОснование.Ссылка.Статус = Справочники.СтатусыРабочегоЛиста.Продажа Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	НастройкиЗвонковВежливости.Анкета1День,
			               |	НастройкиЗвонковВежливости.Анкета3Дня,
			               |	НастройкиЗвонковВежливости.Анкета10Дней,
			               |	НастройкиЗвонковВежливости.Анкета1Месяц,
			               |	НастройкиЗвонковВежливости.Анкета3Месяца,
			               |	НастройкиЗвонковВежливости.Анкета6Месяцев,
			               |	НастройкиЗвонковВежливости.Анкета9Месяцев,
			               |	НастройкиЗвонковВежливости.Анкета1Год,
			               |	НастройкиЗвонковВежливости.Анкета15Месяцев,
			               |	НастройкиЗвонковВежливости.Анкета18Месяцев,
			               |	НастройкиЗвонковВежливости.Анкета3Года
			               |ИЗ
			               |	РегистрСведений.НастройкиЗвонковВежливости КАК НастройкиЗвонковВежливости
			               |ГДЕ
			               |	НастройкиЗвонковВежливости.Подразделение = &Подразделение";
						   
			Запрос.УстановитьПараметр("Подразделение", ДокументОснование.ПодразделениеКомпании);
						   
			НастройкиЗвонковВежливости = Новый Структура("Анкета1День, Анкета3Дня, Анкета10Дней, Анкета1Месяц, Анкета3Месяца, Анкета6Месяцев, Анкета9Месяцев, Анкета1Год, Анкета15Месяцев, Анкета18Месяцев, Анкета3Года");
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				ЗаполнитьЗначенияСвойств(НастройкиЗвонковВежливости, Выборка);
			КонецЕсли;
			
			МассивПериодовЗвонковВежливости = Новый Массив;
			
			Если ЗначениеЗаполнено(НастройкиЗвонковВежливости.Анкета1День) Тогда		// 1 день
				МассивПериодовЗвонковВежливости.Добавить(86400);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НастройкиЗвонковВежливости.Анкета3Дня) Тогда			// 3 дня
				МассивПериодовЗвонковВежливости.Добавить(259200);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НастройкиЗвонковВежливости.Анкета1Месяц) Тогда		// 1 месяц
				МассивПериодовЗвонковВежливости.Добавить(2592000);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НастройкиЗвонковВежливости.Анкета3Месяца) Тогда		// 3 месяца
				МассивПериодовЗвонковВежливости.Добавить(7776000);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НастройкиЗвонковВежливости.Анкета6Месяцев) Тогда		// 6 месяцев
				МассивПериодовЗвонковВежливости.Добавить(15724800);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НастройкиЗвонковВежливости.Анкета9Месяцев) Тогда		// 9 месяцев
				МассивПериодовЗвонковВежливости.Добавить(23328000);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НастройкиЗвонковВежливости.Анкета1Год) Тогда			// 1 год
				МассивПериодовЗвонковВежливости.Добавить(31536000);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НастройкиЗвонковВежливости.Анкета15Месяцев) Тогда	// 15 месяцев
				МассивПериодовЗвонковВежливости.Добавить(38880000);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НастройкиЗвонковВежливости.Анкета18Месяцев) Тогда	// 18 месяцев
				МассивПериодовЗвонковВежливости.Добавить(46656000);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НастройкиЗвонковВежливости.Анкета3Года) Тогда		// 3 года			
				МассивПериодовЗвонковВежливости.Добавить(94608000);
			КонецЕсли;
						
			Если ВидСобытия = Перечисления.ВидыСобытий.ВыдачаАвтомобиля И Состояние = Перечисления.СостоянияСобытий.Завершено Тогда
				// Первый звонок вежливости
				Если Не ДокументОснование.Ссылка.ЗвонокВежливости Тогда		
				
					Объект = ДокументОснование.Ссылка.ПолучитьОбъект();
					Объект.ЗвонокВежливости = Истина;
					
					РежимОбменДанными = Объект.ОбменДанными.Загрузка;
					
					Объект.ОбменДанными.Загрузка = Истина;
					Объект.Записать(РежимЗаписиДокумента.Запись);
					Объект.ОбменДанными.Загрузка = РежимОбменДанными;
					
					Попытка
						Объект.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
					КонецПопытки;
					
				Иначе
					Возврат;
				КонецЕсли;
				
				ПериодСобытия = МассивПериодовЗвонковВежливости[0];
				 				
			ИначеЕсли (Лев(Содержание, 17) = "Звонок вежливости" Или ВидСобытия = Перечисления.ВидыСобытий.ЗвонокВежливости) И Состояние = Перечисления.СостоянияСобытий.Завершено Тогда				
				// Последующие звонки вежливости
								
				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("Основание", ДокументОснование);
				Запрос.Текст = "ВЫБРАТЬ
				               |	Событие.ДатаНачала
				               |ИЗ
				               |	Документ.Событие КАК Событие
				               |ГДЕ
				               |	Событие.ДокументОснование = &Основание
				               |	И Событие.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ВыдачаАвтомобиля)
				               |	И Событие.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСобытий.Завершено)
				               |	И НЕ Событие.ПометкаУдаления";
							   
				Выборка = Запрос.Выполнить().Выбрать();
				
				Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ДатаНачала) Тогда
					ДатаОснования = Выборка.ДатаНачала;
				Иначе
					Возврат;	// При отсутствии события выдачи автомобиля звонки вежливости не выполняем
				КонецЕсли;
				
				ПериодСобытия = Неопределено;
				
				Для Каждого ПериодЗвонка Из МассивПериодовЗвонковВежливости Цикл
					
					Если КонецДня(ДатаНачала) < ДатаОснования + ПериодЗвонка Тогда
						ПериодСобытия = ПериодЗвонка;
						Прервать;
					КонецЕсли;
											
				КонецЦикла;					
				
				Если ПериодСобытия = Неопределено Тогда			// Отработаны все звонки вежливости
					Возврат;
				КонецЕсли;
				
			КонецЕсли;
					
			// Создание нового события, на основании выбранного рабочего листа
			НовоеСобытие = Документы.Событие.СоздатьДокумент();
			НовоеСобытие.Заполнить(ДокументОснование.Ссылка);
			НовоеСобытие.Содержание 		= "Звонок вежливости";
			НовоеСобытие.ВидСобытия			= Перечисления.ВидыСобытий.ЗвонокВежливости;
			НовоеСобытие.Состояние 			= Перечисления.СостоянияСобытий.Запланировано;
			НовоеСобытие.Приоритет 			= Перечисления.Важность.Высокая;
			НовоеСобытие.ДатаНачала 		= ТекущаяДата() + ПериодСобытия;
			НовоеСобытие.ДатаОкончания 		= ТекущаяДата() + ПериодСобытия + 900;
			НовоеСобытие.Продолжительность 	= 0.25;
			НовоеСобытие.ФорматТекста 		= Перечисления.ФорматТекста.ПростойТекст;
			
			Если ПериодСобытия = 86400 Тогда	// 1 день
				
				НовоеСобытие.Содержание = НовоеСобытие.Содержание + Символы.ПС + "
				|1	Полностью ли Вы довольны покупкой автомобиля?	
				|2	Остались ли у Вас вопросы по органам управления и запуску двигателя?	
				|3	На Вашем автомобиле установлена сигнализация с обратной связью. Все ли Вам понятно по работе охранной сигнализации?	
				|4	Есть ли у Вас вопросы по работе других систем автомобиля?	
				|5	На данный момент у Вас есть какие-либо нерешённые вопросы?	
				|5.1.	Если недоволен: Хотите ли Вы, чтобы диспетчер Сервисного обслуживания позвонил Вам позже и договорился о дате приезда к нам для решения Вашего вопроса?	
				|5.2.	Если клиент не хочет приезжать: Правильно ли я Вас понял, что данный вопрос не настолько актуален, чтобы обращаться сейчас на Сервис? 	
				|6	""Понравился ли Ваш автомобиль родственникам и друзьям ? Есть ли среди них те, кто рассматривают покупку автомобиля? Мы бы  хотели им помочь в выборе. Могу я взять их контактных телефон, чтобы созвониться и заранее запланировать демонстрационную  поездку в удобное для них время?
				|	Если нет, передайте тогда мой телефон, пусть звонит  в удобное для него / них время. ""	
				|7	Хотим напомнить Вам о нулевом  ТО, которое желательно пройти  на 2 000 км пробега автомобиля. Данное ТО является рекомендованным и выполняется по желанию клиента.";
			
			ИначеЕсли ПериодСобытия = 259200 Тогда	// 3 дня
				
				НовоеСобытие.Содержание = НовоеСобытие.Содержание + Символы.ПС + "
				|1	Полностью ли Вы довольны покупкой автомобиля?	
				|2	Остались ли у Вас вопросы по органам управления и запуску двигателя?	
				|3	На Вашем автомобиле установлена сигнализация с обратной связью. Все ли Вам понятно по работе охранной сигнализации?	
				|4	Есть ли у Вас вопросы по работе других систем автомобиля?	
				|5	На данный момент у Вас есть какие-либо нерешённые вопросы?	
				|5.1.	Если недоволен: Хотите ли Вы, чтобы диспетчер Сервисного обслуживания позвонил Вам позже и договорился о дате приезда к нам для решения Вашего вопроса?	
				|5.2.	Если клиент не хочет приезжать: Правильно ли я Вас понял, что данный вопрос не настолько актуален, чтобы обращаться сейчас на Сервис? 	
				|6	""Понравился ли Ваш автомобиль родственникам и друзьям ? Есть ли среди них те, кто рассматривают покупку автомобиля? Мы бы  хотели им помочь в выборе. Могу я взять их контактных телефон, чтобы созвониться и заранее запланировать демонстрационную  поездку в удобное для них время?
				|	Если нет, передайте тогда мой телефон, пусть звонит  в удобное для него / них время. ""	
				|7	Хотим напомнить Вам о нулевом  ТО, которое желательно пройти  на 2 000 км пробега автомобиля. Данное ТО является рекомендованным и выполняется по желанию клиента.";	

			ИначеЕсли ПериодСобытия = 2592000 Тогда	// 1 месяц
				
				НовоеСобытие.Содержание = НовоеСобытие.Содержание + Символы.ПС + "
				|Полностью ли Вы довольны своим автомобилем?				
				|На данный момент у Вас есть какие-либо нерешённые вопросы?				
				|Если недоволен: Хотите ли Вы, чтобы диспетчер Сервисного обслуживания позвонил Вам позже и договорился о дате приезда к нам для решения Вашего вопроса?				
				|Если клиент не хочет приезжать: Правильно ли я Вас понял, что данный вопрос не настолько актуален, чтобы обращаться сейчас на Сервис? 				
				|Какой пробег на вашем автомобиле на сегодняшний день?				
				|Хотим напомнить Вам о нулевом  ТО, которое необходимо пройти  на 2 000 км пробега автомобиля. Данное ТО является обязательным и влияет на сохранение гарантии.				
				|Кроме этого на момент прохождения нулевого ТО хотим предложить приобретение дополнительного оборудования на Ваш автомобиль:...(пороги, защиту, хром пакет, накладки на пороги...)				
				|""На данный момент есть ли среди Ваших знакомых те, кто рассматривают покупку автомобиля? Мы бы  хотели им помочь в выборе. Могу я взять их контактный телефон, чтобы созвониться и заранее запланировать демонстрационную  поездку в удобное для них время?
				|Если нет, передайте тогда мой телефон, пусть звонит  в удобное для него / них время. """;
				
			ИначеЕсли ПериодСобытия = 7776000 Тогда	// 3 месяца
				
				НовоеСобытие.Содержание = НовоеСобытие.Содержание + Символы.ПС + "
				|1	Полностью ли Вы довольны своим автомобилем?	
				|2	На данный момент у Вас есть какие-либо нерешённые вопросы?	
				|2.1.	Если недоволен: Хотите ли Вы, чтобы диспетчер Сервисного обслуживания позвонил Вам позже и договорился о дате приезда к нам для решения Вашего вопроса?	
				|2.2.	Если клиент не хочет приезжать: Правильно ли я Вас понял, что данный вопрос не настолько актуален, чтобы обращаться сейчас на Сервис? 	
				|3	Какой пробег на вашем автомобиле на сегодняшний день?	
				|4	Хотим напомнить Вам о прохождении ТО, которое необходимо  пройти  на 15 000 км пробега автомобиля. 	
				|5	Если хочет пройти  ТО: Хотите ли Вы, чтобы диспетчер Сервисного обслуживания позвонил Вам позже и договорился о дате приезда к нам для прохождения ТО?	
				|6	Рассказать о действующих акциях и новинках в линейке автомобилей Hyundai, предложить совершить Тестовую поездку и т.п.	
				|7	""На данный момент есть ли среди Ваших знакомых те, кто рассматривают покупку автомобиля? Мы бы хотели им помочь в выборе. Могу я взять их контактный телефон, чтобы созвониться и заранее запланировать демонстрационную  поездку в удобное для них время?
				|Если нет, передайте тогда мой телефон, пусть звонит  в удобное для него / них время. """;
				
			КонецЕсли;			
			
			НовоеСобытие.Записать(РежимЗаписиДокумента.Проведение);
			
			Данные = НовоеСобытие.ЗаполнитьНапоминаниеиСоздатьНопоминание(НовоеСобытие.ДатаНачала,Пользователи[0].Пользователь);
			НовоеСобытие.АвтоВыборОповещения(НовоеСобытие.Ссылка, Данные);
			
			ТиповаяАнкета = Неопределено;
			ПринадлежностьОпроса = Перечисления.ПринадлежностьОпроса.ОП;
			СрокЗвонкаВежливостиДляНапоминания = "";
			
			Если ПериодСобытия = 86400 Тогда			// 1 день
				ТиповаяАнкета = НастройкиЗвонковВежливости.Анкета1День;
				СрокЗвонкаВежливостиДляНапоминания = "1 день";
			ИначеЕсли ПериодСобытия = 259200 Тогда		// 1 месяц
				ТиповаяАнкета = НастройкиЗвонковВежливости.Анкета3Дня;
			ИначеЕсли ПериодСобытия = 2592000 Тогда		// 1 месяц
				ТиповаяАнкета = НастройкиЗвонковВежливости.Анкета1Месяц;
				СрокЗвонкаВежливостиДляНапоминания = "1 месяц";
			ИначеЕсли ПериодСобытия = 7776000 Тогда		// 3 месяца
				ТиповаяАнкета = НастройкиЗвонковВежливости.Анкета3Месяца;
				СрокЗвонкаВежливостиДляНапоминания = "3 месяца";
			ИначеЕсли ПериодСобытия = 15552000 Тогда	// 6 месяцев
				ТиповаяАнкета = НастройкиЗвонковВежливости.Анкета6Месяцев;
				СрокЗвонкаВежливостиДляНапоминания = "6 месяцев";
			ИначеЕсли ПериодСобытия = 23328000 Тогда	// 9 месяцев
				ТиповаяАнкета = НастройкиЗвонковВежливости.Анкета9Месяцев;
				СрокЗвонкаВежливостиДляНапоминания = "9 месяцев";
			ИначеЕсли ПериодСобытия = 31536000 Тогда	// 1 год
				ТиповаяАнкета = НастройкиЗвонковВежливости.Анкета1Год;
				СрокЗвонкаВежливостиДляНапоминания = "1 год";
			ИначеЕсли ПериодСобытия = 38880000 Тогда	// 15 месяцев
				ТиповаяАнкета = НастройкиЗвонковВежливости.Анкета15Месяцев;
				СрокЗвонкаВежливостиДляНапоминания = "15 месяцев";
			ИначеЕсли ПериодСобытия = 46656000 Тогда	// 18 месяцев
				ТиповаяАнкета = НастройкиЗвонковВежливости.Анкета18Месяцев;
				СрокЗвонкаВежливостиДляНапоминания = "18 месяцев";
			ИначеЕсли ПериодСобытия = 94608000 Тогда	// 3 года			
				ТиповаяАнкета = НастройкиЗвонковВежливости.Анкета3Года;
				СрокЗвонкаВежливостиДляНапоминания = "3 года";
			КонецЕсли;
					
			МенеджерОпроса = ПодразделениеКомпании.МенеджерОП;
			МенеджерОпроса = ?(ЗначениеЗаполнено(МенеджерОпроса), МенеджерОпроса, Продавец);
					
			Если ЗначениеЗаполнено(ТиповаяАнкета) и Константы.ДилерскийЦентр.Получить() <> Справочники.ДилерскиеЦентры.Дельта Тогда
				НовоеСобытие.Опрос = ПолучитьОпрос(НовоеСобытие.Ссылка, ТиповаяАнкета, НовоеСобытие.ДатаНачала, ПринадлежностьОпроса, МенеджерОпроса);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НовоеСобытие.Опрос) Тогда
				Попытка
					НовоеСобытие.Записать();
				Исключение
				КонецПопытки;
			КонецЕсли;
						
			ПолучательНапоминания = ПолучитьПользователяПоСотруднику(МенеджерОпроса);
			
			Если ЗначениеЗаполнено(ПолучательНапоминания) Тогда
			
				НовоеНапоминание						= РегистрыСведений.Напоминания.СоздатьМенеджерЗаписи();
				
				// заполним измерения
				НовоеНапоминание.Пользователь			= ПолучательНапоминания;
				НовоеНапоминание.Автор					= ПолучательНапоминания;
				НовоеНапоминание.Завершено				= Ложь;
				НовоеНапоминание.РеальнаяДатаОповещения = НовоеСобытие.ДатаНачала;
				НовоеНапоминание.Объект					= НовоеСобытие.Ссылка;
				
				// заполним ресурсы
				НовоеНапоминание.ДатаАктуальности		= '00010101';
				НовоеНапоминание.ДатаНачала				= НовоеСобытие.ДатаНачала;
				НовоеНапоминание.ДатаОповещения			= НовоеСобытие.ДатаНачала;
				НовоеНапоминание.Описание				= "Звонок вежливости (" + СрокЗвонкаВежливостиДляНапоминания + ")" + Символы.ПС + "Клиент " + Строка(НовоеСобытие.Контрагент) + Символы.ПС + "Автомобиль " + Строка(НовоеСобытие.Автомобиль);
				НовоеНапоминание.Редактирование			= Ложь;
				НовоеНапоминание.СрокДоНачала			= 15;
				НовоеНапоминание.Тема					= "Звонок вежливости";
				НовоеНапоминание.ТипПериода				= "00";
				НовоеНапоминание.УдалитьПоИстеченииСрока= Истина;
				
				Попытка
					НовоеНапоминание.Записать(Ложь);
				Исключение КонецПопытки;
				
			КонецЕсли;
			
			// С первым звонком вежливости "1 день" формируем отдельный опрос для звонка "10 дней", но без события
			Если ПериодСобытия = 86400 Тогда
				
				ТиповаяАнкета = НастройкиЗвонковВежливости.Анкета10Дней;	// Звонок 10 дней
				СрокЗвонкаВежливостиДляНапоминания = "10 дней";

				Опрос10Дней = Неопределено;				
				ДатаОпроса10Дней = ТекущаяДата() + 864000;
								
				Если ЗначениеЗаполнено(ТиповаяАнкета) и Константы.ДилерскийЦентр.Получить() <> Справочники.ДилерскиеЦентры.Дельта Тогда
					Опрос10Дней = ПолучитьОпрос(НовоеСобытие.Ссылка, ТиповаяАнкета, ДатаОпроса10Дней, ПринадлежностьОпроса, Справочники.Сотрудники.КлиентскаяСлужба);
				КонецЕсли;
				
				ПолучательНапоминания = ПолучитьПользователяПоСотруднику(МенеджерОпроса);
				
				//Если ЗначениеЗаполнено(ПолучательНапоминания) И ЗначениеЗаполнено(Опрос10Дней) Тогда
				//	
				//	НовоеНапоминание						= РегистрыСведений.Напоминания.СоздатьМенеджерЗаписи();
				//	
				//	// заполним измерения
				//	НовоеНапоминание.Пользователь			= ПолучательНапоминания;
				//	НовоеНапоминание.Автор					= ПолучательНапоминания;
				//	НовоеНапоминание.Завершено				= Ложь;
				//	НовоеНапоминание.РеальнаяДатаОповещения = ДатаОпроса10Дней;
				//	НовоеНапоминание.Объект					= Опрос10Дней;
				//	
				//	// заполним ресурсы
				//	НовоеНапоминание.ДатаАктуальности		= '00010101';
				//	НовоеНапоминание.ДатаНачала				= ДатаОпроса10Дней;
				//	НовоеНапоминание.ДатаОповещения			= ДатаОпроса10Дней;
				//	НовоеНапоминание.Описание				= "Звоно вежливости (" + СрокЗвонкаВежливостиДляНапоминания + ")" + Символы.ПС + "Клиент " + Строка(НовоеСобытие.Контрагент) + Символы.ПС + "Автомобиль " + Строка(НовоеСобытие.Автомобиль);
				//	НовоеНапоминание.Редактирование			= Ложь;
				//	НовоеНапоминание.СрокДоНачала			= 15;
				//	НовоеНапоминание.Тема					= "Звонок вежливости";
				//	НовоеНапоминание.ТипПериода				= "00";
				//	НовоеНапоминание.УдалитьПоИстеченииСрока= Истина;
				//	
				//	Попытка
				//		НовоеНапоминание.Записать(Ложь);
				//	Исключение КонецПопытки;
				//	
				//КонецЕсли;
				
			КонецЕсли;			
			
		КонецЕсли;
		
	Исключение
	КонецПопытки;
	
КонецПроцедуры

// + КМ
Функция ПолучитьОпрос(Основание, ТиповаяАнкета, ДатаОпроса, ПринадлежностьОпроса = Неопределено, МенеджерОпроса) Экспорт 				
	ДокументОпрос = Документы.Опрос.СоздатьДокумент();
	ДокументОпрос.Заполнить(Основание);
	
	ДокументОпрос.ТиповаяАнкета = ТиповаяАнкета;
	
#Если НаКлиенте Тогда
	Попытка
		зфОпросОбновитьСписокВопросов(ДокументОпрос);
	Исключение		
	КонецПопытки;
#КонецЕсли
	
	ДокументОпрос.Дата = ДатаОпроса;
	ДокументОпрос.Менеджер = МенеджерОпроса;
	ДокументОпрос.СпособКонтакта = Перечисления.ВидыСобытий.ТелефонныйЗвонок;
	ДокументОпрос.ДокументОснование = Основание;
	ДокументОпрос.Принадлежность = ПринадлежностьОпроса;
	
	Если ЗначениеЗаполнено(ДокументОпрос.ОпрашиваемоеЛицо) И ТипЗнч(ДокументОпрос.ОпрашиваемоеЛицо) = Тип("СправочникСсылка.Контрагенты") Тогда
		ДокументОпрос.Поле = ДокументОпрос.ОпрашиваемоеЛицо.ОсновнойТелефон;
	КонецЕсли;
			
	Попытка
		ДокументОпрос.Записать(РежимЗаписиДокумента.Запись);			
	Исключение
	КонецПопытки;
	
	Возврат ДокументОпрос.Ссылка;	
КонецФункции

Функция ПолучитьПользователяПоСотруднику(Сотрудник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Пользователи.Ссылка
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |ГДЕ
	               |	Пользователи.Сотрудник = &Сотрудник
	               |	И НЕ Пользователи.ПометкаУдаления";
				   
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции
// - КМ

// Семенихин 09.03.2021 +++++
Процедура ИзменитьСтатусРабочегоЛиста()
	Если обЗначениеНеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	Если  Не (ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РабочийЛист") 
		Или ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РабочийЛистСервиса")) Тогда
		Возврат;
	КонецЕсли;
	Если ДокументОснование.Статус <> Справочники.СтатусыРабочегоЛиста.Создан Тогда
		Возврат;
	КонецЕсли;
	Если ТипСообщения = Перечисления.ТипыСообщений.Исходящее И Состояние = Перечисления.СостоянияСобытий.Запланировано Тогда
		Возврат;
	КонецЕсли;
	
	РабочийЛистОбъект = ДокументОснование.ПолучитьОбъект();
	РабочийЛистОбъект.Статус = Справочники.СтатусыРабочегоЛиста.Интерес;
	РабочийЛистОбъект.ОбменДанными.Загрузка = Истина;
	РабочийЛистОбъект.Записать();
КонецПроцедуры

Процедура ЗаменитьМенеджераРабочегоЛиста()
	Если Не ЗаписанНовыйДокумент Тогда
		Возврат;
	КонецЕсли;
	Если обЗначениеНеЗаполнено(ДокументОснование) Или ТипЗнч(ДокументОснование) <> Тип("ДокументСсылка.РабочийЛист") Тогда
		Возврат;
	КонецЕсли;
	
	ПродавецПользователь = Справочники.Пользователи.НайтиПоРеквизиту("Сотрудник", Продавец);
	Если обЗначениеНеЗаполнено(ПродавецПользователь) Тогда
		Возврат;
	КонецЕсли;
	
	ПользовательИБ = СМ_ПривилегированныйРежим.ПолучитьПользователяИБ(ПродавецПользователь);
	Если обЗначениеНеЗаполнено(ПользовательИБ) Тогда
		Возврат;
	КонецЕсли;	
	ПодходящийПользователь = ПользовательИБ.Роли.Содержит(Метаданные.Роли.СМ_МенеджерОтделаПродаж) 
		И Не ПользовательИБ.Роли.Содержит(Метаданные.Роли.СМ_РуководительОтделаПродаж) 
		И Не ПользовательИБ.Роли.Содержит(Метаданные.Роли.СМ_CallCenter);
	
	Если ПодходящийПользователь И ВидСобытия <> Перечисления.ВидыСобытий.ЗвонокВежливости Тогда		
		РабочийЛистОбъект = ДокументОснование.ПолучитьОбъект();
		Если РабочийЛистОбъект.Менеджер <> Продавец Тогда
			РабочийЛистОбъект.Менеджер = Продавец;
			Попытка
				РабочийЛистОбъект.ОбменДанными.Загрузка = Истина;
				РабочийЛистОбъект.Записать();
			Исключение
				Сообщить("Ошибка замены менеджера в " + Строка(РабочийЛистОбъект) + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Важное);
			КонецПопытки;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

Процедура ОтменитьЗапланированныеСобытия()
	Если ВидСобытия <> Перечисления.ВидыСобытий.ВыдачаАвтомобиля И ВидСобытия <> Перечисления.ВидыСобытий.ОтказОтАвтомобиля Тогда
		Возврат;
	ИначеЕсли Состояние <> Перечисления.СостоянияСобытий.Завершено Тогда
		Возврат;
	ИначеЕсли ТипЗнч(ДокументОснование) <> Тип("ДокументСсылка.РабочийЛист") Тогда
		Возврат;
	КонецЕсли;	
	
	СписокВидов = Новый Массив();
	СписокВидов.Добавить(Перечисления.ВидыСобытий.ЛичнаяВстреча);
	СписокВидов.Добавить(Перечисления.ВидыСобытий.ТелефонныйЗвонок);
	СписокВидов.Добавить(Перечисления.ВидыСобытий.ТестДрайв);
	Если ВидСобытия = Перечисления.ВидыСобытий.ОтказОтАвтомобиля Тогда
		СписокВидов.Добавить(Перечисления.ВидыСобытий.ВыдачаАвтомобиля);
	КонецЕсли;
	
	ЗапросЗапланированные = Новый Запрос();
	ЗапросЗапланированные.УстановитьПараметр("РабочийЛист", ДокументОснование);
	ЗапросЗапланированные.УстановитьПараметр("СписокВидов", СписокВидов);
	ЗапросЗапланированные.УстановитьПараметр("Запланировано", Перечисления.СостоянияСобытий.Запланировано);
	ЗапросЗапланированные.Текст =
	"ВЫБРАТЬ
	|	Событие.Ссылка
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.ДокументОснование = &РабочийЛист
	|	И Событие.ВидСобытия В(&СписокВидов)
	|	И Событие.Состояние = &Запланировано
	|	И Событие.ПометкаУдаления = ЛОЖЬ";
	
	ВыборкаЗапланированные = ЗапросЗапланированные.Выполнить().Выбрать();
	Пока ВыборкаЗапланированные.Следующий() Цикл
		СобытиеОбъект = ВыборкаЗапланированные.Ссылка.ПолучитьОбъект();
		СобытиеОбъект.Состояние = Перечисления.СостоянияСобытий.Отменено;
		
		Если ВидСобытия = Перечисления.ВидыСобытий.ВыдачаАвтомобиля Тогда
			СобытиеОбъект.Результат = "Выдан автомобиль " + Строка(Автомобиль);
			Если СобытиеОбъект.ВидСобытия = Перечисления.ВидыСобытий.ЛичнаяВстреча Тогда
				СобытиеОбъект.Состояние = Перечисления.СостоянияСобытий.Завершено;
			КонецЕсли;
			
		Иначе
			СобытиеОбъект.Результат = "Зарегистрирован отказ от автомобиля.";
		КонецЕсли;
		
 		//Бондаренко++ 20230812
		Если СобытиеОбъект.Организация <> СобытиеОбъект.ПодразделениеКомпании.Организация Тогда
 			Попытка СобытиеОбъект.Организация = СобытиеОбъект.ПодразделениеКомпании.Организация; Исключение КонецПопытки; 
 	   	КонецЕсли;             
		//Бондаренко-- 20230812
		
		Попытка
			СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить("Ошибка при отмене запланированного " + Строка(СобытиеОбъект) + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Важное);
			Продолжить;
		КонецПопытки;		
	КонецЦикла;
КонецПроцедуры

Процедура СМГ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//Бондаренко++ 20230801
	Если ЭтоНовый() Тогда
	    СМ_ДатаСоздания=ТекущаяДата();
 	КонецЕсли; 
 	//Бондаренко-- 20230801
 	
	// Семенихин 24.05.2021 +++++
	ЗаписанНовыйДокумент = ЭтоНовый();
	ЭтоСобытиеОП = ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РабочийЛист");
	
	Если ЗаписанНовыйДокумент Тогда
		Если Пользователи.Количество() > 0 Тогда
			НайденнаяСтрока = Пользователи.Найти(Автор, "Пользователь");
			Если НайденнаяСтрока = Неопределено Тогда
				НоваяСтрока = Пользователи.Добавить();
				НоваяСтрока.Пользователь = Автор;
			КонецЕсли;		
		Иначе
			НоваяСтрока = Пользователи.Добавить();
			НоваяСтрока.Пользователь = Автор;
		КонецЕсли;
		
		Если ЭтоСобытиеОП И ВидСобытия = Перечисления.ВидыСобытий.ВыдачаАвтомобиля Тогда			
			ЗапросВыдачи = Новый Запрос();
			ЗапросВыдачи.УстановитьПараметр("РабочийЛист", ДокументОснование);
			ЗапросВыдачи.Текст =
			"ВЫБРАТЬ
			|	Событие.Ссылка
			|ИЗ
			|	Документ.Событие КАК Событие
			|ГДЕ
			|	Событие.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ВыдачаАвтомобиля)
			|	И Событие.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияСобытий.Отменено)
			|	И Событие.ДокументОснование = &РабочийЛист
			|	И НЕ Событие.ПометкаУдаления";
			
			РезультатВыдачи = ЗапросВыдачи.Выполнить();
			Если Не РезультатВыдачи.Пустой() Тогда
				Сообщить("По документу " + Строка(ДокументОснование) + " уже есть выдача автомобиля!!!", СтатусСообщения.ОченьВажное);
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Если ЭтоСобытиеОП И ДатаНачала > ДобавитьМесяц(ТекущаяДата(), 1) И Не РольДоступна("ПолныеПрава") Тогда
			#Если Клиент Тогда
			Сообщить("Период планирования события не может превышать 1 месяц!", СтатусСообщения.Внимание);
			#КонецЕсли
			Отказ = Истина;
		КонецЕсли;
			
		// Семенихин 11.06.2023 +++++
		Если Состояние = Перечисления.СостоянияСобытий.Завершено Или Состояние = Перечисления.СостоянияСобытий.Отменено Тогда
			Если ВидСобытия = Перечисления.ВидыСобытий.ОтказОтАвтомобиля Тогда
				ДатаФактическогоЗавершения = ТекущаяДата() + 180;
			Иначе
				ДатаФактическогоЗавершения = ТекущаяДата();
			КонецЕсли;
		КонецЕсли;
		// Семенихин 02.10.2025 -----
		
	ИначеЕсли Состояние <> Ссылка.Состояние Тогда
		Если (ВидСобытия = Перечисления.ВидыСобытий.ЛичнаяВстреча Или ВидСобытия = Перечисления.ВидыСобытий.ТелефонныйЗвонок
			И ТипСообщения = Перечисления.ТипыСообщений.Исходящее) Тогда
			//Бондаренко++ 20230404
			Если НЕ РольДоступна("ПолныеПрава") Тогда
				//Бондаренко 20230404
				ДатаНачала = ТекущаяДата();
				ДатаОкончания = ДатаНачала + 600;
				//Бондаренко++ 20230404	
			КонецЕсли;
		КонецЕсли;
		//Бондаренко 20230404
			
		// Семенихин 08.06.2023 +++++
		Если Состояние = Перечисления.СостоянияСобытий.Завершено Тогда
			ДатаФактическогоЗавершения = ТекущаяДата();
		КонецЕсли;
		// Семенихин 08.06.2023 -----
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(Результат) И Состояние = Перечисления.СостоянияСобытий.Завершено И ВидСобытия = Перечисления.ВидыСобытий.ВыдачаАвтомобиля Тогда
		Результат = "Автомобиль выдан.";
	КонецЕсли;	
	
	Если ЭтоСобытиеОП И Состояние = Перечисления.СостоянияСобытий.Отменено Тогда		
		ЗапросСобытия = Новый Запрос();
		ЗапросСобытия.УстановитьПараметр("РабочийЛист", ДокументОснование);
		ЗапросСобытия.УстановитьПараметр("ЭтоСобытие", Ссылка);
		ЗапросСобытия.УстановитьПараметр("Выдача", Перечисления.ВидыСобытий.ВыдачаАвтомобиля);
		ЗапросСобытия.Текст =
		"ВЫБРАТЬ
		|	Событие.Ссылка
		|ИЗ
		|	Документ.Событие КАК Событие
		|ГДЕ
		|	Событие.ДокументОснование = &РабочийЛист
		|	И Событие.Ссылка <> &ЭтоСобытие
		|	И Событие.ВидСобытия <> &Выдача";
		
		РезультатЗапроса = ЗапросСобытия.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			//Бондаренко++ 20230404
			Если НЕ РольДоступна("ПолныеПрава")  Тогда
				//Бондаренко 20230404
				Сообщить("ВНИМАНИЕ! Запрещено отменять единственное событие в рабочем листе!", СтатусСообщения.Важное);
				Отказ = Истина;
				Возврат;           
				//Бондаренко++ 20230404	
			КонецЕсли;             
			//Бондаренко 20230404
		КонецЕсли;
	КонецЕсли;
	// Семенихин 22.08.2024 -----
	
	// Семенихин 22.10.2024 закомментировал для возможности работы МОП с разными брендами
	////Бондаренко++ 20201119
	//Если Не обЗначениеНеЗаполнено(Продавец) И ЭтоОбычныйМОП Тогда
	//	Если Продавец.Подразделение <> ПодразделениеКомпании Тогда
	//		Попытка ПодразделениеКомпании = Продавец.Подразделение; Исключение КонецПопытки;  
	//		Попытка Организация = Продавец.Подразделение.Организация; Исключение КонецПопытки;  
	//		Попытка УстановитьНовыйНомер(); Исключение	 КонецПопытки; 
	//	КонецЕсли; 
	//КонецЕсли; 
	////Бондаренко-- 20201119
	
	// Попытка заполнения времени планируемой выдачи автомобияя на основании даты
	ПланируемоеВремяВыдачиАвтомобиля	= Дата(1,1,1,0,0,0);
	Если ВидСобытия = Перечисления.ВидыСобытий.ВыдачаАвтомобиля И ЗначениеЗаполнено(ПланируемаяДатаВыдачиАвтомобиля) Тогда
		ПланГод		= Год(ПланируемаяДатаВыдачиАвтомобиля);
		ПланМесяц	= Месяц(ПланируемаяДатаВыдачиАвтомобиля);
		ПланДень	= День(ПланируемаяДатаВыдачиАвтомобиля);
		ПланЧас		= Час(ПланируемаяДатаВыдачиАвтомобиля);
		ПланМинута	= Минута(ПланируемаяДатаВыдачиАвтомобиля);
		ПланСекунда	= Секунда(ПланируемаяДатаВыдачиАвтомобиля);
		ПланируемоеВремяВыдачиАвтомобиля= Дата(1, 1, 1, ПланЧас, ПланМинута, ПланСекунда);
	КонецЕсли;                   
	
	//Бондаренко++ 20211007
	Если ВидСобытия = Перечисления.ВидыСобытий.ЛичнаяВстреча Тогда
		Если ТипСообщения <> Перечисления.ТипыСообщений.Входящее Тогда
			ТипСообщения = Перечисления.ТипыСообщений.Входящее; 					
		КонецЕсли;
 	КонецЕсли;
 	//Бондаренко++ 20211007
 	
	// + КМ
	Если Состояние = Перечисления.СостоянияСобытий.Завершено И ЗначениеЗаполнено(ФорматТекста) И Не ПометкаУдаления Тогда	
		СодержаниеТекст = Содержание;
		РезультатТекст = Результат;
		
		Если ФорматТекста = Перечисления.ФорматТекста.HTML Тогда
			СодержаниеТекст = обПолучитьТекст(Содержание);
			РезультатТекст = обПолучитьТекст(Результат);
		КонецЕсли;
		
		Если Лев(СодержаниеТекст, 17) = "Звонок вежливости" Или ВидСобытия = Перечисления.ВидыСобытий.ЗвонокВежливости Тогда
			
			Если ЗначениеЗаполнено(Опрос) И Не Опрос.ОпросЗавершен и Константы.ДилерскийЦентр.Получить() <> Справочники.ДилерскиеЦентры.Дельта Тогда
				Сообщить("Не завершен опрос!", СтатусСообщения.БезСтатуса);
				Отказ = Истина;
			КонецЕсли;
			
			Если ПустаяСтрока(РезультатТекст) Тогда
				Сообщить("Реквизит <Результат> не заполнен !", СтатусСообщения.БезСтатуса);
				Отказ = Истина;					
			КонецЕсли;
			
			Если Отказ Тогда				
				Сообщить("При записи < " + СокрЛП(ЭтотОбъект) + " > обнаружены ошибки", СтатусСообщения.Внимание);
				Сообщить("Из-за возникших ошибок операция записи была отменена.", СтатусСообщения.Важное); 				
			КонецЕсли;		
		КонецЕсли;	
	КонецЕсли;
	// - КМ
	
	//Бондаренко++ 20221004 
	Если РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если обЗначениеНеЗаполнено(ЭтотОбъект.Модель) Тогда
			Если НЕ обЗначениеНеЗаполнено(ЭтотОбъект.ДокументОснование) Тогда 
				Если ТипЗНЧ(ЭтотОбъект.ДокументОснование)=Тип("ДокументСсылка.РабочийЛист") ИЛИ ТипЗНЧ(ЭтотОбъект.ДокументОснование)=Тип("ДокументСсылка.РабочийЛистСервиса") Тогда
 					Если НЕ обЗначениеНеЗаполнено(ЭтотОбъект.ДокументОснование.Модель) Тогда			
						Попытка ЭтотОбъект.Модель = ЭтотОбъект.ДокументОснование.Модель; Исключение КонецПопытки;  
					КонецЕсли; 	
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	//Бондаренко-- 20221004
 	
КонецПроцедуры

Процедура СМГ_ПриЗаписи(Отказ)
	// При записи Выдачи автомобиля
	Если ВидСобытия = Перечисления.ВидыСобытий.ВыдачаАвтомобиля И Состояние = Перечисления.СостоянияСобытий.Завершено Тогда		
		Если ДокументОснование.Статус <> Справочники.СтатусыРабочегоЛиста.Продажа Тогда 
			РабочийЛистОбъект = ДокументОснование.ПолучитьОбъект();
			РабочийЛистОбъект.Статус = Справочники.СтатусыРабочегоЛиста.Продажа;
			РабочийЛистОбъект.Автомобиль = Автомобиль;
			РабочийЛистОбъект.ОбработкаРеквизита("Автомобиль");
			РабочийЛистОбъект.МашинаВыдана = Истина;
			Попытка
				РабочийЛистОбъект.ОбменДанными.Загрузка = Истина;
				РабочийЛистОбъект.Записать();
			Исключение
				Сообщить("Не удалось установить статус Продажа для " + Строка(ДокументОснование) + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Важное);
				Отказ = Истина;
				Возврат;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	// При записи Отказа от автомобиля
	Если ВидСобытия = Перечисления.ВидыСобытий.ОтказОтАвтомобиля И Состояние = Перечисления.СостоянияСобытий.Завершено Тогда		
		Если ДокументОснование.Статус <> Справочники.СтатусыРабочегоЛиста.Отказ Тогда
			ИзменитьТекущийСтатус = Истина;
			Если ДокументОснование.Статус = Справочники.СтатусыРабочегоЛиста.Продажа Тогда
				мПодчиненные = КритерииОтбора.ПодчиненныеДокументы.Найти(ДокументОснование);
				ПродажаСсылка = Документы.РеализацияАвтомобилей.ПустаяСсылка();
				Для Каждого ПодчиненныйРабЛиста Из мПодчиненные Цикл
					Если ТипЗнч(ПодчиненныйРабЛиста) = Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
						мПодчиненныеЗаказа = КритерииОтбора.ПодчиненныеДокументы.Найти(ПодчиненныйРабЛиста);
						Для Каждого ПодчиненныйЗаказа Из мПодчиненныеЗаказа Цикл
							Если ТипЗнч(ПодчиненныйЗаказа) = Тип("ДокументСсылка.РеализацияАвтомобилей") Тогда
								ПродажаСсылка = ПодчиненныйЗаказа;
								Прервать;

							ИначеЕсли ТипЗнч(ПодчиненныйЗаказа) = Тип("ДокументСсылка.ОтгрузкаАвтомобиляБезРеализации") Тогда
								ПродажаСсылка = ПодчиненныйЗаказа;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						
						Если ЗначениеЗаполнено(ПродажаСсылка) Тогда
							ИзменитьТекущийСтатус = Ложь;
							Прервать;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если ИзменитьТекущийСтатус Тогда
				РабочийЛистОбъект = ДокументОснование.ПолучитьОбъект();
				РабочийЛистОбъект.Статус = Справочники.СтатусыРабочегоЛиста.Отказ;
				РабочийЛистОбъект.ПричинаОтказа = ПричинаОтмены;
				Попытка
					РабочийЛистОбъект.ОбменДанными.Загрузка = Истина;
					РабочийЛистОбъект.Записать();
				Исключение
					Сообщить("Не удалось установить статус Отказ для " + Строка(ДокументОснование) + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Важное);
					Отказ = Истина;
					Возврат;
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	ОтменитьЗапланированныеСобытия();
	Если ЭтоОбычныйМОП Тогда
		ЗаменитьМенеджераРабочегоЛиста();
	КонецЕсли;	
	ИзменитьСтатусРабочегоЛиста();
	СМ_ПроцедурыДляNissanAftersales.ОбновитьСтатусЛидаПоСобытию(Ссылка);
	Если Не Отказ Тогда
		РегистрыСведений.МаркетинговыеЛиды.ДобавитьЗапись(Ссылка);
	КонецЕсли;
КонецПроцедуры
// Семенихин 18.01.2023 -----


////////////////////////////////////////////////////////////////////////////////
// ИНИЦИАЛИЗАЦИЯ ПЕРЕМЕННЫХ ОБЪЕКТА
ВводИзАРМРесепшен = Ложь;
ЗаписанНовыйДокумент = Ложь;
// Семенихин 22.08.2024 +++++
#Если Клиент Тогда
ЭтоОбычныйМОП = Не (РольДоступна("ПолныеПрава") Или РольДоступна("СМ_КорпоративныеПродажи"));
#Иначе
ЭтоОбычныйМОП = Ложь;
#КонецЕсли
// Семенихин 22.08.2024 -----
