
Перем ОбщийЗапрос;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Если Статус = Ссылка.Статус Тогда
			Отказ = Renault_ОбщегоНазначенияКлиентСервер.ПроверитьДатуОперации(ЭтотОбъект);
		КонецЕсли;
		
		Если Маршрут.СкладОтправитель.Renault_Территория = Маршрут.СкладПолучатель.Renault_Территория Тогда
			Статус = Перечисления.Renault_СтатусыЗаявкиНаПеремещение.Закрыто;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Статус = Перечисления.Renault_СтатусыЗаявкиНаПеремещение.Закрыто Тогда
		Принял = ПараметрыСеанса.Пользователь;
	ИначеЕсли Статус = Перечисления.Renault_СтатусыЗаявкиНаПеремещение.ВПути Тогда
		Если Маршрут.СкладОтправитель.Renault_Территория = Маршрут.СкладПолучатель.Renault_Территория Тогда
			Принял = ПараметрыСеанса.Пользователь;
		КонецЕсли;
	КонецЕсли;
	
	// Расскомментить +++ Никитин
	//Если Renault_ОбщегоНазначения.ПолучитьДоступныеВидыОперцийДокумента(ЭтотОбъект, ПараметрыСеанса.ТекущийПользователь).Найти(ВидОперации,"ВидОперации") = Неопределено Тогда
	//	Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет прав на работу с документом «" + ЭтотОбъект.Метаданные().Синоним + "».");
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;
	
	//Если НЕ ДанныеДокументКорректны() Тогда
	//	Отказ = Истина;
	//КонецЕсли;
	// Расскомментить --- Никитин
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Статус = Перечисления.Renault_СтатусыЗаявкиНаПеремещение.ВПути 
		ИЛИ (Статус = Перечисления.Renault_СтатусыЗаявкиНаПеремещение.Закрыто И Маршрут.СкладОтправитель.Renault_Территория = Маршрут.СкладПолучатель.Renault_Территория)Тогда
		Если НЕ ДанныеСистемыКорректны() Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	СкладЭвакуатор = Константы.Renault_СкладЭвакуатор.Получить();
	
	Если НЕ Отказ Тогда
		
		Если Маршрут.СкладОтправитель.Renault_Территория = Маршрут.СкладПолучатель.Renault_Территория Тогда
			
			ПолучитьТаблицуОстаткиАвтомобилей("ОстаткиАвтомобилей");
			
			Движения.ОстаткиАвтомобилей.Прочитать();
			Движения.ОстаткиАвтомобилей.Загрузить(ДополнительныеСвойства.ОстаткиАвтомобилей);
			Движения.ОстаткиАвтомобилей.Записать();
			
			Если Маршрут.СкладПолучатель.ШоуРум Или Маршрут.СкладПолучатель.СкладРеализацииАвтомобилей Тогда
				Если НЕ РегистрыСведений.Renault_МестаАвтомобилей.ОсвободитьПарковочноеМесто(Автомобили.ВыгрузитьКолонку("Автомобиль")) Тогда
					Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось очистить парковочные места автомобилей. Документ:" + Ссылка, Неопределено, "", Отказ);
					Возврат;
				КонецЕсли;
			КонецЕсли;
			
			Если Маршрут.СкладОтправитель.ШоуРум Или Маршрут.СкладОтправитель.СкладРеализацииАвтомобилей Тогда
				ЗанятьМестаАвтомобилей();
			КонецЕсли;
			Если Маршрут.СкладПолучатель.СкладРеализацииАвтомобилей ИЛИ Маршрут.СкладОтправитель.СкладРеализацииАвтомобилей Тогда
				//ЗаписатьОтметкиВЖурналВыдачи();
			КонецЕсли;
		Иначе
			
			Если СкладЭвакуатор.Пустая() Тогда
				Сообщить("Склад-эвакуатор не выбран!", СтатусСообщения.Важное);
				Отказ = Истина;
			КонецЕсли;
			
			Если Не Отказ Тогда
				
				Если Статус = Перечисления.Renault_СтатусыЗаявкиНаПеремещение.ВПути Тогда
					
					Движения.ОстаткиАвтомобилей.Очистить();
					Движения.ОстаткиАвтомобилей.Записать();
					
					ПолучитьТаблицуОстаткиАвтомобилейСписание("ОстаткиАвтомобилей", СкладЭвакуатор);
					
					Движения.ОстаткиАвтомобилей.Прочитать();
					Движения.ОстаткиАвтомобилей.Загрузить(ДополнительныеСвойства.ОстаткиАвтомобилей);
					Движения.ОстаткиАвтомобилей.Записать();
					
					Если НЕ РегистрыСведений.Renault_МестаАвтомобилей.ОсвободитьПарковочноеМесто(Автомобили.ВыгрузитьКолонку("Автомобиль")) Тогда
						Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось очистить парковочные места автомобилей. Документ:" + Ссылка, Неопределено, "", Отказ);
						Возврат;
					КонецЕсли;
					
				ИначеЕсли Статус = Перечисления.Renault_СтатусыЗаявкиНаПеремещение.Закрыто Тогда
					
					ПолучитьТаблицуОстаткиАвтомобилейПоступление("ОстаткиАвтомобилей", СкладЭвакуатор);
					
					Движения.ОстаткиАвтомобилей.Прочитать();
					
					Для Каждого Строка Из ДополнительныеСвойства.ОстаткиАвтомобилей Цикл
						НоваяСтрока = Движения.ОстаткиАвтомобилей.Добавить();
						НоваяСтрока.Автомобиль = Строка.Автомобиль;
						НоваяСтрока.ВидДвижения = Строка.ВидДвижения;
						//НоваяСтрока.ДатаПоступления = Строка.ДатаПоступления;
						НоваяСтрока.Партия = Строка.Партия;
						НоваяСтрока.Количество = Строка.Количество;
						//НоваяСтрока.Организация = Строка.Организация;
						НоваяСтрока.Период = ТекущаяДата();
						НоваяСтрока.СкладКомпании = Строка.СкладКомпании;
						НоваяСтрока.СтатусПартии = Строка.СтатусПартии;
						//НоваяСтрока.ТипАвтомобиля = Строка.ТипАвтомобиля;
					КонецЦикла;	
					
					Движения.ОстаткиАвтомобилей.Записать();
					
					ЗанятьМестаАвтомобилей();
					ЗаписатьНачисленияВодителям();
					//ЗаписатьОтметкиВПланПеремещений();
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//////////////////////////////////////////
//Самописные процедуры и функции
//------------------BEGIN-----------------

Процедура ПодготовитьОбщийЗапрос()
	
	ОбщийЗапрос = ?(ТипЗнч(ОбщийЗапрос) = Тип("Запрос"), ОбщийЗапрос, Новый Запрос);
	ОбщийЗапрос.Параметры.Очистить();
	
КонецПроцедуры

//перед записью
Функция ДанныеДокументКорректны()
	
	Отказ = Ложь;
	
	Если ВидОперации = Перечисления.Renault_ВидыОперацийДокументовПеремещение.Новый Тогда
		
		СписокАвто	= Автомобили.Выгрузить(,"Автомобиль");
		СписокАвто.Свернуть("Автомобиль");
		Если СписокАвто.Количество() <> Автомобили.Количество() Тогда
			Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Автомобиль в табличной части должен фигурировать только один раз!", ЭтотОбъект, "Автомобили", Отказ);
		КонецЕсли;
		
		Справочники.Автомобили.ПроверитьПравоРаботыСАрхивомАвтомобилей(Автомобили, "Автомобиль", Отказ);
		
	Иначе
		Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Некорректный вид операции", ЭтотОбъект, "ВидОперации", Отказ);
	КонецЕсли;
	
	Возврат НЕ Отказ;
	
КонецФункции

//обработка проведения
Функция ДанныеСистемыКорректны()
	
	ПодготовитьОбщийЗапрос();
	
	ОбщийЗапрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабЧасть_Автомобили.Автомобиль
	|ПОМЕСТИТЬ ТабЧасть
	|ИЗ
	|	Документ.ПеремещениеАвтомобилей.Автомобили КАК ТабЧасть_Автомобили
	|ГДЕ
	|	ТабЧасть_Автомобили.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабЧасть_Автомобили.Автомобиль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабЧасть.Автомобиль
	|ИЗ
	|	ТабЧасть КАК ТабЧасть
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОстаткиНаСкладах.Автомобиль КАК Автомобиль
	|		ИЗ
	|			РегистрНакопления.ОстаткиАвтомобилей.Остатки(
	|					&ДатаОперации,
	|					СкладКомпании = &СкладОтправитель
	|						И Автомобиль В
	|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|								Табл.Автомобиль КАК Автомобиль
	|							ИЗ
	|								ТабЧасть КАК Табл)) КАК ОстаткиНаСкладах
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОстаткиНаСкладах.Автомобиль) КАК Остатки
	|		ПО (Остатки.Автомобиль = ТабЧасть.Автомобиль)
	|ГДЕ
	|	Остатки.Автомобиль ЕСТЬ NULL ";
	
	ОбщийЗапрос.УстановитьПараметр("Ссылка", 			Ссылка);
	ОбщийЗапрос.УстановитьПараметр("СкладОтправитель",	Маршрут.СкладОтправитель);
	ОбщийЗапрос.УстановитьПараметр("ДатаОперации",		Дата);
	
	ЕстьОшибка	= Ложь;
	Для каждого текАвто из ОбщийЗапрос.Выполнить().Выгрузить() Цикл
		ЕстьОшибка = Истина;
		Сообщить("Автомобиль:<" + текАвто.Автомобиль + "> отсутствует на складе:<" + Маршрут.СкладОтправитель + ">", СтатусСообщения.ОченьВажное);
	КонецЦикла;
	
	Если ЕстьОшибка Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ПолучитьТаблицуОстаткиАвтомобилейСписание(ИмяТаблицы, СкладЭвакуатор)
	
	ПодготовитьОбщийЗапрос();
	
	ОбщийЗапрос.Текст = 
	"ВЫБРАТЬ
	|	ТабЧастьАвтомобили.Автомобиль,
	|	ТабЧастьАвтомобили.Ссылка.Ссылка,
	|	ТабЧастьАвтомобили.Ссылка.ДатаОперации,
	|	ТабЧастьАвтомобили.Ссылка.Маршрут.СкладОтправитель КАК СкладИз,
	|	ТабЧастьАвтомобили.Ссылка.Маршрут.СкладПолучатель КАК СкладВ1,
	|	&СкладЭвакуатор КАК СкладВ
	|ПОМЕСТИТЬ ВТ_ТабЧасть
	|ИЗ
	|	Документ.Renault_ПеремещениеАвтомобилей.Автомобили КАК ТабЧастьАвтомобили
	|ГДЕ
	|	ТабЧастьАвтомобили.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АвтоНаСкладахОстатки.Автомобиль,
	|	АвтоНаСкладахОстатки.СкладКомпании КАК Склад,
	//|	АвтоНаСкладахОстатки.Организация,
	|	АвтоНаСкладахОстатки.Партия,
	//|	АвтоНаСкладахОстатки.ТипАвтомобиля,
	//|	АвтоНаСкладахОстатки.ДатаПоступления,
	|	АвтоНаСкладахОстатки.КоличествоОстаток КАК Количество,
	|	АвтоНаСкладахОстатки.СтатусПартии КАК СтатусПартии
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(
	|			&ДатаОперации,
	|			СкладКомпании = &СкладИЗ
	|				И Автомобиль В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Табл.Автомобиль
	|					ИЗ
	|						ВТ_ТабЧасть КАК Табл)) КАК АвтоНаСкладахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТабЧасть.Ссылка КАК Регистратор,
	|	ВТ_ТабЧасть.ДатаОперации КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВТ_Остатки.Автомобиль,
	|	ВТ_Остатки.Склад КАК СкладКомпании,
	//|	ВТ_Остатки.Организация,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварКупленный) КАК СтатусПартии,
	|	ВТ_Остатки.Партия,
	//|	ВТ_Остатки.ТипАвтомобиля,
	//|	ВТ_Остатки.ДатаПоступления,
	|	-ВТ_Остатки.Количество КАК Количество,
	|	ВТ_Остатки.СтатусПартии
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТабЧасть КАК ВТ_ТабЧасть
	|		ПО ВТ_Остатки.Автомобиль = ВТ_ТабЧасть.Автомобиль
	|			И ВТ_Остатки.Склад = ВТ_ТабЧасть.СкладИз
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТабЧасть.Ссылка,
	|	ВТ_ТабЧасть.ДатаОперации,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ВТ_Остатки.Автомобиль,
	|	ВТ_ТабЧасть.СкладВ,
	//|	ВТ_Остатки.Организация,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварКупленный),
	|	ВТ_Остатки.Партия,
	//|	ВТ_Остатки.ТипАвтомобиля,
	//|	ВТ_Остатки.ДатаПоступления,
	|	ВТ_Остатки.Количество,
	|	ВТ_Остатки.СтатусПартии
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТабЧасть КАК ВТ_ТабЧасть
	|		ПО ВТ_Остатки.Автомобиль = ВТ_ТабЧасть.Автомобиль
	|			И ВТ_Остатки.Склад = ВТ_ТабЧасть.СкладИз";
	
	ОбщийЗапрос.УстановитьПараметр("Ссылка", 		Ссылка);
	ОбщийЗапрос.УстановитьПараметр("ДатаОперации",	Дата);
	ОбщийЗапрос.УстановитьПараметр("СкладИз",		Маршрут.СкладОтправитель);
	ОбщийЗапрос.установитьПараметр("СкладЭвакуатор", СкладЭвакуатор);

	ДополнительныеСвойства.Вставить(ИмяТаблицы, ОбщийЗапрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Процедура ПолучитьТаблицуОстаткиАвтомобилейПоступление(ИмяТаблицы, СкладЭвакуатор)
	
	ПодготовитьОбщийЗапрос();
	
	ОбщийЗапрос.Текст = 
	"ВЫБРАТЬ
	|	ТабЧастьАвтомобили.Автомобиль,
	|	ТабЧастьАвтомобили.Ссылка.Ссылка,
	|	ТабЧастьАвтомобили.Ссылка.ДатаОперации,
	|	ТабЧастьАвтомобили.Ссылка.Маршрут.СкладОтправитель КАК СкладИз1,
	|	&СкладВ КАК СкладВ,
	|	&СкладИЗ КАК СкладИз
	|ПОМЕСТИТЬ ВТ_ТабЧасть
	|ИЗ
	|	Документ.Renault_ПеремещениеАвтомобилей.Автомобили КАК ТабЧастьАвтомобили
	|ГДЕ
	|	ТабЧастьАвтомобили.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АвтоНаСкладахОстатки.Автомобиль,
	|	АвтоНаСкладахОстатки.СкладКомпании,
	//|	АвтоНаСкладахОстатки.Организация,
	|	АвтоНаСкладахОстатки.Партия,
	//|	АвтоНаСкладахОстатки.ТипАвтомобиля,
	//|	АвтоНаСкладахОстатки.ДатаПоступления,
	|	АвтоНаСкладахОстатки.КоличествоОстаток КАК Количество,
	|	АвтоНаСкладахОстатки.СтатусПартии КАК СтатусПартии
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(
	|			&ДатаОперации,
	|			СкладКомпании = &СкладИЗ
	|				И Автомобиль В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Табл.Автомобиль
	|					ИЗ
	|						ВТ_ТабЧасть КАК Табл)) КАК АвтоНаСкладахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТабЧасть.Ссылка КАК Регистратор,
	|	ВТ_ТабЧасть.ДатаОперации КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВТ_Остатки.Автомобиль,
	|	ВТ_Остатки.СкладКомпании,
	//|	ВТ_Остатки.Организация,
	|	ВТ_Остатки.Партия,
	//|	ВТ_Остатки.ТипАвтомобиля,
	//|	ВТ_Остатки.ДатаПоступления,
	|	-ВТ_Остатки.Количество КАК Количество,
	|	ВТ_Остатки.СтатусПартии КАК СтатусПартии
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТабЧасть КАК ВТ_ТабЧасть
	|		ПО ВТ_Остатки.Автомобиль = ВТ_ТабЧасть.Автомобиль
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТабЧасть.Ссылка,
	|	ВТ_ТабЧасть.ДатаОперации,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ВТ_Остатки.Автомобиль,
	|	ВТ_ТабЧасть.СкладВ,
	//|	ВТ_Остатки.Организация,
	|	ВТ_Остатки.Партия,
	//|	ВТ_Остатки.ТипАвтомобиля,
	//|	ВТ_Остатки.ДатаПоступления,
	|	ВТ_Остатки.Количество,
	|	ВТ_Остатки.СтатусПартии
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТабЧасть КАК ВТ_ТабЧасть
	|		ПО ВТ_Остатки.Автомобиль = ВТ_ТабЧасть.Автомобиль";
	
	ОбщийЗапрос.УстановитьПараметр("Ссылка", 		Ссылка);
	ОбщийЗапрос.УстановитьПараметр("ДатаОперации",	ТекущаяДата());
	ОбщийЗапрос.УстановитьПараметр("СкладИЗ",		СкладЭвакуатор);
	ОбщийЗапрос.установитьПараметр("СкладВ", Маршрут.СкладПолучатель);

	ДополнительныеСвойства.Вставить(ИмяТаблицы, ОбщийЗапрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Процедура ПолучитьТаблицуОстаткиАвтомобилей(ИмяТаблицы)
	
	ПодготовитьОбщийЗапрос();
	
	ОбщийЗапрос.Текст = 
	"ВЫБРАТЬ
	|	ТабЧастьАвтомобили.Автомобиль,
	|	ТабЧастьАвтомобили.Ссылка.Ссылка,
	|	ТабЧастьАвтомобили.Ссылка.ДатаОперации,
	|	ТабЧастьАвтомобили.Ссылка.Маршрут.СкладПолучатель КАК СкладВ,
	|	ТабЧастьАвтомобили.Ссылка.Маршрут.СкладОтправитель КАК СкладИз
	|ПОМЕСТИТЬ ВТ_ТабЧасть
	|ИЗ
	|	Документ.Renault_ПеремещениеАвтомобилей.Автомобили КАК ТабЧастьАвтомобили
	|ГДЕ
	|	ТабЧастьАвтомобили.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АвтоНаСкладахОстатки.Автомобиль,
	|	АвтоНаСкладахОстатки.СкладКомпании,
	//|	АвтоНаСкладахОстатки.Организация,
	|	АвтоНаСкладахОстатки.Партия,
	//|	АвтоНаСкладахОстатки.ТипАвтомобиля,
	//|	АвтоНаСкладахОстатки.ДатаПоступления,
	|	АвтоНаСкладахОстатки.КоличествоОстаток КАК Количество
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(
	|			&ДатаОперации,
	|			СкладКомпании = &СкладИЗ
	|				И Автомобиль В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Табл.Автомобиль
	|					ИЗ
	|						ВТ_ТабЧасть КАК Табл)) КАК АвтоНаСкладахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТабЧасть.Ссылка КАК Регистратор,
	|	ВТ_ТабЧасть.ДатаОперации КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВТ_Остатки.Автомобиль,
	|	ВТ_Остатки.СкладКомпании,
	//|	ВТ_Остатки.Организация,
	|	ВТ_Остатки.Партия,
	//|	ВТ_Остатки.ТипАвтомобиля,
	//|	ВТ_Остатки.ДатаПоступления,
	|	-ВТ_Остатки.Количество КАК Количество
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТабЧасть КАК ВТ_ТабЧасть
	|		ПО ВТ_Остатки.Автомобиль = ВТ_ТабЧасть.Автомобиль
	|			И ВТ_Остатки.СкладКомпании = ВТ_ТабЧасть.СкладИз
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТабЧасть.Ссылка,
	|	ВТ_ТабЧасть.ДатаОперации,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ВТ_Остатки.Автомобиль,
	|	ВТ_ТабЧасть.СкладВ,
	//|	ВТ_Остатки.Организация,
	|	ВТ_Остатки.Партия,
	////|	ВТ_Остатки.ТипАвтомобиля,
	////|	ВТ_Остатки.ДатаПоступления,
	|	ВТ_Остатки.Количество
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТабЧасть КАК ВТ_ТабЧасть
	|		ПО ВТ_Остатки.Автомобиль = ВТ_ТабЧасть.Автомобиль
	|			И ВТ_Остатки.СкладКомпании = ВТ_ТабЧасть.СкладИз";
	
	ОбщийЗапрос.УстановитьПараметр("Ссылка", 		Ссылка);
	ОбщийЗапрос.УстановитьПараметр("ДатаОперации",	Дата);
	ОбщийЗапрос.УстановитьПараметр("СкладИз",		Маршрут.СкладОтправитель);

	ДополнительныеСвойства.Вставить(ИмяТаблицы, ОбщийЗапрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Процедура ЗаписатьНачисленияВодителям()
	
	Движения.Renault_НачисленияВодителей.Записывать = Истина;
	Движения.Renault_НачисленияВодителей.Очистить();
	
	Движение = Движения.Renault_НачисленияВодителей.Добавить();
	Движение.Период = Дата;
	Движение.ОбратныйРейс = ОбратныйРейс;
	Движение.Водитель = Водитель;
	Движение.Маршрут = Маршрут;
	Если Автомобили.Количество() = 1 Тогда
		Движение.ТипМаршрута = Перечисления.Renault_ТипМаршрута.Прямой1;
	ИначеЕсли Автомобили.Количество() = 2 Тогда
		Движение.ТипМаршрута = Перечисления.Renault_ТипМаршрута.Прямой2;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗанятьМестаАвтомобилей()
	
	НаборЗаписей = РегистрыСведений.Renault_МестаАвтомобилей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Территория.Установить(Маршрут.СкладПолучатель.Renault_Территория);
	Для Каждого СтрокаАвтомобили Из Автомобили Цикл
		
		НаборЗаписей.Отбор.ПарковочноеМесто.Установить(СтрокаАвтомобили.Место);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() Тогда
			НаборЗаписей[0].Автомобиль = СтрокаАвтомобили.Автомобиль;
			НаборЗаписей.Записать();
		Иначе
			Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Парковочное место " + СтрокаАвтомобили.Место + " на складе " + Маршрут.СкладПолучатель + " отсутствует!!!");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьОтметкиВПланПеремещений()
	
	Для Каждого СтрокаАвтомобили Из Автомобили Цикл
		
		текДатаПоступления = СтрокаАвтомобили.ЗаявкаНаПеремещение.ДатаПоступления + (СтрокаАвтомобили.ЗаявкаНаПеремещение.ВремяПоступления - Дата('00010101')); 
		МенеджерЗаписи = РегистрыСведений.ПланПеремещений.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ЗаявкаНаПеремещение = СтрокаАвтомобили.ЗаявкаНаПеремещение;
		МенеджерЗаписи.ДатаПлан = текДатаПоступления;
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.СозданДокументПеремещения = Истина;
			МенеджерЗаписи.Записать();
		Иначе
			//Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Парковочное место " + СтрокаАвтомобили.Место + " на складе " + Маршрут.СкладПолучатель + " отсутствует!!!");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаписатьОтметкиВПланПеремещений()

Процедура ЗаписатьОтметкиВЖурналВыдачи()
	
	ТаблицаДвижений	= Новый ТаблицаЗначений;
		
	Запрос	= Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремещениеАвтомобилейАвтомобили.Автомобиль
	|ПОМЕСТИТЬ ВТ_Автомобили
	|ИЗ
	|	Документ.ПеремещениеАвтомобилей.Автомобили КАК ПеремещениеАвтомобилейАвтомобили
	|ГДЕ
	|	ПеремещениеАвтомобилейАвтомобили.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВЗ_ЖурналВыдачи.ДатаВыдачи) КАК ДатаВыдачи,
	|	ВЗ_ЖурналВыдачи.Территория,
	|	ВЗ_ЖурналВыдачи.Автомобиль
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЖурналВыдачи.ДатаВыдачи КАК ДатаВыдачи,
	|		ЖурналВыдачи.Территория КАК Территория,
	|		ЖурналВыдачи.Автомобиль КАК Автомобиль
	|	ИЗ
	|		РегистрСведений.ЖурналВыдачи КАК ЖурналВыдачи
	|	ГДЕ
	|		ЖурналВыдачи.Автомобиль В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					Табл.Автомобиль
	|				ИЗ
	|					ВТ_Автомобили КАК Табл)
	|		И НЕ ЖурналВыдачи.Выдан) КАК ВЗ_ЖурналВыдачи
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЗ_ЖурналВыдачи.Территория,
	|	ВЗ_ЖурналВыдачи.Автомобиль";
	
	Запрос.УстановитьПараметр("Ссылка",			Ссылка);
	Запрос.УстановитьПараметр("ДатаОперации",	ДатаОперации);
	//Запрос.УстановитьПараметр("РабочийЛист",	Договор.РабочийЛист);
	
	ТаблицаДвижений	= Запрос.Выполнить().Выгрузить();
	
	//ДополнительныеСвойства.Вставить("ЖурналВыдачи", ТаблицаДвижений);

	Для каждого текСтрока из ТаблицаДвижений Цикл
		МенеджерЗаписи	= РегистрыСведений.ЖурналВыдачи.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ДатаВыдачи	= текСтрока.ДатаВыдачи;
		МенеджерЗаписи.Территория	= текСтрока.Территория;
		
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			Если МенеджерЗаписи.Выдан Тогда
				МенеджерЗаписи.Выдан = Ложь;
			Иначе
				
			МенеджерЗаписи.Выдан = Истина;
			КонецЕсли;
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Не Отказ Тогда
		ЗаписатьОтметкиВПланПеремещений();
	КонецЕсли;
	
КонецПроцедуры

//------------------END-------------------
//Самописные процедуры и функции
//////////////////////////////////////////