
Перем СтруктураЦветов Экспорт;
Перем Приемка Экспорт;
Перем Выдача Экспорт;

Функция ПолучитьСтруктуруЦветов(ВхПользователь = Неопределено) Экспорт
	
	СтруктураЦветов = Новый Структура;
	СтруктураЦветов.Вставить("КрасныйЦвет", Новый Цвет(255, 0, 0));
	СтруктураЦветов.Вставить("ЧерныйЦвет", Новый Цвет(0, 0, 0));
	СтруктураЦветов.Вставить("ЖелтыйЦвет", Новый Цвет(255, 255, 0));
	СтруктураЦветов.Вставить("ТемноСерыйЦветФона", Новый Цвет(220, 220, 220));
	СтруктураЦветов.Вставить("ЦветФонаКнопки", Новый Цвет(255, 255, 255));
	СтруктураЦветов.Вставить("ЦветРамки", Новый Цвет(0, 0, 0));
	// Трояновский К.Е. 12.07.2019 10:13:59 {
	СтруктураЦветов.Вставить("ЗеленыйЦвет", Новый Цвет(0, 168, 0));	
	// Трояновский К.Е. 12.07.2019 10:13:59 }
	СтруктураЦветов.Вставить("ОсновнойЦвет", Новый Цвет(255,207,0)); //базовый цвет
	
	Если Не(ВхПользователь = Неопределено) Тогда
		
		Зап = Новый Запрос("ВЫБРАТЬ
		                   |	Renault_ПользовательскиеНастройки.ЦветФонаМастера,
						   |	Renault_ПользовательскиеНастройки.ЦветФонаМастераПланирование,
		                   |	Renault_ПользовательскиеНастройки.ЦветФонаМастераЗаявка,
		                   |	Renault_ПользовательскиеНастройки.ЦветФонаМастераВработе,
		                   |	Renault_ПользовательскиеНастройки.ЦветФонаМойка,
						   |	Renault_ПользовательскиеНастройки.ЦветФонаМойкаПланирование,
		                   |	Renault_ПользовательскиеНастройки.ЦветФонаМойкаЗаявка,
		                   |	Renault_ПользовательскиеНастройки.ЦветФонаМойкаВРаботе,
		                   |	Renault_ПользовательскиеНастройки.ЦветФонаРемонт,
						   |	Renault_ПользовательскиеНастройки.ЦветФонаРемонтПланирование,
		                   |	Renault_ПользовательскиеНастройки.ЦветФонаРемонтЗаявка,
		                   |	Renault_ПользовательскиеНастройки.ЦветФонаРемонтВработе,
		                   |	Renault_ПользовательскиеНастройки.ЦветЗапланированнойРаботы,
		                   |	Renault_ПользовательскиеНастройки.ЦветПросроченнойРаботы,
		                   |	Renault_ПользовательскиеНастройки.ЦветАктивнойРаботыПлан,
		                   |	Renault_ПользовательскиеНастройки.ЦветАктивнойРаботыФакт,
		                   |	Renault_ПользовательскиеНастройки.ЦветПриостановленнойРаботы,
		                   |	Renault_ПользовательскиеНастройки.ЦветЗаконченойРаботы,
		                   |	Renault_ПользовательскиеНастройки.ЦветРаботыОбед,
		                   |	Renault_ПользовательскиеНастройки.ЦветРаботыПростой,
		                   |	Renault_ПользовательскиеНастройки.ЦветНеЗапланированнойРаботыВТаблице,
		                   |	Renault_ПользовательскиеНастройки.ЦветЗапланированнойРаботыВТаблице,
		                   |	Renault_ПользовательскиеНастройки.ЦветЖалобы,
		                   |	Renault_ПользовательскиеНастройки.ЦветВыделенияФонаПоКлиенту,
		                   |	Renault_ПользовательскиеНастройки.ЦветФонаПодменныйАвто,
		                   |	Renault_ПользовательскиеНастройки.ЦветФонаНакладок,
		                   |	Renault_ПользовательскиеНастройки.ЦветФонаНакладокВнеФокуса,
		                   |	Renault_ПользовательскиеНастройки.ЦветФонаРемонтНовый,
						   |	Renault_ПользовательскиеНастройки.ЦветЗапланированнойВыдачи,
						   |	Renault_ПользовательскиеНастройки.ЦветПросроченнойВыдачи,
						   |	Renault_ПользовательскиеНастройки.ЦветФонаДополнительныхПараметровСменыАвтосервиса
		                   |ИЗ
		                   |	РегистрСведений.Renault_ПользовательскиеНастройки КАК Renault_ПользовательскиеНастройки
		                   |ГДЕ
		                   |	Renault_ПользовательскиеНастройки.Пользователь = &Пользователь");
		Зап.УстановитьПараметр("Пользователь", ВхПользователь);
		Renault_Лицензирование.ПроверитьНаличиеЛицензий();
		Выгрузка = Зап.Выполнить().Выгрузить();
		Если Выгрузка.Количество() = 0 Тогда
			Зап.УстановитьПараметр("Пользователь", Справочники.Пользователи.ПустаяСсылка());
			Выгрузка = Зап.Выполнить().Выгрузить();
			
		КонецЕсли;
		Если Выгрузка.Количество()> 0 Тогда
			
			Мен = Выгрузка[0];
			Для Каждого Кол Из Выгрузка.Колонки ЦИкл
				СтруктураЦветов.Вставить(Кол.Имя, Renault_Открытый.ПолучитьЦветПоСтроке(Мен[Кол.Имя]));
			КонецЦикла;
			
		Иначе
			СтруктураЦветов.Вставить("ЦветФонаМастера", Новый Цвет(204, 255, 204));
			СтруктураЦветов.Вставить("ЦветФонаМастераПланирование", Новый Цвет(245, 245, 245));
			СтруктураЦветов.Вставить("ЦветФонаМастераЗаявка", Новый Цвет(230, 230, 220));
			СтруктураЦветов.Вставить("ЦветФонаМастераВработе", Новый Цвет(200, 250, 160));
			
			СтруктураЦветов.Вставить("ЦветФонаМойка", Новый Цвет(214, 223, 239));
			СтруктураЦветов.Вставить("ЦветФонаМойкаПланирование", Новый Цвет(245, 245, 210));
			СтруктураЦветов.Вставить("ЦветФонаМойкаЗаявка", Новый Цвет(214, 223, 239));
			СтруктураЦветов.Вставить("ЦветФонаМойкаВРаботе", Новый Цвет(200, 250, 160));
			
			СтруктураЦветов.Вставить("ЦветФонаРемонт", Новый Цвет(255, 213, 118));
			СтруктураЦветов.Вставить("ЦветФонаРемонтПланирование", Новый Цвет(255, 213, 118));
			СтруктураЦветов.Вставить("ЦветФонаРемонтЗаявка", Новый Цвет(230, 230, 220));
			СтруктураЦветов.Вставить("ЦветФонаРемонтВработе", Новый Цвет(200, 250, 160));
			
			//Цвета работ:
			СтруктураЦветов.Вставить("ЦветЗапланированнойРаботы", Новый Цвет(160, 255, 80));
			СтруктураЦветов.Вставить("ЦветПросроченнойРаботы", Новый Цвет(255, 115, 115));
			СтруктураЦветов.Вставить("ЦветАктивнойРаботыПлан", Новый Цвет(255,255, 92));
			СтруктураЦветов.Вставить("ЦветАктивнойРаботыФакт", Новый Цвет(255, 153, 70));
			СтруктураЦветов.Вставить("ЦветПриостановленнойРаботы", Новый Цвет(187, 187, 187));
			СтруктураЦветов.Вставить("ЦветЗаконченойРаботы", Новый Цвет(255, 255, 255));
			СтруктураЦветов.Вставить("ЦветРаботыОбед", Новый Цвет(255, 255, 255));
			СтруктураЦветов.Вставить("ЦветРаботыПростой", Новый Цвет(255, 255, 255));
			
			СтруктураЦветов.Вставить("ЦветНеЗапланированнойРаботыВТаблице", Новый Цвет(255, 115, 115));
			СтруктураЦветов.Вставить("ЦветЗапланированнойРаботыВТаблице", Новый Цвет(255, 255, 255));
			СтруктураЦветов.Вставить("ЦветЖалобы", Новый Цвет(127, 0, 55));
			
			СтруктураЦветов.Вставить("ЦветВыделенияФонаПоКлиенту", Новый Цвет(220, 220, 220));
			СтруктураЦветов.Вставить("ЦветФонаПодменныйАвто", Новый Цвет(200, 250, 160));
			СтруктураЦветов.Вставить("ЦветФонаНакладок", Новый Цвет(230, 230, 220));
			СтруктураЦветов.Вставить("ЦветФонаНакладокВнеФокуса", Новый Цвет(255, 255, 255));
			
			СтруктураЦветов.Вставить("ЦветФонаРемонтНовый", Новый Цвет(255, 213, 118));
			
			СтруктураЦветов.Вставить("ЦветЗапланированнойВыдачи", Новый Цвет(130, 225, 50));
			СтруктураЦветов.Вставить("ЦветПросроченнойВыдачи", Новый Цвет(225, 85, 85));
			
			СтруктураЦветов.Вставить("ЦветФонаДополнительныхПараметровСменыАвтосервиса", Новый Цвет(201,230,246));

		КонецЕсли;
		
	Иначе
		
		СтруктураЦветов.Вставить("ЦветФонаМастера", Новый Цвет(204, 255, 204));
		СтруктураЦветов.Вставить("ЦветФонаМастераЗаявка", Новый Цвет(230, 230, 220));
		СтруктураЦветов.Вставить("ЦветФонаМастераВработе", Новый Цвет(200, 250, 160));
		
		СтруктураЦветов.Вставить("ЦветФонаМойка", Новый Цвет(214, 223, 239));
		СтруктураЦветов.Вставить("ЦветФонаМойкаЗаявка", Новый Цвет(214, 223, 239));
		СтруктураЦветов.Вставить("ЦветФонаМойкаВРаботе", Новый Цвет(200, 250, 160));
		
		СтруктураЦветов.Вставить("ЦветФонаРемонт", Новый Цвет(255, 213, 118));
		СтруктураЦветов.Вставить("ЦветФонаРемонтЗаявка", Новый Цвет(230, 230, 220));
		СтруктураЦветов.Вставить("ЦветФонаРемонтВработе", Новый Цвет(200, 250, 160));
		
		//Цвета работ:
		СтруктураЦветов.Вставить("ЦветЗапланированнойРаботы", Новый Цвет(160, 255, 80));
		СтруктураЦветов.Вставить("ЦветПросроченнойРаботы", Новый Цвет(255, 115, 115));
		СтруктураЦветов.Вставить("ЦветАктивнойРаботыПлан", Новый Цвет(255, 255, 92));
		СтруктураЦветов.Вставить("ЦветАктивнойРаботыФакт", Новый Цвет(255, 153, 70));
		СтруктураЦветов.Вставить("ЦветПриостановленнойРаботы", Новый Цвет(187, 187, 187));
		СтруктураЦветов.Вставить("ЦветЗаконченойРаботы", Новый Цвет(255, 255, 255));
		СтруктураЦветов.Вставить("ЦветРаботыОбед", Новый Цвет(255, 255, 255));
		СтруктураЦветов.Вставить("ЦветРаботыПростой", Новый Цвет(255, 255, 255));
		
		СтруктураЦветов.Вставить("ЦветНеЗапланированнойРаботыВТаблице", Новый Цвет(255, 115, 115));
		СтруктураЦветов.Вставить("ЦветЗапланированнойРаботыВТаблице", Новый Цвет(255, 255, 255));
		СтруктураЦветов.Вставить("ЦветЖалобы", Новый Цвет(127, 0, 55));
		
		СтруктураЦветов.Вставить("ЦветВыделенияФонаПоКлиенту", Новый Цвет(220, 220, 220));
		СтруктураЦветов.Вставить("ЦветФонаПодменныйАвто", Новый Цвет(200, 250, 160));
		СтруктураЦветов.Вставить("ЦветФонаНакладок", Новый Цвет(230, 230, 220));
		СтруктураЦветов.Вставить("ЦветФонаНакладокВнеФокуса", Новый Цвет(255,255,255));
		
		СтруктураЦветов.Вставить("ЦветФонаРемонтНовый", Новый Цвет(255, 213, 118));
		СтруктураЦветов.Вставить("ЦветФонаДополнительныхПараметровСменыАвтосервиса", Новый Цвет(201,230,246));

	КонецЕсли;
	
	Возврат СтруктураЦветов;
	
КонецФункции

Функция ПолучитьСтруктуруЦветовВидовРемонта(ВхПользователь) Экспорт
	
	ТЗЦветов = Новый ТаблицаЗначений;
	ТЗЦветов.Колонки.Добавить("ВидРемонта",);
	ТЗЦветов.Колонки.Добавить("ЦветФона", );
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	DMS_ЦветаВидовРемонта.ВидРемонта,
	|	DMS_ЦветаВидовРемонта.ЦветФона
	|ИЗ
	|	РегистрСведений.DMS_ЦветаВидовРемонта КАК DMS_ЦветаВидовРемонта
	|ГДЕ
	|	DMS_ЦветаВидовРемонта.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ВхПользователь);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		
		ТаблицаЦвета = Результат.Выгрузить();
		
		Для Каждого Стр Из ТаблицаЦвета Цикл
			НовСтр = ТЗЦветов.Добавить();
			НовСтр.ВидРемонта = Стр.ВидРемонта;
			НовСтр.ЦветФона = Renault_Открытый.ПолучитьЦветПоСтроке(Стр.ЦветФона);
		КонецЦикла;
		
		Возврат ТЗЦветов;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЗаписьНастроекПользователя(ВхПользователь = Неопределено)Экспорт
	
	Запись = РегистрыСведений.Renault_ПользовательскиеНастройки.СоздатьМенеджерЗаписи();
	Если Не ВхПользователь = Неопределено тогда
		Запись.Пользователь = ВхПользователь;
		Запись.Прочитать();
	КонецЕсли;
	Возврат Запись;
	
КонецФункции

Функция ПолучитьПрочиеНастройки(Пользователь = Неопределено) Экспорт
	
	СтруктураПрочихНастроек = Новый Структура;
	
	Если Не(Пользователь = Неопределено) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Renault_ПользовательскиеНастройки.ПросмотрЦветовДругихПользователей,
		               |	Renault_ПользовательскиеНастройки.ОбратноеНаправлениеЗакраски
		               |ИЗ
		               |	РегистрСведений.Renault_ПользовательскиеНастройки КАК Renault_ПользовательскиеНастройки
		               |ГДЕ
		               |	Renault_ПользовательскиеНастройки.Пользователь.Ссылка = &Пользователь";
					   
		Запрос.УстановитьПараметр("Пользователь", Пользователь);
		Выгрузка = Запрос.Выполнить().Выгрузить();
		Если Выгрузка.Количество() = 0 Тогда
			Запрос.УстановитьПараметр("Пользователь", Справочники.Пользователи.ПустаяСсылка());
			Выгрузка = Запрос.Выполнить().Выгрузить();
		КонецЕсли;
        Если Выгрузка.Количество()> 0 Тогда
			
			Мен = Выгрузка[0];
			Для Каждого Кол Из Выгрузка.Колонки ЦИкл
				СтруктураПрочихНастроек.Вставить(Кол.Имя, Мен[Кол.Имя]);
			КонецЦикла;
			
		Иначе
			
			СтруктураПрочихНастроек.Вставить("ПросмотрЦветовДругихПользователей", Ложь);
			СтруктураПрочихНастроек.Вставить("ОбратноеНаправлениеЗакраски", Ложь);
		
		КонецЕсли;

		
	Иначе
	
		СтруктураПрочихНастроек.Вставить("ПросмотрЦветовДругихПользователей", Ложь);
		СтруктураПрочихНастроек.Вставить("ОбратноеНаправлениеЗакраски", Ложь);
		
	КонецЕсли;
	
	Возврат СтруктураПрочихНастроек;
	
КонецФункции

Функция ПолучитьСтруктуруВысот(Пользователь = Неопределено) Экспорт
	
	СтруктураВысот = Новый Структура;
	
	//Если Не(Пользователь = Неопределено) Тогда
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ
	//	               |	Renault_ПользовательскиеНастройки.ВысотаСтрокиМастера,
	//	               |	Renault_ПользовательскиеНастройки.ВысотаСтрокиЦех,
	//	               |	Renault_ПользовательскиеНастройки.ВысотаСтрокиМойка,
	//	               |	Renault_ПользовательскиеНастройки.ВысотаСтрокиПодменка
	//	               |ИЗ
	//	               |	РегистрСведений.Renault_ПользовательскиеНастройки КАК Renault_ПользовательскиеНастройки
	//	               |ГДЕ
	//	               |	Renault_ПользовательскиеНастройки.Пользователь.Ссылка = &Пользователь";
	//				   
	//	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	//	Выгрузка = Запрос.Выполнить().Выгрузить();
	//	Если Выгрузка.Количество() = 0 Тогда
	//		Запрос.УстановитьПараметр("Пользователь", Справочники.Пользователи.ПустаяСсылка());
	//		Выгрузка = Запрос.Выполнить().Выгрузить();
	//	КонецЕсли;
	//    Если Выгрузка.Количество()> 0 Тогда
	//		
	//		Мен = Выгрузка[0];
	//		Для Каждого Кол Из Выгрузка.Колонки ЦИкл
	//			СтруктураВысот.Вставить(Кол.Имя, Мен[Кол.Имя]);
	//		КонецЦикла;
	//		
	//	Иначе
	//		
	//		СтруктураВысот.Вставить("ВысотаСтрокиМастера", 12);
	//		СтруктураВысот.Вставить("ВысотаСтрокиЦех", 20);
	//		СтруктураВысот.Вставить("ВысотаСтрокиМойка", 12);
	//		СтруктураВысот.Вставить("ВысотаСтрокиПодменка", 12);
	//	
	//	КонецЕсли;

	//	
	//Иначе
	
		СтруктураВысот.Вставить("ВысотаСтрокиМастера", 12);
		СтруктураВысот.Вставить("ВысотаСтрокиЦех", 20);
		СтруктураВысот.Вставить("ВысотаСтрокиМойка", 8);
		СтруктураВысот.Вставить("ВысотаСтрокиПодменка", 8);
		
	//КонецЕсли;
	
	Возврат СтруктураВысот;
		
КонецФункции


// ШИФРОВАНИЕ //////////////////////////////////////////////////////////////////
//
Функция GetUSBKeyComponentLocation()

    Перем Постфикс;
    СистемнаяИнформация = Новый СистемнаяИнформация;

    Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 тогда
        Постфикс = "Win32";
    ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 тогда
        Постфикс = "Win64";
    КонецЕсли;

    Макет = ПолучитьОбщийМакет("КомпонентаЗащиты_Guardant_" + Постфикс);
    Если Макет = Неопределено тогда
        ВызватьИсключение("Макет с образом компоненты защиты не найден");
    КонецЕсли;

    Возврат Макет.ПолноеИмя();

КонецФункции
////////////////////////////////////////////////////////////////////////////////

#Область Планировщик

// Выполняет планирование нового обращения
//
// Параметры:
//	- ДанныеОРаботах - Структура - все необходимые для планирования данные
//	- РабочийДокумент - ДокументСсылка.Renault_CRM_ПриемкаАвтомобиля, ДокументСсылка.Renault_CRM_ЗаявкаНаСервис -
//		переменная для возврата результата планирования, чтобы выделить вновь созданный документ на планировщике
//
Процедура ЗапланироватьРаботы(ДанныеОРаботах, РабочийДокумент = Неопределено, СозданныеДокументы = Неопределено, ОнлайнЗапись = Ложь, ЕстьНаложение = Ложь, Перепланировать = Истина) Экспорт
	
	ОбращениеОбъект		= ДанныеОРаботах.Обращение.ПолучитьОбъект();
	Если ДанныеОРаботах.Свойство("ДилерскийЦентр") Тогда
		ДилерскийЦентр		= ДанныеОРаботах.ДилерскийЦентр;
	КонецЕсли;
	Клиент				= ОбращениеОбъект.Клиент;
	ВидОбращения		= ОбращениеОбъект.ВидОбращения;
	Примечание			= ОбращениеОбъект.Примечание;
	ТекущийАвтомобиль	= ОбращениеОбъект.Автомобиль;
	Автор				= ДанныеОРаботах.Автор;
	ПервичноеОбращение	= (ОбращениеОбъект.ПервичныйПовторный = Перечисления.CRM_ПервичныйПовторный.Первичный);
	ПланироватьРаботу	= ДанныеОРаботах.ПланироватьРаботу;
	ДлительностьПриемки = ДанныеОРаботах.ДлительностьПриемки;
	ДлительностьВыдачи 	= ДанныеОРаботах.ДлительностьВыдачи;
	ПланироватьПриемкуВыдачу = ДанныеОРаботах.ПланироватьПриемкуВыдачу;
	Если ДанныеОРаботах.Свойство("НЕСоздаватьПриемкуВыдачу") Тогда
		НЕСоздаватьПриемкуВыдачу = ДанныеОРаботах.НЕСоздаватьПриемкуВыдачу;
	Иначе
		НЕСоздаватьПриемкуВыдачу = Ложь;
	КонецЕсли;
	Автоработы			= ДанныеОРаботах.Автоработы;
	Запчасти			= ДанныеОРаботах.Запчасти;
	ИсполнительЦех		= ДанныеОРаботах.ИсполнительЦех;
	ВремяНачала			= ДанныеОРаботах.ВремяНачала;
	ОбращениеСсылка		= ОбращениеОбъект.Ссылка;
	ТолькоРаботающие	= ДанныеОРаботах.ТолькоРаботающие;
	Пост = Неопределено;
	Если ДанныеОРаботах.Свойство("ЭтоПерепланировка") Тогда
		ЭтоПерепланировка		= ДанныеОРаботах.ЭтоПерепланировка;
		Если Автоработы.Количество() <> 0 И ЭтоПерепланировка Тогда
			Пост = Автоработы[0].Машиноместо;
		КонецЕсли;
	Иначе
		ЭтоПерепланировка		= Ложь;
	КонецЕсли;
	
	ВтораяЗаявка = Неопределено;
	ДанныеОРаботах.Свойство("ВтораяЗаявка", ВтораяЗаявка);
	ЗапчастиВторая = Неопределено;
	ДанныеОРаботах.Свойство("ЗапчастиВторая", ЗапчастиВторая);
	Заявка2Ссылка = Неопределено;
	ДанныеОРаботах.Свойство("Заявка2Ссылка", Заявка2Ссылка);
	
	ТретьяЗаявка = Неопределено;
	ДанныеОРаботах.Свойство("ТретьяЗаявка", ТретьяЗаявка);
	ЗапчастиТретья = Неопределено;
	ДанныеОРаботах.Свойство("ЗапчастиТретья", ЗапчастиТретья);
	ЧетвертаяЗаявка = Неопределено;
	Заявка3Ссылка = Неопределено;
	ДанныеОРаботах.Свойство("Заявка3Ссылка", Заявка3Ссылка);
	
	ЧетвертаяЗаявка = Неопределено;
	ДанныеОРаботах.Свойство("ЧетвертаяЗаявка", ЧетвертаяЗаявка);
	ЗапчастиЧетвертая = Неопределено;
	ДанныеОРаботах.Свойство("ЗапчастиЧетвертая", ЗапчастиЧетвертая);
	Заявка4Ссылка = Неопределено;
	ДанныеОРаботах.Свойство("Заявка4Ссылка", Заявка4Ссылка);
	
	ПланироватьВыдачуНаПриемщика = Ложь;
	Если ДанныеОРаботах.Свойство("ПланироватьВыдачуНаПриемщика") Тогда
		ПланироватьВыдачуНаПриемщика = ДанныеОРаботах.ПланироватьВыдачуНаПриемщика;
	КонецЕсли; 
	
	СРазбивкойНаЭтапы = Ложь;
	Если ДанныеОРаботах.Свойство("СРазбивкойНаЭтапы")  Тогда
		СРазбивкойНаЭтапы = ДанныеОРаботах.СРазбивкойНаЭтапы;
	КонецЕсли; 
	
	НеПланироватьВторуюЗаявку = Ложь;
	Если ДанныеОРаботах.Свойство("НеПланироватьВторуюЗаявку") Тогда
		НеПланироватьВторуюЗаявку = ДанныеОРаботах.НеПланироватьВторуюЗаявку;
	КонецЕсли; 
	
	НеПланироватьТретьюЗаявку = Ложь;
	Если ДанныеОРаботах.Свойство("НеПланироватьТретьюЗаявку") Тогда
		НеПланироватьТретьюЗаявку = ДанныеОРаботах.НеПланироватьТретьюЗаявку;
	КонецЕсли;
	
	НеПланироватьЧетвертуюЗаявку = Ложь;
	Если ДанныеОРаботах.Свойство("НеПланироватьЧетвертуюЗаявку") Тогда
		НеПланироватьЧетвертуюЗаявку = ДанныеОРаботах.НеПланироватьЧетвертуюЗаявку;
	КонецЕсли; 
	
	ПриемкаСсылка = Неопределено;
	ДанныеОРаботах.Свойство("ПриемкаСсылка", ПриемкаСсылка);
	ВыдачаСсылка = Неопределено;
	ДанныеОРаботах.Свойство("ВыдачаСсылка", ВыдачаСсылка);
	
	СоздаватьПриемуВыдачу = НЕ ВидОбращения.БезПриемкиИВыдачи;
	
	НачатьТранзакцию();
	
	//+++
	//Исправление ошибки когда сделаны доп работы, он делает 2 заявки, 
	//Получим заявку, если она есть и будем ее редактировать, а не создавать повторную
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Renault_CRM_ЗаявкаНаСервис.Ссылка
		|ИЗ
		|	Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
		|ГДЕ
		|	Renault_CRM_ЗаявкаНаСервис.Обращение = &Обращение
		|	И Renault_CRM_ЗаявкаНаСервис.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Обращение", ДанныеОРаботах.Обращение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Заявка = Неопределено;	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Заявка = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	КонецЦикла;
	//---
	
	// Приемка
	Приемка = Неопределено;
	Если СоздаватьПриемуВыдачу И НЕ НЕСоздаватьПриемкуВыдачу Тогда
		
		Если ТипЗнч(ИсполнительЦех) = Тип("СправочникСсылка.Сотрудники") И ЗначениеЗаполнено(ИсполнительЦех) Тогда			
			// Оператор сам выбрал ячейку в планировщике, поэтому создаем приемку принудительно на это время
			СвободныйИнтервал = Новый Структура;
			СвободныйИнтервал.Вставить("Цех", ИсполнительЦех);
			СвободныйИнтервал.Вставить("ВремяНачала", ВремяНачала);
		ИначеЕсли НЕ ПланироватьПриемкуВыдачу Тогда 
			// Приемки не планируются, искать свободный интервал нет смысла, просто создаем документ
			СвободныйИнтервал = Новый Структура;
			СвободныйИнтервал.Вставить("Цех", Справочники.Сотрудники.ПустаяСсылка());
			СвободныйИнтервал.Вставить("ВремяНачала", ВремяНачала - ДлительностьПриемки);
		Иначе
			// Оператор выбрал цех и время работ, значит приемку надо разместить до этой даты на любого свободного сотрудника
			// Причем, учесть интервал между предыдущей приемкой и этой
			Парам = Новый Структура("ТолькоРаботающие", ТолькоРаботающие);
			ВремяНачала = ВремяНачала - ДлительностьПриемки - ДилерскийЦентр.Автосервис_ИнтервалВПриемкахВыдачах * 60 * 2;
			СвободныйИнтервал = ПолучитьСвободныйИнтервал(ВремяНачала, "Сотрудники", ДлительностьПриемки, Парам);
			СвободныйИнтервал.ВремяНачала = СвободныйИнтервал.ВремяНачала + ДилерскийЦентр.Автосервис_ИнтервалВПриемкахВыдачах * 60;
		КонецЕсли;		
			
		Приемка = Документы.Renault_CRM_ПриемкаАвтомобиля.СоздатьДокумент();
		Приемка.Дата 			= ТекущаяДата();
		Приемка.Клиент 			= Клиент;
		Приемка.VIN 			= ТекущийАвтомобиль.VIN;
		Приемка.Автомобиль 		= ТекущийАвтомобиль;
		Приемка.ВремяНачала 	= СвободныйИнтервал.ВремяНачала;
		Приемка.ВремяОкончания 	= СвободныйИнтервал.ВремяНачала + ДлительностьПриемки * 3600;
		Приемка.Автор 			= Автор;
		Приемка.Обращение 		= ОбращениеСсылка;
		Приемка.Машиноместо		= СвободныйИнтервал.Цех;
		Приемка.ДилерскийЦентр 	= ДилерскийЦентр;
		Приемка.Состояние 		= Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Заявка;
		Приемка.Примечание 		= Примечание;
		Приемка.ХозОперация 	= Справочники.ХозОперации.ПрочиеДокументы;
		
		Приемка.Записать(РежимЗаписиДокумента.Запись);	
			
		Если ПланироватьПриемкуВыдачу Тогда	
			ЗаписатьПриемкуВыдачуВРегистр(Приемка);		
			ВремяНачала = Приемка.ВремяОкончания;		
			РабочийДокумент = Приемка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	// Заявка на работу и вторая заявка (если есть)
		
	// У нас может быть одна или две заявки, поэтому обработаем их в цикле
	РаботыПоЗаявкам = Новый Массив;
	
	ТекущаяЗаявка = Новый Структура();
	ТекущаяЗаявка.Вставить("Работы", Автоработы);
	ТекущаяЗаявка.Вставить("Запчасти", Запчасти);
	ТекущаяЗаявка.Вставить("Планировать", Истина);
	ТекущаяЗаявка.Вставить("ВидРемонта", ДанныеОРаботах.ВидРемонта1);
	ТекущаяЗаявка.Вставить("Нормочас", ДанныеОРаботах.Нормочас1);
	ТекущаяЗаявка.Вставить("ТипЦен", ДанныеОРаботах.ТипЦен1);
	ТекущаяЗаявка.Вставить("ЗаявкаСсылка", ?(Заявка = Неопределено, Неопределено, Заявка.Ссылка));
	РаботыПоЗаявкам.Добавить(ТекущаяЗаявка);
	
	Если ВтораяЗаявка <> Неопределено И ВтораяЗаявка.Количество() > 0
			ИЛИ ЭтоПерепланировка И ЗначениеЗаполнено(Заявка2Ссылка) Тогда
		ТекущаяЗаявка = Новый Структура();
		ТекущаяЗаявка.Вставить("Работы", ВтораяЗаявка);
		ТекущаяЗаявка.Вставить("Запчасти", ЗапчастиВторая);
		ТекущаяЗаявка.Вставить("Планировать", НЕ НеПланироватьВторуюЗаявку);
		ТекущаяЗаявка.Вставить("ВидРемонта", ДанныеОРаботах.ВидРемонта2);
		ТекущаяЗаявка.Вставить("Нормочас", ДанныеОРаботах.Нормочас2);
		ТекущаяЗаявка.Вставить("ТипЦен", ДанныеОРаботах.ТипЦен2);
		ТекущаяЗаявка.Вставить("ЗаявкаСсылка", Заявка2Ссылка);
		РаботыПоЗаявкам.Добавить(ТекущаяЗаявка);
	КонецЕсли;
	
	Если ТретьяЗаявка <> Неопределено И ТретьяЗаявка.Количество() > 0
			ИЛИ ЭтоПерепланировка И ЗначениеЗаполнено(Заявка3Ссылка) Тогда
		ТекущаяЗаявка = Новый Структура();
		ТекущаяЗаявка.Вставить("Работы", ТретьяЗаявка);
		ТекущаяЗаявка.Вставить("Запчасти", ЗапчастиТретья);	
		ТекущаяЗаявка.Вставить("Планировать", НЕ НеПланироватьТретьюЗаявку);
		ТекущаяЗаявка.Вставить("ВидРемонта", ДанныеОРаботах.ВидРемонта3);
		ТекущаяЗаявка.Вставить("Нормочас", ДанныеОРаботах.Нормочас3);
		ТекущаяЗаявка.Вставить("ТипЦен", ДанныеОРаботах.ТипЦен3);
		ТекущаяЗаявка.Вставить("ЗаявкаСсылка", Заявка3Ссылка);
		РаботыПоЗаявкам.Добавить(ТекущаяЗаявка);
	КонецЕсли;
	
	Если ЧетвертаяЗаявка <> Неопределено И ЧетвертаяЗаявка.Количество() > 0
			ИЛИ ЭтоПерепланировка И ЗначениеЗаполнено(Заявка4Ссылка) Тогда
		ТекущаяЗаявка = Новый Структура();
		ТекущаяЗаявка.Вставить("Работы", ЧетвертаяЗаявка);
		ТекущаяЗаявка.Вставить("Запчасти", ЗапчастиЧетвертая);	
		ТекущаяЗаявка.Вставить("Планировать", НЕ НеПланироватьЧетвертуюЗаявку);
		ТекущаяЗаявка.Вставить("ВидРемонта", ДанныеОРаботах.ВидРемонта4);
		ТекущаяЗаявка.Вставить("Нормочас", ДанныеОРаботах.Нормочас4);
		ТекущаяЗаявка.Вставить("ТипЦен", ДанныеОРаботах.ТипЦен4);
		ТекущаяЗаявка.Вставить("ЗаявкаСсылка", Заявка4Ссылка);
		РаботыПоЗаявкам.Добавить(ТекущаяЗаявка);
	КонецЕсли;
	
	ПоследнийПост = Справочники.Цеха.ПустаяСсылка();
	
	Для ИндексПоЗаявкам = 0 По РаботыПоЗаявкам.ВГраница() Цикл
		ТекущаяЗаявка = РаботыПоЗаявкам[ИндексПоЗаявкам];
		ТекущиеАвтоработы = ТекущаяЗаявка.Работы;
		ТекущиеЗапчасти = ТекущаяЗаявка.Запчасти;
		ЗаявкаСсылка = ТекущаяЗаявка.ЗаявкаСсылка;
		
		Если ТекущиеАвтоработы.Количество() = 0 И НЕ ЭтоПерепланировка Тогда
			Продолжить;
		КонецЕсли; 
		//+++
		//Заявка = Документы.Renault_CRM_ЗаявкаНаСервис.СоздатьДокумент();
		//только для первой заявки, для остальных всегда делаем новый док
		Если ИндексПоЗаявкам = 0 ИЛИ ЭтоПерепланировка Тогда 
			Если ЗаявкаСсылка = Неопределено ИЛИ ЗаявкаСсылка = Документы.Renault_CRM_ЗаявкаНаСервис.ПустаяСсылка() Тогда
				Заявка = Документы.Renault_CRM_ЗаявкаНаСервис.СоздатьДокумент();
			Иначе 
				Заявка = ЗаявкаСсылка.ПолучитьОбъект();
				Заявка.Работы.Очистить();
				Заявка.Товары.Очистить();
				Заявка.Этапы.Очистить();
				Заявка.СоставЭтапа.Очистить();
				Заявка.СчетаНаОплату.Очистить();
				//Заявка.ДополнительноеОборудование.Очистить();
				Заявка.ВыполнениеРабот.Очистить();			
			КонецЕсли;
		Иначе 
			Заявка = Документы.Renault_CRM_ЗаявкаНаСервис.СоздатьДокумент();	
		КонецЕсли;
		//---
		ЗаполнитьЗначенияСвойств(Заявка, ТекущаяЗаявка, "ВидРемонта,Нормочас,ТипЦен");
		Если ДанныеОРаботах.КлиентОтличаетсяОтВладельца Тогда
			Заявка.Плательщик = ДанныеОРаботах.Владелец;
		Иначе
			Заявка.КлиентЯвляетсяПлательщиком = Истина;
		КонецЕсли; 
		
		ДлительностьМоек = 0;
		ДлительностьРабот = 0;
	    СтоимостьРабот = 0;
		СуммаСкидкиРабот = 0;
		
		ОбработанныеМойки = Новый Массив;
		
		//DMSREN-974
		РабочийДень = ПолучитьНачалоИКонецРабочегоДняДЦ(ДилерскийЦентр, ВремяНачала);
		//---
		Для Инд = 0 По ТекущиеАвтоработы.Количество() - 1 Цикл	
			СтрокаТаблицы = ТекущиеАвтоработы[Инд]; 
			
			Если СтрокаТаблицы.Работа = Справочники.Автоработы.Приемка 
				ИЛИ СтрокаТаблицы.Работа = Справочники.Автоработы.Выдача Тогда
				Продолжить;
			КонецЕсли;	
			
			Если СтрокаТаблицы.ЭтоМойка Тогда
				// Мойки планируем сразу, поскольку они ссылаются на другой РабочийДокумент
				// Точнее мы и планируем документ ЗаявкаНаМойку, здесь же в ТЧ работы мы оставляем мойки
				// чтобы можно было оформить Заказ-наряд
				ДлительностьМоек = ДлительностьМоек + СтрокаТаблицы.Длительность;
				ЗаявкаНаМойку = НайтиЗаявкуНаМойку(ОбращениеСсылка, ОбработанныеМойки);
				Если ЗаявкаНаМойку <> Неопределено Тогда
					// Поскольку пользователь уже явно выбрал мойку, то ищем свободное время только по этой мойке
					СписокМашиномест = Новый Массив;
					СписокМашиномест.Добавить(ЗаявкаНаМойку.Машиноместо);
					ДопПараметры = Новый Структура("СписокМашиномест,ТолькоРаботающие", СписокМашиномест, ТолькоРаботающие);
					
					Если ПланироватьРаботу Тогда
						ВремяНачала = ВремяНачала + ДилерскийЦентр.Автосервис_ИнтервалНаПостах * 60;
						СвободныйИнтервал = ПолучитьСвободныйИнтервал(ВремяНачала, "Мойки", ЗаявкаНаМойку.Длительность, ДопПараметры);
					Иначе
						СвободныйИнтервал = Новый Структура;
						СвободныйИнтервал.Вставить("Цех", ЗаявкаНаМойку.Машиноместо);
						СвободныйИнтервал.Вставить("ВремяНачала", ВремяНачала - ЗаявкаНаМойку.Длительность * 3600); 
					КонецЕсли;
					
					ВремяНачала = СвободныйИнтервал.ВремяНачала;
					РабочийДень1 = ПолучитьНачалоИКонецРабочегоДняДЦ(ДилерскийЦентр, ВремяНачала);		
					Если СвободныйИнтервал.ВремяНачала > РабочийДень1.ВремяНачала И ПланироватьРаботу
						И СвободныйИнтервал.ВремяНачалаИнтервала + ДилерскийЦентр.Автосервис_ИнтервалНаПостах * 60 > ВремяНачала Тогда
						ВремяНачала = СвободныйИнтервал.ВремяНачалаИнтервала + ДилерскийЦентр.Автосервис_ИнтервалНаПостах * 60;
					КонецЕсли; 
	
					ЗаявкаНаМойкуОбъект = ЗаявкаНаМойку.ПолучитьОбъект();
					ЗаявкаНаМойкуОбъект.ВремяНачала = ВремяНачала;
					ЗаявкаНаМойкуОбъект.ВремяОкончания = ЗаявкаНаМойкуОбъект.ВремяНачала + ЗаявкаНаМойку.Длительность * 3600;
					ЗаявкаНаМойкуОбъект.Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Заявка;
					ЗаявкаНаМойкуОбъект.Записать();
					
					Если ПланироватьРаботу Тогда
						ЗаписатьПриемкуВыдачуВРегистр(ЗаявкаНаМойкуОбъект);	
					КонецЕсли; 
					
					ВремяНачала = ЗаявкаНаМойкуОбъект.ВремяОкончания;
					ОбработанныеМойки.Добавить(ЗаявкаНаМойку);
				КонецЕсли;
			КонецЕсли; 
			
			ДлительностьРабот	= ДлительностьРабот + СтрокаТаблицы.Длительность + (ДилерскийЦентр.Автосервис_ИнтервалНаПостах / 60); //+-/Блинков в рамках заявки DMSREN-724 (При планировании работы к времени самой работы прибавляется интервал на постах)
			СтоимостьРабот		= СтоимостьРабот + СтрокаТаблицы.Сумма;
			СуммаСкидкиРабот	= СуммаСкидкиРабот + СтрокаТаблицы.СуммаСкидки;
			
			НоваяСтрокаРабот	= Заявка.Работы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаРабот, СтрокаТаблицы);
			НоваяСтрокаРабот.Сумма = СтрокаТаблицы.Сумма;
		КонецЦикла;
		
		ВремяНачала = ?(ВремяНачала > ТекущаяДата(), ВремяНачала, ТекущаяДата());
	
		Для каждого ТекСтрока Из ТекущиеЗапчасти Цикл
			НоваяСтрока = Заявка.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЦикла;
		
		Если ПланироватьРаботу И ТипЗнч(ИсполнительЦех) = Тип("СправочникСсылка.Цеха") И ЗначениеЗаполнено(ИсполнительЦех) Тогда
			// Явно указали на планировщике пост и время начала
			СвободныйИнтервал = Новый Структура;
			СвободныйИнтервал.Вставить("Цех", ИсполнительЦех);
			СвободныйИнтервал.Вставить("ВремяНачала", ВремяНачала);
			СвободныйИнтервал.Вставить("ВремяНачалаИнтервала", ВремяНачала);
			//Отбор = Новый Структура;
			//Отбор.Вставить("ОнлайнЗапись",Истина);
			//ОнлайнПосты = ДилерскийЦентр.АвтосервисЦеха.НайтиСтроки(Отбор);
			//Для Каждого ОнлайнПост Из ОнлайнПосты Цикл 
			//	Если ОнлайнПост.Цех = ИсполнительЦех Тогда
			//		ОтменитьТранзакцию();
			//		ВызватьИсключение("Выбран пост под онлайн запись. Запись невозможна");
			//		Прервать;
			//	КонецЕсли;
			//КонецЦикла;
			//+++ DMSREN-845
			//Проверим укладывается ли работа до конца дня
			Если ТекущиеАвтоработы.Количество()>0 Тогда 
				РабочийДень1 = ПолучитьНачалоИКонецРабочегоДняДЦ(ДилерскийЦентр, ВремяНачала);
				Если ВремяНачала + ТекущиеАвтоработы[0].Длительность*3600 + ДилерскийЦентр.Автосервис_ИнтервалНаПостах * 60>РабочийДень1.ВремяОкончания Тогда 
					ОтменитьТранзакцию();
					ВызватьИсключение("Выберите другое время. Данная работа не укладывается в текущий день");
					Прервать;
				КонецЕсли;
			КонецЕсли;
			//---
		ИначеЕсли ПланироватьРаботу Тогда 
			Парам = Новый Структура("ТолькоРаботающие", ТолькоРаботающие);
			Если ОнлайнЗапись Тогда 
				Парам.Вставить("Онлайн",ОнлайнЗапись);
			КонецЕсли;
			Если НЕ ЭтоПерепланировка Тогда
				
				ВремяНачала = ВремяНачала + ДилерскийЦентр.Автосервис_ИнтервалНаПостах * 60;
		
				//DMSREN-913 то что закоменчено это относится к задаче
				Парам.Вставить("ПриоритетЦех", ПоследнийПост);
				СвободныйИнтервал = ПолучитьСвободныйИнтервал(ВремяНачала, "Цеха", ДлительностьРабот - ДлительностьМоек, Парам);
				
				// Беседин 12.01.22 заявки 1419, 1420
				Если НЕ ЗначениеЗаполнено(СвободныйИнтервал) Тогда
					ОтменитьТранзакцию();  // сообщение что не так должно быть в другом месте					
					Возврат;
				КонецЕсли;  // Беседин кон
					
				ПоследнийПост = СвободныйИнтервал.Цех;
				//ДлительностьРаботы = ДлительностьРабот - ДлительностьМоек;
				//ОкруглитьДлительность(ДлительностьРаботы);
				//СвободныйИнтервал = ПолучитьСвободныйИнтервал(ВремяНачала, "Цеха", ДлительностьРаботы, Парам);				
				//---
			Иначе
				//DMSREN-974
				//Если по заявке не укладываемся в текущий день, то переносим работы на следующий
				Если РабочийДень.ВремяОкончания < ВремяНачала + ДлительностьРабот * 3600 Тогда 
					СледРабочийДень = ПолучитьНачалоИКонецРабочегоДняДЦ(ДилерскийЦентр, ВремяНачала+24*60*60);
					ВремяНачала =  СледРабочийДень.ВремяНачала;
				КонецЕсли;
				//
				СвободныйИнтервал = Новый Структура;
				СвободныйИнтервал.Вставить("Цех", Пост);
				СвободныйИнтервал.Вставить("ВремяНачала", ВремяНачала);
				СвободныйИнтервал.Вставить("ВремяНачалаИнтервала", ВремяНачала);
				СвободныйИнтервал.Вставить("КоличествоСегментов", 1);
				СвободныйИнтервал.Вставить("ТаблицаСегментов", Новый ТаблицаЗначений);
			КонецЕсли;
		Иначе
			// Не планируем работу. Только создаем документ
			СвободныйИнтервал = Новый Структура;
			СвободныйИнтервал.Вставить("Цех", Справочники.Цеха.ПустаяСсылка());
			СвободныйИнтервал.Вставить("ВремяНачала", ВремяНачала);
			СвободныйИнтервал.Вставить("ВремяНачалаИнтервала", ВремяНачала);
			СвободныйИнтервал.Вставить("КоличествоСегментов", 1);
			СвободныйИнтервал.Вставить("ТаблицаСегментов", Новый ТаблицаЗначений);
		КонецЕсли; 
		
		ВремяНачала = СвободныйИнтервал.ВремяНачала;
		РабочийДень1 = ПолучитьНачалоИКонецРабочегоДняДЦ(ДилерскийЦентр, ВремяНачала);		
		Если СвободныйИнтервал.ВремяНачала > РабочийДень1.ВремяНачала И ПланироватьРаботу
			И СвободныйИнтервал.ВремяНачалаИнтервала + ДилерскийЦентр.Автосервис_ИнтервалНаПостах * 60 > ВремяНачала Тогда
			ВремяНачала = СвободныйИнтервал.ВремяНачалаИнтервала + ДилерскийЦентр.Автосервис_ИнтервалНаПостах * 60;
		КонецЕсли;
		
		Заявка.Дата = ТекущаяДата();
		Заявка.ДилерскийЦентр = ДилерскийЦентр;
		Заявка.Автор = Автор;
		Заявка.Клиент = Клиент;
		Заявка.ВремяНачала = ВремяНачала;
		Заявка.ВремяОкончания = Заявка.ВремяНачала + (ДлительностьРабот - ДлительностьМоек) * 3600;
		Заявка.Автомобиль = ТекущийАвтомобиль;
		Заявка.VIN = ТекущийАвтомобиль.VIN;
		Заявка.Обращение = ОбращениеСсылка;
		Заявка.ХозОперация = Справочники.ХозОперации.ПрочиеДокументы;
		Заявка.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Заявка;
		Заявка.СуммаРаботВсего = СтоимостьРабот;
		Заявка.ОбщаяДлительность = ДлительностьРабот;
		Заявка.СуммаСкидкиРаботыВсего = СуммаСкидкиРабот;
		Заявка.СтоимостьВсего = Заявка.Работы.Итог("Сумма") + Заявка.Товары.Итог("Сумма");
			
		ТекВремяНачала = Заявка.ВремяНачала;
		Для Инд = 0 По Заявка.Работы.Количество() - 1 Цикл
			ТекСтрока = Заявка.Работы[Инд]; 
			ТекСтрока.Машиноместо = СвободныйИнтервал.Цех;
			ТекСтрока.ИдентификаторРаботы = Новый УникальныйИдентификатор();
			ТекСтрока.ВремяНачала = ТекВремяНачала;
			//DMSREN-913
			//ОкруглитьДлительность(ТекСтрока.Длительность);
			//---
			ТекСтрока.ВремяОкончания = ТекВремяНачала + ТекСтрока.Длительность * 3600;
			ТекВремяНачала = ТекСтрока.ВремяОкончания;
		КонецЦикла;
		
		Если ПланироватьРаботу И ТекущаяЗаявка.Планировать Тогда
			// Создаем этапы и записываем документ			
			Если СРазбивкойНаЭтапы Тогда
				ВРазныеЭтапы(Заявка, СвободныйИнтервал.Цех, , Перепланировать);
			Иначе
				ВОдинЭтап(Заявка, СвободныйИнтервал.Цех, , Перепланировать);
			КонецЕсли; 
		
			ВремяНачала = Заявка.ВремяОкончания;
		Иначе
			// Создаем один этап и записываем документ, планы в регистр не пишем
			ВОдинЭтап(Заявка, СвободныйИнтервал.Цех, Ложь, Перепланировать);
			Если ТекущаяЗаявка.Планировать Тогда
				ВремяНачала = Заявка.ВремяОкончания;
			КонецЕсли; 
		КонецЕсли; 
		
		Если РабочийДокумент = Неопределено Тогда
			РабочийДокумент = Заявка.Ссылка;
		КонецЕсли; 
	КонецЦикла;
		
	// Выдача
	Выдача = Неопределено;
	Если СоздаватьПриемуВыдачу И Перепланировать Тогда
		
		Если ПланироватьПриемкуВыдачу Тогда
			ДопПараметры = Новый Структура;
			Если ПланироватьВыдачуНаПриемщика Тогда
				СписокМашиномест = Новый Массив;
				СписокМашиномест.Добавить(Приемка.Машиноместо);
				ДопПараметры.Вставить("СписокМашиномест", СписокМашиномест);
			КонецЕсли; 
			ДопПараметры.Вставить("ТолькоРаботающие", ТолькоРаботающие);
			
			ВремяНачала = ВремяНачала + ДилерскийЦентр.Автосервис_ИнтервалВПриемкахВыдачах * 60;
			СвободныйИнтервал = ПолучитьСвободныйИнтервал(ВремяНачала, "Сотрудники", ДлительностьВыдачи, ДопПараметры);
			
			// Беседин 12.01.22 заявки 1419, 1420
			Если НЕ ЗначениеЗаполнено(СвободныйИнтервал) Тогда
				ОтменитьТранзакцию();  // сообщение что не так должно быть в другом месте					
				Возврат;
			КонецЕсли;  // Беседин кон
			
			ВремяНачала = СвободныйИнтервал.ВремяНачала;
			РабочийДень1 = ПолучитьНачалоИКонецРабочегоДняДЦ(ДилерскийЦентр, ВремяНачала);
			Если СвободныйИнтервал.ВремяНачала > РабочийДень1.ВремяНачала 
				И СвободныйИнтервал.ВремяНачалаИнтервала + ДилерскийЦентр.Автосервис_ИнтервалВПриемкахВыдачах * 60 > ВремяНачала Тогда
				ВремяНачала = СвободныйИнтервал.ВремяНачалаИнтервала + ДилерскийЦентр.Автосервис_ИнтервалВПриемкахВыдачах * 60;
			КонецЕсли;	
			ТекЦехВыдачи = СвободныйИнтервал.Цех
		Иначе
			ТекЦехВыдачи = Справочники.Сотрудники.ПустаяСсылка();
		КонецЕсли;
		
		Если ВыдачаСсылка = Неопределено Тогда
			Выдача				= Документы.Renault_CRM_ВыдачаАвтомобиля.СоздатьДокумент();
			Выдача.Машиноместо		= ТекЦехВыдачи;
		Иначе
			Выдача				= ВыдачаСсылка.ПолучитьОбъект();
			//Выдача.Машиноместо		= ТекЦехВыдачи; //Уже заполнено
		КонецЕсли;
		Выдача.Дата				= ТекущаяДата();
		Выдача.ДилерскийЦентр	= ДилерскийЦентр;
		Выдача.Автор			= Автор;
		Выдача.Клиент			= Клиент;
		Выдача.ВремяНачала		= ВремяНачала;
		Выдача.ВремяОкончания	= Выдача.ВремяНачала + ДлительностьВыдачи * 3600;
		Выдача.Автомобиль		= ТекущийАвтомобиль;
		Выдача.VIN				= ТекущийАвтомобиль.VIN;
		Выдача.Обращение		= ОбращениеСсылка;
		Выдача.ХозОперация		= Справочники.ХозОперации.ПрочиеДокументы;
		Выдача.Состояние		= Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Заявка;
		Выдача.Примечание		= Примечание;
		Выдача.Записать(РежимЗаписиДокумента.Запись);
		
		Если ПланироватьПриемкуВыдачу Тогда			
			ЗаписатьПриемкуВыдачуВРегистр(Выдача);
		КонецЕсли;	
	КонецЕсли;
	СозданныеДокументы = Новый Структура;
	СозданныеДокументы.Вставить("Приемка",Приемка);
	СозданныеДокументы.Вставить("Заявка", Заявка);
	СозданныеДокументы.Вставить("Выдача",Выдача);
	
	ЗафиксироватьТранзакцию();
	
	ЕстьНаложение = ЕстьНаложениеЭтапов(ОбращениеСсылка);
	
КонецПроцедуры

Функция ЕстьНаложениеЭтапов(Обращение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_АвтосервисПланРабот.Обращение,
	|	Renault_АвтосервисПланРабот.РабочийДокумент,
	|	Renault_АвтосервисПланРабот.ЭтапРабот,
	|	Renault_АвтосервисПланРабот.id,
	|	Renault_АвтосервисПланРабот.ВремяНачала,
	|	Renault_АвтосервисПланРабот.ВремяОкончания,
	|	ВЫБОР
	|		КОГДА Renault_АвтосервисПланРабот1.ВремяНачала >= Renault_АвтосервисПланРабот.ВремяОкончания
	|				И Renault_АвтосервисПланРабот1.ВремяОкончания > Renault_АвтосервисПланРабот.ВремяОкончания
	|			ТОГДА ЛОЖЬ
	|		КОГДА Renault_АвтосервисПланРабот1.ВремяНачала < Renault_АвтосервисПланРабот.ВремяНачала
	|				И Renault_АвтосервисПланРабот1.ВремяОкончания <= Renault_АвтосервисПланРабот.ВремяНачала
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВремяНачала1
	|ИЗ
	|	РегистрСведений.Renault_АвтосервисПланРабот КАК Renault_АвтосервисПланРабот
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_АвтосервисПланРабот КАК Renault_АвтосервисПланРабот1
	//|		ПО Renault_АвтосервисПланРабот.Обращение = Renault_АвтосервисПланРабот1.Обращение
	|		ПО Renault_АвтосервисПланРабот.id <> Renault_АвтосервисПланРабот1.id
	|			И Renault_АвтосервисПланРабот.Цех = Renault_АвтосервисПланРабот1.Цех
	|			И (ВЫБОР
	|				КОГДА Renault_АвтосервисПланРабот1.ВремяНачала >= Renault_АвтосервисПланРабот.ВремяОкончания
	|						И Renault_АвтосервисПланРабот1.ВремяОкончания > Renault_АвтосервисПланРабот.ВремяОкончания
	|					ТОГДА ЛОЖЬ
	|				КОГДА Renault_АвтосервисПланРабот1.ВремяНачала < Renault_АвтосервисПланРабот.ВремяНачала
	|						И Renault_АвтосервисПланРабот1.ВремяОкончания <= Renault_АвтосервисПланРабот.ВремяНачала
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|ГДЕ
	|	Renault_АвтосервисПланРабот.Обращение = &Обращение";
	Запрос.УстановитьПараметр("Обращение", Обращение);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Процедура ВОдинЭтап(ДокОбъект, Цех, ЗаписыватьПланВРегистры = Истина, Перепланировать = Истина)
	
	Если Перепланировать Тогда
		Для Каждого СтрокаЭтапа ИЗ ДокОбъект.Этапы Цикл
			ОчиститьПланПоЭтапу(ДокОбъект, СтрокаЭтапа.IDЭтапа);
		КонецЦикла;
	КонецЕсли;
	
	ДокОбъект.Этапы.Очистить();
	ДокОбъект.СоставЭтапа.Очистить();
	
	НовыйЭтап = ДокОбъект.Этапы.Добавить();	
	НовыйЭтап.Этап = "Этап 1";
	НовыйЭтап.IDЭтапа = Новый УникальныйИдентификатор();
	НовыйЭтап.НачалоЭтапа	= ДокОбъект.ВремяНачала;
	НовыйЭтап.КонецЭтапа	= ДокОбъект.ВремяОкончания;
	НовыйЭтап.Цех			= Цех;
	
	ОбщаяДлительность = 0;
	
	Для Инд = 0 По ДокОбъект.Работы.Количество() - 1 Цикл		
		ТекРабота = ДокОбъект.Работы[Инд]; 
		ТекРабота.Машиноместо = Цех;
		ТекДлительность = ТекРабота.ВремяОкончания - ТекРабота.ВремяНачала;
		
		Если НЕ ЗначениеЗаполнено(ТекРабота.IDРаботы) Тогда			
			ТекРабота.IDРаботы = Новый УникальныйИдентификатор();			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекРабота.Длительность) Тогда
			ТекРабота.Длительность = ТекДлительность / 3600;
		КонецЕсли; 
		
		НовыйСостав = ДокОбъект.СоставЭтапа.Добавить();		
		НовыйСостав.IDЭтапа = НовыйЭтап.IDЭтапа;		
		НовыйСостав.Работа = ТекРабота.Работа;
		
		НовыйСостав.IDРаботы = ТекРабота.IDРаботы;
		ОбщаяДлительность = ОбщаяДлительность + ТекДлительность;		
	КонецЦикла;
	
	НовыйЭтап.ДлительностьЭтапаПлан = ОбщаяДлительность / 3600;
	НовыйЭтап.КонецЭтапа = НовыйЭтап.НачалоЭтапа + ОбщаяДлительность;
	ДокОбъект.ВремяОкончания = НовыйЭтап.КонецЭтапа;
	
	ДокОбъект.Записать();
	
	Если ЗаписыватьПланВРегистры И Перепланировать Тогда
		ЗаписатьЭтапВРегистр(ДокОбъект, НовыйЭтап, Справочники.Renault_СтатусыАвторабот.РаботаЗапланирована);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ВРазныеЭтапы(ДокОбъект, Цех, ОчищатьЭтапы = Истина, Перепланировать = Истина) Экспорт
	
	//Для Каждого ТекЭтап Из ДокОбъект.Этапы Цикл		
	//	Если ТекЭтап.СтатусЭтапа = Справочники.Renault_СтатусыАвторабот.РаботаНачата 
	//		ИЛИ ТекЭтап.СтатусЭтапа = Справочники.Renault_СтатусыАвторабот.РаботаПросрочена
	//		ИЛИ ТекЭтап.СтатусЭтапа = Справочники.Renault_СтатусыАвторабот.РаботаПауза Тогда
	//		
	//		Сообщить(НСтр("ru = 'Для этой заявки разбивка на этапы невозможна!'")); 
	//		Возврат;			
	//	КонецЕсли;		
	//КонецЦикла;
	
	Если ОчищатьЭтапы И Перепланировать Тогда
		Для Каждого ТекЭтап ИЗ ДокОбъект.Этапы Цикл
			ОчиститьПланПоЭтапу(ДокОбъект, ТекЭтап.IDЭтапа);
		КонецЦикла;
		ДокОбъект.Этапы.Очистить();
		ДокОбъект.СоставЭтапа.Очистить();	
	Иначе
		// Удаляем только пустые этапы
		Инд = ДокОбъект.СоставЭтапа.Количество() - 1;
		Пока Инд >= 0 Цикл
			ТекСтрока = ДокОбъект.СоставЭтапа[Инд]; 
			НайденнаяРабота = ДокОбъект.Работы.Найти(ТекСтрока.IDРаботы, "IDРаботы");
			Если НайденнаяРабота = Неопределено Тогда
				ДокОбъект.СоставЭтапа.Удалить(ТекСтрока);
			КонецЕсли; 
			Инд = Инд - 1;
		КонецЦикла; 
		
		Инд = ДокОбъект.Этапы.Количество() - 1;
		Пока Инд >= 0 Цикл
			ТекСтрока = ДокОбъект.Этапы[Инд];
			НайденнаяСтрока = ДокОбъект.СоставЭтапа.Найти(ТекСтрока.IDЭтапа, "IDЭтапа");
			Если НайденнаяСтрока = Неопределено Тогда
				ДокОбъект.Этапы.Удалить(ТекСтрока);
			КонецЕсли; 
			Инд = Инд - 1;
		КонецЦикла; 
	КонецЕсли; 	
	
	РаботыМойки = ПолучитьСписокРаботМойки();	
	ЭтапыМойки = Новый Массив;	
	ПервыйПроход = Истина;
	
	Для Инд = 0 По ДокОбъект.Работы.Количество() - 1 Цикл
		
		ТекРабота = ДокОбъект.Работы[Инд];
		ТекРабота.Машиноместо = Цех;
		
		Если ПервыйПроход Тогда
			ТекВремяНачала = ТекРабота.ВремяНачала;
			ПервыйПроход = Ложь;
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(ТекРабота.Длительность) Тогда
			ТекРабота.Длительность = (ТекРабота.ВремяОкончания - ТекРабота.ВремяНачала) / 3600;
		КонецЕсли; 
		
		ТекРабота.ВремяНачала = ТекВремяНачала;
		ТекРабота.ВремяОкончания = ТекВремяНачала + ТекРабота.Длительность * 3600;
		
		// Перенос на другой день
		РабочийДень1 = ПолучитьНачалоИКонецРабочегоДняДЦ(ДилерскийЦентр, ТекРабота.ВремяНачала);
		Если ТекРабота.ВремяОкончания > РабочийДень1.ВремяОкончания Тогда
			Дельта = ТекРабота.ВремяОкончания - РабочийДень1.ВремяОкончания;
			РабочийДень2 = ПолучитьНачалоИКонецРабочегоДняДЦ(ДилерскийЦентр, ТекРабота.ВремяНачала + 86400);
			
			ТекРабота.ВремяНачала = РабочийДень2.ВремяНачала;

			ТекРабота.ВремяОкончания = РабочийДень2.ВремяНачала + ТекРабота.Длительность * 3600;
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(ТекРабота.IDРаботы) Тогда			
			ТекРабота.IDРаботы = Новый УникальныйИдентификатор();			
		КонецЕсли;
		
		НайденнаяСтрокаСостава = ДокОбъект.СоставЭтапа.Найти(ТекРабота.IDРаботы, "IDРаботы");
		Если НайденнаяСтрокаСостава = Неопределено Тогда
			НовыйЭтап = ДокОбъект.Этапы.Добавить();
			НовыйЭтап.Этап = "Этап " + Формат(ТекРабота.Работа, "ЧГ=0");
			НовыйЭтап.IDЭтапа = Новый УникальныйИдентификатор();
			НовыйЭтап.СтатусЭтапа = Справочники.Renault_СтатусыАвторабот.РаботаЗапланирована;
			
			НовыйСостав = ДокОбъект.СоставЭтапа.Добавить();		
			НовыйСостав.IDЭтапа = НовыйЭтап.IDЭтапа;
			НовыйСостав.IDРаботы = ТекРабота.IDРаботы;
			НовыйСостав.Работа = ТекРабота.Работа;
		Иначе
			НовыйЭтап = ДокОбъект.Этапы.Найти(НайденнаяСтрокаСостава.IDЭтапа, "IDЭтапа");
		КонецЕсли; 		
		
		НовыйЭтап.Цех = ТекРабота.Машиноместо;
		НовыйЭтап.ДлительностьЭтапаПлан = ТекРабота.Длительность;
		НовыйЭтап.ДлительностьЭтапаФакт = ТекРабота.Длительность;
		НовыйЭтап.НачалоЭтапа = ТекРабота.ВремяНачала;
		НовыйЭтап.КонецЭтапа = ТекРабота.ВремяОкончания;		
		
		Если РаботыМойки.Найти(ТекРабота.Работа) <> Неопределено Тогда
			ЭтапыМойки.Добавить(НовыйЭтап.IDЭтапа);
		Иначе
			ТекВремяНачала = ТекРабота.ВремяОкончания + ДилерскийЦентр.Автосервис_ИнтервалНаПостах * 60;
		КонецЕсли; 			
	КонецЦикла;
	
	ВыровнятьВремяРаботыВДокументеПоЭтапам(ДокОбъект);
	ДокОбъект.Записать();
	
	Для Каждого ТекЭтап Из ДокОбъект.Этапы Цикл
		
		Если ЭтапыМойки.Найти(ТекЭтап.IDЭтапа) <> Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		
		Если Перепланировать Тогда
			Если Renault_АвтосервисПланирование.ПолучитьСтатусЭтапа(ДокОбъект.Ссылка, ТекЭтап.IDЭтапа) = Справочники.Renault_СтатусыАвторабот.РаботаЗапланирована или Renault_АвтосервисПланирование.ПолучитьСтатусЭтапа(ДокОбъект.Ссылка, ТекЭтап.IDЭтапа) = Неопределено  Тогда //+-/Блинков поиск стстуса этапа не по реквизиту тч а по регистру DMSREN-566
				ЗаписатьЭтапВРегистр(ДокОбъект, ТекЭтап, Справочники.Renault_СтатусыАвторабот.РаботаЗапланирована); 
			Иначе
				// Обновляем только план работ
				Запись = РегистрыСведений.Renault_АвтосервисПланРабот.СоздатьМенеджерЗаписи();
				Запись.Обращение = ДокОбъект.Обращение;
				Запись.РабочийДокумент = ДокОбъект.Ссылка;
				Запись.ДилерскийЦентр = ДокОбъект.ДилерскийЦентр;
				Запись.Длительность = ТекЭтап.ДлительностьЭтапаПлан;
				Запись.ВремяНачала = ТекЭтап.НачалоЭтапа;
				Запись.ВремяОкончания = ТекЭтап.КонецЭтапа;
				Запись.ЭтапРабот = ТекЭтап.IDЭтапа;
				Запись.Цех = ТекЭтап.Цех;
				
				НайденныеСтроки = ДокОбъект.СоставЭтапа.НайтиСтроки(Новый Структура("IDЭтапа", ТекЭтап.IDЭтапа));
				Если НайденныеСтроки.Количество() > 0 Тогда
					Запись.id = Новый УникальныйИдентификатор(НайденныеСтроки[0].IDРаботы); 
				КонецЕсли; 
				
				Запись.Записать();
			КонецЕсли; 
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

// ВыбранныеЭтапы - СписокЗначений, содержит IDЭтапа
//
Процедура СоединитьЭтапы(ДокОбъект, ВыбранныеЭтапы) Экспорт
	
	БазовыйЭтап = Неопределено;
	ЭтапыКУдалению = Новый Массив;
	РаботыМойки = ПолучитьСписокРаботМойки();
	ЭтапыМойки = Новый Массив;
	
	Для Инд = 0 По ДокОбъект.Этапы.Количество() - 1 Цикл
		ТекЭтап = ДокОбъект.Этапы[Инд]; 
		
		// мойки. их здесь быть не должно, но они есть
		ПропуститьЭтап = Ложь;
		НайденныеСтрокиСоставЭтапа = ДокОбъект.СоставЭтапа.НайтиСтроки(Новый Структура("IDЭтапа", ТекЭтап.IDЭтапа));
		Для каждого ТекСтрокаСоставЭтапа Из НайденныеСтрокиСоставЭтапа Цикл
			НайденнаяРабота = ДокОбъект.Работы.Найти(ТекСтрокаСоставЭтапа.IDРаботы, "IDРаботы");
			Если РаботыМойки.Найти(НайденнаяРабота.Работа) <> Неопределено Тогда
				ПропуститьЭтап = Истина;
				ЭтапыМойки.Добавить(ТекЭтап.IDЭтапа);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ПропуститьЭтап ИЛИ ВыбранныеЭтапы.НайтиПоЗначению(ТекЭтап.IDЭтапа) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если БазовыйЭтап = Неопределено Тогда
			// Считаем этот этап базовым и к нему будем присоединять все остальные
			БазовыйЭтап = ТекЭтап;
			Продолжить;
		КонецЕсли; 
		
		// Увеличиваем длительность базового этапа. Длительность текущего этапа рассчитаем в секундах
		БазовыйЭтап.КонецЭтапа = БазовыйЭтап.КонецЭтапа + ТекЭтап.ДлительностьЭтапаПлан * 3600; // (ТекЭтап.КонецЭтапа - ТекЭтап.НачалоЭтапа);
		БазовыйЭтап.ДлительностьЭтапаПлан = БазовыйЭтап.ДлительностьЭтапаПлан + ТекЭтап.ДлительностьЭтапаПлан; // (БазовыйЭтап.КонецЭтапа - БазовыйЭтап.НачалоЭтапа) / 3600;
		
		// Перенесем текущий этап в тот же цех, что и базовый
		ТекЭтап.Цех = БазовыйЭтап.Цех;
		
		// Перекидываем работы на базовый этап, и в тот же цех
		НайденныеСтрокиСоставЭтапа = ДокОбъект.СоставЭтапа.НайтиСтроки(Новый Структура("IDЭтапа", ТекЭтап.IDЭтапа));
		Для каждого ТекСтрокаСоставЭтапа Из НайденныеСтрокиСоставЭтапа Цикл
			ТекСтрокаСоставЭтапа.IDЭтапа = БазовыйЭтап.IDЭтапа;
			НайденнаяРабота = ДокОбъект.Работы.Найти(ТекСтрокаСоставЭтапа.IDРаботы, "IDРаботы");
			Если НайденнаяРабота <> Неопределено Тогда
				НайденнаяРабота.Машиноместо = БазовыйЭтап.Цех;
			КонецЕсли; 
		КонецЦикла; 
		
		ЭтапыКУдалению.Добавить(ТекЭтап);		 
	КонецЦикла; 
	
	// Удаляем лишние этапы
	Для Каждого ТекЭтап Из ЭтапыКУдалению Цикл
		ОчиститьПланПоЭтапу(ДокОбъект, ТекЭтап);
		ДокОбъект.Этапы.Удалить(ТекЭтап);
	КонецЦикла; 
	
	// Теперь нужно выставить один за одним все этапы, которые правее базового, и в том же цеху
	Если БазовыйЭтап <> Неопределено Тогда
		
		КонецПредыдущегоЭтапа = БазовыйЭтап.КонецЭтапа;
		
		Для Инд = ДокОбъект.Этапы.Индекс(БазовыйЭтап) + 1 По ДокОбъект.Этапы.Количество() - 1 Цикл
			ТекЭтап = ДокОбъект.Этапы[Инд];
			
			Если ТекЭтап.Цех <> БазовыйЭтап.Цех Тогда
				Продолжить;
			КонецЕсли; 
			
			// мойки. их здесь быть не должно, но они есть		
			Если ЭтапыМойки.Найти(ТекЭтап.IDЭтапа) <> Неопределено Тогда
				Продолжить;
			КонецЕсли; 
			
			Если ТекЭтап.НачалоЭтапа <> КонецПредыдущегоЭтапа И ТекЭтап.НачалоЭтапа > БазовыйЭтап.НачалоЭтапа Тогда
				ТекЭтап.НачалоЭтапа = КонецПредыдущегоЭтапа + ДилерскийЦентр.Автосервис_ИнтервалНаПостах * 60;
				ТекЭтап.КонецЭтапа = ТекЭтап.НачалоЭтапа + ТекЭтап.ДлительностьЭтапаПлан * 3600; 
				КонецПредыдущегоЭтапа = ТекЭтап.КонецЭтапа;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
		
	// Выравниваем время работ, чтобы они шли по порядку и совпадали со временем выполнения этапа
	//ТекВремяНачалаЭтапа = ДокОбъект.ВремяНачала; 
	Для ИнексЭтапа = 0 По ДокОбъект.Этапы.Количество() - 1 Цикл
		ТекЭтап = ДокОбъект.Этапы[ИнексЭтапа]; 
		НайденныеСтроки = ДокОбъект.СоставЭтапа.НайтиСтроки(Новый Структура("IDЭтапа", ТекЭтап.IDЭтапа));
			
		КонецПрошлойРаботы = Неопределено;
		Для Инд = 0 По НайденныеСтроки.ВГраница() Цикл
			IDРаботы = НайденныеСтроки[Инд].IDРаботы;
			ТекРабота = ДокОбъект.Работы.Найти(IDРаботы, "IDРаботы");
			Если ТекРабота = Неопределено Тогда
				// При записи документа будут удалены все несуществующие ID
				Продолжить;
			КонецЕсли; 
			
			Если КонецПрошлойРаботы = Неопределено Тогда
				// Первую работу привязываем к началу этапа				
				ТекРабота.ВремяНачала = ТекЭтап.НачалоЭтапа;
				ТекРабота.ВремяОкончания = ТекРабота.ВремяНачала + ТекРабота.Длительность * 3600;
				КонецПрошлойРаботы = ТекРабота.ВремяОкончания;
				Продолжить;
			КонецЕсли; 
			
			ТекРабота.ВремяНачала = КонецПрошлойРаботы;
			ТекРабота.ВремяОкончания = ТекРабота.ВремяНачала + ТекРабота.Длительность * 3600;
			КонецПрошлойРаботы = ТекРабота.ВремяОкончания;
		КонецЦикла; 
	КонецЦикла;
	
	Для каждого ТекЭтап Из ДокОбъект.Этапы Цикл
		
		Если ЭтапыМойки.Найти(ТекЭтап.IDЭтапа) <> Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		
		ЗаписатьЭтапВРегистр(ДокОбъект, ТекЭтап, Справочники.Renault_СтатусыАвторабот.РаботаЗапланирована);
	КонецЦикла; 
	
КонецПроцедуры

Процедура РазбитьЭтап(ДокОбъект, ВыбранныйЭтап) Экспорт
	
	ТекЭтап = ДокОбъект.Этапы.Найти(ВыбранныйЭтап, "IDЭтапа");
	
	Если ТекЭтап.СтатусЭтапа = Справочники.Renault_СтатусыАвторабот.РаботаНачата 
		ИЛИ ТекЭтап.СтатусЭтапа = Справочники.Renault_СтатусыАвторабот.РаботаПросрочена
		ИЛИ ТекЭтап.СтатусЭтапа = Справочники.Renault_СтатусыАвторабот.РаботаПауза Тогда
		
		Сообщить(НСтр("ru = 'Для этого этапа разбивка недоступна!'")); 
		Возврат;			
	КонецЕсли;		
	
	ОчиститьПланПоЭтапу(ДокОбъект, ТекЭтап.IDЭтапа);
	
	НовыеЭтапы = Новый Массив;
	НайденныеСтрокиСоставЭтапа = ДокОбъект.СоставЭтапа.НайтиСтроки(Новый Структура("IDЭтапа", ТекЭтап.IDЭтапа));
	Для каждого ТекСтрокаСоставЭтапа Из НайденныеСтрокиСоставЭтапа Цикл
		ТекСтрокаРаботы = ДокОбъект.Работы.Найти(ТекСтрокаСоставЭтапа.IDРаботы);
		ДокОбъект.СоставЭтапа.Удалить(ТекСтрокаСоставЭтапа);
		
		НовыйЭтап = ДокОбъект.Этапы.Добавить();
		НовыйЭтап.Этап = "Этап " + Формат(ТекСтрокаРаботы.Работа, "ЧГ=0");
		НовыйЭтап.IDЭтапа = Новый УникальныйИдентификатор();		
		НовыйЭтап.Цех = ТекСтрокаРаботы.Машиноместо;
		НовыйЭтап.ДлительностьЭтапаПлан = ТекСтрокаРаботы.Длительность;
		НовыйЭтап.ДлительностьЭтапаФакт = ТекСтрокаРаботы.Длительность;
		НовыйЭтап.НачалоЭтапа = ТекСтрокаРаботы.ВремяНачала;
		НовыйЭтап.КонецЭтапа = ТекСтрокаРаботы.ВремяОкончания;
		НовыеЭтапы.Добавить(НовыйЭтап);
		
		НовыйСостав = ДокОбъект.СоставЭтапа.Добавить();		
		НовыйСостав.IDЭтапа = НовыйЭтап.IDЭтапа;
		НовыйСостав.IDРаботы = ТекСтрокаРаботы.IDРаботы;
		НовыйСостав.Работа = ТекСтрокаРаботы.Работа;
	КонецЦикла;
	
	ДокОбъект.Этапы.Удалить(ТекЭтап);
	ДокОбъект.Этапы.Сортировать("НачалоЭтапа");
	
	Для Каждого ТекЭтап Из НовыеЭтапы Цикл
		ЗаписатьЭтапВРегистр(ДокОбъект, ТекЭтап, Справочники.Renault_СтатусыАвторабот.РаботаЗапланирована); 
	КонецЦикла; 
	
КонецПроцедуры
 
Процедура ПеренестиДокументНаВыбранноеВремя(РабочийДокумент, НовоеВремя, НовыйИсполнительЦех) Экспорт
	
	ДокОбъект = РабочийДокумент.ПолучитьОбъект();
	//Дельта = НовоеВремя - ДокОбъект.ВремяНачала;
	Длительность = ДокОбъект.ВремяОкончания - ДокОбъект.ВремяНачала;
	ДокОбъект.ВремяНачала = НовоеВремя;
	ДокОбъект.ВремяОкончания = ДокОбъект.ВремяНачала + Длительность;
		
	Если ТипЗнч(РабочийДокумент) = Тип("ДокументСсылка.Renault_CRM_ПриемкаАвтомобиля")
		ИЛИ ТипЗнч(РабочийДокумент) = Тип("ДокументСсылка.Renault_CRM_ВыдачаАвтомобиля")
		ИЛИ ТипЗнч(РабочийДокумент) = Тип("ДокументСсылка.Renault_CRM_ЗаявкаНаМойку") Тогда
		
		ДокОбъект.Машиноместо = НовыйИсполнительЦех;
		ДокОбъект.Записать();
		
		ЗаписатьПриемкуВыдачуВРегистр(ДокОбъект);
	Иначе
		// Заявка на сервис
		РаботыМойки = ПолучитьСписокРаботМойки();
		ПервыйПроход = Истина;
		ТекВремяНачала = НовоеВремя; // ДокОбъект.ВремяНачала;
		Для Инд = 0 По ДокОбъект.Этапы.Количество() - 1 Цикл
			ТекЭтап = ДокОбъект.Этапы[Инд]; 
			
			ТекДлительность = ТекЭтап.КонецЭтапа - ТекЭтап.НачалоЭтапа;
			ТекЭтап.Цех = НовыйИсполнительЦех;
			ТекЭтап.НачалоЭтапа = ТекВремяНачала;
			ТекЭтап.КонецЭтапа  = ТекЭтап.НачалоЭтапа + ТекДлительность;
			ТекЭтап.ДлительностьЭтапаПлан = ТекДлительность / 3600; 
			
			Если ПервыйПроход Тогда
				ДокОбъект.ВремяОкончания = ТекЭтап.КонецЭтапа;
				ПервыйПроход = Ложь;
			Иначе
				ДокОбъект.ВремяОкончания = Макс(ДокОбъект.ВремяОкончания, ТекЭтап.КонецЭтапа);
			КонецЕсли; 
			
			//Пропускаем мойки
			СтрокиСоставаЭтапа = ДокОбъект.СоставЭтапа.НайтиСтроки(Новый Структура("IDЭтапа", ТекЭтап.IDЭтапа));
			Если СтрокиСоставаЭтапа.Количество() = 1 Тогда
				СтрокиРаботы = ДокОбъект.Работы.НайтиСтроки(Новый Структура("IDРаботы", СтрокиСоставаЭтапа[0].IDРаботы));
				Если СтрокиРаботы.Количество() > 0 И РаботыМойки.Найти(СтрокиРаботы[0].Работа) <> Неопределено Тогда
					Продолжить;
				КонецЕсли; 
			КонецЕсли; 
			
			ТекВремяНачала = ТекЭтап.КонецЭтапа + ДилерскийЦентр.Автосервис_ИнтервалНаПостах * 60;
			ЗаписатьЭтапВрегистр(ДокОбъект, ТекЭтап, Справочники.Renault_СтатусыАвторабот.РаботаЗапланирована);			
		КонецЦикла; 
		
		Для Каждого ТекРабота Из ДокОбъект.Работы Цикл
			ТекРабота.Машиноместо = НовыйИсполнительЦех;
			//ТекРабота.ВремяНачала = ТекРабота.ВремяНачала + Дельта;
			//ТекРабота.ВремяОкончания = ТекРабота.ВремяОкончания + Дельта;
		КонецЦикла;
		
		ДокОбъект.ОбщаяДлительность = (ДокОбъект.ВремяОкончания - ДокОбъект.ВремяНачала) / 3600;
		ДокОбъект.Записать();		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСписокРаботМойки() Экспорт
	
	РаботыМойки = Новый Массив;
	
	Для Каждого ТекСтрока Из ДилерскийЦентр.АвтосервисРаботыМойки Цикл
		РаботыМойки.Добавить(ТекСтрока.Работа.Авторабота);
	КонецЦикла; 
	
	Возврат РаботыМойки;
	
КонецФункции
 
Процедура ПеренестиЭтапНаВыбранноеВремя(РабочийДокумент, IDЭтапа, НовоеВремя, НовыйЦех) Экспорт
	
	РаботыМойки = ПолучитьСписокРаботМойки();
	
	ДокОбъект = РабочийДокумент.ПолучитьОбъект();
	ВыбранныйЭтап = ДокОбъект.Этапы.Найти(IDЭтапа, "IDЭтапа");
	Если ВыбранныйЭтап = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ВыбранныйЭтап.Цех = НовыйЦех;
	//Дельта = НовоеВремя - ВыбранныйЭтап.НачалоЭтапа;	
	ВыбранныйЭтап.НачалоЭтапа = НовоеВремя; //ВыбранныйЭтап.НачалоЭтапа + Дельта;
	ВыбранныйЭтап.КонецЭтапа  = ВыбранныйЭтап.НачалоЭтапа + ВыбранныйЭтап.ДлительностьЭтапаПлан * 3600; //ВыбранныйЭтап.КонецЭтапа + Дельта;
	ЗаписатьЭтапВрегистр(ДокОбъект, ВыбранныйЭтап, Справочники.Renault_СтатусыАвторабот.РаботаЗапланирована);	
	
	СтрокиСоставаЭтапа = ДокОбъект.СоставЭтапа.НайтиСтроки(Новый Структура("IDЭтапа", ВыбранныйЭтап.IDЭтапа));
	Если СтрокиСоставаЭтапа.Количество() = 1 Тогда
		СтрокиРаботы = ДокОбъект.Работы.НайтиСтроки(Новый Структура("IDРаботы", СтрокиСоставаЭтапа[0].IDРаботы));
		Если СтрокиРаботы.Количество() > 0 Тогда
			ТекСтрокаРабот = СтрокиРаботы[0]; 		
			ТекСтрокаРабот.Машиноместо = ВыбранныйЭтап.Цех;
			ТекСтрокаРабот.ВремяНачала = ВыбранныйЭтап.НачалоЭтапа;
			ТекСтрокаРабот.ВремяОкончания = ВыбранныйЭтап.КонецЭтапа;			
		КонецЕсли; 		
	КонецЕсли;			
	
	МинВремяНачала		= ВыбранныйЭтап.НачалоЭтапа;
	МаксВремяОкончания	= ВыбранныйЭтап.КонецЭтапа;
	
	Для каждого ТекСтрока Из ДокОбъект.Этапы Цикл
		//Пропускаем мойки
		СтрокиСоставаЭтапа = ДокОбъект.СоставЭтапа.НайтиСтроки(Новый Структура("IDЭтапа", ТекСтрока.IDЭтапа));
		Если СтрокиСоставаЭтапа.Количество() = 1 Тогда
			СтрокиРаботы = ДокОбъект.Работы.НайтиСтроки(Новый Структура("IDРаботы", СтрокиСоставаЭтапа[0].IDРаботы));
			Если СтрокиРаботы.Количество() > 0 И РаботыМойки.Найти(СтрокиРаботы[0].Работа) <> Неопределено Тогда
				Продолжить;
			КонецЕсли; 
		КонецЕсли; 
			
		МинВремяНачала = Мин(МинВремяНачала, ТекСтрока.НачалоЭтапа);
		МаксВремяОкончания = Макс(МаксВремяОкончания, ТекСтрока.КонецЭтапа);
	КонецЦикла; 
	
	ДокОбъект.ВремяНачала = МинВремяНачала;
	ДокОбъект.ВремяОкончания = МаксВремяОкончания;	
	ДокОбъект.ОбщаяДлительность = (ДокОбъект.ВремяОкончания - ДокОбъект.ВремяНачала) / 3600;
	ДокОбъект.Записать();		
	
КонецПроцедуры

Процедура ВыровнятьВремяРаботыВДокументеПоЭтапам(РабочийДокумент) Экспорт
	
	РаботыМойки = ПолучитьСписокРаботМойки();
	
	ПервыйПроход = Истина;
	
	Для каждого ТекЭтап Из РабочийДокумент.Этапы Цикл		
		//Пропускаем мойки
		СтрокиСоставаЭтапа = РабочийДокумент.СоставЭтапа.НайтиСтроки(Новый Структура("IDЭтапа", ТекЭтап.IDЭтапа));
		Если СтрокиСоставаЭтапа.Количество() = 1 Тогда
			СтрокиРаботы = РабочийДокумент.Работы.НайтиСтроки(Новый Структура("IDРаботы", СтрокиСоставаЭтапа[0].IDРаботы));
			Если СтрокиРаботы.Количество() > 0 И РаботыМойки.Найти(СтрокиРаботы[0].Работа) <> Неопределено Тогда
				Продолжить;
			КонецЕсли; 
		КонецЕсли; 
		
		Если ПервыйПроход Тогда
			РабочийДокумент.ВремяНачала = ТекЭтап.НачалоЭтапа;
			РабочийДокумент.ВремяОкончания = ТекЭтап.КонецЭтапа;
			ПервыйПроход = Ложь;
			Продолжить;
		КонецЕсли; 
		
		РабочийДокумент.ВремяНачала = Мин(ТекЭтап.НачалоЭтапа, РабочийДокумент.ВремяНачала);
		РабочийДокумент.ВремяОкончания = Макс(ТекЭтап.КонецЭтапа, РабочийДокумент.ВремяОкончания);
	КонецЦикла; 
	
	//РабочийДокумент.ОбщаяДлительность = (РабочийДокумент.ВремяОкончания - РабочийДокумент.ВремяНачала) / 3600;
	
КонецПроцедуры
  
Процедура ПерепланироватьСвязанныеДокументы(РабочийДокумент, ПланироватьВыдачуНаПриемщика = Истина, ТолькоРаботающие = Ложь) Экспорт
	
	Если ТипЗнч(РабочийДокумент) = Тип("ДокументСсылка.Renault_CRM_ВыдачаАвтомобиля") Тогда
		// Ничего перепланировать не надо
		Возврат;
	КонецЕсли;
	
	//Проверяем наличие связанных документов
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПоСвязаннымДокументам();	
	Запрос.УстановитьПараметр("Обращение", РабочийДокумент.Обращение);
	Запрос.УстановитьПараметр("РабочийДокумент", РабочийДокумент);
	Результат = Запрос.Выполнить();
	ВыборкаРабочийДокумент = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТекДатаНачала = РабочийДокумент.ВремяОкончания;
	
	ВопросЗадан = Ложь;
	
	Если ТипЗнч(РабочийДокумент) = Тип("ДокументСсылка.Renault_CRM_ПриемкаАвтомобиля") Тогда		
		// Сперва перепланируем мойку
		ВыборкаРабочийДокумент.Сбросить();
		Пока ВыборкаРабочийДокумент.НайтиСледующий(2, "Порядок") Цикл
			ТекДлительность = ВыборкаРабочийДокумент.ВремяОкончания - ВыборкаРабочийДокумент.ВремяНачала;
			//ОтборИсключитьСлоты = Новый Массив;
			//ВыборкаСлот = ВыборкаРабочийДокумент.Выбрать();			
			//Пока ВыборкаСлот.Следующий() Цикл			 
			//	ОтборИсключитьСлоты.Добавить(ВыборкаСлот.id);
			//КонецЦикла;
			//Парам = Новый Структура("ОтборИсключитьСлоты", ОтборИсключитьСлоты);
			Парам = Новый Структура;
			Парам.Вставить("ОтборИсключитьОбращение", ВыборкаРабочийДокумент.РабочийДокумент.Обращение);
			Парам.Вставить("ПриоритетЦех", ВыборкаРабочийДокумент.РабочийДокумент.Машиноместо);
			Парам.Вставить("ТолькоРаботающие", ТолькоРаботающие);
			
			ТекДатаНачала = ТекДатаНачала + ДилерскийЦентр.Автосервис_ИнтервалВПриемкахВыдачах * 60;
			
			СвободныйИнтервал = ПолучитьСвободныйИнтервал(ТекДатаНачала, "Мойки", текДлительность / 3600, Парам);
			
			ТекДатаНачала = СвободныйИнтервал.ВремяНачала;
			РабочийДень1 = ПолучитьНачалоИКонецРабочегоДняДЦ(ДилерскийЦентр, ТекДатаНачала);		
			Если СвободныйИнтервал.ВремяНачала > РабочийДень1.ВремяНачала 
				И СвободныйИнтервал.ВремяНачалаИнтервала + ДилерскийЦентр.Автосервис_ИнтервалВПриемкахВыдачах * 60 > ТекДатаНачала Тогда
				ТекДатаНачала = СвободныйИнтервал.ВремяНачалаИнтервала + ДилерскийЦентр.Автосервис_ИнтервалВПриемкахВыдачах * 60;
			КонецЕсли; 
		
			ПеренестиДокументНаВыбранноеВремя(ВыборкаРабочийДокумент.РабочийДокумент, СвободныйИнтервал.ВремяНачала, СвободныйИнтервал.Цех);
			ТекДатаНачала = ВыборкаРабочийДокумент.РабочийДокумент.ВремяОкончания;
		КонецЦикла;
		
		// Теперь перепланируем работы	
		ВыборкаРабочийДокумент.Сбросить();
		ПоследнееМашиноместо = Неопределено;
		Пока ВыборкаРабочийДокумент.НайтиСледующий(3, "Порядок") Цикл
			
			//+++Ошибка при перепланировании если работы заходят на другой день
			//Правильнее всё таки будет считать длительность каждого этапа
			//Пройдемся по этапам чтобы вычислить "реальную длительность"
				ТекДлительность = 0;
				Для Каждого Этап из ВыборкаРабочийДокумент.РабочийДокумент.Этапы Цикл 
					ТекДлительность = ТекДлительность+(Этап.КонецЭтапа - Этап.НачалоЭтапа)+ДилерскийЦентр.Автосервис_ИнтервалНаПостах * 60;					
				КонецЦикла;
				ТекДлительность = ТекДлительность-ДилерскийЦентр.Автосервис_ИнтервалНаПостах * 60;
			//Иначе 	
			//	ТекДлительность = ВыборкаРабочийДокумент.ВремяОкончания - ВыборкаРабочийДокумент.ВремяНачала;
			//КонецЕсли;

			Парам = Новый Структура;
			Парам.Вставить("ОтборИсключитьОбращение", ВыборкаРабочийДокумент.РабочийДокумент.Обращение);
			Если ВыборкаРабочийДокумент.РабочийДокумент.Работы.Количество() > 0 и ПоследнееМашиноместо = Неопределено Тогда
				Парам.Вставить("ПриоритетЦех", ВыборкаРабочийДокумент.РабочийДокумент.Работы[0].Машиноместо);
			Иначе 
				Парам.Вставить("ПриоритетЦех",ПоследнееМашиноместо);
			КонецЕсли; 			
			ТекДатаНачала = ТекДатаНачала + ДилерскийЦентр.Автосервис_ИнтервалНаПостах * 60;			 
			Парам.Вставить("ТолькоРаботающие", ТолькоРаботающие);
			
			СвободныйИнтервал = ПолучитьСвободныйИнтервал(ТекДатаНачала, "Цеха", текДлительность / 3600, Парам);
			Парам.Вставить("ПриоритетЦех",Неопределено);
			СвободныйИнтервалБлижайший = ПолучитьСвободныйИнтервал(ТекДатаНачала, "Цеха", текДлительность / 3600, Парам);
			Если СвободныйИнтервал.Цех <> СвободныйИнтервалБлижайший.Цех  и СвободныйИнтервал.ВремяНачала <> СвободныйИнтервалБлижайший.ВремяНачала Тогда  
				СвободныйИнтервал = СвободныйИнтервалБлижайший;
				Парам.ПриоритетЦех = СвободныйИнтервал.Цех;
			КонецЕсли;
					
			//+++
			//Надо проверить есть ли еще работы в интервале заданном в диллерском центре
			//помоему становится не актуальным, из-за того что теперь он сам распределяет на свободное время и наложиня не должно происходить
			//Пока закоментим
		//	СдвинутьИнтервалНаПостуДоп = Ложь;
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = 
		//	"ВЫБРАТЬ ПЕРВЫЕ 1
		//	|	Renault_CRM_ЗаявкаНаСервисЭтапы.Ссылка.Обращение КАК Обращение,
		//	|	Renault_CRM_ЗаявкаНаСервисЭтапы.КонецЭтапа КАК ВремяОкончания
		//	|ИЗ
		//	|	Документ.Renault_CRM_ЗаявкаНаСервис.Этапы КАК Renault_CRM_ЗаявкаНаСервисЭтапы
		//	|ГДЕ
		//	|	Renault_CRM_ЗаявкаНаСервисЭтапы.КонецЭтапа МЕЖДУ &ВремяНачала И &ВремяОкончания
		//	|	И Renault_CRM_ЗаявкаНаСервисЭтапы.Цех = &Цех
		//	|
		//	|УПОРЯДОЧИТЬ ПО
		//	|	КонецЭтапа УБЫВ";
		//	
		//	Запрос.УстановитьПараметр("ВремяОкончания", СвободныйИнтервал.ВремяНачала);
		//	Запрос.УстановитьПараметр("ВремяНачала", НачалоДня(СвободныйИнтервал.ВремяНачала));
		//	
		//	Если Парам.Свойство("ПриоритетЦех") Тогда 
		//		//Запрос.УстановитьПараметр("Цех", Парам.ПриоритетЦех);
		//		Запрос.УстановитьПараметр("Цех", СвободныйИнтервал.Цех);
		//	Иначе 
		//		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И Renault_CRM_ЗаявкаНаСервисЭтапы.Цех = &Цех","");
		//	КонецЕсли;
		//
		//	РезультатЗапроса = Запрос.Выполнить();
		//	
		//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		//	
		//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//		Если ВыборкаДетальныеЗаписи.Обращение <> ВыборкаРабочийДокумент.РабочийДокумент.Обращение Тогда 
		//			Если ВыборкаДетальныеЗаписи.ВремяОкончания = СвободныйИнтервал.ВремяНачала Тогда  
		//				СдвинутьИнтервалНаПостуДоп = Истина;
		//			КонецЕсли;
		//		КонецЕсли;					
		//	КонецЦикла;
		//	ДатаНачалаПереноса = ?(СдвинутьИнтервалНаПостуДоп,СвободныйИнтервал.ВремяНачала+ДилерскийЦентр.Автосервис_ИнтервалНаПостах * 60,СвободныйИнтервал.ВремяНачала);
			//---
			//ТекДатаНачала = СвободныйИнтервал.ВремяНачала;
			РабочийДень1 = ПолучитьНачалоИКонецРабочегоДняДЦ(ДилерскийЦентр, ТекДатаНачала);		
			Если СвободныйИнтервал.ВремяНачала > РабочийДень1.ВремяНачала 
				И СвободныйИнтервал.ВремяНачалаИнтервала + ДилерскийЦентр.Автосервис_ИнтервалНаПостах * 60 > ТекДатаНачала Тогда
				ТекДатаНачала = СвободныйИнтервал.ВремяНачалаИнтервала + ДилерскийЦентр.Автосервис_ИнтервалНаПостах * 60;
			КонецЕсли; 
			
			ПеренестиДокументНаВыбранноеВремя(ВыборкаРабочийДокумент.РабочийДокумент, СвободныйИнтервал.ВремяНачала, СвободныйИнтервал.Цех);
			ТекДатаНачала = ВыборкаРабочийДокумент.РабочийДокумент.ВремяОкончания;
			ПоследнееМашиноместо = СвободныйИнтервал.Цех;
		КонецЦикла;
	КонецЕсли;
	
	// Теперь перепланируем выдачу
	ВыборкаРабочийДокумент.Сбросить();
	Пока ВыборкаРабочийДокумент.НайтиСледующий(4, "Порядок") Цикл
		ТекДлительность = ВыборкаРабочийДокумент.ВремяОкончания - ВыборкаРабочийДокумент.ВремяНачала;
		ТекПриемщик = Неопределено;
		
		ВыборкаСлот = ВыборкаРабочийДокумент.Выбрать();
		Пока ВыборкаСлот.Следующий() Цикл	
			ТекПриемщик = ВыборкаСлот.Приемщик;
		КонецЦикла;
		
		Парам = Новый Структура;
		Если ПланироватьВыдачуНаПриемщика Тогда
			СписокМашиномест = Новый Массив;
			СписокМашиномест.Добавить(ТекПриемщик);
			Парам.Вставить("СписокМашиномест", СписокМашиномест);		
		КонецЕсли; 	
		
		ВыборкаСлот.Сбросить();
		Если ВыборкаСлот.Следующий() Тогда
			Парам.Вставить("ОтборИсключитьОбращение", ВыборкаСлот.Обращение);
			Парам.Вставить("ПриоритетЦех", ВыборкаСлот.Цех);
		КонецЕсли; 
		ТекДатаНачала = ТекДатаНачала + ДилерскийЦентр.Автосервис_ИнтервалВПриемкахВыдачах * 60;
		Парам.Вставить("ТолькоРаботающие", ТолькоРаботающие);
		СвободныйИнтервал = ПолучитьСвободныйИнтервал(ТекДатаНачала, "Сотрудники", текДлительность / 3600, Парам);
		
		ТекДатаНачала = СвободныйИнтервал.ВремяНачала;
		РабочийДень1 = ПолучитьНачалоИКонецРабочегоДняДЦ(ДилерскийЦентр, ТекДатаНачала);		
		Если СвободныйИнтервал.ВремяНачала > РабочийДень1.ВремяНачала 
			И СвободныйИнтервал.ВремяНачалаИнтервала + ДилерскийЦентр.Автосервис_ИнтервалВПриемкахВыдачах * 60 > ТекДатаНачала Тогда
			ТекДатаНачала = СвободныйИнтервал.ВремяНачалаИнтервала + ДилерскийЦентр.Автосервис_ИнтервалВПриемкахВыдачах * 60;
		КонецЕсли; 
		
		ПеренестиДокументНаВыбранноеВремя(ВыборкаРабочийДокумент.РабочийДокумент, ТекДатаНачала, СвободныйИнтервал.Цех);
	КонецЦикла;	
	
КонецПроцедуры

Функция ТекстЗапросаПоСвязаннымДокументам() Экспорт
	 
	Возврат
	"ВЫБРАТЬ
	|	Renault_АвтосервисПланРабот.ДилерскийЦентр,
	|	Renault_АвтосервисПланРабот.Обращение,
	|	Renault_АвтосервисПланРабот.РабочийДокумент КАК РабочийДокумент,
	|	ВЫБОР
	|		КОГДА Renault_АвтосервисПланРабот.РабочийДокумент ССЫЛКА Документ.Renault_CRM_ПриемкаАвтомобиля
	|			ТОГДА 1
	|		КОГДА Renault_АвтосервисПланРабот.РабочийДокумент ССЫЛКА Документ.Renault_CRM_ЗаявкаНаМойку
	|			ТОГДА 2
	|		КОГДА Renault_АвтосервисПланРабот.РабочийДокумент ССЫЛКА Документ.Renault_CRM_ЗаявкаНаСервис
	|			ТОГДА 3
	|		КОГДА Renault_АвтосервисПланРабот.РабочийДокумент ССЫЛКА Документ.Renault_CRM_ВыдачаАвтомобиля
	|			ТОГДА 4
	|		ИНАЧЕ 999
	|	КОНЕЦ КАК Порядок,
	|	Renault_АвтосервисПланРабот.Цех,
	|	Renault_АвтосервисПланРабот.ЭтапРабот,
	|	Renault_АвтосервисПланРабот.Удалить_Авторабота,
	|	Renault_АвтосервисПланРабот.id,
	|	Renault_АвтосервисПланРабот.ВремяНачала КАК ВремяНачала,
	|	Renault_АвтосервисПланРабот.ВремяОкончания КАК ВремяОкончания,
	|	Renault_АвтосервисПланРабот.Длительность,
	|	Renault_АвтосервисПланРабот.versionID,
	|	Renault_АвтосервисПланРабот.Очередность,
	|	Renault_АвтосервисПланРабот.strID,
	|	ВложенныйЗапрос.Приемщик КАК Приемщик
	|ИЗ
	|	РегистрСведений.Renault_АвтосервисПланРабот КАК Renault_АвтосервисПланРабот
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(Таб.Цех) КАК Приемщик
	|		ИЗ
	|			РегистрСведений.Renault_АвтосервисПланРабот КАК Таб
	|		ГДЕ
	|			Таб.Обращение = &Обращение
	|			И Таб.РабочийДокумент ССЫЛКА Документ.Renault_CRM_ПриемкаАвтомобиля) КАК ВложенныйЗапрос
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Renault_АвтосервисПланРабот.Обращение = &Обращение
	|	И Renault_АвтосервисПланРабот.РабочийДокумент <> &РабочийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок
	|ИТОГИ
	|	МАКСИМУМ(Порядок),
	|	МИНИМУМ(ВремяНачала),
	|	МАКСИМУМ(ВремяОкончания)
	|ПО
	|	РабочийДокумент";
	
КонецФункции
  
Процедура ОчиститьПланПоЭтапу(ДокОбъект, Этап)
	
	Если ТипЗнч(Этап) = Тип("Строка") Тогда
		
		IDЭтапа = Этап;
		
	Иначе
		
		IDЭтапа = Этап.IDЭтапа;
		
	КонецЕсли;
	
	ОтборПлана = РегистрыСведений.Renault_АвтосервисПланРабот.СоздатьНаборЗаписей();	
	ОтборПлана.Отбор.РабочийДокумент.Установить(ДокОбъект.Ссылка);
	ОтборПлана.Отбор.ЭтапРабот.Установить(IDЭтапа);
	ОтборПлана.Прочитать();
	ОтборПлана.Очистить();
	ОтборПлана.Записать();
	
	ОтборПлана = РегистрыСведений.Renault_АвтосервисПланОперативный.СоздатьНаборЗаписей();
	ОтборПлана.Отбор.РабочийДокумент.Установить(ДокОбъект.Ссылка);
	ОтборПлана.Отбор.ЭтапРабот.Установить(IDЭтапа);
	ОтборПлана.Прочитать();
	ОтборПлана.Очистить();
	ОтборПлана.Записать();
	
	ОтборСтатуса = РегистрыСведений.Renault_АвтосервисСтатусыРабот.СоздатьНаборЗаписей();
	ОтборСтатуса.Отбор.РабочийДокумент.Установить(ДокОбъект.Ссылка);
	ОтборСтатуса.Отбор.ЭтапРабот.Установить(IDЭтапа);
	ОтборСтатуса.Прочитать();
	ОтборСтатуса.Очистить();
	ОтборСтатуса.Записать();
	
КонецПроцедуры

Процедура ЗаписатьЭтапВРегистр(ДокОбъект, Этап, Статус) Экспорт
	
	Если ЗначениеЗаполнено(Этап.НачалоЭтапа) И ЗначениеЗаполнено(Этап.КонецЭтапа) И Этап.ДлительностьЭтапаПлан > 0  Тогда
		
		ОчиститьПланПоЭтапу(ДокОбъект, Этап);
		
		Запись = РегистрыСведений.Renault_АвтосервисПланРабот.СоздатьМенеджерЗаписи();
		Запись.Обращение = ДокОбъект.Обращение;
		Запись.РабочийДокумент = ДокОбъект.Ссылка;
		Запись.ДилерскийЦентр = ДокОбъект.ДилерскийЦентр;
		Запись.Длительность = Этап.ДлительностьЭтапаПлан;
		Запись.ВремяНачала = Этап.НачалоЭтапа;
		Запись.ВремяОкончания = Этап.КонецЭтапа;
		Запись.ЭтапРабот = Этап.IDЭтапа;
		Запись.Цех = Этап.Цех;
		
		НайденныеСтроки = ДокОбъект.СоставЭтапа.НайтиСтроки(Новый Структура("IDЭтапа", Этап.IDЭтапа));
		Если НайденныеСтроки.Количество() > 0 Тогда
			Запись.id = Новый УникальныйИдентификатор(НайденныеСтроки[0].IDРаботы); 
		КонецЕсли; 
		
		Этап.СтатусЭтапа = Статус;
		
		Запись.Записать();
		
		ЗаписьПлана = РегистрыСведений.Renault_АвтосервисПланОперативный.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ЗаписьПлана, Запись);
		ЗаписьПлана.Период = ТекущаяДата();
		ЗаписьПлана.Записать();
		
		ОбновитьСтатусЭтапаВрегистре(ДокОбъект, Этап);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьСтатусЭтапаВрегистре(ДокОбъект, Этап)
	
	ЗаписьСтатуса = РегистрыСведений.Renault_АвтосервисСтатусыРабот.СоздатьМенеджерЗаписи();
	ЗаписьСтатуса.РабочийДокумент = ДокОбъект.Ссылка;
	ЗаписьСтатуса.Период = ТекущаяДата();
	ЗаписьСтатуса.Обращение = ДокОбъект.Обращение;
	ЗаписьСтатуса.ДилерскийЦентр = ДокОбъект.ДилерскийЦентр;
	ЗаписьСтатуса.ЭтапРабот = Этап.IDЭтапа;
	ЗаписьСтатуса.Цех = Этап.Цех;
	ЗаписьСтатуса.СтатусРаботы = Этап.СтатусЭтапа;
	
	Если ЗначениеЗаполнено(ЗаписьСтатуса.СтатусРаботы) Тогда
		
		ЗаписьСтатуса.Записать();
		
	КонецЕсли;
	
	Если Этап.СтатусЭтапа = Справочники.Renault_СтатусыАвторабот.РаботаЗакончена Тогда
		Набор = РегистрыСведений.Renault_АвтосервисПланОперативный.СоздатьНаборЗаписей();
		Набор.Отбор.РабочийДокумент.Установить(ДокОбъект.Ссылка);
		Набор.Отбор.Обращение.Установить(ДокОбъект.Обращение);
		Набор.Отбор.ДилерскийЦентр.Установить(ДокОбъект.ДилерскийЦентр);
		Набор.Отбор.ЭтапРабот.Установить(Этап.IDЭтапа);
		Набор.Отбор.Цех.Установить(Этап.Цех);
		//Набор.Отбор.Авторабота.Установить(Этап.СтатусЭтапа);
		Набор.Прочитать();
		Набор.Очистить();
		Набор.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьПриемкуВыдачуВРегистр(ДокОбъект) Экспорт
	
	// У приемки и выдачи нет этапов, поэтому считаем весь документ одним этапом
	// И везде в конфигурации в качестве этапа ставят 1 вместо идентификатора
	// Поэтому при отрисовке планировщика придется ориентироваться на id работ, который тоже в документе не хранится
	
	ОтборПлана = РегистрыСведений.Renault_АвтосервисПланРабот.СоздатьНаборЗаписей();	
	ОтборПлана.Отбор.РабочийДокумент.Установить(ДокОбъект.Ссылка);
	ОтборПлана.Записать();
	
	Запись = РегистрыСведений.Renault_АвтосервисПланРабот.СоздатьМенеджерЗаписи();		
	Запись.ДилерскийЦентр 	= ДокОбъект.ДилерскийЦентр;
	Запись.Обращение 		= ДокОбъект.Обращение;
	Запись.РабочийДокумент 	= ДокОбъект.Ссылка;
	Запись.Цех 				= ДокОбъект.Машиноместо;
	Запись.ЭтапРабот		= 1;
	Запись.id 				= Новый УникальныйИдентификатор();
	Запись.ВремяНачала 		= ДокОбъект.ВремяНачала;
	Запись.ВремяОкончания 	= ДокОбъект.ВремяОкончания;
	Запись.Длительность		= (Запись.ВремяОкончания - Запись.ВремяНачала) / 3600;
	Запись.versionID 		= 1;	
	Запись.Записать();
	
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.Renault_CRM_ЗаявкаНаМойку") Тогда		
		Набор = РегистрыСведений.Renault_АвтосервисСтатусыРабот.СоздатьНаборЗаписей();
		Набор.Отбор.Обращение.Установить(ДокОбъект.Обращение);
		Набор.Отбор.РабочийДокумент.Установить(ДокОбъект.Ссылка);
		Набор.Прочитать();
		Набор.Очистить();
		
		Запись = Набор.Добавить();		
		Запись.ДилерскийЦентр	= ДокОбъект.ДилерскийЦентр;
		Запись.Обращение		= ДокОбъект.Обращение;
		Запись.РабочийДокумент	= ДокОбъект.Ссылка;
		Запись.Цех				= ДокОбъект.Машиноместо;
		Запись.ЭтапРабот		= 1;
		Запись.Период			= ТекущаяДата();
		Запись.СтатусРаботы		= Справочники.Renault_СтатусыАвторабот.РаботаЗапланирована;
		Набор.Записать();		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСвободныйИнтервал(ДатаПлан, ОбластьПоиска, ДлительностьРабот, ДополнительныеПараметры = Неопределено) Экспорт
	
	СвободныеИнтервалы = ПолучитьТаблицуСвободныхИнтервалов(ДатаПлан, ОбластьПоиска, ДополнительныеПараметры);
	
	// Беседин 12.01.22 заявки 1419-1420
	Если СвободныеИнтервалы.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РабочийДень = ПолучитьНачалоИКонецРабочегоДняДЦ(ДилерскийЦентр,ДатаПлан);
	// Дополним таблицу длительностью интервалов с учетом перехода на следующий день
	СвободныеИнтервалы.Колонки.Добавить("ДлительностьМногодневного");
	СвободныеИнтервалы.Колонки.Добавить("ОкончаниеМногодневного");
	СвободныеИнтервалы.Колонки.Добавить("ОкончаниеРабот");
	СвободныеИнтервалы.Колонки.Добавить("ТаблицаСегментов");
	СвободныеИнтервалы.ЗагрузитьКолонку(СвободныеИнтервалы.ВыгрузитьКолонку("Длительность"), "ДлительностьМногодневного");
	СвободныеИнтервалы.ЗагрузитьКолонку(СвободныеИнтервалы.ВыгрузитьКолонку("ВремяОкончания"), "ОкончаниеМногодневного");
	СвободныеИнтервалы.ЗагрузитьКолонку(СвободныеИнтервалы.ВыгрузитьКолонку("ВремяНачала"), "ОкончаниеРабот");
	МассивПостов = ДилерскийЦентр.АвтосервисЦеха.НайтиСтроки(Новый Структура("ОнлайнЗапись",Истина));
	Инд = СвободныеИнтервалы.Количество() - 1;
	
	Если ОбластьПоиска = "Цеха" ИЛИ ОбластьПоиска = "Все" Тогда
		// Многодневный интервал имеет смысл только для цехов
	
		//ТекЦех = Неопределено;
		//ДлительностьМногодневного = 0;
		//НачалоМногодневного = Неопределено;
		//ОкончаниеМногодневного = Неопределено;
		//
		//Пока Инд >= 0 Цикл
		//	ТекСтрока = СвободныеИнтервалы[Инд];
		//	Если ТекЦех = ТекСтрока.Цех
		//		И ЭтоПродолжениеРабочегоДня(ТекСтрока.ВремяОкончания, НачалоМногодневного) Тогда
		//		
		//		ДлительностьМногодневного = ДлительностьМногодневного + ТекСтрока.Длительность;
		//		ТекСтрока.ДлительностьМногодневного = ДлительностьМногодневного;
		//		ТекСтрока.ОкончаниеМногодневного = ОкончаниеМногодневного;			
		//	Иначе
		//		Если ТипЗнч(ТекСтрока.Цех) <> Тип("СправочникСсылка.Цеха") Тогда
		//			Инд = Инд + 1;
		//			Продолжить;
		//		КонецЕсли; 
		//		ТекЦех = ТекСтрока.Цех;
		//		ДлительностьМногодневного = ТекСтрока.Длительность;
		//		НачалоМногодневного = ТекСтрока.ВремяНачала;
		//		ОкончаниеМногодневного = ТекСтрока.ВремяОкончания;
		//		ТекСтрока.ДлительностьМногодневного = ТекСтрока.Длительность;
		//		ТекСтрока.ОкончаниеМногодневного = ТекСтрока.ВремяОкончания;
		//	КонецЕсли; 
		//	НачалоМногодневного = ТекСтрока.ВремяНачала;
		//	
		//	Инд = Инд - 1;
		//КонецЦикла; 
		
		Для Инд = 0 По СвободныеИнтервалы.Количество() - 1 Цикл
			ТекСтрока = СвободныеИнтервалы[Инд];
			ТекДлительность = ?(ТекСтрока.ВремяНачалаИнтервала = ТекСтрока.ВремяНачала, ТекСтрока.Длительность, 
				(ТекСтрока.ВремяОкончания - ТекСтрока.ВремяНачала) / 3600);
			ТекСтрока.ОкончаниеРабот = ТекСтрока.ВремяНачала + ДлительностьРабот * 3600;
			//Учтем интервал между постами, чтобы не происхъодило наложение
			
			
			
			//Если ТекДлительность < ДлительностьРабот И ТипЗнч(ТекСтрока.Цех) = Тип("СправочникСсылка.Цеха")
			//	И НЕ ДилерскийЦентр.Автосервис_НеДробитьРаботу
			//	И ТекДлительность > (ДилерскийЦентр.Автосервис_ИнтервалНаПостах * 2 + ДилерскийЦентр.АвтосервисШагПланирования) * 60 Тогда
			//	// Просчитываем вариант, когда работа переносится на следующий день/рабочий интервал
			//	ОсталосьРаспределить = ДлительностьРабот - ТекДлительность;
			//	Для След = Инд + 1 По СвободныеИнтервалы.Количество() - 1 Цикл
			//		СледСтрока = СвободныеИнтервалы[След];
			//		Если СледСтрока.Цех <> ТекСтрока.Цех Тогда
			//			Прервать;
			//		КонецЕсли; 
			//		
			//		ТекСтрока.ОкончаниеМногодневного = СледСтрока.ВремяОкончания;
			//		ТекСтрока.ДлительностьМногодневного = ТекСтрока.ДлительностьМногодневного + СледСтрока.Длительность;
			//		ТекСтрока.ОкончаниеРабот = СледСтрока.ВремяНачалаИнтервала + ОсталосьРаспределить * 3600;
			//		ТекСтрока.КоличествоСегментов = ТекСтрока.КоличествоСегментов + 1;	
			//		Если СледСтрока.Длительность >= ОсталосьРаспределить Тогда
			//			Прервать;
			//		Иначе
			//			ОсталосьРаспределить = ОсталосьРаспределить - СледСтрока.Длительность;						
			//		КонецЕсли; 
			//	КонецЦикла; 				
			//КонецЕсли; 
			Если ТекСтрока.ВремяОкончания <> РабочийДень.ВремяОкончания Тогда 
				ДопИнтервал = (100*ДилерскийЦентр.Автосервис_ИнтервалНаПостах)/60/100; //Плюсуем интервал между постами для того чтобы не происходило наложение
			Иначе 
				ДопИнтервал = 0;
			КонецЕсли;
			//ТекСтрока.Исключить = ТекСтрока.ДлительностьМногодневного < ДлительностьРабот + ДилерскийЦентр.Автосервис_ИнтервалНаПостах; 
			ТекСтрока.Исключить = ТекСтрока.ДлительностьМногодневного < ДлительностьРабот + ДопИнтервал;
			Если Не ТекСтрока.Исключить Тогда
				Если ДополнительныеПараметры.Свойство("Онлайн",Истина) Тогда
					ТекСтрока.Исключить = Истина;
					Для Каждого СтрокаПост Из МассивПостов Цикл
						Если ТекСтрока.Цех = СтрокаПост.Цех Тогда 
							ТекСтрока.Исключить = Ложь;
						КонецЕсли;
					КонецЦикла;
				Иначе 
					Для Каждого СтрокаПост Из МассивПостов Цикл 
						Если ТекСтрока.Цех = СтрокаПост.Цех Тогда 
							ТекСтрока.Исключить = Истина;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли; 
	
	СвободныеИнтервалы.Сортировать("Исключить,ПорядокЦех,ОкончаниеРабот,КоличествоСегментов,НомерЦеха"); //ВремяНачалаИнтервала");
	
	Для Инд = 0 По СвободныеИнтервалы.Количество() - 1 Цикл
		ТекСтрока = СвободныеИнтервалы[Инд];
		Если ТекСтрока.Исключить Тогда 
			Продолжить;
		КонецЕсли;
		Если ТекСтрока.ДлительностьМногодневного >= ДлительностьРабот Тогда // И ТекСтрока.ВремяНачала >= ДатаПлан Тогда
			// Нашли нужную строку. Подготовим таблицу сегментов, если их больше одного
			//Если ТекСтрока.КоличествоСегментов > 1 Тогда			
			//	ТаблицаСегментов = СвободныеИнтервалы.Скопировать(Новый Структура("Цех", ТекСтрока.Цех), );
			//	ТаблицаСегментов.Сортировать("ВремяНачала");
			//	СтрокиДляУдаления = Новый Массив;
			//	Для ИндексСегмента = 0 По ТаблицаСегментов.Количество() - 1 Цикл
			//		ТекСтрокаСегмента = ТаблицаСегментов[ИндексСегмента]; 
			//		Если ТекСтрокаСегмента.ВремяНачалаИнтервала >= ТекСтрока.ВремяНачалаИнтервала Тогда
			//			Прервать;
			//		КонецЕсли;
			//		СтрокиДляУдаления.Добавить(ТекСтрокаСегмента);
			//	КонецЦикла; 
			//	
			//	Для каждого ТекСтрокаУдалить Из СтрокиДляУдаления Цикл
			//		ТаблицаСегментов.Удалить(ТекСтрокаУдалить);
			//	КонецЦикла;
			//Иначе
				ТаблицаСегментов = СвободныеИнтервалы.СкопироватьКолонки();
				НовСтрока = ТаблицаСегментов.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтрока);
			//КонецЕсли; 
			
			ТекСтрока.ТаблицаСегментов = ТаблицаСегментов;
			
			Возврат ТекСтрока;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат Неопределено;
	
КонецФункции

Функция ЭтоПродолжениеРабочегоДня(Время1, Время2)
	
	Если Время2 = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	РабочийДень1 = ПолучитьНачалоИКонецРабочегоДняДЦ(ДилерскийЦентр, Время1);
	РабочийДень2 = ПолучитьНачалоИКонецРабочегоДняДЦ(ДилерскийЦентр, Время2);	
	
	Если Время1 = РабочийДень1.ВремяОкончания И Время2 = РабочийДень2.ВремяНачала Тогда
		// Сперва проверим, может это два подряд идущих будних дня
		Если НачалоДня(Время1) + 86400 = НачалоДня(Время2) Тогда
			Возврат Истина;
		КонецЕсли; 
		
		// Получим из календаря следующий рабочий день
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Календарь.ДатаКалендаря КАК ДатаКалендаря
		|ИЗ
		|	РегистрСведений.DMS_ПроизводственныйКалендарь КАК Календарь
		|ГДЕ
		|	Календарь.ДатаКалендаря > &ДатаНачала
		|	И Календарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.DMS_ВидыДнейПроизводственногоКалендаря.Рабочий)";
		Запрос.УстановитьПараметр("ДатаНачала", Время1);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() И Выборка.ДатаКалендаря = НачалоДня(Время2) Тогда
			Возврат Истина;
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат Ложь;
	
КонецФункции
 
Функция ПолучитьТаблицуСвободныхИнтервалов(ДатаВремяНачала, ОбластьПоиска, ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура;
	КонецЕсли; 
	
	// ДатаОкончания, ДлительностьРабот, ОтборЦех, ОтборСотрудник
	РабочийДень1 = ПолучитьНачалоИКонецРабочегоДняДЦ(ДилерскийЦентр, ДатаВремяНачала);
	НачалоРабочегоДня	= Час(РабочийДень1.ВремяНачала);
	КонецРабочегоДня	= Час(РабочийДень1.ВремяОкончания);
	ДатаПланирования	= НачалоДня(ДатаВремяНачала);
		
	// Проверим ДатаОкончания - если не указана, то берем месяц от ДатыНачала
	ДатаОкончания = Неопределено;
	ДополнительныеПараметры.Свойство("ДатаОкончания", ДатаОкончания);
	Если ДатаОкончания = Неопределено Тогда
		ДатаОкончания = КонецДня(ДобавитьМесяц(ДатаВремяНачала, 1));
	КонецЕсли; 
	
	//ДатаОкончания = НачалоДня(ДатаОкончания) + КонецРабочегоДня * 3600;
	РабочийДень2 = ПолучитьНачалоИКонецРабочегоДняДЦ(ДилерскийЦентр, ДатаОкончания);
	ДатаОкончания = РабочийДень2.ВремяОкончания;
	
	ДлительностьРабот = 0;
	Если ДополнительныеПараметры.Свойство("ДлительностьРабот") Тогда
		ДлительностьРабот = ДополнительныеПараметры.ДлительностьРабот;
	КонецЕсли; 
	
	ТолькоРаботающие = Ложь;
	Если НЕ ДополнительныеПараметры.Свойство("ТолькоРаботающие", ТолькоРаботающие) Тогда
		ТолькоРаботающие = Ложь;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаСвободныеИнтервалы();
	
	//+++
	//УстановимЦехаПодОнлайнЗапись	
	//Запрос.УстановитьПараметр("ЦехаОнлайнЗапись",ДилерскийЦентр.АвтосервисЦеха.НайтиСтроки(Новый Структура("ОнлайнЗапись",Истина)));
	//---
	
	Запрос.УстановитьПараметр("ДатаПланирования", ДатаПланирования);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("ВремяПланирования", Макс(РабочийДень1.ВремяНачала, ДатаВремяНачала));
	// Переделать на получение времени начала/окончания отдельно для каждого дня.
	// Скорее всего надо передавать в запрос уже готовую таблицу рабочих дней
	Запрос.УстановитьПараметр("НачалоРабочегоДня", НачалоРабочегоДня);
	Запрос.УстановитьПараметр("КонецРабочегоДня", КонецРабочегоДня);
	
	Запрос.УстановитьПараметр("ДлинаИнтервала", ДлительностьРабот);
	Запрос.УстановитьПараметр("ДилерскийЦентр", ДилерскийЦентр);
	
	ОтборВидМашиноместа = Перечисления.CRM_ВидыМашиноместВЦеху.ПустаяСсылка();
	Если ОбластьПоиска = "Цеха" Тогда
		ОтборВидМашиноместа = Перечисления.CRM_ВидыМашиноместВЦеху.МашиноместоВЦеху;
	ИначеЕсли ОбластьПоиска = "Сотрудники" Тогда
		ОтборВидМашиноместа = Перечисления.CRM_ВидыМашиноместВЦеху.МастерПриемщик;
	ИначеЕсли ОбластьПоиска = "Мойки" Тогда
		ОтборВидМашиноместа = Перечисления.CRM_ВидыМашиноместВЦеху.Мойка;
	ИначеЕсли ОбластьПоиска = "ПодменныйАвто" Тогда
		ОтборВидМашиноместа = Перечисления.CRM_ВидыМашиноместВЦеху.ПодменныйАвтомобиль;
	КонецЕсли; 
	
	СписокМашиномест = Неопределено;
	Если ДополнительныеПараметры.Свойство("СписокМашиномест", СписокМашиномест) Тогда
		ТаблицаМашиномест = ТаблицаМашиноместИзСписка(СписокМашиномест)
	Иначе
		ТаблицаЗанятости = Неопределено;
		ТаблицаМашиномест = Обработки.CRM_АРМ_АвтоСервис_4.ПолучитьТаблицуМашиномест(ДилерскийЦентр, 
			ДатаПланирования, ДатаОкончания, Ложь, ТолькоРаботающие, Неопределено, ОтборВидМашиноместа, 
			ПараметрыСеанса.Пользователь.Сотрудник);	
	КонецЕсли;
		
	//+++
	Запрос.УстановитьПараметр("ОнлайнПосты",ВернутьОнлайнПосты());
	//---
	Запрос.УстановитьПараметр("ТаблицаМашиномест", ТаблицаМашиномест);	
	
	ТаблицаНерабочегоВремени = Неопределено;
	Если НЕ ДополнительныеПараметры.Свойство("ТаблицаНерабочегоВремени", ТаблицаНерабочегоВремени) Тогда
		Если ТолькоРаботающие Тогда
			ТаблицаНерабочегоВремени = Обработки.CRM_АРМ_АвтоСервис_4.ПолучитьТаблицуНерабочегоВремени(ДилерскийЦентр,
				ДатаПланирования, ДатаОкончания, ТаблицаМашиномест);
		Иначе		 
			ТаблицаНерабочегоВремени = Новый ТаблицаЗначений;
			ТаблицаНерабочегоВремени.Колонки.Добавить("Цех", Новый ОписаниеТипов("СправочникСсылка.Цеха,СправочникСсылка.Сотрудники"));
			ТаблицаНерабочегоВремени.Колонки.Добавить("НачалоДня", Новый ОписаниеТипов("Дата"));
			ТаблицаНерабочегоВремени.Колонки.Добавить("КонецДня", Новый ОписаниеТипов("Дата"));
			ТаблицаНерабочегоВремени.Колонки.Добавить("ВремяНачала", Новый ОписаниеТипов("Дата"));
			ТаблицаНерабочегоВремени.Колонки.Добавить("ВремяОкончания", Новый ОписаниеТипов("Дата"));			
		КонецЕсли;
	КонецЕсли; 
	Запрос.УстановитьПараметр("ТаблицаНерабочегоВремени", ТаблицаНерабочегоВремени);
	
	ОтборИсключитьСлоты = Неопределено;
	ДополнительныеПараметры.Свойство("ОтборИсключитьСлоты", ОтборИсключитьСлоты);
	Если ОтборИсключитьСлоты <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеИсключитьСлоты", "Renault_АвтосервисПланРабот.id НЕ В(&СписокIDСлотов)");
		Запрос.УстановитьПараметр("СписокIDСлотов", ОтборИсключитьСлоты);
	Иначе
		Запрос.УстановитьПараметр("УсловиеИсключитьСлоты", Истина);
	КонецЕсли; 
	
	ОтборИсключитьОбращение = Неопределено;
	ДополнительныеПараметры.Свойство("ОтборИсключитьОбращение", ОтборИсключитьОбращение);
	Если ОтборИсключитьОбращение <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеИсключитьОбращение", "Renault_АвтосервисПланРабот.Обращение <> &ОтборИсключитьОбращение");
		Запрос.УстановитьПараметр("ОтборИсключитьОбращение", ОтборИсключитьОбращение);
	Иначе
		Запрос.УстановитьПараметр("УсловиеИсключитьОбращение", Истина);
	КонецЕсли; 
	
	ПриоритетЦех = Неопределено;
	ДополнительныеПараметры.Свойство("ПриоритетЦех", ПриоритетЦех);
	Если ПриоритетЦех <> Неопределено Тогда
		Запрос.УстановитьПараметр("ПриоритетЦех", ПриоритетЦех);
	Иначе
		Запрос.УстановитьПараметр("ПриоритетЦех", Справочники.Цеха.ПустаяСсылка());
	КонецЕсли; 
	
	// Беседин 12.01.22 заявка 1420     
	МассивРезультатов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	Если МассивРезультатов.Получить(2).Пустой() Тогда
		Сообщить("Не заполнен производственный календарь!", СтатусСообщения.Внимание);
	КонецЕсли;
	
	ТаблицаИнтервалов = МассивРезультатов.Получить(МассивРезультатов.Количество()-1).Выгрузить();
	//ТаблицаИнтервалов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаИнтервалов;	
	
КонецФункции

Функция ВернутьОнлайнПосты()
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CRM_ДилерскиеЦентрыАвтосервисЦеха.Цех КАК Цех
		|ИЗ
		|	Справочник.CRM_ДилерскиеЦентры.АвтосервисЦеха КАК CRM_ДилерскиеЦентрыАвтосервисЦеха
		|ГДЕ
		|	CRM_ДилерскиеЦентрыАвтосервисЦеха.ОнлайнЗапись = ИСТИНА
		|	И CRM_ДилерскиеЦентрыАвтосервисЦеха.Ссылка = &Дилер";
	
	Запрос.УстановитьПараметр("Дилер",ДилерскийЦентр);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции


Функция ТекстЗапросаСвободныеИнтервалы()
	
	// В общем случае есть три источника свободных интервалов: 
	// 1. Промежуток от начала планирования до первого запланированнй работы
	// 2. Промежутки между запланированными работами
	// 3. Промежуток после последней запланированной работы
	// Собираем отдельно данные по 1 + 3 блоку и отдельно по 2 блоку, объединяем их, дальше дробим по рабочим дням
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НерабочиеПериоды.Цех КАК Цех,
	|	НерабочиеПериоды.НачалоДня КАК НачалоДня,
	|	НерабочиеПериоды.КонецДня КАК КонецДня,
	|	НерабочиеПериоды.ВремяНачала КАК ВремяНачала,
	|	НерабочиеПериоды.ВремяОкончания КАК ВремяОкончания
	|ПОМЕСТИТЬ втНерабочиеПериоды
	|ИЗ
	|	&ТаблицаНерабочегоВремени КАК НерабочиеПериоды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таб.Машиноместо КАК Цех
	|ПОМЕСТИТЬ втЦеха
	|ИЗ
	|	&ТаблицаМашиномест КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЦеха.Цех КАК Цех,
	|	Календарь.ДатаКалендаря КАК Дата,
	|	ВЫБОР
	|		КОГДА НЕ ГрафикРабот.НачалоРабочегоДня ЕСТЬ NULL
	|			ТОГДА ДОБАВИТЬКДАТЕ(Календарь.ДатаКалендаря, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), ГрафикРабот.НачалоРабочегоДня, СЕКУНДА))
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(Календарь.ДатаКалендаря, ЧАС, &НачалоРабочегоДня)
	|	КОНЕЦ КАК ВремяНачала,
	|	ВЫБОР
	|		КОГДА НЕ ГрафикРабот.КонецРабочегоДня ЕСТЬ NULL
	|			ТОГДА ДОБАВИТЬКДАТЕ(Календарь.ДатаКалендаря, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), ГрафикРабот.КонецРабочегоДня, СЕКУНДА))
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(Календарь.ДатаКалендаря, ЧАС, &КонецРабочегоДня)
	|	КОНЕЦ КАК ВремяОкончания
	|ПОМЕСТИТЬ втКалендарь
	|ИЗ
	|	РегистрСведений.DMS_ПроизводственныйКалендарь КАК Календарь
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_ДилерскиеЦентры.АвтосервисГрафикРабот КАК ГрафикРабот
	|		ПО (ГрафикРабот.Ссылка = &ДилерскийЦентр)
	|			И (ДЕНЬНЕДЕЛИ(Календарь.ДатаКалендаря) = ГрафикРабот.ДеньНедели)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЦеха КАК втЦеха
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Календарь.ДатаКалендаря МЕЖДУ &ДатаПланирования И &ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втКалендарь.Цех,
	|	МИНИМУМ(втКалендарь.Дата) КАК НачалоКалендаря,
	|	МАКСИМУМ(КОНЕЦПЕРИОДА(втКалендарь.Дата, ДЕНЬ)) КАК КонецКалендаря
	|ПОМЕСТИТЬ втГраницыКалендаря
	|ИЗ
	|	втКалендарь КАК втКалендарь
	|
	|СГРУППИРОВАТЬ ПО
	|	втКалендарь.Цех
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_АвтосервисПланРабот.Цех КАК Цех,
	|	Renault_АвтосервисПланРабот.ВремяНачала КАК НачалоРаботы,
	|	Renault_АвтосервисПланРабот.ВремяОкончания КАК КонецРаботы,
	|	НАЧАЛОПЕРИОДА(Renault_АвтосервисПланРабот.ВремяНачала, ДЕНЬ) КАК НачалоДня,
	|	КОНЕЦПЕРИОДА(Renault_АвтосервисПланРабот.ВремяОкончания, ДЕНЬ) КАК КонецДня
	|ПОМЕСТИТЬ втПериодыРаботы
	|ИЗ
	|	втЦеха КАК втЦеха
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_АвтосервисПланРабот КАК Renault_АвтосервисПланРабот
	|		ПО втЦеха.Цех = Renault_АвтосервисПланРабот.Цех
	|			И (Renault_АвтосервисПланРабот.ВремяОкончания > &ДатаПланирования)
	|			И (Renault_АвтосервисПланРабот.ВремяНачала < &ДатаОкончания)
	|			И (&УсловиеИсключитьСлоты)
	|			И (&УсловиеИсключитьОбращение)
	//DMSREN-981.
	|			И (Renault_АвтосервисПланРабот.ДилерскийЦентр = &ДилерскийЦентр)
	//---
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НерабочиеПериоды.Цех,
	|	НерабочиеПериоды.ВремяНачала,
	|	НерабочиеПериоды.ВремяОкончания,
	|	НерабочиеПериоды.НачалоДня,
	|	НерабочиеПериоды.КонецДня
	|ИЗ
	|	втНерабочиеПериоды КАК НерабочиеПериоды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПериодыРаботы.Цех,
	|	МИНИМУМ(втПериодыРаботы.НачалоРаботы) КАК НачалоРаботы,
	|	МАКСИМУМ(втПериодыРаботы.КонецРаботы) КАК КонецРаботы
	|ПОМЕСТИТЬ втГраницыПериодаРаботы
	|ИЗ
	|	втПериодыРаботы КАК втПериодыРаботы
	|
	|СГРУППИРОВАТЬ ПО
	|	втПериодыРаботы.Цех
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втГраницыКалендаря.Цех,
	|	втГраницыКалендаря.НачалоКалендаря КАК НачалоДня,
	|	втГраницыКалендаря.НачалоКалендаря КАК НачалоПростоя,
	|	ЕСТЬNULL(втГраницыПериодаРаботы.НачалоРаботы, втГраницыКалендаря.КонецКалендаря) КАК КонецПростоя
	|ПОМЕСТИТЬ втГраничныеПериодыПростоя
	|ИЗ
	|	втГраницыКалендаря КАК втГраницыКалендаря
	|		ЛЕВОЕ СОЕДИНЕНИЕ втГраницыПериодаРаботы КАК втГраницыПериодаРаботы
	|		ПО втГраницыКалендаря.Цех = втГраницыПериодаРаботы.Цех
	|ГДЕ
	|	ЕСТЬNULL(втГраницыПериодаРаботы.НачалоРаботы, втГраницыКалендаря.КонецКалендаря) > втГраницыКалендаря.НачалоКалендаря
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	втГраницыКалендаря.Цех,
	|	НАЧАЛОПЕРИОДА(ЕСТЬNULL(втГраницыПериодаРаботы.КонецРаботы, втГраницыКалендаря.НачалоКалендаря), ДЕНЬ),
	|	ЕСТЬNULL(втГраницыПериодаРаботы.КонецРаботы, втГраницыКалендаря.НачалоКалендаря),
	|	втГраницыКалендаря.КонецКалендаря
	|ИЗ
	|	втГраницыКалендаря КАК втГраницыКалендаря
	|		ЛЕВОЕ СОЕДИНЕНИЕ втГраницыПериодаРаботы КАК втГраницыПериодаРаботы
	|		ПО втГраницыКалендаря.Цех = втГраницыПериодаРаботы.Цех
	|ГДЕ
	|	втГраницыКалендаря.КонецКалендаря > ЕСТЬNULL(втГраницыПериодаРаботы.КонецРаботы, втГраницыКалендаря.НачалоКалендаря)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПериодыРаботы.Цех,
	|	втПериодыРаботы.НачалоРаботы,
	|	втПериодыРаботы.КонецРаботы,
	|	МАКСИМУМ(ЕСТЬNULL(ПредыдущиеПериоды.КонецРаботы, втПериодыРаботы.НачалоДня)) КАК КонецПредыдущего,
	|	МИНИМУМ(ЕСТЬNULL(СледующиеПериоды.НачалоРаботы, втПериодыРаботы.КонецДня)) КАК НачалоСледующего,
	|	втПериодыРаботы.НачалоДня,
	|	втПериодыРаботы.КонецДня
	|ПОМЕСТИТЬ втДополненныеПериоды
	|ИЗ
	|	втПериодыРаботы КАК втПериодыРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПериодыРаботы КАК ПредыдущиеПериоды
	|		ПО втПериодыРаботы.НачалоРаботы > ПредыдущиеПериоды.НачалоРаботы
	|		И втПериодыРаботы.Цех = ПредыдущиеПериоды.Цех 
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПериодыРаботы КАК СледующиеПериоды
	|		ПО втПериодыРаботы.КонецРаботы < СледующиеПериоды.КонецРаботы
	|		И втПериодыРаботы.Цех = СледующиеПериоды.Цех 
	|
	|СГРУППИРОВАТЬ ПО
	|	втПериодыРаботы.Цех,
	|	втПериодыРаботы.НачалоДня,
	|	втПериодыРаботы.КонецДня,
	|	втПериодыРаботы.НачалоРаботы,
	|	втПериодыРаботы.КонецРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втДополненныеПериоды.Цех,
	|	НАЧАЛОПЕРИОДА(втДополненныеПериоды.КонецПредыдущего, ДЕНЬ) КАК НачалоДня,
	|	втДополненныеПериоды.КонецПредыдущего КАК НачалоПростоя,
	|	втДополненныеПериоды.НачалоРаботы КАК КонецПростоя
	|ПОМЕСТИТЬ втПростои
	|ИЗ
	|	втДополненныеПериоды КАК втДополненныеПериоды
	|ГДЕ
	|	втДополненныеПериоды.НачалоРаботы > втДополненныеПериоды.КонецПредыдущего
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	втДополненныеПериоды.Цех,
	|	НАЧАЛОПЕРИОДА(втДополненныеПериоды.КонецРаботы, ДЕНЬ),
	|	втДополненныеПериоды.КонецРаботы,
	|	втДополненныеПериоды.НачалоСледующего
	|ИЗ
	|	втДополненныеПериоды КАК втДополненныеПериоды
	|ГДЕ
	|	втДополненныеПериоды.НачалоСледующего > втДополненныеПериоды.КонецРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втГраничныеПериодыПростоя.Цех КАК Цех,
	|	втГраничныеПериодыПростоя.НачалоДня КАК Дата,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втКалендарь.ВремяНачала, втГраничныеПериодыПростоя.НачалоПростоя) > втГраничныеПериодыПростоя.НачалоПростоя
	|			ТОГДА втКалендарь.ВремяНачала
	|		ИНАЧЕ втГраничныеПериодыПростоя.НачалоПростоя
	|	КОНЕЦ КАК ВремяНачала,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втКалендарь.ВремяОкончания, втГраничныеПериодыПростоя.КонецПростоя) < втГраничныеПериодыПростоя.КонецПростоя
	|			ТОГДА втКалендарь.ВремяОкончания
	|		ИНАЧЕ втГраничныеПериодыПростоя.КонецПростоя
	|	КОНЕЦ КАК ВремяОкончания
	|ПОМЕСТИТЬ втВсеСвободныеИнтервалы
	|ИЗ
	|	втГраничныеПериодыПростоя КАК втГраничныеПериодыПростоя
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКалендарь КАК втКалендарь
	|		ПО втГраничныеПериодыПростоя.Цех = втКалендарь.Цех
	|			И втГраничныеПериодыПростоя.НачалоДня <= втКалендарь.Дата
	|			И втГраничныеПериодыПростоя.КонецПростоя >= втКалендарь.Дата
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	втПростои.Цех,
	|	втПростои.НачалоДня,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втКалендарь.ВремяНачала, втПростои.НачалоПростоя) > втПростои.НачалоПростоя
	|			ТОГДА втКалендарь.ВремяНачала
	|		ИНАЧЕ втПростои.НачалоПростоя
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втКалендарь.ВремяОкончания, втПростои.КонецПростоя) < втПростои.КонецПростоя
	|			ТОГДА втКалендарь.ВремяОкончания
	|		ИНАЧЕ втПростои.КонецПростоя
	|	КОНЕЦ
	|ИЗ
	|	втПростои КАК втПростои
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКалендарь КАК втКалендарь
	|		ПО втПростои.Цех = втКалендарь.Цех
	|			И втПростои.НачалоДня <= втКалендарь.Дата
	|			И втПростои.КонецПростоя >= втКалендарь.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втВсеСвободныеИнтервалы.Цех КАК Цех,
	|	ВЫБОР
	|		КОГДА втВсеСвободныеИнтервалы.Цех = &ПриоритетЦех
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ПорядокЦех,
	|	1 КАК КоличествоСегментов,
	|	ЛОЖЬ КАК Исключить, 
	|	ЕСТЬNULL(ЦехаАвтосервиса.НомерСтроки, 0) КАК НомерЦеха, 
	|	НАЧАЛОПЕРИОДА(втВсеСвободныеИнтервалы.ВремяНачала, ДЕНЬ) КАК Дата,
	|	втВсеСвободныеИнтервалы.ВремяНачала КАК ВремяНачалаИнтервала,
	|	втВсеСвободныеИнтервалы.ВремяОкончания КАК ВремяОкончания,
	|	ВЫБОР
	|		КОГДА втВсеСвободныеИнтервалы.ВремяНачала > &ВремяПланирования
	|			ТОГДА втВсеСвободныеИнтервалы.ВремяНачала
	|		ИНАЧЕ &ВремяПланирования
	|	КОНЕЦ КАК ВремяНачала,
	|	РАЗНОСТЬДАТ(ВЫБОР
	|			КОГДА втВсеСвободныеИнтервалы.ВремяНачала > &ВремяПланирования
	|				ТОГДА втВсеСвободныеИнтервалы.ВремяНачала
	|			ИНАЧЕ &ВремяПланирования
	|		КОНЕЦ, втВсеСвободныеИнтервалы.ВремяОкончания, СЕКУНДА) / 3600 КАК Длительность,
	|	РАЗНОСТЬДАТ(ВЫБОР
	|			КОГДА втВсеСвободныеИнтервалы.ВремяНачала > &ВремяПланирования
	|				ТОГДА втВсеСвободныеИнтервалы.ВремяНачала
	|			ИНАЧЕ &ВремяПланирования
	|		КОНЕЦ, втВсеСвободныеИнтервалы.ВремяОкончания, СЕКУНДА) / 3600 КАК ДлинаИнтервала
	|ИЗ
	|	втВсеСвободныеИнтервалы КАК втВсеСвободныеИнтервалы
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_ДилерскиеЦентры.АвтосервисЦеха КАК ЦехаАвтосервиса
	|	ПО втВсеСвободныеИнтервалы.Цех = ЦехаАвтосервиса.Цех 
	|ГДЕ
	|	втВсеСвободныеИнтервалы.ВремяОкончания > &ВремяПланирования
	|	И втВсеСвободныеИнтервалы.ВремяОкончания > ВЫБОР
	|			КОГДА втВсеСвободныеИнтервалы.ВремяНачала > &ВремяПланирования
	|				ТОГДА втВсеСвободныеИнтервалы.ВремяНачала
	|			ИНАЧЕ &ВремяПланирования
	|		КОНЕЦ
	|	И РАЗНОСТЬДАТ(ВЫБОР
	|				КОГДА втВсеСвободныеИнтервалы.ВремяНачала > &ВремяПланирования
	|					ТОГДА втВсеСвободныеИнтервалы.ВремяНачала
	|				ИНАЧЕ &ВремяПланирования
	|			КОНЕЦ, втВсеСвободныеИнтервалы.ВремяОкончания, СЕКУНДА) / 3600 >= &ДлинаИнтервала
	////+++
	////Исключим посты которые зарезервированы под онлайн запись
	//| И Не втВсеСвободныеИнтервалы.Цех В (&ОнлайнПосты)
	////---
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокЦех,
	|   НомерЦеха,
	|	Цех,
	|	ВремяНачала";
	
	Возврат ТекстЗапроса;
	
КонецФункции 

Функция НайтиЗаявкуНаМойку(ОбращениеСсылка, ОбработанныеМойки = Неопределено) Экспорт
	
	Если ОбработанныеМойки = Неопределено Тогда
		ОбработанныеМойки = Новый Массив;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_CRM_ЗаявкаНаМойку.Ссылка
	|ИЗ
	|	Документ.Renault_CRM_ЗаявкаНаМойку КАК Renault_CRM_ЗаявкаНаМойку
	|ГДЕ
	|	Renault_CRM_ЗаявкаНаМойку.Обращение = &Обращение
	|	И НЕ Renault_CRM_ЗаявкаНаМойку.Ссылка В (&ОбработанныеМойки) ";
	Запрос.УстановитьПараметр("Обращение", ОбращениеСсылка);
	Запрос.УстановитьПараметр("ОбработанныеМойки", ОбработанныеМойки);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
	
КонецФункции

Функция ТаблицаМашиноместИзСписка(СписокМашиномест) Экспорт
	
	// Тип данных должен быть аналогичен измерению Цех в регистре Renault_АвтосервисПланРабот
	МетаданныеЦех = Метаданные.РегистрыСведений.Renault_АвтосервисПланРабот.Измерения.Цех;
	
	ТаблицаМашиномест = Новый ТаблицаЗначений;
	ТаблицаМашиномест.Колонки.Добавить("Машиноместо", МетаданныеЦех.Тип); 
	ТаблицаМашиномест.Колонки.Добавить("НомерПоста", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
	
	НПП = 1;
	Для каждого ТекЭлемент Из СписокМашиномест Цикл
		НовСтрока = ТаблицаМашиномест.Добавить();
		НовСтрока.Машиноместо = ТекЭлемент;
		НовСтрока.НомерПоста = НПП;
		НПП = НПП + 1;
	КонецЦикла; 
	
	Возврат ТаблицаМашиномест;
	
КонецФункции

Функция ПолучитьНачалоИКонецРабочегоДняДЦ(ДЦ, Дата) Экспорт	
	
	Возврат Renault_АвтосервисПланированиеПовтИспользования.ПолучитьНачалоИКонецРабочегоДняАвтосервиса(ДЦ, Дата);
	
КонецФункции

#КонецОбласти

Функция ПроверитьВремяПриемки(Приемка) Экспорт 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТолькоРаботающие",Ложь);
	//Параметры.Date = ПрочитатьДатуJSON(Параметры.date, ФорматДатыJSON.ISO);
	СвободныеИнтервалы = ПолучитьТаблицуСвободныхИнтервалов(НачалоДня(ТекущаяДата()), "Сотрудники", ДополнительныеПараметры);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвободныеИнтервалы.ВремяНачала КАК ДатаНачала,
	|	СвободныеИнтервалы.ВремяНачалаИнтервала КАК ДатаНачалаИнтервала,
	|	СвободныеИнтервалы.ВремяОкончания КАК ДатаОкончания,
	|	СвободныеИнтервалы.Дата КАК Дата,
	|	СвободныеИнтервалы.ДлинаИнтервала КАК ДлинаИнтервала,
	|	СвободныеИнтервалы.Длительность КАК Длительность,
	|	СвободныеИнтервалы.Цех КАК Цех
	|ПОМЕСТИТЬ ВТСвободныеИнтервалы
	|ИЗ
	|	&СвободныеИнтервалы КАК СвободныеИнтервалы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСвободныеИнтервалы.ДатаНачала КАК ДатаНачала,
	|	ВТСвободныеИнтервалы.ДатаНачалаИнтервала КАК ДатаНачалаИнтервала,
	|	ВТСвободныеИнтервалы.ДатаОкончания КАК ДатаОкончания,
	|	ВТСвободныеИнтервалы.Дата КАК Дата,
	|	ВТСвободныеИнтервалы.ДлинаИнтервала КАК ДлинаИнтервала,
	|	ВТСвободныеИнтервалы.Длительность КАК Длительность,
	|	ВТСвободныеИнтервалы.Цех КАК Цех
	|ИЗ
	|	ВТСвободныеИнтервалы КАК ВТСвободныеИнтервалы
	|ГДЕ
	|	ВТСвободныеИнтервалы.ДатаНачала <= &ДатаНачалаПриемки
	|	И ВТСвободныеИнтервалы.ДатаОкончания >= &ДатаОкончанияПриемки
	|	И ВТСвободныеИнтервалы.Цех = &Сотрудник";
	
	Запрос.УстановитьПараметр("СвободныеИнтервалы",СвободныеИнтервалы);
	Запрос.УстановитьПараметр("Сотрудник",Приемка.Исполнитель);
	Запрос.УстановитьПараметр("ДатаНачалаПриемки",Приемка.ВремяНачала);
	Запрос.УстановитьПараметр("ДатаОкончанияПриемки",Приемка.ВремяОкончания);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции

Процедура ОкруглитьДлительность(Длительность)
	
	ДлительностьМин = Длительность * 60;
	
	Если ДлительностьМин % 5 <> 0 Тогда 
		Длительность = (Цел(ДлительностьМин/5)+1)*5/60;
	КонецЕсли;

КонецПроцедуры

#Область ОтправкаЕмейл
#Если Клиент тогда
Процедура ОтправитьЕмейл(ТекущОбращение) Экспорт 
	
	если не ЗначениеЗаполнено(ТекущОбращение) тогда
		возврат
	КонецЕсли;
	
	Клиент = ТекущОбращение.Клиент;
	
	// +++ ВалиховГА 19.10.2021 DMSREN-1301 исправление
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ                      
	//|	КонтактнаяИнформация.Вид,
	//|	КонтактнаяИнформация.Представление,
	//|	КонтактнаяИнформация.Комментарий
	//|ИЗ
	//|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	//|ГДЕ
	//|	КонтактнаяИнформация.Объект = &Контрагент
	//|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)";
	//Запрос.УстановитьПараметр("Контрагент", Клиент);
	//
	//ПочтовыеАдресаКлиента = Запрос.Выполнить().Выгрузить();
	//Если ПочтовыеАдресаКлиента.Количество() = 1 Тогда
	//	ВыбраннаяСтрока = ПочтовыеАдресаКлиента[0];
	//Иначе
	//	ВыбраннаяСтрока = ПочтовыеАдресаКлиента.ВыбратьСтроку("Выберите почтовый адрес");
	//	Если ВыбраннаяСтрока = Неопределено Тогда
	//		Предупреждение("Не выбраны контактные данные");
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	//АдресКлиента = ВыбраннаяСтрока.Представление;
	
	АдресКлиента = АктуальныйАдресКлиента(Клиент);
	Если АдресКлиента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// --- ВалиховГА 19.10.2021 DMSREN-1301 исправление 
	
	Если НЕ ЗначениеЗаполнено(ТекущОбращение.ДилерскийЦентр) Тогда
		//Предупреждение("В кампании не указан дилерский центр");
		Возврат;
	КонецЕсли;
	ТекстСообщения = "";
	//ЕстьСообщение = ВвестиСтроку(ТекстСообщения, "Введите текст сообщения", 480);
	//Если ЕстьСообщение = Истина Тогда
	//	ТаблицаСообщений = Новый ТаблицаЗначений;
	//	ТаблицаСообщений.Колонки.Добавить("Получатели");
	//	ТаблицаСообщений.Колонки.Добавить("ТекстСообщения");
	//	ТаблицаСообщений.Колонки.Добавить("BIR");
	//	НоваяСтрока = ТаблицаСообщений.Добавить();
	//	НоваяСтрока.BIR = ТекущОбращение.ДилерскийЦентр.BIR;
	//	
	//	НоваяСтрока.ТекстСообщения = ТекстСообщения;
	//	Получатели = Новый ТаблицаЗначений;
	//	Получатели.Колонки.Добавить("Адрес");
	//	СтрокаПолучатель = Получатели.Добавить();
	//	СтрокаПолучатель.Адрес = АдресКлиента;
	//	НоваяСтрока.Получатели = Получатели;
	//	
	//	Renault_АвтосервисСервер.ВыполнитьРассылкуПисем(ТаблицаСообщений);
	//Иначе
	//	Возврат;
	//КонецЕсли;
	
	//ТекДанные = ЭлементыФормы.ТабличноеПолеВсеОбращения.ТекущиеДанные;
	ФормаСообщений = ЭтотОбъект.ПолучитьФорму("ФормОтправкиСообщений");
	СписокПараметров = ПолучитьПараметрыДляЕмейл(ТекущОбращение);
	ФормаСообщений.Тема=ТекущОбращение.ДилерскийЦентр.Наименование;
	ФормаСообщений.СписокПараметров = СписокПараметров;
	
	Структура=ФормаСообщений.ОткрытьМодально();
	
	Если Не ЗначениеЗаполнено(Структура) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекстСообщения=Структура.Текст;
	
	Если Структура<>Неопределено И ЗначениеЗаполнено(ТекстСообщения) Тогда
		//ТаблицаСообщений = Новый ТаблицаЗначений;
		//ТаблицаСообщений.Колонки.Добавить("Получатели");
		//ТаблицаСообщений.Колонки.Добавить("ТекстСообщения");
		//ТаблицаСообщений.Колонки.Добавить("BIR");
		//НоваяСтрока = ТаблицаСообщений.Добавить();
		//НоваяСтрока.BIR = ТекущОбращение.ДилерскийЦентр.BIR;
		//
		//НоваяСтрока.ТекстСообщения = ТекстСообщения;
		//Получатели = Новый ТаблицаЗначений;
		//Получатели.Колонки.Добавить("Адрес");
		//СтрокаПолучатель = Получатели.Добавить();
		//СтрокаПолучатель.Адрес = АдресКлиента;
		//НоваяСтрока.Получатели = Получатели;
		
		//Renault_АвтосервисСервер.ВыполнитьРассылкуПисем(ТаблицаСообщений);
		
		ТаблицаСообщений=Новый ТаблицаЗначений;
		ТаблицаСообщений.Колонки.Добавить("ИдентификаторСообщения");
		ТаблицаСообщений.Колонки.Добавить("ДатаПолучения");
		ТаблицаСообщений.Колонки.Добавить("Тема");
		ТаблицаСообщений.Колонки.Добавить("Текст");
		ТаблицаСообщений.Колонки.Добавить("Получатель");
		ТаблицаСообщений.Колонки.Добавить("ТекстШапки");
		ТаблицаСообщений.Колонки.Добавить("ТекстПодвала");
		Строка=ТаблицаСообщений.Добавить();
		Строка.Тема=Структура.Тема;
		Строка.Текст=ТекстСообщения;
		Строка.Получатель=АдресКлиента;
		
		
		ИмяФайла = "";
		ИмяФайлаЗаказНаряд = "";
		ИмяФайлаСертификатКонтроля = "";
		
		Если Структура.ВложитьЗаявку  Тогда
			ИмяФайла=СформироватьPDFЗаявку(СписокПараметров);
		КонецЕсли;
		Если Структура.ВложитьЗаказНаряд  Тогда
			ИмяФайлаЗаказНаряд=СформироватьPDFЗаказНаряд(СписокПараметров);
			//Сообщить("Создан заказ-наряд: " + ИмяФайлаЗаказНаряд);
		КонецЕсли;
		//Если Структура.ВложитьСертификатКонтроля  Тогда
		//	ИмяФайлаСертификатКонтроля=СформироватьPDFСертификатКонтроля();
		//	//Сообщить("Создан сертификат контроля: " + ИмяФайлаСертификатКонтроля);
		//КонецЕсли;
		
		
		Если ИмяФайла<>"" ИЛИ ИмяФайлаЗаказНаряд<>"" ИЛИ ИмяФайлаСертификатКонтроля<>"" Тогда
			ТаблицаСообщений.Колонки.Добавить("Вложение");
			ТаблицаВложений = Новый ТаблицаЗначений;
			ТаблицаВложений.Колонки.Добавить("Данные");
			ТаблицаВложений.Колонки.Добавить("Расширение");
			
			Если ИмяФайла<>"" Тогда
				Стр=ТаблицаВложений.Добавить();
				Стр.Данные=Новый ДвоичныеДанные(ИмяФайла);
				Стр.Расширение="pdf";
			КонецЕсли;
			Если ИмяФайлаЗаказНаряд<>"" Тогда
				Стр=ТаблицаВложений.Добавить();
				Стр.Данные=Новый ДвоичныеДанные(ИмяФайлаЗаказНаряд);
				Стр.Расширение="pdf";
			КонецЕсли;	
			Если ИмяФайлаСертификатКонтроля<>"" Тогда
				Стр=ТаблицаВложений.Добавить();
				Стр.Данные=Новый ДвоичныеДанные(ИмяФайлаСертификатКонтроля);
				Стр.Расширение="pdf";
			КонецЕсли;	
			Строка.Вложение=ТаблицаВложений;
		КонецЕсли;				
		Если ВыполнитьРассылкуПисемСВложением(ТекущОбращение.ДилерскийЦентр.BIR,ТаблицаСообщений) Тогда
			Сообщить("Сообщение отправлено",СтатусСообщения.Информация);
			// Трояновский К.Е. 12.07.2019 10:05:25 {
			// DMSCOR-1238
			ОбращениеОбъект = ТекущОбращение.ПолучитьОбъект();
			ОбращениеОбъект.EmailОтправлен = Истина;
			Если ТекущОбращение.Проведен Тогда
				ОбращениеОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Иначе
				ОбращениеОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			// Трояновский К.Е. 12.07.2019 10:05:25 }
		Иначе
			Сообщить("Не удалось отправить сообщение",СтатусСообщения.Внимание);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция АктуальныйАдресКлиента(Клиент) // +++ ВалиховГА 19.10.2021 DMSREN-1301
	
	Если НЕ ЗначениеЗаполнено(Клиент) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПочтовыеАдресаКлиента = ПочтовыеАдресаКлиента(Клиент);
	
	Если ПочтовыеАдресаКлиента.Количество() = 0 Тогда
		МенеджерЗаписи = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Объект = Клиент;
		МенеджерЗаписи.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		МенеджерЗаписи.Вид = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний;
		
		ОбработкаРедактирования = Обработки.РедактированиеКонтактнойИнформации.Создать();
		ОбработкаРедактирования.РедактированиеБезВладельца = Истина;
		ОбработкаРедактирования.РедактироватьЗапись(МенеджерЗаписи, Истина);
		
		Форма = ОбработкаРедактирования.ПолучитьФорму("ФормаЗаписиАдресаЭП", , "ФормаЗаписиАдресаЭП");
		Форма.ПоложениеОкна = ВариантПоложенияОкна.Центрировать;
		Форма.ОткрытьМодально();
		
		ПочтовыеАдресаКлиента = ПочтовыеАдресаКлиента(Клиент);
	КонецЕсли;
	
	Если ПочтовыеАдресаКлиента.Количество() = 1 Тогда
		ВыбраннаяСтрока = ПочтовыеАдресаКлиента[0];
	ИначеЕсли ПочтовыеАдресаКлиента.Количество() = 0 Тогда
		Предупреждение("Не введены контактные данные");
		Возврат Неопределено;
	Иначе
		ВыбраннаяСтрока = ПочтовыеАдресаКлиента.ВыбратьСтроку("Выберите почтовый адрес");
		Если ВыбраннаяСтрока = Неопределено Тогда
			Предупреждение("Не выбраны контактные данные");
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВыбраннаяСтрока.Представление;
	
КонецФункции

Функция ПочтовыеАдресаКлиента(Клиент) // +++ ВалиховГА 19.10.2021 DMSREN-1301
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ                      
	|	КонтактнаяИнформация.Вид,
	|	КонтактнаяИнформация.Представление,
	|	КонтактнаяИнформация.Комментарий
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Контрагент
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)";
	Запрос.УстановитьПараметр("Контрагент", Клиент);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция СформироватьPDFЗаявку(СписокПараметров)
	
    ТекущееОбращение = СписокПараметров[0].Значение;
	Приемка = СписокПараметров[3].Значение;
	Заявка = СписокПараметров[1].Значение;
	
	
	Если ЗначениеЗаполнено(ТекущееОбращение) Тогда
		Отказ = Ложь;
		ПроверкаОбращенияНаПотенциальныхКлиентаИАвто(ТекущееОбращение, Отказ);
		Если Отказ Тогда
			Сообщить("Не удалось перевести потенциальных контрагента и/или автомобиль на реальные");
			Возврат ""
		КонецЕсли;
	Иначе
		Предупреждение("Не заполнено ""Обращение""!");
		Возврат ""
	КонецЕсли;	
	
	//Заявка = ЭлементыФормы.ТабличноеПолеВсеОбращения.ТекущаяСтрока.ЗаявкаНаСервис;
	//Приемка = ЭлементыФормы.ТабличноеПолеВсеОбращения.ТекущаяСтрока.НачатьПриемку;
	Если ЗначениеЗаполнено(Приемка) Тогда
		КлиентБудетОжидатьОкончаниеРемонта = Приемка.Ссылка.КлиентБудетОжидатьОкончаниеРемонта;
		СохранятьЗамененныеЗЧ = Приемка.Ссылка.СохранятьЗамененныеЗЧ;
	Иначе
		КлиентБудетОжидатьОкончаниеРемонта = Ложь;
		СохранятьЗамененныеЗЧ = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Заявка) Тогда
		ТабДок=Заявка.Ссылка.ПолучитьОбъект().ПодготовитьФормуЗаявкиКПечати(КлиентБудетОжидатьОкончаниеРемонта, СохранятьЗамененныеЗЧ);
		ТабДок.АвтоМасштаб=Истина;
		ТабДок.ШиринаСтраницы=190;
		ИмяФайла=ПолучитьИмяВременногоФайла("pdf");
		ТабДок.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.PDF);
		Возврат ИмяФайла
	Иначе
		Возврат ""
	КонецЕсли;
	
КонецФункции

Функция СформироватьPDFЗаказНаряд(СписокПараметров)
	
	ИмяФайла = "";
	ЗаявкаНаСервис = СписокПараметров[1].Значение;
	Если Не ЗначениеЗаполнено(ЗаявкаНаСервис) или не ЗначениеЗаполнено(ЗаявкаНаСервис.ЗаказНаряд) Тогда
		Сообщить("Необходимо сначала создать заказ-наряд!",СтатусСообщения.Внимание);
		Возврат ИмяФайла;
	КонецЕсли;
	//
	//ЗаявкаНаРемонт = ЭлементыФормы.ТабличноеПолеВсеОбращения.ТекущаяСтрока.ЗаявкаНаСервис;
	
	Если Не ЗначениеЗаполнено(ЗаявкаНаСервис.ЗаказНаряд) Тогда
		Сообщить("Необходимо сначала создать заказ-наряд!",СтатусСообщения.Внимание);
		Возврат ИмяФайла;
	КонецЕсли;
	
	СсылкаДокумента = ЗаявкаНаСервис.ЗаказНаряд.Ссылка;
	
	ИмяОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(СсылкаДокумента)).Имя;
	Попытка
		ПечатныеФормыСтандартные = Документы[ИмяОбъекта].ПолучитьСписокПечатныхФорм(?(ЗначениеЗаполнено(СсылкаДокумента), СсылкаДокумента, Документы[ИмяОбъекта].ПустаяСсылка()));
	Исключение
		Если ЗначениеЗаполнено(СсылкаДокумента) Тогда
			ПечатныеФормыСтандартные = СсылкаДокумента.ПолучитьОбъект().ПолучитьСписокПечатныхФорм(СсылкаДокумента);
		Иначе
			ПечатныеФормыСтандартные = Новый Структура();
		КонецЕсли;			
	КонецПопытки;
	ПечатныеФормы = дкПолучитьСписокВнешнихПечатныхФорм(?(ЗначениеЗаполнено(СсылкаДокумента), СсылкаДокумента, Документы[ИмяОбъекта].ПустаяСсылка()), ПечатныеФормыСтандартные);
	
	печФормы = Новый СписокЗначений;
	
	Для Каждого ТекМакет Из ПечатныеФормы Цикл
		печФормы.Добавить( ТекМакет.Значение, ТекМакет.Значение);
	КонецЦикла;
		
	НазваниеПечатнойФормы = печФормы.ВыбратьЭлемент("Выберите печатную форму заказ-наряда из списка:");
	ТабДок = дкПечать(СсылкаДокумента.Ссылка.ПолучитьОбъект(), НазваниеПечатнойФормы, 1);
	ТабДок.АвтоМасштаб=Истина;
	ТабДок.ШиринаСтраницы=190;
	ИмяФайла=ПолучитьИмяВременногоФайла("pdf");
	ТабДок.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.PDF);
	
	Возврат ИмяФайла;

КонецФункции

Функция ВыполнитьРассылкуПисемСВложением(BIR,ТаблицаСообщений)
	Настройки=Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	ВСОпределение=Новый WSОпределения(СокрЛП(Настройки.КЦАдресСервера) + "ws/ContactCenter.ws?wsdl", СокрЛП(Настройки.ЛогинДоступаКВебСервисам), СокрЛП(Настройки.ПарольДоступаКВебСервисам));
	ВебСервис=Новый WSПрокси(ВСОпределение, "http://renault-nissan.com/schema/ContactCenter", "Renault_ContactCenter", "Renault_ContactCenterSoap12",300);
	ВебСервис.Пользователь=СокрЛП(Настройки.ЛогинДоступаКВебСервисам);
	ВебСервис.Пароль=СокрЛП(Настройки.ПарольДоступаКВебСервисам);
	Сериализатор=Новый СериализаторXDTO(ВебСервис.ФабрикаXDTO);
	
	ТаблицаРезультат=Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("ИдентификаторСообщения");
	ТаблицаРезультат.Колонки.Добавить("ДатаПолучения");
	ТаблицаРезультат.Колонки.Добавить("Тема");
	ТаблицаРезультат.Колонки.Добавить("Текст");
	ТаблицаРезультат.Колонки.Добавить("Получатель");
	//ТаблицаРезультат.Колонки.Добавить("ТипТрафика");
	Строка=ТаблицаРезультат.Добавить();
	
	ПараметрыСоединения=Сериализатор.ЗаписатьXDTO(ТаблицаРезультат);
	ПараметрыПисьма=Сериализатор.ЗаписатьXDTO(ТаблицаСообщений);

	// НАЧАЛО Крайнев МА 30.10.2018 DMSCOR-843
	ОтветСервера = ВебСервис.SendMailMessage(BIR, ПараметрыСоединения, ПараметрыПисьма);
	
	Если ТипЗнч(ОтветСервера) = Тип("Строка") Тогда
		
		ЗначениеОтвета = Ложь;
		
		Если ОтветСервера = "0" Тогда
			ЗначениеОтвета = Истина;
		КонецЕсли;
		
	Иначе
		
		ЗначениеОтвета = ОтветСервера;
		
	КонецЕсли;

	Возврат ЗначениеОтвета;
	// КОНЕЦ
	
КонецФункции

Функция ПолучитьПараметрыДляЕмейл(Обращение)
	
	запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	Renault_CRM_ОбращениеВАвтоСервис.Ссылка КАК ОбращениеВАвтоСервис,
	               |	Renault_CRM_ОбращениеВАвтоСервис.Клиент КАК Клиент,
	               |	Renault_CRM_ОбращениеВАвтоСервис.Автомобиль КАК Автомобиль,
	               |	Renault_CRM_ЗаявкаНаСервис.Ссылка КАК ЗаявкаНаСервис,
	               |	Renault_CRM_ВыдачаАвтомобиля.Ссылка КАК ВыдачаАвтомобиля,
	               |	Renault_CRM_ПриемкаАвтомобиля.Ссылка КАК ПриемкаАвтомобиля
	               |ИЗ
	               |	Документ.Renault_CRM_ОбращениеВАвтоСервис КАК Renault_CRM_ОбращениеВАвтоСервис
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ПриемкаАвтомобиля КАК Renault_CRM_ПриемкаАвтомобиля
	               |		ПО (Renault_CRM_ПриемкаАвтомобиля.Обращение = Renault_CRM_ОбращениеВАвтоСервис.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ВыдачаАвтомобиля КАК Renault_CRM_ВыдачаАвтомобиля
	               |		ПО (Renault_CRM_ВыдачаАвтомобиля.Обращение = Renault_CRM_ОбращениеВАвтоСервис.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
	               |		ПО (Renault_CRM_ЗаявкаНаСервис.Обращение = Renault_CRM_ОбращениеВАвтоСервис.Ссылка)
	               |ГДЕ
	               |	Renault_CRM_ОбращениеВАвтоСервис.Ссылка = &Ссылка";
	
	запрос.Параметры.Вставить("Ссылка",Обращение);
	
	выборка = запрос.Выполнить().Выбрать();
	
	если выборка.Следующий() тогда
		
		СписокПараметров = Новый списокзначений; 
		СписокПараметров.Добавить(выборка.ОбращениеВАвтоСервис);
		СписокПараметров.Добавить(выборка.ЗаявкаНаСервис);
		СписокПараметров.Добавить(выборка.ВыдачаАвтомобиля);
		СписокПараметров.Добавить(выборка.ПриемкаАвтомобиля);
		СписокПараметров.Добавить(выборка.Клиент);
		СписокПараметров.Добавить(выборка.Автомобиль)
		
	КонецЕсли;
	
	возврат СписокПараметров;
	
КонецФункции

Процедура ПроверкаОбращенияНаПотенциальныхКлиентаИАвто(Обращение, Отказ)
	КонтрагентКлиент = Неопределено;
	АвтомобильНовый = Неопределено;
	КонтрагентВладелецАвто = Неопределено;
	
	НачатьТранзакцию();
	
	Попытка 
		Если ТипЗнч(Обращение.Клиент) = Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты") Тогда
			
			ВопросПользователю = Вопрос("В заявке потенциальный клиент. Создать клиента?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
			
			Если ВопросПользователю = КодВозвратаДиалога.Да Тогда
				ПотенциальныйКлиент = Обращение.Клиент;

				КонтрагентКлиент = CRM_Редубликация.СоздатьКонтрагентаНаОснованииПотенциальногоКлиента(ПотенциальныйКлиент);
								
				Если НЕ ЗначениеЗаполнено(КонтрагентКлиент) Тогда
					Отказ = Истина;
					ОтменитьТранзакцию();
					Возврат;
				КонецЕсли;
				
				СоздатьДоговорВзаиморасчетовДляКонтрагента(КонтрагентКлиент);

				Запись = РегистрыСведений.Renault_КлиентыНаЗамену.СоздатьМенеджерЗаписи();
				Запись.Клиент = ПотенциальныйКлиент;
				Запись.Записать();				
			Иначе
				Отказ = Истина;
				ОтменитьТранзакцию();
				Возврат;
			КонецЕсли; 
		КонецЕсли;
		
		Если ТипЗнч(Обращение.ВладелецАвтомобиля) = Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты") И
			Обращение.ВладелецАвтомобиля <> Обращение.Клиент Тогда
			
			ВопросПользователю = Вопрос("В заявке владелец автомобиля отличается от клиента и является потенциальным контрагентом. Создать владельца авто?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
			
			Если ВопросПользователю = КодВозвратаДиалога.Да Тогда
				ПотенциальныйВладелецАвто = Обращение.ВладелецАвтомобиля;

				КонтрагентВладелецАвто = CRM_Редубликация.СоздатьКонтрагентаНаОснованииПотенциальногоКлиента(ПотенциальныйВладелецАвто);
				
				Если НЕ ЗначениеЗаполнено(КонтрагентВладелецАвто) Тогда
					Отказ = Истина;
					ОтменитьТранзакцию();
					Возврат;
				КонецЕсли;
				
				СоздатьДоговорВзаиморасчетовДляКонтрагента(КонтрагентВладелецАвто);
				
				Запись = РегистрыСведений.Renault_КлиентыНаЗамену.СоздатьМенеджерЗаписи();
				Запись.Клиент = ПотенциальныйВладелецАвто;
				Запись.Записать();				
			Иначе
				Отказ = Истина;
				ОтменитьТранзакцию();
				Возврат;
			КонецЕсли; 
		КонецЕсли;
		
		Если ТипЗнч(Обращение.Автомобиль) = Тип("СправочникСсылка.Renault_ЧерновикиАвтомобилей") Тогда
			
			ВопросПользователю = Вопрос("В заявке черновик автомобиля. Создать автомобиль?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
			
			Если ВопросПользователю = КодВозвратаДиалога.Да Тогда
				ЧерновикАвтомобиль = Обращение.Автомобиль;
				
				Если НЕ ЗначениеЗаполнено(Обращение.ВладелецАвтомобиля) ИЛИ Обращение.ВладелецАвтомобиля = Обращение.Клиент Тогда
					АвтомобильНовый = СоздатьАвтомобильИзЧерновика(ЧерновикАвтомобиль, КонтрагентКлиент);
				Иначе
					АвтомобильНовый = СоздатьАвтомобильИзЧерновика(ЧерновикАвтомобиль, КонтрагентВладелецАвто);
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(АвтомобильНовый) Тогда
					Отказ = Истина;
					ОтменитьТранзакцию();
					Возврат;
				КонецЕсли; 				
			Иначе
				Отказ = Истина;
				ОтменитьТранзакцию();
				Возврат;
			КонецЕсли; 
		КонецЕсли;
		
		ТекстАвто = "";
		ТекстКонтрагент = "";
		ТекстВладелецАвто = "";
		Если КонтрагентКлиент <> Неопределено ИЛИ АвтомобильНовый <> Неопределено ИЛИ КонтрагентВладелецАвто <> Неопределено Тогда
			ПерезаписатьХозяина = Ложь;
			
			Если ЗначениеЗаполнено(КонтрагентКлиент) Тогда					
				КонтрагентДляЗамены = КонтрагентКлиент;
				ТекстКонтрагент = "Создан контрагент - " + КонтрагентКлиент.Наименование + ".";
				ПерезаписатьХозяина = Истина;
			Иначе
				КонтрагентДляЗамены = Обращение.Клиент;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(КонтрагентВладелецАвто) Тогда					
				ВладелецАвтоДляЗамены = КонтрагентВладелецАвто;
				ТекстВладелецАвто = "Создан владелец авто - " + КонтрагентВладелецАвто.Наименование + ".";
				ПерезаписатьХозяина = Истина;
			Иначе
				ВладелецАвтоДляЗамены = Обращение.ВладелецАвтомобиля;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(АвтомобильНовый) Тогда					
				АвтомобильДляЗамены = АвтомобильНовый;
				ТекстАвто = "Создан автомобиль - " + АвтомобильНовый.Наименование + ".";
				ПерезаписатьХозяина = Ложь;
			Иначе
				АвтомобильДляЗамены = Обращение.Автомобиль;
			КонецЕсли;
			
			ПереводДанныхСПотенциальныхАвтоИКонтрагентаНаРеальных(Обращение,				 
				АвтомобильДляЗамены, КонтрагентДляЗамены, ВладелецАвтоДляЗамены);
				
			Если ПерезаписатьХозяина Тогда
				ВладелецДляПерезаписи = ?(ЗначениеЗаполнено(ВладелецАвтоДляЗамены), ВладелецАвтоДляЗамены, КонтрагентДляЗамены);
				Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(АвтомобильДляЗамены, ВладелецДляПерезаписи, Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин, НачалоДня(ТекущаяДата()));
			КонецЕсли;		

		КонецЕсли; 
		
		Если ЗначениеЗаполнено(ТекстВладелецАвто) Тогда
			Сообщить(ТекстВладелецАвто);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекстКонтрагент) Тогда
			Сообщить(ТекстКонтрагент);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекстАвто) Тогда
			Сообщить(ТекстАвто);
		КонецЕсли;	
	Исключение
		Отказ = Истина;
		ОтменитьТранзакцию();
		Возврат;
	КонецПопытки;
	
	ЗафиксироватьТранзакцию(); 
КонецПроцедуры

Процедура СоздатьДоговорВзаиморасчетовДляКонтрагента(КонтрагентСсылка)
	Если ЗначениеЗаполнено(ПараметрыСеанса.Организация) Тогда 			
		ТекОрганизация = ПараметрыСеанса.Организация; 			
	ИначеЕсли ЗначениеЗаполнено(ПараметрыСеанса.ПодразделениеКомпании) И ЗначениеЗаполнено(ПараметрыСеанса.ПодразделениеКомпании.Организация) Тогда
		ТекОрганизация = ПараметрыСеанса.ПодразделениеКомпании.Организация;
	ИначеЕсли ЗначениеЗаполнено(Справочники.ПодразделенияКомпании.ОсновноеПодразделение.Организация) Тогда
		ТекОрганизация = Справочники.ПодразделенияКомпании.ОсновноеПодразделение.Организация;
	Иначе
		ТекОрганизация = Справочники.Организации.ОсновнаяОрганизация;
	КонецЕсли;		
	
	ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
			                   |	ДоговорыВзаиморасчетов.Ссылка
			                   |ИЗ
			                   |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
			                   |ГДЕ
			                   |	ДоговорыВзаиморасчетов.Владелец = &Владелец
			                   |	И ДоговорыВзаиморасчетов.Организация = &Организация
			                   |	И ДоговорыВзаиморасчетов.ВидДоговора = &ВидДоговора");
							   
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);			   
	Запрос.УстановитьПараметр("Владелец", КонтрагентСсылка);
	Запрос.УстановитьПараметр("Организация", ТекОрганизация);
	Результат = Запрос.Выполнить();
			
	Если Результат.Пустой() Тогда 		
		ДогОбъект = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
		//ДогОбъект.ОбработкаЗаполнения(Неопределено);
		ДогОбъект.Владелец = КонтрагентСсылка;
		ДогОбъект.Организация = ТекОрганизация;
		ДогОбъект.ВидДоговора = ВидДоговора;
		ДогОбъект.УстановитьНовыйКод();
		ДогОбъект.Подразделение = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
		ДогОбъект.ВидОплаты = Перечисления.ВидыОплаты.БезналичныйРасчет;
		ДогОбъект.ДатаНачала = НачалоГода(ТекущаяДата());
		ДогОбъект.ТипЦенПродажи = Справочники.ТипыЦен.ОсновнойТипЦенПродажи;
		
		ВалютаВзаиморасчетов = обПраво("ОсновнаяВалютаВзаиморасчетов",глПрава,,ДогОбъект.Подразделение);
		Если ВалютаВзаиморасчетов.Пустая() Тогда
			ДогОбъект.ВалютаВзаиморасчетов = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
		Иначе
			ДогОбъект.ВалютаВзаиморасчетов = ВалютаВзаиморасчетов;
		КонецЕсли; 
		
		ДогОбъект.Наименование = "Договор №" + ДогОбъект.Код + " с " + КонтрагентСсылка.Наименование;		
		ДогОбъект.ДляАвтосервиса = Истина;
		ДогОбъект.ТипДоговора = Перечисления.ТипыДоговоров.Договор;
		ДогОбъект.АвтоЗакрытиеСделок=обПраво("АвтоЗакрытиеСделок",глПрава,,ТекОрганизация);
		ДогОбъект.Записать();
		
		ДогСсылка = ДогОбъект.Ссылка;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		ДогСсылка = Выборка.Ссылка;
	КонецЕсли;	
	
	КонтрагентОбъект = КонтрагентСсылка.ПолучитьОбъект();
	КонтрагентОбъект.ОсновнойДоговорВзаиморасчетов = ДогСсылка;
	КонтрагентОбъект.Записать(); 
КонецПроцедуры

Функция СоздатьАвтомобильИзЧерновика(ЧерновикАвтомобиль, ВладелецНовогоАвто)
	НачалоДняДата = НачалоДня(ТекущаяДата());
	
	НовыйЭлемент = Справочники.Автомобили.СоздатьЭлемент();
	НовыйЭлемент.VIN = ЧерновикАвтомобиль.VIN;
	НовыйЭлемент.Модель = ЧерновикАвтомобиль.Модель;
	НовыйЭлемент.ГодВыпуска = ЧерновикАвтомобиль.ГодВыпуска;
	НовыйЭлемент.НаименованиеПолное = ЧерновикАвтомобиль.НаименованиеПолное;
	НовыйЭлемент.Наименование = ЧерновикАвтомобиль.Наименование;
	НовыйЭлемент.Цвет = ЧерновикАвтомобиль.Цвет;
	НовыйЭлемент.ВариантКомплектации = ЧерновикАвтомобиль.ВариантКомплектации;
	НовыйЭлемент.ДатаНачалаГарантии = ЧерновикАвтомобиль.ДатаНачалаГарантии;
	НовыйЭлемент.ТипДвигателя = ЧерновикАвтомобиль.ТипДвигателя;
	НовыйЭлемент.ТипКПП = ЧерновикАвтомобиль.ТипКПП;
	НовыйЭлемент.ВключатьВПрайсЛист = ЧерновикАвтомобиль.ВключатьВПрайсЛист;
	НовыйЭлемент.ВалютаУчета = ЧерновикАвтомобиль.ВалютаУчета;
	НовыйЭлемент.УстановитьНовыйКод(); 
	НовыйЭлемент.ОбменДанными.Загрузка = Истина; 
	НовыйЭлемент.Записать();
	
	ЧерновикАвтомобильОбъект = ЧерновикАвтомобиль.ПолучитьОбъект();
	ЧерновикАвтомобильОбъект.Автомобиль = НовыйЭлемент.Ссылка;
	ЧерновикАвтомобильОбъект.Записать();
	
	Если ЗначениеЗаполнено(ЧерновикАвтомобиль.Пробег) Тогда	
		Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(НовыйЭлемент.Ссылка, ЧерновикАвтомобиль.Пробег, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег, НачалоДняДата);
	КонецЕсли;					
					
	Если ЗначениеЗаполнено(ЧерновикАвтомобиль.ГосНомер) Тогда 						
		Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(НовыйЭлемент.Ссылка, ЧерновикАвтомобиль.ГосНомер, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер, НачалоДняДата);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЧерновикАвтомобиль.Хозяин) И ТипЗнч(ЧерновикАвтомобиль.Хозяин) = Тип("СправочникСсылка.Контрагенты") Тогда
		Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(НовыйЭлемент.Ссылка, ЧерновикАвтомобиль.Хозяин, Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин, НачалоДняДата);
	Иначе
		Если ЗначениеЗаполнено(ВладелецНовогоАвто) И ЗначениеЗаполнено(ЧерновикАвтомобиль.Хозяин) И
			ВладелецНовогоАвто.Наименование = ЧерновикАвтомобиль.Хозяин.Наименование Тогда 						
			Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(НовыйЭлемент.Ссылка, ВладелецНовогоАвто, Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин, НачалоДняДата);
		КонецЕсли;
	КонецЕсли;	
	
	Запись = РегистрыСведений.Renault_АвтомобилиДопРеквизиты.СоздатьМенеджерЗаписи();
	Запись.Автомобиль = НовыйЭлемент.Ссылка; 		
	Запись.AC = ЧерновикАвтомобиль.AC;
	Запись.ГУР = ЧерновикАвтомобиль.ГУР;
	Запись.СалонныйФильтр = ЧерновикАвтомобиль.СалонныйФильтр;
	Запись.СемействоАвтомобиля = ЧерновикАвтомобиль.СемействоАвтомобиля; 	
	Запись.Записать(); 
	
	Возврат НовыйЭлемент.Ссылка;
КонецФункции

Процедура ПереводДанныхСПотенциальныхАвтоИКонтрагентаНаРеальных(Обращение, НовыйАвтомобиль, НовыйКлиент, НовыйВладелецАвто)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_CRM_ЗаявкаНаСервис.Ссылка КАК Документ
		|ИЗ
		|	Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
		|ГДЕ
		|	Renault_CRM_ЗаявкаНаСервис.Обращение = &Обращение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Renault_CRM_ЗаявкаНаМойку.Ссылка
		|ИЗ
		|	Документ.Renault_CRM_ЗаявкаНаМойку КАК Renault_CRM_ЗаявкаНаМойку
		|ГДЕ
		|	Renault_CRM_ЗаявкаНаМойку.Обращение = &Обращение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Renault_CRM_ПриемкаАвтомобиля.Ссылка
		|ИЗ
		|	Документ.Renault_CRM_ПриемкаАвтомобиля КАК Renault_CRM_ПриемкаАвтомобиля
		|ГДЕ
		|	Renault_CRM_ПриемкаАвтомобиля.Обращение = &Обращение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Renault_CRM_ВыдачаАвтомобиля.Ссылка
		|ИЗ
		|	Документ.Renault_CRM_ВыдачаАвтомобиля КАК Renault_CRM_ВыдачаАвтомобиля
		|ГДЕ
		|	Renault_CRM_ВыдачаАвтомобиля.Обращение = &Обращение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Renault_CRM_ЗаявкаНаПодменныйАвто.Ссылка
		|ИЗ
		|	Документ.Renault_CRM_ЗаявкаНаПодменныйАвто КАК Renault_CRM_ЗаявкаНаПодменныйАвто
		|ГДЕ
		|	Renault_CRM_ЗаявкаНаПодменныйАвто.Обращение = &Обращение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Renault_CRM_ОбращениеВАвтоСервис.Ссылка
		|ИЗ
		|	Документ.Renault_CRM_ОбращениеВАвтоСервис КАК Renault_CRM_ОбращениеВАвтоСервис
		|ГДЕ
		|	Renault_CRM_ОбращениеВАвтоСервис.Ссылка = &Обращение"; 	
	Запрос.УстановитьПараметр("Обращение", Обращение); 	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДокументОбъект = Выборка.Документ.ПолучитьОбъект();
			ДокументОбъект.Клиент = НовыйКлиент;
			ДокументОбъект.Автомобиль = НовыйАвтомобиль;
			Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.Renault_CRM_ОбращениеВАвтоСервис") Тогда
				ДокументОбъект.ВладелецАвтомобиля = НовыйВладелецАвто;
			ИначеЕсли ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.Renault_CRM_ПриемкаАвтомобиля") Тогда 
				ДокументОбъект.ВладалецАвтомобиля = НовыйВладелецАвто;
			КонецЕсли;			
			ДокументОбъект.Записать();
		КонецЦикла;	
	КонецЕсли;		
КонецПроцедуры
#КонецЕсли
#КонецОбласти

СтруктураЦветов = Renault_ОбщиеФункцииСервер.МультибрендПараметрыОформления();
Приемка = Справочники.Автоработы.Приемка;
Выдача = Справочники.Автоработы.Выдача;
