Процедура КаждыйДень() Экспорт		
	Запрос = Новый Запрос;
	Запрос.Текст = 		
	"ВЫБРАТЬ
	|	СМГ_РабочиеДниМастеровПриемщиков.Сервис КАК Сервис,
	|	СУММА(СМГ_РабочиеДниМастеровПриемщиков.КоличествоРабочихДней) КАК КоличествоРабочихДней
	|ПОМЕСТИТЬ ВТ_НачМес
	|ИЗ
	|	РегистрСведений.СМГ_РабочиеДниМастеровПриемщиков КАК СМГ_РабочиеДниМастеровПриемщиков
	|ГДЕ
	|	СМГ_РабочиеДниМастеровПриемщиков.Период = &НачалоМесяца
	|
	|СГРУППИРОВАТЬ ПО
	|	СМГ_РабочиеДниМастеровПриемщиков.Сервис
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СервисыПодразделения.Подразделение КАК Подразделение,
	|	СМГ_План_Выработки_Сотрудников_По_СервисамПланы_Сервисов.Сервис КАК Сервис,
	|	СМГ_План_Выработки_Сотрудников_По_СервисамПланы_Сервисов.План КАК План
	|ПОМЕСТИТЬ ВТ_Док
	|ИЗ
	|	Документ.СМГ_План_Выработки_Сотрудников_По_Сервисам.Планы_Сервисов КАК СМГ_План_Выработки_Сотрудников_По_СервисамПланы_Сервисов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сервисы.Подразделения КАК СервисыПодразделения
	|		ПО СМГ_План_Выработки_Сотрудников_По_СервисамПланы_Сервисов.Сервис = СервисыПодразделения.Ссылка
	|ГДЕ
	|	СМГ_План_Выработки_Сотрудников_По_СервисамПланы_Сервисов.Ссылка.ДатаНачалаМесяца = &НачалоМесяца
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	ВТ_Док.Сервис КАК Сервис,
	|	ВТ_Док.План КАК План
	|ПОМЕСТИТЬ ВТ_Сотрудники
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Док КАК ВТ_Док
	|		ПО (ВЫБОР
	|				КОГДА Сотрудники.Подразделение = ВТ_Док.Подразделение
	|					ТОГДА Сотрудники.Подразделение
	|				ИНАЧЕ Сотрудники.Подразделение.Родитель
	|			КОНЕЦ = ВТ_Док.Подразделение)
	|ГДЕ
	|	НЕ Сотрудники.ПометкаУдаления
	|	И НЕ Сотрудники.ФлагУволен
	|	И Сотрудники.Должность = &Должность
	|	И Сотрудники.ДатаПриема <= &ТекДата
	|	И Сотрудники.Подразделение В ИЕРАРХИИ
	|			(ВЫБРАТЬ
	|				ВТ_Док.Подразделение КАК Ссылка
	|			ИЗ
	|				ВТ_Док КАК ВТ_Док)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сотрудники.Сотрудник КАК Сотрудник,
	|	ВТ_Сотрудники.Сервис КАК Сервис,
	|	ВТ_Сотрудники.План КАК План,
	|	КОЛИЧЕСТВО(ГрафикРаботКалендарный.Дата) КАК КоличествоРД
	|ПОМЕСТИТЬ ВТ_РДКалендарьТекДата
	|ИЗ
	|	ВТ_Сотрудники КАК ВТ_Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикРаботКалендарный КАК ГрафикРаботКалендарный
	|		ПО ВТ_Сотрудники.Сотрудник.ГрафикРаботы = ГрафикРаботКалендарный.График
	|ГДЕ
	|	ГрафикРаботКалендарный.Дата МЕЖДУ &ТекДата И &КонецМесяца
	|	И ГрафикРаботКалендарный.ВидДня = &ВидДня
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Сотрудники.Сотрудник,
	|	ВТ_Сотрудники.Сервис,
	|	ВТ_Сотрудники.План
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РДКалендарьТекДата.Сотрудник КАК Сотрудник,
	|	ВТ_РДКалендарьТекДата.Сервис КАК Сервис,
	|	ГрафикРаботКалендарный.ВидДня КАК ВидДня
	|ПОМЕСТИТЬ ВТ_ВидДняТекДата
	|ИЗ
	|	ВТ_РДКалендарьТекДата КАК ВТ_РДКалендарьТекДата
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикРаботКалендарный КАК ГрафикРаботКалендарный
	|		ПО ВТ_РДКалендарьТекДата.Сотрудник.ГрафикРаботы = ГрафикРаботКалендарный.График
	|ГДЕ
	|	ГрафикРаботКалендарный.Дата = &ТекДата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сотрудники.Сотрудник КАК Сотрудник,
	|	ВТ_Сотрудники.Сервис КАК Сервис,
	|	ЕСТЬNULL(ВТ_РДКалендарьТекДата.КоличествоРД, РАЗНОСТЬДАТ(&ТекДата, &КонецМесяца, ДЕНЬ) + 1) КАК КоличествоРД,
	|	ЕСТЬNULL(ВТ_ВидДняТекДата.ВидДня, ЗНАЧЕНИЕ(Перечисление.ВидДня.Рабочий)) КАК ВидДня,
	|	ВТ_Сотрудники.План КАК План
	|ПОМЕСТИТЬ ВТ_ВидКолРДСотрудникиТекДата
	|ИЗ
	|	ВТ_Сотрудники КАК ВТ_Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РДКалендарьТекДата КАК ВТ_РДКалендарьТекДата
	|		ПО ВТ_Сотрудники.Сотрудник = ВТ_РДКалендарьТекДата.Сотрудник
	|			И ВТ_Сотрудники.Сервис = ВТ_РДКалендарьТекДата.Сервис
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВидДняТекДата КАК ВТ_ВидДняТекДата
	|		ПО ВТ_Сотрудники.Сотрудник = ВТ_ВидДняТекДата.Сотрудник
	|			И ВТ_Сотрудники.Сервис = ВТ_ВидДняТекДата.Сервис
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сотрудники.Сотрудник КАК Сотрудник,
	|	ВТ_Сотрудники.Сервис КАК Сервис,
	|	ВТ_ВидКолРДСотрудникиТекДата.КоличествоРД КАК КоличествоРД,
	|	ВЫБОР
	|		КОГДА ВТ_ВидКолРДСотрудникиТекДата.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидДня.Рабочий)
	|			ТОГДА (ВТ_Сотрудники.План - ВТ_Сотрудники.План / ВТ_НачМес.КоличествоРабочихДней * (ВТ_НачМес.КоличествоРабочихДней - ВТ_ВидКолРДСотрудникиТекДата.КоличествоРД)) / ВТ_ВидКолРДСотрудникиТекДата.КоличествоРД
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИндивидуальныйПлан
	|ИЗ
	|	ВТ_ВидКолРДСотрудникиТекДата КАК ВТ_ВидКолРДСотрудникиТекДата
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сотрудники КАК ВТ_Сотрудники
	|		ПО ВТ_ВидКолРДСотрудникиТекДата.Сотрудник = ВТ_Сотрудники.Сотрудник
	|			И ВТ_ВидКолРДСотрудникиТекДата.Сервис = ВТ_Сотрудники.Сервис
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НачМес КАК ВТ_НачМес
	|		ПО ВТ_ВидКолРДСотрудникиТекДата.Сервис = ВТ_НачМес.Сервис";		
	
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(ТекущаяДата()));  
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(ТекущаяДата())); 
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата()); 
	Запрос.УстановитьПараметр("Должность", Справочники.Должности.МастерПриемщик);
	Запрос.УстановитьПараметр("ВидДня", Перечисления.ВидДня.Рабочий);
	
	ВыгрузкаЗапроса = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписей = РегистрыСведений.СМГ_РабочиеДниМастеровПриемщиков.СоздатьНаборЗаписей(); 	
	
	Для каждого Строка Из ВыгрузкаЗапроса Цикл
		Новая_Запись 					   = НаборЗаписей.Добавить();
		Новая_Запись.Период 			   = ТекущаяДата();
		Новая_Запись.Сервис 			   = Строка.Сервис; 		
		Новая_Запись.Сотрудник 			   = Строка.Сотрудник;
		Новая_Запись.КоличествоРабочихДней = Строка.КоличествоРД;	
		Новая_Запись.ИндивидуальныйПлан	   = Строка.ИндивидуальныйПлан; 
	КонецЦикла;	
	
	НаборЗаписей.Записать(Ложь);  
	
КонецПроцедуры

//Галактионов ++ 27032025
Процедура РассылкаУволенныхСотрудников() Экспорт 
	
	Таблица = РегистрыСведений.СМГ_УволенныеСотрудникиСегодня.ПолучитьСписокНаВыгрузкуСегодня(ТекущаяДата());
	
	Если Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	Таблица.Колонки.Добавить("GoogleАккаунт",Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ОсновнаяПочта",Новый ОписаниеТипов("Строка"));  
	
	МассивСоСтроками = Новый Массив; 
	СписокДолжностей = МассивДолжностей();
	
	Для Каждого Строка Из Таблица Цикл
		
		ПоискПоДолжности = СписокДолжностей.Найти(Строка.Сотрудник.Должность);
		
		Если ПоискПоДолжности = Неопределено Тогда
			МассивСоСтроками.Добавить(Строка);
			Продолжить;
		КонецЕсли;
		
		СтрокаГуглАккаунт   = киПолучитьПредставлениеКИ(Строка.Сотрудник,Справочники.ВидыКонтактнойИнформации.GoogleАккаунт);
		СтрокаОсновнаяПочта = киПолучитьПредставлениеКИ(Строка.Сотрудник,Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
		
		Если Не ЗначениеЗаполнено(СтрокаГуглАккаунт) И Не ЗначениеЗаполнено(СтрокаОсновнаяПочта)Тогда
			МассивСоСтроками.Добавить(Строка);
			Продолжить;
		Иначе
			Строка.GoogleАккаунт = СтрокаГуглАккаунт;
			Строка.ОсновнаяПочта = СтрокаОсновнаяПочта;
		КонецЕсли;				
	КонецЦикла; 
	
	Для Каждого Строка Из МассивСоСтроками Цикл	
		Таблица.Удалить(Строка)	
	КонецЦикла;
	
	Если Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	ИтоговыйТекст = "Уволенные сотрудники сегодня (с Google аккаунтом и основной почтой):" + Символы.ПС;
	
	Для Каждого Строка Из Таблица Цикл	
		ИтоговыйТекст = ИтоговыйТекст + Строка.Сотрудник  
		+ Символы.ПС + "(Google) - " + ?(ЗначениеЗаполнено(Строка.GoogleАккаунт),Строка.GoogleАккаунт,"Нет") 
		+ Символы.ПС + "(Основная почта) - " + ?(ЗначениеЗаполнено(Строка.ОсновнаяПочта),Строка.ОсновнаяПочта,"Нет") + Символы.ПС;	
	КонецЦикла;
	
	ПолеВвода1 = ИтоговыйТекст;
	
	ПочтыДляОтправки = Новый Массив;
	ПочтыДляОтправки.Добавить("belikov_i@sokolmotors.ru");
	ПочтыДляОтправки.Добавить("seraya_t@sokolmotors.ru");
	ПочтыДляОтправки.Добавить("romanov_d@sokolmotors.ru");
	ПочтыДляОтправки.Добавить("galaktionov_vs@sokolmotors.ru");
	
	Тема = "Уволенные сотрудники " + Формат(ТекущаяДата(),"ДФ=дд.ММ.гггг"); 
	
	г_Функции.СоздатьИОтпраитьЭлПисьмо(ПочтыДляОтправки,"",Тема,ИтоговыйТекст,Документы.ЗаказНаряд.ПустаяСсылка());
	
КонецПроцедуры

Функция МассивДолжностей()
	
	Массив = Новый Массив;    
	
	Должности = Справочники.Должности; 
	
	Массив.Добавить(Должности.АдминистраторТорговогоЗала);
	Массив.Добавить(Должности.МенеджерОтделаПродажАвтомобилей);
	Массив.Добавить(Должности.МенеджерОтделаПродажАвтомобилейСПробегом);
	Массив.Добавить(Должности.РуководительОтделаПродажАвтомобилей);
	Массив.Добавить(Должности.РуководительОтделаПродажАвтомобилейСПробегом);
	
	Возврат Массив; 
	
КонецФункции
//Галактионов -- 27032025 

//Иванченко 20250408 ++
Функция ЗапретПечатиДКП(Ссылка, ПечатнаяФорма) Экспорт  
	//Иванченко 20250811 ++
	Запрет = Ложь;  
	//Иванченко 20250811 --	
	
	Если ПечатнаяФорма = "Универсальная печать договора (внешняя)" Тогда 	
		Хозяин = Справочники.Организации.ПустаяСсылка();   
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		//Иванченко 20250811 ++
		//"ВЫБРАТЬ
		//|	ЗаказНаАвтомобиль.Ссылка КАК ЗаказНаАвтомобиль
		//|ИЗ
		//|	Документ.ЗаказНаряд КАК ЗаказНаряд
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаАвтомобиль КАК ЗаказНаАвтомобиль
		//|		ПО ЗаказНаряд.Автомобиль = ЗаказНаАвтомобиль.Автомобиль
		//|ГДЕ
		//|	(ЗаказНаряд.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ДопОборудованиеСогласованноеСДилером)
		//|			ИЛИ ЗаказНаряд.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ДополнительноеОборудование)
		//|			ИЛИ ЗаказНаряд.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ДополнительноеОборудованиеСубподряд))
		//|	И ЗаказНаряд.Состояние <> ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)
		//|	И ЗаказНаряд.Состояние <> ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		//|	И ЗаказНаряд.Автомобиль В ИЕРАРХИИ
		//|			(ВЫБРАТЬ
		//|				ОстаткиАвтомобилей.Автомобиль КАК Автомобиль
		//|			ИЗ
		//|				РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилей
		//|					ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|						ПоступлениеАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
		//|						ПоступлениеАвтомобилейАвтомобили.СуммаВсего КАК СуммаВсего,
		//|						ПоступлениеАвтомобилейАвтомобили.Ссылка КАК Ссылка
		//|					ИЗ
		//|						Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили) КАК ВложенныйЗапрос
		//|					ПО
		//|						ОстаткиАвтомобилей.Автомобиль = ВложенныйЗапрос.Автомобиль
		//|							И ОстаткиАвтомобилей.Партия = ВложенныйЗапрос.Ссылка
		//|					ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|						ПоступлениеАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
		//|						ПоступлениеАвтомобилейАвтомобили.СуммаВсего КАК СуммаВсего,
		//|						ПоступлениеАвтомобилейАвтомобили.Ссылка КАК Ссылка
		//|					ИЗ
		//|						Документ.ВводОстатковАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили) КАК ВложенныйЗапрос1
		//|					ПО
		//|						ОстаткиАвтомобилей.Автомобиль = ВложенныйЗапрос1.Автомобиль
		//|							И ОстаткиАвтомобилей.Партия = ВложенныйЗапрос1.Ссылка
		//|			ГДЕ
		//|				ОстаткиАвтомобилей.КоличествоОстаток > 0)
		//|	И ЗаказНаАвтомобиль.Ссылка = &Ссылка
		//|	И ЗаказНаряд.Состояние <> ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Заявка)
		//|	И ЗаказНаряд.Состояние <> ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Отказ)
		//|	И ЗаказНаАвтомобиль.Проведен
		//|	И ЗаказНаряд.Проведен";
		"ВЫБРАТЬ
		|	ЗаказНаАвтомобиль.Ссылка КАК ЗаказНаАвтомобиль,
		|	ЗаказНаряд.Ссылка КАК ЗаказНаряд
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаАвтомобиль КАК ЗаказНаАвтомобиль
		|		ПО ЗаказНаряд.Автомобиль = ЗаказНаАвтомобиль.Автомобиль
		|ГДЕ
		|	(ЗаказНаряд.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ДопОборудованиеСогласованноеСДилером)
		|			ИЛИ ЗаказНаряд.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ДополнительноеОборудование)
		|			ИЛИ ЗаказНаряд.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ДополнительноеОборудованиеСубподряд))
		|	И ЗаказНаряд.Состояние <> ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)
		|	И ЗаказНаряд.Состояние <> ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|	И ЗаказНаряд.Состояние <> ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Заявка)
		|	И ЗаказНаряд.Состояние <> ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Отказ)
		|	И ЗаказНаряд.Автомобиль В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				ОстаткиАвтомобилей.Автомобиль КАК Автомобиль
		|			ИЗ
		|				РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилей
		|					ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|						ПоступлениеАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
		|						ПоступлениеАвтомобилейАвтомобили.СуммаВсего КАК СуммаВсего,
		|						ПоступлениеАвтомобилейАвтомобили.Ссылка КАК Ссылка
		|					ИЗ
		|						Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили) КАК ВложенныйЗапрос
		|					ПО
		|						ОстаткиАвтомобилей.Автомобиль = ВложенныйЗапрос.Автомобиль
		|							И ОстаткиАвтомобилей.Партия = ВложенныйЗапрос.Ссылка
		|					ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|						ПоступлениеАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
		|						ПоступлениеАвтомобилейАвтомобили.СуммаВсего КАК СуммаВсего,
		|						ПоступлениеАвтомобилейАвтомобили.Ссылка КАК Ссылка
		|					ИЗ
		|						Документ.ВводОстатковАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили) КАК ВложенныйЗапрос1
		|					ПО
		|						ОстаткиАвтомобилей.Автомобиль = ВложенныйЗапрос1.Автомобиль
		|							И ОстаткиАвтомобилей.Партия = ВложенныйЗапрос1.Ссылка
		|			ГДЕ
		|				ОстаткиАвтомобилей.КоличествоОстаток > 0)
		|	И ЗаказНаАвтомобиль.Проведен
		|	И ЗаказНаряд.Проведен
		|	И ЗаказНаАвтомобиль.Ссылка = &Ссылка";
		//Иванченко 20250811 --		
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		//Иванченко 20250812 ++		
		Если РезультатЗапроса.Количество() <> 0 Тогда
			Запрет = Истина;	
		КонецЕсли;
		
		//КонецЕсли;
		
		Возврат Запрет;  
		//Возврат РезультатЗапроса;
		//Иванченко 20250812 --	
		
	КонецЕсли;	
	
	Возврат Запрет;  
	
КонецФункции 
//Иванченко 20250408 --  

//Иванченко 20250606 ++
//Для регламентного задания по выгрузке прайс-листов оптовикам, внешняя обработка Прайс-лист для оптовиков 2022 с возможностью учёта минималки
Процедура ВыгрузитьПрайсЛисты() Экспорт
	ВнешняяОбработка = Справочники.ВнешниеПечатныеФормы.НайтиПоКоду("ЦБ000729");//ЦБ001310"); //  
	ДвоичныеДанные   = ВнешняяОбработка.Хранилище.Получить();	
	ВременныйФайл = ПолучитьИмяВременногоФайла();	
	ДвоичныеДанные.Записать(ВременныйФайл);  
	ОбъектОбработки = ВнешниеОбработки.Создать(ВременныйФайл);
	
	КлючОбъекта = "ПрайсЛистДляОптовиков";
	СписокКлючей = ХранилищеОбщихНастроек.ПолучитьСписок(КлючОбъекта, Справочники.Пользователи.Робот);
	
	Для каждого Ключ Из СписокКлючей Цикл     
		СтруктураРеквизитов = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта, Ключ.Значение,, Справочники.Пользователи.Робот);  
		
		ОбъектОбработки.ЗагрузитьПрайсНаFTP = СтруктураРеквизитов.ЗагрузитьПрайсНаFTP;
		ОбъектОбработки.ЗначениеОтбораОрганизации = СтруктураРеквизитов.ЗначениеОтбораОрганизации;
		ОбъектОбработки.ЗначениеОтбораПроизводителя = СтруктураРеквизитов.ЗначениеОтбораПроизводителя;
		ОбъектОбработки.ЗначениеОтбораТиповСкладов = СтруктураРеквизитов.ЗначениеОтбораТиповСкладов;
		ОбъектОбработки.ИгнорироватьЦенуУценки = СтруктураРеквизитов.ИгнорироватьЦенуУценки;
		ОбъектОбработки.ИмяФайлаПрайса = СтруктураРеквизитов.ИмяФайлаПрайса;
		ОбъектОбработки.ИспользоватьПрайсЛистыКонтрагентов = СтруктураРеквизитов.ИспользоватьПрайсЛистыКонтрагентов;
		ОбъектОбработки.Коэффициент = СтруктураРеквизитов.Коэффициент;
		ОбъектОбработки.КоэффициентНеликвид = СтруктураРеквизитов.КоэффициентНеликвид;
		ОбъектОбработки.НеНижеМинимальнойЦены = СтруктураРеквизитов.НеНижеМинимальнойЦены;
		ОбъектОбработки.Отладка = СтруктураРеквизитов.Отладка;
		ОбъектОбработки.ПересчитатьПоМаксимальнойЦене = СтруктураРеквизитов.ПересчитатьПоМаксимальнойЦене;
		ОбъектОбработки.ПроверятьСвойствоРазливной = СтруктураРеквизитов.ПроверятьСвойствоРазливной;
		ОбъектОбработки.РазослатьПрайсПоЭлектроннойПочте = СтруктураРеквизитов.РазослатьПрайсПоЭлектроннойПочте;
		ОбъектОбработки.РасширениеФайлаПрайса = СтруктураРеквизитов.РасширениеФайлаПрайса;
		ОбъектОбработки.СнижатьОстаткиНаВеличинуМинималки = СтруктураРеквизитов.СнижатьОстаткиНаВеличинуМинималки;
		ОбъектОбработки.ТолькоЗаполнение = СтруктураРеквизитов.ТолькоЗаполнение;
		ОбъектОбработки.ТолькоНеликвид = СтруктураРеквизитов.ТолькоНеликвид;
		ОбъектОбработки.ФайлПроизводителей = СтруктураРеквизитов.ФайлПроизводителей;
		ОбъектОбработки.ВключаемыеСклады.Загрузить(СтруктураРеквизитов.ВключаемыеСклады);
		ОбъектОбработки.ГруппыНоменклатуры.Загрузить(СтруктураРеквизитов.ГруппыНоменклатуры);
		ОбъектОбработки.ДляРедактирования.Загрузить(СтруктураРеквизитов.ДляРедактирования);
		ОбъектОбработки.ИсключенныеПроизводители.Загрузить(СтруктураРеквизитов.ИсключенныеПроизводители);
		ОбъектОбработки.КлассыДвижения.Загрузить(СтруктураРеквизитов.КлассыДвижения);
		ОбъектОбработки.Организации.Загрузить(СтруктураРеквизитов.Организации);
		ОбъектОбработки.Подразделения.Загрузить(СтруктураРеквизитов.Подразделения);
		ОбъектОбработки.ПолучателиПисем.Загрузить(СтруктураРеквизитов.ПолучателиПисем);
		ОбъектОбработки.ПроцентыНаценки.Загрузить(СтруктураРеквизитов.ПроцентыНаценки);
		ОбъектОбработки.СписокПрайсЛистов.Загрузить(СтруктураРеквизитов.СписокПрайсЛистов);
		ОбъектОбработки.СписокСкладовПрайсЛистов.Загрузить(СтруктураРеквизитов.СписокСкладовПрайсЛистов);
		ОбъектОбработки.ТипыИсключаемыхСкладов.Загрузить(СтруктураРеквизитов.ТипыИсключаемыхСкладов);  		
		ОбъектОбработки.Период = ТекущаяДата(); 
		
		ОбъектОбработки.ВыполнитьНажатие();		
	КонецЦикла;		
	
КонецПроцедуры
//Иванченко 20250606 --  

//Иванченко 20250612 ++
Процедура ВыгрузитьТоварыКомплектацииВCSV() Экспорт      
	ГдеСоздавать = "\\1cserver\powerbi\service\";
	МаскаФайла = "komplekt.csv";
	МассивФайлов = НайтиФайлы(ГдеСоздавать, МаскаФайла); 	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КомплектацияАвтомобиляТовары.Ссылка.Дата КАК КомплектацияАвтомобиляДата,
	|	КомплектацияАвтомобиляТовары.Ссылка.Номер КАК КомплектацияАвтомобиляНомер,
	|	КомплектацияАвтомобиляТовары.Ссылка.ПодразделениеКомпании.ДилерскийЦентр КАК ДилерскийЦентр,
	|	КомплектацияАвтомобиляТовары.Номенклатура КАК Номенклатура,
	|	КомплектацияАвтомобиляТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
	|	КомплектацияАвтомобиляТовары.Сумма КАК СуммаТовары,
	|	КомплектацияАвтомобиляТовары.Количество КАК КоличествоТовары,
	|	КомплектацияАвтомобиляТовары.Коэффициент КАК Коэффициент,
	|	КомплектацияАвтомобиляТовары.Количество * КомплектацияАвтомобиляТовары.Коэффициент КАК КоличествоБазовое,
	|	АВТОНОМЕРЗАПИСИ() КАК Индекс
	|ПОМЕСТИТЬ ВТ_Рез
	|ИЗ
	|	Документ.КомплектацияАвтомобиля.Товары КАК КомплектацияАвтомобиляТовары
	|ГДЕ
	|	КомплектацияАвтомобиляТовары.Ссылка.Проведен
	|	И КомплектацияАвтомобиляТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
	|	И КомплектацияАвтомобиляТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ТекДата
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Индекс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Рез.КомплектацияАвтомобиляДата КАК КомплектацияАвтомобиляДата,
	|	ВТ_Рез.КомплектацияАвтомобиляНомер КАК КомплектацияАвтомобиляНомер,
	|	ВТ_Рез.ДилерскийЦентр КАК ДилерскийЦентр,
	|	ВТ_Рез.Номенклатура КАК Номенклатура,
	|	ВТ_Рез.НоменклатураАртикул КАК НоменклатураАртикул,
	|	ВТ_Рез.СуммаТовары КАК СуммаТовары,
	|	ВТ_Рез.КоличествоТовары КАК КоличествоТовары,
	|	ВТ_Рез.Коэффициент КАК Коэффициент,
	|	ВТ_Рез.КоличествоБазовое КАК КоличествоБазовое,
	|	ВТ_Рез.Индекс КАК Индекс
	|ИЗ
	|	ВТ_Рез КАК ВТ_Рез
	|
	|УПОРЯДОЧИТЬ ПО
	|	КомплектацияАвтомобиляДата";    
	
	Если МассивФайлов.Количество() = 0 Тогда
		Запрос.УстановитьПараметр("ДатаНачала", '20240101');   
		Текст = "";   		
	Иначе
		Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата() - 86400)); 		
		ЧтениеТекста = Новый ЧтениеТекста;
		ЧтениеТекста.Открыть("\\1cserver\powerbi\service\komplekt.csv");
		Текст = ЧтениеТекста.Прочитать();
		ЧтениеТекста.Закрыть();				
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТекДата", КонецДня(ТекущаяДата() - 86400));   
	Выборка = Запрос.Выполнить().Выбрать();    
	Счетчик = 0;  
	ВременныйТекстовыйДокумент = Новый ТекстовыйДокумент;
	ВременныйТекстовыйДокумент.УстановитьТекст(Текст);	
	Сообщить("Всего записей: " + Выборка.Количество());
	
	Пока Выборка.Следующий() Цикл 
		
		Если Счетчик % 10000 = 0 Тогда
			Сообщить(Счетчик);
		КонецЕсли;
		
		СтрокаВыгрузки = 							
		СМ_ЧЕРИ_Сервер.ФорматироватьДляCSV(СокрЛП(Формат(Выборка.КомплектацияАвтомобиляДата, "ДЛФ=DT"))) + ";" + 	  
		СМ_ЧЕРИ_Сервер.ФорматироватьДляCSV(СокрЛП(Выборка.КомплектацияАвтомобиляНомер))	   				 + ";" +
		СМ_ЧЕРИ_Сервер.ФорматироватьДляCSV(СокрЛП(Выборка.ДилерскийЦентр))	   							 + ";" +	
		СМ_ЧЕРИ_Сервер.ФорматироватьДляCSV(СокрЛП(Выборка.Номенклатура))	   							 + ";" +	
		СМ_ЧЕРИ_Сервер.ФорматироватьДляCSV(СокрЛП(Выборка.НоменклатураАртикул))	  						 + ";" +	
		СМ_ЧЕРИ_Сервер.ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СуммаТовары, "ЧН=0")))	  				 + ";" +
		СМ_ЧЕРИ_Сервер.ФорматироватьДляCSV(СокрЛП(Формат(Выборка.КоличествоТовары, "ЧН=0")))	  		 + ";" +	
		СМ_ЧЕРИ_Сервер.ФорматироватьДляCSV(СокрЛП(Формат(Выборка.Коэффициент, "ЧН=0")))	  				 + ";" +	
		СМ_ЧЕРИ_Сервер.ФорматироватьДляCSV(СокрЛП(Формат(Выборка.КоличествоБазовое, "ЧН=0")));		
		ВременныйТекстовыйДокумент.ДобавитьСтроку(СтрокаВыгрузки);
		Счетчик = Счетчик + 1;
	КонецЦикла;  
	
	Попытка
		ВременныйТекстовыйДокумент.Записать(ГдеСоздавать + МаскаФайла);
		Сообщить("Файл остатков успешно выгружен: " + ГдеСоздавать + МаскаФайла); 
	Исключение
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Сообщить("Не удалось записать файл: " + ГдеСоздавать + МаскаФайла + Символы.ПС + ТекстОшибки);
	КонецПопытки; 
	
КонецПроцедуры
//Иванченко 20250612 --  

//Иванченко 20251011 ++
// Вспомогательная функция для корректного форматирования CSV. Она предотвращает "съезжание" колонок, если в данных есть кавычки или точка с запятой.
Функция ФорматироватьДляCSV(Значение) Экспорт
	
	//Форматирование вывода
	Если Значение = Неопределено ИЛИ Значение = NULL Тогда
		Возврат "";
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		СтрокаЗначения = СокрЛП(Значение);
	КонецЕсли;
	
	НайденоОсобыхСимволов = Ложь;
	
	// Проверка на наличие опасных символов
	НайденоОсобыхСимволов = НайденоОсобыхСимволов Или (СтрНайти(СтрокаЗначения, ";") > 0);
	НайденоОсобыхСимволов = НайденоОсобыхСимволов Или (СтрНайти(СтрокаЗначения, Символ(34)) > 0); // "
	НайденоОсобыхСимволов = НайденоОсобыхСимволов Или (СтрНайти(СтрокаЗначения, Символы.ПС) > 0);   // \n
	НайденоОсобыхСимволов = НайденоОсобыхСимволов Или (СтрНайти(СтрокаЗначения, Символы.ВК) > 0);   // \r
	
	Если НайденоОсобыхСимволов Тогда
		// Экранирование кавычек (удвоение)
		СтрокаЗначения = СтрЗаменить(СтрокаЗначения, """", """""");
		// Обрамление в двойные кавычки
		Возврат """" + СтрокаЗначения + """";
	Иначе
		Возврат СтрокаЗначения;
	КонецЕсли;
	
КонецФункции
//Иванченко 20251011 --  

//Иванченко 20251202 ++  
Процедура ВыгрузитьАвто() Экспорт  
	//ГдеСоздавать = "\\1cserver\powerbi\sklan_auto\";			
	ГдеСоздавать = "C:\Users\ivanchenko_ii\Downloads\Для Антона\auto\";
	МаскаФайла = "Avto_na_skladah_max.csv";	
	МассивФайлов = НайтиФайлы(ГдеСоздавать, МаскаФайла);
	СтрДата = '20250101'; 
	ПредСтрДата = '20250101';	
	
	//Если МассивФайлов.Количество() <> 0 Тогда   
	//	ЧтениеФайлаВыгрузки = Новый ЧтениеТекста;	
	//	ЧтениеФайлаВыгрузки.Открыть(ГдеСоздавать + МаскаФайла);  
	//	СтрокаФайлаВыгрузки = ЧтениеФайлаВыгрузки.ПрочитатьСтроку();
	//	
	//	Пока СтрокаФайлаВыгрузки <> Неопределено Цикл;  
	//		
	//		Попытка
	//			СтрДата = НачалоДня(Дата(Лев(СтрокаФайлаВыгрузки, 19)));    
	//		Исключение	
	//		КонецПопытки;  
	//		
	//		Если СтрДата = ПредСтрДата + 86400 ИЛИ СтрДата = ПредСтрДата Тогда
	//				
	//		Иначе
	//		
	//		КонецЕсли;
	//		
	//		СтрокаФайлаВыгрузки = ЧтениеФайлаВыгрузки.ПрочитатьСтроку();
	//		
	//		Если ПоследняяДата <> Неопределено Тогда	
	//			Дата = ПоследняяДата + 86400;	
	//		Иначе 
	//			Дата = НачалоДня(ТекущаяДата() - 86400); 
	//		КонецЕсли; 
	//		
	//	Иначе 
	//		Дата = НачалоДня(ТекущаяДата() - 86400); 		
	//	КонецЦикла;	 
	//	
	//КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РабочийЛист.Автомобиль КАК Автомобиль,
	|	ПоследнийРЛ.АвтомобильТрейдИн КАК АвтомобильТрейдИн,
	|	ПоследнийРЛ.Поступление КАК Поступление,
	|	РабочийЛист.ВыкупКомиссия КАК ВыкупКомиссия,
	|	РабочийЛист.ТрейдИн КАК ТрейдИн,
	|	РабочийЛист.ТолькоВыкуп КАК ТолькоВыкуп,
	|	РабочийЛист.ФамилияПриемщика КАК МенеджерАСП
	|ПОМЕСТИТЬ ВТ_ПоступлениеТрейдИн
	|ИЗ
	|	(ВЫБРАТЬ
	|		РабочийЛист.АвтомобильТрейдИн КАК АвтомобильТрейдИн,
	|		МАКСИМУМ(РабочийЛист.ПоступлениеАвтоТрэйдИн) КАК Поступление
	|	ИЗ
	|		Документ.РабочийЛист КАК РабочийЛист
	|	ГДЕ
	|		НЕ РабочийЛист.ПометкаУдаления
	|		И РабочийЛист.Проведен
	|		И РабочийЛист.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Продажа)
	|		И РабочийЛист.АвтомобильТрейдИн <> ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РабочийЛист.АвтомобильТрейдИн) КАК ПоследнийРЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РабочийЛист КАК РабочийЛист
	|		ПО ПоследнийРЛ.Поступление = РабочийЛист.ПоступлениеАвтоТрэйдИн
	|ГДЕ
	|	НЕ РабочийЛист.ПометкаУдаления
	|	И РабочийЛист.Проведен
	|	И РабочийЛист.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Продажа)
	|	И РабочийЛист.АвтомобильТрейдИн <> ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказателиМотивацииМОПСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
	|	ПоказателиМотивацииМОПСрезПоследних.ВидМотивации КАК ВидМотивации,
	|	ПоказателиМотивацииМОПСрезПоследних.Марка КАК Марка,
	|	ПоказателиМотивацииМОПСрезПоследних.Модель КАК Модель,
	|	НАЧАЛОПЕРИОДА(ПоказателиМотивацииМОПСрезПоследних.ГодВыпускаC, ГОД) КАК ГодВыпускаC,
	|	НАЧАЛОПЕРИОДА(ПоказателиМотивацииМОПСрезПоследних.ГодВыпускаПо, ГОД) КАК ГодВыпускаПо,
	|	ПоказателиМотивацииМОПСрезПоследних.СуммаБонуса КАК СуммаБонуса
	|ПОМЕСТИТЬ ВТ_Мотивация
	|ИЗ
	|	РегистрСведений.ПоказателиМотивацииМОП.СрезПоследних КАК ПоказателиМотивацииМОПСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОстаткиАвтомобилейОбороты.Период КАК Дата,
	|	ОстаткиАвтомобилейОбороты.СкладКомпании КАК Склад,
	|	ОстаткиАвтомобилейОбороты.Автомобиль КАК Автомобиль,
	|	ВЫБОР
	|		КОГДА ОстаткиАвтомобилейОбороты.Регистратор ССЫЛКА Документ.РеализацияАвтомобилей
	|			ТОГДА ОстаткиАвтомобилейОбороты.Регистратор
	|	КОНЕЦ КАК Реализация,
	|	ВЫБОР
	|		КОГДА ОстаткиАвтомобилейОбороты.Регистратор ССЫЛКА Документ.ОтгрузкаАвтомобиляБезРеализации
	|					И ОстаткиАвтомобилейОбороты.Регистратор.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтгрузкаАвтомобиляБезРеализации)
	|				ИЛИ ОстаткиАвтомобилейОбороты.Регистратор ССЫЛКА Документ.ОтгрузкаАвтомобиляБезРеализации
	|					И ОстаткиАвтомобилейОбороты.Регистратор.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтменаОтгрузкиАвтомобиляБезРеализации)
	|					И ОстаткиАвтомобилейОбороты.Регистратор.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ОтгрузкаАвтомобиляБезРеализации.ПустаяСсылка)
	|			ТОГДА ОстаткиАвтомобилейОбороты.Регистратор.Номер
	|		КОГДА НЕ ОстаткиАвтомобилейОбороты.Регистратор.ОтгрузкаАвтомобиляБезРеализации ЕСТЬ NULL
	|			ТОГДА ОстаткиАвтомобилейОбороты.Регистратор.ОтгрузкаАвтомобиляБезРеализации.Номер
	|	КОНЕЦ КАК ОтгрузкаБезРеализации,
	|	ВЫБОР
	|		КОГДА ОстаткиАвтомобилейОбороты.Регистратор ССЫЛКА Документ.ОтгрузкаАвтомобиляБезРеализации
	|				И ОстаткиАвтомобилейОбороты.Регистратор.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтменаОтгрузкиАвтомобиляБезРеализации)
	|			ТОГДА ОстаткиАвтомобилейОбороты.Регистратор.Номер
	|	КОНЕЦ КАК ООАБР,
	|	ВЫБОР
	|		КОГДА ОстаткиАвтомобилейОбороты.Регистратор.ДокументОснование ССЫЛКА Документ.РабочийЛист
	|			ТОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилейОбороты.Регистратор.ДокументОснование КАК Документ.РабочийЛист)
	|		КОГДА ОстаткиАвтомобилейОбороты.Регистратор.ДокументОснование.ДокументОснование ССЫЛКА Документ.РабочийЛист
	|			ТОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилейОбороты.Регистратор.ДокументОснование.ДокументОснование КАК Документ.РабочийЛист)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОстаткиАвтомобилейОбороты.Партия.ДокументОснование ССЫЛКА Документ.ЗаказНаВыкупАвтомобиля
	|					ТОГДА ВЫБОР
	|							КОГДА ОстаткиАвтомобилейОбороты.Партия.ДокументОснование.ДокументОснование ССЫЛКА Документ.РабочийЛист
	|								ТОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилейОбороты.Партия.ДокументОснование.ДокументОснование КАК Документ.РабочийЛист)
	|						КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК РабочийЛист,
	|	ЕСТЬNULL(ОстаткиАвтомобилейОбороты.КоличествоОборот, 0) КАК Количество_Остаток_Оборот,
	|	ЕСТЬNULL(-ОстаткиАвтомобилейОбороты.СуммаОборот, 0) КАК Сумма_Остаток_Оборот,
	|	ВТ_ПоступлениеТрейдИн.ВыкупКомиссия КАК ВыкупКомиссия,
	|	ВТ_ПоступлениеТрейдИн.ТрейдИн КАК ТрейдИн,
	|	ВТ_ПоступлениеТрейдИн.ТолькоВыкуп КАК ТолькоВыкуп,
	|	ВТ_ПоступлениеТрейдИн.Автомобиль.VIN КАК АвтомобильТрейдИн,
	|	ВТ_ПоступлениеТрейдИн.МенеджерАСП КАК МенеджерАСП
	|ПОМЕСТИТЬ ВТ_Основа
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Обороты(НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ), КОНЕЦПЕРИОДА(&Дата, ДЕНЬ), Регистратор, ) КАК ОстаткиАвтомобилейОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоступлениеТрейдИн КАК ВТ_ПоступлениеТрейдИн
	|		ПО ОстаткиАвтомобилейОбороты.Партия = ВТ_ПоступлениеТрейдИн.Поступление
	|			И ОстаткиАвтомобилейОбороты.Автомобиль = ВТ_ПоступлениеТрейдИн.АвтомобильТрейдИн
	|ГДЕ
	|	(ОстаткиАвтомобилейОбороты.Регистратор ССЫЛКА Документ.РеализацияАвтомобилей
	|			ИЛИ ОстаткиАвтомобилейОбороты.Регистратор ССЫЛКА Документ.ОтгрузкаАвтомобиляБезРеализации)
	|	И НЕ ОстаткиАвтомобилейОбороты.Регистратор.Контрагент.НашаФирма
	|	И НЕ ОстаткиАвтомобилейОбороты.Регистратор В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.Контрагенты.НашиФирмы))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтгрузкаАвтомобиляБезРеализации.Дата,
	|	ОтгрузкаАвтомобиляБезРеализации.СкладКомпании,
	|	ОтгрузкаАвтомобиляБезРеализации.Автомобиль,
	|	NULL,
	|	ОтгрузкаАвтомобиляБезРеализации.Номер,
	|	NULL,
	|	NULL,
	|	-1,
	|	ОтгрузкаАвтомобиляБезРеализации.Сумма,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.ОтгрузкаАвтомобиляБезРеализации КАК ОтгрузкаАвтомобиляБезРеализации
	|ГДЕ
	|	НЕ ОтгрузкаАвтомобиляБезРеализации.ПометкаУдаления
	|	И НЕ ОтгрузкаАвтомобиляБезРеализации.Проведен
	|	И ОтгрузкаАвтомобиляБезРеализации.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КОНЕЦПЕРИОДА(&Дата, ДЕНЬ),
	|	ОстаткиАвтомобилей.СкладКомпании,
	|	ОстаткиАвтомобилей.Автомобиль,
	|	NULL,
	|	ОстаткиАвтомобилей.ОБР.Номер,
	|	NULL,
	|	ОстаткиАвтомобилей.РабочийЛист,
	|	1,
	|	0,
	|	ВТ_ПоступлениеТрейдИн.ВыкупКомиссия,
	|	ВТ_ПоступлениеТрейдИн.ТрейдИн,
	|	ВТ_ПоступлениеТрейдИн.ТолькоВыкуп,
	|	ВТ_ПоступлениеТрейдИн.Автомобиль.VIN,
	|	ВТ_ПоступлениеТрейдИн.МенеджерАСП
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОстаткиАвтомобилейОстатки.СкладКомпании КАК СкладКомпании,
	|		ОстаткиАвто.Автомобиль КАК Автомобиль,
	|		ОстаткиАвтомобилейОстатки.Партия КАК Партия,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА РабочийЛист.Дата <= КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|					ТОГДА ЕСТЬNULL(РабочийЛист.Ссылка, ВЫРАЗИТЬ(ОстаткиАвтомобилейОстатки.Партия.ДокументОснование.ДокументОснование КАК Документ.РабочийЛист))
	|			КОНЕЦ) КАК РабочийЛист,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА ОтгрузкаАвтомобиляБезРеализации.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|					ТОГДА ВЫРАЗИТЬ(ОтгрузкаАвтомобиляБезРеализации.Ссылка КАК Документ.ОтгрузкаАвтомобиляБезРеализации)
	|			КОНЕЦ) КАК ОБР
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль,
	|			СУММА(ОстаткиАвтомобилейОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|		ИЗ
	|			РегистрНакопления.ОстаткиАвтомобилей.Остатки(КОНЕЦПЕРИОДА(&Дата, ДЕНЬ), ) КАК ОстаткиАвтомобилейОстатки
	|		ГДЕ
	|			ОстаткиАвтомобилейОстатки.КоличествоОстаток <> 0
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОстаткиАвтомобилейОстатки.Автомобиль) КАК ОстаткиАвто
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей.Остатки(КОНЕЦПЕРИОДА(&Дата, ДЕНЬ), ) КАК ОстаткиАвтомобилейОстатки
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.РабочийЛист КАК РабочийЛист
	|					ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтгрузкаАвтомобиляБезРеализации КАК ОтгрузкаАвтомобиляБезРеализации
	|					ПО РабочийЛист.Ссылка = ОтгрузкаАвтомобиляБезРеализации.ДокументОснование.ДокументОснование
	|				ПО ОстаткиАвтомобилейОстатки.Автомобиль = РабочийЛист.Автомобиль
	|					И ОстаткиАвтомобилейОстатки.Партия.Дата < РабочийЛист.Дата
	|			ПО ОстаткиАвто.Автомобиль = ОстаткиАвтомобилейОстатки.Автомобиль
	|	ГДЕ
	|		ОстаткиАвтомобилейОстатки.КоличествоОстаток <> 0
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ОстаткиАвтомобилейОстатки.СкладКомпании,
	|		ОстаткиАвтомобилейОстатки.Партия,
	|		ОстаткиАвто.Автомобиль) КАК ОстаткиАвтомобилей
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоступлениеТрейдИн КАК ВТ_ПоступлениеТрейдИн
	|		ПО ОстаткиАвтомобилей.Партия = ВТ_ПоступлениеТрейдИн.Поступление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ПоследнееПоступление.ДатаОтветХранения, ПоследнееПоступление.ДатаПоступления) КАК ДатаПоступления,
	|	ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль КАК Автомобиль,
	|	ВЫБОР
	|		КОГДА ПоследнееПоступление.ОтветХранение = ПоследнееПоступление.Поступление.ДокументОснование
	|				ИЛИ ПоследнееПоступление.Поступление ЕСТЬ NULL
	|			ТОГДА ПоследнееПоступление.ОтветХранение
	|		ИНАЧЕ ПоследнееПоступление.Поступление
	|	КОНЕЦ КАК ДокументПоступления,
	|	ВЫБОР
	|		КОГДА ОстаткиАвтомобилейОстаткиИОбороты.Регистратор = ОстаткиАвтомобилейОстаткиИОбороты.Партия
	|			ТОГДА ОстаткиАвтомобилейОстаткиИОбороты.Регистратор.СуммаОферты
	|		ИНАЧЕ ПоследнееПоступление.Поступление.СуммаОферты
	|	КОНЕЦ КАК ЦенаОферты,
	|	СУММА(ЕСТЬNULL(ВЫБОР
	|				КОГДА ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|						ИЛИ ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.GAC)
	|						ИЛИ ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|						ИЛИ ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль В (&Чанганы)
	|					ТОГДА РассчетныйИнвойсСрезПоследних.ИнвойсРассчетный
	|			КОНЕЦ, ОстаткиАвтомобилейОстаткиИОбороты.СуммаКонечныйОстаток)) КАК ЦенаПоступления,
	|	ПоследнееПоступление.Поступление.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ВводОстатковАвтомобилейПереданныхНаКомиссию)
	|		ИЛИ ПоследнееПоступление.Поступление.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеАвтомобилейКомиссия) КАК Комиссия
	|ПОМЕСТИТЬ ВТ_Поступление
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПоследниеПиОХ.Автомобиль КАК Автомобиль,
	|		ВЫБОР
	|			КОГДА ПоследниеПиОХ.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|					ИЛИ ПоследниеПиОХ.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.GAC)
	|					ИЛИ ПоследниеПиОХ.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|					ИЛИ ПоследниеПиОХ.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|					ИЛИ ПоследниеПиОХ.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|						И ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ТестовыйАвтомобиль)
	|				ТОГДА МИНИМУМ(ПоследниеПиОХ.ОтветХранение.Дата)
	|			ИНАЧЕ МАКСИМУМ(ПоследниеПиОХ.ОтветХранение.Дата)
	|		КОНЕЦ КАК ДатаОтветХранения,
	|		МАКСИМУМ(ПоследниеПиОХ.ОтветХранение) КАК ОтветХранение,
	|		ВЫБОР
	|			КОГДА ПоследниеПиОХ.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|					ИЛИ ПоследниеПиОХ.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.GAC)
	|					ИЛИ ПоследниеПиОХ.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|					ИЛИ ПоследниеПиОХ.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|					ИЛИ ПоследниеПиОХ.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|						И ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ТестовыйАвтомобиль)
	|				ТОГДА МИНИМУМ(ПоследниеПиОХ.Поступление.Дата)
	|			ИНАЧЕ МАКСИМУМ(ПоследниеПиОХ.Поступление.Дата)
	|		КОНЕЦ КАК ДатаПоступления,
	|		МАКСИМУМ(ПоследниеПиОХ.Поступление) КАК Поступление,
	|		СУММА(ОборотыАвто.СуммаКорректировки) КАК СуммаКорректировок
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ОстаткиАвтомобилейОбороты.Автомобиль КАК Автомобиль,
	|			ВЫБОР
	|				КОГДА ОстаткиАвтомобилейОбороты.Партия.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеАвтомобилейОтветственноеХранение)
	|						ИЛИ ОстаткиАвтомобилейОбороты.Партия.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ВводОстатковАвтомобилейНаОтветственномХранении)
	|					ТОГДА ОстаткиАвтомобилейОбороты.Партия
	|			КОНЕЦ КАК ОтветХранение,
	|			ВЫБОР
	|				КОГДА ОстаткиАвтомобилейОбороты.Партия.ХозОперация <> ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеАвтомобилейОтветственноеХранение)
	|						И ОстаткиАвтомобилейОбороты.Партия.ХозОперация <> ЗНАЧЕНИЕ(Справочник.ХозОперации.ВводОстатковАвтомобилейНаОтветственномХранении)
	|					ТОГДА ОстаткиАвтомобилейОбороты.Партия
	|			КОНЕЦ КАК Поступление
	|		ИЗ
	|			ВТ_Основа КАК ВТ_Основа
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей.Обороты(
	|						,
	|						КОНЕЦПЕРИОДА(&Дата, ДЕНЬ),
	|						Регистратор,
	|						НЕ Партия.ПометкаУдаления
	|							И Партия.Проведен) КАК ОстаткиАвтомобилейОбороты
	|				ПО ВТ_Основа.Автомобиль = ОстаткиАвтомобилейОбороты.Автомобиль
	|		ГДЕ
	|			НЕ ОстаткиАвтомобилейОбороты.Регистратор.ПометкаУдаления
	|			И ОстаткиАвтомобилейОбороты.Регистратор.Проведен
	|			И (ОстаткиАвтомобилейОбороты.Регистратор ССЫЛКА Документ.ВводОстатковАвтомобилей
	|					ИЛИ ОстаткиАвтомобилейОбороты.Регистратор ССЫЛКА Документ.ПоступлениеАвтомобилей)
	|			И НЕ ОстаткиАвтомобилейОбороты.Регистратор.Контрагент.НашаФирма
	|			И НЕ ОстаткиАвтомобилейОбороты.Регистратор В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.Контрагенты.НашиФирмы))) КАК ПоследниеПиОХ
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ОстаткиАвтомобилейОбороты.Автомобиль КАК Автомобиль,
	|				ОстаткиАвтомобилейОбороты.Регистратор.Дата КАК ДатаКорректировки,
	|				ОстаткиАвтомобилейОбороты.КоличествоПриход КАК СуммаКорректировки
	|			ИЗ
	|				РегистрНакопления.ОстаткиАвтомобилей.Обороты(
	|						,
	|						,
	|						Регистратор,
	|						НЕ Партия.ПометкаУдаления
	|							И Партия.Проведен) КАК ОстаткиАвтомобилейОбороты
	|			ГДЕ
	|				НЕ ОстаткиАвтомобилейОбороты.Регистратор.ПометкаУдаления
	|				И ОстаткиАвтомобилейОбороты.Регистратор.Проведен
	|				И ОстаткиАвтомобилейОбороты.Регистратор ССЫЛКА Документ.КорректировкаПоступленияАвтомобилей) КАК ОборотыАвто
	|			ПО ПоследниеПиОХ.Автомобиль = ОборотыАвто.Автомобиль
	|				И (ЕСТЬNULL(ПоследниеПиОХ.ОтветХранение.Дата, ПоследниеПиОХ.Поступление.Дата) >= ОборотыАвто.ДатаКорректировки)
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|				АвтомобилиСрезПоследних.Значение КАК ВидАвто,
	|				АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения
	|			ИЗ
	|				РегистрСведений.Автомобили.СрезПоследних(
	|						&Дата,
	|						ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)
	|							И ТИПЗНАЧЕНИЯ(ВидЗначения) = ТИП(Перечисление.ДополнительнаяИнформацияАвтомобилей)) КАК АвтомобилиСрезПоследних) КАК ХарактеристикиАвто
	|			ПО ПоследниеПиОХ.Автомобиль = ХарактеристикиАвто.Автомобиль
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПоследниеПиОХ.Автомобиль,
	|		ХарактеристикиАвто.ВидАвто,
	|		ПоследниеПиОХ.Автомобиль.Модель.Марка) КАК ПоследнееПоступление
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей.ОстаткиИОбороты(, КОНЕЦПЕРИОДА(&Дата, ДЕНЬ), Регистратор, , ) КАК ОстаткиАвтомобилейОстаткиИОбороты
	|		ПО ПоследнееПоступление.Автомобиль = ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль
	|			И (ВЫБОР
	|				КОГДА ПоследнееПоступление.ОтветХранение = ПоследнееПоступление.Поступление.ДокументОснование
	|						ИЛИ ПоследнееПоступление.Поступление ЕСТЬ NULL
	|					ТОГДА ПоследнееПоступление.ОтветХранение
	|				ИНАЧЕ ПоследнееПоступление.Поступление
	|			КОНЕЦ = ОстаткиАвтомобилейОстаткиИОбороты.Регистратор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РассчетныйИнвойс.СрезПоследних КАК РассчетныйИнвойсСрезПоследних
	|		ПО ПоследнееПоступление.Автомобиль = РассчетныйИнвойсСрезПоследних.Автомобиль
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль,
	|	ВЫБОР
	|		КОГДА ПоследнееПоступление.ОтветХранение = ПоследнееПоступление.Поступление.ДокументОснование
	|				ИЛИ ПоследнееПоступление.Поступление ЕСТЬ NULL
	|			ТОГДА ПоследнееПоступление.ОтветХранение
	|		ИНАЧЕ ПоследнееПоступление.Поступление
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОстаткиАвтомобилейОстаткиИОбороты.Регистратор = ОстаткиАвтомобилейОстаткиИОбороты.Партия
	|			ТОГДА ОстаткиАвтомобилейОстаткиИОбороты.Регистратор.СуммаОферты
	|		ИНАЧЕ ПоследнееПоступление.Поступление.СуммаОферты
	|	КОНЕЦ,
	|	ПоследнееПоступление.Поступление.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ВводОстатковАвтомобилейПереданныхНаКомиссию)
	|		ИЛИ ПоследнееПоступление.Поступление.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеАвтомобилейКомиссия),
	|	ЕСТЬNULL(ПоследнееПоступление.ДатаОтветХранения, ПоследнееПоступление.ДатаПоступления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основа.Дата КАК Дата,
	|	ВТ_Основа.Склад.Подразделение.ДилерскийЦентр КАК ДилерскийЦентр,
	|	ВТ_Основа.Склад.Подразделение.Родитель КАК Подразделение,
	|	ВТ_Основа.Склад КАК Склад,
	|	ВТ_Основа.Автомобиль КАК Автомобиль,
	|	ХарактеристикиАвто.ВидАвто КАК ВидАвтомобиля,
	|	ВТ_Основа.Автомобиль.VIN КАК VIN,
	|	ВТ_Основа.Автомобиль.Модель.Марка КАК Бренд,
	|	ВТ_Основа.Автомобиль.Модель КАК Модель,
	|	ВТ_Основа.Автомобиль.ВариантКомплектации КАК ВариантКомплектации,
	|	ГОД(ВТ_Основа.Автомобиль.ГодВыпуска) КАК ГодВыпуска,
	|	ВТ_Основа.РабочийЛист.ВладелецАвто КАК СобственникАвтомобиля,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_Основа.Автомобиль.Модель.Марка.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РабочийЛист.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * 1.2 <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РабочийЛист.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * 1.2 + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0)
	|								ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РабочийЛист.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * 1.2) / 1.2 + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0)
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РабочийЛист.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РабочийЛист.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.УдержаниеКомпенсации, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0)
	|							ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РабочийЛист.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.УдержаниеКомпенсации, 0)) / 1.2 + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РабочийЛист.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РабочийЛист.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.УдержаниеКомпенсации, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0) + ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|								ТОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
	|						КОНЕЦ
	|				ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РабочийЛист.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.УдержаниеКомпенсации, 0)) / 1.2 + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0) + ВЫБОР
	|						КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|							ТОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
	|						ИНАЧЕ ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Отчитан,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_Основа.Автомобиль.Модель.Марка.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РабочийЛист.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * 1.2 <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РабочийЛист.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * 1.2 + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0)
	|								ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РабочийЛист.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * 1.2) / 1.2 + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0)
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РабочийЛист.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РабочийЛист.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.УдержаниеКомпенсации, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0)
	|							ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РабочийЛист.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.УдержаниеКомпенсации, 0)) / 1.2 + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РабочийЛист.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РабочийЛист.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.УдержаниеКомпенсации, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0) + ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|								ТОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
	|						КОНЕЦ
	|				ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РабочийЛист.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РабочийЛист.УдержаниеКомпенсации, 0)) / 1.2 + ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаДополнительная, 0) + ВЫБОР
	|						КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|							ТОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
	|						ИНАЧЕ ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КВКредит + СтраховыеПрограммы.КВКАСКО + СтраховыеПрограммы.КВОСАГО + СтраховыеПрограммы.КВGAP + СтраховыеПрограммы.КВМедиКАСКО + СтраховыеПрограммы.КВРАТ + СтраховыеПрограммы.КВНезависимаяГарантия + СтраховыеПрограммы.КВБезотзывнаяНезависимаяГарантия + СтраховыеПрограммы.КВМедицинскоеСтрахование + СтраховыеПрограммы.КВСтрахованиеЖизни + СтраховыеПрограммы.КВСтрахованиеИмущества + СтраховыеПрограммы.КВПрочее, ВТ_Основа.РабочийЛист.КВКредит + ВТ_Основа.РабочийЛист.КВКаско + ВТ_Основа.РабочийЛист.КВОсаго + ВТ_Основа.РабочийЛист.КВСЖ + ЕСТЬNULL(РЛ_ИСП.КВ, 0)) / 1.2 КАК БлокировкаПродажи,
	|	ВТ_Основа.РабочийЛист.Номер КАК РабочийЛист,
	|	ВТ_Основа.Реализация.Номер КАК Реализация,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаКАСКО, ""-"") КАК Количество_Остаток_Оборот,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидКАСКО, ""-"") КАК Сумма_Остаток_Оборот,
	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаРитейла, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРитейла,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияКАСКО, ""-"") КАК ДатаРитейла2,
	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.СкидаПриПокупкеВТрейдИн, 0) КАК СкидкаПриПокупкеВТрейдИн,
	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.СкидкаПриПокупкеВКредит, 0) КАК СкидкаПриПокупкеВКредит,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаКАСКО, 0) КАК НомерДатаПерезачета,
	|	ВТ_Основа.Автомобиль.Оплачен КАК Оплачен,
	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОплаты,
	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.РазмерСкидки, 0) КАК РазмерСкидки,
	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.ОжидаемаяДатаПолученияКомпенсации, ДАТАВРЕМЯ(1, 1, 1)) КАК ОжидаемаяДатаПолученияКомпенсации,
	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.РазмерКомпенсации, 0) КАК РазмерКомпенсации,
	|	ВТ_Основа.РабочийЛист.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.НаличныйРасчет) КАК НаличныйРасчет,
	|	ВТ_Основа.РабочийЛист.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.БанковскаяКарта)
	|		ИЛИ ВТ_Основа.РабочийЛист.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.БезналичныйРасчет) КАК БезналичныйРасчет,
	|	ВТ_Основа.РабочийЛист.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.Кредит) КАК Кредит,
	|	ВТ_Основа.РабочийЛист.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.Обмен) КАК Обмен,
	|	ВТ_Основа.РабочийЛист.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.Лизинг) КАК Лизинг,
	|	ЕСТЬNULL(ВТ_Основа.РабочийЛист.ПредоплатаЗаАМ, 0) КАК ПредоплатаЗаАМ,
	|	ЕСТЬNULL(ВТ_Основа.РабочийЛист.ДатаПредоплатыЗаАМ, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПредоплатыЗаАМ,
	|	ЕСТЬNULL(ВТ_Основа.Реализация.Контрагент, ЕСТЬNULL(ВТ_Основа.РабочийЛист.Контрагент, ЗаказыАвто.Заказ.Контрагент)) КАК Покупатель,
	|	ЕСТЬNULL(ЦеныАвто.Цена, ЕСТЬNULL(ВТ_Основа.РабочийЛист.РРЦ, ЕСТЬNULL(ЗаказыАвто.Заказ.РРЦ, 0))) КАК РРЦ,
	|	ВЫБОР
	|		КОГДА ВТ_Поступление.ЦенаОферты = 0
	|			ТОГДА ВТ_Поступление.ЦенаПоступления
	|		ИНАЧЕ ВТ_Поступление.ЦенаОферты
	|	КОНЕЦ * 5 / 6 КАК Инвойс,
	|	ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИн, 0) КАК СкидкаТрейдИнПлан,
	|	ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИнФакт, 0) КАК СкидкаТрейдИнФакт,
	|	ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИн2, 0) КАК СкидкаТрейдИн2План,
	|	ЕСТЬNULL(ВТ_Основа.РабочийЛист.СкидкаТрейдИн2Факт, 0) КАК СкидкаТрейдИн2Факт,
	|	ВТ_Основа.РабочийЛист.СкидкаСубсидияКредит КАК СкидкаСубсидияКредитПлан,
	|	ВТ_Основа.РабочийЛист.СкидкаСубсидияКредитФакт КАК СкидкаСубсидияКредитФакт,
	|	ВТ_Основа.РабочийЛист.СкидкаПоПрограммамЛояльности КАК СкидкаПоПрограммамЛояльности,
	|	ВТ_Основа.РабочийЛист.СкидкаАвтоЦентра КАК СкидкаПоСпецПрограмме,
	|	ВТ_Основа.РабочийЛист.СкидкаРозничная КАК СкидкаРозничная,
	|	ВТ_Основа.РабочийЛист.СкидкаДополнительная КАК СкидкаДополнительная,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВКАСКО, 0) КАК СтоимостьДопОборудования_Маркетинг,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаОСАГО, ""-"") КАК СтоимостьДопОборудования,
	|	ВТ_Основа.РабочийЛист.СтоимостьДО КАК ПлановаяСтоимостьДО,
	|	ВТ_Основа.РабочийЛист.СебестоимостьДО * 5 / 6 КАК СебестоимостьДО,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидОСАГО, ""-"") КАК СебестоимостьДО_Комплектации,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияОСАГО, ""-"") КАК СуммаДО,
	|	ВТ_Основа.РабочийЛист.СтоимостьДОФакт КАК ЦенаДопПоПрайсу,
	|	ВТ_Основа.РабочийЛист.ПредоплатаТО КАК ПредоплатаТО,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаОСАГО, 0) КАК КомпенсацияТрейдИНРетроспективная,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВОСАГО, 0) КАК КомпенсацияСубсидияКредитРетроспективная,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаGAP, ""-"") КАК КомпенсацияПоПрограммамЛояльностиРетроспективная,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидGAP, ""-"") КАК КомпенсацияРозничнаяРетроспективная,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияGAP, ""-"") КАК КомпенсацияТрейдИН2Ретроспективная,
	|	ВЫБОР
	|		КОГДА ВТ_Основа.Автомобиль.Модель.Марка.КомпенсацияБезНДС
	|			ТОГДА ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИН2Ретроспективная, 0)
	|		ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИН2Ретроспективная, 0)) * 5 / 6
	|	КОНЕЦ КАК КомпенсацияРетроспективная,
	|	ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля КАК КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля,
	|	ВТ_Основа.РабочийЛист.СуммаКомпенсации КАК СуммаКомпенсации,
	|	ВЫБОР
	|		КОГДА ВТ_Основа.Автомобиль.Модель.Марка.КомпенсацияБезНДС
	|			ТОГДА ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)
	|		ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РабочийЛист.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * 5 / 6
	|	КОНЕЦ КАК КомпенсацияВИнвойсе,
	|	ВТ_Основа.РабочийЛист.КомпенсацияБрокерФинанс КАК КомпенсацияБрокерФинанс,
	|	ЕСТЬNULL(ВТ_Основа.РабочийЛист.СуммаПредпродажнойПодготовки, 0) * 5 / 6 КАК СуммаКаско,
	|	(ЕСТЬNULL(ВТ_Основа.РабочийЛист.КВКредит, 0) + ЕСТЬNULL(СтраховыеПрограммы.КВКАСКО, 0) + ЕСТЬNULL(СтраховыеПрограммы.КВОСАГО, 0) + ЕСТЬNULL(СтраховыеПрограммы.КВGAP, 0) + ЕСТЬNULL(СтраховыеПрограммы.КВМедиКАСКО, 0) + ЕСТЬNULL(СтраховыеПрограммы.КВРАТ, 0) + ЕСТЬNULL(СтраховыеПрограммы.КВНезависимаяГарантия, 0) + ЕСТЬNULL(СтраховыеПрограммы.КВБезотзывнаяНезависимаяГарантия, 0) + ЕСТЬNULL(СтраховыеПрограммы.КВМедицинскоеСтрахование, 0) + ЕСТЬNULL(СтраховыеПрограммы.КВСтрахованиеЖизни, 0) + ЕСТЬNULL(СтраховыеПрограммы.КВСтрахованиеИмущества, 0) + ЕСТЬNULL(СтраховыеПрограммы.КВПрочее, 0)) * 5 / 6 КАК ВариантКаско,
	|	ВТ_Основа.ОтгрузкаБезРеализации КАК СуммаОсаго,
	|	ЕСТЬNULL(ВТ_Основа.РабочийЛист.УдержаниеКомпенсации, 0) * 5 / 6 КАК ВариантОсаго,
	|	ВТ_Основа.РабочийЛист.Дата КАК СуммаСтрахованиеЖизни,
	|	ВТ_Основа.РабочийЛист.КВКредит КАК ВариантСтрахованиеЖизни,
	|	ВТ_Основа.РабочийЛист.СуммаПродажи * 5 / 6 КАК ЦенаФакт,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|					ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|				ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|			КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ВЫБОР
	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|								ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|								ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|							ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВЫБОР
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|								ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|							КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|							ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|								ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦенаДоговора,
	|	ВТ_Основа.РабочийЛист.СуммаПредоплаты КАК ПервоначальныйВзнос,
	|	ВТ_Основа.РабочийЛист.ДатаПервоначальногоВзноса КАК ДатаПервоначальногоВзноса,
	|	ВТ_Основа.РабочийЛист.БанкЛК КАК БанкЛК,
	|	ВЫБОР
	|		КОГДА ВТ_Основа.РабочийЛист.Кредит
	|				ИЛИ ВТ_Основа.РабочийЛист.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.Кредит)
	|			ТОГДА ВТ_Основа.РабочийЛист.СчетИлиАвтоВКредит
	|	КОНЕЦ КАК КредитнаяСтоимость,
	|	ВТ_Основа.РабочийЛист.ПрогнозСрокаПодготовкиАвтоВДнях КАК ПрогнозСрокаПодготовкиАвтоВДнях,
	|	ВТ_Основа.РабочийЛист.ПрогнозСуммыРемонта КАК ПрогнозСуммыРемонта,
	|	ВТ_Основа.РабочийЛист.ПрогнозСуммыДетейлинга КАК ПрогнозСуммыДетейлинга,
	|	ВТ_Основа.РабочийЛист.ПрогнозируемаяЦенаПродажи КАК ПрогнозируемаяЦенаПродажи,
	|	ВТ_Основа.РабочийЛист.ПрогнозСрокаПродажиАвтоВДнях КАК ПрогнозСрокаПродажиАвтоВДнях,
	|	ВТ_Основа.РабочийЛист.ПрогнозСуммыМКЦ КАК ПрогнозСуммыМКЦ,
	|	ВТ_Основа.РабочийЛист.ЦенаМинРыночнаяТрейдИн КАК ЦенаМинРыночнаяТрейдИн,
	|	ВТ_Основа.РабочийЛист.ПланируемаяЦенаПродажиТрейдИн КАК ПланируемаяЦенаПродажиТрейдИн,
	|	ВТ_Основа.РабочийЛист.ЦенаДКПТрейдИн КАК ЦенаДКПТрейдИн,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаGAP, 0) КАК ДатаРитейла_РЛ,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВGAP, 0) КАК СуммаИСП,
	|	ДолгОП.КоличествоДолгаОП КАК КоличествоДолгаОП,
	|	ЕСТЬNULL(ЗаказыАвто.Резерв, 0) КАК Резерв,
	|	ВТ_Поступление.ДатаПоступления КАК ДатаПоступленияВГК,
	|	ВЫБОР
	|		КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|				ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|				ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|				ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|				ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|			ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|		ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|	КОНЕЦ КАК ДатаФинансирования,
	|	ЕСТЬNULL(Хранение.ДатаПриемкиНаТекушийСклад, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПриемкиНаТекушийСклад,
	|	РАЗНОСТЬДАТ(ВТ_Поступление.ДатаПоступления, &Дата, ДЕНЬ) КАК СрокХранения,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|					И РАЗНОСТЬДАТ(&Дата, ВТ_Основа.Дата, ДЕНЬ) < 90
	|			ТОГДА ""Да""
	|		ИНАЧЕ ""Нет""
	|	КОНЕЦ КАК ГарантияПИ,
	|	ВЫБОР
	|		КОГДА ВТ_Мотивация_БонусЗаМодель_ЦелеваяДоходность.ВидМотивации = ЗНАЧЕНИЕ(Перечисление.ВидыМотивацииМОП.БонусЗаМодель)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_Мотивация_БонусЗаМодель_ЦелеваяДоходность.ГодВыпускаC <> ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_Мотивация_БонусЗаМодель_ЦелеваяДоходность.ГодВыпускаC > ВТ_Основа.Автомобиль.ГодВыпуска
	|									ТОГДА ВЫБОР
	|											КОГДА ВТ_Мотивация_БонусЗаМодель_ЦелеваяДоходность.ГодВыпускаПо < ВТ_Основа.Автомобиль.ГодВыпуска
	|												ТОГДА ВТ_Мотивация_БонусЗаМодель_ЦелеваяДоходность.СуммаБонуса
	|										КОНЕЦ
	|							КОНЕЦ
	|				КОНЕЦ
	|	КОНЕЦ КАК БонусЗаМодель,
	|	ВЫБОР
	|		КОГДА ВТ_Мотивация_БонусЗаМодель_ЦелеваяДоходность.ВидМотивации = ЗНАЧЕНИЕ(Перечисление.ВидыМотивацииМОП.ЦелеваяДоходность)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_Мотивация_БонусЗаМодель_ЦелеваяДоходность.ГодВыпускаC <> ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_Мотивация_БонусЗаМодель_ЦелеваяДоходность.ГодВыпускаC > ВТ_Основа.Автомобиль.ГодВыпуска
	|									ТОГДА ВЫБОР
	|											КОГДА ВТ_Мотивация_БонусЗаМодель_ЦелеваяДоходность.ГодВыпускаПо < ВТ_Основа.Автомобиль.ГодВыпуска
	|												ТОГДА ВТ_Мотивация_БонусЗаМодель_ЦелеваяДоходность.СуммаБонуса
	|										КОНЕЦ
	|							КОНЕЦ
	|				КОНЕЦ
	|	КОНЕЦ КАК ЦелеваяДоходность,
	|	ВЫБОР
	|		КОГДА ВТ_Мотивация_БонусЗаМодель_ЦелеваяДоходность.ВидМотивации = ЗНАЧЕНИЕ(Перечисление.ВидыМотивацииМОП.БонусЗаШтуку)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_Мотивация_БонусЗаМодель_ЦелеваяДоходность.ГодВыпускаC <> ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_Мотивация_БонусЗаМодель_ЦелеваяДоходность.ГодВыпускаC > ВТ_Основа.Автомобиль.ГодВыпуска
	|									ТОГДА ВЫБОР
	|											КОГДА ВТ_Мотивация_БонусЗаМодель_ЦелеваяДоходность.ГодВыпускаПо < ВТ_Основа.Автомобиль.ГодВыпуска
	|												ТОГДА ВТ_Мотивация_БонусЗаМодель_ЦелеваяДоходность.СуммаБонуса
	|										КОНЕЦ
	|							КОНЕЦ
	|				КОНЕЦ
	|	КОНЕЦ КАК БонусЗаШтуку,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|				ТОГДА ВТ_Поступление.ЦенаПоступления
	|			ИНАЧЕ ВТ_Поступление.ЦенаОферты
	|		КОНЕЦ, 0) * 0.00067 КАК СтоимостьСуточногоХранения,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ВЫБОР
	|						КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|							ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|						ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|					КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|							ТОГДА ВЫБОР
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|								КОНЕЦ
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|									КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ < &Дата
	|			ТОГДА ЕСТЬNULL(ВЫБОР
	|						КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|							ТОГДА ВТ_Поступление.ЦенаПоступления
	|						ИНАЧЕ ВТ_Поступление.ЦенаОферты
	|					КОНЕЦ, 0) * 0.00067 * РАЗНОСТЬДАТ(ВЫБОР
	|						КОГДА ВЫБОР
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|									ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|								ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|							КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|							ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|									ТОГДА ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										КОНЕЦ
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ВЫБОР
	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|												ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|										ИНАЧЕ ВЫБОР
	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|												ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОНЕЦ
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ, &Дата, ДЕНЬ)
	|		ИНАЧЕ 0
	|	КОНЕЦ + ЕСТЬNULL(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|				ТОГДА ВТ_Поступление.ЦенаПоступления
	|			ИНАЧЕ ВТ_Поступление.ЦенаОферты
	|		КОНЕЦ, 0) * 0.00067 * РАЗНОСТЬДАТ(ВЫБОР
	|			КОГДА ВЫБОР
	|					КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|						ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|					ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|				КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ВЫБОР
	|								КОГДА ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|									КОНЕЦ >= &Дата
	|									ТОГДА &Дата
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|									КОНЕЦ
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ВЫБОР
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|								КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|								ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ, ВЫБОР
	|			КОГДА ВЫБОР
	|					КОГДА ВЫБОР
	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|								ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|							ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|						КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|								ТОГДА ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|									КОНЕЦ
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|									ИНАЧЕ ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ > &Дата
	|				ТОГДА &Дата
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВЫБОР
	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|								ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|							ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|						КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|								ТОГДА ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|									КОНЕЦ
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|									ИНАЧЕ ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ, ДЕНЬ) КАК ОбщаяСтоимостьХранения,
	|	ЕСТЬNULL(ВТ_Основа.Реализация.Контрагент.ФормаСобственности, ЕСТЬNULL(ВТ_Основа.РабочийЛист.Контрагент.ФормаСобственности, ЗаказыАвто.Заказ.Контрагент.ФормаСобственности)) КАК Tech_1,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|					ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|				ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|			КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ВЫБОР
	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|								ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|								ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|							ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВЫБОР
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|								ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|							КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|							ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|								ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Tech_2,
	|	ВТ_Поступление.Комиссия КАК Tech_3,
	|	ВТ_Основа.АвтомобильТрейдИн ЕСТЬ NULL КАК Tech_4,
	|	ВТ_Основа.ООАБР КАК Tech_5,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаМедиКАСКО, ""-"") КАК Tech_6,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидМедиКАСКО, ""-"") КАК Tech_7,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияМедиКАСКО, ""-"") КАК Tech_8,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаМедиКАСКО, 0) КАК Tech_9,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВМедиКАСКО, 0) КАК Tech_10,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаРАТ, ""-"") КАК Tech_11,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидРАТ, ""-"") КАК Tech_12,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияРАТ, ""-"") КАК Tech_13,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаРАТ, 0) КАК Tech_14,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВРАТ, 0) КАК Tech_15,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаНезависимаяГарантия, ""-"") КАК Tech_16,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидНезависимаяГарантия, ""-"") КАК Tech_17,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияНезависимаяГарантия, ""-"") КАК Tech_18,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаНезависимаяГарантия, 0) КАК Tech_19,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВНезависимаяГарантия, 0) КАК Tech_20,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаБезотзывнаяНезависимаяГарантия, ""-"") КАК Tech_21,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидБезотзывнаяНезависимаяГарантия, ""-"") КАК Tech_22,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияБезотзывнаяНезависимаяГарантия, ""-"") КАК Tech_23,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаБезотзывнаяНезависимаяГарантия, 0) КАК Tech_24,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВБезотзывнаяНезависимаяГарантия, 0) КАК Tech_25,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаМедицинскоеСтрахование, ""-"") КАК Tech_26,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидМедицинскоеСтрахование, ""-"") КАК Tech_27,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияМедицинскоеСтрахование, ""-"") КАК Tech_28,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаМедицинскоеСтрахование, 0) КАК Tech_29,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВМедицинскоеСтрахование, 0) КАК Tech_30,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаСтрахованиеЖизни, ""-"") КАК Tech_31,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидСтрахованиеЖизни, ""-"") КАК Tech_32,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияСтрахованиеЖизни, ""-"") КАК Tech_33,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаСтрахованиеЖизни, 0) КАК Tech_34,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВСтрахованиеЖизни, 0) КАК Tech_35,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаСтрахованиеИмущества, ""-"") КАК Tech_36,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидСтрахованиеИмущества, ""-"") КАК Tech_37,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияСтрахованиеИмущества, ""-"") КАК Tech_38,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаСтрахованиеИмущества, 0) КАК Tech_39,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВСтрахованиеИмущества, 0) КАК Tech_40,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаПрочее, ""-"") КАК Tech_41,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидПрочее, ""-"") КАК Tech_42,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияПрочее, ""-"") КАК Tech_43,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаПрочее, 0) КАК Tech_44,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВПрочее, 0) КАК Tech_45,
	|	ВТ_Основа.АвтомобильТрейдИн КАК Tech_46,
	|	ВТ_Основа.РабочийЛист.СуммаПродажи + ВТ_Основа.РабочийЛист.СкидкаДополнительная КАК Tech_47,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|				ТОГДА ВТ_Поступление.ЦенаПоступления
	|			ИНАЧЕ ВТ_Поступление.ЦенаОферты
	|		КОНЕЦ, 0) * 0.00067 * РАЗНОСТЬДАТ(ВЫБОР
	|			КОГДА ВЫБОР
	|					КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|						ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|					ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|				КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ВЫБОР
	|								КОГДА ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|									КОНЕЦ >= &Дата
	|									ТОГДА &Дата
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|									КОНЕЦ
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ВЫБОР
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|								КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|								ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ, ВЫБОР
	|			КОГДА ВЫБОР
	|					КОГДА ВЫБОР
	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|								ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|							ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|						КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|								ТОГДА ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|									КОНЕЦ
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|									ИНАЧЕ ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ > &Дата
	|				ТОГДА &Дата
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВЫБОР
	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|								ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|							ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|						КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|								ТОГДА ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|									КОНЕЦ
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|									ИНАЧЕ ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ, ДЕНЬ) КАК Tech_48,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ВЫБОР
	|						КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|							ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|						ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|					КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|							ТОГДА ВЫБОР
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|								КОНЕЦ
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|									КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ < &Дата
	|			ТОГДА ЕСТЬNULL(ВЫБОР
	|						КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|							ТОГДА ВТ_Поступление.ЦенаПоступления
	|						ИНАЧЕ ВТ_Поступление.ЦенаОферты
	|					КОНЕЦ, 0) * 0.00067 * РАЗНОСТЬДАТ(ВЫБОР
	|						КОГДА ВЫБОР
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|									ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|								ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|							КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|							ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|									ТОГДА ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										КОНЕЦ
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ВЫБОР
	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|												ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|										ИНАЧЕ ВЫБОР
	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|												ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОНЕЦ
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ, &Дата, ДЕНЬ)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Tech_49,
	|	ВТ_Основа.МенеджерАСП КАК Tech_50
	|ИЗ
	|	ВТ_Основа КАК ВТ_Основа
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.Значение КАК ВидАвто,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних(
	|					&Дата,
	|					ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)
	|						И ТИПЗНАЧЕНИЯ(ВидЗначения) = ТИП(Перечисление.ДополнительнаяИнформацияАвтомобилей)) КАК АвтомобилиСрезПоследних) КАК ХарактеристикиАвто
	|		ПО ВТ_Основа.Автомобиль = ХарактеристикиАвто.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗаказыАвтомобилейОстатки.Автомобиль КАК Автомобиль,
	|			ЗаказыАвтомобилейОстатки.Заказ КАК Заказ,
	|			ЗаказыАвтомобилейОстатки.РезервОстаток КАК Резерв,
	|			Взаиморасчеты.СуммаОстаток КАК СуммаОстаток
	|		ИЗ
	|			РегистрНакопления.ЗаказыАвтомобилей.Остатки(&Дата, ) КАК ЗаказыАвтомобилейОстатки
	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					СУММА(ВзаиморасчетыКомпанииОстатки.СуммаОстаток) КАК СуммаОстаток,
	|					ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|					ВзаиморасчетыКомпанииОстатки.Сделка КАК Сделка
	|				ИЗ
	|					РегистрНакопления.ВзаиморасчетыКомпании.Остатки КАК ВзаиморасчетыКомпанииОстатки
	|				
	|				СГРУППИРОВАТЬ ПО
	|					ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов,
	|					ВзаиморасчетыКомпанииОстатки.Сделка) КАК Взаиморасчеты
	|				ПО ЗаказыАвтомобилейОстатки.Заказ = Взаиморасчеты.Сделка) КАК ЗаказыАвто
	|		ПО ВТ_Основа.Автомобиль = ЗаказыАвто.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Мотивация КАК ВТ_Мотивация_БонусЗаМодель_ЦелеваяДоходность
	|		ПО ВТ_Основа.Автомобиль.ВариантКомплектации = ВТ_Мотивация_БонусЗаМодель_ЦелеваяДоходность.ВариантКомплектации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Мотивация КАК ВТ_Мотивация_БонусЗаШтуку
	|		ПО ВТ_Основа.Автомобиль.Модель.Марка = ВТ_Мотивация_БонусЗаШтуку.Марка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОстаткиАвтомобилейОбороты.Автомобиль КАК Автомобиль,
	|			МАКСИМУМ(ОстаткиАвтомобилейОбороты.Регистратор.Дата) КАК ДатаПриемкиНаТекушийСклад
	|		ИЗ
	|			РегистрНакопления.ОстаткиАвтомобилей.Обороты(, КОНЕЦПЕРИОДА(&Дата, ДЕНЬ), Регистратор, ) КАК ОстаткиАвтомобилейОбороты
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОстаткиАвтомобилейОбороты.Автомобиль) КАК Хранение
	|		ПО ВТ_Основа.Автомобиль = Хранение.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РабочийЛистДолгОтделаПродаж.Ссылка КАК Ссылка,
	|			СУММА(РабочийЛистДолгОтделаПродаж.Количество) КАК КоличествоДолгаОП
	|		ИЗ
	|			Документ.РабочийЛист.ДолгОтделаПродаж КАК РабочийЛистДолгОтделаПродаж
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РабочийЛистДолгОтделаПродаж.Ссылка) КАК ДолгОП
	|		ПО ВТ_Основа.РабочийЛист.Ссылка = ДолгОП.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЦеныАвтомобилейСрезПоследних.Автомобиль КАК Автомобиль,
	|			ЦеныАвтомобилейСрезПоследних.Цена КАК Цена
	|		ИЗ
	|			РегистрСведений.ЦеныАвтомобилей.СрезПоследних(КОНЕЦПЕРИОДА(&Дата, ДЕНЬ), ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)) КАК ЦеныАвтомобилейСрезПоследних) КАК ЦеныАвто
	|		ПО ВТ_Основа.Автомобиль = ЦеныАвто.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			База.Автомобиль КАК Автомобиль,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 0
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК ПрограммаКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 0
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК ВидКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 0
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК КомпанияКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 0
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 0
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 1
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК ПрограммаОСАГО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 1
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК ВидОСАГО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 1
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК КомпанияОСАГО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 1
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаОСАГО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 1
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВОСАГО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 2
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК ПрограммаGAP,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 2
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК ВидGAP,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 2
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК КомпанияGAP,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 2
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаGAP,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 2
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВGAP,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 3
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК ПрограммаМедиКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 3
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК ВидМедиКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 3
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК КомпанияМедиКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 3
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаМедиКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 3
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВМедиКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 4
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК ПрограммаРАТ,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 4
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК ВидРАТ,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 4
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК КомпанияРАТ,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 4
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаРАТ,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 4
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВРАТ,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 5
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК ПрограммаНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 5
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК ВидНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 5
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК КомпанияНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 5
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 5
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 6
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК ПрограммаБезотзывнаяНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 6
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК ВидБезотзывнаяНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 6
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК КомпанияБезотзывнаяНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 6
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаБезотзывнаяНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 6
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВБезотзывнаяНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 7
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК ПрограммаМедицинскоеСтрахование,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 7
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК ВидМедицинскоеСтрахование,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 7
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК КомпанияМедицинскоеСтрахование,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 7
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаМедицинскоеСтрахование,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 7
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВМедицинскоеСтрахование,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 8
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК ПрограммаСтрахованиеЖизни,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 8
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК ВидСтрахованиеЖизни,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 8
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК КомпанияСтрахованиеЖизни,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 8
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаСтрахованиеЖизни,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 8
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВСтрахованиеЖизни,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 9
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК ПрограммаСтрахованиеИмущества,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 9
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК ВидСтрахованиеИмущества,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 9
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК КомпанияСтрахованиеИмущества,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 9
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаСтрахованиеИмущества,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 9
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВСтрахованиеИмущества,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 10
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК ПрограммаПрочее,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 10
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК ВидПрочее,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 10
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ ""-""
	|				КОНЕЦ) КАК КомпанияПрочее,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 10
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаПрочее,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 10
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВПрочее
	|		ИЗ
	|			(ВЫБРАТЬ
	|				РабочийЛистКредитногоОтделаСтраховыеПродукты.Ссылка.ДокументОснование.Автомобиль КАК Автомобиль,
	|				РабочийЛистКредитногоОтделаСтраховыеПродукты.ПрограммаСтрахования.ВидСтрахования.Порядок КАК НомерСтроки,
	|				РабочийЛистКредитногоОтделаСтраховыеПродукты.ПрограммаСтрахования КАК ПрограммаСтрахования,
	|				РабочийЛистКредитногоОтделаСтраховыеПродукты.ПрограммаСтрахования.ВидСтрахования КАК ВидСтрахования,
	|				РабочийЛистКредитногоОтделаСтраховыеПродукты.СтраховаяКомпания КАК СтраховаяКомпания,
	|				РабочийЛистКредитногоОтделаСтраховыеПродукты.СуммаСтрахования КАК СуммаСтрахования,
	|				РабочийЛистКредитногоОтделаСтраховыеПродукты.КВ КАК КВСуммыСтрахования
	|			ИЗ
	|				Документ.РабочийЛистКредитногоОтдела.СтраховыеПродукты КАК РабочийЛистКредитногоОтделаСтраховыеПродукты) КАК База
	|		
	|		СГРУППИРОВАТЬ ПО
	|			База.Автомобиль) КАК СтраховыеПрограммы
	|		ПО ВТ_Основа.Автомобиль = СтраховыеПрограммы.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Поступление КАК ВТ_Поступление
	|		ПО ВТ_Основа.Автомобиль = ВТ_Поступление.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПериодыФакторингаАМСрезПоследних.Марка КАК Марка,
	|			ПериодыФакторингаАМСрезПоследних.БеспроцентныйПериодДней КАК БеспроцентныйПериодДней,
	|			ПериодыФакторингаАМСрезПоследних.ОбщийПериодДней КАК ОбщийПериодДней
	|		ИЗ
	|			РегистрСведений.ПериодыФакторингаАМ.СрезПоследних(КОНЕЦПЕРИОДА(&Дата, ДЕНЬ), ) КАК ПериодыФакторингаАМСрезПоследних
	|		ГДЕ
	|			ПериодыФакторингаАМСрезПоследних.Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)) КАК ПериодыФакторингаМарка
	|		ПО ВТ_Основа.Автомобиль.Модель.Марка = ПериодыФакторингаМарка.Марка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПериодыФакторингаАМСрезПоследних.Модель КАК Модель,
	|			ПериодыФакторингаАМСрезПоследних.БеспроцентныйПериодДней КАК БеспроцентныйПериодДней,
	|			ПериодыФакторингаАМСрезПоследних.ОбщийПериодДней КАК ОбщийПериодДней
	|		ИЗ
	|			РегистрСведений.ПериодыФакторингаАМ.СрезПоследних(КОНЕЦПЕРИОДА(&Дата, ДЕНЬ), ) КАК ПериодыФакторингаАМСрезПоследних
	|		ГДЕ
	|			ПериодыФакторингаАМСрезПоследних.Модель <> ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)) КАК ПериодыФакторингаМодель
	|		ПО ВТ_Основа.Автомобиль.Модель = ПериодыФакторингаМодель.Модель
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РабочийЛистИныеСтраховыеПродукты.Ссылка.Ссылка КАК Ссылка,
	|			СУММА(РабочийЛистИныеСтраховыеПродукты.КВ) КАК КВ
	|		ИЗ
	|			Документ.РабочийЛист.ИныеСтраховыеПродукты КАК РабочийЛистИныеСтраховыеПродукты
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РабочийЛистИныеСтраховыеПродукты.Ссылка.Ссылка) КАК РЛ_ИСП
	|		ПО ВТ_Основа.РабочийЛист = РЛ_ИСП.Ссылка,
	|	Константа.СтавкаЗаКредит КАК СтавкаЗаКредит";
КонецПроцедуры
//Иванченко 20251202 --   

//Иванченко 20260218 ++  
Процедура ПолучитьФормуАвансовыхСФ() Экспорт 
	Параметр_Форма = ПолучитьФорму("Документ.СчетФактураВыданный.ФормаСписка");
	Параметр_Форма.Отбор.НаАванс.Значение = Истина;
	Параметр_Форма.Отбор.НаАванс.Использование = Истина; 
	Параметр_Форма.Открыть();
КонецПроцедуры   

Процедура ПолучитьОтчетАвансовыеСФ() Экспорт 
	Объект_Отчет = Отчеты.СчетаФактурыВыданные.Создать();
	Настройки = Объект_Отчет.КомпоновщикНастроек.Настройки;
	НовоеПоле = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовоеПоле.ЛевоеЗначение = Настройки.ДоступныеПоляОтбора.Элементы[4].Элементы[23].Поле;
	НовоеПоле.ПравоеЗначение = Истина;
	НовоеПоле.Использование = Истина;
	Объект_Отчет.ПолучитьФорму("НастройкиОбороты").Открыть();
КонецПроцедуры   	
//Иванченко 20260218 --    

//Иванченко 20260302 ++
Процедура ОбработкаПроверкиПочты() Экспорт
    // 1. Параметры почтового сервера
    ПараметрыПочты = Новый Структура;
    ПараметрыПочты.Вставить("Сервер", "imap.yandex.ru");
    ПараметрыПочты.Вставить("Порт", 993);
    ПараметрыПочты.Вставить("Пользователь", "ваша_почта@домен.ru");
    ПараметрыПочты.Вставить("Пароль", "ваш_пароль");
    ПараметрыПочты.Вставить("ИспользоватьSSL", Истина);
    ПараметрыПочты.Вставить("Протокол", "IMAP");
    
    // 2. Подключаемся к почтовому серверу
    Попытка
        Почта = Новый Почта;
        Почта.Подключить(ПараметрыПочты);
        
        // 3. Получаем список новых писем
        Почта.ВыбратьПисьма();
        КоличествоПисем = Почта.КоличествоПисем();
        
        Если КоличествоПисем = 0 Тогда
            Почта.Отключить();
            Возврат;
        КонецЕсли;
        
        // 4. Обрабатываем каждое письмо
        Для i = 1 По КоличествоПисем Цикл
            Письмо = Почта.ПолучитьПисьмо(i);
            ОбработатьВложенияПисьма(Письмо);
            
            // 5. Помечаем письмо как прочитанное (опционально)
            // Почта.ПометитьПисьмоПрочитанным(i);
        КонецЦикла;
        
        Почта.Отключить();
        
    Исключение
        ЗаписьЖурналаРегистрации("ОшибкаПодключенияПочты", 
            УровеньЖурналаРегистрации.Ошибка,,
            "Ошибка подключения к почте: " + ОписаниеОшибки());
    КонецПопытки;
    
КонецПроцедуры

Процедура ОбработатьВложенияПисьма(Письмо)
    
    // Аналогично процедуре из Варианта 1,
    // но используем методы объекта Почта
    
    Если Письмо.КоличествоВложений = 0 Тогда
        Возврат;
    КонецЕсли;
    
    ПутьДляСохранения = "C:\1C\ВходящиеПисьма\";
    
    Для i = 1 По Письмо.КоличествоВложений Цикл
        Вложение = Письмо.ПолучитьВложение(i);
        
        ИмяФайла = Вложение.ИмяФайла;
        Если Прав(НРег(ИмяФайла), 5) <> ".xlsx" Тогда
            Продолжить;
        КонецЕсли;
        
        // ... сохранение и обработка файла
        // аналогично коду из Варианта 1
        
	КонецЦикла;
	
    КонецПроцедуры
//Иванченко 20260302 --  

//Иванченко 20260504 ++  
// Для аналитики BI
Процедура ПолучитьСформироватьЗаписиДОПиПП() Экспорт
	ЗапросЗаполнениеДОПиПП = Новый Запрос( 
	"ВЫБРАТЬ
	|	ПродажиАвтомобилейОбороты.Автомобиль КАК Автомобиль
	|ПОМЕСТИТЬ ВТ_Авто
	|ИЗ
	|	РегистрНакопления.ПродажиАвтомобилей.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК ПродажиАвтомобилейОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиАвтомобилейОстатки.Автомобиль
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(&КонецПериода, ) КАК ОстаткиАвтомобилейОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиАвтомобилейОстатки.Автомобиль
	|
	|ИМЕЮЩИЕ
	|	СУММА(ОстаткиАвтомобилейОстатки.КоличествоОстаток) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказНаряд.Автомобиль КАК Автомобиль,
	|	ЗаказНаряд.Ссылка КАК ЗН,
	|	МАКСИМУМ(РабочийЛист.Ссылка) КАК РЛ,
	|	ВЫБОР
	|		КОГДА ЗаказНаряд.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПредпродажнаяПодготовка)
	|			ТОГДА ""ПредпродажнаяПодготовка""
	|		ИНАЧЕ ""ДОП""
	|	КОНЕЦ КАК ВидСтроки
	|ПОМЕСТИТЬ ВТ_ЗН
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РабочийЛист КАК РабочийЛист
	|		ПО ЗаказНаряд.Автомобиль = РабочийЛист.Автомобиль
	|ГДЕ
	|	ЗаказНаряд.Проведен
	|	И НЕ ЗаказНаряд.ПометкаУдаления
	|	И ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
	|	И (ЗаказНаряд.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПредпродажнаяПодготовка)
	|			ИЛИ ЗаказНаряд.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.РемонтБуАвтомобиля)
	|			ИЛИ ЗаказНаряд.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ДиагностикаТрейдИн))
	|	И РабочийЛист.Проведен
	|	И НЕ РабочийЛист.ПометкаУдаления
	|	И НЕ(РабочийЛист.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Отказ)
	|				ИЛИ РабочийЛист.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.СделкаОтказ)
	|				ИЛИ РабочийЛист.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.ОшибочныйНомер)
	|				ИЛИ РабочийЛист.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.ПотерянныйТрафик))
	|	И ЗаказНаряд.Автомобиль В
	|			(ВЫБРАТЬ
	|				ВТ_Авто.Автомобиль
	|			ИЗ
	|				ВТ_Авто)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказНаряд.Автомобиль,
	|	ЗаказНаряд.Ссылка,
	|	ВЫБОР
	|		КОГДА ЗаказНаряд.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПредпродажнаяПодготовка)
	|			ТОГДА ""ПредпродажнаяПодготовка""
	|		ИНАЧЕ ""ДОП""
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗН.Автомобиль КАК Автомобиль,
	|	ВТ_ЗН.РЛ КАК РЛ,
	|	ВТ_ЗН.ЗН КАК ЗН,
	|	ЗаказНарядТовары.Номенклатура КАК Номенклатура,
	|	ЗаказНарядТовары.Количество КАК Количество,
	|	ПартииТоваровДляУчетаОбороты.СуммаРасход КАК Себестоимость,
	|	ЗаказНарядТовары.СуммаВсего КАК ЦенаПродажи,
	|	ЗаказНарядТовары.СуммаНДС КАК В_тч_НДС,
	|	НаценкиНаСервисСрезПоследних.Значение КАК Наценка,
	|	""Запчасти"" КАК ВидРемонта,
	|	ВТ_ЗН.ВидСтроки КАК ВидСтроки
	|ПОМЕСТИТЬ ВТ_Объединение
	|ИЗ
	|	ВТ_ЗН КАК ВТ_ЗН
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
	|			ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровДляУчета.Обороты(, , Регистратор, ) КАК ПартииТоваровДляУчетаОбороты
	|			ПО ЗаказНарядТовары.Ссылка = ПартииТоваровДляУчетаОбороты.Регистратор
	|				И ЗаказНарядТовары.Номенклатура = ПартииТоваровДляУчетаОбороты.Номенклатура
	|		ПО ВТ_ЗН.ЗН = ЗаказНарядТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаценкиНаСервис.СрезПоследних КАК НаценкиНаСервисСрезПоследних
	|		ПО (НаценкиНаСервисСрезПоследних.ТипНаценки = ЗНАЧЕНИЕ(Перечисление.ТипыНаценокСервиса.Запчасти))
	|ГДЕ
	|	НЕ ЗаказНарядТовары.Номенклатура ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ЗН.Автомобиль,
	|	ВТ_ЗН.РЛ,
	|	ВТ_ЗН.ЗН,
	|	ЗаказНарядРаботы.Работа,
	|	ЗаказНарядРаботы.Количество,
	|	ВЫБОР
	|		КОГДА НЕ СубподрядОбороты.Работа ЕСТЬ NULL
	|				ИЛИ ЗаказНарядИсполнители.ВнСубподряд
	|			ТОГДА СубподрядОбороты.СебестоимостьУпрОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ЗаказНарядРаботы.Цена,
	|	ЗаказНарядРаботы.СуммаНДС,
	|	НаценкиНаСервисСрезПоследних.Значение,
	|	ВЫБОР
	|		КОГДА НаценкиНаСервисСрезПоследних.ТипНаценки.Порядок = 1
	|			ТОГДА ""МКЦ""
	|		КОГДА НаценкиНаСервисСрезПоследних.ТипНаценки.Порядок = 2
	|			ТОГДА ""Нормочасы""
	|	КОНЕЦ,
	|	ВТ_ЗН.ВидСтроки
	|ИЗ
	|	ВТ_ЗН КАК ВТ_ЗН
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Субподряд.Обороты(, , , ) КАК СубподрядОбороты
	|			ПО ЗаказНарядРаботы.Ссылка = СубподрядОбороты.ЗаказНаряд
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ЗаказНарядИсполнители.Ссылка КАК Ссылка,
	|				ЗаказНарядИсполнители.ИдентификаторРаботы КАК ИдентификаторРаботы,
	|				МАКСИМУМ(ВЫБОР
	|						КОГДА ЗаказНарядИсполнители.Исполнитель.Должность = ЗНАЧЕНИЕ(Справочник.Должности.ПодготовщикБУ)
	|								ИЛИ ЗаказНарядИсполнители.Исполнитель.Должность = ЗНАЧЕНИЕ(Справочник.Должности.Техник)
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ) КАК ВнСубподряд
	|			ИЗ
	|				Документ.ЗаказНаряд.Исполнители КАК ЗаказНарядИсполнители
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ЗаказНарядИсполнители.Ссылка,
	|				ЗаказНарядИсполнители.ИдентификаторРаботы) КАК ЗаказНарядИсполнители
	|			ПО ЗаказНарядРаботы.Ссылка = ЗаказНарядИсполнители.Ссылка
	|				И ЗаказНарядРаботы.ИдентификаторРаботы = ЗаказНарядИсполнители.ИдентификаторРаботы
	|		ПО ВТ_ЗН.ЗН = ЗаказНарядРаботы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаценкиНаСервис.СрезПоследних КАК НаценкиНаСервисСрезПоследних
	|		ПО (ВЫБОР
	|				КОГДА НЕ СубподрядОбороты.Работа ЕСТЬ NULL
	|						ИЛИ ЗаказНарядИсполнители.ВнСубподряд
	|					ТОГДА НаценкиНаСервисСрезПоследних.ТипНаценки = ЗНАЧЕНИЕ(Перечисление.ТипыНаценокСервиса.МКЦ)
	|				ИНАЧЕ НаценкиНаСервисСрезПоследних.ТипНаценки = ЗНАЧЕНИЕ(Перечисление.ТипыНаценокСервиса.Нормочасы)
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СебестоимостьЦенаПродажиДОП_и_ПП.РЛ_1С КАК РЛ_1С,
	|	СебестоимостьЦенаПродажиДОП_и_ПП.GUID_РЛ КАК GUID_РЛ,
	|	СебестоимостьЦенаПродажиДОП_и_ПП.Документ_1С КАК Документ_1С,
	|	СебестоимостьЦенаПродажиДОП_и_ПП.Дата КАК Дата,
	|	СебестоимостьЦенаПродажиДОП_и_ПП.Номер КАК Номер,
	|	СебестоимостьЦенаПродажиДОП_и_ПП.ТипДокумента КАК ТипДокумента,
	|	СебестоимостьЦенаПродажиДОП_и_ПП.Автомобиль_1С КАК Автомобиль_1С,
	|	СебестоимостьЦенаПродажиДОП_и_ПП.VIN_Автомобиля КАК VIN_Автомобиля,
	|	СебестоимостьЦенаПродажиДОП_и_ПП.Номенклатура_1С КАК Номенклатура_1С,
	|	СебестоимостьЦенаПродажиДОП_и_ПП.НаименованиеНоменклатуры КАК НаименованиеНоменклатуры,
	|	СебестоимостьЦенаПродажиДОП_и_ПП.Количество КАК Количество,
	|	СебестоимостьЦенаПродажиДОП_и_ПП.Себестоимость КАК Себестоимость,
	|	СебестоимостьЦенаПродажиДОП_и_ПП.ЦенаПродажи КАК ЦенаПродажи,
	|	СебестоимостьЦенаПродажиДОП_и_ПП.В_тч_НДС КАК В_тч_НДС,
	|	СебестоимостьЦенаПродажиДОП_и_ПП.Наценка КАК Наценка,
	|	СебестоимостьЦенаПродажиДОП_и_ПП.ВидРемонта КАК ВидРемонта,
	|	СебестоимостьЦенаПродажиДОП_и_ПП.ВидСтроки КАК ВидСтроки
	|ПОМЕСТИТЬ ВТ_РС
	|ИЗ
	|	РегистрСведений.СебестоимостьЦенаПродажиДОП_и_ПП КАК СебестоимостьЦенаПродажиДОП_и_ПП
	|ГДЕ
	|	СебестоимостьЦенаПродажиДОП_и_ПП.Автомобиль_1С В
	|			(ВЫБРАТЬ
	|				ВТ_Авто.Автомобиль
	|			ИЗ
	|				ВТ_Авто)
	|	И СебестоимостьЦенаПродажиДОП_и_ПП.Актуальность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Объединение.Автомобиль КАК Автомобиль,
	|	ВТ_Объединение.РЛ КАК РЛ,
	|	ВТ_Объединение.ЗН КАК ЗН,
	|	ВТ_Объединение.Номенклатура КАК Номенклатура,
	|	ВТ_Объединение.Количество КАК Количество,
	|	ВТ_Объединение.Себестоимость КАК Себестоимость,
	|	ВТ_Объединение.ЦенаПродажи КАК ЦенаПродажи,
	|	ВТ_Объединение.В_тч_НДС КАК В_тч_НДС,
	|	ВТ_Объединение.Наценка КАК Наценка,
	|	ВТ_Объединение.ВидРемонта КАК ВидРемонта,
	|	ВТ_Объединение.ВидСтроки КАК ВидСтроки,
	|	НЕ ВТ_РС.Дата ЕСТЬ NULL КАК ЕстьЗаписьРС,
	|	ЕСТЬNULL(ЕСТЬNULL(ВТ_Объединение.Количество, 0) = ВТ_РС.Количество
	|			И ЕСТЬNULL(ВТ_Объединение.Себестоимость, 0) = ВТ_РС.Себестоимость
	|			И ЕСТЬNULL(ВТ_Объединение.ЦенаПродажи, 0) = ВТ_РС.ЦенаПродажи
	|			И ЕСТЬNULL(ВТ_Объединение.В_тч_НДС, 0) = ВТ_РС.В_тч_НДС
	|			И ЕСТЬNULL(ВТ_Объединение.Наценка, 0) = ВТ_РС.Наценка, ЛОЖЬ) КАК ЭтоДубль
	|ПОМЕСТИТЬ ВТ_Сравнение
	|ИЗ
	|	ВТ_Объединение КАК ВТ_Объединение
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_РС КАК ВТ_РС
	|		ПО ВТ_Объединение.РЛ = ВТ_РС.РЛ_1С
	|			И ВТ_Объединение.ЗН = ВТ_РС.Документ_1С
	|			И ВТ_Объединение.Автомобиль = ВТ_РС.Автомобиль_1С
	|			И ВТ_Объединение.Номенклатура = ВТ_РС.Номенклатура_1С
	|			И ВТ_Объединение.ВидРемонта = ВТ_РС.ВидРемонта
	|			И ВТ_Объединение.ВидСтроки = ВТ_РС.ВидСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Сравнение.Автомобиль КАК Автомобиль,
	|	ВТ_Сравнение.РЛ КАК РЛ,
	|	ВТ_Сравнение.ЗН КАК ЗН,
	|	ВТ_Сравнение.Номенклатура КАК Номенклатура,
	|	ВТ_Сравнение.Количество КАК Количество,
	|	ВТ_Сравнение.Себестоимость КАК Себестоимость,
	|	ВТ_Сравнение.ЦенаПродажи КАК ЦенаПродажи,
	|	ВТ_Сравнение.В_тч_НДС КАК В_тч_НДС,
	|	ВТ_Сравнение.Наценка КАК Наценка,
	|	ВТ_Сравнение.ВидРемонта КАК ВидРемонта,
	|	ВТ_Сравнение.ВидСтроки КАК ВидСтроки,
	|	ВТ_Сравнение.ЕстьЗаписьРС КАК ЕстьЗаписьРС
	|ИЗ
	|	ВТ_Сравнение КАК ВТ_Сравнение
	|ГДЕ
	|	НЕ ВТ_Сравнение.ЭтоДубль");    
	ЗапросЗаполнениеДОПиПП.УстановитьПараметр("НачалоПериода", ТекущаяДата() - 86400);
	ЗапросЗаполнениеДОПиПП.УстановитьПараметр("КонецПериода", КонецДня(ТекущаяДата() - 86400)); 
	
	Выборка = ЗапросЗаполнениеДОПиПП.Выполнить().Выбрать();	
	НаборЗаписей = РегистрыСведений.СебестоимостьЦенаПродажиДОП_и_ПП.СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() Цикл    
		
		Если Выборка.ЕстьЗаписьРС Тогда
			НаборКоррЗаписей = РегистрыСведений.СебестоимостьЦенаПродажиДОП_и_ПП.СоздатьНаборЗаписей();
			
			НаборКоррЗаписей.Отбор.РЛ_1С.Установить(Выборка.РЛ);
			НаборКоррЗаписей.Отбор.Документ_1С.Установить(Выборка.ЗН); 
			НаборКоррЗаписей.Отбор.Автомобиль_1С.Установить(Выборка.Автомобиль);
			НаборКоррЗаписей.Отбор.Номенклатура_1С.Установить(Выборка.Номенклатура); 
			
			НаборКоррЗаписей.Прочитать();
			
			Для Каждого Запись из НаборКоррЗаписей Цикл 
				Запись.Актуальность = Ложь;
			КонецЦикла;
			
			НаборКоррЗаписей.Записать();
		КонецЕсли;  
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.Период = ТекущаяДата(); 
		
		
		НоваяЗапись.РЛ_1С = Выборка.РЛ;
		НоваяЗапись.GUID_РЛ = ?(Выборка.РЛ = NULL, "", Строка(Выборка.РЛ.УникальныйИдентификатор()));
		НоваяЗапись.Документ_1С = Выборка.ЗН;
		НоваяЗапись.Дата = Выборка.ЗН.ДатаНачала;
		НоваяЗапись.Номер = СокрЛП(Выборка.ЗН.Номер);
		НоваяЗапись.ТипДокумента = ТипЗнч(Выборка.ЗН);
		НоваяЗапись.Автомобиль_1С = Выборка.Автомобиль;
		НоваяЗапись.VIN_Автомобиля = СокрЛП(Выборка.Автомобиль.VIN);
		НоваяЗапись.Номенклатура_1С = Выборка.Номенклатура;
		НоваяЗапись.НаименованиеНоменклатуры = СокрЛП(Выборка.Номенклатура.Наименование);   
		
		НоваяЗапись.Количество = Выборка.Количество;
		НоваяЗапись.Себестоимость = Выборка.Себестоимость;
		НоваяЗапись.ЦенаПродажи = Выборка.ЦенаПродажи;
		НоваяЗапись.В_тч_НДС = Выборка.В_тч_НДС;
		НоваяЗапись.Наценка = Выборка.Наценка;  
		
		НоваяЗапись.ВидРемонта = Выборка.ВидРемонта;
		НоваяЗапись.ВидСтроки = Выборка.ВидСтроки; 
		
		НоваяЗапись.Актуальность = Истина;  		
	КонецЦикла;
	
	Если НаборЗаписей.Количество() > 0 Тогда
		
		Попытка
			НаборЗаписей.Записать(Ложь);	
		Исключение
		КонецПопытки;   
		
	КонецЕсли;
	
КонецПроцедуры
//Иванченко 20260504 --

//Иванченко 20260427 ++
Процедура МодифицироватьТЧ(ОбластьШапкиТЧ, ОбластьСтрокиТЧ, НомерСтрокиШапкиТЧ, НазваниеКолонки) Экспорт	
	НизТЧ = ОбластьШапкиТЧ.ВысотаТаблицы;
	ПравоТЧ = ОбластьШапкиТЧ.ШиринаТаблицы; 
	ОбластьЯчеекАртикулаКонец = НомерСтрокиШапкиТЧ;    		
	
	Для НомерСтроки = 1 По НизТЧ Цикл   
		
		Для НомерКолонки = 1 По ПравоТЧ Цикл  
			ТекЯчейка = ОбластьШапкиТЧ.Область(НомерСтроки, НомерКолонки); 
			
			Если ТекЯчейка.Текст = "№" Тогда
				ВерхТЧ = НомерСтроки;
				ЛевоТЧ = НомерКолонки;
				Прервать;
			КонецЕсли;

		КонецЦикла;   
	
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(ВерхТЧ) Тогда
		ВерхТЧ = 1;
		ЛевоТЧ = 1;
		
		Для НомерСтроки = ВерхТЧ По НизТЧ Цикл  
			
			Для НомерКолонки = ЛевоТЧ По ПравоТЧ Цикл  
				ТекЯчейка = ОбластьСтрокиТЧ.Область(НомерСтроки, НомерКолонки); 
				
				Если ТекЯчейка.ГраницаСверху.ТипЛинии = ТипЛинииЯчейкиТабличногоДокумента.Сплошная И ТекЯчейка.ГраницаСлева.ТипЛинии = ТипЛинииЯчейкиТабличногоДокумента.Сплошная И ТекЯчейка.ГраницаСнизу.ТипЛинии = ТипЛинииЯчейкиТабличногоДокумента.Сплошная И ТекЯчейка.ГраницаСправа.ТипЛинии = ТипЛинииЯчейкиТабличногоДокумента.Сплошная Тогда
					ЛевоТЧ_Строка = ТекЯчейка.Лево;
					ПравоТЧ_Строка = ТекЯчейка.Право;
					Прервать;
				КонецЕсли;  
				
			КонецЦикла;    
			
		КонецЦикла;     
		
		Для НомерСтроки = ВерхТЧ По НизТЧ Цикл  
			
			Для НомерКолонки = ЛевоТЧ По ПравоТЧ Цикл  
				ТекЯчейка = ОбластьШапкиТЧ.Область(НомерСтроки, НомерКолонки); 
				
				Если ТекЯчейка.Лево = ЛевоТЧ_Строка И ТекЯчейка.Право = ПравоТЧ_Строка Тогда
					ВерхТЧ = НомерСтроки;
					ЛевоТЧ = НомерКолонки;
					Прервать;
				КонецЕсли;  
				
			КонецЦикла;    
			
		КонецЦикла;     
				
	КонецЕсли;	
	
	НомерСтрокиШапкиТЧОбласти = ВерхТЧ - 1 + НомерСтрокиШапкиТЧ;	
	ПараметрСтрокиТЧ_Артикул = ОбластьСтрокиТЧ.Область(1, ОбластьЯчеекАртикулаКонец).Параметр;     
	
	Для НомерКолонки = ЛевоТЧ По ПравоТЧ Цикл
		ТекЯчейка = ОбластьШапкиТЧ.Область(НомерСтрокиШапкиТЧОбласти, НомерКолонки);
		
		Если ТекЯчейка.Текст = НазваниеКолонки ИЛИ ТекЯчейка.Параметр = НазваниеКолонки Тогда
			ОбластьЯчеекАртикулаКонец = ТекЯчейка.Право;	
		КонецЕсли; 
		
		Если ТекЯчейка.Текст <> "" Тогда
			ПравоТЧ = НомерКолонки;		
		КонецЕсли;     
		
	КонецЦикла; 
	
	Для НомерСтроки = ВерхТЧ По НизТЧ Цикл  
		ЯвляетсяЧислом = Истина; 
		
		Для НомерКолонки = ЛевоТЧ По ПравоТЧ Цикл
			
			Попытка
				ЯчейкаЧисло = Число(ОбластьШапкиТЧ.Область(НомерСтроки, НомерКолонки).Текст);
			Исключение
				ЯвляетсяЧислом = Ложь;  			
			КонецПопытки;   
			
		КонецЦикла;	
		
		Для НомерКолонки = ЛевоТЧ По ПравоТЧ Цикл
			ТекЯчейка = ОбластьШапкиТЧ.Область(НомерСтроки, НомерКолонки);
			ЯчейкаСтрокиТЧ = ОбластьСтрокиТЧ.Область(1, НомерКолонки);
			
			Если НомерКолонки = ЯчейкаСтрокиТЧ.Лево Тогда 
				
				Если ОбластьШапкиТЧ.Область(НомерСтрокиШапкиТЧОбласти, НомерКолонки).Текст = НазваниеКолонки ИЛИ ОбластьШапкиТЧ.Область(НомерСтрокиШапкиТЧОбласти, НомерКолонки).Параметр = НазваниеКолонки Тогда
					
					Если Не обЗначениеНеЗаполнено(ЯчейкаСтрокиТЧ.ПараметрРасшифровки) Тогда
						ПараметрРасшифровкаАртикулСтрокиТЧ = ЯчейкаСтрокиТЧ.ПараметрРасшифровки; 
					КонецЕсли;

					Если ТекЯчейка.Текст = НазваниеКолонки ИЛИ ТекЯчейка.Параметр = НазваниеКолонки Тогда
						
						Если Не обЗначениеНеЗаполнено(ЯчейкаСтрокиТЧ.Параметр) Тогда
							ПараметрАртикулСтрокиТЧ = ЯчейкаСтрокиТЧ.Параметр; 
						КонецЕсли;
												
						ЯчейкаСтрокиТЧ.Параметр = ОбластьСтрокиТЧ.Область(1, ЯчейкаСтрокиТЧ.Право + 1).Параметр;   
						ЯчейкаСтрокиТЧ.ПараметрРасшифровки = ОбластьСтрокиТЧ.Область(1, ЯчейкаСтрокиТЧ.Право + 1).ПараметрРасшифровки; 						
						ОбластьСтрокиТЧ.Область(1, НомерКолонки, 1, ОбластьСтрокиТЧ.Область(1, ЯчейкаСтрокиТЧ.Право + 1).Право).Объединить();
					КонецЕсли;
					
					Если Не обЗначениеНеЗаполнено(ТекЯчейка.Параметр) И ТекЯчейка.Параметр <> "" Тогда
						ПараметрАртикулШапкиТЧ = ТекЯчейка.Параметр;
						ТекЯчейка.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст; 
					КонецЕсли;
					
					Если Не ЯвляетсяЧислом Тогда
						ТекЯчейка.Текст = ОбластьШапкиТЧ.Область(НомерСтроки, ТекЯчейка.Право + 1).Текст; 
					КонецЕсли;
										
					ОбластьШапкиТЧ.Область(НомерСтроки, НомерКолонки, НомерСтроки, ОбластьШапкиТЧ.Область(НомерСтроки, ЯчейкаСтрокиТЧ.Право + 1).Право).Объединить(); 		
				ИначеЕсли НомерКолонки > ОбластьШапкиТЧ.Область(НомерСтроки, ОбластьЯчеекАртикулаКонец + 1).Право И ЯвляетсяЧислом Тогда 
					ТекЯчейка.Текст = Строка(Число(ОбластьШапкиТЧ.Область(НомерСтроки, ТекЯчейка.Лево - 1).Текст) + 1); 
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЦикла;  
	
	Если Не обЗначениеНеЗаполнено(ПараметрАртикулШапкиТЧ) Тогда
		ШапкаЗаПределами = ОбластьШапкиТЧ.Область("R" + Число(НизТЧ + 1));
		ЯчейкаШапкиЗаПределами = ОбластьШапкиТЧ.Область(Число(НизТЧ + 1), 1);	
		ЯчейкаШапкиЗаПределами.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Параметр;   
		
		ЯчейкаШапкиЗаПределами.Параметр = ПараметрАртикулШапкиТЧ;   
		ШапкаЗаПределами.Видимость = Ложь;	
	КонецЕсли;		
	
	Если Не обЗначениеНеЗаполнено(ПараметрАртикулСтрокиТЧ) Тогда
		СтрокаЗаПределами = ОбластьСтрокиТЧ.Область("R2");
		ЯчейкаСтрокиЗаПределами = ОбластьСтрокиТЧ.Область(2, 1);	
		ЯчейкаСтрокиЗаПределами.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Параметр; 
		ЯчейкаСтрокиЗаПределами.Параметр = ПараметрАртикулСтрокиТЧ; 
		ЯчейкаСтрокиЗаПределами.ПараметрРасшифровки = ПараметрРасшифровкаАртикулСтрокиТЧ;
		СтрокаЗаПределами.Видимость = Ложь;	
	КонецЕсли;
	
КонецПроцедуры
//Иванченко 20260427 --

//Иванченко 20260521 ++
// Перевод через API Google
// Пример заполнения параметров:
// Текст = "Привет, мир!"
// ЯзыкПеревода = "en"
Функция  Перевести(Текст, ЯзыкПеревода) Экспорт 
	ПарсингТекста = СтрЗаменить(Текст, " ", "%20");
	
	HTTPЗапрос = Новый HTTPЗапрос("/translate_a/single?client=gtx&sl=auto&tl=" + ЯзыкПеревода + "&dt=t&q=" + ПарсингТекста);  
	
	HTTPСоединение = Новый HTTPСоединение("translate.googleapis.com",,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	Ответ = HTTPСоединение.ВызватьHTTPМетод("POST",HTTPЗапрос);
	
	Если Ответ.КодСостояния <> 200 Тогда
		
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
	
	Чтение = Новый ЧтениеJSON;
    Чтение.УстановитьСтроку(ТекстОтвета);
    МассивМассивов = ПрочитатьJSON(Чтение);    // Функция ПрочитатьJSON с параметром Истина (по умолчанию)
    
    Результат = ""; 
	
    Попытка
        // Структура ответа: [[["перевод", "исходный", null, null, 1]], null, "en"]
        // МассивМассивов[0] – массив предложений
        // МассивМассивов[0][0] – массив с деталями первого предложения
        // МассивМассивов[0][0][0] – перевод (строка)    
		
        Если ТипЗнч(МассивМассивов) = Тип("Массив") И МассивМассивов.Количество() > 0 Тогда
            Предложения = МассивМассивов[0];         
			
			Если ТипЗнч(Предложения) = Тип("Массив") И Предложения.Количество() > 0 Тогда
               	НомерСтроки = 0;

				Для каждого Строки Из Предложения Цикл
			
					Если ТипЗнч(Строки) = Тип("Массив") И Строки.Количество() > 0 Тогда  
						
						Для каждого Строка Из Строки Цикл
							
							Если ТипЗнч(Строка) = Тип("Строка") И СтрНайти(Текст, Строка) = 0 Тогда	
								Результат = ?(Результат = "", Строка, Результат + " " + Строка); 
							КонецЕсли;
							
						КонецЦикла; 

					КонецЕсли;   
					
					Если НомерСтроки < Предложения.Количество() - 1 И Результат <> "" Тогда
						Результат = Результат + Символы.ПС; 
					КонецЕсли;
					
					НомерСтроки = НомерСтроки + 1; 
				КонецЦикла; 
			
			КонецЕсли;    
			
        КонецЕсли;
        
        Если ПустаяСтрока(Результат) Тогда
			Возврат Неопределено;
        КонецЕсли;
        
    Исключение
		Возврат Неопределено;
    КонецПопытки;
    
	Возврат Результат;
КонецФункции
//Иванченко 20260521 --