&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ПараметрыСеанса.Renault_ПраваПользователя.ИспользоватьПриоритетыПродажАвтомобилей Тогда
		Сообщить("Нет прав на использование функционала ""Приоритеты продаж автомобиля""!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Цвет = Renault_Открытый.ПолучитьЦветПоСтроке(Объект.ЦветСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ЦветПриИзменении(Элемент)
	Объект.ЦветСтрока = Renault_Открытый.ЦветВСтроку(Цвет);
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

