
Процедура ЗаполнитьТаблицуТоваровОтправитьПостЗапрос() Экспорт
	
	Перем МассивДанныхJSON;
	
	МассивДанныхJSON = Новый Массив;

	ИмяФ = Формат(ТекущаяДата(),"ДФ=yyyy-MM-dd")+Формат(ТекущаяДата(),"ДЛФ=T");
	ИмяФ = СтрЗаменить(ИмяФ,"-","");
	ИмяФ = СтрЗаменить(ИмяФ,":","");
	ИмяФ = СтрЗаменить(ИмяФ," ","");
	ЭтотОбъект.ПутьКфайлу = КаталогВременныхФайлов()+ИмяФ+".xlsx";	
	
	КраткоеИмяФайла = ИмяФ+".xlsx";	
	
	ЭтотОбъект.ТипЦен=Справочники.ТипыЦен.ОптоваяЦена;
	ЭтотОбъект.ПодразделениеКомпании=Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура.Ссылка КАК Номенклатура,
	|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток - ОстаткиТоваровКомпанииОстатки.РезервОстаток КАК КолОст,
	|	ЦеныСрезПоследних.Цена КАК ЦенаДляОптовика,
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура.Производитель.Наименование КАК Производитель,
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура.Артикул КАК Артикул,
	|	(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток - ОстаткиТоваровКомпанииОстатки.РезервОстаток) * ЦеныСрезПоследних.Цена КАК Сумма
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки КАК ОстаткиТоваровКомпанииОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
	|			ЦеныСрезПоследних.Цена КАК Цена
	|		ИЗ
	|			РегистрСведений.Цены.СрезПоследних КАК ЦеныСрезПоследних
	|		ГДЕ
	|			ЦеныСрезПоследних.ТипЦен = &ТипЦен
	|			И ЦеныСрезПоследних.ПодразделениеКомпании = &ПодразделениеКомпании) КАК ЦеныСрезПоследних
	|		ПО ОстаткиТоваровКомпанииОстатки.Номенклатура = ЦеныСрезПоследних.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура.Артикул,
	|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток - ОстаткиТоваровКомпанииОстатки.РезервОстаток,
	|	(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток - ОстаткиТоваровКомпанииОстатки.РезервОстаток) * ЦеныСрезПоследних.Цена,
	|	ЦеныСрезПоследних.Цена,
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура.Ссылка,
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура.Производитель.Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сумма УБЫВ";
	
	Запрос.УстановитьПараметр("ТипЦен", Справочники.ТипыЦен.ОптоваяЦена);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", Справочники.ПодразделенияКомпании.ОсновноеПодразделение);
 	
  	Состав.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ФайлВыгрузки = Новый Файл(ПутьКФайлу);
	
	 ёё = 0;
	 
	 Макет = ПолучитьМакет("Макет");
	 ТабДок = Новый ТабличныйДокумент;
	 
	 ОбластьЗаг = Макет.ПолучитьОбласть("ЗагТаб");
	 ОбластьЗаг.Параметры.ЗаголовокОтчета = "Прайс-лист от "+Формат(ТекущаяДата(),"ДЛФ=DD");
	 ТабДок.Вывести(ОбластьЗаг);
	 
	 ОбластьШапки = Макет.ПолучитьОбласть("ШапкаТаб");
	 ТабДок.Вывести(ОбластьШапки);

	 ОбластьСтроки = Макет.ПолучитьОбласть("СтрокаТаб");
	 
	 Всего = Состав.Количество();
	 
	 Для каждого Стр1 Из Состав Цикл
		 
		 ОбработкаПрерыванияПользователя();
		
		#Если Клиент Тогда
		Состояние("Строка: "+СокрЛП(Стр1.НомерСтроки)+" из "+Всего); 
	 	#КонецЕсли
	 	
		Если обЗначениеНеЗаполнено(Стр1.ЦенаДляОптовика) ИЛИ (Число(СокрЛП(СтрЗаменить(Стр1.ЦенаДляОптовика,Символы.НПП,""))) < 0)  Тогда
		    Продолжить;
	 	КонецЕсли; 
		
		Если обЗначениеНеЗаполнено(Стр1.КолОст) ИЛИ (Число(СокрЛП(СтрЗаменить(Стр1.КолОст,Символы.НПП,""))) < 0)  Тогда
		    Продолжить;
		КонецЕсли; 
		
		ёё = ёё + 1;
		
		ОбластьСтроки.Параметры.Нпп = ёё;
		ОбластьСтроки.Параметры.Товар = СокрЛП(Стр1.Производитель);
		ОбластьСтроки.Параметры.Производитель = СокрЛП(Стр1.Производитель);
 		ОбластьСтроки.Параметры.Артикул = СокрЛП(Стр1.Артикул);
		ОбластьСтроки.Параметры.КолОст = Число(СокрЛП(СтрЗаменить(Стр1.КолОст,Символы.НПП,"")));
		ОбластьСтроки.Параметры.ЦенаОпт = Число(СокрЛП(СтрЗаменить(Стр1.ЦенаДляОптовика,Символы.НПП,"")));
		ОбластьСтроки.Параметры.ДЦ = "Авто Лига";
 		ОбластьСтроки.Параметры.СрокПоставкиВднях = "2-3";
		ТабДок.Вывести(ОбластьСтроки);
 	 	
	КонецЦикла; 
	
	ОбластьПодвала = Макет.ПолучитьОбласть("ПодвалТаб");
	ОбластьПодвала.Параметры.ОбОтчете = "Прайс-лист сформирован "+ТекущаяДата()+" пользователем "+ПараметрыСеанса.Пользователь;
	ТабДок.Вывести(ОбластьПодвала);

	
  	ТипФ = ТипФайлаТабличногоДокумента.XLSX;
	
	ФайлСформирован=Истина;
	
	ПолноеИмяФайла = ПутьКфайлу;
	
	Попытка
		ТабДок.Записать(ПолноеИмяФайла,ТипФ);
	Исключение
		ФайлСформирован=Ложь;
	КонецПопытки;
	 
    //=============================================================================
	
	Если ФайлСформирован Тогда
		
		URL    = "id23632.public.api.abcp.ru";
		Логин  = "api@id23632";
 		Пароль = "4ccaad1b07bb89c470bb9afde1001bf2";
		
	 	Попытка
			HTTPСоединение = Новый HTTPСоединение(URL,443,Логин,Пароль,,,Новый ЗащищенноеСоединениеOpenSSL(),Истина);
			//HTTPСоединение = Новый HTTPСоединение(URL, 80, ,,,,,);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ОШИБКА! Не удалось подключиться к серверу: "+URL);		
			Отказ = Истина;
			Возврат;
		КонецПопытки; 
		
		Boundary = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
		
 		запросPOST = Новый HTTPЗапрос("/cp/distributor/pricelistUpdate"); 
		запросPOST.АдресРесурса="/cp/distributor/pricelistUpdate";
 		
 		СодержимоеФайла = ПолучитьСтрокуИзДвоичныхДанных(Новый ДвоичныеДанные(ПолноеИмяФайла));
 		
		запросPOST.Заголовки.Вставить("Content-type", СтрЗаменить("multipart/form-data; Boundary="+Boundary,"""",""));  
 		
		КодироватьФайл = Истина; 
		
		ИмяФайлаОтправки = КаталогВременныхФайлов() + "post.txt"; 
		
		ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки, КодировкаТекста.ANSI, Символы.ПС, Ложь); 
		
		ФайлОтправки.ЗаписатьСтроку("--" + Boundary); 
		ФайлОтправки.ЗаписатьСтроку("Content-Disposition: form-data; name=""userlogin"""+ Символы.ПС); 
		ФайлОтправки.ЗаписатьСтроку("api@id23632"); 
		
		ФайлОтправки.ЗаписатьСтроку("--" + Boundary); 
		ФайлОтправки.ЗаписатьСтроку("Content-Disposition: form-data; name=""userpsw"""+ Символы.ПС); 
		ФайлОтправки.ЗаписатьСтроку("4ccaad1b07bb89c470bb9afde1001bf2"); 
		
		ФайлОтправки.ЗаписатьСтроку("--" + Boundary); 
		ФайлОтправки.ЗаписатьСтроку("Content-Disposition: form-data; name=""distributorId"""+ Символы.ПС); 
		ФайлОтправки.ЗаписатьСтроку("1548436"); 
  		
		ФайлОтправки.ЗаписатьСтроку("--" + Boundary); 
 		ФайлОтправки.ЗаписатьСтроку("Content-Disposition: form-data; name=""uploadFile""; filename=""" + КраткоеИмяФайла + """"); 
 		ФайлОтправки.ЗаписатьСтроку("Content-Type: application/octet-stream" + Символы.ПС); 
		
		ФайлОтправки.ЗаписатьСтроку(СодержимоеФайла); 
		ФайлОтправки.ЗаписатьСтроку("--" + Boundary);
			
 		ФайлОтправки.Закрыть();
		
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайлаОтправки);
	 	запросPOST.Заголовки.Вставить("Content-Length",Строка(Формат(ДвоичныеДанные.Размер(),"ЧЦ=10; ЧГ=0")));
		
	    запросPOST.Заголовки.Вставить("FileTypeId",1);
  		
		ЗапросPost.УстановитьИмяФайлаТела(ИмяФайлаОтправки);
 		
		ФайлОтвета = КаталогВременныхФайлов()+ "АnswerFromABCP.html";
		
		БезОшибок = Истина;
		
		Попытка
			Рез = HTTPСоединение.ВызватьHTTPМетод("POST", запросPOST, ФайлОтвета);
 		Исключение
			БезОшибок = Ложь;
		КонецПопытки; 
	Иначе
		#Если Клиент Тогда
			Сообщить("ОШИБКА! Файл XLSX не сформирован.",СтатусСообщения.ОченьВажное); 
		#КонецЕсли
	КонецЕсли; 
	
	Если БезОшибок Тогда
		#Если Клиент Тогда
			Сообщить("Запрос прошел успешно",СтатусСообщения.Внимание); 
			ЗапуститьПриложение("explorer " + ФайлОтвета);
		#КонецЕсли
   	Иначе
		#Если Клиент Тогда
			Сообщить("ОШИБКА! Запрос не выполнен",СтатусСообщения.ОченьВажное); 
		#КонецЕсли
	КонецЕсли; 
 
КонецПроцедуры

 