Процедура ДобавитьЗапись(ЗаказПоставщику,Состояние,Комментарий = "") Экспорт 
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ЗаказПоставщику	= ЗаказПоставщику;
	МенеджерЗаписи.Период			= ТекущаяДата();
	МенеджерЗаписи.Прочитать();
	
	Если Не МенеджерЗаписи.Выбран() Тогда    
		МенеджерЗаписи.ЗаказПоставщику	= ЗаказПоставщику;
		МенеджерЗаписи.Период 			= ТекущаяДата();
		МенеджерЗаписи.Комментарий      = Комментарий;
		МенеджерЗаписи.Состояние		= Перечисления.СостояниеЗаказаПоставщику[Состояние];
		МенеджерЗаписи.Автор			= ПараметрыСеанса.Пользователь;
		МенеджерЗаписи.СуммаДокумента	= ЗаказПоставщику.СуммаДокумента;
		МенеджерЗаписи.Записать();
	КонецЕсли;
КонецПроцедуры

Функция СогласованиеЗапущено(ЗаказПоставщику) Экспорт
	ПолучитьСрезПервых = СрезПервых(,Новый Структура ("ЗаказПоставщику",ЗаказПоставщику));
	
	Если ПолучитьСрезПервых.Количество() <> 0 Тогда
		Состояние = ПолучитьСрезПервых[0].Состояние;
		Если Состояние = Перечисления.СостояниеЗаказаПоставщику.Запущен Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ПолучитьТекущийСтатусСогласов5ания(ЗаказПоставщику) Экспорт
	ПолучитьСрезПоследних = СрезПоследних(,Новый Структура ("ЗаказПоставщику",ЗаказПоставщику));
	Если ПолучитьСрезПоследних.Количество() <> 0 Тогда
		Состояние = ПолучитьСрезПоследних[0].Состояние;
		Возврат Состояние;
	Иначе
		Возврат Перечисления.СостояниеЗаказаПоставщику.ПустаяСсылка();
	КонецЕсли;
КонецФункции

Функция СогласованНаТекущийМомент(ЗаказПоставщику) Экспорт 
	ТекущийСтатус = ПолучитьПоследнее(ТекущаяДата(),Новый Структура("ЗаказПоставщику",ЗаказПоставщику));
	Если ЗначениеЗаполнено(ТекущийСтатус.Состояние) И ТекущийСтатус.Состояние = Перечисления.СостояниеЗаказаПоставщику.Согласовано Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции
