Процедура ПроверкаТабличнойЧастиТоварыНаКорректноеЗаполнение(Отказ, РежимЗаписи, РежимПроведения, ЭтотОбъект) Экспорт 
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Параметры = ПолучитьДанныеПроверкиТабличнойЧастиТовары(ЭтотОбъект);
		
		Если Не Параметры.ЕстьНесовпадения Тогда 
			Возврат;
		КонецЕсли;

		СформироватьТекстОшибки(Параметры,ЭтотОбъект);
		
		ОтменитьПроведение(Параметры,Отказ);		
	КонецЕсли;
КонецПроцедуры

Процедура ОтменитьПроведение(Параметры,Отказ)
	Отказ = Параметры.ЕстьНесовпадения;
КонецПроцедуры

Процедура СформироватьТекстОшибки(Параметры,ЭтотОбъект)
	НомераСтрок 	= Параметры.НомераСтрок;
	ИтоговыйТекст	= "";
	ТекстШаблон		= "В строке номер <%1>, стоит единица измерения <%2>, но должна стоять основаная единица измерения <%3>";
	Товары			= ЭтотОбъект.Товары;
	
	Для Каждого Строка Из НомераСтрок Цикл
		СтрокаТоваров			 = Товары[Строка];
		НомерСтроки				 = СтрокаТоваров.НомерСтроки;
		ТекущаяЕдиницаИзмерения  = СтрокаТоваров.ЕдиницаИзмерения;
		ОсновнаяЕдиницаИзмерения = СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения;
		Шаблон		  			 = СтрШаблон(ТекстШаблон,НомерСтроки,ТекущаяЕдиницаИзмерения,ОсновнаяЕдиницаИзмерения);
		ИтоговыйТекст			 = ИтоговыйТекст + Шаблон + Символы.ПС;
	КонецЦикла;
	
	ИтоговыйТекст = ИтоговыйТекст + "Проведение отменено.";
	
	ПоказатьТекстОшибки(ИтоговыйТекст);
КонецПроцедуры    

Процедура ПоказатьТекстОшибки(ИтоговыйТекст);
	Сообщить(ИтоговыйТекст);
КонецПроцедуры

Функция ПолучитьДанныеПроверкиТабличнойЧастиТовары(ЭтотОбъект)
	Товары			  = ЭтотОбъект.Товары;  
	ПараметрыПроверки = ПолучитьПараметрыПроверкиТабличнойЧасти();
	
	Для Каждого Строка Из Товары Цикл
		ОсновнаяЕдиницаИзмерения = Строка.Номенклатура.ОсновнаяЕдиницаИзмерения;
		ТекущаяЕдиницаИзмерения  = Строка.ЕдиницаИзмерения; 
		
		Если ТекущаяЕдиницаИзмерения <> ОсновнаяЕдиницаИзмерения Тогда
			Если Не ПараметрыПроверки.ЕстьНесовпадения Тогда
				ПараметрыПроверки.ЕстьНесовпадения = Истина;
			КонецЕсли;                                              
			ИндексСтроки = Товары.Индекс(Строка);
			ПараметрыПроверки.НомераСтрок.Добавить(ИндексСтроки);
		КонецЕсли;
	КонецЦикла; 
	
	Возврат ПараметрыПроверки;
КонецФункции

Функция ПолучитьПараметрыПроверкиТабличнойЧасти()
	Структура = Новый Структура;
	Структура.Вставить("ЕстьНесовпадения"	,Ложь);
	Структура.Вставить("НомераСтрок"		,Новый Массив);
	
	Возврат Структура;
КонецФункции

Процедура ПоступлениеТоваровПередЗаписью(Отказ, РежимЗаписи, РежимПроведения, ЭтотОбъект) Экспорт
	ПроверкаТабличнойЧастиТоварыНаКорректноеЗаполнение(Отказ, РежимЗаписи, РежимПроведения, ЭтотОбъект);
КонецПроцедуры