/////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБРАБОТКИ
Перем РаботаВозможна Экспорт;
Перем Компонент Экспорт;
Перем НабранныйКонтакт Экспорт;             // При наборе номера хранит структуру номера и контакт из базы данных с которым идет соединение
Перем ТипВнутреннийВнешнийЗвонок Экспорт;   // Структура содержит тип внутренний или внешний звонок
Перем ФормаТелефон Экспорт;                 // Ссылается на открытую форму телефона
Перем СостояниеЭкстеншена Экспорт;			// Структура содержит представление состояний экстеншена Свободен, Разговаривает, Недоступен
Перем ЗапланированныйДонабор Экспорт;		// Соответсвие номера набора и донабора, т.к. донабор нам нужно делать во время соединения
Перем БезИнтеграционныйРежим Экспорт; 		// Если панель используется без встаривания в типовую конфигурацию то эта переменная равна ИСТИНА.
Перем КлючУникальности;						// Специальный параметр отправляемый командами астрериск, чтобы однозначно идентифицировать адресата получателя ответа. Передаем в ActionID 	

Перем SIP_ОстатокДнейЛицензии Экспорт; 
Перем SIP_ТипЛицензии Экспорт; 
Перем SIP_РегистрационныйНомер Экспорт;
Перем SIP_ОписаниеОшибки Экспорт;

Перем ПодключенКСерверуТелефонии Экспорт;
Перем НаборНомераРазрешен Экспорт;          // Служит для органичения числа одновременных наборов номеров
Перем SIP_ТаблицаКлючей Экспорт;

Перем ЕстьДокументСобытие;
Перем ВСобытииЕстьUID;
/////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ИНТЕГРАЦИИ С БАЗОЙ ДАННЫХ

// Дополнить данные телефонных номеров для мастера создания автоматического клиента
//  или контактного лица
Процедура ДополнитьДанныеНезарегистрированногоКонтрагента(ДанныеНезарегистрированногоКонтрагента) Экспорт
	Возврат;	
КонецПроцедуры

// Выполняем подключение Софтфона, вызов функции располагается в модуле приложения
//  в процедуре ПриСтартеСистемы
Функция ПодключитьСофтФон() Экспорт
	
	РезультатПодключенияСофтФона = Ложь;
	/////////////////////////////////////////////////////////////////////////
	// Инициализация
	Если ДопМодули = Неопределено Тогда
		ИнициализироватьОсновныеДопМодули();
		// Получим сохраненные ранее значения настроек панели
	КонецЕсли;
	// Сохраненная ранее история звонков
	ЗаполнитьТаблицуИсторииЗвонков(ТекущаяДата()); 
	мОбработкаДанных.ВосстановитьОсновныеНастройки();
	/////////////////////////////////////////////////////////////////////////
	// Можно использовать софт фон
	Если ИспользоватьСофтФон() Тогда

		// Если форма уже определена, то вызовем ее
		Если БезИнтеграционныйРежим ИЛИ ГлобальныеПеременные.глИспользоватьПанельТелефонии Тогда
			Если Компонент=Неопределено Тогда
				ПодключитьВК();
			КонецЕсли;	
			
			// Если форма уже определена, то вызовем ее
			Если ФормаТелефон = Неопределено Тогда
				ФормаТелефон = ЭтотОбъект.ПолучитьФорму("ФормаПанели");
			КонецЕсли;
			
			Если ФормаТелефон.Открыта() Тогда 
            	// не активизируем
			Иначе ФормаТелефон.Открыть();
			КонецЕсли;
			РезультатПодключенияСофтФона = Истина;
		Иначе
			// Если флаг изменился, то принудительно закроем форму
			Если ФормаТелефон <> Неопределено 
				И ФормаТелефон.Открыта() 
				Тогда ФормаТелефон.Закрыть(); КонецЕсли;
			// Отключение СофтФона, результат отработки процедуры истина
			РезультатПодключенияСофтФона = Истина;
		КонецЕсли;
	Иначе
		// Если флаг изменился, то принудительно закроем форму
		Если НЕ ФормаТелефон = Неопределено Тогда
			Если ФормаТелефон.Открыта() Тогда ФормаТелефон.Закрыть(); КонецЕсли;
			// Отключение СофтФона, результат отработки процедуры истина
			РезультатПодключенияСофтФона = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатПодключенияСофтФона;
КонецФункции

// Функция определяет используется ли СофтФон в системе и для текущего пользователя
//
Функция ИспользоватьСофтФон() Экспорт
    // проверка параметров запуска
	Если КонтрольПервогоЗапуска() = Ложь Тогда
		Возврат Ложь;
	КонецЕсли; 

	ГлобальныеПеременные.Вставить("глИспользоватьПанельТелефонии", мОбщийМодуль.ИспользоватьПанельТелефонии(БезИнтеграционныйРежим));
	Возврат ГлобальныеПеременные.глИспользоватьПанельТелефонии;
КонецФункции

// Проверка параметров запуска
// Старт помощника настройки
Функция КонтрольПервогоЗапуска()

	Если РаботаВозможна = Ложь Тогда
		// на случай, если проверка уже происходила ранее в этом сеансе работы
		//
		Возврат РаботаВозможна;	
	КонецЕсли; 
	
	ПервыйЗапускТекП = мОбработкаДанных.ПолучитьНастройкиИзХранилища("MIKO","SIP_ЭтоПервыйЗапуск"+БезИнтеграционныйРежим,,ИмяПользователя());
	Если ПервыйЗапускТекП <> "НЕТ" Тогда
		Если НЕ РольДоступна("ПолныеПрава") Тогда
			// со стартовым помощником при первом запуске может работать только
			// пользователь с полными правами
			РаботаВозможна = Ложь;
			Возврат РаботаВозможна;		
		КонецЕсли; 
		
		Форма = ПолучитьФорму("ЛицензионноеСоглашение"); 
		Если Форма.Открыта() Тогда
			Возврат Ложь;		
		КонецЕсли; 
		Результат = Форма.ОткрытьМодально();
		Если Результат = Истина Тогда
			мОбработкаДанных.СохранитьНастройкиВХранилище("MIKO","SIP_ЭтоПервыйЗапуск"+БезИнтеграционныйРежим, "НЕТ",,ИмяПользователя());
			Если НЕ БезИнтеграционныйРежим 
				И НЕ мОбщийМодуль.ПервыйЗапускВозможен() Тогда
				РаботаВозможна = Истина;
				Возврат РаботаВозможна;
			КонецЕсли; 
		Иначе
			Если НЕ ФормаТелефон = Неопределено Тогда
				ФормаТелефон.Закрыть();
			КонецЕсли;
			ОтключитьВК();
			РаботаВозможна = Ложь;
			Возврат РаботаВозможна;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции // КонтрольПервогоЗапуска()
 
// Процедура вызывается из карточек тех объектов, к которым можно вводить
//  контактную информацию, изменяет текущую запись регистра и вызывает 
//  обработку заполнения телефона, Идентификатор и Номер телефона передается из документа
//  в виде строки параметров СтрокаПараметров, а так же внутренний или внешний это номер
Процедура СоздатьНомерКИ(ТекущаяСтрока, ОбъектКИ, ФормаВладелец, СтрокаПараметров) Экспорт 
	Если НЕ ЗначениеЗаполнено(СтрокаПараметров) Тогда
		Возврат;
	КонецЕсли; 
	// Проверим может ли пользователь работать с СофтФоном
	ФормаДобавленияКИ = ЭтотОбъект.ПолучитьФорму("ДобавлениеНомераКИ", ФормаВладелец, СтрокаПараметров);
	
	// дозаполняем поля формы
	ДанныеЗаполнения = мОбщийМодуль.ПолучитьДанныеЗаполненияСоздатьНомерКИ(ОбъектКИ);
	ЗаполнитьЗначенияСвойств(ФормаДобавленияКИ, ДанныеЗаполнения);
	
	ФормаДобавленияКИ.ОткрытьМодально();
	
	Если ФормаВладелец = Неопределено Тогда
		ЗаполнитьТаблицуИсторииЗвонков(ФормаТелефон.ЭлементыФормы.ПолеКалендаряИсторииЗвонков.Значение);
	КонецЕсли; 
КонецПроцедуры

// Процедура вызывается из карточек тех объектов, у которых необходимо набрать номер
// 
Процедура НабратьНомерКИ(ТекущаяСтрока) Экспорт
	// Проверим может ли пользователь работать с СофтФоном
	Если мОбработкаДанных = Неопределено
		 И НЕ ТекущаяСтрока = Неопределено
		 И НЕ мОбработкаДанных.РаботаССофтФономРазрешена(Истина, ГлобальныеПеременные.глИспользоватьПанельТелефонии, мПользователь) Тогда 
		Возврат; 
	КонецЕсли;
	
	Если ТекущаяСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		СтруктураТелефона = мОбработкаДанных.СформироватьСтруктуруНомераИзПолей(ТекущаяСтрока);
		Если ЗначениеЗаполнено(СтруктураТелефона.Представление) Тогда
			НабранныйКонтакт = мОбработкаДанных.ПреобразоватьКонтактВСтруктуру(ТекущаяСтрока.Объект, ТекущаяСтрока.Поле1, ТекущаяСтрока.Поле2, ТекущаяСтрока.Поле3, ТекущаяСтрока.Поле4);
			НабираемыйНомер	 = ПреобразоватьНомерСУчетомПрефиксов(СтруктураТелефона,Ложь);
			Если ЗначениеЗаполнено(ТекущаяСтрока.Поле4) Тогда
				ЗапланированныйДонабор.Вставить(НабираемыйНомер, ТекущаяСтрока.Поле4);
			КонецЕсли;	
			НабратьНомер(НабираемыйНомер);
		КонецЕсли;	
		
	КонецЕсли;
КонецПроцедуры

// Процедура выдает пользователю на экран список телефонных номеров
//   объектов, переданных в СписокОбъектов. И по выбранному выполняем дозвон
Процедура ПозвонитьВыбравТелефон(СписокОбъектов) Экспорт
	
	СписокТелефонов = Новый СписокЗначений;
	
	Для каждого ТекущийОбъект Из СписокОбъектов Цикл
		мОбщийМодуль.ПолучитьСписокТелефоновСофтФон(ТекущийОбъект.Значение, СписокТелефонов);
	КонецЦикла;
	
	КоличествоНайденныхНомеров = СписокТелефонов.Количество();
	Если КоличествоНайденныхНомеров = 0 Тогда
		Возврат;
		// как минимум две записи (одна корневая)
	ИначеЕсли КоличествоНайденныхНомеров = 2 Тогда 
		ЭлементСписка = СписокТелефонов[1];
	Иначе
		ЭлементСписка = СписокТелефонов.ВыбратьЭлемент("Выберите телефон");
	КонецЕсли;
	
	Если ЭлементСписка = Неопределено Тогда Возврат; КонецЕсли;
	
	ТелефонныйНомер = ЭлементСписка.Значение;
	Если ТелефонныйНомер.Количество() = 0 Тогда Возврат; КонецЕсли;
	
	НабранныйКонтакт = мОбработкаДанных.ПреобразоватьКонтактВСтруктуру(ТелефонныйНомер.Объект, ТелефонныйНомер.КодСтраны, ТелефонныйНомер.КодГорода, ТелефонныйНомер.НомерТелефона, ТелефонныйНомер.Внутренний);
	НабираемыйНомер	 = ПреобразоватьНомерСУчетомПрефиксов(ТелефонныйНомер,Ложь);
	Если ЗначениеЗаполнено(ТелефонныйНомер.Внутренний) Тогда
		ЗапланированныйДонабор.Вставить(НабираемыйНомер, ТелефонныйНомер.Внутренний);
	КонецЕсли;	
	НабратьНомер(НабираемыйНомер);
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБРАБАТЫВАЮЩИЕ СОБЫТИЯ КОМПОНЕНТЫ

// Обработка внешнего события нашей компоненты SIP из главного модуля
//
Процедура ОбработкаВнешнегоСобытия_SIP(Источник, Событие, Данные) Экспорт
	
	СообщитьОтладочнуюИнформацию("SIP софтфон для 1С: Внешнее событие: [" + Событие + "] " ,Данные);
	// регистр не имеет значения, приводим все к нижнему 
	Событие = Нрег(Событие);
	
	Если Событие = "connection" Тогда
		ОбновитьСостояниеПодключения(Данные);
	ИначеЕсли событие = "message" Тогда
		ОбработатьОшибку(Данные);
	ИначеЕсли Событие = "call" Тогда
		ОбновитьСписокВызовов(Данные);
	ИначеЕсли Событие = "presence" Тогда
		onPresence(Данные);	
	ИначеЕсли Событие = "hasp_error" Тогда
		Если SIP_ТипЛицензии = "perpetual" Тогда
			// тут что то не то, драйвер не смог захватить лицензию
			SIP_РегистрационныйНомер = "";
		КонецЕсли; 
		SIP_ТипЛицензии = "trial";
		SIP_ОстатокДнейЛицензии = 0;
		Сообщить(НСтр("ru = '""Система защиты: " + Данные + "'"), СтатусСообщения.ОченьВажное);	
	Иначе
		Оповестить(Событие, Данные, ФормаТелефон);
	КонецЕсли;
КонецПроцедуры // ОбработкаВнешнегоСобытия_SIP

// Обработка оповещений о статусах пользователей
// [Presence]  <presence uri='sip:104@devsip228.ru:5060' status='Ready' />
// [Presence]  <presence uri='sip:104@devsip228.ru:5060' status='On the phone' />
// [Presence]  <presence uri='sip:104@devsip228.ru:5060' status='Ready' />
// [Presence]  <presence uri='sip:101@devsip228.ru:5060' status='Ringing' />
Процедура onPresence(Данные)

	ЧтениеXML = ПолучитьЧтениеXML(Данные);
	Если НЕ ЧтениеXML = Неопределено И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "presence" Тогда
		Результат_Соединение = Новый Структура("Номер,Статус");
		
		стр_status = ЧтениеXML.ЗначениеАтрибута("status");
		Если стр_status = "Ready" Тогда
			status = СостояниеЭкстеншена.Свободен;
		ИначеЕсли стр_status = "On the phone" Тогда	
			status = СостояниеЭкстеншена.Разговаривает;
		ИначеЕсли стр_status = "Not online" Тогда 
			status = СостояниеЭкстеншена.Недоступен;
		ИначеЕсли стр_status = "Ringing" Тогда 
			status = СостояниеЭкстеншена.Звонит;
		Иначе
			Возврат;
		КонецЕсли; 
		uri = ЧтениеXML.ЗначениеАтрибута("uri");
		ПозТоч = Найти(uri, ":");
		ПозСоб = Найти(uri, "@");
		Если ПозТоч>0 И ПозСоб>0 Тогда
			Номер = Сред(uri,ПозТоч+1, ПозСоб - ПозТоч-1);
		Иначе
			Возврат;
		КонецЕсли; 
		
		Для каждого ТекСотрудник Из Сотрудники Цикл
			Если НЕ ЗначениеЗаполнено(ТекСотрудник.ВнутреннийНомер)
				 ИЛИ НЕ ТекСотрудник.ВнутреннийНомер = Номер Тогда
				Продолжить;
			КонецЕсли; 
			ТекСотрудник.Состояние = status;
		КонецЦикла;
		
		Для каждого Линия Из ПанельBLF Цикл
		   	Если НЕ ЗначениеЗаполнено(Линия.Номер)
				 ИЛИ НЕ Линия.Номер = Номер Тогда
		     	Продолжить;
		  	КонецЕсли; 
			Линия.Состояние = status;
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры
 
// Обновляет состояние сетевого подключения.
//
//  НовоеСостояние [Строка]   Текст в формате XML. Определяет состояние
//                            подключения. Коды состояния соответсвуют кодам SIP
//                            протокола. Используются коды 200 для подтверждения
//                            запроса на подключения и коды 401,403 для отклония
//                            запроса.
//
Процедура ОбновитьСостояниеПодключения(НовоеСостояние)
	SIP_ОписаниеОшибки = "";
	
	Соединение = Неопределено;
	РазобратьXML_Connection(НовоеСостояние, Соединение);
	
	Если Соединение.Код = "200" Тогда
		Состояние("SIP софтфон для 1С: подключен к " + МенеджерЛогин + "@" + Хост);
		ПервыйЗапуск = НЕ (ПодключенКСерверуТелефонии = Истина);
		ПодключенКСерверуТелефонии = Истина;
		SendMetrikaStat("");
		//
		ПодписатьсяНаОтслеживаниеСостояний();
	ИначеЕсли Соединение.Состояние = "Connecting" Тогда
		Состояние("SIP софтфон для 1С: Подключение к серверу SIP телефонии...");
		ПодключенКСерверуТелефонии = ?(ПодключенКСерверуТелефонии = Неопределено, Ложь, ПодключенКСерверуТелефонии);
	Иначе
		ПодключенКСерверуТелефонии = Ложь;
		Если Соединение.Код = "401" Или Соединение.Код = "403" Тогда
			SIP_ОписаниеОшибки 	  = "Неверный логин/пароль. Код ошибки SIP - " + Соединение.Код + ".";
			
			мОбработкаДанных.ОткрытьФормуНастроек();	
		ИначеЕсли Соединение.Состояние = "Disconnected" Тогда
			SIP_ОписаниеОшибки = "Отключен";
		Иначе
			мОбработкаДанных.ОткрытьФормуНастроек();	
			SIP_ОписаниеОшибки = "Хост не доступен! Код ошибки SIP - " + Соединение.Код + ".";
		КонецЕсли;
		ОтключитьВК();
	КонецЕсли;
	
	Оповестить("ОбновитьОтображениеФорм");
КонецПроцедуры // ОбновитьСостояниеПодключения()

// Обрабатыает сообщение об ошибке.
//
//  НовоеСостояние [Строка]   Текст в формате XML. Содержит информацию об
//                            ошибке.
//
Процедура ОбработатьОшибку(НовоеСостояние)
	Если Найти(НовоеСостояние, "Не удается найти аудио устройство")>0
		 ИЛИ Найти(НовоеСостояние, "Не найден микрофон")>0 Тогда
		Предупреждение("" + СокрЛП(НовоеСостояние) + ". Работа софтфона невозможна!",10,"SIP софтфон для 1С:");
		// работа без аудио устройств невозможна, потому отключим ВК
		ОтключитьВК();
	КонецЕсли; 
	СообщитьОтладочнуюИнформацию("Message", НовоеСостояние);	
КонецПроцедуры // ОбработатьОшибку()

// Проводит предварительну обработку информации о вызове. Преобразует информацию
// из формата XML в структуру и обновляет список вызовов.
//
//  НовоеСостояние [Строка]   Текст в формате XML. Содержит информацию о вызове.
//
Процедура ОбновитьСписокВызовов(НовоеСостояние)
	Вызов = Новый Структура("НомерЛинии,Статус,НомерТелефона,Абонент,Входящий,КПереадресации", "","","","","");
	РазобратьXML_Call(НовоеСостояние, Вызов);
    // номер абонента приходит в формате "sip:04@176.34.180.51"
	НомерАбонента = Сред(Вызов.НомерТелефона, 5, Найти(Вызов.НомерТелефона, "@") - 5);
	МассивЗвонков =	Звонки.НайтиСтроки(Новый Структура("CallerID, Канал",НомерАбонента, Вызов.НомерЛинии));
	
	// событие, начало вызова
	Если Вызов.Статус = "ringing" Или Вызов.Статус = "calling" Тогда
		Если МассивЗвонков.Количество() = 0 Тогда
			Оповестить("НовыйЗвонок",НомерАбонента,ЭтотОбъект);
			
			СтрочкаЗвонка =	Звонки.Добавить();
			СтрочкаЗвонка.Удержание	= Ложь;
			UID = Новый УникальныйИдентификатор;
			Если ЕстьДокументСобытие Тогда
				СсылкаСобытие = Документы.Событие.ПолучитьСсылку(UID);
				СтрочкаЗвонка.ИдентификаторЗвонка = СсылкаСобытие;
			Иначе
				СтрочкаЗвонка.ИдентификаторЗвонка = UID;
			КонецЕсли; 
		ИначеЕсли МассивЗвонков.Количество() = 1 Тогда
			СтрочкаЗвонка = МассивЗвонков[0];
		Иначе                                             
			СообщитьОтладочнуюИнформацию("Исключительная ситуация:", " Дубль строки звонка!");
			Возврат;
		КонецЕсли; 
		
		НомерИзменился = (СтрочкаЗвонка.CallerID<>НомерАбонента);
		
		СтрочкаЗвонка.CallerID			  	= НомерАбонента;
		СтрочкаЗвонка.НомерТелефона			  	= НомерАбонента;
		СтрочкаЗвонка.Канал			  		= Вызов.НомерЛинии;
		СтрочкаЗвонка.ВходящийЗвонок 	 	= (Вызов.Входящий=Истина);
		СтрочкаЗвонка.КПереадресации 		= Вызов.КПереадресации;
		Если НомерИзменился Тогда
			ОпределитьКонтрагентаКонтактногоЛицаПоНомеру(СтрочкаЗвонка);		
		КонецЕсли; 
		
		Оповестить("ОбновитьОтображениеПанелиЗвонков");
		Возврат;
	КонецЕсли;
	
	// событие, соединения двух абонентов
	Если Вызов.Статус = "current" Тогда
		Если НЕ МассивЗвонков.Количество() = 1 Тогда
			Возврат;
		Иначе		
			
			СтрочкаЗвонка = МассивЗвонков[0];
			// Это событие может прийти несколько раз для одного и того же звонка
			// к примеру, когда мы ставим вызов на удержание
			СтрочкаЗвонка.Когда = ?(НЕ ЗначениеЗаполнено(СтрочкаЗвонка.Когда),ТекущаяДата(), СтрочкаЗвонка.Когда);
			// проверим, возможно это подготовка к "слепой" переадресации
			Если СтрочкаЗвонка.КПереадресации Тогда
			  	БезКонсультативныйПеревод(СтрочкаЗвонка,СтрочкаЗвонка.НомерКПереадресации);
			КонецЕсли; 
			СтрочкаЗвонка.СейчасРазговаривают = Истина;
			// + ЗАПИСЬ
			ПодготовитьНачатьЗаписьРазговора(СтрочкаЗвонка);
			// ЗАПИСЬ - / 
			Если ОткрыватьСобытиеПриЗвонке 
				 И ОпределитьВнутреннийВнешнийЗвонок(СтрочкаЗвонка.CallerID) = ТипВнутреннийВнешнийЗвонок.Внешний Тогда
				ОткрытьСоздатьСобытие(Неопределено,СтрочкаЗвонка);
			КонецЕсли; 
		КонецЕсли; 
	ИначеЕсли Вызов.Статус = "finished" Тогда

		Если МассивЗвонков.Количество() > 0 Тогда
			СтрочкаЗвонка = МассивЗвонков[0];
			// + ЗАПИСЬ 
			ЗавершенитьЗаписьРазговора(СтрочкаЗвонка);
			// ЗАПИСЬ - / 
			Если СтрочкаЗвонка.КПереадресации Тогда
				Отбор = Новый Структура("КПереадресации,НомерКПереадресации,Удержание", Истина, СтрочкаЗвонка.CallerID, Истина);  
				ВызовыКПереадресации = Звонки.НайтиСтроки(Отбор);                   
			    Если ВызовыКПереадресации.Количество()>0 Тогда
					ВызовНаУдержании = ВызовыКПереадресации[0];
					// этот вызов снимаем с удержания
					// переадресация не завершена
					// абонент не готов принять вызов
					УдержаниеЗвонка(ВызовНаУдержании);
					ВызовНаУдержании.КПереадресации = Ложь;
					ВызовНаУдержании.НомерКПереадресации = "";
				КонецЕсли;
			КонецЕсли; 
			// ------------------------------------------------------------------------------------------------------------------------------------
			// сохраним историю звонков в настройках пользователя
			// в настройках хранится вся история
			нИстория = мОбработкаДанных.ПолучитьНастройкиИзХранилища("MIKO","ИсторияЗвонков",,ИмяПользователя()); 
			Если НЕ ТипЗнч(нИстория) = Тип("ТаблицаЗначений") Тогда
				нИстория = ИсторияЗвонков.Выгрузить();
			КонецЕсли; 
			нСтрИстория = нИстория.Вставить(0);
			нСтрИстория.ВходящийЗвонок 		  = (СтрочкаЗвонка.ВходящийЗвонок = Истина);
			нСтрИстория.ИдентификаторЗвонка   = СтрочкаЗвонка.ИдентификаторЗвонка;
			нСтрИстория.Когда                 = ?(ЗначениеЗаполнено(СтрочкаЗвонка.Когда),СтрочкаЗвонка.Когда, ТекущаяДата());
			нСтрИстория.Контрагент            = СтрочкаЗвонка.Контрагент;
			нСтрИстория.КонтактноеЛицо        = СтрочкаЗвонка.КонтактноеЛицо;
			нСтрИстория.НомерТелефона         = СтрочкаЗвонка.CallerID;
			нСтрИстория.СекундДлился          = ТекущаяДата() - нСтрИстория.Когда;
			нСтрИстория.ПропущенныйЗвонок     = (нСтрИстория.ВходящийЗвонок) 
												 И (НЕ СтрочкаЗвонка.СейчасРазговаривают ИЛИ СтрочкаЗвонка.Длительность = 0);
												 
			мОбработкаДанных.СохранитьНастройкиВХранилище("MIKO","ИсторияЗвонков", нИстория,,ИмяПользователя());
			// ------------------------------------------------------------------------------------------------------------------------------------
			
			// добавим запись в таблицу истории на форму
			// на форме отображается история только по выбранной дате
			Если ПолеКалендаряИсторииЗвонков = НачалоДня(нСтрИстория.Когда) Тогда
				СтрокаИстории = ИсторияЗвонков.Вставить(0);
				ЗаполнитьЗначенияСвойств(СтрокаИстории, нСтрИстория);
			КонецЕсли; 
			
			Звонки.Удалить(СтрочкаЗвонка);
			Оповестить("ОбновитьОтображениеПанелиЗвонков");
		КонецЕсли; 	
	КонецЕсли;
	
КонецПроцедуры // ОбновитьСписокВызовов()

// Производит разбор XML текста содержащего состояние подключения.
//
// Пример текста:
//  	<connection
//  		state='Connected'
//			code='200'
//		/>
//
//  xmlText              [Строка]      Текст в формате XML.
//  Результат_Соединение [Структура]   Возвращаемый параметр. Содержит
//                                     преобразованную из XML информацию.
//
Процедура РазобратьXML_Connection(xmlText, Результат_Соединение)
	
	ЧтениеXML = ПолучитьЧтениеXML(xmlText);
	Если НЕ ЧтениеXML = Неопределено
		 И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента 
		 И ЧтениеXML.Имя = "connection" Тогда
		Результат_Соединение = Новый Структура;
		Результат_Соединение.Вставить("Состояние",	ЧтениеXML.ЗначениеАтрибута("state"));
		Результат_Соединение.Вставить("Код",		ЧтениеXML.ЗначениеАтрибута("code"));
	КонецЕсли;
	
КонецПроцедуры // РазобратьXML_Connection()

// Производит разбор XML текста содержащего информацию о голосовой почте.
//
// Пример текста:
//  	<voicemail
//  		hasNew='2'
//  		msgWaitng='1'
//  		msgTotal='11'
//  	/>
//
//  xmlText              [Строка]      Текст в формате XML.
//  Результат_Оповещение [Структура]   Возвращаемый параметр. Содержит
//                                     преобразованную из XML информацию.
//
Процедура РазобратьXML_VoicemailMessages(xmlText, Результат_Оповещение)
	
	ЧтениеXML = ПолучитьЧтениеXML(xmlText);
	Если НЕ ЧтениеXML = Неопределено
		 И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента 
		 И ЧтениеXML.Имя = "voicemailMessages" Тогда
		 
		Результат_Оповещение = Новый Структура;
		Результат_Оповещение.Вставить("НовыхСообщений", ЧтениеXML.ЗначениеАтрибута("newMsgs"));	
	КонецЕсли;
	
КонецПроцедуры // РазобратьXML_VoicemailMessages()

// Производит разбор XML текста содержащего информацию о вызове.
//
// Пример текста:
//  	<call
//  		id='1'
//  		number='74993332211'
//  		name='Ivanov Sergey'
//  		status='ringing'
//  		incoming='1'
//  		started='20120517183055'
//  		duration='00:00'
//  	/>
//
//  xmlText         [Строка]      Текст в формате XML.
//  Результат_Вызов [Структура]   Возвращаемый параметр. Содержит
//                                преобразованную из XML информацию.
//
Процедура РазобратьXML_Call(xmlText, Результат_Вызов)
	
	ЧтениеXML = ПолучитьЧтениеXML(xmlText);
	Если НЕ ЧтениеXML = Неопределено
		 И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента 
		 И ЧтениеXML.Имя = "call" Тогда
		 
		Результат_Вызов.Вставить("НомерЛинии",		  ЧтениеXML.ЗначениеАтрибута("id"));
		Результат_Вызов.Вставить("Статус",			  ЧтениеXML.ЗначениеАтрибута("status"));
		Результат_Вызов.Вставить("НомерТелефона",	  ЧтениеXML.ЗначениеАтрибута("number"));
		Результат_Вызов.Вставить("Абонент",			  ЧтениеXML.ЗначениеАтрибута("name"));
		Результат_Вызов.Вставить("Входящий",		  ЧтениеXML.ЗначениеАтрибута("incoming") = "1");
		Результат_Вызов.Вставить("КПереадресации", Ложь);
		Если Результат_Вызов.Входящий = Ложь Тогда
			// проверим, может быть есть вызовы, ожидающие переадресации
			НомерТелефона = Результат_Вызов.НомерТелефона;
			НомерТелефона = Сред(НомерТелефона, 5, Найти(НомерТелефона, "@") - 5);
			Отбор = Новый Структура("КПереадресации,НомерКПереадресации", Истина, НомерТелефона);  
			ВызовыКПереадресации = Звонки.НайтиСтроки(Отбор);                   
		    Если ВызовыКПереадресации.Количество()>0 Тогда
				Результат_Вызов.Вставить("КПереадресации", Истина);
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры // РазобратьXML_Call()

// Производит разбор XML текста содержащего список устройств.
//
// Пример текста:
//  	<call
//  		id='1'
//  		number='74993332211'
//  		name='Ivanov Sergey'
//  		status='ringing'
//  		incoming='1'
//  		started='20120517183055'
//  		duration='00:00'
//  	/>
//
//  xmlText         [Строка]      Текст в формате XML.
//  Результат_Вызов [Структура]   Возвращаемый параметр. Содержит
//                                преобразованную из XML информацию.
//
Функция РазобратьXML_Devices(Результат_Устройства)
	Попытка
		xmlText = Компонент.ListSoundDevices();
	Исключение
	    Возврат Ложь;
	КонецПопытки; 
	
	Если xmlText = Неопределено Тогда
	 	Возврат Ложь;
	КонецЕсли; 
	
	ЕстьМикрофон = Ложь;
	ЕстьНаушники = Ложь;
	
	ЧтениеXML = ПолучитьЧтениеXML(xmlText);
	Если НЕ ЧтениеXML = Неопределено
		 И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента 
		 И ЧтениеXML.Имя = "list" Тогда
		 
		Результат_Устройства = Новый Массив;
		Пока ЧтениеXML.Прочитать() Цикл
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "item" Тогда
				Если ЧтениеXML.ЗначениеАтрибута("name") = "default" Тогда
				 	Продолжить;
				КонецЕсли; 
				
				Если ЧтениеXML.ЗначениеАтрибута("type") = "output" Тогда
					ЕстьНаушники = Истина;
					Если НЕ ЗначениеЗаполнено(АудиоВыход) Тогда
					 	АудиоВыход = ЧтениеXML.ЗначениеАтрибута("name");
					КонецЕсли; 
					Если НЕ ЗначениеЗаполнено(АудиоЗвук) Тогда
					 	АудиоЗвук = ЧтениеXML.ЗначениеАтрибута("name");
					КонецЕсли;
					
				ИначеЕсли ЧтениеXML.ЗначениеАтрибута("type") = "input" Тогда 	
					ЕстьМикрофон = Истина;
					Если НЕ ЗначениеЗаполнено(АудиоВход) Тогда
					 	АудиоВход = ЧтениеXML.ЗначениеАтрибута("name");
					КонецЕсли; 
				Иначе
					Продолжить;
				КонецЕсли; 
				Устройство = Новый Структура;
				Устройство.Вставить("Тип",		ЧтениеXML.ЗначениеАтрибута("type"));
				Устройство.Вставить("Название",	ЧтениеXML.ЗначениеАтрибута("name"));
				Результат_Устройства.Добавить(Устройство);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат (ЕстьМикрофон И ЕстьНаушники);
КонецФункции // РазобратьXML_Devices()

// Парсим переданную строку данных как XML 
// Параметры 
//		Данные - тип.Строка - Данные полученные от компоненты, в виде XML струтктуры
//
Функция ПолучитьЧтениеXML(СтрокаХМЛ)
	Попытка
		ЧтениеХМЛ = Новый ЧтениеXML;
		ЧтениеХМЛ.УстановитьСтроку(СтрокаХМЛ);
		Если ЧтениеХМЛ.Прочитать() Тогда
			Возврат ЧтениеХМЛ;
		КонецЕсли;
	Исключение
	КонецПопытки;
	СообщитьОтладочнуюИнформацию("Невозможно разобрать данные XML. ",СтрокаХМЛ);
	Возврат Неопределено;
КонецФункции // ПолучитьЧтениеXML()

/////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ И ПРОЦЕДУРЫ ОТПРАВКИ КОММАНД SIP серверу

// Инициализируем исходящий звонок
//
Функция НабратьНомер(НомерАбонента) Экспорт
	Рез = Ложь;
	
	Если Компонент = Неопределено
		ИЛИ ФормаТелефон = Неопределено
		ИЛИ НЕ ТипЗнч(НомерАбонента) = Тип("Строка")
		ИЛИ НЕ ЗначениеЗаполнено(НомерАбонента) Тогда
		
		Возврат Рез;
	КонецЕсли; 
	
	
	Если НаборНомераРазрешен
		 И ЗначениеЗаполнено(НомерАбонента) Тогда
		// временный запрет набора
		параметрНабора = НомерАбонента;
		мОбработкаДанных.ЗапретитьНаборНомера(параметрНабора);
	Иначе
		Возврат Рез;
	КонецЕсли;

	
	Если НЕ ФормаТелефон.Открыта() Тогда
		ФормаТелефон.Открыть();
	Иначе
		ФормаТелефон.Активизировать();
	КонецЕсли;
	
	Результат="";
	Попытка
		Компонент.Dial("sip:" + НомерАбонента + "@" + Хост);
		Сообщить("SIP софтфон для 1С: Был выполнен набор номера: " + НомерАбонента + " ...");
		Рез = Истина;
	Исключение
		Сообщить("SIP софтфон для 1С: Не удалось выполнить набор номера: " + НомерАбонента + " ...");
		СообщитьОтладочнуюИнформацию("SIP софтфон для 1С:", "Ошибка при инициализации звонка на номер "+НомерАбонента);
	КонецПопытки;	
	
	Возврат Рез;
КонецФункции

// Отрабатывем требование пользователя принять вызов, это может быть прием вызова на гарнитуру или включение громкой связи,
// возможно автоматическое снятие трубки в программе софтфон.
//
Процедура ОтветНаЗвонок(ТекущийЗвонок) Экспорт
	Если ТекущийЗвонок = Неопределено
		 ИЛИ Компонент = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Попытка
	    Компонент.Answer(ТекущийЗвонок.Канал);
		// для умных телефонов, тут следует описать команды для перевода звонка например на гарнитуру
		Сообщить("SIP софтфон для 1С: Отвечаем на звонок: " + ТекущийЗвонок.CallerID);	
	Исключение
		Сообщить("SIP софтфон для 1С: Не удалось ответить на звонок ...");
		СообщитьОтладочнуюИнформацию("SIP софтфон для 1С: ", "Ошибка при ответе на звонок: " + ОписаниеОшибки());
	КонецПопытки; 
КонецПроцедуры	

// Разрываем соединение для канала в выбранной строке
//
Процедура ОтбойЗвонка(ТекущийЗвонок) Экспорт
	Если ТекущийЗвонок = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Результат = "";
	
	Если Компонент = Неопределено Тогда
		СообщитьОтладочнуюИнформацию("При попытке положить трубку ","Компонент не подключен");
		Возврат;
	КонецЕсли; 
	
	Попытка
        Компонент.Hangup(ТекущийЗвонок.Канал);
		Сообщить("SIP софтфон для 1С: Отбиваем звонок: "+ТекущийЗвонок.CallerID);
	Исключение
		СообщитьОтладочнуюИнформацию("SIP софтфон для 1С: ", "Исключение отбоя " + ОписаниеОшибки());
	КонецПопытки; 
	
КонецПроцедуры

// Для текущего звонка осуществляет перевод звонка в зависимости от соотояния,
// если для выбранной строки оператор уже общается с клиентом то будет использоваться 
// консультативный перевод, иначе звонок переадресуется безконсультативно.
//
Процедура ПереводЗвонка(ТекущийЗвонок,НомерПеревода) Экспорт
	Если НЕ ЗначениеЗаполнено(ТекущийЗвонок) Тогда
		Возврат;
	КонецЕсли; 
	ТекущийЗвонок.КПереадресации 	  = Истина;
	ТекущийЗвонок.НомерКПереадресации = НомерПеревода;
	
	Если ТекущийЗвонок.СейчасРазговаривают Тогда
		УдержаниеЗвонка(ТекущийЗвонок);
		НабратьНомер(НомерПеревода);                              
	Иначе
		ОтветНаЗвонок(ТекущийЗвонок);
	КонецЕсли; 
КонецПроцедуры	

// Инициирование "Слепого" перевода звонка из текущей строки.
//
Процедура БезКонсультативныйПеревод(ТекущийЗвонок,НомерКудаПереводимЗвонокAtxfer)
	
	Если ТекущийЗвонок = Неопределено Тогда
		Возврат;
	ИначеЕсли Компонент = Неопределено Тогда
		Сообщить("SIP софтфон для 1С: Компонент не подключен");
		Возврат;
	КонецЕсли; 
	
	Попытка
		Компонент.Transfer(ТекущийЗвонок.Канал, "sip:" + НомерКудаПереводимЗвонокAtxfer + "@" + Хост);
		Сообщить("SIP софтфон для 1С: Перевод звонка на номер " + НомерКудаПереводимЗвонокAtxfer);
	Исключение
		СообщитьОтладочнуюИнформацию("Исключение при переводе звонка на номер " + НомерКудаПереводимЗвонокAtxfer,"");
	КонецПопытки; 
КонецПроцедуры	

// Перевод с консультацией оператора
// 
Процедура КонсультативныйПеревод(ID_Звонка1, ID_Звонка2) Экспорт
	Если Компонент = Неопределено Тогда
		СообщитьОтладочнуюИнформацию("При попытке положить трубку ","Компонент не подключен");
		Возврат;
	КонецЕсли; 
	Попытка	
		Компонент.AttendedTransfer(ID_Звонка1, ID_Звонка2);	
	Исключение
		// линия 1
	КонецПопытки; 
КонецПроцедуры
 
// Текущий канал из выбранной строки ставится на удержание.
//
Процедура УдержаниеЗвонка(ТекущийЗвонок) Экспорт
	
	Если ТекущийЗвонок = Неопределено Тогда
		Возврат;
	ИначеЕсли Компонент = Неопределено Тогда
		СообщитьОтладочнуюИнформацию("Удержание ","Компонент не подключен");
		Возврат;
	КонецЕсли;

	Попытка
		Если НЕ ТекущийЗвонок.Удержание Тогда
	        Компонент.Hold(ТекущийЗвонок.Канал);
			Сообщить("SIP софтфон для 1С: Ставим на удержание звонок "+ТекущийЗвонок.CallerID);
			ТекущийЗвонок.Удержание = Истина;
		Иначе	
	        Компонент.Resume(ТекущийЗвонок.Канал);
			Сообщить("SIP софтфон для 1С: Снимаем звонок с удержания "+ТекущийЗвонок.CallerID);
			ТекущийЗвонок.Удержание = Ложь;
		КонецЕсли; 
	Исключение
		СообщитьОтладочнуюИнформацию("SIP софтфон для 1С: ", "Исключение при установке вызова на удержание: " + ИнформацияОбОшибке());
	КонецПопытки; 
КонецПроцедуры	

// Отправка тонального сигнала
// 
Процедура ОтправитьDTMF(Знач ID_Звонка, Знач Номер) Экспорт
	Если Компонент = Неопределено Тогда
	 	Возврат;	
	КонецЕсли;
	
	Если ТипЗнч(ID_Звонка)<>Тип("Строка") ИЛИ ТипЗнч(Номер)<>Тип("Строка") Тогда
		Возврат;
	КонецЕсли; 
	
	Если ПустаяСтрока(ID_Звонка) ИЛИ ПустаяСтрока(Номер) Тогда
		Возврат;	
	КонецЕсли; 
	Попытка
		Компонент.Input(ID_Звонка, Номер);	
	Исключение
	КонецПопытки; 
КонецПроцедуры
 
/////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ИНИЦИАЛИЗАЦИИ КОМПОНЕНТЫ

// Подключаем компоненту связи из макета и логинимся под менеджером астериска
//
Процедура ПодключитьВК() Экспорт
	Если НЕ НеобходимыеПараметрыАвторизацииЗаполнены() Тогда
		Сообщить("SIP софтфон для 1С: Не указаны параметры авторизации на сервере телефонии. Панель не будет подключена.");
		мОбработкаДанных.ОткрытьФормуНастроек();
		Возврат;
	КонецЕсли; 
	ИнициализироватьВК();
	
	Компонент.usesG711Only 			= usesG711Only;
	Компонент.detectsVoiceActivity 	= detectsVoiceActivity;
	Компонент.AllowStopStartMusic	= AllowStopStartMusic;
	Компонент.ReregistrationTime 	= ReregistrationTime;
	Компонент.useICE 				= useICE;
	Компонент.useDNSSRV 			= useDNSSRV;
	Компонент.STUNserver 			= STUNserver + ?(ЗначениеЗаполнено(STUNserver) И ЗначениеЗаполнено(STUNPort),":"+Формат(STUNPort, "ЧДЦ=0; ЧГ="),"");
	Компонент.SIPProxy 				= SIPProxy + ?(ЗначениеЗаполнено(SIPProxy) И ЗначениеЗаполнено(SIPProxyPort),":"+Формат(SIPProxyPort, "ЧДЦ=0; ЧГ="),"");
	Компонент.OutboundProxy 		= OutboundProxy + ?(ЗначениеЗаполнено(OutboundProxy) И ЗначениеЗаполнено(OutboundProxyPort),":"+Формат(OutboundProxyPort, "ЧДЦ=0; ЧГ="),"");

	Компонент.HaspLicenseServer 	= HaspLicenseServer;
	
	Если ЗначениеЗаполнено(LicenseХост) И ЗначениеЗаполнено(LicenseПорт) И ЗначениеЗаполнено(LicenseЛогин) И ЗначениеЗаполнено(LicenseПароль) Тогда
		Попытка
			Компонент.SetMIKOLicenseMode(LicenseХост, LicenseПорт, LicenseЛогин, LicenseПароль);
		Исключение
			СообщитьОтладочнуюИнформацию("Исключение при подключении к серверу лицензирования МИКО ", ИнформацияОбОшибке());
		КонецПопытки; 
	КонецЕсли; 
	Состояние("Контроль налиция лицензий ""SIP софтфон для 1С""...");
	
	ИнициализацияПанели();
	Если НЕ КлючЗащитыДоступен() Тогда
		Сообщить("Нет свободных лицензиц на ""SIP софтфон для 1С"".", СтатусСообщения.ОченьВажное);
		РаботаВозможна = Ложь;
		Возврат;
	КонецЕсли; 
	Состояние("SIP софтфон для 1С: Попытка подключения к АТС...");
	Попытка
		Компонент.Connect(МенеджерЛогин, МенеджерПароль, Хост + ":" + Формат(ПортSIP, "ЧДЦ=0; ЧГ="));
		СообщитьОтладочнуюИнформацию("Произведена попытка соединения с АТС!","");
	Исключение
		Компонент = Неопределено;
		СообщитьОтладочнуюИнформацию("Исключение при подключении к АТС компоненты MIKO_SIP ", ИнформацияОбОшибке());
	КонецПопытки; 
	
	Состояние("SIP софтфон для 1С: Выполняется инициализация звуковых устройств...");
	ПодключитьАудиоУстройства();
	
	Если Компонент = Неопределено Тогда 
		Оповестить("ОбновитьОтображениеФорм");
		Возврат;
	КонецЕсли;
	// подменим компонент типовой конфигурации
	РарусСофтФонЛайтКомпонента = "МИКО софтфон вместо Рарус софтфон лайт"; 
КонецПроцедуры	

// Создание объекта ВК
// 
Процедура ИнициализироватьВК()

	Попытка                                                                   
		СсылкаНаАрхив = ПоместитьВоВременноеХранилище(ЭтотОбъект.ПолучитьМакет("SIP_AddInWindows32_64"), Новый УникальныйИдентификатор);
		Если ПодключитьВнешнююКомпоненту(СсылкаНаАрхив, "Компонента", ТипВнешнейКомпоненты.Native) Тогда
			Компонент = Новый("AddIn.Компонента.MIKO_SIP");
		Иначе
			СообщитьОтладочнуюИнформацию("Не удалось подключить внешнюю компоненту MIKO_SIP ","");
		КонецЕсли;
	Исключение
		Компонент = Неопределено;
		СообщитьОтладочнуюИнформацию("Исключение при инициализации компоненты MIKO_SIP ", ИнформацияОбОшибке());
	КонецПопытки;

КонецПроцедуры
 
// Отключаем компоненту связи
//
Процедура ОтключитьВК() Экспорт
	Если Компонент = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	// очищаем таблицы
	Звонки.Очистить();
	Сотрудники.Очистить();
	SIP_ТаблицаКлючей = Неопределено;	
	Попытка
		Состояние("SIP софтфон для 1С: Отключение от АТС.");
		Компонент.Disconnect();
		Компонент.Close();
		Состояние("SIP софтфон для 1С: Отключение от АТС произведено успешно!");
	Исключение
		СообщитьОтладочнуюИнформацию("Исключение при завершении сеанса работы с сервером телефонии!", ИнформацияОбОшибке());
	КонецПопытки; 
	ПодключенКСерверуТелефонии = Ложь;
	Компонент = Неопределено;
	Оповестить("ОбновитьОтображениеФорм");
КонецПроцедуры

Процедура Переподключить() Экспорт
	ОтключитьВК();
	ПодключитьСофтФон();
КонецПроцедуры
 
/////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПРОЧИЕ

// Функция преобразует параметры в строковый вид в виде 
// [Параметр1]          [Параметр2]         [Параметр3][Параметр4][Параметр5]    [Параметр6]
// [ИдентификаторЗвонка][Входящий/Исходящий][КодСтраны][КодГорода][НомерТелефона][Внутренний]
Функция ПреобразоватьПараметрыВСтроку(ТекущаяСтрока) Экспорт
	
	Результат="";
	
	Номер = "";
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.КодСтраны) И НЕ ЗначениеЗаполнено(ТекущаяСтрока.КодГорода) Тогда
		Номер = СокрЛП(ТекущаяСтрока.Внутренний);
	Иначе
		Номер = ?(НЕ ЗначениеЗаполнено(ТекущаяСтрока.НомерТелефона), СокрЛП(ТекущаяСтрока.КодГорода), СокрЛП(ТекущаяСтрока.НомерТелефона));
	КонецЕсли;
	
	ТипЗвонка = СокрЛП(ОпределитьВнутреннийВнешнийЗвонок(Номер));
	Результат = Результат + "["+ТипЗвонка+"]";
	
	Если Число(ТипЗвонка) = ТипВнутреннийВнешнийЗвонок.Внутренний Тогда
		ТмпКодСтраны 	= "";
		ТмпКодГорода 	= "";
		ТмпНомер 		= "";
		ТмпВнутренний 	= Номер;
	Иначе
		ТмпКодСтраны 	= ТекущаяСтрока.КодСтраны;
		ТмпКодГорода 	= ТекущаяСтрока.КодГорода;
		ТмпНомер 		= Номер;
		ТмпВнутренний 	= "";
	КонецЕсли;
	
	Результат = Результат + "["+ТмпКодСтраны+"]"+
	"["+ТмпКодГорода+"]"+
	"["+ТмпНомер+"]"+
	"["+ТмпВнутренний+"]";
	
	Возврат Результат;
КонецФункции

// Заполняет таблицу сотрудников компании с внутренними номерами и полом, для правильного отображения картинки
//
Процедура ЗаполнитьТаблицуСотрудников() Экспорт
	
	// подготавливаем таблицу контактной информации пользователей
	Запрос = мОбщийМодуль.ПолучитьЗапросЗаполнитьТаблицуСотрудников();
	КИ = Запрос.Выполнить().Выгрузить();
	Для каждого СтрокаКИ Из КИ Цикл
		СтрокаКИ.ВнутреннийНомер = мОбработкаДанных.УбратьИзНомераТелефонаВсеБуквы(СтрокаКИ.ВнутреннийНомер);	
	КонецЦикла; 

	Запрос = мОбработкаДанных.ПолучитьЗапросЗаполнитьТаблицуСотрудников();
	Запрос.УстановитьПараметр("Контакты", КИ);
	Запрос.УстановитьПараметр("СвойствоПол",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Пол"));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Сотрудники.Очистить();
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Выборка.ВнутреннийНомер) Тогда 
			Продолжить;	 //зачем нам сотрудник без номера?
		КонецЕсли; 
		
		СотрудникиСтрока = Сотрудники.Найти(Выборка.Пользователь,"Сотрудник");
		Если СотрудникиСтрока = Неопределено Тогда
			СотрудникиСтрока=Сотрудники.Добавить();	
		КонецЕсли; 
		
		СотрудникиСтрока.Сотрудник			= Выборка.Пользователь;
		СотрудникиСтрока.ВнутреннийНомер	= мОбработкаДанных.УбратьИзНомераТелефонаВсеБуквы(Выборка.ВнутреннийНомер);
		
		// Вдруг у нас комплекная или УПП. Там есть реквизит физлицо.
		Если ЗначениеЗаполнено(Выборка.ФизЛицо) 
			И Выборка.ФизЛицо.Метаданные().Реквизиты.Найти("Пол")<> Неопределено Тогда
			Пол = Выборка.ФизЛицо["Пол"] 
		Иначе
			Пол	= Выборка.Пол;
		КонецЕсли;
		
		Если Найти(Пол,"Муж")>0 Тогда
			СотрудникиСтрока.Пол	=	0;
		ИначеЕсли Найти(Пол,"Жен")>0 Тогда
			СотрудникиСтрока.Пол	=	3;
		Иначе
			СотрудникиСтрока.Пол	=	6; //неизвестный пол
		КонецЕсли;
		
		СотрудникиСтрока.Состояние	=	СостояниеЭкстеншена.Свободен;
	КонецЦикла;
	
	Если Сотрудники.Количество()=0 Тогда
		//Сообщить("SIP софтфон для 1С: В справочнике пользователей не прописаны внтуренние номера или не выделены как основные, таблица сотрудников не будет заполнена!",СтатусСообщения.Важное);
	КонецЕсли;		
КонецПроцедуры // ЗаполнитьТаблицуСотрудников()

// Заполнить таблицу истории звонков 
//
// Параметры
//  ДатаЗаполнения  -Дата - Дата за которую выбираем историю звонков с астериск сервера
//
Процедура ЗаполнитьТаблицуИсторииЗвонков(ВыбраннаяДата) Экспорт
	История = мОбработкаДанных.ПолучитьНастройкиИзХранилища("MIKO","ИсторияЗвонков",,ИмяПользователя()); 
	Если ЕстьДокументСобытие И ТипЗнч(История) = Тип("ТаблицаЗначений") 
		 И НЕ История.Колонки.ИдентификаторЗвонка.ТипЗначения.СодержитТип(Тип("ДокументСсылка.Событие")) Тогда
		// сконвертируем тиблицу истории 
		ИсторияЗвонков.Загрузить(История);
		История = ИсторияЗвонков.Выгрузить();
		ИсторияЗвонков.Очистить();
		мОбработкаДанных.СохранитьНастройкиВХранилище("MIKO","ИсторияЗвонков", История,,ИмяПользователя());
	КонецЕсли;                                                        
	Если ТипЗнч(История) = Тип("ТаблицаЗначений")
		 И История.Количество() > 0 Тогда				
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	История.ИдентификаторЗвонка,
			|	История.Когда,
			|	История.Контрагент,
			|	История.КонтактноеЛицо,
			|	История.НомерТелефона,
			|	История.СекундДлился,
			|	История.ВходящийЗвонок,
			|	История.ПропущенныйЗвонок,
			|	История.ДокументСобытие
			|ПОМЕСТИТЬ ВТ
			|ИЗ
			|	&История КАК История
			|;
			|";
		Если  ВСобытииЕстьUID Тогда
			Запрос.Текст = Запрос.Текст + "
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТ.ИдентификаторЗвонка,
			|	ВТ.Когда,
			|	ВТ.Контрагент,
			|	ВТ.КонтактноеЛицо,
			|	ВТ.НомерТелефона,
			|	ВТ.СекундДлился,
			|	ВТ.ВходящийЗвонок,
			|	ВТ.ПропущенныйЗвонок И ВТ.ВходящийЗвонок КАК ПропущенныйЗвонок,
			|	Событие.Ссылка КАК ДокументСобытие
			|ИЗ
			|	ВТ КАК ВТ
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Событие КАК Событие
			|		ПО (ВТ.ИдентификаторЗвонка = Событие.CRM_GUIDЗвонка ИЛИ ВТ.ИдентификаторЗвонка = Событие.Ссылка)
			|ГДЕ
			|	ВТ.Когда МЕЖДУ &НачалоПериода И &КонецПериода";
		ИначеЕсли ЕстьДокументСобытие Тогда
			Запрос.Текст = Запрос.Текст + "
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТ.ИдентификаторЗвонка,
			|	ВТ.Когда,
			|	ВТ.Контрагент,
			|	ВТ.КонтактноеЛицо,
			|	ВТ.НомерТелефона,
			|	ВТ.СекундДлился,
			|	ВТ.ВходящийЗвонок,
			|	ВТ.ПропущенныйЗвонок И ВТ.ВходящийЗвонок КАК ПропущенныйЗвонок,
			|	Событие.Ссылка КАК ДокументСобытие
			|ИЗ
			|	ВТ КАК ВТ
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Событие КАК Событие
			|		ПО ВТ.ИдентификаторЗвонка = Событие.Ссылка
			|ГДЕ
			|	ВТ.Когда МЕЖДУ &НачалоПериода И &КонецПериода";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТ.ИдентификаторЗвонка,
			|	ВТ.Когда,
			|	ВТ.Контрагент,
			|	ВТ.КонтактноеЛицо,
			|	ВТ.НомерТелефона,
			|	ВТ.СекундДлился,
			|	ВТ.ВходящийЗвонок,
			|	ВТ.ПропущенныйЗвонок И ВТ.ВходящийЗвонок КАК ПропущенныйЗвонок,
			|	"""" КАК ДокументСобытие
			|ИЗ
			|	ВТ КАК ВТ
			|ГДЕ
			|	ВТ.Когда МЕЖДУ &НачалоПериода И &КонецПериода";
		КонецЕсли; 		

		Запрос.УстановитьПараметр("История", История);
		Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ВыбраннаяДата));
		Запрос.УстановитьПараметр("КонецПериода",  КонецДня(ВыбраннаяДата));
		ТЗ_История = Запрос.Выполнить().Выгрузить();
		
		НазначенияВызововdst=ТЗ_История.ВыгрузитьКолонку("НомерТелефона");
		ВремМассивНомеровЧислом = Новый Массив;
		Для каждого Вызов Из ТЗ_История Цикл
			Номер1 = мОбработкаДанных.ПреобразоватьНомерДляСохранения(Вызов.НомерТелефона, ГлобальныеПеременные.глКоличествоХранимыхЦифрТелефона);
			Если Номер1<>0 Тогда
				ВремМассивНомеровЧислом.Добавить(Номер1);
			КонецЕсли; 
		КонецЦикла; 
		Запрос = мОбщийМодуль.ПолучитьЗапросЗаполнитьТаблицуИстории();
		Запрос.УстановитьПараметр("ТипКИ", Перечисления.ТипыКонтактнойИнформации.Телефон);
		Запрос.УстановитьПараметр("НазначенияВызововdst", НазначенияВызововdst);
		Запрос.УстановитьПараметр("ВремМассивНомеровЧислом", ВремМассивНомеровЧислом);
		
		Результат 	    = Запрос.Выполнить();
		СписокКонтактов = Результат.Выгрузить();
		
		Для каждого НоваяСтрока Из ТЗ_История Цикл
			СтрокаСКонтактом = СписокКонтактов.Найти(НоваяСтрока.НомерТелефона,"НомерТелефона");
			Если СтрокаСКонтактом=Неопределено Тогда
				НомерЧислом = мОбработкаДанных.ПреобразоватьНомерДляСохранения(НоваяСтрока.НомерТелефона, ГлобальныеПеременные.глКоличествоХранимыхЦифрТелефона);
				СтрокаСКонтактом = СписокКонтактов.Найти(НомерЧислом,"CRM_ЧисловоеПолеТелефона");
			КонецЕсли; 
			
			Если СтрокаСКонтактом<>Неопределено Тогда
				ДанныеЗаполнения = мОбщийМодуль.ПолучитьДанныеЗаполненияСтрокиИстории(СтрокаСКонтактом);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеЗаполнения);
		    КонецЕсли;
		КонецЦикла; 

		ИсторияЗвонков.Загрузить(ТЗ_История);
		ИсторияЗвонков.Сортировать("Когда Убыв");
	КонецЕсли; 

КонецПроцедуры
 
// По переданной строке подбирает список из 20 похожих абонентов 
//
Функция НайтиСписокПодходящихОбъектовВызова(НомерАбонента) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 20
	|	КонтактнаяИнформация.Объект
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект.Наименование ПОДОБНО &Наименование";
	
	Запрос.УстановитьПараметр("Наименование","%"+НомерАбонента+"%");
	
	Результат = Запрос.Выполнить();
	ТЗ   = Результат.Выгрузить();
	
	СписокОбъектов = Новый СписокЗначений;
	СписокОбъектов.ЗагрузитьЗначения(ТЗ.ВыгрузитьКолонку("Объект"));
	
	Возврат СписокОбъектов;
	
КонецФункции

// Сообщить отладочную информацию если включен режим отладки
//
// Параметры
//  Заголовок  - Строка - Заголовок информации для идентификации сообщения
//	Сообщение - Строка - Выводимое сообщение
//  ОписаниеОшибки  - Строка - Результат работы функции ИнформацияОбОшибке()
//
Процедура СообщитьОтладочнуюИнформацию(Заголовок,Сообщение,ОписаниеОшибки="")Экспорт
	Если Отладка Тогда		
		Сообщить(Заголовок+" "+Сообщение+?(ЗначениеЗаполнено(ОписаниеОшибки)," ошибка: "+ОписаниеОшибки,""));		
	КонецЕсли; 	
	
КонецПроцедуры // СообщитьОтладочнуюИнформацию()

// Если передан идентификатор звонка, то производится попытка поиска документа Событие с сохраненным идентификатором.
// Если событие не найдено, то по переданной структуре звонка (соответсвует табличной части история звонков) создается документ Событие.
// В любом случае, созданный или найденный документ открывается для заполнения пользователем.
//
// Параметры: 
//			 ИдентификаторЗвонка	-	Тип Строка 	- Строка с уникальным идентификатором звонка присваеваемым сервером телефонии при каждом новом 
// входящем или исходящем звонке
//           СтруктураЗвонка	-	Тип Структура 	- Соответствует одной строке из табличной части ИсторияЗвонков
//
// 
// Возвращаемое значение - НЕТ
//
Процедура ОткрытьСоздатьСобытие(Знач ИдентификаторЗвонка = Неопределено,Знач СтруктураЗвонка=Неопределено) Экспорт
	
	СсылкаНаДок = Неопределено;
	Если ЕстьДокументСобытие И НЕ ИдентификаторЗвонка = Неопределено Тогда
		СсылкаНаДок = ИдентификаторЗвонка;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Событие.Ссылка
			|ИЗ
			|	Документ.Событие КАК Событие
			|ГДЕ
			|	Событие.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаДок);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
		    СсылкаНаДок = Неопределено
		КонецЕсли; 
	КонецЕсли; 
	
	Если НЕ СсылкаНаДок = Неопределено Тогда
		ФормаДок=СсылкаНаДок.ПолучитьФорму();	  	  
		ФормаДок.Открыть();
	ИначеЕсли СтруктураЗвонка<>Неопределено тогда
		Попытка
			ДанныеЗаполнения  = мОбщийМодуль.ПолучитьДанныеЗаполненияСобытия(СтруктураЗвонка, ГлобальныеПеременные, СтруктураЗвонка.НомерТелефона);
			ФормаСобытия = мОбщийМодуль.ПолучитьФормуСобытия(ФормаТелефон, СтруктураЗвонка.НомерТелефона);
			Если ЕстьДокументСобытие И ТипЗнч(ИдентификаторЗвонка) = Тип("ДокументСсылка.Событие") Тогда
				ФормаСобытия.ЭтотОбъект.УстановитьСсылкуНового(ИдентификаторЗвонка);
			КонецЕсли; 
			ФормаСобытия.Открыть();

			ЗаполнитьЗначенияСвойств(ФормаСобытия, ДанныеЗаполнения);
			ФормаСобытия.КлючУникальности = СтруктураЗвонка.НомерТелефона;
			мОбщийМодуль.ОбновитьОтображениеФормыСобытия(ФормаСобытия);
		Исключение
			СообщитьОтладочнуюИнформацию("Исключение","Не удалось создать документ Событие: "+ИнформацияОбОшибке());
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры //ОткрытьСоздатьСобытие()

// По переданному вноутреннему номеру определяем пользователя и возвращаем, иначе Неопределено.
//
Функция ВернутьПользователяПоНомеруТелефона(НомерТелефона)
	
	Запрос = 	мОбщийМодуль.ПолучитьЗапросПользователяПоНомеруТелефона();
	Запрос.УстановитьПараметр("CRM_НомерТелефона",НомерТелефона );
	Запрос.УстановитьПараметр("ТипКИ", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда	
		Возврат Выборка.Пользователь;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // ВернутьПользователяПоНомеруТелефона()

// Производит заполнение всех номеров пользователей, табличной части сотрудников
// 
Процедура ИнициализацияПанели() Экспорт
	Попытка
		Компонент.Init();
	Исключение
		СообщитьОтладочнуюИнформацию("Исключение при инициализации основных параметров компоненты MIKO_SIP ", ИнформацияОбОшибке());
		Возврат;
	КонецПопытки; 
	Подключен = Ложь;
	НаборНомераВозможен = Истина;

	ПолучитьСпиокАудиоУстройств();
	ЗаполнитьТаблицуСотрудников();
КонецПроцедуры

// Подключает в компоненте аудиоустройства
//
Процедура ПодключитьАудиоУстройства() Экспорт 
	
	Если Компонент = Неопределено Тогда
		Возврат;	
	КонецЕсли;

	Попытка
		Компонент.SetSoundDevices(АудиоВыход, АудиоВход, АудиоЗвук);
	Исключение
		СообщитьОтладочнуюИнформацию("SIP софтфон для 1С:", "Не удалось установить аудио устройства! " + ОписаниеОшибки());
	КонецПопытки; 
	
КонецПроцедуры // ВыбратьАудиоУстройства

// Работа со списками аудио устройств
//
Функция ПолучитьСпиокАудиоУстройств() Экспорт
	Если Компонент = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	СписокУстройств = Неопределено;
	Если НЕ РазобратьXML_Devices(СписокУстройств) Тогда
		СообщитьОтладочнуюИнформацию("SIP софтфон для 1С:", "Не удалось получить список аудиоустройст!");	
	КонецЕсли; 
	Возврат СписокУстройств;
КонецФункции

// Для BLF клавиш / состояния
// 
Процедура ПодписатьсяНаОтслеживаниеСостояний()
	Если Компонент = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	НомераДляSubsribe = "";
	// 1. Перебор номеров из списка пользователей 
	Для каждого ТекущийСотрудник Из Сотрудники Цикл
		Если Не ЗначениеЗаполнено(ТекущийСотрудник.ВнутреннийНомер) Тогда
			Продолжить;
		КонецЕсли;		
		НомераДляSubsribe = НомераДляSubsribe + "" + ?(НомераДляSubsribe = "", "", ",") + ТекущийСотрудник.ВнутреннийНомер;
	КонецЦикла;  
	// 2. Перебор номеров для BLF
	Для каждого ТекущийНомер Из ПанельBLF Цикл
		Если Не ЗначениеЗаполнено(ТекущийНомер.Номер) Тогда
			Продолжить;
		КонецЕсли;		
		НомераДляSubsribe = НомераДляSubsribe + "" + ?(НомераДляSubsribe = "", "", ",") + ТекущийНомер.Номер;
	КонецЦикла;  
	
	Попытка
		Компонент.PresenceSubsribe(НомераДляSubsribe);
	Исключение
		СообщитьОтладочнуюИнформацию("SIP софтфон для 1С", "Нет возможности отследить состояния телефонов пользователей.");
	КонецПопытки; 
КонецПроцедуры

// Производит формирование имен путей к файлам записей / создает необходимые каталоги
// 
Процедура ПодготовитьНачатьЗаписьРазговора(Звонок)
	Если НЕ ЗначениеЗаполнено(КаталогДляХраненияЗаписей) Тогда
		Возврат;	
	КонецЕсли; 
	Звонок.ИмяВременногоФайла = ПолучитьИмяВременногоФайла("wav");
	КаталогДляЗаписи = КаталогДляХраненияЗаписей + Формат(Звонок.Когда, "ДФ=\yyyy\MM\dd\");
	СоздатьКаталог(КаталогДляЗаписи);
	
	Звонок.ИмяФайлаЗаписи = "" + КаталогДляЗаписи + Формат(Звонок.Когда, "ДФ=yyyyMMyy_HHmmss") + ?(Звонок.ВходящийЗвонок,"_in_","_out_")+МенеджерЛогин + "_" + Звонок.CallerID + ".wav";
    НачатьЗаписьРазговора(Звонок.Канал, Звонок.ИмяВременногоФайла);
КонецПроцедуры
// Начинает запись разговора                                      
//
Процедура НачатьЗаписьРазговора(Канал, ПутьКФайлу)                
	Если Компонент = Неопределено Тогда
		Возврат;
	КонецЕсли; 
    
	Если ТипЗнч(Канал)<>Тип("Строка") ИЛИ ТипЗнч(ПутьКФайлу)<>Тип("Строка") Тогда
		Возврат;
	КонецЕсли; 
	
	Если ПустаяСтрока(Канал) ИЛИ ПустаяСтрока(ПутьКФайлу) Тогда
		Возврат;	
	КонецЕсли; 
	Попытка
	  	Компонент.StartRecordingCalltoWav(Канал, ПутьКФайлу);
	Исключение
	КонецПопытки; 	
КонецПроцедуры

// Производит перемещение файла с записью разговора / удаляет временные файлы
// 
Процедура ЗавершенитьЗаписьРазговора(Звонок)
  	Если НЕ ЗначениеЗаполнено(Звонок.ИмяВременногоФайла) ИЛИ НЕ ЗначениеЗаполнено(Звонок.ИмяФайлаЗаписи) Тогда
		Возврат;	
	КонецЕсли;  	
	
	Попытка
	    КопироватьФайл(Звонок.ИмяВременногоФайла, Звонок.ИмяФайлаЗаписи);
		УдалитьФайлы(Звонок.ИмяВременногоФайла);
	Исключение
	КонецПопытки; 
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ВСПОМОГАТЕЛЬНЫЕ

// Функция разбирает переданный номер телефона или структуру содержащую поля номера телефона в зависимости
//  от того какой это звонок входящий или исходящих. Если входящий звонок, то передается строка с номером телефона
//  а возвращаем структуру содержащую поля номера телефона. Так же проверяем если звонок внутренний, то сохраняем номер
//  как внутренний, иначе передаем его как есть, пользователь разберет номер в ручную.
//  Если звонок исходящий то получаем структуру в качестве номера, 
//а возвращаем преобразованную строку которую будет набирать станция.
Функция ПреобразоватьНомерСУчетомПрефиксов(Знач НомерТелефона, Знач ВходящийЗвонок) Экспорт 
	
	// Подготавливаем структуру номера телефона который будем возвращать при входящем звонке
	// при исходящем будем возвращать строку с номером телефона
	РезультатНомер = мОбработкаДанных.СформироватьСтруктуруНомераИзПолей();
	
	// Обрабатываем входящий звонок
	Если ВходящийЗвонок И ТипЗнч(НомерТелефона) = Тип("Строка") Тогда
		
		НомерТелефона = мОбработкаДанных.УбратьИзНомераТелефонаВсеПрефиксы(НомерТелефона);
		// Если состояние звонка является внутренним номером, то никаких префиксов подставлять не нужно 
		//  просто сразу возвращаем номер телефона, структуру смотрим в ВидыВходящихИсходящихСобытий
		Если ОпределитьВнутреннийВнешнийЗвонок(НомерТелефона) = ТипВнутреннийВнешнийЗвонок.Внутренний Тогда
			РезультатНомер.Внутренний = НомерТелефона;
		Иначе
			// Если длина телефона не равна 7 цифрам, то номер разложим следующим
			// образом, 7 последних это телефон, остальное код.
			Если СтрДлина(НомерТелефона) <= 7 Тогда
				РезультатНомер.НомерТелефона = НомерТелефона;
			Иначе
				РезультатНомер.КодСтраны     = ГлобальныеПеременные.глКодСтраны;
				РезультатНомер.НомерТелефона = Прав(НомерТелефона, 7);
				РезультатНомер.КодГорода	 = Лев(НомерТелефона, СтрДлина(НомерТелефона) - 7);
				Если Лев(РезультатНомер.КодГорода,1)="7" тогда
					РезультатНомер.КодГорода	 = Прав(РезультатНомер.КодГорода, СтрДлина(РезультатНомер.КодГорода) - 1); 
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
		
		// Сформируем представление
		мОбработкаДанных.СформироватьПредставлениеТелефонаПоСтруктуре(РезультатНомер);
		
		// Обрабатываем исходящий звонок
	ИначеЕсли НЕ ВходящийЗвонок И ТипЗнч(НомерТелефона) = Тип("Структура") Тогда 
		// "чистый" номер телефона без префпксов и доп кодов
		врНомерТелефона = мОбработкаДанных.УбратьИзНомераТелефонаВсеПрефиксы(НомерТелефона.НомерТелефона);
		// Необходимо позвонить по внутреннему номер, префиксы не нужны
		Если (ЗначениеЗаполнено(НомерТелефона.Внутренний) И НЕ ЗначениеЗаполнено(врНомерТелефона))
			Или (ЗначениеЗаполнено(врНомерТелефона) И НЕ ЗначениеЗаполнено(НомерТелефона.Внутренний) 
			И СтрДлина(врНомерТелефона) <= ГлобальныеПеременные.глМаксимальнаяДлинаВнутреннегоНомера) Тогда
			
			РезультатНомер = ?(НЕ ЗначениеЗаполнено(НомерТелефона.Внутренний), врНомерТелефона, НомерТелефона.Внутренний);
		Иначе
			Если ЗначениеЗаполнено(врНомерТелефона) Тогда
				КодСтраныНомера = ?(СокрЛП(НомерТелефона.КодСтраны) = "8", "7", СтрЗаменить(НомерТелефона.КодСтраны, "+", ""));
				КодГородаНомера = НомерТелефона.КодГорода;
				КодСтраныБезПлюса = СтрЗаменить(ГлобальныеПеременные.глКодСтраны, "+", "");
				
				// если не внутренний то необходимо использовать префиксы, либо выхода в город либо выхода на межгород
				// 1. Если это наш город и страна, то просто префикс выхода в город
				Если (КодСтраныНомера = КодСтраныБезПлюса ИЛИ ПустаяСтрока(КодСтраныНомера)) // наша страна 
					И (КодГородаНомера = ГлобальныеПеременные.глКодГорода ИЛИ ПустаяСтрока(КодГородаНомера)) // нащ город 
					Тогда
					РезультатНомер = ГлобальныеПеременные.глПрефиксВыходаВГород + КодСтраныНомера + КодГородаНомера + врНомерТелефона;
					// 2. Если это не наш город, но наша страна, то выход на межгород
				ИначеЕсли (НЕ КодГородаНомера = ГлобальныеПеременные.глКодГорода И НЕ ПустаяСтрока(КодГородаНомера)) // Чужой город
					И (КодСтраныНомера = КодСтраныБезПлюса ИЛИ ПустаяСтрока(КодСтраныНомера))                  // наша страна
					Тогда
					РезультатНомер = ГлобальныеПеременные.глПрефиксВыходаНаМежгород + КодСтраныНомера + КодГородаНомера + врНомерТелефона;
					// 3. Если это не наша страна, то международный звонок.
				Иначе
					РезультатНомер = ГлобальныеПеременные.глПрефиксВыходаНаМежгород + КодСтраныНомера + КодГородаНомера + врНомерТелефона;
				КонецЕсли;
			Иначе
				РезультатНомер = "";		
			КонецЕсли;
		КонецЕсли;
		
		РезультатНомер = мОбработкаДанных.УбратьИзНомераТелефонаВсеПрефиксы(РезультатНомер);
	КонецЕсли;
	Возврат РезультатНомер;
КонецФункции

// Функция определяет и возвращает какой это звонок внутренний или внешний.
//
Функция ОпределитьВнутреннийВнешнийЗвонок(НомерТелефона) 
	Если мОбработкаДанных.ОпределитьВнутреннийЗвонокПоНомеру(НомерТелефона, ГлобальныеПеременные.глМаксимальнаяДлинаВнутреннегоНомера) Тогда
		Возврат ТипВнутреннийВнешнийЗвонок.Внутренний; // 1
	Иначе
		Возврат ТипВнутреннийВнешнийЗвонок.Внешний;    // 0
	КонецЕсли; 
КонецФункции

// Инициируем таблицу кодов городов для расбора номера
// 
Функция ЗагрузитьКодыГородов()
	// Загрузим список городов
	КодыГородовВСтр = ПолучитьМакет("КодыГородовТаблица").ПолучитьТекст();
	ТЗ_КодыГородов = ЗначениеИзСтрокиВнутр(КодыГородовВСтр);
	АдресТЗКодыГородов = ПоместитьВоВременноеХранилище(ТЗ_КодыГородов);
	
	Возврат ТЗ_КодыГородов;
КонецФункции	

// Для переданного звонка определяем контрагента и контактное лицо по номеру, и заполняем
//соответсвующие строки в таблице звонков
Процедура ОпределитьКонтрагентаКонтактногоЛицаПоНомеру(ТекущийЗвонок = Неопределено) 
	Если ТекущийЗвонок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Карты / начало
	Если НЕ ОпределитьВнутреннийВнешнийЗвонок(ТекущийЗвонок.CallerID) = 1 Тогда
		СтруктураОтвета 	= ПолучитьДанныеОбАбоненте(ТекущийЗвонок.CallerID);
		ЗаполнитьЗначенияСвойств(ТекущийЗвонок, СтруктураОтвета);
	КонецЕсли;
	Оповестить("ОбновитьКарты");
	// Карты / конец
	
	Запрос = мОбщийМодуль.ПолучитьЗапросОпределитьКонтрагентаКонтактногоЛицаПоНомеру(ТекущийЗвонок.Контрагент);
	Если Найти(ТекущийЗвонок.Контрагент, "Skype:") Тогда
		ТелДляПоиска= СтрЗаменить(СокрЛП(ТекущийЗвонок.CallerID),"Skype:","");
	Иначе	
		ТелДляПоиска = мОбработкаДанных.ПреобразоватьНомерДляСохранения(ТекущийЗвонок.CallerID, ГлобальныеПеременные.глКоличествоХранимыхЦифрТелефона);
		Если ТелДляПоиска = 0 Тогда Возврат; КонецЕсли; 
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТипКИ", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("ТелефонДляПоиска", ТелДляПоиска);
	Результат 	= Запрос.Выполнить();
	Выборка 	= Результат.Выбрать();
	
	ТекущийЗвонок.Контрагент		=	"Неизвестный контрагент";
	ТекущийЗвонок.КонтактноеЛицо	=	"<-------------------->";
	
	Если  Выборка.Следующий() Тогда 
		ДанныеЗаполнения = мОбщийМодуль.ПолучитьДанныеЗаполненияОпределитьКонтрагентаКонтактногоЛицаПоНомеру(Выборка);
		ЗаполнитьЗначенияСвойств(ТекущийЗвонок, ДанныеЗаполнения);
	Иначе
		// Для внутренних номеров поищим в таблице сотрудников
		Для каждого ТекущийСотрудник Из Сотрудники Цикл
			Если ТекущийСотрудник.ВнутреннийНомер = ТекущийЗвонок.CallerID
				ИЛИ Найти(ТекущийСотрудник.КаналСотрудника, СокрЛП(ТекущийЗвонок.CallerID))>0 Тогда
				ТекущийЗвонок.Контрагент		=	ТекущийСотрудник.Сотрудник;
				ТекущийЗвонок.КонтактноеЛицо	=	"-< сотрудник >-";
				Прервать;
			КонецЕсли; 			
		КонецЦикла; 
	КонецЕсли; 
	
Конецпроцедуры	

// Определяет информацию об абоненте по номеру телфона.
//
//  НомерТелефона   [Строка]           Номер телефона абонента в формате URI.
//  ТелефоннаяКнига [ТабличнаяЧасть]   Таблица номеров телефонной книги.
//  КодСтраны       [Строка]           Телефонный код страны.
//  КодГорода       [Строка]           Телефонный код города.
//
//  Возвращаемое значение [Структура]   Содержит информацию об абоненте.
//
//&НаКлиенте
Функция ПолучитьДанныеОбАбоненте(Знач НомерТелефона) Экспорт
	// поиск среди городских номеров
	ПервыйСимвол = Лев(НомерТелефона, 1);
	Если ПервыйСимвол="8" Тогда
	  	НомерТелефона = "7" + Прав(НомерТелефона, СтрДлина(НомерТелефона)-1); 	
	КонецЕсли; 
	
	НомерТелефона = мОбработкаДанных.УбратьИзНомераТелефонаВсеПрефиксы(НомерТелефона);
	
	Результат = Новый Структура("Город,Область,Страна,НомерТелефона,КодСтраны,КодГорода,Номер");
	Результат.Вставить("НомерТелефона", НомерТелефона);
	// поиск среди мобильных 	
	Запрос = Новый Запрос();
	// Найдем информацию о номере по базе кодов городов
	Запрос.Текст = "ВЫБРАТЬ
                  |	ТабКодыГородов.ШаблонПоиска КАК ШаблонПоиска,
                  |	ТабКодыГородов.КодСтраны,
                  |	ТабКодыГородов.КодГорода,
                  |	ТабКодыГородов.Город,
                  |	ТабКодыГородов.Область,
                  |	ТабКодыГородов.Страна
                  |ПОМЕСТИТЬ втКодыГородов
                  |ИЗ
                  |	&ТабКодыГородов КАК ТабКодыГородов
                  |
                  |ИНДЕКСИРОВАТЬ ПО
                  |	ШаблонПоиска
                  |;
                  |
                  |////////////////////////////////////////////////////////////////////////////////
                  |ВЫБРАТЬ ПЕРВЫЕ 1
                  |	КодыГородов.ШаблонПоиска,
                  |	КодыГородов.Город,
                  |	КодыГородов.Область,
                  |	КодыГородов.Страна,
                  |	КодыГородов.КодГорода,
                  |	КодыГородов.КодСтраны
                  |ИЗ
                  |	втКодыГородов КАК КодыГородов
                  |ГДЕ
                  |	&НомерДляПоискаГорода ПОДОБНО КодыГородов.ШаблонПоиска
                  |
                  |УПОРЯДОЧИТЬ ПО
                  |	КодыГородов.ШаблонПоиска УБЫВ";
	ТЗ_КодыГородов = ПолучитьИзВременногоХранилища(АдресТЗКодыГородов);
	Если ТЗ_КодыГородов = Неопределено Тогда
	 	ТЗ_КодыГородов = ЗагрузитьКодыГородов();   
	КонецЕсли; 
	Запрос.УстановитьПараметр("ТабКодыГородов", ТЗ_КодыГородов);
	Запрос.УстановитьПараметр("НомерДляПоискаГорода", НомерТелефона);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Если Не РезультатЗапроса[1].Пустой() Тогда
		Выборка = РезультатЗапроса[1].Выбрать();
		Выборка.Следующий();
		
		Номер = Сред(НомерТелефона, СтрДлина(Выборка.КодСтраны + Выборка.КодГорода) + 1);
		Результат.КодСтраны = Выборка.КодСтраны;
		Результат.КодГорода = Выборка.КодГорода;
		Результат.Номер 	= Сред(НомерТелефона, СтрДлина(Выборка.КодСтраны + Выборка.КодГорода) + 1);
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		
		Если Не ЗначениеЗаполнено(Результат.Город) Тогда
			Результат.Город   = Результат.Область;
			Результат.Область = "";
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Результат;
КонецФункции // ПолучитьДанныеОбАбоненте()

// Проверка заполнения Логина, Хоста, Пароля
//
Функция НеобходимыеПараметрыАвторизацииЗаполнены() Экспорт
	Возврат (ЗначениеЗаполнено(Хост) 
	 		 И ЗначениеЗаполнено(МенеджерЛогин) 
			 И ЗначениеЗаполнено(МенеджерПароль) );	
КонецФункции // НеобходимыеПараметрыАвторизацииЗаполнены()

//----------------------------------------------------------------------------------------------------------------------------------------
// ОБЩЕГО НАЗНАЧЕНИЯ

// Инициализация ключевых переменных модуля объекта обработки
//
Процедура ИнициализироватьВспомагательныеПеременные()

	ПодключенКСерверуТелефонии 	= Ложь;
	НаборНомераРазрешен 		= Истина;
	// Определяем структуру внутреннего или внешнего звонка
	ТипВнутреннийВнешнийЗвонок = Новый Структура();
	ТипВнутреннийВнешнийЗвонок.Вставить("Внешний",	    0);
	ТипВнутреннийВнешнийЗвонок.Вставить("Внутренний",	1);

	СостояниеЭкстеншена 		= Новый Структура();
	СостояниеЭкстеншена.Вставить("Недоступен",0);
	СостояниеЭкстеншена.Вставить("Свободен",1);
	СостояниеЭкстеншена.Вставить("Разговаривает",2);
	СостояниеЭкстеншена.Вставить("Звонит",3);

	// Сохраненная ранее история звонков
	ЗапланированныйДонабор = Новый Соответствие();
	БезИнтеграционныйРежим = Ложь;
	ПолеКалендаряИсторииЗвонков = ТекущаяДата();
	КлючУникальности = Прав(Новый УникальныйИдентификатор,5);
		
	ЗагрузитьКодыГородов();
	
	БезИнтеграционныйРежим = (Метаданные.Обработки.Найти("МИКО_SIP_Softfon_For_1С") = Неопределено);
	
	ЕстьДокументСобытие = НЕ Метаданные.Документы.Найти("Событие") = Неопределено;
	ВСобытииЕстьUID 	= ЕстьДокументСобытие И (НЕ Метаданные.Документы.Событие.Реквизиты.Найти("CRM_GUIDЗвонка") = Неопределено);
КонецПроцедуры

Процедура ИнициализироватьОсновныеДопМодули() Экспорт
	// общий для всех модуль
	мОбработкаДанных = ЭтотОбъект.ПолучитьФорму("мОбработкаДанных");
	
	// Этап 1: подключаем первичные доп модули
	ИмяОбщегоМодуля = ПолучитьИмяОбщегоМодуля();
	Если ИмяОбщегоМодуля = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Попытка
		мОбщийМодуль 	 = ЭтотОбъект.ПолучитьФорму(ИмяОбщегоМодуля);
	    мПользователь 	 = мОбщийМодуль.ПолучитьТекущегоПользователя();
	Исключение
		// ошибка не должна случиться!
		Возврат;
	КонецПопытки; 
	// первоначальное заполнение глобальных переменных	
	ГлобальныеПеременные = мОбщийМодуль.ПолучитьГлобальныеПеременные();
	ГлобальныеПеременные.Вставить("глИспользоватьПанельТелефонии", БезИнтеграционныйРежим);	

КонецПроцедуры
Функция ПолучитьИмяОбщегоМодуля() Экспорт
	ИмяМодуля = Неопределено; 
	
	тмпИмяКонфигурации = мОбработкаДанных.ПолучитьНастройкиИзХранилища("MIKO","ИмяКонфигурации",,ИмяПользователя());
	ИмяТекущейКонфигурации = ?(ЗначениеЗаполнено(тмпИмяКонфигурации),тмпИмяКонфигурации,Метаданные.Имя); 
	ВерсияК = Метаданные.Версия;
	
	Если ИмяТекущейКонфигурации = "Автоматизация_1СФранчайзи"
		ИЛИ ИмяТекущейКонфигурации = "УправлениеТорговлей_CRMПроф"
		ИЛИ ИмяТекущейКонфигурации = "CRM"
		ИЛИ ЭтоCRMКонфигурация() Тогда
		ИмяМодуля = "мОбщийМодуль_CRM";
	ИначеЕсли (ИмяТекущейКонфигурации = "УправлениеТорговлей" И Лев(ВерсияК, 4) = "10.3")
		ИЛИ ИмяТекущейКонфигурации = "УправлениеПроизводственнымПредприятием"
		ИЛИ ИмяТекущейКонфигурации = "КомплекснаяАвтоматизация"
		ИЛИ ИмяТекущейКонфигурации = "УправлениеТорговымПредприятиемДляУкраины" 
		ИЛИ (ИмяТекущейКонфигурации = "УправлениеТорговлейДляУкраины" И Лев(ВерсияК, 3) = "2.3") 
		ИЛИ ИмяТекущейКонфигурации = "УправлениеПроизводственнымПредприятиемДляУкраины" Тогда
		ИмяМодуля = "мОбщийМодуль_УТ10_3";
	ИначеЕсли ИмяТекущейКонфигурации = "БухгалтерияПредприятия"
		ИЛИ ИмяТекущейКонфигурации = "БухгалтерияДляУкраины" Тогда
		ИмяМодуля = "мОбщийМодуль_БП2_0";
	КонецЕсли;
	
	Возврат ИмяМодуля;
КонецФункции // ПолучитьИмяОбщегоМодуля()
Функция ЭтоCRMКонфигурация() Экспорт
	ЭтоCRM = (НЕ Метаданные.Константы.Найти("CRM_ИспользуемыйСофтФон") = Неопределено);	
	Возврат ЭтоCRM;
КонецФункции // ЭтоCRMКонфигурация()

// возвращает номер версии обработки
// 
Функция Версия()Экспорт
	Возврат "2.2.1.15";
КонецФункции // Версия()

// Является ли ОС Ubuntu
// проверка 
&НаКлиенте
Функция ЭтоUbuntu() Экспорт
	СисИнфо = Новый СистемнаяИнформация;
	ВерсияОС = НРег(СисИнфо.ВерсияОС);
	ЭтоUbuntu = Найти(ВерсияОС, "ubuntu")>0;
	
	Возврат ЭтоUbuntu;
КонецФункции // ЭтоUbuntu()

////////////////////////////////////////////////
// Лицензии. Система защиты.

// Проверка наличия лицензии на исползовании SIP компонента
// 
Функция КлючЗащитыДоступен() Экспорт
    Если ЭтоUbuntu() Тогда
		Возврат Истина;	
	КонецЕсли; 
	
	Если Компонент = Неопределено Тогда
		ИнициализироватьВК();
	КонецЕсли;
	Если Компонент = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
    ПолучитьСведенияОЛицензированииSIP();
	
	Если SIP_ТипЛицензии = "perpetual"
		 ИЛИ ( ТипЗнч(SIP_ОстатокДнейЛицензии) = Тип("Число") И SIP_ОстатокДнейЛицензии > 0) Тогда
		Возврат Истина;	
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции // ПроверитьНаличиеКлючаЗащиты()
 
// Получить информацию о ключах HASP доступных текущей панели
//
Процедура ПолучитьСведенияОЛицензированииSIP() 
	Если Компонент = Неопределено Тогда
		ИнициализироватьВК();
	КонецЕсли;
	
	Если Компонент = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если SIP_ТаблицаКлючей = Неопределено Тогда
		SIP_ТаблицаКлючей = ПолучитьТаблицуКлючейЗащиты();
	КонецЕсли; 
	Если SIP_ТаблицаКлючей = Неопределено Тогда
	 	Возврат;
	КонецЕсли; 
	Если Отладка = Истина Тогда
		ТекстЛицензий = "---------------- SIP ----------------------" + Символы.ПС;
		Для каждого СтрокаКлюча Из SIP_ТаблицаКлючей Цикл
			ТекстЛицензий = ТекстЛицензий + ?(ТекстЛицензий="","",Символы.ПС) 
							+ "id - " + СтрокаКлюча.id + ", " + СтрокаКлюча.type + ", тип - " 
							+ СтрокаКлюча.license_type + ", дней - " + СтрокаКлюча.count_days;
		КонецЦикла;
		ТекстЛицензий = ТекстЛицензий + Символы.ПС + "--------------------------------------" + Символы.ПС;
		СообщитьОтладочнуюИнформацию("Ключи защиты:", ТекстЛицензий);	
	КонецЕсли; 
	
	Если SIP_ТаблицаКлючей = Неопределено Тогда
		SIP_ОстатокДнейЛицензии = 0; SIP_ТипЛицензии = ""; SIP_РегистрационныйНомер = "";
		Возврат
	КонецЕсли;
	
	Ключ_perpetual = SIP_ТаблицаКлючей.Найти("perpetual", "license_type");
	Если НЕ Ключ_perpetual = Неопределено Тогда
		SIP_ОстатокДнейЛицензии = 0;
		SIP_ТипЛицензии			= Ключ_perpetual.license_type;
		SIP_РегистрационныйНомер= Ключ_perpetual.id;
		Возврат;
	КонецЕсли;
	
	ВсегоДнейОсталось = SIP_ТаблицаКлючей.Итог("count_days");
	Если ВсегоДнейОсталось < 0 Тогда
		SIP_ОстатокДнейЛицензии = ВсегоДнейОсталось; 
		SIP_ТипЛицензии = ""; SIP_РегистрационныйНомер = "";
		Возврат
	КонецЕсли; 
	
	Для каждого Ключ_trial Из SIP_ТаблицаКлючей Цикл
		Если НЕ Ключ_trial.license_type = "trial" ИЛИ Ключ_trial.count_days  <= 0 Тогда
			Продолжить;
		КонецЕсли; 	

		SIP_ОстатокДнейЛицензии = Ключ_trial.count_days;
		SIP_ТипЛицензии			= Ключ_trial.license_type;
		SIP_РегистрационныйНомер= Ключ_trial.id;
		Возврат;
	КонецЦикла;
	
	Оповестить("ОбновитьОтображениеФорм");
КонецПроцедуры

// Получить информацию о ключах HASP доступных текущей панели
// Параметры
//   Нет
// Возвращаемое значение
//   Неопределено - если не вышло соедениться с драйвером защиты или если компонент не инирциализирован
//   ТаблицаКлючей- тип ТаблицаЗначений, колнки id (тип - строка),license_type (тип - строка),count_days (тип - число) 
Функция ПолучитьТаблицуКлючейЗащиты() Экспорт
	Если Компонент = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	ТаблицаКлючей = Новый ТаблицаЗначений;
	ТаблицаКлючей.Колонки.Добавить("id");
	ТаблицаКлючей.Колонки.Добавить("feature_id");
	ТаблицаКлючей.Колонки.Добавить("license_type");
	ТаблицаКлючей.Колонки.Добавить("count_days");
	ТаблицаКлючей.Колонки.Добавить("type");
	
	ТекстЛицензий = ""; Результат="";
	Попытка	
		Результат = Компонент.GetHASPInfo();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	// 1. Производим парсинг - перечень страниц
	ЧтениеHTML 	 	= Новый ЧтениеHTML;	
	ПостроительDOM 	= Новый ПостроительDOM; 
	Попытка
		ЧтениеHTML.УстановитьСтроку(Результат);
		ДокументDOM = ПостроительDOM.Прочитать(ЧтениеHTML);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	// Получить перечень страниц
	ЭлементыUl = ДокументDOM.ПолучитьЭлементыПоИмени("hasp");
	ВсегоДнейОсталось = 0;
	Для каждого ТекЭлемент_hasp Из ЭлементыUl Цикл
		//<?xml version="1.0" encoding="UTF-8" ?>
		//<hasp_info>
		//  <license_manager>
		//	<hostname>VCENTER</hostname>
		//	<ip>172.16.32.6</ip>
		//	<osname>Microsoft Windows Server 2003</osname>
		//	<hasp id="13542686473463621" type="HASP-SL-AdminMode">
		//	  <feature id="2">
		//		<license>
		//		  <license_type>perpetual</license_type>
		//		</license>
		//	  </feature>
		//	</hasp>
		//  </license_manager>
		//</hasp_info>
		// тип лицензии
		АтрибутType = ТекЭлемент_hasp.Атрибуты.ПолучитьИменованныйЭлемент("type");
		АктивацияType = ?(АтрибутType = Неопределено,"",АтрибутType.Значение);
		id = ТекЭлемент_hasp.Идентификатор;
		
		Элементы_feature = ТекЭлемент_hasp.ПолучитьЭлементыПоИмени("feature");
		Для каждого ТекЭлементUl Из Элементы_feature Цикл
			feature_id = ТекЭлементUl.Идентификатор;
			
			// <license_type>trial</license_type>
			эл_license_type = ТекЭлементUl.ПолучитьЭлементыПоИмени("license_type");
			license_type = ?(эл_license_type.Количество()=0,"",эл_license_type[0].ТекстовоеСодержимое);
			Если license_type = "perpetual" Тогда
			 	ОстатокДнейЛицензии = 0;
				ВсегоДнейОсталось = 999;
			Иначе	
				// <time_start>1339865123</time_start>
				эл_time_start = ТекЭлементUl.ПолучитьЭлементыПоИмени("time_start");
				time_start = ?(эл_time_start.Количество()=0,"",эл_time_start[0].ТекстовоеСодержимое);
				time_start = ?(НРег(time_start) = "uninitialized","0",time_start);
				//		  <total_time>2592000</total_time>
				эл_total_time = ТекЭлементUl.ПолучитьЭлементыПоИмени("total_time");
				total_time = ?(эл_total_time.Количество()=0,"",эл_total_time[0].ТекстовоеСодержимое);
				Попытка
					ТекущееВремяВФорматеUnix 	= МестноеВремя(Текущаядата())-'19700101';
					ВремяОКончанияДействияКлюча	= ?(time_start="0",ТекущееВремяВФорматеUnix,Число(time_start)) + Число(total_time);
					
					ОстатокДнейЛицензии 		= Цел((ВремяОКончанияДействияКлюча-ТекущееВремяВФорматеUnix)/86400);
					ВсегоДнейОсталось = ВсегоДнейОсталось + ОстатокДнейЛицензии;
				Исключение
					ОстатокДнейЛицензии = 0;
					Продолжить;
				КонецПопытки; 
				ОстатокДнейЛицензии = ?(ОстатокДнейЛицензии<=0, 0, ОстатокДнейЛицензии);
			КонецЕсли; 
			
			СтрокаКлюча = ТаблицаКлючей.Добавить();
			СтрокаКлюча.id 			= id;
			СтрокаКлюча.license_type= license_type; 
			СтрокаКлюча.count_days 	= ОстатокДнейЛицензии;
			СтрокаКлюча.type 		= АктивацияType;
			СтрокаКлюча.feature_id  = feature_id;
		КонецЦикла	
	КонецЦикла;
	
	Возврат ТаблицаКлючей;
КонецФункции

// Отправка статистической информации в МИКО
// 
Процедура SendMetrikaStat(other = "")
	Если Компонент = Неопределено Тогда
		СообщитьОтладочнуюИнформацию("SendMetrika", "Компонент не подключен");
		Возврат;
	КонецЕсли;
	
	HaspKeyID = "" + SIP_ТипЛицензии +"_№"+SIP_РегистрационныйНомер;
	Сис = Новый СистемнаяИнформация;
	СтрПлатформа 			= Сис.ВерсияПриложения;
	СтрКонфигурация 		= Метаданные.Имя;
	СтрРежимЗапуска 		= Метаданные.ОсновнойРежимЗапуска;
	СтрТипПлатформы 		= Сис.ТипПлатформы;
	СтрВерсияОС     		= Сис.ВерсияОС;
	СтрВерсияКонфигурации 	= Метаданные.Версия;
	
	ДанныеСтатистики = Новый Соответствие;
	ДанныеСтатистики.Вставить("haspkey",		HaspKeyID);
	ДанныеСтатистики.Вставить("platform1c",		СтрПлатформа);
	ДанныеСтатистики.Вставить("SoftPhone",		"MIKO Lab SoftPhone");
	ДанныеСтатистики.Вставить("config1c",		СтрКонфигурация);
	ДанныеСтатистики.Вставить("config1cVer",	СтрКонфигурация+СтрВерсияКонфигурации);
	ДанныеСтатистики.Вставить("DefaultRunMode",	СтрРежимЗапуска);
	ДанныеСтатистики.Вставить("PlatformType",	СтрТипПлатформы);
	ДанныеСтатистики.Вставить("OSVersion",		СтрВерсияОС);
	ДанныеСтатистики.Вставить("other",			other);
	ДанныеСтатистики.Вставить("SIPMode",	 	"SIP_SoftPhone_1C");
	
	Данные = "";
	Для каждого ТекПараметр Из ДанныеСтатистики Цикл
		Если ЗначениеЗаполнено(ТекПараметр.Значение) Тогда
			Данные = Данные + """"+ТекПараметр.Ключ+""":"""+ТекПараметр.Значение+""",";
		КонецЕсли; 
	КонецЦикла; 
	Данные = Лев(Данные, СтрДлина(Данные) - 1);
	Данные = мОбработкаДанных.URLEncode(Данные);
	Попытка
		Компонент.SendMetrika(Данные);
	Исключение
		СообщитьОтладочнуюИнформацию("SendMetrika", ИнформацияОбОшибке());
	КонецПопытки; 
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

ИнициализироватьВспомагательныеПеременные();
