///////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ СОБЫТИЙ


Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
	//Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Процедура - обработчик события "Перед записью".
//
// Параметры:
//  Отказ - <Булево>
//        - Признак отказа от записи элемента. Если в теле
//          процедуры-обработчика установить данному параметру
//          значение Истина, запись элемента выполнена не будет.
//          Значение по умолчанию: Ложь.
//
Процедура ПередЗаписью(Отказ) 
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ОбменДанными.Загрузка Тогда

		Ошибки = "";
		Если ПустаяСтрока(Модель) Тогда
			Ошибки = " - Не указана модель торгового оборудования.";
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ОбработкаОбслуживания) Тогда
			Ошибки = Ошибки + ?(ПустаяСтрока(Ошибки),
			                    "",
			                    "
			                    |")
			                + " - Не указана обработка обслуживания.";
		КонецЕсли;

		Если НЕ ПустаяСтрока(Ошибки) Тогда
			Renault_ОбщегоНазначения.СообщитьОбОшибке("При попытке записи элемента с кодом """ + Код + """ были обнаружены ошибки:
			                 |" + Ошибки);
			Отказ = Истина;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры  

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

