&НаКлиенте
Перем ПредДан;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Дерево = ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","УровниЦен",,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
	ЕСли ТипЗнч(Дерево)<>Тип("ДеревоЗначений") Тогда
		Дерево=Новый ДеревоЗначений;
		Дерево.Колонки.Добавить("Наименование",Новый ОписаниеТипов("Строка"));
		Дерево.Колонки.Добавить("УровниЦен",Новый ОписаниеТипов("ТаблицаЗначений"));
	КонецЕсли;	
		
	Строки=Дерево.Строки;
	СтрокиЦен=ДеревоЦен.ПолучитьЭлементы();
	Для Каждого Стр Из Строки Цикл
		Нов=СтрокиЦен.Добавить();
		Нов.Наименование=Стр.Наименование;
		Нов.УровниЦен.Загрузить(Стр.УровниЦен);
		Если Стр.Строки.Количество()>0 Тогда
			НовСтр=Нов.ПолучитьЭлементы();
			Для Каждого Пстр из Стр.Строки Цикл
				ПНов=НовСтр.Добавить();
				ПНов.Наименование=Пстр.Наименование;
				ПНов.УровниЦен.Загрузить(ПСтр.УровниЦен);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	Если ПредИзм Тогда
		ПредДан.УровниЦен.Очистить();
		УровниЦен.Сортировать("Цена");
		Для Каждого Стр Из УровниЦен Цикл
			ЗаполнитьЗначенияСвойств(ПредДан.УровниЦен.Добавить(),Стр);
		КонецЦикла;
		ПредИзм=Ложь;
	КонецЕсли;	
	
	Мас=СохранитьНаСервере();
	ЭтаФорма.ВладелецФормы.Элементы.УровеньЦен.СписокВыбора.ЗагрузитьЗначения(Мас);
	ЭтаФорма.ВладелецФормы.Элементы.УровеньЦенЕмекс.СписокВыбора.ЗагрузитьЗначения(Мас);
	ЭтаФорма.Закрыть();
КонецПроцедуры
	
&НаСервере
Функция СохранитьНаСервере()
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("Наименование",Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("УровниЦен",Новый ОписаниеТипов("ТаблицаЗначений"));
	Знак = ДопустимыйЗнак.Неотрицательный;
	Уровни = Новый ТаблицаЗначений;
	Уровни.Колонки.Добавить("Цена",Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(10, 2, Знак)));
	Уровни.Колонки.Добавить("Наценка",Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(6, 2, Знак)));
	Уровни.Колонки.Добавить("Округление",Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(6, 2, Знак)));
	СтрокиЦен=ДеревоЦен.ПолучитьЭлементы();
	Строки=Дерево.Строки;
	Для Каждого Стр Из СтрокиЦен Цикл
		Нов=Строки.Добавить();
		Нов.Наименование=Стр.Наименование;
		Нов.УровниЦен=Стр.УровниЦен.Выгрузить();
	    СтрокиЦен1=Стр.ПолучитьЭлементы();
		Если СтрокиЦен1.Количество()>0 Тогда
			Строки1=Нов.Строки;
			Для Каждого Стр1 Из СтрокиЦен1 Цикл
				Нов1=Строки1.Добавить();
				Нов1.Наименование=Стр1.Наименование;
				Нов1.УровниЦен=Стр1.УровниЦен.Выгрузить();
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	//Дерево=РеквизитФормыВЗначение(ДеревоЦен);
	ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса","УровниЦен",Дерево,,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
	Мас=Дерево.Строки.ВыгрузитьКолонку("Наименование");
	Если Мас.Количество()=0 Тогда 
		Мас.Добавить("Закупочная");
	КонецЕсли;
	Возврат Мас;
КонецФункции

&НаКлиенте
Процедура ДеревоЦенПриАктивизацииСтроки(Элемент)
	ТекДан=Элементы.ДеревоЦен.ТекущиеДанные;
	Если ТекДан=Неопределено Тогда Возврат;КонецЕсли;
	Если ПредИзм Тогда
		ПредДан.УровниЦен.Очистить();
		УровниЦен.Сортировать("Цена");
		Для Каждого Стр Из УровниЦен Цикл
			ЗаполнитьЗначенияСвойств(ПредДан.УровниЦен.Добавить(),Стр);
		КонецЦикла;
		ПредИзм=Ложь;
	КонецЕсли;	
	ПредДан=ТекДан;
	УровниЦен.Очистить();
	Для Каждого Стр Из ТекДан.УровниЦен Цикл
		ЗаполнитьЗначенияСвойств(УровниЦен.Добавить(),Стр);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьУровеньЦен(Команда)
	Строки=ДеревоЦен.ПолучитьЭлементы();
	Строка=Строки.Добавить();
	Элементы.ДеревоЦен.ТекущаяСтрока=Строка.ПолучитьИдентификатор();
	ЭтаФорма.Модифицированность=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоставщикаПроизводителя(Команда)
	ТекДан=Элементы.ДеревоЦен.ТекущиеДанные;
	Если текДан=Неопределено Тогда Возврат;КонецЕсли;
	ТекРод=ТекДан.ПолучитьРодителя();
	Строки=?(ТекРод=Неопределено,ТекДан.ПолучитьЭлементы(),ТекРод.ПолучитьЭлементы());
	Строка=Строки.Добавить();
	Элементы.ДеревоЦен.ТекущаяСтрока=Строка.ПолучитьИдентификатор();
	ЭтаФорма.Модифицированность=Истина;
КонецПроцедуры

&НаКлиенте
Процедура УровниЦенПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если не ПредИзм Тогда ПредИзм=Истина;КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ДеревоЦенПослеУдаления(Элемент)
	УровниЦен.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура УровниЦенПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Элементы.ДеревоЦен.ТекущиеДанные=Неопределено Тогда Отказ=Истина;КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Копировать(Команда)
	ТекДан=Элементы.ДеревоЦен.ТекущиеДанные;
	Если ТекДан=Неопределено Тогда Возврат;КонецЕсли;
	ТекРод=ТекДан.ПолучитьРодителя();
	Строки=?(ТекРод=Неопределено,ТекДан.ПолучитьЭлементы(),ТекРод.ПолучитьЭлементы());
	Строка=Строки.Добавить();
	Строка.Наименование="Укажите имя сайта или производителя";
	Для Каждого Стр Из УровниЦен Цикл
		ЗаполнитьЗначенияСвойств(Строка.УровниЦен.Добавить(),Стр);
	КонецЦикла;
	Элементы.ДеревоЦен.ТекущаяСтрока=Строка.ПолучитьИдентификатор();
	ЭтаФорма.Модифицированность=Истина;

КонецПроцедуры


&НаКлиенте
Процедура Сортировать(Команда)
	УровниЦен.Сортировать("Цена");
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьГруппу(Команда)
	ТекДан=Элементы.ДеревоЦен.ТекущиеДанные;
	Если ТекДан=Неопределено Тогда Возврат;КонецЕсли;
	Строки=ДеревоЦен.ПолучитьЭлементы();
	Строка=Строки.Добавить();
	Строка.Наименование="<Уровень цен>";
	Для Каждого Стр Из УровниЦен Цикл
		ЗаполнитьЗначенияСвойств(Строка.УровниЦен.Добавить(),Стр);
	КонецЦикла;
	ТекРод=ТекДан.ПолучитьРодителя();
	ТекДанСтроки=ТекДан.ПолучитьЭлементы();
	Если ТекРод=Неопределено и ТекДанСтроки.Количество()>0 Тогда
		СтрокаСтроки=Строка.ПолучитьЭлементы();
		Для Каждого ТекСтр Из ТекДанСтроки Цикл
			НовСтр=СтрокаСтроки.Добавить();
			НовСтр.Наименование=ТекСтр.Наименование;
			Для Каждого Стр1 из ТекСтр.УровниЦен Цикл
				ЗаполнитьЗначенияСвойств(НовСтр.УровниЦен.Добавить(),Стр1);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;	
	Элементы.ДеревоЦен.ТекущаяСтрока=Строка.ПолучитьИдентификатор();
	ЭтаФорма.Модифицированность=Истина;
КонецПроцедуры


