Процедура ЗаполнитьКритерии(Автомобиль, ТаблицаКритериев, БазовыеПоказатели = Ложь) Экспорт
	
	
	
	Для Каждого Критерий из ТаблицаКритериев Цикл
		
		Запись = РегистрыСведений.Renault_КритерииАвтомобиля.СоздатьМенеджерЗаписи();
		Запись.Автомобиль = Автомобиль;
		Если БазовыеПоказатели Тогда
			Запись.КодКритерия = Критерий.ЗначениеКритерия;
		Иначе
			Запись.КодКритерия = Критерий.КодКритерия;
		КонецЕсли;
		Запись.КодОбъекта = Критерий.КодОбъекта;
		
		Если СтрДлина(Запись.КодОбъекта) = 1 Тогда
			Запись.КодОбъекта = "00" +Запись.КодОбъекта;
		ИначеЕсли СтрДлина(Запись.КодОбъекта) = 2 Тогда
			Запись.КодОбъекта = "0" +Запись.КодОбъекта;
		КонецЕсли;
		

		Запись.ОписаниеКритерия = Критерий.Критерий;
		Запись.ОписаниеЗначенияКритерия = Критерий.ЗначениеКритерия;
		Запись.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция КритерииУжеЕстьВБазе(Автомобиль) Экспорт
	
	Запись = РегистрыСведений.Renault_КритерииАвтомобиля.СоздатьМенеджерЗаписи();
	Запись.Автомобиль = Автомобиль;
	
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ВернутьТаблицуБазовыхКритериев(Автомобиль) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_КритерииАвтомобиля.КодОбъекта,
	               |	Renault_КритерииАвтомобиля.КодКритерия,
	               |	Renault_КритерииАвтомобиля.ОписаниеКритерия
	               |ИЗ
	               |	РегистрСведений.Renault_КритерииАвтомобиля КАК Renault_КритерииАвтомобиля
	               |ГДЕ
	               |	Renault_КритерииАвтомобиля.Автомобиль = &Автомобиль";
				   
				   Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
				   
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции