Перем Выборка Экспорт; 
Перем Выборка_Резерв Экспорт;
Перем НомерОтчета Экспорт; // 1 - приемка, 2 - выдача, 3 - не выданные
Перем ИмяОбработки Экспорт;

// расстягивает ширину колонок на заданное в форме количество раз
Функция ПромасштабироватьШирину(Область)
	Для Сч = 1 По Область.ШиринаТаблицы Цикл
		Область.Область(1,сч,1,сч).ШиринаКолонки = Область.Область(1,сч,1,сч).ШиринаКолонки * Коэффициент;
	КонецЦикла;
	Возврат Область;
КонецФункции

//Заполняет начальные настройки
//
//Без параметров
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	Если ПериодСменыСтраниц = 0 Тогда
		ПериодСменыСтраниц = 1;
	КонецЕсли;
	Если СтрокНаСтраницу = 0 Тогда
		СтрокНаСтраницу = 1;
	КонецЕсли;
	Если Коэффициент = 0 Тогда
		Коэффициент = 1;
	КонецЕсли;
	
	// фильтры
	ДоступныеПоляОтбора.Очистить();
	//ПолеНастройки=ДоступныеПоляОтбора.Добавить("Организация","Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	//ПолеНастройки.Отбор=Истина;
	ПолеНастройки=ДоступныеПоляОтбора.Добавить("Подразделение","Подразделение",Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании"));
	ПолеНастройки.Отбор=Истина;
	ФильтрыОтчета.УстановитьДоступныеПоля(ДоступныеПоляОтбора);
	//ФильтрыОтчета.Добавить("Организация","Организация","Организация");
	ФильтрыОтчета.Добавить("Подразделение","Подразделение","Подразделение");
	ФильтрыОтчета.Подразделение.Значение = ПараметрыСеанса.Пользователь.Подразделение;
	ФильтрыОтчета.Подразделение.Использование = Истина;
	ФильтрыОтчета.Подразделение.ВидСравнения = ВидСравнения.ВИерархии;
	//ФильтрыОтчета.Организация.Значение = ПараметрыСеанса.Пользователь.Организация;
	//ФильтрыОтчета.Организация.Использование = Истина;
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

//Формирует текст запроса
//получаем все документы (Заявки) и их "рабочие места" по регистру ГрафикРаботыРесурсов из интервала [ДатаНачала ДатаКонца] и индикатор наличия ЗН 
Функция ПолучитьТекстЗапроса()
	
	// формируем строку фильтров виртуальной таблицы
	СтрокаУсловия="";
	Для Каждого ЭлементОтбора Из ФильтрыОтчета Цикл
		Если НЕ ЭлементОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		СтрокаУсловия = СтрокаУсловия + " И " + СтрЗаменить(СтрЗаменить(отСформироватьСтрокуВидаСравнения(ЭлементОтбора.ВидСравнения),"#","#ИмяТаблицы#" + ЭлементОтбора.ПутьКДанным),"&","&"+ЭлементОтбора.Имя);
	КонецЦикла;
	
	СтрокаУсловия = СтрЗаменить(СтрокаУсловия, "#ИмяТаблицы#", "ГрафикРаботыРесурсов.Объект.");
	СтрокаУсловия = СтрЗаменить(СтрокаУсловия, "ГрафикРаботыРесурсов.Объект.Подразделение", "ГрафикРаботыРесурсов.Объект.ПодразделениеКомпании");
	
	
	// 1 пакет: получаем Заявки
	// 2 пакет: получаем ЗН на них
	// 3 пакет: пишем истина там где ЗН есть
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ГрафикРаботыРесурсов.Объект КАК Заявка
	|ПОМЕСТИТЬ Заявки
	|ИЗ
	|	РегистрСведений.ГрафикРаботыРесурсов КАК ГрафикРаботыРесурсов
	|ГДЕ
	|	ГрафикРаботыРесурсов.Объект.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаКонца   " + СтрокаУсловия + "
	//|	И ГрафикРаботыРесурсов.Объект.Организация = &Организация
	|	И ГрафикРаботыРесурсов.Объект.ПодразделениеКомпании В ИЕРАРХИИ (&Подразделение )
	|	И НЕ ГрафикРаботыРесурсов.Объект.ПометкаУдаления
	|	И ГрафикРаботыРесурсов.ХозОперация = &ХозОперация
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикРаботыРесурсов.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказНаряд.Ссылка КАК ЗаказНаряд
	|ПОМЕСТИТЬ ЗаказНаряды
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|ГДЕ
	|	ЗаказНаряд.ДокументОснование В
	|			(ВЫБРАТЬ
	|				Заявки.Заявка
	|			ИЗ
	|				Заявки КАК Заявки)
	|	И НЕ ЗаказНаряд.ПометкаУдаления
	|	И ЗаказНаряд.Заказчик <> &Заказчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Заявки.Заявка КАК Заявка,
	|	Заявки.Заявка.Диспетчер КАК Мастер,
	|	Заявки.Заявка.ДатаНачала КАК Период,
	|	ВЫБОР
	|		КОГДА ЗаказНаряды.ЗаказНаряд ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьЗН,
	|	ЗаказНаряды.ЗаказНаряд КАК ЗаказНаряд,
	|	Заявки.Заявка.Заказчик КАК Заказчик,
	|	Заявки.Заявка.Автомобиль КАК Автомобиль,
	|	ЗаказНаряды.ЗаказНаряд.ПлановаяДатаВыдачи КАК ВремяВыдачи,
	|	ЕСТЬNULL(ЗаказНаряды.ЗаказНаряд.Состояние, ""Ожидание"") КАК Статус
	|ИЗ
	|	Заявки КАК Заявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказНаряды КАК ЗаказНаряды
	|		ПО Заявки.Заявка.Ссылка = ЗаказНаряды.ЗаказНаряд.ДокументОснование
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Возврат ТекстЗапроса;
КонецФункции //ПолучитьТекстЗапроса()

//Формирует текст запроса
//получаем все документы (Заказ-Наряды) и их статусы из интервала [ДатаНачала ДатаКонца]
Функция ПолучитьТекстЗапроса_2()
	
	// формируем строку фильтров виртуальной таблицы
	СтрокаУсловия="";
	Для Каждого ЭлементОтбора Из ФильтрыОтчета Цикл
		Если НЕ ЭлементОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		СтрокаУсловия = СтрокаУсловия + " И " + СтрЗаменить(СтрЗаменить(отСформироватьСтрокуВидаСравнения(ЭлементОтбора.ВидСравнения),"#","#ИмяТаблицы#" + ЭлементОтбора.ПутьКДанным),"&","&"+ЭлементОтбора.Имя);
	КонецЦикла;
	
	СтрокаУсловия = СтрЗаменить(СтрокаУсловия, "#ИмяТаблицы#", "ЗаказНаряд.");
	СтрокаУсловия = СтрЗаменить(СтрокаУсловия, "ЗаказНаряд.Подразделение", "ЗаказНаряд.ПодразделениеКомпании");
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ЗаказНаряд.Ссылка) КАК ЗаказНаряд,
	|	МАКСИМУМ(ЗаказНаряд.ПлановаяДатаВыдачи) КАК Время,
	|	МАКСИМУМ(ЗаказНаряд.Диспетчер) КАК Мастер,
	|	ЗаказНаряд.Автомобиль,
	|	ЗаказНаряд.Заказчик,
	|	ЗаказНаряд.Состояние
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|ГДЕ
	|	ЗаказНаряд.ПлановаяДатаВыдачи МЕЖДУ &ДатаНачала И &ДатаКонца " + СтрокаУсловия + "
	|	И ЗаказНаряд.Состояние <> &Состояние
	|   И   ЗаказНаряд.Заказчик <> &Заказчик
	|	И НЕ ЗаказНаряд.ПометкаУдаления
	|СГРУППИРОВАТЬ ПО
	|	ЗаказНаряд.Автомобиль,
	|	ЗаказНаряд.Заказчик,
	|	ЗаказНаряд.Состояние
	|УПОРЯДОЧИТЬ ПО
	|	Время
	|";
	
	Возврат ТекстЗапроса;
КонецФункции //ПолучитьТекстЗапроса_2()

//Формирует текст запроса
//получаем все документы (Заказ-Наряды) из интервала [НачалоДня ДатаНачала]
Функция ПолучитьТекстЗапроса_3()
	
	// формируем строку фильтров виртуальной таблицы
	СтрокаУсловия="";
	Для Каждого ЭлементОтбора Из ФильтрыОтчета Цикл
		Если НЕ ЭлементОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		СтрокаУсловия = СтрокаУсловия + " И " + СтрЗаменить(СтрЗаменить(отСформироватьСтрокуВидаСравнения(ЭлементОтбора.ВидСравнения),"#","#ИмяТаблицы#" + ЭлементОтбора.ПутьКДанным),"&","&"+ЭлементОтбора.Имя);
	КонецЦикла;
	
	СтрокаУсловия = СтрЗаменить(СтрокаУсловия, "#ИмяТаблицы#", "ЗаказНаряд.");
	СтрокаУсловия = СтрЗаменить(СтрокаУсловия, "ЗаказНаряд.Подразделение", "ЗаказНаряд.ПодразделениеКомпании");
	
	// неясно что делать если несколько заказ-нарядов на 1 авто,
	// но у них разная плановая дата выдачи,
	// как тогда отслеживать, что авто просрочен, а может они вообще в разные дни?
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗаказНаряд.Ссылка КАК ЗаказНаряд,
	|	ЗаказНаряд.ПлановаяДатаВыдачи КАК Время,
	|	ЗаказНаряд.Диспетчер КАК Мастер,
	|	ЗаказНаряд.Автомобиль,
	|	ЗаказНаряд.Заказчик
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|ГДЕ
	|	ЗаказНаряд.ПлановаяДатаВыдачи МЕЖДУ &НачалоДня И &ДатаНачала " + СтрокаУсловия + "
	|	И ЗаказНаряд.Состояние <> &Состояние
	|   И   ЗаказНаряд.Заказчик <> &Заказчик
	|	И НЕ ЗаказНаряд.ПометкаУдаления";
	
	Возврат ТекстЗапроса;
КонецФункции //ПолучитьТекстЗапроса_3()

// устанавливаем параметры
Процедура ПолучитьВыборкуДанныхПриемка() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = ПолучитьТекстЗапроса();
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаОтчета - ДатаНачала * 60); // все начиная с тек время - ДатаНачала
	Запрос.УстановитьПараметр("ДатаКонца", ДатаОтчета + ДатаКонца * 60); // до тек время + ДатаКонца
	Запрос.УстановитьПараметр("ХозОперация", Справочники.ХозОперации.ПланРемонта);
	//Запрос.УстановитьПараметр("Состояние", Справочники.ВидыСостоянийЗаказНарядов.Закрыт);
	Запрос.УстановитьПараметр("Заказчик", Справочники.Контрагенты.НайтиПоКоду("ЦБ000018"));
	
	Для Каждого ЭлементОтбора Из ФильтрыОтчета Цикл
		// не используем элемент отбора
		Если НЕ ЭлементОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		Запрос.УстановитьПараметр(ЭлементОтбора.Имя,ЭлементОтбора.Значение);
	КонецЦикла;
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	Выборка_Резерв = Запрос.Выполнить().Выбрать();
	
КонецПроцедуры

//устанавливаем параметры
Процедура ПолучитьВыборкуДанныхВыдача() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = ПолучитьТекстЗапроса_2();
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаОтчета - ДатаНачала * 60); // все начиная с тек время - ДатаНачала
	Запрос.УстановитьПараметр("ДатаКонца", ДатаОтчета + ДатаКонца * 60); // до тек время + ДатаКонца
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ДатаОтчета)); // начало дня, для ЗН
	Запрос.УстановитьПараметр("Состояние", Справочники.ВидыСостоянийЗаказНарядов.Закрыт);
	Запрос.УстановитьПараметр("Заказчик", Справочники.Контрагенты.НайтиПоКоду("ЦБ000018"));
	
	Для Каждого ЭлементОтбора Из ФильтрыОтчета Цикл
		// не используем элемент отбора
		Если НЕ ЭлементОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		Запрос.УстановитьПараметр(ЭлементОтбора.Имя,ЭлементОтбора.Значение);
	КонецЦикла;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
КонецПроцедуры

//устанавливаем параметры
Процедура ПолучитьВыборкуДанныхНеВыданные() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = ПолучитьТекстЗапроса_3();
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаОтчета - ДатаНачала * 60); // все начиная с тек время - ДатаНачала
	Запрос.УстановитьПараметр("ДатаКонца", ДатаОтчета + ДатаКонца * 60); // до тек время + ДатаКонца
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ДатаОтчета)); // начало дня, для ЗН
	Запрос.УстановитьПараметр("Состояние", Справочники.ВидыСостоянийЗаказНарядов.Закрыт);
	Запрос.УстановитьПараметр("Заказчик", Справочники.Контрагенты.НайтиПоКоду("ЦБ000018"));
	
	Для Каждого ЭлементОтбора Из ФильтрыОтчета Цикл
		// не используем элемент отбора
		Если НЕ ЭлементОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		Запрос.УстановитьПараметр(ЭлементОтбора.Имя, ЭлементОтбора.Значение);
	КонецЦикла;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
КонецПроцедуры

//Бондаренко++ 20180417

Процедура СформироватьОтчетПриемкаЛада(ТабДокумент) Экспорт 
	
	ДатаОтчета = ТекущаяДата();
	
	МакетОтчета = ПолучитьМакет("МакетПриемкаЛада" + ТипМакета);
	
	ОбластьШапкаТаблицы	= МакетОтчета.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьЗаголовкаОбластьШапкаТаблицы= ПромасштабироватьШирину(ОбластьШапкаТаблицы);
	ОбластьШапкаТаблицы.Параметры.Время = Формат(ДатаОтчета, "ДФ = 'Ч.мм'");
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СчетчикСтрок = 0;
	
	ОбластьМакета = МакетОтчета.ПолучитьОбласть("Строка");
	ОбластьМакета = ПромасштабироватьШирину(ОбластьМакета);
	
	ОбластьМакета.Рисунки.ФотоМ.Картинка = Новый Картинка;
	
	//   ОбластьЕстьЗН = МакетОтчета.ПолучитьОбласть("СтрокаЕстьЗН");
	//   ОбластьЕстьЗН = ПромасштабироватьШирину(ОбластьЕстьЗН);
	
	Пока  Истина  Цикл  
		
		СчетчикСтрок = СчетчикСтрок + 1;
		
		Если Выборка.ЕстьЗН Тогда
			//   		ОбластьМакета = ОбластьЕстьЗН;
			//   		ОбластьМакета.Параметры.Статус = Выборка.Статус ;
			//   		ОбластьМакета.Параметры.Мастер = Выборка.ЗаказНаряд.Диспетчер;
			
			Если СчетчикСтрок = 1 Тогда
				ОбластьМакета.Параметры.Клиент0 = Выборка.ЗаказНаряд.Заказчик;
				ОбластьМакета.Параметры.Время0  = Формат(Выборка.Период, "ДФ = 'Ч:мм'");
			ИначеЕсли СчетчикСтрок = 2 Тогда
				ОбластьМакета.Параметры.Клиент1 = Выборка.ЗаказНаряд.Заказчик;			
				ОбластьМакета.Параметры.Время1  = Формат(Выборка.Период, "ДФ = 'Ч:мм'");
			ИначеЕсли СчетчикСтрок = 3 Тогда
				ОбластьМакета.Параметры.Клиент2 = Выборка.ЗаказНаряд.Заказчик;				
				ОбластьМакета.Параметры.Время2  = Формат(Выборка.Период, "ДФ = 'Ч:мм'");
			ИначеЕсли СчетчикСтрок = 4 Тогда
				ОбластьМакета.Параметры.Клиент3 = Выборка.ЗаказНаряд.Заказчик;				
				ОбластьМакета.Параметры.Время3  = Формат(Выборка.Период, "ДФ = 'Ч:мм'");
			ИначеЕсли СчетчикСтрок = 5 Тогда
				ОбластьМакета.Параметры.Клиент4 = Выборка.ЗаказНаряд.Заказчик;				
				ОбластьМакета.Параметры.Время4  = Формат(Выборка.Период, "ДФ = 'Ч:мм'");
			ИначеЕсли СчетчикСтрок = 6 Тогда
				ОбластьМакета.Параметры.Клиент5 = Выборка.ЗаказНаряд.Заказчик;				
				ОбластьМакета.Параметры.Время5  = Формат(Выборка.Период, "ДФ = 'Ч:мм'");
			ИначеЕсли СчетчикСтрок = 7 Тогда	
				ОбластьМакета.Параметры.Клиент6 = Выборка.ЗаказНаряд.Заказчик;				
				ОбластьМакета.Параметры.Время6  = Формат(Выборка.Период, "ДФ = 'Ч:мм'");
			ИначеЕсли СчетчикСтрок = 8 Тогда	
				ОбластьМакета.Параметры.Клиент7 = Выборка.ЗаказНаряд.Заказчик;				
				ОбластьМакета.Параметры.Время7  = Формат(Выборка.Период, "ДФ = 'Ч:мм'");
			КонецЕсли; 
		Иначе
			//   		ОбластьМакета = ОбластьСтрока;
			//   		ОбластьМакета.Параметры.Мастер = Выборка.Мастер;
			Если СчетчикСтрок = 1 Тогда
				ОбластьМакета.Параметры.Клиент0 = Выборка.Заказчик;
				ОбластьМакета.Параметры.Время0  = Формат(Выборка.Период, "ДФ = 'Ч:мм'");
			ИначеЕсли СчетчикСтрок = 2 Тогда
				ОбластьМакета.Параметры.Клиент1 = Выборка.Заказчик;				
				ОбластьМакета.Параметры.Время1  = Формат(Выборка.Период, "ДФ = 'Ч:мм'");
			ИначеЕсли СчетчикСтрок = 3 Тогда
				ОбластьМакета.Параметры.Клиент2 = Выборка.Заказчик;				
				ОбластьМакета.Параметры.Время2  = Формат(Выборка.Период, "ДФ = 'Ч:мм'");
			ИначеЕсли СчетчикСтрок = 4 Тогда
				ОбластьМакета.Параметры.Клиент3 = Выборка.Заказчик;				
				ОбластьМакета.Параметры.Время3  = Формат(Выборка.Период, "ДФ = 'Ч:мм'");
			ИначеЕсли СчетчикСтрок = 5 Тогда
				ОбластьМакета.Параметры.Клиент4 = Выборка.Заказчик;				
				ОбластьМакета.Параметры.Время4  = Формат(Выборка.Период, "ДФ = 'Ч:мм'");
			ИначеЕсли СчетчикСтрок = 6 Тогда
				ОбластьМакета.Параметры.Клиент5 = Выборка.Заказчик;				
				ОбластьМакета.Параметры.Время5  = Формат(Выборка.Период, "ДФ = 'Ч:мм'");
			ИначеЕсли СчетчикСтрок = 7 Тогда	
				ОбластьМакета.Параметры.Клиент6 = Выборка.Заказчик;				
				ОбластьМакета.Параметры.Время6  = Формат(Выборка.Период, "ДФ = 'Ч:мм'");
			ИначеЕсли СчетчикСтрок = 8 Тогда	
				ОбластьМакета.Параметры.Клиент7 = Выборка.Заказчик;				
				ОбластьМакета.Параметры.Время7  = Формат(Выборка.Период, "ДФ = 'Ч:мм'");
			КонецЕсли; 
		КонецЕсли;
		
		Если ТипЗнч(Выборка.Автомобиль) = Тип("СправочникСсылка.Автомобили") Тогда
			Если СчетчикСтрок = 1 Тогда 
				ОбластьМакета.Параметры.Модель0 = Выборка.Автомобиль.Модель;
				ОбластьМакета.Параметры.Номер0  = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Выборка.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,?(Выборка.ЗаказНаряд = NULL,Выборка.Заявка.Дата,Выборка.ЗаказНаряд.ДатаСоздания ));
			ИначеЕсли СчетчикСтрок = 2 Тогда 	
				ОбластьМакета.Параметры.Модель1 = Выборка.Автомобиль.Модель;
				ОбластьМакета.Параметры.Номер1  = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Выборка.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,?(Выборка.ЗаказНаряд = NULL,Выборка.Заявка.Дата,Выборка.ЗаказНаряд.ДатаСоздания ));
			ИначеЕсли СчетчикСтрок = 3 Тогда 	
				ОбластьМакета.Параметры.Модель2 = Выборка.Автомобиль.Модель;
				ОбластьМакета.Параметры.Номер2  = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Выборка.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,?(Выборка.ЗаказНаряд = NULL,Выборка.Заявка.Дата,Выборка.ЗаказНаряд.ДатаСоздания ));
			ИначеЕсли СчетчикСтрок = 4 Тогда 	
				ОбластьМакета.Параметры.Модель3 = Выборка.Автомобиль.Модель;
				ОбластьМакета.Параметры.Номер3  = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Выборка.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,?(Выборка.ЗаказНаряд = NULL,Выборка.Заявка.Дата,Выборка.ЗаказНаряд.ДатаСоздания ));
			ИначеЕсли СчетчикСтрок = 5 Тогда 	
				ОбластьМакета.Параметры.Модель4 = Выборка.Автомобиль.Модель;
				ОбластьМакета.Параметры.Номер4  = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Выборка.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,?(Выборка.ЗаказНаряд = NULL,Выборка.Заявка.Дата,Выборка.ЗаказНаряд.ДатаСоздания ));
			ИначеЕсли СчетчикСтрок = 6 Тогда 	
				ОбластьМакета.Параметры.Модель5 = Выборка.Автомобиль.Модель;
				ОбластьМакета.Параметры.Номер5  = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Выборка.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,?(Выборка.ЗаказНаряд = NULL,Выборка.Заявка.Дата,Выборка.ЗаказНаряд.ДатаСоздания ));
			ИначеЕсли СчетчикСтрок = 7 Тогда 	
				ОбластьМакета.Параметры.Модель6 = Выборка.Автомобиль.Модель;
				ОбластьМакета.Параметры.Номер6  = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Выборка.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,?(Выборка.ЗаказНаряд = NULL,Выборка.Заявка.Дата,Выборка.ЗаказНаряд.ДатаСоздания ));
			ИначеЕсли СчетчикСтрок = 8 Тогда 	
				ОбластьМакета.Параметры.Модель7 = Выборка.Автомобиль.Модель;
				ОбластьМакета.Параметры.Номер7  = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Выборка.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,?(Выборка.ЗаказНаряд = NULL,Выборка.Заявка.Дата,Выборка.ЗаказНаряд.ДатаСоздания ));
			КонецЕсли;	
		Иначе
			Если СчетчикСтрок = 1 Тогда 
				ОбластьМакета.Параметры.Модель0 = Выборка.Автомобиль;
			ИначеЕсли СчетчикСтрок = 2 Тогда 	
				ОбластьМакета.Параметры.Модель1 = Выборка.Автомобиль;
			ИначеЕсли СчетчикСтрок = 3 Тогда 	
				ОбластьМакета.Параметры.Модель2 = Выборка.Автомобиль;
			ИначеЕсли СчетчикСтрок = 4 Тогда 	
				ОбластьМакета.Параметры.Модель3 = Выборка.Автомобиль;
			ИначеЕсли СчетчикСтрок = 5 Тогда 	
				ОбластьМакета.Параметры.Модель4 = Выборка.Автомобиль;
			ИначеЕсли СчетчикСтрок = 6 Тогда 	
				ОбластьМакета.Параметры.Модель5 = Выборка.Автомобиль;
			ИначеЕсли СчетчикСтрок = 7 Тогда 	
				ОбластьМакета.Параметры.Модель6 = Выборка.Автомобиль;
			ИначеЕсли СчетчикСтрок = 8 Тогда 	
				ОбластьМакета.Параметры.Модель7 = Выборка.Автомобиль;
			КонецЕсли;		
		КонецЕсли;
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	КартинкиИФайлы.Идентификатор,
		|	КартинкиИФайлы.ИмяФайла,
		|	КартинкиИФайлы.Данные,
		|	КартинкиИФайлы.ДанныеВоВнешнемФайле
		|ИЗ
		|	РегистрСведений.КартинкиИФайлы КАК КартинкиИФайлы
		|ГДЕ
		|	КартинкиИФайлы.Объект = &ОбъектИнформации
		|	И КартинкиИФайлы.Картинка = ИСТИНА
		|АВТОУПОРЯДОЧИВАНИЕ");
		
		Попытка
			Запрос.УстановитьПараметр("ОбъектИнформации",?(Выборка.ЗаказНаряд = NULL,Выборка.Заявка.Диспетчер,Выборка.ЗаказНаряд.Диспетчер ));
			РезультатЗапроса = Запрос.Выполнить().Выгрузить();
			Если РезультатЗапроса.Количество()>0 Тогда			
				СтрокаКартинка = РезультатЗапроса[0];
				Если СтрокаКартинка.ДанныеВоВнешнемФайле Тогда
					ОбластьМакета.Рисунки.ФотоМ.Картинка = Новый Картинка(СтрокаКартинка.ИмяФайла,Ложь);	
				Иначе
					ОбластьМакета.Рисунки.ФотоМ.Картинка= Новый Картинка(СтрокаКартинка.Данные.Получить());
				КонецЕсли;
				ОбластьМакета.Параметры.ФИО=?(Выборка.ЗаказНаряд = NULL,Выборка.Заявка.Диспетчер.Наименование,Выборка.ЗаказНаряд.Диспетчер.Наименование );
				ОбластьМакета.Параметры.Должность=?(Выборка.ЗаказНаряд = NULL,Выборка.Заявка.Диспетчер.Должность,Выборка.ЗаказНаряд.Диспетчер.Должность );
			Иначе
				//ОбластьМакета.Рисунки.ФотоМ.Картинка = Новый Картинка;
			КонецЕсли;
		Исключение
			//
		КонецПопытки;
		
		Если СчетчикСтрок >= СтрокНаСтраницу Тогда
			Прервать;
		КонецЕсли;
		
		Если НЕ Выборка.Следующий() Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	ОбластьМакета.Параметры.Дилер = ПараметрыСеанса.Организация.НаименованиеПолное;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
КонецПроцедуры //СформироватьОтчетПриемкаЛада
//Бондаренко-- 20180417

Процедура СформироватьОтчетПриемка(ТабДокумент) Экспорт 
	
	//Бондаренко++ 20180417
	Если (ПараметрыСеанса.ПодразделениеКомпании.ДилерскийЦентр = Справочники.ДилерскиеЦентры.ВолгодонскЛада) ИЛИ (ПараметрыСеанса.ПодразделениеКомпании.ДилерскийЦентр = Справочники.ДилерскиеЦентры.Рассвет) Тогда
		СформироватьОтчетПриемкаЛада(ТабДокумент);
		Возврат;	
	КонецЕсли; 	
	//Бондаренко-- 20180417
	
	//Возврат;
	
	МакетОтчета = ПолучитьМакет("МакетПриемка" + ТипМакета);
	
	//Бондаренко 20160216 ++
	// Для дилерского центар Автолига необходимо вывестит логотип Форд и фразу:
	// "Добро пожаловать! Спасибо, что приехали вовремя".
	Если ПараметрыСеанса.ПодразделениеКомпании.ДилерскийЦентр = Справочники.ДилерскиеЦентры.Автолига Тогда
		ОбластьФорд	= МакетОтчета.ПолучитьОбласть("ЗагФорд");
		ОбластьФорд = ПромасштабироватьШирину(ОбластьФорд);
		ТабДокумент.Вывести(ОбластьФорд);
	КонецЕсли; 
	//Бондаренко 20160216 --  
		//Иванченко 20241011 ++	
	Если (ПараметрыСеанса.ПодразделениеКомпании.ДилерскийЦентр = Справочники.ДилерскиеЦентры.Олимп) Тогда
		СформироватьОтчетПриемка_ОМОДА_ДЖЕЙКУ(ТабДокумент); 
		Возврат;
	КонецЕсли;
	//Иванченко 20241011 --  
	                      
	//Иванченко 20241011 ++	
	Если (ПараметрыСеанса.ПодразделениеКомпании.ДилерскийЦентр = Справочники.ДилерскиеЦентры.АвтосейлШахты) Тогда
		МакетОтчета = СформироватьОтчетПриемка_Джили(ТабДокумент); 
	КонецЕсли;
	//Иванченко 20241011 --
	
	//Галактионов++
	Если ПараметрыСеанса.ПодразделениеКомпании.ДилерскийЦентр = Справочники.ДилерскиеЦентры.СоколШахты
		ИЛИ СокрЛП(ПараметрыСеанса.Пользователь) = "Галактионов Виктор Сергеевич" 
		// Холышевская ++ 20260130
		ИЛИ ПараметрыСеанса.ПодразделениеКомпании.ДилерскийЦентр = Справочники.ДилерскиеЦентры.Малиновского43 
		// Холышевская -- 20260130 
		// Холышевская ++ 26.02.2026 
		ИЛИ ПараметрыСеанса.ПодразделениеКомпании.ДилерскийЦентр = Справочники.ДилерскиеЦентры.Текучева354 Тогда
		// Холышевская -- 26.02.2026
		СформироватьОтчетПриемкаHAVAL(ТабДокумент);
		Возврат;
	КонецЕсли;
	//Галактионов--
	
	ОбластьЗаголовка = МакетОтчета.ПолучитьОбласть("Заголовок");
	
	ОбластьЗаголовка = ПромасштабироватьШирину(ОбластьЗаголовка);
	
	ОбластьЗаголовка.Параметры.Дата = Формат(ДатаОтчета,"ДФ = 'дд.ММ.гггг Ч:мм:сс'");
	//ОбластьЗаголовка.Параметры.ДеньНедели = ТРег(Формат(ДатаОтчета,"ДФ = 'дддд'"));
	
	ТабДокумент.Вывести(ОбластьЗаголовка);
	
	ОбластьШапкаТаблицы = МакетОтчета.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьШапкаТаблицы = ПромасштабироватьШирину(ОбластьШапкаТаблицы);
	
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	ДатаОтчета = ТекущаяДата();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СчетчикСтрок = 0;
	
	ОбластьСтрока = МакетОтчета.ПолучитьОбласть("Строка");
	ОбластьСтрока = ПромасштабироватьШирину(ОбластьСтрока);
	
	ОбластьЕстьЗН = МакетОтчета.ПолучитьОбласть("СтрокаЕстьЗН");
	ОбластьЕстьЗН = ПромасштабироватьШирину(ОбластьЕстьЗН);
	
	Пока  Истина  Цикл  
		СчетчикСтрок = СчетчикСтрок + 1;
		
		Если Выборка.ЕстьЗН Тогда
			ОбластьМакета = ОбластьЕстьЗН;
			ОбластьМакета.Параметры.Статус = Выборка.Статус ;
			
			ОбластьМакета.Параметры.Мастер = Выборка.ЗаказНаряд.Диспетчер;   
			
			//Иванченко 2024111 ++	
			Если Не (ПараметрыСеанса.ПодразделениеКомпании.ДилерскийЦентр = Справочники.ДилерскиеЦентры.АвтосейлШахты) Тогда
				ОбластьМакета.Параметры.Клиент = Выборка.ЗаказНаряд.Заказчик; 
			КонецЕсли;
			//Иванченко 2024111 --
			
			Если Выборка.ВремяВыдачи < ТекущаяДата() тогда
				ОбластьМакета.Параметры.Статус = "Задержан";
			КонецЕсли; 
			Если Выборка.ВремяВыдачи = '00010101' тогда
				ОбластьМакета.Параметры.Статус = "Оформление";
			КонецЕсли; 
		Иначе
			ОбластьМакета = ОбластьСтрока;
			ОбластьМакета.Параметры.Мастер = Выборка.Мастер;
			
			//Иванченко 20241011 ++	
			Если Не (ПараметрыСеанса.ПодразделениеКомпании.ДилерскийЦентр = Справочники.ДилерскиеЦентры.АвтосейлШахты) Тогда
				ОбластьМакета.Параметры.Клиент = Выборка.Заказчик; 
			КонецЕсли;
			//Иванченко 20241011 --
			
			ОбластьМакета.Параметры.Статус = "Ожидание";
			
			
		КонецЕсли;
		
		
		ОбластьМакета.Параметры.ВремяВыдачи = Выборка.ВремяВыдачи;
		
		Если Выборка.Статус = Справочники.ВидыСостоянийЗаказНарядов.Выполнен  тогда
			ОбластьМакета.Параметры.Статус = "Готов";
			
		КонецЕсли;  
		Если Выборка.Статус = Справочники.ВидыСостоянийЗаказНарядов.Закрыт  тогда
			ОбластьМакета.Параметры.Статус = "Выдан";
			
		КонецЕсли;
		
		ОбластьМакета.Параметры.ЗР	   = Выборка.Заявка;
		ОбластьМакета.Параметры.Время  = Формат(Выборка.Период, "ДФ = 'Ч:мм'");
		
		Если ТипЗнч(Выборка.Автомобиль) = Тип("СправочникСсылка.Автомобили") Тогда
			ОбластьМакета.Параметры.Модель = Выборка.Автомобиль.Модель;
			Авто = Выборка.Автомобиль.ПолучитьОбъект();
			//ОбластьМакета.Параметры.Номер  = Авто.ЧтениеЗначенияРегистраСведения(Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
			ОбластьМакета.Параметры.Номер  =     Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Выборка.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,?(Выборка.ЗаказНаряд = NULL,Выборка.Заявка.Дата,Выборка.ЗаказНаряд.ДатаСоздания ));
		Иначе
			ОбластьМакета.Параметры.Модель = Выборка.Автомобиль;
		КонецЕсли;
		
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	КартинкиИФайлы.Идентификатор,
		|	КартинкиИФайлы.ИмяФайла,
		|	КартинкиИФайлы.Данные,
		|	КартинкиИФайлы.ДанныеВоВнешнемФайле
		|ИЗ
		|	РегистрСведений.КартинкиИФайлы КАК КартинкиИФайлы
		|ГДЕ
		|	КартинкиИФайлы.Объект = &ОбъектИнформации
		|	И КартинкиИФайлы.Картинка = ИСТИНА
		|АВТОУПОРЯДОЧИВАНИЕ");
		
		Попытка
			Запрос.УстановитьПараметр("ОбъектИнформации",?(Выборка.ЗаказНаряд = NULL,Выборка.Заявка.Диспетчер,Выборка.ЗаказНаряд.Диспетчер ));
			РезультатЗапроса = Запрос.Выполнить().Выгрузить();
			Если РезультатЗапроса.Количество()>0 Тогда			
				СтрокаКартинка = РезультатЗапроса[0];
				Если СтрокаКартинка.ДанныеВоВнешнемФайле Тогда
					Если Выборка.ЕстьЗН Тогда
						
						ОбластьМакета.Рисунки.ФотоМ2.Картинка = Новый Картинка(СтрокаКартинка.ИмяФайла,Ложь);	
						
					Иначе
						ОбластьМакета.Рисунки.ФотоМ.Картинка = Новый Картинка(СтрокаКартинка.ИмяФайла,Ложь);
					КонецЕсли;
				Иначе
					Если Выборка.ЕстьЗН Тогда
						
						ОбластьМакета.Рисунки.ФотоМ2.Картинка= Новый Картинка(СтрокаКартинка.Данные.Получить());
					Иначе
						ОбластьМакета.Рисунки.ФотоМ.Картинка= Новый Картинка(СтрокаКартинка.Данные.Получить());
					КонецЕсли;
				КонецЕсли;			
			Иначе
				Если Выборка.ЕстьЗН Тогда
					
					ОбластьМакета.Рисунки.ФотоМ2.Картинка = Новый Картинка;
				Иначе
					ОбластьМакета.Рисунки.ФотоМ.Картинка = Новый Картинка;
					
				КонецЕсли;
			КонецЕсли;				
		Исключение
		КонецПопытки;
		
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		Если СчетчикСтрок >= СтрокНаСтраницу Тогда
			Прервать;
		КонецЕсли;
		
		Если НЕ Выборка.Следующий() Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры     

//Иванченко 20241011 ++
Процедура СформироватьОтчетПриемка_ОМОДА_ДЖЕЙКУ(ТабДокумент)
	
	Макет_ОМОДА_ДЖЕЙКУ = ПолучитьМакет("МакетПриемка_ОМОДА_ДЖЕЙКУ");  
	
	Область_ЛевыйОтступ = Макет_ОМОДА_ДЖЕЙКУ.ПолучитьОбласть("ЛевыйОтступ"); 
	Область_ЛевыйОтступ = ПромасштабироватьШирину(Область_ЛевыйОтступ);
	ТабДокумент.Вывести(Область_ЛевыйОтступ);  
	
	Область_КолонкаМастер = Макет_ОМОДА_ДЖЕЙКУ.ПолучитьОбласть("КолонкаМастер"); 
	Область_КолонкаМастер = ПромасштабироватьШирину(Область_КолонкаМастер);
	НомерСтроки = 1;    
	
	Пока Выборка_Резерв.Следующий() И НомерСтроки <= 5 Цикл		
		НомерСтроки = НомерСтроки + 1; 
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	КартинкиИФайлы.Идентификатор,
		|	КартинкиИФайлы.ИмяФайла,
		|	КартинкиИФайлы.Данные,
		|	КартинкиИФайлы.ДанныеВоВнешнемФайле
		|ИЗ
		|	РегистрСведений.КартинкиИФайлы КАК КартинкиИФайлы
		|ГДЕ
		|	КартинкиИФайлы.Объект = &ОбъектИнформации
		|	И КартинкиИФайлы.Картинка = ИСТИНА
		|АВТОУПОРЯДОЧИВАНИЕ");
		
		Попытка
			Запрос.УстановитьПараметр("ОбъектИнформации",?(Выборка_Резерв.ЗаказНаряд = NULL,
			Выборка_Резерв.Заявка.Диспетчер,
			Выборка_Резерв.ЗаказНаряд.Диспетчер));
			РезультатЗапроса = Запрос.Выполнить().Выгрузить();  
			
			Если РезультатЗапроса.Количество() > 0 Тогда			
				СтрокаКартинка = РезультатЗапроса[0]; 
				
				Если СтрокаКартинка.ДанныеВоВнешнемФайле Тогда
					Область_КолонкаМастер.Рисунки.МастерФото.Картинка = Новый Картинка(СтрокаКартинка.ИмяФайла,Ложь);	
				Иначе
					Область_КолонкаМастер.Рисунки.МастерФото.Картинка= Новый Картинка(СтрокаКартинка.Данные.Получить());
				КонецЕсли;	
				
			Иначе				
				Область_КолонкаМастер.Рисунки.МастерФото.Картинка = Новый Картинка;
			КонецЕсли;	
			
		Исключение
		КонецПопытки; 
		
		МастерФИО = ?(Выборка_Резерв.ЕстьЗН = Истина, Выборка_Резерв.ЗаказНаряд.Диспетчер, Выборка_Резерв.Мастер);	
		МассивМастерФИО = СтрРазделить(МастерФИО, " ");
		МастерИФ = МассивМастерФИО[1] + Символы.ПС + МассивМастерФИО[0]; 
		
		Область_КолонкаМастер.Параметры.МастерИФ = МастерИФ;
		МенеджерТелефон_Строкой = СтрЗаменить(МастерФИО.РабочийТелефонСотовый, " ", "");  
		//Иванченко 20250519 ++				
		//МенеджерТелефон_Формат = СтрЗаменить(Лев(МенеджерТелефон_Строкой, 1), "7", "+7 ") + 
		//Сред(МенеджерТелефон_Строкой, 2, 3) + 
		//" " + Сред(МенеджерТелефон_Строкой, 5, 2) + 
		//" " + Сред(МенеджерТелефон_Строкой, 8, 2); 
		МенеджерТелефон_Формат = СтрЗаменить(Лев(МенеджерТелефон_Строкой, 1), "7", "+7 ") + 
								 Сред(МенеджерТелефон_Строкой, 2, 3) + " " + 
								 Сред(МенеджерТелефон_Строкой, 5, 2) + " " + 
								 Сред(МенеджерТелефон_Строкой, 7, 2) + " " + 
								 Сред(МенеджерТелефон_Строкой, 9, 3);
		//Иванченко 20250519 --		
		Область_КолонкаМастер.Параметры.МастерТелефон = МенеджерТелефон_Формат;   
		
		ТабДокумент.Присоединить(Область_КолонкаМастер); 
	КонецЦикла;	
	
	Если НЕ Выборка_Резерв.Следующий() И НомерСтроки <= 5 Тогда  
		
		Пока НомерСтроки <= 5 Цикл  
			НомерСтроки = НомерСтроки + 1;
			Область_КолонкаМастер_Пустая = Макет_ОМОДА_ДЖЕЙКУ.ПолучитьОбласть("КолонкаМастер_Пустая");  
			Область_КолонкаМастер_Пустая = ПромасштабироватьШирину(Область_КолонкаМастер_Пустая);
			ТабДокумент.Присоединить(Область_КолонкаМастер_Пустая);
		КонецЦикла;
		
	КонецЕсли;
	
	ТекДата = ТекущаяДата();   
	Область_Время = Макет_ОМОДА_ДЖЕЙКУ.ПолучитьОбласть("Время"); 
	Область_Время = ПромасштабироватьШирину(Область_Время);
	Область_Время.Параметры.Время = Формат(ТекДата, "ДФ='dd MMMM yyyy'") + Символы.ПС + Формат(ТекДата, "ДФ='HH:mm'");
	ТабДокумент.Присоединить(Область_Время);
	
	Область_ШапкаТаблицы = Макет_ОМОДА_ДЖЕЙКУ.ПолучитьОбласть("ШапкаТаблицы");
	Область_ШапкаТаблицы = ПромасштабироватьШирину(Область_ШапкаТаблицы);
	ТабДокумент.Вывести(Область_ШапкаТаблицы); 
	
	Область_СтрокаТаблицы = Макет_ОМОДА_ДЖЕЙКУ.ПолучитьОбласть("СтрокаТаблицы");
	Область_СтрокаТаблицы = ПромасштабироватьШирину(Область_СтрокаТаблицы);	
	НомерСтроки = 1;
	
	Пока Выборка.Следующий() И НомерСтроки <= СтрокНаСтраницу Цикл				
		НомерСтроки = НомерСтроки + 1;
		
		Если НомерСтроки % 2 = 0 Тогда
			Область_СтрокаТаблицы.Область(1, 2, 1, 7).ЦветФона = Новый Цвет(255, 255, 255);   
		Иначе
			Область_СтрокаТаблицы.Область(1, 2, 1, 7).ЦветФона = Новый Цвет(219, 219, 219);
		КонецЕсли;
		
		Область_СтрокаТаблицы.Параметры.ВремяЗаписи = Формат(Выборка.Период, "ДФ = 'Ч:мм'");
		Область_СтрокаТаблицы.Параметры.ВремяВыдачи = Формат(Выборка.ВремяВыдачи, "ДФ = 'Ч:мм'");
		Область_СтрокаТаблицы.Параметры.Номер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(
		Выборка.Автомобиль, 
		Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,
		?(Выборка.ЗаказНаряд = NULL,Выборка.Заявка.Дата,Выборка.ЗаказНаряд.ДатаСоздания));
		Область_СтрокаТаблицы.Параметры.Модель = ?(ТипЗнч(Выборка.Автомобиль) = Тип("СправочникСсылка.Автомобили"), Выборка.Автомобиль.Модель, Выборка.Автомобиль);
		Область_СтрокаТаблицы.Параметры.Мастер = ?(Выборка.ЕстьЗН = Истина, Выборка.ЗаказНаряд.Диспетчер, Выборка.Мастер); 
		
		Если Выборка.Статус = Справочники.ВидыСостоянийЗаказНарядов.НачатьРаботу ИЛИ Выборка.Статус = Справочники.ВидыСостоянийЗаказНарядов.Ожидание ИЛИ Выборка.Статус = Справочники.ВидыСостоянийЗаказНарядов.ОжиданиеОплатыОтСК Тогда
			Область_СтрокаТаблицы.Параметры.Статус = "Ожидание клиента";
			Область_СтрокаТаблицы.Область(1, 8, 1, 9).ЦветФона = Новый Цвет(255, 0, 0);
		ИначеЕсли Выборка.Статус = Справочники.ВидыСостоянийЗаказНарядов.Выполнен ИЛИ Выборка.Статус = Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда	
			Область_СтрокаТаблицы.Параметры.Статус = "Ремонт выполнен";	
			Область_СтрокаТаблицы.Область(1, 8, 1, 9).ЦветФона = Новый Цвет(146, 208, 80);
		Иначе
			Область_СтрокаТаблицы.Параметры.Статус = "В работе";
			Область_СтрокаТаблицы.Область(1, 8, 1, 9).ЦветФона = Новый Цвет(0, 112, 192);
		КонецЕсли;  
		
		ТабДокумент.Вывести(Область_СтрокаТаблицы);				
	КонецЦикла;  
	
	Область_Подвал = ПромасштабироватьШирину(Макет_ОМОДА_ДЖЕЙКУ.ПолучитьОбласть("Подвал"));   
	ТабДокумент.Вывести(Область_Подвал); 
	
КонецПроцедуры
//Иванченко 20241011 --

//Иванченко 20241202 ++  
Функция СформироватьОтчетПриемка_Джили(ТабДокумент)
	МакетОтчета = ПолучитьМакет("МакетПриемка_Джили");  
	
	Возврат МакетОтчета;
	
КонецФункции	
//Иванченко 20241202 -- 

//Галактионов 06032025 ++ 
Процедура СформироватьОтчетПриемкаHAVAL(ТабДокумент)
	
	Макет = ПолучитьМакет("МакетHaval");
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка = ПромасштабироватьШирину(Шапка);
	ТабДокумент.Вывести(Шапка);
	
	Тело = Макет.ПолучитьОбласть("Тело");
	Тело = ПромасштабироватьШирину(Тело);
	ТекущаяДата = ТекущаяДата();
	Тело.Параметры.Время      = Формат(ТекущаяДата, "ДФ='HH:mm'");
	Тело.Параметры.ДеньНедели = ДеньНеделиПрописью(ДеньНедели(ТекущаяДата));
	Тело.Параметры.Дата       = Формат(ТекущаяДата, "ДФ='dd MMMM yyyy'");
	ТабДокумент.Вывести(Тело);
	
	ОбластьМастерКонсультант = Макет.ПолучитьОбласть("МастерКонсультант");
	ОбластьМастерКонсультант = ПромасштабироватьШирину(ОбластьМастерКонсультант);
	
	НомерСтроки = 1;	
	Пока Выборка_Резерв.Следующий() И НомерСтроки <= 4 Цикл		
		
		НомерСтроки = НомерСтроки + 1; 
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	КартинкиИФайлы.Идентификатор,
		|	КартинкиИФайлы.ИмяФайла,
		|	КартинкиИФайлы.Данные,
		|	КартинкиИФайлы.ДанныеВоВнешнемФайле
		|ИЗ
		|	РегистрСведений.КартинкиИФайлы КАК КартинкиИФайлы
		|ГДЕ
		|	КартинкиИФайлы.Объект = &ОбъектИнформации
		|	И КартинкиИФайлы.Картинка = ИСТИНА
		|АВТОУПОРЯДОЧИВАНИЕ");
		
		Попытка
			Запрос.УстановитьПараметр("ОбъектИнформации",?(Выборка_Резерв.ЗаказНаряд = NULL,
			Выборка_Резерв.Заявка.Диспетчер,
			Выборка_Резерв.ЗаказНаряд.Диспетчер));
			РезультатЗапроса = Запрос.Выполнить().Выгрузить();  
			
			Если РезультатЗапроса.Количество() > 0 Тогда			
				СтрокаКартинка = РезультатЗапроса[0]; 
				
				Если СтрокаКартинка.ДанныеВоВнешнемФайле Тогда
					ОбластьМастерКонсультант.Рисунки.МастерФото.Картинка = Новый Картинка(СтрокаКартинка.ИмяФайла,Ложь);	
				Иначе
					ОбластьМастерКонсультант.Рисунки.МастерФото.Картинка= Новый Картинка(СтрокаКартинка.Данные.Получить());
				КонецЕсли;	
				
			Иначе				
				ОбластьМастерКонсультант.Рисунки.МастерФото.Картинка = Новый Картинка;
			КонецЕсли;	
			
		Исключение
		КонецПопытки; 
		
		МастерФИО = ?(Выборка_Резерв.ЕстьЗН = Истина, Выборка_Резерв.ЗаказНаряд.Диспетчер, Выборка_Резерв.Мастер);	
		МассивМастерФИО = СтрРазделить(МастерФИО, " ");
		МастерИФ = МассивМастерФИО[1] + Символы.ПС + МассивМастерФИО[0]; 
		
		ОбластьМастерКонсультант.Параметры.ФИО = МастерИФ;
		МенеджерТелефон_Строкой = СтрЗаменить(МастерФИО.РабочийТелефонСотовый, " ", ""); 
		МенеджерТелефон_Формат = СтрЗаменить(Лев(МенеджерТелефон_Строкой, 1), "7", "+7 ") + 
		Сред(МенеджерТелефон_Строкой, 2, 3) + 
		" " + Сред(МенеджерТелефон_Строкой, 5, 3) + 
		" " + Сред(МенеджерТелефон_Строкой, 8, 4);
		ОбластьМастерКонсультант.Параметры.НомерТелефона = МенеджерТелефон_Формат;   
		
		ТабДокумент.Присоединить(ОбластьМастерКонсультант);
		
	КонецЦикла;

	Если НЕ Выборка_Резерв.Следующий() И НомерСтроки <= 4 Тогда  
		
		Пока НомерСтроки <= 4 Цикл  
			НомерСтроки = НомерСтроки + 1;
			Область_КолонкаМастер_Пустая = Макет.ПолучитьОбласть("МастерКонсультант");  
			Область_КолонкаМастер_Пустая = ПромасштабироватьШирину(Область_КолонкаМастер_Пустая);
			ТабДокумент.Присоединить(Область_КолонкаМастер_Пустая);
		КонецЦикла;
		
	КонецЕсли;
	
	ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ШапкаТаблицы = ПромасштабироватьШирину(ШапкаТаблицы);
	ТабДокумент.Вывести(ШапкаТаблицы);
	
	НомерСтроки = 1;
	ПерваяЗапись = Истина; 
	
	Если ЗначениеЗаполнено(Выборка.Автомобиль) Тогда
		
		НомерСтроки = НомерСтроки + 1;
		Область_СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
		Область_СтрокаТаблицы = ПромасштабироватьШирину(Область_СтрокаТаблицы);
		
		Область_СтрокаТаблицы.Параметры.ВремяЗаписи = Формат(Выборка.Период, "ДФ = 'Ч:мм'");
		Область_СтрокаТаблицы.Параметры.ВремяВыдачи = Формат(Выборка.ВремяВыдачи, "ДФ = 'Ч:мм'");
		Область_СтрокаТаблицы.Параметры.ГосНомерАвтомобиля = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(
		Выборка.Автомобиль, 
		Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,
		?(Выборка.ЗаказНаряд = NULL,Выборка.Заявка.Дата,Выборка.ЗаказНаряд.ДатаСоздания));
		Область_СтрокаТаблицы.Параметры.МодельАвтомобиля = ?(ТипЗнч(Выборка.Автомобиль) = Тип("СправочникСсылка.Автомобили"), Выборка.Автомобиль.Модель, Выборка.Автомобиль);
		Область_СтрокаТаблицы.Параметры.МастерКонсультант = ?(Выборка.ЕстьЗН = Истина, Выборка.ЗаказНаряд.Диспетчер, Выборка.Мастер); 
		
		Если Выборка.Статус = Справочники.ВидыСостоянийЗаказНарядов.НачатьРаботу ИЛИ Выборка.Статус = "Ожидание" ИЛИ Выборка.Статус = Справочники.ВидыСостоянийЗаказНарядов.ОжиданиеОплатыОтСК Тогда
			Область_СтрокаТаблицы.Параметры.Статус = "ждем авто";
			Область_СтрокаТаблицы.Область("R1C10").ЦветФона = Новый Цвет(214, 214, 214);
			Область_СтрокаТаблицы.Область("R1C11").ЦветТекста = Новый Цвет(214, 214, 214);			
		ИначеЕсли Выборка.Статус = Справочники.ВидыСостоянийЗаказНарядов.Выполнен ИЛИ Выборка.Статус = Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда	
			Область_СтрокаТаблицы.Параметры.Статус = "выполнен";	
			Область_СтрокаТаблицы.Область("R1C10").ЦветФона = Новый Цвет(68, 184, 182);
			Область_СтрокаТаблицы.Область("R1C11").ЦветТекста = Новый Цвет(68, 184, 182);
		Иначе
			Область_СтрокаТаблицы.Параметры.Статус = "в работе";
			Область_СтрокаТаблицы.Область("R1C10").ЦветФона = Новый Цвет(240, 162, 30);
			Область_СтрокаТаблицы.Область("R1C11").ЦветТекста = Новый Цвет(240, 162, 30);
		КонецЕсли;  
		
		ТабДокумент.Вывести(Область_СтрокаТаблицы);
		
		Пока Выборка.Следующий() И НомерСтроки <= СтрокНаСтраницу Цикл				
			НомерСтроки = НомерСтроки + 1;
			Область_СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
			Область_СтрокаТаблицы = ПромасштабироватьШирину(Область_СтрокаТаблицы);
			
			Область_СтрокаТаблицы.Параметры.ВремяЗаписи = Формат(Выборка.Период, "ДФ = 'Ч:мм'");
			Область_СтрокаТаблицы.Параметры.ВремяВыдачи = Формат(Выборка.ВремяВыдачи, "ДФ = 'Ч:мм'");
			Область_СтрокаТаблицы.Параметры.ГосНомерАвтомобиля = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(
			Выборка.Автомобиль, 
			Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,
			?(Выборка.ЗаказНаряд = NULL,Выборка.Заявка.Дата,Выборка.ЗаказНаряд.ДатаСоздания));
			Область_СтрокаТаблицы.Параметры.МодельАвтомобиля = ?(ТипЗнч(Выборка.Автомобиль) = Тип("СправочникСсылка.Автомобили"), Выборка.Автомобиль.Модель, Выборка.Автомобиль);
			Область_СтрокаТаблицы.Параметры.МастерКонсультант = ?(Выборка.ЕстьЗН = Истина, Выборка.ЗаказНаряд.Диспетчер, Выборка.Мастер); 
			
			Если Выборка.Статус = Справочники.ВидыСостоянийЗаказНарядов.НачатьРаботу ИЛИ Выборка.Статус = "Ожидание" ИЛИ Выборка.Статус = Справочники.ВидыСостоянийЗаказНарядов.ОжиданиеОплатыОтСК Тогда
				Область_СтрокаТаблицы.Параметры.Статус = "ждем авто";
				Область_СтрокаТаблицы.Область("R1C10").ЦветФона = Новый Цвет(214, 214, 214);
				Область_СтрокаТаблицы.Область("R1C11").ЦветТекста = Новый Цвет(214, 214, 214);			
			ИначеЕсли Выборка.Статус = Справочники.ВидыСостоянийЗаказНарядов.Выполнен ИЛИ Выборка.Статус = Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда	
				Область_СтрокаТаблицы.Параметры.Статус = "выполнен";	
				Область_СтрокаТаблицы.Область("R1C10").ЦветФона = Новый Цвет(68, 184, 182);
				Область_СтрокаТаблицы.Область("R1C11").ЦветТекста = Новый Цвет(68, 184, 182);
			Иначе
				Область_СтрокаТаблицы.Параметры.Статус = "в работе";
				Область_СтрокаТаблицы.Область("R1C10").ЦветФона = Новый Цвет(240, 162, 30);
				Область_СтрокаТаблицы.Область("R1C11").ЦветТекста = Новый Цвет(240, 162, 30);
			КонецЕсли;  
			
			ТабДокумент.Вывести(Область_СтрокаТаблицы);				
		КонецЦикла;
		
	Иначе 
		Пока Выборка.Следующий() И НомерСтроки <= СтрокНаСтраницу Цикл				
			НомерСтроки = НомерСтроки + 1;
			Область_СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
			Область_СтрокаТаблицы = ПромасштабироватьШирину(Область_СтрокаТаблицы);
			
			Область_СтрокаТаблицы.Параметры.ВремяЗаписи = Формат(Выборка.Период, "ДФ = 'Ч:мм'");
			Область_СтрокаТаблицы.Параметры.ВремяВыдачи = Формат(Выборка.ВремяВыдачи, "ДФ = 'Ч:мм'");
			Область_СтрокаТаблицы.Параметры.ГосНомерАвтомобиля = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(
			Выборка.Автомобиль, 
			Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,
			?(Выборка.ЗаказНаряд = NULL,Выборка.Заявка.Дата,Выборка.ЗаказНаряд.ДатаСоздания));
			Область_СтрокаТаблицы.Параметры.МодельАвтомобиля = ?(ТипЗнч(Выборка.Автомобиль) = Тип("СправочникСсылка.Автомобили"), Выборка.Автомобиль.Модель, Выборка.Автомобиль);
			Область_СтрокаТаблицы.Параметры.МастерКонсультант = ?(Выборка.ЕстьЗН = Истина, Выборка.ЗаказНаряд.Диспетчер, Выборка.Мастер); 
			
			Если Выборка.Статус = Справочники.ВидыСостоянийЗаказНарядов.НачатьРаботу ИЛИ Выборка.Статус = "Ожидание" ИЛИ Выборка.Статус = Справочники.ВидыСостоянийЗаказНарядов.ОжиданиеОплатыОтСК Тогда
				Область_СтрокаТаблицы.Параметры.Статус = "ждем авто";
				Область_СтрокаТаблицы.Область("R1C10").ЦветФона = Новый Цвет(214, 214, 214);
				Область_СтрокаТаблицы.Область("R1C11").ЦветТекста = Новый Цвет(214, 214, 214);			
			ИначеЕсли Выборка.Статус = Справочники.ВидыСостоянийЗаказНарядов.Выполнен ИЛИ Выборка.Статус = Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда	
				Область_СтрокаТаблицы.Параметры.Статус = "выполнен";	
				Область_СтрокаТаблицы.Область("R1C10").ЦветФона = Новый Цвет(68, 184, 182);
				Область_СтрокаТаблицы.Область("R1C11").ЦветТекста = Новый Цвет(68, 184, 182);
			Иначе
				Область_СтрокаТаблицы.Параметры.Статус = "в работе";
				Область_СтрокаТаблицы.Область("R1C10").ЦветФона = Новый Цвет(240, 162, 30);
				Область_СтрокаТаблицы.Область("R1C11").ЦветТекста = Новый Цвет(240, 162, 30);
			КонецЕсли;  
			
			ТабДокумент.Вывести(Область_СтрокаТаблицы);				
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры    

Функция ДеньНеделиПрописью(ДеньНедели)
	ДниНедели = Новый Массив;
	ДниНедели.Добавить("понедельник");
	ДниНедели.Добавить("вторник");
	ДниНедели.Добавить("среда");
	ДниНедели.Добавить("четверг");
	ДниНедели.Добавить("пятница");
	ДниНедели.Добавить("суббота");
	ДниНедели.Добавить("воскресенье");
	Возврат ДниНедели[ДеньНедели-1];
КонецФункции

//Галактионов 06032025 --

Процедура СформироватьОтчетВыдача(ТабДокумент) Экспорт 
	
	МакетОтчета = ПолучитьМакет("МакетВыдача" + ТипМакета);
	ОбластьЗаголовка = МакетОтчета.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовка = ПромасштабироватьШирину(ОбластьЗаголовка);
	
	ОбластьЗаголовка.Параметры.Дата = Формат(ДатаОтчета,"ДФ = 'дд.ММ.гггг Ч:мм:сс'");
	ОбластьЗаголовка.Параметры.ДеньНедели = ТРег(Формат(ДатаОтчета,"ДФ = 'дддд'"));
	
	ТабДокумент.Вывести(ОбластьЗаголовка);
	
	ОбластьШапкаТаблицы = МакетОтчета.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьШапкаТаблицы = ПромасштабироватьШирину(ОбластьШапкаТаблицы);
	
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	ДатаОтчета = ТекущаяДата();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СчетчикСтрок = 0;
	
	ОбластьМакета = МакетОтчета.ПолучитьОбласть("Строка");
	ОбластьМакета = ПромасштабироватьШирину(ОбластьМакета);
	
	Пока  Истина  Цикл  
		
		СчетчикСтрок = СчетчикСтрок + 1;
		
		ОбластьМакета.Параметры.ЗН 	   = Выборка.ЗаказНаряд;
		ОбластьМакета.Параметры.Время  = Формат(Выборка.Время, "ДФ = 'Ч:мм'");
		ОбластьМакета.Параметры.Клиент = Выборка.Заказчик;
		ОбластьМакета.Параметры.Модель = Выборка.Автомобиль.Модель;
		ОбластьМакета.Параметры.Мастер = Выборка.ЗаказНаряд.Мастер;
		Если Выборка.Время > ДатаОтчета Тогда
			ОбластьМакета.Параметры.Статус = "" + Выборка.Состояние;
		Иначе
			ОбластьМакета.Параметры.Статус = "Задержан";
		КонецЕсли;
		Авто = Выборка.Автомобиль.ПолучитьОбъект();
		//ОбластьМакета.Параметры.Номер = Авто.ЧтениеЗначенияРегистраСведения(Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
		ОбластьМакета.Параметры.Номер  =     Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Выборка.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,Выборка.ЗаказНаряд.ДатаСоздания);
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	КартинкиИФайлы.Идентификатор,
		|	КартинкиИФайлы.ИмяФайла,
		|	КартинкиИФайлы.Данные,
		|	КартинкиИФайлы.ДанныеВоВнешнемФайле
		|ИЗ
		|	РегистрСведений.КартинкиИФайлы КАК КартинкиИФайлы
		|ГДЕ
		|	КартинкиИФайлы.Объект = &ОбъектИнформации
		|	И КартинкиИФайлы.Картинка = ИСТИНА
		|АВТОУПОРЯДОЧИВАНИЕ");
		
		Попытка
			Запрос.УстановитьПараметр("ОбъектИнформации",Выборка.ЗаказНаряд.Мастер);
			РезультатЗапроса = Запрос.Выполнить().Выгрузить();
			Если РезультатЗапроса.Количество()>0 Тогда			
				СтрокаКартинка = РезультатЗапроса[0];
				Если СтрокаКартинка.ДанныеВоВнешнемФайле Тогда
					ОбластьМакета.Рисунки.Фото.Картинка = Новый Картинка(СтрокаКартинка.ИмяФайла,Ложь);				
				Иначе
					ОбластьМакета.Рисунки.Фото.Картинка= СтрокаКартинка.Данные.Получить();
				КонецЕсли;			
			Иначе
				ОбластьМакета.Рисунки.Фото.Картинка = Новый Картинка;
			КонецЕсли;				
		Исключение
		КонецПопытки;
		
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		Если СчетчикСтрок >= СтрокНаСтраницу Тогда
			Прервать;
		КонецЕсли;
		
		Если НЕ Выборка.Следующий() Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьОтчетНеВыданные(ТабДокумент) Экспорт 
	
	МакетОтчета = ПолучитьМакет("МакетВыдача" + ТипМакета);
	ОбластьЗаголовка = МакетОтчета.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовка = ПромасштабироватьШирину(ОбластьЗаголовка);
	
	ОбластьЗаголовка.Параметры.Дата = Формат(ДатаОтчета,"ДФ = 'дд.ММ.гггг Ч:мм:сс'");
	ОбластьЗаголовка.Параметры.ДеньНедели = ТРег(Формат(ДатаОтчета,"ДФ = 'дддд'"));
	
	ТабДокумент.Вывести(ОбластьЗаголовка);
	
	ОбластьШапкаТаблицы = МакетОтчета.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьШапкаТаблицы = ПромасштабироватьШирину(ОбластьШапкаТаблицы);
	
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	ОбластьНеВыданные = МакетОтчета.ПолучитьОбласть("ОбластьНеВыданные");
	ОбластьНеВыданные = ПромасштабироватьШирину(ОбластьНеВыданные);
	
	ТабДокумент.Вывести(ОбластьНеВыданные);
	
	ДатаОтчета = ТекущаяДата();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СчетчикСтрок = 0;
	
	ОбластьМакета = МакетОтчета.ПолучитьОбласть("Строка");
	ОбластьНеВыданные = ПромасштабироватьШирину(ОбластьНеВыданные);
	
	Пока  Истина  Цикл  
		
		СчетчикСтрок = СчетчикСтрок + 1;
		
		ОбластьМакета.Параметры.ЗН 	   = Выборка.ЗаказНаряд;
		ОбластьМакета.Параметры.Время  = "----";
		ОбластьМакета.Параметры.Клиент = Выборка.Заказчик;
		ОбластьМакета.Параметры.Модель = Выборка.Автомобиль.Модель;
		ОбластьМакета.Параметры.Мастер = Выборка.ЗаказНаряд.Мастер;
		ОбластьМакета.Параметры.Статус = "" + Выборка.ЗаказНаряд.Состояние;
		Авто = Выборка.Автомобиль.ПолучитьОбъект();
		//ОбластьМакета.Параметры.Номер  = Авто.ЧтениеЗначенияРегистраСведения(Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
		ОбластьМакета.Параметры.Номер  =     Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Выборка.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,Выборка.ЗаказНаряд.ДатаСоздания);
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	КартинкиИФайлы.Идентификатор,
		|	КартинкиИФайлы.ИмяФайла,
		|	КартинкиИФайлы.Данные,
		|	КартинкиИФайлы.ДанныеВоВнешнемФайле
		|ИЗ
		|	РегистрСведений.КартинкиИФайлы КАК КартинкиИФайлы
		|ГДЕ
		|	КартинкиИФайлы.Объект = &ОбъектИнформации
		|	И КартинкиИФайлы.Картинка = ИСТИНА
		|АВТОУПОРЯДОЧИВАНИЕ");
		
		Попытка
			Запрос.УстановитьПараметр("ОбъектИнформации",Выборка.ЗаказНаряд.Мастер);
			РезультатЗапроса = Запрос.Выполнить().Выгрузить();
			Если РезультатЗапроса.Количество()>0 Тогда			
				СтрокаКартинка = РезультатЗапроса[0];
				Если СтрокаКартинка.ДанныеВоВнешнемФайле Тогда
					ОбластьМакета.Рисунки.Фото.Картинка = Новый Картинка(СтрокаКартинка.ИмяФайла,Ложь);				
				Иначе
					ОбластьМакета.Рисунки.Фото.Картинка= СтрокаКартинка.Данные.Получить();
				КонецЕсли;			
			Иначе
				ОбластьМакета.Рисунки.Фото.Картинка = Новый Картинка;
			КонецЕсли;				
		Исключение
		КонецПопытки;
		
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		Если СчетчикСтрок >= СтрокНаСтраницу -1 Тогда
			Прервать;
		КонецЕсли;
		
		Если НЕ Выборка.Следующий() Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

