
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ОтборУстановлен = Ложь;
    Для каждого ЭлементНастройки из Список.Отбор.Элементы Цикл
        Если ЭлементНастройки.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Renault_ВедушийКонтрагент") Тогда
			Renault_ВедушийКонтрагент  = ЭлементНастройки.ПравоеЗначение;
            ОтборУстановлен = Истина;
        КонецЕсли;
        Если ЭлементНастройки.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидКонтрагента") Тогда
			ВидКонтрагента  = ЭлементНастройки.ПравоеЗначение;
            ОтборУстановлен = Истина;
        КонецЕсли;
        Если ЭлементНастройки.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОтношений") Тогда
			ВидОтношений  = ЭлементНастройки.ПравоеЗначение;
            ОтборУстановлен = Истина;
        КонецЕсли;
        Если ЭлементНастройки.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФормаСобственности") Тогда
			ФормаСобственности  = ЭлементНастройки.ПравоеЗначение;
            ОтборУстановлен = Истина;
        КонецЕсли;
    КонецЦикла;	
	
	Если ОтборУстановлен Тогда
		Отказ = Истина;
		НовыйЭлемент = Справочники.CRM_ПотенциальныеКонтрагенты.ПолучитьФормуНовогоЭлемента();
		НовыйЭлемент.Объект.ВидКонтрагента     = ВидКонтрагента;
		НовыйЭлемент.Объект.Renault_ВедушийКонтрагент  = Renault_ВедушийКонтрагент;
		НовыйЭлемент.Объект.ВидОтношений       = ВидОтношений;
		НовыйЭлемент.Объект.ФормаСобственности = ФормаСобственности;
		НовыйЭлемент.Объект.СогласиеНаОбработкуПерсональныхДанных     = Перечисления.ВариантыОтветов.Спрашивать;	
		НовыйЭлемент.Открыть();
	КонецЕсли;
КонецПроцедуры
