Процедура ДобавитьАдресРазгрузки(BIR, idТочка, Адрес) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.DMS_АдресаРазгрузкиДилеров.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.BIR = BIR;
	МенеджерЗаписи.idТочка = idТочка;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() И (МенеджерЗаписи.Адрес <> Адрес) Тогда
		МенеджерЗаписи.Адрес = Адрес;
		МенеджерЗаписи.Записать();
	ИначеЕсли Не МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.BIR = BIR;
		МенеджерЗаписи.idТочка = idТочка;
		МенеджерЗаписи.Адрес = Адрес;
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьРегистр() Экспорт
	
	НаборЗаписей = РегистрыСведений.DMS_АдресаРазгрузкиДилеров.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ПолучитьАдреСит(BIR, idТочка) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.DMS_АдресаРазгрузкиДилеров.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.BIR = BIR;
	МенеджерЗаписи.idТочка = idТочка;
	МенеджерЗаписи.Прочитать();
	
	Возврат Новый Структура("Адрес", МенеджерЗаписи.Адрес);
	
КонецФункции

Функция ДляДилераЕстьТочки(BIR) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АдресаРазгрузкиДилеров.BIR,
		|	АдресаРазгрузкиДилеров.idТочка,
		|	АдресаРазгрузкиДилеров.Адрес
		|ИЗ
		|	РегистрСведений.DMS_АдресаРазгрузкиДилеров КАК АдресаРазгрузкиДилеров
		|ГДЕ
		|	АдресаРазгрузкиДилеров.BIR = &BIR";
	Запрос.УстановитьПараметр("BIR", BIR);
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции