
Функция ПолучитьККРПоОбращению(Обращение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	DMS_КонтрольКачестваРабот.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.DMS_КонтрольКачестваРабот КАК DMS_КонтрольКачестваРабот
	|ГДЕ
	|	DMS_КонтрольКачестваРабот.Обращение = &Обращение";
	
	Запрос.УстановитьПараметр("Обращение", Обращение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Документы.DMS_КонтрольКачестваРабот.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции
