
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
		// Заполнение шапки
		Попытка
			ДилерскийЦентр = Renault_РаботаСПравамиПользователя.ДилерскийЦентрПоУмолчанию(ПараметрыСеанса.Пользователь);
		Исключение
		КонецПопытки;
		Дата = ТекущаяДатаСеанса();
		Автомобиль = ДанныеЗаполнения.Автомобиль;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Клиент = ДанныеЗаполнения.Контрагент;
		Основание = ДанныеЗаполнения;
		Для Каждого ТекСтрокаРаботы Из ДанныеЗаполнения.Работы Цикл
			НоваяСтрока = ВыполненныеРаботы.Добавить();
			НоваяСтрока.Работа = ТекСтрокаРаботы.Работа;
			НоваяСтрока.Проверка = Ложь;
			
		КонецЦикла;
	КонецЕсли;
	
	Автор = ПараметрыСеанса.Пользователь;
	
КонецПроцедуры

Процедура ЗаполнитьПоОбращению(ДокОбращения) Экспорт
	
	ВыполненныеРаботы.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Renault_CRM_ЗаявкаНаСервис.ЗаказНаряд.Ссылка КАК Сслыка
	               |ПОМЕСТИТЬ ЗаказНаряды
	               |ИЗ
	               |	Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
	               |ГДЕ
	               |	Renault_CRM_ЗаявкаНаСервис.Обращение = &Обращение
	               |	И Renault_CRM_ЗаявкаНаСервис.ЗаказНаряд.ПометкаУдаления = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗаказНарядРаботы.Работа КАК Работа,
	               |	ЗаказНарядРаботы.Ссылка.Состояние КАК Статус,
	               |	ЛОЖЬ КАК Проверка,
	               |	ЕСТЬNULL(ЗаказНарядИсполнители.Исполнитель, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК Исполнитель,
	               |	ВЫРАЗИТЬ(ЗаказНарядРаботы.ПримечаниеРаботы КАК СТРОКА(150)) КАК Комментарий,
	               |	ЗаказНарядРаботы.ИдентификаторРаботы КАК ИдентификаторРаботы
	               |ИЗ
	               |	ЗаказНаряды КАК ЗаказНаряды
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Исполнители КАК ЗаказНарядИсполнители
	               |			ПО (ЗаказНарядИсполнители.Ссылка = ЗаказНарядРаботы.Ссылка)
	               |				И ЗаказНарядРаботы.ИдентификаторРаботы = ЗаказНарядИсполнители.ИдентификаторРаботы
	               |		ПО ЗаказНаряды.Сслыка = ЗаказНарядРаботы.Ссылка
	               |ГДЕ
	               |	НЕ ЗаказНарядРаботы.Работа ЕСТЬ NULL";
				   
	Запрос.УстановитьПараметр("Обращение", ДокОбращения);
	РаботыЗаказНарядов = Запрос.Выполнить().Выгрузить();
	//МассивВыполненыхРабот = РаботыЗаказНарядов.ВыгрузитьКолонку("Ссылка");
	Для Каждого Описание Из РаботыЗаказНарядов Цикл
		Нов = ВыполненныеРаботы.Добавить();
		ЗаполнитьЗначенияСвойств(Нов,Описание);	
	КонецЦикла;
	Дата = ТекущаяДата();
	ДилерскийЦентр = ДокОбращения.ДилерскийЦентр;
	Клиент = ДокОбращения.Клиент;
	Автомобиль = ДокОбращения.Автомобиль;
	Основание = ДокОбращения.Ссылка;
	Обращение = ДокОбращения.Ссылка;
	
КонецПроцедуры

