&НаСервере
Процедура ОбновитьДанныеПрикрепленныхФайлов()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_КартинкиИФайлы.Идентификатор,
	               |	Renault_КартинкиИФайлы.Наименование,
	               |	Renault_КартинкиИФайлы.ВыгружатьПоЭлектроннойПочте
	               |ИЗ
	               |	РегистрСведений.Renault_КартинкиИФайлы КАК Renault_КартинкиИФайлы
	               |ГДЕ
	               |	Renault_КартинкиИФайлы.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект",Объект.Ссылка);
	ПрикрепленныеФайлы.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) тогда
		 ОбновитьДанныеПрикрепленныхФайлов();
	 КонецЕсли;	
	 
	Если НЕ ЗначениеЗаполнено(Объект.МенеджерОбслуживания) Тогда
		Клиент = Объект.Клиент;
		Если ЗначениеЗаполнено(Клиент) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Renault_РабочиеЛисты.ДилерскийЦентр.КонтактЛицоОбслуживанияКорпКлиента КАК МенеджерОбслуживания
				|ИЗ
				|	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
				|ГДЕ
				|	Renault_РабочиеЛисты.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.Renault_ТипыКлиентов.КорпоративныйКлиент)
				|	И Renault_РабочиеЛисты.Клиент = &Клиент";
			Запрос.УстановитьПараметр("Клиент", Клиент);
			Результат = Запрос.Выполнить();
			Если НЕ Результат.Пустой() Тогда
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				Объект.МенеджерОбслуживания = Выборка.МенеджерОбслуживания;
				Элементы.МенеджерОбслуживания.Видимость = Истина;
			Иначе
				Элементы.МенеджерОбслуживания.Видимость = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
