
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ТипЗнч(ЭтотОбъект.Отбор.Регистратор.Значение) = Тип("ДокументСсылка.Renault_БлокАвтомобиляИзДругойТочки") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ЭтотОбъект Цикл
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Renault_ЗаконтрактованныеАвтомобили.Период,
		               |	Renault_ЗаконтрактованныеАвтомобили.VIN,
		               |	Renault_ЗаконтрактованныеАвтомобили.Автомобиль,
		               |	Renault_ЗаконтрактованныеАвтомобили.РабочийЛист
		               |ИЗ
		               |	РегистрСведений.Renault_ЗаконтрактованныеАвтомобили КАК Renault_ЗаконтрактованныеАвтомобили
		               |ГДЕ
		               |	Renault_ЗаконтрактованныеАвтомобили.Автомобиль = &Автомобиль
		               |	И Renault_ЗаконтрактованныеАвтомобили.РабочийЛист <> &РабочийЛист
		               |	И НЕ Renault_ЗаконтрактованныеАвтомобили.Регистратор ССЫЛКА Документ.Renault_БлокАвтомобиляИзДругойТочки
					   |	И Renault_ЗаконтрактованныеАвтомобили.ДатаСнятияРезерва = ДАТАВРЕМЯ(1, 1, 1)";					 
					   
		Запрос.УстановитьПараметр("Автомобиль", Строка.Автомобиль);
		Запрос.УстановитьПараметр("РабочийЛист", Строка.РабочийЛист);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
