
Процедура DMS_ОбменДаннымиEDRЗарегистрироватьИзменениеДокументовПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	ТипИсточника = ТипЗнч(Источник);
	
	Если ТипИсточника = Тип("ДокументОбъект.ЗаказНаряд") Тогда
		
		Если Не Источник.ЭтоНовый() Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(ПолучитьВсехПолучателей("DMS_ВыгрузкаEDR"),Источник.Ссылка);
		КонецЕсли; 
		
		Если АвтоРегистрацияРазрешена("DMS_ВыгрузкаEDR",Источник) Тогда
			
			МодифицированностьОбъекта = МодифицированностьОбъекта(Источник,РежимЗаписи);
			
			Если Не МодифицированностьОбъекта Тогда
				СократитьПолучателей(Источник,ПолучитьВсехПолучателей("DMS_ВыгрузкаEDR"));
			Иначе 
				
				ОрганизацияДокумента = Источник.Организация;	
				СостояниеДокумента = Источник.Состояние;

				Получатели = ПолучитьУзлыДляРегистрации(ОрганизацияДокумента,СостояниеДокумента);			
				СократитьПолучателей(Источник,Получатели);
				
			КонецЕсли; 
			
			Если Не Источник.ЭтоНовый() И (Источник.ПометкаУдаления 
				Или Не Источник.Проведен) Тогда
				
				ПланыОбмена.УдалитьРегистрациюИзменений(ПолучитьВсехПолучателей("DMS_ВыгрузкаEDR"),Источник.Ссылка);
				
			КонецЕсли; 
			
		Иначе 
			
			МодифицированностьОбъекта = МодифицированностьОбъекта(Источник,РежимЗаписи);
			
			Если МодифицированностьОбъекта Тогда
				
				ОрганизацияДокумента = Источник.Организация;	
				СостояниеДокумента = Источник.Состояние;
				
				Получатели = ПолучитьУзлыДляРегистрации(ОрганизацияДокумента,СостояниеДокумента);			
				
				Если Получатели.Количество() > 0 Тогда
					ДополнитьПолучателей(Источник,Получатели);
				КонецЕсли; 
				
			КонецЕсли; 
			
			Если Не Источник.ЭтоНовый() И (Источник.ПометкаУдаления 
				Или Не Источник.Проведен) Тогда
				
				ПланыОбмена.УдалитьРегистрациюИзменений(ПолучитьВсехПолучателей("DMS_ВыгрузкаEDR"),Источник.Ссылка);
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура DMS_ОбменДаннымиEDRЗарегистрироватьУдалениеПередУдалением(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	ТипИсточника = ТипЗнч(Источник);
	
	Если ТипИсточника = Тип("ДокументОбъект.ЗаказНаряд") Тогда
		
		ПланыОбмена.УдалитьРегистрациюИзменений(ПолучитьВсехПолучателей("DMS_ВыгрузкаEDR"),Источник.Ссылка);
		
		Если АвтоРегистрацияРазрешена("DMS_ВыгрузкаEDR",Источник) Тогда
			
			МодифицированностьОбъекта = МодифицированностьОбъекта(Источник);
			
			Если Не МодифицированностьОбъекта Тогда
			
				СократитьПолучателей(Источник,ПолучитьВсехПолучателей("DMS_ВыгрузкаEDR"));
				
			Иначе 
				
				ОрганизацияДокумента = Источник.Организация;	
				СостояниеДокумента = Источник.Состояние;
				
				Получатели = ПолучитьУзлыДляРегистрации(ОрганизацияДокумента,СостояниеДокумента);			
				СократитьПолучателей(Источник,Получатели);
				
			КонецЕсли; 
			
			Если Источник.ПометкаУдаления 
				Или Не Источник.Проведен Тогда
				
				ПланыОбмена.УдалитьРегистрациюИзменений(ПолучитьВсехПолучателей("DMS_ВыгрузкаEDR"),Источник);
				
			КонецЕсли; 
			
		Иначе 
			
			МодифицированностьОбъекта = МодифицированностьОбъекта(Источник);
			
			Если МодифицированностьОбъекта Тогда
				
				ОрганизацияДокумента = Источник.Организация;	
				СостояниеДокумента = Источник.Состояние;
				
				Получатели = ПолучитьУзлыДляРегистрации(ОрганизацияДокумента,СостояниеДокумента);			
				
				Если Получатели.Количество() > 0 Тогда
					ДополнитьПолучателей(Источник,Получатели);
				КонецЕсли; 
				
			КонецЕсли; 
			
			Если Источник.ПометкаУдаления 
				Или Не Источник.Проведен Тогда
				
				ПланыОбмена.УдалитьРегистрациюИзменений(ПолучитьВсехПолучателей("DMS_ВыгрузкаEDR"),Источник);
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

Функция ПолучитьВсехПолучателей(ИмяУзла)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена[ИмяУзла].ЭтотУзел());
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	УзлыПолучатели.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена."+ИмяУзла+" КАК УзлыПолучатели
		|ГДЕ
		|	НЕ УзлыПолучатели.ПометкаУдаления
		|	И УзлыПолучатели.Ссылка <> &ЭтотУзел
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Получатели = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Получатели.Добавить(ВыборкаДетальныеЗаписи.Ссылка);	
	КонецЦикла;
	
	Возврат Получатели;
	
КонецФункции // ПолучитьВсехПолучателей()

// Определяет признак авторегистрации объекта метаданных в составе плана обмена.
//
// Параметры:
//  ИмяПланаОбмена   - Строка - имя плана обмена, как оно задано в конфигураторе, в состав которого входит объект
//                              метаданных.
//  Объект - Объект, для которого требуется получить признак авторегистрации.
//
//  Возвращаемое значение:
//   Истина - объект метаданных имеет признак авторегистрации "Разрешена" в составе плана обмена;
//   Ложь - объект метаданных имеет признак авторегистрации "Запрещена" в составе плана обмена
//          или объект метаданных не входит в состав плана обмена.
//
Функция АвтоРегистрацияРазрешена(Знач ИмяПланаОбмена, Знач Объект) Экспорт	
	
	ЭлементСоставаПланаОбмена = Метаданные.ПланыОбмена[ИмяПланаОбмена].Состав.Найти(Объект.Метаданные());
	
	Если ЭлементСоставаПланаОбмена = Неопределено Тогда
		Возврат Ложь; // Объект метаданных не входит в состав плана обмена.
	КонецЕсли;
	
	Возврат ЭлементСоставаПланаОбмена.АвтоРегистрация = АвтоРегистрацияИзменений.Разрешить;
	
КонецФункции

Функция МодифицированностьОбъекта(Объект,РежимЗаписи = Неопределено)
	
	Если Объект.ЭтоНовый() Тогда
		Возврат Истина;
	КонецЕсли; 
	
	СсылкаОбъект = Объект.Ссылка;
	
	МетаданныеОбъекта = Объект.Метаданные(); 
	
	ЭтоСправочник 	 = DMS_ОбщегоНазначенияСервер.ЭтоСправочник(МетаданныеОбъекта);
	ЭтоДокумент   	 = DMS_ОбщегоНазначенияСервер.ЭтоДокумент(МетаданныеОбъекта);
	ЭтоЗадача    	 = DMS_ОбщегоНазначенияСервер.ЭтоЗадача(МетаданныеОбъекта);
	ЭтоБизнесПроцесс = DMS_ОбщегоНазначенияСервер.ЭтоБизнесПроцесс(МетаданныеОбъекта);
	ЭтоРегистр 		 = DMS_ОбщегоНазначенияСервер.ЭтоРегистр(МетаданныеОбъекта);
	
	Если ЭтоРегистр Тогда
		Возврат Истина;
	КонецЕсли; 
	
	Если ЭтоСправочник Тогда
	
		Если Объект["Наименование"] <> СсылкаОбъект["Наименование"] Тогда
			Возврат Истина;	
		КонецЕсли; 
	
		Если Объект["Код"] <> СсылкаОбъект["Код"] Тогда
			Возврат Истина;	
		КонецЕсли; 
		
	ИначеЕсли ЭтоДокумент Тогда 
		
		Если ИзмененоПроведениеДокумента(Объект,РежимЗаписи) Тогда 
			Возврат Истина
		КонецЕсли;
	
		Если Объект["Номер"] <> СсылкаОбъект["Номер"] Тогда
			Возврат Истина;	
		КонецЕсли; 
		
	КонецЕсли; 
	
	ИмяОбъекта = МетаданныеОбъекта.Имя;
	        
	РеквизитыОбъекта = МетаданныеОбъекта.Реквизиты;
	
	Для каждого РеквизитОбъекта Из РеквизитыОбъекта Цикл
	
		Если Объект[РеквизитОбъекта.Имя] <> СсылкаОбъект[РеквизитОбъекта.Имя] Тогда
			Возврат Истина;	
		КонецЕсли; 
	
	КонецЦикла; 
	
	ТабличныеЧасти = Объект.Метаданные().ТабличныеЧасти;
	                    
	Для каждого ТабличнаяЧасть Из ТабличныеЧасти Цикл
		
		РеквизитыТЧ = ТабличнаяЧасть.Реквизиты;
		
		РеквизитыСтрокой = "";
		
		Для каждого РеквизитТЧОбъекта Из РеквизитыТЧ Цикл
			РеквизитыСтрокой = РеквизитыСтрокой + РеквизитТЧОбъекта.Имя+","
		КонецЦикла; 
		
		РеквизитыСтрокой = Лев(РеквизитыСтрокой,СтрДлина(РеквизитыСтрокой)-1);
		
		Если Не КоллекцииИдентичны(Объект,ИмяОбъекта,ТабличнаяЧасть.Имя,РеквизитыСтрокой) Тогда
			Возврат Истина;				
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат Ложь;
	
КонецФункции // МодифицированностьОбъекта()

// Процедура дополняет список узлов-получателей объекта переданными значениями.
//
// Параметры:
//  Объект - объект, для которого выполняется правило регистрации.
//  Узлы   - Массив - узлы плана обмена, которые необходимо добавить в список узлов-получателей объекта.
//
Процедура ДополнитьПолучателей(Объект, Узлы) Экспорт
	
	Для Каждого Элемент Из Узлы Цикл
		
		Попытка
			Объект.ОбменДанными.Получатели.Добавить(Элемент);
		Исключение
			ИмяПланаОбмена = Элемент.Метаданные().Имя;
			ОбъектМетаданных = Объект.Метаданные();
			СтрокаСообщения = НСтр("ru = 'Для состава плана обмена [ИмяПланаОбмена] не указана регистрация объекта [ПолноеИмя]'");
			СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "[ИмяПланаОбмена]", ИмяПланаОбмена);
			СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "[ПолноеИмя]",      ОбъектМетаданных.ПолноеИмя());
			ВызватьИсключение СтрокаСообщения;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СократитьПолучателей(Объект, Узлы)
	
	Получатели = СократитьМассив(Объект.ОбменДанными.Получатели, Узлы);
	
	// Очищаем список получателей и заполняем его заново.
	Объект.ОбменДанными.Получатели.Очистить();
	
	// Добавляем узлы для регистрации объекта.
	ДополнитьПолучателей(Объект, Получатели);
	
КонецПроцедуры

Функция ПолучитьУзлыДляРегистрации(Организация,Состояние)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Состояние", Состояние);
	Запрос.УстановитьПараметр("ЭтотУзел", 	 ПланыОбмена.DMS_ВыгрузкаEDR.ЭтотУзел());
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	УзлыВыгрузкиEDR.Ссылка
		|ИЗ
		|	ПланОбмена.DMS_ВыгрузкаEDR.Организации КАК УзлыВыгрузкиEDR
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланОбмена.DMS_ВыгрузкаEDR.СостоянияЗаказНаряда КАК СостоянияЗаказНаряда
		|		ПО УзлыВыгрузкиEDR.Ссылка = СостоянияЗаказНаряда.Ссылка
		|ГДЕ
		|	УзлыВыгрузкиEDR.Ссылка <> &ЭтотУзел
		|	И УзлыВыгрузкиEDR.Организация = &Организация
		|	И НЕ УзлыВыгрузкиEDR.Ссылка.ПометкаУдаления
		|	И СостоянияЗаказНаряда.Состояние = &Состояние";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Получатели = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Получатели.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат Получатели;
	
КонецФункции // ПолучитьУзлыДляРегистрации()

Функция ИзмененоПроведениеДокумента(Источник, РежимЗаписи)
	
	Возврат (Источник.Проведен И РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения)
	 ИЛИ (НЕ Источник.Проведен И РежимЗаписи = РежимЗаписиДокумента.Проведение);

КонецФункции

Функция КоллекцииИдентичны(Объект,ИмяОбъекта,ИмяТЧ,РеквизитыТЧ)

	ТаблицаДоИзменения    = ПолучитьТаблицуРеквизитовРегистрацииТабличнойЧастиДоИзменения(Объект,ИмяОбъекта,ИмяТЧ,РеквизитыТЧ);
	ТаблицаПослеИзменения = ПолучитьТаблицуРеквизитовРегистрацииТабличнойЧастиПослеИзменения(Объект,ИмяТЧ,РеквизитыТЧ);
	
	ТаблицаДоИзменения.Колонки.Добавить("ИтераторТаблицыРеквизитовРегистрации",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,0,ДопустимыйЗнак.Неотрицательный)));
	ТаблицаПослеИзменения.Колонки.Добавить("ИтераторТаблицыРеквизитовРегистрации",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,0,ДопустимыйЗнак.Неотрицательный)));
	
	Для каждого ТекущаяСтрока Из ТаблицаДоИзменения Цикл
		ТекущаяСтрока.ИтераторТаблицыРеквизитовРегистрации = 1;
	КонецЦикла;  
	
	Для каждого ТекущаяСтрока Из ТаблицаПослеИзменения Цикл
		ТекущаяСтрока.ИтераторТаблицыРеквизитовРегистрации = -1;
	КонецЦикла;  
	
	ТаблицаРезультат = ТаблицаДоИзменения.Скопировать();
	
	Для каждого ТекущаяСтрока Из ТаблицаПослеИзменения Цикл
	
		НоваяСтрока = ТаблицаРезультат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекущаяСтрока);
	
	КонецЦикла; 
	
	ТаблицаРезультат.Свернуть(РеквизитыТЧ,"ИтераторТаблицыРеквизитовРегистрации");
	
	СтруктураПоиска = Новый Структура("ИтераторТаблицыРеквизитовРегистрации",0);
	
	СтрокиТаблицы = ТаблицаРезультат.НайтиСтроки(СтруктураПоиска);
	
	Возврат СтрокиТаблицы.Количество() = ТаблицаПослеИзменения.Количество();
	
	//ВызватьИсключение;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДоИзменения",ТаблицаДоИзменения);
	Запрос.УстановитьПараметр("ТаблицаПослеИзменения",ТаблицаПослеИзменения);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	"+РеквизитыТЧ+",
		|	1 КАК ИтераторТаблицыРеквизитовРегистрации
		|ПОМЕСТИТЬ мТаблицаДоИзменения
		|ИЗ
		|	&ТаблицаДоИзменения КАК ТаблицаДоИзменения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	"+РеквизитыТЧ+",
		|	-1 КАК ИтераторТаблицыРеквизитовРегистрации
		|ПОМЕСТИТЬ мТаблицаПослеИзменения
		|ИЗ
		|	&ТаблицаПослеИзменения КАК ТаблицаПослеИзменения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	"+РеквизитыТЧ+",
		|	мТаблицаДоИзменения.ИтераторТаблицыРеквизитовРегистрации
		|ПОМЕСТИТЬ ТаблицаСравнения
		|ИЗ
		|	мТаблицаДоИзменения КАК мТаблицаДоИзменения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	"+РеквизитыТЧ+",
		|	мТаблицаПослеИзменения.ИтераторТаблицыРеквизитовРегистрации
		|ИЗ
		|	мТаблицаПослеИзменения КАК мТаблицаПослеИзменения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	"+РеквизитыТЧ+",
		|	СУММА(ТаблицаСравнения.ИтераторТаблицыРеквизитовРегистрации) КАК ИтераторТаблицыРеквизитовРегистрации
		|ПОМЕСТИТЬ ТаблицаИзменений
		|ИЗ
		|	ТаблицаСравнения КАК ТаблицаСравнения
		|
		|СГРУППИРОВАТЬ ПО
		|	"+РеквизитыТЧ+"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	"+РеквизитыТЧ+",
		|	ТаблицаИзменений.ИтераторТаблицыРеквизитовРегистрации
		|ИЗ
		|	ТаблицаИзменений КАК ТаблицаИзменений
		|ГДЕ
		|	ТаблицаИзменений.ИтераторТаблицыРеквизитовРегистрации <> 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции // КоллекцииИдентичны()

// Вычитает один массив элементов из другого массива. Возвращает результат вычитания.
//
// Параметры:
//	Массив - Массив - Исходный массив.
//	МассивВычитания - Массив - Массив, вычитаемый из исходного массива.
//
Функция СократитьМассив(Массив, МассивВычитания) Экспорт
	
	Возврат Renault_ОбщегоНазначенияКлиентСервер.СократитьМассив(Массив, МассивВычитания);
	
КонецФункции

Функция ПолучитьТаблицуРеквизитовРегистрацииТабличнойЧастиДоИзменения(Объект,ИмяОбъекта,ИмяТабличнойЧасти, РеквизитыРегистрации)

	Возврат Объект.Ссылка[ИмяТабличнойЧасти].Выгрузить(,РеквизитыРегистрации);	

КонецФункции

Функция ПолучитьТаблицуРеквизитовРегистрацииТабличнойЧастиПослеИзменения(Объект,ИмяТабличнойЧасти,РеквизитыРегистрации)

	Возврат Объект[ИмяТабличнойЧасти].Выгрузить(,РеквизитыРегистрации);	

КонецФункции // ПолучитьТаблицуРеквизитовРегистрацииТабличнойЧастиПослеИзменения()

