
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = Истина;
	
	ТипПериода = Перечисления.Renault_ТипыПериода.Месяц;
	Элементы.СписокЗаписатьИзменения.Доступность = ПараметрыСеанса.Renault_ПраваПользователя.ПравоНаСозданиеПлановПродаж;
	Элементы.Согласовать.Доступность = ПараметрыСеанса.Renault_ПраваПользователя.ПравоНаУтверждениеПлановПродаж и ЗначениеЗаполнено(Настройка);
	
	Ошибка = "";
	ЗаполнитьСписок(Ошибка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписок(Ошибка)
	
	Если Не ЗначениеЗаполнено(Настройка) Тогда
		Ошибка = "Не выбрана настройка";
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Настройка.ТипПлана) Тогда
		Ошибка = "Не задан тип плана для настройки";
		Возврат;
	КонецЕсли;
	
	Если Настройка.ТипПлана = Перечисления.Renault_ТипыПланирования.Количественный или 
		Настройка.ТипПлана = Перечисления.Renault_ТипыПланирования.Процентный Тогда
		Текст = "" +ТекстЗапросаФактКоличественный() + ТекстЗапросаРегистрПлан();
	ИначеЕсли Настройка.ТипПлана = Перечисления.Renault_ТипыПланирования.Суммовой Тогда
		Текст = "" + ТекстЗапросаФактСуммовой() + ТекстЗапросаРегистрПлан();
	ИначеЕсли Настройка.ТипПлана = Перечисления.Renault_ТипыПланирования.СуммовойНаЕдиницу Тогда
		Текст = "" + ТекстЗапросаФактСуммовойНаЕдиницу() + ТекстЗапросаРегистрПлан();
	ИначеЕсли Настройка.ТипПлана = Перечисления.Renault_ТипыПланирования.СуммаНаЭтапПродажи Тогда
		Текст = "" + ТекстЗапросаФактСуммаНаЭтап() + ТекстЗапросаРегистрПлан();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = Текст;

	Запрос.УстановитьПараметр("Этап1", Настройка.ЭтапПродаж);
	Запрос.УстановитьПараметр("Этап2", Настройка.ЭтапПродажПроцентный);
	Запрос.УстановитьПараметр("ЭтапВыполнения", Настройка.ЭтапВыполнения);
	Запрос.УстановитьПараметр("ТипПериода", Настройка.ТипПериода);
	Запрос.УстановитьПараметр("Настройка", Настройка);
	Запрос.УстановитьПараметр("ДатаНач", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", ДатаОкончания);
	Запрос.УстановитьПараметр("ЕстьОтборДЦ", Настройка.ДилерскиеЦентры);
	Запрос.УстановитьПараметр("ЕстьОтборОтделы", Настройка.Отделы);
	Запрос.УстановитьПараметр("ЕстьОтборМенеджер", Настройка.Менеджеры);
	Запрос.УстановитьПараметр("ЕстьОтборМодели", Настройка.Модели);
	Запрос.УстановитьПараметр("ЕстьОтборТипМодели", Настройка.ТипыМоделей);
	Запрос.УстановитьПараметр("ЕстьОтборГамма", Настройка.ГаммаМоделей);
	Запрос.УстановитьПараметр("ОтборДЦ", Настройка.СоставДилерскиеЦентры.ВыгрузитьКолонку("Значение"));
	Запрос.УстановитьПараметр("ОтборОтделы", Настройка.СоставОтделы.ВыгрузитьКолонку("Значение"));
	Запрос.УстановитьПараметр("ОтборМодели", Настройка.СоставМодели.ВыгрузитьКолонку("Значение"));
	Запрос.УстановитьПараметр("ОтборМенеджер", Настройка.СоставМенеджеры.ВыгрузитьКолонку("Значение"));
	Запрос.УстановитьПараметр("ОтборТипыМоделей", Настройка.СоставТипыМоделей.ВыгрузитьКолонку("Значение"));
	Запрос.УстановитьПараметр("ОтборГамма", Настройка.СоставГаммаМоделей.ВыгрузитьКолонку("Значение"));

	Результат = Запрос.Выполнить() ;
	Если не Результат.Пустой() Тогда
		результат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		ЗначениеВРеквизитФормы(результат, "Список");
		ПолучитьСтатусСогласования ();
	Иначе
		ЗаполнитьПоНастройке();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПолучитьСтатусСогласования ()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ИсторияСогласованияПлановПродаж.Согласован
	|ИЗ
	|	РегистрСведений.Renault_ИсторияСогласованияПлановПродаж КАК Renault_ИсторияСогласованияПлановПродаж
	|ГДЕ
	|	Renault_ИсторияСогласованияПлановПродаж.Настройка = &Настройка
	|	И Renault_ИсторияСогласованияПлановПродаж.ПериодПлана = &ПериодПлана";
	Запрос.УстановитьПараметр("Настройка", Настройка);
	Запрос.УстановитьПараметр("ПериодПлана", Период);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Элементы.Согласовать.Заголовок = ?(Выборка.Согласован, "Согласован", "Согласовать");
		Элементы.Согласовать.Доступность = Не Выборка.Согласован и ПараметрыСеанса.Renault_ПраваПользователя.ПравоНаУтверждениеПлановПродаж;
		Согласован = Выборка.Согласован;
		Если Согласован ТОгда
			Элементы.Согласовать.ЦветФона = WebЦвета.СветлоЗеленый;
		Иначе
			Элементы.Согласовать.цветфона =ЦветаСтиля.ЦветФонаКнопки;
		КонецЕсли;
	Иначе
		Элементы.Согласовать.Заголовок = "Согласовать";
		Элементы.Согласовать.цветфона =ЦветаСтиля.ЦветФонаКнопки;
		Элементы.Согласовать.Доступность =  ПараметрыСеанса.Renault_ПраваПользователя.ПравоНаУтверждениеПлановПродаж;
		Согласован = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьДатуПериода ( Направление = "");
	Если Настройка.ТипПериода = Перечисления.Renault_ТипыПериода.Неделя Тогда
		Если Направление = "-" Тогда
			Период = НачалоНедели(НачалоНедели(Период)-1);
			
		ИначеЕсли Направление = "+" Тогда
			Период = НачалоНедели(КонецНедели(Период)+1);
		иначе
			Период = НачалоНедели(Период);
		КонецЕсли; 
		ДатаНачала = Период;
		ДатаОкончания = КонецНедели(ДатаНачала);
		Возврат ""+НеделяГода(Период) +" неделя " +Формат(Период,"ДФ=гггг")+"г.";
	ИначеЕсли Настройка.ТипПериода = Перечисления.Renault_ТипыПериода.Месяц Тогда
		Если Направление = "-" Тогда
			Период = НачалоМесяца(НачалоМесяца(Период)-1);
		ИначеЕсли Направление = "+" Тогда
			Период = НачалоМесяца(КонецМесяца(Период)+1);
		Иначе
			Период = НачалоМесяца(Период);
		КонецЕсли;
		ДатаНачала = Период;
		ДатаОкончания = КонецМесяца(ДатаНачала);
		Возврат ""+Формат(Период,"ДФ='ММММ гггг'")+"г.";
	ИначеЕсли Настройка.ТипПериода = Перечисления.Renault_ТипыПериода.Квартал Тогда
		Если Направление = "-" Тогда
			Период = НачалоКвартала(НачалоКвартала(Период)-1);
		ИначеЕсли Направление = "+" Тогда
			Период = НачалоКвартала(КонецКвартала(Период)+1);
		Иначе
			Период = НачалоКвартала(Период);
		КонецЕсли;
		ДатаНачала = Период;
		ДатаОкончания = КонецКвартала(ДатаНачала);
		Возврат ""+Формат(Период,"ДФ=к") +" квартал " +Формат(Период,"ДФ=гггг")+"г.";
	ИначеЕсли Настройка.ТипПериода = Перечисления.Renault_ТипыПериода.Год Тогда
		Если Направление = "-" Тогда
			Период = НачалоГода(НачалоГода(Период)-1);
		ИначеЕсли Направление = "+" Тогда
			Период = НачалоГода(КонецГода(Период)+1);
		Иначе
			Период = НачалоГода(Период);
		КонецЕсли;
		ДатаНачала = Период;
		ДатаОкончания = КонецГода(ДатаНачала);
		Возврат ""+Формат(Период,"ДФ='гггг'")+"г.";
	Иначе
		Период = Дата(1,1,1); 
		ДатаНачала = Период;
		ДатаОкончания = Период;
		Возврат "Настройка не заполнена"; 
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ЭтапПродажПриИзменении(Элемент)
	Оповестить("ОбновитьСписок");
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	ЗаписатьИзмененияНаСервере ();
	Оповестить("ОбновитьСписок");
КонецПроцедуры

&НаСервере
Процедура ДеревоВТаблицу(ТаблицаЗначений, ДеревоЗначений = NULL, СтрокаДерева = NULL, КлючСвязи = NULL) Экспорт
	Если СтрокаДерева = NULL И КлючСвязи = NULL Тогда
		//ПЕРВЫЙ ВЫЗОВ ПРОЦЕДУРЫ (КОРНЕВЫЕ ЭЛЕМЕНТЫ)
		ПервыйВызов = Истина;
		ТаблицаЗначений.Очистить();
		ИсточникВыборки = ДеревоЗначений.Строки;
		КлючСвязи = 0;	// ЭЛЕМЕНТ ВЕРХНЕГО УРОВНЯ ИМЕЕТ НОМЕР СТРОКИ РОДИТЕЛЯ 0 (ОБЯЗАТЕЛЬНЫЙ РЕКВИЗИТ)
	Иначе
		//ВНУТРЕННИЙ ВЫЗОВ ПРОЦЕДУРЫ (ПОДЧИНЕННЫЕ ЭЛЕМЕНТЫ)
		ПервыйВызов = Ложь;
		ИсточникВыборки = СтрокаДерева.Строки;
	КонецЕсли;	
	Для каждого Стр из ИсточникВыборки Цикл
		Если Стр.Данные Тогда
			НС = ТаблицаЗначений.Добавить();
			Для каждого Кол из ТаблицаЗначений.Колонки Цикл
				Если Кол.Имя = "КлючСвязи" Тогда
					НС.КлючСвязи = КлючСвязи
				ИначеЕсли Кол.Имя = "НомерСтроки" Тогда
					Продолжить;
				Иначе	
					НС[Кол.Имя] = Стр[Кол.Имя];
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
		Если НЕ Стр.Строки.Количество() = 0 Тогда
			ДеревоВТаблицу(ТаблицаЗначений,, Стр, 1);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Процедура ЗаписатьИзмененияНаСервере ()
	
	ДеревоДанных = РеквизитФормыВЗначение("Список",Тип("ДеревоЗначений"));
	
	ТаблицаДанных =  Новый ТаблицаЗначений;
	Для Каждого КолонкаДерева из ДеревоДанных.Колонки Цикл
		
		ТаблицаДанных.Колонки.Добавить(КолонкаДерева.Имя, КолонкаДерева.ТипЗначения);
		
	КонецЦикла;
	
	ДеревоВТаблицу(ТаблицаДанных, ДеревоДанных);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.ДилерскиеЦентры,
	|	Таблица.Отделы,
	|	Таблица.Менеджеры,
	|	Таблица.Модели,
	|	Таблица.ТипыМоделей,
	|	Таблица.ГаммаМоделей,
	|	Таблица.Количество,
	|	Таблица.КоличествоRenault,
	|	Таблица.Регистратор,
	|	&ТипПериода КАК ТипПериода,
	|	&ПериодПлана КАК ПериодПлана,
	//|	&ЭтапПродаж КАК ЭтапПродаж,
	|	&Настройка КАК Настройка
	|ПОМЕСТИТЬ Вт_Таблица
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_ПланПродаж.Регистратор,
	|	Renault_ПланПродаж.ДилерскиеЦентры,
	//|	Renault_ПланПродаж.ЭтапПродаж,
	|	Renault_ПланПродаж.Отделы,
	|	Renault_ПланПродаж.Менеджеры,
	|	Renault_ПланПродаж.Модели,
	|	Renault_ПланПродаж.ТипыМоделей,
	|	Renault_ПланПродаж.ГаммаМоделей,
	|	Renault_ПланПродаж.Количество,
	|	Renault_ПланПродаж.КоличествоRenault
	|ПОМЕСТИТЬ ВТ_Регистр
	|ИЗ
	|	РегистрСведений.Renault_ПланПродаж КАК Renault_ПланПродаж
	|ГДЕ
	|	Renault_ПланПродаж.Регистратор В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Вт_Таблица.Регистратор
	|			ИЗ
	|				Вт_Таблица КАК Вт_Таблица)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(Вт_Таблица.ДилерскиеЦентры, ВТ_Регистр.ДилерскиеЦентры) КАК ДилерскиеЦентры,
	|	ЕСТЬNULL(Вт_Таблица.Отделы, ВТ_Регистр.Отделы) КАК Отделы,
	|	ЕСТЬNULL(Вт_Таблица.Менеджеры, ВТ_Регистр.Менеджеры) КАК Менеджеры,
	|	ЕСТЬNULL(Вт_Таблица.Модели, ВТ_Регистр.Модели) КАК Модели,
	|	ЕСТЬNULL(Вт_Таблица.ТипыМоделей, ВТ_Регистр.ТипыМоделей) КАК ТипыМоделей,
	|	ЕСТЬNULL(Вт_Таблица.ГаммаМоделей, ВТ_Регистр.ГаммаМоделей) КАК ГаммаМоделей,
	|	ЕСТЬNULL(Вт_Таблица.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(Вт_Таблица.КоличествоRenault, ВТ_Регистр.КоличествоRenault) КАК КоличествоRenault,
	|	ЕСТЬNULL(Вт_Таблица.Регистратор, ВТ_Регистр.Регистратор) КАК Регистратор,
	|	ЕСТЬNULL(Вт_Таблица.ТипПериода, &ТипПериода) КАК ТипПериода,
	|	ЕСТЬNULL(Вт_Таблица.ПериодПлана, &ПериодПлана) КАК ПериодПлана,
	//|	ЕСТЬNULL(Вт_Таблица.ЭтапПродаж, &ЭтапПродаж) КАК ЭтапПродаж,
	|	ЕСТЬNULL(Вт_Таблица.Настройка, &Настройка) КАК Настройка,
	|	ВЫБОР
	|		КОГДА ВТ_Регистр.Количество ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Изменена
	|ИЗ
	|	Вт_Таблица КАК Вт_Таблица
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Регистр КАК ВТ_Регистр
	|		ПО Вт_Таблица.Регистратор = ВТ_Регистр.Регистратор
	|			И (ВЫБОР
	|				КОГДА ВТ_Регистр.ДилерскиеЦентры ЕСТЬ NULL 
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Вт_Таблица.ДилерскиеЦентры = ВТ_Регистр.ДилерскиеЦентры
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВТ_Регистр.Отделы ЕСТЬ NULL 
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Вт_Таблица.Отделы = ВТ_Регистр.Отделы
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВТ_Регистр.Менеджеры ЕСТЬ NULL 
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Вт_Таблица.Менеджеры = ВТ_Регистр.Менеджеры
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВТ_Регистр.Модели ЕСТЬ NULL 
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Вт_Таблица.Модели = ВТ_Регистр.Модели
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВТ_Регистр.ТипыМоделей ЕСТЬ NULL 
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВТ_Регистр.ТипыМоделей = Вт_Таблица.ТипыМоделей
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВТ_Регистр.ГаммаМоделей ЕСТЬ NULL 
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВТ_Регистр.ГаммаМоделей = Вт_Таблица.ГаммаМоделей
	|			КОНЕЦ)
	|ГДЕ
	|	(ВТ_Регистр.Количество <> Вт_Таблица.Количество
	|			ИЛИ ВТ_Регистр.Количество ЕСТЬ NULL 
	|			ИЛИ Вт_Таблица.Количество ЕСТЬ NULL )
	|ИТОГИ ПО
	|	Регистратор";
	Запрос.УстановитьПараметр("Таблица", ТаблицаДанных);
//	Запрос.УстановитьПараметр("ЭтапПродаж", Настройка.ЭтапПродаж);
	Запрос.УстановитьПараметр("ТипПериода", Настройка.ТипПериода);
	Запрос.УстановитьПараметр("Настройка", Настройка);
	Запрос.УстановитьПараметр("ПериодПлана", Период);
	
	Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Результат.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Результат.Регистратор) Тогда
			ДокОбъект = Документы.Renault_ВводПланаПродаж.СоздатьДокумент();
			//ДокОбъект.ЭтапПродаж = Настройка.ЭтапПродаж;
			ДокОбъект.ТипПериода = Настройка.ТипПериода;
			ДокОбъект.Период = Период;
			ДокОбъект.Настройка = Настройка;
			ДокОбъект.Дата = ТекущаяДата();
			ДокОбъект.УстановитьНовыйНомер();
		Иначе
			ДокОбъект = Результат.Регистратор.ПолучитьОбъект();
		КонецЕсли;
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Изменена Тогда
				Отбор = Новый Структура;
				Отбор.Вставить("ДилерскиеЦентры",Выборка.ДилерскиеЦентры);
				Отбор.Вставить("Отделы",Выборка.Отделы);
				Отбор.Вставить("Менеджеры",Выборка.Менеджеры);
				Отбор.Вставить("Модели",Выборка.Модели);
				Отбор.Вставить("ТипыМоделей",Выборка.ТипыМоделей);
				Отбор.Вставить("ГаммаМоделей", Выборка.ГаммаМоделей);
				НайденаСтрока = ДокОбъект.ПланПродаж.НайтиСтроки(Отбор);
				Если НайденаСтрока.Количество () > 0 Тогда
					СтрокаТЗ = НайденаСтрока[0];
					СтрокаТЗ.Количество = Выборка.Количество;
				КонецЕсли;
			Иначе
				СтрокаТЗ = ДокОбъект.ПланПродаж.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЗ, Выборка);
			КонецЕсли;
		КонецЦикла;
		//Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//Исключение
			
		//КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписок" Тогда  
		Ошибка = "";
		ЗаполнитьСписок(Ошибка);
		Если Ошибка <> "" Тогда
			Предупреждение(Ошибка);
		КонецЕсли;
		СписокЭлементов = Список.ПолучитьЭлементы();
		Для Каждого лСтрокаЭлемента Из Список.ПолучитьЭлементы() Цикл
			Элементы.Список.Развернуть(лСтрокаЭлемента.ПолучитьИдентификатор(), Истина);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	Если Не Элемент.ТекущиеДанные.Данные или 
		Элемент.ТекущийЭлемент.Имя <> "Количество" или 
		не ПараметрыСеанса.Renault_ПраваПользователя.ПравоНаСозданиеПлановПродаж 
			или (Согласован и не ПараметрыСеанса.Renault_ПраваПользователя.ПравоНаУтверждениеПлановПродаж) Тогда 
			Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
 
	мОтбор = ПолучитьОтбор (); 
	ПересчитатьИтогиНаСервере();
	Для Каждого лСтрокаЭлемента Из Список.ПолучитьЭлементы() Цикл
		Элементы.Список.Развернуть(лСтрокаЭлемента.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	ИдентификаторСтроки = 0; 
	ПрекратитьПоиск = Ложь; 
	НайтиСтрокуДерева(Список.ПолучитьЭлементы(), мОтбор, ИдентификаторСтроки, ПрекратитьПоиск, 0); 
	Элементы.Список.ТекущаяСтрока = ИдентификаторСтроки; 
КонецПроцедуры

&НаСервере
Функция ПолучитьОтбор ()
	Отбор = Новый Структура;
	ТекДанные = Список.НайтиПоИдентификатору(Элементы.Список.ТекущаяСтрока);
	Для Каждого стрНастройка из Настройка.Порядок Цикл
		Отбор.Вставить(стрНастройка.Значение, ТекДанные[стрНастройка.Значение]);
	КонецЦикла;
	Возврат Отбор;
КонецФункции

&НаКлиенте 
Процедура НайтиСтрокуДерева(КоллекцияЭлементовДерева, ТекущиеДанные, ИдентификаторСтроки, ПрекратитьПоиск,Индекс) 
	
	Для Каждого СтрокаДерева Из КоллекцияЭлементовДерева Цикл 
		Если ПрекратитьПоиск Тогда 
			Возврат; 
		КонецЕсли; 
		Ключ = ПолучитьКлюч(Индекс, ТекущиеДанные);
		Если СтрокаДерева[Ключ] = ТекущиеДанные[Ключ] Тогда 
			если ТекущиеДанные.Количество ()-1 = Индекс Тогда
				ИдентификаторСтроки = СтрокаДерева.ПолучитьИдентификатор(); 
				ПрекратитьПоиск = Истина; 
				Возврат; 
			Иначе
				КоллекцияЭлементов = СтрокаДерева.ПолучитьЭлементы(); 
				
				Если КоллекцияЭлементов.Количество() > 0 Тогда 
					НайтиСтрокуДерева(КоллекцияЭлементов, ТекущиеДанные, ИдентификаторСтроки, ПрекратитьПоиск, Индекс+1); 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
 
	КонецЦикла; 
	
КонецПроцедуры 

&НаКлиенте 
Функция ПолучитьКлюч (Индекс, ТекущиеДанные)
	х=0;
	Для Каждого стрСоответствие из ТекущиеДанные Цикл
		Если х = Индекс Тогда
			Возврат стрСоответствие.Ключ;
		КонецЕсли;
		х=х+1
	КонецЦикла;
	Возврат "";
	
КонецФункции

&НаСервере
Процедура  ПересчитатьИтогиНаСервере ()
	Дерево = РеквизитФормыВЗначение("Список", Тип("ДеревоЗначений"));
	соотвКолонок = Новый Соответствие;
	соотвКолонок.Вставить("Количество");
	СчитатьСуммыДЗ(Дерево.Строки, соотвКолонок); 
	ЗначениеВРеквизитФормы(Дерево, "Список");
КонецПроцедуры

&НаСервере
Процедура СчитатьСуммыДЗ(пСтрокиДЗ, пСуммы) Экспорт
	Для Каждого лСтр Из пСтрокиДЗ Цикл
		//если уровень группировок - высчитываем итог
		
		Если лСтр.Строки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СчитатьСуммыДЗ(лСтр.Строки, пСуммы);
		Для Каждого лЗн Из пСуммы Цикл
			лСтр[лЗн.Ключ] = лСтр.Строки.Итог(лЗн.Ключ);
		КонецЦикла; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	Если ЗначениеЗаполнено(Настройка) Тогда
		ЗаполнитьПоНастройке();
	КонецЕсли;
	СписокЭлементов = Список.ПолучитьЭлементы();
	Если СписокЭлементов.Количество() > 0 Тогда
		Для Каждого лСтрокаЭлемента Из Список.ПолучитьЭлементы() Цикл
			Элементы.Список.Развернуть(лСтрокаЭлемента.ПолучитьИдентификатор(), Истина);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоНастройке ()
	
	Если Настройка.ТипПлана = Перечисления.Renault_ТипыПланирования.Количественный Тогда
		Результат = ПолучитьДЗДляКоличественного ();
	ИначеЕсли Настройка.ТипПлана = Перечисления.Renault_ТипыПланирования.Процентный Тогда
		Результат = ПолучитьДЗДляПроцентрого ();
	ИначеЕсли Настройка.ТипПлана = Перечисления.Renault_ТипыПланирования.Суммовой Тогда 
		Результат = ПолучитьДЗДляСуммового();
	ИначеЕсли Настройка.ТипПлана = Перечисления.Renault_ТипыПланирования.СуммовойНаЕдиницу Тогда 
		Результат = ПолучитьДЗДляСуммовойНаЕдиницу();
	ИначеЕсли Настройка.ТипПлана = Перечисления.Renault_ТипыПланирования.СуммаНаЭтапПродажи Тогда
		Результат = ПолучитьДЗДляСуммыНаЭтап();
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(Результат, "Список");
	Элементы.Согласовать.Доступность = Ложь;
	Элементы.Согласовать.ЦветФона=ЦветаСтиля.ЦветФонаКнопки;
	Элементы.Согласовать.Заголовок = "Согласовать";
	Согласован = Ложь;

КонецПроцедуры  

&НаСервере 
Функция ТекстЗапросаФактКоличественный ()
	Текст = "ВЫБРАТЬ
	|	ВложенныйЗапрос.Модели,
	|	ВложенныйЗапрос.ДилерскиеЦентры,
	|	ВложенныйЗапрос.ЭтапПродаж,
	|	ВложенныйЗапрос.Отделы,
	|	ВложенныйЗапрос.Менеджеры,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ЭтапПродаж = &Этап1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Поле1,
	|	ДопИнформацияГаммаМодели.Гамма КАК ГаммаМоделей,
	|	ДопИнформацияТипМодели.ТипМодели КАК ТипыМоделей,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ЭтапПродаж = &Этап2
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Поле2
	|ПОМЕСТИТЬ СтатистикаВрем
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА Renault_СтатистикаВыполненияЭтаповПродаж.Модель ЕСТЬ NULL 
	|					ИЛИ Renault_СтатистикаВыполненияЭтаповПродаж.Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
	|				ТОГДА ВЫБОР
	|						КОГДА Renault_РабочиеЛисты.ПервичныйИнтересМодель.Модель ЕСТЬ NULL 
	|							ТОГДА ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
	|						ИНАЧЕ Renault_РабочиеЛисты.ПервичныйИнтересМодель.Модель
	|					КОНЕЦ
	|			ИНАЧЕ Renault_СтатистикаВыполненияЭтаповПродаж.Модель
	|		КОНЕЦ КАК Модели,
	|		ВЫБОР
	|			КОГДА Renault_СтатистикаВыполненияЭтаповПродаж.ДилерскийЦентр ЕСТЬ NULL 
	|				ТОГДА ВЫБОР
	|						КОГДА Renault_РабочиеЛисты.ДилерскийЦентр ЕСТЬ NULL 
	|							ТОГДА ЗНАЧЕНИЕ(Справочник.CRM_ДилерскиеЦентры.ПустаяСсылка)
	|						ИНАЧЕ Renault_РабочиеЛисты.ДилерскийЦентр
	|					КОНЕЦ
	|			ИНАЧЕ Renault_СтатистикаВыполненияЭтаповПродаж.ДилерскийЦентр
	|		КОНЕЦ КАК ДилерскиеЦентры,
	|		Renault_СтатистикаВыполненияЭтаповПродаж.ЭтапПродаж КАК ЭтапПродаж,
	|		Renault_РабочиеЛисты.Отдел КАК Отделы,
	|		Renault_РабочиеЛисты.Сотрудник КАК Менеджеры,
	|		Renault_СтатистикаВыполненияЭтаповПродаж.IDK КАК IDK
	|	ИЗ
	|		РегистрСведений.Renault_СтатистикаВыполненияЭтаповПродаж КАК Renault_СтатистикаВыполненияЭтаповПродаж
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				Renault_РабочиеЛисты.IDK КАК IDK,
	|				Renault_РабочиеЛисты.ДилерскийЦентр КАК ДилерскийЦентр,
	|				ВЫБОР
	|					КОГДА Renault_РабочиеЛисты.Сотрудник ЕСТЬ NULL 
	|						ТОГДА Renault_Трафик.Менеджер
	|					ИНАЧЕ Renault_РабочиеЛисты.Сотрудник
	|				КОНЕЦ КАК Сотрудник,
	|				Renault_РабочиеЛисты.ПервичныйИнтересМодель КАК ПервичныйИнтересМодель,
	|				ВЫБОР
	|					КОГДА Renault_РабочиеЛисты.Отдел ЕСТЬ NULL 
	|						ТОГДА Renault_Трафик.Отдел
	|					ИНАЧЕ Renault_РабочиеЛисты.Отдел
	|				КОНЕЦ КАК Отдел
	|			ИЗ
	|				РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_Трафик КАК Renault_Трафик
	|					ПО Renault_РабочиеЛисты.IDТрафика = Renault_Трафик.Идентификатор) КАК Renault_РабочиеЛисты
	|			ПО Renault_СтатистикаВыполненияЭтаповПродаж.IDK = Renault_РабочиеЛисты.IDK
	|	ГДЕ
	|		Renault_СтатистикаВыполненияЭтаповПродаж.ДатаВыполнения >= &ДатаНач
	|		И Renault_СтатистикаВыполненияЭтаповПродаж.ДатаВыполнения <= &ДатаКон
	|		И ВЫБОР
	|				КОГДА &ЕстьОтборМенеджер = ЛОЖЬ
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Renault_РабочиеЛисты.Сотрудник В (&ОтборМенеджер)
	|			КОНЕЦ
	|		И ВЫБОР
	|				КОГДА &ЕстьОтборМодели = ЛОЖЬ
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Renault_СтатистикаВыполненияЭтаповПродаж.Модель ЕСТЬ NULL 
	|								ИЛИ Renault_СтатистикаВыполненияЭтаповПродаж.Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
	|							ТОГДА ВЫБОР
	|									КОГДА Renault_РабочиеЛисты.ПервичныйИнтересМодель.Модель ЕСТЬ NULL 
	|										ТОГДА ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
	|									ИНАЧЕ Renault_РабочиеЛисты.ПервичныйИнтересМодель.Модель
	|								КОНЕЦ
	|						ИНАЧЕ Renault_СтатистикаВыполненияЭтаповПродаж.Модель
	|					КОНЕЦ В (&ОтборМодели)
	|			КОНЕЦ
	|		И ВЫБОР
	|				КОГДА &ЕстьОтборДЦ = ЛОЖЬ
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Renault_СтатистикаВыполненияЭтаповПродаж.ДилерскийЦентр ЕСТЬ NULL 
	|							ТОГДА ВЫБОР
	|									КОГДА Renault_РабочиеЛисты.ДилерскийЦентр ЕСТЬ NULL 
	|										ТОГДА ЗНАЧЕНИЕ(Справочник.CRM_ДилерскиеЦентры.ПустаяСсылка)
	|									ИНАЧЕ Renault_РабочиеЛисты.ДилерскийЦентр
	|								КОНЕЦ
	|						ИНАЧЕ Renault_СтатистикаВыполненияЭтаповПродаж.ДилерскийЦентр
	|					КОНЕЦ В (&ОтборДЦ)
	|			КОНЕЦ
	|		И ВЫБОР
	|				КОГДА &ЕстьОтборОтделы = ЛОЖЬ
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Renault_РабочиеЛисты.Отдел В (&ОтборОтделы)
	|			КОНЕЦ
	|		И (Renault_СтатистикаВыполненияЭтаповПродаж.ЭтапПродаж = &Этап1 или 
	|			Renault_СтатистикаВыполненияЭтаповПродаж.ЭтапПродаж = &Этап2)) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ДопИнформацияПоМоделям КАК ДопИнформацияТипМодели
	|		ПО ВложенныйЗапрос.Модели = ДопИнформацияТипМодели.Модель
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ДопИнформацияПоМоделям КАК ДопИнформацияГаммаМодели
	|		ПО ВложенныйЗапрос.Модели = ДопИнформацияГаммаМодели.Модель
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ЕстьОтборТипМодели = ЛОЖЬ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ДопИнформацияТипМодели.ТипМодели В (&ОтборТипыМоделей)
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьОтборГамма = ЛОЖЬ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ДопИнформацияГаммаМодели.Гамма В (&ОтборГамма)
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	//КолФакт
	|	//Статистика
	|ПОМЕСТИТЬ ВТ_Статистика
	|ИЗ
	|	СтатистикаВрем КАК СтатистикаВрем
	|
	|СГРУППИРОВАТЬ ПО
	|	//Статистика
	|;";
	
	ТекстСтатистика = "";
	ТекстКоличество = "";
	Если Настройка.ТипПлана = Перечисления.Renault_ТипыПланирования.Количественный Тогда
		ТекстКоличество = "СУММА(СтатистикаВрем.Поле1) как КоличествоФакт,";
	ИначеЕсли Настройка.ТипПлана = Перечисления.Renault_ТипыПланирования.Процентный Тогда
		ТекстКоличество = 	"ВЫБОР
							|	КОГДА СУММА(СтатистикаВрем.Поле2) = 0
							|		ИЛИ СУММА(СтатистикаВрем.Поле1) = 0
							|			ТОГДА 0
							|	ИНАЧЕ СУММА(СтатистикаВрем.Поле1) / СУММА(СтатистикаВрем.Поле2) * 100
							|КОНЕЦ КАК КоличествоФакт," ;
	КонецЕсли;
	
	Для Каждого СтрокаПорядок из Настройка.Порядок Цикл
		ТекстСтатистика = ТекстСтатистика +"СтатистикаВрем."+ СтрокаПорядок.Значение +",";
	КонецЦикла;
	Текст = СтрЗаменить(Текст,"//КолФакт",ТекстКоличество); 
	Текст = СтрЗаменить(Текст,"//Статистика", Лев(ТекстСтатистика, СтрДлина(ТекстСтатистика)-1));
	Возврат Текст;
КонецФункции

&НаСервере 
Функция ТекстЗапросаФактСуммовой ()
	Текст = 
	"ВЫБРАТЬ
	|	Renault_ФактВыполненияЭтаповПланированияОбороты.ДилерскийЦентр ДилерскиеЦентры,
	|	Renault_ФактВыполненияЭтаповПланированияОбороты.Отдел Отделы,
	|	Renault_ФактВыполненияЭтаповПланированияОбороты.Менеджер Менеджеры,
	|	Renault_ФактВыполненияЭтаповПланированияОбороты.Модель Модели,
	|	Renault_ФактВыполненияЭтаповПланированияОбороты.Этап ,
	|	Renault_ФактВыполненияЭтаповПланированияОбороты.ПоказательОборот,
	|	Renault_ДопИнформацияГаммаМодели.Гамма ГаммаМоделей,
	|	Renault_ДопИнформацияТипыМодели.ТипМодели ТипыМоделей
	|Поместить ВТ_Факт
	|ИЗ
	|	РегистрНакопления.Renault_ФактВыполненияЭтаповПланирования.Обороты(
	|			&ДатаНач,
	|			&ДатаКон,
	|			,
	|			ВЫБОР
	|					КОГДА &ЕстьОтборМенеджер = ЛОЖЬ
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Менеджер В (&ОтборМенеджер)
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьОтборДЦ = ЛОЖЬ
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ДилерскийЦентр В (&ОтборДЦ)
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьОтборМодели = ЛОЖЬ
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Модель В (&ОтборМодели)
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьОтборОтделы = ЛОЖЬ
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Отдел В (&ОтборОтделы)
	|				КОНЕЦ
	|				И Этап = &ЭтапВыполнения) КАК Renault_ФактВыполненияЭтаповПланированияОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ДопИнформацияПоМоделям КАК Renault_ДопИнформацияТипыМодели
	|		ПО Renault_ФактВыполненияЭтаповПланированияОбороты.Модель = Renault_ДопИнформацияТипыМодели.Модель
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ДопИнформацияПоМоделям КАК Renault_ДопИнформацияГаммаМодели
	|		ПО Renault_ФактВыполненияЭтаповПланированияОбороты.Модель = Renault_ДопИнформацияГаммаМодели.Модель
	|ГДЕ
	|	ВЫБОР
	|				КОГДА &ЕстьОтборТипМодели = ЛОЖЬ
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Renault_ДопИнформацияТипыМодели.ТипМодели В (&ОтборТипыМоделей)
	|			КОНЕЦ
	|			И ВЫБОР
	|				КОГДА &ЕстьОтборГамма = ЛОЖЬ
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Renault_ДопИнформацияГаммаМодели.Гамма В (&ОтборГамма)
	|			КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	//КолФакт
	|	//Статистика
	|ПОМЕСТИТЬ ВТ_Статистика
	|ИЗ
	|	ВТ_Факт КАК ВТ_Факт
	|
	|СГРУППИРОВАТЬ ПО
	|	//Статистика
	|;";
	
	ТекстСтатистика = "";
	ТекстКоличество = "";
	Если Настройка.ТипПлана = Перечисления.Renault_ТипыПланирования.Суммовой Тогда
		ТекстКоличество = "СУММА(ВТ_Факт.ПоказательОборот) как КоличествоФакт,";
	ИначеЕсли Настройка.ТипПлана = Перечисления.Renault_ТипыПланирования.Процентный Тогда
		ТекстКоличество = 	"ВЫБОР
							|	КОГДА СУММА(СтатистикаВрем.Поле2) = 0
							|		ИЛИ СУММА(СтатистикаВрем.Поле1) = 0
							|			ТОГДА 0
							|	ИНАЧЕ СУММА(СтатистикаВрем.Поле1) / СУММА(СтатистикаВрем.Поле2) * 100
							|КОНЕЦ КАК КоличествоФакт," ;
	КонецЕсли;
	
	Для Каждого СтрокаПорядок из Настройка.Порядок Цикл
		ТекстСтатистика = ТекстСтатистика +"ВТ_Факт."+ СтрокаПорядок.Значение +",";
	КонецЦикла;
	Текст = СтрЗаменить(Текст,"//КолФакт",ТекстКоличество); 
	Текст = СтрЗаменить(Текст,"//Статистика", Лев(ТекстСтатистика, СтрДлина(ТекстСтатистика)-1));
	
	Возврат Текст;
КонецФункции

&НаСервере 
Функция ТекстЗапросаФактСуммовойНаЕдиницу ()
	Текст = 
	"ВЫБРАТЬ
	|	Renault_ФактВыполненияЭтаповПланирования.ДилерскийЦентр КАК ДилерскиеЦентры,
	|	Renault_ФактВыполненияЭтаповПланирования.Отдел КАК Отделы,
	|	Renault_ФактВыполненияЭтаповПланирования.Менеджер КАК Менеджеры,
	|	Renault_ФактВыполненияЭтаповПланирования.Модель КАК Модели,
	|	Renault_ФактВыполненияЭтаповПланирования.Этап,
	|	Renault_ДопИнформацияГаммаМодели.Гамма КАК ГаммаМоделей,
	|	Renault_ДопИнформацияТипыМодели.ТипМодели КАК ТипыМоделей,
	|	Renault_ФактВыполненияЭтаповПланирования.Показатель
	|ПОМЕСТИТЬ ВТ_Факт
	|ИЗ
	|	РегистрНакопления.Renault_ФактВыполненияЭтаповПланирования КАК Renault_ФактВыполненияЭтаповПланирования
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ДопИнформацияПоМоделям КАК Renault_ДопИнформацияТипыМодели
	|		ПО Renault_ФактВыполненияЭтаповПланирования.Модель = Renault_ДопИнформацияТипыМодели.Модель
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ДопИнформацияПоМоделям КАК Renault_ДопИнформацияГаммаМодели
	|		ПО Renault_ФактВыполненияЭтаповПланирования.Модель = Renault_ДопИнформацияГаммаМодели.Модель
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ЕстьОтборМенеджер = ЛОЖЬ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Renault_ФактВыполненияЭтаповПланирования.Менеджер В (&ОтборМенеджер)
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьОтборДЦ = ЛОЖЬ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Renault_ФактВыполненияЭтаповПланирования.ДилерскийЦентр В (&ОтборДЦ)
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьОтборМодели = ЛОЖЬ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Renault_ФактВыполненияЭтаповПланирования.Модель В (&ОтборМодели)
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьОтборОтделы = ЛОЖЬ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Renault_ФактВыполненияЭтаповПланирования.Отдел В (&ОтборОтделы)
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьОтборТипМодели = ЛОЖЬ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Renault_ДопИнформацияТипыМодели.ТипМодели В (&ОтборТипыМоделей)
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьОтборГамма = ЛОЖЬ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Renault_ДопИнформацияГаммаМодели.Гамма В (&ОтборГамма)
	|		КОНЕЦ
	|	И Renault_ФактВыполненияЭтаповПланирования.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И Renault_ФактВыполненияЭтаповПланирования.Этап = &ЭтапВыполнения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_Факт.Показатель) / КОЛИЧЕСТВО(ВТ_Факт.Показатель) КАК КоличествоФакт,
	|	//Статистика
	|ПОМЕСТИТЬ ВТ_Статистика
	|ИЗ
	|	ВТ_Факт КАК ВТ_Факт
	|СГРУППИРОВАТЬ ПО
	|	//Статистика
	|;";
	
	ТекстСтатистика = "";
	
	Для Каждого СтрокаПорядок из Настройка.Порядок Цикл
		ТекстСтатистика = ТекстСтатистика +"ВТ_Факт."+ СтрокаПорядок.Значение +",";
	КонецЦикла;
	Текст = СтрЗаменить(Текст,"//Статистика", Лев(ТекстСтатистика, СтрДлина(ТекстСтатистика)-1));
	
	Возврат Текст;
КонецФункции

&НаСервере 
Функция ТекстЗапросаНастройки ()
	
	Текст ="
	|ВЫБРАТЬ
	|	ДилерскиеЦентры.ДилерскийЦентр,
	|	Менеджеры.Менеджер,
	|	Отделы.Отдел,
	|	Модели.Модель,
	|	ТипыМоделей.ТипМодели,
	|	ГаммыМоделей.ГаммаМодели,
	|	""Истина"" КАК Данные,
	|	0 КАК КоличествоRenault,
	|	0 КАК Количество,
	|	0 КАК КоличествоФакт
	|ПОМЕСТИТЬ Вт_Вся
	|ИЗ
	|	(ВЫБРАТЬ
	|		Renault_НастройкиПланаПродажСоставДилерскиеЦентры.Значение КАК ДилерскийЦентр
	|	ИЗ
	|		Справочник.Renault_НастройкиПланаПродаж.СоставДилерскиеЦентры КАК Renault_НастройкиПланаПродажСоставДилерскиеЦентры
	|	ГДЕ
	|		Renault_НастройкиПланаПродажСоставДилерскиеЦентры.Ссылка = &Ссылка) КАК ДилерскиеЦентры
	|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Renault_НастройкиПланаПродажСоставДилерскиеЦентры.Значение КАК Менеджер
	|		ИЗ
	|			Справочник.Renault_НастройкиПланаПродаж.СоставМенеджеры КАК Renault_НастройкиПланаПродажСоставДилерскиеЦентры
	|		ГДЕ
	|			Renault_НастройкиПланаПродажСоставДилерскиеЦентры.Ссылка = &Ссылка) КАК Менеджеры
	|		ПО (ИСТИНА)
	|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Renault_НастройкиПланаПродажСоставДилерскиеЦентры.Значение КАК Отдел
	|		ИЗ
	|			Справочник.Renault_НастройкиПланаПродаж.СоставОтделы КАК Renault_НастройкиПланаПродажСоставДилерскиеЦентры
	|		ГДЕ
	|			Renault_НастройкиПланаПродажСоставДилерскиеЦентры.Ссылка = &Ссылка) КАК Отделы
	|		ПО (ИСТИНА)
	|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Renault_НастройкиПланаПродажСоставДилерскиеЦентры.Значение КАК Модель
	|		ИЗ
	|			Справочник.Renault_НастройкиПланаПродаж.СоставМодели КАК Renault_НастройкиПланаПродажСоставДилерскиеЦентры
	|		ГДЕ
	|			Renault_НастройкиПланаПродажСоставДилерскиеЦентры.Ссылка = &Ссылка) КАК Модели
	|		ПО (ИСТИНА)
	|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Renault_НастройкиПланаПродажСоставДилерскиеЦентры.Значение КАК ТипМодели
	|		ИЗ
	|			Справочник.Renault_НастройкиПланаПродаж.СоставТипыМоделей КАК Renault_НастройкиПланаПродажСоставДилерскиеЦентры
	|		ГДЕ
	|			Renault_НастройкиПланаПродажСоставДилерскиеЦентры.Ссылка = &Ссылка) КАК ТипыМоделей
	|		ПО (ИСТИНА)
	|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Renault_НастройкиПланаПродажСоставГаммаМоделей.Значение КАК ГаммаМодели
	|		ИЗ
	|			Справочник.Renault_НастройкиПланаПродаж.СоставГаммаМоделей КАК Renault_НастройкиПланаПродажСоставГаммаМоделей
	|		ГДЕ
	|			Renault_НастройкиПланаПродажСоставГаммаМоделей.Ссылка = &Ссылка) КАК ГаммыМоделей
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт_вся.ДилерскийЦентр ДилерскиеЦентры,
	|	Вт_вся.Отдел Отделы,
	|	Вт_вся.Менеджер Менеджеры,
	|	Вт_вся.ТипМодели ТипыМоделей,
	|	Вт_вся.Модель Модели,
	|	Вт_вся.ГаммаМодели ГаммаМоделей,
	|	Вт_вся.Данные,
	|	Вт_вся.КоличествоRenault,
	|	Вт_вся.Количество,
	|	Вт_вся.КоличествоФакт,
	|	"""" Регистратор
	|ПОМЕСТИТЬ ВТ_Настройка
	|ИЗ
	|	Вт_Вся КАК Вт_вся
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|		ПО Вт_вся.Менеджер = Renault_ПользователиИШаблоныПравИНастроек.Пользователь.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ДопИнформацияПоМоделям КАК ТипыМоделей
	|		ПО Вт_вся.Модель = ТипыМоделей.Модель
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ДопИнформацияПоМоделям КАК ГаммыМоделей
	|		ПО Вт_вся.Модель = ГаммыМоделей.Модель
	|ГДЕ
	|	(Вт_вся.ДилерскийЦентр = Вт_вся.Отдел.ДилерскийЦентр
	|			ИЛИ Вт_вся.ДилерскийЦентр ЕСТЬ NULL 
	|			ИЛИ Вт_вся.Отдел ЕСТЬ NULL )
	|	И (Вт_вся.ДилерскийЦентр = Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ДилерскийЦентр
	|			ИЛИ Вт_вся.ДилерскийЦентр ЕСТЬ NULL или  Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки ЕСТЬ NULL) 
	|	И (Вт_вся.Отдел = Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.Отдел
	|			ИЛИ Вт_вся.Отдел ЕСТЬ NULL или  Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки ЕСТЬ NULL)
	|	И (Вт_вся.ГаммаМодели = ГаммыМоделей.Гамма
	|			ИЛИ Вт_вся.ГаммаМодели ЕСТЬ NULL ИЛИ Вт_вся.Модель ЕСТЬ NULL )
	|	И (Вт_вся.ТипМодели = ТипыМоделей.ТипМодели
	|			ИЛИ Вт_вся.ТипМодели ЕСТЬ NULL ИЛИ Вт_вся.Модель ЕСТЬ NULL)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Настройка.ДилерскиеЦентры ДилерскиеЦентры,
	|	ВТ_Настройка.Менеджеры Менеджеры,
	|	ВТ_Настройка.Модели Модели,
	|	ВТ_Настройка.Отделы Отделы,
	|	ВТ_Настройка.ТипыМоделей ТипыМоделей,
	|	ВТ_Настройка.ГаммаМоделей ГаммаМоделей,
	|	ВТ_Настройка.Данные Данные,
	|	ВТ_Настройка.Регистратор Регистратор,
	|	ВТ_Настройка.КоличествоRenault КоличествоRenault,
	|	ВТ_Настройка.Количество Количество,
	|	ВТ_Статистика.КоличествоФакт КоличествоФакт
	|ИЗ
	|	ВТ_Настройка КАК ВТ_Настройка
	|		левое СОЕДИНЕНИЕ ВТ_Статистика КАК ВТ_Статистика
	|		ПО //Соединение
	|//ОБЛАСТЬ ИТОГИ";
	
	ТекстИтог = "ИТОГИ СУММА(Количество),СУММА(КоличествоRenault), сумма(КоличествоФакт) ПО ";
	ТекстСоединения = "";
	Для Каждого СтрокаПорядок из Настройка.Порядок Цикл
		ТекстИтог = ТекстИтог  + ?(СтрокаПорядок.НомерСтроки <> Настройка.Порядок.Количество(),СтрокаПорядок.Значение+ ",","");
		ТекстСоединения = ТекстСоединения +" "+"ВТ_Настройка."+СтрокаПорядок.Значение +" = ВТ_Статистика." +СтрокаПорядок.Значение +" и";
	КонецЦикла;
	Текст = СтрЗаменить(Текст,"//Соединение", Лев(ТекстСоединения, СтрДлина(ТекстСоединения)-1));
	Если Настройка.Порядок.Количество() > 1 Тогда 
		Текст = СтрЗаменить(Текст,"//ОБЛАСТЬ ИТОГИ", Лев(ТекстИтог, СтрДлина(ТекстИтог)-1));
	КонецЕсли;
	
	Возврат Текст;
КонецФункции

&НаСервере
Функция  ТекстЗапросаРегистрПлан ()
	Текст = "
	|ВЫБРАТЬ
	|	Renault_ПланПродаж.Регистратор КАК Регистратор,
	|	Renault_ПланПродаж.ДилерскиеЦентры КАК ДилерскиеЦентры,
	|	Renault_ПланПродаж.Отделы КАК Отделы,
	|	Renault_ПланПродаж.Менеджеры КАК Менеджеры,
	|	Renault_ПланПродаж.Модели КАК Модели,
	|	Renault_ПланПродаж.ТипыМоделей КАК ТипыМоделей,
	|	Renault_ПланПродаж.ГаммаМоделей КАК ГаммаМоделей,
	|	Renault_ПланПродаж.Количество КАК Количество,
	|	Renault_ПланПродаж.КоличествоRenault КАК КоличествоRenault,
	|	ВТ_Статистика.КоличествоФакт КоличествоФакт,
	|	""Истина"" КАК Данные
	|ИЗ
	|	РегистрСведений.Renault_ПланПродаж КАК Renault_ПланПродаж
	|		левое СОЕДИНЕНИЕ ВТ_Статистика КАК ВТ_Статистика
	|		ПО //Соединение
	|ГДЕ
	|	Renault_ПланПродаж.ПериодПлан = &ДатаНач
	|	И Renault_ПланПродаж.ТипПериода = &ТипПериода
	//|	И Renault_ПланПродаж.ЭтапПродаж = &Этап1
	|	и Renault_ПланПродаж.Настройка = &Настройка
	|//Итоги";
	ТекстСоединения = "";
	ТекстИтог = "ИТОГИ СУММА(Количество),СУММА(КоличествоRenault), СУММА(КоличествоФакт) ПО ";
	Для Каждого СтрокаПорядок из Настройка.Порядок Цикл
		ТекстИтог = ТекстИтог  + ?(СтрокаПорядок.НомерСтроки <> Настройка.Порядок.Количество(),СтрокаПорядок.Значение+ ",","");
		ТекстСоединения = ТекстСоединения +" "+"Renault_ПланПродаж."+СтрокаПорядок.Значение +" = ВТ_Статистика." +СтрокаПорядок.Значение +" и";
	КонецЦикла;
	Текст = СтрЗаменить(Текст,"//Соединение", Лев(ТекстСоединения, СтрДлина(ТекстСоединения)-1));
	Если Настройка.Порядок.Количество() > 1 Тогда
		Текст = СтрЗаменить(Текст,"//Итоги", Лев(ТекстИтог, СтрДлина(ТекстИтог)-1));
	КонецЕсли;
	
	Возврат Текст;
КонецФункции

&НаСервере 
Функция ТекстЗапросаФактСуммаНаЭтап ()
	
	Текст = 
	"ВЫБРАТЬ
	|	Renault_ФактВыполненияЭтаповПланированияОбороты.ДилерскийЦентр КАК ДилерскиеЦентры,
	|	Renault_ФактВыполненияЭтаповПланированияОбороты.Отдел КАК Отделы,
	|	Renault_ФактВыполненияЭтаповПланированияОбороты.Менеджер КАК Менеджеры,
	|	Renault_ФактВыполненияЭтаповПланированияОбороты.Модель КАК Модели,
	|	Renault_ФактВыполненияЭтаповПланированияОбороты.ПоказательОборот,
	|	Renault_ДопИнформацияГаммаМодели.Гамма КАК ГаммаМоделей,
	|	Renault_ДопИнформацияТипыМодели.ТипМодели КАК ТипыМоделей,
	|	NULL КАК Количество
	|ПОМЕСТИТЬ ВТ_Факт
	|ИЗ
	|	РегистрНакопления.Renault_ФактВыполненияЭтаповПланирования.Обороты(
	|			&ДатаНач,
	|			&ДатаКон,
	|			,
	|			ВЫБОР
	|					КОГДА &ЕстьОтборМенеджер = ЛОЖЬ
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Менеджер В (&ОтборМенеджер)
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьОтборДЦ = ЛОЖЬ
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ДилерскийЦентр В (&ОтборДЦ)
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьОтборМодели = ЛОЖЬ
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Модель В (&ОтборМодели)
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьОтборОтделы = ЛОЖЬ
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Отдел В (&ОтборОтделы)
	|				КОНЕЦ
	|				И Этап = &ЭтапВыполнения) КАК Renault_ФактВыполненияЭтаповПланированияОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ДопИнформацияПоМоделям КАК Renault_ДопИнформацияТипыМодели
	|		ПО Renault_ФактВыполненияЭтаповПланированияОбороты.Модель = Renault_ДопИнформацияТипыМодели.Модель
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ДопИнформацияПоМоделям КАК Renault_ДопИнформацияГаммаМодели
	|		ПО Renault_ФактВыполненияЭтаповПланированияОбороты.Модель = Renault_ДопИнформацияГаммаМодели.Модель
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ЕстьОтборТипМодели = ЛОЖЬ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Renault_ДопИнформацияТипыМодели.ТипМодели В (&ОтборТипыМоделей)
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьОтборГамма = ЛОЖЬ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Renault_ДопИнформацияГаммаМодели.Гамма В (&ОтборГамма)
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ДилерскиеЦентры,
	|	ВложенныйЗапрос.Отделы,
	|	ВложенныйЗапрос.Менеджеры,
	|	ВложенныйЗапрос.Модели,
	|	NULL,
	|	ДопИнформацияГаммаМодели.Гамма,
	|	ДопИнформацияТипМодели.ТипМодели,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ЭтапПродаж = &Этап1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА Renault_СтатистикаВыполненияЭтаповПродаж.Модель ЕСТЬ NULL 
	|					ИЛИ Renault_СтатистикаВыполненияЭтаповПродаж.Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
	|				ТОГДА ВЫБОР
	|						КОГДА Renault_РабочиеЛисты.ПервичныйИнтересМодель.Модель ЕСТЬ NULL 
	|							ТОГДА ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
	|						ИНАЧЕ Renault_РабочиеЛисты.ПервичныйИнтересМодель.Модель
	|					КОНЕЦ
	|			ИНАЧЕ Renault_СтатистикаВыполненияЭтаповПродаж.Модель
	|		КОНЕЦ КАК Модели,
	|		ВЫБОР
	|			КОГДА Renault_СтатистикаВыполненияЭтаповПродаж.ДилерскийЦентр ЕСТЬ NULL 
	|				ТОГДА ВЫБОР
	|						КОГДА Renault_РабочиеЛисты.ДилерскийЦентр ЕСТЬ NULL 
	|							ТОГДА ЗНАЧЕНИЕ(Справочник.CRM_ДилерскиеЦентры.ПустаяСсылка)
	|						ИНАЧЕ Renault_РабочиеЛисты.ДилерскийЦентр
	|					КОНЕЦ
	|			ИНАЧЕ Renault_СтатистикаВыполненияЭтаповПродаж.ДилерскийЦентр
	|		КОНЕЦ КАК ДилерскиеЦентры,
	|		Renault_СтатистикаВыполненияЭтаповПродаж.ЭтапПродаж КАК ЭтапПродаж,
	|		Renault_РабочиеЛисты.Отдел КАК Отделы,
	|		Renault_РабочиеЛисты.Сотрудник КАК Менеджеры,
	|		Renault_СтатистикаВыполненияЭтаповПродаж.IDK КАК IDK
	|	ИЗ
	|		РегистрСведений.Renault_СтатистикаВыполненияЭтаповПродаж КАК Renault_СтатистикаВыполненияЭтаповПродаж
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				Renault_РабочиеЛисты.IDK КАК IDK,
	|				Renault_РабочиеЛисты.ДилерскийЦентр КАК ДилерскийЦентр,
	|				ВЫБОР
	|					КОГДА Renault_РабочиеЛисты.Сотрудник ЕСТЬ NULL 
	|						ТОГДА Renault_Трафик.Менеджер
	|					ИНАЧЕ Renault_РабочиеЛисты.Сотрудник
	|				КОНЕЦ КАК Сотрудник,
	|				Renault_РабочиеЛисты.ПервичныйИнтересМодель КАК ПервичныйИнтересМодель,
	|				ВЫБОР
	|					КОГДА Renault_РабочиеЛисты.Отдел ЕСТЬ NULL 
	|						ТОГДА Renault_Трафик.Отдел
	|					ИНАЧЕ Renault_РабочиеЛисты.Отдел
	|				КОНЕЦ КАК Отдел
	|			ИЗ
	|				РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_Трафик КАК Renault_Трафик
	|					ПО Renault_РабочиеЛисты.IDТрафика = Renault_Трафик.Идентификатор) КАК Renault_РабочиеЛисты
	|			ПО Renault_СтатистикаВыполненияЭтаповПродаж.IDK = Renault_РабочиеЛисты.IDK
	|	ГДЕ
	|		Renault_СтатистикаВыполненияЭтаповПродаж.ДатаВыполнения >= &ДатаНач
	|		И Renault_СтатистикаВыполненияЭтаповПродаж.ДатаВыполнения <= &ДатаКон
	|		И ВЫБОР
	|				КОГДА &ЕстьОтборМенеджер = ЛОЖЬ
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Renault_РабочиеЛисты.Сотрудник В (&ОтборМенеджер)
	|			КОНЕЦ
	|		И ВЫБОР
	|				КОГДА &ЕстьОтборМодели = ЛОЖЬ
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Renault_СтатистикаВыполненияЭтаповПродаж.Модель ЕСТЬ NULL 
	|								ИЛИ Renault_СтатистикаВыполненияЭтаповПродаж.Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
	|							ТОГДА ВЫБОР
	|									КОГДА Renault_РабочиеЛисты.ПервичныйИнтересМодель.Модель ЕСТЬ NULL 
	|										ТОГДА ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
	|									ИНАЧЕ Renault_РабочиеЛисты.ПервичныйИнтересМодель.Модель
	|								КОНЕЦ
	|						ИНАЧЕ Renault_СтатистикаВыполненияЭтаповПродаж.Модель
	|					КОНЕЦ В (&ОтборМодели)
	|			КОНЕЦ
	|		И ВЫБОР
	|				КОГДА &ЕстьОтборДЦ = ЛОЖЬ
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Renault_СтатистикаВыполненияЭтаповПродаж.ДилерскийЦентр ЕСТЬ NULL 
	|							ТОГДА ВЫБОР
	|									КОГДА Renault_РабочиеЛисты.ДилерскийЦентр ЕСТЬ NULL 
	|										ТОГДА ЗНАЧЕНИЕ(Справочник.CRM_ДилерскиеЦентры.ПустаяСсылка)
	|									ИНАЧЕ Renault_РабочиеЛисты.ДилерскийЦентр
	|								КОНЕЦ
	|						ИНАЧЕ Renault_СтатистикаВыполненияЭтаповПродаж.ДилерскийЦентр
	|					КОНЕЦ В (&ОтборДЦ)
	|			КОНЕЦ
	|		И ВЫБОР
	|				КОГДА &ЕстьОтборОтделы = ЛОЖЬ
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Renault_РабочиеЛисты.Отдел В (&ОтборОтделы)
	|			КОНЕЦ
	|		И Renault_СтатистикаВыполненияЭтаповПродаж.ЭтапПродаж = &Этап1) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ДопИнформацияПоМоделям КАК ДопИнформацияТипМодели
	|		ПО ВложенныйЗапрос.Модели = ДопИнформацияТипМодели.Модель
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ДопИнформацияПоМоделям КАК ДопИнформацияГаммаМодели
	|		ПО ВложенныйЗапрос.Модели = ДопИнформацияГаммаМодели.Модель
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ЕстьОтборТипМодели = ЛОЖЬ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ДопИнформацияТипМодели.ТипМодели В (&ОтборТипыМоделей)
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьОтборГамма = ЛОЖЬ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ДопИнформацияГаммаМодели.Гамма В (&ОтборГамма)
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_Факт.ПоказательОборот) / СУММА(ВТ_Факт.Количество) как КоличествоФакт,
	|	//Статистика
	|ПОМЕСТИТЬ ВТ_Статистика
	|ИЗ
	|	ВТ_Факт КАК ВТ_Факт
	|
	|СГРУППИРОВАТЬ ПО
	|	//Статистика
	|;";
	
	ТекстСтатистика = "";
	Для Каждого СтрокаПорядок из Настройка.Порядок Цикл
		ТекстСтатистика = ТекстСтатистика +"ВТ_Факт."+ СтрокаПорядок.Значение +",";
	КонецЦикла;
 
	Текст = СтрЗаменить(Текст,"//Статистика", Лев(ТекстСтатистика, СтрДлина(ТекстСтатистика)-1));
	
	Возврат Текст;
КонецФункции

&НаСервере 
Функция  ПолучитьДЗДляПроцентрого ()
	
	Текст = "" +ТекстЗапросаФактКоличественный() + ТекстЗапросаНастройки();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЭтапВыполнения", Настройка.ЭтапВыполнения);
	Запрос.УстановитьПараметр("Этап1", Настройка.ЭтапПродаж);
	Запрос.УстановитьПараметр("Этап2", Настройка.ЭтапПродажПроцентный);
	Запрос.УстановитьПараметр("ДатаНач", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", ДатаОкончания);
	Запрос.УстановитьПараметр("ЕстьОтборДЦ", Настройка.ДилерскиеЦентры);
	Запрос.УстановитьПараметр("ЕстьОтборОтделы", Настройка.Отделы);
	Запрос.УстановитьПараметр("ЕстьОтборМенеджер", Настройка.Менеджеры);
	Запрос.УстановитьПараметр("ЕстьОтборМодели", Настройка.Модели);
	Запрос.УстановитьПараметр("ОтборДЦ", Настройка.СоставДилерскиеЦентры.ВыгрузитьКолонку("Значение"));
	Запрос.УстановитьПараметр("ОтборОтделы", Настройка.СоставОтделы.ВыгрузитьКолонку("Значение"));
	Запрос.УстановитьПараметр("ОтборМодели", Настройка.СоставМодели.ВыгрузитьКолонку("Значение"));
	Запрос.УстановитьПараметр("ОтборМенеджер", Настройка.СоставМенеджеры.ВыгрузитьКолонку("Значение"));   
	Запрос.УстановитьПараметр("Ссылка", Настройка);
	Запрос.УстановитьПараметр("ОтборТипыМоделей", Настройка.СоставТипыМоделей.ВыгрузитьКолонку("Значение"));
	Запрос.УстановитьПараметр("ОтборГамма", Настройка.СоставГаммаМоделей.ВыгрузитьКолонку("Значение"));
	Запрос.УстановитьПараметр("ЕстьОтборТипМодели", Настройка.ТипыМоделей);
	Запрос.УстановитьПараметр("ЕстьОтборГамма", Настройка.ГаммаМоделей);
	
	Запрос.Текст = Текст;

	Возврат Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
КонецФункции

&НаСервере
Функция ПолучитьДЗДляКоличественного ()
	
	Текст = "" +ТекстЗапросаФактКоличественный() + ТекстЗапросаНастройки();

	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Этап1", Настройка.ЭтапПродаж);
	Запрос.УстановитьПараметр("Этап2", Настройка.ЭтапПродажПроцентный);
	Запрос.УстановитьПараметр("ЭтапВыполнения", Настройка.ЭтапВыполнения);
	Запрос.УстановитьПараметр("ДатаНач", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", ДатаОкончания);
	Запрос.УстановитьПараметр("ЕстьОтборДЦ", Настройка.ДилерскиеЦентры);
	Запрос.УстановитьПараметр("ЕстьОтборОтделы", Настройка.Отделы);
	Запрос.УстановитьПараметр("ЕстьОтборМенеджер", Настройка.Менеджеры);
	Запрос.УстановитьПараметр("ЕстьОтборМодели", Настройка.Модели);
	Запрос.УстановитьПараметр("ОтборДЦ", Настройка.СоставДилерскиеЦентры.ВыгрузитьКолонку("Значение"));
	Запрос.УстановитьПараметр("ОтборОтделы", Настройка.СоставОтделы.ВыгрузитьКолонку("Значение"));
	Запрос.УстановитьПараметр("ОтборМодели", Настройка.СоставМодели.ВыгрузитьКолонку("Значение"));
	Запрос.УстановитьПараметр("ОтборМенеджер", Настройка.СоставМенеджеры.ВыгрузитьКолонку("Значение"));   
	Запрос.УстановитьПараметр("Ссылка", Настройка);
	Запрос.УстановитьПараметр("ОтборТипыМоделей", Настройка.СоставТипыМоделей.ВыгрузитьКолонку("Значение"));
	Запрос.УстановитьПараметр("ОтборГамма", Настройка.СоставГаммаМоделей.ВыгрузитьКолонку("Значение"));
    Запрос.УстановитьПараметр("ЕстьОтборТипМодели", Настройка.ТипыМоделей);
	Запрос.УстановитьПараметр("ЕстьОтборГамма", Настройка.ГаммаМоделей);

	Запрос.Текст = Текст;

	Возврат Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
КонецФункции

&НаСервере 
Функция ПолучитьДЗДляСуммового ()
	
	Текст = "" + ТекстЗапросаФактСуммовой() + ТекстЗапросаНастройки();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Этап1", Настройка.ЭтапПродаж);
	Запрос.УстановитьПараметр("Этап2", Настройка.ЭтапПродажПроцентный);
	Запрос.УстановитьПараметр("ЭтапВыполнения", Настройка.ЭтапВыполнения);
	Запрос.УстановитьПараметр("ДатаНач", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", ДатаОкончания);
	Запрос.УстановитьПараметр("ЕстьОтборДЦ", Настройка.ДилерскиеЦентры);
	Запрос.УстановитьПараметр("ЕстьОтборОтделы", Настройка.Отделы);
	Запрос.УстановитьПараметр("ЕстьОтборМенеджер", Настройка.Менеджеры);
	Запрос.УстановитьПараметр("ЕстьОтборМодели", Настройка.Модели);
	Запрос.УстановитьПараметр("ОтборДЦ", Настройка.СоставДилерскиеЦентры.ВыгрузитьКолонку("Значение"));
	Запрос.УстановитьПараметр("ОтборОтделы", Настройка.СоставОтделы.ВыгрузитьКолонку("Значение"));
	Запрос.УстановитьПараметр("ОтборМодели", Настройка.СоставМодели.ВыгрузитьКолонку("Значение"));
	Запрос.УстановитьПараметр("ОтборМенеджер", Настройка.СоставМенеджеры.ВыгрузитьКолонку("Значение"));   
	Запрос.УстановитьПараметр("Ссылка", Настройка);
	Запрос.УстановитьПараметр("ОтборТипыМоделей", Настройка.СоставТипыМоделей.ВыгрузитьКолонку("Значение"));
	Запрос.УстановитьПараметр("ОтборГамма", Настройка.СоставГаммаМоделей.ВыгрузитьКолонку("Значение"));
    Запрос.УстановитьПараметр("ЕстьОтборТипМодели", Настройка.ТипыМоделей);
	Запрос.УстановитьПараметр("ЕстьОтборГамма", Настройка.ГаммаМоделей);

	Запрос.Текст = Текст;

	Возврат Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
КонецФункции

&НаСервере 
Функция ПолучитьДЗДляСуммовойНаЕдиницу ()
	
	Текст = "" + ТекстЗапросаФактСуммовойНаЕдиницу() + ТекстЗапросаНастройки();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Этап1", Настройка.ЭтапПродаж);
	Запрос.УстановитьПараметр("Этап2", Настройка.ЭтапПродажПроцентный);
	Запрос.УстановитьПараметр("ЭтапВыполнения", Настройка.ЭтапВыполнения);
	Запрос.УстановитьПараметр("ДатаНач", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", ДатаОкончания);
	Запрос.УстановитьПараметр("ЕстьОтборДЦ", Настройка.ДилерскиеЦентры);
	Запрос.УстановитьПараметр("ЕстьОтборОтделы", Настройка.Отделы);
	Запрос.УстановитьПараметр("ЕстьОтборМенеджер", Настройка.Менеджеры);
	Запрос.УстановитьПараметр("ЕстьОтборМодели", Настройка.Модели);
	Запрос.УстановитьПараметр("ОтборДЦ", Настройка.СоставДилерскиеЦентры.ВыгрузитьКолонку("Значение"));
	Запрос.УстановитьПараметр("ОтборОтделы", Настройка.СоставОтделы.ВыгрузитьКолонку("Значение"));
	Запрос.УстановитьПараметр("ОтборМодели", Настройка.СоставМодели.ВыгрузитьКолонку("Значение"));
	Запрос.УстановитьПараметр("ОтборМенеджер", Настройка.СоставМенеджеры.ВыгрузитьКолонку("Значение"));   
	Запрос.УстановитьПараметр("Ссылка", Настройка);
	Запрос.УстановитьПараметр("ОтборТипыМоделей", Настройка.СоставТипыМоделей.ВыгрузитьКолонку("Значение"));
	Запрос.УстановитьПараметр("ОтборГамма", Настройка.СоставГаммаМоделей.ВыгрузитьКолонку("Значение"));
    Запрос.УстановитьПараметр("ЕстьОтборТипМодели", Настройка.ТипыМоделей);
	Запрос.УстановитьПараметр("ЕстьОтборГамма", Настройка.ГаммаМоделей);

	Запрос.Текст = Текст;

	Возврат Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
КонецФункции

&НаСервере
Функция ПолучитьДЗДляСуммыНаЭтап ()
	
	Текст = "" + ТекстЗапросаФактСуммаНаЭтап() + ТекстЗапросаНастройки();
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Этап1", Настройка.ЭтапПродаж);
	Запрос.УстановитьПараметр("Этап2", Настройка.ЭтапПродажПроцентный);
	Запрос.УстановитьПараметр("ЭтапВыполнения", Настройка.ЭтапВыполнения);
	Запрос.УстановитьПараметр("ДатаНач", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", ДатаОкончания);
	Запрос.УстановитьПараметр("ЕстьОтборДЦ", Настройка.ДилерскиеЦентры);
	Запрос.УстановитьПараметр("ЕстьОтборОтделы", Настройка.Отделы);
	Запрос.УстановитьПараметр("ЕстьОтборМенеджер", Настройка.Менеджеры);
	Запрос.УстановитьПараметр("ЕстьОтборМодели", Настройка.Модели);
	Запрос.УстановитьПараметр("ОтборДЦ", Настройка.СоставДилерскиеЦентры.ВыгрузитьКолонку("Значение"));
	Запрос.УстановитьПараметр("ОтборОтделы", Настройка.СоставОтделы.ВыгрузитьКолонку("Значение"));
	Запрос.УстановитьПараметр("ОтборМодели", Настройка.СоставМодели.ВыгрузитьКолонку("Значение"));
	Запрос.УстановитьПараметр("ОтборМенеджер", Настройка.СоставМенеджеры.ВыгрузитьКолонку("Значение"));   
	Запрос.УстановитьПараметр("Ссылка", Настройка);
	Запрос.УстановитьПараметр("ОтборТипыМоделей", Настройка.СоставТипыМоделей.ВыгрузитьКолонку("Значение"));
	Запрос.УстановитьПараметр("ОтборГамма", Настройка.СоставГаммаМоделей.ВыгрузитьКолонку("Значение"));
    Запрос.УстановитьПараметр("ЕстьОтборТипМодели", Настройка.ТипыМоделей);
	Запрос.УстановитьПараметр("ЕстьОтборГамма", Настройка.ГаммаМоделей);

	Запрос.Текст = Текст;

	Возврат Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);

КонецФункции

&НаКлиенте
Процедура УвеличитьПериода(Команда)
	
	Элементы.НадписьПериод.Заголовок = ПолучитьДатуПериода ("+");
	Ошибка = "";
	ЗаполнитьСписок(Ошибка);
	Если Ошибка <> "" Тогда
		Предупреждение(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьПериод(Команда)
	
	Элементы.НадписьПериод.Заголовок = ПолучитьДатуПериода ("-");
	Ошибка = "";
	ЗаполнитьСписок(Ошибка);
	Если Ошибка <> "" Тогда
		Предупреждение(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок()
	
	Ошибка = "";
	ЗаполнитьСписок(Ошибка);
	Если Ошибка <> "" Тогда
		Предупреждение(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьСписокНаСервере()
	
	Список.ПолучитьЭлементы().Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПриИзменении(Элемент)
	Период = ТекущаяДата();
 
	ОчиститьСписокНаСервере();
	Элементы.НадписьПериод.Заголовок = ПолучитьДатуПериода();
	УстановитьПорядокКолонок(); 
	УменьшитьПериод(Неопределено);
	УвеличитьПериода(Неопределено);
	ОформитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьПорядокКолонок ()
	
	Если Элементы.Список.ПодчиненныеЭлементы.Количество() Тогда
		мЭлементов = Новый Массив;
		Для Каждого элементСписка из Элементы.Список.ПодчиненныеЭлементы Цикл
			мЭлементов.Добавить(элементСписка);
		КонецЦикла;
		Для Каждого Элемент из мЭлементов Цикл
			Элементы.Удалить(Элемент);
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого стрПорядок Из Настройка.Порядок Цикл
		
		НовыйЭлемент = Элементы.Добавить(стрПорядок.Значение, Тип("ПолеФормы"), Элементы.Список);       
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовыйЭлемент.ПутьКДанным = "Список." + стрПорядок.Значение;
		НовыйЭлемент.Ширина = 15;
		
	КонецЦикла;
	
	//Если Элементы.Список.ПодчиненныеЭлементы.Найти("Количество") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("Количество", Тип("ПолеФормы"), Элементы.Список);       
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Список.Количество";
		НовыйЭлемент.Заголовок = "План";
		НовыйЭлемент.Ширина = 3;
	//КонецЕсли;
	//Если Элементы.Список.ПодчиненныеЭлементы.Найти("КоличествоФакт") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("КоличествоФакт", Тип("ПолеФормы"), Элементы.Список);       
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовыйЭлемент.ПутьКДанным = "Список.КоличествоФакт";
		НовыйЭлемент.Заголовок = "Факт";
		НовыйЭлемент.Ширина = 3;
	//КонецЕсли;
	
	 
КонецПроцедуры

&НаСервере
Процедура ОформитьНаСервере()
 
	Если УсловноеОформление.Элементы.Количество() > 0 Тогда
		УсловноеОформление.Элементы.Очистить(); 
	КонецЕсли;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	// Оформление: цвет фона.
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СеребристоСерый);
	
	// Условие.
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Данные");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Ложь;
	
	// Оформляемое поле.
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Список");
	
	для х=0 по Настройка.Порядок.Количество()-2 Цикл
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Условие.
		ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список."+Настройка.Порядок[х+1].Значение);
		ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементУсловия.ПравоеЗначение = ПолучитьТип(Настройка.Порядок[х+1].Значение);
		
		// Оформляемое поле.
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Настройка.Порядок[х].Значение);
		
	//	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	//	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);
	//
	//// Условие.
	//	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список."+Настройка.Порядок[х+1].Значение);
	//	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	//	ЭлементУсловия.ПравоеЗначение = ПолучитьТип(Настройка.Порядок[х+1].Значение);
	//	
	//	// Оформляемое поле.
	//	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	//	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Настройка.Порядок[х].Значение);

		
	КонецЦикла;
	
КонецПроцедуры

&Насервере
Функция ПолучитьТип (ТипНастройки)
	Если ТипНастройки = "ДилерскиеЦентры" Тогда
		Возврат Справочники.CRM_ДилерскиеЦентры.ПустаяСсылка();
	ИначеЕсли ТипНастройки = "Отделы" Тогда
		Возврат Справочники.CRM_Отделы.ПустаяСсылка();
	ИначеЕсли ТипНастройки = "Менеджеры" Тогда
		Возврат Справочники.Сотрудники.ПустаяСсылка();
	ИначеЕсли ТипНастройки = "Модели" Тогда
		Возврат Справочники.Модели.ПустаяСсылка();
	ИначеЕсли ТипНастройки = "ТипыМоделей" Тогда
		Возврат Справочники.Renault_ТипыМоделей.ПустаяСсылка();
	ИначеЕсли ТипНастройки = "ГаммаМоделей" Тогда
		Возврат Справочники.Renault_ГаммаМоделей.ПустаяСсылка();
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
	Форма = ПолучитьОбщуюФорму("ПечатнаяФормаДокументов");
	Форма.ЭлементыФормы.ТабличныйДокумент.Вывести(ПечатьНаСервере());
	Форма.Открыть();
КонецПроцедуры

&НаСервере 
Функция ПечатьНаСервере ()
	ТЗ = РеквизитФормыВЗначение("Список", Тип("ДеревоЗначений"));
	мНаУдаление = Новый Массив;
	Для Каждого колонки из ТЗ.Колонки Цикл
		ЗначениеНастройки = Настройка.Порядок.Найти(колонки.Имя);
		Если ЗначениеНастройки = Неопределено и
				Колонки.Имя <> "Количество" и
					Колонки.Имя <> "КоличествоФакт" Тогда
			мНаУдаление.Добавить(колонки);
		КонецЕсли;
	КонецЦикла;
	Если мНаУдаление.Количество() Тогда
		Для Каждого знНаУдаление из мНаУдаление Цикл
			ТЗ.Колонки.Удалить(знНаУдаление);
		КонецЦикла;
	КонецЕсли;
	
	ТД = новый ТабличныйДокумент;
	Результат = ТЗ.Строки;
	Колонки = ТЗ.Колонки;
	СформироватьШапку(ТД,,,Колонки);
	ТД.НачатьАвтогруппировкуСтрок();
	ДеревоЗначенийВТД(ТД,Результат,0,Колонки);
	ТД.ЗакончитьАвтогруппировкуСтрок();
	Возврат ТД;
КонецФункции

&НаСервере
Процедура ДеревоЗначенийВТД(ТД,Строки,Уровень,Колонки)
	ТС = новый ТабличныйДокумент;
	Строка2 = ТС.ПолучитьОбласть("R1");
	Макет = Обработки.Renault_ARM_ПланПродаж.ПолучитьМакет("Макет");
	Если Строки.Количество() Тогда
		Для Каждого стр из Строки Цикл
			Для ит = 0 по Настройка.Порядок.Количество()-1 Цикл
				Если ит<Уровень Тогда
					ЗначениеВОбласть(Строка2.Область("R1C"+(ит+1)),"");
				Иначе
					ЗначениеВОбласть(Строка2.Область("R1C"+(ит+1)),стр[Настройка.Порядок[ит].Значение]);
				КонецЕсли;
			КонецЦикла;
			ЗначениеВОбласть(Строка2.Область("R1C"+(Настройка.Порядок.Количество()+1)),стр.Количество);
			ЗначениеВОбласть(Строка2.Область("R1C"+(Настройка.Порядок.Количество()+2)),стр.КоличествоФакт);
			ТД.Вывести(Строка2,Уровень,"Группа "+Уровень,Истина);
			ДеревоЗначенийВТД(ТД,стр.Строки,Уровень+1,Колонки)
		КонецЦикла;	
	КонецЕсли; 
КонецПроцедуры // ДеревоЗначенийВТД()


&НаСервере
Процедура СформироватьШапку(ТД,с=1,к=1,Колонки)
	Макет = Обработки.Renault_ARM_ПланПродаж.ПолучитьМакет("Макет");
	ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
	Если Настройка.ТипПлана = Перечисления.Renault_ТипыПланирования.Количественный или 
			Настройка.ТипПлана = Перечисления.Renault_ТипыПланирования.Процентный Тогда
		Этап = Настройка.ЭтапПродаж;
	ИначеЕсли Настройка.ТипПлана = Перечисления.Renault_ТипыПланирования.СуммовойНаЕдиницу или
				Настройка.ТипПлана = Перечисления.Renault_ТипыПланирования.Суммовой Тогда
		Этап = Настройка.ЭтапВыполнения;
	КонецЕсли;

	ОбластьШапки.Параметры.ЭтапПродаж = Этап;
	ОбластьШапки.Параметры.Период = ПолучитьДатуПериода();
	ТД.Вывести (ОбластьШапки);
	ПервыйПроход = Истина;
	Для Каждого стр из Настройка.Порядок Цикл
		//ЗначениеНастройки = Настройка.Порядок.Найти(стр.Имя);
		ЗначениеНастройки = стр.Значение;
		Обл = Макет.ПолучитьОбласть(ЗначениеНастройки+"шапка");
		Если ПервыйПроход Тогда
			ТД.Вывести(Обл);
			ПервыйПроход = ЛОжь;
		Иначе
			ТД.Присоединить(Обл);
		КонецЕсли;
	КонецЦикла;
	Обл = Макет.ПолучитьОбласть("КоличествоШапка");
	ТД.Присоединить(Обл);
	Обл = Макет.ПолучитьОбласть("КоличествоФактШапка");
	ТД.Присоединить(Обл);
КонецПроцедуры // СформироватьШапку()


&НаСервере
Процедура ЗначениеВОбласть(Область,Значение)
	Если ТипЗнч(Значение) = Тип("ОбъектМетаданных") Тогда
		Область.Текст = Значение.ПолноеИмя();
	ИначеЕсли ТипЗнч(Значение) = Тип("ТаблицаЗначений")	Тогда
		Область.Текст = Строка(Значение)+"("+Значение.Количество()+")";
	Иначе
		Область.Текст = Значение;
		Область.Расшифровка = Значение;  
	КонецЕсли;
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
	Область.ГраницаСнизу = Линия;
	Область.ГраницаСправа = Линия;

КонецПроцедуры // ЗначениевОбласть() 

&НаКлиенте
Процедура СогласоватьНажатие(Элемент)
	Если Не Согласован и 
		ПараметрыСеанса.Renault_ПраваПользователя.ПравоНаУтверждениеПлановПродаж Тогда
		СогласоватьНаСервере ();
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СогласоватьНаСервере ()
	
	Менеджер = РегистрыСведений.Renault_ИсторияСогласованияПлановПродаж.СоздатьМенеджерЗаписи();
	Менеджер.Настройка = Настройка;
	Менеджер.ПериодПлана = Период;
	Менеджер.Согласован = Истина;
	Менеджер.Записать();
	ПолучитьСтатусСогласования();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
	Если ВвестиДату(Период, , ЧастиДаты.Дата) Тогда
		Элементы.НадписьПериод.Заголовок = ПолучитьДатуПериода();
	КонецЕсли;
	Оповестить("ОбновитьСписок");
КонецПроцедуры

&НаКлиенте
Процедура развернуть(Команда)
	СписокЭлементов = Список.ПолучитьЭлементы();
	Если СписокЭлементов.Количество() > 0 Тогда
		Для Каждого лСтрокаЭлемента Из Список.ПолучитьЭлементы() Цикл
			Элементы.Список.Развернуть(лСтрокаЭлемента.ПолучитьИдентификатор(), Истина);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура свернуть(Команда)
	СписокЭлементов = Список.ПолучитьЭлементы();
	Если СписокЭлементов.Количество() > 0 Тогда
		Для Каждого лСтрокаЭлемента Из Список.ПолучитьЭлементы() Цикл
			Элементы.Список.Свернуть(лСтрокаЭлемента.ПолучитьИдентификатор());
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
