&НаКлиенте
Перем ПараметрыОбработчика;

&НаКлиенте
Процедура ПолучитьДанные(Команда)
	
	ПараметрыВызоваСервера = Новый Структура;
	ПараметрыВызоваСервера.Вставить("BIR",Объект.BIR);
	ПараметрыВызоваСервера.Вставить("НачПериода",Объект.ДатаНачала);
	ПараметрыВызоваСервера.Вставить("КонПериода",Объект.ДатаОкончания);
	РезультатПолученияДопИнформации = ВыполнитьЗапрос (ПараметрыВызоваСервера);
	Если РезультатПолученияДопИнформации.ФоновоеЗадание Тогда
		Renault_ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте", 1, Истина);
		ФормаДлительнойОперации = Renault_ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, РезультатПолученияДопИнформации.ФоновоеЗаданиеИдентификатор);
	Иначе
		ОбработатьРезультатВыполненияЗадания(РезультатПолученияДопИнформации);	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ВыполнитьЗапрос (ПараметрыВызоваСервера)
	
	РезультатФоновогоЗадания = Renault_ДлительныеОперации.ЗапуститьВыполнениеВФоне(УникальныйИдентификатор, 
	"Renault_АвтосервисСервер.ПолучитьОтчетБюджетСМС", ПараметрыВызоваСервера);
	Результат = Новый Структура;
	Если РезультатФоновогоЗадания.ЗаданиеВыполнено Тогда
		Результат.Вставить("ФоновоеЗадание", Ложь);
		Результат.Вставить("АдресХранилища", РезультатФоновогоЗадания.АдресХранилища);
	Иначе 
		Результат.Вставить("ФоновоеЗадание", Истина);
		Результат.Вставить("ФоновоеЗаданиеИдентификатор", РезультатФоновогоЗадания.ИдентификаторЗадания);
		Результат.Вставить("АдресХранилища", РезультатФоновогоЗадания.АдресХранилища);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатВыполненияЗадания(РезультатПолученияДопИнформации)
	
	ПоказатьНаФорме(РезультатПолученияДопИнформации);
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьНаФорме(РезультатПолученияДопИнформации)

	сОтвет = ПолучитьИзВременногоХранилища(РезультатПолученияДопИнформации.АдресХранилища);

	ЗначениеВРеквизитФормы(сОтвет,"Объект.Результат");	

КонецПроцедуры // ПоказатьНаФорме()


Функция ПолучитьВебСервисКампании() Экспорт
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	АдресWS = СокрЛП(Настройки.АдресWsGate+"ws/DMS_Campaigns.ws?wsdl");
	
	ЛогинWS = СокрЛП(Настройки.ЛогинДоступаКВебСервисам);
	ПарольWS = Настройки.ПарольДоступаКВебСервисам;
	
	Определение = Новый WSОпределения(АдресWS,ЛогинWS, ПарольWS);
	ВебСервис = Новый WSПрокси(Определение, Определение.Сервисы[0].URIПространстваИмен,Определение.Сервисы[0].Имя,Определение.Сервисы[0].ТочкиПодключения[0].Имя);       
	
	ВебСервис.Пользователь = ЛогинWS;
	ВебСервис.Пароль = ПарольWS;
	
	Возврат ВебСервис;
	
КонецФункции
