//Бондаренко++ 20220420       
Процедура ВыгрузитьОстаткиНоменклатурыПоЧери(Параметры = Неопределено) Экспорт
	
	Выборка = Справочники.СМ_ЧериЭксид_Настройки.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТекОбъект = Выборка.ПолучитьОбъект(); 
		
		Если ТекОбъект.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекОбъект.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		Дилер = ТекОбъект.Дилер;
		Если обЗначениеНеЗаполнено(Дилер) Тогда
			Продолжить;		
		КонецЕсли;
		
		КодДилера = ТекОбъект.КодДилера;
		Если ПустаяСтрока(КодДилера) Тогда
			Продолжить;		
		КонецЕсли;
		
		КлючАпи = ТекОбъект.КлючАПИ;		
		Если ПустаяСтрока(КлючАпи) Тогда
			Продолжить;		
		КонецЕсли;
		
		СписокПодразделений = Новый СписокЗначений;
		Если ТекОбъект.Подразделения.Количество() > 0 Тогда
			СписокПодразделений = ПолучитьСписокПодразделений(ТекОбъект);
		КонецЕсли;
		Если СписокПодразделений.Количество() = 0 Тогда
			Продолжить;			
		КонецЕсли;
		
		СписокСкладов = Новый СписокЗначений;
		Если ТекОбъект.Склады.Количество() > 0 Тогда
			СписокСкладов = ПолучитьСписокСкладов(ТекОбъект);
		КонецЕсли;
		
		СписокПроизводителей = Новый СписокЗначений;
		Если ТекОбъект.Производители.Количество() > 0 Тогда
			СписокПроизводителей = ПолучитьСписокПроизводителей(ТекОбъект);
		КонецЕсли;
		Если СписокПроизводителей.Количество() = 0 Тогда
			Продолжить;			
		КонецЕсли;
		
		Марка = ТекОбъект.Марка;
		
		ВыгрузитьОстаткиНоменклатурыДилераЧериИлиЭксид(Дилер,КодДилера,КлючАпи,СписокПодразделений,СписокСкладов,СписокПроизводителей,Марка); 
		
		Для Счетчик=1 По 10000000 Цикл
			Счетчик = Счетчик + 1;					
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры 

Функция ПолучитьСписокПодразделений(ТекОбъект) Экспорт
	
	ИтогСпПодр = Новый СписокЗначений;
	
	Для каждого ТекПодр Из ТекОбъект.Подразделения Цикл
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ПодразделенияКомпании.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|ГДЕ
		|	ПодразделенияКомпании.Ссылка В ИЕРАРХИИ(&Подразделение)
		|	И ПодразделенияКомпании.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Подразделение",ТекПодр.ПодразделениеКомпании);
		
		ТекСпПодр = Новый СписокЗначений;
		
		ТекСпПодр.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		
		Для каждого НовПодр Из ТекСпПодр Цикл
			Если ИтогСпПодр.НайтиПоЗначению(НовПодр.Значение) = Неопределено Тогда
				ИтогСпПодр.Добавить(НовПодр.Значение);
			КонецЕсли;		
		КонецЦикла;
		
	КонецЦикла;	 
	
	Возврат ИтогСпПодр;
	
КонецФункции // ПолучитьСписокПодразделений(ТекОбъект) 

//Бондаренко++ 20231011
Функция ПолучитьСписокСкладов(ТекОбъект) Экспорт
	
	ИтСпСкладов = Новый СписокЗначений;
	
	ИтСпСкладов.ЗагрузитьЗначения(ТекОбъект.Склады.Выгрузить().ВыгрузитьКолонку("Склад"));
	
	Возврат ИтСпСкладов;
	
КонецФункции // ПолучитьСписокСкладов(ТекОбъект) 

Функция ПолучитьСписокПроизводителей(ТекОбъект) Экспорт
	
	ИтСпПроизводителей = Новый СписокЗначений;
	
	ИтСпПроизводителей.ЗагрузитьЗначения(ТекОбъект.Производители.Выгрузить().ВыгрузитьКолонку("Производитель"));
	
	Возврат ИтСпПроизводителей;
	
КонецФункции // ПолучитьСписокСкладов(ТекОбъект)
//Бондаренко++ 20231011

Процедура ВыгрузитьОстаткиНоменклатурыДилераЧериИлиЭксид(Дилер,КодДилера,КлючАпи,СписокПодразделений,СписокСкладов,СписокПроизводителей,Марка) Экспорт
	
	ГдеСоздавать = КаталогВременныхФайлов();
	ИмяФайла = ГдеСоздавать+"file3.txt";
	//СМГ_Сообщить(ИмяФайла);
	
	Запрос = Новый Запрос; 
	
	Если СписокСкладов.Количество() > 0 Тогда
		Запрос.Текст =	"ВЫБРАТЬ
		|	&Дилер КАК Дилер,
		|	&КодДилера КАК КодДилера,
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура.Артикул КАК Артикул,
		|	СУММА(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток) КАК СвободныйОстаток,
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Ссылка,
		|	ОстаткиТоваровКомпанииОстатки.СкладКомпании
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(&ДатаОтчета, ) КАК ОстаткиТоваровКомпанииОстатки
		|ГДЕ
		|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток > 0
		|	И ОстаткиТоваровКомпанииОстатки.Номенклатура.Производитель В(&СписокПроизводителей)
		|	И ОстаткиТоваровКомпанииОстатки.СкладКомпании В(&СписокСкладов)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура,
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура.Артикул,
		|	ОстаткиТоваровКомпанииОстатки.СкладКомпании";
		Запрос.УстановитьПараметр("СписокСкладов", СписокСкладов); 
	Иначе	
		Запрос.Текст = 	"ВЫБРАТЬ
		|	&Дилер КАК Дилер,
		|	&КодДилера КАК КодДилера,
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура.Артикул КАК Артикул,
		|	СУММА(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток) КАК СвободныйОстаток,
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Ссылка,
		|	ОстаткиТоваровКомпанииОстатки.СкладКомпании
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(&ДатаОтчета, ) КАК ОстаткиТоваровКомпанииОстатки
		|ГДЕ
		|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток > 0
		|	И ОстаткиТоваровКомпанииОстатки.СкладКомпании.Подразделение В(&СписокПодразделений)
		|	И ОстаткиТоваровКомпанииОстатки.Номенклатура.Производитель В(&СписокПроизводителей)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура,
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура.Артикул,
		|	ОстаткиТоваровКомпанииОстатки.СкладКомпании";
		Запрос.УстановитьПараметр("СписокПодразделений",СписокПодразделений);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дилер", Дилер);
	Запрос.УстановитьПараметр("КодДилера", КодДилера);
	Запрос.УстановитьПараметр("ДатаОтчета", КонецДня(ТекущаяДата()  -  86400));   //Минус  1 день
	Запрос.УстановитьПараметр("СписокПроизводителей", СписокПроизводителей);
	
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	
	//Бондаренко++ 20240118
	ТаблицаОстатков.Свернуть("Дилер,КодДилера,Артикул,Ссылка","СвободныйОстаток");
	//Бондаренко-- 20240118
	
	//===================================
	СписокНоменклатуры = Новый СписокЗначений;
	СписокНоменклатуры.ЗагрузитьЗначения(ТаблицаОстатков.ВыгрузитьКолонку("Ссылка"));
	
	Запрос1 = Новый Запрос;
	Запрос1.Текст = 
	"ВЫБРАТЬ
	|	ЦеныСрезПоследних.Номенклатура,
	|	МАКСИМУМ(ЦеныСрезПоследних.Цена) КАК Цена,
	|	ЦеныСрезПоследних.ТипЦен
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних КАК ЦеныСрезПоследних
	|ГДЕ
	|	ЦеныСрезПоследних.ТипЦен = &ТипЦенПродажи
	|	И ЦеныСрезПоследних.Номенклатура В(&СписокНоменклатуры)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныСрезПоследних.Номенклатура,
	|	ЦеныСрезПоследних.ТипЦен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦеныСрезПоследних.Номенклатура,
	|	МАКСИМУМ(ЦеныСрезПоследних.Цена),
	|	ЦеныСрезПоследних.ТипЦен
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних КАК ЦеныСрезПоследних
	|ГДЕ
	|	ЦеныСрезПоследних.ТипЦен = &ТипЦенЗакупки
	|	И ЦеныСрезПоследних.Номенклатура В(&СписокНоменклатуры)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныСрезПоследних.Номенклатура,
	|	ЦеныСрезПоследних.ТипЦен";
	
	Запрос1.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	Запрос1.УстановитьПараметр("ТипЦенПродажи", Справочники.ТипыЦен.ОсновнойТипЦенПродажи);
	Запрос1.УстановитьПараметр("ТипЦенЗакупки", Справочники.ТипыЦен.ОсновнойТипЦенЗакупки);
	
	ТаблЦен = Запрос1.Выполнить().Выгрузить();
	
	//ТаблЦен.ВыбратьСтроку();
	
	//=========================
	
	ТекстЗН = Новый ТекстовыйДокумент; 
	
	Для каждого Строка Из ТаблицаОстатков Цикл
		
		ПарОтбора = Новый Структура();
		ПарОтбора.Вставить("Номенклатура",Строка.Ссылка);
		СтрокаЦен = ТаблЦен.НайтиСтроки(ПарОтбора);
		
		Если СтрокаЦен.Количество() > 0 Тогда
			Цена = СтрЗаменить(СтрокаЦен[0].Цена,Символы.НПП,"");
		Иначе	
			Цена = 0;
		КонецЕсли;
		
		ТекстЗН.ДобавитьСтроку(""+СтрЗаменить(Строка.Дилер,"""","'") + ";"+
		Строка.КодДилера + ";"+
		Строка.Артикул + ";"+
		Строка.СвободныйОстаток + ";"+
		СокрЛП(Цена));
		
	КонецЦикла;
	
	Попытка
		ТекстЗН.Записать(ИмяФайла); 
	Исключение
		//Сообщить("ОШИБКА! Не удалось записать файл с заголовками заказ-нарядов "+ИмяФайлаСработами);	
	КонецПопытки; 
	
	Если ТаблицаОстатков.Количество()  > 0 Тогда
		ДвоичныеДанныеЗН=Новый ДвоичныеДанные(ИмяФайла);
		АдресВХ_Остатки = ПоместитьВоВременноеХранилище(ДвоичныеДанныеЗН);
		ВыгрузкаОстатковНоменклатурыИЦенНаПорталЧери(АдресВХ_Остатки,КлючАпи,Марка);	
	КонецЕсли; 
	
КонецПроцедуры //ВыгрузитьОстаткиНоменклатурыДилераЧериИлиЭксид(Дилер,КодДилера,КлючАпи,СписокПодразделений,СписокСкладов,СписокПроизводителей,Марка)
//Бондаренко-- 20220420

//Бондаренко++ 20200122   
Процедура ВыгрузитьЗНпоЧери(Параметры = Неопределено) Экспорт
	
	РаботыЗН = Новый ТаблицаЗначений;
	РаботыЗН.Колонки.Добавить("Номер");
	РаботыЗН.Колонки.Добавить("ТипПозиции");
	РаботыЗН.Колонки.Добавить("НомерПозиции");
	РаботыЗН.Колонки.Добавить("КодПозиции");
	РаботыЗН.Колонки.Добавить("НомерЗаказЗапчасти");
	РаботыЗН.Колонки.Добавить("НаименованиеПозиции");
	РаботыЗН.Колонки.Добавить("Количество");
	РаботыЗН.Колонки.Добавить("ИтоговаяСтоимость");
	РаботыЗН.Колонки.Добавить("РасширениеЗН");
	РаботыЗН.Колонки.Добавить("Вналичии");
	РаботыЗН.Колонки.Добавить("Ссылка");
	РаботыЗН.Колонки.Добавить("ТипРемонта");
	
	Дилер = Справочники.Организации.НайтиПоРеквизиту("ИНН","6168069282");
	КодДилера = "6125600";
	
	ГдеСоздавать = КаталогВременныхФайлов();
	ИмяФайла = ГдеСоздавать+"file1.txt";
	ИмяФайлаСРаботами = ГдеСоздавать+"file2.txt";
	
	//=========================== 1 часть ===
	
	ТехническоеОбслуживание            = Справочники.ВидыРемонта.ТехническоеОбслуживание;
	КоммерческийРемонт                 = Справочники.ВидыРемонта.КоммерческийРемонт;     
	ТехническоеОбслуживаниеБесплатное  = Справочники.ВидыРемонта.ТехническоеОбслуживаниеБесплатное;
	ГарантияПроизводителя              = Справочники.ВидыРемонта.ГарантияПроизводителя;
	//Бондаренко++ 20230607
	ТОнольПлатный                      = Справочники.ВидыРемонта.ТО_нольПлатный;
	//Бондаренко-- 20230607
	//Бондаренко++ 20230706
	ТОнольБесплатный                   = Справочники.ВидыРемонта.ТО_ноль;
	//Бондаренко-- 20230706
	
	СзВидРемонта = Новый СписокЗначений;
	СзВидРемонта.Добавить(ТехническоеОбслуживание);
	СзВидРемонта.Добавить(КоммерческийРемонт);
	СзВидРемонта.Добавить(ТехническоеОбслуживаниеБесплатное);
	СзВидРемонта.Добавить(ГарантияПроизводителя);
	//Бондаренко++ 20230607
	СзВидРемонта.Добавить(ТОнольПлатный);
	//Бондаренко-- 20230607
	//Бондаренко++ 20230706
	СзВидРемонта.Добавить(ТОнольБесплатный);
	//Бондаренко-- 20230706               
	
	Запрос = Новый Запрос;
	
	Если ТипЗНЧ(Параметры) <> Тип("ДокументСсылка.ЗаказНаряд") Тогда  
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНарядРаботы.Ссылка,
		|	ЗаказНарядРаботы.Ссылка.Дата КАК Дата,
		|	ЗаказНарядРаботы.Ссылка.Организация,
		|	ЗаказНарядРаботы.Ссылка.Проведен,
		|	ЗаказНарядРаботы.НомерСтроки КАК НомерПозиции,
		|	ЗаказНарядРаботы.Работа КАК НаименованиеПозиции,
		|	""РАБОТА"" КАК ТипПозиции,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗаказНарядРаботы.Работа.Артикул, """") = """"
		|			ТОГДА ЗаказНарядРаботы.Работа.Код
		|		ИНАЧЕ ЗаказНарядРаботы.Работа.Артикул
		|	КОНЕЦ КАК КодПозиции,
		|	ЗаказНарядРаботы.Количество * ЗаказНарядРаботы.Коэффициент КАК Количество,
		|	ЗаказНарядРаботы.СуммаВсего КАК ИтоговаяСтоимость,
		|	""НЕТ"" КАК РасширениеЗН,
		|	""ДА"" КАК Вналичии,
		|	ЗаказНарядРаботы.Ссылка.Номер КАК Номер,
		|	ЗаказНарядРаботы.Ссылка.Состояние,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта.Наименование КАК ТипРемонта,
		|	ЗаказНарядРаботы.Ссылка.Пробег КАК Пробег
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		|ГДЕ
		|	ЗаказНарядРаботы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ЗаказНарядРаботы.Ссылка.Проведен = ИСТИНА
		|	И ЗаказНарядРаботы.Ссылка.Организация = &Организация
		|	И ЗаказНарядРаботы.Ссылка.Автомобиль.Модель.Марка = &Марка
		|	И ЗаказНарядРаботы.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|	И ЗаказНарядРаботы.Ссылка.ВидРемонта В(&СзВидРемонта)
		|	И ЗаказНарядРаботы.Ссылка.Пробег > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНарядТовары.Ссылка,
		|	ЗаказНарядТовары.Ссылка.Дата,
		|	ЗаказНарядТовары.Ссылка.Организация,
		|	ЗаказНарядТовары.Ссылка.Проведен,
		|	ЗаказНарядТовары.НомерСтроки,
		|	ЗаказНарядТовары.Номенклатура,
		|	""ДЕТАЛЬ"",
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗаказНарядТовары.Номенклатура.Артикул, """") = """"
		|			ТОГДА ЗаказНарядТовары.Номенклатура.Код
		|		ИНАЧЕ ЗаказНарядТовары.Номенклатура.Артикул
		|	КОНЕЦ,
		|	ЗаказНарядТовары.Количество * ЗаказНарядТовары.Коэффициент,
		|	ЗаказНарядТовары.СуммаВсего,
		|	""НЕТ"",
		|	""ДА"",
		|	ЗаказНарядТовары.Ссылка.Номер,
		|	ЗаказНарядТовары.Ссылка.Состояние,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта.Наименование,
		|	ЗаказНарядТовары.Ссылка.Пробег
		|ИЗ
		|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|ГДЕ
		|	ЗаказНарядТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ЗаказНарядТовары.Ссылка.Проведен = ИСТИНА
		|	И ЗаказНарядТовары.Ссылка.Организация = &Организация
		|	И ЗаказНарядТовары.Ссылка.Автомобиль.Модель.Марка = &Марка
		|	И ЗаказНарядТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|	И ЗаказНарядТовары.Ссылка.ВидРемонта В(&СзВидРемонта)
		|	И ЗаказНарядТовары.Ссылка.Пробег > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	Номер";
		
		Запрос.УстановитьПараметр("ДатаНачала",    НачалоДня(ТекущаяДата() - 86400 * 10));   //Минус 10 дней 
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()  - 86400     ));   //Минус  1 день
		Запрос.УстановитьПараметр("Марка", Справочники.Марка.CHERY);
		Запрос.УстановитьПараметр("Организация", Дилер);
		Запрос.УстановитьПараметр("СзВидРемонта",СзВидРемонта);
		Запрос.УстановитьПараметр("ВидЗначения",Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНарядРаботы.Ссылка,
		|	ЗаказНарядРаботы.Ссылка.Дата КАК Дата,
		|	ЗаказНарядРаботы.Ссылка.Организация,
		|	ЗаказНарядРаботы.Ссылка.Проведен,
		|	ЗаказНарядРаботы.НомерСтроки КАК НомерПозиции,
		|	ЗаказНарядРаботы.Работа КАК НаименованиеПозиции,
		|	""РАБОТА"" КАК ТипПозиции,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗаказНарядРаботы.Работа.Артикул, """") = """"
		|			ТОГДА ЗаказНарядРаботы.Работа.Код
		|		ИНАЧЕ ЗаказНарядРаботы.Работа.Артикул
		|	КОНЕЦ КАК КодПозиции,
		|	ЗаказНарядРаботы.Количество * ЗаказНарядРаботы.Коэффициент КАК Количество,
		|	ЗаказНарядРаботы.СуммаВсего КАК ИтоговаяСтоимость,
		|	""НЕТ"" КАК РасширениеЗН,
		|	""ДА"" КАК Вналичии,
		|	ЗаказНарядРаботы.Ссылка.Номер КАК Номер,
		|	ЗаказНарядРаботы.Ссылка.Состояние,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта.Наименование КАК ТипРемонта,
		|	ЗаказНарядРаботы.Ссылка.Пробег КАК Пробег
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		|ГДЕ
		|	ЗаказНарядРаботы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНарядТовары.Ссылка,
		|	ЗаказНарядТовары.Ссылка.Дата,
		|	ЗаказНарядТовары.Ссылка.Организация,
		|	ЗаказНарядТовары.Ссылка.Проведен,
		|	ЗаказНарядТовары.НомерСтроки,
		|	ЗаказНарядТовары.Номенклатура,
		|	""ДЕТАЛЬ"",
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗаказНарядТовары.Номенклатура.Артикул, """") = """"
		|			ТОГДА ЗаказНарядТовары.Номенклатура.Код
		|		ИНАЧЕ ЗаказНарядТовары.Номенклатура.Артикул
		|	КОНЕЦ,
		|	ЗаказНарядТовары.Количество * ЗаказНарядТовары.Коэффициент,
		|	ЗаказНарядТовары.СуммаВсего,
		|	""НЕТ"",
		|	""ДА"",
		|	ЗаказНарядТовары.Ссылка.Номер,
		|	ЗаказНарядТовары.Ссылка.Состояние,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта.Наименование,
		|	ЗаказНарядТовары.Ссылка.Пробег
		|ИЗ
		|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|ГДЕ
		|	ЗаказНарядТовары.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	Номер";
		
		Запрос.УстановитьПараметр("Ссылка", Параметры);  
		
	КонецЕсли;
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	РаботыЗН=ТЗ.Скопировать();
	
	ТЗ.Свернуть("Ссылка,Номер,Дата");
	
	ТЗ.Сортировать("Дата,Номер");
	
	Состав = Новый ТаблицаЗначений;
	Состав=ТЗ.Скопировать(,"Ссылка,Номер,Дата");
	
	ВсегоСтрок = Состав.Количество();
	
	Состав.Колонки.Добавить("Дилер");
	Состав.Колонки.Добавить("КодДилера");
	Состав.Колонки.Добавить("Владелец");
	Состав.Колонки.Добавить("ТелефонВладельца");
	Состав.Колонки.Добавить("VIN");
	Состав.Колонки.Добавить("ГосНомер");
	Состав.Колонки.Добавить("Марка");
	Состав.Колонки.Добавить("Модель");
	Состав.Колонки.Добавить("Пробег");
	Состав.Колонки.Добавить("ТипВладельца");
	Состав.Колонки.Добавить("КонтактноеЛицо");
	Состав.Колонки.Добавить("ТелефонКонтактногоЛица");
	Состав.Колонки.Добавить("ДатаОбращения");
	Состав.Колонки.Добавить("ПричинаОбращения");
	Состав.Колонки.Добавить("ДатаСозданияЗН");
	Состав.Колонки.Добавить("ДатаНачалаРабот");
	Состав.Колонки.Добавить("ДатаОкончанияРабот");
	Состав.Колонки.Добавить("ДатаЗакрытия");
	Состав.Колонки.Добавить("ТО");
	Состав.Колонки.Добавить("СервиснаяКомпания");
	Состав.Колонки.Добавить("ДобраяВоля");
	Состав.Колонки.Добавить("СлесарныйРемонт");
	Состав.Колонки.Добавить("КузовнойРемонт");
	Состав.Колонки.Добавить("Акция");
	Состав.Колонки.Добавить("ТипРемонта"); 
	
	//Бондаренко++ 20220429
	Состав.Колонки.Добавить("ЕмэйлКонтактногоЛица");
	
	Состав.Колонки.Добавить("ФлагСОПД");
	Состав.Колонки.Добавить("ФлагТелефон");
	Состав.Колонки.Добавить("ФлагЕмэйл");
	Состав.Колонки.Добавить("ФлагСМС"); 
	
	Состав.Колонки.Добавить("Рекомендации");
	Состав.Колонки.Добавить("УстановкаДО");
	Состав.Колонки.Добавить("ПредпродажнаяПодготовка");
	
	Состав.Колонки.Добавить("КодМастерОткрыл");  
	Состав.Колонки.Добавить("КодМастерРаботал");
	Состав.Колонки.Добавить("КодМастерЗакрыл");
	
	Состав.Колонки.Добавить("ТипДокумента");
	Состав.Колонки.Добавить("Мойка");
	Состав.Колонки.Добавить("Диагностика");
	//Бондаренко-- 20220429
	
	Для Каждого Строка Из Состав Цикл
		
		ТекЗН = Строка.Ссылка;
		ТекАвто = ТекЗН.Автомобиль;
		ТекЗаказчик = ТекЗН.Заказчик;
		ТекДатаЗН = ТекЗН.Дата;
		
		ТекВладелец = ТекЗН.Заказчик;
		ТекКонтактноеЛицо = ТекЗН._г_ДоверенноеЛицоЗаказчика;
		
		//Бондаренко++ 20230907                                 
		ТабНомерМастера         = СокрЛП(ТекЗН.Диспетчер.ТабельныйНомер);
		Строка.КодМастерОткрыл  = ТабНомерМастера;
		Строка.КодМастерРаботал = ТабНомерМастера;
		Строка.КодМастерЗакрыл  = ТабНомерМастера;
		//Бондаренко-- 20230907
		
		//Бондаренко++ 20220429
		Строка.ТелефонКонтактногоЛица = СокрЛП(ТекЗН.ПредставлениеТелефона);
		
		Если обЗначениеНеЗаполнено(ТекКонтактноеЛицо) Тогда
			ЕмэйлКонтактногоЛица = ТекЗН.Заказчик.ОсновнойАдресЭлектроннойПочты;
		Иначе			
			ЕмэйлКонтактногоЛица = ТекЗН._г_ДоверенноеЛицоЗаказчика.ОсновнойАдресЭлектроннойПочты;
		КонецЕсли;
		
		Строка.ЕмэйлКонтактногоЛица = ЕмэйлКонтактногоЛица;	
		
		Если ТекЗН.Заказчик.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо ИЛИ ТекЗН.Заказчик.ФормаСобственности = Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
			ФлагСОПД = ?(ТекЗН.Заказчик.СогласиеНаОбработкуПерсональныхДанных=Перечисления.ВариантыОтветов.Да,"ДА","НЕТ");
			ФлагСмс = ?(ТекЗН.Заказчик.СогласиеНаПолучениеSMS=Перечисления.ВариантыОтветов.Да,"ДА","НЕТ");
		Иначе			
			ФлагСОПД = "НЕТ";   
			ФлагСмс  = "НЕТ";
		КонецЕсли;
		
		Строка.ФлагСОПД = ФлагСОПД; 
		Строка.ФлагТелефон = ФлагСОПД; 
		Строка.ФлагЕмэйл = ФлагСОПД;
		Строка.ФлагСмс = ФлагСмс; 
		
		//Строка.Рекомендации = СокрЛП(ТекЗН.Рекомендации);
		
		Если ТекЗН.ВидРемонта=Справочники.ВидыРемонта.ДопОборудованиеСогласованноеСДилером ИЛИ
			ТекЗН.ВидРемонта=Справочники.ВидыРемонта.ДополнительноеОборудование ИЛИ 
			ТекЗН.ВидРемонта=Справочники.ВидыРемонта.ДополнительноеОборудованиеСубподряд Тогда
			Строка.УстановкаДО = "ДА";		
		Иначе			
			Строка.УстановкаДО = "НЕТ";				
		КонецЕсли;
		
		Если ТекЗН.ВидРемонта=Справочники.ВидыРемонта.ПредпродажнаяПодготовка Тогда
			Строка.ПредпродажнаяПодготовка = "ДА";		
		Иначе			
			Строка.ПредпродажнаяПодготовка = "НЕТ";				
		КонецЕсли;
		
		Строка.ТипДокумента = "Заказ-наряд";
		Строка.Мойка = "ДА";
		Строка.Диагностика = "ДА";
		//Бондаренко-- 20220429
		
		Строка.Дилер = Дилер.НаименованиеДляПечати;
		Строка.КодДилера = КодДилера;
		Строка.Владелец = ТекВладелец;
		Строка.ТелефонВладельца = Прав(Строка.Владелец.ОсновнойТелефон,10);
		Строка.VIN = ТекАвто.VIN;
		Строка.ГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ТекАвто , Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
		Если обЗначениеНеЗаполнено(Строка.ГосНомер) Тогда
			Строка.ГосНомер = "Б/Н";
		КонецЕсли; 
		Строка.Марка = ТекАвто.Модель.Марка;
		Строка.Модель = ТекАвто.Модель;
		
		//  ПробегАвтоЧисловой = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ТекАвто, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
		//  ПробегАвтоСтроковый = СтрЗаменить(ПробегАвтоЧисловой,Символы.НПП,"");
		//Строка.Пробег = СокрЛП(ПробегАвтоСтроковый);
		
		ПробегАвтоСтроковый = СтрЗаменить(Строка.Ссылка.Пробег,Символы.НПП,"");
		Строка.Пробег = СокрЛП(ПробегАвтоСтроковый);
		
		Если ТекЗаказчик.ФормаСобственности=Перечисления.ФормыСобственности.ЧастноеЛицо ИЛИ ТекЗаказчик.ФормаСобственности=Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
			Строка.ТипВладельца="ФЛ";
		Иначе
			Строка.ТипВладельца="ЮЛ";
		КонецЕсли; 
		Строка.КонтактноеЛицо = ТекЗаказчик;
		Строка.ТелефонКонтактногоЛица = Прав(ТекЗаказчик.ОсновнойТелефон,10);
		Строка.ДатаОбращения = ТекДатаЗН;
		
		//Бондаренко++ 20220502
		ПричинаОбращения = СокрЛП(ТекЗН.ПричинаОбращения);     
		ПричинаОбращения = СтрЗаменить(ПричинаОбращения,Символы.ПС,",");
		ПричинаОбращения = СтрЗаменить(ПричинаОбращения,";",",");
		Строка.ПричинаОбращения = ПричинаОбращения;	
		
		Рекомендации = СокрЛП(ТекЗН.Рекомендации);              
		Рекомендации = СтрЗаменить(Рекомендации,Символы.ПС,",");
		Рекомендации = СтрЗаменить(Рекомендации,";",",");
		Строка.Рекомендации = Рекомендации;
		//Бондаренко-- 20220502
		
		Строка.ДатаСозданияЗН     = ТекДатаЗН;
		Строка.ДатаНачалаРабот    = ТекДатаЗН;
		Строка.ДатаОкончанияРабот = ТекДатаЗН;
		Строка.ДатаЗакрытия       = ТекДатаЗН;
		
		Строка.ДобраяВоля         = "НЕТ";
		Строка.ТО                 = "НЕТ";
		Строка.СервиснаяКомпания  = "НЕТ";
		Строка.КузовнойРемонт     = "ДА";
		Строка.СлесарныйРемонт 	  = "НЕТ";
		Строка.Акция 	          = "НЕТ";  
		
		//Бондаренко++ 20220819
		Если ЭтоАкция(ТекЗН) Тогда
			Строка.Акция = "ДА";  		
		КонецЕсли;
		//Бондаренко-- 20220819
		
		Если    Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ГарантияПроизводителя Или Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ГарантияДистирибьютера ИЛИ
			Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ГарантияHPromise Или Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ГарантияПроизводителяЛКП ИЛИ 
			Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ДобраяВоляПроизводителя Тогда
			Строка.ТипРемонта = "Гарантийный";
		ИначеЕсли Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ДобраяВоляКомпании Тогда 
			Строка.ТипРемонта = "Внутренний";	
			Строка.ДобраяВоля = "ДА";
		Иначе 
			Строка.ТипРемонта = "Коммерческий";	
			Если Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ТехническоеОбслуживание ИЛИ 
				Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ТО_ноль ИЛИ 
				Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ТехническоеОбслуживаниеБесплатное ИЛИ
				Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ТО_нольПлатный Тогда 
				Строка.ТО = "ДА";
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЦикла;
	
	//=========================== 2 часть ===
	
	ТекстЗН = Новый ТекстовыйДокумент; 
	
	//ТекстЗН.ДобавитьСтроку( "Дилер;код дилера;Номер заказ-наряда;ФИО владельца;Телефон владельца;VIN номер автомобиля;Гос.номер автомобиля;Марка автомобиля;Модель автомобиля;Пробег (км);Тип владельца;Контактное лицо;Телефон контактного лица;Дата обращения клиента;причина обращения;Дата содания заказ-наряда;Дата начала работ;Дата окончания работ;Дата закрытия заказ-наряда;Тип ремонта;Вид ремонта;;;;;" );
	//ТекстЗН.ДобавитьСтроку( ";;;;;;;;;;;;;;;;;;;;ТО;Сервисная кампания;Гудвилл;Слесарный ремонт;Кузовной ремонт;Акция" );
	
	ТекстЗН.ДобавитьСтроку( "Дилер;;Документ(заказ-наряд или продажа детали);Автомобиль;;;;;Владелец;;;Контактное лицо;;;СОПД;Согласие на контакт;;;Обращение;;;Дата заказ-наряда / продажи детали;;;;Тип ремонта;Вид ремонта;;;;;;;;Код мастера -консультанта;;;Дополнительные атрибуты версии 2.1;;");
	ТекстЗН.ДобавитьСтроку("Наименование;Код;;VIN номер;Гос.номер;Марка;Модель;Пробег (км);Наименование;Телефон;Тип;Наименование;Телефон;Email;;Телефон;Email;SMS;Дата;Причина;Рекомендации;Создания;Начала работ;Окончания работ;Закрытия;;ТО;Сервисная кампания;Гудвилл;Слесарный ремонт;Кузовной ремонт;Ремонт по акции;Установка ДО;ППП;Открыл ЗН;Работал с ЗН;Закрыл ЗН;Тип документа;Мойка;Диагностика");
	
	Для каждого Строка Из Состав Цикл
		ТекстЗН.ДобавитьСтроку(СтрЗаменить(Строка.Дилер,"""","'") + ";"+
		Строка.КодДилера + ";"+
		Строка.Номер + ";"+
		Строка.VIN + ";"+
		Строка.ГосНомер + ";"+
		Строка.Марка + ";"+
		Строка.Модель + ";"+
		Строка.Пробег + ";"+
		
		Строка.Владелец + ";"+
		Строка.ТелефонВладельца + ";"+		
		Строка.ТипВладельца + ";"+
		
		Строка.КонтактноеЛицо + ";"+
		Строка.ТелефонКонтактногоЛица + ";"+
		Строка.ЕмэйлКонтактногоЛица + ";"+
		
		Строка.ФлагСОПД+ ";"+
		Строка.ФлагТелефон+ ";"+		
		Строка.ФлагЕмэйл+ ";"+		
		Строка.ФлагСмс+ ";"+		
		
		Сред(Строка.ДатаОбращения,1,10) + ";"+
		Строка.ПричинаОбращения + ";"+
		
		Строка.Рекомендации + ";"+		
		
		Сред(Строка.ДатаСозданияЗН,1,10) + ";"+
		Сред(Строка.ДатаНачалаРабот,1,10) + ";"+
		Сред(Строка.ДатаОкончанияРабот,1,10) + ";"+
		Сред(Строка.ДатаЗакрытия,1,10) + ";"+
		Строка.ТипРемонта+ ";"+
		Строка.ТО + ";"+
		Строка.СервиснаяКомпания + ";"+
		Строка.ДобраяВоля + ";"+
		Строка.СлесарныйРемонт + ";"+
		Строка.КузовнойРемонт + ";"+
		Строка.Акция + ";"+
		
		Строка.УстановкаДО + ";"+
		Строка.ПредпродажнаяПодготовка + ";"+		
		
		Строка.КодМастерОткрыл + ";"+		
		Строка.КодМастерРаботал + ";"+		
		Строка.КодМастерЗакрыл + ";"+		
		Строка.ТипДокумента + ";"+		
		Строка.Мойка + ";"+		
		Строка.Диагностика); 
	КонецЦикла;
	
	
	Попытка
		ТекстЗН.Записать(ИмяФайла); 
	Исключение
		//Сообщить("ОШИБКА! Не удалось записать файл с заголовками заказ-нарядов "+ИмяФайлаСработами);	
	КонецПопытки; 
	
	ТекстСРаботами = Новый ТекстовыйДокумент;
	ТекстСРаботами.ДобавитьСтроку("Номер заказ-наряда;Тип позиции;Номер позиции;Код позиции;номера заказа з/ч;Наименование позиции;Количество;Итоговая стоимость;Расширение заказ-наряда;В наличии");
	Для каждого Строка Из РаботыЗН Цикл
		ТекстСРаботами.ДобавитьСтроку(Строка.Номер + ";"+
		Строка.ТипПозиции + ";"+
		Строка.НомерПозиции + ";"+
		Строка.КодПозиции + ";"+
		" " + ";"+
		СтрЗаменить(Строка.НаименованиеПозиции,";","") + ";"+
		СтрЗаменить(Строка.Количество,Символы.НПП,"") + ";"+
		СтрЗаменить(Строка.ИтоговаяСтоимость,Символы.НПП,"") + ";"+
		Строка.РасширениеЗН + ";"+
		Строка.Вналичии); 
	КонецЦикла;
	Попытка
		ТекстСРаботами.Записать(ИмяФайлаСработами); 
	Исключение
		//Сообщить("ОШИБКА! Не удалось записать файл с работами заказ-нарядов");	
	КонецПопытки; 
	
	//=========================== 3 часть ===
	
	Если Состав.Количество()+РаботыЗН.Количество() > 0 Тогда
		
		ДвоичныеДанныеЗН=Новый ДвоичныеДанные(ИмяФайла);
		АдресВХ_ЗН = ПоместитьВоВременноеХранилище(ДвоичныеДанныеЗН);
		
		ДвоичныеДанныеРабот=Новый ДвоичныеДанные(ИмяФайлаСРаботами);
		АдресВХ_Работ = ПоместитьВоВременноеХранилище(ДвоичныеДанныеРабот);
		
		ВыгрузкаНаПорталЧери(АдресВХ_ЗН,АдресВХ_Работ);	
		
	КонецЕсли; 
	
КонецПроцедуры //ВыгрузитьЗНпоЧери(Параметры = Неопределено) Экспорт
//Бондаренко-- 20200122  

//Бондаренко++ 20221111
Процедура ВыгрузитьЗНпоЭксид(Параметры = Неопределено)  Экспорт
	
	РаботыЗН = Новый ТаблицаЗначений;
	РаботыЗН.Колонки.Добавить("Номер");
	РаботыЗН.Колонки.Добавить("ТипПозиции");
	РаботыЗН.Колонки.Добавить("НомерПозиции");
	РаботыЗН.Колонки.Добавить("КодПозиции");
	РаботыЗН.Колонки.Добавить("НомерЗаказЗапчасти");
	РаботыЗН.Колонки.Добавить("НаименованиеПозиции");
	РаботыЗН.Колонки.Добавить("Количество");
	РаботыЗН.Колонки.Добавить("ИтоговаяСтоимость");
	РаботыЗН.Колонки.Добавить("РасширениеЗН");
	РаботыЗН.Колонки.Добавить("Вналичии");
	РаботыЗН.Колонки.Добавить("Ссылка");
	РаботыЗН.Колонки.Добавить("ТипРемонта");
	
	//Бондаренко++ 20230624
	//Престиж Моторс ООО
	Дилер = Справочники.Организации.НайтиПоРеквизиту("ИНН","6168069282");
	КодДилера = "6125600"; 
	//Атлант Моторс ООО
	Дилер = Справочники.Организации.НайтиПоРеквизиту("ИНН","6167104657");
	КодДилера = "61104EX00"; 
	//Бондаренко-- 20230624
	
	ГдеСоздавать = КаталогВременныхФайлов();
	ИмяФайла = ГдеСоздавать+"file1.txt";
	ИмяФайлаСРаботами = ГдеСоздавать+"file2.txt";
	
	//=========================== 1 часть ===
	
	ТехническоеОбслуживание            = Справочники.ВидыРемонта.ТехническоеОбслуживание;
	КоммерческийРемонт                 = Справочники.ВидыРемонта.КоммерческийРемонт;     
	ТехническоеОбслуживаниеБесплатное  = Справочники.ВидыРемонта.ТехническоеОбслуживаниеБесплатное;
	ГарантияПроизводителя              = Справочники.ВидыРемонта.ГарантияПроизводителя;
	//Бондаренко++ 20230714
	ПредпродажнаяПодготовка            = Справочники.ВидыРемонта.ПредпродажнаяПодготовка;
	//Бондаренко-- 20230714
	
	СзВидРемонта = Новый СписокЗначений;
	СзВидРемонта.Добавить(ТехническоеОбслуживание);
	СзВидРемонта.Добавить(КоммерческийРемонт);
	СзВидРемонта.Добавить(ТехническоеОбслуживаниеБесплатное);
	СзВидРемонта.Добавить(ГарантияПроизводителя);
	//Бондаренко++ 20230714
	СзВидРемонта.Добавить(ПредпродажнаяПодготовка);
	//Бондаренко-- 20230714
	
	Запрос = Новый Запрос;
	
	Если ТипЗНЧ(Параметры) <> Тип("ДокументСсылка.ЗаказНаряд") Тогда  
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНарядРаботы.Ссылка,
		|	ЗаказНарядРаботы.Ссылка.Дата КАК Дата,
		|	ЗаказНарядРаботы.Ссылка.Организация,
		|	ЗаказНарядРаботы.Ссылка.Проведен,
		|	ЗаказНарядРаботы.НомерСтроки КАК НомерПозиции,
		|	ЗаказНарядРаботы.Работа КАК НаименованиеПозиции,
		|	""РАБОТА"" КАК ТипПозиции,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗаказНарядРаботы.Работа.Артикул, """") = """"
		|			ТОГДА ЗаказНарядРаботы.Работа.Код
		|		ИНАЧЕ ЗаказНарядРаботы.Работа.Артикул
		|	КОНЕЦ КАК КодПозиции,
		|	ЗаказНарядРаботы.Количество * ЗаказНарядРаботы.Коэффициент КАК Количество,
		|	ЗаказНарядРаботы.СуммаВсего КАК ИтоговаяСтоимость,
		|	""НЕТ"" КАК РасширениеЗН,
		|	""ДА"" КАК Вналичии,
		|	ЗаказНарядРаботы.Ссылка.Номер КАК Номер,
		|	ЗаказНарядРаботы.Ссылка.Состояние,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта.Наименование КАК ТипРемонта,
		|	ЗаказНарядРаботы.Ссылка.Пробег КАК Пробег
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		|ГДЕ
		|	ЗаказНарядРаботы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ЗаказНарядРаботы.Ссылка.Проведен = ИСТИНА
		|	И ЗаказНарядРаботы.Ссылка.Организация = &Организация
		|	И ЗаказНарядРаботы.Ссылка.Автомобиль.Модель.Марка = &Марка
		|	И ЗаказНарядРаботы.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|	И ЗаказНарядРаботы.Ссылка.ВидРемонта В(&СзВидРемонта)
		|	И ЗаказНарядРаботы.Ссылка.Пробег > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНарядТовары.Ссылка,
		|	ЗаказНарядТовары.Ссылка.Дата,
		|	ЗаказНарядТовары.Ссылка.Организация,
		|	ЗаказНарядТовары.Ссылка.Проведен,
		|	ЗаказНарядТовары.НомерСтроки,
		|	ЗаказНарядТовары.Номенклатура,
		|	""ДЕТАЛЬ"",
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗаказНарядТовары.Номенклатура.Артикул, """") = """"
		|			ТОГДА ЗаказНарядТовары.Номенклатура.Код
		|		ИНАЧЕ ЗаказНарядТовары.Номенклатура.Артикул
		|	КОНЕЦ,
		|	ЗаказНарядТовары.Количество * ЗаказНарядТовары.Коэффициент,
		|	ЗаказНарядТовары.СуммаВсего,
		|	""НЕТ"",
		|	""ДА"",
		|	ЗаказНарядТовары.Ссылка.Номер,
		|	ЗаказНарядТовары.Ссылка.Состояние,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта.Наименование,
		|	ЗаказНарядТовары.Ссылка.Пробег
		|ИЗ
		|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|ГДЕ
		|	ЗаказНарядТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ЗаказНарядТовары.Ссылка.Проведен = ИСТИНА
		|	И ЗаказНарядТовары.Ссылка.Организация = &Организация
		|	И ЗаказНарядТовары.Ссылка.Автомобиль.Модель.Марка = &Марка
		|	И ЗаказНарядТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|	И ЗаказНарядТовары.Ссылка.ВидРемонта В(&СзВидРемонта)
		|	И ЗаказНарядТовары.Ссылка.Пробег > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	Номер";
		
		Запрос.УстановитьПараметр("ДатаНачала",    НачалоДня(ТекущаяДата() - 86400 * 10 ));   //Минус 10 дней 
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()  - 86400     ));   //Минус  1 день
		Запрос.УстановитьПараметр("Марка", Справочники.Марка.EXEED);
		Запрос.УстановитьПараметр("Организация", Дилер);
		Запрос.УстановитьПараметр("СзВидРемонта",СзВидРемонта);
		Запрос.УстановитьПараметр("ВидЗначения",Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНарядРаботы.Ссылка,
		|	ЗаказНарядРаботы.Ссылка.Дата КАК Дата,
		|	ЗаказНарядРаботы.Ссылка.Организация,
		|	ЗаказНарядРаботы.Ссылка.Проведен,
		|	ЗаказНарядРаботы.НомерСтроки КАК НомерПозиции,
		|	ЗаказНарядРаботы.Работа КАК НаименованиеПозиции,
		|	""РАБОТА"" КАК ТипПозиции,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗаказНарядРаботы.Работа.Артикул, """") = """"
		|			ТОГДА ЗаказНарядРаботы.Работа.Код
		|		ИНАЧЕ ЗаказНарядРаботы.Работа.Артикул
		|	КОНЕЦ КАК КодПозиции,
		|	ЗаказНарядРаботы.Количество * ЗаказНарядРаботы.Коэффициент КАК Количество,
		|	ЗаказНарядРаботы.СуммаВсего КАК ИтоговаяСтоимость,
		|	""НЕТ"" КАК РасширениеЗН,
		|	""ДА"" КАК Вналичии,
		|	ЗаказНарядРаботы.Ссылка.Номер КАК Номер,
		|	ЗаказНарядРаботы.Ссылка.Состояние,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта.Наименование КАК ТипРемонта,
		|	ЗаказНарядРаботы.Ссылка.Пробег КАК Пробег
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		|ГДЕ
		|	ЗаказНарядРаботы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНарядТовары.Ссылка,
		|	ЗаказНарядТовары.Ссылка.Дата,
		|	ЗаказНарядТовары.Ссылка.Организация,
		|	ЗаказНарядТовары.Ссылка.Проведен,
		|	ЗаказНарядТовары.НомерСтроки,
		|	ЗаказНарядТовары.Номенклатура,
		|	""ДЕТАЛЬ"",
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗаказНарядТовары.Номенклатура.Артикул, """") = """"
		|			ТОГДА ЗаказНарядТовары.Номенклатура.Код
		|		ИНАЧЕ ЗаказНарядТовары.Номенклатура.Артикул
		|	КОНЕЦ,
		|	ЗаказНарядТовары.Количество * ЗаказНарядТовары.Коэффициент,
		|	ЗаказНарядТовары.СуммаВсего,
		|	""НЕТ"",
		|	""ДА"",
		|	ЗаказНарядТовары.Ссылка.Номер,
		|	ЗаказНарядТовары.Ссылка.Состояние,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта.Наименование,
		|	ЗаказНарядТовары.Ссылка.Пробег
		|ИЗ
		|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|ГДЕ
		|	ЗаказНарядТовары.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	Номер";
		
		Запрос.УстановитьПараметр("Ссылка", Параметры);  
		
	КонецЕсли;
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	РаботыЗН=ТЗ.Скопировать();
	
	ТЗ.Свернуть("Ссылка,Номер,Дата");
	
	ТЗ.Сортировать("Дата,Номер");
	
	Состав = Новый ТаблицаЗначений;
	Состав=ТЗ.Скопировать(,"Ссылка,Номер,Дата");
	
	ВсегоСтрок = Состав.Количество();
	
	Состав.Колонки.Добавить("Дилер");
	Состав.Колонки.Добавить("КодДилера");
	Состав.Колонки.Добавить("Владелец");
	Состав.Колонки.Добавить("ТелефонВладельца");
	Состав.Колонки.Добавить("VIN");
	Состав.Колонки.Добавить("ГосНомер");
	Состав.Колонки.Добавить("Марка");
	Состав.Колонки.Добавить("Модель");
	Состав.Колонки.Добавить("Пробег");
	Состав.Колонки.Добавить("ТипВладельца");
	Состав.Колонки.Добавить("КонтактноеЛицо");
	Состав.Колонки.Добавить("ТелефонКонтактногоЛица");
	Состав.Колонки.Добавить("ДатаОбращения");
	Состав.Колонки.Добавить("ПричинаОбращения");
	Состав.Колонки.Добавить("ДатаСозданияЗН");
	Состав.Колонки.Добавить("ДатаНачалаРабот");
	Состав.Колонки.Добавить("ДатаОкончанияРабот");
	Состав.Колонки.Добавить("ДатаЗакрытия");
	Состав.Колонки.Добавить("ТО");
	Состав.Колонки.Добавить("СервиснаяКомпания");
	Состав.Колонки.Добавить("ДобраяВоля");
	Состав.Колонки.Добавить("СлесарныйРемонт");
	Состав.Колонки.Добавить("КузовнойРемонт");
	Состав.Колонки.Добавить("Акция");
	Состав.Колонки.Добавить("ТипРемонта"); 
	
	//Бондаренко++ 20220429
	Состав.Колонки.Добавить("ЕмэйлКонтактногоЛица");
	
	Состав.Колонки.Добавить("ФлагСОПД");
	Состав.Колонки.Добавить("ФлагТелефон");
	Состав.Колонки.Добавить("ФлагЕмэйл");
	Состав.Колонки.Добавить("ФлагСМС"); 
	
	Состав.Колонки.Добавить("Рекомендации");
	Состав.Колонки.Добавить("УстановкаДО");
	Состав.Колонки.Добавить("ПредпродажнаяПодготовка");
	
	Состав.Колонки.Добавить("КодМастерОткрыл");  
	Состав.Колонки.Добавить("КодМастерРаботал");
	Состав.Колонки.Добавить("КодМастерЗакрыл");
	
	Состав.Колонки.Добавить("ТипДокумента");
	Состав.Колонки.Добавить("Мойка");
	Состав.Колонки.Добавить("Диагностика");
	//Бондаренко-- 20220429
	
	Для Каждого Строка Из Состав Цикл
		
		ТекЗН = Строка.Ссылка;
		ТекАвто = ТекЗН.Автомобиль;
		ТекЗаказчик = ТекЗН.Заказчик;
		ТекДатаЗН = ТекЗН.Дата;
		
		ТекВладелец = ТекЗН.Заказчик;
		ТекКонтактноеЛицо = ТекЗН._г_ДоверенноеЛицоЗаказчика;
		
		//Бондаренко++ 20230926                                 
		ТабНомерМастера         = СокрЛП(ТекЗН.Диспетчер.ТабельныйНомер);
		Строка.КодМастерОткрыл  = ТабНомерМастера;
		Строка.КодМастерРаботал = ТабНомерМастера;
		Строка.КодМастерЗакрыл  = ТабНомерМастера;
		//Бондаренко-- 20230926
		
		//Бондаренко++ 20220429
		Строка.ТелефонКонтактногоЛица = СокрЛП(ТекЗН.ПредставлениеТелефона);
		
		Если обЗначениеНеЗаполнено(ТекКонтактноеЛицо) Тогда
			ЕмэйлКонтактногоЛица = ТекЗН.Заказчик.ОсновнойАдресЭлектроннойПочты;
		Иначе			
			ЕмэйлКонтактногоЛица = ТекЗН._г_ДоверенноеЛицоЗаказчика.ОсновнойАдресЭлектроннойПочты;
		КонецЕсли;
		
		Строка.ЕмэйлКонтактногоЛица = ЕмэйлКонтактногоЛица;	
		
		Если ТекЗН.Заказчик.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо ИЛИ ТекЗН.Заказчик.ФормаСобственности = Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
			ФлагСОПД = ?(ТекЗН.Заказчик.СогласиеНаОбработкуПерсональныхДанных=Перечисления.ВариантыОтветов.Да,"ДА","НЕТ");
			ФлагСмс = ?(ТекЗН.Заказчик.СогласиеНаПолучениеSMS=Перечисления.ВариантыОтветов.Да,"ДА","НЕТ");
		Иначе			
			ФлагСОПД = "НЕТ";   
			ФлагСмс  = "НЕТ";
		КонецЕсли;
		
		Строка.ФлагСОПД = ФлагСОПД; 
		Строка.ФлагТелефон = ФлагСОПД; 
		Строка.ФлагЕмэйл = ФлагСОПД;
		Строка.ФлагСмс = ФлагСмс; 
		
		//Строка.Рекомендации = СокрЛП(ТекЗН.Рекомендации);
		
		Если ТекЗН.ВидРемонта=Справочники.ВидыРемонта.ДопОборудованиеСогласованноеСДилером ИЛИ
			ТекЗН.ВидРемонта=Справочники.ВидыРемонта.ДополнительноеОборудование ИЛИ 
			ТекЗН.ВидРемонта=Справочники.ВидыРемонта.ДополнительноеОборудованиеСубподряд Тогда
			Строка.УстановкаДО = "ДА";		
		Иначе			
			Строка.УстановкаДО = "НЕТ";				
		КонецЕсли;
		
		Если ТекЗН.ВидРемонта=Справочники.ВидыРемонта.ПредпродажнаяПодготовка Тогда
			Строка.ПредпродажнаяПодготовка = "ДА";		
		Иначе			
			Строка.ПредпродажнаяПодготовка = "НЕТ";				
		КонецЕсли;
		
		Строка.ТипДокумента = "Заказ-наряд";
		Строка.Мойка = "ДА";
		Строка.Диагностика = "ДА";
		//Бондаренко-- 20220429
		
		Строка.Дилер = Дилер.НаименованиеДляПечати;
		Строка.КодДилера = КодДилера;
		Строка.Владелец = ТекВладелец;
		Строка.ТелефонВладельца = Прав(Строка.Владелец.ОсновнойТелефон,10);
		Строка.VIN = ТекАвто.VIN;
		Строка.ГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ТекАвто , Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
		Если обЗначениеНеЗаполнено(Строка.ГосНомер) Тогда
			Строка.ГосНомер = "Б/Н";
		КонецЕсли; 
		Строка.Марка = ТекАвто.Модель.Марка;
		Строка.Модель = ТекАвто.Модель;
		
		//  ПробегАвтоЧисловой = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ТекАвто, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
		//  ПробегАвтоСтроковый = СтрЗаменить(ПробегАвтоЧисловой,Символы.НПП,"");
		//Строка.Пробег = СокрЛП(ПробегАвтоСтроковый);
		
		ПробегАвтоСтроковый = СтрЗаменить(Строка.Ссылка.Пробег,Символы.НПП,"");
		Строка.Пробег = СокрЛП(ПробегАвтоСтроковый);
		
		Если ТекЗаказчик.ФормаСобственности=Перечисления.ФормыСобственности.ЧастноеЛицо ИЛИ ТекЗаказчик.ФормаСобственности=Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
			Строка.ТипВладельца="ФЛ";
		Иначе
			Строка.ТипВладельца="ЮЛ";
		КонецЕсли; 
		Строка.КонтактноеЛицо = ТекЗаказчик;
		Строка.ТелефонКонтактногоЛица = Прав(ТекЗаказчик.ОсновнойТелефон,10);
		Строка.ДатаОбращения = ТекДатаЗН;
		
		//Бондаренко++ 20220502
		ПричинаОбращения = СокрЛП(ТекЗН.ПричинаОбращения);     
		ПричинаОбращения = СтрЗаменить(ПричинаОбращения,Символы.ПС,",");
		ПричинаОбращения = СтрЗаменить(ПричинаОбращения,";",",");
		Строка.ПричинаОбращения = ПричинаОбращения;	
		
		Рекомендации = СокрЛП(ТекЗН.Рекомендации);              
		Рекомендации = СтрЗаменить(Рекомендации,Символы.ПС,",");
		Рекомендации = СтрЗаменить(Рекомендации,";",",");
		Строка.Рекомендации = Рекомендации;
		//Бондаренко-- 20220502
		
		Строка.ДатаСозданияЗН     = ТекДатаЗН;
		Строка.ДатаНачалаРабот    = ТекДатаЗН;
		Строка.ДатаОкончанияРабот = ТекДатаЗН;
		Строка.ДатаЗакрытия       = ТекДатаЗН;
		
		Строка.ДобраяВоля         = "НЕТ";
		Строка.ТО                 = "НЕТ";
		Строка.СервиснаяКомпания  = "НЕТ";
		Строка.КузовнойРемонт     = "ДА";
		Строка.СлесарныйРемонт 	  = "НЕТ";
		Строка.Акция 	          = "НЕТ";  
		
		//Бондаренко++ 20220819
		Если ЭтоАкция(ТекЗН) Тогда
			Строка.Акция = "ДА";  		
		КонецЕсли;
		//Бондаренко-- 20220819
		
		Если    Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ГарантияПроизводителя Или Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ГарантияДистирибьютера ИЛИ
			Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ГарантияHPromise Или Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ГарантияПроизводителяЛКП ИЛИ 
			Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ДобраяВоляПроизводителя Тогда
			Строка.ТипРемонта = "Гарантийный";
		ИначеЕсли Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ДобраяВоляКомпании Тогда 
			Строка.ТипРемонта = "Внутренний";	
			Строка.ДобраяВоля = "ДА";
		Иначе 
			Строка.ТипРемонта = "Коммерческий";	
			Если Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ТехническоеОбслуживание ИЛИ Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ТО_ноль ИЛИ Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ТехническоеОбслуживаниеБесплатное Тогда 
				Строка.ТО = "ДА";
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЦикла;
	
	//=========================== 2 часть ===
	
	ТекстЗН = Новый ТекстовыйДокумент; 
	
	//ТекстЗН.ДобавитьСтроку( "Дилер;код дилера;Номер заказ-наряда;ФИО владельца;Телефон владельца;VIN номер автомобиля;Гос.номер автомобиля;Марка автомобиля;Модель автомобиля;Пробег (км);Тип владельца;Контактное лицо;Телефон контактного лица;Дата обращения клиента;причина обращения;Дата содания заказ-наряда;Дата начала работ;Дата окончания работ;Дата закрытия заказ-наряда;Тип ремонта;Вид ремонта;;;;;" );
	//ТекстЗН.ДобавитьСтроку( ";;;;;;;;;;;;;;;;;;;;ТО;Сервисная кампания;Гудвилл;Слесарный ремонт;Кузовной ремонт;Акция" );
	
	ТекстЗН.ДобавитьСтроку( "Дилер;;Документ(заказ-наряд или продажа детали);Автомобиль;;;;;Владелец;;;Контактное лицо;;;СОПД;Согласие на контакт;;;Обращение;;;Дата заказ-наряда / продажи детали;;;;Тип ремонта;Вид ремонта;;;;;;;;Код мастера -консультанта;;;Дополнительные атрибуты версии 2.1;;");
	ТекстЗН.ДобавитьСтроку("Наименование;Код;;VIN номер;Гос.номер;Марка;Модель;Пробег (км);Наименование;Телефон;Тип;Наименование;Телефон;Email;;Телефон;Email;SMS;Дата;Причина;Рекомендации;Создания;Начала работ;Окончания работ;Закрытия;;ТО;Сервисная кампания;Гудвилл;Слесарный ремонт;Кузовной ремонт;Ремонт по акции;Установка ДО;ППП;Открыл ЗН;Работал с ЗН;Закрыл ЗН;Тип документа;Мойка;Диагностика");
	
	Для каждого Строка Из Состав Цикл
		//Бондаренко++-- 20230606
		//ТекстЗН.ДобавитьСтроку(СтрЗаменить(Строка.Дилер,"""","'") + ";"+
		ТекстЗН.ДобавитьСтроку(Строка.Дилер + ";"+
		Строка.КодДилера + ";"+
		Строка.Номер + ";"+
		Строка.VIN + ";"+
		Строка.ГосНомер + ";"+
		Строка.Марка + ";"+
		Строка.Модель + ";"+
		Строка.Пробег + ";"+
		
		Строка.Владелец + ";"+
		Строка.ТелефонВладельца + ";"+		
		Строка.ТипВладельца + ";"+
		
		Строка.КонтактноеЛицо + ";"+
		Строка.ТелефонКонтактногоЛица + ";"+
		Строка.ЕмэйлКонтактногоЛица + ";"+
		
		Строка.ФлагСОПД+ ";"+
		Строка.ФлагТелефон+ ";"+		
		Строка.ФлагЕмэйл+ ";"+		
		Строка.ФлагСмс+ ";"+		
		
		Сред(Строка.ДатаОбращения,1,10) + ";"+
		Строка.ПричинаОбращения + ";"+
		
		Строка.Рекомендации + ";"+		
		
		Сред(Строка.ДатаСозданияЗН,1,10) + ";"+
		Сред(Строка.ДатаНачалаРабот,1,10) + ";"+
		Сред(Строка.ДатаОкончанияРабот,1,10) + ";"+
		Сред(Строка.ДатаЗакрытия,1,10) + ";"+
		Строка.ТипРемонта+ ";"+
		Строка.ТО + ";"+
		Строка.СервиснаяКомпания + ";"+
		Строка.ДобраяВоля + ";"+
		Строка.СлесарныйРемонт + ";"+
		Строка.КузовнойРемонт + ";"+
		Строка.Акция + ";"+
		
		Строка.УстановкаДО + ";"+
		Строка.ПредпродажнаяПодготовка + ";"+		
		
		Строка.КодМастерОткрыл + ";"+		
		Строка.КодМастерРаботал + ";"+		
		Строка.КодМастерЗакрыл + ";"+		
		Строка.ТипДокумента + ";"+		
		Строка.Мойка + ";"+		
		Строка.Диагностика); 
	КонецЦикла;
	
	
	Попытка
		ТекстЗН.Записать(ИмяФайла); 
	Исключение
		//Сообщить("ОШИБКА! Не удалось записать файл с заголовками заказ-нарядов "+ИмяФайлаСработами);	
	КонецПопытки; 
	
	ТекстСРаботами = Новый ТекстовыйДокумент;
	ТекстСРаботами.ДобавитьСтроку("Номер заказ-наряда;Тип позиции;Номер позиции;Код позиции;номера заказа з/ч;Наименование позиции;Количество;Итоговая стоимость;Расширение заказ-наряда;В наличии");
	Для каждого Строка Из РаботыЗН Цикл
		ТекстСРаботами.ДобавитьСтроку(Строка.Номер + ";"+
		Строка.ТипПозиции + ";"+
		Строка.НомерПозиции + ";"+
		Строка.КодПозиции + ";"+
		" " + ";"+
		СтрЗаменить(Строка.НаименованиеПозиции,";","") + ";"+
		СтрЗаменить(Строка.Количество,Символы.НПП,"") + ";"+
		СтрЗаменить(Строка.ИтоговаяСтоимость,Символы.НПП,"") + ";"+
		Строка.РасширениеЗН + ";"+
		Строка.Вналичии); 
	КонецЦикла;
	Попытка
		ТекстСРаботами.Записать(ИмяФайлаСработами); 
	Исключение
		//Сообщить("ОШИБКА! Не удалось записать файл с работами заказ-нарядов");	
	КонецПопытки; 
	
	//=========================== 3 часть ===
	
	Если Состав.Количество()+РаботыЗН.Количество() > 0 Тогда
		
		ДвоичныеДанныеЗН=Новый ДвоичныеДанные(ИмяФайла);
		АдресВХ_ЗН = ПоместитьВоВременноеХранилище(ДвоичныеДанныеЗН);
		
		ДвоичныеДанныеРабот=Новый ДвоичныеДанные(ИмяФайлаСРаботами);
		АдресВХ_Работ = ПоместитьВоВременноеХранилище(ДвоичныеДанныеРабот);
		
		ВыгрузкаНаПорталЭксид(АдресВХ_ЗН,АдресВХ_Работ);	
		
	КонецЕсли; 
	
КонецПроцедуры // ВыгрузитьЗНпоЭксид(Параметры = Неопределено) Экспорт
//Бондаренко-- 20221111 

//Бондаренко++ 20220601
Процедура ВыгрузитьЗНпоОмода(Параметры = Неопределено)  Экспорт
	
	РаботыЗН = Новый ТаблицаЗначений;
	РаботыЗН.Колонки.Добавить("Номер");
	РаботыЗН.Колонки.Добавить("ТипПозиции");
	РаботыЗН.Колонки.Добавить("НомерПозиции");
	РаботыЗН.Колонки.Добавить("КодПозиции");
	РаботыЗН.Колонки.Добавить("НомерЗаказЗапчасти");
	РаботыЗН.Колонки.Добавить("НаименованиеПозиции");
	РаботыЗН.Колонки.Добавить("Количество");
	РаботыЗН.Колонки.Добавить("ИтоговаяСтоимость");
	РаботыЗН.Колонки.Добавить("РасширениеЗН");
	РаботыЗН.Колонки.Добавить("Вналичии");
	РаботыЗН.Колонки.Добавить("Ссылка");
	РаботыЗН.Колонки.Добавить("ТипРемонта");
	
	Дилер = Справочники.Организации.НайтиПоРеквизиту("ИНН","6167106118");
	КодДилера = "293839";
	
	ГдеСоздавать = КаталогВременныхФайлов();
	ИмяФайла = ГдеСоздавать+"file1.txt";
	ИмяФайлаСРаботами = ГдеСоздавать+"file2.txt";
	
	//=========================== 1 часть ===
	
	ТехническоеОбслуживание            = Справочники.ВидыРемонта.ТехническоеОбслуживание;
	КоммерческийРемонт                 = Справочники.ВидыРемонта.КоммерческийРемонт;     
	ТехническоеОбслуживаниеБесплатное  = Справочники.ВидыРемонта.ТехническоеОбслуживаниеБесплатное;
	ГарантияПроизводителя              = Справочники.ВидыРемонта.ГарантияПроизводителя;
	
	СзВидРемонта = Новый СписокЗначений;
	СзВидРемонта.Добавить(ТехническоеОбслуживание);
	СзВидРемонта.Добавить(КоммерческийРемонт);
	СзВидРемонта.Добавить(ТехническоеОбслуживаниеБесплатное);
	СзВидРемонта.Добавить(ГарантияПроизводителя);
	
	Запрос = Новый Запрос;
	
	Если ТипЗНЧ(Параметры) <> Тип("ДокументСсылка.ЗаказНаряд") Тогда  
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНарядРаботы.Ссылка,
		|	ЗаказНарядРаботы.Ссылка.Дата КАК Дата,
		|	ЗаказНарядРаботы.Ссылка.Организация,
		|	ЗаказНарядРаботы.Ссылка.Проведен,
		|	ЗаказНарядРаботы.НомерСтроки КАК НомерПозиции,
		|	ЗаказНарядРаботы.Работа КАК НаименованиеПозиции,
		|	""РАБОТА"" КАК ТипПозиции,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗаказНарядРаботы.Работа.Артикул, """") = """"
		|			ТОГДА ЗаказНарядРаботы.Работа.Код
		|		ИНАЧЕ ЗаказНарядРаботы.Работа.Артикул
		|	КОНЕЦ КАК КодПозиции,
		|	ЗаказНарядРаботы.Количество * ЗаказНарядРаботы.Коэффициент КАК Количество,
		|	ЗаказНарядРаботы.СуммаВсего КАК ИтоговаяСтоимость,
		|	""НЕТ"" КАК РасширениеЗН,
		|	""ДА"" КАК Вналичии,
		|	ЗаказНарядРаботы.Ссылка.Номер КАК Номер,
		|	ЗаказНарядРаботы.Ссылка.Состояние,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта.Наименование КАК ТипРемонта,
		|	ЗаказНарядРаботы.Ссылка.Пробег КАК Пробег
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		|ГДЕ
		|	ЗаказНарядРаботы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ЗаказНарядРаботы.Ссылка.Проведен = ИСТИНА
		|	И ЗаказНарядРаботы.Ссылка.Организация = &Организация
		|	И ЗаказНарядРаботы.Ссылка.Автомобиль.Модель.Марка = &Марка
		|	И ЗаказНарядРаботы.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|	И ЗаказНарядРаботы.Ссылка.ВидРемонта В(&СзВидРемонта)
		|	И ЗаказНарядРаботы.Ссылка.Пробег > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНарядТовары.Ссылка,
		|	ЗаказНарядТовары.Ссылка.Дата,
		|	ЗаказНарядТовары.Ссылка.Организация,
		|	ЗаказНарядТовары.Ссылка.Проведен,
		|	ЗаказНарядТовары.НомерСтроки,
		|	ЗаказНарядТовары.Номенклатура,
		|	""ДЕТАЛЬ"",
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗаказНарядТовары.Номенклатура.Артикул, """") = """"
		|			ТОГДА ЗаказНарядТовары.Номенклатура.Код
		|		ИНАЧЕ ЗаказНарядТовары.Номенклатура.Артикул
		|	КОНЕЦ,
		|	ЗаказНарядТовары.Количество * ЗаказНарядТовары.Коэффициент,
		|	ЗаказНарядТовары.СуммаВсего,
		|	""НЕТ"",
		|	""ДА"",
		|	ЗаказНарядТовары.Ссылка.Номер,
		|	ЗаказНарядТовары.Ссылка.Состояние,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта.Наименование,
		|	ЗаказНарядТовары.Ссылка.Пробег
		|ИЗ
		|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|ГДЕ
		|	ЗаказНарядТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ЗаказНарядТовары.Ссылка.Проведен = ИСТИНА
		|	И ЗаказНарядТовары.Ссылка.Организация = &Организация
		|	И ЗаказНарядТовары.Ссылка.Автомобиль.Модель.Марка = &Марка
		|	И ЗаказНарядТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|	И ЗаказНарядТовары.Ссылка.ВидРемонта В(&СзВидРемонта)
		|	И ЗаказНарядТовары.Ссылка.Пробег > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	Номер";
		
		Запрос.УстановитьПараметр("ДатаНачала",    НачалоДня(ТекущаяДата() - 86400 * 10 ));   //Минус 10 дней 
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()  - 86400     ));   //Минус  1 день
		Запрос.УстановитьПараметр("Марка", Справочники.Марка.OMODA);
		Запрос.УстановитьПараметр("Организация", Дилер);
		Запрос.УстановитьПараметр("СзВидРемонта",СзВидРемонта);
		Запрос.УстановитьПараметр("ВидЗначения",Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНарядРаботы.Ссылка,
		|	ЗаказНарядРаботы.Ссылка.Дата КАК Дата,
		|	ЗаказНарядРаботы.Ссылка.Организация,
		|	ЗаказНарядРаботы.Ссылка.Проведен,
		|	ЗаказНарядРаботы.НомерСтроки КАК НомерПозиции,
		|	ЗаказНарядРаботы.Работа КАК НаименованиеПозиции,
		|	""РАБОТА"" КАК ТипПозиции,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗаказНарядРаботы.Работа.Артикул, """") = """"
		|			ТОГДА ЗаказНарядРаботы.Работа.Код
		|		ИНАЧЕ ЗаказНарядРаботы.Работа.Артикул
		|	КОНЕЦ КАК КодПозиции,
		|	ЗаказНарядРаботы.Количество * ЗаказНарядРаботы.Коэффициент КАК Количество,
		|	ЗаказНарядРаботы.СуммаВсего КАК ИтоговаяСтоимость,
		|	""НЕТ"" КАК РасширениеЗН,
		|	""ДА"" КАК Вналичии,
		|	ЗаказНарядРаботы.Ссылка.Номер КАК Номер,
		|	ЗаказНарядРаботы.Ссылка.Состояние,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта.Наименование КАК ТипРемонта,
		|	ЗаказНарядРаботы.Ссылка.Пробег КАК Пробег
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		|ГДЕ
		|	ЗаказНарядРаботы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНарядТовары.Ссылка,
		|	ЗаказНарядТовары.Ссылка.Дата,
		|	ЗаказНарядТовары.Ссылка.Организация,
		|	ЗаказНарядТовары.Ссылка.Проведен,
		|	ЗаказНарядТовары.НомерСтроки,
		|	ЗаказНарядТовары.Номенклатура,
		|	""ДЕТАЛЬ"",
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗаказНарядТовары.Номенклатура.Артикул, """") = """"
		|			ТОГДА ЗаказНарядТовары.Номенклатура.Код
		|		ИНАЧЕ ЗаказНарядТовары.Номенклатура.Артикул
		|	КОНЕЦ,
		|	ЗаказНарядТовары.Количество * ЗаказНарядТовары.Коэффициент,
		|	ЗаказНарядТовары.СуммаВсего,
		|	""НЕТ"",
		|	""ДА"",
		|	ЗаказНарядТовары.Ссылка.Номер,
		|	ЗаказНарядТовары.Ссылка.Состояние,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта.Наименование,
		|	ЗаказНарядТовары.Ссылка.Пробег
		|ИЗ
		|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|ГДЕ
		|	ЗаказНарядТовары.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	Номер";
		
		Запрос.УстановитьПараметр("Ссылка", Параметры);  
		
	КонецЕсли;
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	РаботыЗН=ТЗ.Скопировать();
	
	ТЗ.Свернуть("Ссылка,Номер,Дата");
	
	ТЗ.Сортировать("Дата,Номер");
	
	Состав = Новый ТаблицаЗначений;
	Состав=ТЗ.Скопировать(,"Ссылка,Номер,Дата");
	
	ВсегоСтрок = Состав.Количество();
	
	Состав.Колонки.Добавить("Дилер");
	Состав.Колонки.Добавить("КодДилера");
	Состав.Колонки.Добавить("Владелец");
	Состав.Колонки.Добавить("ТелефонВладельца");
	Состав.Колонки.Добавить("VIN");
	Состав.Колонки.Добавить("ГосНомер");
	Состав.Колонки.Добавить("Марка");
	Состав.Колонки.Добавить("Модель");
	Состав.Колонки.Добавить("Пробег");
	Состав.Колонки.Добавить("ТипВладельца");
	Состав.Колонки.Добавить("КонтактноеЛицо");
	Состав.Колонки.Добавить("ТелефонКонтактногоЛица");
	Состав.Колонки.Добавить("ДатаОбращения");
	Состав.Колонки.Добавить("ПричинаОбращения");
	Состав.Колонки.Добавить("ДатаСозданияЗН");
	Состав.Колонки.Добавить("ДатаНачалаРабот");
	Состав.Колонки.Добавить("ДатаОкончанияРабот");
	Состав.Колонки.Добавить("ДатаЗакрытия");
	Состав.Колонки.Добавить("ТО");
	Состав.Колонки.Добавить("СервиснаяКомпания");
	Состав.Колонки.Добавить("ДобраяВоля");
	Состав.Колонки.Добавить("СлесарныйРемонт");
	Состав.Колонки.Добавить("КузовнойРемонт");
	Состав.Колонки.Добавить("Акция");
	Состав.Колонки.Добавить("ТипРемонта"); 
	
	//Бондаренко++ 20220429
	Состав.Колонки.Добавить("ЕмэйлКонтактногоЛица");
	
	Состав.Колонки.Добавить("ФлагСОПД");
	Состав.Колонки.Добавить("ФлагТелефон");
	Состав.Колонки.Добавить("ФлагЕмэйл");
	Состав.Колонки.Добавить("ФлагСМС"); 
	
	Состав.Колонки.Добавить("Рекомендации");
	Состав.Колонки.Добавить("УстановкаДО");
	Состав.Колонки.Добавить("ПредпродажнаяПодготовка");
	
	Состав.Колонки.Добавить("КодМастерОткрыл");  
	Состав.Колонки.Добавить("КодМастерРаботал");
	Состав.Колонки.Добавить("КодМастерЗакрыл");
	
	Состав.Колонки.Добавить("ТипДокумента");
	Состав.Колонки.Добавить("Мойка");
	Состав.Колонки.Добавить("Диагностика");
	//Бондаренко-- 20220429
	
	Для Каждого Строка Из Состав Цикл
		
		ТекЗН = Строка.Ссылка;
		ТекАвто = ТекЗН.Автомобиль;
		ТекЗаказчик = ТекЗН.Заказчик;
		ТекДатаЗН = ТекЗН.Дата;
		
		ТекВладелец = ТекЗН.Заказчик;
		ТекКонтактноеЛицо = ТекЗН._г_ДоверенноеЛицоЗаказчика;
		
		//Бондаренко++ 20230926                                 
		ТабНомерМастера         = СокрЛП(ТекЗН.Диспетчер.ТабельныйНомер);
		Строка.КодМастерОткрыл  = ТабНомерМастера;
		Строка.КодМастерРаботал = ТабНомерМастера;
		Строка.КодМастерЗакрыл  = ТабНомерМастера;
		//Бондаренко-- 20230926
		
		//Бондаренко++ 20220429
		Строка.ТелефонКонтактногоЛица = СокрЛП(ТекЗН.ПредставлениеТелефона);
		
		Если обЗначениеНеЗаполнено(ТекКонтактноеЛицо) Тогда
			ЕмэйлКонтактногоЛица = ТекЗН.Заказчик.ОсновнойАдресЭлектроннойПочты;
		Иначе			
			ЕмэйлКонтактногоЛица = ТекЗН._г_ДоверенноеЛицоЗаказчика.ОсновнойАдресЭлектроннойПочты;
		КонецЕсли;
		
		Строка.ЕмэйлКонтактногоЛица = ЕмэйлКонтактногоЛица;	
		
		Если ТекЗН.Заказчик.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо ИЛИ ТекЗН.Заказчик.ФормаСобственности = Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
			ФлагСОПД = ?(ТекЗН.Заказчик.СогласиеНаОбработкуПерсональныхДанных=Перечисления.ВариантыОтветов.Да,"ДА","НЕТ");
			ФлагСмс = ?(ТекЗН.Заказчик.СогласиеНаПолучениеSMS=Перечисления.ВариантыОтветов.Да,"ДА","НЕТ");
		Иначе			
			ФлагСОПД = "НЕТ";   
			ФлагСмс  = "НЕТ";
		КонецЕсли;
		
		Строка.ФлагСОПД = ФлагСОПД; 
		Строка.ФлагТелефон = ФлагСОПД; 
		Строка.ФлагЕмэйл = ФлагСОПД;
		Строка.ФлагСмс = ФлагСмс; 
		
		//Строка.Рекомендации = СокрЛП(ТекЗН.Рекомендации);
		
		Если ТекЗН.ВидРемонта=Справочники.ВидыРемонта.ДопОборудованиеСогласованноеСДилером ИЛИ
			ТекЗН.ВидРемонта=Справочники.ВидыРемонта.ДополнительноеОборудование ИЛИ 
			ТекЗН.ВидРемонта=Справочники.ВидыРемонта.ДополнительноеОборудованиеСубподряд Тогда
			Строка.УстановкаДО = "ДА";		
		Иначе			
			Строка.УстановкаДО = "НЕТ";				
		КонецЕсли;
		
		Если ТекЗН.ВидРемонта=Справочники.ВидыРемонта.ПредпродажнаяПодготовка Тогда
			Строка.ПредпродажнаяПодготовка = "ДА";		
		Иначе			
			Строка.ПредпродажнаяПодготовка = "НЕТ";				
		КонецЕсли;
		
		//Бондаренко++ 20230606
		//Строка.ТипДокумента = "Заказ-наряд";
		Строка.ТипДокумента = "1";
		//Бондаренко-- 20230606
		
		Строка.Мойка = "ДА";
		Строка.Диагностика = "ДА";
		//Бондаренко-- 20220429
		
		Строка.Дилер = Дилер.НаименованиеДляПечати;
		Строка.КодДилера = КодДилера;
		Строка.Владелец = ТекВладелец;
		Строка.ТелефонВладельца = Прав(Строка.Владелец.ОсновнойТелефон,10);
		Строка.VIN = ТекАвто.VIN;
		Строка.ГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ТекАвто , Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
		Если обЗначениеНеЗаполнено(Строка.ГосНомер) Тогда
			Строка.ГосНомер = "Б/Н";
		КонецЕсли; 
		Строка.Марка = ТекАвто.Модель.Марка;
		Строка.Модель = ТекАвто.Модель;
		
		//  ПробегАвтоЧисловой = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ТекАвто, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
		//  ПробегАвтоСтроковый = СтрЗаменить(ПробегАвтоЧисловой,Символы.НПП,"");
		//Строка.Пробег = СокрЛП(ПробегАвтоСтроковый);
		
		ПробегАвтоСтроковый = СтрЗаменить(Строка.Ссылка.Пробег,Символы.НПП,"");
		Строка.Пробег = СокрЛП(ПробегАвтоСтроковый);
		
		Если ТекЗаказчик.ФормаСобственности=Перечисления.ФормыСобственности.ЧастноеЛицо ИЛИ ТекЗаказчик.ФормаСобственности=Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
			Строка.ТипВладельца="ФЛ";
		Иначе
			Строка.ТипВладельца="ЮЛ";
		КонецЕсли; 
		Строка.КонтактноеЛицо = ТекЗаказчик;
		Строка.ТелефонКонтактногоЛица = Прав(ТекЗаказчик.ОсновнойТелефон,10);
		Строка.ДатаОбращения = ТекДатаЗН;
		
		//Бондаренко++ 20220502
		ПричинаОбращения = СокрЛП(ТекЗН.ПричинаОбращения);     
		ПричинаОбращения = СтрЗаменить(ПричинаОбращения,Символы.ПС,",");
		ПричинаОбращения = СтрЗаменить(ПричинаОбращения,";",",");
		Строка.ПричинаОбращения = ПричинаОбращения;	
		
		Рекомендации = СокрЛП(ТекЗН.Рекомендации);              
		Рекомендации = СтрЗаменить(Рекомендации,Символы.ПС,",");
		Рекомендации = СтрЗаменить(Рекомендации,";",",");
		Строка.Рекомендации = Рекомендации;
		//Бондаренко-- 20220502
		
		Строка.ДатаСозданияЗН     = ТекДатаЗН;
		Строка.ДатаНачалаРабот    = ТекДатаЗН;
		Строка.ДатаОкончанияРабот = ТекДатаЗН;
		Строка.ДатаЗакрытия       = ТекДатаЗН;
		
		Строка.ДобраяВоля         = "НЕТ";
		Строка.ТО                 = "НЕТ";
		Строка.СервиснаяКомпания  = "НЕТ";
		Строка.КузовнойРемонт     = "ДА";
		Строка.СлесарныйРемонт 	  = "НЕТ";
		Строка.Акция 	          = "НЕТ";  
		
		//Бондаренко++ 20220819
		Если ЭтоАкция(ТекЗН) Тогда
			Строка.Акция = "ДА";  		
		КонецЕсли;
		//Бондаренко-- 20220819
		
		Если    Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ГарантияПроизводителя Или Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ГарантияДистирибьютера ИЛИ
			Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ГарантияHPromise Или Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ГарантияПроизводителяЛКП ИЛИ 
			Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ДобраяВоляПроизводителя Тогда
			Строка.ТипРемонта = "Гарантийный";
		ИначеЕсли Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ДобраяВоляКомпании Тогда 
			Строка.ТипРемонта = "Внутренний";	
			Строка.ДобраяВоля = "ДА";
		Иначе 
			Строка.ТипРемонта = "Коммерческий";	
			Если Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ТехническоеОбслуживание ИЛИ Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ТО_ноль ИЛИ Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ТехническоеОбслуживаниеБесплатное Тогда 
				Строка.ТО = "ДА";
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЦикла;
	
	//=========================== 2 часть ===
	
	ТекстЗН = Новый ТекстовыйДокумент; 
	
	//ТекстЗН.ДобавитьСтроку( "Дилер;код дилера;Номер заказ-наряда;ФИО владельца;Телефон владельца;VIN номер автомобиля;Гос.номер автомобиля;Марка автомобиля;Модель автомобиля;Пробег (км);Тип владельца;Контактное лицо;Телефон контактного лица;Дата обращения клиента;причина обращения;Дата содания заказ-наряда;Дата начала работ;Дата окончания работ;Дата закрытия заказ-наряда;Тип ремонта;Вид ремонта;;;;;" );
	//ТекстЗН.ДобавитьСтроку( ";;;;;;;;;;;;;;;;;;;;ТО;Сервисная кампания;Гудвилл;Слесарный ремонт;Кузовной ремонт;Акция" );
	
	ТекстЗН.ДобавитьСтроку( "Дилер;;Документ(заказ-наряд или продажа детали);Автомобиль;;;;;Владелец;;;Контактное лицо;;;СОПД;Согласие на контакт;;;Обращение;;;Дата заказ-наряда / продажи детали;;;;Тип ремонта;Вид ремонта;;;;;;;;Код мастера -консультанта;;;Дополнительные атрибуты версии 2.1;;");
	ТекстЗН.ДобавитьСтроку("Наименование;Код;;VIN номер;Гос.номер;Марка;Модель;Пробег (км);Наименование;Телефон;Тип;Наименование;Телефон;Email;;Телефон;Email;SMS;Дата;Причина;Рекомендации;Создания;Начала работ;Окончания работ;Закрытия;;ТО;Сервисная кампания;Гудвилл;Слесарный ремонт;Кузовной ремонт;Ремонт по акции;Установка ДО;ППП;Открыл ЗН;Работал с ЗН;Закрыл ЗН;Тип документа;Мойка;Диагностика");
	
	Для каждого Строка Из Состав Цикл
		ТекстЗН.ДобавитьСтроку(СтрЗаменить(Строка.Дилер,"""","'") + ";"+
		Строка.КодДилера + ";"+
		Строка.Номер + ";"+
		Строка.VIN + ";"+
		Строка.ГосНомер + ";"+
		Строка.Марка + ";"+
		Строка.Модель + ";"+
		Строка.Пробег + ";"+
		
		Строка.Владелец + ";"+
		Строка.ТелефонВладельца + ";"+		
		Строка.ТипВладельца + ";"+
		
		Строка.КонтактноеЛицо + ";"+
		Строка.ТелефонКонтактногоЛица + ";"+
		Строка.ЕмэйлКонтактногоЛица + ";"+
		
		Строка.ФлагСОПД+ ";"+
		Строка.ФлагТелефон+ ";"+		
		Строка.ФлагЕмэйл+ ";"+		
		Строка.ФлагСмс+ ";"+		
		
		Сред(Строка.ДатаОбращения,1,10) + ";"+
		Строка.ПричинаОбращения + ";"+
		
		Строка.Рекомендации + ";"+		
		
		Сред(Строка.ДатаСозданияЗН,1,10) + ";"+
		Сред(Строка.ДатаНачалаРабот,1,10) + ";"+
		Сред(Строка.ДатаОкончанияРабот,1,10) + ";"+
		Сред(Строка.ДатаЗакрытия,1,10) + ";"+
		Строка.ТипРемонта+ ";"+
		Строка.ТО + ";"+
		Строка.СервиснаяКомпания + ";"+
		Строка.ДобраяВоля + ";"+
		Строка.СлесарныйРемонт + ";"+
		Строка.КузовнойРемонт + ";"+
		Строка.Акция + ";"+
		
		Строка.УстановкаДО + ";"+
		Строка.ПредпродажнаяПодготовка + ";"+		
		
		Строка.КодМастерОткрыл + ";"+		
		Строка.КодМастерРаботал + ";"+		
		Строка.КодМастерЗакрыл + ";"+		
		Строка.ТипДокумента + ";"+		
		Строка.Мойка + ";"+		
		Строка.Диагностика); 
	КонецЦикла;
	
	
	Попытка
		ТекстЗН.Записать(ИмяФайла); 
	Исключение
		//Сообщить("ОШИБКА! Не удалось записать файл с заголовками заказ-нарядов "+ИмяФайлаСработами);	
	КонецПопытки; 
	
	ТекстСРаботами = Новый ТекстовыйДокумент;
	ТекстСРаботами.ДобавитьСтроку("Номер заказ-наряда;Тип позиции;Номер позиции;Код позиции;номера заказа з/ч;Наименование позиции;Количество;Итоговая стоимость;Расширение заказ-наряда;В наличии");
	Для каждого Строка Из РаботыЗН Цикл
		ТекстСРаботами.ДобавитьСтроку(Строка.Номер + ";"+
		Строка.ТипПозиции + ";"+
		Строка.НомерПозиции + ";"+
		Строка.КодПозиции + ";"+
		" " + ";"+
		СтрЗаменить(Строка.НаименованиеПозиции,";","") + ";"+
		СтрЗаменить(Строка.Количество,Символы.НПП,"") + ";"+
		СтрЗаменить(Строка.ИтоговаяСтоимость,Символы.НПП,"") + ";"+
		Строка.РасширениеЗН + ";"+
		Строка.Вналичии); 
	КонецЦикла;
	Попытка
		ТекстСРаботами.Записать(ИмяФайлаСработами); 
	Исключение
		//Сообщить("ОШИБКА! Не удалось записать файл с работами заказ-нарядов");	
	КонецПопытки; 
	
	//=========================== 3 часть ===
	
	Если Состав.Количество()+РаботыЗН.Количество() > 0 Тогда
		
		ДвоичныеДанныеЗН=Новый ДвоичныеДанные(ИмяФайла);
		АдресВХ_ЗН = ПоместитьВоВременноеХранилище(ДвоичныеДанныеЗН);
		
		ДвоичныеДанныеРабот=Новый ДвоичныеДанные(ИмяФайлаСРаботами);
		АдресВХ_Работ = ПоместитьВоВременноеХранилище(ДвоичныеДанныеРабот);
		
		ВыгрузкаНаПорталОмода(АдресВХ_ЗН,АдресВХ_Работ);	
		
	КонецЕсли; 
	
КонецПроцедуры // ВыгрузитьЗНпоОмода(Параметры = Неопределено) Экспорт
//Бондаренко-- 20220601  

//Бондаренко++ 20231006
Процедура ВыгрузитьЗНпоДжаеку(Параметры = Неопределено)  Экспорт
	
	РаботыЗН = Новый ТаблицаЗначений;
	РаботыЗН.Колонки.Добавить("Номер");
	РаботыЗН.Колонки.Добавить("ТипПозиции");
	РаботыЗН.Колонки.Добавить("НомерПозиции");
	РаботыЗН.Колонки.Добавить("КодПозиции");
	РаботыЗН.Колонки.Добавить("НомерЗаказЗапчасти");
	РаботыЗН.Колонки.Добавить("НаименованиеПозиции");
	РаботыЗН.Колонки.Добавить("Количество");
	РаботыЗН.Колонки.Добавить("ИтоговаяСтоимость");
	РаботыЗН.Колонки.Добавить("РасширениеЗН");
	РаботыЗН.Колонки.Добавить("Вналичии");
	РаботыЗН.Колонки.Добавить("Ссылка");
	РаботыЗН.Колонки.Добавить("ТипРемонта");
	
	Дилер = Справочники.Организации.НайтиПоРеквизиту("ИНН","6167106118");
	КодДилера = "293839";  
	
	ГдеСоздавать = КаталогВременныхФайлов();
	ИмяФайла = ГдеСоздавать+"file1.txt";
	ИмяФайлаСРаботами = ГдеСоздавать+"file2.txt";
	
	//=========================== 1 часть ===
	
	ТехническоеОбслуживание            = Справочники.ВидыРемонта.ТехническоеОбслуживание;
	КоммерческийРемонт                 = Справочники.ВидыРемонта.КоммерческийРемонт;     
	ТехническоеОбслуживаниеБесплатное  = Справочники.ВидыРемонта.ТехническоеОбслуживаниеБесплатное;
	ГарантияПроизводителя              = Справочники.ВидыРемонта.ГарантияПроизводителя;
	
	СзВидРемонта = Новый СписокЗначений;
	СзВидРемонта.Добавить(ТехническоеОбслуживание);
	СзВидРемонта.Добавить(КоммерческийРемонт);
	СзВидРемонта.Добавить(ТехническоеОбслуживаниеБесплатное);
	СзВидРемонта.Добавить(ГарантияПроизводителя);
	
	Запрос = Новый Запрос;
	
	Если ТипЗНЧ(Параметры) <> Тип("ДокументСсылка.ЗаказНаряд") Тогда  
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНарядРаботы.Ссылка,
		|	ЗаказНарядРаботы.Ссылка.Дата КАК Дата,
		|	ЗаказНарядРаботы.Ссылка.Организация,
		|	ЗаказНарядРаботы.Ссылка.Проведен,
		|	ЗаказНарядРаботы.НомерСтроки КАК НомерПозиции,
		|	ЗаказНарядРаботы.Работа КАК НаименованиеПозиции,
		|	""РАБОТА"" КАК ТипПозиции,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗаказНарядРаботы.Работа.Артикул, """") = """"
		|			ТОГДА ЗаказНарядРаботы.Работа.Код
		|		ИНАЧЕ ЗаказНарядРаботы.Работа.Артикул
		|	КОНЕЦ КАК КодПозиции,
		|	ЗаказНарядРаботы.Количество * ЗаказНарядРаботы.Коэффициент КАК Количество,
		|	ЗаказНарядРаботы.СуммаВсего КАК ИтоговаяСтоимость,
		|	""НЕТ"" КАК РасширениеЗН,
		|	""ДА"" КАК Вналичии,
		|	ЗаказНарядРаботы.Ссылка.Номер КАК Номер,
		|	ЗаказНарядРаботы.Ссылка.Состояние,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта.Наименование КАК ТипРемонта,
		|	ЗаказНарядРаботы.Ссылка.Пробег КАК Пробег
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		|ГДЕ
		|	ЗаказНарядРаботы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ЗаказНарядРаботы.Ссылка.Проведен = ИСТИНА
		|	И ЗаказНарядРаботы.Ссылка.Организация = &Организация
		|	И ЗаказНарядРаботы.Ссылка.Автомобиль.Модель.Марка = &Марка
		|	И ЗаказНарядРаботы.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|	И ЗаказНарядРаботы.Ссылка.ВидРемонта В(&СзВидРемонта)
		|	И ЗаказНарядРаботы.Ссылка.Пробег > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНарядТовары.Ссылка,
		|	ЗаказНарядТовары.Ссылка.Дата,
		|	ЗаказНарядТовары.Ссылка.Организация,
		|	ЗаказНарядТовары.Ссылка.Проведен,
		|	ЗаказНарядТовары.НомерСтроки,
		|	ЗаказНарядТовары.Номенклатура,
		|	""ДЕТАЛЬ"",
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗаказНарядТовары.Номенклатура.Артикул, """") = """"
		|			ТОГДА ЗаказНарядТовары.Номенклатура.Код
		|		ИНАЧЕ ЗаказНарядТовары.Номенклатура.Артикул
		|	КОНЕЦ,
		|	ЗаказНарядТовары.Количество * ЗаказНарядТовары.Коэффициент,
		|	ЗаказНарядТовары.СуммаВсего,
		|	""НЕТ"",
		|	""ДА"",
		|	ЗаказНарядТовары.Ссылка.Номер,
		|	ЗаказНарядТовары.Ссылка.Состояние,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта.Наименование,
		|	ЗаказНарядТовары.Ссылка.Пробег
		|ИЗ
		|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|ГДЕ
		|	ЗаказНарядТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ЗаказНарядТовары.Ссылка.Проведен = ИСТИНА
		|	И ЗаказНарядТовары.Ссылка.Организация = &Организация
		|	И ЗаказНарядТовары.Ссылка.Автомобиль.Модель.Марка = &Марка
		|	И ЗаказНарядТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|	И ЗаказНарядТовары.Ссылка.ВидРемонта В(&СзВидРемонта)
		|	И ЗаказНарядТовары.Ссылка.Пробег > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	Номер";
		
		Запрос.УстановитьПараметр("ДатаНачала",    НачалоДня(ТекущаяДата() - 86400 * 10 ));   //Минус 10 дней 
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()  - 86400     ));   //Минус  1 день
		Запрос.УстановитьПараметр("Марка", Справочники.Марка.JAECOO);
		Запрос.УстановитьПараметр("Организация", Дилер);
		Запрос.УстановитьПараметр("СзВидРемонта",СзВидРемонта);
		Запрос.УстановитьПараметр("ВидЗначения",Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНарядРаботы.Ссылка,
		|	ЗаказНарядРаботы.Ссылка.Дата КАК Дата,
		|	ЗаказНарядРаботы.Ссылка.Организация,
		|	ЗаказНарядРаботы.Ссылка.Проведен,
		|	ЗаказНарядРаботы.НомерСтроки КАК НомерПозиции,
		|	ЗаказНарядРаботы.Работа КАК НаименованиеПозиции,
		|	""1"" КАК ТипПозиции,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗаказНарядРаботы.Работа.Артикул, """") = """"
		|			ТОГДА ЗаказНарядРаботы.Работа.Код
		|		ИНАЧЕ ЗаказНарядРаботы.Работа.Артикул
		|	КОНЕЦ КАК КодПозиции,
		|	ЗаказНарядРаботы.Количество * ЗаказНарядРаботы.Коэффициент КАК Количество,
		|	ЗаказНарядРаботы.СуммаВсего КАК ИтоговаяСтоимость,
		|	""0"" КАК РасширениеЗН,
		|	""1"" КАК Вналичии,
		|	ЗаказНарядРаботы.Ссылка.Номер КАК Номер,
		|	ЗаказНарядРаботы.Ссылка.Состояние,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта.Наименование КАК ТипРемонта,
		|	ЗаказНарядРаботы.Ссылка.Пробег КАК Пробег
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		|ГДЕ
		|	ЗаказНарядРаботы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНарядТовары.Ссылка,
		|	ЗаказНарядТовары.Ссылка.Дата,
		|	ЗаказНарядТовары.Ссылка.Организация,
		|	ЗаказНарядТовары.Ссылка.Проведен,
		|	ЗаказНарядТовары.НомерСтроки,
		|	ЗаказНарядТовары.Номенклатура,
		|	""2"",
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗаказНарядТовары.Номенклатура.Артикул, """") = """"
		|			ТОГДА ЗаказНарядТовары.Номенклатура.Код
		|		ИНАЧЕ ЗаказНарядТовары.Номенклатура.Артикул
		|	КОНЕЦ,
		|	ЗаказНарядТовары.Количество * ЗаказНарядТовары.Коэффициент,
		|	ЗаказНарядТовары.СуммаВсего,
		|	""0"",
		|	""1"",
		|	ЗаказНарядТовары.Ссылка.Номер,
		|	ЗаказНарядТовары.Ссылка.Состояние,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта.Наименование,
		|	ЗаказНарядТовары.Ссылка.Пробег
		|ИЗ
		|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|ГДЕ
		|	ЗаказНарядТовары.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	Номер";
		
		Запрос.УстановитьПараметр("Ссылка", Параметры);  
		
	КонецЕсли;
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	РаботыЗН=ТЗ.Скопировать();
	
	ТЗ.Свернуть("Ссылка,Номер,Дата");
	
	ТЗ.Сортировать("Дата,Номер");
	
	Состав = Новый ТаблицаЗначений;
	Состав=ТЗ.Скопировать(,"Ссылка,Номер,Дата");
	
	ВсегоСтрок = Состав.Количество();
	
	Состав.Колонки.Добавить("Дилер");
	Состав.Колонки.Добавить("КодДилера");
	Состав.Колонки.Добавить("Владелец");
	Состав.Колонки.Добавить("ТелефонВладельца");
	Состав.Колонки.Добавить("VIN");
	Состав.Колонки.Добавить("ГосНомер");
	Состав.Колонки.Добавить("Марка");
	Состав.Колонки.Добавить("Модель");
	Состав.Колонки.Добавить("Пробег");
	Состав.Колонки.Добавить("ТипВладельца");
	Состав.Колонки.Добавить("КонтактноеЛицо");
	Состав.Колонки.Добавить("ТелефонКонтактногоЛица");
	Состав.Колонки.Добавить("ДатаОбращения");
	Состав.Колонки.Добавить("ПричинаОбращения");
	Состав.Колонки.Добавить("ДатаСозданияЗН");
	Состав.Колонки.Добавить("ДатаНачалаРабот");
	Состав.Колонки.Добавить("ДатаОкончанияРабот");
	Состав.Колонки.Добавить("ДатаЗакрытия");
	Состав.Колонки.Добавить("ТО");
	Состав.Колонки.Добавить("СервиснаяКомпания");
	Состав.Колонки.Добавить("ДобраяВоля");
	Состав.Колонки.Добавить("СлесарныйРемонт");
	Состав.Колонки.Добавить("КузовнойРемонт");
	Состав.Колонки.Добавить("Акция");
	Состав.Колонки.Добавить("ТипРемонта"); 
	
	//Бондаренко++ 20220429
	Состав.Колонки.Добавить("ЕмэйлКонтактногоЛица");
	
	Состав.Колонки.Добавить("ФлагСОПД");
	Состав.Колонки.Добавить("ФлагТелефон");
	Состав.Колонки.Добавить("ФлагЕмэйл");
	Состав.Колонки.Добавить("ФлагСМС"); 
	
	Состав.Колонки.Добавить("Рекомендации");
	Состав.Колонки.Добавить("УстановкаДО");
	Состав.Колонки.Добавить("ПредпродажнаяПодготовка");
	
	Состав.Колонки.Добавить("КодМастерОткрыл");  
	Состав.Колонки.Добавить("КодМастерРаботал");
	Состав.Колонки.Добавить("КодМастерЗакрыл");
	
	Состав.Колонки.Добавить("ТипДокумента");
	Состав.Колонки.Добавить("Мойка");
	Состав.Колонки.Добавить("Диагностика");
	//Бондаренко-- 20220429
	
	Для Каждого Строка Из Состав Цикл
		
		ТекЗН = Строка.Ссылка;
		ТекАвто = ТекЗН.Автомобиль;
		ТекЗаказчик = ТекЗН.Заказчик;
		ТекДатаЗН = ТекЗН.Дата;
		
		ТекВладелец = ТекЗН.Заказчик;
		ТекКонтактноеЛицо = ТекЗН._г_ДоверенноеЛицоЗаказчика;
		
		//Бондаренко++ 20230926                                 
		ТабНомерМастера         = СокрЛП(ТекЗН.Диспетчер.ТабельныйНомер);
		Строка.КодМастерОткрыл  = ТабНомерМастера;
		Строка.КодМастерРаботал = ТабНомерМастера;
		Строка.КодМастерЗакрыл  = ТабНомерМастера;
		//Бондаренко-- 20230926
		
		//Бондаренко++ 20220429
		Строка.ТелефонКонтактногоЛица = СокрЛП(ТекЗН.ПредставлениеТелефона);
		
		Если обЗначениеНеЗаполнено(ТекКонтактноеЛицо) Тогда
			ЕмэйлКонтактногоЛица = ТекЗН.Заказчик.ОсновнойАдресЭлектроннойПочты;
		Иначе			
			ЕмэйлКонтактногоЛица = ТекЗН._г_ДоверенноеЛицоЗаказчика.ОсновнойАдресЭлектроннойПочты;
		КонецЕсли;
		
		Строка.ЕмэйлКонтактногоЛица = ЕмэйлКонтактногоЛица;	
		
		Если ТекЗН.Заказчик.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо ИЛИ ТекЗН.Заказчик.ФормаСобственности = Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
			ФлагСОПД = ?(ТекЗН.Заказчик.СогласиеНаОбработкуПерсональныхДанных=Перечисления.ВариантыОтветов.Да,"1","0");
			ФлагСмс = ?(ТекЗН.Заказчик.СогласиеНаПолучениеSMS=Перечисления.ВариантыОтветов.Да,"1","0");
		Иначе			
			ФлагСОПД = "0";   
			ФлагСмс  = "0";
		КонецЕсли;
		
		Строка.ФлагСОПД = ФлагСОПД; 
		Строка.ФлагТелефон = ФлагСОПД; 
		Строка.ФлагЕмэйл = ФлагСОПД;
		Строка.ФлагСмс = ФлагСмс; 
		
		//Строка.Рекомендации = СокрЛП(ТекЗН.Рекомендации);
		
		Если ТекЗН.ВидРемонта=Справочники.ВидыРемонта.ДопОборудованиеСогласованноеСДилером ИЛИ
			ТекЗН.ВидРемонта=Справочники.ВидыРемонта.ДополнительноеОборудование ИЛИ 
			ТекЗН.ВидРемонта=Справочники.ВидыРемонта.ДополнительноеОборудованиеСубподряд Тогда
			Строка.УстановкаДО = "1";		
		Иначе			
			Строка.УстановкаДО = "0";				
		КонецЕсли;
		
		Если ТекЗН.ВидРемонта=Справочники.ВидыРемонта.ПредпродажнаяПодготовка Тогда
			Строка.ПредпродажнаяПодготовка = "1";		
		Иначе			
			Строка.ПредпродажнаяПодготовка = "0";				
		КонецЕсли;
		
		//Бондаренко++ 20230606
		//Строка.ТипДокумента = "Заказ-наряд";
		Строка.ТипДокумента = "1";
		//Бондаренко-- 20230606
		
		Строка.Мойка = "1";
		Строка.Диагностика = "1";
		//Бондаренко-- 20220429
		
		Строка.Дилер = Дилер.НаименованиеДляПечати;
		Строка.КодДилера = КодДилера;
		Строка.Владелец = ТекВладелец;
		Строка.ТелефонВладельца = Прав(Строка.Владелец.ОсновнойТелефон,10);
		Строка.VIN = ТекАвто.VIN;
		Строка.ГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ТекАвто , Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
		Если обЗначениеНеЗаполнено(Строка.ГосНомер) Тогда
			Строка.ГосНомер = "Б/Н";
		КонецЕсли; 
		Строка.Марка = ТекАвто.Модель.Марка;
		Строка.Модель = ТекАвто.Модель;
		
		//  ПробегАвтоЧисловой = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ТекАвто, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
		//  ПробегАвтоСтроковый = СтрЗаменить(ПробегАвтоЧисловой,Символы.НПП,"");
		//Строка.Пробег = СокрЛП(ПробегАвтоСтроковый);
		
		ПробегАвтоСтроковый = СтрЗаменить(Строка.Ссылка.Пробег,Символы.НПП,"");
		Строка.Пробег = СокрЛП(ПробегАвтоСтроковый);
		
		Если ТекЗаказчик.ФормаСобственности=Перечисления.ФормыСобственности.ЧастноеЛицо ИЛИ ТекЗаказчик.ФормаСобственности=Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
			//Бондаренко++ 20231010
			//Строка.ТипВладельца="ФЛ";
			Строка.ТипВладельца="1";
			//Бондаренко-- 20231010
		Иначе                      
			//Бондаренко++ 20231010
			//Строка.ТипВладельца="ЮЛ";
			Строка.ТипВладельца="2";
			//Бондаренко-- 20231010
		КонецЕсли; 
		Строка.КонтактноеЛицо = ТекЗаказчик;
		Строка.ТелефонКонтактногоЛица = Прав(ТекЗаказчик.ОсновнойТелефон,10);
		Строка.ДатаОбращения = ТекДатаЗН;
		
		//Бондаренко++ 20220502
		ПричинаОбращения = СокрЛП(ТекЗН.ПричинаОбращения);     
		ПричинаОбращения = СтрЗаменить(ПричинаОбращения,Символы.ПС,",");
		ПричинаОбращения = СтрЗаменить(ПричинаОбращения,";",",");
		Строка.ПричинаОбращения = ПричинаОбращения;	
		
		Рекомендации = СокрЛП(ТекЗН.Рекомендации);              
		Рекомендации = СтрЗаменить(Рекомендации,Символы.ПС,",");
		Рекомендации = СтрЗаменить(Рекомендации,";",",");
		Строка.Рекомендации = Рекомендации;
		//Бондаренко-- 20220502
		
		Строка.ДатаСозданияЗН     = ТекДатаЗН;
		Строка.ДатаНачалаРабот    = ТекДатаЗН;
		Строка.ДатаОкончанияРабот = ТекДатаЗН;
		Строка.ДатаЗакрытия       = ТекДатаЗН;
		
		Строка.ДобраяВоля         = "0";
		Строка.ТО                 = "0";
		Строка.СервиснаяКомпания  = "0";
		Строка.КузовнойРемонт     = "1";
		Строка.СлесарныйРемонт 	  = "0";
		Строка.Акция 	          = "0";  
		
		//Бондаренко++ 20220819
		Если ЭтоАкция(ТекЗН) Тогда
			Строка.Акция = "1";  		
		КонецЕсли;
		//Бондаренко-- 20220819
		
		Если    Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ГарантияПроизводителя Или Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ГарантияДистирибьютера ИЛИ
			Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ГарантияHPromise Или Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ГарантияПроизводителяЛКП ИЛИ 
			Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ДобраяВоляПроизводителя Тогда
			Строка.ТипРемонта = "3";
		ИначеЕсли Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ДобраяВоляКомпании Тогда 
			Строка.ТипРемонта = "4";	
			Строка.ДобраяВоля = "1";
		Иначе 
			Строка.ТипРемонта = "1";	
			Если Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ТехническоеОбслуживание ИЛИ Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ТО_ноль ИЛИ Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ТехническоеОбслуживаниеБесплатное Тогда 
				Строка.ТО = "1";
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЦикла;
	
	//=========================== 2 часть ===
	
	ТекстЗН = Новый ТекстовыйДокумент; 
	
	//ТекстЗН.ДобавитьСтроку( "Дилер;код дилера;Номер заказ-наряда;ФИО владельца;Телефон владельца;VIN номер автомобиля;Гос.номер автомобиля;Марка автомобиля;Модель автомобиля;Пробег (км);Тип владельца;Контактное лицо;Телефон контактного лица;Дата обращения клиента;причина обращения;Дата содания заказ-наряда;Дата начала работ;Дата окончания работ;Дата закрытия заказ-наряда;Тип ремонта;Вид ремонта;;;;;" );
	//ТекстЗН.ДобавитьСтроку( ";;;;;;;;;;;;;;;;;;;;ТО;Сервисная кампания;Гудвилл;Слесарный ремонт;Кузовной ремонт;Акция" );
	
	ТекстЗН.ДобавитьСтроку( "Дилер;;Документ(заказ-наряд или продажа детали);Автомобиль;;;;;Владелец;;;Контактное лицо;;;СОПД;Согласие на контакт;;;Обращение;;;Дата заказ-наряда / продажи детали;;;;Тип ремонта;Вид ремонта;;;;;;;;Код мастера -консультанта;;;Дополнительные атрибуты версии 2.1;;");
	ТекстЗН.ДобавитьСтроку("Наименование;Код;;VIN номер;Гос.номер;Марка;Модель;Пробег (км);Наименование;Телефон;Тип;Наименование;Телефон;Email;;Телефон;Email;SMS;Дата;Причина;Рекомендации;Создания;Начала работ;Окончания работ;Закрытия;;ТО;Сервисная кампания;Гудвилл;Слесарный ремонт;Кузовной ремонт;Ремонт по акции;Установка ДО;ППП;Открыл ЗН;Работал с ЗН;Закрыл ЗН;Тип документа;Мойка;Диагностика");
	
	Для каждого Строка Из Состав Цикл
		ТекстЗН.ДобавитьСтроку(СтрЗаменить(Строка.Дилер,"""","'") + ";"+
		Строка.КодДилера + ";"+
		Строка.Номер + ";"+
		Строка.VIN + ";"+
		Строка.ГосНомер + ";"+
		Строка.Марка + ";"+
		Строка.Модель + ";"+
		Строка.Пробег + ";"+
		
		Строка.Владелец + ";"+
		Строка.ТелефонВладельца + ";"+		
		Строка.ТипВладельца + ";"+
		
		Строка.КонтактноеЛицо + ";"+
		Строка.ТелефонКонтактногоЛица + ";"+
		Строка.ЕмэйлКонтактногоЛица + ";"+
		
		Строка.ФлагСОПД+ ";"+
		Строка.ФлагТелефон+ ";"+		
		Строка.ФлагЕмэйл+ ";"+		
		Строка.ФлагСмс+ ";"+		
		
		Сред(Строка.ДатаОбращения,1,10) + ";"+
		Строка.ПричинаОбращения + ";"+
		
		Строка.Рекомендации + ";"+		
		
		Сред(Строка.ДатаСозданияЗН,1,10) + ";"+
		Сред(Строка.ДатаНачалаРабот,1,10) + ";"+
		Сред(Строка.ДатаОкончанияРабот,1,10) + ";"+
		Сред(Строка.ДатаЗакрытия,1,10) + ";"+
		Строка.ТипРемонта+ ";"+
		Строка.ТО + ";"+
		Строка.СервиснаяКомпания + ";"+
		Строка.ДобраяВоля + ";"+
		Строка.СлесарныйРемонт + ";"+
		Строка.КузовнойРемонт + ";"+
		Строка.Акция + ";"+
		
		Строка.УстановкаДО + ";"+
		Строка.ПредпродажнаяПодготовка + ";"+		
		
		Строка.КодМастерОткрыл + ";"+		
		Строка.КодМастерРаботал + ";"+		
		Строка.КодМастерЗакрыл + ";"+		
		Строка.ТипДокумента + ";"+		
		Строка.Мойка + ";"+		
		Строка.Диагностика); 
	КонецЦикла;
	
	
	Попытка
		ТекстЗН.Записать(ИмяФайла); 
	Исключение
		//Сообщить("ОШИБКА! Не удалось записать файл с заголовками заказ-нарядов "+ИмяФайлаСработами);	
	КонецПопытки; 
	
	ТекстСРаботами = Новый ТекстовыйДокумент;
	ТекстСРаботами.ДобавитьСтроку("Номер заказ-наряда;Тип позиции;Номер позиции;Код позиции;номера заказа з/ч;Наименование позиции;Количество;Итоговая стоимость;Расширение заказ-наряда;В наличии");
	Для каждого Строка Из РаботыЗН Цикл
		ТекстСРаботами.ДобавитьСтроку(Строка.Номер + ";"+
		Строка.ТипПозиции + ";"+
		Строка.НомерПозиции + ";"+
		Строка.КодПозиции + ";"+
		" " + ";"+
		СтрЗаменить(Строка.НаименованиеПозиции,";","") + ";"+
		СтрЗаменить(Строка.Количество,Символы.НПП,"") + ";"+
		СтрЗаменить(Строка.ИтоговаяСтоимость,Символы.НПП,"") + ";"+
		Строка.РасширениеЗН + ";"+
		Строка.Вналичии); 
	КонецЦикла;
	Попытка
		ТекстСРаботами.Записать(ИмяФайлаСработами); 
	Исключение
		//Сообщить("ОШИБКА! Не удалось записать файл с работами заказ-нарядов");	
	КонецПопытки; 
	
	//=========================== 3 часть ===
	
	Если Состав.Количество()+РаботыЗН.Количество() > 0 Тогда
		
		ДвоичныеДанныеЗН=Новый ДвоичныеДанные(ИмяФайла);
		АдресВХ_ЗН = ПоместитьВоВременноеХранилище(ДвоичныеДанныеЗН);
		
		ДвоичныеДанныеРабот=Новый ДвоичныеДанные(ИмяФайлаСРаботами);
		АдресВХ_Работ = ПоместитьВоВременноеХранилище(ДвоичныеДанныеРабот);
		
		ВыгрузкаНаПорталДжаеку(АдресВХ_ЗН,АдресВХ_Работ);	
		
	КонецЕсли; 
	
КонецПроцедуры // ВыгрузитьЗНпоДжаеку(Параметры = Неопределено) Экспорт
//Бондаренко-- 20221006  

//Бондаренко++ 20210116       
Процедура ВыгрузитьОстаткиНоменклатурыПоЧериСтарая(Параметры = Неопределено)  Экспорт
	
	ГруппаПодразделенийЕврокар = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001167");
	
	Дилер = Справочники.Организации.НайтиПоРеквизиту("ИНН","6168069282");
	КодДилера = "6125600";
	
	ГдеСоздавать = КаталогВременныхФайлов();
	ИмяФайла = ГдеСоздавать+"file3.txt";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Дилер КАК Дилер,
	|	&КодДилера КАК КодДилера,
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура.Артикул КАК Артикул,
	|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток - ОстаткиТоваровКомпанииОстатки.РезервОстаток КАК СвободныйОстаток,
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Ссылка,
	|	Цены.РозничнаяЦена КАК РозничнаяЦена
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(&ДатаОтчета, ) КАК ОстаткиТоваровКомпанииОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
	|			ЦеныСрезПоследних.ТипЦен КАК ТипЦен,
	|			ЦеныСрезПоследних.Цена КАК РозничнаяЦена
	|		ИЗ
	|			РегистрСведений.Цены.СрезПоследних(&ДатаОтчета, ) КАК ЦеныСрезПоследних
	|		ГДЕ
	|			ЦеныСрезПоследних.ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.основнойТипЦенПродажи)) КАК Цены
	|		ПО ОстаткиТоваровКомпанииОстатки.Номенклатура = Цены.Номенклатура
	|ГДЕ
	|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток - ОстаткиТоваровКомпанииОстатки.РезервОстаток > 0
	|	И ОстаткиТоваровКомпанииОстатки.СкладКомпании.Подразделение В ИЕРАРХИИ(&ГруппаПодразделенийЕврокар)
	|	И ОстаткиТоваровКомпанииОстатки.Номенклатура.Производитель = &Производитель
	|	И Цены.РозничнаяЦена > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	РозничнаяЦена УБЫВ";
	
	Запрос.УстановитьПараметр("Дилер", Дилер);
	Запрос.УстановитьПараметр("КодДилера", КодДилера);
	Запрос.УстановитьПараметр("ДатаОтчета", КонецДня(ТекущаяДата()  -  86400));   //Минус  1 день
	Запрос.УстановитьПараметр("Производитель", Справочники.Производители.CHERY_);
	Запрос.УстановитьПараметр("ГруппаПодразделенийЕврокар",ГруппаПодразделенийЕврокар);
	
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	
	ТекстЗН = Новый ТекстовыйДокумент; 
	
	Для каждого Строка Из ТаблицаОстатков Цикл
		ТекстЗН.ДобавитьСтроку(""+СтрЗаменить(Строка.Дилер,"""","'") + ";"+
		Строка.КодДилера + ";"+
		Строка.Артикул + ";"+
		Строка.СвободныйОстаток + ";"+
		СтрЗаменить(Строка.РозничнаяЦена,Символы.НПП,"")); 
	КонецЦикла;
	
	Попытка
		ТекстЗН.Записать(ИмяФайла); 
	Исключение
		//Сообщить("ОШИБКА! Не удалось записать файл с заголовками заказ-нарядов "+ИмяФайлаСработами);	
	КонецПопытки; 
	
	Если ТаблицаОстатков.Количество()  > 0 Тогда
		ДвоичныеДанныеЗН=Новый ДвоичныеДанные(ИмяФайла);
		АдресВХ_Остатки = ПоместитьВоВременноеХранилище(ДвоичныеДанныеЗН);
		
		//Бондаренко++ 20220420                                           
		//ВыгрузкаОстатковНоменклатурыИЦенНаПорталЧери(АдресВХ_Остатки);	
		КлючАПИ = "9Wlw0W51q53895qbhvbmaBV241OjXB";
		
		//Бондаренко++ 20240125
		Марка = Справочники.Марка.CHERY;
		//Бондаренко-- 20240125
		
		ВыгрузкаОстатковНоменклатурыИЦенНаПорталЧери(АдресВХ_Остатки,КлючАПИ,Марка);	
		//Бондаренко-- 20220420
		
	КонецЕсли; 
	
КонецПроцедуры //ВыгрузитьОстаткиНоменклатурыПоЧериСтарая(Параметры = Неопределено)
//Бондаренко-- 20210116

//Бондаренко++ 20220203
Процедура ВыгрузкаНаПорталЧери(АдресВХ_ЗН,АдресВХ_Работ) Экспорт
	
	Перем ОписаниеОшибки;
	
	ПутьКЛог = "C:\Program Files\CheryServiceDataUploader\log.txt";
	ФайлЛогНаДиске = Новый Файл(ПутьКЛог);
	
	ПолныйПутьКпрограмме = "C:\Program Files\CheryServiceDataUploader\CheryServiceDataUploader.exe";		
	ИмяФайлаПрограммыНаДиске = Новый Файл(ПолныйПутьКпрограмме);
	
	Если   ИмяФайлаПрограммыНаДиске.Существует() Тогда
		
		ИмяВременногоФайлаЗН = "C:\Program Files\CheryServiceDataUploader\DataToSend\file1.txt";
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХ_ЗН);
		ДвоичныеДанные.Записать(ИмяВременногоФайлаЗН);
		
		ИмяВременногоФайлаРабот = "C:\Program Files\CheryServiceDataUploader\DataToSend\file2.txt";
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХ_Работ);
		ДвоичныеДанные.Записать(ИмяВременногоФайлаРабот);
		
		ИмяКоманды = """C:\Program Files\CheryServiceDataUploader\CheryServiceDataUploader.exe"""+" 9Wlw0W51q53895qbhvbmaBV241OjXB" ;
		
		Попытка
			ОбщиеСервер.ВыполнитьКомандуНаСервере(ИмяКоманды,ОписаниеОшибки);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;	
		
	Иначе			
		
		ОписаниеОшибки = "ОШИБКА! Файл '"+ПолныйПутьКпрограмме+"' не существует.";			
		
	КонецЕсли;
	
	//Бондаренко++ 20220906
	//Если ФайлЛогНаДиске.Существует() Тогда
	//	ТекстПисьма = "";
	//	Текст = Новый ЧтениеТекста(ПутьКЛог,КодировкаТекста.ANSI,Символы.ПС,    ,  Истина);
	//	ёё = 0;
	//	Пока Истина Цикл
	//		ёё = ёё + 1;
	//		Если ёё > 10000000 Тогда
	//			Прервать;
	//		КонецЕсли; 
	//		Строка = Текст.ПрочитатьСтроку();
	//		Если Строка = Неопределено Тогда
	//			мКому = Новый Массив;
	//			мКому.Добавить("romanov_d@sokolmotors.ru");
	//			мКопии = Новый Массив;
	//			мКопии.Добавить("bondarenko_vg@sokolmotors.ru");
	//			ТемаПисьма = "Выгрузка ЗН по CHERY "+текущаяДата();
	//			Суть = ТекстПисьма;
	//			Попытка
	//				г_Функции.СоздатьИОтпраитьЭлПисьмо(мКому,мКопии,ТемаПисьма,Суть);
	//			Исключение
	//				//				
	//			КонецПопытки; 
	//		Иначе
	//			ТекстПисьма = СокрЛП(ТекстПисьма)+Символы.ПС+Строка;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;	
	//Бондаренко-- 20220906
	
КонецПроцедуры //ВыгрузкаНаПорталЧери(АдресВХ_ЗН,АдресВХ_Работ) Экспорт
//Бондаренко-- 20220203

//Бондаренко++ 20221111
Процедура ВыгрузкаНаПорталЭксид(АдресВХ_ЗН,АдресВХ_Работ) Экспорт
	
	Перем ОписаниеОшибки;
	
	ПутьКЛог = "C:\Program Files\CheryServiceDataUploader\log.txt";
	ФайлЛогНаДиске = Новый Файл(ПутьКЛог);
	
	ПолныйПутьКпрограмме = "C:\Program Files\CheryServiceDataUploader\CheryServiceDataUploader.exe";		
	ИмяФайлаПрограммыНаДиске = Новый Файл(ПолныйПутьКпрограмме);
	
	Если   ИмяФайлаПрограммыНаДиске.Существует() Тогда
		
		ИмяВременногоФайлаЗН = "C:\Program Files\CheryServiceDataUploader\DataToSend\file1.txt";
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХ_ЗН);
		ДвоичныеДанные.Записать(ИмяВременногоФайлаЗН);
		
		ИмяВременногоФайлаРабот = "C:\Program Files\CheryServiceDataUploader\DataToSend\file2.txt";
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХ_Работ);
		ДвоичныеДанные.Записать(ИмяВременногоФайлаРабот);
		
		//Бондаренко++ 20230624
		//ИмяКоманды = """C:\Program Files\CheryServiceDataUploader\CheryServiceDataUploader.exe"""+" dcn37O8WcuFtXL3evG3NRkAo8HWyrP" ; 
		//Престиж Моторс ООО
		ИмяКоманды = """C:\Program Files\CheryServiceDataUploader\CheryServiceDataUploader.exe"""+" 83ip9AP7e9eOMnh585PYSNVrXJM30F" ;
		//Атлант Моторс ООО
		//Бондаренко++ 20230624
		
		Попытка
			ОбщиеСервер.ВыполнитьКомандуНаСервере(ИмяКоманды,ОписаниеОшибки);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;	
		
	Иначе			
		
		ОписаниеОшибки = "ОШИБКА! Файл '"+ПолныйПутьКпрограмме+"' не существует.";			
		
	КонецЕсли;
	
	//Бондаренко++ 20220906
	//Если ФайлЛогНаДиске.Существует() Тогда
	//	ТекстПисьма = "";
	//	Текст = Новый ЧтениеТекста(ПутьКЛог,КодировкаТекста.ANSI,Символы.ПС,    ,  Истина);
	//	ёё = 0;
	//	Пока Истина Цикл
	//		ёё = ёё + 1;
	//		Если ёё > 10000000 Тогда
	//			Прервать;
	//		КонецЕсли; 
	//		Строка = Текст.ПрочитатьСтроку();
	//		Если Строка = Неопределено Тогда
	//			мКому = Новый Массив;
	//			мКому.Добавить("romanov_d@sokolmotors.ru");
	//			мКопии = Новый Массив;
	//			мКопии.Добавить("bondarenko_vg@sokolmotors.ru");
	//			ТемаПисьма = "Выгрузка ЗН по CHERY "+текущаяДата();
	//			Суть = ТекстПисьма;
	//			Попытка
	//				г_Функции.СоздатьИОтпраитьЭлПисьмо(мКому,мКопии,ТемаПисьма,Суть);
	//			Исключение
	//				//				
	//			КонецПопытки; 
	//		Иначе
	//			ТекстПисьма = СокрЛП(ТекстПисьма)+Символы.ПС+Строка;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;	
	//Бондаренко-- 20220906
	
КонецПроцедуры //ВыгрузкаНаПорталЭксид(АдресВХ_ЗН,АдресВХ_Работ) Экспорт
//Бондаренко-- 20220203

//Бондаренко++ 20221111
Процедура ВыгрузкаНаПорталОмода(АдресВХ_ЗН,АдресВХ_Работ) Экспорт
	
	Перем ОписаниеОшибки;
	
	ПутьКЛог = "C:\Program Files\CheryServiceDataUploader\log.txt";
	ФайлЛогНаДиске = Новый Файл(ПутьКЛог);
	
	ПолныйПутьКпрограмме = "C:\Program Files\CheryServiceDataUploader\CheryServiceDataUploader.exe";		
	ИмяФайлаПрограммыНаДиске = Новый Файл(ПолныйПутьКпрограмме);
	
	Если   ИмяФайлаПрограммыНаДиске.Существует() Тогда
		
		ИмяВременногоФайлаЗН = "C:\Program Files\CheryServiceDataUploader\DataToSend\file1.txt";
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХ_ЗН);
		ДвоичныеДанные.Записать(ИмяВременногоФайлаЗН);
		
		ИмяВременногоФайлаРабот = "C:\Program Files\CheryServiceDataUploader\DataToSend\file2.txt";
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХ_Работ);
		ДвоичныеДанные.Записать(ИмяВременногоФайлаРабот);
		
		ИмяКоманды = """C:\Program Files\CheryServiceDataUploader\CheryServiceDataUploader.exe"""+" MkdmVV34e180236ReFfy7AyVT9160L" ;
		
		Попытка
			ОбщиеСервер.ВыполнитьКомандуНаСервере(ИмяКоманды,ОписаниеОшибки);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;	
		
	Иначе			
		
		ОписаниеОшибки = "ОШИБКА! Файл '"+ПолныйПутьКпрограмме+"' не существует.";			
		
	КонецЕсли;
	
	//Бондаренко++ 20220906
	//Если ФайлЛогНаДиске.Существует() Тогда
	//	ТекстПисьма = "";
	//	Текст = Новый ЧтениеТекста(ПутьКЛог,КодировкаТекста.ANSI,Символы.ПС,    ,  Истина);
	//	ёё = 0;
	//	Пока Истина Цикл
	//		ёё = ёё + 1;
	//		Если ёё > 10000000 Тогда
	//			Прервать;
	//		КонецЕсли; 
	//		Строка = Текст.ПрочитатьСтроку();
	//		Если Строка = Неопределено Тогда
	//			мКому = Новый Массив;
	//			мКому.Добавить("romanov_d@sokolmotors.ru");
	//			мКопии = Новый Массив;
	//			мКопии.Добавить("bondarenko_vg@sokolmotors.ru");
	//			ТемаПисьма = "Выгрузка ЗН по CHERY "+текущаяДата();
	//			Суть = ТекстПисьма;
	//			Попытка
	//				г_Функции.СоздатьИОтпраитьЭлПисьмо(мКому,мКопии,ТемаПисьма,Суть);
	//			Исключение
	//				//				
	//			КонецПопытки; 
	//		Иначе
	//			ТекстПисьма = СокрЛП(ТекстПисьма)+Символы.ПС+Строка;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;	
	//Бондаренко-- 20220906
	
КонецПроцедуры //ВыгрузкаНаПорталОмода(АдресВХ_ЗН,АдресВХ_Работ) Экспорт
//Бондаренко-- 20220203 

//Бондаренко++ 20231006
Процедура ВыгрузкаНаПорталДжаеку(АдресВХ_ЗН,АдресВХ_Работ) Экспорт
	
	Перем ОписаниеОшибки;
	
	ПутьКЛог = "C:\Program Files\CheryServiceDataUploader\log.txt";
	ФайлЛогНаДиске = Новый Файл(ПутьКЛог);
	
	ПолныйПутьКпрограмме = "C:\Program Files\CheryServiceDataUploader\CheryServiceDataUploader.exe";		
	ИмяФайлаПрограммыНаДиске = Новый Файл(ПолныйПутьКпрограмме);
	
	Если   ИмяФайлаПрограммыНаДиске.Существует() Тогда
		
		ИмяВременногоФайлаЗН = "C:\Program Files\CheryServiceDataUploader\DataToSend\file1.txt";
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХ_ЗН);
		ДвоичныеДанные.Записать(ИмяВременногоФайлаЗН);
		
		ИмяВременногоФайлаРабот = "C:\Program Files\CheryServiceDataUploader\DataToSend\file2.txt";
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХ_Работ);
		ДвоичныеДанные.Записать(ИмяВременногоФайлаРабот);
		
		ИмяКоманды = """C:\Program Files\CheryServiceDataUploader\CheryServiceDataUploader.exe"""+" GQwfV55mgRcP7IaTdVITT7krn2phJm" ;
		
		Попытка
			ОбщиеСервер.ВыполнитьКомандуНаСервере(ИмяКоманды,ОписаниеОшибки);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;	
		
	Иначе			
		
		ОписаниеОшибки = "ОШИБКА! Файл '"+ПолныйПутьКпрограмме+"' не существует.";			
		
	КонецЕсли;
	
КонецПроцедуры //ВыгрузкаНаПорталОмода(АдресВХ_ЗН,АдресВХ_Работ) Экспорт
//Бондаренко-- 20231006 

//Бондаренко++ 20210116
Процедура ВыгрузкаОстатковНоменклатурыИЦенНаПорталЧери(АдресВХ_Остатков,КлючАпи,Марка) Экспорт
	
	Перем ОписаниеОшибки;
	
	//Бондаренко++ 20201002
	ДатаВремяСтрокой = "";
	ДатаВремяСтрокой = СокрЛП(Формат(ТекущаяДата(),"ДЛФ=DT"));
	ДатаВремяСтрокой = СтрЗаменить(ДатаВремяСтрокой,".","_");
	ДатаВремяСтрокой = СтрЗаменить(ДатаВремяСтрокой,":","_");
	ДатаВремяСтрокой = СтрЗаменить(ДатаВремяСтрокой," ","_");
	
	ПутьКЛог = "C:\Program Files\CheryServiceDataUploader\log.txt";
	ФайлЛогНаДиске = Новый Файл(ПутьКЛог);
	
	Если ФайлЛогНаДиске.Существует() Тогда
		Попытка
			КопироватьФайл(ПутьКЛог,"C:\Program Files\CheryServiceDataUploader\log_"+ДатаВремяСтрокой+".txt");	
		Исключение
			//		
		КонецПопытки; 
	КонецЕсли;	
	//Бондаренко-- 20201002
	
	//Бондаренко++ 20240202
	Если Марка = Справочники.Марка.KAIYI ИЛИ Марка = Справочники.Марка.BAIC Тогда
		ПолныйПутьКпрограмме = "C:\Program Files\CheryServiceDataUploader\AvtotorStockDataUploader.exe";		
	ИначеЕсли Марка = Справочники.Марка.JAC Тогда	
		ПолныйПутьКпрограмме = "C:\Program Files\CheryServiceDataUploader\JacStockDataUploader.exe";		
	Иначе	
		ПолныйПутьКпрограмме = "C:\Program Files\CheryServiceDataUploader\CheryStockDataUploader.exe";		 
	КонецЕсли;             
	//Бондаренко-- 20240202
	
	ИмяФайлаПрограммыНаДиске = Новый Файл(ПолныйПутьКпрограмме);
	
	Если   ИмяФайлаПрограммыНаДиске.Существует() Тогда
		
		ИмяВременногоФайлаЗН = "C:\Program Files\CheryServiceDataUploader\DataToSend\file3.txt";
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХ_Остатков);
		ДвоичныеДанные.Записать(ИмяВременногоФайлаЗН);
		
		//Бондаренко++ 20240202
		//ИмяКоманды = """C:\Program Files\CheryServiceDataUploader\CheryStockDataUploader.exe"""+" 9Wlw0W51q53895qbhvbmaBV241OjXB";
		Если Марка = Справочники.Марка.KAIYI ИЛИ Марка = Справочники.Марка.BAIC Тогда
			ИмяКоманды = """C:\Program Files\CheryServiceDataUploader\AvtotorStockDataUploader.exe"""+" "+КлючАпи;
		ИначеЕсли Марка = Справочники.Марка.JAC Тогда	
			ИмяКоманды = """C:\Program Files\CheryServiceDataUploader\JacStockDataUploader.exe"""+" "+КлючАпи;		
		Иначе	
			ИмяКоманды = """C:\Program Files\CheryServiceDataUploader\CheryStockDataUploader.exe"""+" "+КлючАпи;		
		КонецЕсли;
		//Бондаренко-- 20240202
		
		Попытка
			ОбщиеСервер.ВыполнитьКомандуНаСервере(ИмяКоманды,ОписаниеОшибки);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;	
		
	Иначе			
		
		ОписаниеОшибки = "ОШИБКА! Файл '"+ПолныйПутьКпрограмме+"' не существует.";			
		
	КонецЕсли;
	
	//Бондаренко-- 20201002
	Если ФайлЛогНаДиске.Существует() Тогда
		ТекстПисьма = "";
		Текст = Новый ЧтениеТекста(ПутьКЛог,КодировкаТекста.ANSI,Символы.ПС,    ,  Истина);
		ёё = 0;
		Пока Истина Цикл
			ёё = ёё + 1;
			Если ёё > 10000 Тогда
				Прервать;
			КонецЕсли; 
			Строка = Текст.ПрочитатьСтроку();
			Если Строка = Неопределено Тогда
				мКому = Новый Массив;
				мКому.Добавить("vlasov_v@sokolmotors.ru");
				мКопии = Новый Массив;
				мКопии.Добавить("bondarenko_vg@sokolmotors.ru");
				ТемаПисьма = "Выгрузка остатков номенклатуры по CHERY "+текущаяДата();
				Суть = ТекстПисьма;
				Попытка
					г_Функции.СоздатьИОтпраитьЭлПисьмо(мКому,мКопии,ТемаПисьма,Суть);
				Исключение
					//				
				КонецПопытки; 
			Иначе
				ТекстПисьма = СокрЛП(ТекстПисьма)+Символы.ПС+Строка;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	//Бондаренко-- 20201002
	
КонецПроцедуры
//Бондаренко-- 20210116

//Бондаренко++ 20220819
Функция ЭтоАкция(ТекЗН) Экспорт
	
	Флаг_это_Акция = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНарядРаботы.Ссылка,
	|	ЗаказНарядРаботы.Работа,
	|	ЗаказНарядРаботы.Работа.ТипРабот
	|ИЗ
	|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
	|ГДЕ
	|	ЗаказНарядРаботы.Ссылка = &Ссылка
	|	И ЗаказНарядРаботы.Работа.ТипРабот = &ТипРабот";
	
	Запрос.УстановитьПараметр("Ссылка", ТекЗН);
	Запрос.УстановитьПараметр("ТипРабот", Перечисления.ТипыРабот.Акция);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Флаг_это_Акция = Истина;
	КонецЦикла; 
	
	Возврат Флаг_это_Акция;
	
КонецФункции // ЭтоАкция(ТекЗН)
//Бондаренко-- 20220819

//Бондаренко++ 20230628
Процедура ВыгрузкаСтруктурыБДвФайлJSON(Параметры = Неопределено) Экспорт
	
	Перем МассивДанныхJSON;
	
	МассивДанныхJSON = Новый Массив;
	
	ТаблицаСостав = Новый ТаблицаЗначений;
	
	ТаблицаСостав.Колонки.Добавить("ИмяТаблицы");
	ТаблицаСостав.Колонки.Добавить("ИмяТаблицыХранения");
	ТаблицаСостав.Колонки.Добавить("Метаданные");
	ТаблицаСостав.Колонки.Добавить("ИмяПоля");
	ТаблицаСостав.Колонки.Добавить("ИмяПоляХранения");
	ТаблицаСостав.Колонки.Добавить("ИмяПоляМетаданные");
	
	Сч = 0;
	
	СтруктураБД = ПолучитьСтруктуруХраненияБазыДанных();
	
	Для каждого Стр Из СтруктураБД Цикл
		
		Сч = Сч + 1;
		
		ИмяПоля = "";
		ИмяПоляХранения = "";
		ИмяПоляМетаданные = "";
		
		ПоляКоличество = Стр.Поля.Количество();
		
		Для Счетчик = 0 По ПоляКоличество - 1 Цикл
			
			ИмяПоля = Стр.Поля[Счетчик].ИмяПоля;
			ИмяПоляХранения = Стр.Поля[Счетчик].ИмяПоляХранения;
			ИмяПоляМетаданные = Стр.Поля[Счетчик].Метаданные;
			
			НовСтрока                    = ТаблицаСостав.Добавить();
			
			НовСтрока.ИмяТаблицы         = Стр.ИмяТаблицы;
			НовСтрока.ИмяТаблицыХранения = Стр.ИмяТаблицыХранения;
			НовСтрока.Метаданные         = Стр.Метаданные;
			НовСтрока.ИмяПоля            = ИмяПоля;
			НовСтрока.ИмяПоляХранения    = ИмяПоляХранения;
			НовСтрока.ИмяПоляМетаданные  = ИмяПоляМетаданные;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для каждого Стр Из ТаблицаСостав Цикл
		
		СтруктураБазы = Новый Структура;
		
		СтруктураБазы.Вставить("TableName",СокрЛП(Стр.ИмяТаблицы)); 
		СтруктураБазы.Вставить("TableNameStock",СокрЛП(Стр.ИмяТаблицыХранения)); 
		СтруктураБазы.Вставить("TableMD",СокрЛП(Стр.Метаданные)); 
		СтруктураБазы.Вставить("FieldName",СокрЛП(Стр.ИмяПоля)); 
		СтруктураБазы.Вставить("FieldNameStock",СокрЛП(Стр.ИмяПоляХранения)); 
		СтруктураБазы.Вставить("FieldNameMD",СокрЛП(Стр.ИмяПоляМетаданные)); 
		
		МассивДанныхJSON.Добавить(СтруктураБазы);
		
	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	Попытка
		ИФ = "C:\PowerBI\StructureBaseSokolMotors.json";
		ЗаписьJSON.ОткрытьФайл(ИФ,,,Новый ПараметрыЗаписиJSON( ,Символы.Таб));
		ЗаписатьJSON(ЗаписьJSON,МассивДанныхJSON);
	Исключение
		Попытка
			ИФ = "L:\PowerBI\StructureBaseSokolMotors.json";
			ЗаписьJSON.ОткрытьФайл(ИФ,,,Новый ПараметрыЗаписиJSON( ,Символы.Таб));
			ЗаписатьJSON(ЗаписьJSON,МассивДанныхJSON);
		Исключение
			Попытка
				ИФ = "\\1C01\PowerBI\StructureBaseSokolMotors.json";
				ЗаписьJSON.ОткрытьФайл(ИФ,,,Новый ПараметрыЗаписиJSON( ,Символы.Таб));
				ЗаписатьJSON(ЗаписьJSON,МассивДанныхJSON);
			Исключение
			КонецПопытки; 		
		КонецПопытки;
	КонецПопытки;
	
КонецПроцедуры //ВыгрузкаСтруктурыБДвФайлJSON(Параметры = Неопределено)
//Бондаренко-- 20230628

//Бондаренко++ 20240104
Процедура ВыгрузкаРлРеалАвтоИСобытийвФайлCSV(Параметры = Неопределено) Экспорт
	
	//ГдеСоздавать = КаталогВременныхФайлов(); 
	//Бондаренко++ 20240622
	//ГдеСоздавать = "L:\PowerBI\";
	ГдеСоздавать = "E:\PowerBI\";
	//Бондаренко++ 20240622
	
	ТаблицаСостав = Новый ТаблицаЗначений;
	ТаблицаСостав.Колонки.Добавить("Дата");
	ТаблицаСостав.Колонки.Добавить("Номер");
	ТаблицаСостав.Колонки.Добавить("ПодразделениеКомпании");
	ТаблицаСостав.Колонки.Добавить("ПредставлениеТелефона");
	ТаблицаСостав.Колонки.Добавить("Марка");
	ТаблицаСостав.Колонки.Добавить("АвтомобильНовый");
	ТаблицаСостав.Колонки.Добавить("НомерРЛ");
	ТаблицаСостав.Колонки.Добавить("Чат");
	ТаблицаСостав.Колонки.Добавить("ЭтоВизит");
	ТаблицаСостав.Колонки.Добавить("Ссылка");
	
	Для Сч = 1 По 5 Цикл
		
		Если Сч = 1 Тогда
			ИмяФайла = ГдеСоздавать+"RL.CSV";
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	РабочийЛист.Дата КАК Дата,
			               |	РабочийЛист.Номер КАК Номер,
			               |	РабочийЛист.ПодразделениеКомпании КАК ПодразделениеКомпании,
			               |	РабочийЛист.ПредставлениеТелефона КАК ПредставлениеТелефона,
			               |	РабочийЛист.Модель.Марка КАК Марка,
			               |	РабочийЛист.Ссылка КАК Ссылка,
			               |	НЕ РабочийЛист.ТолькоБУ КАК АвтомобильНовый,
			               |	РеализацииАвто.ДатаРеализации КАК ДатаРеализации,
			               |	РеализацииАвто.НомерРеализации КАК НомерРеализации,
			               |	ЗаказНаАвтомобиль.Дата КАК ДатаПодчиненногоЗаказа,
			               |	ЗаказНаАвтомобиль.Номер КАК НомерПодчиненногоЗаказа,
			               |	РабочийЛист.Реклама КАК Реклама,
			               |	РабочийЛист.Реклама.КодИсточника КАК РекламаКодИсточника,
			               |	РабочийЛист.Менеджер КАК Менеджер,
			               |	РабочийЛист.Автомобиль.VIN КАК VIN,
			               |	РабочийЛист.Автомобиль.ДатаОплаты КАК ДатаОплаты,
			               |	РабочийЛист.Менеджер.ФлагУволен КАК МенеджерФлагУволен,
			               |	РабочийЛист.ЮридическоеЛицо КАК ЮридическоеЛицо,
			               |	РабочийЛист.Менеджер.Должность КАК МенеджерДолжность
			               |ИЗ
			               |	Документ.РабочийЛист КАК РабочийЛист
			               |		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			               |			РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль.РабочийЛист КАК ЗаказНаАвтомобильРабочийЛист,
			               |			РеализацияАвтомобилейАвтомобили.Ссылка.Номер КАК НомерРеализации,
			               |			РеализацияАвтомобилейАвтомобили.Ссылка.Дата КАК ДатаРеализации
			               |		ИЗ
			               |			Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
			               |		ГДЕ
			               |			РеализацияАвтомобилейАвтомобили.Ссылка.Проведен) КАК РеализацииАвто
			               |		ПО РабочийЛист.Ссылка = РеализацииАвто.ЗаказНаАвтомобильРабочийЛист
			               |		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			               |			ЗаказНаАвтомобиль.Ссылка КАК Ссылка,
			               |			ЗаказНаАвтомобиль.Номер КАК Номер,
			               |			ЗаказНаАвтомобиль.Дата КАК Дата,
			               |			ЗаказНаАвтомобиль.Проведен КАК Проведен,
			               |			ЗаказНаАвтомобиль.ДокументОснование КАК ДокументОснование
			               |		ИЗ
			               |			Документ.ЗаказНаАвтомобиль КАК ЗаказНаАвтомобиль
			               |		ГДЕ
			               |			ЗаказНаАвтомобиль.Проведен) КАК ЗаказНаАвтомобиль
			               |		ПО РабочийЛист.Ссылка = ЗаказНаАвтомобиль.ДокументОснование
			               |ГДЕ
			               |	РабочийЛист.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			               |	И РабочийЛист.Проведен";
		ИначеЕсли Сч = 2 Тогда
			ИмяФайла = ГдеСоздавать+"RA.CSV";
			Запрос = Новый Запрос;   
			//Иванченко 20250925 ++
			//Запрос.Текст = "ВЫБРАТЬ
			//               |	РеализацияАвтомобилейАвтомобили.Ссылка.Дата КАК Дата,
			//               |	РеализацияАвтомобилейАвтомобили.Ссылка.Номер КАК Номер,
			//               |	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль.РабочийЛист.ПодразделениеКомпании КАК ПодразделениеКомпании,
			//               |	РеализацияАвтомобилейАвтомобили.Ссылка.Заказчик.ОсновнойТелефон КАК ПредставлениеТелефона,
			//               |	РеализацияАвтомобилейАвтомобили.Автомобиль.Модель.Марка КАК Марка,
			//               |	ХарАвто.Значение КАК АвтомобильХар,
			//               |	РеализацияАвтомобилейАвтомобили.Ссылка КАК Ссылка,
			//               |	РеализацияАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
			//               |	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль.РабочийЛист.Номер КАК НомерРЛ,
			//               |	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль.ВКредит КАК ВКредит,
			//               |	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль.TradeIn КАК ТрейдИн,
			//               |	РеализацияАвтомобилейАвтомобили.Автомобиль.Модель КАК Модель,
			//               |	РеализацияАвтомобилейАвтомобили.Автомобиль.VIN КАК VIN,
			//               |	РеализацияАвтомобилейАвтомобили.Ссылка.Контрагент.ФормаСобственности КАК ФормаСобственности,
			//               |	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль.ДокументОснование.ВидОплаты КАК ВидОплаты
			//               |ИЗ
			//               |	Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
			//               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//               |			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
			//               |			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
			//               |			АвтомобилиСрезПоследних.Значение КАК Значение
			//               |		ИЗ
			//               |			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
			//               |		ГДЕ
			//               |			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)) КАК ХарАвто
			//               |		ПО РеализацияАвтомобилейАвтомобили.Автомобиль = ХарАвто.Автомобиль
			//               |ГДЕ
			//               |	РеализацияАвтомобилейАвтомобили.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			//               |	И РеализацияАвтомобилейАвтомобили.Ссылка.Проведен
			//               |	И НЕ РеализацияАвтомобилейАвтомобили.Ссылка.Контрагент.НашаФирма
			//               |
			//               |УПОРЯДОЧИТЬ ПО
			//               |	Дата"; 
			Запрос.Текст = "ВЫБРАТЬ
			|	РеализацияАвтомобилейАвтомобили.Ссылка.Дата КАК Дата,
			|	РеализацияАвтомобилейАвтомобили.Ссылка.Номер КАК Номер,
			|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль.РабочийЛист.ПодразделениеКомпании КАК ПодразделениеКомпании,
			|	РеализацияАвтомобилейАвтомобили.Ссылка.Заказчик.ОсновнойТелефон КАК ПредставлениеТелефона,
			|	РеализацияАвтомобилейАвтомобили.Автомобиль.Модель.Марка КАК Марка,
			|	ХарАвто.Значение КАК АвтомобильХар,
			|	РеализацияАвтомобилейАвтомобили.Ссылка КАК Ссылка,
			|	РеализацияАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
			|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль.РабочийЛист.Номер КАК НомерРЛ,
			|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль.ВКредит КАК ВКредит,
			|	ВЫБОР
			|		КОГДА РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль.РабочийЛист.ЦенаДКПТрейдИн = 0
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ КАК ТрейдИн,
			|	РеализацияАвтомобилейАвтомобили.Автомобиль.Модель КАК Модель,
			|	РеализацияАвтомобилейАвтомобили.Автомобиль.VIN КАК VIN,
			|	РеализацияАвтомобилейАвтомобили.Ссылка.Контрагент.ФормаСобственности КАК ФормаСобственности,
			|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль.ДокументОснование.ВидОплаты КАК ВидОплаты
			|ИЗ
			|	Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
			|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
			|			АвтомобилиСрезПоследних.Значение КАК Значение
			|		ИЗ
			|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
			|		ГДЕ
			|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)) КАК ХарАвто
			|		ПО РеализацияАвтомобилейАвтомобили.Автомобиль = ХарАвто.Автомобиль
			|ГДЕ
			|	РеализацияАвтомобилейАвтомобили.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И РеализацияАвтомобилейАвтомобили.Ссылка.Проведен
			|	И НЕ РеализацияАвтомобилейАвтомобили.Ссылка.Контрагент.НашаФирма
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата";  
			//Иванченко 20250925 --			
			
		ИначеЕсли Сч = 3 Тогда	                
			
			ИмяФайла = ГдеСоздавать+"SB.CSV";
			Запрос = Новый Запрос;
			
			Запрос.Текст = "ВЫБРАТЬ
			|	Событие.ДатаОкончания КАК Дата,
			|	Событие.Номер КАК Номер,
			|	Событие.ПодразделениеКомпании КАК ПодразделениеКомпании,
			|	Событие.ДокументОснование.Модель.Марка КАК Марка,
			|	Событие.ПредставлениеТелефона КАК ПредставлениеТелефона,
			|	Событие.ДокументОснование.Номер КАК НомерРЛ,
			|	Событие.ВидСобытия КАК ВидСобытия,
			|	Событие.ТипСообщения КАК ТипСообщения,
			|	Событие.ДокументОснование.Реклама КАК Чат,
			|	ВЫБОР
			|		КОГДА Событие.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ЛичнаяВстреча)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ЭтоВизит,
			|	НЕ Событие.ДокументОснование.ТолькоБУ КАК АвтомобильНовый,
			|	Событие.ДокументОснование.Реклама.КодИсточника КАК РекламаКодИсточника
			|ИЗ
			|	Документ.Событие КАК Событие
			|ГДЕ
			|	Событие.ТипСообщения = ЗНАЧЕНИЕ(Перечисление.ТипыСообщений.Входящее)
			|	И Событие.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И Событие.Проведен
			|	И ТИПЗНАЧЕНИЯ(Событие.ДокументОснование) = ТИП(Документ.РабочийЛист)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата";              
			
		ИначеЕсли Сч = 4 Тогда	                	
			
			//Бондаренко++ 20240524	
			ИмяФайла = ГдеСоздавать+"SKNAL.CSV";
			
			//Бондаренко++ 20250103	
			//НачДата = КонецМесяца(Дата(2022,12,31));
			НачДата = КонецМесяца(ДобавитьМесяц(КонецГода(ТекущаяДата()),-24));
			//Бондаренко-- 20250103	
			
			ЧислоЗапросов = 12 + Месяц(ТекущаяДата())+ 1;
			
			Для Счетчик = 1 По ЧислоЗапросов Цикл
				
				Запрос = Новый Запрос;
				
				Запрос.Текст = "ВЫБРАТЬ
				|	ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль,
				|	&ДатаОстатков КАК ДатаОкончания,
				|	ОстаткиАвтомобилейОстатки.КоличествоОстаток КАК КолКон,
				|	ОстаткиАвтомобилейОстатки.СуммаОстаток КАК СуммаКон,
				|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN КАК VIN,
				|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель КАК Модель,
				|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.Марка КАК Бренд,
				|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.Родитель КАК ПодразделениеКомпании,
				|	ХарАвто.Значение КАК АвтомобильХар,
				|	ПоступленияАвто.Дата КАК ДатаПоступления,
				|	ВводОстатков.Дата КАК ДатаВводаОстатков
				|ИЗ
				|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(&ДатаОстатков, ) КАК ОстаткиАвтомобилейОстатки
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
				|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
				|			АвтомобилиСрезПоследних.Значение КАК Значение
				|		ИЗ
				|			РегистрСведений.Автомобили.СрезПоследних(, ) КАК АвтомобилиСрезПоследних
				|		ГДЕ
				|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)) КАК ХарАвто
				|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ХарАвто.Автомобиль
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			ПоступлениеАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
				|			МАКСИМУМ(ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата) КАК Дата,
				|			ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен КАК Проведен
				|		ИЗ
				|			Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
				|		ГДЕ
				|			ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен
				|		
				|		СГРУППИРОВАТЬ ПО
				|			ПоступлениеАвтомобилейАвтомобили.Автомобиль,
				|			ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен) КАК ПоступленияАвто
				|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ПоступленияАвто.Автомобиль
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			ВводОстатковАвтомобилейАвтомобили.Ссылка.Проведен КАК Проведен,
				|			ВводОстатковАвтомобилейАвтомобили.Ссылка.Дата КАК Дата,
				|			ВводОстатковАвтомобилейАвтомобили.Автомобиль КАК Автомобиль
				|		ИЗ
				|			Документ.ВводОстатковАвтомобилей.Автомобили КАК ВводОстатковАвтомобилейАвтомобили
				|		ГДЕ
				|			ВводОстатковАвтомобилейАвтомобили.Ссылка.Проведен) КАК ВводОстатков
				|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ВводОстатков.Автомобиль
				|ГДЕ
				|	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0";
				
				Запрос.УстановитьПараметр("ДатаОстатков",НачДата);
				
				Если Счетчик = 1 Тогда
					ТаблицаСостав = Запрос.Выполнить().Выгрузить();
				Иначе
					ТЗ = Запрос.Выполнить().Выгрузить();
					
					Для каждого Стр Из ТЗ Цикл
						НовСтрока = ТаблицаСостав.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтрока,Стр);
					КонецЦикла;
				КонецЕсли;
				
				НачДата = КонецМесяца(ДобавитьМесяц(НачДата,1));
				
			КонецЦикла;
			//Бондаренко-- 20240524	  
						
			//Бондаренко++ 20240514	
		ИначеЕсли Сч = 5 Тогда	                
			
			ИмяФайла = ГдеСоздавать+"SKOB.CSV";
			Запрос = Новый Запрос;
			
			Запрос.Текст = "ВЫБРАТЬ
			|	РеализацияАвтомобилейАвтомобили.Ссылка КАК Реализация,
			|	РеализацияАвтомобилейАвтомобили.Ссылка.Дата КАК ДатаРеализации,
			|	ПоступлениеАвтомобили.Ссылка.Дата КАК ДатаВремяПрихода,
			|	ПоступлениеАвтомобили.СуммаПоступления КАК СтоимостьВходРубли,
			|	ВЫБОР
			|		КОГДА НЕ ПоступлениеАвтомобили.АвтомобильБУ
			|			ТОГДА РеализацияАвтомобилейАвтомобили.Автомобиль.Модель.Марка
			|		ИНАЧЕ ""АСП""
			|	КОНЕЦ КАК Бренд,
			|	РеализацияАвтомобилейАвтомобили.Ссылка.ПодразделениеКомпании.Родитель КАК ПодразделениеКомпании,
			|	ВЫБОР
			|		КОГДА НЕ ПоступлениеАвтомобили.АвтомобильБУ
			|			ТОГДА РеализацияАвтомобилейАвтомобили.Автомобиль.Модель
			|		ИНАЧЕ ""АСП""
			|	КОНЕЦ КАК Модель,
			|	РеализацияАвтомобилейАвтомобили.Ссылка.ДокументОснование.Номер КАК НомерРЛ,
			|	РеализацияАвтомобилейАвтомобили.Ссылка.Номер КАК НомерРеализации,
			|	РеализацияАвтомобилейАвтомобили.Ссылка.Контрагент КАК Контрагент,
			|	РеализацияАвтомобилейАвтомобили.Ссылка.Контрагент.НашаФирма КАК КонтрагентНашаФирма,
			|	РеализацияАвтомобилейАвтомобили.Ссылка.Организация КАК Организация,
			|	РеализацияАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
			|	РеализацияАвтомобилейАвтомобили.Сумма КАК Сумма,
			|	РеализацияАвтомобилейАвтомобили.СтавкаНДС КАК СтавкаНДС,
			|	РеализацияАвтомобилейАвтомобили.СуммаНДС КАК СуммаНДС,
			|	РеализацияАвтомобилейАвтомобили.Ссылка.Проведен КАК Проведен,
			|	ПоступлениеАвтомобили.АвтомобильБУ КАК АвтомобильБУ,
			|	ПоступлениеАвтомобили.Ссылка КАК ПоступлениеАвто,
			|	0 КАК КолНач,
			|	0 КАК КолКон,
			|	РеализацияАвтомобилейАвтомобили.Автомобиль.VIN КАК VIN
			|ИЗ
			|	Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ПродажиАвтомобилейОбороты.Регистратор КАК Регистратор,
			|			ПродажиАвтомобилейОбороты.Автомобиль КАК Автомобиль,
			|			ПродажиАвтомобилейОбороты.Партия КАК Партия
			|		ИЗ
			|			РегистрНакопления.ПродажиАвтомобилей.Обороты(, , Регистратор, ) КАК ПродажиАвтомобилейОбороты) КАК Партии
			|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				ПоступлениеАвтомобилейАвтомобили.Ссылка КАК Ссылка,
			|				ПоступлениеАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
			|				ПоступлениеАвтомобилейАвтомобили.СуммаВсего КАК СуммаПоступления,
			|				ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата КАК ДатаВремяПрихода,
			|				ПоступлениеАвтомобилейАвтомобили.АвтомобильБУ КАК АвтомобильБУ
			|			ИЗ
			|				Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили) КАК ПоступлениеАвтомобили
			|			ПО Партии.Партия = ПоступлениеАвтомобили.Ссылка
			|				И Партии.Автомобиль = ПоступлениеАвтомобили.Автомобиль
			|		ПО РеализацияАвтомобилейАвтомобили.Ссылка = Партии.Регистратор
			|			И РеализацияАвтомобилейАвтомобили.Автомобиль = Партии.Автомобиль
			|ГДЕ
			|	РеализацияАвтомобилейАвтомобили.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И НЕ РеализацияАвтомобилейАвтомобили.Ссылка.Контрагент.НашаФирма
			|	И РеализацияАвтомобилейАвтомобили.Ссылка.Проведен
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаРеализации";
			
			
			//Бондаренко-- 20240514		
			
			
			Запрос.УстановитьПараметр("ДатаНачала",Дата(2023,1,1));
			//Бондаренко++ 20240801
			//Запрос.УстановитьПараметр("ДатаОкончания",ТекущаяДата());
			Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(ТекущаяДата()));
			//Бондаренко-- 20240801
			
			ТаблицаСостав = Запрос.Выполнить().Выгрузить();
			
			//Бондаренко++ 20240517
			//СписокПоступлений = Новый СписокЗначений;
			//СписокПоступлений.ЗагрузитьЗначения(ТаблицаСостав.ВыгрузитьКолонку("ПоступлениеАвто"));
			//Бондаренко--+ 20240517
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПоступлениеАвтомобилейАвтомобили.Ссылка КАК Ссылка,
			|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата КАК ДатаВремяПрихода,
			|	ПоступлениеАвтомобилейАвтомобили.СуммаВсего КАК СтоимостьВходРубли,
			|	ВЫБОР
			|		КОГДА НЕ ПоступлениеАвтомобилейАвтомобили.АвтомобильБУ
			|			ТОГДА ПоступлениеАвтомобилейАвтомобили.Автомобиль.Модель.Марка
			|		ИНАЧЕ ""АСП""
			|	КОНЕЦ КАК Бренд,
			|	ПоступлениеАвтомобилейАвтомобили.Ссылка.ПодразделениеКомпании.Родитель КАК ПодразделениеКомпании,
			|	ВЫБОР
			|		КОГДА НЕ ПоступлениеАвтомобилейАвтомобили.АвтомобильБУ
			|			ТОГДА ПоступлениеАвтомобилейАвтомобили.Автомобиль.Модель
			|		ИНАЧЕ ""АСП""
			|	КОНЕЦ КАК Модель,
			|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен КАК Проведен,
			|	ПоступлениеАвтомобилейАвтомобили.АвтомобильБУ КАК АвтомобильБУ,
			|	ПоступлениеАвтомобилейАвтомобили.Автомобиль.VIN КАК VIN
			|ИЗ
			|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
			|ГДЕ
			|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаВремяПрихода";
			
			//Бондаренко++ 20240517
			//Запрос.УстановитьПараметр("СписокПоступлений",СписокПоступлений);
			//Бондаренко-- 20240517
			
			Запрос.УстановитьПараметр("ДатаНачала",Дата(2023,1,1));
			//Бондаренко++ 20240801
			//Запрос.УстановитьПараметр("ДатаОкончания",ТекущаяДата());
			Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(ТекущаяДата()));
			//Бондаренко-- 20240801
			
			ТаблицаПоступлений = Запрос.Выполнить().Выгрузить();
			
			Для каждого Стр Из ТаблицаПоступлений Цикл
				НовСтр = ТаблицаСостав.Добавить();	
				НовСтр.ДатаВремяПрихода = Стр.ДатаВремяПрихода;
				НовСтр.СтоимостьВходРубли = Стр.СтоимостьВходРубли;
				НовСтр.Бренд = Стр.Бренд;
				НовСтр.ПодразделениеКомпании = Стр.ПодразделениеКомпании;
				НовСтр.Модель = Стр.Модель;
				//Бондаренко-- 20240522		
				НовСтр.VIN = Стр.VIN;
				//Бондаренко-- 20240522		
			КонецЦикла;
			//Бондаренко-- 20240514		
			
			Запрос.УстановитьПараметр("ДатаНачала",Дата(2023,1,1));
			//Бондаренко++ 20240801
			//Запрос.УстановитьПараметр("ДатаОкончания",ТекущаяДата()); 
			Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(ТекущаяДата()));
			//Бондаренко-- 20240801
			
			//Бондаренко++ 20240521		
			
			//Бондаренко-- 20240521		
			
		КонецЕсли;			   
		
		Если Сч < 4 Тогда
			//Бондаренко++ 20240610
			Запрос.УстановитьПараметр("ДатаНачала",Дата(2023,1,1));
			//Запрос.УстановитьПараметр("ДатаНачала",Дата(2017,1,1));
			//Бондаренко-- 20240610
			//Бондаренко++ 20240801
			//Запрос.УстановитьПараметр("ДатаОкончания",ТекущаяДата());
			Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(ТекущаяДата()));
			//Бондаренко-- 20240801
			ТаблицаСостав = Запрос.Выполнить().Выгрузить();
		КонецЕсли;
		
		ТекстЗН = Новый ТекстовыйДокумент; 
		
		Для каждого Строка Из ТаблицаСостав Цикл
			
			Если Сч = 1 Тогда
				ТекстЗН.ДобавитьСтроку(
				СокрЛП(Формат(Строка.Дата,"ДЛФ=DT"))+";"+
				СокрЛП(Строка.Номер) + ";"+
				СокрЛП(Строка.ПодразделениеКомпании) + ";"+
				СокрЛП(Строка.ПредставлениеТелефона) + ";"+
				СокрЛП(Строка.Марка) + ";"+
				СокрЛП(Строка.АвтомобильНовый) + ";"+
				СокрЛП(Строка.ДатаРеализации) + ";"+
				СокрЛП(Строка.НомерРеализации) + ";"+
				СокрЛП(Строка.ДатаПодчиненногоЗаказа) + ";"+
				СокрЛП(Строка.НомерПодчиненногоЗаказа) + ";"+ 
				СокрЛП(Строка.Реклама) + ";"+ 
				СокрЛП(Строка.РекламаКодИсточника) + ";"+ 
				СокрЛП(Строка.Менеджер)+ ";"+ 
				СокрЛП(Строка.VIN)+ ";"+ 
				СокрЛП(Строка.ДатаОплаты)+ ";"+
				СокрЛП(Строка.МенеджерФлагУволен)+ ";"+
				СокрЛП(Строка.МенеджерДолжность)+ ";"+
				СокрЛП(Строка.ЮридическоеЛицо) ); 
			ИначеЕсли Сч = 2 Тогда
				ТекстЗН.ДобавитьСтроку(
				СокрЛП(Формат(Строка.Дата,"ДЛФ=DT"))+";"+
				СокрЛП(Строка.Номер) + ";"+
				СокрЛП(Строка.ПодразделениеКомпании) + ";"+
				СокрЛП(Строка.ПредставлениеТелефона) + ";"+
				СокрЛП(Строка.Марка) + ";"+
				СокрЛП(Строка.НомерРЛ) + ";"+
				СокрЛП(Строка.АвтомобильХар) + ";"+
				СокрЛП(Строка.ВКредит)+ ";"+
				СокрЛП(Строка.ТрейдИн)+ ";"+
				СокрЛП(Строка.Модель)+ ";"+
				СокрЛП(Строка.VIN)+ ";"+  
				СокрЛП(Строка.ФормаСобственности)+ ";"+  
				СокрЛП(Строка.ВидОплаты)  );
			ИначеЕсли Сч = 3 Тогда
				ТекстЗН.ДобавитьСтроку(
				СокрЛП(Формат(Строка.Дата,"ДЛФ=DT"))+";"+
				СокрЛП(Строка.Номер) + ";"+
				СокрЛП(Строка.ПодразделениеКомпании) + ";"+
				СокрЛП(Строка.ПредставлениеТелефона) + ";"+
				СокрЛП(Строка.Марка) + ";"+
				СокрЛП(Строка.НомерРЛ) + ";"+
				СокрЛП(Строка.Чат) + ";"+
				СокрЛП(Строка.ЭтоВизит) + ";"+
				СокрЛП(Строка.АвтомобильНовый) + ";"+ 
				СокрЛП(Строка.РекламаКодИсточника));
				//Бондаренко++ 20240522		
			ИначеЕсли Сч = 4 Тогда
				ТекстЗН.ДобавитьСтроку(
				СокрЛП(Формат(Строка.ДатаОкончания,"ДЛФ=DT"))+";"+
				СокрЛП(Формат(Строка.СуммаКон,"ДЛФ=DT"))+";"+
				СокрЛП(Формат(Строка.КолКон,"ДЛФ=DT"))+";"+
				СокрЛП(Строка.Бренд) + ";"+
				СокрЛП(Строка.ПодразделениеКомпании) + ";"+
				СокрЛП(Строка.Модель) + ";"+
				СокрЛП(Строка.VIN) + ";"+
				СокрЛП(Строка.Автомобиль) + ";"+
				СокрЛП(Строка.ДатаПоступления) + ";"+
				СокрЛП(Строка.АвтомобильХар));			
				//Бондаренко-- 20240522		
			ИначеЕсли Сч = 5 Тогда
				ТекстЗН.ДобавитьСтроку(
				СокрЛП(Формат(Строка.ДатаВремяПрихода,"ДЛФ=DT"))+";"+
				СокрЛП(Формат(Строка.ДатаРеализации,"ДЛФ=DT"))+";"+
				СокрЛП(Формат(Строка.СтоимостьВходРубли,"ДЛФ=DT"))+";"+
				СокрЛП(Строка.Бренд) + ";"+
				СокрЛП(Строка.ПодразделениеКомпании) + ";"+
				СокрЛП(Строка.Модель) + ";"+
				СокрЛП(Строка.НомерРЛ) + ";"+
				СокрЛП(Строка.НомерРеализации) + ";"+
				СокрЛП(Строка.VIN) );			
				//Бондаренко-- 20240514		
			КонецЕсли;
			
		КонецЦикла;
		
		Попытка
			ТекстЗН.Записать(ИмяФайла); 
			//СМГ_Сообщить("Выгрузка в файл <<"+ИмяФайла+">> завершена: "+Формат(ТекущаяДата(),"ДЛФ=DDT"));
		Исключение
			//СМГ_Сообщить("ОШИБКА! Не удалось записать файл : "+ИмяФайла,СтатусСообщения.ОченьВажное);		
		КонецПопытки; 
		
	КонецЦикла;
	
	
КонецПроцедуры //ВыгрузкаРлРеалАвтоИСобытийвФайлCSV(Параметры = Неопределено) 
//Бондаренко-- 20240104 

//Иванченко 20250305 ++
Процедура ВыгрузкаОстаткиОборотыТоваровВФайлCSV(Параметры = Неопределено) Экспорт
	//ГдеСоздавать = "C:\Users\ivanchenko_ii\Downloads\Для Антона\склад\";  
	ГдеСоздавать = "\\1cserver\powerbi\Sklad_Tovarov\";	
	
	МаскаФайла = "Sklad_Tovarov";
	
	МассивФайлов = НайтиФайлы(ГдеСоздавать, МаскаФайла + ".csv"); 
	
	Если МассивФайлов.Количество() <> 0 Тогда   
		ФайлВыгрузки = МассивФайлов[0];
		ЧтениеФайлаВыгрузки = Новый ЧтениеТекста;	
		ЧтениеФайлаВыгрузки.Открыть(ГдеСоздавать + МаскаФайла + ".csv");  
		СтрокаФайлаВыгрузки = ЧтениеФайлаВыгрузки.ПрочитатьСтроку();
		
		Пока СтрокаФайлаВыгрузки <> Неопределено Цикл;  
			
			Попытка
				ПоследняяДата = Дата(Лев(СтрокаФайлаВыгрузки, 19));    
			Исключение	
			КонецПопытки;  
			
			СтрокаФайлаВыгрузки = ЧтениеФайлаВыгрузки.ПрочитатьСтроку();			
		КонецЦикла;	 
		
		ЧтениеФайлаВыгрузки.Закрыть();
		
		Если ПоследняяДата <> Неопределено Тогда	
			Дата = ПоследняяДата + 86400;	
		Иначе 
			Дата = КонецДня(ТекущаяДата() - 86400); 
		КонецЕсли;
		
	Иначе       
		ФайлВыгрузки = Новый ТекстовыйДокумент; 
		ФайлВыгрузки.Записать(ГдеСоздавать + МаскаФайла + ".csv");		
		Дата = КонецДня(ТекущаяДата() - 86400); 
	КонецЕсли;	
		
	// Запаковка вт регистра во временную таблицу
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗапросВТ = Новый Запрос;
	ЗапросВТ.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;        
	ЗапросВТ.Текст =		
	"ВЫБРАТЬ
	|	ПартииТоваровКомпанииОстаткиИОбороты.Период КАК Дата,
	|	ПартииТоваровКомпанииОстаткиИОбороты.СкладКомпании КАК Склад,
	|	ПартииТоваровКомпанииОстаткиИОбороты.Регистратор КАК Документ,
	|	ПартииТоваровКомпанииОстаткиИОбороты.Номенклатура КАК Номенклатура,
	|	ПартииТоваровКомпанииОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	ПартииТоваровКомпанииОстаткиИОбороты.СуммаПриход КАК СуммаПриход,
	|	ПартииТоваровКомпанииОстаткиИОбороты.СуммаРасход КАК СуммаРасход,
	|	ПартииТоваровКомпанииОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_Цены
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании.ОстаткиИОбороты(
	|			НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ),
	|			КОНЕЦПЕРИОДА(&Дата, ДЕНЬ),
	|			Регистратор,
	|			,
	|			НЕ Номенклатура.ПометкаУдаления
	|				И НЕ СкладКомпании.ПометкаУдаления) КАК ПартииТоваровКомпанииОстаткиИОбороты
	|ГДЕ
	|	ПартииТоваровКомпанииОстаткиИОбороты.Период <> НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиТоваровКомпанииОстаткиИОбороты.Период КАК Дата,
	|	ОстаткиТоваровКомпанииОстаткиИОбороты.СкладКомпании.Организация КАК Организация,
	|	ОстаткиТоваровКомпанииОстаткиИОбороты.СкладКомпании.Подразделение.Родитель КАК Подразделение,
	|	ОстаткиТоваровКомпанииОстаткиИОбороты.СкладКомпании.Подразделение.ДилерскийЦентр КАК ДилерскийЦентр,
	|	ОстаткиТоваровКомпанииОстаткиИОбороты.СкладКомпании КАК Склад,
	|	ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор.Контрагент КАК Контрагент,
	|	ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор.Дата КАК ДокументДата,
	|	ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор.Номер КАК ДокументНомер,
	|	ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор.ХозОперация КАК ДокументВид,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоОборот <> 0
	|				ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.РезервОборот <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ЗаказIT
	|							ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ЗаказВнутренний
	|						ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор.ПодразделениеКомпании
	|					КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ВозвратОтПокупателя
	|							ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.АвансовыйОтчет
	|							ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ВозвратОтПокупателя
	|							ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваров
	|						ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор.Контрагент
	|					КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПеремещениеНезавершенногоПроизводства
	|						ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор.Цех
	|					КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваровОпт
	|						ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор.ПодразделениеОтправитель
	|					ИНАЧЕ ОстаткиТоваровКомпанииОстаткиИОбороты.СкладКомпании
	|				КОНЕЦ
	|	КОНЕЦ КАК Откуда,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоОборот <> 0
	|				ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.РезервОборот <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.АвансовыйОтчет
	|							ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ВозвратОтПокупателя
	|							ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ЗакрытиеСмены
	|							ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ИзвлечениеТоваровИзПроизводства
	|							ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.Инвентаризация
	|							ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.Комплектация
	|							ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ОбслуживаниеАктива
	|							ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.Переоценка
	|							ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПересортицаТоваров
	|							ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваров
	|							ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.Разукомплектация
	|							ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.РазукомплектацияАвтомобилей
	|						ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор.СкладКомпании
	|					КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ВводВЭксплуатацию
	|							ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ЗаказIT
	|							ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ЗаказВнутренний
	|							ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваровОпт
	|						ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор.ПодразделениеПолучатель
	|					КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ИзменениеЦен
	|						ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор.ПодразделениеКомпанииПолучатель
	|					КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
	|							ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваровИТ
	|						ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор.СкладПолучатель
	|					КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПеремещениеНезавершенногоПроизводства
	|						ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор.ЦехПолучатель
	|					КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваровВПроизводство
	|						ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор.Автор
	|					КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.РезервированиеЗаказовПокупателя
	|							ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.СнятиеРезервовЗаказовПокупателя
	|						ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.СкладКомпании
	|					ИНАЧЕ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор.Контрагент
	|				КОНЕЦ
	|	КОНЕЦ КАК Куда,
	|	ВЫБОР
	|			КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ЗаказIT
	|					ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ЗаказВнутренний
	|				ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор.ПодразделениеКомпании
	|			КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ВозвратОтПокупателя
	|					ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.АвансовыйОтчет
	|					ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ВозвратОтПокупателя
	|					ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваров
	|				ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор.Контрагент
	|			КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПеремещениеНезавершенногоПроизводства
	|				ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор.Цех
	|			КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваровОпт
	|				ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор.ПодразделениеОтправитель
	|			ИНАЧЕ ОстаткиТоваровКомпанииОстаткиИОбороты.СкладКомпании
	|		КОНЕЦ = ВЫБОР
	|			КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.АвансовыйОтчет
	|					ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ВозвратОтПокупателя
	|					ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ЗакрытиеСмены
	|					ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ИзвлечениеТоваровИзПроизводства
	|					ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.Инвентаризация
	|					ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.Комплектация
	|					ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ОбслуживаниеАктива
	|					ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.Переоценка
	|					ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПересортицаТоваров
	|					ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваров
	|					ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.Разукомплектация
	|					ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.РазукомплектацияАвтомобилей
	|				ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор.СкладКомпании
	|			КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ВводВЭксплуатацию
	|					ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ЗаказIT
	|					ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ЗаказВнутренний
	|					ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваровОпт
	|				ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор.ПодразделениеПолучатель
	|			КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ИзменениеЦен
	|				ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор.ПодразделениеКомпанииПолучатель
	|			КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
	|					ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваровИТ
	|				ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор.СкладПолучатель
	|			КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПеремещениеНезавершенногоПроизводства
	|				ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор.ЦехПолучатель
	|			КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваровВПроизводство
	|				ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор.Автор
	|			КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.РезервированиеЗаказовПокупателя
	|					ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.СнятиеРезервовЗаказовПокупателя
	|				ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.СкладКомпании
	|			ИНАЧЕ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор.Контрагент
	|		КОНЕЦ
	|		ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ._г_ИнвентаризацияОбщая
	|		ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.АвансовыйОтчет
	|		ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ВводВЭксплуатацию
	|		ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ВводОстатковТоваров
	|		ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ЗаказВнутренний
	|		ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ЗакрытиеСмены
	|		ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ИзвлечениеТоваровИзПроизводства
	|		ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ИзменениеЦен
	|		ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.Инвентаризация
	|		ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.Комплектация
	|		ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.Корректировка
	|		ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.КорректировкаПоступления
	|		ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|		ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПеремещениеНезавершенногоПроизводства
	|		ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
	|		ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваровВПроизводство
	|		ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваровИТ
	|		ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваровОпт
	|		ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.Переоценка
	|		ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПересортицаТоваров
	|		ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.Разукомплектация
	|		ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.РазукомплектацияАвтомобилей
	|		ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.РезервированиеЗаказовПокупателя
	|		ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.СнятиеРезервовЗаказовПокупателя
	|		ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор ССЫЛКА Документ.СписаниеТоваров
	|		ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор.Контрагент.НашаФирма КАК ДокументВнутренний,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|			ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель
	|		КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|			ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель
	|		КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|			ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель
	|		КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|			ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель.Родитель
	|		КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|			ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель
	|		ИНАЧЕ ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель
	|	КОНЕЦ КАК Группа1,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|			ТОГДА NULL
	|		КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|			ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель
	|		КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|			ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель
	|		КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|			ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель
	|		КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|			ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель.Родитель
	|		ИНАЧЕ ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель
	|	КОНЕЦ КАК Группа2,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|				ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|			ТОГДА NULL
	|		КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|			ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель
	|		КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|			ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель
	|		КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|			ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель
	|		ИНАЧЕ ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель.Родитель
	|	КОНЕЦ КАК Группа3,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|				ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|				ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|			ТОГДА NULL
	|		КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|			ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель
	|		КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|			ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель
	|		ИНАЧЕ ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель
	|	КОНЕЦ КАК Группа4,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|				ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|				ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|				ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|			ТОГДА NULL
	|		КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|			ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель
	|		ИНАЧЕ ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель
	|	КОНЕЦ КАК Группа5,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|				ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|				ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|				ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|				ИЛИ ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.номенклатура.пустаяссылка)
	|			ТОГДА NULL
	|		ИНАЧЕ ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Родитель
	|	КОНЕЦ КАК Группа6,
	|	ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура КАК Номенклатура,
	|	СТРОКА(ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Артикул) КАК Неликвид,
	|	ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	|	ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоПриход КАК КоличествоПриход,
	|	ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоРасход КАК КоличествоРасход,
	|	ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
	|	ОстаткиТоваровКомпанииОстаткиИОбороты.РезервНачальныйОстаток КАК РезервНачальныйОстаток,
	|	ОстаткиТоваровКомпанииОстаткиИОбороты.РезервПриход КАК РезервПриход,
	|	-ОстаткиТоваровКомпанииОстаткиИОбороты.РезервРасход КАК РезервРасход,
	|	ОстаткиТоваровКомпанииОстаткиИОбороты.РезервКонечныйОстаток КАК РезервКонечныйОстаток,
	|	ВТ_Цены.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	ВТ_Цены.СуммаПриход КАК СуммаПриход,
	|	ВТ_Цены.СуммаРасход КАК СуммаРасход,
	|	ВТ_Цены.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ""Оборот""
	|		ИНАЧЕ ""Остаток""
	|	КОНЕЦ КАК Движ_Ост,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоОборот <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоПриход > 0
	|						ТОГДА ""Приход по количеству""
	|					ИНАЧЕ ""Расход по количеству""
	|				КОНЕЦ
	|	КОНЕЦ КАК КолПрих_КолРасх,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.РезервОборот <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.РезервПриход > 0
	|						ТОГДА ""Приход по резерву""
	|					ИНАЧЕ ""Расход по резерву""
	|				КОНЕЦ
	|	КОНЕЦ КАК РезПрих_РезРасх,
	|	АВТОНОМЕРЗАПИСИ() КАК Индекс
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании.ОстаткиИОбороты(
	|			НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ),
	|			КОНЕЦПЕРИОДА(&Дата, ДЕНЬ),
	|			Регистратор,
	|			,
	|			НЕ Номенклатура.ПометкаУдаления
	|				И НЕ СкладКомпании.ПометкаУдаления) КАК ОстаткиТоваровКомпанииОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
	|		ПО ОстаткиТоваровКомпанииОстаткиИОбороты.Период = ВТ_Цены.Дата
	|			И ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор = ВТ_Цены.Документ
	|			И ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура = ВТ_Цены.Номенклатура
	|			И ОстаткиТоваровКомпанииОстаткиИОбороты.СкладКомпании = ВТ_Цены.Склад
	|ГДЕ
	|	ОстаткиТоваровКомпанииОстаткиИОбороты.Период <> НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Индекс"; 
		
	// Количество записей 
	ЗапросКЗ = Новый Запрос;
	ЗапросКЗ.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;   
	ЗапросКЗ.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат";  
	
	// Обращение ко временной таблице для порционного извлечения записей 
	ЗапросИтог = Новый Запрос;	
	ЗапросИтог.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросИтог.Текст =
	"ВЫБРАТЬ
	|	ВТ_Результат.Дата КАК Дата,
	|	ВТ_Результат.Организация КАК Организация,
	|	ВТ_Результат.Подразделение КАК Подразделение,
	|	ВТ_Результат.ДилерскийЦентр КАК ДилерскийЦентр,
	|	ВТ_Результат.Склад КАК Склад,
	|	ВТ_Результат.Контрагент КАК Контрагент,
	|	ВТ_Результат.ДокументДата КАК ДокументДата,
	|	ВТ_Результат.ДокументНомер КАК ДокументНомер,
	|	ВТ_Результат.ДокументВид КАК ДокументВид,
	|	ВТ_Результат.Откуда КАК Откуда,
	|	ВТ_Результат.Куда КАК Куда,
	|	ВТ_Результат.ДокументВнутренний КАК ДокументВнутренний,
	|	ВТ_Результат.Группа1 КАК Группа1,
	|	ВТ_Результат.Группа2 КАК Группа2,
	|	ВТ_Результат.Группа3 КАК Группа3,
	|	ВТ_Результат.Группа4 КАК Группа4,
	|	ВТ_Результат.Группа5 КАК Группа5,
	|	ВТ_Результат.Группа6 КАК Группа6,
	|	ВТ_Результат.Номенклатура КАК Номенклатура,
	|	ВТ_Результат.Неликвид КАК Неликвид,
	|	ВТ_Результат.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	|	ВТ_Результат.КоличествоПриход КАК КоличествоПриход,
	|	ВТ_Результат.КоличествоРасход КАК КоличествоРасход,
	|	ВТ_Результат.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
	|	ВТ_Результат.РезервНачальныйОстаток КАК РезервНачальныйОстаток,
	|	ВТ_Результат.РезервПриход КАК РезервПриход,
	|	ВТ_Результат.РезервРасход КАК РезервРасход,
	|	ВТ_Результат.РезервКонечныйОстаток КАК РезервКонечныйОстаток,
	|	ВТ_Результат.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	ВТ_Результат.СуммаПриход КАК СуммаПриход,
	|	ВТ_Результат.СуммаРасход КАК СуммаРасход,
	|	ВТ_Результат.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	ВТ_Результат.Движ_Ост КАК Движ_Ост,
	|	ВТ_Результат.КолПрих_КолРасх КАК КолПрих_КолРасх,
	|	ВТ_Результат.РезПрих_РезРасх КАК РезПрих_РезРасх,
	|	ВТ_Результат.Индекс КАК Индекс
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат";    
	
	//Уничтожение временных таблиц
	ЗапросУничтожить1 = Новый Запрос;	
	ЗапросУничтожить1.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросУничтожить1.Текст =
	"УНИЧТОЖИТЬ ВТ_Цены"; 	
	
	ЗапросУничтожить2 = Новый Запрос;	
	ЗапросУничтожить2.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросУничтожить2.Текст =
	"УНИЧТОЖИТЬ ВТ_Результат";  
		
	Пока Дата <= НачалоДня(ТекущаяДата()) Цикл  
		
		ТекстовыйФайл = Новый ТекстовыйДокумент; 
		
		ИмяФайла = "Temp_" + МаскаФайла + "_" + Строка(Формат(Дата, "ДФ=yyyyMMdd")) + ".csv";		
		
		ЗапросВТ.УстановитьПараметр("Дата", Дата);		
		РезультатЗапросаВТ = ЗапросВТ.Выполнить();  
		
		РезультатЗапросаКЗ = ЗапросКЗ.Выполнить().Выбрать();
		РезультатЗапросаКЗ.Следующий();
		
		РезультатЗапроса = ЗапросИтог.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
			СтрокаПорция = 					
			ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.Дата, "ДЛФ=DT")))	 				  		 + ";" + 
			ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.Организация))								  		 + ";" + 			
			ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.Подразделение))							  		 + ";" + 
			ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.ДилерскийЦентр))							  		 + ";" + 			
			ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.Склад))			 						  		 + ";" + 				
			ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.Контрагент))			 					  		 + ";" + 
			ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.ДокументДата, "ДЛФ=DT")))			  		 + ";" + 
			ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.ДокументНомер))			 				  		 + ";" + 
			ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.ДокументВид))			 					  		 + ";" + 
			ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.Откуда))			 				  		  		 + ";" + 
			ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.Куда))		 							  		 + ";" + 
			ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.ДокументВнутренний))			 			  		 + ";" + 
			ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.Группа1))			 						  		 + ";" + 
			ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.Группа2))			 						  		 + ";" + 
			ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.Группа3))			 						  		 + ";" + 
			ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.Группа4))			 						  		 + ";" + 
			ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.Группа5))			 						  		 + ";" + 
			ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.Группа6))			 						 		 + ";" + 
			ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.Номенклатура))			 				  		 + ";" + 
			ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.Неликвид))			 					 		 + ";" + 			
			ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.КоличествоНачальныйОстаток, "ЧН=0; ЧГ=0"))) + ";" + 
			ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.КоличествоПриход, "ЧН=0; ЧГ=0")))		     + ";" +			
			ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.КоличествоРасход, "ЧН=0; ЧГ=0")))		     + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.КоличествоКонечныйОстаток, "ЧН=0; ЧГ=0")))  + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.РезервНачальныйОстаток, "ЧН=0; ЧГ=0")))	 + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.РезервПриход, "ЧН=0; ЧГ=0")))			     + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.РезервРасход, "ЧН=0; ЧГ=0")))			     + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.РезервКонечныйОстаток, "ЧН=0; ЧГ=0")))	     + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.СуммаНачальныйОстаток, "ЧН=0; ЧГ=0")))	     + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.СуммаПриход, "ЧН=0; ЧГ=0")))				 + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.СуммаРасход, "ЧН=0; ЧГ=0")))				 + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.СуммаКонечныйОстаток, "ЧН=0; ЧГ=0")))	     + ";" +
			ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.Движ_Ост))			 				  	   		 + ";" + 			
			ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.КолПрих_КолРасх))			 		 		 		 + ";" + 			
			ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.РезПрих_РезРасх));                                                                     				
			ТекстовыйФайл.ДобавитьСтроку(СтрокаПорция);			
		КонецЦикла;		 
		
		Попытка
			ТекстовыйФайл.Записать(ГдеСоздавать + ИмяФайла);
		Исключение
			ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки; 
				
		ЗапросУничтожить1.Выполнить();	
		ЗапросУничтожить2.Выполнить();				
		
		Дата = Дата + 86400;   
	КонецЦикла;   
	
	УдалитьФайлы(ГдеСоздавать, МаскаФайла + ".csv"); 
	ОбъединитьФайлы(ГдеСоздавать + "Temp_" + МаскаФайла + "*", ГдеСоздавать + МаскаФайла + ".csv");
	УдалитьФайлы(ГдеСоздавать, "Temp_" + МаскаФайла + "_*");
КонецПроцедуры
//Иванченко 20250305 -- 

//Иванченко 20250506 ++
#Область Заморожено 
//Процедура ВыгрузкаВзаиморасчетыСКонтрагентамиВФайлCSV(Параметры = Неопределено) Экспорт
//	//ГдеСоздавать = "C:\Users\ivanchenko_ii\Downloads\Для Антона\ДтКт\"; 
//	ГдеСоздавать = "\\1CSERVER\powerbi\debit_credit\";  	
//	
//	МаскаФайла = "DbCt.csv";
//	
//	МассивФайлов = НайтиФайлы(ГдеСоздавать, МаскаФайла); 
//	
//	Если МассивФайлов.Количество() <> 0 Тогда   
//		ФайлВыгрузки = МассивФайлов[0];
//		ЧтениеФайлаВыгрузки = Новый ЧтениеТекста;	
//		ЧтениеФайлаВыгрузки.Открыть(ГдеСоздавать + МаскаФайла);  
//		СтрокаФайлаВыгрузки = ЧтениеФайлаВыгрузки.ПрочитатьСтроку();
//		
//		Пока СтрокаФайлаВыгрузки <> Неопределено Цикл;  
//			
//			Попытка
//				ПоследняяДата = Дата(Лев(СтрокаФайлаВыгрузки, 19));    
//			Исключение	
//			КонецПопытки;  
//			
//			СтрокаФайлаВыгрузки = ЧтениеФайлаВыгрузки.ПрочитатьСтроку();			
//		КонецЦикла;	 
//		
//		ЧтениеФайлаВыгрузки.Закрыть();
//		
//		Если ПоследняяДата <> Неопределено Тогда	
//			Дата = ПоследняяДата + 86400;	
//		Иначе 
//			Дата = КонецДня(ТекущаяДата() - 86400); 
//		КонецЕсли;	
//	Иначе       
//		ФайлВыгрузки = Новый ТекстовыйДокумент; 
//		ФайлВыгрузки.Записать(ГдеСоздавать + МаскаФайла);		
//		Дата = КонецДня(ТекущаяДата() - 86400); 
//	КонецЕсли;
//		
//	// Запаковка вт регистра во временную таблицу
//	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
//	ЗапросВТ = Новый Запрос;
//	ЗапросВТ.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;        
//	ЗапросВТ.Текст =		
//	"ВЫБРАТЬ
//	|	ВзаиморасчетыКомпанииОстатки.Контрагент КАК Контрагент,
//	|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
//	|	ВзаиморасчетыКомпанииОстатки.СуммаОстаток КАК СуммаОстаток
//	|ПОМЕСТИТЬ ВТ_КагентыДоговоры
//	|ИЗ
//	|	РегистрНакопления.ВзаиморасчетыКомпании.Остатки(&Дата, НЕ Контрагент.НашаФирма) КАК ВзаиморасчетыКомпанииОстатки
//	|ГДЕ
//	|	ВзаиморасчетыКомпанииОстатки.СуммаОстаток <> 0
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	МАКСИМУМ(ВЫБОР
//	|			КОГДА ВзаиморасчетыКомпанииОстаткиИОбороты.СуммаКонечныйОстаток = 0
//	|				ТОГДА ВзаиморасчетыКомпанииОстаткиИОбороты.Период
//	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
//	|		КОНЕЦ) КАК НулДата,
//	|	ВзаиморасчетыКомпанииОстаткиИОбороты.Контрагент КАК Контрагент,
//	|	ВзаиморасчетыКомпанииОстаткиИОбороты.ДоговорВзаиморасчетов КАК Договор
//	|ПОМЕСТИТЬ ВТ_НулДаты
//	|ИЗ
//	|	РегистрНакопления.ВзаиморасчетыКомпании.ОстаткиИОбороты(
//	|			,
//	|			&КонецПериода,
//	|			Регистратор,
//	|			,
//	|			НЕ Контрагент.НашаФирма
//	|				И ДоговорВзаиморасчетов В ИЕРАРХИИ
//	|					(ВЫБРАТЬ
//	|						ВТ_КагентыДоговоры.ДоговорВзаиморасчетов
//	|					ИЗ
//	|						ВТ_КагентыДоговоры КАК ВТ_КагентыДоговоры)) КАК ВзаиморасчетыКомпанииОстаткиИОбороты
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВзаиморасчетыКомпанииОстаткиИОбороты.ДоговорВзаиморасчетов,
//	|	ВзаиморасчетыКомпанииОстаткиИОбороты.Контрагент
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Договор
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВзаиморасчетыКомпанииОбороты.Контрагент КАК Контрагент,
//	|	ВзаиморасчетыКомпанииОбороты.ДоговорВзаиморасчетов КАК Договор,
//	|	ВзаиморасчетыКомпанииОбороты.Сделка КАК Документ,
//	|	ВзаиморасчетыКомпанииОбороты.Сделка.Дата КАК ДокументДата,
//	|	ВзаиморасчетыКомпанииОбороты.Сделка.Номер КАК ДокументНомер,
//	|	ВзаиморасчетыКомпанииОбороты.Сделка.ХозОперация КАК ДокументВид,
//	|	СУММА(ВзаиморасчетыКомпанииОбороты.СуммаОборот) КАК ДокументДолг
//	|ПОМЕСТИТЬ ВТ_Доки
//	|ИЗ
//	|	ВТ_НулДаты КАК ВТ_НулДаты
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыКомпании.Обороты(, &КонецПериода, Регистратор, НЕ Контрагент.НашаФирма) КАК ВзаиморасчетыКомпанииОбороты
//	|		ПО ВТ_НулДаты.НулДата < ВзаиморасчетыКомпанииОбороты.Сделка.Дата
//	|			И ВТ_НулДаты.Контрагент = ВзаиморасчетыКомпанииОбороты.Контрагент
//	|			И ВТ_НулДаты.Договор = ВзаиморасчетыКомпанииОбороты.ДоговорВзаиморасчетов
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВзаиморасчетыКомпанииОбороты.Сделка,
//	|	ВзаиморасчетыКомпанииОбороты.Контрагент,
//	|	ВзаиморасчетыКомпанииОбороты.ДоговорВзаиморасчетов,
//	|	ВзаиморасчетыКомпанииОбороты.Сделка.Дата,
//	|	ВзаиморасчетыКомпанииОбороты.Сделка.Номер,
//	|	ВзаиморасчетыКомпанииОбороты.Сделка.ХозОперация
//	|
//	|ИМЕЮЩИЕ
//	|	СУММА(ВзаиморасчетыКомпанииОбороты.СуммаОборот) <> 0
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	ДокументДата
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) КАК Дата,
//	|	ВзаиморасчетыКомпанииОстатки.Контрагент КАК Контрагент,
//	|	ВзаиморасчетыКомпанииОстатки.Контрагент.ВидКонтрагента КАК ВидКонтрагента,
//	|	ВзаиморасчетыКомпанииОстатки.Контрагент.ФормаСобственности КАК ФормаСобственности,
//	|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.Организация КАК Организация,
//	|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.Подразделение.Родитель КАК Подразделение,
//	|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов КАК Договор,
//	|	ВзаиморасчетыКомпанииОстатки.СуммаОстаток КАК Долг,
//	|	ВТ_Доки.ДокументДата КАК ДокументДата,
//	|	ВТ_Доки.ДокументНомер КАК ДокументНомер,
//	|	ВТ_Доки.ДокументВид КАК ДокументВид,
//	|	ВТ_Доки.ДокументДолг КАК ДокументДолг,
//	|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.Подразделение.ДилерскийЦентр КАК ДилерскийЦентр,
//	|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.Автор КАК ДоговорАвтор,
//	|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.ВидДоговора КАК ДоговорВид,
//	|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.ДляАвтомобилей КАК ДоговорДляАвтомобилей,
//	|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.ДляАвтосалона КАК ДоговорДляАвтосалона,
//	|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.ДляАвтосервиса КАК ДоговорДляАвтосервиса,
//	|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.ДляЗаказНарядов КАК ДоговорДляЗаказНарядов,
//	|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.ДляЗапчастей КАК ДоговорДляЗапчастей,
//	|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.ДляПерепродаж КАК ДоговорДляПерепродаж,
//	|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.ДляПерепродажАвтомобилей КАК ДоговорДляПерепродажАвтомобилей,
//	|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.Внутренний КАК ДоговорВнутренний,
//	|	АВТОНОМЕРЗАПИСИ() КАК Индекс
//	|ПОМЕСТИТЬ ВТ_Результат
//	|ИЗ
//	|	ВТ_Доки КАК ВТ_Доки
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыКомпании.Остатки(&Дата, НЕ Контрагент.НашаФирма) КАК ВзаиморасчетыКомпанииОстатки
//	|		ПО (ВзаиморасчетыКомпанииОстатки.Контрагент = ВТ_Доки.Контрагент)
//	|			И (ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов = ВТ_Доки.Договор)
//	|ГДЕ
//	|	ВТ_Доки.ДокументДата <= &Дата
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Индекс"; 
//		
//	// Количество записей 
//	ЗапросКЗ = Новый Запрос;
//	ЗапросКЗ.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;   
//	ЗапросКЗ.Текст = 
//	"ВЫБРАТЬ
//	|	КОЛИЧЕСТВО(*) КАК Количество
//	|ИЗ
//	|	ВТ_Результат КАК ВТ_Результат";  
//	
//	// Обращение ко временной таблице для порционного извлечения записей 
//	ЗапросИтог = Новый Запрос;	
//	ЗапросИтог.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
//	ЗапросИтог.Текст =
//	"ВЫБРАТЬ
//	|	ВТ_Результат.Дата КАК Дата,
//	|	ВТ_Результат.Контрагент КАК Контрагент,
//	|	ВТ_Результат.ВидКонтрагента КАК ВидКонтрагента,
//	|	ВТ_Результат.ФормаСобственности КАК ФормаСобственности,
//	|	ВТ_Результат.Организация КАК Организация,
//	|	ВТ_Результат.Подразделение КАК Подразделение,
//	|	ВТ_Результат.Договор КАК Договор,
//	|	ВТ_Результат.Долг КАК Долг,
//	|	ВТ_Результат.ДокументДата КАК ДокументДата,
//	|	ВТ_Результат.ДокументНомер КАК ДокументНомер,
//	|	ВТ_Результат.ДокументВид КАК ДокументВид,
//	|	ВТ_Результат.ДокументДолг КАК ДокументДолг,
//	|	ВТ_Результат.ДилерскийЦентр КАК ДилерскийЦентр,
//	|	ВТ_Результат.ДоговорАвтор КАК ДоговорАвтор,
//	|	ВТ_Результат.ДоговорВид КАК ДоговорВид,
//	|	ВТ_Результат.ДоговорДляАвтомобилей КАК ДоговорДляАвтомобилей,
//	|	ВТ_Результат.ДоговорДляАвтосалона КАК ДоговорДляАвтосалона,
//	|	ВТ_Результат.ДоговорДляАвтосервиса КАК ДоговорДляАвтосервиса,
//	|	ВТ_Результат.ДоговорДляЗаказНарядов КАК ДоговорДляЗаказНарядов,
//	|	ВТ_Результат.ДоговорДляЗапчастей КАК ДоговорДляЗапчастей,
//	|	ВТ_Результат.ДоговорДляПерепродаж КАК ДоговорДляПерепродаж,
//	|	ВТ_Результат.ДоговорДляПерепродажАвтомобилей КАК ДоговорДляПерепродажАвтомобилей,
//	|	ВТ_Результат.ДоговорВнутренний КАК ДоговорВнутренний,
//	|	ВТ_Результат.Индекс КАК Индекс
//	|ИЗ
//	|	ВТ_Результат КАК ВТ_Результат
//	|ГДЕ
//	|	ВТ_Результат.Индекс МЕЖДУ &Индекс1 И &Индекс2";    
//	
//	//Уничтожение временных таблиц
//	ЗапросУничтожить1 = Новый Запрос;	
//	ЗапросУничтожить1.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
//	ЗапросУничтожить1.Текст =
//	"УНИЧТОЖИТЬ ВТ_КагентыДоговоры";  
//	
//	ЗапросУничтожить2 = Новый Запрос;	
//	ЗапросУничтожить2.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
//	ЗапросУничтожить2.Текст =
//	"УНИЧТОЖИТЬ ВТ_НулДаты"; 

//	ЗапросУничтожить3 = Новый Запрос;	
//	ЗапросУничтожить3.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
//	ЗапросУничтожить3.Текст =
//	"УНИЧТОЖИТЬ ВТ_Доки";	
//	
//	ЗапросУничтожить4 = Новый Запрос;	
//	ЗапросУничтожить4.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
//	ЗапросУничтожить4.Текст =
//	"УНИЧТОЖИТЬ ВТ_Результат"; 
//		
//	Пока Дата <= НачалоДня(ТекущаяДата()) Цикл  
//		
//		//Если Дата = ДатаНачала Тогда  
//		//	Заголовок = "Дата;Контрагент;ВидКонтрагента;ФормаСобственности;Организация;Подразделение;Договор;Долг;ДокументДата;ДокументНомер;ДокументВид;ДокументДолг";	
//		//	ТекстовыйФайл.ДобавитьСтроку(Заголовок); 
//		//КонецЕсли;	
//		
//		ИмяФайла = "DbCt_" + Строка(Формат(Дата, "ДФ=yyyyMMdd")) + ".csv";		
//		
//		ЗапросВТ.УстановитьПараметр("Дата", Дата);
//		ЗапросВТ.УстановитьПараметр("ВидЗначения", Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля); 
//		ЗапросВТ.УстановитьПараметр("КонецПериода", КонецДня(ТекущаяДата() - 86400)); 
//		
//		РезультатЗапросаВТ = ЗапросВТ.Выполнить();  
//		
//		РезультатЗапросаКЗ = ЗапросКЗ.Выполнить().Выбрать();
//		РезультатЗапросаКЗ.Следующий();
//		Сообщить("Всего записей: " + РезультатЗапросаКЗ.Количество);      
//		
//		ЧастьФайла = 0;
//		
//		Для Граница = 1 По РезультатЗапросаКЗ.Количество Цикл
//			ЗапросИтог.УстановитьПараметр("Индекс1", 1 + 100000 * (Граница - 1));
//			ЗапросИтог.УстановитьПараметр("Индекс2", 100000 * Граница);		
//			РезультатЗапроса = ЗапросИтог.Выполнить();
//			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//			
//			Счетчик = 0;  
//			ТекстовыйФайлЧасть = Новый ТекстовыйДокумент;
//			
//			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
//				
//				Если Счетчик = 0 Тогда
//					Сообщить(ВыборкаДетальныеЗаписи.Индекс);
//				КонецЕсли;
//				
//				СтрокаПорция = 					
//				ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.Дата, "ДЛФ=DT")))	 	    + ";" + 
//				ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.Контрагент))					    + ";" +
//				ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.ВидКонтрагента))				    + ";" + 
//				ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.ФормаСобственности))			    + ";" + 			
//				ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.Организация))					    + ";" + 
//				ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.Подразделение))			        + ";" + 				
//				ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.Договор))			 			    + ";" + 				
//				ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.Долг, "ЧН=0")))		    + ";" +			
//				ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.ДокументДата, "ДЛФ=DT")))  + ";" + 
//				ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.ДокументНомер))  				    + ";" +   
//				ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.ДокументВид))			 	 	    + ";" + 	
//				ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.ДокументДолг, "ЧН=0")))    + ";" +
//				ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.ДилерскийЦентр))				    + ";" +
//				ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.ДоговорАвтор))				    + ";" +
//				ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.ДоговорВид))					    + ";" +
//				ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.ДоговорДляАвтомобилей))		    + ";" +
//				ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.ДоговорДляАвтосалона))		    + ";" +
//				ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.ДоговорДляАвтосервиса))		    + ";" +
//				ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.ДоговорДляЗаказНарядов))		    + ";" +
//				ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.ДоговорДляЗапчастей))			    + ";" +
//				ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.ДоговорДляПерепродаж))		    + ";" +
//				ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.ДоговорДляПерепродажАвтомобилей)) + ";" +
//				ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.ДоговорВнутренний)); 				
//				ТекстовыйФайлЧасть.ДобавитьСтроку(СтрокаПорция);	
//								
//				Счетчик = Счетчик + 1;
//			КонецЦикла;	
//			
//			ТекстовыйФайлЧасть.Записать(ГдеСоздавать + "DbCt_Part" + Строка(ЧастьФайла) + ".csv");		
//			Сообщить("Получено: " + Строка(Счетчик) + " в " + "DbCt_Part" + Строка(ЧастьФайла) + ".csv");
//			ЧастьФайла = ЧастьФайла + 1;
//			
//			Если Счетчик = 0 Тогда
//				Прервать;
//			КонецЕсли;	
//			
//		КонецЦикла;	 
//		
//		Попытка
//			ОбъединитьФайлы(ГдеСоздавать + "DbCt_" + Строка(Формат(Дата, "ДФ=yyyyMMdd")) + "_Part*", ГдеСоздавать + ИмяФайла);
//			УдалитьФайлы(ГдеСоздавать, "DbCt_Part*"); 			
//			Сообщить("Файл остатков успешно выгружен: " + ГдеСоздавать + ИмяФайла); 
//		Исключение
//			ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
//			Сообщить("Не удалось записать файл: " + ГдеСоздавать + ИмяФайла + Символы.ПС + ТекстОшибки);
//		КонецПопытки; 
//				
//		ЗапросУничтожить1.Выполнить();	
//		ЗапросУничтожить2.Выполнить();		
//		ЗапросУничтожить3.Выполнить();		
//		ЗапросУничтожить4.Выполнить();				
//		
//		Дата = Дата + 86400;   
//	КонецЦикла;   
//	
//	УдалитьФайлы(ГдеСоздавать, МаскаФайла);   
//	ОбъединитьФайлы(ГдеСоздавать + "DbCt_*", ГдеСоздавать + МаскаФайла);
//	УдалитьФайлы(ГдеСоздавать, "DbCt_*"); 
//	//Сообщить("Итоговый файл остатков успешно сформирован: " + ГдеСоздавать + МаскаФайла); 	
//КонецПроцедуры 
#КонецОбласти
//Иванченко 20250506 --

//Иванченко 20250512 ++
Процедура ВыгрузкаАвтоНаСкладахВФайлCSV() Экспорт
	//Иванченко 20260212 ++
	#Область Устарело
	////ГдеСоздавать = "C:\Users\ivanchenko_ii\Downloads\Для Антона\авто\";  
	//ГдеСоздавать = "\\1cserver\powerbi\sklan_auto\";	
	//
	//МаскаФайла = "Avto_na_skladah.csv";
	//
	//МассивФайлов = НайтиФайлы(ГдеСоздавать, МаскаФайла); 
	//
	//Если МассивФайлов.Количество() <> 0 Тогда   
	//	ФайлВыгрузки = МассивФайлов[0];
	//	ЧтениеФайлаВыгрузки = Новый ЧтениеТекста;	
	//	ЧтениеФайлаВыгрузки.Открыть(ГдеСоздавать + МаскаФайла);  
	//	СтрокаФайлаВыгрузки = ЧтениеФайлаВыгрузки.ПрочитатьСтроку();
	//	
	//	Пока СтрокаФайлаВыгрузки <> Неопределено Цикл;  
	//		
	//		Попытка
	//			ПоследняяДата = Дата(Лев(СтрокаФайлаВыгрузки, 19));    
	//		Исключение	
	//		КонецПопытки;  
	//		
	//		СтрокаФайлаВыгрузки = ЧтениеФайлаВыгрузки.ПрочитатьСтроку();			
	//	КонецЦикла;	 
	//	
	//	ЧтениеФайлаВыгрузки.Закрыть();
	//	
	//	Если ПоследняяДата <> Неопределено Тогда	
	//		Дата = ПоследняяДата + 86400;	
	//	Иначе 
	//		Дата = КонецДня(ТекущаяДата() - 86400); 
	//	КонецЕсли;	
	//Иначе       
	//	ФайлВыгрузки = Новый ТекстовыйДокумент; 
	//	ФайлВыгрузки.Записать(ГдеСоздавать + МаскаФайла);		
	//	Дата = КонецДня(ТекущаяДата() - 86400); 
	//КонецЕсли;	
	//
	//// Запаковка вт регистра во временную таблицу
	//МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	//ЗапросВТ = Новый Запрос;
	//ЗапросВТ.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;        
	//ЗапросВТ.Текст =		
	//"ВЫБРАТЬ
	//|	&Дата КАК Дата,
	//|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.Родитель КАК Подразделение,
	//|	ОстаткиАвтомобилейОстатки.СкладКомпании КАК Склад,
	//|	ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль,
	//|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN КАК VIN,
	//|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель КАК Модель,
	//|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.Марка КАК Бренд,
	//|	ХарАвто.ВидАвто КАК ВидАвто,
	//|	ЕСТЬNULL(ОстаткиАвтомобилейОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	//|	ЕСТЬNULL(ЗаказыАвто.Резерв, 0) КАК Резерв,
	//|	ЕСТЬNULL(ОстаткиАвтомобилейОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	//|	ЕСТЬNULL(Хранение.ДатаПриемкиНаТекушийСклад, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПриемкиНаТекушийСклад,
	//|	ПоступлениеАвто.СрокХранения КАК СрокХранения,
	//|	ЕСТЬNULL(ПоступлениеАвто.ДатаПоступления, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоступления,
	//|	АВТОНОМЕРЗАПИСИ() КАК Индекс
	//|ПОМЕСТИТЬ ВТ_Результат
	//|ИЗ
	//|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(&Дата, ) КАК ОстаткиАвтомобилейОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			ОстаткиАвтомобилей.Автомобиль КАК Автомобиль,
	//|			НАЧАЛОПЕРИОДА(МАКСИМУМ(ОстаткиАвтомобилей.Период), ДЕНЬ) КАК ДатаПриемкиНаТекушийСклад
	//|		ИЗ
	//|			РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
	//|		ГДЕ
	//|			ОстаткиАвтомобилей.Период <= &Дата
	//|		
	//|		СГРУППИРОВАТЬ ПО
	//|			ОстаткиАвтомобилей.Автомобиль) КАК Хранение
	//|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = Хранение.Автомобиль
	//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	//|			АвтомобилиСрезПоследних.Значение КАК ВидАвто,
	//|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения
	//|		ИЗ
	//|			РегистрСведений.Автомобили.СрезПоследних(&Дата, ) КАК АвтомобилиСрезПоследних
	//|		ГДЕ
	//|			АвтомобилиСрезПоследних.ВидЗначения = &ВидЗначения
	//|			И ТИПЗНАЧЕНИЯ(АвтомобилиСрезПоследних.ВидЗначения) = ТИП(Перечисление.ДополнительнаяИнформацияАвтомобилей)) КАК ХарАвто
	//|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ХарАвто.Автомобиль
	//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			ЗаказыАвтомобилейОстатки.Автомобиль КАК Автомобиль,
	//|			ЗаказыАвтомобилейОстатки.РезервОстаток КАК Резерв
	//|		ИЗ
	//|			РегистрНакопления.ЗаказыАвтомобилей.Остатки(&Дата, ) КАК ЗаказыАвтомобилейОстатки) КАК ЗаказыАвто
	//|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ЗаказыАвто.Автомобиль
	//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			ПоступлениеАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
	//|			МАКСИМУМ(ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата) КАК ДатаПоступления,
	//|			РАЗНОСТЬДАТ(ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата, &Дата, ДЕНЬ) КАК СрокХранения
	//|		ИЗ
	//|			Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
	//|		ГДЕ
	//|			ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен
	//|		
	//|		СГРУППИРОВАТЬ ПО
	//|			ПоступлениеАвтомобилейАвтомобили.Автомобиль,
	//|			РАЗНОСТЬДАТ(ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата, &Дата, ДЕНЬ)) КАК ПоступлениеАвто
	//|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ПоступлениеАвто.Автомобиль
	//|ГДЕ
	//|	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Индекс"; 
	//
	//// Количество записей 
	//ЗапросКЗ = Новый Запрос;
	//ЗапросКЗ.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;   
	//ЗапросКЗ.Текст = 
	//"ВЫБРАТЬ
	//|	КОЛИЧЕСТВО(*) КАК Количество
	//|ИЗ
	//|	ВТ_Результат КАК ВТ_Результат";  
	//
	//// Обращение ко временной таблице для порционного извлечения записей 
	//ЗапросИтог = Новый Запрос;	
	//ЗапросИтог.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	//ЗапросИтог.Текст =
	//"ВЫБРАТЬ
	//|	ВТ_Результат.Дата КАК Дата,
	//|	ВТ_Результат.Подразделение КАК Подразделение,
	//|	ВТ_Результат.Склад КАК Склад,
	//|	ВТ_Результат.Автомобиль КАК Автомобиль,
	//|	ВТ_Результат.VIN КАК VIN,
	//|	ВТ_Результат.Модель КАК Модель,
	//|	ВТ_Результат.Бренд КАК Бренд,
	//|	ВТ_Результат.ВидАвто КАК ВидАвто,
	//|	ВТ_Результат.КоличествоОстаток КАК КоличествоОстаток,
	//|	ВТ_Результат.Резерв КАК Резерв,
	//|	ВТ_Результат.СуммаОстаток КАК СуммаОстаток,
	//|	ВТ_Результат.ДатаПриемкиНаТекушийСклад КАК ДатаПриемкиНаТекушийСклад,
	//|	ВТ_Результат.СрокХранения КАК СрокХранения,
	//|	ВТ_Результат.ДатаПоступления КАК ДатаПоступления,
	//|	ВТ_Результат.Индекс КАК Индекс
	//|ИЗ
	//|	ВТ_Результат КАК ВТ_Результат";    
	//
	////Уничтожение временной таблицы
	//ЗапросУничтожить = Новый Запрос;	
	//ЗапросУничтожить.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	//ЗапросУничтожить.Текст =
	//"УНИЧТОЖИТЬ ВТ_Результат"; 
	//
	//Пока Дата <= НачалоДня(ТекущаяДата()) Цикл  
	//	
	//	ТекстовыйФайл = Новый ТекстовыйДокумент; 
	//	
	//	ИмяФайла = "Avto_na_skladah_" + Строка(Формат(Дата, "ДФ=yyyyMMdd")) + ".csv";		
	//	
	//	ЗапросВТ.УстановитьПараметр("Дата", Дата);
	//	ЗапросВТ.УстановитьПараметр("ВидЗначения", Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля);
	//	
	//	РезультатЗапросаВТ = ЗапросВТ.Выполнить();  
	//	
	//	РезультатЗапросаКЗ = ЗапросКЗ.Выполнить().Выбрать();
	//	РезультатЗапросаКЗ.Следующий();
	//	
	//	РезультатЗапроса = ЗапросИтог.Выполнить();
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	//	
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
	//		СтрокаПорция = 					
	//		ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.Дата, "ДЛФ=DT")))	 				    + ";" + 
	//		ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.Подразделение))							    + ";" + 
	//		ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.Склад))			 						    + ";" + 				
	//		ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.Автомобиль)) 								    + ";" +			
	//		ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.VIN, "ЧН=0")))			 	 		    + ";" + 			
	//		ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.Модель))			 				 		    + ";" + 
	//		ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.Бренд))                            		    + ";" +  
	//		ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.ВидАвто))                           		    + ";" + 
	//		ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.КоличествоОстаток, "ЧН=0")))		    + ";" +  
	//		ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.Резерв, "ЧН=0")))					    + ";" + 			
	//		ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.СуммаОстаток, "ЧН=0")))		 		+ ";" + 			
	//		ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.ДатаПриемкиНаТекушийСклад, "ДЛФ=DT"))) + ";" +
	//		ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.СрокХранения, "ЧН=0")))				+ ";" +
	//		ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.ДатаПоступления, "ДЛФ=DT")));                                                                     	
	//		ТекстовыйФайл.ДобавитьСтроку(СтрокаПорция);			
	//	КонецЦикла;	 
	//	
	//	Попытка
	//		ТекстовыйФайл.Записать(ГдеСоздавать + ИмяФайла);
	//	Исключение
	//		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	//	КонецПопытки; 
	//	
	//	ЗапросУничтожить.Выполнить();		
	//	
	//	Дата = Дата + 86400;   
	//КонецЦикла;   
	//
	//УдалитьФайлы(ГдеСоздавать, МаскаФайла); 
	//ОбъединитьФайлы(ГдеСоздавать + "Avto_na_skladah*", ГдеСоздавать + МаскаФайла);
	//УдалитьФайлы(ГдеСоздавать, "Avto_na_skladah_*"); 
	#КонецОбласти
	
	ГдеСоздавать = "\\1cserver\powerbi\\sklad_gm_auto_2026\";		
	МаскаФайла = "Avto_na_skladah_v2.csv";	
	Массив_ФайлВыгрузки = НайтиФайлы(ГдеСоздавать, МаскаФайла);
	ПоследняяДата = '20260101';    
	ДатаПропускаС = '00010101';	
	НеделяДоВчера = НачалоДня(ТекущаяДата() - 691200);
	ТД_Шапка = Новый ТекстовыйДокумент;
	
	Если Массив_ФайлВыгрузки.Количество() = 0 Тогда
		Шапка = "Дата;ДилерскийЦентр;Подразделение;Склад;Автомобиль;ВидАвтомобиля;VIN;Бренд;Модель;ВариантКомплектации;ГодВыпуска;СобственникАвтомобиля;Отчитан;БлокировкаПродажи;РабочийЛист;Реализация;Количество_Остаток_Оборот;Сумма_Остаток_Оборот;ДатаРитейла;ДатаРитейла2;СкидкаПриПокупкеВТрейдИн;СкидкаПриПокупкеВТрейдИн;НомерДатаПерезачета;Оплачен;ДатаОплаты;РазмерСкидки;ОжидаемаяДатаПолученияКомпенсации;РазмерКомпенсации;НаличныйРасчет;БезналичныйРасчет;Кредит;Обмен;Лизинг;ПредоплатаЗаАМ;ДатаПредоплатыЗаАМ;Покупатель;РРЦ;Инвойс;СкидкаТрейдИнПлан;СкидкаТрейдИнФакт;СкидкаТрейдИн2План;СкидкаТрейдИн2Факт;СкидкаСубсидияКредитПлан;СкидкаСубсидияКредитФакт;СкидкаПоПрограммамЛояльности;СкидкаПоСпецПрограмме;СкидкаРозничная;СкидкаДополнительная;СтоимостьДопОборудования_Маркетинг;СтоимостьДопОборудования;ПлановаяСтоимостьДО;СебестоимостьДО;СебестоимостьДО_Комплектации;СуммаДО;ЦенаДопПоПрайсу;ПредоплатаТО;КомпенсацияТрейдИНРетроспективная;КомпенсацияСубсидияКредитРетроспективная;КомпенсацияПоПрограммамЛояльностиРетроспективная;КомпенсацияРозничнаяРетроспективная;КомпенсацияТрейдИН2Ретроспективная;КомпенсацияРетроспективная;КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля;СуммаКомпенсации;КомпенсацияВИнвойсе;КомпенсацияБрокерФинанс;СуммаКаско;ВариантКаско;СуммаОсаго;ВариантОсаго;СуммаСтрахованиеЖизни;ВариантСтрахованиеЖизни;ЦенаФакт;ЦенаДоговора;ПервоначальныйВзнос;ДатаПервоначальногоВзноса;БанкЛК;КредитнаяСтоимость;ПрогнозСрокаПодготовкиАвтоВДнях;ПрогнозСуммыРемонта;ПрогнозСуммыДетейлинга;ПрогнозируемаяЦенаПродажи;ПрогнозСрокаПродажиАвтоВДнях;ПрогнозСуммыМКЦ;ЦенаМинРыночнаяТрейдИн;ПланируемаяЦенаПродажиТрейдИн;ЦенаДКПТрейдИн;ДатаРитейла_РЛ;СуммаИСП;КоличествоДолгаОП;Резерв;ДатаПоступленияВГК;ДатаФинансирования;ДатаПриемкиНаТекушийСклад;СрокХранения;ГарантияПИ;БонусЗаМодель;ЦелеваяДоходность;БонусЗаШтуку;СтоимостьСуточногоХранения;ОбщаяСтоимостьХранения;Tech_1;Tech_2;Tech_3;Tech_4;Tech_5;Tech_6;Tech_7;Tech_8;Tech_9;Tech_10;Tech_11;Tech_12;Tech_13;Tech_14;Tech_15;Tech_16;Tech_17;Tech_18;Tech_19;Tech_20;Tech_21;Tech_22;Tech_23;Tech_24;Tech_25;Tech_26;Tech_27;Tech_28;Tech_29;Tech_30;Tech_31;Tech_32;Tech_33;Tech_34;Tech_35;Tech_36;Tech_37;Tech_38;Tech_39;Tech_40;Tech_41;Tech_42;Tech_43;Tech_44;Tech_45;Tech_46;Tech_47;Tech_48;Tech_49;Tech_50";
		ТД_Шапка.ВставитьСтроку(1, Шапка);
		Дата = '20260101';
	Иначе
		ТД_Шапка.Прочитать(ГдеСоздавать + МаскаФайла);
		ТД_Шапка.Записать("\\1cserver\powerbi\\sklad_gm_auto_2026_backup\Avto_na_skladah_v2_backup.csv"); 
		ЧтениеФайлаВыгрузки = Новый ЧтениеТекста;	
		ЧтениеФайлаВыгрузки.Открыть(ГдеСоздавать + МаскаФайла);  
		СтрокаФайлаВыгрузки = ЧтениеФайлаВыгрузки.ПрочитатьСтроку(); 
		СтрокаФайлаВыгрузки = ЧтениеФайлаВыгрузки.ПрочитатьСтроку();
		сч = 2;

		Пока СтрокаФайлаВыгрузки <> Неопределено Цикл;  
			
			Попытка
				Строка_ДатаСтроки = Лев(СтрокаФайлаВыгрузки, 10);
				ДатаСтроки = Дата(Прав(Строка_ДатаСтроки, 4), Сред(Строка_ДатаСтроки, 4, 2), Лев(Строка_ДатаСтроки, 2)); 
				
				Если ПоследняяДата - ДатаСтроки >= 86400 Тогда
					ДатаПропускаС = ДатаСтроки; 
					Прервать;
				КонецЕсли;	
				
			Исключение	
			КонецПопытки;
			
			ПоследняяДата = ДатаСтроки;  
			
			Если ДатаСтроки >= НеделяДоВчера Тогда
				ТД_Шапка.УдалитьСтроку(сч); 
			Иначе
				сч = сч + 1;						
			КонецЕсли;
			
			СтрокаФайлаВыгрузки = ЧтениеФайлаВыгрузки.ПрочитатьСтроку();			
		КонецЦикла;	 
		
		ЧтениеФайлаВыгрузки.Закрыть(); 
		
		Если ДатаПропускаС = '00010101' Тогда
			
			Если ДатаСтроки < НеделяДоВчера Тогда
				Дата = ДатаСтроки;
			Иначе
				Дата = НеделяДоВчера;
			КонецЕсли;
			
		Иначе
			
			Если ДатаПропускаС < НеделяДоВчера Тогда
				Дата = ДатаПропускаС;		
			Иначе
				Дата = НеделяДоВчера;
			КонецЕсли;	
			
		КонецЕсли; 
		
	КонецЕсли;
	
	ТД_Шапка.Записать(ГдеСоздавать + "Avto_na_skladah_v2_0.csv");    
	
	//Иванченко 20260513 ++
	//Переработан факторинг в связи с добавлением записей по авто и по банкам
	//Иванченко 20260513 -- 	
	//Иванченко 20260415 ++ 
	//Формулы расчета ЖМ, GM1
	//СТАЛО
	//+ КоммерческоеДО.Сумма
	//Иванченко 20260415 --	
	//Иванченко 20260413 ++
	//БЫЛО    
	//
	//СТАЛО                                                 
	//ОстаткиАвтомобилейОбороты.Регистратор.ДокументОснование КАК Поступление
    //ВсеПоступления.Поступление = Корректировки.Поступление
	//Иванченко 20260413 --
	//Иванченко 20260402 ++
	//БЫЛО
	//ВТ_Основа.Автомобиль.Модель.Марка.КомпенсацияБезНДС
	//СТАЛО
    //
	//Иванченко 20260402 --
	//Иванченко 20260331 ++
	//СТАЛО
	//	НЕ Заказ.ПометкаУдаления
	//И Заказ.Проведен
	//И НЕ Заказ.Контрагент.НашаФирма
	//И Заказ.ХозОперация <> ЗНАЧЕНИЕ(Справочник.Хозоперации.ЗаказНаАвтомобильОтмена)  
	//Иванченко 20260331 --	
	//Иванченко 20260329 ++
	// Скорректирован текст запроса
	//БЫЛО
	//ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТ_Основа.РЛ))
	//СТАЛО
	//ВТ_Основа.РЛ
	//
	//И ПериодыФакторингаАМСрезПоследних.Фактор = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//Иванченко 20260329 --	
	Запрос = Новый Запрос( 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПроизводственныйКалендарь.ДатаКалендаря КАК День
	|ПОМЕСТИТЬ ВТ_Дни
	|ИЗ
	|	РегистрСведений.DMS_ПроизводственныйКалендарь КАК ПроизводственныйКалендарь
	|ГДЕ
	|	ПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &Дата1 И &Дата2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Дни.День КАК День,
	|	ОстаткиАвтомобилейОстаткиИОбороты.СкладКомпании КАК Склад,
	|	ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль КАК Автомобиль,
	|	СУММА(ВЫБОР
	|			КОГДА ОстаткиАвтомобилейОстаткиИОбороты.Период = &Дата1
	|				ТОГДА ОстаткиАвтомобилейОстаткиИОбороты.КоличествоКонечныйОстаток
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ОстаткиАвтомобилейОстаткиИОбороты.Период <= ВТ_Дни.День
	|						ТОГДА ОстаткиАвтомобилейОстаткиИОбороты.КоличествоОборот
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ) КАК Количество,
	|	СУММА(ОстаткиАвтомобилейОстаткиИОбороты.СуммаКонечныйОстаток) КАК Сумма
	|ПОМЕСТИТЬ ВТ_ОО
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.ОстаткиИОбороты(&Дата1, &Дата2, День, , ) КАК ОстаткиАвтомобилейОстаткиИОбороты,
	|	ВТ_Дни КАК ВТ_Дни
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиАвтомобилейОстаткиИОбороты.СкладКомпании,
	|	ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль,
	|	ВТ_Дни.День
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтгрузкаАвтомобиляБезРеализации.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ОАБР
	|ИЗ
	|	Документ.ОтгрузкаАвтомобиляБезРеализации КАК ОтгрузкаАвтомобиляБезРеализации
	|ГДЕ
	|	ОтгрузкаАвтомобиляБезРеализации.Проведен
	|	И НЕ ОтгрузкаАвтомобиляБезРеализации.ПометкаУдаления
	|	И ОтгрузкаАвтомобиляБезРеализации.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтгрузкаАвтомобиляБезРеализации)
	|	И ОтгрузкаАвтомобиляБезРеализации.Дата МЕЖДУ &Дата1 И &Дата2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтгрузкаАвтомобиляБезРеализации.ДокументОснование КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ООАБР
	|ИЗ
	|	Документ.ОтгрузкаАвтомобиляБезРеализации КАК ОтгрузкаАвтомобиляБезРеализации
	|ГДЕ
	|	ОтгрузкаАвтомобиляБезРеализации.Проведен
	|	И НЕ ОтгрузкаАвтомобиляБезРеализации.ПометкаУдаления
	|	И ОтгрузкаАвтомобиляБезРеализации.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтменаОтгрузкиАвтомобиляБезРеализации)
	|	И ОтгрузкаАвтомобиляБезРеализации.ДокументОснование В
	|			(ВЫБРАТЬ
	|				ВТ_ОАБР.Ссылка
	|			ИЗ
	|				ВТ_ОАБР)
	|	И ОтгрузкаАвтомобиляБезРеализации.ДокументОснование ССЫЛКА Документ.ОтгрузкаАвтомобиляБезРеализации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказНаАвтомобиль.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ЗнА
	|ИЗ
	|	Документ.ЗаказНаАвтомобиль КАК ЗаказНаАвтомобиль
	|ГДЕ
	|	ЗаказНаАвтомобиль.Проведен
	|	И НЕ ЗаказНаАвтомобиль.ПометкаУдаления
	|	И ЗаказНаАвтомобиль.Ссылка.ХозОперация <> ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаАвтомобильОтмена)
	|	И ЗаказНаАвтомобиль.Дата МЕЖДУ &Дата1 И &Дата2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказНаАвтомобиль.ДокументОснование КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ОЗнА
	|ИЗ
	|	Документ.ЗаказНаАвтомобиль КАК ЗаказНаАвтомобиль
	|ГДЕ
	|	ЗаказНаАвтомобиль.Проведен
	|	И НЕ ЗаказНаАвтомобиль.ПометкаУдаления
	|	И ЗаказНаАвтомобиль.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаАвтомобильОтмена)
	|	И ЗаказНаАвтомобиль.ДокументОснование В
	|			(ВЫБРАТЬ
	|				ВТ_ЗнА.Ссылка
	|			ИЗ
	|				ВТ_ЗнА)
	|	И ЗаказНаАвтомобиль.ДокументОснование ССЫЛКА Документ.ЗаказНаАвтомобиль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОАБР.Ссылка.Дата КАК Дата,
	|	ВТ_ОАБР.Ссылка.Номер КАК Номер,
	|	СОКРЛП(ВТ_ОАБР.Ссылка.Контрагент.Наименование) КАК Контрагент,
	|	ВТ_ОАБР.Ссылка.Контрагент.ФормаСобственности КАК ФормаСобственности,
	|	ВТ_ОАБР.Ссылка.СкладКомпании КАК Склад,
	|	ВТ_ОАБР.Ссылка.Автомобиль КАК Автомобиль,
	|	-1 КАК Количество,
	|	ВТ_ОАБР.Ссылка.Сумма КАК Сумма,
	|	""ОАБР"" КАК ТипСтроки
	|ПОМЕСТИТЬ ВТ_Строки
	|ИЗ
	|	ВТ_ОАБР КАК ВТ_ОАБР
	|ГДЕ
	|	НЕ ВТ_ОАБР.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_ООАБР.Ссылка
	|				ИЗ
	|					ВТ_ООАБР)
	|	И ВТ_ОАБР.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтгрузкаАвтомобиляБезРеализации)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиАвтомобилейОбороты.Период,
	|	ОстаткиАвтомобилейОбороты.Регистратор.Номер,
	|	СОКРЛП(ОстаткиАвтомобилейОбороты.Регистратор.Контрагент.Наименование),
	|	ОстаткиАвтомобилейОбороты.Регистратор.Контрагент.ФормаСобственности,
	|	ОстаткиАвтомобилейОбороты.СкладКомпании,
	|	ОстаткиАвтомобилейОбороты.Автомобиль,
	|	ОстаткиАвтомобилейОбороты.КоличествоОборот,
	|	ОстаткиАвтомобилейОбороты.СуммаРасход,
	|	""Реализация""
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Обороты(&Дата1, &Дата2, Регистратор, ) КАК ОстаткиАвтомобилейОбороты
	|ГДЕ
	|	ОстаткиАвтомобилейОбороты.Регистратор ССЫЛКА Документ.РеализацияАвтомобилей
	|	И НЕ ОстаткиАвтомобилейОбороты.Регистратор.ДокументОснование ССЫЛКА Документ.ОтгрузкаАвтомобиляБезРеализации
	|	И ОстаткиАвтомобилейОбороты.Регистратор.ОтгрузкаАвтомобиляБезРеализации = ЗНАЧЕНИЕ(Документ.ОтгрузкаАвтомобиляБезРеализации.ПустаяСсылка)
	|	И НЕ ОстаткиАвтомобилейОбороты.Регистратор.Заказчик.НашаФирма
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(ВТ_ОО.День, ДЕНЬ),
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВТ_ОО.Склад,
	|	ВТ_ОО.Автомобиль,
	|	ВТ_ОО.Количество,
	|	ВТ_ОО.Сумма,
	|	""Склад""
	|ИЗ
	|	ВТ_ОО КАК ВТ_ОО
	|ГДЕ
	|	ВТ_ОО.Количество > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ЗнА.Ссылка.Дата,
	|	ВТ_ЗнА.Ссылка.Номер,
	|	ВТ_ЗнА.Ссылка.Контрагент,
	|	ВТ_ЗнА.Ссылка.Контрагент.ФормаСобственности,
	|	ВТ_ЗнА.Ссылка.ПодразделениеКомпании.Родитель,
	|	ВТ_ЗнА.Ссылка.Автомобиль,
	|	0,
	|	ВТ_ЗнА.Ссылка.ЦенаАвтомобиля,
	|	""Заказ""
	|ИЗ
	|	ВТ_ЗнА КАК ВТ_ЗнА
	|ГДЕ
	|	НЕ ВТ_ЗнА.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_ОЗнА.Ссылка
	|				ИЗ
	|					ВТ_ОЗнА)
	|	И ВТ_ЗнА.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаАвтомобиль)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РабочийЛист.АвтомобильТрейдИн КАК АвтомобильТрейдИн,
	|	МАКСИМУМ(РабочийЛист.Ссылка) КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ТИ
	|ИЗ
	|	Документ.РабочийЛист КАК РабочийЛист
	|ГДЕ
	|	НЕ РабочийЛист.ПометкаУдаления
	|	И РабочийЛист.Проведен
	|	И РабочийЛист.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Продажа)
	|	И РабочийЛист.АвтомобильТрейдИн <> ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка)
	|	И РабочийЛист.ПоступлениеАвтоТрэйдИн <> ЗНАЧЕНИЕ(Документ.ПоступлениеАвтомобилей.ПустаяСсылка)
	|	И РабочийЛист.АвтомобильТрейдИн В
	|			(ВЫБРАТЬ
	|				ВТ_Строки.Автомобиль
	|			ИЗ
	|				ВТ_Строки)
	|
	|СГРУППИРОВАТЬ ПО
	|	РабочийЛист.АвтомобильТрейдИн
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВсеПоступления.Поступление.Дата, ВсеПоступления.ОтветственноеХранение.Дата) КАК ДатаПоступления,
	|	ВсеПоступления.Автомобиль КАК Автомобиль,
	|	ЕСТЬNULL(ВсеПоступления.Поступление, ВсеПоступления.ОтветственноеХранение) КАК ДокументПоступления,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВсеПоступления.ОтветственноеХранение.ХозОперация, ВсеПоступления.Поступление.ХозОперация) = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеАвтомобилейКомиссия)
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОстаткиАвтомобилейОстаткиИОбороты.Регистратор = ОстаткиАвтомобилейОстаткиИОбороты.Партия
	|					ТОГДА ОстаткиАвтомобилейОстаткиИОбороты.Регистратор.СуммаОферты
	|				ИНАЧЕ ВсеПоступления.Поступление.СуммаОферты
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦенаОферты,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|					ИЛИ ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.GAC)
	|					ИЛИ ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|					ИЛИ ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль В (&Чанганы)
	|				ТОГДА РассчетныйИнвойсСрезПоследних.ИнвойсРассчетный
	|		КОНЕЦ, ВЫБОР
	|			КОГДА ВсеПоступления.ТестовыйЧАР
	|				ТОГДА ОстаткиАвтомобилейОстаткиИОбороты.СуммаКонечныйОстаток
	|			ИНАЧЕ ОстаткиАвтомобилейОстаткиИОбороты.СуммаКонечныйОстаток + ЕСТЬNULL(Корректировки.СуммаКорректировки, 0)
	|		КОНЕЦ) * ВЫБОР
	|		КОГДА ВсеПоступления.ВидАвто В (&ВидыАвто)
	|				И ЕСТЬNULL(ВсеПоступления.ОтветственноеХранение.Контрагент.ФормаСобственности, ВсеПоступления.Поступление.Контрагент.ФормаСобственности) = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЮридическоеЛицо)
	|				И ЕСТЬNULL(ВсеПоступления.ОтветственноеХранение.ХозОперация, ВсеПоступления.Поступление.ХозОперация) <> ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеАвтомобилейКомиссия)
	|				И ЕСТЬNULL(ВсеПоступления.Поступление.Дата, ВсеПоступления.ОтветственноеХранение.Дата) <= ДАТАВРЕМЯ(2026, 1, 1)
	|			ТОГДА 1.02
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ЦенаПоступления,
	|	ЕСТЬNULL(ВсеПоступления.Поступление.ХозОперация, ВсеПоступления.ОтветственноеХранение.ХозОперация) = ЗНАЧЕНИЕ(Справочник.ХозОперации.ВводОстатковАвтомобилейПереданныхНаКомиссию)
	|		ИЛИ ЕСТЬNULL(ВсеПоступления.Поступление.ХозОперация, ВсеПоступления.ОтветственноеХранение.ХозОперация) = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеАвтомобилейКомиссия) КАК Комиссия,
	|	ВсеПоступления.ВидАвто КАК ВидАвто
	|ПОМЕСТИТЬ ВТ_Поступление
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОстаткиАвтомобилейОбороты.Автомобиль КАК Автомобиль,
	|		АвтомобилиСрезПоследних.Значение КАК ВидАвто,
	|		ВЫБОР
	|			КОГДА (ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|					ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.GAC)
	|					ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|					ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|					ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET))
	|					И АвтомобилиСрезПоследних.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ТестовыйАвтомобиль)
	|				ТОГДА МИНИМУМ(ВЫБОР
	|							КОГДА ОстаткиАвтомобилейОбороты.СтатусПартии = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварОтветственноеХранение)
	|								ТОГДА ОстаткиАвтомобилейОбороты.Партия
	|						КОНЕЦ)
	|			ИНАЧЕ МАКСИМУМ(ВЫБОР
	|						КОГДА ОстаткиАвтомобилейОбороты.СтатусПартии = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварОтветственноеХранение)
	|							ТОГДА ОстаткиАвтомобилейОбороты.Партия
	|					КОНЕЦ)
	|		КОНЕЦ КАК ОтветственноеХранение,
	|		ВЫБОР
	|			КОГДА (ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|					ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.GAC)
	|					ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|					ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|					ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET))
	|					И АвтомобилиСрезПоследних.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ТестовыйАвтомобиль)
	|				ТОГДА МИНИМУМ(ВЫБОР
	|							КОГДА ОстаткиАвтомобилейОбороты.СтатусПартии <> ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварОтветственноеХранение)
	|									И ОстаткиАвтомобилейОбороты.Партия.ХозОперация <> ЗНАЧЕНИЕ(Справочник.ХозОперации.ПереходВСобственностьАвтомобилей)
	|								ТОГДА ОстаткиАвтомобилейОбороты.Партия
	|						КОНЕЦ)
	|			ИНАЧЕ МАКСИМУМ(ВЫБОР
	|						КОГДА ОстаткиАвтомобилейОбороты.СтатусПартии <> ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварОтветственноеХранение)
	|								И ОстаткиАвтомобилейОбороты.Партия.ХозОперация <> ЗНАЧЕНИЕ(Справочник.ХозОперации.ПереходВСобственностьАвтомобилей)
	|							ТОГДА ОстаткиАвтомобилейОбороты.Партия
	|					КОНЕЦ)
	|		КОНЕЦ КАК Поступление,
	|		(ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|			ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.GAC)
	|			ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|			ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|			ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET))
	|			И АвтомобилиСрезПоследних.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ТестовыйАвтомобиль) КАК ТестовыйЧАР
	|	ИЗ
	|		РегистрНакопления.ОстаткиАвтомобилей.Обороты(
	|				,
	|				КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
	|				Регистратор,
	|				НЕ Партия.ПометкаУдаления
	|					И Партия.Проведен
	|					И НЕ Партия.Контрагент.НашаФирма
	|					И Автомобиль В
	|						(ВЫБРАТЬ
	|							ВТ_Строки.Автомобиль
	|						ИЗ
	|							ВТ_Строки)
	|					И НЕ Партия.Контрагент В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.Контрагенты.НашиФирмы))) КАК ОстаткиАвтомобилейОбороты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних(
	|					КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
	|					ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)
	|						И ТИПЗНАЧЕНИЯ(ВидЗначения) = ТИП(Перечисление.ДополнительнаяИнформацияАвтомобилей)) КАК АвтомобилиСрезПоследних
	|			ПО ОстаткиАвтомобилейОбороты.Автомобиль = АвтомобилиСрезПоследних.Автомобиль
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ОстаткиАвтомобилейОбороты.Автомобиль,
	|		АвтомобилиСрезПоследних.Значение,
	|		ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка) КАК ВсеПоступления
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МИНИМУМ(ОстаткиАвтомобилейОбороты.Период) КАК Период,
	|			ОстаткиАвтомобилейОбороты.Автомобиль КАК Автомобиль,
	|			ОстаткиАвтомобилейОбороты.Регистратор.ДокументОснование КАК Поступление,
	|			СУММА(ОстаткиАвтомобилейОбороты.СуммаОборот) КАК СуммаКорректировки
	|		ИЗ
	|			РегистрНакопления.ОстаткиАвтомобилей.Обороты(
	|					,
	|					,
	|					Регистратор,
	|					НЕ Партия.ПометкаУдаления
	|						И Партия.Проведен) КАК ОстаткиАвтомобилейОбороты
	|		ГДЕ
	|			НЕ ОстаткиАвтомобилейОбороты.Регистратор.ПометкаУдаления
	|			И ОстаткиАвтомобилейОбороты.Регистратор.Проведен
	|			И ОстаткиАвтомобилейОбороты.Регистратор ССЫЛКА Документ.КорректировкаПоступленияАвтомобилей
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОстаткиАвтомобилейОбороты.Автомобиль,
	|			ОстаткиАвтомобилейОбороты.Регистратор.ДокументОснование) КАК Корректировки
	|		ПО ВсеПоступления.Автомобиль = Корректировки.Автомобиль
	|			И (ЕСТЬNULL(ВсеПоступления.Поступление.Дата, ВсеПоступления.ОтветственноеХранение.Дата) <= Корректировки.Период)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей.ОстаткиИОбороты(, КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ), Регистратор, , ) КАК ОстаткиАвтомобилейОстаткиИОбороты
	|		ПО ВсеПоступления.Автомобиль = ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль
	|			И (ЕСТЬNULL(ВсеПоступления.Поступление, ВсеПоступления.ОтветственноеХранение) = ОстаткиАвтомобилейОстаткиИОбороты.Регистратор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РассчетныйИнвойс.СрезПоследних КАК РассчетныйИнвойсСрезПоследних
	|		ПО ВсеПоступления.Автомобиль = РассчетныйИнвойсСрезПоследних.Автомобиль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Строки.Дата КАК Дата,
	|	ВТ_Строки.Номер КАК Номер,
	|	ВЫБОР
	|		КОГДА ВТ_Строки.ТипСтроки = ""Склад""
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(ВТ_Строки.Контрагент, СОКРЛП(РабочийЛист.Контрагент.Наименование))
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ВТ_Строки.ТипСтроки = ""Склад""
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(ВТ_Строки.ФормаСобственности, РабочийЛист.Контрагент.ФормаСобственности)
	|	КОНЕЦ КАК ФормаСобственности,
	|	ВТ_Строки.Склад КАК Склад,
	|	ВТ_Строки.Автомобиль КАК Автомобиль,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА РабочийЛист.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Отказ)
	|				ТОГДА NULL
	|			ИНАЧЕ РабочийЛист.Ссылка
	|		КОНЕЦ) КАК РЛ,
	|	ВТ_Строки.Количество КАК Количество,
	|	ВТ_Строки.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА ВТ_ТИ.АвтомобильТрейдИн ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТИ,
	|	ЕСТЬNULL(СОКРЛП(ВТ_ТИ.Ссылка.ФамилияПриемщика.Наименование), """") КАК МенеджерАСП,
	|	СОКРЛП(ВТ_ТИ.Ссылка.Автомобиль.VIN) КАК VIN_Матери,
	|	ВТ_Строки.ТипСтроки КАК ТипСтроки
	|ПОМЕСТИТЬ ВТ_Основа
	|ИЗ
	|	ВТ_Строки КАК ВТ_Строки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТИ КАК ВТ_ТИ
	|		ПО ВТ_Строки.Автомобиль = ВТ_ТИ.Ссылка.АвтомобильТрейдИн
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РабочийЛист КАК РабочийЛист
	|		ПО ВТ_Строки.Дата >= РабочийЛист.Дата
	|			И ВТ_Строки.Автомобиль = РабочийЛист.Автомобиль
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Строки.ТипСтроки,
	|	ВТ_Строки.Автомобиль,
	|	ВТ_Строки.Склад,
	|	ВТ_Строки.Дата,
	|	ВТ_Строки.Номер,
	|	ВТ_Строки.Количество,
	|	ВТ_Строки.Сумма,
	|	ВЫБОР
	|		КОГДА ВТ_Строки.ТипСтроки = ""Склад""
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(ВТ_Строки.Контрагент, СОКРЛП(РабочийЛист.Контрагент.Наименование))
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТ_Строки.ТипСтроки = ""Склад""
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(ВТ_Строки.ФормаСобственности, РабочийЛист.Контрагент.ФормаСобственности)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТ_ТИ.АвтомобильТрейдИн ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЕСТЬNULL(СОКРЛП(ВТ_ТИ.Ссылка.ФамилияПриемщика.Наименование), """"),
	|	СОКРЛП(ВТ_ТИ.Ссылка.Автомобиль.VIN)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основа.Дата КАК Дата,
	|	ЕСТЬNULL(КорректноеПодразделение.Подразделение.ДилерскийЦентр.Наименование, ЕСТЬNULL(ВТ_Основа.РЛ.ПодразделениеКомпании.ДилерскийЦентр.Наименование, ВЫБОР
	|				КОГДА ВТ_Основа.ТипСтроки = ""Заказ""
	|					ТОГДА ВТ_Основа.Склад.ДилерскийЦентр.Наименование
	|				ИНАЧЕ ВТ_Основа.Склад.Подразделение.ДилерскийЦентр.Наименование
	|			КОНЕЦ)) КАК ДилерскийЦентр,
	|	ЕСТЬNULL(КорректноеПодразделение.Подразделение.Наименование, ЕСТЬNULL(ВТ_Основа.РЛ.ПодразделениеКомпании.Наименование, ВЫБОР
	|				КОГДА ВТ_Основа.ТипСтроки = ""Заказ""
	|					ТОГДА ВТ_Основа.Склад.Наименование
	|				ИНАЧЕ ВТ_Основа.Склад.Подразделение.Родитель.Наименование
	|			КОНЕЦ)) КАК Подразделение,
	|	ЕСТЬNULL(ВТ_Основа.РЛ.СкладВладельцаАвто.Наименование, ВЫБОР
	|			КОГДА ВТ_Основа.ТипСтроки = ""Заказ""
	|				ТОГДА """"
	|			ИНАЧЕ ВТ_Основа.Склад.Наименование
	|		КОНЕЦ) КАК Склад,
	|	ВТ_Основа.Автомобиль.Наименование КАК Автомобиль,
	|	ХарактеристикиАвто.ВидАвто.Порядок КАК ВидАвтомобиля,
	|	СТРОКА(ВТ_Основа.Автомобиль.VIN) КАК VIN,
	|	ВТ_Основа.Автомобиль.Модель.Марка.Наименование КАК Бренд,
	|	ВТ_Основа.Автомобиль.Модель.Наименование КАК Модель,
	|	ВТ_Основа.Автомобиль.ВариантКомплектации.Наименование КАК ВариантКомплектации,
	|	ГОД(ВТ_Основа.Автомобиль.ГодВыпуска) КАК ГодВыпуска,
	|	ВТ_Основа.РЛ.ВладелецАвто.Наименование КАК СобственникАвтомобиля,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) + ЕСТЬNULL(КоммерческоеДО.Сумма, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) + ЕСТЬNULL(КоммерческоеДО.Сумма, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0)
	|								ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) + ЕСТЬNULL(КоммерческоеДО.Сумма, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка) / Налогооблажение.НалоговаяСтавка + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0)
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) + ЕСТЬNULL(КоммерческоеДО.Сумма, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) + ЕСТЬNULL(КоммерческоеДО.Сумма, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0)
	|							ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) + ЕСТЬNULL(КоммерческоеДО.Сумма, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0)) / Налогооблажение.НалоговаяСтавка + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) + ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|								ТОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
	|						КОНЕЦ
	|				ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0)) / Налогооблажение.НалоговаяСтавка + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) + ВЫБОР
	|						КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|							ТОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
	|						ИНАЧЕ ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Отчитан,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) + ЕСТЬNULL(КоммерческоеДО.Сумма, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) + ЕСТЬNULL(КоммерческоеДО.Сумма, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0)
	|								ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) + ЕСТЬNULL(КоммерческоеДО.Сумма, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка) / Налогооблажение.НалоговаяСтавка + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0)
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) + ЕСТЬNULL(КоммерческоеДО.Сумма, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) + ЕСТЬNULL(КоммерческоеДО.Сумма, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0)
	|							ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) + ЕСТЬNULL(КоммерческоеДО.Сумма, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0)) / Налогооблажение.НалоговаяСтавка + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) + ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|								ТОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
	|						КОНЕЦ
	|				ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0)) / Налогооблажение.НалоговаяСтавка + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) + ВЫБОР
	|						КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|							ТОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
	|						ИНАЧЕ ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ + ЕСТЬNULL(ВТ_Основа.РЛ.КВКредит + СтраховыеПрограммы.КВКАСКО + СтраховыеПрограммы.КВОСАГО + СтраховыеПрограммы.КВGAP + СтраховыеПрограммы.КВМедиКАСКО + СтраховыеПрограммы.КВРАТ + СтраховыеПрограммы.КВНезависимаяГарантия + СтраховыеПрограммы.КВБезотзывнаяНезависимаяГарантия + СтраховыеПрограммы.КВМедицинскоеСтрахование + СтраховыеПрограммы.КВСтрахованиеЖизни + СтраховыеПрограммы.КВСтрахованиеИмущества + СтраховыеПрограммы.КВПрочее, ВТ_Основа.РЛ.КВКредит + ВТ_Основа.РЛ.КВКаско + ВТ_Основа.РЛ.КВОсаго + ВТ_Основа.РЛ.КВСЖ + ЕСТЬNULL(РЛ_ИСП.КВ, 0)) / Налогооблажение.НалоговаяСтавка КАК БлокировкаПродажи,
	|	ВТ_Основа.РЛ.Номер КАК РабочийЛист,
	|	ВТ_Основа.Номер КАК Реализация,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаКАСКО.Наименование, """") КАК Количество_Остаток_Оборот,
	|	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(СтраховыеПрограммы.ВидКАСКО), """") КАК Сумма_Остаток_Оборот,
	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаРитейла, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРитейла,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияКАСКО.Наименование, """") КАК ДатаРитейла2,
	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.СкидаПриПокупкеВТрейдИн, 0) КАК СкидкаПриПокупкеВТрейдИн,
	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.СкидкаПриПокупкеВКредит, 0) КАК СкидкаПриПокупкеВКредит,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаКАСКО, 0) КАК НомерДатаПерезачета,
	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.Оплачен, """") КАК Оплачен,
	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОплаты,
	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.РазмерСкидки, 0) КАК РазмерСкидки,
	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.ОжидаемаяДатаПолученияКомпенсации, ДАТАВРЕМЯ(1, 1, 1)) КАК ОжидаемаяДатаПолученияКомпенсации,
	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.РазмерКомпенсации, 0) КАК РазмерКомпенсации,
	|	ЕСТЬNULL(ВТ_Основа.РЛ.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.НаличныйРасчет), """") КАК НаличныйРасчет,
	|	ЕСТЬNULL(ВТ_Основа.РЛ.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.БанковскаяКарта)
	|			ИЛИ ВТ_Основа.РЛ.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.БезналичныйРасчет), """") КАК БезналичныйРасчет,
	|	ЕСТЬNULL(ВТ_Основа.РЛ.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.Кредит), """") КАК Кредит,
	|	ЕСТЬNULL(ВТ_Основа.РЛ.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.Обмен), """") КАК Обмен,
	|	ЕСТЬNULL(ВТ_Основа.РЛ.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.Лизинг), """") КАК Лизинг,
	|	ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаЗаАМ, 0) КАК ПредоплатаЗаАМ,
	|	ЕСТЬNULL(ВТ_Основа.РЛ.ДатаПредоплатыЗаАМ, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПредоплатыЗаАМ,
	|	ЕСТЬNULL(ВТ_Основа.Контрагент, ЕСТЬNULL(ВТ_Основа.РЛ.Контрагент, ЗаказыАвто.Заказ.Контрагент)) КАК Покупатель,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0)
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) / Налогооблажение.НалоговаяСтавка
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК РРЦ,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0)
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) / Налогооблажение.НалоговаяСтавка
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|					ТОГДА 0
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0)
	|			КОНЕЦ
	|	КОНЕЦ КАК Инвойс,
	|	ВЫБОР
	|		КОГДА ВТ_Поступление.ЦенаОферты = 0
	|			ТОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0)
	|		ИНАЧЕ ВТ_Поступление.ЦенаОферты
	|	КОНЕЦ КАК СкидкаТрейдИнПлан,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0)
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) / Налогооблажение.НалоговаяСтавка
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК СкидкаТрейдИнФакт,
	|	ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2, 0) КАК СкидкаТрейдИн2План,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0)
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) / Налогооблажение.НалоговаяСтавка
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК СкидкаТрейдИн2Факт,
	|	ВТ_Основа.РЛ.СкидкаСубсидияКредит КАК СкидкаСубсидияКредитПлан,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0)
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) / Налогооблажение.НалоговаяСтавка
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК СкидкаСубсидияКредитФакт,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0)
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) / Налогооблажение.НалоговаяСтавка
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК СкидкаПоПрограммамЛояльности,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0)
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) / Налогооблажение.НалоговаяСтавка
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК СкидкаПоСпецПрограмме,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0)
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) / Налогооблажение.НалоговаяСтавка
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК СкидкаРозничная,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА 0
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) * (1 - Налогооблажение.НалоговаяСтавка) / Налогооблажение.НалоговаяСтавка
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА 0
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) * (1 - Налогооблажение.НалоговаяСтавка) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА 0
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) * (1 - Налогооблажение.НалоговаяСтавка) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК СкидкаДополнительная,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВКАСКО, 0) КАК СтоимостьДопОборудования_Маркетинг,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаОСАГО, """") КАК СтоимостьДопОборудования,
	|	ВТ_Основа.РЛ.СтоимостьДО КАК ПлановаяСтоимостьДО,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0)
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) / Налогооблажение.НалоговаяСтавка
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК СебестоимостьДО,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидОСАГО, """") КАК СебестоимостьДО_Комплектации,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияОСАГО, """") КАК СуммаДО,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0)
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) / Налогооблажение.НалоговаяСтавка
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦенаДопПоПрайсу,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0)
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) / Налогооблажение.НалоговаяСтавка
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК ПредоплатаТО,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаОСАГО, 0) КАК КомпенсацияТрейдИНРетроспективная,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВОСАГО, 0) КАК КомпенсацияСубсидияКредитРетроспективная,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаGAP, """") КАК КомпенсацияПоПрограммамЛояльностиРетроспективная,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидGAP, """") КАК КомпенсацияРозничнаяРетроспективная,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияGAP, """") КАК КомпенсацияТрейдИН2Ретроспективная,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0)) * Налогооблажение.НалоговаяСтавка
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0)
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0)
	|							ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0)) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0)
	|				ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0)) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК КомпенсацияРетроспективная,
	|	ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля КАК КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля,
	|	ВТ_Основа.РЛ.СуммаКомпенсации КАК СуммаКомпенсации,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)
	|							ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)
	|				ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК КомпенсацияВИнвойсе,
	|	ВТ_Основа.РЛ.КомпенсацияБрокерФинанс КАК КомпенсацияБрокерФинанс,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0)
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) / Налогооблажение.НалоговаяСтавка
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаКаско,
	|	ЕСТЬNULL(ВТ_Основа.РЛ.КВКредит + СтраховыеПрограммы.КВКАСКО + СтраховыеПрограммы.КВОСАГО + СтраховыеПрограммы.КВGAP + СтраховыеПрограммы.КВМедиКАСКО + СтраховыеПрограммы.КВРАТ + СтраховыеПрограммы.КВНезависимаяГарантия + СтраховыеПрограммы.КВБезотзывнаяНезависимаяГарантия + СтраховыеПрограммы.КВМедицинскоеСтрахование + СтраховыеПрограммы.КВСтрахованиеЖизни + СтраховыеПрограммы.КВСтрахованиеИмущества + СтраховыеПрограммы.КВПрочее, ВТ_Основа.РЛ.КВКредит + ВТ_Основа.РЛ.КВКаско + ВТ_Основа.РЛ.КВОсаго + ВТ_Основа.РЛ.КВСЖ + ЕСТЬNULL(РЛ_ИСП.КВ, 0)) / Налогооблажение.НалоговаяСтавка КАК ВариантКаско,
	|	ВТ_Основа.ТипСтроки КАК СуммаОсаго,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) * Налогооблажение.НалоговаяСтавка
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0)
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК ВариантОсаго,
	|	ВТ_Основа.РЛ КАК СуммаСтрахованиеЖизни,
	|	ВТ_Основа.РЛ.КВКредит КАК ВариантСтрахованиеЖизни,
	|	ВТ_Основа.РЛ.СуммаПродажи КАК ЦенаФакт,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|					ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|				ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|			КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ВЫБОР
	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|								ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|								ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|							ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВЫБОР
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|								ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|							КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|							ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|								ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦенаДоговора,
	|	ВТ_Основа.РЛ.СуммаПредоплаты КАК ПервоначальныйВзнос,
	|	ВТ_Основа.РЛ.ДатаПервоначальногоВзноса КАК ДатаПервоначальногоВзноса,
	|	ВТ_Основа.РЛ.БанкЛК КАК БанкЛК,
	|	ВЫБОР
	|		КОГДА ВТ_Основа.РЛ.Кредит
	|				ИЛИ ВТ_Основа.РЛ.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.Кредит)
	|			ТОГДА ВТ_Основа.РЛ.СчетИлиАвтоВКредит
	|	КОНЕЦ КАК КредитнаяСтоимость,
	|	ВТ_Основа.РЛ.ПрогнозСрокаПодготовкиАвтоВДнях КАК ПрогнозСрокаПодготовкиАвтоВДнях,
	|	ВТ_Основа.РЛ.ПрогнозСуммыРемонта КАК ПрогнозСуммыРемонта,
	|	ВТ_Основа.РЛ.ПрогнозСуммыДетейлинга КАК ПрогнозСуммыДетейлинга,
	|	ВТ_Основа.РЛ.ПрогнозируемаяЦенаПродажи КАК ПрогнозируемаяЦенаПродажи,
	|	ВТ_Основа.РЛ.ПрогнозСрокаПродажиАвтоВДнях КАК ПрогнозСрокаПродажиАвтоВДнях,
	|	ВТ_Основа.РЛ.ПрогнозСуммыМКЦ КАК ПрогнозСуммыМКЦ,
	|	ВТ_Основа.РЛ.ЦенаМинРыночнаяТрейдИн КАК ЦенаМинРыночнаяТрейдИн,
	|	ВТ_Основа.РЛ.ПланируемаяЦенаПродажиТрейдИн КАК ПланируемаяЦенаПродажиТрейдИн,
	|	ВТ_Основа.РЛ.ЦенаДКПТрейдИн КАК ЦенаДКПТрейдИн,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаGAP, 0) КАК ДатаРитейла_РЛ,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВGAP, 0) КАК СуммаИСП,
	|	ДолгОП.КоличествоДолгаОП КАК КоличествоДолгаОП,
	|	ЕСТЬNULL(ЗаказыАвто.Резерв, 0) КАК Резерв,
	|	ВТ_Поступление.ДатаПоступления КАК ДатаПоступленияВГК,
	|	ВЫБОР
	|		КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|				ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|				ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|				ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|				ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|			ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|		ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|	КОНЕЦ КАК ДатаФинансирования,
	|	ЕСТЬNULL(Хранение.ДатаПриемкиНаТекушийСклад, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПриемкиНаТекушийСклад,
	|	РАЗНОСТЬДАТ(ВТ_Поступление.ДатаПоступления, &Дата2, ДЕНЬ) КАК СрокХранения,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|					И РАЗНОСТЬДАТ(&Дата2, ВТ_Основа.Дата, ДЕНЬ) < 90
	|			ТОГДА ""Да""
	|		ИНАЧЕ ""Нет""
	|	КОНЕЦ КАК ГарантияПИ,
	|	0 КАК БонусЗаМодель,
	|	0 КАК ЦелеваяДоходность,
	|	0 КАК БонусЗаШтуку,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|				ТОГДА ВТ_Поступление.ЦенаПоступления
	|			ИНАЧЕ ВТ_Поступление.ЦенаОферты
	|		КОНЕЦ, 0) * 0.00067 КАК СтоимостьСуточногоХранения,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ВЫБОР
	|						КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|							ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|						ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|					КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|							ТОГДА ВЫБОР
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|								КОНЕЦ
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|									КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ < &Дата2
	|			ТОГДА ЕСТЬNULL(ВЫБОР
	|						КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|							ТОГДА ВТ_Поступление.ЦенаПоступления
	|						ИНАЧЕ ВТ_Поступление.ЦенаОферты
	|					КОНЕЦ, 0) * 0.00067 * РАЗНОСТЬДАТ(ВЫБОР
	|						КОГДА ВЫБОР
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|									ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|								ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|							КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|							ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|									ТОГДА ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										КОНЕЦ
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ВЫБОР
	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|												ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|										ИНАЧЕ ВЫБОР
	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|												ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОНЕЦ
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ, &Дата2, ДЕНЬ)
	|		ИНАЧЕ 0
	|	КОНЕЦ + ЕСТЬNULL(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|				ТОГДА ВТ_Поступление.ЦенаПоступления
	|			ИНАЧЕ ВТ_Поступление.ЦенаОферты
	|		КОНЕЦ, 0) * 0.00067 * РАЗНОСТЬДАТ(ВЫБОР
	|			КОГДА ВЫБОР
	|					КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|						ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|					ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|				КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ВЫБОР
	|								КОГДА ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|									КОНЕЦ >= &Дата2
	|									ТОГДА &Дата2
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|									КОНЕЦ
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ВЫБОР
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|								КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|								ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ, ВЫБОР
	|			КОГДА ВЫБОР
	|					КОГДА ВЫБОР
	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|								ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|							ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|						КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|								ТОГДА ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|									КОНЕЦ
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|									ИНАЧЕ ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ > &Дата2
	|				ТОГДА &Дата2
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВЫБОР
	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|								ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|							ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|						КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|								ТОГДА ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|									КОНЕЦ
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|									ИНАЧЕ ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ, ДЕНЬ) КАК ОбщаяСтоимостьХранения,
	|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(ВТ_Основа.ФормаСобственности, ЕСТЬNULL(ВТ_Основа.РЛ.Контрагент.ФормаСобственности, ЗаказыАвто.Заказ.Контрагент.ФормаСобственности))) КАК Tech_1,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|					ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|				ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|			КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ВЫБОР
	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|								ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|								ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|							ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВЫБОР
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|								ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|							КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|							ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|								ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Tech_2,
	|	ЕСТЬNULL(ВТ_Поступление.Комиссия, ЛОЖЬ) КАК Tech_3,
	|	ВТ_Основа.ТИ КАК Tech_4,
	|	НЕ(ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|			ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|			ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ИЛИ (ЕСТЬNULL(ВТ_Поступление.Комиссия, ЛОЖЬ)
	|				ИЛИ ВТ_Основа.ТИ)) КАК Tech_5,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаМедиКАСКО, """") КАК Tech_6,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидМедиКАСКО, """") КАК Tech_7,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияМедиКАСКО, """") КАК Tech_8,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаМедиКАСКО, 0) КАК Tech_9,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВМедиКАСКО, 0) КАК Tech_10,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаРАТ, """") КАК Tech_11,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидРАТ, """") КАК Tech_12,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияРАТ, """") КАК Tech_13,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаРАТ, 0) КАК Tech_14,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВРАТ, 0) КАК Tech_15,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаНезависимаяГарантия, """") КАК Tech_16,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидНезависимаяГарантия, """") КАК Tech_17,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияНезависимаяГарантия, """") КАК Tech_18,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаНезависимаяГарантия, 0) КАК Tech_19,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВНезависимаяГарантия, 0) КАК Tech_20,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаБезотзывнаяНезависимаяГарантия, """") КАК Tech_21,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидБезотзывнаяНезависимаяГарантия, """") КАК Tech_22,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияБезотзывнаяНезависимаяГарантия, """") КАК Tech_23,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаБезотзывнаяНезависимаяГарантия, 0) КАК Tech_24,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВБезотзывнаяНезависимаяГарантия, 0) КАК Tech_25,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаМедицинскоеСтрахование, """") КАК Tech_26,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидМедицинскоеСтрахование, """") КАК Tech_27,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияМедицинскоеСтрахование, """") КАК Tech_28,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаМедицинскоеСтрахование, 0) КАК Tech_29,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВМедицинскоеСтрахование, 0) КАК Tech_30,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаСтрахованиеЖизни, """") КАК Tech_31,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидСтрахованиеЖизни, """") КАК Tech_32,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияСтрахованиеЖизни, """") КАК Tech_33,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаСтрахованиеЖизни, 0) КАК Tech_34,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВСтрахованиеЖизни, 0) КАК Tech_35,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаСтрахованиеИмущества, """") КАК Tech_36,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидСтрахованиеИмущества, """") КАК Tech_37,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияСтрахованиеИмущества, """") КАК Tech_38,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаСтрахованиеИмущества, 0) КАК Tech_39,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВСтрахованиеИмущества, 0) КАК Tech_40,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаПрочее, """") КАК Tech_41,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидПрочее, """") КАК Tech_42,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияПрочее, """") КАК Tech_43,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаПрочее, 0) КАК Tech_44,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВПрочее, 0) КАК Tech_45,
	|	ВТ_Основа.VIN_Матери КАК Tech_46,
	|	ВТ_Основа.РЛ.СуммаПродажи + ВТ_Основа.РЛ.СкидкаДополнительная КАК Tech_47,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|				ТОГДА ВТ_Поступление.ЦенаПоступления
	|			ИНАЧЕ ВТ_Поступление.ЦенаОферты
	|		КОНЕЦ, 0) * 0.00067 * РАЗНОСТЬДАТ(ВЫБОР
	|			КОГДА ВЫБОР
	|					КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|						ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|					ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|				КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ВЫБОР
	|								КОГДА ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|									КОНЕЦ >= &Дата2
	|									ТОГДА &Дата2
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|									КОНЕЦ
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ВЫБОР
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|								КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|								ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ, ВЫБОР
	|			КОГДА ВЫБОР
	|					КОГДА ВЫБОР
	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|								ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|							ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|						КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|								ТОГДА ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|									КОНЕЦ
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|									ИНАЧЕ ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ > &Дата2
	|				ТОГДА &Дата2
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВЫБОР
	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|								ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|							ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|						КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|								ТОГДА ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|									КОНЕЦ
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|									ИНАЧЕ ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ, ДЕНЬ) КАК Tech_48,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ВЫБОР
	|						КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|							ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|						ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|					КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|							ТОГДА ВЫБОР
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|								КОНЕЦ
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|									КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ < &Дата2
	|			ТОГДА ЕСТЬNULL(ВЫБОР
	|						КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|							ТОГДА ВТ_Поступление.ЦенаПоступления
	|						ИНАЧЕ ВТ_Поступление.ЦенаОферты
	|					КОНЕЦ, 0) * 0.00067 * РАЗНОСТЬДАТ(ВЫБОР
	|						КОГДА ВЫБОР
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|									ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|								ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|							КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|							ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|									ТОГДА ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										КОНЕЦ
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ВЫБОР
	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|												ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|										ИНАЧЕ ВЫБОР
	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|												ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОНЕЦ
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ, &Дата2, ДЕНЬ)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Tech_49,
	|	ВТ_Основа.МенеджерАСП КАК Tech_50
	|ИЗ
	|	ВТ_Основа КАК ВТ_Основа
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.Значение КАК ВидАвто,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних(
	|					&Дата2,
	|					ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)
	|						И ТИПЗНАЧЕНИЯ(ВидЗначения) = ТИП(Перечисление.ДополнительнаяИнформацияАвтомобилей)) КАК АвтомобилиСрезПоследних) КАК ХарактеристикиАвто
	|		ПО ВТ_Основа.Автомобиль = ХарактеристикиАвто.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗаказыАвтомобилейОстатки.Автомобиль КАК Автомобиль,
	|			ЗаказыАвтомобилейОстатки.Заказ КАК Заказ,
	|			ЗаказыАвтомобилейОстатки.РезервОстаток КАК Резерв,
	|			Взаиморасчеты.СуммаОстаток КАК СуммаОстаток
	|		ИЗ
	|			РегистрНакопления.ЗаказыАвтомобилей.Остатки(
	|					&Дата2,
	|					НЕ Заказ.ПометкаУдаления
	|						И Заказ.Проведен
	|						И НЕ Заказ.Контрагент.НашаФирма
	|						И Заказ.ХозОперация <> ЗНАЧЕНИЕ(Справочник.Хозоперации.ЗаказНаАвтомобильОтмена)) КАК ЗаказыАвтомобилейОстатки
	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					СУММА(ВзаиморасчетыКомпанииОстатки.СуммаОстаток) КАК СуммаОстаток,
	|					ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|					ВзаиморасчетыКомпанииОстатки.Сделка КАК Сделка
	|				ИЗ
	|					РегистрНакопления.ВзаиморасчетыКомпании.Остатки КАК ВзаиморасчетыКомпанииОстатки
	|				
	|				СГРУППИРОВАТЬ ПО
	|					ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов,
	|					ВзаиморасчетыКомпанииОстатки.Сделка) КАК Взаиморасчеты
	|				ПО ЗаказыАвтомобилейОстатки.Заказ = Взаиморасчеты.Сделка) КАК ЗаказыАвто
	|		ПО ВТ_Основа.Автомобиль = ЗаказыАвто.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОстаткиАвтомобилейОбороты.Автомобиль КАК Автомобиль,
	|			МАКСИМУМ(ОстаткиАвтомобилейОбороты.Регистратор.Дата) КАК ДатаПриемкиНаТекушийСклад
	|		ИЗ
	|			РегистрНакопления.ОстаткиАвтомобилей.Обороты(, КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ), Регистратор, ) КАК ОстаткиАвтомобилейОбороты
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОстаткиАвтомобилейОбороты.Автомобиль) КАК Хранение
	|		ПО ВТ_Основа.Автомобиль = Хранение.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РабочийЛистДолгОтделаПродаж.Ссылка КАК Ссылка,
	|			СУММА(РабочийЛистДолгОтделаПродаж.Количество) КАК КоличествоДолгаОП
	|		ИЗ
	|			Документ.РабочийЛист.ДолгОтделаПродаж КАК РабочийЛистДолгОтделаПродаж
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РабочийЛистДолгОтделаПродаж.Ссылка) КАК ДолгОП
	|		ПО ВТ_Основа.РЛ.Ссылка = ДолгОП.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЦеныАвтомобилейСрезПоследних.Автомобиль КАК Автомобиль,
	|			ЦеныАвтомобилейСрезПоследних.Цена КАК Цена
	|		ИЗ
	|			РегистрСведений.ЦеныАвтомобилей.СрезПоследних(КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ), ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)) КАК ЦеныАвтомобилейСрезПоследних) КАК ЦеныАвто
	|		ПО ВТ_Основа.Автомобиль = ЦеныАвто.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			База.Автомобиль КАК Автомобиль,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 0
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ПрограммаКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 0
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ВидКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 0
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК КомпанияКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 0
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 0
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 1
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ПрограммаОСАГО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 1
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ВидОСАГО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 1
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК КомпанияОСАГО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 1
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаОСАГО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 1
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВОСАГО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 2
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ПрограммаGAP,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 2
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ВидGAP,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 2
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК КомпанияGAP,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 2
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаGAP,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 2
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВGAP,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 3
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ПрограммаМедиКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 3
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ВидМедиКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 3
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК КомпанияМедиКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 3
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаМедиКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 3
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВМедиКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 4
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ПрограммаРАТ,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 4
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ВидРАТ,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 4
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК КомпанияРАТ,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 4
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаРАТ,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 4
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВРАТ,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 5
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ПрограммаНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 5
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ВидНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 5
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК КомпанияНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 5
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 5
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 6
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ПрограммаБезотзывнаяНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 6
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ВидБезотзывнаяНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 6
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК КомпанияБезотзывнаяНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 6
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаБезотзывнаяНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 6
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВБезотзывнаяНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 7
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ПрограммаМедицинскоеСтрахование,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 7
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ВидМедицинскоеСтрахование,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 7
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК КомпанияМедицинскоеСтрахование,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 7
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаМедицинскоеСтрахование,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 7
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВМедицинскоеСтрахование,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 8
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ПрограммаСтрахованиеЖизни,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 8
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ВидСтрахованиеЖизни,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 8
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК КомпанияСтрахованиеЖизни,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 8
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаСтрахованиеЖизни,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 8
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВСтрахованиеЖизни,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 9
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ПрограммаСтрахованиеИмущества,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 9
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ВидСтрахованиеИмущества,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 9
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК КомпанияСтрахованиеИмущества,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 9
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаСтрахованиеИмущества,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 9
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВСтрахованиеИмущества,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 10
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ПрограммаПрочее,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 10
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ВидПрочее,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 10
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК КомпанияПрочее,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 10
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаПрочее,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 10
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВПрочее
	|		ИЗ
	|			(ВЫБРАТЬ
	|				РабочийЛистКредитногоОтделаСтраховыеПродукты.Ссылка.ДокументОснование.Автомобиль КАК Автомобиль,
	|				РабочийЛистКредитногоОтделаСтраховыеПродукты.ПрограммаСтрахования.ВидСтрахования.Порядок КАК НомерСтроки,
	|				РабочийЛистКредитногоОтделаСтраховыеПродукты.ПрограммаСтрахования КАК ПрограммаСтрахования,
	|				РабочийЛистКредитногоОтделаСтраховыеПродукты.ПрограммаСтрахования.ВидСтрахования КАК ВидСтрахования,
	|				РабочийЛистКредитногоОтделаСтраховыеПродукты.СтраховаяКомпания КАК СтраховаяКомпания,
	|				РабочийЛистКредитногоОтделаСтраховыеПродукты.СуммаСтрахования КАК СуммаСтрахования,
	|				РабочийЛистКредитногоОтделаСтраховыеПродукты.КВ КАК КВСуммыСтрахования
	|			ИЗ
	|				Документ.РабочийЛистКредитногоОтдела.СтраховыеПродукты КАК РабочийЛистКредитногоОтделаСтраховыеПродукты) КАК База
	|		
	|		СГРУППИРОВАТЬ ПО
	|			База.Автомобиль) КАК СтраховыеПрограммы
	|		ПО ВТ_Основа.Автомобиль = СтраховыеПрограммы.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Поступление КАК ВТ_Поступление
	|		ПО ВТ_Основа.Автомобиль = ВТ_Поступление.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПериодыФакторингаАМСрезПоследних.Марка КАК Марка,
	|			ПериодыФакторингаАМСрезПоследних.БеспроцентныйПериодДней КАК БеспроцентныйПериодДней,
	|			ПериодыФакторингаАМСрезПоследних.ОбщийПериодДней КАК ОбщийПериодДней
	|		ИЗ
	|			РегистрСведений.ПериодыФакторингаАМ.СрезПоследних(КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ), ) КАК ПериодыФакторингаАМСрезПоследних
	|		ГДЕ
	|			ПериодыФакторингаАМСрезПоследних.Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
	|			И ПериодыФакторингаАМСрезПоследних.Фактор = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			И ПериодыФакторингаАМСрезПоследних.Автомобиль = ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка)) КАК ПериодыФакторингаМарка
	|		ПО ВТ_Основа.Автомобиль.Модель.Марка = ПериодыФакторингаМарка.Марка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПериодыФакторингаАМСрезПоследних.Модель КАК Модель,
	|			ПериодыФакторингаАМСрезПоследних.БеспроцентныйПериодДней КАК БеспроцентныйПериодДней,
	|			ПериодыФакторингаАМСрезПоследних.ОбщийПериодДней КАК ОбщийПериодДней
	|		ИЗ
	|			РегистрСведений.ПериодыФакторингаАМ.СрезПоследних(КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ), ) КАК ПериодыФакторингаАМСрезПоследних
	|		ГДЕ
	|			ПериодыФакторингаАМСрезПоследних.Модель <> ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
	|			И ПериодыФакторингаАМСрезПоследних.Фактор = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			И ПериодыФакторингаАМСрезПоследних.Автомобиль = ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка)) КАК ПериодыФакторингаМодель
	|		ПО ВТ_Основа.Автомобиль.Модель = ПериодыФакторингаМодель.Модель
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РабочийЛистИныеСтраховыеПродукты.Ссылка.Ссылка КАК Ссылка,
	|			СУММА(РабочийЛистИныеСтраховыеПродукты.КВ) КАК КВ
	|		ИЗ
	|			Документ.РабочийЛист.ИныеСтраховыеПродукты КАК РабочийЛистИныеСтраховыеПродукты
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РабочийЛистИныеСтраховыеПродукты.Ссылка.Ссылка) КАК РЛ_ИСП
	|		ПО ВТ_Основа.РЛ = РЛ_ИСП.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			УпрощеннаяСистемаНалогообложенияСрезПоследних.Организация КАК Организация,
	|			1 + УпрощеннаяСистемаНалогообложенияСрезПоследних.СтавкаНДС.Ставка / 100 КАК НалоговаяСтавка
	|		ИЗ
	|			РегистрСведений.УпрощеннаяСистемаНалогообложения.СрезПоследних КАК УпрощеннаяСистемаНалогообложенияСрезПоследних) КАК Налогооблажение
	|		ПО ВТ_Основа.РЛ.Организация = Налогооблажение.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(ВариантыКомпенсацийПоМаркамСрезПоследних.Период) КАК Период,
	|			ВариантыКомпенсацийПоМаркамСрезПоследних.Марка КАК Марка,
	|			ВариантыКомпенсацийПоМаркамСрезПоследних.КомпенсацияБезНДС КАК КомпенсацияБезНДС
	|		ИЗ
	|			РегистрСведений.ВариантыКомпенсацийПоМаркам.СрезПоследних(&Дата2, МаркетинговаяПрограмма = ЗНАЧЕНИЕ(Справочник.МаркетинговыеПрограммы.ПустаяСсылка)) КАК ВариантыКомпенсацийПоМаркамСрезПоследних
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВариантыКомпенсацийПоМаркамСрезПоследних.Марка,
	|			ВариантыКомпенсацийПоМаркамСрезПоследних.КомпенсацияБезНДС) КАК ВариантыКомпенсацийПоМаркам
	|		ПО ВТ_Основа.Автомобиль.Модель.Марка = ВариантыКомпенсацийПоМаркам.Марка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗаказНаряд.Дата КАК Дата,
	|			ЗаказНаряд.Автомобиль КАК Автомобиль,
	|			СУММА(ЗаказНаряд.СуммаДокумента) КАК Сумма
	|		ИЗ
	|			Документ.ЗаказНаряд КАК ЗаказНаряд
	|		ГДЕ
	|			ЗаказНаряд.Проведен
	|			И НЕ ЗаказНаряд.ПометкаУдаления
	|			И ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
	|			И ЗаказНаряд.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.КоммерческоеДопОборудование)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаказНаряд.Автомобиль,
	|			ЗаказНаряд.Дата
	|		
	|		ИМЕЮЩИЕ
	|			НЕ СУММА(ЗаказНаряд.СуммаДокумента) ЕСТЬ NULL) КАК КоммерческоеДО
	|		ПО ВТ_Основа.Автомобиль = КоммерческоеДО.Автомобиль
	|			И (ВЫБОР
	|				КОГДА ДЕНЬ(ВТ_Основа.Дата) <= 14
	|					ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ВТ_Основа.Дата, МЕСЯЦ), ДЕНЬ, 14), ДЕНЬ)
	|				ИНАЧЕ КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ВТ_Основа.Дата, МЕСЯЦ), МЕСЯЦ, 1), ДЕНЬ, 14), ДЕНЬ)
	|			КОНЕЦ >= КоммерческоеДО.Дата)
	|			И (ВТ_Поступление.Автомобиль = КоммерческоеДО.Автомобиль)
	|			И (ВТ_Поступление.ДатаПоступления <= КоммерческоеДО.Дата)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПериодыФакторингаАМСрезПоследних.Автомобиль КАК Автомобиль,
	|			ПериодыФакторингаАМСрезПоследних.БеспроцентныйПериодДней КАК БеспроцентныйПериодДней,
	|			ПериодыФакторингаАМСрезПоследних.ОбщийПериодДней КАК ОбщийПериодДней
	|		ИЗ
	|			РегистрСведений.ПериодыФакторингаАМ.СрезПоследних(КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ), ) КАК ПериодыФакторингаАМСрезПоследних
	|		ГДЕ
	|			ПериодыФакторингаАМСрезПоследних.Автомобиль <> ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка)
	|			И ПериодыФакторингаАМСрезПоследних.Фактор = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК ПериодыФакторингаАвтомобиль
	|		ПО ВТ_Основа.Автомобиль = ПериодыФакторингаАвтомобиль.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПериодыФакторингаАМСрезПоследних.Марка КАК Марка,
	|			ПериодыФакторингаАМСрезПоследних.Фактор КАК Фактор,
	|			ПериодыФакторингаАМСрезПоследних.БеспроцентныйПериодДней КАК БеспроцентныйПериодДней,
	|			ПериодыФакторингаАМСрезПоследних.ОбщийПериодДней КАК ОбщийПериодДней
	|		ИЗ
	|			РегистрСведений.ПериодыФакторингаАМ.СрезПоследних(КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ), ) КАК ПериодыФакторингаАМСрезПоследних
	|		ГДЕ
	|			ПериодыФакторингаАМСрезПоследних.Автомобиль = ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка)
	|			И ПериодыФакторингаАМСрезПоследних.Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
	|			И ПериодыФакторингаАМСрезПоследних.Фактор <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК ПериодыФакторингаБанк
	|		ПО ВТ_Основа.Автомобиль.Модель.Марка = ПериодыФакторингаБанк.Марка
	|			И (ВТ_Основа.Автомобиль.БанкФинансирования = ПериодыФакторингаБанк.Фактор
	|				ИЛИ ВТ_Основа.Автомобиль.БанкОтгрузкиПоФинансированию = ПериодыФакторингаБанк.Фактор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КорректныеОрганизацияПодразделениеРЛДляBI.РЛ КАК РЛ,
	|			КорректныеОрганизацияПодразделениеРЛДляBI.Организация КАК Организация,
	|			КорректныеОрганизацияПодразделениеРЛДляBI.Подразделение КАК Подразделение
	|		ИЗ
	|			РегистрСведений.КорректныеОрганизацияПодразделениеРЛДляBI КАК КорректныеОрганизацияПодразделениеРЛДляBI) КАК КорректноеПодразделение
	|		ПО ВТ_Основа.РЛ = КорректноеПодразделение.РЛ");
	Запрос.УстановитьПараметр("Дата1", Дата);
	Запрос.УстановитьПараметр("Дата2", КонецДня(ТекущаяДата() - 86400));
	СписокЧанганы = Новый СписокЗначений;
	СписокЧанганы.Добавить(Справочники.Автомобили.НайтиПоРеквизиту("VIN", "LS4ASE2A5RJ104624"));
	СписокЧанганы.Добавить(Справочники.Автомобили.НайтиПоРеквизиту("VIN", "LS4ASE2A7RA707123"));
	СписокЧанганы.Добавить(Справочники.Автомобили.НайтиПоРеквизиту("VIN", "LS4ASE2A5RJ106714"));
	СписокЧанганы.Добавить(Справочники.Автомобили.НайтиПоРеквизиту("VIN", "LS5A2DKR7RA016010"));		
	Запрос.УстановитьПараметр("Чанганы", СписокЧанганы);  
	СписокВидыАвто = Новый СписокЗначений;
	СписокВидыАвто.Добавить(Перечисления.ВидАвтомобиля.Новый);  
	СписокВидыАвто.Добавить(Перечисления.ВидАвтомобиля.ПараллельныйИмпорт);  
	СписокВидыАвто.Добавить(Перечисления.ВидАвтомобиля.ПодменныйАвтомобиль);  
	СписокВидыАвто.Добавить(Перечисления.ВидАвтомобиля.ТестовыйАвтомобиль);  
	СписокВидыАвто.Добавить(Перечисления.ВидАвтомобиля.АвтомобильСПробегом);  
	Запрос.УстановитьПараметр("ВидыАвто", СписокВидыАвто);		
	
	Выборка = Запрос.Выполнить().Выбрать();
	ВсегоСтрок = Выборка.Количество();
	ТекущаяСтрока = 1;
	ТекстовыйФайл = Новый ТекстовыйДокумент;
		
	Пока Выборка.Следующий() Цикл
		СтрокаПорция =   
		ФорматироватьДляCSV(Выборка.Дата)                                                        + ";" +
		ФорматироватьДляCSV(Выборка.ДилерскийЦентр)                                              + ";" +
		ФорматироватьДляCSV(Выборка.Подразделение)                                               + ";" +
		ФорматироватьДляCSV(Выборка.Склад)                                                       + ";" +
		ФорматироватьДляCSV(Выборка.Автомобиль)                                                  + ";" +
		ФорматироватьДляCSV(Выборка.ВидАвтомобиля)                                               + ";" +
		ФорматироватьДляCSV(Выборка.VIN)                                                         + ";" +
		ФорматироватьДляCSV(Выборка.Бренд)                                                       + ";" +
		ФорматироватьДляCSV(Выборка.Модель)                                                      + ";" +
		ФорматироватьДляCSV(Выборка.ВариантКомплектации)                                         + ";" +
		ФорматироватьДляCSV(Выборка.ГодВыпуска)                                                  + ";" +
		ФорматироватьДляCSV(Выборка.СобственникАвтомобиля)                                       + ";" +
		ФорматироватьДляCSV(Выборка.Отчитан)                                                     + ";" +
		ФорматироватьДляCSV(Выборка.БлокировкаПродажи)                                           + ";" +
		ФорматироватьДляCSV(Выборка.РабочийЛист)                                                 + ";" +
		ФорматироватьДляCSV(Выборка.Реализация)                                                  + ";" +
		ФорматироватьДляCSV(Выборка.Количество_Остаток_Оборот)                                   + ";" +
		ФорматироватьДляCSV(Выборка.Сумма_Остаток_Оборот)                                        + ";" +
		ФорматироватьДляCSV(Выборка.ДатаРитейла)                                                 + ";" +
		ФорматироватьДляCSV(Выборка.ДатаРитейла2)                                                + ";" +
		ФорматироватьДляCSV(Выборка.СкидкаПриПокупкеВТрейдИн)                                    + ";" +
		ФорматироватьДляCSV(Выборка.СкидкаПриПокупкеВКредит)                                     + ";" +
		ФорматироватьДляCSV(Выборка.НомерДатаПерезачета)                                         + ";" +
		ФорматироватьДляCSV(Выборка.Оплачен)                                                     + ";" +
		ФорматироватьДляCSV(Выборка.ДатаОплаты)                                                  + ";" +
		ФорматироватьДляCSV(Выборка.РазмерСкидки)                                                + ";" +
		ФорматироватьДляCSV(Выборка.ОжидаемаяДатаПолученияКомпенсации)                           + ";" +
		ФорматироватьДляCSV(Выборка.РазмерКомпенсации)                                           + ";" +
		ФорматироватьДляCSV(Выборка.НаличныйРасчет)                                              + ";" +
		ФорматироватьДляCSV(Выборка.БезналичныйРасчет)                                           + ";" +
		ФорматироватьДляCSV(Выборка.Кредит)                                                      + ";" +
		ФорматироватьДляCSV(Выборка.Обмен)                                                       + ";" +
		ФорматироватьДляCSV(Выборка.Лизинг)                                                      + ";" +
		ФорматироватьДляCSV(Выборка.ПредоплатаЗаАМ)                                              + ";" +
		ФорматироватьДляCSV(Выборка.ДатаПредоплатыЗаАМ)                                          + ";" +
		ФорматироватьДляCSV(Выборка.Покупатель)                                                  + ";" +
		ФорматироватьДляCSV(Выборка.РРЦ)                                                         + ";" +
		ФорматироватьДляCSV(Выборка.Инвойс)                                                      + ";" +
		ФорматироватьДляCSV(Выборка.СкидкаТрейдИнПлан)                                           + ";" +
		ФорматироватьДляCSV(Выборка.СкидкаТрейдИнФакт)                                           + ";" +
		ФорматироватьДляCSV(Выборка.СкидкаТрейдИн2План)                                          + ";" +
		ФорматироватьДляCSV(Выборка.СкидкаТрейдИн2Факт)                                          + ";" +
		ФорматироватьДляCSV(Выборка.СкидкаСубсидияКредитПлан)                                    + ";" +
		ФорматироватьДляCSV(Выборка.СкидкаСубсидияКредитФакт)                                    + ";" +
		ФорматироватьДляCSV(Выборка.СкидкаПоПрограммамЛояльности)                                + ";" +
		ФорматироватьДляCSV(Выборка.СкидкаПоСпецПрограмме)                                       + ";" +
		ФорматироватьДляCSV(Выборка.СкидкаРозничная)                                             + ";" +
		ФорматироватьДляCSV(Выборка.СкидкаДополнительная)                                        + ";" +
		ФорматироватьДляCSV(Выборка.СтоимостьДопОборудования_Маркетинг)                          + ";" +
		ФорматироватьДляCSV(Выборка.СтоимостьДопОборудования)                                    + ";" +
		ФорматироватьДляCSV(Выборка.ПлановаяСтоимостьДО)                                         + ";" +
		ФорматироватьДляCSV(Выборка.СебестоимостьДО)                                             + ";" +
		ФорматироватьДляCSV(Выборка.СебестоимостьДО_Комплектации)                                + ";" +
		ФорматироватьДляCSV(Выборка.СуммаДО)                                                     + ";" +
		ФорматироватьДляCSV(Выборка.ЦенаДопПоПрайсу)                                             + ";" +
		ФорматироватьДляCSV(Выборка.ПредоплатаТО)                                                + ";" +
		ФорматироватьДляCSV(Выборка.КомпенсацияТрейдИНРетроспективная)                           + ";" +
		ФорматироватьДляCSV(Выборка.КомпенсацияСубсидияКредитРетроспективная)                    + ";" +
		ФорматироватьДляCSV(Выборка.КомпенсацияПоПрограммамЛояльностиРетроспективная)            + ";" +
		ФорматироватьДляCSV(Выборка.КомпенсацияРозничнаяРетроспективная)                         + ";" +
		ФорматироватьДляCSV(Выборка.КомпенсацияТрейдИН2Ретроспективная)                          + ";" +
		ФорматироватьДляCSV(Выборка.КомпенсацияРетроспективная)                                  + ";" +
		ФорматироватьДляCSV(Выборка.КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля) + ";" +
		ФорматироватьДляCSV(Выборка.СуммаКомпенсации)                                            + ";" +
		ФорматироватьДляCSV(Выборка.КомпенсацияВИнвойсе)                                         + ";" +
		ФорматироватьДляCSV(Выборка.КомпенсацияБрокерФинанс)                                     + ";" +
		ФорматироватьДляCSV(Выборка.СуммаКаско)                                                  + ";" +
		ФорматироватьДляCSV(Выборка.ВариантКаско)                                                + ";" +
		ФорматироватьДляCSV(Выборка.СуммаОсаго)                                                  + ";" +
		ФорматироватьДляCSV(Выборка.ВариантОсаго)                                                + ";" + 
		//Иванченко 20260329 ++
		//ФорматироватьДляCSV(Выборка.СуммаСтрахованиеЖизни)                                       + ";" +
		ФорматироватьДляCSV(?(Выборка.СуммаСтрахованиеЖизни = NULL, "", Строка(Выборка.СуммаСтрахованиеЖизни.УникальныйИдентификатор())))     + ";" +
		//Иванченко 20260329 --
		ФорматироватьДляCSV(Выборка.ВариантСтрахованиеЖизни)                                     + ";" +
		ФорматироватьДляCSV(Выборка.ЦенаФакт)                                                    + ";" +
		ФорматироватьДляCSV(Выборка.ЦенаДоговора)                                                + ";" +
		ФорматироватьДляCSV(Выборка.ПервоначальныйВзнос)                                         + ";" +
		ФорматироватьДляCSV(Выборка.ДатаПервоначальногоВзноса)                                   + ";" +
		ФорматироватьДляCSV(Выборка.БанкЛК)                                                      + ";" +
		ФорматироватьДляCSV(Выборка.КредитнаяСтоимость)                                          + ";" +
		ФорматироватьДляCSV(Выборка.ПрогнозСрокаПодготовкиАвтоВДнях)                             + ";" +
		ФорматироватьДляCSV(Выборка.ПрогнозСуммыРемонта)                                         + ";" +
		ФорматироватьДляCSV(Выборка.ПрогнозСуммыДетейлинга)                                      + ";" +
		ФорматироватьДляCSV(Выборка.ПрогнозируемаяЦенаПродажи)                                   + ";" +
		ФорматироватьДляCSV(Выборка.ПрогнозСрокаПродажиАвтоВДнях)                                + ";" +
		ФорматироватьДляCSV(Выборка.ПрогнозСуммыМКЦ)                                             + ";" +
		ФорматироватьДляCSV(Выборка.ЦенаМинРыночнаяТрейдИн)                                      + ";" +
		ФорматироватьДляCSV(Выборка.ПланируемаяЦенаПродажиТрейдИн)                               + ";" +
		ФорматироватьДляCSV(Выборка.ЦенаДКПТрейдИн)                                              + ";" +
		ФорматироватьДляCSV(Выборка.ДатаРитейла_РЛ)                                              + ";" +
		ФорматироватьДляCSV(Выборка.СуммаИСП)                                                    + ";" +
		ФорматироватьДляCSV(Выборка.КоличествоДолгаОП)                                           + ";" +
		ФорматироватьДляCSV(Выборка.Резерв)                                                      + ";" +
		ФорматироватьДляCSV(Выборка.ДатаПоступленияВГК)                                          + ";" +
		ФорматироватьДляCSV(Выборка.ДатаФинансирования)                                          + ";" +
		ФорматироватьДляCSV(Выборка.ДатаПриемкиНаТекушийСклад)                                   + ";" +
		ФорматироватьДляCSV(Выборка.СрокХранения)                                                + ";" +
		ФорматироватьДляCSV(Выборка.ГарантияПИ)                                                  + ";" +
		ФорматироватьДляCSV(Выборка.БонусЗаМодель)                                               + ";" +
		ФорматироватьДляCSV(Выборка.ЦелеваяДоходность)                                           + ";" +
		ФорматироватьДляCSV(Выборка.БонусЗаШтуку)                                                + ";" +
		ФорматироватьДляCSV(Выборка.СтоимостьСуточногоХранения)                                  + ";" +
		ФорматироватьДляCSV(Выборка.ОбщаяСтоимостьХранения)		                                 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_1)														 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_2)														 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_3)														 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_4)														 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_5)														 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_6)														 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_7)														 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_8)														 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_9)														 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_10)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_11)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_12)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_13)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_14)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_15)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_16)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_17)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_18)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_19)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_20)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_21)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_22)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_23)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_24)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_25)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_26)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_27)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_28)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_29)													 + ";" +			
		ФорматироватьДляCSV(Выборка.Tech_30)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_31)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_32)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_33)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_34)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_35)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_36)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_37)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_38)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_39)													 + ";" +			
		ФорматироватьДляCSV(Выборка.Tech_40)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_41)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_42)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_43)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_44)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_45)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_46)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_47)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_48)													 + ";" +
		ФорматироватьДляCSV(Выборка.Tech_49)													 + ";" +						
		ФорматироватьДляCSV(Выборка.Tech_50);    
		ТекстовыйФайл.ДобавитьСтроку(СтрокаПорция);  
		
		ТекущаяСтрока = ТекущаяСтрока + 1;
		Процент = Мин(Макс(Окр(ТекущаяСтрока / ВсегоСтрок * 100), 0), 100);	
	КонецЦикла;    
	
	Попытка
		ФайловыйПоток = Новый ФайловыйПоток(ГдеСоздавать + "Avto_na_skladah_v2_1.csv", РежимОткрытияФайла.Создать);
		ТекстовыйФайл.Записать(ФайловыйПоток, КодировкаТекста.UTF8, Символы.ПС, Ложь);
		ФайловыйПоток.Закрыть();			
	Исключение  
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());   	
		//ЗаписьЖурналаРегистрации(НСтр("ru = 'Распределенное выполнение команд'"), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки); 
	КонецПопытки; 
				
	УдалитьФайлы(ГдеСоздавать, МаскаФайла); 
	ОбъединитьФайлы(ГдеСоздавать + "Avto_na_skladah_v2_*", ГдеСоздавать + МаскаФайла);
	УдалитьФайлы(ГдеСоздавать, "Avto_na_skladah_v2_*"); 
	//Иванченко 20260212 --
	//Иванченко 20260309 ++	
	ВыгрузкаСкладаАвтоВФайлCSV();	
	//Иванченко 20260309 --	
КонецПроцедуры 

//Иванченко 20260309 ++
Процедура ВыгрузкаСкладаАвтоВФайлCSV() Экспорт     
	ГдеСоздавать = "\\1cserver\powerbi\sklan_auto_debug\";	
	//ГдеСоздавать = "C:\Users\ivanchenko_ii\Downloads\";
	МаскаФайла = "Avto_na_skladah_max.csv";	
	ФайлШапки = Новый ТекстовыйДокумент;	
	МассивФайлов = НайтиФайлы(ГдеСоздавать, МаскаФайла); 
	
	Если МассивФайлов.Количество() = 0 Тогда  
		Шапка = "Дата;ДилерскийЦентр;Подразделение;Склад;Автомобиль;ВидАвтомобиля;VIN;Бренд;Модель;ВариантКомплектации;ГодВыпуска;СобственникАвтомобиля;Отчитан;БлокировкаПродажи;РабочийЛист;Реализация;Количество_Остаток_Оборот;Сумма_Остаток_Оборот;ДатаРитейла;ДатаРитейла2;СкидкаПриПокупкеВТрейдИн;СкидкаПриПокупкеВТрейдИн;НомерДатаПерезачета;Оплачен;ДатаОплаты;РазмерСкидки;ОжидаемаяДатаПолученияКомпенсации;РазмерКомпенсации;НаличныйРасчет;БезналичныйРасчет;Кредит;Обмен;Лизинг;ПредоплатаЗаАМ;ДатаПредоплатыЗаАМ;Покупатель;РРЦ;Инвойс;СкидкаТрейдИнПлан;СкидкаТрейдИнФакт;СкидкаТрейдИн2План;СкидкаТрейдИн2Факт;СкидкаСубсидияКредитПлан;СкидкаСубсидияКредитФакт;СкидкаПоПрограммамЛояльности;СкидкаПоСпецПрограмме;СкидкаРозничная;СкидкаДополнительная;СтоимостьДопОборудования_Маркетинг;СтоимостьДопОборудования;ПлановаяСтоимостьДО;СебестоимостьДО;СебестоимостьДО_Комплектации;СуммаДО;ЦенаДопПоПрайсу;ПредоплатаТО;КомпенсацияТрейдИНРетроспективная;КомпенсацияСубсидияКредитРетроспективная;КомпенсацияПоПрограммамЛояльностиРетроспективная;КомпенсацияРозничнаяРетроспективная;КомпенсацияТрейдИН2Ретроспективная;КомпенсацияРетроспективная;КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля;СуммаКомпенсации;КомпенсацияВИнвойсе;КомпенсацияБрокерФинанс;СуммаКаско;ВариантКаско;СуммаОсаго;ВариантОсаго;СуммаСтрахованиеЖизни;ВариантСтрахованиеЖизни;ЦенаФакт;ЦенаДоговора;ПервоначальныйВзнос;ДатаПервоначальногоВзноса;БанкЛК;КредитнаяСтоимость;ПрогнозСрокаПодготовкиАвтоВДнях;ПрогнозСуммыРемонта;ПрогнозСуммыДетейлинга;ПрогнозируемаяЦенаПродажи;ПрогнозСрокаПродажиАвтоВДнях;ПрогнозСуммыМКЦ;ЦенаМинРыночнаяТрейдИн;ПланируемаяЦенаПродажиТрейдИн;ЦенаДКПТрейдИн;ДатаРитейла_РЛ;СуммаИСП;КоличествоДолгаОП;Резерв;ДатаПоступленияВГК;ДатаФинансирования;ДатаПриемкиНаТекушийСклад;СрокХранения;ГарантияПИ;БонусЗаМодель;ЦелеваяДоходность;БонусЗаШтуку;СтоимостьСуточногоХранения;ОбщаяСтоимостьХранения;Tech_1;Tech_2;Tech_3;Tech_4;Tech_5;Tech_6;Tech_7;Tech_8;Tech_9;Tech_10;Tech_11;Tech_12;Tech_13;Tech_14;Tech_15;Tech_16;Tech_17;Tech_18;Tech_19;Tech_20;Tech_21;Tech_22;Tech_23;Tech_24;Tech_25;Tech_26;Tech_27;Tech_28;Tech_29;Tech_30;Tech_31;Tech_32;Tech_33;Tech_34;Tech_35;Tech_36;Tech_37;Tech_38;Tech_39;Tech_40;Tech_41;Tech_42;Tech_43;Tech_44;Tech_45;Tech_46;Tech_47;Tech_48;Tech_49;Tech_50";
		ФайлШапки.ВставитьСтроку(1, Шапка);
		Дата = '20250101'; 		
	Иначе
		ФайлШапки.Прочитать(ГдеСоздавать + МаскаФайла);
		ФайлШапки.Записать(ГдеСоздавать + "Avto_na_skladah_backup.csv"); 
		ЧтениеФайлаВыгрузки = Новый ЧтениеТекста;	
		ЧтениеФайлаВыгрузки.Открыть(ГдеСоздавать + МаскаФайла);  
		СтрокаФайлаВыгрузки = ЧтениеФайлаВыгрузки.ПрочитатьСтроку();
		
		Пока СтрокаФайлаВыгрузки <> Неопределено Цикл;  
			
			Попытка
				ПоследняяДата = НачалоДня(Дата(Лев(СтрокаФайлаВыгрузки, 19)));    
			Исключение	
			КонецПопытки;  
			
			СтрокаФайлаВыгрузки = ЧтениеФайлаВыгрузки.ПрочитатьСтроку();			
		КонецЦикла;	 
		
		ЧтениеФайлаВыгрузки.Закрыть();               
		
		Если ПоследняяДата <> Неопределено Тогда	
			Дата = ПоследняяДата + 86400;	
		Иначе 
			Дата = НачалоДня(ТекущаяДата() - 86400); 
		КонецЕсли; 
		
	КонецЕсли; 	
	
	ФайлШапки.Записать(ГдеСоздавать + "Avto_na_skladah_max_0.csv"); 
		
	// Запаковка ВТ регистра во временную таблицу 
	Запрос = Новый Запрос;   
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПроизводственныйКалендарь.ДатаКалендаря КАК День
	|ПОМЕСТИТЬ ВТ_Дни
	|ИЗ
	|	РегистрСведений.DMS_ПроизводственныйКалендарь КАК ПроизводственныйКалендарь
	|ГДЕ
	|	ПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &Дата1 И &Дата2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Дни.День КАК День,
	|	ОстаткиАвтомобилейОстаткиИОбороты.СкладКомпании КАК Склад,
	|	ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль КАК Автомобиль,
	|	СУММА(ВЫБОР
	|			КОГДА ОстаткиАвтомобилейОстаткиИОбороты.Период = &Дата1
	|				ТОГДА ОстаткиАвтомобилейОстаткиИОбороты.КоличествоКонечныйОстаток
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ОстаткиАвтомобилейОстаткиИОбороты.Период <= ВТ_Дни.День
	|						ТОГДА ОстаткиАвтомобилейОстаткиИОбороты.КоличествоОборот
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ) КАК Количество,
	|	СУММА(ОстаткиАвтомобилейОстаткиИОбороты.СуммаКонечныйОстаток) КАК Сумма
	|ПОМЕСТИТЬ ВТ_ОО
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.ОстаткиИОбороты(&Дата1, &Дата2, День, , ) КАК ОстаткиАвтомобилейОстаткиИОбороты,
	|	ВТ_Дни КАК ВТ_Дни
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиАвтомобилейОстаткиИОбороты.СкладКомпании,
	|	ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль,
	|	ВТ_Дни.День
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(ВТ_ОО.День, ДЕНЬ) КАК Дата,
	|	ВТ_ОО.Склад КАК Склад,
	|	ВТ_ОО.Автомобиль КАК Автомобиль,
	|	ВТ_ОО.Количество КАК Количество,
	|	ВТ_ОО.Сумма КАК Сумма,
	|	""Склад"" КАК ТипСтроки
	|ПОМЕСТИТЬ ВТ_Строки
	|ИЗ
	|	ВТ_ОО КАК ВТ_ОО
	|ГДЕ
	|	ВТ_ОО.Количество > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РабочийЛист.АвтомобильТрейдИн КАК АвтомобильТрейдИн,
	|	МАКСИМУМ(РабочийЛист.Ссылка) КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ТИ
	|ИЗ
	|	ВТ_Строки КАК ВТ_Строки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РабочийЛист КАК РабочийЛист
	|		ПО ВТ_Строки.Автомобиль = РабочийЛист.АвтомобильТрейдИн
	|ГДЕ
	|	НЕ РабочийЛист.ПометкаУдаления
	|	И РабочийЛист.Проведен
	|	И РабочийЛист.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Продажа)
	|	И РабочийЛист.ПоступлениеАвтоТрэйдИн <> ЗНАЧЕНИЕ(Документ.ПоступлениеАвтомобилей.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	РабочийЛист.АвтомобильТрейдИн
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВсеПоступления.Поступление.Дата, ВсеПоступления.ОтветственноеХранение.Дата) КАК ДатаПоступления,
	|	ВсеПоступления.Автомобиль КАК Автомобиль,
	|	ЕСТЬNULL(ВсеПоступления.Поступление, ВсеПоступления.ОтветственноеХранение) КАК ДокументПоступления,
	|	ВЫБОР
	|		КОГДА ОстаткиАвтомобилейОстаткиИОбороты.Регистратор = ОстаткиАвтомобилейОстаткиИОбороты.Партия
	|			ТОГДА ОстаткиАвтомобилейОстаткиИОбороты.Регистратор.СуммаОферты
	|		ИНАЧЕ ВсеПоступления.Поступление.СуммаОферты
	|	КОНЕЦ КАК ЦенаОферты,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|					ИЛИ ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.GAC)
	|					ИЛИ ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|					ИЛИ ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль В (&Чанганы)
	|				ТОГДА РассчетныйИнвойсСрезПоследних.ИнвойсРассчетный
	|		КОНЕЦ, ВЫБОР
	|			КОГДА ВсеПоступления.ТестовыйЧАР
	|				ТОГДА ОстаткиАвтомобилейОстаткиИОбороты.СуммаКонечныйОстаток
	|			ИНАЧЕ ОстаткиАвтомобилейОстаткиИОбороты.СуммаКонечныйОстаток + ЕСТЬNULL(Корректировки.СуммаКорректировки, 0)
	|		КОНЕЦ) * ВЫБОР
	|		КОГДА ВсеПоступления.ВидАвто В (&ВидыАвто)
	|				И ЕСТЬNULL(ВсеПоступления.ОтветственноеХранение.Контрагент.ФормаСобственности, ВсеПоступления.Поступление.Контрагент.ФормаСобственности) = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЮридическоеЛицо)
	|				И ЕСТЬNULL(ВсеПоступления.ОтветственноеХранение.ХозОперация, ВсеПоступления.Поступление.ХозОперация) <> ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеАвтомобилейКомиссия)
	|				И ЕСТЬNULL(ВсеПоступления.ОтветственноеХранение.Дата, ВсеПоступления.Поступление.Дата) <= ДАТАВРЕМЯ(2026, 1, 1)
	|			ТОГДА 1.02
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ЦенаПоступления,
	|	ЕСТЬNULL(ВсеПоступления.Поступление.ХозОперация, ВсеПоступления.ОтветственноеХранение.ХозОперация) = ЗНАЧЕНИЕ(Справочник.ХозОперации.ВводОстатковАвтомобилейПереданныхНаКомиссию)
	|		ИЛИ ЕСТЬNULL(ВсеПоступления.Поступление.ХозОперация, ВсеПоступления.ОтветственноеХранение.ХозОперация) = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеАвтомобилейКомиссия) КАК Комиссия,
	|	ВсеПоступления.ВидАвто КАК ВидАвто
	|ПОМЕСТИТЬ ВТ_Поступление
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОстаткиАвтомобилейОбороты.Автомобиль КАК Автомобиль,
	|		АвтомобилиСрезПоследних.Значение КАК ВидАвто,
	|		ВЫБОР
	|			КОГДА (ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|					ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.GAC)
	|					ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|					ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|					ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET))
	|					И АвтомобилиСрезПоследних.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ТестовыйАвтомобиль)
	|				ТОГДА МИНИМУМ(ВЫБОР
	|							КОГДА ОстаткиАвтомобилейОбороты.СтатусПартии = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварОтветственноеХранение)
	|								ТОГДА ОстаткиАвтомобилейОбороты.Партия
	|						КОНЕЦ)
	|			ИНАЧЕ МАКСИМУМ(ВЫБОР
	|						КОГДА ОстаткиАвтомобилейОбороты.СтатусПартии = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварОтветственноеХранение)
	|							ТОГДА ОстаткиАвтомобилейОбороты.Партия
	|					КОНЕЦ)
	|		КОНЕЦ КАК ОтветственноеХранение,
	|		ВЫБОР
	|			КОГДА (ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|					ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.GAC)
	|					ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|					ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|					ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET))
	|					И АвтомобилиСрезПоследних.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ТестовыйАвтомобиль)
	|				ТОГДА МИНИМУМ(ВЫБОР
	|							КОГДА ОстаткиАвтомобилейОбороты.СтатусПартии <> ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварОтветственноеХранение)
	|									И ОстаткиАвтомобилейОбороты.Партия.ХозОперация <> ЗНАЧЕНИЕ(Справочник.ХозОперации.ПереходВСобственностьАвтомобилей)
	|								ТОГДА ОстаткиАвтомобилейОбороты.Партия
	|						КОНЕЦ)
	|			ИНАЧЕ МАКСИМУМ(ВЫБОР
	|						КОГДА ОстаткиАвтомобилейОбороты.СтатусПартии <> ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварОтветственноеХранение)
	|								И ОстаткиАвтомобилейОбороты.Партия.ХозОперация <> ЗНАЧЕНИЕ(Справочник.ХозОперации.ПереходВСобственностьАвтомобилей)
	|							ТОГДА ОстаткиАвтомобилейОбороты.Партия
	|					КОНЕЦ)
	|		КОНЕЦ КАК Поступление,
	|		(ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|			ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.GAC)
	|			ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|			ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|			ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET))
	|			И АвтомобилиСрезПоследних.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ТестовыйАвтомобиль) КАК ТестовыйЧАР
	|	ИЗ
	|		РегистрНакопления.ОстаткиАвтомобилей.Обороты(
	|				,
	|				КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
	|				Регистратор,
	|				НЕ Партия.ПометкаУдаления
	|					И Партия.Проведен
	|					И НЕ Партия.Контрагент.НашаФирма
	|					И Автомобиль В
	|						(ВЫБРАТЬ
	|							ВТ_Строки.Автомобиль
	|						ИЗ
	|							ВТ_Строки)
	|					И НЕ Партия.Контрагент В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.Контрагенты.НашиФирмы))) КАК ОстаткиАвтомобилейОбороты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних(
	|					КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
	|					ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)
	|						И ТИПЗНАЧЕНИЯ(ВидЗначения) = ТИП(Перечисление.ДополнительнаяИнформацияАвтомобилей)) КАК АвтомобилиСрезПоследних
	|			ПО ОстаткиАвтомобилейОбороты.Автомобиль = АвтомобилиСрезПоследних.Автомобиль
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ОстаткиАвтомобилейОбороты.Автомобиль,
	|		АвтомобилиСрезПоследних.Значение,
	|		ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка) КАК ВсеПоступления
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОстаткиАвтомобилейОбороты.Автомобиль КАК Автомобиль,
	|			СУММА(ОстаткиАвтомобилейОбороты.СуммаОборот) КАК СуммаКорректировки
	|		ИЗ
	|			РегистрНакопления.ОстаткиАвтомобилей.Обороты(
	|					,
	|					,
	|					Регистратор,
	|					НЕ Партия.ПометкаУдаления
	|						И Партия.Проведен) КАК ОстаткиАвтомобилейОбороты
	|		ГДЕ
	|			НЕ ОстаткиАвтомобилейОбороты.Регистратор.ПометкаУдаления
	|			И ОстаткиАвтомобилейОбороты.Регистратор.Проведен
	|			И ОстаткиАвтомобилейОбороты.Регистратор ССЫЛКА Документ.КорректировкаПоступленияАвтомобилей
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОстаткиАвтомобилейОбороты.Автомобиль) КАК Корректировки
	|		ПО ВсеПоступления.Автомобиль = Корректировки.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей.ОстаткиИОбороты(, КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ), Регистратор, , ) КАК ОстаткиАвтомобилейОстаткиИОбороты
	|		ПО ВсеПоступления.Автомобиль = ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль
	|			И (ЕСТЬNULL(ВсеПоступления.Поступление, ВсеПоступления.ОтветственноеХранение) = ОстаткиАвтомобилейОстаткиИОбороты.Регистратор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РассчетныйИнвойс.СрезПоследних КАК РассчетныйИнвойсСрезПоследних
	|		ПО ВсеПоступления.Автомобиль = РассчетныйИнвойсСрезПоследних.Автомобиль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Строки.Дата КАК Дата,
	|	ВТ_Строки.Склад КАК Склад,
	|	ВТ_Строки.Автомобиль КАК Автомобиль,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА РабочийЛист.Статус <> ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Отказ)
	|				ТОГДА РабочийЛист.Ссылка
	|		КОНЕЦ) КАК РЛ,
	|	ВТ_Строки.Количество КАК Количество,
	|	ВТ_Строки.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА ВТ_ТИ.АвтомобильТрейдИн ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТИ,
	|	ЕСТЬNULL(СОКРЛП(ВТ_ТИ.Ссылка.ФамилияПриемщика.Наименование), """") КАК МенеджерАСП,
	|	СОКРЛП(ВТ_ТИ.Ссылка.Автомобиль.VIN) КАК VIN_Матери,
	|	ВТ_Строки.ТипСтроки КАК ТипСтроки
	|ПОМЕСТИТЬ ВТ_Основа
	|ИЗ
	|	ВТ_Строки КАК ВТ_Строки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТИ КАК ВТ_ТИ
	|		ПО ВТ_Строки.Автомобиль = ВТ_ТИ.Ссылка.АвтомобильТрейдИн
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РабочийЛист КАК РабочийЛист
	|		ПО ВТ_Строки.Дата >= РабочийЛист.Дата
	|			И ВТ_Строки.Автомобиль = РабочийЛист.Автомобиль
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Строки.Дата,
	|	ВТ_Строки.Склад,
	|	ВТ_Строки.Автомобиль,
	|	ВТ_Строки.Количество,
	|	ВТ_Строки.Сумма,
	|	ЕСТЬNULL(СОКРЛП(ВТ_ТИ.Ссылка.ФамилияПриемщика.Наименование), """"),
	|	СОКРЛП(ВТ_ТИ.Ссылка.Автомобиль.VIN),
	|	ВТ_Строки.ТипСтроки,
	|	ВЫБОР
	|		КОГДА ВТ_ТИ.АвтомобильТрейдИн ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основа.Дата КАК Дата,
	|	ВТ_Основа.Склад.Подразделение.ДилерскийЦентр КАК ДилерскийЦентр,
	|	ЕСТЬNULL(ВТ_Основа.РЛ.ПодразделениеКомпании.Наименование, ВЫБОР
	|			КОГДА ВТ_Основа.ТипСтроки = ""Заказ""
	|				ТОГДА ВТ_Основа.Склад.Наименование
	|			ИНАЧЕ ВТ_Основа.Склад.Подразделение.Родитель.Наименование
	|		КОНЕЦ) КАК Подразделение,
	|	ЕСТЬNULL(ВТ_Основа.РЛ.СкладВладельцаАвто.Наименование, ВЫБОР
	|			КОГДА ВТ_Основа.ТипСтроки = ""Заказ""
	|				ТОГДА """"
	|			ИНАЧЕ ВТ_Основа.Склад.Наименование
	|		КОНЕЦ) КАК Склад,
	|	ВТ_Основа.Автомобиль.Наименование КАК Автомобиль,
	|	ХарактеристикиАвто.ВидАвто КАК ВидАвтомобиля,
	|	СТРОКА(ВТ_Основа.Автомобиль.VIN) КАК VIN,
	|	ВТ_Основа.Автомобиль.Модель.Марка.Наименование КАК Бренд,
	|	ВТ_Основа.Автомобиль.Модель.Наименование КАК Модель,
	|	ВТ_Основа.Автомобиль.ВариантКомплектации.Наименование КАК ВариантКомплектации,
	|	ГОД(ВТ_Основа.Автомобиль.ГодВыпуска) КАК ГодВыпуска,
	|	ВТ_Основа.РЛ.ВладелецАвто.Наименование КАК СобственникАвтомобиля,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) + ЕСТЬNULL(КоммерческоеДО.Сумма, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) + ЕСТЬNULL(КоммерческоеДО.Сумма, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0)
	|								ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) + ЕСТЬNULL(КоммерческоеДО.Сумма, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка) / Налогооблажение.НалоговаяСтавка + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0)
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) + ЕСТЬNULL(КоммерческоеДО.Сумма, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) + ЕСТЬNULL(КоммерческоеДО.Сумма, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0)
	|							ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) + ЕСТЬNULL(КоммерческоеДО.Сумма, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0)) / Налогооблажение.НалоговаяСтавка + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) + ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|								ТОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
	|						КОНЕЦ
	|				ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0)) / Налогооблажение.НалоговаяСтавка + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) + ВЫБОР
	|						КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|							ТОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
	|						ИНАЧЕ ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Отчитан,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) + ЕСТЬNULL(КоммерческоеДО.Сумма, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) + ЕСТЬNULL(КоммерческоеДО.Сумма, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0)
	|								ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) + ЕСТЬNULL(КоммерческоеДО.Сумма, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка) / Налогооблажение.НалоговаяСтавка + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0)
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) + ЕСТЬNULL(КоммерческоеДО.Сумма, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) + ЕСТЬNULL(КоммерческоеДО.Сумма, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0)
	|							ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) + ЕСТЬNULL(КоммерческоеДО.Сумма, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0)) / Налогооблажение.НалоговаяСтавка + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) + ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|								ТОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
	|						КОНЕЦ
	|				ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0)) / Налогооблажение.НалоговаяСтавка + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) + ВЫБОР
	|						КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|							ТОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
	|						ИНАЧЕ ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ + ЕСТЬNULL(ВТ_Основа.РЛ.КВКредит + СтраховыеПрограммы.КВКАСКО + СтраховыеПрограммы.КВОСАГО + СтраховыеПрограммы.КВGAP + СтраховыеПрограммы.КВМедиКАСКО + СтраховыеПрограммы.КВРАТ + СтраховыеПрограммы.КВНезависимаяГарантия + СтраховыеПрограммы.КВБезотзывнаяНезависимаяГарантия + СтраховыеПрограммы.КВМедицинскоеСтрахование + СтраховыеПрограммы.КВСтрахованиеЖизни + СтраховыеПрограммы.КВСтрахованиеИмущества + СтраховыеПрограммы.КВПрочее, ВТ_Основа.РЛ.КВКредит + ВТ_Основа.РЛ.КВКаско + ВТ_Основа.РЛ.КВОсаго + ВТ_Основа.РЛ.КВСЖ + ЕСТЬNULL(РЛ_ИСП.КВ, 0)) / Налогооблажение.НалоговаяСтавка КАК БлокировкаПродажи,
	|	ВТ_Основа.РЛ.Номер КАК РабочийЛист,
	|	NULL КАК Реализация,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаКАСКО.Наименование, """") КАК Количество_Остаток_Оборот,
	|	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(СтраховыеПрограммы.ВидКАСКО), """") КАК Сумма_Остаток_Оборот,
	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаРитейла, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРитейла,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияКАСКО.Наименование, """") КАК ДатаРитейла2,
	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.СкидаПриПокупкеВТрейдИн, 0) КАК СкидкаПриПокупкеВТрейдИн,
	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.СкидкаПриПокупкеВКредит, 0) КАК СкидкаПриПокупкеВКредит,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаКАСКО, 0) КАК НомерДатаПерезачета,
	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.Оплачен, """") КАК Оплачен,
	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОплаты,
	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.РазмерСкидки, 0) КАК РазмерСкидки,
	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.ОжидаемаяДатаПолученияКомпенсации, ДАТАВРЕМЯ(1, 1, 1)) КАК ОжидаемаяДатаПолученияКомпенсации,
	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.РазмерКомпенсации, 0) КАК РазмерКомпенсации,
	|	ЕСТЬNULL(ВТ_Основа.РЛ.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.НаличныйРасчет), """") КАК НаличныйРасчет,
	|	ЕСТЬNULL(ВТ_Основа.РЛ.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.БанковскаяКарта)
	|			ИЛИ ВТ_Основа.РЛ.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.БезналичныйРасчет), """") КАК БезналичныйРасчет,
	|	ЕСТЬNULL(ВТ_Основа.РЛ.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.Кредит), """") КАК Кредит,
	|	ЕСТЬNULL(ВТ_Основа.РЛ.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.Обмен), """") КАК Обмен,
	|	ЕСТЬNULL(ВТ_Основа.РЛ.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.Лизинг), """") КАК Лизинг,
	|	ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаЗаАМ, 0) КАК ПредоплатаЗаАМ,
	|	ЕСТЬNULL(ВТ_Основа.РЛ.ДатаПредоплатыЗаАМ, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПредоплатыЗаАМ,
	|	ЕСТЬNULL(ВТ_Основа.РЛ.Контрагент, ЗаказыАвто.Заказ.Контрагент) КАК Покупатель,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0)
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) / Налогооблажение.НалоговаяСтавка
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК РРЦ,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0)
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) / Налогооблажение.НалоговаяСтавка
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|					ТОГДА 0
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0)
	|			КОНЕЦ
	|	КОНЕЦ КАК Инвойс,
	|	ВЫБОР
	|		КОГДА ВТ_Поступление.ЦенаОферты = 0
	|			ТОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0)
	|		ИНАЧЕ ВТ_Поступление.ЦенаОферты
	|	КОНЕЦ КАК СкидкаТрейдИнПлан,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0)
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) / Налогооблажение.НалоговаяСтавка
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК СкидкаТрейдИнФакт,
	|	ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2, 0) КАК СкидкаТрейдИн2План,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0)
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) / Налогооблажение.НалоговаяСтавка
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК СкидкаТрейдИн2Факт,
	|	ВТ_Основа.РЛ.СкидкаСубсидияКредит КАК СкидкаСубсидияКредитПлан,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0)
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) / Налогооблажение.НалоговаяСтавка
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК СкидкаСубсидияКредитФакт,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0)
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) / Налогооблажение.НалоговаяСтавка
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК СкидкаПоПрограммамЛояльности,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0)
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) / Налогооблажение.НалоговаяСтавка
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК СкидкаПоСпецПрограмме,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0)
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) / Налогооблажение.НалоговаяСтавка
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК СкидкаРозничная,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА 0
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) * (1 - Налогооблажение.НалоговаяСтавка) / Налогооблажение.НалоговаяСтавка
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА 0
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) * (1 - Налогооблажение.НалоговаяСтавка) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА 0
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) * (1 - Налогооблажение.НалоговаяСтавка) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК СкидкаДополнительная,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВКАСКО, 0) КАК СтоимостьДопОборудования_Маркетинг,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаОСАГО, """") КАК СтоимостьДопОборудования,
	|	ВТ_Основа.РЛ.СтоимостьДО КАК ПлановаяСтоимостьДО,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0)
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) / Налогооблажение.НалоговаяСтавка
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК СебестоимостьДО,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидОСАГО, """") КАК СебестоимостьДО_Комплектации,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияОСАГО, """") КАК СуммаДО,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0)
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) / Налогооблажение.НалоговаяСтавка
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦенаДопПоПрайсу,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0)
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) / Налогооблажение.НалоговаяСтавка
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК ПредоплатаТО,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаОСАГО, 0) КАК КомпенсацияТрейдИНРетроспективная,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВОСАГО, 0) КАК КомпенсацияСубсидияКредитРетроспективная,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаGAP, """") КАК КомпенсацияПоПрограммамЛояльностиРетроспективная,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидGAP, """") КАК КомпенсацияРозничнаяРетроспективная,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияGAP, """") КАК КомпенсацияТрейдИН2Ретроспективная,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0)) * Налогооблажение.НалоговаяСтавка
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0)
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0)
	|							ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0)) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0)
	|				ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0)) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК КомпенсацияРетроспективная,
	|	ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля КАК КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля,
	|	ВТ_Основа.РЛ.СуммаКомпенсации КАК СуммаКомпенсации,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)
	|							ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)
	|				ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК КомпенсацияВИнвойсе,
	|	ВТ_Основа.РЛ.КомпенсацияБрокерФинанс КАК КомпенсацияБрокерФинанс,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0)
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) / Налогооблажение.НалоговаяСтавка
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаКаско,
	|	ЕСТЬNULL(ВТ_Основа.РЛ.КВКредит + СтраховыеПрограммы.КВКАСКО + СтраховыеПрограммы.КВОСАГО + СтраховыеПрограммы.КВGAP + СтраховыеПрограммы.КВМедиКАСКО + СтраховыеПрограммы.КВРАТ + СтраховыеПрограммы.КВНезависимаяГарантия + СтраховыеПрограммы.КВБезотзывнаяНезависимаяГарантия + СтраховыеПрограммы.КВМедицинскоеСтрахование + СтраховыеПрограммы.КВСтрахованиеЖизни + СтраховыеПрограммы.КВСтрахованиеИмущества + СтраховыеПрограммы.КВПрочее, ВТ_Основа.РЛ.КВКредит + ВТ_Основа.РЛ.КВКаско + ВТ_Основа.РЛ.КВОсаго + ВТ_Основа.РЛ.КВСЖ + ЕСТЬNULL(РЛ_ИСП.КВ, 0)) / Налогооблажение.НалоговаяСтавка КАК ВариантКаско,
	|	ВТ_Основа.ТипСтроки КАК СуммаОсаго,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ТОГДА ВЫБОР
	|					КОГДА ВариантыКомпенсацийПоМаркам.КомпенсацияБезНДС
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) * Налогооблажение.НалоговаяСтавка
	|								ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0)
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) / Налогооблажение.НалоговаяСтавка
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) / Налогооблажение.НалоговаяСтавка
	|			КОНЕЦ
	|	КОНЕЦ КАК ВариантОсаго,
	|	ВТ_Основа.РЛ КАК СуммаСтрахованиеЖизни,
	|	ВТ_Основа.РЛ.КВКредит КАК ВариантСтрахованиеЖизни,
	|	ВТ_Основа.РЛ.СуммаПродажи КАК ЦенаФакт,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|					ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|				ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|			КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ВЫБОР
	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|								ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|								ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|							ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВЫБОР
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|								ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|							КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|							ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|								ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦенаДоговора,
	|	ВТ_Основа.РЛ.СуммаПредоплаты КАК ПервоначальныйВзнос,
	|	ВТ_Основа.РЛ.ДатаПервоначальногоВзноса КАК ДатаПервоначальногоВзноса,
	|	ВТ_Основа.РЛ.БанкЛК КАК БанкЛК,
	|	ВЫБОР
	|		КОГДА ВТ_Основа.РЛ.Кредит
	|				ИЛИ ВТ_Основа.РЛ.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.Кредит)
	|			ТОГДА ВТ_Основа.РЛ.СчетИлиАвтоВКредит
	|	КОНЕЦ КАК КредитнаяСтоимость,
	|	ВТ_Основа.РЛ.ПрогнозСрокаПодготовкиАвтоВДнях КАК ПрогнозСрокаПодготовкиАвтоВДнях,
	|	ВТ_Основа.РЛ.ПрогнозСуммыРемонта КАК ПрогнозСуммыРемонта,
	|	ВТ_Основа.РЛ.ПрогнозСуммыДетейлинга КАК ПрогнозСуммыДетейлинга,
	|	ВТ_Основа.РЛ.ПрогнозируемаяЦенаПродажи КАК ПрогнозируемаяЦенаПродажи,
	|	ВТ_Основа.РЛ.ПрогнозСрокаПродажиАвтоВДнях КАК ПрогнозСрокаПродажиАвтоВДнях,
	|	ВТ_Основа.РЛ.ПрогнозСуммыМКЦ КАК ПрогнозСуммыМКЦ,
	|	ВТ_Основа.РЛ.ЦенаМинРыночнаяТрейдИн КАК ЦенаМинРыночнаяТрейдИн,
	|	ВТ_Основа.РЛ.ПланируемаяЦенаПродажиТрейдИн КАК ПланируемаяЦенаПродажиТрейдИн,
	|	ВТ_Основа.РЛ.ЦенаДКПТрейдИн КАК ЦенаДКПТрейдИн,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаGAP, 0) КАК ДатаРитейла_РЛ,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВGAP, 0) КАК СуммаИСП,
	|	ДолгОП.КоличествоДолгаОП КАК КоличествоДолгаОП,
	|	ЕСТЬNULL(ЗаказыАвто.Резерв, 0) КАК Резерв,
	|	ВТ_Поступление.ДатаПоступления КАК ДатаПоступленияВГК,
	|	ВЫБОР
	|		КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|				ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|				ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|				ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|				ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|			ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|		ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|	КОНЕЦ КАК ДатаФинансирования,
	|	ЕСТЬNULL(Хранение.ДатаПриемкиНаТекушийСклад, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПриемкиНаТекушийСклад,
	|	РАЗНОСТЬДАТ(ВТ_Поступление.ДатаПоступления, &Дата2, ДЕНЬ) КАК СрокХранения,
	|	ВЫБОР
	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|					И РАЗНОСТЬДАТ(&Дата2, ВТ_Основа.Дата, ДЕНЬ) < 90
	|			ТОГДА ""Да""
	|		ИНАЧЕ ""Нет""
	|	КОНЕЦ КАК ГарантияПИ,
	|	0 КАК БонусЗаМодель,
	|	0 КАК ЦелеваяДоходность,
	|	0 КАК БонусЗаШтуку,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|				ТОГДА ВТ_Поступление.ЦенаПоступления
	|			ИНАЧЕ ВТ_Поступление.ЦенаОферты
	|		КОНЕЦ, 0) * 0.00067 КАК СтоимостьСуточногоХранения,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ВЫБОР
	|						КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|							ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|						ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|					КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|							ТОГДА ВЫБОР
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|								КОНЕЦ
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|									КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ < &Дата2
	|			ТОГДА ЕСТЬNULL(ВЫБОР
	|						КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|							ТОГДА ВТ_Поступление.ЦенаПоступления
	|						ИНАЧЕ ВТ_Поступление.ЦенаОферты
	|					КОНЕЦ, 0) * 0.00067 * РАЗНОСТЬДАТ(ВЫБОР
	|						КОГДА ВЫБОР
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|									ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|								ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|							КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|							ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|									ТОГДА ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										КОНЕЦ
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ВЫБОР
	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|												ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|										ИНАЧЕ ВЫБОР
	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|												ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОНЕЦ
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ, &Дата2, ДЕНЬ)
	|		ИНАЧЕ 0
	|	КОНЕЦ + ЕСТЬNULL(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|				ТОГДА ВТ_Поступление.ЦенаПоступления
	|			ИНАЧЕ ВТ_Поступление.ЦенаОферты
	|		КОНЕЦ, 0) * 0.00067 * РАЗНОСТЬДАТ(ВЫБОР
	|			КОГДА ВЫБОР
	|					КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|						ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|					ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|				КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ВЫБОР
	|								КОГДА ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|									КОНЕЦ >= &Дата2
	|									ТОГДА &Дата2
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|									КОНЕЦ
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ВЫБОР
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|								КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|								ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ, ВЫБОР
	|			КОГДА ВЫБОР
	|					КОГДА ВЫБОР
	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|								ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|							ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|						КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|								ТОГДА ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|									КОНЕЦ
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|									ИНАЧЕ ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ > &Дата2
	|				ТОГДА &Дата2
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВЫБОР
	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|								ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|							ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|						КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|								ТОГДА ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|									КОНЕЦ
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|									ИНАЧЕ ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ, ДЕНЬ) КАК ОбщаяСтоимостьХранения,
	|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(ВТ_Основа.РЛ.Контрагент.ФормаСобственности, ЗаказыАвто.Заказ.Контрагент.ФормаСобственности)) КАК Tech_1,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|					ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|				ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|			КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ВЫБОР
	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|								ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|								ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|							ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВЫБОР
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|								ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|							КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|							ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|								ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Tech_2,
	|	ЕСТЬNULL(ВТ_Поступление.Комиссия, ЛОЖЬ) КАК Tech_3,
	|	ВТ_Основа.ТИ КАК Tech_4,
	|	НЕ(ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|			ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
	|			ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
	|			ИЛИ (ЕСТЬNULL(ВТ_Поступление.Комиссия, ЛОЖЬ)
	|				ИЛИ ВТ_Основа.ТИ)) КАК Tech_5,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаМедиКАСКО, """") КАК Tech_6,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидМедиКАСКО, """") КАК Tech_7,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияМедиКАСКО, """") КАК Tech_8,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаМедиКАСКО, 0) КАК Tech_9,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВМедиКАСКО, 0) КАК Tech_10,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаРАТ, """") КАК Tech_11,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидРАТ, """") КАК Tech_12,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияРАТ, """") КАК Tech_13,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаРАТ, 0) КАК Tech_14,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВРАТ, 0) КАК Tech_15,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаНезависимаяГарантия, """") КАК Tech_16,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидНезависимаяГарантия, """") КАК Tech_17,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияНезависимаяГарантия, """") КАК Tech_18,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаНезависимаяГарантия, 0) КАК Tech_19,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВНезависимаяГарантия, 0) КАК Tech_20,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаБезотзывнаяНезависимаяГарантия, """") КАК Tech_21,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидБезотзывнаяНезависимаяГарантия, """") КАК Tech_22,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияБезотзывнаяНезависимаяГарантия, """") КАК Tech_23,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаБезотзывнаяНезависимаяГарантия, 0) КАК Tech_24,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВБезотзывнаяНезависимаяГарантия, 0) КАК Tech_25,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаМедицинскоеСтрахование, """") КАК Tech_26,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидМедицинскоеСтрахование, """") КАК Tech_27,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияМедицинскоеСтрахование, """") КАК Tech_28,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаМедицинскоеСтрахование, 0) КАК Tech_29,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВМедицинскоеСтрахование, 0) КАК Tech_30,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаСтрахованиеЖизни, """") КАК Tech_31,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидСтрахованиеЖизни, """") КАК Tech_32,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияСтрахованиеЖизни, """") КАК Tech_33,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаСтрахованиеЖизни, 0) КАК Tech_34,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВСтрахованиеЖизни, 0) КАК Tech_35,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаСтрахованиеИмущества, """") КАК Tech_36,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидСтрахованиеИмущества, """") КАК Tech_37,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияСтрахованиеИмущества, """") КАК Tech_38,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаСтрахованиеИмущества, 0) КАК Tech_39,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВСтрахованиеИмущества, 0) КАК Tech_40,
	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаПрочее, """") КАК Tech_41,
	|	ЕСТЬNULL(СтраховыеПрограммы.ВидПрочее, """") КАК Tech_42,
	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияПрочее, """") КАК Tech_43,
	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаПрочее, 0) КАК Tech_44,
	|	ЕСТЬNULL(СтраховыеПрограммы.КВПрочее, 0) КАК Tech_45,
	|	ВТ_Основа.VIN_Матери КАК Tech_46,
	|	ВТ_Основа.РЛ.СуммаПродажи + ВТ_Основа.РЛ.СкидкаДополнительная КАК Tech_47,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|				ТОГДА ВТ_Поступление.ЦенаПоступления
	|			ИНАЧЕ ВТ_Поступление.ЦенаОферты
	|		КОНЕЦ, 0) * 0.00067 * РАЗНОСТЬДАТ(ВЫБОР
	|			КОГДА ВЫБОР
	|					КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|						ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|					ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|				КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ВЫБОР
	|								КОГДА ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|									КОНЕЦ >= &Дата2
	|									ТОГДА &Дата2
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|									КОНЕЦ
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ВЫБОР
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|								КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|								ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.БеспроцентныйПериодДней, ПериодыФакторингаАвтомобиль.БеспроцентныйПериодДней), ПериодыФакторингаМарка.БеспроцентныйПериодДней), ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ, ВЫБОР
	|			КОГДА ВЫБОР
	|					КОГДА ВЫБОР
	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|								ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|							ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|						КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|								ТОГДА ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|									КОНЕЦ
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|									ИНАЧЕ ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ > &Дата2
	|				ТОГДА &Дата2
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВЫБОР
	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|								ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|							ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|						КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|								ТОГДА ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|									КОНЕЦ
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|									ИНАЧЕ ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ, ДЕНЬ) КАК Tech_48,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ВЫБОР
	|						КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|							ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|						ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|					КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|							ТОГДА ВЫБОР
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|								КОНЕЦ
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|									КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ < &Дата2
	|			ТОГДА ЕСТЬNULL(ВЫБОР
	|						КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
	|							ТОГДА ВТ_Поступление.ЦенаПоступления
	|						ИНАЧЕ ВТ_Поступление.ЦенаОферты
	|					КОНЕЦ, 0) * 0.00067 * РАЗНОСТЬДАТ(ВЫБОР
	|						КОГДА ВЫБОР
	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|									ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
	|								ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
	|							КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
	|							ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|									ТОГДА ВЫБОР
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|										КОНЕЦ
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ВЫБОР
	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|												ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
	|										ИНАЧЕ ВЫБОР
	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|												ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаБанк.ОбщийПериодДней, ПериодыФакторингаАвтомобиль.ОбщийПериодДней), ПериодыФакторингаМарка.ОбщийПериодДней), ПериодыФакторингаМодель.ОбщийПериодДней), 0))
	|											КОНЕЦ
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ, &Дата2, ДЕНЬ)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Tech_49,
	|	ВТ_Основа.МенеджерАСП КАК Tech_50
	|ИЗ
	|	ВТ_Основа КАК ВТ_Основа
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.Значение КАК ВидАвто,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних(
	|					&Дата2,
	|					ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)
	|						И ТИПЗНАЧЕНИЯ(ВидЗначения) = ТИП(Перечисление.ДополнительнаяИнформацияАвтомобилей)) КАК АвтомобилиСрезПоследних) КАК ХарактеристикиАвто
	|		ПО ВТ_Основа.Автомобиль = ХарактеристикиАвто.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗаказыАвтомобилейОстатки.Автомобиль КАК Автомобиль,
	|			ЗаказыАвтомобилейОстатки.Заказ КАК Заказ,
	|			ЗаказыАвтомобилейОстатки.РезервОстаток КАК Резерв,
	|			Взаиморасчеты.СуммаОстаток КАК СуммаОстаток
	|		ИЗ
	|			РегистрНакопления.ЗаказыАвтомобилей.Остатки(
	|					&Дата2,
	|					НЕ Заказ.ПометкаУдаления
	|						И Заказ.Проведен
	|						И НЕ Заказ.Контрагент.НашаФирма
	|						И Заказ.ХозОперация <> ЗНАЧЕНИЕ(Справочник.Хозоперации.ЗаказНаАвтомобильОтмена)) КАК ЗаказыАвтомобилейОстатки
	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					СУММА(ВзаиморасчетыКомпанииОстатки.СуммаОстаток) КАК СуммаОстаток,
	|					ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|					ВзаиморасчетыКомпанииОстатки.Сделка КАК Сделка
	|				ИЗ
	|					РегистрНакопления.ВзаиморасчетыКомпании.Остатки КАК ВзаиморасчетыКомпанииОстатки
	|				
	|				СГРУППИРОВАТЬ ПО
	|					ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов,
	|					ВзаиморасчетыКомпанииОстатки.Сделка) КАК Взаиморасчеты
	|				ПО ЗаказыАвтомобилейОстатки.Заказ = Взаиморасчеты.Сделка) КАК ЗаказыАвто
	|		ПО ВТ_Основа.Автомобиль = ЗаказыАвто.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОстаткиАвтомобилейОбороты.Автомобиль КАК Автомобиль,
	|			МАКСИМУМ(ОстаткиАвтомобилейОбороты.Регистратор.Дата) КАК ДатаПриемкиНаТекушийСклад
	|		ИЗ
	|			РегистрНакопления.ОстаткиАвтомобилей.Обороты(, КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ), Регистратор, ) КАК ОстаткиАвтомобилейОбороты
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОстаткиАвтомобилейОбороты.Автомобиль) КАК Хранение
	|		ПО ВТ_Основа.Автомобиль = Хранение.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РабочийЛистДолгОтделаПродаж.Ссылка КАК Ссылка,
	|			СУММА(РабочийЛистДолгОтделаПродаж.Количество) КАК КоличествоДолгаОП
	|		ИЗ
	|			Документ.РабочийЛист.ДолгОтделаПродаж КАК РабочийЛистДолгОтделаПродаж
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РабочийЛистДолгОтделаПродаж.Ссылка) КАК ДолгОП
	|		ПО ВТ_Основа.РЛ.Ссылка = ДолгОП.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЦеныАвтомобилейСрезПоследних.Автомобиль КАК Автомобиль,
	|			ЦеныАвтомобилейСрезПоследних.Цена КАК Цена
	|		ИЗ
	|			РегистрСведений.ЦеныАвтомобилей.СрезПоследних(КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ), ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)) КАК ЦеныАвтомобилейСрезПоследних) КАК ЦеныАвто
	|		ПО ВТ_Основа.Автомобиль = ЦеныАвто.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			База.Автомобиль КАК Автомобиль,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 0
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ПрограммаКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 0
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ВидКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 0
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК КомпанияКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 0
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 0
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 1
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ПрограммаОСАГО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 1
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ВидОСАГО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 1
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК КомпанияОСАГО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 1
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаОСАГО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 1
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВОСАГО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 2
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ПрограммаGAP,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 2
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ВидGAP,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 2
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК КомпанияGAP,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 2
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаGAP,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 2
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВGAP,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 3
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ПрограммаМедиКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 3
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ВидМедиКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 3
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК КомпанияМедиКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 3
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаМедиКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 3
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВМедиКАСКО,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 4
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ПрограммаРАТ,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 4
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ВидРАТ,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 4
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК КомпанияРАТ,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 4
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаРАТ,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 4
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВРАТ,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 5
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ПрограммаНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 5
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ВидНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 5
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК КомпанияНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 5
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 5
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 6
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ПрограммаБезотзывнаяНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 6
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ВидБезотзывнаяНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 6
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК КомпанияБезотзывнаяНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 6
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаБезотзывнаяНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 6
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВБезотзывнаяНезависимаяГарантия,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 7
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ПрограммаМедицинскоеСтрахование,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 7
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ВидМедицинскоеСтрахование,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 7
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК КомпанияМедицинскоеСтрахование,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 7
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаМедицинскоеСтрахование,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 7
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВМедицинскоеСтрахование,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 8
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ПрограммаСтрахованиеЖизни,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 8
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ВидСтрахованиеЖизни,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 8
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК КомпанияСтрахованиеЖизни,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 8
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаСтрахованиеЖизни,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 8
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВСтрахованиеЖизни,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 9
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ПрограммаСтрахованиеИмущества,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 9
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ВидСтрахованиеИмущества,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 9
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК КомпанияСтрахованиеИмущества,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 9
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаСтрахованиеИмущества,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 9
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВСтрахованиеИмущества,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 10
	|						ТОГДА База.ПрограммаСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ПрограммаПрочее,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 10
	|						ТОГДА База.ВидСтрахования
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ВидПрочее,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 10
	|						ТОГДА База.СтраховаяКомпания
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК КомпанияПрочее,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 10
	|						ТОГДА База.СуммаСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаПрочее,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА База.НомерСтроки = 10
	|						ТОГДА База.КВСуммыСтрахования
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КВПрочее
	|		ИЗ
	|			(ВЫБРАТЬ
	|				РабочийЛистКредитногоОтделаСтраховыеПродукты.Ссылка.ДокументОснование.Автомобиль КАК Автомобиль,
	|				РабочийЛистКредитногоОтделаСтраховыеПродукты.ПрограммаСтрахования.ВидСтрахования.Порядок КАК НомерСтроки,
	|				РабочийЛистКредитногоОтделаСтраховыеПродукты.ПрограммаСтрахования КАК ПрограммаСтрахования,
	|				РабочийЛистКредитногоОтделаСтраховыеПродукты.ПрограммаСтрахования.ВидСтрахования КАК ВидСтрахования,
	|				РабочийЛистКредитногоОтделаСтраховыеПродукты.СтраховаяКомпания КАК СтраховаяКомпания,
	|				РабочийЛистКредитногоОтделаСтраховыеПродукты.СуммаСтрахования КАК СуммаСтрахования,
	|				РабочийЛистКредитногоОтделаСтраховыеПродукты.КВ КАК КВСуммыСтрахования
	|			ИЗ
	|				Документ.РабочийЛистКредитногоОтдела.СтраховыеПродукты КАК РабочийЛистКредитногоОтделаСтраховыеПродукты) КАК База
	|		
	|		СГРУППИРОВАТЬ ПО
	|			База.Автомобиль) КАК СтраховыеПрограммы
	|		ПО ВТ_Основа.Автомобиль = СтраховыеПрограммы.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Поступление КАК ВТ_Поступление
	|		ПО ВТ_Основа.Автомобиль = ВТ_Поступление.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПериодыФакторингаАМСрезПоследних.Марка КАК Марка,
	|			ПериодыФакторингаАМСрезПоследних.БеспроцентныйПериодДней КАК БеспроцентныйПериодДней,
	|			ПериодыФакторингаАМСрезПоследних.ОбщийПериодДней КАК ОбщийПериодДней
	|		ИЗ
	|			РегистрСведений.ПериодыФакторингаАМ.СрезПоследних(КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ), ) КАК ПериодыФакторингаАМСрезПоследних
	|		ГДЕ
	|			ПериодыФакторингаАМСрезПоследних.Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
	|			И ПериодыФакторингаАМСрезПоследних.Фактор = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			И ПериодыФакторингаАМСрезПоследних.Автомобиль = ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка)) КАК ПериодыФакторингаМарка
	|		ПО ВТ_Основа.Автомобиль.Модель.Марка = ПериодыФакторингаМарка.Марка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПериодыФакторингаАМСрезПоследних.Модель КАК Модель,
	|			ПериодыФакторингаАМСрезПоследних.БеспроцентныйПериодДней КАК БеспроцентныйПериодДней,
	|			ПериодыФакторингаАМСрезПоследних.ОбщийПериодДней КАК ОбщийПериодДней
	|		ИЗ
	|			РегистрСведений.ПериодыФакторингаАМ.СрезПоследних(КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ), ) КАК ПериодыФакторингаАМСрезПоследних
	|		ГДЕ
	|			ПериодыФакторингаАМСрезПоследних.Модель <> ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
	|			И ПериодыФакторингаАМСрезПоследних.Фактор = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			И ПериодыФакторингаАМСрезПоследних.Автомобиль = ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка)) КАК ПериодыФакторингаМодель
	|		ПО ВТ_Основа.Автомобиль.Модель = ПериодыФакторингаМодель.Модель
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РабочийЛистИныеСтраховыеПродукты.Ссылка.Ссылка КАК Ссылка,
	|			СУММА(РабочийЛистИныеСтраховыеПродукты.КВ) КАК КВ
	|		ИЗ
	|			Документ.РабочийЛист.ИныеСтраховыеПродукты КАК РабочийЛистИныеСтраховыеПродукты
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РабочийЛистИныеСтраховыеПродукты.Ссылка.Ссылка) КАК РЛ_ИСП
	|		ПО ВТ_Основа.РЛ = РЛ_ИСП.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			УпрощеннаяСистемаНалогообложенияСрезПоследних.Организация КАК Организация,
	|			1 + УпрощеннаяСистемаНалогообложенияСрезПоследних.СтавкаНДС.Ставка / 100 КАК НалоговаяСтавка
	|		ИЗ
	|			РегистрСведений.УпрощеннаяСистемаНалогообложения.СрезПоследних КАК УпрощеннаяСистемаНалогообложенияСрезПоследних) КАК Налогооблажение
	|		ПО ВТ_Основа.РЛ.Организация = Налогооблажение.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(ВариантыКомпенсацийПоМаркамСрезПоследних.Период) КАК Период,
	|			ВариантыКомпенсацийПоМаркамСрезПоследних.Марка КАК Марка,
	|			ВариантыКомпенсацийПоМаркамСрезПоследних.КомпенсацияБезНДС КАК КомпенсацияБезНДС
	|		ИЗ
	|			РегистрСведений.ВариантыКомпенсацийПоМаркам.СрезПоследних(&Дата2, МаркетинговаяПрограмма = ЗНАЧЕНИЕ(Справочник.МаркетинговыеПрограммы.ПустаяСсылка)) КАК ВариантыКомпенсацийПоМаркамСрезПоследних
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВариантыКомпенсацийПоМаркамСрезПоследних.Марка,
	|			ВариантыКомпенсацийПоМаркамСрезПоследних.КомпенсацияБезНДС) КАК ВариантыКомпенсацийПоМаркам
	|		ПО ВТ_Основа.Автомобиль.Модель.Марка = ВариантыКомпенсацийПоМаркам.Марка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗаказНаряд.Дата КАК Дата,
	|			ЗаказНаряд.Автомобиль КАК Автомобиль,
	|			СУММА(ЗаказНаряд.СуммаДокумента) КАК Сумма
	|		ИЗ
	|			Документ.ЗаказНаряд КАК ЗаказНаряд
	|		ГДЕ
	|			ЗаказНаряд.Проведен
	|			И НЕ ЗаказНаряд.ПометкаУдаления
	|			И ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
	|			И ЗаказНаряд.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.КоммерческоеДопОборудование)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаказНаряд.Автомобиль,
	|			ЗаказНаряд.Дата
	|		
	|		ИМЕЮЩИЕ
	|			НЕ СУММА(ЗаказНаряд.СуммаДокумента) ЕСТЬ NULL) КАК КоммерческоеДО
	|		ПО ВТ_Основа.Автомобиль = КоммерческоеДО.Автомобиль
	|			И (ВЫБОР
	|				КОГДА ДЕНЬ(ВТ_Основа.Дата) <= 14
	|					ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ВТ_Основа.Дата, МЕСЯЦ), ДЕНЬ, 14), ДЕНЬ)
	|				ИНАЧЕ КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ВТ_Основа.Дата, МЕСЯЦ), МЕСЯЦ, 1), ДЕНЬ, 14), ДЕНЬ)
	|			КОНЕЦ >= КоммерческоеДО.Дата)
	|			И (ВТ_Поступление.Автомобиль = КоммерческоеДО.Автомобиль)
	|			И (ВТ_Поступление.ДатаПоступления <= КоммерческоеДО.Дата)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПериодыФакторингаАМСрезПоследних.Автомобиль КАК Автомобиль,
	|			ПериодыФакторингаАМСрезПоследних.БеспроцентныйПериодДней КАК БеспроцентныйПериодДней,
	|			ПериодыФакторингаАМСрезПоследних.ОбщийПериодДней КАК ОбщийПериодДней
	|		ИЗ
	|			РегистрСведений.ПериодыФакторингаАМ.СрезПоследних(КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ), ) КАК ПериодыФакторингаАМСрезПоследних
	|		ГДЕ
	|			ПериодыФакторингаАМСрезПоследних.Автомобиль <> ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка)
	|			И ПериодыФакторингаАМСрезПоследних.Фактор = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК ПериодыФакторингаАвтомобиль
	|		ПО ВТ_Основа.Автомобиль = ПериодыФакторингаАвтомобиль.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПериодыФакторингаАМСрезПоследних.Марка КАК Марка,
	|			ПериодыФакторингаАМСрезПоследних.Фактор КАК Фактор,
	|			ПериодыФакторингаАМСрезПоследних.БеспроцентныйПериодДней КАК БеспроцентныйПериодДней,
	|			ПериодыФакторингаАМСрезПоследних.ОбщийПериодДней КАК ОбщийПериодДней
	|		ИЗ
	|			РегистрСведений.ПериодыФакторингаАМ.СрезПоследних(КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ), ) КАК ПериодыФакторингаАМСрезПоследних
	|		ГДЕ
	|			ПериодыФакторингаАМСрезПоследних.Автомобиль = ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка)
	|			И ПериодыФакторингаАМСрезПоследних.Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
	|			И ПериодыФакторингаАМСрезПоследних.Фактор <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК ПериодыФакторингаБанк
	|		ПО ВТ_Основа.Автомобиль.Модель.Марка = ПериодыФакторингаБанк.Марка
	|			И (ВТ_Основа.Автомобиль.БанкФинансирования = ПериодыФакторингаБанк.Фактор
	|				ИЛИ ВТ_Основа.Автомобиль.БанкОтгрузкиПоФинансированию = ПериодыФакторингаБанк.Фактор)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	// Уничтожение временных таблиц 	
	ЗапросУничтожить1 = Новый Запрос;	
	ЗапросУничтожить1.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросУничтожить1.Текст =  
	"УНИЧТОЖИТЬ ВТ_Дни";
	
	ЗапросУничтожить2 = Новый Запрос;	
	ЗапросУничтожить2.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросУничтожить2.Текст =  
	"УНИЧТОЖИТЬ ВТ_ОО"; 
	
	ЗапросУничтожить3 = Новый Запрос;	
	ЗапросУничтожить3.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросУничтожить3.Текст =  
	"УНИЧТОЖИТЬ ВТ_Строки"; 	

	ЗапросУничтожить4 = Новый Запрос;	
	ЗапросУничтожить4.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросУничтожить4.Текст =  
	"УНИЧТОЖИТЬ ВТ_ТИ"; 
	
	ЗапросУничтожить5 = Новый Запрос;	
	ЗапросУничтожить5.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросУничтожить5.Текст =  
	"УНИЧТОЖИТЬ ВТ_Поступление"; 	

	ЗапросУничтожить6 = Новый Запрос;	
	ЗапросУничтожить6.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросУничтожить6.Текст =  
	"УНИЧТОЖИТЬ ВТ_Основа"; 	
	
	// Дневной цикл 
	Пока Дата < НачалоДня(ТекущаяДата()) Цикл   
		
		ТекстовыйФайл = Новый ТекстовыйДокумент;			
		ИмяФайла = "Avto_na_skladah_max_" + Строка(Формат(Дата, "ДФ=yyyyMMdd")) + ".csv";		
		
		Запрос.УстановитьПараметр("Дата1", НачалоДня(Дата));
		Запрос.УстановитьПараметр("Дата2", КонецДня(Дата));
		СписокЧанганы = Новый СписокЗначений;
		СписокЧанганы.Добавить(Справочники.Автомобили.НайтиПоРеквизиту("VIN", "LS4ASE2A5RJ104624"));
		СписокЧанганы.Добавить(Справочники.Автомобили.НайтиПоРеквизиту("VIN", "LS4ASE2A7RA707123"));
		СписокЧанганы.Добавить(Справочники.Автомобили.НайтиПоРеквизиту("VIN", "LS4ASE2A5RJ106714"));
		СписокЧанганы.Добавить(Справочники.Автомобили.НайтиПоРеквизиту("VIN", "LS5A2DKR7RA016010"));		
		Запрос.УстановитьПараметр("Чанганы", СписокЧанганы);  
		СписокВидыАвто = Новый СписокЗначений;
		СписокВидыАвто.Добавить(Перечисления.ВидАвтомобиля.Новый);  
		СписокВидыАвто.Добавить(Перечисления.ВидАвтомобиля.ПараллельныйИмпорт);  
		СписокВидыАвто.Добавить(Перечисления.ВидАвтомобиля.ПодменныйАвтомобиль);  
		СписокВидыАвто.Добавить(Перечисления.ВидАвтомобиля.ТестовыйАвтомобиль);  
		СписокВидыАвто.Добавить(Перечисления.ВидАвтомобиля.АвтомобильСПробегом);  
		Запрос.УстановитьПараметр("ВидыАвто", СписокВидыАвто);		
		
		Выборка = Запрос.Выполнить().Выбрать();	 		
		
		Пока Выборка.Следующий() Цикл  
			СтрокаПорция =   
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.Дата, "ДЛФ=DT")))                                                       + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.ДилерскийЦентр))                                                               + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Подразделение))                                                                + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Склад))                                                                        + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Автомобиль))                                                                   + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.ВидАвтомобиля))                                                                + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.VIN))                                                                          + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Бренд))                                                                        + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Модель))                                                                       + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.ВариантКомплектации))                                                          + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ГодВыпуска, "ДЛФ=DT")))                                                 + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.СобственникАвтомобиля))                                                        + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Отчитан))                                                                      + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.БлокировкаПродажи))                                                            + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.РабочийЛист))                                                                  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Реализация))                                                                   + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.Количество_Остаток_Оборот, "ЧН=0")))                                    + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.Сумма_Остаток_Оборот, "ЧН=0")))                                         + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ДатаРитейла, "ДЛФ=DT")))                                                + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ДатаРитейла2, "ДЛФ=DT")))                                               + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СкидкаПриПокупкеВТрейдИн, "ЧН=0")))                                     + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СкидкаПриПокупкеВКредит, "ЧН=0")))                                      + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.НомерДатаПерезачета))                                                          + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Оплачен))                                                                      + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ДатаОплаты, "ДЛФ=DT")))                                                 + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.РазмерСкидки, "ЧН=0")))                                                 + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ОжидаемаяДатаПолученияКомпенсации, "ДЛФ=DT")))                          + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.РазмерКомпенсации, "ЧН=0")))                                            + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.НаличныйРасчет))                                                               + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.БезналичныйРасчет))                                                            + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Кредит))                                                                       + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Обмен))                                                                        + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Лизинг))                                                                       + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ПредоплатаЗаАМ, "ЧН=0")))                                               + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ДатаПредоплатыЗаАМ, "ДЛФ=DT")))                                         + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Покупатель))                                                                   + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.РРЦ, "ЧН=0")))                                                          + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.Инвойс, "ЧН=0")))                                                       + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СкидкаТрейдИнПлан, "ЧН=0")))                                            + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СкидкаТрейдИнФакт, "ЧН=0")))                                            + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СкидкаТрейдИн2План, "ЧН=0")))                                           + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СкидкаТрейдИн2Факт, "ЧН=0")))                                           + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СкидкаСубсидияКредитПлан, "ЧН=0")))                                     + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СкидкаСубсидияКредитФакт, "ЧН=0")))                                     + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СкидкаПоПрограммамЛояльности, "ЧН=0")))                                 + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СкидкаПоСпецПрограмме, "ЧН=0")))                                        + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СкидкаРозничная, "ЧН=0")))                                              + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СкидкаДополнительная, "ЧН=0")))                                         + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СтоимостьДопОборудования_Маркетинг, "ЧН=0")))                           + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СтоимостьДопОборудования, "ЧН=0")))                                     + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ПлановаяСтоимостьДО, "ЧН=0")))                                          + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СебестоимостьДО, "ЧН=0")))                                              + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СебестоимостьДО_Комплектации, "ЧН=0")))                                 + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СуммаДО, "ЧН=0")))                                                      + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ЦенаДопПоПрайсу, "ЧН=0")))                                              + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ПредоплатаТО, "ЧН=0")))                                                 + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.КомпенсацияТрейдИНРетроспективная, "ЧН=0")))                            + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.КомпенсацияСубсидияКредитРетроспективная, "ЧН=0")))                     + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.КомпенсацияПоПрограммамЛояльностиРетроспективная, "ЧН=0")))             + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.КомпенсацияРозничнаяРетроспективная, "ЧН=0")))                          + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.КомпенсацияТрейдИН2Ретроспективная, "ЧН=0")))                           + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.КомпенсацияРетроспективная, "ЧН=0")))                                   + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля, "ЧН=0")))  + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СуммаКомпенсации, "ЧН=0")))                                             + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.КомпенсацияВИнвойсе, "ЧН=0")))                                          + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.КомпенсацияБрокерФинанс, "ЧН=0")))                                      + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СуммаКаско, "ЧН=0")))                                                   + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.ВариантКаско))                                                                 + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СуммаОсаго, "ЧН=0")))                                                   + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.ВариантОсаго))                                                                 + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СуммаСтрахованиеЖизни, "ЧН=0")))                                        + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.ВариантСтрахованиеЖизни))                                                      + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ЦенаФакт, "ЧН=0")))                                                     + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ЦенаДоговора, "ЧН=0")))                                                 + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ПервоначальныйВзнос, "ЧН=0")))                                          + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ДатаПервоначальногоВзноса, "ДЛФ=DT")))                                  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.БанкЛК))                                                                       + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.КредитнаяСтоимость, "ЧН=0")))                                           + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ПрогнозСрокаПодготовкиАвтоВДнях, "ЧН=0")))                              + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ПрогнозСуммыРемонта, "ЧН=0")))                                          + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ПрогнозСуммыДетейлинга, "ЧН=0")))                                       + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ПрогнозируемаяЦенаПродажи, "ЧН=0")))                                    + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ПрогнозСрокаПродажиАвтоВДнях, "ЧН=0")))                                 + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ПрогнозСуммыМКЦ, "ЧН=0")))                                              + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ЦенаМинРыночнаяТрейдИн, "ЧН=0")))                                       + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ПланируемаяЦенаПродажиТрейдИн, "ЧН=0")))                                + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ЦенаДКПТрейдИн, "ЧН=0")))                                               + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ДатаРитейла_РЛ, "ДЛФ=DT")))                                             + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СуммаИСП, "ЧН=0")))                                                     + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.КоличествоДолгаОП, "ЧН=0")))                                            + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Резерв))                                                                       + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ДатаПоступленияВГК, "ДЛФ=DT")))                                         + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ДатаФинансирования, "ДЛФ=DT")))                                         + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ДатаПриемкиНаТекушийСклад, "ДЛФ=DT")))                                  + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СрокХранения, "ЧН=0")))                                                 + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.ГарантияПИ))                                                                   + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.БонусЗаМодель, "ЧН=0")))                                                + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ЦелеваяДоходность, "ЧН=0")))                                            + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.БонусЗаШтуку, "ЧН=0")))                                                 + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СтоимостьСуточногоХранения, "ЧН=0")))                                   + ";" +
			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ОбщаяСтоимостьХранения, "ЧН=0")))		                                  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_1))																		  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_2))														 				  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_3))														 				  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_4))																		  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_5))																		  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_6))																		  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_7))																		  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_8))																		  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_9))																		  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_10))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_11))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_12))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_13))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_14))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_15))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_16))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_17))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_18))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_19))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_20))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_21))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_22))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_23))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_24))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_25))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_26))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_27))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_28))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_29))																	  + ";" +			
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_30))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_31))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_32))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_33))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_34))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_35))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_36))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_37))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_38))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_39))																	  + ";" +			
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_40))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_41))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_42))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_43))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_44))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_45))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_46))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_47))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_48))																	  + ";" +
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_49))																	  + ";" +						
			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_50));    
			ТекстовыйФайл.ДобавитьСтроку(СтрокаПорция);  
		КонецЦикла;	 
		
		Попытка
			ТекстовыйФайл.Записать(ГдеСоздавать + ИмяФайла); 
		Исключение
		КонецПопытки; 
		
		ЗапросУничтожить1.Выполнить();
		ЗапросУничтожить2.Выполнить();
		ЗапросУничтожить3.Выполнить();
		ЗапросУничтожить4.Выполнить();		
		ЗапросУничтожить5.Выполнить();
		ЗапросУничтожить6.Выполнить();
				
		Дата = Дата + 86400;  
	КонецЦикла;   
	
	УдалитьФайлы(ГдеСоздавать, МаскаФайла); 
	ОбъединитьФайлы(ГдеСоздавать + "Avto_na_skladah_max_*", ГдеСоздавать + МаскаФайла);
	УдалитьФайлы(ГдеСоздавать, "Avto_na_skladah_max_*");   
	//Иванченко 20260408 ++   
	//Иванченко 20260525 ++
	//ВыгрузкаСкладаАвтоС2024ВФайлCSV();     
	//Иванченко 20260525 --
	//Иванченко 20260408 --
КонецПроцедуры
//Иванченко 20260309 --

//Иванченко 20260525 ++
#Область Заморожено
//Иванченко 20260408 ++
//Процедура ВыгрузкаСкладаАвтоС2024ВФайлCSV() Экспорт     
//	ГдеСоздавать = "\\1cserver\powerbi\sklan_auto_debug\";	
//	//ГдеСоздавать = "C:\Users\ivanchenko_ii\Downloads\";
//	МаскаФайла = "Avto_na_skladah_max.csv";	
//	ФайлШапки = Новый ТекстовыйДокумент;	
//	МассивФайлов = НайтиФайлы(ГдеСоздавать, МаскаФайла); 
//	
//	Если МассивФайлов.Количество() = 0 Тогда  
//		Шапка = "Дата;ДилерскийЦентр;Подразделение;Склад;Автомобиль;ВидАвтомобиля;VIN;Бренд;Модель;ВариантКомплектации;ГодВыпуска;СобственникАвтомобиля;Отчитан;БлокировкаПродажи;РабочийЛист;Реализация;Количество_Остаток_Оборот;Сумма_Остаток_Оборот;ДатаРитейла;ДатаРитейла2;СкидкаПриПокупкеВТрейдИн;СкидкаПриПокупкеВТрейдИн;НомерДатаПерезачета;Оплачен;ДатаОплаты;РазмерСкидки;ОжидаемаяДатаПолученияКомпенсации;РазмерКомпенсации;НаличныйРасчет;БезналичныйРасчет;Кредит;Обмен;Лизинг;ПредоплатаЗаАМ;ДатаПредоплатыЗаАМ;Покупатель;РРЦ;Инвойс;СкидкаТрейдИнПлан;СкидкаТрейдИнФакт;СкидкаТрейдИн2План;СкидкаТрейдИн2Факт;СкидкаСубсидияКредитПлан;СкидкаСубсидияКредитФакт;СкидкаПоПрограммамЛояльности;СкидкаПоСпецПрограмме;СкидкаРозничная;СкидкаДополнительная;СтоимостьДопОборудования_Маркетинг;СтоимостьДопОборудования;ПлановаяСтоимостьДО;СебестоимостьДО;СебестоимостьДО_Комплектации;СуммаДО;ЦенаДопПоПрайсу;ПредоплатаТО;КомпенсацияТрейдИНРетроспективная;КомпенсацияСубсидияКредитРетроспективная;КомпенсацияПоПрограммамЛояльностиРетроспективная;КомпенсацияРозничнаяРетроспективная;КомпенсацияТрейдИН2Ретроспективная;КомпенсацияРетроспективная;КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля;СуммаКомпенсации;КомпенсацияВИнвойсе;КомпенсацияБрокерФинанс;СуммаКаско;ВариантКаско;СуммаОсаго;ВариантОсаго;СуммаСтрахованиеЖизни;ВариантСтрахованиеЖизни;ЦенаФакт;ЦенаДоговора;ПервоначальныйВзнос;ДатаПервоначальногоВзноса;БанкЛК;КредитнаяСтоимость;ПрогнозСрокаПодготовкиАвтоВДнях;ПрогнозСуммыРемонта;ПрогнозСуммыДетейлинга;ПрогнозируемаяЦенаПродажи;ПрогнозСрокаПродажиАвтоВДнях;ПрогнозСуммыМКЦ;ЦенаМинРыночнаяТрейдИн;ПланируемаяЦенаПродажиТрейдИн;ЦенаДКПТрейдИн;ДатаРитейла_РЛ;СуммаИСП;КоличествоДолгаОП;Резерв;ДатаПоступленияВГК;ДатаФинансирования;ДатаПриемкиНаТекушийСклад;СрокХранения;ГарантияПИ;БонусЗаМодель;ЦелеваяДоходность;БонусЗаШтуку;СтоимостьСуточногоХранения;ОбщаяСтоимостьХранения;Tech_1;Tech_2;Tech_3;Tech_4;Tech_5;Tech_6;Tech_7;Tech_8;Tech_9;Tech_10;Tech_11;Tech_12;Tech_13;Tech_14;Tech_15;Tech_16;Tech_17;Tech_18;Tech_19;Tech_20;Tech_21;Tech_22;Tech_23;Tech_24;Tech_25;Tech_26;Tech_27;Tech_28;Tech_29;Tech_30;Tech_31;Tech_32;Tech_33;Tech_34;Tech_35;Tech_36;Tech_37;Tech_38;Tech_39;Tech_40;Tech_41;Tech_42;Tech_43;Tech_44;Tech_45;Tech_46;Tech_47;Tech_48;Tech_49;Tech_50";
//		ФайлШапки.ВставитьСтроку(1, Шапка);
//		Дата = '20240101'; 		
//	Иначе
//		ФайлШапки.Прочитать(ГдеСоздавать + МаскаФайла);
//		ФайлШапки.Записать(ГдеСоздавать + "Avto_na_skladah_backup.csv"); 
//		ЧтениеФайлаВыгрузки = Новый ЧтениеТекста;	
//		ЧтениеФайлаВыгрузки.Открыть(ГдеСоздавать + МаскаФайла);  
//		СтрокаФайлаВыгрузки = ЧтениеФайлаВыгрузки.ПрочитатьСтроку();
//		
//		Пока СтрокаФайлаВыгрузки <> Неопределено Цикл;  
//			
//			Попытка
//				ПоследняяДата = НачалоДня(Дата(Лев(СтрокаФайлаВыгрузки, 19)));    
//			Исключение	
//			КонецПопытки;  
//			
//			СтрокаФайлаВыгрузки = ЧтениеФайлаВыгрузки.ПрочитатьСтроку();			
//		КонецЦикла;	 
//		
//		ЧтениеФайлаВыгрузки.Закрыть();               
//		
//		Если ПоследняяДата <> Неопределено Тогда	
//			Дата = ПоследняяДата + 86400;	
//		Иначе 
//			Дата = НачалоДня(ТекущаяДата() - 86400); 
//		КонецЕсли; 
//		
//	КонецЕсли; 	
//	
//	ФайлШапки.Записать(ГдеСоздавать + "Avto_na_skladah_max_0.csv"); 
//		
//	// Запаковка ВТ регистра во временную таблицу 
//	Запрос = Новый Запрос;   
//	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
//	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;	
//	Запрос.Текст = 
//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ПроизводственныйКалендарь.ДатаКалендаря КАК День
//	|ПОМЕСТИТЬ ВТ_Дни
//	|ИЗ
//	|	РегистрСведений.DMS_ПроизводственныйКалендарь КАК ПроизводственныйКалендарь
//	|ГДЕ
//	|	ПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &Дата1 И &Дата2
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВТ_Дни.День КАК День,
//	|	ОстаткиАвтомобилейОстаткиИОбороты.СкладКомпании КАК Склад,
//	|	ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль КАК Автомобиль,
//	|	СУММА(ВЫБОР
//	|			КОГДА ОстаткиАвтомобилейОстаткиИОбороты.Период = &Дата1
//	|				ТОГДА ОстаткиАвтомобилейОстаткиИОбороты.КоличествоКонечныйОстаток
//	|			ИНАЧЕ ВЫБОР
//	|					КОГДА ОстаткиАвтомобилейОстаткиИОбороты.Период <= ВТ_Дни.День
//	|						ТОГДА ОстаткиАвтомобилейОстаткиИОбороты.КоличествоОборот
//	|					ИНАЧЕ 0
//	|				КОНЕЦ
//	|		КОНЕЦ) КАК Количество,
//	|	СУММА(ОстаткиАвтомобилейОстаткиИОбороты.СуммаКонечныйОстаток) КАК Сумма
//	|ПОМЕСТИТЬ ВТ_ОО
//	|ИЗ
//	|	РегистрНакопления.ОстаткиАвтомобилей.ОстаткиИОбороты(&Дата1, &Дата2, День, , ) КАК ОстаткиАвтомобилейОстаткиИОбороты,
//	|	ВТ_Дни КАК ВТ_Дни
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ОстаткиАвтомобилейОстаткиИОбороты.СкладКомпании,
//	|	ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль,
//	|	ВТ_Дни.День
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	КОНЕЦПЕРИОДА(ВТ_ОО.День, ДЕНЬ) КАК Дата,
//	|	ВТ_ОО.Склад КАК Склад,
//	|	ВТ_ОО.Автомобиль КАК Автомобиль,
//	|	ВТ_ОО.Количество КАК Количество,
//	|	ВТ_ОО.Сумма КАК Сумма,
//	|	""Склад"" КАК ТипСтроки
//	|ПОМЕСТИТЬ ВТ_Строки
//	|ИЗ
//	|	ВТ_ОО КАК ВТ_ОО
//	|ГДЕ
//	|	ВТ_ОО.Количество > 0
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	РабочийЛист.АвтомобильТрейдИн КАК АвтомобильТрейдИн,
//	|	МАКСИМУМ(РабочийЛист.Ссылка) КАК Ссылка
//	|ПОМЕСТИТЬ ВТ_ТИ
//	|ИЗ
//	|	ВТ_Строки КАК ВТ_Строки
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РабочийЛист КАК РабочийЛист
//	|		ПО ВТ_Строки.Автомобиль = РабочийЛист.АвтомобильТрейдИн
//	|ГДЕ
//	|	НЕ РабочийЛист.ПометкаУдаления
//	|	И РабочийЛист.Проведен
//	|	И РабочийЛист.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Продажа)
//	|	И РабочийЛист.ПоступлениеАвтоТрэйдИн <> ЗНАЧЕНИЕ(Документ.ПоступлениеАвтомобилей.ПустаяСсылка)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	РабочийЛист.АвтомобильТрейдИн
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ЕСТЬNULL(ВсеПоступления.Поступление.Дата, ВсеПоступления.ОтветственноеХранение.Дата) КАК ДатаПоступления,
//	|	ВсеПоступления.Автомобиль КАК Автомобиль,
//	|	ЕСТЬNULL(ВсеПоступления.Поступление, ВсеПоступления.ОтветственноеХранение) КАК ДокументПоступления,
//	|	ВЫБОР
//	|		КОГДА ОстаткиАвтомобилейОстаткиИОбороты.Регистратор = ОстаткиАвтомобилейОстаткиИОбороты.Партия
//	|			ТОГДА ОстаткиАвтомобилейОстаткиИОбороты.Регистратор.СуммаОферты
//	|		ИНАЧЕ ВсеПоступления.Поступление.СуммаОферты
//	|	КОНЕЦ КАК ЦенаОферты,
//	|	ЕСТЬNULL(ВЫБОР
//	|			КОГДА ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|					ИЛИ ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.GAC)
//	|					ИЛИ ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|					ИЛИ ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль В (&Чанганы)
//	|				ТОГДА РассчетныйИнвойсСрезПоследних.ИнвойсРассчетный
//	|		КОНЕЦ, ВЫБОР
//	|			КОГДА ВсеПоступления.ТестовыйЧАР
//	|				ТОГДА ОстаткиАвтомобилейОстаткиИОбороты.СуммаКонечныйОстаток
//	|			ИНАЧЕ ОстаткиАвтомобилейОстаткиИОбороты.СуммаКонечныйОстаток + ЕСТЬNULL(Корректировки.СуммаКорректировки, 0)
//	|		КОНЕЦ) * ВЫБОР
//	|		КОГДА ВсеПоступления.ВидАвто В (&ВидыАвто)
//	|				И ЕСТЬNULL(ВсеПоступления.ОтветственноеХранение.Контрагент.ФормаСобственности, ВсеПоступления.Поступление.Контрагент.ФормаСобственности) = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЮридическоеЛицо)
//	|				И ЕСТЬNULL(ВсеПоступления.ОтветственноеХранение.ХозОперация, ВсеПоступления.Поступление.ХозОперация) <> ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеАвтомобилейКомиссия)
//	|				И ЕСТЬNULL(ВсеПоступления.ОтветственноеХранение.Дата, ВсеПоступления.Поступление.Дата) <= ДАТАВРЕМЯ(2026, 1, 1)
//	|			ТОГДА 1.02
//	|		ИНАЧЕ 1
//	|	КОНЕЦ КАК ЦенаПоступления,
//	|	ЕСТЬNULL(ВсеПоступления.Поступление.ХозОперация, ВсеПоступления.ОтветственноеХранение.ХозОперация) = ЗНАЧЕНИЕ(Справочник.ХозОперации.ВводОстатковАвтомобилейПереданныхНаКомиссию)
//	|		ИЛИ ЕСТЬNULL(ВсеПоступления.Поступление.ХозОперация, ВсеПоступления.ОтветственноеХранение.ХозОперация) = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеАвтомобилейКомиссия) КАК Комиссия,
//	|	ВсеПоступления.ВидАвто КАК ВидАвто
//	|ПОМЕСТИТЬ ВТ_Поступление
//	|ИЗ
//	|	(ВЫБРАТЬ
//	|		ОстаткиАвтомобилейОбороты.Автомобиль КАК Автомобиль,
//	|		АвтомобилиСрезПоследних.Значение КАК ВидАвто,
//	|		ВЫБОР
//	|			КОГДА (ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|					ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.GAC)
//	|					ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|					ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|					ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET))
//	|					И АвтомобилиСрезПоследних.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ТестовыйАвтомобиль)
//	|				ТОГДА МИНИМУМ(ВЫБОР
//	|							КОГДА ОстаткиАвтомобилейОбороты.СтатусПартии = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварОтветственноеХранение)
//	|								ТОГДА ОстаткиАвтомобилейОбороты.Партия
//	|						КОНЕЦ)
//	|			ИНАЧЕ МАКСИМУМ(ВЫБОР
//	|						КОГДА ОстаткиАвтомобилейОбороты.СтатусПартии = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварОтветственноеХранение)
//	|							ТОГДА ОстаткиАвтомобилейОбороты.Партия
//	|					КОНЕЦ)
//	|		КОНЕЦ КАК ОтветственноеХранение,
//	|		ВЫБОР
//	|			КОГДА (ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|					ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.GAC)
//	|					ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|					ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|					ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET))
//	|					И АвтомобилиСрезПоследних.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ТестовыйАвтомобиль)
//	|				ТОГДА МИНИМУМ(ВЫБОР
//	|							КОГДА ОстаткиАвтомобилейОбороты.СтатусПартии <> ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварОтветственноеХранение)
//	|									И ОстаткиАвтомобилейОбороты.Партия.ХозОперация <> ЗНАЧЕНИЕ(Справочник.ХозОперации.ПереходВСобственностьАвтомобилей)
//	|								ТОГДА ОстаткиАвтомобилейОбороты.Партия
//	|						КОНЕЦ)
//	|			ИНАЧЕ МАКСИМУМ(ВЫБОР
//	|						КОГДА ОстаткиАвтомобилейОбороты.СтатусПартии <> ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварОтветственноеХранение)
//	|								И ОстаткиАвтомобилейОбороты.Партия.ХозОперация <> ЗНАЧЕНИЕ(Справочник.ХозОперации.ПереходВСобственностьАвтомобилей)
//	|							ТОГДА ОстаткиАвтомобилейОбороты.Партия
//	|					КОНЕЦ)
//	|		КОНЕЦ КАК Поступление,
//	|		(ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|			ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.GAC)
//	|			ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|			ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|			ИЛИ ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET))
//	|			И АвтомобилиСрезПоследних.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ТестовыйАвтомобиль) КАК ТестовыйЧАР
//	|	ИЗ
//	|		РегистрНакопления.ОстаткиАвтомобилей.Обороты(
//	|				,
//	|				КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
//	|				Регистратор,
//	|				НЕ Партия.ПометкаУдаления
//	|					И Партия.Проведен
//	|					И НЕ Партия.Контрагент.НашаФирма
//	|					И Автомобиль В
//	|						(ВЫБРАТЬ
//	|							ВТ_Строки.Автомобиль
//	|						ИЗ
//	|							ВТ_Строки)
//	|					И НЕ Партия.Контрагент В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.Контрагенты.НашиФирмы))) КАК ОстаткиАвтомобилейОбороты
//	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних(
//	|					КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
//	|					ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)
//	|						И ТИПЗНАЧЕНИЯ(ВидЗначения) = ТИП(Перечисление.ДополнительнаяИнформацияАвтомобилей)) КАК АвтомобилиСрезПоследних
//	|			ПО ОстаткиАвтомобилейОбороты.Автомобиль = АвтомобилиСрезПоследних.Автомобиль
//	|	
//	|	СГРУППИРОВАТЬ ПО
//	|		ОстаткиАвтомобилейОбороты.Автомобиль,
//	|		АвтомобилиСрезПоследних.Значение,
//	|		ОстаткиАвтомобилейОбороты.Автомобиль.Модель.Марка) КАК ВсеПоступления
//	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	|			ОстаткиАвтомобилейОбороты.Автомобиль КАК Автомобиль,
//	|			СУММА(ОстаткиАвтомобилейОбороты.СуммаОборот) КАК СуммаКорректировки
//	|		ИЗ
//	|			РегистрНакопления.ОстаткиАвтомобилей.Обороты(
//	|					,
//	|					,
//	|					Регистратор,
//	|					НЕ Партия.ПометкаУдаления
//	|						И Партия.Проведен) КАК ОстаткиАвтомобилейОбороты
//	|		ГДЕ
//	|			НЕ ОстаткиАвтомобилейОбороты.Регистратор.ПометкаУдаления
//	|			И ОстаткиАвтомобилейОбороты.Регистратор.Проведен
//	|			И ОстаткиАвтомобилейОбороты.Регистратор ССЫЛКА Документ.КорректировкаПоступленияАвтомобилей
//	|		
//	|		СГРУППИРОВАТЬ ПО
//	|			ОстаткиАвтомобилейОбороты.Автомобиль) КАК Корректировки
//	|		ПО ВсеПоступления.Автомобиль = Корректировки.Автомобиль
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей.ОстаткиИОбороты(, КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ), Регистратор, , ) КАК ОстаткиАвтомобилейОстаткиИОбороты
//	|		ПО ВсеПоступления.Автомобиль = ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль
//	|			И (ЕСТЬNULL(ВсеПоступления.Поступление, ВсеПоступления.ОтветственноеХранение) = ОстаткиАвтомобилейОстаткиИОбороты.Регистратор)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РассчетныйИнвойс.СрезПоследних КАК РассчетныйИнвойсСрезПоследних
//	|		ПО ВсеПоступления.Автомобиль = РассчетныйИнвойсСрезПоследних.Автомобиль
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВТ_Строки.Дата КАК Дата,
//	|	ВТ_Строки.Склад КАК Склад,
//	|	ВТ_Строки.Автомобиль КАК Автомобиль,
//	|	МАКСИМУМ(ВЫБОР
//	|			КОГДА РабочийЛист.Статус <> ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Отказ)
//	|				ТОГДА РабочийЛист.Ссылка
//	|		КОНЕЦ) КАК РЛ,
//	|	ВТ_Строки.Количество КАК Количество,
//	|	ВТ_Строки.Сумма КАК Сумма,
//	|	ВЫБОР
//	|		КОГДА ВТ_ТИ.АвтомобильТрейдИн ЕСТЬ NULL
//	|			ТОГДА ЛОЖЬ
//	|		ИНАЧЕ ИСТИНА
//	|	КОНЕЦ КАК ТИ,
//	|	ЕСТЬNULL(СОКРЛП(ВТ_ТИ.Ссылка.ФамилияПриемщика.Наименование), """") КАК МенеджерАСП,
//	|	СОКРЛП(ВТ_ТИ.Ссылка.Автомобиль.VIN) КАК VIN_Матери,
//	|	ВТ_Строки.ТипСтроки КАК ТипСтроки
//	|ПОМЕСТИТЬ ВТ_Основа
//	|ИЗ
//	|	ВТ_Строки КАК ВТ_Строки
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТИ КАК ВТ_ТИ
//	|		ПО ВТ_Строки.Автомобиль = ВТ_ТИ.Ссылка.АвтомобильТрейдИн
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РабочийЛист КАК РабочийЛист
//	|		ПО ВТ_Строки.Дата >= РабочийЛист.Дата
//	|			И ВТ_Строки.Автомобиль = РабочийЛист.Автомобиль
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВТ_Строки.Дата,
//	|	ВТ_Строки.Склад,
//	|	ВТ_Строки.Автомобиль,
//	|	ВТ_Строки.Количество,
//	|	ВТ_Строки.Сумма,
//	|	ЕСТЬNULL(СОКРЛП(ВТ_ТИ.Ссылка.ФамилияПриемщика.Наименование), """"),
//	|	СОКРЛП(ВТ_ТИ.Ссылка.Автомобиль.VIN),
//	|	ВТ_Строки.ТипСтроки,
//	|	ВЫБОР
//	|		КОГДА ВТ_ТИ.АвтомобильТрейдИн ЕСТЬ NULL
//	|			ТОГДА ЛОЖЬ
//	|		ИНАЧЕ ИСТИНА
//	|	КОНЕЦ
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ВТ_Основа.Дата КАК Дата,
//	|	ВТ_Основа.Склад.Подразделение.ДилерскийЦентр КАК ДилерскийЦентр,
//	|	ВТ_Основа.Склад.Подразделение.Родитель КАК Подразделение,
//	|	ВТ_Основа.Склад КАК Склад,
//	|	ВТ_Основа.Автомобиль КАК Автомобиль,
//	|	ХарактеристикиАвто.ВидАвто КАК ВидАвтомобиля,
//	|	ВТ_Основа.Автомобиль.VIN КАК VIN,
//	|	ВТ_Основа.Автомобиль.Модель.Марка КАК Бренд,
//	|	ВТ_Основа.Автомобиль.Модель КАК Модель,
//	|	ВТ_Основа.Автомобиль.ВариантКомплектации КАК ВариантКомплектации,
//	|	ГОД(ВТ_Основа.Автомобиль.ГодВыпуска) КАК ГодВыпуска,
//	|	ВТ_Основа.РЛ.ВладелецАвто КАК СобственникАвтомобиля,
//	|	ВЫБОР
//	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
//	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
//	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
//	|			ТОГДА ВЫБОР
//	|					КОГДА ВТ_Основа.Автомобиль.Модель.Марка.КомпенсацияБезНДС
//	|						ТОГДА ВЫБОР
//	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
//	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0)
//	|								ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка) / Налогооблажение.НалоговаяСтавка + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0)
//	|							КОНЕЦ
//	|					ИНАЧЕ ВЫБОР
//	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
//	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0)
//	|							ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0)) / Налогооблажение.НалоговаяСтавка + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0)
//	|						КОНЕЦ
//	|				КОНЕЦ
//	|		ИНАЧЕ ВЫБОР
//	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
//	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) + ВЫБОР
//	|							КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
//	|								ТОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
//	|							ИНАЧЕ ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
//	|						КОНЕЦ
//	|				ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0)) / Налогооблажение.НалоговаяСтавка + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) + ВЫБОР
//	|						КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
//	|							ТОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
//	|						ИНАЧЕ ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
//	|					КОНЕЦ
//	|			КОНЕЦ
//	|	КОНЕЦ КАК Отчитан,
//	|	ВЫБОР
//	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
//	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
//	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
//	|			ТОГДА ВЫБОР
//	|					КОГДА ВТ_Основа.Автомобиль.Модель.Марка.КомпенсацияБезНДС
//	|						ТОГДА ВЫБОР
//	|								КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка <= 0
//	|									ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0)
//	|								ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка) / Налогооблажение.НалоговаяСтавка + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0)
//	|							КОНЕЦ
//	|					ИНАЧЕ ВЫБОР
//	|							КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
//	|								ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0)
//	|							ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0)) / Налогооблажение.НалоговаяСтавка + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0)
//	|						КОНЕЦ
//	|				КОНЕЦ
//	|		ИНАЧЕ ВЫБОР
//	|				КОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) <= 0
//	|					ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) + ВЫБОР
//	|							КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
//	|								ТОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
//	|							ИНАЧЕ ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
//	|						КОНЕЦ
//	|				ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.СтоимостьДОФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаРозничная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаАвтоЦентра, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.СебестоимостьДО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаТО, 0) - ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0)) / Налогооблажение.НалоговаяСтавка + ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаДополнительная, 0) + ВЫБОР
//	|						КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
//	|							ТОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
//	|						ИНАЧЕ ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0) - ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0)
//	|					КОНЕЦ
//	|			КОНЕЦ
//	|	КОНЕЦ + ЕСТЬNULL(ВТ_Основа.РЛ.КВКредит + СтраховыеПрограммы.КВКАСКО + СтраховыеПрограммы.КВОСАГО + СтраховыеПрограммы.КВGAP + СтраховыеПрограммы.КВМедиКАСКО + СтраховыеПрограммы.КВРАТ + СтраховыеПрограммы.КВНезависимаяГарантия + СтраховыеПрограммы.КВБезотзывнаяНезависимаяГарантия + СтраховыеПрограммы.КВМедицинскоеСтрахование + СтраховыеПрограммы.КВСтрахованиеЖизни + СтраховыеПрограммы.КВСтрахованиеИмущества + СтраховыеПрограммы.КВПрочее, ВТ_Основа.РЛ.КВКредит + ВТ_Основа.РЛ.КВКаско + ВТ_Основа.РЛ.КВОсаго + ВТ_Основа.РЛ.КВСЖ + ЕСТЬNULL(РЛ_ИСП.КВ, 0)) / Налогооблажение.НалоговаяСтавка КАК БлокировкаПродажи,
//	|	ВТ_Основа.РЛ.Номер КАК РабочийЛист,
//	|	NULL КАК Реализация,
//	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаКАСКО, ""-"") КАК Количество_Остаток_Оборот,
//	|	ЕСТЬNULL(СтраховыеПрограммы.ВидКАСКО, ""-"") КАК Сумма_Остаток_Оборот,
//	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаРитейла, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРитейла,
//	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияКАСКО, ""-"") КАК ДатаРитейла2,
//	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.СкидаПриПокупкеВТрейдИн, 0) КАК СкидкаПриПокупкеВТрейдИн,
//	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.СкидкаПриПокупкеВКредит, 0) КАК СкидкаПриПокупкеВКредит,
//	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаКАСКО, 0) КАК НомерДатаПерезачета,
//	|	ВТ_Основа.Автомобиль.Оплачен КАК Оплачен,
//	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОплаты,
//	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.РазмерСкидки, 0) КАК РазмерСкидки,
//	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.ОжидаемаяДатаПолученияКомпенсации, ДАТАВРЕМЯ(1, 1, 1)) КАК ОжидаемаяДатаПолученияКомпенсации,
//	|	ЕСТЬNULL(ВТ_Основа.Автомобиль.РазмерКомпенсации, 0) КАК РазмерКомпенсации,
//	|	ВТ_Основа.РЛ.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.НаличныйРасчет) КАК НаличныйРасчет,
//	|	ВТ_Основа.РЛ.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.БанковскаяКарта)
//	|		ИЛИ ВТ_Основа.РЛ.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.БезналичныйРасчет) КАК БезналичныйРасчет,
//	|	ВТ_Основа.РЛ.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.Кредит) КАК Кредит,
//	|	ВТ_Основа.РЛ.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.Обмен) КАК Обмен,
//	|	ВТ_Основа.РЛ.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.Лизинг) КАК Лизинг,
//	|	ЕСТЬNULL(ВТ_Основа.РЛ.ПредоплатаЗаАМ, 0) КАК ПредоплатаЗаАМ,
//	|	ЕСТЬNULL(ВТ_Основа.РЛ.ДатаПредоплатыЗаАМ, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПредоплатыЗаАМ,
//	|	ЕСТЬNULL(ВТ_Основа.РЛ.Контрагент, ЗаказыАвто.Заказ.Контрагент) КАК Покупатель,
//	|	ЕСТЬNULL(ЦеныАвто.Цена, ЕСТЬNULL(ВТ_Основа.РЛ.РРЦ, ЕСТЬNULL(ЗаказыАвто.Заказ.РРЦ, 0))) КАК РРЦ,
//	|	ВЫБОР
//	|		КОГДА ВТ_Поступление.ЦенаОферты = 0
//	|			ТОГДА ВТ_Поступление.ЦенаПоступления
//	|		ИНАЧЕ ВТ_Поступление.ЦенаОферты
//	|	КОНЕЦ / Налогооблажение.НалоговаяСтавка КАК Инвойс,
//	|	ВЫБОР
//	|		КОГДА ВТ_Поступление.ЦенаОферты = 0
//	|			ТОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаПоступления, 0)
//	|		ИНАЧЕ ВТ_Поступление.ЦенаОферты
//	|	КОНЕЦ КАК СкидкаТрейдИнПлан,
//	|	ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИнФакт, 0) КАК СкидкаТрейдИнФакт,
//	|	ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2, 0) КАК СкидкаТрейдИн2План,
//	|	ЕСТЬNULL(ВТ_Основа.РЛ.СкидкаТрейдИн2Факт, 0) КАК СкидкаТрейдИн2Факт,
//	|	ВТ_Основа.РЛ.СкидкаСубсидияКредит КАК СкидкаСубсидияКредитПлан,
//	|	ВТ_Основа.РЛ.СкидкаСубсидияКредитФакт КАК СкидкаСубсидияКредитФакт,
//	|	ВТ_Основа.РЛ.СкидкаПоПрограммамЛояльности КАК СкидкаПоПрограммамЛояльности,
//	|	ВТ_Основа.РЛ.СкидкаАвтоЦентра КАК СкидкаПоСпецПрограмме,
//	|	ВТ_Основа.РЛ.СкидкаРозничная КАК СкидкаРозничная,
//	|	ВТ_Основа.РЛ.СкидкаДополнительная КАК СкидкаДополнительная,
//	|	ЕСТЬNULL(СтраховыеПрограммы.КВКАСКО, 0) КАК СтоимостьДопОборудования_Маркетинг,
//	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаОСАГО, ""-"") КАК СтоимостьДопОборудования,
//	|	ВТ_Основа.РЛ.СтоимостьДО КАК ПлановаяСтоимостьДО,
//	|	ВТ_Основа.РЛ.СебестоимостьДО * Налогооблажение.НалоговаяСтавка КАК СебестоимостьДО,
//	|	ЕСТЬNULL(СтраховыеПрограммы.ВидОСАГО, ""-"") КАК СебестоимостьДО_Комплектации,
//	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияОСАГО, ""-"") КАК СуммаДО,
//	|	ВТ_Основа.РЛ.СтоимостьДОФакт КАК ЦенаДопПоПрайсу,
//	|	ВТ_Основа.РЛ.ПредоплатаТО КАК ПредоплатаТО,
//	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаОСАГО, 0) КАК КомпенсацияТрейдИНРетроспективная,
//	|	ЕСТЬNULL(СтраховыеПрограммы.КВОСАГО, 0) КАК КомпенсацияСубсидияКредитРетроспективная,
//	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаGAP, ""-"") КАК КомпенсацияПоПрограммамЛояльностиРетроспективная,
//	|	ЕСТЬNULL(СтраховыеПрограммы.ВидGAP, ""-"") КАК КомпенсацияРозничнаяРетроспективная,
//	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияGAP, ""-"") КАК КомпенсацияТрейдИН2Ретроспективная,
//	|	ВЫБОР
//	|		КОГДА ВТ_Основа.Автомобиль.Модель.Марка.КомпенсацияБезНДС
//	|			ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0)
//	|		ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяРетроспективная, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2Ретроспективная, 0)) * Налогооблажение.НалоговаяСтавка
//	|	КОНЕЦ КАК КомпенсацияРетроспективная,
//	|	ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля КАК КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля,
//	|	ВТ_Основа.РЛ.СуммаКомпенсации КАК СуммаКомпенсации,
//	|	ВЫБОР
//	|		КОГДА ВТ_Основа.Автомобиль.Модель.Марка.КомпенсацияБезНДС
//	|			ТОГДА ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)
//	|		ИНАЧЕ (ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля, 0) + ЕСТЬNULL(ВТ_Основа.РЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля, 0)) * Налогооблажение.НалоговаяСтавка
//	|	КОНЕЦ КАК КомпенсацияВИнвойсе,
//	|	ВТ_Основа.РЛ.КомпенсацияБрокерФинанс КАК КомпенсацияБрокерФинанс,
//	|	ЕСТЬNULL(ВТ_Основа.РЛ.СуммаПредпродажнойПодготовки, 0) * Налогооблажение.НалоговаяСтавка КАК СуммаКаско,
//	|	(ЕСТЬNULL(ВТ_Основа.РЛ.КВКредит, 0) + ЕСТЬNULL(СтраховыеПрограммы.КВКАСКО, 0) + ЕСТЬNULL(СтраховыеПрограммы.КВОСАГО, 0) + ЕСТЬNULL(СтраховыеПрограммы.КВGAP, 0) + ЕСТЬNULL(СтраховыеПрограммы.КВМедиКАСКО, 0) + ЕСТЬNULL(СтраховыеПрограммы.КВРАТ, 0) + ЕСТЬNULL(СтраховыеПрограммы.КВНезависимаяГарантия, 0) + ЕСТЬNULL(СтраховыеПрограммы.КВБезотзывнаяНезависимаяГарантия, 0) + ЕСТЬNULL(СтраховыеПрограммы.КВМедицинскоеСтрахование, 0) + ЕСТЬNULL(СтраховыеПрограммы.КВСтрахованиеЖизни, 0) + ЕСТЬNULL(СтраховыеПрограммы.КВСтрахованиеИмущества, 0) + ЕСТЬNULL(СтраховыеПрограммы.КВПрочее, 0)) * Налогооблажение.НалоговаяСтавка КАК ВариантКаско,
//	|	ВТ_Основа.ТипСтроки КАК СуммаОсаго,
//	|	ЕСТЬNULL(ВТ_Основа.РЛ.УдержаниеКомпенсации, 0) * Налогооблажение.НалоговаяСтавка КАК ВариантОсаго,
//	|	ВТ_Основа.РЛ.Дата КАК СуммаСтрахованиеЖизни,
//	|	ВТ_Основа.РЛ.КВКредит КАК ВариантСтрахованиеЖизни,
//	|	ВТ_Основа.РЛ.СуммаПродажи КАК ЦенаФакт,
//	|	ВЫБОР
//	|		КОГДА ВЫБОР
//	|				КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|					ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
//	|				ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
//	|			КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
//	|		ИНАЧЕ ВЫБОР
//	|				КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
//	|					ТОГДА ВЫБОР
//	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|								ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
//	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|								ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
//	|							ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
//	|						КОНЕЦ
//	|				ИНАЧЕ ВЫБОР
//	|						КОГДА ВЫБОР
//	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
//	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
//	|								ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
//	|							КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
//	|							ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
//	|						ИНАЧЕ ВЫБОР
//	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
//	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
//	|								ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
//	|							КОНЕЦ
//	|					КОНЕЦ
//	|			КОНЕЦ
//	|	КОНЕЦ КАК ЦенаДоговора,
//	|	ВТ_Основа.РЛ.СуммаПредоплаты КАК ПервоначальныйВзнос,
//	|	ВТ_Основа.РЛ.ДатаПервоначальногоВзноса КАК ДатаПервоначальногоВзноса,
//	|	ВТ_Основа.РЛ.БанкЛК КАК БанкЛК,
//	|	ВЫБОР
//	|		КОГДА ВТ_Основа.РЛ.Кредит
//	|				ИЛИ ВТ_Основа.РЛ.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.Кредит)
//	|			ТОГДА ВТ_Основа.РЛ.СчетИлиАвтоВКредит
//	|	КОНЕЦ КАК КредитнаяСтоимость,
//	|	ВТ_Основа.РЛ.ПрогнозСрокаПодготовкиАвтоВДнях КАК ПрогнозСрокаПодготовкиАвтоВДнях,
//	|	ВТ_Основа.РЛ.ПрогнозСуммыРемонта КАК ПрогнозСуммыРемонта,
//	|	ВТ_Основа.РЛ.ПрогнозСуммыДетейлинга КАК ПрогнозСуммыДетейлинга,
//	|	ВТ_Основа.РЛ.ПрогнозируемаяЦенаПродажи КАК ПрогнозируемаяЦенаПродажи,
//	|	ВТ_Основа.РЛ.ПрогнозСрокаПродажиАвтоВДнях КАК ПрогнозСрокаПродажиАвтоВДнях,
//	|	ВТ_Основа.РЛ.ПрогнозСуммыМКЦ КАК ПрогнозСуммыМКЦ,
//	|	ВТ_Основа.РЛ.ЦенаМинРыночнаяТрейдИн КАК ЦенаМинРыночнаяТрейдИн,
//	|	ВТ_Основа.РЛ.ПланируемаяЦенаПродажиТрейдИн КАК ПланируемаяЦенаПродажиТрейдИн,
//	|	ВТ_Основа.РЛ.ЦенаДКПТрейдИн КАК ЦенаДКПТрейдИн,
//	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаGAP, 0) КАК ДатаРитейла_РЛ,
//	|	ЕСТЬNULL(СтраховыеПрограммы.КВGAP, 0) КАК СуммаИСП,
//	|	ДолгОП.КоличествоДолгаОП КАК КоличествоДолгаОП,
//	|	ЕСТЬNULL(ЗаказыАвто.Резерв, 0) КАК Резерв,
//	|	ВТ_Поступление.ДатаПоступления КАК ДатаПоступленияВГК,
//	|	ВЫБОР
//	|		КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|				ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|				ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|				ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|				ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|			ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
//	|		ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
//	|	КОНЕЦ КАК ДатаФинансирования,
//	|	ЕСТЬNULL(Хранение.ДатаПриемкиНаТекушийСклад, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПриемкиНаТекушийСклад,
//	|	РАЗНОСТЬДАТ(ВТ_Поступление.ДатаПоступления, &Дата2, ДЕНЬ) КАК СрокХранения,
//	|	ВЫБОР
//	|		КОГДА ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
//	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
//	|				ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
//	|					И РАЗНОСТЬДАТ(&Дата2, ВТ_Основа.Дата, ДЕНЬ) < 90
//	|			ТОГДА ""Да""
//	|		ИНАЧЕ ""Нет""
//	|	КОНЕЦ КАК ГарантияПИ,
//	|	0 КАК БонусЗаМодель,
//	|	0 КАК ЦелеваяДоходность,
//	|	0 КАК БонусЗаШтуку,
//	|	ЕСТЬNULL(ВЫБОР
//	|			КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
//	|				ТОГДА ВТ_Поступление.ЦенаПоступления
//	|			ИНАЧЕ ВТ_Поступление.ЦенаОферты
//	|		КОНЕЦ, 0) * 0.00067 КАК СтоимостьСуточногоХранения,
//	|	ВЫБОР
//	|		КОГДА ВЫБОР
//	|				КОГДА ВЫБОР
//	|						КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|							ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
//	|						ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
//	|					КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
//	|					ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
//	|				ИНАЧЕ ВЫБОР
//	|						КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
//	|							ТОГДА ВЫБОР
//	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
//	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|								КОНЕЦ
//	|						ИНАЧЕ ВЫБОР
//	|								КОГДА ВЫБОР
//	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
//	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|									КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
//	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
//	|								ИНАЧЕ ВЫБОР
//	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
//	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|									КОНЕЦ
//	|							КОНЕЦ
//	|					КОНЕЦ
//	|			КОНЕЦ < &Дата2
//	|			ТОГДА ЕСТЬNULL(ВЫБОР
//	|						КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
//	|							ТОГДА ВТ_Поступление.ЦенаПоступления
//	|						ИНАЧЕ ВТ_Поступление.ЦенаОферты
//	|					КОНЕЦ, 0) * 0.00067 * РАЗНОСТЬДАТ(ВЫБОР
//	|						КОГДА ВЫБОР
//	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|									ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
//	|								ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
//	|							КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
//	|							ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
//	|						ИНАЧЕ ВЫБОР
//	|								КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
//	|									ТОГДА ВЫБОР
//	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
//	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|										КОНЕЦ
//	|								ИНАЧЕ ВЫБОР
//	|										КОГДА ВЫБОР
//	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
//	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|												ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|											КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
//	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
//	|										ИНАЧЕ ВЫБОР
//	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
//	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|												ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|											КОНЕЦ
//	|									КОНЕЦ
//	|							КОНЕЦ
//	|					КОНЕЦ, &Дата2, ДЕНЬ)
//	|		ИНАЧЕ 0
//	|	КОНЕЦ + ЕСТЬNULL(ВЫБОР
//	|			КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
//	|				ТОГДА ВТ_Поступление.ЦенаПоступления
//	|			ИНАЧЕ ВТ_Поступление.ЦенаОферты
//	|		КОНЕЦ, 0) * 0.00067 * РАЗНОСТЬДАТ(ВЫБОР
//	|			КОГДА ВЫБОР
//	|					КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|						ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
//	|					ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
//	|				КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
//	|				ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
//	|			ИНАЧЕ ВЫБОР
//	|					КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
//	|						ТОГДА ВЫБОР
//	|								КОГДА ВЫБОР
//	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
//	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
//	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
//	|									КОНЕЦ >= &Дата2
//	|									ТОГДА &Дата2
//	|								ИНАЧЕ ВЫБОР
//	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
//	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
//	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
//	|									КОНЕЦ
//	|							КОНЕЦ
//	|					ИНАЧЕ ВЫБОР
//	|							КОГДА ВЫБОР
//	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
//	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
//	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
//	|								КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
//	|								ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
//	|							ИНАЧЕ ВЫБОР
//	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
//	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
//	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
//	|								КОНЕЦ
//	|						КОНЕЦ
//	|				КОНЕЦ
//	|		КОНЕЦ, ВЫБОР
//	|			КОГДА ВЫБОР
//	|					КОГДА ВЫБОР
//	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|								ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
//	|							ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
//	|						КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
//	|						ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
//	|					ИНАЧЕ ВЫБОР
//	|							КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
//	|								ТОГДА ВЫБОР
//	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|									КОНЕЦ
//	|							ИНАЧЕ ВЫБОР
//	|									КОГДА ВЫБОР
//	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|										КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
//	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
//	|									ИНАЧЕ ВЫБОР
//	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|										КОНЕЦ
//	|								КОНЕЦ
//	|						КОНЕЦ
//	|				КОНЕЦ > &Дата2
//	|				ТОГДА &Дата2
//	|			ИНАЧЕ ВЫБОР
//	|					КОГДА ВЫБОР
//	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|								ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
//	|							ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
//	|						КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
//	|						ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
//	|					ИНАЧЕ ВЫБОР
//	|							КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
//	|								ТОГДА ВЫБОР
//	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|									КОНЕЦ
//	|							ИНАЧЕ ВЫБОР
//	|									КОГДА ВЫБОР
//	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|										КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
//	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
//	|									ИНАЧЕ ВЫБОР
//	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|										КОНЕЦ
//	|								КОНЕЦ
//	|						КОНЕЦ
//	|				КОНЕЦ
//	|		КОНЕЦ, ДЕНЬ) КАК ОбщаяСтоимостьХранения,
//	|	ЕСТЬNULL(ВТ_Основа.РЛ.Контрагент.ФормаСобственности, ЗаказыАвто.Заказ.Контрагент.ФормаСобственности) КАК Tech_1,
//	|	ВЫБОР
//	|		КОГДА ВЫБОР
//	|				КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|						ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|					ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
//	|				ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
//	|			КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
//	|		ИНАЧЕ ВЫБОР
//	|				КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
//	|					ТОГДА ВЫБОР
//	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|								ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|								ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|							ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|						КОНЕЦ
//	|				ИНАЧЕ ВЫБОР
//	|						КОГДА ВЫБОР
//	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|								ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|							КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
//	|							ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
//	|						ИНАЧЕ ВЫБОР
//	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|								ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|							КОНЕЦ
//	|					КОНЕЦ
//	|			КОНЕЦ
//	|	КОНЕЦ КАК Tech_2,
//	|	ЕСТЬNULL(ВТ_Поступление.Комиссия, ЛОЖЬ) КАК Tech_3,
//	|	ВТ_Основа.ТИ КАК Tech_4,
//	|	НЕ(ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
//	|			ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт)
//	|			ИЛИ ХарактеристикиАвто.ВидАвто = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.КорпоративнаяКвота)
//	|			ИЛИ ЕСТЬNULL(ВТ_Поступление.Комиссия, ЛОЖЬ)
//	|			ИЛИ ВТ_Основа.ТИ) КАК Tech_5,
//	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаМедиКАСКО, ""-"") КАК Tech_6,
//	|	ЕСТЬNULL(СтраховыеПрограммы.ВидМедиКАСКО, ""-"") КАК Tech_7,
//	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияМедиКАСКО, ""-"") КАК Tech_8,
//	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаМедиКАСКО, 0) КАК Tech_9,
//	|	ЕСТЬNULL(СтраховыеПрограммы.КВМедиКАСКО, 0) КАК Tech_10,
//	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаРАТ, ""-"") КАК Tech_11,
//	|	ЕСТЬNULL(СтраховыеПрограммы.ВидРАТ, ""-"") КАК Tech_12,
//	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияРАТ, ""-"") КАК Tech_13,
//	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаРАТ, 0) КАК Tech_14,
//	|	ЕСТЬNULL(СтраховыеПрограммы.КВРАТ, 0) КАК Tech_15,
//	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаНезависимаяГарантия, ""-"") КАК Tech_16,
//	|	ЕСТЬNULL(СтраховыеПрограммы.ВидНезависимаяГарантия, ""-"") КАК Tech_17,
//	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияНезависимаяГарантия, ""-"") КАК Tech_18,
//	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаНезависимаяГарантия, 0) КАК Tech_19,
//	|	ЕСТЬNULL(СтраховыеПрограммы.КВНезависимаяГарантия, 0) КАК Tech_20,
//	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаБезотзывнаяНезависимаяГарантия, ""-"") КАК Tech_21,
//	|	ЕСТЬNULL(СтраховыеПрограммы.ВидБезотзывнаяНезависимаяГарантия, ""-"") КАК Tech_22,
//	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияБезотзывнаяНезависимаяГарантия, ""-"") КАК Tech_23,
//	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаБезотзывнаяНезависимаяГарантия, 0) КАК Tech_24,
//	|	ЕСТЬNULL(СтраховыеПрограммы.КВБезотзывнаяНезависимаяГарантия, 0) КАК Tech_25,
//	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаМедицинскоеСтрахование, ""-"") КАК Tech_26,
//	|	ЕСТЬNULL(СтраховыеПрограммы.ВидМедицинскоеСтрахование, ""-"") КАК Tech_27,
//	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияМедицинскоеСтрахование, ""-"") КАК Tech_28,
//	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаМедицинскоеСтрахование, 0) КАК Tech_29,
//	|	ЕСТЬNULL(СтраховыеПрограммы.КВМедицинскоеСтрахование, 0) КАК Tech_30,
//	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаСтрахованиеЖизни, ""-"") КАК Tech_31,
//	|	ЕСТЬNULL(СтраховыеПрограммы.ВидСтрахованиеЖизни, ""-"") КАК Tech_32,
//	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияСтрахованиеЖизни, ""-"") КАК Tech_33,
//	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаСтрахованиеЖизни, 0) КАК Tech_34,
//	|	ЕСТЬNULL(СтраховыеПрограммы.КВСтрахованиеЖизни, 0) КАК Tech_35,
//	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаСтрахованиеИмущества, ""-"") КАК Tech_36,
//	|	ЕСТЬNULL(СтраховыеПрограммы.ВидСтрахованиеИмущества, ""-"") КАК Tech_37,
//	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияСтрахованиеИмущества, ""-"") КАК Tech_38,
//	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаСтрахованиеИмущества, 0) КАК Tech_39,
//	|	ЕСТЬNULL(СтраховыеПрограммы.КВСтрахованиеИмущества, 0) КАК Tech_40,
//	|	ЕСТЬNULL(СтраховыеПрограммы.ПрограммаПрочее, ""-"") КАК Tech_41,
//	|	ЕСТЬNULL(СтраховыеПрограммы.ВидПрочее, ""-"") КАК Tech_42,
//	|	ЕСТЬNULL(СтраховыеПрограммы.КомпанияПрочее, ""-"") КАК Tech_43,
//	|	ЕСТЬNULL(СтраховыеПрограммы.СуммаПрочее, 0) КАК Tech_44,
//	|	ЕСТЬNULL(СтраховыеПрограммы.КВПрочее, 0) КАК Tech_45,
//	|	ВТ_Основа.VIN_Матери КАК Tech_46,
//	|	ВТ_Основа.РЛ.СуммаПродажи + ВТ_Основа.РЛ.СкидкаДополнительная КАК Tech_47,
//	|	ЕСТЬNULL(ВЫБОР
//	|			КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
//	|				ТОГДА ВТ_Поступление.ЦенаПоступления
//	|			ИНАЧЕ ВТ_Поступление.ЦенаОферты
//	|		КОНЕЦ, 0) * 0.00067 * РАЗНОСТЬДАТ(ВЫБОР
//	|			КОГДА ВЫБОР
//	|					КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|							ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|						ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
//	|					ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
//	|				КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
//	|				ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
//	|			ИНАЧЕ ВЫБОР
//	|					КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
//	|						ТОГДА ВЫБОР
//	|								КОГДА ВЫБОР
//	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
//	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
//	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
//	|									КОНЕЦ >= &Дата2
//	|									ТОГДА &Дата2
//	|								ИНАЧЕ ВЫБОР
//	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
//	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
//	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
//	|									КОНЕЦ
//	|							КОНЕЦ
//	|					ИНАЧЕ ВЫБОР
//	|							КОГДА ВЫБОР
//	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
//	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
//	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
//	|								КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
//	|								ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
//	|							ИНАЧЕ ВЫБОР
//	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0))
//	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
//	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.БеспроцентныйПериодДней, ПериодыФакторингаМодель.БеспроцентныйПериодДней), 0) - 1)
//	|								КОНЕЦ
//	|						КОНЕЦ
//	|				КОНЕЦ
//	|		КОНЕЦ, ВЫБОР
//	|			КОГДА ВЫБОР
//	|					КОГДА ВЫБОР
//	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|								ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
//	|							ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
//	|						КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
//	|						ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
//	|					ИНАЧЕ ВЫБОР
//	|							КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
//	|								ТОГДА ВЫБОР
//	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|									КОНЕЦ
//	|							ИНАЧЕ ВЫБОР
//	|									КОГДА ВЫБОР
//	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|										КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
//	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
//	|									ИНАЧЕ ВЫБОР
//	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|										КОНЕЦ
//	|								КОНЕЦ
//	|						КОНЕЦ
//	|				КОНЕЦ > &Дата2
//	|				ТОГДА &Дата2
//	|			ИНАЧЕ ВЫБОР
//	|					КОГДА ВЫБОР
//	|							КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|									ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|								ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
//	|							ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
//	|						КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
//	|						ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
//	|					ИНАЧЕ ВЫБОР
//	|							КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
//	|								ТОГДА ВЫБОР
//	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|									КОНЕЦ
//	|							ИНАЧЕ ВЫБОР
//	|									КОГДА ВЫБОР
//	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|										КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
//	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
//	|									ИНАЧЕ ВЫБОР
//	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) - 1)
//	|										КОНЕЦ
//	|								КОНЕЦ
//	|						КОНЕЦ
//	|				КОНЕЦ
//	|		КОНЕЦ, ДЕНЬ) КАК Tech_48,
//	|	ВЫБОР
//	|		КОГДА ВЫБОР
//	|				КОГДА ВЫБОР
//	|						КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|								ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|							ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
//	|						ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
//	|					КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
//	|					ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
//	|				ИНАЧЕ ВЫБОР
//	|						КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
//	|							ТОГДА ВЫБОР
//	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|											ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
//	|									КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|								КОНЕЦ
//	|						ИНАЧЕ ВЫБОР
//	|								КОГДА ВЫБОР
//	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
//	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|									КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
//	|									ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
//	|								ИНАЧЕ ВЫБОР
//	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|												ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
//	|										КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|									КОНЕЦ
//	|							КОНЕЦ
//	|					КОНЕЦ
//	|			КОНЕЦ < &Дата2
//	|			ТОГДА ЕСТЬNULL(ВЫБОР
//	|						КОГДА ЕСТЬNULL(ВТ_Поступление.ЦенаОферты, 0) = 0
//	|							ТОГДА ВТ_Поступление.ЦенаПоступления
//	|						ИНАЧЕ ВТ_Поступление.ЦенаОферты
//	|					КОНЕЦ, 0) * 0.00067 * РАЗНОСТЬДАТ(ВЫБОР
//	|						КОГДА ВЫБОР
//	|								КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|										ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|									ТОГДА ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию
//	|								ИНАЧЕ ВТ_Основа.Автомобиль.ДатаФинансирования
//	|							КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1)
//	|							ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Поступление.ДатаПоступления, ДЕНЬ, -1)
//	|						ИНАЧЕ ВЫБОР
//	|								КОГДА ЕСТЬNULL(ВТ_Основа.Автомобиль.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
//	|									ТОГДА ВЫБОР
//	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|													ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
//	|											КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|										КОНЕЦ
//	|								ИНАЧЕ ВЫБОР
//	|										КОГДА ВЫБОР
//	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
//	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|												ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|											КОНЕЦ >= ВТ_Основа.Автомобиль.ДатаОплаты
//	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОплаты, ДЕНЬ, -1)
//	|										ИНАЧЕ ВЫБОР
//	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.CHERY)
//	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.EXEED)
//	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAECOO)
//	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.OMODA)
//	|														ИЛИ ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.TENET)
//	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0) + 1)
//	|												КОГДА ВТ_Основа.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.JAC)
//	|													ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаОтгрузкиПоФинансированию, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|												ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_Основа.Автомобиль.ДатаФинансирования, ДЕНЬ, ЕСТЬNULL(ЕСТЬNULL(ПериодыФакторингаМарка.ОбщийПериодДней, ПериодыФакторингаМодель.ОбщийПериодДней), 0))
//	|											КОНЕЦ
//	|									КОНЕЦ
//	|							КОНЕЦ
//	|					КОНЕЦ, &Дата2, ДЕНЬ)
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК Tech_49,
//	|	ВТ_Основа.МенеджерАСП КАК Tech_50
//	|ИЗ
//	|	ВТ_Основа КАК ВТ_Основа
//	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
//	|			АвтомобилиСрезПоследних.Значение КАК ВидАвто,
//	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения
//	|		ИЗ
//	|			РегистрСведений.Автомобили.СрезПоследних(
//	|					&Дата2,
//	|					ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)
//	|						И ТИПЗНАЧЕНИЯ(ВидЗначения) = ТИП(Перечисление.ДополнительнаяИнформацияАвтомобилей)) КАК АвтомобилиСрезПоследних) КАК ХарактеристикиАвто
//	|		ПО ВТ_Основа.Автомобиль = ХарактеристикиАвто.Автомобиль
//	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	|			ЗаказыАвтомобилейОстатки.Автомобиль КАК Автомобиль,
//	|			ЗаказыАвтомобилейОстатки.Заказ КАК Заказ,
//	|			ЗаказыАвтомобилейОстатки.РезервОстаток КАК Резерв,
//	|			Взаиморасчеты.СуммаОстаток КАК СуммаОстаток
//	|		ИЗ
//	|			РегистрНакопления.ЗаказыАвтомобилей.Остатки(&Дата2, ) КАК ЗаказыАвтомобилейОстатки
//	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	|					СУММА(ВзаиморасчетыКомпанииОстатки.СуммаОстаток) КАК СуммаОстаток,
//	|					ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
//	|					ВзаиморасчетыКомпанииОстатки.Сделка КАК Сделка
//	|				ИЗ
//	|					РегистрНакопления.ВзаиморасчетыКомпании.Остатки КАК ВзаиморасчетыКомпанииОстатки
//	|				
//	|				СГРУППИРОВАТЬ ПО
//	|					ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов,
//	|					ВзаиморасчетыКомпанииОстатки.Сделка) КАК Взаиморасчеты
//	|				ПО ЗаказыАвтомобилейОстатки.Заказ = Взаиморасчеты.Сделка) КАК ЗаказыАвто
//	|		ПО ВТ_Основа.Автомобиль = ЗаказыАвто.Автомобиль
//	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	|			ОстаткиАвтомобилейОбороты.Автомобиль КАК Автомобиль,
//	|			МАКСИМУМ(ОстаткиАвтомобилейОбороты.Регистратор.Дата) КАК ДатаПриемкиНаТекушийСклад
//	|		ИЗ
//	|			РегистрНакопления.ОстаткиАвтомобилей.Обороты(, КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ), Регистратор, ) КАК ОстаткиАвтомобилейОбороты
//	|		
//	|		СГРУППИРОВАТЬ ПО
//	|			ОстаткиАвтомобилейОбороты.Автомобиль) КАК Хранение
//	|		ПО ВТ_Основа.Автомобиль = Хранение.Автомобиль
//	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	|			РабочийЛистДолгОтделаПродаж.Ссылка КАК Ссылка,
//	|			СУММА(РабочийЛистДолгОтделаПродаж.Количество) КАК КоличествоДолгаОП
//	|		ИЗ
//	|			Документ.РабочийЛист.ДолгОтделаПродаж КАК РабочийЛистДолгОтделаПродаж
//	|		
//	|		СГРУППИРОВАТЬ ПО
//	|			РабочийЛистДолгОтделаПродаж.Ссылка) КАК ДолгОП
//	|		ПО ВТ_Основа.РЛ.Ссылка = ДолгОП.Ссылка
//	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	|			ЦеныАвтомобилейСрезПоследних.Автомобиль КАК Автомобиль,
//	|			ЦеныАвтомобилейСрезПоследних.Цена КАК Цена
//	|		ИЗ
//	|			РегистрСведений.ЦеныАвтомобилей.СрезПоследних(КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ), ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)) КАК ЦеныАвтомобилейСрезПоследних) КАК ЦеныАвто
//	|		ПО ВТ_Основа.Автомобиль = ЦеныАвто.Автомобиль
//	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	|			База.Автомобиль КАК Автомобиль,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 0
//	|						ТОГДА База.ПрограммаСтрахования
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК ПрограммаКАСКО,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 0
//	|						ТОГДА База.ВидСтрахования
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК ВидКАСКО,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 0
//	|						ТОГДА База.СтраховаяКомпания
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК КомпанияКАСКО,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 0
//	|						ТОГДА База.СуммаСтрахования
//	|					ИНАЧЕ 0
//	|				КОНЕЦ) КАК СуммаКАСКО,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 0
//	|						ТОГДА База.КВСуммыСтрахования
//	|					ИНАЧЕ 0
//	|				КОНЕЦ) КАК КВКАСКО,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 1
//	|						ТОГДА База.ПрограммаСтрахования
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК ПрограммаОСАГО,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 1
//	|						ТОГДА База.ВидСтрахования
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК ВидОСАГО,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 1
//	|						ТОГДА База.СтраховаяКомпания
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК КомпанияОСАГО,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 1
//	|						ТОГДА База.СуммаСтрахования
//	|					ИНАЧЕ 0
//	|				КОНЕЦ) КАК СуммаОСАГО,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 1
//	|						ТОГДА База.КВСуммыСтрахования
//	|					ИНАЧЕ 0
//	|				КОНЕЦ) КАК КВОСАГО,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 2
//	|						ТОГДА База.ПрограммаСтрахования
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК ПрограммаGAP,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 2
//	|						ТОГДА База.ВидСтрахования
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК ВидGAP,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 2
//	|						ТОГДА База.СтраховаяКомпания
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК КомпанияGAP,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 2
//	|						ТОГДА База.СуммаСтрахования
//	|					ИНАЧЕ 0
//	|				КОНЕЦ) КАК СуммаGAP,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 2
//	|						ТОГДА База.КВСуммыСтрахования
//	|					ИНАЧЕ 0
//	|				КОНЕЦ) КАК КВGAP,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 3
//	|						ТОГДА База.ПрограммаСтрахования
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК ПрограммаМедиКАСКО,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 3
//	|						ТОГДА База.ВидСтрахования
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК ВидМедиКАСКО,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 3
//	|						ТОГДА База.СтраховаяКомпания
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК КомпанияМедиКАСКО,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 3
//	|						ТОГДА База.СуммаСтрахования
//	|					ИНАЧЕ 0
//	|				КОНЕЦ) КАК СуммаМедиКАСКО,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 3
//	|						ТОГДА База.КВСуммыСтрахования
//	|					ИНАЧЕ 0
//	|				КОНЕЦ) КАК КВМедиКАСКО,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 4
//	|						ТОГДА База.ПрограммаСтрахования
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК ПрограммаРАТ,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 4
//	|						ТОГДА База.ВидСтрахования
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК ВидРАТ,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 4
//	|						ТОГДА База.СтраховаяКомпания
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК КомпанияРАТ,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 4
//	|						ТОГДА База.СуммаСтрахования
//	|					ИНАЧЕ 0
//	|				КОНЕЦ) КАК СуммаРАТ,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 4
//	|						ТОГДА База.КВСуммыСтрахования
//	|					ИНАЧЕ 0
//	|				КОНЕЦ) КАК КВРАТ,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 5
//	|						ТОГДА База.ПрограммаСтрахования
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК ПрограммаНезависимаяГарантия,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 5
//	|						ТОГДА База.ВидСтрахования
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК ВидНезависимаяГарантия,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 5
//	|						ТОГДА База.СтраховаяКомпания
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК КомпанияНезависимаяГарантия,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 5
//	|						ТОГДА База.СуммаСтрахования
//	|					ИНАЧЕ 0
//	|				КОНЕЦ) КАК СуммаНезависимаяГарантия,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 5
//	|						ТОГДА База.КВСуммыСтрахования
//	|					ИНАЧЕ 0
//	|				КОНЕЦ) КАК КВНезависимаяГарантия,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 6
//	|						ТОГДА База.ПрограммаСтрахования
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК ПрограммаБезотзывнаяНезависимаяГарантия,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 6
//	|						ТОГДА База.ВидСтрахования
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК ВидБезотзывнаяНезависимаяГарантия,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 6
//	|						ТОГДА База.СтраховаяКомпания
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК КомпанияБезотзывнаяНезависимаяГарантия,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 6
//	|						ТОГДА База.СуммаСтрахования
//	|					ИНАЧЕ 0
//	|				КОНЕЦ) КАК СуммаБезотзывнаяНезависимаяГарантия,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 6
//	|						ТОГДА База.КВСуммыСтрахования
//	|					ИНАЧЕ 0
//	|				КОНЕЦ) КАК КВБезотзывнаяНезависимаяГарантия,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 7
//	|						ТОГДА База.ПрограммаСтрахования
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК ПрограммаМедицинскоеСтрахование,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 7
//	|						ТОГДА База.ВидСтрахования
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК ВидМедицинскоеСтрахование,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 7
//	|						ТОГДА База.СтраховаяКомпания
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК КомпанияМедицинскоеСтрахование,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 7
//	|						ТОГДА База.СуммаСтрахования
//	|					ИНАЧЕ 0
//	|				КОНЕЦ) КАК СуммаМедицинскоеСтрахование,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 7
//	|						ТОГДА База.КВСуммыСтрахования
//	|					ИНАЧЕ 0
//	|				КОНЕЦ) КАК КВМедицинскоеСтрахование,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 8
//	|						ТОГДА База.ПрограммаСтрахования
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК ПрограммаСтрахованиеЖизни,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 8
//	|						ТОГДА База.ВидСтрахования
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК ВидСтрахованиеЖизни,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 8
//	|						ТОГДА База.СтраховаяКомпания
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК КомпанияСтрахованиеЖизни,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 8
//	|						ТОГДА База.СуммаСтрахования
//	|					ИНАЧЕ 0
//	|				КОНЕЦ) КАК СуммаСтрахованиеЖизни,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 8
//	|						ТОГДА База.КВСуммыСтрахования
//	|					ИНАЧЕ 0
//	|				КОНЕЦ) КАК КВСтрахованиеЖизни,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 9
//	|						ТОГДА База.ПрограммаСтрахования
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК ПрограммаСтрахованиеИмущества,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 9
//	|						ТОГДА База.ВидСтрахования
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК ВидСтрахованиеИмущества,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 9
//	|						ТОГДА База.СтраховаяКомпания
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК КомпанияСтрахованиеИмущества,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 9
//	|						ТОГДА База.СуммаСтрахования
//	|					ИНАЧЕ 0
//	|				КОНЕЦ) КАК СуммаСтрахованиеИмущества,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 9
//	|						ТОГДА База.КВСуммыСтрахования
//	|					ИНАЧЕ 0
//	|				КОНЕЦ) КАК КВСтрахованиеИмущества,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 10
//	|						ТОГДА База.ПрограммаСтрахования
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК ПрограммаПрочее,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 10
//	|						ТОГДА База.ВидСтрахования
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК ВидПрочее,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 10
//	|						ТОГДА База.СтраховаяКомпания
//	|					ИНАЧЕ ""-""
//	|				КОНЕЦ) КАК КомпанияПрочее,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 10
//	|						ТОГДА База.СуммаСтрахования
//	|					ИНАЧЕ 0
//	|				КОНЕЦ) КАК СуммаПрочее,
//	|			МАКСИМУМ(ВЫБОР
//	|					КОГДА База.НомерСтроки = 10
//	|						ТОГДА База.КВСуммыСтрахования
//	|					ИНАЧЕ 0
//	|				КОНЕЦ) КАК КВПрочее
//	|		ИЗ
//	|			(ВЫБРАТЬ
//	|				РабочийЛистКредитногоОтделаСтраховыеПродукты.Ссылка.ДокументОснование.Автомобиль КАК Автомобиль,
//	|				РабочийЛистКредитногоОтделаСтраховыеПродукты.ПрограммаСтрахования.ВидСтрахования.Порядок КАК НомерСтроки,
//	|				РабочийЛистКредитногоОтделаСтраховыеПродукты.ПрограммаСтрахования КАК ПрограммаСтрахования,
//	|				РабочийЛистКредитногоОтделаСтраховыеПродукты.ПрограммаСтрахования.ВидСтрахования КАК ВидСтрахования,
//	|				РабочийЛистКредитногоОтделаСтраховыеПродукты.СтраховаяКомпания КАК СтраховаяКомпания,
//	|				РабочийЛистКредитногоОтделаСтраховыеПродукты.СуммаСтрахования КАК СуммаСтрахования,
//	|				РабочийЛистКредитногоОтделаСтраховыеПродукты.КВ КАК КВСуммыСтрахования
//	|			ИЗ
//	|				Документ.РабочийЛистКредитногоОтдела.СтраховыеПродукты КАК РабочийЛистКредитногоОтделаСтраховыеПродукты) КАК База
//	|		
//	|		СГРУППИРОВАТЬ ПО
//	|			База.Автомобиль) КАК СтраховыеПрограммы
//	|		ПО ВТ_Основа.Автомобиль = СтраховыеПрограммы.Автомобиль
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Поступление КАК ВТ_Поступление
//	|		ПО ВТ_Основа.Автомобиль = ВТ_Поступление.Автомобиль
//	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	|			ПериодыФакторингаАМСрезПоследних.Марка КАК Марка,
//	|			ПериодыФакторингаАМСрезПоследних.БеспроцентныйПериодДней КАК БеспроцентныйПериодДней,
//	|			ПериодыФакторингаАМСрезПоследних.ОбщийПериодДней КАК ОбщийПериодДней
//	|		ИЗ
//	|			РегистрСведений.ПериодыФакторингаАМ.СрезПоследних(КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ), ) КАК ПериодыФакторингаАМСрезПоследних
//	|		ГДЕ
//	|			ПериодыФакторингаАМСрезПоследних.Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)) КАК ПериодыФакторингаМарка
//	|		ПО ВТ_Основа.Автомобиль.Модель.Марка = ПериодыФакторингаМарка.Марка
//	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	|			ПериодыФакторингаАМСрезПоследних.Модель КАК Модель,
//	|			ПериодыФакторингаАМСрезПоследних.БеспроцентныйПериодДней КАК БеспроцентныйПериодДней,
//	|			ПериодыФакторингаАМСрезПоследних.ОбщийПериодДней КАК ОбщийПериодДней
//	|		ИЗ
//	|			РегистрСведений.ПериодыФакторингаАМ.СрезПоследних(КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ), ) КАК ПериодыФакторингаАМСрезПоследних
//	|		ГДЕ
//	|			ПериодыФакторингаАМСрезПоследних.Модель <> ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)) КАК ПериодыФакторингаМодель
//	|		ПО ВТ_Основа.Автомобиль.Модель = ПериодыФакторингаМодель.Модель
//	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	|			РабочийЛистИныеСтраховыеПродукты.Ссылка.Ссылка КАК Ссылка,
//	|			СУММА(РабочийЛистИныеСтраховыеПродукты.КВ) КАК КВ
//	|		ИЗ
//	|			Документ.РабочийЛист.ИныеСтраховыеПродукты КАК РабочийЛистИныеСтраховыеПродукты
//	|		
//	|		СГРУППИРОВАТЬ ПО
//	|			РабочийЛистИныеСтраховыеПродукты.Ссылка.Ссылка) КАК РЛ_ИСП
//	|		ПО ВТ_Основа.РЛ = РЛ_ИСП.Ссылка
//	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	|			УпрощеннаяСистемаНалогообложенияСрезПоследних.Организация КАК Организация,
//	|			1 + УпрощеннаяСистемаНалогообложенияСрезПоследних.СтавкаНДС.Ставка / 100 КАК НалоговаяСтавка
//	|		ИЗ
//	|			РегистрСведений.УпрощеннаяСистемаНалогообложения.СрезПоследних КАК УпрощеннаяСистемаНалогообложенияСрезПоследних) КАК Налогооблажение
//	|		ПО ВТ_Основа.Склад.Организация = Налогооблажение.Организация";
//	
//	// Уничтожение временных таблиц 	
//	ЗапросУничтожить1 = Новый Запрос;	
//	ЗапросУничтожить1.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
//	ЗапросУничтожить1.Текст =  
//	"УНИЧТОЖИТЬ ВТ_Дни";
//	
//	ЗапросУничтожить2 = Новый Запрос;	
//	ЗапросУничтожить2.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
//	ЗапросУничтожить2.Текст =  
//	"УНИЧТОЖИТЬ ВТ_ОО"; 
//	
//	ЗапросУничтожить3 = Новый Запрос;	
//	ЗапросУничтожить3.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
//	ЗапросУничтожить3.Текст =  
//	"УНИЧТОЖИТЬ ВТ_Строки"; 	

//	ЗапросУничтожить4 = Новый Запрос;	
//	ЗапросУничтожить4.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
//	ЗапросУничтожить4.Текст =  
//	"УНИЧТОЖИТЬ ВТ_ТИ"; 
//	
//	ЗапросУничтожить5 = Новый Запрос;	
//	ЗапросУничтожить5.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
//	ЗапросУничтожить5.Текст =  
//	"УНИЧТОЖИТЬ ВТ_Поступление"; 	

//	ЗапросУничтожить6 = Новый Запрос;	
//	ЗапросУничтожить6.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
//	ЗапросУничтожить6.Текст =  
//	"УНИЧТОЖИТЬ ВТ_Основа"; 	
//	
//	// Дневной цикл 
//	Пока Дата < НачалоДня(ТекущаяДата()) Цикл   
//		
//		ТекстовыйФайл = Новый ТекстовыйДокумент;			
//		ИмяФайла = "Avto_na_skladah_max_" + Строка(Формат(Дата, "ДФ=yyyyMMdd")) + ".csv";		
//		
//		Запрос.УстановитьПараметр("Дата1", НачалоДня(Дата));
//		Запрос.УстановитьПараметр("Дата2", КонецДня(Дата));
//		СписокЧанганы = Новый СписокЗначений;
//		СписокЧанганы.Добавить(Справочники.Автомобили.НайтиПоРеквизиту("VIN", "LS4ASE2A5RJ104624"));
//		СписокЧанганы.Добавить(Справочники.Автомобили.НайтиПоРеквизиту("VIN", "LS4ASE2A7RA707123"));
//		СписокЧанганы.Добавить(Справочники.Автомобили.НайтиПоРеквизиту("VIN", "LS4ASE2A5RJ106714"));
//		СписокЧанганы.Добавить(Справочники.Автомобили.НайтиПоРеквизиту("VIN", "LS5A2DKR7RA016010"));		
//		Запрос.УстановитьПараметр("Чанганы", СписокЧанганы);  
//		СписокВидыАвто = Новый СписокЗначений;
//		СписокВидыАвто.Добавить(Перечисления.ВидАвтомобиля.Новый);  
//		СписокВидыАвто.Добавить(Перечисления.ВидАвтомобиля.ПараллельныйИмпорт);  
//		СписокВидыАвто.Добавить(Перечисления.ВидАвтомобиля.ПодменныйАвтомобиль);  
//		СписокВидыАвто.Добавить(Перечисления.ВидАвтомобиля.ТестовыйАвтомобиль);  
//		СписокВидыАвто.Добавить(Перечисления.ВидАвтомобиля.АвтомобильСПробегом);  
//		Запрос.УстановитьПараметр("ВидыАвто", СписокВидыАвто);		
//		
//		Выборка = Запрос.Выполнить().Выбрать();	 		
//		
//		Пока Выборка.Следующий() Цикл  
//			СтрокаПорция =   
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.Дата, "ДЛФ=DT")))                                                       + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.ДилерскийЦентр))                                                               + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Подразделение))                                                                + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Склад))                                                                        + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Автомобиль))                                                                   + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.ВидАвтомобиля))                                                                + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.VIN))                                                                          + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Бренд))                                                                        + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Модель))                                                                       + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.ВариантКомплектации))                                                          + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ГодВыпуска, "ДЛФ=DT")))                                                 + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.СобственникАвтомобиля))                                                        + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Отчитан))                                                                      + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.БлокировкаПродажи))                                                            + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.РабочийЛист))                                                                  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Реализация))                                                                   + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.Количество_Остаток_Оборот, "ЧН=0")))                                    + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.Сумма_Остаток_Оборот, "ЧН=0")))                                         + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ДатаРитейла, "ДЛФ=DT")))                                                + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ДатаРитейла2, "ДЛФ=DT")))                                               + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СкидкаПриПокупкеВТрейдИн, "ЧН=0")))                                     + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СкидкаПриПокупкеВКредит, "ЧН=0")))                                      + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.НомерДатаПерезачета))                                                          + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Оплачен))                                                                      + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ДатаОплаты, "ДЛФ=DT")))                                                 + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.РазмерСкидки, "ЧН=0")))                                                 + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ОжидаемаяДатаПолученияКомпенсации, "ДЛФ=DT")))                          + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.РазмерКомпенсации, "ЧН=0")))                                            + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.НаличныйРасчет))                                                               + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.БезналичныйРасчет))                                                            + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Кредит))                                                                       + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Обмен))                                                                        + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Лизинг))                                                                       + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ПредоплатаЗаАМ, "ЧН=0")))                                               + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ДатаПредоплатыЗаАМ, "ДЛФ=DT")))                                         + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Покупатель))                                                                   + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.РРЦ, "ЧН=0")))                                                          + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.Инвойс, "ЧН=0")))                                                       + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СкидкаТрейдИнПлан, "ЧН=0")))                                            + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СкидкаТрейдИнФакт, "ЧН=0")))                                            + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СкидкаТрейдИн2План, "ЧН=0")))                                           + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СкидкаТрейдИн2Факт, "ЧН=0")))                                           + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СкидкаСубсидияКредитПлан, "ЧН=0")))                                     + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СкидкаСубсидияКредитФакт, "ЧН=0")))                                     + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СкидкаПоПрограммамЛояльности, "ЧН=0")))                                 + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СкидкаПоСпецПрограмме, "ЧН=0")))                                        + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СкидкаРозничная, "ЧН=0")))                                              + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СкидкаДополнительная, "ЧН=0")))                                         + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СтоимостьДопОборудования_Маркетинг, "ЧН=0")))                           + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СтоимостьДопОборудования, "ЧН=0")))                                     + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ПлановаяСтоимостьДО, "ЧН=0")))                                          + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СебестоимостьДО, "ЧН=0")))                                              + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СебестоимостьДО_Комплектации, "ЧН=0")))                                 + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СуммаДО, "ЧН=0")))                                                      + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ЦенаДопПоПрайсу, "ЧН=0")))                                              + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ПредоплатаТО, "ЧН=0")))                                                 + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.КомпенсацияТрейдИНРетроспективная, "ЧН=0")))                            + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.КомпенсацияСубсидияКредитРетроспективная, "ЧН=0")))                     + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.КомпенсацияПоПрограммамЛояльностиРетроспективная, "ЧН=0")))             + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.КомпенсацияРозничнаяРетроспективная, "ЧН=0")))                          + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.КомпенсацияТрейдИН2Ретроспективная, "ЧН=0")))                           + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.КомпенсацияРетроспективная, "ЧН=0")))                                   + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля, "ЧН=0")))  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СуммаКомпенсации, "ЧН=0")))                                             + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.КомпенсацияВИнвойсе, "ЧН=0")))                                          + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.КомпенсацияБрокерФинанс, "ЧН=0")))                                      + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СуммаКаско, "ЧН=0")))                                                   + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.ВариантКаско))                                                                 + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СуммаОсаго, "ЧН=0")))                                                   + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.ВариантОсаго))                                                                 + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СуммаСтрахованиеЖизни, "ЧН=0")))                                        + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.ВариантСтрахованиеЖизни))                                                      + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ЦенаФакт, "ЧН=0")))                                                     + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ЦенаДоговора, "ЧН=0")))                                                 + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ПервоначальныйВзнос, "ЧН=0")))                                          + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ДатаПервоначальногоВзноса, "ДЛФ=DT")))                                  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.БанкЛК))                                                                       + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.КредитнаяСтоимость, "ЧН=0")))                                           + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ПрогнозСрокаПодготовкиАвтоВДнях, "ЧН=0")))                              + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ПрогнозСуммыРемонта, "ЧН=0")))                                          + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ПрогнозСуммыДетейлинга, "ЧН=0")))                                       + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ПрогнозируемаяЦенаПродажи, "ЧН=0")))                                    + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ПрогнозСрокаПродажиАвтоВДнях, "ЧН=0")))                                 + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ПрогнозСуммыМКЦ, "ЧН=0")))                                              + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ЦенаМинРыночнаяТрейдИн, "ЧН=0")))                                       + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ПланируемаяЦенаПродажиТрейдИн, "ЧН=0")))                                + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ЦенаДКПТрейдИн, "ЧН=0")))                                               + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ДатаРитейла_РЛ, "ДЛФ=DT")))                                             + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СуммаИСП, "ЧН=0")))                                                     + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.КоличествоДолгаОП, "ЧН=0")))                                            + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Резерв))                                                                       + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ДатаПоступленияВГК, "ДЛФ=DT")))                                         + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ДатаФинансирования, "ДЛФ=DT")))                                         + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ДатаПриемкиНаТекушийСклад, "ДЛФ=DT")))                                  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СрокХранения, "ЧН=0")))                                                 + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.ГарантияПИ))                                                                   + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.БонусЗаМодель, "ЧН=0")))                                                + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ЦелеваяДоходность, "ЧН=0")))                                            + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.БонусЗаШтуку, "ЧН=0")))                                                 + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СтоимостьСуточногоХранения, "ЧН=0")))                                   + ";" +
//			ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ОбщаяСтоимостьХранения, "ЧН=0")))		                                  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_1))																		  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_2))														 				  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_3))														 				  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_4))																		  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_5))																		  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_6))																		  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_7))																		  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_8))																		  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_9))																		  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_10))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_11))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_12))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_13))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_14))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_15))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_16))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_17))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_18))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_19))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_20))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_21))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_22))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_23))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_24))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_25))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_26))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_27))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_28))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_29))																	  + ";" +			
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_30))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_31))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_32))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_33))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_34))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_35))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_36))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_37))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_38))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_39))																	  + ";" +			
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_40))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_41))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_42))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_43))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_44))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_45))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_46))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_47))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_48))																	  + ";" +
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_49))																	  + ";" +						
//			ФорматироватьДляCSV(СокрЛП(Выборка.Tech_50));    
//			ТекстовыйФайл.ДобавитьСтроку(СтрокаПорция);  
//		КонецЦикла;	 
//		
//		Попытка
//			ТекстовыйФайл.Записать(ГдеСоздавать + ИмяФайла); 
//		Исключение
//		КонецПопытки; 
//		
//		ЗапросУничтожить1.Выполнить();
//		ЗапросУничтожить2.Выполнить();
//		ЗапросУничтожить3.Выполнить();
//		ЗапросУничтожить4.Выполнить();		
//		ЗапросУничтожить5.Выполнить();
//		ЗапросУничтожить6.Выполнить();
//				
//		Дата = Дата + 86400;  
//	КонецЦикла;   
//	
//	УдалитьФайлы(ГдеСоздавать, МаскаФайла); 
//	ОбъединитьФайлы(ГдеСоздавать + "Avto_na_skladah_max_*", ГдеСоздавать + МаскаФайла);
//	УдалитьФайлы(ГдеСоздавать, "Avto_na_skladah_max_*");   
//КонецПроцедуры  
//Иванченко 20260408 --
# КонецОбласти
//Иванченко 20260525 --

// Вспомогательная функция для корректирования данных для CSV
Функция ФорматироватьДляCSV(Значение) Экспорт
	//Иванченко 20260213 ++    
	//СтрокаЗначения = Строка(СтрокаДока);
	//НайденоОсобыхСимволов = Ложь;
	//
	//// Проверка на наличие опасных символов
	//НайденоОсобыхСимволов = НайденоОсобыхСимволов Или (СтрНайти(СтрокаЗначения, ";") > 0);
	//НайденоОсобыхСимволов = НайденоОсобыхСимволов Или (СтрНайти(СтрокаЗначения, Символ(34)) > 0);   // "
	//НайденоОсобыхСимволов = НайденоОсобыхСимволов Или (СтрНайти(СтрокаЗначения, Символы.ПС) > 0);   // \n
	//НайденоОсобыхСимволов = НайденоОсобыхСимволов Или (СтрНайти(СтрокаЗначения, Символы.ВК) > 0);   // \r
	//
	//Если НайденоОсобыхСимволов Тогда
	//    // Экранирование кавычек (удвоение)
	//    СтрокаЗначения = СтрЗаменить(СтрокаЗначения, """", """""");
	//    // Обрамление в двойные кавычки
	//    Возврат """" + СтрокаЗначения + """";
	//Иначе
	//    Возврат СтрокаЗначения;
	//КонецЕсли;
	
	//Форматирование вывода
	Если Значение = Неопределено ИЛИ Значение = NULL Тогда
		Возврат "";
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		СтрокаЗначения = СокрЛП(Значение);
	ИначеЕсли ТипЗнч(Значение) = Тип("Булево") Тогда
		СтрокаЗначения = СокрЛП(Формат(Значение, "БЛ=Нет; БИ=Да")); 
	ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда
		СтрокаЗначения = СокрЛП(Формат(Значение, "ЧРД=,; ЧН=0; ЧГ=0; ЧО=1"));
	ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда
		СтрокаЗначения = СокрЛП(?(Формат(Значение, "ДФ='dd.MM.yyyy HH:mm:ss'; ДП=-") = "-", "", Формат(Значение, "ДФ='dd.MM.yyyy HH:mm:ss'; ДП=-")));	
	КонецЕсли;
	
	НайденоОсобыхСимволов = Ложь;
	
	// Проверка на наличие опасных символов
	НайденоОсобыхСимволов = НайденоОсобыхСимволов Или (СтрНайти(СтрокаЗначения, ";") > 0);
	НайденоОсобыхСимволов = НайденоОсобыхСимволов Или (СтрНайти(СтрокаЗначения, Символ(34)) > 0); // " 
	НайденоОсобыхСимволов = НайденоОсобыхСимволов Или (СтрНайти(СтрокаЗначения, Символ(160)) > 0); // неразрывный пробел
	НайденоОсобыхСимволов = НайденоОсобыхСимволов Или (СтрНайти(СтрокаЗначения, Символы.ПС) > 0);   // \n
	НайденоОсобыхСимволов = НайденоОсобыхСимволов Или (СтрНайти(СтрокаЗначения, Символы.ВК) > 0);   // \r
	
	Если НайденоОсобыхСимволов Тогда
		// Экранирование кавычек (удвоение)
		СтрокаЗначения = СтрЗаменить(СтрокаЗначения, """", """""");
		// Обрамление в двойные кавычки
		Возврат """" + СтрокаЗначения + """";
	Иначе
		Возврат СтрокаЗначения;
	КонецЕсли;
	//Иванченко 20260213 ++    	
КонецФункции
//Иванченко 20250512 --

//Иванченко 20250515 ++ 
Процедура КонверсияРЛС_ЗНР_РЛ() Экспорт        
	//ГдеСоздавать = "C:\Users\ivanchenko_ii\Downloads\Для Антона\Конверсия\";  
	ГдеСоздавать = "\\1cserver\powerbi\RablistServ_v_ZayavkuNaRemont_v_ZakazNaryad\";		
	МаскаФайла = "RLS_Conv.csv";	
	
	Запрос = Новый Запрос;	
	Запрос.Текст =
	//Иванченко 20260421 ++
	#Область Устарело
	//"ВЫБРАТЬ
	//|	РабочийЛистСервиса.ПодразделениеКомпании.ДилерскийЦентр КАК ДилерскийЦентр,
	//|	РабочийЛистСервиса.Менеджер КАК ОператорСБ,
	//|	РабочийЛистСервиса.Дата КАК РабочийЛистСервисаДата,
	//|	РабочийЛистСервиса.Номер КАК РабочийЛистСервисаНомер,
	//|	ЗаявкаНаРемонт.Ссылка.Дата КАК ЗаявкаНаРемонтДата,
	//|	ЗаявкаНаРемонт.Ссылка.Номер КАК ЗаявкаНаРемонтНомер,
	//|	ЗаказНаряд.Ссылка.Дата КАК ЗаказНарядДата,
	//|	ЗаказНаряд.Ссылка.Номер КАК ЗаказНарядНомер,
	//|	РегистрацияЗвонковИКонтактов.ОператорКЦ КАК ОператорКЦ,
	//|	РегистрацияЗвонковИКонтактов.ВходящихЗвонков КАК ВходящихЗвонков,
	//|	РегистрацияЗвонковИКонтактов.Недозвонов КАК Недозвонов
	//|ИЗ
	//|	Документ.РабочийЛистСервиса КАК РабочийЛистСервиса
	//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			ЗаявкаНаРемонт.Ссылка КАК Ссылка,
	//|			ЗаявкаНаРемонт.ДокументОснование КАК ДокументОснование
	//|		ИЗ
	//|			Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт) КАК ЗаявкаНаРемонт
	//|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|				ЗаказНаряд.Ссылка КАК Ссылка,
	//|				ЗаказНаряд.ДокументОснование КАК ДокументОснование
	//|			ИЗ
	//|				Документ.ЗаказНаряд КАК ЗаказНаряд) КАК ЗаказНаряд
	//|			ПО ЗаявкаНаРемонт.Ссылка = ЗаказНаряд.ДокументОснование
	//|		ПО РабочийЛистСервиса.Ссылка = ЗаявкаНаРемонт.ДокументОснование
	//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			РегистрацияЗвонковИКонтактов.Автор КАК ОператорКЦ,
	//|			РегистрацияЗвонковИКонтактов.РабочийЛист КАК РабочийЛист,
	//|			РегистрацияЗвонковИКонтактов.Участник.Подразделение КАК Подразделение,
	//|			1 КАК ВходящихЗвонков,
	//|			ВЫБОР
	//|				КОГДА РегистрацияЗвонковИКонтактов.НеУдалосьСоединить
	//|					ТОГДА 1
	//|				ИНАЧЕ 0
	//|			КОНЕЦ КАК Недозвонов
	//|		ИЗ
	//|			РегистрСведений.РегистрацияЗвонковИКонтактов КАК РегистрацияЗвонковИКонтактов
	//|		ГДЕ
	//|			РегистрацияЗвонковИКонтактов.ДатаДень <= &ТекДата
	//|			И РегистрацияЗвонковИКонтактов.ВидКонтакта = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ТелефонныйЗвонок)
	//|			И РегистрацияЗвонковИКонтактов.ТипСообщения = ЗНАЧЕНИЕ(Перечисление.ТипыСообщений.Входящее)
	//|			И РегистрацияЗвонковИКонтактов.РабочийЛист ССЫЛКА Документ.РабочийЛистСервиса) КАК РегистрацияЗвонковИКонтактов
	//|		ПО РабочийЛистСервиса.Ссылка = РегистрацияЗвонковИКонтактов.РабочийЛист
	//|ГДЕ
	//|	РабочийЛистСервиса.Дата МЕЖДУ ДАТАВРЕМЯ(2024, 1, 1) И &ТекДата
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	РабочийЛистСервисаДата";  
	#КонецОбласти
	"ВЫБРАТЬ
	|	МИНИМУМ(Событие.Ссылка) КАК ВхЗвонок,
	|	ВЫРАЗИТЬ(Событие.ДокументОснование КАК Документ.РабочийЛистСервиса) КАК РЛС
	|ПОМЕСТИТЬ ВТ_ВхЗвонкиРЛС_Объединение
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.Проведен
	|	И НЕ Событие.ПометкаУдаления
	|	И Событие.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ТелефонныйЗвонок)
	|	И Событие.ТипСообщения = ЗНАЧЕНИЕ(Перечисление.ТипыСообщений.Входящее)
	|	И Событие.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСобытий.Завершено)
	|	И Событие.ДокументОснование ССЫЛКА Документ.РабочийЛистСервиса
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(Событие.ДокументОснование КАК Документ.РабочийЛистСервиса)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РабочийЛистСервиса.ДокументОснование,
	|	РабочийЛистСервиса.Ссылка
	|ИЗ
	|	Документ.РабочийЛистСервиса КАК РабочийЛистСервиса
	|ГДЕ
	|	РабочийЛистСервиса.Проведен
	|	И НЕ РабочийЛистСервиса.ПометкаУдаления
	|	И РабочийЛистСервиса.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Продажа)
	|	И РабочийЛистСервиса.ДокументОснование ССЫЛКА Документ.Событие
	|	И РабочийЛистСервиса.ДокументОснование.Проведен
	|	И НЕ РабочийЛистСервиса.ДокументОснование.ПометкаУдаления
	|	И РабочийЛистСервиса.ДокументОснование.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ТелефонныйЗвонок)
	|	И РабочийЛистСервиса.ДокументОснование.ТипСообщения = ЗНАЧЕНИЕ(Перечисление.ТипыСообщений.Входящее)
	|	И РабочийЛистСервиса.ДокументОснование.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСобытий.Завершено)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МИНИМУМ(ВТ_ВхЗвонкиРЛС_Объединение.ВхЗвонок) КАК ВхЗвонок,
	|	ВТ_ВхЗвонкиРЛС_Объединение.РЛС КАК РЛС
	|ПОМЕСТИТЬ ВТ_ВхЗвонкиРЛС
	|ИЗ
	|	ВТ_ВхЗвонкиРЛС_Объединение КАК ВТ_ВхЗвонкиРЛС_Объединение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВхЗвонкиРЛС_Объединение.РЛС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ЗаявкаНаРемонт.ДокументОснование КАК Документ.РабочийЛистСервиса), ВЫРАЗИТЬ(ЗаявкаНаРемонт.ДокументОснование.ДокументОснование КАК Документ.РабочийЛистСервиса)) КАК РЛС,
	|	ЗаявкаНаРемонт.Ссылка КАК ЗнР
	|ПОМЕСТИТЬ ВТ_РЛСЗнР
	|ИЗ
	|	Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
	|ГДЕ
	|	ЗаявкаНаРемонт.Проведен
	|	И НЕ ЗаявкаНаРемонт.ПометкаУдаления
	|	И ЗаявкаНаРемонт.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияЗаявкиНаРемонт.Отклонено)
	|	И (ЗаявкаНаРемонт.ДокументОснование ССЫЛКА Документ.РабочийЛистСервиса
	|			ИЛИ ЗаявкаНаРемонт.ДокументОснование.ДокументОснование ССЫЛКА Документ.РабочийЛистСервиса)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ВхЗвонкиРЛС.ВхЗвонок КАК ВхЗвонок,
	|	ВТ_ВхЗвонкиРЛС.РЛС КАК РЛС,
	|	МИНИМУМ(ВТ_РЛСЗнР.ЗнР) КАК ЗнР
	|ПОМЕСТИТЬ ВТ_ВхЗвонкиРЛСЗнР
	|ИЗ
	|	ВТ_ВхЗвонкиРЛС КАК ВТ_ВхЗвонкиРЛС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РЛСЗнР КАК ВТ_РЛСЗнР
	|		ПО ВТ_ВхЗвонкиРЛС.РЛС = ВТ_РЛСЗнР.РЛС
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВхЗвонкиРЛС.ВхЗвонок,
	|	ВТ_ВхЗвонкиРЛС.РЛС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказНаряд.Ссылка КАК ЗН,
	|	ЗаказНаряд.ДокументОснование КАК ЗнР
	|ПОМЕСТИТЬ ВТ_ЗнРЗН
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|ГДЕ
	|	ЗаказНаряд.Проведен
	|	И НЕ ЗаказНаряд.ПометкаУдаления
	|	И ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
	|	И ЗаказНаряд.ДокументОснование ССЫЛКА Документ.ЗаявкаНаРемонт
	|	И ЗаказНаряд.ДокументОснование.Проведен
	|	И НЕ ЗаказНаряд.ДокументОснование.ПометкаУдаления
	|	И ЗаказНаряд.ДокументОснование.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияЗаявкиНаРемонт.Отклонено)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВхЗвонкиРЛСЗнР.ВхЗвонок КАК ВхЗвонок,
	|	ВТ_ВхЗвонкиРЛСЗнР.РЛС КАК РЛС,
	|	ВТ_ВхЗвонкиРЛСЗнР.ЗнР КАК ЗнР,
	|	МИНИМУМ(ВТ_ЗнРЗН.ЗН) КАК ЗН
	|ПОМЕСТИТЬ ВТ_ВхЗвонкиРЛСЗнРЗН
	|ИЗ
	|	ВТ_ВхЗвонкиРЛСЗнР КАК ВТ_ВхЗвонкиРЛСЗнР
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗнРЗН КАК ВТ_ЗнРЗН
	|		ПО ВТ_ВхЗвонкиРЛСЗнР.ЗнР = ВТ_ЗнРЗН.ЗнР
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВхЗвонкиРЛСЗнР.ВхЗвонок,
	|	ВТ_ВхЗвонкиРЛСЗнР.РЛС,
	|	ВТ_ВхЗвонкиРЛСЗнР.ЗнР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВхЗвонкиРЛСЗнРЗН.РЛС.ПодразделениеКомпании.ДилерскийЦентр КАК ДилерскийЦентр,
	|	ВТ_ВхЗвонкиРЛСЗнРЗН.РЛС.Менеджер КАК ОператорСБ,
	|	ВТ_ВхЗвонкиРЛСЗнРЗН.РЛС.Дата КАК РабочийЛистСервисаДата,
	|	ВТ_ВхЗвонкиРЛСЗнРЗН.РЛС.Номер КАК РабочийЛистСервисаНомер,
	|	ВТ_ВхЗвонкиРЛСЗнРЗН.ЗнР.Дата КАК ЗаявкаНаРемонтДата,
	|	ВТ_ВхЗвонкиРЛСЗнРЗН.ЗнР.Номер КАК ЗаявкаНаРемонтНомер,
	|	ВТ_ВхЗвонкиРЛСЗнРЗН.ЗН.Дата КАК ЗаказНарядДата,
	|	ВТ_ВхЗвонкиРЛСЗнРЗН.ЗН.Номер КАК ЗаказНарядНомер,
	|	РегистрацияЗвонковИКонтактов.Автор КАК ОператорКЦ,
	|	1 КАК ВходящихЗвонков,
	|	ВЫБОР
	|		КОГДА РегистрацияЗвонковИКонтактов.НеУдалосьСоединить
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Недозвонов
	|ИЗ
	|	ВТ_ВхЗвонкиРЛСЗнРЗН КАК ВТ_ВхЗвонкиРЛСЗнРЗН
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияЗвонковИКонтактов КАК РегистрацияЗвонковИКонтактов
	|		ПО ВТ_ВхЗвонкиРЛСЗнРЗН.РЛС = РегистрацияЗвонковИКонтактов.РабочийЛист
	|ГДЕ
	|	РегистрацияЗвонковИКонтактов.ДатаДень <= &ТекДата
	|	И РегистрацияЗвонковИКонтактов.ВидКонтакта = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ТелефонныйЗвонок)
	|	И РегистрацияЗвонковИКонтактов.ТипСообщения = ЗНАЧЕНИЕ(Перечисление.ТипыСообщений.Входящее)
	|	И РегистрацияЗвонковИКонтактов.РабочийЛист ССЫЛКА Документ.РабочийЛистСервиса
	|	И РегистрацияЗвонковИКонтактов.ДокументСобытие.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСобытий.Завершено)
	|	И НЕ РегистрацияЗвонковИКонтактов.ВторичныйКонтакт
	|	И ВТ_ВхЗвонкиРЛСЗнРЗН.РЛС.Дата >= ДАТАВРЕМЯ(2024, 1, 1)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ВхЗвонкиРЛСЗнРЗН.РЛС.Дата";	
	//Иванченко 20260421 --	
			
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());		
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	ТекстовыйФайл = Новый ТекстовыйДокумент;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 				
		Строка = 	
		ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.ДилерскийЦентр))			 			    		 + ";" + 				
		ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.ОператорСБ))  				    				 + ";" +   		
		ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.РабочийЛистСервисаДата, "ДЛФ=DT")))		 + ";" + 
		ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.РабочийЛистСервисаНомер))							 + ";" +
		ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.ЗаявкаНаРемонтДата, "ДЛФ=DT")))			 + ";" + 
		ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.ЗаявкаНаРемонтНомер))			    				 + ";" + 			
		ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.ЗаказНарядДата, "ДЛФ=DT")))	 			 + ";" + 
		ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.ЗаказНарядНомер))						 			 + ";" +
		ФорматироватьДляCSV(СокрЛП(ВыборкаДетальныеЗаписи.ОператорКЦ))	 	 								 + ";" +
		ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.ВходящихЗвонков, "ЧДЦ=2; ЧРД=.; ЧН=0.00"))) + ";" +
		ФорматироватьДляCSV(СокрЛП(Формат(ВыборкаДетальныеЗаписи.Недозвонов, "ЧДЦ=2; ЧРД=.; ЧН=0.00"))); 				
		ТекстовыйФайл.ДобавитьСтроку(Строка);	
	КонецЦикла;	
	
	ТекстовыйФайл.Записать(ГдеСоздавать + МаскаФайла);	
	
	//Иванченко 20260622 ++  
	ВыгрузитьТоварыКомплектацииВCSV();
	//Иванченко 20260622 --
КонецПроцедуры
//Иванченко 20250515 --

//Иванченко 20260402 ++
Процедура ВыгрузитьТоварыКомплектацииВCSV() Экспорт      
	ГдеСоздавать = "\\1cserver\powerbi\service\";
	МаскаФайла = "komplekt.csv";
	МассивФайлов = НайтиФайлы(ГдеСоздавать, МаскаФайла); 	
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КомплектацияАвтомобиляТовары.Ссылка.Дата КАК КомплектацияАвтомобиляДата,
	|	КомплектацияАвтомобиляТовары.Ссылка.Номер КАК КомплектацияАвтомобиляНомер,
	|	КомплектацияАвтомобиляТовары.Ссылка.Автор КАК Автор,
	|	КомплектацияАвтомобиляТовары.Ссылка.ПодразделениеКомпании.ДилерскийЦентр КАК ДилерскийЦентр,
	|	КомплектацияАвтомобиляТовары.Номенклатура КАК Номенклатура,
	|	КомплектацияАвтомобиляТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
	|	СУММА(КомплектацияАвтомобиляРаботы.Цена) / КОЛИЧЕСТВО(КомплектацияАвтомобиляРаботы.Работа) КАК УдельнаяЦенаРабот,
	|	СУММА(КомплектацияАвтомобиляРаботы.Нормочас.Цена) / КОЛИЧЕСТВО(КомплектацияАвтомобиляРаботы.Работа) КАК УдельныйНормочас,
	|	ЕСТЬNULL(ПродажиОбороты.СуммаОборот, КомплектацияАвтомобиляТовары.Сумма) КАК СуммаТовары,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПродажиОбороты.СебестоимостьОборот, ПеремещениеТоваровВПроизводствоТовары.СуммаРозничная) = 0
	|			ТОГДА ПартииТоваровКомпанииОбороты.СуммаРасход
	|		ИНАЧЕ ЕСТЬNULL(ПродажиОбороты.СебестоимостьОборот, ПеремещениеТоваровВПроизводствоТовары.СуммаРозничная)
	|	КОНЕЦ КАК СебестоимостьТовары,
	|	ОКР((ЕСТЬNULL(ПродажиОбороты.СуммаОборот, КомплектацияАвтомобиляТовары.Сумма) / ВЫБОР
	|			КОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ПродажиОбороты.СебестоимостьОборот, ПеремещениеТоваровВПроизводствоТовары.СуммаРозничная) = 0
	|						ТОГДА ПартииТоваровКомпанииОбороты.СуммаРасход
	|					ИНАЧЕ ЕСТЬNULL(ПродажиОбороты.СебестоимостьОборот, ПеремещениеТоваровВПроизводствоТовары.СуммаРозничная)
	|				КОНЕЦ = 0
	|				ТОГДА 1
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЕСТЬNULL(ПродажиОбороты.СебестоимостьОборот, ПеремещениеТоваровВПроизводствоТовары.СуммаРозничная) = 0
	|						ТОГДА ПартииТоваровКомпанииОбороты.СуммаРасход
	|					ИНАЧЕ ЕСТЬNULL(ПродажиОбороты.СебестоимостьОборот, ПеремещениеТоваровВПроизводствоТовары.СуммаРозничная)
	|				КОНЕЦ
	|		КОНЕЦ - 1) * 100) КАК НаценкаТовары,
	|	ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, КомплектацияАвтомобиляТовары.Количество) КАК КоличествоТовары,
	|	КомплектацияАвтомобиляТовары.Коэффициент КАК Коэффициент,
	|	ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, КомплектацияАвтомобиляТовары.Количество) * КомплектацияАвтомобиляТовары.Коэффициент КАК КоличествоБазовое,
	|	КомплектацияАвтомобиляТовары.Ссылка КАК Ссылка,
	|	АВТОНОМЕРЗАПИСИ() КАК Индекс
	|ПОМЕСТИТЬ ВТ_Рез
	|ИЗ
	|	Документ.КомплектацияАвтомобиля.Товары КАК КомплектацияАвтомобиляТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(, , Регистратор, ) КАК ПродажиОбороты
	|		ПО КомплектацияАвтомобиляТовары.Ссылка = ПродажиОбороты.Регистратор
	|			И КомплектацияАвтомобиляТовары.Номенклатура = ПродажиОбороты.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваровВПроизводство.Товары КАК ПеремещениеТоваровВПроизводствоТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровКомпании.Обороты(, , Регистратор, ) КАК ПартииТоваровКомпанииОбороты
	|			ПО ПеремещениеТоваровВПроизводствоТовары.Ссылка = ПартииТоваровКомпанииОбороты.Регистратор
	|				И ПеремещениеТоваровВПроизводствоТовары.Номенклатура = ПартииТоваровКомпанииОбороты.Номенклатура
	|		ПО КомплектацияАвтомобиляТовары.Ссылка = ПеремещениеТоваровВПроизводствоТовары.Ссылка.ДокументОснование
	|			И КомплектацияАвтомобиляТовары.Номенклатура = ПеремещениеТоваровВПроизводствоТовары.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КомплектацияАвтомобиля.Работы КАК КомплектацияАвтомобиляРаботы
	|		ПО КомплектацияАвтомобиляТовары.Ссылка = КомплектацияАвтомобиляРаботы.Ссылка
	|ГДЕ
	|	КомплектацияАвтомобиляТовары.Ссылка.Проведен
	|	И КомплектацияАвтомобиляТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
	|	И КомплектацияАвтомобиляТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ТекДата
	|
	|СГРУППИРОВАТЬ ПО
	|	КомплектацияАвтомобиляТовары.Номенклатура,
	|	КомплектацияАвтомобиляТовары.Ссылка,
	|	КомплектацияАвтомобиляТовары.Ссылка.Дата,
	|	КомплектацияАвтомобиляТовары.Ссылка.Номер,
	|	КомплектацияАвтомобиляТовары.Ссылка.ПодразделениеКомпании.ДилерскийЦентр,
	|	КомплектацияАвтомобиляТовары.Номенклатура.Артикул,
	|	ЕСТЬNULL(ПродажиОбороты.СуммаОборот, КомплектацияАвтомобиляТовары.Сумма),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПродажиОбороты.СебестоимостьОборот, ПеремещениеТоваровВПроизводствоТовары.СуммаРозничная) = 0
	|			ТОГДА ПартииТоваровКомпанииОбороты.СуммаРасход
	|		ИНАЧЕ ЕСТЬNULL(ПродажиОбороты.СебестоимостьОборот, ПеремещениеТоваровВПроизводствоТовары.СуммаРозничная)
	|	КОНЕЦ,
	|	ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, КомплектацияАвтомобиляТовары.Количество) * КомплектацияАвтомобиляТовары.Коэффициент,
	|	ОКР((ЕСТЬNULL(ПродажиОбороты.СуммаОборот, КомплектацияАвтомобиляТовары.Сумма) / ВЫБОР
	|			КОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ПродажиОбороты.СебестоимостьОборот, ПеремещениеТоваровВПроизводствоТовары.СуммаРозничная) = 0
	|						ТОГДА ПартииТоваровКомпанииОбороты.СуммаРасход
	|					ИНАЧЕ ЕСТЬNULL(ПродажиОбороты.СебестоимостьОборот, ПеремещениеТоваровВПроизводствоТовары.СуммаРозничная)
	|				КОНЕЦ = 0
	|				ТОГДА 1
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЕСТЬNULL(ПродажиОбороты.СебестоимостьОборот, ПеремещениеТоваровВПроизводствоТовары.СуммаРозничная) = 0
	|						ТОГДА ПартииТоваровКомпанииОбороты.СуммаРасход
	|					ИНАЧЕ ЕСТЬNULL(ПродажиОбороты.СебестоимостьОборот, ПеремещениеТоваровВПроизводствоТовары.СуммаРозничная)
	|				КОНЕЦ
	|		КОНЕЦ - 1) * 100),
	|	ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, КомплектацияАвтомобиляТовары.Количество),
	|	КомплектацияАвтомобиляТовары.Коэффициент,
	|	КомплектацияАвтомобиляТовары.Ссылка.Автор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Индекс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Рез.Ссылка КАК Комплектация,
	|	КомплектацияАвтомобилейОбороты.Период КАК Период,
	|	КомплектацияАвтомобилейОбороты.Автомобиль КАК Автомобиль,
	|	КомплектацияАвтомобилейОбороты.Номенклатура КАК Номенклатура,
	|	КомплектацияАвтомобилейОбороты.КоличествоОборот КАК КоличествоОборот,
	|	КомплектацияАвтомобилейОбороты.СуммаОборот КАК СуммаОборот
	|ПОМЕСТИТЬ ВТ_РегКомпл1
	|ИЗ
	|	ВТ_Рез КАК ВТ_Рез
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.КомплектацияАвтомобилей.Обороты(, , Регистратор, ) КАК КомплектацияАвтомобилейОбороты
	|		ПО ВТ_Рез.Ссылка = КомплектацияАвтомобилейОбороты.Регистратор
	|			И ВТ_Рез.Номенклатура = КомплектацияАвтомобилейОбороты.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_РегКомпл1.Комплектация КАК Комплектация,
	|	ВТ_РегКомпл1.Номенклатура КАК Номенклатура,
	|	КомплектацияАвтомобилейОбороты.Регистратор КАК ЗН
	|ПОМЕСТИТЬ ВТ_РегКомпл2
	|ИЗ
	|	ВТ_РегКомпл1 КАК ВТ_РегКомпл1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.КомплектацияАвтомобилей.Обороты(, , Регистратор, ) КАК КомплектацияАвтомобилейОбороты
	|		ПО ВТ_РегКомпл1.Автомобиль = КомплектацияАвтомобилейОбороты.Автомобиль
	|			И ВТ_РегКомпл1.Номенклатура = КомплектацияАвтомобилейОбороты.Номенклатура
	|			И (ВТ_РегКомпл1.КоличествоОборот = -КомплектацияАвтомобилейОбороты.КоличествоОборот)
	|			И (ВТ_РегКомпл1.СуммаОборот = -КомплектацияАвтомобилейОбороты.СуммаОборот)
	|			И ВТ_РегКомпл1.Период < КомплектацияАвтомобилейОбороты.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Рез.КомплектацияАвтомобиляДата КАК КомплектацияАвтомобиляДата,
	|	ВТ_Рез.КомплектацияАвтомобиляНомер КАК КомплектацияАвтомобиляНомер,
	|	ВТ_Рез.Автор КАК Автор,
	|	ВТ_РегКомпл2.ЗН.Дата КАК ЗНДата,
	|	ВТ_РегКомпл2.ЗН.Номер КАК ЗННомер,
	|	ВТ_Рез.ДилерскийЦентр КАК ДилерскийЦентр,
	|	ВТ_Рез.УдельнаяЦенаРабот КАК УдельнаяЦенаРабот,
	|	ВТ_Рез.УдельныйНормочас КАК УдельныйНормочас,
	|	ВТ_Рез.Номенклатура КАК Номенклатура,
	|	ВТ_Рез.НоменклатураАртикул КАК НоменклатураАртикул,
	|	ВТ_Рез.СуммаТовары КАК СуммаТовары,
	|	ВТ_Рез.СебестоимостьТовары КАК СебестоимостьТовары,
	|	ВТ_Рез.НаценкаТовары КАК НаценкаТовары,
	|	ВТ_Рез.КоличествоТовары КАК КоличествоТовары,
	|	ВТ_Рез.Коэффициент КАК Коэффициент,
	|	ВТ_Рез.КоличествоБазовое КАК КоличествоБазовое
	|ИЗ
	|	ВТ_Рез КАК ВТ_Рез
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РегКомпл2 КАК ВТ_РегКомпл2
	|		ПО ВТ_Рез.Ссылка = ВТ_РегКомпл2.Комплектация
	|			И ВТ_Рез.Номенклатура = ВТ_РегКомпл2.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	КомплектацияАвтомобиляДата");    
	
	Если МассивФайлов.Количество() = 0 Тогда
		Запрос.УстановитьПараметр("ДатаНачала", '20240101');   
		Текст = "";   		
	Иначе
		Запрос.УстановитьПараметр("ДатаНачала", '20250628');//НачалоДня(ТекущаяДата() - 86400)); 		
		ЧтениеТекста = Новый ЧтениеТекста;
		ЧтениеТекста.Открыть("\\1cserver\powerbi\service\komplekt.csv");
		Текст = ЧтениеТекста.Прочитать();
		ЧтениеТекста.Закрыть();				
	КонецЕсли;
	
	Если МассивФайлов.Количество() = 0 Тогда
		Запрос.УстановитьПараметр("ДатаНачала", '20240101');   
		Текст = "КомплектацияАвтомобиляДата; КомплектацияАвтомобиляНомер; ДилерскийЦентр; Номенклатура; НоменклатураАртикул; СуммаТовары; КоличествоТовары; Коэффициент; КоличествоБазовое; СебестоимостьТовары; НаценкаТовары; ЗНДата; ЗННомер";   		
	Иначе
		Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата() - 86400)); 		
		ЧтениеТекста = Новый ЧтениеТекста;
		ЧтениеТекста.Открыть("\\1cserver\powerbi\service\komplekt.csv");
		Текст = ЧтениеТекста.Прочитать();
		ЧтениеТекста.Закрыть();				
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТекДата", КонецДня(ТекущаяДата() - 86400));   
	Выборка = Запрос.Выполнить().Выбрать();    
	ВременныйТекстовыйДокумент = Новый ТекстовыйДокумент;
	ВременныйТекстовыйДокумент.УстановитьТекст(Текст);	
	
	Пока Выборка.Следующий() Цикл 
		СтрокаВыгрузки = 							
		ФорматироватьДляCSV(СокрЛП(Формат(Выборка.КомплектацияАвтомобиляДата, "ДЛФ=DT"))) + ";" + 	  
		ФорматироватьДляCSV(СокрЛП(Выборка.КомплектацияАвтомобиляНомер))	   			    + ";" +
		ФорматироватьДляCSV(СокрЛП(Выборка.ДилерскийЦентр))	   							+ ";" +	
		ФорматироватьДляCSV(СокрЛП(Выборка.Номенклатура))	   							    + ";" +	
		ФорматироватьДляCSV(СокрЛП(Выборка.НоменклатураАртикул))	  					    + ";" +	
		ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СуммаТовары, "ЧН=0")))	  			    + ";" +
		ФорматироватьДляCSV(СокрЛП(Формат(Выборка.КоличествоТовары, "ЧН=0")))	  		    + ";" +	
		ФорматироватьДляCSV(СокрЛП(Формат(Выборка.Коэффициент, "ЧН=0")))	  			    + ";" +	
		ФорматироватьДляCSV(СокрЛП(Формат(Выборка.КоличествоБазовое, "ЧН=0")))            + ";" +	
		ФорматироватьДляCSV(СокрЛП(Формат(Выборка.СебестоимостьТовары, "ЧН=0")))	  	    + ";" +		  
		ФорматироватьДляCSV(СокрЛП(Формат(Выборка.НаценкаТовары, "ЧН=0")))                + ";" +
		ФорматироватьДляCSV(СокрЛП(Формат(Выборка.ЗНДата, "ДЛФ=DT")))                		+ ";" + 	  
		ФорматироватьДляCSV(СокрЛП(Выборка.ЗННомер))										+ ";" +
		ФорматироватьДляCSV(СокрЛП(Выборка.УдельныйНормочас))								+ ";" + 
		ФорматироватьДляCSV(СокрЛП(Выборка.УдельнаяЦенаРабот))							+ ";" +		  
		ФорматироватьДляCSV(СокрЛП(Выборка.Автор));
		ВременныйТекстовыйДокумент.ДобавитьСтроку(СтрокаВыгрузки);
	КонецЦикла;  
	
	Попытка
		ВременныйТекстовыйДокумент.Записать(ГдеСоздавать + МаскаФайла);
	Исключение
	КонецПопытки; 
	
КонецПроцедуры
//Иванченко 20260402 --

//Бондаренко++ 20231014 
Функция ПолучитьСписокВидовРемонта(ТекОбъект) Экспорт
	
	ИтСпВидовРемонта = Новый СписокЗначений;
	
	ИтСпВидовРемонта.ЗагрузитьЗначения(ТекОбъект.ВидыРемонта.Выгрузить().ВыгрузитьКолонку("ВидРемонта"));
	
	Возврат ИтСпВидовРемонта;
	
КонецФункции // ПолучитьСписокВидовРемонта(ТекОбъект)

Процедура ВыгрузитьЗНпоМарке(Параметры = Неопределено)  Экспорт
	
	РаботыЗН = Новый ТаблицаЗначений;
	РаботыЗН.Колонки.Добавить("Номер");
	РаботыЗН.Колонки.Добавить("ТипПозиции");
	РаботыЗН.Колонки.Добавить("НомерПозиции");
	РаботыЗН.Колонки.Добавить("КодПозиции");
	РаботыЗН.Колонки.Добавить("НомерЗаказЗапчасти");
	РаботыЗН.Колонки.Добавить("НаименованиеПозиции");
	РаботыЗН.Колонки.Добавить("Количество");
	РаботыЗН.Колонки.Добавить("ИтоговаяСтоимость");
	РаботыЗН.Колонки.Добавить("РасширениеЗН");
	РаботыЗН.Колонки.Добавить("Вналичии");
	РаботыЗН.Колонки.Добавить("Ссылка");
	РаботыЗН.Колонки.Добавить("ТипРемонта");
	
	ТекЭлСпрНастроек = Справочники.СМ_ЧериЭксид_Настройки.ПустаяСсылка();
	
	Если ТипЗНЧ(Параметры) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
		Марка = Параметры.Автомобиль.Модель.Марка;
		//Бондаренко++ 20241005
		//ТекЭлСпрНастроек = Справочники.СМ_ЧериЭксид_Настройки.НайтиПоРеквизиту("Марка",Марка);
		ТекЭлСпрНастроек = НайтиЭлементСправочникаСМ_ЧериЭксид_Настройки(Параметры.Автомобиль.Модель.Марка,Параметры.ПодразделениеКомпании);
		//Бондаренко-- 20241005	
	ИначеЕсли ТипЗНЧ(Параметры) = Тип("СправочникОбъект.СМ_ЧериЭксид_Настройки") Тогда	
		Марка = Параметры.Марка;
		ТекЭлСпрНастроек = Параметры;
		//Бондаренко++ 20241005
		ПодразделениеКомпанииСписок = Новый СписокЗначений;
		Для каждого Эл Из Параметры.Подразделения Цикл
			ПодразделениеКомпанииСписок.Добавить(Эл.ПодразделениеКомпании);
		КонецЦикла;
		//Бондаренко-- 20241005
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ТекЭлСпрНастроек = Справочники.СМ_ЧериЭксид_Настройки.ПустаяСсылка() Тогда
		Возврат;
	КонецЕсли;
	
	Дилер     = ТекЭлСпрНастроек.Дилер;
	КодДилера = ТекЭлСпрНастроек.КодДилера;
	КлючАПИ    = ТекЭлСпрНастроек.КлючАПИ;
	
	ГдеСоздавать = КаталогВременныхФайлов();
	ИмяФайла = ГдеСоздавать+"file1.txt";
	ИмяФайлаСРаботами = ГдеСоздавать+"file2.txt";
	
	//=========================== 1 часть ===
	
	СписокВидовРемонта = Новый СписокЗначений;
	СписокВидовРемонта = ПолучитьСписокВидовРемонта(ТекЭлСпрНастроек);
	
	СписокПроизводителей = Новый СписокЗначений;
	СписокПроизводителей = ПолучитьСписокПроизводителей(ТекЭлСпрНастроек);
	
	Запрос = Новый Запрос;
	
	Если ТипЗНЧ(Параметры) <> Тип("ДокументСсылка.ЗаказНаряд") Тогда  
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНарядРаботы.Ссылка КАК Ссылка,
		|	ЗаказНарядРаботы.Ссылка.Дата КАК Дата,
		|	ЗаказНарядРаботы.Ссылка.Организация КАК Организация,
		|	ЗаказНарядРаботы.Ссылка.Проведен КАК Проведен,
		|	ЗаказНарядРаботы.НомерСтроки КАК НомерПозиции,
		|	ЗаказНарядРаботы.Работа КАК НаименованиеПозиции,
		|	""РАБОТА"" КАК ТипПозиции,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗаказНарядРаботы.Работа.Артикул, """") = """"
		|			ТОГДА ЗаказНарядРаботы.Работа.Код
		|		ИНАЧЕ ЗаказНарядРаботы.Работа.Артикул
		|	КОНЕЦ КАК КодПозиции,
		|	ЗаказНарядРаботы.Количество * ЗаказНарядРаботы.Коэффициент КАК Количество,
		|	ЗаказНарядРаботы.СуммаВсего КАК ИтоговаяСтоимость,
		|	""НЕТ"" КАК РасширениеЗН,
		|	""ДА"" КАК Вналичии,
		|	ЗаказНарядРаботы.Ссылка.Номер КАК Номер,
		|	ЗаказНарядРаботы.Ссылка.Состояние КАК Состояние,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта КАК ВидРемонта,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта.Наименование КАК ТипРемонта,
		|	ЗаказНарядРаботы.Ссылка.Пробег КАК Пробег
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		|ГДЕ
		|	ЗаказНарядРаботы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ЗаказНарядРаботы.Ссылка.Проведен = ИСТИНА
		|	И ЗаказНарядРаботы.Ссылка.Организация = &Организация
		|	И ЗаказНарядРаботы.Ссылка.Автомобиль.Модель.Марка = &Марка
		|	И ЗаказНарядРаботы.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|	И ЗаказНарядРаботы.Ссылка.ВидРемонта В(&СзВидРемонта)
		|	И ЗаказНарядРаботы.Ссылка.Пробег > 0
		|	И ЗаказНарядРаботы.Ссылка.ПодразделениеКомпании В(&ПодразделениеКомпанииСписок)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНарядТовары.Ссылка,
		|	ЗаказНарядТовары.Ссылка.Дата,
		|	ЗаказНарядТовары.Ссылка.Организация,
		|	ЗаказНарядТовары.Ссылка.Проведен,
		|	ЗаказНарядТовары.НомерСтроки,
		|	ЗаказНарядТовары.Номенклатура,
		|	""ДЕТАЛЬ"",
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗаказНарядТовары.Номенклатура.Артикул, """") = """"
		|			ТОГДА ЗаказНарядТовары.Номенклатура.Код
		|		ИНАЧЕ ЗаказНарядТовары.Номенклатура.Артикул
		|	КОНЕЦ,
		|	ЗаказНарядТовары.Количество * ЗаказНарядТовары.Коэффициент,
		|	ЗаказНарядТовары.СуммаВсего,
		|	""НЕТ"",
		|	""ДА"",
		|	ЗаказНарядТовары.Ссылка.Номер,
		|	ЗаказНарядТовары.Ссылка.Состояние,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта.Наименование,
		|	ЗаказНарядТовары.Ссылка.Пробег
		|ИЗ
		|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|ГДЕ
		|	ЗаказНарядТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ЗаказНарядТовары.Ссылка.Проведен = ИСТИНА
		|	И ЗаказНарядТовары.Ссылка.Организация = &Организация
		|	И ЗаказНарядТовары.Ссылка.Автомобиль.Модель.Марка = &Марка
		|	И ЗаказНарядТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|	И ЗаказНарядТовары.Ссылка.ВидРемонта В(&СзВидРемонта)
		|	И ЗаказНарядТовары.Ссылка.Пробег > 0
		|	И ЗаказНарядТовары.Ссылка.ПодразделениеКомпании В(&ПодразделениеКомпанииСписок)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	Номер";
		
		Запрос.УстановитьПараметр("ДатаНачала",    НачалоДня(ТекущаяДата() - 86400 * 31 ));   //Минус 31 дн. 20260310
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()  - 86400     ));   //Минус  1 день
		Запрос.УстановитьПараметр("Марка", Марка);
		Запрос.УстановитьПараметр("Организация", Дилер);
		Запрос.УстановитьПараметр("СзВидРемонта",СписокВидовРемонта);
		Запрос.УстановитьПараметр("ВидЗначения",Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
		//Бондаренко++ 20241005
		Запрос.УстановитьПараметр("ПодразделениеКомпанииСписок",ПодразделениеКомпанииСписок);
		//Бондаренко-- 20241005
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНарядРаботы.Ссылка КАК Ссылка,
		|	ЗаказНарядРаботы.Ссылка.Дата КАК Дата,
		|	ЗаказНарядРаботы.Ссылка.Организация КАК Организация,
		|	ЗаказНарядРаботы.Ссылка.Проведен КАК Проведен,
		|	ЗаказНарядРаботы.НомерСтроки КАК НомерПозиции,
		|	ЗаказНарядРаботы.Работа КАК НаименованиеПозиции,
		|	""1"" КАК ТипПозиции,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗаказНарядРаботы.Работа.Артикул, """") = """"
		|			ТОГДА ЗаказНарядРаботы.Работа.Код
		|		ИНАЧЕ ЗаказНарядРаботы.Работа.Артикул
		|	КОНЕЦ КАК КодПозиции,
		|	ЗаказНарядРаботы.Количество * ЗаказНарядРаботы.Коэффициент КАК Количество,
		|	ЗаказНарядРаботы.СуммаВсего КАК ИтоговаяСтоимость,
		|	""0"" КАК РасширениеЗН,
		|	""1"" КАК Вналичии,
		|	ЗаказНарядРаботы.Ссылка.Номер КАК Номер,
		|	ЗаказНарядРаботы.Ссылка.Состояние КАК Состояние,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта КАК ВидРемонта,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта.Наименование КАК ТипРемонта,
		|	ЗаказНарядРаботы.Ссылка.Пробег КАК Пробег
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		|ГДЕ
		|	ЗаказНарядРаботы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНарядТовары.Ссылка,
		|	ЗаказНарядТовары.Ссылка.Дата,
		|	ЗаказНарядТовары.Ссылка.Организация,
		|	ЗаказНарядТовары.Ссылка.Проведен,
		|	ЗаказНарядТовары.НомерСтроки,
		|	ЗаказНарядТовары.Номенклатура,
		|	""2"",
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗаказНарядТовары.Номенклатура.Артикул, """") = """"
		|			ТОГДА ЗаказНарядТовары.Номенклатура.Код
		|		ИНАЧЕ ЗаказНарядТовары.Номенклатура.Артикул
		|	КОНЕЦ,
		|	ЗаказНарядТовары.Количество * ЗаказНарядТовары.Коэффициент,
		|	ЗаказНарядТовары.СуммаВсего,
		|	""0"",
		|	""1"",
		|	ЗаказНарядТовары.Ссылка.Номер,
		|	ЗаказНарядТовары.Ссылка.Состояние,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта.Наименование,
		|	ЗаказНарядТовары.Ссылка.Пробег
		|ИЗ
		|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|ГДЕ
		|	ЗаказНарядТовары.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	Номер";
		
		Запрос.УстановитьПараметр("Ссылка", Параметры);  
		
	КонецЕсли;
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	РаботыЗН=ТЗ.Скопировать();
	
	ТЗ.Свернуть("Ссылка,Номер,Дата");
	
	ТЗ.Сортировать("Дата,Номер");
	
	Состав = Новый ТаблицаЗначений;
	Состав=ТЗ.Скопировать(,"Ссылка,Номер,Дата");
	
	ВсегоСтрок = Состав.Количество();
	
	Состав.Колонки.Добавить("Дилер");
	Состав.Колонки.Добавить("КодДилера");
	Состав.Колонки.Добавить("Владелец");
	Состав.Колонки.Добавить("ТелефонВладельца");
	Состав.Колонки.Добавить("VIN");
	Состав.Колонки.Добавить("ГосНомер");
	Состав.Колонки.Добавить("Марка");
	Состав.Колонки.Добавить("Модель");
	Состав.Колонки.Добавить("Пробег");
	Состав.Колонки.Добавить("ТипВладельца");
	Состав.Колонки.Добавить("КонтактноеЛицо");
	Состав.Колонки.Добавить("ТелефонКонтактногоЛица");
	Состав.Колонки.Добавить("ДатаОбращения");
	Состав.Колонки.Добавить("ПричинаОбращения");
	Состав.Колонки.Добавить("ДатаСозданияЗН");
	Состав.Колонки.Добавить("ДатаНачалаРабот");
	Состав.Колонки.Добавить("ДатаОкончанияРабот");
	Состав.Колонки.Добавить("ДатаЗакрытия");
	Состав.Колонки.Добавить("ТО");
	Состав.Колонки.Добавить("СервиснаяКомпания");
	Состав.Колонки.Добавить("ДобраяВоля");
	Состав.Колонки.Добавить("СлесарныйРемонт");
	Состав.Колонки.Добавить("КузовнойРемонт");
	Состав.Колонки.Добавить("Акция");
	Состав.Колонки.Добавить("ТипРемонта"); 
	
	//Бондаренко++ 20220429
	Состав.Колонки.Добавить("ЕмэйлКонтактногоЛица");
	
	Состав.Колонки.Добавить("ФлагСОПД");
	Состав.Колонки.Добавить("ФлагТелефон");
	Состав.Колонки.Добавить("ФлагЕмэйл");
	Состав.Колонки.Добавить("ФлагСМС"); 
	
	Состав.Колонки.Добавить("Рекомендации");
	Состав.Колонки.Добавить("УстановкаДО");
	Состав.Колонки.Добавить("ПредпродажнаяПодготовка");
	
	Состав.Колонки.Добавить("КодМастерОткрыл");  
	Состав.Колонки.Добавить("КодМастерРаботал");
	Состав.Колонки.Добавить("КодМастерЗакрыл");
	
	Состав.Колонки.Добавить("ТипДокумента");
	Состав.Колонки.Добавить("Мойка");
	Состав.Колонки.Добавить("Диагностика");
	//Бондаренко-- 20220429
	
	Для Каждого Строка Из Состав Цикл
		
		ТекЗН = Строка.Ссылка;
		ТекАвто = ТекЗН.Автомобиль;
		ТекЗаказчик = ТекЗН.Заказчик;
		ТекДатаЗН = ТекЗН.Дата;
		
		ТекВладелец = ТекЗН.Заказчик;
		ТекКонтактноеЛицо = ТекЗН._г_ДоверенноеЛицоЗаказчика;
		
		//Бондаренко++ 20230926                                 
		ТабНомерМастера         = СокрЛП(ТекЗН.Диспетчер.ТабельныйНомер);
		Строка.КодМастерОткрыл  = ТабНомерМастера;
		Строка.КодМастерРаботал = ТабНомерМастера;
		Строка.КодМастерЗакрыл  = ТабНомерМастера;
		//Бондаренко-- 20230926
		
		//Бондаренко++ 20220429
		Строка.ТелефонКонтактногоЛица = СокрЛП(ТекЗН.ПредставлениеТелефона);
		
		Если обЗначениеНеЗаполнено(ТекКонтактноеЛицо) Тогда
			ЕмэйлКонтактногоЛица = ТекЗН.Заказчик.ОсновнойАдресЭлектроннойПочты;
		Иначе			
			ЕмэйлКонтактногоЛица = ТекЗН._г_ДоверенноеЛицоЗаказчика.ОсновнойАдресЭлектроннойПочты;
		КонецЕсли;
		
		Строка.ЕмэйлКонтактногоЛица = ЕмэйлКонтактногоЛица;	
		
		Если ТекЗН.Заказчик.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо ИЛИ ТекЗН.Заказчик.ФормаСобственности = Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
			ФлагСОПД = ?(ТекЗН.Заказчик.СогласиеНаОбработкуПерсональныхДанных=Перечисления.ВариантыОтветов.Да,"1","0");
			ФлагСмс = ?(ТекЗН.Заказчик.СогласиеНаПолучениеSMS=Перечисления.ВариантыОтветов.Да,"1","0");
		Иначе			
			ФлагСОПД = "0";   
			ФлагСмс  = "0";
		КонецЕсли;
		
		Строка.ФлагСОПД = ФлагСОПД; 
		Строка.ФлагТелефон = ФлагСОПД; 
		Строка.ФлагЕмэйл = ФлагСОПД;
		Строка.ФлагСмс = ФлагСмс; 
		
		//Строка.Рекомендации = СокрЛП(ТекЗН.Рекомендации);
		
		Если ТекЗН.ВидРемонта=Справочники.ВидыРемонта.ДопОборудованиеСогласованноеСДилером ИЛИ
			ТекЗН.ВидРемонта=Справочники.ВидыРемонта.ДополнительноеОборудование ИЛИ 
			ТекЗН.ВидРемонта=Справочники.ВидыРемонта.ДополнительноеОборудованиеСубподряд Тогда
			Строка.УстановкаДО = "1";		
		Иначе			
			Строка.УстановкаДО = "0";				
		КонецЕсли;
		
		Если ТекЗН.ВидРемонта=Справочники.ВидыРемонта.ПредпродажнаяПодготовка Тогда
			Строка.ПредпродажнаяПодготовка = "1";		
		Иначе			
			Строка.ПредпродажнаяПодготовка = "0";				
		КонецЕсли;
		
		//Бондаренко++ 20230606
		//Строка.ТипДокумента = "Заказ-наряд";
		Строка.ТипДокумента = "1";
		//Бондаренко-- 20230606
		
		//Бондаренко++ 20231116
		//Строка.Мойка = "1";
		//Строка.Диагностика = "1";
		Строка.Мойка = "0";
		Строка.Диагностика = "0";
		//Бондаренко-- 20231116
		
		Строка.Дилер = Дилер.НаименованиеДляПечати;
		Строка.КодДилера = КодДилера;
		Строка.Владелец = ТекВладелец;
		Строка.ТелефонВладельца = Прав(Строка.Владелец.ОсновнойТелефон,10);
		Строка.VIN = ТекАвто.VIN;
		Строка.ГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ТекАвто , Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
		Если обЗначениеНеЗаполнено(Строка.ГосНомер) Тогда
			Строка.ГосНомер = "Б/Н";
		КонецЕсли; 
		Строка.Марка = ТекАвто.Модель.Марка;
		Строка.Модель = ТекАвто.Модель;
		
		Если ТекАвто.Модель.Марка = Справочники.Марка.JAC Тогда
			Строка.Марка = ВРЕГ(СокрЛП(ТекАвто.Модель.Марка))+" CAR";
			Строка.Модель = ВРЕГ(СокрЛП(СтрЗаменить(ТекАвто.Модель,СокрЛП(ТекАвто.Модель.Марка),"")));
		КонецЕсли;
		
		//  ПробегАвтоЧисловой = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ТекАвто, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
		//  ПробегАвтоСтроковый = СтрЗаменить(ПробегАвтоЧисловой,Символы.НПП,"");
		//Строка.Пробег = СокрЛП(ПробегАвтоСтроковый);
		
		ПробегАвтоСтроковый = СтрЗаменить(Строка.Ссылка.Пробег,Символы.НПП,"");
		Строка.Пробег = СокрЛП(ПробегАвтоСтроковый);
		
		Если ТекЗаказчик.ФормаСобственности=Перечисления.ФормыСобственности.ЧастноеЛицо ИЛИ ТекЗаказчик.ФормаСобственности=Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
			//Бондаренко++ 20231010
			//Строка.ТипВладельца="ФЛ";
			Строка.ТипВладельца="1";
			//Бондаренко-- 20231010
		Иначе                      
			//Бондаренко++ 20231010
			//Строка.ТипВладельца="ЮЛ";
			Строка.ТипВладельца="2";
			//Бондаренко-- 20231010
		КонецЕсли; 
		Строка.КонтактноеЛицо = ТекЗаказчик;
		Строка.ТелефонКонтактногоЛица = Прав(ТекЗаказчик.ОсновнойТелефон,10);
		Строка.ДатаОбращения = ТекДатаЗН;
		
		//Бондаренко++ 20220502
		ПричинаОбращения = СокрЛП(ТекЗН.ПричинаОбращения);     
		ПричинаОбращения = СтрЗаменить(ПричинаОбращения,Символы.ПС,",");
		ПричинаОбращения = СтрЗаменить(ПричинаОбращения,";",",");
		Строка.ПричинаОбращения = ПричинаОбращения;	
		
		Рекомендации = СокрЛП(ТекЗН.Рекомендации);              
		Рекомендации = СтрЗаменить(Рекомендации,Символы.ПС,",");
		Рекомендации = СтрЗаменить(Рекомендации,";",",");
		Строка.Рекомендации = Рекомендации;
		//Бондаренко-- 20220502
		
		Строка.ДатаСозданияЗН     = ТекДатаЗН;
		Строка.ДатаНачалаРабот    = ТекДатаЗН;
		Строка.ДатаОкончанияРабот = ТекДатаЗН;
		Строка.ДатаЗакрытия       = ТекДатаЗН;
		
		Строка.ДобраяВоля         = "0";
		Строка.ТО                 = "0";
		Строка.СервиснаяКомпания  = "0";
		//Бондаренко++ 20231116         
		//Строка.КузовнойРемонт     = "1";
		Строка.КузовнойРемонт     = "0";
		//Бондаренко-- 20231116
		Строка.СлесарныйРемонт 	  = "0";
		Строка.Акция 	          = "0";  
		
		//Бондаренко++ 20220819
		Если ЭтоАкция(ТекЗН) Тогда
			Строка.Акция = "1";  		
		КонецЕсли;
		//Бондаренко-- 20220819
		
		Если    Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ГарантияПроизводителя Или Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ГарантияДистирибьютера ИЛИ
			Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ГарантияHPromise Или Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ГарантияПроизводителяЛКП ИЛИ 
			Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ДобраяВоляПроизводителя Тогда
			Строка.ТипРемонта = "3";
		ИначеЕсли Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ДобраяВоляКомпании Тогда 
			Строка.ТипРемонта = "4";	
			Строка.ДобраяВоля = "1";
		Иначе 
			Строка.ТипРемонта = "1";
			//Бондаренко++ 20241002
			//Если Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ТехническоеОбслуживание ИЛИ Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ТО_ноль ИЛИ Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ТехническоеОбслуживаниеБесплатное Тогда 
			Если Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ТехническоеОбслуживание ИЛИ 
				Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ТО_ноль ИЛИ 
				Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ТехническоеОбслуживаниеБесплатное ИЛИ
				Строка.Ссылка.ВидРемонта = Справочники.ВидыРемонта.ТО_нольПлатный Тогда 
				//Бондаренко-- 20241002	
				Строка.ТО = "1";
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЦикла;
	
	//=========================== 2 часть ===
	
	ТекстЗН = Новый ТекстовыйДокумент; 
	
	//ТекстЗН.ДобавитьСтроку( "Дилер;код дилера;Номер заказ-наряда;ФИО владельца;Телефон владельца;VIN номер автомобиля;Гос.номер автомобиля;Марка автомобиля;Модель автомобиля;Пробег (км);Тип владельца;Контактное лицо;Телефон контактного лица;Дата обращения клиента;причина обращения;Дата содания заказ-наряда;Дата начала работ;Дата окончания работ;Дата закрытия заказ-наряда;Тип ремонта;Вид ремонта;;;;;" );
	//ТекстЗН.ДобавитьСтроку( ";;;;;;;;;;;;;;;;;;;;ТО;Сервисная кампания;Гудвилл;Слесарный ремонт;Кузовной ремонт;Акция" );
	
	ТекстЗН.ДобавитьСтроку( "Дилер;;Документ(заказ-наряд или продажа детали);Автомобиль;;;;;Владелец;;;Контактное лицо;;;СОПД;Согласие на контакт;;;Обращение;;;Дата заказ-наряда / продажи детали;;;;Тип ремонта;Вид ремонта;;;;;;;;Код мастера -консультанта;;;Дополнительные атрибуты версии 2.1;;");
	ТекстЗН.ДобавитьСтроку("Наименование;Код;;VIN номер;Гос.номер;Марка;Модель;Пробег (км);Наименование;Телефон;Тип;Наименование;Телефон;Email;;Телефон;Email;SMS;Дата;Причина;Рекомендации;Создания;Начала работ;Окончания работ;Закрытия;;ТО;Сервисная кампания;Гудвилл;Слесарный ремонт;Кузовной ремонт;Ремонт по акции;Установка ДО;ППП;Открыл ЗН;Работал с ЗН;Закрыл ЗН;Тип документа;Мойка;Диагностика");
	
	Для каждого Строка Из Состав Цикл
		ТекстЗН.ДобавитьСтроку(СтрЗаменить(Строка.Дилер,"""","'") + ";"+
		Строка.КодДилера + ";"+
		Строка.Номер + ";"+
		Строка.VIN + ";"+
		Строка.ГосНомер + ";"+
		Строка.Марка + ";"+
		Строка.Модель + ";"+
		Строка.Пробег + ";"+
		
		Строка.Владелец + ";"+
		Строка.ТелефонВладельца + ";"+		
		Строка.ТипВладельца + ";"+
		
		Строка.КонтактноеЛицо + ";"+
		Строка.ТелефонКонтактногоЛица + ";"+
		Строка.ЕмэйлКонтактногоЛица + ";"+
		
		Строка.ФлагСОПД+ ";"+
		Строка.ФлагТелефон+ ";"+		
		Строка.ФлагЕмэйл+ ";"+		
		Строка.ФлагСмс+ ";"+		
		
		Сред(Строка.ДатаОбращения,1,10) + ";"+
		Строка.ПричинаОбращения + ";"+
		
		Строка.Рекомендации + ";"+		
		
		Сред(Строка.ДатаСозданияЗН,1,10) + ";"+
		Сред(Строка.ДатаНачалаРабот,1,10) + ";"+
		Сред(Строка.ДатаОкончанияРабот,1,10) + ";"+
		Сред(Строка.ДатаЗакрытия,1,10) + ";"+
		Строка.ТипРемонта+ ";"+
		Строка.ТО + ";"+
		Строка.СервиснаяКомпания + ";"+
		Строка.ДобраяВоля + ";"+
		Строка.СлесарныйРемонт + ";"+
		Строка.КузовнойРемонт + ";"+
		Строка.Акция + ";"+
		
		Строка.УстановкаДО + ";"+
		Строка.ПредпродажнаяПодготовка + ";"+		
		
		Строка.КодМастерОткрыл + ";"+		
		Строка.КодМастерРаботал + ";"+		
		Строка.КодМастерЗакрыл + ";"+		
		Строка.ТипДокумента + ";"+		
		Строка.Мойка + ";"+		
		Строка.Диагностика); 
	КонецЦикла;
	
	
	Попытка
		ТекстЗН.Записать(ИмяФайла); 
	Исключение
		//Сообщить("ОШИБКА! Не удалось записать файл с заголовками заказ-нарядов "+ИмяФайлаСработами);	
	КонецПопытки; 
	
	ТекстСРаботами = Новый ТекстовыйДокумент;
	ТекстСРаботами.ДобавитьСтроку("Номер заказ-наряда;Тип позиции;Номер позиции;Код позиции;номера заказа з/ч;Наименование позиции;Количество;Итоговая стоимость;Расширение заказ-наряда;В наличии");
	Для каждого Строка Из РаботыЗН Цикл
		ТекстСРаботами.ДобавитьСтроку(Строка.Номер + ";"+
		Строка.ТипПозиции + ";"+
		Строка.НомерПозиции + ";"+
		Строка.КодПозиции + ";"+
		" " + ";"+
		СтрЗаменить(Строка.НаименованиеПозиции,";","") + ";"+
		СтрЗаменить(Строка.Количество,Символы.НПП,"") + ";"+
		СтрЗаменить(Строка.ИтоговаяСтоимость,Символы.НПП,"") + ";"+
		Строка.РасширениеЗН + ";"+
		Строка.Вналичии); 
	КонецЦикла;
	Попытка
		ТекстСРаботами.Записать(ИмяФайлаСработами); 
	Исключение
		//Сообщить("ОШИБКА! Не удалось записать файл с работами заказ-нарядов");	
	КонецПопытки; 
	
	//=========================== 3 часть ===
	
	Если Состав.Количество()+РаботыЗН.Количество() > 0 Тогда
		
		ДвоичныеДанныеЗН=Новый ДвоичныеДанные(ИмяФайла);
		АдресВХ_ЗН = ПоместитьВоВременноеХранилище(ДвоичныеДанныеЗН);
		
		ДвоичныеДанныеРабот=Новый ДвоичныеДанные(ИмяФайлаСРаботами);
		АдресВХ_Работ = ПоместитьВоВременноеХранилище(ДвоичныеДанныеРабот);
		
		ВыгрузкаНаПорталМарки(АдресВХ_ЗН,АдресВХ_Работ,КлючАПИ,Марка);	
		
	КонецЕсли; 
	
КонецПроцедуры // ВыгрузитьЗНпоМарке(Параметры = Неопределено) Экспорт

Процедура ВыгрузкаНаПорталМарки(АдресВХ_ЗН,АдресВХ_Работ,КлючАПИ,Марка) Экспорт
	
	Перем ОписаниеОшибки;
	
	ПутьКЛог = "C:\Program Files\CheryServiceDataUploader\log.txt";
	ФайлЛогНаДиске = Новый Файл(ПутьКЛог);
	
	//Бондаренко++ 20240206
	Если Марка = Справочники.Марка.KAIYI ИЛИ Марка = Справочники.Марка.BAIC Тогда
		ПолныйПутьКпрограмме = "C:\Program Files\CheryServiceDataUploader\AvtotorServiceDataUploader.exe";		 
	Иначе
		ПолныйПутьКпрограмме = "C:\Program Files\CheryServiceDataUploader\CheryServiceDataUploader.exe";		
	КонецЕсли;
	//Бондаренко-- 20240206
	
	ИмяФайлаПрограммыНаДиске = Новый Файл(ПолныйПутьКпрограмме);
	
	Если   ИмяФайлаПрограммыНаДиске.Существует() Тогда
		
		ИмяВременногоФайлаЗН = "C:\Program Files\CheryServiceDataUploader\DataToSend\file1.txt";
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХ_ЗН);
		ДвоичныеДанные.Записать(ИмяВременногоФайлаЗН);
		
		ИмяВременногоФайлаРабот = "C:\Program Files\CheryServiceDataUploader\DataToSend\file2.txt";
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХ_Работ);
		ДвоичныеДанные.Записать(ИмяВременногоФайлаРабот);
		
		//Бондаренко++ 20250207
		Если Марка = Справочники.Марка.JAC Тогда
			ИмяКоманды = """C:\Program Files\CheryServiceDataUploader\JacServiceDataUploader.exe"""+" "+СокрЛП(КлючАПИ);
		ИначеЕсли Марка = Справочники.Марка.KAIYI ИЛИ Марка = Справочники.Марка.BAIC Тогда
			ИмяКоманды = """C:\Program Files\CheryServiceDataUploader\AvtotorServiceDataUploader.exe"""+" "+СокрЛП(КлючАПИ);
		Иначе
			ИмяКоманды = """C:\Program Files\CheryServiceDataUploader\CheryServiceDataUploader.exe"""+" "+СокрЛП(КлючАПИ); 
		КонецЕсли;
		//Бондаренко++ 20250206
		
		Попытка
			ОбщиеСервер.ВыполнитьКомандуНаСервере(ИмяКоманды,ОписаниеОшибки);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;	
		
	Иначе			
		
		ОписаниеОшибки = "ОШИБКА! Файл '"+ПолныйПутьКпрограмме+"' не существует.";			
		
	КонецЕсли;
	
КонецПроцедуры //ВыгрузкаНаПорталМарки(АдресВХ_ЗН,АдресВХ_Работ,КодAPI) Экспорт
//Бондаренко-- 20221014 

//Бондаренко++ 20221017       
Процедура ВыгрузитьЗНуниверсальная(Параметры = Неопределено) Экспорт
	
	Выборка = Справочники.СМ_ЧериЭксид_Настройки.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТекОбъект = Выборка.ПолучитьОбъект(); 
		
		Если ТекОбъект.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекОбъект.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		Дилер = ТекОбъект.Дилер;
		Если обЗначениеНеЗаполнено(Дилер) Тогда
			Продолжить;		
		КонецЕсли;
		
		КодДилера = ТекОбъект.КодДилера;
		Если ПустаяСтрока(КодДилера) Тогда
			Продолжить;		
		КонецЕсли;
		
		КлючАпи = ТекОбъект.КлючАПИ;		
		Если ПустаяСтрока(КлючАпи) Тогда
			Продолжить;		
		КонецЕсли;
		
		СписокПодразделений = Новый СписокЗначений;
		Если ТекОбъект.Подразделения.Количество() > 0 Тогда
			СписокПодразделений = ПолучитьСписокПодразделений(ТекОбъект);
		КонецЕсли;
		Если СписокПодразделений.Количество() = 0 Тогда
			Продолжить;			
		КонецЕсли;
		
		СписокСкладов = Новый СписокЗначений;
		Если ТекОбъект.Склады.Количество() > 0 Тогда
			СписокСкладов = ПолучитьСписокСкладов(ТекОбъект);
		КонецЕсли;
		
		СписокПроизводителей = Новый СписокЗначений;
		Если ТекОбъект.Производители.Количество() > 0 Тогда
			СписокПроизводителей = ПолучитьСписокПроизводителей(ТекОбъект);
		КонецЕсли;
		Если СписокПроизводителей.Количество() = 0 Тогда
			Продолжить;			
		КонецЕсли;
		
		Марка = ТекОбъект.Марка;
		
		ВыгрузитьЗНпоМарке(ТекОбъект); 
		
		Для Счетчик=1 По 10000000 Цикл
			Счетчик = Счетчик + 1;					
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры //ВыгрузитьЗНуниверсальная((Параметры = Неопределено) Экспорт
//Бондаренко++ 20221017       

//Бондаренко++ 20241009
Функция НайтиЭлементСправочникаСМ_ЧериЭксид_Настройки(Марка,ПодразделениеКомпании) Экспорт
	
	Ссылка_ = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СМ_ЧериЭксид_НастройкиПодразделения.Ссылка.Ссылка КАК Ссылка,
	|	СМ_ЧериЭксид_НастройкиПодразделения.Ссылка.Марка КАК Марка,
	|	СМ_ЧериЭксид_НастройкиПодразделения.ПодразделениеКомпании КАК ПодразделениеКомпании
	|ИЗ
	|	Справочник.СМ_ЧериЭксид_Настройки.Подразделения КАК СМ_ЧериЭксид_НастройкиПодразделения
	|ГДЕ
	|	СМ_ЧериЭксид_НастройкиПодразделения.Ссылка.Марка = &Марка
	|	И СМ_ЧериЭксид_НастройкиПодразделения.ПодразделениеКомпании = &ПодразделениеКомпании";
	
	Запрос.УстановитьПараметр("Марка", Марка);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Ссылка_ = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Ссылка_;
	
КонецФункции // НайтиЭлементСправочникаСМ_ЧериЭксид_Настройки()
//Бондаренко-- 20241009
