
//Точка входа регламентного задания

Функция ПараметрыПодключенияКБазеПланшет() Экспорт
	
	Ответ = Новый Структура();
	Подключение = Справочники.Renault_АвтосервисНастройкиРаботыСПланшетом.ПодключениеПоУмолчанию;
	
	Для Каждого Рекв Из Метаданные.Справочники.Renault_АвтосервисНастройкиРаботыСПланшетом.Реквизиты Цикл
		
		Ответ.Вставить(Рекв.Имя,Подключение[Рекв.Имя]);
		
	КонецЦикла;
	
	Возврат Ответ;
	
КонецФункции

//Блок работы с запросами в SQL


Функция ПолучитьРекомендуемыеДатыВизита(Автомобиль) Экспорт
	
	ДатаБлижайшейРекомендации = Дата(1,1,1);
	ДатаСледующегоТО = Дата(1,1,1);
	ДатаЧерезМесяц = ДобавитьМесяц(ТекущаяДата(), 1);
	ДатаЧерезТриМесяца = ДобавитьМесяц(ТекущаяДата(), 3);
	
	ДатаСледующегоТО = РегистрыСведений.Renault_ВыполнениеТО.ПолучитьПоследнийТО(Автомобиль);
	ДатаБлижайшейРекомендации = ПолучитьДатуБлижайшейРекомендации(Автомобиль);
	
	Результат = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(ДатаБлижайшейРекомендации) Тогда
		
		Результат.Добавить("Дата ближайшей рекомендации: " + Формат(ДатаБлижайшейРекомендации, "ДФ=dd.MM.yyyy"), ДатаБлижайшейРекомендации);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаСледующегоТО) Тогда
		
		Результат.Добавить("Дата следующего ТО: " + Формат(ДатаСледующегоТО, "ДФ=dd.MM.yyyy"), ДатаСледующегоТО);
		
	КонецЕсли;
	
	Результат.Добавить("Через месяц", ДатаЧерезМесяц);
	Результат.Добавить("Через три месяца", ДатаЧерезТриМесяца);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДатуБлижайшейРекомендации(Автомобиль) Экспорт
	
	ДатаБлижайшейРекомендации = Дата(1,1,1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Renault_ПоврежденияАвтомобилейСрезПоследних.РекомендуемаяДатаВыполнения
	               |ИЗ
	               |	РегистрСведений.Renault_ПоврежденияАвтомобилей.СрезПоследних КАК Renault_ПоврежденияАвтомобилейСрезПоследних
	               |ГДЕ
	               |	Renault_ПоврежденияАвтомобилейСрезПоследних.Автомобиль = &Автомобиль
	               |	И Renault_ПоврежденияАвтомобилейСрезПоследних.РаботаАктуальна = &РаботаАктуальна";
				   
				   Запрос.УстановитьПараметр("РаботаАктуальна", Истина);
				   Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
				   
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.РекомендуемаяДатаВыполнения > ТекущаяДата() Тогда
			
			ДатаБлижайшейРекомендации = Выборка.РекомендуемаяДатаВыполнения;
			
			
		Иначе
			
			ДатаБлижайшейРекомендации = ТекущаяДата();
			
		КонецЕсли
		
	КонецЕсли;
	
	Возврат ДатаБлижайшейРекомендации;
	
КонецФункции

функция СоздатьЗаявкуНаСервис(Данные, Обращение) Экспорт
	
	ДокОбъект = Документы.Renault_CRM_ЗаявкаНаСервис.СоздатьДокумент();
	ДокОбъект.ДилерскийЦентр = Обращение.ДилерскийЦентр;
	//ДокОбъект.ОбработкаЗаполнения(Неопределено);
	ДокОбъект.Дата = ТекущаяДата();
	ДокОбъект.Клиент = Обращение.ДилерскийЦентр.Автосервис_Контрагент;
	ДокОбъект.Автомобиль = Обращение.Автомобиль;
	ДокОбъект.Обращение = Обращение.Ссылка;
	ДокОбъект.ВидРемонта = Справочники.ВидыРемонта.ДополнительноеОборудование;
	
	//Если ПараметрыСеанса.Renault_ПраваПользователя.ВерсияАльфаАвто = "5" Тогда
		
	ДокОбъект.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Заявка;
		
	//Иначе
	//	
	//	ДокОбъект.Состояние = Перечисления.СостояниеЗаказНаряда.Заявка;
	//	
	//КонецЕсли;
	
	Для Каждого Допник из Данные Цикл
		
		Доп = Допник.Ссылка;
		
		ИдРаботы = 0;
		
		ОбщаяДлительность = 0;
		
		Для Каждого СтрокаРаботы из Доп.Работы Цикл
			
			ИдРаботы = ИдРаботы + 1;
			НоваяРабота = ДокОбъект.Работы.Добавить();
			НоваяРабота.Работа = СтрокаРаботы.Авторабота;
			НоваяРабота.Длительность = СтрокаРаботы.Длительность;
			НоваяРабота.ДлительностьЗН = СтрокаРаботы.Длительность;
			
			Запрос = Новый Запрос();
			
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЦеныАвтоработСрезПоследних.Нормочас
			               |ИЗ
			               |	РегистрСведений.ЦеныАвторабот.СрезПоследних КАК ЦеныАвтоработСрезПоследних
			               |ГДЕ
			               |	ЦеныАвтоработСрезПоследних.Авторабота = &Авторабота
			               |	И ЦеныАвтоработСрезПоследних.ВидРемонта = &ВидРемонта";
						   
			Запрос.УстановитьПараметр("Авторабота", СтрокаРаботы.Авторабота);
			Запрос.УстановитьПараметр("ВидРемонта", Справочники.ВидыРемонта.ДополнительноеОборудование);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				
				НоваяРабота.Нормочас = Выборка.Нормочас;
				
			КонецЕсли;
			
			НоваяРабота.Цена = СтрокаРаботы.Стоимость;
			НоваяРабота.Сумма = СтрокаРаботы.Стоимость;
			НоваяРабота.ИдентификаторРаботы = ИдРаботы;
			
			IDРаботы = Новый УникальныйИдентификатор();
			
			НоваяРабота.IDРаботы = IDРаботы;
			
			ОбщаяДлительность = ОбщаяДлительность + НоваяРабота.Длительность;
			
		КонецЦикла;
		
		Для Каждого СтрокаТовара ИЗ Доп.Товары Цикл
			
			ИдРаботы = ИдРаботы + 1;
			НоваяСтрока = ДокОбъект.Товары.Добавить();
			НоваяСтрока.Номенклатура = СтрокаТовара.Номенклатура;
			НоваяСтрока.Количество = СтрокаТовара.Количество;
			НоваяСтрока.Цена = СтрокаТовара.Стоимость;
			НоваяСтрока.Сумма = СтрокаТовара.Стоимость;
			
		КонецЦикла;
		
		ДокОбъект.СуммаЗапчастиВсего = ДокОбъект.Товары.Итог("Сумма");
		ДокОбъект.СуммаРаботВсего = ДокОбъект.Работы.Итог("Сумма");
		ДокОбъект.СуммаДокумента = ДокОбъект.СуммаЗапчастиВсего + ДокОбъект.СуммаРаботВсего;
		
		ДокОбъект.Записать();
		
	КонецЦикла;
	
КонецФункции

// Изменения МИС 06/08/2018
Функция ВернутьДатыДокумента(ЗаказНаряд, ЗаявкаНаСервис)
	Запрос = Новый Запрос;
	ЗАпрос.Текст = "ВЫБРАТЬ
	               |	МИНИМУМ(ЕСТЬNULL(Renault_CRM_ПриемкаАвтомобиля.ВремяНачала, &ВремяНачала)) КАК ДатаЗаезда,
	               |	МАКСИМУМ(ЕСТЬNULL(Renault_CRM_ВыдачаАвтомобиля.ВремяНачала, &ВремяОкончания)) КАК ДатаВыдачи
	               |ИЗ
	               |	Документ.Renault_CRM_ПриемкаАвтомобиля КАК Renault_CRM_ПриемкаАвтомобиля,
	               |	Документ.Renault_CRM_ВыдачаАвтомобиля КАК Renault_CRM_ВыдачаАвтомобиля
	               |ГДЕ
	               |	Renault_CRM_ВыдачаАвтомобиля.Обращение = &Обращение
	               |	И Renault_CRM_ПриемкаАвтомобиля.Обращение = &Обращение";
	Запрос.УстановитьПараметр("Обращение",ЗаявкаНаСервис.Обращение);
	Запрос.УстановитьПараметр("ВремяНачала",ЗаявкаНаСервис.ВремяНачала);
	Запрос.УстановитьПараметр("ВремяОкончания",ЗаявкаНаСервис.ВремяОкончания);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		ВремяНачала = Выборка.ДатаЗаезда;
		ВремяОкончания = Выборка.ДатаВыдачи;
		ЗаказНаряд.ДатаМашинозаезда = ВремяНачала; 
		ЗаказНаряд.ПлановаяДатаВыдачи = ВремяОкончания; 
		Если ВремяНачала>ТекущаяДата() Тогда
			ЗаказНаряд.Дата = ТекущаяДата();
		Иначе
			ЗаказНаряд.Дата = ВремяНачала;
		КонецЕсли;
	КонецЕСли;	
КонецФункции	
// Изменения МИС 06/08/2018 --

Функция Reanult_ОбновитьСформироватьЗаказНаряд(ЗаказНарядСсылка, ЗаявкаНаСервис, ПоказыватьДокумент = Истина, Обращение = неопределено) Экспорт

	ДилерскийЦентр = ЗаявкаНаСервис.ДилерскийЦентр;
	УдалятьОтсутствующиеВЗаявке = ДилерскийЦентр.Автосервис_УдалятьВЗНОтсутствующиеВЗаявке;

	Модальность = Истина;
	
	Если ЗаказНарядСсылка = Неопределено Тогда
		
		ЗаказНаряд = Документы.ЗаказНаряд.СоздатьДокумент();
		ТаблицаРаботЗН = ЗаказНаряд.Работы.Выгрузить();
		ТаблицаТоваровЗН = ЗаказНаряд.Товары.Выгрузить();
		ТаблицаИсполнителейЗН = ЗаказНаряд.Исполнители.Выгрузить();
		ЗаказНаряд.Дата = ТекущаяДата();
		
		ЗаказНаряд.Организация=ПараметрыСеанса.Пользователь.Организация; //ЗаказНаряд.Организация = ЗаявкаНаСервис.ДилерскийЦентр.Организация;
		ЗаказНаряд.ПодразделениеКомпании=ПараметрыСеанса.Пользователь.Подразделение; //ЗаказНаряд.ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
		
		ЗаказНаряд.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Заявка;
		ЗаказНаряд.Автомобиль = ЗаявкаНаСервис.Автомобиль;
		ЗаказНаряд.Контрагент = ЗаявкаНаСервис.Клиент;
		ЗаказНаряд.ВидРемонта = ЗаявкаНаСервис.ВидРемонта;
		ЗаказНаряд.Заказчик = ЗаявкаНаСервис.Клиент;
		ЗаказНаряд.ВидОплаты = ЗаявкаНаСервис.ВидОплаты;
		ЗаказНаряд.РегламентированныйУчет = Истина;
		ЗаказНаряд.УстановитьНовыйНомер();
		
		если ЗначениеЗаполнено(Обращение) тогда
			
			если ЗначениеЗаполнено(Обращение.МенеджерКупонов_Акция) тогда
				ЗаказНаряд.Комментарий = "Акция """ + Обращение.МенеджерКупонов_Акция +"""";
			КонецЕсли;
			
			если ЗначениеЗаполнено(Обращение.МенеджерКупонов_Промокод) тогда
				ЗаказНаряд.Комментарий = "Купон """ + Обращение.МенеджерКупонов_Промокод +"""";	
			КонецЕсли;
			
		КонецЕсли;

		
	Иначе
		
		ЗаказНаряд = ЗаказНарядСсылка.Ссылка.ПолучитьОбъект();
		ЗаказНаряд.Автомобиль = ЗаявкаНаСервис.Автомобиль;
		ЗаказНаряд.Контрагент = ЗаявкаНаСервис.Клиент;
		ЗаказНаряд.ВидРемонта = ЗаявкаНаСервис.ВидРемонта;
		ЗаказНаряд.Заказчик = ЗаявкаНаСервис.Клиент;
		ЗаказНаряд.РегламентированныйУчет = Истина;
		
		Если НЕ ЗначениеЗаполнено(ЗаказНаряд.Номер) Тогда
			ЗаказНаряд.Организация = ЗаявкаНаСервис.ДилерскийЦентр.Организация;
			ЗаказНаряд.ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
			ЗаказНаряд.УстановитьНовыйНомер();
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ЗаказНаряд.Состояние) Тогда
			ЗаказНаряд.Состояние = Справочники.ВидыСостоянийЗаказНарядов.ВРаботе;
		КонецЕсли;
		
		Модальность = ЛОЖЬ;
		
		ТаблицаРаботЗН = ЗаказНаряд.Работы.Выгрузить();
		ТаблицаТоваровЗН = ЗаказНаряд.Товары.Выгрузить();
		ТаблицаИсполнителейЗН = ЗаказНаряд.Исполнители.Выгрузить();
		Если УдалятьОтсутствующиеВЗаявке Тогда
			ЗаказНаряд.Работы.Очистить();
			ЗаказНаряд.Товары.Очистить();
		КонецЕсли;
		ЗаказНаряд.Исполнители.Очистить();
		
		//Если ПараметрыСеанса.Renault_ПраваПользователя.ВерсияАльфаАвто = "5" Тогда
			
		ЗаказНаряд.МатериалыЗаказчика.Очистить();
		
		//КонецЕсли;
		
	КонецЕсли;
	
	ВидРемонта = ЗаявкаНаСервис.ВидРемонта;
	
	СтавкаНДСТовары = Справочники.СтавкиНДС.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(ВидРемонта) Тогда
		
		СтрТаб = ЗаявкаНаСервис.ДилерскийЦентр.Автосервис_СоответсвиеНДСИВидРемонта.Найти(ВидРемонта, "ВидРемонта");
		
		Если ЗначениеЗаполнено(СтрТаб) Тогда
			
			СтавкаНДСРаботы = СтрТаб.СтавкаНДС;
			СтавкаНДСТовары = СтрТаб.СтавкаНДСЗапчасти;
			
		Иначе
			
			СтавкаНДСРаботы = ЗаявкаНаСервис.ДилерскийЦентр.Автосервис_СтавкаНДС;
			СтавкаНДСТовары = СтавкаНДСРаботы;
			
		КонецЕсли;
		
	Иначе
		
		СтавкаНДСРаботы = ЗаявкаНаСервис.ДилерскийЦентр.Автосервис_СтавкаНДС;
		СтавкаНДСТовары = СтавкаНДСРаботы;
		
	КонецЕсли;
	
	Попытка ЗаказНаряд.ОбработкаЗаполнения(Неопределено); 	Исключение 	КонецПопытки;
		
	//Если ПараметрыСеанса.Renault_ПраваПользователя.ВерсияАльфаАвто = "5" Тогда
	ЗаказНаряд.ТипЦенРабот = ЗаявкаНаСервис.ТипЦен;
	ЗаказНаряд.ТипЦен = обПраво("ОсновнойТипЦенПродажи",,,);
	//КонецЕсли;
	
	ЭтоГарантия = РегистрыСведений.Renault_ВидыРемонтаДопРеквизиты.ПолучитьГарантиюЗавода(ЗаказНаряд.ВидРемонта);
	
	// И для гарантии теперь заполняем договор и контрагента DMSCOR-562 13.11.2018
	//Если ЭтоГарантия = ЛОЖЬ Тогда
		// DMSREN-1353
		если ЭтоГарантия тогда 
			ЗаказНаряд.Контрагент = Справочники.Renault_ОбщиеНастройкиБазыДанных.ЭтаБаза.ОсновнойПоставщик;
		иначе
			ЗаказНаряд.Контрагент = ЗаявкаНаСервис.Клиент;
		КонецЕсли;

		ДопПараметры = Новый Структура;
		ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
		ДопПараметры.Вставить("ВидДоговора", ВидДоговора);
		ЕстьТипЦен = (ЗаказНаряд.Метаданные().Реквизиты.Найти("ТипЦен") <> Неопределено);
		ДопПараметры.Вставить("ТипЦенПродажи", ?(ЕстьТипЦен, ЗаказНаряд.ТипЦен, Справочники.ТипыЦен.ПустаяСсылка()));
		ДопПараметры.Вставить("ВалютаВзаиморасчетов", ?(ЗначениеЗаполнено(ДопПараметры.ТипЦенПродажи.ВалютаЦены), ДопПараметры.ТипЦенПродажи.ВалютаЦены, Константы.ВалютаУправленческогоУчетаКомпании.Получить()));
		ДопПараметры.Вставить("ВидОплаты",Перечисления.ВидыОплаты.ПроизвольнаяОплата);

		ЗаказНаряд.ДоговорВзаиморасчетов = дкПолучитьДоговорВзаиморасчетов(ЗаказНаряд.Контрагент, ВидДоговора, ЗаказНаряд, ДопПараметры, Истина);
		Если НЕ ЗначениеЗаполнено(ЗаказНаряд.ДоговорВзаиморасчетов) Тогда
			Попытка
				Выполнить("ЗаказНаряд.ДоговорВзаиморасчетов = Справочники.Контрагенты.ПолучитьДоговорВзаиморасчетов(ЗаказНаряд.Контрагент, ВидДоговора, ЗаказНаряд, ДопПараметры, Истина)");
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		//Дозаполним реквизиты договора.
		Если ЗначениеЗаполнено(ЗаказНаряд.ДоговорВзаиморасчетов) Тогда
			Если НЕ ЗначениеЗаполнено(ЗаказНаряд.ДоговорВзаиморасчетов.ВидОплаты) ИЛИ НЕ ЗначениеЗаполнено(ЗаказНаряд.ДоговорВзаиморасчетов.ВидОплаты) Тогда
				Договор = ЗаказНаряд.ДоговорВзаиморасчетов.ПолучитьОбъект();
				Договор.ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
				Договор.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
				Договор.ЕдиницаИзмеренияАвтоработВПечатныхФормах = обПраво("ЕдиницаИзмеренияАвтоработВПечатныхФормах"); // DMSREN-1228
				Договор.Записать();
			КонецЕсли;
		КонецЕсли;
	//Иначе
	//	ЗаказНаряд.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	//	ЗаказНаряд.ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	//КонецЕсли;	
	ЗаказНаряд.Цех = ЗаявкаНаСервис.ДилерскийЦентр.Автосервис_ЦехЗаказНарядПоУмолчанию;
	ЗаказНаряд.ДополнительныеСвойства.Вставить("ГрупповаяОбработкаДокументов",Истина);
	
	//Устанавливаем реквизиты по умолчанию:
	Если Не ЗначениеЗаполнено(ЗаказНаряд.Дата) Тогда		
		ЗаказНаряд.Дата = ТекущаяДата();		
	КонецЕсли;
	
	// Изменения МИС 06/08/2018
	//
	//Если НЕ ЗначениеЗаполнено(ЗаказНаряд.ДатаСоздания) Тогда
	//	ЗаказНаряд.ДатаСоздания = ТекущаяДата();
	//КонецЕсли;
	
	//Если НЕ ЗначениеЗаполнено(ЗаказНаряд.ДатаМашинозаезда) Тогда     
	//	ЗаказНаряд.ДатаМашинозаезда = ТекущаяДата();
	//КонецЕсли;
	
	
	Если ЗаявкаНаСервис.ДилерскийЦентр.Автосервис_СоздаватьЗаказНарядАвтоматически = Перечисления.Renault_АвтоматическиСоздаватьЗаказНаряд.ПослеЗаписи тогда
		ВернутьДатыДокумента(ЗаказНаряд, ЗаявкаНаСервис);	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЗаказНаряд.ДатаСоздания) Тогда
		ЗаказНаряд.ДатаСоздания = ТекущаяДата();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЗаказНаряд.ДатаМашинозаезда) Тогда     
		ЗаказНаряд.ДатаМашинозаезда = ТекущаяДата();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЗаказНаряд.Дата) Тогда     
		ЗаказНаряд.Дата = ТекущаяДата();
	КонецЕсли;
	
	// Изменения МИС 06/08/2018 --
	
	Если Не ЗначениеЗаполнено(ЗаказНаряд.Организация) Тогда	
		ЗаказНаряд.Организация = ПараметрыСеанса.Организация;	
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ЗаказНаряд.ПодразделениеКомпании) Тогда	
		ЗаказНаряд.ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;	
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(ЗаказНаряд.ВидОплаты) Тогда		
		ЗаказНаряд.ВидОплаты = ЗаявкаНаСервис.ВидОплаты;				
	КонецЕсли;	

	Если НЕ ЗначениеЗаполнено(ЗаказНаряд.ХозОперация) Тогда
		ЗаказНаряд.ХозОперация = Справочники.ХозОперации.ЗаказНаряд;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(ЗаказНаряд.ВалютаДокумента) Тогда
		ЗаказНаряд.ВалютаДокумента = обПраво("ОсновнаяВалютаВзаиморасчетов",,,);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЗаказНаряд.ТипЦен) Тогда
		ЗаказНаряд.ТипЦен = обПраво("ОсновнойТипЦенПродажи",,,);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЗаказНаряд.ВалютаДокумента) И ЗначениеЗаполнено(ЗаказНаряд.ТипЦен) Тогда
		ЗаказНаряд.ВалютаДокумента = ЗаказНаряд.ТипЦен.ВалютаЦены;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ЗаказНаряд.ВалютаДокумента) Тогда
		ЗаказНаряд.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ЗаказНаряд.ТипЦенРабот) Тогда
		ЗаказНаряд.ТипЦенРабот = обПраво("ОсновнойТипЦенРабот",,,);
	КонецЕсли;
	
	Если ЗаказНаряд.КурсВалютыВзаиморасчетов = 0 Тогда
		ЗаказНаряд.КурсВалютыВзаиморасчетов = 1;
	КонецЕсли;

	Если ЗаказНаряд.КурсДокумента = 0 Тогда
		ЗаказНаряд.КурсДокумента = 1;
	КонецЕсли;

	Если ЗаказНаряд.КурсВалютыУпр = 0 Тогда
		ЗаказНаряд.КурсВалютыУпр = 1;
	КонецЕсли;

	
	ЗапросРекомендации = Новый Запрос;
	
	ЗапросРекомендации.Текст = 
	"ВЫБРАТЬ
	|	Renault_ПоврежденияАвтомобилейСрезПоследних.Работа,
	|	Renault_ПоврежденияАвтомобилейСрезПоследних.Регистратор.Ссылка КАК РегистраторСсылка,
	|	Renault_ПоврежденияАвтомобилейСрезПоследних.Регистратор.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.Renault_ПоврежденияАвтомобилей.СрезПоследних КАК Renault_ПоврежденияАвтомобилейСрезПоследних
	|ГДЕ
	|	Renault_ПоврежденияАвтомобилейСрезПоследних.РаботаАктуальна = ИСТИНА
	|	И Renault_ПоврежденияАвтомобилейСрезПоследних.Автомобиль.Ссылка = &Автомобиль
	|ИТОГИ ПО
	|	РегистраторСсылка";
	
	ЗапросРекомендации.УстановитьПараметр("Автомобиль", ЗаявкаНаСервис.Автомобиль);
	РекомендацииВСЕ = ЗапросРекомендации.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Рекомендации = "";
	Пока РекомендацииВСЕ.Следующий() Цикл
		Если ЗначениеЗаполнено(Рекомендации) И ЗначениеЗаполнено(РекомендацииВСЕ.Комментарий) Тогда
			Рекомендации = Рекомендации + Символы.ПС + Строка(РекомендацииВСЕ.Комментарий);
		Иначе
			Рекомендации = Строка(РекомендацииВСЕ.Комментарий);
		КонецЕсли;
		Выборка2 = РекомендацииВСЕ.Выбрать();
		Пока Выборка2.Следующий() Цикл
			Рекомендации = ?(ЗначениеЗаполнено(Рекомендации), Рекомендации + Символы.ПС + Строка(Выборка2.Работа), Строка(Выборка2.Работа));
		КонецЦикла;
	КонецЦикла;
	
	Если Метаданные.Документы.ЗаказНаряд.Реквизиты.Найти("Рекомендации") <> Неопределено Тогда
		ЗаказНаряд.Рекомендации = Рекомендации;
	КонецЕсли;

	Если ДилерскийЦентр.ИспользуетПрограммуЛояльностиRenault Тогда
		Скидка = Renault_АвтосервисСкидки.Reanult_НайтиСоздатьТиповуюСкидку();
	Иначе
		Скидка = Справочники.ТипыСкидок.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДилерскийЦентр.Автосервис_КтоМастерВЗН) Тогда
		Если ДилерскийЦентр.Автосервис_КтоМастерВЗН = Перечисления.Renault_МастерВЗН.МастерПриемщик Тогда
			Если ЗначениеЗаполнено(ЗаявкаНаСервис.Обращение) Тогда
				Приемка = Документы.Renault_CRM_ПриемкаАвтомобиля.НайтиПоРеквизиту("Обращение", ЗаявкаНаСервис.Обращение);
				Если ЗначениеЗаполнено(Приемка) И ЗначениеЗаполнено(Приемка.Машиноместо) Тогда
					Мастер = Приемка.Машиноместо;
				Иначе
					Мастер = ПараметрыСеанса.Пользователь.Сотрудник;
				КонецЕсли;
			Иначе
				Мастер = ПараметрыСеанса.Пользователь.Сотрудник;
			КонецЕсли;
		Иначе
			Мастер = ЗаявкаНаСервис.ДилерскийЦентр.Автосервис_МастерЦеха;
		КонецЕсли;
	Иначе
		Мастер = ПараметрыСеанса.Пользователь.Сотрудник;
	КонецЕсли;
	
	Если Метаданные.Документы.ЗаказНаряд.Реквизиты.Найти("Мастер") <> Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(ЗаказНаряд.Мастер) Тогда
			ЗаказНаряд.Мастер = Мастер;
		КонецЕсли;
	КонецЕсли;	
	Если Метаданные.Документы.ЗаказНаряд.Реквизиты.Найти("Диспетчер") <> Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(ЗаказНаряд.Диспетчер) Тогда
			ЗаказНаряд.Диспетчер = ПараметрыСеанса.Пользователь.Сотрудник;
		КонецЕсли;
	КонецЕсли;
	ПричинаОбащения = ЗаявкаНаСервис.Обращение.Примечание;
	Если Метаданные.Документы.ЗаказНаряд.Реквизиты.Найти("ПричинаОбращения") <> Неопределено Тогда
	    ЗаказНаряд.ПричинаОбращения = ПричинаОбащения;
	ИначеЕсли ПараметрыСеанса.Renault_ПраваПользователя.ВерсияАльфаАвто = "4" И Метаданные.Документы.ЗаказНаряд.ТабличныеЧасти.Найти("ПричиныОбращения") <> Неопределено Тогда
		МассивПричин = обРазложитьСтрокуВМассивПодстрок(ПричинаОбащения, Символы.ПС);
		Для Каждого Прич из МассивПричин Цикл
			НоваяСтрока = ЗаказНаряд.ПричиныОбращения.Добавить();
			НоваяСтрока.СоСловКлиента = Прич;
		КонецЦикла;
	КонецЕсли;
	ЗаказНаряд.Автор = ПараметрыСеанса.Пользователь;
    Если Метаданные.Документы.ЗаказНаряд.Реквизиты.Найти("Пробег") <> Неопределено Тогда
		ЗаказНаряд.Пробег = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ЗаявкаНаСервис.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Работа КАК Работа
	|ПОМЕСТИТЬ РаботыЗаявки
	|ИЗ
	|	Документ.Renault_CRM_ЗаявкаНаСервис.Работы КАК Работы
	|ГДЕ
	|	Ссылка = &СсылкаЗаявка
	|;
	|ВЫБРАТЬ
	|	Renault_CRM_ЗаявкаНаМойку.Ссылка,
	|	Renault_CRM_ЗаявкаНаМойку.ВерсияДанных,
	|	Renault_CRM_ЗаявкаНаМойку.ПометкаУдаления,
	|	Renault_CRM_ЗаявкаНаМойку.Номер,
	|	Renault_CRM_ЗаявкаНаМойку.Дата,
	|	Renault_CRM_ЗаявкаНаМойку.Проведен,
	|	Renault_CRM_ЗаявкаНаМойку.ДилерскийЦентр,
	|	Renault_CRM_ЗаявкаНаМойку.Автор,
	|	Renault_CRM_ЗаявкаНаМойку.Клиент,
	|	Renault_CRM_ЗаявкаНаМойку.ВремяНачала,
	|	Renault_CRM_ЗаявкаНаМойку.ВремяОкончания,
	|	Renault_CRM_ЗаявкаНаМойку.Машиноместо,
	|	Renault_CRM_ЗаявкаНаМойку.ГосНомер,
	|	Renault_CRM_ЗаявкаНаМойку.Автомобиль,
	|	Renault_CRM_ЗаявкаНаМойку.Упущена,
	|	Renault_CRM_ЗаявкаНаМойку.Обращение,
	|	Renault_CRM_ЗаявкаНаМойку.Длительность,
	|	Renault_CRM_ЗаявкаНаМойку.Состояние,
	|	Renault_CRM_ЗаявкаНаМойку.Примечание,
	|	Renault_CRM_ЗаявкаНаМойку.СостояниеИзменено,
	|	Renault_CRM_ЗаявкаНаМойку.ХозОперация,
	|	Renault_CRM_ЗаявкаНаМойку.РаботаМойка,
	|	Renault_CRM_ЗаявкаНаМойку.Платная,
	|	Renault_CRM_ЗаявкаНаМойку.Стоимость,
	|	Renault_CRM_ЗаявкаНаМойку.РаботаМойка.Авторабота
	|ИЗ
	|	Документ.Renault_CRM_ЗаявкаНаМойку КАК Renault_CRM_ЗаявкаНаМойку
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаботыЗаявки КАК РаботыЗаявки
	|	ПО РаботыЗаявки.Работа = Renault_CRM_ЗаявкаНаМойку.РаботаМойка
	|ГДЕ
	|	Renault_CRM_ЗаявкаНаМойку.Обращение = &Обращение
	|	И Renault_CRM_ЗаявкаНаМойку.Платная = &Платная";
	
	Запрос.УстановитьПараметр("Обращение", ЗаявкаНаСервис.Обращение);
	Запрос.УстановитьПараметр("СсылкаЗаявка", ЗаявкаНаСервис.Ссылка);
	Запрос.УстановитьПараметр("Платная", ИСТИНА);
	ПлатныеМойки = Запрос.Выполнить().Выбрать();
	Пока ПлатныеМойки.Следующий() Цикл
		Если ТипЗнч(ПлатныеМойки.РаботаМойка) = Тип("СправочникСсылка.Автоработы") Тогда
			Авторабота = ПлатныеМойки.РаботаМойка;
		Иначе
			Авторабота = ПлатныеМойки.РаботаМойка.Авторабота;
		КонецЕсли;
		
		Если ЗаказНаряд.Работы.Найти(Авторабота, "Работа") <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ЗаказНаряд.Работы.Добавить();
		НоваяСтрока.Работа = Авторабота;
		ИзРегистра = РегистрыСведений.ЦеныАвторабот.СрезПоследних().Найти(Авторабота, "Авторабота");
		
		Если ЗначениеЗаполнено(ПлатныеМойки.Ссылка.Нормочас) Тогда
			НоваяСтрока.Нормочас = ПлатныеМойки.Ссылка.Нормочас;
		ИначеЕсли ИзРегистра = Неопределено Тогда
			Сообщить("Не указан нормочас для работы " + Авторабота);
		Иначе
			НоваяСтрока.Нормочас = ИзРегистра.Нормочас;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НоваяСтрока.Нормочас) Тогда
			НоваяСтрока.Нормочас = ДилерскийЦентр.Автосервис_Нормочас;
		КонецЕсли;
		
		Длительность = ПлатныеМойки.Длительность;
		Если НЕ ЗначениеЗаполнено(Длительность) Тогда
			Если ТипЗнч(ПлатныеМойки.РаботаМойка) = Тип("СправочникСсылка.Автоработы") Тогда
				Длительность = ПлатныеМойки.РаботаМойка.Ссылка.ВремяВыполнения; 
			Иначе
				Длительность = ПлатныеМойки.РаботаМойка.Длительность;
			КонецЕсли;
		КонецЕсли;
		НоваяСтрока.СуммаВсего = ПлатныеМойки.Стоимость;
		НоваяСтрока.Цена = ПлатныеМойки.Ссылка.Цена;
		НоваяСтрока.Сумма = ПлатныеМойки.Стоимость;
		НоваяСтрока.Количество = 1;
		НоваяСтрока.СтавкаНДС = СтавкаНДСРаботы;
		НоваяСтрока.Коэффициент = Длительность;
		НоваяСтрока.ИдентификаторРаботы = Новый УникальныйИдентификатор;
		
		Если ЗаявкаНаСервис.ДилерскийЦентр.Автосервис_ИсполнителиМойкиВЗН = ИСТИНА Тогда
			Если ЗначениеЗаполнено(ПлатныеМойки.Машиноместо) и ЗначениеЗаполнено(ПлатныеМойки.Машиноместо.Исполнитель) Тогда
				СтрокаИсполнители = ЗаказНаряд.Исполнители.Добавить();
				СтрокаИсполнители.ИдентификаторРаботы = НоваяСтрока.ИдентификаторРаботы;
				СтрокаИсполнители.Цех = ПлатныеМойки.Машиноместо;
				СтрокаИсполнители.Исполнитель = ПлатныеМойки.Машиноместо.Исполнитель;
				СтрокаИсполнители.Процент = 100;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	СуммаСкидкиПоБалламРаботы = 0;
	СуммаСкидкиПоБалламЗЧ = 0;
	
	Для Каждого Строка ИЗ ЗаявкаНаСервис.Работы Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Работа", Строка.Работа);
		Отбор.Вставить("Коэффициент", Строка.ДлительностьЗН);
		МассивСтрок = ЗаказНаряд.Работы.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		Отбор = Новый Структура;
		Отбор.Вставить("Работа", Строка.Работа);
		Отбор.Вставить("Коэффициент", Строка.ДлительностьЗН);
		МассивСтрок = ТаблицаРаботЗН.НайтиСтроки(Отбор);
		
		КоличествоОдинаковыхСтрок = МассивСтрок.Количество();
		Если КоличествоОдинаковыхСтрок > 0 Тогда
			Для Каждого СтрокаИЗМассива ИЗ МассивСтрок Цикл
				НоваяСтрока = ЗаказНаряд.Работы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИЗМассива, , "ПроцентСкидки, СуммаСкидки");
				НоваяСтрока.ПроцентСкидкиСтроки = Строка.ПроцентСкидки;
				НоваяСтрока.СуммаВсего = Строка.Сумма * КоличествоОдинаковыхСтрок;
				НоваяСтрока.СуммаСкидкиСтроки = Строка.СуммаСкидки * КоличествоОдинаковыхСтрок;
				НоваяСтрока.СуммаСкидки = Строка.СуммаСкидки * КоличествоОдинаковыхСтрок;
				НоваяСтрока.Сумма = НоваяСтрока.СуммаВсего + НоваяСтрока.СуммаСкидкиСтроки;
				НоваяСтрока.Цена = Строка.Цена;
				НоваяСтрока.Нормочас = Строка.Нормочас;
				Если ДилерскийЦентр.ИспользуетПрограммуЛояльностиRenault Тогда
					НоваяСтрока.СкидкаНаТовар = Скидка;
					Если Строка.DMS_СуммаБонусныхБаллов > 0 Тогда
						НоваяСтрока.СуммаСкидкиСтроки = НоваяСтрока.СуммаСкидкиСтроки + Строка.DMS_СуммаБонусныхБаллов * КоличествоОдинаковыхСтрок;
						НоваяСтрока.Сумма = НоваяСтрока.СуммаВсего +  НоваяСтрока.СуммаСкидкиСтроки;
					КонецЕсли;
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(НоваяСтрока.Нормочас) Тогда
					НоваяСтрока.Нормочас = ЗаявкаНаСервис.Нормочас;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Отбор = Новый Структура;
			Отбор.Вставить("Работа", Строка.Работа);
			МассивСтрок = ЗаявкаНаСервис.Работы.НайтиСтроки(Отбор);
			КоличествоОдинаковыхСтрок = МассивСтрок.Количество();
			Если ЗаказНаряд.Работы.Найти(Строка.Работа, "Работа") <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = ЗаказНаряд.Работы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, ,"ПроцентСкидки, СуммаСкидки");
			Длительность = Строка.ДлительностьЗН;
			Если НЕ ЗначениеЗаполнено(Длительность) Тогда
				Длительность = Строка.Работа.Ссылка.ВремяВыполнения; 
			КонецЕсли;
			НоваяСтрока.Количество = КоличествоОдинаковыхСтрок;
			НоваяСтрока.СтавкаНДС = СтавкаНДСРаботы;
			НоваяСтрока.Коэффициент = Длительность * ?(Строка.Коэффициент = 0, 1, Строка.Коэффициент);;
			
			Если ЗаявкаНаСервис.Работы.Итог("Сумма") > 0 Тогда 
				НоваяСтрока.ПроцентСкидкиСтроки = Строка.ПроцентСкидки;
				НоваяСтрока.СуммаСкидкиСтроки = Строка.СуммаСкидки * КоличествоОдинаковыхСтрок;
				НоваяСтрока.СуммаСкидки = Строка.СуммаСкидки * КоличествоОдинаковыхСтрок;
				Если ДилерскийЦентр.ИспользуетПрограммуЛояльностиRenault Тогда
					НоваяСтрока.СкидкаНаТовар = Скидка;
					Если Строка.DMS_СуммаБонусныхБаллов > 0 Тогда
						НоваяСтрока.СуммаСкидкиСтроки = НоваяСтрока.СуммаСкидкиСтроки + Строка.DMS_СуммаБонусныхБаллов * КоличествоОдинаковыхСтрок;						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ДилерскийЦентр.ИспользуетПрограммуЛояльностиRenault Тогда
				НоваяСтрока.Сумма = (Строка.Сумма + Строка.СуммаСкидки + Строка.DMS_СуммаБонусныхБаллов) * КоличествоОдинаковыхСтрок;
				НоваяСтрока.СуммаВсего = НоваяСтрока.Сумма; //НоваяСтрока.СуммаВсего = Строка.Сумма * КоличествоОдинаковыхСтрок;	
			Иначе
				НоваяСтрока.СуммаВсего = Строка.Сумма * КоличествоОдинаковыхСтрок;
				НоваяСтрока.Сумма = Строка.Сумма * КоличествоОдинаковыхСтрок;
			КонецЕсли;
			
			//НоваяСтрока.СуммаВсего = (НоваяСтрока.СуммаВсего - НоваяСтрока.СуммаСкидкиСтроки);
			НоваяСтрока.ИдентификаторРаботы = Новый УникальныйИдентификатор;
			НоваяСтрока.Нормочас = Строка.Нормочас;
			НоваяСтрока.ПримечаниеРаботыПечать = ?(Строка.Коэффициент = 0 ИЛИ Строка.Коэффициент = 1, "", "Коэффициент: " + Строка.Коэффициент);
			НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаВсего * СтавкаНДСРаботы.Ставка / (100+СтавкаНДСРаботы.Ставка);
			
			Если ЗначениеЗаполнено(Строка.Цена) Тогда
				НоваяСтрока.Цена = Строка.Цена;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(НоваяСтрока.Нормочас) Тогда
				НоваяСтрока.Нормочас = ЗаявкаНаСервис.Нормочас;
			КонецЕсли;
		КонецЕсли;
		
		//ЗаявкаНаСервис.Работы
		
		Этапы = ЗаявкаНаСервис.СоставЭтапа.НайтиСтроки(Новый Структура("IDРаботы", Строка.IDРаботы));
		Для Каждого Этап из Этапы Цикл
			Эт = ЗаявкаНаСервис.Этапы.Найти(Этап.IDЭтапа, "IDЭтапа");
			Цех = Эт.Цех;
			Если ЗаявкаНаСервис.ДилерскийЦентр.Автосервис_Отбивка_ЗапрашиватьИсполнителя = Истина Тогда
				Исполнители = ЗаявкаНаСервис.ВыполнениеРабот.НайтиСтроки(Новый Структура("Этап", Этап.IDЭтапа));
				Если ЗначениеЗаполнено(Исполнители) Тогда
					Для Каждого Исполнитель ИЗ Исполнители Цикл
						СтрокаИсполнители = ЗаказНаряд.Исполнители.Добавить();
						СтрокаИсполнители.ИдентификаторРаботы = НоваяСтрока.ИдентификаторРаботы;
						СтрокаИсполнители.Цех = Цех;
						СтрокаИсполнители.Исполнитель = Исполнитель.Исполнитель;
						СтрокаИсполнители.Процент = 100 / Исполнители.Количество();
					КонецЦикла;
				Иначе
					Исполнители = Renault_ПолучитьИсполнителейЗаПериод(Эт.НачалоЭтапа, Эт.КонецЭтапа, Неопределено, Цех);
					Если ЗначениеЗаполнено(Исполнители) Тогда
						Исполнители.Свернуть("Сотрудник");
						Для Каждого Исполнитель ИЗ Исполнители Цикл
							СтрокаИсполнители = ЗаказНаряд.Исполнители.Добавить();
							СтрокаИсполнители.ИдентификаторРаботы = НоваяСтрока.ИдентификаторРаботы;
							СтрокаИсполнители.Цех = Цех;
							СтрокаИсполнители.Исполнитель = Исполнитель.Сотрудник;
							СтрокаИсполнители.Процент = 100 / Исполнители.Количество();
						КонецЦикла;
					Иначе
						ЦехДЦ = ЗаявкаНаСервис.ДилерскийЦентр.АвтосервисЦеха.Найти(Цех, "Цех");
						Если ЗначениеЗаполнено(ЦехДЦ) И ЗначениеЗаполнено(ЦехДЦ.ИсполнительПоУмолчанию) Тогда
							СтрокаИсполнители = ЗаказНаряд.Исполнители.Добавить();
							СтрокаИсполнители.ИдентификаторРаботы = НоваяСтрока.ИдентификаторРаботы;
							СтрокаИсполнители.Цех = Цех;
							СтрокаИсполнители.Исполнитель = ЦехДЦ.ИсполнительПоУмолчанию;
							СтрокаИсполнители.Процент = 100 / Этапы.Количество();
						ИначеЕсли ЗначениеЗаполнено(ЦехДЦ) И НЕ ЗначениеЗаполнено(ЦехДЦ.ИсполнительПоУмолчанию) Тогда
							СтрокаИсполнители = ЗаказНаряд.Исполнители.Добавить();
							СтрокаИсполнители.ИдентификаторРаботы = НоваяСтрока.ИдентификаторРаботы;
							СтрокаИсполнители.Цех = Цех;
							СтрокаИсполнители.Исполнитель = Справочники.Сотрудники.ПустаяСсылка();
							СтрокаИсполнители.Процент = 100 / Этапы.Количество();
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Исполнители = Renault_ПолучитьИсполнителейЗаПериод(Эт.НачалоЭтапа, Эт.КонецЭтапа, Неопределено, Цех);
				Если ЗначениеЗаполнено(Исполнители) Тогда
					Исполнители.Свернуть("Сотрудник");
					Для Каждого Исполнитель ИЗ Исполнители Цикл
						СтрокаИсполнители = ЗаказНаряд.Исполнители.Добавить();
						СтрокаИсполнители.ИдентификаторРаботы = НоваяСтрока.ИдентификаторРаботы;
						СтрокаИсполнители.Цех = Цех;
						СтрокаИсполнители.Исполнитель = Исполнитель.Сотрудник;
						СтрокаИсполнители.Процент = 100 / Исполнители.Количество();
					КонецЦикла;
				Иначе
					ЦехДЦ = ЗаявкаНаСервис.ДилерскийЦентр.АвтосервисЦеха.Найти(Цех, "Цех");
					Если ЗначениеЗаполнено(ЦехДЦ) И ЗначениеЗаполнено(ЦехДЦ.ИсполнительПоУмолчанию) Тогда
						СтрокаИсполнители = ЗаказНаряд.Исполнители.Добавить();
						СтрокаИсполнители.ИдентификаторРаботы = НоваяСтрока.ИдентификаторРаботы;
						СтрокаИсполнители.Цех = Цех;
						СтрокаИсполнители.Исполнитель = ЦехДЦ.ИсполнительПоУмолчанию;
						СтрокаИсполнители.Процент = 100 / Этапы.Количество();
					ИначеЕсли ЗначениеЗаполнено(ЦехДЦ) И НЕ ЗначениеЗаполнено(ЦехДЦ.ИсполнительПоУмолчанию) Тогда
						//СтрокаИсполнители = ЗаказНаряд.Исполнители.Добавить();
						//СтрокаИсполнители.ИдентификаторРаботы = НоваяСтрока.ИдентификаторРаботы;
						//СтрокаИсполнители.Цех = Цех;
						//СтрокаИсполнители.Исполнитель = Справочники.Сотрудники.ПустаяСсылка();
						//СтрокаИсполнители.Процент = 100 / Этапы.Количество();
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ЗаявкаНаСервис.Товары) ИЛИ ЗначениеЗаполнено(ЗаявкаНаСервис.ДополнительноеОборудование) Тогда
		Склад = ЗаявкаНаСервис.ДилерскийЦентр.Автосервис_СкладПоУмолчанию;
		Если НЕ ЗначениеЗаполнено(Склад) Тогда
			Склад = Справочники.СкладыКомпании.ОсновнойСкладКомпании;
		КонецЕсли;
	КонецЕсли;
	Для Каждого Строка ИЗ ЗаявкаНаСервис.Товары Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", Строка.Номенклатура);
		МассивСтрок = ЗаказНаряд.Товары.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() > 0 Тогда
			НоваяСтрока = МассивСтрок[0];
			Если НоваяСтрока.Цена = Строка.Цена Тогда // Если в заказ-наряде уже есть такая деталь, то добавляем её количество.
				
				//Сергеев В.Н. DMSREN-953
				НоваяСтрока.ПроцентСкидкиСтроки = Строка.ПроцентСкидки;
				НоваяСтрока.СуммаСкидкиСтроки = НоваяСтрока.СуммаСкидкиСтроки + Строка.СуммаСкидки;
				НоваяСтрока.СуммаСкидки = НоваяСтрока.СуммаСкидки + Строка.СуммаСкидки;
				НоваяСтрока.Количество = НоваяСтрока.Количество + Строка.Количество;
				НоваяСтрока.Сумма = НоваяСтрока.Сумма + Строка.Сумма;
				НоваяСтрока.СуммаВсего = НоваяСтрока.СуммаВсего + Строка.Сумма;
				
				Если ДилерскийЦентр.ИспользуетПрограммуЛояльностиRenault Тогда
					НоваяСтрока.СкидкаНаТовар = Скидка;
					Если Строка.DMS_СуммаБонусныхБаллов > 0 Тогда
						НоваяСтрока.СуммаСкидкиСтроки = НоваяСтрока.СуммаСкидкиСтроки + Строка.DMS_СуммаБонусныхБаллов;
						НоваяСтрока.Сумма = НоваяСтрока.Сумма +  НоваяСтрока.СуммаСкидкиСтроки;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", Строка.Номенклатура);
		Отбор.Вставить("Количество", Строка.Количество);
		МассивСтрок = ТаблицаТоваровЗН.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() > 0 Тогда
			Для Каждого СтрокаИЗМассива ИЗ МассивСтрок Цикл
				НоваяСтрока = ЗаказНаряд.Товары.Добавить();				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИЗМассива, , "ПроцентСкидки, СуммаСкидки");				
				НоваяСтрока.ПроцентСкидкиСтроки = Строка.ПроцентСкидки;
				НоваяСтрока.СуммаСкидкиСтроки = Строка.СуммаСкидки;
				НоваяСтрока.СуммаСкидки = Строка.СуммаСкидки;
				НоваяСтрока.СуммаВсего = Строка.Сумма;
				Если ДилерскийЦентр.ИспользуетПрограммуЛояльностиRenault Тогда					
					НоваяСтрока.СкидкаНаТовар = Скидка;
					Если Строка.DMS_СуммаБонусныхБаллов > 0 Тогда
						НоваяСтрока.СуммаСкидкиСтроки = НоваяСтрока.СуммаСкидкиСтроки + Строка.DMS_СуммаБонусныхБаллов;						
					КонецЕсли;
				КонецЕсли;
				НоваяСтрока.Сумма = НоваяСтрока.СуммаВсего + НоваяСтрока.СуммаСкидкиСтроки;
				НоваяСтрока.Цена = Строка.Цена;				
			КонецЦикла;
		Иначе
			Если Строка.ВналичииУКлиента <> Истина Тогда
				НоваяСтрока = ЗаказНаряд.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, ,"ПроцентСкидки, СуммаСкидки");
				НоваяСтрока.СкладКомпании = Склад;
				НоваяСтрока.ЕдиницаИзмерения = Строка.Номенклатура.ОсновнаяЕдиницаИзмерения;
				Если ЗначениеЗаполнено(СтавкаНДСТовары) Тогда
					НДСТовара = СтавкаНДСТовары;
				Иначе
					НДСТовара = Строка.Номенклатура.СтавкаНДС;
				КонецЕсли;
				НоваяСтрока.СтавкаНДС = НДСТовара;
				НоваяСтрока.Количество = Строка.Количество;
				НоваяСтрока.ПроцентСкидкиСтроки = Строка.ПроцентСкидки;
				НоваяСтрока.СуммаСкидкиСтроки = Строка.СуммаСкидки;
				НоваяСтрока.СуммаСкидки = Строка.СуммаСкидки;
				НоваяСтрока.СуммаВсего = Строка.Сумма;
				НоваяСтрока.Коэффициент = 1;
				Если ДилерскийЦентр.ИспользуетПрограммуЛояльностиRenault Тогда
					НоваяСтрока.СкидкаНаТовар = Скидка;
					Если Строка.DMS_СуммаБонусныхБаллов > 0 Тогда
						НоваяСтрока.СуммаСкидкиСтроки = НоваяСтрока.СуммаСкидкиСтроки + Строка.DMS_СуммаБонусныхБаллов;						
					КонецЕсли;
				КонецЕсли;
				Если ЗаявкаНаСервис.Товары.Итог("Сумма") > 0 Тогда
					НоваяСтрока.СуммаСкидкиСтроки = НоваяСтрока.СуммаСкидкиСтроки;
				КонецЕсли;
				
				НоваяСтрока.Сумма = НоваяСтрока.СуммаВсего + НоваяСтрока.СуммаСкидкиСтроки;
				НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаВсего * НДСТовара.Ставка / (100+НДСТовара.Ставка);
				//Если ПараметрыСеанса.Renault_ПраваПользователя.ВерсияАльфаАвто = "4" Тогда
				//	НоваяСтрока.Источник = Перечисления.ЗаказНарядНоменклатураИсточник.ДетальСоСклада;
				//КонецЕсли;
			Иначе
				//Если ПараметрыСеанса.Renault_ПраваПользователя.ВерсияАльфаАвто = "4" Тогда
				//	НоваяСтрока = ЗаказНаряд.Товары.Добавить();
				//	НоваяСтрока.СкладКомпании = Склад;
				//	НоваяСтрока.ЕдиницаИзмерения = Строка.Номенклатура.ОсновнаяЕдиницаИзмерения;
				//	НДСТовара = Строка.Номенклатура.СтавкаНДС;
				//	НоваяСтрока.СтавкаНДС = НДСТовара;
				//	НоваяСтрока.Количество = Строка.Количество;
				//	Если ДилерскийЦентр.ИспользуетПрограммуЛояльностиRenault Тогда
				//		НоваяСтрока.СкидкаНаТовар = Строка.Скидка;
				//		Если Строка.DMS_СуммаБонусныхБаллов > 0 Тогда
				//			НоваяСтрока.СуммаСкидкиСтроки = НоваяСтрока.СуммаСкидкиСтроки + Строка.DMS_СуммаБонусныхБаллов;						
				//		КонецЕсли;
				//	КонецЕсли;
				//	НоваяСтрока.СуммаВсего = Строка.Сумма;
				//	НоваяСтрока.Коэффициент = 1;
				//	НоваяСтрока.СуммаСкидкиСтроки = НоваяСтрока.СуммаСкидкиСтроки;
				//	НоваяСтрока.СуммаВсего = НоваяСтрока.СуммаВсего - НоваяСтрока.СуммаСкидкиСтроки;
				//	НоваяСтрока.Источник = Перечисления.ЗаказНарядНоменклатураИсточник.ДетальЗаказчика;
				//	НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаВсего * НДСТовара.Ставка / (100+НДСТовара.Ставка);
				//Иначе
				НоваяСтрока = ЗаказНаряд.МатериалыЗаказчика.Добавить();
				НоваяСтрока.Коэффициент = 1;
				Новаястрока.ЕдиницаИзмерения = Строка.Номенклатура.ОсновнаяЕдиницаИзмерения;
				НоваяСтрока.Количество = Строка.Количество;
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				//КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Товар ИЗ ЗаявкаНаСервис.ДополнительноеОборудование Цикл
		НовСтрока = ЗаказНаряд.Товары.Добавить();	
		ЗаполнитьЗначенияСвойств(НовСтрока,Товар);
		Если ТипЗнч(Товар.Оборудование) = Тип("СправочникСсылка.Номенклатура") Тогда
			НовСтрока.Номенклатура = Товар.Оборудование;
		ИначеЕсли ТипЗнч(Товар.Оборудование) = Тип("СправочникСсылка.Автоработы") Тогда
			НовСтрока.Номенклатура = Товар.Оборудование.Номенклатура;
		Иначе
			НовСтрока.Номенклатура = Товар.Оборудование.ОсновнойТовар;
		КонецЕсли;
		НовСтрока.ЕдиницаИзмерения = НовСтрока.Номенклатура.ОсновнаяЕдиницаИзмерения;
		НовСтрока.Коэффициент = 1;
		НовСтрока.Количество = Товар.Количество;
		НовСтрока.Цена       = Товар.Себестоимость;	
		НовСтрока.СуммаВсего = Окр(НовСтрока.Цена * НовСтрока.Количество, 2);
		НовСтрока.СкладКомпании = Склад;
		НДСТовара = НовСтрока.Номенклатура.СтавкаНДС;
		НовСтрока.СтавкаНДС = НДСТовара; 
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДилерскийЦентр) И ДилерскийЦентр.ИспользуетПрограммуЛояльностиRenault Тогда
		ДокументСписание = Документы.Renault_СписаниеНачислениеБаллов.НайтиПоРеквизиту("ЗаявкаНаСервис", ЗаявкаНаСервис);
		//Если ЗначениеЗаполнено(ЗаказНаряд.Комментарий) И Найти(ЗаказНаряд.Комментарий, "Оплачено баллами: ") > 0 Тогда
		//	Начало = Найти(ЗаказНаряд.Комментарий, "[");
		//	Конец = Найти(ЗаказНаряд.Комментарий, "]");
		//	ЗаказНаряд.Комментарий = Лев(ЗаказНаряд.Комментарий,Начало) + Строка(ЗаявкаНаСервис.ЗапчастиОплатаБаллами + ЗаявкаНаСервис.РаботыОплатаБаллами) + Прав(ЗаказНаряд.Комментарий, СтрДлина(ЗаказНаряд.Комментарий) - Конец + 1);
		//Иначе
		//	ЗаказНаряд.Комментарий = Строка(ЗаказНаряд.Комментарий) + "      " + "Оплачено баллами: " + "[" + Строка(ЗаявкаНаСервис.ЗапчастиОплатаБаллами + ЗаявкаНаСервис.РаботыОплатаБаллами) + "]";
		//КонецЕсли;
		СуммаСкидкиПоБалламРаботы = ЗаявкаНаСервис.РаботыОплатаБаллами;
		СуммаСкидкиПоБалламЗЧ = ЗаявкаНаСервис.ЗапчастиОплатаБаллами;
	КонецЕсли;
	
	ЗаказНаряд.СуммаСкидкиНаценкиРабот = ЗаявкаНаСервис.СуммаСкидкиРаботыВсего;
	ЗаказНаряд.СуммаСкидкиНаценки = ЗаявкаНаСервис.СуммаСкидкиРаботыВсего + ЗаявкаНаСервис.СуммаСкидкиЗапчастиВсего
		+ СуммаСкидкиПоБалламРаботы + СуммаСкидкиПоБалламЗЧ;
		
	ЗаказНаряд.СуммаДокумента = ЗаказНаряд.СуммаДокумента - ЗаказНаряд.СуммаСкидкиНаценки;
	
	Если ЗаказНаряд.Исполнители.Количество()=0 тогда
		ЗаказНаряд.Исполнители.Загрузить(ТаблицаИсполнителейЗН);
	КонецЕсли;	
	
	Если ПоказыватьДокумент Тогда
		Попытка
			ЗаказНаряд.Записать(РежимЗаписиДокумента.Запись);
			Если ЗначениеЗаполнено(ДокументСписание) Тогда
				ДокументОб = ДокументСписание.Ссылка.ПолучитьОбъект();
				ДокументОб.ЗаказНаряд = ЗаказНаряд.Ссылка;
				ДокументОб.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			Если Модальность = Истина Тогда
				ЗаказНаряд.ПолучитьФорму().ОткрытьМодально();
				Возврат ЗаказНаряд.Ссылка;
			Иначе
				ЗаказНаряд.ПолучитьФорму().Открыть();
				Возврат ЗаказНаряд.Ссылка;				
			КонецЕсли;
		Исключение
			ЗаказНаряд.ОбменДанными.Загрузка = Истина;
			ЗаказНаряд.Записать(РежимЗаписиДокумента.Запись);
			ЗаказНаряд.ОбменДанными.Загрузка = Ложь; // DMSREN-1160
			Если ЗначениеЗаполнено(ДокументСписание) Тогда
				ДокументОб = ДокументСписание.Ссылка.ПолучитьОбъект();
				ДокументОб.ЗаказНаряд = ЗаказНаряд.Ссылка;
				ДокументОб.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			ЗаказНаряд.ПолучитьФорму().ОткрытьМодально();
			Если НЕ ЗаказНаряд.ЭтоНовый() тогда
				Возврат ЗаказНаряд.Ссылка;
			Иначе
				Возврат Неопределено;
			КонецЕсли;
		КонецПопытки;
	Иначе
		ЗаказНаряд.ОбменДанными.Загрузка = Истина;
		ЗаказНаряд.Записать(РежимЗаписиДокумента.Запись);
		Возврат ЗаказНаряд.Ссылка;
	КонецЕсли;
	
КонецФункции

Функция Reanult_ОбновитьСформироватьЗаказНаряд51(ЗаказНаряд, ЗаявкаНаСервис, ПоказыватьДокумент = Истина) Экспорт
	
	ДилерскийЦентр = ЗаявкаНаСервис.ДилерскийЦентр;
	УдалятьОтсутствующиеВЗаявке = ДилерскийЦентр.Автосервис_УдалятьВЗНОтсутствующиеВЗаявке;
	
	Если ЗаказНаряд = Неопределено Тогда
		
		ЗаказНаряд = Документы.ЗаказНаряд.СоздатьДокумент();
		ТаблицаРаботЗН = ЗаказНаряд.Работы.Выгрузить();
		ТаблицаТоваровЗН = ЗаказНаряд.Товары.Выгрузить();
		
	Иначе
		
		ЗаказНаряд = ЗаказНаряд.Ссылка.ПолучитьОбъект();
		
		ТаблицаРаботЗН = ЗаказНаряд.Работы.Выгрузить();
		ТаблицаТоваровЗН = ЗаказНаряд.Товары.Выгрузить();
		Если УдалятьОтсутствующиеВЗаявке Тогда
			ЗаказНаряд.Работы.Очистить();
			ЗаказНаряд.Товары.Очистить();
		КонецЕсли;
		ЗаказНаряд.Исполнители.Очистить();
		
		//Если ПараметрыСеанса.Renault_ПраваПользователя.ВерсияАльфаАвто = "5" Тогда
			
		ЗаказНаряд.МатериалыЗаказчика.Очистить();
			
		//КонецЕсли;
		
	КонецЕсли;
	
	ВидРемонта = ЗаявкаНаСервис.ВидРемонта;
	
	СтавкаНДСТовары = Справочники.СтавкиНДС.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(ВидРемонта) Тогда
		
		СтрТаб = ЗаявкаНаСервис.ДилерскийЦентр.Автосервис_СоответсвиеНДСИВидРемонта.Найти(ВидРемонта, "ВидРемонта");
		
		Если ЗначениеЗаполнено(СтрТаб) Тогда
			
			СтавкаНДСРаботы = СтрТаб.СтавкаНДС;
			СтавкаНДСТовары = СтрТаб.СтавкаНДСЗапчасти;
			
		Иначе
			
			СтавкаНДСРаботы = ЗаявкаНаСервис.ДилерскийЦентр.Автосервис_СтавкаНДС;
			
		КонецЕсли;
		
	Иначе
		
		СтавкаНДСРаботы = ЗаявкаНаСервис.ДилерскийЦентр.Автосервис_СтавкаНДС;
		
	КонецЕсли;
	
	//Попытка
	//
	//	ЗаказНаряд.ОбработкаЗаполнения(Неопределено);
	//	
	//Исключение
	//	
	//	
	//КонецПопытки;
	
	ЗаказНаряд.ВидРемонта = ЗаявкаНаСервис.ВидРемонта;
	ЗаказНаряд.Автомобиль = ЗаявкаНаСервис.Автомобиль;
	ЗаказНаряд.Карточка = ЗаявкаНаСервис.Карточка;
	
	ЗаказНаряд.Заказчик = ЗаявкаНаСервис.Клиент;
	
	ЗаказНаряд.ТипЦен = ЗаявкаНаСервис.ТипЦен;
	ЗаказНаряд.Организация = ПараметрыСеанса.Организация;
	ЗаказНаряд.ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
	
	//Если ПараметрыСеанса.Renault_ПраваПользователя.ВерсияАльфаАвто = "5" Тогда
		
	ЗаказНаряд.ТипЦенРабот = ЗаявкаНаСервис.ТипЦен;
		
	//КонецЕсли;
	
	ЭтоГарантия = РегистрыСведений.Renault_ВидыРемонтаДопРеквизиты.ПолучитьГарантиюЗавода(ЗаказНаряд.ВидРемонта); 
	
	Если ЭтоГарантия = ЛОЖЬ Тогда
		
		ЗаказНаряд.Контрагент = ЗаявкаНаСервис.Клиент;
		
		ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
		
		ДопПараметры = Новый Структура;
		ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
		ДопПараметры.Вставить("ВидДоговора", ВидДоговора);
		ЕстьТипЦен = (ЗаказНаряд.Метаданные().Реквизиты.Найти("ТипЦен") <> Неопределено);
		ДопПараметры.Вставить("ТипЦенПродажи", ?(ЕстьТипЦен, ЗаказНаряд.ТипЦен, Справочники.ТипыЦен.ПустаяСсылка()));
		ДопПараметры.Вставить("ВалютаВзаиморасчетов", ЗаказНаряд.ТипЦен.ВалютаЦены);		
		Если НЕ ЗначениеЗаполнено(ЗаказНаряд.ВалютаДокумента) Тогда
			
			ЗаказНаряд.ВалютаДокумента = ЗаказНаряд.ТипЦен.ВалютаЦены;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ЗаказНаряд.Дата) Тогда
			
			ЗаказНаряд.Дата = ТекущаяДата();
			
		КонецЕсли;
		
		ДоговорВзаиморасчетов = дкПолучитьДоговорВзаиморасчетов(ЗаказНаряд.Контрагент, ВидДоговора, ЗаказНаряд, ДопПараметры, Истина);
		Если НЕ ЗначениеЗаполнено(ДоговорВзаиморасчетов) Тогда
			Попытка
				Выполнить("ДоговорВзаиморасчетов = Справочники.Контрагенты.ПолучитьДоговорВзаиморасчетов(ЗаказНаряд.Контрагент, ВидДоговора, ЗаказНаряд, ДопПараметры, Истина)");
			Исключение
			КонецПопытки;
		КонецЕсли;		
		ЗаказНаряд.ДоговорВзаиморасчетов = ДоговорВзаиморасчетов;
		
	Иначе
		
		ЗаказНаряд.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		ЗаказНаряд.ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
		
	КонецЕсли;
	
	ЗаказНаряд.Дата = ТекущаяДата();
	
	ЗаказНаряд.Цех = ЗаявкаНаСервис.ДилерскийЦентр.Автосервис_ЦехЗаказНарядПоУмолчанию;
	
	Если Не ЗначениеЗаполнено(ЗаказНаряд.ВидОплаты) Тогда
		
		ЗаказНаряд.ВидОплаты = ЗаявкаНаСервис.ВидОплаты;
		
	КонецЕсли;
	
	ЗапросРекомендации = Новый Запрос;
	
	ЗапросРекомендации.Текст = 
	"ВЫБРАТЬ
	|	Renault_ПоврежденияАвтомобилейСрезПоследних.Работа,
	|	Renault_ПоврежденияАвтомобилейСрезПоследних.Регистратор.Ссылка КАК РегистраторСсылка,
	|	Renault_ПоврежденияАвтомобилейСрезПоследних.Регистратор.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.Renault_ПоврежденияАвтомобилей.СрезПоследних КАК Renault_ПоврежденияАвтомобилейСрезПоследних
	|ГДЕ
	|	Renault_ПоврежденияАвтомобилейСрезПоследних.РаботаАктуальна = ИСТИНА
	|	И Renault_ПоврежденияАвтомобилейСрезПоследних.Автомобиль.Ссылка = &Автомобиль
	|ИТОГИ ПО
	|	РегистраторСсылка";
	ЗапросРекомендации.УстановитьПараметр("Автомобиль", ЗаявкаНаСервис.Автомобиль);
	
	РекомендацииВСЕ = ЗапросРекомендации.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Рекомендации = "";
	
	Пока РекомендацииВСЕ.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Рекомендации) И ЗначениеЗаполнено(РекомендацииВСЕ.Комментарий) Тогда
			
			Рекомендации = Рекомендации + Символы.ПС + Строка(РекомендацииВСЕ.Комментарий);
			
		Иначе
			
			Рекомендации = Строка(РекомендацииВСЕ.Комментарий);
			
		КонецЕсли;
		
		Выборка2 = РекомендацииВСЕ.Выбрать();
		
		Пока Выборка2.Следующий() Цикл
			
			Рекомендации = Рекомендации + Символы.ПС + Строка(Выборка2.Работа);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Попытка
		
		ЗаказНаряд.Рекомендации = Рекомендации;
		
	Исключение
		
	КонецПопытки;
	
	Если ДилерскийЦентр.ИспользуетПрограммуЛояльностиRenault Тогда
		
		Скидка = Renault_АвтосервисСкидки.Reanult_НайтиСоздатьТиповуюСкидку();
		
	Иначе
		
		Скидка = Справочники.ТипыСкидок.ПустаяСсылка();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДилерскийЦентр.Автосервис_КтоМастерВЗН) Тогда
		
		Если ДилерскийЦентр.Автосервис_КтоМастерВЗН = Перечисления.Renault_МастерВЗН.МастерПриемщик Тогда
			
			Если ЗначениеЗаполнено(ЗаявкаНаСервис.Обращение) Тогда
				
				Приемка = Документы.Renault_CRM_ПриемкаАвтомобиля.НайтиПоРеквизиту("Обращение", ЗаявкаНаСервис.Обращение);
				
				Если ЗначениеЗаполнено(Приемка) И ЗначениеЗаполнено(Приемка.Машиноместо) Тогда
					Мастер = Приемка.Машиноместо;
				Иначе
					Мастер = ПараметрыСеанса.Пользователь.Сотрудник;
				КонецЕсли;
				
			Иначе
				
				Мастер = ПараметрыСеанса.Пользователь.Сотрудник;
				
			КонецЕсли;
			
		Иначе
			
			Мастер = ЗаявкаНаСервис.ДилерскийЦентр.Автосервис_МастерЦеха;
			
		КонецЕсли;
		
	Иначе
		
		Мастер = ПараметрыСеанса.Пользователь.Сотрудник;
		
	КонецЕсли;
	
	Попытка
		
		Если НЕ ЗначениеЗаполнено(ЗаказНаряд.Мастер) Тогда
			
			ЗаказНаряд.Мастер = Мастер;
			
		КонецЕсли;
		
	Исключение
		
	Конецпопытки;
	
	Попытка
		
		Если НЕ ЗначениеЗаполнено(ЗаказНаряд.Диспетчер) Тогда
			
			ЗаказНаряд.Диспетчер = ПараметрыСеанса.Пользователь.Сотрудник;
			
		КонецЕсли;
		
	Исключение
		
	Конецпопытки;
	
	ПричинаОбащения = ЗаявкаНаСервис.Обращение.Примечание;
	
	//Если ПараметрыСеанса.Renault_ПраваПользователя.ВерсияАльфаАвто = "4" Тогда
	//	
	//	МассивПричин = обРазложитьСтрокуВМассивПодстрок(ПричинаОбащения, Символы.ПС);
	//	
	//	Для Каждого Прич из МассивПричин Цикл
	//		
	//		Попытка
	//			
	//			НоваяСтрока = ЗаказНаряд.ПричиныОбращения.Добавить();
	//			НоваяСтрока.СоСловКлиента = Прич;
	//			
	//		Исключение
	//			
	//			ЗаказНаряд.ПричинаОбращения = ПричинаОбащения;
	//			
	//		КонецПопытки;
	//		
	//	КонецЦикла;
	//	
	//Иначе
		
	ЗаказНаряд.ПричинаОбращения = ПричинаОбащения;
		
	//КонецЕсли;
	
	ЗаказНаряд.Автор = ПараметрыСеанса.Пользователь;
	
	//Если ПараметрыСеанса.Renault_ПраваПользователя.ВерсияАльфаАвто = "5" Тогда
	ЗаказНаряд.Пробег = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ЗаявкаНаСервис.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
	//КонецЕсли;
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_CRM_ЗаявкаНаМойку.Ссылка,
	|	Renault_CRM_ЗаявкаНаМойку.ВерсияДанных,
	|	Renault_CRM_ЗаявкаНаМойку.ПометкаУдаления,
	|	Renault_CRM_ЗаявкаНаМойку.Номер,
	|	Renault_CRM_ЗаявкаНаМойку.Дата,
	|	Renault_CRM_ЗаявкаНаМойку.Проведен,
	|	Renault_CRM_ЗаявкаНаМойку.ДилерскийЦентр,
	|	Renault_CRM_ЗаявкаНаМойку.Автор,
	|	Renault_CRM_ЗаявкаНаМойку.Клиент,
	|	Renault_CRM_ЗаявкаНаМойку.ВремяНачала,
	|	Renault_CRM_ЗаявкаНаМойку.ВремяОкончания,
	|	Renault_CRM_ЗаявкаНаМойку.Машиноместо,
	|	Renault_CRM_ЗаявкаНаМойку.ГосНомер,
	|	Renault_CRM_ЗаявкаНаМойку.Автомобиль,
	|	Renault_CRM_ЗаявкаНаМойку.Упущена,
	|	Renault_CRM_ЗаявкаНаМойку.Обращение,
	|	Renault_CRM_ЗаявкаНаМойку.Длительность,
	|	Renault_CRM_ЗаявкаНаМойку.Состояние,
	|	Renault_CRM_ЗаявкаНаМойку.Примечание,
	|	Renault_CRM_ЗаявкаНаМойку.СостояниеИзменено,
	|	Renault_CRM_ЗаявкаНаМойку.ХозОперация,
	|	Renault_CRM_ЗаявкаНаМойку.РаботаМойка,
	|	Renault_CRM_ЗаявкаНаМойку.Платная,
	|	Renault_CRM_ЗаявкаНаМойку.Стоимость,
	|	Renault_CRM_ЗаявкаНаМойку.РаботаМойка.Авторабота
	|ИЗ
	|	Документ.Renault_CRM_ЗаявкаНаМойку КАК Renault_CRM_ЗаявкаНаМойку
	|ГДЕ
	|	Renault_CRM_ЗаявкаНаМойку.Обращение = &Обращение
	|	И Renault_CRM_ЗаявкаНаМойку.Платная = &Платная";
	
	Запрос.УстановитьПараметр("Обращение", ЗаявкаНаСервис.Обращение);
	Запрос.УстановитьПараметр("Платная", ИСТИНА);
	
	ПлатныеМойки = Запрос.Выполнить().Выбрать();
	
	Пока ПлатныеМойки.Следующий() Цикл
		
		Если ТипЗнч(ПлатныеМойки.РаботаМойка) = Тип("СправочникСсылка.Автоработы") Тогда
			
			Авторабота = ПлатныеМойки.РаботаМойка;
			
		Иначе
			
			Авторабота = ПлатныеМойки.РаботаМойка.Авторабота;
			
		КонецЕсли;
		
		Если ЗаказНаряд.Работы.Найти(Авторабота, "Работа") <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ЗаказНаряд.Работы.Добавить();
		
		НоваяСтрока.Работа = Авторабота;
		ИзРегистра = РегистрыСведений.ЦеныАвторабот.СрезПоследних().Найти(Авторабота, "Авторабота");
		
		Если ЗначениеЗаполнено(ПлатныеМойки.Ссылка.Нормочас) Тогда
			
			НоваяСтрока.Нормочас = ПлатныеМойки.Ссылка.Нормочас;
			
		Иначе
			
			Попытка
				
				НоваяСтрока.Нормочас = ИзРегистра.Нормочас;
				
			Исключение
				
				НоваяСтрока.Нормочас = Справочники.Нормочасы.Рубль;
				
			КонецПопытки;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НоваяСтрока.Нормочас) Тогда
			
			НоваяСтрока.Нормочас = ДилерскийЦентр.Автосервис_Нормочас;
			
		КонецЕсли;
		
		Длительность = ПлатныеМойки.Длительность;
		
		Если НЕ ЗначениеЗаполнено(Длительность) Тогда
			
			Если ТипЗнч(ПлатныеМойки.РаботаМойка) = Тип("СправочникСсылка.Автоработы") Тогда
				
				Длительность = ПлатныеМойки.РаботаМойка.Ссылка.ВремяВыполнения; 
				
			Иначе
				
				Длительность = ПлатныеМойки.РаботаМойка.Длительность;
				
			КонецЕсли;
			
		КонецЕсли;
		
		НоваяСтрока.СуммаВсего = ПлатныеМойки.Стоимость;
		НоваяСтрока.Цена = ПлатныеМойки.Ссылка.Цена;
		НоваяСтрока.Сумма = ПлатныеМойки.Стоимость;
		
		НоваяСтрока.Количество = 1;
		НоваяСтрока.СтавкаНДС = СтавкаНДСРаботы;
		НоваяСтрока.Коэффициент = Длительность;
		НоваяСтрока.ИдентификаторРаботы = Новый УникальныйИдентификатор;
		
		Если ЗаявкаНаСервис.ДилерскийЦентр.Автосервис_ИсполнителиМойкиВЗН = ИСТИНА Тогда
			
			Если ЗначениеЗаполнено(ПлатныеМойки.Машиноместо) и ЗначениеЗаполнено(ПлатныеМойки.Машиноместо.Исполнитель) Тогда
				
				СтрокаИсполнители = ЗаказНаряд.Исполнители.Добавить();
				СтрокаИсполнители.ИдентификаторРаботы = НоваяСтрока.ИдентификаторРаботы;
				СтрокаИсполнители.Цех = ПлатныеМойки.Машиноместо;
				СтрокаИсполнители.Исполнитель = ПлатныеМойки.Машиноместо.Исполнитель;
				СтрокаИсполнители.Процент = 100;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СуммаСкидкиПоБалламРаботы = 0;
	СуммаСкидкиПоБалламЗЧ = 0;
	
	Для Каждого Строка ИЗ ЗаявкаНаСервис.Работы Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("Работа", Строка.Работа);
		Отбор.Вставить("Коэффициент", Строка.ДлительностьЗН);
		МассивСтрок = ЗаказНаряд.Работы.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Работа", Строка.Работа);
		Отбор.Вставить("Коэффициент", Строка.ДлительностьЗН);
		МассивСтрок = ТаблицаРаботЗН.НайтиСтроки(Отбор);
		
		КоличествоОдинаковыхСтрок = МассивСтрок.Количество();
		
		Если КоличествоОдинаковыхСтрок > 0 Тогда
			
			Для Каждого СтрокаИЗМассива ИЗ МассивСтрок Цикл
				
				НоваяСтрока = ЗаказНаряд.Работы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИЗМассива, , "ПроцентСкидки, СуммаСкидки");
				НоваяСтрока.ПроцентСкидкиСтроки = Строка.ПроцентСкидки;
				НоваяСтрока.СуммаВсего = Строка.Сумма * КоличествоОдинаковыхСтрок;
				НоваяСтрока.СуммаСкидкиСтроки = Строка.СуммаСкидки * КоличествоОдинаковыхСтрок;
				НоваяСтрока.Сумма = НоваяСтрока.СуммаВсего + НоваяСтрока.СуммаСкидкиСтроки;
				
				Если ДилерскийЦентр.ИспользуетПрограммуЛояльностиRenault Тогда
					
					НоваяСтрока.СкидкаНаТовар = Скидка;
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(НоваяСтрока.Нормочас) Тогда
					
					НоваяСтрока.Нормочас = ЗаявкаНаСервис.Нормочас;
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			Отбор = Новый Структура;
			Отбор.Вставить("Работа", Строка.Работа);
			МассивСтрок = ЗаявкаНаСервис.Работы.НайтиСтроки(Отбор);
			
			КоличествоОдинаковыхСтрок = МассивСтрок.Количество();
			
			Если ЗаказНаряд.Работы.Найти(Строка.Работа, "Работа") <> Неопределено Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			НоваяСтрока = ЗаказНаряд.Работы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, , "ПроцентСкидки, СуммаСкидки");
			
			Длительность = Строка.ДлительностьЗН;
			
			Если НЕ ЗначениеЗаполнено(Длительность) Тогда
				
				Длительность = Строка.Работа.Ссылка.ВремяВыполнения; 
				
			КонецЕсли;
			
			НоваяСтрока.Количество = КоличествоОдинаковыхСтрок;
			НоваяСтрока.СтавкаНДС = СтавкаНДСРаботы;
			НоваяСтрока.Коэффициент = Длительность * ?(Строка.Коэффициент = 0, 1, Строка.Коэффициент);;
			
			Если ЗаявкаНаСервис.Работы.Итог("Сумма") > 0 Тогда 
				
				НоваяСтрока.ПроцентСкидкиСтроки = Строка.ПроцентСкидки;
				НоваяСтрока.СуммаСкидкиСтроки = Строка.СуммаСкидки * КоличествоОдинаковыхСтрок;
				
				Если ДилерскийЦентр.ИспользуетПрограммуЛояльностиRenault Тогда
					
					НоваяСтрока.СкидкаНаТовар = Скидка;
					
				КонецЕсли;
				
				НоваяСтрока.СуммаСкидкиСтроки = НоваяСтрока.СуммаСкидкиСтроки;
				
			КонецЕсли;
			
			Если ДилерскийЦентр.ИспользуетПрограммуЛояльностиRenault Тогда
				
				НоваяСтрока.СуммаВсего = Строка.Сумма * КоличествоОдинаковыхСтрок;
				НоваяСтрока.Сумма = (Строка.Сумма + Строка.СуммаСкидки) * КоличествоОдинаковыхСтрок;
				
			Иначе
				
				НоваяСтрока.СуммаВсего = Строка.Сумма * КоличествоОдинаковыхСтрок;
				
				
			КонецЕсли;
			
			//НоваяСтрока.СуммаВсего = (НоваяСтрока.СуммаВсего - НоваяСтрока.СуммаСкидкиСтроки);
			НоваяСтрока.ИдентификаторРаботы = Новый УникальныйИдентификатор;
			НоваяСтрока.Нормочас = Строка.Нормочас;
			НоваяСтрока.ПримечаниеРаботыПечать = ?(Строка.Коэффициент = 0 ИЛИ Строка.Коэффициент = 1, "", "Коэффициент: " + Строка.Коэффициент);
			НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаВсего * СтавкаНДСРаботы.Ставка / (100 + СтавкаНДСРаботы.Ставка);
			
			Если ЗначениеЗаполнено(Строка.Цена) Тогда
				
				НоваяСтрока.Цена = Строка.Цена;
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(НоваяСтрока.Нормочас) Тогда
				
				НоваяСтрока.Нормочас = ЗаявкаНаСервис.Нормочас;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Этапы = ЗаявкаНаСервис.СоставЭтапа.НайтиСтроки(Новый Структура("IDРаботы", Строка.IDРаботы));
		
		Для Каждого Этап из Этапы Цикл
			
			Эт = ЗаявкаНаСервис.Этапы.Найти(Этап.IDЭтапа, "IDЭтапа");
			
			Цех = Эт.Цех;
			
			Исполнители = Renault_ПолучитьИсполнителейЗаПериод(Эт.НачалоЭтапа, Эт.КонецЭтапа, Неопределено, Цех);
			
			Если ЗначениеЗаполнено(Исполнители) Тогда
				
				Исполнители.Свернуть("Сотрудник");
				
				Для Каждого Исполнитель ИЗ Исполнители Цикл
					
					СтрокаИсполнители = ЗаказНаряд.Исполнители.Добавить();
					СтрокаИсполнители.ИдентификаторРаботы = НоваяСтрока.ИдентификаторРаботы;
					СтрокаИсполнители.Цех = Цех;
					СтрокаИсполнители.Исполнитель = Исполнитель.Сотрудник;
					СтрокаИсполнители.Процент = 100 / Исполнители.Количество();
					
				КонецЦикла;
				
			Иначе
				
				ЦехДЦ = ЗаявкаНаСервис.ДилерскийЦентр.АвтосервисЦеха.Найти(Цех, "Цех");
				
				Если ЗначениеЗаполнено(ЦехДЦ) И ЗначениеЗаполнено(ЦехДЦ.ИсполнительПоУмолчанию) Тогда
					
					СтрокаИсполнители = ЗаказНаряд.Исполнители.Добавить();
					СтрокаИсполнители.ИдентификаторРаботы = НоваяСтрока.ИдентификаторРаботы;
					СтрокаИсполнители.Цех = Цех;
					СтрокаИсполнители.Исполнитель = ЦехДЦ.ИсполнительПоУмолчанию;
					СтрокаИсполнители.Процент = 100 / Этапы.Количество();
					
				ИначеЕсли ЗначениеЗаполнено(ЦехДЦ) И НЕ ЗначениеЗаполнено(ЦехДЦ.ИсполнительПоУмолчанию) Тогда
					
					СтрокаИсполнители = ЗаказНаряд.Исполнители.Добавить();
					СтрокаИсполнители.ИдентификаторРаботы = НоваяСтрока.ИдентификаторРаботы;
					СтрокаИсполнители.Цех = Цех;
					СтрокаИсполнители.Исполнитель = Справочники.Сотрудники.ПустаяСсылка();
					СтрокаИсполнители.Процент = 100 / Этапы.Количество();
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ЗаявкаНаСервис.Товары) Тогда
		
		Склад = ЗаявкаНаСервис.ДилерскийЦентр.Автосервис_СкладПоУмолчанию;
		
		Если ЗначениеЗаполнено(Склад) Тогда
			
		Иначе
			
			Склад = Справочники.СкладыКомпании.ОсновнойСкладКомпании;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого Строка ИЗ ЗаявкаНаСервис.Товары Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", Строка.Номенклатура);
		Отбор.Вставить("Количество", Строка.Количество);
		МассивСтрок = ЗаказНаряд.Товары.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", Строка.Номенклатура);
		Отбор.Вставить("Количество", Строка.Количество);
		МассивСтрок = ТаблицаТоваровЗН.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() > 0 Тогда
			
			Для Каждого СтрокаИЗМассива ИЗ МассивСтрок Цикл
				
				НоваяСтрока = ЗаказНаряд.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИЗМассива, , "ПроцентСкидки, СуммаСкидки");
				НоваяСтрока.ПроцентСкидкиСтроки = Строка.ПроцентСкидки;
				НоваяСтрока.СуммаСкидкиСтроки = Строка.СуммаСкидки;
				НоваяСтрока.СуммаВсего = Строка.Сумма;
				НоваяСтрока.Сумма = НоваяСтрока.СуммаВсего + НоваяСтрока.СуммаСкидкиСтроки;
				
				Если ДилерскийЦентр.ИспользуетПрограммуЛояльностиRenault Тогда
					
					НоваяСтрока.СкидкаНаТовар = Скидка;
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			Если Строка.ВналичииУКлиента <> Истина Тогда
				
				НоваяСтрока = ЗаказНаряд.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, ,"ПроцентСкидки, СуммаСкидки");
				НоваяСтрока.СкладКомпании = Склад;
				НоваяСтрока.ЕдиницаИзмерения = Строка.Номенклатура.ОсновнаяЕдиницаИзмерения;
				
				Если ЗначениеЗаполнено(СтавкаНДСТовары) Тогда
					
					НДСТовара = СтавкаНДСТовары;
					
				Иначе
					
					НДСТовара = Строка.Номенклатура.СтавкаНДС;
					
				КонецЕсли;
				
				НоваяСтрока.СтавкаНДС = НДСТовара;
				НоваяСтрока.Количество = Строка.Количество;
				
				Если ДилерскийЦентр.ИспользуетПрограммуЛояльностиRenault Тогда
					
					//вставить проверку на программу лояльности
					
				КонецЕсли;
				
				НоваяСтрока.ПроцентСкидкиСтроки = Строка.ПроцентСкидки;
				НоваяСтрока.СуммаСкидкиСтроки = Строка.СуммаСкидки;
				НоваяСтрока.СуммаВсего = Строка.Сумма;
				НоваяСтрока.Коэффициент = 1;
				
				Если ДилерскийЦентр.ИспользуетПрограммуЛояльностиRenault Тогда
					
					НоваяСтрока.СкидкаНаТовар = Скидка;
					
				КонецЕсли;
				
				Если ЗаявкаНаСервис.Товары.Итог("Сумма") > 0 Тогда
					
					НоваяСтрока.СуммаСкидкиСтроки = НоваяСтрока.СуммаСкидкиСтроки;
					
				КонецЕсли;
				
				НоваяСтрока.Сумма = НоваяСтрока.СуммаВсего + НоваяСтрока.СуммаСкидкиСтроки;
				НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаВсего * НДСТовара.Ставка / (100 + НДСТовара.Ставка);
				
				//Если ПараметрыСеанса.Renault_ПраваПользователя.ВерсияАльфаАвто = "4" Тогда
				//	
				//	НоваяСтрока.Источник = Перечисления.ЗаказНарядНоменклатураИсточник.ДетальСоСклада;
				//	
				//КонецЕсли;
				
			Иначе
				
				//Если ПараметрыСеанса.Renault_ПраваПользователя.ВерсияАльфаАвто = "4" Тогда
				//	
				//	НоваяСтрока = ЗаказНаряд.Товары.Добавить();
				//	НоваяСтрока.СкладКомпании = Склад;
				//	НоваяСтрока.ЕдиницаИзмерения = Строка.Номенклатура.ОсновнаяЕдиницаИзмерения;
				//	НДСТовара = Строка.Номенклатура.СтавкаНДС;
				//	НоваяСтрока.СтавкаНДС = НДСТовара;
				//	НоваяСтрока.Количество = Строка.Количество;
				//	
				//	Если ДилерскийЦентр.ИспользуетПрограммуЛояльностиRenault Тогда
				//		
				//		НоваяСтрока.СкидкаНаТовар = Строка.Скидка;
				//		
				//	КонецЕсли;
				//	
				//	НоваяСтрока.СуммаВсего = Строка.Сумма;
				//	НоваяСтрока.Коэффициент = 1;
				//	НоваяСтрока.СуммаСкидкиСтроки = НоваяСтрока.СуммаСкидкиСтроки;
				//	НоваяСтрока.СуммаВсего = НоваяСтрока.СуммаВсего - НоваяСтрока.СуммаСкидкиСтроки;
				//	НоваяСтрока.Источник = Перечисления.ЗаказНарядНоменклатураИсточник.ДетальЗаказчика;
				//	НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаВсего * НДСТовара.Ставка / (100 + НДСТовара.Ставка);
				//	
				//Иначе
				
				НоваяСтрока = ЗаказНаряд.МатериалыЗаказчика.Добавить();
				НоваяСтрока.Коэффициент = 1;
				Новаястрока.ЕдиницаИзмерения = Строка.Номенклатура.ОсновнаяЕдиницаИзмерения;
				НоваяСтрока.Количество = Строка.Количество;
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				
				//КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДилерскийЦентр) И ДилерскийЦентр.ИспользуетПрограммуЛояльностиRenault Тогда
		
		ДокументСписание = Документы.Renault_СписаниеНачислениеБаллов.НайтиПоРеквизиту("ЗаявкаНаСервис", ЗаявкаНаСервис);
		
		//Если ЗначениеЗаполнено(ЗаказНаряд.Комментарий) И Найти(ЗаказНаряд.Комментарий, "Оплачено баллами: ") > 0 Тогда
		//	
		//	Начало = Найти(ЗаказНаряд.Комментарий, "[");
		//	Конец = Найти(ЗаказНаряд.Комментарий, "]");
		//	
		//	ЗаказНаряд.Комментарий = Лев(ЗаказНаряд.Комментарий,Начало) + Строка(ЗаявкаНаСервис.ЗапчастиОплатаБаллами + ЗаявкаНаСервис.РаботыОплатаБаллами) + Прав(ЗаказНаряд.Комментарий, СтрДлина(ЗаказНаряд.Комментарий) - Конец + 1);
		//	
		//Иначе
		//	
		//	ЗаказНаряд.Комментарий = Строка(ЗаказНаряд.Комментарий) + "      " + "Оплачено баллами: " + "[" + Строка(ЗаявкаНаСервис.ЗапчастиОплатаБаллами + ЗаявкаНаСервис.РаботыОплатаБаллами) + "]";
		//	
		//КонецЕсли;
		
		СуммаСкидкиПоБалламРаботы = ЗаявкаНаСервис.РаботыОплатаБаллами;
		СуммаСкидкиПоБалламЗЧ = ЗаявкаНаСервис.ЗапчастиОплатаБаллами;
		
	КонецЕсли;
	
	//Обработаем бальные скидки	
	КолвоСтрокРабот = ЗаказНаряд.Работы.Количество();
	
	БалловНастрокуРаботы = 0;
	
	Если КолвоСтрокРабот > 0 Тогда
		
		БалловНастрокуРаботы = СуммаСкидкиПоБалламРаботы / КолвоСтрокРабот;
		
	КонецЕсли;
	
	Если БалловНастрокуРаботы > 0 Тогда
		
		Для Каждого Строка из ЗаказНаряд.Работы Цикл
			
			Строка.СуммаСкидкиСтроки = Строка.СуммаСкидкиСтроки*Строка.ПроцентСкидкиСтроки/100 + БалловНастрокуРаботы;
			Строка.СуммаВсего = Строка.Сумма - Строка.СуммаСкидкиСтроки;
			
		КонецЦикла;
		
	КонецЕсли;
	
	КолвоСтрокЗЧ = ЗаказНаряд.Товары.Количество();
	
	БалловНастрокуЗЧ = 0;
	
	Если КолвоСтрокЗЧ > 0 Тогда
		
		БалловНастрокуЗЧ = СуммаСкидкиПоБалламЗЧ / КолвоСтрокЗЧ;
		
	КонецЕсли;
	
	Если БалловНастрокуЗЧ > 0 Тогда
		
		Для Каждого Строка из ЗаказНаряд.Товары Цикл
			
			Строка.СуммаСкидкиСтроки = Строка.СуммаВсего*Строка.ПроцентСкидкиСтроки/100 + БалловНастрокуЗЧ;
			Строка.СуммаВсего = Строка.Сумма - Строка.СуммаСкидкиСтроки;
			
		КонецЦикла;
		
	КонецЕсли;
	
	//Заполним все остальное
	Попытка
		
	Исключение
		
	КонецПопытки;
	
	ЗаказНаряд.СуммаСкидкиНаценкиРабот = ЗаявкаНаСервис.СуммаСкидкиРаботыВсего;
	ЗаказНаряд.СуммаСкидкиНаценки = ЗаявкаНаСервис.СуммаСкидкиРаботыВсего + ЗаявкаНаСервис.СуммаСкидкиЗапчастиВсего
		+ СуммаСкидкиПоБалламРаботы + СуммаСкидкиПоБалламЗЧ;
		
	ЗаказНаряд.СуммаДокумента = ЗаказНаряд.СуммаДокумента - ЗаказНаряд.СуммаСкидкиНаценки;
	
	Если ПоказыватьДокумент Тогда
		
		Попытка
			
			ЗаказНаряд.Записать(РежимЗаписиДокумента.Запись);
			
			Если ЗначениеЗаполнено(ДокументСписание) Тогда
				
				ДокументОб = ДокументСписание.Ссылка.ПолучитьОбъект();
				ДокументОб.ЗаказНаряд = ЗаказНаряд.Ссылка;
				ДокументОб.Записать(РежимЗаписиДокумента.Запись);
				
				
			КонецЕсли;
			
			ЗаказНаряд.ПолучитьФорму().ОткрытьМодально();
			
			Возврат ЗаказНаряд.Ссылка;
			
		Исключение
			
			Если ЗначениеЗаполнено(ДокументСписание) Тогда
				
				ДокументОб = ДокументСписание.Ссылка.ПолучитьОбъект();
				ДокументОб.ЗаказНаряд = ЗаказНаряд.Ссылка;
				ДокументОб.Записать(РежимЗаписиДокумента.Запись);
				
			КонецЕсли;
			
			ЗаказНаряд.ПолучитьФорму().ОткрытьМодально();
			
			Если НЕ ЗаказНаряд.ЭтоНовый() тогда
				
				Возврат ЗаказНаряд.Ссылка;
				
			Иначе
				
				Возврат Неопределено;
				
			КонецЕсли;
			
		КонецПопытки;
		
	Иначе
		
		Попытка
			
			ЗаказНаряд.Записать(РежимЗаписиДокумента.Запись);
			
			Возврат ЗаказНаряд.Ссылка;
			
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
КонецФункции

Функция ЗаполнитьДанныеСтрокиРабота(СтрокаЗаказНаряда, СтрокаЗаявки)
	
	//
	
КонецФункции

функция Reanult_ОбновитьСформироватьСчетНаТовары(ЗаявкаНаСервис, СчетНаОплату) Экспорт
	
	Если ЗначениеЗаполнено(СчетНаОплату) Тогда
		
		СчетОбъект = СчетНаОплату.Ссылка.ПолучитьОбъект();
		СчетОбъект.Товары.Очистить();
		
		НовыйСчет = СчетОбъект;
		
	Иначе
		
		НовыйСчет = Документы.СчетНаОплату.СоздатьДокумент();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаявкаНаСервис.ЗаказНаряд) Тогда
		дкОбработкаЗаполнения(НовыйСчет, ЗаявкаНаСервис.ЗаказНаряд);
		Основание = ЗаявкаНаСервис.ЗаказНаряд;
	Иначе
		дкОбработкаЗаполнения(НовыйСчет, ЗаявкаНаСервис);
		Основание = ЗаявкаНаСервис;
		НовыйСчет.Контрагент = ЗаявкаНаСервис.Клиент;
		Если ЗначениеЗаполнено(НовыйСчет.Организация) Тогда
			НовыйСчет.РасчетныйСчетОрганизации = НовыйСчет.Организация.ОсновнойБанковскийСчет;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НовыйСчет.Контрагент) Тогда
		Если НЕ ЗначениеЗаполнено(CRM_Сервер.DMS_ПолучитьОсновнойДоговорКонтрагента(НовыйСчет.Контрагент)) Тогда
			КонтрагентОбъект = НовыйСчет.Контрагент.ПолучитьОбъект();
			КонтрагентОбъект.СоздатьОсновнойДоговор();
			КонтрагентОбъект.Записать();
		КонецЕсли;
		НовыйСчет.ДоговорВзаиморасчетов = CRM_Сервер.DMS_ПолучитьОсновнойДоговорКонтрагента(НовыйСчет.Контрагент);
	КонецЕсли;
	
	НовыйСчет.Товары.Очистить();
	Для Каждого СтрокаТовары ИЗ Основание.Товары Цикл
		НоваяСтрока = НовыйСчет.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары);
		НоваяСтрока.ЕдиницаИзмерения = СтрокаТовары.Номенклатура.ОсновнаяЕдиницаИзмерения;
		НоваяСтрока.Коэффициент = 1;
		НоваяСтрока.СуммаВсего = СтрокаТовары.Цена * СтрокаТовары.Количество;
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ЗаявкаНаСервис.ТипЦен) Тогда
		
		НовыйСчет.ТипЦен = ЗаявкаНаСервис.ДилерскийЦентр.Автосервис_ТипЦенПродажи;
		
	КонецЕсли;
	
	Попытка
		
		//НовыйСчет.Записать(РежимЗаписиДокумента.Запись);
		НовыйСчет.ПолучитьФорму().ОткрытьМодально();
		
		Возврат НовыйСчет.Ссылка;
		
	Исключение
		
		НовыйСчет.ПолучитьФорму().ОткрытьМодально();
		
		Если НЕ НовыйСчет.ЭтоНовый() тогда
			
			Возврат НовыйСчет.Ссылка;
			
		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецПопытки;
	
	//Если СтрокаСчета <> Неопределено Тогда
	//	СтрокаСчета.СчетНаОплату = НовыйСчет.Ссылка;
	//Иначе
	//	СтрокаСчета = СчетаНаОплату.Добавить();
	//	СтрокаСчета.СчетНаОплату = НовыйСчет.Ссылка;
	//	СтрокаСчета.ЭтоСчетНаТовары = Истина;
	//КонецЕсли;
	//ЗаявкаНаСервис.Записать();
	
КонецФункции

Функция Reanult_ОбновитьСформироватьСчетНаРаботы(ЗаявкаНаСервис, СчетНаОплату) Экспорт
	
	Если ЗначениеЗаполнено(СчетНаОплату) Тогда
		
		СчетОбъект = СчетНаОплату.Ссылка.ПолучитьОбъект();
		СчетОбъект.Товары.Очистить();
		
		НовыйСчет = СчетОбъект;
		
	Иначе
		
		НовыйСчет = Документы.СчетНаОплату.СоздатьДокумент();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаявкаНаСервис.ЗаказНаряд) Тогда
		дкОбработкаЗаполнения(НовыйСчет, ЗаявкаНаСервис.ЗаказНаряд);
		Основание = ЗаявкаНаСервис.ЗаказНаряд;
	Иначе
		дкОбработкаЗаполнения(НовыйСчет, ЗаявкаНаСервис);
		Основание = ЗаявкаНаСервис;
		НовыйСчет.Контрагент = ЗаявкаНаСервис.Клиент;
		Если ЗначениеЗаполнено(НовыйСчет.Организация) Тогда
			НовыйСчет.РасчетныйСчетОрганизации = НовыйСчет.Организация.ОсновнойБанковскийСчет;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НовыйСчет.Контрагент) Тогда
		Если НЕ ЗначениеЗаполнено(CRM_Сервер.DMS_ПолучитьОсновнойДоговорКонтрагента(НовыйСчет.Контрагент)) Тогда
			КонтрагентОбъект = НовыйСчет.Контрагент.ПолучитьОбъект();
			КонтрагентОбъект.СоздатьОсновнойДоговор();
			КонтрагентОбъект.Записать();
		КонецЕсли;
		НовыйСчет.ДоговорВзаиморасчетов = CRM_Сервер.DMS_ПолучитьОсновнойДоговорКонтрагента(НовыйСчет.Контрагент);
	КонецЕсли;
	
	НовыйСчет.Товары.Очистить();
	Для Каждого СтрокаРабот ИЗ Основание.Работы Цикл
		НоваяСтрока = НовыйСчет.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРабот);
		НоваяСтрока.Номенклатура = СтрокаРабот.Работа;
		НоваяСтрока.ЕдиницаИзмерения = СтрокаРабот.Нормочас;
		НоваяСтрока.Цена = СтрокаРабот.Цена;
		Если ЗначениеЗаполнено(ЗаявкаНаСервис.ЗаказНаряд) Тогда
			НоваяСтрока.Коэффициент = СтрокаРабот.Коэффициент;
			НоваяСтрока.Количество = СтрокаРабот.Количество;
		Иначе
			НоваяСтрока.Коэффициент = 1;
			НоваяСтрока.Количество = СтрокаРабот.Длительность;
		КонецЕсли;
		НоваяСтрока.СуммаВсего = СтрокаРабот.Цена * НоваяСтрока.Количество;
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ЗаявкаНаСервис.ТипЦен) Тогда
		
		НовыйСчет.ТипЦен = ЗаявкаНаСервис.ДилерскийЦентр.Автосервис_ТипЦенПродажи;
		
	КонецЕсли;
	
	Попытка
		
		//НовыйСчет.Записать(РежимЗаписиДокумента.Запись);
		НовыйСчет.ПолучитьФорму().ОткрытьМодально();
		
		Возврат НовыйСчет.Ссылка;
		
	Исключение
		
		НовыйСчет.ПолучитьФорму().ОткрытьМодально();
		
		Если НЕ НовыйСчет.ЭтоНовый() тогда
			
			Возврат НовыйСчет.Ссылка;
			
		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецПопытки;
	
КонецФункции

Функция Reanult_ОбновитьСформироватьСчетОбщий(ЗаявкаНаСервис, СчетНаОплату, ПоказыватьДокумент = Истина) Экспорт
	
	Если ЗначениеЗаполнено(СчетНаОплату) Тогда
		
		СчетОбъект = СчетНаОплату.Ссылка.ПолучитьОбъект();
		СчетОбъект.Товары.Очистить();
		
		НовыйСчет = СчетОбъект;
		
	Иначе
		
		НовыйСчет = Документы.СчетНаОплату.СоздатьДокумент();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаявкаНаСервис.ЗаказНаряд) Тогда
		
		дкОбработкаЗаполнения(НовыйСчет, ЗаявкаНаСервис.ЗаказНаряд);
	
	Иначе
		
		дкОбработкаЗаполнения(НовыйСчет, ЗаявкаНаСервис);
		НовыйСчет.Контрагент = ЗаявкаНаСервис.Клиент;
		Если ЗначениеЗаполнено(НовыйСчет.Организация) Тогда
			НовыйСчет.РасчетныйСчетОрганизации = НовыйСчет.Организация.ОсновнойБанковскийСчет;
		КонецЕсли;
		Для Каждого СтрокаТовары ИЗ НовыйСчет.Товары Цикл
			СтрокаТовары.ЕдиницаИзмерения = СтрокаТовары.Номенклатура.ОсновнаяЕдиницаИзмерения;
			СтрокаТовары.Коэффициент = 1;
			СтрокаТовары.СуммаВсего = СтрокаТовары.Цена * СтрокаТовары.Количество;
		КонецЦикла;
		
		Если НЕ ЗначениеЗаполнено(ЗаявкаНаСервис.ТипЦен) Тогда
			
			НовыйСчет.ТипЦен = ЗаявкаНаСервис.ДилерскийЦентр.Автосервис_ТипЦенПродажи;
			
		КонецЕсли;
		
		Для Каждого СтрокаРабот ИЗ ЗаявкаНаСервис.Работы Цикл
			НоваяСтрока = НовыйСчет.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРабот);
			НоваяСтрока.Номенклатура = СтрокаРабот.Работа;
			НоваяСтрока.Цена = СтрокаРабот.Цена;
			НоваяСтрока.Коэффициент = 1;
			НоваяСтрока.ЕдиницаИзмерения = СтрокаРабот.Нормочас;
			НоваяСтрока.Количество = СтрокаРабот.Длительность;
			НоваяСтрока.СуммаВсего = НоваяСтрока.Количество * НоваяСтрока.Цена;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НовыйСчет.Контрагент) Тогда
		Если НЕ ЗначениеЗаполнено(CRM_Сервер.DMS_ПолучитьОсновнойДоговорКонтрагента(НовыйСчет.Контрагент)) Тогда
			КонтрагентОбъект = НовыйСчет.Контрагент.ПолучитьОбъект();
			КонтрагентОбъект.СоздатьОсновнойДоговор();
			КонтрагентОбъект.Записать();
		КонецЕсли;
		НовыйСчет.ДоговорВзаиморасчетов = CRM_Сервер.DMS_ПолучитьОсновнойДоговорКонтрагента(НовыйСчет.Контрагент);
	КонецЕсли;
	
	Если ПоказыватьДокумент Тогда
		
		Попытка
			
			//НовыйСчет.Записать(РежимЗаписиДокумента.Запись);
			НовыйСчет.ПолучитьФорму().ОткрытьМодально();
			
			Возврат НовыйСчет.Ссылка;
			
		Исключение
			
			НовыйСчет.ПолучитьФорму().ОткрытьМодально();
			
			Если НЕ НовыйСчет.ЭтоНовый() тогда
				
				Возврат НовыйСчет.Ссылка;
				
			Иначе
				
				Возврат Неопределено;
				
			КонецЕсли;
			
		КонецПопытки;
		
	Иначе
		
		Попытка
			
			НовыйСчет.Записать(РежимЗаписиДокумента.Запись);
			Возврат НовыйСчет.Ссылка;
			
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
КонецФункции

Функция Renault_CRM_НачатьЗаписьНаСервис(Автомобиль, Сотрудник = Неопределено, ДилерскийЦентр = Неопределено, IDK = Неопределено) Экспорт
	
	ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
	
	Форма = ПолучитьОбщуюФорму("Renault_АвтосервисДобавлениеЗЧ");
	Форма.Автомобиль = Автомобиль;
	Форма.ВидРемонта = Справочники.ВидыРемонта.КомплектацияАвтомобиля;
	Форма.ЗаполнятьСвязаннымиРаботами = ИСТИНА;
	Форма.ДилерскийЦентр = ДилерскийЦентр;
	форма.Нормочас = ДилерскийЦентр.Автосервис_Нормочас;
	Форма.ТипЦен = ДилерскийЦентр.Автосервис_ТипЦенПродажи;
	Форма.Обращение = Документы.Renault_CRM_ОбращениеВАвтоСервис.ПустаяСсылка();
	форма.IDK = IDK;
	Форма.Заголовок = "Запрос автосервиса на комлектацию.";
	
	Результат = Форма.ОткрытьМодально();
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Возврат Результат.Обращение;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

Функция Renault_ЗаписатьНаДокомплектациюСервис(Автомобиль, Сотрудник, ДилерскийЦентр, НомерРабочегоЛиста = Неопределено, ТипУстановкиДопов) Экспорт
	
	Форма = Справочники.Renault_СписокДопов.ПолучитьФорму("ФормаВыбора_Новая");
	//форма.МножественныйВыбор = ИСТИНА;
	Форма.Автомобиль = Автомобиль;
	Ответ = Форма.ОткрытьМодально();
	
	Если НЕ ЗначениеЗаполнено(Ответ) Тогда
		
		Возврат Документы.Renault_CRM_ОбращениеВАвтоСервис.ПустаяСсылка();
		
	КонецЕсли;
	
	Документ = Документы.Renault_CRM_ОбращениеВАвтоСервис.СоздатьДокумент();
	Документ.Дата = ТекущаяДата();
	Документ.ВидОбращения = Справочники.Renault_ВидыОбращенийВАвтосервис.CRM_ДокомплектацияАвто;
	
	Если ЗначениеЗаполнено(НомерРабочегоЛиста) Тогда
		
		Документ.IDK = НомерРабочегоЛиста;
		
	КонецЕсли;
	
	Документ.ДилерскийЦентр = ДилерскийЦентр;
	Документ.Менеджер = Справочники.Пользователи.НайтиПоРеквизиту("Сотрудник", Сотрудник);
	Документ.Клиент = ДилерскийЦентр;
	Документ.Примечание = "Модель: " + Автомобиль.Модель.Наименование;
	Документ.ПервичныйПовторный = Перечисления.CRM_ПервичныйПовторный.Повторный;
	Документ.Автомобиль = Автомобиль;
	Документ.ОбращениеОбработано = Ложь;
	Документ.Внутренний = ИСТИНА;
	Документ.Жалоба = Ложь;
	Документ.Записать();
	
	СоздатьЗаявкуНаСервис(Ответ, Документ);
	
	Напоминание = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
	Напоминание.Отправитель = Сотрудник;
	Напоминание.Подробнее = Документ.Ссылка;
	
	ДатаОтправки = ТекущаяДата();
	
	Напоминание.ДатаОтправки = ДатаОтправки;
	Напоминание.Комментарий = Автомобиль;
	Напоминание.ВидСообщения = Справочники.Renault_ВидСообщения.Автосервис_КлиентНазначенНаМастера;    
	Напоминание.ПоказыватьС = ДатаОтправки;
	Напоминание.ПоказыватьПо = ДатаОтправки;
	Напоминание.Наименование = "Внутренний заезд.";
	Напоминание.Сообщение = "Регистрация внутреннего заезда: " + Автомобиль.Модель.Наименование;;
	Напоминание.Записать();
	
	Возврат Документ.Ссылка;
	
КонецФункции

Процедура Renault_CRM_ЗаписатьНаСервис(Автомобиль, Сотрудник, ДилерскийЦентр)
	
	Документ = Документы.Renault_CRM_ОбращениеВАвтоСервис.СоздатьДокумент();
	Документ.Дата = ТекущаяДата();
	Документ.ВидОбращения = Справочники.Renault_ВидыОбращенийВАвтосервис.CRM_ДокомплектацияАвто;
	Документ.ДилерскийЦентр = ДилерскийЦентр;
	Документ.Менеджер = Справочники.Пользователи.НайтиПоРеквизиту("Сотрудник", Сотрудник);
	Документ.Клиент = ДилерскийЦентр;
	Документ.Примечание = "Модель: " + Автомобиль.Модель.Наименование;
	Документ.ПервичныйПовторный = Перечисления.CRM_ПервичныйПовторный.Повторный;
	Документ.ОбращениеОбработано = Ложь;
	Документ.Внутренний = ИСТИНА;
	Документ.Жалоба = Ложь;
	Документ.Записать();
	
	Напоминание = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
	Напоминание.Отправитель = Сотрудник;
	Напоминание.Подробнее = Документ.Ссылка;
	
	ДатаОтправки = ТекущаяДата();
	
	Напоминание.ДатаОтправки = ДатаОтправки;
	Напоминание.Комментарий = Автомобиль;
	Напоминание.ВидСообщения = Справочники.Renault_ВидСообщения.Автосервис_КлиентНазначенНаМастера;
	Напоминание.ПоказыватьС = ДатаОтправки;
	Напоминание.ПоказыватьПо = ДатаОтправки;
	Напоминание.Наименование = "Внутренний заезд.";
	Напоминание.Сообщение = "Регистрация внутреннего заезда: " + Автомобиль.Модель.Наименование;;
	Напоминание.Записать();
	
	ДобавитьПриемкуИвыдачу(Документ.Ссылка, Автомобиль, Сотрудник, ДилерскийЦентр);
	
КонецПроцедуры

Процедура ДобавитьПриемкуИвыдачу(Обращение, Автомобиль, Сотрудник, ДилерскийЦентр) Экспорт
	
	ГосНомер = Renault_ПолучитьГосНомер(Автомобиль);
	
	// добавим приемку и выдачу
	НоваяПриемка = Документы.Renault_CRM_ПриемкаАвтомобиля.СоздатьДокумент();
	НоваяПриемка.ДилерскийЦентр = ДилерскийЦентр;
	НоваяПриемка.Дата = ТекущаяДата();
	НоваяПриемка.Обращение = Обращение;
	НоваяПриемка.Автомобиль = Автомобиль;
	НоваяПриемка.ГосНомер = ГосНомер;
	НоваяПриемка.Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Заявка;
	НоваяПриемка.Клиент = ДилерскийЦентр;
	НоваяПриемка.Записать();
	
	НоваяВыдача = Документы.Renault_CRM_ВыдачаАвтомобиля.СоздатьДокумент();
	НоваяВыдача.ДилерскийЦентр = ДилерскийЦентр;
	НоваяВыдача.Дата = ТекущаяДата();
	НоваяВыдача.Обращение = Обращение;
	НоваяВыдача.Автомобиль = Автомобиль;
	НоваяВыдача.Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Заявка;
	НоваяВыдача.Клиент = ДилерскийЦентр;
	НоваяВыдача.ГосНомер = ГосНомер;
	НоваяВыдача.Записать();
	
КонецПроцедуры

Процедура ЗаписатьИзмененияДокументаВСправочникИзмененияДокументов(Объект) ЭКСПОРТ
	
	//Если Объект.ЭтоНовый() Тогда
	//	
	//	ID = Новый УникальныйИдентификатор;
	//	
	//	Если Сред(Объект.Метаданные().ПолноеИмя(), 1, Найти(Объект.Метаданные().ПолноеИмя(), ".") - 1) = "Документ" Тогда
	//		
	//		Ссылка = Документы[Объект.Метаданные().Имя].ПолучитьСсылку(ID);
	//		
	//		Объект.УстановитьСсылкуНового(Ссылка);
	//		
	//	ИначеЕсли Сред(Объект.Метаданные().ПолноеИмя(), 1, Найти(Объект.Метаданные().ПолноеИмя(), ".") - 1) = "Справочник" Тогда
	//		
	//		Ссылка = Справочники[Объект.Метаданные().Имя].ПолучитьСсылку(ID);
	//		
	//		Объект.УстановитьСсылкуНового(Ссылка);
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	//Изменения = Истина;
	//
	//ДатаИзм = ТекущаяДата();
	//
	////Изменения реквизитов
	//ЗапросПроверкаРеквизитов = Новый Запрос;
	//
	//ЗапросПроверкаРеквизитов.Текст = "ВЫБРАТЬ
	//|	*
	//|ИЗ
	//|	" + Сред(Объект.Метаданные().ПолноеИмя(), 1, Найти(Объект.Метаданные().ПолноеИмя(), ".")) + Объект.Метаданные().Имя + " КАК ОбъектМетаданных
	//|ГДЕ
	//|	ОбъектМетаданных.Ссылка = &Ссылка";
	//
	//ЗапросПроверкаРеквизитов.УстановитьПараметр("Ссылка", Объект.Ссылка);
	//ВыборкаПроверкаРеквизитов = ЗапросПроверкаРеквизитов.Выполнить().Выбрать();
	//
	//Если ВыборкаПроверкаРеквизитов.Следующий() Тогда
	//	
	//	Для Каждого Рек Из Объект.Метаданные().Реквизиты Цикл
	//		
	//		Если Объект[Рек.Имя] <> ВыборкаПроверкаРеквизитов[Рек.Имя] Тогда
	//			
	//			Запись = РегистрыСведений.Renault_АвтосервисИзменияДокументов.СоздатьМенеджерЗаписи();
	//			
	//			Если Объект.ЭтоНовый() Тогда
	//				
	//				Запись.GUID_Объекта = ID;
	//				Запись.Документ = Строка(Объект);
	//				
	//			Иначе
	//				
	//				Запись.GUID_Объекта = Объект.Ссылка.УникальныйИдентификатор();
	//				Запись.Документ = Строка(Объект.Ссылка);
	//				
	//			КонецЕсли;
	//			
	//			//Запись.GUID_Объекта = Объект.Ссылка.УникальныйИдентификатор();
	//			Запись.Пользователь = ПараметрыСеанса.Пользователь.Ссылка;
	//			Запись.Период = ДатаИзм;
	//			Запись.Реквизит = Рек.Имя;
	//			Запись.СтароеЗначение = Строка(ВыборкаПроверкаРеквизитов[Рек.Имя]);
	//			Запись.НовоеЗначение = Строка(Объект[Рек.Имя]);
	//			Запись.Записать();
	//			
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//	
	//	Если ВыборкаПроверкаРеквизитов.ПометкаУдаления <> Объект.ПометкаУдаления Тогда
	//		
	//		Запись = РегистрыСведений.Renault_АвтосервисИзменияДокументов.СоздатьМенеджерЗаписи();
	//		Если Объект.ЭтоНовый() Тогда
	//			
	//			Запись.GUID_Объекта = ID;
	//			Запись.Документ = Строка(Объект);
	//			
	//		Иначе
	//			
	//			Запись.GUID_Объекта = Объект.Ссылка.УникальныйИдентификатор();
	//			Запись.Документ = Строка(Объект.Ссылка);
	//			
	//		КонецЕсли;
	//		
	//		//Запись.GUID_Объекта = Объект.Ссылка.УникальныйИдентификатор();
	//		Запись.Пользователь = ПараметрыСеанса.Пользователь.Ссылка;
	//		Запись.Период = ДатаИзм;
	//		
	//		//НовЭлемент.GUID_Объекта = Объект.Ссылка.УникальныйИдентификатор();
	//		//НовЭлемент.Пользователь = ПараметрыСеанса.Пользователь.Ссылка;
	//		//НовЭлемент.ДатаИзменения = ДатаИзм;
	//		
	//		Запись.Реквизит = Рек.Имя;
	//		Запись.СтароеЗначение = Строка(ВыборкаПроверкаРеквизитов[Рек.Имя]);
	//		Запись.НовоеЗначение = Строка(Объект[Рек.Имя]);
	//		Запись.Записать();
	//		
	//	КонецЕсли;
	//	
	//Иначе
	//	
	//	Для Каждого Рек Из Объект.Метаданные().Реквизиты Цикл
	//		
	//		Запись = РегистрыСведений.Renault_АвтосервисИзменияДокументов.СоздатьМенеджерЗаписи();
	//		
	//		Если Объект.ЭтоНовый() Тогда
	//			
	//			Запись.GUID_Объекта = ID;
	//			Запись.Документ = Строка(Объект);
	//			
	//		Иначе
	//			
	//			Запись.GUID_Объекта = Объект.Ссылка.УникальныйИдентификатор();
	//			Запись.Документ = Строка(Объект.Ссылка);
	//			
	//		КонецЕсли;
	//		
	//		//Запись.GUID_Объекта = Объект.Ссылка.УникальныйИдентификатор();
	//		Запись.Пользователь = ПараметрыСеанса.Пользователь.Ссылка;
	//		Запись.Период = ДатаИзм;
	//		Запись.Реквизит = Рек.Имя;
	//		Запись.СтароеЗначение = "";
	//		Запись.НовоеЗначение = Строка(Объект[Рек.Имя]);
	//		Запись.Записать();
	//		
	//	КонецЦикла;
	//	
	//КонецЕсли;
	//
	////Проверка на изменение табличных частей документа
	//
	//Для Каждого ТЧ из Объект.Метаданные().ТабличныеЧасти Цикл
	//	
	//	ЗапросПроверкаТЧ = Новый Запрос;
	//	ЗапросПроверкаТЧ.Текст = 
	//	"ВЫБРАТЬ
	//	|	*
	//	|ИЗ
	//	|	" + Сред(Объект.Метаданные().ПолноеИмя(), 1, Найти(Объект.Метаданные().ПолноеИмя(), ".")) + Объект.Метаданные().Имя + "." + ТЧ.Имя + " КАК ОбъектМетаданных
	//	|ГДЕ
	//	|	ОбъектМетаданных.Ссылка = &Ссылка
	//	|УПОРЯДОЧИТЬ ПО
	//	|	НомерСтроки";
	//	
	//	ЗапросПроверкаТЧ.УстановитьПараметр("Ссылка", Объект.Ссылка);
	//	ВыборкаПроверкаТЧ = ЗапросПроверкаТЧ.Выполнить().Выбрать();
	//	
	//	Для Каждого СтрТЧ Из Объект[ТЧ.Имя] Цикл
	//		
	//		Если ВыборкаПроверкаТЧ.Следующий() Тогда
	//			
	//			Для Каждого Рек Из Объект.Метаданные().ТабличныеЧасти[ТЧ.Имя].Реквизиты Цикл
	//				
	//				Если СтрТЧ[Рек.Имя] <> ВыборкаПроверкаТЧ[Рек.Имя] Тогда
	//					
	//					Запись = РегистрыСведений.Renault_АвтосервисИзменияДокументов.СоздатьМенеджерЗаписи();
	//					
	//					Если Объект.ЭтоНовый() Тогда
	//						
	//						Запись.GUID_Объекта = ID;
	//						Запись.Документ = Строка(Объект);
	//						
	//					Иначе
	//						
	//						Запись.GUID_Объекта = Объект.Ссылка.УникальныйИдентификатор();
	//						Запись.Документ = Строка(Объект.Ссылка);
	//						
	//					КонецЕсли;
	//					
	//					Запись.Пользователь = ПараметрыСеанса.Пользователь.Ссылка;
	//					Запись.Период = ДатаИзм;
	//					Запись.Реквизит = ТЧ.Имя + ":" + Строка(СтрТЧ.НомерСтроки) + " - " + Рек.Имя;
	//					Запись.СтароеЗначение = Строка(ВыборкаПроверкаТЧ[Рек.Имя]);
	//					Запись.НовоеЗначение = Строка(СтрТЧ[Рек.Имя]);
	//					Запись.Записать();
	//					
	//				КонецЕсли;
	//				
	//			КонецЦикла;
	//			
	//		Иначе
	//			
	//			Для Каждого Рек Из Объект.Метаданные().ТабличныеЧасти[ТЧ.Имя].Реквизиты Цикл
	//				
	//				Запись = РегистрыСведений.Renault_АвтосервисИзменияДокументов.СоздатьМенеджерЗаписи();
	//				
	//				Если Объект.ЭтоНовый() Тогда
	//					
	//					Запись.GUID_Объекта = ID;
	//					Запись.Документ = Строка(Объект);
	//					
	//				Иначе
	//					
	//					Запись.GUID_Объекта = Объект.Ссылка.УникальныйИдентификатор();
	//					Запись.Документ = Строка(Объект.Ссылка);
	//					
	//				КонецЕсли;
	//				
	//				Запись.Пользователь = ПараметрыСеанса.Пользователь.Ссылка;
	//				Запись.Период = ДатаИзм;
	//				Запись.Реквизит = ТЧ.Имя + ":" + Строка(СтрТЧ.НомерСтроки) + " - " + Рек.Имя;
	//				Запись.СтароеЗначение = "";
	//				Запись.НовоеЗначение = Строка(СтрТЧ[Рек.Имя]);
	//				Запись.Записать();
	//				
	//			КонецЦикла;
	//			
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//	
	//КонецЦикла;
	
КонецПроцедуры

Функция Renault_СообщитьОЗаметках(Клиент,BIR="",VIN="") Экспорт
	
	//Если ПараметрыСеанса.Renault_ПраваПользователя.ВерсияАльфаАвто = "4" Тогда
	//	
	//	Возврат "";
	//	
	//КонецЕсли;
	
	ТекстЗаметкиВсего = "";
	
	Если обЗначениеНеЗаполнено(Клиент) Тогда
		Возврат ТекстЗаметкиВсего;
	КонецЕсли;
	
	// посмотрим есть ли заметки
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаметкиПользователей.Объект,
	|	ЗаметкиПользователей.Автор,
	|	ЗаметкиПользователей.Дата,
	|	ЗаметкиПользователей.ТекстЗаметки,
	|	ЗаметкиПользователей.Напоминать
	|ИЗ
	|	РегистрСведений.ЗаметкиПользователей КАК ЗаметкиПользователей
	|ГДЕ
	|	ЗаметкиПользователей.Напоминать = ИСТИНА
	|	И ЗаметкиПользователей.Объект = &Значение";
	Запрос.УстановитьПараметр("ПустаяСтрока" , "");
	Запрос.УстановитьПараметр("Значение"     , Клиент);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ТекстЗаметкиВсего = "Заметка по контрагенту: " + Символы.ПС;
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл;
			
			ТекстЗаметкиВсего = ТекстЗаметкиВсего + Символы.ПС + Выборка.ТекстЗаметки;
			
		КонецЦикла;
		
	КонецЕсли;
	
	//  ++
	Если BIR<>"" И VIN<>"" Тогда
		Если СтрДлина(ТекстЗаметкиВсего)>0 Тогда
			ТекстЗаметкиВсего = ТекстЗаметкиВсего + Символы.ПС + Символы.ПС;
		КонецЕсли;
		ТекстЗаметкиВсего = ТекстЗаметкиВсего + Renault_АвтосервисСерверСинхрСПланшетом.ПолучитьПоследниеТриКомментарияVOC(BIR,VIN);
	КонецЕсли;
	// ++
	
	Возврат ТекстЗаметкиВсего;
	
КонецФункции

Функция Renault_ПолучитьДолгКлиента(Контрагент) Экспорт
	
	СтруктураОтбора = Новый Структура("Контрагент",Контрагент);
		МоментВремени = Новый МоментВремени(КонецДня(ТекущаяДата()));
		тзДолги=РегистрыНакопления.ВзаиморасчетыКомпании.Остатки(МоментВремени,СтруктураОтбора,,"Сумма");
		ВыводимСумму=Формат(тзДолги.Итог("Сумма"),"ЧДЦ=2");
		Если ПустаяСтрока(ВыводимСумму) Тогда
			Возврат "Текущий долг составляет: 0 ";
		Иначе
			Возврат "Текущий долг составляет: "+Формат(тзДолги.Итог("Сумма"),"ЧДЦ=2");
		КонецЕсли;
	
КонецФункции

функция Renault_ПолучитьИсполнителейЗаПериод(НачалоПериода, КонецПериода, Исполнитель = Неопределено, Цех = Неопределено) Экспорт
	
	//Запрос = Новый Запрос();
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	Сотрудники.Ссылка КАК Сотрудник,
	//               |	ГрафикРаботКалендарный.Дата,
	//               |	ГрафикРаботКалендарный.НачалоРабочегоВремени,
	//               |	ГрафикРаботКалендарный.КонецРабочегоВремени
	//               |ИЗ
	//               |	Справочник.Сотрудники КАК Сотрудники
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГрафикиРаботы КАК ГрафикиРаботы
	//               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикРаботКалендарный КАК ГрафикРаботКалендарный
	//               |			ПО (ГрафикРаботКалендарный.График = ГрафикиРаботы.Ссылка)
	//               |		ПО Сотрудники.ГрафикРаботы = ГрафикиРаботы.Ссылка
	//               |ГДЕ
	//               |	ГрафикРаботКалендарный.Дата = &Дата
	//               |	И (ГрафикРаботКалендарный.НачалоРабочегоВремени <= &Начало
	//               |			ИЛИ ГрафикРаботКалендарный.КонецРабочегоВремени >= &Конец
	//               |			ИЛИ ГрафикРаботКалендарный.НачалоРабочегоВремени >= &Начало
	//               |				И ГрафикРаботКалендарный.КонецРабочегоВремени <= &Конец)
	//               |	И ГрафикРаботКалендарный.ВидДня = &Рабочий
	//               |	И ГрафикРаботКалендарный.ВидИнтервала = &ВидИнтервала";
	//
	//Запрос.УстановитьПараметр("ВидИнтервала", Справочники.ВидыИнтервалов.Работа);
	//Запрос.УстановитьПараметр("Рабочий", Перечисления.ВидДня.Рабочий);
	//
	//Если ЗначениеЗаполнено(Цех) Тогда
	//	
	//	Запрос.Текст = Запрос.Текст + Символы.ПС + 
	//	
	//	"И Сотрудники.Цех = &Цех";
	//	
	//	Запрос.УстановитьПараметр("Цех", Цех);
	//	
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(Исполнитель) Тогда
	//	
	//	Запрос.Текст = Запрос.Текст + Символы.ПС + 
	//	
	//	"И Сотрудники.Ссылка = &Исполнитель";
	//	
	//	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	//	
	//КонецЕсли;
	//
	//Запрос.Текст = Запрос.Текст + Символы.ПС + 
	//	
	//	"УПОРЯДОЧИТЬ ПО ГрафикРаботКалендарный.НачалоРабочегоВремени";
	//	
	//Запрос.УстановитьПараметр("Дата", НачалоДня(НачалоПериода));
	//
	//Начало = Дата(0001, 01, 01, Час(НачалоПериода), Минута(НачалоПериода), Секунда(НачалоПериода));
	//Конец = Дата(0001, 01, 01, Час(КонецПериода), Минута(КонецПериода), Секунда(КонецПериода));
	//
	//Запрос.УстановитьПараметр("Начало", Начало);
	//Запрос.УстановитьПараметр("Конец", Конец);
	//
	//Таблица = Запрос.Выполнить().Выгрузить();
	//
	//Если ЗначениеЗаполнено(Таблица) Тогда
	//	
	//	Таблица.Колонки.Добавить("НачалоРаботы", Новый ОписаниеТипов("Дата"));
	//	Таблица.Колонки.Добавить("КонецРаботы", Новый ОписаниеТипов("Дата"));
	//	
	//	Для Каждого Строка из Таблица Цикл
	//		
	//		Строка.НачалоРаботы = Строка.Дата + ЧАС(Строка.НачалоРабочегоВремени)*3600 + Минута(Строка.НачалоРабочегоВремени)*60;
	//		Строка.КонецРаботы = Строка.Дата + ЧАС(Строка.КонецРабочегоВремени)*3600 + Минута(Строка.КонецРабочегоВремени)*60;
	//		
	//	КонецЦикла;
	//	
	//КонецЕсли;
	//
	//Возврат Таблица;
	
	Возврат Renault_АвтосервисПланированиеПовтИспользования.Renault_ПолучитьИсполнителейЗаПериод(НачалоПериода, КонецПериода, Исполнитель, Цех);
	
КонецФункции

//Процедура Renault_ЗаписатьДанныеПоИсполнителям(РабочийДокумент, ВремяНачала, ВремяОкончания, Цех, Этап)
//	
//	Исполнители = Renault_АвтосервисОбщий.Renault_ПолучитьИсполнителейЗаПериод(ВремяНачала, ВремяОкончания, Неопределено, Цех);
//	
//	Если ЗначениеЗаполнено(Исполнители) Тогда
//		
//		Для Каждого Строка из Исполнители Цикл
//			
//			Запись = РегистрыСведений.Renault_АвтосервисФактПоИсполнителям.СоздатьМенеджерЗаписи();
//			Запись.Исполнитель = Строка.Сотрудник;
//			Запись.Период = ТекущаяДата();
//			Запись.РабочийДокумент = РабочийДокумент;
//			Запись.Этап = Этап;
//			Запись.Цех = Цех;
//			Запись.ВремяНачала = ВремяНачала;
//			Запись.ВремяОкончания = ВремяОкончания;
//			
//			Запись.Записать();
//			
//		КонецЦикла;
//		
//	КонецЕсли;
//	
//КонецПроцедуры

Функция Renault_ЗавершитьВсеРаботыПоОбращению(Обращение) Экспорт
	
	//Завершить все мойки:
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_CRM_ЗаявкаНаМойку.Ссылка,
	|	Renault_АвтосервисСтатусыРаботСрезПоследних.СтатусРаботы,
	|	Renault_АвтосервисСтатусыРаботСрезПоследних.Цех
	|ИЗ
	|	Документ.Renault_CRM_ЗаявкаНаМойку КАК Renault_CRM_ЗаявкаНаМойку
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_АвтосервисСтатусыРабот.СрезПоследних КАК Renault_АвтосервисСтатусыРаботСрезПоследних
	|		ПО Renault_CRM_ЗаявкаНаМойку.Обращение = Renault_АвтосервисСтатусыРаботСрезПоследних.Обращение
	|			И Renault_CRM_ЗаявкаНаМойку.Ссылка = Renault_АвтосервисСтатусыРаботСрезПоследних.РабочийДокумент
	|ГДЕ
	|	Renault_CRM_ЗаявкаНаМойку.Обращение = &Обращение
	|	И Renault_АвтосервисСтатусыРаботСрезПоследних.СтатусРаботы <> &СтатусРаботы";
	
	Запрос.УстановитьПараметр("Обращение", Обращение);
	Запрос.УстановитьПараметр("СтатусРаботы", Справочники.Renault_СтатусыАвторабот.РаботаЗакончена);
	
	Мойки = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Мойка из Мойки Цикл
		
		Запись = РегистрыСведений.Renault_АвтосервисСтатусыРабот.СоздатьМенеджерЗаписи();
		Запись.ДилерскийЦентр = Обращение.ДилерскийЦентр;
		Запись.Обращение = Обращение;
		Запись.Период = ТекущаяДата();
		Запись.РабочийДокумент = Мойка.Ссылка;
		Запись.Цех = Мойка.Цех;
		Запись.ЭтапРабот = "1";
		Запись.СтатусРаботы = Справочники.Renault_СтатусыАвторабот.РаботаЗакончена;
		Запись.Записать();
		
	КонецЦикла;
	
	//Все этапы завершим, всех их завершим :)
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_АвтосервисСтатусыРаботСрезПоследних.СтатусРаботы,
	|	Renault_АвтосервисСтатусыРаботСрезПоследних.Цех,
	|	Renault_CRM_ЗаявкаНаСервисЭтапы.Ссылка КАК Ссылка,
	|	Renault_CRM_ЗаявкаНаСервисЭтапы.IDЭтапа
	|ИЗ
	|	Документ.Renault_CRM_ЗаявкаНаСервис.Этапы КАК Renault_CRM_ЗаявкаНаСервисЭтапы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_АвтосервисСтатусыРабот.СрезПоследних КАК Renault_АвтосервисСтатусыРаботСрезПоследних
	|		ПО Renault_CRM_ЗаявкаНаСервисЭтапы.Ссылка = Renault_АвтосервисСтатусыРаботСрезПоследних.РабочийДокумент
	|			И Renault_CRM_ЗаявкаНаСервисЭтапы.IDЭтапа = Renault_АвтосервисСтатусыРаботСрезПоследних.ЭтапРабот
	|ГДЕ
	|	Renault_АвтосервисСтатусыРаботСрезПоследних.СтатусРаботы <> &СтатусРаботы
	|	И Renault_CRM_ЗаявкаНаСервисЭтапы.Ссылка.Обращение = &Обращение
	|
	|СГРУППИРОВАТЬ ПО
	|	Renault_CRM_ЗаявкаНаСервисЭтапы.Ссылка,
	|	Renault_АвтосервисСтатусыРаботСрезПоследних.СтатусРаботы,
	|	Renault_АвтосервисСтатусыРаботСрезПоследних.Цех,
	|	Renault_CRM_ЗаявкаНаСервисЭтапы.IDЭтапа
	|ИТОГИ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("Обращение", Обращение);
	Запрос.УстановитьПараметр("СтатусРаботы", Справочники.Renault_СтатусыАвторабот.РаботаЗакончена);
	
	ВыборкаЗаявки = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Пока ВыборкаЗаявки.Следующий() Цикл
		
		Этапы = ВыборкаЗаявки.Выбрать();
		
		Пока Этапы.Следующий() Цикл
			
			Запись = РегистрыСведений.Renault_АвтосервисСтатусыРабот.СоздатьМенеджерЗаписи();
			Запись.ДилерскийЦентр = Обращение.ДилерскийЦентр;
			Запись.Обращение = Обращение;
			Запись.Период = ТекущаяДата();
			Запись.РабочийДокумент = ВыборкаЗаявки.Ссылка;
			Запись.Цех = Этапы.Цех;
			Запись.ЭтапРабот = Этапы.IDЭтапа;
			Запись.СтатусРаботы = Справочники.Renault_СтатусыАвторабот.РаботаЗакончена;
			Запись.Записать();
			
		КонецЦикла;
		
		Заявка = ВыборкаЗаявки.Ссылка;
		
		ОбЗаявка = Заявка.Ссылка.ПолучитьОбъект();
		ОбЗаявка.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен;
		ОбЗаявка.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
	//Завершить все подменки:
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_CRM_ЗаявкаНаПодменныйАвто.Ссылка,
	|	Renault_АвтосервисСтатусыРаботСрезПоследних.СтатусРаботы,
	|	Renault_АвтосервисСтатусыРаботСрезПоследних.Цех
	|ИЗ
	|	Документ.Renault_CRM_ЗаявкаНаПодменныйАвто КАК Renault_CRM_ЗаявкаНаПодменныйАвто
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_АвтосервисСтатусыРабот.СрезПоследних КАК Renault_АвтосервисСтатусыРаботСрезПоследних
	|		ПО Renault_CRM_ЗаявкаНаПодменныйАвто.Обращение = Renault_АвтосервисСтатусыРаботСрезПоследних.Обращение
	|			И Renault_CRM_ЗаявкаНаПодменныйАвто.Ссылка = Renault_АвтосервисСтатусыРаботСрезПоследних.РабочийДокумент
	|ГДЕ
	|	Renault_CRM_ЗаявкаНаПодменныйАвто.Обращение = &Обращение
	|	И Renault_АвтосервисСтатусыРаботСрезПоследних.СтатусРаботы <> &СтатусРаботы";
	
	Запрос.УстановитьПараметр("Обращение", Обращение);
	Запрос.УстановитьПараметр("СтатусРаботы", Справочники.Renault_СтатусыАвторабот.РаботаЗакончена);
	
	Подменки = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Подменка из Подменки Цикл
		
		Запись = РегистрыСведений.Renault_АвтосервисСтатусыРабот.СоздатьМенеджерЗаписи();
		Запись.ДилерскийЦентр = Обращение.ДилерскийЦентр;
		Запись.Обращение = Обращение;
		Запись.Период = ТекущаяДата();
		Запись.РабочийДокумент = Подменка.Ссылка;
		Запись.Цех = Подменка.Цех;
		Запись.ЭтапРабот = "1";
		Запись.СтатусРаботы = Справочники.Renault_СтатусыАвторабот.РаботаЗакончена;
		Запись.Записать();
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция СформироватьСтрокуСоединенияКБазеПланшетПоПараметрам(Параметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Параметры) Тогда
		
		Параметры = ПараметрыПодключенияКБазеПланшет();
		
	КонецЕсли;
	
	Ответ = "Driver={"+Параметры.Драйвер+"};Server="+Параметры.АдресСервера+
	";Database="+Параметры.БазаДанных+";Uid="+Параметры.Логин+";Pwd="+Параметры.Пароль+";";
	
	Возврат Ответ;
	
КонецФункции

Функция НайтиВБазеСсылкуПоОтбору(ИмяОбъекта, СтруктураОтбора) Экспорт
	
	Запрос = Новый Запрос();
	ТекстЗапроса = "ВЫБРАТЬ 
	|	ИсточникПоиска.Ссылка КАК Ссылка
	|ИЗ
	|	" + ИмяОбъекта + " КАК ИсточникПоиска";
	ЭтоПервоеУсловие = Истина;
	Для Каждого Условие Из СтруктураОтбора Цикл
		Если ЭтоПервоеУсловие Тогда
			ЭтоПервоеУсловие = Ложь;
			ТекстЗапроса = ТекстЗапроса + Символы.ПС + " ГДЕ " + Символы.ПС;
		Иначе
			ТекстЗапроса = ТекстЗапроса + Символы.ПС + " И ";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + " ИсточникПоиска." + Условие.Ключ + " = &" + Условие.Ключ;
		Запрос.УстановитьПараметр(Условие.Ключ, Условие.Значение);
	КонецЦикла;
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура Renault_ПриИзмененииГосНомераПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	//TODO	
	
КонецПроцедуры

Процедура Renault_ЗаписьMyRenault(Клиент, eMail) Экспорт
	
	Запись = РегистрыСведений.Renault_ПользователиMyRenault.СоздатьМенеджерЗаписи();
	
	Запись.Период = ТекущаяДата();
	Запись.ЕстьРегистрация = Истина;
	Запись.Контрагент = Клиент;
	Запись.ЛогинMyRenault = eMail;
	
	Запись.Записать();
	
КонецПроцедуры

Функция ПолучитьВремяВыполненияРаботы(Авторабота, Модель = Неопределено, ВидРемонта = Неопределено) Экспорт
	
//	Если ПараметрыСеанса.Renault_ПраваПользователя.ВерсияАльфаАвто = "4" Тогда
//		
//		Запрос = Новый Запрос();
//		
//		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
//		               |	АвтоработыНормыВремени.ВремяВыполнения
//		               |ИЗ
//		               |	Справочник.Автоработы.НормыВремени КАК АвтоработыНормыВремени
//		               |ГДЕ
//		               |	АвтоработыНормыВремени.Ссылка = &Авторабота";
//		              //|	И АвтоработыНормыВремени.КлассАвтомобиля = &КлассАвтомобиля";
//					   
//		Запрос.УстановитьПараметр("Авторабота", Авторабота);
////		Запрос.УстановитьПараметр("КлассАвтомобиля", Модель.КлассАвтомобиля);
//		//Запрос.УстановитьПараметр("ВидРемонта", ВидРемонта);
//		
//		Выборка = Запрос.Выполнить().Выбрать();
//		
//		Если Выборка.Следующий() Тогда
//			
//			Возврат Выборка.ВремяВыполнения;
//			
//		Иначе
//			
//			Возврат 0;
//			
//		КонецЕсли;
//		
//	Иначе
		
	Возврат Авторабота.ВремяВыполнения;
		
	//КонецЕсли;
	
КонецФункции

Функция ПолучитьДеревоАвторабот(Модель) Экспорт
	
	Группа = Renault_АвтосервисСерверПовтИспользования.ПолучитьПапкуАвторабот(Модель);
	
	Если ЗначениеЗаполнено(Группа) Тогда
		
		Дерево = ПолучитьВетвлениеГруппы(Группа);
		
		Возврат Дерево;
		
	Иначе
		
		Возврат Неопределено;
	
	КонецЕсли;
	
КонецФункции

Функция ПолучитьВетвлениеГруппы(ГруппаАвторабот) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Автоработы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Автоработы КАК Автоработы
	               |ГДЕ
	               |	Автоработы.Ссылка В ИЕРАРХИИ(&ГруппаАвторабот)
	               |	И Автоработы.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ссылка ИЕРАРХИЯ";
				   
				 Запрос.УстановитьПараметр("ГруппаАвторабот", ГруппаАвторабот);
				 
				 Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
				 
	Возврат Дерево;
		
КонецФункции

Функция ПолучитьЦенуРаботы(Авторабота, Автомобиль = Неопределено, ВидРемонта = Неопределено) Экспорт
	
	Если Автомобиль = Неопределено Тогда
		
		Автомобиль = Справочники.Автомобили.ПустаяСсылка();
		
	КонецЕсли;
	
	Если ВидРемонта = Неопределено Тогда
		
		ВидРемонта = Справочники.ВидыРемонта.ПустаяСсылка();
		
	КонецЕсли;
	
	Попытка
		
		Свойство = обПолучитьЗначениеСвойства(Авторабота, ПланыВидовХарактеристик.СвойстваОбъектов._ПризнакКомплекса);
		Если НЕ Свойство Тогда
			
			Возврат 0;
			
		КонецЕсли;
		
	Исключение
		
	КонецПопытки;
	
	Запрос = Новый Запрос;
	
	//Если ПараметрыСеанса.Renault_ПраваПользователя.ВерсияАльфаАвто = "5" Тогда
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЦеныАвтоработСрезПоследних.Период,
	|	ЦеныАвтоработСрезПоследних.Регистратор,
	|	ЦеныАвтоработСрезПоследних.НомерСтроки,
	|	ЦеныАвтоработСрезПоследних.Активность,
	|	ЦеныАвтоработСрезПоследних.ТипЦен,
	|	ЦеныАвтоработСрезПоследних.Авторабота,
	|	ЦеныАвтоработСрезПоследних.Модель,
	|	ЦеныАвтоработСрезПоследних.ДоговорВзаиморасчетов,
	|	ЦеныАвтоработСрезПоследних.Цех,
	|	ЦеныАвтоработСрезПоследних.ВидРемонта,
	|	ЦеныАвтоработСрезПоследних.Нормочас,
	|	ЦеныАвтоработСрезПоследних.Валюта,
	|	ЦеныАвтоработСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.ЦеныАвторабот.СрезПоследних(
	|			,
	|			ВидРемонта = &ВидРемонта
	|				И Модель = &Модель
	|				И Авторабота = &Авторабота) КАК ЦеныАвтоработСрезПоследних";
	
	Запрос.УстановитьПараметр("Авторабота", Авторабота);
	Запрос.УстановитьПараметр("Модель", Автомобиль.Модель);
	Запрос.УстановитьПараметр("ВидРемонта", ВидРемонта);
	
	Цены = Запрос.Выполнить().Выгрузить();
	
	Если Цены.Количество() > 0 Тогда
		
		Возврат Цены;
		
	Иначе
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ЦеныАвтоработСрезПоследних.Период,
		|	ЦеныАвтоработСрезПоследних.Регистратор,
		|	ЦеныАвтоработСрезПоследних.НомерСтроки,
		|	ЦеныАвтоработСрезПоследних.Активность,
		|	ЦеныАвтоработСрезПоследних.ТипЦен,
		|	ЦеныАвтоработСрезПоследних.Авторабота,
		|	ЦеныАвтоработСрезПоследних.Модель,
		|	ЦеныАвтоработСрезПоследних.ДоговорВзаиморасчетов,
		|	ЦеныАвтоработСрезПоследних.Цех,
		|	ЦеныАвтоработСрезПоследних.ВидРемонта,
		|	ЦеныАвтоработСрезПоследних.Нормочас,
		|	ЦеныАвтоработСрезПоследних.Валюта,
		|	ЦеныАвтоработСрезПоследних.Цена
		|ИЗ
		|	РегистрСведений.ЦеныАвторабот.СрезПоследних(
		|			,
		|			ВидРемонта = &ВидРемонта
		|				И Авторабота = &Авторабота) КАК ЦеныАвтоработСрезПоследних";
		
		Цены = Запрос.Выполнить().Выгрузить();
		
		Если Цены.Количество() > 0 Тогда
			
			Возврат Цены;
			
		Иначе
			
			Запрос.Текст = "ВЫБРАТЬ
			|	ЦеныАвтоработСрезПоследних.ТипЦен,
			|	ЦеныАвтоработСрезПоследних.Авторабота,
			|	ЦеныАвтоработСрезПоследних.Нормочас,
			|	ЦеныАвтоработСрезПоследних.Цена
			|ИЗ
			|	РегистрСведений.ЦеныАвторабот.СрезПоследних(, Авторабота = &Авторабота) КАК ЦеныАвтоработСрезПоследних";
			
			Цены = Запрос.Выполнить().Выгрузить();
			
			Если Цены.Количество() > 0 Тогда
				
				Возврат Цены;
				
			Иначе
				
				Возврат Неопределено;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Иначе
	//	
	//	Запрос.Текст = "ВЫБРАТЬ
	//		|	ЦеныАвтоработСрезПоследних.Авторабота,
	//		|	ЦеныАвтоработСрезПоследних.Нормочас,
	//		|	ЦеныАвтоработСрезПоследних.Цена
	//		|ИЗ
	//		|	РегистрСведений.ЦеныАвторабот.СрезПоследних(, Авторабота = &Авторабота) КАК ЦеныАвтоработСрезПоследних";
	//	//  |	И ЦеныАвтоработСрезПоследних.КлассАвтомобиля = &КлассАвтомобиля";
	//	
	//	//Если ЗначениеЗаполнено(ВидРемонта) Тогда
	//	//	
	//	//	Запрос.Текст = Запрос.Текст + Символы.ПС + "И ЦеныАвтоработСрезПоследних.ВидРемонта = &ВидРемонта";
	//	//	Запрос.УстановитьПараметр("ВидРемонта", ВидРемонта);
	//	//	
	//	// КонецЕсли;
	//	
	//	
	//	Запрос.УстановитьПараметр("Авторабота", Авторабота);
	//	//Запрос.УстановитьПараметр("КлассАвтомобиля", Модель.КлассАвтомобиля);
	//	
	//КонецЕсли;
	
	Цены = Запрос.Выполнить().Выгрузить();
	
	Если ЗначениеЗаполнено(Цены) Тогда
		
		Возврат Цены;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЦенуТоваров (Номенклатура, ТипЦен, Подразделение = Неопределено) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	ЦеныСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних КАК ЦеныСрезПоследних
	|ГДЕ
	|	ЦеныСрезПоследних.ТипЦен = &ТипЦен
	|	И ЦеныСрезПоследних.Номенклатура = &Номенклатура";
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		
		Запрос.Текст = Запрос.Текст + Символы.ПС +
		"И ЦеныСрезПоследних.ПодразделениеКомпании = &ПодразделениеКомпании";
		
		Запрос.УстановитьПараметр("ПодразделениеКомпании", Подразделение);
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Цены = Запрос.Выполнить().Выгрузить();
	
	Если ЗначениеЗаполнено(Цены) Тогда
		
		Возврат Цены[0].Цена;
		
	Иначе
		
		Возврат 0;
		
	КонецЕсли;
	
КонецФункции

Функция ЭтоАвтомобильРено(Данные) Экспорт
	
	Модель = Неопределено;
	
	Если ТипЗнч(Данные) = Тип("СправочникСсылка.Модели") Тогда
		
		Модель = Данные;
		
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникСсылка.Автомобили") Тогда
		
		Модель = Данные.Модель;
		
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникСсылка.Renault_ЧерновикиАвтомобилей") Тогда
		
		Модель = Данные.Модель;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Справочники.CRM_МаркаАвтомобиля.RENAULT.МоделиАвтомобилей.Найти(Модель, "Модель")) Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

Функция Renault_ПолучитьСвязанныеРаботы(Авторабота) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	СвязанныеРаботы.СвязаннаяРабота,
	               |	СвязанныеРаботы.Количество
	               |ИЗ
	               |	РегистрСведений.СвязанныеРаботы КАК СвязанныеРаботы
	               |ГДЕ
	               |	СвязанныеРаботы.Авторабота = &Авторабота";
				   
	Запрос.УстановитьПараметр("Авторабота", Авторабота);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции // Renault_ПолучитьСвязанныеРаботы()

Функция Renault_МакетВТаблицуЗначений(Макет, _ТЗ = Неопределено, флДобавлятьКолонки = Истина) Экспорт
	
	Перем ТЗ;
	
	Если _ТЗ = Неопределено Тогда
		ТЗ = Новый ТаблицаЗначений();
		флЗаполняем = ложь;
	Иначе
		ТЗ =_ТЗ;
		флЗаполняем = Истина;
	КонецЕсли;
	
	//Считываем колонки
	КоличествоКолонок = 0;
	ИменаКолонок = Новый Массив();
	Кол = 1;
	Пока истина Цикл
		Адрес = "R1C" + Формат(Кол,"ЧГ=");
		ИмяКол = Макет.Область(Адрес).Текст;
		Если ПустаяСтрока(ИмяКол) Тогда
			Прервать;
		КонецЕсли;
		КоличествоКолонок = КоличествоКолонок + 1;
		Если НЕ флЗаполняем ИЛИ (флЗаполняем И флДобавлятьКолонки) И ТЗ.Колонки.Найти(ИмяКол) = Неопределено Тогда
			ТЗ.Колонки.Добавить(ИмяКол);
		КонецЕсли;
		ИменаКолонок.Добавить(ИмяКол);
		Кол = Кол + 1;
	КонецЦикла;
	
	//Считываем строки
	Стр = 2; Кол = 1;
	Пока Истина Цикл
		Вставлено = Ложь;
		Первая = Истина;
		Для Инд = 1 По КоличествоКолонок Цикл
			Адрес = "R" + Формат(Стр, "ЧГ=") + "C" + Формат(Инд, "ЧГ=");
			Зн = СокрЛП(Макет.Область(Адрес).Текст);
			Если ПустаяСтрока(Зн) Тогда
				Продолжить;
			КонецЕсли;
			Если Первая Тогда
				ТСтр = ТЗ.Добавить();
				Первая = Ложь;
				Вставлено = Истина;
			КонецЕсли;
			ИмяКолонки = ИменаКолонок[Инд-1];
			Если ТЗ.Колонки.Найти(ИмяКолонки) <> Неопределено Тогда
				Если флЗаполняем Тогда
					//Проверяем тип - число, строка, булево
					ОписаниеТипаКолонки = ТЗ.Колонки[ИмяКолонки].ТипЗначения;
					Если ОписаниеТипаКолонки.СодержитТип(Тип("Число")) Тогда
						РезЗн = Число(Зн);
					ИначеЕсли ОписаниеТипаКолонки.СодержитТип(Тип("Строка")) Тогда
						РезЗн = Строка(Зн);
					ИначеЕсли ОписаниеТипаКолонки.СодержитТип(Тип("Булево")) Тогда
						РезЗн = Булево(Зн);
					ИначеЕсли ОписаниеТипаКолонки.СодержитТип(Тип("Дата")) Тогда
						РезЗн = Дата(Зн);
					Иначе
						РезЗн = Зн;
					КонецЕсли;
				Иначе
					РезЗн = Зн;
				КонецЕсли;
				ТСтр[ИмяКолонки] = РезЗн;
			КонецЕсли;
		КонецЦикла;
		Если Не Вставлено = Истина Тогда
			Прервать;
		КонецЕсли;
		Стр = Стр + 1;
		Кол = 1;
	КонецЦикла;
	
	Возврат ТЗ;
	
КонецФункции

Функция ЕстьMyRenault(Клиент) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ПользователиMyRenaultСрезПоследних.Период,
	|	Renault_ПользователиMyRenaultСрезПоследних.Контрагент,
	|	Renault_ПользователиMyRenaultСрезПоследних.ЛогинMyRenault,
	|	Renault_ПользователиMyRenaultСрезПоследних.ЕстьРегистрация
	|ИЗ
	|	РегистрСведений.Renault_ПользователиMyRenault.СрезПоследних КАК Renault_ПользователиMyRenaultСрезПоследних
	|ГДЕ
	|	Renault_ПользователиMyRenaultСрезПоследних.ЕстьРегистрация = ИСТИНА
	|	И Renault_ПользователиMyRenaultСрезПоследних.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Клиент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ЕстьMyRenault_2(Клиент) Экспорт 
	
	Возврат Ложь;
	
КонецФункции

Функция Renault_ПолучитьГосНомер(Автомобиль) Экспорт
	
	//Если ТипЗнч(Автомобиль) = Тип("СправочникСсылка.Renault_ЧерновикиАвтомобилей") Тогда
	Попытка
		Возврат Автомобиль.ГосНомер;
	//КонецЕсли;
	Исключение
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	АвтомобилиСрезПоследних.Значение
		               |ИЗ
		               |	РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
		               |ГДЕ
		               |	АвтомобилиСрезПоследних.Автомобиль = &Автомобиль
		               |	И АвтомобилиСрезПоследних.ВидЗначения = &ВидЗначения";
					   
		Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
		Запрос.УстановитьПараметр("ВидЗначения", Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Значение;
		Иначе
			Возврат "";
		КонецЕсли;
	КонецПопытки;
	
КонецФункции

Функция ПолучитьМастеровПриемщиковДЦ(ДилерскийЦентр) Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Пользователи.Ссылка КАК Пользователь,
	               |	Пользователи.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |ГДЕ
	               |	Пользователи.Сотрудник.Должность В(&Должность)
	               |	И Пользователи.Сотрудник.Подразделение В(&Подразделение)
	               |	И Пользователи.Сотрудник.ПометкаУдаления = ЛОЖЬ
	               |	И Пользователи.Сотрудник.ФлагУволен = ЛОЖЬ";
	
	Должности = ДилерскийЦентр.ДолжностиМеханиковАвтосервиса.ВыгрузитьКолонку("Должность");
	Подразделения = ДилерскийЦентр.ПодразделенияОрганизации.ВыгрузитьКолонку("Подразделение");
	
	Запрос.УстановитьПараметр("Должность", Должности);
	Запрос.УстановитьПараметр("Подразделение", Подразделения);
	
	Список = Запрос.Выполнить().Выгрузить();
	
	Возврат Список;
	
КонецФункции

Функция ПолучитьИсполнителейДЦ(ДилерскийЦентр) Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Сотрудники.Ссылка КАК Сотрудник
	               |ИЗ
	               |	Справочник.Сотрудники КАК Сотрудники
	               |ГДЕ
	               |	Сотрудники.Должность В(&Должности)
	               |	И Сотрудники.Подразделение В(&Подразделения)
	               |	И Сотрудники.ФлагУволен = ЛОЖЬ
	               |	И Сотрудники.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Сотрудники.Наименование";
	
	Должности = ДилерскийЦентр.ДолжностиИсполнителейНаПостах.ВыгрузитьКолонку("Должность");
	Подразделения = ДилерскийЦентр.ПодразделенияОрганизации.ВыгрузитьКолонку("Подразделение");
	
	Запрос.УстановитьПараметр("Должности", Должности);
	Запрос.УстановитьПараметр("Подразделения", Подразделения);
	
	Список = Запрос.Выполнить().Выгрузить();
	
	Возврат Список;
	
КонецФункции

Функция ПредложитьRenault_AssistancePlus(Автомобиль, СписокКодовРабот) Экспорт
	
	//Запрос = Новый Запрос();
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	Renault_КодировкиТО.АртикулРаботы
	//			   |ИЗ
	//			   |	РегистрСведений.Renault_КодировкиТО КАК Renault_КодировкиТО
	//			   |ГДЕ
	//			   |	Renault_КодировкиТО.АртикулРаботы В(&СписокКодовРабот)";
	//			   
	//Запрос.УстановитьПараметр("СписокКодовРабот", СписокКодовРабот);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Если НЕ Выборка.Следующий() Тогда
	//	
	//	Возврат Ложь;
	//	
	//Иначе		   
	//
		Если ЗначениеЗаполнено(Автомобиль.ДатаНачалаГарантии) И ДобавитьМесяц(Автомобиль.ДатаНачалаГарантии, 24) <= НачалоДня(ТекущаяДата()) Тогда
			
			Возврат Истина;
			
		Иначе
			
			Возврат Ложь;
			
		КонецЕсли;
			
	//КонецЕсли;
	
КонецФункции

Процедура Renault_РегистрСведенийНаборЗаписейАвтомобилиПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Для Каждого СтрокаИсточника из Источник Цикл
		Если СтрокаИсточника.ВидЗначения = Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег Тогда
			РегистрыСведений.Renault_ВыполнениеТО.РассчитатьЗапись(СтрокаИсточника);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтметитьВыполнениеСтандартаМастером(Обращение, Сотрудник = Неопределено, ПредложилАкции = Неопределено, ПредложилРекомендации = Неопределено, ПредложилТаксиПодменку = Неопределено) Экспорт
	
	Запись = РегистрыСведений.Renault_ВыполнениеСтандартовМастерами.СоздатьМенеджерЗаписи();
	Запись.Обращение = Обращение;
	Запись.Прочитать();
	Запись.Обращение = Обращение;
	Если ПредложилАкции <> Неопределено Тогда
		Запись.ПредложилАкции = ПредложилАкции;
	КонецЕсли;
	Если ПредложилРекомендации <> Неопределено Тогда
		Запись.ПредложилРекомендации = ПредложилРекомендации;
	КонецЕсли;
	Если ПредложилТаксиПодменку <> Неопределено Тогда
		Запись.ПредложилТаксиПодменку = ПредложилТаксиПодменку;
	КонецЕсли;
	Если Сотрудник <> Неопределено Тогда
		Запись.Сотрудник = Сотрудник;
	КонецЕсли;
	Запись.Записать();
	
КонецПроцедуры

Функция Renault_НайтиНомераТелефоновИНормализовать() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Объект,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Тип = &Тип";
	
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	
	ТаблицаКонтактнойИнформации = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка из ТаблицаКонтактнойИнформации Цикл
		
		Нормал = Строка.Представление;
		
		Нормал = СтрЗаменить(Нормал, "+", "");
		Нормал = СтрЗаменить(Нормал, "-", "");
		Нормал = СтрЗаменить(Нормал, ".", "");
		Нормал = СтрЗаменить(Нормал, "*", "");
		Нормал = СтрЗаменить(Нормал, " ", "");
		Нормал = СтрЗаменить(Нормал, "(", "");
		Нормал = СтрЗаменить(Нормал, ")", "");
		
		Если Найти(Нормал, "7") = 1 ИЛИ Найти(Нормал, "8") = 1 Тогда
			
			Нормал = Прав(Нормал, СтрДлина(Нормал) - 1);
			
		КонецЕсли;
		
		Строка.Представление = Нормал;
		
	КонецЦикла;
	
	Возврат ТаблицаКонтактнойИнформации;
	
КонецФункции

Функция Renault_ВыбратьТелефон(Контрагент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Вид,
	|	КонтактнаяИнформация.Представление,
	|	КонтактнаяИнформация.Комментарий
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Контрагент
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	ТелефоныКлиента = Запрос.Выполнить().Выгрузить();
	Если ТелефоныКлиента.Количество() = 1 Тогда
		
		ВыбраннаяСтрока = ТелефоныКлиента[0];
		
	ИначеЕсли ТелефоныКлиента.Количество() > 1 Тогда
		#Если Клиент Тогда
			
			ВыбраннаяСтрока = ТелефоныКлиента.ВыбратьСтроку("Выберите контактный телефон");
			Если ВыбраннаяСтрока = Неопределено Тогда
				Предупреждение("Не выбраны контактные данные");
				Возврат "";
			КонецЕсли;
			
		#Иначе
			
			ВыбраннаяСтрока = ТелефоныКлиента[0];
			
		#КонецЕсли
		
	Иначе
		
		Возврат "";
		
	КонецЕсли;
	
	Возврат ВыбраннаяСтрока.Представление;
	
КонецФункции

Процедура Renault_Позвонить(Телефон) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Телефон) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	#Если Клиент Тогда
		
		Оповестить("Renault_Позвонить", Телефон);
		
	#КонецЕсли
	
КонецПроцедуры

Функция Renault_ПолучитьПробег(Автомобиль) Экспорт
	
	Если ТипЗнч(Автомобиль) = Тип("СправочникСсылка.Renault_ЧерновикиАвтомобилей") Тогда
		Возврат Автомобиль.Пробег;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АвтомобилиСрезПоследних.Значение КАК Пробег
	               |ИЗ
	               |	РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	               |ГДЕ
	               |	АвтомобилиСрезПоследних.Автомобиль = &Автомобиль
	               |	И АвтомобилиСрезПоследних.ВидЗначения = &ВидЗначения";
				   
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("ВидЗначения", Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Пробег;
		
	Иначе
		
		Возврат 0;
		
	КонецЕсли;
	
КонецФункции

Функция Renault_ПолучитьПостыПоОбращению(ВидОбращения, ДилерскийЦентр) Экспорт
	
	МассивЦеховДЦ = ДилерскийЦентр.АвтосервисЦеха.ВыгрузитьКолонку("Цех"); 
	
	Если НЕ ЗначениеЗаполнено(ВидОбращения.НастройкаПостов) Тогда
		
		Возврат МассивЦеховДЦ;
		
	КонецЕсли;
	
	Отбор = Новый Структура();
	Отбор.Вставить("Исключать", ЛОЖЬ);
	
	МассивПостовВкл = ВидОбращения.НастройкаПостов.НайтиСтроки(Отбор);
	
	Если ЗначениеЗаполнено(МассивПостовВкл) Тогда
		
		МассивЦехов = Новый Массив;
		
		Для Каждого Строка Из МассивПостовВкл Цикл
			
			МассивЦехов.Добавить(Строка.Цех);
			
		КонецЦикла;
		
		Возврат МассивЦехов;
		
	КонецЕсли;
	
	Отбор = Новый Структура();
	Отбор.Вставить("Исключать", Истина);
	
	МассивПостовВыкл = ВидОбращения.НастройкаПостов.НайтиСтроки(Отбор);
	
	Если ЗначениеЗаполнено(МассивПостовВыкл) Тогда
		
		МассивПостовПромВыкл = Новый Массив;
		
		Для Каждого Строка из МассивПостовВыкл Цикл
			
			МассивПостовПромВыкл.Добавить(Строка.Цех);
			
		КонецЦикла;
		
		МассивПостовВыкл = МассивПостовПромВыкл;
		
		МассивЦехов = Новый Массив;
		
		Для Каждого Строка Из МассивЦеховДЦ Цикл
			
			Если МассивПостовВыкл.Найти(Строка.Ссылка) = Неопределено Тогда 
			
				МассивЦехов.Добавить(Строка.Ссылка);
				
			Иначе
				
				Продолжить;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат МассивЦехов;
		
	КонецЕсли;

КонецФункции

Функция Renault_ПроверитьОстатокНаСкладе(Реферанс, Склад) Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток КАК Остаток
	               |ИЗ
	               |	РегистрНакопления.ОстаткиТоваровКомпании.Остатки КАК ОстаткиТоваровКомпанииОстатки
	               |ГДЕ
	               |	ОстаткиТоваровКомпанииОстатки.Номенклатура = &Номенклатура
	               |	И ОстаткиТоваровКомпанииОстатки.СкладКомпании = &СкладКомпании";
				   
	Запрос.УстановитьПараметр("Номенклатура", Реферанс);
	Запрос.УстановитьПараметр("СкладКомпании", Склад);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Остаток;
		
	Иначе
		
		Возврат 0;
		
		
	КонецЕсли;
	
КонецФункции

Функция Renault_ПолучитьВладельцаАвто(Автомобиль) Экспорт
	
	Если ТипЗнч(Автомобиль) = Тип("СправочникСсылка.Renault_ЧерновикиАвтомобилей") Тогда
		Возврат Автомобиль.Хозяин;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АвтомобилиСрезПоследних.Значение КАК Клиент
	               |ИЗ
	               |	РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	               |ГДЕ
	               |	АвтомобилиСрезПоследних.Автомобиль = &Автомобиль
	               |	И АвтомобилиСрезПоследних.ВидЗначения = &ВидЗначения";
				   
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("ВидЗначения", Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Клиент;
		
	Иначе
		
		Возврат Неопределено;

	КонецЕсли;
	
КонецФункции

Функция Renault_ПолучитьРекомендацииПоАвтомобилю(Автомобиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_ПоврежденияАвтомобилейСрезПоследних.Работа,
	               |	Renault_ПоврежденияАвтомобилейСрезПоследних.Цвет,
	               |	Renault_ПоврежденияАвтомобилейСрезПоследних.РекомендуемаяДатаВыполнения,
	               |	Renault_ПоврежденияАвтомобилейСрезПоследних.Период
	               |ИЗ
	               |	РегистрСведений.Renault_ПоврежденияАвтомобилей.СрезПоследних КАК Renault_ПоврежденияАвтомобилейСрезПоследних
	               |ГДЕ
	               |	Renault_ПоврежденияАвтомобилейСрезПоследних.РаботаАктуальна = ИСТИНА
	               |	И Renault_ПоврежденияАвтомобилейСрезПоследних.Автомобиль = &Автомобиль";
				   
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПосчитатьКоличествоРекомендаций(Автомобиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Renault_ПоврежденияАвтомобилейСрезПоследних.Работа
	|ИЗ
	|	РегистрСведений.Renault_ПоврежденияАвтомобилей.СрезПоследних(, ) КАК Renault_ПоврежденияАвтомобилейСрезПоследних
	|ГДЕ
	|	Renault_ПоврежденияАвтомобилейСрезПоследних.РаботаАктуальна = ИСТИНА
	|	И Renault_ПоврежденияАвтомобилейСрезПоследних.Автомобиль = &Автомобиль";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Количество();
	
КонецФункции

Функция НайтиОбращениеНаСледующуюЗаписьПоРабочемуЛисту(IDK) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_CRM_ОбращениеВАвтоСервис.Ссылка
	               |ИЗ
	               |	Документ.Renault_CRM_ОбращениеВАвтоСервис КАК Renault_CRM_ОбращениеВАвтоСервис
	               |ГДЕ
	               |	Renault_CRM_ОбращениеВАвтоСервис.IDK = &IDK
	               |	И Renault_CRM_ОбращениеВАвтоСервис.ВидОбращения = &ВидОбращения";
				   
	Запрос.УстановитьПараметр("IDK", IDK);
	Запрос.УстановитьПараметр("ВидОбращения", Справочники.Renault_ВидыОбращенийВАвтосервис.ЗаписьНаСлВизит);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

Процедура Renault_ПроверкаКорректностиГосНомераПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если НЕ Справочники.Renault_ОбщиеНастройкиБазыДанных.ЭтаБаза.ГосНомерАвтоТолькоЛатиницей Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Для Каждого СтрокаИсточника из Источник Цикл
		Если СтрокаИсточника.ВидЗначения = Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер Тогда
			
			ЗапрещенныеСимволы = "";
			
			Если ЕстьКириллица(СтрокаИсточника.Значение, ЗапрещенныеСимволы) Тогда
				
				Сообщить("Установлена запись госномера только латиницей. Запрещенные кириллические символы: " + ВРег(ЗапрещенныеСимволы) + " запись отменена");
				
				Отказ = Истина;
				
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ЕстьКириллица(ИсходнаяСтрока, ЗапрещенныеСимволы = "") Экспорт 
	ЕстьКириллица=ложь; 
	ИсходнаяСтрока=СокрЛП(ИсходнаяСтрока); 
	Если СтрДлина(ИсходнаяСтрока)>0 Тогда 
		Для Сч=1 по СтрДлина(ИсходнаяСтрока) Цикл 
		Символ = НРег(Сред(ИсходнаяСтрока, Сч, 1)); 
		Если Найти("абвгдеёжзийклмнопрстуфхцчшщъыьэюя", Символ) Тогда
			
			ЗапрещенныеСимволы = ЗапрещенныеСимволы + Строка(Символ);
				ЕстьКириллица=истина; 
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 

	Возврат ЕстьКириллица; 
КонецФункции

Функция Renault_НайтиСоздатьДоговор(Контрагент) Экспорт
	
	Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты") Тогда
		Возврат Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
	ДопПараметры.Вставить("ВидДоговора", ВидДоговора);
	
	Договор = дкПолучитьДоговорВзаиморасчетов(Контрагент, ВидДоговора, , ДопПараметры, Ложь);  
	
	Возврат Договор;
	
КонецФункции

Процедура Renault_ПроверкаКорректностиVINПередЗаписью(Источник, Отказ) Экспорт
	
	Если РольДоступна("Renault_ОтключитьКонтрольЗаполненияVIN") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	
	Если НЕ Источник.ЭтоГруппа И (ЗначениеЗаполнено(Источник.VIN) И СтрДлина(Источник.VIN) < 13 И НЕ Источник.VIN = "ОТСУТСТВУЕТ") Тогда
		
		Сообщить("Необходимо указать VIN, длиной не менее 13 символов.");
		
		Отказ = Истина;
	
	КонецЕсли;
	
	
КонецПроцедуры

Процедура DMS_ЗаписьПодразделенияЦехаПриЗаписи(Источник, Отказ) Экспорт
	
	#Если Клиент Тогда
	
	ИсточникСсылка = Источник.Ссылка;
	ОпределениеДЦВЗН = Справочники.Renault_ОбщиеНастройкиБазыДанных.ЭтаБаза.ОпределениеДЦВЗН;
	
	Если ОпределениеДЦВЗН = 0 И ТипЗнч(Источник) = Тип("СправочникОбъект.ПодразделенияКомпании") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДЦПодразделения.Ссылка КАК ДилерскийЦентр,
		|	ДЦПодразделения.Подразделение КАК ПодразделениеЦех
		|ИЗ Справочник.CRM_ДилерскиеЦентры.ПодразделенияОрганизации КАК ДЦПодразделения
		|ГДЕ ДЦПодразделения.Подразделение = &Подразделение";
		Запрос.УстановитьПараметр("Подразделение", ИсточникСсылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат;
		КонецЕсли;
		
	ИначеЕсли ОпределениеДЦВЗН = 1 И ТипЗнч(Источник) = Тип("СправочникОбъект.Цеха") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДЦПодразделения.Ссылка КАК ДилерскийЦентр,
		|	ВЫБОР КОГДА ДЦПодразделения.Цех.Родитель = ЗНАЧЕНИЕ(Справочник.Цеха.ПустаяСсылка) ТОГДА
		|		ДЦПодразделения.Цех
		|	ИНАЧЕ
		|		ДЦПодразделения.Цех.Родитель
		|	КОНЕЦ КАК ПодразделениеЦех
		|ИЗ Справочник.CRM_ДилерскиеЦентры.АвтосервисЦеха КАК ДЦПодразделения
		|ГДЕ ВЫБОР КОГДА ДЦПодразделения.Цех.Родитель = ЗНАЧЕНИЕ(Справочник.Цеха.ПустаяСсылка) ТОГДА
		|		ДЦПодразделения.Цех
		|	ИНАЧЕ
		|		ДЦПодразделения.Цех.Родитель
		|	КОНЕЦ = &Цех";
		Запрос.УстановитьПараметр("Цех", ИсточникСсылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	//Бондаренко++ 20241029
	//Ответ = Вопрос("Если данная структурная единица относится к Renault, то необходимо указать принадлежность дилерскому центру! Указать ДЦ?", РежимДиалогаВопрос.ДаНет);
	//Если Ответ = КодВозвратаДиалога.Да Тогда
	//	Форма = Справочники.CRM_ДилерскиеЦентры.ПолучитьФормуВыбора();
	//	ДЦ = Форма.ОткрытьМодально();
	//	Если ДЦ <> Неопределено Тогда
	//		ОбДЦ = ДЦ.ПолучитьОбъект();
	//		Если ТипЗнч(Источник) = Тип("СправочникОбъект.ПодразделенияКомпании") Тогда
	//			НовСтр = ОбДЦ.ПодразделенияОрганизации.Добавить();
	//			НовСтр.Подразделение = ИсточникСсылка;
	//			ОбДЦ.Записать();
	//		ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.Цеха") Тогда
	//			Если ОбДЦ.АвтосервисЦеха.Найти(Источник.Ссылка, "Цех") = Неопределено Тогда
	//				НовСтр = ОбДЦ.АвтосервисЦеха.Добавить();
	//				НовСтр.Цех = ИсточникСсылка;
	//				ОбДЦ.Записать();
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	//Бондаренко-- 20241029
	
	#КонецЕсли
	
КонецПроцедуры

Процедура DMS_ЗаписьВидРемонтаПриЗаписи(Источник, Отказ) Экспорт
	
	#Если Клиент Тогда
	
	ИсточникСсылка = Источник.Ссылка;
	
	Набор = РегистрыСведений.Renault_СоответствияВидовРемонта.СоздатьНаборЗаписей();
	Набор.Отбор.ВидРемонта.Установить(ИсточникСсылка);
	Набор.Прочитать();
	ТекстВопроса = "Если вид ремонта """ + Источник.Наименование + """ относится к Renault, то необходимо указать классификацию Renault! Указать классификацию?";
	
	Если Набор.Количество() = 0 Тогда
	
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Форма = Перечисления.Renault_КлассификацияВидовРемонта.ПолучитьФормуВыбора();
			Классификация = Форма.ОткрытьМодально();
			Если Классификация <> Неопределено Тогда
				Запись = Набор.Добавить();
				Запись.ВидРемонта = ИсточникСсылка;
				Запись.КлассификацияRenault = Классификация;
			КонецЕсли;
		КонецЕсли;
		Набор.Записать();
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Набор[0].КлассификацияRenault) Тогда
		
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Форма = Перечисления.Renault_КлассификацияВидовРемонта.ПолучитьФормуВыбора();
			Классификация = Форма.ОткрытьМодально();
			Если Классификация <> Неопределено Тогда
				Запись = Набор[0];
				Запись.КлассификацияRenault = Классификация;
			КонецЕсли;
		КонецЕсли;
		Набор.Записать();
		
	КонецЕсли;
	
	#КонецЕсли
	
КонецПроцедуры

//Сергеев В.Н. DMSREN-920
Функция DMS_НайтиСоздатьДоговорНовый(Контрагент) Экспорт 
		
	Если НЕ ЗначениеЗаполнено(Контрагент) ИЛИ ТипЗнч(Контрагент) = Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты") Тогда
		Возврат Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	КонецЕсли;
	
	ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
	
	//Проверим есть ли уже договора данного вида
	ПустаяДата = Дата("00010101");
	
	Организация = Справочники.Организации.ПустаяСсылка();
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПустаяСсылка();

	ДатаДоговора = ТекущаяДата();
	
	ПраваПользователя = Неопределено;
	ДопПараметры = Неопределено;
	ВалютаВзаиморасчетов = Неопределено;
	ПоискПоВидуДеятельности = Ложь;
	
	ЕстьПодсистемаАвтосалон = зфЗащищенныеФункцииСервер.ПодсистемаДоступна("ЗащитаАвтосалон");
	
	ТекстОтбора = "";
	ДляАвтосалона  = ЕстьПодсистемаАвтосалон;
	ДляАвтосервиса = Истина;
	Внутренний     = Истина;
	
	// В первую очередь необходимо получить договор, удовлетворяющий 
	// всем условиям, в т.ч. у которого совпадают реквизиты "Подразделение компании" и "Организация".
	// Если такого договора нет, то необходимо попытаться получить договор, у которого хотя бы организация совпадет.
	// Если и такого договора нет, то пытаемся получить договор, у которого подразделение совпадает. 
	// Если и такого нет, то получаем любой договор (в пределах подчинения, разумеется).
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДоговорыВзаиморасчетов.Ссылка КАК Договор,
	|	ВЫБОР
	|		КОГДА ДоговорыВзаиморасчетов.Организация = &Организация
	|			И ДоговорыВзаиморасчетов.Подразделение = &Подразделение ТОГДА
	|			0
	|		КОГДА ДоговорыВзаиморасчетов.Организация = &Организация ТОГДА
	|			1
	|		КОГДА ДоговорыВзаиморасчетов.Подразделение = &Подразделение ТОГДА
	|			2
	|		ИНАЧЕ
	|			3
	|	КОНЕЦ КАК ПорядокПоПринадлежности,
	|	ДоговорыВзаиморасчетов.Основной КАК Основной,
	|	ДоговорыВзаиморасчетов.ДатаКонца КАК ДатаКонца,
	|	ДоговорыВзаиморасчетов.ДатаНачала КАК ДатаНачала
	|ИЗ
	|	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|ГДЕ
	|	ДоговорыВзаиморасчетов.Владелец = &Владелец И 
	|	ДоговорыВзаиморасчетов.ЭтоГруппа = ЛОЖЬ" + ?(ВидДоговора = Неопределено, "", " И 
	|	ДоговорыВзаиморасчетов.ВидДоговора = &ВидДоговора") + ТекстОтбора + "
	|	И (ДоговорыВзаиморасчетов.ДатаКонца = &ПустаяДата
	|				И ДоговорыВзаиморасчетов.ДатаНачала <= &ДатаДоговора
	|			ИЛИ &ДатаДоговора МЕЖДУ ДоговорыВзаиморасчетов.ДатаНачала И ДоговорыВзаиморасчетов.ДатаКонца)
	|	И ДоговорыВзаиморасчетов.ПометкаУдаления = ЛОЖЬ"+ ?(ВалютаВзаиморасчетов = Неопределено, "", "
	|	И ДоговорыВзаиморасчетов.ВалютаВзаиморасчетов = &ВалютаВзаиморасчетов") + "
	|УПОРЯДОЧИТЬ ПО
	|	Основной УБЫВ,
	|	ПорядокПоПринадлежности ВОЗР,
	|	ДатаКонца ВОЗР,
	|	ДатаНачала УБЫВ";
	
	Запрос.УстановитьПараметр("ВидДоговора",          ВидДоговора);
	Запрос.УстановитьПараметр("Владелец",             Контрагент);
	Запрос.УстановитьПараметр("Организация",          ПараметрыСеанса.Организация);
	Запрос.УстановитьПараметр("Подразделение",        ?(обЗначениеНеЗаполнено(ПодразделениеКомпании), ПараметрыСеанса.ПодразделениеКомпании, ПодразделениеКомпании));
	Запрос.УстановитьПараметр("ДатаДоговора",         ДатаДоговора);
	Запрос.УстановитьПараметр("ПустаяДата",           ПустаяДата);
	Запрос.УстановитьПараметр("ВалютаВзаиморасчетов", ВалютаВзаиморасчетов);
	Результат = Запрос.Выполнить();
	
	РазрешеноСоздавать = (Истина ИЛИ ВидДоговора = Перечисления.ВидыДоговоров.Продажа ИЛИ ВидДоговора = Перечисления.ВидыДоговоров.СКомиссионером);
	РазрешеноСоздавать = РазрешеноСоздавать И обПраво("АвтоматическоеСозданиеОсновногоДоговора",ПраваПользователя,,);
	
	Если НЕ Результат.Пустой() Тогда
		//Договор требуемого вида уже есть - вернем его
		Выборка = Результат.Выбрать(); 
		Выборка.Следующий();
		Возврат Выборка.Договор;
		
	ИначеЕсли РазрешеноСоздавать И (НЕ Контрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.КонтактноеЛицо) Тогда
		//иначе создадим новый договор
		
		Организация          = Справочники.Организации.ПустаяСсылка();
		Подразделение        = Справочники.ПодразделенияКомпании.ПустаяСсылка();
		ВалютаВзаиморасчетов = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
		#Если Клиент Тогда
			ДатаНачала= РабочаяДата+(Час(ТекущаяДата())*60*60)+(Минута(ТекущаяДата())*60)+(Секунда(ТекущаяДата()));
		#Иначе
			ДатаНачала = ТекущаяДата();
		#КонецЕсли
		ДатаНачала = НачалоДня(ДатаНачала);
		ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
		ТипСкидкиНаценки = Справочники.ТипыСкидок.ПустаяСсылка();
		
		Если обЗначениеНеЗаполнено(Организация) Тогда
			Организация = ПараметрыСеанса.Организация;
		КонецЕсли;
		
		Если обЗначениеНеЗаполнено(Подразделение) Тогда
			Подразделение = ПараметрыСеанса.ПодразделениеКомпании;
		КонецЕсли;
		
		ТипЦенПокупки = обПраво("ОсновнойТипЦенЗакупки", ПраваПользователя,,);
		ТипЦенПродажи = обПраво("ОсновнойТипЦенПродажи", ПраваПользователя,,);
		ТипЦенРабот   = обПраво("ОсновнойТипЦенРабот",   ПраваПользователя,,);
		
		Если ДопПараметры <> Неопределено Тогда
			ДопПараметры.Свойство("ТипЦенПокупки", ТипЦенПокупки);
			ДопПараметры.Свойство("ТипЦенПродажи", ТипЦенПродажи);
			ДопПараметры.Свойство("ТипЦенРабот",   ТипЦенРабот);
		КонецЕсли;
		
		НовыйДоговор = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
		НовыйДоговор.УстановитьНовыйКод();
		НовыйДоговор.Владелец             = Контрагент;
		НовыйДоговор.Организация          = Организация;
		НовыйДоговор.Подразделение        = Подразделение;
		НовыйДоговор.ВидДоговора          = ВидДоговора;
		НовыйДоговор.ТипДоговора          = Перечисления.ТипыДоговоров.Договор;
		НовыйДоговор.ДляАвтосалона        = ДляАвтосалона;
		НовыйДоговор.ДляАвтосервиса       = ДляАвтосервиса;
		НовыйДоговор.Внутренний           = Внутренний;
		НовыйДоговор.ВалютаВзаиморасчетов = ВалютаВзаиморасчетов;
		НовыйДоговор.ДатаНачала           = ДатаНачала;
		НовыйДоговор.ТипЦенПокупки        = ТипЦенПокупки;
		НовыйДоговор.ТипЦенПродажи        = ТипЦенПродажи;
		НовыйДоговор.ТипЦенРабот          = ТипЦенРабот;
		НовыйДоговор.ВидОплаты            = ВидОплаты;
		НовыйДоговор.ТипСкидкиНаценки     = ТипСкидкиНаценки;
		НовыйДоговор.Основной             = Истина;
		НовыйДоговор.ОтменаКонтроляСуммыКредита = обПраво("ОтменаКонтроляСуммыКредита",ПраваПользователя,,Подразделение);
		НовыйДоговор.СформироватьНаименование();
		НовыйДоговор.ПроверятьЗаполнение  = Ложь;
		НовыйДоговор.АвтоЗакрытиеСделок   = обПраво("АвтоЗакрытиеСделок",,,Организация);
		НовыйДоговор.ЕдиницаИзмеренияАвтоработВПечатныхФормах = обПраво("ЕдиницаИзмеренияАвтоработВПечатныхФормах"); // DMSREN-1228
		Попытка
			НовыйДоговор.Записать();
		Исключение
		КонецПопытки;
		
		Возврат НовыйДоговор.Ссылка;
	Иначе
		Возврат Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	КонецЕсли;

КонецФункции // DMS_НайтиСоздатьДоговорНовый()
 




