
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ПараметрыСеанса.Renault_ПраваПользователя.ИспользоватьПриоритетыПродажАвтомобилей Тогда
		Сообщить("Нет прав на использование функционала ""Приоритеты продаж автомобиля""!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекущийПользователь = ПараметрыСеанса.Пользователь;
		
		Если ЗначениеЗаполнено(ТекущийПользователь) Тогда 	
			Объект.Автор = ТекущийПользователь;
		Иначе
			Элементы.Автор.ТолькоПросмотр = Ложь;
		КонецЕсли;
	Иначе
		Если НЕ ЗначениеЗаполнено(Объект.Автор) Тогда
			Элементы.Автор.ТолькоПросмотр = Ложь;
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриоритетыАвтомобилейАвтомобильПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ПриоритетыАвтомобилей.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено И ЗначениеЗаполнено(ТекущаяСтрока.Автомобиль) Тогда
		ТабПриоритетыАвтомобилей = Объект.ПриоритетыАвтомобилей;
		
		Для Каждого Эл Из ТабПриоритетыАвтомобилей Цикл
			Если Эл <> ТекущаяСтрока И ТекущаяСтрока.Автомобиль = Эл.Автомобиль Тогда
				ТекущаяСтрока.Автомобиль = ПредопределенноеЗначение("Справочник.Автомобили.ПустаяСсылка");
				
				Сообщить("Выбранный автомобиль уже есть в табличной части!");
				Возврат;
			КонецЕсли;			
		КонецЦикла;
		
		ДатаПолученияПриоритета = ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Дата, ТекущаяДата());
		ТекущаяСтрока.СтарыйПриоритет = ПолучитьСтарыйПриоритет(ТекущаяСтрока.Автомобиль, ДатаПолученияПриоритета);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияИзменитьПриоритетыПродажАвтомобилей(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ФормаСписка = РегистрыСведений.Renault_ПриоритетыПродажАвтомобилей.ПолучитьФормуСписка();
		ФормаСписка.Отбор.Регистратор.Значение = Объект.Ссылка;
		ФормаСписка.Отбор.Регистратор.Использование = Истина;
		ФормаСписка.Отбор.Регистратор.ВидСравнения = ВидСравнения.Равно;
		
		ФормаСписка.ЭлементыФормы.РегистрСведенийСписок.НастройкаОтбора.Регистратор.Доступность = Ложь;
		
		ФормаСписка.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСтарыйПриоритет(Автомобиль, ДатаПолученияПриоритета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	
	Возврат  ОбъектСервер.ПолучитьСтарыйПриоритет(Автомобиль, ДатаПолученияПриоритета);
КонецФункции
