
Функция СформироватьОтчет(ПараметрыЗапроса,ТабличныйДокумент = Неопределено) Экспорт 
	
	Если ТабличныйДокумент = Неопределено Тогда
		ТабличныйДокумент = Новый ТабличныйДокумент;
	КонецЕсли; 
	
	Макет = ПолучитьМакет("МакетАС");
	
	ОбластьШапка  			  = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьДанные 			  = Макет.ПолучитьОбласть("ОбластьДанные");
	ОбластьИтогоПодразделение = Макет.ПолучитьОбласть("ОбластьИтогоПодразделение");
	ОбластьИтогоОрганизация   = Макет.ПолучитьОбласть("ОбластьИтогоОрганизация");
	
	Запрос = Новый Запрос;
	
	Для каждого ТекущийПараметр Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(ТекущийПараметр.Ключ, ТекущийПараметр.Значение);
	КонецЦикла; 

	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МоделиАвтомобилей.Модель,
		|	МоделиАвтомобилей.Ссылка
		|ПОМЕСТИТЬ мМаркиИМодели
		|ИЗ
		|	Справочник.CRM_МаркаАвтомобиля.МоделиАвтомобилей КАК МоделиАвтомобилей
		|ГДЕ
		|	НЕ МоделиАвтомобилей.Ссылка.ПометкаУдаления
		|	И (МоделиАвтомобилей.Ссылка = &Марка
		|			ИЛИ &Марка = ЗНАЧЕНИЕ(Справочник.CRM_МаркаАвтомобиля.ПустаяСсылка))
		|
		|СГРУППИРОВАТЬ ПО
		|	МоделиАвтомобилей.Ссылка,
		|	МоделиАвтомобилей.Модель
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АвтомобилейПервичныйИнтерес.Модель,
		|	АвтомобилейПервичныйИнтерес.Ссылка
		|ИЗ
		|	Справочник.CRM_МаркаАвтомобиля.МоделиАвтомобилейПервичныйИнтерес КАК АвтомобилейПервичныйИнтерес
		|ГДЕ
		|	НЕ АвтомобилейПервичныйИнтерес.Ссылка.ПометкаУдаления
		|	И (АвтомобилейПервичныйИнтерес.Ссылка = &Марка
		|			ИЛИ &Марка = ЗНАЧЕНИЕ(Справочник.CRM_МаркаАвтомобиля.ПустаяСсылка))
		|
		|СГРУППИРОВАТЬ ПО
		|	АвтомобилейПервичныйИнтерес.Модель,
		|	АвтомобилейПервичныйИнтерес.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АвтомобилейКоммерческоеПредложение.Модель,
		|	АвтомобилейКоммерческоеПредложение.Ссылка
		|ИЗ
		|	Справочник.CRM_МаркаАвтомобиля.МоделиАвтомобилейКоммерческоеПредложение КАК АвтомобилейКоммерческоеПредложение
		|ГДЕ
		|	НЕ АвтомобилейКоммерческоеПредложение.Ссылка.ПометкаУдаления
		|	И (АвтомобилейКоммерческоеПредложение.Ссылка = &Марка
		|			ИЛИ &Марка = ЗНАЧЕНИЕ(Справочник.CRM_МаркаАвтомобиля.ПустаяСсылка))
		|
		|СГРУППИРОВАТЬ ПО
		|	АвтомобилейКоммерческоеПредложение.Модель,
		|	АвтомобилейКоммерческоеПредложение.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АвтомобилейАвтосклад.Модель,
		|	АвтомобилейАвтосклад.Ссылка
		|ИЗ
		|	Справочник.CRM_МаркаАвтомобиля.МоделиАвтомобилейАвтосклад КАК АвтомобилейАвтосклад
		|ГДЕ
		|	НЕ АвтомобилейАвтосклад.Ссылка.ПометкаУдаления
		|	И (АвтомобилейАвтосклад.Ссылка = &Марка
		|			ИЛИ &Марка = ЗНАЧЕНИЕ(Справочник.CRM_МаркаАвтомобиля.ПустаяСсылка))
		|
		|СГРУППИРОВАТЬ ПО
		|	АвтомобилейАвтосклад.Модель,
		|	АвтомобилейАвтосклад.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	мМаркиИМодели.Модель,
		|	мМаркиИМодели.Ссылка
		|ПОМЕСТИТЬ МаркиИМодели
		|ИЗ
		|	мМаркиИМодели КАК мМаркиИМодели
		|
		|СГРУППИРОВАТЬ ПО
		|	мМаркиИМодели.Модель,
		|	мМаркиИМодели.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПродажиАвтомобилей.ДокументПродажи.Организация КАК Организация,
		|	ПродажиАвтомобилей.ПодразделениеКомпании КАК Подразделение,
		|	ПродажиАвтомобилей.Автомобиль КАК Автомобиль,
		|	ПродажиАвтомобилей.Автомобиль.VIN КАК VIN,
		|	ПродажиАвтомобилей.Автомобиль.Модель КАК Модель,
		|	МаркиИМодели.Ссылка КАК Марка,
		|	ПродажиАвтомобилей.Покупатель КАК Покупатель,
		|	ПродажиАвтомобилей.ДокументПродажи КАК ДокументПродажи,
		|	ПродажиАвтомобилей.ДокументПродажи.Дата КАК Дата,
		|	ПродажиАвтомобилей.СуммаОборот КАК Выручка,
		|	ЕСТЬNULL(ПродажиАвтомобилей.СебестоимостьОборот, СостояниеАвтомобилей.DEALER_PRICE_FULL) КАК Себестоимость,
		|	ПродажиАвтомобилей.СуммаОборот - ЕСТЬNULL(ПродажиАвтомобилей.СебестоимостьОборот, СостояниеАвтомобилей.DEALER_PRICE_FULL) КАК Доход,
		|	ПродажиАвтомобилей.ДокументПродажи.Менеджер КАК Менеджер,
		|	ЕСТЬNULL(ДоговораПродажАвтомобилей.Ссылка, ЗНАЧЕНИЕ(Документ.Renault_Договор.пустаяСсылка)) КАК ДоговорПродажи,
		|	ЕСТЬNULL(ДоговораПродажАвтомобилей.ВключитьОборудованиеВДоговор, ЛОЖЬ) КАК ВключитьОборудованиеВДоговор,
		|	ЕСТЬNULL(ДоговораПродажАвтомобилей.СтоимостьОпцийДилераВключитьВДоговор, 0) КАК СуммаДополнительногоОборудованияВключеннаяВДоговор,
		|	ПродажиАвтомобилей.СуммаСкидкиОборот КАК СуммаСкидки
		|ПОМЕСТИТЬ ПродажаАвто
		|ИЗ
		|	РегистрНакопления.ПродажиАвтомобилей.Обороты(
		|			&ДатаНачала,
		|			&мДатаОкончания,
		|			,
		|			(ПодразделениеКомпании = &Подразделение
		|				ИЛИ &Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ПустаяСсылка))
		|				И (ДокументПродажи.Организация = &Организация
		|					ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))) КАК ПродажиАвтомобилей
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_Договор.СоставДоговора КАК ДоговораПродажАвтомобилей
		|		ПО ПродажиАвтомобилей.Автомобиль = ДоговораПродажАвтомобилей.Автомобиль
		|			И (ПродажиАвтомобилей.Покупатель = ЕСТЬNULL(ДоговораПродажАвтомобилей.Ссылка.Клиент.Контрагент, ДоговораПродажАвтомобилей.Ссылка.Клиент))
		|			И ПродажиАвтомобилей.ДокументПродажи.Организация = ДоговораПродажАвтомобилей.Ссылка.Организация
		|			И (ДоговораПродажАвтомобилей.Ссылка.Проведен)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК СостояниеАвтомобилей
		|		ПО ПродажиАвтомобилей.Автомобиль.VIN = СостояниеАвтомобилей.VIN
		|			И ПродажиАвтомобилей.Автомобиль = СостояниеАвтомобилей.Автомобиль
		|		ЛЕВОЕ СОЕДИНЕНИЕ МаркиИМодели КАК МаркиИМодели
		|		ПО ПродажиАвтомобилей.Автомобиль.Модель = МаркиИМодели.Модель
		|ГДЕ
		|	НЕ МаркиИМодели.Модель ЕСТЬ NULL 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажаАвто.ДокументПродажи,
		|	ВзаиморасчетыКомпании.Сделка,
		|	ВзаиморасчетыКомпании.Контрагент,
		|	ВзаиморасчетыКомпании.ДоговорВзаиморасчетов
		|ПОМЕСТИТЬ ДвиженияДокументаПродажи
		|ИЗ
		|	ПродажаАвто КАК ПродажаАвто
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыКомпании КАК ВзаиморасчетыКомпании
		|		ПО ПродажаАвто.ДокументПродажи = ВзаиморасчетыКомпании.Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажаАвто.ДокументПродажи,
		|	ВзаиморасчетыКомпании.Сделка,
		|	ВзаиморасчетыКомпании.Контрагент,
		|	ВзаиморасчетыКомпании.ДоговорВзаиморасчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДвиженияДокументаПродажи.ДокументПродажи КАК ДокументПродажи,
		|	СУММА(ОстатокДолгаКонтрагентов.СуммаОстаток) КАК ДолгКлиента,
		|	ДвиженияДокументаПродажи.Сделка,
		|	ДвиженияДокументаПродажи.Контрагент
		|ПОМЕСТИТЬ ДолгиКонтрагентов
		|ИЗ
		|	ДвиженияДокументаПродажи КАК ДвиженияДокументаПродажи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыКомпании.Остатки(&мДатаОкончания, ) КАК ОстатокДолгаКонтрагентов
		|		ПО ДвиженияДокументаПродажи.Сделка = ОстатокДолгаКонтрагентов.Сделка
		|			И ДвиженияДокументаПродажи.Контрагент = ОстатокДолгаКонтрагентов.Контрагент
		|			И ДвиженияДокументаПродажи.ДоговорВзаиморасчетов = ОстатокДолгаКонтрагентов.ДоговорВзаиморасчетов
		|
		|СГРУППИРОВАТЬ ПО
		|	ДвиженияДокументаПродажи.ДокументПродажи,
		|	ДвиженияДокументаПродажи.Сделка,
		|	ДвиженияДокументаПродажи.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПродажаАвто.Организация,
		|	ПродажаАвто.Автомобиль,
		|	СУММА(ВзаиморасчетыПоАвтомобилям.СуммаРасход) КАК СуммаОплаты,
		|	МАКСИМУМ(ВзаиморасчетыПоАвтомобилям.Период) КАК ДатаОплаты,
		|	ПродажаАвто.ДокументПродажи,
		|	ПродажаАвто.Покупатель
		|ПОМЕСТИТЬ ВзаиморасчетыПоАвто
		|ИЗ
		|	ПродажаАвто КАК ПродажаАвто
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияДокументаПродажи КАК ДвиженияДокументаПродажи
		|		ПО ПродажаАвто.Покупатель = ДвиженияДокументаПродажи.Контрагент
		|			И ПродажаАвто.ДокументПродажи = ДвиженияДокументаПродажи.ДокументПродажи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыКомпании.Обороты(, &мДатаОкончания, Регистратор, ) КАК ВзаиморасчетыПоАвтомобилям
		|		ПО ПродажаАвто.Покупатель = ВзаиморасчетыПоАвтомобилям.Контрагент
		|			И (ВзаиморасчетыПоАвтомобилям.Сделка = ДвиженияДокументаПродажи.Сделка)
		|ГДЕ
		|	ЕСТЬNULL(ВзаиморасчетыПоАвтомобилям.СуммаРасход, 0) > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажаАвто.Организация,
		|	ПродажаАвто.Автомобиль,
		|	ПродажаАвто.Покупатель,
		|	ПродажаАвто.ДокументПродажи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПродажаАвто.Организация КАК Организация,
		|	ПродажаАвто.Автомобиль КАК Автомобиль,
		|	ПродажаАвто.Покупатель КАК Покупатель,
		|	СУММА(ЗаказНаряд.СуммаДокумента) КАК СуммаПодарков
		|ПОМЕСТИТЬ Подарки
		|ИЗ
		|	ПродажаАвто КАК ПродажаАвто
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд КАК ЗаказНаряд
		|		ПО ПродажаАвто.Автомобиль = ЗаказНаряд.Автомобиль
		|			И ПродажаАвто.Покупатель = ЗаказНаряд.Заказчик
		|			И (ЗаказНаряд.Проведен)
		|			И (ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт))
		|			И (ЗаказНаряд.ВидРемонта В (&ВидыРемонтаПодарок))
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажаАвто.Автомобиль,
		|	ПродажаАвто.Организация,
		|	ПродажаАвто.Покупатель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПродажаАвто.Организация КАК Организация,
		|	ПродажаАвто.Подразделение КАК Подразделение,
		|	ПродажаАвто.Автомобиль КАК Автомобиль,
		|	ПродажаАвто.VIN КАК VIN,
		|	ПродажаАвто.Модель КАК Модель,
		|	ПродажаАвто.Марка КАК Марка,
		|	ПродажаАвто.Покупатель КАК Покупатель,
		|	ПродажаАвто.ДокументПродажи КАК ДокументПродажи,
		|	ПродажаАвто.Дата КАК Дата,
		|	ПродажаАвто.ДоговорПродажи КАК ДоговорПродажи,
		|	ПродажаАвто.Выручка КАК Выручка,
		|	ПродажаАвто.Себестоимость КАК Себестоимость,
		|	ПродажаАвто.Доход КАК Доход,
		|	ПродажаАвто.Менеджер КАК Менеджер,
		|	ЕСТЬNULL(ВзаиморасчетыПоАвто.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОплаты,
		|	ЕСТЬNULL(ВзаиморасчетыПоАвто.СуммаОплаты, 0) КАК СуммаОплаты,
		|	ЕСТЬNULL(СтоимотьДопОборудованийПоДоговору.ДО, 0) КАК СуммаДополнительногоОборудования,
		|	ЕСТЬNULL(СтоимотьДопОборудованийПоДоговору.ДО_В_СуммеОформления, 0) КАК СуммаДО_ВСуммеОформления,
		|	ЕСТЬNULL(Подарки.СуммаПодарков, 0) КАК СуммаПодарков,
		|	1 КАК Оформлено,
		|	ПродажаАвто.СуммаСкидки КАК СуммаСкидки,
		|	ЕСТЬNULL(СтоимотьДопОборудованийПоДоговору.ДО_ПоПродажеЗЧ, 0) КАК СуммаДО_ПоПродаже_ЗЧ
		|ПОМЕСТИТЬ ДанныеОтчета
		|ИЗ
		|	ПродажаАвто КАК ПродажаАвто
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаиморасчетыПоАвто КАК ВзаиморасчетыПоАвто
		|		ПО ПродажаАвто.Организация = ВзаиморасчетыПоАвто.Организация
		|			И ПродажаАвто.Автомобиль = ВзаиморасчетыПоАвто.Автомобиль
		|			И ПродажаАвто.ДокументПродажи = ВзаиморасчетыПоАвто.ДокументПродажи
		|			И ПродажаАвто.Покупатель = ВзаиморасчетыПоАвто.Покупатель
		|		ЛЕВОЕ СОЕДИНЕНИЕ Подарки КАК Подарки
		|		ПО ПродажаАвто.Организация = Подарки.Организация
		|			И ПродажаАвто.Автомобиль = Подарки.Автомобиль
		|			И ПродажаАвто.Покупатель = Подарки.Покупатель
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДолгиКонтрагентов КАК ДолгиКонтрагентов
		|		ПО ПродажаАвто.ДокументПродажи = ДолгиКонтрагентов.ДокументПродажи
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ДоговораПродаж.Договор КАК Договор,
		|			ДоговораПродаж.ДО_ПоПродажеЗЧ КАК ДО_ПоПродажеЗЧ,
		|			ДоговораПродаж.ДО КАК ДО,
		|			ДоговораПродаж.ДО_В_СуммеОформления КАК ДО_В_СуммеОформления
		|		ИЗ
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ДоговораИЗаявки.Договор КАК Договор,
		|				СУММА(ДоговораИЗаявки.ДО_ПоПродажеЗЧ) КАК ДО_ПоПродажеЗЧ,
		|				СУММА(ЕСТЬNULL(ДоговораИЗаявки.ДО, 0) + ЕСТЬNULL(ДоговораИЗаявки.ДО_Договора, 0)) КАК ДО,
		|				СУММА(ДоговораИЗаявки.ДО_Договора) КАК ДО_В_СуммеОформления
		|			ИЗ
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					ДоговорПродажАвто.Ссылка КАК Договор,
		|					ЗаявкаНаСервис.Ссылка КАК ЗаявкаНаСервис,
		|					ЗаявкаНаСервис.ЗаказНаряд КАК ЗаказНаряд,
		|					МАКСИМУМ(ВЫБОР
		|							КОГДА ЕСТЬNULL(ЗаявкаНаСервис.ЗаказНаряд.СуммаРаботДокумента, 0) = 0
		|								ТОГДА ЕСТЬNULL(ЗаявкаНаСервис.ЗаказНаряд.СуммаНоменклатурыДокумента, 0)
		|							ИНАЧЕ 0
		|						КОНЕЦ) КАК ДО_ПоПродажеЗЧ,
		|					МАКСИМУМ(ВЫБОР
		|							КОГДА ЕСТЬNULL(ЗаявкаНаСервис.ЗаказНаряд.СуммаРаботДокумента, 0) = 0
		|								ТОГДА ЕСТЬNULL(ЗаявкаНаСервис.ЗаказНаряд.СуммаНоменклатурыДокумента, 0)
		|							ИНАЧЕ ЕСТЬNULL(ЗаявкаНаСервис.ЗаказНаряд.СуммаДокумента, 0)
		|						КОНЕЦ) КАК ДО,
		|					СУММА(ВЫБОР
		|							КОГДА ЕСТЬNULL(мСоставДоговора.ВключитьОборудованиеВДоговор, ЛОЖЬ)
		|								ТОГДА ЕСТЬNULL(мСоставДоговора.СтоимостьОпцийДилераВключитьВДоговор, 0)
		|							ИНАЧЕ 0
		|						КОНЕЦ) КАК ДО_Договора
		|				ИЗ
		|					Документ.Renault_Договор КАК ДоговорПродажАвто
		|						ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_Договор.СоставДоговора КАК мСоставДоговора
		|						ПО ДоговорПродажАвто.Ссылка = мСоставДоговора.Ссылка
		|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПродажаАвто КАК ПродажаАвто
		|						ПО ДоговорПродажАвто.Ссылка = ПродажаАвто.ДоговорПродажи
		|						ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ЗаявкаНаСервис КАК ЗаявкаНаСервис
		|						ПО (ЗаявкаНаСервис.ДоговорНаПродажуАвтомобиля = ДоговорПродажАвто.Ссылка)
		|							И (ЗаявкаНаСервис.Обращение.IDK = ДоговорПродажАвто.РабочийЛист)
		|							И (ЗаявкаНаСервис.Автомобиль.VIN = ДоговорПродажАвто.VIN)
		|							И (ЕСТЬNULL(ЗаявкаНаСервис.ЗаказНаряд.Проведен, ЛОЖЬ))
		|							И (ЕСТЬNULL(ЗаявкаНаСервис.ЗаказНаряд.Состояние, ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт))
		|							И (ЕСТЬNULL(ЗаявкаНаСервис.ЗаказНаряд.ВидРемонта, ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)) В (&ВидыРемонтаПодарок)
		|								ИЛИ ЕСТЬNULL(ЗаявкаНаСервис.ЗаказНаряд.ВидРемонта, ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)) В (&ВидыРемонтаДО))
		|							И (ЕСТЬNULL(ЗаявкаНаСервис.ЗаказНаряд, ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка))
		|				ГДЕ
		|					НЕ ЗаявкаНаСервис.Ссылка ЕСТЬ NULL 
		|				
		|				СГРУППИРОВАТЬ ПО
		|					ЗаявкаНаСервис.Ссылка,
		|					ДоговорПродажАвто.Ссылка,
		|					ЗаявкаНаСервис.ЗаказНаряд) КАК ДоговораИЗаявки
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ДоговораИЗаявки.Договор) КАК ДоговораПродаж) КАК СтоимотьДопОборудованийПоДоговору
		|		ПО ПродажаАвто.ДоговорПродажи = СтоимотьДопОборудованийПоДоговору.Договор
		|ГДЕ
		|	ЕСТЬNULL(ДолгиКонтрагентов.ДолгКлиента, 0) <= 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеОтчета.Организация КАК Организация,
		|	ДанныеОтчета.Подразделение КАК Подразделение,
		|	ДанныеОтчета.Автомобиль КАК Автомобиль,
		|	ДанныеОтчета.VIN,
		|	ДанныеОтчета.Модель,
		|	ДанныеОтчета.Марка,
		|	ДанныеОтчета.Покупатель,
		|	ДанныеОтчета.ДокументПродажи,
		|	ДанныеОтчета.Дата,
		|	ДанныеОтчета.ДоговорПродажи,
		|	ДанныеОтчета.Выручка,
		|	ДанныеОтчета.Себестоимость,
		|	ДанныеОтчета.Доход,
		|	ДанныеОтчета.Менеджер,
		|	ДанныеОтчета.ДатаОплаты,
		|	ДанныеОтчета.СуммаОплаты,
		|	ДанныеОтчета.СуммаДополнительногоОборудования,
		|	ДанныеОтчета.СуммаДО_ВСуммеОформления,
		|	ДанныеОтчета.СуммаПодарков,
		|	ДанныеОтчета.Оформлено,
		|	ЕСТЬNULL(ДанныеОтчета.Менеджер.Наименование, """") КАК МенеджерФИО,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ДанныеОтчета.Менеджер.ТабельныйНомер, """") = """"
		|			ТОГДА ЕСТЬNULL(ДанныеОтчета.Менеджер.Код, """")
		|		ИНАЧЕ ЕСТЬNULL(ДанныеОтчета.Менеджер.ТабельныйНомер, """")
		|	КОНЕЦ КАК МенеджерКод,
		|	ДанныеОтчета.СуммаСкидки,
		|	ДанныеОтчета.СуммаДО_ПоПродаже_ЗЧ
		|ИЗ
		|	ДанныеОтчета КАК ДанныеОтчета
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	Подразделение,
		|	Автомобиль
		|АВТОУПОРЯДОЧИВАНИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеОтчета.Организация КАК Организация,
		|	ДанныеОтчета.Подразделение КАК Подразделение,
		|	ДанныеОтчета.Оформлено КАК Оформлено,
		|	ДанныеОтчета.Себестоимость КАК Себестоимость,
		|	ДанныеОтчета.Выручка КАК Выручка,
		|	ДанныеОтчета.Доход КАК Доход,
		|	ДанныеОтчета.СуммаДополнительногоОборудования КАК СуммаДополнительногоОборудования,
		|	ДанныеОтчета.СуммаДО_ВСуммеОформления КАК СуммаДО_ВСуммеОформления,
		|	ДанныеОтчета.СуммаПодарков КАК СуммаПодарков,
		|	ДанныеОтчета.СуммаСкидки КАК СуммаСкидки,
		|	ДанныеОтчета.СуммаДО_ПоПродаже_ЗЧ КАК СуммаДО_ПоПродаже_ЗЧ
		|ИЗ
		|	ДанныеОтчета КАК ДанныеОтчета
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	Подразделение
		|ИТОГИ
		|	СУММА(Оформлено),
		|	СУММА(Себестоимость),
		|	СУММА(Выручка),
		|	СУММА(Доход),
		|	СУММА(СуммаДополнительногоОборудования),
		|	СУММА(СуммаДО_ВСуммеОформления),
		|	СУММА(СуммаПодарков),
		|	СУММА(СуммаСкидки),
		|	СУММА(СуммаДО_ПоПродаже_ЗЧ)
		|ПО
		|	Организация,
		|	Подразделение
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса[8].Выбрать();
	
	ВыборкаИтоговая = РезультатЗапроса[9].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбластьШапка.Параметры.Заполнить(ПараметрыЗапроса);
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ОбластьДанные.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ТабличныйДокумент.Вывести(ОбластьДанные);
	
	КонецЦикла; 
	
	Пока ВыборкаИтоговая.Следующий() Цикл
	
		ВыборкаПоПодразделениям = ВыборкаИтоговая.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
		Пока ВыборкаПоПодразделениям.Следующий() Цикл
		
			ОбластьИтогоПодразделение.Параметры.Заполнить(ВыборкаПоПодразделениям);
			ТабличныйДокумент.Вывести(ОбластьИтогоПодразделение);
		
		КонецЦикла; 
		
		ОбластьИтогоОрганизация.Параметры.Заполнить(ВыборкаИтоговая);
		ТабличныйДокумент.Вывести(ОбластьИтогоОрганизация);
				
	КонецЦикла; 
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.АвтоМасштаб 	 = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции
 