
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ЗакрыватьПриЗакрытииВладельца=Истина;
	ТЗПроизводители=ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","Производители");
	//.Скопировать(Новый Структура("Признак",Истина));
	Если ТипЗнч(ТЗПроизводители)=Тип("ТаблицаЗначений") Тогда
		Для Каждого Стр Из ТЗПроизводители Цикл
			Нов=Производители.Добавить();
			ЗаполнитьЗначенияСвойств(Нов,Стр);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.TecDocПодключен=ВладелецФормы.Объект.TecDocПодключен;
	Объект.СтрокаПодключенияTecDoc=ВладелецФормы.Объект.СтрокаПодключенияTecDoc;
	Элементы.ПроизводителиЗагрузитьИзТекДок.Доступность=Объект.TecDocПодключен;
КонецПроцедуры

&НаКлиенте
Процедура Флажки(Команда)
	БулевыйФлаг=Команда.Имя="УстановитьФлажки";
	Для Каждого СтрокаТаблицы Из Производители Цикл
	  СтрокаТаблицы.Признак = БулевыйФлаг;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзТекДок(Команда)
	ЗагрузитьИзТекДокНаСервере()
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзТекДокНаСервере()
	Обработка=РеквизитФормыВЗначение("Объект");
	ТЗПроизводители=Обработка.ПолучитьПроизводителейИзТекДок();
	ТЗПроизводители.Сортировать("Производитель Возр");
	Отбор=Новый Структура("ТРегПроизводитель");
	Для Каждого Стр Из ТЗПроизводители Цикл
		Отбор.ТРегПроизводитель=ТРег(Стр.Производитель);
		Мас=Производители.НайтиСтроки(Отбор);
		Если Мас.Количество()=0 Тогда
			Нов=Производители.Добавить();
			Нов.Производитель=Стр.Производитель;
			Нов.ТРегПроизводитель=Отбор.ТРегПроизводитель;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры	

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	ТЗПроизводители=Новый ТаблицаЗначений;
	ТЗПроизводители.Колонки.Добавить("Признак",Новый ОписаниеТипов("Булево"));
	ТЗПроизводители.Колонки.Добавить("Производитель",Новый ОписаниеТипов("Строка"));
	ТЗПроизводители.Колонки.Добавить("ТРегПроизводитель",Новый ОписаниеТипов("Строка"));
	Для Каждого Стр Из Производители Цикл
		ЕСли ПустаяСтрока(Стр.Производитель) Тогда Продолжить;КонецЕсли;
		Нов=ТЗПроизводители.Добавить();
		ЗаполнитьЗначенияСвойств(Нов,Стр);
	КонецЦикла;
	ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса","Производители",ТЗПроизводители);
КонецПроцедуры

&НаКлиенте
Процедура ПроизводителиПроизводительОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Отбор=Новый Структура("ТРегПроизводитель",ТРег(Текст));
	Мас=Производители.НайтиСтроки(Отбор);
	Если Мас.Количество()=0 ИЛИ (Мас.Количество()=1 и Мас[0]=Элементы.Производители.ТекущиеДанные) Тогда
		Элементы.Производители.ТекущиеДанные.ТРегПроизводитель=ТРег(Текст);
	Иначе
		//ДанныеВыбора=Новый СписокЗначений;
		//ДанныеВыбора.Добавить(Новый Структура("Value,Warning","","Введенный производитель """+Текст+""" уже имеетя в списке"));
		СтандартнаяОбработка=Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если ЭтаФорма.ВладелецФормы.Объект.ОтборПроизводители=Истина Тогда
		Если НетОтметокПроизводителей() Тогда
			ЭтаФорма.ВладелецФормы.Объект.ОтборПроизводители=Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере  //!!!
Функция НетОтметокПроизводителей()
	ТЗПроизводители=ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","Производители");
	Если ТипЗнч(ТЗПроизводители)<>тип("ТаблицаЗначений") Тогда Возврат Истина; КонецЕсли;
	Возврат ТЗПроизводители.Найти(Истина,"Признак")=Неопределено;
КонецФункции

