//Механизм работы с запросом на коммерческую помощь
//Обмен данными с RFORCE
//

//Работа с ЗКП
Функция ОбновитьСтатусыЗКП(Параметр = Неопределено) Экспорт
	
	ОтветСервера="";
	
	GUID_TZ = Новый ТаблицаЗначений;
	GUID_TZ.Колонки.Добавить("GUID");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ЗапросНаКоммерческуюПомощь.Ссылка
		|ИЗ
		|	Документ.Renault_ЗапросНаКоммерческуюПомощь КАК Renault_ЗапросНаКоммерческуюПомощь
		|ГДЕ
		|	Renault_ЗапросНаКоммерческуюПомощь.Проведен = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТЗ = GUID_TZ.Добавить();
		СтрокаТЗ.GUID = Строка(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор());
	КонецЦикла;
		
	ПараметрыЗапроса = Новый Структура("GUID_TZ",GUID_TZ);
		
	ВремяНачала=ТекущаяДата();
	
	Ответ = Неопределено;
	Если DMS_DataExchange.sendMessage(DMS_ОбщиеПовторныеФункции.ПараметрыHTTPСоединения(),,"ECARE_serv.readJournalAll",DMS_DataExchange.newPackage(ПараметрыЗапроса),Ответ) Тогда
		Для каждого стр из Ответ Цикл
			ЗКПСсылка = документы.Renault_ЗапросНаКоммерческуюПомощь.ПолучитьСсылку(Новый УникальныйИдентификатор(стр.GUID));  
			ОбЗКП = ЗКПСсылка.ПолучитьОбъект();	
			ЗаполнитьЗначенияСвойств(ОбЗКП, стр,"CaseNumber,CaseStatus,DATE_MODIFIED");
			ОбновитьЗначениеСтатусаЗапроса(ОбЗКП, стр);
			ОбЗКП.Записать();
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

Процедура ОбновитьЗначениеСтатусаЗапроса(ОбЗКП, ОтветСервера);
	
	CaseStatus = ОтветСервера.CaseStatus;
	DealerProactivityExpected = ОтветСервера.DealerProactivityExpected;
	
	Если CaseStatus = "New" Тогда
		ОбЗКП.СтатусЗапроса = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.ЗапросОтправлен;
	ИначеЕсли CaseStatus = "Open" Тогда
		Если не ЗначениеЗаполнено(ОбЗКП.ДатаОткрытияДосье) Тогда
			ОбЗКП.ДатаОткрытияДосье = ТекущаяДата();
		КонецЕсли;
		ОбЗКП.СтатусЗапроса = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.ЗапросНаРассмотренииSRC;
	ИначеЕсли CaseStatus = "Waiting for reply" Тогда
		ОбЗКП.СтатусЗапроса = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.ВОжиданииОтветаДилера;
	ИначеЕсли CaseStatus = "Answered" Тогда
		ОбЗКП.СтатусЗапроса = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.ЗапросНаРассмотренииSRC;
	ИначеЕсли CaseStatus = "Resolved" Тогда
		 Если ЗначениеЗаполнено(DealerProactivityExpected) Тогда
			 Если DealerProactivityExpected Тогда
				ОбЗКП.DateResolved = ТекущаяДата();
				ОбЗКП.СтатусЗапроса = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.Одобрено;
			Иначе
				ОбЗКП.СтатусЗапроса = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.НеОдобрено;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли CaseStatus = "Closed" Тогда
		Если не ЗначениеЗаполнено(ОбЗКП.ДатаЗакрытияДосье) Тогда
			ОбЗКП.ДатаЗакрытияДосье = ТекущаяДата();
		КонецЕсли;
		ОбЗКП.СтатусЗапроса = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.Закрыто;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьСправочники (Параметр = Неопределено) Экспорт
	
	Ответ = Неопределено;
	Если DMS_DataExchange.sendMessage(DMS_ОбщиеПовторныеФункции.ПараметрыHTTPСоединения(),"Consolidation","ECARE_serv.GetDictionary",,Ответ) Тогда
		Если Ответ.Свойство ("ProblemsAfterSales") Тогда
			ЗагрузитьСправочник("DMS_ПроблемыПослеПродажногоОбслуживания", Ответ.ProblemsAfterSales);
		КонецЕсли;
		Если Ответ.Свойство ("ProblemsSales") Тогда
			ЗагрузитьСправочник("DMS_ПроблемыПродаж", Ответ.ProblemsSales);
		КонецЕсли;
		Если Ответ.Свойство ("FeelingsClients") Тогда
			ЗагрузитьСправочник("DMS_ОщущенияКлиентов", Ответ.FeelingsClients);
		КонецЕсли;
		Если Ответ.Свойство ("CustomersWishes") Тогда
			ЗагрузитьСправочник("DMS_ПожеланияКлиентов", Ответ.CustomersWishes);
		КонецЕсли;
		Если Ответ.Свойство ("ProblematicSystemsAuto") Тогда
			ЗагрузитьСправочник("DMS_ПроблемныеСистемыАвто", Ответ.ProblematicSystemsAuto);
			Если Ответ.Свойство ("DetailingQualityProblems") Тогда
				ЗагрузитьСправочник("DMS_ДетализацииПроблемКачества", Ответ.DetailingQualityProblems, "DMS_ПроблемныеСистемыАвто");
			КонецЕсли;
		КонецЕсли;
		Если Ответ.Свойство ("CharactersSalesProblems") Тогда
			ЗагрузитьСправочник("DMS_ХарактерыПроблемПродаж", Ответ.CharactersSalesProblems);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьСправочник (НаименованиеСправочника, ТЗДанных, НаименованиеВладельца = "")
	
	Для Каждого СтрТЗ из ТЗДанных Цикл
		Если НаименованиеВладельца <> "" Тогда
			Владелец = Справочники[НаименованиеВладельца].НайтиПоРеквизиту("ЦентральныйGUID", СтрТЗ.Владелец);
			Справочник = Справочники[НаименованиеСправочника].НайтиПоРеквизиту("ЦентральныйGUID", СтрТЗ.GUID,,Владелец);
		Иначе
			Справочник = Справочники[НаименованиеСправочника].НайтиПоРеквизиту("ЦентральныйGUID", СтрТЗ.GUID);
		КонецЕсли;
		Если не ЗначениеЗаполнено(Справочник) Тогда
			Объект = Справочники[НаименованиеСправочника].СоздатьЭлемент();
			Объект.УстановитьНовыйКод ();
			Объект.ЦентральныйGUID =  СтрТЗ.GUID;
			Если НаименованиеВладельца <> "" Тогда
				Объект.Владелец = Владелец;
			КонецЕсли;
		Иначе
			Объект = Справочник.ПолучитьОбъект();
		КонецЕсли;
		Объект.Наименование = СтрТЗ.Наименование;
		Объект.ПометкаУдаления = СтрТЗ.ПометкаУдаления;
		Если ТЗДанных.Колонки.Найти("Идентификатор") <> Неопределено Тогда
			Объект.Идентификатор = СтрТЗ.Идентификатор;
		КонецЕсли;
		Объект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

