
Функция ПолучитьПрокси()
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	
	// Сериализация полученной таблицы и передача ее в web-сервис
	Адрес = Настройки.АдресWsGate+"ws/RenaultCommercialAction.1cws?wsdl";
	ПарольWS = Настройки.ПарольДоступаКВебСервисам;
	ЛогинWS = Настройки.ЛогинДоступаКВебСервисам;
	ОпределениеСервиса = Новый WSОпределения(Адрес, ЛогинWS, ПарольWS);
	ВебСервис=Новый WSПрокси(ОпределениеСервиса,"http://renault.ru/WSGate/RenaultCommercialAction","Renault_CommercialAction","Renault_CommercialActionSoap12",,60);
	
	ВебСервис.Пользователь	 = ЛогинWS;
	ВебСервис.Пароль		 = ПарольWS;
	
	Возврат ВебСервис;
	
КонецФункции

Процедура Renault_ЗагрузкаКоммерческихАкций(Параметры=Неопределено) Экспорт
	
	ДатаАктуальности = Константы.Renault_ДатаАктуальностиКоммерческихАкций.Получить();
	ДилерскиеЦентры = ПолучитьДилерскиеЦенты();
	МассивБИР = ДилерскиеЦентры.ВыгрузитьКолонку("BIR");
	
	Если НЕ Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ИспользоватьHTTPСервисы Тогда
		
		Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
		МассивБИРXDTO = Сериализатор.ЗаписатьXDTO(МассивБИР);
		ВебСервис = ПолучитьПрокси();
		Ответ = Вебсервис.GetForBir(ДатаАктуальности, МассивБИРXDTO); //Ответ = Вебсервис.Get(ДатаАктуальности);
		
	Иначе
		
		Ответ = Неопределено;
		ПараметрыЗапроса = Новый Структура();
		ПараметрыЗапроса.Вставить("ДатаАктуальности", ДатаАктуальности);
		ПараметрыЗапроса.Вставить("BIR", МассивБИР);
		Если Не DMS_DataExchange.sendMessage(DMS_ОбщиеПовторныеФункции.ПараметрыHTTPСоединения(),,"DMS_CommercialActions.CommercialActionGET",DMS_DataExchange.newPackage(ПараметрыЗапроса),Ответ) Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Данные = Ответ.Получить();
	
	КоммАкции = Данные.КоммАкции;
	КУдалению = Данные.КУдалению;
	УсловияАкции = Данные.УсловияАкции;
	ГодаВыпуска = Данные.ГодаВыпуска;
	
	// Загружаем модели и версии
	Попытка
		Renault_ЗагрузкаТарифа.ЗагрузитьМодели();
		Renault_ЗагрузкаТарифа.ЗагрузитьНастройкиПоМаркам(Дата("00010101"));
		Renault_ЗагрузкаТарифа.ЗагрузитьВерсии();
	Исключение
		Инфо = ИнформацияОбОшибке();
		ДанныеОшибки = ПодробноеПредставлениеОшибки(Инфо);
		
		ЗаписьЖурналаРегистрации("Загрузка справочника модели",УровеньЖурналаРегистрации.Ошибка,,, ДанныеОшибки); 	
	КонецПопытки;
	
	// Сопоставление моделей и версий
	Запрос = Новый Запрос;
			
	Запрос.УстановитьПараметр("КоммАкции", УсловияАкции); 
			
	Запрос.Текст = "ВЫБРАТЬ
	               |	КоммАкции.КодМодели,
	               |	КоммАкции.КодВерсии,
	               |	КоммАкции.НачалоДействия,
	               |	КоммАкции.ОкончаниеДействия,
	               |	КоммАкции.КоммерческаяАкцияGUID,
	               |	КоммАкции.ЗначениеСкидки,
	               |	КоммАкции.ЗначениеСкидкиУчастиеДилера,
	               |	КоммАкции.ВариантСкидки
	               |ПОМЕСТИТЬ ВТ_КоммАкции
	               |ИЗ
	               |	&КоммАкции КАК КоммАкции
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(Модели.Ссылка, ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)) КАК Модель,
	               |	ЕСТЬNULL(ВариантыКомплектации.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка)) КАК Версия,
	               |	ВТ_КоммАкции.КоммерческаяАкцияGUID КАК КоммерческаяАкцияGUID,
	               |	ВТ_КоммАкции.ЗначениеСкидки,
	               |	ВТ_КоммАкции.ЗначениеСкидкиУчастиеДилера,
	               |	ВТ_КоммАкции.ВариантСкидки,
	               |	ВТ_КоммАкции.КодМодели,
	               |	ВТ_КоммАкции.КодВерсии,
	               |	ВТ_КоммАкции.НачалоДействия,
	               |	ВТ_КоммАкции.ОкончаниеДействия
	               |ИЗ
	               |	ВТ_КоммАкции КАК ВТ_КоммАкции
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Модели КАК Модели
	               |		ПО ВТ_КоммАкции.КодМодели = Модели.Артикул
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектации КАК ВариантыКомплектации
	               |		ПО (Модели.Ссылка = ВариантыКомплектации.Владелец)
	               |			И ВТ_КоммАкции.КодВерсии = ВариантыКомплектации.Артикул";
	
	ТаблицаСтоимость = Запрос.Выполнить().Выгрузить();   
	
	НачатьТранзакцию();
	
	Для Каждого Строка Из КоммАкции Цикл
		
		СправочникСсылка = Справочники.DMS_КоммерческиеАкции.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.КоммерческаяАкцияGUID));
		
		Если ЗначениеЗаполнено(СправочникСсылка) И СтрНайти(Строка(СправочникСсылка), "<Объект не найден>") = 0 Тогда
			КоммАкция = СправочникСсылка.ПолучитьОбъект();
		Иначе
			КоммАкция = Справочники.DMS_КоммерческиеАкции.СоздатьЭлемент();
			КоммАкция.УстановитьСсылкуНового(СправочникСсылка);
		КонецЕсли;
		
		КоммАкция.Условия.Очистить();
		КоммАкция.ГодыВыпуска.Очистить();
		КоммАкция.ДилерскиеЦентры.Очистить();
		
		ЗаполнитьЗначенияСвойств(КоммАкция, Строка,, "ВладелецАкции");
		КоммАкция.ВладелецАкции = Перечисления.DMS_ВладельцыСервисов[Строка.ВладелецАкции];
		Если ЗначениеЗаполнено(Строка.РодительНаименование) Тогда
			Если ЗначениеЗаполнено(Справочники.DMS_КоммерческиеАкции.НайтиПоНаименованию(Строка.РодительНаименование)) Тогда
				КоммАкция.Родитель = Справочники.DMS_КоммерческиеАкции.НайтиПоНаименованию(Строка.РодительНаименование);
			Иначе
				Родитель = Справочники.DMS_КоммерческиеАкции.СоздатьГруппу();
				Родитель.Наименование = Строка.РодительНаименование;
				Родитель.Записать();
				КоммАкция.Родитель =  Родитель.Ссылка;
			КонецЕсли;
		КонецЕсли;
		
		НайденныеУсловия = ТаблицаСтоимость.НайтиСтроки(Новый Структура("КоммерческаяАкцияGUID", Строка.КоммерческаяАкцияGUID));
		
		Для Каждого Стр Из НайденныеУсловия Цикл
			
			Если ЗначениеЗаполнено(Стр.Модель) И ЗначениеЗаполнено(Стр.КодМодели) и НЕ ЗначениеЗаполнено(Стр.КодВерсии) Тогда
				НоваяСтрока = КоммАкция.Условия.Добавить();
				НоваяСтрока.Объект = Стр.Модель;
			ИначеЕсли ЗначениеЗаполнено(Стр.Версия) И ЗначениеЗаполнено(Стр.КодВерсии) Тогда
				НоваяСтрока = КоммАкция.Условия.Добавить();
				НоваяСтрока.Объект = Стр.Версия;
			Иначе
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр,, "ВариантСкидки");
			НоваяСтрока.ВариантСкидки = Перечисления.DMS_ВариантыСкидки[Стр.ВариантСкидки];
			
		КонецЦикла;
		
		НайденныеГода = ГодаВыпуска.НайтиСтроки(Новый Структура("КоммерческаяАкцияGUID", Строка.КоммерческаяАкцияGUID));
		
		Для Каждого Стр Из НайденныеГода Цикл
					
			ЗаполнитьЗначенияСвойств(КоммАкция.ГодыВыпуска.Добавить(), Стр);
			
		КонецЦикла;
		
		КоммАкция.ДилерскиеЦентры.Загрузить(ДилерскиеЦентры);
		
		Попытка
			КоммАкция.ОбменДанными.Загрузка = Истина;
			КоммАкция.Записать();
		Исключение
			ЗаписьЖурналаРегистрации("Загрузка коммерческих акций",,Метаданные.Справочники.DMS_КоммерческиеАкции, КоммАкция.Ссылка, ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	Константы.Renault_ДатаАктуальностиКоммерческихАкций.Установить(ТекущаяДата());
	
	РегистрыСведений.DMS_МониторингРегламентныхЗаданий.ЗавершениеЗадания(
	ПредопределенноеЗначение("Справочник.DMS_НастройкаРегламентныхЗаданий.ЗагрузкаКоммерческихАкций"),
	ТекущаяДатаСеанса());

КонецПроцедуры

Функция ПолучитьДилерскиеЦенты()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	CRM_ДилерскиеЦентры.Ссылка КАК ДилерскийЦентр,
	|	CRM_ДилерскиеЦентры.BIR_Distri КАК BIR
	|ИЗ
	|	Справочник.CRM_ДилерскиеЦентры КАК CRM_ДилерскиеЦентры
	|ГДЕ
	|	CRM_ДилерскиеЦентры.BIR_Distri <> """"
	|	И НЕ CRM_ДилерскиеЦентры.ПометкаУдаления";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

//// Получить скидку по виду
////
//// Параметры:
////  Модель	 - Модель - модель авто
////  Версия	 - 	ВариантыКомплектации - вариант комплектации
////  Условие	 - 	Строка - Список условий: ТрейдИн, Утилизация, Прочее
////  Дата	 - 	Дата - дата
//Функция ПолучитьСкидкуПоВиду(Модель, Версия, Вид, Знач Дата = Неопределено) Экспорт

//	Если Дата = Неопределено Тогда
//		Дата = НачалоДня(ТекущаяДата());	
//	Иначе
//		Дата = НачалоДня(Дата);	
//	КонецЕсли;
//	
//	Запрос = Новый Запрос;
//			
//	Запрос.УстановитьПараметр("Дата", Дата);
//	Запрос.УстановитьПараметр("Модель", Модель);
//	Запрос.УстановитьПараметр("Версия", Версия);
//	Запрос.УстановитьПараметр("Вид", Вид); 
//			
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	МАКСИМУМ(Renault_КоммерческиеАкции.ЗначениеСкидки) КАК ЗначениеСкидки,
//	               |	МАКСИМУМ(Renault_КоммерческиеАкции.ЗначениеСкидкиУчастиеДилера) КАК ЗначениеСкидкиУчастиеДилера,
//	               |	Renault_КоммерческиеАкции.КлючСтроки КАК КлючСтроки,
//	               |	Renault_КоммерческиеАкции.УсловиеПредоставления,
//	               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID КАК КоммерческаяАкцияGUID
//	               |ИЗ
//	               |	РегистрСведений.Renault_КоммерческиеАкции КАК Renault_КоммерческиеАкции
//	               |ГДЕ
//	               |	Renault_КоммерческиеАкции.ДатаНачалаДействия <= &Дата
//	               |	И (Renault_КоммерческиеАкции.ДатаОкончанияДействия >= &Дата
//	               |			ИЛИ Renault_КоммерческиеАкции.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))
//	               |	И Renault_КоммерческиеАкции.Модель = &Модель
//	               |	И Renault_КоммерческиеАкции.Версия = &Версия
//	               |	И Renault_КоммерческиеАкции.Вид = &Вид
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	Renault_КоммерческиеАкции.КлючСтроки,
//	               |	Renault_КоммерческиеАкции.УсловиеПредоставления,
//	               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID
//	               |
//	               |ОБЪЕДИНИТЬ ВСЕ
//	               |
//	               |ВЫБРАТЬ
//	               |	МАКСИМУМ(Renault_КоммерческиеАкции.ЗначениеСкидки),
//	               |	МАКСИМУМ(Renault_КоммерческиеАкции.ЗначениеСкидкиУчастиеДилера),
//	               |	Renault_КоммерческиеАкции.КлючСтроки,
//	               |	Renault_КоммерческиеАкции.УсловиеПредоставления,
//	               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID
//	               |ИЗ
//	               |	РегистрСведений.Renault_КоммерческиеАкции КАК Renault_КоммерческиеАкции
//	               |ГДЕ
//	               |	Renault_КоммерческиеАкции.ДатаНачалаДействия <= &Дата
//	               |	И (Renault_КоммерческиеАкции.ДатаОкончанияДействия >= &Дата
//	               |			ИЛИ Renault_КоммерческиеАкции.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))
//	               |	И Renault_КоммерческиеАкции.Модель = &Модель
//	               |	И Renault_КоммерческиеАкции.Версия = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка)
//	               |	И Renault_КоммерческиеАкции.Вид = &Вид
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	Renault_КоммерческиеАкции.КлючСтроки,
//	               |	Renault_КоммерческиеАкции.УсловиеПредоставления,
//	               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID
//	               |
//	               |ОБЪЕДИНИТЬ ВСЕ
//	               |
//	               |ВЫБРАТЬ
//	               |	МАКСИМУМ(Renault_КоммерческиеАкции.ЗначениеСкидки),
//	               |	МАКСИМУМ(Renault_КоммерческиеАкции.ЗначениеСкидкиУчастиеДилера),
//	               |	Renault_КоммерческиеАкции.КлючСтроки,
//	               |	Renault_КоммерческиеАкции.УсловиеПредоставления,
//	               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID
//	               |ИЗ
//	               |	РегистрСведений.Renault_КоммерческиеАкции КАК Renault_КоммерческиеАкции
//	               |ГДЕ
//	               |	Renault_КоммерческиеАкции.ДатаНачалаДействия <= &Дата
//	               |	И (Renault_КоммерческиеАкции.ДатаОкончанияДействия >= &Дата
//	               |			ИЛИ Renault_КоммерческиеАкции.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))
//	               |	И Renault_КоммерческиеАкции.Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
//	               |	И Renault_КоммерческиеАкции.Версия = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка)
//	               |	И Renault_КоммерческиеАкции.Вид = &Вид
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	Renault_КоммерческиеАкции.КлючСтроки,
//	               |	Renault_КоммерческиеАкции.УсловиеПредоставления,
//	               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID
//	               |
//	               |УПОРЯДОЧИТЬ ПО
//	               |	ЗначениеСкидки УБЫВ
//	               |ИТОГИ
//	               |	МАКСИМУМ(ЗначениеСкидки),
//	               |	МАКСИМУМ(ЗначениеСкидкиУчастиеДилера),
//	               |	МАКСИМУМ(КоммерческаяАкцияGUID)
//	               |ПО
//	               |	КлючСтроки";
//	
//	ВыборкаКлючСтроки = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//	
//	Пока ВыборкаКлючСтроки.Следующий() Цикл
//		
//		Выборка = ВыборкаКлючСтроки.Выбрать();
//		
//		СписокУсловий = Новый Массив;
//		Пока Выборка.Следующий() Цикл
//			СписокУсловий.Добавить(Выборка.УсловиеПредоставления);
//		КонецЦикла;
//		
//		ВозвращаемоеЗначение = Новый Структура;
//		ВозвращаемоеЗначение.Вставить("КоммерческаяАкцияGUID", ВыборкаКлючСтроки.КоммерческаяАкцияGUID);
//		ВозвращаемоеЗначение.Вставить("СписокУсловий", СписокУсловий);
//		ВозвращаемоеЗначение.Вставить("ЗначениеСкидки", ВыборкаКлючСтроки.ЗначениеСкидки);
//		ВозвращаемоеЗначение.Вставить("ЗначениеСкидкиУчастиеДилера", ВыборкаКлючСтроки.ЗначениеСкидкиУчастиеДилера);
//		
//		// Интересует только одна скидка
//		Прервать;
//		
//	КонецЦикла;

//	Возврат	ВозвращаемоеЗначение;
//	
//КонецФункции
//Андрианова Начало 16.01.2017
//Функция ПолучитьВсеСкидки(Модель, Версия, ТипАвтомобиля, Знач Дата = Неопределено) Экспорт
Функция ПолучитьВсеСкидки(VIN, Модель, Версия, ТипАвтомобиля, ГодВыпуска = 0, Знач Дата = Неопределено) Экспорт
//Андрианова Конец 16.01.2017

	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = НачалоДня(ТекущаяДата());	
	Иначе
		Дата = НачалоДня(Дата);	
	КонецЕсли;
	
	Если ТипАвтомобиля = "Новый" Тогда
		ВидУсловия = Перечисления.Renault_ВидыУсловийПредоставленияСкидок.НовыйАвтомобиль;		
	ИначеЕсли ТипАвтомобиля = "Подержанный" Тогда
		ВидУсловия = Перечисления.Renault_ВидыУсловийПредоставленияСкидок.ПодержанныйАвтомобиль;	
	ИначеЕсли ТипАвтомобиля = "Демо" Тогда
		ВидУсловия = Перечисления.Renault_ВидыУсловийПредоставленияСкидок.ДемоАвтомобиль;	
	КонецЕсли;	
	
	//Запрос = Новый Запрос;
	//		
	//Запрос.УстановитьПараметр("Дата", Дата);
	//Запрос.УстановитьПараметр("Модель", Модель);
	//Запрос.УстановитьПараметр("Версия", Версия);
	//Запрос.УстановитьПараметр("ВидУсловия", ВидУсловия);
	////Андрианова Начало 13.01.2017
	//Запрос.УстановитьПараметр("ГодВыпуска", ГодВыпуска);
	////Андрианова Конец 13.01.2017
	//	
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	Renault_КоммерческиеАкции.КлючСтроки КАК КлючСтроки,
	//               |	МАКСИМУМ(Renault_КоммерческиеАкции.ЗначениеСкидки) КАК ЗначениеСкидки,
	//               |	МАКСИМУМ(Renault_КоммерческиеАкции.ЗначениеСкидкиУчастиеДилера) КАК ЗначениеСкидкиУчастиеДилера,
	//               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID КАК КоммерческаяАкцияGUID,
	//               |	Renault_КоммерческиеАкции.ВариантСкидки КАК ВариантСкидки,
	//               |	Renault_КоммерческиеАкции.Вид КАК Вид
	//               |ПОМЕСТИТЬ ВТ_Подготовка
	//               |ИЗ
	//               |	РегистрСведений.Renault_КоммерческиеАкции КАК Renault_КоммерческиеАкции
	//               |ГДЕ
	//               |	Renault_КоммерческиеАкции.ДатаНачалаДействия <= &Дата
	//               |	И (Renault_КоммерческиеАкции.ДатаОкончанияДействия >= &Дата
	//               |			ИЛИ Renault_КоммерческиеАкции.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))
	//               |	И Renault_КоммерческиеАкции.Модель = &Модель
	//               |	И Renault_КоммерческиеАкции.Версия = &Версия
	//               |	И Renault_КоммерческиеАкции.УсловиеПредоставления.ВидУсловия = &ВидУсловия
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	Renault_КоммерческиеАкции.КлючСтроки,
	//               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID,
	//               |	Renault_КоммерческиеАкции.ВариантСкидки,
	//               |	Renault_КоммерческиеАкции.Вид
	//               |
	//               |ОБЪЕДИНИТЬ ВСЕ
	//               |
	//               |ВЫБРАТЬ
	//               |	Renault_КоммерческиеАкции.КлючСтроки,
	//               |	МАКСИМУМ(Renault_КоммерческиеАкции.ЗначениеСкидки),
	//               |	МАКСИМУМ(Renault_КоммерческиеАкции.ЗначениеСкидкиУчастиеДилера),
	//               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID,
	//               |	Renault_КоммерческиеАкции.ВариантСкидки,
	//               |	Renault_КоммерческиеАкции.Вид
	//               |ИЗ
	//               |	РегистрСведений.Renault_КоммерческиеАкции КАК Renault_КоммерческиеАкции
	//               |ГДЕ
	//               |	Renault_КоммерческиеАкции.ДатаНачалаДействия <= &Дата
	//               |	И (Renault_КоммерческиеАкции.ДатаОкончанияДействия >= &Дата
	//               |			ИЛИ Renault_КоммерческиеАкции.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))
	//               |	И Renault_КоммерческиеАкции.Модель = &Модель
	//               |	И Renault_КоммерческиеАкции.Версия = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка)
	//               |	И Renault_КоммерческиеАкции.УсловиеПредоставления.ВидУсловия = &ВидУсловия
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	Renault_КоммерческиеАкции.КлючСтроки,
	//               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID,
	//               |	Renault_КоммерческиеАкции.ВариантСкидки,
	//               |	Renault_КоммерческиеАкции.Вид
	//               |
	//               |ОБЪЕДИНИТЬ ВСЕ
	//               |
	//               |ВЫБРАТЬ
	//               |	Renault_КоммерческиеАкции.КлючСтроки,
	//               |	МАКСИМУМ(Renault_КоммерческиеАкции.ЗначениеСкидки),
	//               |	МАКСИМУМ(Renault_КоммерческиеАкции.ЗначениеСкидкиУчастиеДилера),
	//               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID,
	//               |	Renault_КоммерческиеАкции.ВариантСкидки,
	//               |	Renault_КоммерческиеАкции.Вид
	//               |ИЗ
	//               |	РегистрСведений.Renault_КоммерческиеАкции КАК Renault_КоммерческиеАкции
	//               |ГДЕ
	//               |	Renault_КоммерческиеАкции.ДатаНачалаДействия <= &Дата
	//               |	И (Renault_КоммерческиеАкции.ДатаОкончанияДействия >= &Дата
	//               |			ИЛИ Renault_КоммерческиеАкции.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))
	//               |	И Renault_КоммерческиеАкции.Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
	//               |	И Renault_КоммерческиеАкции.Версия = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка)
	//               |	И Renault_КоммерческиеАкции.УсловиеПредоставления.ВидУсловия = &ВидУсловия
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	Renault_КоммерческиеАкции.КлючСтроки,
	//               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID,
	//               |	Renault_КоммерческиеАкции.ВариантСкидки,
	//               |	Renault_КоммерческиеАкции.Вид
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ВТ_Подготовка.КлючСтроки КАК КлючСтроки,
	//               |	ВТ_Подготовка.ЗначениеСкидки КАК ЗначениеСкидки,
	//               |	ВТ_Подготовка.ЗначениеСкидкиУчастиеДилера КАК ЗначениеСкидкиУчастиеДилера,
	//               |	ВТ_Подготовка.КоммерческаяАкцияGUID КАК КоммерческаяАкцияGUID,
	//               |	ВТ_Подготовка.ВариантСкидки КАК ВариантСкидки,
	//               |	ВТ_Подготовка.Вид КАК Вид,
	//               |	Renault_КоммерческиеАкции.КоммерческаяАкция КАК КоммерческаяАкция,
	//               |	Renault_КоммерческиеАкции.УсловиеПредоставления
	//               |ПОМЕСТИТЬ ВТ_АкцииУсловия
	//               |ИЗ
	//               |	ВТ_Подготовка КАК ВТ_Подготовка
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КоммерческиеАкции КАК Renault_КоммерческиеАкции
	//               |		ПО ВТ_Подготовка.КоммерческаяАкцияGUID = Renault_КоммерческиеАкции.КоммерческаяАкцияGUID
	//               |			И ВТ_Подготовка.КлючСтроки = Renault_КоммерческиеАкции.КлючСтроки
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	//               |	ВТ_АкцииУсловия.КоммерческаяАкцияGUID,
	//               |	ВТ_АкцииУсловия.КлючСтроки
	//               |ПОМЕСТИТЬ ВТ_АкцииКИсключению
	//               |ИЗ
	//               |	ВТ_АкцииУсловия КАК ВТ_АкцииУсловия
	//               |ГДЕ
	//               |	ВТ_АкцииУсловия.УсловиеПредоставления.Наименование = ""Автомобили 2015 года выпуска""
	//               |	И &ГодВыпуска <> 2015
	//               |
	//               |ОБЪЕДИНИТЬ
	//               |
	//               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	//               |	ВТ_АкцииУсловия.КоммерческаяАкцияGUID,
	//               |	ВТ_АкцииУсловия.КлючСтроки
	//               |ИЗ
	//               |	ВТ_АкцииУсловия КАК ВТ_АкцииУсловия
	//               |ГДЕ
	//               |	ВТ_АкцииУсловия.УсловиеПредоставления.Наименование = ""Автомобили 2016 года выпуска""
	//               |	И &ГодВыпуска <> 2016
	//               |
	//               |ОБЪЕДИНИТЬ
	//               |
	//               |ВЫБРАТЬ
	//               |	ВТ_АкцииУсловия.КоммерческаяАкцияGUID,
	//               |	ВТ_АкцииУсловия.КлючСтроки
	//               |ИЗ
	//               |	ВТ_АкцииУсловия КАК ВТ_АкцииУсловия
	//               |ГДЕ
	//               |	ВТ_АкцииУсловия.УсловиеПредоставления.Наименование = ""Автомобили 2017 года выпуска""
	//               |	И &ГодВыпуска <> 2017
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ВТ_АкцииУсловия.КлючСтроки КАК КлючСтроки,
	//               |	ВТ_АкцииУсловия.ЗначениеСкидки КАК ЗначениеСкидки,
	//               |	ВТ_АкцииУсловия.ЗначениеСкидкиУчастиеДилера КАК ЗначениеСкидкиУчастиеДилера,
	//               |	ВТ_АкцииУсловия.КоммерческаяАкцияGUID КАК КоммерческаяАкцияGUID,
	//               |	ВТ_АкцииУсловия.ВариантСкидки КАК ВариантСкидки,
	//               |	ВТ_АкцииУсловия.Вид КАК Вид,
	//               |	ВТ_АкцииУсловия.КоммерческаяАкция КАК КоммерческаяАкция,
	//               |	ВТ_АкцииУсловия.УсловиеПредоставления КАК УсловиеПредоставления
	//               |ИЗ
	//               |	ВТ_АкцииУсловия КАК ВТ_АкцииУсловия
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АкцииКИсключению КАК ВТ_АкцииКИсключению
	//               |		ПО ВТ_АкцииУсловия.КоммерческаяАкцияGUID = ВТ_АкцииКИсключению.КоммерческаяАкцияGUID
	//               |			И ВТ_АкцииУсловия.КлючСтроки = ВТ_АкцииКИсключению.КлючСтроки
	//               |ГДЕ
	//               |	ВТ_АкцииКИсключению.КоммерческаяАкцияGUID ЕСТЬ NULL 
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	ВТ_АкцииУсловия.КлючСтроки,
	//               |	ВТ_АкцииУсловия.КоммерческаяАкцияGUID,
	//               |	ВТ_АкцииУсловия.КоммерческаяАкция,
	//               |	ВТ_АкцииУсловия.УсловиеПредоставления,
	//               |	ВТ_АкцииУсловия.Вид,
	//               |	ВТ_АкцииУсловия.ВариантСкидки,
	//               |	ВТ_АкцииУсловия.ЗначениеСкидки,
	//               |	ВТ_АкцииУсловия.ЗначениеСкидкиУчастиеДилера
	//               |ИТОГИ
	//               |	МАКСИМУМ(ЗначениеСкидки),
	//               |	МАКСИМУМ(ЗначениеСкидкиУчастиеДилера),
	//               |	МАКСИМУМ(ВариантСкидки),
	//               |	МАКСИМУМ(Вид),
	//               |	МАКСИМУМ(КоммерческаяАкция)
	//               |ПО
	//               |	КоммерческаяАкцияGUID,
	//               |	КлючСтроки";				   

	//			   
	//ВыборкаАкция = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//
	//ВозвращаемоеЗначение = Новый Структура;
	//Сч = 1;
	//Пока ВыборкаАкция.Следующий() Цикл
	//	
	//	ВыборкаКлючСтроки = ВыборкаАкция.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//	
	//	Пока ВыборкаКлючСтроки.Следующий() Цикл
	//		
	//		
	//		Выборка = ВыборкаКлючСтроки.Выбрать();
	//		
	//		СписокУсловий = Новый Массив;
	//		Пока Выборка.Следующий() Цикл
	//			СписокУсловий.Добавить(Выборка.УсловиеПредоставления);
	//		КонецЦикла;
	//		
	//		СтруктураСтроки = Новый Структура;
	//		СтруктураСтроки.Вставить("КоммерческаяАкцияGUID", ВыборкаАкция.КоммерческаяАкцияGUID);
	//		СтруктураСтроки.Вставить("КлючСтроки", ВыборкаКлючСтроки.КлючСтроки);
	//		СтруктураСтроки.Вставить("ВариантСкидки", ВыборкаКлючСтроки.ВариантСкидки);
	//		СтруктураСтроки.Вставить("Вид", ВыборкаКлючСтроки.Вид);
	//		СтруктураСтроки.Вставить("КоммерческаяАкция", ВыборкаАкция.КоммерческаяАкция);
	//		СтруктураСтроки.Вставить("СписокУсловий", СписокУсловий);
	//		СтруктураСтроки.Вставить("ЗначениеСкидки", ВыборкаКлючСтроки.ЗначениеСкидки);
	//		СтруктураСтроки.Вставить("ЗначениеСкидкиУчастиеДилера", ВыборкаКлючСтроки.ЗначениеСкидкиУчастиеДилера);
	//		
	//		ВозвращаемоеЗначение.Вставить("КлючСтроки"+Сч, СтруктураСтроки);
	//		
	//		Сч = Сч + 1;
	//		
	//	КонецЦикла;
	//
	//КонецЦикла;
	ВозвращаемоеЗначение = Неопределено;
	Возврат	ВозвращаемоеЗначение;

КонецФункции

//Функция ПолучитьУсловиеПоВиду(ВидУсловия) Экспорт

//	Запрос = Новый Запрос;
//			
//	Запрос.УстановитьПараметр("ВидУсловия", ВидУсловия); 
//			
//	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
//	               |	Renault_УсловияПредоставленияСкидок.Ссылка
//	               |ИЗ
//	               |	Справочник.Renault_УсловияПредоставленияСкидок КАК Renault_УсловияПредоставленияСкидок
//	               |ГДЕ
//	               |	НЕ Renault_УсловияПредоставленияСкидок.ПометкаУдаления
//	               |	И Renault_УсловияПредоставленияСкидок.ВидУсловия = &ВидУсловия";
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	Если Выборка.Следующий() Тогда
//		УсловиеСсылка = Выборка.Ссылка;
//	КонецЕсли;

//	Возврат УсловиеСсылка;
//	
//КонецФункции // ПолучитьУсловиеПоВиду()

//Функция ПолучитьСписокВидУсловийТипАвто() Экспорт

//	ВидыУсловий = Новый Массив;
//	ВидыУсловий.Добавить(Перечисления.Renault_ВидыУсловийПредоставленияСкидок.НовыйАвтомобиль);
//	ВидыУсловий.Добавить(Перечисления.Renault_ВидыУсловийПредоставленияСкидок.ПодержанныйАвтомобиль);
//	ВидыУсловий.Добавить(Перечисления.Renault_ВидыУсловийПредоставленияСкидок.ДемоАвтомобиль);

//	Возврат ВидыУсловий;
//	
//КонецФункции

Процедура Renault_ТипыСкидокПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Отказ Тогда
	
		Если Не Источник.ЭтоНовый()
			И СокрЛП(Источник.Ссылка.Код) = "RenltCA"
			И СокрЛП(Источник.Код) <> "RenltCA" Тогда
			
			Сообщить("Запрещено изменять код элемента");
			Отказ = Истина;	
		КонецЕсли;	
	
	КонецЕсли;
КонецПроцедуры

//Козлов Е.А. Начало 24.01.2017
#Если Клиент Тогда
Функция УстановитьТипАвтомобиля(VIN, ДилерскийЦентр) Экспорт
	ТипАвтомобиля = Неопределено;
	
	Если ЗначениеЗаполнено(VIN) Тогда 		
		BIR_Distri = СокрЛП(ДилерскийЦентр.BIR_Distri);
		
		МассивСкладовДилера = ДилерскийЦентр.СкладыДилера.ВыгрузитьКолонку("Склад");
		//Корзюков Начало 
		Если ДилерскийЦентр.Автосклад_ИспользоватьНовуюФормуСклада = Истина Тогда
			ФормаАвтосклад = Обработки.Renault_АРМ_Автосклад_Упр.ПолучитьФорму("ФормаДинамическийСписок");
		Иначе
			ФормаАвтосклад = Обработки.Renault_АРМ_Автосклад.ПолучитьФорму("Форма");
		КонецЕсли;
		
		//ФормаАвтосклад = Обработки.Renault_АРМ_Автосклад.ПолучитьФорму("Форма");
		//Корзюков Конец
		//ФормаАвтосклад.ПоказыватьЗарезервированные = Истина;
		//ФормаАвтосклад.МассивСкладовДилера = МассивСкладовДилера;
		
		// Ищем в новых		
		Результат = CRM_Сервер.Автосклад_ПолучитьТаблицуПоСостояниюАвтомобилей(VIN, МассивСкладовДилера, BIR_Distri, Истина, Истина, Истина, Истина,,,,, Неопределено, Неопределено,, Неопределено);
		Если Результат.Количество() > 0 Тогда
			ТипАвтомобиля = "Новый";
		КонецЕсли;
		
		// Ищем в подержанных		
		Если ТипАвтомобиля = Неопределено Тогда		
			Результат = CRM_Сервер.Автосклад_ПолучитьТаблицуПодержанныхАвтомобилей(VIN);
			Если Результат.Количество() > 0 Тогда
				ТипАвтомобиля = "Подержанный";
			КонецЕсли;		
		КонецЕсли;
		
		// Ищем в демо/подменных		
		Если ТипАвтомобиля = Неопределено Тогда 			
			Результат = ФормаАвтосклад.Автосклад_ПолучитьТаблицуДемоПодменок(VIN);
			Если Результат.Количество() > 0 Тогда
				ТипАвтомобиля = "Демо";
			КонецЕсли;			
		КонецЕсли;
		
		// Если так и не удалось определить тип, считаем что новый
		Если ТипАвтомобиля = Неопределено Тогда
			ТипАвтомобиля = "Новый";
		КонецЕсли; 		
	КонецЕсли;
	
	Возврат ТипАвтомобиля;
КонецФункции
#КонецЕсли
//Козлов Е.А. Конец

//// В+
//Процедура ПроверитьСоответствиеДоговораУсловиюСкидки(ОтказПредоставления, Условие, СтрокаСоставДоговора) Экспорт
//	
//	Если Условие.ВидУсловия = Перечисления.Renault_ВидыУсловийПредоставленияСкидок.ТрейдИн Тогда
//		ОтказПредоставления = Не СтрокаСоставДоговора.ПокупкаВТрейдИн;
//	ИначеЕсли Условие.ВидУсловия = Перечисления.Renault_ВидыУсловийПредоставленияСкидок.Утилизация Тогда
//		ОтказПредоставления = Не СтрокаСоставДоговора.ПокупкаПоУтилизации;
//	КонецЕсли;
//	
//КонецПроцедуры
//// В- 

