
&НаСервере
Функция ПолучитьСрокДействия(ДИлЦентр)
	
	
	ЭтоКорпКлиент = Ложь;
	РабочийЛист = ПолучитьРабочийЛист(ТекущийРабочийЛист);
	Если РабочийЛист <> Неопределено 
		И РабочийЛист.ТипКлиента = Перечисления.Renault_ТипыКлиентов.КорпоративныйКлиент Тогда
		
		ЭтоКорпКлиент = Истина;
		
	КонецЕсли;
	
	Если ДИлЦентр <> неопределено И ЗначениеЗаполнено(ДилЦентр.СрокДействияКпПоУмолчанию) Тогда
		
		Если Не ЭтоКорпКлиент И ЗначениеЗаполнено(ДилЦентр.СрокДействияКпПоУмолчанию) Тогда
			Ответ = КонецДня(ТекущаяДата()) + ДилЦентр.СрокДействияКпПоУмолчанию*60*60*24;
		ИначеЕсли ЭтоКорпКлиент И ЗначениеЗаполнено(ДилЦентр.СрокДействияКпПоУмолчаниюКОРП) Тогда
			Ответ = КонецДня(ТекущаяДата()) + ДилЦентр.СрокДействияКпПоУмолчаниюКОРП*60*60*24;
		ИначеЕсли ЭтоКорпКлиент Тогда
			Ответ = КонецДня(ТекущаяДата() + 30*24*60*60);
		Иначе
			Ответ = КонецДня(ТекущаяДата());
		КонецЕсли;
		
	Иначе
		
		Если ЭтоКорпКлиент Тогда
			Ответ = КонецДня(ТекущаяДата() + 30*24*60*60);
		Иначе
			Ответ = КонецДня(ТекущаяДата());
		КонецЕсли;
		
   	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

&НаСервере
Функция ПолучитьРабочийЛист(НомерЛиста)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
		|ГДЕ
		|	Renault_РабочиеЛисты.IDK = &IDK";
	Запрос.УстановитьПараметр("IDK", НомерЛиста);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПриОткрытииСервер()
	
	ТекДилерскийЦентр = Renault_РаботаСПравамиПользователя.ДилерскийЦентрПоУмолчанию(ПараметрыСеанса.Пользователь);
	ТекущийТариф = Renault_CRM.ПолучитьТекущийТарифНаАвтомобили();
	ТипЦенКП = Renault_РаботаСПравамиПользователя.ПолучитьТипЦенКП(ТекДилерскийЦентр); 
	СуммаДоставки = ТекДилерскийЦентр.СтоимостьДоставкиПоУмолчанию;
	//РассылкаУчетнаяЗапись = Renault_РаботаСПравамиПользователя.ДилерскийЦентрПоУмолчанию(ПараметрыСеанса.Пользователь).ОсновнаяУчетнаяЗаписьЭлПочты;
	РассылкаТемаСообщения ="Комерческое предложение";
	Если ГодВыпуска = 0 Тогда
		ГодВыпуска = Год(ТекущаяДата());
	КонецЕсли;
	
	Если ТрейдИнГодВыпуска = 0 Тогда
		ТрейдИнГодВыпуска = Год(ТекущаяДата());
	КонецЕсли;
	
	СрокДействия = ПолучитьСрокДействия(ТекДилерскийЦентр);

	Менеджер = ПараметрыСеанса.Пользователь.Сотрудник;
	
	ПрочитатьДанныеКлиентаСервер();
	ОбновитьСписокМоделей();
	
	СоставКП.Параметры.УстановитьЗначениеПараметра("Ссылка", ТекущееКП);
	СписокКП.Параметры.УстановитьЗначениеПараметра("РабочийЛист", ТекущийРабочийЛист);
	
	//ОтображатьПредложения = Ложь;
	//ОтображатьСклад = Ложь;
	//ОбновитьОтображениеСклад();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Парам = Renault_ОбщиеФункции.МультибрендПараметрыОформления();
	Элементы.ДекорацияЛоготип.Картинка = Вычислить(Парам.Логотип2);
	
	УстановитьЦенуРОП();
	НастройкиОтправки =  Renault_CRM.ПолучитьНастройкиОтправкиКП(ПараметрыСеанса.Пользователь.Сотрудник);
	РассылкаУчетнаяЗапись = НастройкиОтправки.УчетнаяЗапись;
	РассылкаТемаСообщения = НастройкиОтправки.Тема;
	РассылкаТекстСоообщения = НастройкиОтправки.Текст;
    Если ЗначениеЗаполнено( НастройкиОтправки.УчетнаяЗапись) Тогда
		РассылкаПредставление = НастройкиОтправки.УчетнаяЗапись.Наименование;
	КонецЕсли;
	НеОбновлятьПриАктивизацииСтроки = Истина;	
	
	ПриОткрытииСервер();
	
	Если Не ТекущееКП.Пустая() Тогда
		//Загрузим коммерческое предложение при открытии
		ЗагрузитьКоммерческоеПредложение(ТекущееКП);
		//ОбновитьТаблицыСклад();
		ОбновитьРежимРедактирования();
	Иначе
		//Пустой конфигуратор
		ОбновитьСписокКонфигураций(Модель);
		ОбновитьСписокЦветов(Модель);
		ПриИзмененииВерсииАвто();
		ОбновитьВидимостьЭлементов();
		ОбновитьЗаголовки();
	КонецЕсли;
	
	СнятьОтображениеПродуктов();
	ОбновитьОтображениеПродукты();
	ОбновитьКнопкиЗаявок();
	НеОбновлятьПриАктивизацииСтроки = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИнтервалПроверкиНапоминаний(Команда)
	
	ОткрытьФорму("ОбщаяФорма.CRM_ФормаИнтервалаНапоминаний");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПлановыеРезультатыКонтактов(Команда)
	
	ОткрытьФорму("Справочник.CRM_ПлановыеРезультатыКонтактов.Форма.ФормаСпискаУпр", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте                  
Процедура ОткрытьМакетыПечатныхФорм(Команда)
	
	ОткрытьФорму("РегистрСведений.Renault_ПользовательскиеМакетыПечати.Форма.МакетыПечатныхФорм", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиКП(Команда)
	
	ОткрытьФорму("ОбщаяФорма.CRM_НастройкаКП", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПрограммыЗащитыКредита(Команда)
	
	ОткрытьФорму("Справочник.CRM_ПрограммыЗащитыКредита.Форма.ФормаСпискаУпр", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтоимостьПродленнойГарантии(Команда)
	
	ОткрытьФорму("РегистрСведений.CRM_СтоимостьПродленнойГарантии.Форма.ФормаСпискаУпр", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоКоммерческимПредложениям(Команда)
	
	ОткрытьФорму("Отчет.CRM_ОтчетПоКоммерческимПредложениям.Форма.ФормаОтчета", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	//Если ИмяСобытия = "ЗагрузитьВКонфигуратор" Тогда
	//	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Автомобили") Тогда
	//		ЗагрузитьАвтоВКонфигуратор(Параметр);
	//		ПересчитатьЦенуАвто();
	//		Элементы.Разделыы.ТекущаяСтраница = Элементы.Конфигуратор;
	//	КонецЕсли
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьАвтоВКонфигуратор(Автомобиль)
	
	Модель = Автомобиль.Модель;
	Версия = Автомобиль.ВариантКомплектации;
	ПриИзмененииВерсииАвтоСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура МодельПриИзменении(Элемент)
	
	ПриИзмененииВерсииАвто();
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьЦенуВариантаКомплектации()
	
	ЦенаВариантаКомплектации = 0;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Модель", Модель);
	Запрос.УстановитьПараметр("ВариантКомплектации", Версия);
	Запрос.УстановитьПараметр("Тариф", ТекущийТариф);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Renault_ТарифНаКомплектацииАвтомобилей.ЦенаКлиентская
	|ИЗ
	|	РегистрСведений.Renault_ТарифНаКомплектацииАвтомобилей.СрезПоследних(, Тариф = &Тариф) КАК Renault_ТарифНаКомплектацииАвтомобилей
	|ГДЕ
	|	Renault_ТарифНаКомплектацииАвтомобилей.Модель = &Модель
	|	И Renault_ТарифНаКомплектацииАвтомобилей.ВариантКомплектации = &ВариантКомплектации";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЦенаВариантаКомплектации = Выборка.ЦенаКлиентская;
	Иначе
		ЦенаВариантаКомплектации = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКартинкуМодели()
	
	АдресКартинки = "";
	МенеджерИдентификатор = РегистрыСведений.CRM_ИдентификаторыКартинок.СоздатьМенеджерЗаписи();
	МенеджерИдентификатор.Модель = Модель;
	МенеджерИдентификатор.Цвет = Цвет;
	МенеджерИдентификатор.ВариантКомплектации = Версия;
	МенеджерИдентификатор.Прочитать();
	Если НЕ МенеджерИдентификатор.Выбран() Тогда
		МенеджерИдентификатор.Модель = Модель;
		МенеджерИдентификатор.Цвет = Цвет;
		МенеджерИдентификатор.Прочитать();
	КонецЕсли;
	Если НЕ МенеджерИдентификатор.Выбран() Тогда
		МенеджерИдентификатор.Модель = Модель;
		МенеджерИдентификатор.Прочитать();
	КонецЕсли;
	Если НЕ МенеджерИдентификатор.Выбран() Тогда
		Возврат
	КонецЕсли;
	КлючЗаписиРег = РегистрыСведений.КартинкиИФайлы.СоздатьКлючЗаписи(Новый Структура("Объект,Идентификатор", Модель, МенеджерИдентификатор.Идентификатор)); 
	Если НЕ КлючЗаписиРег.Пустой() Тогда
		АдресКартинки = ПолучитьНавигационнуюСсылку(КлючЗаписиРег, "Данные")
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВерсияПриИзменении(Элемент)
	
	ПриИзмененииВерсииАвто();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьЦенуАвто()
	
	ЦенаДопОпций = 0;
	Для Каждого ДопОпция Из ВыбранныеНебазовыеОпции Цикл
		ЦенаДопОпций = ЦенаДопОпций + ?(ДопОпция.Выбран, ДопОпция.Цена, 0);
	КонецЦикла;
	
	ЦенаОборудования = ВыбранноеОборудование.Итог("Сумма");
	ЦенаАвторабот = ВыбранныеАвтоработы.Итог("Сумма");
	ПересчитатьСкидки();
	ПересчитатьСуммуКредита();
	ЦенаИТОГО = ЦенаВариантаКомплектации + ЦенаДопОпций - ТрейдИнСумма + СуммаДоставки + ЦенаОборудования + ЦенаАвторабот + СтраховкаСумма + ГарантияСумма - СуммаСкидки;
	Если Не(ЦенаРОП = 0) Тогда
		Если УстановитьРасчетнуюПоЦенеРоп Тогда
			НаценкаРОП = ЦенаРОП - (ЦенаИТОГО - ЦенаОборудования - ЦенаАвторабот); //временно
			Если НаценкаРОП > 0 Тогда
				СуммаДоставки = СуммаДоставки + НаценкаРОП;	
				ЦенаИТОГО = ЦенаВариантаКомплектации + ЦенаДопОпций - ТрейдИнСумма + СуммаДоставки + ЦенаОборудования + ЦенаАвторабот + СтраховкаСумма + ГарантияСумма - СуммаСкидки;
			ИначеЕсли НаценкаРОП < 0 Тогда
				СуммаСкидки = - НаценкаРОП;	
				ЦенаИТОГО = ЦенаВариантаКомплектации + ЦенаДопОпций - ТрейдИнСумма + СуммаДоставки + ЦенаОборудования + ЦенаАвторабот + СтраховкаСумма + ГарантияСумма - СуммаСкидки;	
			КонецЕсли;
		Иначе		
			//Не меняем			
		КонецЕсли;
	КонецЕсли;
	
	ПересчитатьСкидки();
	
	ОбновитьНадписьЦена();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьЦена()
	
	НадписьЦена =  
	"Комплектация: " + Строка(ЦенаВариантаКомплектации) + Символы.ПС +
	"Опции:        " + Строка(ЦенаДопОпций) + Символы.ПС +
	"Оборудование: " + Строка(ЦенаОборудования) + Символы.ПС +
	"Автоработы:   " + Строка(ЦенаАвторабот) + Символы.ПС +
	"Доставка:     " + Строка(СуммаДоставки) + Символы.ПС +
	"Трейд-ин:     " + Строка(ТрейдИнСумма) + Символы.ПС +
	"Пр.гарантия:  " + Строка(ГарантияСумма) + Символы.ПС +
	"Страховка:    " + Строка(СтраховкаСумма) + Символы.ПС +
	?(СуммаСкидки > 0,	"СКИДКА:       " + Строка(СуммаСкидки) + Символы.ПС, "") +
	"--------------------------" + Символы.ПС +
	"ИТОГО:        " + Строка(ЦенаИТОГО) + " р.";
	
	НадписьРасчетнаяЦена = "Расчетная цена " + Строка(ЦенаИтого) + " р.";
	НадписьЦенаРуководителя = "Цена руководителя " + Строка(ЦенаРОП) + " р.";
	
	Элементы.ГруппаЦена.Заголовок = НадписьРасчетнаяЦена;
	Элементы.ДекорацияЦенаРОП.Заголовок = НадписьЦенаРуководителя;
	Элементы.ДекорацияЦенаРОП.Видимость = ЗначениеЗаполнено(ЦенаРОП);
	Элементы.УстановитьРасчетнуюПоЦенеРоп.Видимость = ЗначениеЗаполнено(ЦенаРОП);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуКредита()
	
	Возврат;
	
	СуммаКредита = ЦенаВариантаКомплектации - ТрейдИнСумма + СуммаДоставки;
	Если ДопОборудованиеВКредит Тогда
		СуммаКредита = СуммаКредита + ЦенаДопОпций + ЦенаОборудования + ЦенаАксессуаров;
	КонецЕсли;
	Если ВключитьСтраховкуВКредит Тогда
		СуммаКредита = СуммаКредита + СтраховкаСумма
	КонецЕсли;
	Если ВключитьПродленнуюГарантиюВКредит Тогда
		СуммаКредита = СуммаКредита + ГарантияСумма;
	КонецЕсли;
	Если УчитыватьСкидкуПриРасчетеСуммыКредита Тогда
		СуммаКредита = СуммаКредита - СуммаСкидки;
	КонецЕсли;
	ПересчитатьКредит();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСпискиОборудованияАксессуаров()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Тариф", ТекущийТариф);
	Запрос.УстановитьПараметр("УжеВыбрано", ВыбранныеНебазовыеОпции.Выгрузить());
	Запрос.УстановитьПараметр("Модель", Модель);
	Запрос.УстановитьПараметр("ВариантКомплектации", Версия);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УжеВыбрано.Выбран,
	|	УжеВыбрано.Опция
	|ПОМЕСТИТЬ ВТ_УжеВыбрано
	|ИЗ
	|	&УжеВыбрано КАК УжеВыбрано
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_ТарифНаОпцииАвтомобилей.Опция КАК ОпцияСпр,
	|	Renault_ТарифНаОпцииАвтомобилей.НаименованиеОпции КАК НаименованиеОпции,
	|	Renault_ТарифНаОпцииАвтомобилей.ЦенаКлиентская,
	|	Renault_ТарифНаОпцииАвтомобилей.Опция.Артикул КАК КодОпции
	|ПОМЕСТИТЬ ВТ_Опции
	|ИЗ
	|	РегистрСведений.Renault_ТарифНаОпцииАвтомобилей.СрезПоследних КАК Renault_ТарифНаОпцииАвтомобилей
	|ГДЕ
	|	Renault_ТарифНаОпцииАвтомобилей.Тариф = &Тариф
	|	И Renault_ТарифНаОпцииАвтомобилей.Базовая = ЛОЖЬ
	|	И Renault_ТарифНаОпцииАвтомобилей.Модель = &Модель
	|	И Renault_ТарифНаОпцииАвтомобилей.ВариантКомплектации = &ВариантКомплектации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Опции.ОпцияСпр КАК Опция,
	|	ВТ_Опции.НаименованиеОпции КАК НаименованиеОпции,
	|	ВТ_Опции.ЦенаКлиентская КАК Цена,
	|	ЕСТЬNULL(ВТ_УжеВыбрано.Выбран, ЛОЖЬ) КАК Выбран,
	|	ВТ_Опции.КодОпции КАК КодОпции
	|ИЗ
	|	ВТ_Опции КАК ВТ_Опции
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УжеВыбрано КАК ВТ_УжеВыбрано
	|		ПО ВТ_Опции.ОпцияСпр = ВТ_УжеВыбрано.Опция";
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	ВыбранныеНебазовыеОпции.Загрузить(ТаблицаРезультат);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Модель.Пустая() Тогда
		Предупреждение("Не выбрана модель", 30);
		Возврат;
	КонецЕсли;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Если Диалог.Выбрать() Тогда
		Попытка
			Картинка = Новый Картинка(Диалог.ПолноеИмяФайла);
			ЗаписатьКартинку(Картинка)
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКартинку(Картинка)
	
	//Удалим старую картинку
	МенеджерИдент = РегистрыСведений.CRM_ИдентификаторыКартинок.СоздатьМенеджерЗаписи();
	МенеджерИдент.Модель = Модель;
	МенеджерИдент.ВариантКомплектации = Версия;
	МенеджерИдент.Цвет = Цвет;
	МенеджерИдент.Прочитать();
	Если МенеджерИдент.Выбран() Тогда
		МенеджерКартинки = РегистрыСведений.КартинкиИФайлы.СоздатьМенеджерЗаписи();
		МенеджерКартинки.Объект = Модель;
		МенеджерКартинки.Идентификатор = МенеджерИдент.Идентификатор;
		МенеджерКартинки.Удалить();
	КонецЕсли;
	МенеджерИдент.Модель = Модель;
	МенеджерИдент.ВариантКомплектации = Версия;
	МенеджерИдент.Цвет = Цвет;
	Идентификатор = Строка(Новый УникальныйИдентификатор);
	МенеджерИдент.Идентификатор = Идентификатор;
	МенеджерИдент.Записать(Истина);
	
	МенеджерКартинки = РегистрыСведений.КартинкиИФайлы.СоздатьМенеджерЗаписи();
	МенеджерКартинки.Объект = Модель;
	МенеджерКартинки.Идентификатор = Идентификатор;
	МенеджерКартинки.Данные = Новый ХранилищеЗначения(Картинка);
	МенеджерКартинки.Записать(Истина);
	КлючЗаписиРег = РегистрыСведений.КартинкиИФайлы.СоздатьКлючЗаписи(Новый Структура("Объект,Идентификатор", Модель, Идентификатор)); 
	Если НЕ КлючЗаписиРег.Пустой() Тогда
		АдресКартинки = ПолучитьНавигационнуюСсылку(КлючЗаписиРег, "Данные")
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьКартинкуСервер()
	
	АдресКартинки = "";
	МенеджерИдент = РегистрыСведений.CRM_ИдентификаторыКартинок.СоздатьМенеджерЗаписи();
	МенеджерИдент.Модель = Модель;
	МенеджерИдент.ВариантКомплектации = Версия;
	МенеджерИдент.Цвет = Цвет;
	МенеджерИдент.Прочитать();
	Если МенеджерИдент.Выбран() Тогда
		МенеджерКартинки = РегистрыСведений.КартинкиИФайлы.СоздатьМенеджерЗаписи();
		МенеджерКартинки.Объект = Модель;
		МенеджерКартинки.Идентификатор = МенеджерИдент.Идентификатор;
		МенеджерКартинки.Удалить();
		МенеджерИдент.Удалить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКПНажатие(Команда)
	
	Если Не ЗначениеЗаполнено(Версия) ИЛИ Не ЗначениеЗаполнено(Цвет) Тогда
		Предупреждение("Не указана версия или цвет автомобиля");
		Возврат;
	КонецЕсли;
	
	НеОбновлятьПриАктивизацииСтроки = Истина;
	
	ТекущаяКонфигурация = ЗаписатьКонфигурацию(Истина);
	
	Если ЗначениеЗаполнено(ТекущаяКонфигурация) Тогда
		
		ТекущееКП = Документы.CRM_КоммерческоеПредложение.ПустаяСсылка();
		ДобавитьКП(ТекущаяКонфигурация);
		Элементы.СписокКП.Обновить();
		Элементы.СписокКП.ТекущаяСтрока = ТекущееКП;
		
		ОткрытьСтраницуСоставКП();
		
		ОбновитьВидимостьЭлементов();
		ОбновитьЗаголовки();
		
	КонецЕсли;
	
	НеОбновлятьПриАктивизацииСтроки = Ложь;
	
	Печать(ТекущееКП);
	
	Оповестить("ОбновитьРабочийЛист");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовки()
	
	ОбновитьЗаголовокФормы();
	ОбновитьЗаголовокКлиент();
	ОбновитьЗаголовокКП();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокКлиент()
	
	Если ЗначениеЗаполнено(ФИО) Тогда
		ИмяКлиента = ФИО; 
	Иначе
		ИмяКлиента = "<ФИО клиента не заполнено>";
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущееКП) Тогда
		Элементы.ДекорацияЗаголовок.Заголовок = "Коммерческое предложение - " + ИмяКлиента + " (РЛ №" + ТекущийРабочийЛист + ")"; 
	Иначе
		Элементы.ДекорацияЗаголовок.Заголовок = "Коммерческое предложение* - " + ИмяКлиента + " (РЛ №" + ТекущийРабочийЛист + ")"; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокФормы()	
	Заголовок = "Конфигуратор";	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокКП()	
	Элементы.ГруппаКоммерческиеПредложенияСостав.Заголовок = "Состав текущего коммерческого предложения №" + НомерКП + " от " + Формат(ДатаКП, "ДЛФ=Д");	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииМоделиАвто()
	
	ПриИзмененииВерсииАвтоСервер();
	ПриИзмененииВерсииАвтоКлиент();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииВерсииАвто()
	
	ПриИзмененииВерсииАвтоСервер();
	ПриИзмененииВерсииАвтоКлиент();
		
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииВерсииАвтоСервер()
	
	ПолучитьСуммуДоставки();
	ОбновитьТТХИБазовыеОпции();
	ОбновитьКартинкуМодели();
	ПересчитатьЦенуВариантаКомплектации(); //Цена версии
	ОбновитьСпискиОборудованияАксессуаров(); //Дополнительные опции
	//ОбновитьТаблицыСклад();
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьТТХИБазовыеОпции()
	
	ТТХ.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Версия", Версия);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Renault_ДопИнформацияПоВерсиям.ОбъемДвигателя КАК ДвигательОбъем,
	|	Renault_ДопИнформацияПоВерсиям.ТипТоплива КАК ДвигательТипТоплива,
	|	Renault_ДопИнформацияПоВерсиям.МощностьЛС КАК ДвигательЛС,
	|	Renault_ДопИнформацияПоВерсиям.МощностьКВТ КАК Двигатель_кВт,
	|	Renault_ДопИнформацияПоВерсиям.СтандартЕвро КАК Двигатель_НормаЕвро,
	|	Renault_ДопИнформацияПоВерсиям.МаксимальнаяМасса КАК МассаMax,
	|	Renault_ДопИнформацияПоВерсиям.МинимальнаяМасса КАК МассаMin
	|ИЗ
	|	РегистрСведений.Renault_ДопИнформацияПоВерсиям КАК Renault_ДопИнформацияПоВерсиям
	|ГДЕ
	|	Renault_ДопИнформацияПоВерсиям.ВариантКомплектации = &Версия";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Стр = ТТХ.Добавить();
		Стр.Показатель = "Объём двигателя";
		Стр.Значение = Выборка.ДвигательОбъем;
		Стр = ТТХ.Добавить();
		Стр.Показатель = "Тип топлива";
		Стр.Значение = Выборка.ДвигательТипТоплива;
		Стр = ТТХ.Добавить();
		Стр.Показатель = "Мощность (л.с.)";
		Стр.Значение = Выборка.ДвигательЛС;
		Стр = ТТХ.Добавить();
		Стр.Показатель = "Мощность (кВт)";
		Стр.Значение = Выборка.Двигатель_кВт;
		Стр = ТТХ.Добавить();
		Стр.Показатель = "Норма ЕВРО";
		Стр.Значение = Выборка.Двигатель_НормаЕвро;
		Стр = ТТХ.Добавить();
		Стр.Показатель = "Максимальная масса";
		Стр.Значение = Выборка.МассаMax;
		Стр = ТТХ.Добавить();
		Стр.Показатель = "Минимальная масса";
		Стр.Значение = Выборка.МассаMin;
	Иначе
		ТекущийИдентификатор = ""
	КонецЕсли;
	
	БазовыеОпции.Отбор.Элементы[0].ПравоеЗначение = ТекущийТариф;
	БазовыеОпции.Отбор.Элементы[1].ПравоеЗначение = Модель;
	БазовыеОпции.Отбор.Элементы[2].ПравоеЗначение = Версия;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииВерсииАвтоКлиент()
	
	ПересчитатьЦенуАвто();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКоммерческоеПредложение(КоммерческоеПредложениеСсылка)
	
	НеОбновлятьПриАктивизацииСтроки = Истина;
	
	ПрочитатьДанныеКП();
	
	Если Не ТекущееКП.Пустая() Тогда
		
		Элементы.СписокКП.ТекущаяСтрока = ТекущееКП;
		ОткрытьСтраницуСоставКП();		
		ЗагрузитьКонфигурациюВКонфигураторКлиент(ТекущаяКонфигурация);
		
	КонецЕсли;
	
	ОбновитьЗаголовки();
	ОбновитьВидимостьЭлементов();
	
	НеОбновлятьПриАктивизацииСтроки = Ложь;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьАвтомобильВКонфигураторКлиент(АвтомобильСсылка)
	
	ТекущийТариф = Renault_CRM.ПолучитьПоследнийТарифНаАвтомобиль(АвтомобильСсылка.ВариантКомплектации);
	
	НеОбновлятьПриАктивизацииСтроки = Истина;
	
	Автомобиль = АвтомобильСсылка;
	УстановитьЦенуРОП();
		
	ИндексыСтрок = ЗагрузитьАвтомобильВКонфигураторСервер(АвтомобильСсылка);	
	ОбновитьТаблицыПоДаннымРеквизитов(ИндексыСтрок);	

	ОбновитьТТХИБазовыеОпции();
	ОбновитьКартинкуМодели();
	ПересчитатьЦенуВариантаКомплектации(); //Плохо. Необходимо устанавливать в соответствии с авто

	ОбновитьСпискиОборудованияАксессуаров(); //Дополнительные опции
	ЗагрузитьОпцииИзАвтомобиля(АвтомобильСсылка);

	ПриИзмененииВерсииАвтоКлиент();
	
	ОбновитьЗаголовки();
	ОбновитьВидимостьЭлементов();
	ОбновитьРежимРедактирования();
	
	НеОбновлятьПриАктивизацииСтроки = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьАвтомобильВКонфигураторСервер(АвтомобильСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_СостояниеАвтомобилейПроизводителя_v2.Автомобиль,
	               |	CRM_СостояниеАвтомобилейПроизводителя_v2.Модель,
	               |	CRM_СостояниеАвтомобилейПроизводителя_v2.Версия,
	               |	CRM_СостояниеАвтомобилейПроизводителя_v2.Цвет,
	               |	CRM_СостояниеАвтомобилейПроизводителя_v2.OPTIONS,
	               |	CRM_СостояниеАвтомобилейПроизводителя_v2.VIN
	               |ИЗ
	               |	РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
	               |ГДЕ
	               |	CRM_СостояниеАвтомобилейПроизводителя_v2.Автомобиль = &Автомобиль";
	Запрос.УстановитьПараметр("Автомобиль", АвтомобильСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	VIN = "";
	Модель = Справочники.Модели.ПустаяСсылка();
	Версия = Справочники.ВариантыКомплектации.ПустаяСсылка();
	Цвет = Справочники.Цвета.ПустаяСсылка();
	
	Если Выборка.Следующий() Тогда
		
		VIN = Выборка.VIN;
		Модель = Выборка.Модель;
		Версия = Выборка.Версия;
		Цвет = Выборка.Цвет;
		
	КонецЕсли;
	
	ОбновитьСписокКонфигураций(Модель);
	ОбновитьСписокЦветов(Модель);
	
	ИндексыСтрок = ПолучитьИндексыСтрокТаблиц(Модель, Версия, Цвет);
	
	//Если ИндексыСтрок.ИндексМодель = Неопределено Тогда
	//	Элементы.ПолеМодель.Видимость = Истина;
	//Иначе
	//	Элементы.ПолеМодель.Видимость = Ложь;
	//КонецЕсли;
	//
	//Если ИндексыСтрок.ИндексВерсия = Неопределено Тогда
	//	Элементы.ПолеКомплектация.Видимость = Истина;
	//Иначе
	//	Элементы.ПолеМодель.Видимость = Ложь;
	//КонецЕсли;
	//
	//Если ИндексыСтрок.ИндексЦвет = Неопределено Тогда
	//	Элементы.ПолеЦвет.Видимость = Истина;
	//Иначе
	//	Элементы.ПолеМодель.Видимость = Ложь;
	//КонецЕсли;
		
	Возврат ИндексыСтрок;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьОпцииИзАвтомобиля(АвтомобильСсылка)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_СостояниеАвтомобилейПроизводителя_v2.VIN,
	               |	CRM_СостояниеАвтомобилейПроизводителя_v2.Автомобиль,
	               |	CRM_СостояниеАвтомобилейПроизводителя_v2.OPTIONS
	               |ИЗ
	               |	РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
	               |ГДЕ
	               |	CRM_СостояниеАвтомобилейПроизводителя_v2.Автомобиль = &Автомобиль";
	Запрос.УстановитьПараметр("Автомобиль", АвтомобильСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий(); //Плохо, нет проверки на ошибку
	
	МассивПодстрок = CRM_Сервер.РазложитьСтрокуВМассивПодстрок(Выборка.OPTIONS, " ");
		
	Для Каждого Стр Из ВыбранныеНебазовыеОпции Цикл
		
		Если МассивПодстрок.Найти(СокрЛП(Стр.КодОпции)) <> Неопределено Тогда
			Стр.Выбран = Истина;
		Иначе
			Стр.Выбран = Ложь;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьЭлементов()

	//Элементы.ГруппаРасчетКредита.Видимость = Кредит;
	Элементы.ГруппаКоммерческиеПредложенияСостав.Видимость = Не ТекущееКП.Пустая();
	//Элементы.ДобавитьКонфигурациюВКП.Видимость = Не ТекущееКП.Пустая();
	Элементы.ПечатьКП.Видимость = Не ТекущееКП.Пустая();
	Элементы.ПерезаписатьКонфигурацию.Видимость = Не ТекущееКП.Пустая();
	Элементы.СоздатьКП.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтраницуСоставКП()

	СоставКП.Параметры.УстановитьЗначениеПараметра("Ссылка", ТекущееКП);
	Элементы.СоставКП.Обновить();
	Элементы.СоставКП.ТекущаяСтрока = ТекущаяКонфигурация;
	Элементы.ГруппаКоммерческиеПредложения.ТекущаяСтраница = Элементы.ГруппаКоммерческиеПредложения.ПодчиненныеЭлементы.ГруппаКоммерческиеПредложенияСостав;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеНебазовыеОпцииПриИзменении(Элемент)
		
	ПересчитатьЦенуАвто();
	
КонецПроцедуры

&НаКлиенте
Процедура ТрейдИнСуммаПриИзменении(Элемент)
	
	ПересчитатьЦенуАвто();
	
КонецПроцедуры

&НаКлиенте
Процедура КонфигурацииАвтомобилейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Копирование Тогда Возврат КонецЕсли;
	
	Отказ = Истина;
	
	ЗаписатьКонфигурацию();
	
КонецПроцедуры

&НаКлиенте
Функция ЗаписатьКонфигурацию(КП = Ложь)
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Клиент",					ТекущийКлиент);
	ПараметрыФормы.Вставить("Модель",					Модель);
	ПараметрыФормы.Вставить("Версия",					Версия);
	ПараметрыФормы.Вставить("Цвет",						Цвет);
	ПараметрыФормы.Вставить("ГодВыпуска",				ГодВыпуска);
	ПараметрыФормы.Вставить("VIN",						VIN);
	ПараметрыФормы.Вставить("Автомобиль",				Автомобиль);
	ПараметрыФормы.Вставить("Комментарий",				Комментарий);
	ПараметрыФормы.Вставить("ВыбранныеНебазовыеОпции",	ВыбранныеНебазовыеОпции);
	ПараметрыФормы.Вставить("ВыбранноеОборудование",	ВыбранноеОборудование);
	ПараметрыФормы.Вставить("ВыбранныеАвтоработы",		ВыбранныеАвтоработы);
	ПараметрыФормы.Вставить("ЦенаВерсии",				ЦенаВариантаКомплектации);
	ПараметрыФормы.Вставить("РабочийЛист",				ТекущийРабочийЛист);
	ПараметрыФормы.Вставить("КП",						КП);
	
	ПараметрыФормы.Вставить("ТрейдИнВерсия",			ТрейдИнВерсия);
	ПараметрыФормы.Вставить("ТрейдИнМодель",			ТрейдИнМодель);
	ПараметрыФормы.Вставить("ТрейдИнЦвет",				ТрейдИнЦвет);
	ПараметрыФормы.Вставить("ТрейдИнГодВыпуска",		ТрейдИнГодВыпуска);
	ПараметрыФормы.Вставить("ТрейдИнСумма",				ТрейдИнСумма);
	ПараметрыФормы.Вставить("ТрейдИнПробег",			ТрейдИнПробег);
	ПараметрыФормы.Вставить("ТрейдИнКомментарий",		ТрейдИнКомментарий);
	
	ПараметрыФормы.Вставить("ГарантияСумма",			ГарантияСумма);
	ПараметрыФормы.Вставить("ПродленнаяГарантия",		ПродленнаяГарантия);
	
	ПараметрыФормы.Вставить("СтраховкаСумма",			СтраховкаСумма);
	ПараметрыФормы.Вставить("СтраховкаВид",				СтраховкаВид);
	ПараметрыФормы.Вставить("СтраховкаКомпания",		СтраховкаКомпания);
	ПараметрыФормы.Вставить("СтраховкаКомментарий",		СтраховкаКомментарий);
	
	ПараметрыФормы.Вставить("ВключитьПродленнуюГарантиюВКредит",	ВключитьПродленнуюГарантиюВКредит);
	ПараметрыФормы.Вставить("УчитыватьСкидкуПриРасчетеСуммыКредита",	УчитыватьСкидкуПриРасчетеСуммыКредита);
	
	ПараметрыФормы.Вставить("СуммаСкидки", СуммаСкидки);
	ПараметрыФормы.Вставить("СуммаДоставки", СуммаДоставки);
	
	ПараметрыФормы.Вставить("Банк", Банк);
	ПараметрыФормы.Вставить("СуммаКредита", СуммаКредита);
	ПараметрыФормы.Вставить("СрокКредита", СрокКредита);
	ПараметрыФормы.Вставить("СтавкаБанка", СтавкаБанка);
	ПараметрыФормы.Вставить("ЕжемесячныйПлатеж", ЕжемесячныйПлатеж);
	ПараметрыФормы.Вставить("ПервоначальныйВзносСумма", ПервоначальныйВзносСумма);
	
	Форма = ПолучитьФорму("Справочник.CRM_КонфигурацииАвтомобилей.Форма.ФормаЭлементаУпр", ПараметрыФормы, ЭтаФорма);
	Форма.Записать();
	Возврат Форма.Объект.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура ВыбранноеОборудованиеПриИзменении(Элемент)
		
	ТекДанные = Элементы.ВыбранноеОборудование.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		
		Если ТекДанные.Количество = 0 Тогда
			ТекДанные.Количество = 1
		КонецЕсли;
		ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена;
		
	КонецЕсли;
	
	ПересчитатьЦенуАвто();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеАвтоработыПриИзменении(Элемент)
	
	ТекДанные = Элементы.ВыбранныеАвтоработы.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		
		Если ТекДанные.Количество = 0 Тогда
			ТекДанные.Количество = 1
		КонецЕсли;
		ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена;
		
	КонецЕсли;
	
	ПересчитатьЦенуАвто();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеАксессуарыПриИзменении(Элемент)
		
	ТекДанные = Элементы.ВыбранныеАксессуары.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		
		Если ТекДанные.Количество = 0 Тогда
			ТекДанные.Количество = 1
		КонецЕсли;
		ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена;
		
	КонецЕсли;
	
	ПересчитатьЦенуАвто();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКонфигурациюВКонфигураторКлиент(Конфигурация)
	
	ИндексыСтрок = ЗагрузитьКонфигурациюВКонфигураторСервер(Конфигурация);	
	ОбновитьТаблицыПоДаннымРеквизитов(ИндексыСтрок);	
	
	ОбновитьТТХИБазовыеОпции();
	ОбновитьКартинкуМодели();
	ПересчитатьЦенуВариантаКомплектации(); //Необходимо устанавливать в соответствии с КП!
	
	ОбновитьСпискиОборудованияАксессуаров(); //Дополнительные опции
	ЗагрузитьОпцииИзКонфигурации(ТекущаяКонфигурация);
	
	ПриИзмененииВерсииАвтоКлиент();
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьКонфигурациюВКонфигураторСервер(Конфигурация)
	
	Если Конфигурация = Неопределено Тогда
		Если ТекущееКП.Состав.Количество() > 0 Тогда
			Конфигурация = ТекущееКП.Состав[0].Конфигурация;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Конфигурация);
	УстановитьЦенуРОП();
	
	ОбновитьСписокКонфигураций(Модель);
	ОбновитьСписокЦветов(Модель);
	
	ИндексыСтрок = ПолучитьИндексыСтрокТаблиц(Модель, Версия, Цвет);
	
	Возврат ИндексыСтрок
	
КонецФункции

&НаСервере
Процедура ЗагрузитьОпцииИзКонфигурации(Конфигурация)

	Для Каждого Стр Из ВыбранныеНебазовыеОпции Цикл
		
		Если НЕ Конфигурация.Опции.Найти(Стр.Опция, "Опция") = Неопределено Тогда
			Стр.Выбран = Истина;
		Иначе
			Стр.Выбран = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	ВыбранноеОборудование.Загрузить(Конфигурация.Оборудование.Выгрузить());

КонецПроцедуры	
	
&НаКлиенте
Процедура ЗагрузитьКПНажатие(Команда)
	
	Если ЗначениеЗаполнено(Элементы.СписокКП.ТекущаяСтрока) Тогда
		ТекущееКП = Элементы.СписокКП.ТекущаяСтрока;
	Иначе
		Возврат;
	КонецЕсли;
	
	ЗагрузитьКоммерческоеПредложение(ТекущееКП);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицыПоДаннымРеквизитов(ИндексыСтрок)
	
	Если ИндексыСтрок.ИндексМодель <> Неопределено Тогда
    	Элементы.ТаблицаМодели.ТекущаяСтрока = ТаблицаМодели[ИндексыСтрок.ИндексМодель].ПолучитьИдентификатор();
	КонецЕсли;
	
	Если ИндексыСтрок.ИндексВерсия <> Неопределено Тогда
    	Элементы.ТаблицаКомплектации.ТекущаяСтрока = ТаблицаКомплектации[ИндексыСтрок.ИндексВерсия].ПолучитьИдентификатор();
	КонецЕсли;
	
	Если ИндексыСтрок.ИндексЦвет <> Неопределено Тогда
    	Элементы.ТаблицаЦвета.ТекущаяСтрока = ТаблицаЦвета[ИндексыСтрок.ИндексЦвет].ПолучитьИдентификатор();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьИндексыСтрокТаблиц(Модель, Версия, Цвет)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Модель", Модель);
	Строки = ТаблицаМодели.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество() > 0 Тогда
		ИндексМодель = ТаблицаМодели.Индекс(Строки[0]);
	Иначе
		ИндексМодель = Неопределено;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Ссылка", Версия);
	Строки = ТаблицаКомплектации.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество() > 0 Тогда
		ИндексВерсия = ТаблицаКомплектации.Индекс(Строки[0]);
	Иначе
		ИндексВерсия = Неопределено;
	КонецЕсли;	
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Цвет", Цвет);
	Строки = ТаблицаЦвета.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество() > 0 Тогда
		ИндексЦвет = ТаблицаЦвета.Индекс(Строки[0]);
	Иначе
		ИндексЦвет = Неопределено;
	КонецЕсли;
	
	Ответ = Новый Структура;
	Ответ.Вставить("ИндексМодель", ИндексМодель);
	Ответ.Вставить("ИндексВерсия", ИндексВерсия);
	Ответ.Вставить("ИндексЦвет", ИндексЦвет);
	
	Возврат Ответ;
		
КонецФункции

&НаКлиенте
Процедура КонфигурацияДобавитьВКПНажатие(Команда)
	
	Если Не ЗначениеЗаполнено(Версия) ИЛИ Не ЗначениеЗаполнено(Цвет) Тогда
		Предупреждение("Не указана версия или цвет автомобиля");
		Возврат;
	КонецЕсли;
	
	НеОбновлятьПриАктивизацииСтроки = Истина;
	
	ТекущаяКонфигурация = ЗаписатьКонфигурацию(Истина);
	
	Если ЗначениеЗаполнено(ТекущаяКонфигурация) Тогда		
		ДобавитьКП(ТекущаяКонфигурация);
		ОткрытьСтраницуСоставКП();
	КонецЕсли;
	
	НеОбновлятьПриАктивизацииСтроки = Ложь;
	
	Оповестить("ОбновитьРабочийЛист");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКП(Конфигурация)
	
	Если НЕ ЗначениеЗаполнено(ТекущееКП) Тогда
		
		ОбКП = Документы.CRM_КоммерческоеПредложение.СоздатьДокумент();
		ОбКП.Дата			= ТекущаяДата();
		ОбКП.СрокДействия   = СрокДействия;
		ОбКП.Автор			= ПараметрыСеанса.Пользователь;
		//ОбКП.СрокДействия	= ТекущаяДата() + 86400 * Константы.CRM_СрокДействияКП.Получить();
		//ОбКП.СрокПоставки	= ТекущаяДата() + 86400 * Константы.CRM_СрокПоставки.Получить();
		ОбКП.Клиент			= ТекущийКлиент;
		ОбКП.РабочийЛист	= ТекущийРабочийЛист;
		ОбКП.ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
		ОбКП.ЗаявкаНаТрейдИн = СоздатьНайтиЗаявкуНаТрейдИн();
		обКП.ИнтересовалсяТрейдИн = ИнтересовалсяТрейдИн;
		ОбКП.ЗаявкаНаКредит = СоздатьНайтиЗаявкуНаКредит();
		ОбКП.ЗаявкаНаСтраховку = СоздатьНайтиЗаявкуНаСтраховку();
		ОбКП.ЗаявкаНаГарантию = СоздатьНайтиЗаявкуНаГарантию();
		Обкп.ЗаявкаНаОборудование = СоздатьНайтиЗаявкуНаОборудование();
		обКП.ИнтересовалсяКредитом = ИнтересовалсяКредитом;

		ОбКП.Записать();
		
		ТекущееКП = ОбКП.Ссылка;
		
	Иначе
		
		ОбКП = ТекущееКП.ПолучитьОбъект();
		//ОбКП.Дата			= ТекущаяДата();
		//ОбКП.Автор			= ПараметрыСеанса.Пользователь;
		ОбКП.СрокДействия	= СрокДействия;
		//ОбКП.СрокПоставки	= ТекущаяДата() + 86400 * Константы.CRM_СрокПоставки.Получить();
		//ОбКП.Клиент			= ТекущийКлиент;
		//ОбКП.РабочийЛист	= ТекущийРабочийЛист;
		//ОбКП.ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
		ОбКП.ЗаявкаНаТрейдИн = СоздатьНайтиЗаявкуНаТрейдИн();
		обКП.ИнтересовалсяТрейдИн = ИнтересовалсяТрейдИн;
		ОбКП.ЗаявкаНаКредит = СоздатьНайтиЗаявкуНаКредит();
		ОбКП.ЗаявкаНаГарантию = СоздатьНайтиЗаявкуНаГарантию();
		ОбКП.ЗаявкаНаОборудование = СоздатьНайтиЗаявкуНаОборудование();
		обКП.ИнтересовалсяКредитом = ИнтересовалсяКредитом;
        Обкп.ИнтересовалсяСтраховкой = ИнтересовалсяСтраховкой;
		ОбКП.ЗаявкаНаСтраховку = СоздатьНайтиЗаявкуНаСтраховку();
		ОбКП.Записать();
		
	КонецЕсли;
	
	СтрКонф = ОбКП.Состав.Добавить();
	СтрКонф.Конфигурация = Конфигурация;
	СтрКонф.Сумма = ЦенаИТОГО;
	СтрКонф.СуммаДоставки = СуммаДоставки;
	СтрКонф.СуммаСкидки = СуммаСкидки;
	
	НомерКП = ОбКП.Номер;
	ДатаКП = ОбКП.Дата;
	
	ОбКП.Сумма = ОбКП.Состав.Итог("Сумма");
	обКП.ЗаявканаТрейдИн = ЗаявкаНаТрейдИн;
	обКП.ЗаявкаНаКредит = ЗаявкаНаКредит;
	ОбКП.ЗаявкаНаСтраховку = ЗаявкаНаСтраховку;
	обКП.ИнтересовалсяТрейдИн = ИнтересовалсяТрейдИн;
	обКП.ИнтересовалсяКредитом = ИнтересовалсяКредитом;
	ОбКП.интересовалсяСтраховкой = ИнтересовалсяСтраховкой;

	ОбКП.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

&НаКлиенте
Процедура БазовыеОпцииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКонфигурациюИзКПНажатие(Команда)
	
	НеОбновлятьПриАктивизацииСтроки = Истина;
	
	Если Элементы.СоставКП.ТекущиеДанные <> Неопределено Тогда
		
		ТекущаяКонфигурация = Элементы.СоставКП.ТекущиеДанные.Конфигурация;
		ЗагрузитьКонфигурациюВКонфигураторКлиент(ТекущаяКонфигурация);
		
	КонецЕсли;
	
	НеОбновлятьПриАктивизацииСтроки = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКонфигурациюИзКПНажатие(Команда)
	
	Если Элементы.СоставКП.ТекущиеДанные <> Неопределено Тогда
		
		Если ОсталасьОднаКонфигурация() Тогда
			Предупреждение("В коммерческом предложении должна быть хотя бы одна конфигурация!");
			Возврат;
		КонецЕсли;
		
		УдалитьКонфигурацию(Элементы.СоставКП.ТекущиеДанные.Конфигурация);
		Элементы.СоставКП.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОсталасьОднаКонфигурация()
	
	КПОбъект = ТекущееКП.ПолучитьОбъект();
	Возврат КПОбъект.Состав.Количество() = 1;
	
КонецФункции

&НаСервере
Процедура УдалитьКонфигурацию(Конфигурация)
	
	ОбКП = ТекущееКП.ПолучитьОбъект();
	Строки = ОбКП.Состав.НайтиСтроки(Новый Структура("Конфигурация", Конфигурация));
	Для Каждого Стр Из Строки Цикл
		ОбКП.Состав.Удалить(Стр);
	КонецЦикла;
	
	ОбКП.Сумма = ОбКП.Состав.Итог("Сумма");
	
	ОбКП.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКПВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если НЕ Неопределено = Элементы.СоставКП.ТекущиеДанные Тогда
		ОткрытьЗначение(Элементы.СоставКП.ТекущиеДанные.Конфигурация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКП1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если НЕ Неопределено = Элементы.СоставКП.ТекущиеДанные Тогда
		ОткрытьЗначение(Элементы.СоставКП1.ТекущиеДанные.Конфигурация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьДополнительнуюИнформациюВКонфигураторе()
	Элементы.ГруппаКонфигурацияСкладКП.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура VINОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Обработка.CRM_РабочийСтол.Форма.ФормаОстаткиАвтомобилей", Новый Структура("Модель, Версия", Модель, Версия), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТекущееКПНажатие(Команда)
	
	Если ЗначениеЗаполнено(ТекущееКП) Тогда
		ОткрытьЗначение(ТекущееКП);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КредитПриИзменении(Элемент)
	
	Элементы.ГруппаРасчетКредита.Видимость = Кредит;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаСтраховкиПриИзменении(Элемент)
	
	ПересчитатьЦенуАвто();
	
КонецПроцедуры

&НаКлиенте
Процедура КредитнаяПрограммаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(КредитнаяПрограмма) Тогда
		
		СтараяПГ = ПродленнаяГарантия;		
		ОбновитьДанныеКредита();
		Если ПродленнаяГарантия <> СтараяПГ Тогда
			Предупреждение("Выбрана бесплатная продлённая гарантия: " + Строка(ПродленнаяГарантия), 30);
			ПересчитатьЦенуАвто();
		КонецЕсли;
		ПересчитатьКредит();
		Элементы.ДопустимыеСрокиКредита.Заголовок = "(" + Строка(МинимальныйСрокКредита) + " - " + Строка(МаксимальныйСрокКредита) + " мес.)";
		Элементы.ДекорацияПроцент.Заголовок = "% (" + Строка(МинимальныйПервоначальныйВзнос) + " - " + Строка(МаксимальныйПервоначальныйВзнос) + " %)";
		
	Иначе
		
		Элементы.ДопустимыеСрокиКредита.Заголовок = "";
		Элементы.ДекорацияПроцент.Заголовок = "";
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеКредита()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КредитнаяПрограмма", КредитнаяПрограмма);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	CRM_ПараметрыКредитныхПрограмм.МинимальныйСрокКредита,
	|	CRM_ПараметрыКредитныхПрограмм.МаксимальныйСрокКредита,
	|	CRM_ПараметрыКредитныхПрограмм.МинимальныйПервоначальныйВзнос,
	|	CRM_ПараметрыКредитныхПрограмм.МаксимальныйПервоначальныйВзнос,
	|	CRM_ПараметрыКредитныхПрограмм.СтавкаБанка,
	|	CRM_ПараметрыКредитныхПрограмм.МаркетинговаяСтавка
	|ИЗ
	|	РегистрСведений.CRM_ПараметрыКредитныхПрограмм КАК CRM_ПараметрыКредитныхПрограмм
	|ГДЕ
	|	CRM_ПараметрыКредитныхПрограмм.КредитнаяПрограмма = &КредитнаяПрограмма";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		МинимальныйСрокКредита 				= Выборка.МинимальныйСрокКредита;
		МаксимальныйСрокКредита 			= Выборка.МаксимальныйСрокКредита;
		МинимальныйПервоначальныйВзнос 		= Выборка.МинимальныйПервоначальныйВзнос;
		МаксимальныйПервоначальныйВзнос 	= Выборка.МаксимальныйПервоначальныйВзнос;
		СтавкаБанка 						= Выборка.СтавкаБанка;
		МаркетинговаяСтавка 				= Выборка.МаркетинговаяСтавка;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Модель", Модель);
	Запрос.УстановитьПараметр("Версия", Версия);
	Запрос.УстановитьПараметр("ГодПроизводства", ГодВыпуска);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(CRM_СтоимостьПродленнойГарантии.ПредложениеПГ, ЗНАЧЕНИЕ(Справочник.CRM_ПредложенияПродленнойГарантии.ПустаяСсылка)) КАК ПГ,
	|	ЕСТЬNULL(CRM_СтоимостьПродленнойГарантии.Сумма, 0) КАК Сумма
	|ИЗ
	|	РегистрСведений.CRM_ПрименениеКредитныхПрограмм КАК CRM_ПрименениеКредитныхПрограмм
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СтоимостьПродленнойГарантии КАК CRM_СтоимостьПродленнойГарантии
	|		ПО CRM_ПрименениеКредитныхПрограмм.ПГВПодарок = CRM_СтоимостьПродленнойГарантии.ПредложениеПГ
	|			И CRM_ПрименениеКредитныхПрограмм.Модель = CRM_СтоимостьПродленнойГарантии.Модель
	|ГДЕ
	|	CRM_ПрименениеКредитныхПрограмм.Модель = &Модель
	|	И CRM_ПрименениеКредитныхПрограмм.Версия = &Версия
	|	И CRM_ПрименениеКредитныхПрограмм.ГодПроизводства = &ГодПроизводства
	|	И CRM_ПрименениеКредитныхПрограмм.КредитнаяПрограмма = &КредитнаяПрограмма";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ГарантияСумма < Выборка.Сумма Тогда
			ПродленнаяГарантия = Выборка.ПГ;
			ГарантияСумма = Выборка.Сумма;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьКредит()
	
	//Если НЕ Кредит Тогда Возврат КонецЕсли;
	//Если ЗначениеЗаполнено(КредитнаяПрограмма) Тогда
	//	Если СрокКредита < МинимальныйСрокКредита Тогда
	//		СрокКредита = МинимальныйСрокКредита
	//	КонецЕсли;
	//	Если СрокКредита > МаксимальныйСрокКредита Тогда
	//		СрокКредита = МаксимальныйСрокКредита
	//	КонецЕсли;
	//	Если ПервоначальныйВзносПроцент < МинимальныйПервоначальныйВзнос Тогда
	//		ПервоначальныйВзносПроцент = МинимальныйПервоначальныйВзнос;
	//		ПервоначальныйВзносСумма = СуммаКредита * ПервоначальныйВзносПроцент / 100;
	//	КонецЕсли;
	//	Если ПервоначальныйВзносПроцент > МаксимальныйПервоначальныйВзнос Тогда
	//		ПервоначальныйВзносПроцент = МаксимальныйПервоначальныйВзнос;
	//		ПервоначальныйВзносСумма = СуммаКредита * ПервоначальныйВзносПроцент / 100;
	//	КонецЕсли;
	//КонецЕсли;
	
	СтавкаБанка = МаркетинговаяСтавка;
	Если СрокКредита <> 0 И СтавкаБанка <> 0 Тогда
		
		ИсходнаяСуммаКредита = СуммаКредита - ПервоначальныйВзносСумма;
		//СубсидияПоКредитнойПрограмме = ИсходнаяСуммаКредита * (1-(МаркетинговаяСтавка/СтавкаБанка)*Pow(((1+МаркетинговаяСтавка/1200)/(1+СтавкаБанка/1200)),СрокКредита)*((Pow(1+СтавкаБанка/1200, СрокКредита)-1)/(Pow(1+МаркетинговаяСтавка/1200, СрокКредита)-1)));
		//ЦенаАвтомобиляПослеСубсидирования = СуммаКредита - СубсидияПоКредитнойПрограмме;
		//Если ДопОборудованиеВКредит Тогда
		//	СтоимостьДопОборудованияВКредит =  ЦенаДопОпций + ЦенаОборудования + ЦенаАксессуаров;
		//Иначе
		//	СтоимостьДопОборудованияВКредит =  0;
		//КонецЕсли;
		//ЦенаАвтомобиляИтоговая = ЦенаАвтомобиляПослеСубсидирования + СтоимостьДопОборудованияВКредит;
		//СуммаКредитаПослеСубсидирования = ИсходнаяСуммаКредита - СубсидияПоКредитнойПрограмме;
		//СуммаЗащитыКредита = СуммаКредитаПослеСубсидирования*СтавкаЗащитыКредита/100*СрокКредита + ФиксированнаяЧастьЗащитыКредита*(1+СтавкаЗащитыКредита/100*СрокКредита);
		//СуммаКредитаИтоговая = СуммаКредитаПослеСубсидирования + СуммаЗащитыКредита;
		СуммаКредитаИтоговая = ИсходнаяСуммаКредита;
		ЕжемесячныйПлатеж = (СтавкаБанка/1200*СуммаКредитаИтоговая*Pow(1+СтавкаБанка/1200,СрокКредита))/(Pow(1+СтавкаБанка/1200, СрокКредита)-1)
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СрокКредитаПриИзменении(Элемент)
	ПересчитатьКредит();
КонецПроцедуры

&НаКлиенте
Процедура ПервоначальныйВзносПроцентПриИзменении(Элемент)
	
	ПервоначальныйВзносСумма = СуммаКредита * ПервоначальныйВзносПроцент / 100;
	ПересчитатьКредит();
	
КонецПроцедуры

&НаКлиенте
Процедура ПервоначальныйВзносСуммаПриИзменении(Элемент)
	
	ПервоначальныйВзносПроцент = ПервоначальныйВзносСумма / СуммаКредита * 100;
	ПересчитатьКредит();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрограммаЗащитыКредитаПриИзменении(Элемент)
	
	ЗаполнитьПараметрыЗащитыКредита();
	ПересчитатьКредит();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыЗащитыКредита()
	
	Если ЗначениеЗаполнено(ПрограммаЗащитыКредита) Тогда
		СтавкаЗащитыКредита = ПрограммаЗащитыКредита.Ставка;
		ФиксированнаяЧастьЗащитыКредита = ПрограммаЗащитыКредита.Фикс;
	Иначе
		СтавкаЗащитыКредита = 0;
		ФиксированнаяЧастьЗащитыКредита = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродленнаяГарантияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("РегистрСведений.CRM_СтоимостьПродленнойГарантии.Форма.ФормаВыбораУпр", Новый Структура("Модель", Модель), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "РегистрСведений.CRM_СтоимостьПродленнойГарантии.Форма.ФормаВыбораУпр" Тогда
		ПродленнаяГарантия = ВыбранноеЗначение.ПГ;
		ГарантияСумма = ВыбранноеЗначение.Сумма;
	КонецЕсли;
	ПересчитатьЦенуАвто();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродленнаяГарантияОчистка(Элемент, СтандартнаяОбработка)
	ГарантияСумма = 0;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКП(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОпцииДилераДобавитьИзСправочника(Команда)
	
	НоваяОпция = Справочники.Номенклатура.ПолучитьФормуВыбора().ОткрытьМодально();
	
	Если ЗначениеЗаполнено(НоваяОпция) Тогда
		
		//Проверим наличие данной опции в списке
		Отбор = Новый Структура("Номенклатура", НоваяОпция);
		МассивСтрок = ВыбранноеОборудование.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() > 0 Тогда
			//Данная строка уже есть в списке, увеличим количество
			НовСтрока = МассивСтрок[0];
			НовСтрока.Количество = НовСтрока.Количество + 1;
		Иначе
		
			//Добавим в список
			НовСтрока = ВыбранноеОборудование.Добавить();
			НовСтрока.Номенклатура = НоваяОпция;
			НовСтрока.Количество = 1;
			
			//Подставим цену //Доделать
			//На текущий момент подставляется чистая цена из регистра, без учета скидок
			//Вопрос автоматических скидок необходимо проработать
			//Renault Е.А. 
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ТипЦен", ТипЦенКП);
			Запрос.УстановитьПараметр("Номенклатура", НоваяОпция);
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЦеныСрезПоследних.Цена
			               |ИЗ
			               |	РегистрСведений.Цены.СрезПоследних(
			               |			,
			               |			ТипЦен = &ТипЦен
			               |				И Номенклатура = &Номенклатура) КАК ЦеныСрезПоследних";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				НовСтрока.Цена = Выборка.Цена;
			КонецЕсли;
			
		КонецЕсли;
		
		//Расчитаем сумму строки
		НовСтрока.Сумма = НовСтрока.Цена * НовСтрока.Количество;
		
		ПересчитатьЦенуАвто();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОпцииДилераДобавитьПроизвольные(Команда)
	
	Перем НоваяОпция;
	Перем ЦенаОпции;
	
	Если ВвестиСтроку(НоваяОпция, "Введите название опции", 100, Ложь) Тогда
		
		Если ВвестиЧисло(ЦенаОпции, "Введите цену опции", 10, 2) Тогда
		
			//Добавим в список
			НовСтрока = ВыбранноеОборудование.Добавить();
			НовСтрока.Номенклатура = НоваяОпция;
			НовСтрока.Количество = 1;
			НовСтрока.Цена = ЦенаОпции;
			НовСтрока.Сумма = ЦенаОпции;
			
		КонецЕсли;
		
		//Расчитаем сумму строки
		
		ПересчитатьЦенуАвто();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоработыДобавитьИзСправочника(Команда)
	
	НоваяОпция = Справочники.Автоработы.ПолучитьФормуВыбора().ОткрытьМодально();
	
	Если ЗначениеЗаполнено(НоваяОпция) Тогда
		
		//Проверим наличие данной опции в списке
		Отбор = Новый Структура("Номенклатура", НоваяОпция);
		МассивСтрок = ВыбранныеАвтоработы.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() > 0 Тогда
			//Данная строка уже есть в списке, увеличим количество
			НовСтрока = МассивСтрок[0];
			НовСтрока.Количество = НовСтрока.Количество + 1;
		Иначе
		
			//Добавим в список
			НовСтрока = ВыбранныеАвтоработы.Добавить();
			НовСтрока.Номенклатура = НоваяОпция;
			НовСтрока.Количество = 1;
			
			//Подставим цену //Доделать
			//На текущий момент подставляется чистая цена из регистра, без учета скидок
			//Вопрос автоматических скидок необходимо проработать
			//Renault Е.А. 
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ТипЦен", ТипЦенКП);
			Запрос.УстановитьПараметр("Авторабота", НоваяОпция);
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЦеныАвтоработСрезПоследних.Цена
			               |ИЗ
			               |	РегистрСведений.ЦеныАвторабот.СрезПоследних(
			               |			,Авторабота = &Авторабота) КАК ЦеныАвтоработСрезПоследних";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				НовСтрока.Цена = Выборка.Цена;
			КонецЕсли;
			
		КонецЕсли;
		
		//Расчитаем сумму строки
		НовСтрока.Сумма = НовСтрока.Цена * НовСтрока.Количество;
		
		ПересчитатьЦенуАвто();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоработыДобавитьПроизвольные(Команда)
	
	Перем НоваяОпция;
	Перем ЦенаОпции;
	
	Если ВвестиСтроку(НоваяОпция, "Введите название автоработы", 100, Ложь) Тогда
		
		Если ВвестиЧисло(ЦенаОпции, "Введите цену автоработы", 10, 2) Тогда
		
			//Добавим в список
			НовСтрока = ВыбранныеАвтоработы.Добавить();
			НовСтрока.Номенклатура = НоваяОпция;
			НовСтрока.Количество = 1;
			НовСтрока.Цена = ЦенаОпции;
			НовСтрока.Сумма = ЦенаОпции;
			
		КонецЕсли;
				
		//Расчитаем сумму строки
		
		ПересчитатьЦенуАвто();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоработыУдалить(Команда)
	
	ТекСтрока = Элементы.ВыбранныеАвтоработы.ТекущаяСтрока;
	
	Если ТекСтрока <> Неопределено Тогда
		Попытка 
			ВыбранныеАвтоработы.Удалить(ВыбранныеАвтоработы.Индекс(Элементы.ВыбранныеАвтоработы.ТекущиеДанные));
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОпцииДилераУдалить(Команда)
	
	ТекСтрока = Элементы.ВыбранноеОборудование.ТекущаяСтрока;
	
	Если ТекСтрока <> Неопределено Тогда		
		ВыбранноеОборудование.Удалить(ВыбранноеОборудование.Индекс(Элементы.ВыбранноеОборудование.ТекущиеДанные));		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОсновноеКПНажатие(Команда)
	
	Если ЗначениеЗаполнено(Элементы.СписокКП.ТекущаяСтрока) Тогда
		УстановитьКПОсновным(Элементы.СписокКП.ТекущаяСтрока);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКПОсновным(КПСсылка)
	
	УстановитьКПОсновнымСервер(КПСсылка);
	Элементы.СписокКП.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКПОсновнымСервер(КПСсылка)
	
	КПСсылка.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаСкидокНажатие(Команда)
	
	ФормаСкидок = ПолучитьФорму("Обработка.CRM_КонфигураторПодПланшет.Форма.ФормаУстановкиСкидок");
	ФормаСкидок.СуммаКонфигурации = ЦенаИТОГО;
	ФормаСкидок.СуммаСкидки = СуммаСкидки;
	ФормаСкидок.СуммаДоставки = СуммаДоставки;
	Ответ = ФормаСкидок.ОткрытьМодально();
	Если ЗначениеЗаполнено(Ответ) Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Ответ);
		СуммаДоставки = Ответ.СуммаДоставки;
	КонецЕсли;
	
	ПересчитатьЦенуАвто();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСкидки()
	
	//Если СуммаСкидки = 0 Тогда
	//	Элементы.СкидкаНаценка.Заголовок = "Установка скидок";
	//Иначе
	//	Элементы.СкидкаНаценка.Заголовок = "Скидка " + Строка(СуммаСкидки) + " р.";
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФИОПриИзменении(Элемент)
	СохранитьДанныеКлиента(ФИО, Телефон, Email);
	ОбновитьЗаголовокКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ТелефонПриИзменении(Элемент)
	СохранитьДанныеКлиента(ФИО, Телефон, Email);
КонецПроцедуры

&НаКлиенте
Процедура EmailПриИзменении(Элемент)
	СохранитьДанныеКлиента(ФИО, Телефон, Email);
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеКлиента(ФИО, Телефон, Email)
	
	Если Не ЗначениеЗаполнено(ТекущийКлиент) Тогда
		КлиентОбъект = Справочники.CRM_ПотенциальныеКонтрагенты.СоздатьЭлемент();		
		КлиентОбъект.Наименование = ФИО;
		КлиентОбъект.НаименованиеПолное = ФИО;
		КлиентОбъект.Записать();
	Иначе
		КлиентОбъект = ТекущийКлиент.ПолучитьОбъект();
		КлиентОбъект.Наименование = ФИО;
		КлиентОбъект.НаименованиеПолное = ФИО;
		КлиентОбъект.Записать();
	КонецЕсли;
	
	Renault_УправлениеКонтактнойИнформацией.ЗаписатьОсновнойТелефонКлиента(Телефон, КлиентОбъект.Ссылка);
	
	Renault_УправлениеКонтактнойИнформацией.ЗаписатьОсновнойEmailКлиента(Email, КлиентОбъект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеКлиентаСервер()
	
	Телефон = "";
	Email = "";
	ФИО = "";

	Если ЗначениеЗаполнено(ТекущийКлиент) Тогда
		
		Телефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(ТекущийКлиент);
		
		Email = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(ТекущийКлиент);
		
		ФИО = ТекущийКлиент.НаименованиеПолное;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеКП()
	
	НомерКП = "";
	ДатаКП = Неопределено;
	
	Если ЗначениеЗаполнено(ТекущееКП) Тогда
		НомерКП = ТекущееКП.Номер;
		ДатаКП = ТекущееКП.Дата;
		СрокДействия = ТекущееКП.СрокДействия;
		ТекущаяКонфигурация = ТекущееКП.Состав[0].Конфигурация;
		ЗаявкаНаТрейдИн = ТекущееКп.ЗаявкаНаТрейдИн;
		ИнтересовалсяТрейдИн = ТекущееКП.ИнтересовалсяТрейдИн;
		ИнтересовалсяСтраховкой = ТекущееКП.ИнтересовалсяСтраховкой;
		ЗаявкаНаКредит = ТекущееКп.ЗаявкаНаКредит;
		ЗаявкаНаСтраховку = ТекущееКП.ЗаявкаНаСтраховку;
		ИнтересовалсяКредитом = ТекущееКП.ИнтересовалсяКредитом;
        ЗаявкаНаОборудование = ТекущееКП.ЗаявкаНаОборудование;
		ЗагрузитьЗаявкуНаТрейдИн();
		ЗагрузитьЗаявкуНаКредит();
		ЗагрузитьЗаявкуНаГарантию();
		ЗагрузитьЗаявкуНаОборудование();
		ЗагрузитьЗаявкуНаСтраховку();

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокЦветов(ТекМодель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	&ПустаяСтрока КАК Цвет,
	               |	"""" КАК Код,
	               |	"""" КАК ЦветНаименование
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Renault_ЦветаМоделей.Цвет,
	               |	Renault_ЦветаМоделей.Цвет.Артикул,
	               |	Renault_ЦветаМоделей.Цвет.Наименование
	               |ИЗ
	               |	РегистрСведений.Renault_ЦветаМоделей КАК Renault_ЦветаМоделей
	               |ГДЕ
	               |	Renault_ЦветаМоделей.Модель = &Модель
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЦветНаименование";
	Запрос.УстановитьПараметр("Модель", ТекМодель);
	Запрос.УстановитьПараметр("ПустаяСтрока", Справочники.Цвета.ПустаяСсылка());
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Если Таблица.Количество() = 1 Тогда
		Таблица.Очистить();
	КонецЕсли;
	
	ТаблицаЦвета.Загрузить(Таблица);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокМоделей()
	
	Бренд = ПараметрыСеанса.DMS_Бренд;
	
	Если ЗначениеЗаполнено(Бренд) Тогда
		МаркаРено = Бренд;
	Иначе
		МаркаРено = CRM_Сервер.ПолучитьМаркуRenault();
	КонецЕсли;
	
	МассивМарок = Новый Массив;
	Если Не МаркаРено.Пустая() Тогда
		МассивМарок = МаркаРено.МоделиАвтомобилейКоммерческоеПредложение.ВыгрузитьКолонку("Модель");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	&ПустаяСтрока КАК Модель,
	               |	"""" КАК Наименование
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Модели.Ссылка,
	               |	Модели.Наименование
	               |ИЗ
	               |	Справочник.Модели КАК Модели
	               |ГДЕ
	               |	Модели.Ссылка В(&МассивМарок)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Наименование";
	Запрос.УстановитьПараметр("ПустаяСтрока", Справочники.Модели.ПустаяСсылка());
	Запрос.УстановитьПараметр("МассивМарок", МассивМарок);
	Таблица = Запрос.Выполнить().Выгрузить();
	ТаблицаМодели.Загрузить(Таблица);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокКонфигураций(ТекМодель)
					   
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	"""""""" КАК Комплектация,
	               |	&ПустаяСтрока КАК Ссылка,
	               |	"""""""" КАК Код,
	               |	"""""""" КАК Наименование
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ВариантКомплектации.НаименованиеПолное,
	               |	Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ВариантКомплектации.Ссылка,
	               |	Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ВариантКомплектации.Артикул,
	               |	ПОДСТРОКА(Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ВариантКомплектации.НаименованиеПолное, 0, 150)
	               |ИЗ
	               |	РегистрСведений.Renault_ТарифНаКомплектацииАвтомобилей.СрезПоследних(
	               |			,
	               |			Тариф = &Тариф
	               |				И Модель = &Модель) КАК Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних
	               |ГДЕ
	               |	Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ДоступноКЗаказуВПроизводство = ИСТИНА ИЛИ НЕ &СкрыватьНедоступныеКЗаказу
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Наименование";
				   
	Запрос.УстановитьПараметр("Модель", ТекМодель);
	Запрос.УстановитьПараметр("Тариф", ТекущийТариф);
	Запрос.УстановитьПараметр("ПустаяСтрока", Справочники.ВариантыКомплектации.ПустаяСсылка());
	Запрос.УстановитьПараметр("СкрыватьНедоступныеКЗаказу", Не ЗначениеЗаполнено(Автомобиль));
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Если Таблица.Количество() = 1 Тогда
		Таблица.Очистить();
	Иначе
	КонецЕсли;
	
	ТаблицаКомплектации.Загрузить(Таблица);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМоделиПриАктивизацииСтроки(Элемент)
	
	Если НеОбновлятьПриАктивизацииСтроки ИЛИ Элемент <> ЭтаФорма.ТекущийЭлемент Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.ТаблицаМодели.ТекущаяСтрока <> Неопределено Тогда
		Модель = Элементы.ТаблицаМодели.ТекущиеДанные.Модель;
	Иначе
		Модель = Неопределено;
	КонецЕсли;
	
	ОбновитьСписокКонфигураций(Модель);
	ОбновитьСписокЦветов(Модель);
	ОбновитьКартинкуМодели();
	ПриИзмененииМоделиАвто();
	VIN = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКомплектацииПриАктивизацииСтроки(Элемент)
		
	Если НеОбновлятьПриАктивизацииСтроки ИЛИ Элемент <> ЭтаФорма.ТекущийЭлемент Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.ТаблицаКомплектации.ТекущаяСтрока <> Неопределено Тогда
		Версия = Элементы.ТаблицаКомплектации.ТекущиеДанные.Ссылка;		
	Иначе
		Версия = Неопределено;
	КонецЕсли;
	
	ПриИзмененииВерсииАвто();
	VIN = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦветаПриАктивизацииСтроки(Элемент)
	
	Если НеОбновлятьПриАктивизацииСтроки ИЛИ Элемент <> ЭтаФорма.ТекущийЭлемент Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.ТаблицаЦвета.ТекущаяСтрока <> Неопределено Тогда
		Цвет = Элементы.ТаблицаЦвета.ТекущиеДанные.Цвет;		
	Иначе
		Цвет = Неопределено;
	КонецЕсли;
	VIN = "";
	
	//ОбновитьТаблицыСклад();
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницаКлиент(Команда)
	
	Элементы.ГруппаСтраницыКонфигурирование.ТекущаяСтраница
		= Элементы.ГруппаСтраницыКонфигурирование.ПодчиненныеЭлементы.ГруппаОсновное;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницаВерсия(Команда)
	Элементы.ГруппаСтраницыКонфигурирование.ТекущаяСтраница
		= Элементы.ГруппаСтраницыКонфигурирование.ПодчиненныеЭлементы.ГруппаАвтомобиль;
КонецПроцедуры

&НаКлиенте
Процедура СтраницаОпции(Команда)
	Элементы.ГруппаСтраницыКонфигурирование.ТекущаяСтраница
		= Элементы.ГруппаСтраницыКонфигурирование.ПодчиненныеЭлементы.ГруппаОпции;
		ОткрытьСтраницуОпцииПроизводителя(Команда);
КонецПроцедуры

&НаКлиенте
Процедура СтраницаСоставКП(Команда)
	
	Элементы.ГруппаСтраницыКонфигурирование.ТекущаяСтраница
		= Элементы.ГруппаСтраницыКонфигурирование.ПодчиненныеЭлементы.ГруппаСоставКП;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницаХарактеристики(Команда)
	Элементы.ГруппаСтраницыКонфигурирование.ТекущаяСтраница
		= Элементы.ГруппаСтраницыКонфигурирование.ПодчиненныеЭлементы.ГруппаОписаниеАвтомобиля;
КонецПроцедуры

&НаКлиенте
Процедура СтраницаРезультат(Команда)
	Элементы.ГруппаСтраницыКонфигурирование.ТекущаяСтраница = Элементы.ГруппаСтраницыКонфигурирование.ПодчиненныеЭлементы.ГруппаРезультат;
	
	//Если СоздаватьЗаявку Тогда
	//	Если ТрейдИнСумма = 0 Тогда
	//		Итог =Вопрос("Вы хотите создать заявку на Трейд-ин с неполными данными?",РежимДиалогаВопрос.ДаНет);
	//		Если Не(Итог = КодВозвратаДиалога.Да) Тогда
	//			СоздаватьЗаявку = Ложь;
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	//Если СоздаватьЗаявкуНаКредит Тогда
	//	Если СуммаКредита = 0 Тогда
	//		Итог =Вопрос("Вы хотите создать заявку на кредит с неполными данными?",РежимДиалогаВопрос.ДаНет);
	//		Если Не(Итог = КодВозвратаДиалога.Да) Тогда
	//			СоздаватьЗаявкуНаКредит = Ложь;
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	//Если СоздаватьЗаявкуНаСтраховку Тогда
	//	Если СтраховкаСумма = 0 Тогда
	//		Итог =Вопрос("Вы хотите создать заявку на страховку с неполными данными?",РежимДиалогаВопрос.ДаНет);
	//		Если Не(Итог = КодВозвратаДиалога.Да) Тогда
	//			СоздаватьЗаявкуНаСтраховку = Ложь;
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
					
КонецПроцедуры

&НаКлиенте
Процедура Печать(Док) Экспорт
	                                      
	ТабличныйДокумент = Элементы.Результат;
          
	Результат = ПоказатьНаПечать(Док);	
	
КонецПроцедуры

&НаСервере
Функция ПоказатьНаПечать(Док) 
	
	МассивКП = Новый массив();
	МассивКП.Добавить(ТекущееКП);
	ТабДокумент = Новый ТабличныйДокумент;
	Документы.CRM_КоммерческоеПредложение.Печать(МассивКП,ТабДокумент,"ПФ_MXL_КП");
		
	Возврат ТабДокумент;
		
КонецФункции
	
Функция ПолучитьДанныеШапки(Док)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	CRM_КоммерческоеПредложение.Клиент.Наименование КАК НаименованиеКлиента,
	|	АдресаОрганизаций.Объект.Наименование КАК НаименованиеОрганизации,
	|	АдресаОрганизаций.Представление КАК АдресОрганизации,
	|	CRM_КоммерческоеПредложение.Клиент,
	|	&Организация,
	|	CRM_КоммерческоеПредложение.Автор.Сотрудник КАК КонтактноеЛицо,
	|	CRM_КоммерческоеПредложение.СрокДействия
	|ИЗ
	|	Документ.CRM_КоммерческоеПредложение КАК CRM_КоммерческоеПредложение
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КонтактнаяИнформация.Объект КАК Объект,
	|			КонтактнаяИнформация.Представление КАК Представление
	|		ИЗ
	|			РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ГДЕ
	|			КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЮридический)
	|			И КонтактнаяИнформация.Объект = &Организация) КАК АдресаОрганизаций
	|		ПО (ИСТИНА)
	|ГДЕ
	|	CRM_КоммерческоеПредложение.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Док);
	Запрос.УстановитьПараметр("Организация", ПараметрыСеанса.Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьБазовыеОпции(Модель, Версия)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОпцииВариантовКомплектации.Опция.Наименование КАК НаименованиеОпции
	|ИЗ
	|	РегистрСведений.ОпцииВариантовКомплектации КАК ОпцииВариантовКомплектации
	|ГДЕ
	|	ОпцииВариантовКомплектации.ВариантКомплектации = &Версия
	|	И ОпцииВариантовКомплектации.ВидВключения = 2";
	Запрос.УстановитьПараметр("Версия", Версия);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено
	Иначе
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("НаименованиеОпции");
	КонецЕсли;
	
КонецФункции

Функция ПолучитьКонтакт(Объект, ВидКонтакта)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Вид = &Вид";
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Вид", ВидКонтакта);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Представление;
	Иначе
		Возврат ""
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВыбратьОпцию(Команда)
	
	Элементы.ВыбранныеНебазовыеОпции.ТекущиеДанные.Выбран = Не Элементы.ВыбранныеНебазовыеОпции.ТекущиеДанные.Выбран;
	ПересчитатьЦенуАвто();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПоEmail(Команда)
	// Вставить содержимое обработчика.
	ОтправитьКП(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура КомТранс_ИсточникИнформации(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомТранс_ЮрЛицо(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СтраницаПродукты(Команда)
	Элементы.ГруппаСтраницыКонфигурирование.ТекущаяСтраница
		= Элементы.ГруппаСтраницыКонфигурирование.ПодчиненныеЭлементы.ГруппаПродукты;
КонецПроцедуры

&НаКлиенте
Процедура СуммаКредитаПриИзменении(Элемент)
	ПересчитатьКредит();
КонецПроцедуры

&НаКлиенте
Процедура МаркетинговаяСтавкаПриИзменении(Элемент)
	ПересчитатьКредит();
КонецПроцедуры

&НаКлиенте
Процедура ЕжемесячныйПлатежПриИзменении(Элемент)
	ПересчитатьКредит();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтраницуОпцииДилера(Команда)
	Элементы.ГруппаОпцииДилера.Видимость = Истина;
	Элементы.ГруппаОпцииПроизводителя.Видимость = Ложь;
	Элементы.КнопкаОткрытьСтраницуОпцииДилера.Шрифт = Новый Шрифт(Элементы.КнопкаОткрытьСтраницуОпцииДилера.Шрифт,,,Истина);
	Элементы.КнопкаОткрытьСтраницуОпцииПроизводителя.Шрифт = Новый Шрифт(Элементы.КнопкаОткрытьСтраницуОпцииПроизводителя.Шрифт,,,Ложь);
	ИнтересовалсяОборудованием = Истина;
	СоздаватьЗаявкуНаОборудование = Истина;
	ОбновитьКнопкиЗаявок();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтраницуОпцииПроизводителя(Команда)
	Элементы.ГруппаОпцииДилера.Видимость = Ложь;
	Элементы.ГруппаОпцииПроизводителя.Видимость = Истина;
	Элементы.КнопкаОткрытьСтраницуОпцииДилера.Шрифт = Новый Шрифт(Элементы.КнопкаОткрытьСтраницуОпцииДилера.Шрифт,,,Ложь);
	Элементы.КнопкаОткрытьСтраницуОпцииПроизводителя.Шрифт = Новый Шрифт(Элементы.КнопкаОткрытьСтраницуОпцииПроизводителя.Шрифт,,,Истина);
КонецПроцедуры

&НаКлиенте
Процедура Продукты_ТрейдИн(Команда)
	СнятьОтображениеПродуктов();
	ОтображатьТрейдИн = Истина;
	ОбновитьОтображениеПродукты();
	ИнтересовалсяТрейдИн = Истина;
	СоздаватьЗаявку = Истина;
	ОбновитьКнопкиЗаявок();
КонецПроцедуры

&НаКлиенте
Процедура Продукты_Кредит(Команда)
	СнятьОтображениеПродуктов();
	ОтображатьКредит = Истина;
	ОбновитьОтображениеПродукты();
	ИнтересовалсяКредитом = Истина;
	СоздаватьЗаявкуНаКредит = Истина;
	ОбновитьКнопкиЗаявок();
КонецПроцедуры

&НаКлиенте
Процедура Продукты_Страховка(Команда)
	СнятьОтображениеПродуктов();
	ОтображатьСтраховку = Истина;
	ОбновитьОтображениеПродукты();
	ИнтересовалсяСтраховкой =Истина;
	СоздаватьЗаявкуНаСтраховку = истина;
	ОбновитьКнопкиЗаявок();

КонецПроцедуры

&НаКлиенте
Процедура ПродуктыГарантия(Команда)
	СнятьОтображениеПродуктов();
	ОтображатьГарантию = Истина;
	ОбновитьОтображениеПродукты();
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтображениеПродуктов()
	
	ОтображатьГарантию = Ложь;
	ОтображатьКредит = Ложь;
	ОтображатьСтраховку = Ложь;
	ОтображатьТрейдИн = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеПродукты()
	
	Элементы.ГруппаПродленнаяГарантия.Видимость = Ложь;
	Элементы.ГруппаТрейдИн.Видимость = Ложь;
	Элементы.ГруппаСтраховка.Видимость = Ложь;
	Элементы.ГруппаРасчетКредита.Видимость = Ложь;
	
	Элементы.Продукты_Гарантия.Шрифт = Новый Шрифт(Элементы.Продукты_Гарантия.Шрифт,,,Ложь);
	Элементы.Продукты_Кредит.Шрифт = Новый Шрифт(Элементы.Продукты_Кредит.Шрифт,,,Ложь);
	Элементы.Продукты_Страховка.Шрифт = Новый Шрифт(Элементы.Продукты_Страховка.Шрифт,,,Ложь);
	Элементы.Продукты_ТрейдИн.Шрифт = Новый Шрифт(Элементы.Продукты_ТрейдИн.Шрифт,,,Ложь);
	
	Если ОтображатьГарантию Тогда
		Элементы.ГруппаПродленнаяГарантия.Видимость = Истина;
		Элементы.Продукты_Гарантия.Шрифт = Новый Шрифт(Элементы.Продукты_Гарантия.Шрифт,,,Истина);
		
	ИначеЕсли ОтображатьКредит Тогда
		Элементы.ГруппаРасчетКредита.Видимость = Истина;
		Элементы.Продукты_Кредит.Шрифт = Новый Шрифт(Элементы.Продукты_Кредит.Шрифт,,,Истина);
		
	ИначеЕсли ОтображатьСтраховку Тогда
		Элементы.ГруппаСтраховка.Видимость = Истина;
		Элементы.Продукты_Страховка.Шрифт = Новый Шрифт(Элементы.Продукты_Страховка.Шрифт,,,Истина);
		
	ИначеЕсли ОтображатьТрейдИн Тогда
		Элементы.ГруппаТрейдИн.Видимость = Истина;
		Элементы.Продукты_ТрейдИн.Шрифт = Новый Шрифт(Элементы.Продукты_ТрейдИн.Шрифт,,,Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Перезаписать(Конфигурация)
	
	Если НЕ ЗначениеЗаполнено(ТекущееКП) Тогда
		
		ОбКП = Документы.CRM_КоммерческоеПредложение.СоздатьДокумент();
		ОбКП.Дата			= ТекущаяДата();
		ОбКП.Автор			= ПараметрыСеанса.Пользователь;
		ОбКП.СрокДействия	= ТекущаяДата() + 86400 * Константы.CRM_СрокДействияКП.Получить();
		//ОбКП.СрокПоставки	= ТекущаяДата() + 86400 * Константы.CRM_СрокПоставки.Получить();
		ОбКП.Клиент			= ТекущийКлиент;
		ОбКП.РабочийЛист	= ТекущийРабочийЛист;
		ОбКП.ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
		ОбКП.ЗаявкаНаТрейдИн = СоздатьНайтиЗаявкуНаТрейдИн();
		обКП.ИнтересовалсяТрейдИн = ИнтересовалсяТрейдИн;
		ОбКП.ЗаявкаНаКредит = СоздатьНайтиЗаявкуНаКредит();
		ОбКП.ЗаявкаНаГарантию = СоздатьНайтиЗаявкуНаГарантию();
		ОбКП.ЗаявкаНаОборудование = СоздатьНайтиЗаявкуНаОборудование();
		обКП.ИнтересовалсяКредитом = ИнтересовалсяКредитом;
		Обкп.ИнтересовалсяСтраховкой = ИнтересовалсяСтраховкой;
		ОбКП.ЗаявкаНаСтраховку = СоздатьНайтиЗаявкуНаСтраховку();
		ОбКП.Записать();
		
		ТекущееКП = ОбКП.Ссылка;
		
	Иначе
		
		ОбКП = ТекущееКП.ПолучитьОбъект();
		
	КонецЕсли;
	
	СтрКонф = ОбКП.Состав.Найти(Элементы.СоставКП.ТекущаяСтрока, "Конфигурация");
	СтрКонф.Конфигурация = Конфигурация;
	СтрКонф.Сумма = ЦенаИТОГО;
	СтрКонф.СуммаДоставки = СуммаДоставки;
	СтрКонф.СуммаСкидки = СуммаСкидки;
	
	НомерКП = ОбКП.Номер;
	ДатаКП = ОбКП.Дата;
	
	ОбКП.Сумма = ОбКП.Состав.Итог("Сумма");
	ОбКП.ЗаявкаНаТрейдИн = СоздатьНайтиЗаявкуНаТрейдИн();
	обКП.ИнтересовалсяТрейдИн = ИнтересовалсяТрейдИн;
	ОбКП.ЗаявкаНаКредит = СоздатьНайтиЗаявкуНаКредит();
	ОбКП.ЗаявкаНаГарантию = СоздатьНайтиЗаявкуНаГарантию();
	обКП.ИнтересовалсяКредитом = ИнтересовалсяКредитом;
	ОбКП.ЗаявкаНаОборудование = СоздатьНайтиЗаявкуНаОборудование();
	Обкп.ИнтересовалсяСтраховкой = ИнтересовалсяСтраховкой;
	ОбКП.ЗаявкаНаСтраховку = СоздатьНайтиЗаявкуНаСтраховку();
	ОбКП.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСклад(Команда)
	//Корзюков начало

	ДилерскийЦентрПользователя = Renault_РаботаСПравамиПользователя.ДилерскийЦентрПоУмолчанию(ПараметрыСеанса.Пользователь);
		
		Если Не ЗначениеЗаполнено(ДилерскийЦентрПользователя) Тогда
			#Если Клиент Тогда
				Предупреждение("Для пользователя не задан дилерский центр!");
			#конецЕсли
			Возврат;
		КонецЕсли;
		
		Если ДилерскийЦентрПользователя.Автосклад_ИспользоватьНовуюФормуСклада = Истина Тогда
			
			Форма = Обработки.Renault_АРМ_Автосклад.ПолучитьФорму("Обработка.Renault_АРМ_Автосклад_Упр.Форма.ФормаДинамическийСписок");


			
		Иначе
				Форма = Обработки.Renault_АРМ_Автосклад.ПолучитьФорму("Обработка.Renault_АРМ_Автосклад.Форма.Форма");


		КонецЕсли;
     //Корзюков конец

	//Форма = Обработки.Renault_АРМ_Автосклад.ПолучитьФорму("Обработка.Renault_АРМ_Автосклад.Форма.Форма");
	Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура СтраницаСклад(Команда)
	Элементы.ГруппаСтраницыКонфигурирование.ТекущаяСтраница
		= Элементы.ГруппаСтраницыКонфигурирование.ПодчиненныеЭлементы.ГруппаСклад;
	КонецПроцедуры
	
	&НаСервере
Процедура ОбновитьТаблицыСклад()
		
	ТекущийДЦ = Renault_РаботаСПравамиПользователя.ДилерскийЦентрПоУмолчанию(ПараметрыСеанса.Пользователь);
	BIR_Distri = СокрЛП(ТекущийДЦ.BIR_Distri);
	МассивСкладовДилера = ТекущийДЦ.СкладыДилера.ВыгрузитьКолонку("Склад");
	ТаблицаСклад.Загрузить(CRM_Сервер.Автосклад_ПолучитьТаблицуПоСостояниюАвтомобилей("", МассивСкладовДилера, BIR_Distri, Ложь, Ложь, Ложь, Ложь, Модель, Версия, Цвет, Ложь,, ТекущийДЦ.ДатаНеПоказыватьВыданныеАвтомобили));
	
КонецПроцедуры

&НаКлиенте
Процедура Склад_Предложения(Команда)
	ОтображатьПредложения = Истина;
	ОтображатьСклад = Ложь;
	ОбновитьОтображениеСклад();
КонецПроцедуры

&НаКлиенте
Процедура Склад_Склад(Команда)
	ОтображатьПредложения = Ложь;
	ОтображатьСклад = Истина;
	ОбновитьОтображениеСклад();
КонецПроцедуры

Процедура ОбновитьОтображениеСклад()
	
	Элементы.ГруппаСкладПоКП.Видимость = Ложь;
	Элементы.ГруппаПредложения.Видимость = Ложь;

	Элементы.Склад_Предложения.Шрифт = Новый Шрифт(Элементы.Склад_Предложения.Шрифт,,,Ложь);
	Элементы.Склад_Склад.Шрифт = Новый Шрифт(Элементы.Склад_Склад.Шрифт,,,Ложь);
	
	Если ОтображатьПредложения Тогда
		Элементы.ГруппаПредложения.Видимость = Истина;
		Элементы.Склад_Предложения.Шрифт = Новый Шрифт(Элементы.Склад_Предложения.Шрифт,,,Истина);
		
	ИначеЕсли ОтображатьСклад Тогда
		Элементы.ГруппаСкладПоКП.Видимость = Истина;
		Элементы.Склад_Склад.Шрифт = Новый Шрифт(Элементы.Склад_Склад.Шрифт,,,Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
Процедура ОбновитьРежимРедактирования()
	
	Если ЗначениеЗаполнено(Автомобиль) Тогда
		//Нет свободного редактирования		
		
		//ограничение доступности
		Элементы.ГруппаКомплектация.Доступность = Ложь;
		//Элементы.ВыбранныеНебазовыеОпции.Доступность = Ложь;
		Элементы.ВыбранныеНебазовыеОпции.ТолькоПросмотр = Истина;
		Элементы.ВыбратьОпцию.Видимость = Ложь;
		
		//видимость элементов
		Элементы.КнопкаПерейтиВРежимСвободногоРедактирования.Видимость = Истина;
		
		//выделение цветом
		Элементы.ТаблицаКомплектации.ЦветФона = Новый Цвет(248, 242, 216);
		Элементы.ТаблицаМодели.ЦветФона = Новый Цвет(248, 242, 216);
		Элементы.ТаблицаЦвета.ЦветФона = Новый Цвет(248, 242, 216);
		Элементы.ВыбранныеНебазовыеОпции.ЦветФона = Новый Цвет(248, 242, 216);
		
	Иначе
		//Свободное редактирование		
		
		//ограничение доступности
		Элементы.ГруппаКомплектация.Доступность = Истина;
		//Элементы.ВыбранныеНебазовыеОпции.Доступность = Истина;
		Элементы.ВыбранныеНебазовыеОпции.ТолькоПросмотр = Ложь;
		Элементы.ВыбратьОпцию.Видимость = Истина;
		
		//видимость элементов
		Элементы.КнопкаПерейтиВРежимСвободногоРедактирования.Видимость = Истина;
		
		//выделение цветом
		Элементы.ТаблицаКомплектации.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ТаблицаМодели.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ТаблицаЦвета.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ВыбранныеНебазовыеОпции.ЦветФона = Новый Цвет(255, 255, 255);
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура КнопкаИнтересовалсяОборудованием(Команда)
	// Вставить содержимое обработчика.
	ИнтересовалсяОборудованием =Не ИнтересовалсяОборудованием;
	СоздаватьЗаявкуНаОборудование = ИнтересовалсяОборудованием;	
	ОбновитьКнопкиЗаявок();
КонецПроцедуры


&НаКлиенте
Процедура КнопкаСоздаватьЗаявкуНаОборудование(Команда)
	// Вставить содержимое обработчика.
	СоздаватьЗаявкуНаОборудование = Не СоздаватьЗаявкуНаОборудование;	
	ОбновитьКнопкиЗаявок();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКнопкиЗаявок()
	// Вставить содержимое обработчика.
	ЦветИстина = Новый Цвет(255, 196, 35);
	ЦветЛожь = Новый Цвет(245,242,221);
	
	Если ИнтересовалсяОборудованием Тогда
		Элементы.КнопкаИнтересовалсяОборудованием.ЦветФона =ЦветИстина;
	Иначе
		Элементы.КнопкаИнтересовалсяОборудованием.ЦветФона =ЦветЛожь;
	КонецЕсли;
	Если СоздаватьЗаявкуНаОборудование Тогда
		Элементы.КнопкаСоздаватьЗаявкуНаОборудование.ЦветФона =ЦветИстина;
	Иначе
		Элементы.КнопкаСоздаватьЗаявкуНаОборудование.ЦветФона =ЦветЛожь;
	КонецЕсли;
	
	Если ИнтересовалсяТрейдИн Тогда
		Элементы.КнопкаИнтересовалсяТрейдИн.ЦветФона =ЦветИстина;
	Иначе
		Элементы.КнопкаИнтересовалсяТрейдИн.ЦветФона =ЦветЛожь;
	КонецЕсли;
	Если СоздаватьЗаявку Тогда
		Элементы.КнопкаСоздаватьЗаявкуТрейдИн.ЦветФона =ЦветИстина;
		
	Иначе
		Элементы.КнопкаСоздаватьЗаявкуТрейдИн.ЦветФона =ЦветЛожь;
	КонецЕсли;
	
	Если ИнтересовалсяСтраховкой Тогда
		Элементы.КнопкаИнтересовалсяСтраховкой.ЦветФона =ЦветИстина;
	Иначе
		Элементы.КнопкаИнтересовалсяСтраховкой.ЦветФона =ЦветЛожь;
	КонецЕсли;
	Если СоздаватьЗаявкуНаСтраховку Тогда
		Элементы.КнопкаСоздаватьЗаявкуНаСтраховку.ЦветФона =ЦветИстина;
		
	Иначе
		Элементы.КнопкаСоздаватьЗаявкуНаСтраховку.ЦветФона =ЦветЛожь;
	КонецЕсли;
	
	Если ИнтересовалсяКредитом Тогда
		Элементы.КнопкаИнтересовалсяКредитом.ЦветФона =ЦветИстина;
	Иначе
		Элементы.КнопкаИнтересовалсяКредитом.ЦветФона =ЦветЛожь;
	КонецЕсли;
	Если СоздаватьЗаявкуНаКредит Тогда
		Элементы.КнопкаСоздаватьЗаявкуНаКредит.ЦветФона =ЦветИстина;
		
	Иначе
		Элементы.КнопкаСоздаватьЗаявкуНаКредит.ЦветФона =ЦветЛожь;
	КонецЕсли;


	
КонецПроцедуры



&НаКлиенте
Процедура ЗаявкаНаОборудованиеОчистка(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ОбновитьКнопкиЗаявок();
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаявкаНаОборудованиеПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ЗагрузитьЗаявкуНаОборудование();
	ОбновитьКнопкиЗаявок();

КонецПроцедуры


&НаКлиенте
Процедура ЗаявкаНаОборудованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
		
	Форма = Документы.CRM_ЗаявкаНаДилерскиеОпции.ПолучитьФорму("Документ.CRM_ЗаявкаНаДилерскиеОпции.Форма.ФормаСпискаДокументов");
	Форма.Отбор.Клиент.ВидСравнения = ВидСравнения.Равно;
	Форма.Отбор.Клиент.Значение = ТекущийКлиент;
	Форма.Отбор.Клиент.Использование= Истина;
	Форма.Отбор.Черновик.ВидСравнения = ВидСравнения.Равно;
    Форма.Отбор.Черновик.Значение= ложь;
	Форма.Отбор.Черновик.Использование= Истина;
	Форма.Отбор.Закрыта.ВидСравнения = ВидСравнения.Равно;
    Форма.Отбор.Закрыта.Значение= ложь;
	Форма.Отбор.Закрыта.Использование= Истина;
	Форма.Отбор.ПометкаУдаления.Значение = Ложь;
	Форма.Отбор.ПометкаУдаления.Использование = Истина;
	Форма.РежимВыбора = истина;
	
    Итог = Форма.ОткрытьМодально();
	ЗаявкаНаОборудованиеВыборСервер(Итог);
	ЗагрузитьЗаявкуНаОборудование();
	ОбновитьКнопкиЗаявок();
	
    СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаСервере
процедура ЗагрузитьЗаявкуНаОборудование()
	
	//Если ЗначениеЗаполнено(ЗаявкаНаОборудование) тогда
	//	ВыбранноеОборудование.Очистить();

	//	Для Каждого Оборудование Из ЗаявкаНаОборудование.ДопОпции Цикл
	//		Если Оборудование.Выбрана Тогда
	//			ТекОпция = Оборудование.ПсевдоОпция;
	//			ТекКоличество = Оборудование.ПсевдоКоличество;
	//			ТекСумма = оборудование.ПсевдоСумма;
	//			ТекЦена = Оборудование.Цена;
	//			Если ЗначениеЗаполнено(Оборудование.Опция) Тогда
	//				ТекОпция  = Оборудование.Опция;
	//				ТекКоличество = Оборудование.Количество;
	//				ТекСумма = оборудование.Сумма;
	//			КонецЕсли;
	//			НовСтрока  = ВыбранноеОборудование.Добавить();
	//			НовСтрока.Номенклатура = ТекОпция;
	//			НовСтрока.Количество = ТекКоличество;
	//			НовСтрока.Сумма = ТекСумма;
	//			НовСтрока.Цена = ТекЦена;
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	Для Каждого Авторабота Из ЗаявкаНаОборудование.Автоработы Цикл
	//		Если Авторабота.Выбрана Тогда
	//			ТекАвторабота = Авторабота.ПсевдоАвторабота;
	//			ТекКоличество = Авторабота.ПсевдоКоличество;
	//			ТекСумма = Авторабота.ПсевдоСумма;
	//			ТекЦена = Авторабота.Цена;
	//			Если ЗначениеЗаполнено(Авторабота.Авторабота) Тогда
	//				ТекАвторабота = Авторабота.Авторабота;
	//				ТекКоличество = Авторабота.Количество;
	//				ТекСумма = Авторабота.Сумма;
	//			КонецЕсли;
	//			НовСтрока = ВыбранныеАвтоработы.Добавить();
	//			НовСтрока.Номенклатура = ТекАвторабота;
	//			НовСтрока.Количество = ТекКоличество;
	//			НовСтрока.Сумма = ТекСумма;
	//			НовСтрока.Цена = ТекЦена;
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
процедура ЗаявкаНаОборудованиеВыборСервер(Значение) экспорт
	
	ЗаявкаНаОборудование =  Значение;
   
КонецПроцедуры



&НаСервере
процедура ЗагрузитьЗаявкуНаТрейдИн()
	
	Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн) тогда
		
		ТрейдИнВерсия =ЗаявкаНаТрейдИн.Версия;
		ТрейдИнГодВыпуска=ЗаявкаНаТрейдИн.ГодВыпуска ;
		
		ТрейдИнКомментарий=	ЗаявкаНаТрейдИн.Комментарий ;
		ТрейдИнМодель=ЗаявкаНаТрейдИн.Модель ;
		ТрейдИнПробег=ЗаявкаНаТрейдИн.Пробег ;
		
		ТрейдИнСумма=ЗаявкаНаТрейдИн.СуммаСНДС ;
		ТрейдИнЦвет=ЗаявкаНаТрейдИн.Цвет ;
		
		ИнтересовалсяТрейдИн = истина;
				
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере 
Функция СоздатьНайтиЗаявкуНаТрейдИн()
	
	ЗначениеПустое = Ложь;
	Если ЗначениеЗаполнено(ЗаявкаНаТрейдИн) Тогда
		
		ДокОб = ЗаявкаНаТрейдИн.Ссылка.ПолучитьОбъект();
		
	ИначеЕсли  СоздаватьЗаявку Тогда
		
		ДокОб = Документы.Renault_ЗаявкаНаТрейдИн.СоздатьДокумент();
	Иначе
		
		ДокОб =  Документы.Renault_ЗаявкаНаТрейдИн.ПустаяСсылка();
		ЗначениеПустое = Истина;
		
	КонецЕсли;
	
	Если Не(ЗначениеПустое)Или СоздаватьЗаявку Тогда
		МожноСохранить = Ложь;
		Если НЕ ДокОб.ЭтоНовый() Тогда
			Если ДокОб.Черновик И Не ДокОб.Закрыта Тогда
			   МожноСохранить = Истина;
				
			КонецЕсли;
		Иначе
			
			МожноСохранить = Истина;
			
		КонецЕсли;
		Если МожноСохранить тогда
			
			ДокОб.Версия = ТрейдИнВерсия;
			ДокОб.ГодВыпуска = ТрейдИнГодВыпуска;
			ДокОб.Дата = ТекущаяДата();
			ДокОб.Клиент = ТекущийКлиент;
			ДокОб.Комментарий = ТрейдИнКомментарий;
			ДокОб.Модель = ТрейдИнВерсия;
			ДокОб.Марка = ТрейдИнМодель;
			ДокОб.Пробег = ТрейдИнПробег;
			ДокОб.РабочийЛист = ТекущийРабочийЛист;
			Докоб.СрокДействия = СрокДействия;
			ДокОб.ОриентировочнаяЦена = ТрейдИнСумма;
			ДокОб.Цвет = ТрейдИнЦвет;
			ДокОб.ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
			ДокОб.Записать(РежимЗаписиДокумента.Проведение);
			ЗаявкаНаТрейдИн = ДокОб.Ссылка;
			ИнтересовалсяТрейдИн = Истина;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДокОб.Ссылка;	
КонецФункции

&НаКлиенте
Процедура ЗаявкаНаТрейдИнПриИзменении(Элемент)
	
	ЗагрузитьЗаявкуНаТрейдИн();
	ОбновитьКнопкиЗаявок();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаТрейдИнНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Форма = Документы.Renault_ЗаявкаНаТрейдИн.ПолучитьФорму("Документ.Renault_ЗаявкаНаТрейдИн.ФормаВыбора");
	Форма.Отбор.Клиент.ВидСравнения = ВидСравнения.Равно;
	Форма.Отбор.Клиент.Значение = ТекущийКлиент;
	Форма.Отбор.Клиент.Использование = Истина;
	Форма.Отбор.Черновик.ВидСравнения = ВидСравнения.Равно;
    Форма.Отбор.Черновик.Значение  = ложь;
	Форма.Отбор.Черновик.Использование = Истина;
	Форма.Отбор.Закрыта.ВидСравнения = ВидСравнения.Равно;
    Форма.Отбор.Закрыта.Значение = ложь;
	Форма.Отбор.Закрыта.Использование = Истина;
	Форма.Отбор.ПометкаУдаления.Значение = Ложь;
	Форма.Отбор.ПометкаУдаления.Использование = Истина;
	Форма.РежимВыбора = истина;
	
	Итог = Форма.ОткрытьМодально();
	ЗаявкаНаТрейдИнВыборСервер(Итог);
	ОбновитьКнопкиЗаявок();
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаСервере
процедура ЗаявкаНаТрейдИнВыборСервер(Значение) экспорт
	
	ЗаявкаНаТрейдИн = Значение;
   
КонецПроцедуры

	
	&НаКлиенте
Процедура ЗаявкаНаТрейдИнОчистка(Элемент, СтандартнаяОбработка)
	ОбновитьКнопкиЗаявок();
КонецПроцедуры

&НаКлиенте
Процедура ИнтересовалсяТрейдИнПриИзменении(Элемент)
	СоздаватьЗаявку = ИнтересовалсяТрейдИн;
	//ОбновитьОтображениеГруппПоЗаявкам();	
КонецПроцедуры

&НаКлиенте
Процедура ИнтересовалсяКредитомПриИзменении(Элемент)
	СоздаватьЗаявкуНаКредит = ИнтересовалсяКредитом;
	//ОбновитьОтображениеГруппПоЗаявкам();	
КонецПроцедуры

&НаСервере 
Функция СоздатьНайтиЗаявкуНаКредит()
	
	ЗначениеПустое = Ложь;
	Если ЗначениеЗаполнено(ЗаявкаНаКредит) Тогда
		ДокОб = ЗаявкаНаКредит.Ссылка.ПолучитьОбъект();
	ИначеЕсли  СоздаватьЗаявкуНаКредит Тогда
		ДокОб = Документы.Renault_CRM_ЗаявкаНаКредит.СоздатьДокумент();
	Иначе
		ДокОб = Документы.Renault_CRM_ЗаявкаНаКредит.ПустаяСсылка();
		ЗначениеПустое= Истина;
	КонецЕсли;
	
	Если Не(ЗначениеПустое)Или СоздаватьЗаявкуНаКредит Тогда
		МожноСохранить = Ложь;
		Если НЕ ДокОб.ЭтоНовый() Тогда
			Если Не ДокОб.ВыполненаУспешно Тогда
			   МожноСохранить = Истина;
			КонецЕсли;
		Иначе
			МожноСохранить = Истина;
		КонецЕсли;
		Если МожноСохранить тогда
			ДокОб.Версия = Версия;
			ДокОб.Дата = ТекущаяДата();
			ДокОб.Клиент = Метаданные.Документы.Renault_CRM_ЗаявкаНаКредит.Реквизиты.Клиент.Тип.ПривестиЗначение( ТекущийКлиент);
			//ДокОб.Комментарий = ТрейдИнКомментарий;
			ДокОб.Модель = Модель;
			ДокОб.РабочийЛист = ТекущийРабочийЛист;
			ДокОб.Сумма = СуммаКредита;
			ДокОб.Цвет = Цвет;
			ДокОб.БанкПредоставляющийКредит = Банк;
			ДокОб.ЕжемесячныйПлатеж = ЕжемесячныйПлатеж;
			ДокОб.ПервоночальныйВзносПроцент = ПервоначальныйВзносПроцент;
			ДокОб.ПервоночальныйВзнос = ПервоначальныйВзносСумма;
			ДокОб.Срок = СрокКредита;
			ДокОб.Ставка = МаркетинговаяСтавка;
			ДокОб.ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
			ДокОб.Записать(РежимЗаписиДокумента.Проведение);
			ЗаявкаНаКредит = ДокОб.Ссылка;
			ИнтересовалсяКредитом = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДокОб.Ссылка;
	
КонецФункции

&НаСервере
процедура ЗагрузитьЗаявкуНаКредит()
	
	Если ЗначениеЗаполнено(ЗаявкаНаКредит) тогда
		Банк = ЗаявкаНаКредит.БанкПредоставляющийКредит;
		СуммаКредита  = ЗаявкаНаКредит.Сумма;
		МаркетинговаяСтавка = ЗаявкаНаКредит.Ставка;
		ЕжемесячныйПлатеж = ЗаявкаНаКредит.ЕжемесячныйПлатеж;
		СрокКредита = ЗаявкаНаКредит.Срок;
		ПервоначальныйВзносСумма = ЗаявкаНаКредит.ПервоночальныйВзнос;
		ПервоначальныйВзносПроцент = ЗаявкаНаКредит.ПервоночальныйВзносПроцент;
		
		ИнтересовалсяКредитом = истина;
				
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаКредитПриИзменении(Элемент)
	
	
	ОбновитьКнопкиЗаявок();

КонецПроцедуры


&НаКлиенте
Процедура ЗаявкаНаКредитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Форма = Документы.Renault_CRM_ЗаявкаНаКредит.ПолучитьФорму("Документ.Renault_CRM_ЗаявкаНаКредит.ФормаВыбора");
	Форма.Отбор.Клиент.ВидСравнения = ВидСравнения.Равно;
	Форма.Отбор.Клиент.Значение = ТекущийКлиент;
	Форма.Отбор.Клиент.Использование= Истина;
	Форма.Отбор.Черновик.ВидСравнения = ВидСравнения.Равно;
    Форма.Отбор.Черновик.Значение= ложь;
	Форма.Отбор.Черновик.Использование= Истина;
	Форма.Отбор.Закрыта.ВидСравнения = ВидСравнения.Равно;
    Форма.Отбор.Закрыта.Значение= ложь;
	Форма.Отбор.Закрыта.Использование= Истина;
	Форма.Отбор.ПометкаУдаления.Значение = Ложь;
	Форма.Отбор.ПометкаУдаления.Использование = Истина;
	Форма.РежимВыбора = истина;
	
	Итог = Форма.ОткрытьМодально();
	ЗаявкаНаКредитВыборСервер(Итог);
	ОбновитьКнопкиЗаявок();
    СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаСервере
процедура ЗаявкаНаКредитВыборСервер(Значение) экспорт
	
	ЗаявкаНаКредит = Значение;
   
КонецПроцедуры


&НаКлиенте
Процедура ЗаявкаНаКредитОчистка(Элемент, СтандартнаяОбработка)
	ОбновитьКнопкиЗаявок();
КонецПроцедуры

&НаСервере 
Функция СоздатьНайтиЗаявкуНаГарантию()
	
	ЗначениеПустое = Ложь;
	Если ЗначениеЗаполнено(ЗаявкаНаГарантию) Тогда
		ДокОб = ЗаявкаНаГарантию.Ссылка.ПолучитьОбъект();
	ИначеЕсли  ЗначениеЗаполнено(ПродленнаяГарантия)Или ЗначениеЗаполнено(ГарантияСумма) Тогда
		ДокОб = Документы.Renault_CRM_ЗаявкаНаГарантию.СоздатьДокумент();
	Иначе
		ДокОб = Документы.Renault_CRM_ЗаявкаНаГарантию.ПустаяСсылка();
		ЗначениеПустое = Истина;
	КонецЕсли;
	
	Если Не(ЗначениеПустое) И (не(ДокОб = неопределено)) Тогда
		МожноСохранить = Ложь;
		Если НЕ ДокОб.ЭтоНовый() Тогда
			Если Не ДокОб.ВыполненаУспешно Тогда
			   МожноСохранить = Истина;
			КонецЕсли;
		Иначе
			МожноСохранить = Истина;
		КонецЕсли;
		Если МожноСохранить тогда
			ДокОб.Версия = Версия;
			ДокОб.Дата = ТекущаяДата();
			ДокОб.Клиент = Метаданные.Документы.Renault_CRM_ЗаявкаНаГарантию.Реквизиты.Клиент.Тип.ПривестиЗначение( ТекущийКлиент);
			//ДокОб.Комментарий = ТрейдИнКомментарий;
			ДокОб.Модель = Модель;
			ДокОб.РабочийЛист = ТекущийРабочийЛист;
			ДокОб.Сумма = ГарантияСумма;
			ДокОб.Цвет = Цвет;
			ДокОб.ПродленнаяГарантия = ПродленнаяГарантия;
			ДокОб.ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
			ДокОб.Записать(РежимЗаписиДокумента.Проведение);
			ЗаявкаНаГарантию = ДокОб.Ссылка;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДокОб.Ссылка;	
	
КонецФункции

&НаСервере
процедура ЗагрузитьЗаявкуНаГарантию()
	
	Если ЗначениеЗаполнено(ЗаявкаНаГарантию) тогда
		ПродленнаяГарантия = ЗаявкаНаГарантию.ПродленнаяГарантия;
		ГарантияСумма  = ЗаявкаНаГарантию.Сумма;
						
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере 
Функция СоздатьНайтиЗаявкуНаОборудование()
	
	ЗначениеПустое = Ложь;
	Если ЗначениеЗаполнено(ЗаявкаНаОборудование) Тогда
		ДокОб = ЗаявкаНаОборудование.Ссылка.ПолучитьОбъект();
	ИначеЕсли ВыбранноеОборудование.Количество() > 0
		ИЛИ ВыбранныеАвтоработы.Количество() > 0 Тогда
		ДокОб = Документы.CRM_ЗаявкаНаДилерскиеОпции.СоздатьДокумент();
		ДокОб.Статус = Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.НаРассмотрении;
	Иначе
		ДокОб = Документы.CRM_ЗаявкаНаДилерскиеОпции.ПустаяСсылка();
		ЗначениеПустое = Истина;
	КонецЕсли;
	
	Если Не(ЗначениеПустое) И (Не(ДокОб = неопределено)) Тогда
		МожноСохранить = Ложь;
		Если НЕ ДокОб.ЭтоНовый() Тогда
			//Если Не ДокОб.ВыполненаУспешно Тогда
			   МожноСохранить = Истина;
			//КонецЕсли;
		Иначе
			МожноСохранить = Истина;
		КонецЕсли;
		Если МожноСохранить И СоздаватьЗаявкуНаОборудование тогда
			ДокОб.Комплектация = Версия;
			ДокОб.Дата = ТекущаяДата();
			ДокОб.Клиент = Метаданные.Документы.CRM_ЗаявкаНаДилерскиеОпции.Реквизиты.Клиент.Тип.ПривестиЗначение(ТекущийКлиент);
			//ДокОб.Комментарий = ТрейдИнКомментарий;
			ДокОб.Модель = Модель;
			ДокОб.РабочийЛист = ТекущийРабочийЛист;
			//ДокОб.Сумма = ГарантияСумма;
			ДокОб.Цвет = Цвет;
			//ДокОб.ПродленнаяГарантия = ПродленнаяГарантия;
			ДокОб.ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
			ДокОб.ДопОпции.Очистить();
			ДокОб.Автоработы.Очистить();
			
			Для Каждого Оборудование Из ВыбранноеОборудование Цикл
				
				НовСтрока = ДокОб.ДопОпции.Добавить();
				ЗаполнитьСтрокуТЧЗаявкиНаОборудование(НовСтрока, Оборудование);
				
			КонецЦикла;
			
			Для Каждого Авторабота Из ВыбранныеАвтоработы Цикл
				
				НовСтрока = ДокОб.Автоработы.Добавить();
				ЗаполнитьСтрокуТЧЗаявкиНаОборудование(НовСтрока, Авторабота);
				
			КонецЦикла;
			
			ДокОб.Записать(РежимЗаписиДокумента.Проведение);
			ЗаявкаНаОборудование = ДокОб.Ссылка;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДокОб.Ссылка;
	
КонецФункции


Функция РазослатьСообщение(ТемаСообщения,ТекстСообщения,МассивАдресовРассылки,УчетнаяЗапись,ПредставлениеОтправителя,МассивПутейКПрикрепляемымФайлам)Экспорт
	
	Для Каждого АдресРассылки Из МассивАдресовРассылки Цикл
		
		Попытка
			Профиль = Новый ИнтернетПочтовыйПрофиль;		
			Профиль.АдресСервераPOP3   = УчетнаяЗапись.POP3Сервер;
			Профиль.ПортPOP3           = УчетнаяЗапись.ПортPOP3;
			Профиль.АутентификацияPOP3 = эпПреобразоватьВСпособPOP3Аутентификации(УчетнаяЗапись.АутентификацияPOP3);
			Профиль.Пользователь       = УчетнаяЗапись.Логин;
			Профиль.Пароль             = УчетнаяЗапись.Пароль;
			
			Профиль.АдресСервераSMTP   = УчетнаяЗапись.SMTPСервер;
			Профиль.ПортSMTP           = УчетнаяЗапись.ПортSMTP;
			Профиль.АутентификацияSMTP = эпПреобразоватьВСпособSMTPАутентификации(УчетнаяЗапись.АутентификацияSMTP);
			Профиль.ПользовательSMTP   = УчетнаяЗапись.ЛогинSMTP;
			Профиль.ПарольSMTP         = УчетнаяЗапись.ПарольSMTP;
			Профиль.POP3ПередSMTP      = УчетнаяЗапись.POP3ПередSMTP;
			
			Если УчетнаяЗапись.ВремяОжиданияСервера > 0 Тогда
				Профиль.ВремяОжидания = УчетнаяЗапись.ВремяОжиданияСервера;
			КонецЕсли; 

			ИнтернетПочта = Новый ИнтернетПочта;  		
			
			Попытка
				ИнтернетПочта.Подключиться(Профиль);
				Письмо =  СоздатьПисьмо(ТемаСообщения,ТекстСообщения,АдресРассылки,УчетнаяЗапись,ПредставлениеОтправителя,МассивПутейКПрикрепляемымФайлам);
				ИнтернетПочта.Послать(Письмо);
			Исключение
				//Сообщить(элРазобратьОшибкуПочтовогоСоединения(), СтатусСообщения.Важное);
				//Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
				//Предупреждение("Произошли ошибки при проверке настроек учетной записи.
				//|Описание ошибки приведено в окне сообщения.");
				Возврат Ложь;
				
			КонецПопытки; 		

			//РежимОбмена = Новый Структура();
			//РежимОбмена.Вставить("Получить",Ложь);
			//РежимОбмена.Вставить("Отправить",Истина);
			//ПочтовыйЯщик = эпПодключитьсяКПочтовомуСерверу(УчетнаяЗапись,РежимОбмена);
			//  
			//УчетнаяЗапись= Справочники.УчетныеЗаписиЭлектроннойПочты.СоздатьЭлемент().
			//ПочтовыйЯщик.Послать(Письмо);
		Исключение
			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;
	Возврат истина;
КонецФункции

Функция СоздатьПисьмо(Тема,ТекстСообщения,Получатель,Отправитель,ПредставлениеОтправителя,ПутиКФайлам)Экспорт
	Сообщение = новый ИнтернетПочтовоеСообщение;
	//Сообщение.ДатаОтправления =ТекущаяДата();
	Сообщение.Тема = Тема;
	Сообщение.Тексты.Добавить(ТекстСообщения);
	Сообщение.Получатели.Добавить(Получатель);	
	Сообщение.Отправитель.Адрес = Отправитель.АдресЭлектроннойПочты;
	Сообщение.Отправитель.ОтображаемоеИмя = ПредставлениеОтправителя;//"Рассылка комерческих предложений(автомат)";
	Для Каждого ПутьКФайлу Из ПутиКФайлам Цикл
		Сообщение.Вложения.Добавить(ПутьКФайлу,"Комерческое предложение");
	КонецЦикла;
	Возврат Сообщение;
	
КонецФункции

&НаКлиенте
Процедура ОтправитьКП(Команда)
	
	Если ЗначениеЗаполнено(ТекущееКП)И ЗначениеЗаполнено(Email)И ЗначениеЗаполнено(РассылкаУчетнаяЗапись) Тогда
		
		МассивПутейКФайламКп = Новый Массив();
		ТабДок = Новый ТабличныйДокумент();
		МассивДок = Новый Массив();
		МассивДок.Добавить(ТекущееКП.Ссылка);
		Документы.CRM_КоммерческоеПредложение.Печать(МассивДок,ТабДок,"ПФ_MXL_КП");
		ИмяФайла = ПолучитьИмяВременногоФайла("PDF");
		ТабДок.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.PDF);
		МассивПутейКФайламКп.Добавить(ИмяФайла); 
		Адресаты = Новый	 Массив();
		Адресаты.Добавить(Email);
		ЗаполненныйТекстСообщения = ЗаполнитьТекстЕмаилаПараметрами(РассылкаТекстСоообщения);
		Ответ =	РазослатьСообщение(РассылкаТемаСообщения,ЗаполненныйТекстСообщения,Адресаты,
							РассылкаУчетнаяЗапись,РассылкаПредставление,МассивПутейКФайламКп);
							
		Если Ответ = Истина Тогда
			Предупреждение("Сообщение отправлено");
		Иначе
			Предупреждение("Не удалось отправить сообщение, обратитесь в поддержку");
		КонецЕсли;
							
	Иначе
		Предупреждение("Необходимо сохранить предложение, заполнить email и указать учетную запись электронной почты");	
	КонецЕсли;	

КонецПроцедуры


&НаКлиенте
Процедура ЗаявкаНаСтраховкуОчистка(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ОбновитьКнопкиЗаявок();
КонецПроцедуры

&НаСервере
процедура ЗагрузитьЗаявкуНаСтраховку()
	
	Если ЗначениеЗаполнено(ЗаявкаНаСтраховку) тогда
		СтраховкаВид = ЗаявкаНаСтраховку.ВидСтраховойПрограммы;
		СтраховкаКомментарий = ЗаявкаНаСтраховку.Комментарий;
		СтраховкаКомпания = ЗаявкаНаСтраховку.СтраховаяКомпания;
		СтраховкаСумма = ЗаявкаНаСтраховку.Сумма;
				
    КонецЕсли;
	
КонецПроцедуры

Функция СоздатьНайтиЗаявкуНаСтраховку()
	
	ЗначениеПустое = Ложь;
	Если ЗначениеЗаполнено(ЗаявкаНаСтраховку) Тогда
		ДокОб = ЗаявкаНаСтраховку.Ссылка.ПолучитьОбъект();
	ИначеЕсли  СоздаватьЗаявкуНаСтраховку Тогда
		ДокОб = Документы.Renault_CRM_ЗаявкаНаСтраховку.СоздатьДокумент();
	Иначе
		ДокОб = Документы.Renault_CRM_ЗаявкаНаСтраховку.ПустаяСсылка();
		ЗначениеПустое= Истина;
	КонецЕсли;
	
	Если Не(ЗначениеПустое)Или СоздаватьЗаявкуНаСтраховку Тогда
		МожноСохранить = Ложь;
		Если НЕ ДокОб.ЭтоНовый() Тогда
			Если Не ДокОб.ВыполненаУспешно Тогда
			   МожноСохранить = Истина;
			КонецЕсли;
		Иначе
			МожноСохранить = Истина;
		КонецЕсли;
		Если МожноСохранить тогда
			ДокОб.Версия = Версия;
			ДокОб.Комментарий = СтраховкаКомментарий;
			ДокОб.Дата = ТекущаяДата();
			ДокОб.Клиент = Метаданные.Документы.Renault_CRM_ЗаявкаНаСтраховку.Реквизиты.Клиент.Тип.ПривестиЗначение( ТекущийКлиент);
			//ДокОб.Комментарий = ТрейдИнКомментарий;
			ДокОб.Модель = Модель;
			ДокОб.РабочийЛист = ТекущийРабочийЛист;
			ДокОб.Сумма = СтраховкаСумма;
			ДокОб.Цвет = Цвет;
			ДокОб.ВидСтраховойПрограммы = СтраховкаВид;
			ДокОб.СтраховаяКомпания = СтраховкаКомпания;
			ДокОб.ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
			ДокОб.Записать(РежимЗаписиДокумента.Проведение);
			ЗаявкаНаСтраховку = ДокОб.Ссылка;
			ИнтересовалсяСтраховкой = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДокОб.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура ЗаявкаНаСтраховкуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Форма = Документы.Renault_CRM_ЗаявкаНаСтраховку.ПолучитьФорму("Документ.Renault_CRM_ЗаявкаНаСтраховку.ФормаВыбора");
	Форма.Отбор.Клиент.ВидСравнения = ВидСравнения.Равно;
	Форма.Отбор.Клиент.Значение = ТекущийКлиент;
	Форма.Отбор.Клиент.Использование= Истина;
	Форма.Отбор.Черновик.ВидСравнения = ВидСравнения.Равно;
    Форма.Отбор.Черновик.Значение= ложь;
	Форма.Отбор.Черновик.Использование= Истина;
	Форма.Отбор.Закрыта.ВидСравнения = ВидСравнения.Равно;
    Форма.Отбор.Закрыта.Значение= ложь;
	Форма.Отбор.Закрыта.Использование= Истина;
	Форма.Отбор.ПометкаУдаления.Значение = Ложь;
	Форма.Отбор.ПометкаУдаления.Использование = Истина;
	Форма.РежимВыбора = истина;
	
	Итог = Форма.ОткрытьМодально();
	ЗаявкаНаСтраховкуВыборСервер(Итог);
	ОбновитьКнопкиЗаявок();
	СтандартнаяОбработка = Ложь;

КонецПроцедуры
&НаСервере
процедура ЗаявкаНаСтраховкуВыборСервер(Значение) экспорт
	
	ЗаявкаНаСтраховку = Значение;
   
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуТЧЗаявкиНаОборудование(НовСтрока, Данные) 
	
	НовСтрока.Выбрана = истина;
	Если ТипЗнч(Данные.Номенклатура) = Тип("Строка") Тогда
		Если ТипЗнч(НовСтрока) = Тип("ДокументТабличнаяЧастьСтрока.CRM_ЗаявкаНаДилерскиеОпции.ДопОпции") Тогда
			НовСтрока.ПсевдоОпция = Данные.Номенклатура;
		Иначе
			НовСтрока.ПсевдоАвторабота = Данные.Номенклатура;
		КонецЕсли;
		НовСтрока.ПсевдоСумма = Данные.Сумма;
		НовСтрока.Сумма = НовСтрока.ПсевдоСумма;
		НовСтрока.ПсевдоКоличество = Данные.Количество;
        НовСтрока.Цена = Данные.Цена;
		Если ЗначениеЗаполнено(НовСтрока.ПсевдоКоличество) Тогда
			НовСтрока.Количество = НовСтрока.ПсевдоКоличество;
		Иначе
			НовСтрока.Количество = 1;
		КонецЕсли;
	Иначе
		Если ТипЗнч(НовСтрока) = Тип("ДокументТабличнаяЧастьСтрока.CRM_ЗаявкаНаДилерскиеОпции.ДопОпции") Тогда
			НовСтрока.ПсевдоОпция = Строка(Данные.Номенклатура);
		Иначе
			НовСтрока.ПсевдоАвторабота = Строка(Данные.Номенклатура);
		КонецЕсли;
		НовСтрока.ПсевдоСумма = Данные.Сумма;
		НовСтрока.ПсевдоКоличество = Данные.Количество;
		Если ТипЗнч(НовСтрока) = Тип("ДокументТабличнаяЧастьСтрока.CRM_ЗаявкаНаДилерскиеОпции.ДопОпции") Тогда
			НовСтрока.Опция = Данные.Номенклатура;
		Иначе
			НовСтрока.Авторабота = Данные.Номенклатура;
		КонецЕсли;
        НовСтрока.Цена = Данные.Цена;
        НовСтрока.Сумма = Данные.Сумма;
		НовСтрока.Количество = Данные.Количество;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаИнтересовалсяТрейдИн(Команда)
	// Вставить содержимое обработчика.
	ИнтересовалсяТрейдИн =Не ИнтересовалсяТрейдИн;
	
	Если Не ИнтересовалсяТрейдИн Тогда
		ЗаявкаНаКредит = Документы.Renault_ЗаявкаНаТрейдИн.ПустаяСсылка();
	КонецЕсли;
	
	СоздаватьЗаявку = ИнтересовалсяТрейдИн;	
	ОбновитьКнопкиЗаявок();

КонецПроцедуры


&НаКлиенте
Процедура КнопкаСоздаватьЗаявкуТрейдИн(Команда)
	// Вставить содержимое обработчика.
	СоздаватьЗаявку = Не СоздаватьЗаявку;	
	ОбновитьКнопкиЗаявок();

КонецПроцедуры


&НаКлиенте
Процедура КнопкаИнтересовалсяСтраховкой(Команда)
	// Вставить содержимое обработчика.
	ИнтересовалсяСтраховкой =Не ИнтересовалсяСтраховкой;
	Если Не ИнтересовалсяСтраховкой Тогда
		ЗаявкаНаКредит = Документы.Renault_CRM_ЗаявкаНаСтраховку.ПустаяСсылка();
	КонецЕсли;
	СоздаватьЗаявкуНаСтраховку = ИнтересовалсяСтраховкой;	
	ОбновитьКнопкиЗаявок();
КонецПроцедуры


&НаКлиенте
Процедура КнопкаСоздаватьЗаявкуНаСтраховку(Команда)
	// Вставить содержимое обработчика.
	СоздаватьЗаявкуНаСтраховку = Не СоздаватьЗаявкуНаСтраховку;	
	ОбновитьКнопкиЗаявок();

КонецПроцедуры

&НаКлиенте
Процедура КнопкаИнтересовалсяКредитом(Команда)
	
	ИнтересовалсяКредитом = Не ИнтересовалсяКредитом;
	Если Не ИнтересовалсяКредитом Тогда
		ЗаявкаНаКредит = Документы.Renault_CRM_ЗаявкаНаКредит.ПустаяСсылка();
	КонецЕсли;
	СоздаватьЗаявкуНаКредит = ИнтересовалсяКредитом;	
	ОбновитьКнопкиЗаявок();

КонецПроцедуры

&НаКлиенте
Процедура КнопкаСоздаватьЗаявкуНаКредит(Команда)
	// Вставить содержимое обработчика.
	СоздаватьЗаявкуНаКредит = Не СоздаватьЗаявкуНаКредит;	
	ОбновитьКнопкиЗаявок();

КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВРежимСвободногоРедактирования(Команда)
	Автомобиль = Неопределено;
	VIN = "";
	ОбновитьРежимРедактирования();
КонецПроцедуры

&НаКлиенте
Процедура КонфигурацияПерезаписать(Команда)
	
	Если Не ЗначениеЗаполнено(Версия) ИЛИ Не ЗначениеЗаполнено(Цвет) Тогда
		Предупреждение("Не указана версия или цвет автомобиля");
		Возврат;
	КонецЕсли;
	
	НеОбновлятьПриАктивизацииСтроки = Истина;
	ЗаявкаНаТрейдИн = СоздатьНайтиЗаявкуНаТрейдИн();
	ЗаявкаНаКредит = СоздатьНайтиЗаявкуНаКредит();
	ЗаявкаНаСтраховку = СоздатьНайтиЗаявкуНаСтраховку();
	ЗаявкаНаГарантию = СоздатьНайтиЗаявкуНаГарантию();
	ЗаявкаНаОборудование = СоздатьНайтиЗаявкуНаОборудование();
	ТекущаяКонфигурация = ЗаписатьКонфигурацию(Истина);
	
	Если ЗначениеЗаполнено(ТекущаяКонфигурация) Тогда		
		Перезаписать(ТекущаяКонфигурация);
		ОткрытьСтраницуСоставКП();
	КонецЕсли;
	НеОбновлятьПриАктивизацииСтроки = Ложь;
	
	Оповестить("ОбновитьРабочийЛист");
	//ОбновитьОтображениеГруппПоЗаявкам();
	
КонецПроцедуры

&НаКлиенте
Процедура КПЗагрузитьИзСклада(Команда)
	ЗагрузитьАвтомобильВКонфигураторКлиент(Элементы.ТаблицаСклад.ТекущиеДанные.Автомобиль);
КонецПроцедуры

&НаКлиенте
Процедура ПродленнаяГарантия1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ФормаПараметры = Новый Структура;
	ФормаПараметры.Вставить("Модель", Модель);
	Форма = ПолучитьФорму("РегистрСведений.CRM_СтоимостьПродленнойГарантии.Форма.ФормаВыбораУпр", ФормаПараметры, ЭтаФорма);
	Форма.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЦенуРОП()
	
	Если ЗначениеЗаполнено(Автомобиль) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	CRM_ДополнительнаяИнформацияПоАвтомобилям.ЦенаПродажиРОП
		                      |ИЗ
		                      |	РегистрСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям КАК CRM_ДополнительнаяИнформацияПоАвтомобилям
		                      |ГДЕ
		                      |	CRM_ДополнительнаяИнформацияПоАвтомобилям.Автомобиль = &Автомобиль");
		Запрос.УстановитьПараметр("Автомобиль",Автомобиль);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЦенаРОП = Выборка.ЦенаПродажиРОП;
		Иначе
			ЦенаРОП = 0;
		КонецЕсли;
		
	Иначе
		ЦенаРОП = 0;
	КонецЕсли;
	
КонецПроцедуры

 &НаСервере 
Функция ПолучитьЗначенияПараметровШаблонаЕмаил()
	
	ПараметрыЕмаил = Новый СписокЗначений();
	Если ЗначениеЗаполнено(ТекущийКлиент) Тогда
		ПараметрыЕмаил.Добавить(ТекущийКлиент.Наименование,"{Клиент}");
	Иначе
		ПараметрыЕмаил.Добавить(" ","{Клиент}");
	КонецЕсли;
	
	ДЦ =Renault_CRM.ПолучитьДилерскийЦентрПользователя();
	Если ЗначениеЗаполнено(ДЦ) Тогда
		ПараметрыЕмаил.Добавить(ДЦ.Наименование,"{Дилер}");

	Иначе
		ПараметрыЕмаил.Добавить(" ","{Дилер}");
    КонецЕсли;
	Если ЗначениеЗаполнено(Менеджер)Или ЗначениеЗаполнено(ПараметрыСеанса.Пользователь.Сотрудник) Тогда
		ПараметрыЕмаил.Добавить(?(ЗначениеЗаполнено(Менеджер),Менеджер.Наименование,ПараметрыСеанса.Пользователь.Сотрудник.Наименование),"{Менеджер}");
        ПараметрыЕмаил.Добавить(Renault_CRM.ПолучитьТелефонКлиент(?(ЗначениеЗаполнено(Менеджер),Менеджер,ПараметрыСеанса.Пользователь.Сотрудник)),"{Телефон}");
	Иначе
		ПараметрыЕмаил.Добавить(" ","{Менеджер}");
		ПараметрыЕмаил.Добавить(" ","{Телефон}");
    КонецЕсли;
	Если ЗначениеЗаполнено(Модель) Тогда
		ПараметрыЕмаил.Добавить(Модель.Наименование,"{Модель}");
    Иначе
		ПараметрыЕмаил.Добавить(" ","{Модель}");
    КонецЕсли;
	
	Возврат ПараметрыЕмаил;
	
	
КонецФункции

&НаКлиенте
Функция ЗаполнитьТекстЕмаилаПараметрами(ШаблонТекстаЕмаил)
	ПараметрыЕмаил = ПолучитьЗначенияПараметровШаблонаЕмаил();
	Ответ = ШаблонТекстаЕмаил;
	Для Каждого Пар из ПараметрыЕмаил Цикл
		Ответ = СтрЗаменить(Ответ,Пар.Представление,Пар.Значение);
	КонецЦикла;
	Возврат Ответ;	

КонецФункции

&НаКлиенте
Процедура ПоказатьЗаполненныйТекстСообщения(Команда)
	// Вставить содержимое обработчика.
	ЗначКПоказу = ЗаполнитьТекстЕмаилаПараметрами(РассылкаТекстСоообщения);
	ОткрытьЗначение(ЗначКПоказу);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСклад(Команда)
	ОбновитьТаблицыСклад();
КонецПроцедуры

&НаКлиенте
Процедура ПродленнаяГарантия1ПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(ПродленнаяГарантия) Тогда
		ЗаявкаНаГарантию = Документы.Renault_CRM_ЗаявкаНаГарантию.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПродленнаяГарантия1Очистка(Элемент, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(ПродленнаяГарантия) Тогда
		ЗаявкаНаГарантию = Документы.Renault_CRM_ЗаявкаНаГарантию.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРасчетнуюПоЦенеРоп(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРасчетнуюПоЦенеРопПриИзменении(Элемент)
	СуммаСкидки = 0;
	ПолучитьСуммуДоставки();
	ПересчитатьЦенуАвто();
КонецПроцедуры

Процедура ПолучитьСуммуДоставки()	
	
	ТекДилерскийЦентр = Renault_РаботаСПравамиПользователя.ДилерскийЦентрПоУмолчанию(ПараметрыСеанса.Пользователь);
	
	СтоимостьДоставки = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЕСТЬNULL(ЕСТЬNULL(ПоВерсиям.СтоимостьДоставки, ПоМоделям.СтоимостьДоставки), 0) КАК СтоимостьДоставки
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		Renault_СтоимостьДоставкиАвтомобилей.СтоимостьДоставки КАК СтоимостьДоставки
	               |	ИЗ
	               |		РегистрСведений.Renault_СтоимостьДоставкиАвтомобилей КАК Renault_СтоимостьДоставкиАвтомобилей
	               |	ГДЕ
	               |		Renault_СтоимостьДоставкиАвтомобилей.Версия = &Версия) КАК ПоВерсиям
	               |		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			Renault_СтоимостьДоставкиАвтомобилей.СтоимостьДоставки КАК СтоимостьДоставки
	               |		ИЗ
	               |			РегистрСведений.Renault_СтоимостьДоставкиАвтомобилей КАК Renault_СтоимостьДоставкиАвтомобилей
	               |		ГДЕ
	               |			Renault_СтоимостьДоставкиАвтомобилей.Модель = &Модель) КАК ПоМоделям
	               |		ПО (ИСТИНА)";				   
	Запрос.УстановитьПараметр("Версия", Версия);
	Запрос.УстановитьПараметр("Модель", Модель);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтоимостьДоставки = Выборка.СтоимостьДоставки;
	КонецЕсли;
	Если СтоимостьДоставки = 0 ИЛИ Не ЗначениеЗаполнено(СтоимостьДоставки) Тогда
		СтоимостьДоставки = ТекДилерскийЦентр.СтоимостьДоставкиПоУмолчанию;;
	КонецЕсли;
	
	СуммаДоставки = СтоимостьДоставки;
	
КонецПроцедуры



