&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЦветФона=Обработки.Renault_ДиалогВыбораЦвета.ЦветИзСтроки(Объект.ЦветФона);
	ЦветТекста=Обработки.Renault_ДиалогВыбораЦвета.ЦветИзСтроки(Объект.ЦветТекста);
КонецПроцедуры

&НаКлиенте
Процедура ЦветНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ОткрытьФорму("Обработка.Renault_ДиалогВыбораЦвета.Форма",Новый Структура("ТекущийЦвет",ЭтаФорма[Элемент.Имя]),ЭтаФорма,УникальныйИдентификатор,,,Новый ОписаниеОповещения("ВыборЦвета",ЭтаФорма,Элемент.Имя));
КонецПроцедуры

&НаКлиенте
Процедура ВыборЦвета(Цвет,ИмяЭлемента) Экспорт 
	Если Цвет=Неопределено Тогда Возврат КонецЕсли;
	ЭтаФорма[ИмяЭлемента]=Цвет;
	Объект[ИмяЭлемента]=Обработки.Renault_ДиалогВыбораЦвета.ЦветВСтроку(Цвет);
	Модифицированность=Истина;
КонецПроцедуры	

&НаКлиенте
Процедура ЦветОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ЭтаФорма[Элемент.Имя]=Новый Цвет();
	Объект[Элемент.Имя]="";
	Модифицированность=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи) Оповестить("ЗаписьВидаСобытия") КонецПроцедуры
