Процедура СформироватьДокументыКорректировкиДолгаПоСчетамИЗаказНарядам(Отладка) Экспорт
 	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	               	|	ВзаиморасчетыКомпанииОстатки.Контрагент КАК Контрагент,
	               	|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	               	|	ВзаиморасчетыКомпанииОстатки.Сделка КАК Сделка,
	               	|	ВзаиморасчетыКомпанииОстатки.Сделка.ДокументОснование КАК ЗаявкаНаРемонт,
	               	|	ВзаиморасчетыКомпанииОстатки.Сделка.ДокументОснование.ВидРемонта КАК ВидРемонта,
	               	|	ВзаиморасчетыКомпанииОстатки.Сделка.ДокументОснование.ВидРемонта.ГарантияЗавода КАК ЭтоГарантияЗавода,
	               	|	ВзаиморасчетыКомпанииОстатки.СуммаОстаток КАК СуммаОстаток,
	               	|	ВзаиморасчетыКомпанииОстатки.Сделка.ДокументОснование.ПодразделениеКомпании КАК ПодразделениеКомпании,
	               	|	ВзаиморасчетыКомпанииОстатки.Сделка.ДокументОснование.ПодразделениеКомпании.Организация КАК Организация,
	               	|	ВзаиморасчетыКомпанииОстатки.Сделка.ДокументОснование.ПодразделениеКомпании.Организация.ПометкаУдаления КАК ДоговорВзаиморасчетовОрганизацияПометкаУдаления
	               	|ИЗ
	               	|	РегистрНакопления.ВзаиморасчетыКомпании.Остатки КАК ВзаиморасчетыКомпанииОстатки
	               	|ГДЕ
	               	|	(ТИПЗНАЧЕНИЯ(ВзаиморасчетыКомпанииОстатки.Сделка) = ТИП(Документ.СчетНаОплату)
	               	|			ИЛИ ТИПЗНАЧЕНИЯ(ВзаиморасчетыКомпанииОстатки.Сделка) = ТИП(Документ.ЗаказНаряд))
	               	|	И ТИПЗНАЧЕНИЯ(ВзаиморасчетыКомпанииОстатки.Сделка.ДокументОснование) = ТИП(Документ.ЗаявкаНаРемонт)
	               	|	И НЕ ВзаиморасчетыКомпанииОстатки.Сделка.ДокументОснование.ВидРемонта.ГарантияЗавода
	               	|	И НЕ ВзаиморасчетыКомпанииОстатки.Сделка.ДокументОснование.ПодразделениеКомпании.Организация.ПометкаУдаления
	               	|
	               	|УПОРЯДОЧИТЬ ПО
	               	|	ВзаиморасчетыКомпанииОстатки.Контрагент.Наименование,
	               	|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.Наименование";
	
	ТЗ_исходная = Запрос.Выполнить().Выгрузить();
	
	Если Отладка Тогда
		ТЗ_исходная.ВыбратьСтроку(ТЗ_исходная.Количество()); 
 	КонецЕсли;
 	
	ТЗ = ТЗ_исходная.Скопировать();
	
	ТЗ.Свернуть("ЗаявкаНаРемонт, Контрагент","СуммаОстаток");
	
	Если Отладка Тогда
		ТЗ.ВыбратьСтроку(ТЗ.Количество()); 
	КонецЕсли;
	
	СЗ_ = Новый СписокЗначений;
	
	Для каждого Стр Из ТЗ Цикл
	    Если обЗначениеНеЗаполнено(Стр.ЗаявкаНаРемонт) Тогда
			Продолжить;
		КонецЕсли;
		Если Стр.СуммаОстаток <> 0 Тогда
			Продолжить;
		КонецЕсли;
		СЗ_.Добавить(Стр.ЗаявкаНаРемонт);
	КонецЦикла;
	
 	Для каждого Элем Из СЗ_ Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("ЗаявкаНаРемонт",Элем.Значение);
		НайдСтроки = ТЗ_исходная.НайтиСтроки(Отбор);
		Если НайдСтроки.Количество() > 0 Тогда
			НовКорректировкаДолга = Документы.КорректировкаДолга.СоздатьДокумент();
			Сч = 0; 
			Для каждого Стр Из НайдСтроки Цикл
				Если Сч = 0 Тогда
					НовКорректировкаДолга.Заполнить(Стр.Контрагент);
					НовКорректировкаДолга.СтатьяДохода = Справочники.СтатьиДоходовИРасходов.КорректировкаДолга;	
					НовКорректировкаДолга.СтатьяРасхода = Справочники.СтатьиДоходовИРасходов.КорректировкаДолга;	
 					НовКорректировкаДолга.ПодразделениеКомпании = Стр.ДоговорВзаиморасчетов.Подразделение;
					НовКорректировкаДолга.Организация = Стр.ДоговорВзаиморасчетов.Организация; 
					НовКорректировкаДолга.Автор = Справочники.Пользователи.Робот;
					НовКорректировкаДолга.УстановитьНовыйНомер("");
				КонецЕсли;
				Если Стр.ДоговорВзаиморасчетов.Организация <> НовКорректировкаДолга.Организация Тогда
					Продолжить;
				КонецЕсли;
				Если Стр.ДоговорВзаиморасчетов.Владелец <> НовКорректировкаДолга.Контрагент Тогда
					Продолжить;
 				КонецЕсли;
    				НовСтрока = НовКорректировкаДолга.Состав.Добавить();
				НовСтрока.ДоговорВзаиморасчетов = Стр.ДоговорВзаиморасчетов;
				НовСтрока.КурсВалютыВзаиморасчетов = 1;
				НовСтрока.Сделка = Стр.Сделка;
				Если Стр.СуммаОстаток > 0 Тогда
					НовСтрока.УменьшениеДолга = Стр.СуммаОстаток;
 				Иначе
					НовСтрока.УвеличениеДолга = -Стр.СуммаОстаток;
				КонецЕсли;
				Сч = Сч + 1;
 			КонецЦикла;
			//Форма = НовКорректировкаДолга.ПолучитьФорму("ФормаДокумента");
			//Если Не Форма.Открыта() Тогда
			//	Форма.Открыть();
			//КонецЕсли;
			//Прервать;
		КонецЕсли;
		Если НовКорректировкаДолга.Состав.Итог("УвеличениеДолга") <> НовКорректировкаДолга.Состав.Итог("УменьшениеДолга") Тогда
			Продолжить;
 		КонецЕсли;
		Попытка
			НовКорректировкаДолга.Записать(РежимЗаписиДокумента.Запись);
			#Если НаКлиенте Тогда
				СМГ_Сообщить("Записан документ "+НовКорректировкаДолга);
			#КонецЕсли
 			Попытка
				НовКорректировкаДолга.Записать(РежимЗаписиДокумента.Проведение);
			#Если НаКлиенте Тогда
				СМГ_Сообщить("Проведен документ "+НовКорректировкаДолга);
			#КонецЕсли
  			Исключение
 			КонецПопытки;
 		Исключение
 		КонецПопытки;
 	КонецЦикла;
    
КонецПроцедуры //СформироватьДокументыКорректировкиДолгаПоСчетамИЗаказНарядам()

Процедура СформироватьДокументыКорректировкиДолгаПоСчетамИРеализациямТоваров(Отладка) Экспорт
 	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	               	|	ВзаиморасчетыКомпанииОстатки.Контрагент КАК Контрагент,
	               	|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	               	|	ВзаиморасчетыКомпанииОстатки.Сделка КАК Сделка,
	               	|	ВзаиморасчетыКомпанииОстатки.Сделка.ДокументОснование КАК ДокументОснованиеСделки,
	               	|	"" КАК ВидРемонта,
	               	|	"" КАК ЭтоГарантияЗавода,
	               	|	ВзаиморасчетыКомпанииОстатки.СуммаОстаток КАК СуммаОстаток,
	               	|	ВзаиморасчетыКомпанииОстатки.Сделка.ДокументОснование.ПодразделениеКомпании КАК ПодразделениеКомпании,
	               	|	ВзаиморасчетыКомпанииОстатки.Сделка.ДокументОснование.ПодразделениеКомпании.Организация КАК Организация,
	               	|	ВзаиморасчетыКомпанииОстатки.Сделка.ДокументОснование.ПодразделениеКомпании.Организация.ПометкаУдаления КАК ДоговорВзаиморасчетовОрганизацияПометкаУдаления
	               	|ИЗ
	               	|	РегистрНакопления.ВзаиморасчетыКомпании.Остатки КАК ВзаиморасчетыКомпанииОстатки
	               	|ГДЕ
	               	|	(ТИПЗНАЧЕНИЯ(ВзаиморасчетыКомпанииОстатки.Сделка) = ТИП(Документ.СчетНаОплату)
	               	|			ИЛИ ТИПЗНАЧЕНИЯ(ВзаиморасчетыКомпанииОстатки.Сделка) = ТИП(Документ.РеализацияТоваров))
  	               	|	И НЕ ВзаиморасчетыКомпанииОстатки.Сделка.ДокументОснование.ПодразделениеКомпании.Организация.ПометкаУдаления
	               	|
	               	|УПОРЯДОЧИТЬ ПО
	               	|	ВзаиморасчетыКомпанииОстатки.Контрагент.Наименование,
	               	|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.Наименование";
	
	ТЗ_исходная = Запрос.Выполнить().Выгрузить();
	
	Если Отладка Тогда
		ТЗ_исходная.ВыбратьСтроку(ТЗ_исходная.Количество()); 
 	КонецЕсли;
 	
	ТЗ = ТЗ_исходная.Скопировать();
	
	ТЗ.Свернуть("ДокументОснованиеСделки, Контрагент","СуммаОстаток");
	
	Если Отладка Тогда
		ТЗ.ВыбратьСтроку(ТЗ.Количество()); 
	КонецЕсли;
	
	СЗ_ = Новый СписокЗначений;
	
	Для каждого Стр Из ТЗ Цикл
	    Если обЗначениеНеЗаполнено(Стр.ДокументОснованиеСделки) Тогда
			Продолжить;
		КонецЕсли;
		Если Стр.СуммаОстаток <> 0 Тогда
			Продолжить;
		КонецЕсли;
		СЗ_.Добавить(Стр.ДокументОснованиеСделки);
	КонецЦикла;
	
 	Для каждого Элем Из СЗ_ Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("ДокументОснованиеСделки",Элем.Значение);
		НайдСтроки = ТЗ_исходная.НайтиСтроки(Отбор);
		Если НайдСтроки.Количество() > 0 Тогда
			НовКорректировкаДолга = Документы.КорректировкаДолга.СоздатьДокумент();
			Сч = 0; 
			Для каждого Стр Из НайдСтроки Цикл
				Если Сч = 0 Тогда
					НовКорректировкаДолга.Заполнить(Стр.Контрагент);
					НовКорректировкаДолга.СтатьяДохода = Справочники.СтатьиДоходовИРасходов.КорректировкаДолга;	
					НовКорректировкаДолга.СтатьяРасхода = Справочники.СтатьиДоходовИРасходов.КорректировкаДолга;	
 					НовКорректировкаДолга.ПодразделениеКомпании = Стр.ДоговорВзаиморасчетов.Подразделение;
					НовКорректировкаДолга.Организация = Стр.ДоговорВзаиморасчетов.Организация; 
					НовКорректировкаДолга.Автор = Справочники.Пользователи.Робот;
					НовКорректировкаДолга.УстановитьНовыйНомер("");
				КонецЕсли;
				Если Стр.ДоговорВзаиморасчетов.Организация <> НовКорректировкаДолга.Организация Тогда
					Продолжить;
				КонецЕсли;
				Если Стр.ДоговорВзаиморасчетов.Владелец <> НовКорректировкаДолга.Контрагент Тогда
					Продолжить;
 				КонецЕсли;
    				НовСтрока = НовКорректировкаДолга.Состав.Добавить();
				НовСтрока.ДоговорВзаиморасчетов = Стр.ДоговорВзаиморасчетов;
				НовСтрока.КурсВалютыВзаиморасчетов = 1;
				НовСтрока.Сделка = Стр.Сделка;
				Если Стр.СуммаОстаток > 0 Тогда
					НовСтрока.УменьшениеДолга = Стр.СуммаОстаток;
 				Иначе
					НовСтрока.УвеличениеДолга = -Стр.СуммаОстаток;
				КонецЕсли;
				Сч = Сч + 1;
 			КонецЦикла;
			//Форма = НовКорректировкаДолга.ПолучитьФорму("ФормаДокумента");
			//Если Не Форма.Открыта() Тогда
			//	Форма.Открыть();
			//КонецЕсли;
			//Прервать;
		КонецЕсли;
		Если НовКорректировкаДолга.Состав.Итог("УвеличениеДолга") <> НовКорректировкаДолга.Состав.Итог("УменьшениеДолга") Тогда
			Продолжить;
 		КонецЕсли;
		Попытка
			НовКорректировкаДолга.Записать(РежимЗаписиДокумента.Запись);
			#Если НаКлиенте Тогда
				СМГ_Сообщить("2.Записан документ "+НовКорректировкаДолга);
			#КонецЕсли
 			Попытка
				НовКорректировкаДолга.Записать(РежимЗаписиДокумента.Проведение);
			#Если НаКлиенте Тогда
				СМГ_Сообщить("2.Проведен документ "+НовКорректировкаДолга);
			#КонецЕсли
  			Исключение
 			КонецПопытки;
 		Исключение
 		КонецПопытки;
 	КонецЦикла;
    
КонецПроцедуры //СформироватьДокументыКорректировкиДолгаПоСчетамИЗаказНарядам()
