
Функция WebhookPOST(Запрос)
	ЧтениеJSON = Новый ЧтениеJSON();
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	///////////////////////////////////////////////////////////////////////////////
	//тдТелоЗапроса = Новый ТекстовыйДокумент();
	//тдТелоЗапроса.ДобавитьСтроку(ТелоЗапроса);
	//ИмяФайла = "\\1cserver\Webhooks\Запрос_" + Формат(ТекущаяДата(),"ДФ=ггггММдд-ЧЧммсс") + ".txt";
	//тдТелоЗапроса.Записать(ИмяФайла);
	///////////////////////////////////////////////////////////////////////////////
	ЧтениеJSON.УстановитьСтроку(ТелоЗапроса);
	Попытка
		стЗапрос = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		Ответ = Новый HTTPСервисОтвет(415);
		Ответ.УстановитьТелоИзСтроки("Некорректный JSON в теле запроса!", "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
		Возврат Ответ;
	КонецПопытки;
	
	Если стЗапрос.name = "maxposter.appraisal.updated" Тогда
		ЭтоОценка = Истина;
	ИначеЕсли стЗапрос.name = "maxposter.vehicle.updated" Тогда
		ЭтоОценка = Ложь;
	Иначе
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.УстановитьТелоИзСтроки("ok", "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
		Возврат Ответ;
	КонецЕсли;
	
	payload = стЗапрос.payload;
	Если ТипЗнч(payload) <> Тип("Структура") Или обЗначениеНеЗаполнено(payload) Тогда
		Ответ = Новый HTTPСервисОтвет(422);
		Ответ.УстановитьТелоИзСтроки("Не указан payload в теле запроса!", "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
		Возврат Ответ;
	КонецЕсли;
	
	VIN = "";
	Если Не payload.Свойство("vin", VIN) Или обЗначениеНеЗаполнено(VIN) Тогда	
		Ответ = Новый HTTPСервисОтвет(422);
		Ответ.УстановитьТелоИзСтроки("Не указан vin в теле запроса!", "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
		Возврат Ответ;
	КонецЕсли;
	
	ТекДата = ТекущаяДата(); 
	АвтомобильСсылка = Справочники.Автомобили.НайтиПоРеквизиту("VIN", VIN);
	Если обЗначениеНеЗаполнено(АвтомобильСсылка) Тогда
		АвтомобильОбъект = Справочники.Автомобили.СоздатьЭлемент();
		АвтомобильОбъект.VIN = VIN;
		АвтомобильОбъект.ДатаРегистрации = ТекДата;
		Попытка
			АвтомобильОбъект.Модель = ПолучитьМодель(payload.model.name, payload.brand.name);
		Исключение
		КонецПопытки;
		Попытка
			АвтомобильОбъект.Цвет = ПолучитьЦвет(payload.bodyColor);
		Исключение
		КонецПопытки;
		Попытка
			АвтомобильОбъект.ГодВыпуска = Дата(payload.year, 1, 1);
		Исключение
		КонецПопытки;
		
		АвтомобильОбъект.ФормированиеНаименованияАвтомобиля("");
		АвтомобильОбъект.Комментарий = "Создан автоматически на основании оценки в Автохаб";
		АвтомобильОбъект.УстановитьНовыйКод("ЦБ");
		
		АвтомобильОбъект.ОбменДанными.Загрузка = Истина;
		АвтомобильОбъект.Записать();
		АвтомобильСсылка = АвтомобильОбъект.Ссылка;
	КонецЕсли;
	
	Попытка
		Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(АвтомобильСсылка, payload.mileage,
			Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег, НачалоДня(ТекДата));
	Исключение
	КонецПопытки;
	
	мзОбъявлениеАвтохаб = РегистрыСведений.ОбъявленияНаАвтохаб.СоздатьМенеджерЗаписи();
	мзОбъявлениеАвтохаб.Автомобиль = АвтомобильСсылка;
	мзОбъявлениеАвтохаб.Прочитать();
	Если Не мзОбъявлениеАвтохаб.Выбран() Тогда
		мзОбъявлениеАвтохаб.Автомобиль = АвтомобильСсылка;
	КонецЕсли;
	
	Если ЭтоОценка Тогда
		Если мзОбъявлениеАвтохаб.appraisal_id <> payload.id Тогда
			мзОбъявлениеАвтохаб.appraisal_id = payload.id;
			мзОбъявлениеАвтохаб.ОсмотрПроведен = Ложь;
			мзОбъявлениеАвтохаб.Записать();
		КонецЕсли;
		
		Попытка
			КодОсмотра = payload.inspection.status.id;
			ДатаЗавершенияОсмотра = payload.inspection.finishedAt;
		Исключение
			КодОсмотра = 0;
		КонецПопытки;
		Если КодОсмотра = 4 Тогда
			мзОбъявлениеАвтохаб.ОсмотрПроведен = Истина;
			мзОбъявлениеАвтохаб.Записать();
			
			АвтомобильОбъект = АвтомобильСсылка.ПолучитьОбъект();
			АвтомобильОбъект.Комментарий = АвтомобильОбъект.Комментарий + "; Осмотр на Автохаб завершен " + ДатаЗавершенияОсмотра;
			АвтомобильОбъект.ОбменДанными.Загрузка = Истина;
			АвтомобильОбъект.Записать();
		КонецЕсли;
		
	ИначеЕсли мзОбъявлениеАвтохаб.vehicle_id <> payload.id И payload.Свойство("closedStatus") Тогда
		Если обЗначениеНеЗаполнено(payload.closedStatus) Тогда	
			мзОбъявлениеАвтохаб.vehicle_id = payload.id;
			мзОбъявлениеАвтохаб.ОсмотрПроведен = Истина;
			мзОбъявлениеАвтохаб.Записать();
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЭтоОценка И ЗначениеЗаполнено(мзОбъявлениеАвтохаб.Поступление) Тогда
		Попытка
			Если payload.price > 0 Тогда
				ПоступлениеОбъект = мзОбъявлениеАвтохаб.Поступление.ПолучитьОбъект();
				СтрокаАвтомобиль = ПоступлениеОбъект.Автомобили[0];
				СтрокаАвтомобиль.СуммаПродажи = payload.price;
				ПоступлениеОбъект.ОбменДанными.Загрузка = Истина;
				ПоступлениеОбъект.Записать();
			КонецЕсли;
		Исключение
		КонецПопытки
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("ok", "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ;
КонецФункции

Функция ПолучитьМодель(Модель, Марка)
	ШаблонНаименования = Марка + " " + Модель;
	Если обЗначениеНеЗаполнено(ШаблонНаименования) Тогда
		Возврат Справочники.Модели.ПустаяСсылка();
	КонецЕсли;
	
	ЗапросМодель = Новый Запрос();
	ЗапросМодель.УстановитьПараметр("Шаблон", "%" + ШаблонНаименования + "%");
	ЗапросМодель.Текст =
	"ВЫБРАТЬ
	|	Модели.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Модели КАК Модели
	|ГДЕ
	|	Модели.Наименование ПОДОБНО &Шаблон";
	
	ВыборкаМодель = ЗапросМодель.Выполнить().Выбрать();
	Если ВыборкаМодель.Следующий() Тогда
		Возврат ВыборкаМодель.Ссылка;
	Иначе
		Возврат Справочники.Модели.ПустаяСсылка();
	КонецЕсли;
КонецФункции

Функция ПолучитьЦвет(ШаблонЦвет)
	Если обЗначениеНеЗаполнено(ШаблонЦвет) Тогда
		Возврат Справочники.Цвета.ПустаяСсылка();
	КонецЕсли;
	
	ЗапросЦвет = Новый Запрос();
	ЗапросЦвет.УстановитьПараметр("Шаблон", "%" + ШаблонЦвет + "%");
	ЗапросЦвет.Текст =
	"ВЫБРАТЬ
	|	Цвета.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Цвета КАК Цвета
	|ГДЕ
	|	Цвета.Наименование ПОДОБНО &Шаблон";
	
	ВыборкаЦвет = ЗапросЦвет.Выполнить().Выбрать();
	Если ВыборкаЦвет.Следующий() Тогда
		Возврат ВыборкаЦвет.Ссылка;
	Иначе
		Возврат Справочники.Цвета.ПустаяСсылка();
	КонецЕсли;
КонецФункции
