Процедура Печать(ТабДок,Ссылка) Экспорт
	
	Макет = ПолучитьМакет("КартаКачестваПоставки");
	ДанныеДокумента = ПолучитьДанныеОбъекта(Ссылка);
	
	ОбластьСтраница = Макет.ПолучитьОбласть("Страница");
	ТабДок.Очистить();
	ОбластьСтраница.Параметры.Заполнить(ДанныеДокумента);
	ОбластьСтраница.Параметры.ДатаMADC = Формат(ДанныеДокумента.ДатаMADC, "ДФ=dd.MM.yyyy");
	ОбластьСтраница.Параметры.ДатаВыдачиАвто = Формат(ДанныеДокумента.ДатаВыдачиАвто, "ДФ=dd.MM.yyyy");
	ОбластьСтраница.Параметры.ДатаКонтроляАмПослеРемонта = Формат(ДанныеДокумента.ДатаКонтроляАмПослеРемонта, "ДФ=dd.MM.yyyy");
	ОбластьСтраница.Параметры.ДатаПППодготовки = Формат(ДанныеДокумента.ДатаПППодготовки, "ДФ=dd.MM.yyyy");
	ОбластьСтраница.Параметры.ДатаПримеки = Формат(ДанныеДокумента.ДатаПримеки, "ДФ=dd.MM.yyyy");
	ОбластьСтраница.Параметры.СогласованнаяДатаВыдачи = Формат(ДанныеДокумента.СогласованнаяДатаВыдачи, "ДФ=dd.MM.yyyy");
	ОбластьСтраница.Параметры.СогласованнаяДатаПоставки = Формат(ДанныеДокумента.СогласованнаяДатаПоставки, "ДФ=dd.MM.yyyy");
	ОбластьСтраница.Параметры.ПланируемаяДатаПредпродажнойПодготовки = Формат(ДанныеДокумента.ПланируемаяДатаПредпродажнойПодготовки, "ДФ=dd.MM.yyyy");
	ОбластьСтраница.Параметры.ПланируемаяДатаУстановкиАксессуаров = Формат(ДанныеДокумента.ПланируемаяДатаУстановкиАксессуаров, "ДФ=dd.MM.yyyy");
	
	КартинкаЛого = Вычислить(Renault_ОбщиеФункцииСервер.МультибрендПараметрыОформления().Логотип_mini_4);
	//ОбластьСтраница.Рисунки["D1"].Картинка = КартинкаЛого;
	
	Для сч = 1 по 17 Цикл
		ОбластьСтраница.Параметры["V"+Строка(СЧ)] = Сред(ДанныеДокумента.VIN,Сч,1);
	КонецЦикла;
	Для сч = 1 по 4 Цикл
		ОбластьСтраница.Параметры["K"+Строка(СЧ)] = Сред(ДанныеДокумента.КодМагнитолы,Сч,1);
	КонецЦикла;
	//Для сч = 1 по 8 Цикл
	//	ОбластьСтраница.Параметры["А"+Строка(СЧ)] = Сред(ДанныеДокумента.КодСостоянияАКБ,Сч,1);
	//КонецЦикла;
	
	Если ДанныеДокумента.АмНаСвобСкладе Тогда
		ОбластьСтраница.Области["АМНаСкладе"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	КонецЕсли;
	
	Если ДанныеДокумента.АмЗаказанПодКлиента Тогда
		ОбластьСтраница.Области["АмЗаказанПодКлиента"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	КонецЕсли;
	
	Если ДанныеДокумента.ЗаправитьАМ Тогда
		ОбластьСтраница.Области["ЗаправитьАМДа"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	Иначе
		//ОбластьСтраница.Рисунки["ЗаправитьАМНет"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;	
	КонецЕсли;
	
	Если ДанныеДокумента.ПостановкаНаУчетГИБДД Тогда 
		ОбластьСтраница.Области["ПостановкаНаУчетГИБДДДА"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	Иначе	
		//ОбластьСтраница.Рисунки["ПостановкаНаУчетГИБДДНет"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	КонецЕсли;
	
	Если ДанныеДокумента.АвтоПроверенПоFlashAves Тогда 
		ОбластьСтраница.Области["АвтоПроверенПоFlashAves"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	КонецЕсли;

	Если ДанныеДокумента.ЛистДлительногоХранения Тогда 
		ОбластьСтраница.Области["ЛистДлительногоХраненияДа"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	КонецЕсли;

	Если ДанныеДокумента.ДокументыВыданыКлиентуВПолномОбъеме Тогда 
		ОбластьСтраница.Области["ДокументыВыданыКлиентуВПолномОбъемеДа"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	КонецЕсли;    
	
	Если ДанныеДокумента.СостАвтоСоотвТребКачестваПримеки Тогда 
		ОбластьСтраница.Области["СостАвтоСоотвТребКачестваПримекиДа"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	Иначе	
		//ОбластьСтраница.Рисунки["СостАвтоСоотвТребКачестваПримекиНет"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	КонецЕсли;
	
	Если ДанныеДокумента.НаличиеOTS_ПА Тогда 
		ОбластьСтраница.Области["НаличиеOTS_ПАДА"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	иначе
		//ОбластьСтраница.Рисунки["НаличиеOTS_ПАНет"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	КонецЕсли;
	
	Если ДанныеДокумента.НаличиеOTS_ППП	Тогда 
		ОбластьСтраница.Области["НаличиеOTS_ПППДа"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	Иначе
		//ОбластьСтраница.Рисунки["НаличиеOTS_ПППНет"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;		
	КонецЕсли;
	
	
	Если ДанныеДокумента.НаличиеOTS_ПП	Тогда 
		ОбластьСтраница.Области["НаличиеOTS_ППДа"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	КонецЕсли;
	
	Если ДанныеДокумента.ВыявленыПроблемыАМ Тогда 
		ОбластьСтраница.Области["ВыявленыПроблемыАМДа"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	Иначе	
		//ОбластьСтраница.Рисунки["ВыявленыПроблемыАМНет"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	КонецЕсли;

	//	Если ДанныеДокумента.АкбВХорошемСостоянии Тогда 
	//	ОбластьСтраница.Рисунки["АкбВХорошемСостоянииДа"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	//Иначе	
	//	//ОбластьСтраница.Рисунки["АкбВХорошемСостоянииНет"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	//КонецЕсли;

	Если ДанныеДокумента.ТопливоЗаправлено Тогда 
		ОбластьСтраница.Области["ТопливоЗаправленоДа"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	Иначе	
		//ОбластьСтраница.Рисунки["ТопливоЗаправленоНет"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	КонецЕсли;

	Если ДанныеДокумента.УстановленыНомерныеЗнаки Тогда 
		ОбластьСтраница.Области["УстановленыНомерныеЗнакиДа"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	Иначе	
		//ОбластьСтраница.Рисунки["УстановленыНомерныеЗнакиНет"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	КонецЕсли;
	
	Если ДанныеДокумента.ЛокДвигатель Тогда 
		ОбластьСтраница.Области["ЛокДвигатель"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	КонецЕсли;
	
	Если ДанныеДокумента.ЛокКолесаШины Тогда 
		ОбластьСтраница.Области["ЛокКолесаШины"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	КонецЕсли;
	
	Если ДанныеДокумента.ЛокНаружныеПовреждения Тогда 
		ОбластьСтраница.Области["ЛокНаружныеПовреждения"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	КонецЕсли;

	Если ДанныеДокумента.ЛокИнтерьерАвтомобиля Тогда 
		ОбластьСтраница.Области["ЛокИнтерьерАвтомобиля"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	КонецЕсли;

	Если ДанныеДокумента.ЛокДругое Тогда 
		ОбластьСтраница.Области["ЛокДругое"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	КонецЕсли;

	Если ДанныеДокумента.СоответствиеАмПП Тогда 
		ОбластьСтраница.Области["СоответствиеАмППДа"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	Иначе	
		//ОбластьСтраница.Рисунки["СоответствиеАмППНет"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;	
	КонецЕсли;

	Если ДанныеДокумента.ПроверкаПоFlashAVESВыполнена Тогда 
		ОбластьСтраница.Области["ПроверкаПоFlashAVESВыполнена"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	КонецЕсли;

	Если ДанныеДокумента.АМСоответствуетВыдаче Тогда 
		ОбластьСтраница.Области["АМСоответствуетВыдачеДа"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	Иначе
		//ОбластьСтраница.Рисунки["АМСоответствуетВыдачеНет"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	КонецЕсли;
	
	Если ДанныеДокумента.BluetoothСинхронизированаСТелефономКлиента Тогда 
		ОбластьСтраница.Области["BluetoothСинхронизированаСТелефономКлиента"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	КонецЕсли;
	Если ДанныеДокумента.АудиосистемаНастроена Тогда 
		ОбластьСтраница.Области["АудиосистемаНастроена"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	КонецЕсли;
	Если ДанныеДокумента.АдресКлиентаВведенВНавигатор Тогда 
		ОбластьСтраница.Области["АдресКлиентаВведенВНавигатор"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	КонецЕсли;
	
	// Сергеев В.Н. DMSREN-864
	СогласиеНаОбработкуПерсональныхДанных = Документы.DMS_СогласиеНаОбработкуПерсональныхДанных.ВернутьСогласиеПоКлиенту(ДанныеДокумента.Клиент);
	СогласиеНаПодключаемыеСервисы = Ложь;
	
	Если ЗначениеЗаполнено(СогласиеНаОбработкуПерсональныхДанных) Тогда
	    СогласиеНаПодключаемыеСервисы = СогласиеНаОбработкуПерсональныхДанных.СогласиеНаПодключаемыеСервисы;
	КонецЕсли;
	
	Если СогласиеНаПодключаемыеСервисы Тогда
		ОбластьСтраница.Области["НаличиеСогласияНаПодключаемыеСервисы1"].Картинка = БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	Иначе	
	    ОбластьСтраница.Области["ОтсутствиеСогласияНаПодключаемыеСервисы1"].Картинка = БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
	КонецЕсли;
	ТаблицаЧекЛистВыдача = Ссылка.ЧекЛистВыдача.Выгрузить();
	Для каждого Стр Из ТаблицаЧекЛистВыдача Цикл
		Если Стр.Подробности = "Зарядить 30 мин ATEQ. Если на а/м сообщение о необходимости заряда АКБ, заряжать ATEQ до полной зарядки (зеленый индикатор горит постоянно, не мигает)" 
		 И ЗначениеЗаполнено(Стр.ДатаФакт) Тогда
			ОбластьСтраница.Области["ЗарядкаАКБ_ДА"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
		КонецЕсли; 
	КонецЦикла; 
	
	СписокОтзывныхНот = Renault_АвтосервисСерверПовтИспользования.ПолучитьОписаниеДействующихОТС(ДанныеДокумента.VIN);
	Если Не ПустаяСтрока(СписокОтзывныхНот) Тогда
		ОбластьСтраница.Области["НаличиеОТСВыдачиДа"].Картинка =  БиблиотекаКартинок.CRM_ИзображениеСобытиеВыполнено;
		ОбластьСтраница.Параметры.ОписаниеOTS_Выдачи = СписокОтзывныхНот
	КонецЕсли;
	
	//Заполним опции, аксессуары, автоработы
	ОбластьСтраница.Параметры.Опции = "";
	Для каждого стр из Ссылка.Опции цикл
		ОбластьСтраница.Параметры.Опции = ОбластьСтраница.Параметры.Опции + Стр.Опция.Наименование + ?(Стр.НомерСтроки<Ссылка.Опции.Количество(),", ","");		
	КонецЦикла;
	//ОбластьСтраница.Параметры.Аксессуары = "";
	Сч = 0;
	Для каждого стр из Ссылка.Аксессуары цикл
		Сч = Сч + 1;
		Если Сч <= 4 Тогда
			Если ТипЗнч(Стр.Номенклатура) = Тип("Строка") Тогда
				ОбластьСтраница.Параметры["Аксессуар" + Сч] = Стр.Номенклатура;		
			Иначе	
				ОбластьСтраница.Параметры["Аксессуар" + Сч] = Стр.Номенклатура.Наименование;		
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла;
	ОбластьСтраница.Параметры.Автоработы = "";
	Для каждого стр из Ссылка.Автоработы цикл
		Если ТипЗнч(Стр.Номенклатура) = Тип("Строка") Тогда
			ОбластьСтраница.Параметры.Автоработы = ОбластьСтраница.Параметры.Автоработы + Стр.Номенклатура + ?(Стр.НомерСтроки<Ссылка.Автоработы.Количество(),", ","");			
		Иначе	
			ОбластьСтраница.Параметры.Автоработы = ОбластьСтраница.Параметры.Автоработы + Стр.Номенклатура.Наименование + ?(Стр.НомерСтроки<Ссылка.Автоработы.Количество(),", ","");		
		КонецЕсли;	
	КонецЦикла;

	////Заполним повреждения автомобиля
	//Для каждого стрПовреждение из Ссылка.ДефектыКузова цикл
	//	Если стрПовреждение.Повреждение = 1 тогда
	//		ОбластьСтраница.Рисунки["Кузов"+стрПовреждение.ЗонаПовреждения.ИмяПредопределенныхДанных].Картинка = БиблиотекаКартинок.Renault_Cross;
	//	КонецЕсли;
	//КонецЦикла;
	//	
	//Для каждого стрПовреждение из Ссылка.ДефектыСалона цикл
	//	Если стрПовреждение.Повреждение = 1 тогда
	//		ОбластьСтраница.Рисунки["Салон"+стрПовреждение.ЗонаПовреждения.ИмяПредопределенныхДанных].Картинка = БиблиотекаКартинок.Renault_Cross;
	//	КонецЕсли;
	//КонецЦикла;
	
	//приведем телефон к 
	Если ЗначениеЗаполнено(ДанныеДокумента.ТелефонКлиента) тогда
		Если Лев(ДанныеДокумента.ТелефонКлиента,1) = "9" тогда
			ОбластьСтраница.Параметры.ТелефонКлиента = "8"+ ДанныеДокумента.ТелефонКлиента;
		КонецЕсли;
	КонецЕсли;
	
    ТабДок.ВерхнийКолонтитул.Выводить = Ложь;
	ТабДок.НижнийКолонтитул.Выводить = Ложь;
	ТабДок.ПолеСнизу = 0;
	ТабДок.ПолеСверху = 0;	
	
	ТабДок.Вывести(ОбластьСтраница);
	
	 
КонецПроцедуры

Функция ПолучитьДанныеОбъекта(СсылкаНаОбъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ЗаказНаряд.Дата) КАК ПланируемаяДатаУстановкиАксессуаров
	               |ПОМЕСТИТЬ ВтДатыЗаказаАксессуаров
	               |ИЗ
	               |	Документ.DMS_КартаКачестваПоставки КАК DMS_КартаКачестваПоставки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд КАК ЗаказНаряд
	               |		ПО DMS_КартаКачестваПоставки.Автомобиль = ЗаказНаряд.Автомобиль
	               |ГДЕ
	               |	DMS_КартаКачестваПоставки.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	DMS_КартаКачестваПоставки.Ссылка,
	               |	DMS_КартаКачестваПоставки.Номер,
	               |	DMS_КартаКачестваПоставки.Дата,
	               |	DMS_КартаКачестваПоставки.Автосалон,
	               |	DMS_КартаКачестваПоставки.Автомобиль,
	               |	DMS_КартаКачестваПоставки.Менеджер,
	               |	DMS_КартаКачестваПоставки.КоммерческийАдминистратор,
	               |	DMS_КартаКачестваПоставки.НомерЗаказаDistri,
	               |	DMS_КартаКачестваПоставки.Модель,
	               |	DMS_КартаКачестваПоставки.Версия,
	               |	DMS_КартаКачестваПоставки.VIN,
	               |	DMS_КартаКачестваПоставки.Цвет,
	               |	DMS_КартаКачестваПоставки.КодМагнитолы,
	               |	DMS_КартаКачестваПоставки.АмНаСвобСкладе,
	               |	DMS_КартаКачестваПоставки.АмЗаказанПодКлиента,
	               |	DMS_КартаКачестваПоставки.Клиент,
	               |	DMS_КартаКачестваПоставки.ТелефонКлиента,
	               |	DMS_КартаКачестваПоставки.СогласованнаяДатаПоставки,
	               |	DMS_КартаКачестваПоставки.ЗаправитьАМ,
	               |	DMS_КартаКачестваПоставки.КоличествоЛитров,
	               |	DMS_КартаКачестваПоставки.СуммаЗаправки,
	               |	DMS_КартаКачестваПоставки.ПостановкаНаУчетГИБДД,
	               |	DMS_КартаКачестваПоставки.ГосНомер,
	               |	DMS_КартаКачестваПоставки.АдресКлиента,
	               |	DMS_КартаКачестваПоставки.ВыполненПриемкаАвтомобиля,
	               |	DMS_КартаКачестваПоставки.АвтоПроверенПоFlashAves,
	               |	DMS_КартаКачестваПоставки.СостАвтоСоотвТребКачестваПримеки,
	               |	DMS_КартаКачестваПоставки.НаличиеOTS_ПА,
	               |	DMS_КартаКачестваПоставки.ОписаниеOTS_ПА,
	               |	DMS_КартаКачестваПоставки.ДатаПримеки,
	               |	DMS_КартаКачестваПоставки.ФИОПримещика,
	               |	DMS_КартаКачестваПоставки.ВыполненПланированиеПредпродажнойПодготовки,
	               |	DMS_КартаКачестваПоставки.СогласованнаяДатаВыдачи,
	               |	DMS_КартаКачестваПоставки.ПланируемаяДатаПредпродажнойПодготовки,
	               |	DMS_КартаКачестваПоставки.НаличиеOTS_ППП,
	               |	DMS_КартаКачестваПоставки.ОписаниеOTS_ППП,
	               |	DMS_КартаКачестваПоставки.ВыполненПредпродажнаяПодготовка,
	               |	DMS_КартаКачестваПоставки.ВыявленыПроблемыАМ,
	               |	DMS_КартаКачестваПоставки.АкбВХорошемСостоянии,
	               |	DMS_КартаКачестваПоставки.КодСостоянияАКБ,
	               |	DMS_КартаКачестваПоставки.ТопливоЗаправлено,
	               |	DMS_КартаКачестваПоставки.КоличествоТоплива,
	               |	DMS_КартаКачестваПоставки.УстановленыНомерныеЗнаки,
	               |	DMS_КартаКачестваПоставки.ЛокДвигатель,
	               |	DMS_КартаКачестваПоставки.ЛокКолесаШины,
	               |	DMS_КартаКачестваПоставки.ЛокНаружныеПовреждения,
	               |	DMS_КартаКачестваПоставки.ЛокИнтерьерАвтомобиля,
	               |	DMS_КартаКачестваПоставки.ЛокДругое,
	               |	DMS_КартаКачестваПоставки.ОписаниеНесоответствия,
	               |	DMS_КартаКачестваПоставки.ДатаПППодготовки,
	               |	DMS_КартаКачестваПоставки.ФИОМеханикаПП,
	               |	DMS_КартаКачестваПоставки.ФИОИсполнителяРаботПП,
	               |	DMS_КартаКачестваПоставки.ДатаКонтроляАмПослеРемонта,
	               |	DMS_КартаКачестваПоставки.ФИОКонтролера,
	               |	DMS_КартаКачестваПоставки.СоответствиеАмПП,
	               |	DMS_КартаКачестваПоставки.ВыполненТоржественнаяВыдача,
	               |	DMS_КартаКачестваПоставки.ПроверкаПоFlashAVESВыполнена,
	               |	DMS_КартаКачестваПоставки.АМСоответствуетВыдаче,
	               |	DMS_КартаКачестваПоставки.BluetoothСинхронизированаСТелефономКлиента,
	               |	DMS_КартаКачестваПоставки.АудиосистемаНастроена,
	               |	DMS_КартаКачестваПоставки.АдресКлиентаВведенВНавигатор,
	               |	DMS_КартаКачестваПоставки.ДатаВыдачиАвто,
	               |	DMS_КартаКачестваПоставки.ФИОВыдавшегоАвто,
	               |	DMS_КартаКачестваПоставки.Опции.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		Опция,
	               |		Цена
	               |	),
	               |	DMS_КартаКачестваПоставки.Аксессуары.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		Номенклатура,
	               |		Количество,
	               |		Цена,
	               |		Сумма
	               |	),
	               |	DMS_КартаКачестваПоставки.Автоработы.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		Номенклатура,
	               |		Количество,
	               |		Цена,
	               |		Сумма
	               |	),
	               |	DMS_КартаКачестваПоставки.ДефектыКузова.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		ЗонаПовреждения
	               |	),
	               |	DMS_КартаКачестваПоставки.ДефектыСалона.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		ЗонаПовреждения
	               |	),
	               |	ВтДатыЗаказаАксессуаров.ПланируемаяДатаУстановкиАксессуаров КАК ПланируемаяДатаУстановкиАксессуаров,
	               |	ЕСТЬNULL(CRM_СостояниеАвтомобилейПроизводителя_v2.DATE_MADC, """") КАК ДатаMADC,
	               |	DMS_КартаКачестваПоставки.ЛистДлительногоХранения,
	               |	DMS_КартаКачестваПоставки.ДокументыВыданыКлиентуВПолномОбъеме,
	               |	DMS_КартаКачестваПоставки.НаличиеOTS_ПП,
	               |	DMS_КартаКачестваПоставки.ОписаниеOTS_ПП
	               |ИЗ
	               |	Документ.DMS_КартаКачестваПоставки КАК DMS_КартаКачестваПоставки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
	               |		ПО DMS_КартаКачестваПоставки.VIN = CRM_СостояниеАвтомобилейПроизводителя_v2.VIN,
	               |	ВтДатыЗаказаАксессуаров КАК ВтДатыЗаказаАксессуаров
	               |ГДЕ
	               |	DMS_КартаКачестваПоставки.Ссылка = &Ссылка";
				   
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Выборка = Запрос.Выполнить().Выгрузить();
		
	ДанныеОбъекта = Новый Структура;
	
	Для Каждого СтрокаТаблицы Из Выборка Цикл
		Для Каждого Столбец Из Выборка.Колонки Цикл
			ДанныеОбъекта.Вставить(Столбец.Имя, СтрокаТаблицы[Столбец.Имя]);
		КонецЦикла;
	КонецЦикла;
	
	//// Дата производства А/М
	//Запись = РегистрыСведений.CRM_СостояниеАвтомобилейПроизводителя_v2.СоздатьМенеджерЗаписи();
	//Запись.VIN = СсылкаНаОбъект.VIN;
	//Запись.Прочитать();
	//MADC = ?(Запись.Выбран(),Запись.DATE_MADC,"");

	//ДанныеОбъекта.Вставить("ДатаMADC",MADC);
	
	Возврат ДанныеОбъекта;
		
КонецФункции

Процедура ПечатьСмета(ТабДок,ДокОбъект) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	DMS_КартаКачестваПоставкиРаботыPVR.КодОперации КАК код,
	|	DMS_КартаКачестваПоставкиРаботыPVR.НаименованиеОперации КАК Наименование,
	|	DMS_КартаКачестваПоставкиРаботыPVR.НормаЧас КАК НормаВремени,
	|	DMS_КартаКачестваПоставкиРаботыPVR.Стоимость КАК Стоимость,
	|	""Работы"" КАК Сортировка
	|ИЗ
	|	Документ.DMS_КартаКачестваПоставки.РаботыPVR КАК DMS_КартаКачестваПоставкиРаботыPVR
	|ГДЕ
	|	DMS_КартаКачестваПоставкиРаботыPVR.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	DMS_КартаКачестваПоставкиТоварыPVR.НаименованиеТовара,
	|	DMS_КартаКачестваПоставкиТоварыPVR.Количество,
	|	DMS_КартаКачестваПоставкиТоварыPVR.Стоимость,
	|	""Товары""
	|ИЗ
	|	Документ.DMS_КартаКачестваПоставки.ТоварыPVR КАК DMS_КартаКачестваПоставкиТоварыPVR
	|ГДЕ
	|	DMS_КартаКачестваПоставкиТоварыPVR.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокОбъект);
	
	ТЗДанных = Запрос.Выполнить().Выгрузить();
	
	Макет = Документы.DMS_КартаКачестваПоставки.ПолучитьМакет("МакетСмета");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ПредставлениеОрганизации = ПолучитьПредставлениеОрганизации(ДокОбъект.Автосалон.Организация);
	ОбластьШапка.Параметры.Заполнить(ПредставлениеОрганизации);
	ОбластьШапка.Параметры.НомерДокумента = ДокОбъект.Номер;
	ОбластьШапка.Параметры.ДатаДокумента = Формат(ДокОбъект.Дата,"ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.Модель = ДокОбъект.Модель.НаименованиеПолное;
	ОбластьШапка.Параметры.VIN = ДокОбъект.VIN;
	
	ТабДок.Вывести (ОбластьШапка);
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДок.Вывести (ОбластьШапкаТаблицы);
	
	ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
	
	сОтбор = Новый Структура("Сортировка", "Работы");
	Работы = ТЗДанных.НайтиСтроки(сОтбор);
	ИтогРабот = 0;
	Если Работы.Количество() > 0 Тогда
		ОбластьСтроки.Параметры.Наименование = "Описание работ";
		ТабДок.Вывести(ОбластьСтроки);
	КонецЕсли;
	Для Каждого СтрРабот из Работы Цикл
		ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
		ОбластьСтроки.Параметры.Заполнить(СтрРабот);
		ТабДок.Вывести(ОбластьСтроки);
		ИтогРабот = ИтогРабот + СтрРабот.Стоимость;
	КонецЦикла;
	ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
	ОбластьСтроки.Параметры.Наименование = "Итого работы:";
	ОбластьСтроки.Параметры.Стоимость = ИтогРабот;
	ТабДок.Вывести(ОбластьСтроки);
	
	сОтбор = Новый Структура("Сортировка", "Товары");
	Товары = ТЗДанных.НайтиСтроки(сОтбор);
	ИтогТовары = 0;
	Если Товары.Количество() > 0 Тогда
		ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
		ТабДок.Вывести(ОбластьСтроки);
		ОбластьСтроки.Параметры.Наименование = "Запчасти и расходные материалы:";
		ТабДок.Вывести(ОбластьСтроки);
	КонецЕсли;
	Для Каждого СтрТовары из Товары Цикл
		ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
		ОбластьСтроки.Параметры.Заполнить(СтрТовары);
		ТабДок.Вывести(ОбластьСтроки);
		ИтогТовары = ИтогТовары + СтрТовары.Стоимость;
	КонецЦикла;
	ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
	ОбластьСтроки.Параметры.Наименование = "Итого товары:";
	ОбластьСтроки.Параметры.Стоимость = ИтогТовары;
	ТабДок.Вывести(ОбластьСтроки);
	ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
	ОбластьСтроки.Параметры.Наименование = "Всего на общую сумму:";
	ОбластьСтроки.Параметры.Стоимость = ИтогРабот + ИтогТовары;
	ТабДок.Вывести(ОбластьСтроки);
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.стоимостьНомоЧаса = ДокОбъект.СтоимостьНормаЧаса;
	ОбластьПодвал.Параметры.стоимостьНомоЧасаПрописью = ВывестиПрописьюЦелуюЧасть (ДокОбъект.СтоимостьНормаЧаса);
	ТабДок.Вывести(ОбластьПодвал);
	
	
КонецПроцедуры

Процедура ПечатьРекАкт(ТабДок,ДокОбъект) Экспорт 
	
	Если ДокОбъект.Автомобили.Количество() = 0 Тогда 
		//Предупреждение("Документ поступления автомобилей не содержит автомобилей");
		Возврат;
	КонецЕсли;
	
	ЗапросПВР = Новый Запрос;
	ЗапросПВР.Текст = 
	"ВЫБРАТЬ
	|	ДокументDMS_КартаКачестваПоставки.Ссылка
	|ИЗ
	|	Документ.DMS_КартаКачестваПоставки КАК ДокументDMS_КартаКачестваПоставки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
	|		ПО ДокументDMS_КартаКачестваПоставки.Автомобиль = ПоступлениеАвтомобилейАвтомобили.Автомобиль
	|			И (ПоступлениеАвтомобилейАвтомобили.Ссылка.ПометкаУдаления = ЛОЖЬ)
	|ГДЕ
	|	ДокументDMS_КартаКачестваПоставки.СостАвтоСоотвТребКачестваПримеки = ЛОЖЬ
	|	И ПоступлениеАвтомобилейАвтомобили.Ссылка = &Ссылка";
	ЗапросПВР.УстановитьПараметр("ссылка", ДокОбъект);
	ТЗДокПВР = ЗапросПВР.Выполнить().Выгрузить();
	Если ТЗДокПВР.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	мДокПВР = ТЗДокПВР.ВыгрузитьКолонку("Ссылка");
	ДокПВР = мДокПВР[0];
	
	Макет = ПолучитьМакет("МакетРекАкт");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ПредставлениеОрганизации = ПолучитьПредставлениеОрганизации(ДокОбъект.Организация);
	ОбластьШапка.Параметры.Заполнить(ПредставлениеОрганизации);
	ОбластьШапка.Параметры.ЮрРено = ДокОбъект.Контрагент.НаименованиеПолное;
	ОбластьШапка.Параметры.НомерДокумента = ДокОбъект.Номер;
	ОбластьШапка.Параметры.ДатаДокумента = Формат (ДокОбъект.Дата, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.номердоговора = ДокПВР.Автосалон.НомерДилерскогоДоговора;
	ОбластьШапка.Параметры.ДатаДоговора = Формат(ДокПВР.Автосалон.ДатаДилерскогоДоговора, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.Город = киПолучитьГород(ДокОбъект.Организация,Справочники.ВидыКонтактнойИнформации.АдресФактический);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.DATE_FACT,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.NUM_TTN
	|ИЗ
	|	РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
	|ГДЕ
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.VIN В(&VIN)
	|	И CRM_СостояниеАвтомобилейПроизводителя_v2.DATE_FACT <> ДАТАВРЕМЯ(1, 1, 1)";
	Запрос.УстановитьПараметр("VIN", ДокОбъект.Автомобили.ВыгрузитьКолонку("VIN"));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбластьШапка.Параметры.ДатаОтгрузки = Формат(Выборка.DATE_FACT,"ДФ=dd.MM.yyyy");
		ОбластьШапка.Параметры.НомерТТН = Выборка.NUM_TTN;
		ОбластьШапка.Параметры.ДатаТТН = Формат(ДокОбъект.ВхДокДата, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьШапка);
	Для Каждого СтрАвтомобили из ДокОбъект.Автомобили Цикл
		ОбластьАвтомобили = Макет.ПолучитьОбласть("Автомобили");
		ОбластьАвтомобили.Параметры.VIN = СтрАвтомобили.VIN;
		ОбластьАвтомобили.Параметры.НаименованиеАвтомобиля = "Renault " + СтрАвтомобили.Автомобиль.Модель + " " + СтрАвтомобили.Автомобиль.ВариантКомплектации;
		ТабДок.Вывести(ОбластьАвтомобили);
	КонецЦикла;
	
	ОбластьШапка_2 = Макет.ПолучитьОбласть("Шапка_2");
	ОбластьШапка_2.Параметры.НомерДоговораПеревозки = ДокПВР.ДоговорПеревозчика.Наименование;
	ОбластьШапка_2.Параметры.ЮрНаименованиеПеревозки = ДокПВР.ТранспортнаяКомпания.Наименование;
	ПредставлениеПеревозчик = ПолучитьПредставлениеОрганизации(ДокПВР.ТранспортнаяКомпания);
	ОбластьШапка_2.Параметры.ФактическийАдрес = ПредставлениеОрганизации.ФактическийАдрес;
	ТабДок.Вывести(ОбластьШапка_2);
	
	Для Каждого СтрокаДокПВР из мДокПВР Цикл
		ОбластьСтрокиПВР = Макет.ПолучитьОбласть("СтрокиПВР");
		ОбластьСтрокиПВР.Параметры.НомерПВР = СтрокаДокПВР.НомерPVR;
		ОбластьСтрокиПВР.Параметры.ДатаПВР = Формат(СтрокаДокПВР.ДатаPVR,"ДФ=dd.MM.yyyy");
		ТабДок.Вывести(ОбластьСтрокиПВР);
	КонецЦикла;
	
	ОбластьШапка_3 = Макет.ПолучитьОбласть("Шапка_3");
	ОбластьШапка_3.Параметры.ФИОВодитель = ДокПВР.Водитель;
	ОбластьШапка_3.Параметры.НомерТягача = ""+ ДокПВР.НомерАвтовоза +" / "+ ДокПВР.НомерПрицепа;
	ТабДок.Вывести(ОбластьШапка_3);
	Для Каждого СтрокаДокПВР из мДокПВР Цикл
		ОбластьСтрокиПовреждения = Макет.ПолучитьОбласть("СтрокиПовреждения");
		ОбластьСтрокиПовреждения.Параметры.VIN = СтрокаДокПВР.VIN;
		СтрокаПовреждения = "";
		Для Каждого СтрТЗПовреждения из СтрокаДокПВР.ПоврежденияПоPVR Цикл 
			СтрокаПовреждения = СтрокаПовреждения + СтрТЗПовреждения.Характер + " " + СтрТЗПовреждения.Деталь +", ";
		КонецЦикла;
		ОбластьСтрокиПовреждения.Параметры.Повреждения = СтрокаПовреждения;
		ТабДок.Вывести(ОбластьСтрокиПовреждения);
	КонецЦикла;
	
	ОбластьШапка_4 = Макет.ПолучитьОбласть("Шапка_4");
	ТабДок.Вывести(ОбластьШапка_4);
	ИтогоСтоимость = 0;
	Для Каждого СтрокаДокПВР из мДокПВР Цикл
		
		ОбластьСтрокиСумма = Макет.ПолучитьОбласть("СтрокиСумма");
		ИтогоСтоимость = ИтогоСтоимость + СтрокаДокПВР.РаботыPVR.Итог("Стоимость") + СтрокаДокПВР.ТоварыPVR.Итог("Стоимость");
		ОбластьСтрокиСумма.Параметры.VIN = СтрокаДокПВР.VIN;
		ОбластьСтрокиСумма.Параметры.Сумма = СтрокаДокПВР.РаботыPVR.Итог("Стоимость") + СтрокаДокПВР.ТоварыPVR.Итог("Стоимость");
		ТабДок.Вывести(ОбластьСтрокиСумма);
	КонецЦикла;
	
	ОбластьШапка_5 = Макет.ПолучитьОбласть("Шапка_5");
	ОбластьШапка_5.Параметры.СуммаРемонта = ИтогоСтоимость;
	ОбластьШапка_5.Параметры.Организация = ПредставлениеОрганизации.Наименование;
	ОбластьШапка_5.Параметры.СуммаРемонта = ИтогоСтоимость;
	ТабДок.Вывести(ОбластьШапка_5);
	
	Для Каждого СтрокаДокПВР из мДокПВР Цикл
		
		ОбластьСтроки = Макет.ПолучитьОбласть("Строки");
		ОбластьСтроки.Параметры.НомерПВР = СтрокаДокПВР.НомерPVR;
		ОбластьСтроки.Параметры.ДатаПВР = Формат(СтрокаДокПВР.ДатаPVR, "ДФ=dd.MM.yyyy");
		ОбластьСтроки.Параметры.НомерСметы = СтрокаДокПВР.Номер;;
		ОбластьСтроки.Параметры.ДатаСметы = Формат(ДокОбъект.Дата,"ДФ=dd.MM.yyyy");
		ТабДок.Вывести(ОбластьСтроки);
	КонецЦикла;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.СуммаРемонта = ИтогоСтоимость;
	ОбластьПодвал.Параметры.СуммаРемонтаПрописью = ВывестиПрописьюЦелуюЧасть (ИтогоСтоимость);
	ОбластьПодвал.Параметры.РасчетныйСчет = ПараметрыСеанса.Организация.ОсновнойБанковскийСчет;
	ТабДок.Вывести (ОбластьПодвал);
	
КонецПроцедуры

Процедура ПечатьТорг2(ТабДокумент,ДокОбъект) Экспорт 
	
	Перем тзВрем; // Временная таблица значений
	Перем ФорматВыводаСуммы; // Строка формата вывода суммы
	Перем ФорматВыводаКоличества; // Строка формата вывода количества
	//
	ФорматВыводаСуммы      = "ЧЦ=10; ЧДЦ=2; ЧН=0";
	ФорматВыводаКоличества = "ЧЦ=10; ЧДЦ=3; ЧН=0.000";
	
	// Получим табличную часть за исключением услуг
	тзВрем = ДокОбъект.Автомобили.Выгрузить();
	тзВрем.Колонки.Добавить("Брутто", Новый ОписаниеТипов("Число",
	Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)));
	мсвУдалить = Новый Массив;
	//Для каждого ТекСтрока Из тзВрем Цикл
	//	ТекСтрока.Брутто = ТекСтрока.Количество * ТекСтрока.ЕдиницаИзмерения.Вес;
	//КонецЦикла;
	Для каждого ТекСтрока Из мсвУдалить Цикл
		тзВрем.Удалить(ТекСтрока);	   
	КонецЦикла;
	
	ЗапросПВР = Новый Запрос;
	ЗапросПВР.Текст = 
	"ВЫБРАТЬ
	|	ДокументDMS_КартаКачестваПоставки.Ссылка
	|ИЗ
	|	Документ.DMS_КартаКачестваПоставки КАК ДокументDMS_КартаКачестваПоставки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
	|		ПО ДокументDMS_КартаКачестваПоставки.Автомобиль = ПоступлениеАвтомобилейАвтомобили.Автомобиль
	|			И (ПоступлениеАвтомобилейАвтомобили.Ссылка.ПометкаУдаления = ЛОЖЬ)
	|ГДЕ
	|	ДокументDMS_КартаКачестваПоставки.СостАвтоСоотвТребКачестваПримеки = ЛОЖЬ
	|	И ПоступлениеАвтомобилейАвтомобили.Ссылка = &Ссылка";
	ЗапросПВР.УстановитьПараметр("ссылка", ДокОбъект);
	ТЗДокПВР = ЗапросПВР.Выполнить().Выгрузить();
	Если ТЗДокПВР.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	мДокПВР = ТЗДокПВР.ВыгрузитьКолонку("Ссылка");
	ДокПВР = мДокПВР[0];
	
	Макет = ПолучитьМакет("ТОРГ2");
	
	ОбластьСтраница1 = Макет.ПолучитьОбласть("ШапкаСтраница1");
	ОбластьСтраница1.Параметры.Заполнить(ДокОбъект);
	
	Параметры = Новый Структура;
	
	СтруктураПредставления1=Новый Структура(
	"Наименование,ИНН,КПП,АдресЮридический,ТелефонРабочий",
	"","ИНН ","КПП ","","тел.: "
	);
	СтруктураПредставления2=Новый Структура(
	"Наименование,ИНН,КПП,АдресФактический,ТелефонРабочий",
	"","ИНН ","КПП ","","тел.: "
	);
	
	// Правим, что автоматом не заполнилось, или заполнилось неправильно
	Если НЕ обЗначениеНеЗаполнено(ДокОбъект.ПодразделениеКомпании) И НЕ обЗначениеНеЗаполнено(ДокОбъект.ПодразделениеКомпании.КПП) Тогда
		СтрокаПредставления = спПолучитьПредставление(ДокОбъект.Организация, СтруктураПредставления1);
		Параметры.Вставить("ОрганизацияПредставление", СтрЗаменить(СтрокаПредставления, ДокОбъект.Организация.КПП, ДокОбъект.ПодразделениеКомпании.КПП));
	Иначе	
		Параметры.Вставить("ОрганизацияПредставление", спПолучитьПредставление(ДокОбъект.Организация, СтруктураПредставления1));
	КонецЕсли;
	Параметры.Вставить("КодПоОКПО",				 ДокОбъект.Организация.КодПоОКПО);
	Параметры.Вставить("ВидДеятельностиПоОКДП",	 ДокОбъект.Организация.КодПоОКДП);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.DATE_FACT,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.NUM_TTN,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.DEALER_PRICE_FULL,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.VIN
	|ИЗ
	|	РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
	|ГДЕ
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.VIN В(&VIN)";
	Запрос.УстановитьПараметр("VIN", ДокОбъект.Автомобили.ВыгрузитьКолонку("VIN"));
	Выборка = Запрос.Выполнить().Выбрать();
	ТЗДанных = Запрос.Выполнить().Выгрузить();
	Если Выборка.Следующий() Тогда
		Параметры.Вставить("ПредставлениеДокумента", "Товарно транспортная накладная №" + Выборка.NUM_TTN +" от " + Формат(ДокОбъект.ВхДокДата,"ДФ=dd.MM.yyyy"));
	КонецЕсли;
	Параметры.Вставить("Номер",	 ДокОбъект.Номер);
	Параметры.Вставить("Дата",	 ДокОбъект.Дата);
	
	Параметры.Вставить("МестоПриемки",	                 ДокОбъект.СкладКомпании);
	Параметры.Вставить("ГрузоотправительПредставление",	 спПолучитьПредставление(обПолучитьЗначениеСвойства(,"Грузоотправитель",ДокОбъект.Контрагент),СтруктураПредставления2));
	Параметры.Вставить("ПоставщикПредставление",	     спПолучитьПредставление(ДокОбъект.Контрагент,СтруктураПредставления1));
	//Параметры.Вставить("ПроизводительПредставление",	 дкОтветственноеЛицо(ДокОбъект, "Производитель").ПроизводительПредставление);
	//Параметры.Вставить("СтраховаяКомпанияПредставление", дкОтветственноеЛицо(ДокОбъект, "СтраховаяКомпания").СтраховаяКомпанияПредставление);
	//Параметры.Вставить("СпособДоставкиПредставление",    обПолучитьЗначениеСвойства(ДокОбъект, ПланыВидовХарактеристик.СвойстваОбъектов.СпособДоставки, ""));
	
	ДатаОтправления = обПолучитьЗначениеСвойства(ДокОбъект, ПланыВидовХарактеристик.СвойстваОбъектов.ДатаОтправления, "");
	Если ДатаОтправления<>"" Тогда
		ДатаОтправления = "Дата отправления товара: " + Формат(ДокОбъект.ДатаОтправления, "ДЛФ=DD");
	Иначе
		ДатаОтправления = "Дата отправления товара " + " ""_______""  _____________________ _______ г.";
	КонецЕсли;
	
	//Параметры.Вставить("ДатаОтправления", ДокОбъект.ДатаОтправления);
	
	Параметры.Вставить("НомерДоговора",	СокрЛП(ДокОбъект.ДоговорВзаиморасчетов.НомерДоговора));
	Параметры.Вставить("ДатаДоговора",  Формат(ДокОбъект.ДоговорВзаиморасчетов.ДатаНачала, "ДЛФ=DD"));
	
	// Счет-фактура, если есть.
	МассивВидов=Новый Массив(1); МассивВидов[0]="СчетФактураПолученный"; 
	МассивПодчиненных = дкПолучитьМассивПодчиненных(ДокОбъект, МассивВидов);
	Если МассивПодчиненных.Количество()>0 Тогда
		// нашли
		СФ=МассивПодчиненных[0].Ссылка;
		Попытка
			НомерСФ = дкПолучитьНомерДляПечати(СФ);
			ДатаСФ  = Формат(СФ.Дата, "ДЛФ=DD");
		Исключение
			НомерСФ = "";
			ДатаСФ  = """" + "_______"  + """" + "  __________________________  " + "__________ г.";
		КонецПопытки; 
	Иначе
		НомерСФ = "";
		ДатаСФ  = """" + "_______"  + """" + "  __________________________  " + "__________ г.";
	КонецЕсли; 
	
	Параметры.Вставить("НомерСФ", НомерСФ);
	Параметры.Вставить("ДатаСФ",  ДатаСФ);
	Параметры.Вставить("СпособДоставкиПредставление", "автовоз № " + ДокПВР.НомерАвтовоза +"/"+ ДокПВР.НомерПрицепа);
	ОбластьСтраница1.Параметры.Заполнить(Параметры);
	
	ТабДокумент.Вывести(ОбластьСтраница1);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	// ВТОРАЯ СТРАНИЦА
	НомерСтраницы     = 3;
	НомерСтраницыПред = НомерСтраницы;
	
	ОбластьНомерСтроки = Макет.ПолучитьОбласть("НомерСтраницы");
	ОбластьНомерСтроки.Параметры.НомерСтраницы = "Страница: " + 2; 
	ТабДокумент.Вывести(ОбластьНомерСтроки);
	
	ОбластьСтраница2   = Макет.ПолучитьОбласть("ШапкаСтраница2"); 
 	ОбластьСтраница2.Параметры.КоличествоМестПоДокументу = Формат(тзВрем.Итог("Количество"), ФорматВыводаКоличества);
	ОбластьСтраница2.Параметры.Брутто                    = Формат(тзВрем.Итог("Брутто"),     ФорматВыводаКоличества);    
	ТабДокумент.Вывести(ОбластьСтраница2);
	
	// ВЫВОДИМ ТАБЛИЧНУЮ ЧАСТЬ
	ОбластьШапкаТЧ = Макет.ПолучитьОбласть("ШапкаТабличнойЧасти"); 
	ОбластьШапкаТЧ.Параметры.Валюта = ДокОбъект.ВалютаДокумента;
	ТабДокумент.Вывести(ОбластьШапкаТЧ);
	// Для последующего вывода
	ОбластьШапкаТЧ.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
	
	// получаем макет строки
	
	
	//перебор строк
	ВыборкаТабличнойЧасти = ДокОбъект.Автомобили;
	Для каждого СтрокаТабличнойЧасти Из тзВрем Цикл
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка1");
		//заполняем данные строки
		//СтруктураСтроки = дкПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТабличнойЧасти,ДокОбъект);
		ОбластьСтрока.Параметры.НомерСтроки = СтрокаТабличнойЧасти.НомерСтроки;
		ОбластьСтрока.Параметры.ТоварНаименование = "Автомобиль марки Renault";
		ОбластьСтрока.Параметры.Артикул = СтрокаТабличнойЧасти.VIN;
		//ОбластьСтрока.Параметры.Цена = ;
		СтрАвтосклад = ТЗДанных.Найти(СтрокаТабличнойЧасти.VIN, "VIN");
		Если СтрАвтосклад <> Неопределено Тогда
			ОбластьСтрока.Параметры.СуммаВсего = СтрАвтосклад.DEALER_PRICE_FULL;
		КонецЕсли;
		// Рассчитаем цену.
		//ОбластьСтрока.Параметры.Цена = Формат(СтрокаТабличнойЧасти.СуммаВсего / СтрокаТабличнойЧасти.Количество, ФорматВыводаСуммы);
		
		ОбластьСтрока.Параметры.КодЕдиницыПоОКЕИ = "" + СокрЛП("шт.");
		
		//выводим строку, делая проверку попадания на лист
		НомерСтраницы = ВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрока, ОбластьШапкаТЧ, , НомерСтраницы, ,ДокОбъект);  		
		
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			НомерСтраницыПред = НомерСтраницы;
			ОбластьШапкаТЧ.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли; 		
	КонецЦикла;
	
	
	// ВЫВОДИМ 3-Ю СТРАНИЦУ
	//ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
	//ОбластьНомерСтроки = Макет.ПолучитьОбласть("НомерСтраницы");
	//ОбластьНомерСтроки.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
	//ТабДокумент.Вывести(ОбластьНомерСтроки);
	
	ОбластьСтраница3   = Макет.ПолучитьОбласть("ШапкаСтраница3"); 	
	ТабДокумент.Вывести(ОбластьСтраница3);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
	ОбластьНомерСтроки = Макет.ПолучитьОбласть("НомерСтраницы");
	ОбластьНомерСтроки.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
	ТабДокумент.Вывести(ОбластьНомерСтроки);
	//НомерСтраницы = НомерСтраницы + 1;
	
	// ВЫВОДИМ ПРОДОЛЖЕНИЕ ТАБЛИЧНОЙ ЧАСТИ
	ОбластьШапкаТЧ = Макет.ПолучитьОбласть("ШапкаТабличнойЧасти2"); 
	ОбластьШапкаТЧ.Параметры.Валюта = ДокОбъект.ВалютаДокумента;
	ТабДокумент.Вывести(ОбластьШапкаТЧ);
	// Для последующего вывода
	ОбластьШапкаТЧ.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
	
	// получаем макет строки
		ИтогоРемонт = 0;
	//перебор строк
	Для каждого СтрокаТабличнойЧасти Из тзВрем Цикл
		//заполняем данные строки
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка2");
		ОбластьСтрока.Параметры.НомерСтроки = СтрокаТабличнойЧасти.НомерСтроки;
		//ОбластьСтрока.Параметры.ТоварНаименование = СтрокаТабличнойЧасти.Автомобиль.Наименование;
		ОбластьСтрока.Параметры.Артикул = СтрокаТабличнойЧасти.VIN;
		//ОбластьСтрока.Параметры.Цена = СтрокаТабличнойЧасти.Цена;   
		СтрАвтосклад = ТЗДанных.Найти(СтрокаТабличнойЧасти.VIN, "VIN");
		Если СтрАвтосклад <> Неопределено Тогда
			ОбластьСтрока.Параметры.СуммаВсего = СтрАвтосклад.DEALER_PRICE_FULL;
		КонецЕсли;
		//ОбластьСтрока.Параметры.СуммаВсего = СтрокаТабличнойЧасти.СуммаВсего;
		Для Каждого СтрокаПВР из мДокПВР Цикл
			Если СтрокаТабличнойЧасти.VIN = СтрокаПВР.VIN Тогда
				Если СтрокаПВР.РаботыPVR.Итог("Стоимость") = 0 и СтрокаПВР.ТоварыPVR.Итог("Стоимость") = 0 Тогда
					Продолжить;
				КонецЕсли;
				ИтогоРемонт = ИтогоРемонт + СтрокаПВР.РаботыPVR.Итог("Стоимость") + СтрокаПВР.ТоварыPVR.Итог("Стоимость");
				ОбластьСтрока.Параметры.СтоимостьРемонта = СтрокаПВР.РаботыPVR.Итог("Стоимость") + СтрокаПВР.ТоварыPVR.Итог("Стоимость");
				ОбластьСтрока.Параметры.брутто = 1;
			КонецЕсли;
		КонецЦикла;
		
		//выводим строку, делая проверку попадания на лист
		НомерСтраницы = ВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрока, ОбластьШапкаТЧ, , НомерСтраницы, ,ДокОбъект);
		
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			НомерСтраницыПред = НомерСтраницы;
			ОбластьШапкаТЧ.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли; 		
	КонецЦикла;
	
	
	// ВЫВОДИМ 4-Ю СТРАНИЦУ
	//ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//ОбластьНомерСтроки = Макет.ПолучитьОбласть("НомерСтраницы");
	//ОбластьНомерСтроки.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
	//ТабДокумент.Вывести(ОбластьНомерСтроки);
	
	ОбластьСтраница4_1 = Макет.ПолучитьОбласть("ШапкаСтраница4_1");
	ТабДокумент.Вывести (ОбластьСтраница4_1);
	
	Для Каждого СтрокаДокПВР из мДокПВР Цикл
		ОбластьСтрокиПовреждения = Макет.ПолучитьОбласть("ОписаниеПовреждений"); 
		СтрокаПовреждения = СтрокаДокПВР.VIN +"        ";
		Для Каждого СтрТЗПовреждения из СтрокаДокПВР.ПоврежденияПоPVR Цикл 
			СтрокаПовреждения = СтрокаПовреждения + СтрТЗПовреждения.Характер + " " + СтрТЗПовреждения.Деталь +", ";
		КонецЦикла;
		ОбластьСтрокиПовреждения.Параметры.ОписаниеПовреждений = СтрокаПовреждения;
		ТабДокумент.Вывести(ОбластьСтрокиПовреждения);
	КонецЦикла;
	
	ОбластьСтраница4 = Макет.ПолучитьОбласть("ШапкаСтраница4_2");
	ОбластьСтраница4.Параметры.ИтогоРемонт = ИтогоРемонт;
	ГлавныйБухгалтер = дкОтветственноеЛицо(ДокОбъект,"ГлавныйБухгалтер");
	ОбластьСтраница4.Параметры.Заполнить(ГлавныйБухгалтер);
	
	// Комиссия
	ПредседательКомиссии = дкОтветственноеЛицо(ДокОбъект,"ПредседательКомиссии");
	ОбластьСтраница4.Параметры.Заполнить(ПредседательКомиссии);
	
	ЧленКомиссии1 = дкОтветственноеЛицо(ДокОбъект,"ЧленКомиссии1");
	ОбластьСтраница4.Параметры.Заполнить(ЧленКомиссии1);
	
	ЧленКомиссии2 = дкОтветственноеЛицо(ДокОбъект,"ЧленКомиссии2");
	ОбластьСтраница4.Параметры.Заполнить(ЧленКомиссии2);
	
	ТабДокумент.Вывести(ОбластьСтраница4); 
	
	
	// Зададим параметры макета
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 15;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;

	
КонецПроцедуры

Процедура ПечатьПротоколОсмотра(ТабДокумент,ДокОбъект) Экспорт
	
	Если ПараметрыСеанса.DMS_Бренд = Справочники.CRM_МаркаАвтомобиля.LADA Тогда
		Макет = Документы.DMS_КартаКачестваПоставки.ПолучитьМакет("ПротоколОсмотраLADA");
	Иначе
		Макет = Документы.DMS_КартаКачестваПоставки.ПолучитьМакет("ПротоколОсмотраНовый");
	КонецЕсли;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	ОбластьШапка.Параметры.Номер = ДокОбъект.НомерPVR;
	Если ЗначениеЗаполнено(ДокОбъект.VIN) Тогда
		VIN  = ДокОбъект.VIN;
		ОбластьШапка.Параметры.V1 = Сред(VIN,1,1);
		ОбластьШапка.Параметры.V2 = Сред(VIN,2,1);
		ОбластьШапка.Параметры.V3 = Сред(VIN,3,1);
		ОбластьШапка.Параметры.V4 = Сред(VIN,4,1);
		ОбластьШапка.Параметры.V5 = Сред(VIN,5,1);
		ОбластьШапка.Параметры.V6 = Сред(VIN,6,1);
		ОбластьШапка.Параметры.V7 = Сред(VIN,7,1);
		ОбластьШапка.Параметры.V8 = Сред(VIN,8,1);
		ОбластьШапка.Параметры.V9 = Сред(VIN,9,1);
		ОбластьШапка.Параметры.V10 = Сред(VIN,10,1);
		ОбластьШапка.Параметры.V11 = Сред(VIN,11,1);
		ОбластьШапка.Параметры.V12 = Сред(VIN,12,1);
		ОбластьШапка.Параметры.V13 = Сред(VIN,13,1);
		ОбластьШапка.Параметры.V14 = Сред(VIN,14,1);
		ОбластьШапка.Параметры.V15 = Сред(VIN,15,1);
		ОбластьШапка.Параметры.V16 = Сред(VIN,16,1);
		ОбластьШапка.Параметры.V17 = Сред(VIN,17,1);
	КонецЕсли;
	ДанныеОрганизации = ПолучитьПредставлениеОрганизации(ДокОбъект.Автосалон.Организация);
	
	ОбластьШапка.Параметры.Организация = ДанныеОрганизации.ФактическийАдрес;
	ОбластьШапка.Параметры.Модель = ДокОбъект.Модель.Наименование;
	ОбластьШапка.Параметры.Заполнить(ПолучитьНоментТТН(ДокОбъект));
	ОбластьШапка.Параметры.ГосНомер = ДокОбъект.ГосНомер;
	//ОбластьШапка.Параметры.КодЦвета = ДокОбъект.Цвет.Артикул;
	ТабДокумент.Вывести(ОбластьШапка);
	Для Каждого СтрокаТЗ из ДокОбъект.ПоврежденияПоPVR Цикл
		ОбластьСтрокиПовреждения = Макет.ПолучитьОбласть("СтрокаДефекта");
		ОбластьСтрокиПовреждения.Параметры.КодДетали = СтрокаТЗ.Деталь.Артикул ;
		ОбластьСтрокиПовреждения.Параметры.НаименованиеДетали = СтрокаТЗ.Деталь.Наименование; 
		ОбластьСтрокиПовреждения.Параметры.КодХарактер = СтрокаТЗ.Характер.Артикул;
		ОбластьСтрокиПовреждения.Параметры.НаименованиеХарактер = СтрокаТЗ.Характер.Наименование;
		ОбластьСтрокиПовреждения.Параметры.КодСтепень = СтрокаТЗ.Степень.Артикул;
		ОбластьСтрокиПовреждения.Параметры.НаименованиеСтепень = СтрокаТЗ.Степень.Наименование;
		ОбластьСтрокиПовреждения.Параметры.КодРасположение = СтрокаТЗ.Расположение.Артикул;
		ОбластьСтрокиПовреждения.Параметры.НаименованиеРасположение = СтрокаТЗ.Расположение.Наименование;
		//ОбластьСтрокиПовреждения.Параметры.КодПричины = СтрокаТЗ.Причина.Артикул;
		//ОбластьСтрокиПовреждения.Параметры.НаименованиеПричины = СтрокаТЗ.Причина.Наименование;
		ТабДокумент.Вывести(ОбластьСтрокиПовреждения);
	КонецЦикла;
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Дата = Формат(ДокОбъект.ДатаPVR, "ДФ=dd.MM.yyyy");
	ОбластьПодвал.Параметры.перевозчик = ДокОбъект.ТранспортнаяКомпания.Наименование;
	ОбластьПодвал.Параметры.Организация = ДокОбъект.Автосалон.Организация.Наименование;
	ОбластьПодвал.Параметры.НомерГрузовика = ""+ ДокОбъект.НомерАвтовоза +" / "+ ДокОбъект.НомерПрицепа;
	ОбластьПодвал.Параметры.водитель = ДокОбъект.Водитель;
	ОбластьПодвал.Параметры.Автор = ДокОбъект.ФИОПримещика;
	
	ТабДокумент.Вывести(ОбластьПодвал);
	ОбластьСхемаАвто = Макет.ПолучитьОбласть("СхемаАвто");
	ТабДокумент.Вывести(ОбластьСхемаАвто);
	ОбластьТерминология = Макет.ПолучитьОбласть("Терминология");
	ТабДокумент.Вывести(ОбластьТерминология);
	
КонецПроцедуры

Процедура ПечатьПротоколОсмотра_Старая(ТабДокумент,ДокОбъект) Экспорт
	
	Макет = Документы.DMS_КартаКачестваПоставки.ПолучитьМакет("ПротоколОсмотра");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Номер = ДокОбъект.НомерPVR;
	ОбластьШапка.Параметры.VIn = ДокОбъект.VIN;
	ОбластьШапка.Параметры.Организация = ДокОбъект.Автосалон.Организация.Наименование;
	ОбластьШапка.Параметры.Модель = ДокОбъект.Модель.Наименование;
	ОбластьШапка.Параметры.НомерТТН = ПолучитьНоментТТН (ДокОбъект);
	ОбластьШапка.Параметры.КодЦвета = ДокОбъект.Цвет.Артикул;
	ТабДокумент.Вывести(ОбластьШапка);
	ОбластьЗамки = Макет.ПолучитьОбласть("ОбластьЗамки");
	ТабДокумент.Вывести(ОбластьЗамки);
	ОбластьШапкаПовреждения = Макет.ПолучитьОбласть("ШапкаПовреждения");
	ОбластьРаскройка = Макет.ПолучитьОбласть("ОбластьРаскройка");
	
	Для Каждого СтрокаТЗ из ДокОбъект.ПоврежденияПоPVR Цикл
		ОбластьСтрокиПовреждения = Макет.ПолучитьОбласть("СтрокиПовреждения");
		ОбластьСтрокиПовреждения.Параметры.КодДетали = СтрокаТЗ.Деталь.Артикул ;
		ОбластьСтрокиПовреждения.Параметры.НаименованиеДетали = СтрокаТЗ.Деталь.Наименование; 
		ОбластьСтрокиПовреждения.Параметры.КодХарактер = СтрокаТЗ.Характер.Артикул;
		ОбластьСтрокиПовреждения.Параметры.НаименованиеХарактер = СтрокаТЗ.Характер.Наименование;
		ОбластьСтрокиПовреждения.Параметры.КодСтепень = СтрокаТЗ.Степень.Артикул;
		ОбластьСтрокиПовреждения.Параметры.НаименованиеСтепень = СтрокаТЗ.Степень.Наименование;
		ОбластьСтрокиПовреждения.Параметры.КодРасположение = СтрокаТЗ.Расположение.Артикул;
		ОбластьСтрокиПовреждения.Параметры.НаименованиеРасположение = СтрокаТЗ.Расположение.Наименование;
		ОбластьСтрокиПовреждения.Параметры.КодПричины = СтрокаТЗ.Причина.Артикул;
		ОбластьСтрокиПовреждения.Параметры.НаименованиеПричины = СтрокаТЗ.Причина.Наименование;
		ОбластьШапкаПовреждения.Вывести(ОбластьСтрокиПовреждения);
	КонецЦикла;
	ТабДокумент.Вывести (ОбластьШапкаПовреждения);
	ТабДокумент.Присоединить(ОбластьРаскройка);
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.перевозчик = ДокОбъект.ТранспортнаяКомпания.Наименование;
	ОбластьПодвал.Параметры.Организация = ДокОбъект.Автосалон.Организация.Наименование;
	ОбластьПодвал.Параметры.НомерГрузовика = ""+ ДокОбъект.НомерАвтовоза +" / "+ ДокОбъект.НомерПрицепа;
	ОбластьПодвал.Параметры.водитель = ДокОбъект.Водитель;
	ОбластьПодвал.Параметры.Автор = ДокОбъект.ФИОПримещика;
	ОбластьПодвал.Параметры.Дата = Формат(ДокОбъект.ДатаPVR, "ДФ=dd.MM.yyyy");
	
	ТабДокумент.Вывести(ОбластьПодвал);
КонецПроцедуры

Функция ПечатьСертификатаКонтроля(ДокументСсылка) Экспорт
	
	Макет = ПолучитьМакет("ПФ_MXL_СертификатКонтроля");
	
	ТабДок = Новый ТабличныйДокумент;
	
	ОбластьШапка = Макет.ПолучитьОбласть("ШапкаСертификата");
	ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, ДокументСсылка, "Клиент, VIN");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	CRM_ЗаписьНаВыдачу.ДатаНачала
	|ИЗ
	|	Документ.CRM_ЗаписьНаВыдачу КАК CRM_ЗаписьНаВыдачу
	|ГДЕ
	|	CRM_ЗаписьНаВыдачу.VIN = &VIN
	|
	|УПОРЯДОЧИТЬ ПО
	|	CRM_ЗаписьНаВыдачу.Дата УБЫВ";
	Запрос.УстановитьПараметр("VIN", ДокументСсылка.VIN);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		ДатаНачалаВыдачи = РезультатЗапроса.ДатаНачала
	Иначе
		Сообщить("Не найдена запланированная выдача");
		Возврат Новый ТабличныйДокумент
	КонецЕсли;
	
	ОбластьШапка.Параметры.ДатаСертификата = ДатаНачалаВыдачи;
	//ОбластьШапка.Параметры.ДатаСледующегоТО = ДобавитьМесяц(ДатаНачалаВыдачи, 12);
	//ОбластьШапка.Параметры.ДатаКомплексСервиса = ДобавитьМесяц(ДатаНачалаВыдачи, 2);
	ОбластьШапка.Параметры.Модель = ДокументСсылка.Модель;
	ОбластьШапка.Параметры.Телефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(ДокументСсылка.Клиент);
	ОбластьШапка.Параметры.емаил = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(ДокументСсылка.Клиент);
	ТабДок.Вывести(ОбластьШапка);
	
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	
	ТабДок.Вывести(Макет.ПолучитьОбласть("ЛистКонтроля"));
	ТабДок.Вывести(Макет.ПолучитьОбласть("НижнийКолонтикул"));
	
	// Параметры макета
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСлева  = 5;
	ТабДок.ПолеСнизу  = 5;
	ТабДок.ПолеСправа = 5;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	
	Возврат ТабДок;
	
КонецФункции

Функция ПечатьЧекЛиста(ДокументСсылка) Экспорт
	ТабДок = Новый ТабличныйДокумент;
	
	//+++DMSREN-864
	//Макет = ПолучитьМакет("ЧекЛист");
	Макет = ПолучитьМакет("ЧекЛистНовый");
	//---
	VIN = СокрЛП(ДокументСсылка.VIN);   
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтраница2 = Макет.ПолучитьОбласть("Страница2");

	Для Индекс=1 По СтрДлина(VIN) Цикл
		ОбластьШапка.Параметры["V"+Строка(Индекс)] = Сред(VIN,Индекс,1);
		ОбластьСтраница2.Параметры["V"+Строка(Индекс)] = Сред(VIN,Индекс,1);
	КонецЦикла;          
	
	// Беседин 07.02.22 заявка 1412
	ОбластьШапка.Параметры.МаркаМодель = СокрЛП(ДокументСсылка.Модель.Производитель) + " " + СокрЛП(ДокументСсылка.Модель);  
	ОбластьСтраница2.Параметры.МаркаМодель = СокрЛП(ДокументСсылка.Модель.Производитель) + " " + СокрЛП(ДокументСсылка.Модель);

	// ВЫВОД
	ТабДок.Вывести(ОбластьШапка);
	ТабДок.Вывести(Макет.ПолучитьОбласть("Страница1"));
	//DMSREN-864+++
	//ТабДок.Вывести(ОбластьШапка);
	//---
	ТабДок.Вывести(ОбластьСтраница2);
	ТабДок.Вывести(Макет.ПолучитьОбласть("ЭтапыВКартинках"));
	
	// Параметры макета
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСлева  = 5;
	ТабДок.ПолеСнизу  = 5;
	ТабДок.ПолеСправа = 5;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;	
	
	Возврат ТабДок;
КонецФункции

Функция ПечатьЧекЛистДолгосрочногоХраненияЭД(ДокументСсылка) Экспорт
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("ЧекЛистХраненияНА_ЭД");

	// ВЫВОД
	ТабДок.Вывести(Макет);
	
	// Параметры макета
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСлева  = 5;
	ТабДок.ПолеСнизу  = 5;
	ТабДок.ПолеСправа = 5;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;	
	
	Возврат ТабДок;
КонецФункции

Функция ПечатьЧекЛистаFlashAves(ДокументСсылка) Экспорт
	
	КолвоКонтролейНаСтранице = 6;
	
	Макет = ПолучитьМакет("ЧекЛистFlashAves");
	
	ТабДок = Новый ТабличныйДокумент;
	
	ТабДок.Вывести(Макет.ПолучитьОбласть("ЧекЛист"));
	
	Если ДокументСсылка.ПроведениеFlashAves.Количество()=0 Тогда
		ОблШапка = Макет.ПолучитьОбласть("КонтрольШапка|Блок1");	
		ОблШапка.Параметры["VIN"] = СокрЛП(ДокументСсылка.VIN);
		
		ТабДок.Вывести(ОблШапка);
		ТабДок.Присоединить(Макет.ПолучитьОбласть("КонтрольШапка|Отступ"));
		ТабДок.Присоединить(Макет.ПолучитьОбласть("КонтрольШапка|Блок2"));
		
		Для Сч=1 По 6 Цикл
			ОблТекКонтроль = Макет.ПолучитьОбласть("КонтрольДанные|Блок1");
			ОблТекКонтроль.Параметры["Контроль"] = "Контроль " + Строка(Сч) + " = Дилерский центр";
			
			Если Цел(Сч/2)<>Сч/2 Тогда // первый контроль в строке
				ТабДок.Вывести(ОблТекКонтроль);
			Иначе // второй контроль в строке	
				ТабДок.Присоединить(Макет.ПолучитьОбласть("КонтрольДанные|Отступ"));	
				ТабДок.Присоединить(ОблТекКонтроль);
			КонецЕсли;			
		КонецЦикла;
	Иначе	
		Сч=0; СчИтог=0;
		Для каждого стр Из ДокументСсылка.ПроведениеFlashAves Цикл
			СчИтог = СчИтог + 1;
			
			Если Сч=0 Тогда // Вывод шапки контроля для новой страницы
				ОблШапка = Макет.ПолучитьОбласть("КонтрольШапка|Блок1");	
				ОблШапка.Параметры["VIN"] = СокрЛП(ДокументСсылка.VIN);
				
				ТабДок.Вывести(ОблШапка);
				ТабДок.Присоединить(Макет.ПолучитьОбласть("КонтрольШапка|Отступ"));
				ТабДок.Присоединить(Макет.ПолучитьОбласть("КонтрольШапка|Блок2"));
			КонецЕсли;
			
			ОблТекКонтроль = Макет.ПолучитьОбласть("КонтрольДанные|Блок1");
			ОблТекКонтроль.Параметры["Контроль"] = "Контроль " + Строка(СчИтог) + " = "+?(Не ПустаяСтрока(Стр.ВидКонтроля),Стр.ВидКонтроля,"Дилерский центр");
			ОблТекКонтроль.Параметры["Дата"]=стр.Дата;
			Если ТипЗнч(стр.Сотрудник)=Тип("СправочникСсылка.Сотрудники") Тогда
				ОблТекКонтроль.Параметры["Сотрудник"]=Строка(стр.Сотрудник)+Символы.ПС+стр.Сотрудник.Должность;
			Иначе	
				ОблТекКонтроль.Параметры["Сотрудник"]=стр.Сотрудник;
			КонецЕсли;
			ОблТекКонтроль.Параметры["Результат"]=стр.Состояние;
			ОблТекКонтроль.Параметры["Комментарий"]=стр.Комментарий;
			ОблТекКонтроль.Параметры["ОТС"]=стр.НаличиеОТС;
			ОблТекКонтроль.Параметры["ОписаниеОТС"]=стр.ОписаниеОТС;
			
			Сч=Сч+1;
			
			Если Цел(Сч/2)<>Сч/2 Тогда // первый контроль в строке
				ТабДок.Вывести(ОблТекКонтроль);
			Иначе // второй контроль в строке	
				ТабДок.Присоединить(Макет.ПолучитьОбласть("КонтрольДанные|Отступ"));	
				ТабДок.Присоединить(ОблТекКонтроль);
			КонецЕсли;
			
			Если Цел(Сч/КолвоКонтролейНаСтранице)=1 Тогда 
				Сч = 0; 
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла;
		
		Если Цел(СчИтог/КолвоКонтролейНаСтранице)<>СчИтог/КолвоКонтролейНаСтранице Тогда
			КолвоКонтролейИтого = (Цел(СчИтог/КолвоКонтролейНаСтранице)+1)*КолвоКонтролейНаСтранице;
			Пока СчИтог<>КолвоКонтролейИтого Цикл
				СчИтог = СчИтог + 1;
				
				Если Сч=0 Тогда // Вывод шапки контроля для новой страницы
					ОблШапка = Макет.ПолучитьОбласть("КонтрольШапка|Блок1");	
					ОблШапка.Параметры["VIN"] = СокрЛП(ДокументСсылка.VIN);
					
					ТабДок.Вывести(ОблШапка);
					ТабДок.Присоединить(Макет.ПолучитьОбласть("КонтрольШапка|Отступ"));
					ТабДок.Присоединить(Макет.ПолучитьОбласть("КонтрольШапка|Блок2"));
				КонецЕсли;
				
				ОблТекКонтроль = Макет.ПолучитьОбласть("КонтрольДанные|Блок1");
				ОблТекКонтроль.Параметры["Контроль"] = "Контроль " + Строка(СчИтог) + " = Дилерский центр";

			    Сч = Сч+1;
				Если Цел(Сч/2)<>Сч/2 Тогда // первый контроль в строке
					ТабДок.Вывести(ОблТекКонтроль);
				Иначе // второй контроль в строке	
					ТабДок.Присоединить(Макет.ПолучитьОбласть("КонтрольДанные|Отступ"));	
					ТабДок.Присоединить(ОблТекКонтроль);
				КонецЕсли;
				
				Если Цел(Сч/КолвоКонтролейНаСтранице)=1 Тогда 
					Сч = 0; 
					ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// Параметры макета
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСлева  = 5;
	ТабДок.ПолеСнизу  = 5;
	ТабДок.ПолеСправа = 5;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб = Истина;	
	
	Возврат ТабДок;
КонецФункции

Функция ПечатьЧекЛистДолгосрочногоХранения(ДокументСсылка) Экспорт
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("ЧекЛистХраненияНА");
	
	// Дата производства А/М
	Запись = РегистрыСведений.CRM_СостояниеАвтомобилейПроизводителя_v2.СоздатьМенеджерЗаписи();
	Запись.VIN = ДокументСсылка.VIN;
	Запись.Прочитать();
	MADC = ?(Запись.Выбран(),Формат(Запись.DATE_MADC, "ДФ=dd.MM.yyyy"),"");

	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ОблШапка.Параметры.VIN = ДокументСсылка.VIN;
	ОблШапка.Параметры.MADC = MADC;
	ТабДок.Вывести(ОблШапка);
	
	ДатыОбслуживание = Новый Соответствие;
	//Если ДокументСсылка.ЧекЛистХранения.Количество()=0 Тогда
	//	ВидыОпераций = Перечисления.Renault_ВидыОперацийДолгосрочногоХранения.ПолучитьВидыОпераций(,ДокументСсылка.VIN);
	//	Для каждого ВидОперации Из ВидыОпераций Цикл
	//		
	//		Подробности = Перечисления.Renault_ВидыОперацийДолгосрочногоХранения.Подробности(ВидОперации);
	//		Для каждого стр Из Подробности Цикл
	//			ОблДанные = Макет.ПолучитьОбласть("ДанныеОперации");
	//			ОблДанные.Параметры.Операция = ВидОперации;
	//			ОблДанные.Параметры.Подробности = стр;
	//			
	//			МесяцыПроверок = Перечисления.Renault_ВидыОперацийДолгосрочногоХранения.МесяцыПроверок(ВидОперации,стр);
	//			Для каждого Эл Из МесяцыПроверок Цикл
	//				Обл = ОблДанные.Области.Найти("мес"+Эл);
	//				Обл.ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,3);
	//				Обл.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,3);
	//				Обл.ГраницаСлева = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,3);
	//				Обл.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,3);
	//				Обл.ЦветРамки = Новый Цвет(79, 129, 189);
	//			КонецЦикла;
	//			
	//			ТабДок.Вывести(ОблДанные);
	//		КонецЦикла;
	//		
	//	КонецЦикла;
	//Иначе
		ВидыОпераций = ДокументСсылка.ЧекЛистХранения.Выгрузить();
		ВидыОпераций.Свернуть("Операция,Подробности");
		ОблДанные = Макет.ПолучитьОбласть("ДанныеОперации");
		
		Для каждого стр Из ВидыОпераций Цикл
			
			Строки = ДокументСсылка.ЧекЛистХранения.НайтиСтроки(Новый Структура("Операция,Подробности",стр.Операция,стр.Подробности));
			Для каждого СтрокаТЧ Из Строки Цикл
				
				Попытка //Для печати данных по старому стандарту
					Если ЗначениеЗаполнено(СтрокаТЧ.ДатаФакт) Тогда
						Если ДатыОбслуживание.Получить(СтрокаТЧ.Месяц)=Неопределено Тогда // Если было пусто
							ДатыОбслуживание.Вставить(СтрокаТЧ.Месяц, Формат(СтрокаТЧ.ДатаФакт, "ДФ=dd.MM.yyyy"));
							
						ИначеЕсли СтрНайти(ДатыОбслуживание.Получить(СтрокаТЧ.Месяц), Формат(СтрокаТЧ.ДатаФакт, "ДФ=dd.MM.yyyy")) = 0 Тогда 	
							ДатыОбслуживание.Вставить(СтрокаТЧ.Месяц, ДатыОбслуживание.Получить(СтрокаТЧ.Месяц) + ", " + Формат(СтрокаТЧ.ДатаФакт, "ДФ=dd.MM.yyyy"));
						КонецЕсли;
						
						ИмяОперации = XMLстрока(Стр.Операция);
						ОблДанные.Области[ИмяОперации + СтрокаТЧ.Месяц].Картинка =  БиблиотекаКартинок.Renault_Confirm_Square;
						
						Если ЗначениеЗаполнено(СтрокаТЧ.Ответственный) Тогда
							Если ЗначениеЗаполнено(ОблДанные.Параметры["Ответственный" + СтрокаТЧ.Месяц]) 
								И СтрНайти(ОблДанные.Параметры["Ответственный" + СтрокаТЧ.Месяц], СтрокаТЧ.Ответственный.Наименование) = 0 Тогда
								ОблДанные.Параметры["Ответственный" + СтрокаТЧ.Месяц] = ОблДанные.Параметры["Ответственный" + СтрокаТЧ.Месяц] + ", " + СтрокаТЧ.Ответственный.Наименование;
							Иначе
								ОблДанные.Параметры["Ответственный" + СтрокаТЧ.Месяц] = СтрокаТЧ.Ответственный.Наименование;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				Исключение
				КонецПопытки;
				
			КонецЦикла;
			
		КонецЦикла;
	//КонецЕсли;
	
	//Мс = Новый Массив; Мс.Добавить(3); Мс.Добавить(6); Мс.Добавить(9); 
	//Мс.Добавить(12);
	
	МесяцыВыполнено = Новый Структура("Мес3,Мес6,Мес9,Мес12");
	//МесяцыВыполнено = Новый Структура("Мес3,Мес6,Мес9");
	//Для каждого СтрокаТЧ Из ДокументСсылка.ЧекЛистХранения Цикл
	//	Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ДатаФакт) Тогда
	//		Если МесяцыВыполнено.Свойство("Мес"+СтрокаТЧ.Месяц) Тогда МесяцыВыполнено.Удалить("Мес"+СтрокаТЧ.Месяц); КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	
	Для каждого КлючЗначение Из ДатыОбслуживание Цикл
		Если МесяцыВыполнено.Свойство("Мес" + КлючЗначение.Ключ) Тогда
			ОблДанные.Параметры["Дата" + КлючЗначение.Ключ] = 
			//Формат(
			КлючЗначение.Значение
			//, "ДФ=dd.MM.yyyy")
			;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Стр Из ДокументСсылка.ЧекЛистВыдача Цикл
		Если ЗначениеЗаполнено(Стр.ДатаФакт) Тогда
			Если Стр.Операция = Перечисления.Renault_ВидыОперацийДолгосрочногоХранения.ДавлениеВШинах Тогда
				ОблДанные.Области["ДавлениеВШинахВыдача"].Картинка =  БиблиотекаКартинок.Renault_Confirm_Square;
				Продолжить;
			ИначеЕсли Стр.Операция = Перечисления.Renault_ВидыОперацийДолгосрочногоХранения.АккумуляторнаяБатарея
			 И Стр.Подробности = "Зарядить 30 мин ATEQ. Если на а/м сообщение о необходимости заряда АКБ, заряжать ATEQ до полной зарядки (зеленый индикатор горит постоянно, не мигает)" Тогда
				ОблДанные.Области["АккумуляторнаяБатареяВыдача"].Картинка =  БиблиотекаКартинок.Renault_Confirm_Square;
				Продолжить;
			ИначеЕсли Стр.Операция = Перечисления.Renault_ВидыОперацийДолгосрочногоХранения.АккумуляторнаяБатарея
			 И Стр.Подробности = "Замена, если выдаваемый автомобиль > 12 мес от MADC" Тогда
			 	ОблДанные.Области["АккумуляторнаяБатареяЗамена"].Картинка =  БиблиотекаКартинок.Renault_Confirm_Square;
				Продолжить;
			ИначеЕсли Стр.Операция = Перечисления.Renault_ВидыОперацийДолгосрочногоХранения.СистемаВентиляции Тогда
				ОблДанные.Области["СистемаВентиляцииВыдача"].Картинка =  БиблиотекаКартинок.Renault_Confirm_Square;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	
	ТабДок.Вывести(ОблДанные);
	
	// Параметры макета
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСлева  = 5;
	ТабДок.ПолеСнизу  = 5;
	ТабДок.ПолеСправа = 5;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Возврат ТабДок;
КонецФункции

Функция ПолучитьНоментТТН(ДокОбъект) 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеАвтомобилейАвтомобили.Ссылка КАК ТТНСсылка,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.NUM_TTN КАК ВхДокНомер,
	|	ПоступлениеАвтомобилейАвтомобили.Ссылка.ВхДокДата
	|ИЗ
	|	Документ.DMS_КартаКачестваПоставки КАК ДокументDMS_КартаКачестваПоставки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
	|		ПО ДокументDMS_КартаКачестваПоставки.VIN = ПоступлениеАвтомобилейАвтомобили.VIN
	|			И (ПоступлениеАвтомобилейАвтомобили.Ссылка.ПометкаУдаления = ЛОЖЬ)
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
	|		ПО ДокументDMS_КартаКачестваПоставки.VIN = CRM_СостояниеАвтомобилейПроизводителя_v2.VIN
	|ГДЕ
	|	ДокументDMS_КартаКачестваПоставки.СостАвтоСоотвТребКачестваПримеки = ЛОЖЬ
	|	И ДокументDMS_КартаКачестваПоставки.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДокОбъект);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Новый Структура("НомерТТН,ДатаТТН",Выборка.ВхДокНомер,Формат(Выборка.ВхДокДата, "ДФ=dd.MM.yyyy"));
	
КонецФункции

Функция ВывестиГоризонтальнуюОбласть(ТабДокумент, Область, ОбластьШапка = Неопределено, ОбластьПодвал = Неопределено, НомерСтраницы = 1,
	СтруктураИтоговПоСтранице = Неопределено, Права = Неопределено, мсвДопОбластиПодвала = Неопределено) 
	
	Попытка
		ПраваПользователя=Права.Права;
		ЭтотОбъект=Права;
	Исключение
		ПраваПользователя=Права;
		ЭтотОбъект=Неопределено;
	КонецПопытки; 
	
	ИспользоватьРазбиениеНаСтраницы = Истина;
	
	//если не разбиваем, выводим и все
	Если Не ИспользоватьРазбиениеНаСтраницы Тогда
		ТабДокумент.Вывести(Область);
		Возврат НомерСтраницы;
	КонецЕсли;
	
	//запишем их в один массив
	МассивОбластейДляПроверки = Новый Массив;
	МассивОбластейДляПроверки.Добавить(Область);
	Если ОбластьПодвал <> Неопределено Тогда
		МассивОбластейДляПроверки.Добавить(ОбластьПодвал);
	КонецЕсли;
	Если мсвДопОбластиПодвала <> Неопределено Тогда
		Для Каждого ТекОбласть Из мсвДопОбластиПодвала Цикл
			МассивОбластейДляПроверки.Добавить(ТекОбласть);
		КонецЦикла;
	КонецЕсли;
	
	Попытка
		//проверим, помещаются ли на странице
		РезультатПроверки = ТабДокумент.ПроверитьВывод(МассивОбластейДляПроверки);
		
		//если не помещаются, то ...
		Если НЕ РезультатПроверки Тогда
			ВывестиИтогиПоСтранице(ТабДокумент,ОбластьПодвал,СтруктураИтоговПоСтранице,Права); //выводим итог по странице
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц(); //переходим на следующую страницу
			НомерСтраницы = НомерСтраницы + 1;
			Если ОбластьШапка <> Неопределено Тогда
				ТабДокумент.Вывести(ОбластьШапка); //выводим шапку таблицы
			КонецЕсли;
		КонецЕсли;
	Исключение 		
	КонецПопытки;
	
	//выводим текущую область
	ТабДокумент.Вывести(Область);
	
	Возврат НомерСтраницы;
КонецФункции

Процедура ВывестиИтогиПоСтранице(ТабДокумент,ОбластьПодвал,СтруктураИтоговПоСтранице,Права) Экспорт
	Если ОбластьПодвал <> Неопределено Тогда
		Если СтруктураИтоговПоСтранице <> Неопределено Тогда
			Попытка
				ПраваПользователя=Права.Права;
				ЭтотОбъект=Права;
			Исключение
				ПраваПользователя=Права;
				ЭтотОбъект=Неопределено;
			КонецПопытки; 
			ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества",ПраваПользователя,,ЭтотОбъект);
			ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",ПраваПользователя,,ЭтотОбъект);
			Для Каждого ЭлементИтога Из СтруктураИтоговПоСтранице Цикл
				Если Найти(ЭлементИтога.Ключ,"Кол") <> 0 Тогда
					ЗначениеПараметра = Формат(ЭлементИтога.Значение,ФорматВыводаКоличества);
				Иначе
					ЗначениеПараметра = Формат(ЭлементИтога.Значение,ФорматВыводаСуммы);
				КонецЕсли; 
				Попытка
					ОбластьПодвал.Параметры[ЭлементИтога.Ключ] = ЗначениеПараметра;
				Исключение
				КонецПопытки; 
			КонецЦикла;
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьПодвал);
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьПредставлениеОрганизации (Организация)
	
	ПредставлениеОрганизации = Новый Структура ("Наименование,ИНН,КПП,АдресЮридический,ТелефонРабочий,ОКПО");
	ПредставлениеОрганизации.Вставить("Наименование", Организация.НаименованиеПолное);
	ПредставлениеОрганизации.Вставить("ИНН", Организация.ИНН);
	ПредставлениеОрганизации.Вставить("КПП", Организация.КПП);
	ПредставлениеОрганизации.Вставить("АдресЮридический", киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресЮридический));
	ПредставлениеОрганизации.Вставить("ФактическийАдрес", киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресФактический));
	Возврат ПредставлениеОрганизации;
	
КонецФункции

Функция ВывестиПрописьюЦелуюЧасть(Сумма)
	
	Возврат ЧислоПрописью(Цел(Сумма),"Л = ru_RU; НП = Ложь", ",,,,,,,,0")
	
КонецФункции

Функция ВывестиКопейки(Сумма)
	
	БезКопеек = Цел( Сумма);
	Копейки   = Цел((Сумма - БезКопеек)*100);
	
	Возврат ?(Копейки = 0, "00", Строка(Копейки));
	
КонецФункции
