&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//DMS_ОбщиеФункцииСервер.МультибрендОсновноеОформление(ЭтаФорма); //мультибренд //DMSREN-241
	Если Параметры.Свойство("Заголовок") Тогда Заголовок=Параметры.Заголовок КонецЕсли;
	
	html=Обработки.DMS_Диалог.ПолучитьМакет("ДиалогВыбораЦвета").ПолучитьТекст();
	ТекущийЦвет=Параметры.ТекущийЦвет;
	Если ТипЗнч(Параметры.ТекущийЦвет)=Тип("Цвет") Тогда
        Красный=ТекущийЦвет.Красный;
        Зеленый=ТекущийЦвет.Зеленый;
        Синий=ТекущийЦвет.Синий;
		html=СтрЗаменить(html, "name='color' value='#000000'", "name='color' value='" + ЦветВHex(Красный,Зеленый,Синий) + "'");
        html=СтрЗаменить(html, "name='colorR' value='0'", "name='colorR' value='" + Строка(Красный) + "'");
        html=СтрЗаменить(html, "name='colorG' value='0'", "name='colorG' value='" + Строка(Зеленый) + "'");
        html=СтрЗаменить(html, "name='colorB' value='0'", "name='colorB' value='" + Строка(Синий) + "'");
    КонецЕсли;
    ДиалогВыбораЦвета=html;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЦвет()
	Если Элементы.ДиалогВыбораЦвета.Документ = Неопределено Тогда Возврат Неопределено КонецЕсли;
	colorR=Элементы.ДиалогВыбораЦвета.Документ.getElementById("colorR");
	colorG=Элементы.ДиалогВыбораЦвета.Документ.getElementById("colorG");
	colorB=Элементы.ДиалогВыбораЦвета.Документ.getElementById("colorB");
	Возврат Новый Цвет(?(colorR=Неопределено,0,colorR.Value), ?(colorG=Неопределено,0,colorG.Value), ?(colorB=Неопределено,0,colorB.Value));
КонецФункции

&НаКлиенте
Процедура ВыборЦвета(Команда) 
	Если Команда.Имя="ОК" Тогда ТекущийЦвет=ПолучитьЦвет()
	ИначеЕсли Команда.Имя="Авто" Тогда ТекущийЦвет=Новый Цвет()
	ИначеЕсли Команда.Имя="Отмена" Тогда 
	КонецЕсли;
	Закрыть(ТекущийЦвет)
КонецПроцедуры

Функция ЦветВHex(Красный, Зеленый, Синий) Экспорт
	_12 = DecToHex(Красный);
	_34 = DecToHex(Зеленый);
	_56 = DecToHex(Синий);
	Возврат "#"+_12+_34+_56
КонецФункции
Функция DecToHex(знач Значение)
	Нотация=16;
	Значение = Число(Значение);
	Если Значение <= 0 Тогда Возврат "0" КонецЕсли;
	Значение = Цел(Значение);
	Результат = "";
	Пока Значение > 0 Цикл
		Результат	= Сред("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ", Значение % Нотация + 1, 1) + Результат;
		Значение	= Цел(Значение/Нотация);
	КонецЦикла;
	Возврат Результат
КонецФункции
