
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Заказ") Тогда
		ЗаказПоставщику = Параметры.Заказ;
		ЗаполнитьТаблицуРеферансов (Параметры.Заказ);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуРеферансов (Заказ)
	ТаблицаРеферансов.Очистить();
	Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПоставщикуТовары.Номенклатура КАК Реферанс,
		|	ЗаказПоставщикуТовары.Количество КАК КолСтарое,
		|	Renault_ИсторияИзмененияЗаказПоставщику.Количество КАК КоличествоНовое,
		|	Renault_ИсторияИзмененияЗаказПоставщику.Состояние КАК Состояние,
		|	Renault_ИсторияИзмененияЗаказПоставщику.Коментарий КАК КомментарийСтарый
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ИсторияИзмененияЗаказПоставщику КАК Renault_ИсторияИзмененияЗаказПоставщику
		|		ПО ЗаказПоставщикуТовары.Ссылка = Renault_ИсторияИзмененияЗаказПоставщику.ЗаказПоставщику
		|			И ЗаказПоставщикуТовары.Номенклатура = Renault_ИсторияИзмененияЗаказПоставщику.Реферанс
		|ГДЕ
		|	ЗаказПоставщикуТовары.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Заказ);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() цикл
			СтрокаТЧ = ТаблицаРеферансов.Добавить();
			Если Выборка.КоличествоНовое <> Null Тогда
				Если ЗначениеЗаполнено(Выборка.Состояние) Тогда
					СтрокаТЧ.Статус = Выборка.Состояние;
				Иначе 
					СтрокаТЧ.Статус = "Отправлено";
				КонецЕсли;
				СтрокаТЧ.Отправлено = Истина;
				СтрокаТЧ.КолНовое = Выборка.КоличествоНовое;
			Иначе
				СтрокаТЧ.КолНовое = Выборка.КолСтарое;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
		КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеферансовКолНовоеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	ТекущаяСтрока = Элементы.ТаблицаРеферансов.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		Если ТекущаяСтрока.КолСтарое < Число(Текст) Тогда
			Предупреждение("Количество может быть только уменьшено");
			СтандартнаяОбработка = Ложь;
		Иначе
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	ОбработатьОтправкуНаСервере ();
	Модифицированность = Ложь;
КонецПроцедуры

&НаСервере
Процедура ОбработатьОтправкуНаСервере ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Реферанс,
	|	Таблица.КолСтарое,
	|	Таблица.КолНовое,
	|	Таблица.КомментарийСтарый,
	|	Таблица.КомментарийНовый,
	|	Таблица.Статус,
	|	&Заявка,
	|	Таблица.Отправлено
	|ПОМЕСТИТЬ ВР_Таблица
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВР_Таблица.Реферанс.Артикул как Артикул,
	|	ВР_Таблица.КолСтарое,
	|	ВР_Таблица.КолНовое,
	|	ВР_Таблица.КомментарийСтарый,
	|	ВР_Таблица.КомментарийНовый,
	|	ВР_Таблица.Статус,
	|	ВР_Таблица.Заявка как ссылка,
	|	ВР_Таблица.Заявка.Номер как НомерДокумента,
	|	CRM_ДилерскиеЦентрыПодразделенияОрганизации.Ссылка.BIR как BIR,
	|	CRM_ДилерскиеЦентрыПодразделенияОрганизации.Ссылка как ДилерскийЦентр,
	|	ВР_Таблица.Заявка.Дата как ДатаДокумента
	|ИЗ
	|	ВР_Таблица КАК ВР_Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_ДилерскиеЦентры.ПодразделенияОрганизации КАК CRM_ДилерскиеЦентрыПодразделенияОрганизации
	|		ПО ВР_Таблица.Заявка.ПодразделениеКомпании = CRM_ДилерскиеЦентрыПодразделенияОрганизации.Подразделение
	|ГДЕ
	|	ВР_Таблица.КолСтарое <> ВР_Таблица.КолНовое
	|	И НЕ ВР_Таблица.Отправлено";
	ТЗРеферансов = РеквизитФормыВЗначение("ТаблицаРеферансов",Тип("ТаблицаЗначений"));
	Запрос.УстановитьПараметр("Таблица", ТЗРеферансов);
	Запрос.УстановитьПараметр("ЗАявка", ЗаказПоставщику.Ссылка);
	
	ТЗРезультат = Запрос.Выполнить().Выгрузить();
	ТЗРезультат.Колонки.Добавить("Заявка");
	ТЗРезультат.Колонки.Добавить("ГУИДДилера");
	Для Каждого СтрокаТЗ из ТЗРезультат Цикл 
		СтрокаТЗ.Заявка = СтрокаТЗ.Ссылка.УникальныйИдентификатор();
		СтрокаТЗ.ГУИДДилера = СтрокаТЗ.ДилерскийЦентр.УникальныйИдентификатор();
		Если СтрокаТЗ.КомментарийНовый <> "" Тогда
			СтрокаТЗ.КомментарийСтарый = ?(СтрокаТЗ.КомментарийСтарый = "", "",СтрокаТЗ.КомментарийСтарый + Символы.ПС)+Формат(ТекущаяДата(),"ДЛФ=D")+": "+ СтрокаТЗ.КомментарийНовый;
		КонецЕсли;
	КонецЦикла;
	ТЗРезультат.Колонки.Удалить("Ссылка");
	ТЗРезультат.Колонки.Удалить("ДилерскийЦентр");
	Сервер = СтрокаСоединенияИнформационнойБазы();
	Если ТЗРезультат.Количество() > 0 Тогда
		ВебСервис = ПолучитьВебСервис();
		Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
		ТаблицаXDTO = Сериализатор.ЗаписатьXDTO(ТЗРезультат);
		Ответ = ВебСервис.PutRequest(ТаблицаXDTO, Сервер);
		Если Ответ Тогда
			Для Каждого СтрокаТЗ из ТЗРезультат Цикл 
				Менеджер = РегистрыСведений.Renault_ИсторияИзмененияЗаказПоставщику.СоздатьМенеджерЗаписи();
				Менеджер.Реферанс = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", СтрокаТЗ.Артикул);
				Менеджер.ЗаказПоставщику = ЗаказПоставщику.Ссылка;
				Менеджер.Прочитать();
				Менеджер.Реферанс = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", СтрокаТЗ.Артикул);
				Менеджер.ЗаказПоставщику = ЗаказПоставщику.Ссылка;
				Менеджер.Количество = СтрокаТЗ.КолНовое;
				Менеджер.Коментарий = СтрокаТЗ.КомментарийСтарый;
				Менеджер.Состояние = Неопределено;
				Менеджер.Записать();
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	ЗаполнитьТаблицуРеферансов (ЗаказПоставщику.Ссылка);
КонецПроцедуры

&НаСервере
Функция ПолучитьВебСервис() 
	
	ДанныеПодключения = Справочники.Renault_ПараметрыПодключенияКСервисам.ПолучитьПараметрыПодключенияПоСсылке(
		Справочники.Renault_ПараметрыПодключенияКСервисам.WSGate,
		"Referans.1cws");
	Адрес = ДанныеПодключения.Адрес;
	ЛогинWS = ДанныеПодключения.Логин;
	ПарольWS = ДанныеПодключения.Пароль;
	WSОпределение = Renault_ОбщегоНазначенияПовтИсп.ОпределениеTDFa(Адрес, ЛогинWS, ПарольWS);
	ВебСервис = Новый WSПрокси(
		WSОпределение, 
		"http://v8.1c.ru/8.1/data/core", 
		"Renault_Referans", 
		"Renault_ReferansSoap12",
		3600);
	ВебСервис.Пользователь = СокрЛП(ЛогинWS);
	ВебСервис.Пароль = СокрЛП(ПарольWS);
	Возврат ВебСервис;
	
КонецФункции

&НаКлиенте
Процедура ТаблицаРеферансовКолНовоеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеферансовПередНачаломИзменения(Элемент, Отказ)
	Если Элемент.ТекущийЭлемент.Имя = "ТаблицаРеферансовКолНовое" или 
			Элемент.ТекущийЭлемент.Имя = "ТаблицаРеферансовКомментарийНовый" Тогда 
		ТекущаяСтрока = Элемент.ТекущиеДанные;
		Если ТекущаяСтрока.Отправлено Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если Модифицированность Тогда
		Ответ = Вопрос("Изменения сохранены не будут. Продолжить закрытие?", РежимДиалогаВопрос.ДаНет);
		Если Ответ <> КодВозвратаДиалога.да Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПовторныйЗапрос(Команда)
	ПовторныйЗапросНаСервере ();
КонецПроцедуры

Процедура ПовторныйЗапросНаСервере ()
	
	ТаблицаРеферансов.Очистить();
	Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПоставщикуТовары.Номенклатура КАК Реферанс,
		|	ЗаказПоставщикуТовары.Количество КАК КолСтарое,
		|	Renault_ИсторияИзмененияЗаказПоставщику.Количество КАК КоличествоНовое,
		|	Renault_ИсторияИзмененияЗаказПоставщику.Состояние КАК Состояние,
		|	Renault_ИсторияИзмененияЗаказПоставщику.Коментарий КАК КомментарийСтарый
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ИсторияИзмененияЗаказПоставщику КАК Renault_ИсторияИзмененияЗаказПоставщику
		|		ПО ЗаказПоставщикуТовары.Ссылка = Renault_ИсторияИзмененияЗаказПоставщику.ЗаказПоставщику
		|			И ЗаказПоставщикуТовары.Номенклатура = Renault_ИсторияИзмененияЗаказПоставщику.Реферанс
		|ГДЕ
		|	ЗаказПоставщикуТовары.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ЗаказПоставщику);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() цикл
			Если Выборка.КоличествоНовое <> Null Тогда
				Если Выборка.Состояние = Неопределено Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли; 
			СтрокаТЧ = ТаблицаРеферансов.Добавить();
			СтрокаТЧ.КолНовое = Выборка.КолСтарое;
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
		КонецЦикла;

КонецПроцедуры




