
&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Объект.Автор = ПараметрыСеанса.Пользователь;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//ЭтапыСогласования.	
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыСогласованияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
		
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтапыСогласования.Отбор.Регистратор.Значение = Объект.Ссылка;
	ЭтапыСогласования.Отбор.Регистратор.Использование = Истина; 
	
КонецПроцедуры
