Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//Проверки
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_БСО_ВозвратБланковСтрогойОтчетностиСписокБСО.НомерБСО КАК НомерБСО,
		|	Ссылка.Дата ДатаВозврата
		|ПОМЕСТИТЬ ДокТЧНомераБСО
		|ИЗ
		|	Документ.Renault_БСО_ВозвратБланковСтрогойОтчетности.СписокБСО КАК Renault_БСО_ВозвратБланковСтрогойОтчетностиСписокБСО
		|ГДЕ
		|	Renault_БСО_ВозвратБланковСтрогойОтчетностиСписокБСО.Ссылка = &Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерБСО,
		|	ДатаВозврата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Renault_БСО_СтатусыБСО.НомерБСО КАК НомерБСО,
		|	Renault_БСО_СтатусыБСО.Статус,
		|	Renault_БСО_СтатусыБСО.Период КАК Период,
		|	Renault_БСО_СтатусыБСО.Регистратор
		|ПОМЕСТИТЬ СтатусыНомеровБСОПериод
		|ИЗ
		|	РегистрСведений.Renault_БСО_СтатусыБСО КАК Renault_БСО_СтатусыБСО
		|ГДЕ
		|	Renault_БСО_СтатусыБСО.НаименованиеБСО = &НаименованиеБСО
		|	И Renault_БСО_СтатусыБСО.СерияБСО = &СерияБСО
		|	И Renault_БСО_СтатусыБСО.НомерБСО В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ДокТЧНомераБСО.НомерБСО
		|			ИЗ
		|				ДокТЧНомераБСО КАК ДокТЧНомераБСО)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерБСО,
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокТЧНомераБСО.НомерБСО КАК НомерБСО,
		|	МАКСИМУМ(СтатусыНомеровБСОПериод.Период) КАК Период
		|ПОМЕСТИТЬ НомерБСОМаксимальныйПериод
		|ИЗ
		|	ДокТЧНомераБСО КАК ДокТЧНомераБСО
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтатусыНомеровБСОПериод КАК СтатусыНомеровБСОПериод
		|		ПО ДокТЧНомераБСО.НомерБСО = СтатусыНомеровБСОПериод.НомерБСО
		|			И ДокТЧНомераБСО.ДатаВозврата >= СтатусыНомеровБСОПериод.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокТЧНомераБСО.НомерБСО
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерБСО,
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НомерБСОМаксимальныйПериод.НомерБСО,
		|	СтатусыНомеровБСОПериод.Статус,
		|	ПРЕДСТАВЛЕНИЕ(СтатусыНомеровБСОПериод.Регистратор)
		|ПОМЕСТИТЬ НомераБСОСтатусыРегистратор
		|ИЗ
		|	НомерБСОМаксимальныйПериод КАК НомерБСОМаксимальныйПериод
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтатусыНомеровБСОПериод КАК СтатусыНомеровБСОПериод
		|		ПО НомерБСОМаксимальныйПериод.Период = СтатусыНомеровБСОПериод.Период
		|			И НомерБСОМаксимальныйПериод.НомерБСО = СтатусыНомеровБСОПериод.НомерБСО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДокТЧНомераБСО.НомерБСО) КАК КоличествоРазличныхНомеровБСО
		|ИЗ
		|	ДокТЧНомераБСО КАК ДокТЧНомераБСО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НомераБСОСтатусыРегистратор.НомерБСО КАК НомерБСО,
		|	ПРЕДСТАВЛЕНИЕ(НомераБСОСтатусыРегистратор.Статус) КАК Статус,
		|	НомераБСОСтатусыРегистратор.РегистраторПредставление КАК Документ
		|ИЗ
		|	НомераБСОСтатусыРегистратор КАК НомераБСОСтатусыРегистратор
		|ГДЕ
		|	НомераБСОСтатусыРегистратор.Статус <> ЗНАЧЕНИЕ(Перечисление.Renault_БСО_СтатусыБланковСтрогойОтчетности.Продан)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НомераБСОСтатусыРегистратор.НомерБСО,
		|	ПРЕДСТАВЛЕНИЕ(НомераБСОСтатусыРегистратор.Статус),
		|	НомераБСОСтатусыРегистратор.РегистраторПредставление
		|ИЗ
		|	НомераБСОСтатусыРегистратор КАК НомераБСОСтатусыРегистратор
		|ГДЕ
		|	НомераБСОСтатусыРегистратор.Статус ЕСТЬ NULL ";	
	Запрос.УстановитьПараметр("НаименованиеБСО", БланкСтрогойОтчетности);
	Запрос.УстановитьПараметр("СерияБСО", Серия);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	Результат = Запрос.ВыполнитьПакет();
	
	//Проверка на наличие дублей номеров в документе
	Выборка = Результат[4].Выбрать();	
	Выборка.Следующий();
	
	КоличествоНомеровБСО = СписокБСО.Количество();
	
	Если Выборка.КоличествоРазличныхНомеровБСО <> КоличествоНомеровБСО Тогда
		Сообщить("В документе встречаются одинаковые номера БСО!");
		
		Отказ = Истина;		
	КонецЕсли;
	
	//Проверка на наличие дублей в базе
	Если НЕ Результат[5].Пустой() Тогда
		Выборка = Результат[5].Выбрать();		
		 
		Пока Выборка.Следующий() Цикл
			Статус = Выборка.Статус;
			Если Статус = NULL Тогда
				Сообщить("Номер - " + Выборка.НомерБСО + ", не зарегестрирован в базе ренее выбраной даты.");
			Иначе
				Сообщить("Номер - " + Выборка.НомерБСО + ", не имеет статус ""Продан"", а находится в статусе - " + Выборка.Статус + ". Последнее изменение статуса было вызвано документом  - " + Выборка.Документ + ".");
			КонецЕсли;
		КонецЦикла;
		
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 	
	
	//Проведение
	Движения.Renault_БСО_СтатусыБСО.Записывать = Истина;
	
	СтатусВозвращен = Перечисления.Renault_БСО_СтатусыБланковСтрогойОтчетности.Возвращен;
	
	Для Каждого Строка Из СписокБСО Цикл
		Движение = Движения.Renault_БСО_СтатусыБСО.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Подразделение = Подразделение;
		Движение.НаименованиеБСО = БланкСтрогойОтчетности;
		Движение.СерияБСО = Серия;
		Движение.НомерБСО = Строка.НомерБСО;
		Движение.Статус = СтатусВозвращен;
	КонецЦикла;

	Движения.Renault_БСО_УчетБланковСтрогойОтчетности.Записывать = Истина;
	
	Для Каждого Строка Из СписокБСО Цикл
		Движение = Движения.Renault_БСО_УчетБланковСтрогойОтчетности.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Подразделение = Подразделение;
		Движение.НаименованиеБСО = БланкСтрогойОтчетности;
		Движение.СерияБСО = Серия;
		Движение.НомерБСО = Строка.НомерБСО;
		Движение.Количество = 1;
	КонецЦикла;
КонецПроцедуры
