
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОТЧЕТА

// Процедура - обработчик события отчета "ПриКомпоновкеРезультата"
//
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка	= Ложь;
	ДокументРезультат.Очистить();
	// Получаем длину внутренних номеров
	ДлинаВнутреннихНомеров	= Константы.CRM_МаксимальнаяДлинаВнутреннегоНомера.Получить();
	// Получаем таблицу соответствия номеров абонентам
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",		ЭтотОбъект.ПериодОтчета.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",	ЭтотОбъект.ПериодОтчета.ДатаОкончания);
	ТаблицаСоответствия = Новый ТаблицаЗначений;
	ТаблицаСоответствия.Колонки.Добавить("Номер");
	ТаблицаСоответствия.Колонки.Добавить("Абонент");
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВложенныйЗапрос.НомерТелефона
	               |ИЗ
	               |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |		dbo_Calls.CallerId КАК НомерТелефона
	               |	ИЗ
	               |		ВнешнийИсточникДанных.сфпВнешнийИсточникДанныхИсторииЗвонков.Таблица.dbo_Calls КАК dbo_Calls
	               |	ГДЕ
	               |		dbo_Calls.StartTime МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |		И НЕ dbo_Calls.DropTime ЕСТЬ NULL 
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |		dbo_Calls.CalledId
	               |	ИЗ
	               |		ВнешнийИсточникДанных.сфпВнешнийИсточникДанныхИсторииЗвонков.Таблица.dbo_Calls КАК dbo_Calls
	               |	ГДЕ
	               |		dbo_Calls.StartTime МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |		И НЕ dbo_Calls.DropTime ЕСТЬ NULL ) КАК ВложенныйЗапрос";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОчищенныйНомерТелефона = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(Выборка.НомерТелефона);
		Если НЕ ПустаяСтрока(ОчищенныйНомерТелефона) Тогда
			МассивАбонентов = сфпСофтФонПроСервер.сфпНайтиОбъектВРегистреПоТелефону(ОчищенныйНомерТелефона);
			НоваяСтрока = ТаблицаСоответствия.Добавить();
			НоваяСтрока.Номер	= Выборка.НомерТелефона;
			Если МассивАбонентов.Количество() = 0 Тогда
				НоваяСтрока.Абонент	= Неопределено;
			ИначеЕсли ЗначениеЗаполнено(МассивАбонентов[0]) Тогда	
				Если СтрДлина(ОчищенныйНомерТелефона) > ДлинаВнутреннихНомеров Тогда
					НоваяСтрока.Абонент	= МассивАбонентов[0];
				ИначеЕсли ТипЗнч(МассивАбонентов[0]) = Тип("СправочникСсылка.Пользователи") Тогда
					НоваяСтрока.Абонент	= МассивАбонентов[0];
				Иначе
					НоваяСтрока.Абонент	= Неопределено;
				КонецЕсли;	
			Иначе
				НоваяСтрока.Абонент	= Неопределено;
		    КонецЕсли;
	    КонецЕсли;
	КонецЦикла;
	// Получаем таблицу истории звонков
	Запрос.Текст = "ВЫБРАТЬ
	               |	dbo_Calls.CallID,
	               |	dbo_Calls.StartTime,
	               |	dbo_Calls.AnswerTime,
	               |	dbo_Calls.DropTime,
	               |	dbo_Calls.LineName,
	               |	dbo_Calls.CallerId,
	               |	dbo_Calls.CalledId,
	               |	dbo_Calls.Origin
	               |ИЗ
	               |	ВнешнийИсточникДанных.сфпВнешнийИсточникДанныхИсторииЗвонков.Таблица.dbo_Calls КАК dbo_Calls
	               |ГДЕ
	               |	dbo_Calls.StartTime МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	StartTime";
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	// Формируем структуру всех таблиц
	ТаблицаЕженедельныйОтчет = Новый ТаблицаЗначений;
	ТаблицаЕженедельныйОтчет.Колонки.Добавить("ДатаЗвонкаДень",					Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаЕженедельныйОтчет.Колонки.Добавить("ВсегоЗвонковДень",				Новый ОписаниеТипов("Число", 	Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаЕженедельныйОтчет.Колонки.Добавить("ВсегоОрганизацийДень",			Новый ОписаниеТипов("Число", 	Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаЕженедельныйОтчет.Колонки.Добавить("ВсегоНеИзБазыДень",				Новый ОписаниеТипов("Число", 	Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаЕженедельныйОтчет.Колонки.Добавить("ЗвонковБольше60ВДень",			Новый ОписаниеТипов("Число", 	Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаЕженедельныйОтчет.Колонки.Добавить("ПервыйЗвонокДень",				Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Время)));
	ТаблицаЕженедельныйОтчет.Колонки.Добавить("ПоследнийЗвонокДень",			Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Время)));
	ТаблицаЕженедельныйОтчет.Колонки.Добавить("ПродолжительностьРабочегоДня",	Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Время)));
	ТаблицаЕженедельныйОтчет.Колонки.Добавить("ЗвонковБольше45ВЧас",			Новый ОписаниеТипов("Число", 	Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаЕженедельныйОтчет.Колонки.Добавить("ВремяПереговоровДень",			Новый ОписаниеТипов("Число", 	Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаЕженедельныйОтчет.Колонки.Добавить("Сотрудник",						Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	
	ТаблицаОтчетПоСовершеннымЗвонкам = Новый ТаблицаЗначений;
	ТаблицаОтчетПоСовершеннымЗвонкам.Колонки.Добавить("ДатаЗвонка",			Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТаблицаОтчетПоСовершеннымЗвонкам.Колонки.Добавить("ДлительностьЗвонка",	Новый ОписаниеТипов("Число", 	Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаОтчетПоСовершеннымЗвонкам.Колонки.Добавить("НомерТелефона",		Новый ОписаниеТипов("Строка"));
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Организации"));
	МассивТипов.Добавить(Тип("СправочникСсылка.Контрагенты"));
	МассивТипов.Добавить(Тип("СправочникСсылка.ПодразделенияКомпании"));
	ТаблицаОтчетПоСовершеннымЗвонкам.Колонки.Добавить("Организация",		Новый ОписаниеТипов(МассивТипов));
	ТаблицаОтчетПоСовершеннымЗвонкам.Колонки.Добавить("КонтактноеЛицо",		Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаОтчетПоСовершеннымЗвонкам.Колонки.Добавить("СотрудникПоЗвонкам",	Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	
	ТаблицаОтчетПоВсемЗвонкам = Новый ТаблицаЗначений;
	ТаблицаОтчетПоВсемЗвонкам.Колонки.Добавить("КоличествоСобытийДень",	Новый ОписаниеТипов("Число", 	Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаОтчетПоВсемЗвонкам.Колонки.Добавить("Дата",							Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаОтчетПоВсемЗвонкам.Колонки.Добавить("КоличествоЗвонковДень",			Новый ОписаниеТипов("Число", 	Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаОтчетПоВсемЗвонкам.Колонки.Добавить("ПропущенныхЗвонковДень",		Новый ОписаниеТипов("Число", 	Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаОтчетПоВсемЗвонкам.Колонки.Добавить("ПроцентПропущенныхЗвонковДень",	Новый ОписаниеТипов("Число", 	Новый КвалификаторыЧисла(5, 2, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаОтчетПоВсемЗвонкам.Колонки.Добавить("СреднееВремяОжиданияДень",		Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Время)));
	
	// Обрабатываем таблицу истории звонков	
	Если ЭтотОбъект.ВариантОтчета = "ЕженедельныйОтчет" Тогда
		ТаблицаЕженедельныйОтчет.Колонки.Удалить("ЗвонковБольше45ВЧас");
		ТаблицаЕженедельныйОтчет.Колонки.Удалить("ПервыйЗвонокДень");
		ТаблицаЕженедельныйОтчет.Колонки.Удалить("ПоследнийЗвонокДень");
		ТаблицаЕженедельныйОтчет.Колонки.Удалить("ПродолжительностьРабочегоДня");
		ТаблицаЕженедельныйОтчет.Колонки.Добавить("ЗвонковБольше45ВДень",	Новый ОписаниеТипов("Число", 	Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный)));
		ТаблицаРабочегоДня = Новый ТаблицаЗначений;
		ТаблицаРабочегоДня.Колонки.Добавить("Сотрудник",				Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
		ТаблицаРабочегоДня.Колонки.Добавить("ДатаЗвонкаДень",			Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
		ТаблицаРабочегоДня.Колонки.Добавить("ПервыйЗвонокДень",			Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Время)));
		ТаблицаРабочегоДня.Колонки.Добавить("ПоследнийЗвонокДень",		Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Время)));
		Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
			// Пропускаем неотвеченный звонок
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.AnswerTime) Тогда
				Продолжить;
			ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаТаблицы.DropTime) Тогда
				Продолжить;
			КонецЕсли;
			Если СтрокаТаблицы.Origin = 1 Тогда
				// Внешний/внутренний исходящий
				ОчищенныйНомерТелефона = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(СтрокаТаблицы.CallerId);
				Если ПустаяСтрока(ОчищенныйНомерТелефона) Тогда
					Продолжить;
				ИначеЕсли СтрДлина(ОчищенныйНомерТелефона) > ДлинаВнутреннихНомеров Тогда
					Продолжить;
				КонецЕсли;
				СтрокаСоответствия = ТаблицаСоответствия.Найти(ОчищенныйНомерТелефона, "Номер");
				Если СтрокаСоответствия = Неопределено Тогда
					Продолжить;
				ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаСоответствия.Абонент) Тогда
					Продолжить;
				ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.СотрудникОтчета) И НЕ (ЭтотОбъект.СотрудникОтчета = СтрокаСоответствия.Абонент) Тогда
					Продолжить;
				КонецЕсли;
				НоваяСтрока 					= ТаблицаЕженедельныйОтчет.Добавить();
				НоваяСтрока.Сотрудник			= СтрокаСоответствия.Абонент;
				НоваяСтрока.ДатаЗвонкаДень		= НачалоДня(СтрокаТаблицы.StartTime);
				НоваяСтрока.ВсегоЗвонковДень	= 1;
				ОчищенныйНомерТелефона = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(СтрокаТаблицы.CalledId);
				Если ПустаяСтрока(ОчищенныйНомерТелефона) Тогда
					НоваяСтрока.ВсегоОрганизацийДень			= 0;
					НоваяСтрока.ВсегоНеИзБазыДень				= 0;
				ИначеЕсли СтрДлина(ОчищенныйНомерТелефона) > ДлинаВнутреннихНомеров Тогда
					// Внешний исходящий
					СтрокаСоответствия = ТаблицаСоответствия.Найти(ОчищенныйНомерТелефона, "Номер");
					Если СтрокаСоответствия = Неопределено Тогда
						НоваяСтрока.ВсегоОрганизацийДень	= 0;
						НоваяСтрока.ВсегоНеИзБазыДень		= 1;
					ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаСоответствия.Абонент) Тогда
						НоваяСтрока.ВсегоОрганизацийДень	= 0;
						НоваяСтрока.ВсегоНеИзБазыДень		= 1;
					Иначе
						НоваяСтрока.ВсегоОрганизацийДень	= 1;
						НоваяСтрока.ВсегоНеИзБазыДень		= 0;
					КонецЕсли;
				Иначе
					// Внутренний исходящий
					НоваяСтрока.ВсегоОрганизацийДень		= 0;
					НоваяСтрока.ВсегоНеИзБазыДень			= 0;
				КонецЕсли;
			ИначеЕсли СтрокаТаблицы.Origin = 2 Тогда
				// Внешний/внутренний входящий
				ОчищенныйНомерТелефона = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(СтрокаТаблицы.CalledId);
				Если ПустаяСтрока(ОчищенныйНомерТелефона) Тогда
					Продолжить;
				ИначеЕсли СтрДлина(ОчищенныйНомерТелефона) > ДлинаВнутреннихНомеров Тогда
					Продолжить;
				КонецЕсли;
				СтрокаСоответствия = ТаблицаСоответствия.Найти(ОчищенныйНомерТелефона, "Номер");
				Если СтрокаСоответствия = Неопределено Тогда
					Продолжить;
				ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаСоответствия.Абонент) Тогда
					Продолжить;
				ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.СотрудникОтчета) И НЕ (ЭтотОбъект.СотрудникОтчета = СтрокаСоответствия.Абонент) Тогда
					Продолжить;
				КонецЕсли;
				НоваяСтрока 					= ТаблицаЕженедельныйОтчет.Добавить();
				НоваяСтрока.Сотрудник			= СтрокаСоответствия.Абонент;
				НоваяСтрока.ДатаЗвонкаДень		= НачалоДня(СтрокаТаблицы.StartTime);
				НоваяСтрока.ВсегоЗвонковДень	= 1;
				ОчищенныйНомерТелефона = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(СтрокаТаблицы.CallerId);
				Если ПустаяСтрока(ОчищенныйНомерТелефона) Тогда
					НоваяСтрока.ВсегоОрганизацийДень			= 0;
					НоваяСтрока.ВсегоНеИзБазыДень				= 0;
				ИначеЕсли СтрДлина(ОчищенныйНомерТелефона) > ДлинаВнутреннихНомеров Тогда
					// Внешний входящий
					СтрокаСоответствия = ТаблицаСоответствия.Найти(ОчищенныйНомерТелефона, "Номер");
					Если СтрокаСоответствия = Неопределено Тогда
						НоваяСтрока.ВсегоОрганизацийДень	= 0;
						НоваяСтрока.ВсегоНеИзБазыДень		= 1;
					ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаСоответствия.Абонент) Тогда
						НоваяСтрока.ВсегоОрганизацийДень	= 0;
						НоваяСтрока.ВсегоНеИзБазыДень		= 1;
					Иначе
						НоваяСтрока.ВсегоОрганизацийДень	= 1;
						НоваяСтрока.ВсегоНеИзБазыДень		= 0;
					КонецЕсли;
				Иначе
					// Внутренний входящий
					НоваяСтрока.ВсегоОрганизацийДень		= 0;
					НоваяСтрока.ВсегоНеИзБазыДень			= 0;
				КонецЕсли;
			ИначеЕсли СтрокаТаблицы.Origin = 3 Тогда
				// Внешний входящий
				ОчищенныйНомерТелефона = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(СтрокаТаблицы.CalledId);
				Если ПустаяСтрока(ОчищенныйНомерТелефона) Тогда
					Продолжить;
				ИначеЕсли СтрДлина(ОчищенныйНомерТелефона) > ДлинаВнутреннихНомеров Тогда
					Продолжить;
				КонецЕсли;
				СтрокаСоответствия = ТаблицаСоответствия.Найти(ОчищенныйНомерТелефона, "Номер");
				Если СтрокаСоответствия = Неопределено Тогда
					Продолжить;
				ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаСоответствия.Абонент) Тогда
					Продолжить;
				ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.СотрудникОтчета) И НЕ (ЭтотОбъект.СотрудникОтчета = СтрокаСоответствия.Абонент) Тогда
					Продолжить;
				КонецЕсли;
				НоваяСтрока 					= ТаблицаЕженедельныйОтчет.Добавить();
				НоваяСтрока.Сотрудник			= СтрокаСоответствия.Абонент;
				НоваяСтрока.ДатаЗвонкаДень		= НачалоДня(СтрокаТаблицы.StartTime);
				НоваяСтрока.ВсегоЗвонковДень	= 1;
				ОчищенныйНомерТелефона = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(СтрокаТаблицы.CallerId);
				Если ПустаяСтрока(ОчищенныйНомерТелефона) Тогда
					НоваяСтрока.ВсегоОрганизацийДень			= 0;
					НоваяСтрока.ВсегоНеИзБазыДень				= 0;
				Иначе
					СтрокаСоответствия = ТаблицаСоответствия.Найти(ОчищенныйНомерТелефона, "Номер");
					Если СтрокаСоответствия = Неопределено Тогда
						НоваяСтрока.ВсегоОрганизацийДень		= 0;
						НоваяСтрока.ВсегоНеИзБазыДень			= 1;
					ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаСоответствия.Абонент) Тогда
						НоваяСтрока.ВсегоОрганизацийДень		= 0;
						НоваяСтрока.ВсегоНеИзБазыДень			= 1;
					Иначе
						НоваяСтрока.ВсегоОрганизацийДень		= 1;
						НоваяСтрока.ВсегоНеИзБазыДень			= 0;
					КонецЕсли;	
				КонецЕсли;	
			ИначеЕсли СтрокаТаблицы.Origin = 6 Тогда
				// Внешний исходящий
				ОчищенныйНомерТелефона = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(СтрокаТаблицы.CallerId);
				Если ПустаяСтрока(ОчищенныйНомерТелефона) Тогда
					Продолжить;
				ИначеЕсли СтрДлина(ОчищенныйНомерТелефона) > ДлинаВнутреннихНомеров Тогда
					Продолжить;
				КонецЕсли;
				СтрокаСоответствия = ТаблицаСоответствия.Найти(ОчищенныйНомерТелефона, "Номер");
				Если СтрокаСоответствия = Неопределено Тогда
					Продолжить;
				ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаСоответствия.Абонент) Тогда
					Продолжить;
				ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.СотрудникОтчета) И НЕ (ЭтотОбъект.СотрудникОтчета = СтрокаСоответствия.Абонент) Тогда
					Продолжить;
				КонецЕсли;
				НоваяСтрока 					= ТаблицаЕженедельныйОтчет.Добавить();
				НоваяСтрока.Сотрудник			= СтрокаСоответствия.Абонент;
				НоваяСтрока.ДатаЗвонкаДень		= НачалоДня(СтрокаТаблицы.StartTime);
				НоваяСтрока.ВсегоЗвонковДень	= 1;
				ОчищенныйНомерТелефона = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(СтрокаТаблицы.CalledId);
				Если ПустаяСтрока(ОчищенныйНомерТелефона) Тогда
					НоваяСтрока.ВсегоОрганизацийДень			= 0;
					НоваяСтрока.ВсегоНеИзБазыДень				= 0;
				Иначе
					СтрокаСоответствия = ТаблицаСоответствия.Найти(ОчищенныйНомерТелефона, "Номер");
					Если СтрокаСоответствия = Неопределено Тогда
						НоваяСтрока.ВсегоОрганизацийДень		= 0;
						НоваяСтрока.ВсегоНеИзБазыДень			= 1;
					ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаСоответствия.Абонент) Тогда
						НоваяСтрока.ВсегоОрганизацийДень		= 0;
						НоваяСтрока.ВсегоНеИзБазыДень			= 1;
					Иначе	
						НоваяСтрока.ВсегоОрганизацийДень		= 1;
						НоваяСтрока.ВсегоНеИзБазыДень			= 0;
					КонецЕсли;	
				КонецЕсли;
			Иначе
				Продолжить;
			КонецЕсли;
			НоваяСтрока.ВремяПереговоровДень = СтрокаТаблицы.DropTime - СтрокаТаблицы.AnswerTime;
			Если НоваяСтрока.ВремяПереговоровДень > 60 Тогда
				НоваяСтрока.ЗвонковБольше60ВДень	= 1;
				НоваяСтрока.ЗвонковБольше45ВДень	= 1;
			ИначеЕсли НоваяСтрока.ВремяПереговоровДень > 45 Тогда
				НоваяСтрока.ЗвонковБольше45ВДень	= 1;
				НоваяСтрока.ЗвонковБольше60ВДень	= 0;
			Иначе
				НоваяСтрока.ЗвонковБольше60ВДень	= 0;
				НоваяСтрока.ЗвонковБольше45ВДень	= 0;
			КонецЕсли;				
			// Сохраняем время первого и последнего звонка			
			ОтборДня = Новый Структура;
			ОтборДня.Вставить("ДатаЗвонкаДень",	НоваяСтрока.ДатаЗвонкаДень);
			ОтборДня.Вставить("Сотрудник",		НоваяСтрока.Сотрудник);
			НайденныеСтроки = ТаблицаРабочегоДня.НайтиСтроки(ОтборДня);
			Если НайденныеСтроки.Количество() = 0 Тогда
				НоваяСтрокаДня = ТаблицаРабочегоДня.Добавить();
				НоваяСтрокаДня.ДатаЗвонкаДень				= НоваяСтрока.ДатаЗвонкаДень;
				НоваяСтрокаДня.Сотрудник					= НоваяСтрока.Сотрудник;
				НоваяСтрокаДня.ПервыйЗвонокДень				= СтрокаТаблицы.AnswerTime;
				НоваяСтрокаДня.ПоследнийЗвонокДень			= СтрокаТаблицы.DropTime;
			Иначе	
				НоваяСтрокаДня = НайденныеСтроки[0];
				Если СтрокаТаблицы.AnswerTime < НоваяСтрокаДня.ПервыйЗвонокДень Тогда
					НоваяСтрокаДня.ПервыйЗвонокДень			= СтрокаТаблицы.AnswerTime;
				КонецЕсли;
				Если СтрокаТаблицы.DropTime > НоваяСтрокаДня.ПоследнийЗвонокДень Тогда
					НоваяСтрокаДня.ПоследнийЗвонокДень		= СтрокаТаблицы.DropTime;
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;	
		ТаблицаЕженедельныйОтчет.Свернуть("ДатаЗвонкаДень, Сотрудник", "ВсегоЗвонковДень, ВсегоОрганизацийДень, ВсегоНеИзБазыДень, ЗвонковБольше60ВДень, ЗвонковБольше45ВДень, ВремяПереговоровДень");
		ТаблицаЕженедельныйОтчет.Колонки.Добавить("ЗвонковБольше45ВЧас",			Новый ОписаниеТипов("Число", 	Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный)));
		ТаблицаЕженедельныйОтчет.Колонки.Добавить("ПервыйЗвонокДень",				Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Время)));
		ТаблицаЕженедельныйОтчет.Колонки.Добавить("ПоследнийЗвонокДень",			Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Время)));
		ТаблицаЕженедельныйОтчет.Колонки.Добавить("ПродолжительностьРабочегоДня",	Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Время)));
		ТаблицаЕженедельныйОтчет.Колонки.Добавить("ДатаНачала",					Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
		ТаблицаЕженедельныйОтчет.Колонки.Добавить("ДатаОкончания",				Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
		Для Каждого СтрокаИстории Из ТаблицаЕженедельныйОтчет Цикл
			ОтборДня = Новый Структура;
			ОтборДня.Вставить("ДатаЗвонкаДень",	СтрокаИстории.ДатаЗвонкаДень);
			ОтборДня.Вставить("Сотрудник",		СтрокаИстории.Сотрудник);
			НайденныеСтроки = ТаблицаРабочегоДня.НайтиСтроки(ОтборДня);
			Если НайденныеСтроки.Количество() > 0 Тогда
				СтрокаИстории.ПервыйЗвонокДень				= НайденныеСтроки[0].ПервыйЗвонокДень;
				СтрокаИстории.ПоследнийЗвонокДень			= НайденныеСтроки[0].ПоследнийЗвонокДень;
				ПродолжительностьРабочегоДня				= НайденныеСтроки[0].ПоследнийЗвонокДень - НайденныеСтроки[0].ПервыйЗвонокДень;
				СтрокаИстории.ПродолжительностьРабочегоДня	= Дата('00010101') + ПродолжительностьРабочегоДня;
				Если ПродолжительностьРабочегоДня > 0 Тогда
					СтрокаИстории.ЗвонковБольше45ВЧас		= СтрокаИстории.ЗвонковБольше45ВДень / ПродолжительностьРабочегоДня * 3600;
				КонецЕсли;	
			КонецЕсли;
			СтрокаИстории.ВремяПереговоровДень	= СтрокаИстории.ВремяПереговоровДень / 60;
		КонецЦикла;
		ТаблицаЕженедельныйОтчет.Колонки.Удалить("ЗвонковБольше45ВДень");
		Если ТаблицаЕженедельныйОтчет.Количество() = 0 Тогда
			Сообщить("Отсутствуют данные для отчета");
			Возврат;
		КонецЕсли;
	ИначеЕсли ЭтотОбъект.ВариантОтчета = "ОтчетПоСовершеннымЗвонкам" Тогда
		Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
			// Пропускаем неотвеченный звонок
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.AnswerTime) Тогда
				Продолжить;
			ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаТаблицы.DropTime) Тогда
				Продолжить;
			ИначеЕсли СтрокаТаблицы.Origin = 2 Тогда
				// Внешний/внутренний входящий
				Продолжить;
			ИначеЕсли СтрокаТаблицы.Origin = 3 Тогда
				// Внешний входящий
				Продолжить;
			КонецЕсли;
			Если СтрокаТаблицы.Origin = 1 Тогда
				// Внешний/внутренний исходящий
				ОчищенныйНомерТелефона = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(СтрокаТаблицы.CallerId);
				Если ПустаяСтрока(ОчищенныйНомерТелефона) Тогда
					Продолжить;
				ИначеЕсли СтрДлина(ОчищенныйНомерТелефона) > ДлинаВнутреннихНомеров Тогда
					Продолжить;
				КонецЕсли;
				СтрокаСоответствия = ТаблицаСоответствия.Найти(ОчищенныйНомерТелефона, "Номер");
				Если СтрокаСоответствия = Неопределено Тогда
					Продолжить;
				ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаСоответствия.Абонент) Тогда
					Продолжить;
				ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.СотрудникОтчета) И НЕ (ЭтотОбъект.СотрудникОтчета = СтрокаСоответствия.Абонент) Тогда
					Продолжить;
				КонецЕсли;
				НоваяСтрока 					= ТаблицаОтчетПоСовершеннымЗвонкам.Добавить();
				НоваяСтрока.СотрудникПоЗвонкам	= СтрокаСоответствия.Абонент;
				НоваяСтрока.ДатаЗвонка			= СтрокаТаблицы.StartTime;
				НоваяСтрока.ДлительностьЗвонка	= СтрокаТаблицы.DropTime - СтрокаТаблицы.AnswerTime;
				НоваяСтрока.НомерТелефона		= СтрокаТаблицы.CalledId;
				ОчищенныйНомерТелефона = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(СтрокаТаблицы.CalledId);
				Если ПустаяСтрока(ОчищенныйНомерТелефона) Тогда
					НоваяСтрока.Организация		= Неопределено;
					НоваяСтрока.КонтактноеЛицо	= Справочники.Контрагенты.ПустаяСсылка();
				Иначе
					СтрокаСоответствия = ТаблицаСоответствия.Найти(ОчищенныйНомерТелефона, "Номер");
					Если СтрокаСоответствия = Неопределено Тогда
					НоваяСтрока.Организация		= Неопределено;
					НоваяСтрока.КонтактноеЛицо	= Справочники.Контрагенты.ПустаяСсылка();
					ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаСоответствия.Абонент) Тогда
						НоваяСтрока.Организация		= Неопределено;
						НоваяСтрока.КонтактноеЛицо	= Справочники.Контрагенты.ПустаяСсылка();
					ИначеЕсли ТипЗнч(СтрокаСоответствия.Абонент) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(СтрокаСоответствия.Абонент.ВедушийКонтрагент) Тогда
						НоваяСтрока.Организация		= СтрокаСоответствия.Абонент.ВедушийКонтрагент;
						НоваяСтрока.КонтактноеЛицо	= СтрокаСоответствия.Абонент;
					Иначе
						НоваяСтрока.Организация		= СтрокаСоответствия.Абонент;;
						НоваяСтрока.КонтактноеЛицо	= Справочники.Контрагенты.ПустаяСсылка();
					КонецЕсли;                                            
				КонецЕсли;                                            
			ИначеЕсли СтрокаТаблицы.Origin = 6 Тогда
				// Внешний исходящий
				ОчищенныйНомерТелефона = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(СтрокаТаблицы.CallerId);
				Если ПустаяСтрока(ОчищенныйНомерТелефона) Тогда
					Продолжить;
				ИначеЕсли СтрДлина(ОчищенныйНомерТелефона) > ДлинаВнутреннихНомеров Тогда
					Продолжить;
				КонецЕсли;
				СтрокаСоответствия = ТаблицаСоответствия.Найти(ОчищенныйНомерТелефона, "Номер");
				Если СтрокаСоответствия = Неопределено Тогда
					Продолжить;
				ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаСоответствия.Абонент) Тогда
					Продолжить;
				ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.СотрудникОтчета) И НЕ (ЭтотОбъект.СотрудникОтчета = СтрокаСоответствия.Абонент) Тогда
					Продолжить;
				КонецЕсли;
				НоваяСтрока 					= ТаблицаОтчетПоСовершеннымЗвонкам.Добавить();
				НоваяСтрока.Сотрудник			= СтрокаСоответствия.Абонент;
				НоваяСтрока.ДатаЗвонка			= СтрокаТаблицы.StartTime;
				НоваяСтрока.ДлительностьЗвонка	= СтрокаТаблицы.DropTime - СтрокаТаблицы.AnswerTime;
				НоваяСтрока.НомерТелефона		= СтрокаТаблицы.CalledId;
				ОчищенныйНомерТелефона = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(СтрокаТаблицы.CalledId);
				Если ПустаяСтрока(ОчищенныйНомерТелефона) Тогда
					НоваяСтрока.Организация		= Неопределено;
					НоваяСтрока.КонтактноеЛицо	= Справочники.Контрагенты.ПустаяСсылка();
				Иначе
					СтрокаСоответствия = ТаблицаСоответствия.Найти(ОчищенныйНомерТелефона, "Номер");
					Если СтрокаСоответствия = Неопределено Тогда
						НоваяСтрока.Организация		= Неопределено;
						НоваяСтрока.КонтактноеЛицо	= Справочники.Контрагенты.ПустаяСсылка();
					ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаСоответствия.Абонент) Тогда
						НоваяСтрока.Организация		= Неопределено;
						НоваяСтрока.КонтактноеЛицо	= Справочники.Контрагенты.ПустаяСсылка();
					ИначеЕсли ТипЗнч(СтрокаСоответствия.Абонент) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(СтрокаСоответствия.Абонент.ВедушийКонтрагент) Тогда
						НоваяСтрока.Организация		= СтрокаСоответствия.Абонент.ВедушийКонтрагент;
						НоваяСтрока.КонтактноеЛицо	= СтрокаСоответствия.Абонент;
					Иначе
						НоваяСтрока.Организация		= СтрокаСоответствия.Абонент;;
						НоваяСтрока.КонтактноеЛицо	= Справочники.Контрагент.ПустаяСсылка();
					КонецЕсли;                                            
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
		Если ТаблицаОтчетПоСовершеннымЗвонкам.Количество() = 0 Тогда
			Сообщить("Отсутствуют данные для отчета");
			Возврат;
		КонецЕсли;
	ИначеЕсли ЭтотОбъект.ВариантОтчета = "ОтчетПоВсемЗвонкам" Тогда
		ТаблицаОтчетПоВсемЗвонкам.Колонки.Удалить("СреднееВремяОжиданияДень");
		ТаблицаОтчетПоВсемЗвонкам.Колонки.Добавить("ВремяОжиданияДень",		Новый ОписаниеТипов("Число",	Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный)));
		Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
			// Пропускаем незавершенный звонок
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.DropTime) Тогда Продолжить; КонецЕсли;
			НоваяСтрока = ТаблицаОтчетПоВсемЗвонкам.Добавить();
			НоваяСтрока.Дата							= НачалоДня(СтрокаТаблицы.StartTime);
			НоваяСтрока.КоличествоЗвонковДень			= 1;
			НоваяСтрока.ПроцентПропущенныхЗвонковДень	= 0;
			НоваяСтрока.КоличествоСобытийДень			= 0;
			Если ЗначениеЗаполнено(СтрокаТаблицы.AnswerTime) Тогда
				НоваяСтрока.ПропущенныхЗвонковДень	= 0;
				НоваяСтрока.ВремяОжиданияДень		= (СтрокаТаблицы.AnswerTime - СтрокаТаблицы.StartTime);
			Иначе
				НоваяСтрока.ПропущенныхЗвонковДень	= 1;
				НоваяСтрока.ВремяОжиданияДень		= (СтрокаТаблицы.DropTime - СтрокаТаблицы.StartTime);
			КонецЕсли;	
		КонецЦикла;	
		ТаблицаОтчетПоВсемЗвонкам.Свернуть("Дата", "КоличествоСобытийДень, КоличествоЗвонковДень, ПропущенныхЗвонковДень, ПроцентПропущенныхЗвонковДень, ВремяОжиданияДень");
		ТаблицаОтчетПоВсемЗвонкам.Колонки.Добавить("СреднееВремяОжиданияДень",	Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Время)));
		Запрос.Текст = "ВЫБРАТЬ
		               |	События.Дата,
		               |	СУММА(События.Количество) КАК КоличествоСобытийДень
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		CRM_Событие.Ссылка КАК Ссылка,
		               |		НАЧАЛОПЕРИОДА(CRM_Событие.Дата, ДЕНЬ) КАК Дата,
		               |		1 КАК Количество
		               |	ИЗ
		               |		Документ.Событие КАК CRM_Событие
		               |	ГДЕ
		               |		CRM_Событие.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		               |		И CRM_Событие.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ТелефонныйЗвонок)) КАК События
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	События.Дата";
		ВыборкаСобытий = Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаИстории Из ТаблицаОтчетПоВсемЗвонкам Цикл
			Если СтрокаИстории.КоличествоЗвонковДень = 0 Тогда
				СтрокаИстории.ПроцентПропущенныхЗвонковДень = 0;
				СтрокаИстории.СреднееВремяОжиданияДень		= Дата('00010101');
			Иначе	
				СтрокаИстории.ПроцентПропущенныхЗвонковДень = (СтрокаИстории.ПропущенныхЗвонковДень / СтрокаИстории.КоличествоЗвонковДень) * 100;
				СтрокаИстории.СреднееВремяОжиданияДень		= Дата('00010101') + (СтрокаИстории.ВремяОжиданияДень / СтрокаИстории.КоличествоЗвонковДень);
			КонецЕсли;
			СтрокаСобытия = ВыборкаСобытий.Найти(СтрокаИстории.Дата, "Дата");
			Если СтрокаСобытия = Неопределено Тогда
				СтрокаИстории.КоличествоСобытийДень	= 0;
			Иначе	
				СтрокаИстории.КоличествоСобытийДень	= СтрокаСобытия.КоличествоСобытийДень;
			КонецЕсли;	
		КонецЦикла;
		ТаблицаОтчетПоВсемЗвонкам.Колонки.Удалить("ВремяОжиданияДень");
	КонецЕсли;	
	ВнешниеНаборыДанных	= Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаЕженедельныйОтчет",			ТаблицаЕженедельныйОтчет);
	ВнешниеНаборыДанных.Вставить("ТаблицаОтчетПоСовершеннымЗвонкам",	ТаблицаОтчетПоСовершеннымЗвонкам);
	ВнешниеНаборыДанных.Вставить("ТаблицаОтчетПоВсемЗвонкам",			ТаблицаОтчетПоВсемЗвонкам);
	СхемаКомпоновкиДанных = ЭтотОбъект.СхемаКомпоновкиДанных;
	ВариантНастроек = СхемаКомпоновкиДанных.ВариантыНастроек.Найти(ЭтотОбъект.ВариантОтчета);
	Если ВариантНастроек = Неопределено Тогда
		Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	Иначе
		Настройки = ВариантНастроек.Настройки;
	КонецЕсли;	
	Если ЭтотОбъект.ВариантОтчета = "ОтчетПоСовершеннымЗвонкам" Тогда
		Если ЗначениеЗаполнено(ЭтотОбъект.Событие) Тогда
			ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Использование	= Ложь;
			Если ЗначениеЗаполнено(ЭтотОбъект.Событие.Контрагент) Тогда
				ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
				ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].ПравоеЗначение	= ЭтотОбъект.Событие.Контрагент;
				ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].Использование	= Истина;
				Если ЗначениеЗаполнено(ЭтотОбъект.Событие.КонтактноеЛицо) Тогда
					ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[2].ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
					ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[2].ПравоеЗначение	= ЭтотОбъект.Событие.КонтактноеЛицо;
					ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[2].Использование	= Истина;
				Иначе	
					ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[2].Использование	= Ложь;
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.Событие.КонтактноеЛицоБезКонтрагента) Тогда
				ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
				ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].ПравоеЗначение	= ЭтотОбъект.Событие.КонтактноеЛицоБезКонтрагента;
				ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].Использование	= Истина;
				ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[2].Использование	= Ложь;
			КонецЕсли;	
			ЭтотОбъект.Событие = Неопределено;
		КонецЕсли;	
		Для Каждого ЭлементПользовательскогоОтбора Из ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл		
			Для Каждого ЭлементОтбора Из Настройки.Отбор.Элементы Цикл
				Если ЭлементОтбора.ИдентификаторПользовательскойНастройки = ЭлементПользовательскогоОтбора.ИдентификаторПользовательскойНастройки Тогда
					ЭлементОтбора.Использование		= ЭлементПользовательскогоОтбора.Использование;
					ЭлементОтбора.ВидСравнения		= ЭлементПользовательскогоОтбора.ВидСравнения;
					ЭлементОтбора.ПравоеЗначение	= ЭлементПользовательскогоОтбора.ПравоеЗначение;
					Прервать;
				КонецЕсли;	
			КонецЦикла;	
		КонецЦикла;
	КонецЕсли;	
	КомпоновщикМакета			= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки				= КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных	= Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	ПроцессорВывода				= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
КонецПроцедуры // ПриКомпоновкеРезультата()
