Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос=Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_БСО_РасходБланковСтрогойОтчетностиСписокБСО.НомерБСО КАК НомерБСО,
	               |	Ссылка.Дата ДатаРасхода
	               |ПОМЕСТИТЬ ДокТЧНомераБСО
	               |ИЗ
	               |	Документ.Renault_БСО_РасходБланковСтрогойОтчетности.СписокБСО КАК Renault_БСО_РасходБланковСтрогойОтчетностиСписокБСО
	               |ГДЕ
	               |	Renault_БСО_РасходБланковСтрогойОтчетностиСписокБСО.Ссылка = &Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	НомерБСО,
	               |	ДатаРасхода
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ДокТЧНомераБСО.НомерБСО КАК НомерБСОДляБлокировки
	               |ИЗ
	               |	ДокТЧНомераБСО КАК ДокТЧНомераБСО";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();	
	
	Блокировка = Новый БлокировкаДанных;
	ЭлБлокировки = Блокировка.Добавить("РегистрНакопления.Renault_БСО_УчетБланковСтрогойОтчетности");
	ЭлБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлБлокировки.УстановитьЗначение("Организация", Организация);
	ЭлБлокировки.УстановитьЗначение("Подразделение", Подразделение);
	ЭлБлокировки.УстановитьЗначение("СерияБСО", Серия);
	ЭлБлокировки.УстановитьЗначение("НаименованиеБСО", БланкСтрогойОтчетности);
	ЭлБлокировки.ИсточникДанных = Результат;
	ЭлБлокировки.ИспользоватьИзИсточникаДанных("НомерБСО", "НомерБСОДляБлокировки");
	Блокировка.Заблокировать();
	
	//Проверки
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_БСО_СтатусыБСО.Период КАК Период,
		|	Renault_БСО_СтатусыБСО.НомерБСО,
		|	Renault_БСО_СтатусыБСО.Статус,
		|	Renault_БСО_СтатусыБСО.Регистратор
		|ПОМЕСТИТЬ ТаблицаСтатусовБСО
		|ИЗ РегистрСведений.Renault_БСО_СтатусыБСО КАК Renault_БСО_СтатусыБСО
		|ГДЕ
		|	Renault_БСО_СтатусыБСО.Организация = &Организация
		|	И Renault_БСО_СтатусыБСО.Подразделение = &Подразделение
		|	И Renault_БСО_СтатусыБСО.СерияБСО = &СерияБСО
		|	И Renault_БСО_СтатусыБСО.НаименованиеБСО = &НаименованиеБСО
		|	И НомерБСО В(Выбрать Различные НомерБСО Из Документ.Renault_БСО_РасходБланковСтрогойОтчетности.СписокБСО ГДЕ Ссылка=&Ссылка)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокТЧНомераБСО.НомерБСО КАК НомерБСО,
		|	МАКСИМУМ(ТаблицаСтатусовБСО.Период) КАК Период
		|ПОМЕСТИТЬ ДокТЧНомераБСПМаксПериодСтатусов
		|ИЗ
		|	ДокТЧНомераБСО КАК ДокТЧНомераБСО
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСтатусовБСО КАК ТаблицаСтатусовБСО
		|		ПО ДокТЧНомераБСО.ДатаРасхода >= ТаблицаСтатусовБСО.Период
		|			И ДокТЧНомераБСО.НомерБСО = ТаблицаСтатусовБСО.НомерБСО
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокТЧНомераБСО.НомерБСО
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерБСО,
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокТЧНомераБСПМаксПериодСтатусов.НомерБСО КАК НомерБСО,
		|	ТаблицаСтатусовБСО.Статус КАК Статус,
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаСтатусовБСО.Регистратор) КАК Документ
		|ПОМЕСТИТЬ СтатусыНомеровОбщая
		|ИЗ
		|	ДокТЧНомераБСПМаксПериодСтатусов КАК ДокТЧНомераБСПМаксПериодСтатусов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСтатусовБСО КАК ТаблицаСтатусовБСО
		|		ПО ДокТЧНомераБСПМаксПериодСтатусов.НомерБСО = ТаблицаСтатусовБСО.НомерБСО
		|			И ДокТЧНомераБСПМаксПериодСтатусов.Период = ТаблицаСтатусовБСО.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДокТЧНомераБСО.НомерБСО) КАК КоличествоРазличныхНомеровБСО
		|ИЗ
		|	ДокТЧНомераБСО КАК ДокТЧНомераБСО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтатусыНомеровОбщая.НомерБСО,
		|	СтатусыНомеровОбщая.Статус КАК Статус,
		|	СтатусыНомеровОбщая.Документ
		|ИЗ
		|	СтатусыНомеровОбщая КАК СтатусыНомеровОбщая
		|ГДЕ
		|	СтатусыНомеровОбщая.Статус = ЗНАЧЕНИЕ(Перечисление.Renault_БСО_СтатусыБланковСтрогойОтчетности.Продан)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтатусыНомеровОбщая.НомерБСО,
		|	СтатусыНомеровОбщая.Статус,
		|	СтатусыНомеровОбщая.Документ
		|ИЗ
		|	СтатусыНомеровОбщая КАК СтатусыНомеровОбщая
		|ГДЕ
		|	СтатусыНомеровОбщая.Статус = ЗНАЧЕНИЕ(Перечисление.Renault_БСО_СтатусыБланковСтрогойОтчетности.Уничтожен)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтатусыНомеровОбщая.НомерБСО,
		|	СтатусыНомеровОбщая.Статус,
		|	СтатусыНомеровОбщая.Документ
		|ИЗ
		|	СтатусыНомеровОбщая КАК СтатусыНомеровОбщая
		|ГДЕ
		|	СтатусыНомеровОбщая.Статус ЕСТЬ NULL 
		|
		|УПОРЯДОЧИТЬ ПО
		|	Статус
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДокТЧНомераБСО.НомерБСО
		|ИЗ
		|	ДокТЧНомераБСО КАК ДокТЧНомераБСО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Renault_БСО_УчетБланковСтрогойОтчетности.Остатки(
		|				,
		|				Организация = &Организация
		|					И Подразделение = &Подразделение
		|					И НаименованиеБСО = &НаименованиеБСО
		|					И СерияБСО = &СерияБСО
		|					И НомерБСО В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							ДокТЧНомераБСО.НомерБСО
		|						ИЗ
		|							ДокТЧНомераБСО КАК ДокТЧНомераБСО)) КАК Renault_БСО_УчетБланковСтрогойОтчетностиОстатки
		|		ПО ДокТЧНомераБСО.НомерБСО = Renault_БСО_УчетБланковСтрогойОтчетностиОстатки.НомерБСО
		|ГДЕ
		|	Renault_БСО_УчетБланковСтрогойОтчетностиОстатки.КоличествоОстаток ЕСТЬ NULL "; 	
	Запрос.УстановитьПараметр("НаименованиеБСО", БланкСтрогойОтчетности);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("СерияБСО", Серия);
	Результат = Запрос.ВыполнитьПакет();
	
	//Проверка на дубли номеров БСО в документе
	Выборка = Результат[3].Выбрать();
	
	Выборка.Следующий();
	
	КоличествоНомеровБСО = СписокБСО.Количество();
	
	Если Выборка.КоличествоРазличныхНомеровБСО <> КоличествоНомеровБСО Тогда
		Сообщить("В документе встречаются одинаковые номера БСО!");
		
		Отказ = Истина;
	КонецЕсли;
	
	СтатусПродан = Перечисления.Renault_БСО_СтатусыБланковСтрогойОтчетности.Продан;
	СтатусУничтожен = Перечисления.Renault_БСО_СтатусыБланковСтрогойОтчетности.Уничтожен;
	
	//Проверка по статусам
	Если НЕ Результат[4].Пустой() Тогда			
		
		Выборка = Результат[4].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Статус = Выборка.Статус;
			
			Если Статус = СтатусПродан Тогда
				Сообщить("БСО с номером - " + Выборка.НомерБСО + " уже был продан (" + Выборка.Документ + ").");
			ИначеЕсли Статус = СтатусУничтожен Тогда
				Сообщить("БСО с номером - " + Выборка.НомерБСО + " был уничтожен (" + Выборка.Документ + ").");
			ИначеЕсли Статус = NULL Тогда
				Сообщить("БСО с номером - " + Выборка.НомерБСО + " не учтен в базе, до даты расхода.");
			КонецЕсли;			
		КонецЦикла;
		
		Отказ = Истина;		
	КонецЕсли;
	
	//Проверка оперативного остатка
	Если НЕ Результат[5].Пустой() Тогда
		Выборка = Результат[5].Выбрать();
		
		Пока Выборка.Следующий() Цикл 			
			Сообщить("Нет в наличии БСО с номером - " + Выборка.НомерБСО + ".");
		КонецЦикла;
		
		Отказ = Истина;	
	КонецЕсли;	
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Списать Тогда
		СтатусДокумента = СтатусУничтожен;
	Иначе
		СтатусДокумента = СтатусПродан;
	КонецЕсли;
		
	//Проведение	
	Движения.Renault_БСО_СтатусыБСО.Записывать = Истина;
	
	Для Каждого Строка Из СписокБСО Цикл
		Движение = Движения.Renault_БСО_СтатусыБСО.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Подразделение = Подразделение;
		Движение.НаименованиеБСО = БланкСтрогойОтчетности;
		Движение.СерияБСО = Серия;
		Движение.НомерБСО = Строка.НомерБСО;
		Движение.Статус = СтатусДокумента;
	КонецЦикла;
	
	Движения.Renault_БСО_УчетБланковСтрогойОтчетности.Записывать = Истина;
	
	Для Каждого Строка Из СписокБСО Цикл
		Движение = Движения.Renault_БСО_УчетБланковСтрогойОтчетности.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Подразделение = Подразделение;
		Движение.НаименованиеБСО = БланкСтрогойОтчетности;
		Движение.СерияБСО = Серия;
		Движение.НомерБСО = Строка.НомерБСО;
		Движение.Количество = 1;
	КонецЦикла;
КонецПроцедуры
