
Функция ТТННаСервере(ТТННомер,ГодТТН,Vin,ДилерскийЦентрПользователя,мТекущийПользователь) Экспорт

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CRM_СостояниеАвтомобилейПроизводителя_v2.Автомобиль,
		               |	CRM_СостояниеАвтомобилейПроизводителя_v2.OPTIONS КАК СоставОпций,
		               |	CRM_СостояниеАвтомобилейПроизводителя_v2.VIN,
		               |	CRM_СостояниеАвтомобилейПроизводителя_v2.ЦенаЗакупкиАвтомобиля,
		               |	ГОД(ЕСТЬNULL(CRM_СостояниеАвтомобилейПроизводителя_v2.DATE_FACT, CRM_СостояниеАвтомобилейПроизводителя_v2.DATE_PLAN)) КАК ГодПоступления,
		               |	CRM_СостояниеАвтомобилейПроизводителя_v2.GTD,
		               |	CRM_СостояниеАвтомобилейПроизводителя_v2.Модель,
		               |	CRM_СостояниеАвтомобилейПроизводителя_v2.NUM_FACTURE_REP,
		               |	CRM_СостояниеАвтомобилейПроизводителя_v2.Версия
		               |ИЗ
		               |	РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
		               |ГДЕ
		               |	CRM_СостояниеАвтомобилейПроизводителя_v2.NUM_TTN = &НомерТТН
		               |	И (ГОД(ЕСТЬNULL(CRM_СостояниеАвтомобилейПроизводителя_v2.DATE_FACT, ДАТАВРЕМЯ(1, 1, 1))) = &ГодПоступления
		               |			ИЛИ ГОД(ЕСТЬNULL(CRM_СостояниеАвтомобилейПроизводителя_v2.DATE_PLAN, ДАТАВРЕМЯ(1, 1, 1))) = &ГодПоступления
		               |			ИЛИ CRM_СостояниеАвтомобилейПроизводителя_v2.YEAR = &ГодПоступления)";
		
		Запрос.УстановитьПараметр("НомерТТН", ТТННомер);
		Запрос.УстановитьПараметр("ГодПоступления", ГодТТН);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ЗаписьСостояниеАвтомобилейПроизводителя = РегистрыСведений.CRM_СостояниеАвтомобилейПроизводителя_v2.СоздатьМенеджерЗаписи();
		ЗаписьСостояниеАвтомобилейПроизводителя.VIN = VIN;
		ЗаписьСостояниеАвтомобилейПроизводителя.Прочитать();
		
		НачатьТранзакцию();
		
		Если НЕ ДилерскийЦентрПользователя.Автосклад_РазделятьПоступленияПоТТН Тогда 
			ДокументПоступления = Документы.ПоступлениеАвтомобилей.СоздатьДокумент();
			ДокументПоступления.Дата = ТекущаяДата();
			ДокументПоступления.Автор = мТекущийПользователь;
			ДокументПоступления.ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилей;
			ДокументПоступления.ВхДокНомер = ЗаписьСостояниеАвтомобилейПроизводителя.NUM_TTN;
		КонецЕсли;
		//Получим список автомобилей по номеру ТТН и году ТТН (текущий год)

		ИдСтроки = 0;
		Пока Выборка.Следующий() Цикл
			
			Если ДилерскийЦентрПользователя.Автосклад_РазделятьПоступленияПоТТН Тогда 
				ДокументПоступления = Документы.ПоступлениеАвтомобилей.СоздатьДокумент();
				ДокументПоступления.Дата = ТекущаяДата();
				ДокументПоступления.Автор = мТекущийПользователь;
				ДокументПоступления.ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилей;  
				Если ДилерскийЦентрПользователя.Автосклад_РазделятьПоступленияПоТТН Тогда 
					ДокументПоступления.ВхДокНомер = Выборка.NUM_FACTURE_REP;
				Иначе 
					ДокументПоступления.ВхДокНомер = ЗаписьСостояниеАвтомобилейПроизводителя.NUM_TTN;
				КонецЕсли;
			КонецЕсли;

			ИдСтроки = ИдСтроки + 1;
			
			НовСтрока = ДокументПоступления.Автомобили.Добавить();
			Если Найти(Метаданные.НайтиПоТипу(ТипЗнч(НовСтрока)).Реквизиты, "VIN") <> Неопределено Тогда
				НовСтрока.VIN = Выборка.VIN;
			КонецЕсли;
			НовСтрока.Автомобиль = Выборка.Автомобиль;
			НовСтрока.ИдентификаторАвтомобиля = ИдСтроки;
			НовСтрока.АвтомобильБезЗаказа = Истина;
			Если НЕ ПустаяСтрока(Выборка.GTD) Тогда
				
				НомерГТД = Справочники.ГТД.НайтиПоНаименованию(Выборка.GTD);
				Если НомерГТД.Пустая() Тогда
					НомерГТД = Справочники.ГТД.СоздатьЭлемент();
					НомерГТД.УстановитьНовыйКод();
					НомерГТД.Наименование = СокрЛП(Выборка.GTD);
					НомерГТД.Страна = ПолучитьСтрану(НовСтрока.Автомобиль.Модель.Артикул);
					НомерГТД.Записать();
					НомерГТД = НомерГТД.Ссылка;
				КонецЕсли;
				НовСтрока.ГТД = НомерГТД;
				
			КонецЕсли;    
			НовСтрока.Количество = 1;
			НовСтрока.Цена = Выборка.ЦенаЗакупкиАвтомобиля;
			НовСтрока.Сумма = Выборка.ЦенаЗакупкиАвтомобиля;
			НовСтрока.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
			НовСтрока.СуммаВсего = НовСтрока.Сумма;
			
			// Трояновский К.Е. 15.02.2019 12:54:56 {
			// Закомментировано по DMSCOR-1087
			//Если ДокументПоступления.Дата >= '20190101' Тогда
			//	СуммаБезНДС = НовСтрока.СуммаВсего / 1.20;
			//Иначе
			//	СуммаБезНДС = НовСтрока.СуммаВсего / 1.18;
			//КонецЕсли;
			СуммаБезНДС = НовСтрока.СуммаВсего / (1 + Справочники.СтавкиНДС.ОсновнаяСтавкаНДС.Ставка / 100);			
			// Трояновский К.Е. 15.02.2019 12:54:56 }
			НовСтрока.СуммаНДС = НовСтрока.СуммаВсего - СуммаБезНДС;
			
			ТаблицаОпцииАвто = Renault_CRM.ПолучитьТаблицуОпцийПоВин(НовСтрока.VIN);
			
			Для Каждого ЭлементМассива Из ТаблицаОпцииАвто Цикл
					
				НайденнаяОпция = ЭлементМассива.Опция;
				
				Если ЗначениеЗаполнено(НайденнаяОпция) Тогда
					НовСтрокаОпций = ДокументПоступления.Опции.Добавить();
					НовСтрокаОпций.ИдентификаторАвтомобиля = НовСтрока.ИдентификаторАвтомобиля;
					НовСтрокаОпций.Опция = НайденнаяОпция;
					НовСтрокаОпций.Количество = 1;
				КонецЕсли;
			КонецЦикла;
			
			Если ДилерскийЦентрПользователя.Автосклад_РазделятьПоступленияПоТТН Тогда 
				Форма = ДокументПоступления.ПолучитьФорму();
				Форма.ОткрытьМодально();
			КонецЕсли;
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
		Если НЕ ДилерскийЦентрПользователя.Автосклад_РазделятьПоступленияПоТТН Тогда 
			Форма = ДокументПоступления.ПолучитьФорму();
			Форма.ОткрытьМодально();
		КонецЕсли;
		
		сПараметры = Новый Структура;
		ТЗДанных = Новый ТаблицаЗначений;
		ТЗДанных.Колонки.Добавить("VIN");
		ТЗДанных.Колонки.Добавить("Автомобиль");
		ТЗДанных.Колонки.Добавить("Модель");
		ТЗДанных.Колонки.Добавить("Версия");
		Выборка.Сбросить();
		Пока Выборка.Следующий() Цикл
			СтрТЗ = ТЗДанных.Добавить();
			ЗаполнитьЗначенияСвойств(СтрТЗ, Выборка);
		КонецЦикла;
		
		сПараметры.Вставить("ТаблицаАвтомобилей", ТЗДанных);
		
		//Ответ = ОткрытьФормуМодально("Обработка.Renault_АРМ_Автосклад.Форма.ФормаПриемаАвтомобиля", сПараметры);
	   Возврат сПараметры;

	
КонецФункции

Функция ПолучитьСтрану(МодельАртикул)
	
	Страна = Справочники.КлассификаторСтранМира.ПустаяСсылка();
	
	Если Найти(МодельАртикул, "MAU") ИЛИ Найти(МодельАртикул, "MRO") ИЛИ Найти(МодельАртикул, "KQ2") Тогда
		Страна = Справочники.КлассификаторСтранМира.НайтиПоКоду("250");
	ИначеЕсли Найти(МодельАртикул, "67P") ИЛИ Найти(МодельАртикул, "67F") Тогда
		Страна = Справочники.КлассификаторСтранМира.НайтиПоКоду("504");
	ИначеЕсли Найти(МодельАртикул, "ZGH") Тогда
		Страна = Справочники.КлассификаторСтранМира.НайтиПоКоду("045");
	ИначеЕсли Найти(МодельАртикул, "TWZ") Тогда
		Страна = Справочники.КлассификаторСтранМира.НайтиПоКоду("724");	
	КонецЕсли;
	
	Возврат Страна;
	
КонецФункции
