// Общий журнал

Перем Права Экспорт;

Перем Организация Экспорт;

Функция ПолучитьСписокПечатныхФорм() Экспорт
	Возврат Новый СписокЗначений();	
КонецФункции
//Конец необходимых для общих журналов

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	//Проверка приемки автомобиля
	Если ЭтоНовый() Тогда 
		Возврат;
	КонецЕсли;
	Если Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Заявка Тогда 
		Возврат;
	КонецЕсли;
	
	// { DMSREN-1245
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Renault_CRM_ПриемкаАвтомобиля.Состояние
	//	|ИЗ
	//	|	Документ.Renault_CRM_ПриемкаАвтомобиля КАК Renault_CRM_ПриемкаАвтомобиля
	//	|ГДЕ
	//	|	Renault_CRM_ПриемкаАвтомобиля.Обращение = &Обращение";
	//
	//Запрос.УстановитьПараметр("Обращение", Обращение);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда 
	//	Отказ = Истина;
	//	Сообщить("Не найдена приемка автомобиля по обращению "+Обращение+
	//	"|Мойка автомобиля невозможна");
	//КонецЕсли;
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	Если ВыборкаДетальныеЗаписи.Состояние <> Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Выполнен Тогда 
	//		Отказ = Истина;
	//		Сообщить("Приемка автомобиля не выполнена,необходимо принять автомобиль.");
	//	КонецЕсли;
	//КонецЦикла;
	// } DMSREN-1245
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Renault_CRM_ЗаявкаНаМойку.Ссылка,
	//|	Renault_CRM_ЗаявкаНаМойку.ВремяНачала,
	//|	Renault_CRM_ЗаявкаНаМойку.ВремяОкончания
	//|ИЗ
	//|	Документ.Renault_CRM_ЗаявкаНаМойку КАК Renault_CRM_ЗаявкаНаМойку
	//|ГДЕ
	//|	Renault_CRM_ЗаявкаНаМойку.Машиноместо = &Машиноместо
	//|	И Renault_CRM_ЗаявкаНаМойку.Ссылка <> &Ссылка";
	//Запрос.УстановитьПараметр("Машиноместо", Машиноместо);
	//Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Renault_АвтосервисПланРабот.РабочийДокумент КАК Ссылка,
	//|	Renault_АвтосервисПланРабот.ВремяНачала,
	//|	Renault_АвтосервисПланРабот.ВремяОкончания,
	//|	Renault_АвтосервисПланОперативный.ВремяНачала КАК ВремяНачалаПлан,
	//|	Renault_АвтосервисПланОперативный.ВремяОкончания КАК ВремяОкончанияПлан,
	//|	Renault_АвтосервисФактОперативный.ВремяНачала КАК ВремяНачалаФакт,
	//|	Renault_АвтосервисФактОперативный.ВремяОкончания КАК ВремяОкончанияФакт
	//|ИЗ
	//|	РегистрСведений.Renault_АвтосервисПланРабот КАК Renault_АвтосервисПланРабот
	//|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_АвтосервисПланОперативный КАК Renault_АвтосервисПланОперативный
	//|	ПО Renault_АвтосервисПланОперативный.РабочийДокумент = Renault_АвтосервисПланРабот.РабочийДокумент
	//|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_АвтосервисФактОперативный КАК Renault_АвтосервисФактОперативный
	//|	ПО Renault_АвтосервисФактОперативный.РабочийДокумент = Renault_АвтосервисПланРабот.РабочийДокумент
	//|ГДЕ
	//|	Renault_АвтосервисПланРабот.РабочийДокумент <> &РабочийДокумент
	//|	И Renault_АвтосервисПланРабот.ДилерскийЦентр = &ДилерскийЦентр
	//|	И Renault_АвтосервисПланРабот.Цех = &Цех";
	//Запрос.УстановитьПараметр("Цех", Машиноместо);
	//Запрос.УстановитьПараметр("ДилерскийЦентр", ДилерскийЦентр);
	//Запрос.УстановитьПараметр("РабочийДокумент", ЭтотОбъект.Ссылка);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	
	//Пока Выборка.Следующий() Цикл
	//	// если нет факт-плана и опер.плана тогда
	//	Если НЕ (ЗначениеЗаполнено(Выборка.ВремяНачалаФакт) ИЛИ ЗначениеЗаполнено(Выборка.ВремяНачалаПлан)) Тогда
	//		Если (ВремяНачала > Выборка.ВремяНачала И ВремяНачала < Выборка.ВремяОкончания) ИЛИ
	//			(ВремяОкончания > Выборка.ВремяНачала И ВремяОкончания < Выборка.ВремяОкончания) Тогда
	//			Сообщить("Есть пересечения с существующим документом:" + Выборка.Ссылка);
	//			Отказ = Истина;
	//		КонецЕсли;
	//	//Если есть план или факт
	//	Иначе
	//		// если есть факт
	//		Если ЗначениеЗаполнено(Выборка.ВремяНачалаФакт) Тогда
	//			Если (ВремяНачала > Выборка.ВремяНачалаФакт И ВремяНачала < Выборка.ВремяОкончанияФакт) ИЛИ
	//				(ВремяОкончания > Выборка.ВремяНачалаФакт И ВремяОкончания < Выборка.ВремяОкончанияФакт) Тогда
	//				Сообщить("Есть пересечения с существующим документом:" + Выборка.Ссылка);
	//				Отказ = Истина;
	//			КонецЕсли;
	//		КонецЕсли;
	//		// если есть план
	//		Если ЗначениеЗаполнено(Выборка.ВремяНачалаПлан) Тогда
	//			Если (ВремяНачала > Выборка.ВремяНачалаПлан И ВремяНачала < Выборка.ВремяОкончанияПлан) ИЛИ
	//				(ВремяОкончания > Выборка.ВремяНачалаПлан И ВремяОкончания < Выборка.ВремяОкончанияПлан) Тогда
	//				Сообщить("Есть пересечения с существующим документом:" + Выборка.Ссылка);
	//				Отказ = Истина;
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)   	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	//Если СостояниеИзменено Тогда
	//	МассивСообщений = Новый Массив;
	//	Если Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.НачатьРаботу
	//		ИЛИ Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.ВРаботе Тогда
	//		Renault_СообщенияПользователю.СоздатьСообщение(Ссылка, Неопределено, МассивСообщений, Справочники.Renault_ВидСообщения.Автосервис_МойкаНачата, Неопределено, Неопределено);
	//	ИначеЕсли Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Выполнен Тогда
	//		Renault_СообщенияПользователю.СоздатьСообщение(Ссылка, Неопределено, МассивСообщений, Справочники.Renault_ВидСообщения.Автосервис_МойкаОкончена, Неопределено, Неопределено);
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	Если Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.ВРаботе Тогда
		
		// запишем мойку		
		
		Запись = РегистрыСведений.Renault_АвтосервисСтатусыРабот.СоздатьМенеджерЗаписи();
		Запись.ДилерскийЦентр = ДилерскийЦентр;
		Запись.Обращение = Обращение;
		Запись.Цех = Машиноместо;
		Запись.ЭтапРабот = 1;
		Запись.РабочийДокумент = Ссылка;
		Запись.Период = ТекущаяДата();
		Запись.СтатусРаботы = Справочники.Renault_СтатусыАвторабот.РаботаНачата;
		Запись.Записать();
		
		Набор = РегистрыСведений.Renault_АвтосервисПланРабот.СоздатьНаборЗаписей();
		Набор.Отбор.Обращение.Установить(Обращение);
		Набор.Отбор.РабочийДокумент.Установить(Ссылка);
		Набор.Прочитать();
		ОтставаниеВоВремени = ТекущаяДата() - Набор[0].ВремяНачала;
		
		НаборПланОперативный = РегистрыСведений.Renault_АвтосервисПланОперативный.СоздатьНаборЗаписей();
		НаборПланОперативный.Отбор.РабочийДокумент.Установить(Ссылка);
		НаборПланОперативный.Прочитать();
		НаборПланОперативный.Очистить();
		
		//// запишем все автоработы
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	Renault_АвтосервисПланРабот.ВремяНачала,
		//|	Renault_АвтосервисПланРабот.ВремяОкончания,
		//|	Renault_АвтосервисПланРабот.ЭтапРабот,
		//|	Renault_АвтосервисПланРабот.Цех,
		//|	Renault_АвтосервисПланРабот.Длительность,
		//|	Renault_АвтосервисПланРабот.РабочийДокумент
		//|ИЗ
		//|	РегистрСведений.Renault_АвтосервисПланРабот КАК Renault_АвтосервисПланРабот
		//|ГДЕ
		//|	Renault_АвтосервисПланРабот.Обращение = &Обращение";
		//Запрос.УстановитьПараметр("Обращение", Обращение);
		//Выборка = Запрос.Выполнить().Выбрать();
		//Пока Выборка.Следующий() Цикл
			
			//Запись = РегистрыСведений.Renault_АвтосервисПланОперативный.СоздатьМенеджерЗаписи();
			Запись = НаборПланОперативный.Добавить();
			Запись.ДилерскийЦентр = ДилерскийЦентр;
			Запись.Период = ТекущаяДата();
			Запись.Обращение = Обращение;
			Запись.РабочийДокумент = Ссылка;
			Запись.ЭтапРабот = 1;
			Запись.Цех = Машиноместо;
			Запись.ВремяНачала = ТекущаяДата();
			Запись.ВремяОкончания = ТекущаяДата() + ЭтотОбъект.Длительность;
			Запись.Длительность = ЭтотОбъект.Длительность;
			//Запись.Записать();
		//КонецЦикла;
		
		НаборПланОперативный.Записать();
		
		//Запишем занятость сотрудника
		Сотрудник = ЭтотОбъект.Машиноместо;
		
		Запись = РегистрыСведений.CRM_СтатусыЗанятостиСотрудников.СоздатьМенеджерЗаписи();
		Запись.Сотрудник = Машиноместо;
		Запись.Статус = Перечисления.CRM_ЗанятостьСотрудника.Занят;
		Запись.Период = ТекущаяДата();
		Запись.ПричинаЗанятости = Перечисления.CRM_ПричиныЗанятостиСотрудника.Приемка;
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ВремяОкончания) Тогда
			
			Запись.ПримерноеВремяОкончания = ЭтотОбъект.ВремяОкончания;
			
		Иначе
			
			Запись.ПримерноеВремяОкончания = ТекущаяДата() + Длительность;
			
		КонецЕсли;
		
		Запись.Записать();
		
		ВидСообщения = Справочники.Renault_ВидСообщения.Автосервис_МойкаНачата;
		
		ОтправитьСообщениеОСтатусеРаботы(ЭтотОбъект.Ссылка, ВидСообщения, "1")
		
	ИначеЕсли Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Заявка Тогда
		
		Запись = РегистрыСведений.Renault_АвтосервисПланОперативный.СоздатьМенеджерЗаписи();
		Запись.Период = ТекущаяДата();
		Запись.Обращение = ЭтотОбъект.Обращение;
		Запись.РабочийДокумент = Ссылка;
		Запись.ЭтапРабот = 1;
		Запись.ДилерскийЦентр = ДилерскийЦентр.Ссылка;
		Запись.ВремяНачала = ВремяНачала;
		Запись.ВремяОкончания = ВремяОкончания;
		Запись.Длительность = Длительность;
		Запись.Цех = Машиноместо;
		
				
		Запись.Записать();
		
	ИначеЕсли Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Выполнен Тогда
		
		Запись = РегистрыСведений.Renault_АвтосервисСтатусыРабот.СоздатьМенеджерЗаписи();
		Запись.ДилерскийЦентр = ДилерскийЦентр;
		//Запись.ДатаВремяИзменения = ТекущаяДата();
		Запись.Обращение = Обращение;
		Запись.Цех = Машиноместо;
		Запись.ЭтапРабот = 1;
		Запись.РабочийДокумент = Ссылка;
		Запись.Период = ТекущаяДата();
		Запись.СтатусРаботы = Справочники.Renault_СтатусыАвторабот.РаботаЗакончена;
		Запись.Записать();
		
		НаборПлан = РегистрыСведений.Renault_АвтосервисПланОперативный.СоздатьНаборЗаписей();
		НаборПлан.Отбор.РабочийДокумент.Установить(Ссылка);
		НаборПлан.Прочитать();
		НаборПлан.Очистить();
		НаборПлан.Записать();
		
	//какой статус для "свободен" пока не придумал, пусть будет так:	
	//ИначеЕсли Состояние <> Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.ПриемкаНачата Тогда
		
		Запись = РегистрыСведений.CRM_СтатусыЗанятостиСотрудников.СоздатьМенеджерЗаписи();
		Запись.Сотрудник = Машиноместо;
		Запись.Статус = Перечисления.CRM_ЗанятостьСотрудника.Свободен;
		Запись.Период = ТекущаяДата();
		
		Запись.Записать();
		
		ВидСообщения = Справочники.Renault_ВидСообщения.Автосервис_МойкаОкончена;
		
		ОтправитьСообщениеОСтатусеРаботы(ЭтотОбъект.Ссылка, ВидСообщения, "1")
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьСообщениеОСтатусеРаботы(РабочийДокумент, ВидСообщения, ЭтапРабот)
	
		Напоминание = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
		
		Напоминание.Отправитель = ПараметрыСеанса.Пользователь;
		
		Напоминание.Подробнее = РабочийДокумент.Ссылка;
		
		Обращение = РабочийДокумент.Обращение.Ссылка;
		
		Приемщик = Документы.Renault_CRM_ПриемкаАвтомобиля.НайтиПоРеквизиту("Обращение", Обращение).Машиноместо.Ссылка;
		
		Напоминание.Адресаты.Добавить().Сотрудник = Приемщик;
		          //:)
		Выдавальщик = Документы.Renault_CRM_ВыдачаАвтомобиля.НайтиПоРеквизиту("Обращение", Обращение).Машиноместо.Ссылка;
		
		Если Приемщик <> Выдавальщик Тогда
			
			Напоминание.Адресаты.Добавить().Сотрудник = Выдавальщик;
			
		КонецЕсли;
		
		Напоминание.ДатаОтправки = ТекущаяДата();
					
		Напоминание.ВидСообщения = ВидСообщения;
			    
		Напоминание.ПоказыватьС = ТекущаяДата();
		Напоминание.ПоказыватьПо = ТекущаяДата();
		
		Инфо = "";
		//ИмяЭтапа = РабочийДокумент.Ссылка.Этапы.Найти(ЭтапРабот, "IDЭтапа");
		
		Если ЗначениеЗаполнено(РабочийДокумент) Тогда
			
			//Если ЗначениеЗаполнено(РабочийДокумент.ЗаказНаряд) Тогда 
			//	
			//	Инфо = "Заказ-наряд номер: " + Строка(РабочийДокумент.ЗаказНаряд.Номер);
			//	
			//Иначе
				
				Инфо = "У мойки по заявке изменился статус.";
				
			//КонецЕсли;
			
			ГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(РабочийДокумент.Автомобиль.Ссылка, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
	
			
			Если ЗначениеЗаполнено(РабочийДокумент.ГосНомер) Тогда
				
				Инфо = Инфо + Символы.ПС + "Номер Авто: " + ГосНомер;
				
			Иначе
				
				Инфо = Инфо + Символы.ПС + "Модель Авто: " + РабочийДокумент.Автомобиль.Модель;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Напоминание.Комментарий = Инфо;		
		Напоминание.Наименование = "Событие по авто";
		Напоминание.Сообщение = Инфо;
		
		Напоминание.Записать();
	
КонецПроцедуры



