
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Применение.Параметры.УстановитьЗначениеПараметра("КредитнаяПрограмма", Объект.Ссылка);
	Менеджер = РегистрыСведений.CRM_ПараметрыКредитныхПрограмм.СоздатьМенеджерЗаписи();
	Менеджер.КредитнаяПрограмма = Объект.Ссылка;
	Менеджер.Прочитать();
	Если Менеджер.Выбран() Тогда
		МинимальныйСрокКредита = Менеджер.МинимальныйСрокКредита;
		МаксимальныйСрокКредита = Менеджер.МаксимальныйСрокКредита;
		МинимальныйПервоначальныйВзнос = Менеджер.МинимальныйПервоначальныйВзнос;
		МаксимальныйПервоначальныйВзнос = Менеджер.МаксимальныйПервоначальныйВзнос;
		СтавкаБанка = Менеджер.СтавкаБанка;
		Если НЕ Объект.ГодоваяСтавка = Менеджер.МаркетинговаяСтавка Тогда
			Объект.ГодоваяСтавка = Менеджер.МаркетинговаяСтавка;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Применение.Параметры.УстановитьЗначениеПараметра("КредитнаяПрограмма", Объект.Ссылка);
	Менеджер = РегистрыСведений.CRM_ПараметрыКредитныхПрограмм.СоздатьМенеджерЗаписи();
	Менеджер.КредитнаяПрограмма = Объект.Ссылка;
	Менеджер.МинимальныйСрокКредита = МинимальныйСрокКредита;
	Менеджер.МаксимальныйСрокКредита = МаксимальныйСрокКредита;
	Менеджер.МинимальныйПервоначальныйВзнос = МинимальныйПервоначальныйВзнос;
	Менеджер.МаксимальныйПервоначальныйВзнос = МаксимальныйПервоначальныйВзнос;
	Менеджер.СтавкаБанка = СтавкаБанка;
	Менеджер.МаркетинговаяСтавка = Объект.ГодоваяСтавка;
	Менеджер.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименениеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И Вопрос("Перед заполнением примененеия кредитную программу необходимо записать. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		Попытка
			Записать()
		Исключение
			Отказ = Истина
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыКредитаПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры
