
&НаКлиенте
Процедура ОтборВсе(Команда)
	
	ОтключитьВсеОтборы();
	Элементы.Список.Обновить();
	
КонецПроцедуры

Процедура ОтключитьВсеОтборы()
	
	Для Каждого Ст из Список.Отбор.Элементы Цикл
		Ст.Использование = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНаРассмотрении(Команда)
	
	ОтключитьВсеОтборы();
	
	Для Каждого Ст из Список.Отбор.Элементы Цикл
		Если Строка(Ст.ЛевоеЗначение) = "Статус" Тогда
			Ст.ПравоеЗначение = Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.НаРассмотрении;
			Ст.Использование = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВыполненные(Команда)
	
	ОтключитьВсеОтборы();
	
	Для Каждого Ст из Список.Отбор.Элементы Цикл
		Если Строка(Ст.ЛевоеЗначение) = "Статус" Тогда
			Ст.ПравоеЗначение = Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.Выполнена;
			Ст.Использование = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры
