Процедура АвтоРуЗагрузкаСправочниковМодуль() Экспорт
	
	ВнутреннийАдресСервера = "https://auto-export.s3.yandex.net/auto/price-list/catalog/cars.xml";
	
	ИмяФайлаНазначение = ПолучитьИмяВременногоФайла("xml");
	ФайлНаДиске = Новый Файл(ИмяФайлаНазначение);
	
	Для Счетчик = 1 По 10 Цикл
		КопироватьФайл(ВнутреннийАдресСервера,ИмяФайлаНазначение);
  		Если ФайлНаДиске.Существует() Тогда
 			Прервать;
		КонецЕсли;
		Пауза30секунд = 30;
		КонДата = ТекущаяДата() + Пауза30секунд;
  		Пока ТекущаяДата() < КонДата Цикл
      		//...  
  		КонецЦикла;
 	КонецЦикла; 
	
	Если НЕ ФайлНаДиске.Существует() Тогда
		#Если НаКлиенте Тогда
			Попытка
		       Сообщить("ОШИБКА! Информация с сайта не скопирована в файл: <"+СокрЛП(ИмяФайлаНазначение)+">",СтатусСообщения.ОченьВажное);
 			Исключение
				//				
			КонецПопытки;		 
 		#КонецЕсли
  		Возврат;
	Иначе
		#Если НаКлиенте Тогда
			Попытка
		       Сообщить("Информация с сайта скопирована в файл: <"+СокрЛП(ФайлНаДиске.ПолноеИмя)+">");
 			Исключение
				//				
			КонецПопытки;		 
 		#КонецЕсли
	КонецЕсли;  
 
 	МаркаАвтоРу = Справочники.Марка_АвтоРу.ПустаяСсылка();
 	
	ЧтениеXML = Новый ЧтениеXML();
	
	ЧтениеXML.ОткрытьФайл(ИмяФайлаНазначение);
	
 	Пока ЧтениеXML.Прочитать() Цикл
 		
 		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			ТекущееИмя = ЧтениеXML.Имя;
   
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
			
			ТекущееЗначение = ЧтениеXML.Значение;
			
			Если ТекущееИмя = "mark_id" Тогда
 				МаркаАвтоРу = НайтиИлиСоздатьМарку(ТекущееЗначение);
 			ИначеЕсли ТекущееИмя = "folder_id" Тогда
  				МодельАвтоРу = НайтиИлиСоздатьМодель(ТекущееЗначение,МаркаАвтоРу);
 			ИначеЕсли ТекущееИмя = "modification_id" Тогда
 				МодификацияАвтоРу = НайтиИлиСоздатьМодификацию(ТекущееЗначение,МодельАвтоРу);
 			ИначеЕсли ТекущееИмя = "complectation" Тогда
 				КомплектацияАвтоРу = НайтиИлиСоздатьКомплектацию(ТекущееЗначение,МодификацияАвтоРу);
			КонецЕсли; 
			
   		КонецЕсли;
		
	КонецЦикла;
	
	ЧтениеXML.Закрыть();	

КонецПроцедуры


Функция НайтиИлиСоздатьМарку(Наименование) Экспорт
	
	НовМарка = Справочники.Марка_АвтоРу.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Марка_АвтоРу.Ссылка,
		|	Марка_АвтоРу.Наименование
		|ИЗ
		|	Справочник.Марка_АвтоРу КАК Марка_АвтоРу
		|ГДЕ
		|	Марка_АвтоРу.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовМарка = ВыборкаДетальныеЗаписи.Ссылка;
		Возврат НовМарка;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовМарка) Тогда
		
		НовМарка = Справочники.Марка_АвтоРу.СоздатьЭлемент();
		НовМарка.УстановитьНовыйКод("ЦБ");
		НовМарка.Наименование = Наименование;
		Попытка НовМарка.Записать(); Исключение  КонецПопытки;
		
	КонецЕсли; 
 
	Возврат НовМарка.Ссылка;

КонецФункции // НайтиИлиСоздатьМарку(Наименование) 

Функция НайтиИлиСоздатьМодель(Наименование,Марка) Экспорт
	
	НовМодель = Справочники.Модели_АвтоРу.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Модель_АвтоРу.Ссылка,
		|	Модель_АвтоРу.Наименование
		|ИЗ
		|	Справочник.Модели_АвтоРу КАК Модель_АвтоРу
		|ГДЕ
		|	Модель_АвтоРу.Наименование = &Наименование
		|	И Модель_АвтоРу.МаркаАвтоРу = &Марка";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Марка", Марка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовМодель = ВыборкаДетальныеЗаписи.Ссылка;
		Возврат НовМодель;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовМодель) Тогда
		
		НовМодель = Справочники.Модели_АвтоРу.СоздатьЭлемент();
		НовМодель.УстановитьНовыйКод("ЦБ");
		НовМодель.Наименование = Наименование;
		НовМодель.МаркаАвтоРу = Марка; 
		
		Попытка	НовМодель.Записать(); Исключение КонецПопытки;
		
	КонецЕсли; 
 
	Возврат НовМодель.Ссылка;

КонецФункции // НайтиИлиСоздатьМодель(Наименование,Марка)

Функция НайтиИлиСоздатьМодификацию(Наименование,Модель) Экспорт
	
	НовМодификация = Справочники.Модификации_АвтоРу.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Модификация_АвтоРу.Ссылка,
		|	Модификация_АвтоРу.Наименование,
		|	Модификация_АвтоРу.Владелец
		|ИЗ
		|	Справочник.Модификации_АвтоРу КАК Модификация_АвтоРу
		|ГДЕ
		|	Модификация_АвтоРу.Наименование = &Наименование
		|	И Модификация_АвтоРу.Владелец = &Модель";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Модель", Модель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовМодификация = ВыборкаДетальныеЗаписи.Ссылка;
		Возврат НовМодификация;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовМодификация) Тогда
		
		НовМодификация = Справочники.Модификации_АвтоРу.СоздатьЭлемент();
		НовМодификация.УстановитьНовыйКод("ЦБ");
		НовМодификация.Наименование = Наименование;
		НовМодификация.Владелец = Модель; 
		
		Попытка	НовМодификация.Записать(); Исключение КонецПопытки;
		
	КонецЕсли; 
 
	Возврат НовМодификация.Ссылка;

КонецФункции // НайтиИлиСоздатьМодификацию(Наименование,Модель)

Функция НайтиИлиСоздатьКомплектацию(Наименование,Модификация) Экспорт
	
	НовКомплектация = Справочники.Комплектации_АвтоРу.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Комплектация_АвтоРу.Ссылка,
		|	Комплектация_АвтоРу.Наименование,
		|	Комплектация_АвтоРу.Владелец
		|ИЗ
		|	Справочник.Комплектации_АвтоРу КАК Комплектация_АвтоРу
		|ГДЕ
		|	Комплектация_АвтоРу.Наименование = &Наименование
		|	И Комплектация_АвтоРу.Владелец = &Модификация";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Модификация", Модификация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовКомплектация = ВыборкаДетальныеЗаписи.Ссылка;
		Возврат НовКомплектация;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовКомплектация) Тогда
		
		НовКомплектация = Справочники.Комплектации_АвтоРу.СоздатьЭлемент();
		НовКомплектация.УстановитьНовыйКод("ЦБ");
		НовКомплектация.Наименование = Наименование;
		НовКомплектация.Владелец = Модификация; 
		
		Попытка	НовКомплектация.Записать(); Исключение	КонецПопытки;
		
	КонецЕсли; 
 
	Возврат НовКомплектация.Ссылка;

КонецФункции // НайтиИлиСоздатьКомплектацию(Наименование,Модификация)

 