
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МожноВыдавать = ВыполнитьПроверкуПередВыдачей(Параметры.Договор, Параметры.Автомобиль, ?(Параметры.Свойство("ПроверкаРеализации"), Параметры.ПроверкаРеализации, Ложь));
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьПроверкуПередВыдачей(Договор, Автомобиль, ПроверкаРеализации = ЛОЖЬ) Экспорт 
	
	Отказ = Ложь;	
	
	РабочийЛист = Договор.РабочийЛист;
	
	ПараметрыОткрытия = Новый Структура();
	
	ЦенаДоговора = 0;
	СтатусДоговора = Договор.СтатусДоговора;
	Если СтатусДоговора <> Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан Тогда
		ПараметрыОткрытия.Вставить("Проверка_СтатусДоговора", Ложь);
		Отказ = Истина;
	Иначе
		ПараметрыОткрытия.Вставить("Проверка_СтатусДоговора", Истина);
	КонецЕсли;
	
	ЦенаДоговора = Договор.СуммаДоговора;
	ПараметрыОткрытия.Вставить("Проверка_ЦенаДоговора", ЦенаДоговора>0);
	
	Если Договор.СоставДоговора.Количество() = 0 ИЛИ НЕ ЗначениеЗаполнено(Договор.СоставДоговора[0].Автомобиль) Тогда
		Отказ = Истина;	
	Иначе	
		Автомобиль = Договор.СоставДоговора[0].Автомобиль;
	КонецЕсли;
	
	
	АнализируемыйАвтомобиль = Автомобиль;
	
	ПараметрыОткрытия.Вставить("Автомобиль", Автомобиль);
	ПараметрыОткрытия.Вставить("СтатусДоговора", СтатусДоговора);
	ПараметрыОткрытия.Вставить("Договор", Договор);
	ПараметрыОткрытия.Вставить("Проверка_Договор", Истина);
	ПараметрыОткрытия.Вставить("ЦенаДоговора", ЦенаДоговора);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.ТипАвтомобиля КАК ТипАвтомобиля,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.PTS_NUM КАК НомерПТС,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.Автомобиль КАК Автомобиль,
	|	ВЫБОР
	|		КОГДА CRM_СостояниеАвтомобилейПроизводителя_v2.DATE_PAY = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Оплачено
	|ИЗ
	|	РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
	|ГДЕ
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.VIN = &VIN";
	
	Запрос.УстановитьПараметр("VIN", Автомобиль.VIN);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТипАвтомобиля = Справочники.Renault_ТипыАвтомобилей.ПустаяСсылка();
	ПТС = "";
	ПараметрыОткрытия.Вставить("Проверка_ТипАвтомобиля", Истина);
	ПараметрыОткрытия.Вставить("Проверка_ПТС", Истина);
	
	Если Выборка.Следующий() Тогда
		Автомобиль = Выборка.Автомобиль;
		ТипАвтомобиля = Выборка.ТипАвтомобиля;
		Если ТипАвтомобиля <> Справочники.Renault_ТипыАвтомобилей.НаПродажу Тогда
			Отказ = Истина;
			ПараметрыОткрытия.Вставить("Проверка_ТипАвтомобиля", Ложь);
		КонецЕсли;
		
		ПТС = Выборка.НомерПТС;
		Если НЕ ЗначениеЗаполнено(ПТС) Тогда
			ПараметрыОткрытия.Вставить("Проверка_ПТС", Ложь);
			Отказ = Истина;
		КонецЕсли;
		Если Выборка.Оплачено Тогда
			ПараметрыОткрытия.Вставить("Проверка_ОплатаПоставщику", Истина);
		КонецЕсли;					
	Иначе		
		Отказ = Истина;
		ПараметрыОткрытия.Вставить("Проверка_ТипАвтомобиля", Ложь);
		ПараметрыОткрытия.Вставить("Проверка_ПТС", Ложь);		
	КонецЕсли;
	
	ПараметрыОткрытия.Вставить("ПТС", ПТС);
	ПараметрыОткрытия.Вставить("ТипАвтомобиля", ТипАвтомобиля);
	ПараметрыОткрытия.Вставить("Автомобиль",Автомобиль);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиАвтомобилейОбороты.СкладКомпании,
	|	ОстаткиАвтомобилейОбороты.Регистратор КАК Поступление
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Обороты(, , Регистратор, Автомобиль = &Автомобиль) КАК ОстаткиАвтомобилейОбороты
	|ГДЕ
	|	ОстаткиАвтомобилейОбороты.КоличествоПриход > 0
	|	И ОстаткиАвтомобилейОбороты.Регистратор ССЫЛКА Документ.ПоступлениеАвтомобилей";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	
	СкладКомпании = Справочники.СкладыКомпании.ПустаяСсылка();
	Поступление = Документы.ПоступлениеАвтомобилей.ПустаяСсылка();
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Поступление = Выборка.Поступление;
		СкладКомпании = Выборка.СкладКомпании;
		ПараметрыОткрытия.Вставить("Проверка_СкладКомпании", Истина);
		ПараметрыОткрытия.Вставить("Проверка_ДокументПоступления",Истина);
	Иначе
		Отказ = Истина;
		ПараметрыОткрытия.Вставить("Проверка_СкладКомпании", Ложь);
		ПараметрыОткрытия.Вставить("Проверка_ДокументПоступления",Ложь);
	КонецЕсли;
	
	ПараметрыОткрытия.Вставить("ДокументПоступления",Поступление);
	ПараметрыОткрытия.Вставить("СкладКомпании", СкладКомпании);
	
	Если не ПараметрыОткрытия.Свойство("Проверка_ОплатаПоставщику") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	CRM_ДополнительнаяИнформацияПоАвтомобилям.АвтоОплаченАФМ,
			|	CRM_ДополнительнаяИнформацияПоАвтомобилям.КлиентПолностьюОплатилАвто
			|ИЗ
			|	РегистрСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям КАК CRM_ДополнительнаяИнформацияПоАвтомобилям
			|ГДЕ
			|	CRM_ДополнительнаяИнформацияПоАвтомобилям.Автомобиль = &Автомобиль";
		
		Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
		
		Выборка = Запрос.Выполнить().Выбрать();
			
		Если Выборка.Следующий() Тогда
			ПараметрыОткрытия.Вставить("Проверка_ОплатаПоставщику",Выборка.АвтоОплаченАФМ);
			ПараметрыОткрытия.Вставить("ОплатаПоставщику",?(Выборка.АвтоОплаченАФМ,"Оплачен","Не оплачен"));
		Иначе
			ПараметрыОткрытия.Вставить("Проверка_ОплатаПоставщику",Ложь);
		 	Отказ = Истина;
		КонецЕсли;
	Иначе
		ПараметрыОткрытия.Вставить("ОплатаПоставщику","Оплачен");
	КонецЕсли;
	
	//Данные по оплате покупателем	
	ЗапросОплата = Новый Запрос;
	ЗапросОплата.Текст = ?(Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ИспользоватьСтарыйФункционалКСО,"
		|ВЫБРАТЬ
		|	РабочийЛист,
		|	Одобрена КредитОдобрен
		|ПОМЕСТИТЬ РабочиеЛистыОдобрениеКредита
		|ИЗ Документ.Renault_CRM_ЗаявкаНаКредит
		|ГДЕ РабочийЛист=&РабочийЛист
		|ИНДЕКСИРОВАТЬ ПО РабочийЛист
		|;","
		|ВЫБРАТЬ
		|	РабочийЛист,
		|	Выбор Когда Состояние=Значение(Перечисление.Renault_CRM_СтатусЗаявокНаКредит.Одобрена) Тогда Истина Иначе Ложь Конец КредитОдобрен
		|ПОМЕСТИТЬ РабочиеЛистыОдобрениеКредита
		|ИЗ Документ.Renault_РабочийЛистОФУ
		|ГДЕ РабочийЛист=&РабочийЛист
		|ИНДЕКСИРОВАТЬ ПО РабочийЛист
		|;")+	
		"ВЫБРАТЬ
		|	Renault_Договор.Ссылка.РабочийЛист КАК РабочийЛист,
		|	ЕСТЬNULL(Renault_Договор.Ссылка.DMS_ДоговорВзаиморасчетов, Renault_Договор.Ссылка.ЗаказНаАвтомобиль.ДоговорВзаиморасчетов) КАК ДоговорВзаиморасчетов,
		|	Renault_Договор.Ссылка.Клиент КАК Клиент,
		|	Renault_Договор.Ссылка.ОтсрочкаПлатежа КАК ОтсрочкаПлатежа,
		|	СУММА(Renault_Договор.СуммаПредоплаты) КАК СуммаПредоплаты
		|ПОМЕСТИТЬ ДоговорыРабЛисты
		|ИЗ
		|	Документ.Renault_Договор.СоставДоговора КАК Renault_Договор
		|ГДЕ
		|	Renault_Договор.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Renault_Договор.Ссылка.РабочийЛист,
		|	Renault_Договор.Ссылка.Клиент,
		|	Renault_Договор.Ссылка.ОтсрочкаПлатежа,
		|	ЕСТЬNULL(Renault_Договор.Ссылка.DMS_ДоговорВзаиморасчетов, Renault_Договор.Ссылка.ЗаказНаАвтомобиль.ДоговорВзаиморасчетов)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	РабочийЛист
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговорыРабЛисты.РабочийЛист КАК РабочийЛист,
		|	ДоговорыРабЛисты.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	ДоговорыРабЛисты.Клиент КАК Клиент,
		|	ЕСТЬNULL(РабочиеЛистыОдобрениеКредита.КредитОдобрен, ЛОЖЬ) КАК КредитОдобрен,
		|	ДоговорыРабЛисты.ОтсрочкаПлатежа КАК ОтсрочкаПлатежа,
		|	ДоговорыРабЛисты.СуммаПредоплаты КАК СуммаПредоплаты
		|ПОМЕСТИТЬ РабЛистыДанные
		|ИЗ
		|	ДоговорыРабЛисты КАК ДоговорыРабЛисты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РабочиеЛистыОдобрениеКредита КАК РабочиеЛистыОдобрениеКредита
		|		ПО ДоговорыРабЛисты.РабочийЛист = РабочиеЛистыОдобрениеКредита.РабочийЛист
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Клиент,
		|	ДоговорВзаиморасчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВзаиморасчетыКомпанииОстаткиИОбороты.Контрагент КАК Контрагент,
		|	ВзаиморасчетыКомпанииОстаткиИОбороты.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	ВзаиморасчетыКомпанииОстаткиИОбороты.СуммаРасход КАК СуммаОплаты,
		|	ВзаиморасчетыКомпанииОстаткиИОбороты.СуммаКонечныйОстаток КАК ОстатокОплаты,
		|	ВзаиморасчетыКомпанииОстаткиИОбороты.СуммаПриход КАК СуммаДолга
		|ПОМЕСТИТЬ ОплатыКонтрагента
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыКомпании.ОстаткиИОбороты(
		|			,
		|			,
		|			,
		|			,
		|			(Контрагент, ДоговорВзаиморасчетов) В
		|				(ВЫБРАТЬ
		|					РабЛистыДанные.Клиент,
		|					РабЛистыДанные.ДоговорВзаиморасчетов
		|				ИЗ
		|					РабЛистыДанные КАК РабЛистыДанные)) КАК ВзаиморасчетыКомпанииОстаткиИОбороты
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Контрагент,
		|	ДоговорВзаиморасчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РабЛистыДанные.РабочийЛист КАК РабочийЛист,
		|	РабЛистыДанные.КредитОдобрен КАК КредитОдобрен,
		|	ЕСТЬNULL(ОплатыКонтрагента.ОстатокОплаты, 0) КАК ОстатокОплаты,
		|	ЕСТЬNULL(ОплатыКонтрагента.СуммаОплаты, 0) КАК СуммаОплаты,
		|	ЕСТЬNULL(ОплатыКонтрагента.СуммаДолга, 0) КАК СуммаДолга,
		|	РабЛистыДанные.ОтсрочкаПлатежа КАК ОтсрочкаПлатежа,
		|	РабЛистыДанные.СуммаПредоплаты КАК СуммаПредоплаты
		|ИЗ
		|	РабЛистыДанные КАК РабЛистыДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОплатыКонтрагента КАК ОплатыКонтрагента
		|		ПО РабЛистыДанные.Клиент = ОплатыКонтрагента.Контрагент
		|			И РабЛистыДанные.ДоговорВзаиморасчетов = ОплатыКонтрагента.ДоговорВзаиморасчетов";	
	ЗапросОплата.УстановитьПараметр("РабочийЛист", РабочийЛист);
	ЗапросОплата.УстановитьПараметр("Ссылка", Договор);	

	Выборка = ЗапросОплата.Выполнить().Выбрать();
	СуммаОплаты = 0;
	
	ИспользуетсяОтсрочкаПлатежа = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ИспользуетсяОтсрочкаПлатежа;
	
	Если Выборка.Следующий() Тогда
		СуммаОплаты = Выборка.СуммаОплаты;	
		Если ИспользуетсяОтсрочкаПлатежа и Выборка.ОтсрочкаПлатежа<>0 Тогда
			ПараметрыОткрытия.Вставить("Проверка_ОплатаПокупателя",Выборка.СуммаОплаты >= Выборка.СуммаПредоплаты);
		Иначе	
			ПараметрыОткрытия.Вставить("Проверка_ОплатаПокупателя",Выборка.СуммаОплаты >= ЦенаДоговора);
		КонецЕсли;
	Иначе
		ПараметрыОткрытия.Вставить("Проверка_ОплатаПокупателя",Ложь);
	КонецЕсли;
	ПараметрыОткрытия.Вставить("ОплатаПокупателя",СуммаОплаты);
	
	Если ПроверкаРеализации Тогда
		
		Элементы.Группа11.Видимость = Ложь;
		Элементы.Группа13.Видимость = Ложь;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказНаряд.Ссылка КАК ЗаказНаряд
			|ИЗ
			|	Документ.ЗаказНаряд КАК ЗаказНаряд
			|ГДЕ
			|	ЗаказНаряд.Автомобиль = &Автомобиль
			|	И НЕ ЗаказНаряд.ПометкаУдаления
			|	И ЗаказНаряд.DMS_СтатусЗаказНаряда <> ЗНАЧЕНИЕ(Справочник.Renault_Advanced_СтатусыЗаказНарядов.Закрыт)
			|	И ЗаказНаряд.DMS_СтатусЗаказНаряда <> ЗНАЧЕНИЕ(Справочник.Renault_Advanced_СтатусыЗаказНарядов.ВОжиданииЗапчастей)
			|	И ЗаказНаряд.DMS_СтатусЗаказНаряда <> ЗНАЧЕНИЕ(Справочник.Renault_Advanced_СтатусыЗаказНарядов.Аннулирован)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗаказПокупателя.Ссылка
			|ИЗ
			|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_Advanced_ДополнительныеРеквизитыЗаказПокупателя КАК Renault_Advanced_ДополнительныеРеквизитыЗаказПокупателя
			|		ПО ЗаказПокупателя.Ссылка = Renault_Advanced_ДополнительныеРеквизитыЗаказПокупателя.Заказ
			|			И (ЗаказПокупателя.Автомобиль = &Автомобиль)
			|			И (Renault_Advanced_ДополнительныеРеквизитыЗаказПокупателя.Статус = ЗНАЧЕНИЕ(Справочник.Renault_Advanced_СтатусыЗаказНарядов.Закрыт))
			|			И (НЕ ЗаказПокупателя.ПометкаУдаления)
			|ГДЕ
			|	ЕСТЬNULL(Renault_Advanced_ДополнительныеРеквизитыЗаказПокупателя.Статус, ЗНАЧЕНИЕ(Справочник.Renault_Advanced_СтатусыЗаказНарядов.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Renault_Advanced_СтатусыЗаказНарядов.ПустаяСсылка)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗаказПокупателя.Ссылка
			|ИЗ
			|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_Advanced_ДополнительныеРеквизитыЗаказПокупателя КАК Renault_Advanced_ДополнительныеРеквизитыЗаказПокупателя
			|		ПО ЗаказПокупателя.Ссылка = Renault_Advanced_ДополнительныеРеквизитыЗаказПокупателя.Заказ
			|			И (ЗаказПокупателя.Автомобиль = &Автомобиль)
			|			И (Renault_Advanced_ДополнительныеРеквизитыЗаказПокупателя.Статус = ЗНАЧЕНИЕ(Справочник.Renault_Advanced_СтатусыЗаказНарядов.ВОжиданииЗапчастей))
			|			И (НЕ ЗаказПокупателя.ПометкаУдаления)
			|ГДЕ
			|	ЕСТЬNULL(Renault_Advanced_ДополнительныеРеквизитыЗаказПокупателя.Статус, ЗНАЧЕНИЕ(Справочник.Renault_Advanced_СтатусыЗаказНарядов.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Renault_Advanced_СтатусыЗаказНарядов.ПустаяСсылка)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗаказПокупателя.Ссылка
			|ИЗ
			|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_Advanced_ДополнительныеРеквизитыЗаказПокупателя КАК Renault_Advanced_ДополнительныеРеквизитыЗаказПокупателя
			|		ПО ЗаказПокупателя.Ссылка = Renault_Advanced_ДополнительныеРеквизитыЗаказПокупателя.Заказ
			|			И (ЗаказПокупателя.Автомобиль = &Автомобиль)
			|			И (Renault_Advanced_ДополнительныеРеквизитыЗаказПокупателя.Статус = ЗНАЧЕНИЕ(Справочник.Renault_Advanced_СтатусыЗаказНарядов.Аннулирован))
			|			И (НЕ ЗаказПокупателя.ПометкаУдаления)
			|ГДЕ
			|	ЕСТЬNULL(Renault_Advanced_ДополнительныеРеквизитыЗаказПокупателя.Статус, ЗНАЧЕНИЕ(Справочник.Renault_Advanced_СтатусыЗаказНарядов.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Renault_Advanced_СтатусыЗаказНарядов.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
		
		Выборка = Запрос.Выполнить().Выбрать();
		ВыполнениеЗаказов = Истина;
		ЦенаПродажи = 0;
		ПараметрыОткрытия.Вставить("Проверка_ВыполнениеЗаказов",Истина);
		Если Выборка.Следующий() Тогда
			ВыполнениеЗаказов = Выборка.ЗаказНаряд;	
			ПараметрыОткрытия.Вставить("Проверка_ВыполнениеЗаказов",Ложь);
		КонецЕсли;
		ПараметрыОткрытия.Вставить("ВыполнениеЗаказов",ВыполнениеЗаказов);
	Иначе
		Элементы.Группа16.Видимость = Ложь;
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПродажиАвтомобилейОбороты.Регистратор КАК Реализация,
			|	ПродажиАвтомобилейОбороты.СуммаОборот КАК СуммаПродажи
			|ИЗ
			|	РегистрНакопления.ПродажиАвтомобилей.Обороты(, , Регистратор, Автомобиль = &Автомобиль) КАК ПродажиАвтомобилейОбороты
			|ГДЕ
			|	ПродажиАвтомобилейОбороты.Регистратор ССЫЛКА Документ.РеализацияАвтомобилей";
		
		Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Реализация = Документы.РеализацияАвтомобилей.ПустаяСсылка();
		ЦенаПродажи = 0;
		ПараметрыОткрытия.Вставить("Проверка_Реализация",Истина);
		ПараметрыОткрытия.Вставить("Проверка_ЦенаПродажи",Истина);
		Если Выборка.Следующий() Тогда
			Реализация = Выборка.Реализация;	
			ЦенаПродажи = Выборка.СуммаПродажи;
			Если ЦенаПродажи < ЦенаДоговора Тогда
				ПараметрыОткрытия.Вставить("Проверка_ЦенаПродажи",Ложь);
			КонецЕсли;
		Иначе
			ПараметрыОткрытия.Вставить("Проверка_Реализация",Ложь);
			ПараметрыОткрытия.Вставить("Проверка_ЦенаПродажи",Ложь);
		КонецЕсли;
		ПараметрыОткрытия.Вставить("Реализация",Реализация);
		ПараметрыОткрытия.Вставить("ЦенаПродажи",ЦенаПродажи);
	КонецЕсли;
	
	ПараметрыОткрытия.Вставить("Проверка_Готов", НЕ Отказ);
	
	Возврат Не Отказ;
	
КонецФункции


///////////////////////////////////////////////////////////////////////////////////////////////////
////////// Процедуры и функции общего назначения                                         //////////
///////////////////////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ОбновитьДанныеПоАвтомобилю()
	
	Если ПараметрыОткрытия <> Неопределено Тогда
		ВывестиДанные(ПараметрыОткрытия, "ТипАвтомобиля"        , ПараметрыОткрытия.ТипАвтомобиля                                               , "На продажу",ЗначениеЗаполнено(АнализируемыйАвтомобиль));
		ВывестиДанные(ПараметрыОткрытия, "Договор"              , ?(ПараметрыОткрытия.Проверка_Договор, ПараметрыОткрытия.Договор, "Отсутствует"), "Оформлен"                       , Истина);
		ВывестиДанные(ПараметрыОткрытия, "СтатусДоговора"       , ПараметрыОткрытия.СтатусДоговора                                          	, "Подписан",ЗначениеЗаполнено(ПараметрыОткрытия.Договор));
		ВывестиДанные(ПараметрыОткрытия, "ЦенаДоговора"         , ПараметрыОткрытия.ЦенаДоговора                                                , "Установлена"          , Истина);
		ВывестиДанные(ПараметрыОткрытия, "СкладКомпании"        , ?(ПараметрыОткрытия.Проверка_СкладКомпании, ПараметрыОткрытия.СкладКомпании, "Отсутствует на складе"), "На складе" , Истина);
		ВывестиДанные(ПараметрыОткрытия, "ДокументПоступления"  , ?(ПараметрыОткрытия.Проверка_ДокументПоступления, ПараметрыОткрытия.ДокументПоступления,"Отсутствует"), "Оформлен"  , Истина);
		ВывестиДанные(ПараметрыОткрытия, "ОплатаПоставщику"     , ?(ПараметрыОткрытия.Проверка_ОплатаПоставщику, "Оплачено", "Не оплачено")      , "Оплачено"             , Истина);
		ВывестиДанные(ПараметрыОткрытия, "ПТС"                  , ?(ПараметрыОткрытия.Проверка_ПТС, ПараметрыОткрытия.ПТС, "Отсутствует")        , "Номер ПТС"            , Истина);
		// Ковалев ЕС от 19.10.2018 
		// Закомментировано по задаче:
		// http://217.23.136.86/browse/DMSL-309
		// На форме скрыта группа "Группа14". Основной код получения оплаты оставлен, если придется восстановить. 
		//ВывестиДанные(ПараметрыОткрытия, "ОплатаПокупателя"     , ПараметрыОткрытия.ОплатаПокупателя  											 , "Равна сумме продажи"            , Истина);
		Если ПараметрыОткрытия.Свойство("ЦенаПродажи") Тогда
			ВывестиДанные(ПараметрыОткрытия, "ЦенаПродажи"  , ПараметрыОткрытия.ЦенаПродажи, "Не меньше суммы по договору", Истина);
		КонецЕсли;
		Если ПараметрыОткрытия.Свойство("Реализация") Тогда
			ВывестиДанные(ПараметрыОткрытия, "Реализация" , ?(ПараметрыОткрытия.Проверка_Реализация, ПараметрыОткрытия.Реализация,"Отсутствует"), "Оформлена"            , Истина);
		КонецЕсли;
		Если ПараметрыОткрытия.Свойство("ВыполнениеЗаказов") Тогда
			ВывестиДанные(ПараметрыОткрытия, "ВыполнениеЗаказов" , ?(ПараметрыОткрытия.Проверка_ВыполнениеЗаказов, "Закрыты", "Не закрыты"), "Закрыты"            , Истина);
		КонецЕсли;
		ВывестиДанные(ПараметрыОткрытия, "Готов"                ,                                                         , ""                     , Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиДанные(ДанныеСтроки, ИмяЭлемента, ЗаголовокТекущее, ЗаголовокТребуется, Отображать)
	
	ЭлементНадпись   = Элементы.Найти("Надпись_" + ИмяЭлемента);
	ЭлементТекущее   = Элементы.Найти("Текущее_" + ИмяЭлемента);
	ЭлементТребуется = Элементы.Найти("Требуется_" + ИмяЭлемента);
	ЭлементКартинка  = Элементы.Найти("Картинка_" + ИмяЭлемента);
	Проверка         = Неопределено;
	
	Если ЭлементНадпись <> Неопределено Тогда
		ЭлементНадпись.Видимость = Отображать;
	КонецЕсли;
	
	Если ЭлементТекущее <> Неопределено Тогда
		ЭлементТекущее.Видимость = Отображать;
		ЭлементТекущее.Заголовок = ЗаголовокТекущее;
	КонецЕсли;
	
	Если ЭлементТребуется <> Неопределено Тогда
		ЭлементТребуется.Видимость = Отображать;
		ЭлементТребуется.Заголовок = ЗаголовокТребуется;
	КонецЕсли;
	
	Если ЭлементКартинка <> Неопределено Тогда
		ЭлементКартинка.Видимость = Отображать;
		ЭлементКартинка.Картинка  = ?(ДанныеСтроки.Свойство("Проверка_" + ИмяЭлемента, Проверка), ?(Проверка, Элементы.КартинкаГотов.Картинка, Элементы.КартинкаНеГотов.Картинка), Новый Картинка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьДанныеПоАвтомобилю();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Закрыть(МожноВыдавать);
	
КонецПроцедуры


