//Бондаренко++ 20201016
Процедура ЗагрузкаПрайсаСузукиИзФайлаЭксель(Параметры = Неопределено) Экспорт
	
	СтрокВДокументеЦен = 1000;
	ЭтоСузуки = Истина;
	ПодразделениеЦен = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000239");
	ТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенПродажи;
	НачальнаяСтрокаФайла = 2;
	КонечнаяСтрокаФайла = 1000000;
	ЗагружатьТолькоСуществующиеПозиции = Ложь;
	СоздаватьПодкаталогиПоДопСвойству = Ложь;
	КаталогДляНовойНоменклатуры = Справочники.Номенклатура.Загруженно;
	
	Попытка
        Excel = новый COMОбъект("Excel.Application");
    Исключение
         Возврат;
	КонецПопытки;
		
	Попытка
 	   	Книга =  Excel.Workbooks.Open("\\sokolmotors.lan\global\Avtoliga\Сервис\Общедоступные\Прайсы\ПрайсСузуки.xlsx" );
 	    Версия = Лев(Excel.Version,Найти(Excel.Version,".")-1);
		КоличествоСтрок = 0;
		Если Версия = "8" тогда
	        КоличествоСтрок   = Excel.Cells.CurrentRegion.Rows.Count;
	    Иначе
	        КоличествоСтрок   = Excel.Cells(1,1).SpecialCells(11).Row;
		Конецесли;
		
		//НачатьТранзакцию();
		
		ТаблицаРезультат = Новый ТаблицаЗначений();
		ТаблицаРезультат.Колонки.Добавить("Артикул", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(25)));
		ТаблицаРезультат.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
		ТаблицаРезультат.Колонки.Добавить("НаименованиеПолное", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(300)));
		ТаблицаРезультат.Колонки.Добавить("ДопСвойство", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
		ТаблицаРезультат.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10,2)));
		
		Для СЧ = НачальнаяСтрокаФайла По КонечнаяСтрокаФайла Цикл
			СтрокаТаблицы = ТаблицаРезультат.Добавить();
			СтрокаТаблицы.Артикул = СтрЗаменить(СокрЛП(Excel.Cells(СЧ, 1).Value),Символы.НПП,"");
			Если ЭтоСузуки Тогда
				СтрокаТаблицы.Наименование = СокрЛП(Excel.Cells(СЧ, 2).Value);
				СтрокаТаблицы.НаименованиеПолное = СокрЛП(Excel.Cells(СЧ, 2).Value);
				СтрокаТаблицы.ДопСвойство = СокрЛП(Excel.Cells(СЧ, 8).Value);
 				Если ТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенПродажи Тогда
					СтрокаТаблицы.Цена = Число(Excel.Cells(СЧ, 6).Value);
  				КонецЕсли; 
			Иначе
				СтрокаТаблицы.Наименование = СокрЛП(Excel.Cells(СЧ, 6).Value);
				СтрокаТаблицы.НаименованиеПолное = СокрЛП(Excel.Cells(СЧ, 6).Value);
				СтрокаТаблицы.ДопСвойство = СокрЛП(Excel.Cells(СЧ, 9).Value);
 				Если ТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенПродажи Тогда
					СтрокаТаблицы.Цена = Число(Excel.Cells(СЧ, 3).Value)*1.2;
 				КонецЕсли; 
 			КонецЕсли; 
  			//Состояние("Обрабатывается файл Excel обработано " + СЧ +"/"+КоличествоСтрок);
			//Сообщить("Обрабатывается файл Excel обработано " + СЧ +"/"+КоличествоСтрок);
			Если СЧ = КонечнаяСтрокаФайла Тогда
//				ЗафиксироватьТранзакцию();
			    Прервать;
 			КонецЕсли; 
		КОнецЦикла;
		
		Excel.Quit();
		Excel = Неопределено;
	Исключение
		//
	КонецПопытки;	
  	
	Если ТипЗнч(ТаблицаРезультат)<>Тип("ТаблицаЗначений") ИЛИ ТаблицаРезультат.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
 	ЗапросНоменклатуры = Новый Запрос();
	ЗапросНоменклатуры.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
 
		ЗапросНоменклатуры.Текст = "ВЫБРАТЬ
		|	ТаблицаРезультат.Артикул,
		|	ТаблицаРезультат.Наименование,
		|	ТаблицаРезультат.НаименованиеПолное,
		|	ТаблицаРезультат.ДопСвойство,
		|	ТаблицаРезультат.Цена
		|ПОМЕСТИТЬ ТаблицаРезультат
		|ИЗ
		|	&ТаблицаРезультат КАК ТаблицаРезультат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаРезультат.Артикул,
		|	ТаблицаРезультат.Наименование,
		|	ТаблицаРезультат.НаименованиеПолное,
		|	ТаблицаРезультат.ДопСвойство,
		|	МАКСИМУМ(ТаблицаРезультат.Цена) КАК Цена,
		|	Номенклатура.Ссылка КАК Номенклатура
		|ИЗ
		|	ТаблицаРезультат КАК ТаблицаРезультат
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО ТаблицаРезультат.Артикул = Номенклатура.Артикул
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаРезультат.Артикул,
		|	ТаблицаРезультат.Наименование,
		|	ТаблицаРезультат.НаименованиеПолное,
		|	ТаблицаРезультат.ДопСвойство,
		|	Номенклатура.Ссылка";
  	ЗапросНоменклатуры.УстановитьПараметр("ТаблицаРезультат", ТаблицаРезультат);
	Если ЗагружатьТолькоСуществующиеПозиции Тогда
		ЗапросНоменклатуры.Текст = СтрЗаменить(ЗапросНоменклатуры.Текст, "ЛЕВОЕ СОЕДИНЕНИЕ", "ВНУТРЕННЕЕ СОЕДИНЕНИЕ");
	КонецЕсли;
	//НачатьТранзакцию();
	РезультатЗапросаНоменклатуры 							= ЗапросНоменклатуры.Выполнить().Выбрать();
	ДокументУстановкиЦен 									= Документы.ИзменениеЦен.СоздатьДокумент();
	ДокументУстановкиЦен.Автор 								= ПараметрыСеанса.Пользователь;
	ДокументУстановкиЦен.Дата 								= ТекущаяДата();
	ДокументУстановкиЦен.Организация 						= ПодразделениеЦен.Организация;
	ДокументУстановкиЦен.ПодразделениеКомпании 				= ПодразделениеЦен;
	ДокументУстановкиЦен.ПодразделениеКомпанииПолучатель 	= ПодразделениеЦен;
	ДокументУстановкиЦен.ТипЦен 							= ТипЦен;
	ДокументУстановкиЦен.ВалютаДокумента 					= Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	ДокументУстановкиЦен.КурсДокумента 						= 1;
	ДокументУстановкиЦен.ДатаНачалаДействия 				= ТекущаяДата();
	ДокументУстановкиЦен.Комментарий 						= "Документ создан автоматически при обработке файла прайс-листа " + Формат(ТекущаяДата(), "ДЛФ=DD");
	
	СЧ = 0;
	жи = 0;
	КоличествоСозданныхДокументов = 0;
	КоличествоСтрок = РезультатЗапросаНоменклатуры.Количество();
	Пока РезультатЗапросаНоменклатуры.Следующий() Цикл
//		ОбработкаПрерыванияПользователя();
		СЧ = СЧ + 1;
		жи = жи  + 1;
	 	
		Если жи >= КонечнаяСтрокаФайла Тогда
//			Сообщить("Обработка завершена при достижении строки: "+ ЭтотОбъект.КонечнаяСтрокаФайла,СтатусСообщения.ОченьВажное);
//			НачатьТранзакцию();
			Если ДокументУстановкиЦен.Товары.Количество() <> 0 Тогда
				Попытка
					ДокументУстановкиЦен.Записать(РежимЗаписиДокумента.Проведение);
//	   				Сообщить("Проведен документ: " + ДокументУстановкиЦен);
				Исключение
					ДокументУстановкиЦен.Записать(РежимЗаписиДокумента.Запись);
//  				Сообщить("Записан, но не проведен документ: " + ДокументУстановкиЦен);
				КонецПопытки;
			КонецЕсли;
// 			ЗафиксироватьТранзакцию();
		    Возврат;
 		КонецЕсли; 
		
		Если СтрокВДокументеЦен <> 0 И СЧ >= СтрокВДокументеЦен Тогда
			Если ДокументУстановкиЦен.Товары.Количество() <> 0 Тогда
//				НачатьТранзакцию();
 				Попытка
					ДокументУстановкиЦен.Записать(РежимЗаписиДокумента.Проведение);
//  				Сообщить("Проведен документ: " + ДокументУстановкиЦен);
				Исключение
					ДокументУстановкиЦен.Записать(РежимЗаписиДокумента.Запись);
//   				Сообщить("Записан, но не проведен документ: " + ДокументУстановкиЦен);
				КонецПопытки;
//				ЗафиксироватьТранзакцию();
			КонецЕсли;	
 			
			ДокументУстановкиЦен 									= Документы.ИзменениеЦен.СоздатьДокумент();
			ДокументУстановкиЦен.Автор	 							= ПараметрыСеанса.Пользователь;
			ДокументУстановкиЦен.Дата 								= ТекущаяДата();
			ДокументУстановкиЦен.Организация 						= ПодразделениеЦен.Организация;
			ДокументУстановкиЦен.ПодразделениеКомпании 				= ПодразделениеЦен;
			ДокументУстановкиЦен.ПодразделениеКомпанииПолучатель	= ПодразделениеЦен;
			ДокументУстановкиЦен.ТипЦен 							= ТипЦен;
			ДокументУстановкиЦен.ВалютаДокумента 					= Справочники.Валюты.НайтиПоКоду("643");
			ДокументУстановкиЦен.КурсДокумента 						= 1;
			ДокументУстановкиЦен.ДатаНачалаДействия 				= ТекущаяДата();
		    ДокументУстановкиЦен.Комментарий 						= "Документ создан автоматически при обработке файла прайс-листа " + Формат(ТекущаяДата(), "ДЛФ=DD");
			
			СЧ = 0;
			КоличествоСозданныхДокументов = КоличествоСозданныхДокументов + 1;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(РезультатЗапросаНоменклатуры.Номенклатура) Тогда
			НоменклатураОбъект 							= Справочники.Номенклатура.СоздатьЭлемент();
			НоменклатураОбъект.Артикул 					= РезультатЗапросаНоменклатуры.Артикул;
			НоменклатураОбъект.Наименование 			= РезультатЗапросаНоменклатуры.Наименование;
			НоменклатураОбъект.НаименованиеИностранное  = РезультатЗапросаНоменклатуры.Наименование;
			НоменклатураОбъект.НаименованиеПолное 		= РезультатЗапросаНоменклатуры.НаименованиеПолное;
  			НоменклатураОбъект.ТипНоменклатуры 			= Справочники.ТипыНоменклатуры.Штучный;
			НоменклатураОбъект.ВидНоменклатуры 			= Перечисления.ВидыНоменклатуры.Товар;
			НоменклатураОбъект.БазоваяЕдиницаИзмерения 	= Справочники.КлассификаторЕдиницИзмерения.шт;
			 
			НоменклатураОбъект.Производитель 			= Справочники.Производители.Suzuki;
			НоменклатураОбъект.СтранаПроисхождения 		= НоменклатураОбъект.Производитель.СтранаПроисхождения;
			НоменклатураОбъект.СтавкаНДС				= Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
			НоменклатураОбъект.ВалютаУчета				= Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
			
	 		СсылкаЕИ = Справочники.ЕдиницыИзмерения.НайтиПоРеквизиту("ЕдиницаПоКлассификатору", Справочники.КлассификаторЕдиницИзмерения.шт,,НоменклатураОбъект.Ссылка);
			//постобработка - связанные данные
			//СсылкаЕИ =Справочники.ЕдиницыИзмерения.НайтиПоНаименованию("шт",Истина,,СпрОбъект.Ссылка);
			Если НЕ СсылкаЕИ.Пустая() Тогда
				НоменклатураОбъект.ОсновнаяЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоРеквизиту("ЕдиницаПоКлассификатору", Справочники.КлассификаторЕдиницИзмерения.шт,,НоменклатураОбъект.Ссылка);
			Иначе	
				ОбъектЕИ=Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
				ОбъектЕИ.ЕдиницаПоКлассификатору = Справочники.КлассификаторЕдиницИзмерения.шт;
				ОбъектЕИ.Коэффициент = 1;
				ОбъектЕИ.Владелец=НоменклатураОбъект.Ссылка;
				ОбъектЕИ.Наименование="шт";
				ОбъектЕИ.ОбменДанными.Загрузка = Истина;
				ОбъектЕИ.Записать();
				НоменклатураОбъект.ОсновнаяЕдиницаИзмерения = ОбъектЕИ.Ссылка;
				НоменклатураОбъект.ОбменДанными.Загрузка = Истина;
				Попытка
					НоменклатураОбъект.Записать();
				Исключение
					//Сообщить("1 ОШИБКА! Не удалось записать номенклатуру с : ["+РезультатЗапросаНоменклатуры.Артикул+"] "+РезультатЗапросаНоменклатуры.Наименование);
					Продолжить;			
				КонецПопытки; 
	
			КонецЕсли;
 			
			Если СоздаватьПодкаталогиПоДопСвойству Тогда
				КаталогРодитель = Справочники.Номенклатура.НайтиПоНаименованию(СокрЛП(РезультатЗапросаНоменклатуры.ДопСвойство), истина, КаталогДляНовойНоменклатуры);
				Если НЕ ЗначениеЗаполнено(КаталогРодитель) ТОгда
					РодительОбъект 				= Справочники.Номенклатура.СоздатьГруппу();
					РодительОбъект.Наименование = СокрЛП(РезультатЗапросаНоменклатуры.ДопСвойство);
					РодительОбъект.Родитель 	= КаталогДляНовойНоменклатуры;
					Попытка
						РодительОбъект.Записать();
					Исключение
						//Сообщить("3 ОШИБКА! Не удалось записать группу с родителем: ["+КаталогДляНовойНоменклатуры+"] "+СокрЛП(РезультатЗапросаНоменклатуры.ДопСвойство));
						Продолжить;			
					КонецПопытки;
					КаталогРодитель = РодительОбъект.Ссылка;
				КонецЕсли;
				НоменклатураОбъект.Родитель = КаталогРодитель;
			Иначе
				НоменклатураОбъект.Родитель = КаталогДляНовойНоменклатуры;
			КонецЕсли;
			Если обЗначениеНеЗаполнено(НоменклатураОбъект.Код) Тогда
				НоменклатураОбъект.УстановитьНовыйКод("ЦБ");
 			КонецЕсли; 
			Попытка
				НоменклатураОбъект.Записать();
			Исключение
				//Сообщить("2 ОШИБКА! Не удалось записать номенклатуру с : ["+РезультатЗапросаНоменклатуры.Артикул+"] "+РезультатЗапросаНоменклатуры.Наименование);
				Продолжить;			
			КонецПопытки; 
			 
			
			НоменклатураСсылка = НоменклатураОбъект.Ссылка;
		Иначе
			НоменклатураСсылка = РезультатЗапросаНоменклатуры.Номенклатура;
		КонецЕсли;
		
		СтрокаДокумента 				= ДокументУстановкиЦен.Товары.Добавить();
		СтрокаДокумента.Номенклатура 	= НоменклатураСсылка;
		ДокументУстановкиЦен.ОбработкаРеквизита("Товары.Номенклатура", СтрокаДокумента);
		СтрокаДокумента.Цена 			= Число(СтрЗаменить(СтрЗаменить(РезультатЗапросаНоменклатуры.Цена,Символы.НПП,""),",","."));
		//Состояние("Обработано " + (СЧ + КоличествоСозданныхДокументов*СтрокВДокументеЦен) + "/"+ КоличествоСтрок + " (для перывания загрузки нажмите Ctrl + Break)");
	КонецЦикла;
	
//	НачатьТранзакцию();
	Если ДокументУстановкиЦен.Товары.Количество() <> 0 Тогда
		Попытка
			ДокументУстановкиЦен.Записать(РежимЗаписиДокумента.Проведение);
			//Сообщить("Проведен документ: " + ДокументУстановкиЦен);
		Исключение
			ДокументУстановкиЦен.Записать(РежимЗаписиДокумента.Запись);
			//Сообщить("Записан, но не проведен документ: " + ДокументУстановкиЦен);
		КОнецПопытки;
	КонецЕсли;
//	ЗафиксироватьТранзакцию();
 
КонецПроцедуры
//Бондаренко++ 20201016 


 

