&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыФормы=Новый Структура("ТабПроценки",Параметры.ТабПроценки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.ЗакрыватьПриЗакрытииВладельца=Истина;
	ВладелецОбъект = ЭтаФорма.ВладелецФормы.Объект;
	СборДанныхНаСервере();
КонецПроцедуры

&НаСервере
Процедура СборДанныхНаСервере()
	Обработка=РеквизитФормыВЗначение("Объект");
	ПутьКВременнойПапке=КаталогВременныхФайлов();
	ИмяМакета="ПроценкиНовый";
	Макет=Обработка.ПолучитьМакет(ИмяМакета);
	ИмяФайла=?(Прав(ПутьКВременнойПапке,1)="\","","\")+ИмяМакета+".json";
	Макет.Записать(ИмяФайла);
	ТекДок=Новый ТекстовыйДокумент;
	ТекДок.Прочитать(ИмяФайла);
	УдалитьФайлы(ПутьКВременнойПапке,ИмяМакета+".json");
	Текст=ТекДок.ПолучитьТекст();
	Проценки=Обработка.UnJSON(Текст);
	
	Если Проценки=Неопределено Тогда
		Сообщить("Ошибки в данных, загрузка не выполнена");
		Возврат;
	КонецЕсли;
    	
	ТабПроценки = ДанныеФормыВЗначение(ПараметрыФормы.ТабПроценки,Тип("ТаблицаЗначений"));
	
	Для Каждого Стр Из Проценки Цикл
		Нов=ГрупповаяЗагрузка.Добавить();
		Нов.Сайт = Стр.Сайт;
		Нов.Данные = Стр;
		Если ТабПроценки.Найти(Стр.Сайт,"Сайт") <> Неопределено Тогда
			Нов.Загружать = Истина;
		КонецЕсли;
				
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсё(Команда)
	Для каждого Запись из ГрупповаяЗагрузка Цикл
		Запись.Загружать=Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсё(Команда)
	Для каждого Запись из ГрупповаяЗагрузка Цикл
		Запись.Загружать=Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузку(Команда)
	ЭтаФорма.Закрыть(ГрупповаяЗагрузка);
КонецПроцедуры  

&НаСервере
Процедура ВыполнитьНаСервере()
	Обработка=РеквизитФормыВЗначение("Объект");
	Для Каждого Стр Из ГрупповаяЗагрузка Цикл
		Если Стр.Загружать Тогда
			ПараметрыФормы.Вставить(Стр.Наименование);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


