&НаКлиенте
Процедура УстановитьОтборыСписков(Клиент)
		
	Полисы.Параметры.Элементы.Найти("Контрагент").Значение=Запись.Клиент;
	Полисы.Параметры.Элементы.Найти("Контрагент").Использование=Истина;
	Полисы.Параметры.Элементы.Найти("ТекущаяДата").Значение=ТекущаяДата();
	Полисы.Параметры.Элементы.Найти("ТекущаяДата").Использование=Истина;

	ИсторияВзаимодействияПоКлиенту.Параметры.Элементы.Найти("Клиент").Значение=Запись.Клиент;
	ИсторияВзаимодействияПоКлиенту.Параметры.Элементы.Найти("Клиент").Использование=Истина;
	
	Пользователь = ПараметрыСеанса.Пользователь;
	
	ИсторияВзаимодействияПоКлиенту.Параметры.Элементы.Найти("Отдел").Значение=?(ЗначениеЗаполнено(Пользователь.Сотрудник), Справочники.CRM_Отделы.ПолучитьОтделыСотрудника(Пользователь.Сотрудник), Новый СписокЗначений);
	ИсторияВзаимодействияПоКлиенту.Параметры.Элементы.Найти("Отдел").Использование=Истина;

	ИсторияВзаимодействияПоКлиенту.Параметры.Элементы.Найти("Подразделение").Значение=?(ЗначениеЗаполнено(Пользователь.Сотрудник), Пользователь.Сотрудник.Подразделение, Справочники.ПодразделенияКомпании.ПустаяСсылка());
	ИсторияВзаимодействияПоКлиенту.Параметры.Элементы.Найти("Подразделение").Использование=Истина;

	ИсторияВзаимодействияПоКлиенту.Параметры.Элементы.Найти("Пользователь").Значение=Пользователь;
	ИсторияВзаимодействияПоКлиенту.Параметры.Элементы.Найти("Пользователь").Использование=Истина;
	
	ИсторияВзаимодействияПоКлиенту.Параметры.Элементы.Найти("РуководительОФУ").Значение=ПараметрыСеанса.Renault_ПраваПользователя.Ссылка.РуководительОФУ;
	ИсторияВзаимодействияПоКлиенту.Параметры.Элементы.Найти("РуководительОФУ").Использование=Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборыСписков(Запись.Клиент);

КонецПроцедуры

&НаКлиенте
Процедура ПрослушатьЗапись(Команда)
	
	ТекКоммуникация = Элементы.ИсторияВзаимодействияПоКлиенту.ТекущиеДанные;
	
	Если ТекКоммуникация <> Неопределено Тогда		
		ПрослушатьЗаписьНаСервере(ТекКоммуникация.ФайлЗаписиРазговора);	 
	Иначе
		Сообщить("Выберите строку истории коммуникации по клиенту"); 
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПрослушатьЗаписьНаСервере(ФайлЗаписиРазговора)
	
	ЗапуститьПриложение(Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].АдресХраненияЗаписейРазговоров +"\"+ ФайлЗаписиРазговора);

КонецПроцедуры

&НаКлиенте
Процедура ИсторияВзаимодействияПоКлиентуПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ИсторияВзаимодействияПоКлиенту.ТекущиеДанные <> Неопределено Тогда
		Элементы.ПрослушатьЗапись.Доступность = ЗначениеЗаполнено(Элементы.ИсторияВзаимодействияПоКлиенту.ТекущиеДанные.ФайлЗаписиРазговора);
	Иначе
		Элементы.ПрослушатьЗапись.Доступность = Ложь;
	КонецЕсли;

КонецПроцедуры
