&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	ТекБаза=Renault_ПередачаДанныхВСторонниеСистемы.ТекущаяБазаДанных();
	
	НомерПоследнегоЗагруженногоПакета=ПолучитьНомерПакета();
	Запрос=Новый Запрос("Выбрать Ссылка Из ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.БазыДанных ГДЕ Ссылка<>&ТекБаза");
	Запрос.УстановитьПараметр("ТекБаза",ТекБаза);
	Выборка=Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество()=1 Тогда 
		Выборка.Следующий();
		БазаДанных=Выборка.Ссылка;
		НомерПоследнегоВыгруженногоПакета=НомерВыгруженногоПакета();
	КонецЕсли;
	
	//ограничим список баз - все кроме текущей
	Для Каждого База Из Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка") Цикл
		Элементы.БазаДанных.СписокВыбора.Добавить(База,,,?(База=ТекБаза,БиблиотекаКартинок.Renault_ON,БиблиотекаКартинок.Renault_OFF))	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура кнВыполнить(Команда)
	Если БазаДанных.Пустая() Тогда Сообщить("Не выбрана база данных для обмена",СтатусСообщения.Информация); Возврат КонецЕсли;
	Если БазаДанных=Renault_ПередачаДанныхВСторонниеСистемы.ТекущаяБазаДанных() Тогда Сообщить("Нельзя выбирать собственную базу данных",СтатусСообщения.Внимание); Возврат КонецЕсли;
	ТекстОшибки="";
	Отказ=Ложь;
	Если Не ВыполнитьЗагрузку(ТекстОшибки,Отказ) Тогда
		Сообщить("В процессе загрузки возникли ошибки:"+Символы.ПС+ТекстОшибки,СтатусСообщения.Внимание);
	Иначе
		Если ТекстОшибки="" Тогда Сообщить("Загрузка завершена.",СтатусСообщения.Обычное);
		Иначе Сообщить("Загрузка завершена:"+Символы.ПС+ТекстОшибки,СтатусСообщения.Информация)
		КонецЕсли
	КонецЕсли;
	НомерПоследнегоЗагруженногоПакета=ПолучитьНомерПакета();
КонецПроцедуры
Функция ВыполнитьЗагрузку(ТекстОшибки,Отказ) 
	Возврат Renault_ПередачаДанныхВСторонниеСистемы.ЗагрузкаВыполнена(НомерПоследнегоЗагруженногоПакета,НомерПоследнегоВыгруженногоПакета,БазаДанных,ТекстОшибки,Отказ,Перезаписать)
КонецФункции	

Функция ПолучитьНомерПакета() Возврат Константы.Renault_НомерЗагруженногоПакета.Получить() КонецФункции

Функция НомерВыгруженногоПакета()
	Запрос=Новый Запрос("Выбрать Пакет Из ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.БазыДанных ГДЕ Ссылка=&Ссылка");
	Запрос.УстановитьПараметр("Ссылка",БазаДанных);
	Выборка=Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Пакет
КонецФункции 	

&НаКлиенте
Процедура БазаДанныхПриИзменении(Элемент) НомерПоследнегоВыгруженногоПакета=НомерВыгруженногоПакета() КонецПроцедуры
