
Процедура ОбновитьОсновногоКлиентаОкруженияРабочегоЛиста(РабочийЛист, КлиентРабочегоЛиста) Экспорт
	
	Набор = РегистрыСведений.Renault_ОкружениеРабочегоЛиста.СоздатьНаборЗаписей();
	Набор.Отбор.IDK.Установить(РабочийЛист);
	Набор.Отбор.Основной.Установить(Истина);
	Набор.Прочитать();
	Если Набор.Количество() > 0 Тогда
		Статус = Набор[0].Статус;
	КонецЕсли;
	Набор.Очистить();
	Запись = Набор.Добавить();
	Запись.IDK = РабочийЛист;
	Запись.Основной = Истина;
	Запись.Клиент = КлиентРабочегоЛиста;
	Запись.Статус = Статус;
	Набор.Записать();

КонецПроцедуры