

Процедура ПолучитьДанныеМаркетинговыхАкцийСервиса(ПараметрыВызоваСервера, АдресХранилища) Экспорт 
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	ПарольWS = Настройки.ПарольДоступаКВебСервисам;
	ЛогинWS = Настройки.ЛогинДоступаКВебСервисам;
	Адрес = Настройки.АдресWsGate;
	ОпределениеСервиса = Новый WSОпределения(СокрЛП(Адрес) + "ws/ServicesActionTab.ws?wsdl", ЛогинWS, ПарольWS);
	ВебСервис = Новый WSПрокси(
	ОпределениеСервиса, 
	"http://renault-nissan.com/schema/ServicesActionTab", 
	"Renault_ServicesActionTab",
	"Renault_ServicesActionTabSoap12",
	3600);
	ВебСервис.Пользователь  = ЛогинWS;
	ВебСервис.Пароль   = ПарольWS;
	
	ДЗ_XDTO = ВебСервис.GetData(ПараметрыВызоваСервера.Serials);
	ДЗ = СериализаторXDTO.ПрочитатьXDTO(ДЗ_XDTO);
	ПоместитьВоВременноеХранилище(ДЗ, АдресХранилища);
	
КонецПроцедуры
