#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьФИЛФизЛиц() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Контрагенты.Ссылка КАК ФизЛицо,
		|	Контрагенты.ДатаРождения КАК ДатаРождения,
		|	Контрагенты.Пол КАК Пол
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЧастноеЛицо)
		|	И Контрагенты.Наименование <> """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПотенциальныеКонтрагенты.Ссылка,
		|	ПотенциальныеКонтрагенты.ДатаРождения,
		|	ПотенциальныеКонтрагенты.Пол
		|ИЗ
		|	Справочник.CRM_ПотенциальныеКонтрагенты КАК ПотенциальныеКонтрагенты
		|ГДЕ
		|	ПотенциальныеКонтрагенты.Наименование <> """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ФизическиеЛица.Ссылка,
		|	ФизическиеЛица.ДатаРождения,
		|	ФизическиеЛица.Пол
		|ИЗ
		|	Справочник.Renault_ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.Наименование <> """"";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаФизЛиц = РезультатЗапроса.Выбрать();
		
	Пока ВыборкаФизЛиц.Следующий() Цикл
		DMS_ФизическиеЛицаСервер.ЗаписатьФИОФизическогоЛица(ВыборкаФизЛиц.ФизЛицо,ВыборкаФизЛиц.Пол,ВыборкаФизЛиц.ДатаРождения);	
	КонецЦикла;
	
	Попытка
		ПереформироватьФИО();
	Исключение
		Сообщить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации("Переформирование ФИО",УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры 

Процедура ПереформироватьФИО()
	ЗагрузитьИменаИОтчества();
КонецПроцедуры

Процедура ЗагрузитьИменаИОтчества()
					                                      
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаИменИОтчеств.Значение КАК Значение,
		|	ТаблицаИменИОтчеств.Тип КАК Тип
		|ПОМЕСТИТЬ мТаблица
		|ИЗ
		|	РегистрСведений.DMS_СправочнаяИнформацияПоФИО КАК ТаблицаИменИОтчеств
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	мТаблица.Значение КАК Значение,
		|	мТаблица.Тип КАК Тип,                                 
		|	ДанныеФизическихЛиц.ФизическоеЛицо,
		|	ДанныеФизическихЛиц.Фамилия,
		|	ДанныеФизическихЛиц.Имя,
		|	ДанныеФизическихЛиц.Отчество
		|ИЗ
		|	мТаблица КАК мТаблица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|		ПО (мТаблица.Тип = Значение(Перечисление.DMS_ТипыЗначенийФИО.Отчество))
		|			И (мТаблица.Значение = ДанныеФизическихЛиц.Имя
		|				ИЛИ мТаблица.Значение = ДанныеФизическихЛиц.Фамилия)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	мТаблица.Значение,
		|	мТаблица.Тип,
		|	ДанныеФизическихЛиц.ФизическоеЛицо,
		|	ДанныеФизическихЛиц.Фамилия,
		|	ДанныеФизическихЛиц.Имя,
		|	ДанныеФизическихЛиц.Отчество
		|ИЗ
		|	мТаблица КАК мТаблица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|		ПО (мТаблица.Тип = Значение(Перечисление.DMS_ТипыЗначенийФИО.Имя))
		|			И (мТаблица.Значение = ДанныеФизическихЛиц.Отчество
		|				ИЛИ мТаблица.Значение = ДанныеФизическихЛиц.Фамилия)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	мТаблица.Значение,
		|	мТаблица.Тип
		|ИЗ
		|	мТаблица КАК мТаблица";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаНесоответствий = РезультатЗапроса[1].Выбрать();
	ВыборкаИменОтчества	  = РезультатЗапроса[2].Выбрать();
		
	Пока ВыборкаНесоответствий.Следующий() Цикл
		
		ВыборкаИменОтчества.Сбросить();
		
		Если СтрДлина(СокрЛП(ВыборкаНесоответствий.Отчество)) = 1 
			И СтрДлина(СокрЛП(ВыборкаНесоответствий.Имя)) = 1 Тогда
			Продолжить;
		КонецЕсли; 
		
		Если ВыборкаНесоответствий.Тип = Перечисления.DMS_ТипыЗначенийФИО.Отчество Тогда
						
			СтруктураПоиска = Новый Структура("Тип,Значение",Перечисления.DMS_ТипыЗначенийФИО.Отчество,ВыборкаНесоответствий.Отчество);
			
			Если ВыборкаИменОтчества.НайтиСледующий(СтруктураПоиска) Тогда
				Продолжить;
			КонецЕсли; 
			
			ВыборкаИменОтчества.Сбросить();
			
			НовоеОтчество = ВыборкаНесоответствий.Значение;
			
			СтруктураПоиска = Новый Структура("Тип,Значение",Перечисления.DMS_ТипыЗначенийФИО.Имя,ВыборкаНесоответствий.Имя);
			
			Если ВыборкаИменОтчества.НайтиСледующий(СтруктураПоиска) Тогда
				НовоеИмя = ВыборкаНесоответствий.Имя;
			Иначе 
				НовоеИмя = "НеУказан";
			КонецЕсли; 
			
			ВыборкаИменОтчества.Сбросить();
			
			СтруктураПоискаИмя 		= Новый Структура("Тип,Значение",Перечисления.DMS_ТипыЗначенийФИО.Имя,		ВыборкаНесоответствий.Фамилия);
			СтруктураПоискаОтчество = Новый Структура("Тип,Значение",Перечисления.DMS_ТипыЗначенийФИО.Отчество, ВыборкаНесоответствий.Фамилия);
			
			НоваяФамилия = СокрЛП(ВыборкаНесоответствий.Фамилия);
			
			Если ВыборкаИменОтчества.НайтиСледующий(СтруктураПоискаИмя) Тогда 
				
				Если НовоеИмя = "НеУказан" Тогда
					НовоеИмя = СокрЛП(ВыборкаНесоответствий.Фамилия);
				КонецЕсли; 
				
				НоваяФамилия = "НеУказан";
				
			КонецЕсли; 
			
			ВыборкаИменОтчества.Сбросить();
			
			Если ВыборкаИменОтчества.НайтиСледующий(СтруктураПоискаОтчество) Тогда 
				
				Если НовоеОтчество = "НеУказан" Тогда
					НовоеОтчество = СокрЛП(ВыборкаНесоответствий.Фамилия);
				КонецЕсли; 
				
				НоваяФамилия = "НеУказан";
				
			КонецЕсли; 
			
			Если СокрЛП(НоваяФамилия) = СокрЛП(ВыборкаНесоответствий.Фамилия)
				И СокрЛП(НовоеИмя) = СокрЛП(ВыборкаНесоответствий.Имя) Тогда
				НовоеОтчество = СокрЛП(ВыборкаНесоответствий.Отчество);
			КонецЕсли;
			
			НовоеФИО = НоваяФамилия + " " + НовоеИмя + " " + НовоеОтчество;
			
			Если НоваяФамилия = "НеУказан" Тогда
			
				Если Найти(НовоеФИО,СокрЛП(ВыборкаНесоответствий.Фамилия)) = 0 Тогда
					НоваяФамилия = СокрЛП(ВыборкаНесоответствий.Фамилия);
				ИначеЕсли Найти(НовоеФИО,СокрЛП(ВыборкаНесоответствий.Отчество)) = 0 Тогда
					НоваяФамилия = СокрЛП(ВыборкаНесоответствий.Отчество);
				ИначеЕсли Найти(НовоеФИО,СокрЛП(ВыборкаНесоответствий.Имя)) = 0 Тогда
					НоваяФамилия = СокрЛП(ВыборкаНесоответствий.Имя);
				КонецЕсли;
			
			КонецЕсли; 
			
			НовоеФИО = НоваяФамилия + " " + НовоеИмя + " " + НовоеОтчество;
			
			НовоеФИО = СокрЛП(СтрЗаменить(НовоеФИО,"НеУказан",""));
			
			СформироватьФИОВРегистре(ВыборкаНесоответствий.ФизическоеЛицо,НовоеФИО,СокрЛП(СтрЗаменить(НоваяФамилия,"НеУказан","")),СокрЛП(СтрЗаменить(НовоеИмя,"НеУказан","")),СокрЛП(СтрЗаменить(НовоеОтчество,"НеУказан","")));
			
			НовоеФИО = "";
			
		ИначеЕсли ВыборкаНесоответствий.Тип = Перечисления.DMS_ТипыЗначенийФИО.Имя Тогда 	
			
			СтруктураПоиска = Новый Структура("Тип,Значение",Перечисления.DMS_ТипыЗначенийФИО.Имя,ВыборкаНесоответствий.Имя);
			
			Если ВыборкаИменОтчества.НайтиСледующий(СтруктураПоиска) Тогда
				Продолжить;
			КонецЕсли; 
			
			ВыборкаИменОтчества.Сбросить();
			
			НовоеИмя = ВыборкаНесоответствий.Значение;
			
			СтруктураПоиска = Новый Структура("Тип,Значение",Перечисления.DMS_ТипыЗначенийФИО.Отчество,ВыборкаНесоответствий.Отчество);
			
			Если ВыборкаИменОтчества.НайтиСледующий(СтруктураПоиска) Тогда
				НовоеОтчество = ВыборкаНесоответствий.Отчество;
			Иначе 
				НовоеОтчество = "НеУказан";
			КонецЕсли; 
			
			ВыборкаИменОтчества.Сбросить();
			
			СтруктураПоискаИмя 		= Новый Структура("Тип,Значение",Перечисления.DMS_ТипыЗначенийФИО.Имя, ВыборкаНесоответствий.Фамилия);
			СтруктураПоискаОтчество = Новый Структура("Тип,Значение",Перечисления.DMS_ТипыЗначенийФИО.Отчество, ВыборкаНесоответствий.Фамилия);
			
			НоваяФамилия = СокрЛП(ВыборкаНесоответствий.Фамилия);
			
			Если ВыборкаИменОтчества.НайтиСледующий(СтруктураПоискаИмя) Тогда 
				
				Если НовоеИмя = "НеУказан" Тогда
					НовоеИмя = СокрЛП(ВыборкаНесоответствий.Фамилия);
				КонецЕсли; 
				
				НоваяФамилия = "НеУказан";
				
			КонецЕсли; 
			
			ВыборкаИменОтчества.Сбросить();
			
			Если ВыборкаИменОтчества.НайтиСледующий(СтруктураПоискаОтчество) Тогда 
				
				Если НовоеОтчество = "НеУказан" Тогда
					НовоеОтчество = СокрЛП(ВыборкаНесоответствий.Фамилия);
				КонецЕсли; 
				
				НоваяФамилия = "НеУказан";
				
			КонецЕсли; 
			
			ВыборкаИменОтчества.Сбросить();
			
			Если СокрЛП(НоваяФамилия) = СокрЛП(ВыборкаНесоответствий.Фамилия)
				И СокрЛП(НовоеОтчество) = СокрЛП(ВыборкаНесоответствий.Отчество) Тогда
				НовоеИмя = СокрЛП(ВыборкаНесоответствий.Имя);
			КонецЕсли;
			
			НовоеФИО = НоваяФамилия + " " + НовоеИмя + " " + НовоеОтчество;
			
			Если НоваяФамилия = "НеУказан" Тогда
			
				Если Найти(НовоеФИО,СокрЛП(ВыборкаНесоответствий.Фамилия)) = 0 Тогда
					НоваяФамилия = СокрЛП(ВыборкаНесоответствий.Фамилия);
				ИначеЕсли Найти(НовоеФИО,СокрЛП(ВыборкаНесоответствий.Отчество)) = 0 Тогда
					НоваяФамилия = СокрЛП(ВыборкаНесоответствий.Отчество);
				ИначеЕсли Найти(НовоеФИО,СокрЛП(ВыборкаНесоответствий.Имя)) = 0 Тогда
					НоваяФамилия = СокрЛП(ВыборкаНесоответствий.Имя);
				КонецЕсли;
				
				Если НовоеОтчество = "НеУказан" Тогда
					
					СтруктураПоискаОтчество = Новый Структура("Тип,Значение",Перечисления.DMS_ТипыЗначенийФИО.Отчество, НоваяФамилия);
										
					Если ВыборкаИменОтчества.НайтиСледующий(СтруктураПоискаОтчество) Тогда 
						
						НовоеОтчество = СокрЛП(НоваяФамилия);
						
						НоваяФамилия = "НеУказан";
						
					КонецЕсли; 
					
				КонецЕсли;
				
			КонецЕсли; 
			
			НовоеФИО = НоваяФамилия + " " + НовоеИмя + " " + НовоеОтчество;
			
			Если НовоеОтчество = "НеУказан" Тогда
			
				Если Найти(НовоеФИО,СокрЛП(ВыборкаНесоответствий.Фамилия)) = 0 Тогда
					НовоеОтчество = СокрЛП(ВыборкаНесоответствий.Фамилия);
				ИначеЕсли Найти(НовоеФИО,СокрЛП(ВыборкаНесоответствий.Отчество)) = 0 Тогда
					НовоеОтчество = СокрЛП(ВыборкаНесоответствий.Отчество);
				ИначеЕсли Найти(НовоеФИО,СокрЛП(ВыборкаНесоответствий.Имя)) = 0 Тогда
					НовоеОтчество = СокрЛП(ВыборкаНесоответствий.Имя);
				КонецЕсли;
				
			КонецЕсли; 
			
			НовоеФИО = НоваяФамилия + " " + НовоеИмя + " " + НовоеОтчество;
			
			НовоеФИО = СокрЛП(СтрЗаменить(НовоеФИО,"НеУказан",""));
			
			СформироватьФИОВРегистре(ВыборкаНесоответствий.ФизическоеЛицо,НовоеФИО,СокрЛП(СтрЗаменить(НоваяФамилия,"НеУказан","")),СокрЛП(СтрЗаменить(НовоеИмя,"НеУказан","")),СокрЛП(СтрЗаменить(НовоеОтчество,"НеУказан","")));
			
			НовоеФИО = "";
                                                         
		КонецЕсли; 
		
	КонецЦикла; 
		
КонецПроцедуры

Процедура СформироватьФИОВРегистре(ФизическоеЛицо,ФИО,Фамилия,Имя,Отчество)
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Имя", 			Имя);
	Запрос.УстановитьПараметр("Отчество", 		Отчество);
	Запрос.УстановитьПараметр("Фамилия", 		Фамилия);
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Запрос.УстановитьПараметр("ФИО", 			ФИО);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	DMS_ДанныеФизическихЛиц.ФизическоеЛицо,
		|	&ФИО,
		|	&Фамилия,
		|	&Имя,
		|	&Отчество,
		|	DMS_ДанныеФизическихЛиц.Пол,
		|	DMS_ДанныеФизическихЛиц.ДатаРождения
		|ИЗ
		|	РегистрСведений.DMS_ДанныеФизическихЛиц КАК DMS_ДанныеФизическихЛиц
		|ГДЕ
		|	DMS_ДанныеФизическихЛиц.ФизическоеЛицо = &ФизическоеЛицо";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		
		НаборЗаписей = РегистрыСведений.DMS_ДанныеФизическихЛиц.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(ВыборкаДетальныеЗаписи.ФизическоеЛицо);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись,ВыборкаДетальныеЗаписи);
		
		НаборЗаписей.Записать(Истина);
				
	КонецЕсли;

КонецПроцедуры

//#КонецОбласти

#КонецЕсли