
//События по трафику + НОВАЯ
// {События по Контакт-центру перенесены в отдельную подписку "Renault_КонтактЦентр_ПриЗаписиТрафика"
// и модуль "Renault_КонтактЦентр_СообщенияПользователю"}
Процедура Renault_ОбработкаЗаписиТрафикаПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	//Старые сообщения
	
	Для Каждого Запись из Источник Цикл
		Трафик = Запись;
		ТрафикОбработан = Запись.Обработан;
		ТрафикСМенеджером = ЗначениеЗаполнено(Запись.Менеджер);
		ТрафикИд = Запись.Идентификатор;
		МассивСообщений = ПолучитьМассивВсехСообщений(ТрафикИд);
		МассивЭквивалентныхВидов = Новый Массив();
		МассивЗакрываемыхВидов = Новый Массив();
		
		Если ТрафикОбработан Тогда
			УстановитьОбработкуСообщения(МассивСообщений, Неопределено, "Трафик обработан");
		Иначе
			Если ТрафикСМенеджером Тогда
				
				МассивЭквивалентныхВидов.Добавить(Справочники.Renault_ВидСообщения.НовыйКлиентПереданМенеджеру);
				МассивЗакрываемыхВидов.Добавить(Справочники.Renault_ВидСообщения.НовыйКлиентБезМенеджера);
				МассивЗакрываемыхВидов.Добавить(Справочники.Renault_ВидСообщения.ОК_НовыйТрафик);
				СоздатьСообщение(Источник,Трафик, МассивСообщений, Справочники.Renault_ВидСообщения.НовыйКлиентПереданМенеджеру,
								МассивЭквивалентныхВидов, МассивЗакрываемыхВидов);
			Иначе
				Если Трафик.ТипТрафика = Справочники.CRM_ТипТрафика.OnlineКонсультант Тогда
					МассивЭквивалентныхВидов.Добавить(Справочники.Renault_ВидСообщения.ОК_НовыйТрафик);
					МассивЗакрываемыхВидов.Добавить(Справочники.Renault_ВидСообщения.НовыйКлиентПереданМенеджеру);
					СоздатьСообщение(Источник, Трафик, МассивСообщений, Справочники.Renault_ВидСообщения.ОК_НовыйТрафик,
									МассивЭквивалентныхВидов, МассивЗакрываемыхВидов);
				ИначеЕсли Трафик.ТипТрафика = Справочники.CRM_ТипТрафика.ЛидRenault Тогда
					МассивЭквивалентныхВидов.Добавить(Справочники.Renault_ВидСообщения.КЦ_НовыйЛид);
					МассивЗакрываемыхВидов.Добавить(Справочники.Renault_ВидСообщения.НовыйКлиентПереданМенеджеру);
					СоздатьСообщение(Источник, Трафик, МассивСообщений, Справочники.Renault_ВидСообщения.КЦ_НовыйЛид,
									МассивЭквивалентныхВидов, МассивЗакрываемыхВидов);
				ИначеЕсли Трафик.ТипТрафика = Справочники.CRM_ТипТрафика.Email Тогда
					МассивЭквивалентныхВидов.Добавить(Справочники.Renault_ВидСообщения.КЦ_НовоеПисьмо);
					МассивЗакрываемыхВидов.Добавить(Справочники.Renault_ВидСообщения.НовыйКлиентПереданМенеджеру);
					СоздатьСообщение(Источник, Трафик, МассивСообщений, Справочники.Renault_ВидСообщения.КЦ_НовоеПисьмо,
									МассивЭквивалентныхВидов, МассивЗакрываемыхВидов);
				Иначе
					МассивЭквивалентныхВидов.Добавить(Справочники.Renault_ВидСообщения.НовыйКлиентБезМенеджера);
					МассивЗакрываемыхВидов.Добавить(Справочники.Renault_ВидСообщения.НовыйКлиентПереданМенеджеру);
					СоздатьСообщение(Источник, Трафик, МассивСообщений, Справочники.Renault_ВидСообщения.НовыйКлиентБезМенеджера,
									МассивЭквивалентныхВидов, МассивЗакрываемыхВидов);
				КонецЕсли;
							
			КонецЕсли;
			
		КонецЕсли;	
	КонецЦикла;
	
	//Новые сообщения
	
	Для Каждого ЗаписьТрафик из Источник Цикл
		
		ТрафикОбработан = ЗаписьТрафик.Обработан;
		ТрафикСМенеджером = ЗначениеЗаполнено(ЗаписьТрафик.Менеджер);
		ТрафикИдентификатор = ЗаписьТрафик.Идентификатор;		
		ТрафикДилерскийЦентр = ЗаписьТрафик.ДилерскийЦентр;
		
		Если ТрафикОбработан Тогда
			Renault_СообщенияПользователям.УдалитьСообщение(ТрафикИдентификатор, Справочники.Renault_ВидСообщения.НовыйКлиентПереданМенеджеру);
			Renault_СообщенияПользователям.УдалитьСообщение(ТрафикИдентификатор, Справочники.Renault_ВидСообщения.НовыйКлиентБезМенеджера);
		Иначе
			Если ТрафикСМенеджером Тогда //Персональное сообщение менеджеру о назначенном трафике
				Если Трафик.ТипТрафика = Справочники.CRM_ТипТрафика.OnlineКонсультант Тогда
					//Renault_СообщенияПользователям.ПослатьСообщениеПользователю(Справочники.Renault_ВидСообщения.ОК_НовыйТрафик, ЗаписьТрафик.Менеджер, "На вас назначен новый чат онлайн-консультанта", ТрафикИдентификатор);					
					
				ИначеЕсли Трафик.ТипТрафика = Справочники.CRM_ТипТрафика.ЛидRenault Тогда
					//Renault_СообщенияПользователям.ПослатьСообщениеПользователю(Справочники.Renault_ВидСообщения.КЦ_НовыйЛид, ЗаписьТрафик.Менеджер, "На вас назначен новый лид", ТрафикИдентификатор);
					
				ИначеЕсли Трафик.ТипТрафика = Справочники.CRM_ТипТрафика.Email Тогда
					//Renault_СообщенияПользователям.ПослатьСообщениеПользователю(Справочники.Renault_ВидСообщения.КЦ_НовоеПисьмо, ЗаписьТрафик.Менеджер, "На вас назначено новое письмо", ТрафикИдентификатор);
					
				Иначе //Посещения, звонки
					Renault_СообщенияПользователям.УдалитьСообщение(ТрафикИдентификатор, Справочники.Renault_ВидСообщения.НовыйКлиентБезМенеджера);				
					Renault_СообщенияПользователям.ПослатьСообщениеПользователю(Справочники.Renault_ВидСообщения.НовыйКлиентПереданМенеджеру, ЗаписьТрафик.Менеджер, "На вас назначен новый клиент", ТрафикИдентификатор);
				КонецЕсли;
			Иначе //Общее сообщение о новом трафике //Только в рамках дилерского центра трафика
				Если Трафик.ТипТрафика = Справочники.CRM_ТипТрафика.OnlineКонсультант Тогда
					//Renault_СообщенияПользователям.УдалитьСообщение(ТрафикИдентификатор, Справочники.Renault_ВидСообщения.НовыйКлиентПереданМенеджеру);
					//Renault_СообщенияПользователям.ПослатьСообщение(Справочники.Renault_ВидСообщения.ОК_НовыйТрафик, Истина, "Новый чат онлайн-консультанта", ТрафикИдентификатор, ТрафикДилерскийЦентр);
				ИначеЕсли Трафик.ТипТрафика = Справочники.CRM_ТипТрафика.ЛидRenault Тогда
					//Renault_СообщенияПользователям.УдалитьСообщение(ТрафикИдентификатор, Справочники.Renault_ВидСообщения.НовыйКлиентПереданМенеджеру);
					//Renault_СообщенияПользователям.ПослатьСообщение(Справочники.Renault_ВидСообщения.КЦ_НовыйЛид, Истина, "Новый лид", ТрафикИдентификатор, ТрафикДилерскийЦентр);
				ИначеЕсли Трафик.ТипТрафика = Справочники.CRM_ТипТрафика.Email Тогда
					//Renault_СообщенияПользователям.УдалитьСообщение(ТрафикИдентификатор, Справочники.Renault_ВидСообщения.НовыйКлиентПереданМенеджеру);
					//Renault_СообщенияПользователям.ПослатьСообщение(Справочники.Renault_ВидСообщения.КЦ_НовоеПисьмо, Истина, "Новое письмо", ТрафикИдентификатор, ТрафикДилерскийЦентр);
				Иначе
					Renault_СообщенияПользователям.УдалитьСообщение(ТрафикИдентификатор, Справочники.Renault_ВидСообщения.НовыйКлиентПереданМенеджеру);
					Renault_СообщенияПользователям.ПослатьСообщение(Справочники.Renault_ВидСообщения.НовыйКлиентБезМенеджера, Истина, "Новый клиент без менеджера", ТрафикИдентификатор, ТрафикДилерскийЦентр);
				КонецЕсли;
							
			КонецЕсли;
			
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

//События по договору
Процедура Renault_События_ПриЗаписиДоговораПередЗаписью(Источник, Отказ) Экспорт
	
	//Старые сообщения
	
	ДоговорИд = Строка(Источник.Ссылка.УникальныйИдентификатор()); 
	МассивСообщений = ПолучитьМассивВсехСообщений(ДоговорИд);
	ДоговорНаОформление = (Источник.Статус =  Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.НаОформление);
	ДоговорПодписан = (Источник.Статус = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан);
	ДоговорЧерновик = (Источник.Статус = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Черновик);
	ДоговорОформлен = (Источник.Статус = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Оформлен);
	ДоговорРасторгнут = (Источник.Статус = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Расторгнут); 
	МассивЭквивалентныхВидов = Новый Массив();
	МассивЗакрываемыхВидов = Новый Массив();

	Если ДоговорПодписан Или ДоговорЧерновик Или ДоговорРасторгнут Тогда
		Коммент = "Договор Подписан";
		Если ДоговорЧерновик Тогда 
			Коммент = "Договор Переведен в статус черновика";
		Иначе
			Если ДоговорРасторгнут тогда
				Коммент = "Договор расторгнут";
			КонецЕсли;
			
		КонецЕсли;
		УстановитьОбработкуСообщения(МассивСообщений, Неопределено, Коммент);
	Иначе
		Если ДоговорНаОформление Тогда
			МассивЭквивалентныхВидов.Добавить(Справочники.Renault_ВидСообщения.НовыйДоговорСКлиентом);
			МассивЗакрываемыхВидов.Добавить(Справочники.Renault_ВидСообщения.ОформленДоговорСКлиентом);
			СоздатьСообщение(Источник, Неопределено, МассивСообщений, Справочники.Renault_ВидСообщения.НовыйДоговорСКлиентом,
								МассивЭквивалентныхВидов, МассивЗакрываемыхВидов);
		ИначеЕсли ДоговорОформлен Тогда
			МассивЭквивалентныхВидов.Добавить(Справочники.Renault_ВидСообщения.ОформленДоговорСКлиентом);
			МассивЗакрываемыхВидов.Добавить(Справочники.Renault_ВидСообщения.НовыйДоговорСКлиентом);
			СоздатьСообщение(Источник, Неопределено, МассивСообщений, Справочники.Renault_ВидСообщения.ОформленДоговорСКлиентом,
								МассивЭквивалентныхВидов, МассивЗакрываемыхВидов);
		Иначе
			УстановитьОбработкуСообщения(МассивСообщений,Неопределено,"Событие завершено");
		КонецЕсли;
	КонецЕсли;		
	
	//Новые сообщения
	
	//АвА = Справочники.Renault_ВидСообщения.Автосклад_ДоговорНаПродажуАвтомобиляПереданНаОформление;
	//АвА = Справочники.Renault_ВидСообщения.ОформленДоговорСКлиентом;	
	//АвА = Справочники.Renault_ВидСообщения.Автосклад_ПодписанДоговорСКлиентом;
	//АвА = Справочники.Renault_ВидСообщения.Автосклад_ИзменениеСтатусаДоговораНаПродажуАвтомобиля;
	//
	//
	//
	//ДоговорИд = Строка(Источник.Ссылка.УникальныйИдентификатор()); 
	//МассивСообщений = ПолучитьМассивВсехСообщений(ДоговорИд);
	//ДоговорНаОформление = (Источник.Статус =  Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.НаОформление);
	//ДоговорПодписан = (Источник.Статус = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан);
	//ДоговорЧерновик = (Источник.Статус = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Черновик);
	//ДоговорОформлен = (Источник.Статус = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Оформлен);
	//ДоговорРасторгнут = (Источник.Статус = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Расторгнут); 
	//МассивЭквивалентныхВидов = Новый Массив();
	//МассивЗакрываемыхВидов = Новый Массив();

	//Если ДоговорПодписан Или ДоговорЧерновик Или ДоговорРасторгнут Тогда
	//	Коммент = "Договор Подписан";
	//	Если ДоговорЧерновик Тогда 
	//		Коммент = "Договор Переведен в статус черновика";
	//	Иначе
	//		Если ДоговорРасторгнут тогда
	//			Коммент = "Договор расторгнут";
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	УстановитьОбработкуСообщения(МассивСообщений, Неопределено, Коммент);
	//Иначе
	//	Если ДоговорНаОформление Тогда
	//		МассивЭквивалентныхВидов.Добавить(Справочники.Renault_ВидСообщения.НовыйДоговорСКлиентом);
	//		МассивЗакрываемыхВидов.Добавить(Справочники.Renault_ВидСообщения.ОформленДоговорСКлиентом);
	//		СоздатьСообщение(Источник, Неопределено, МассивСообщений, Справочники.Renault_ВидСообщения.НовыйДоговорСКлиентом,
	//							МассивЭквивалентныхВидов, МассивЗакрываемыхВидов);
	//	ИначеЕсли ДоговорОформлен Тогда
	//		МассивЭквивалентныхВидов.Добавить(Справочники.Renault_ВидСообщения.ОформленДоговорСКлиентом);
	//		МассивЗакрываемыхВидов.Добавить(Справочники.Renault_ВидСообщения.НовыйДоговорСКлиентом);
	//		СоздатьСообщение(Источник, Неопределено, МассивСообщений, Справочники.Renault_ВидСообщения.ОформленДоговорСКлиентом,
	//							МассивЭквивалентныхВидов, МассивЗакрываемыхВидов);
	//	Иначе
	//		УстановитьОбработкуСообщения(МассивСообщений,Неопределено,"Событие завершено");
	//	КонецЕсли;
	//КонецЕсли;		
	
КонецПроцедуры

//События по Заявке на оборудование
Процедура Renault_События_ПриЗаписиЗаявиНаДилерскиеОпцииОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если не ЗначениеЗаполнено(Источник.Статус) тогда
		УстановитьСтатусЗаявкиНаОборудование(Источник);
	КонецЕсли;
	МассивВидовСобытий = Новый Массив();
	МассивВидовСобытий.Добавить(справочники.Renault_ВидСообщения.НоваяЗаявкаНаОпции);
	МассивВидовСобытий.Добавить(справочники.Renault_ВидСообщения.ОдобренаЗаявкаНаОпции);
	
	Если  (Источник.Статус = Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.НаРассмотрении)ИЛИ
		  (Источник.Статус = Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.Черновик) ИЛИ
		  (Источник.Статус = Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.ПустаяСсылка()) Тогда
		Сообщ = Неопределено;
		МассивПолучателей = НастройкиСотрудники(Справочники.Renault_ВидСообщения.НоваяЗаявкаНаОпции, Источник.ДилерскийЦентр);
		СоздаватьСобытие = Истина;
		Если ЗаписьСообщенияСуществует(Строка(Источник.Ссылка.УникальныйИдентификатор()), Сообщ) Тогда
			НовСообщение = Сообщ.ПолучитьОбъект();
			Если НовСообщение.ВидСообщения = справочники.Renault_ВидСообщения.ОдобренаЗаявкаНаОпции тогда
				НовСообщение.обработано = Истина;
				НовСообщение.Записать();
			иначе
				СоздаватьСобытие = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		если СоздаватьСобытие тогда
			НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
			
			НовСообщение.ИдентификаторОбъекта = Строка(Источник.Ссылка.УникальныйИдентификатор());
			НовСообщение.Обработано = Ложь;
			НовСообщение.ВидСообщения = Справочники.Renault_ВидСообщения.НоваяЗаявкаНаОпции;
			НовСообщение.ЗаполнитьДанными(ТекущаяДата(), "Документ ""Заявка На Опции"" №" + Строка(Источник.номер) + " от " + Строка(Источник.Дата) + " Отправлен на оформление", неопределено, 0, неопределено, неопределено);
			ЗаполнитьАдресатовСообщения(НовСообщение,МассивПолучателей);
			НовСообщение.Записать();
		КонецЕсли;
	ИначеЕсли (Источник.Статус =  Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.Выполнена)ИЛИ
		(Источник.Статус = Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.Отменена)Тогда
		Сообщ = Неопределено;
		Если ЗаписьСообщенияСуществует(Строка(Источник.Ссылка.УникальныйИдентификатор()), Сообщ) Тогда
			НовСообщение = Сообщ.ПолучитьОбъект();
			
			//Если НовСообщение.ВидСообщения = справочники.Renault_ВидСообщения.НоваяЗаявкаНаОпции тогда
			НовСообщение.обработано = Истина;
			НовСообщение.Записать();
			//КонецЕсли;
			
		КонецЕсли;
		//НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
		
		//МассивПолучателей = НастройкиСотрудники(Справочники.Renault_ВидСообщения.НоваяЗаявкаНаОпции,Источник.ДилерскийЦентр);
		//НовСообщение.ИдентификаторОбъекта = Строка(Источник.Ссылка.УникальныйИдентификатор());
		//НовСообщение.Обработано = Ложь;
		//НовСообщение.ВидСообщения = Справочники.Renault_ВидСообщения.ОформленДоговорСКлиентом;
		//НовСообщение.ЗаполнитьДанными(ТекущаяДата(),"Документ ""Заявка На Опции"" №"+Строка(Источник.номер)+" от "+Строка(Источник.Дата)+" Одобрен",неопределено,1,неопределено,неопределено);
		//ЗаполнитьАдресатовСообщения(НовСообщение,МассивПолучателей);
		//НовСообщение.Записать();
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура Renault_События_ПриЗаписиЗаявкиНаПодборПриЗаписи(Источник, Отказ) Экспорт
     	
	Если Источник.ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	// Если статус изменен тогда вызовем оповещение
	Если Источник.СтатусИзменен Тогда
		
		МассивПолучателей = НастройкиСотрудники(Справочники.Renault_ВидСообщения.СтатусЗаявкиНаПодборАвто, Renault_CRM.ПолучитьДилерскийЦентрПользователя());
		
		НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
		
		НовСообщение.ИдентификаторОбъекта = Строка(Источник.Ссылка.УникальныйИдентификатор());
		НовСообщение.Обработано = Ложь;
		НовСообщение.ВидСообщения = Справочники.Renault_ВидСообщения.СтатусЗаявкиНаПодборАвто;
		НовСообщение.ЗаполнитьДанными(ТекущаяДата(),"Документ ""Заявка На подбор автомобиля"" №"+Строка(Источник.номер)+" от "+Строка(Источник.Дата)+" по рабочему листу№ "+Строка(Источник.РабочийЛист)+" Изменил статус",неопределено,0,неопределено,неопределено);
		ЗаполнитьАдресатовСообщения(НовСообщение,МассивПолучателей);
		НовСообщение.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

//События по заявке на трейд ин
Процедура Renault_События_ПриЗаписиЗаявкиТрейдИнОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	//Если не ЗначениеЗаполнено(Источник.Статус) тогда
	//	УстановитьСтатусЗаявкиНаТрейдИн(Источник);
	//КонецЕсли;

	//МассивВидовСобытий = Новый Массив();
	//МассивВидовСобытий.Добавить(справочники.Renault_ВидСообщения.ОдобренаЗаявкаНаТрейдИн);
	//МассивВидовСобытий.Добавить(справочники.Renault_ВидСообщения.НоваяЗаявкаНаТрейдИн);
	//
	//Если  (Источник.Статус =  Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.НаРассмотрении ) ИЛИ
	//	(Источник.Черновик = Ложь и Источник.Закрыта = Ложь и источник.ВыполненаУспешно = ложь и Источник.Одобрена = ложь)Тогда
	//	Сообщ = Неопределено;
	//	МассивПолучателей = НастройкиСотрудники(Справочники.Renault_ВидСообщения.НоваяЗаявкаНаТрейдИн,Источник.ДилерскийЦентр);
	//	СоздаватьСобытие = Истина;
	//	Если ЗаписьСообщенияСуществует(Строка(Источник.Ссылка.УникальныйИдентификатор()),Сообщ) Тогда
	//		НовСообщение =Сообщ.ПолучитьОбъект();
	//		ЕСли НовСообщение.ВидСообщения = справочники.Renault_ВидСообщения.ОдобренаЗаявкаНаТрейдИн Тогда
	//			НовСообщение.обработано = Истина;
	//			НовСообщение.Записать();
	//		Иначе
	//			СоздаватьСобытие = Ложь;
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	Если СоздаватьСобытие Тогда
	//		НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
	//		НовСообщение.ИдентификаторОбъекта = Строка(Источник.Ссылка.УникальныйИдентификатор());
	//		НовСообщение.Обработано = Ложь;
	//		НовСообщение.ВидСообщения = Справочники.Renault_ВидСообщения.НоваяЗаявкаНаТрейдИн;
	//		НовСообщение.ЗаполнитьДанными(ТекущаяДата(),"Документ ""Заявка На ТрейдИн"" №"+Строка(Источник.номер)+" от "+Строка(Источник.Дата)+" Отправлен на оформление",неопределено,0,неопределено,неопределено);
	//		ЗаполнитьАдресатовСообщения(НовСообщение,МассивПолучателей);
	//		НовСообщение.Записать();
	//	КонецЕсли;
	//ИначеЕсли  (Источник.Статус =  Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.Одобрена ) ИЛИ
	//	(Источник.Черновик = Ложь и Источник.Закрыта = Ложь и источник.ВыполненаУспешно = ложь и Источник.Одобрена = Истина)Тогда
	//	МассивПолучателей = НастройкиСотрудники(Справочники.Renault_ВидСообщения.ОдобренаЗаявкаНаТрейдИн,Источник.ДилерскийЦентр);
	//	СоздаватьСобытие = Истина;
	//	Сообщ = Неопределено;
	//	Если ЗаписьСообщенияСуществует(Строка(Источник.Ссылка.УникальныйИдентификатор()),Сообщ) Тогда
	//		НовСообщение =Сообщ.ПолучитьОбъект();
	//		ЕСли НовСообщение.ВидСообщения = справочники.Renault_ВидСообщения.НоваяЗаявкаНаТрейдИн Тогда
	//			НовСообщение.обработано = Истина;
	//			НовСообщение.Записать();
	//		Иначе
	//			СоздаватьСобытие = Ложь;
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	Если СоздаватьСобытие тогда
	//		НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
	//		НовСообщение.ИдентификаторОбъекта = Строка(Источник.Ссылка.УникальныйИдентификатор());
	//		НовСообщение.Обработано = Ложь;
	//		ЗаполнитьАдресатовСообщения(НовСообщение,МассивПолучателей);
	//		НовСообщение.ВидСообщения = Справочники.Renault_ВидСообщения.ОдобренаЗаявкаНаТрейдИн;
	//		НовСообщение.ЗаполнитьДанными(ТекущаяДата(),"Документ ""Заявка На ТрейдИн"" №"+Строка(Источник.номер)+" от "+Строка(Источник.Дата)+" одобрен",неопределено,0,неопределено,неопределено);
	//		НовСообщение.Записать();
	//	КонецЕсли;
	//	
	//ИначеЕсли  (Источник.Черновик = Истина) или (Источник.Закрыта = Истина) или (источник.ВыполненаУспешно = Истина)Тогда
	//	Сообщ = Неопределено;
	//	Если ЗаписьСообщенияСуществует(Строка(Источник.Ссылка.УникальныйИдентификатор()),Сообщ) Тогда
	//		НовСообщение =Сообщ.ПолучитьОбъект();
	//		НовСообщение.обработано = Истина;
	//		НовСообщение.Записать();			
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

//События по заявке на кредит
Процедура Renault_События_ПриЗаписиЗаявкиНаКредитОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
	
	//Если не ЗначениеЗаполнено(Источник.Статус) тогда
	//	УстановитьСтатусЗаявкиНаКредит(Источник);
	//КонецЕсли;

	МассивВидовСобытий = Новый Массив();
	МассивВидовСобытий.Добавить(справочники.Renault_ВидСообщения.ОдобренаЗаявкаНаКредит);
	МассивВидовСобытий.Добавить(справочники.Renault_ВидСообщения.НоваяЗаявкаНаКредит);
	
	Если (ТипЗнч(Источник)=Тип("ДокументОбъект.Renault_РабочийЛистОФУ") И Источник.Состояние=Перечисления.Renault_CRM_СтатусЗаявокНаКредит.НаРассмотрении) 
		ИЛИ (ТипЗнч(Источник)=Тип("ДокументОбъект.Renault_CRM_ЗаявкаНаКредит") И 
		(Источник.Статус=Перечисления.Renault_CRM_СтатусЗаявокНаКредит.НаРассмотрении ИЛИ (Не Источник.Черновик И НЕ Источник.Закрыта И НЕ Источник.ВыполненаУспешно И НЕ Источник.Одобрена)))	
	Тогда
		Сообщ = Неопределено;
		МассивПолучателей = НастройкиСотрудники(Справочники.Renault_ВидСообщения.НоваяЗаявкаНаКредит,Источник.ДилерскийЦентр);
		СоздаватьСобытие = Истина;
		Если ЗаписьСообщенияСуществует(Строка(Источник.Ссылка.УникальныйИдентификатор()),Сообщ) Тогда
			НовСообщение =Сообщ.ПолучитьОбъект();
			ЕСли НовСообщение.ВидСообщения = справочники.Renault_ВидСообщения.ОдобренаЗаявкаНаКредит Тогда
				НовСообщение.обработано = Истина;
				НовСообщение.Записать();
			Иначе
				СоздаватьСобытие = Ложь;
			КонецЕсли;
		КонецЕсли;
		Если СоздаватьСобытие тогда
			НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
			НовСообщение.ИдентификаторОбъекта = Строка(Источник.Ссылка.УникальныйИдентификатор());
			НовСообщение.Обработано = Ложь;
			НовСообщение.ВидСообщения = Справочники.Renault_ВидСообщения.НоваяЗаявкаНаКредит;
			НовСообщение.ЗаполнитьДанными(ТекущаяДата(),"Документ ""Заявка На Кредит"" №"+Строка(Источник.номер)+" от "+Строка(Источник.Дата)+" Отправлен на оформление",неопределено,0,неопределено,неопределено);
			ЗаполнитьАдресатовСообщения(НовСообщение,МассивПолучателей);
			НовСообщение.Записать();
		КонецЕсли;
	ИначеЕсли (	ТипЗнч(Источник)=Тип("ДокументОбъект.Renault_РабочийЛистОФУ") И Источник.Состояние=Перечисления.Renault_CRM_СтатусЗаявокНаКредит.Одобрена) 
		ИЛИ( ТипЗнч(Источник)=Тип("ДокументОбъект.Renault_CRM_ЗаявкаНаКредит") И 
			(Источник.Статус=Перечисления.Renault_CRM_СтатусЗаявокНаКредит.Одобрена ИЛИ (НЕ Источник.Черновик И НЕ Источник.Закрыта И НЕ Источник.ВыполненаУспешно И Источник.Одобрена) )
		) 
	Тогда	
		Сообщ = Неопределено;
		МассивПолучателей = НастройкиСотрудники(Справочники.Renault_ВидСообщения.ОдобренаЗаявкаНаКредит,Источник.ДилерскийЦентр);
		СоздаватьСобытие = Истина;
        Если ЗаписьСообщенияСуществует(Строка(Источник.Ссылка.УникальныйИдентификатор()),Сообщ) Тогда
			НовСообщение =Сообщ.ПолучитьОбъект();
			ЕСли НовСообщение.ВидСообщения = справочники.Renault_ВидСообщения.НоваяЗаявкаНаКредит Тогда
				НовСообщение.обработано = Истина;
				НовСообщение.Записать();
			Иначе
				СоздаватьСобытие = Ложь;
			КонецЕсли;
		КонецЕсли;
		Если СоздаватьСобытие Тогда
			НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
			НовСообщение.ИдентификаторОбъекта = Строка(Источник.Ссылка.УникальныйИдентификатор());
			НовСообщение.Обработано = Ложь;
			НовСообщение.ВидСообщения = Справочники.Renault_ВидСообщения.ОдобренаЗаявкаНаКредит;
			НовСообщение.ЗаполнитьДанными(ТекущаяДата(),"Документ ""Заявка На Кредит"" №"+Строка(Источник.номер)+" от "+Строка(Источник.Дата)+" одобрен",неопределено,0,неопределено,неопределено);
			ЗаполнитьАдресатовСообщения(НовСообщение,МассивПолучателей);
			НовСообщение.Записать();
		КонецЕсли;
	Иначе	
	//ИначеЕсли  Источник.Черновик Или Источник.Закрыта ИЛИ источник.ВыполненаУспешно Тогда
		Сообщ = Неопределено;
		Если ЗаписьСообщенияСуществует(Строка(Источник.Ссылка.УникальныйИдентификатор()),Сообщ) Тогда
			НовСообщение =Сообщ.ПолучитьОбъект();
			НовСообщение.обработано = Истина;
			НовСообщение.Записать();			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//События по заявке на Гарантию
Процедура Renault_События_ПриЗаписиЗаявкиНаГарантиюОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
     	
	Если Источник.ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(Источник.Статус) тогда
		УстановитьСтатусЗаявкиНаГарантию(Источник);
	КонецЕсли;

	МассивВидовСобытий = Новый Массив();
	МассивВидовСобытий.Добавить(справочники.Renault_ВидСообщения.ОдобренаЗаявкаНаГарантию);
	МассивВидовСобытий.Добавить(справочники.Renault_ВидСообщения.НоваяЗаявкаНаГарантию);
	
	Если  (Источник.Статус =  Перечисления.Renault_CRM_СтатусЗаявокНаГарантию.НаРассмотрении ) ИЛИ
		(Источник.Черновик = Ложь и Источник.Закрыта = Ложь и источник.ВыполненаУспешно = ложь )Тогда
		Сообщ = Неопределено;
		МассивПолучателей = НастройкиСотрудники(Справочники.Renault_ВидСообщения.НоваяЗаявкаНаГарантию,Источник.ДилерскийЦентр);
		СоздаватьСобытие = Истина;
       	Если ЗаписьСообщенияСуществует(Строка(Источник.Ссылка.УникальныйИдентификатор()),Сообщ) Тогда
			НовСообщение =Сообщ.ПолучитьОбъект();
			ЕСли НовСообщение.ВидСообщения = справочники.Renault_ВидСообщения.ОдобренаЗаявкаНаГарантию Тогда
				НовСообщение.обработано = Истина;
				НовСообщение.Записать();
			Иначе
				СоздаватьСобытие = Ложь;
			КонецЕсли;

		КонецЕсли;
		Если СоздаватьСобытие тогда
			НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
			НовСообщение.ИдентификаторОбъекта = Строка(Источник.Ссылка.УникальныйИдентификатор());
			НовСообщение.Обработано = Ложь;
			НовСообщение.ВидСообщения = Справочники.Renault_ВидСообщения.НоваяЗаявкаНаГарантию;
			НовСообщение.ЗаполнитьДанными(ТекущаяДата(),"Документ ""Заявка На Гарантию"" №"+Строка(Источник.номер)+" от "+Строка(Источник.Дата)+" Отправлен на оформление",неопределено,0,неопределено,неопределено);
			ЗаполнитьАдресатовСообщения(НовСообщение,МассивПолучателей);
			НовСообщение.Записать();
		КонецЕсли;

	ИначеЕсли (Источник.Статус =  Перечисления.Renault_CRM_СтатусЗаявокНаГарантию.Выполнена ) ИЛИ
		(Источник.Черновик = Истина) Или  (Источник.ВыполненаУспешно = Истина  )ИЛи (Источник.Закрыта = истина)Тогда
		Сообщ = Неопределено;
		Если ЗаписьСообщенияСуществует(Строка(Источник.Ссылка.УникальныйИдентификатор()),Сообщ) Тогда
			НовСообщение =Сообщ.ПолучитьОбъект();
			НовСообщение.Обработано = Истина;
			НовСообщение.Записать();
		//Иначе
		//	НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
		//	
			
		КонецЕсли;
		//НовСообщение.ИдентификаторОбъекта = Строка(Источник.Ссылка.УникальныйИдентификатор());
		//НовСообщение.Обработано = Ложь;
		//НовСообщение.ВидСообщения = Справочники.Renault_ВидСообщения.ОдобренаЗаявкаНаГарантию;
		//НовСообщение.ЗаполнитьДанными(ТекущаяДата(),"Документ ""Заявка На Гарантию"" №"+Строка(Источник.номер)+" от "+Строка(Источник.Дата)+" Одобрен",неопределено,1,неопределено,неопределено);
		//НовСообщение.Записать();
		
		
	КонецЕсли;
	
КонецПроцедуры

//Контакт
Процедура ПриПоступленииНовогоСообщенияВКонтактЦентр(Сообщение) Экспорт
	
	Запись = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(Сообщение.IDТрафика);
	Если ЗначениеЗаполнено(Запись.Менеджер) Тогда
		МассивПолучателей = Новый Массив;
		МассивПолучателей.Добавить(Запись.Менеджер);
	Иначе
		МассивПолучателей = НастройкиАдресатовОнлайнКонсультант(Справочники.Renault_ВидСообщения.ОК_НовоеСообщение, Запись.ДилерскийЦентр);
	КонецЕсли;
	Если ЗначениеЗаполнено(Запись.Менеджер) Тогда
		Если МассивПолучателей.Найти(Запись.Менеджер) = Неопределено Тогда
			МассивПолучателей.Добавить(Запись.Менеджер);
		КонецЕсли;
	КонецЕсли;
	НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
	НовСообщение.Наименование = "Новое собщение в чат";
	ЗаполнитьАдресатовСообщения(НовСообщение,МассивПолучателей);
	НовСообщение.ИдентификаторОбъекта = Сообщение.IDТрафика;
	НовСообщение.Обработано = Ложь;
	НовСообщение.ВидСообщения = Справочники.Renault_ВидСообщения.ОК_НовоеСообщение;
	НовСообщение.ЗаполнитьДанными(ТекущаяДата(),
	?(Запись.ТипТрафика = Справочники.CRM_ТипТрафика.OnlineКонсультант, "В сообщение в чат (онлайн консультант)", "Сообщение по трафику"), Запись.Администратор, 0, Запись.Менеджер, Сообщение.messages);
	НовСообщение.Записать();
	
КонецПроцедуры

//Резервирование
Процедура ПодпискаНаСобытиеРезервОтменаПроведенияОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	// Вставить содержимое обработчика.
	ЗаявкаИд = Строка(Источник.Ссылка.УникальныйИдентификатор());
	МассивСообщений = ПолучитьМассивВсехСообщений(ЗаявкаИд);
	Для Каждого Сообщ Из МассивСообщений ЦИкл
		СообщОб = Сообщ.ПолучитьОбъект();
		СообщОб.ПометкаУдаления = Истина;
		СообщОб.Обработано = Истина;
		СообщОб.Записать();
	КонецЦикла;
	
КонецПроцедуры

//Резервирование
Процедура Renault_Автосклад_ПриЗаписиРезервированияАвтомобилейОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	ЗаявкаИд = Строка(Источник.Ссылка.УникальныйИдентификатор()); 
	МассивСообщений = ПолучитьМассивВсехСообщений(ЗаявкаИд);
	МассивЭквивалентныхВидов = Новый Массив();
	МассивЗакрываемыхВидов = Новый Массив();
	Если Источник.СтатусРезерва  =  Перечисления.CRM_СтатусыРезервовАвтомобилей.ЗаявкаНаРезерв Тогда
		МассивЭквивалентныхВидов.Добавить(Справочники.Renault_ВидСообщения.Автосклад_НоваяЗаявкаНаРезерв);				
		//МассивЗакрываемыхВидов.Добавить(Справочники.Renault_ВидСообщения.Автосклад_НоваяЗаявкаНаРезерв);
		МассивЗакрываемыхВидов.Добавить(Справочники.Renault_ВидСообщения.Автосклад_ИзменениеСтатусаЗаявкиНаРезерв);
        СоздатьСообщение(Источник,Источник,МассивСообщений,Справочники.Renault_ВидСообщения.Автосклад_НоваяЗаявкаНаРезерв,
									МассивЭквивалентныхВидов, МассивЗакрываемыхВидов);
	ИначеЕсли  Источник.СтатусРезерва = Перечисления.CRM_СтатусыРезервовАвтомобилей.РезервУтвержден Или
				Источник.СтатусРезерва = Перечисления.CRM_СтатусыРезервовАвтомобилей.РезервОтклонен Тогда						
		//МассивЭквивалентныхВидов.Добавить(Справочники.Renault_ВидСообщения.Автосклад_ИзменениеСтатусаЗаявкиНаРезерв);				
		МассивЗакрываемыхВидов.Добавить(Справочники.Renault_ВидСообщения.Автосклад_НоваяЗаявкаНаРезерв);
		МассивЗакрываемыхВидов.Добавить(Справочники.Renault_ВидСообщения.Автосклад_ИзменениеСтатусаЗаявкиНаРезерв);
		СоздатьСообщение(Источник,Источник,МассивСообщений,Справочники.Renault_ВидСообщения.Автосклад_ИзменениеСтатусаЗаявкиНаРезерв,
									МассивЭквивалентныхВидов, МассивЗакрываемыхВидов);
									
	ИначеЕсли Источник.СтатусРезерва = Перечисления.CRM_СтатусыРезервовАвтомобилей.РезервСнят Тогда
		
		МассивЗакрываемыхВидов.Добавить(Справочники.Renault_ВидСообщения.Автосклад_ИзменениеСтатусаЗаявкиНаРезерв);
		СоздатьСообщение(Источник,Источник,МассивСообщений,Справочники.Renault_ВидСообщения.Автосклад_ИзменениеСтатусаЗаявкиНаРезерв,
									МассивЭквивалентныхВидов, МассивЗакрываемыхВидов);
									
	КонецЕсли;
		
КонецПроцедуры

//Резервирование
Процедура СоздатьСообщениеИзмененияСтатусаЗаявкиНаРезерв(Источник,СрокОтображенияДней,МассивУдаляемыхВидов = Неопределено,МассивСообщений = Неопределено) экспорт
	//Запись = Renault_CRM.ПолучитьЗаписьРЛПоIDK(Источник.IDK);
	Если (Не(МассивУдаляемыхВидов = Неопределено)) И (Не(МассивСообщений = Неопределено))Тогда
		Для Каждого Сообщ Из МассивСообщений Цикл
			Если МассивУдаляемыхВидов.Найти(Сообщ.ВидСообщения) <> Неопределено Тогда
				СообщОб = Сообщ.получитьОбъект();
				СообщОб.Обработано = Истина;
				СообщОб.пометкаудаления = Истина;
				СообщОб.Записать();
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;		
		
		
	МассивПолучателей = новый Массив();                                                   
	МассивПолучателей.Добавить(Источник.Менеджер);
	НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
	НовСообщение.ИдентификаторОбъекта = Строка(Источник.Ссылка.УникальныйИдентификатор());
	НовСообщение.Обработано = Ложь;
	//НовСообщение.Получатель = Запись.Сотрудник;
	НовСообщение.ВидСообщения = Справочники.Renault_ВидСообщения.Автосклад_ИзменениеСтатусаЗаявкиНаРезерв;
	НовСообщение.ЗаполнитьДанными(ТекущаяДата(),ВернутьОписаниеСтатусаРезерва(Источник.СтатусРезерва, Источник.Клиент),неопределено,СрокОтображенияДней,неопределено,неопределено);
	НовСообщение.Комментарий = Источник.Автомобиль.VIN;
	
	ЗаполнитьАдресатовСообщения(НовСообщение,МассивПолучателей);
	НовСообщение.Записать();
КонецПроцедуры

//////////////////// события по автосервису

Процедура Renault_События_ПриЗаписиЗаказНаряда(Источник, Отказ) Экспорт
	
	МассивСообщений = ПолучитьМассивВсехСообщений(Строка(Источник.Ссылка.УникальныйИдентификатор()));
	МассивЭквивалентныхВидов = Новый Массив;
	МассивЗакрываемыхВидов = Новый Массив;
	
	Если Источник.Состояние = Справочники.ВидыСостоянийЗаказНарядов.ВРаботе
		ИЛИ Источник.Состояние = Справочники.ВидыСостоянийЗаказНарядов.НачатьРаботу Тогда
		ВидСообщения = Справочники.Renault_ВидСообщения.Автосервис_РаботыНачаты;
		МассивЭквивалентныхВидов.Добавить(ВидСообщения);
		
	ИначеЕсли Источник.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен Тогда
		ВидСообщения = Справочники.Renault_ВидСообщения.Автосервис_РаботыОкончены;
		МассивЭквивалентныхВидов.Добавить(ВидСообщения);
		
	КонецЕсли;
	
	СоздатьСообщение(Источник, Неопределено, МассивСообщений, ВидСообщения,
						МассивЭквивалентныхВидов, МассивЗакрываемыхВидов);
	
КонецПроцедуры

Процедура Renault_События_ПриЗаписиПриемкиАвто(Источник, Отказ) Экспорт
     	
	Если Источник.ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	МассивСообщений = ПолучитьМассивВсехСообщений(Строка(Источник.Ссылка.УникальныйИдентификатор()));
	МассивЭквивалентныхВидов = Новый Массив;
	МассивЗакрываемыхВидов = Новый Массив;
	
	Если Источник.Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.ВРаботе
		ИЛИ Источник.Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.НачатьРаботу Тогда
		ВидСообщения = Справочники.Renault_ВидСообщения.Автосервис_ПриемкаНачата;
		МассивЭквивалентныхВидов.Добавить(ВидСообщения);
		
	ИначеЕсли Источник.Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Выполнен Тогда
		ВидСообщения = Справочники.Renault_ВидСообщения.Автосервис_ПриемкаОкончена;
		МассивЭквивалентныхВидов.Добавить(ВидСообщения);
		
	КонецЕсли;
	
	СоздатьСообщение(Источник, Неопределено, МассивСообщений, ВидСообщения,
						МассивЭквивалентныхВидов, МассивЗакрываемыхВидов);
	
КонецПроцедуры

Процедура Renault_События_ПриЗаписиМойкиАвто(Источник, Отказ) Экспорт
     	
	Если Источник.ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	МассивСообщений = ПолучитьМассивВсехСообщений(Строка(Источник.Ссылка.УникальныйИдентификатор()));
	МассивЭквивалентныхВидов = Новый Массив;
	МассивЗакрываемыхВидов = Новый Массив;
	
	Если Источник.Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.ВРаботе
		ИЛИ Источник.Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.НачатьРаботу Тогда
		ВидСообщения = Справочники.Renault_ВидСообщения.Автосервис_МойкаНачата;
		МассивЭквивалентныхВидов.Добавить(ВидСообщения);
		
	ИначеЕсли Источник.Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Выполнен Тогда
		ВидСообщения = Справочники.Renault_ВидСообщения.Автосервис_МойкаОкончена;
		МассивЭквивалентныхВидов.Добавить(ВидСообщения);
		
	КонецЕсли;
	
	СоздатьСообщение(Источник, Неопределено, МассивСообщений, ВидСообщения,
						МассивЭквивалентныхВидов, МассивЗакрываемыхВидов);
	
КонецПроцедуры

Процедура Renault_События_ПриЗаписиВыдачиАвто(Источник, Отказ) Экспорт
     	
	Если Источник.ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	МассивСообщений = ПолучитьМассивВсехСообщений(Строка(Источник.Ссылка.УникальныйИдентификатор()));
	МассивЭквивалентныхВидов = Новый Массив;
	МассивЗакрываемыхВидов = Новый Массив;
	
	Если Источник.Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.ВРаботе
		ИЛИ Источник.Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.НачатьРаботу Тогда
		ВидСообщения = Справочники.Renault_ВидСообщения.Автосервис_ВыдачаНачата;
		МассивЭквивалентныхВидов.Добавить(ВидСообщения);
		
	ИначеЕсли Источник.Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Выполнен Тогда
		ВидСообщения = Справочники.Renault_ВидСообщения.Автосервис_ВыдачаОкончена;
		МассивЭквивалентныхВидов.Добавить(ВидСообщения);
		
	КонецЕсли;
	
	СоздатьСообщение(Источник, Неопределено, МассивСообщений, ВидСообщения,
						МассивЭквивалентныхВидов, МассивЗакрываемыхВидов);
	
КонецПроцедуры

Процедура Renault_События_ПриЗаписиСертификатаКонтроля(Источник, Отказ) Экспорт
     	
	Если Источник.ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	МассивСообщений = ПолучитьМассивВсехСообщений(Строка(Источник.Ссылка.УникальныйИдентификатор()));
	МассивЭквивалентныхВидов = Новый Массив;
	МассивЗакрываемыхВидов = Новый Массив;
	
	Если Источник.Статус = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.ВРаботе
		ИЛИ Источник.Статус = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.НачатьРаботу Тогда
		ВидСообщения = Справочники.Renault_ВидСообщения.Автосервис_КонтрольНачат;
		МассивЭквивалентныхВидов.Добавить(ВидСообщения);
		
	ИначеЕсли Источник.Статус = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Выполнен Тогда
		ВидСообщения = Справочники.Renault_ВидСообщения.Автосервис_КонтрольЗавершен;
		МассивЭквивалентныхВидов.Добавить(ВидСообщения);
		
	КонецЕсли;
	
	СоздатьСообщение(Источник, Неопределено, МассивСообщений, ВидСообщения,
						МассивЭквивалентныхВидов, МассивЗакрываемыхВидов);
	
КонецПроцедуры

//Козлов Е.А. Начало 24.06.2016
Процедура Renault_События_ПриЗаписиЗадачи(Источник, Отказ) Экспорт
     	
	Если Источник.ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	МассивСообщений = ПолучитьМассивВсехСообщений(Строка(Источник.Ссылка.УникальныйИдентификатор()));
	
	ВидСообщения = Справочники.Renault_ВидСообщения.НоваяЗадача; 
	
	СоздатьСообщение(Источник, Неопределено, МассивСообщений, ВидСообщения);	
КонецПроцедуры

Процедура СоздатьСообщениеПоНовойЗадаче(Источник, ВидСообщения)
	МассивПолучателей = Новый Массив();
	мПользователи = Источник.Пользователи;
	Для Каждого Стр Из мПользователи Цикл
		МассивПолучателей.Добавить(Стр.Пользователь.Сотрудник);	
	КонецЦикла;
	
	НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
	НовСообщение.ИдентификаторОбъекта = Строка(Источник.Ссылка.УникальныйИдентификатор());	
	НовСообщение.Обработано = Ложь;	
	НовСообщение.ВидСообщения = ВидСообщения;
	Сообщение = "Новая задача:" + Источник.Содержание;
	НовСообщение.ЗаполнитьДанными(ТекущаяДата(), Сообщение, Источник.Автор, , , Неопределено);
	ЗаполнитьАдресатовСообщения(НовСообщение, МассивПолучателей);
	НовСообщение.Наименование = "Новая задача";
	НовСообщение.Записать();
КонецПроцедуры
//Козлов Е.А. Конец

//Козлов Е.А. Начало 02.02.2017
Процедура Renault_События_ПриВыполненииЗаявкиВАвтосервисСДопОборудованием(ИсточникСсылка) Экспорт
	УИДИсточникаСтрока = Строка(ИсточникСсылка.УникальныйИдентификатор());
	МассивСообщений = ПолучитьМассивВсехСообщений(УИДИсточникаСтрока);
	
	ВидСообщения = Справочники.Renault_ВидСообщения.УстановкаДополнительногоОборудования; 
	
	СоздатьСообщение(ИсточникСсылка, Неопределено, МассивСообщений, ВидСообщения);	
КонецПроцедуры

Процедура СоздатьСообщениеПоВыполниниюЗаявкиВАвтосервисСДопОборудованием(ИсточникСсылка, ВидСообщения)
	МассивПолучателей = НастройкиСотрудники(ВидСообщения, ИсточникСсылка.ДилерскийЦентр);
	
	Если МассивПолучателей.Количество() <> 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПРЕДСТАВЛЕНИЕ(Renault_CRM_ЗаявкаНаСервис.Автомобиль) КАК АвтомобильПредставление,
		               |	ПРЕДСТАВЛЕНИЕ(Renault_CRM_ЗаявкаНаСервис.Ссылка) КАК ЗаявкаНаСервисПредставление
		               |ИЗ
		               |	Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис";
		Запрос.УстановитьПараметр("ЗаявкаНаСервис", ИсточникСсылка);
		Результат = Запрос.Выполнить(); 		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Сообщение = "Установлено доп. оборудование по заявке - " + Выборка.ЗаявкаНаСервисПредставление + ", на автомобиль " +
		Выборка.АвтомобильПредставление + ".";	
		
		НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
		НовСообщение.ИдентификаторОбъекта = Строка(ИсточникСсылка.УникальныйИдентификатор());	
		НовСообщение.Обработано = Ложь;	
		НовСообщение.ВидСообщения = ВидСообщения; 		
		НовСообщение.ЗаполнитьДанными(ТекущаяДата(), Сообщение, ИсточникСсылка.Автор, , , Неопределено);
		ЗаполнитьАдресатовСообщения(НовСообщение, МассивПолучателей);
		НовСообщение.Наименование = "Установка доп. оборудования по заявке на сервис.";
		НовСообщение.Записать();
	КонецЕсли; 	
КонецПроцедуры
//Козлов Е.А. Конец

Процедура Автосервис_СоздатьСообщениеОПриемкеАвто(Источник, МассивСообщений, СрокОтображенияДней, Параметр)
	
	МассивПолучателей = новый Массив();
	МассивПолучателей.Добавить(Источник.Автор.Сотрудник);
	НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
	НовСообщение.ИдентификаторОбъекта = Строка(Источник.Ссылка.УникальныйИдентификатор());
	НовСообщение.Обработано = Ложь;
	НовСообщение.ВидСообщения = Параметр;
	Если Параметр = Справочники.Renault_ВидСообщения.Автосервис_ПриемкаНачата Тогда
		Сообщение = "Приемка автомобиля (" + Строка(Источник.Автомобиль)+ ") начата";
	Иначе
		Сообщение = "Приемка автомобиля (" + Строка(Источник.Автомобиль) + ") окончена.";
	КонецЕсли;
	НовСообщение.ЗаполнитьДанными(ТекущаяДата(), Сообщение, Неопределено, СрокОтображенияДней, Источник.Автор, Неопределено);
	ЗаполнитьАдресатовСообщения(НовСообщение, МассивПолучателей);
	НовСообщение.Наименование = "Автосервис - Приемка авто";
	НовСообщение.Записать();
	
КонецПроцедуры

Процедура Автосервис_СоздатьСообщениеОВыдачеАвто(Источник, МассивСообщений, СрокОтображенияДней, Параметр)
	
	МассивПолучателей = новый Массив();
	МассивПолучателей.Добавить(Источник.Автор.Сотрудник);
	НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
	НовСообщение.ИдентификаторОбъекта = Строка(Источник.Ссылка.УникальныйИдентификатор());
	НовСообщение.Обработано = Ложь;
	НовСообщение.ВидСообщения = Параметр;
	Если Параметр = Справочники.Renault_ВидСообщения.Автосервис_ВыдачаНачата Тогда
		Сообщение = "Выдача автомобиля начата. Автомобиль: " + Строка(Источник.Автомобиль);
	Иначе
		Сообщение = "Выдача автомобиля окончена. Автомобиль: " + Строка(Источник.Автомобиль);
	КонецЕсли;
	НовСообщение.ЗаполнитьДанными(ТекущаяДата(), Сообщение, Неопределено, СрокОтображенияДней, Источник.Автор, Неопределено);
	ЗаполнитьАдресатовСообщения(НовСообщение, МассивПолучателей);
	НовСообщение.Наименование = "Автосервис - Выдача авто";
	НовСообщение.Записать();
	
КонецПроцедуры

Процедура Автосервис_СоздатьСообщениеОМойкеАвто(Источник, МассивСообщений, СрокОтображенияДней, Параметр)
	
	МассивПолучателей = новый Массив();
	МассивПолучателей.Добавить(Источник.Автор.Сотрудник);
	НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
	НовСообщение.ИдентификаторОбъекта = Строка(Источник.Ссылка.УникальныйИдентификатор());
	НовСообщение.Обработано = Ложь;
	НовСообщение.ВидСообщения = Параметр;
	Если Параметр = Справочники.Renault_ВидСообщения.Автосервис_МойкаНачата Тогда
		Сообщение = "Мойка автомобиля начата. Автомобиль № " + Источник.ГосНомер;
	Иначе
		Сообщение = "Мойка автомобиля окончена. Автомобиль № " + Источник.ГосНомер;
	КонецЕсли;
	НовСообщение.ЗаполнитьДанными(ТекущаяДата(), Сообщение, Неопределено, СрокОтображенияДней, Источник.Автор, Неопределено);
	ЗаполнитьАдресатовСообщения(НовСообщение, МассивПолучателей);
	НовСообщение.Наименование = "Автосервис - Мойка авто";
	НовСообщение.Записать();
	
КонецПроцедуры

Процедура Автосервис_СоздатьСообщениеОКонтролеКачества(Источник, МассивСообщений, СрокОтображенияДней, Параметр)
	
	МассивПолучателей = новый Массив();
	МассивПолучателей.Добавить(Источник.Автор.Сотрудник);
	НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
	НовСообщение.ИдентификаторОбъекта = Строка(Источник.Ссылка.УникальныйИдентификатор());
	НовСообщение.Обработано = Ложь;
	НовСообщение.ВидСообщения = Параметр;
	Если Параметр = Справочники.Renault_ВидСообщения.Автосервис_КонтрольНачат Тогда
		Сообщение = "Контроль качества авто начат";
	Иначе
		Сообщение = "Контроль качества авто окончен";
	КонецЕсли;
	НовСообщение.ЗаполнитьДанными(ТекущаяДата(), Сообщение, Неопределено, СрокОтображенияДней, Источник.Автор, Неопределено);
	ЗаполнитьАдресатовСообщения(НовСообщение, МассивПолучателей);
	НовСообщение.Наименование = "Автосервис - Контроль качества авто";
	НовСообщение.Записать();
	
КонецПроцедуры

Процедура Автосервис_СоздатьСообщениеОХодеРабот(Источник, МассивСообщений, СрокОтображенияДней, Параметр)
	
	Запись = РегистрыСведений.Автомобили.СоздатьМенеджерЗаписи();
	Запись.Автомобиль = Источник.Автомобиль;
	Запись.ВидЗначения = Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер;
	Запись.Прочитать();
	ГосНомер = Запись.Значение;
	
	МассивПолучателей = новый Массив();
	МассивПолучателей.Добавить(Источник.Автор.Сотрудник);
	НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
	НовСообщение.ИдентификаторОбъекта = Строка(Источник.Ссылка.УникальныйИдентификатор());
	НовСообщение.Обработано = Ложь;
	НовСообщение.ВидСообщения = Параметр;
	
	Если Параметр = Справочники.Renault_ВидСообщения.Автосервис_РаботыНачаты Тогда
		Сообщение = "Работы по авто начаты. Автомобиль: " + Строка(Источник.Автомобиль);
	ИначеЕсли Параметр = Справочники.Renault_ВидСообщения.Автосервис_РаботыОкончены Тогда
		Сообщение = "Работы по авто окончены" + "Автомобиль: " + Строка(Источник.Автомобиль);
	Иначе
		Сообщение = "Работы по авто приостановлены" + "Автомобиль: " + Строка(Источник.Автомобиль);
	КонецЕсли;
	НовСообщение.ЗаполнитьДанными(ТекущаяДата(), Сообщение, Неопределено, СрокОтображенияДней, Источник.Автор, Неопределено);
	ЗаполнитьАдресатовСообщения(НовСообщение, МассивПолучателей);
	НовСообщение.Наименование = "Автосервис - Работы с авто: " + Строка(Источник.Автомобиль);
	НовСообщение.Записать();
	
КонецПроцедуры

Процедура Renault_События_ПриЗаписиЗаявкиНаСтраховкуОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт

	Если Источник.ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
	//Если не ЗначениеЗаполнено(Источник.Статус) тогда
	//	УстановитьСтатусЗаявкиНаСтраховку(Источник);
	//КонецЕсли;

	МассивВидовСобытий = Новый Массив();
	МассивВидовСобытий.Добавить(справочники.Renault_ВидСообщения.ОдобренаЗаявкаНаСтраховку);
	МассивВидовСобытий.Добавить(справочники.Renault_ВидСообщения.НоваяЗаявкаНаСтраховку);
	
	Если
		(ТипЗнч(Источник)=Тип("ДокументОбъект.Renault_РабочийЛистОФУ") И Источник.Состояние=Перечисления.Renault_CRM_СтатусЗаявокНаСтраховку.НаРассмотрении) 
		ИЛИ
		(ТипЗнч(Источник)=Тип("ДокументОбъект.Renault_CRM_ЗаявкаНаКредит") И (Источник.Статус=Перечисления.Renault_CRM_СтатусЗаявокНаСтраховку.НаРассмотрении) 
		ИЛИ 
		(Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ИспользоватьСтарыйФункционалКСО И НЕ Источник.Черновик И Не Источник.Закрыта И НЕ Источник.ВыполненаУспешно) )
	Тогда
		Сообщ = Неопределено;
		МассивПолучателей = НастройкиСотрудники(Справочники.Renault_ВидСообщения.НоваяЗаявкаНаСтраховку,Источник.ДилерскийЦентр);
		СоздаватьСобытие = Истина;
	   	Если ЗаписьСообщенияСуществует(Строка(Источник.Ссылка.УникальныйИдентификатор()),Сообщ) Тогда
			//НовСообщение =Сообщ.ПолучитьОбъект();
			//Если НовСообщение.ВидСообщения = справочники.Renault_ВидСообщения.НоваяЗаявкаНаСтраховку Тогда
			//	НовСообщение.обработано = Истина;
			//	НовСообщение.Записать();
			////Иначе
			СоздаватьСобытие = Ложь;
			//КонецЕсли;

		КонецЕсли;
		Если СоздаватьСобытие Тогда
			НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
			НовСообщение.ИдентификаторОбъекта = Строка(Источник.Ссылка.УникальныйИдентификатор());
			НовСообщение.Обработано = Ложь;
			НовСообщение.ВидСообщения = Справочники.Renault_ВидСообщения.НоваяЗаявкаНаСтраховку;
			НовСообщение.ЗаполнитьДанными(ТекущаяДата(),"Документ ""Заявка На Страховку"" №"+Строка(Источник.номер)+" от "+Строка(Источник.Дата)+" Отправлен на оформление",неопределено,0,неопределено,неопределено);
			ЗаполнитьАдресатовСообщения(НовСообщение,МассивПолучателей);
			НовСообщение.Записать();
		КонецЕсли;

	ИначеЕсли (ТипЗнч(Источник)=Тип("ДокументОбъект.Renault_РабочийЛистОФУ") И Источник.Состояние=Перечисления.Renault_CRM_СтатусЗаявокНаСтраховку.Выполнена)
		ИЛИ (
		ТипЗнч(Источник)=Тип("ДокументОбъект.Renault_CRM_ЗаявкаНаКредит") И	(Источник.Статус=Перечисления.Renault_CRM_СтатусЗаявокНаСтраховку.Выполнена ИЛИ Источник.Черновик Или Источник.ВыполненаУспешно ИЛИ Источник.Закрыта)
		)
	Тогда
		Сообщ = Неопределено;
		Если ЗаписьСообщенияСуществует(Строка(Источник.Ссылка.УникальныйИдентификатор()),Сообщ) Тогда
			НовСообщение =Сообщ.ПолучитьОбъект();
			НовСообщение.Комментарий ="Заявка обработана";
			НовСообщение.Обработано = Истина;
			НовСообщение.Записать();
		//Иначе
		//	НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
		//	
			
		КонецЕсли;
		//НовСообщение.ИдентификаторОбъекта = Строка(Источник.Ссылка.УникальныйИдентификатор());
		//НовСообщение.Обработано = Ложь;
		//НовСообщение.ВидСообщения = Справочники.Renault_ВидСообщения.ОдобренаЗаявкаНаГарантию;
		//НовСообщение.ЗаполнитьДанными(ТекущаяДата(),"Документ ""Заявка На Гарантию"" №"+Строка(Источник.номер)+" от "+Строка(Источник.Дата)+" Одобрен",неопределено,1,неопределено,неопределено);
		//НовСообщение.Записать();
		
		
	КонецЕсли;

КонецПроцедуры

///////////////////////////////////////////
//Общие процедуры и функции
//Старая панель сообщений

Функция НастройкиСотрудники(ВидСообщения,ДЦ) Экспорт
	
	МассивСотрудников = Новый Массив();
	Запрос = новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Renault_НастройкиСообщенийПользователям.ВидСообщения,
	|	Renault_НастройкиСообщенийПользователям.Отдел,
	|	Renault_НастройкиСообщенийПользователям.ДилерскийЦентр,
	|	Renault_НастройкиСообщенийПользователям.Должность
	|ИЗ
	|	РегистрСведений.Renault_НастройкиСообщенийПользователям КАК Renault_НастройкиСообщенийПользователям
	|ГДЕ
	|	Renault_НастройкиСообщенийПользователям.ВидСообщения = &ВидСообщения");
	Запрос.УстановитьПараметр("ВидСообщения", ВидСообщения);
	Настройки = Запрос.Выполнить().Выгрузить();
	Если Настройки.Количество() = 0 тогда
		//Зап = Новый Запрос("ВЫБРАТЬ
		//|	Сотрудники.Ссылка
		//|ИЗ
		//|	Справочник.Сотрудники КАК Сотрудники
		//|ГДЕ
		//|	Сотрудники.ЭтоГруппа = ЛОЖЬ
		//|	И Сотрудники.ПометкаУдаления = ЛОЖЬ");
		//Таблица = Зап.Выполнить().Выгрузить();
		//Для каждого Сотрудник Из Таблица Цикл
		//	Если МассивСотрудников.Найти(Сотрудник.Ссылка) = неопределено Тогда
		//		МассивСотрудников.Добавить(Сотрудник.Ссылка);
		//	КонецЕсли;
		//КонецЦикла;
		
	Иначе
		Для каждого Настройка Из Настройки Цикл
			Если ЗначениеЗаполнено(Настройка.ДилерскийЦентр) И ЗначениеЗаполнено(Настройка.Должность) Тогда
				Если ДЦ = Настройка.ДилерскийЦентр Тогда
					Зап = Новый Запрос("ВЫБРАТЬ
					|	Сотрудники.Ссылка,
					|	Сотрудники.Должность
					|ПОМЕСТИТЬ СотрудникиДЦ
					|ИЗ
					|	Справочник.Сотрудники КАК Сотрудники
					|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_Отделы.Подразделения КАК CRM_ОтделыПодразделения
					|		ПО (CRM_ОтделыПодразделения.Подразделение = Сотрудники.Подразделение)
					|ГДЕ
					|	CRM_ОтделыПодразделения.Ссылка.ДилерскийЦентр = &ДилерскийЦентр
					|	И НЕ CRM_ОтделыПодразделения.Подразделение ЕСТЬ NULL 
					|	И Сотрудники.ПометкаУдаления = ЛОЖЬ
					|	И Сотрудники.ЭтоГруппа = ЛОЖЬ
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	СотрудникиДЦ.Ссылка
					|ИЗ
					|	СотрудникиДЦ КАК СотрудникиДЦ
					|ГДЕ
					|	СотрудникиДЦ.Должность = &Должность");
					Зап.УстановитьПараметр("Должность",Настройка.Должность);
					Зап.УстановитьПараметр("ДилерскийЦентр",ДЦ);
					Таблица = Зап.Выполнить().Выгрузить();
					Для каждого Сотрудник Из Таблица Цикл
						Если МассивСотрудников.Найти(Сотрудник.Ссылка) = неопределено Тогда
							МассивСотрудников.Добавить(Сотрудник.Ссылка);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
			ИначеЕсли (НЕ ЗначениеЗаполнено(Настройка.ДилерскийЦентр)) И ЗначениеЗаполнено(Настройка.Должность) Тогда
				Зап = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Сотрудники.Ссылка
				|ИЗ
				|	Справочник.Сотрудники КАК Сотрудники
				|ГДЕ
				|	Сотрудники.Должность = &Должность
				|	И Сотрудники.ПометкаУдаления = ЛОЖЬ
				|	И Сотрудники.ЭтоГруппа = ЛОЖЬ");
				Зап.УстановитьПараметр("Должность",Настройка.Должность);
				Таблица = Зап.Выполнить().Выгрузить();
				Для каждого Сотрудник Из Таблица Цикл
					Если МассивСотрудников.Найти(Сотрудник.Ссылка) = неопределено Тогда
						МассивСотрудников.Добавить(Сотрудник.Ссылка);
					КонецЕсли;
				КонецЦикла;
				
			ИначеЕсли ( ЗначениеЗаполнено(Настройка.ДилерскийЦентр)) И (не ЗначениеЗаполнено(Настройка.Должность)) Тогда
				Если ДЦ = Настройка.ДилерскийЦентр Тогда
					Зап = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	Сотрудники.Ссылка,
					|	Сотрудники.Должность
					|ИЗ
					|	Справочник.Сотрудники КАК Сотрудники
					|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_Отделы.Подразделения КАК CRM_ОтделыПодразделения
					|		ПО (CRM_ОтделыПодразделения.Подразделение = Сотрудники.Подразделение)
					|ГДЕ
					|	CRM_ОтделыПодразделения.Ссылка.ДилерскийЦентр = &ДилерскийЦентр
					|	И НЕ CRM_ОтделыПодразделения.Подразделение ЕСТЬ NULL 
					|	И Сотрудники.ПометкаУдаления = ЛОЖЬ
					|	И Сотрудники.ЭтоГруппа = ЛОЖЬ");
					Зап.УстановитьПараметр("ДилерскийЦентр",ДЦ);
					Таблица = Зап.Выполнить().Выгрузить();
					Для каждого Сотрудник Из Таблица Цикл
						Если МассивСотрудников.Найти(Сотрудник.Ссылка) = Неопределено Тогда
							МассивСотрудников.Добавить(Сотрудник.Ссылка);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
			Иначе
				Зап = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Сотрудники.Ссылка
				|ИЗ
				|	Справочник.Сотрудники КАК Сотрудники
				|ГДЕ
				|	Сотрудники.ПометкаУдаления = ЛОЖЬ
				|	И Сотрудники.ЭтоГруппа = ЛОЖЬ");
				//Зап.УстановитьПараметр("ДилерскийЦентр",ДЦ);
				Таблица = Зап.Выполнить().Выгрузить();
				Для каждого Сотрудник Из Таблица Цикл
					Если МассивСотрудников.Найти(Сотрудник.Ссылка) = Неопределено Тогда
						МассивСотрудников.Добавить(Сотрудник.Ссылка);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивСотрудников;
	
КонецФункции

Функция НастройкиАдресатовОнлайнКонсультант(ВидСообщения, ДЦ, Отдел = Неопределено) Экспорт
	
	МассивСотрудников = Новый Массив();
	Настройки = Renault_ОнлайнКонсультант.ПолучитьНастройкиОнлайнКонсультант(ДЦ);
	Если Не (Настройки = неопределено) И Не(Настройки = Справочники.Renault_НастройкиОнлайнКонсультанта.ПустаяСсылка()) Тогда
		
		Отбор = Новый Структура();
		Отбор.Вставить("ВидСообщения", ВидСообщения);
		НужныеНастройки = Настройки.НастройкиПолучателейСообщений.НайтиСтроки(Отбор);
		Для Каждого Настройка Из НужныеНастройки Цикл
			
			Если ЗначениеЗаполнено(Настройка.Сотрудник) Тогда
				
				Если МассивСотрудников.Найти(Настройка.Сотрудник) = Неопределено Тогда
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь
					|ИЗ
					|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
					|ГДЕ
					|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь.Сотрудник = &Сотрудник
					|	И ВЫБОР
					|			КОГДА &Отдел = ЗНАЧЕНИЕ(Справочник.CRM_Отделы.ПустаяСсылка)
					|				ТОГДА ИСТИНА
					|			ИНАЧЕ Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.Отдел = &Отдел
					|		КОНЕЦ
					|	И (Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ПраваКЦАдминистратор = ИСТИНА
					|	ИЛИ Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ПраваКЦМенеджер = ИСТИНА)
					|УПОРЯДОЧИТЬ ПО Renault_ПользователиИШаблоныПравИНастроек.Пользователь.Наименование";
					Запрос.УстановитьПараметр("Сотрудник", Настройка.Сотрудник);
					Запрос.УстановитьПараметр("Отдел", ?(ЗначениеЗаполнено(Отдел), Отдел, Справочники.CRM_Отделы.ПустаяСсылка()));
					Результат = Запрос.Выполнить();
					Если НЕ Результат.Пустой() Тогда
						МассивСотрудников.Добавить(Настройка.Сотрудник);
					КонецЕсли;
				КонецЕсли;
				
			Иначе 
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь.Сотрудник КАК Сотрудник
				|ИЗ
				|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
				|ГДЕ
				|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
				|	И Renault_ПользователиИШаблоныПравИНастроек.Пользователь.Сотрудник ЕСТЬ НЕ NULL 
				|	И ВЫБОР
				|			КОГДА &Отдел = ЗНАЧЕНИЕ(Справочник.CRM_Отделы.ПустаяСсылка)
				|				ТОГДА ИСТИНА
				|			ИНАЧЕ Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.Отдел = &Отдел
				|		КОНЕЦ
				|	И ВЫБОР
				|			КОГДА &ВыбранныйОтдел = ЗНАЧЕНИЕ(Справочник.CRM_Отделы.ПустаяСсылка)
				|				ТОГДА ИСТИНА
				|			ИНАЧЕ Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.Отдел = &ВыбранныйОтдел
				|		КОНЕЦ
				|	И ВЫБОР
				|			КОГДА &Должность = ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
				|				ТОГДА ИСТИНА
				|			ИНАЧЕ Renault_ПользователиИШаблоныПравИНастроек.Пользователь.Сотрудник.Должность = &Должность
				|		КОНЕЦ
				|	И ВЫБОР
				|			КОГДА &ДилерскийЦентр = ЗНАЧЕНИЕ(Справочник.CRM_ДилерскиеЦентры.ПустаяСсылка)
				|				ТОГДА ИСТИНА
				|			ИНАЧЕ Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ДилерскийЦентр = &ДилерскийЦентр
				|		КОНЕЦ
				|	И (Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ПраваКЦАдминистратор = ИСТИНА
				|	ИЛИ Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ПраваКЦМенеджер = ИСТИНА)
				|УПОРЯДОЧИТЬ ПО Renault_ПользователиИШаблоныПравИНастроек.Пользователь.Сотрудник.Наименование";
				Запрос.УстановитьПараметр("Отдел",
				?(ЗначениеЗаполнено(Настройка.Отдел), Настройка.Отдел,Справочники.CRM_Отделы.ПустаяСсылка()));
				Запрос.УстановитьПараметр("ВыбранныйОтдел",
				?(ЗначениеЗаполнено(Отдел), Отдел, Справочники.CRM_Отделы.ПустаяСсылка()));
				Запрос.УстановитьПараметр("Должность",
				?(ЗначениеЗаполнено(Настройка.Должность), Настройка.Должность, Справочники.Должности.ПустаяСсылка()));
				Запрос.УстановитьПараметр("ДилерскийЦентр",
				?(ЗначениеЗаполнено(Настройка.ДилерскийЦентр), Настройка.ДилерскийЦентр, Справочники.CRM_ДилерскиеЦентры.ПустаяСсылка()));
				Таблица = Запрос.Выполнить().Выгрузить();
				Для Каждого СтрокаРезультата Из Таблица Цикл
					
					Если МассивСотрудников.Найти(СтрокаРезультата.Сотрудник) = неопределено Тогда
						МассивСотрудников.Добавить(СтрокаРезультата.Сотрудник);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат МассивСотрудников;
	
КонецФункции

Процедура ЗаполнитьАдресатовСообщения(НовСообщение, МассивПолучателей) Экспорт
	НовСообщение.Адресаты.Очистить();
	Для каждого Сотрудник из МассивПолучателей Цикл
		НовСтрока = НовСообщение.Адресаты.Добавить();
		НовСтрока.Сотрудник = Сотрудник;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПодпискаНаСобытиеОтменаПроеденияОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	// Вставить содержимое обработчика.
	УИД =Строка(Источник.Ссылка.УникальныйИдентификатор());
	Сообщение = неопределено;
	Если ЗаписьСообщенияСуществует(УИД,Сообщение) Тогда
		
		//Для Каждого Сообщение из Сообщения Цикл
		//	
		//	  СообщОб = Сообщение.Ссылка.ПолучитьОбъект();
		//	  СообщОб.Обработано = Истина;
		//	  СообщОб.Записать();
		//	
		//	
		//КонецЦикла;	
		
		НовСообщение = Сообщение.ПолучитьОбъект();
		//НовСообщение.Комментарий ="Заявка обработана";
		НовСообщение.Обработано = Истина;
		НовСообщение.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьНастрйокиПанелиСообщенийПоУмолчанию(ДЦ) Экспорт
	
	//На будущее
	
КонецПроцедуры

#Если Клиент Тогда

Процедура ПоказатьБаннер(Сообщение,Пользователь) Экспорт
	
	Попытка
		
		Если глРарус_Компонента<>Неопределено Тогда
			Тема = обОбрезатьСтроку(Формат(Сообщение.ДатаОтправки,"ДФ='дд.ММ.гг ЧЧ:мм'")+" "+Сообщение.ВидСообщения, 62, "…");
			ТелоСообщения = обОбрезатьСтроку(Сообщение.Сообщение,88,"…") + " <BR>";                        
			//ТелоСообщения = ТелоСообщения + "От: <a href='1Справочники.Пользователи.НайтиПоКоду("""+МенеджерЗаписи.Автор.Код+""")'>"+обОбрезатьСтроку(МенеджерЗаписи.Автор.Наименование,?(обЗначениеНеЗаполнено(МенеджерЗаписи.Объект),33,12),"…")+"</a> ";
			
			//Если НЕ обЗначениеНеЗаполнено(МенеджерЗаписи.Объект) Тогда
			//	ТелоСообщения = ТелоСообщения + " Объект: <a href='2"+ЗначениеВСтрокуВнутр(МенеджерЗаписи.Объект)+"'>"+обОбрезатьСтроку(МенеджерЗаписи.Объект,12,"…")+"</a>";
			//КонецЕсли;
			
			глРарус_Компонента.ПоказатьБаннер("Новое сообщение", Тема, ТелоСообщения, 3, 0, Ложь, "Баннер", Истина);
			ОтметитьБаннерКакПоказаный(Сообщение,Пользователь);
		КонецЕсли;
		
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры

#КонецЕсли

Функция БаннерУжеПоказывался(Сообщение,Пользователь) Экспорт
	Попытка	
		Менеджер = РегистрыСведений.Renault_ПоказанныеБаннерыСообщений.СоздатьМенеджерЗаписи();
		Менеджер.Сообщение = Сообщение.Ссылка;
		Менеджер.Пользователь = Пользователь;
		Менеджер.Прочитать();
		Если Менеджер.Выбран() тогда
			Возврат Менеджер.БаннерПоказан;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Исключение
		инфа = ИнформацияОбОшибке();
		Возврат ложь;
	КонецПопытки;
		
КонецФункции

Процедура ОтметитьБаннерКакПоказаный(Сообщение,Пользователь) Экспорт
	Попытка	
		Менеджер = РегистрыСведений.Renault_ПоказанныеБаннерыСообщений.СоздатьМенеджерЗаписи();
		Менеджер.Сообщение = Сообщение.Ссылка;
		Менеджер.Пользователь = Пользователь;
		Менеджер.БаннерПоказан = Истина;
		Менеджер.Записать();
	Исключение
		Инфа = ИнформацияОбОшибке();
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьМассивВсехСообщений(Ид)Экспорт
	
	МассивСообщений = Новый Массив();
	Зап = Новый Запрос("ВЫБРАТЬ
	                   |	Renault_СообщенияПользователю.Ссылка
	                   |ИЗ
	                   |	Справочник.Renault_СообщенияПользователю КАК Renault_СообщенияПользователю
	                   |ГДЕ
	                   |	Renault_СообщенияПользователю.ИдентификаторОбъекта = &Ид
	                   |	И Renault_СообщенияПользователю.ПометкаУдаления = ЛОЖЬ");
	Зап.УстановитьПараметр("Ид",Ид);
	Таблица = Зап.Выполнить().Выгрузить();
	Для Каждого  Сообщение Из Таблица Цикл
		МассивСообщений.Добавить(Сообщение.Ссылка);
	КонецЦикла;
	
	Возврат МассивСообщений;
	
КонецФункции

Процедура УстановитьОбработкуСообщения(МассивСообщений,МассивВидовСообщений = Неопределено,Комментарий ="") Экспорт
	
	ЗавершатьВсеВидыСообщений = (МассивВидовСообщений = Неопределено);
	Для Каждого Сообщ Из МассивСообщений Цикл
		ВидСообщенияВМассиве = Ложь;
		если не ЗавершатьВсеВидыСообщений тогда
			ВидСообщенияВМассиве = (МассивВидовСообщений.Найти(Сообщ.ВидСообщения) <> Неопределено);
		КонецЕсли;
		
		Если ЗавершатьВсеВидыСообщений Или ВидСообщенияВМассиве Тогда
			Если Сообщ.Обработано = Ложь Тогда
				ТекСообщение = Сообщ.ПолучитьОбъект();
				Если СтрДлина(СокрЛП(Комментарий))>0 Тогда
					ТекСообщение.Комментарий = Комментарий;
				КонецЕсли;
				текСообщение.ПоказыватьПо = текущаяДата();
				ТекСообщение.Обработано = Истина;
				ТекСообщение.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//Идентичный вид сообщений - такой ,который  исключает создание  сообщения с текущим видом сообщения
Процедура СоздатьСообщение(Источник, ИсточникСообщения, МассивСообщений, ВидСообщения,
	МассивИдентичныхВидовСообщений = Неопределено, МассивЗавершемыхВидовСообщений = Неопределено,
	СрокОтображенияДней = 0) Экспорт
	
	СоздаватьСообщение = (МассивИдентичныхВидовСообщений = Неопределено);
	//Создавать всегда?
	Если Не СоздаватьСообщение Тогда
		 //Если не всегда
		 //проверяем создавалось ли ранее событие индентичного вида
		СоздаватьСообщение = Не СообщениеУжеРанееСоздано(МассивСообщений, МассивИдентичныхВидовСообщений, ИсточникСообщения);
	КонецЕсли;
	
	Если СоздаватьСообщение Тогда
		
		УстановитьОбработкуСообщения(МассивСообщений,МассивЗавершемыхВидовСообщений,"Стадия завершена ");
		Если ВидСообщения = Справочники.Renault_ВидСообщения.НовыйКлиентБезМенеджера Тогда
			СоздатьСообщениеТрафикБезМенеджера(Источник,ИсточникСообщения,СрокОтображенияДней);
			
		ИначеЕсли ВидСообщения = Справочники.Renault_ВидСообщения.ОК_НовыйТрафик Тогда
			СоздатьСообщениеТрафикОнлайнКонсультанта(Источник, ИсточникСообщения, СрокОтображенияДней);
			
		ИначеЕсли ВидСообщения = Справочники.Renault_ВидСообщения.КЦ_НовыйЛид Тогда
			СоздатьСообщениеТрафикЛид(Источник, ИсточникСообщения, СрокОтображенияДней);
			
		ИначеЕсли ВидСообщения = Справочники.Renault_ВидСообщения.КЦ_НовоеПисьмо Тогда
			СоздатьСообщениеТрафикПисьмо(Источник, ИсточникСообщения, СрокОтображенияДней);
			
		ИначеЕсли ВидСообщения = Справочники.Renault_ВидСообщения.НовыйКлиентПереданМенеджеру Тогда
			СоздатьСообщениеТрафикПереданМенеджеру(Источник, ИсточникСообщения, МассивСообщений, СрокОтображенияДней);
			
		ИначеЕсли ВидСообщения = Справочники.Renault_ВидСообщения.ОформленДоговорСКлиентом Тогда
			СоздатьСообщениеОформленДоговорСКлиентом(Источник, МассивСообщений, СрокОтображенияДней);
			
		ИначеЕсли ВидСообщения = Справочники.Renault_ВидСообщения.НовыйДоговорСКлиентом Тогда
			СоздатьСообщениеНовыйДоговорСКлиентом(Источник, МассивСообщений, СрокОтображенияДней);
			
		ИначеЕсли ВидСообщения = Справочники.Renault_ВидСообщения.Автосервис_ПриемкаНачата
			ИЛИ ВидСообщения = Справочники.Renault_ВидСообщения.Автосервис_ПриемкаОкончена Тогда
			Автосервис_СоздатьСообщениеОПриемкеАвто(Источник, МассивСообщений, СрокОтображенияДней, ВидСообщения);
			
		ИначеЕсли ВидСообщения = Справочники.Renault_ВидСообщения.Автосервис_МойкаНачата
			ИЛИ ВидСообщения = Справочники.Renault_ВидСообщения.Автосервис_МойкаОкончена Тогда
			Автосервис_СоздатьСообщениеОМойкеАвто(Источник, МассивСообщений, СрокОтображенияДней, ВидСообщения);
			
		ИначеЕсли ВидСообщения = Справочники.Renault_ВидСообщения.Автосервис_КонтрольНачат
			ИЛИ ВидСообщения = Справочники.Renault_ВидСообщения.Автосервис_КонтрольЗавершен Тогда
			Автосервис_СоздатьСообщениеОКонтролеКачества(Источник, МассивСообщений, СрокОтображенияДней, ВидСообщения);
			
		ИначеЕсли ВидСообщения = Справочники.Renault_ВидСообщения.Автосервис_РаботыНачаты
			ИЛИ ВидСообщения = Справочники.Renault_ВидСообщения.Автосервис_РаботыОкончены
			ИЛИ ВидСообщения = Справочники.Renault_ВидСообщения.Автосервис_РаботыПриостановлены Тогда
			Автосервис_СоздатьСообщениеОХодеРабот(Источник, МассивСообщений, СрокОтображенияДней, ВидСообщения);
			
		ИначеЕсли ВидСообщения = Справочники.Renault_ВидСообщения.Автосервис_ВыдачаНачата
			ИЛИ ВидСообщения = Справочники.Renault_ВидСообщения.Автосервис_ВыдачаОкончена Тогда
			Автосервис_СоздатьСообщениеОВыдачеАвто(Источник, МассивСообщений, СрокОтображенияДней, ВидСообщения);
			
		ИначеЕсли ВидСообщения = Справочники.Renault_ВидСообщения.Автосклад_НоваяЗаявкаНаРезерв Тогда
			СоздатьСообщениеНоваяЗаявкаНаРезерв(Источник, СрокОтображенияДней, МассивЗавершемыхВидовСообщений, МассивСообщений);
			
		ИначеЕсли ВидСообщения = Справочники.Renault_ВидСообщения.Автосклад_ИзменениеСтатусаЗаявкиНаРезерв Тогда
			СоздатьСообщениеИзмененияСтатусаЗаявкиНаРезерв(Источник, СрокОтображенияДней, МассивЗавершемыхВидовСообщений, МассивСообщений);
		//Козлов Е.А. Начало 24.06.2016
		ИначеЕсли ВидСообщения = Справочники.Renault_ВидСообщения.НоваяЗадача Тогда
			СоздатьСообщениеПоНовойЗадаче(Источник, ВидСообщения);
		//Козлов Е.А. Конец
		//Козлов Е.А. Начало 02.02.2017
		ИначеЕсли ВидСообщения = Справочники.Renault_ВидСообщения.УстановкаДополнительногоОборудования Тогда
			СоздатьСообщениеПоВыполниниюЗаявкиВАвтосервисСДопОборудованием(Источник, ВидСообщения); 
		//Козлов Е.А. Конец
		КонецЕсли; 		
	Иначе
		
		Если ВидСообщения = Справочники.Renault_ВидСообщения.НовыйКлиентПереданМенеджеру Тогда
			Для Каждого Элемент ИЗ МассивСообщений Цикл
				Если Элемент.ВидСообщения = ВидСообщения Тогда
					
					Объект = Элемент.ПолучитьОбъект();
					Объект.ПоказыватьС = ТекущаяДата();
					Объект.ПоказыватьПо = ТекущаяДата() + 10;
					Объект.Записать();
					
					//Набор = РегистрыСведений.Renault_ПоказанныеБаннерыСообщений.СоздатьНаборЗаписей();
					//Набор.Отбор.Сообщение.Установить(Элемент);
					//Набор.Отбор.Пользователь.Установить(Справочники.Пользователи.НайтиПоРеквизиту("Сотрудник", ИсточникСообщения.Менеджер));
					//Набор.Прочитать();
					
					Запись = РегистрыСведений.Renault_ПоказанныеБаннерыСообщений.СоздатьМенеджерЗаписи();
					Запись.Сообщение = Элемент;
					Запись.Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("Сотрудник", ИсточникСообщения.Менеджер);
					Запись.Прочитать();
					Если Запись.Выбран() Тогда
						Запись.БаннерПоказан = Ложь;
						Запись.Записать();
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьСообщениеТрафикБезМенеджера(Источник, ИсточникЗаписи, СрокОтображенияДней = 0) Экспорт
	
	МассивПолучателей = НастройкиСотрудники(Справочники.Renault_ВидСообщения.НовыйКлиентБезМенеджера,ИсточникЗаписи.ДилерскийЦентр);
	НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
	НовСообщение.Наименование = "Новый клиент";
	НовСообщение.ИдентификаторОбъекта = ИсточникЗаписи.Идентификатор;
	НовСообщение.Обработано = Ложь;
	НовСообщение.ВидСообщения = Справочники.Renault_ВидСообщения.НовыйКлиентБезМенеджера;
	НовСообщение.ЗаполнитьДанными(ТекущаяДата(), "Клиенту требуется менеджер ", ИсточникЗаписи.Администратор, СрокОтображенияДней, Неопределено, СформироватьКлюч(Источник, ИсточникЗаписи.Идентификатор));
	ЗаполнитьАдресатовСообщения(НовСообщение, МассивПолучателей);
	НовСообщение.Записать();
	
КонецПроцедуры

Процедура СоздатьСообщениеНоваяЗаявкаНаРезерв(Источник, СрокОтображенияДней = 0, МассивУдаляемыхВидов = Неопределено, МассивСообщений = Неопределено) Экспорт
	Если (Не(МассивУдаляемыхВидов = Неопределено)) И (Не(МассивСообщений = Неопределено))Тогда
		Для Каждого Сообщ Из МассивСообщений Цикл
			Если МассивУдаляемыхВидов.Найти(Сообщ.ВидСообщения) <> Неопределено Тогда
				СообщОб = Сообщ.получитьОбъект();
				СообщОб.Обработано = Истина;
				СообщОб.пометкаудаления = Истина;
				СообщОб.Записать();
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;		

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_РабочиеЛисты.ДилерскийЦентр
	               |ИЗ
	               |	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	               |ГДЕ
	               |	Renault_РабочиеЛисты.IDK = &IDK";
	Запрос.УстановитьПараметр("IDK", Источник.РабочийЛист);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		МассивПолучателей = НастройкиСотрудники(Справочники.Renault_ВидСообщения.Автосклад_НоваяЗаявкаНаРезерв, Выборка.ДилерскийЦентр);
		НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
		НовСообщение.Наименование = "Новая заявка на резерв";
		НовСообщение.ИдентификаторОбъекта = Строка(Источник.Ссылка.УникальныйИдентификатор());;
		НовСообщение.Обработано = Ложь;
		НовСообщение.ВидСообщения = Справочники.Renault_ВидСообщения.Автосклад_НоваяЗаявкаНаРезерв;
		//НовСообщение.ЗаполнитьДанными(ТекущаяДата(),"Новая заявка на резерв от менеджера " + Строка(Источник.Менеджер), СрокОтображенияДней,неопределено,СформироватьКлюч(Источник,Строка(Источник.Ссылка.УникальныйИдентификатор())));
		НовСообщение.ЗаполнитьДанными(ТекущаяДата(),"Новая заявка на резерв от менеджера " + Строка(Источник.Менеджер), неопределено, СрокОтображенияДней, неопределено, неопределено);
		ЗаполнитьАдресатовСообщения(НовСообщение,МассивПолучателей);
		НовСообщение.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьСообщениеТрафикОнлайнКонсультанта(Источник, ИсточникЗаписи, СрокОтображенияДней =0) Экспорт
	
	ВидСообщения = Справочники.Renault_ВидСообщения.ОК_НовыйТрафик;
	МассивПолучателей = НастройкиАдресатовОнлайнКонсультант(ВидСообщения, ИсточникЗаписи.ДилерскийЦентр);
	НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
	НовСообщение.Наименование = "Новое обращение клиента в онлайн консультант";
	НовСообщение.ИдентификаторОбъекта = ИсточникЗаписи.Идентификатор;
	НовСообщение.Обработано = Ложь;
	НовСообщение.ВидСообщения = ВидСообщения;
	НовСообщение.ЗаполнитьДанными(ТекущаяДата(), "Клиенту требуется консультация ", ИсточникЗаписи.Администратор, СрокОтображенияДней, Неопределено, СформироватьКлюч(Источник, ИсточникЗаписи.Идентификатор));
	ЗаполнитьАдресатовСообщения(НовСообщение, МассивПолучателей);
	НовСообщение.Записать();
	
КонецПроцедуры

Процедура СоздатьСообщениеТрафикЛид(Источник, ИсточникЗаписи, СрокОтображенияДней = 0) экспорт
	
	ВидСообщения =Справочники.Renault_ВидСообщения.КЦ_НовыйЛид;
	МассивПолучателей = НастройкиАдресатовОнлайнКонсультант(ВидСообщения, ИсточникЗаписи.ДилерскийЦентр);
	НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
	НовСообщение.Наименование = "Новое обращение клиента в онлайн консультант";
	НовСообщение.ИдентификаторОбъекта = ИсточникЗаписи.Идентификатор;
	НовСообщение.Обработано = Ложь;
	НовСообщение.ВидСообщения = ВидСообщения;
	НовСообщение.ЗаполнитьДанными(ТекущаяДата(), "Клиенту требуется консультация ", ИсточникЗаписи.Администратор, СрокОтображенияДней, Неопределено, СформироватьКлюч(Источник, ИсточникЗаписи.Идентификатор));
	ЗаполнитьАдресатовСообщения(НовСообщение, МассивПолучателей);
	НовСообщение.Записать();
	
КонецПроцедуры

Процедура СоздатьСообщениеТрафикПисьмо(Источник, ИсточникЗаписи, СрокОтображенияДней = 0) экспорт
	
	ВидСообщения =Справочники.Renault_ВидСообщения.КЦ_НовоеПисьмо;
	МассивПолучателей = НастройкиАдресатовОнлайнКонсультант(ВидСообщения, ИсточникЗаписи.ДилерскийЦентр);
	НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
	НовСообщение.Наименование = "Новое письмо от клиента в онлайн консультант";
	НовСообщение.ИдентификаторОбъекта = ИсточникЗаписи.Идентификатор;
	НовСообщение.Обработано = Ложь;
	НовСообщение.ВидСообщения = ВидСообщения;
	НовСообщение.ЗаполнитьДанными(ТекущаяДата(), "Клиенту требуется консультация ", ИсточникЗаписи.Администратор, СрокОтображенияДней, Неопределено, СформироватьКлюч(Источник, ИсточникЗаписи.Идентификатор));
	ЗаполнитьАдресатовСообщения(НовСообщение, МассивПолучателей);
	НовСообщение.Записать();
	
КонецПроцедуры

Процедура ЗакрытьСообщенияСДругимМенеджеромПриПередачеТрафика(Менеджер, МассивСообщений) Экспорт
	
	Для Каждого Сообщ Из МассивСообщений Цикл
		Если Сообщ.ВидСообщения = Справочники.Renault_ВидСообщения.НовыйКлиентПереданМенеджеру Тогда
			Если Менеджер <> Сообщ.получатель Тогда
				СообщОб = Сообщ.Ссылка.получитьОбъект();
				СообщОб.Обработано = Истина;
				СообщОб.ПоказыватьПо = ТекущаяДата();
				СообщОб.Комментарий ="Трафик передан другому менеджеру";
				СообщОб.Записать();
         	КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьСообщениеТрафикПереданМенеджеру(Источник, ИсточникЗаписи, МассивСообщений, СрокОтображенияДней = 0) экспорт
	
	ЗакрытьСообщенияСДругимМенеджеромПриПередачеТрафика(ИсточникЗаписи.Менеджер, МассивСообщений);
	МассивПолучателей = Новый Массив();
	МассивПолучателей.Добавить(ИсточникЗаписи.Менеджер);
	НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
	НовСообщение.Наименование = "Новый клиент";
	ЗаполнитьАдресатовСообщения(НовСообщение, МассивПолучателей);
	НовСообщение.ИдентификаторОбъекта = ИсточникЗаписи.Идентификатор;
	НовСообщение.Обработано = Ложь;
	НовСообщение.ВидСообщения = Справочники.Renault_ВидСообщения.НовыйКлиентПереданМенеджеру;
	НовСообщение.ЗаполнитьДанными(ТекущаяДата(),
	?(ИсточникЗаписи.ТипТрафика = Справочники.CRM_ТипТрафика.OnlineКонсультант, "На вас переведен трафик(онлайн консультант)", "На вас назначен трафик"), ИсточникЗаписи.Администратор, СрокОтображенияДней, ИсточникЗаписи.Менеджер, СформироватьКлюч(Источник, ИсточникЗаписи.Идентификатор));
	НовСообщение.Записать();
	
КонецПроцедуры

Процедура СоздатьСообщениеНовыйДоговорСКлиентом(Источник,МассивСообщений,СрокОтображенияДней = 0) экспорт
	Запись = Renault_CRM.ПолучитьЗаписьРЛПоIDK(Источник.IDK);
	МассивПолучателей = НастройкиСотрудники(Справочники.Renault_ВидСообщения.НовыйДоговорСКлиентом,Запись.ДилерскийЦентр);
	НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
	НовСообщение.ИдентификаторОбъекта = Строка(Источник.Ссылка.УникальныйИдентификатор());
	НовСообщение.Обработано = Ложь;
	НовСообщение.ВидСообщения = Справочники.Renault_ВидСообщения.НовыйДоговорСКлиентом;
	НовСообщение.ЗаполнитьДанными(ТекущаяДата(),"Договор №"+Строка(Источник.НомерДоговора)+" от "+Строка(Источник.Дата)+" Отправлен на оформление",неопределено,СрокОтображенияДней,неопределено,неопределено);
	ЗаполнитьАдресатовСообщения(НовСообщение,МассивПолучателей);
	НовСообщение.Записать();
	
	  		
КонецПроцедуры

Процедура СоздатьСообщениеОформленДоговорСКлиентом(Источник,МассивСообщений,СрокОтображенияДней = 0) экспорт
	Запись = Renault_CRM.ПолучитьЗаписьРЛПоIDK(Источник.IDK);
	МассивПолучателей = новый Массив();
	МассивПолучателей.Добавить(Запись.Сотрудник);
	НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
	НовСообщение.ИдентификаторОбъекта = Строка(Источник.Ссылка.УникальныйИдентификатор());
	НовСообщение.Обработано = Ложь;
	НовСообщение.Получатель = Запись.Сотрудник;
	НовСообщение.ВидСообщения = Справочники.Renault_ВидСообщения.ОформленДоговорСКлиентом;
	НовСообщение.ЗаполнитьДанными(ТекущаяДата(),"Договор №"+Строка(Источник.НомерДоговора)+" от "+Строка(Источник.Дата)+" Оформлен",неопределено,СрокОтображенияДней,неопределено,неопределено);
	ЗаполнитьАдресатовСообщения(НовСообщение,МассивПолучателей);
	НовСообщение.Записать();
  		
КонецПроцедуры

Процедура СоздатьСообщениеПоРаботеСЖалобами(Источник, ВидСообщения, ПараметрыСообщения) Экспорт
	
	МассивПолучателей = Новый Массив();
	
	Если ТипЗнч(ПараметрыСообщения.Исполнитель) = Тип("СправочникСсылка.CRM_Отделы") Тогда
		Пользователи = Renault_CRM.ПолучитьСписокСотрудниковПоОтделу(ПараметрыСообщения.Исполнитель);
	Иначе
		Пользователи = Новый СписокЗначений;
		Пользователи.Добавить(ПараметрыСообщения.Исполнитель);
	КонецЕсли;
	
	Для Каждого Стр Из Пользователи Цикл
		МассивПолучателей.Добавить(Стр.Значение);	
	КонецЦикла;
	
	НовСообщение = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
	НовСообщение.ИдентификаторОбъекта = Строка(Источник.Ссылка.УникальныйИдентификатор());	
	НовСообщение.Обработано = Ложь;	
	НовСообщение.ВидСообщения = ВидСообщения;
	Сообщение = ПараметрыСообщения.Содержание;
	НовСообщение.ЗаполнитьДанными(ТекущаяДата(), Сообщение, ПараметрыСообщения.Автор, , , Неопределено);
	ЗаполнитьАдресатовСообщения(НовСообщение, МассивПолучателей);
	НовСообщение.Наименование = ПараметрыСообщения.Содержание;
	НовСообщение.Комментарий = ПараметрыСообщения.Комментарий;
	НовСообщение.Записать();	
	
КонецПроцедуры
 

Функция СообщениеУжеРанееСоздано(МассивСообщений,МассивИдентичныхВидовСообщений,ИсточникЗаписи = неопределено) Экспорт
	
	СообщениеУжеСоздано = Ложь;
	Для Каждого Сообщ Из МассивСообщений Цикл
		ВидСообщенияВМассиве = (МассивИдентичныхВидовСообщений.Найти(Сообщ.ВидСообщения) <> Неопределено);
		Если ВидСообщенияВМассиве Тогда
			Если Сообщ.ВидСообщения = Справочники.Renault_ВидСообщения.НовыйКлиентПереданМенеджеру Тогда
				Если ИсточникЗаписи <> неопределено Тогда
					Если (ИсточникЗаписи.Менеджер = Сообщ.получатель)И Не Сообщ.Обработано  Тогда
						СообщениеУжеСоздано = Истина;
						Прервать;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли Сообщ.ВидСообщения = Справочники.Renault_ВидСообщения.НовыйКлиентБезМенеджера Тогда
				Если Не Сообщ.Обработано Тогда
					СообщениеУжеСоздано = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли Сообщ.ВидСообщения = Справочники.Renault_ВидСообщения.НовыйДоговорСКлиентом Тогда
				Если Не Сообщ.Обработано Тогда
					СообщениеУжеСоздано = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли Сообщ.ВидСообщения = Справочники.Renault_ВидСообщения.ОформленДоговорСКлиентом Тогда
				Если Не Сообщ.Обработано Тогда
					СообщениеУжеСоздано = Истина;
					Прервать;
				КонецЕсли;
			Иначе
				СообщениеУжеСоздано = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СообщениеУжеСоздано;
	
КонецФункции

Процедура ОзнакомилсяССобытием(Событие,Пользователь) Экспорт
	ПараметрыОтбор = Новый Структура();
	ПараметрыОтбор.Вставить("Сотрудник",Пользователь.Сотрудник);
	ПараметрыОтбор.Вставить("Ознакомлен",Ложь);
	СобытиеОб = Событие.Ссылка.ПолучитьОбъект();
	Строки = СобытиеОб.Адресаты.НайтиСтроки(ПараметрыОтбор);
	Если Строки.количество() = 0 Тогда
		ЗановоОзнакомитьсяССобытием(Событие,Пользователь);
	Иначе
		Для Каждого ТекСтрока из Строки Цикл
			ТекСтрока.Ознакомлен = Истина;
			ТекСтрока.ДатаОзнакомления = ТекущаяДата();
		КонецЦикла;
		СобытиеОб.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ЗановоОзнакомитьсяССобытием(Событие,Пользователь) Экспорт
	ПараметрыОтбор = Новый Структура();
	ПараметрыОтбор.Вставить("Сотрудник",Пользователь.Сотрудник);
	ПараметрыОтбор.Вставить("Ознакомлен",Истина);
	СобытиеОб = Событие.Ссылка.ПолучитьОбъект();
	Строки = СобытиеОб.Адресаты.НайтиСтроки(ПараметрыОтбор);
	Если Строки.Количество()>0 Тогда
		Для Каждого ТекСтрока из Строки Цикл
			ТекСтрока.Ознакомлен = Ложь;
			ТекСтрока.ДатаОзнакомления = Дата(1,1,1,0,0,0);
		КонецЦикла;
		СобытиеОб.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьСтатусЗаявкиНаОборудование(Источник)Экспорт
	
	Если Источник.Черновик = Истина Тогда
		Источник.Статус = Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.Черновик;
	Иначе
		Если  Источник.Закрыта = Истина Тогда
			Если Источник.ВыполненаУспешно = Истина Тогда
				Источник.Статус = Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.Выполнена;
			Иначе
				Источник.Статус = Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.Отменена;
			КонецЕсли;
		Иначе
			Источник.Статус = Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.НаРассмотрении;
		КонецЕсли;	
    КонецЕсли;	
КонецПроцедуры

Процедура УстановитьСтатусЗаявкиНаТрейдИн(Источник)Экспорт
	
	Если Источник.Черновик = Истина Тогда
		Источник.Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.Черновик;
	Иначе
		Если  Источник.Закрыта = Истина Тогда
			Если Источник.ВыполненаУспешно = Истина Тогда
				Источник.Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.Выполнена;
			Иначе
				Источник.Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.Отменена;
			КонецЕсли;
			
		Иначе 
			Источник.Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.НаРассмотрении;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

//Процедура УстановитьСтатусЗаявкиНаКредит(Источник)Экспорт
//	
//	Если Источник.Черновик = Истина Тогда
//		Источник.Статус = Перечисления.Renault_CRM_СтатусЗаявокНаКредит.Черновик;
//	Иначе
//		Если  Источник.Закрыта = Истина Тогда
//			Если Источник.ВыполненаУспешно = Истина Тогда
//				Источник.Статус = Перечисления.Renault_CRM_СтатусЗаявокНаКредит.Выполнена;
//			Иначе
//				Источник.Статус = Перечисления.Renault_CRM_СтатусЗаявокНаКредит.Отменена;
//			КонецЕсли;
//			
//		Иначе 
//			Источник.Статус = Перечисления.Renault_CRM_СтатусЗаявокНаКредит.НаРассмотрении;
//		КонецЕсли;	
//	КонецЕсли;
//КонецПроцедуры

Процедура УстановитьСтатусЗаявкиНаГарантию(Источник)Экспорт
	
	Если Источник.Черновик = Истина Тогда
		Источник.Статус = Перечисления.Renault_CRM_СтатусЗаявокНаГарантию.Черновик;
	Иначе
		Если  Источник.Закрыта = Истина Тогда
			Если Источник.ВыполненаУспешно = Истина Тогда
				Источник.Статус = Перечисления.Renault_CRM_СтатусЗаявокНаГарантию.Выполнена;
			Иначе
				Источник.Статус = Перечисления.Renault_CRM_СтатусЗаявокНаГарантию.Отменена;
			КонецЕсли;
			
		Иначе 
			Источник.Статус = Перечисления.Renault_CRM_СтатусЗаявокНаГарантию.НаРассмотрении;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

//Процедура УстановитьСтатусЗаявкиНаСтраховку(Источник)Экспорт
//	
//	Если Источник.Черновик = Истина Тогда
//		Источник.Статус = Перечисления.Renault_CRM_СтатусЗаявокНаСтраховку.Черновик;
//	Иначе
//		Если  Источник.Закрыта = Истина Тогда
//			Если Источник.ВыполненаУспешно = Истина Тогда
//				Источник.Статус = Перечисления.Renault_CRM_СтатусЗаявокНаСтраховку.Выполнена;
//			Иначе
//				Источник.Статус = Перечисления.Renault_CRM_СтатусЗаявокНаСтраховку.Отменена;
//			КонецЕсли;
//			
//		Иначе 
//			Источник.Статус = Перечисления.Renault_CRM_СтатусЗаявокНаСтраховку.НаРассмотрении;
//		КонецЕсли;	
//	КонецЕсли;
//КонецПроцедуры

Функция ВернутьОписаниеСтатусаРезерва(Статус, Клиент = Неопределено)
	
	Если Статус = Перечисления.CRM_СтатусыРезервовАвтомобилей.РезервУтвержден Тогда
		Ответ = "Утвержден резерв";
	ИначеЕсли Статус = Перечисления.CRM_СтатусыРезервовАвтомобилей.РезервОтклонен Тогда
		Ответ = "Отклонен резерв";
	ИначеЕсли Статус = Перечисления.CRM_СтатусыРезервовАвтомобилей.РезервСнят Тогда
		Ответ = "Снят резерв";
	Иначе 
		Ответ = "";
	КонецЕсли;
	Если ЗначениеЗаполнено(Клиент) Тогда
		Ответ = Ответ + " для клиента " + Строка(Клиент);
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция СформироватьКлюч(Запись,Ид)
	
	Результат = Новый Структура();
	Ответ = Новый Массив();
	Для каждого Зн Из Запись.Отбор Цикл
		Сравнение = новый Структура();
		
		Сравнение.Вставить(Зн.Имя, Зн.Значение);
		Сравнение.Вставить("ВидСравнения", Зн.ВидСравнения);
		Ответ.Добавить(Сравнение);
	КонецЦикла;
	Результат.Вставить("МассивОтборов", Ответ);
	Результат.Вставить("Ид", Ид);
	Возврат Результат;
	
КонецФункции

Функция ЗаписьСообщенияСуществует(Ид,Сообщение)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Renault_СообщенияПользователю.Ссылка
	                      |ИЗ
	                      |	Справочник.Renault_СообщенияПользователю КАК Renault_СообщенияПользователю
	                      |ГДЕ
	                      |	Renault_СообщенияПользователю.ИдентификаторОбъекта = &Ид
	                      |	И Renault_СообщенияПользователю.Обработано = ЛОЖЬ");
	Запрос.УстановитьПараметр("Ид", Ид);	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Сообщение = Выборка.Ссылка;
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

