&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Группы=Параметры.Группы;
	ЭлементыГрупп=Параметры.ЭлементыГрупп;
	Если Параметры.Свойство("Заголовок") Тогда ЭтаФорма.Заголовок=Параметры.Заголовок;КонецЕсли;
	Если Параметры.Свойство("ЗаголовокГруппы") Тогда 
		ЭтаФорма.Элементы.ГруппаЗначение.Заголовок=Параметры.ЗаголовокГруппы;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИндексГруппы=-1;
	Группа=Новый СписокЗначений;
	ЕСли ТипЗнч(Группы)<>Тип("СписокЗначений") Тогда
		Группы=Новый СписокЗначений;
	ИначеЕсли Группы.Количество()>0 Тогда
		Элементы.Группы.ТекущаяСтрока=Группы[0];
		ГруппыПриАктивизацииСтроки();
		ИндексГруппы=0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПриАктивизацииСтроки(Элемент=Неопределено)
	Если ГруппаИзменена И ИндексГруппы>=0 Тогда
		Группы[ИндексГруппы].Значение=Группа;
		ГруппыИзменены=Истина;
		ГруппаИзменена=Ложь;
	КонецЕсли;
	ТекСтр=Элементы.Группы.ТекущаяСтрока;
	Если ТекСтр=Неопределено Тогда
		Группа=Новый СписокЗначений;
		ИндексГруппы=-1;
	Иначе
		ТекЕлем=Группы.НайтиПоИдентификатору(ТекСтр);
		ИндексГруппы=Группы.Индекс(ТекЕлем);
		Группа=ТекЕлем.Значение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Для Инд=1 по 999 Цикл
			Если ПроверкаНаДубликат("Группа"+Строка(Инд)) Тогда
				ТекСтр=Группы[ИндексГруппы];
				ТекСтр.Представление="Группа"+Строка(Инд);
				ТекСтр.Значение=Новый СписокЗначений;
				ГруппаИзменена=Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Функция ПроверкаНаДубликат(Текст,БезСтр=Неопределено)
	Если Пустаястрока(Текст) Тогда Возврат Ложь;КонецЕсли;
	Для Каждого Стр Из Группы Цикл
		Если Стр.Представление=Текст и Стр<>БезСтр Тогда Возврат Ложь;КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ГруппыПредставлениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ЕСли ПроверкаНаДубликат(Текст,Группы[ИндексГруппы]) Тогда
		ГруппаИзменена=Истина;
	Иначе
		СтандартнаяОбработка=Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГруппаДобавить(Команда)
	Список=ЭлементыГрупп.Скопировать();
	Для Каждого Стр из Группа Цикл
		Эл=Список.НайтиПоЗначению(Стр.Значение);
		Если Эл<>Неопределено Тогда
			Список.Удалить(Эл);
		КонецЕсли;
	КонецЦикла;
	ОО=Новый ОписаниеОповещения("ГруппаДобавление",ЭтаФорма);
	Список.ПоказатьОтметкуЭлементов(ОО,"Отметьте добавляемые элементы");
КонецПроцедуры

&НаКлиенте
Процедура ГруппаДобавление(Список,Доп=Неопределено) Экспорт
	Если Список=Неопределено Тогда Возврат;КонецЕсли;
	Для Каждого Стр Из Список Цикл
		Если Стр.Пометка Тогда
			Группа.Добавить(Стр.Значение);
			ГруппаИзменена=Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПослеУдаления(Элемент)
	ГруппыИзменены=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГруппаПослеУдаления(Элемент)
	ГруппаИзменена=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ГруппыПриАктивизацииСтроки();
	Если ГруппыИзменены Тогда
		ЭтаФорма.Закрыть(Группы);
	Иначе
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

	
