
////#Область ОбработчикиСобытий

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Если Не ПометкаУдаления Тогда
		РежимЗаписи		= РежимЗаписиДокумента.Проведение;
		РежимПроведения = РежимПроведенияДокумента.Неоперативный;
	КонецЕсли; 
		
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	ЗаполнитьСуммуВзаиморасчетов();
	
	СуммаДокумента = Модели.Итог("Сумма");
	
КонецПроцедуры       

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
	Если ЭтоНовый() И ДанныеЗаполнения = Неопределено Тогда
		
		Валюта 				 = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		Представитель 		 = DMS_ЗначениеНастроекПовтИсп.ПолучитьОсновногоПредставителяПоНастройке(Автор,Представитель);
		ДилерскийЦентр 		 = DMS_ЗначениеНастроекПовтИсп.ПолучитьОсновногоДилерскийЦентрПоНастройке(Автор,ДилерскийЦентр);
		
		НоваяСтрока = Модели.Добавить();
		НоваяСтрока.КодСтроки = 1;
	
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ИнициализироватьДокумент();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	DMS_РекламныеКампанииСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	Документы.DMS_ОтчетПоРекламнойКампании.ИнициализироватьДанныеДокумента(Ссылка,ДополнительныеСвойства);
	
	DMS_РекламныеКампанииСервер.ОтразитьРекламныеКампании(ДополнительныеСвойства,Движения,Отказ);
	
	DMS_РекламныеКампанииСервер.ОтразитьСтатусОтчетаПоРекламнойКампании(Ссылка,Ссылка,Дата,Справочники.DMS_СтатусыОтчетовПоРекламнойКампании.Заявлен,Отказ);	
	
	DMS_РекламныеКампанииСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	DMS_РекламныеКампанииСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	
	DMS_ОбщегоНазначенияСервер.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

////#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	////#Область СлужебныеПроцедурыИФункции

////#Область ИнициализацияИЗаполнение

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Автор  = DMS_РекламныеКампанииСервер.ТекущийПользователь();
	ВАрхиве    = Ложь;
	Согласован = Ложь;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("РекламнаяКампания") Тогда
			ЗаполнитьНаОснованииРекламнойКампании(ДанныеЗаполнения.РекламнаяКампания);
		КонецЕсли; 
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.DMS_РекламнаяКампания") Тогда
		ЗаполнитьНаОснованииРекламнойКампании(ДанныеЗаполнения);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииРекламнойКампании(ДанныеЗаполнения)
		
	Если ДанныеЗаполнения.ВидОперации = Перечисления.DMS_ВидыОперацийРекламнойКампании.СозданиеШаблона Тогда
		ВызватьИсключение "Создание отчетов возможно только для кампаний с операцией <Размещение кампании>";
	КонецЕсли; 
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеЗаполнения", ДанныеЗаполнения);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РекламнаяКампания.Валюта КАК Валюта,
		|	РекламнаяКампания.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	РекламнаяКампания.Представитель КАК Представитель,
		|	РекламнаяКампания.ДилерскийЦентр КАК ДилерскийЦентр,
		|	РекламнаяКампания.Ссылка КАК РекламнаяКампания,
		|	РекламнаяКампания.СуммаДокумента КАК СуммаДокумента,
		|	РекламнаяКампания.КооперативнаяРеклама КАК КооперативнаяРеклама,
		|	РекламнаяКампания.ТипКампании КАК ТипКампании
		|ИЗ
		|	Документ.DMS_РекламнаяКампания КАК РекламнаяКампания
		|ГДЕ
		|	РекламнаяКампания.Ссылка = &ДанныеЗаполнения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Модели.КодСтроки КАК КодСтроки,
		|	Модели.Модель КАК Модель,
		|	Модели.ПлановаяСтоимость КАК ПлановаяСтоимость,
		|	0 КАК Сумма
		|ИЗ
		|	Документ.DMS_РекламнаяКампания.Модели КАК Модели
		|ГДЕ
		|	Модели.Ссылка = &ДанныеЗаполнения";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Шапка = РезультатЗапроса[0].Выбрать();
	
	Шапка.Следующий();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,Шапка);
	
	Модели.Загрузить(РезультатЗапроса[1].Выгрузить());

КонецПроцедуры
 
////#КонецОбласти

// Процедура заполняет сумму взаиморасчетов в шапке документа.
//
// Параметры:
//	ДокументОбъект - ДокументОбъект - Текущий документ
// 
Процедура ЗаполнитьСуммуВзаиморасчетов() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
		|	ТаблицаМодели.НомерСтроки,
		|	ТаблицаМодели.Модель,
		|	ТаблицаМодели.КодСтроки,
		|	ТаблицаМодели.Сумма,
		|	ТаблицаМодели.СуммаВзаиморасчеты,
		|	&ВалютаВзаиморасчетов
		|ПОМЕСТИТЬ ТаблицаДокумента
		|ИЗ
		|	&Модели КАК ТаблицаМодели
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|	
		|ВЫБРАТЬ
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	ТаблицаДокумента.Модель КАК Модель,
		|	ТаблицаДокумента.КодСтроки КАК КодСтроки,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|
		|	ВЫБОР КОГДА ТаблицаДокумента.СуммаВзаиморасчеты = 0 ТОГДА
		|		(ТаблицаДокумента.Сумма *
		|		ЕСТЬNULL(КурсыВалютДокумента.Курс, 1) * 
		|		ЕСТЬNULL(КурсыВалют.Кратность, 1)
		|		) / (
		|		ЕСТЬNULL(КурсыВалют.Курс, 1) * 
		|		ЕСТЬNULL(КурсыВалютДокумента.Кратность, 1)
		|		)
		|	ИНАЧЕ
		|		ТаблицаДокумента.СуммаВзаиморасчеты
		|	КОНЕЦ КАК СуммаВзаиморасчеты
		|ИЗ
		|	ТаблицаДокумента КАК ТаблицаДокумента
		|	
		|	// Определим курс валюты документа.
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|		РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &Валюта) КАК КурсыВалютДокумента
		|	ПО
		|		Истина
		|		
		|	// Определим курс валюты взаиморасчетов.
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|		РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалют
		|	ПО
		|		ТаблицаДокумента.ВалютаВзаиморасчетов = КурсыВалют.Валюта
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицаДокумента.НомерСтроки
		|;");
		
	Запрос.УстановитьПараметр("Дата", 				  Дата);
	Запрос.УстановитьПараметр("Валюта", 	 		  Валюта);
	Запрос.УстановитьПараметр("ВалютаВзаиморасчетов", ВалютаВзаиморасчетов);
	Запрос.УстановитьПараметр("Модели", 			  Модели.Выгрузить());
	
	// Получим таблицу документа с рассчитанной суммой взаиморасчетов.
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрокаТаблицы = Модели.Найти(Выборка.НомерСтроки, "НомерСтроки");
		СтрокаТаблицы.СуммаВзаиморасчеты = Выборка.СуммаВзаиморасчеты;
		
	КонецЦикла;
	
КонецПроцедуры

////#КонецОбласти

#КонецЕсли
