Перем ИмяФайлаЭксел;

Процедура ОтправитьПисьмо() Экспорт
	
	Сообщить("Формирование и отправка письма");
	
	ПодготовкаФайлаДляОтправки();
	
	НаписатьИОтправитьПисьмо();
	 
КонецПроцедуры

Процедура ПисьмаОтправить() Экспорт
	
	Сообщить("Формирование и отправка писем");
	
	Если ПолучателиПисем.Количество() = 0 Тогда
		Сообщить("ОШИБКА! Не заполнены получатели писем");
		Форма = ЭтотОбъект.ПолучитьФорму("ФормаПолучатели");
		Если Не Форма.Открыта() Тогда
			Форма.Открыть();
		КонецЕсли; 
		Возврат;
 	КонецЕсли; 
 	
	ПодготовкаФайлаДляОтправкиПисем();
	
	НаписатьИОтправитьПисьмаПоСписку();
	 
КонецПроцедуры

Процедура НаписатьИОтправитьПисьмаПоСписку() Экспорт
	
	Сотр =ПараметрыСеанса.Пользователь.Сотрудник;
	
	АдресЭлПочты = НайтиЭлАдрес(Сотр);
	
	Сообщить("Адрес электронной почты : "+АдресЭлПочты+" для "+Сотр);
	
	ЭтоПервый  = Истина;
	мКому = Новый Массив;
	мКопии = Новый Массив;
	
	Для каждого Эл Из ПолучателиПисем Цикл
		АдресЭлПочты = Эл.АдресЭлПочты;
	    Если обЗначениеНеЗаполнено(АдресЭлПочты) Тогда
			Продолжить;
		КонецЕсли;  
		Если ЭтоПервый Тогда
  			мКому.Добавить(АдресЭлПочты);
			ЭтоПервый=Ложь;
 		Иначе	
	 		мКопии.Добавить(АдресЭлПочты);	 
 		КонецЕсли; 
 	КонецЦикла; 
  	
 	СсылкаДляПисьма = "";
 	Суть = "Проверьте просроченные заказы по своему ДЦ. Письмо сформировано: "+ТекущаяДата();
 	ТемаПисьма = Суть;
	
	СоздатьИОтправитьЭлПисьмо(мКому,мКопии,ТемаПисьма,Суть,СсылкаДляПисьма,ИмяФайлаЭксел);
 
КонецПроцедуры

Процедура НаписатьИОтправитьПисьмаЗамечанийПоСписку(ИмяФайлаЗамечанийЭксел) Экспорт
	
	Сотр =ПараметрыСеанса.Пользователь.Сотрудник;
	
	АдресЭлПочты = НайтиЭлАдрес(Сотр);
	
	Сообщить("Адрес электронной почты : "+АдресЭлПочты+" для "+Сотр);
	
	ЭтоПервый  = Истина;
	мКому = Новый Массив;
	мКопии = Новый Массив;
	
	Для каждого Эл Из ПолучателиПисем Цикл
		АдресЭлПочты = Эл.АдресЭлПочты;
	    Если обЗначениеНеЗаполнено(АдресЭлПочты) Тогда
			Продолжить;
		КонецЕсли;  
		Если ЭтоПервый Тогда
  			мКому.Добавить(АдресЭлПочты);
			ЭтоПервый=Ложь;
 		Иначе	
	 		мКопии.Добавить(АдресЭлПочты);	 
 		КонецЕсли; 
 	КонецЦикла; 
  	
 	СсылкаДляПисьма = "";
 	Суть = "Обработайте Замечания по своему ДЦ. Письмо сформировано: "+ТекущаяДата();
 	ТемаПисьма = Суть;
	
	СоздатьИОтправитьЭлПисьмо(мКому,мКопии,ТемаПисьма,Суть,СсылкаДляПисьма,ИмяФайлаЗамечанийЭксел);
 
КонецПроцедуры




Процедура НаписатьИОтправитьПисьмо() Экспорт
	
	Сотр =ПараметрыСеанса.Пользователь.Сотрудник;
	
	АдресЭлПочты = НайтиЭлАдрес(Сотр);
	
	Сообщить("Адрес электронной почты : "+АдресЭлПочты+" для "+Сотр);

	мКому = Новый Массив;
	Если не обЗначениеНеЗаполнено(ЭлектроннаяПочта) Тогда
		мКому.Добавить(ЭлектроннаяПочта);
 	КонецЕсли; 	
	
	мКопии = Новый Массив;
	Если не обЗначениеНеЗаполнено(АдресЭлПочты) Тогда
		мКопии.Добавить(АдресЭлПочты);	 
 	КонецЕсли; 
 	
 	СсылкаДляПисьма = "";
 	Суть = "Проверьте просроченные заказы. Письмо сформировано: "+ТекущаяДата();
 	ТемаПисьма = Суть;
	
	СоздатьИОтправитьЭлПисьмо(мКому,мКопии,ТемаПисьма,Суть,СсылкаДляПисьма,ИмяФайлаЭксел);
 
КонецПроцедуры
 
Функция НайтиЭлАдрес(ВыбСотрудник) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	КИ.Объект КАК Объект,
	|	КИ.Вид КАК Вид,
	|	КИ.Представление КАК Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КИ
	|ГДЕ
	|	КИ.Объект = &ВыбСотрудник
	|	И КИ.Вид = &ВыбВид";
	
	Запрос.УстановитьПараметр("ВыбСотрудник", ВыбСотрудник);
	Запрос.УстановитьПараметр("ВыбВид", Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Представление;
	КонецЦикла;
	
	Возврат ""; 
	
КонецФункции	

Процедура ПодготовкаФайлаДляОтправкиПисем() Экспорт
	
	Если обЗначениеНеЗаполнено(ДилерскийЦентр) Тогда
		Предупреждение("ОШИБКА! Не заполнен Дилерский Центр. Подготовка файла для письма невозможна");
  		Возврат;
 	КонецЕсли; 
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ЭтотОбъект.ПолучитьМакет("МакетПечать1");
	// Заголовок
	
	Если ДилерскийЦентр <> Справочники.ДилерскиеЦентры.Общий Тогда
		Область = Макет.ПолучитьОбласть("Заголовок");
		Область.Параметры.ДилерскийЦентр=ДилерскийЦентр;
		ТабДок.Вывести(Область);
		
		Отбор = Новый Структура;
		Отбор.Вставить("ДилерскийЦентр",ДилерскийЦентр);
		
		Для ёё=1 По 5 Цикл
			
			ТекущийЦвет = "";
			
			Если ёё=1 Тогда
				Выборка = ЭтотОбъект.ТчЗаказы1.НайтиСтроки(Отбор);	
				ТекущийЦвет = "Первая неделя";
			ИначеЕсли ёё=2 Тогда
				Выборка = ЭтотОбъект.ТчЗаказы2.НайтиСтроки(Отбор);	
				ТекущийЦвет = "Вторая неделя";
			ИначеЕсли ёё=3 Тогда
				Выборка = ЭтотОбъект.ТчЗаказы3.НайтиСтроки(Отбор);	
				ТекущийЦвет = "Третья неделя";
			ИначеЕсли ёё=4 Тогда
				Выборка = ЭтотОбъект.ТчЗаказы4.НайтиСтроки(Отбор);	
				ТекущийЦвет = "Четвертая неделя";
			Иначе 
				Выборка = ЭтотОбъект.ТчЗаказы5.НайтиСтроки(Отбор);	
				ТекущийЦвет = "Пятая неделя и более";
			КонецЕсли; 
			
			Если Выборка.Количество() > 0 Тогда
				Область = Макет.ПолучитьОбласть("ЗаголовокЦвета");
				Область.Параметры.ТекущийЦвет=ТекущийЦвет;
				ТабДок.Вывести(Область);
				Область = Макет.ПолучитьОбласть("РеквизитыШапка");
				ТабДок.Вывести(Область);
			КонецЕсли; 
			
			Реквизиты = Макет.ПолучитьОбласть("Реквизиты");
			Для каждого Эл Из Выборка Цикл
				Реквизиты.Параметры.Заполнить(эл);
				ТабДок.Вывести(Реквизиты);
			КонецЦикла;   
			
		КонецЦикла; 
 		
	Иначе	
		
		//Область = Макет.ПолучитьОбласть("Заголовок");
		//Область.Параметры.ДилерскийЦентр=ДилерскийЦентр;
		//ТабДок.Вывести(Область);
		
		СЗ_ДЦ = Новый СписокЗначений;
		
		Для ёё=1 По 5 Цикл
			
			Если ёё=1 Тогда
				ТчЗаказы = ТчЗаказы1;
			ИначеЕсли ёё=2 Тогда
				ТчЗаказы = ТчЗаказы2;
			ИначеЕсли ёё=3 Тогда
				ТчЗаказы = ТчЗаказы3;
			ИначеЕсли ёё=4 Тогда
				ТчЗаказы = ТчЗаказы4;
			ИначеЕсли ёё=5 Тогда
				ТчЗаказы = ТчЗаказы5;
			КонецЕсли; 
			
			Для Каждого Стр из ТчЗаказы Цикл 
				ТекДЦ = Стр.ДилерскийЦентр;
				Если СЗ_ДЦ.НайтиПоЗначению(ТекДЦ) = Неопределено тогда 
					СЗ_ДЦ.Добавить(ТекДЦ); 
				КонецЕсли; 	
			КонецЦикла;	
			
		КонецЦикла;
		
		Сообщить("Размер списка дилерских центров: "+СЗ_ДЦ.Количество());
		
		//   	Для Каждого зн из сз1 цикл 
		//   		если сз2.НайтиПоЗначению(зн.Значение)=неопределено тогда 
		//   			сз2.Добавить(зн.Значение); 
		//   		КонецЕсли 
		//   	КонецЦикла;
		
		Для каждого ТекДЦ  Из СЗ_ДЦ Цикл
			
			Область = Макет.ПолучитьОбласть("Заголовок");
			Область.Параметры.ДилерскийЦентр=ТекДЦ;
			ТабДок.Вывести(Область);
			
			Отбор = Новый Структура;
			Отбор.Вставить("ДилерскийЦентр",ТекДЦ.Значение);
			
			ТабДок.НачатьАвтогруппировкуСтрок();
			
			Для ёё=1 По 5 Цикл
				
				ТекущийЦвет = "";
				
				Если ёё=1 Тогда
					Выборка = ЭтотОбъект.ТчЗаказы1.НайтиСтроки(Отбор);	
					ТекущийЦвет = "Первая неделя";
				ИначеЕсли ёё=2 Тогда
					Выборка = ЭтотОбъект.ТчЗаказы2.НайтиСтроки(Отбор);	
					ТекущийЦвет = "Вторая неделя";
				ИначеЕсли ёё=3 Тогда
					Выборка = ЭтотОбъект.ТчЗаказы3.НайтиСтроки(Отбор);	
					ТекущийЦвет = "Третья неделя";
				ИначеЕсли ёё=4 Тогда
					Выборка = ЭтотОбъект.ТчЗаказы4.НайтиСтроки(Отбор);	
					ТекущийЦвет = "Четвертая неделя";
				Иначе 
					Выборка = ЭтотОбъект.ТчЗаказы5.НайтиСтроки(Отбор);	
					ТекущийЦвет = "Пятая неделя и более";
				КонецЕсли; 
				
				Если Выборка.Количество() > 0 Тогда
					Область = Макет.ПолучитьОбласть("ЗаголовокЦвета");
					Область.Параметры.ТекущийЦвет=ТекущийЦвет;
					ТабДок.Вывести(Область,1,"ДЦ",Ложь);
					Область = Макет.ПолучитьОбласть("РеквизитыШапка");
					ТабДок.Вывести(Область,2,"Шапка",Ложь);
				КонецЕсли; 
				
				Реквизиты = Макет.ПолучитьОбласть("Реквизиты");
				Для каждого Эл Из Выборка Цикл
					Реквизиты.Параметры.Заполнить(эл);
					ТабДок.Вывести(Реквизиты,2,"Заказы",Ложь);
				КонецЦикла;   
				
  			КонецЦикла; //По 5 закдладкам
			
			ТабДок.ЗакончитьАвтогруппировкуСтрок();
			
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЦикла; // По ДЦ
		
 	КонецЕсли; 
 	
	ТабДок.АвтоМасштаб=Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	Если ДилерскийЦентр <> Справочники.ДилерскиеЦентры.Общий Тогда
		ТабДок.ФиксацияСверху=5;
 	КонецЕсли; 
	 
	ТабДок.Показать("Вот что получилось "+ДилерскийЦентр );
	
	WSS=Новый COMОбъект("WScript.Shell");
	//Сообщить(WSS.SpecialFolders().Item("Desktop"));
	ИмяФайлаЭксел=СокрЛП(WSS.SpecialFolders().Item("Desktop"))+"\"+СокрЛП(ДилерскийЦентр)+".XLSX";
	
	Сообщить("Имя  файла = "+ИмяФайлаЭксел);
 
	ТабДок.Записать(ИмяФайлаЭксел,ТипФайлаТабличногоДокумента.XLSX);


	

КонецПроцедуры
 

Процедура ПодготовкаФайлаДляОтправки() Экспорт
	
	Если обЗначениеНеЗаполнено(ДилерскийЦентр) Тогда
		Предупреждение("ОШИБКА! Не заполнен Дилерский Центр. Подготовить файл для письма невозможно");
  		Возврат;
 	КонецЕсли; 
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ЭтотОбъект.ПолучитьМакет("МакетПечать1");
	// Заголовок
	
	Область = Макет.ПолучитьОбласть("Заголовок");
 	Область.Параметры.ДилерскийЦентр=ДилерскийЦентр;
	ТабДок.Вывести(Область);
	
	Отбор = Новый Структура;
	Отбор.Вставить("ДилерскийЦентр",ДилерскийЦентр);
	
	Для ёё=1 По 5 Цикл
		
		ТекущийЦвет = "";
		
		Если ёё=1 Тогда
			Выборка = ЭтотОбъект.ТчЗаказы1.НайтиСтроки(Отбор);	
			ТекущийЦвет = "Первая неделя";
		ИначеЕсли ёё=2 Тогда
			Выборка = ЭтотОбъект.ТчЗаказы2.НайтиСтроки(Отбор);	
			ТекущийЦвет = "Вторая неделя";
		ИначеЕсли ёё=3 Тогда
			Выборка = ЭтотОбъект.ТчЗаказы3.НайтиСтроки(Отбор);	
			ТекущийЦвет = "Третья неделя";
		ИначеЕсли ёё=4 Тогда
			Выборка = ЭтотОбъект.ТчЗаказы4.НайтиСтроки(Отбор);	
			ТекущийЦвет = "Четвертая неделя";
		Иначе 
			Выборка = ЭтотОбъект.ТчЗаказы5.НайтиСтроки(Отбор);	
			ТекущийЦвет = "Пятая неделя и более";
		КонецЕсли; 
		
		Если Выборка.Количество() > 0 Тогда
			Область = Макет.ПолучитьОбласть("ЗаголовокЦвета");
			Область.Параметры.ТекущийЦвет=ТекущийЦвет;
			ТабДок.Вывести(Область);
			Область = Макет.ПолучитьОбласть("РеквизитыШапка");
			ТабДок.Вывести(Область);
		КонецЕсли; 
		
		Реквизиты = Макет.ПолучитьОбласть("Реквизиты");
		Для каждого Эл Из Выборка Цикл
			Реквизиты.Параметры.Заполнить(эл);
			ТабДок.Вывести(Реквизиты);
		КонецЦикла;   
 		
	КонецЦикла; 
	
	ТабДок.АвтоМасштаб=Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	//ТабДок.Показать("Вот что получилось "+ДилерскийЦентр );
	
	WSS=Новый COMОбъект("WScript.Shell");
	//Сообщить(WSS.SpecialFolders().Item("Desktop"));
	ИмяФайлаЭксел=СокрЛП(WSS.SpecialFolders().Item("Desktop"))+"\"+СокрЛП(ДилерскийЦентр)+".XLSX";
	
	Сообщить("Имя  файла = "+ИмяФайлаЭксел);
 
	ТабДок.Записать(ИмяФайлаЭксел,ТипФайлаТабличногоДокумента.XLSX);
	
КонецПроцедуры  //ПодготовкаФайлаДляОтправки

 Процедура СоздатьИОтправитьЭлПисьмо(мКому,МКопия, Тема, Тело,Основание,ИмяФайлаЭксель) Экспорт 
	 ЭлПисьмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
	 ЭлПисьмо.ОтправительПредставление = "Альфа авто <1c@sokolmotors.ru>" ;
	 //Для Каждого стр из мКому цикл
	 //	ЭлПисьмо.ПолучателиПредставление =  ЭлПисьмо.ПолучателиПредставление +?( ЭлПисьмо.ПолучателиПредставление="",стр,";"+стр); 
	 //КонецЦикла;  
 	 Для Каждого стр из мКому цикл
		 СтрокаПолуатели = ЭлПисьмо.Получатели.Добавить();
		 СтрокаПолуатели.АдресЭлектроннойПочты=стр;
		 СтрокаПолуатели.Представление=стр;
		 СтрокаПолуатели.КодГруппыАдреса             =Перечисления.КодГруппыАдресаЭлектронногоПисьма.Кому ;
		 ЭлПисьмо.ПолучателиПредставление =  ЭлПисьмо.ПолучателиПредставление +?( ЭлПисьмо.ПолучателиПредставление="",стр,";"+стр); 
	 КонецЦикла;
 	 Для Каждого стр из МКопия цикл
		 СтрокаПолуатели = ЭлПисьмо.Получатели.Добавить();
		 СтрокаПолуатели.АдресЭлектроннойПочты=стр;
		 СтрокаПолуатели.Представление=стр;
		 СтрокаПолуатели.КодГруппыАдреса             =Перечисления.КодГруппыАдресаЭлектронногоПисьма.Копии ;
  	 КонецЦикла;

	 ЭлПисьмо.Тема = Тема;
	 ЭлПисьмо.ТекстПисьма= Тело;
	 ЭлПисьмо.ДокументОснование = Основание;
	 ЭлПисьмо.УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.Альфа;
	 ЭлПисьмо.ГруппаПисем = Справочники.ГруппыПисемЭлектроннойПочты.НайтиПоНаименованию("Исходящие");
	 ЭлПисьмо.Важность = Перечисления.Важность.Высокая;
	 //ЭлПисьмо.ДатаОтправления =ТекущаяДата();
	 ЭлПисьмо.Дата = ТекущаяДата()  ;
	 ЭлПисьмо.ХозОперация = Справочники.ХозОперации.ЭлектронноеПисьмо;
	 ЭлПисьмо.УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.Альфа;	
	 ЭлПисьмо.Организация =   ПараметрыСеанса.Пользователь.Организация;
	 ЭлПисьмо.ПодразделениеКомпании = ПараметрыСеанса.Пользователь.Подразделение;
	 ЭлПисьмо.Автор   = ПараметрыСеанса.Пользователь;
	 ЭлПисьмо.ФорматТекста = Перечисления.ФорматТекста.ПростойТекст; 
	 
	 ЭлПисьмо.ЕстьВложения=Истина;
	 
	 МассивВложений = Новый Массив;
	 МассивВложений.Добавить(ИмяФайлаЭксель);
	 
	 ДобавитьВложенияВПисьмо(ЭлПисьмо.ПрикрепленныеФайлы, МассивВложений);
	 
	 
	 ЭлПисьмо.Записать();
	 СтруктураРежимовОбмена = Новый Структура("Получить, Отправить", Ложь, Истина);
	 СоединениеСПочтовымСервером = эпПодключитьсяКПочтовомуСерверу(ЭлПисьмо.УчетнаяЗапись, СтруктураРежимовОбмена);
	 Если СоединениеСПочтовымСервером <> Неопределено Тогда
		 Если эпОтправитьПисьмо(ЭлПисьмо.ЭтотОбъект, СоединениеСПочтовымСервером) Тогда
			 эпОтключитьсяОтПочтовогоСервера(СоединениеСПочтовымСервером);
			 //Закрыть();
		 Иначе
			 эпОтключитьсяОтПочтовогоСервера(СоединениеСПочтовымСервером);
		 КонецЕсли;	
	 КонецЕсли;
	 
 КонецПроцедуры	
 
 Процедура ДобавитьВложенияВПисьмо(ПрикрепленныеФайлы, МассивВложений)
	 
	 Для Каждого ПолученноеИмяФайла Из МассивВложений Цикл
		 
		 ИмяФайла = ПолученноеИмяФайла;
		 
		 Файл = Новый Файл(ИмяФайла);
		 
		 Пока Найти(ИмяФайла,"\")>0 Цикл
			 ИмяФайла = Прав(ИмяФайла,СтрДлина(ИмяФайла) - Найти(ИмяФайла,"\"));
		 КонецЦикла;	
		 
		 //Если Файл.Размер() > 26214400 Тогда
		 //	
		 //	Ответ = Вопрос("Размер добавляемого файла """ + ИмяФайла + """
		 //	|больше 25 Mb. Добавить ?", РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Нет,"Внимание!");
		 //	Если Ответ = КодВозвратаДиалога.Нет Тогда
		 //		Продолжить;
		 //	ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
		 //		Возврат;
		 //	КонецЕсли; 
		 //КонецЕсли;
		 
		 НоваяСтрока = ПрикрепленныеФайлы.Добавить();
		 НоваяСтрока.Имя = ОбрезатьИмяФайла(ИмяФайла, 100, Истина);
		 
		 //#Если Клиент Тогда 
		 Состояние("Добавляется файл: " + НоваяСтрока.Имя);
		 //#КонецЕсли
		 ДвоичныйФайл = Новый ДвоичныеДанные(Файл.ПолноеИмя);
		 НоваяСтрока.Файл = ПолучитьХранилищеЗначений(ДвоичныйФайл);
		 //НоваяСтрока.Файл = Новый ХранилищеЗначения(Новый ДвоичныеДанные(Файл.ПолноеИмя), Новый СжатиеДанных());
		 НоваяСтрока.Размер = Файл.Размер();
		 
		 //Попытка
		 //	УдалитьФайлы(ПолученноеИмяФайла);
		 //Исключение
		 //	Сообщить("Не удалось удалить файл: " +	ПолученноеИмяФайла);
		 //КонецПопытки
		 
	 КонецЦикла;
	 
 КонецПроцедуры // ДобавитьВложенияВПисьмо()
 
 // Функция корректно обрезает имя файла если оно  больше 100 символов, 
 // чтобы осталось расширение. (рфОбрезатьИмяФайла("ОченьДлинноеИмяФайла.txt",20) -> ОченьДлинноеИмяФ.txt)
 //
 // Параметры
 //  ИмяФайла 		   – Строка, содержащая имя файла, неважно с именем каталога или без.
 //  КоличествоСимволов – Число, кол-во символов, до которого необходимо урезать имя файла.
 //  ВыводитьСообщение  – Булево, признак необходимости вывести сообщение что имя файла обрезано.
 //
 // Возвращаемое значение:
 //  Строка   – обрезанное имя файла.
 //
 Функция ОбрезатьИмяФайла(Знач ИмяФайла, КоличествоСимволов, ВыводитьСообщение=Ложь) Экспорт
	 
	 Если СтрДлина(ИмяФайла) > КоличествоСимволов Тогда
		 Если ВыводитьСообщение Тогда
			 Сообщить("Имя файла """+ИмяФайла+""" обрезано, так как его длина больше "+КоличествоСимволов+" символов", СтатусСообщения.Информация);
		 КонецЕсли; 
		 РасширениеФайла = рфПолучитьРасширениеФайла(ИмяФайла);
		 СамоИмяФайла = Лев(ИмяФайла, СтрДлина(ИмяФайла)-СтрДлина(РасширениеФайла)-1);
		 СамоИмяФайла = Лев(СамоИмяФайла, КоличествоСимволов-СтрДлина(РасширениеФайла)-1);
		 ИмяФайла = СамоИмяФайла + "." + РасширениеФайла;
	 КонецЕсли;
	 
	 Возврат ИмяФайла;
	 
 КонецФункции // ОбрезатьИмяФайла()
 
 Функция ПолучитьХранилищеЗначений(Файл)
	 
	 Возврат Новый ХранилищеЗначения(Файл, Новый СжатиеДанных());
	 
 КонецФункции