Функция ПолучитьИдентификатор_DMS() Экспорт
	
	ТекСтрока = "";

    //Проверим в какой константе хранится версия релиза.
    //В типовых 1С - НомерВерсииКонфигурации
    //в Рарус - НомерРелизаКонфигурации
    //Если НЕ Метаданные.Константы.Найти("НомерВерсииКонфигурации") = неопределено тогда
    //	КонстантаВерсии = Константы.НомерВерсииКонфигурации;
    //Иначе
    //	КонстантаВерсии = Константы.НомерРелизаКонфигурации;
    //КонецЕсли;
    //КонстантаВерсии = "2.5.7.63";

    // Хардкод
    //НомерВерсии = КонстантаВерсии.Получить();
    НомерВерсии = "2.5.7.63";

    ДатаВерсии = Константы.EDR_ДатаРелиза.Получить();

	Пока СтрДлина(НомерВерсии) < 10 Цикл
		НомерВерсии = НомерВерсии + " ";
	КонецЦикла;

	ТекСтрока = ТекСтрока + НомерВерсии;										//Version number of the DMS
	ТекСтрока = ТекСтрока + Формат(ДатаВерсии, "ДФ=yyyyMMdd");					//Version date of the DMS
	ТекСтрока = ТекСтрока + Формат(ТекущаяДата(), "ДФ=yyyyMMdd");				//Creation date of the generated file
	ТекВремя  = EDR_ОбщийМодуль.ФорматироватьСтроку(СтрЗаменить(Формат(ТекущаяДата(), "ДЛФ=T"),":",""),6,"0", Истина);				//Creation time of the generated file
	ТекСтрока = ТекСтрока + ТекВремя;
	

	Возврат ТекСтрока;
	
КонецФункции

//Работа с номерами документов
Функция ПолучитьНомерДляПечати(ЗаказНаряд, КоличествоСимволов = 5) Экспорт
	
	НомерДокумента = дкПолучитьНомерДляПечати(ЗаказНаряд);
	
	//Теперь берем только 6 символов с права
	НомерДокумента = Прав(СокрЛП(НомерДокумента), 5);
	
	НомерДокумента = СтрЗаменить(СтрЗаменить(НомерДокумента, "/",""),"\","");
	НомерДокумента = СтрЗаменить(СтрЗаменить(НомерДокумента, ",",""),"-","");
	НомерДокумента = СтрЗаменить(НомерДокумента, ".","");
	
	Пока СтрДлина(НомерДокумента) < КоличествоСимволов Цикл
		НомерДокумента = "0" + НомерДокумента;
	КонецЦикла;
	
	Возврат НомерДокумента;
	
КонецФункции // дкПолучитьНомерДляПечати()

Функция ПолучитьТипВладельца(ФормаСобственности) Экспорт
	
	Если ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо 
	 или ФормаСобственности = Перечисления.ФормыСобственности.Прочее тогда
	 	Возврат "P";
	Иначе
		Возврат "S";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСуммуБезНалога(СуммаСНДС, ставкаНалога) Экспорт
	
	СуммаБезНалога = (СуммаСНДС/(100 + ставкаНалога))*100;
	Возврат СуммаБезНалога;
КонецФункции

Функция ПолучитьСуммуНалога(ЗаказНарядСумма, ставкаНалога) Экспорт
	
	СуммаНалога = (ЗаказНарядСумма /(100 + ставкаНалога))*ставкаНалога;
	Возврат СуммаНалога;
	
КонецФункции

Функция ПолучитьПолныйНомерЗаказНаряда(ЗаказНаряд) Экспорт
	
	НомерДокумента = ЗаказНаряд.Номер;
	
	Пока СтрДлина(НомерДокумента) < 20 Цикл
		НомерДокумента = "0" + НомерДокумента;
	КонецЦикла;

	Возврат НомерДокумента;
КонецФункции

Функция ПолучитьКонтакты(Контрагент) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	КонтактнаяИнформация.Тип,
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.Вид,
	|	КонтактнаяИнформация.Поле1,
	|	КонтактнаяИнформация.Поле2,
	|	КонтактнаяИнформация.Поле3,
	|	КонтактнаяИнформация.Поле4,
	|	КонтактнаяИнформация.Поле5,
	|	КонтактнаяИнформация.Поле6,
	|	КонтактнаяИнформация.Поле7,
	|	КонтактнаяИнформация.Поле8,
	|	КонтактнаяИнформация.Поле9,
	|	КонтактнаяИнформация.Поле10,
	|	КонтактнаяИнформация.Поле11,
	|	КонтактнаяИнформация.Поле12,
	|	КонтактнаяИнформация.ГородскойРайон,
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Контрагент"
	);
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Возврат Выгрузка;
	
КонецФункции
