
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Владелец) Тогда
		Объект.Владелец=Справочники.Renault_КредитныеПредложения.РНБанк();
	КонецЕсли;	
	
//	//отбор регистра сведений КредитныеПредложения (история обмена кредитных предложений) по id
//	Отбор=РегистрСведенийКредитныеПредложения.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	Отбор.ВидСравнения=ВидСравненияКомпоновкиДанных.Содержит;
//	Отбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("id");
//	Отбор.ПравоеЗначение=Объект.id;
КонецПроцедуры
