Функция ЗаписатьДанныеВРегистр(Период) Экспорт
	
	Renault_Открытый.СостояниеДляПользователя("Перенос изменений в регистр тарифов");
	
	РезультатЗаписи = Ложь;
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	TariffPR_Номенклатура_Temp.Реферанс КАК Реферанс,
	|	TariffPR_Номенклатура_Temp.Семья КАК Семья,
	|	TariffPR_Номенклатура_Temp.Сегмент КАК Сегмент,
	|	ВЫБОР
	|		КОГДА спрНоменклатура.Ссылка ЕСТЬ NULL 
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		ИНАЧЕ спрНоменклатура.Ссылка
	|	КОНЕЦ КАК Номенклатура,
	|	TariffPR_Номенклатура_Temp.PNC_склад_руб_без_НДС КАК PNC_склад_руб_без_НДС,
	|	TariffPR_Номенклатура_Temp.PNC_срочная_руб_без_НДС КАК PNC_срочная_руб_без_НДС,
	|	TariffPR_Номенклатура_Temp.PNC_агент_руб_без_НДС КАК PNC_агент_руб_без_НДС,
	|	TariffPR_Номенклатура_Temp.PCL_руб_без_НДС КАК PCL_руб_без_НДС,
	|	TariffPR_Номенклатура_Temp.Название_реферанса КАК Название_реферанса,
	|	TariffPR_Номенклатура_Temp.CB КАК CB,
	|	&Период,
	|	ВЫБОР
	|		КОГДА TariffPR_НоменклатураСрезПоследних.Реферанс ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		КОГДА TariffPR_НоменклатураСрезПоследних.PNC_склад_руб_без_НДС <> TariffPR_Номенклатура_Temp.PNC_склад_руб_без_НДС
	|			ТОГДА ИСТИНА
	|		КОГДА TariffPR_НоменклатураСрезПоследних.PNC_срочная_руб_без_НДС <> TariffPR_Номенклатура_Temp.PNC_срочная_руб_без_НДС
	|			ТОГДА ИСТИНА
	|		КОГДА TariffPR_НоменклатураСрезПоследних.PNC_агент_руб_без_НДС <> TariffPR_Номенклатура_Temp.PNC_агент_руб_без_НДС
	|			ТОГДА ИСТИНА
	|		КОГДА TariffPR_НоменклатураСрезПоследних.PCL_руб_без_НДС <> TariffPR_Номенклатура_Temp.PCL_руб_без_НДС
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ФлагВыборки
	|ИЗ
	|	РегистрСведений.Renault_TariffPR_Номенклатура_Temp КАК TariffPR_Номенклатура_Temp
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_TariffPR_Номенклатура.СрезПоследних(&Период, ) КАК TariffPR_НоменклатураСрезПоследних
	|		ПО TariffPR_Номенклатура_Temp.Реферанс = TariffPR_НоменклатураСрезПоследних.Реферанс
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
	|		ПО TariffPR_Номенклатура_Temp.Реферанс = спрНоменклатура.Артикул
	|ГДЕ
	|	ВЫБОР
	|			КОГДА TariffPR_НоменклатураСрезПоследних.Реферанс ЕСТЬ NULL 
	|				ТОГДА ИСТИНА
	|			КОГДА TariffPR_НоменклатураСрезПоследних.PNC_склад_руб_без_НДС <> TariffPR_Номенклатура_Temp.PNC_склад_руб_без_НДС
	|				ТОГДА ИСТИНА
	|			КОГДА TariffPR_НоменклатураСрезПоследних.PNC_срочная_руб_без_НДС <> TariffPR_Номенклатура_Temp.PNC_срочная_руб_без_НДС
	|				ТОГДА ИСТИНА
	|			КОГДА TariffPR_НоменклатураСрезПоследних.PNC_агент_руб_без_НДС <> TariffPR_Номенклатура_Temp.PNC_агент_руб_без_НДС
	|				ТОГДА ИСТИНА
	|			КОГДА TariffPR_НоменклатураСрезПоследних.PCL_руб_без_НДС <> TariffPR_Номенклатура_Temp.PCL_руб_без_НДС
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ = ИСТИНА"
	;

	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Период", Период);
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	// Комментарий 
	//Дата создания - 11.05.2012 9:54:03; Автор - Окипний Андрей Евгеньевич
	//Если в таблице ничего нет, продолжать смысла нет.
	//
	Если ТаблицаРезультата.Количество() = 0 тогда возврат Ложь КонецЕсли;
	
	
	// Комментарий 
	//Дата создания - 12.05.2012 9:14:37; Автор - Окипний Андрей Евгеньевич
	//При попытке записать большой объем данных система вылетает по ошибке переполнения памяти
	//поэтому проверяем количество строк перед записью. Если строк больше 100 000 (такое будет редко)
	//нужно произвести запись построчно.
	//
	КоличествоСтрок = ТаблицаРезультата.Количество();
	
	Если КоличествоСтрок < 99999 тогда
		Renault_Открытый.СостояниеДляПользователя("Перенос изменений в регистр тарифов - единым блоком");
	КонецЕсли;
	
	//Создадим набор записи
	Если КоличествоСтрок > 99999 тогда //Нужно писать построчно. иначе вываливаемся по переполнению памяти
		Для каждого строкаТЗ Из ТаблицаРезультата Цикл
			
			Renault_Открытый.СостояниеДляПользователя("Перенос изменений в регистр тарифов - построчно (" 
							+ ТаблицаРезультата.Индекс(строкаТЗ) + "/" + КоличествоСтрок + ")");
			
			МЗ = СоздатьМенеджерЗаписи();
			
			ЗаполнитьЗначенияСвойств(МЗ, СтрокаТЗ);
			МЗ.Прочитать();
			
			ЗаполнитьЗначенияСвойств(МЗ, СтрокаТЗ);
			МЗ.Записать();
		
		КонецЦикла;
	Иначе
		
		// Комментарий 
		//Дата создания - 11.05.2012 9:55:31; Автор - Окипний Андрей Евгеньевич
		//Загружаем таблицу с результатом в набор записей регистра с установленным отбором по периоду.
		//
		НЗ = СоздатьНаборЗаписей();
		НЗ.Отбор.Период.Установить(Период);
		НЗ.Прочитать();
		НЗ.Загрузить(ТаблицаРезультата);
		
		НЗ.Записать();
		
	КонецЕсли;
 	
	РезультатЗаписи = Истина;
	
	Возврат РезультатЗаписи;
	
КонецФункции
