////#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если Данные.Свойство("Ссылка") И ЗначениеЗаполнено(Данные.Ссылка) Тогда
		СтандартнаяОбработка = Ложь;
		Представление = Данные.Ссылка.Наименование;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	//Если ВидФормы = "ФормаОбъекта" 
	//	И ПараметрыСеанса.DMS_ВидОперацииРекламнойКампании = Перечисления.DMS_ВидыОперацийРекламнойКампании.РазмещениеКампании Тогда
	//
	//	СтандартнаяОбработка = Ложь;
	//	ВыбраннаяФорма = "ФормаПомощникСоздания";
	//
	//КонецЕсли; 
	
КонецПроцедуры

////#КонецОбласти

////#Область СлужебныеПроцедурыИФункции

////#Область Проведение   

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// 
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	                      
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса  ТекстЗапросаВтТаблицаРекламныеКампанииПредставителей
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстыЗапроса.Добавить(ТекстЗапросаВтТаблицаРекламныеКампании(), 			   "ТаблицаРекламныеКампании");
	ТекстыЗапроса.Добавить(ТекстЗапросаВтТаблицаРекламныеКампанииПредставителей(), "ТаблицаРекламныеКампанииПредставителей");
	
	DMS_РекламныеКампанииСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений);
	
КонецПроцедуры                                       

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РекламнаяКампания.ДатаНачала КАК Период,
		|	РекламнаяКампания.Ссылка КАК Ссылка,
		|	РекламнаяКампания.Представитель КАК Представитель,
		|	РекламнаяКампания.ДилерскийЦентр КАК ДилерскийЦентр,
		|	РекламнаяКампания.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	РекламнаяКампания.Валюта КАК Валюта,
		|	РекламнаяКампания.СуммаДокумента КАК СуммаДокумента,
		|	РекламнаяКампания.ТипКампании КАК ТипКампании,
		|	РекламнаяКампания.Ссылка КАК РекламнаяКампания,
		|	РекламнаяКампания.ДатаОкончания КАК ПериодЗавершения,
		|	РекламнаяКампания.ВидОперации КАК ВидОперации,
		|	РекламнаяКампания.Статус КАК Статус
		|ИЗ
		|	Документ.DMS_РекламнаяКампания КАК РекламнаяКампания
		|ГДЕ
		|	РекламнаяКампания.Ссылка = &Ссылка";
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Коэффициенты = DMS_РаботаСКурсамиВалют.ПолучитьКоэффициентыПересчетаВалюты(Реквизиты.Валюта, Реквизиты.ВалютаВзаиморасчетов, Реквизиты.Период);
	
	СтруктураПараметров = Новый Структура;
	
	Для А = 0 По Запрос.Выполнить().Колонки.Количество()-1 Цикл
		СтруктураПараметров.Вставить(Запрос.Выполнить().Колонки[А].Имя);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(СтруктураПараметров,Реквизиты);
	
	Для каждого Параметр Из СтруктураПараметров Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ,Параметр.Значение);	
	КонецЦикла; 
	
	Запрос.УстановитьПараметр("КоэффициентПересчетаВВалютуУПР",           Коэффициенты.КоэффициентПересчетаВВалютуУПР);
	Запрос.УстановитьПараметр("КоэффициентПересчетаВВалютуРегл",          Коэффициенты.КоэффициентПересчетаВВалютуРегл);
	Запрос.УстановитьПараметр("КоэффициентПересчетаВВалютуВзаиморасчетов",Коэффициенты.КоэффициентПересчетаВВалютуВзаиморасчетов);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", 		  Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить());
	Запрос.УстановитьПараметр("ВалютаУправленческогоУчета",               Константы.ВалютаУправленческогоУчетаКомпании.Получить());
	
КонецПроцедуры

Функция ТекстЗапросаВтТаблицаРекламныеКампании()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период КАК Период,
		|	&Ссылка КАК Регистратор,
		|	&Представитель КАК Представитель,
		|	&ВалютаВзаиморасчетов КАК Валюта,
		|	&ДилерскийЦентр КАК ДилерскийЦентр,
		|	&ТипКампании КАК ТипКампании,
		|	&РекламнаяКампания КАК РекламнаяКампания, 
		|	Модели.Модель КАК Модель,
		|	Модели.ПлановаяСтоимостьВзаиморасчеты КАК СуммаПлан,
		|	ВЫБОР КОГДА &ВалютаВзаиморасчетов = &ВалютаРегламентированногоУчета И &Валюта <> &ВалютаРегламентированногоУчета
		|			ТОГДА Модели.ПлановаяСтоимостьВзаиморасчеты
		|			ИНАЧЕ ВЫРАЗИТЬ(Модели.ПлановаяСтоимость * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))
		|	КОНЕЦ КАК СуммаПланРегл,
		|	ВЫБОР КОГДА &ВалютаВзаиморасчетов = &ВалютаУправленческогоУчета
		|			ТОГДА Модели.ПлановаяСтоимостьВзаиморасчеты
		|			ИНАЧЕ ВЫРАЗИТЬ(Модели.ПлановаяСтоимость * &КоэффициентПересчетаВВалютуУпр КАК ЧИСЛО(15, 2))
		|	КОНЕЦ КАК СуммаПланУпр
		|ИЗ
		|	Документ.DMS_РекламнаяКампания.Модели КАК Модели
		|ГДЕ
		|	Модели.Ссылка = &Ссылка
		|	И &ВидОперации = ЗНАЧЕНИЕ(Перечисление.DMS_ВидыОперацийРекламнойКампании.РазмещениеКампании)
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
		Возврат ТекстЗапроса;
	
КонецФункции // ТекстЗапросаВтТаблицаБрониНомерногоФонда()

Функция ТекстЗапросаВтТаблицаРекламныеКампанииПредставителей()     
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период КАК Период,
		|	&ПериодЗавершения КАК ПериодЗавершения,
		|	&Ссылка КАК Регистратор,
		|	&Представитель КАК Представитель,
		|	&РекламнаяКампания КАК РекламнаяКампания,
		|	&Статус КАК Статус
		|ГДЕ
		|	&ВидОперации = ЗНАЧЕНИЕ(Перечисление.DMS_ВидыОперацийРекламнойКампании.СозданиеШаблона)
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
		Возврат ТекстЗапроса;
	
КонецФункции // ТекстЗапросаВтТаблицаБрониНомерногоФонда()

////#КонецОбласти

////#КонецОбласти

#КонецЕсли
