// Модуль документа СписаниеТоваров

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем тКэшСуммСписания Экспорт;		// Переменная для кэширования результатов вычисления суммы списания
Перем ФлагПерерасчет;               // Переменная для обозначения того, что ведется перерасчет суммы документа
Перем ИмяРеквизитаКода Экспорт;     // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/артикула в ТЧ
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования
Перем ВедетсяБалансПоПодразделению Экспорт;		//Признак ведения баланса по подразделениям

//Бондаренко++ 20260401
Перем ДеньЭрЭл Экспорт; 
//Бондаренко-- 20260401

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА
//Бондаренко++ 20260331
Процедура СМГ_ПровестиБонусныеБаллыДилера(ДокРЛ)
	
	 	Если Не обЗначениеНеЗаполнено(ДокРЛ) Тогда
			Для Сч = 1 По 5 Цикл
				
				МаркПрограмма_ = Справочники.МаркетинговыеПрограммы.ПустаяСсылка();
				ВариантКомпенсации_ = Перечисления.ВариантКомпенсации.ПустаяСсылка(); 	
				Компенсация_ = 0;
				
				Если Сч = 1 Тогда
					МаркПрограмма_ = ДокРЛ.МаркетинговаяПрограммаСкидкаТрейдИн;
 					Если НЕ обЗначениеНеЗаполнено(МаркПрограмма_) Тогда
						Если ДокРЛ.КомпенсацияТрейдИНРетроспективная > 0 Тогда     
							Компенсация_ = ДокРЛ.КомпенсацияТрейдИНРетроспективная;
							ВариантКомпенсации_ = Перечисления.ВариантКомпенсации.Ретроспективная; 	
						Иначе 
							Компенсация_ = ДокРЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля;
							ВариантКомпенсации_ = Перечисления.ВариантКомпенсации.ВИнвойсеСледующего; 	
  					    КонецЕсли;
					КонецЕсли;
 				ИначеЕсли Сч = 2 Тогда	
					МаркПрограмма_ = ДокРЛ.МаркетинговаяПрограммаСкидкаТрейдИн2;
					Если ДокРЛ.КомпенсацияТрейдИН2Ретроспективная > 0 Тогда     
						Компенсация_ = ДокРЛ.КомпенсацияТрейдИН2Ретроспективная;
						ВариантКомпенсации_ = Перечисления.ВариантКомпенсации.Ретроспективная; 	
					Иначе 
						Компенсация_ = ДокРЛ.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля;
						ВариантКомпенсации_ = Перечисления.ВариантКомпенсации.ВИнвойсеСледующего; 	
 				    КонецЕсли;
				ИначеЕсли Сч = 3 Тогда
					МаркПрограмма_ = ДокРЛ.МаркетинговаяПрограммаСкидкаСубсидияКредит;
					Если ДокРЛ.КомпенсацияСубсидияКредитРетроспективная > 0 Тогда     
						Компенсация_ = ДокРЛ.КомпенсацияСубсидияКредитРетроспективная;
						ВариантКомпенсации_ = Перечисления.ВариантКомпенсации.Ретроспективная; 	
					Иначе 
						Компенсация_ = ДокРЛ.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля;
						ВариантКомпенсации_ = Перечисления.ВариантКомпенсации.ВИнвойсеСледующего; 	
 				    КонецЕсли;
				ИначеЕсли Сч = 4 Тогда	
                    МаркПрограмма_ = ДокРЛ.МаркетинговаяПрограммаСкидкаПоПрограммамЛояльности;
					Если ДокРЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная > 0 Тогда     
						Компенсация_ = ДокРЛ.КомпенсацияПоПрограммамЛояльностиРетроспективная;
						ВариантКомпенсации_ = Перечисления.ВариантКомпенсации.Ретроспективная; 	
					Иначе 
						Компенсация_ = ДокРЛ.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля;
						ВариантКомпенсации_ = Перечисления.ВариантКомпенсации.ВИнвойсеСледующего; 	
 				    КонецЕсли;
				ИначеЕсли Сч = 5 Тогда	
					МаркПрограмма_ = ДокРЛ.МаркетинговаяПрограммаСкидкаПоПрограммамЛояльностиДополнительно;
					Если ДокРЛ.КомпенсацияРозничнаяРетроспективная > 0 Тогда     
						Компенсация_ = ДокРЛ.КомпенсацияРозничнаяРетроспективная;
						ВариантКомпенсации_ = Перечисления.ВариантКомпенсации.Ретроспективная; 	
					Иначе 
						Компенсация_ = ДокРЛ.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля;
						ВариантКомпенсации_ = Перечисления.ВариантКомпенсации.ВИнвойсеСледующего; 	
 				    КонецЕсли;
				КонецЕсли;
				
				Если Не обЗначениеНеЗаполнено(МаркПрограмма_) Тогда
					Если Не обЗначениеНеЗаполнено(ВариантКомпенсации_) Тогда
						Если Компенсация_ > 0 Тогда
  							
	 	 		  			Движение = Движения.БонусныеБаллыДилера.Добавить();
							Движение.ВидДвижения = ВидДвиженияНакопления.Приход; 
							Движение.Период = Дата; 
							Движение.Автомобиль = ДокРЛ.Автомобиль;
							Движение.ПодразделениеКомпании = ДокРЛ.ПодразделениеКомпании;
							Движение.Организация = ДокРЛ.Организация;
							Движение.Марка = ДокРЛ.Автомобиль.Модель.Марка;
							Движение.Модель = ДокРЛ.Автомобиль.Модель;
							Движение.ХозОперация = Справочники.ХозОперации.БонусныеБаллыДилераПриход;
							Движение.МаркетинговаяПрограмма = МаркПрограмма_;
							Движение.ВариантКомпенсации = ВариантКомпенсации_; 
							
							//Бондаренко++ 20260418
							Движение.ВариантОстатков = Перечисления.НачисленоПодтверждено.Начислено;
							//Бондаренко-- 20260418
							
							Движение.Компенсация = Компенсация_;
							Движение.Регистратор = Ссылка;
							Движение.ФактическаяЦенаПродажиАвто = Сумма;
							
							Движение.КонтрагентПокупатель = ДокРЛ.Контрагент;
							Движение.ДатаПродажи = Дата;
							Движение.ДокументРеализации = Ссылка;
							Движение.ДатаРитейла = "";
							Движение.ДатаПодтверждения = "";
							Движение.ДатаПолучения = "";
							
							//Бондаренко++ 20260401
							Движение.РабочийЛист = ДокРЛ.Ссылка;
							//Бондаренко-- 20260401
							
 							
						КонецЕсли;
 					КонецЕсли;
				КонецЕсли;
   			КонецЦикла;
  		КонецЕсли;
 

КонецПроцедуры //СМГ_ПровестиБонусныеБаллыДилера(РабЛист_)



Процедура ОбработкаПроведения(Отказ, Режим)

	//Бондаренко++ 20260401
 	РабЛист_ = "";
	Проведение_ = Истина;                    
	Движения.БонусныеБаллыДилера.Очистить();
	Если ХозОперация = Справочники.ХозОперации.ОтгрузкаАвтомобиляБезРеализации Тогда
		РабЛист_ = СМГ_ОткорректироватьРЛ(Проведение_,Ссылка); 
 		Если Дата >= ДеньЭрЭл Тогда
 			СМГ_ПровестиБонусныеБаллыДилера(РабЛист_); 	
		КонецЕсли;
		
		// Семенихин 24.05.2026 +++++
		мМарки = Новый Массив();
		мМарки.Добавить(Справочники.Марка.TENET);
		мМарки.Добавить(Справочники.Марка.CHERY);
		Если мМарки.Найти(Автомобиль.Модель.Марка) <> Неопределено Тогда
			СМ_ФормированиеНовыхОбъектов.СоздатьЗавершитьВыдачуАвтомобиля(Дата, Автомобиль, РабЛист_);
		КонецЕсли;
		// Семенихин 24.05.2026 -----
		
	Иначе	
		РабЛист_ = СМГ_ОткорректироватьРЛ(Проведение_,Ссылка.ДокументОснование);
 	КонецЕсли;
	//Бондаренко-- 20260401
    
 	Если ХозОперация = Справочники.ХозОперации.ОтгрузкаАвтомобиляБезРеализации Тогда
		
		Движения.ОстаткиАвтомобилей.Очистить();
		
		//Бондаренко++ 20251224
		Если БезСписанияОстаткаАвто Тогда
		    Возврат;
		КонецЕсли;
		//Бондаренко-- 20251224
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль,
		|	ОстаткиАвтомобилейОстатки.СкладКомпании КАК СкладКомпании,
		|	ОстаткиАвтомобилейОстатки.СтатусПартии КАК СтатусПартии,
		|	ОстаткиАвтомобилейОстатки.Партия КАК Партия,
		|	ОстаткиАвтомобилейОстатки.ГТД КАК ГТД,
		|	ОстаткиАвтомобилейОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ОстаткиАвтомобилейОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ОстаткиАвтомобилейОстатки.СуммаУпрОстаток КАК СуммаУпрОстаток,
		|	ОстаткиАвтомобилейОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(&Дата, ) КАК ОстаткиАвтомобилейОстатки
		|ГДЕ
		|	ОстаткиАвтомобилейОстатки.Автомобиль = &Автомобиль
		|	И ОстаткиАвтомобилейОстатки.СкладКомпании = &СкладКомпании
		|	И ОстаткиАвтомобилейОстатки.КоличествоОстаток = 1";
		
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("Автомобиль",Автомобиль);
		Запрос.УстановитьПараметр("СкладКомпании",СкладКомпании);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Движение = Движения.ОстаткиАвтомобилей.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Автомобиль = ВыборкаДетальныеЗаписи.Автомобиль;
			Движение.СкладКомпании = ВыборкаДетальныеЗаписи.СкладКомпании;
			Движение.СтатусПартии = ВыборкаДетальныеЗаписи.СтатусПартии;
			Движение.Партия = ВыборкаДетальныеЗаписи.Партия;
			Движение.ГТД = ВыборкаДетальныеЗаписи.ГТД;
			Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток;
			Движение.Сумма = ВыборкаДетальныеЗаписи.СуммаОстаток;
			Движение.СуммаУпр = ВыборкаДетальныеЗаписи.СуммаУпрОстаток;
			Движение.СуммаНДС = ВыборкаДетальныеЗаписи.СуммаНДСОстаток;
			
			Движение.ХозОперация = ХозОперация;
			
			//Бондаренко++ 20251223
			//Движение = Движения.ПродажиАвтомобилей.Добавить();
			//Движение.Период = Дата;
			//Движение.Автомобиль = ВыборкаДетальныеЗаписи.Автомобиль;
			//Движение.ДоговорВзаиморасчетов = ДоговорВзаиморасчетов;
			//Движение.ДокументПродажи = Ссылка;
			//Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток;
			//Движение.Партия = ВыборкаДетальныеЗаписи.Партия;
			//Движение.ПодразделениеКомпании = ПодразделениеКомпании;
			//Движение.Покупатель = Контрагент;
			//Движение.Поставщик = ВыборкаДетальныеЗаписи.Партия.Контрагент;
			//Движение.Себестоимость = ВыборкаДетальныеЗаписи.СуммаОстаток;
			//Движение.СебестоимостьУпр = ВыборкаДетальныеЗаписи.СуммаУпрОстаток;
			//Движение.СкладКомпании = СкладКомпании;
			//Движение.Сумма = Сумма;
			//Движение.СуммаУпр = Сумма;
			//Движение.СтатусПартии = ВыборкаДетальныеЗаписи.СтатусПартии;
			//Движение.ГТД = ВыборкаДетальныеЗаписи.ГТД;
			//Движение.ХозОперация = ХозОперация;
			//Если Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
			//	Движение.КолФизЛица = 1;
			//Иначе
			//	Движение.КолФизЛица = 0;
			//КонецЕсли;
			//Если ДокументОснование.ВКредит Тогда
			//	Движение.КолКредит = 1;
			//Иначе
			//	Движение.КолКредит = 0;
			//КонецЕсли;		                                   
			//Если Не обЗначениеНеЗаполнено(ДокументОснование.ПоступлениеАвтоТрэйдИн) Тогда
			//	Движение.КолТрейдИн = 1;		
			//Иначе
			//	Движение.КолТрейдИн = 0;
			//КонецЕсли;		
			//
			//Движение.СтавкаНДС = СтавкаНДС;
			//Движение.СуммаНДС =  СуммаНДС;
			//Бондаренко-- 20251223
			
		КонецЦикла;
		//Бондаренко++ 20251114	
	Иначе
		Если Не ДокументОснование.Проведен Тогда
			СМГ_Сообщить("ОШИБКА! Документ-основание <<"+ДокументОснование+">> не проведен.",СтатусСообщения.ОченьВажное);
			Отказ = Истина;
			Возврат;	
		КонецЕсли;
		Если НЕ ТипЗНЧ(ДокументОснование) = Тип("ДокументСсылка.ОтгрузкаАвтомобиляБезРеализации") Тогда
			СМГ_Сообщить("ОШИБКА! Тип значения документа-основания <<"+ДокументОснование+">> должен быть ОАБР.",СтатусСообщения.ОченьВажное);
			Отказ = Истина;
			Возврат;	
		КонецЕсли;
		ТЗ_остатки = Новый ТаблицаЗначений;
		ТЗ_остатки = ПолучитьДвиженияОстаткиДокОсн(ДокументОснование);
		Если ТЗ_остатки.Количество() > 0 Тогда
			Для каждого Стр Из ТЗ_остатки Цикл
				Движение = Движения.ОстаткиАвтомобилей.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Автомобиль = Стр.Автомобиль;
				Движение.СкладКомпании = Стр.СкладКомпании;
				Движение.СтатусПартии = Стр.СтатусПартии;
				Движение.Партия = Стр.Партия;
				Движение.ГТД = Стр.ГТД;
				Движение.Количество = Стр.Количество;
				Движение.Сумма = Стр.Сумма;
				Движение.СуммаУпр = Стр.СуммаУпр;
				Движение.СуммаНДС = Стр.СуммаНДС;
				Движение.ХозОперация = ХозОперация;
			КонецЦикла;
		КонецЕсли;
		ТЗ_продажи = Новый ТаблицаЗначений;
		ТЗ_продажи = ПолучитьДвиженияПродажиДокОсн(ДокументОснование);
		Если ТЗ_продажи.Количество() > 0 Тогда
			Для каждого Стр Из ТЗ_продажи Цикл
				Движение = Движения.ПродажиАвтомобилей.Добавить();
				Движение.Период = Дата;
				Движение.Автомобиль = Стр.Автомобиль;
				Движение.ДоговорВзаиморасчетов = Стр.ДоговорВзаиморасчетов;
				Движение.ДокументПродажи = ДокументОснование;
				Движение.Количество = - Стр.Количество;
				Движение.Партия = Стр.Партия;
				Движение.ПодразделениеКомпании = Стр.ПодразделениеКомпании;
				Движение.Покупатель = Стр.Покупатель;
				Движение.Поставщик = Стр.Поставщик;
				Движение.Себестоимость = - Стр.Себестоимость;
				Движение.СебестоимостьУпр = - Стр.СебестоимостьУпр;
				Движение.СкладКомпании = Стр.СкладКомпании;
				Движение.Сумма = - Стр.Сумма;
				Движение.СуммаУпр = - Стр.Сумма;
				Движение.СтатусПартии = Стр.СтатусПартии;
				Движение.ГТД = Стр.ГТД;
				Движение.СтавкаНДС = Стр.СтавкаНДС;
				Движение.СуммаНДС = - Стр.СуммаНДС;
				Движение.СуммаНДСВходящий = - Стр.СуммаНДСВходящий;
				Движение.КолКредит = - Стр.КолКредит;
				Движение.КолТрейдИн = - Стр.КолТрейдИн;
				Движение.КолФизЛица = - Стр.КолФизЛица;
				Движение.ХозОперация = ХозОперация;
			КонецЦикла;
		КонецЕсли; 
		
		//Иванченко 20260126 ++
		БезСписанияОстаткаАвто = Ложь;
		//Иванченко 20260126 --					
	КонецЕсли;
	//Бондаренко-- 20251114 
	  	
КонецПроцедуры // ОбработкаПроведения(Флаг)

//Бондаренко++ 20260331
Функция СМГ_ОткорректироватьРЛ(Фл,Док)
	
	РЛ_ = "";
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОтгрузкаАвтомобиляБезРеализации.Ссылка КАК Ссылка,
	               |	ОтгрузкаАвтомобиляБезРеализации.ДокументОснование КАК Заказ,
	               |	ОтгрузкаАвтомобиляБезРеализации.ДокументОснование.ДокументОснование КАК РЛ,
	               |	ОтгрузкаАвтомобиляБезРеализации.ХозОперация КАК ХозОперация,
	               |	ОтгрузкаАвтомобиляБезРеализации.Дата КАК Дата,
	               |	ОтгрузкаАвтомобиляБезРеализации.Проведен КАК Проведен
	               |ИЗ
	               |	Документ.ОтгрузкаАвтомобиляБезРеализации КАК ОтгрузкаАвтомобиляБезРеализации
	               |ГДЕ
	               |	ОтгрузкаАвтомобиляБезРеализации.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтгрузкаАвтомобиляБезРеализации)
	               |	И ОтгрузкаАвтомобиляБезРеализации.Ссылка = &Ссылка
	               |	И ТИПЗНАЧЕНИЯ(ОтгрузкаАвтомобиляБезРеализации.ДокументОснование.ДокументОснование) = ТИП(Документ.РабочийЛист)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Ссылка",Док);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РЛ_ = ВыборкаДетальныеЗаписи.РЛ;
		Прервать;
	КонецЦикла;
	
	Если Не обЗначениеНеЗаполнено(РЛ_) Тогда
		
		КорректироватьРЛ = Ложь;
		
		РЛ_Объект = РЛ_.ПолучитьОбъект();    
 		
		Если ХозОперация = Справочники.ХозОперации.ОтгрузкаАвтомобиляБезРеализации Тогда
 			Если РЛ_Объект.ОтгрузкаАвтомобиля <> Ссылка Тогда
				РЛ_Объект.ОтгрузкаАвтомобиля = Ссылка;
				КорректироватьРЛ = Истина;
			КонецЕсли;
 			Если Фл Тогда
				Если РЛ_Объект.ДатаОтгрузкиАвтомобиля <> Ссылка.Дата Тогда
					РЛ_Объект.ДатаОтгрузкиАвтомобиля = Ссылка.Дата;
					КорректироватьРЛ = Истина;
				КонецЕсли;
			Иначе	
				Если РЛ_Объект.ДатаОтгрузкиАвтомобиля <> Дата(1,1,1) Тогда
					РЛ_Объект.ДатаОтгрузкиАвтомобиля = Дата(1,1,1);
					КорректироватьРЛ = Истина;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если Не обЗначениеНеЗаполнено(РЛ_Объект.ОтгрузкаАвтомобиля) Тогда
				РЛ_Объект.ОтгрузкаАвтомобиля = "";
				КорректироватьРЛ = Истина;
			КонецЕсли;
 			Если Фл Тогда
				Если РЛ_Объект.ДатаОтгрузкиАвтомобиля <> Дата(1,1,1) Тогда
					РЛ_Объект.ДатаОтгрузкиАвтомобиля = Дата(1,1,1);
					КорректироватьРЛ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если КорректироватьРЛ Тогда
			Попытка
	 			РЛ_Объект.Записать();
	 			СМГ_Сообщить("Успешно откорректирован "+РЛ_Объект);
			Исключение
				СМГ_Сообщить("ОШИБКА! Не удалось откорректировать "+РЛ_Объект,СтатусСообщения.ОченьВажное);
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РЛ_;
	
КонецФункции
//Бондаренко-- 20260331
  
//Бондаренко++ 20251114                
Функция ПолучитьДвиженияПродажиДокОсн(ДокументОснование)
	
	ТЗ = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПродажиАвтомобилей.Регистратор КАК Регистратор,
	|	ПродажиАвтомобилей.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ПродажиАвтомобилей.Автомобиль КАК Автомобиль,
	|	ПродажиАвтомобилей.Поставщик КАК Поставщик,
	|	ПродажиАвтомобилей.Покупатель КАК Покупатель,
	|	ПродажиАвтомобилей.СтатусПартии КАК СтатусПартии,
	|	ПродажиАвтомобилей.ХозОперация КАК ХозОперация,
	|	ПродажиАвтомобилей.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	ПродажиАвтомобилей.СкладКомпании КАК СкладКомпании,
	|	ПродажиАвтомобилей.Партия КАК Партия,
	|	ПродажиАвтомобилей.ГТД КАК ГТД,
	|	ПродажиАвтомобилей.Количество КАК Количество,
	|	ПродажиАвтомобилей.Сумма КАК Сумма,
	|	ПродажиАвтомобилей.СуммаНДС КАК СуммаНДС,
	|	ПродажиАвтомобилей.СуммаУпр КАК СуммаУпр,
	|	ПродажиАвтомобилей.СебестоимостьУпр КАК СебестоимостьУпр,
	|	ПродажиАвтомобилей.Себестоимость КАК Себестоимость,
	|	ПродажиАвтомобилей.СуммаНДСВходящий КАК СуммаНДСВходящий,
	|	ПродажиАвтомобилей.СтавкаНДС КАК СтавкаНДС,
	|	ПродажиАвтомобилей.КолКредит КАК КолКредит,
	|	ПродажиАвтомобилей.КолТрейдИн КАК КолТрейдИн,
	|	ПродажиАвтомобилей.КолФизЛица КАК КолФизЛица
	|ИЗ
	|	РегистрНакопления.ПродажиАвтомобилей КАК ПродажиАвтомобилей
	|ГДЕ
	|	ПродажиАвтомобилей.Регистратор = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции // ПолучитьДвиженияПродажиДокОсн(ДокументОснование)

Функция ПолучитьДвиженияОстаткиДокОсн(ДокументОснование)
	
	ТЗ = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиАвтомобилей.Регистратор КАК Регистратор,
	|	ОстаткиАвтомобилей.Автомобиль КАК Автомобиль,
	|	ОстаткиАвтомобилей.СкладКомпании КАК СкладКомпании,
	|	ОстаткиАвтомобилей.СтатусПартии КАК СтатусПартии,
	|	ОстаткиАвтомобилей.Партия КАК Партия,
	|	ОстаткиАвтомобилей.ГТД КАК ГТД,
	|	ОстаткиАвтомобилей.Количество КАК Количество,
	|	ОстаткиАвтомобилей.Сумма КАК Сумма,
	|	ОстаткиАвтомобилей.СуммаУпр КАК СуммаУпр,
	|	ОстаткиАвтомобилей.СуммаНДС КАК СуммаНДС,
	|	ОстаткиАвтомобилей.ВидДвижения КАК ВидДвижения
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
	|ГДЕ
	|	ОстаткиАвтомобилей.Регистратор = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции // ПолучитьДвиженияОстаткиДокОсн()
//Бондаренко-- 20251114

// Возвращает соответствие в котором перечислены виды номенклатуры, которые нельзя вводить
// в таблицу товаров. Если таких нет, то возвращает неопределено
//
// Возвращаемое значение:
//  Результат - соответствие.
//
Функция ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры() Экспорт
	Результат=Новый Соответствие();
	Результат.Вставить(Перечисления.ВидыНоменклатуры.Услуга,0);
	Возврат Результат;
КонецФункции // ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры()

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	ОбязательныеРеквизиты.Вставить("Автор",1);
	ОбязательныеРеквизиты.Вставить("ВалютаДокумента",1);
	ОбязательныеРеквизиты.Вставить("КурсДокумента",1);
	ОбязательныеРеквизиты.Вставить("ХозОперация",1);
	//Бондаренко++ 20251224
	ОбязательныеРеквизиты.Вставить("ДокументОснование",1);
	//Бондаренко-- 20251224
	//Бондаренко++ 20251224
	ОбязательныеРеквизиты.Вставить("СкладКомпании",1);
	//Бондаренко-- 20251224
	Возврат ОбязательныеРеквизиты;
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Проверяет корректность заполнения объекта.
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры:
//  Ошибки       - строка, в случае некорректного заполнения содержит описанием возникших ошибок, 
//  ДопРеквизиты - структура, на вход может быть передана структура с дополнительными реквизитами для проверки,
//  Заполнение   - булево, флаг проверки, 
//  Уникальность - булево, флаг проверки.
//
// Возвращаемое значение:
//  Булево - Возвращает Истина если все заполнено корректно и Ложь иначе.
// 
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	// Здесь могут быть определены дополнительные к стандартным обязательным реквизитам условия проверки
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	
	// Проведем проверку соответствия организации документа организациям некоторых реквизитов документа.
	// Такую проверку необходимо осуществлять, если баланс в системе ведется по организации,
	// или если установлен способ контроля корректности
	// договора и склада документа. Причем, если способ контроля выбран "Контроль по организации и подразделению", то
	// дополнительно осуществляется проверка соответствия подразделений.
	Если Результат Тогда
		СпособКонтроляКорректности = обПраво("КонтрольКорректностиДоговораИСкладаДокумента", Права,,ЭтотОбъект);	
		КонтрольОтсутствует        = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольОтсутствует);
		БалансВедетсяПоОрганизации = (Константы.СпособВеденияБаланса.Получить()=Перечисления.СпособВеденияБаланса.ПоОрганизации);
		
		Если БалансВедетсяПоОрганизации ИЛИ НЕ КонтрольОтсутствует Тогда
			КонтрольПоПодразделению = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольПоОрганизацииИПодразделению);
			
			КонтролируемыеРеквизиты = Новый Структура();			
			КонтролируемыеРеквизитыШапки = Новый Структура();			
			//Если ХозОперация=Справочники.ХозОперации.СписаниеТоваровОтданныхНаКомиссию Тогда
			//	КонтролируемыеРеквизитыШапки.Вставить("ДоговорВзаиморасчетов", КонтрольПоПодразделению);
			//Иначе
			//	КонтролируемыеРеквизитыШапки.Вставить("СкладКомпании", КонтрольПоПодразделению);
			//КонецЕсли;      			
			//КонтролируемыеРеквизиты.Вставить("КонтролируемыеРеквизитыШапки",КонтролируемыеРеквизитыШапки);
			
			
			Результат = дкПроверитьКорректностьПоОрганизации(ЭтотОбъект,КонтролируемыеРеквизиты,Ошибки) И Результат;
		КонецЕсли;  		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции // ПроверитьКорректность()
                                    
// Функция проверяет, допустимо ли изменение объекта
//
// Параметры:
//  БлокироватьРеквизиты - структура, структура блокируемых на изменение реквизитов.
//
// Возвращаемое значение:
// Булево - Возвращает Истина, если изменения возможны, ложь иначе
//          Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
//
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
	// Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции // ДоступностьИзменения()

// Возвращает список возможных хозяйственных операций документа
// Возвращаемое значение: 
//  СписокЗначений. 
//  Строка списка: Значение - имя предопределенного элемента; 
//				   Представление - красивое его представление
// 				   "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("ОтгрузкаАвтомобиляБезРеализации","ОтгрузкаАвтомобиляБезРеализации",Истина);
	СписокХозОпераций.Добавить("ОтменаОтгрузкиАвтомобиляБезРеализации","ОтменаОтгрузкиАвтомобиляБезРеализации",Истина);
	Возврат СписокХозОпераций;
КонецФункции // ПолучитьСписокХозОпераций()

// у нас не стандартная таблица, поэтому сформирует свой результат запроса по товарам
//
// Параметры:
//  ШапкаДокумента - выборка.
//
Функция ПолучитьРезультатЗапросаПоТоварам(ШапкаДокумента)
	ТекстЗапроса="ВЫБРАТЬ
	|	СписаниеТоваровТовары.Номенклатура КАК Номенклатура,
	|	СписаниеТоваровТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СписаниеТоваровТовары.Партия КАК Партия,
	|	СписаниеТоваровТовары.Количество * СписаниеТоваровТовары.Коэффициент КАК Количество
	|ИЗ
	|	Документ.СписаниеТМЦ.Товары КАК СписаниеТоваровТовары
	|ГДЕ
	|	СписаниеТоваровТовары.Ссылка = &Ссылка";
	
	Запрос=Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка",ШапкаДокумента.Ссылка);
	Запрос.Текст=ТекстЗапроса;
	
	Возврат Запрос.Выполнить();
КонецФункции // ПолучитьРезультатЗапросаПоТоварам()

// возвращает выборку по шапке
//
// Параметры:
//  ДокументСсылка - Ссылка на документ для которого получаем шапку.
//
// Возвращаемое значение:
//  Выборка - выборка по шапке
//
Функция ПолучитьШапкуДокумента(ДокументСсылка)
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	Док.Ссылка                КАК Ссылка,
	|	Док.Дата                  КАК Дата,
	|	Док.ВалютаДокумента       КАК ВалютаДокумента,
	|	Док.КурсДокумента         КАК КурсДокумента,
	|	Док.ТипЦен                КАК ТипЦен,
	|	Док.ХозОперация           КАК ХозОперация,
	|	Док.МоментВремени         КАК МоментВремени,
	|	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	Док.ДилерскийЦентр        КАК ДилерскийЦентр,
	|	Док.ДокументОснование     КАК ДокументОснование
	|
	|ИЗ
	|	Документ."+Метаданные().Имя+" КАК Док
	|
	|ГДЕ
	|	Док.Ссылка=&Ссылка
	|");
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	Выборка=Запрос.Выполнить().Выбрать(); Выборка.Следующий();
	
	Возврат Выборка;
КонецФункции // ПолучитьШапкуДокумента()

// формирует движения документа по партионным регистрам
//
// Параметры:
//  Режим           - режим проведения (оперативный/неоперативный)
//  ДокументСсылка  - ссылка на документ который надо допровести по партиям
//
// Возвращаемое значение:
//  Возвращает Истина - все ОК, ложь - чего-то не так
//
Функция ПровестиПоПартиям(Режим,ДокументСсылка) Экспорт
	//Отказ=Ложь;
	//
	// // получим шапку документа
	//ШапкаДокумента=ПолучитьШапкуДокумента(ДокументСсылка);
	//
	//// у нас нестандартная таблица, поэтому сформирует свой результат запроса по товарам
	//
	//РезультатЗапросаПоТоварам=ПолучитьРезультатЗапросаПоТоварам(ШапкаДокумента);
	//// определим вид проводки
	//Если ШапкаДокумента.ХозОперация=Справочники.ХозОперации.СписаниеТоваров Тогда
	//	// списываем
	// 	НаборЗаписейПартии.ДокументОбъект = ЭтотОбъект;
	//  	НаборЗаписейПартии.РезультатЗапросаПоТоварам = РезультатЗапросаПоТоварам;
	//	НаборЗаписейПартии.ШапкаДокумента            = ШапкаДокумента;
	//	Отказ=НЕ НаборЗаписейПартии.Расход() ИЛИ Отказ;
	//	Если НЕ Отказ Тогда 
	//		НаборЗаписейПартии.Записать(); 
	//	КонецЕсли; 
	//  	
	//КонецЕсли;
	//
	// Возврат НЕ Отказ;
КонецФункции // ПровестиПоПартиям()

// Расчет суммы документа
Функция РассчитатьСуммуВсего()Экспорт
	//СуммаВсего = дкПолучитьСуммуСписания(ЭтотОбъект, ?(ХозОперация = Справочники.ХозОперации.СписаниеТоваровОтданныхНаКомиссию, "ПартииТоваровОтданные" , "ПартииТоваровКомпании"),тКэшСуммСписания);
	//Возврат СуммаВсего;
КонецФункции // РассчитатьСуммуВсего()

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка – Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	– Форма	 – Ссылка на форму документа. Если значение неопределено,
//                         производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	// ОБРАБОТКА РЕКВИЗИТОВ ДОКУМЕНТА
	Если Имя="Товары.Номенклатура" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		ТекСтрока.Коэффициент = ТекСтрока.ЕдиницаИзмерения.Коэффициент;
	ИначеЕсли Имя="Товары.ЕдиницаИзмерения" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		ТекСтрока.Коэффициент = ТекСтрока.ЕдиницаИзмерения.Коэффициент;
	Иначе Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()

// заполнение свойств из документа основания
Процедура ЗаполнитьСвойстваНаОсновании(Основание) Экспорт
	//зарезервировано для описания заполнения свойств из свойств основания
КонецПроцедуры

// Заполняет на основании заказа
//
// Параметры:
//  ЗаказПокупателя - ДокументСсылка.
//
Процедура ЗаполнитьТоварыОстатками(Основание) Экспорт
КонецПроцедуры // ЗаполнитьОстаткамиПоПартии()

//Иванченко 20260507 ++
//Процедура ОтгрузкаАвтомобиля(РежимПроведения) 
//	
//	Если Дата < '20260527' Тогда
//		Возврат;
//	КонецЕсли;	
//		
//	Если обЗначениеНеЗаполнено(ДокументОснование) Тогда
//		Возврат; 
//	Иначе 
//		
//	КонецЕсли;		
//		
//		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
//			Параметр_РЛ = ДокументОснование.ДокументОснование;	
//		Иначе	
//			
//	КонецЕсли;
//			
//	АктивныеСостояния = Новый Массив();
//	АктивныеСостояния.Добавить(Перечисления.СостоянияСобытий.Запланировано);
//	АктивныеСостояния.Добавить(Перечисления.СостоянияСобытий.Завершено);
//	
//	ЗапросОтгрузки = Новый Запрос(
//	"ВЫБРАТЬ
//	|	ВЫБОР
//	|		КОГДА Отгрузка.ДокументОснование ССЫЛКА Документ.ЗаказНаАвтомобиль
//	|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(Отгрузка.ДокументОснование КАК Документ.ЗаказНаАвтомобиль).ДокументОснование КАК Документ.РабочийЛист)
//	|		ИНАЧЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(ВЫРАЗИТЬ(Отгрузка.ДокументОснование КАК Документ.ОтгрузкаАвтомобиляБезРеализации).ДокументОснование КАК Документ.ЗаказНаАвтомобиль).ДокументОснование КАК Документ.РабочийЛист)
//	|	КОНЕЦ КАК РЛ
//	|ПОМЕСТИТЬ ВТ_РЛ
//	|ИЗ
//	|	&Отгрузка КАК Отгрузка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	Событие.Ссылка КАК Ссылка,
//	|	Событие.Состояние КАК Состояние
//	|ИЗ
//	|	ВТ_РЛ КАК ВТ_РЛ
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Событие КАК Событие
//	|		ПО ВТ_РЛ.РЛ = Событие.ДокументОснование
//	|ГДЕ
//	|	(Событие.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ОАБР)
//	|			ИЛИ Событие.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ООАБР))
//	|	И Событие.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияСобытий.Отменено)
//	|	И НЕ Событие.ПометкаУдаления
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Событие.Дата");
//	
//	ЗапросОтгрузки.УстановитьПараметр("Отгрузка", Ссылка);	
//	РезультатОтгрузка = ЗапросОтгрузки.Выполнить();   

//	Если РезультатОтгрузка.Пустой() Тогда
//		СобытиеОбъект = Документы.Событие.СоздатьДокумент();
//		
//		Если ХозОперация = Справочники.ХозОперации.ОтгрузкаАвтомобиляБезРеализации Тогда 
//			СобытиеОбъект.ВидСобытия = Перечисления.ВидыСобытий.ОАБР; 
//			СобытиеОбъект.Результат = "Автомобиль отгружен.";			
//		Иначе 
//			СобытиеОбъект.ВидСобытия = Перечисления.ВидыСобытий.ООАБР;  
//			СобытиеОбъект.Результат = "Автомобиль возвращен.";			
//		КонецЕсли;		
//		
//		СобытиеОбъект.Автомобиль = Автомобиль;
//		СобытиеОбъект.Контрагент = Контрагент;	
//		
//		Если РежимЗаписиДокумента.Проведение Тогда 
//			СобытиеОбъект.Состояние = Перечисления.СостоянияСобытий.Завершено;
//		Иначе
//			СобытиеОбъект.Состояние = Перечисления.СостоянияСобытий.Отменено;
//		КонецЕсли;
//	
//		СобытиеОбъект.Приоритет = Перечисления.Важность.Средняя;
//		СобытиеОбъект.Дата = Дата;
//		СобытиеОбъект.ДатаНачала = Дата;
//		СобытиеОбъект.ДатаОкончания = СобытиеОбъект.ДатаНачала + 1800;
//		СобытиеОбъект.ВторичныйКонтакт = Истина;
//		СобытиеОбъект.ПредметОбращения = Справочники.ПредметыОбращения.Автосалон;
//		
//		Попытка
//			СобытиеОбъект.УстановитьНовыйНомер();
// 		Исключение
// 		КонецПопытки;
//		
//		Попытка
//			СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
//			Сообщить("Создана Отгрузка автомобиля без реализации: " + Строка(СобытиеОбъект.Ссылка), СтатусСообщения.Информация);
//		Исключение
//			Сообщить("ВНИМАНИЕ! Ошибка при создании Отгрузки автомобиля." + Символы.ПС 
//				+ ОписаниеОшибки(), СтатусСообщения.Важное);
//		КонецПопытки; 
//			
//		ВыдачаСсылка = СобытиеОбъект.Ссылка;
//		
//	Иначе 
//		
//		Если РежимЗаписиДокумента.Проведение Тогда  
//			
//			Если ХозОперация = Справочники.ХозОперации.ОтгрузкаАвтомобиляБезРеализации Тогда 
//				Сообщить("ОШИБКА! В текущей сделке автомобиль уже был отгружен.");
//			Иначе
//				Сообщить("ОШИБКА! В текущей сделке автомобиль уже был возвращен.");
//			КонецЕсли;
//			
//			Возврат;
//		Иначе
//			ВыборкаОтгрузка = РезультатОтгрузка.Выбрать();
//			
//			Пока ВыборкаОтгрузка.Следующий() Цикл
//				ВыдачаСсылка = ВыборкаОтгрузка.Ссылка; 
//				
//				СобытиеОбъект = ВыдачаСсылка.ПолучитьОбъект();
//				СобытиеОбъект.Состояние = Перечисления.СостоянияСобытий.Отменено;
//				
//				Попытка
//					СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
//					Сообщить("Отменена Отгрузки автомобиля: " + Строка(СобытиеОбъект.Ссылка), СтатусСообщения.Информация);
//				Исключение
//					Сообщить("ВНИМАНИЕ! Ошибка при отмене Отгрузки автомобиля." + Символы.ПС 
//					+ ОписаниеОшибки(), СтатусСообщения.Важное);
//				КонецПопытки;
//				
//			КонецЦикла;  
//						
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//КонецПроцедуры
//Иванченко 20260507 --

#Если Клиент Тогда
	////////////////////////////////////////////////////////////////////////////////
	// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА
	
	//Функция печати этикеток и ценников
	// 
	// Параметры:
	//  ТабДокумент - табличный документ.
	//
	Функция ПечатьЭтикетокИЦенников(ТабДокумент) Экспорт
		дкПечатьЭтикетокИЦенников(ЭтотОбъект);
	КонецФункции // ПечатьЭтикетокИЦенников()
	
	Функция ПолучитьТаблицуДвиженийДока() 
		
		//Запрос = Новый Запрос;
		//
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	ЗамечанияАудитора.Период,
		//|	ЗамечанияАудитора.Регистратор,
		//|	ЗамечанияАудитора.НомерСтроки,
		//|	ЗамечанияАудитора.Активность,
		//|	ЗамечанияАудитора.Основание,
		//|	ЗамечанияАудитора.Аудитор,
		//|	ЗамечанияАудитора.ТекстЗамечания
		//|ИЗ
		//|	РегистрСведений.ЗамечанияАудитора КАК ЗамечанияАудитора
		//|ГДЕ
		//|	ЗамечанияАудитора.Регистратор = &Регистратор";
		//
		//Запрос.УстановитьПараметр("Регистратор", Ссылка);  
		//
		//Возврат Запрос.Выполнить().Выгрузить();
		
	КонецФункции
	
	// Формирует печатную форму "СписаниеТоваров"
	// 
	// Параметры:
	//  ТабДокумент - табличный документ.
	//
	// Возвращаемое значение:
	//  ТабДокумент - возвращает сформированный табличный документ.
	//
	Функция ПечатьСписаниеТоваров(ТабДокумент) Экспорт
		
		ТЗ_Движений = Новый ТаблицаЗначений;
		
		ТЗ_Движений = ПолучитьТаблицуДвиженийДока();
		
		//ТЗ_Движений.ВыбратьСтроку();
		
		Макет = ПолучитьМакет("СписаниеТоваров");
		
		//для начала настроим макет
		ОбластьШапкаТаблицы = дкПривестиМакетПечатнойФормы(ЭтотОбъект,Макет);
		ФорматВыводаСуммы	= обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
		
		//вывод заголовка документа
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		ТекстЗаголовка = дкПолучитьПредставление(ЭтотОбъект);
		ОбластьМакета.Параметры.ТекстЗаголовка				= ТекстЗаголовка;
		
		
		Если НЕ обЗначениеНеЗаполнено(ПодразделениеКомпании) И НЕ обЗначениеНеЗаполнено(ПодразделениеКомпании.КПП) Тогда
			СтрокаПредставления = спПолучитьПредставление(Организация);
			ОбластьМакета.Параметры.ПредставлениеОрганизации = СтрЗаменить(СтрокаПредставления, Организация.КПП, ПодразделениеКомпании.КПП);
		Иначе	
			ОбластьМакета.Параметры.ПредставлениеОрганизации = спПолучитьПредставление(Организация);
		КонецЕсли;
		ОбластьМакета.Параметры.ПредставлениеПодразделения	= спПолучитьНаименование(ПодразделениеКомпании);
		//вывод свойств
		СтрокаСвойств = дкПолучитьСтрокуСвойствДокумента(ЭтотОбъект);
		ОбластьМакета.Параметры.СтрокаСвойств = СтрокаСвойств;
		ТабДокумент.Вывести(ОбластьМакета);
		
		НомерСтраницы = 2;
		НомерСтраницыПред = НомерСтраницы;
		
		//теперь выводим шапку
		ТабДокумент.Вывести(ОбластьШапкаТаблицы);
		
		//готовим области строки
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		
		ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента,СуммаВсего",ВалютаДокумента,0);
		//заполним параметры шапки таблицы для следующего листа
		ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		
		ИмяРегистра =  "ТМЦпереданныеСотрудникам";
		
		//перебор строк
		ВыборкаТабличнойЧасти = ЭтотОбъект.Товары;
		Для каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
			//заполняем данные строки
			СтруктураСтроки = дкПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТабличнойЧасти,ЭтотОбъект);
			
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура",СтрокаТабличнойЧасти.Номенклатура);
			
			НайдСтроки = ТЗ_Движений.НайтиСтроки(Отбор);
			
			Сумма = 0;
			
			Если НайдСтроки.Количество() > 0 Тогда
				Попытка
					Сумма = НайдСтроки[0].Сумма;	
				Исключение
					//
				КонецПопытки;	
			КонецЕсли;	
			
			//Сумма = дкПолучитьСуммуСписания(ЭтотОбъект, ИмяРегистра, тКэшСуммСписания, 
			//		СтрокаТабличнойЧасти.Номенклатура, 
			//		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, 
			//		СтрокаТабличнойЧасти.НомерСтроки);
			Цена  = Сумма / СтрокаТабличнойЧасти.Количество / СтрокаТабличнойЧасти.Коэффициент;
			
			СтруктураСтроки.Вставить("Цена",		Формат(Цена,  ФорматВыводаСуммы));
			СтруктураСтроки.Вставить("СуммаВсего",	Формат(Сумма, ФорматВыводаСуммы));
			ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);
			
			//доп. области
			мсвДопОбластиПодвала = Неопределено;
			Если ВыборкаТабличнойЧасти.Индекс(СтрокаТабличнойЧасти) = ВыборкаТабличнойЧасти.Количество()-1 Тогда
				мсвДопОбластиПодвала = Новый Массив;
				мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
			КонецЕсли;
			
			//выводим строку, делая проверку попадания на лист
			НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице,
			НомерСтраницы, СтруктураИтоговПоСтранице, ЭтотОбъект, мсвДопОбластиПодвала);
			
			//инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента,СуммаВсего",ВалютаДокумента,0);
				НомерСтраницыПред = НомерСтраницы;
				ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			КонецЕсли;
			//добавляем итоги
			СтруктураСтроки.Вставить("СуммаВсего", Сумма); // чтобы округление не сказалось на итоговой сумме
			дкДобавитьИтогиПоСтранице(СтруктураСтроки,СтруктураИтоговПоСтранице);
			
		КонецЦикла;
		
		//выводим последний подвал, если страниц больше единицы
		Если НомерСтраницы > 2 Тогда
			дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьМакетаИтогоПоСтранице,СтруктураИтоговПоСтранице,ЭтотОбъект);
		КонецЕсли;	
		
		//итоги
		ОбластьПодвал.Параметры.ВалютаДокумента = ВалютаДокумента;
		//СуммаВсего = дкПолучитьСуммуСписания(ЭтотОбъект, ИмяРегистра, тКэшСуммСписания);
		СуммаВсего = ТЗ_Движений.Итог("Сумма");
		ОбластьПодвал.Параметры.СуммаВсего = Формат(СуммаВсего, ФорматВыводаСуммы);
		ОбластьПодвал.Параметры.СуммаПрописью = "Всего наименований " + ВыборкаТабличнойЧасти.Количество()
		+" на сумму " + обЧислоПрописью(СуммаВсего,ЭтотОбъект.ВалютаДокумента);
		
		// Выводим представления и расшифровки подписей
		Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
		Отпустил.ОтпустилПредставление = ?(обЗначениеНеЗаполнено(Отпустил.Отпустил),"","/ "+ Отпустил.ОтпустилПредставление);
		ОбластьПодвал.Параметры.Заполнить(Отпустил);
		Получил  = дкОтветственноеЛицо(ЭтотОбъект,"Получил");
		Получил.ПолучилПредставление = ?(обЗначениеНеЗаполнено(Получил.Получил),"","/ "+ Получил.ПолучилПредставление);
		ОбластьПодвал.Параметры.Заполнить(Получил);
		
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвал, , , НомерСтраницы,,ЭтотОбъект);
		
		Возврат ТабДокумент;
	КонецФункции // ПечатьСписаниеТоваров()
	
	// Формирует печатную форму "ТОРГ16"
	// 
	// Параметры:
	//  ТабДокумент - табличный документ.
	//
	// Возвращаемое значение:
	//  ТабДокумент - возвращает сформированный табличный документ.
	//
	Функция ПечатьТОРГ16(ТабДокумент) Экспорт
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
		ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества",Права,,ЭтотОбъект);
		
		
		ТекстЗаголовка = дкПолучитьПредставление(ЭтотОбъект);
		
		ВалютаРегл = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		ВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
		
		Макет = ПолучитьМакет("ТОРГ16локал");
		
		СтруктураПредставления = Новый Структура(
		"Наименование,ИНН,АдресЮридический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		"","ИНН ","","тел.: ","р/с ","в банке ","БИК ","к/с ");
		
		// Выводим общие реквизиты шапки
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		ОбластьМакета.Параметры.ОрганизацияПредставление = спПолучитьПредставление(Организация, СтруктураПредставления);
		ОбластьМакета.Параметры.ОрганизацияПоОКПО		 = Организация.КодПоОКПО;
		Руководитель = дкОтветственноеЛицо(ЭтотОбъект, Перечисления.ВидыОбъектовСведений.Руководитель);
		ОбластьМакета.Параметры.Заполнить(Руководитель);
		ОбластьМакета.Параметры.Номер = дкПолучитьНомерДляПечати(ЭтотОбъект);
		ТабДокумент.Вывести(ОбластьМакета);
		
		Если ХозОперация = Справочники.ХозОперации.ОтгрузкаАвтомобиляБезРеализации Тогда  
			ТекстЗапроса = "ВЫБРАТЬ
			|	ПартииТоваровКомпании.НомерСтроки,
			|	ПартииТоваровКомпании.ДилерскийЦентр,
			|	ПартииТоваровКомпании.Номенклатура,
			|	ПРЕДСТАВЛЕНИЕ(ПартииТоваровКомпании.Номенклатура) КАК НоменклатураПредставление,
			|	ПартииТоваровКомпании.ПартияТМЦ,
			|	ПартииТоваровКомпании.Количество,
			|	ПартииТоваровКомпании.Сумма
			|ИЗ
			|	РегистрНакопления.ТМЦПереданныеСотрудникам КАК ПартииТоваровКомпании
			|ГДЕ
			|	ПартииТоваровКомпании.Регистратор = &Регистратор";
			Запрос = Новый Запрос(ТекстЗапроса);
			Запрос.УстановитьПараметр("Регистратор", Ссылка);
			ВыборкаСтрокТовары = Запрос.Выполнить().Выгрузить();
			ВыборкаСтрокТовары.Колонки.Добавить("Цена");
			ПростоеСписание = Истина;
		Иначе
			Сообщить("Неправильный вид хозяйственной операции.");
			Возврат Неопределено;
			
		КонецЕсли; 
		
		//определимся откуда будем брать многострочную часть документа
		//если движения есть, то из регистра иначе из табличной части документа
		ЕстьДвиженияПоРегистру = Ложь;
		КоличествоСтрок = ВыборкаСтрокТовары.Количество();
		Если КоличествоСтрок > 0 Тогда
			ЕстьДвиженияПоРегистру = Истина;
		Иначе
			Сообщить("Документ не проведен по партионному регистру. Отображение партий невозможно.");
			Возврат Неопределено;
			
			//ВыборкаСтрокТовары = Товары.Выгрузить();
			//  ВыборкаСтрокТовары.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
			//  ВыборкаСтрокТовары.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
			//  ВыборкаСтрокТовары.Колонки.Добавить("НоменклатураПредставление", Новый ОписаниеТипов("Строка"));
			//  ВыборкаСтрокТовары.Колонки.Добавить("ХарактеристикаНоменклатурыПредставление", Новый ОписаниеТипов("Строка"));
			
		КонецЕсли; 
		
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицыПервогоЛиста");
		ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтраницеПервогоЛиста");
		
		НомерСтраницы = 2;
		НомерСтраницыПред = НомерСтраницы;
		
		//теперь выводим шапку
		ТабДокумент.Вывести(ОбластьШапкаТаблицы);
		ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
		
		////таблица партий - преобразование
		//тблПартий = ВыборкаСтрокТовары.Скопировать();
		//Если ЕстьДвиженияПоРегистру И НЕ ПростоеСписание Тогда
		//	Попытка
		//		тблПартий.Колонки.Партия.Имя = "ПартияСтарый";
		//	Исключение КонецПопытки; 
		//	тблПартий.Колонки.ДокументПередачи.Имя = "Партия";
		//КонецЕсли;
		//тблПартий.Колонки.Добавить("ДатаПоступленияТовара", Новый ОписаниеТипов("Дата"));
		//тблПартий.Колонки.Добавить("ТоварнаяНакладнаяНомер", Новый ОписаниеТипов("Строка"));
		//тблПартий.Колонки.Добавить("ТоварнаяНакладнаяДата", Новый ОписаниеТипов("Дата"));
		//тблПартий.Колонки.Добавить("ДатаСписанияТовара", Новый ОписаниеТипов("Дата"));
		//Для Каждого ТекПартия Из тблПартий Цикл
		//	ТекПартия.ДатаСписанияТовара = Дата;
		//	Если ТекПартия.Партия <> Неопределено Тогда
		//		ТекПартия.ДатаПоступленияТовара = ТекПартия.Партия.Дата;
		//		ТекПартия.ТоварнаяНакладнаяНомер = ТекПартия.Партия.Номер;
		//		ТекПартия.ТоварнаяНакладнаяДата = ТекПартия.Партия.Дата; //OkoE - а так ли это? //тут вопрос о разнице ДатаПоступленияТовара и ТоварнаяНакладнаяДата KOZT
		//	КонецЕсли;
		//КонецЦикла;
		//тблПартий.Сортировать("ДатаПоступленияТовара, ДатаСписанияТовара, ТоварнаяНакладнаяДата");
		//
		//ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПервогоЛиста");
		//Для каждого СтрокаПартия Из тблПартий Цикл
		//	ОбластьМакета.Параметры.Заполнить(СтрокаПартия);
		
		//	//выводим строку, делая проверку попадания на лист
		//	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице,
		//		НомерСтраницы, , ЭтотОбъект);
		//		
		//	//инициализация итогов по странице
		//	Если НомерСтраницы <> НомерСтраницыПред Тогда
		//		НомерСтраницыПред = НомерСтраницы;
		//		ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		//	КонецЕсли;
		//КонецЦикла;
		//
		//ТабДокумент.Вывести(ОбластьМакетаИтогоПоСтранице);
		//	
		//ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицыВторогоЛиста");
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаВторогоЛиста");
		ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьМакетаИтого = Макет.ПолучитьОбласть("Итого");
		
		НомерСтраницы = 2;
		НомерСтраницыПред = НомерСтраницы;
		
		//теперь выводим шапку
		ТабДокумент.Вывести(ОбластьШапкаТаблицы);
		ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
		
		СтруктураИтоговПоСтранице = Новый Структура("Сумма", 0);
		
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		
		// Определим, что показывать в колонке кода - код или артикул
		ИмяКолонкиКода = дкПолучитьПараметрыРежимаВыводаКодаВДокументах(,ЭтотОбъект).Имя;
		
		СуммаПечатногоДокумента = 0;
		
		// Выводим многострочную часть документа
		Для Каждого СтрокаТовар Из ВыборкаСтрокТовары Цикл
			Если ЕстьДвиженияПоРегистру Тогда
				Если ПростоеСписание Тогда
					СтрокаТовар.Цена = СтрокаТовар.Сумма / СтрокаТовар.Количество;
				Иначе
					СтрокаТовар.Цена = СтрокаТовар.Сумма / СтрокаТовар.Количество;
				КонецЕсли; 
			Иначе
				СтрокаТовар.НоменклатураПредставление = Строка(СтрокаТовар.Номенклатура);
				СтрокаТовар.ХарактеристикаНоменклатурыПредставление = Строка(СтрокаТовар.ХарактеристикаНоменклатуры);
				СтрокаТовар.Цена = СтрокаТовар.ЦенаРозничная;
				СтрокаТовар.Сумма = СтрокаТовар.ЦенаРозничная * СтрокаТовар.Количество;
				Если ВалютаДокумента <> ВалютаРегл Тогда
					СтрокаТовар.Сумма = обПересчет(СтрокаТовар.Сумма, ВалютаДокумента, Дата, ВалютаРегл, Дата);
					СтрокаТовар.Цена = обПересчет(СтрокаТовар.Цена, ВалютаДокумента, Дата, ВалютаРегл, Дата);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Для каждого СтрокаТовар Из ВыборкаСтрокТовары Цикл
			ОбластьМакета.Параметры.Заполнить(СтрокаТовар);
			ОбластьМакета.Параметры.ТоварНаименование = СтрокаТовар.НоменклатураПредставление;
			ОбластьМакета.Параметры.ТоварКод = дкПолучитьЗначениеКолонкиКода(СтрокаТовар.Номенклатура, ИмяКолонкиКода, ЭтотОбъект);
			ОбластьМакета.Параметры.КоличествоМест = Формат(СтрокаТовар.Количество,ФорматВыводаКоличества);
			ОбластьМакета.Параметры.Цена = Формат(СтрокаТовар.Цена,ФорматВыводаСуммы);
			ОбластьМакета.Параметры.Сумма = Формат(СтрокаТовар.Сумма,ФорматВыводаСуммы);
			
			Если ЕстьДвиженияПоРегистру Тогда
				ОбластьМакета.Параметры.ЕдиницаИзмерения = СтрокаТовар.Номенклатура.БазоваяЕдиницаИзмерения;	
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКодПоОКЕИ = СтрокаТовар.Номенклатура.БазоваяЕдиницаИзмерения.Код;
			Иначе
				ОбластьМакета.Параметры.ЕдиницаИзмерения = СтрокаТовар.ЕдиницаИзмерения;
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКодПоОКЕИ = СтрокаТовар.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;
			КонецЕсли;
			
			//доп. области
			мсвДопОбластиПодвала = Неопределено;
			Если ВыборкаСтрокТовары.Индекс(СтрокаТовар) = ВыборкаСтрокТовары.Количество()-1 Тогда
				мсвДопОбластиПодвала = Новый Массив;
				мсвДопОбластиПодвала.Добавить(ОбластьМакетаИтого);
				мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
			КонецЕсли;
			
			//выводим строку, делая проверку попадания на лист
			НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице,
			НомерСтраницы, СтруктураИтоговПоСтранице, ЭтотОбъект, мсвДопОбластиПодвала);
			
			//инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				СтруктураИтоговПоСтранице = Новый Структура("Сумма", 0);
				НомерСтраницыПред = НомерСтраницы;
				ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			КонецЕсли;
			
			//добавляем итоги
			дкДобавитьИтогиПоСтранице(СтрокаТовар, СтруктураИтоговПоСтранице);
		КонецЦикла;
		
		//выводим последний подвал, если страниц больше единицы
		Если НомерСтраницы > 2 Тогда
			дкВывестиИтогиПоСтранице(ТабДокумент, ОбластьМакетаИтого, СтруктураИтоговПоСтранице, ЭтотОбъект);
		КонецЕсли;
		
		// Выводим итоги по документу в общем
		СуммаИтого = ВыборкаСтрокТовары.Итог("Сумма");
		ОбластьМакетаИтого.Параметры.Сумма = Формат(СуммаИтого, ФорматВыводаСуммы);
		ТабДокумент.Вывести(ОбластьМакетаИтого);
		
		// Выводим подвал документа
		ОбластьПодвал.Параметры.Заполнить(ЭтотОбъект);
		// форма регламентированная, все суммы в руб., итого - тоже в руб.
		ОбластьПодвал.Параметры.СуммаСписанияПрописью = обЧислоПрописью(СуммаИтого, Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить());
		
		// Комиссия
		ПредседательКомиссии= дкОтветственноеЛицо(ЭтотОбъект, "ПредседательКомиссии");	
		ЧленКомиссии1		= дкОтветственноеЛицо(ЭтотОбъект, "ЧленКомиссии1");
		ЧленКомиссии2		= дкОтветственноеЛицо(ЭтотОбъект, "ЧленКомиссии2");
		МОЛ					= дкОтветственноеЛицо(ЭтотОбъект, Перечисления.ВидыОбъектовСведений.МОЛ);
		ОбластьПодвал.Параметры.Заполнить(ПредседательКомиссии);
		ОбластьПодвал.Параметры.Заполнить(ЧленКомиссии1);
		ОбластьПодвал.Параметры.Заполнить(ЧленКомиссии2);
		ОбластьПодвал.Параметры.Заполнить(МОЛ);
		
		ТабДокумент.Вывести(ОбластьПодвал);
		
		Возврат ТабДокумент;
	КонецФункции // ПечатьТОРГ16()
	
	// Функция осуществляет печать произвольного документа.
	// Можно направить печать на экран или принтер, а также распечатать необходимое количество копий.
	//
	// Параметры:
	//	ЭтотОбъект							- ДокументОбъект	- Документ для печати
	//	НазваниеПечатнойФормы 				- Строка			- Название печатной формы, если пусто, то по умолчанию
	//	КоличествоЭкземпляров				- Число				- Количество экземпляров документа
	//	НаПринтер							- Булево			- Признак отправки документа на принтер без отображения его на экране
	//  Документ 	  						- ТабличныйДокумент	- Макет печатной формы
	//
	// Возвращаемое значение:
	//   ТабличныйДокумент	- Сформированная печатная форма
	//
	Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
		Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
	КонецФункции // Печать()
	
	// Возвращает доступные варианты печати документа
	// Возвращаемое значение: 
	//  Структура, каждая строка которой
	//  соответствует одному из вариантов печати
	//  Первый элемент структуры - форма по умолчанию
	Функция ПолучитьСписокПечатныхФорм() Экспорт
		СтруктураМакетов=Новый Структура();
		//СтруктураМакетов.Вставить("АктПриемаПередачиТС", "Акт приема-передачи ТС");
		СтруктураМакетов.Вставить("АктПриемаПередачиСоколМоторс", "Акт приема-передачи Сокол Моторс");
		Возврат СтруктураМакетов;
	КонецФункции // ПолучитьСписокПечатныхФорм()
	
	// Формирует печатную форму "Акт приема-передачи ТС"
	// 
	// Параметры:
	//  ТабДокумент - табличный документ.
	//
	// Возвращаемое значение:
	//  ТабДокумент - возвращает сформированный табличный документ.
	//
	Функция ПечатьАктПриемаПередачиТС( ТабДокумент) Экспорт
		
		//Renault Начало
		Если CRM_Клиент.ОплатаПоДоговоруНеВыполнена(ЭтотОбъект.ДоговорВзаиморасчетов) Тогда
			Возврат Неопределено;
		КонецЕсли;
		//Renault Конец 
		
		Если ХозОперация = Справочники.ХозОперации.ОтменаОтгрузкиАвтомобиляБезРеализации Тогда
			СМГ_Сообщить("ОШИБКА! ""Отмена отгрузки автомобиля без реализации"" не может быть распечатана.",СтатусСообщения.ОченьВажное);
			Возврат Неопределено;
		КонецЕсли;
		
		Если НЕ Проведен Тогда
			СМГ_Сообщить("ОШИБКА! Непроведённый документ ""Отгрузка автомобиля без реализации"" не может быть распечатан.",СтатусСообщения.ОченьВажное);
			Возврат Неопределено;
		КонецЕсли;
		
		Макет = ПолучитьМакет("АктПриемаПередачиТС");
		
		Паспорт = спПолучитьПодтверждающийДокументОбъектаПоВиду(ЭтотОбъект.Контрагент,Перечисления.ВидыДокументов.Паспорт);
		Сотрудник = обПолучитьЗначениеСвойства(ЭтотОбъект,ПланыВидовХарактеристик.СвойстваОбъектов.Отпустил,Справочники.Сотрудники.ПустаяСсылка());
		Если Сотрудник.Пустая() Тогда
			Руководитель = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.Руководитель);
			Если ЗначениеЗаполнено(Руководитель) И ТипЗнч(Руководитель)=Тип("Структура") Тогда
				Если ЗначениеЗаполнено(Руководитель.РуководительДолжность) Тогда
					ОрганизацияДолжность = ", в лице " + СокрЛП(нрег(Руководитель.РуководительДолжность));
					ДолжностьПодпись =  СокрЛП(нрег(Руководитель.РуководительДолжность));
				КонецЕсли;
			КонецЕсли;
			ОрганизацияЛицо = " " + СокрЛП(Руководитель.Руководитель)
		Иначе
			ОрганизацияЛицо = " " + СокрЛП(Сотрудник.Наименование);
			Если ЗначениеЗаполнено(Сотрудник.Должность) Тогда
				ОрганизацияДолжность = ", в лице " + СокрЛП(нрег(Сотрудник.Должность));
				ДолжностьПодпись =  СокрЛП(нрег(Сотрудник.Должность));
			КонецЕсли;
		КонецЕсли;
		
		ДоверенностьРуководителя = спПолучитьПодтверждающийДокументОбъектаПоВиду(Руководитель.Руководитель,Перечисления.ВидыДокументов.Доверенность);
		Если ЗначениеЗаполнено(ДоверенностьРуководителя) Тогда
			ОрганизацияДокумент = "Доверенности № " + ДоверенностьРуководителя.Номер + " от "
			+ Формат(ДоверенностьРуководителя.ДатаВыдачи,"ДЛФ=D");
		Иначе
			ОрганизацияДокумент = "Устава";
		КонецЕсли;
		ОрганизацияДокумент = ", действующего  на основании " + ОрганизацияДокумент;
		
		ПаспортныеДанные = "";
		Паспорт = спПолучитьПодтверждающийДокументОбъектаПоВиду(Контрагент,Перечисления.ВидыДокументов.Паспорт);
		Если ЗначениеЗаполнено(Паспорт) Тогда
			ПаспортныеДанные = ", паспорт серии " + Паспорт.Серия + " № "+ Паспорт.Номер + " выдан " + Паспорт.КемВыдан + " " + Формат(Паспорт.ДатаВыдачи,"ДФ='dd MMMM yyyy'") + "г.";
		КонецЕсли;
		
		Строка = ЭтотОбъект;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		ОбластьМакета.Параметры.Дата = Формат(?(ЭтотОбъект.ЭтоНовый(),ТекущаяДата(),ЭтотОбъект.Дата),"ДЛФ=DD");
		ОбластьМакета.Параметры.Организация = ЭтотОбъект.Организация.НаименованиеПолное;
		ОбластьМакета.Параметры.Город = киПолучитьГород(ЭтотОбъект.ПодразделениеКомпании,Справочники.ВидыКонтактнойИнформации.АдресФактический);
		
		ОбластьМакета.Параметры.ОрганизацияДолжность = ОрганизацияДолжность;
		ОбластьМакета.Параметры.ДолжностьПодпись = ДолжностьПодпись;
		ОбластьМакета.Параметры.ОрганизацияЛицо = ОрганизацияЛицо;
		ОбластьМакета.Параметры.ОрганизацияДокумент = ОрганизацияДокумент;
		
		ОбластьМакета.Параметры.Покупатель = СокрЛП(ЭтотОбъект.Контрагент.НаименованиеПолное);
		ОбластьМакета.Параметры.ПаспортныеДанные = ПаспортныеДанные;
		
		ОбластьМакета.Параметры.Модель = "" + спПолучитьНаименование(Строка.Автомобиль.Модель);
		ОбластьМакета.Параметры.ГодВыпуска = Формат(Строка.Автомобиль.ГодВыпуска,"ДФ=гггг");
		ОбластьМакета.Параметры.Цвет = Строка.Автомобиль.Цвет;
		ОбластьМакета.Параметры.VIN = Строка.Автомобиль.VIN;
		
		Если ЗначениеЗаполнено(Строка.Автомобиль.НомерКузова) Тогда
			ОбластьМакета.Параметры.НомерКузова = Строка.Автомобиль.НомерКузова;
		Иначе
			ОбластьМакета.Параметры.НомерКузова = "отсутствует";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.Автомобиль.НомерШасси) Тогда
			ОбластьМакета.Параметры.НомерШасси = Строка.Автомобиль.НомерШасси;
		Иначе
			ОбластьМакета.Параметры.НомерШасси = "отсутствует";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.Автомобиль.НомерКузова) Тогда
			ОбластьМакета.Параметры.НомерДвигателя = Строка.Автомобиль.НомерДвигателя;
		Иначе
			ОбластьМакета.Параметры.НомерДвигателя = "отсутствует";
		КонецЕсли;
		
		ПТС =  спПолучитьПодтверждающийДокументОбъектаПоВиду(Строка.Автомобиль ,Перечисления.ВидыДокументов.ПТС);
		Если обЗначениеНеЗаполнено(ПТС) Тогда
			ЭПТС =  спПолучитьПодтверждающийДокументОбъектаПоВиду(Строка.Автомобиль ,Перечисления.ВидыДокументов.ВыпискаИзЭлектронногоПаспорта);
		КонецЕсли;
		Если ЗначениеЗаполнено(ПТС) Тогда
			ОбластьМакета.Параметры.ПТС = "ПТС " + ПТС.Серия + " № "+ ПТС.Номер + " выдан " + ПТС.КемВыдан + " " + Формат(ПТС.ДатаВыдачи,"ДФ='dd MMMM yyyy'") + "г. ";
		ИначеЕсли ЗначениеЗаполнено(ЭПТС) Тогда
			ОбластьМакета.Параметры.ПТС = "ЭПТС № "+ ЭПТС.Номер + " выдан " + ЭПТС.КемВыдан + " " + Формат(ЭПТС.ДатаВыдачи,"ДФ='dd MMMM yyyy'") + "г. ";
		Иначе
			ОбластьМакета.Параметры.ПТС = "отсутствует";
		КонецЕсли;
		
		ОбластьМакета.Параметры.ЦенаАвтомобиля = Формат(Окр(Строка.СуммаДокумента),"ЧДЦ=2");
		ОбластьМакета.Параметры.ЦенаАвтомобиляПрописью = обЧислоПрописью(Строка.СуммаДокумента,ЭтотОбъект.ВалютаДокумента);
		ОбластьМакета.Параметры.Валюта = ЭтотОбъект.ВалютаДокумента;
		
		ТабДокумент.Вывести(ОбластьМакета);
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		Возврат ТабДокумент;   	
		
	КонецФункции 
	
	//Бондаренко++ 20251216	
	Функция ПадежФИО(Знач ФИО,Падеж=2,ТолькоИнициалы=Ложь) Экспорт
		Если ТипЗнч(ФИО)<>Тип("Строка") Тогда
			Сообщить("Неверная строка передана ""падежу ФИО!"""); Возврат ФИО;
		КонецЕсли;
		
		// уберем множественные пробелы
		Пока 1=1 Цикл
			ФИО=СокрЛП(СтрЗаменить(ФИО,"  "," "));
			Если Найти(ФИО,"  ")=0 Тогда Прервать КонецЕсли;
		КонецЦикла;
		
		// вернем, если сам именительный
		Если (Лев(Падеж,1)="И") или (Падеж=1) Тогда Возврат ФИО КонецЕсли;
		
		Если ТипЗнч(Падеж)=Тип("Строка") Тогда
			пад=СокрЛП(НРег(Лев(Падеж,1))); 
			Если Найти("рдвтп",пад)=0 Тогда
				Сообщить("Неверный падеж передан ""падежу ФИО""!"); Возврат ФИО;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Падеж)=Тип("Число") Тогда
			Если (Падеж<1) или (Падеж>6) Тогда
				Сообщить("Неверный падеж передан ""падежу ФИО""!"); Возврат ФИО;
			КонецЕсли;			
			пад=Падеж-1;
		КонецЕсли;
		
		ФИО=СокрЛП(НРег(ФИО)); // так удобнее
		
		// свой анализатор состава
		Фамилия="";
		Для й=1 По СтрДлина(ФИО) Цикл
			символс=Сред(ФИО,й,1);
			Если символс=" " Тогда Прервать КонецЕсли;
			Фамилия=Фамилия+символс;
		КонецЦикла;
		ы=й+1; // перешли пробел
		Имя="";
		Для й=ы По СтрДлина(ФИО) Цикл
			символс=Сред(ФИО,й,1);
			Если символс=" " Тогда Прервать КонецЕсли;
			Имя=Имя+символс;
		КонецЦикла;
		ы=й+1; // перешли второй пробел
		Отчество="";
		Для й=ы По СтрДлина(ФИО) Цикл
			символс=Сред(ФИО,й,1);
			Если символс=" " Тогда Прервать КонецЕсли;
			Отчество=Отчество+символс;
		КонецЦикла;
		
		// теперь имеем раздельно Фамилию, Имя и Отчество.	
		// начинается собственно блок анализа содержания и падежей
		
		// проанализируем пол М/Ж
		Если Прав(Отчество,1)="а" Тогда Пол="Ж" Иначе Пол="М" КонецЕсли;
		
		// создадим структуру таблицы, хранящей окончания слов
		ток = Новый ТаблицаЗначений ();
		ТипСтроки=Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(2));
		ТипЧисла=Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(1,0));
		ток.Колонки.Добавить("СтарОк",ТипСтроки); // старое окончание 2 символа
		// колонки, хранящие новые окончания слов
		ток.Колонки.Добавить("р"); // родительный
		ток.Колонки.Добавить("д"); // дательный
		ток.Колонки.Добавить("в"); // винительный
		ток.Колонки.Добавить("т"); // творительный
		ток.Колонки.Добавить("п"); // предложный
		// для указания, сколько букв с конца слова отсечь,
		ток.Колонки.Добавить("КолвоСрез",ТипЧисла); // кол-во срезаемых букв
		
		Гласные="аеэоуиыяюьъ"; // список гласных букв в виде строки
		
		// ======== обработаем фамилию ==========
		// заполним таблицу данными для фамилии
		
		Если пол="М" Тогда
			строток=ток.Добавить(); // иванов
			строток.СтарОк="*s";
			строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ым"; строток.п="е";
			строток.КолвоСрез=0;
			
			строток=ток.Добавить(); // красинский
			строток.СтарОк="ий"; 
			строток.р="ого"; строток.д="ому"; строток.в="ого"; строток.т="им"; строток.п="ом";
			строток.КолвоСрез=2;		
			
			строток=ток.Добавить(); // белый
			строток.СтарОк="ый";
			строток.р="ого"; строток.д="ому"; строток.в="ого"; строток.т="ым"; строток.п="ом";
			строток.КолвоСрез=2;
			
			строток=ток.Добавить(); // палей
			строток.СтарОк="ей";
			строток.р="я"; строток.д="ю"; строток.в="я"; строток.т="ем"; строток.п="е";
			строток.КолвоСрез=1;
			
			строток=ток.Добавить(); // рабинович
			строток.СтарОк="*ч";
			строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ем"; строток.п="е";
			строток.КолвоСрез=0;
			
			строток=ток.Добавить(); // починок, зализняк
			строток.СтарОк="*к";
			строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ом"; строток.п="е";
			строток.КолвоСрез=0;
			
			строток=ток.Добавить(); // шинкарь
			строток.СтарОк="*ь";
			строток.р="я"; строток.д="ю"; строток.в="я"; строток.т="ем"; строток.п="е";
			строток.КолвоСрез=1;
			
			строток=ток.Добавить(); // перельман, оганесян
			строток.СтарОк="*н";
			строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ом"; строток.п="е";
			строток.КолвоСрез=0;
			
			строток=ток.Добавить(); // баранкин
			строток.СтарОк="ин";
			строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ым"; строток.п="е";
			строток.КолвоСрез=0;
			
		ИначеЕсли Пол="Ж" Тогда		
			строток=ток.Добавить(); // склодовская
			строток.СтарОк="ая";
			строток.р="ой"; строток.д="ой"; строток.в="ую"; строток.т="ой"; строток.п="ой";
			строток.КолвоСрез=2;
			
			строток=ток.Добавить(); // иванова
			строток.СтарОк="*а"; 
			строток.р="ой"; строток.д="ой"; строток.в="у"; строток.т="ой"; строток.п="ой";
			строток.КолвоСрез=1;
		КонецЕсли;
		
		// таблица заполнена. считаем 2 последних буквы и поищем их
		Если не ПустаяСтрока(Фамилия) Тогда
			пб=Прав(Фамилия,2); кол="СтарОк"; // ищем по ней
			новФамилия=Фамилия; // если ничего не изменится, так и будет
			стро=ток.Найти(пб,кол);
			Если стро<>Неопределено Тогда // нашли строгое сразу
				Основа=Лев(Фамилия,СтрДлина(Фамилия)-стро.КолвоСрез);
				новФамилия=Основа+СокрЛП(стро[пад]);
			Иначе // строго не нашли, ищем только по последней
				пб="*"+Прав(пб,1); 
				стро=ток.Найти(пб,кол);
				Если стро<>Неопределено Тогда // нашли по последней
					Основа=Лев(Фамилия,СтрДлина(Фамилия)-стро.КолвоСрез);
					новФамилия=Основа+СокрЛП(стро[пад]);
				Иначе // по последней не нашли, ищем по виду буквы
					пб="*"+?(Найти(Гласные,Прав(пб,1))=0,"s","g");
					стро=ток.Найти(пб,кол);
					Если стро<>Неопределено Тогда // нашли по виду
						Основа=Лев(Фамилия,СтрДлина(Фамилия)-стро.КолвоСрез);
						новФамилия=Основа+СокрЛП(стро[пад]);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе
			новФамилия="";
		КонецЕсли;
		
		// ======== обработаем имя ==========
		// заполним таблицу данными для имени
		ток.Очистить();
		
		Если Пол="М" Тогда
			// обработаем исключения
			Если Имя="лев" Тогда Имя="льв" КонецЕсли;
			Если Имя="павел" Тогда Имя="павл" КонецЕсли;
			
			строток=ток.Добавить(); // сергей
			строток.старок="*й";
			строток.р="я"; строток.д="ю"; строток.в="я"; строток.т="ем"; строток.п="е";
			строток.колвосрез=1;
			
			строток=ток.Добавить(); // иван + лев + павел
			строток.старок="*s";
			строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ом"; строток.п="е";
			строток.колвосрез=0;
			
			строток=ток.Добавить(); // никита
			строток.старок="*а";
			строток.р="ы"; строток.д="е"; строток.в="у"; строток.т="ой"; строток.п="е";
			строток.колвосрез=1;
			
			строток=ток.Добавить(); // лука
			строток.старок="ка";
			строток.р="и"; строток.д="е"; строток.в="у"; строток.т="ой"; строток.п="е";
			строток.колвосрез=1;
			
			строток=ток.Добавить(); // иеремия
			строток.старок="ия";
			строток.р="и"; строток.д="и"; строток.в="ю"; строток.т="ей"; строток.п="и";
			строток.колвосрез=1;
			
			строток=ток.Добавить(); // илья
			строток.старок="*я";
			строток.р="и"; строток.д="е"; строток.в="ю"; строток.т="ей"; строток.п="е";
			строток.колвосрез=1;
			
			строток=ток.Добавить(); // игорь
			строток.старок="*ь";
			строток.р="я"; строток.д="ю"; строток.в="я"; строток.т="ем"; строток.п="е";
			строток.колвосрез=1;
			
		ИначеЕсли Пол="Ж" Тогда
			// обработаем исключения
			//Если Имя="ольга" Тогда Имя="ольгь" КонецЕсли;
			
			строток=ток.Добавить(); // ирина
			строток.старок="*а";
			строток.р="ы"; строток.д="е"; строток.в="у"; строток.т="ой"; строток.п="е";
			строток.колвосрез=1;
			
			строток=ток.Добавить(); // инга, ольга
			строток.старок="га";
			строток.р="и"; строток.д="е"; строток.в="у"; строток.т="ой"; строток.п="е";
			строток.колвосрез=1;
			
			строток=ток.Добавить(); // эсфирь
			строток.старок="*ь";
			строток.р="и"; строток.д="и"; строток.в="ь"; строток.т="ью"; строток.п="и";
			строток.колвосрез=1;
			
			строток=ток.Добавить(); // мария
			строток.старок="ия";
			строток.р="и"; строток.д="и"; строток.в="ю"; строток.т="ей"; строток.п="и";
			строток.колвосрез=1;
			
			строток=ток.Добавить(); // софья
			строток.старок="*я";
			строток.р="и"; строток.д="е"; строток.в="ю"; строток.т="ей"; строток.п="е";
			строток.колвосрез=1;
		КонецЕсли;
		
		// таблица заполнена. считаем 2 последних буквы и поищем их
		Если не ПустаяСтрока(Имя) Тогда
			пб=Прав(Имя,2); кол="СтарОк"; // ищем по ней
			новИмя=Имя; // если ничего не изменится, так и будет
			стро=ток.Найти(пб,кол);
			Если стро<>Неопределено Тогда // нашли строгое сразу
				Основа=Лев(Имя,СтрДлина(Имя)-стро.КолвоСрез);
				новИмя=Основа+СокрЛП(стро[пад]);
			Иначе // строго не нашли, ищем только по последней
				пб="*"+Прав(пб,1); 
				стро=ток.Найти(пб,кол);
				Если стро<>Неопределено Тогда // нашли по последней
					Основа=Лев(Имя,СтрДлина(Имя)-стро.КолвоСрез);
					новИмя=Основа+СокрЛП(стро[пад]);
				Иначе // по последней не нашли, ищем по виду буквы
					пб="*"+?(Найти(Гласные,Прав(пб,1))=0,"s","g");
					стро=ток.Найти(пб,кол);
					Если стро<>Неопределено=1 Тогда // нашли по виду
						Основа=Лев(Имя,СтрДлина(Имя)-стро.КолвоСрез);
						новИмя=Основа+СокрЛП(стро[пад]);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе
			новИмя="";
		КонецЕсли;
		
		// ======== обработаем отчество, тут проще ==========
		ток.Очистить();
		
		Если Пол="М" Тогда
			строток=ток.Добавить();
			строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ем"; строток.п="е";
			строток.колвосрез=0;
		ИначеЕсли Пол="Ж" Тогда
			строток=ток.Добавить();
			строток.р="ы"; строток.д="е"; строток.в="у"; строток.т="ой"; строток.п="е";
			строток.колвосрез=1;
		КонецЕсли;
		Если не ПустаяСтрока(Отчество) Тогда
			Основа=Лев(Отчество,СтрДлина(Отчество)-ток[0].КолвоСрез);	
			новОтчество=Основа+СокрЛП(ток[0][пад]);
		Иначе
			новОтчество="";
		КонецЕсли;	
		
		Если ТолькоИнициалы Тогда
			новИмя=Лев(новИмя,1); новОтчество=Лев(новОтчество,1);
		КонецЕсли;
		
		// установим первые буквы верхним регистром
		новФамилия=ВРег(Лев(новФамилия,1))+Сред(новФамилия,2);
		новИмя=ВРег(Лев(новИмя,1))+Сред(новИмя,2);
		новОтчество=ВРег(Лев(новОтчество,1))+Сред(новОтчество,2);
		
		// и теперь всё вместе	
		новФИО=новФамилия+" "+новИмя+" "+новОтчество;
		Возврат новФИО;
	КонецФункции
	
Функция ПолучитьПодписанта()
	
	Перем Подписант_;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Подписант) Тогда
		Подписант_ = ЭтотОбъект.Подписант;
	Иначе 
		Подписант_ = ПараметрыСеанса.Пользователь.Сотрудник;
	КонецЕсли;
	
	Возврат Подписант_;

КонецФункции
//Бондаренко++ 20251216
	
// Формирует печатную форму "Акт приема-передачи ТС"
// 
// Параметры:
//  ТабДокумент - табличный документ.
//
// Возвращаемое значение:
//  ТабДокумент - возвращает сформированный табличный документ.
//
Функция ПечатьАктПриемаПередачиСоколМоторс(ТабДокумент) Экспорт
		
		//Renault Начало
		Если CRM_Клиент.ОплатаПоДоговоруНеВыполнена(ЭтотОбъект.ДоговорВзаиморасчетов) Тогда
			Возврат Неопределено;
		КонецЕсли;
		//Renault Конец 
		
		Если ХозОперация = Справочники.ХозОперации.ОтменаОтгрузкиАвтомобиляБезРеализации Тогда
			СМГ_Сообщить("ОШИБКА! ""Отмена отгрузки автомобиля без реализации"" не может быть распечатана.",СтатусСообщения.ОченьВажное);
			Возврат Неопределено;
		КонецЕсли;
		
		Если НЕ Проведен Тогда
			СМГ_Сообщить("ОШИБКА! Непроведённый документ ""Отгрузка автомобиля без реализации"" не может быть распечатан.",СтатусСообщения.ОченьВажное);
			Возврат Неопределено;
		КонецЕсли;
		
		//Бондаренко++ 20251218
		КонтрагентЯвляетсяФизЛицом = Истина;
		Если НЕ ЭтотОбъект.Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
			ТаблицаРезультат = Новый ТаблицаЗначений;
			РаботаСКонтактнымиЛицами.ПолучитьВедомых(ЭтотОбъект.Контрагент,ТаблицаРезультат);
			Если ТаблицаРезультат.Количество() = 0 Тогда
				СМГ_Сообщить("ОШИБКА! У контрагента """+ЭтотОбъект.Контрагент+""", на вкладке ""Контакты"", нет ни одного контактного лица. Печать документа невозможна.",СтатусСообщения.ОченьВажное);		
				Предупреждение("ОШИБКА! У контрагента """+ЭтотОбъект.Контрагент+""", на вкладке ""Контакты"", нет ни одного контактного лица. Печать документа невозможна.");					
				Возврат Неопределено;
			Иначе
				//===========================================
				ТаблицаРезультат = Новый ТаблицаЗначений;
				РаботаСКонтактнымиЛицами.ПолучитьВедомых(ЭтотОбъект.Контрагент,ТаблицаРезультат);
				СЗ = Новый СписокЗначений;
				СЗ.ЗагрузитьЗначения(ТаблицаРезультат.ВыгрузитьКолонку("Ведомый"));
				ТекЭл = СЗ.ВыбратьЭлемент("Выбирайте контактное лицо.",ТекЭл);
				Попытка
					КонтактноеЛицоСсылка = ТекЭл.Значение;
				Исключение
					//	
				КонецПопытки;
				
				//Бондаренко-- 20210924
				Должность = "";
				Если ЗначениеЗаполнено(КонтактноеЛицоСсылка) Тогда
					//Бондаренко++ 20230407
					//Должность = СокрЛП(КонтактноеЛицоСсылка.Должность.Наименование); 
					Отбор = Новый Структура();
					Отбор.Вставить("Ведомый",КонтактноеЛицоСсылка);
					Строки = ТаблицаРезультат.НайтиСтроки(Отбор);
					Если Строки.Количество() > 0 Тогда
						Должность = СокрЛП(Строки[0].Должность);
					КонецЕсли;
					Если Должность <> "" Тогда
						ПозицияПробела = Найти(Должность," ");
						Если ПозицияПробела > 0 Тогда
							Должность = СокрЛП(ПадежФИО(Сред(Должность,1,ПозицияПробела-1)))+" "+СокрЛП(ПадежФИО(Сред(Должность,ПозицияПробела+1)));	
						Иначе
							Должность = ПадежФИО(Должность);	
						КонецЕсли; 
					КонецЕсли; 
					//Бондаренко-- 20230407 
					КонтактноеЛицо = СокрЛП(СокрЛП(Должность) + " " + СокрЛП(ПадежФИО(КонтактноеЛицоСсылка.Наименование)));
				Иначе
					КонтактноеЛицо = "";
				КонецЕсли;	
				
				Если ЭтотОбъект.Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо
					И (Найти(НРег(Должность), "директор") > 0 Или Найти(НРег(Должность), "председат")) Тогда		
					ПодтвДокументКонтактногЛица = "Устава";		
				Иначе
					ФормаВыбора = Справочники.ПодтверждающиеДокументы.ПолучитьФормуВыбора();
					ФормаВыбора.Заголовок = "Выбор подтверждающего документа";
					ФормаВыбора.Отбор.Владелец.Значение = КонтактноеЛицоСсылка;
					ФормаВыбора.Отбор.Владелец.Использование = Истина;
					ПодтвДокументСсылка = ФормаВыбора.ОткрытьМодально();	
					Если ЗначениеЗаполнено(ПодтвДокументСсылка) Тогда
						ПодтвДокументКонтактногЛица = ПодтвДокументСсылка.Наименование;
					Иначе
						ПодтвДокументКонтактногЛица = "";
					КонецЕсли;	
				КонецЕсли;
				//===========================================
 			КонецЕсли;
			КонтрагентЯвляетсяФизЛицом = Ложь;
		КонецЕсли;             
		//Бондаренко-- 20251218 
		
		Макет = ПолучитьМакет("АктПриемаПередачиСоколМоторс");
		
		//-----------------------------------------------------------------------
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");  
		
		ОбластьМакета.Параметры.Номер = СокрЛП(ДокументОснование.Номер);
		ОбластьМакета.Параметры.ДатаДок = Формат(ДокументОснование.Дата,"ДФ=dd.MM.yyyy");
		
		//Бондаренко++ 20260212
		Если ДокументОснование.ДоговорВзаиморасчетов.ДатаКП <> Дата(1,1,1) Тогда
			ОбластьМакета.Параметры.ДатаДок = Формат(ДокументОснование.ДоговорВзаиморасчетов.ДатаКП,"ДФ=dd.MM.yyyy");
		КонецЕсли;
		//Бондаренко-- 20260212
		 
		ОбластьМакета.Параметры.Город = киПолучитьГород(ЭтотОбъект.ПодразделениеКомпании,Справочники.ВидыКонтактнойИнформации.АдресФактический);
		
		ТабДокумент.Вывести(ОбластьМакета);
	 	
		//-------------------------------------------
		 
		Если ЭтотОбъект.Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
	 		ОбластьМакета = Макет.ПолучитьОбласть("ФизЛицо");
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("ЮрЛицо");	
		КонецЕсли;	
		
		ОрганизацияНаименованиеПолное = Организация.НаименованиеПолное;
		
		ОбластьМакета.Параметры.ОрганизацияНаименованиеПолное = ОрганизацияНаименованиеПолное;
 		
		Паспорт = спПолучитьПодтверждающийДокументОбъектаПоВиду(ЭтотОбъект.Контрагент,Перечисления.ВидыДокументов.Паспорт);
  		
		//Бондаренко++ 20251216
		СтруктураОтбора = Новый Структура("Организация,Объект", Организация, Перечисления.ВидыОбъектовСведений.Руководитель);
		СтруктураСведений = РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(РабочаяДата, СтруктураОтбора);
		Руководитель = СтруктураСведений.Значение;
		СтруктураСведений = Неопределено;
		Попытка
			СтруктураОтбора = Новый Структура("Организация", Организация);
			СтруктураСведений = РегистрыСведений.ИОГенеральногоДиректора.ПолучитьПоследнее(ДокументОснование.Дата, СтруктураОтбора);
		Исключение
		КонецПопытки;
		Если СтруктураСведений <> Неопределено И ДокументОснование.Дата >= СтруктураСведений.ДатаНачала И ДокументОснование.Дата < КонецДня(СтруктураСведений.ДатаОкончания) Тогда
			Руководитель = СтруктураСведений.Значение;
			ОбластьМакета.Параметры.ВЛицеРуководителя = " и.о. Генерального директора " + ПадежФИО(Руководитель.Наименование);
			ФормаВыбора = Справочники.ПодтверждающиеДокументы.ПолучитьФормуВыбора();
			ФормаВыбора.Заголовок = "Выбор доверенности для и.о. Генерального директора";
			ФормаВыбора.Отбор.Владелец.Значение = Руководитель;
			ФормаВыбора.Отбор.Владелец.Использование = Истина;
			ФормаВыбора.Отбор.ВидПодтверждающегоДокумента.Значение = Перечисления.ВидыДокументов.Доверенность;
			ФормаВыбора.Отбор.ВидПодтверждающегоДокумента.Использование = Истина;
			ПодтвДокументСсылка = ФормаВыбора.ОткрытьМодально();	
			Если ЗначениеЗаполнено(ПодтвДокументСсылка) Тогда
				ПодтвДокумент = ПодтвДокументСсылка.Наименование;
				ОбластьМакета.Параметры.НаОсновании = "доверенности от " + Формат(ПодтвДокументСсылка.ДатаВыдачи, "ДЛФ=Д");			
			Иначе
				Возврат Неопределено;
			КонецЕсли;	
		Иначе
			ОбластьМакета.Параметры.ВЛицеРуководителя = "Генерального директора " + ПадежФИО(Руководитель.Наименование);
			ОбластьМакета.Параметры.НаОсновании = "Устава";			
		КонецЕсли;
		
 		Подписант = ПолучитьПодписанта();
 		
		//Бондаренко++ 20210517
		ТекущаяДоверенность = СМ_ФормированиеНовыхОбъектов.ПолучитьДоверенность(Подписант,Организация);
		Если ТекущаяДоверенность<>Неопределено Тогда
			ОбластьМакета.Параметры.ВЛицеРуководителя = СМ_ФормированиеНовыхОбъектов.daСклонение(Подписант.Должность,2)+ " " + СМ_ФормированиеНовыхОбъектов.ПадежФИО(Подписант.Наименование);
			ОбластьМакета.Параметры.НаОсновании = "доверенности № "+ТекущаяДоверенность.Номер+ " от " + Формат(ТекущаяДоверенность.ДатаВыдачи,"ДФ=dd.MM.yy");
			ПодписьПродавца = Подписант;
			ОснованиеПодписи = "по "+ОбластьМакета.Параметры.НаОсновании;
		КонецЕсли; 
		//Бондаренко-- 20251217
		
		Сотрудник = обПолучитьЗначениеСвойства(ЭтотОбъект,ПланыВидовХарактеристик.СвойстваОбъектов.Отпустил,Справочники.Сотрудники.ПустаяСсылка());
		Если Сотрудник.Пустая() Тогда
			Руководитель = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.Руководитель);
			Если ЗначениеЗаполнено(Руководитель) И ТипЗнч(Руководитель)=Тип("Структура") Тогда
				Если ЗначениеЗаполнено(Руководитель.РуководительДолжность) Тогда
					ОрганизацияДолжность = ", в лице " + СокрЛП(нрег(Руководитель.РуководительДолжность));
					ДолжностьПодпись =  СокрЛП(нрег(Руководитель.РуководительДолжность));
				КонецЕсли;
			КонецЕсли;
			ОрганизацияЛицо = " " + СокрЛП(Руководитель.Руководитель)
		Иначе
			ОрганизацияЛицо = " " + СокрЛП(Сотрудник.Наименование);
			Если ЗначениеЗаполнено(Сотрудник.Должность) Тогда
				ОрганизацияДолжность = ", в лице " + СокрЛП(нрег(Сотрудник.Должность));
				ДолжностьПодпись =  СокрЛП(нрег(Сотрудник.Должность));
			КонецЕсли;
		КонецЕсли;
		
		ДоверенностьРуководителя = спПолучитьПодтверждающийДокументОбъектаПоВиду(Руководитель.Руководитель,Перечисления.ВидыДокументов.Доверенность);
		Если ЗначениеЗаполнено(ДоверенностьРуководителя) Тогда
			ОрганизацияДокумент = "Доверенности № " + ДоверенностьРуководителя.Номер + " от "
			+ Формат(ДоверенностьРуководителя.ДатаВыдачи,"ДЛФ=D");
		Иначе
			ОрганизацияДокумент = "Устава";
		КонецЕсли;
		ОрганизацияДокумент = ", действующего  на основании " + ОрганизацияДокумент;
		
		ПаспортныеДанные = "";
		Паспорт = спПолучитьПодтверждающийДокументОбъектаПоВиду(Контрагент,Перечисления.ВидыДокументов.Паспорт);
		Если ЗначениеЗаполнено(Паспорт) Тогда
			ПаспортныеДанные = ", паспорт серии " + Паспорт.Серия + " № "+ Паспорт.Номер + " выдан " + Паспорт.КемВыдан + " " + Формат(Паспорт.ДатаВыдачи,"ДФ='dd MMMM yyyy'") + "г.";
		КонецЕсли;
		
 		ОбластьМакета.Параметры.Покупатель = СокрЛП(ЭтотОбъект.Контрагент.НаименованиеПолное);
		
		Если КонтрагентЯвляетсяФизЛицом Тогда
			ОбластьМакета.Параметры.ПаспортныеДанные = ПаспортныеДанные;
 			ОбластьМакета.Параметры.АдресПокупателя = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
		Иначе	
		     //Данные по юрику
			 ОбластьМакета.Параметры.КонтактноеЛицо = КонтактноеЛицо;
			 ОбластьМакета.Параметры.ПодтвДокументКонтактногЛица = ПодтвДокументКонтактногЛица;
		КонецЕсли;
  		
		ТабДокумент.Вывести(ОбластьМакета);
		
		//-----------------------------------------------------------------------------------
		
		//Бондаренко++ 20251220
		//ОбластьМакета = Макет.ПолучитьОбласть("СредняяЧасть");
		Если Автомобиль.Модель.Марка = Справочники.Марка.HAVAL Тогда
			ЭтоHAVAL = Истина;
		Иначе	
			ЭтоHAVAL = Ложь;
		КонецЕсли;
		
		Если НЕ ЭтоHAVAL  Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("СредняяЧасть");
		Иначе	
		    ОбластьМакета = Макет.ПолучитьОбласть("HAVALСредняяЧасть");
		КонецЕсли;
		//Бондаренко-- 20251220
 		
		Строка = ЭтотОбъект;
 	 	
		//ОбластьМакета.Параметры.Дата = Формат(?(ЭтотОбъект.ЭтоНовый(),ТекущаяДата(),ЭтотОбъект.Дата),"ДЛФ=DD");
		//ОбластьМакета.Параметры.Организация = ЭтотОбъект.Организация.НаименованиеПолное;
 		
		//ОбластьМакета.Параметры.ОрганизацияДолжность = ОрганизацияДолжность;
		//ОбластьМакета.Параметры.ДолжностьПодпись = ДолжностьПодпись;
		//ОбластьМакета.Параметры.ОрганизацияЛицо = ОрганизацияЛицо;
		//ОбластьМакета.Параметры.ОрганизацияДокумент = ОрганизацияДокумент;
 		
		ОбластьМакета.Параметры.Модель = "" + спПолучитьНаименование(Строка.Автомобиль.Модель);
		 
		ОбластьМакета.Параметры.Цвет = Строка.Автомобиль.Цвет;
		ОбластьМакета.Параметры.VIN = Строка.Автомобиль.VIN;
		
 
		// Холышевская ++ 22.03.2026
		Если Не ЭтоHAVAL Тогда
			Если ЗначениеЗаполнено(Строка.Автомобиль.НомерШасси) Тогда
				ОбластьМакета.Параметры.НомерШасси = Строка.Автомобиль.НомерШасси;
			Иначе
				ОбластьМакета.Параметры.НомерШасси = "отсутствует";
			КонецЕсли; 
		КонецЕсли;
		// Холышевская -- 22.03.2026
		
		Если ЗначениеЗаполнено(Строка.Автомобиль.НомерДвигателя) Тогда
			ОбластьМакета.Параметры.НомерДвигателя = Строка.Автомобиль.НомерДвигателя;
		Иначе
			ОбластьМакета.Параметры.НомерДвигателя = "отсутствует";
		КонецЕсли;
 		
		ПТС =  спПолучитьПодтверждающийДокументОбъектаПоВиду(Строка.Автомобиль ,Перечисления.ВидыДокументов.ПТС);
		Если обЗначениеНеЗаполнено(ПТС) Тогда
			ЭПТС =  спПолучитьПодтверждающийДокументОбъектаПоВиду(Строка.Автомобиль ,Перечисления.ВидыДокументов.ВыпискаИзЭлектронногоПаспорта);
		КонецЕсли;
		Если ЗначениеЗаполнено(ПТС) Тогда
			ОбластьМакета.Параметры.ПТС = "ПТС " + ПТС.Серия + " № "+ ПТС.Номер + " выдан " + ПТС.КемВыдан + " " + Формат(ПТС.ДатаВыдачи,"ДФ='dd MMMM yyyy'") + "г. ";
		ИначеЕсли ЗначениеЗаполнено(ЭПТС) Тогда
			ОбластьМакета.Параметры.ПТС = "ЭПТС № "+ ЭПТС.Номер + " выдан " + ЭПТС.КемВыдан + " " + Формат(ЭПТС.ДатаВыдачи,"ДФ='dd MMMM yyyy'") + "г. ";
		Иначе
			ОбластьМакета.Параметры.ПТС = "отсутствует";
		КонецЕсли;
		
		Если Не ЭтоHAVAL Тогда
			ОбластьМакета.Параметры.ГодВыпуска = Формат(Строка.Автомобиль.ГодВыпуска,"ДФ=гггг");
			ОбластьМакета.Параметры.Комплектация = Строка.Автомобиль.ВариантКомплектации;
			//Бондаренко++ 20260303
			//ОбластьМакета.Параметры.ТипТС = Строка.Автомобиль;
			ОбластьМакета.Параметры.ТипТС = "Легковой";
			//Бондаренко++ 20260303
			// Холышевская ++ 22.03.2026
			// Перенесла ниже для хавала тоже нужен номер кузова
			//Если ЗначениеЗаполнено(Строка.Автомобиль.НомерКузова) Тогда
			//	ОбластьМакета.Параметры.НомерКузова = Строка.Автомобиль.НомерКузова;
			//Иначе
			//	ОбластьМакета.Параметры.НомерКузова = "отсутствует";
			//КонецЕсли;
			// Холышевская -- 22.03.2026
		КонецЕсли; 
		// Холышевская ++ 22.03.2026
		Если ЗначениеЗаполнено(Строка.Автомобиль.НомерКузова) Тогда
			ОбластьМакета.Параметры.НомерКузова = Строка.Автомобиль.НомерКузова;
		Иначе
			ОбластьМакета.Параметры.НомерКузова = "отсутствует";
		КонецЕсли;   
		// Холышевская -- 22.03.2026

 		
		//ОбластьМакета.Параметры.ЦенаАвтомобиля = Формат(Окр(Строка.СуммаДокумента),"ЧДЦ=2");
		//ОбластьМакета.Параметры.ЦенаАвтомобиляПрописью = обЧислоПрописью(Строка.СуммаДокумента,ЭтотОбъект.ВалютаДокумента);
		//ОбластьМакета.Параметры.Валюта = ЭтотОбъект.ВалютаДокумента;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		Если Автомобиль.Модель.Марка = Справочники.Марка.JAECOO Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("JAECOO");
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		
		Если Автомобиль.Модель.Марка = Справочники.Марка.GEELY ИЛИ
			Автомобиль.Модель.Марка = Справочники.Марка.BELGEE ИЛИ
			Автомобиль.Модель.Марка = Справочники.Марка.KNEWSTAR Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("GEELYBELGEEKNEWSTAR");
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		
		Если Автомобиль.Модель.Марка = Справочники.Марка.OMODA Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("OMODA");
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		
 		ОбластьМакета.Параметры.ОрганизацияНаименованиеДляПечати = Ссылка.ПодразделениеКомпании.Организация.НаименованиеДляПечати;
 		ОбластьМакета.Параметры.ОрганизацияЛицо    = Подписант;
		ОбластьМакета.Параметры.ОснованиеПодписи   =  ОснованиеПодписи;
		
		ТабДокумент.Вывести(ОбластьМакета); 
		
		//Бондаренко++ 20251227
		ТабДокумент.НижнийКолонтитул.Выводить = Истина;
		ТабДокумент.РазмерКолонтитулаСнизу = 17;
		ТабДокумент.НижнийКолонтитул.НачальнаяСтраница = 1;
		ТабДокумент.ПолеСнизу = 15;
		ТабДокумент.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
		ТабДокумент.НижнийКолонтитул.ТекстСлева = ""+СокрЛП(Ссылка.ПодразделениеКомпании.Организация.НаименованиеДляПечати)+"__________________________" + Символы.ПС + "                                      подпись Продавца";
		ТабДокумент.НижнийКолонтитул.ТекстСправа = "__________________________" + Символы.ПС + "   подпись Покупателя   ";
  		//Бондаренко-- 20251227
		
		//Бондаренко++ 20260303
		ТабДокумент.НижнийКолонтитул.Шрифт = Новый Шрифт("Arial", 8);
		//Бондаренко-- 20260303
		
		//ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		Возврат ТабДокумент;   	
		
	КонецФункции  // ПечатьАктПриемаПередачиСоколМоторс(ТабДокумент)
	
#КонецЕсли
// Если Клиент Тогда - завершена клиентская часть


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Процедура - обработчик ввода на основании
Процедура ОбработкаЗаполнения(Основание) Экспорт
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
		Автор = Основание.Автор;
		ВалютаДокумента = Основание.ВалютаДокумента;
		ДатаОперации = ТекущаяДата();
		ДатаСоздания = ТекущаяДата();
		Комментарий = Основание.Комментарий;
		КурсДокумента = Основание.КурсДокумента;
		Организация = Основание.Организация;
		ПодразделениеКомпании = Основание.ПодразделениеКомпании;
		Сумма = Основание.СуммаВсегоНаАвтомобиль;
		ТипЦен = Основание.ТипЦен;
		ХозОперация = Справочники.ХозОперации.ОтгрузкаАвтомобиляБезРеализации;
		ДокументОснование = Основание;
		ДилерскийЦентр = Основание.ПодразделениеКомпании.ДилерскийЦентр;
		Менеджер = Основание.Менеджер;
		СуммаНДС = Основание.СуммаНДСНаАвтомобиль;
		СтавкаНДС = Основание.СтавкаНДСНаАвтомобиль;
		Контрагент = Основание.Контрагент;
		ДоговорВзаиморасчетов = Основание.ДоговорВзаиморасчетов;
		Автомобиль = Основание.Автомобиль;
		//Бондаренко++ 20251112	
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ОтгрузкаАвтомобиляБезРеализации") Тогда
		Автор = Основание.Автор;
		ВалютаДокумента = Основание.ВалютаДокумента;
		ДатаОперации = ТекущаяДата();
		ДатаСоздания = ТекущаяДата();
		Комментарий = Основание.Комментарий;
		КурсДокумента = Основание.КурсДокумента;
		Организация = Основание.Организация;
		ПодразделениеКомпании = Основание.ПодразделениеКомпании;
		Сумма = Основание.Сумма;
		ТипЦен = Основание.ТипЦен;
		ХозОперация = Справочники.ХозОперации.ОтменаОтгрузкиАвтомобиляБезРеализации;
		ДокументОснование = Основание;
		ДилерскийЦентр = Основание.ПодразделениеКомпании.ДилерскийЦентр;
		Менеджер = Основание.Менеджер;
		СуммаНДС = Основание.СуммаНДС;
		СтавкаНДС = Основание.СтавкаНДС;
		Контрагент = Основание.Контрагент;
		ДоговорВзаиморасчетов = Основание.ДоговорВзаиморасчетов;
		Автомобиль = Основание.Автомобиль;
		СкладКомпании = Основание.СкладКомпании;
		//Бондаренко-- 20251112
	Иначе
		СМГ_Сообщить("ОШИБКА! Ввод на основании документа такого типа запрещён",СтатусСообщения.ОченьВажное);
	КонецЕсли;
	
	//Запрос = Новый Запрос;
	//
	//Запрос.Текст = 	"ВЫБРАТЬ
	//               	|	ПраваИНастройки.Значение
	//               	|ИЗ
	//               	|	РегистрСведений.ПраваИНастройки КАК ПраваИНастройки
	//               	|ГДЕ
	//               	|	ПраваИНастройки.Объект = &Объект
	//               	|	И ПраваИНастройки.ПравоНастройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ПраваИНастройки.ВводНаОснованииПроведенныхДокументов)";
	//
	//Запрос.УстановитьПараметр("Объект", ПараметрыСеанса.Пользователь);
	//ВыборкаНастроек = Запрос.Выполнить().Выбрать();
	//
	//Если ВыборкаНастроек.Следующий() Тогда
	//	Если ВыборкаНастроек.Значение = Истина Тогда  
	// 		РегистрыСведений.ПраваИНастройки.СоздатьМенеджерЗаписи();
	//	КонецЕсли;
	//КонецЕсли;	
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриКопировании()

//Бондаренко++ 20260213
Функция ЕстьПодчиненныеПроведенныеОтмены()
	
	ДокОтгр_ = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтгрузкаАвтомобиляБезРеализации.Ссылка КАК ОтменаОтгрузки,
		|	ОтгрузкаАвтомобиляБезРеализации.Проведен КАК Проведен,
		|	ОтгрузкаАвтомобиляБезРеализации.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.ОтгрузкаАвтомобиляБезРеализации КАК ОтгрузкаАвтомобиляБезРеализации
		|ГДЕ
		|	ОтгрузкаАвтомобиляБезРеализации.Проведен
		|	И ОтгрузкаАвтомобиляБезРеализации.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование",Ссылка );
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокОтгр_ = ВыборкаДетальныеЗаписи.ОтменаОтгрузки;
		Прервать;
	КонецЦикла;
	
	Возврат ДокОтгр_;
 
КонецФункции // ЕстьПодчиненныеПроведенныеОтмены()
//Бондаренко-- 20260213

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//Галактионов++ 15062026
	Если Не ЭтоНовый() И Не Отказ И РежимЗаписи = РежимЗаписиДокумента.Проведение И
		ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказНаАвтомобиль") И 
		ЗначениеЗаполнено(ДокументОснование.ДокументОснование) И ТипЗнч(ДокументОснование.ДокументОснование) = Тип("ДокументСсылка.РабочийЛист") Тогда
		РегистрыСведений.SM_ФиксацияРабочихЛистов.ДобавитьЗапись(ДокументОснование.ДокументОснование);
	КонецЕсли;
	//Галактионов++ 15062026
	//Бондаренко++ 20251210 
	//Иванченко 20251211 ++
	ЗапросПереходВСобственность = Новый Запрос;
	ЗапросПереходВСобственность.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеАвтомобилей.Ссылка КАК ПереходВСобственность
	|ИЗ
	|	Документ.ПоступлениеАвтомобилей КАК ПоступлениеАвтомобилей
	|ГДЕ
	|	НЕ ПоступлениеАвтомобилей.Ссылка.ПометкаУдаления
	|	И ПоступлениеАвтомобилей.ОтгрузкаАвтомобиляБезРеализации = &Ссылка
	|	И ПоступлениеАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПереходВСобственностьАвтомобилей)";
	
	ЗапросПереходВСобственность.Параметры.Вставить("Ссылка", Ссылка);
	ВыборкаПереходВСобственность = ЗапросПереходВСобственность.Выполнить().Выбрать();
	
	Если ВыборкаПереходВСобственность.Следующий() Тогда
		НетПоступления = Ложь;
	Иначе 
		НетПоступления = Истина;
	КонецЕсли;
	//Иванченко 20251211 --	    
	
	Если РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения
		И НачалоДня(ТекущаяДата()) > НачалоДня(ДатаСоздания)
		И НетПоступления
		И НЕ (РольДоступна("СМ_АудиторСервиса") ИЛИ РольДоступна("ПолныеПрава")) Тогда
		//Бондаренко++ 20251227 не проводятся реализации по старым отгрузкам
		//Отказ = Истина;
		//СМГ_Сообщить("ОШИБКА! ""Отгрузка без реализации"" может быть проведена только текущим днём.", СтатусСообщения.Важное);
		//Возврат;		
		//Бондаренко-- 20251227
	КонецЕсли;		
	//Бондареенко-- 20251210	
	
	//Бондаренко++ 20250628
	Если РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда
		//Бондаренко++ 20251111	
		Если ХозОперация = Справочники.ХозОперации.ОтгрузкаАвтомобиляБезРеализации Тогда
			//Бондаренко-- 20251111		
			Отказ = ПроверитьНаличиеАвтомобиляНаСкладе(Автомобиль, СкладКомпании);
			Если Отказ Тогда
				СМГ_Сообщить("ОШИБКА! Автомобиля """+Автомобиль+""" нет на складе """+СкладКомпании+""".",СтатусСообщения.ОченьВажное);
				Возврат;
			КонецЕсли;
			//Бондаренко++ 20251111	
		КонецЕсли;
		//Бондаренко-- 20251111	
	КонецЕсли;
	
	//Бондаренко++ 20260213
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если ХозОперация=Справочники.ХозОперации.ОтменаОтгрузкиАвтомобиляБезРеализации Тогда
			Если ТипЗНЧ(ДокументОснование) = ТИП("ДокументСсылка.ОтгрузкаАвтомобиляБезРеализации") Тогда
				Если Не Документоснование.Проведен Тогда
					СМГ_Сообщить("ОШИБКА! Документ-основание <<"+ДокументОснование+">> не проведен.",СтатусСообщения.ОченьВажное);
					Отказ = Истина;
					Возврат;
				КонецЕсли;
				Если Документоснование.БезСписанияОстаткаАвто Тогда
					СМГ_Сообщить("ОШИБКА! Документ-основание <<"+ДокументОснование+">> проведен без списания остатка авто.",СтатусСообщения.ОченьВажное);
					Отказ = Истина;
					Возврат;
				КонецЕсли;
 			КонецЕсли;
		КонецЕсли;
		Если ХозОперация=Справочники.ХозОперации.ОтгрузкаАвтомобиляБезРеализации Тогда
			ДокОтмены = ЕстьПодчиненныеПроведенныеОтмены();
			Если Не обЗначениеНеЗаполнено(ДокОтмены) Тогда
 				СМГ_Сообщить("ОШИБКА! Есть подчиненный документ <<"+ДокументОснование+">> с хозоперацией 'Отмена отгрузки' и он проведен. Распроведите его.",СтатусСообщения.ОченьВажное);
				Отказ = Истина;
				Возврат;
 			КонецЕсли;
 		КонецЕсли;
  	КонецЕсли;
	//Бондаренко-- 20260213
	
	//Бондаренко++ 20251225
	Если Дата > Дата(2025,12,24) Тогда   
		// Холышевская ++ 08.04.2026
		//Если Не ЭтотОбъект.ЭтоНовый() Тогда   
		// Холышевская -- 08.04.2026
			Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				Если ХозОперация = Справочники.ХозОперации.ОтгрузкаАвтомобиляБезРеализации Тогда 
					Если НЕ обЗначениеНеЗаполнено(ДокументОснование) Тогда
						Если ТипЗНЧ(ДокументОснование) = Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
							Если НЕ обЗначениеНеЗаполнено(ДокументОснование.ДокументОснование) Тогда	
								Если ТипЗНЧ(ДокументОснование.ДокументОснование) = Тип("ДокументСсылка.РабочийЛист") Тогда 
									//Бондаренко 20260320 ++
									//Если ДокументОснование.ДокументОснование.ПолучитьФорму("ФормаДокумента").Открыта() ИЛИ ДокументОснование.ДокументОснование.ПолучитьФорму("ФормаСписка").Открыта() Тогда
									//Бондаренко 20260320 --						
										Если ДокументОснование.ДокументОснование.ВидОплаты = Перечисления.ВидыОплаты.Кредит Тогда
											КоличествоВложенныхФайлов = 0;			  	 	
											Запрос = Новый Запрос;
											Запрос.Текст = 
											"ВЫБРАТЬ
											|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КартинкиИФайлы.Объект) КАК КоличествоРазличных,
											|	КартинкиИФайлы.Объект
											|ИЗ
											|	РегистрСведений.КартинкиИФайлы КАК КартинкиИФайлы
											|ГДЕ
											|	КартинкиИФайлы.Объект = &ВыбОбъект
											|
											|СГРУППИРОВАТЬ ПО
											|	КартинкиИФайлы.Объект";
											
											Запрос.УстановитьПараметр("ВыбОбъект",ЭтотОбъект.Ссылка);
											
											РезультатЗапроса = Запрос.Выполнить();
											
											ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
											
											Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
												КоличествоВложенныхФайлов = ВыборкаДетальныеЗаписи.КоличествоРазличных;
											КонецЦикла;
											
											Если КоличествоВложенныхФайлов = 0 Тогда
												СМГ_Сообщить("ОШИБКА! По кредитной сделке отсутствуют вложенные файлы.",СтатусСообщения.ОченьВажное);
												//Предупреждение("ОШИБКА! По кредитной сделке отсутствуют вложенные файлы.");	
												Отказ = Истина;
												Возврат;
											КонецЕсли;
											
											//Бондаренко++ 20251226
											СчетИлиАвтоВКредит_ = ДокументОснование.ДокументОснование.СчетИлиАвтоВКредит;
											
											Если СуммаБанковскойГарантии <> СчетИлиАвтоВКредит_ Тогда
												СМГ_Сообщить("ОШИБКА! По кредитной сделке Сумма банковской гарантии = "+СокрЛП(СуммаБанковскойГарантии)+" и не равна Сумме счета = "+СокрЛП(СчетИлиАвтоВКредит_),СтатусСообщения.ОченьВажное);
												//Предупреждение("ОШИБКА!  По кредитной сделке Сумма банковской гарантии = "+СокрЛП(СуммаБанковскойГарантии)+" и не равна Сумме счета = "+СокрЛП(СчетИлиАвтоВКредит_));	
												//Сообщить("ОШИБКА! По кредитной сделке неправильная ""Сумма банковской гарантии"".",СтатусСообщения.ОченьВажное);
												//Предупреждение("ОШИБКА!  По кредитной сделке неправильная ""Сумма банковской гарантии"".");	
												Отказ = Истина;
												Возврат;
											КонецЕсли;
											//Бондаренко-- 20251226
											
										КонецЕсли; 	
									КонецЕсли; 	
								//Бондаренко 20260320 ++
								//КонецЕсли;
								//Бондаренко 20260320 --								
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		//КонецЕсли;
	КонецЕсли;
 	
	//Бондаренко++ 20251023
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда Возврат; КонецЕсли;
	//Бондаренко-- 20251023
	
	//Бондаренко++ 20260320
 	Если ЭтотОбъект.СуммаДокумента <> ЭтотОбъект.Сумма Тогда
		ЭтотОбъект.СуммаДокумента = ЭтотОбъект.Сумма;
 	КонецЕсли;
 	//Бондаренко-- 20260320 
	
	//Иванченко 20260508 ++
	//ОтгрузкаАвтомобиля(РежимПроведения);
	//Иванченко 20260508 --
	
	//Результат = Истина;
	//ДополнительныеСвойства.Вставить("СкладКомпанииБыл");
	//ДополнительныеСвойства.Вставить("ЗаказБыл");
	//ДополнительныеСвойства.Вставить("МоментВремениБыл");
	//
	//Если НЕ ФлагПерерасчет Тогда
	//	Результат = дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	//КонецЕсли;
	//ФлагПерерасчет = Ложь;
	//Если НЕ Результат Тогда Возврат; КонецЕсли; 
	//
	//// получим старые значения, влияющие на границы последовательности
	//Если НЕ Отказ И Проведен И РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
	//	
	//	БылиДвижения = Ложь;
	//	Запрос = Новый Запрос();
	//	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	//	
	//	// партии
	//	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ СкладКомпании ИЗ РегистрНакопления.ПартииТоваровКомпании ГДЕ Регистратор=&Ссылка";
	//	Результат = Запрос.Выполнить();
	//	Если НЕ Результат.Пустой() Тогда
	//		БылиДвижения = Истина;
	//		ДополнительныеСвойства.Вставить("СкладКомпанииБыл", Результат.Выгрузить().ВыгрузитьКолонку("СкладКомпании"));
	//	КонецЕсли;
	//	
	//	// Заказы
	//	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ Заказ  ИЗ РегистрНакопления.ЗаказыПокупателей ГДЕ Регистратор = &Ссылка";
	//	Результат = Запрос.Выполнить();
	//	Если НЕ Результат.Пустой() Тогда
	//		БылиДвижения = Истина;
	//		ДополнительныеСвойства.Вставить("ЗаказБыл", Результат.Выгрузить().ВыгрузитьКолонку("Заказ"));
	//	КонецЕсли;
	//	
	//	// прошлый момент времени
	//	Если БылиДвижения Тогда
	//		Запрос.Текст = "ВЫБРАТЬ МоментВремени ИЗ Документ."+Метаданные().Имя+" ГДЕ Ссылка=&Ссылка";
	//		ДополнительныеСвойства.Вставить("МоментВремениБыл",Запрос.Выполнить().Выгрузить().Получить(0).МоментВремени);
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	//// +++++ Соколмоторс +++++
	//Если ЭтоНовый() И НЕ Отказ Тогда
	//	НомерДляЖурнала = РегистрыСведений.НумерацияСкладскихДокументов.УстановитьНовыйНомер(ТекущаяДата());
	//КонецЕсли;
	//// ----- Соколмоторс -----
	
	//СуммаДокумента = Состав.Количество();
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриЗаписи()

Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	//Иванченко 20260121 ++
	//Бондаренко++ 20251219
	// Если РольДоступна("СМ_Разработчик1С") ИЛИ РольДоступна("ПолныеПрава") ИЛИ РольДоступна("СМ_АудиторСервиса") Тогда
	////Если РольДоступна("СМ_АудиторСервиса") Тогда
	// 	//Этим можно
	//Иначе
	//	Если НЕ обПраво("ПравоНаИнтерактивноеРаспроведениеОтгрузкиБезРеализации") Тогда
	//		Попытка
	//			СМГ_Сообщить("ОШИБКА! Вместо отмены проведения текущего документа введите на его основании новый отменяющий документ 'Отгрузка автомобиля без реализации'.",СтатусСообщения.Важное); 
	//		Исключение
	//			//			
	//		КонецПопытки;
	//		Отказ=Истина;
	//		Возврат;
	//	КонецЕсли;
	// КонецЕсли; 
	//Бондаренко-- 20251219
	Если РольДоступна("СМ_Разработчик1С") ИЛИ РольДоступна("ПолныеПрава") ИЛИ РольДоступна("СМ_АудиторСервиса") ИЛИ РольДоступна("СМ_РуководительОтделаЛогистики") Тогда
		//Этим можно
	Иначе
		
		//Иванченко 20260217 ++
		//Если НЕ обПраво("ПравоНаИнтерактивноеРаспроведениеОтгрузкиБезРеализации") Тогда
		Если НЕ обПраво("ПравоНаИнтерактивноеРаспроведениеОтгрузкиБезРеализации") И НЕ ПараметрыСеанса.Пользователь.Сотрудник.Должность = Справочники.Должности.ЛогистОтделаПродажАвтомобилей Тогда 
		//Иванченко 20260217 --			
			
			Попытка
				СМГ_Сообщить("ОШИБКА! Вместо отмены проведения текущего документа введите на его основании новый отменяющий документ 'Отгрузка автомобиля без реализации' и выберите в нем операцию 'Отмена отгрузки автомобиля без реализации'.",СтатусСообщения.Важное); 
			Исключение
			КонецПопытки; 
			
			Отказ=Истина;
			
			Возврат; 
			
		КонецЕсли;  
		
	КонецЕсли; 
	//Иванченко 20260121 --
	
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	Если НЕ Отказ Тогда
		тКэшСуммСписания = Неопределено;
		СуммаДокумента = 0;
	КонецЕсли;	
КонецПроцедуры // ОбработкаУдаленияПроведения()

Функция ПолучитьТаблицуТоваров()
	
	ТекстЗапроса="ВЫБРАТЬ
	|	СписаниеТоваровТовары.Номенклатура КАК Номенклатура,
	|	СписаниеТоваровТовары.Количество * СписаниеТоваровТовары.Коэффициент КАК Количество
	|ИЗ
	|	Документ.СписаниеТМЦ.Товары КАК СписаниеТоваровТовары
	|ГДЕ
	|	СписаниеТоваровТовары.Ссылка = &Ссылка";
	
	Запрос=Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст=ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьТаблицуОстатковПартий(Сотрудник,ДилерскийЦентр,СЗ_Товаров)
	
	//ТекстЗапроса="ВЫБРАТЬ
	//             |	ТМЦПереданныеСотрудникамОстатки.Сотрудник КАК Сотрудник,
	//             |	ТМЦПереданныеСотрудникамОстатки.ДилерскийЦентр КАК ДилерскийЦентр,
	//             |	ТМЦПереданныеСотрудникамОстатки.Номенклатура КАК Номенклатура,
	//             |	ТМЦПереданныеСотрудникамОстатки.ПартияТМЦ КАК ПартияТМЦ,
	//             |	ТМЦПереданныеСотрудникамОстатки.КоличествоОстаток КАК КоличествоОстаток,
	//             |	ТМЦПереданныеСотрудникамОстатки.СуммаОстаток КАК СуммаОстаток
	//             |ИЗ
	//             |	РегистрНакопления.ТМЦПереданныеСотрудникам.Остатки(
	//             |			&МоментВремени,
	//             |			Сотрудник = &ВыбСотрудник
	//             |				И ДилерскийЦентр = &ВыбДилерскийЦентр
	//             |				И Номенклатура В (&ВыбСписокНоменклатура)) КАК ТМЦПереданныеСотрудникамОстатки";
	
	//Запрос=Новый Запрос();
	//Запрос.УстановитьПараметр("МоментВремени",?(обЗначениеНеЗаполнено(Ссылка.Дата),ТекущаяДата(),Ссылка.Дата));
	//Запрос.УстановитьПараметр("ВыбСотрудник",Сотрудник);
	//Запрос.УстановитьПараметр("ВыбДилерскийЦентр",ДилерскийЦентр);
	//Запрос.УстановитьПараметр("ВыбСписокНоменклатура",СЗ_Товаров);
	//Запрос.Текст=ТекстЗапроса;
	
	//Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПечатьОтчетОРаботеПрограммиста(ТабДокумент) Экспорт
	
	//ТабДокумент = Новый ТабличныйДокумент;
	Макет = Документы.ОтчетОРаботеПрограммиста.ПолучитьМакет("ОтчетОРаботеПрограммиста");
	// Заголовок
	Область = Макет.ПолучитьОбласть("Заголовок");
	ТабДокумент.Вывести(Область);
	// Шапка
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.Заполнить(ЭтотОбъект);
	ТабДокумент.Вывести(Шапка);
	// Состав
	Область = Макет.ПолучитьОбласть("СоставШапка");
	ТабДокумент.Вывести(Область);
	ОбластьСостав = Макет.ПолучитьОбласть("Состав");
	//Для Каждого ТекСтрокаСостав Из Состав Цикл
	//	ОбластьСостав.Параметры.Заполнить(ТекСтрокаСостав);
	//	ТабДокумент.Вывести(ОбластьСостав);
	//КонецЦикла;
	// Подвал
	Подвал = Макет.ПолучитьОбласть("Подвал");
	Подвал.Параметры.Заполнить(ЭтотОбъект);
	ТабДокумент.Вывести(Подвал);
	
	//ТабДок.ОтображатьСетку = Ложь;
	//ТабДок.Защита = Ложь;
	//ТабДок.ТолькоПросмотр = Ложь;
	//ТабДок.ОтображатьЗаголовки = Ложь;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатьДоверенность(ТабДокумент) Экспорт
	
	Доверенность = спПолучитьПодтверждающийДокументОбъектаПоВиду(Ссылка.Водитель,Перечисления.ВидыДокументов.Доверенность);
	Паспорт      = спПолучитьПодтверждающийДокументОбъектаПоВиду(Ссылка.Водитель,Перечисления.ВидыДокументов.Паспорт);
	Город = киПолучитьГород(Ссылка.ПодразделениеКомпании,Справочники.ВидыКонтактнойИнформации.АдресФактический);
	
	Если обЗначениеНеЗаполнено(Доверенность) Тогда
		Сообщить("ОШИБКА! Отсутствует действующая доверенность. Процедура печати прервана.",СтатусСообщения.ОченьВажное);
		Возврат ТабДокумент;
	КонецЕсли; 
	
	Если обЗначениеНеЗаполнено(Паспорт) Тогда
		Сообщить("ОШИБКА! Отсутствует действующий паспорт. Процедура печати прервана.",СтатусСообщения.ОченьВажное);
		Возврат ТабДокумент;
	КонецЕсли; 
	
	Макет = ПолучитьМакет("Доверенность");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	
	СтруктураСведений = РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("Организация,Объект",Ссылка.Подразделение.Организация,Перечисления.ВидыОбъектовСведений.Руководитель));
	Руководитель = СтруктураСведений.Значение;
	
	ОбластьМакета.Параметры.ОрганизацияГенеральныйДиректор = Руководитель;
	ОбластьМакета.Параметры.ПодразделениеАдресФактический = киПолучитьПредставлениеКИ(Ссылка.ПодразделениеКомпании, Справочники.ВидыКонтактнойИнформации.АдресФактический);
	ОбластьМакета.Параметры.ПодразделениеАдресЮридический = киПолучитьПредставлениеКИ(Ссылка.ПодразделениеКомпании, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	ОбластьМакета.Параметры.ДанныеПаспорта = " серия"+СокрЛП(Паспорт.Серия)+" №"+СокрЛП(Паспорт.Номер)+", выдан "+СокрЛП(Паспорт.КемВыдан)+" "+Формат(Паспорт.ДатаВыдачи,"ДЛФ=DD");
	
	ОбластьМакета.Параметры.ФИО = Ссылка.Наименование;
	//ОбластьМакета.Параметры.Должность =  Ссылка.Должность.Наименование;
	//ОбластьМакета.Параметры.Подразделение = Ссылка.Подразделение.Наименование;
	
	Если обЗначениеНеЗаполнено(Ссылка.ПодразделениеКомпании.Организация.НаименованиеДляПечати) Тогда
		ОбластьМакета.Параметры.Организация = Ссылка.ПодразделениеКомпании.Организация.Наименование;
	Иначе
		ОбластьМакета.Параметры.Организация = Ссылка.ПодразделениеКомпании.Организация.НаименованиеДляПечати;
	КонецЕсли; 
	
	ОбластьМакета.Параметры.ДатаПечати = Формат(ТекущаяДата(),"ДЛФ=DD");
	ОбластьМакета.Параметры.ДатаОкончания = Формат(Доверенность.ДатаОкончания,"ДЛФ=DD");
	
	Табдокумент.Вывести(ОбластьМакета);
	
	Табдокумент.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
	Табдокумент.АвтоМасштаб = Истина;
	Табдокумент.ОтображатьСетку=Ложь;
	
	Возврат Табдокумент;
	
КонецФункции //ПечатьДоверенность(ТабДокумент) Экспорт

//Бондаренко++ 20250628
Функция ПроверитьНаличиеАвтомобиляНаСкладе(Автомобиль, СкладКомпании)
	
	Рез_ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиАвтомобилейОстатки.Автомобиль
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(
	|			&Период,
	|			СкладКомпании = &Склад
	|				И Автомобиль = &Автомобиль) КАК ОстаткиАвтомобилейОстатки";
	Запрос.УстановитьПараметр("Склад", СкладКомпании);
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("Период", Дата);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		//СМГ_Сообщить("Выбранного автомобиля нет на складе!!!");
		Рез_ = Истина;
	КонецЕсли;
	
	Возврат Рез_;
	
КонецФункции
//Бондаренко-- 20250628

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

//Бондаренко++ 20260402
ДеньЭрЭл = обПраво("ДатаНачалаРаботыСКомпенсациями");
//Бондаренко-- 20260402

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
	//Права = глПрава;
#КонецЕсли
ФлагПерерасчет = Ложь;
ВедетсяБалансПоПодразделению=(Константы.СпособВеденияБаланса.Получить()=Перечисления.СпособВеденияБаланса.ПоПодразделению);
