&НаКлиенте
Процедура НазваниеСайтаНажатие(Элемент)
	ПереходНаСайт();
КонецПроцедуры

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	ПереходНаСайт();
КонецПроцедуры

&НаКлиенте
Процедура ПереходНаСайт()
	Значения = ЭтаФорма.ВладелецФормы.Объект;
	Если Значения.Конфигурация = "УправлениеТорговлей 11.0" ИЛИ
			 Значения.Конфигурация = "УправлениеТорговлей 11.1.2" ИЛИ
			 Значения.Конфигурация = "УправлениеТорговлей 11.1.4" ИЛИ
			 Значения.Конфигурация = "РозницаМагазинАвтозапчастей 2.1" Тогда
		ЗапуститьПриложение("http:\\www.nirax.ru?from=tecdoc_ut11");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НажатиеОк(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.ЗакрыватьПриЗакрытииВладельца=Истина;
	Значения = ЭтаФорма.ВладелецФормы.Объект;
	Элементы.Название.Заголовок = "Ниракс: Помощник автобизнеса " + Значения.Лицензия + " " + Значения.Версия; // + Символы.ПС + "для конфигурации """ + Значения.ПредставлениеКонфигурации + """";
КонецПроцедуры
