
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ОпределениеДЦВЗН = Справочники.Renault_ОбщиеНастройкиБазыДанных.ЭтаБаза.ОпределениеДЦВЗН;
	
	Если ОпределениеДЦВЗН = 0 Тогда
		СтрокаДляЗамены = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДЦПодразделения.Ссылка КАК ДилерскийЦентр,
		|	ДЦПодразделения.Подразделение КАК ПодразделениеЦех
		|ПОМЕСТИТЬ ПодразделенияЦеха
		|ИЗ Справочник.CRM_ДилерскиеЦентры.ПодразделенияОрганизации КАК ДЦПодразделения
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(Работы.Ссылка КАК Документ.ЗаказНаряд) КАК СсылкаЗН,
		|	ПодразделенияЦеха.ДилерскийЦентр КАК ДилерскийЦентр
		|ПОМЕСТИТЬ ВсеЗНСРаботами
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК Работы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПодразделенияЦеха КАК ПодразделенияЦеха
		|		ПО Работы.Ссылка.ПодразделениеКомпании = ПодразделенияЦеха.ПодразделениеЦех
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_СоответствияВидовРемонта КАК Renault_СоответствияВидовРемонта
		|		ПО Renault_СоответствияВидовРемонта.ВидРемонта = Работы.Ссылка.ВидРемонта
		|		И (Renault_СоответствияВидовРемонта.КлассификацияRenault = ЗНАЧЕНИЕ(Перечисление.Renault_КлассификацияВидовРемонта.КузовнойРемонт)
		|			ИЛИ Renault_СоответствияВидовРемонта.КлассификацияRenault = ЗНАЧЕНИЕ(Перечисление.Renault_КлассификацияВидовРемонта.ГарантияКузовнойЦех))
		|ГДЕ
		|	Работы.Ссылка.ДатаЗакрытия >= &ДатаНачала
		|	И Работы.Ссылка.ДатаЗакрытия < &ДатаОкончания
		|	И Renault_СоответствияВидовРемонта.ВидРемонта ЕСТЬ NULL 
		|	И ПодразделенияЦеха.ДилерскийЦентр.ПометкаУдаления = ЛОЖЬ";
	Иначе
		СтрокаДляЗамены = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДЦПодразделения.Ссылка КАК ДилерскийЦентр,
		|	ВЫБОР КОГДА ДЦПодразделения.Цех.Родитель = ЗНАЧЕНИЕ(Справочник.Цеха.ПустаяСсылка) ТОГДА
		|		ДЦПодразделения.Цех
		|	ИНАЧЕ
		|		ДЦПодразделения.Цех.Родитель
		|	КОНЕЦ КАК ПодразделениеЦех
		|ПОМЕСТИТЬ ПодразделенияЦеха
		|ИЗ Справочник.CRM_ДилерскиеЦентры.АвтосервисЦеха КАК ДЦПодразделения
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(Работы.Ссылка КАК Документ.ЗаказНаряд) КАК СсылкаЗН,
		|	ПодразделенияЦеха.ДилерскийЦентр КАК ДилерскийЦентр
		|ПОМЕСТИТЬ ВсеЗНСРаботами
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК Работы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПодразделенияЦеха КАК ПодразделенияЦеха
		|		ПО Работы.Ссылка.Цех = ПодразделенияЦеха.ПодразделениеЦех
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_СоответствияВидовРемонта КАК Renault_СоответствияВидовРемонта
		|		ПО Renault_СоответствияВидовРемонта.ВидРемонта = Работы.Ссылка.ВидРемонта
		|		И (Renault_СоответствияВидовРемонта.КлассификацияRenault = ЗНАЧЕНИЕ(Перечисление.Renault_КлассификацияВидовРемонта.КузовнойРемонт)
		|			ИЛИ Renault_СоответствияВидовРемонта.КлассификацияRenault = ЗНАЧЕНИЕ(Перечисление.Renault_КлассификацияВидовРемонта.ГарантияКузовнойЦех))
		|ГДЕ
		|	Работы.Ссылка.ДатаЗакрытия >= &ДатаНачала
		|	И Работы.Ссылка.ДатаЗакрытия < &ДатаОкончания
		|	И Renault_СоответствияВидовРемонта.ВидРемонта ЕСТЬ NULL 
		|	И ПодразделенияЦеха.ДилерскийЦентр.ПометкаУдаления = ЛОЖЬ";
	КонецЕсли;
	
	СтрокаПоиска = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(Работы.Ссылка КАК Документ.ЗаказНаряд) КАК СсылкаЗН,
	|	ДЦ.Ссылка КАК ДилерскийЦентр
	|ПОМЕСТИТЬ ВсеЗНСРаботами
	|ИЗ
	|	Документ.ЗаказНаряд.Работы КАК Работы
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_ДилерскиеЦентры КАК ДЦ
	|	ПО ЛОЖЬ
	|ГДЕ
	|	Работы.Ссылка.ДатаЗакрытия >= &ДатаНачала
	|	И Работы.Ссылка.ДатаЗакрытия < &ДатаОкончания
	|	И ДЦ.Ссылка.ПометкаУдаления = ЛОЖЬ";
	
	СхемаКомпоновкиДанных.НаборыДанных.НаборДанных2.Запрос = СтрЗаменить(СхемаКомпоновкиДанных.НаборыДанных.НаборДанных2.Запрос, СтрокаПоиска, СтрокаДляЗамены);
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ВерсияАА");
	Параметр.Использование = Истина;
	Параметр.Значение = Метаданные.Версия;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.КПП = &КПП
	|	И Контрагенты.ИНН = &ИНН";
	Запрос.УстановитьПараметр("ИНН", "7709259743");
	Запрос.УстановитьПараметр("КПП", "997150001");
	Выб = Запрос.Выполнить().Выбрать();
	Выб.Следующий();
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонтрагентРено");
	Параметр.Использование = Истина;
	Параметр.Значение = Выб.Ссылка;
	
	СтандартнаяОбработка = Ложь;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	ВнешийНабор = Новый Структура("Планшет", _ПолучитьТаблицуИспользованияПланшета(Настройки));
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,ВнешийНабор);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры

Функция _ПолучитьТаблицуИспользованияПланшета(Настройки)
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("FullName");
	Таблица.Колонки.Добавить("TabletAll");
	Таблица.Колонки.Добавить("TabletWithResult");
	Таблица.Колонки.Добавить("ДилерскийЦентрПланшет");
	
	ДатаНачала = НачалоГода(ТекущаяДата());
	ДатаОкончания = КонецГода(ТекущаяДата());
	
	ПараметрПериод = Настройки.ПараметрыДанных.Элементы.Найти("Период");
	Если ПараметрПериод <> Неопределено и ПараметрПериод.Использование = Истина Тогда
		ДатаНачала = НачалоДня(ПараметрПериод.Значение.ДатаНачала);
		ДатаОкончания = КонецДня(ПараметрПериод.Значение.ДатаОкончания);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	ДЦ.Ссылка
	|ИЗ
	|	Справочник.CRM_ДилерскиеЦентры КАК ДЦ
	|ГДЕ
	|	ПометкаУдаления = Ложь
	//|	И НеПоказыватьВОтчетах = Ложь
	//|	И Закрыт = ЛОЖЬ
	|	И
	|	ИСТИНА";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Дилер = Выборка.Ссылка;
		
		Если Дилер.Автосервис_ИспользуетсяПланшет = Истина И НЕ Дилер.Автосервис_ИспользуетсяПланшет_v2 Тогда
			ИДДилера = Строка(Дилер.УникальныйИдентификатор());
			ТаблицаОтвет = Renault_АвтосервисСервер.ПолучитьИспользованиеПланшета_New(ИДДилера, ДатаНачала, ДатаОкончания);
			//ТаблицаОтвет = ПолучитьИспользованиеПланшета1(ИДДилера, ДатаНачала, ДатаОкончания);
			Для каждого Стр из ТаблицаОтвет Цикл
				НовСтр = Таблица.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр,Стр);
				НовСтр.ДилерскийЦентрПланшет = Дилер.Наименование;
			КонецЦикла;
		КонецЕсли;
		
		Если Дилер.Автосервис_ИспользуетсяПланшет_v2 = Истина Тогда
			//ИДДилера = Строка(Дилер.УникальныйИдентификатор());
			//ТаблицаОтвет = Renault_АвтосервисСерверСинхрСПланшетом.ПолучитьИспользованиеПланшета_New(ИДДилера, ДатаНачала, ДатаОкончания);
			////ТаблицаОтвет = ПолучитьИспользованиеПланшета2(ИДДилера, ДатаНачала, ДатаОкончания);
			//Для каждого Стр из ТаблицаОтвет Цикл
			//	НовСтр = Таблица.Добавить();
			//	ЗаполнитьЗначенияСвойств(НовСтр,Стр);
			//	НовСтр.ДилерскийЦентрПланшет = Дилер.Наименование;
			//КонецЦикла;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Renault_CRM_ПриемкаАвтомобиля.Машиноместо КАК FullName,
			|	СУММА(ВЫБОР
			|			КОГДА Renault_CRM_ЗаявкаНаСервис.ОбновленСПланшета
			|				ТОГДА 1
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК TabletWithResult,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Renault_CRM_ЗаявкаНаСервис.Ссылка) КАК TabletALL
			|ИЗ
			|	Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ОбращениеВАвтоСервис КАК Renault_CRM_ОбращениеВАвтоСервис
			|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ПриемкаАвтомобиля КАК Renault_CRM_ПриемкаАвтомобиля
			|			ПО (Renault_CRM_ПриемкаАвтомобиля.Обращение = Renault_CRM_ОбращениеВАвтоСервис.Ссылка)
			|		ПО Renault_CRM_ЗаявкаНаСервис.Обращение = Renault_CRM_ОбращениеВАвтоСервис.Ссылка
			|ГДЕ
			|	Renault_CRM_ЗаявкаНаСервис.Дата МЕЖДУ &Дата1 И &Дата2
			|	И НЕ Renault_CRM_ЗаявкаНаСервис.ПометкаУдаления
			|	И НЕ Renault_CRM_ПриемкаАвтомобиля.Ссылка ЕСТЬ NULL
			|	И Renault_CRM_ЗаявкаНаСервис.ДилерскийЦентр = &ДилерскийЦентр
			|
			|СГРУППИРОВАТЬ ПО
			|	Renault_CRM_ПриемкаАвтомобиля.Машиноместо";
			
			Запрос.УстановитьПараметр("Дата1", ДатаНачала);
			Запрос.УстановитьПараметр("Дата2", ДатаОкончания);
			Запрос.УстановитьПараметр("ДилерскийЦентр", Дилер);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				НовСтр = Таблица.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр,Выборка);
				НовСтр.ДилерскийЦентрПланшет = Дилер.Наименование;
			КонецЦикла;
			
		КонецЕсли;
		
		
	КонецЦикла;
	
	Таблица.Свернуть("ДилерскийЦентрПланшет", "TabletAll, TabletWithResult");
	
	Возврат Таблица;
	
КонецФункции

