
Перем мЖирныйШрифт;

//Перем мТекущийПользователь;

Перем мТаблицаДополнительныхДанныхПоСостояниюАвтомобилей;
Перем мСоответсвиеКолонокТаблицыДанныхПоСостояниюАвтомобилейТипамЗначений;

//Перем мОтображатьДополнительнуюИнформацию;
Перем мОтображатьПанельФильтров;
Перем ЦветЗеленый, ЦветОранжевый, ЦветСиний, ЦветКрасный, ЦветЖелтый, ЦветСветлоКрасный, ЦветФонаКнопки;
Перем ЦветДляСебя;
Перем МассивСкладовДилера Экспорт;
Перем ЕстьПравоПросмотраЦенЗакупки, ЕстьПравоУправленияВыкупом, ИспользуетсяУчетАвтосклад;
Перем ЕстьПравоКорпПродажи;
Перем МассивДопКолонок;
Перем ПредыдущаяВыделеннаяСтрока;
Перем ПредыдущаяВыделеннаяСтрокаПодержанныхАвто; //DMS

Перем мСтруктураОтбораАвтосклад;
Перем ФормаДлительнойОперации;
Перем ПараметрыОбработчика;
//Перем РезультатПолученияДопИнформации;
//Перем ТекущиеПараметрыВыбора;

Перем ЕстьПравоНаИспользованиеПриоритетовПродаж;
Перем общТаблицаУсловияПредоставленияАкцийПроизводителя;
Перем ОпубликованныеVIN;
Перем ЕстьПравоСразуРезервироватьАвтомобиль;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Клиент") = Истина тогда	
		Объект.Клиент = Параметры.Клиент;
		м_Клиент = Объект.Клиент;
	Если ЗначениеЗаполнено(м_Клиент) тогда
		Элементы.СтранициКлиент.ТекущаяСтраница = Элементы.ЗаполненКлиент;
	Иначе
		Элементы.СтранициКлиент.ТекущаяСтраница = Элементы.НеЗаполненКлиент;
	КонецЕсли;
	
	КонецЕсли;
	
	Если Параметры.Свойство("НомерРабочегоЛиста") = Истина тогда	
		Объект.НомерРабочегоЛиста = Параметры.НомерРабочегоЛиста;
		
	КонецЕсли;
	
	мТекущийМенеджер = ПараметрыСеанса.Пользователь.Сотрудник;
	мТекущийПользователь = ПараметрыСеанса.Пользователь;
	
	мСтруктураОтбораАвтосклад = Renault_РаботаСПравамиПользователя.ПолучитьСтруктуруНастроекАвтосклад(ПараметрыСеанса.Пользователь);
	
	ДилерскийЦентрПользователя = Renault_РаботаСПравамиПользователя.ДилерскийЦентрПоУмолчанию(ПараметрыСеанса.Пользователь);
	
	ЕстьПравоСразуРезервироватьАвтомобиль = ПараметрыСеанса.Renault_ПраваПользователя.РезервироватьАвтомобильБезСогласования;
	ЕстьПравоАдминистрированияАвтосклад = Renault_РаботаСПравамиПользователя.ЕстьПравоАдминистрированияАрмАвтосклад(ПараметрыСеанса.Пользователь);
	
	BIR_Distri = СокрЛП(ДилерскийЦентрПользователя.BIR_Distri);
	
	МассивСкладовДилера = ДилерскийЦентрПользователя.СкладыДилера.ВыгрузитьКолонку("Склад");
	мДатаНеПоказыватьВыданныеАвтомобили = ДилерскийЦентрПользователя.ДатаНеПоказыватьВыданныеАвтомобили;
	ПоказыватьДоговоры = Истина;
	
	мСтруктураОтбораАвтосклад.Вставить("ТипЦен",ДилерскийЦентрПользователя.ТипЦенПродажи);	
	МаксимальноеКоличествоДнейРезерва = Renault_РаботаСПравамиПользователя.МаксимальноеКоличествоДнейРезерва(ПараметрыСеанса.Пользователь);

	VINАвтомобиля ="";
	РежимПодтверждения = Ложь;
	ДатаНеПоказыватьВыданныеАвтомобили = Неопределено;
	
	ВерсияАвтомобиля = "";
	МодельАвтомобиля = "";
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата",		 				ТекущаяДата());
	Список.Параметры.УстановитьЗначениеПараметра("VIN", 				 				VINАвтомобиля);
	Список.Параметры.УстановитьЗначениеПараметра("МассивСкладовДилера", 				МассивСкладовДилера);
	Список.Параметры.УстановитьЗначениеПараметра("ТекущийСотрудник", 					ПараметрыСеанса.Пользователь.Сотрудник);
	Список.Параметры.УстановитьЗначениеПараметра("РежимПодтверждения", 				РежимПодтверждения);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНеПоказыватьВыданныеАвтомобили", ?(ДатаНеПоказыватьВыданныеАвтомобили = Неопределено,Дата('00010101'),ДатаНеПоказыватьВыданныеАвтомобили));
	Список.Параметры.УстановитьЗначениеПараметра("УчитыватьРеализацииКакВыдачи", 		Не Справочники.Renault_ОбщиеНастройкиБазыДанных.ЭтаБаза.Автосклад_НеУчитыватьРеализацииКакВыдачи);
	
	Подержанные.Параметры.УстановитьЗначениеПараметра("ТекущаяДата",		 				ТекущаяДата());
	Подержанные.Параметры.УстановитьЗначениеПараметра("VIN", 				 				VINАвтомобиля);
	Подержанные.Параметры.УстановитьЗначениеПараметра("МассивСкладовДилера", 				МассивСкладовДилера);
	Подержанные.Параметры.УстановитьЗначениеПараметра("ТекущийСотрудник", 					ПараметрыСеанса.Пользователь.Сотрудник);
	Подержанные.Параметры.УстановитьЗначениеПараметра("ПоказыватьЗарезервированные", 	  ПоказыватьЗарезервированные);
	Подержанные.Параметры.УстановитьЗначениеПараметра("ДоговорНаАвансСсылка", Документы.Renault_Договор.ПустаяСсылка());
	
	ДемоПодмен.Параметры.УстановитьЗначениеПараметра("VIN", 				 				VINАвтомобиля);
	//ДемоПодмен.Параметры.УстановитьЗначениеПараметра("СрокЭксплуатацииИстек", 				СрокЭксплуатацииИстек);
	ДемоПодмен.Параметры.УстановитьЗначениеПараметра("ПустаяДата", 				'00010101');
	//ДемоПодмен.Параметры.УстановитьЗначениеПараметра("ТекущаяДата",		 				ТекущаяДата());
	
	Заявки.Параметры.УстановитьЗначениеПараметра("VIN", 				 				VINАвтомобиля);
	
	ТипПрисоединенияИзНоменклатурыИРабот = Ложь;
	Если ЗначениеЗаполнено(ПараметрыСеанса.Renault_ПраваПользователя.ДилерскийЦентр) Тогда
		Если ПараметрыСеанса.Renault_ПраваПользователя.ДилерскийЦентр.ТипПривязкиДоповКАвтомобилям = Перечисления.Renault_ТипыУчетаДополнительногоОборудования.ИзНоменклатурыИРабот Тогда
			ТипПрисоединенияИзНоменклатурыИРабот = Истина;
		КонецЕсли;
	КонецЕсли;
	Список.Параметры.УстановитьЗначениеПараметра("ТипПрисоединенияИзНоменклатурыИРабот",ТипПрисоединенияИзНоменклатурыИРабот);	
	
	СтруктураОтбора = ?(СтруктураОтбора = Неопределено, ПолучитьСтруктуруНастроекАвтосклад(), СтруктураОтбора);
	Для Каждого Эл Из СтруктураОтбора Цикл
		Список.Параметры.УстановитьЗначениеПараметра(Эл.Ключ, Эл.Значение);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(МодельАвтомобиля) Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Модель", МодельАвтомобиля);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Модель", Справочники.Модели.ПустаяСсылка());
	КонецЕсли;
	
	// начало добавление Зеленчук
	ВерсияАвтомобиляМассив = ТипЗнч(ВерсияАвтомобиля) = Тип("Массив");
	// окончание добавление Зеленчук
	
	Если ТипЗнч(ВерсияАвтомобиля) = Тип("Массив") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Версия", ВерсияАвтомобиля);
	Иначе
		Если
			ЗначениеЗаполнено(ВерсияАвтомобиля) Тогда
			Список.Параметры.УстановитьЗначениеПараметра("Версия", ВерсияАвтомобиля);
		Иначе
			Список.Параметры.УстановитьЗначениеПараметра("Версия", Справочники.ВариантыКомплектации.ПустаяСсылка());
		КонецЕсли;
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("Цвет", Справочники.Цвета.ПустаяСсылка());
	Список.Параметры.УстановитьЗначениеПараметра("ДоговорНаАвансСсылка", Документы.Renault_Договор.ПустаяСсылка());
	
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьЗарезервированные", 	  ПоказыватьЗарезервированные);
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьЗакрепленныеЗаКлиентом", ПоказыватьЗакрепленныеЗаКлиентом);
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьВыданныеАвтомобили", 	  ПоказыватьВыданныеАвтомобили);
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьНеДляПродажи", 		  ПоказыватьНеДляПродажи);
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьДоговоры", 			  ПоказыватьДоговоры);
	Если Не ПравоЦен(мТекущийПользователь) тогда
		
		//Видимость себестоимости
		Элементы.СписокЦенаЗакупкиБаза.Видимость = Ложь;
		Элементы.СписокЦенаЗакупкиОпции.Видимость = Ложь;
		Элементы.СписокЦенаЗакупкиСкидка.Видимость = Ложь;
		Элементы.СписокРасшифровкаСкидкиДилера.Видимость = Ложь;
		Элементы.СписокЦенаЗакупкиАвтомобиля.Видимость = Ложь;
		Элементы.СписокСебестоимостьПоТН.Видимость = Ложь;
		
	КонецЕсли;
	
	//ОпцийДилера
	
	НастройкиБазы = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	
	Если НастройкиБазы.ИспользоватьТиповойУчетДО = ложь Тогда
		
		ТаблицаОпцийДилера.ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Renault_УстановленноеОборудованиеАвтомобилейОстатки.Автомобиль,
		|	Renault_УстановленноеОборудованиеАвтомобилейОстатки.Оборудование КАК Опция,
		|	Renault_УстановленноеОборудованиеАвтомобилейОстатки.СтоимостьОстаток КАК Сумма,
		|	Renault_УстановленноеОборудованиеАвтомобилейОстатки.СебестоимостьОстаток,
		|	Renault_УстановленноеОборудованиеАвтомобилейОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.Renault_УстановленноеОборудованиеАвтомобилей.Остатки(, Автомобиль = &Автомобиль) КАК Renault_УстановленноеОборудованиеАвтомобилейОстатки";
		ТаблицаОпцийДилера.ОсновнаяТаблица = "РегистрНакопления.Renault_УстановленноеОборудованиеАвтомобилей.Остатки";
		
		
		ЗаявкиЗаказНарядыПоКомплектации.ТекстЗапроса = 
			"ВЫБРАТЬ Разрешенные
			|	Renault_CRM_ЗаявкаНаСервис.Ссылка,
			|	Renault_CRM_ОбращениеВАвтоСервис.ВидОбращения КАК ВидРемонта
			|ИЗ
			|	Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ОбращениеВАвтоСервис КАК Renault_CRM_ОбращениеВАвтоСервис
			|		ПО Renault_CRM_ЗаявкаНаСервис.Обращение = Renault_CRM_ОбращениеВАвтоСервис.Ссылка
			|	ГДЕ
			|	Renault_CRM_ЗаявкаНаСервис.Автомобиль = &Автомобиль 
			|	И Renault_CRM_ЗаявкаНаСервис.Обращение.ВидОбращения.Докомплектация";
		ЗаявкиЗаказНарядыПоКомплектации.ОсновнаяТаблица = "Документ.Renault_CRM_ЗаявкаНаСервис"; 
		
		ЗаявкиЗаказНарядыПоКомплектации1.ТекстЗапроса = 
			"ВЫБРАТЬ Разрешенные
			|	Renault_CRM_ЗаявкаНаСервис.Ссылка,
			|	Renault_CRM_ОбращениеВАвтоСервис.ВидОбращения КАК ВидРемонта
			|ИЗ
			|	Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ОбращениеВАвтоСервис КАК Renault_CRM_ОбращениеВАвтоСервис
			|		ПО Renault_CRM_ЗаявкаНаСервис.Обращение = Renault_CRM_ОбращениеВАвтоСервис.Ссылка
			|	ГДЕ
			|	Renault_CRM_ЗаявкаНаСервис.Автомобиль = &Автомобиль"; 
			
		ЗаявкиЗаказНарядыПоКомплектации1.ОсновнаяТаблица = "Документ.Renault_CRM_ЗаявкаНаСервис"; 
		
	КонецЕсли;
	
	СформироватьПеремещение();
	ЗаполнитьТекущиеМаршруты();
	
	УстановитьВидимость();
	
КонецПроцедуры

Процедура УстановитьВидимость()
	
	Если ЕстьПравоАдминистрированияАвтосклад Тогда
		Элементы.ТаблицаРезервовАвтомобилей.КоманднаяПанель.Доступность = Истина;
		Элементы.ФормаНеДляПродажи.Доступность = Истина; //Сергеев В.Н. DMSREN-1116
	Иначе //нет права администрирования		
		Элементы.ТаблицаРезервовАвтомобилей.КоманднаяПанель.Доступность = Ложь;
		Элементы.дс_КомментарийРуководителя.ТолькоПросмотр = Истина;
		Элементы.ФормаНеДляПродажи.Доступность = Ложь; //Сергеев В.Н. DMSREN-1116
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруНастроекАвтосклад(Пользователь=Неопределено) Экспорт
	
	Ответ = Новый Структура;
	Ответ.Вставить("ИспользоватьОтборПоДилерскимЦентрам", Ложь);
	Ответ.Вставить("ИспользоватьОтборПоСчетам", Ложь);
	Ответ.Вставить("ИспользоватьОтборПоСкладам", Ложь);
	Ответ.Вставить("ДоступныеДилерскиеЦентры", Неопределено);
	Ответ.Вставить("ДоступныеСчета", Неопределено);
	Ответ.Вставить("ДоступныеСклады", Неопределено);
	Ответ.Вставить("ТипЦен", Справочники.ТипыЦен.ПустаяСсылка());
	Если Пользователь=Неопределено Тогда Возврат Ответ КонецЕсли;
	
	Запрос=Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки КАК ПраваИНастройки
	|ИЗ
	|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|ГДЕ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ответ.Вставить("ИспользоватьОтборПоДилерскимЦентрам", Выборка.ПраваИНастройки.Автосклад_ИспользоватьОтборПоДилерскимЦентрам);
		Ответ.Вставить("ИспользоватьОтборПоСчетам", Выборка.ПраваИНастройки.Автосклад_ИспользоватьОтборПоСчетам);
		Ответ.Вставить("ИспользоватьОтборПоСкладам", Выборка.ПраваИНастройки.Автосклад_ИспользоватьОтборПоСкладам);
		Ответ.Вставить("ДоступныеДилерскиеЦентры", Выборка.ПраваИНастройки.Автосклад_ДоступныеДилерскиеЦентры.ВыгрузитьКолонку("ДилерскийЦентр"));
		Ответ.Вставить("ДоступныеСчета", Выборка.ПраваИНастройки.Автосклад_ДоступныеСчета.ВыгрузитьКолонку("Счет"));
		Ответ.Вставить("ДоступныеСклады", Выборка.ПраваИНастройки.Автосклад_ДоступныеСклады.ВыгрузитьКолонку("Склад"));
		Ответ.Вставить("ТипЦен", Выборка.ПраваИНастройки.ДилерскийЦентр.ТипЦенПродажи);
	КонецЕсли;
	Возврат Ответ;
	
КонецФункции

&НаКлиенте
Процедура КолонкиСебестоимости(Команда)
	
	Если Элементы.СписокЦенаЗакупкиБаза.Видимость = Истина тогда
		
		Элементы.СписокЦенаЗакупкиБаза.Видимость = Ложь;
		Элементы.СписокЦенаЗакупкиОпции.Видимость = Ложь;
		Элементы.СписокЦенаЗакупкиСкидка.Видимость = Ложь;
		Элементы.СписокРасшифровкаСкидкиДилера.Видимость = Ложь;
		Элементы.СписокЦенаЗакупкиАвтомобиля.Видимость = Ложь;
		Элементы.СписокСебестоимостьПоТН.Видимость = Ложь;
				
	Иначе
		
		Элементы.СписокЦенаЗакупкиБаза.Видимость = Истина;
		Элементы.СписокЦенаЗакупкиОпции.Видимость = Истина;
		Элементы.СписокЦенаЗакупкиСкидка.Видимость = Истина;
		Элементы.СписокРасшифровкаСкидкиДилера.Видимость = Истина;
		Элементы.СписокЦенаЗакупкиАвтомобиля.Видимость = Истина;
		Элементы.СписокСебестоимостьПоТН.Видимость = Истина;
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныПриИзменении(Элемент)
	
	Элементы.СписокЦенаПродажиБаза.Видимость = Цены;
	Элементы.СписокЦенаПродажиБазаБезСкидки.Видимость = Цены;
	Элементы.СписокЦенаПродажиБазаСкидка.Видимость = Цены;
	Элементы.СписокЦенаПродажиБазаТариф.Видимость = Цены;
	Элементы.СписокЦенаПродажиОпции.Видимость = Цены;
	Элементы.СписокЦенаПродажиДопОборудования.Видимость = Цены;
	Элементы.СписокЦенаПродажиАвтомобиля.Видимость = Цены;
	Элементы.СписокЦенаЗакупкиБаза.Видимость = Цены;
	Элементы.СписокЦенаЗакупкиОпции.Видимость = Цены;
	Элементы.СписокЦенаЗакупкиСкидка.Видимость = Цены;
	Элементы.СписокЦенаЗакупкиАвтомобиля.Видимость = Цены;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокПриАктивизацииСтрокиНаСервере_БезКонтекста(Вин,Автомобиль,СоставОпций,Версия,ГодВыпуска,ДилерскийЦентрПользователя,БУ = Неопределено,ЗаявкаНаТрейдИнСсылка = Неопределено,Клиент = Неопределено )
	
	Структура = новый Структура;
	//клиент
	Если ЗначениеЗаполнено(Клиент) тогда
		дс_ТелефонКлиента = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(Клиент);
		дс_ТелефонКлиента = СтрЗаменить(дс_ТелефонКлиента, "(", "");
		дс_ТелефонКлиента = СтрЗаменить(дс_ТелефонКлиента, ")", "");
		дс_ТелефонКлиента = СтрЗаменить(дс_ТелефонКлиента, "-", "");
		дс_ТелефонКлиента = СтрЗаменить(дс_ТелефонКлиента, " ", "");
		дс_EmailКлиента = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(Клиент);
		Структура.Вставить("дс_ТелефонКлиента",дс_ТелефонКлиента);
		Структура.Вставить("дс_EmailКлиента",дс_EmailКлиента);
	иначе
		Структура.Вставить("дс_ТелефонКлиента","");
		Структура.Вставить("дс_EmailКлиента","");
		
	КонецЕсли;
	
	//Опции
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Renault_ТарифНаКомплектацииАвтомобилей.Тариф.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.Renault_ТарифНаКомплектацииАвтомобилей КАК Renault_ТарифНаКомплектацииАвтомобилей
	|ГДЕ
	|	Renault_ТарифНаКомплектацииАвтомобилей.ВариантКомплектации = &ВариантКомплектации
	|	И Renault_ТарифНаКомплектацииАвтомобилей.Тариф.Активен = ИСТИНА
	|	И Renault_ТарифНаКомплектацииАвтомобилей.Тариф.НачалоДействия <= &ТекущаяДата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Renault_ТарифНаКомплектацииАвтомобилей.Период УБЫВ";
	Запрос.УстановитьПараметр("ВариантКомплектации", Версия);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Тариф =  Выборка.Ссылка;
	Иначе
		Тариф = Справочники.Renault_ТарифыНаАвтомобили.ПустаяСсылка();
	КонецЕсли;
	
	Тариф = Справочники.Renault_ТарифыНаАвтомобили.ПолучитьТарифДляРасчетаЦены(ГодВыпуска);
	
	Структура.Вставить("Тариф",Тариф);
	
	//ПТС
	
	ЗаписьСостояниеАвтомобилейПроизводителя = РегистрыСведений.CRM_СостояниеАвтомобилейПроизводителя_v2.СоздатьМенеджерЗаписи();
	ЗаписьСостояниеАвтомобилейПроизводителя.VIN = ВИН;
	ЗаписьСостояниеАвтомобилейПроизводителя.Прочитать();
	
	Структура.Вставить("дс_ПТС_Номер",ЗаписьСостояниеАвтомобилейПроизводителя.PTS_SERIE + " " + ЗаписьСостояниеАвтомобилейПроизводителя.PTS_NUM);
	Структура.Вставить("дс_ПТС_Дата", ЗаписьСостояниеАвтомобилейПроизводителя.DATE_PTS); //DMSREN-1202
	Структура.Вставить("дс_ПТС_Модель",ЗаписьСостояниеАвтомобилейПроизводителя.ModelTS);
	Структура.Вставить("дс_ПТС_ТипТС", ЗаписьСостояниеАвтомобилейПроизводителя.TypeTS);
	Структура.Вставить("дс_ПТС_КатегорияТС",ЗаписьСостояниеАвтомобилейПроизводителя.CategTS);
	Структура.Вставить("дс_ПТС_Год",ЗаписьСостояниеАвтомобилейПроизводителя.YEAR);
	Структура.Вставить("дс_ПТС_НомерДвигателя",ЗаписьСостояниеАвтомобилейПроизводителя.ENGINE_NUM);
	Структура.Вставить("дс_ПТС_НомерШасси",ЗаписьСостояниеАвтомобилейПроизводителя.Shassi);
	Структура.Вставить("дс_ПТС_НомерКузова",ЗаписьСостояниеАвтомобилейПроизводителя.Kuzov);
	Структура.Вставить("дс_ПТС_ЦветКузова",ЗаписьСостояниеАвтомобилейПроизводителя.COLOR_PTS);
	Структура.Вставить("дс_ПТС_РазрМаксМасса", ЗаписьСостояниеАвтомобилейПроизводителя.MaxMass);
	Структура.Вставить("дс_ПТС_МассаБезНагрузки", ЗаписьСостояниеАвтомобилейПроизводителя.MinMass);
	Структура.Вставить("дс_ПТС_МощностьДвигателя", ЗаписьСостояниеАвтомобилейПроизводителя.PowerLS);
	Структура.Вставить("дс_ПТС_ОбъемДвигателя", ЗаписьСостояниеАвтомобилейПроизводителя.VolumeEngine);
	Структура.Вставить("дс_ПТС_ТипДвигателя", ЗаписьСостояниеАвтомобилейПроизводителя.TypeEngine);
	Структура.Вставить("дс_ПТС_ЭкКлассДвигателя", ЗаписьСостояниеАвтомобилейПроизводителя.EcoClass);
	Структура.Вставить("дс_ПТС_Изготовитель", ЗаписьСостояниеАвтомобилейПроизводителя.NaimProiz);
	Структура.Вставить("дс_ПТС_ОдобрениеТипаТС", ЗаписьСостояниеАвтомобилейПроизводителя.APPROV_STRING);
	Структура.Вставить("дс_ПТС_Оттенок", ЗаписьСостояниеАвтомобилейПроизводителя.EPTS_TONE_NAME); 
	Структура.Вставить("дс_ПТС_ГТД",ЗаписьСостояниеАвтомобилейПроизводителя.GTD);
	Структура.Вставить("дс_ПТС_ОТТС_с",ЗаписьСостояниеАвтомобилейПроизводителя.EOTSDSTART);
	Структура.Вставить("дс_ПТС_ОТТС_По",ЗаписьСостояниеАвтомобилейПроизводителя.EOTSDEND);
	
	//Транспортировка
	//Данные берем напрямую из регистра, чтобы не хранить их в таблице
	
	Структура.Вставить("дс_ПланДатаОтгрузки",ЗаписьСостояниеАвтомобилейПроизводителя.DATE_PLAN);
	Структура.Вставить("дс_ФактДатаОтгрузки",ЗаписьСостояниеАвтомобилейПроизводителя.DATE_FACT);
	Структура.Вставить("дс_Субтранспортер",ЗаписьСостояниеАвтомобилейПроизводителя.ADR_SUBTRANSPORTER);
	Структура.Вставить("дс_ТранспортнаяКомпания", ЗаписьСостояниеАвтомобилейПроизводителя.ADR_TRANSPORTER);
	Структура.Вставить("дс_НазначениеДоставки",ЗаписьСостояниеАвтомобилейПроизводителя.DEALER_NAME_FULL);
	Структура.Вставить("дс_Автовоз", ЗаписьСостояниеАвтомобилейПроизводителя.ID_CAMION);
	Структура.Вставить("дс_ВодительАвтовоза", ЗаписьСостояниеАвтомобилейПроизводителя.DRIVER_NAME);
	Структура.Вставить("дс_ГородНазначения", ЗаписьСостояниеАвтомобилейПроизводителя.RECEIVER_VILLE);
	Структура.Вставить("дс_АдресМестаНазначения",ЗаписьСостояниеАвтомобилейПроизводителя.ADR_RECEIVER);
	
	//Бухгалтерия
	//Данные берем напрямую из регистра, чтобы не хранить их в таблице
	
	Структура.Вставить("дс_СерияНомерГТД",ЗаписьСостояниеАвтомобилейПроизводителя.SerNomGTD);
	Структура.Вставить("дс_ДатаГТД",ЗаписьСостояниеАвтомобилейПроизводителя.DATE_GTD);
	Структура.Вставить("дс_ТаможенныеОграничения",ЗаписьСостояниеАвтомобилейПроизводителя.TamogOgr);
	Структура.Вставить("дс_Проформа", ЗаписьСостояниеАвтомобилейПроизводителя.NUM_PROFORM_REP);
	Структура.Вставить("дс_ТипФактурирования",ЗаписьСостояниеАвтомобилейПроизводителя.FACTURE_TYPE_RU);
	Структура.Вставить("дс_НомерСчетФактуры",ЗаписьСостояниеАвтомобилейПроизводителя.NUM_SF_REP);
	Структура.Вставить("дс_НомерТН",ЗаписьСостояниеАвтомобилейПроизводителя.NUM_FACTURE_REP);
	Структура.Вставить("дс_НомерТТН",ЗаписьСостояниеАвтомобилейПроизводителя.NUM_TTN);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыполнениеСервисныхКампаний.VIN,
	|	ВыполнениеСервисныхКампаний.СервиснаяКампания,
	|	Renault_СкрытыеАвтомобилиСОТО.ПричинаСкрытия
	|ПОМЕСТИТЬ ВСЕОТС
	|ИЗ
	|	РегистрСведений.ВыполнениеСервисныхКампаний КАК ВыполнениеСервисныхКампаний
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_СкрытыеАвтомобилиСОТО КАК Renault_СкрытыеАвтомобилиСОТО
	|		ПО ВыполнениеСервисныхКампаний.VIN = Renault_СкрытыеАвтомобилиСОТО.VIN
	|			И ВыполнениеСервисныхКампаний.СервиснаяКампания = Renault_СкрытыеАвтомобилиСОТО.СервиснаяКампания
	|ГДЕ
	|	ВыполнениеСервисныхКампаний.СервиснаяКампания <> ЗНАЧЕНИЕ(Справочник.СервисныеКампании.ПустаяСсылка)
	|	И ВыполнениеСервисныхКампаний.ДатаВыполнения = ДАТАВРЕМЯ(1, 1, 1)
	|	И Renault_СкрытыеАвтомобилиСОТО.ПричинаСкрытия ЕСТЬ NULL
	|	И  ВыполнениеСервисныхКампаний.VIN = &VIN
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Автомобили.Ссылка,
	|	ВСЕОТС.VIN,
	|	ВСЕОТС.СервиснаяКампания
	|ПОМЕСТИТЬ АвтомобилиСОТС
	|ИЗ
	|	Справочник.Автомобили КАК Автомобили
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВСЕОТС КАК ВСЕОТС
	|		ПО Автомобили.VIN = ВСЕОТС.VIN
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВСЕОТС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АвтомобилиСОТС.Ссылка,
	|	АвтомобилиСОТС.VIN,
	|	АвтомобилиСОТС.СервиснаяКампания,
	|	АвтомобилиСрезПоследних.Значение КАК Клиент
	|ИЗ
	|	АвтомобилиСОТС КАК АвтомобилиСОТС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	|		ПО АвтомобилиСОТС.Ссылка = АвтомобилиСрезПоследних.Автомобиль.Ссылка
	|			И (АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Хозяин))";
	Запрос.УстановитьПараметр("ТолькоНовые", Истина);
	Запрос.УстановитьПараметр("Клиентские", Истина);
	Запрос.УстановитьПараметр("VIN", Вин);
	
	Выборка = Запрос.Выполнить().Выбрать();
	СписокОтзывныхНот = "";
	Пока Выборка.Следующий() Цикл
		
		СписокОтзывныхНот = СписокОтзывныхНот + 
		СокрЛП(Строка(Выборка.СервиснаяКампания.Код)) + " - " + Строка(Выборка.СервиснаяКампания) + Символы.ПС;
		
	КонецЦикла;
	
	Структура.Вставить("СписокОтзывныхНот",СписокОтзывныхНот);
	
	Возврат Структура;
	
КонецФункции

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
 	Запись = Элементы.Список.ТекущиеДанные;
	Если мОтображатьДополнительнуюИнформацию  и Запись <> неопределено тогда
		
		дс_Автомобиль = Элементы.Список.ТекущаяСтрока;
		дс_ТипАвтомобиля = Запись.ТипАвтомобиля;
		
		//Оплаты и пр.
		дс_ДополнительныеЗатратыПоАвто = Запись.ДополнительныеЗатратыПоАвто;
		
		дс_Вин = Запись.VIN;
		
		дс_Модель = Запись.МодельНаименованиеПолное;
		дс_Версия = Запись.ВерсияНаименованиеПолное;
		дс_Цвет = Запись.ЦветНаименование;
		Дс_СоставОпций = Запись.СоставОпций;
		
		дс_КодМодели = Запись.МодельАртикул;
		дс_КодВерсии = Запись.ВерсияАртикул;
		дс_КодЦвета = Запись.ЦветАртикул;
		
		Если Запись.ГодВыпуска = 0 Тогда
			дс_ГодВыпуска = "";
		Иначе
			дс_ГодВыпуска = СтрЗаменить(Строка(Запись.ГодВыпуска), Символ(160), "");
			дс_ГодВыпуска = дс_ГодВыпуска + " г.в.";
		КонецЕсли;
		дс_НаименованиеАвтомобиля = дс_Модель + " " + дс_Версия + " " + дс_Цвет + " " + дс_ГодВыпуска;
		
		дс_Комментарий = Запись.Примечание;
		дс_КомментарийРуководителя = Запись.ПримечаниеРОП;
		
		дс_ОплатаАФМСогласована = Запись.ОплатаАФМСогласована;
		дс_ДатаОплатыАФМ = Запись.ПлановаяДатаОплатыАФМ;
		дс_ОплатаАФМОплачено = Запись.АвтоОплаченАФМ;
		//ВазСистем Тарасов 26.02.2021 9:46:04 Инцидент #DMSREN-1043
		//{
		//Старый код:
		//Новый код:
		дс_ДатаОплатыАФМФакт = Запись.ФактическаяДатаВыкупа;
		//}
		дс_ПричинаВыкупа = Запись.ПричинаВыкупа;
		
		дс_ОплатаКлиентАвансВнесен = Запись.КлиентВнесАванс;
		дс_ОплатаКлиентПолностьюОплачено = Запись.КлиентПолностьюОплатилАвто;
		дс_ПлановаяДатаПолнойОплатыКлиентом = Запись.ПлановаяДатаПолнойОплатыКлиентом;
		
		//Даты
		дс_ДатаДСАПланФакт = Запись.ДатаДСАПланФакт;
		дс_ДатаОтгрузки = ?(ЗначениеЗаполнено(Запись.ДатаОтгрузкиПланФакт), Запись.ДатаОтгрузкиПланФакт, Запись.ДатаОтгрузкиОбещ);
		дс_ДатаОтгрузкиПлановая = Запись.ДатаОтгрузкиПлановая;
		дс_ДатаОтгрузкиФактическая = Запись.ДатаОтгрузкиФактическая;
		дс_ДатаОтгрузкиЖелаемая = Запись.ДатаОтгрузкиЖелаемая;
		
		
		///Статусы
		ЗакрепленоЗаКлиентомПоДаннымАФМ = (Запись.ЗакрепленоЗаКлиентомВDistri = Истина);			
		ЗакрепленоЗаКлиентом = Запись.УтвержденРезерв ИЛИ Запись.ПодписанДоговорКП;		
		ЗакрепленоЗаМенеджером = Запись.УтвержденРезерв;
		ЗаявкаНаРезервМенеджера = Запись.ЗаявленРезерв;
		
		Если ЗакрепленоЗаКлиентом Тогда
			Элементы.Группа57.ТекущаяСтраница = Элементы.Группа58;
		ИначеЕсли ЗаявкаНаРезервМенеджера Тогда
			Элементы.Группа57.ТекущаяСтраница = Элементы.Группа59;
		ИначеЕсли ЗакрепленоЗаМенеджером Тогда
			Элементы.Группа57.ТекущаяСтраница = Элементы.Группа60;
		Иначе
			Элементы.Группа57.ТекущаяСтраница = Элементы.Группа61;
		КонецЕсли;
		
		Если Запись.СтатусАвтомобиля = перечисления.CRM_СтатусыАвтомобилей.ВПроизводстве тогда
			  Элементы.Группа64.ТекущаяСтраница = Элементы.Группа66;
		ИначеЕсли Запись.СтатусАвтомобиля = перечисления.CRM_СтатусыАвтомобилей.ВПути тогда
			   Элементы.Группа64.ТекущаяСтраница = Элементы.Группа67;

		ИначеЕсли Запись.СтатусАвтомобиля = перечисления.CRM_СтатусыАвтомобилей.ВПутиКДилеру тогда
			     Элементы.Группа64.ТекущаяСтраница = Элементы.Группа69;

		ИначеЕсли Запись.СтатусАвтомобиля = перечисления.CRM_СтатусыАвтомобилей.ВыданКлиенту тогда
			  Элементы.Группа64.ТекущаяСтраница = Элементы.Группа71;

		ИначеЕсли Запись.СтатусАвтомобиля = перечисления.CRM_СтатусыАвтомобилей.ДоставленДилеру тогда
			  Элементы.Группа64.ТекущаяСтраница = Элементы.Группа70;

		ИначеЕсли Запись.СтатусАвтомобиля = перечисления.CRM_СтатусыАвтомобилей.ЗаказВПроизводство тогда
			    Элементы.Группа64.ТекущаяСтраница = Элементы.Группа65;

		ИначеЕсли Запись.СтатусАвтомобиля = перечисления.CRM_СтатусыАвтомобилей.НаСкладеАФМ тогда
			   Элементы.Группа64.ТекущаяСтраница = Элементы.Группа68;
		КонецЕсли;
		
		// страница "Distri.net"	
		дс_НомерКлиентскойЗаявки = Запись.НомерЗаявкиDistri;
		дс_НомерОрдераSedre = Запись.НомерЗаказаDistri;
		дс_ПродажаВнесенаВSedre = Запись.ПродажаВнесенаВDistri;
		
		дс_ПричинаИзмененияКЗ = Запись.ПричинаИзмененияКЗ;
		дс_КомментарийИзмененияКЗ = Запись.КомментарийИзмененияКЗ;
		
		//Прочее
		дс_Блокировка = Запись.Блокировка;
		дс_Статус = Запись.СтатусАвтомобиля;
		
		//Обновим отображение на форме
		Если дс_Блокировка = Истина Тогда	
			Элементы.Группа55.ТекущаяСтраница = Элементы.Заблокирован;
		Иначе
			Элементы.Группа55.ТекущаяСтраница = Элементы.НЕЗаблокирован;
		КонецЕсли;
		
        //Автомобиль
		дс_КодРадио = Запись.КодРадио;
		
		Таблици = СписокПриАктивизацииСтрокиНаСервере_БезКонтекста(дс_Вин,дс_Автомобиль,дс_СоставОпций,Запись.Версия,Запись.ГодВыпуска,ДилерскийЦентрПользователя);
		ТаблицаОпций.Параметры.УстановитьЗначениеПараметра("Тариф", Таблици.Тариф);
		ТаблицаОпций.Параметры.УстановитьЗначениеПараметра("ВариантКомплектации",Запись.Версия);
		ТаблицаОпций.Параметры.УстановитьЗначениеПараметра("Модель", Запись.модель);		
		ТаблицаОпций.Параметры.УстановитьЗначениеПараметра("Vin", дс_Вин);	
		
		ТаблицаОпцийДилера.Параметры.УстановитьЗначениеПараметра("Автомобиль",дс_Автомобиль);
		
		ЗаявкиЗаказНарядыПоКомплектации.Параметры.УстановитьЗначениеПараметра("Автомобиль",дс_Автомобиль);
		
		ТаблицаРезервовАвтомобилей.Параметры.УстановитьЗначениеПараметра("VIN",дс_Вин);
		
		ТаблицаАкцийПроизводителя.Параметры.УстановитьЗначениеПараметра("БезОтбора",Ложь);
		ТаблицаАкцийПроизводителя.Параметры.УстановитьЗначениеПараметра("ДилерскийЦентр",ДилерскийЦентрПользователя); 
		ТаблицаАкцийПроизводителя.Параметры.УстановитьЗначениеПараметра("ВариантКомплектации",Запись.Версия);
		ТаблицаАкцийПроизводителя.Параметры.УстановитьЗначениеПараметра("Модель",Запись.модель);
		ТаблицаАкцийПроизводителя.Параметры.УстановитьЗначениеПараметра("VIN",дс_Вин);
		ТаблицаАкцийПроизводителя.Параметры.УстановитьЗначениеПараметра("Год",Запись.ГодВыпуска);
		ТаблицаАкцийПроизводителя.Параметры.УстановитьЗначениеПараметра("ТекДата",ТекущаяДата());
		
		дс_ПТС_Номер = Таблици.дс_ПТС_Номер;
		дс_ПТС_Дата = Таблици.дс_ПТС_Дата;
		дс_ПТС_Модель = Таблици.дс_ПТС_Модель;
		дс_ПТС_ТипТС = Таблици.дс_ПТС_ТипТС;
		дс_ПТС_КатегорияТС = Таблици.дс_ПТС_КатегорияТС;
		дс_ПТС_Год = Таблици.дс_ПТС_Год;
		дс_ПТС_НомерДвигателя = Таблици.дс_ПТС_НомерДвигателя;
		дс_ПТС_НомерШасси = Таблици.дс_ПТС_НомерШасси;
		дс_ПТС_НомерКузова = Таблици.дс_ПТС_НомерКузова;
		дс_ПТС_ЦветКузова = Таблици.дс_ПТС_ЦветКузова;
		дс_ПТС_РазрМаксМасса = Таблици.дс_ПТС_РазрМаксМасса;
		дс_ПТС_МассаБезНагрузки = Таблици.дс_ПТС_МассаБезНагрузки;
		дс_ПТС_МощностьДвигателя = Таблици.дс_ПТС_МощностьДвигателя;
		дс_ПТС_ОбъемДвигателя = Таблици.дс_ПТС_ОбъемДвигателя;
		дс_ПТС_ТипДвигателя = Таблици.дс_ПТС_ТипДвигателя;
		дс_ПТС_ЭкКлассДвигателя = Таблици.дс_ПТС_ЭкКлассДвигателя;
		дс_ПТС_Изготовитель = Таблици.дс_ПТС_Изготовитель;
		дс_ПТС_ОдобрениеТипаТС = Таблици.дс_ПТС_ОдобрениеТипаТС;
		дс_ПТС_Оттенок = Таблици.дс_ПТС_Оттенок;
		дс_ПТС_ОТТС_с = Таблици.дс_ПТС_ОТТС_с;
		дс_ПТС_ОТТС_По = Таблици.дс_ПТС_ОТТС_По;
		
		//Транспортировка
		//Данные берем напрямую из регистра, чтобы не хранить их в таблице
		
		дс_ПланДатаОтгрузки = Таблици.дс_ПланДатаОтгрузки;
		дс_ФактДатаОтгрузки = Таблици.дс_ФактДатаОтгрузки;
		дс_Субтранспортер = Таблици.дс_Субтранспортер;
		дс_ТранспортнаяКомпания = Таблици.дс_ТранспортнаяКомпания;
		дс_НазначениеДоставки = Таблици.дс_НазначениеДоставки;
		дс_Автовоз = Таблици.дс_Автовоз;
		дс_ВодительАвтовоза = Таблици.дс_ВодительАвтовоза;
		дс_ГородНазначения = Таблици.дс_ГородНазначения;
		дс_АдресМестаНазначения = Таблици.дс_АдресМестаНазначения;
		
		//Бухгалтерия
		//Данные берем напрямую из регистра, чтобы не хранить их в таблице
		
		дс_СерияНомерГТД = Таблици.дс_СерияНомерГТД;
		дс_ПТС_ГТД = Таблици.дс_ПТС_ГТД; 
		дс_ДатаГТД = Таблици.дс_ДатаГТД;
		дс_ТаможенныеОграничения = Таблици.дс_ТаможенныеОграничения;
		дс_Проформа = Таблици.дс_Проформа;
		дс_ТипФактурирования = Таблици.дс_ТипФактурирования;
		дс_НомерСчетФактуры = Таблици.дс_НомерСчетФактуры;
		дс_НомерТН = Таблици.дс_НомерТН;
		дс_НомерТТН = Таблици.дс_НомерТТН;
		
		СписокОтзывныхНот  = Таблици.СписокОтзывныхНот;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьСтатусРезерваПоАвтомобилю(ДокументСсылка, СтатусРезерва)
	
	Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ДокОбъект = ДокументСсылка.ПолучитьОбъект();
	ДокОбъект.СтатусРезерва = СтатусРезерва;
	ДокОбъект.Контролер = ПараметрыСеанса.Пользователь;
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

//кор
Функция Автосклад_ПолучитьТаблицуПоСостояниюАвтомобилей(VINАвтомобиля = "", МассивСкладовДилера, BIR_Distri, ПоказыватьЗарезервированные, ПоказыватьЗакрепленныеЗаКлиентом, ПоказыватьВыданныеАвтомобили, ПоказыватьНеДляПродажи, МодельАвтомобиля = "", ВерсияАвтомобиля = "", ЦветАвтомобиля = "", ПоказыватьДоговоры = Истина, ДоговорНаАвансСсылка = Неопределено, ДатаНеПоказыватьВыданныеАвтомобили = Неопределено, РежимПодтверждения = Ложь, СтруктураОтбора = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИспользоватьТиповойДО = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ИспользоватьТиповойУчетДО;
	
	Renault_Лицензирование.ПроверитьНаличиеЛицензий();
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// начало добавление Зеленчук
	ВерсияАвтомобиляМассив = ТипЗнч(ВерсияАвтомобиля) = Тип("Массив");
	// окончание добавление Зеленчук
	
	Текст = "ВЫБРАТЬ
	        |	СостояниеАвтомобилей.Автомобиль КАК Автомобиль,
	        |	ВЫБОР
	        |		КОГДА СостояниеАвтомобилей.VIN = """"
	        |			ТОГДА ТаблицаАвтомобилей.VIN
	        |		ИНАЧЕ СостояниеАвтомобилей.VIN
	        |	КОНЕЦ КАК VIN,
	        |	ВЫБОР
	        |		КОГДА СостояниеАвтомобилей.Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
	        |			ТОГДА ТаблицаАвтомобилей.Автомобиль.Модель
	        |		ИНАЧЕ СостояниеАвтомобилей.Модель
	        |	КОНЕЦ КАК Модель,
	        |	ВЫБОР
	        |		КОГДА СостояниеАвтомобилей.Версия = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка)
	        |			ТОГДА ТаблицаАвтомобилей.Автомобиль.ВариантКомплектации
	        |		ИНАЧЕ СостояниеАвтомобилей.Версия
	        |	КОНЕЦ КАК Версия,
	        |	ВЫБОР
	        |		КОГДА СостояниеАвтомобилей.Цвет = ЗНАЧЕНИЕ(Справочник.Цвета.ПустаяСсылка)
	        |			ТОГДА ТаблицаАвтомобилей.Автомобиль.Цвет
	        |		ИНАЧЕ СостояниеАвтомобилей.Цвет
	        |	КОНЕЦ КАК Цвет,
	        |	СостояниеАвтомобилей.MODEL КАК МодельАртикул,
	        |	СостояниеАвтомобилей.VERSION КАК ВерсияАртикул,
	        |	СостояниеАвтомобилей.COLOR КАК ЦветАртикул,
	        |	ВЫБОР
	        |		КОГДА ТаблицаАвтомобилей.Автомобиль ЕСТЬ NULL
	        |			ТОГДА ""ТолькоАФМ""
	        |		ИНАЧЕ ""ДилерИАФМ""
	        |	КОНЕЦ КАК ТипПрисутствияВРегистрах,
	        |	ВЫБОР
	        |		КОГДА НЕ ТаблицаАвтомобилей.Автомобиль ЕСТЬ NULL
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ КАК НаОстаткахДилера,
	        |	СостояниеАвтомобилей.CLIENT_TYPE КАК АФМ_ТипКлиентаDistri,
	        |	ЕСТЬNULL(СостояниеАвтомобилей.Статус, ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыАвтомобилей.пустаяСсылка)) КАК АФМ_СтатусАвтомобиля,
	        |	СостояниеАвтомобилей.DATE_PAY КАК АФМ_ДатаОплатыДилеромФакт,
	        |	СостояниеАвтомобилей.OPTIONS КАК АФМ_СоставОпций,
	        |	СостояниеАвтомобилей.YEAR КАК АФМ_ГодВыпуска,
	        |	ВЫБОР
	        |		КОГДА СостояниеАвтомобилей.PTS_NUM = """"
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК АФМ_НаличиеПТС,
	        |	СостояниеАвтомобилей.БлокировкаАФМ КАК АФМ_Блокировка,
	        |	ВЫБОР
	        |		КОГДА СостояниеАвтомобилей.DATE_RECU <> ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА СостояниеАвтомобилей.DATE_RECU
	        |		КОГДА СостояниеАвтомобилей.DATE_MADC_RECU <> ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА СостояниеАвтомобилей.DATE_MADC_RECU
	        |		КОГДА СостояниеАвтомобилей.DATE_MADPREV <> ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА СостояниеАвтомобилей.DATE_MADPREV
	        |		ИНАЧЕ СостояниеАвтомобилей.DATE_MADENGA
	        |	КОНЕЦ КАК АФМ_ДатаДСА,
	        |	СостояниеАвтомобилей.DATE_FACT КАК АФМ_ДатаОтгрузкиПланФакт,
	        |	СостояниеАвтомобилей.DATE_PLAN КАК АФМ_ДатаОтгрузкиОбещ,
	        |	СостояниеАвтомобилей.DATE_MADC КАК АФМ_ДатаПроизводстваПланФакт,
	        |	СостояниеАвтомобилей.ЦветМеталлик КАК АФМ_ЦветМеталлик,
	        |	СостояниеАвтомобилей.CODE_RADIO КАК АФМ_КодРадио,
	        |	СостояниеАвтомобилей.ЦенаПродажиБаза КАК ЦенаПродажиБазаТариф,
	        |	СостояниеАвтомобилей.ЦенаПродажиОпции КАК ЦенаПродажиОпции,
	        |	ЕСТЬNULL(СтоимостьОборудованияДилера.СуммаДопОборудование, 0) КАК ЦенаПродажиДопОборудования,
	        |	СостояниеАвтомобилей.ЦенаПродажиАвтомобиля КАК ЦенаПродажиАвтомобиля,
	        |	СостояниеАвтомобилей.ЦенаЗакупкиБаза КАК ЦенаЗакупкиБаза,
	        |	СостояниеАвтомобилей.ЦенаЗакупкиОпции КАК ЦенаЗакупкиОпции,
	        |	СостояниеАвтомобилей.ЦенаЗакупкиАвтомобиля КАК ЦенаЗакупкиАвтомобиля,
	        |	СостояниеАвтомобилей.NUM_TTN КАК АФМ_НомерТТН,
	        |	ТаблицаАвтомобилей.Склад КАК СкладДилера,
			|	isnull(РазмещениеАвтомобилей.Место,0) КАК ПарковочноеМесто,
	        |	СостояниеАвтомобилей.ND_ED КАК АФМ_СчетчикНД,
	        |	СостояниеАвтомобилей.ND_DATE_ED КАК АФМ_ДатаОбновленияДанныхНД,
	        |	СостояниеАвтомобилей.ND_MED КАК АФМ_МаксимумСчетчикаНД,
	        |	СостояниеАвтомобилей.ND_VN_GROUP_NAME КАК АФМ_ГруппаНД,
	        |	СостояниеАвтомобилей.ND_IS_RZ КАК АФМ_ЗонаРискаНД,
	        |	ЕСТЬNULL(ТаблицаАвтомобилей.ПартияДата, &ТекущаяДата) КАК ДатаПартии,
	        |	СостояниеАвтомобилей.BIR КАК BIR,
	        |	ЛОЖЬ КАК ТолькоДоговорБезАвтомобиля,
	        |	ЗНАЧЕНИЕ(Документ.Renault_Договор.ПустаяСсылка) КАК ДоговорНаАвансСсылка,
	        |	СостояниеАвтомобилей.SedreNum КАК SedreNum,
	        |	СостояниеАвтомобилей.SKLAD КАК СкладАФМ,
	        |	СостояниеАвтомобилей.DEALER_PRICE_DISTIB КАК ЦенаЗакупкиДоставка,
	        |	СостояниеАвтомобилей.DEALER_PRICE_DISC КАК ЦенаЗакупкиСкидка,
	        |	СостояниеАвтомобилей.DATE_CONTROL_EXPIRAT КАК АФМ_КонтрольнаяДатаОплаты,
	        |	СостояниеАвтомобилей.DATE_EXPIRAT КАК АФМ_КритическаяДатаОплаты,
	        |	СостояниеАвтомобилей.SEDRE_ORDER КАК АФМ_НомерОрдераDistri,
	        |	СостояниеАвтомобилей.Автомобиль КАК Идентификатор,
	        |	СостояниеАвтомобилей.ТипАвтомобиля КАК АФМ_ТипАвтомобиля,
	        |	СостояниеАвтомобилей.НаименованияОпций КАК НаименованияОпций,
	        |	СостояниеАвтомобилей.NUM_FACTURE_REP КАК НомерТН,
	        |	СостояниеАвтомобилей.MATSEL КАК АФМ_КодОбивки,
	        |	СостояниеАвтомобилей.BLOCK_DESCRIPTION КАК АФМ_ОписаниеБлокировки,
	        |	СостояниеАвтомобилей.LastSyncDate КАК АФМ_ДатаАктуальностиСтроки,
	        |	СостояниеАвтомобилей.DISC_COMMENT КАК АФМ_РасшифровкаСкидкиДилера,
	        |	СостояниеАвтомобилей.TarifName КАК АФМ_ТарифОтгрузки,
	        |	СостояниеАвтомобилей.СебестоимостьПоТН КАК СебестоимостьПоТН,
	        |	СостояниеАвтомобилей.FACTURE_TYPE_RU КАК АФМ_ТипФактуры,
	        |	СостояниеАвтомобилей.Скрывать КАК Скрывать,
	        |	"""" КАК АрхивныйVIN,
	        |	СостояниеАвтомобилей.DATEOFSALE КАК DATEOFSALE,
	        |	СостояниеАвтомобилей.CLIENTTYPE КАК CLIENTTYPE,
	        |	СостояниеАвтомобилей.DATE_ARA КАК DATE_ARA,
	        |	СостояниеАвтомобилей.NAMECL1 КАК NAMECL1,
	        |	0 КАК РабочийЛист,
	        |	ЗНАЧЕНИЕ(Документ.Renault_Договор.ПустаяСсылка) КАК Договор,
	        |	"""" КАК ИдентификаторСтрокиДоговора,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(СостояниеАвтомобилей.CLIENT_TYPE, 0) = 0
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК ЗакрепленоЗаКлиентомВDistri,
	        |	ЗНАЧЕНИЕ(Документ.Renault_Договор.ПустаяСсылка) КАК ЗаказНаПроизводство,
	        |	СостояниеАвтомобилей.ТипАвтомобиля КАК ТипАвтомобиля,
	        |	СостояниеАвтомобилей.ACCESSORIES,
	        |	СостояниеАвтомобилей.PRICE_ACCESSORIES,
	        |	СостояниеАвтомобилей.DATE_ACCESSORIES_UNBLOCK,
			// начало 07.11.2017 Зеленчук
	        |	СостояниеАвтомобилей.RECEIVER_VILLE + "" "" + СостояниеАвтомобилей.ADR_RECEIVER КАК ПодтвержденныйАдресОтгрузки,
			// окончание 07.11.2017 Зеленчук
			|	СостояниеАвтомобилей.VAZNumOrder,
	        |	СостояниеАвтомобилей.E_PTS,
	        |	СостояниеАвтомобилей.УточненнаяДатаСборки,
	        |	СостояниеАвтомобилей.ДатаСварки,
	        |	СостояниеАвтомобилей.ДатаСходасКонвейера,
	        |	СостояниеАвтомобилей.ДатаПередачиВЦехОтгрузки,
			|	ВЫБОР
			|	когда естьnull(ВложенныйЗапрос.СрокДоставки,0)=0  Тогда
			|		ДатаВремя(1,1,1)
			|	КОГДА СостояниеАвтомобилей.DATE_FACT <> ДАТАВРЕМЯ(1, 1, 1)
			|		ТОГДА ДОБАВИТЬКДАТЕ(СостояниеАвтомобилей.DATE_FACT, ДЕНЬ, ЕСТЬNULL(ВложенныйЗапрос.СрокДоставки, 0))
			|	КОГДА СостояниеАвтомобилей.DATE_PLAN <> ДАТАВРЕМЯ(1, 1, 1)
			|		ТОГДА ДОБАВИТЬКДАТЕ(СостояниеАвтомобилей.DATE_PLAN, ДЕНЬ, ЕСТЬNULL(ВложенныйЗапрос.СрокДоставки, 0))
			|	КОГДА СостояниеАвтомобилей.AUTO_STATUS = ""На складе AFM""
			|			И СостояниеАвтомобилей.DATE_PLAN = ДАТАВРЕМЯ(1, 1, 1)
			|		ТОГДА ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, ЕСТЬNULL(ВложенныйЗапрос.СрокДоставки, 0) + 7)
			|	ИНАЧЕ ДОБАВИТЬКДАТЕ(СостояниеАвтомобилей.DATE_MADPREV, ДЕНЬ, ЕСТЬNULL(ВложенныйЗапрос.СрокДоставки, 0) + 7)
			|	КОНЕЦ КАК MADPrev,
	        |	СостояниеАвтомобилей.TENDER_NO,
	        |	СостояниеАвтомобилей.TENDER_CLIENT
	        |ПОМЕСТИТЬ ИнформацияПоАвтомобилям
	        |ИЗ
	        |	РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК СостояниеАвтомобилей
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_РазмещениеАвтомобилей КАК РазмещениеАвтомобилей
			|       ПО  СостояниеАвтомобилей.Автомобиль = РазмещениеАвтомобилей.Автомобиль";
			Если ИспользоватьТиповойДО Тогда
				Текст = Текст + "
			|ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|	КомплектацияАвтомобилейОстаткиИОбороты.Автомобиль КАК Автомобиль,
			|	СУММА(КомплектацияАвтомобилейОстаткиИОбороты.СуммаПродажиПриход) КАК СуммаДопОборудование
			|ИЗ
			|	РегистрНакопления.КомплектацияАвтомобилей.ОстаткиИОбороты(, , Регистратор) КАК КомплектацияАвтомобилейОстаткиИОбороты
			|ГДЕ
			|	КомплектацияАвтомобилейОстаткиИОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
			|
			|СГРУППИРОВАТЬ ПО
			|	КомплектацияАвтомобилейОстаткиИОбороты.Автомобиль) КАК СтоимостьОборудованияДилера
			|		ПО СостояниеАвтомобилей.Автомобиль = СтоимостьОборудованияДилера.Автомобиль";
			Иначе
				Текст = Текст + "
	        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |			Renault_УстановленноеОборудованиеАвтомобилейОстатки.Автомобиль КАК Автомобиль,
	        |			СУММА(Renault_УстановленноеОборудованиеАвтомобилейОстатки.СтоимостьОстаток) КАК СуммаДопОборудование
	        |		ИЗ
	        |			РегистрНакопления.Renault_УстановленноеОборудованиеАвтомобилей.Остатки(, ) КАК Renault_УстановленноеОборудованиеАвтомобилейОстатки
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			Renault_УстановленноеОборудованиеАвтомобилейОстатки.Автомобиль) КАК СтоимостьОборудованияДилера
	        |		ПО СостояниеАвтомобилей.Автомобиль = СтоимостьОборудованияДилера.Автомобиль
	        |			И (&ИспользоватьТиповойДО = ЛОЖЬ)";
			КонецЕсли;
			Текст = Текст + "
	        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |			ЗП.Автомобиль КАК Автомобиль,
	        |			ЗП.VIN КАК VIN,
	        |			ЗП.Склад КАК Склад,
	        |			ЗП.СкладНаименование КАК СкладНаименование,
	        |			ЗП.ПартияДата КАК ПартияДата,
	        |			СУММА(ЗП.Количества) КАК Количества,
	        |			СУММА(ЗП.Сумма) КАК Сумма
	        |		ИЗ
	        |			(ВЫБРАТЬ
	        |				ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль,
	        |				ОстаткиАвтомобилейОстатки.Автомобиль.VIN КАК VIN,
	        |				ОстаткиАвтомобилейОстатки.СкладКомпании КАК Склад,
	        |				ОстаткиАвтомобилейОстатки.КоличествоОстаток КАК Количества,
	        |				ОстаткиАвтомобилейОстатки.СуммаОстаток КАК Сумма,
	        |				ОстаткиАвтомобилейОстатки.СкладКомпании.Наименование КАК СкладНаименование,
	        |				ОстаткиАвтомобилейОстатки.Партия.Дата КАК ПартияДата
	        |			ИЗ
	        |				РегистрНакопления.ОстаткиАвтомобилей.Остатки(, ) КАК ОстаткиАвтомобилейОстатки
	        |			
	        |			ОБЪЕДИНИТЬ
	        |			
	        |			ВЫБРАТЬ
	        |				Renault_ОстаткиАвтомобилейДругихТочек.Автомобиль,
	        |				Renault_ОстаткиАвтомобилейДругихТочек.Автомобиль.VIN,
	        |				ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка),
	        |				0,
	        |				0,
	        |				Renault_ОстаткиАвтомобилейДругихТочек.Склад,
	        |				ДАТАВРЕМЯ(1, 1, 1)
	        |			ИЗ
	        |				РегистрСведений.Renault_ОстаткиАвтомобилейДругихТочек КАК Renault_ОстаткиАвтомобилейДругихТочек) КАК ЗП
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			ЗП.Автомобиль,
	        |			ЗП.VIN,
	        |			ЗП.Склад,
	        |			ЗП.СкладНаименование,
	        |			ЗП.ПартияДата) КАК ТаблицаАвтомобилей
	        |		ПО СостояниеАвтомобилей.Автомобиль = ТаблицаАвтомобилей.Автомобиль
	        |			И СостояниеАвтомобилей.VIN = ТаблицаАвтомобилей.VIN
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			DMS_АдресаРазгрузкиДилеров.BIR КАК BIR,
			|			DMS_АдресаРазгрузкиДилеров.idТочка КАК idТочка,
			|			DMS_АдресаРазгрузкиДилеров.SKLAD_CODE КАК SKLAD_CODE,
			|			МИНИМУМ(DMS_АдресаРазгрузкиДилеров.СрокДоставки) КАК СрокДоставки
			|		ИЗ
			|			РегистрСведений.DMS_АдресаРазгрузкиДилеров КАК DMS_АдресаРазгрузкиДилеров
			|
			|		СГРУППИРОВАТЬ ПО
			|			DMS_АдресаРазгрузкиДилеров.BIR,
			|			DMS_АдресаРазгрузкиДилеров.SKLAD_CODE,
			|			DMS_АдресаРазгрузкиДилеров.idТочка
			|
			|		ОБЪЕДИНИТЬ ВСЕ

			|		ВЫБРАТЬ
			|			DMS_АдресаРазгрузкиДилеров.BIR,
			|			0,
			|			DMS_АдресаРазгрузкиДилеров.SKLAD_CODE,
			|			DMS_АдресаРазгрузкиДилеров.СрокДоставки
			|		ИЗ
			|			РегистрСведений.DMS_АдресаРазгрузкиДилеров КАК DMS_АдресаРазгрузкиДилеров
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|					DMS_АдресаРазгрузкиДилеров.BIR КАК BIR,
			|					МИНИМУМ(DMS_АдресаРазгрузкиДилеров.idТочка) КАК idТочка,
			|					DMS_АдресаРазгрузкиДилеров.SKLAD_CODE КАК SKLAD_CODE
			|				ИЗ
			|					РегистрСведений.DMS_АдресаРазгрузкиДилеров КАК DMS_АдресаРазгрузкиДилеров
			|				
			|				СГРУППИРОВАТЬ ПО
			|					DMS_АдресаРазгрузкиДилеров.BIR,
			|					DMS_АдресаРазгрузкиДилеров.SKLAD_CODE) КАК ВложенныйЗапрос
			|				ПО DMS_АдресаРазгрузкиДилеров.BIR = ВложенныйЗапрос.BIR
			|					И DMS_АдресаРазгрузкиДилеров.idТочка = ВложенныйЗапрос.idТочка
			|					И DMS_АдресаРазгрузкиДилеров.SKLAD_CODE = ВложенныйЗапрос.SKLAD_CODE) КАК ВложенныйЗапрос
			|	ПО СостояниеАвтомобилей.BIR = ВложенныйЗапрос.BIR
			|	И СостояниеАвтомобилей.SKLAD = ВложенныйЗапрос.SKLAD_CODE
			|	И СостояниеАвтомобилей.ID_RECEIVER = ВложенныйЗапрос.idТочка
            |ГДЕ
	        |	(СостояниеАвтомобилей.Цвет = &Цвет
	        |			ИЛИ ТаблицаАвтомобилей.Автомобиль.Цвет = &Цвет
	        |			ИЛИ &Цвет = ЗНАЧЕНИЕ(Справочник.Цвета.ПустаяСсылка))
	        |	И СостояниеАвтомобилей.Скрывать = &РежимПодтверждения
	        |	И СостояниеАвтомобилей.Автомобиль <> ЗНАЧЕНИЕ(Справочник.автомобили.ПустаяСсылка)
	        |	И (СостояниеАвтомобилей.Модель = &Модель
	        |			ИЛИ ТаблицаАвтомобилей.Автомобиль.Цвет = &Модель
	        |			ИЛИ &Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка))"
			+ ?(ВерсияАвтомобиляМассив,
			"
			|	И (СостояниеАвтомобилей.Версия В (&Версия)
	        |			ИЛИ ТаблицаАвтомобилей.Автомобиль.ВариантКомплектации В (&Версия))"
			,			
	        "
			|	И (СостояниеАвтомобилей.Версия = &Версия
	        |			ИЛИ ТаблицаАвтомобилей.Автомобиль.ВариантКомплектации = &Версия
	        |			ИЛИ &Версия = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка))"
			)
			+
	        "
			|	И (СостояниеАвтомобилей.VIN = &VIN
	        |			ИЛИ ТаблицаАвтомобилей.Автомобиль.VIN = &VIN
	        |			ИЛИ &VIN = """")
	        |	И (ТаблицаАвтомобилей.Склад В (&МассивСкладовДилера)
	        |			ИЛИ ТаблицаАвтомобилей.Склад ЕСТЬ NULL)
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ЕСТЬNULL(Renault_ДоговорСоставДоговора.Автомобиль, ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка)),
	        |	"""",
	        |	Renault_ЗаказыВПроизводствоПодКлиентов.Модель,
	        |	Renault_ЗаказыВПроизводствоПодКлиентов.Версия,
	        |	Renault_ЗаказыВПроизводствоПодКлиентов.Цвет,
	        |	Renault_ЗаказыВПроизводствоПодКлиентов.Модель.Артикул,
	        |	Renault_ЗаказыВПроизводствоПодКлиентов.Версия.Артикул,
	        |	Renault_ЗаказыВПроизводствоПодКлиентов.Цвет.Артикул,
	        |	""ТолькоДилер"",
	        |	ЛОЖЬ,
	        |	0,
	        |	ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыАвтомобилей.пустаяСсылка),
	        |	ДАТАВРЕМЯ(1, 1, 1),
	        |	"""",
	        |	Renault_ЗаказыВПроизводствоПодКлиентов.ГодВыпуска,
	        |	ЛОЖЬ,
	        |	ЛОЖЬ,
	        |	ДАТАВРЕМЯ(1, 1, 1),
	        |	ДАТАВРЕМЯ(1, 1, 1),
	        |	ДАТАВРЕМЯ(1, 1, 1),
	        |	ДАТАВРЕМЯ(1, 1, 1),
	        |	ЛОЖЬ,
	        |	"""",
	        |	Renault_ЗаказыВПроизводствоПодКлиентов.СтоимостьБазовойКомплектации,
	        |	Renault_ЗаказыВПроизводствоПодКлиентов.СтоимостьДопОпций,
	        |	Renault_ЗаказыВПроизводствоПодКлиентов.СтоимостьОпцийДилера,
	        |	Renault_ЗаказыВПроизводствоПодКлиентов.Сумма,
	        |	0,
	        |	0,
	        |	0,
	        |	"""",
	        |	"""",
			|	0,
	        |	0,
	        |	ДАТАВРЕМЯ(1, 1, 1),
	        |	0,
	        |	"""",
	        |	ЛОЖЬ,
	        |	ДАТАВРЕМЯ(1, 1, 1),
	        |	"""",
	        |	ИСТИНА,
	        |	Renault_ЗаказыВПроизводствоПодКлиентов.Регистратор,
	        |	"""",
	        |	"""",
	        |	0,
	        |	0,
	        |	ДАТАВРЕМЯ(1, 1, 1),
	        |	ДАТАВРЕМЯ(1, 1, 1),
	        |	"""",
	        |	Renault_ЗаказыВПроизводствоПодКлиентов.Регистратор,
	        |	ЗНАЧЕНИЕ(Справочник.Renault_ТипыАвтомобилей.ПустаяСсылка),
	        |	"""",
	        |	"""",
	        |	"""",
	        |	"""",
	        |	ДАТАВРЕМЯ(1, 1, 1),
	        |	"""",
	        |	"""",
	        |	0,
	        |	"""",
	        |	ЛОЖЬ,
	        |	"""",
	        |	ДАТАВРЕМЯ(1, 1, 1),
	        |	0,
	        |	ДАТАВРЕМЯ(1, 1, 1),
	        |	"""",
	        |	Renault_ЗаказыВПроизводствоПодКлиентов.РабочийЛист,
	        |	Renault_ЗаказыВПроизводствоПодКлиентов.Регистратор,
	        |	Renault_ЗаказыВПроизводствоПодКлиентов.ИдентификаторСтрокиДоговора,
	        |	ЛОЖЬ,
	        |	Renault_ЗаказыВПроизводствоПодКлиентов.Регистратор,
	        |	ЗНАЧЕНИЕ(Справочник.Renault_ТипыАвтомобилей.ПустаяСсылка),
	        |	"""",
	        |	0,
	        |	ДАТАВРЕМЯ(1, 1, 1),
	        |	"""",
			|	"""",
	        |	ДАТАВРЕМЯ(1, 1, 1),
	        |	ДАТАВРЕМЯ(1, 1, 1),
	        |	ДАТАВРЕМЯ(1, 1, 1),
	        |	ДАТАВРЕМЯ(1, 1, 1),
	        |	ДАТАВРЕМЯ(1, 1, 1),
			|	ДАТАВРЕМЯ(1, 1, 1),
	        |	"""",
	        |	""""
	        |ИЗ
	        |	РегистрСведений.Renault_ЗаказыВПроизводствоПодКлиентов КАК Renault_ЗаказыВПроизводствоПодКлиентов
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_Договор.СоставДоговора КАК Renault_ДоговорСоставДоговора
	        |		ПО Renault_ЗаказыВПроизводствоПодКлиентов.Договор = Renault_ДоговорСоставДоговора.Ссылка
	        |			И Renault_ЗаказыВПроизводствоПодКлиентов.ИдентификаторСтрокиДоговора = Renault_ДоговорСоставДоговора.Идентификатор
	        |ГДЕ
	        |	(&ИспользоватьОтборПоДилерскимЦентрам
	        |				И Renault_ЗаказыВПроизводствоПодКлиентов.Договор.ДилерскийЦентр В (&ДоступныеДилерскиеЦентры)
	        |			ИЛИ НЕ &ИспользоватьОтборПоДилерскимЦентрам)
	        |	И (Renault_ЗаказыВПроизводствоПодКлиентов.Регистратор = &ДоговорНаАвансСсылка
	        |			ИЛИ &ДоговорНаАвансСсылка = ЗНАЧЕНИЕ(Документ.Renault_Договор.ПустаяСсылка))
	        |	И (Renault_ЗаказыВПроизводствоПодКлиентов.Модель = &Модель
	        |			ИЛИ &Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка))
	        |	И (Renault_ЗаказыВПроизводствоПодКлиентов.Цвет = &Цвет
	        |			ИЛИ &Цвет = ЗНАЧЕНИЕ(Справочник.Цвета.ПустаяСсылка))
	        |	И &ПоказыватьДоговоры
	        |	И НЕ &РежимПодтверждения"
			+ ?(ВерсияАвтомобиляМассив,
			"
			|	И (Renault_ЗаказыВПроизводствоПодКлиентов.Версия В (&Версия))"
			,			
	        "
			|	И (Renault_ЗаказыВПроизводствоПодКлиентов.Версия = &Версия
			|			ИЛИ &Версия = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка))"
			)
			+
			//|	И (Renault_ЗаказыВПроизводствоПодКлиентов.Версия = &Версия
			//|			ИЛИ &Версия = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка))
	        "
			|	И &VIN = """"
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	Автомобиль";
	ВыполнитьЗапрос_(Ложь,Текст,МенеджерВременныхТаблиц,
	VINАвтомобиля, МассивСкладовДилера, BIR_Distri, ПоказыватьЗарезервированные, ПоказыватьЗакрепленныеЗаКлиентом, ПоказыватьВыданныеАвтомобили, ПоказыватьНеДляПродажи, МодельАвтомобиля, ВерсияАвтомобиля, ЦветАвтомобиля, ПоказыватьДоговоры, ДоговорНаАвансСсылка, ДатаНеПоказыватьВыданныеАвтомобили, РежимПодтверждения, СтруктураОтбора);              
	
	
	Текст =      "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИнформацияПоАвтомобилям.Автомобиль КАК Автомобиль,
	|	ИнформацияПоАвтомобилям.VIN,
	|	ИнформацияПоАвтомобилям.АФМ_НомерОрдераDistri,
	|	ИнформацияПоАвтомобилям.Идентификатор,
	|	ИнформацияПоАвтомобилям.Договор,
	|	ИнформацияПоАвтомобилям.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ИнформацияПоАвтомобилям.ЦенаПродажиАвтомобиля КАК ЦенаПродажиАвтомобиля
	|ПОМЕСТИТЬ ДляОтбора
	|ИЗ
	|	ИнформацияПоАвтомобилям КАК ИнформацияПоАвтомобилям
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Автомобиль, ЗаказНаПроизводство, VIN, Идентификатор";
	ВыполнитьЗапрос_(Ложь,Текст,МенеджерВременныхТаблиц,
	VINАвтомобиля, МассивСкладовДилера, BIR_Distri, ПоказыватьЗарезервированные, ПоказыватьЗакрепленныеЗаКлиентом, ПоказыватьВыданныеАвтомобили, ПоказыватьНеДляПродажи, МодельАвтомобиля, ВерсияАвтомобиля, ЦветАвтомобиля, ПоказыватьДоговоры, ДоговорНаАвансСсылка, ДатаНеПоказыватьВыданныеАвтомобили, РежимПодтверждения, СтруктураОтбора);                            
	
	
	Текст =     "ВЫБРАТЬ
	|	ДляОтбора.Автомобиль КАК Автомобиль,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПродажиАвтомобилей.КоличествоОборот, 0) > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОформленаРеализация,
	|	ПродажиАвтомобилей.ДокументПродажи КАК Реализация,
	|	ПродажиАвтомобилей.ДокументПродажи.Дата КАК ДатаРеализации,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПродажиАвтомобилей.КоличествоОборот, 0) > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК УчтенУДилера,
	|	ПродажиАвтомобилей.СуммаОборот КАК ЦенаПродажи
	|ПОМЕСТИТЬ мУчетПродажОстатков
	|ИЗ
	|	ДляОтбора КАК ДляОтбора
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПродажиАвтомобилей.Обороты КАК ПродажиАвтомобилей
	|		ПО ДляОтбора.Автомобиль = ПродажиАвтомобилей.Автомобиль
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДляОтбора.Автомобиль,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Документ.РеализацияАвтомобилей.ПустаяССылка),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОстаткиАвтомобилей.КоличествоОстаток, 0) > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	NULL
	|ИЗ
	|	ДляОтбора КАК ДляОтбора
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей.Остатки(, ) КАК ОстаткиАвтомобилей
	|		ПО ДляОтбора.Автомобиль = ОстаткиАвтомобилей.Автомобиль
	|";
	ВыполнитьЗапрос_(Ложь,Текст,МенеджерВременныхТаблиц,
	VINАвтомобиля, МассивСкладовДилера, BIR_Distri, ПоказыватьЗарезервированные, ПоказыватьЗакрепленныеЗаКлиентом, ПоказыватьВыданныеАвтомобили, ПоказыватьНеДляПродажи, МодельАвтомобиля, ВерсияАвтомобиля, ЦветАвтомобиля, ПоказыватьДоговоры, ДоговорНаАвансСсылка, ДатаНеПоказыватьВыданныеАвтомобили, РежимПодтверждения, СтруктураОтбора);                            			   
	
	Текст="ВЫБРАТЬ
	|	мУчетПродажОстатков.Автомобиль КАК Автомобиль,
	|	МАКСИМУМ(мУчетПродажОстатков.ОформленаРеализация) КАК ОформленаРеализация,
	|	МАКСИМУМ(мУчетПродажОстатков.Реализация) КАК Реализация,
	|	МАКСИМУМ(мУчетПродажОстатков.ДатаРеализации) КАК ДатаРеализации,
	|	МАКСИМУМ(мУчетПродажОстатков.УчтенУДилера) КАК УчтенУДилера,
	|	СУММА(мУчетПродажОстатков.ЦенаПродажи) КАК ЦенаПродажи
	|ПОМЕСТИТЬ УчетПродажОстатков
	|ИЗ
	|	мУчетПродажОстатков КАК мУчетПродажОстатков
	|
	|СГРУППИРОВАТЬ ПО
	|	мУчетПродажОстатков.Автомобиль
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Автомобиль
	|";
	ВыполнитьЗапрос_(Ложь,Текст,МенеджерВременныхТаблиц,
	VINАвтомобиля, МассивСкладовДилера, BIR_Distri, ПоказыватьЗарезервированные, ПоказыватьЗакрепленныеЗаКлиентом, ПоказыватьВыданныеАвтомобили, ПоказыватьНеДляПродажи, МодельАвтомобиля, ВерсияАвтомобиля, ЦветАвтомобиля, ПоказыватьДоговоры, ДоговорНаАвансСсылка, ДатаНеПоказыватьВыданныеАвтомобили, РежимПодтверждения, СтруктураОтбора);			   
	
	Текст = "ВЫБРАТЬ
	|	ДляОтбора.Автомобиль КАК Автомобиль,
	|	ИСТИНА КАК ОформленаВыдача,
	|	МАКСИМУМ(ВыданныеАвтомобили.ДатаВыдачи) КАК ДатаВыдачи
	|ПОМЕСТИТЬ ОформленныеВыдачи
	|ИЗ
	|	ДляОтбора КАК ДляОтбора
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_АвтомобилиВыданные КАК ВыданныеАвтомобили
	|		ПО ДляОтбора.VIN = ВыданныеАвтомобили.VIN
	|
	|СГРУППИРОВАТЬ ПО
	|	ДляОтбора.Автомобиль
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Автомобиль";
	ВыполнитьЗапрос_(Ложь,Текст,МенеджерВременныхТаблиц,
	VINАвтомобиля, МассивСкладовДилера, BIR_Distri, ПоказыватьЗарезервированные, ПоказыватьЗакрепленныеЗаКлиентом, ПоказыватьВыданныеАвтомобили, ПоказыватьНеДляПродажи, МодельАвтомобиля, ВерсияАвтомобиля, ЦветАвтомобиля, ПоказыватьДоговоры, ДоговорНаАвансСсылка, ДатаНеПоказыватьВыданныеАвтомобили, РежимПодтверждения, СтруктураОтбора);			   			   
	
	Текст =       "ВЫБРАТЬ
	|	ДляОтбора.Автомобиль КАК Автомобиль,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РезервыУтвержденные.ДатаРезерва, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК УтвержденРезерв,
	|	РезервыУтвержденные.Менеджер КАК МенеджерРезерва,
	|	РезервыУтвержденные.Клиент КАК КлиентРезерва,
	|	РезервыУтвержденные.ДатаРезерва КАК ДатаРезерва,
	|	РезервыУтвержденные.Регистратор КАК ИдентификаторРезерва,
	|	РезервыУтвержденные.ДатаСнятияСРезерва КАК ДатаСнятияСРезерва,
	|	РезервыУтвержденные.РабочийЛист КАК НомерРЛ
	|ПОМЕСТИТЬ УтвержденныеРезервы
	|ИЗ
	|	ДляОтбора КАК ДляОтбора
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_УтвержденныеРезервы КАК РезервыУтвержденные
	|		ПО ДляОтбора.Автомобиль = РезервыУтвержденные.Автомобиль
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Автомобиль
	|";
	ВыполнитьЗапрос_(Ложь,Текст,МенеджерВременныхТаблиц,
	VINАвтомобиля, МассивСкладовДилера, BIR_Distri, ПоказыватьЗарезервированные, ПоказыватьЗакрепленныеЗаКлиентом, ПоказыватьВыданныеАвтомобили, ПоказыватьНеДляПродажи, МодельАвтомобиля, ВерсияАвтомобиля, ЦветАвтомобиля, ПоказыватьДоговоры, ДоговорНаАвансСсылка, ДатаНеПоказыватьВыданныеАвтомобили, РежимПодтверждения, СтруктураОтбора);			   			                  

	Текст =       "ВЫБРАТЬ
	              |	АвтомобилиЗаконтрактованные.Автомобиль КАК Автомобиль,
	              |	АвтомобилиЗаконтрактованные.VIN КАК VIN,
	              |	АвтомобилиЗаконтрактованные.Регистратор КАК Договор,
	              |	ИСТИНА КАК АвтомобильЗаконтрактован,
	              |	АвтомобилиЗаконтрактованные.СуммаДоговора КАК СуммаДоговора,
	              |	АвтомобилиЗаконтрактованные.СуммаАванса КАК СуммаАванса,
	              |	АвтомобилиЗаконтрактованные.ОбщаяСуммаПоАвтомобилю КАК ЦенаПоДоговоруБезОборудования,
	              |	АвтомобилиЗаконтрактованные.СтатусОкончательныхДокументов КАК СтатусОкончательныхДокументов,
	              |	АвтомобилиЗаконтрактованные.СтатусПредварительныхДокументов КАК СтатусПредварительныхДокументов,
	              |	АвтомобилиЗаконтрактованные.ИдентификаторСтрокиДоговора КАК ИдентификаторСтрокиДоговора,
	              |	АвтомобилиЗаконтрактованные.Клиент КАК КлиентДоговора,
	              |	АвтомобилиЗаконтрактованные.Менеджер КАК МенеджерДоговора,
	              |	АвтомобилиЗаконтрактованные.ЖелаемаяДатаВыдачи КАК ЖелаемаяДатаВыдачи,
	              |	АвтомобилиЗаконтрактованные.РабочийЛист КАК НомерРЛ
	              |ПОМЕСТИТЬ ЗаконтрактованныеАвтомобили
	              |ИЗ
	              |	РегистрСведений.Renault_ЗаконтрактованныеАвтомобили.СрезПоследних КАК АвтомобилиЗаконтрактованные
	              |ГДЕ
	              |	АвтомобилиЗаконтрактованные.ДатаСнятияРезерва = ДАТАВРЕМЯ(1, 1, 1)
	              |
	              |ИНДЕКСИРОВАТЬ ПО
	              |	Автомобиль";
	ВыполнитьЗапрос_(Ложь,Текст,МенеджерВременныхТаблиц,
	VINАвтомобиля, МассивСкладовДилера, BIR_Distri, ПоказыватьЗарезервированные, ПоказыватьЗакрепленныеЗаКлиентом, ПоказыватьВыданныеАвтомобили, ПоказыватьНеДляПродажи, МодельАвтомобиля, ВерсияАвтомобиля, ЦветАвтомобиля, ПоказыватьДоговоры, ДоговорНаАвансСсылка, ДатаНеПоказыватьВыданныеАвтомобили, РежимПодтверждения, СтруктураОтбора);               
	
	Текст =       "ВЫБРАТЬ РАЗЛИЧНЫЕ
	              |	ДляОтбора.Автомобиль КАК Автомобиль,
	              |	ДляОтбора.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	              |	ПОДСТРОКА(ДопИнформацияПоАвтомобилям.Примечание, 0, 1024) КАК Примечание,
	              |	ПОДСТРОКА(ДопИнформацияПоАвтомобилям.ПримечаниеРОП, 0, 1024) КАК ПримечаниеРОП,
	              |	ДопИнформацияПоАвтомобилям.ЦенаПродажиРОП КАК ЦенаПродажиРОП,
	              |	ДопИнформацияПоАвтомобилям.ПлановаяДатаОплатыАФМ КАК ПлановаяДатаОплатыАФМ,
	              |	ДопИнформацияПоАвтомобилям.ОплатаАФМСогласована КАК ОплатаАФМСогласована,
	              |	ДопИнформацияПоАвтомобилям.АвтоОплаченАФМ КАК АвтоОплаченАФМ,
	              |	ДопИнформацияПоАвтомобилям.ПТСПолученДилером КАК ПТСПолученДилером,
	              |	ДопИнформацияПоАвтомобилям.НеДляПродажи КАК НеДляПродажи,
	              |	ДопИнформацияПоАвтомобилям.ЖелаемаяДатаОтгрузки КАК ДатаОтгрузкиЖелаемая,
	              |	ДопИнформацияПоАвтомобилям.ДилерскийЦентр КАК ДилерскийЦентр,
	              |	ДопИнформацияПоАвтомобилям.ПричинаВыкупа КАК ПричинаВыкупа,
	              |	ДопИнформацияПоАвтомобилям.СкладПТС КАК СкладПТС,
	              |	ДопИнформацияПоАвтомобилям.ДополнительныеЗатратыПоАвто КАК ДополнительныеЗатратыПоАвто,
	              |	ДопИнформацияПоАвтомобилям.ТипАвтомобиля КАК ТипАвтомобиля,
	              |	ДопИнформацияПоАвтомобилям.ИнвентарныйНомер КАК ИнвентарныйНомер,
	              |	ДопИнформацияПоАвтомобилям.ФактическаяДатаОплатыАФМ КАК ФактическаяДатаОплатыАФМ,
	              |	ДопИнформацияПоАвтомобилям.ДопКолонка1 КАК ДопКолонка1,
	              |	ДопИнформацияПоАвтомобилям.ДопКолонка2 КАК ДопКолонка2,
	              |	ДопИнформацияПоАвтомобилям.ДопКолонка3 КАК ДопКолонка3,
	              |	ДопИнформацияПоАвтомобилям.ДопКолонка4 КАК ДопКолонка4,
	              |	ДопИнформацияПоАвтомобилям.ДопКолонка5 КАК ДопКолонка5,
	              |	ДопИнформацияПоАвтомобилям.ДопКолонка6 КАК ДопКолонка6,
	              |	ДопИнформацияПоАвтомобилям.ДопКолонка7 КАК ДопКолонка7,
	              |	ДопИнформацияПоАвтомобилям.ДопКолонка8 КАК ДопКолонка8,
	              |	ДопИнформацияПоАвтомобилям.ДопКолонка9 КАК ДопКолонка9,
	              |	ДопИнформацияПоАвтомобилям.ДопКолонка10 КАК ДопКолонка10,
	              |	ДопИнформацияПоАвтомобилям.ЦенаФиксирована КАК ЦенаФиксирована,
	              |	ДопИнформацияПоАвтомобилям.ЦветВыделенияСтрокиДляВсех КАК ЦветВыделенияСтрокиДляВсех
	              |ПОМЕСТИТЬ ДополнительнаяИнформация
	              |ИЗ
	              |	ДляОтбора КАК ДляОтбора
	              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям КАК ДопИнформацияПоАвтомобилям
	              |		ПО ДляОтбора.Автомобиль = ДопИнформацияПоАвтомобилям.Автомобиль
	              |			И (ДляОтбора.ЗаказНаПроизводство = ЗНАЧЕНИЕ(Документ.Renault_Договор.пустаяСсылка))
	              |
	              |ОБЪЕДИНИТЬ ВСЕ
	              |
	              |ВЫБРАТЬ РАЗЛИЧНЫЕ
	              |	ДляОтбора.Автомобиль,
	              |	ДляОтбора.ЗаказНаПроизводство,
	              |	ПОДСТРОКА(ДопИнформацияПоЗаказуНаПроизводство.Примечание, 0, 1024),
	              |	ПОДСТРОКА(ДопИнформацияПоЗаказуНаПроизводство.ПримечаниеРОП, 0, 1024),
	              |	ДопИнформацияПоЗаказуНаПроизводство.ЦенаПродажиРОП,
	              |	ДопИнформацияПоЗаказуНаПроизводство.ПлановаяДатаОплатыАФМ,
	              |	ДопИнформацияПоЗаказуНаПроизводство.ОплатаАФМСогласована,
	              |	ДопИнформацияПоЗаказуНаПроизводство.АвтоОплаченАФМ,
	              |	ДопИнформацияПоЗаказуНаПроизводство.ПТСПолученДилером,
	              |	ДопИнформацияПоЗаказуНаПроизводство.НеДляПродажи,
	              |	ДопИнформацияПоЗаказуНаПроизводство.ЖелаемаяДатаОтгрузки,
	              |	ДопИнформацияПоЗаказуНаПроизводство.ДилерскийЦентр,
	              |	ДопИнформацияПоЗаказуНаПроизводство.ПричинаВыкупа,
	              |	ДопИнформацияПоЗаказуНаПроизводство.СкладПТС,
	              |	ДопИнформацияПоЗаказуНаПроизводство.ДополнительныеЗатратыПоАвто,
	              |	ДопИнформацияПоЗаказуНаПроизводство.ТипАвтомобиля,
	              |	ДопИнформацияПоЗаказуНаПроизводство.ИнвентарныйНомер,
	              |	ДопИнформацияПоЗаказуНаПроизводство.ФактическаяДатаОплатыАФМ,
	              |	ДопИнформацияПоЗаказуНаПроизводство.ДопКолонка1,
	              |	ДопИнформацияПоЗаказуНаПроизводство.ДопКолонка2,
	              |	ДопИнформацияПоЗаказуНаПроизводство.ДопКолонка3,
	              |	ДопИнформацияПоЗаказуНаПроизводство.ДопКолонка4,
	              |	ДопИнформацияПоЗаказуНаПроизводство.ДопКолонка5,
	              |	ДопИнформацияПоЗаказуНаПроизводство.ДопКолонка6,
	              |	ДопИнформацияПоЗаказуНаПроизводство.ДопКолонка7,
	              |	ДопИнформацияПоЗаказуНаПроизводство.ДопКолонка8,
	              |	ДопИнформацияПоЗаказуНаПроизводство.ДопКолонка9,
	              |	ДопИнформацияПоЗаказуНаПроизводство.ДопКолонка10,
	              |	ЛОЖЬ,
	              |	ДопИнформацияПоЗаказуНаПроизводство.ЦветВыделенияСтрокиДляВсех
	              |ИЗ
	              |	ДляОтбора КАК ДляОтбора
	              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.DMS_ДопИнформацияПоЗаказуНаПроизводство КАК ДопИнформацияПоЗаказуНаПроизводство
	              |		ПО ДляОтбора.ЗаказНаПроизводство = ДопИнформацияПоЗаказуНаПроизводство.ЗаказНаПроизводство
	              |			И ДляОтбора.VIN = ДопИнформацияПоЗаказуНаПроизводство.VIN
	              |ГДЕ
	              |	ДопИнформацияПоЗаказуНаПроизводство.ЗаказНаПроизводство <> ЗНАЧЕНИЕ(Документ.Renault_Договор.ПустаяСсылка)
	              |
	              |ИНДЕКСИРОВАТЬ ПО
	              |	Автомобиль";
	ВыполнитьЗапрос_(Ложь,Текст,МенеджерВременныхТаблиц,
	VINАвтомобиля, МассивСкладовДилера, BIR_Distri, ПоказыватьЗарезервированные, ПоказыватьЗакрепленныеЗаКлиентом, ПоказыватьВыданныеАвтомобили, ПоказыватьНеДляПродажи, МодельАвтомобиля, ВерсияАвтомобиля, ЦветАвтомобиля, ПоказыватьДоговоры, ДоговорНаАвансСсылка, ДатаНеПоказыватьВыданныеАвтомобили, РежимПодтверждения, СтруктураОтбора);               		   
	
	Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ДляОтбора.Автомобиль КАК Автомобиль,
	        |	МАКСИМУМ(ОстаткиАвтомобилейОбороты.Период) КАК ДатаПоследнегоПеремещения
	        |ПОМЕСТИТЬ ПоследниеПеремещенияАвто
	        |ИЗ
	        |	ДляОтбора КАК ДляОтбора
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей.Обороты(, , Регистратор, ) КАК ОстаткиАвтомобилейОбороты
	        |		ПО ДляОтбора.Автомобиль = ОстаткиАвтомобилейОбороты.Автомобиль
	        |			И (ОстаткиАвтомобилейОбороты.Регистратор ССЫЛКА Документ.ПеремещениеАвтомобилей)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ДляОтбора.Автомобиль
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	Автомобиль";
	ВыполнитьЗапрос_(Ложь,Текст,МенеджерВременныхТаблиц,
	VINАвтомобиля, МассивСкладовДилера, BIR_Distri, ПоказыватьЗарезервированные, ПоказыватьЗакрепленныеЗаКлиентом, ПоказыватьВыданныеАвтомобили, ПоказыватьНеДляПродажи, МодельАвтомобиля, ВерсияАвтомобиля, ЦветАвтомобиля, ПоказыватьДоговоры, ДоговорНаАвансСсылка, ДатаНеПоказыватьВыданныеАвтомобили, РежимПодтверждения, СтруктураОтбора);
	
	
	Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДляОтбора.Автомобиль КАК Автомобиль,
	|	ПользовательскаяИнформацияПоАвтомобилям.ЦветВыделенияСтроки КАК ЦветВыделенияСтроки
	|ПОМЕСТИТЬ ПользовательскаяИнформация
	|ИЗ
	|	ДляОтбора КАК ДляОтбора
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ПользовательскаяИнформацияПоАвтомобилям КАК ПользовательскаяИнформацияПоАвтомобилям
	|		ПО ДляОтбора.Идентификатор = ПользовательскаяИнформацияПоАвтомобилям.Автомобиль
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Автомобиль
	|";
	ВыполнитьЗапрос_(Ложь,Текст,МенеджерВременныхТаблиц,
	VINАвтомобиля, МассивСкладовДилера, BIR_Distri, ПоказыватьЗарезервированные, ПоказыватьЗакрепленныеЗаКлиентом, ПоказыватьВыданныеАвтомобили, ПоказыватьНеДляПродажи, МодельАвтомобиля, ВерсияАвтомобиля, ЦветАвтомобиля, ПоказыватьДоговоры, ДоговорНаАвансСсылка, ДатаНеПоказыватьВыданныеАвтомобили, РежимПодтверждения, СтруктураОтбора);
	
	Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	          |	ДляОтбора.Автомобиль КАК Автомобиль,
	          |	ЗаявкиНаРезервАвтомобиля.Клиент КАК Клиент,
	          |	ИСТИНА КАК ЗаявленРезерв,
	          |	ЗаявкиНаРезервАвтомобиля.Регистратор КАК ИдентификаторРезерваЗаявка
	          |ПОМЕСТИТЬ мЗаявкиНаРезерв
	          |ИЗ
	          |	ДляОтбора КАК ДляОтбора
	          |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ЗаявкиНаРезервАвтомобиля.СрезПоследних КАК ЗаявкиНаРезервАвтомобиля
	          |		ПО ДляОтбора.VIN = ЗаявкиНаРезервАвтомобиля.VIN
	          |ГДЕ
	          |	ДляОтбора.VIN <> """"
	          |
	          |ОБЪЕДИНИТЬ ВСЕ
	          |
	          |ВЫБРАТЬ РАЗЛИЧНЫЕ
	          |	ДляОтбора.Автомобиль,
	          |	ЗаявкиНаРезервАвтомобиля.Клиент,
	          |	ИСТИНА,
	          |	ЗаявкиНаРезервАвтомобиля.Регистратор
	          |ИЗ
	          |	ДляОтбора КАК ДляОтбора
	          |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ЗаявкиНаРезервАвтомобиля.СрезПоследних КАК ЗаявкиНаРезервАвтомобиля
	          |		ПО ДляОтбора.АФМ_НомерОрдераDistri = ЗаявкиНаРезервАвтомобиля.SedreNum
	          |ГДЕ
	          |	ДляОтбора.VIN = """"
	          |	И ДляОтбора.АФМ_НомерОрдераDistri <> """"
	          |
	          |ИНДЕКСИРОВАТЬ ПО
	          |	Автомобиль,
	          |	Клиент";
	ВыполнитьЗапрос_(Ложь,Текст,МенеджерВременныхТаблиц,
	VINАвтомобиля, МассивСкладовДилера, BIR_Distri, ПоказыватьЗарезервированные, ПоказыватьЗакрепленныеЗаКлиентом, ПоказыватьВыданныеАвтомобили, ПоказыватьНеДляПродажи, МодельАвтомобиля, ВерсияАвтомобиля, ЦветАвтомобиля, ПоказыватьДоговоры, ДоговорНаАвансСсылка, ДатаНеПоказыватьВыданныеАвтомобили, РежимПодтверждения, СтруктураОтбора);
	
	Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	          |	ДляОтбора.Автомобиль КАК Автомобиль,
	          |	ИСТИНА КАК ЕстьЗаявкаНаРезервТекСотрудника,
	          |	ЗаявкиНаРезервАвтомобиляОтСотрудника.Регистратор КАК ИдентификаторРезерваТекСотрудника
	          |ПОМЕСТИТЬ ЗаявкиНаРезервСотрудников
	          |ИЗ
	          |	ДляОтбора КАК ДляОтбора
	          |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ЗаявкиНаРезервАвтомобиля.СрезПоследних(, ) КАК ЗаявкиНаРезервАвтомобиляОтСотрудника
	          |		ПО ДляОтбора.VIN = ЗаявкиНаРезервАвтомобиляОтСотрудника.VIN
	          |ГДЕ
	          |	ДляОтбора.VIN <> """"
	          |	И ЗаявкиНаРезервАвтомобиляОтСотрудника.Менеджер = &ТекущийСотрудник
	          |
	          |ОБЪЕДИНИТЬ ВСЕ
	          |
	          |ВЫБРАТЬ РАЗЛИЧНЫЕ
	          |	ДляОтбора.Автомобиль,
	          |	ИСТИНА,
	          |	ЗаявкиНаРезервАвтомобиляОтСотрудника.Регистратор
	          |ИЗ
	          |	ДляОтбора КАК ДляОтбора
	          |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ЗаявкиНаРезервАвтомобиля.СрезПоследних(, ) КАК ЗаявкиНаРезервАвтомобиляОтСотрудника
	          |		ПО ДляОтбора.АФМ_НомерОрдераDistri = ЗаявкиНаРезервАвтомобиляОтСотрудника.SedreNum
	          |ГДЕ
	          |	ДляОтбора.VIN = """"
	          |	И ДляОтбора.АФМ_НомерОрдераDistri <> """"
	          |	И ЗаявкиНаРезервАвтомобиляОтСотрудника.Менеджер = &ТекущийСотрудник
	          |
	          |ИНДЕКСИРОВАТЬ ПО
	          |	Автомобиль";
	ВыполнитьЗапрос_(Ложь,Текст,МенеджерВременныхТаблиц,
	VINАвтомобиля, МассивСкладовДилера, BIR_Distri, ПоказыватьЗарезервированные, ПоказыватьЗакрепленныеЗаКлиентом, ПоказыватьВыданныеАвтомобили, ПоказыватьНеДляПродажи, МодельАвтомобиля, ВерсияАвтомобиля, ЦветАвтомобиля, ПоказыватьДоговоры, ДоговорНаАвансСсылка, ДатаНеПоказыватьВыданныеАвтомобили, РежимПодтверждения, СтруктураОтбора);
	
	
	Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	          |	мЗаявкиНаРезерв.Автомобиль КАК Автомобиль,
	          |	мЗаявкиНаРезерв.ЗаявленРезерв,
	          |	мЗаявкиНаРезерв.ИдентификаторРезерваЗаявка
	          |ПОМЕСТИТЬ ЗаявкиНаРезерв
	          |ИЗ
	          |	мЗаявкиНаРезерв КАК мЗаявкиНаРезерв
	          |
	          |ИНДЕКСИРОВАТЬ ПО
	          |	Автомобиль";
	ВыполнитьЗапрос_(Ложь,Текст,МенеджерВременныхТаблиц,
	VINАвтомобиля, МассивСкладовДилера, BIR_Distri, ПоказыватьЗарезервированные, ПоказыватьЗакрепленныеЗаКлиентом, ПоказыватьВыданныеАвтомобили, ПоказыватьНеДляПродажи, МодельАвтомобиля, ВерсияАвтомобиля, ЦветАвтомобиля, ПоказыватьДоговоры, ДоговорНаАвансСсылка, ДатаНеПоказыватьВыданныеАвтомобили, РежимПодтверждения, СтруктураОтбора);          
	
	
	Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	          |	мЗаявкиНаРезерв.Автомобиль,
	          |	ИСТИНА КАК КорпКлиентРезерв
	          |ПОМЕСТИТЬ ЗаявкиНаРезервКлиентКорп
	          |ИЗ
	          |	мЗаявкиНаРезерв КАК мЗаявкиНаРезерв
	          |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Renault_КорпоративныеКлиенты КАК КорпоративныеКлиенты
	          |		ПО мЗаявкиНаРезерв.Клиент = КорпоративныеКлиенты.Контрагент";
	ВыполнитьЗапрос_(Ложь,Текст,МенеджерВременныхТаблиц,
	VINАвтомобиля, МассивСкладовДилера, BIR_Distri, ПоказыватьЗарезервированные, ПоказыватьЗакрепленныеЗаКлиентом, ПоказыватьВыданныеАвтомобили, ПоказыватьНеДляПродажи, МодельАвтомобиля, ВерсияАвтомобиля, ЦветАвтомобиля, ПоказыватьДоговоры, ДоговорНаАвансСсылка, ДатаНеПоказыватьВыданныеАвтомобили, РежимПодтверждения, СтруктураОтбора);          		   
	
	Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	          |	ДляОтбора.Автомобиль КАК Автомобиль,
	          |	ДляОтбора.Договор КАК Договор,
	          |	ДопИнформацияПоДоговорам.КлиентВнесАванс КАК КлиентВнесАванс,
	          |	ДопИнформацияПоДоговорам.КлиентПолностьюОплатилАвто КАК КлиентПолностьюОплатилАвто,
	          |	ДопИнформацияПоДоговорам.ПлановаяДатаПолнойОплатыКлиентом КАК ПлановаяДатаПолнойОплатыКлиентом,
	          |	0 КАК Метка
	          |ПОМЕСТИТЬ мДопИнформацияПоДоговорамАвто
	          |ИЗ
	          |	ДляОтбора КАК ДляОтбора
	          |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ДополнительнаяИнформацияПоДоговорам КАК ДопИнформацияПоДоговорам
	          |		ПО ДляОтбора.Договор = ДопИнформацияПоДоговорам.Договор
	          |ГДЕ
	          |	ДляОтбора.Договор <> ЗНАЧЕНИЕ(Документ.Renault_Договор.ПустаяСсылка)
	          |
	          |ОБЪЕДИНИТЬ ВСЕ
	          |
	          |ВЫБРАТЬ РАЗЛИЧНЫЕ
	          |	ЗаконтрактованныеАвтомобили.Автомобиль,
	          |	ЗаконтрактованныеАвтомобили.Договор,
	          |	ДопИнформацияПоДоговорам.КлиентВнесАванс,
	          |	ДопИнформацияПоДоговорам.КлиентПолностьюОплатилАвто,
	          |	ДопИнформацияПоДоговорам.ПлановаяДатаПолнойОплатыКлиентом,
	          |	1
	          |ИЗ
	          |	ЗаконтрактованныеАвтомобили КАК ЗаконтрактованныеАвтомобили
	          |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ДополнительнаяИнформацияПоДоговорам КАК ДопИнформацияПоДоговорам
	          |		ПО ЗаконтрактованныеАвтомобили.Договор = ДопИнформацияПоДоговорам.Договор
	          |ГДЕ
	          |	ЗаконтрактованныеАвтомобили.Договор <> ЗНАЧЕНИЕ(Документ.Renault_Договор.ПустаяСсылка)
	          |	И ЗаконтрактованныеАвтомобили.Договор <> НЕОПРЕДЕЛЕНО
	          |	И ЗаконтрактованныеАвтомобили.Договор <> ЗНАЧЕНИЕ(Документ.Renault_БлокАвтомобиляИзДругойТочки.ПустаяСсылка)
	          |
	          |ИНДЕКСИРОВАТЬ ПО
	          |	Автомобиль,
	          |	Договор";
	ВыполнитьЗапрос_(Ложь,Текст,МенеджерВременныхТаблиц,
	VINАвтомобиля, МассивСкладовДилера, BIR_Distri, ПоказыватьЗарезервированные, ПоказыватьЗакрепленныеЗаКлиентом, ПоказыватьВыданныеАвтомобили, ПоказыватьНеДляПродажи, МодельАвтомобиля, ВерсияАвтомобиля, ЦветАвтомобиля, ПоказыватьДоговоры, ДоговорНаАвансСсылка, ДатаНеПоказыватьВыданныеАвтомобили, РежимПодтверждения, СтруктураОтбора);          		   	
	
	Текст =   "ВЫБРАТЬ
	          |	мДопИнформацияПоДоговорамАвто.Автомобиль,
	          |	мДопИнформацияПоДоговорамАвто.Договор,
	          |	МАКСИМУМ(мДопИнформацияПоДоговорамАвто.Метка) КАК Метка
	          |ПОМЕСТИТЬ мМеткаОтбора
	          |ИЗ
	          |	мДопИнформацияПоДоговорамАвто КАК мДопИнформацияПоДоговорамАвто
	          |
	          |СГРУППИРОВАТЬ ПО
	          |	мДопИнформацияПоДоговорамАвто.Автомобиль,
	          |	мДопИнформацияПоДоговорамАвто.Договор";
	ВыполнитьЗапрос_(Ложь,Текст,МенеджерВременныхТаблиц,
	VINАвтомобиля, МассивСкладовДилера, BIR_Distri, ПоказыватьЗарезервированные, ПоказыватьЗакрепленныеЗаКлиентом, ПоказыватьВыданныеАвтомобили, ПоказыватьНеДляПродажи, МодельАвтомобиля, ВерсияАвтомобиля, ЦветАвтомобиля, ПоказыватьДоговоры, ДоговорНаАвансСсылка, ДатаНеПоказыватьВыданныеАвтомобили, РежимПодтверждения, СтруктураОтбора);			   
	
	Текст =    "ВЫБРАТЬ РАЗЛИЧНЫЕ
	           |	мДопИнформацияПоДоговорамАвто.Автомобиль КАК Автомобиль,
	           |	мДопИнформацияПоДоговорамАвто.Договор КАК Договор,
	           |	мДопИнформацияПоДоговорамАвто.КлиентВнесАванс,
	           |	мДопИнформацияПоДоговорамАвто.КлиентПолностьюОплатилАвто,
	           |	мДопИнформацияПоДоговорамАвто.ПлановаяДатаПолнойОплатыКлиентом
	           |ПОМЕСТИТЬ ДопИнформацияПоДоговорамАвто
	           |ИЗ
	           |	мДопИнформацияПоДоговорамАвто КАК мДопИнформацияПоДоговорамАвто
	           |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ мМеткаОтбора КАК мМеткаОтбора
	           |		ПО мДопИнформацияПоДоговорамАвто.Автомобиль = мМеткаОтбора.Автомобиль
	           |			И мДопИнформацияПоДоговорамАвто.Договор = мМеткаОтбора.Договор
	           |			И мДопИнформацияПоДоговорамАвто.Метка = мМеткаОтбора.Метка
	           |
	           |ИНДЕКСИРОВАТЬ ПО
	           |	Автомобиль,
	           |	Договор";
	ВыполнитьЗапрос_(Ложь,Текст,МенеджерВременныхТаблиц,
	VINАвтомобиля, МассивСкладовДилера, BIR_Distri, ПоказыватьЗарезервированные, ПоказыватьЗакрепленныеЗаКлиентом, ПоказыватьВыданныеАвтомобили, ПоказыватьНеДляПродажи, МодельАвтомобиля, ВерсияАвтомобиля, ЦветАвтомобиля, ПоказыватьДоговоры, ДоговорНаАвансСсылка, ДатаНеПоказыватьВыданныеАвтомобили, РежимПодтверждения, СтруктураОтбора);			   			  
	
	Текст =    "ВЫБРАТЬ РАЗЛИЧНЫЕ
	           |	ДляОтбора.Автомобиль КАК Автомобиль,
	           |	МАКСИМУМ(НАЧАЛОПЕРИОДА(ВзаиморасчетыКомпанииОбороты.Период, ДЕНЬ)) КАК ДатаОплаты,
	           |	СУММА(-ВзаиморасчетыКомпанииОбороты.СуммаОборот) КАК СуммаОплаты
	           |ПОМЕСТИТЬ ОплатаПоДоговорам
	           |ИЗ
	           |	ДляОтбора КАК ДляОтбора
	           |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.DMS_ДоговораПродажАвтомобиля.СрезПоследних КАК ДоговораПродажАвтомобиля
	           |		ПО ДляОтбора.Автомобиль = ДоговораПродажАвтомобиля.Автомобиль
	           |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыКомпании.Обороты(, , Регистратор, ) КАК ВзаиморасчетыКомпанииОбороты
	           |		ПО (ДоговораПродажАвтомобиля.ДоговорВзаиморасчетов = ВзаиморасчетыКомпанииОбороты.ДоговорВзаиморасчетов)
	           |ГДЕ
	           |	(ВзаиморасчетыКомпанииОбороты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	           |			ИЛИ ВзаиморасчетыКомпанииОбороты.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер
	           |			ИЛИ ВзаиморасчетыКомпанииОбороты.Регистратор ССЫЛКА Документ.Выписка
	           |			ИЛИ ВзаиморасчетыКомпанииОбороты.Регистратор ССЫЛКА Документ.Взаимозачет
	           |			ИЛИ ВзаиморасчетыКомпанииОбороты.Регистратор ССЫЛКА Документ.КорректировкаДолга
	           |			ИЛИ ВзаиморасчетыКомпанииОбороты.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов)
	           |	И ДоговораПродажАвтомобиля.ДоговорВзаиморасчетов <> ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.Пустаяссылка)
	           |
	           |СГРУППИРОВАТЬ ПО
	           |	ДляОтбора.Автомобиль";
	ВыполнитьЗапрос_(Ложь,Текст,МенеджерВременныхТаблиц,
	VINАвтомобиля, МассивСкладовДилера, BIR_Distri, ПоказыватьЗарезервированные, ПоказыватьЗакрепленныеЗаКлиентом, ПоказыватьВыданныеАвтомобили, ПоказыватьНеДляПродажи, МодельАвтомобиля, ВерсияАвтомобиля, ЦветАвтомобиля, ПоказыватьДоговоры, ДоговорНаАвансСсылка, ДатаНеПоказыватьВыданныеАвтомобили, РежимПодтверждения, СтруктураОтбора);			   			  				   
	
	Текст =    "ВЫБРАТЬ РАЗЛИЧНЫЕ
	           |	МАКСИМУМ(Renault_ДоговорСоставДоговора.Ссылка.ЗаказНаАвтомобиль) КАК ЗаказНаАвтомобиль,
	           |	ДляОтбора.Автомобиль
	           |ПОМЕСТИТЬ ВТСделки
	           |ИЗ
	           |	ДляОтбора КАК ДляОтбора
	           |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Renault_Договор.СоставДоговора КАК Renault_ДоговорСоставДоговора
	           |		ПО ДляОтбора.Автомобиль = Renault_ДоговорСоставДоговора.Автомобиль
	           |			И (Renault_ДоговорСоставДоговора.Ссылка.Проведен)
	           |
	           |СГРУППИРОВАТЬ ПО
	           |	ДляОтбора.Автомобиль
	           |;
	           |
	           |////////////////////////////////////////////////////////////////////////////////
	           |ВЫБРАТЬ
	           |	СУММА(ВзаиморасчетыКомпанииОбороты.СуммаРасход) КАК СуммаРасход,
	           |	ВзаиморасчетыКомпанииОбороты.Регистратор,
	           |	ВТСделки.Автомобиль
	           |ПОМЕСТИТЬ ВТПКО
	           |ИЗ
	           |	ВТСделки КАК ВТСделки
	           |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыКомпании.Обороты(, , Регистратор, ) КАК ВзаиморасчетыКомпанииОбороты
	           |		ПО ВТСделки.ЗаказНаАвтомобиль = ВзаиморасчетыКомпанииОбороты.Сделка
	           |			И (ВзаиморасчетыКомпанииОбороты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер)
	           |
	           |СГРУППИРОВАТЬ ПО
	           |	ВзаиморасчетыКомпанииОбороты.Регистратор,
	           |	ВТСделки.Автомобиль
	           |;
	           |
	           |////////////////////////////////////////////////////////////////////////////////
	           |ВЫБРАТЬ
	           |	СУММА(-ВзаиморасчетыКомпанииОбороты.СуммаПриход) КАК Возврат,
	           |	ВзаиморасчетыКомпанииОбороты.Сделка,
	           |	ВТПКО.Автомобиль
	           |ПОМЕСТИТЬ ВТРКО
	           |ИЗ
	           |	ВТПКО КАК ВТПКО
	           |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыКомпании.Обороты(, , Регистратор, ) КАК ВзаиморасчетыКомпанииОбороты
	           |		ПО ВТПКО.Регистратор = ВзаиморасчетыКомпанииОбороты.Сделка
	           |			И (ВзаиморасчетыКомпанииОбороты.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер)
	           |
	           |СГРУППИРОВАТЬ ПО
	           |	ВзаиморасчетыКомпанииОбороты.Сделка,
	           |	ВТПКО.Автомобиль
	           |;
	           |
	           |////////////////////////////////////////////////////////////////////////////////
	           |ВЫБРАТЬ
	           |	СУММА(ВТПКО.СуммаРасход + ЕСТЬNULL(ВТРКО.Возврат, 0)) КАК СуммаРасход,
	           |	ВТПКО.Автомобиль
	           |ПОМЕСТИТЬ ВТКасса
	           |ИЗ
	           |	ВТПКО КАК ВТПКО
	           |		ЛЕВОЕ СОЕДИНЕНИЕ ВТРКО КАК ВТРКО
	           |		ПО ВТПКО.Регистратор = ВТРКО.Сделка
	           |			И ВТПКО.Автомобиль = ВТРКО.Автомобиль
	           |
	           |СГРУППИРОВАТЬ ПО
	           |	ВТПКО.Автомобиль";
	ВыполнитьЗапрос_(Ложь,Текст,МенеджерВременныхТаблиц,
	VINАвтомобиля, МассивСкладовДилера, BIR_Distri, ПоказыватьЗарезервированные, ПоказыватьЗакрепленныеЗаКлиентом, ПоказыватьВыданныеАвтомобили, ПоказыватьНеДляПродажи, МодельАвтомобиля, ВерсияАвтомобиля, ЦветАвтомобиля, ПоказыватьДоговоры, ДоговорНаАвансСсылка, ДатаНеПоказыватьВыданныеАвтомобили, РежимПодтверждения, СтруктураОтбора);
	
	Текст = "ВЫБРАТЬ
	        |	ИнформацияПоАвтомобилям.Автомобиль КАК Автомобиль,
	        |	ЕСТЬNULL(УчетПродажОстатков.ОформленаРеализация, ЛОЖЬ) КАК ОформленаРеализация,
	        |	ЕСТЬNULL(УчетПродажОстатков.Реализация, ЗНАЧЕНИЕ(Документ.РеализацияАвтомобилей.ПустаяСсылка)) КАК Реализация,
	        |	ЕСТЬNULL(УчетПродажОстатков.ДатаРеализации, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРеализации,
	        |	ЕСТЬNULL(УчетПродажОстатков.УчтенУДилера, ЛОЖЬ) КАК УчтенУДилера,
	        |	ЕСТЬNULL(ОформленныеВыдачи.ОформленаВыдача, ЛОЖЬ) КАК ОформленаВыдача,
	        |	ЕСТЬNULL(УтвержденныеРезервы.УтвержденРезерв, ЛОЖЬ) КАК УтвержденРезерв,
	        |	ЕСТЬNULL(УтвержденныеРезервы.МенеджерРезерва, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК МенеджерРезерва,
	        |	ЕСТЬNULL(УтвержденныеРезервы.КлиентРезерва, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК КлиентРезерва,
	        |	ЕСТЬNULL(УтвержденныеРезервы.ДатаРезерва, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРезерва,
	        |	ЕСТЬNULL(УтвержденныеРезервы.ИдентификаторРезерва, ЕСТЬNULL(ЗаявкиНаРезервСотрудников.ИдентификаторРезерваТекСотрудника, ЗНАЧЕНИЕ(Документ.Renault_РезервированиеАвтомобилей.ПустаяСсылка))) КАК ИдентификаторРезерва,
	        |	ЕСТЬNULL(УтвержденныеРезервы.ДатаСнятияСРезерва, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСнятияСРезерва,
	        |	ЕСТЬNULL(ЗаявкиНаРезерв.ЗаявленРезерв, ЛОЖЬ) КАК ЗаявленРезерв,
	        |	ЕСТЬNULL(ЗаявкиНаРезервСотрудников.ЕстьЗаявкаНаРезервТекСотрудника, ЛОЖЬ) КАК ЕстьЗаявкаНаРезервТекСотрудника,
	        |	ЕСТЬNULL(ЗаявкиНаРезервСотрудников.ИдентификаторРезерваТекСотрудника, ЗНАЧЕНИЕ(Документ.Renault_РезервированиеАвтомобилей.ПустаяСсылка)) КАК ИдентификаторРезерваТекСотрудника,
	        |	ЕСТЬNULL(ЗаконтрактованныеАвтомобили.Договор, ИнформацияПоАвтомобилям.Договор) КАК Договор,
	        |	ЕСТЬNULL(ЗаявкиНаРезерв.ИдентификаторРезерваЗаявка, ЗНАЧЕНИЕ(Документ.Renault_РезервированиеАвтомобилей.ПустаяСсылка)) КАК ИдентификаторРезерваЗаявка,
	        |	ЕСТЬNULL(ЗаконтрактованныеАвтомобили.АвтомобильЗаконтрактован, ЛОЖЬ) КАК АвтомобильЗаконтрактован,
	        |	ЕСТЬNULL(ЗаконтрактованныеАвтомобили.СуммаДоговора, 0) КАК СуммаДоговора,
	        |	ЕСТЬNULL(ЗаконтрактованныеАвтомобили.СуммаАванса, 0) КАК СуммаАванса,
	        |	ЕСТЬNULL(ЗаконтрактованныеАвтомобили.ЦенаПоДоговоруБезОборудования, 0) КАК ЦенаПоДоговоруБезОборудования,
	        |	ЕСТЬNULL(ЗаконтрактованныеАвтомобили.СтатусОкончательныхДокументов, ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыДоговоровНаПродажуАвтомобиля.ПустаяСсылка)) КАК СтатусОкончательныхДокументов,
	        |	ЕСТЬNULL(ЗаконтрактованныеАвтомобили.СтатусПредварительныхДокументов, ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыДоговоровНаПродажуАвтомобиля.ПустаяСсылка)) КАК СтатусПредварительныхДокументов,
	        |	ЕСТЬNULL(ЗаконтрактованныеАвтомобили.ИдентификаторСтрокиДоговора, ИнформацияПоАвтомобилям.ИдентификаторСтрокиДоговора) КАК ИдентификаторСтрокиДоговора,
	        |	ЕСТЬNULL(ЗаконтрактованныеАвтомобили.КлиентДоговора, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК КлиентДоговора,
	        |	ЕСТЬNULL(ЗаконтрактованныеАвтомобили.МенеджерДоговора, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК МенеджерДоговора,
	        |	ЕСТЬNULL(ЗаконтрактованныеАвтомобили.ЖелаемаяДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1)) КАК ЖелаемаяДатаВыдачи,
	        |	ЕСТЬNULL(ЗаконтрактованныеАвтомобили.НомерРЛ, ЕСТЬNULL(УтвержденныеРезервы.НомерРЛ, ИнформацияПоАвтомобилям.РабочийЛист)) КАК НомерРЛ,
	        |	ЕСТЬNULL(ПользовательскаяИнформация.ЦветВыделенияСтроки, """") КАК ЦветВыделенияСтроки,
	        |	ЕСТЬNULL(ПоследниеПеремещенияАвто.ДатаПоследнегоПеремещения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоследнегоПеремещения,
	        |	ЕСТЬNULL(ЗаявкиНаРезервКлиентКорп.КорпКлиентРезерв, ЛОЖЬ) КАК КорпКлиентРезерв,
	        |	ЕСТЬNULL(ДополнительнаяИнформация.Примечание, """") КАК Примечание,
	        |	ЕСТЬNULL(ДополнительнаяИнформация.ПримечаниеРОП, """") КАК ПримечаниеРОП,
	        |	ЕСТЬNULL(ДополнительнаяИнформация.ЦенаПродажиРОП, 0) КАК ЦенаПродажиРОП,
	        |	ЕСТЬNULL(ДополнительнаяИнформация.ПлановаяДатаОплатыАФМ, ДАТАВРЕМЯ(1, 1, 1)) КАК ПлановаяДатаОплатыАФМ,
	        |	ЕСТЬNULL(ДополнительнаяИнформация.ОплатаАФМСогласована, ЛОЖЬ) КАК ОплатаАФМСогласована,
	        |	ЕСТЬNULL(ДополнительнаяИнформация.АвтоОплаченАФМ, ЛОЖЬ) КАК АвтоОплаченАФМ,
	        |	ЕСТЬNULL(ДополнительнаяИнформация.ПТСПолученДилером, ЛОЖЬ) КАК ПТСПолученДилером,
	        |	ЕСТЬNULL(ДополнительнаяИнформация.НеДляПродажи, ЛОЖЬ) КАК НеДляПродажи,
	        |	ЕСТЬNULL(ДополнительнаяИнформация.ДатаОтгрузкиЖелаемая, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОтгрузкиЖелаемая,
	        |	ЕСТЬNULL(ДополнительнаяИнформация.ДилерскийЦентр, ЗНАЧЕНИЕ(Справочник.CRM_ДилерскиеЦентры.ПустаяСсылка)) КАК ДилерскийЦентр,
	        |	ЕСТЬNULL(ДополнительнаяИнформация.ПричинаВыкупа, ЗНАЧЕНИЕ(Справочник.CRM_ПричиныВыкупаАвтоАФМ.ПустаяССылка)) КАК ПричинаВыкупа,
	        |	ЕСТЬNULL(ДополнительнаяИнформация.СкладПТС, ЗНАЧЕНИЕ(Справочник.СкладыКомпании.пустаяСсылка)) КАК СкладПТС,
	        |	ЕСТЬNULL(ДополнительнаяИнформация.ДополнительныеЗатратыПоАвто, 0) КАК ДополнительныеЗатратыПоАвто,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ДополнительнаяИнформация.ТипАвтомобиля, ЗНАЧЕНИЕ(Справочник.Renault_ТипыАвтомобилей.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Renault_ТипыАвтомобилей.ПустаяСсылка)
	        |			ТОГДА ВЫБОР
	        |					КОГДА ЕСТЬNULL(ИнформацияПоАвтомобилям.ТипАвтомобиля, ЗНАЧЕНИЕ(Справочник.Renault_ТипыАвтомобилей.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Renault_ТипыАвтомобилей.ПустаяСсылка)
	        |						ТОГДА ЗНАЧЕНИЕ(Справочник.Renault_ТипыАвтомобилей.НеОпределен)
	        |					ИНАЧЕ ИнформацияПоАвтомобилям.ТипАвтомобиля
	        |				КОНЕЦ
	        |		ИНАЧЕ ДополнительнаяИнформация.ТипАвтомобиля
	        |	КОНЕЦ КАК ТипАвтомобиля,
	        |	ЕСТЬNULL(ДополнительнаяИнформация.ИнвентарныйНомер, """") КАК ИнвентарныйНомер,
	        |	ЕСТЬNULL(ДополнительнаяИнформация.ФактическаяДатаОплатыАФМ, ДАТАВРЕМЯ(1, 1, 1)) КАК ФактическаяДатаОплатыАФМ,
	        |	ЕСТЬNULL(ДополнительнаяИнформация.ДопКолонка1, ЗНАЧЕНИЕ(ПланВидовХарактеристик.Renault_ДополнительныеПоляАвтосклад.ПустаяСсылка)) КАК ДопКолонка1,
	        |	ЕСТЬNULL(ДополнительнаяИнформация.ДопКолонка2, ЗНАЧЕНИЕ(ПланВидовХарактеристик.Renault_ДополнительныеПоляАвтосклад.ПустаяСсылка)) КАК ДопКолонка2,
	        |	ЕСТЬNULL(ДополнительнаяИнформация.ДопКолонка3, ЗНАЧЕНИЕ(ПланВидовХарактеристик.Renault_ДополнительныеПоляАвтосклад.ПустаяСсылка)) КАК ДопКолонка3,
	        |	ЕСТЬNULL(ДополнительнаяИнформация.ДопКолонка4, ЗНАЧЕНИЕ(ПланВидовХарактеристик.Renault_ДополнительныеПоляАвтосклад.ПустаяСсылка)) КАК ДопКолонка4,
	        |	ЕСТЬNULL(ДополнительнаяИнформация.ДопКолонка5, ЗНАЧЕНИЕ(ПланВидовХарактеристик.Renault_ДополнительныеПоляАвтосклад.ПустаяСсылка)) КАК ДопКолонка5,
	        |	ЕСТЬNULL(ДополнительнаяИнформация.ДопКолонка6, ЗНАЧЕНИЕ(ПланВидовХарактеристик.Renault_ДополнительныеПоляАвтосклад.ПустаяСсылка)) КАК ДопКолонка6,
	        |	ЕСТЬNULL(ДополнительнаяИнформация.ДопКолонка7, ЗНАЧЕНИЕ(ПланВидовХарактеристик.Renault_ДополнительныеПоляАвтосклад.ПустаяСсылка)) КАК ДопКолонка7,
	        |	ЕСТЬNULL(ДополнительнаяИнформация.ДопКолонка8, ЗНАЧЕНИЕ(ПланВидовХарактеристик.Renault_ДополнительныеПоляАвтосклад.ПустаяСсылка)) КАК ДопКолонка8,
	        |	ЕСТЬNULL(ДополнительнаяИнформация.ДопКолонка9, ЗНАЧЕНИЕ(ПланВидовХарактеристик.Renault_ДополнительныеПоляАвтосклад.ПустаяСсылка)) КАК ДопКолонка9,
	        |	ЕСТЬNULL(ДополнительнаяИнформация.ДопКолонка10, ЗНАЧЕНИЕ(ПланВидовХарактеристик.Renault_ДополнительныеПоляАвтосклад.ПустаяСсылка)) КАК ДопКолонка10,
	        |	ЕСТЬNULL(ДополнительнаяИнформация.ЦенаФиксирована, ЛОЖЬ) КАК ЦенаФиксирована,
	        |	ДополнительнаяИнформация.АвтоОплаченАФМ КАК АвтоОплаченАФМ1,
	        |	ИнформацияПоАвтомобилям.VIN,
	        |	ИнформацияПоАвтомобилям.MADPrev,
	        |	ИнформацияПоАвтомобилям.Модель,
	        |	ИнформацияПоАвтомобилям.Версия,
	        |	ИнформацияПоАвтомобилям.Цвет,
	        |	ИнформацияПоАвтомобилям.МодельАртикул,
	        |	ИнформацияПоАвтомобилям.ВерсияАртикул,
	        |	ИнформацияПоАвтомобилям.ЦветАртикул,
	        |	ИнформацияПоАвтомобилям.ТипПрисутствияВРегистрах,
	        |	ИнформацияПоАвтомобилям.НаОстаткахДилера,
	        |	ИнформацияПоАвтомобилям.АФМ_ТипКлиентаDistri,
	        |	ИнформацияПоАвтомобилям.АФМ_СтатусАвтомобиля,
	        |	ИнформацияПоАвтомобилям.АФМ_ДатаОплатыДилеромФакт,
	        |	ИнформацияПоАвтомобилям.АФМ_СоставОпций,
	        |	ИнформацияПоАвтомобилям.АФМ_ГодВыпуска,
	        |	ИнформацияПоАвтомобилям.АФМ_НаличиеПТС,
	        |	ИнформацияПоАвтомобилям.АФМ_Блокировка,
	        |	ИнформацияПоАвтомобилям.АФМ_ДатаДСА,
	        |	ИнформацияПоАвтомобилям.АФМ_ДатаОтгрузкиПланФакт,
	        |	ИнформацияПоАвтомобилям.АФМ_ДатаОтгрузкиОбещ,
	        |	ИнформацияПоАвтомобилям.АФМ_ДатаПроизводстваПланФакт,
	        |	ИнформацияПоАвтомобилям.АФМ_ЦветМеталлик,
	        |	ИнформацияПоАвтомобилям.АФМ_КодРадио,
	        |	ИнформацияПоАвтомобилям.ЦенаПродажиБазаТариф,
	        |	ИнформацияПоАвтомобилям.ЦенаПродажиОпции,
	        |	ИнформацияПоАвтомобилям.ЦенаПродажиДопОборудования,
	        |	ЕСТЬNULL(УчетПродажОстатков.ЦенаПродажи, ИнформацияПоАвтомобилям.ЦенаПродажиАвтомобиля) КАК ЦенаПродажиАвтомобиля,
	        |	ИнформацияПоАвтомобилям.ЦенаЗакупкиБаза,
	        |	ИнформацияПоАвтомобилям.ЦенаЗакупкиОпции,
	        |	ИнформацияПоАвтомобилям.ЦенаЗакупкиАвтомобиля,
	        |	ИнформацияПоАвтомобилям.АФМ_НомерТТН,
	        |	ИнформацияПоАвтомобилям.СкладДилера,
	        |	ИнформацияПоАвтомобилям.ПарковочноеМесто,
	        |	ИнформацияПоАвтомобилям.АФМ_СчетчикНД,
	        |	ИнформацияПоАвтомобилям.АФМ_ДатаОбновленияДанныхНД,
	        |	ИнформацияПоАвтомобилям.АФМ_МаксимумСчетчикаНД,
	        |	ИнформацияПоАвтомобилям.АФМ_ГруппаНД,
	        |	ИнформацияПоАвтомобилям.АФМ_ЗонаРискаНД,
	        |	ИнформацияПоАвтомобилям.ДатаПартии,
	        |	ИнформацияПоАвтомобилям.BIR,
	        |	ИнформацияПоАвтомобилям.ТолькоДоговорБезАвтомобиля,
	        |	ИнформацияПоАвтомобилям.ДоговорНаАвансСсылка,
	        |	ИнформацияПоАвтомобилям.SedreNum,
	        |	ИнформацияПоАвтомобилям.СкладАФМ,
	        |	ИнформацияПоАвтомобилям.ЦенаЗакупкиДоставка,
	        |	ИнформацияПоАвтомобилям.ЦенаЗакупкиСкидка,
	        |	ИнформацияПоАвтомобилям.АФМ_КонтрольнаяДатаОплаты,
	        |	ИнформацияПоАвтомобилям.АФМ_КритическаяДатаОплаты,
	        |	ИнформацияПоАвтомобилям.АФМ_НомерОрдераDistri,
	        |	ИнформацияПоАвтомобилям.Идентификатор,
	        |	ИнформацияПоАвтомобилям.АФМ_ТипАвтомобиля,
	        |	ИнформацияПоАвтомобилям.НаименованияОпций,
	        |	ИнформацияПоАвтомобилям.НомерТН,
	        |	ИнформацияПоАвтомобилям.АФМ_КодОбивки,
	        |	ИнформацияПоАвтомобилям.АФМ_ОписаниеБлокировки,
	        |	ИнформацияПоАвтомобилям.АФМ_ДатаАктуальностиСтроки,
	        |	ИнформацияПоАвтомобилям.АФМ_РасшифровкаСкидкиДилера,
	        |	ИнформацияПоАвтомобилям.АФМ_ТарифОтгрузки,
	        |	ИнформацияПоАвтомобилям.СебестоимостьПоТН,
	        |	ИнформацияПоАвтомобилям.АФМ_ТипФактуры,
	        |	ИнформацияПоАвтомобилям.Скрывать,
	        |	ИнформацияПоАвтомобилям.АрхивныйVIN,
	        |	ИнформацияПоАвтомобилям.DATEOFSALE,
	        |	ИнформацияПоАвтомобилям.CLIENTTYPE,
	        |	ИнформацияПоАвтомобилям.DATE_ARA,
	        |	ИнформацияПоАвтомобилям.NAMECL1,
	        |	ИнформацияПоАвтомобилям.РабочийЛист,ИнформацияПоАвтомобилям.АФМ_ДатаОплатыДилеромФакт,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ЗаконтрактованныеАвтомобили.АвтомобильЗаконтрактован, ЛОЖЬ)
	        |				ИЛИ ЕСТЬNULL(ИнформацияПоАвтомобилям.РабочийЛист, 0) > 0
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ КАК ЗакрепленЗаКлиентомВDMS,
	        |	ЕСТЬNULL(ОплатаПоДоговорам.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОплаты,
	        |	ЕСТЬNULL(ОплатаПоДоговорам.СуммаОплаты, 0) КАК СуммаОплаты,
	        |	ИнформацияПоАвтомобилям.ЗакрепленоЗаКлиентомВDistri,
	        |	ЕСТЬNULL(ДополнительнаяИнформация.ЦветВыделенияСтрокиДляВсех, """") КАК ЦветВыделенияСтрокиДляВсех,
	        |	ВЫБОР
	        |		КОГДА ИнформацияПоАвтомобилям.АФМ_ДатаОплатыДилеромФакт = ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК ОплаченПроизводителюПоДаннымАФМ,
	        |	ВЫБОР
	        |		КОГДА ИнформацияПоАвтомобилям.АФМ_СтатусАвтомобиля = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыАвтомобилей.ВпутиКДилеру)
	        |				ИЛИ ИнформацияПоАвтомобилям.АФМ_СтатусАвтомобиля = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыАвтомобилей.ДоставленДилеру)
	        |				ИЛИ ИнформацияПоАвтомобилям.АФМ_СтатусАвтомобиля = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыАвтомобилей.ВыданКлиенту)
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ КАК АвтомобильОтгруженАФМ,
	        |	ЕСТЬNULL(ОформленныеВыдачи.ДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВыдачи,
	        |	ИнформацияПоАвтомобилям.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	        |	ИнформацияПоАвтомобилям.ACCESSORIES,
	        |	ИнформацияПоАвтомобилям.PRICE_ACCESSORIES,
	        |	ИнформацияПоАвтомобилям.DATE_ACCESSORIES_UNBLOCK,
	        |	ИнформацияПоАвтомобилям.ПодтвержденныйАдресОтгрузки,
	        |	ИнформацияПоАвтомобилям.VAZNumOrder,
	        |	ИнформацияПоАвтомобилям.E_PTS,
	        |	ИнформацияПоАвтомобилям.УточненнаяДатаСборки,
	        |	ИнформацияПоАвтомобилям.ДатаСварки,
	        |	ИнформацияПоАвтомобилям.ДатаСходасКонвейера,
	        |	ИнформацияПоАвтомобилям.ДатаПередачиВЦехОтгрузки,
	        |	ИнформацияПоАвтомобилям.TENDER_NO,
	        |	ИнформацияПоАвтомобилям.TENDER_CLIENT,
			|   Renault_ПлатноеХранениеАвтоНаСкладе.ОплачиваемыхДней как ОплачиваемыхДней,
			|   Renault_ПлатноеХранениеАвтоНаСкладе.ВсегоДнейНаСкладе как ВсегоДнейНаСкладе
	        |ПОМЕСТИТЬ мДанныеВывода
	        |ИЗ
	        |	ИнформацияПоАвтомобилям КАК ИнформацияПоАвтомобилям
	        |		ЛЕВОЕ СОЕДИНЕНИЕ УчетПродажОстатков КАК УчетПродажОстатков
	        |		ПО ИнформацияПоАвтомобилям.Автомобиль = УчетПродажОстатков.Автомобиль
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ОформленныеВыдачи КАК ОформленныеВыдачи
	        |		ПО ИнформацияПоАвтомобилям.Автомобиль = ОформленныеВыдачи.Автомобиль
	        |		ЛЕВОЕ СОЕДИНЕНИЕ УтвержденныеРезервы КАК УтвержденныеРезервы
	        |		ПО ИнформацияПоАвтомобилям.Автомобиль = УтвержденныеРезервы.Автомобиль
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ЗаявкиНаРезерв КАК ЗаявкиНаРезерв
	        |		ПО ИнформацияПоАвтомобилям.Автомобиль = ЗаявкиНаРезерв.Автомобиль
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ЗаявкиНаРезервСотрудников КАК ЗаявкиНаРезервСотрудников
	        |		ПО ИнформацияПоАвтомобилям.Автомобиль = ЗаявкиНаРезервСотрудников.Автомобиль
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ЗаконтрактованныеАвтомобили КАК ЗаконтрактованныеАвтомобили
	        |		ПО ИнформацияПоАвтомобилям.Автомобиль = ЗаконтрактованныеАвтомобили.Автомобиль
	        |			И (ЗаконтрактованныеАвтомобили.VIN <> """")
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ПользовательскаяИнформация КАК ПользовательскаяИнформация
	        |		ПО ИнформацияПоАвтомобилям.Автомобиль = ПользовательскаяИнформация.Автомобиль
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ПоследниеПеремещенияАвто КАК ПоследниеПеремещенияАвто
	        |		ПО ИнформацияПоАвтомобилям.Автомобиль = ПоследниеПеремещенияАвто.Автомобиль
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ЗаявкиНаРезервКлиентКорп КАК ЗаявкиНаРезервКлиентКорп
	        |		ПО ИнформацияПоАвтомобилям.Автомобиль = ЗаявкиНаРезервКлиентКорп.Автомобиль
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ДополнительнаяИнформация КАК ДополнительнаяИнформация
	        |		ПО ИнформацияПоАвтомобилям.Автомобиль = ДополнительнаяИнформация.Автомобиль
	        |			И ИнформацияПоАвтомобилям.ЗаказНаПроизводство = ДополнительнаяИнформация.ЗаказНаПроизводство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ОплатаПоДоговорам КАК ОплатаПоДоговорам
	        |		ПО ИнформацияПоАвтомобилям.Автомобиль = ОплатаПоДоговорам.Автомобиль
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ПлатноеХранениеАвтоНаСкладе КАК Renault_ПлатноеХранениеАвтоНаСкладе 
	    	|			ПО ИнформацияПоАвтомобилям.VIN = Renault_ПлатноеХранениеАвтоНаСкладе.VIN и ИнформацияПоАвтомобилям.BIR = Renault_ПлатноеХранениеАвтоНаСкладе.BIR	
	        |ГДЕ
	        |	(&ПоказыватьВыданныеАвтомобили
	        |			ИЛИ НЕ ЕСТЬNULL(ОформленныеВыдачи.ОформленаВыдача, ЛОЖЬ)
	        |				И (НЕ ЕСТЬNULL(УчетПродажОстатков.ОформленаРеализация, ЛОЖЬ)
	        |					ИЛИ НЕ &УчитыватьРеализацииКакВыдачи))
	        |	И (&ПоказыватьЗарезервированные
	        |			ИЛИ НЕ ЕСТЬNULL(УтвержденныеРезервы.УтвержденРезерв, ЛОЖЬ))
	        |	И (ОформленныеВыдачи.ДатаВыдачи ЕСТЬ NULL
	        |			ИЛИ ОформленныеВыдачи.ДатаВыдачи >= &ДатаНеПоказыватьВыданныеАвтомобили
	        |			ИЛИ &ДатаНеПоказыватьВыданныеАвтомобили = ДАТАВРЕМЯ(1, 1, 1))
	        |	И (&ПоказыватьНеДляПродажи
	        |			ИЛИ НЕ &ПоказыватьНеДляПродажи
	        |				И НЕ ЕСТЬNULL(ДополнительнаяИнформация.НеДляПродажи, ЛОЖЬ))
	        |	И (ИнформацияПоАвтомобилям.ТолькоДоговорБезАвтомобиля
	        |			ИЛИ ИнформацияПоАвтомобилям.ТипПрисутствияВРегистрах = ""ТолькоДилер""
	        |			ИЛИ (НЕ &ИспользоватьОтборПоСчетам
	        |				ИЛИ ИнформацияПоАвтомобилям.BIR В (&ДоступныеСчета))
	        |				И (НЕ &ИспользоватьОтборПоСкладам
	        |					ИЛИ ИнформацияПоАвтомобилям.СкладДилера В (&ДоступныеСклады)))";
	ВыполнитьЗапрос_(Ложь,Текст,МенеджерВременныхТаблиц,
	VINАвтомобиля, МассивСкладовДилера, BIR_Distri, ПоказыватьЗарезервированные, ПоказыватьЗакрепленныеЗаКлиентом, ПоказыватьВыданныеАвтомобили, ПоказыватьНеДляПродажи, МодельАвтомобиля, ВерсияАвтомобиля, ЦветАвтомобиля, ПоказыватьДоговоры, ДоговорНаАвансСсылка, ДатаНеПоказыватьВыданныеАвтомобили, РежимПодтверждения, СтруктураОтбора);			   
	
	Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	мДанныеВывода.VIN КАК VIN,
			|	ИнформацияПоЗаявкамDistri.ДатаПродажи КАК ДатаПерепродажи,
			|	"""" КАК ИдентификаторСтрокиДоговора,
	        |	ЕСТЬNULL(ИнформацияПоЗаявкамDistri.НомерDevis, """") КАК НомерЗаявкиDistri,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ИнформацияПоЗаявкамDistri.NumCl, """") <> """"
	        |			ТОГДА 1
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК НомерПродажиDistri,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ИнформацияПоЗаявкамDistri.НомерОрдера, """") = """"
	        |			ТОГДА мДанныеВывода.АФМ_НомерОрдераDistri
	        |		ИНАЧЕ ИнформацияПоЗаявкамDistri.НомерОрдера
	        |	КОНЕЦ КАК НомерЗаказаDistri,
	        |	мДанныеВывода.Договор КАК Договор,
	        |	ЛОЖЬ КАК Метка,
	        |	ЕСТЬNULL(ИнформацияПоЗаявкамDistri.NumCl, """") КАК НомерКлиентскойЗаявки,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ИнформацияПоЗаявкамDistri.ДатаПродажи, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК ПродажаВнесена,
	        |	ИнформацияПоЗаявкамDistri.НомерОрдера КАК НомерОрдера,
	        |	ИнформацияПоЗаявкамDistri.НомерDevis КАК НомерЗапроса,
	        |	ИнформацияПоЗаявкамDistri.НомерDMS КАК НомерЗаявки,
	        |	ИнформацияПоЗаявкамDistri.ДатаСозданияЗаявки КАК ДатаСозданияЗаявки
			|ПОМЕСТИТЬ мИнформацияПоЗаявкам
	        |ИЗ
	        |	мДанныеВывода КАК мДанныеВывода
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |			DMS_ЗаявкаНаАвтомобиль.НомерDevis КАК НомерDevis,
	        |			DMS_ЗаявкаНаАвтомобиль.ДатаПродажи КАК ДатаПродажи,
	        |			DMS_ЗаявкаНаАвтомобиль.НомерОрдера КАК НомерОрдера,
	        |			DMS_ЗаявкаНаАвтомобиль.NumCl КАК NumCl,
	        |			DMS_ЗаявкаНаАвтомобиль.НомерDMS КАК НомерDMS,
	        |			DMS_ЗаявкаНаАвтомобиль.ДатаСозданияЗаявки КАК ДатаСозданияЗаявки,
	        |			DMS_ЗаявкаНаАвтомобиль.VIN КАК VIN,
	        |			DMS_ЗаявкаНаАвтомобиль.ДоговорКП КАК ДоговорКП,
	        |			DMS_ЗаявкаНаАвтомобиль.BIR КАК BIR,
	        |			DMS_ЗаявкаНаАвтомобиль.Аннулирована КАК Аннулирована,
	        |			DMS_ЗаявкаНаАвтомобиль.ПометкаУдаления КАК ПометкаУдаления
	        |		ИЗ
	        |			Документ.DMS_ЗаявкаНаАвтомобиль КАК DMS_ЗаявкаНаАвтомобиль) КАК ИнформацияПоЗаявкамDistri
	        |		ПО мДанныеВывода.Автомобиль.VIN = ИнформацияПоЗаявкамDistri.VIN
	        |			И (ИнформацияПоЗаявкамDistri.VIN <> """")
	        |			И (ИнформацияПоЗаявкамDistri.Аннулирована = ЛОЖЬ)
	        |			И (ИнформацияПоЗаявкамDistri.ПометкаУдаления = ЛОЖЬ)
	        |			И (ИнформацияПоЗаявкамDistri.НомерDMS В
	        |				(ВЫБРАТЬ
	        |					МАКСИМУМ(ЗаявкаНаАвтомобиль1.НомерDMS)
	        |				ИЗ
	        |					Документ.DMS_ЗаявкаНаАвтомобиль КАК ЗаявкаНаАвтомобиль1
	        |				ГДЕ
	        |					ЗаявкаНаАвтомобиль1.VIN = ИнформацияПоЗаявкамDistri.VIN
	        |					И ЗаявкаНаАвтомобиль1.BIR = ИнформацияПоЗаявкамDistri.BIR и ИнформацияПоЗаявкамDistri.BIR <> """"))
	        |ГДЕ
	        |	(&ПоказыватьЗакрепленныеЗаКлиентом
	        |			ИЛИ НЕ &ПоказыватьЗакрепленныеЗаКлиентом
	        |				И НЕ мДанныеВывода.ЗакрепленЗаКлиентомВDMS)";
	ВыполнитьЗапрос_(Ложь,Текст,МенеджерВременныхТаблиц,
	VINАвтомобиля, МассивСкладовДилера, BIR_Distri, ПоказыватьЗарезервированные, ПоказыватьЗакрепленныеЗаКлиентом, ПоказыватьВыданныеАвтомобили, ПоказыватьНеДляПродажи, МодельАвтомобиля, ВерсияАвтомобиля, ЦветАвтомобиля, ПоказыватьДоговоры, ДоговорНаАвансСсылка, ДатаНеПоказыватьВыданныеАвтомобили, РежимПодтверждения, СтруктураОтбора);			   
	
	Текст = "ВЫБРАТЬ
	|	мИнформацияПоЗаявкам.VIN,
	|	мИнформацияПоЗаявкам.ДатаПерепродажи,
	|	мИнформацияПоЗаявкам.ИдентификаторСтрокиДоговора,
	|	мИнформацияПоЗаявкам.Договор,
	|	мИнформацияПоЗаявкам.НомерКлиентскойЗаявки КАК НомерКлиентскойЗаявки,
	|	мИнформацияПоЗаявкам.ПродажаВнесена КАК ПродажаВнесена,
	|	мИнформацияПоЗаявкам.НомерОрдера КАК НомерОрдера,
	|	мИнформацияПоЗаявкам.НомерЗапроса КАК НомерЗапроса,
	|	мИнформацияПоЗаявкам.НомерЗаявки КАК НомерЗаявки, 
	|	мИнформацияПоЗаявкам.ДатаСозданияЗаявки КАК ДатаСозданияЗаявки
	|ПОМЕСТИТЬ ИнформацияПоЗаявкам
	|ИЗ
	|	мИнформацияПоЗаявкам КАК мИнформацияПоЗаявкам
	|		
	|";
	ВыполнитьЗапрос_(Ложь,Текст,МенеджерВременныхТаблиц,
	VINАвтомобиля, МассивСкладовДилера, BIR_Distri, ПоказыватьЗарезервированные, ПоказыватьЗакрепленныеЗаКлиентом, ПоказыватьВыданныеАвтомобили, ПоказыватьНеДляПродажи, МодельАвтомобиля, ВерсияАвтомобиля, ЦветАвтомобиля, ПоказыватьДоговоры, ДоговорНаАвансСсылка, ДатаНеПоказыватьВыданныеАвтомобили, РежимПодтверждения, СтруктураОтбора);			   
	
	Если ИспользоватьТиповойДО Тогда
		Текст = "ВЫБРАТЬ
		        |	ДляОтбора.Автомобиль КАК Автомобиль,
		        |	СУММА(ЕСТЬNULL(КомплектацияАвтомобилейОстаткиИОбороты.СуммаПриход, 0)) КАК СуммаПриход,
		        |	0 КАК СуммаПродажиПриход
		        |ПОМЕСТИТЬ ВТЗаказНаряды
		        |ИЗ
		        |	ДляОтбора КАК ДляОтбора
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.КомплектацияАвтомобилей.ОстаткиИОбороты(, , Регистратор, , ) КАК КомплектацияАвтомобилейОстаткиИОбороты
		        |		ПО ДляОтбора.Автомобиль = КомплектацияАвтомобилейОстаткиИОбороты.Автомобиль
		        |			И (КомплектацияАвтомобилейОстаткиИОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд)
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ДляОтбора.Автомобиль
		        |
		        |ОБЪЕДИНИТЬ ВСЕ
		        |
		        |ВЫБРАТЬ
		        |	ДляОтбора.Автомобиль,
		        |	0,
		        |	СУММА(ЗаказНаряд.СуммаНоменклатурыДокумента + ВЫБОР
		        |			КОГДА &ТипПрисоединенияИзНоменклатурыИРабот
		        |				ТОГДА ЗаказНаряд.СуммаРаботДокумента
		        |			ИНАЧЕ 0
		        |		КОНЕЦ)
		        |ИЗ
		        |	ДляОтбора КАК ДляОтбора
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд КАК ЗаказНаряд
		        |		ПО ДляОтбора.Автомобиль = ЗаказНаряд.Автомобиль
		        |			И (ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт))
		        |			И (ЗаказНаряд.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.КомплектацияАвтомобиля))
		        |			И (ЗаказНаряд.Проведен)
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ДляОтбора.Автомобиль
		        |
		        |ОБЪЕДИНИТЬ ВСЕ
		        |
		        |ВЫБРАТЬ
		        |	ДляОтбора.Автомобиль,
		        |	0,
		        |	СУММА(ЗаказНаряд.СуммаНоменклатурыДокумента + ВЫБОР
		        |			КОГДА &ТипПрисоединенияИзНоменклатурыИРабот
		        |				ТОГДА ЗаказНаряд.СуммаРаботДокумента
		        |			ИНАЧЕ 0
		        |		КОНЕЦ)
		        |ИЗ
		        |	ДляОтбора КАК ДляОтбора
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд КАК ЗаказНаряд
		        |		ПО ДляОтбора.Автомобиль = ЗаказНаряд.Автомобиль
		        |			И (ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен))
		        |			И (ЗаказНаряд.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.КомплектацияАвтомобиля))
		        |			И (НЕ ЗаказНаряд.ПометкаУдаления)
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ДляОтбора.Автомобиль
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ВТЗаказНаряды.Автомобиль,
		        |	СУММА(ВТЗаказНаряды.СуммаПриход) КАК СуммаПриход,
		        |	СУММА(ВТЗаказНаряды.СуммаПродажиПриход) КАК СуммаПродажиПриход
		        |ПОМЕСТИТЬ ВТДопОборудованиеАвтомобилей
		        |ИЗ
		        |	ВТЗаказНаряды КАК ВТЗаказНаряды
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ВТЗаказНаряды.Автомобиль";
	Иначе
		    Текст = "ВЫБРАТЬ
		            |	ДляОтбора.Автомобиль КАК Автомобиль,
		            |	СУММА(ЕСТЬNULL(Renault_СтоиомостьУстановленногоОборудованияОстатки.СебестоимостьОстаток, 0)) КАК СуммаПриход,
		            |	0 КАК СуммаПродажиПриход
		            |ПОМЕСТИТЬ ВТЗаявки
		            |ИЗ
		            |	ДляОтбора КАК ДляОтбора
		            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Renault_СтоиомостьУстановленногоОборудования.Остатки(, ) КАК Renault_СтоиомостьУстановленногоОборудованияОстатки
		            |		ПО ДляОтбора.Автомобиль = Renault_СтоиомостьУстановленногоОборудованияОстатки.Автомобиль
		            |
		            |СГРУППИРОВАТЬ ПО
		            |	ДляОтбора.Автомобиль
		            |
		            |ОБЪЕДИНИТЬ ВСЕ
		            |
		            |ВЫБРАТЬ
		            |	ДляОтбора.Автомобиль,
		            |	0,
		            |	СУММА(Renault_CRM_ЗаявкаНаСервис.СуммаЗапчастиВсего + ВЫБОР
		            |			КОГДА &ТипПрисоединенияИзНоменклатурыИРабот
		            |				ТОГДА Renault_CRM_ЗаявкаНаСервис.СуммаРаботВсего
		            |			ИНАЧЕ 0
		            |		КОНЕЦ)
		            |ИЗ
		            |	ДляОтбора КАК ДляОтбора
		            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
		            |		ПО ДляОтбора.Автомобиль = Renault_CRM_ЗаявкаНаСервис.Автомобиль
		            |			И (Renault_CRM_ЗаявкаНаСервис.СтатусПодготовкиКПродаже = ЗНАЧЕНИЕ(Перечисление.Renault_СтатусыЗаявкиНаПрепродажнуюПодготовку.Выполнена))
		            |			И (Renault_CRM_ЗаявкаНаСервис.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.КомплектацияАвтомобиля))
		            |			И (Renault_CRM_ЗаявкаНаСервис.Проведен)
		            |
		            |СГРУППИРОВАТЬ ПО
		            |	ДляОтбора.Автомобиль
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |ВЫБРАТЬ
		            |	ВТЗаявки.Автомобиль,
		            |	СУММА(ВТЗаявки.СуммаПриход) КАК СуммаПриход,
		            |	СУММА(ВТЗаявки.СуммаПродажиПриход) КАК СуммаПродажиПриход
		            |ПОМЕСТИТЬ ВТДопОборудованиеАвтомобилей
		            |ИЗ
		            |	ВТЗаявки КАК ВТЗаявки
		            |
		            |СГРУППИРОВАТЬ ПО
		            |	ВТЗаявки.Автомобиль";

	КонецЕсли;
	
	ВыполнитьЗапрос_(Ложь,Текст,МенеджерВременныхТаблиц,
	VINАвтомобиля, МассивСкладовДилера, BIR_Distri, ПоказыватьЗарезервированные, ПоказыватьЗакрепленныеЗаКлиентом, ПоказыватьВыданныеАвтомобили, ПоказыватьНеДляПродажи, МодельАвтомобиля, ВерсияАвтомобиля, ЦветАвтомобиля, ПоказыватьДоговоры, ДоговорНаАвансСсылка, ДатаНеПоказыватьВыданныеАвтомобили, РежимПодтверждения, СтруктураОтбора);
	
	Текст = "ВЫБРАТЬ
	        |	мДанныеВывода.Автомобиль КАК Автомобиль,
	        |	мДанныеВывода.Модель КАК Модель,
	        |	мДанныеВывода.Версия КАК Версия,
	        |	мДанныеВывода.Цвет КАК Цвет,
	        |	мДанныеВывода.АФМ_ГодВыпуска КАК ГодВыпуска,
	        |	ВЫРАЗИТЬ(мДанныеВывода.АФМ_СоставОпций КАК СТРОКА(100)) КАК СоставОпций,
	        |	мДанныеВывода.ТипПрисутствияВРегистрах КАК ТипПрисутствияВРегистрах,
	        |	ВЫБОР
	        |		КОГДА мДанныеВывода.УчтенУДилера
	        |			ТОГДА ВЫРАЗИТЬ(""УчтенУДилера"" КАК СТРОКА(20))
	        |		ИНАЧЕ ВЫРАЗИТЬ(""НеУчтенУДилера"" КАК СТРОКА(20))
	        |	КОНЕЦ КАК УчетНаОстаткахДилера,
	        |	ВЫРАЗИТЬ(мДанныеВывода.Модель.Артикул КАК СТРОКА(20)) КАК МодельАртикулСпр,
	        |	ВЫРАЗИТЬ(мДанныеВывода.Версия.Артикул КАК СТРОКА(20)) КАК ВерсияАртикулСпр,
	        |	ВЫРАЗИТЬ(мДанныеВывода.Цвет.Артикул КАК СТРОКА(20)) КАК ЦветАртикулСпр,
	        |	мДанныеВывода.VIN КАК VIN,
	        |	мДанныеВывода.ЗакрепленоЗаКлиентомВDistri КАК ЗакрепленоЗаКлиентомВDistri,
	        |	ВЫБОР
	        |		КОГДА мДанныеВывода.АФМ_ДатаОплатыДилеромФакт = ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК ОплаченПроизводителюПоДаннымАФМ,
	        |	мДанныеВывода.НаОстаткахДилера КАК НаОстаткахДилера,
	        |	мДанныеВывода.ОформленаРеализация КАК ОформленаРеализация,
	        |	мДанныеВывода.ОформленаВыдача КАК ОформленаВыдача,
	        |	ВЫБОР
	        |		КОГДА мДанныеВывода.ОформленаРеализация
	        |				И НЕ мДанныеВывода.ОформленаВыдача
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ КАК ОформленаРеализацияБезВыдачи,
	        |	мДанныеВывода.ЗаявленРезерв КАК ЗаявленРезерв,
	        |	мДанныеВывода.ИдентификаторРезерваЗаявка КАК ИдентификаторРезерваЗаявка,
	        |	мДанныеВывода.КорпКлиентРезерв КАК КорпКлиентРезерв,
	        |	мДанныеВывода.УтвержденРезерв КАК УтвержденРезерв,
	        |	мДанныеВывода.НомерРЛ КАК РабочийЛист,
	        |	ВЫБОР
	        |		КОГДА мДанныеВывода.ТолькоДоговорБезАвтомобиля
	        |			ТОГДА ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыАвтомобилей.ЗаказВПроизводство)
	        |		КОГДА мДанныеВывода.ОформленаВыдача
	        |				ИЛИ мДанныеВывода.ОформленаРеализация
	        |					И &УчитыватьРеализацииКакВыдачи
	        |			ТОГДА ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыАвтомобилей.ВыданКлиенту)
	        |		КОГДА мДанныеВывода.НаОстаткахДилера
	        |			ТОГДА ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыАвтомобилей.ДоставленДилеру)
	        |		ИНАЧЕ мДанныеВывода.АФМ_СтатусАвтомобиля
	        |	КОНЕЦ КАК СтатусАвтомобиля,
	        |	мДанныеВывода.АФМ_НаличиеПТС КАК НаличиеПТС,
	        |	мДанныеВывода.АФМ_Блокировка КАК Блокировка,
	        |	мДанныеВывода.МодельАртикул КАК МодельАртикул,
	        |	мДанныеВывода.ВерсияАртикул КАК ВерсияАртикул,
	        |	мДанныеВывода.ЦветАртикул КАК ЦветАртикул,
	        |	ВЫБОР
	        |		КОГДА мДанныеВывода.ОформленаВыдача
	        |				ИЛИ мДанныеВывода.ОформленаРеализация
	        |			ТОГДА 0
	        |		КОГДА мДанныеВывода.НаОстаткахДилера
	        |			ТОГДА 6 + (ВЫРАЗИТЬ(ЕСТЬNULL(РАЗНОСТЬДАТ(мДанныеВывода.ДатаПартии, &ТекущаяДата, ДЕНЬ), 0) КАК ЧИСЛО))
	        |		КОГДА мДанныеВывода.ТолькоДоговорБезАвтомобиля
	        |			ТОГДА 99999
	        |		КОГДА мДанныеВывода.АФМ_СтатусАвтомобиля = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыАвтомобилей.ВыданКлиенту)
	        |			ТОГДА 0
	        |		КОГДА мДанныеВывода.АФМ_СтатусАвтомобиля = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыАвтомобилей.ВПроизводстве)
	        |			ТОГДА 1
	        |		КОГДА мДанныеВывода.АФМ_СтатусАвтомобиля = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыАвтомобилей.ВПути)
	        |			ТОГДА 2
	        |		КОГДА мДанныеВывода.АФМ_СтатусАвтомобиля = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыАвтомобилей.НаСкладеАФМ)
	        |			ТОГДА 3
	        |		КОГДА мДанныеВывода.АФМ_СтатусАвтомобиля = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыАвтомобилей.ВПутиКДилеру)
	        |			ТОГДА 5
	        |		КОГДА мДанныеВывода.АФМ_СтатусАвтомобиля = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыАвтомобилей.ДоставленДилеру)
	        |			ТОГДА 6
	        |		ИНАЧЕ 99999
	        |	КОНЕЦ КАК Порядок,
	        |	мДанныеВывода.АФМ_ДатаДСА КАК ДатаДСАПланФакт,
	        |	мДанныеВывода.АФМ_ДатаОтгрузкиОбещ КАК ДатаОтгрузкиОбещ,
	        |	мДанныеВывода.АФМ_ДатаОтгрузкиПланФакт КАК ДатаОтгрузкиПланФакт,
	        |	мДанныеВывода.АФМ_ДатаПроизводстваПланФакт КАК ДатаПроизводстваПланФакт,
	        |	мДанныеВывода.Примечание КАК Примечание,
	        |	мДанныеВывода.ПримечаниеРОП КАК ПримечаниеРОП,
	        |	мДанныеВывода.ЦенаПродажиРОП КАК ЦенаПродажиРОП,
	        |	мДанныеВывода.ЦветВыделенияСтроки КАК ЦветВыделенияСтроки,
	        |	мДанныеВывода.Модель.НаименованиеПолное КАК МодельНаименованиеПолное,
	        |	мДанныеВывода.Версия.НаименованиеПолное КАК ВерсияНаименованиеПолное,
	        |	мДанныеВывода.Цвет.Наименование КАК ЦветНаименование,
	        |	мДанныеВывода.АФМ_ЦветМеталлик КАК ЦветМеталлик,
	        |	мДанныеВывода.АФМ_КодРадио КАК КодРадио,
	        |	мДанныеВывода.ЦенаПродажиБазаТариф,
	        |	мДанныеВывода.ЦенаПродажиОпции КАК ЦенаПродажиОпции,
	        |	мДанныеВывода.ЦенаПродажиДопОборудования КАК ЦенаПродажиДопОборудования,
	        |	мДанныеВывода.ЦенаПродажиАвтомобиля КАК ЦенаПродажиАвтомобиля,
	        |	мДанныеВывода.ЦенаЗакупкиБаза КАК ЦенаЗакупкиБаза,
	        |	мДанныеВывода.ЦенаЗакупкиОпции КАК ЦенаЗакупкиОпции,
	        |	мДанныеВывода.ЦенаЗакупкиАвтомобиля КАК ЦенаЗакупкиАвтомобиля,
	        |	мДанныеВывода.ПлановаяДатаОплатыАФМ КАК ПлановаяДатаОплатыАФМ,
	        |	мДанныеВывода.ЗакрепленЗаКлиентомВDMS КАК ЗакрепленЗаКлиентомВDMS,
	        |	ВЫБОР
	        |		КОГДА мДанныеВывода.ЗакрепленоЗаКлиентомВDistri
	        |				И НЕ мДанныеВывода.ЗакрепленЗаКлиентомВDMS
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ КАК ЗакрепитьЗаКлиентомВDMS,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(мДанныеВывода.ЦветВыделенияСтроки, """") = """"
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК СтрокаВыделена,
	        |	мДанныеВывода.АФМ_ТипКлиентаDistri КАК ТипКлиентаDistri,
	        |	мДанныеВывода.АФМ_НомерТТН КАК НомерТТН,
	        |	мДанныеВывода.ЦенаПродажиБазаТариф + мДанныеВывода.ЦенаПродажиОпции КАК ЦенаПродажиТариф,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(мДанныеВывода.ЦенаПродажиРОП, 0) <> 0
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ КАК ЦенаИзменена,
	        |	мДанныеВывода.МенеджерРезерва КАК МенеджерРезерва,
	        |	мДанныеВывода.СкладДилера КАК СкладДилера,
	        |	мДанныеВывода.ПарковочноеМесто КАК ПарковочноеМесто,
	        |	мДанныеВывода.ЦветВыделенияСтрокиДляВсех КАК ЦветВыделенияСтрокиДляВсех,
	        |	мДанныеВывода.АФМ_СчетчикНД КАК СчетчикНД,
	        |	мДанныеВывода.АФМ_ДатаОбновленияДанныхНД КАК ДатаОбновленияДанныхНД,
	        |	мДанныеВывода.АФМ_МаксимумСчетчикаНД КАК МаксимумСчетчикаНД,
	        |	мДанныеВывода.АФМ_ГруппаНД КАК ГруппаНД,
	        |	мДанныеВывода.АФМ_ЗонаРискаНД КАК ЗонаРискаНД,
	        |	РАЗНОСТЬДАТ(мДанныеВывода.ДатаПартии, &ТекущаяДата, ДЕНЬ) КАК КоличествоДнейНаСкладеДилера,
	        |	мДанныеВывода.НеДляПродажи КАК НеДляПродажи,
	        |	мДанныеВывода.ОплатаАФМСогласована КАК ОплатаАФМСогласована,
	        |	мДанныеВывода.АвтоОплаченАФМ
	        |		ИЛИ мДанныеВывода.ОплаченПроизводителюПоДаннымАФМ КАК АвтоОплаченАФМ,
	        |	ЕСТЬNULL(ДопИнформацияПоДоговорамАвто.КлиентВнесАванс, ЛОЖЬ) КАК КлиентВнесАванс,
	        |	мДанныеВывода.ПТСПолученДилером КАК ПТСПолученДилером,
	        |	ЕСТЬNULL(ДопИнформацияПоДоговорамАвто.КлиентПолностьюОплатилАвто, ЛОЖЬ) КАК КлиентПолностьюОплатилАвто,
	        |	мДанныеВывода.ЗаявленРезерв
	        |		ИЛИ мДанныеВывода.УтвержденРезерв КАК ЕстьЗаявкаНаРезерв,
	        |	мДанныеВывода.ИдентификаторРезерва КАК ИдентификаторРезерва,
	        |	мДанныеВывода.ЕстьЗаявкаНаРезервТекСотрудника КАК ЗаявкаНаРезервТекСотрудника,
	        |	мДанныеВывода.ЦенаЗакупкиДоставка КАК ЦенаЗакупкиДоставка,
	        |	мДанныеВывода.ЦенаЗакупкиСкидка КАК ЦенаЗакупкиСкидка,
	        |	мДанныеВывода.АФМ_КритическаяДатаОплаты КАК КритическаяДатаОплаты,
	        |	мДанныеВывода.ЗакрепленЗаКлиентомВDMS
	        |		И НЕ ЕСТЬNULL(ДопИнформацияПоДоговорамАвто.КлиентПолностьюОплатилАвто, ЛОЖЬ) КАК ЗакрепленВDMSИНеОплаченКл,
	        |	мДанныеВывода.ЗакрепленЗаКлиентомВDMS
	        |		И НЕ(мДанныеВывода.АвтоОплаченАФМ
	        |				ИЛИ мДанныеВывода.ОплаченПроизводителюПоДаннымАФМ) КАК ЗакрепленВDMSИНеОплаченАФМ,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(мДанныеВывода.ПлановаяДатаОплатыАФМ, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	        |				И НЕ (мДанныеВывода.АвтоОплаченАФМ
	        |						ИЛИ мДанныеВывода.ОплаченПроизводителюПоДаннымАФМ) = ИСТИНА
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ КАК ЗапланированКОплатеВАФМ,
	        |	ВЫБОР
	        |		КОГДА НЕ мДанныеВывода.АвтомобильОтгруженАФМ
	        |			ТОГДА ВЫБОР
	        |					КОГДА мДанныеВывода.АФМ_ДатаОтгрузкиПланФакт <> ДАТАВРЕМЯ(1, 1, 1)
	        |						ТОГДА мДанныеВывода.АФМ_ДатаОтгрузкиПланФакт
	        |					ИНАЧЕ мДанныеВывода.АФМ_ДатаОтгрузкиОбещ
	        |				КОНЕЦ
	        |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	        |	КОНЕЦ КАК ДатаОтгрузкиПлановая,
	        |	ВЫБОР
	        |		КОГДА мДанныеВывода.АвтомобильОтгруженАФМ
	        |			ТОГДА мДанныеВывода.АФМ_ДатаОтгрузкиПланФакт
	        |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	        |	КОНЕЦ КАК ДатаОтгрузкиФактическая,
	        |	мДанныеВывода.ДатаОтгрузкиЖелаемая КАК ДатаОтгрузкиЖелаемая,
	        |	мДанныеВывода.АвтомобильОтгруженАФМ КАК АвтомобильОтгруженАФМ,
	        |	ВЫБОР
	        |		КОГДА мДанныеВывода.ДатаОтгрузкиЖелаемая = ДАТАВРЕМЯ(1, 1, 1)
	        |				ИЛИ мДанныеВывода.АвтомобильОтгруженАФМ
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК ЗапланированКОтгрузкеИзАФМ,
	        |	мДанныеВывода.Идентификатор,
	        |	мДанныеВывода.ДилерскийЦентр,
	        |	мДанныеВывода.СкладАФМ,
	        |	мДанныеВывода.ДатаРезерва,
	        |	мДанныеВывода.ПричинаВыкупа,
	        |	мДанныеВывода.ЖелаемаяДатаВыдачи КАК ЖелаемаяДатаПоставки,
	        |	мДанныеВывода.СтатусПредварительныхДокументов,
	        |	мДанныеВывода.СтатусОкончательныхДокументов,
	        |	мДанныеВывода.СкладПТС,
	        |	мДанныеВывода.КлиентРезерва,
	        |	ВЫРАЗИТЬ(мДанныеВывода.BIR КАК СТРОКА(15)) КАК СчетDistri,
	        |	мДанныеВывода.ИдентификаторСтрокиДоговора,
	        |	мДанныеВывода.ДополнительныеЗатратыПоАвто,
	        |	мДанныеВывода.АвтомобильЗаконтрактован,
	        |	мДанныеВывода.ТипАвтомобиля,
	        |	мДанныеВывода.ИнвентарныйНомер,
	        |	мДанныеВывода.НаименованияОпций,
	        |	мДанныеВывода.НомерТН,
	        |	мДанныеВывода.СуммаДоговора КАК ЦенаПоДоговору,
	        |	мДанныеВывода.СуммаАванса,
	        |	мДанныеВывода.ДатаСнятияСРезерва,
	        |	мДанныеВывода.ДатаВыдачи,
	        |	мДанныеВывода.АФМ_КодОбивки КАК КодОбивки,
	        |	мДанныеВывода.АФМ_ОписаниеБлокировки КАК ОписаниеБлокировки,
	        |	мДанныеВывода.АФМ_ДатаАктуальностиСтроки КАК ДатаАктуальностиСтроки,
	        |	мДанныеВывода.АФМ_РасшифровкаСкидкиДилера КАК РасшифровкаСкидкиДилера,
	        |	мДанныеВывода.АФМ_ТарифОтгрузки КАК ТарифОтгрузки,
	        |	мДанныеВывода.СебестоимостьПоТН КАК СебестоимостьПоТН,
	        |	мДанныеВывода.ФактическаяДатаОплатыАФМ,
	        |	мДанныеВывода.АвтоОплаченАФМ КАК АвтоОплаченАФМ1,
	        |	ЕСТЬNULL(ДопИнформацияПоДоговорамАвто.ПлановаяДатаПолнойОплатыКлиентом, ДАТАВРЕМЯ(1, 1, 1)) КАК ПлановаяДатаПолнойОплатыКлиентом,
	        |	мДанныеВывода.АФМ_ТипФактуры КАК ТипФактуры,
	        |	мДанныеВывода.ДопКолонка1,
	        |	мДанныеВывода.ДопКолонка2,
	        |	мДанныеВывода.ДопКолонка3,
	        |	мДанныеВывода.ДопКолонка4,
	        |	мДанныеВывода.ДопКолонка5,
	        |	мДанныеВывода.ДопКолонка6,
	        |	мДанныеВывода.ДопКолонка7,
	        |	мДанныеВывода.ДопКолонка8,
	        |	мДанныеВывода.ДопКолонка9,
	        |	мДанныеВывода.ДопКолонка10,
	        |	мДанныеВывода.ЦенаФиксирована,
	        |	мДанныеВывода.ДатаПоследнегоПеремещения,
	        |	мДанныеВывода.АрхивныйVIN,
	        |	мДанныеВывода.ЦенаПоДоговоруБезОборудования,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(мДанныеВывода.ЦенаПоДоговоруБезОборудования, 0) = 0
	        |			ТОГДА 0
	        |		ИНАЧЕ ЕСТЬNULL(мДанныеВывода.ЦенаПоДоговоруБезОборудования, 0) - ЕСТЬNULL(мДанныеВывода.СебестоимостьПоТН, 0)
	        |	КОНЕЦ КАК МаржаБезУчетаОборудования,
	        |	мДанныеВывода.Реализация,
	        |	мДанныеВывода.АФМ_КонтрольнаяДатаОплаты КАК КонтрольнаяДатаОплаты,
	        |	мДанныеВывода.DATEOFSALE,
	        |	мДанныеВывода.CLIENTTYPE,
	        |	мДанныеВывода.DATE_ARA,
	        |	мДанныеВывода.NAMECL1,
	        |	мДанныеВывода.ДатаОплаты КАК ДатаОплаты,
	        |	мДанныеВывода.СуммаОплаты КАК СуммаОплаты,
	        |	ВЫБОР
	        |		КОГДА ВЫРАЗИТЬ(мДанныеВывода.Договор КАК Документ.Renault_Договор).СтатусДоговора = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан)
	        |			ТОГДА ИСТИНА
	        |		КОГДА ВЫРАЗИТЬ(мДанныеВывода.Договор КАК Документ.Renault_Договор).СтатусДоговора = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыДоговоровНаПродажуАвтомобиля.НаИзменение)
	        |			ТОГДА ИСТИНА
	        |		КОГДА ВЫРАЗИТЬ(мДанныеВывода.Договор КАК Документ.Renault_Договор).СтатусДоговора = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыДоговоровНаПродажуАвтомобиля.НаРасторжение)
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ КАК ПодписанДоговорКП,
	        |	ВЫРАЗИТЬ(мДанныеВывода.Договор КАК Документ.Renault_Договор).ДатаДоговора КАК ДатаДоговораКП,
	        |	ВЫБОР
	        |		КОГДА ВЫРАЗИТЬ(мДанныеВывода.Договор КАК Документ.Renault_Договор).НомерДоговора = """"
	        |			ТОГДА ВЫРАЗИТЬ(мДанныеВывода.Договор КАК Документ.Renault_Договор).Номер
	        |		ИНАЧЕ ВЫРАЗИТЬ(мДанныеВывода.Договор КАК Документ.Renault_Договор).НомерДоговора
	        |	КОНЕЦ КАК НомерДоговораКП,
	        |	ВЫРАЗИТЬ(мДанныеВывода.Договор КАК Документ.Renault_Договор) КАК ДоговорКПСсылка,
	        |	ЕСТЬNULL(ВЫРАЗИТЬ(мДанныеВывода.Договор КАК Документ.Renault_Договор).СтатусПредварительныхДокументов, мДанныеВывода.СтатусПредварительныхДокументов) КАК СтатусПредварительныхДокументов,
	        |	ЕСТЬNULL(ВЫРАЗИТЬ(мДанныеВывода.Договор КАК Документ.Renault_Договор).СтатусОкончательныхДокументов, мДанныеВывода.СтатусОкончательныхДокументов) КАК СтатусОкончательныхДокументов,
	        |	ВЫБОР
	        |		КОГДА мДанныеВывода.АвтомобильЗаконтрактован
	        |				И ВЫРАЗИТЬ(мДанныеВывода.Договор КАК Документ.Renault_Договор).СтатусОкончательныхДокументов = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан)
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ КАК АвтомобильПродан,
	        |	ВЫБОР
	        |		КОГДА мДанныеВывода.АвтомобильЗаконтрактован
	        |				И ВЫРАЗИТЬ(мДанныеВывода.Договор КАК Документ.Renault_Договор).СтатусОкончательныхДокументов = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан)
	        |			ТОГДА ВЫРАЗИТЬ(""Продан"" КАК СТРОКА(15))
	        |		КОГДА мДанныеВывода.АвтомобильЗаконтрактован
	        |			ТОГДА ВЫРАЗИТЬ(""Контракт"" КАК СТРОКА(15))
	        |		КОГДА мДанныеВывода.УтвержденРезерв
	        |			ТОГДА ВЫРАЗИТЬ(""В резерве"" КАК СТРОКА(15))
	        |		КОГДА мДанныеВывода.ЗаявленРезерв
	        |			ТОГДА ВЫРАЗИТЬ(""Заявка на резерв"" КАК СТРОКА(15))
	        |		КОГДА мДанныеВывода.НеДляПродажи
	        |			ТОГДА ВЫРАЗИТЬ(""Не для продажи"" КАК СТРОКА(15))
	        |		КОГДА ИСТИНА
	        |			ТОГДА ВЫРАЗИТЬ(""Свободен"" КАК СТРОКА(15))
	        |	КОНЕЦ КАК СтатусРезерва,
	        |	ВЫРАЗИТЬ(мДанныеВывода.Договор КАК Документ.Renault_Договор).ОсновнаяФормаОплаты КАК ОсновнаяФормаОплаты,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ВЫРАЗИТЬ(мДанныеВывода.Договор КАК Документ.Renault_Договор).ДатаАктаПередачи, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА ВЫРАЗИТЬ(мДанныеВывода.Договор КАК Документ.Renault_Договор).ДатаАктаПередачи
	        |		ИНАЧЕ мДанныеВывода.ДатаРеализации
	        |	КОНЕЦ КАК ДатаАктаПередачи,
	        |	ВЫБОР
	        |		КОГДА ВнесениеИзмененийВДоговор.ПричинаИзменения ЕСТЬ NULL
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК ИзменитьКЗВDistri,
	        |	ЕСТЬNULL(ВнесениеИзмененийВДоговор.ПричинаИзменения, ЗНАЧЕНИЕ(Перечисление.CRM_ПричиныИзмененияДоговоров.ПустаяСсылка)) КАК ПричинаИзмененияКЗ,
	        |	ЕСТЬNULL(ВнесениеИзмененийВДоговор.КомментарийИзменения, """") КАК КомментарийИзмененияКЗ,
	        |	ЕСТЬNULL(ИзмененияАвтосклад.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаЗагрузки,
	        |	ВЫБОР
	        |		КОГДА мДанныеВывода.DATEOFSALE <> ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЕСТЬNULL(ИнформацияПоЗаявкам.ПродажаВнесена, ЛОЖЬ)
	        |	КОНЕЦ КАК ПродажаВнесенаВDistri,
	        |	ВЫБОР
	        |		КОГДА ВЫРАЗИТЬ(мДанныеВывода.Договор КАК Документ.Renault_Договор).СтатусОкончательныхДокументов = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан)
	        |				И НЕ ВЫБОР
	        |						КОГДА мДанныеВывода.DATEOFSALE <> ДАТАВРЕМЯ(1, 1, 1)
	        |							ТОГДА ИСТИНА
	        |						ИНАЧЕ ЕСТЬNULL(ИнформацияПоЗаявкам.ПродажаВнесена, ЛОЖЬ)
	        |					КОНЕЦ
	        |				И мДанныеВывода.VIN <> """"
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ КАК ВнестиПродажуВDistri,
	        |	ВЫБОР
	        |		КОГДА мДанныеВывода.ТолькоДоговорБезАвтомобиля
	        |				И ЕСТЬNULL(ИнформацияПоЗаявкам.НомерОрдера, """") = """"
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ КАК ВнестиЗаказВDistri,
	        |	ВЫБОР
	        |		КОГДА мДанныеВывода.ЗакрепленЗаКлиентомВDMS
	        |				И НЕ мДанныеВывода.ЗакрепленоЗаКлиентомВDistri
	        |				И ЕСТЬNULL(ИнформацияПоЗаявкам.НомерКлиентскойЗаявки, """") = """"
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ КАК ЗакрепитьЗаКлиентомВDistri,
	        |	ЕСТЬNULL(ИнформацияПоЗаявкам.НомерКлиентскойЗаявки, """") КАК НомерЗаявкиDistri,
	        |	ЕСТЬNULL(ИнформацияПоЗаявкам.НомерЗапроса, """") КАК НомерЗапросаDistri,
	        |	ЕСТЬNULL(ИнформацияПоЗаявкам.НомерЗаявки, """") КАК НомерЗаявкиDMS,
	        |	ЕСТЬNULL(ИнформацияПоЗаявкам.ДатаСозданияЗаявки, """") КАК ДатаСозданияЗаявкиDistri,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ИнформацияПоЗаявкам.ПродажаВнесена, ЛОЖЬ) = ИСТИНА
	        |			ТОГДА 1
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК НомерПродажиDistri,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ИнформацияПоЗаявкам.НомерОрдера, """") = """"
	        |			ТОГДА мДанныеВывода.АФМ_НомерОрдераDistri
	        |		ИНАЧЕ ИнформацияПоЗаявкам.НомерОрдера
	        |	КОНЕЦ КАК НомерЗаказаDistri,
	        |	ЕСТЬNULL(ИнформацияПоЗаявкам.ДатаПерепродажи, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаПерепродажи,
	        |	ЕСТЬNULL(Renault_АвтомобилиДопРеквизиты.АвтоПринятоНаСклад, 0) КАК АвтоПринятоНаСклад,
	        |	ЕСТЬNULL(Renault_АвтомобилиДопРеквизиты.ЗамечаниеПриемки, """") КАК ЗамечаниеПриемки,
	        |	ЕСТЬNULL(ВТДопОборудованиеАвтомобилей.СуммаПродажиПриход, 0) КАК СтоимостьДопОборудования,
	        |	ЕСТЬNULL(ВТДопОборудованиеАвтомобилей.СуммаПриход, 0) КАК СебестоимостьДопОборудования,
	        |	мДанныеВывода.МенеджерДоговора,
	        |	мДанныеВывода.Договор,
	        |	мДанныеВывода.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	        |	мДанныеВывода.ACCESSORIES,
	        |	мДанныеВывода.PRICE_ACCESSORIES,
	        |	мДанныеВывода.DATE_ACCESSORIES_UNBLOCK,
	        |	мДанныеВывода.ПодтвержденныйАдресОтгрузки,
	        |	мДанныеВывода.VAZNumOrder,
	        |	мДанныеВывода.MADPrev,
	        |	мДанныеВывода.E_PTS,
	        |	мДанныеВывода.УточненнаяДатаСборки,
	        |	мДанныеВывода.ДатаСварки,
	        |	мДанныеВывода.ДатаСходасКонвейера,
	        |	мДанныеВывода.ДатаПередачиВЦехОтгрузки,
	        |	мДанныеВывода.TENDER_NO,
	        |	мДанныеВывода.TENDER_CLIENT,мДанныеВывода.АФМ_ДатаОплатыДилеромФакт,
			|   мДанныеВывода.ОплачиваемыхДней,
			|   мДанныеВывода.ВсегоДнейНаСкладе
	        |ПОМЕСТИТЬ мТаблицаДанных
	        |ИЗ
	        |	мДанныеВывода КАК мДанныеВывода
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ДопИнформацияПоДоговорамАвто КАК ДопИнформацияПоДоговорамАвто
	        |		ПО мДанныеВывода.Автомобиль = ДопИнформацияПоДоговорамАвто.Автомобиль
	        |			И мДанныеВывода.Договор = ДопИнформацияПоДоговорамАвто.Договор
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ВнесениеИзмененийВДоговор.СрезПоследних КАК ВнесениеИзмененийВДоговор
	        |		ПО (НЕ ВнесениеИзмененийВДоговор.ИзмененияПеренесеныВDistri)
	        |			И ((ВЫРАЗИТЬ(мДанныеВывода.Договор КАК Документ.Renault_Договор)) = ВнесениеИзмененийВДоговор.Договор)
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ИзмененияАвтосклад.СрезПоследних КАК ИзмененияАвтосклад
	        |		ПО мДанныеВывода.VIN = ИзмененияАвтосклад.VIN
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_АвтомобилиДопРеквизиты КАК Renault_АвтомобилиДопРеквизиты
	        |		ПО мДанныеВывода.Автомобиль = Renault_АвтомобилиДопРеквизиты.Автомобиль
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТДопОборудованиеАвтомобилей КАК ВТДопОборудованиеАвтомобилей
	        |		ПО мДанныеВывода.Автомобиль = ВТДопОборудованиеАвтомобилей.Автомобиль
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ИнформацияПоЗаявкам КАК ИнформацияПоЗаявкам
	        |		ПО мДанныеВывода.VIN = ИнформацияПоЗаявкам.VIN
	        |ГДЕ
	        |	(&ПоказыватьЗакрепленныеЗаКлиентом
	        |			ИЛИ НЕ &ПоказыватьЗакрепленныеЗаКлиентом
	        |				И НЕ мДанныеВывода.ЗакрепленЗаКлиентомВDMS)
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	Автомобиль,
	        |	мДанныеВывода.Договор,
	        |	мДанныеВывода.НомерРЛ";
	ВыполнитьЗапрос_(Ложь,Текст,МенеджерВременныхТаблиц,
	VINАвтомобиля, МассивСкладовДилера, BIR_Distri, ПоказыватьЗарезервированные, ПоказыватьЗакрепленныеЗаКлиентом, ПоказыватьВыданныеАвтомобили, ПоказыватьНеДляПродажи, МодельАвтомобиля, ВерсияАвтомобиля, ЦветАвтомобиля, ПоказыватьДоговоры, ДоговорНаАвансСсылка, ДатаНеПоказыватьВыданныеАвтомобили, РежимПодтверждения, СтруктураОтбора);			   
	
	Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	      |	мТаблицаДанных.Автомобиль,
	      |	ВЫБОР
	      |		КОГДА ЕСТЬNULL(Renault_РабочиеЛисты.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.пустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Сотрудники.пустаяСсылка)
	      |			ТОГДА ВЫБОР
	      |					КОГДА ЕСТЬNULL(мТаблицаДанных.МенеджерДоговора, ЗНАЧЕНИЕ(Справочник.Сотрудники.пустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Сотрудники.пустаяСсылка)
	      |						ТОГДА ЕСТЬNULL(мТаблицаДанных.МенеджерРезерва, ЗНАЧЕНИЕ(Справочник.Сотрудники.пустаяСсылка))
	      |					ИНАЧЕ мТаблицаДанных.МенеджерДоговора
	      |				КОНЕЦ
	      |		ИНАЧЕ Renault_РабочиеЛисты.Сотрудник
	      |	КОНЕЦ КАК Менеджер,
	      |	мТаблицаДанных.Модель,
	      |	мТаблицаДанных.Версия,
	      |	мТаблицаДанных.Цвет,
	      |	мТаблицаДанных.ГодВыпуска,
	      |	мТаблицаДанных.СоставОпций,
	      |	мТаблицаДанных.ТипПрисутствияВРегистрах,
	      |	мТаблицаДанных.УчетНаОстаткахДилера,
	      |	мТаблицаДанных.МодельАртикулСпр,
	      |	мТаблицаДанных.ВерсияАртикулСпр,
	      |	мТаблицаДанных.ЦветАртикулСпр,
	      |	мТаблицаДанных.VIN,
	      |	мТаблицаДанных.MADPrev,
	      |	мТаблицаДанных.ЗакрепленоЗаКлиентомВDistri,
	      |	мТаблицаДанных.ОплаченПроизводителюПоДаннымАФМ,
	      |	мТаблицаДанных.НаОстаткахДилера,
	      |	мТаблицаДанных.ОформленаРеализация,
	      |	мТаблицаДанных.ОформленаВыдача,
	      |	мТаблицаДанных.ОформленаРеализацияБезВыдачи,
	      |	мТаблицаДанных.ЗаявленРезерв,
	      |	мТаблицаДанных.ИдентификаторРезерваЗаявка,
	      |	мТаблицаДанных.КорпКлиентРезерв,
	      |	мТаблицаДанных.УтвержденРезерв,
	      |	мТаблицаДанных.РабочийЛист,
	      |	мТаблицаДанных.СтатусАвтомобиля,
	      |	мТаблицаДанных.НаличиеПТС,
	      |	мТаблицаДанных.Блокировка,
	      |	мТаблицаДанных.МодельАртикул,
	      |	мТаблицаДанных.ВерсияАртикул,
	      |	мТаблицаДанных.ЦветАртикул,
	      |	мТаблицаДанных.Порядок КАК Порядок,
	      |	мТаблицаДанных.ДатаДСАПланФакт,
	      |	мТаблицаДанных.ДатаОтгрузкиОбещ,
	      |	мТаблицаДанных.ДатаОтгрузкиПланФакт,
	      |	мТаблицаДанных.ДатаПроизводстваПланФакт,
	      |	мТаблицаДанных.Примечание,
	      |	мТаблицаДанных.ПримечаниеРОП,
	      |	мТаблицаДанных.ЦенаПродажиРОП,
	      |	мТаблицаДанных.ЦветВыделенияСтроки,
	      |	ВЫРАЗИТЬ(мТаблицаДанных.МодельНаименованиеПолное КАК СТРОКА(100)) КАК МодельНаименованиеПолное,
	      |	ВЫРАЗИТЬ(мТаблицаДанных.ВерсияНаименованиеПолное КАК СТРОКА(100)) КАК ВерсияНаименованиеПолное,
	      |	мТаблицаДанных.ЦветНаименование,
	      |	мТаблицаДанных.ЦветМеталлик,
	      |	мТаблицаДанных.КодРадио,
	      |	мТаблицаДанных.ЦенаПродажиБазаТариф,
	      |	мТаблицаДанных.ЦенаПродажиОпции,
	      |	мТаблицаДанных.ЦенаПродажиДопОборудования,
	      |	мТаблицаДанных.ЦенаПродажиАвтомобиля,
	      |	мТаблицаДанных.ЦенаЗакупкиБаза,
	      |	мТаблицаДанных.ЦенаЗакупкиОпции,
	      |	мТаблицаДанных.ЦенаЗакупкиАвтомобиля,
	      |	мТаблицаДанных.ПлановаяДатаОплатыАФМ,
	      |	мТаблицаДанных.ЗакрепленЗаКлиентомВDMS,
	      |	мТаблицаДанных.ЗакрепитьЗаКлиентомВDMS,
	      |	мТаблицаДанных.СтрокаВыделена,
	      |	мТаблицаДанных.ТипКлиентаDistri,
	      |	мТаблицаДанных.НомерТТН,
	      |	мТаблицаДанных.ЦенаПродажиТариф,
	      |	мТаблицаДанных.ЦенаИзменена,
	      |	мТаблицаДанных.МенеджерРезерва КАК МенеджерРезерва,
	      |	мТаблицаДанных.СкладДилера,
	      |	мТаблицаДанных.ПарковочноеМесто,
	      |	мТаблицаДанных.ЦветВыделенияСтрокиДляВсех,
	      |	мТаблицаДанных.СчетчикНД,
	      |	мТаблицаДанных.ДатаОбновленияДанныхНД,
	      |	мТаблицаДанных.МаксимумСчетчикаНД,
	      |	мТаблицаДанных.ГруппаНД,
	      |	мТаблицаДанных.ЗонаРискаНД,
	      |	мТаблицаДанных.КоличествоДнейНаСкладеДилера,
	      |	мТаблицаДанных.НеДляПродажи,
	      |	мТаблицаДанных.ОплатаАФМСогласована,
	      |	мТаблицаДанных.АвтоОплаченАФМ,
	      |	мТаблицаДанных.КлиентВнесАванс,
	      |	мТаблицаДанных.ПТСПолученДилером,
	      |	мТаблицаДанных.КлиентПолностьюОплатилАвто,
	      |	мТаблицаДанных.ЕстьЗаявкаНаРезерв,
	      |	мТаблицаДанных.ИдентификаторРезерва,
	      |	мТаблицаДанных.ЗаявкаНаРезервТекСотрудника,
	      |	мТаблицаДанных.ЦенаЗакупкиДоставка,
	      |	мТаблицаДанных.ЦенаЗакупкиСкидка,
	      |	мТаблицаДанных.КритическаяДатаОплаты,
	      |	мТаблицаДанных.ЗакрепленВDMSИНеОплаченКл,
	      |	мТаблицаДанных.ЗакрепленВDMSИНеОплаченАФМ,
	      |	мТаблицаДанных.ЗапланированКОплатеВАФМ,
	      |	мТаблицаДанных.ДатаОтгрузкиПлановая,
	      |	мТаблицаДанных.ДатаОтгрузкиФактическая,
	      |	мТаблицаДанных.ДатаОтгрузкиЖелаемая,
	      |	мТаблицаДанных.АвтомобильОтгруженАФМ,
	      |	мТаблицаДанных.ЗапланированКОтгрузкеИзАФМ,
	      |	мТаблицаДанных.Идентификатор,
	      |	мТаблицаДанных.ДилерскийЦентр,
	      |	мТаблицаДанных.СкладАФМ,
	      |	мТаблицаДанных.ДатаРезерва,
	      |	мТаблицаДанных.ПричинаВыкупа,
	      |	мТаблицаДанных.ЖелаемаяДатаПоставки,
	      |	мТаблицаДанных.СтатусПредварительныхДокументов,
	      |	мТаблицаДанных.СтатусОкончательныхДокументов,
	      |	мТаблицаДанных.СкладПТС,
	      |	мТаблицаДанных.КлиентРезерва,
	      |	мТаблицаДанных.СчетDistri,
	      |	мТаблицаДанных.ИдентификаторСтрокиДоговора,
	      |	мТаблицаДанных.ДополнительныеЗатратыПоАвто,
	      |	мТаблицаДанных.АвтомобильЗаконтрактован,
	      |	мТаблицаДанных.ТипАвтомобиля,
	      |	мТаблицаДанных.ИнвентарныйНомер,
	      |	ВЫРАЗИТЬ(мТаблицаДанных.НаименованияОпций КАК СТРОКА(200)) КАК НаименованияОпций,
	      |	мТаблицаДанных.НомерТН,
	      |	мТаблицаДанных.ЦенаПоДоговору,
	      |	мТаблицаДанных.СуммаАванса,
	      |	мТаблицаДанных.ДатаСнятияСРезерва,
	      |	мТаблицаДанных.ДатаВыдачи,
	      |	мТаблицаДанных.КодОбивки,
	      |	мТаблицаДанных.ОписаниеБлокировки,
	      |	мТаблицаДанных.ДатаАктуальностиСтроки,
	      |	мТаблицаДанных.РасшифровкаСкидкиДилера,
	      |	мТаблицаДанных.ТарифОтгрузки,
	      |	мТаблицаДанных.СебестоимостьПоТН,
	      |	мТаблицаДанных.ФактическаяДатаОплатыАФМ,
	      |	мТаблицаДанных.ПлановаяДатаПолнойОплатыКлиентом,
	      |	мТаблицаДанных.ТипФактуры,
	      |	мТаблицаДанных.ДопКолонка1,
	      |	мТаблицаДанных.ДопКолонка2,
	      |	мТаблицаДанных.ДопКолонка3,
	      |	мТаблицаДанных.ДопКолонка4,
	      |	мТаблицаДанных.ДопКолонка5,
	      |	мТаблицаДанных.ДопКолонка6,
	      |	мТаблицаДанных.ДопКолонка7,
	      |	мТаблицаДанных.ДопКолонка8,
	      |	мТаблицаДанных.ДопКолонка9,
	      |	мТаблицаДанных.ДопКолонка10,
	      |	мТаблицаДанных.ЦенаФиксирована,
	      |	мТаблицаДанных.ДатаПоследнегоПеремещения,
	      |	мТаблицаДанных.АрхивныйVIN,
	      |	мТаблицаДанных.ЦенаПоДоговоруБезОборудования,
	      |	мТаблицаДанных.МаржаБезУчетаОборудования,
	      |	мТаблицаДанных.Реализация,
	      |	мТаблицаДанных.КонтрольнаяДатаОплаты,
	      |	мТаблицаДанных.DATEOFSALE,
	      |	мТаблицаДанных.CLIENTTYPE,
	      |	мТаблицаДанных.DATE_ARA,
	      |	мТаблицаДанных.NAMECL1,
	      |	мТаблицаДанных.ДатаОплаты,
	      |	мТаблицаДанных.СуммаОплаты,
	      |	мТаблицаДанных.ПодписанДоговорКП,
	      |	мТаблицаДанных.ДатаДоговораКП,
	      |	мТаблицаДанных.НомерДоговораКП,
	      |	мТаблицаДанных.ДоговорКПСсылка,
	      |	мТаблицаДанных.АвтомобильПродан,
	      |	мТаблицаДанных.СтатусРезерва,
	      |	мТаблицаДанных.ОсновнаяФормаОплаты,
	      |	мТаблицаДанных.ДатаАктаПередачи,
	      |	мТаблицаДанных.ИзменитьКЗВDistri,
	      |	мТаблицаДанных.ПричинаИзмененияКЗ,
	      |	ВЫРАЗИТЬ(мТаблицаДанных.КомментарийИзмененияКЗ КАК СТРОКА(200)) КАК КомментарийИзмененияКЗ,
	      |	мТаблицаДанных.ДатаЗагрузки,
	      |	мТаблицаДанных.ПродажаВнесенаВDistri,
	      |	мТаблицаДанных.ВнестиПродажуВDistri,
	      |	мТаблицаДанных.ВнестиЗаказВDistri,
	      |	мТаблицаДанных.ЗакрепитьЗаКлиентомВDistri,
	      |	мТаблицаДанных.НомерЗаявкиDistri,
	      |	мТаблицаДанных.НомерПродажиDistri,
	      |	мТаблицаДанных.НомерЗапросаDistri,
	      |	мТаблицаДанных.НомерЗаявкиDMS,
	      |	мТаблицаДанных.ДатаСозданияЗаявкиDistri,
	      |	мТаблицаДанных.НомерЗаказаDistri,
	      |	мТаблицаДанных.ДатаПерепродажи,
	      |	мТаблицаДанных.АвтоПринятоНаСклад,
	      |	мТаблицаДанных.ЗамечаниеПриемки,
	      |	мТаблицаДанных.СтоимостьДопОборудования,
	      |	мТаблицаДанных.СебестоимостьДопОборудования,
	      |	ВЫБОР
	      |		КОГДА мТаблицаДанных.ФактическаяДатаОплатыАФМ = ДАТАВРЕМЯ(1, 1, 1)
	      |			ТОГДА мТаблицаДанных.АФМ_ДатаОплатыДилеромФакт
	      |		ИНАЧЕ мТаблицаДанных.ФактическаяДатаОплатыАФМ
	      |	КОНЕЦ КАК ФактическаяДатаВыкупа,
	      |	ВЫБОР
	      |		КОГДА НЕ Renault_РабочиеЛисты.Клиент ЕСТЬ NULL
	      |			ТОГДА Renault_РабочиеЛисты.Клиент.ФормаСобственности
	      |		ИНАЧЕ мТаблицаДанных.КлиентРезерва.ФормаСобственности
	      |	КОНЕЦ КАК ФормаСобственностиКлиента,
	      |	ВЫБОР
	      |		КОГДА НЕ Renault_РабочиеЛисты.Клиент ЕСТЬ NULL
	      |			ТОГДА Renault_РабочиеЛисты.Клиент
	      |		ИНАЧЕ мТаблицаДанных.КлиентРезерва
	      |	КОНЕЦ КАК Клиент,
	      |	ЕСТЬNULL(ОплатыПоДоговору.СуммаРасход, 0) КАК ОплаченоКлиентомПоДоговору,
	      |	мТаблицаДанных.ЗаказНаПроизводство,
	      |	мТаблицаДанных.ACCESSORIES,
	      |	мТаблицаДанных.PRICE_ACCESSORIES,
	      |	мТаблицаДанных.DATE_ACCESSORIES_UNBLOCK,
	      |	ВЫБОР
	      |		КОГДА мТаблицаДанных.ТипАвтомобиля = ЗНАЧЕНИЕ(Справочник.Renault_ТипыАвтомобилей.Демонстрационный)
	      |				ИЛИ мТаблицаДанных.ТипАвтомобиля = ЗНАЧЕНИЕ(Справочник.Renault_ТипыАвтомобилей.Подменный)
	      |			ТОГДА ИСТИНА
	      |		ИНАЧЕ ЛОЖЬ
	      |	КОНЕЦ КАК ДемоПодменный,
	      |	ВЫБОР
	      |		КОГДА мТаблицаДанных.DATEOFSALE <> ДАТАВРЕМЯ(1, 1, 1)
	      |				И мТаблицаДанных.СтатусАвтомобиля <> ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыАвтомобилей.ВыданКлиенту)
	      |				И мТаблицаДанных.ТипАвтомобиля <> ЗНАЧЕНИЕ(Справочник.Renault_ТипыАвтомобилей.Демонстрационный)
	      |				И мТаблицаДанных.ТипАвтомобиля <> ЗНАЧЕНИЕ(Справочник.Renault_ТипыАвтомобилей.Подменный)
	      |			ТОГДА ИСТИНА
	      |		ИНАЧЕ ЛОЖЬ
	      |	КОНЕЦ КАК ЖелтыйАвтомобиль,
	      |	DMS_ЗаявкаНаОтгрузку.ДатаОтгрузки,
	      |	DMS_ЗаявкаНаОтгрузку.АдресОтгрузки,
	      |	ВЫБОР
	      |		КОГДА НЕ мВыполнениеСервисныхКампаний.VIN ЕСТЬ NULL
	      |			ТОГДА ИСТИНА
	      |		ИНАЧЕ ЛОЖЬ
	      |	КОНЕЦ КАК Отозван,
	      |	ВЫБОР
	      |		КОГДА НЕ мТаблицаДанных.АвтомобильПродан
	      |				И мТаблицаДанных.ДатаПроизводстваПланФакт < ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, -15)
	      |				И мТаблицаДанных.ДатаПроизводстваПланФакт > ДАТАВРЕМЯ(1, 1, 1)
	      |			ТОГДА ""TCM 15m+""
	      |		КОГДА НЕ мТаблицаДанных.АвтомобильПродан
	      |				И мТаблицаДанных.ДатаПроизводстваПланФакт < ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, -13)
	      |				И мТаблицаДанных.ДатаПроизводстваПланФакт > ДАТАВРЕМЯ(1, 1, 1)
	      |			ТОГДА ""TCM 14m+""
	      |		ИНАЧЕ """"
	      |	КОНЕЦ КАК СтатусТСМ,
	      |	мТаблицаДанных.Версия.ТипКПП.Наименование КАК ТипКПП,
	      |	ПОДСТРОКА(мДопИнформацияПоВерсиям.ТипТоплива, 1, 6) КАК ТипТоплива,
	      |	мДопИнформацияПоВерсиям.ТипПривода КАК ТипПривода,
	      |	ЕСТЬNULL(ПриоритетыПродажАвтомобилей.Приоритет, НЕОПРЕДЕЛЕНО) КАК ПриоритетПродажи,
	      |	ЕСТЬNULL(ПриоритетыПродажАвтомобилей.Приоритет.Порядок, 0) КАК ПриоритетСортировки,
	      |	ЕСТЬNULL(ЦеныАвтомобилей.Цена, мТаблицаДанных.ЦенаПродажиТариф) КАК ЦенаПродажиБезСкидки,
	      |	ЕСТЬNULL(СкидкиАвтомобилей.СуммаСкидки, 0) КАК ЦенаПродажиСкидка,
	      |	ВЫБОР
	      |		КОГДА ЕСТЬNULL(мТаблицаДанных.ЦенаПродажиРОП, 0) > 0
	      |			ТОГДА мТаблицаДанных.ЦенаПродажиРОП
	      |		ИНАЧЕ ВЫБОР
	      |				КОГДА ЕСТЬNULL(ЦеныАвтомобилей.Цена, 0) = 0
	      |					ТОГДА мТаблицаДанных.ЦенаПродажиАвтомобиля
	      |				ИНАЧЕ ЕСТЬNULL(ЦеныАвтомобилей.Цена, 0)
	      |			КОНЕЦ - ЕСТЬNULL(СкидкиАвтомобилей.СуммаСкидки, 0)
	      |	КОНЕЦ КАК ЦенаПродажи,
	      |	ЕСТЬNULL(ЦеныКомплектаций.Цена, мТаблицаДанных.ЦенаПродажиБазаТариф) КАК ЦенаПродажиБазаБезСкидки,
	      |	ЕСТЬNULL(СкидкиКомплектаций.СуммаСкидки, 0) КАК ЦенаПродажиБазаСкидка,
	      |	ЕСТЬNULL(ЦеныКомплектаций.Цена, мТаблицаДанных.ЦенаПродажиБазаТариф) - ЕСТЬNULL(СкидкиКомплектаций.СуммаСкидки, 0) КАК ЦенаПродажиБаза,
	      |	мТаблицаДанных.ПодтвержденныйАдресОтгрузки,
	      |	мТаблицаДанных.VAZNumOrder,
	      |	мТаблицаДанных.E_PTS,
	      |	мТаблицаДанных.УточненнаяДатаСборки,
	      |	мТаблицаДанных.ДатаСварки,
	      |	мТаблицаДанных.ДатаСходасКонвейера,
	      |	мТаблицаДанных.ДатаПередачиВЦехОтгрузки,
	      |	мТаблицаДанных.TENDER_NO,
	      |	мТаблицаДанных.TENDER_CLIENT,
	      |	мТаблицаДанных.ОплачиваемыхДней,
	      |	мТаблицаДанных.ВсегоДнейНаСкладе
	      |ИЗ
	      |	мТаблицаДанных КАК мТаблицаДанных
	      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	      |		ПО (Renault_РабочиеЛисты.IDK = мТаблицаДанных.РабочийЛист)
	      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТКасса КАК ОплатыПоДоговору
	      |		ПО мТаблицаДанных.Автомобиль = ОплатыПоДоговору.Автомобиль
	      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.DMS_ЗаявкаНаОтгрузку КАК DMS_ЗаявкаНаОтгрузку
	      |		ПО мТаблицаДанных.VIN = DMS_ЗаявкаНаОтгрузку.VIN
	      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВыполнениеСервисныхКампаний КАК мВыполнениеСервисныхКампаний
	      |		ПО мТаблицаДанных.VIN = мВыполнениеСервисныхКампаний.VIN
	      |			И (мВыполнениеСервисныхКампаний.ДатаВыполнения = ДАТАВРЕМЯ(1, 1, 1))
	      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ДопИнформацияПоВерсиям КАК мДопИнформацияПоВерсиям
	      |		ПО мТаблицаДанных.Версия = мДопИнформацияПоВерсиям.ВариантКомплектации
	      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныАвтомобилей.СрезПоследних(, ТипЦен = &ТипЦен) КАК ЦеныАвтомобилей
	      |		ПО мТаблицаДанных.Автомобиль = ЦеныАвтомобилей.Автомобиль
	      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныАвтомобилей.СрезПоследних(, ТипЦен = &ТипЦен) КАК ЦеныКомплектаций
	      |		ПО мТаблицаДанных.Модель = ЦеныКомплектаций.Автомобиль
	      |			И мТаблицаДанных.Версия = ЦеныКомплектаций.ВариантКомплектации
	      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_СкидкиНаАвтомобили.СрезПоследних КАК СкидкиАвтомобилей
	      |		ПО мТаблицаДанных.ДилерскийЦентр = СкидкиАвтомобилей.ДилерскийЦентр
	      |			И мТаблицаДанных.Автомобиль = СкидкиАвтомобилей.Автомобиль
	      |			И (СкидкиАвтомобилей.ВариантКомплектации = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка))
	      |			И (СкидкиАвтомобилей.ДатаНачала <= &ТекущаяДата)
	      |			И (СкидкиАвтомобилей.ДатаКонца >= &ТекущаяДата)
	      |			И (СкидкиАвтомобилей.НаличиеПТС = мТаблицаДанных.НаличиеПТС)
	      |			И (СкидкиАвтомобилей.ОтсутствиеКлиента = ВЫБОР
	      |				КОГДА мТаблицаДанных.СтатусРезерва = ""Свободен""
	      |					ТОГДА ИСТИНА
	      |				ИНАЧЕ ЛОЖЬ
	      |			КОНЕЦ)
	      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_СкидкиНаАвтомобили.СрезПоследних КАК СкидкиКомплектаций
	      |		ПО мТаблицаДанных.ДилерскийЦентр = СкидкиКомплектаций.ДилерскийЦентр
	      |			И мТаблицаДанных.Модель = СкидкиКомплектаций.Автомобиль
	      |			И мТаблицаДанных.Версия = СкидкиКомплектаций.ВариантКомплектации
	      |			И (СкидкиКомплектаций.ДатаНачала <= &ТекущаяДата)
	      |			И (СкидкиКомплектаций.ДатаКонца >= &ТекущаяДата)
	      |			И (СкидкиКомплектаций.НаличиеПТС = мТаблицаДанных.НаличиеПТС)
	      |			И (СкидкиКомплектаций.ОтсутствиеКлиента = ВЫБОР
	      |				КОГДА мТаблицаДанных.СтатусРезерва = ""Свободен""
	      |					ТОГДА ИСТИНА
	      |				ИНАЧЕ ЛОЖЬ
	      |			КОНЕЦ)
	      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ПриоритетыПродажАвтомобилей.СрезПоследних(
	      |				,
	      |				Автомобиль В
	      |					(ВЫБРАТЬ
	      |						мТаблицаДанных.Автомобиль
	      |					ИЗ
	      |						мТаблицаДанных КАК мТаблицаДанных)) КАК ПриоритетыПродажАвтомобилей
	      |		ПО мТаблицаДанных.Автомобиль = ПриоритетыПродажАвтомобилей.Автомобиль
	      |
	      |УПОРЯДОЧИТЬ ПО
	      |	Порядок УБЫВ";
			
	РезультатЗапроса = ВыполнитьЗапрос_(Истина,Текст,МенеджерВременныхТаблиц,
	VINАвтомобиля, МассивСкладовДилера, BIR_Distri, ПоказыватьЗарезервированные, ПоказыватьЗакрепленныеЗаКлиентом, ПоказыватьВыданныеАвтомобили, ПоказыватьНеДляПродажи, МодельАвтомобиля, ВерсияАвтомобиля, ЦветАвтомобиля, ПоказыватьДоговоры, ДоговорНаАвансСсылка, ДатаНеПоказыватьВыданныеАвтомобили, РежимПодтверждения, СтруктураОтбора);			   
	
	МенеджерВременныхТаблиц.Закрыть();
	Возврат РезультатЗапроса;
	
КонецФункции
//кор

Функция ВыполнитьЗапрос_(НуженРезультат, Текст, МенеджерВременныхТаблиц = Неопределено, VINАвтомобиля = "", МассивСкладовДилера, BIR_Distri, ПоказыватьЗарезервированные, ПоказыватьЗакрепленныеЗаКлиентом, ПоказыватьВыданныеАвтомобили, ПоказыватьНеДляПродажи, МодельАвтомобиля = "", ВерсияАвтомобиля = "", ЦветАвтомобиля = "", ПоказыватьДоговоры = Истина, ДоговорНаАвансСсылка = Неопределено, ДатаНеПоказыватьВыданныеАвтомобили = Неопределено, РежимПодтверждения = Ложь, СтруктураОтбора = Неопределено)
	
	Если МенеджерВременныхТаблиц = Неопределено Тогда
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ТекущаяДата",		 				ТекущаяДата());
	Запрос.УстановитьПараметр("VIN", 				 				VINАвтомобиля);
	Запрос.УстановитьПараметр("МассивСкладовДилера", 				МассивСкладовДилера);
	Запрос.УстановитьПараметр("BIR", 								CRM_Сервер.РазложитьСтрокуВМассивПодстрок(BIR_Distri, ","));
	Запрос.УстановитьПараметр("ТекущийСотрудник", 					ПараметрыСеанса.Пользователь.Сотрудник);
	Запрос.УстановитьПараметр("РежимПодтверждения", 				РежимПодтверждения);
	Запрос.УстановитьПараметр("ДатаНеПоказыватьВыданныеАвтомобили", ?(ДатаНеПоказыватьВыданныеАвтомобили = Неопределено,Дата('00010101'),ДатаНеПоказыватьВыданныеАвтомобили));
	Запрос.УстановитьПараметр("УчитыватьРеализацииКакВыдачи", 		Не Справочники.Renault_ОбщиеНастройкиБазыДанных.ЭтаБаза.Автосклад_НеУчитыватьРеализацииКакВыдачи);
	Запрос.УстановитьПараметр("ИспользоватьТиповойДО",		 		 Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ИспользоватьТиповойУчетДО);
	
	ТипПрисоединенияИзНоменклатурыИРабот = Ложь;	
	Если ЗначениеЗаполнено(ПараметрыСеанса.Renault_ПраваПользователя.ДилерскийЦентр) Тогда
		Если ПараметрыСеанса.Renault_ПраваПользователя.ДилерскийЦентр.ТипПривязкиДоповКАвтомобилям = Перечисления.Renault_ТипыУчетаДополнительногоОборудования.ИзНоменклатурыИРабот Тогда
			ТипПрисоединенияИзНоменклатурыИРабот = Истина;
	    КонецЕсли;
	КонецЕсли;
    Запрос.УстановитьПараметр("ТипПрисоединенияИзНоменклатурыИРабот",ТипПрисоединенияИзНоменклатурыИРабот);	
		
	СтруктураОтбора = ?(СтруктураОтбора = Неопределено, ПолучитьСтруктуруНастроекАвтосклад(), СтруктураОтбора);
	Для Каждого Эл Из СтруктураОтбора Цикл Запрос.УстановитьПараметр(Эл.Ключ, Эл.Значение) КонецЦикла;
	
	Если ЗначениеЗаполнено(МодельАвтомобиля) Тогда
		Запрос.УстановитьПараметр("Модель", МодельАвтомобиля);
	Иначе
		Запрос.УстановитьПараметр("Модель", Справочники.Модели.ПустаяСсылка());
	КонецЕсли;
	
	// начало добавление Зеленчук
	ВерсияАвтомобиляМассив = ТипЗнч(ВерсияАвтомобиля) = Тип("Массив");
	// окончание добавление Зеленчук

	Если ТипЗнч(ВерсияАвтомобиля) = Тип("Массив") Тогда
		Запрос.УстановитьПараметр("Версия", ВерсияАвтомобиля);
	Иначе
		Если
			ЗначениеЗаполнено(ВерсияАвтомобиля) Тогда
			Запрос.УстановитьПараметр("Версия", ВерсияАвтомобиля);
		Иначе
			Запрос.УстановитьПараметр("Версия", Справочники.ВариантыКомплектации.ПустаяСсылка());
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЦветАвтомобиля) Тогда
		Запрос.УстановитьПараметр("Цвет", ЦветАвтомобиля);
	Иначе
		Запрос.УстановитьПараметр("Цвет", Справочники.Цвета.ПустаяСсылка());
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДоговорНаАвансСсылка) И Не ЗначениеЗаполнено(VINАвтомобиля) Тогда
		Запрос.УстановитьПараметр("ДоговорНаАвансСсылка", ДоговорНаАвансСсылка);
	Иначе
		Запрос.УстановитьПараметр("ДоговорНаАвансСсылка", Документы.Renault_Договор.ПустаяСсылка());
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПоказыватьЗарезервированные", 	  ПоказыватьЗарезервированные);
	Запрос.УстановитьПараметр("ПоказыватьЗакрепленныеЗаКлиентом", ПоказыватьЗакрепленныеЗаКлиентом);
	Запрос.УстановитьПараметр("ПоказыватьВыданныеАвтомобили", 	  ПоказыватьВыданныеАвтомобили);
	Запрос.УстановитьПараметр("ПоказыватьНеДляПродажи", 		  ПоказыватьНеДляПродажи);
	Запрос.УстановитьПараметр("ПоказыватьДоговоры", 			  ПоказыватьДоговоры);
	
	Запрос.Текст = Текст;
	
	Результат = Запрос.Выполнить();
	
	Если НуженРезультат Тогда
		Возврат Результат.Выгрузить();
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура надписьОткрытьКарточкуАвтомобиляНажатие(Элемент)
	
	Если ЗначениеЗаполнено(дс_Автомобиль) Тогда
		дс_Автомобиль.ПолучитьФорму("ФормаЭлемента").Открыть();
	ИначеЕсли ЗначениеЗаполнено(дс_ДоговорКП) Тогда
		дс_ДоговорКП.ПолучитьФорму("ФормаЭлемента").Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура надписьОткрытьККПАвтомобиляНажатие(Элемент)
	
	ИмяТаблицы = ИмяТекущейТаблицы();
	
	Если Элементы[ИмяТаблицы].ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы[ИмяТаблицы].ТекущиеДанные;
	
	Если ЗначениеЗаполнено(дс_Автомобиль) Тогда
		ДокККП = Документы.DMS_КартаКачестваПоставки.НайтиПоРеквизиту("Автомобиль",дс_Автомобиль);
		Если ДокККП = Документы.DMS_КартаКачестваПоставки.ПустаяСсылка() Тогда
			Если Вопрос("Карта качества поставки не найдена! Хотите создать новую?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				Бу = "";
				Таблицы = ТаблицаОпцийДляКомПредложения(Бу,ТекущиеДанные.VIN,ТекущиеДанные.Автомобиль,ТекущиеДанные.СоставОпций,ТекущиеДанные.Версия);
				Парам = Новый Структура("Автомобиль,ТаблицаОпций,ТаблицаОпцийДилера",дс_Автомобиль,Таблицы.Опции,Таблицы.ТабДилОпции);
				ОткрытьФорму("Документ.DMS_КартаКачестваПоставки.ФормаОбъекта", Парам);
			КонецЕсли;
		Иначе
			ОткрытьЗначение(ДокККП);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьИнформациюПоАМ(Команда)
	
	мОтображатьДополнительнуюИнформацию = НЕ мОтображатьДополнительнуюИнформацию;
	
	ТекСтраница = Элементы.Таблици.ТекущаяСтраница;
	Если ТекСтраница.Имя = "Новые" Тогда
		ПанельИнфо = Элементы.Группа1;
	ИначеЕсли ТекСтраница.Имя = "СтраницаПодержанные" Тогда
		ПанельИнфо = Элементы.Информация2;
	ИначеЕсли ТекСтраница.Имя = "СтраницаДемо" Тогда
		ПанельИнфо = Элементы.Группа232;
	ИначеЕсли ТекСтраница.Имя = "Завки" Тогда
		ПанельИнфо = Элементы.ГруппаИнформацияПоАМ2;
	КонецЕсли;
	
	Если мОтображатьДополнительнуюИнформацию Тогда
		ПанельИнфо.Видимость = Истина;    
		Элементы.СкрытьПоказатьИнформациюПоАМ.Заголовок = "Скрыть информацию по а/м";
	Иначе
		ПанельИнфо.Видимость = Ложь;     
		Элементы.СкрытьПоказатьИнформациюПоАМ.Заголовок = "Показать информацию по а/м";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	мОтображатьДополнительнуюИнформацию = Истина;
	ИнициализироватьФильтры();
	
	// +++ ВалиховГА 22.10.2021 DMSREN-1299
	УстановитьОформлениеФильтраСписка("ДоступныеДляПродажи");
	// --- ВалиховГА 22.10.2021 DMSREN-1299
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьФильтры()
	
	// По статусам
	ДеревоФильтровСтатус = РеквизитФормыВЗначение("ДеревоФильтровПоСтатусам");
	ДеревоФильтровСтатус.Строки.Очистить();

	СтрокаВсеСтатусы = ДеревоФильтровСтатус.Строки.Добавить();
	СтрокаВсеСтатусы.Представление = "Все статусы";
	
	ДилерскийЦентрПользователя = Renault_РаботаСПравамиПользователя.ДилерскийЦентрПоУмолчанию(ПараметрыСеанса.Пользователь);
	
	МассивСкладовДилера = ДилерскийЦентрПользователя.СкладыДилера.ВыгрузитьКолонку("Склад");

	Для Каждого ЗначениеСтатуса Из Перечисления.CRM_СтатусыАвтомобилей Цикл 
		
		НовСтрокаСтатуса = СтрокаВсеСтатусы.Строки.Добавить();
		
		НовСтрокаСтатуса.Представление = ЗначениеСтатуса;
		НовСтрокаСтатуса.ЗначениеФильтра = ЗначениеСтатуса;
		НовСтрокаСтатуса.ТипОтбора = "СтатусАвтомобиля";
		
		Если ЗначениеСтатуса = Перечисления.CRM_СтатусыАвтомобилей.ДоставленДилеру Тогда
			//Добавим склады
			//Сначала без склада
			НовСтрокаСклад = НовСтрокаСтатуса.Строки.Добавить();
			НовСтрокаСклад.Представление = "<Склад не указан>";
			НовСтрокаСклад.ЗначениеФильтра = Справочники.СкладыКомпании.ПустаяСсылка();
			НовСтрокаСклад.ТипОтбора = "СкладДилера";
			//Потом все остальные
			Для Каждого СкладДилера Из МассивСкладовДилера Цикл
				НовСтрокаСклад = НовСтрокаСтатуса.Строки.Добавить();
				НовСтрокаСклад.Представление = СкладДилера;
				НовСтрокаСклад.ЗначениеФильтра = СкладДилера;
				НовСтрокаСклад.ТипОтбора = "СкладДилера";
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	НовСтрокаСтатуса = СтрокаВсеСтатусы.Строки.Добавить(); //Для отбора по желтым автомобилям
	НовСтрокаСтатуса.Представление = "Желтые автомобили";
	НовСтрокаСтатуса.ТипОтбора = "КартинкаЖелтыйАвтомобиль";
	НовСтрокаСтатуса.ЗначениеФильтра = Истина;
	
	НовСтрокаСтатуса = СтрокаВсеСтатусы.Строки.Добавить(); //Для отбора по отзывным нотам
	НовСтрокаСтатуса.Представление = "Отзывные ноты";
	НовСтрокаСтатуса.ТипОтбора = "VIN";
	
	СписокVIN = Новый СписокЗначений;
	СписокОТС = Renault_АвтосервисСервер.СписокОТСВСистеме(Истина, Истина);
	
	Для Каждого Строка Из СписокОТС Цикл
		СписокVIN.Добавить(Строка.VIN);
	КонецЦикла;
	НовСтрокаСтатуса.ЗначениеФильтра = СписокVIN;
	
	ЗначениеВРеквизитФормы(ДеревоФильтровСтатус, "ДеревоФильтровПоСтатусам");
	
	ДеревоФильтровМодель = РеквизитФормыВЗначение("ДеревоФильтровПоМоделям");
	ДеревоФильтровМодель.Строки.Очистить();
	
	СтрокаВсеМодели = ДеревоФильтровМодель.Строки.Добавить();
	СтрокаВсеМодели.Представление = "Все модели";
	
	МассивМоделей = ПараметрыСеанса.DMS_Бренд.МоделиАвтомобилейАвтосклад.ВыгрузитьКолонку("Модель");
	
	//Получим все версии по моделям
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_ТарифНаКомплектацииАвтомобилей.Модель КАК МодельСсылка,
	               |	Renault_ТарифНаКомплектацииАвтомобилей.ВариантКомплектации КАК ВерсияСсылка,
	               |	ПОДСТРОКА(Renault_ТарифНаКомплектацииАвтомобилей.Модель.НаименованиеПолное, 0, 50) КАК МодельНаименование,
	               |	ПОДСТРОКА(Renault_ТарифНаКомплектацииАвтомобилей.ВариантКомплектации.НаименованиеПолное, 0, 100) КАК ВерсияНаименование
	               |ИЗ
	               |	РегистрСведений.Renault_ТарифНаКомплектацииАвтомобилей.СрезПоследних КАК Renault_ТарифНаКомплектацииАвтомобилей
	               |ГДЕ
	               |	Renault_ТарифНаКомплектацииАвтомобилей.Модель В(&МассивМоделей)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	МодельНаименование
	               |ИТОГИ ПО
	               |	МодельСсылка";
	Запрос.УстановитьПараметр("МассивМоделей", МассивМоделей);
	ВыборкаПоМоделям = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоМоделям.Следующий() Цикл 
		
		НовСтрокаМодели	= СтрокаВсеМодели.Строки.Добавить();
		
		НовСтрокаМодели.Представление = ВыборкаПоМоделям.МодельНаименование;
		НовСтрокаМодели.ЗначениеФильтра = ВыборкаПоМоделям.МодельСсылка;
		НовСтрокаМодели.ТипОтбора = "Модель";
		
	КонецЦикла;
	ЗначениеВРеквизитФормы(ДеревоФильтровМодель, "ДеревоФильтровПоМоделям");
	
	ДеревоЗначений = РеквизитФормыВЗначение("ДеревоФильтровКОбработке");
	// К обработке
	ДеревоЗначений.Строки.Очистить();
	
	СтрокаВсе = ДеревоЗначений.Строки.Добавить();
	СтрокаВсе.Представление = "Все";
	СтрокаВсе.ТипОтбора = "Все";

	//отбор по Демо и подменным авто имеет свои особенности и зависит от настройки пользователя
	Если НЕ ПараметрыСеанса.Renault_ПраваПользователя.Ссылка.Автосклад_ОтображатьДемоПодменные Тогда	
		СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
		СтрокаКОбработке.Представление = "ДемоПодменный";
		СтрокаКОбработке.ТипОтбора =  "ДемоПодменный";
	КонецЕсли;
	СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
	СтрокаКОбработке.Представление = "Автомобили моих клиентов";
	СтрокаКОбработке.ЗначениеФильтра = мТекущийПользователь.Сотрудник;	
	СтрокаКОбработке.ТипОтбора = "Менеджер";
	
	СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
	СтрокаКОбработке.Представление = "Выделенные мной автомобили";
	СтрокаКОбработке.ЗначениеФильтра = Истина;	
	СтрокаКОбработке.ТипОтбора = "СтрокаВыделена";
	
	СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
	СтрокаКОбработке.Представление = "Мои заявки на резерв";
	СтрокаКОбработке.ЗначениеФильтра = Истина;	
	СтрокаКОбработке.ТипОтбора = "ЗаявкаНаРезервТекСотрудника";
	
	СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
	СтрокаКОбработке.Представление = "Мои резервы";
	СтрокаКОбработке.ЗначениеФильтра = мТекущийПользователь.Сотрудник;	
	СтрокаКОбработке.ТипОтбора = "МенеджерРезерва";
	ЕстьПравоКорпПродажи = Истина; //??
	Если ЕстьПравоКорпПродажи Тогда
		
		СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
		СтрокаКОбработке.Представление = "--------------------------";
		СтрокаКОбработке.ЗначениеФильтра = 0;
		
		СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
		СтрокаКОбработке.Представление = "Резервы под корп. клиентов";
		СтрокаКОбработке.ЗначениеФильтра = Истина;	
		СтрокаКОбработке.ТипОтбора = "КорпКлиентРезерв";
		
	КонецЕсли;
	
	//ЕстьПравоАдминистрированияАвтосклад = истина;//??
	Если ЕстьПравоАдминистрированияАвтосклад Тогда
		
		СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
		СтрокаКОбработке.Представление = "--------------------------";
		СтрокаКОбработке.ЗначениеФильтра = 0;
		
		СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
		СтрокаКОбработке.Представление = "Резервы на рассмотрение";
		СтрокаКОбработке.ЗначениеФильтра = Истина;	
		СтрокаКОбработке.ТипОтбора = "ЗаявленРезерв";
		
		СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
		СтрокаКОбработке.Представление = "Все резервы";
		СтрокаКОбработке.ЗначениеФильтра = Истина;	
		СтрокаКОбработке.ТипОтбора = "УтвержденРезерв";
		
		СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
		СтрокаКОбработке.Представление = "--------------------------";
		СтрокаКОбработке.ЗначениеФильтра = 0;
		
		СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
		СтрокаКОбработке.Представление = "Автомобили с измененной ценой";
		СтрокаКОбработке.ЗначениеФильтра = Истина;	
		СтрокаКОбработке.ТипОтбора = "ЦенаИзменена";
		
		СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
		СтрокаКОбработке.Представление = "Автомобили с фиксированной ценой";
		СтрокаКОбработке.ЗначениеФильтра = Истина;	
		СтрокаКОбработке.ТипОтбора = "ЦенаФиксирована";

		СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
		СтрокаКОбработке.Представление = "Заблокированные производителем автомобили";
		СтрокаКОбработке.ЗначениеФильтра = Истина;
		СтрокаКОбработке.ТипОтбора = "Блокировка";
		
		СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
		СтрокаКОбработке.Представление = "Автомобили не для продажи";
		СтрокаКОбработке.ЗначениеФильтра = Истина;	
		СтрокаКОбработке.ТипОтбора = "НеДляПродажи";
		
		СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
		СтрокаКОбработке.Представление = "Автомобили демо и подменные";
		СтрокаКОбработке.ЗначениеФильтра = Истина;	
		СтрокаКОбработке.ТипОтбора = "ДемоПодменный";

		СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
		СтрокаКОбработке.Представление = "--------------------------";
		СтрокаКОбработке.ЗначениеФильтра = 0;
		
		Если ПараметрыСеанса.DMS_Бренд = Справочники.CRM_МаркаАвтомобиля.RENAULT Тогда
			
			СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
			СтрокаКОбработке.Представление = "Внести клиентские заявки в Distri.net";	
			СтрокаКОбработке.ЗначениеФильтра = Истина;	
			СтрокаКОбработке.ТипОтбора = "ЗакрепитьЗаКлиентомВDistri";
			
			СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
			СтрокаКОбработке.Представление = "Изменить клиентские заявки в Distri.net";	
			СтрокаКОбработке.ЗначениеФильтра = Истина;	
			СтрокаКОбработке.ТипОтбора = "ИзменитьКЗВDistri";
			
			СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
			СтрокаКОбработке.Представление = "Внести заказы в производство в Distri.net";	
			СтрокаКОбработке.ЗначениеФильтра = Истина;	
			СтрокаКОбработке.ТипОтбора = "ВнестиЗаказВDistri";
			
			СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
			СтрокаКОбработке.Представление = "Внести продажи в Distri.net";	
			СтрокаКОбработке.ЗначениеФильтра = Истина;	
			СтрокаКОбработке.ТипОтбора = "ВнестиПродажуВDistri";
			
		КонецЕсли;
		
		СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
		СтрокаКОбработке.Представление = "Закрепить за клиентом в DMS";	
		СтрокаКОбработке.ЗначениеФильтра = Истина;	
		СтрокаКОбработке.ТипОтбора = "ЗакрепитьЗаКлиентомВDMS";
		
		СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
		СтрокаКОбработке.Представление = "--------------------------";
		СтрокаКОбработке.ЗначениеФильтра = 0;
		
		СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
		СтрокаКОбработке.Представление = "Законтрактованные автомобили";	
		СтрокаКОбработке.ЗначениеФильтра = Истина;	
		СтрокаКОбработке.ТипОтбора = "ЗакрепленЗаКлиентомВDMS";
		
		СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
		СтрокаКОбработке.Представление = "Законтрактованные и не оплаченные клиентом";	
		СтрокаКОбработке.ЗначениеФильтра = Истина;	
		СтрокаКОбработке.ТипОтбора = "ЗакрепленВDMSИНеОплаченКл";
		
		СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
		СтрокаКОбработке.Представление = "Законтрактованные и не оплаченные производителем";	
		СтрокаКОбработке.ЗначениеФильтра = Истина;	
		СтрокаКОбработке.ТипОтбора = "ЗакрепленВDMSИНеОплаченАФМ";
		
		СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
		СтрокаКОбработке.Представление = "--------------------------";
		СтрокаКОбработке.ЗначениеФильтра = 0;
		
		СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
		СтрокаКОбработке.Представление = "Желаемые к отгрузке от производителя";	
		СтрокаКОбработке.ЗначениеФильтра = Истина;
		СтрокаКОбработке.ТипОтбора = "ЗапланированКОтгрузкеИзАФМ";
		
		СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
		СтрокаКОбработке.Представление = "Запланированные к оплате производителю";	
		СтрокаКОбработке.ЗначениеФильтра = Истина;
		СтрокаКОбработке.ТипОтбора = "ЗапланированКОплатеВАФМ";
		
		СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
		СтрокаКОбработке.Представление = "--------------------------";
		СтрокаКОбработке.ЗначениеФильтра = 0;
		
		СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
		СтрокаКОбработке.Представление = "Невыданные с реализацией";
		СтрокаКОбработке.ЗначениеФильтра = Истина;
		СтрокаКОбработке.ТипОтбора = "ОформленаРеализацияБезВыдачи";
		
		СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
		СтрокаКОбработке.Представление = "С ПТС";	
		СтрокаКОбработке.ЗначениеФильтра = Истина;
		СтрокаКОбработке.ТипОтбора = "ПТСПолученДилером";
		
	КонецЕсли;
	
	СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
	СтрокаКОбработке.Представление = "TCM 12m+" ;	
	СтрокаКОбработке.ЗначениеФильтра = истина;
	СтрокаКОбработке.ТипОтбора = "Статус_12";
	
	СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
	СтрокаКОбработке.Представление = "TCM 15m+" ;	
	СтрокаКОбработке.ЗначениеФильтра = "TCM 15m+";
	СтрокаКОбработке.ТипОтбора = "СтатусТСМ";
	
	СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
	СтрокаКОбработке.Представление = "--------------------------";
	СтрокаКОбработке.ЗначениеФильтра = 0;
	
	СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
	СтрокаКОбработке.Представление = "Перепроданные авто";	
	СтрокаКОбработке.ЗначениеФильтра = Дата('00010101');
	СтрокаКОбработке.ТипОтбора = "ДатаПерепродажи";
	
	СтрокаКОбработке = СтрокаВсе.Строки.Добавить();
	СтрокаКОбработке.Представление = "Автомобили моих клиентов";
	СтрокаКОбработке.ЗначениеФильтра = мТекущийПользователь.Сотрудник;	
	СтрокаКОбработке.ТипОтбора = "Менеджер";
	ЗначениеВРеквизитФормы(ДеревоЗначений, "ДеревоФильтровКОбработке");
	
	// По приоритетам
	
	Если ПараметрыСеанса.Renault_ПраваПользователя.ИспользоватьПриоритетыПродажАвтомобилей Тогда
		
		ДеревоФильтровПриоритетов = РеквизитФормыВЗначение("ДеревоФильтровПоПриоритетам");
		ДеревоФильтровПриоритетов.Строки.Очистить();
	
		СтрокаВсеПриоритеты = ДеревоФильтровПриоритетов.Строки.Добавить();
		СтрокаВсеПриоритеты.Представление = "Все приоритеты";
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Renault_ПриоритетыПродажАвтомобилей.Ссылка КАК Приоритет,
			|	Renault_ПриоритетыПродажАвтомобилей.Наименование КАК ПриоритетНаименование
			|ИЗ
			|	Справочник.Renault_ПриоритетыПродажАвтомобилей КАК Renault_ПриоритетыПродажАвтомобилей
			|ГДЕ
			|	НЕ Renault_ПриоритетыПродажАвтомобилей.ПометкаУдаления
			|	И НЕ Renault_ПриоритетыПродажАвтомобилей.ЭтоГруппа
			|
			|УПОРЯДОЧИТЬ ПО
			|	Renault_ПриоритетыПродажАвтомобилей.Порядок УБЫВ";
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				НовСтрокаПриоритеты = СтрокаВсеПриоритеты.Строки.Добавить();
				НовСтрокаПриоритеты.Представление = Выборка.ПриоритетНаименование;
				НовСтрокаПриоритеты.ЗначениеФильтра = Выборка.Приоритет;
				НовСтрокаПриоритеты.ТипОтбора = "ПриоритетПродажи";
			КонецЦикла;
		КонецЕсли;
		
		НовСтрокаПриоритеты	= СтрокаВсеПриоритеты.Строки.Добавить();
		НовСтрокаПриоритеты.Представление = "Нет приоритета";
		НовСтрокаПриоритеты.ЗначениеФильтра = Справочники.Renault_ПриоритетыПродажАвтомобилей.ПустаяСсылка();
		НовСтрокаПриоритеты.ТипОтбора = "ПриоритетПродажи";
		ЗначениеВРеквизитФормы(ДеревоФильтровПриоритетов, "ДеревоФильтровПоПриоритетам");
		
	Иначе
		
		Элементы.Группа230.Видимость = Ложь;
		
	КонецЕсли;
	
	ЗаполнитьТаблицуОтбораПодержанных() 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоФильтровКОбработкеПриАктивизацииСтроки(Элемент)
	
	ТекущаяТаблица = ИмяТекущейТаблицы();
	Этаформа[ТекущаяТаблица].Отбор.Элементы.Очистить();
	ОтборСписка = Элементы.ДеревоФильтровКОбработке.ТекущиеДанные.ТипОтбора;
	ЭлементОтбора = Этаформа[ТекущаяТаблица].Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ПравоеЗначение = Элементы.ДеревоФильтровКОбработке.ТекущиеДанные.ЗначениеФильтра;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ОтборСписка);
	Если ТипЗнч(Элементы.ДеревоФильтровКОбработке.ТекущиеДанные.ЗначениеФильтра) = Тип("СписокЗначений") Тогда 
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	Иначе
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;

	ЭлементОтбора.Использование = Истина;
	Если ОтборСписка = "ДемоПодменный" Тогда 
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДемоПодменный");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Истина;
	ИначеЕсли ОтборСписка = "Менеджер" или ОтборСписка = "МенеджерРезерва" Тогда 
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ОтборСписка);
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ИначеЕсли ОтборСписка = "СтрокаВыделена" Тогда 
		
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветВыделенияСтроки");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
		
	ИначеЕсли ОтборСписка = "ЗаявкаНаРезервТекСотрудника" Тогда 
		
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЗаявкаНаРезервТекСотрудника");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		
	ИначеЕсли ОтборСписка = "ДатаПерепродажи" Тогда
			  ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ИначеЕсли ОтборСписка = "ЖелтыеАвтомобили" Тогда
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
				Если ТипЗнч(Элементы.ДеревоФильтровКОбработке.ТекущиеДанные.ЗначениеФильтра) = Тип("СписокЗначений") Тогда 
					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				КонецЕсли;
		
	ИначеЕсли ОтборСписка = "Все" Тогда
		Этаформа[ТекущаяТаблица].Отбор.Элементы.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоФильтровМодельПриАктивизацииСтроки(Элемент)
	
	ТекущаяТаблица = ИмяТекущейТаблицы();
	Этаформа[ТекущаяТаблица].Отбор.Элементы.Очистить();
	
	Если ЗначениеЗаполнено(Элементы.ДеревоФильтровПоМоделям.ТекущиеДанные.ТипОтбора) тогда
		
		ОтборСписка = Элементы.ДеревоФильтровПоМоделям.ТекущиеДанные.ТипОтбора;
		ЭлементОтбора = Этаформа[ТекущаяТаблица].Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ПравоеЗначение = Элементы.ДеревоФильтровПоМоделям.ТекущиеДанные.ЗначениеФильтра;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ОтборСписка);
		Если ТипЗнч(Элементы.ДеревоФильтровПоМоделям.ТекущиеДанные.ЗначениеФильтра) = Тип("СписокЗначений") Тогда 
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		Иначе
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		КонецЕсли;
		ЭлементОтбора.Использование = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура надписьОткрытьКарточкуКлиентаНажатие(Элемент)
	
	ОткрытьЗначение(дс_Клиент);
	
КонецПроцедуры

&НаКлиенте
Процедура Резерв(Команда)
	
	Запись = Элементы.Список.ТекущиеДанные;
	
	ТекущиеДанныеПоРезервам = Элементы.ТаблицаРезервовАвтомобилей.ТекущиеДанные;
	ТекущаяТаблица = "Список";
	
	Если ТекущиеДанныеПоРезервам <> Неопределено Тогда 
		
		Если Команда.Имя = "РезервУтвердить" тогда
			ИзменитьСтатусРезерваПоАвтомобилю(ТекущиеДанныеПоРезервам.ИдентификаторРезерва, Перечисления.CRM_СтатусыРезервовАвтомобилей.РезервУтвержден);
			Запись.ИдентификаторРезерва = ТекущиеДанныеПоРезервам.ИдентификаторРезерва;
			Запись.УтвержденРезерв = Истина;
		ИначеЕсли Команда.Имя = "РезервСнять" тогда
			ИзменитьСтатусРезерваПоАвтомобилю(ТекущиеДанныеПоРезервам.ИдентификаторРезерва, Перечисления.CRM_СтатусыРезервовАвтомобилей.РезервСнят);		
			Запись.ИдентификаторРезерва = Неопределено;
			Запись.УтвержденРезерв = Ложь;
		Иначе
			ИзменитьСтатусРезерваПоАвтомобилю(ТекущиеДанныеПоРезервам.ИдентификаторРезерва, Перечисления.CRM_СтатусыРезервовАвтомобилей.РезервОтклонен);		
			Запись.ИдентификаторРезерва = Неопределено;
			Запись.УтвержденРезерв = Ложь;
		КонецЕсли;
		
		Элементы.Список.Обновить();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДоступныеДляПродажи(Команда)
	
	ПоказыватьЗарезервированные = Ложь;
	ПоказыватьЗакрепленныеЗаКлиентом = Ложь;
	ПоказыватьНеДляПродажи = Ложь;
	ПоказыватьВыданныеАвтомобили = Ложь;
	
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьЗарезервированные", 	  ПоказыватьЗарезервированные);
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьЗакрепленныеЗаКлиентом", ПоказыватьЗакрепленныеЗаКлиентом);
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьВыданныеАвтомобили", 	  ПоказыватьВыданныеАвтомобили);
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьНеДляПродажи", 		  ПоказыватьНеДляПродажи);
	
	НовыйПорядок = Список.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	НовыйПорядок.Поле = Новый ПолеКомпоновкиДанных("Порядок");
	НовыйПорядок.Использование = Истина;
	НовыйПорядок.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
	НовыйПорядок.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
	
	// +++ ВалиховГА 22.10.2021 DMSREN-1299
	УстановитьОформлениеФильтраСписка("ДоступныеДляПродажи");
	// --- ВалиховГА 22.10.2021 DMSREN-1299
	
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельТаблицыДанныхПоСостояниюАвтомобилейДействиеКП(Кнопка)
	
	ИмяТаблицы = ИмяТекущейТаблицы();

	Если Элементы[ИмяТаблицы].ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы[ИмяТаблицы].ТекущиеДанные;
	
	Если Элементы[ИмяТаблицы].Имя = "Заявки" Тогда
		ТекущиеДанные = Элементы[ИмяТаблицы].ТекущиеДанные;
		
		Если ТекущиеДанные.Аннулирована Тогда
			Предупреждение("Заявка аннулирована");
			Возврат;
		КонецЕсли;
		
	ИначеЕсли Элементы[ИмяТаблицы].Имя = "Подержанные" Тогда
		ТекущиеДанные = Элементы[ИмяТаблицы].ТекущиеДанные;
	Иначе 
		ТекущиеДанные = Элементы[ИмяТаблицы].ТекущиеДанные;
		
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить(КодВозвратаДиалога.Да,"Ознакомлен");
		СписокКнопок.Добавить(КодВозвратаДиалога.Отмена,"Отмена");		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(м_Клиент) Тогда
		//DMSREN-986
		Если Не ВыбратьКлиента() Тогда 
			Предупреждение("Выбор клиента обязателен для создания коммерческого предложения");
			Возврат;
		КонецЕсли;
		//Предупреждение("Выбор клиента обязателен для создания коммерческого предложения");
		//Возврат;
		//----
	КонецЕсли;
	
	ФормаРабочийСтол = Обработки.CRM_АРМ_Конфигуратор.ПолучитьФорму("Форма");
	ФормаРабочийСтол.ТекущийРабочийЛист = м_РабочийЛист;
	ФормаРабочийСтол.ТекущийКлиент = м_Клиент; 
	БУ ="";
	Если Элементы[ИмяТаблицы].Имя = "Подержанные" Тогда
		БУ="БУ";
		СоставОпций = Неопределено;
		ФормаРабочийСтол.ЭтоТрейдИН = Истина;
		ФормаРабочийСтол.ТипКП = Перечисления.Renault_ТипКП.АвтомобильСПробегом;
		ТекущиеДанные = Элементы.Подержанные.ТекущиеДанные;
		ФормаРабочийСтол.Модель = ТекущиеДанные.Автомобиль.Модель;
		ФормаРабочийСтол.Версия = ТекущиеДанные.Автомобиль.ВариантКомплектации;
		ФормаРабочийСтол.Цвет  =  ТекущиеДанные.Автомобиль.Цвет;
	Иначе
		ФормаРабочийСтол.ТипКП = Перечисления.Renault_ТипКП.НовыйАвтомобиль;
		СоставОпций = ТекущиеДанные.СоставОпций;
	КонецЕсли;
	
	Если НЕ (ТекущиеДанные = Неопределено) Тогда
		ФормаРабочийСтол.Автомобиль = ТекущиеДанные.Автомобиль;
	Иначе
		Возврат;
	КонецЕсли;
	
	// добавим оборудование дилера
	
	Таблицы = ТаблицаОпцийДляКомПредложения(Бу,ТекущиеДанные.VIN,ТекущиеДанные.Автомобиль,СоставОпций,ТекущиеДанные.Версия);
	
	Для Каждого СтрокаОпций ИЗ Таблицы.Опции Цикл
		НоваяСтрока = ФормаРабочийСтол.ВыбранноеОборудование.Добавить();
		НоваяСтрока.Номенклатура = СтрокаОпций.Опция;
		НоваяСтрока.Количество = 1;
		НоваяСтрока.Цена = СтрокаОпций.Сумма;
		НоваяСтрока.Сумма = СтрокаОпций.Сумма;
	КонецЦикла;
	Если Таблицы.ДилОпции Тогда
		ФормаРабочийСтол.ИнтересовалсяОборудованием = Истина;
	КонецЕсли;
	
	ФормаРабочийСтол.Открыть();
	
	//ВазСистем Тарасов 20.11.2020 15:41:59 Инцидент #DMSREN-994
	//{
	//Старый код:
	//ОчиститьКлиента();
	//Новый код:
	//}
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьВыборКлиентаНажатие(Элемент)
	
	ВыбратьКлиента();
	
КонецПроцедуры

&НаКлиенте
Функция ВыбратьКлиента(МенеджерДляВыбора = Неопределено)
	
	//Отобразим форму выбора
	Форма = ПолучитьФорму("Обработка.Renault_АРМ_Автосклад_Упр.Форма.ФормаВыбораКлиента");
	
	Если ЗначениеЗаполнено(МенеджерДляРучнойРегистрации) Тогда
		Форма.МенеджерДляВыбора = МенеджерДляРучнойРегистрации;
	КонецЕсли;
	
	Ответ = Форма.ОткрытьМодально();
	Если ЗначениеЗаполнено(Ответ) Тогда
		м_Клиент = Ответ.Клиент;
		м_РабочийЛист = Ответ.НомерРабочегоЛиста;
		ОбновитьОтображениеНадписьКлиент();
		Возврат Истина;
	Иначе
		м_Клиент = Неопределено;
		м_РабочийЛист = Неопределено;
		
		ОбновитьОтображениеНадписьКлиент();
		Возврат Ложь;
	КонецЕсли;
	Если ЗначениеЗаполнено(м_Клиент) тогда
		Элементы.СтранициКлиент.ТекущаяСтраница = Элементы.ЗаполненКлиент;
	Иначе
		Элементы.СтранициКлиент.ТекущаяСтраница = Элементы.НеЗаполненКлиент;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ОчиститьКлиента()
	
	м_Клиент = Неопределено;
	м_РабочийЛист = Неопределено;
	ОбновитьОтображениеНадписьКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеНадписьКлиент()
	
	Если ЗначениеЗаполнено(м_Клиент) тогда
		Элементы.СтранициКлиент.ТекущаяСтраница = Элементы.ЗаполненКлиент;
	Иначе
		Элементы.СтранициКлиент.ТекущаяСтраница = Элементы.НеЗаполненКлиент;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура м_КлиентНажатие(Элемент, СтандартнаяОбработка)
	ВыбратьКлиента();
КонецПроцедуры

&НаКлиенте
Процедура Зарезервировать(Команда)
	
	ДанныеВыделенныхСтрок = Новый Массив;
	
	ИмяТаблицы = ИмяТекущейТаблицы();

	Если Элементы[ИмяТаблицы].имя = "Подержанные" Тогда
		ТекущиеДанные = Элементы.Подержанные.ТекущиеДанные;
		
		// { DMSREN-633 Болдарев Д.Е. от 18.03.2020
		//Строки = Элементы.Подержанные.ВыделенныеСтроки;		
		Для каждого ТекВыделенная Из Элементы.Подержанные.ВыделенныеСтроки Цикл
			ДанныеВыделенныхСтрок.Добавить(Элементы.Подержанные.ДанныеСтроки(ТекВыделенная));
		КонецЦикла; 
		// } DMSREN-633 Болдарев Д.Е. от 18.03.2020.
	Иначе
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		
		// { DMSREN-633 Болдарев Д.Е. от 18.03.2020  
		//Строки = Элементы.Список.ВыделенныеСтроки;		
		Для каждого ТекВыделенная Из Элементы.Список.ВыделенныеСтроки Цикл
			ДанныеВыделенныхСтрок.Добавить(Элементы.Список.ДанныеСтроки(ТекВыделенная));
		КонецЦикла;
		// } DMSREN-633 Болдарев Д.Е. от 18.03.2020. 
		
	КонецЕсли;
	
	Если ТекущиеДанные.НеДляПродажи	Тогда
		Предупреждение("Автомобиль со статусом ""Не для продажи"" не возможно поставить в резерв!");
		Возврат;
	КонецЕсли;

	Если ТекущиеДанные.Отозван Тогда
		ВопросПользователю = Вопрос("По автомобилю есть невыполненные отзывные ноты, всё равно продолжить?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
		Если ВопросПользователю = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(м_Клиент) Тогда
		Если Не ВыбратьКлиента() Тогда
			Предупреждение("Выбор клиента обязателен для создания коммерческого предложения");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеВыделенныхСтрок.Количество() > 0  Тогда
		
		КомментарийКЗаявке = "";
		
		ДнейРезерваПоУмолчанию = ПараметрыСеанса.Renault_ПраваПользователя.Автосклад_КоличествоДнейРезерваПоУмолчанию;
		Если ДнейРезерваПоУмолчанию = 0 Тогда
			ДнейРезерваПоУмолчанию = МаксимальноеКоличествоДнейРезерва;
			Если МаксимальноеКоличествоДнейРезерва = 0 Тогда
				ДнейРезерваПоУмолчанию = 3;
			КонецЕсли;
		КонецЕсли;
		
		ДатаСнятияСРезерва = ТекущаяДата() + ДнейРезерваПоУмолчанию*60*60*24;
		
		Если ВвестиДату(ДатаСнятияСРезерва, "Укажите до какой даты установить резерв") Тогда
			
			Если МаксимальноеКоличествоДнейРезерва <> 0 И ДатаСнятияСРезерва - ТекущаяДата() > МаксимальноеКоличествоДнейРезерва*60*60*24 Тогда
				Предупреждение("Оформление резерва невозможоно. Максимальное число дней резерва для вас - " + Строка(МаксимальноеКоличествоДнейРезерва));
				Возврат;
			КонецЕсли;
			
			Если ВвестиСтроку(КомментарийКЗаявке, "Введите комментарий к заявке на резерв...", , Истина) Тогда 
				
				Если ЗначениеЗаполнено(МенеджерДляРучнойРегистрации) Тогда
					МенеджерРезерва = МенеджерДляРучнойРегистрации;
				Иначе
					МенеджерРезерва = мТекущийМенеджер;
				КонецЕсли;
				
			Иначе
				Возврат;
			КонецЕсли;
			
		Иначе
			Возврат;
		КонецЕсли;
		
		// { DMSREN-633 Болдарев Д.Е. от 18.03.2020  
		//СоздатьЗаявкуНаРезервСтроки(Строки,КомментарийКЗаявке,МенеджерРезерва,ДатаСнятияСРезерва);
		СоздатьЗаявкуНаРезервСтроки(ДанныеВыделенныхСтрок, КомментарийКЗаявке, МенеджерРезерва, ДатаСнятияСРезерва);
		// } DMSREN-633 Болдарев Д.Е. от 18.03.2020. 
		
		ОчиститьКлиента();
		Элементы[ИмяТаблицы].Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаявкуНаРезервСтроки(Строки,КомментарийКЗаявке,МенеджерРезерва,ДатаСнятияСРезерва)
	
	Для Каждого СтрокаТЗ из Строки Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_УтвержденныеРезервы.Регистратор,
		|	Renault_УтвержденныеРезервы.НомерСтроки,
		|	Renault_УтвержденныеРезервы.Активность,
		|	Renault_УтвержденныеРезервы.VIN,
		|	Renault_УтвержденныеРезервы.Автомобиль,
		|	Renault_УтвержденныеРезервы.Менеджер,
		|	Renault_УтвержденныеРезервы.Комментарий,
		|	Renault_УтвержденныеРезервы.Автор,
		|	Renault_УтвержденныеРезервы.Контролер,
		|	Renault_УтвержденныеРезервы.РабочийЛист,
		|	Renault_УтвержденныеРезервы.SedreNum,
		|	Renault_УтвержденныеРезервы.Клиент
		|ИЗ
		|	РегистрСведений.Renault_УтвержденныеРезервы КАК Renault_УтвержденныеРезервы
		|ГДЕ
		|	Renault_УтвержденныеРезервы.VIN = &VIN";
		
		Запрос.УстановитьПараметр("VIN", СтрокаТЗ.VIN);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			Сообщить("Автомобиль" + Выборка.Автомобиль + " уже находится в резерве");	
			Продолжить;
		КонецЕсли;
		
		ЕстьПравоСразуРезервироватьАвтомобиль = ПараметрыСеанса.Renault_ПраваПользователя.РезервироватьАвтомобильБезСогласования;
		Если ЕстьПравоСразуРезервироватьАвтомобиль Тогда
			// { DMSREN-633 Болдарев Д.Е. от 18.03.2020  
			//СоздатьЗаявкуНаРезерв(СтрокаТЗ, СтрокаТЗ.VIN, МенеджерРезерва, м_Клиент, м_РабочийЛист, КомментарийКЗаявке, ДатаСнятияСРезерва, Перечисления.CRM_СтатусыРезервовАвтомобилей.РезервУтвержден, ПараметрыСеанса.Пользователь);
			СоздатьЗаявкуНаРезерв(СтрокаТЗ.Автомобиль, СтрокаТЗ.VIN, МенеджерРезерва, м_Клиент, м_РабочийЛист, КомментарийКЗаявке, ДатаСнятияСРезерва, Перечисления.CRM_СтатусыРезервовАвтомобилей.РезервУтвержден, ПараметрыСеанса.Пользователь);
			// } DMSREN-633 Болдарев Д.Е. от 18.03.2020. 
			
			//СтрокаТЗ.УтвержденРезерв = Истина;
		Иначе
			// { DMSREN-633 Болдарев Д.Е. от 18.03.2020  
			//СоздатьЗаявкуНаРезерв(СтрокаТЗ, СтрокаТЗ.VIN, МенеджерРезерва, м_Клиент, м_РабочийЛист, КомментарийКЗаявке, ДатаСнятияСРезерва);
			СоздатьЗаявкуНаРезерв(СтрокаТЗ.Автомобиль, СтрокаТЗ.VIN, МенеджерРезерва, м_Клиент, м_РабочийЛист, КомментарийКЗаявке, ДатаСнятияСРезерва);
			// } DMSREN-633 Болдарев Д.Е. от 18.03.2020. 
			
			//ИзменитьСтатусРезерваПоАвтомобилю(ТекущиеДанные.VIN, мТекущийМенеджер, Клиент, НомерРабочегоЛиста, Перечисления.CRM_СтатусыРезервовАвтомобилей.ЗаявкаНаРезерв, КомментарийКЗаявке);		
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


Процедура СоздатьЗаявкуНаРезерв(Автомобиль, VIN, МенеджерРезерва, КлиентРезерва, НомерРабочегоЛистаРезерва, КомментарийКЗаявке, ДатаСнятияСРезерва, СтатусРезерва = Неопределено, Контролер = Неопределено)
	
	НовЗаявка = Документы.Renault_РезервированиеАвтомобилей.СоздатьДокумент();
	
	НовЗаявка.VIN = VIN;
	НовЗаявка.Автомобиль = Автомобиль;
	НовЗаявка.Дата = ТекущаяДата();
	НовЗаявка.Автор = мТекущийПользователь;
	НовЗаявка.Менеджер = МенеджерРезерва;
	НовЗаявка.Клиент = КлиентРезерва;
	НовЗаявка.РабочийЛист = НомерРабочегоЛистаРезерва;
	НовЗаявка.СтатусРезерва = ?(ЗначениеЗаполнено(СтатусРезерва), СтатусРезерва, Перечисления.CRM_СтатусыРезервовАвтомобилей.ЗаявкаНаРезерв);
	НовЗаявка.Комментарий = КомментарийКЗаявке;
	НовЗаявка.ДатаСнятияРезерва = ДатаСнятияСРезерва;
	Если ЗначениеЗаполнено(Контролер) Тогда
		НовЗаявка.Контролер = Контролер;
	КонецЕсли;
	
	НовЗаявка.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура СнятьРезервСАвтомобиля(Автомобиль)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_УтвержденныеРезервы.Регистратор
	               |ИЗ
	               |	РегистрСведений.Renault_УтвержденныеРезервы КАК Renault_УтвержденныеРезервы
	               |ГДЕ
	               |	Renault_УтвержденныеРезервы.Автомобиль = &Автомобиль
	               |	И (&Менеджер = ""ЕстьПравоАдминистрирования""
	               |			ИЛИ Renault_УтвержденныеРезервы.Менеджер = &Менеджер)";
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Если НЕ ЕстьПравоАдминистрированияАвтосклад Тогда
		Запрос.УстановитьПараметр("Менеджер", мТекущийПользователь.Сотрудник);
		//Если нет права администрирования можно снимать только свои резервы
	Иначе
		Запрос.УстановитьПараметр("Менеджер", "ЕстьПравоАдминистрирования");
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Док = Выборка.Регистратор.ПолучитьОбъект();
		Док.СтатусРезерва = Перечисления.CRM_СтатусыРезервовАвтомобилей.РезервСнят;
		Док.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Renault_ЗаявкиНаРезервАвтомобиля.Регистратор
	               |ИЗ
	               |	РегистрСведений.Renault_ЗаявкиНаРезервАвтомобиля КАК Renault_ЗаявкиНаРезервАвтомобиля
	               |ГДЕ
	               |	Renault_ЗаявкиНаРезервАвтомобиля.Автомобиль = &Автомобиль
	               |	И (&Менеджер = ""ЕстьПравоАдминистрирования""
	               |			ИЛИ Renault_ЗаявкиНаРезервАвтомобиля.Менеджер = &Менеджер)";
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Если НЕ ЕстьПравоАдминистрированияАвтосклад Тогда
		//Если нет права администрирования можно снимать только свои резервы
		Запрос.УстановитьПараметр("Менеджер", мТекущийПользователь.Сотрудник);
	Иначе
		Запрос.УстановитьПараметр("Менеджер", "ЕстьПравоАдминистрирования");
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Док = Выборка.Регистратор.ПолучитьОбъект();
		Док.СтатусРезерва = Перечисления.CRM_СтатусыРезервовАвтомобилей.РезервСнят;
		Док.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
КонецПроцедуры

Функция ЕстьРезервНаАвтомобиль(Автомобиль)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_УтвержденныеРезервы.Регистратор
	               |ИЗ
	               |	РегистрСведений.Renault_УтвержденныеРезервы КАК Renault_УтвержденныеРезервы
	               |ГДЕ
	               |	Renault_УтвержденныеРезервы.Автомобиль = &Автомобиль";
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Следующий();
	
КонецФункции

&НаКлиенте
Процедура СнятиеСРезерва(Команда)
	
	ИмяТаблицы = ?(Элементы.Таблици.ТекущаяСтраница = Элементы.Список,"Список","Подержанные");  //DMS
	
	ТекущиеДанные = Элементы[ИмяТаблицы].ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда 
		
		СнятьРезервСАвтомобиля(ТекущиеДанные.Автомобиль);
		Если Не ЕстьРезервНаАвтомобиль(ТекущиеДанные.Автомобиль) Тогда
			Элементы[ИмяТаблицы].ТекущиеДанные.ИдентификаторРезерва = Неопределено;
			Элементы[ИмяТаблицы].ТекущиеДанные.УтвержденРезерв = Ложь;
			Элементы[ИмяТаблицы].ТекущиеДанные.ЗаявленРезерв = Ложь;
		КонецЕсли;
		
		Элементы[ИмяТаблицы].Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Договор(Команда)
	
	Если Элементы.Таблици.ТекущаяСтраница = Элементы.Подержанные Тогда
		ИмяТаблицы = "Подержанные";
	ИначеЕсли Элементы.Таблици.ТекущаяСтраница = Элементы.Заявки Тогда
		ИмяТаблицы = "Заявки";
	Иначе ИмяТаблицы = "Список";
	КонецЕсли;
	ТекущиеДанные = Элементы[ИмяТаблицы].ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяТаблицы = "Заявки" Тогда
		
		Если ТекущиеДанные.Аннулирована Тогда
			Предупреждение("Заявка аннулирована");
			Возврат;
		КонецЕсли;
		
	Иначе
		
		НеДляПродажи = ТекущиеДанные.НеДляПродажи;
		
		ЗакрепленЗаКлиентомВDMS = ТекущиеДанные.ЗакрепленЗаКлиентомВDMS;
		
		Если ТекущиеДанные.Отозван Тогда
			Предупреждение("По автомобилю есть невыполненные отзывные ноты");
			Возврат;
		КонецЕсли;
		
		Если НеДляПродажи Тогда
			Предупреждение("Автомобиль недоступен для продажи");
			Возврат;
		КонецЕсли;
		
		Если ЗакрепленЗаКлиентомВDMS Тогда
			Предупреждение("Автомобиль уже закреплен за другим клиентом");
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(м_Клиент) Тогда
		Если Не ВыбратьКлиента() Тогда
			Предупреждение("Выбор клиента обязателен для создания договора");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Ссылка
	|ИЗ Документ.Renault_Договор.СоставДоговора КАК Состав
	|ГДЕ Состав.Автомобиль = &Автомобиль
	|	И Состав.Ссылка.Клиент = &Клиент";
	Запрос.УстановитьПараметр("Автомобиль", ТекущиеДанные.Автомобиль);
	Запрос.УстановитьПараметр("Клиент", м_Клиент);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		//Сообщить("Для данного клиента уже есть договор на выбранный автомобиль");
		//Возврат;
		ДоговорОб = Выборка.Ссылка.ПолучитьОбъект();
		ДоговорОб.ПолучитьФорму().Открыть();
		м_Клиент = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		Возврат;
	КонецЕсли;
	
	//Создадим новый
	Форма = ПолучитьФорму("Документ.Renault_Договор.Форма.ФормаДокумента");
	
	ДоговорОбъектНового = Форма.ДокументОбъект;
	ДоговорОбъектНового.Дата = ТекущаяДата();
	ДоговорОбъектНового.ДатаДоговора = ТекущаяДата();
	ДоговорОбъектНового.РабочийЛист = м_РабочийЛист;
	ДоговорОбъектНового.СтатусДоговора = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Черновик;
	ДоговорОбъектНового.Клиент = м_Клиент;
	ДоговорОбъектНового.ДилерскийЦентр = ДилерскийЦентрПользователя;
	Если ИмяТаблицы = "Список" Тогда
		ДоговорОбъектНового.АвтомобильБу = Истина;
	КонецЕсли;
	
	Стр = ДоговорОбъектНового.СоставДоговора.Добавить();
	Стр.Автомобиль = ТекущиеДанные.Автомобиль;
	Стр.Идентификатор = Новый УникальныйИдентификатор;
	Стр.VIN = ТекущиеДанные.VIN;
	
	Форма.Открыть();
	
	//ВазСистем Тарасов 20.11.2020 15:41:59 Инцидент #DMSREN-994
	//{
	//Старый код:
	//м_Клиент = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
	//Новый код:
	//}
	
	//ФормаДоговора = ДоговорОбъектНового.ПолучитьФорму();
	//ФормаДоговора.ПерезаполнитьДоговор = Истина;
	//ФормаДоговора.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура НеДляПродажи(Команда)
	
	ИмяТаблицы = ?(Элементы.Таблици.ТекущаяСтраница = Элементы.Новые,"Список","Подержанные");  //DMS
	дс_Автомобиль = Элементы[ИмяТаблицы].ТекущиеДанные.Автомобиль;
	
	Идентификатор = Элементы[ИмяТаблицы].ТекущиеДанные.Идентификатор;
	Если ТипЗнч(Идентификатор) = Тип("ДокументСсылка.Renault_Договор") Тогда
		Попытка
			тАвтомобиль = Идентификатор.СоставДоговора[0].Автомобиль;
		Исключение
			тАвтомобиль = дс_Автомобиль;
		КонецПопытки;
	Иначе
		тАвтомобиль = Идентификатор;
	КонецЕсли;
	НеДляПродажи = НеДляПродажиНаСервере(тАвтомобиль);
	
	Элементы[ИмяТаблицы].ТекущиеДанные.НеДляПродажи = НеДляПродажи;
	Если ИмяТаблицы = "Список" тогда
		Если НеДляПродажи тогда
		Элементы[ИмяТаблицы].ТекущиеДанные.КартинкаРезерв = 3;
	    Иначе
		Элементы[ИмяТаблицы].ТекущиеДанные.КартинкаРезерв = 99999;
	    КонецЕсли;
	ИначеЕсли ИмяТаблицы = "Подержанные" тогда
		Если НеДляПродажи тогда
		Элементы[ИмяТаблицы].ТекущиеДанные.ПодержанныеКартинкаСтатус = 3;
	    Иначе
		Элементы[ИмяТаблицы].ТекущиеДанные.ПодержанныеКартинкаСтатус = 99999;
	    КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НеДляПродажиНаСервере(тАвтомобиль)
	
	ЗаписьДопИнфо = РегистрыСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям.СоздатьМенеджерЗаписи();
	ЗаписьДопИнфо.Автомобиль = тАвтомобиль;
	ЗаписьДопИнфо.Прочитать();
	
	ЗаписьДопИнфо.Автомобиль = тАвтомобиль;
	ЗаписьДопИнфо.НеДляПродажи = Не ЗаписьДопИнфо.НеДляПродажи;
	Попытка
		ЗаписьДопИнфо.Записать();
	Исключение
		Сообщить("Не удалось изменить статус");
	КонецПопытки;
	Возврат ЗаписьДопИнфо.НеДляПродажи;
	
КонецФункции

&НаКлиенте
Функция ИмяТекущейТаблицы()
	
	ИмяТаблици ="";
	
	Если Элементы.Таблици.ТекущаяСтраница = Элементы.Новые тогда
		 ИмяТаблици = "Список";
	ИначеЕсли Элементы.Таблици.ТекущаяСтраница = Элементы.СтраницаПодержанные тогда
		 ИмяТаблици = "Подержанные";
	ИначеЕсли Элементы.Таблици.ТекущаяСтраница = Элементы.СтраницаДемо тогда
		 ИмяТаблици = "ДемоПодмен";
	ИначеЕсли Элементы.Таблици.ТекущаяСтраница = Элементы.Завки тогда
		 ИмяТаблици = "Заявки";
	ИначеЕсли Элементы.Таблици.ТекущаяСтраница = Элементы.Потребности тогда
		 ИмяТаблици = "Перемещение";
	КонецЕсли;
	
	Возврат ИмяТаблици;
	
КонецФункции

&НаКлиенте
Процедура ТТН(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗаголовокПоля", "Введите номер ТТН");
		Если ЗначениеЗаполнено(ТекущиеДанные.НомерТТН) Тогда
			ПараметрыФормы.Вставить("Номер",ТекущиеДанные.НомерТТН);
		КонецЕсли;
		РезультатВвода = ОткрытьФормуМодально("Обработка.Renault_АРМ_Автосклад.Форма.ВводНомераТН", ПараметрыФормы);
		
		Если РезультатВвода = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ТТННомер = РезультатВвода.НомерДокумента;
		ГодТТН = Год(ТекущаяДата());
		Если РезультатВвода.ПрошлыйГод Тогда
			ГодТТН = ГодТТН - 1;
		КонецЕсли;
		//Форма = ПолучитьФорму("Документ.ПоступлениеАвтомобилей.ФормаОбъекта");
		//ДанныеФормы = "";
        // ЗаполнитьДокументНаСервере(ДанныеФормы);
		сПараметры = DMS_ТТН.ТТННаСервере(ТТННомер,ГодТТН,ТекущиеДанные.Vin,ДилерскийЦентрПользователя,мТекущийПользователь);
	
		//Если сПараметры.Автосклад_РазделятьПоступленияПоТТН Тогда 
		         ОткрытьФормуМодально("Обработка.Renault_АРМ_Автосклад.Форма.ФормаПриемаАвтомобиля", сПараметры);
	//							Форма.ОткрытьМодально();
	//	КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////  Процедуры и функции вызываемые П и Ф из кнопок

&НаСервере
Функция ВыполнитьЗапрос(ПараметрыВызоваСервера)
	
	НовыйУникальныйИдентификатор = Новый УникальныйИдентификатор;
	РезультатФоновогоЗадания = Renault_ДлительныеОперации.ЗапуститьВыполнениеВФоне(НовыйУникальныйИдентификатор, 
	"DMS_ОбменДаннымиСДилерскимПорталом.ПолучитьКонфигурациюПоVIN", ПараметрыВызоваСервера);
	Результат = Новый Структура;
	Если РезультатФоновогоЗадания.ЗаданиеВыполнено Тогда
		Результат.Вставить("ФоновоеЗадание", Ложь);
		Результат.Вставить("АдресХранилища", РезультатФоновогоЗадания.АдресХранилища);
	Иначе 
		Результат.Вставить("ФоновоеЗадание", Истина);
		Результат.Вставить("ФоновоеЗаданиеИдентификатор", РезультатФоновогоЗадания.ИдентификаторЗадания);
		Результат.Вставить("АдресХранилища", РезультатФоновогоЗадания.АдресХранилища);
	КонецЕсли;
	Возврат Результат;
	
КонецФункции


Функция СоздатьКонтрагентаИзДилера(ДЦ)
	
	НовДилер = Справочники.Контрагенты.СоздатьЭлемент();
	НовДилер.Наименование = ДЦ.Наименование;
	НовДилер.НаименованиеПолное = ДЦ.Наименование;
	НовДилер.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель;
	НовДилер.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо;
	НовДилер.Записать();
	Дилер = НовДилер.Ссылка;
	
	//Адрес
	Если ЗначениеЗаполнено(ДЦ.ОсновнойАдрес) Тогда
		Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		Запись.Вид = Справочники.ВидыКонтактнойИнформации.АдресЮридический;
		Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		Запись.Объект = Дилер;
		Запись.Представление = ДЦ.ОсновнойАдрес;
		Запись.ЗначениеПоУмолчанию = Истина;
		Запись.Записать();
	КонецЕсли;
	
	//телефон организации
	Если ЗначениеЗаполнено(ДЦ.ОсновнойТелефон) Тогда
		Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		Запись.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонРабочий;
		Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		Запись.Объект = Дилер;
		Запись.Представление = ДЦ.ОсновнойТелефон;
		Запись.Записать();
	КонецЕсли;
	
	//Email
	Если ЗначениеЗаполнено(ДЦ.ОсновнойEmail) Тогда
		Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		Запись.Вид = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий;
		Запись.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		Запись.Объект = Дилер;
		Запись.Представление = ДЦ.ОсновнойEmail;
		Запись.ЗначениеПоУмолчанию = Истина;
		Запись.Записать();
	КонецЕсли;
	
	Возврат НовДилер.Ссылка;
	
КонецФункции

////////////////////////////////////////////////  Кнопка Клиентская Заявка

&НаКлиенте
Процедура КлиентскаяЗаявка(Команда)
	
	ПараметрыОбработчика = "";
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		ДЦ = Renault_CRM.ПолучитьДилерскийЦентрПользователя(ПараметрыСеанса.Пользователь);
		ТС = Элементы.Список.ТекущиеДанные;
		ТекущиеПараметрыВыбора = Новый Структура;
		ТекущиеПараметрыВыбора.Вставить("ДЦ", ДЦ);
		ТекущиеПараметрыВыбора.Вставить("ТС", ТС);
		ТекущиеПараметрыВыбора.Вставить("Каманда", "КлиенскаяЗаявка");
		ПараметрыВызоваСервера = Новый Структура;
		ПараметрыВызоваСервера.Вставить("Счет",ДЦ.СчетSedre);
		ПараметрыВызоваСервера.Вставить("VIN", ТС.VIN);
		
		РезультатПолученияДопИнформации = ВыполнитьЗапрос (ПараметрыВызоваСервера);
		
		Если РезультатПолученияДопИнформации.ФоновоеЗадание Тогда
			Renault_ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
			ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте", 1, Истина);
			ФормаДлительнойОперации = Renault_ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, РезультатПолученияДопИнформации.ФоновоеЗаданиеИдентификатор);
		Иначе
			ОбработатьРезультатВыполненияЗадания(РезультатПолученияДопИнформации, ТекущиеПараметрыВыбора);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

/////////////////////////////////////////////  Кнопка Групповая Клиентская Заявка

&НаКлиенте
Процедура ГрупповаяКлиентскаяЗаявка(Команда)
	
	ПараметрыОбработчика="";	
	МассивСтрок = Новый Массив;
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	Для каждого стр Из Элементы.Список.ВыделенныеСтроки Цикл
		Элементы.Список.ТекущаяСтрока = стр;
		ТД = Элементы.Список.ТекущиеДанные;
		МассивСтрок.Добавить(ТД);
	КонецЦикла;
	Элементы.Список.ТекущаяСтрока = ТекСтрока;
	МассивОтветов = Новый Массив;
	
	ДЦ = Renault_CRM.ПолучитьДилерскийЦентрПользователя(ПараметрыСеанса.Пользователь);
	
	Для каждого стр Из МассивСтрок Цикл
		ПараметрыВызоваСервера = Новый Структура;
		ПараметрыВызоваСервера.Вставить("Счет", ДЦ.СчетSedre);
		ПараметрыВызоваСервера.Вставить("VIN", стр.VIN);
		// Нужно ли в цикл заводить РезультатПолученияДопИнформации?
			
	РезультатПолученияДопИнформации = ВыполнитьЗапрос(ПараметрыВызоваСервера);
	//
	//Если РезультатПолученияДопИнформации.ФоновоеЗадание Тогда
	//	Renault_ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
	//	ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте", 1, Истина);
	//	ФормаДлительнойОперации = Renault_ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, РезультатПолученияДопИнформации.ФоновоеЗаданиеИдентификатор);
	//Иначе
		ОбработатьРезультатВыполненияЗадания_ДляГрупповогоЗадания(МассивОтветов, стр, РезультатПолученияДопИнформации);
	//КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Автор", ПараметрыСеанса.Пользователь);
	ПараметрыФормы.Вставить("ДилерскийЦентр", ДЦ);
	ПараметрыФормы.Вставить("Счет", ДЦ.СчетSedre);
	ПараметрыФормы.Вставить("МассивОтветов", МассивОтветов); 
	ОткрытьФормуМодально("Документ.DMS_ЗаявкаНаАвтомобиль.Форма.ФормаГрупповогоПодбора", ПараметрыФормы,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатВыполненияЗадания_ДляГрупповогоЗадания(МассивОтветов, ТС, РезультатПолученияДопИнформации)
	
	сОтвет = ПолучитьИзВременногоХранилища(РезультатПолученияДопИнформации.АдресХранилища);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ДоговорКП",ТС.ДоговорКПСсылка);
	ПараметрыФормы.Вставить("Ответ", сОтвет);
	ПараметрыФормы.Вставить("VIN",ТС.VIN);
	
	МассивОтветов.Добавить(ПараметрыФормы);
	
КонецПроцедуры

/////////////////////////////////////////// Кнопка Заявка На Демо Автомобиль

&НаКлиенте
Процедура ЗаявкаНаДемоАвтомобиль(Команда)
	
	ПараметрыОбработчика="";
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		
		ДЦ = Renault_CRM.ПолучитьДилерскийЦентрПользователя(ПараметрыСеанса.Пользователь);
		ТС = Элементы.Список.ТекущиеДанные;
		
		ТекущиеПараметрыВыбора = Новый Структура;
		ТекущиеПараметрыВыбора.Вставить("ДЦ", ДЦ);
		ТекущиеПараметрыВыбора.Вставить("ТС", ТС);
		ТекущиеПараметрыВыбора.Вставить("Каманда", "Демо");
		
		ПараметрыВызоваСервера = Новый Структура;
		ПараметрыВызоваСервера.Вставить("Счет",ДЦ.СчетSedre);
		ПараметрыВызоваСервера.Вставить("VIN", ТС.VIN);
		
		РезультатПолученияДопИнформации = ВыполнитьЗапрос (ПараметрыВызоваСервера);
		
		Если РезультатПолученияДопИнформации.ФоновоеЗадание Тогда
			Renault_ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
			ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте", 1, Истина);
			ФормаДлительнойОперации = Renault_ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, РезультатПолученияДопИнформации.ФоновоеЗаданиеИдентификатор);
		Иначе
			ОбработатьРезультатВыполненияЗадания(РезультатПолученияДопИнформации, ТекущиеПараметрыВыбора);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

/////////////////////////////////////////// Кнопка Заявка На Подменный Автомобиль
&НаКлиенте
Процедура ЗаявкаНаПодменныйАвтомобиль(Команда)
	
	ПараметрыОбработчика="";
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		
		ДЦ = Renault_CRM.ПолучитьДилерскийЦентрПользователя(ПараметрыСеанса.Пользователь);
		ТС = Элементы.Список.ТекущиеДанные;
		
		ТекущиеПараметрыВыбора = Новый Структура;
		ТекущиеПараметрыВыбора.Вставить("ДЦ", ДЦ);
		ТекущиеПараметрыВыбора.Вставить("ТС", ТС);
		ТекущиеПараметрыВыбора.Вставить("Каманда", "Подменный");
		
		ПараметрыВызоваСервера = Новый Структура;
		ПараметрыВызоваСервера.Вставить("Счет",ДЦ.СчетSedre);
		ПараметрыВызоваСервера.Вставить("VIN", ТС.VIN);
		
		РезультатПолученияДопИнформации = ВыполнитьЗапрос (ПараметрыВызоваСервера);
		
		Если РезультатПолученияДопИнформации.ФоновоеЗадание Тогда
			Renault_ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
			ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте", 1, Истина);
			ФормаДлительнойОперации = Renault_ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, РезультатПолученияДопИнформации.ФоновоеЗаданиеИдентификатор);
		Иначе
			ОбработатьРезультатВыполненияЗадания(РезультатПолученияДопИнформации, ТекущиеПараметрыВыбора);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

/////////////////////////////////////////// Кнопка Клиентская Заявка Без VIN
&НаКлиенте
Процедура КлиентскаяЗаявкаБезVIN(Команда)
	
	ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя(ПараметрыСеанса.Пользователь);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДилерскийЦентр", ДилерскийЦентр);
	
	ОткрытьФормуМодально("Документ.DMS_ЗаявкаНаАвтомобиль.Форма.ФормаДокументаУпр",ПараметрыФормы,ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте()
	
	ПараметрыОбработчика="";
	Результат = Новый Структура;
	Результат.Вставить("ФоновоеЗаданиеВыполнено", Ложь);
	Результат.ФоновоеЗаданиеВыполнено = Renault_ДлительныеОперации.ЗаданиеВыполнено(РезультатПолученияДопИнформации.ФоновоеЗаданиеИдентификатор);
	ФормаДлительнойОперации = Renault_ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, РезультатПолученияДопИнформации.ФоновоеЗаданиеИдентификатор);
	
	Если Результат.ФоновоеЗаданиеВыполнено Тогда
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = РезультатПолученияДопИнформации.ФоновоеЗаданиеИдентификатор Тогда
				Renault_ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		КонецЕсли;
		// Нужно ли так делать///////////////
		//РезультатПолученияДопИнформации =  РезультатПолученияДопИнформации;
		///////////////////////////////////
		ОбработатьРезультатВыполненияЗадания(РезультатПолученияДопИнформации,ТекущиеПараметрыВыбора );
		Иначе
		Renault_ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте", ПараметрыОбработчика.ТекущийИнтервал, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатВыполненияЗадания (РезультатПолученияДопИнформации, ТекущиеПараметрыВыбора)
	
	сОтвет = ПолучитьИзВременногоХранилища(РезультатПолученияДопИнформации.АдресХранилища);
	ДЦ = ТекущиеПараметрыВыбора.ДЦ;
	ТС = ТекущиеПараметрыВыбора.ТС; 
	ПараметрыФормы = Новый Структура();
	
	Если ТекущиеПараметрыВыбора.Каманда = "КлиенскаяЗаявка" Тогда
		ПараметрыФормы.Вставить("Договор",ТС.ДоговорКПСсылка);
		ПараметрыФормы.Вставить("ИдентификаторСтрокиДоговора",ТС.ИдентификаторСтрокиДоговора);	
		Если ЗначениеЗаполнено(ТС.Менеджер) Тогда
			ПараметрыФормы.Вставить("Продавец", ТС.Менеджер);
		КонецЕсли;
	ИначеЕсли ТекущиеПараметрыВыбора.Каманда = "Демо" Тогда
		Дилер = Справочники.Контрагенты.НайтиПоНаименованию(ДЦ.Наименование);
		Если Дилер = Справочники.Контрагенты.ПустаяСсылка() тогда
			Дилер = СоздатьКонтрагентаИзДилера(ДЦ);
		КонецЕсли;
		ПараметрыФормы.Вставить("Клиент",Дилер);
		ПараметрыФормы.Вставить("ТипЗаявки",Справочники.DMS_ТипыЗаявки.Демо);
	ИначеЕсли ТекущиеПараметрыВыбора.Каманда = "Подменный" Тогда
		Дилер = Справочники.Контрагенты.НайтиПоНаименованию(ДЦ.Наименование);
		Если Дилер = Справочники.Контрагенты.ПустаяСсылка() тогда
			Дилер = СоздатьКонтрагентаИзДилера(ДЦ);
		КонецЕсли;
		ПараметрыФормы.Вставить("Клиент",Дилер);
		ПараметрыФормы.Вставить("ТипЗаявки",Справочники.DMS_ТипыЗаявки.Подменный);
	КонецЕсли;
	ПараметрыФормы.Вставить("Ответ", сОтвет);
	ПараметрыФормы.Вставить("Счет",ДЦ.СчетSedre);
	ПараметрыФормы.Вставить("VIN",ТС.VIN);
	ПараметрыФормы.Вставить("Автор",ПараметрыСеанса.Пользователь);
	ПараметрыФормы.Вставить("ДилерскийЦентр",ДЦ);
	
	ОткрытьФормуМодально("Документ.DMS_ЗаявкаНаАвтомобиль.Форма.ФормаДокументаУпр",ПараметрыФормы,ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ВыделитьДляВсехНаСервере(ТекущиеДанные)
	
	Запись = РегистрыСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям.СоздатьМенеджерЗаписи();
	Запись.Автомобиль = ТекущиеДанные.Идентификатор;
	Запись.Прочитать();
	
	Если Запись.Выбран() И Запись.ЦветВыделенияСтрокиДляВсех <> "" Тогда
		Запись.Автомобиль = ТекущиеДанные.Идентификатор;
		Запись.ЦветВыделенияСтрокиДляВсех = "";
		ТекущиеДанные.ЦветВыделенияСтрокиДляВсех = "";
		Запись.Записать();
		Возврат Неопределено;
		
	Иначе
		Запись.Автомобиль = ТекущиеДанные.Идентификатор;
		Запись.ЦветВыделенияСтрокиДляВсех = Renault_Открытый.ЦветВСтроку(Новый Цвет(255,153,0));//Renault_Открытый.ЦветВСтроку(ЦветЖелтый);
		ТекущиеДанные.ЦветВыделенияСтрокиДляВсех = Renault_Открытый.ЦветВСтроку(Новый Цвет(255,153,0));//Renault_Открытый.ЦветВСтроку(ЦветЖелтый);
		Запись.Записать();
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВыделитьДляВсех(Команда)
	
	ИмяТаблицы = ?(Элементы.Таблици.ТекущаяСтраница = Элементы.Новые,"Список","Подержанные");  //DMS
	Для каждого стр из Элементы[ИмяТаблицы].ВыделенныеСтроки Цикл
		ТекущиеДанные =Элементы[ИмяТаблицы].ДанныеСтроки(стр);
		ТекАвтомобиль = ТекущиеДанные.Автомобиль;
		
		ЦветВыдел = ВыделитьДляВсехНаСервере(ТекущиеДанные);
		Если ЦветВыдел = Неопределено Тогда
			ТекущиеДанные.ЦветВыделенияСтроки = "";
			ТекущиеДанные.СтрокаВыделена = Ложь;
		Иначе 
			ТекущиеДанные.ЦветВыделенияСтроки = Вычислить(Renault_ОбщиеФункцииСервер.МультибрендПараметрыОформления().ОсновнойЦвет);
			ТекущиеДанные.СтрокаВыделена = Истина;
		КонецЕсли;
	КонецЦикла;
	Элементы[ИмяТаблицы].Обновить();
	
КонецПроцедуры

&НаСервере
Функция  ВыделитьДляСебяНаСервере(ТекущиеДанные)
	
	Запись = РегистрыСведений.CRM_ПользовательскаяИнформацияПоАвтомобилям.СоздатьМенеджерЗаписи();
	Запись.Автомобиль = ТекущиеДанные.Идентификатор;
	Запись.Прочитать();
	
	Если Запись.Выбран() И Запись.ЦветВыделенияСтроки <> "" Тогда
		Запись.Автомобиль = ТекущиеДанные.Идентификатор;
		Запись.ЦветВыделенияСтроки = "";
		Запись.Записать();
		Возврат Неопределено;
	Иначе
		Запись.Автомобиль = ТекущиеДанные.Идентификатор;
		Запись.ЦветВыделенияСтроки = Renault_Открытый.ЦветВСтроку(Новый Цвет(255,153,0));
		Запись.Записать();
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВыделитьДляСебя(Команда)
	
	ИмяТаблицы = ?(Элементы.Таблици.ТекущаяСтраница = Элементы.Новые,"Список","Подержанные");  //DMS
	Для каждого стр из Элементы[ИмяТаблицы].ВыделенныеСтроки Цикл
		ТекущиеДанные =Элементы[ИмяТаблицы].ДанныеСтроки(стр);
		ЦветВыдел = ВыделитьДляСебяНаСервере(ТекущиеДанные);
		Если ЦветВыдел = Неопределено Тогда
			ТекущиеДанные.ЦветВыделенияСтроки = "";
			ТекущиеДанные.СтрокаВыделена = Ложь;
		Иначе 
			ТекущиеДанные.ЦветВыделенияСтроки = Renault_Открытый.ЦветВСтроку(Новый Цвет(255,153,0));
			ТекущиеДанные.СтрокаВыделена = Истина;
		КонецЕсли;
	КонецЦикла;
	Элементы[ИмяТаблицы].Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура Цвета(Команда)
	
	Форма = ПолучитьФорму("Обработка.Renault_АРМ_Автосклад_Упр.Форма.ФормаВыбораЦвета");
	Форма.ЦветДляСебя = Новый Цвет(255,153,0);
	Форма.ЦветДляВсех = Вычислить(Renault_ОбщиеФункцииСервер.МультибрендПараметрыОформления().ОсновнойЦвет);
	Структура = Форма.ОткрытьМодально();
	Если ЗначениеЗаполнено(Структура) Тогда
		ЦветДляСебя = Структура.ЦветДляСебя;
		ЦветЖелтый = Структура.ЦветДляВсех;
	КонецЕсли;
	ИзменитьЦветВыделения(Структура);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьЦветВыделения(Структура)
	
	Если Структура <> Неопределено тогда
		Для Каждого стр из Этаформа.УсловноеОформление.Элементы Цикл
			Если стр.Отбор.Элементы[0].ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ЦветВыделенияСтроки") Тогда 
				стр.Оформление.Элементы[0].Значение = Структура.ЦветДляСебя;
			ИначеЕсли стр.Отбор.Элементы[0].ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ЦветВыделенияСтрокиДляВсех") Тогда
				стр.Оформление.Элементы[0].Значение = Структура.ЦветДляВсех;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПотребностьПеремещенияНаСервере(ТекущиеДанные)
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ПеремещениеОбъект = Документы.Renault_ПотребностьПеремещения.СоздатьДокумент();
		ПеремещениеОбъект.ДилерскийЦендр = ДилерскийЦентрПользователя;
		ПеремещениеОбъект.Автор = ПараметрыСеанса.Пользователь.Сотрудник;
		ПеремещениеОбъект.ЖелаемаяДатаПеремещения = ТекущаяДата();
		ПеремещениеОбъект.Дата = ТекущаяДата();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиАвтомобилейОстатки.СкладКомпании КАК СкладКомпании
		|ПОМЕСТИТЬ ВтОстатки
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(, Автомобиль = &Автомобиль) КАК ОстаткиАвтомобилейОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Renault_МаршрутыПеремещений.Ссылка КАК Маршрут
		|ИЗ
		|	ВтОстатки КАК ВтОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Renault_МаршрутыПеремещений КАК Renault_МаршрутыПеремещений
		|		ПО ВтОстатки.СкладКомпании = Renault_МаршрутыПеремещений.СкладОтправитель
		|			И (НЕ Renault_МаршрутыПеремещений.ПометкаУдаления)";
		
		Запрос.УстановитьПараметр("Автомобиль", ТекущиеДанные.Автомобиль);
		
		Результат = Запрос.Выполнить();
		
		Если Не Результат.Пустой() Тогда
			ПеремещениеОбъект.Маршрут = Результат.Выгрузить()[0].Маршрут;
		КонецЕсли;
		
		АвтоСтрока = ПеремещениеОбъект.Автомобили.Добавить();
		АвтоСтрока.Автомобиль = ТекущиеДанные.Автомобиль;
		//ПеремещениеОбъект.Записать();
		Возврат ПеремещениеОбъект;
		
	Иначе
		
		Возврат "";
		
	Конецесли;
	
КонецФункции

Процедура ЗаполнитьОбновитьТаблицуПеремещений (СтрокаОтбор = Неопределено, VINАвтомобиля = "")
	
	Объект.ТаблицаПотребностей.Очистить();
	
	РезультатЗапросаПоПеремещениям = ПолучитьТаблицуПотребностейПоАвто(СтрокаОтбор, VINАвтомобиля);
	Объект.ТаблицаПотребностей.Загрузить(РезультатЗапросаПоПеремещениям);
	
КонецПроцедуры

Функция ПолучитьТаблицуПотребностейПоАвто(СтрокаОтбор = Неопределено, VINАвтомобиля = "")
	
	Если СтрокаОтбор <> Неопределено и СтрокаОтбор.СкладОтправитель <> "Не выбран" Тогда
		МаршрутЗадан = Истина;
	Иначе
		МаршрутЗадан = Ложь;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Renault_ПланПеремещения.Автомобиль КАК Автомобиль,
	|	Renault_ПланПеремещения.Автомобиль.VIN КАК VIN,
	|	Renault_ПланПеремещения.РабочийЛист КАК РабочийЛист,
	|	Renault_ПланПеремещения.СкладОтправитель КАК СкладОтправитель,
	|	Renault_ПланПеремещения.СкладПолучатель КАК СкладПолучатель,
	|	Renault_ПланПеремещения.Комментарий КАК Комментарий,
	|	Renault_ПланПеремещения.Ответственный КАК Ответственный,
	|	Renault_ПланПеремещения.ПотребностьПеремещения КАК ПотребностьПеремещения,
	|	Renault_ПланПеремещения.ДатаПлан КАК ДатаПлан,
	|	ЕСТЬNULL(ПеремещениеАвтомобилейАвтомобили.Ссылка, ЗНАЧЕНИЕ(Документ.ПеремещениеАвтомобилей.ПустаяСсылка)) КАК Перемещение
	|ПОМЕСТИТЬ ВТПеремещения
	|ИЗ
	|	РегистрСведений.Renault_ПланПеремещения КАК Renault_ПланПеремещения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеАвтомобилей.Автомобили КАК ПеремещениеАвтомобилейАвтомобили
	|		ПО Renault_ПланПеремещения.Автомобиль = ПеремещениеАвтомобилейАвтомобили.Автомобиль
	|			И Renault_ПланПеремещения.СкладОтправитель = ПеремещениеАвтомобилейАвтомобили.Ссылка.СкладКомпании
	|			И Renault_ПланПеремещения.СкладПолучатель = ПеремещениеАвтомобилейАвтомобили.Ссылка.СкладПолучатель
	|			И (ПеремещениеАвтомобилейАвтомобили.Ссылка.Проведен)
	|ГДЕ
	|	Renault_ПланПеремещения.ДатаПлан МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Renault_ПланПеремещения.Перемещено = ЛОЖЬ
	|	И (Renault_ПланПеремещения.Автомобиль.VIN = &VIN
	|			ИЛИ &VIN = """")"
	+?(МаршрутЗадан, 
	" И Renault_ПланПеремещения.СкладОтправитель = &СкладОтправитель
	| И Renault_ПланПеремещения.СкладПолучатель = &СкладПолучатель ","")
	+
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПеремещения.Автомобиль,
 	|	ВТПеремещения.VIN,
	|	ВТПеремещения.РабочийЛист,
	|	ВТПеремещения.СкладОтправитель,
	|	ВТПеремещения.СкладПолучатель,
	|	ВТПеремещения.Комментарий,
	|	ВТПеремещения.Ответственный,
	|	ВТПеремещения.ПотребностьПеремещения,
	|	ВТПеремещения.Перемещение,
	|	ВТПеремещения.ДатаПлан,
	|	isnull(Renault_РазмещениеАвтомобилей.Место,0) КАК ПарковочноеМесто,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.ЦветМеталлик,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.CODE_RADIO КАК КодРадио,
	|	ВЫБОР
	|		КОГДА CRM_СостояниеАвтомобилейПроизводителя_v2.PTS_NUM = """"
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК НаличиеПТС,
	|	ЕСТЬNULL(CRM_СостояниеАвтомобилейПроизводителя_v2.Статус, НЕОПРЕДЕЛЕНО) КАК СтатусАвтомобиля,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.БлокировкаАФМ КАК Блокировка,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.Модель,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.Версия,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.Цвет,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.Модель.НаименованиеПолное,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.Версия.НаименованиеПолное,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.Цвет.Наименование,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.YEAR КАК ГодВыпуска,
	|	ПОДСТРОКА(CRM_ДополнительнаяИнформацияПоАвтомобилям.Примечание, 0, 1024) КАК Примечание,
	|	ПОДСТРОКА(CRM_ДополнительнаяИнформацияПоАвтомобилям.ПримечаниеРОП, 0, 1024) КАК ПримечаниеРОП,
	|	CRM_ДополнительнаяИнформацияПоАвтомобилям.ПлановаяДатаОплатыАФМ,
	|	CRM_ДополнительнаяИнформацияПоАвтомобилям.ОплатаАФМСогласована,
	|	CRM_ДополнительнаяИнформацияПоАвтомобилям.ПТСПолученДилером,
	|	CRM_ДополнительнаяИнформацияПоАвтомобилям.ЖелаемаяДатаОтгрузки КАК ДатаОтгрузкиЖелаемая,
	|	CRM_ДополнительнаяИнформацияПоАвтомобилям.ДилерскийЦентр,
	|	CRM_ДополнительнаяИнформацияПоАвтомобилям.СкладПТС,
	|	CRM_ДополнительнаяИнформацияПоАвтомобилям.ДополнительныеЗатратыПоАвто,
	|	CRM_ДополнительнаяИнформацияПоАвтомобилям.ТипАвтомобиля,
	|	CRM_ДополнительнаяИнформацияПоАвтомобилям.АвтоОплаченАФМ,
	|	CRM_ДополнительнаяИнформацияПоАвтомобилям.ДопКолонка1,
	|	CRM_ДополнительнаяИнформацияПоАвтомобилям.ДопКолонка2,
	|	CRM_ДополнительнаяИнформацияПоАвтомобилям.ДопКолонка3,
	|	CRM_ДополнительнаяИнформацияПоАвтомобилям.ДопКолонка4,
	|	CRM_ДополнительнаяИнформацияПоАвтомобилям.ДопКолонка5,
	|	CRM_ДополнительнаяИнформацияПоАвтомобилям.ДопКолонка6,
	|	CRM_ДополнительнаяИнформацияПоАвтомобилям.ДопКолонка7,
	|	CRM_ДополнительнаяИнформацияПоАвтомобилям.ДопКолонка8,
	|	CRM_ДополнительнаяИнформацияПоАвтомобилям.ДопКолонка9,
	|	CRM_ДополнительнаяИнформацияПоАвтомобилям.ДопКолонка10,
	|	CRM_ДополнительнаяИнформацияПоАвтомобилям.ПричинаВыкупа,
	|	ЛОЖЬ КАК КлиентВнесАванс,
	|	ЛОЖЬ КАК КлиентПолностьюОплатилАвто,
	|	ЛОЖЬ КАК ПлановаяДатаПолнойОплатыКлиентом,
	|	ЛОЖЬ КАК ЗакрепленоЗаКлиентомВDistri,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.VIN,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаДСАПланФакт,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОтгрузкиПланФакт,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОтгрузкиПлановая,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОтгрузкиФактическая,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОтгрузкиОбещ,
	|	ЛОЖЬ КАК УтвержденРезерв,
	|	"""" КАК НомерЗаявкиDistri,
	|	"""" КАК НомерЗаказаDistri,
	|	"""" КАК ПродажаВнесенаВDistri,
	|	ЛОЖЬ КАК ИзменитьКЗВDistri,
	|	ЛОЖЬ КАК ПодписанДоговорКП,
	|	ЛОЖЬ КАК ЗаявленРезерв,
	|	"""" КАК РабочийЛист,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.пустаяССылка) КАК клиент,
	|	ЗНАЧЕНИЕ(Документ.Renault_Договор.пустаяСсылка) КАК ДоговорКПСсылка,
	|	НЕОПРЕДЕЛЕНО КАК ПричинаИзмененияКЗ,
	|	"""" КАК КомментарийИзмененияКЗ,
	|	"""" КАК ИдентификаторСтрокиДоговора,
	|	"""" КАК Менеджер
	|ИЗ
	|	ВТПеремещения КАК ВТПеремещения
	|   ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилейОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_РазмещениеАвтомобилей КАК Renault_РазмещениеАвтомобилей
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = Renault_РазмещениеАвтомобилей.Автомобиль
	|			И ОстаткиАвтомобилейОстатки.СкладКомпании = Renault_РазмещениеАвтомобилей.Склад
	|	ПО ВТПеремещения.Автомобиль = ОстаткиАвтомобилейОстатки.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
	|		ПО ВТПеремещения.Автомобиль = CRM_СостояниеАвтомобилейПроизводителя_v2.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям КАК CRM_ДополнительнаяИнформацияПоАвтомобилям
	|		ПО ВТПеремещения.Автомобиль = CRM_ДополнительнаяИнформацияПоАвтомобилям.Автомобиль";	
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ДатаНачала", ПериодПеремещений.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",  ПериодПеремещений.ДатаОкончания); 
	Запрос.УстановитьПараметр("VIN", VINАвтомобиля);
	
	Если МаршрутЗадан Тогда
		Запрос.УстановитьПараметр("СкладОтправитель", СтрокаОтбор.СкладОтправитель);
		Запрос.УстановитьПараметр("СкладПолучатель", СтрокаОтбор.СкладПолучатель);
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТекущиеМаршруты()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	""Не выбран"" КАК СкладОтправитель,
	|	""Не выбран"" КАК СкладПолучатель
	|ИЗ
	|	Справочник.CRM_ДилерскиеЦентры КАК CRM_ДилерскиеЦентры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Renault_ПланПеремещения.СкладОтправитель,
	|	Renault_ПланПеремещения.СкладПолучатель
	|ИЗ
	|	РегистрСведений.Renault_ПланПеремещения КАК Renault_ПланПеремещения
	|ГДЕ
	|	Renault_ПланПеремещения.ДатаПлан МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Renault_ПланПеремещения.Перемещено = ЛОЖЬ";
	Запрос.УстановитьПараметр("ДатаНачала", ПериодПеремещений.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ПериодПеремещений.ДатаОкончания);
	
	Маршруты.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТЗ = Маршруты.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЗ, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПотребностьПеремещения(Команда)
	
	ИмяТаблицы = ИмяТекущейТаблицы();
	ТекущиеДанные = Элементы[ИмяТаблицы].ТекущиеДанные;
	ПеремещениеСсылка= ПотребностьПеремещенияНаСервере(ТекущиеДанные);
	Если  ПеремещениеСсылка <> "" тогда
	   ПеремещениеСсылка.ПолучитьФорму("ФормаДокумента").Открыть();
	   ЗаполнитьОбновитьТаблицуПеремещений();
	   ЗаполнитьТекущиеМаршруты();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПеремещениеНаСервере(ТекущиеДанные)
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ПеремещениеОбъект = Документы.ПеремещениеАвтомобилей.СоздатьДокумент();
		ПеремещениеОбъект.СкладКомпании = ТекущиеДанные.СкладОтправитель;
		ПеремещениеОбъект.СкладПолучатель = ТекущиеДанные.СкладПолучатель;
		ПеремещениеОбъект.Дата = ТекущаяДата();
		АвтоСтрока = ПеремещениеОбъект.Автомобили.Добавить();
		АвтоСтрока.Автомобиль = ТекущиеДанные.Автомобиль;
		АвтоСтрока.Количество = 1;
		АвтоСтрока.DMS_Место = ТекущиеДанные.ПарковочноеМесто;
		Возврат ПеремещениеОбъект;
	Иначе
		Возврат "";
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура Перемещение(Команда)
	
	ИмяТаблицы = ИмяТекущейТаблицы();
	ТекущиеДанные = Элементы.Перемещение.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда 
		ПеремещениеСсылка= ПеремещениеНаСервере(ТекущиеДанные);
		Если  ПеремещениеСсылка <> "" тогда
			ПеремещениеСсылка.ПолучитьФорму().Открыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельТаблицыДанныхПоСостояниюАвтомобилейДОШоурум(Кнопка)
	
	СоздатьЗаявкуНаУстановкуДО("Шоурум");
	
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельТаблицыДанныхПоСостояниюАвтомобилейДОПриПокупкеАвтоПоЗН(Кнопка)
	
	СоздатьЗаявкуНаУстановкуДО("ЗН");
	
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельТаблицыДанныхПоСостояниюАвтомобилейДОПриПокупкеАвтоПоДоговору(Кнопка)
	
	СоздатьЗаявкуНаУстановкуДО("Договор");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявкуНаУстановкуДО(Тип = "")
	
	Если Тип = "" Тогда
		Возврат;
	КонецЕсли;

	ИмяТаблицы = ИмяТекущейТаблицы();

	Если Элементы[ИмяТаблицы].ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	доАвтомобиль = Элементы[ИмяТаблицы].ТекущиеДанные.Автомобиль;
	доДоговор = Элементы[ИмяТаблицы].ТекущиеДанные.ДоговорКПСсылка;
	доРабочийЛист = Элементы[ИмяТаблицы].ТекущиеДанные.РабочийЛист;
	доКлиент = Элементы[ИмяТаблицы].ТекущиеДанные.Клиент;
	
	Если Тип = "Шоурум" Тогда
		
		Если Не ЗначениеЗаполнено(доАвтомобиль) Тогда
			Предупреждение("Возможно только для а/м");
			Возврат;
		КонецЕсли;
		
		НоваяЗаявка = CRM_Сервер.СоздатьЗаявкуНаДополнительноеОборудование(доКлиент, доАвтомобиль);	
		НоваяЗаявка.ВидОбращения = Справочники.Renault_ВидыОбращенийВАвтосервис.ДоВШоуРум;
		НоваяЗаявка.ВидРемонта = Справочники.ВидыРемонта.КомплектацияАвтомобиля;
		НоваяЗаявка.Менеджер = ПараметрыСеанса.Пользователь.Сотрудник;
		
		ФормаЗаявки = НоваяЗаявка.ПолучитьФорму("ФормаЗаявкиНаДокомлектацию");	
		ФормаЗаявки.Открыть();	
		
	ИначеЕсли Тип = "ЗН" Тогда
		
		Если Не ЗначениеЗаполнено(доАвтомобиль) ИЛИ Не ЗначениеЗаполнено(доДоговор) Тогда
			Предупреждение("Возможно только для законтрактованных а/м");
			Возврат;
		КонецЕсли;
		
		Если доДоговор.СтатусДоговора<>Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан Тогда
			Если доДоговор.СтатусОкончательныхДокументов<>Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан Тогда 
				Если доДоговор.СтатусПредварительныхДокументов<>Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан Тогда 
			        Предупреждение("Возможно только для а/м с наличием подписанного договора");
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		НоваяЗаявка = CRM_Сервер.СоздатьЗаявкуНаДополнительноеОборудование(доКлиент, доАвтомобиль);	
		НоваяЗаявка.ВидОбращения = Справочники.Renault_ВидыОбращенийВАвтосервис.ДоПриПродажеПоЗаказНаряду;
		НоваяЗаявка.ВидРемонта = Справочники.ВидыРемонта.КомплектацияАвтомобиля;
		НоваяЗаявка.ДоговорНаПродажуАвтомобиля = доДоговор;
		НоваяЗаявка.Менеджер = ПараметрыСеанса.Пользователь.Сотрудник;
		
		ФормаЗаявки = НоваяЗаявка.ПолучитьФорму("ФормаЗаявкиНаДокомлектацию");	
		ФормаЗаявки.Открыть();
		
	ИначеЕсли Тип = "Договор" Тогда
		
		Если Не ЗначениеЗаполнено(доАвтомобиль) ИЛИ Не ЗначениеЗаполнено(доДоговор) Тогда			
			Предупреждение("Возможно только для законтрактованных а/м");
			Возврат;			
		КонецЕсли;
		

		Если доДоговор.СтатусДоговора<>Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан Тогда
			Если доДоговор.СтатусОкончательныхДокументов<>Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан Тогда 
				Если доДоговор.СтатусПредварительныхДокументов<>Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан Тогда 
			        Предупреждение("Возможно только для а/м с наличием подписанного договора");
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		НоваяЗаявка = CRM_Сервер.СоздатьЗаявкуНаДополнительноеОборудование(доКлиент, доАвтомобиль);
		НоваяЗаявка.ВидОбращения = Справочники.Renault_ВидыОбращенийВАвтосервис.ДоПриПродажеПоДоговору;
		НоваяЗаявка.ВидРемонта = Справочники.ВидыРемонта.ДополнительноеОборудование;
		НоваяЗаявка.ДоговорНаПродажуАвтомобиля = доДоговор;
		НоваяЗаявка.Менеджер = ПараметрыСеанса.Пользователь.Сотрудник;
		
		ФормаЗаявки = НоваяЗаявка.ПолучитьФорму("ФормаЗаявкиНаДокомлектацию");
		ФормаЗаявки.Открыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельТаблицыДанныхПоСостояниюАвтомобилейПринятьАвтоНаСклад(Кнопка)
	
	Если ЭтаФорма.Элементы.Список.ТекущиеДанные = Неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	Если ПараметрыСеанса.Renault_ПраваПользователя.Автосклад_ПравоПриемкиАвтоНаСклад Тогда
		ФормаОтметки = Обработки.Renault_АРМ_ВыдачаАвтомобилей.ПолучитьФорму("ФормаОтметкиПриемкиАвто");
		ФормаОтметки.Автомобиль = ЭтаФорма.Элементы.Список.ТекущиеДанные.Автомобиль;
		ФормаОтметки.ОткрытьМодально();
	Иначе
		Предупреждение("Вам недоступно право приемки автомобиля на склад");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПечатьЦенниковБУНаСервере(ТабДок, МассивСтрок)
	
	Макет = Обработки.Renault_АРМ_Автосклад_Упр.ПолучитьМакет("ЦенникПоТрейдИн");
	
	ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
	
	Для Каждого Стр Из МассивСтрок Цикл
		
		ОбластьШапки.Параметры.МаркаМодель = ""+Стр.ПроизводительКод + " "+Стр.Автомобиль.Модель; 
		ОбластьШапки.Параметры.Версия      = Стр.Автомобиль.ВариантКомплектации;
		ОбластьШапки.Параметры.ГодВыпуска  = Формат(Стр.Автомобиль.ГодВыпуска,"ДФ=yyyy");
		ОбластьШапки.Параметры.Пробег      = ""+Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Стр.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег) + "км";
		ОбластьШапки.Параметры.КоличествоВладельцев = Стр.КоличествоВладельцевПоПТС;
		
		ТабДок.Вывести(ОбластьШапки);
		
		ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
		
		тзОпцииАвтомобиля = ПолучитьОпцииАвтомобиля(Стр.Заявка);
		
		Оборудование = "";
		
		Для Каждого Комплектация Из тзОпцииАвтомобиля Цикл
			
			Оборудование = Оборудование+"- "+Комплектация.Опция+Символы.ПС;
			
		КонецЦикла;
		
		ОбластьСтрока.Параметры.Оборудование = Оборудование;
		ТабДок.Вывести(ОбластьСтрока);
		
		КредитноеПредложениеПоУмолчанию = ДанныеКредитногоПредложенияПоУмолчанию(Стр.Автомобиль);
		Подвал = Макет.ПолучитьОбласть("Подвал");
		
		Если ЗначениеЗаполнено(КредитноеПредложениеПоУмолчанию) Тогда
			КредитныеСтавки = КредитноеПредложениеПоУмолчанию.КредитныеСтавки[0];
			Подвал.Параметры.Ставка = ""+КредитныеСтавки.МаркетинговаяСтавка+"% в месяц''";
			Подвал.Параметры.Платеж = Формат((Стр.ОриентировочнаяЦена-Стр.ОриентировочнаяЦена/100*КредитноеПредложениеПоУмолчанию.ПервоначальныйВзносПоУмолчанию)/100*КредитныеСтавки.МаркетинговаяСтавка,"ЧДЦ=")+ " руб./мес.";
			Подвал.Параметры.СрокКредита = ""+КредитноеПредложениеПоУмолчанию.СрокПоУмолчанию +" месяцев";
			Подвал.Параметры.ПервоначальныйВзнос = Формат(Стр.ОриентировочнаяЦена/100*КредитноеПредложениеПоУмолчанию.ПервоначальныйВзносПоУмолчанию,"ЧДЦ=")+ " руб.";
		КонецЕсли;
		
		Подвал.Параметры.Цена = ""+Стр.ОриентировочнаяЦена + " руб.";
		Подвал.Параметры.КонецПериода = Формат(КонецМесяца(ТекущаяДата()),"ДЛФ=D")+"г.";
		
		ТабДок.Вывести(Подвал);
		ТабДок.АвтоМасштаб = Истина; 
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОпцииАвтомобиля(ЗаявкаНаТрейдИнСсылка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ЗаявкаНаТрейдИнСсылка);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Опции.Опция.Наименование КАК Опция
		|ИЗ
		|	Документ.Renault_ЗаявкаНаТрейдИн.Опции КАК Опции
		|ГДЕ
		|	Опции.Выбрана
		|	И Опции.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Опция
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРезультат;
	
КонецФункции

&НаСервере
Функция ДанныеКредитногоПредложенияПоУмолчанию(Автомобиль)
	
	КредитноеПредложение = Справочники.Renault_КредитныеПредложения.ОптимальноеКредитноеПредложение("", Автомобиль, Автомобиль.ВариантКомплектации);
	
	Если Не ЗначениеЗаполнено(КредитноеПредложение) Тогда
		КредитноеПредложение = Справочники.Renault_КредитныеПредложения.ОптимальноеКредитноеПредложение("", Автомобиль); 
	КонецЕсли;
		
	Возврат КредитноеПредложение;
	
КонецФункции

&НаКлиенте
Процедура ПечатьЦенниковБУ(Команда)
	
	ТабДок = Новый ТабличныйДокумент;
	МассивСтрок = Новый Массив;
	Для Каждого Стр Из Элементы.Подержанные.ВыделенныеСтроки Цикл
		МассивСтрок.Добавить(Элементы.Подержанные.ДанныеСтроки(стр));
	КонецЦикла;
	
	ПечатьЦенниковБУНаСервере(ТабДок,МассивСтрок);
	ТабДок.Показать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПечаитьЦенниковНаНовые(Команда)
	
	ИмяТаблицы = ИмяТекущейТаблицы();
	ТекущиеДанные = Элементы[ИмяТаблицы].ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПечатьЦенников = Обработки.Renault_ПечатьЦенников.Создать();
	ПечатьЦенников.Автомобиль = ТекущиеДанные.Автомобиль;
	ПечатьЦенников.ПолучитьФорму(,ЭтаФорма).Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Припарковать(Команда)
	
	ИмяТаблицы = ИмяТекущейТаблицы();
	
	Если ИмяТаблицы = "Список" Тогда
		ТекСтрока = Элементы.Список.ТекущиеДанные;
		Таблица = "Новые"
	ИначеЕсли ИмяТаблицы = "Перемещение" Тогда
		ТекСтрока = Элементы.Перемещение.ТекущиеДанные;
		Таблица = "Перемещение";
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ТекСтрока <> Неопределено Тогда
		
		ПараметрыОтбора = Новый Структура;
		
		Если Таблица = "Новые" Тогда
			ПараметрыОтбора.Вставить("Склад", ТекСтрока.СкладДилера);
		Иначе
			Если ЗначениеЗаполнено(ТекСтрока.Перемещение) Тогда
				ПараметрыОтбора.Вставить("Склад", ТекСтрока.СкладПолучатель);
			Иначе
				ПараметрыОтбора.Вставить("Склад", ТекСтрока.СкладОтправитель);
			КонецЕсли;
		КонецЕсли;
		
		Если  ПараметрыОтбора.Склад = Неопределено Тогда
			ОчиститьСообщения();
			Сообщить("Данный автомобиль находится не на складе дилера, невозможно препарковать.");
			Возврат;
		КонецЕсли;
		
		ПараметрыОтбора.Вставить("Автомобиль", ТекСтрока.Автомобиль);
		ПараметрыОтбора.Вставить("ТолькоСвободные",Истина);
		ОткрытьФорму("РегистрСведений.Renault_РазмещениеАвтомобилей.Форма.ФормаВыбораПарковочногоМеста", Новый Структура("ПараметрыОтбора", ПараметрыОтбора));
		
	Иначе
		Сообщить("Выберите строку");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсвободитьМесто(Команда)
	
	ИмяТаблицы = ИмяТекущейТаблицы();
	
	Если ИмяТаблицы = "Список" Тогда
		ТекСтрока = Элементы.Список.ТекущиеДанные;
		Таблица = "Новые"
	ИначеЕсли ИмяТаблицы = "Перемещение" Тогда
		ТекСтрока = Элементы.Перемещение.ТекущиеДанные;
		Таблица = "Перемещение";
	Иначе
		Возврат;
	КонецЕсли;
	Если ТекСтрока <> Неопределено Тогда
		Если НЕ РегистрыСведений.Renault_РазмещениеАвтомобилей.ОсвободитьПарковочноеМесто(ТекСтрока.Автомобиль) Тогда
			Сообщить("Не удалось очистить парковочное место автомобиля " + ТекСтрока.Автомобиль);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Информация(Команда)
	
	ФормаПомощь = Обработки.Renault_АРМ_Автосклад_Упр.ПолучитьФорму("ФормаПомощьУпр");
	ФормаПомощь.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодержанныеПриАктивизацииСтроки(Элемент)
	
	Запись = Элементы.Подержанные.ТекущиеДанные;
	Если Запись <> неопределено Тогда
		
		дс_Автомобиль = Запись.Автомобиль;
		дс_ТипАвтомобиля = Запись.ТипАвтомобиля;
		
		//Оплаты и пр.		
		дс_ДополнительныеЗатратыПоАвто = Запись.ДополнительныеЗатратыПоАвто;
		
		дс_Вин = Запись.VIN;
		
		дс_Модель = Запись.МодельНаименованиеПолное;
		дс_Версия = Запись.ВерсияНаименованиеПолное;
		дс_Цвет = Запись.ЦветНаименование;
		Дс_СоставОпций = "";
		
		дс_КодМодели = Запись.МодельАртикул;
		дс_КодВерсии = Запись.ВерсияАртикул;
		дс_КодЦвета = Запись.ЦветАртикул;
		
		Если Запись.ГодВыпуска = 0 Тогда
			дс_ГодВыпуска = "";
		Иначе
			дс_ГодВыпуска = СтрЗаменить(Строка(Запись.ГодВыпуска), Символ(160), "");
			дс_ГодВыпуска = дс_ГодВыпуска + " г.в.";
		КонецЕсли;
		дс_НаименованиеАвтомобиля = дс_Модель + " " + дс_Версия + " " + дс_Цвет + " " + дс_ГодВыпуска;
		
		дс_Комментарий = Запись.Примечание;
		
		дс_ОплатаАФМСогласована = Запись.ОплатаАФМСогласована;
		дс_ДатаОплатыАФМ = Запись.ПлановаяДатаОплатыАФМ;
		дс_ОплатаАФМОплачено = Запись.АвтоОплаченАФМ;
		дс_ПричинаВыкупа = Запись.ПричинаВыкупа;
		
		дс_ОплатаКлиентАвансВнесен = Запись.КлиентВнесАванс;
		дс_ОплатаКлиентПолностьюОплачено = Запись.КлиентПолностьюОплатилАвто;
		дс_ПлановаяДатаПолнойОплатыКлиентом = Запись.ПлановаяДатаПолнойОплатыКлиентом;
		
		///Статусы
		ЗакрепленоЗаКлиентомПоДаннымАФМ = (Запись.ЗакрепленоЗаКлиентомВDistri = Истина);			
		ЗакрепленоЗаКлиентом = Запись.УтвержденРезерв ИЛИ Запись.ПодписанДоговорКП;		
		ЗакрепленоЗаМенеджером = Запись.УтвержденРезерв;
		ЗаявкаНаРезервМенеджера = Запись.ЗаявленРезерв;
		
		дс_Клиент = Запись.Клиент;
		дс_РабочийЛист = Запись.РабочийЛист;
		дс_ФИОКлиента = "";
		дс_ТелефонКлиента = "";
		дс_EmailКлиента = "";
		дс_ДоговорКП = Запись.ДоговорКПСсылка;
		дс_ИдентификаторСтрокиДоговора = Запись.ИдентификаторСтрокиДоговора;
		
		Если ЗначениеЗаполнено(Запись.Менеджер) Тогда
			Элементы.Группа210.ТекущаяСтраница = Элементы.Группа211;
			ПодержанныеМенеджер = Строка(Запись.Менеджер);
		Иначе
			Элементы.Группа210.ТекущаяСтраница = Элементы.Группа212;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Запись.Клиент) Тогда
			Элементы.Группа207.ТекущаяСтраница = Элементы.Группа208;
		Иначе
			Элементы.Группа207.ТекущаяСтраница = Элементы.Группа209;
		КонецЕсли;
		
		Если ЗаявкаНаРезервМенеджера  Тогда
			Элементы.Группа213.ТекущаяСтраница = Элементы.Группа214;
		ИначеЕсли ЗакрепленоЗаМенеджером Тогда
			Элементы.Группа213.ТекущаяСтраница = Элементы.Группа215;
		Иначе
			Элементы.Группа213.ТекущаяСтраница = Элементы.Группа216;
		КонецЕсли;
		
		// страница "Distri.net"	
		дс_НомерКлиентскойЗаявки = Запись.НомерЗаявкиDistri;
		дс_НомерОрдераSedre = Запись.НомерЗаказаDistri;
		дс_ПродажаВнесенаВSedre = Запись.ПродажаВнесенаВDistri;
		
		дс_ПричинаИзмененияКЗ = Запись.ПричинаИзмененияКЗ;
		дс_КомментарийИзмененияКЗ = Запись.КомментарийИзмененияКЗ;
		
		//Прочее
		дс_Блокировка = Запись.Блокировка;
		дс_Статус = Запись.СтатусАвтомобиля;
		
		//Обновим отображение на форме
		Если дс_Блокировка = Истина Тогда	
			Элементы.Группа93.ТекущаяСтраница = Элементы.Заблокирован1;
		Иначе
			Элементы.Группа93.ТекущаяСтраница = Элементы.НЕЗаблокирован1;
		КонецЕсли;
		
        //Автомобиль
		
		Таблици = СписокПриАктивизацииСтрокиНаСервере_БезКонтекста(дс_Вин,дс_Автомобиль,дс_СоставОпций,Запись.ВерсияНаименованиеПолное,Запись.ГодВыпуска,ДилерскийЦентрПользователя,"БУ",Запись.Заявка,дс_Клиент);
		
		Если ЗначениеЗаполнено(дс_Клиент) Тогда
			
			дс_ФИОКлиента = Строка(дс_Клиент);
			
			дс_ТелефонКлиента = Таблици.дс_ТелефонКлиента;
			дс_EmailКлиента = Таблици.дс_EmailКлиента;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Запись.ДоговорКПСсылка) Тогда
			Элементы.Группа217.ТекущаяСтраница = Элементы.Группа218;
		иначе
			Элементы.Группа217.ТекущаяСтраница = Элементы.Группа219;
			
		КонецЕсли;
		
		ТаблицаОпций1.Параметры.УстановитьЗначениеПараметра("Ссылка",Запись.Заявка);
		
		ЗаявкиЗаказНарядыПоКомплектации1.Параметры.УстановитьЗначениеПараметра("Автомобиль",дс_Автомобиль);
		
		ТаблицаРезервовАвтомобилей.Параметры.УстановитьЗначениеПараметра("VIN",дс_Вин);
		
		ТаблицаАкцийПроизводителя.Параметры.УстановитьЗначениеПараметра("БезОтбора",Ложь);
		ТаблицаАкцийПроизводителя.Параметры.УстановитьЗначениеПараметра("ДилерскийЦентр",ДилерскийЦентрПользователя); 
		ТаблицаАкцийПроизводителя.Параметры.УстановитьЗначениеПараметра("ВариантКомплектации",Запись.Версия);
		ТаблицаАкцийПроизводителя.Параметры.УстановитьЗначениеПараметра("Модель",Запись.модель);
		ТаблицаАкцийПроизводителя.Параметры.УстановитьЗначениеПараметра("VIN",дс_Вин);
		ТаблицаАкцийПроизводителя.Параметры.УстановитьЗначениеПараметра("Год",Запись.ГодВыпуска);
		ТаблицаАкцийПроизводителя.Параметры.УстановитьЗначениеПараметра("ТекДата",ТекущаяДата());
		
		//Транспортировка
		//Данные берем напрямую из регистра, чтобы не хранить их в таблице
		
		дс_ПланДатаОтгрузки = Таблици.дс_ПланДатаОтгрузки;
		дс_ФактДатаОтгрузки = Таблици.дс_ФактДатаОтгрузки;
		дс_Субтранспортер = Таблици.дс_Субтранспортер;
		дс_ТранспортнаяКомпания = Таблици.дс_ТранспортнаяКомпания;
		дс_НазначениеДоставки = Таблици.дс_НазначениеДоставки;
		дс_Автовоз = Таблици.дс_Автовоз;
		дс_ВодительАвтовоза = Таблици.дс_ВодительАвтовоза;
		дс_ГородНазначения = Таблици.дс_ГородНазначения;
		дс_АдресМестаНазначения = Таблици.дс_АдресМестаНазначения;
		
		//Бухгалтерия
		//Данные берем напрямую из регистра, чтобы не хранить их в таблице
		
		дс_СерияНомерГТД = Таблици.дс_СерияНомерГТД;
		дс_ДатаГТД = Таблици.дс_ДатаГТД;
		дс_ТаможенныеОграничения = Таблици.дс_ТаможенныеОграничения;
		дс_Проформа = Таблици.дс_Проформа;
		дс_ТипФактурирования = Таблици.дс_ТипФактурирования;
		дс_НомерСчетФактуры = Таблици.дс_НомерСчетФактуры;
		дс_НомерТН = Таблици.дс_НомерТН;
		дс_НомерТТН = Таблици.дс_НомерТТН;
		
		СписокОтзывныхНот  = Таблици.СписокОтзывныхНот;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиПриАктивизацииСтроки(Элемент)
	
	Запись = Элементы.Заявки.ТекущиеДанные;
	Если Запись <> неопределено тогда
		
		дс_Автомобиль = Элементы.Заявки.ТекущиеДанные.Автомобиль;
		дс_ТипАвтомобиля = Запись.ТипАвтомобиля;
		
		//Оплаты и пр.		
		дс_ДополнительныеЗатратыПоАвто = Запись.ДополнительныеЗатратыПоАвто;
		
		дс_Вин = Запись.VIN;
		
		дс_Модель = Запись.Модель.НаименованиеПолное;
		дс_Версия = Запись.Версия.НаименованиеПолное;
		дс_Цвет = Запись.Цвет1.Наименование;
		Дс_СоставОпций = "";
		
		дс_КодМодели = Запись.Модель.Артикул;
		дс_КодВерсии = Запись.Версия.Артикул;
		дс_КодЦвета = Запись.Цвет1.Артикул;
		
		Если Запись.ГодВыпуска = 0 Тогда
			дс_ГодВыпуска = "";
		Иначе
			дс_ГодВыпуска = СтрЗаменить(Строка(Запись.ГодВыпуска), Символ(160), "");
			дс_ГодВыпуска = дс_ГодВыпуска + " г.в.";
		КонецЕсли;
		дс_НаименованиеАвтомобиля = дс_Модель + " " + дс_Версия + " " + дс_Цвет + " " + дс_ГодВыпуска;
		
		дс_Комментарий = Запись.Примечание;
		дс_КомментарийРуководителя = Запись.ПримечаниеРОП;
		
		дс_ОплатаАФМСогласована = Запись.ОплатаАФМСогласована;
		дс_ДатаОплатыАФМ = Запись.ПлановаяДатаОплатыАФМ;
		дс_ОплатаАФМОплачено = Запись.АвтоОплаченАФМ;
		дс_ПричинаВыкупа = Запись.ПричинаВыкупа;
		
		дс_ОплатаКлиентАвансВнесен = Запись.КлиентВнесАванс;
		дс_ОплатаКлиентПолностьюОплачено = Запись.КлиентПолностьюОплатилАвто;
		дс_ПлановаяДатаПолнойОплатыКлиентом = Запись.ПлановаяДатаПолнойОплатыКлиентом;
		
		//Даты
		дс_ДатаДСАПланФакт = Запись.ДатаДСАПланФакт;
		дс_ДатаОтгрузки = ?(ЗначениеЗаполнено(Запись.ДатаОтгрузкиПланФакт), Запись.ДатаОтгрузкиПланФакт, Запись.ДатаОтгрузкиОбещ);
		дс_ДатаОтгрузкиПлановая = Запись.ДатаОтгрузкиПлановая;
		дс_ДатаОтгрузкиФактическая = Запись.ДатаОтгрузкиФактическая;
		дс_ДатаОтгрузкиЖелаемая = Запись.ДатаОтгрузкиЖелаемая;
		
		///Статусы
		ЗакрепленоЗаКлиентомПоДаннымАФМ = (Запись.ЗакрепленоЗаКлиентомВDistri = Истина);
		ЗакрепленоЗаКлиентом = Запись.УтвержденРезерв ИЛИ Запись.ПодписанДоговорКП;
		ЗакрепленоЗаМенеджером = Запись.УтвержденРезерв;
		ЗаявкаНаРезервМенеджера = Запись.ЗаявленРезерв;
		
		Если ЗакрепленоЗаКлиентом Тогда
			Элементы.Группа57.ТекущаяСтраница = Элементы.Группа58;
		ИначеЕсли ЗаявкаНаРезервМенеджера Тогда
			Элементы.Группа57.ТекущаяСтраница = Элементы.Группа59;
		ИначеЕсли ЗакрепленоЗаМенеджером Тогда
			Элементы.Группа57.ТекущаяСтраница = Элементы.Группа60;
		Иначе
			Элементы.Группа57.ТекущаяСтраница = Элементы.Группа61;
		КонецЕсли;
		
		Если Запись.СтатусАвтомобиля = перечисления.CRM_СтатусыАвтомобилей.ВПроизводстве тогда
			  Элементы.Группа64.ТекущаяСтраница = Элементы.Группа66;
		ИначеЕсли Запись.СтатусАвтомобиля = перечисления.CRM_СтатусыАвтомобилей.ВПути тогда
			   Элементы.Группа64.ТекущаяСтраница = Элементы.Группа67;

		ИначеЕсли Запись.СтатусАвтомобиля = перечисления.CRM_СтатусыАвтомобилей.ВПутиКДилеру тогда
			     Элементы.Группа64.ТекущаяСтраница = Элементы.Группа69;

		ИначеЕсли Запись.СтатусАвтомобиля = перечисления.CRM_СтатусыАвтомобилей.ВыданКлиенту тогда
			  Элементы.Группа64.ТекущаяСтраница = Элементы.Группа71;

		ИначеЕсли Запись.СтатусАвтомобиля = перечисления.CRM_СтатусыАвтомобилей.ДоставленДилеру тогда
			  Элементы.Группа64.ТекущаяСтраница = Элементы.Группа70;

		ИначеЕсли Запись.СтатусАвтомобиля = перечисления.CRM_СтатусыАвтомобилей.ЗаказВПроизводство тогда
			    Элементы.Группа64.ТекущаяСтраница = Элементы.Группа65;

		ИначеЕсли Запись.СтатусАвтомобиля = перечисления.CRM_СтатусыАвтомобилей.НаСкладеАФМ тогда
			   Элементы.Группа64.ТекущаяСтраница = Элементы.Группа68;
		КонецЕсли;
		
		// страница "Distri.net"	
		дс_НомерКлиентскойЗаявки = Запись.НомерЗаявкиDistri;
		дс_НомерОрдераSedre = Запись.НомерЗаказаDistri;
		дс_ПродажаВнесенаВSedre = Запись.ПродажаВнесенаВDistri;
		//DMSREN-1104++++++++++++++++++++++++++++++++++++++++++++
		Попытка 
			с_НомерКлиентскойЗаявки = Запись.numCl;
			дс_НомерОрдераSedre = Запись.НомерОрдера;
			дс_ПродажаВнесенаВSedre = ЗначениеЗаполнено(Запись.ДатаПродажи);
		Исключение
		КонецПопытки;
		//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
		
		дс_ПричинаИзмененияКЗ = Запись.ПричинаИзмененияКЗ;
		дс_КомментарийИзмененияКЗ = Запись.КомментарийИзмененияКЗ;
		
		//Прочее
		дс_Блокировка = Запись.Блокировка;
		дс_Статус = Запись.СтатусАвтомобиля;
		
		//Обновим отображение на форме
		Если дс_Блокировка = Истина Тогда	
			Элементы.Группа55.ТекущаяСтраница = Элементы.Заблокирован;
		Иначе
			Элементы.Группа55.ТекущаяСтраница = Элементы.НЕЗаблокирован;
		КонецЕсли;
		
        //Автомобиль
		дс_КодРадио = Запись.КодРадио;
		
		Таблици = СписокПриАктивизацииСтрокиНаСервере_БезКонтекста(дс_Вин,дс_Автомобиль,дс_СоставОпций,Запись.Версия,Запись.ГодВыпуска,ДилерскийЦентрПользователя);
	
		ТаблицаОпций.Параметры.УстановитьЗначениеПараметра("Тариф", Таблици.Тариф);
		ТаблицаОпций.Параметры.УстановитьЗначениеПараметра("ВариантКомплектации",Запись.Версия);
		ТаблицаОпций.Параметры.УстановитьЗначениеПараметра("Модель", Запись.модель);		
		ТаблицаОпций.Параметры.УстановитьЗначениеПараметра("Vin", дс_Вин);	
		
		
		ТаблицаОпцийДилера.Параметры.УстановитьЗначениеПараметра("Автомобиль",дс_Автомобиль);
		
		ЗаявкиЗаказНарядыПоКомплектации.Параметры.УстановитьЗначениеПараметра("Автомобиль",дс_Автомобиль);
		
		ТаблицаРезервовАвтомобилей.Параметры.УстановитьЗначениеПараметра("VIN",дс_Вин);
		
		ТаблицаАкцийПроизводителя.Параметры.УстановитьЗначениеПараметра("БезОтбора",Ложь);
		ТаблицаАкцийПроизводителя.Параметры.УстановитьЗначениеПараметра("ДилерскийЦентр",ДилерскийЦентрПользователя); 
		ТаблицаАкцийПроизводителя.Параметры.УстановитьЗначениеПараметра("ВариантКомплектации",Запись.Версия);
		ТаблицаАкцийПроизводителя.Параметры.УстановитьЗначениеПараметра("Модель",Запись.модель);
		ТаблицаАкцийПроизводителя.Параметры.УстановитьЗначениеПараметра("VIN",дс_Вин);
		ТаблицаАкцийПроизводителя.Параметры.УстановитьЗначениеПараметра("Год",Запись.ГодВыпуска);
		ТаблицаАкцийПроизводителя.Параметры.УстановитьЗначениеПараметра("ТекДата",ТекущаяДата());
		
		дс_ПТС_Номер = Таблици.дс_ПТС_Номер;
		дс_ПТС_Дата = Таблици.дс_ПТС_Дата;
		дс_ПТС_Модель = Таблици.дс_ПТС_Модель;
		дс_ПТС_ТипТС = Таблици.дс_ПТС_ТипТС;
		дс_ПТС_КатегорияТС = Таблици.дс_ПТС_КатегорияТС;
		дс_ПТС_Год = Таблици.дс_ПТС_Год;
		дс_ПТС_НомерДвигателя = Таблици.дс_ПТС_НомерДвигателя;
		дс_ПТС_НомерШасси = Таблици.дс_ПТС_НомерШасси;
		дс_ПТС_НомерКузова = Таблици.дс_ПТС_НомерКузова;
		дс_ПТС_ЦветКузова = Таблици.дс_ПТС_ЦветКузова;
		дс_ПТС_РазрМаксМасса = Таблици.дс_ПТС_РазрМаксМасса;
		дс_ПТС_МассаБезНагрузки = Таблици.дс_ПТС_МассаБезНагрузки;
		дс_ПТС_МощностьДвигателя = Таблици.дс_ПТС_МощностьДвигателя;
		дс_ПТС_ОбъемДвигателя = Таблици.дс_ПТС_ОбъемДвигателя;
		дс_ПТС_ТипДвигателя = Таблици.дс_ПТС_ТипДвигателя;
		дс_ПТС_ЭкКлассДвигателя = Таблици.дс_ПТС_ЭкКлассДвигателя;
		дс_ПТС_Изготовитель = Таблици.дс_ПТС_Изготовитель;
		дс_ПТС_ОдобрениеТипаТС = Таблици.дс_ПТС_ОдобрениеТипаТС; 		
		дс_ПТС_Оттенок = Таблици.дс_ПТС_Оттенок; 
		
        //Транспортировка
		//Данные берем напрямую из регистра, чтобы не хранить их в таблице
		
		дс_ПланДатаОтгрузки = Таблици.дс_ПланДатаОтгрузки;
		дс_ФактДатаОтгрузки = Таблици.дс_ФактДатаОтгрузки;
		дс_Субтранспортер = Таблици.дс_Субтранспортер;
		дс_ТранспортнаяКомпания = Таблици.дс_ТранспортнаяКомпания;
		дс_НазначениеДоставки = Таблици.дс_НазначениеДоставки;
		дс_Автовоз = Таблици.дс_Автовоз;
		дс_ВодительАвтовоза = Таблици.дс_ВодительАвтовоза;
		дс_ГородНазначения = Таблици.дс_ГородНазначения;
		дс_АдресМестаНазначения = Таблици.дс_АдресМестаНазначения;
		
		//Бухгалтерия
		//Данные берем напрямую из регистра, чтобы не хранить их в таблице
		
		дс_СерияНомерГТД = Таблици.дс_СерияНомерГТД;
		дс_ДатаГТД = Таблици.дс_ДатаГТД;
		дс_ТаможенныеОграничения = Таблици.дс_ТаможенныеОграничения;
		дс_Проформа = Таблици.дс_Проформа;
		дс_ТипФактурирования = Таблици.дс_ТипФактурирования;
		дс_НомерСчетФактуры = Таблици.дс_НомерСчетФактуры;
		дс_НомерТН = Таблици.дс_НомерТН;
		дс_НомерТТН = Таблици.дс_НомерТТН;
		
		СписокОтзывныхНот  = Таблици.СписокОтзывныхНот;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура надписьОткрытьКарточкуРабочегоЛиста1Нажатие(Элемент)
	
	Renault_CRM.ОткрытьФормуРЛ(дс_РабочийЛист);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьОткрытьДоговорКП1Нажатие(Элемент)
	
	Если ЗначениеЗаполнено(дс_ДоговорКП) Тогда
		дс_ДоговорКП.ПолучитьФорму().Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьПерепродажу(Команда)
	
	ТекущиеДанные = Элементы.ДемоПодмен.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	DMS_ЗаявкаНаАвтомобиль.Ссылка
		|ИЗ
		|	Документ.DMS_ЗаявкаНаАвтомобиль КАК DMS_ЗаявкаНаАвтомобиль
		|ГДЕ
		|	DMS_ЗаявкаНаАвтомобиль.VIN = &VIN";
	
	Запрос.УстановитьПараметр("VIN", ТекущиеДанные.VIN);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ОткрытьЗначение(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗаявкуНаЗамену(Команда)
	
	ТекСтрока = Элементы.ДемоПодмен.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	АвтомобильНЕДляЗаявки = ТекСтрока.Автомобиль;
	МодельДляЗаявки     = ТекСтрока.Модель;
	ВерсияДляЗаявки     = ТекСтрока.Версия;
	ЦветДляЗаявки       = ТекСтрока.Цвет;
	
	Если Не ЗначениеЗаполнено(МодельДляЗаявки)
		ИЛИ Не ЗначениеЗаполнено(ВерсияДляЗаявки)
		ИЛИ Не ЗначениеЗаполнено(ЦветДляЗаявки) Тогда
		
		ФормаХарактеристик = ПолучитьФорму("ВыборХарактеристикАвтомобиля", , ЭтаФорма);
		ФормаХарактеристик.Модель = МодельДляЗаявки;
		ФормаХарактеристик.Версия = ВерсияДляЗаявки;
		ФормаХарактеристик.Цвет   = ЦветДляЗаявки;
		
		РезультатВыбораХарактеристик = ФормаХарактеристик.ОткрытьМодально();
		
		Если РезультатВыбораХарактеристик <> Неопределено Тогда
			МодельДляЗаявки = РезультатВыбораХарактеристик.Модель;
			ВерсияДляЗаявки	= РезультатВыбораХарактеристик.Версия;
			ЦветДляЗаявки   = РезультатВыбораХарактеристик.Цвет;
		КонецЕсли;
		
	КонецЕсли;
	
	ПоказыватьЗарезервированные      = Ложь;
	ПоказыватьЗакрепленныеЗаКлиентом = Ложь;
	ПоказыватьНеДляПродажи           = Ложь;
	ПоказыватьВыданныеАвтомобили     = Ложь;
	
	мСтруктураОтбораАвтосклад = Renault_РаботаСПравамиПользователя.ПолучитьСтруктуруНастроекАвтосклад(ПараметрыСеанса.Пользователь);
	МассивСкладовДилера = ДилерскийЦентрПользователя.СкладыДилера.ВыгрузитьКолонку("Склад");
	мДатаНеПоказыватьВыданныеАвтомобили = ДилерскийЦентрПользователя.ДатаНеПоказыватьВыданныеАвтомобили;
	
	мСтруктураОтбораАвтосклад.Вставить("ТипЦен",ДилерскийЦентрПользователя.ТипЦенПродажи);
	ТаблицаАвтомобилей = CRM_Сервер.Автосклад_ПолучитьТаблицуПоСостояниюАвтомобилей("", МассивСкладовДилера, BIR_Distri, Ложь, Ложь, Ложь, Ложь, МодельДляЗаявки, ВерсияДляЗаявки, ЦветДляЗаявки, Ложь, Неопределено, мДатаНеПоказыватьВыданныеАвтомобили, Ложь, мСтруктураОтбораАвтосклад);
	
	Если ТаблицаАвтомобилей.Количество() > 0 Тогда
		
		ПоискТекущегоАвто = ТаблицаАвтомобилей.НайтиСтроки(Новый Структура("Автомобиль", АвтомобильНЕДляЗаявки));
		Если ПоискТекущегоАвто.Количество() > 0 Тогда
			ТаблицаАвтомобилей.Удалить(ПоискТекущегоАвто[0]);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТаблицаАвтомобилей.Количество() = 0 Тогда
		Сообщить("Нет доступных для продажи автомобилей модели "+МодельДляЗаявки+", версии "+ВерсияДляЗаявки+", цвета "+ ЦветДляЗаявки+"!");
		Возврат;
	КонецЕсли;
	
	ФормаВыборАвто                     = Справочники.Автомобили.ПолучитьФорму("ВыборИзТаблицыЗначений",ЭтаФорма);
	ФормаВыборАвто.ТабличноеПолеВыбора = ТаблицаАвтомобилей;
	
	ВыбранныйАвтоДляЗаявки      = ФормаВыборАвто.ОткрытьМодально();
	
	Если ВыбранныйАвтоДляЗаявки = Неопределено Тогда
		Сообщить("Автомобиль не выбран!");
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаявка = Новый Структура();
	ПараметрыЗаявка.Вставить("Дата", ТекущаяДата());
	ПараметрыЗаявка.Вставить("Автор", ПараметрыСеанса.Пользователь);
	
	Если ТекСтрока.ТипЗаявки = "Демо" Тогда
		ПараметрыЗаявка.Вставить("ТипЗаявки", Справочники.DMS_ТипыЗаявки.Демо);
	Иначе 
		ПараметрыЗаявка.Вставить("ТипЗаявки", Справочники.DMS_ТипыЗаявки.Подменный);
	КонецЕсли;
	
	ПараметрыЗаявка.Вставить("VIN",    ВыбранныйАвтоДляЗаявки.VIN);
	ПараметрыЗаявка.Вставить("Версия", ВерсияДляЗаявки);
	ПараметрыЗаявка.Вставить("Модель", МодельДляЗаявки);
	ПараметрыЗаявка.Вставить("Цвет",   ЦветДляЗаявки);
	
	ДЦПользователя = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
	
	Если ЗначениеЗаполнено(ДЦПользователя) Тогда
		Дилер = Справочники.Контрагенты.НайтиПоНаименованию(ДЦПользователя.Наименование);
		Если Дилер = Справочники.Контрагенты.ПустаяСсылка() тогда
			Дилер = СоздатьКонтрагентаИзДилера(ДЦПользователя);
		КонецЕсли;
		ПараметрыЗаявка.Вставить("Клиент", Дилер);
		ПараметрыЗаявка.Вставить("Счет",   ДЦПользователя.СчетSedre);
	КонецЕсли;
	
	ОткрытьФорму("Документ.DMS_ЗаявкаНаАвтомобиль.Форма.ФормаДокументаУпр", ПараметрыЗаявка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СрокЭксплуатацииИстек(Команда)
	
	ЭлементОтбора = ДемоПодмен.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СрокЭксплуатацииИстек");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиВЭксплуатацию(Команда)
	
	ТекСтроки = Элементы.ДемоПодмен.ВыделенныеСтроки;
	Если ТекСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СкладДилера = Справочники.СкладыКомпании.ПустаяСсылка();
	ДокВвод = Неопределено;
	
	Для Каждого Стр Из ТекСтроки Цикл
		
		Если ТипЗнч(Стр.ДокументЭксплуатации) = Тип("ДокументСсылка.ВводВЭксплуатациюАвтомобилей") и ЗначениеЗаполнено(Стр.ДокументЭксплуатации) Тогда
			Сообщить("Автомобиль " + Стр.Автомобиль + " уже введен в эксплуатацию");
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.СкладДилера) Тогда
			Сообщить("Автомобиль остутствует на складах");
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Стр.ДокументЭксплуатации) = Тип("ДокументСсылка.СписаниеАктивов") и ЗначениеЗаполнено(Стр.ДокументЭксплуатации) Тогда
			Сообщить("Автомобиль " + Стр.Автомобиль + " уже был в эксплуатации");
			Продолжить;
		КонецЕсли;
		
		Если Стр.СкладДилера <> СкладДилера Тогда
			
			Если ДокВвод <> Неопределено Тогда
				ПараметрыОткрытия = Новый Структура("Ключ", ДокВвод);
				Результат = ОткрытьФормуМодально("Документ.ВводВЭксплуатациюАвтомобилей.Форма.ФормаДокумента", ПараметрыОткрытия, ЭтаФорма);
			КонецЕсли;
			
			ДокВвод = Документы.ВводВЭксплуатациюАвтомобилей.СоздатьДокумент();
			
			ДокВвод.Заполнить(Неопределено);
			ДокВвод.УстановитьНовыйНомер();
			
			ДокВвод.ХозОперация = Справочники.ХозОперации.ВводВЭксплуатациюАвтомобилей;
			ДокВвод.Организация = ПараметрыСеанса.Организация;
			ДокВвод.ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
			ДокВвод.СкладКомпании = Стр.СкладДилера;
			СкладДилера = Стр.СкладДилера;
		КонецЕсли;
		
		НовСтр = ДокВвод.Автомобили.Добавить();
		НовСтр.Автомобиль = Стр.Автомобиль;
		ДокВвод.ОбработкаРеквизита("Автомобили.Автомобиль", НовСтр);
		
		Актив = Справочники.ПрочиеАктивы.НайтиПоНаименованию("Автомобиль " + Стр.Автомобиль.Модель + " " + Стр.Автомобиль.VIN);
		
		Если обЗначениеНеЗаполнено(Актив) Тогда
			// создадим новый элемент прочие активы
			НовыйЭлемент = Справочники.ПрочиеАктивы.СоздатьЭлемент();
			НовыйЭлемент.ВидПрочегоАктива = Перечисления.ВидыПрочихАктивов.ОсновноеСредство;
			НовыйЭлемент.ТипНоменклатуры  = Справочники.ТипыНоменклатуры.Автомобили;
			НовыйЭлемент.УстановитьНовыйКод();
			НовыйЭлемент.ИнвентарныйНомер = НовыйЭлемент.Код;
			НовыйЭлемент.Наименование = "Автомобиль " + Стр.Автомобиль.Модель + " " + Стр.Автомобиль.VIN;
			НовыйЭлемент.Номенклатура = Справочники.Номенклатура.Автомобиль;
			ОсновнойТипЭксплуатации = Справочники.ТипыЭксплуатации.НайтиПоРеквизиту("СпособНачисленияАмортизации", Перечисления.СпособыНачисленияАмортизации.Линейный);
			Если ОсновнойТипЭксплуатации = Справочники.ТипыЭксплуатации.ПустаяСсылка() Тогда
				ОсновнойТипЭксплуатации = Справочники.ТипыЭксплуатации.СоздатьЭлемент();
				ОсновнойТипЭксплуатации.СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизации.Линейный;
				ОсновнойТипЭксплуатации.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ПерваяГруппа;
				ОсновнойТипЭксплуатации.Наименование = "Линейный";
				ОсновнойТипЭксплуатации.Записать();
			КонецЕсли;
			НовыйЭлемент.ОсновнойТипЭксплуатации = ОсновнойТипЭксплуатации;
			НовыйЭлемент.СрокПолезногоИспользования = НовыйЭлемент.ПолучитьСрокПолезногоИспользования(ОсновнойТипЭксплуатации.АмортизационнаяГруппа);
			НовыйЭлемент.Записать();
			Актив = НовыйЭлемент.Ссылка;
		КонецЕсли;
		
		НовСтр.Актив = Актив;
		ДокВвод.ОбработкаРеквизита("Автомобили.Актив", НовСтр);
		
	КонецЦикла;
	
	Если ДокВвод <> Неопределено Тогда
		ПараметрыОткрытия = Новый Структура("Ключ", ДокВвод);
		Результат = ОткрытьФормуМодально("Документ.ВводВЭксплуатациюАвтомобилей.Форма.ФормаДокумента", ПараметрыОткрытия, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиИзЭксплуатации(Команда)
	
	ТекСтроки = Элементы.ДемоПодмен.ВыделенныеСтроки;
	Если ТекСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Основание = Документы.ВводВЭксплуатациюАвтомобилей.ПустаяСсылка();
	ДокВвод = Неопределено;
	
	Для Каждого Стр Из ТекСтроки Цикл
		
		Если ТипЗнч(Стр.ДокументЭксплуатации) = Тип("ДокументСсылка.ВыводИзЭксплуатацииАвтомобилей") и ЗначениеЗаполнено(Стр.ДокументЭксплуатации) Тогда
			Сообщить("Автомобиль " + Стр.Автомобиль + " уже был в эксплуатации");
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.ДокументЭксплуатации) Тогда
			Сообщить("Автомобиль " + Стр.Автомобиль + " не введен в эксплуатацию");
			Продолжить;
		КонецЕсли;
		
		Если Стр.ДокументЭксплуатации <> Основание Тогда
			
			Если ДокВвод <> Неопределено Тогда
				ПараметрыОткрытия = Новый Структура("Ключ", ДокВвод);
				Результат = ОткрытьФормуМодально("Документ.ВыводИзЭксплуатацииАвтомобилей.Форма.ФормаДокумента", ПараметрыОткрытия, ЭтаФорма);
			КонецЕсли;
			
			ДокВвод = Документы.ВыводИзЭксплуатацииАвтомобилей.СоздатьДокумент();
			ДокВвод.ДокументОснование = Стр.ДокументЭксплуатации;
			ДокВвод.Заполнить(Стр.ДокументЭксплуатации);
			ДокВвод.УстановитьНовыйНомер();
			
			ДокВвод.ХозОперация = Справочники.ХозОперации.ВыводИзЭксплуатацииАвтомобилей;
			Основание = Стр.ДокументЭксплуатации;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДокВвод <> Неопределено Тогда
		ПараметрыОткрытия = Новый Структура("Ключ", ДокВвод);
		Результат = ОткрытьФормуМодально("Документ.ВыводИзЭксплуатацииАвтомобилей.Форма.ФормаДокумента", ПараметрыОткрытия, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналЗаявокНаПодбор(Команда)
	
	ПолучитьФорму("Обработка.Renault_АРМ_Автосклад_Упр.Форма.ФормаЗаявокНаПодбор").Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналДоговоров(Команда)
	
	Документы.Renault_Договор.ПолучитьФорму("ЖурналДоговоров").Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДействиеПодтверждениеИзменений(Команда)
	
	ФормаПодтверждения = ПолучитьФорму("Обработка.Renault_АРМ_Автосклад_Упр.Форма.ФормаПодтвержденияИзменений");
	ФормаПодтверждения.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РеестрИзменений(Команда)
	
	РегистрыСведений.Renault_ИзмененияАвтосклад.ПолучитьФормуСписка().Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Невыданные(Команда)
	
	ПоказыватьЗарезервированные = Истина;
	ПоказыватьЗакрепленныеЗаКлиентом = Истина;
	ПоказыватьНеДляПродажи = Истина;
	ПоказыватьВыданныеАвтомобили = Ложь;
	
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьЗарезервированные", 	  ПоказыватьЗарезервированные);
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьЗакрепленныеЗаКлиентом", ПоказыватьЗакрепленныеЗаКлиентом);
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьВыданныеАвтомобили", 	  ПоказыватьВыданныеАвтомобили);
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьНеДляПродажи", 		  ПоказыватьНеДляПродажи);
	
	НовыйПорядок = Список.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	НовыйПорядок.Поле = Новый ПолеКомпоновкиДанных("Порядок");
	НовыйПорядок.Использование = Истина;
	НовыйПорядок.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
	НовыйПорядок.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
	
	// +++ ВалиховГА 22.10.2021 DMSREN-1299
	УстановитьОформлениеФильтраСписка("Невыданные");
	// --- ВалиховГА 22.10.2021 DMSREN-1299
	
КонецПроцедуры

&НаКлиенте
Процедура Все(Команда)
	
	ПоказыватьЗарезервированные = Истина;
	ПоказыватьЗакрепленныеЗаКлиентом = Истина;
	ПоказыватьНеДляПродажи = Истина;
	ПоказыватьВыданныеАвтомобили = Истина;
	
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьЗарезервированные", 	  ПоказыватьЗарезервированные);
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьЗакрепленныеЗаКлиентом", ПоказыватьЗакрепленныеЗаКлиентом);
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьВыданныеАвтомобили", 	  ПоказыватьВыданныеАвтомобили);
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьНеДляПродажи", 		  ПоказыватьНеДляПродажи);
	
	НовыйПорядок = Список.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	НовыйПорядок.Поле = Новый ПолеКомпоновкиДанных("Порядок");
	НовыйПорядок.Использование = Истина;
	НовыйПорядок.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
	НовыйПорядок.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
	
	// +++ ВалиховГА 22.10.2021 DMSREN-1299
	УстановитьОформлениеФильтраСписка("Все");
	// --- ВалиховГА 22.10.2021 DMSREN-1299
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоФильтровПоСтатусамПриАктивизацииСтроки(Элемент)
	
	ТекущаяТаблица = ИмяТекущейТаблицы();
	Этаформа[ТекущаяТаблица].Отбор.Элементы.Очистить();
	Если ЗначениеЗаполнено(Элементы.ДеревоФильтровПоСтатусам.ТекущиеДанные.ТипОтбора) тогда
		
		ОтборСписка = Элементы.ДеревоФильтровПоСтатусам.ТекущиеДанные.ТипОтбора;
		ЭлементОтбора = Этаформа[ТекущаяТаблица].Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ПравоеЗначение = Элементы.ДеревоФильтровПоСтатусам.ТекущиеДанные.ЗначениеФильтра;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ОтборСписка);
		Если ТипЗнч(Элементы.ДеревоФильтровПоСтатусам.ТекущиеДанные.ЗначениеФильтра) = Тип("СписокЗначений") Тогда 
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		Иначе
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		КонецЕсли;
		
		ЭлементОтбора.Использование = Истина;
		
		Если Элементы.ДеревоФильтровПоСтатусам.ТекущиеДанные.ЗначениеФильтра = ПредопределенноеЗначение("Перечисление.CRM_СтатусыАвтомобилей.ВПроизводстве") Тогда
			
			мСтруктураОтбораАвтосклад = Renault_РаботаСПравамиПользователя.ПолучитьСтруктуруНастроекАвтосклад(ПараметрыСеанса.Пользователь);
			
			Если мСтруктураОтбораАвтосклад.ИспользоватьОтборПоАдресамОтгрузкиАвтоВПроизводстве Тогда
				
				СписокДЦ = Новый Массив;
				
				Для Каждого Строка Из мСтруктураОтбораАвтосклад.ДоступныеАдресаОтгрузки Цикл
					СписокДЦ.Добавить(Строка);
				КонецЦикла;
							
				ЭлементОтбора = Этаформа[ТекущаяТаблица].Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ПравоеЗначение = СписокДЦ;
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПодтвержденныйАдресОтгрузки");
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				ЭлементОтбора.Использование = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоФильтровПоПриоритетамПриАктивизацииСтроки(Элемент)
	
	ТекущаяТаблица = ИмяТекущейТаблицы();
	Этаформа[ТекущаяТаблица].Отбор.Элементы.Очистить();
	
	Если ЗначениеЗаполнено(Элементы.ДеревоФильтровПоПриоритетам.ТекущиеДанные.ТипОтбора) тогда
		
		ОтборСписка = Элементы.ДеревоФильтровПоПриоритетам.ТекущиеДанные.ТипОтбора;
		ЭлементОтбора = Этаформа[ТекущаяТаблица].Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ПравоеЗначение = Элементы.ДеревоФильтровПоПриоритетам.ТекущиеДанные.ЗначениеФильтра;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ОтборСписка);
		
		Если ТипЗнч(Элементы.ДеревоФильтровПоПриоритетам.ТекущиеДанные.ЗначениеФильтра) = Тип("СписокЗначений") Тогда 
					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		Иначе
					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		КонецЕсли;
		
		ЭлементОтбора.Использование = Истина;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОтбораПодержанных();
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	МассивТипов.Добавить(Тип("СправочникСсылка.Renault_Used_Автопроизводители"));
	ДеревоФильтровБУ =  РеквизитФормыВЗначение("ДеревоФильтровСПробегом");
	
	Схема = Элементы.Подержанные.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.Подержанные.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , ,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТЗ = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Производители = ТЗ.Скопировать(,"ПроизводительКод");
	Производители.Свернуть("ПроизводительКод");
	Производители.Сортировать("ПроизводительКод");
	ГодыВыпуска = ТЗ.Скопировать(,"ГодВыпуска");
	ГодыВыпуска.Свернуть("ГодВыпуска");
	ГодыВыпуска.Сортировать("ГодВыпуска");
	
	НСтрокаМодели = ДеревоФильтровБУ.Строки.Найти("Все производители");
	
	Если НСтрокаМодели = Неопределено тогда
		НСтрокаМодели = ДеревоФильтровБУ.Строки.Добавить();
		НСтрокаМодели.Представление = "Все производители";
		НСтрокаМодели.Пометка = 1;
		НСтрокаМодели.ЗначениеФильтра = Неопределено;
		НСтрокаМодели.ТипОтбора = "ПроизводительКод";
		СписокОтбораПроизводительКод = Новый СписокЗначений;
	КонецЕсли;
	
	Для каждого стрПроизводители из Производители цикл
		Если НСтрокаМодели.Строки.Найти(стрПроизводители.ПроизводительКод) = Неопределено тогда
			НСтрока = НСтрокаМодели.Строки.Добавить();
			НСтрока.Представление = стрПроизводители.ПроизводительКод;
			НСтрока.Пометка = 1;
			НСтрока.ЗначениеФильтра = стрПроизводители.ПроизводительКод;
			НСтрока.ТипОтбора = "ПроизводительКод"; 
			СписокОтбораПроизводительКод.Добавить(стрПроизводители.ПроизводительКод);
		КонецЕсли;
	КонецЦикла;
	
	НСтрокаГоды = ДеревоФильтровБУ.Строки.Найти("Все годы выпуска");
	
	Если НСтрокаГоды = Неопределено тогда
		НСтрокаГоды = ДеревоФильтровБУ.Строки.Добавить();
		НСтрокаГоды.Представление = "Все годы выпуска";
		НСтрокаГоды.Пометка = 1;
		НСтрокаГоды.ЗначениеФильтра = Неопределено;
		НСтрокаГоды.ТипОтбора = "ГодВыпуска";
	КонецЕсли;
	
	СписокОтбораГодВыпуска = Новый СписокЗначений;
	
	Для каждого стрГоды из ГодыВыпуска цикл
		Если НСтрокаГоды.Строки.Найти(стрГоды.ГодВыпуска) = Неопределено тогда
			НСтрока = НСтрокаГоды.Строки.Добавить();
			НСтрока.Представление = стрГоды.ГодВыпуска;
			НСтрока.Пометка = 1;
			НСтрока.ЗначениеФильтра = стрГоды.ГодВыпуска;
			НСтрока.ТипОтбора = "ГодВыпуска";
			СписокОтбораГодВыпуска.Добавить(стрГоды.ГодВыпуска);
		Конецесли;
	КонецЦикла;
	ЗначениеВРеквизитФормы(ДеревоФильтровБУ, "ДеревоФильтровСПробегом");
	
КонецПроцедуры

&НаСервере
Функция Автосклад_ПолучитьТаблицуДемоПодменок (ВИН = "") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("VIN", ВИН);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("СрокЭксплуатацииИстек", СрокЭксплуатацииИстек);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПОДСТРОКА(ДопИнформацияПоАвтомобилям.Примечание, 0, 1024) КАК Примечание,
	|	ПОДСТРОКА(ДопИнформацияПоАвтомобилям.ПримечаниеРОП, 0, 1024) КАК ПримечаниеРОП,
	|	ДопИнформацияПоАвтомобилям.ПлановаяДатаОплатыАФМ КАК ПлановаяДатаОплатыАФМ,
	|	ДопИнформацияПоАвтомобилям.ОплатаАФМСогласована КАК ОплатаАФМСогласована,
	|	ДопИнформацияПоАвтомобилям.ПТСПолученДилером КАК ПТСПолученДилером,
	|	ДопИнформацияПоАвтомобилям.ЖелаемаяДатаОтгрузки КАК ДатаОтгрузкиЖелаемая,
	|	ДопИнформацияПоАвтомобилям.ДилерскийЦентр КАК ДилерскийЦентр,
	|	ДопИнформацияПоАвтомобилям.СкладПТС КАК СкладПТС,
	|	ДопИнформацияПоАвтомобилям.ДополнительныеЗатратыПоАвто КАК ДополнительныеЗатратыПоАвто,
	|	ДопИнформацияПоАвтомобилям.ТипАвтомобиля КАК ТипАвтомобиля,
	|	ДопИнформацияПоАвтомобилям.АвтоОплаченАФМ КАК АвтоОплаченАФМ,
	|	ДопИнформацияПоАвтомобилям.ДопКолонка1 КАК ДопКолонка1,
	|	ДопИнформацияПоАвтомобилям.ДопКолонка2 КАК ДопКолонка2,
	|	ДопИнформацияПоАвтомобилям.ДопКолонка3 КАК ДопКолонка3,
	|	ДопИнформацияПоАвтомобилям.ДопКолонка4 КАК ДопКолонка4,
	|	ДопИнформацияПоАвтомобилям.ДопКолонка5 КАК ДопКолонка5,
	|	ДопИнформацияПоАвтомобилям.ДопКолонка6 КАК ДопКолонка6,
	|	ДопИнформацияПоАвтомобилям.ДопКолонка7 КАК ДопКолонка7,
	|	ДопИнформацияПоАвтомобилям.ДопКолонка8 КАК ДопКолонка8,
	|	ДопИнформацияПоАвтомобилям.ДопКолонка9 КАК ДопКолонка9,
	|	ДопИнформацияПоАвтомобилям.ДопКолонка10 КАК ДопКолонка10,
	|	ДопИнформацияПоАвтомобилям.ПричинаВыкупа КАК ПричинаВыкупа,
	|	ДопИнформацияПоАвтомобилям.Автомобиль КАК Автомобиль
	|ПОМЕСТИТЬ ДополнительнаяИнформация
	|ИЗ
	|	РегистрСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям КАК ДопИнформацияПоАвтомобилям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_ДемоПодменки.Номер КАК Номер,
	|	Renault_ДемоПодменки.ДатаСогласования КАК ДатаСогласования,
	|	Renault_ДемоПодменки.VIN КАК VIN,
	|	ВЫБОР
	|		КОГДА Renault_ДемоПодменки.ТипЗаявки = ""демо/подмен""
	|			ТОГДА ""демонстрационный/подменный""
	|		ИНАЧЕ Renault_ДемоПодменки.ТипЗаявки
	|	КОНЕЦ КАК ТипЗаявки,
	|	Renault_ДемоПодменки.ДатаПечатиПТС КАК ДатаПечатиПТС,
	|	Renault_ДемоПодменки.MV КАК MV,
	|	Renault_ДемоПодменки.СтатусMV КАК СтатусMV,
	|	Renault_ДемоПодменки.ДатаСтатусаMV КАК ДатаСтатусаMV,
	|	Renault_ДемоПодменки.ПричинаОтказаMV КАК ПричинаОтказаMV,
	|	Renault_ДемоПодменки.ПричинаОтказаMVТекст КАК ПричинаОтказаMVТекст,
	|	Renault_ДемоПодменки.TMR КАК TMR,
	|	Renault_ДемоПодменки.СтатусTMR КАК СтатусTMR,
	|	Renault_ДемоПодменки.ДатаСтатусаTMR КАК ДатаСтатусаTMR,
	|	Renault_ДемоПодменки.ПричинаОтказаTMR КАК ПричинаОтказаTMR,
	|	Renault_ДемоПодменки.ПричинаОтказаTMRТекст КАК ПричинаОтказаTMRТекст,
	|	Renault_ДемоПодменки.КонтрактОтправленДилеру КАК КонтрактОтправленДилеру,
	|	Renault_ДемоПодменки.ДатаОтправкиКонтрактаДилеру КАК ДатаОтправкиКонтрактаДилеру,
	|	Renault_ДемоПодменки.КонтрактПолученОтДилера КАК КонтрактПолученОтДилера,
	|	Renault_ДемоПодменки.ДатаПолученияКонтрактаОтДилера КАК ДатаПолученияКонтрактаОтДилера,
	|	Renault_ДемоПодменки.КонтрактПодписан КАК КонтрактПодписан,
	|	Renault_ДемоПодменки.ДатаПодписанияКонтракта КАК ДатаПодписанияКонтракта,
	|	Renault_ДемоПодменки.ПодписанныйКонтрактОтправлен КАК ПодписанныйКонтрактОтправлен,
	|	Renault_ДемоПодменки.ДатаОтправкиПодписанногоКонтракта КАК ДатаОтправкиПодписанногоКонтракта,
	|	Renault_ДемоПодменки.ПодписанныйКонтрактПолученЮристами КАК ПодписанныйКонтрактПолученЮристами,
	|	Renault_ДемоПодменки.ДатаПолученияПодписанногоКонтрактаЮристами КАК ДатаПолученияПодписанногоКонтрактаЮристами,
	|	Renault_ДемоПодменки.ДатаЗавершения КАК ДатаЗавершения,
	|	Renault_ДемоПодменки.ПредставлениеНомераДоговораПоставки КАК ПредставлениеНомераДоговораПоставки,
	|	Renault_ДемоПодменки.ДатаДоговораПоставки КАК ДатаДоговораПоставки,
	|	Renault_ДемоПодменки.ДатаНачалаЭксплуатации КАК ДатаНачалаЭксплуатации,
	|	Renault_ДемоПодменки.ДатаОкончанияЭксплуатации КАК ДатаОкончанияЭксплуатации,
	|	Renault_ДемоПодменки.ПричинаОтказаDCG КАК ПричинаОтказаDCG,
	|	Renault_ДемоПодменки.ПричинаОтказаDCGТекст КАК ПричинаОтказаDCGТекст,
	|	ВЫБОР
	|		КОГДА Renault_ДемоПодменки.ТочкаМаршрута = ""Завершен""
	|			ТОГДА ""В эксплуатации""
	|		ИНАЧЕ Renault_ДемоПодменки.ТочкаМаршрута
	|	КОНЕЦ КАК ТочкаМаршрута
	|ПОМЕСТИТЬ ВтДемо
	|ИЗ
	|	РегистрСведений.Renault_ДемоПодменки КАК Renault_ДемоПодменки
	|ГДЕ
	|	(Renault_ДемоПодменки.VIN = &VIN
	|			ИЛИ &VIN = """")
	|	И ВЫБОР
	|			КОГДА &СрокЭксплуатацииИстек = ЛОЖЬ
	|				ТОГДА Renault_ДемоПодменки.ДатаОкончанияЭксплуатации > &ТекущаяДата
	|			иначе Истина
	
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ПрочиеАктивыВЭксплуатацииОбороты.Регистратор) КАК Регистратор,
	|	ПрочиеАктивыВЭксплуатацииОбороты.Автомобиль КАК Автомобиль
	|ПОМЕСТИТЬ ВТПрочиеАктивы
	|ИЗ
	|	ВтДемо КАК ВтДемо
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеАктивыВЭксплуатации.Обороты(, , Регистратор, ) КАК ПрочиеАктивыВЭксплуатацииОбороты
	|		ПО ВтДемо.VIN = ПрочиеАктивыВЭксплуатацииОбороты.Автомобиль.VIN
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрочиеАктивыВЭксплуатацииОбороты.Автомобиль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании КАК СкладКомпании
	|ПОМЕСТИТЬ ВТОстатки
	|ИЗ
	|	ВтДемо КАК ВтДемо
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилейОстатки
	|		ПО ВтДемо.VIN = ОстаткиАвтомобилейОстатки.Автомобиль.VIN
	|ГДЕ
	|	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВтДемо.Номер КАК Номер,
	|	ВтДемо.ДатаСогласования КАК ДатаСогласования,
	|	ВтДемо.VIN КАК VIN,
	|	ВтДемо.ТипЗаявки КАК ТипЗаявки,
	|	ВтДемо.ДатаПечатиПТС КАК ДатаПечатиПТС,
	|	ВтДемо.MV КАК MV,
	|	ВтДемо.СтатусMV КАК СтатусMV,
	|	ВтДемо.ДатаСтатусаMV КАК ДатаСтатусаMV,
	|	ВтДемо.ПричинаОтказаMV КАК ПричинаОтказаMV,
	|	ВтДемо.ПричинаОтказаMVТекст КАК ПричинаОтказаMVТекст,
	|	ВтДемо.TMR КАК TMR,
	|	ВтДемо.СтатусTMR КАК СтатусTMR,
	|	ВтДемо.ДатаСтатусаTMR КАК ДатаСтатусаTMR,
	|	ВтДемо.ПричинаОтказаTMR КАК ПричинаОтказаTMR,
	|	ВтДемо.ПричинаОтказаTMRТекст КАК ПричинаОтказаTMRТекст,
	|	ВтДемо.КонтрактОтправленДилеру КАК КонтрактОтправленДилеру,
	|	ВтДемо.ДатаОтправкиКонтрактаДилеру КАК ДатаОтправкиКонтрактаДилеру,
	|	ВтДемо.КонтрактПолученОтДилера КАК КонтрактПолученОтДилера,
	|	ВтДемо.ДатаПолученияКонтрактаОтДилера КАК ДатаПолученияКонтрактаОтДилера,
	|	ВтДемо.КонтрактПодписан КАК КонтрактПодписан,
	|	ВтДемо.ДатаПодписанияКонтракта КАК ДатаПодписанияКонтракта,
	|	ВтДемо.ПодписанныйКонтрактОтправлен КАК ПодписанныйКонтрактОтправлен,
	|	ВтДемо.ДатаОтправкиПодписанногоКонтракта КАК ДатаОтправкиПодписанногоКонтракта,
	|	ВтДемо.ПодписанныйКонтрактПолученЮристами КАК ПодписанныйКонтрактПолученЮристами,
	|	ВтДемо.ДатаПолученияПодписанногоКонтрактаЮристами КАК ДатаПолученияПодписанногоКонтрактаЮристами,
	|	ВтДемо.ДатаЗавершения КАК ДатаЗавершения,
	|	ВтДемо.ПредставлениеНомераДоговораПоставки КАК ПредставлениеНомераДоговораПоставки,
	|	ВтДемо.ДатаДоговораПоставки КАК ДатаДоговораПоставки,
	|	ВтДемо.ДатаНачалаЭксплуатации КАК ДатаНачалаЭксплуатации,
	|	ВтДемо.ДатаОкончанияЭксплуатации КАК ДатаОкончанияЭксплуатации,
	|	ВтДемо.ПричинаОтказаDCG КАК ПричинаОтказаDCG,
	|	ВтДемо.ПричинаОтказаDCGТекст КАК ПричинаОтказаDCGТекст,
	|	ВтДемо.ТочкаМаршрута КАК ТочкаМаршрута,
	|	СостояниеАвтомобилей.ЦветМеталлик КАК ЦветМеталлик,
	|	СостояниеАвтомобилей.CODE_RADIO КАК КодРадио,
	|	ВЫБОР
	|		КОГДА СостояниеАвтомобилей.PTS_NUM = """"
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК НаличиеПТС,
	|	ЕСТЬNULL(СостояниеАвтомобилей.Статус, НЕОПРЕДЕЛЕНО) КАК СтатусАвтомобиля,
	|	СостояниеАвтомобилей.БлокировкаАФМ КАК Блокировка,
	|	Автомобили.Ссылка КАК Автомобиль,
	|	ЕСТЬNULL(СостояниеАвтомобилей.Модель, Автомобили.Ссылка.Модель) КАК Модель,
	|	ЕСТЬNULL(СостояниеАвтомобилей.Версия, Автомобили.Ссылка.ВариантКомплектации) КАК Версия,
	|	ЕСТЬNULL(СостояниеАвтомобилей.Цвет, Автомобили.Ссылка.Цвет) КАК Цвет,
	|	ЕСТЬNULL(СостояниеАвтомобилей.Модель.Артикул, Автомобили.Ссылка.Модель.Артикул) КАК МодельАртикул,
	|	ЕСТЬNULL(СостояниеАвтомобилей.Версия.Артикул, Автомобили.Ссылка.ВариантКомплектации.Артикул) КАК ВерсияАртикул,
	|	ЕСТЬNULL(СостояниеАвтомобилей.Цвет.Артикул, Автомобили.Ссылка.Цвет.Артикул) КАК ЦветАртикул,
	|	СостояниеАвтомобилей.YEAR КАК ГодВыпуска,
	|	ЕСТЬNULL(СостояниеАвтомобилей.Цвет.Наименование, Автомобили.Ссылка.Цвет.Наименование) КАК ЦветНаименование,
	|	ЕСТЬNULL(СостояниеАвтомобилей.Версия.НаименованиеПолное, Автомобили.Ссылка.ВариантКомплектации.НаименованиеПолное) КАК ВерсияНаименованиеПолное,
	|	ЕСТЬNULL(СостояниеАвтомобилей.Модель.НаименованиеПолное, Автомобили.Ссылка.Модель.НаименованиеПолное) КАК МодельНаименованиеПолное,
	|	ДополнительнаяИнформация.Примечание КАК Примечание,
	|	ДополнительнаяИнформация.ПримечаниеРОП КАК ПримечаниеРОП,
	|	ДополнительнаяИнформация.ПлановаяДатаОплатыАФМ КАК ПлановаяДатаОплатыАФМ,
	|	ДополнительнаяИнформация.ОплатаАФМСогласована КАК ОплатаАФМСогласована,
	|	ДополнительнаяИнформация.ПТСПолученДилером КАК ПТСПолученДилером,
	|	ДополнительнаяИнформация.ДатаОтгрузкиЖелаемая КАК ДатаОтгрузкиЖелаемая,
	|	ДополнительнаяИнформация.ДилерскийЦентр КАК ДилерскийЦентр,
	|	ДополнительнаяИнформация.СкладПТС КАК СкладПТС,
	|	ДополнительнаяИнформация.ДополнительныеЗатратыПоАвто КАК ДополнительныеЗатратыПоАвто,
	|	ДополнительнаяИнформация.ТипАвтомобиля КАК ТипАвтомобиля,
	|	ДополнительнаяИнформация.ДопКолонка1 КАК ДопКолонка1,
	|	ДополнительнаяИнформация.ДопКолонка2 КАК ДопКолонка2,
	|	ДополнительнаяИнформация.ДопКолонка3 КАК ДопКолонка3,
	|	ДополнительнаяИнформация.ДопКолонка4 КАК ДопКолонка4,
	|	ДополнительнаяИнформация.ДопКолонка5 КАК ДопКолонка5,
	|	ДополнительнаяИнформация.ДопКолонка6 КАК ДопКолонка6,
	|	ДополнительнаяИнформация.ДопКолонка7 КАК ДопКолонка7,
	|	ДополнительнаяИнформация.ДопКолонка8 КАК ДопКолонка8,
	|	ДополнительнаяИнформация.ДопКолонка9 КАК ДопКолонка9,
	|	ДополнительнаяИнформация.ДопКолонка10 КАК ДопКолонка10,
	|	ЛОЖЬ КАК КлиентВнесАванс,
	|	ЛОЖЬ КАК КлиентПолностьюОплатилАвто,
	|	ЛОЖЬ КАК ПлановаяДатаПолнойОплатыКлиентом,
	|	ЛОЖЬ КАК ЗакрепленоЗаКлиентомВDistri,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаДСАПланФакт,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОтгрузкиПланФакт,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОтгрузкиПлановая,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОтгрузкиФактическая,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОтгрузкиОбещ,
	|	ЛОЖЬ КАК УтвержденРезерв,
	|	"""" КАК НомерЗаявкиDistri,
	|	"""" КАК НомерЗаказаDistri,
	|	"""" КАК ПродажаВнесенаВDistri,
	|	ЛОЖЬ КАК ИзменитьКЗВDistri,
	|	ЛОЖЬ КАК ПодписанДоговорКП,
	|	ЛОЖЬ КАК ЗаявленРезерв,
	|	"""" КАК РабочийЛист,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.пустаяССылка) КАК клиент,
	|	ЗНАЧЕНИЕ(Документ.Renault_Договор.пустаяСсылка) КАК ДоговорКПСсылка,
	|	НЕОПРЕДЕЛЕНО КАК ПричинаИзмененияКЗ,
	|	"""" КАК КомментарийИзмененияКЗ,
	|	"""" КАК ИдентификаторСтрокиДоговора,
	|	ДополнительнаяИнформация.АвтоОплаченАФМ КАК АвтоОплаченАФМ,
	|	ДополнительнаяИнформация.ПричинаВыкупа КАК ПричинаВыкупа,
	|	"""" КАК Менеджер,
	|	ЕСТЬNULL(ВТОстатки.СкладКомпании, ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка)) КАК СкладДилера,
	|	ВТПрочиеАктивы.Регистратор КАК ДокументЭксплуатации,
	|	СостояниеАвтомобилей.СебестоимостьПоТН КАК СебестоимостьПоТН,
	|	СостояниеАвтомобилей.ЦенаПродажиАвтомобиля КАК ЦенаПродажиАвтомобиля,
	|	СостояниеАвтомобилей.ЦенаПродажиБаза,
	|	СостояниеАвтомобилей.DEALER_PRICE_DISC КАК СкидкаДилеру,
	|	СостояниеАвтомобилей.NUM_TTN КАК НомерТТН
	|ИЗ
	|	ВтДемо КАК ВтДемо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК СостояниеАвтомобилей
	|			ЛЕВОЕ СОЕДИНЕНИЕ ДополнительнаяИнформация КАК ДополнительнаяИнформация
	|			ПО СостояниеАвтомобилей.Автомобиль = ДополнительнаяИнформация.Автомобиль
	|		ПО ВтДемо.VIN = СостояниеАвтомобилей.VIN
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Автомобили КАК Автомобили
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТПрочиеАктивы КАК ВТПрочиеАктивы
	|			ПО Автомобили.Ссылка = ВТПрочиеАктивы.Автомобиль
	|		ПО ВтДемо.VIN = Автомобили.VIN
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстатки КАК ВТОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_РеквизитыСкладовКомпании КАК Renault_РеквизитыСкладовКомпании
	|			ПО ВТОстатки.СкладКомпании = Renault_РеквизитыСкладовКомпании.СкладКомпании
	|		ПО ВтДемо.VIN = ВТОстатки.Автомобиль.VIN
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ЕСТЬNULL(Renault_РеквизитыСкладовКомпании.СкладПодержанныхАвто, ЛОЖЬ) = ИСТИНА
	|					И ЕСТЬNULL(ВТПрочиеАктивы.Регистратор, ЗНАЧЕНИЕ(ДОкумент.ВводВЭксплуатациюАвтомобилей.ПустаяСсылка)) <> ЗНАЧЕНИЕ(ДОкумент.ВводВЭксплуатациюАвтомобилей.ПустаяСсылка)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ПравоЦен(Пользователь)
	
	Зап = Новый Запрос;
	Если ТипЗнч(Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
		Зап.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.РазрешитьПросмотрЦенВАвтоскладе, ЛОЖЬ) КАК РазрешитьПросмотрЦенВАвтоскладе
		|ИЗ
		|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
		|ГДЕ
		|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	Иначе
		Зап.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.РазрешитьПросмотрЦенВАвтоскладе, ЛОЖЬ) КАК РазрешитьПросмотрЦенВАвтоскладе
		|ИЗ
		|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
		|ГДЕ
		|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь.Сотрудник = &Пользователь";
	КонецЕсли;
	
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выбрать();
	ЕстьПраво = Ложь;
	Пока Шаблоны.Следующий() Цикл
		Если Шаблоны.РазрешитьПросмотрЦенВАвтоскладе Тогда
			ЕстьПраво = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ЕстьПраво;
	
КонецФункции

&НаКлиенте
Процедура ДемоПодменПриАктивизацииСтроки(Элемент)
	
	Запись = Элементы.ДемоПодмен.ТекущиеДанные;
	Если Запись <> неопределено тогда
		
		Элементы.СтранициОтображения1.ТекущаяСтраница = Элементы.Информация3;
		
		дс_Автомобиль = Элементы.Список.ТекущаяСтрока;
		дс_ТипАвтомобиля = Запись.ТипАвтомобиля;
		
		//Оплаты и пр.
		дс_ДополнительныеЗатратыПоАвто = Запись.ДополнительныеЗатратыПоАвто;
		
		дс_Вин = Запись.VIN;
		
		дс_Модель = Запись.Модель.НаименованиеПолное;
		дс_Версия = Запись.Версия.НаименованиеПолное;
		дс_Цвет = Запись.Цвет.Наименование;
		Дс_СоставОпций = "";
		
		дс_КодМодели = Запись.Модель.Артикул;
		дс_КодВерсии = Запись.Версия.Артикул;
		дс_КодЦвета = Запись.Цвет.Артикул;
		
		Если Запись.ГодВыпуска = 0 Тогда
			дс_ГодВыпуска = "";
		Иначе
			дс_ГодВыпуска = СтрЗаменить(Строка(Запись.ГодВыпуска), Символ(160), "");
			дс_ГодВыпуска = дс_ГодВыпуска + " г.в.";
		КонецЕсли;
		дс_НаименованиеАвтомобиля = дс_Модель + " " + дс_Версия + " " + дс_Цвет + " " + дс_ГодВыпуска;
		
		дс_Комментарий = Запись.Примечание;
		дс_КомментарийРуководителя = Запись.ПримечаниеРОП;
		
		дс_ОплатаАФМСогласована = Запись.ОплатаАФМСогласована;
		дс_ДатаОплатыАФМ = Запись.ПлановаяДатаОплатыАФМ;
		дс_ОплатаАФМОплачено = Запись.АвтоОплаченАФМ;
		дс_ПричинаВыкупа = Запись.ПричинаВыкупа;
		
		дс_ОплатаКлиентАвансВнесен = Запись.КлиентВнесАванс;
		дс_ОплатаКлиентПолностьюОплачено = Запись.КлиентПолностьюОплатилАвто;
		дс_ПлановаяДатаПолнойОплатыКлиентом = Запись.ПлановаяДатаПолнойОплатыКлиентом;
		
		//Даты
		дс_ДатаДСАПланФакт = Запись.ДатаДСАПланФакт;
		дс_ДатаОтгрузки = ?(ЗначениеЗаполнено(Запись.ДатаОтгрузкиПланФакт), Запись.ДатаОтгрузкиПланФакт, Запись.ДатаОтгрузкиОбещ);
		дс_ДатаОтгрузкиПлановая = Запись.ДатаОтгрузкиПлановая;
		дс_ДатаОтгрузкиФактическая = Запись.ДатаОтгрузкиФактическая;
		дс_ДатаОтгрузкиЖелаемая = Запись.ДатаОтгрузкиЖелаемая;
		
		
		///Статусы
		ЗакрепленоЗаКлиентомПоДаннымАФМ = (Запись.ЗакрепленоЗаКлиентомВDistri = Истина);
		ЗакрепленоЗаКлиентом = Запись.УтвержденРезерв ИЛИ Запись.ПодписанДоговорКП;
		ЗакрепленоЗаМенеджером = Запись.УтвержденРезерв;
		ЗаявкаНаРезервМенеджера = Запись.ЗаявленРезерв;
		
		Если ЗакрепленоЗаКлиентом Тогда
			Элементы.Группа57.ТекущаяСтраница = Элементы.Группа58;
		ИначеЕсли ЗаявкаНаРезервМенеджера Тогда
			Элементы.Группа57.ТекущаяСтраница = Элементы.Группа59;
		ИначеЕсли ЗакрепленоЗаМенеджером Тогда
			Элементы.Группа57.ТекущаяСтраница = Элементы.Группа60;
		Иначе
			Элементы.Группа57.ТекущаяСтраница = Элементы.Группа61;
		КонецЕсли;
		
		Если Запись.СтатусАвтомобиля = перечисления.CRM_СтатусыАвтомобилей.ВПроизводстве тогда
			  Элементы.Группа64.ТекущаяСтраница = Элементы.Группа66;
		ИначеЕсли Запись.СтатусАвтомобиля = перечисления.CRM_СтатусыАвтомобилей.ВПути тогда
			   Элементы.Группа64.ТекущаяСтраница = Элементы.Группа67;
		
		ИначеЕсли Запись.СтатусАвтомобиля = перечисления.CRM_СтатусыАвтомобилей.ВПутиКДилеру тогда
			     Элементы.Группа64.ТекущаяСтраница = Элементы.Группа69;
		
		ИначеЕсли Запись.СтатусАвтомобиля = перечисления.CRM_СтатусыАвтомобилей.ВыданКлиенту тогда
			  Элементы.Группа64.ТекущаяСтраница = Элементы.Группа71;
		
		ИначеЕсли Запись.СтатусАвтомобиля = перечисления.CRM_СтатусыАвтомобилей.ДоставленДилеру тогда
			  Элементы.Группа64.ТекущаяСтраница = Элементы.Группа70;
		
		ИначеЕсли Запись.СтатусАвтомобиля = перечисления.CRM_СтатусыАвтомобилей.ЗаказВПроизводство тогда
			    Элементы.Группа64.ТекущаяСтраница = Элементы.Группа65;
		
		ИначеЕсли Запись.СтатусАвтомобиля = перечисления.CRM_СтатусыАвтомобилей.НаСкладеАФМ тогда
			   Элементы.Группа64.ТекущаяСтраница = Элементы.Группа68;
		КонецЕсли;
		
		// страница "Distri.net"	
		дс_НомерКлиентскойЗаявки = Запись.НомерЗаявкиDistri;
		дс_НомерОрдераSedre = Запись.НомерЗаказаDistri;
		дс_ПродажаВнесенаВSedre = Запись.ПродажаВнесенаВDistri;
		
		дс_ПричинаИзмененияКЗ = Запись.ПричинаИзмененияКЗ;
		дс_КомментарийИзмененияКЗ = Запись.КомментарийИзмененияКЗ;
		
		//Прочее
		дс_Блокировка = Запись.Блокировка;
		дс_Статус = Запись.СтатусАвтомобиля;
		
		//Обновим отображение на форме
		Если дс_Блокировка = Истина Тогда	
			Элементы.Группа55.ТекущаяСтраница = Элементы.Заблокирован;
		Иначе
			Элементы.Группа55.ТекущаяСтраница = Элементы.НЕЗаблокирован;
		КонецЕсли;
		
        //Автомобиль
		
		дс_КодРадио = Запись.КодРадио;
		
		Таблици = СписокПриАктивизацииСтрокиНаСервере_БезКонтекста(дс_Вин,дс_Автомобиль,дс_СоставОпций,Запись.Версия,Запись.ГодВыпуска,ДилерскийЦентрПользователя);
		
		ТаблицаОпций.Параметры.УстановитьЗначениеПараметра("Тариф", Таблици.Тариф);
		ТаблицаОпций.Параметры.УстановитьЗначениеПараметра("ВариантКомплектации",Запись.Версия);
		ТаблицаОпций.Параметры.УстановитьЗначениеПараметра("Модель", Запись.модель);
		ТаблицаОпций.Параметры.УстановитьЗначениеПараметра("Vin", дс_Вин);	
		ТаблицаОпцийДилера.Параметры.УстановитьЗначениеПараметра("Автомобиль",дс_Автомобиль);
		
		ЗаявкиЗаказНарядыПоКомплектации.Параметры.УстановитьЗначениеПараметра("Автомобиль",дс_Автомобиль);
		
		ТаблицаРезервовАвтомобилей.Параметры.УстановитьЗначениеПараметра("VIN",дс_Вин);
		
		ТаблицаАкцийПроизводителя.Параметры.УстановитьЗначениеПараметра("БезОтбора",Ложь);
		ТаблицаАкцийПроизводителя.Параметры.УстановитьЗначениеПараметра("ДилерскийЦентр",ДилерскийЦентрПользователя); 
		ТаблицаАкцийПроизводителя.Параметры.УстановитьЗначениеПараметра("ВариантКомплектации",Запись.Версия);
		ТаблицаАкцийПроизводителя.Параметры.УстановитьЗначениеПараметра("Модель",Запись.модель);
		ТаблицаАкцийПроизводителя.Параметры.УстановитьЗначениеПараметра("VIN",дс_Вин);
		ТаблицаАкцийПроизводителя.Параметры.УстановитьЗначениеПараметра("Год",Запись.ГодВыпуска);
		ТаблицаАкцийПроизводителя.Параметры.УстановитьЗначениеПараметра("ТекДата",ТекущаяДата());
		
		дс_ПТС_Номер = Таблици.дс_ПТС_Номер;
		дс_ПТС_Дата = Таблици.дс_ПТС_Дата;
		дс_ПТС_Модель = Таблици.дс_ПТС_Модель;
		дс_ПТС_ТипТС = Таблици.дс_ПТС_ТипТС;
		дс_ПТС_КатегорияТС = Таблици.дс_ПТС_КатегорияТС;
		дс_ПТС_Год = Таблици.дс_ПТС_Год;
		дс_ПТС_НомерДвигателя = Таблици.дс_ПТС_НомерДвигателя;
		дс_ПТС_НомерШасси = Таблици.дс_ПТС_НомерШасси;
		дс_ПТС_НомерКузова = Таблици.дс_ПТС_НомерКузова;
		дс_ПТС_ЦветКузова = Таблици.дс_ПТС_ЦветКузова;
		дс_ПТС_РазрМаксМасса = Таблици.дс_ПТС_РазрМаксМасса;
		дс_ПТС_МассаБезНагрузки = Таблици.дс_ПТС_МассаБезНагрузки;
		дс_ПТС_МощностьДвигателя = Таблици.дс_ПТС_МощностьДвигателя;
		дс_ПТС_ОбъемДвигателя = Таблици.дс_ПТС_ОбъемДвигателя;
		дс_ПТС_ТипДвигателя = Таблици.дс_ПТС_ТипДвигателя;
		дс_ПТС_ЭкКлассДвигателя = Таблици.дс_ПТС_ЭкКлассДвигателя;
		дс_ПТС_Изготовитель = Таблици.дс_ПТС_Изготовитель;
		дс_ПТС_ОдобрениеТипаТС = Таблици.дс_ПТС_ОдобрениеТипаТС;
		дс_ПТС_Оттенок = Таблици.дс_ПТС_Оттенок; 
		
        //Транспортировка
		//Данные берем напрямую из регистра, чтобы не хранить их в таблице
		
		дс_ПланДатаОтгрузки = Таблици.дс_ПланДатаОтгрузки;
		дс_ФактДатаОтгрузки = Таблици.дс_ФактДатаОтгрузки;
		дс_Субтранспортер = Таблици.дс_Субтранспортер;
		дс_ТранспортнаяКомпания = Таблици.дс_ТранспортнаяКомпания;
		дс_НазначениеДоставки = Таблици.дс_НазначениеДоставки;
		дс_Автовоз = Таблици.дс_Автовоз;
		дс_ВодительАвтовоза = Таблици.дс_ВодительАвтовоза;
		дс_ГородНазначения = Таблици.дс_ГородНазначения;
		дс_АдресМестаНазначения = Таблици.дс_АдресМестаНазначения;
		
		//Бухгалтерия
		//Данные берем напрямую из регистра, чтобы не хранить их в таблице
		
		дс_СерияНомерГТД = Таблици.дс_СерияНомерГТД;
		дс_ДатаГТД = Таблици.дс_ДатаГТД;
		дс_ТаможенныеОграничения = Таблици.дс_ТаможенныеОграничения;
		дс_Проформа = Таблици.дс_Проформа;
		дс_ТипФактурирования = Таблици.дс_ТипФактурирования;
		дс_НомерСчетФактуры = Таблици.дс_НомерСчетФактуры;
		дс_НомерТН = Таблици.дс_НомерТН;
		дс_НомерТТН = Таблици.дс_НомерТТН;
		
		СписокОтзывныхНот  = Таблици.СписокОтзывныхНот;
		
	Иначе
		
		Элементы.СтранициОтображения1.ТекущаяСтраница = Элементы.Группа234;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Порядок(Команда)
	
	Для каждого стр из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(стр) = Тип("ПорядокКомпоновкиДанных") тогда
			Для каждого п из стр.Элементы цикл 
				п.поле  = Новый ПолеКомпоновкиДанных("Порядок");
				п.Использование = истина;
				п.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
				Прервать;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ТаблицаОпцийДляКомПредложения(БУ, ВИН, Автомобиль, СоставОпций, Версия, ЗаявкаНаТрейдИнСсылка = Неопределено)
	
	Структура = новый Структура;
	//Опции
	Если БУ="БУ" Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ЗаявкаНаТрейдИнСсылка);
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Опции.Опция КАК Опция,
			|	Опции.Опция.Код КАК Код,
			|	Опции.Опция.Наименование КАК ИмяОпции
			|ИЗ
			|	Документ.Renault_ЗаявкаНаТрейдИн.Опции КАК Опции
			|ГДЕ
			|	Опции.Выбрана
			|	И Опции.Ссылка = &Ссылка
			|
			|УПОРЯДОЧИТЬ ПО
			|	Опция
			|АВТОУПОРЯДОЧИВАНИЕ";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Таб = РезультатЗапроса.Выгрузить();
		Структура.Вставить("Опции",Таб);
		
	Иначе
		
		ТаблицаОпцийАвтомобиля = Renault_CRM.ПолучитьТаблицуОпцийПоВин(ВИН);
		МассивОпцийАвтомобиля = ТаблицаОпцийАвтомобиля.ВыгрузитьКолонку("Опция");
		
		Если ЗначениеЗаполнено(СоставОпций) Тогда 
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Renault_ТарифНаОпцииАвтомобилей.Опция.Артикул КАК Код,
			|	Renault_ТарифНаОпцииАвтомобилей.Опция КАК Опция,
			|	Renault_ТарифНаОпцииАвтомобилей.ЦенаКлиентская КАК Сумма,
			|	Renault_ТарифНаОпцииАвтомобилей.НаименованиеОпции КАК ИмяОпции
			|ИЗ
			|	РегистрСведений.Renault_ТарифНаОпцииАвтомобилей.СрезПоследних(
			|			,
			|			Тариф = &Тариф
			|				И Модель = &Модель
			|				И ВариантКомплектации = &ВариантКомплектации) КАК Renault_ТарифНаОпцииАвтомобилей
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ОпцииАвтомобилей КАК Renault_ОпцииАвтомобилей
			|		ПО Renault_ТарифНаОпцииАвтомобилей.Опция = Renault_ОпцииАвтомобилей.Опция
			|ГДЕ
			|	Renault_ОпцииАвтомобилей.VIN = &VIN";
			Запрос.УстановитьПараметр("МассивОпцийАвтомобиля", МассивОпцийАвтомобиля);
			Запрос.УстановитьПараметр("Тариф", Renault_CRM.ПолучитьПоследнийТарифНаАвтомобиль(Версия));
			Запрос.УстановитьПараметр("ВариантКомплектации", Версия);
			Запрос.УстановитьПараметр("Модель", Автомобиль.Модель);
			Запрос.УстановитьПараметр("Vin", Вин);
			Результат = Запрос.Выполнить().Выгрузить();
			Структура.Вставить("Опции", Результат);
			
		Иначе
			
			Структура.Вставить("Опции", Новый ТаблицаЗначений);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	НастройкиБазы = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	
	Если НастройкиБазы.ИспользоватьТиповойУчетДО Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		|	КомплектацияАвтомобилейОстаткиИОбороты.Автомобиль,
		|	КомплектацияАвтомобилейОстаткиИОбороты.Номенклатура КАК Опция,
		|	СУММА(КомплектацияАвтомобилейОстаткиИОбороты.СуммаПродажиПриход) КАК Сумма,
		|	СУММА(КомплектацияАвтомобилейОстаткиИОбороты.КоличествоПриход) КАК Количество
		|ИЗ
		|	РегистрНакопления.КомплектацияАвтомобилей.ОстаткиИОбороты(, , Регистратор, , Автомобиль = &Автомобиль) КАК КомплектацияАвтомобилейОстаткиИОбороты
		|ГДЕ
		|	КомплектацияАвтомобилейОстаткиИОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|
		|СГРУППИРОВАТЬ ПО
		|	КомплектацияАвтомобилейОстаткиИОбороты.Автомобиль,
		|	КомплектацияАвтомобилейОстаткиИОбороты.Номенклатура";
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_УстановленноеОборудованиеАвтомобилейОстатки.Автомобиль,
		|	Renault_УстановленноеОборудованиеАвтомобилейОстатки.Оборудование КАК Опция,
		|	Renault_УстановленноеОборудованиеАвтомобилейОстатки.СтоимостьОстаток КАК Сумма,
		|	Renault_УстановленноеОборудованиеАвтомобилейОстатки.СебестоимостьОстаток,
		|	Renault_УстановленноеОборудованиеАвтомобилейОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.Renault_УстановленноеОборудованиеАвтомобилей.Остатки(, Автомобиль = &Автомобиль) КАК Renault_УстановленноеОборудованиеАвтомобилейОстатки";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	Таб  = Запрос.Выполнить().Выгрузить();
	Если Таб.Количество() Тогда
		Структура.Вставить("ДилОпции",Истина);
		Структура.Вставить("ТабДилОпции",Таб);
	Иначе
		Структура.Вставить("ДилОпции",Ложь);
		Структура.Вставить("ТабДилОпции",Таб);
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "СписокЦенаПродажи"  тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если НЕ Renault_РаботаСПравамиПользователя.ЕстьПравоИспользоватьАрмРОП(ПараметрыСеанса.Пользователь)
			И НЕ Renault_РаботаСПравамиПользователя.ЕстьПравоАдминистратораАвтосклада(ПараметрыСеанса.Пользователь) Тогда
			
			Сообщить("Для изменения цены необходимы права на АРМ Руководитель ОП или права ""Администратор автосклада""");
			Возврат;
		КонецЕсли;
		
		ЦенаПродажиРОП = Элементы.Список.ТекущиеДанные.ЦенаПродажи;
		
		Если ВвестиЧисло(ЦенаПродажиРОП, "Новая цена продажи", 10, 2) Тогда
			
			Запись = РегистрыСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям.СоздатьМенеджерЗаписи();
			Запись.Автомобиль = Элементы.Список.ТекущиеДанные.Автомобиль;
			Запись.Прочитать();
			Если Не Запись.Выбран() Тогда
				Запись.Период = ТекущаяДата();
				Запись.Автомобиль = Элементы.Список.ТекущиеДанные.Автомобиль;
			КонецЕсли;
			
			Запись.ЦенаФиксирована = Ложь;
			Запись.ЦенаПродажиРОП = ЦенаПродажиРОП;
			Запись.Записать();
			
			Элементы.Список.ТекущиеДанные.ЦенаПродажи = ЦенаПродажиРОП;
			Элементы.Список.Обновить();
		КонецЕсли;
		
	КонецЕсли;
	
	Если (Поле.Имя = "СписокАдресОтгрузки" или Поле.Имя = "СписокДатаОтгрузки") и Элементы.Список.ТекущиеДанные.КартинкаСостоянияАвто = 3 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	CRM_СостояниеАвтомобилейПроизводителя_v2.DATE_PLAN
			|ИЗ
			|	РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
			|ГДЕ
			|	CRM_СостояниеАвтомобилейПроизводителя_v2.VIN = &VIN";
		Запрос.УстановитьПараметр("VIN", Элементы.Список.ТекущиеДанные.VIN);
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Если ЗначениеЗаполнено(Выборка.DATE_PLAN) Тогда
			Предупреждение("Нельзя указать желаемую дату поставки и точку, т.к. а/м уже запланирован к отгрузке");
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.ДатаОтгрузки) Тогда
			Предупреждение("Нельзя изменить ранее введенные данные.
				|Обратитесь, пожалуйста, в службу дистрибуции Renault.");
			Возврат;
		КонецЕсли;
		
		ЗаявкаНаОтгрузкуПрошлая = НайтиЗаявкуНаОтгрузку(Элементы.Список.ТекущиеДанные.VIN);
		Если ЗначениеЗаполнено(ЗаявкаНаОтгрузкуПрошлая) Тогда
			Предупреждение("Уже заведена заявка на отгрузку - " + ЗаявкаНаОтгрузкуПрошлая + "!");
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.ДатаОтгрузкиОбещ) Тогда
			Предупреждение("Автомобиль уже запланирован к отгрузке");
			Возврат;
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("VIN", Элементы.Список.ТекущиеДанные.VIN);
		ПараметрыФормы.Вставить("BIR", Лев(ДилерскийЦентрПользователя.BIR, 8));
		ПараметрыФормы.Вставить("ОбновлятьТолькоСтроку", Истина);
		ОткрытьФормуМодально("Документ.DMS_ЗаявкаНаОтгрузку.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма);
		
		ЗаявкаНаОтгрузкуСозданная = НайтиЗаявкуНаОтгрузку(Элементы.Список.ТекущиеДанные.VIN);
		Если ЗначениеЗаполнено(ЗаявкаНаОтгрузкуСозданная) Тогда
			ВыбраннаяСтрока.АдресОтгрузки =	ЗаявкаНаОтгрузкуСозданная.АдресОтгрузки;
			ВыбраннаяСтрока.ДатаОтгрузки =	ЗаявкаНаОтгрузкуСозданная.ДатаОтгрузки;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЦенаПродажиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ Renault_РаботаСПравамиПользователя.ЕстьПравоИспользоватьАрмРОП(ПараметрыСеанса.Пользователь)
		И НЕ Renault_РаботаСПравамиПользователя.ЕстьПравоАдминистратораАвтосклада(ПараметрыСеанса.Пользователь) Тогда
		
		Сообщить("Для изменения цены необходимы права на АРМ Руководитель ОП или права ""Администратор автосклада""");
		Возврат;
		
	КонецЕсли;
	
	ЦенаПродажиРОП = Элементы.Список.ТекущиеДанные.ЦенаПродажи;
	
	Если ВвестиЧисло(ЦенаПродажиРОП, "Новая цена продажи", 10, 2) Тогда
		
		Запись = РегистрыСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям.СоздатьМенеджерЗаписи();
		Запись.Автомобиль = Элементы.Список.ТекущиеДанные.Автомобиль;
		Запись.Прочитать();
		Если Не Запись.Выбран() Тогда
			Запись.Период = ТекущаяДата();
			Запись.Автомобиль = Элементы.Список.ТекущиеДанные.Автомобиль;
		КонецЕсли;
		
		Запись.ЦенаФиксирована = Ложь;
		Запись.ЦенаПродажиРОП = ЦенаПродажиРОП;
		Запись.Записать();
		
		Элементы.Список.ТекущиеДанные.ЦенаПродажи = ЦенаПродажиРОП;
		
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиЗаявкуНаОтгрузку(VIN)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	DMS_ЗаявкаНаОтгрузку.Ссылка
		|ИЗ
		|	Документ.DMS_ЗаявкаНаОтгрузку КАК DMS_ЗаявкаНаОтгрузку
		|ГДЕ
		|	DMS_ЗаявкаНаОтгрузку.VIN = &VIN";
	
	Запрос.УстановитьПараметр("VIN", VIN);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Документы.DMS_ЗаявкаНаОтгрузку.ПустаяСсылка();
	
КонецФункции

&НаКлиенте
Процедура Заявка(Команда)
	
	Для каждого стр Из Элементы.Список.ВыделенныеСтроки Цикл
		
		ТД = Элементы.Список.ДанныеСтроки(стр);
		Если ТД.КартинкаСостоянияАвто = 3 тогда
			
			ЭлементыОтбора = Новый Структура;
			ЭлементыОтбора.Вставить("BIR",Лев(ДилерскийЦентрПользователя.BIR, 8));
			ЭлементыОтбора.Вставить("VIN",ТД.VIN);
			ЭлементыОтбора.Вставить("Дата",ТекущаяДата());
			ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
			ОткрытьФорму("Документ.DMS_ЗаявкаНаОтгрузку.Форма.ФормаДокумента", ПараметрыФормы,ЭтаФорма,Новый УникальныйИдентификатор);
			
		Иначе
			Сообщить("У автомобиля " + ТД.vin+ " не подходит статус");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьПеремещение(СкладОтправитель = "",СкладПолучатель = "")
	
	Если СкладОтправитель = "" Тогда
		СкладОтправитель = Справочники.СкладыКомпании.ПустаяСсылка();
	КонецЕсли;
	
	Если СкладПолучатель = "" Тогда
		СкладПолучатель = Справочники.СкладыКомпании.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПериодПеремещений) Тогда
		ПериодПеремещений.Вариант = ВариантСтандартногоПериода.Сегодня;
	КонецЕсли;
	Перемещение.Параметры.УстановитьЗначениеПараметра("ДатаНачала",ПериодПеремещений.ДатаНачала);
	Перемещение.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",ПериодПеремещений.ДатаОкончания);
	Перемещение.Параметры.УстановитьЗначениеПараметра("VIN","");
	Перемещение.Параметры.УстановитьЗначениеПараметра("СкладОтправитель",СкладОтправитель);
	Перемещение.Параметры.УстановитьЗначениеПараметра("СкладПолучатель",СкладПолучатель);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПеремещенийПриИзменении(Элемент)
	
	ЗаполнитьТекущиеМаршруты();
	СформироватьПеремещение();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблициПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "Потребности" и Элементы.ГруппаЛево.Видимость = Истина Тогда
		Элементы.ГруппаЛево.Видимость = НЕ Элементы.ГруппаЛево.Видимость;
	КонецЕсли;
	
	Если ТекущаяСтраница.Имя <> "Потребности" и Элементы.ГруппаЛево.Видимость = Ложь Тогда
		Элементы.ГруппаЛево.Видимость = НЕ Элементы.ГруппаЛево.Видимость;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОформлениеФильтраСписка(ПредставлениеФильтра) // +++ ВалиховГА 22.10.2021 DMSREN-1299
	
	ЦветВыбранногоЭлементаФильтра = Новый Цвет(255,153,0);
	ЦветЭлементаФильтра = Новый Цвет(245, 242, 221);
	
	Для Каждого ИмяЭлемента Из СтрРазделить("ДоступныеДляПродажи,Невыданные,Все", ",") Цикл
		Если ИмяЭлемента = ПредставлениеФильтра Тогда
			Элементы[ИмяЭлемента].ЦветФона = ЦветВыбранногоЭлементаФильтра;
		Иначе
			Элементы[ИмяЭлемента].ЦветФона = ЦветЭлементаФильтра;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // --- ВалиховГА 22.10.2021 DMSREN-1299

