// Функция возвращает значение экспортных переменных модуля приложенийа
//
// Параметры
//  Имя - строка, содержит имя переменной целиком 
//
// Возвращаемое значение:
//   значение соответствующей экспортной переменной
Функция глЗначениеПеременной(Имя) Экспорт

	Возврат Renault_Advanced_ОбщегоНазначения.ПолучитьЗначениеПеременной(Имя);
	
КонецФункции

// Процедура установки значения экспортных переменных модуля приложения
//
// Параметры
//  Имя - строка, содержит имя переменной целиком
// 	Значение - значение переменной
//
Процедура глЗначениеПеременнойУстановить(Имя, Значение, ОбновлятьВоВсехКэшах = Ложь) Экспорт
	
	Renault_Advanced_ОбщегоНазначения.УстановитьЗначениеПеременной(Имя, , Значение, ОбновлятьВоВсехКэшах);
	
КонецПроцедуры
