
// +СофтФон
Перем сфпПанельУправления Экспорт;			 // COM-объект панели управления СофтФон
Перем сфпObjCLON Экспорт;					 // COM-объект компоненты CLON
Перем сфпСтруктураЗвонков Экспорт;			 // Структура активных звонков
Перем сфпДанныеЗаполнения Экспорт;			 // Структура данных для заполнения телефонного звонка
Перем сфпСоответствиеЛинийИСтатусов Экспорт; // Соответствие, хранящее номера внутр. телефонов и статусов (состояний по ним)
Перем сфпГлобальныеПараметры Экспорт;		 // Структура - хранилище глобальных переменных
// -СофтФон

Процедура ПередНачаломРаботыСистемы(Отказ) 
	СписокРешений = ЛицензированиеПоддержка.ПолучитьСписокРешений();
	РезультатыЗапуска = новый Массив;
	Ошибка = Ложь;
	
	Для Каждого Решение Из СписокРешений Цикл
		ОписаниеОшибки = "";
		КодОшибки = 0;
		ЛицензированиеСервер.НачалоРаботыСистемыЛицензирования(Решение.Ключ, ОписаниеОшибки, КодОшибки);
		Если ОписаниеОшибки<>"" Тогда
			Ошибка = Истина;
		КонецЕсли;
		ПараметрыФормы = Новый Структура("ОписаниеОшибки,КодОшибки, ПрограммноеОткрытиеФормы, ИмяОбработки, ИмяРешения",ОписаниеОшибки,КодОшибки,Истина, Решение.Ключ, Решение.Значение);
		РезультатыЗапуска.Добавить(ПараметрыФормы); 
	КонецЦикла;
	
	Если Ошибка Тогда
		ПараметрЗакрытия = ОткрытьФормуМодально("Обработка.УправлениеЛицензированием.Форма.СостояниеСистемыЗащиты", новый Структура("РезультатыЗапуска, ПрограммноеОткрытиеФормы",РезультатыЗапуска, Истина));
		Отказ = ?(ПараметрЗакрытия = Неопределено,Истина,ПараметрЗакрытия);
		
		Если Отказ Тогда
			ОписаниеОшибки = "";
			ЛицензированиеСервер.ЗавершениеРаботыСистемыЛицензирования(ОписаниеОшибки);
			Возврат;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗавершенииРаботыСистемы()
	ОписаниеОшибки = "";
	ЛицензированиеСервер.ЗавершениеРаботыСистемыЛицензирования(ОписаниеОшибки);
КонецПроцедуры

//+СофтФон

Процедура ПриНачалеРаботыСистемы()
	Если сфпСофтФонПроСервер.сфпИспользоватьСофтФон() И сфпСофтФонПроСервер.сфпПолучитьЗначениеНастройкиПользователя("сфпИспользоватьСофтФон") Тогда
		#Если Вебклиент Тогда
		Состояние(НСтр("ru='Работа СофтФона невозможна в web-клиенте!'"));
		#ИначеЕсли НЕ ТолстыйКлиентОбычноеПриложение Тогда
		сфпСофтФонПроКлиент.сфпПодключитьСофтФон();	
		#КонецЕсли
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)
	Если сфпСофтФонПроСервер.сфпИспользоватьСофтФон() Тогда		
		Если Источник = "DbControl" Тогда
			// Ожидаем окончания сохранения файла
			Если (Событие = "OnLoadProgress") И (Данные = "100") Тогда
				FileName = сфпСофтФонПроКлиент.сфпПолучитьИмяФайлаЗаписиРазговора();
				Попытка
					ЗапуститьПриложение(FileName);
				Исключение
				КонецПопытки;
			КонецЕсли;	
			Возврат;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ)
	Если сфпСофтФонПроСервер.сфпИспользоватьСофтФон() Тогда
		Если НЕ Отказ Тогда
			Если НЕ сфпСофтФонПроСервер.сфпПолучитьЗначениеНастройкиПользователя("сфпЗакрыватьПанельПриЗавершенииРаботы") Тогда
				сфпСофтФонПроКлиент.сфпОтключитьСофтФон();
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

//-СофтФон