////////////////////////////////////////////////////////////////////////////////
// ООО "1С-Рарус Альфа-Авто". Департамент разработки. 2011-2016 год.
//------------------------------------------------------------------------------
// Типовое решение "Альфа-Авто: Автосалон+Автосервис+Автозапчасти ПРОФ, редакция 5.1"
//------------------------------------------------------------------------------
// Модуль приложения

//------------------------------------------------------------------------------
// Размерность числовых типов конфигурации:
// Реквизиты типа Сумма       - 15.2
// Реквизиты типа Количество  - 15.3
// Реквизиты типа Коэффициент - 10.3
// Реквизиты типа Курс        - 10.4
// Реквизиты типа Процент     -  5.2

////////////////////////////////////////////////////////////////////////////////
// ОПИСАНИЕ ПАРАМЕТРОВ СЕАНСА

// РежимРаботы - Строковая числовая маска [123]
// 1 символ: 0-Системное оборудование включается при старте,
//			 1-Включается только по запросу;
// 2 символ: 0-При запуске компонента должна была стать сервером,
//			 1-компонента не должна была становиться сервером,
//			 2-оборудование не используется;
// 3 символ: 0-Текущая сессия не является серверной и не может предоставлять оборудование,
//			 1-сессия является серверной (т.е. может предоставлять доступ к оборудованию);

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// Переменные окружения пользователя, используются для авторизации и разделения доступа
// Заполняются из обработки "ПриНачалеРаботыСистемы" при старте и обновлении прав
Перем глПрава					Экспорт; // Соответствие со значениями прав текущего пользователя
Перем глИзбранное				Экспорт; // ДеревоЗначений с данными Избранного
Перем глДеревоОткрытыхФормАРМ 	Экспорт; // Хранит дерево открытых форм для панели АРМ

// компонента защиты
Перем глРарус_Компонента		Экспорт; // Объект компоненты защиты, оборудования и сервисных функций

// оборудование
Перем глТорговоеОборудование	Экспорт; // Класс. Торговое оборудование.
Перем глЗавершениеРаботыСистемы	Экспорт; // Флаг окончания работы

// свойства справочников, документов, оповещение
Перем глСвойстваОбъектов 		Экспорт; // нужна для того, что бы всегда держать только один экземпляр окна свойств

// свойства справочников
Перем глПанельСвойствОбъекта	Экспорт; //нужна для того, что бы всегда держать только один экземпляр окна свойств

// свойства объектов
Перем глФормаПанелиСвойств		Экспорт; // Форма панели свойств объекта

Перем глОповещениеАктивации		Экспорт; // булево, определяет наличие открытых оповещаемых форм для включения оповещений при активации строк списков

// работа с фильтрами
Перем глСтруктураОтбора 		Экспорт; //нужна для того, что бы сохранять текущую структуру отборов

// работа с электронной почтой
Перем глУчетныеЗаписиАвтоматическогоТранспортаПисем Экспорт; // таблица значений, хранящая учетные записи для автоматического получения и доставки электронной почты

// работа со значимыми событиями в файловом режиме.
Перем глОчередьЗначимыхСобытий  Экспорт; // Список значений наступивших значимых событий. Используется для передачи информации в процедуру-обработчик "глОбработатьЗначимоеСобытие"; 

Перем глОбработкаОбмена Экспорт; // обработка обмена в которой ведется лог-файл формирования/получения сообщений обмена
Перем глФронтКассира Экспорт; // Форма текущего открытого фронта кассира

Перем глКонтекстАРМ Экспорт; // Структура содержит констекст пользователя при работе с АРМ-ми
Перем глОткрытаяФормаФункциональнойПанели Экспорт;

// {{{ SMS Коммуникатор}}}  НАЧАЛО

//Глобальные переменные для SMS
Перем глСписокПодписок Экспорт;				//подписки на СМС
Перем глСписокОтработанныхПодписок Экспорт;	//отработанные подписки на СМС
Перем глСписокТелефонов Экспорт;			//структура (Оборудование|СЗ номеров)
Перем глТекущаяКомпонента Экспорт;			//переменная для загрузки нескольких компонент
Перем глОсновнаяСессия Экспорт;				//признак основной сессии
// {{{ SMS Коммуникатор}}}  КОНЕЦ

// {{{ Софт фон проф}}} Начало
//Префиксы и коды
Перем глПрефиксВыходаВГород Экспорт;           				// Переменная для простоты. Префикс выхода в город. Значение в настройки пользователя.
Перем глПрефиксВыходаНаМежгород Экспорт;       				// Переменная для простоты. Префикс выхода на межгород. Значение в настройки пользователя.
Перем глПрефиксВыходаНаМеждународную Экспорт;     			// Переменная для простоты. Префикс выхода на международную линию.
Перем глКодГорода Экспорт;                     				// Переменная для простоты. Код нашего города. Значение в настройки пользователя.
Перем глКодСтраны Экспорт;                     				// Переменная для простоты. Код нашей страны. Значение в настройки пользователя.

Перем глКоличествоХранимыхЦифрТелефона Экспорт;     		// Число, Это то количество символов, которое будет обрезаться справа при поиске и сохранении в базе данных.
Перем глОбработаноВнешнееСобытие Экспорт;			        // Булево, предназначена для того, что бы не обрабатывать внешнее событие в модуле, если оно было обработано в форме

Перем РарусСофтФонПроф Экспорт;                         	// РАРУС обработка управления звонками, проф
Перем РарусСофтФонКомпонента Экспорт;                   	// РАРУС компонента, для работы с компонентой управления звонками
Перем глИспользоватьСофтФонПроф Экспорт;                    // Признак использования СофтФона, Проф как CallCenter для всей конфигурации
Перем глИспользоватьСофтФонПрофТекущийПользователь Экспорт; // Признак использовать СофтФон, Проф для текущего пользолвателя

Перем РарусCLON Экспорт;									// Переменая для работы с обработкой записи разговоров CLON
Перем ObjCLON Экспорт; 										// Внешняя компонента для работы с сервером системы записи разговоров CLON

//Временные переменные
Перем глТекущийПользователь Экспорт;						// Текущий пользователь
//Настройки софт фона
Перем глМаксимальнаяДлинаВнутреннегоНомера Экспорт;     	// Максимальная длина номера телефона, используется для определения
															// внутреннего номера телефона при исходящем звонке, если он явно не определен
// {{{ Софт фон проф}}} Конец
//+СофтФон
Перем сфпПанельУправления Экспорт;	// Компонента для управления СофтФоном
Перем сфпФормаТелефонВнешняяПанель Экспорт;		// Форма внешней панели телефона
Перем сфпObjCLON Экспорт;						// Компонента для работы с сервером CLON
Перем сфпДанныеЗаполнения Экспорт;	// Структура данных для заполнения телефонного звонка
Перем сфпСтруктураЗвонков Экспорт;	// Структура активных звонков
//-СофтФон

Перем глАвтокаталог Экспорт; // COM-Объект подключения автокаталога

Перем глСписокПринтеров Экспорт; // Список принтеров для печати

Перем глЦифрДляИндексаТелефона Экспорт; // Количество цифр для построения индекса телефона в регистре Контактная информация

Перем глСерверТО; // Объект для взаимодействия с торговым оборудованием

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ

// процедура вызывается обработчиком ожидания через время указанное в настройке "ПериодОбновленияДанныхОборудования"
// вызывается только в том случае, если к компьютеру подключено "автообновляемое" оборудование.
Процедура ОбновитьДанныеОборудования() Экспорт
	глТорговоеОборудование.ОбновитьДанныеАвтообновляемогоОборудования();
КонецПроцедуры

// ОбработкаПланировщикаЗадач разбита на 2 процедуры, что бы можно было вызывать как из текста так и таймером
// Режим. Перечисление.ПериодыЗапускаЗадачПланировщика. Если значение не указано, то процедура вызвана таймером
Процедура ОбработкаПланировщикаЗадач(Режим=Неопределено) Экспорт
	// выберем задачи текущего пользователя
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	ЗадачиПланировщика.ВидЗадачи,
	|	ЗадачиПланировщика.Объект,
	|	ЗадачиПланировщика.ПериодЗапускаЗадачи,
	|	ЗадачиПланировщика.МоментЗапускаЗадачи,
	|	ЗадачиПланировщика.ДействиеПриОшибке,
	|	ЗадачиПланировщика.Периодическая,
	|	ЗадачиПланировщика.ДатаИВремяОднократногоЗапуска,
	|	ЗадачиПланировщика.УдалятьЗадачуПослеЗапуска
	|ИЗ
	|	РегистрСведений.ЗадачиПланировщика КАК ЗадачиПланировщика
	|
	|ГДЕ
	|	ЗадачиПланировщика.Пользователь = &Пользователь
	|	"+?(Режим<>Неопределено,"И ЗадачиПланировщика.ПериодЗапускаЗадачи=&ПериодЗапускаЗадачи",""));
	Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.Пользователь);
	Запрос.УстановитьПараметр("ПериодЗапускаЗадачи",Режим);
	РезультатЗадачи=Запрос.Выполнить();
	// если нет ничего, то ничего и не делаем
	Если РезультатЗадачи.Пустой() Тогда Возврат; КонецЕсли;
	// задачи есть. выполняем
	ВыборкаЗадачи=РезультатЗадачи.Выбрать();
	Пока ВыборкаЗадачи.Следующий() Цикл
		// проверим пришло ли время
		ВремяПришло=(Режим<>Неопределено);
		
		Если ВыборкаЗадачи.Периодическая Тогда
		
			Если ВыборкаЗадачи.ПериодЗапускаЗадачи=Перечисления.ПериодыЗапускаЗадачПланировщика.Ежедневно Тогда
				Секунд=ВыборкаЗадачи.МоментЗапускаЗадачи-НачалоДня(ВыборкаЗадачи.МоментЗапускаЗадачи);
				СейчасСекунд=ТекущаяДата()-НачалоДня(ТекущаяДата());
				Интервал=СейчасСекунд-Секунд;
				ВремяПришло=(Интервал>0 И Интервал<=10);
			КонецЕсли;
			
		Иначе
			
			Если НачалоДня(ТекущаяДата())=НачалоДня(ВыборкаЗадачи.ДатаИВремяОднократногоЗапуска) Тогда
				// отработаем проверку времени запуска одноразовой задачи
				Секунд=ВыборкаЗадачи.ДатаИВремяОднократногоЗапуска-НачалоДня(ВыборкаЗадачи.ДатаИВремяОднократногоЗапуска);
				СейчасСекунд=ТекущаяДата()-НачалоДня(ТекущаяДата());
				Интервал=СейчасСекунд-Секунд;
				ВремяПришло=(Интервал>0 И Интервал<=10);
			Иначе
				ВремяПришло=Ложь;
			КонецЕсли;
			
		КонецЕсли;
		// если время еще не пришло, то уйдем
		Если НЕ ВремяПришло Тогда Продолжить; КонецЕсли;
		КоличествоПопыток=10; // количество попыток выполнения действия
		ЕстьОшибка=Ложь;
		
	~Обратно:
		// избежим зацикливания
		КоличествоПопыток=КоличествоПопыток-1; // попытка прошла
		// попытки закончились
		Если КоличествоПопыток=0 Тогда 
			Сообщить("Задачу "+СокрЛП(ВыборкаЗадачи.ВидЗадачи)+" "+СокрЛП(ВыборкаЗадачи.Объект)+" выполнить не удалось!",СтатусСообщения.ОченьВажное);
			Сообщить("Было предпринято "+СокрЛП(КоличествоПопыток)+" попыток.",СтатусСообщения.Информация);
			Продолжить; 
		КонецЕсли;
		
		// смотрим что за задача
		Если ВыборкаЗадачи.ВидЗадачи=Перечисления.ВидЗадачПланировщика.ВосстановлениеПоследовательности Тогда
			//Попытка
			//	Последовательности[ВыборкаЗадачи.Объект].Восстановить(ТекущаяДата());
			//Исключение
			//	ЕстьОшибка=Истина;
			//КонецПопытки;
		ИначеЕсли ВыборкаЗадачи.ВидЗадачи=Перечисления.ВидЗадачПланировщика.ЗавершениеРаботыСистемы Тогда
			// завершаем
			ЗавершитьРаботуСистемы(Ложь);
		ИначеЕсли ВыборкаЗадачи.ВидЗадачи=Перечисления.ВидЗадачПланировщика.ЗапускПроцедуры Тогда
			// пытаемся выполнить процедуру
			Попытка
				Выполнить(ВыборкаЗадачи.Объект);
			Исключение
				ЕстьОшибка=Истина;
			КонецПопытки;
		ИначеЕсли ВыборкаЗадачи.ВидЗадачи=Перечисления.ВидЗадачПланировщика.ОткрытиеФормы Тогда
			ФормаОткрытия=Неопределено;
			Если Найти(ВыборкаЗадачи.Объект,"ОБЩАЯФОРМА.")>0 Тогда
				// имеем общую форму
				Попытка ФормаОткрытия=ПолучитьОбщуюФорму(СтрЗаменить(ВыборкаЗадачи.Объект,"ОБЩАЯФОРМА.","")); Исключение КонецПопытки;
			Иначе
				Об=Неопределено;
				// попытаемся создать такой объект
				Попытка
					Об=Новый(Вычислить(ВыборкаЗадачи.Объект));
				Исключение
					// тогда подумаем, что у нас внешняя обработка
					Попытка Об=ВнешниеОбработки.Создать(ВыборкаЗадачи.Объект); Исключение КонецПопытки;
				КонецПопытки;
				// если есть что-то то открываем
				Если Об<>Неопределено Тогда
					Попытка
						ФормаОткрытия=Об.ПолучитьФормуСписка();
					Исключение
						Попытка
							ФормаОткрытия=Об.ПолучитьФорму();
						Исключение
							ЕстьОшибка=Истина;
						КонецПопытки;
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
			Если ФормаОткрытия<>Неопределено Тогда
				
				ЭтоФормаОтчета = Ложь;
				Если ТипЗнч(ФормаОткрытия) = Тип("УправляемаяФорма") И ФормаОткрытия.ИмяФормы = "ОбщаяФорма.Отчет_Тонкий_Клиент" Тогда
					ЭтоФормаОтчета = Истина;
				КонецЕсли;
				
				Если ЭтоФормаОтчета Тогда
					Отчет = Об.Создать();
					Отчет.ЗаполнитьНачальныеНастройки();
					
					МетаданныеОтчета  = Отчет.Метаданные();
					ИмяФормыОтчета = МетаданныеОтчета.ПолноеИмя() + ".Форма";
					
					СтруктураПараметров = Новый Структура();
					СтруктураПараметров.Вставить("СформироватьПриОткрытии", Истина);
					СтруктураПараметров.Вставить("ВариантЗагрузкиПериода",  "ВариантСтандартногоПериода.ПроизвольныйПериод");
					
					ОткрытьФорму(ИмяФормыОтчета, СтруктураПараметров);				
				Иначе
					ФормаОткрытия.Открыть();					
				КонецЕсли;				
			КонецЕсли;
		КонецЕсли;
		
		// ошибка, посмотрим что делаем по ошибке
		Если ЕстьОшибка Тогда
			Если ВыборкаЗадачи.ДействиеПриОшибке=Перечисления.ВидыДействийПриОшибкеВыполненияЗадачи.ЗавершитьРаботуСистемы Тогда
				ЗавершитьРаботуСистемы(Ложь);
			ИначеЕсли ВыборкаЗадачи.ДействиеПриОшибке=Перечисления.ВидыДействийПриОшибкеВыполненияЗадачи.ПовторятьПопытку Тогда
				Перейти ~Обратно;
			Иначе
				Продолжить;
			КонецЕсли;
		Иначе
			// Если задача исполнилась успешно - и при этом она одноразовая, и
			// у неё взведён флаг удаления после исполнения - то удалим её
			Если (НЕ ВыборкаЗадачи.Периодическая) И (ВыборкаЗадачи.УдалятьЗадачуПослеЗапуска) Тогда
				ОтборПланировщика=Новый Структура;
				ОтборПланировщика.Вставить("Пользователь", ПараметрыСеанса.Пользователь);

				Выборка=РегистрыСведений.ЗадачиПланировщика.Выбрать(ОтборПланировщика);
				Пока Выборка.Следующий() Цикл
					Если
						(Выборка.ВидЗадачи=ВыборкаЗадачи.ВидЗадачи) И
						(Выборка.Объект=ВыборкаЗадачи.Объект) И
						(Выборка.ПериодЗапускаЗадачи=ВыборкаЗадачи.ПериодЗапускаЗадачи) И
						(Выборка.МоментЗапускаЗадачи=ВыборкаЗадачи.МоментЗапускаЗадачи) И
						(Выборка.ДействиеПриОшибке=ВыборкаЗадачи.ДействиеПриОшибке) И
						(Выборка.Периодическая=ВыборкаЗадачи.Периодическая) И
						(Выборка.ДатаИВремяОднократногоЗапуска=ВыборкаЗадачи.ДатаИВремяОднократногоЗапуска) И
						(Выборка.УдалятьЗадачуПослеЗапуска=ВыборкаЗадачи.УдалятьЗадачуПослеЗапуска)
					Тогда		
						Запись=Выборка.ПолучитьМенеджерЗаписи();
						Запись.Удалить();
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// вызывается каждые 10 сек. проверяется наличие задач у пользователя и если
// подошел срок их исполнения, то задачи выполняются
//
// Динамически подключаемый обработчик изменения данных
//
Процедура глОбработкаПланировщикаЗадач() Экспорт
	ОбработкаПланировщикаЗадач();
КонецПроцедуры

//Процедура проверяет, есть ли необходимость пересчета регистров
Процедура ОпределитьНеобходимостьПерестановкиГраницыИтогов()
	
	ДеньМесяцаНачалаНапоминания = 5;
	ДеньМесяцаБезусловногоПересчета = 10;
	
	ТекущийДеньМесяца = День(ТекущаяДата());	
	НадоПересчитывать = Истина;
	
	Если ТекущийДеньМесяца<ДеньМесяцаНачалаНапоминания Тогда
		НадоПересчитывать = Ложь;
	Иначе
		Если ТекущийДеньМесяца<ДеньМесяцаБезусловногоПересчета Тогда
			ЕстьПользователиВБазе = Ложь;
			Попытка
				УстановитьМонопольныйРежим(Истина);
			Исключение
				ЕстьПользователиВБазе = Истина;
			КонецПопытки;
			Если Не ЕстьПользователиВБазе Тогда
				УстановитьМонопольныйРежим(Ложь);
			КонецЕсли;
			НадоПересчитывать = Не ЕстьПользователиВБазе;
		Иначе
			НадоПересчитывать = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Не НадоПересчитывать Тогда
		Возврат;
	КонецЕсли;
	
	ПредпочтительнаяДатаРасчетаИтогов = НачалоМесяца(ТекущаяДата())-1;
	СписокРегистровКРасчету= Новый СписокЗначений;
	Для Каждого Регистр ИЗ РегистрыНакопления Цикл                               
		МетаданныеРегистра = Метаданные.НайтиПоТипу(Тип(Регистр));
		Если МетаданныеРегистра.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки Тогда
			Если ПравоДоступа("УправлениеИтогами", МетаданныеРегистра) И ПравоДоступа("Чтение", МетаданныеРегистра) Тогда
				Если Регистр.ПолучитьПериодРассчитанныхИтогов()<ПредпочтительнаяДатаРасчетаИтогов  Тогда
					СписокРегистровКРасчету.Добавить(Регистр, "Регистр накопления "+МетаданныеРегистра.Синоним);
				КонецЕсли;
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;	
	
	Если СписокРегистровКРасчету.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Вопрос("Для повышения производительности рекомендуется выполнить"+Символы.ПС+
				"расчет итогов регистров по "+Формат(ПредпочтительнаяДатаРасчетаИтогов, "ДФ=дд.ММ.гггг" )+". Выполнить его сейчас?", 
			РежимДиалогаВопрос.ДаНет, 25 , КодВозвратаДиалога.Нет) <> КодВозвратаДиалога.Да Тогда
			Возврат;
	КонецЕсли;

	Для Каждого РегистрИзСписка Из СписокРегистровКРасчету Цикл
		РегистрИзСписка.Значение.УстановитьПериодРассчитанныхИтогов(ПредпочтительнаяДатаРасчетаИтогов );		
		МетаданныеРегистра = Метаданные.НайтиПоТипу(ТипЗнч(РегистрИзСписка.Значение));
		Если Метаданные.РегистрыНакопления.Содержит(МетаданныеРегистра) Тогда
			ТипРегистра = " накопления ";
		КонецЕсли;
		Сообщить("Итоги регистра"+ТипРегистра+""""+МетаданныеРегистра.Синоним+""""+" были рассчитаны по: "+Формат(ПредпочтительнаяДатаРасчетаИтогов, "ДФ=дд.ММ.гггг" ));
	КонецЦикла;
	
КонецПроцедуры
	
// Процедура проверяет необходимость подключения напоминаний
//
// Параметры:
//  Нет.
//
Процедура глПроверитьПодключениеНапоминания() Экспорт
	Если Константы.ИнтервалПроверкиНапоминаний.Получить() > 0 Тогда
		ПодключитьОбработчикОжидания("опОбработкаОповещений", 60 * Константы.ИнтервалПроверкиНапоминаний.Получить());
	Иначе 
		ОтключитьОбработчикОжидания("опОбработкаОповещений");
	КонецЕсли; 
КонецПроцедуры // ПроверитьПодключениеНапоминания()

// Процедура осуществляет проверку на необходимость транспорта писем по учетным записям,
// с заданным интервалом.
//
// Динамически подключаемый обработчик изменения данных
//
Процедура глАвтоматическаяПроверкаПисем() Экспорт
    ДатаНачалаПроверки = ТекущаяДата();
	ОтключитьОбработчикОжидания("глАвтоматическаяПроверкаПисем");
	МассивОбработанныхСтрок = Новый Массив;
	Для каждого СтрокаТЧ Из глУчетныеЗаписиАвтоматическогоТранспортаПисем Цикл
		Если СтрокаТЧ.ВремяПоследнегоПолучения + СтрокаТЧ.ИнтервалОбновления * 60 > ТекущаяДата() Тогда
			Продолжить;
		КонецЕсли;
		МассивОбработанныхСтрок.Добавить(СтрокаТЧ);
	КонецЦикла;
	ТекстНапоминания = "";
	Если МассивОбработанныхСтрок.Количество() > 0 Тогда
		КоличествоПолученныхПисемВсего = 0;
		Для каждого СтрокаТЧ Из МассивОбработанныхСтрок Цикл
			КоличествоПолученныхПисем = 0;
			Если СтрокаТЧ.Действие = Перечисления.ВидыДействийАвтоПолученияОтправкиЭлектронныхПисем.Получение Тогда
				КоличествоПолученныхПисем = эпПолучитьЭлектронныеПисьма(СтрокаТЧ.УчетнаяЗапись, Истина);
			ИначеЕсли СтрокаТЧ.Действие = Перечисления.ВидыДействийАвтоПолученияОтправкиЭлектронныхПисем.Отправка Тогда
				эпОтправитьЭлектронныеПисьма(СтрокаТЧ.УчетнаяЗапись);
			Иначе
				эпОтправитьЭлектронныеПисьма(СтрокаТЧ.УчетнаяЗапись);
				КоличествоПолученныхПисем = эпПолучитьЭлектронныеПисьма(СтрокаТЧ.УчетнаяЗапись, Истина);
			КонецЕсли; 
			СтрокаТЧ.ВремяПоследнегоПолучения = ТекущаяДата();
			
			КоличествоПолученныхПисемВсего = КоличествоПолученныхПисемВсего + КоличествоПолученныхПисем;
			Если (КоличествоПолученныхПисем > 0) И (СтрокаТЧ.УчетнаяЗапись.ОповещатьОбАвтополученииПочты) Тогда
				Если Не ТекстНапоминания = "" Тогда
					ТекстНапоминания = ТекстНапоминания + Символы.ПС;
				КонецЕсли;
				ОкончаниеТекста = " новых писем";
				ПоследниеДвеЦифры = КоличествоПолученныхПисем % 100;
				ПоследняяЦифра = КоличествоПолученныхПисем % 10;
				Если (ПоследниеДвеЦифры < 5) Или (ПоследниеДвеЦифры > 20) Тогда
					Если ПоследняяЦифра = 1 Тогда
						ОкончаниеТекста = " новое письмо";
					Иначе
						Если ПоследняяЦифра < 5 Тогда
							ОкончаниеТекста = " новых письма";
						КонецЕсли;			
					КонецЕсли;	
				КонецЕсли;
				ТекстНапоминания = ТекстНапоминания + "Учетная запись """ + СтрокаТЧ.УчетнаяЗапись + """: " + КоличествоПолученныхПисем + ОкончаниеТекста;
			КонецЕсли;
		КонецЦикла;
		Если Не ТекстНапоминания = "" Тогда
			НовоеНапоминание = РегистрыСведений.Напоминания.СоздатьМенеджерЗаписи();
			
			// заполним измерения
			НовоеНапоминание.Пользователь = ПараметрыСеанса.Пользователь;
			НовоеНапоминание.Автор = ПараметрыСеанса.Пользователь;
			НовоеНапоминание.Завершено = Ложь;
			НовоеНапоминание.РеальнаяДатаОповещения = ТекущаяДата();
			НовоеНапоминание.Объект = Неопределено;
			
			// заполним ресурсы
			НовоеНапоминание.ДатаАктуальности = '00010101';
			НовоеНапоминание.ДатаНачала = ТекущаяДата();
			НовоеНапоминание.ДатаОповещения = ТекущаяДата();
			НовоеНапоминание.Описание = ТекстНапоминания;
			НовоеНапоминание.Редактирование = Ложь;
			НовоеНапоминание.СрокДоНачала = 0;
			НовоеНапоминание.Тема = "Получены новые письма";
			НовоеНапоминание.ТипПериода = "00";
			НовоеНапоминание.УдалитьПоИстеченииСрока = Истина;
			
			НовоеНапоминание.Записать(Ложь);
		КонецЕсли;
		Если КоличествоПолученныхПисемВсего > 0 Тогда
			Оповестить("ОбновитьДеревоГрупп", "Пересчитать");
		КонецЕсли;	
	КонецЕсли; 
	
	ПодключитьОбработчикОжидания("глАвтоматическаяПроверкаПисем", 60);

КонецПроцедуры

// Процедура-обработчик значимых событий.
// Используется только в файловом режиме работы программы.
Процедура глОбработатьЗначимоеСобытие() Экспорт
	Если глОчередьЗначимыхСобытий=Неопределено Тогда
		Возврат;
	КонецЕсли;
	Для каждого ТекЗначимоеСобытие Из глОчередьЗначимыхСобытий Цикл
		сбСобытия.ОбработатьЗначимоеСобытие(ТекЗначимоеСобытие.Источник, ТекЗначимоеСобытие.ЗначимыеСобытия);
	КонецЦикла;
	глОчередьЗначимыхСобытий = Неопределено;
КонецПроцедуры // глОбработатьЗначимоеСобытие()

// Процедура вызывается периодически для обработки текущих регламентных заданий
Процедура глОбработкаПланировщикаЗаданий() Экспорт
	// Любые циклические обработчики должны проверять наличие блокировки на базе
	// и если таковой режим обнаружен немедленно завершать работу чтобы не мешать регламентным операциям
	РежимБлокировки = ПолучитьБлокировкуУстановкиСоединений();
	// Считаем параметры блокировки
	Если РежимБлокировки.Установлена Тогда
		ВремяНачалаБлокировки = РежимБлокировки.Начало;
		Если НЕ ЗначениеЗаполнено(ВремяНачалаБлокировки) ИЛИ (ТекущаяДата() >= ВремяНачалаБлокировки) Тогда
			// Вычеркнем себя из списка выполняющих регламентные операции
			УдалитьДанныеСеансаОбработчикаЗаданий(ПараметрыСеанса.Пользователь,НомерСоединенияИнформационнойБазы(),2);
			// Все завершаем наш сеанс работы и выходим
			ЗавершитьРаботуСистемы(Ложь, Истина);  // Если это был Робот и делал что-то полезное пусть перезапустится и продолжит когда опять будет можно
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ВыполнитьОбработкуЗаданий();
	
	Интервал = Константы.ИнтервалПроверкиЗаданий.Получить();
	Интервал = ?(Интервал < 5, 5 , Интервал); // Не буду я с таким маленьким интервалом регламентные задания выполнять 
	НомерСоединения = НомерСоединенияИнформационнойБазы();
	ПодключитьОбработчикОжидания("глОбработкаПланировщикаЗаданий", Интервал);
КонецПроцедуры

// Процедура вызывается периодически для проверки обновления прав и настроек пользователя
Процедура глОбновитьПраваИНастройки() Экспорт
	
	// проверим, что у нас в режиме работы пользователя
	СтруктураОтбора = Новый Структура("Пользователь,НомерСоединения,Режим",
		ПараметрыСеанса.Пользователь,НомерСоединенияИнформационнойБазы(),3);
	Ресурсы = РегистрыСведений.РежимыРаботыПользователей.Получить(СтруктураОтбора);	
	Если ЗначениеЗаполнено(Ресурсы.Начало) Тогда
		глПрава = Неопределено;
		// Обновим текущий набор прав
		ТекПользователь = ПараметрыСеанса.Пользователь;
		глПрава = обПолучитьПраваИНастройкиПользователя(ТекПользователь);
		
		// Помощник продаж +
		атСервер.ИнициализироватьКодСостояния();
		// Помощник продаж -
		
		ТекДата = Формат(ТекущаяДата(),"ДФ='HH:mm:ss dd.MM'") + " ";
		Сообщить(ТекДата + "Права текущего пользователя обновлены !",СтатусСообщения.Информация);
		// Поскольку на экране могут быть открыты формы объектов, скажем им, что надо бы обновить кэш прав..
		Оповестить("ОбновитьПрава",ТекПользователь);
		
		// оповестили один раз и хватит - ждем следующего обновления со стороны другого пользователя
		// здесь мы номер соединения знаем явно
		ТекНомерСоединения = НомерСоединенияИнформационнойБазы();
		УдалитьДанныеСеансаОбработчикаЗаданий(ТекПользователь,ТекНомерСоединения,3);
	КонецЕсли; 
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработка предопределенного события
// Производит инициализацию системы до отрисовки окна 1С:Предприятия
Процедура ПередНачаломРаботыСистемы(Отказ)
	//Обработчик зарезервирован на будущее
КонецПроцедуры // ПередНачаломРаботыСистемы()

// Обработка предопределенного события
// Инициализирует рабочие переменные сеанса
// Авторизует пользователя, проверяет факт первого запуска, обновляет ИБ
// Выполняет дополнительные действия в соответствии с пользовательскими настройками
Процедура ПриНачалеРаботыСистемы()
	//Подключение к системе лицензирования
	СписокРешений = ЛицензированиеПоддержка.ПолучитьСписокРешений();
	РезультатыЗапуска = новый Массив;
	Ошибка = Ложь;
	
	Для Каждого Решение Из СписокРешений Цикл
		ОписаниеОшибки = "";
		КодОшибки = 0;
		
		// Проверка и разбор длинного имени
		ИмяОбработки = Решение.Ключ;
		ИмяМакетаХранилища = "";
		ИмяМакетаПараметровЛицензирования = "";
		КороткоеИмяОбработки = "";
		Если НЕ ЛицензированиеСервер.РазделитьИмяОбработки(ИмяОбработки, ИмяМакетаХранилища, ИмяМакетаПараметровЛицензирования, КороткоеИмяОбработки) Тогда
			ОписаниеОшибки = "Неверный формат имени обработки:"+Символы.ПС+ИмяОбработки;
			КодОшибки = 1;
			Возврат;
		КонецЕсли;	
		КлючПродукта = ИмяМакетаХранилища+"."+ИмяМакетаПараметровЛицензирования;

		
		Если НЕ ЛицензированиеКлиент.ВыполнитьПривязкуКлиента(КлючПродукта, ОписаниеОшибки) Тогда
			Предупреждение(ОписаниеОшибки);
			Отказ = Истина;
		КонецЕсли;
		
		ОписаниеОшибки = "";
		КодОшибки = 0;
		
		ЛицензированиеСервер.НачалоРаботыСистемыЛицензирования(Решение.Ключ, ОписаниеОшибки, КодОшибки);
		Если ОписаниеОшибки<>"" Тогда
			Ошибка = Истина;
		КонецЕсли;
		ПараметрыФормы = Новый Структура("ОписаниеОшибки,КодОшибки, ПрограммноеОткрытиеФормы, ИмяОбработки, ИмяРешения",ОписаниеОшибки,КодОшибки,Истина, Решение.Ключ, Решение.Значение);
		РезультатыЗапуска.Добавить(ПараметрыФормы); 
	КонецЦикла;
	
	Если Ошибка Тогда
		ПараметрЗакрытия = ОткрытьФормуМодально("Обработка.УправлениеЛицензированием.Форма.СостояниеСистемыЗащиты", Новый Структура("РезультатыЗапуска, ПрограммноеОткрытиеФормы",РезультатыЗапуска, Истина));








		Отказ = ?(ПараметрЗакрытия = Неопределено,Истина,ПараметрЗакрытия);
		
		Если Отказ Тогда
			ОписаниеОшибки = "";
			ЛицензированиеСервер.ЗавершениеРаботыСистемыЛицензирования(ОписаниеОшибки);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Начальная инициализация рабочих переменных	
	ОбнаруженПервыйЗапуск			= Ложь;
	НеобходимоОбновлениеБазыДанных	= Ложь;
	ПараметрыКоманднойСтроки		= ПараметрЗапуска;
	ОбработкаСтартСистемы			= Обработки.СтартСистемы.Создать();
	
	ПраваСуперПользователя = (ПравоДоступа("Администрирование", Метаданные) И ПравоДоступа("МонопольныйРежим", Метаданные) 
	 И ПравоДоступа("Использование",    Метаданные.Обработки.ОбновлениеИнформационнойБазы)) ИЛИ ПравоДоступа("ОбновлениеКонфигурацииБазыДанных", Метаданные);
	
	Если НЕ ОбработкаСтартСистемы.ПервоначальнаяИнициализация(ПраваСуперПользователя,ОбнаруженПервыйЗапуск,НеобходимоОбновлениеБазыДанных) Тогда
		ЗавершитьРаботуСистемы(Ложь); Возврат;
	КонецЕсли;
	
	// Обработаем параметры запуска "срочных" команд
	Если ПраваСуперПользователя И сфОбработатьПараметрЗапуска(ПараметрыКоманднойСтроки,Истина) Тогда
		Возврат; // Параметры обработаны значит все сделано - сразу и выходим
	КонецЕсли;
	
	// Проверка необходимости и возможности обновить информационную базу
	Если ОбнаруженПервыйЗапуск ИЛИ НеобходимоОбновлениеБазыДанных Тогда
		Если ОбнаруженПервыйЗапуск Тогда
			ТекстСообщения ="  ВНИМАНИЕ! Обнаружен первый запуск программы!
							|Необходимо произвести первоначальное заполнение базы";
		Иначе
			ТекстСообщения = "  ВНИМАНИЕ! Обнаружено изменение конфигурации!
							|Необходимо произвести обновление информационной базы";
		КонецЕсли;
		Если ПраваСуперПользователя Тогда
			Если (ПараметрыСеанса.Пользователь<>Справочники.Пользователи.Робот) И Вопрос(ТекстСообщения+"
						|
					 	| Желаете выполнить эту операцию в настоящий момент?
						|
						|(При ответе ""Нет"" работа программы будет завершена)",РежимДиалогаВопрос.ДаНет,25,КодВозвратаДиалога.Да)=КодВозвратаДиалога.Нет Тогда
				ЗавершитьРаботуСистемы(Ложь); Возврат;	// Отказался обновлять - пошел в сад
			КонецЕсли;
		Иначе
			Предупреждение(ТекстСообщения+"
						|
						|Ваших прав доступа недостаточно для выполнения операции.
						|Сообщите об этой ситуации администратору базы данных.
						|
						|Сейчас Ваш сеанс будет завершен автоматически, извините.",25);
				ЗавершитьРаботуСистемы(Ложь); Возврат;	// Нет прав администратора - однозначно в сад
		КонецЕсли;
	КонецЕсли;
	
	// Выполним обновление базы данных в дочернем узле
	Если (НеобходимоОбновлениеБазыДанных И НЕ ОбнаруженПервыйЗапуск И ЗначениеЗаполнено(ПланыОбмена.ГлавныйУзел()))
		ИЛИ Найти(Врег(ПараметрыКоманднойСтроки), Врег("UpdateIB")) > 0 
		ИЛИ Найти(Врег(ПараметрыКоманднойСтроки), Врег("SendExchangeMessage")) > 0 Тогда
		ОбработкаСтартСистемы.ЗавершитьОбновлениеБазыДочернегоУзла(ПараметрыКоманднойСтроки);
	Иначе
		// Отключим проверки и сообщения на время обновления
		Если НЕ ЗначениеЗаполнено(глПрава) Тогда // Если еще не инициализированы
			Состояние("Получение прав и настроек текущего пользователя...");
			глПрава = обПолучитьПраваИНастройкиПользователя(ПараметрыСеанса.Пользователь);
		КонецЕсли;
	КонецЕсли;
	
	// Выполним обновление по полной программе (первый запуск или "корневая" БД)
	Если ОбнаруженПервыйЗапуск ИЛИ НеобходимоОбновлениеБазыДанных Тогда
		Если НЕ ОбработкаСтартСистемы.ВыполнитьОбновлениеИнформационнойБазы() Тогда
			ЗавершитьРаботуСистемы(Ложь); Возврат;	// Если не получилось, то все 
		КонецЕсли;
	КонецЕсли;
	
	// Проверка заполнения констант
	Если НЕ ОбработкаСтартСистемы.ВыполнитьПроверкуЗаполненияКонстант(ПраваСуперПользователя,ОбнаруженПервыйЗапуск) Тогда
		ЗавершитьРаботуСистемы(Ложь); Возврат;		// Если не получилось, то все в сад
	КонецЕсли;
	
	// Подключаем функции внешних компонент
	Если НЕ ОбработкаСтартСистемы.ИнициализацияФункцийВнешнихКомпонент() Тогда
		ЗавершитьРаботуСистемы(Ложь); Возврат;		// Если не получилось, то все в сад
	КонецЕсли;
	Если глЗавершениеРаботыСистемы Тогда
    	Возврат;
	КонецЕсли; 
	
	// Обработаем параметры запуска "дополнительных" команд
	Если ПраваСуперПользователя И сфОбработатьПараметрЗапуска(ПараметрыКоманднойСтроки,Ложь) Тогда
		Возврат; // Параметры обработаны значит все сделано - сразу и выходим
	КонецЕсли;
	
	// Для выполнения регламентных операций иногда нужно просить пользователей выйти из базы данных
	сфУстановитьКонтрольРежимаЗавершенияРаботыПользователей();
	
	// Почистим данные о необходимости обновления прав и настроек (это уже выполнилось)
	// причем необходимо удалить только те соединения текущего пользователя, которые уже не активны
	УдалитьДанныеСеансаОбработчикаЗаданий(,,3,Истина);
	ПодключитьОбработчикОжидания("глОбновитьПраваИНастройки", 45); 
	
	Если ПараметрыСеанса.Пользователь<>Справочники.Пользователи.Робот Тогда
		// С Роботом не нужно производить никакого интерактивного взаимодействия (спрашивать и т.п.)
		
		// Заполняем рабочие структуры данных
		Если НЕ ОбработкаСтартСистемы.ПроверкаЗаполненияРабочихСтруктурДанных(ОбнаруженПервыйЗапуск,НеобходимоОбновлениеБазыДанных) Тогда
			ЗавершитьРаботуСистемы(Ложь); Возврат;		// Если не получилось, то все в сад
		КонецЕсли;
		
		// Получим значение права "РаботаСФронтомКассира"
		Если обПраво("РаботаСФронтомКассира",глПрава)=Перечисления.РаботаСФронтомКассира.ТолькоСФронтом Тогда
			РаботаТолькоСФронтомКассира = Истина;
		Иначе
			РаботаТолькоСФронтомКассира = Ложь;
		КонецЕсли;
		
		РаботатьТолькоСАРМомСотрудника = Ложь;
		// получим значение права работать только с АРМ-ом сотрудника цеха
		Если НЕ РаботаТолькоСФронтомКассира Тогда
			Если зфЗащищенныеФункцииСервер.ПроверитьБитМаски(1) Тогда
				// Семенихин 24.05.2023 +++++
				//РаботатьТолькоСАРМомСотрудника = обПраво("УРВ_РаботатьТолькоСАРМомСотрудникаЦеха",глПрава);
				РаботатьТолькоСАРМомСотрудника = РольДоступна("СМ_Автомеханик") Или обПраво("УРВ_РаботатьТолькоСАРМомСотрудникаЦеха",глПрава);
				// Семенихин 24.05.2023 -----
				//Бондаренко++ 20230616
				РаботатьТолькоСАРМомТСД = обПраво("УРВ_РаботатьТолькоСАРМомТСД",глПрава);
				//Бондаренко-- 20230616
			КонецЕсли;
		КонецЕсли;
		
		// Гэндальф+++
		РаботатьТолькоСАРМомТехПроцесса= Ложь;
		// получим значение права работать только с АРМ-ом ТехПроцесса
		Если НЕ РаботатьТолькоСАРМомСотрудника Тогда
				РаботатьТолькоСАРМомТехПроцесса = обПраво("УРВ_РаботатьТолькоСАРМомТехПроцесса",глПрава);
		КонецЕсли;
		
		РаботатьАРМСКД = Ложь;
		// получим значение права работать только с АРМ-ом СКД
		Если НЕ РаботатьАРМСКД Тогда
				РаботатьАРМСКД = обПраво("УРВ_РаботатьСКД",глПрава);
		КонецЕсли;
		
		РаботатьСМониторомПриветствия = Ложь;
		// получим значение права работать только с монитором приветствия
		Если НЕ РаботатьСМониторомПриветствия Тогда
			РаботатьСМониторомПриветствия = обПраво("УРВ_МониторПриветствия",глПрава);
		КонецЕсли;
		
		РаботатьСМониторомЗагрузкиЦеха = Ложь;
		Если НЕ РаботатьСМониторомЗагрузкиЦеха Тогда

				РаботатьСМониторомЗагрузкиЦеха = обПраво("УРВ_ЗапускМонитораЗагрузкиЦеха",глПрава);

		КонецЕсли;
		
		РаботатьСМониторомТехника= Ложь;
		Если НЕ РаботатьСМониторомТехника Тогда

				РаботатьСМониторомТехника = обПраво("УРВ_МониторТехника",глПрава);

		КонецЕсли;

		РаботатьСУРВВыдача= Ложь;
	    Если НЕ РаботатьСУРВВыдача Тогда

				РаботатьСУРВВыдача = обПраво("УРВ_ВыдачаЗЧ",глПрава);

		КонецЕсли;
		 //Гэндальф---
		
		// Пересчитаем итоги регистров если это нужно
		ОпределитьНеобходимостьПерестановкиГраницыИтогов();
		
		// Проверим наличие файлов с данными о документах, обработаем восстановление документов
		МассивФайлов = НайтиФайлы(ПараметрыСеанса.Компьютер.ЛокальныйКаталог, "*.dct");
		GUIDКонфиграции = СтрЗаменить(Сред(ЗначениеВСтрокуВнутр(Метаданные),6,36),"-","");
		Если МассивФайлов.Количество()<>0 Тогда
			// сначала проверим, а есть ли файлы для нашего пользователя
			ЕстьМоиФайлы=Ложь; КодПользователя = СокрЛП(ПараметрыСеанса.Пользователь.Код);
			Для Каждого ТекФайл Из МассивФайлов Цикл
				Если Лев(ТекФайл.Имя,32)=GUIDКонфиграции И Найти(ТекФайл.Имя,"_"+КодПользователя+".")>0 Тогда
					ЕстьМоиФайлы=Истина; Прервать;
				КонецЕсли;
			КонецЦикла;
			
			//спросим пользователя, что ему делать с этими файлами
			Если ЕстьМоиФайлы Тогда
				Если Вопрос("В локальном каталоге присутствуют несохраненные файлы-документов.
					|Восстановить эти документы? (При отказе ВСЕ файлы будут удалены!)", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
					//ответ: не восстанавливать
					Для Каждого ТекФайл Из МассивФайлов Цикл
						Если Найти(ТекФайл.Имя,"_"+КодПользователя+".")>0 Тогда
							// удаляем файл
							УдалитьФайлы(ТекФайл.ПолноеИмя);
						КонецЕсли;
					КонецЦикла;
				Иначе
					//ответ: восстановить
					Для каждого ТекФайл Из МассивФайлов Цикл
						// пропустим не свои файлы
						Если Найти(ТекФайл.Имя,"_"+КодПользователя+".")=0 Тогда Продолжить; КонецЕсли;
						//получим структуру файла
						Попытка
							СтруктураФайла = ЗначениеИзФайла(ТекФайл.ПолноеИмя);
						Исключение
							Сообщить("Ошибка считывания файла: " + ОписаниеОшибки());
							Прервать;
						КонецПопытки;
						//попытаемся найти документ в базе
						Попытка
							ТекДокСсылка = ЗначениеИзСтрокиВнутр(СтруктураФайла.Ссылка);
						Исключение
							ТекДокСсылка = Документы[СтруктураФайла.ВидДокумента].ПустаяССылка();
						КонецПопытки;
		 				Если ТекДокСсылка.Пустая() Тогда 
							//если не найден - создадим новый
							ТекДокумент = Документы[СтруктураФайла.ВидДокумента].СоздатьДокумент();
							
						Иначе
							//если найден - получим из базы существующий
							ТекДокумент = ТекДокСсылка.ПолучитьОбъект();
						КонецЕсли;
						Если обЗначениеНеЗаполнено(ТекДокумент) Тогда
							Продолжить;
						КонецЕсли;
										
						// получим коллекции реквизитов шапки и табличных частей документа
						ДокументРеквизитыШапки = Метаданные.Документы[СтруктураФайла.ВидДокумента].Реквизиты;
						ДокументТабличныеЧасти = Метаданные.Документы[СтруктураФайла.ВидДокумента].ТабличныеЧасти;
			
						//перенесем реквизиты документа из структуры файла в текущий объект
						ТекДокумент.Номер = СтруктураФайла.Номер;
						ТекДокумент.Дата  = СтруктураФайла.Дата;
						Для каждого ТекРеквизитШапки Из ДокументРеквизитыШапки Цикл
							Если СтруктураФайла.Свойство(ТекРеквизитШапки.Имя) Тогда
								ТекДокумент[ТекРеквизитШапки.Имя] = СтруктураФайла[ТекРеквизитШапки.Имя];
							КонецЕсли;
						КонецЦикла;
						Для каждого ТекТабличнаяЧасть Из ДокументТабличныеЧасти Цикл
							Если СтруктураФайла.Свойство(ТекТабличнаяЧасть.Имя) Тогда
								ТекТаблицаЗначений = СтруктураФайла[ТекТабличнаяЧасть.Имя];
								ТекДокумент[ТекТабличнаяЧасть.Имя].Загрузить(ТекТаблицаЗначений);
							КонецЕсли;
						КонецЦикла;
						
						// откроем форму сохраненного документа
						ФормаДокумента = ТекДокумент.ПолучитьФорму("ФормаДокумента");
						ФормаДокумента.Открыть();
						ФормаДокумента.Модифицированность = Истина;
						
						// удаляем файл
						УдалитьФайлы(ТекФайл.ПолноеИмя);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//Гэндальф+++
	   	#Если Клиент Тогда
	    Запрос =  Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Компьютеры.Ссылка
		               |ПОМЕСТИТЬ Компы
		               |ИЗ
		               |	Справочник.Компьютеры КАК Компьютеры
		               |ГДЕ
		               |	Компьютеры.ИмяКомпьютера = &ИмяКомпьютера
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Оборудование.Ссылка
		               |ИЗ
		               |	Справочник.Оборудование КАК Оборудование
		               |ГДЕ
		               |	Оборудование.Компьютер В
		               |			(ВЫБРАТЬ
		               |				ВыбНомен.Ссылка
		               |			ИЗ
		               |				Компы КАК ВыбНомен)
		               |	И Оборудование.КлассОборудования <> &КлассОборудования";
		Запрос.УстановитьПараметр("ИмяКомпьютера",ИмяКомпьютера());
		Запрос.УстановитьПараметр("КлассОборудования", Перечисления.КлассыОборудования.ФР);
		Результат = Запрос.Выполнить().Выбрать();
		ОписаниеОшибкиОборудования = "";
		Пока Результат.Следующий() цикл
			Если глТорговоеОборудование.ВключитьОборудование(Результат.Ссылка,ОписаниеОшибкиОборудования)<>0 Тогда
			КонецЕсли;
		КонецЦикла;	
		#КонецЕсли
    	//Гэндальф---

		// Запуск фронта кассира в модальном режиме
		Если РаботаТолькоСФронтомКассира Тогда
			ФронтКассира=Обработки.ФронтКассира.ПолучитьФорму();
			ФронтКассира.ОткрытьМодально();
			ЗавершитьРаботуСистемы(Ложь);
			Возврат;
		КонецЕсли;
		
		// запуск АРМа сотрудника цеха
		Если РаботатьТолькоСАРМомСотрудника Тогда
			// Семенихин 25.04.2023 +++++
			//АрмСотрудника = Обработки.АРМСотрудникЦеха.ПолучитьФорму("ИнтерфейсСотрудникЦеха");
			//АрмСотрудника = Обработки.АРМСотрудникЦехаМобильный.ПолучитьФорму("ИнтерфейсСотрудникЦеха");
			АрмСотрудника = Обработки.АРМСотрудникЦехаШтрихкод.ПолучитьФорму("Форма");
			АрмСотрудника.ОткрытьМодально();
			ЗавершитьРаботуСистемы(Ложь);
			Возврат;
			// Семенихин 25.04.2023 -----
		КонецЕсли;
		
		//Бондаренко++ 20230616
		// запуск АРМа ТСД
		Если РаботатьТолькоСАРМомТСД Тогда
 			АрмТСД = Документы.ТСД.ПолучитьФормуНовогоДокумента("ФормаДокумента");
			АрмТСД.ОткрытьМодально();
			ЗавершитьРаботуСистемы(Ложь);
			Возврат;
 		КонецЕсли;             
		//Бондаренко-- 20230616
		
		//Гэндальф+++
		
		Если РаботатьСМониторомТехника Тогда
			АрмТехника = Отчеты.МониторТехника.ПолучитьФорму("ФормаНастроек");
			АрмТехника.ОткрытьМодально();
			ЗавершитьРаботуСистемы(Ложь);
			Возврат;
		КонецЕсли;

		// запуск АРМа сотрудника цеха
		Если РаботатьТолькоСАРМомТехПроцесса Тогда
			АрмТехПроцесс = Обработки.АРМТехПроцесс.ПолучитьФорму("ИнтерфейсСотрудник");
			АрмТехПроцесс.ОткрытьМодально();
			ЗавершитьРаботуСистемы(Ложь);
			Возврат;
		КонецЕсли;
		
		// получим значение права работать только с АРМом отметки УРВ
		РаботатьСОтметкойУРВ_вар2 = Ложь;
		РаботатьСОтметкойУРВ = Ложь;
		Если обПраво("АвтозапускОтметкиУРВ_вар2", глПрава) Тогда
			РаботатьСОтметкойУРВ_вар2 = Истина;
			
		ИначеЕсли обПраво("АвтозапускОтметкиУРВ", глПрава) Тогда
			РаботатьСОтметкойУРВ = Истина; 
		КонецЕсли;
		// запуск АРМа отметки УРВ
		Если РаботатьСОтметкойУРВ_вар2 Тогда
			АрмСКД = Обработки.ОтметкаУчетаВремениСотрудников_вар2.ПолучитьФорму("Форма");
			АрмСКД.Открыть();
			//ЗавершитьРаботуСистемы(Ложь);
			//Возврат;
			
		ИначеЕсли РаботатьСОтметкойУРВ Тогда
			//Для 64 и 32 разрядной ОС Windows COM объекты регистрируются в разных ветках реестр,
			//поэтому необходимо определить разрядность ОС и считать информацию из нужной ветки	
			////Получаем разрядность операционной	 системы
			//objWMIService = ПолучитьCOMОбъект("winmgmts:root\cimv2");
			//colOperatingSystems = objWMIService.ExecQuery("Select * from Win32_OperatingSystem");
			//Попытка
			//	Для Каждого objOperatingSystem Из colOperatingSystems Цикл
			//		Разрядность = objOperatingSystem.OSArchitecture;
			//	КонецЦикла;		
			//Исключение
			//	//Для OS ниже Windows Vista свойство OSArchitecture неопределено, поэтому падает
			//	//при падении считаем, что это 32-bit ОС Windows
			//	Разрядность = "32-bit"
			//КонецПопытки;	
			//Если Разрядность = "32-bit" Тогда
			//	//Windows 32
			//	//HKEY_LOCAL_MACHINE\SOFTWARE\Classes\CLSID\{AA408ECC-E50B-401F-8036-021E81B9E5A1}\InprocServer32
			//	ВеткаРеестра = "SOFTWARE\Classes\CLSID\{AA408ECC-E50B-401F-8036-021E81B9E5A1}\InprocServer32";
			//Иначе
			//	//Windows 64
			//	//HKEY_LOCAL_MACHINE\SOFTWARE\Classes\Wow6432Node\CLSID\{AA408ECC-E50B-401F-8036-021E81B9E5A1}\InprocServer32
			//	ВеткаРеестра = "SOFTWARE\Classes\Wow6432Node\CLSID\{AA408ECC-E50B-401F-8036-021E81B9E5A1}\InprocServer32";
			//КонецЕсли;
			//// Читаем значение ключа InprocServer32 из ветки 
			//ПутьКVideoCap = "";
			//RegProv=ПолучитьCOMОбъект("winmgmts:{impersonationLevel=impersonate}!\\.\root\default:StdRegProv");
			////2147483650 - соответствует HKEY_LOCAL_MACHINE 
			//RegProv.GetStringValue("2147483650", ВеткаРеестра, "", ПутьКVideoCap);
			//Если обЗначениеНеЗаполнено(ПутьКVideoCap) Тогда
			//	//Предлагаем установить VideoCap		
			//	Режим = РежимДиалогаВопрос.ДаНет;
			//	Текст = "Работа с устройством видеозахвата невозможна, установить VideoCap ActiveX?";
			//	Ответ = Вопрос(Текст, Режим, 0);
			//	Если Ответ = КодВозвратаДиалога.Да Тогда
			//		Каталог = Константы.ПустьКХранилищюСканов.Получить();
			//		ФайлСуществует = ОбщиеСервер.ПроверкаФайлаVideocap();
			//		Если ФайлСуществует Тогда
			//			Предупреждение("Дождитеcь окончания установки VideoCap ActiveX и запустите 1С заново.", 0);
			//			Видео = ОбщиеСервер.УстановкаVideocap();
			//			Видео.Получить().Записать(КаталогВременныхФайлов()+ "videocap5fullversetup.exe");
			//			ЗапуститьПриложение("videocap5fullversetup.exe", КаталогВременныхФайлов(), Ложь);

			//			ЗавершитьРаботуСистемы(Ложь);
			//			
			//		Иначе
			//			Сообщить("Файл не найден: " + Каталог + "videocap5fullversetup.exe");
			//		КонецЕсли;
			//	КонецЕсли;	
			//	
			//Иначе
			//	ФайлУстановки = Новый Файл(ПутьКVideoCap);
			//	Если ФайлУстановки.Существует() Тогда
			//		ЗапуститьПриложение("regsvr32 /S " + ПутьКVideoCap); 
			//		глРаботаСФотоВидеоРазрешена = Истина;
			//		
			//	Иначе
			//		Сообщить("Файл не найден: " + ПутьКVideoCap);
			//	КонецЕсли;
			//КонецЕсли;

			АрмСКД = Обработки.ОтметкаУчетаВремениСотрудников.ПолучитьФорму("Форма");
			АрмСКД.Открыть();
			//ЗавершитьРаботуСистемы(Ложь);
			//Возврат;
		КонецЕсли;
		
		Если РаботатьСУРВВыдача Тогда
			АрмСКД = Обработки.АРМВыдачаЗЧ.ПолучитьФорму("Форма");
			АрмСКД.Открыть();
			//ЗавершитьРаботуСистемы(Ложь);
			//Возврат;
		КонецЕсли;
		
		Если РаботатьСМониторомПриветствия Тогда
				Арм = Отчеты.ПриемкаВыдачаАвтомобилей_ААА5.ПолучитьФорму("ФормаНастроек");
				Арм.Открыть();
		КонецЕсли;

	
		// Приветствие при старте системы
		Если обПраво("ПоказыватьПриветствиеПриСтарте",глПрава) 
			И Не РаботаТолькоСФронтомКассира
			И (ПараметрыСеанса.Пользователь<>Справочники.Пользователи.Робот) Тогда
			// Приветствие пользователя
			Пользователь = ПараметрыСеанса.Пользователь;
			Если обЗначениеНеЗаполнено(Пользователь.Сотрудник) Тогда
				ИмяПользователя = СокрЛП(Пользователь.Наименование);
			Иначе
				ИмяПользователя = СокрЛП(Пользователь.Сотрудник.Наименование);
			КонецЕсли;
			Предупреждение("Здравствуйте уважаемый пользователь """+ИмяПользователя+"""
						   |Система готова к работе.", 2);
		КонецЕсли;
		
		// Проверим нужно ли запустить пусковую панель
		Если обПраво("ОткрыватьПриВходеАРМ",глПрава) Тогда
			Обработки.ФункциональнаяПанель.ПолучитьФорму().Открыть();
		КонецЕсли;
		

	КонецЕсли; // Если НЕ Робот
	
	// SMS4B +
	ЗапуститьРоботаРеглЗаданий();
	// SMS4B -

	ОбработкаПланировщикаЗадач(Перечисления.ПериодыЗапускаЗадачПланировщика.ПриЗапускеСистемы);
	ПодключитьОбработчикОжидания("глОбработкаПланировщикаЗадач",10);
	
	глПроверитьПодключениеНапоминания();
	
	// создадим таблицу учетных записей автоматического транспорта электронной почты
	глУчетныеЗаписиАвтоматическогоТранспортаПисем = Новый ТаблицаЗначений();
	глУчетныеЗаписиАвтоматическогоТранспортаПисем.Колонки.Добавить("УчетнаяЗапись");
	глУчетныеЗаписиАвтоматическогоТранспортаПисем.Колонки.Добавить("ИнтервалОбновления");
	глУчетныеЗаписиАвтоматическогоТранспортаПисем.Колонки.Добавить("АдресЭлектроннойПочты");
	глУчетныеЗаписиАвтоматическогоТранспортаПисем.Колонки.Добавить("Действие");
	глУчетныеЗаписиАвтоматическогоТранспортаПисем.Колонки.Добавить("ВремяПоследнегоПолучения");
	эпПодключитьАвтоматическийТранспортПочты(глУчетныеЗаписиАвтоматическогоТранспортаПисем);

	глИзбранное=Обработки.Избранное.Создать();
	
	#Если Клиент Тогда
	Если обПраво("АдминистраторВходящихSMSСообщений",глПрава) Тогда
		ПодключитьОбработчикОжидания("глПроверкаВходящихSMS",60);
	КонецЕсли;
	#КонецЕсли

	//+СофтФон
	CRMУстановитьЗначенияПоУмолчанию(сфпСофтФонПроСервер.сфпТекущийПользователь(), глКодГорода, глКодСтраны,
		глКоличествоХранимыхЦифрТелефона, глПрефиксВыходаВГород, глПрефиксВыходаНаМежгород, глМаксимальнаяДлинаВнутреннегоНомера);
	глОбработаноВнешнееСобытие = Ложь;
	Если сфпСофтФонПроСервер.сфпПолучитьЗначениеПоУмолчаниюПользователя("ИспользоватьСофтФон") Тогда
		ТекАТС = Константы.CRM_ИспользуемыйСофтФон.Получить();
		//Гэндальф+++
		//Если ТекАТС = Перечисления.CRM_ИспользуемыйСофтФон.СофтФон2 Тогда
		Если ТекАТС = Перечисления.CRM_ИспользуемыйСофтФон.СофтФон2  и Константы.ДилерскийЦентр.Получить() = Справочники.ДилерскиеЦентры.Дельта Тогда
        //Гэндальф---
			Попытка
				сфпФормаТелефонВнешняяПанель = ПолучитьФорму("Обработка.сфпСофтФонВнешняяПанель.Форма.Форма");
				сфпФормаТелефонВнешняяПанель.Подключиться();
			Исключение
				Сообщить("Ошибка подключения " + ОписаниеОшибки());
			КонецПопытки;
		//-СофтФон
		//Гэндальф+++
		ИначеЕсли ТекАТС = Перечисления.CRM_ИспользуемыйСофтФон.СофтФон2 и Константы.ДилерскийЦентр.Получить() <> Справочники.ДилерскиеЦентры.Дельта Тогда 
			Попытка
				// МИКО / Панель телефонии Asterisk / НАЧАЛО
				РарусСофтФонПроф = Обработки.МИКО_ПанельТелефонииДля1С.Создать();
				// МИКО / Панель телефонии Asterisk / КОНЕЦ
				РарусСофтФонПроф.ПодключитьСофтФон();
			Исключение
				Сообщить("Ошибка подключения СофтФона:", СтатусСообщения.ОченьВажное);
				Сообщить(ОписаниеОшибки());
			КонецПопытки;

			//ИначеЕсли ТекАТС = Перечисления.CRM_ИспользуемыйСофтФон.СофтФонПроф Тогда
		ИначеЕсли ТекАТС = Перечисления.CRM_ИспользуемыйСофтФон.СофтФонПроф и Константы.ДилерскийЦентр.Получить() = Справочники.ДилерскиеЦентры.Дельта Тогда
		//Гэндальф---
			Попытка
				РарусСофтФонПроф = Обработки.CRM_СофтФонПроф.Создать();
				РарусСофтФонПроф.ПодключитьСофтФон();
			Исключение
				Сообщить("Ошибка подключения СофтФона:", СтатусСообщения.ОченьВажное);
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
		//Гэндальф+++
		ИначеЕсли ТекАТС = Перечисления.CRM_ИспользуемыйСофтФон.СофтФонПроф и Константы.ДилерскийЦентр.Получить() <> Справочники.ДилерскиеЦентры.Дельта Тогда 
			Попытка
				// МИКО / Панель телефонии Asterisk / НАЧАЛО
				РарусСофтФонПроф = Обработки.МИКО_ПанельТелефонииДля1С.Создать();
				// МИКО / Панель телефонии Asterisk / КОНЕЦ
				РарусСофтФонПроф.ПодключитьСофтФон();
			Исключение
				Сообщить("Ошибка подключения СофтФона:", СтатусСообщения.ОченьВажное);
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
	
			
		//Гэндальф---
		КонецЕсли;
		Если сфпСофтФонПроСервер.сфпИспользоватьСофтФоны() Тогда
			// Подключаемся к системе CLON
			Если сфпСофтФонПроСервер.сфпИспользоватьCLON() Тогда
				Попытка
					сфпСофтФонПроКлиент.сфпПодключитьCLON();
				Исключение
					Сообщить(Нстр("ru = 'Не удалось подключиться к системе CLON'"));
					сфпСофтФонПроКлиент.сфпНастройкиCLON();
				КонецПопытки;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//-СофтФон

	// + КМ
	#Если Клиент Тогда
		ВключитьОтображениеНапоминанияСРабочимиЛистами();
	#КонецЕсли
	// - КМ
	//Гэндальф+++
	#Если Клиент Тогда
		Если РаботатьСМониторомЗагрузкиЦеха <> Неопределено И РаботатьСМониторомЗагрузкиЦеха Тогда
			//ОбработкаАРМСервис = Обработки.АРМЗаписьНаРемонт.Создать();
			////ОбработкаАРМСервис.ЭтоНапоминание = Истина;
			//Форма = ОбработкаАРМСервис.ПолучитьФорму("ИнтерфейсЗаписьНаРемонт");
			//
			//Форма.ЭтоНапоминание = Истина;
			//
			//Форма.Открыть();
			//
			////ЗавершитьРаботуСистемы(Ложь);
			//Возврат;
			Документ	= Новый Структура();
			Документ.Вставить("Источник",			"АРМСервис");
			Документ.Вставить("РабочийЛист",		Документы.ЗаявкаНаРемонт.СоздатьДокумент());
			
			//Закрыть();
			АРМ = "АРМЗаписьНаРемонт";
			ФормаФункциональнойПанели = Обработки.ФункциональнаяПанель.ПолучитьФорму();
			Если ФормаФункциональнойПанели.Открыта() Тогда
				//Проверим открылась ли форма АРМ администратора
				ФормаАРМ = Обработки[АРМ].ПолучитьФорму(,ФормаФункциональнойПанели);
				Если ФормаАРМ.Открыта() Тогда
					Оповестить("Активизировать" + АРМ);
				Иначе
					//ФормаФункциональнойПанели.ОткрытьАРМ(АРМ, ФормаФункциональнойПанели, Документ);
					ФормаАРМ = Обработки[АРМ].ПолучитьФорму(,ФормаФункциональнойПанели);
					//ФормаАРМ = Обработки[ИмяАРМПриемника].ПолучитьФорму(,ФункциональнаяПанель);
                    ФормаАРМ.Основание = Документ;
					ФормаАРМ.ЭлементыФормы.ОсновнаяПанель.ТекущаяСтраница = ФормаАРМ.ЭлементыФормы.ОсновнаяПанель.Страницы.КалендарьНаДень;
					ФормаАРМ.Открыть();

				КонецЕсли;
			Иначе
				ФормаФункциональнойПанели.ЗапускатьАРМПоУмолчанию = Ложь;
				ФормаФункциональнойПанели.Открыть();
				ФормаФункциональнойПанели.ОткрытьАРМ(АРМ, ФормаФункциональнойПанели, Документ);
			КонецЕсли;
			
			
		КонецЕсли;	
	#КонецЕсли
	
	#Если Клиент Тогда
	//Бондаренко 20150923 ++
	
	ДатаРаботыПользователя = Дата(1,1,1);
	
 	РегДРП=РегистрыСведений.ДатыРаботыПользователей.СоздатьНаборЗаписей();
	РегДРП.Отбор.Пользователь.Установить(ПараметрыСеанса.Пользователь);
 	РегДРП.Прочитать();
	
    Если РегДРП.Количество()>0 Тогда
    	ДатаРаботыПользователя = НачалоДня(РегДРП.Получить(0).ДатаРаботы);
    КонецЕсли;
	
	Если ДатаРаботыПользователя <> НачалоДня(ТекущаяДата()) Тогда
		//Бондаренко 20160421 ++
		//ФайлОписания = НайтиФайлы("\\192.168.6.7\гэндальф\Темп\", Формат(ТекущаяДата(), "ДФ = ггггММдд")+ ".txt");
		ФайлОписания = НайтиФайлы("\\sm6\1c-files\", Формат(ТекущаяДата(), "ДФ = ггггММдд")+ ".txt");   
 		//Бондаренко 20160421 -- 
		Если ФайлОписания.Количество() <> 0 Тогда
			Текст1 = Новый ТекстовыйДокумент;
			Текст1.Прочитать(ФайлОписания[0].ПолноеИмя);
			Текст1.ТолькоПросмотр=Истина;
			Текст1.Показать("Описание изменений внесенных в 1С-АльфаАвто для "+Формат(ТекущаяДата(),"ДЛФ=DD"));
		КонецЕсли;
 	КонецЕсли;
    //Бондаренко 20150923 --	
	
	 
	Если обПраво("ПоказИзмененийПриСтартеСистемы",глПрава) Тогда //Бондаренко++-- 20171107
		
		//Бондаренко 20160427 ++
		Если ДатаРаботыПользователя <> НачалоДня(ТекущаяДата()) Тогда
			// поменять на <>
			Попытка
				Док = Документы.ОписаниеИзмененийКонфигурации.ПустаяСсылка();
				Док = НайтиОписание(ТекущаяДата());
				Если НЕ обЗначениеНеЗаполнено(Док) Тогда
					Если Док.ОткрытьОбщуюФорму Тогда
						Форма = Док.ПолучитьФорму("ФормаИнформационная");
						Если Не Форма.Открыта() Тогда
							Форма.Открыть();
 						КонецЕсли; 
 					Иначе
						Текст1 = Новый ТекстовыйДокумент;
						Строка1 = СокрЛП(Док.Описание);
						Текст1.ДобавитьСтроку(Строка1);
						Текст1.Показать("Описание изменений из документа, внесенных в 1С-АА5 для "+Формат(ТекущаяДата(),"ДЛФ=DD"));
					КонецЕсли; 
 				КонецЕсли;

			Исключение
				//
			КонецПопытки;	
			
			//Бондаренко++ 20161226 
			Попытка
				Если обПраво("ЗапускатьРассылкуПрайсаОптовикамПриСтартеСистемы") Тогда
					Обработки.ПрайсЛистДляОптовиков.ПолучитьФорму("Форма").Открыть();			
				КонецЕсли;
			Исключение
			КонецПопытки; 
			//Бондаренко-- 20161226 
			
			//Бондаренко++ 20170719 
			Попытка
				Если обПраво("ЗапускатьОбработкуПиТуПиПриСтартеСистемы") Тогда
					Обработки.ПиТуПи.ПолучитьФорму("Форма").Открыть();			
				КонецЕсли;
			Исключение
			КонецПопытки; 
			//Бондаренко-- 20170719 
		КонецЕсли;	
		//Бондаренко 20160427 --
		
	КонецЕсли; //Бондаренко++-- 20171107
  	
	//Бондаренко++ 20160828
	//ИмяИБ = "";
	// СтрокаСоединения = СокрЛП(Врег(СтрокаСоединенияИнформационнойБазы()));
	//Если Найти(СтрокаСоединения,"REF") > 0  Тогда
	//	ПодстрокиСтрокиСоединения  = обРазложитьСтрокуВМассивПодстрок(СтрокаСоединения,";");
	//	Попытка
	//		ИмяИБ = СокрЛП(ВРЕГ(ПодстрокиСтрокиСоединения[1]));
	//	Исключение
	//		//
	//	КонецПопытки;	
	//	ИмяИБ = СтрЗаменить(ИмяИБ,"REF=","");
	//	ИмяИБ = СтрЗаменить(ИмяИБ,"""","");
	//  Иначе	
	//	ПодстрокиСтрокиСоединения  = обРазложитьСтрокуВМассивПодстрок(СтрокаСоединения,"\");
	//	МаксЗначениеИндекса = ПодстрокиСтрокиСоединения.Количество()-1;
	//	Попытка
	//		ИмяИБ = СокрЛП(ВРЕГ(ПодстрокиСтрокиСоединения[МаксЗначениеИндекса]));
	//	Исключение
	//		//
	//	КонецПопытки;	
	//  КонецЕсли; 
	// ИмяИБ = СтрЗаменить(ИмяИБ,"""","");
	//   ПараметрыСеанса.ИмяИБ = ИмяИБ; 	
	//Сообщить("ПараметрыСеанса.ИмяИБ: '"+ПараметрыСеанса.ИмяИБ+"'");
 	//Бондаренко-- 20160828 
 
	//Бондаренко++ 20180423 #15803
	Если ЗначениеЗаполнено(ПараметрыСеанса.ПодразделениеКомпании) И ЗначениеЗаполнено(ПараметрыСеанса.ПодразделениеКомпании.ДилерскийЦентр) Тогда
		Если (ПараметрыСеанса.ПодразделениеКомпании.ДилерскийЦентр=Справочники.ДилерскиеЦентры.ВолгодонскРено) 
				ИЛИ (ПараметрыСеанса.ПодразделениеКомпании.ДилерскийЦентр=Справочники.ДилерскиеЦентры.СоколШахты)
				ИЛИ РольДоступна("Renault_АдминистративныйИнтерфейсRenault") Тогда
				//Этих оставляем, т.к. Renault
		Иначе	
		    Возврат;
 		КонецЕсли; 	
	КонецЕсли; 
	//Бондаренко-- 20180423 #15803
#КонецЕсли

	//////////////////////
	// //Начало вставки Renault
	// 
	// ОбработкаОбновлениеСтепа = Обработки.Renault_ОбновлениеСтепа.Создать();
	// ОбработкаОбновлениеСтепа.ВыполнитьПроверкуСтепа();
	// 
	// Renault_ПриНачалеРаботы();
	// //
	// //Конец вставки Renault
	 ////////////////
	 ////////////////////
	 
	 //Начало вставки Renault
	 
	 #Если Клиент Тогда
		 
		 Если ПараметрыСеанса.DMS_Бренд = Справочники.CRM_МаркаАвтомобиля.LADA Тогда
			 ГлавныйИнтерфейс.DMS_Renault.Видимость = Ложь;
			 ГлавныйИнтерфейс.DMS_LADA.Видимость = Истина;
		 Иначе
			 ГлавныйИнтерфейс.DMS_Renault.Видимость = Истина;
			 ГлавныйИнтерфейс.DMS_LADA.Видимость = Ложь;
		 КонецЕсли;
		 
	 #КонецЕсли
	 
	 ОбработкаОбновлениеСтепа = Обработки.Renault_ОбновлениеСтепа.Создать();
	 ОбработкаОбновлениеСтепа.ВыполнитьПроверкуСтепа();
	 
	 
	 Renault_ПриНачалеРаботы();
	 Renault_внОбщийМодульКлиент.ПриНачалеРаботыСистемы();
	 
	 
	 //
	 //Конец вставки Renault
	 ////////////////

КонецПроцедуры // ПриНачалеРаботыСистемы()
//Бондаренко 20160427 --

// Обработка предопределенного события
// Выдает запрос на завершение работы
Процедура ПередЗавершениемРаботыСистемы(Отказ)
	// Проверим режим выхода (инициирован пользователем или нет)
	//Попытка
	//	ВнешняяКомпонентаПодключена=Обработки.Защита.Создать().Компонента.УправлениеАктивно();
	//Исключение 
	//	ВнешняяКомпонентаПодключена=Ложь;
	//КонецПопытки;
	//Если ВнешняяКомпонентаПодключена Тогда
	Если НЕ глЗавершениеРаботыСистемы Тогда
		// Запрос на завершение работы системы у пользователя
		Если (обПраво("РаботаСФронтомКассира",глПрава)<>Перечисления.РаботаСФронтомКассира.ТолькоСФронтом) И
			 (НЕ обПраво("УРВ_РаботатьТолькоСАРМомСотрудникаЦеха",глПрава)) Тогда
			Если обПраво("ПоказыватьЗапросНаЗавершениеРаботы",глПрава) Тогда
				Если Вопрос("Завершить работу программы?",РежимДиалогаВопрос.ДаНет,5,КодВозвратаДиалога.Да) = КодВозвратаДиалога.Нет Тогда
					Отказ = Истина; // Пользователь передумал и отменил выход из программы
					Возврат;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	ОбработкаПланировщикаЗадач(Перечисления.ПериодыЗапускаЗадачПланировщика.ПередЗавершениемРаботыСистемы);
	//Если ВнешняяКомпонентаПодключена Тогда
	//	Попытка // отключаем торговое оборудование
	//		Если глТорговоеОборудование<>НЕОПРЕДЕЛЕНО Тогда
	//			глТорговоеОборудование.ОтключитьТорговоеОборудование();
	//		КонецЕсли;
	//	Исключение
	//	КонецПопытки;
	//КонецЕсли;
	//+СофтФон
	Если НЕ Отказ Тогда
		// Завершим работу СофтФона перед выходом из предприятия
		Если НЕ (РарусСофтФонПроф = Неопределено) Тогда
			РарусСофтФонПроф.ЗавершитьСофтФон();
		КонецЕсли;
	КонецЕсли;
	
	//Бондаренко 20150923 ++
	Если НЕ Отказ Тогда
		
		ТекПользователь = ПараметрыСеанса.Пользователь;
		ТекДата = НачалоДня(ТекущаяДата());
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыРаботыПользователей.Пользователь,
		|	ДатыРаботыПользователей.ДатаРаботы
		|ИЗ
		|	РегистрСведений.ДатыРаботыПользователей КАК ДатыРаботыПользователей
		|ГДЕ
		|	ДатыРаботыПользователей.Пользователь = &ВыбПольз
		|	И ДатыРаботыПользователей.ДатаРаботы <> &ВыбДата";
		
		Запрос.УстановитьПараметр("ВыбДата",ТекДата);
		Запрос.УстановитьПараметр("ВыбПольз",ТекПользователь);
		
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
			РегДРП=РегистрыСведений.ДатыРаботыПользователей.СоздатьНаборЗаписей();
			РегДРП.Отбор.Пользователь.Установить(ТекПользователь);
			Попытка
				РегДРП.Записать();
			Исключение
				//
			КонецПопытки;	
		КонецЕсли;
		РегДРП=РегистрыСведений.ДатыРаботыПользователей.СоздатьМенеджерЗаписи();
		РегДРП.Пользователь=ТекПользователь;
		РегДРП.ДатаРаботы = ТекДата;
		Попытка
			РегДРП.Записать();
		Исключение
			//
		КонецПопытки;	
 	
 	КонецЕсли;
	//Бондаренко 20150923 --
	
	  // SP1C / SIP Софтфон для 1С / НАЧАЛО
    Если НЕ РарусСофтФонПроф  = Неопределено Тогда
	РарусСофтФонПроф.ОтключитьВК();
    КонецЕсли;
    // SP1C / SIP Софтфон для 1С / КОНЕЦ
КонецПроцедуры // ПередЗавершениемРаботыСистемы()

// Обработка предопределенного события
// Сохраняет рабочие переменные сеанса
// Обнуляет системные объекты - компоненты, соединения и т.п
Процедура ПриЗавершенииРаботыСистемы()
	глЗавершениеРаботыСистемы = Истина;
	
	НомерСоединения = НомерСоединенияИнформационнойБазы();
	// удалим запись завершения работы пользователя
	//сфРазрешитьРаботуПользователя(, НомерСоединения);
	// Вычеркнем себя из списка выполняющих регламентные операции
	сфОтключитьОбработчикПланировщикаЗаданий();
	Попытка // отключаем торговое оборудование
		Если глТорговоеОборудование<>НЕОПРЕДЕЛЕНО Тогда
			глТорговоеОборудование.ОтключитьТорговоеОборудование();
		КонецЕсли;
	Исключение
	КонецПопытки;
	Попытка
		Если (глРарус_Компонента <> НЕОПРЕДЕЛЕНО) И НЕ обПраво("РазрешитьРаботуССистемойПослеВыхода",глПрава) Тогда
			глРарус_Компонента.ЗавершитьРаботу();
		КонецЕсли;
	Исключение
	КонецПопытки;
	глТорговоеОборудование = НЕОПРЕДЕЛЕНО;
	глРарус_Компонента = НЕОПРЕДЕЛЕНО;
	
	//Отключение от системы лицензирования
	ОписаниеОшибки = "";
	ЛицензированиеСервер.ЗавершениеРаботыСистемыЛицензирования(ОписаниеОшибки);
	Renault_внОбщийМодульКлиент.ПриЗавершенииРаботыСистемы();
КонецПроцедуры // ПриЗавершенииРаботыСистемы()

// Обработка предопределенного события
// Выполняет действия для всех видов внешних событий
Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)
	Если Источник = "Сканер" Тогда
		
	ИначеЕсли Источник="Синхронизатор" Тогда
		глТорговоеОборудование.ОбработкаВнешнегоСобытия(Источник, Событие, Данные);
		
	ИначеЕсли Лев(Источник,7)="Задача_" Тогда // изменилось состояние отправленной на другой компьютер задачи
		глТорговоеОборудование.ОбработкаВнешнегоСобытия(Источник, Событие, Данные);
		
	ИначеЕсли Источник = "КОМПОНЕНТА" Тогда
		опОбработкаВнешнегоСобытия(Источник, Событие, Данные);
	ИначеЕсли Источник = "Коммуникатор" Тогда
		GUIDОборудования = Лев(Событие,38);
		глПолучитьСписокSMSСообщений(GUIDОборудования);
	ИначеЕсли Источник = "RTUP" Тогда
		CRMОбработкаВнешнегоСобытия(Источник, Событие, Данные, РарусСофтФонПроф, Неопределено, Неопределено, Неопределено);
		глОбработаноВнешнееСобытие = Ложь;
	КонецЕсли; 
	
	// МИКО / Панель телефонии Asterisk / Начало 
	Если НЕ РарусСофтФонПроф = Неопределено 
		 И (Источник = "MikoAjamEvent" ИЛИ Источник = "MIKO_SoftPhone" ИЛИ Источник = "MIKO_InFormAutor") Тогда
		РарусСофтФонПроф.ОбработкаВнешнегоСобытияАстериск(Источник, Событие, Данные);
	КонецЕсли;
	// МИКО / Панель телефонии Asterisk / Конец
	
КонецПроцедуры // ОбработкаВнешнегоСобытия()

// Процедура проверяет, есть ли регистры с выключенными итогами,
// если необходимо включает их использование.
Процедура ОпределитьНеобходимостьВключенияИтогов()
	
	СписокРегистровКВключениюИтогов = Новый СписокЗначений;
	Для Каждого Регистр ИЗ РегистрыНакопления Цикл                               
		МетаданныеРегистра = Метаданные.НайтиПоТипу(Тип(Регистр));
		Если МетаданныеРегистра.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки Тогда
			Если НЕ Регистр.ПолучитьИспользованиеИтогов() Тогда
				СписокРегистровКВключениюИтогов.Добавить(Регистр, "Регистр накопления "+МетаданныеРегистра.Синоним);
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;	
	
	Если СписокРегистровКВключениюИтогов.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Вопрос("Обнаружено отключение использования итогов по ряду регистров." + Символы.ПС 
				+ "Для избежания ошибок рекомендуется включить"+Символы.ПС
				+ "использование итогов регистров.Выполнить это сейчас?", 
			РежимДиалогаВопрос.ДаНет, 25 , КодВозвратаДиалога.Да) <> КодВозвратаДиалога.Да Тогда
			Возврат;
	КонецЕсли;

	Для Каждого РегистрИзСписка Из СписокРегистровКВключениюИтогов Цикл
		РегистрИзСписка.Значение.УстановитьИспользованиеИтогов(Истина);		
		МетаданныеРегистра = Метаданные.НайтиПоТипу(ТипЗнч(РегистрИзСписка.Значение));
		Если Метаданные.РегистрыНакопления.Содержит(МетаданныеРегистра) Тогда
			ТипРегистра = " накопления ";
		КонецЕсли;
		Сообщить("Включено использование итогов регистра"+ТипРегистра+""""+МетаданныеРегистра.Синоним+"""");
	КонецЦикла;
 
КонецПроцедуры

//Функция для отправки SMS
//Входные параметры:
//		Получатели - либо текст с одним номером, либо список значений с номерами
//		Сообщение - текст сообщения
//		Отправитель - строка с номером отправителя из оборудования
//		Оборудование - ссылка на элемент справочника оборудование
//		Транслит - флаг транслитировать текст или нет тип Булево
//		Отчет - Флаг запроса отчета о доставке тип Булево
//		СоздаватьСобытие - ссылка на значение перечисления ВариантыОтветов.
//			Если значение НЕТ то при отправке событие не создается, 
//			если ДА - SMS отправляется и создается событие,
//			СПРОСИТЬ - SMS не отправляется, просто открывается документ Событие
//		СтрокаОшибкиФункции - Описание ошибки в случае неудачной отправки
//Возвращает список значений в котором в представлении указан номер получателя, в значении указан гуид SMS.
//В случае если при отправке возникает ошибка то описание ошибки передается в переменной СтрокаОшибкиФункции.
Функция глОтправитьSMS(Получатели,Сообщение,Отправитель=Неопределено,Оборудование=Неопределено,Транслит=Неопределено,Отчет=Неопределено,СоздаватьСобытие = Неопределено,СтрокаОшибкиФункции = "") Экспорт
	Права = глПрава;
	ОбрТорговоеОборудование = глТорговоеОборудование;
	СтрокаОшибки = "";
	Возврат кмОтправитьSMS(Получатели,Сообщение,ОбрТорговоеОборудование,Права,Отправитель,Оборудование,Транслит,Отчет,СоздаватьСобытие,СтрокаОшибки);
КонецФункции

//Процедура открытия софт-фона
Процедура глОткрытьСофтФонИзМеню() Экспорт
	РезультатПодключения = Ложь;
	
	Если НЕ глИспользоватьСофтФонПроф Тогда
		Предупреждение("СофтФон не используется.");
		Возврат;
	КонецЕсли;
	
	Если НЕ РарусСофтФонПроф = Неопределено И НЕ глРарус_Компонента = Неопределено Тогда
		РезультатПодключения = РарусСофтФонПроф.ПодключитьСофтФон();
	КонецЕсли;
КонецПроцедуры

Процедура ЗапуститьРоботаРеглЗаданий() Экспорт 
	
	РоботРеглЗаданий = Константы.смсРоботРегламентныхЗаданий.Получить();
	Если НЕ РоботРеглЗаданий = Справочники.Пользователи.ПустаяСсылка() Тогда
		Если ПараметрыСеанса.Пользователь = РоботРеглЗаданий Тогда
			ПодключитьОбработчикОжидания("ОбработкаЗаданий", 60);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаданий() Экспорт
	ВыполнитьОбработкуЗаданий();
КонецПроцедуры

//+СофтФон

// Процедура предназначена для открытия СофтФона из меню
Процедура ОткрытьСофтФонИзМеню() Экспорт
	РезультатПодключения = Ложь;
	// Если не выбран ни один из СофтФонов, попросим пользователя указать необходимый
	Если НЕ ЗначениеЗаполнено (Константы.CRM_ИспользуемыйСофтФон.Получить()) Тогда
		Предупреждение("Не выбран используемый КоллЦентр!!! Для того, что бы выбрать"+Символы.ПС+
					   "необходимый КоллЦентр, необходимо открыть форму настройки."+Символы.ПС+
					   "<Сервис>-<Настройка параметров учета> выбрать закладку <СофтФон>"+Символы.ПС+
					   "и указать используемый в системе КоллЦентр."+Символы.ПС+
					   "Так же указать сервер синхронизации. Остальные параметры можно"+Символы.ПС+
					   "заполнить в другое время.",30, "КоллЦентр, не выбран.");
		Возврат;
	КонецЕсли;
	ФлагИспользованияПроф = Константы.CRM_ИспользуемыйСофтФон.Получить();
	Если ФлагИспользованияПроф = Перечисления.CRM_ИспользуемыйСофтФон.СофтФонПроф Тогда
		// Подключаем внешний обработчик для работы телефонии
		Если НЕ РарусСофтФонПроф = Неопределено И НЕ РарусСофтФонКомпонента = Неопределено Тогда
			РезультатПодключения = РарусСофтФонПроф.ПодключитьСофтФон();
		Иначе
			CRMОткрытьСообщениеОшибкиПодключения("СофтФон");
		КонецЕсли;
	ИначеЕсли ФлагИспользованияПроф = Перечисления.CRM_ИспользуемыйСофтФон.СофтФон2 Тогда
		Попытка
			сфпФормаТелефонВнешняяПанель = ПолучитьФорму("Обработка.сфпСофтФонВнешняяПанель.Форма.Форма");
			сфпФормаТелефонВнешняяПанель.Подключиться();
		Исключение
			Сообщить("Ошибка подключения " + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

// - КМ
// Функция возвращает объект для взаимодействия с торговым оборудованием.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  <ОбработкаОбъект> - Объект для взаимодействия с торговым оборудованием.
//
Функция ПолучитьСерверТО() Экспорт

                Если глСерверТО = Неопределено Тогда
                               глСерверТО = Обработки.Renault_ТОСервер.Создать();
                КонецЕсли;

                Возврат глСерверТО;

КонецФункции // ПолучитьСерверТО()

//-СофтФон

//+ Renault
Процедура внПроверитьПодпискиНаСобытия() Экспорт
	
	Renault_внОбщийМодульКлиент.ПроверитьПодпискиНаСобытия();
	
КонецПроцедуры

//Бондаренко 20160427 ++	
Функция НайтиОписание(ТекДата) 
	
	Попытка
		Запрос = Новый Запрос;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОписаниеИзмененийКонфигурации.Ссылка,
		|	ОписаниеИзмененийКонфигурации.Дата,
		|	ОписаниеИзмененийКонфигурации.ПометкаУдаления
		|ИЗ
		|	Документ.ОписаниеИзмененийКонфигурации КАК ОписаниеИзмененийКонфигурации
		|ГДЕ
		|	ОписаниеИзмененийКонфигурации.ПометкаУдаления = ЛОЖЬ
		|	И ОписаниеИзмененийКонфигурации.Дата МЕЖДУ &ВыбДата1 И &ВыбДата2";
		
		Запрос.Параметры.Вставить("ВыбДата1",НачалоДня(ТекДата));	
		Запрос.Параметры.Вставить("ВыбДата2",КонецДня(ТекДата));	
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
		
		Возврат "";
	Исключение
		Возврат "";
	КонецПопытки;	
	
КонецФункции	

// Процедура вызывается периодически для получения списка сообщений на оборудовании и обработка их
Процедура глПолучитьСписокSMSСообщений(GUIDОборудования) Экспорт
	Если обПраво("АдминистраторВходящихSMSСообщений",глПрава) Тогда
		////получаем сообщения с оборудования
		ТекОборудование = Справочники.Оборудование.НайтиПоРеквизиту("ИдентификаторОборудования",GUIDОборудования);
		Если НЕ ТекОборудование = Справочники.Оборудование.ПустаяСсылка() Тогда
			Фильтр = глТорговоеОборудование.СоздатьФильтр(2,0,0,"","",0,"",0,0,ТекОборудование);
			СписокСообщений = глТорговоеОборудование.ПолучитьСписокСообщений(Фильтр,ТекОборудование);
			кмОбработатьСписокВхСообщений(СписокСообщений,глТорговоеОборудование);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//Процедура проверки наличия входящих СМС
Процедура глПроверкаВходящихSMS() Экспорт
	Оборудование = кмВернутьОборудованиеПоУмолчанию();
	GUIDОборудования = Оборудование.ИдентификаторОборудования;
	глПолучитьСписокSMSСообщений(GUIDОборудования)
КонецПроцедуры

//-СофтФон

// + КМ
Процедура ВключитьОтображениеНапоминанияСРабочимиЛистами()
	
	ИнтервалОтображения = обПраво("ИнтервалНапоминанияСРабочимиЛистами");
	
	Если ИнтервалОтображения > 0 Тогда
		ПоказатьНапоминаниеСРабочимиЛистами();
		ПодключитьОбработчикОжидания("ПоказатьНапоминаниеСРабочимиЛистами", ИнтервалОтображения * 60);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоказатьНапоминаниеСРабочимиЛистами() Экспорт 
	// +++++ Соколмоторс +++++
	ДатаНачала = НачалоДня(ТекущаяДата());
	ДатаОкончания = КонецДня(ТекущаяДата());
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Статус", Справочники.СтатусыРабочегоЛиста.Создан);
	Запрос.УстановитьПараметр("Сотрудник", ПараметрыСеанса.Пользователь.Сотрудник);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.Текст = "ВЫБРАТЬ
	               |	РабочийЛистСервиса.Ссылка
	               |ИЗ
	               |	Документ.РабочийЛистСервиса КАК РабочийЛистСервиса
	               |ГДЕ
	               |	НЕ РабочийЛистСервиса.ПометкаУдаления
	               |	И РабочийЛистСервиса.Статус = &Статус
	               |	И РабочийЛистСервиса.Менеджер = &Сотрудник
	               |	И РабочийЛистСервиса.ДатаКонтакта МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Результат = Запрос.Выполнить().Выбрать();	
	Если Не Результат.Следующий() Тогда
		Возврат;
	КонецЕсли;
	// ----- Соколмоторс -----
	
	ОбработкаАРМСервис = Обработки.АРМСервис.Создать();
	ОбработкаАРМСервис.ЭтоНапоминание = Истина;
	Форма = ОбработкаАРМСервис.ПолучитьФорму("ИнтерфейсСервис");
	
	СписокРабочихЛистов = Форма.СписокРабочихЛистов;
	СписокРабочихЛистов.Отбор.Статус.ВидСравнения = ВидСравнения.Равно;
	СписокРабочихЛистов.Отбор.Статус.Значение = Справочники.СтатусыРабочегоЛиста.Создан;
	СписокРабочихЛистов.Отбор.Статус.Использование = Истина;
	
	СписокРабочихЛистов.Отбор.Менеджер.ВидСравнения	= ВидСравнения.Равно;
	СписокРабочихЛистов.Отбор.Менеджер.Значение = ПараметрыСеанса.Пользователь.Сотрудник;
	СписокРабочихЛистов.Отбор.Менеджер.Использование = Истина;	
	
	//СписокРабочихЛистов.Отбор.УчастникПрограммыПроактивныйКонтакт.Значение = Истина;
	//СписокРабочихЛистов.Отбор.УчастникПрограммыПроактивныйКонтакт.Использование = Истина;
	СписокРабочихЛистов.Отбор.ДатаКонтакта.ВидСравнения = ВидСравнения.ИнтервалВключаяГраницы;
	СписокРабочихЛистов.Отбор.ДатаКонтакта.ЗначениеС = ДатаНачала;
	СписокРабочихЛистов.Отбор.ДатаКонтакта.ЗначениеПо = ДатаОкончания;
	СписокРабочихЛистов.Отбор.ДатаКонтакта.Использование = Истина;
	
	Форма.Открыть();
	
КонецПроцедуры

Процедура Полный_1CДействие() Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ГлавныйБухгалтер_1СДействие() Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ИнтерфейсВыработкаИсполнителейДействие() Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

глОповещениеАктивации = Ложь;	// изначально формы списков не вызывают оповещения при активации строк
глАвтокаталог = Неопределено;
глЗавершениеРаботыСистемы = Ложь;
глСписокПринтеров = Неопределено;
глЦифрДляИндексаТелефона = 11; // Количество цифр для построения индекса телефона в регистре Контактная информация
