
Функция ПолучитьМаппинг (МежсервисныйПробег) Экспорт
	
	Макет = ПолучитьМакет("СоответствиеПробегаТО");
	ТаблицаМаппинг = Новый ТаблицаЗначений;
	ТаблицаМаппинг.Колонки.Добавить("Пробег",Новый ОписаниеТипов("Число"));
	ТаблицаМаппинг.Колонки.Добавить("ВидТО", Новый ОписаниеТипов("ПеречислениеСсылка.Renault_ВидыТО"));
	Для х = 1 По Макет.ВысотаТаблицы Цикл
		
		ВидТО = Перечисления.Renault_ВидыТО[Макет.Область("R"+х+"C2").Текст];
		Пробег = Число(Макет.Область("R"+х+"C1").Текст);
		
		Если ВидТО = Перечисления.Renault_ВидыТО.ТО_0 Тогда
			СтрокаТЗ = ТаблицаМаппинг.Добавить();
			СтрокаТЗ.Пробег = Пробег;
			СтрокаТЗ.ВидТО = ВидТО;
		ИначеЕсли Пробег%МежсервисныйПробег = 0 Тогда
			СтрокаТЗ = ТаблицаМаппинг.Добавить();
			СтрокаТЗ.Пробег = Пробег;
			СтрокаТЗ.ВидТО = ВидТО;
		КонецЕсли;
		
	КонецЦикла;
	Возврат ТаблицаМаппинг;
КонецФункции

Процедура ВыполнитьРасчет(ДатаНачала) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	АвтомобилиСрезПоследних.Период КАК Период,
	|	АвтомобилиСрезПоследних.Автомобиль,
	|	АвтомобилиСрезПоследних.ВидЗначения,
	|	АвтомобилиСрезПоследних.Значение
	|ИЗ
	|	РегистрСведений.Автомобили.СрезПоследних(, ) КАК АвтомобилиСрезПоследних
	|ГДЕ
	|	АвтомобилиСрезПоследних.ВидЗначения = &ВидЗначения
	|	И АвтомобилиСрезПоследних.Период МЕЖДУ &Начало И &Конец
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Запрос.УстановитьПараметр("ВидЗначения", Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
	Запрос.УстановитьПараметр("Начало", ДатаНачала);
	Запрос.УстановитьПараметр("Конец", НачалоДня(ТекущаяДата()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		РассчитатьЗапись(Выборка);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РассчитатьЗапись(СтрокаИсточника) Экспорт
	МежсервисныйПробег = СтрокаИсточника.Автомобиль.ВариантКомплектации.МежсервисныйПробегТО;

	Если не ЗначениеЗаполнено(МежсервисныйПробег) Тогда
		МежсервисныйПробег = СтрокаИсточника.Автомобиль.Модель.МежсервисныйПробегТО;
		Если Не ЗначениеЗаполнено(МежсервисныйПробег) Тогда
			МежсервисныйПробег = 15000;
		КонецЕсли;
		
	КонецЕсли;

	ТабМаппинг = ПолучитьМаппинг(МежсервисныйПробег);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.Пробег,
	|	ТЗ.ВидТО
	|ПОМЕСТИТЬ ВР_ТЗ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|ГДЕ
	|	ТЗ.Пробег >= &Пробег
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ВР_ТЗ.Пробег) КАК Пробег
	|ПОМЕСТИТЬ ВТ_Пробег
	|ИЗ
	|	ВР_ТЗ КАК ВР_ТЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ВыполнениеТО.СрезПоследних(&КонецПериода, Автомобиль = &Автомобиль) КАК Renault_ВыполнениеТОСрезПоследних
	|		ПО ВР_ТЗ.ВидТО = Renault_ВыполнениеТОСрезПоследних.ВидТО
	|ГДЕ
	|	(Renault_ВыполнениеТОСрезПоследних.ДатаФакт = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ Renault_ВыполнениеТОСрезПоследних.ДатаФакт ЕСТЬ NULL )
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВР_ТЗ.ВидТО,
	|	ВР_ТЗ.Пробег
	|ПОМЕСТИТЬ ВТ_ВидТО
	|ИЗ
	|	ВТ_Пробег КАК ВТ_Пробег
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВР_ТЗ КАК ВР_ТЗ
	|		ПО ВТ_Пробег.Пробег = ВР_ТЗ.Пробег
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АвтомобилиСрезПоследних.Значение,
	|	ВТ_ВидТО.ВидТО,
	|	РАЗНОСТЬДАТ(АвтомобилиСрезПоследних.Период, &КонецПериода, ДЕНЬ) КАК РазностьДни,
	|	РАЗНОСТЬДАТ(АвтомобилиСрезПоследних.Период, &КонецПериода, МЕСЯЦ) КАК РазностьМесяц,
	|	ВТ_ВидТО.Пробег КАК ПробегТО,
	|	АвтомобилиСрезПоследних.Автомобиль.Модель.МежсервисныйПробегТО КАК МежсервисныйПробегТО
	|ИЗ
	|	РегистрСведений.Автомобили.СрезПоследних(
	|			&Граница,
	|			Автомобиль = &Автомобиль
	|				И ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Пробег)) КАК АвтомобилиСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВидТО КАК ВТ_ВидТО
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Renault_ВыполнениеТОСрезПоследних.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_Период
	|ИЗ
	|	РегистрСведений.Renault_ВыполнениеТО.СрезПоследних(&Граница, Автомобиль = &Автомобиль) КАК Renault_ВыполнениеТОСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_ВыполнениеТОСрезПоследних.ВидТО,
	|	Renault_ВыполнениеТОСрезПоследних.ДатаФакт
	|ИЗ
	|	РегистрСведений.Renault_ВыполнениеТО.СрезПоследних(&Граница, Автомобиль = &Автомобиль) КАК Renault_ВыполнениеТОСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Период КАК ВТ_Период
	|		ПО Renault_ВыполнениеТОСрезПоследних.Период = ВТ_Период.Период
	|ГДЕ
	|	Renault_ВыполнениеТОСрезПоследних.ДатаФакт <> ДАТАВРЕМЯ(1, 1, 1)";
	Запрос.УстановитьПараметр("ТЗ", ТабМаппинг);
	Запрос.УстановитьПараметр("Пробег",СтрокаИсточника.Значение); 
	Запрос.УстановитьПараметр("Автомобиль", СтрокаИсточника.Автомобиль);
	Запрос.УстановитьПараметр("Граница", Новый Граница(СтрокаИсточника.Период, ВидГраницы.Исключая));
	ЗАпрос.УстановитьПараметр("КонецПериода", СтрокаИсточника.Период);
	
	мРезультат = Запрос.ВыполнитьПакет();
	Результат = мРезультат[3];
	Если Результат.Пустой() Тогда
		ЗапросПродажи = Новый Запрос;
		ЗапросПродажи.Текст =
		"ВЫБРАТЬ
		|	ТЗ.Пробег,
		|	ТЗ.ВидТО
		|ПОМЕСТИТЬ ВР_ТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|ГДЕ
		|	ТЗ.Пробег >= &Пробег
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ВР_ТЗ.Пробег) КАК Пробег
		|ПОМЕСТИТЬ ВТ_Пробег
		|ИЗ
		|	ВР_ТЗ КАК ВР_ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВР_ТЗ.ВидТО,
		|	ВР_ТЗ.Пробег
		|ПОМЕСТИТЬ ВТ_ВидТО
		|ИЗ
		|	ВТ_Пробег КАК ВТ_Пробег
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВР_ТЗ КАК ВР_ТЗ
		|		ПО ВТ_Пробег.Пробег = ВР_ТЗ.Пробег
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВидТО.ВидТО,
		|	РАЗНОСТЬДАТ(ПродажиАвтомобилей.Период, &КонецПериода, ДЕНЬ) КАК РазностьДни,
		|	РАЗНОСТЬДАТ(ПродажиАвтомобилей.Период, &КонецПериода, МЕСЯЦ) КАК РазностьМесяц,
		|	ВТ_ВидТО.Пробег КАК ПробегТО,
		|	0 КАК Значение
		|ИЗ
		|	РегистрНакопления.ПродажиАвтомобилей КАК ПродажиАвтомобилей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВидТО КАК ВТ_ВидТО
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ПродажиАвтомобилей.Автомобиль = &Автомобиль";
		ЗапросПродажи.УстановитьПараметр("Автомобиль", СтрокаИсточника.Автомобиль);
		ЗапросПродажи.УстановитьПараметр("ТЗ", ТабМаппинг);
		ЗапросПродажи.УстановитьПараметр("Пробег",СтрокаИсточника.Значение); 
		ЗапросПродажи.УстановитьПараметр("КонецПериода", СтрокаИсточника.Период);
		
		РезультатПродажи = ЗапросПродажи.Выполнить();
		Если РезультатПродажи.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
		ВыборкаПродажи = РезультатПродажи.Выбрать();
		ВыборкаПродажи.Следующий();
		
		Если ВыборкаПродажи.РазностьДни = 0 Тогда
			
			Возврат;
			
		КонецЕсли;
		
		Если СтрокаИсточника.Значение = ЧИСЛО(ВыборкаПродажи.Значение) Тогда
			
			Возврат;
			
		КонецЕсли;
		
		Попытка
			
			
			Менеджер = РегистрыСведений.Renault_ВыполнениеТО.СоздатьМенеджерЗаписи();
			Менеджер.Автомобиль = СтрокаИсточника.Автомобиль;
			Менеджер.ВидТО = ВыборкаПродажи.ВидТО;
			Менеджер.Период = СтрокаИсточника.Период;
			Менеджер.СкоростьПробега = (СтрокаИсточника.Значение - ВыборкаПродажи.Значение)/ВыборкаПродажи.РазностьДни*?(ВыборкаПродажи.РазностьМесяц = 0, 30 ,ВыборкаПродажи.РазностьМесяц*30);
			ДатаПлан = СтрокаИсточника.Период + (ВыборкаПродажи.ПробегТО - СтрокаИсточника.Значение) /((СтрокаИсточника.Значение - ВыборкаПродажи.Значение)/ВыборкаПродажи.РазностьДни)* 86400;
			Менеджер.ПланПробег = ВыборкаПродажи.ПробегТО;
			Если ДатаПлан > ДобавитьМесяц(СтрокаИсточника.Период, 12) Тогда
				
				ДатаПлан = ДобавитьМесяц(СтрокаИсточника.Период, 12);
				
			КонецЕсли;
			
			Менеджер.ДатаПлан = ДатаПлан;
			Менеджер.Записать();
			
		Исключение
			
			Возврат;
			
		КонецПопытки;
		
	Иначе
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Менеджер = РегистрыСведений.Renault_ВыполнениеТО.СоздатьМенеджерЗаписи();
		Менеджер.Автомобиль = СтрокаИсточника.Автомобиль;
		Менеджер.ВидТО = Выборка.ВидТО;
		Менеджер.Период = СтрокаИсточника.Период;
		
		Если Выборка.РазностьДни = 0 Тогда
			
			Возврат;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.Значение) И СтрокаИсточника.Значение = ЧИСЛО(Выборка.Значение) Тогда // DMSREN-1153 
			
			Возврат;
			
		КонецЕсли;
		
		Попытка
			Если мРезультат[5].Пустой() Тогда
				Пробег = Выборка.ПробегТО - СтрокаИсточника.Значение;
			Иначе
				Пробег = 15000 + Выборка.Значение - СтрокаИсточника.Значение;
			КонецЕсли;
			Менеджер.СкоростьПробега = (СтрокаИсточника.Значение - Выборка.Значение)/Выборка.РазностьДни*?(Выборка.РазностьМесяц = 0, 30 ,Выборка.РазностьМесяц);
			ДатаПлан = СтрокаИсточника.Период + Пробег /((СтрокаИсточника.Значение - Выборка.Значение)/Выборка.РазностьДни)* 86400;
			Менеджер.ПланПробег = ?( мРезультат[5].Пустой(),Выборка.ПробегТО, 15000 + Выборка.Значение);
			Если ДатаПлан > ДобавитьМесяц(СтрокаИсточника.Период, 12) Тогда
				
				ДатаПлан = ДобавитьМесяц(СтрокаИсточника.Период, 12);
				
			КонецЕсли;
			
			Менеджер.ДатаПлан = ДатаПлан;
			
			Менеджер.Записать();
			
		Исключение
			
			Возврат;
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПоследнийТО(Автомобиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Renault_ВыполнениеТОСрезПоследних.ДатаПлан
	|ИЗ
	|	РегистрСведений.Renault_ВыполнениеТО.СрезПоследних КАК Renault_ВыполнениеТОСрезПоследних
	|ГДЕ
	|	Renault_ВыполнениеТОСрезПоследних.Автомобиль = &Автомобиль
	|	И Renault_ВыполнениеТОСрезПоследних.ДатаФакт = ДАТАВРЕМЯ(1, 1, 1)
	|	И Renault_ВыполнениеТОСрезПоследних.ДатаПлан >= &ДатаПлан";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	//Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	запрос.УстановитьПараметр("ДатаПлан", НачалоДня(ТекущаяДата()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда		
		Возврат Выборка.ДатаПлан;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

//DMSREN-907
Функция ПолучитьПервыйТо(Автомобиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Renault_ВыполнениеТО.Период КАК Период,
	|	Renault_ВыполнениеТО.Автомобиль КАК Автомобиль,
	|	Renault_ВыполнениеТО.ВидТО КАК ВидТО,
	|	Renault_ВыполнениеТО.СкоростьПробега КАК СкоростьПробега,
	|	Renault_ВыполнениеТО.ДатаПлан КАК ДатаПлан,
	|	Renault_ВыполнениеТО.ДатаФакт КАК ДатаФакт,
	|	Renault_ВыполнениеТО.ПланПробег КАК ПланПробег
	|ИЗ
	|	РегистрСведений.Renault_ВыполнениеТО КАК Renault_ВыполнениеТО
	|ГДЕ
	|	Renault_ВыполнениеТО.Автомобиль = &Автомобиль
	|	И Renault_ВыполнениеТО.ДатаФакт = ДАТАВРЕМЯ(1, 1, 1)
	|	И Renault_ВыполнениеТО.ДатаПлан >= &ДатаПлан
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПлан";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	//Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	запрос.УстановитьПараметр("ДатаПлан", НачалоДня(ТекущаяДата()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда		
		Возврат Выборка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	

	
	
КонецФункции
//---

Функция ПолучитьПредыдущийТО(Автомобиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Renault_ВыполнениеТОСрезПоследних.ЗаказНаряд,
	|	Renault_ВыполнениеТОСрезПоследних.ДатаФакт
	|ИЗ
	|	РегистрСведений.Renault_ВыполнениеТО.СрезПоследних КАК Renault_ВыполнениеТОСрезПоследних
	|ГДЕ
	|	Renault_ВыполнениеТОСрезПоследних.Автомобиль = &Автомобиль
	|	И Renault_ВыполнениеТОСрезПоследних.ДатаФакт <> ДАТАВРЕМЯ(1, 1, 1)
	|	И Renault_ВыполнениеТОСрезПоследних.ДатаФакт <= &ТекущаяДата";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
//	запрос.УстановитьПараметр("ДатаПлан", НачалоДня(ТекущаяДата()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда		
		Возврат Выборка.ДатаФакт;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции