Перем Права Экспорт;

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Renault_ИнформацияПоЗаявкамDistri.Автомобиль,
	|	Renault_ИнформацияПоЗаявкамDistri.ИдентификаторСтрокиДоговора,
	|	Renault_ИнформацияПоЗаявкамDistri.НомерКлиентскойЗаявки,
	|	Renault_ИнформацияПоЗаявкамDistri.ПродажаВнесена,
	|	Renault_ИнформацияПоЗаявкамDistri.НомерОрдера
	|ИЗ
	|	РегистрСведений.Renault_ИнформацияПоЗаявкамDistri КАК Renault_ИнформацияПоЗаявкамDistri
	|ГДЕ
	|	Renault_ИнформацияПоЗаявкамDistri.Автомобиль.VIN = &VIN";
	Запрос.УстановитьПараметр("VIN", VIN);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда			
		Запись = РегистрыСведений.Renault_ИнформацияПоЗаявкамDistri.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Прочитать();
		Запись.Заявка = Ссылка;
		Запись.НомерКлиентскойЗаявки = NumCl;
		Запись.НомерОрдера = НомерОрдера;
		Запись.ПродажаВнесена = ?(ЗначениеЗаполнено(NumCl),Истина,Ложь);
		Запись.Записать();
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Renault_ИнформацияПоЗаявкамDistri.Автомобиль,
	|	Renault_ИнформацияПоЗаявкамDistri.ИдентификаторСтрокиДоговора,
	|	Renault_ИнформацияПоЗаявкамDistri.НомерКлиентскойЗаявки,
	|	Renault_ИнформацияПоЗаявкамDistri.ПродажаВнесена,
	|	Renault_ИнформацияПоЗаявкамDistri.НомерОрдера
	|ИЗ
	|	РегистрСведений.Renault_ИнформацияПоЗаявкамDistri КАК Renault_ИнформацияПоЗаявкамDistri
	|ГДЕ
	|	Renault_ИнформацияПоЗаявкамDistri.Автомобиль.VIN = &VIN";
	Запрос.УстановитьПараметр("VIN", VIN);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда			
		Запись = РегистрыСведений.Renault_ИнформацияПоЗаявкамDistri.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Прочитать();
		Запись.Заявка = Документы.DMS_ЗаявкаНаАвтомобиль.ПустаяСсылка();
		Запись.Записать();
	КонецЕсли;
	

КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс(); 
	//Префикс = "1";
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Клиент) Тогда 
		Отказ = Истина;
		// --- DMSREN-1183
		Сообщение = новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка записи. Не заполнено поле ""Клиент""";
		Сообщение.Сообщить();
		// DMSREN-1183 ---
	КонецЕсли;
	
	Если ЗначениеЗаполнено(VIN) И ЗначениеЗаполнено(ДоговорКП) и ЗначениеЗаполнено(ИдентификаторСтрокиДоговора) Тогда
		ДанныеАвто = Новый Структура;
		ДанныеАвто.Вставить("Модель",Модель);
		ДанныеАвто.Вставить("Цвет",Цвет);
		ДанныеАвто.Вставить("Версия", Версия);
		Автомобиль = Renault_ЗагрузкаДанныхОбАвтомобиляхПроизводителя.НайтиСоздатьАвтомобильПоВину_v2(VIN,ДанныеАвто);
		СтрокаДоговора = ДоговорКП.СоставДоговора.Найти(ИдентификаторСтрокиДоговора,"Идентификатор");
		Если НЕ ЗначениеЗаполнено(СтрокаДоговора.VIN) Тогда
			Договор = ДоговорКП.ПолучитьОбъект();
			СтрокаДоговора = Договор.СоставДоговора.Найти(ИдентификаторСтрокиДоговора,"Идентификатор");
			СтрокаДоговора.VIN = VIN;
			СтрокаДоговора.Автомобиль = Автомобиль;
			Договор.Записать();
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	Renault_ИнформацияПоЗаявкамDistri.Автомобиль,
			               |	Renault_ИнформацияПоЗаявкамDistri.ИдентификаторСтрокиДоговора,
			               |	Renault_ИнформацияПоЗаявкамDistri.НомерКлиентскойЗаявки,
			               |	Renault_ИнформацияПоЗаявкамDistri.ПродажаВнесена,
			               |	Renault_ИнформацияПоЗаявкамDistri.НомерОрдера,
			               |	Renault_ИнформацияПоЗаявкамDistri.Заявка
			               |ИЗ
			               |	РегистрСведений.Renault_ИнформацияПоЗаявкамDistri КАК Renault_ИнформацияПоЗаявкамDistri
			               |ГДЕ
			               |	Renault_ИнформацияПоЗаявкамDistri.ИдентификаторСтрокиДоговора = &ИдентификаторСтрокиДоговора";
			Запрос.УстановитьПараметр("ИдентификаторСтрокиДоговора", ИдентификаторСтрокиДоговора);
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				Запись = РегистрыСведений.Renault_ИнформацияПоЗаявкамDistri.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
				Запись.Автомобиль = Автомобиль;
				Запись.ИдентификаторСтрокиДоговора = ИдентификаторСтрокиДоговора;
				Запись.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Проверим на дубли заявок. Если есть, отказ.
	//Если Не Аннулирована И НЕ ПометкаУдаления Тогда
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ
	//	|	DMS_ЗаявкаНаАвтомобиль.Номер,
	//	|	DMS_ЗаявкаНаАвтомобиль.НомерDMS,
	//	|	DMS_ЗаявкаНаАвтомобиль.Дата
	//	|ИЗ
	//	|	Документ.DMS_ЗаявкаНаАвтомобиль КАК DMS_ЗаявкаНаАвтомобиль
	//	|ГДЕ
	//	|	DMS_ЗаявкаНаАвтомобиль.Ссылка <> &Ссылка
	//	|	И DMS_ЗаявкаНаАвтомобиль.VIN = &VIN
	//	|	И НЕ DMS_ЗаявкаНаАвтомобиль.ПометкаУдаления
	//	|	И НЕ DMS_ЗаявкаНаАвтомобиль.Аннулирована";
	//	
	//	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	//	Запрос.УстановитьПараметр("VIN",VIN);
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	ЕстьДубли = Ложь;
	//	Пока Выборка.Следующий() цикл
	//		Сообщить("Существует заявка на автомобиль № "+Выборка.Номер+", DMS ("+Выборка.НомерDMS+") от "+Формат(Выборка.Дата,"ДФ=dd.MM.yyyy"));		
	//		ЕстьДубли 	= Истина;
	//		Отказ 		= Истина;
	//	КонецЦикла;
	//	Если ЕстьДубли тогда
	//		Сообщить("Необходимо аннулировать другие заявки.");
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры
