

Процедура СнятиеРезервов(Параметры = Неопределено) Экспорт 
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	ЗаказыПокупателейОстатки.Заказ,
	//|	ЗаказыПокупателейОстатки.Заказ.Дата КАК Дата,
	//|	ЗаказыПокупателейОстатки.Заказ.Контрагент КАК Контрагент
	//|ИЗ
	//|	РегистрНакопления.ЗаказыПокупателей.Остатки(&Дата, ) КАК ЗаказыПокупателейОстатки
	//|ГДЕ
	//|	ЗаказыПокупателейОстатки.Заказ ССЫЛКА Документ.ЗаявкаНаРемонт";
	//
	//Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	//
	//Заявки =  Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Заказ");
	
	//Результат = Запрос.Выполнить().Выбрать();
	
	
	
	//Пока Результат.Следующий() цикл
	Запрос = Новый запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	ЗаказыПокупателейОстатки.Заказ,
	//			   |	ЗаказыПокупателейОстатки.Заказ.Дата КАК Дата,
	//			   |	ЗаказыПокупателейОстатки.Заказ.Контрагент КАК Контрагент
	//			   |ПОМЕСТИТЬ ЗаявкиОстатки
	//			   |ИЗ
	//			   |	РегистрНакопления.ЗаказыПокупателей.Остатки(&Дата, ) КАК ЗаказыПокупателейОстатки
	//			   |ГДЕ
	//			   |	ЗаказыПокупателейОстатки.Заказ ССЫЛКА Документ.ЗаявкаНаРемонт
	//			   |;
	//			   |
	//			   |////////////////////////////////////////////////////////////////////////////////
	//			   |ВЫБРАТЬ
	//			   |	ЗаказНаряд.ДокументОснование КАК Заказ
	//			   |ПОМЕСТИТЬ ЗНСЗаказами
	//			   |ИЗ
	//			   |	Документ.ЗаказНаряд КАК ЗаказНаряд
	//			   |ГДЕ
	//			   |	ЗаказНаряд.Дата <= &ДатаПроверки
	//			   |	И ЗаказНаряд.ДокументОснование В
	//			   |			(ВЫБРАТЬ
	//			   |				ЗаявкиОстатки.Заказ
	//			   |			ИЗ
	//			   |				ЗаявкиОстатки КАК ЗаявкиОстатки)
	//			   |;
	//			   |
	//			   |////////////////////////////////////////////////////////////////////////////////
	//			   |ВЫБРАТЬ
	//			   |	ЗаявкиОстатки.Заказ
	//			   |ИЗ
	//			   |	ЗаявкиОстатки КАК ЗаявкиОстатки
	//			   |ГДЕ
	//			   |	НЕ ЗаявкиОстатки.Заказ В
	//			   |				(ВЫБРАТЬ
	//			   |					ЗНСЗаказами.Заказ
	//			   |				ИЗ
	//			   |					ЗНСЗаказами КАК ЗНСЗаказами)
	//			   |	И ЗаявкиОстатки.Заказ.ДатаНачала <= &ДатаПРоверки
	//			   |
	//			   |УПОРЯДОЧИТЬ ПО
	//			   |	ЗаявкиОстатки.Заказ.Дата";
	//Запрос.УстановитьПараметр("ДатаПроверки",ТекущаяДата());
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗаказыПокупателейОстатки.Заказ,
		               |	ЗаказыПокупателейОстатки.Заказ.Дата КАК Дата,
		               |	ЗаказыПокупателейОстатки.Заказ.Контрагент КАК Контрагент,
		               |	ЗаказыПокупателейОстатки.Заказ.ДатаНачала КАК ДатаНачала
		               |ИЗ
		               |	РегистрНакопления.ЗаказыПокупателей.Остатки(&Дата, ) КАК ЗаказыПокупателейОстатки
		               |ГДЕ
		               |	ЗаказыПокупателейОстатки.Заказ ССЫЛКА Документ.ЗаявкаНаРемонт";

	Запрос.УстановитьПараметр("Дата",ТекущаяДата());

	//Запрос.УстановитьПараметр("Дата2",Результат.Заказ.ДатаОкончания+5400);
	//Запрос.УстановитьПараметр("ЗаявкиЗаказы",Заявки);
	//Запрос.УстановитьПараметр("Заказчик",Результат.Заказ.Заказчик);
	
	
	
	РезультатЗН = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗН.Следующий() цикл
		Если РезультатЗН.ДатаНачала <=ТекущаяДата() тогда
		ДокументСнятие = Документы.СнятиеРезервовЗаказовПокупателя.СоздатьДокумент();
		ДокументСнятие.Заполнить(РезультатЗН.Заказ);
		Если ДокументСнятие.Товары.Количество() = 0 тогда
			Продолжить;
		КонецЕсли;	
		ДокументСнятие.Контрагент =   РезультатЗН.Заказ.Заказчик;
		ДокументСнятие.КорректировкаЗаказа = Истина;
		Попытка
			ДокументСнятие.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
						#Если Клиент Тогда

			Сообщить(ОписаниеОшибки());
				#КонецЕсли
              ДокументСнятие.Записать(РежимЗаписиДокумента.Запись);

		КонецПопытки;
		
		
		ДокументСнятие = Документы.КорректировкаЗаказаПокупателя.СоздатьДокумент();
		ДокументСнятие.Заполнить(РезультатЗН.Заказ);
		Если ДокументСнятие.Товары.Количество() = 0 тогда
			Продолжить;
		КонецЕсли;	
		ДокументСнятие.Контрагент =   РезультатЗН.Заказ.Заказчик;
		//ДокументСнятие.КорректировкаЗаказа = Истина;
		ДокументСнятие.ДокументОснование =  РезультатЗН.Заказ;
		
		Для Каждого стр из ДокументСнятие.Товары цикл
			 стр.Количество = 0;
			
		КонецЦикла;	
		Попытка
			ДокументСнятие.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
						#Если Клиент Тогда

			Сообщить(ОписаниеОшибки());
				#КонецЕсли
             	ДокументСнятие.Записать(РежимЗаписиДокумента.Запись);

		КонецПопытки;
        КонецЕсли;
	КонецЦикла;	
	
	//КонецЦикла;	
	
КонецПроцедуры

