
Перем DOWN_СоответствиеОбработок;
Перем UP_СоответствиеОбработок;
Перем СоответствиеВариантыПериода;
Перем ПутьКTDFa;
Перем КаталогОбменаФайлов;

Перем DOWN_WS_СоответствиеОбработок;
Перем UP_WS_СоответствиеОбработок;

Процедура ЗавершитьПринудительноПроцессы()
	
	ИмяВременногоФайла = КаталогВременныхФайлов() + "kill_java_cmd_proc.bat";
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст("TASKKILL /F /IM ""java.exe""" + Символы.ПС + "TASKKILL /F /IM ""cmd.exe""");
	
	ТекстовыйДокумент.Записать(ИмяВременногоФайла,КодировкаТекста.ANSI);
	ТекстовыйДокумент = Неопределено;
	
	WShell_1 = Новый COMОбъект("WScript.Shell");
	WShell_1.Run(ИмяВременногоФайла);
	
	УдалитьФайлы(ИмяВременногоФайла);
	
КонецПроцедуры

Процедура ЗапуститьЗаглушку(ВремяОграниченияСекунд)
	
	// Комментарий 
	//Дата создания - 14.12.2012 12:20:35; Автор - Окипний Андрей Евгеньевич
	//Принудительное завершение процесса Java вызывает падение сервиса A2A.
	//Процедура закомментированна полностью
	// 
	//ПутьКSleep = ПутьКTDFa + "BIN\Sleep";
	//
	//ИмяВременногоФайла = КаталогВременныхФайлов() + "sleep.bat";
	//
	//ТекстовыйДокумент = Новый ТекстовыйДокумент;
	//ТекстовыйДокумент.УстановитьТекст(ПутьКSleep + " " + ВремяОграниченияСекунд + Символы.ПС +
	//					"TASKKILL /F /IM ""java.exe""" + Символы.ПС + "TASKKILL /F /IM ""cmd.exe""");
	//
	//ТекстовыйДокумент.Записать(ИмяВременногоФайла,КодировкаТекста.ANSI);
	//ТекстовыйДокумент = Неопределено;

	//WShell_2 = Новый COMОбъект("WScript.Shell");
	//WShell_2.Run(ИмяВременногоФайла);
	
КонецПроцедуры

////@+ Процедура ВыполнениеЗадачи()
// Дата создания - 28.05.2012 10:27:36; 
// Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Процедура производит выполнение задачи TDFa по указанным настройкам
//
// Параметры
//  Без параметров
//@-
Процедура ВыполнениеЗадачи() Экспорт
	
	//По этой переменной будем запускать алгоритм проверки файлов в каталоге OUT.
	//Если там что нибудь осталось - выдаем ошибку.
	ЕстьОтправка = Ложь;
	
	//Получаем Объект задачи настроек
	ЗадачаОбъект = Задача.ПолучитьОбъект();
	
	Поток		 = Задача.Поток;
	Направление	 = Задача.Направление;
	Протокол	 = Задача.ПротоколОбмена;
	
	////$+ Комментарий 
	// Дата создания - 20.12.2012 16:51:28;
	// Автор - Окипний Андрей Евгеньевич
	// Для начала нужно сформировать файл статистики
	//
	//$-
	//
	
	ОбработкаСтатистики = Обработки.Renault_Статистика_WS.Создать();
	
	ВерсияDMS = СтрЗаменить(Прав(Метаданные.Синоним, 7),")","");
	ОбработкаСтатистики.ВерсияDMS = ВерсияDMS;
	
	BIR = Renault_ОбщийМодуль.ПолучитьBIRБазыДанных();
	//Renault_ОбщийМодуль.ПолучитьИдентификатор(ЗадачаОбъект.Организация);
	
	ОбработкаСтатистики.BIR = СокрЛП(BIR);
	ОбработкаСтатистики.Организация = ЗадачаОбъект.Организация;
	ОбработкаСтатистики.Поток = Задача.Поток;
	
	Попытка
		ОбработкаСтатистики.ОтправитьСтатистику();
	Исключение КонецПопытки;
	
	////$+ Комментарий ДатаCоздания - 30.05.2013 17:00:20, Автор - Окипний Андрей Евгеньевич
	//<xml version="1.0" encoding="UTF-8">
	//<Автодок>
	//<Комментарий ДатаCоздания="30.05.2013 17:00:20" Автор="Окипний Андрей Евгеньевич">
	//
	// С добавлением протоколов обмена (TDFa/Web сервис) процедура отправки данных изменена
	//
	//</Комментарий>
	//</Автодок>
	//</xml>
	//$-
	
	Если Протокол = "TDFa" тогда
		
		//В этих вариантах нужно для начала подготовить данные. а затем запускать поток TDFa
		Если Направление = Перечисления.Renault_НаправленияПотоковTDFa.Up
			ИЛИ Направление = Перечисления.Renault_НаправленияПотоковTDFa.Bidirectional тогда
			
			ОбработкаФормирования = UP_СоответствиеОбработок[Поток];
			
			//Если обработка не определена, тогда выгрузку пропускаем, 
			//а просто запускаем задачу TDFa
			Если НЕ ОбработкаФормирования = Неопределено тогда 
				
				ЕстьОтправка = Истина;
				ОбработкаОбъект = ОбработкаФормирования.Создать();
				
				ЗаписьЖурналаРегистрации("Задача обмена (Протокол TDFa)", УровеньЖурналаРегистрации.Информация,,,
				"Запущена обработка выгрузки данных: " + ОбработкаОбъект.Метаданные().Синоним);
				
				//=====================
				//Заполнение реквизитов
				Если НЕ ОбработкаОбъект.Метаданные().Реквизиты.Найти("Организация") = Неопределено тогда
					ОбработкаОбъект.Организация = Задача.Организация;
				КонецЕсли;
				
				Если НЕ ОбработкаОбъект.Метаданные().Реквизиты.Найти("ПутьКФайлу") = Неопределено тогда
					ОбработкаОбъект.ПутьКФайлу = КаталогОбменаФайлов + "out\";
				КонецЕсли;
				
				Параметры = Задача.Параметры;
				
				Для каждого Параметр из Параметры Цикл
					
					Реквизит = ОбработкаОбъект.метаданные().Реквизиты.Найти(Параметр.РеквизитОбработки);
					
					Если Реквизит <> Неопределено Тогда
						
						Значение = Параметр.Значение;
						Если НЕ Значение = Неопределено Тогда
							
							Если Реквизит.Тип = Новый ОписаниеТипов("СтандартныйПериод") тогда
								
								ОбработкаОбъект[Параметр.РеквизитОбработки].Вариант = СоответствиеВариантыПериода[Значение];
								
							Иначе
								
								ОбработкаОбъект[Параметр.РеквизитОбработки] = Значение;
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
				//Заполнение реквизитов
				//=====================
				
				ОбработкаОбъект.ОбработкаНаСервере();
				
			КонецЕсли;
			
		КонецЕсли;
		
		Сервер = СтрокаСоединенияИнформационнойБазы();
		ИдентификаторДилера = Renault_ОбщийМодуль.ПолучитьИдентификатор(Задача.Организация); 
		
		Если НЕ ЗначениеЗаполнено(ИдентификаторДилера) тогда
			
			Renault_Открытый.СообщитьПользователю("У организации""" + Задача.Организация.Наименование + """ не заполнено свойство ""Код дилера (BIR3M)""." + Символы.ПС +
			"Заполните соответствующее свойство и повторите выгрузку снова.");
			Возврат;
			
		КонецЕсли;
		//Раскомментировать при внедрении обмена через гейт
		Прокси = ПолучитьВебСервис();
		
		ФайлыКОтправке = Новый ТаблицаЗначений;
		ФайлыКОтправке.Колонки.Добавить("Имя");
		ФайлыКОтправке.Колонки.Добавить("Данные");
		ФайлыКОтправке.Колонки.Добавить("ПолныйПуть");
		
		ПутьКПапке = КаталогОбменаФайлов + "out\";
		МассивФайлов = НайтиФайлы(ПутьКПапке, "*.*");
		Для Каждого Файл Из МассивФайлов Цикл
			Если Файл.ЭтоФайл() Тогда
				Нов = ФайлыКОтправке.Добавить();
				Нов.Имя = Файл.Имя;
				Нов.ПолныйПуть = Файл.ПолноеИмя;
				Нов.Данные = Новый ДвоичныеДанные(Файл.ПолноеИмя);
			КонецЕсли;
		КонецЦикла;
		Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
		ПакетXDTO = Сериализатор.ЗаписатьXDTO(ФайлыКОтправке);
		Ответ = Прокси.Put(ПакетXDTO, ИдентификаторДилера, Сервер);
		
		Если Ответ Тогда
			Для Каждого СтрокаТЗ из ФайлыКОтправке Цикл
				Попытка
					УдалитьФайлы(СтрокаТЗ.ПолныйПуть);
				Исключение
					ЗаписьЖурналаРегистрации("Задача обмена (Протокол TDFa)", УровеньЖурналаРегистрации.Ошибка,,
					ЗадачаОбъект.Ссылка, ОписаниеОшибки());
					ВызватьИсключение;
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;
		
		ЗаписьЖурналаРегистрации("Задача обмена (Протокол TDFa)", УровеньЖурналаРегистрации.Информация , ,
		ЗадачаОбъект.Ссылка, "Отправка данных завершена");
		
	////КонецРаскоменторовать
	
	// Закомментироватьпри внедрении обмена через гейт
		////Теперь из объекта формируем батник
		//ИмяИсполняемогоФайла = ЗадачаОбъект.ПолучитьФайлЗапускаTDFa();
		//
		////Перед исполнением основной задачи нужно прервать запущенные процессы java.exe и cmd.exe
		////ЗавершитьПринудительноПроцессы();
		//
		//ЗаписьЖурналаРегистрации("Задача обмена (Протокол TDFa)", УровеньЖурналаРегистрации.Информация,,
		//ЗадачаОбъект.Ссылка, "Выполнение исполняемого файла - "+ИмяИсполняемогоФайла);
		////Запускаем батник
		////Так как на сервере КомандаСистемы не работает - делаем через "WScript.Shell"
		//
		//WShell = Новый COMОбъект("WScript.Shell");
		//РезультатВыполнения = WShell.Exec(ИмяИсполняемогоФайла);
		//
		////По прежнему пытаемся поймать по таймауту.
		//ВремяОграничения = ТекущаяДата() + 600;
		//ТекстРезультата = "";
		//
		//ЗаписьЖурналаРегистрации("Задача обмена (Протокол TDFa)", УровеньЖурналаРегистрации.Информация,,
		//ЗадачаОбъект.Ссылка, "Получение результата выполнения задачи");
		//
		//Счетчик = 1;
		//
		//Пока НЕ РезультатВыполнения.StdOut.AtEndOfStream() ИЛИ Счетчик > 900 Цикл
		//	
		//	ТекстРезультата = ТекстРезультата + РезультатВыполнения.StdOut.ReadLine() + Символы.ПС;
		//	Счетчик = Счетчик + 1;
		//	
		//	//Если выбрали лимит времени значит вываливаемся.
		//	Если ТекущаяДата() > ВремяОграничения Тогда
		//		ТекстСообщения = "Произошло аварийное завершение задачи TDFa. Часть данных выполнения TDFa:" + ТекстРезультата + Символы.ПС +
		//		"Прервите выполняемые процессы Java и CMD вручную. И проверьте работу A2A";
		//		
		//		//При аварийном завершении процессы остаются в памяти.
		//		//Просто обрываем выполнение
		//		WShell = неопределено;
		//		
		//		//Вызовем исключение
		//		ВызватьИсключение ТекстСообщения;
		//	КонецЕсли;
		//	
		//КонецЦикла;
		//
		//ЗаписьЖурналаРегистрации("Задача обмена (Протокол TDFa)", УровеньЖурналаРегистрации.Информация,,
		//ЗадачаОбъект.Ссылка, ТекстРезультата);
		
	//КонецЗакоментировать
		
		//Теперь нужно запустить обработку загруженных данных
		//В этих вариантах нужно для начала подготовить данные. а затем запускать поток TDFa
		Если Направление = Перечисления.Renault_НаправленияПотоковTDFa.Down
			ИЛИ Направление = Перечисления.Renault_НаправленияПотоковTDFa.Bidirectional тогда
			
			ОбработкаФормирования = DOWN_СоответствиеОбработок[Поток];
			
			//Если обработка не определена, тогда загрузку пропускаем, 
			//а просто запускаем задачу TDFa
			Если НЕ ОбработкаФормирования = Неопределено тогда 
				
				ОбработкаОбъект = ОбработкаФормирования.Создать();
				
				ЗаписьЖурналаРегистрации("Задача обмена (Протокол TDFa)", УровеньЖурналаРегистрации.Информация,,,
				"Запущена обработка Загрузки полученных данных: " + ОбработкаОбъект.Метаданные().Синоним);
				
				//=====================
				//Заполнение реквизитов
				Если НЕ ОбработкаОбъект.Метаданные().Реквизиты.Найти("Организация") = Неопределено тогда
					ОбработкаОбъект.Организация = Задача.Организация;
				КонецЕсли;
				
				Если НЕ ОбработкаОбъект.Метаданные().Реквизиты.Найти("ПутьКФайлу") = Неопределено тогда
					ОбработкаОбъект.ПутьКФайлу = КаталогОбменаФайлов + "in\";
				КонецЕсли;
				
				Параметры = Задача.Параметры;
				
				Для каждого Параметр из Параметры Цикл
					
					Реквизит = ОбработкаОбъект.метаданные().Реквизиты.Найти(Параметр.РеквизитОбработки);
					
					Если Реквизит <> Неопределено Тогда
						
						Значение = Параметр.Значение;
						Если НЕ Значение = Неопределено Тогда
							Если Реквизит.Тип = Новый ОписаниеТипов("СтандартныйПериод") тогда
								
								ОбработкаОбъект[Параметр.РеквизитОбработки].Вариант = СоответствиеВариантыПериода[Значение];
								
							Иначе
								
								ОбработкаОбъект[Параметр.РеквизитОбработки] = Значение;
								
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				//Заполнение реквизитов
				//=====================
				
				ОбработкаОбъект.ОбработкаНаСервере();
			КонецЕсли;
			
		КонецЕсли;
		
		// Комментарий 
		//Дата создания - 29.05.2012 10:43:35; Автор - Окипний Андрей Евгеньевич
		//После выполнения всех операций по отправке и получению проверим 
		//наличие не отправленных файлов
		//
		Если ЕстьОтправка тогда
			
			ПутьКФайлам = КаталогОбменаФайлов + "out\";
			
			НайденныеФайлы = НайтиФайлы(ПутьКФайлам, "*.*");
			
			Если НЕ НайденныеФайлы.Количество() = 0 тогда
				
				ВызватьИсключение ЗаписатьВЖурналРегистрации(УровеньЖурналаРегистрации.Информация,
				ЗадачаОбъект.Ссылка, "Отправка файлов не выполнена. Смотрите подробности в лог-файле TDFa." + Символы.ПС +
				КаталогОбменаФайлов+"\TDFUI.log");
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе //Web сервис
		
		Если Направление = Перечисления.Renault_НаправленияПотоковTDFa.Up
			или Направление = Перечисления.Renault_НаправленияПотоковTDFa.Bidirectional тогда
			
			ОбработкаФормирования = up_WS_СоответствиеОбработок[Поток];
			
			//Если обработка не определена, тогда загрузку пропускаем, 
			//а просто запускаем задачу TDFa
			Если НЕ ОбработкаФормирования = Неопределено тогда 
				
				ОбработкаОбъект = ОбработкаФормирования.Создать();
				
				ЗаписьЖурналаРегистрации("Задача обмена (Протокол Web сервис)", УровеньЖурналаРегистрации.Информация,,,
				"Запущена обработка выгрузки полученных данных: " + ОбработкаОбъект.Метаданные().Синоним);
				
				//=====================
				//Заполнение реквизитов
				Если НЕ ОбработкаОбъект.Метаданные().Реквизиты.Найти("Организация") = Неопределено тогда
					ОбработкаОбъект.Организация = Задача.Организация;
				КонецЕсли;
				
				Параметры = Задача.Параметры;
				
				Для каждого Параметр из Параметры Цикл
					
					Реквизит = ОбработкаОбъект.метаданные().Реквизиты.Найти(Параметр.РеквизитОбработки);
					
					Если Реквизит <> Неопределено Тогда
						
						Значение = Параметр.Значение;
						Если НЕ Значение = Неопределено Тогда
							Если Реквизит.Тип = Новый ОписаниеТипов("СтандартныйПериод") тогда
								
								ОбработкаОбъект[Параметр.РеквизитОбработки].Вариант = СоответствиеВариантыПериода[Значение];
								
							Иначе
								
								ОбработкаОбъект[Параметр.РеквизитОбработки] = Значение;
								
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
				КонецЦикла;
				
				//Заполнение реквизитов
				//=====================
				
				ОбработкаОбъект.ОбработкаНаСервере();
				ЗаписьЖурналаРегистрации("Задача обмена (Протокол Web сервис)", УровеньЖурналаРегистрации.Информация,,,
				"Выполнена выгрузка данных: " + ОбработкаОбъект.Метаданные().Синоним);
				
			КонецЕсли;
		КонецЕсли;
		
		Если Направление = Перечисления.Renault_НаправленияПотоковTDFa.Down
			ИЛИ Направление = Перечисления.Renault_НаправленияПотоковTDFa.Bidirectional тогда
			
			ОбработкаФормирования = DOWN_WS_СоответствиеОбработок[Поток];
			
			//Если обработка не определена, тогда загрузку пропускаем, 
			//а просто запускаем задачу TDFa
			Если НЕ ОбработкаФормирования = Неопределено тогда 
				
				ОбработкаОбъект = ОбработкаФормирования.Создать();
				
				ЗаписьЖурналаРегистрации("Задача обмена (Протокол Web сервис)", УровеньЖурналаРегистрации.Информация,,,
				"Запущена обработка Загрузки полученных данных: " + ОбработкаОбъект.Метаданные().Синоним);
				
				//=====================
				//Заполнение реквизитов
				Если НЕ ОбработкаОбъект.Метаданные().Реквизиты.Найти("Организация") = Неопределено тогда
					ОбработкаОбъект.Организация = Задача.Организация;
				КонецЕсли;
				
				Параметры = Задача.Параметры;
				
				Для каждого Параметр из Параметры Цикл
					
					Реквизит = ОбработкаОбъект.метаданные().Реквизиты.Найти(Параметр.РеквизитОбработки);
					
					Если Реквизит <> Неопределено Тогда
						
						Значение = Параметр.Значение;
						Если НЕ Значение = Неопределено Тогда
							Если Реквизит.Тип = Новый ОписаниеТипов("СтандартныйПериод") тогда
								
								ОбработкаОбъект[Параметр.РеквизитОбработки].Вариант = СоответствиеВариантыПериода[Значение];
								
							Иначе
								
								ОбработкаОбъект[Параметр.РеквизитОбработки] = Значение;
								
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
				КонецЦикла;
				
				//Заполнение реквизитов
				//=====================
				
				ОбработкаОбъект.ОбработкаНаСервере();
				ЗаписьЖурналаРегистрации("Задача обмена (Протокол Web сервис)", УровеньЖурналаРегистрации.Информация,,,
				"Выполнена загрузка данных: " + ОбработкаОбъект.Метаданные().Синоним);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ВыполнениеЗадачи()

Функция ПолучитьВебСервис() 
	
	Адрес = Константы.Renault_АдресWebСервисов.Получить() + "ws/";
	ЛогинWS = Константы.Renault_ЛогинВебСервиса.Получить();
	ПарольWS =Константы.Renault_ПарольВебСервиса.Получить();
	WSОпределение = Renault_ОбщегоНазначенияПовтИсп.ОпределениеTDFa(Адрес, ЛогинWS, ПарольWS);
	ВебСервис = Новый WSПрокси(
		WSОпределение, 
		"http://v8.1c.ru/8.1/data/core", 
		"Renault_TDFa", 
		"Renault_TDFaSoap12",
		3600);
	ВебСервис.Пользователь = СокрЛП(ЛогинWS);
	ВебСервис.Пароль = СокрЛП(ПарольWS);
	Возврат ВебСервис;
	
КонецФункции


////@+ Функция ЗаписатьВЖурналРегистрации(УровеньЖурнала, Задача, ТекстСообщения)
// Дата создания - 29.05.2012 10:56:08;
// Автор - Окипний Андрей Евгеньевич
//
// Описание функции
// Функция предназаначена для обмана команды ВызватьИсключение без использования директив
// "Попытка Исключение КонецПопытки" в эту команду нужно передавать функцию, результат которой 
// будет результатом исключения. 
// ЗаписьЖурналаРегистрации - процедура.
//
// Параметры
//  Парам1 УровеньЖурнала  - УровеньЖурналаРегистрации
//
//  Парам2 Задача  - ЗадачаTDFa.Ссылка - Ссылка на выполняемую задачу
//
//  Парам3 ТекстСообщения  - Строка(0) - Текст сообщения, который нужно записать в журнал регистрации
//                 <продолжение описания параметра>
//
// Возвращаемое значение
//  ТекстСообщения  - Строка(0) - Текст сообщения для оператора ВызватьИсключение
//
//@-
Функция ЗаписатьВЖурналРегистрации(УровеньЖурнала, Задача, ТекстСообщения) 
	
	ЗаписьЖурналаРегистрации("Задача обмена (Протокол TDFa)", УровеньЖурнала,,
					Задача, ТекстСообщения);
	
	Возврат ТекстСообщения;
	
КонецФункции // ЗаписатьВЖурналРегистрации(УровеньЖурнала, Задача, ТекстСообщения)

DOWN_СоответствиеОбработок = Новый Соответствие;

//Обработки по гарантии подключаем в попытке из-за разницы в версиях.
Попытка
	DOWN_СоответствиеОбработок.Вставить(Перечисления.Renault_ПотокиОбмена.GAREXP	, Обработки.EDR_ЧтениеGAREXP);
	DOWN_СоответствиеОбработок.Вставить(Перечисления.Renault_ПотокиОбмена.DIFF		, Обработки.EDR_ЧтениеDIFF);
Исключение КонецПопытки;

DOWN_СоответствиеОбработок.Вставить(Перечисления.Renault_ПотокиОбмена.OPERACOD		, Обработки.OPERACODE_ЗагрузкаНормировокВремениВыполненияРабот);
DOWN_СоответствиеОбработок.Вставить(Перечисления.Renault_ПотокиОбмена.SAPPR			, Обработки.Renault_SAPPR_ЧтениеCLAPPR62);
DOWN_СоответствиеОбработок.Вставить(Перечисления.Renault_ПотокиОбмена.TarrifPR		, Обработки.Renault_Tariff_PR_ЗагрузкаДанных);
DOWN_СоответствиеОбработок.Вставить(Перечисления.Renault_ПотокиОбмена.SEDRE			, Обработки.Renault_SEDRE);

DOWN_СоответствиеОбработок.Вставить(Перечисления.Renault_ПотокиОбмена.Автосклад	, Обработки.CRM_ЗагрузкаДанныхАвтоскладаЧерезWS);

UP_СоответствиеОбработок = Новый Соответствие;

//Обработки по гарантии подключаем в попытке из-за разницы в версиях.
//Попытка
//	//UP_СоответствиеОбработок.Вставить(Перечисления.Renault_ПотокиОбмена.EDR	, Обработки.EDR_ФормированиеФайла);
//Исключение КонецПопытки;

UP_СоответствиеОбработок.Вставить(Перечисления.Renault_ПотокиОбмена.SAPPR	, Обработки.Renault_SAPPR_ФормированиеCLAPPR44);

//Структура для заполнения параметров под WS.

//Web сервисы на стороне дилера только принимают данные.
DOWN_WS_СоответствиеОбработок = Новый Соответствие;
DOWN_WS_СоответствиеОбработок.Вставить(Перечисления.Renault_ПотокиОбмена.Новости, Обработки.Renault_РаботаСНовостямиДилеров);
DOWN_WS_СоответствиеОбработок.Вставить(Перечисления.Renault_ПотокиОбмена.Автосклад, Обработки.CRM_ЗагрузкаДанныхАвтоскладаЧерезWS);
DOWN_WS_СоответствиеОбработок.Вставить(Перечисления.Renault_ПотокиОбмена.НапоминанияПоСервису, Обработки.Renault_НапоминанияПоСервису);

//такой обработки нет в конфе... что за товарищ удалил? || Есть такая!
DOWN_WS_СоответствиеОбработок.Вставить(Перечисления.Renault_ПотокиОбмена.Реферанс, Обработки.Renault_ЗагрузкаРеферансовЧерезWS);

DOWN_WS_СоответствиеОбработок.Вставить(Перечисления.Renault_ПотокиОбмена.OPERACOD, Обработки.OPERACODE_ЗагрузкаРаботИзЦентраль);

//Web сервисы на стороне дилера только отправляют данные.
UP_WS_СоответствиеОбработок = Новый Соответствие;
UP_WS_СоответствиеОбработок.Вставить(Перечисления.Renault_ПотокиОбмена.EDR	, Обработки.EDR_ФормированиеФайла);
UP_WS_СоответствиеОбработок.Вставить(Перечисления.Renault_ПотокиОбмена.CRM, Обработки.Renault_ОбменДаннымиCRM);
UP_WS_СоответствиеОбработок.Вставить(Перечисления.Renault_ПотокиОбмена.ПроверкаРаботыСистемы, Обработки.Renault_ПроверкаРаботыCRM);
UP_WS_СоответствиеОбработок.Вставить(Перечисления.Renault_ПотокиОбмена.ДанныеВАФМ, Обработки.Renault_ОтправкаОперативныхДанныхВАФМ);
UP_WS_СоответствиеОбработок.Вставить(Перечисления.Renault_ПотокиОбмена.Renault_ОбновлениеРегистровАвтосервиса, Обработки.Renault_ОбновитьРегистрыАвтосервиса);
UP_WS_СоответствиеОбработок.Вставить(Перечисления.Renault_ПотокиОбмена.ЗаменаКлиентовНаКонтрагентов, Обработки.Renault_ЗаменаКлиентовНаКонтрагентов);
UP_WS_СоответствиеОбработок.Вставить(Перечисления.Renault_ПотокиОбмена.Автосервис_Планшет_НачалоРабочегоДня, Обработки.Renault_Автосервис_РегЗаданиеНачалоДня);
UP_WS_СоответствиеОбработок.Вставить(Перечисления.Renault_ПотокиОбмена.ОбменАвтосервис, Обработки.Renault_ОбменДаннымиАвтосервис);


СоответствиеВариантыПериода = Новый Соответствие;
Для Каждого Вариант из ВариантСтандартногоПериода Цикл
	Если Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод тогда продолжить КонецЕсли;
	СоответствиеВариантыПериода.Вставить(СтрЗаменить(ТРег(Строка(Вариант)), " ", ""), Вариант);
КонецЦикла;

ПутьКTDFa			 = Константы.Renault_Tdfa_КаталогПрограммы.Получить();
КаталогОбменаФайлов	 = ПутьКTDFa + "dcs-repository\";
