
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ЗакрыватьПриЗакрытииВладельца=Истина;
	Номенклатура=Параметры.Номенклатура;
	Склад=Параметры.Склад;
	Остаток=Параметры.Остаток;
	Количество = 1;
	Цена=Параметры.ЦенаПоУмолчанию;
	Скидка = 0;
	КонтрольОстатков=?(Параметры.Свойство("КонтрольОстатков"),Параметры.КонтрольОстатков,Ложь);
	Элементы.Количество.Доступность = Параметры.ЗапрашиватьКолво;
	Элементы.Цена.Доступность = Параметры.ЗапрашиватьЦену;
	Элементы.Скидка.Доступность = Параметры.ЗапрашиватьСкидку;
КонецПроцедуры


&НаКлиенте
Процедура ОК(Команда)
	Если КонтрольОстатков И Количество>Остаток Тогда
		ТекстОшибки="Количество превышает остаток, измените количество или отключите контроль остатков";
		Попытка
			Предупреждение(ТекстОшибки);
		Исключение
			Сообщить(ТекстОшибки);
		Конецпопытки;
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Закрыть(Новый Структура("Номенклатура,Склад,Количество,Цена,Скидка",
	Номенклатура,Склад,Количество,Цена,Скидка));
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	Если Количество>Остаток Тогда
		Элементы.Количество.ЦветФона = Новый Цвет(255,255,0);
	Иначе
		Элементы.Количество.ЦветФона = Новый Цвет(255,255,255);
	КонецЕсли;
КонецПроцедуры
