Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ПередУдалением()
	
	Записи = РегистрыСведений.Renault_АвтосервисПланРабот.СоздатьНаборЗаписей();
	Записи.Отбор.РабочийДокумент.Установить(ЭтотОбъект.Ссылка);
	
	Записи.Прочитать();
	Для Каждого Запись Из Записи Цикл
		Записи.Удалить(Запись);
	КонецЦикла;

	Записи.Записать();
	
	Записис = Неопределено;
	Записи = РегистрыСведений.Renault_АвтосервисСтатусыРабот.СоздатьНаборЗаписей();
	Записи.Отбор.РабочийДокумент.Установить(ЭтотОбъект.Ссылка);
	
	Записи.Прочитать();
	Для Каждого Запись Из Записи Цикл
		Записи.Удалить(Запись);
	КонецЦикла;

	Записи.Записать();

	
КонецПроцедуры