Перем ПараметрыИсточника Экспорт;
Перем Драйвер;
Перем ВремТаблицаСопоставления;

/////////////////////////////////////////
//Точка входа сервера

Процедура НайтиФайлыВКаталоге() Экспорт
	
	Если ЗначениеЗаполнено(ПутьКфайлу) тогда
		//Ищем файлы
		Фильтр = "*.TPR.*.*";
		ФайлыДанных = НайтиФайлы(ПутьКфайлу, Фильтр, Истина);
	КонецЕсли;
	
	//Заполняем табличную часть файлами.
	ФайлыКОбработке.Очистить();
	
	Для каждого ФайлДанных из ФайлыДанных Цикл
		
		НС = ФайлыКОбработке.Добавить();
		НС.ИмяФайла = ФайлДанных.ИмяБезРасширения;
		НС.ПутьКФайлу = ФайлДанных.ПолноеИмя;
		НС.ТипИсточника = НРег(СтрЗаменить(ФайлДанных.Расширение,".",""));
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаНаСервере() Экспорт
	
	НайтиФайлыВКаталоге();
	
	//На сервере обрабатываем все файлы
	Для каждого СтрокаТЗ из ФайлыКОбработке Цикл
		
		ПараметрыИсточника.Очистить();
		
		ПараметрыИсточника.Вставить("ТипИсточника", СтрокаТЗ.ТипИсточника);
		ПараметрыИсточника.Вставить("ПутьКИСточнику", СтрокаТЗ.ПутьКФайлу);
		ПараметрыИсточника.Вставить("ИмяБезРасширения",СтрокаТЗ.ИмяФайла);
		ПараметрыИсточника.Вставить("ДатаТекЗагрузки",НачалоДня(ТекущаяДата()));
		
		ПолучитьДанные();
		
	КонецЦикла;
	
	
	//Теперь нужно переименовать файлы
	Для каждого СтрокаТЗ из ФайлыКОбработке Цикл
		
		Попытка  //Переименование делаем в попытке, может не быть доступа
			
			ФайлОбъект = Новый Файл(СтрокаТЗ.ПутьКФайлу);
			
			ИмяБезРасширения = СтрЗаменить(ФайлОбъект.ИмяБезРасширения,".TPR.",".TP_.");
			Путь			 = ФайлОбъект.Путь;
			Расширение		 = ФайлОбъект.Расширение;
			
			ФайлОбъект = Неопределено;
			
			ПереместитьФайл(СтрокаТЗ.ПутьКФайлу, Путь+ИмяБезРасширения+Расширение);
			
		Исключение КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры

//Точка входа сервером
/////////////////////////////////////////

Процедура ПолучитьДанныеИзИсточника() Экспорт
	
	//Получим из параметров источника тип и определим драйвер
	Если ПараметрыИсточника["ТипИсточника"] = "mdb"тогда
		
		Драйвер = Обработки.Renault_Tariff_PR_Драйвер_mdb.Создать();
		Драйвер.ИсточникДанных = ПутьКФайлу;
		
	ИначеЕсли (Найти(ПараметрыИсточника["ИмяБезРасширения"], "TPR") <> 0) или ПараметрыИсточника["ТипИсточника"] = "csv" тогда
		
		Драйвер = Обработки.Renault_Tariff_PR_Драйвер_csv.Создать();
		Драйвер.ИсточникДанных = ПараметрыИсточника["ПутьКИСточнику"];
		
	Иначе
		
		Renault_Открытый.СообщитьПользователю("Драйвер для файлов типа """+ПараметрыИсточника["ТипИсточника"]+""" еще не реализован."+Символы.ПС
				+"Обратитесь в службу тех. поддержки http://support.renault.ru.");
		Возврат;
		
	КонецЕсли;
	
	// Комментарий 
	//Дата создания - 11.05.2012 10:29:47; Автор - Окипний Андрей Евгеньевич
	//Выставим состояние системы "Чтение данных из файла"
	// 
	Renault_Открытый.СостояниеДляПользователя("Чтение данных из файла " + ПутьКФайлу);
	
	
	Драйвер.УстановитьСоединение();
	
	Если Драйвер.СоединениеУстановлено тогда
		
		Драйвер.Таблица = Таблица;
		Драйвер.СчитатьДанные();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьДанные() Экспорт
	
	ПолучитьДанныеИЗИсточника();
	
	Если Драйвер.СоединениеУстановлено тогда
		
		//Делаем копию таблицы
		ВремТЗ = Таблица.Выгрузить();
		
		Период = Драйвер.ДатаЗагрузки;
		
		// Комментарий 
		//Дата создания - 12.05.2012 8:16:29; Автор - Окипний Андрей Евгеньевич
		//Для начала запишем данные в регистр временного хранения. Такое решение
		//обусловлено тем, что при попытке добавления в менеджер временных таблиц
		//таблицы, в которой больше 100 000 строк - система вылетает по нехветке памяти
		//
		РегистрыСведений.Renault_TariffPR_Номенклатура_Temp.ЗаписатьДанныеВРегистр(ВремТЗ);
		
		// Комментарий 
		//Дата создания - 12.05.2012 9:09:26; Автор - Окипний Андрей Евгеньевич
		//Таблица с данными нам более не нужна - удаляем
		//
		ВремТЗ = Неопределено;
		
		// Комментарий 
		//Дата создания - 12.04.2012 11:02:12; Автор - Окипний Андрей Евгеньевич
		//Для начала запишем данные в регистр актуальных цен. Затем эти данные передадим в регистр Истории
		//
		РегистрыСведений.Renault_TariffPR_Номенклатура.ЗаписатьДанныеВРегистр(Период);
		
		// Комментарий 
		//Дата создания - 12.05.2012 10:27:33; Автор - Окипний Андрей Евгеньевич
		//очищаем регистр временного хранения
		//
		РегистрыСведений.Renault_TariffPR_Номенклатура_Temp.ОчиститьРегистр();
		
		Драйвер.ЗакрытьСоединения();
		
	КонецЕсли;
	
	Драйвер = Неопределено;

КонецПроцедуры

ПараметрыИсточника = Новый Структура;
Драйвер = Неопределено;