&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	ОбновитьДеревоРегистрации(Ложь);
	//ПолучитьПравилаКонвертации();
	
	Эл=ОчередьИсходящихПакетов.Параметры.Элементы[0];
	Эл.Использование=Истина;
	Эл.Значение=Объект.Ссылка;
	
	Если Объект.ЭтотУзел Тогда
		Элементы.Группа1.Видимость=Ложь;
		Элементы.Производитель.Видимость=Ложь;
		Элементы.РегистрацияИзменений.Видимость=Ложь;
		Элементы.Активный.Видимость=Ложь;
		Элементы.кнВыполнитьВыгрузку.Видимость=Ложь;
	КонецЕсли;	
	
КонецПроцедуры

//Процедура ПолучитьПравилаКонвертации()
//	Для Каждого Эл Из Метаданные.ПланыОбмена.DMS_Consolidation.Макеты Цикл
//		Элементы.ПравилаОбмена.СписокВыбора.Добавить(Эл.Имя,Эл.Синоним)
//	КонецЦикла;	
//КонецПроцедуры	

Процедура ОбновитьДеревоРегистрации(Обновить=Истина)
	Если Не Обновить Тогда 
		РегистрацияИзменений.ПолучитьЭлементы().Очистить();
		РегистрацияИзменений.ПолучитьЭлементы().Добавить().Метаданные="Справочники";
		РегистрацияИзменений.ПолучитьЭлементы().Добавить().Метаданные="Документы";
		РегистрацияИзменений.ПолучитьЭлементы().Добавить().Метаданные="Регистры сведений";
		РегистрацияИзменений.ПолучитьЭлементы().Добавить().Метаданные="Регистры накоплений";
		РегистрацияИзменений.ПолучитьЭлементы().Добавить().Метаданные="Прочее";
	КонецЕсли;	
	
	Для Каждого ЭлОбмена Из Метаданные.ПланыОбмена.DMS_Consolidation.Состав Цикл
		Если Метаданные.Справочники.Содержит(ЭлОбмена.Метаданные) Тогда Родитель=РегистрацияИзменений.ПолучитьЭлементы()[0]
		ИначеЕсли Метаданные.Документы.Содержит(ЭлОбмена.Метаданные) Тогда Родитель=РегистрацияИзменений.ПолучитьЭлементы()[1]
		ИначеЕсли Метаданные.РегистрыСведений.Содержит(ЭлОбмена.Метаданные) Тогда Родитель=РегистрацияИзменений.ПолучитьЭлементы()[2]		
		ИначеЕсли Метаданные.РегистрыНакопления.Содержит(ЭлОбмена.Метаданные) Тогда Родитель=РегистрацияИзменений.ПолучитьЭлементы()[3]		
		Иначе Родитель=РегистрацияИзменений.ПолучитьЭлементы()[4]
		КонецЕсли;	
		
		ИмяМД=ЭлОбмена.Метаданные.ПолноеИмя();
		Если Обновить Тогда
			Для Каждого Эл Из Родитель.ПолучитьЭлементы() Цикл
				Если Эл.ИмяМД=ИмяМД Тогда
					Стр=Эл; Прервать
				КонецЕсли;	
			КонецЦикла;	
		Иначе
			Стр=Родитель.ПолучитьЭлементы().Добавить();
			Стр.Метаданные=?(ЭлОбмена.Метаданные.Синоним="",ЭлОбмена.Метаданные.Имя,ЭлОбмена.Метаданные.Синоним);
			Стр.ИмяМД=ИмяМД;
		КонецЕсли;
		
		Стр.Количество=КоличествоОбъектов(ЭлОбмена.Метаданные.ПолноеИмя());
	КонецЦикла;	
КонецПроцедуры

Функция КоличествоОбъектов(ИмяМД)
	Запрос=Новый Запрос("Выбрать Количество(*) КолВо Из "+ИмяМД+".Изменения ГДЕ Узел=&Узел");
	Запрос.УстановитьПараметр("Узел",Объект.Ссылка);
	Выборка=Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.КолВо
КонецФункции

Процедура Зарегистрировать(ИмяМД) ПланыОбмена.ЗарегистрироватьИзменения(Объект.Ссылка,Метаданные.НайтиПоПолномуИмени(ИмяМД)) КонецПроцедуры	
Процедура УдалитьРегистрацию(ИмяМД) ПланыОбмена.УдалитьРегистрациюИзменений(Объект.Ссылка,Метаданные.НайтиПоПолномуИмени(ИмяМД)) КонецПроцедуры	

&НаКлиенте
Процедура кнЗарегистрироватьИзменения(Команда)
	Для Н=0 По РегистрацияИзменений.ПолучитьЭлементы().Количество()-1 Цикл
		Для Каждого Эл Из РегистрацияИзменений.ПолучитьЭлементы()[Н].ПолучитьЭлементы() Цикл
			Если Эл.Вкл Тогда Зарегистрировать(Эл.ИмяМД) КонецЕсли
		КонецЦикла;	
	КонецЦикла;	
	ОбновитьДеревоРегистрации()
КонецПроцедуры

&НаКлиенте
Процедура кнУдалитьРегистрациюИзменений(Команда)
	Для Н=0 По РегистрацияИзменений.ПолучитьЭлементы().Количество()-1 Цикл
		Для Каждого Эл Из РегистрацияИзменений.ПолучитьЭлементы()[Н].ПолучитьЭлементы() Цикл
			Если Эл.Вкл Тогда УдалитьРегистрацию(Эл.ИмяМД) КонецЕсли
		КонецЦикла;	
	КонецЦикла;	
	ОбновитьДеревоРегистрации()
КонецПроцедуры

&НаКлиенте
Процедура кнОбновить(Команда) ОбновитьДеревоРегистрации() КонецПроцедуры

&НаКлиенте
Процедура РегистрацияИзмененийВклПриИзменении(Элемент)
	Если Элементы.РегистрацияИзменений.ТекущиеДанные.Метаданные="Справочники" Тогда
		Для Каждого Эл Из РегистрацияИзменений.ПолучитьЭлементы()[0].ПолучитьЭлементы() Цикл
			Эл.Вкл=РегистрацияИзменений.ПолучитьЭлементы()[0].Вкл;
		КонецЦикла;	
	ИначеЕсли Элементы.РегистрацияИзменений.ТекущиеДанные.Метаданные="Документы" Тогда
		Для Каждого Эл Из РегистрацияИзменений.ПолучитьЭлементы()[1].ПолучитьЭлементы() Цикл
			Эл.Вкл=РегистрацияИзменений.ПолучитьЭлементы()[1].Вкл;
		КонецЦикла;	
	ИначеЕсли Элементы.РегистрацияИзменений.ТекущиеДанные.Метаданные="Регистры сведений" Тогда
		Для Каждого Эл Из РегистрацияИзменений.ПолучитьЭлементы()[2].ПолучитьЭлементы() Цикл
			Эл.Вкл=РегистрацияИзменений.ПолучитьЭлементы()[2].Вкл;
		КонецЦикла;	
	ИначеЕсли Элементы.РегистрацияИзменений.ТекущиеДанные.Метаданные="Регистры накоплений" Тогда
		Для Каждого Эл Из РегистрацияИзменений.ПолучитьЭлементы()[3].ПолучитьЭлементы() Цикл
			Эл.Вкл=РегистрацияИзменений.ПолучитьЭлементы()[3].Вкл;
		КонецЦикла;	
	ИначеЕсли Элементы.РегистрацияИзменений.ТекущиеДанные.Метаданные="Прочее" Тогда
		Для Каждого Эл Из РегистрацияИзменений.ПолучитьЭлементы()[4].ПолучитьЭлементы() Цикл
			Эл.Вкл=РегистрацияИзменений.ПолучитьЭлементы()[4].Вкл;
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура кнВыполнитьВыгрузку(Команда)
	//Парам=Новый Структура("Сервис,ПравилаКонвертации",Элементы.СервисыОбменаДанными.ТекущиеДанные.Сервис,Элементы.СервисыОбменаДанными.ТекущиеДанные.ПравилаКонвертации);
	//Если ВыполнитьВыгрузку(Парам) Тогда
	//	Сообщить("Выгрузка выполнена успешно"+Символы.ПС+ПолучитьОписаниеПакета(Парам));	
	//Иначе
	//	Сообщить("Во время выгрузки произошли ошибки"+Символы.ПС+ПолучитьОписаниеПакета(Парам));	
	//КонецЕсли;
	Сообщить(?(ВыполнитьВыгрузку(Элементы.СервисыОбменаДанными.ТекущиеДанные.ПравилоКонвертации),"Выгрузка выполнена успешно","Во время выгрузки произошли ошибки"));
	ОбновитьДеревоРегистрации();
КонецПроцедуры
Функция ВыполнитьВыгрузку(ПравилоКонвертации) Возврат DMS_DataExchange_ПланОбмена.ВыгрузитьПакет(Объект.Ссылка,ПравилоКонвертации,Истина) 
	//Ошибка=Ложь;
	//Для Каждого Эл Из Объект.СервисыОбменаДанными.НайтиСтроки(Новый Структура("Активный",Истина)) Цикл
	//	Если НЕ DMS_DataExchange_ПланОбмена.ВыгрузитьПакет(Объект.Ссылка,Эл.ПравилоКонвертации,Истина) Тогда
	//		Ошибка=Истина	
	//	КонецЕсли;	
	//КонецЦикла;
	//Возврат Не Ошибка
КонецФункции

//Функция ПолучитьОписаниеПакета(Парам)
//	Запрос=Новый Запрос("Выбрать Описание Из ВнешнийИсточникДанных.DMS_Queue.Таблица.Пакеты ГДЕ BIR=&BIR И ПравилаКонвертации=&ПравилаКонвертации И Сервис=&Сервис");
//	Запрос.УстановитьПараметр("BIR",Объект.Ссылка.Код);
//	Запрос.УстановитьПараметр("ПравилаКонвертации",Парам.ПравилаКонвертации);
//	Запрос.УстановитьПараметр("Сервис",Парам.Сервис);
//	Выборка=Запрос.Выполнить().Выбрать();
//	Выборка.Следующий();
//	Возврат Выборка.Описание
//КонецФункции	

&НаКлиенте
Процедура кнСохранитьВФайл(Команда)
	#Если ВебКлиент Тогда
	Если не ПодключитьРасширениеРаботыСФайлами() Тогда  //если подключить не удалось - требуется установить его (в первый раз)
	  УстановитьРасширениеРаботыСФайлами();
	  //если не удалось установить - то повторный вызов подключения будет неудачный
	  Если не ПодключитьРасширениеРаботыСФайлами() Тогда ВызватьИсключение "Ошибка. Ваш браузер не поддерживает работу с файлами :(" КонецЕсли 
	КонецЕсли;
	#КонецЕсли
	ДиалогОткрытияФайла=Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогОткрытияФайла.МножественныйВыбор=Ложь;
	
	м=Новый Массив;
	м.Добавить(Новый ОписаниеПередаваемогоФайла(,ПолучитьАдрес(Элементы.ОчередьИсходящихПакетов.ТекущаяСтрока)));
	НачатьПолучениеФайлов(Новый ОписаниеОповещения("СохранитьНаДиск", ЭтаФорма),м, ДиалогОткрытияФайла, Истина);
	
КонецПроцедуры
Функция ПолучитьАдрес(КлючЗаписи)
	Запрос=Новый Запрос("Выбрать Данные Из РегистрСведений.DMS_ОчередьИсходящихПакетов ГДЕ Узел=&Узел И Дата=&Дата");
	Запрос.УстановитьПараметр("Узел",КлючЗаписи.Узел);
	Запрос.УстановитьПараметр("Дата",КлючЗаписи.Дата);
	Выборка=Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат ПоместитьВоВременноеХранилище(Выборка.Данные.Получить())
КонецФункции	

&НаКлиенте
Процедура СохранитьНаДиск(ПолученныеФайлы,ИмяФайлаСервер) Экспорт КонецПроцедуры
