
&НаСервере
Процедура ОтметитьВсеНаСервере()
	
	Для Каждого Строкас из ТаблицаИзменений Цикл
		
		Строкас.ИзменятьЦену = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	ОтметитьВсеНаСервере();
КонецПроцедуры

&НаСервере
Процедура СнятьОтметкиНаСервере()
	
	Для Каждого Строкас из ТаблицаИзменений Цикл
		
		Строкас.ИзменятьЦену = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)
	СнятьОтметкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТаблицаИзменений") Тогда
		
		Для Каждого Строка Из Параметры["ТаблицаИзменений"] Цикл
			
			НоваяСтрока = ТаблицаИзменений.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
			НоваяСтрока.ИзменятьЦену = Истина;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ДатаОткрытияЗаказНаряда") Тогда
		
		ДатаОткрытияЗаказНаряда = Параметры["ДатаОткрытияЗаказНаряда"];
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура OK(Команда)
	
	Закрыть(ТаблицаИзменений);
	
КонецПроцедуры
