Процедура ЗаписатьКонстанты() Экспорт
	
	Константы.Renault_Tdfa_КаталогПрограммы.Установить(ПутьКTDFa);
	
	Константы.Renault_ИспользоватьПроксиCерверTDFa.Установить(ИспользоватьПроксиCерверTDFa);
	Константы.Renault_ПроксиСерверTDFa.Установить(АдресПроксисервера);
	Константы.Renault_ЛогинПроксиСервераTDFa.Установить(ЛогинПроксиСервераTDFa);
	Константы.Renault_ПарольПроксисервераTDFa.Установить(ПарольПроксисервераTDFa);
	Константы.Renault_ПортПроксиСервераTDFa.Установить(ПортПрокси);
	
КонецПроцедуры

//Получаем значения констант
ПутьКTDFa					 = Константы.Renault_Tdfa_КаталогПрограммы.Получить();

//Прокси -сервер
ИспользоватьПроксиCерверTDFa = Константы.Renault_ИспользоватьПроксиCерверTDFa.Получить();
АдресПроксисервера			 = Константы.Renault_ПроксиСерверTDFa.Получить();
ПортПрокси					 = Константы.Renault_ПортПроксиСервераTDFa.Получить();
ЛогинПроксиСервераTDFa		 = Константы.Renault_ЛогинПроксиСервераTDFa.Получить();
ПарольПроксисервераTDFa		 = Константы.Renault_ПарольПроксисервераTDFa.Получить();
