
&НаСервере
Процедура УстановитьВидОплатыНаСервере(Значение, Параметры) Экспорт
	
	ДокСсылка = Элементы.Список.ТекущаяСтрока;
	Если ЗначениеЗаполнено(ДокСсылка) И Значение <> Неопределено Тогда
		ДокОбъект = ДокСсылка.ПолучитьОбъект();
		ДокОбъект.DMS_ВидОплатыКузовной = Значение;
		ДокОбъект.Записать();
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидОплаты(Команда)
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		Оповещение = Новый ОписаниеОповещения("УстановитьВидОплатыНаСервере", ЭтаФорма);
		ПоказатьВводЗначения(Оповещение, ВидОплаты, "Выберите вид оплаты");
	КонецЕсли;
	
КонецПроцедуры
