
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КоличествоКлиентов.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.КоличествоКлиентов");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
	ОтборЭлемента.ПравоеЗначение = 1;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", ">1");
	
КонецПроцедуры // УстановитьУсловноеОформление()

&НаКлиенте
Процедура ЗаполнитьПрофили(Команда)
	
	ЗаполнитьПрофилиНаСервере();
	Состояние("Заполнение родственных связей");
	ЗаполнитьРодствоВПрофиляхНаСервере();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПрофилиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	НЕ Контрагенты.ЭтоГруппа
		|	И Контрагенты.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЧастноеЛицо)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКонтрагентов = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаКонтрагентов.Следующий() Цикл
		Справочники.Renault_ПрофилиКлиентов.СоздатьИзменитьПрофильКонтрагента(ВыборкаКонтрагентов.Ссылка);
		Справочники.Renault_ПрофилиКлиентов.ЗаполнитьРодственников(ВыборкаКонтрагентов.Ссылка);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	CRM_ПотенциальныеКонтрагенты.Ссылка 
		|ИЗ
		|	Справочник.CRM_ПотенциальныеКонтрагенты КАК CRM_ПотенциальныеКонтрагенты
		|ГДЕ
		|	НЕ CRM_ПотенциальныеКонтрагенты.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПотенциальныхКонтрагентов = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаПотенциальныхКонтрагентов.Следующий() Цикл
		Справочники.Renault_ПрофилиКлиентов.СоздатьИзменитьПрофильПотенциальногоКонтрагента(ВыборкаПотенциальныхКонтрагентов.Ссылка);
		Справочники.Renault_ПрофилиКлиентов.ЗаполнитьРодственников(ВыборкаПотенциальныхКонтрагентов.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьРодствоВПрофиляхНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	НЕ Контрагенты.ЭтоГруппа
		|	И Контрагенты.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЧастноеЛицо)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКонтрагентов = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаКонтрагентов.Следующий() Цикл
		Справочники.Renault_ПрофилиКлиентов.ЗаполнитьРодственников(ВыборкаКонтрагентов.Ссылка);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	CRM_ПотенциальныеКонтрагенты.Ссылка 
		|ИЗ
		|	Справочник.CRM_ПотенциальныеКонтрагенты КАК CRM_ПотенциальныеКонтрагенты
		|ГДЕ
		|	НЕ CRM_ПотенциальныеКонтрагенты.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПотенциальныхКонтрагентов = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаПотенциальныхКонтрагентов.Следующий() Цикл
		Справочники.Renault_ПрофилиКлиентов.ЗаполнитьРодственников(ВыборкаПотенциальныхКонтрагентов.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПоВидуКонтактнойИнформации()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(НормализованныеКонтактыДляПоиска.Объект КАК Справочник.CRM_ПотенциальныеКонтрагенты) КАК Объект,
		|	НормализованныеКонтактыДляПоиска.Данные
		|ПОМЕСТИТЬ ДанныеКлиента
		|ИЗ
		|	РегистрСведений.Renault_НормализованныеКонтактыДляПоиска КАК НормализованныеКонтактыДляПоиска
		|ГДЕ
		|	НормализованныеКонтактыДляПоиска.Объект ССЫЛКА Справочник.CRM_ПотенциальныеКонтрагенты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(НормализованныеКонтактыДляПоиска.Объект КАК Справочник.Контрагенты),
		|	НормализованныеКонтактыДляПоиска.Данные
		|ИЗ
		|	РегистрСведений.Renault_НормализованныеКонтактыДляПоиска КАК НормализованныеКонтактыДляПоиска
		|ГДЕ
		|	НормализованныеКонтактыДляПоиска.Объект ССЫЛКА Справочник.Контрагенты
		|			И ВЫРАЗИТЬ(НормализованныеКонтактыДляПоиска.Объект КАК Справочник.Контрагенты).ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЧастноеЛицо)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДанныеДляПоиска.Объект КАК КлиентПрофиля,
		|	ДанныеКлиента.Объект КАК Клиент,
		|	ИСТИНА КАК СовпадениеПоКонтактнойИнформации
		|ПОМЕСТИТЬ ДанныеПрофилия
		|ИЗ
		|	ДанныеКлиента КАК ДанныеКлиента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеКлиента КАК ДанныеДляПоиска
		|		ПО (ДанныеКлиента.Данные ПОДОБНО ""%"" + ДанныеДляПоиска.Данные + ""%"")
		|			И ДанныеКлиента.Объект <> ДанныеДляПоиска.Объект
		|			И (ДанныеДляПоиска.Данные <> """")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеФизическихЛиц.ФИО КАК ФИО,
		|	ДанныеПрофилия.КлиентПрофиля,
		|	ДанныеПрофилия.Клиент,
		|	ДанныеПрофилия.СовпадениеПоКонтактнойИнформации,
		|	ДанныеФизическихЛиц.Фамилия,
		|	ДанныеФизическихЛиц.Имя,
		|	ДанныеФизическихЛиц.Отчество
		|ИЗ
		|	ДанныеПрофилия КАК ДанныеПрофилия
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|		ПО ДанныеПрофилия.КлиентПрофиля = ДанныеФизическихЛиц.ФизическоеЛицо";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПрофильКлиента = ПолучитьПрофильКлиента(ВыборкаДетальныеЗаписи.КлиентПрофиля); 
		
		Если Не ЗначениеЗаполнено(ПрофильКлиента) Тогда
			ПрофильКлиента = ПолучитьПрофильКлиента(ВыборкаДетальныеЗаписи.Клиент); 
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(ПрофильКлиента) Тогда
			
			ПрофильОбъект = ПрофильКлиента.ПолучитьОбъект();
			
			Если ПрофильОбъект.Клиенты.Найти(ВыборкаДетальныеЗаписи.КлиентПрофиля,"Клиент") = Неопределено Тогда
				НоваяСтрока = ПрофильОбъект.Клиенты.Добавить();
				НоваяСтрока.Клиент = ВыборкаДетальныеЗаписи.КлиентПрофиля;
			КонецЕсли;
			
			Если ПрофильОбъект.Клиенты.Найти(ВыборкаДетальныеЗаписи.Клиент,"Клиент") = Неопределено Тогда
				НоваяСтрока = ПрофильОбъект.Клиенты.Добавить();
				НоваяСтрока.Клиент = ВыборкаДетальныеЗаписи.Клиент;
			КонецЕсли;
			
			ПрофильОбъект.КоличествоКлиентов = ПрофильОбъект.Клиенты.Количество();
			
			ПрофильОбъект.Записать();
			
		Иначе 
			
			ПрофильОбъект = Справочники.Renault_ПрофилиКлиентов.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(ПрофильОбъект,ВыборкаДетальныеЗаписи);
			
			НоваяСтрока = ПрофильОбъект.Клиенты.Добавить();
			НоваяСтрока.Клиент = ВыборкаДетальныеЗаписи.КлиентПрофиля;
			
			НоваяСтрока = ПрофильОбъект.Клиенты.Добавить();
			НоваяСтрока.Клиент = ВыборкаДетальныеЗаписи.Клиент;
			
			ПрофильОбъект.КоличествоКлиентов = ПрофильОбъект.Клиенты.Количество();
			
			ПрофильОбъект.Записать();
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПоВидуКонтактнойИнформации()

&НаСервереБезКонтекста
Функция ПолучитьПрофильКлиента(Клиент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Клиенты.Ссылка
		|ИЗ
		|	Справочник.Renault_ПрофилиКлиентов.Клиенты КАК Клиенты
		|ГДЕ
		|	Клиенты.Клиент = &Клиент
		|	И Клиенты.Ссылка.СовпадениеПоКонтактнойИнформации";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Профиль = Справочники.Renault_ПрофилиКлиентов.ПустаяСсылка();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Профиль = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Профиль;
	
КонецФункции // ПолучитьПрофильКлиента()

&НаСервереБезКонтекста
Процедура ЗаполнитьПоФИОиДатеРожения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Контрагенты.Ссылка КАК ФизЛицо,
		|	Контрагенты.ДатаРождения КАК ДатаРождения
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЧастноеЛицо)
		|	И Контрагенты.Наименование <> """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПотенциальныеКонтрагенты.Ссылка,
		|	ПотенциальныеКонтрагенты.ДатаРождения
		|ИЗ
		|	Справочник.CRM_ПотенциальныеКонтрагенты КАК ПотенциальныеКонтрагенты
		|ГДЕ
		|	ПотенциальныеКонтрагенты.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЧастноеЛицо)
		|	И ПотенциальныеКонтрагенты.Наименование <> """"";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаФизЛиц = РезультатЗапроса.Выбрать();
		
	Пока ВыборкаФизЛиц.Следующий() Цикл
		
		DMS_ФизическиеЛицаСервер.ЗаполнитьПрофильКлиентаПоФИО(ВыборкаФизЛиц.ФизЛицо);
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПоФИОиДатеРожения()


