
&НаСервереБезКонтекста
Процедура ЗаполнитьНаСервере()
	
	Справочники.DMS_ИнструкцииПоВыдачеАвто.ЗагрузитьИнструкции();

КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры


&НаСервере
Функция ПечатьНаСервере(Ссылка)

	Возврат Справочники.DMS_ИнструкцииПоВыдачеАвто.Печать(Ссылка);
	
КонецФункции


&НаКлиенте
Процедура Печать(Команда)
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		 ТабДок = ПечатьНаСервере(Элементы.Список.ТекущаяСтрока);
		 ТабДок.Показать();
	КонецЕсли;
КонецПроцедуры


//Козлов Е.А. Начало 13.07.2016
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отказ = НЕ Renault_РаботаСПравамиПользователя.ЕстьПравоНаРаботуСоСлужебнымиФункциямиRenault();
КонецПроцедуры
//Козлов Е.А. Конец
