
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//1 Получим все сервисы, их планы и количества рабочих дней; сотрудников (в т.ч. подчиненных подразделений), 
	//количества их рабочих дней и вид первого дня месяца 
	Запрос = Новый Запрос;     
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	СервисыПодразделения.Подразделение КАК Подразделение,
	|	СМГ_План_Выработки_Сотрудников_По_СервисамПланы_Сервисов.Сервис КАК Сервис,
	|	СМГ_План_Выработки_Сотрудников_По_СервисамПланы_Сервисов.План КАК План
	|ПОМЕСТИТЬ ВТ_Док
	|ИЗ
	|	Документ.СМГ_План_Выработки_Сотрудников_По_Сервисам.Планы_Сервисов КАК СМГ_План_Выработки_Сотрудников_По_СервисамПланы_Сервисов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сервисы.Подразделения КАК СервисыПодразделения
	|		ПО СМГ_План_Выработки_Сотрудников_По_СервисамПланы_Сервисов.Сервис = СервисыПодразделения.Ссылка
	|ГДЕ
	|	СМГ_План_Выработки_Сотрудников_По_СервисамПланы_Сервисов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	ВТ_Док.Сервис КАК Сервис,
	|	ВТ_Док.План КАК План
	|ПОМЕСТИТЬ ВТ_Сотрудники
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Док КАК ВТ_Док
	|		ПО (ВЫБОР
	|				КОГДА Сотрудники.Подразделение = ВТ_Док.Подразделение
	|					ТОГДА Сотрудники.Подразделение
	|				ИНАЧЕ Сотрудники.Подразделение.Родитель
	|			КОНЕЦ = ВТ_Док.Подразделение)
	|ГДЕ
	|	НЕ Сотрудники.ПометкаУдаления
	|	И НЕ Сотрудники.ФлагУволен
	|	И Сотрудники.Должность = &Должность
	|	И Сотрудники.ДатаПриема <= &НачалоМесяца
	|	И Сотрудники.Подразделение В ИЕРАРХИИ
	|			(ВЫБРАТЬ
	|				ВТ_Док.Подразделение КАК Ссылка
	|			ИЗ
	|				ВТ_Док КАК ВТ_Док)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сотрудники.Сотрудник КАК Сотрудник,
	|	ВТ_Сотрудники.Сервис КАК Сервис,
	|	ВТ_Сотрудники.План КАК План,
	|	КОЛИЧЕСТВО(ГрафикРаботКалендарный.Дата) КАК КоличествоРД
	|ПОМЕСТИТЬ ВТ_РДКалендарь
	|ИЗ
	|	ВТ_Сотрудники КАК ВТ_Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикРаботКалендарный КАК ГрафикРаботКалендарный
	|		ПО ВТ_Сотрудники.Сотрудник.ГрафикРаботы = ГрафикРаботКалендарный.График
	|ГДЕ
	|	ГрафикРаботКалендарный.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И ГрафикРаботКалендарный.ВидДня = &ВидДня
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Сотрудники.Сотрудник,
	|	ВТ_Сотрудники.Сервис,
	|	ВТ_Сотрудники.План
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РДКалендарь.Сотрудник КАК Сотрудник,
	|	ВТ_РДКалендарь.Сервис КАК Сервис,
	|	ГрафикРаботКалендарный.ВидДня КАК ВидДня
	|ПОМЕСТИТЬ ВТ_ВидДня
	|ИЗ
	|	ВТ_РДКалендарь КАК ВТ_РДКалендарь
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикРаботКалендарный КАК ГрафикРаботКалендарный
	|		ПО ВТ_РДКалендарь.Сотрудник.ГрафикРаботы = ГрафикРаботКалендарный.График
	|ГДЕ
	|	ГрафикРаботКалендарный.Дата = &Началомесяца
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сотрудники.Сотрудник КАК Сотрудник,
	|	ВТ_Сотрудники.Сервис КАК Сервис,
	|	ЕСТЬNULL(ВТ_РДКалендарь.КоличествоРД, ДЕНЬ(&КонецМесяца)) КАК КоличествоРД,
	|	ЕСТЬNULL(ВТ_ВидДня.ВидДня, ЗНАЧЕНИЕ(Перечисление.ВидДня.Рабочий)) КАК ВидДня,
	|	ВТ_Сотрудники.План КАК План
	|ПОМЕСТИТЬ ВТ_ВидКолРДСотрудники
	|ИЗ
	|	ВТ_Сотрудники КАК ВТ_Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РДКалендарь КАК ВТ_РДКалендарь
	|		ПО ВТ_Сотрудники.Сотрудник = ВТ_РДКалендарь.Сотрудник
	|			И ВТ_Сотрудники.Сервис = ВТ_РДКалендарь.Сервис
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВидДня КАК ВТ_ВидДня
	|		ПО ВТ_Сотрудники.Сотрудник = ВТ_ВидДня.Сотрудник
	|			И ВТ_Сотрудники.Сервис = ВТ_ВидДня.Сервис
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВидКолРДСотрудники.Сервис КАК Сервис,
	|	ВТ_ВидКолРДСотрудники.План КАК План,
	|	СУММА(ВТ_ВидКолРДСотрудники.КоличествоРД) КАК КоличествоРД
	|ПОМЕСТИТЬ ВТ_КолРДСервисы
	|ИЗ
	|	ВТ_ВидКолРДСотрудники КАК ВТ_ВидКолРДСотрудники
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВидКолРДСотрудники.Сервис,
	|	ВТ_ВидКолРДСотрудники.План
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВидКолРДСотрудники.Сотрудник КАК Сотрудник,
	|	ВТ_КолРДСервисы.Сервис КАК Сервис,
	|	ВТ_ВидКолРДСотрудники.КоличествоРД КАК КоличествоРД,
	|	ВЫБОР
	|		КОГДА ВТ_ВидКолРДСотрудники.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидДня.Рабочий)
	|			ТОГДА ВТ_КолРДСервисы.План / ВТ_КолРДСервисы.КоличествоРД
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИндивидуальныйПлан
	|ИЗ
	|	ВТ_ВидКолРДСотрудники КАК ВТ_ВидКолРДСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КолРДСервисы КАК ВТ_КолРДСервисы
	|		ПО ВТ_ВидКолРДСотрудники.Сервис = ВТ_КолРДСервисы.Сервис";	
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	Запрос.УстановитьПараметр("Должность", Справочники.Должности.МастерПриемщик);
	Запрос.УстановитьПараметр("НачалоМесяца", ДатаНачалаМесяца);
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(ДатаНачалаМесяца));
	Запрос.УстановитьПараметр("ВидДня", Перечисления.ВидДня.Рабочий);	
	                                                                               
	ВыгрузкаДанных = Запрос.Выполнить().Выгрузить();  
	
	//2 Обходим сотрудников, создаем записи в регистр на начало месяца	
	Набор_Записей_Планы = РегистрыСведений.СМГ_РабочиеДниМастеровПриемщиков.СоздатьНаборЗаписей(); 
	//Набор_Записей_Планы.Отбор.Период.Установить(ДатаНачалаМесяца);  
	//Набор_Записей_Планы.ОбменДанными.Загрузка = Ложь;
	
	Для Каждого Строка Из ВыгрузкаДанных Цикл
		Новая_Запись 					   = Набор_Записей_Планы.Добавить();
		Новая_Запись.Период    			   = ДатаНачалаМесяца;
		Новая_Запись.Сервис    			   = Строка.Сервис; 
		Новая_Запись.Сотрудник 			   = Строка.Сотрудник;
		Новая_Запись.КоличествоРабочихДней = Строка.КоличествоРД;
		Новая_Запись.ИндивидуальныйПлан    = Строка.ИндивидуальныйПлан;	
	КонецЦикла;	
	
	Попытка
		Набор_Записей_Планы.Записать();
	Исключение
		Сообщить("ОШИБКА! В указанном месяце уже установлен план по сервисам.", СтатусСообщения.ОченьВажное); 
		Возврат;
	КонецПопытки;	

КонецПроцедуры