
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьПредставителяПоУмолчанию() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
		|	DMS_Представители.Ссылка
		|ИЗ
		|	Справочник.DMS_Представители КАК DMS_Представители
		|ГДЕ
		|	НЕ DMS_Представители.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Представитель = Справочники.DMS_Представители.ПустаяСсылка();
	
	Если ВыборкаДетальныеЗаписи.Следующий() И ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
		Представитель = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли; 
	
	Возврат Представитель;
	
КонецФункции // ПолучитьПредставителяПоУмолчанию()
	
#КонецЕсли
