Перем Права Экспорт;

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Если Статус = Перечисления.DMS_СтатусЗаменыКарт.НаОзнакомлении Тогда
	
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение
			И Проведен Тогда
		
			РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
			
		ИначеЕсли  РежимЗаписи = РежимЗаписиДокумента.Проведение
			И Не Проведен Тогда
		
			РежимЗаписи = РежимЗаписиДокумента.Запись;
			
		КонецЕсли; 
	
	КонецЕсли; 
	
КонецПроцедуры  

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Статус = Перечисления.DMS_СтатусЗаменыКарт.НаОзнакомлении;
	Ответственный = ПараметрыСеанса.Пользователь;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Статус = Перечисления.DMS_СтатусЗаменыКарт.НаОзнакомлении;
	Ответственный = ПараметрыСеанса.Пользователь;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КартыПокупателей.Ссылка.Дата КАК Период,
		|	КартыПокупателей.Ссылка КАК Регистратор,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	КартыПокупателей.КартаПриемник КАК КартаЛояльности,
		|	КартыПокупателей.КартаПриемник.ПрограммаЛояльности КАК ПрограммаЛояльности,
		|	КартыПокупателей.Ссылка.Контрагент КАК Контрагент,
		|	КартыПокупателей.КартаПриемник.ДилерскийЦентр КАК ДилерскийЦентр,
		|	КартыПокупателей.Номинал КАК Начислено,
		|	0 КАК КСписанию,
		|	КартыПокупателей.Ссылка.ВидОперации КАК ВидОперации
		|ИЗ
		|	Документ.DMS_ЗаменаКартЛояльности.КартыПокупателей КАК КартыПокупателей
		|ГДЕ
		|	КартыПокупателей.Ссылка = &Ссылка
		|	И КартыПокупателей.Ссылка.ВидОперации = ЗНАЧЕНИЕ(перечисление.DMS_ВидыОперацийКартЛояльности.ЗаменаДисконтнойКарты)
		|	И КартыПокупателей.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.DMS_СтатусЗаменыКарт.Согласован)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КартыПокупателей.ПогаситьДо,
		|	КартыПокупателей.Ссылка,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	КартыПокупателей.КартаПриемник,
		|	КартыПокупателей.КартаПриемник.ПрограммаЛояльности,
		|	КартыПокупателей.Ссылка.Контрагент,
		|	КартыПокупателей.КартаПриемник.ДилерскийЦентр,
		|	0,
		|	КартыПокупателей.Номинал,
		|	КартыПокупателей.Ссылка.ВидОперации
		|ИЗ
		|	Документ.DMS_ЗаменаКартЛояльности.КартыПокупателей КАК КартыПокупателей
		|ГДЕ
		|	КартыПокупателей.Ссылка = &Ссылка
		|	И КартыПокупателей.Ссылка.ВидОперации = ЗНАЧЕНИЕ(перечисление.DMS_ВидыОперацийКартЛояльности.ЗаменаДисконтнойКарты)
		|	И КартыПокупателей.ПогаситьДо <> ДАТАВРЕМЯ(1, 1, 1)
		|	И КартыПокупателей.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.DMS_СтатусЗаменыКарт.Согласован)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КартыПокупателей.Ссылка.Дата,
		|	КартыПокупателей.Ссылка,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	КартыПокупателей.КартаПриемник,
		|	КартыПокупателей.КартаПриемник.ПрограммаЛояльности,
		|	КартыПокупателей.Ссылка.Контрагент,
		|	КартыПокупателей.КартаПриемник.ДилерскийЦентр,
		|	КартыПокупателей.Номинал,
		|	0,
		|	КартыПокупателей.Ссылка.ВидОперации
		|ИЗ
		|	Документ.DMS_ЗаменаКартЛояльности.КартыПокупателей КАК КартыПокупателей
		|ГДЕ
		|	КартыПокупателей.Ссылка = &Ссылка
		|	И (КартыПокупателей.Ссылка.ВидОперации = ЗНАЧЕНИЕ(перечисление.DMS_ВидыОперацийКартЛояльности.ЗаменаБонуснойКарты)
		|			ИЛИ КартыПокупателей.Ссылка.ВидОперации = ЗНАЧЕНИЕ(перечисление.DMS_ВидыОперацийКартЛояльности.ЗаменаКартыПриУтери))
		|	И КартыПокупателей.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.DMS_СтатусЗаменыКарт.Согласован)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КартыПокупателей.ПогаситьДо,
		|	КартыПокупателей.Ссылка,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	КартыПокупателей.КартаПриемник,
		|	КартыПокупателей.КартаПриемник.ПрограммаЛояльности,
		|	КартыПокупателей.Ссылка.Контрагент,
		|	КартыПокупателей.КартаПриемник.ДилерскийЦентр,
		|	0,
		|	КартыПокупателей.Номинал,
		|	КартыПокупателей.Ссылка.ВидОперации
		|ИЗ
		|	Документ.DMS_ЗаменаКартЛояльности.КартыПокупателей КАК КартыПокупателей
		|ГДЕ
		|	КартыПокупателей.Ссылка = &Ссылка
		|	И (КартыПокупателей.Ссылка.ВидОперации = ЗНАЧЕНИЕ(перечисление.DMS_ВидыОперацийКартЛояльности.ЗаменаБонуснойКарты)
		|			ИЛИ КартыПокупателей.Ссылка.ВидОперации = ЗНАЧЕНИЕ(перечисление.DMS_ВидыОперацийКартЛояльности.ЗаменаКартыПриУтери))
		|	И КартыПокупателей.ПогаситьДо <> ДАТАВРЕМЯ(1, 1, 1)
		|	И КартыПокупателей.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.DMS_СтатусЗаменыКарт.Согласован)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КартыПокупателей.Ссылка.Дата,
		|	КартыПокупателей.Ссылка,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	КартыПокупателей.КартаИсточник,
		|	КартыПокупателей.КартаИсточник.ПрограммаЛояльности,
		|	КартыПокупателей.Ссылка.Контрагент,
		|	КартыПокупателей.КартаИсточник.ДилерскийЦентр,
		|	КартыПокупателей.Номинал,
		|	0,
		|	КартыПокупателей.Ссылка.ВидОперации
		|ИЗ
		|	Документ.DMS_ЗаменаКартЛояльности.КартыПокупателей КАК КартыПокупателей
		|ГДЕ
		|	КартыПокупателей.Ссылка = &Ссылка
		|	И (КартыПокупателей.Ссылка.ВидОперации = ЗНАЧЕНИЕ(перечисление.DMS_ВидыОперацийКартЛояльности.ЗаменаБонуснойКарты)
		|			ИЛИ КартыПокупателей.Ссылка.ВидОперации = ЗНАЧЕНИЕ(перечисление.DMS_ВидыОперацийКартЛояльности.ЗаменаКартыПриУтери))
		|	И КартыПокупателей.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.DMS_СтатусЗаменыКарт.Согласован)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КартыПокупателей.Ссылка.Дата,
		|	КартыПокупателей.Ссылка,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	КартыПокупателей.КартаИсточник,
		|	КартыПокупателей.КартаИсточник.ПрограммаЛояльности,
		|	КартыПокупателей.Ссылка.Контрагент,
		|	КартыПокупателей.КартаИсточник.ДилерскийЦентр,
		|	0,
		|	КартыПокупателей.Номинал,
		|	КартыПокупателей.Ссылка.ВидОперации
		|ИЗ
		|	Документ.DMS_ЗаменаКартЛояльности.КартыПокупателей КАК КартыПокупателей
		|ГДЕ
		|	КартыПокупателей.Ссылка = &Ссылка
		|	И (КартыПокупателей.Ссылка.ВидОперации = ЗНАЧЕНИЕ(перечисление.DMS_ВидыОперацийКартЛояльности.ЗаменаБонуснойКарты)
		|			ИЛИ КартыПокупателей.Ссылка.ВидОперации = ЗНАЧЕНИЕ(перечисление.DMS_ВидыОперацийКартЛояльности.ЗаменаКартыПриУтери))
		|	И КартыПокупателей.ПогаситьДо <> ДАТАВРЕМЯ(1, 1, 1)
		|	И КартыПокупателей.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.DMS_СтатусЗаменыКарт.Согласован)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КартыПокупателей.Ссылка.Дата КАК Период,
		|	КартыПокупателей.Ссылка КАК Регистратор,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	КартыПокупателей.КартаПриемник КАК КартаЛояльности,
		|	КартыПокупателей.Номинал КАК КоличествоБаллов,
		|	КартыПокупателей.ПогаситьДо КАК ПогаситьДо
		|ИЗ
		|	Документ.DMS_ЗаменаКартЛояльности.КартыПокупателей КАК КартыПокупателей
		|ГДЕ
		|	КартыПокупателей.Ссылка = &Ссылка
		|	И КартыПокупателей.Ссылка.ВидОперации = ЗНАЧЕНИЕ(перечисление.DMS_ВидыОперацийКартЛояльности.ЗаменаДисконтнойКарты)
		|	И КартыПокупателей.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.DMS_СтатусЗаменыКарт.Согласован)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КартыПокупателей.Ссылка.Дата,
		|	КартыПокупателей.Ссылка,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	КартыПокупателей.КартаПриемник,
		|	КартыПокупателей.Номинал,
		|	КартыПокупателей.ПогаситьДо
		|ИЗ
		|	Документ.DMS_ЗаменаКартЛояльности.КартыПокупателей КАК КартыПокупателей
		|ГДЕ
		|	КартыПокупателей.Ссылка = &Ссылка
		|	И (КартыПокупателей.Ссылка.ВидОперации = ЗНАЧЕНИЕ(перечисление.DMS_ВидыОперацийКартЛояльности.ЗаменаБонуснойКарты)
		|			ИЛИ КартыПокупателей.Ссылка.ВидОперации = ЗНАЧЕНИЕ(перечисление.DMS_ВидыОперацийКартЛояльности.ЗаменаКартыПриУтери))
		|	И КартыПокупателей.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.DMS_СтатусЗаменыКарт.Согласован)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КартыПокупателей.Ссылка.Дата,
		|	КартыПокупателей.Ссылка,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	КартыПокупателей.КартаИсточник,
		|	КартыПокупателей.Номинал,
		|	КартыПокупателей.ПогаситьДо
		|ИЗ
		|	Документ.DMS_ЗаменаКартЛояльности.КартыПокупателей КАК КартыПокупателей
		|ГДЕ
		|	КартыПокупателей.Ссылка = &Ссылка
		|	И (КартыПокупателей.Ссылка.ВидОперации = ЗНАЧЕНИЕ(перечисление.DMS_ВидыОперацийКартЛояльности.ЗаменаБонуснойКарты)
		|			ИЛИ КартыПокупателей.Ссылка.ВидОперации = ЗНАЧЕНИЕ(перечисление.DMS_ВидыОперацийКартЛояльности.ЗаменаКартыПриУтери))
		|	И КартыПокупателей.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.DMS_СтатусЗаменыКарт.Согласован)";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Движения.DMS_БонусныеБаллы.Записывать 	  = Истина;
	Движения.Renault_ОстаткиБаллов.Записывать = Истина;
	
	Движения.DMS_БонусныеБаллы.Загрузить(РезультатЗапроса[0].Выгрузить());	
	Движения.Renault_ОстаткиБаллов.Загрузить(РезультатЗапроса[1].Выгрузить());	
	
КонецПроцедуры

// Процедура удаляет из массива МассивРеквизитов элементы, соответствующие именам 
// реквизитов объекта из массива МассивНепроверяемыхРеквизитов.
// Для использования в обработчиках события ОбработкаПроверкиЗаполнения.
//
// Параметры:
//	МассивРеквизитов              - Массив - массив строк с именами реквизитов объекта.
//	МассивНепроверяемыхРеквизитов - Массив строк с именами реквизитов объекта, не требующих проверки.
//
Процедура УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов) Экспорт
	
	Для Каждого ЭлементМассива Из МассивНепроверяемыхРеквизитов Цикл
	
		ПорядковыйНомер = МассивРеквизитов.Найти(ЭлементМассива);
		Если ПорядковыйНомер <> Неопределено Тогда
			МассивРеквизитов.Удалить(ПорядковыйНомер);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
