
////#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = ПараметрыСеанса.Пользователь;
	ОрганизацияОтбор    = ПараметрыСеанса.Организация;
	
	Период.Вариант = ВариантСтандартногоПериода.ЭтаНеделя;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтказатьВОткрытии()
	
	Предупреждение("У вас нет прав на открытие АРМ"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ Renault_РаботаСПравамиПользователя.ЕстьПравоНаОткрытиеАРМГарантия(ПараметрыСеанса.Пользователь) тогда
		//обПраво("РазрешитьРаботуСАРММенеджера", ЭтаФорма.ЭтотОбъект.Права) Тогда		
		ОтказатьВОткрытии();
		
		Отказ = Истина;
		Возврат;		
	КонецЕсли;
	
	ЗаполнитьПараметрыДинамическогоСписка();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВыбранноеЗначение = "ОбновитьСписок" Тогда
		Элементы.СписокЗаказов.Обновить();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписок"
		И Параметр = ПараметрыСеанса.Пользователь Тогда
		Элементы.СписокЗаказов.Обновить();
	КонецЕсли; 
	
КонецПроцедуры

////#КонецОбласти

////#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ЗаполнитьПараметрыДинамическогоСписка();	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОтборПриИзменении(Элемент)
	ЗаполнитьПараметрыДинамическогоСписка();	
КонецПроцедуры

////#КонецОбласти

////#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьЗаказНаряд(Команда)
	
	ТекущаяСтрока = Элементы.СписокЗаказов.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура("ЗаказНаряд,СемействоАвтомобиля,ГотовностьКОтправке,ЛКМ,OTS,ПовторнаяОтправка,Отправлен,ПробегАвтомобиля,ДатаОткрытия,РангАвторабот,ДатаЗакрытия,Автомобиль");
	ЗаполнитьЗначенияСвойств(ПараметрыФормы,ТекущаяСтрока);
	
	ОткрытьФорму("Обработка.EDR_АРМПоГарантииNew.Форма.ФормаЗаказНаряда",ПараметрыФормы,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыгрузку(Команда)
	ВыполнитьВыгрузкуНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьГрафическоеПредставление(Команда)
	
	ПолучитьДеревоЗаказНарядовДляОтправки(ПолучитьМассивЗаказов());
	
	ТекКлюч = Строка(Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy"));
	
	ФормаПечати = ПолучитьФорму("ОбщаяФорма.ПечатнаяФормаДокументов",,ЭтаФорма);
	
	ФормаПечати.ОбъектПредставление = "Структура распределения счетов и инцидентов по Заказ-Нарядам";
	ФормаПечати.ЭлементыФормы.ТабличныйДокумент.Вывести(ТабличныйДокумент);
	ФормаПечати.Открыть();
	
КонецПроцедуры

////#КонецОбласти

////#Область ОбработчикиСобытийЭлементовДинамическогоСпискаФормыСписокЗаказов

&НаКлиенте
Процедура СписокЗаказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура("ЗаказНаряд,СемействоАвтомобиля,ГотовностьКОтправке,ЛКМ,OTS,ПовторнаяОтправка,Отправлен,ПробегАвтомобиля,ДатаОткрытия,РангАвторабот,ДатаЗакрытия,Автомобиль");
	ЗаполнитьЗначенияСвойств(ПараметрыФормы,ТекущаяСтрока);
	
	ОткрытьФорму("Обработка.EDR_АРМПоГарантииNew.Форма.ФормаЗаказНаряда",ПараметрыФормы,ЭтаФорма);
	
КонецПроцедуры

////#КонецОбласти

////#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПараметрыДинамическогоСписка()
	
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("Организация",	ОрганизацияОтбор);	
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("ДатаНачала",	Период.ДатаНачала);	
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",Период.ДатаОкончания);	
	
КонецПроцедуры // ЗаполнитьПараметрыДинамическогоСписка()

&НаСервере
Процедура ВыполнитьВыгрузкуНаСервере()
	
	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(Неопределено);
	ФоновыеЗадания.Выполнить("DMS_ВыгрузкаEDRСервер.ВыгрузкиEDR", ПараметрыЗадания,,"Синхронизация гарантийных заявок Renault");
	
	//Обработка = Обработки.EDR_ФормированиеФайла.Создать();
	//Обработка.Организация	 = ОрганизацияОтбор;
	//Обработка.ВОперКОд9 	 = Ложь;
	//Обработка.Перевыгружать	 = Ложь;
	//Обработка.Период.Вариант = ВариантСтандартногоПериода.Сегодня;
	//Обработка.СформироватьФайлEDR();
	
КонецПроцедуры // ВыполнитьВыгрузкуНаСервере()

&НаСервере
Функция ПолучитьМассивЗаказов()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = СписокЗаказов.ТекстЗапроса;
	
	Для каждого ПараметрЗапроса Из СписокЗаказов.Параметры.Элементы Цикл
		Запрос.УстановитьПараметр(СокрЛП(ПараметрЗапроса.Параметр),ПараметрЗапроса.Значение);
	КонецЦикла; 
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	//Список = Элементы.СписокЗаказов;
	//
	//Схема 	  = Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	//Настройки = Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	//
	//КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	//МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема,Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	//
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	//
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	//Результат = Новый ТаблицаЗначений;
	//ПроцессорВывода.УстановитьОбъект(Результат);
	//
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат Результат.ВыгрузитьКолонку("ЗаказНаряд");
	
КонецФункции // ПолучитьМассивЗаказов()

////#Область ГрафическоеОтображениеСтруктуры

&НаСервере
Функция ПолучитьДеревоЗаказНарядовДляОтправки(мСписокЗаказов) Экспорт
	
	Перем ТабТоваров;
	Перем ТабРабот;
	
	ТабличныйДокумент.Очистить();
	
	ДатаЗакрытияОТ = Период.ДатаНачала;
	ДатаЗакрытияПО = Период.ДатаОкончания;
	
	мОбъект = РеквизитФормыВЗначение("Объект");
	
	Макет = мОбъект.ПолучитьМакетПоИмени("ГрафическоеПредставление");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	EDR_ЗаказНаряды.ЗаказНаряд КАК Ссылка,
	|	EDR_ЗаказНаряды.ОтправленВСистему_GCM,
	|	EDR_ЗаказНаряды.OTS КАК OTS,
	|	EDR_ЗаказНаряды.Гарантия КАК Гарантия,
	|	EDR_Invoices.Invoice КАК Invoice,
	|	EDR_Invoices.ДатаИнвойса КАК ДатаИнвойса,
	|	EDR_Invoices.Категория КАК Категория,
	|	EDR_Interventions.Intervention КАК Intervention,
	|	EDR_СоответствияИнвойсов.Процент КАК Процент,
	|	EDR_Interventions.RC_code КАК RC_code,
	|	EDR_Interventions.Function_Code КАК Function_Code,
	|	EDR_Invoices.Expense_code КАК Expense_code,
	|	EDR_Interventions.OTS_number КАК OTS_number,
	|	EDR_Invoices.GUID КАК GUID_Инвойса,
	|	EDR_Interventions.GUID КАК GUID_События,
	|	EDR_ЗаказНаряды.ДатаОткрытия КАК ДатаОткрытия,
	|	EDR_ЗаказНаряды.ДатаЗакрытия КАК ДатаЗакрытия,
	|	EDR_ЗаказНаряды.РангАвторабот КАК РангАвторабот,
	|	EDR_ЗаказНаряды.ПробегАвтомобиля КАК ПробегАвтомобиля,
	|	EDR_Interventions.ОписаниеОперации,
	|	EDR_Interventions.ОписаниеЖалобы,
	|	EDR_Interventions.КомментарийОперации,
	|	EDR_Interventions.РезультатДиагностики
	|ИЗ
	|	РегистрСведений.EDR_ЗаказНаряды КАК EDR_ЗаказНаряды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.EDR_Invoices КАК EDR_Invoices
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.EDR_СоответствияИнвойсов КАК EDR_СоответствияИнвойсов
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.EDR_Interventions КАК EDR_Interventions
	|				ПО EDR_СоответствияИнвойсов.Intervention = EDR_Interventions.GUID
	|			ПО EDR_Invoices.ЗаказНаряд = EDR_СоответствияИнвойсов.ЗаказНаряд
	|				И EDR_Invoices.GUID = EDR_СоответствияИнвойсов.Invoice
	|		ПО EDR_ЗаказНаряды.ЗаказНаряд = EDR_Invoices.ЗаказНаряд
	|ГДЕ
	|	EDR_ЗаказНаряды.ЗаказНаряд.Организация = &Организация
	|	И EDR_ЗаказНаряды.ДатаЗакрытия МЕЖДУ &ДатаЗакрытияОТ И &ДатаЗакрытияПО
	|	И EDR_ЗаказНаряды.ЗаказНаряд В(&СписокЗаказов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Invoice,
	|	Intervention
	|ИТОГИ
	|	МАКСИМУМ(OTS),
	|	МАКСИМУМ(Гарантия),
	|	МАКСИМУМ(ДатаИнвойса),
	|	МАКСИМУМ(Категория),
	|	СУММА(Процент),
	|	МАКСИМУМ(RC_code),
	|	МАКСИМУМ(Function_Code),
	|	МАКСИМУМ(Expense_code),
	|	МАКСИМУМ(OTS_number),
	|	МАКСИМУМ(GUID_Инвойса),
	|	МАКСИМУМ(GUID_События),
	|	МАКСИМУМ(ДатаОткрытия),
	|	МАКСИМУМ(ДатаЗакрытия),
	|	МАКСИМУМ(РангАвторабот),
	|	МАКСИМУМ(ПробегАвтомобиля)
	|ПО
	|	Ссылка,
	|	Invoice";
	
	Запрос.УстановитьПараметр("ДатаЗакрытияОТ", ДатаЗакрытияОТ);
	Запрос.УстановитьПараметр("ДатаЗакрытияПО", ДатаЗакрытияПО);
	Запрос.УстановитьПараметр("Организация", 	ОрганизацияОтбор);
	Запрос.УстановитьПараметр("СписокЗаказов",  мСписокЗаказов);
	
	Результат = Запрос.Выполнить();
	
	ОбластьШапка	   = Макет.ПолучитьОбласть("ШапкаОтчета");
	ОбластьЗаказов	   = Макет.ПолучитьОбласть("СтрокаЗаказНаряд");
	ОбластьСчетов	   = Макет.ПолучитьОбласть("СтрокаИнвойс");
	ОбластьИнцидентов  = Макет.ПолучитьОбласть("СтрокаИнцидент");
	ОбластьОписание    = Макет.ПолучитьОбласть("СтрокаОписаниеОперации");
	ОбластьКомментарий = Макет.ПолучитьОбласть("СтрокаКомментарий");
	ОбластьЖалоба	   = Макет.ПолучитьОбласть("СтрокаЖалоба");
	ОбластьДиагностика = Макет.ПолучитьОбласть("СтрокаДиагностика");
	ОбластьРабот 	   = Макет.ПолучитьОбласть("СтрокаРабота");
	ОбластьДеталей	   = Макет.ПолучитьОбласть("СтрокаДеталь");
	
	ТабДок = ТабличныйДокумент;
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьШапка);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ВыборкаЗН = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЗН.Следующий() Цикл
		
		ЗН = Строка(ВыборкаЗН.Ссылка) + ". модель: " + ВыборкаЗН.Ссылка.Автомобиль.Модель + ", VIN: " + ВыборкаЗН.Ссылка.Автомобиль.VIN;
		ОбластьЗаказов.Параметры.СтрокаЗаказНаряд = ЗН;
		ОбластьЗаказов.Параметры.ЗаказНаряд = ВыборкаЗН.Ссылка;
		
		ТабДок.Вывести(ОбластьЗаказов, ВыборкаЗН.Уровень());
		
		ВыборкаСчет = ВыборкаЗН.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСчет.Следующий() Цикл
			Счет = "Счет № " + ВыборкаСчет.Invoice + " от "+Формат(ВыборкаСчет.ДатаИнвойса, "ДФ=dd.MM.yyyy") + ". Категория: " + ВыборкаСчет.Категория;
			ОбластьСчетов.Параметры.Инвойс = Счет;
			ТабДок.Вывести(ОбластьСчетов, ВыборкаСчет.Уровень());
			
			//Нужно получить работы
			ТабРабот = ПолучитьСписокРаботПоИнвойсу(ВыборкаСчет);
			
			//Нужно получить детали
			ТабТоваров = ПолучитьСписокТоваровПоИнвойсу(ВыборкаСчет);
			
			ВыборкаСобытия = ВыборкаСчет.Выбрать();
			
			Пока ВыборкаСобытия.Следующий() Цикл
				Инцидент = "Инцидент """ + ВыборкаСобытия.Intervention + """. Вид расходов: " + ?(ЗначениеЗаполнено(ВыборкаСобытия.Expense_code),ВыборкаСобытия.Expense_code, "0")
				+ " Функ. код: " + ВыборкаСобытия.Function_Code + " Процент: " + ВыборкаСобытия.Процент;
				ОбластьИнцидентов.Параметры.Инцидент = Инцидент;
				ТабДок.Вывести(ОбластьИнцидентов, ВыборкаСобытия.Уровень());
				
				//Описание операции
				//количество строк не ограниченно,
				Если ЗначениеЗаполнено(ВыборкаСобытия.ОписаниеОперации) тогда
					ТекстОписания = Строка(ВыборкаСобытия.ОписаниеОперации); // через преобразование в строку - для отвязки от Дерева Значений.
					ТекстОписания = СтрЗаменить(ТекстОписания, Символы.ПС, " ");
					ФорматированноеОписание = EDR_ОбщийМодуль.СформироватьТекстКомментария(ТекстОписания, 200);
					
					КоличествоСтрок = ФорматированноеОписание.КоличествоСтрок();
					Для Сч = 1 по КоличествоСтрок Цикл
						ТекОписание = ФорматированноеОписание.ПолучитьСтроку(Сч);
						Если НЕ ЗначениеЗаполнено(ТекОписание) тогда Продолжить; КонецЕсли;
						Описание = "Описание (" + Сч +"):";
						ОбластьОписание.Параметры.Описание = Описание;
						ОбластьОписание.Параметры.ТекстОписания = ТекОписание;
						ТабДок.Вывести(ОбластьОписание, ВыборкаСобытия.Уровень()+2);
					КонецЦикла;
				КонецЕсли;
				
				//Комментарии к операции
				//количество строк не ограниченно,
				Если ЗначениеЗаполнено(ВыборкаСобытия.КомментарийОперации) тогда
					ТекстКомментария = Строка(ВыборкаСобытия.КомментарийОперации); // через преобразование в строку - для отвязки от Дерева Значений.
					ТекстКомментария = СтрЗаменить(ТекстКомментария, Символы.ПС, " ");
					ФорматированныйКомментарий = EDR_ОбщийМодуль.СформироватьТекстКомментария(ТекстКомментария, 120);
					
					КоличествоСтрок = ФорматированныйКомментарий.КоличествоСтрок();
					Для Сч = 1 по КоличествоСтрок Цикл
						ТекКомм = ФорматированныйКомментарий.ПолучитьСтроку(Сч);
						Если НЕ ЗначениеЗаполнено(ТекКомм) тогда Продолжить; КонецЕсли;
						Комментарий = "Комментарий (" + Сч + "):";
						ОбластьКомментарий.Параметры.Комментарий = Комментарий;
						ОбластьКомментарий.Параметры.ТекстКомментария = ТекКомм;
						ТабДок.Вывести(ОбластьКомментарий, ВыборкаСобытия.Уровень()+2);
					КонецЦикла;
				КонецЕсли;
				
				////Теперь формируем строку 030 Жалоба клиента. она только одна, длина 80 символов
				Если ЗначениеЗаполнено(ВыборкаСобытия.ОписаниеЖалобы) тогда
					ОбластьЖалоба.Параметры.ТекстЖалобы = ВыборкаСобытия.ОписаниеЖалобы;
					ТабДок.Вывести(ОбластьЖалоба, ВыборкаСобытия.Уровень()+2);
				КонецЕсли;
				
				//Теперь Результат диагностики строка 040
				Если ЗначениеЗаполнено(ВыборкаСобытия.РезультатДиагностики) тогда
					ОбластьДиагностика.Параметры.ТекстДиагностики = ВыборкаСобытия.РезультатДиагностики;
					ТабДок.Вывести(ОбластьДиагностика, ВыборкаСобытия.Уровень()+2);
				КонецЕсли;
				
				//Подготовка таблиц с товарами и работами
				Отбор = Новый Структура("GUID_События",ВыборкаСобытия.GUID_События);
				РаботыСобытия = ТабРабот.Скопировать(Отбор);
				ТоварыСобытия = ТабТоваров.Скопировать(Отбор);
				
				Для каждого стрРабота из РаботыСобытия Цикл
					
					Работа = "Работа: " + стрРабота.Работа+" код: " + стрРабота.Код;
					
					ОбластьРабот.Параметры.Работа = Работа;
					ОбластьРабот.Параметры.РабСсылка = стрРабота.Работа;
					
					ТабДок.Вывести(ОбластьРабот, ВыборкаСобытия.Уровень()+1);
					
				КонецЦикла;
				
				Для каждого стрДеталь из ТоварыСобытия Цикл
					
					Деталь = "Деталь: " + стрДеталь.Номенклатура+" код: " + стрДеталь.Код;
					
					ОбластьДеталей.Параметры.Деталь = Деталь;
					ОбластьДеталей.Параметры.ДетСсылка = стрДеталь.Номенклатура;
					
					ТабДок.Вывести(ОбластьДеталей, ВыборкаСобытия.Уровень()+1);
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	
	ТабДок.ТолькоПросмотр 	   = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку 	   = Ложь;
	
	//ПечатнаяФормаДокументов.ОбъектПредставление = "Структура распределения счетов и инцидентов по Заказ-Нарядам";
	//ПечатнаяФормаДокументов.Открыть();
	
КонецФункции

&НаСервере
Функция ПолучитьСписокТоваровПоИнвойсу(Инвойс)
	
	ЗаказНаряд = Инвойс.Ссылка;
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	EDR_Invoices.Invoice КАК Счет,
	|	EDR_Interventions.Intervention,
	|	ВЫБОР
	|		КОГДА EDR_ТоварыДоп.СтрокаИзЗаказНаряда
	|			ТОГДА ЗаказНарядТовары.Номенклатура
	|		ИНАЧЕ EDR_ТоварыДоп.DiversCode.Наименование
	|	КОНЕЦ КАК Номенклатура,
	|	&Invoice,
	|	ВЫБОР
	|		КОГДА EDR_ТоварыДоп.СтрокаИзЗаказНаряда
	|			ТОГДА ЗаказНарядТовары.Номенклатура.Артикул
	|		ИНАЧЕ EDR_ТоварыДоп.DiversCode.Код
	|	КОНЕЦ КАК Код,
	|	EDR_Interventions.GUID КАК GUID_События
	|ИЗ
	|	РегистрСведений.EDR_ТоварыДоп КАК EDR_ТоварыДоп
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.EDR_Interventions КАК EDR_Interventions
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.EDR_СоответствияИнвойсов КАК EDR_СоответствияИнвойсов
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.EDR_Invoices КАК EDR_Invoices
	|				ПО EDR_СоответствияИнвойсов.Invoice = EDR_Invoices.GUID
	|			ПО (EDR_СоответствияИнвойсов.Intervention = EDR_Interventions.GUID)
	|		ПО EDR_ТоварыДоп.GUID_Инцидента = EDR_Interventions.GUID
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
	|		ПО EDR_ТоварыДоп.Номенклатура = ЗаказНарядТовары.Номенклатура
	|			И EDR_ТоварыДоп.ЗаказНаряд = ЗаказНарядТовары.Ссылка
	|ГДЕ
	|	EDR_ТоварыДоп.ЗаказНаряд = &Ссылка
	|	И EDR_СоответствияИнвойсов.Invoice = &Invoice"
	);
	Запрос.УстановитьПараметр("Ссылка", ЗаказНаряд);
	Запрос.УстановитьПараметр("Invoice",Инвойс.GUID_Инвойса);
	
	ТабТоваров = Запрос.Выполнить().Выгрузить();
	
	Возврат ТабТоваров;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокРаботПоИнвойсу(Инвойс)
	
	ЗаказНаряд = Инвойс.Ссылка;
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	EDR_Invoices.Invoice КАК Счет,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда
	|			ТОГДА ЗаказНарядРаботы.Работа
	|		ИНАЧЕ EDR_РаботыДоп.DiversCode.Наименование
	|	КОНЕЦ КАК Работа,
	|	EDR_Interventions.GUID КАК GUID_События,
	|	&Invoice,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда
	|			ТОГДА ЗаказНарядРаботы.Работа.Артикул
	|		ИНАЧЕ EDR_РаботыДоп.DiversCode.Код
	|	КОНЕЦ КАК Код
	|ИЗ
	|	РегистрСведений.EDR_РаботыДоп КАК EDR_РаботыДоп
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
	|		ПО (ЗаказНарядРаботы.ИдентификаторРаботы = EDR_РаботыДоп.GUID_Работы)
	|			И (ЗаказНарядРаботы.Ссылка = EDR_РаботыДоп.ЗаказНаряд)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.EDR_Interventions КАК EDR_Interventions
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.EDR_СоответствияИнвойсов КАК EDR_СоответствияИнвойсов
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.EDR_Invoices КАК EDR_Invoices
	|				ПО EDR_СоответствияИнвойсов.Invoice = EDR_Invoices.GUID
	|			ПО (EDR_СоответствияИнвойсов.Intervention = EDR_Interventions.GUID)
	|		ПО EDR_РаботыДоп.GUID_Инцидента = EDR_Interventions.GUID
	|ГДЕ
	|	EDR_РаботыДоп.ЗаказНаряд = &Ссылка
	|	И EDR_СоответствияИнвойсов.Invoice = &Invoice
	|
	|СГРУППИРОВАТЬ ПО
	|	EDR_Interventions.GUID,
	|	EDR_Invoices.Invoice,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда
	|			ТОГДА ЗаказНарядРаботы.Работа.Артикул
	|		ИНАЧЕ EDR_РаботыДоп.DiversCode.Код
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА EDR_РаботыДоп.СтрокаИзЗаказНаряда
	|			ТОГДА ЗаказНарядРаботы.Работа
	|		ИНАЧЕ EDR_РаботыДоп.DiversCode.Наименование
	|	КОНЕЦ"
	);
	Запрос.УстановитьПараметр("Ссылка", ЗаказНаряд);
	Запрос.УстановитьПараметр("Invoice",Инвойс.GUID_Инвойса);
	
	ТабРабот = Запрос.Выполнить().Выгрузить();
	
	Возврат ТабРабот;
	
КонецФункции

////#КонецОбласти

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	
	СписокЗаказов.УсловноеОформление.Элементы.Очистить();
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокЗаказовГотовностьКОтправке.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокЗаказовРангАвторабот.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокЗаказов.Отправлен");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255,255,255));
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокЗаказовПовторнаяОтправка.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокЗаказов.Отправлен");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 243, 181));
	
КонецПроцедуры // УстановитьУсловноеОформление()

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	ОбновитьСписокНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокНаСервере()
	
	Элементы.СписокЗаказов.Обновить();
	
КонецПроцедуры // ОбновитьСписокНаСервере()

////#КонецОбласти

