
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Автомобиль = Параметры.Автомобиль;
	Владелец = Параметры.Контрагент;
	НомерПолиса = ?(Параметры.НовыйПолис, "", Параметры.НомерПолиса);
	СтраховаяКомпания = Параметры.СтраховаяКомпания;
	ДатаОкончанияПолиса = ?(Параметры.НовыйПолис, '00010101', Параметры.ДатаОкончанияПолиса);
	ЭтоНовыйПолис = Параметры.НовыйПолис;
	
	Если Параметры.Свойство("Подразделение") Тогда 
		Пар_Подразделение = Параметры.Подразделение;
	Иначе
		Пар_Подразделение = ПолучитьПодразделениеОтветственного(ПараметрыСеанса.Пользователь);
	КонецЕсли;
	
	Если НЕ ЭтоНовыйПолис Тогда 
		ЗаполнитьПредыдущиеДанные();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	Если Модифицированность Тогда 
		
		ОтказОтЗаписи = ПроверитьВозможностьЗаписи();
		
		Если НЕ ОтказОтЗаписи Тогда
			Попытка
				СфрмироватьНаборЗаписей();
				Модифицированность = Ложь;
				ЗаполнитьПредыдущиеДанные();
			Исключение
				Модифицированность = Истина;
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПолисаПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраховаяКомпанияПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПолисаПриИзменении(Элемент)
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Функция ПроверитьВозможностьЗаписи()
	
	Отказ = Ложь;
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	СписокРеквизитовДляПроверкиЗаполнения = Новый СписокЗначений();
	СписокРеквизитовДляПроверкиЗаполнения.Добавить("НомерПолиса", "номер полиса");
	СписокРеквизитовДляПроверкиЗаполнения.Добавить("СтраховаяКомпания", "страховая компания");
	СписокРеквизитовДляПроверкиЗаполнения.Добавить("ДатаОкончанияПолиса", "дата окончания действия полиса");
	СписокРеквизитовДляПроверкиЗаполнения.Добавить("Владелец", "владелец");
	
	Для Каждого ЭлементСписка Из СписокРеквизитовДляПроверкиЗаполнения Цикл
		Если НЕ ЗначениеЗаполнено(ЭтаФорма[ЭлементСписка.Значение]) Тогда
			Renault_ОбщегоНазначения.СообщитьОбОшибке("Поле """+СокрЛП(ЭлементСписка.Представление)+""" не заполнено!");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Отказ;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Модифицированность Тогда
		
		Ответ = Вопрос("Сохранить изменения?", РежимДиалогаВопрос.ДаНет, 0);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			
			ОтказОтЗаписи = ПроверитьВозможностьЗаписи();
			
			Если НЕ ОтказОтЗаписи Тогда 
				Попытка
					СфрмироватьНаборЗаписей();
					Модифицированность = Ложь;
				Исключение
					Модифицированность = Истина;
					Сообщить("Полис не был добавлен!");
				КонецПопытки;
			Иначе
				Отказ = Истина;
			КонецЕсли;
			
		Иначе 
			
			Модифицированность = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СфрмироватьНаборЗаписей()
	
	ЗаписиУдалены = Истина;
	
	Если НЕ ЭтоНовыйПолис Тогда 
		//удаляем предыдущие записи
		НаборЗаписей = РегистрыСведений.пац_СторонниеПолисы.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Автомобиль.Установить(Автомобиль);
		НаборЗаписей.Отбор.НомерПолиса.Установить(ДанныеДоИзменения[0].тНомерПолиса);
		НаборЗаписей.Отбор.СтраховаяКомпания.Установить(ДанныеДоИзменения[0].тСтраховаяКомпания);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		Попытка
			НаборЗаписей.Записать();
			ЗаписиУдалены = Истина;
		Исключение
			ЗаписиУдалены = Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если ЗаписиУдалены Тогда 
		
		НовыйНаборЗаписей = РегистрыСведений.пац_СторонниеПолисы.СоздатьНаборЗаписей();
		
		НовыйНаборЗаписей.Отбор.Автомобиль.Установить(Автомобиль);
		НовыйНаборЗаписей.Отбор.НомерПолиса.Установить(НомерПолиса);
		НовыйНаборЗаписей.Отбор.СтраховаяКомпания.Установить(СтраховаяКомпания);
		
		НоваяЗапись = НовыйНаборЗаписей.Добавить();
		НоваяЗапись.Автомобиль = Автомобиль;
		НоваяЗапись.НомерПолиса = СокрЛП(НомерПолиса);
		НоваяЗапись.СтраховаяКомпания = СтраховаяКомпания;
		НоваяЗапись.ДатаОкончанияСрокаДействия = ДатаОкончанияПолиса;
		НоваяЗапись.Контрагент = Владелец;
		НоваяЗапись.Ответственный = ПараметрыСеанса.Пользователь;
		НоваяЗапись.Подразделение = Пар_Подразделение;
		
		Попытка
			НовыйНаборЗаписей.Записать();
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредыдущиеДанные()
	
	ДанныеДоИзменения.Очистить();
	
	НоваяСтрока = ДанныеДоИзменения.Добавить();
	НоваяСтрока.тНомерПолиса = НомерПолиса;
	НоваяСтрока.тСтраховаяКомпания = СтраховаяКомпания;
	НоваяСтрока.тДатаОкончанияПолиса = ДатаОкончанияПолиса;
	НоваяСтрока.тВладелец = Владелец;
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПодразделениеОтветственного(Ответственный)
	
	Подразделение = Справочники.Подразделения.ПустаяСсылка();
	
	Если Ответственный <> Неопределено Тогда 
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	КадроваяИстория.Подразделение
		               |ИЗ
		               |	РегистрСведений.пацКадроваяИсторияСотрудников.СрезПоследних(&Период, Физлицо = &ФизЛицоОтветственного) КАК КадроваяИстория";
					   
		Запрос.УстановитьПараметр("Период", ТекущаяДата());
		Запрос.УстановитьПараметр("ФизЛицоОтветственного", Ответственный.ФизЛицо);
		
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			Подразделение = Выборка.Подразделение;
		КонецЕсли;
		
		Возврат Подразделение;
		
	КонецЕсли;
	
КонецФункции

