//Бондаренко 20151023 ++
Функция НайтиШтрихКод(Ячейка) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЯчейкиХранения.Ссылка,
	               |	ШтрихКоды.ШтрихКод
	               |ИЗ
	               |	Справочник.ЯчейкиХранения КАК ЯчейкиХранения
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихКоды КАК ШтрихКоды
	               |		ПО (ШтрихКоды.Объект = ЯчейкиХранения.Ссылка)
	               |ГДЕ
	               //|	ЯчейкиХранения.Владелец = &Владелец	И 
				   |ЯчейкиХранения.ПометкаУдаления = ЛОЖЬ
	               |	И ЯчейкиХранения.Ссылка = &Ссылка";
				   
				  // Запрос.УстановитьПараметр("Владелец",Склад);
				   Запрос.УстановитьПараметр("Ссылка",Ячейка);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() цикл
  		Возврат Результат.ШтрихКод;
	КонецЦикла;	
	
	Возврат "";
	
КонецФункции
//Бондаренко 20151023 --
 

Процедура ПечатьЯрлыков(НомерВар) Экспорт
	Если СекцииДляПечати.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
   	Если НомерВар=1 Тогда
		МакетЯрлыка = ПолучитьМакет("МакетЯрлыка");
	Иначе	
 		МакетЯрлыка = ПолучитьМакет("Макет");
 	КонецЕсли; 
	 
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;

	СтрокаДляВывода = Неопределено;
	
	Сч_Столб = 0;
	Сч = 1;
	
	Для Каждого СтрокаСекции Из СекцииДляПечати Цикл
		//СтрокаДляВывода = Новый ТабличныйДокумент;
		//СтрокаДляВывода.ПолеСверху = 0;
		//СтрокаДляВывода.ПолеСнизу = 0;
		//СтрокаДляВывода.ПолеСлева = 0;
		//СтрокаДляВывода.ПолеСправа = 0;
		
		ОбластьЯрлык = МакетЯрлыка.ПолучитьОбласть("Ярлык|Ярл");
		
		Если НомерВар = 1 Тогда
			ОбластьЯрлык.Параметры.Секция = ПривестиИдентификатор(СтрокаСекции.Ячейка.НомерЯчейки);
			ОбластьЯрлык.Параметры.Полка = ПривестиИдентификатор(СтрокаСекции.Ячейка.Полка.ИдентификаторДляЯрлыка);
			ОбластьЯрлык.Параметры.Стеллаж = ПривестиИдентификатор(СтрокаСекции.Ячейка.Стеллаж.ИдентификаторДляЯрлыка);
			ОбластьЯрлык.Параметры.Ряд = ПривестиИдентификатор(СтрокаСекции.Ячейка.Ряд.ИдентификаторДляЯрлыка);
			ОбластьЯрлык.Параметры.Зона = СтрокаСекции.Ячейка.Зона.ИдентификаторДляЯрлыка; 
			ОбластьЯрлык.Параметры.Склад = СтрокаСекции.Ячейка.Владелец.ИдентификаторДляЯрлыка;
		Иначе	
			ОбластьЯрлык.Параметры.Ячейка = СтрокаСекции.Ячейка;
 		КонецЕсли; 
 		
		//Бондаренко 20151023 ++
		
		//ОбластьЯрлык.РИсунки.ШтрихкодЯрлыка.Объект.ТипКода = 3;
		//ОбластьЯрлык.Рисунки.ШтрихкодЯрлыка.Объект.Сообщение = СокрЛП(СтрокаСекции.Ячейка.Код);
		//ОбластьЯрлык.Рисунки.ШтрихкодЯрлыка.Объект.ТекстКода = СокрЛП(СтрокаСекции.Ячейка.Код);
		//ОбластьЯрлык.Рисунки.ШтрихкодЯрлыка.Объект.ОтображатьТекст = ложь;
		
		ШтрихКод = "";
		ШтрихКод = НайтиШтрихКод(СтрокаСекции.Ячейка);
		
		Сообщить("ШтрихКод = "+ШтрихКод);
		
		ОбластьЯрлык.Рисунки.ШтрихкодЯрлыка.Объект.ТипКода = 1;
		ОбластьЯрлык.Рисунки.ШтрихкодЯрлыка.Объект.Сообщение = СокрЛП(ШтрихКод);
		ОбластьЯрлык.Рисунки.ШтрихкодЯрлыка.Объект.ТекстКода = СокрЛП(ШтрихКод);
		ОбластьЯрлык.Рисунки.ШтрихкодЯрлыка.Объект.ОтображатьТекст = Истина;
		
		
		//Бондаренко 20151023 --

		Если Сч_Столб < СтолбцовНаЛисте Тогда
  			ТабДок.Присоединить(ОбластьЯрлык);
			Сч_Столб = Сч_Столб + 1;
		Иначе
			Если Сч < СтрокНаЛисте Тогда
 				Сч_Столб = 1;
 				Сч = Сч + 1;
			Иначе
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				Сч = 1;
				Сч_Столб = 1;
			КонецЕсли;
			ТабДок.Вывести(ОбластьЯрлык);
		КонецЕсли;	
		
		//Если СЧ = 1 Тогда
		//	СтрокаДляВывода = Новый ТабличныйДокумент;
		//	СтрокаДляВывода.ПроверитьПрисоединение(
		//	СтрокаДляВывода.Вывести(ОбластьЯрлык);
		//ИначеЕсли СЧ <> КоличествоВСтроке Тогда
		//	СтрокаДляВывода.Присоединить(ОбластьЯрлык);
		//ИначеЕсли СЧ = 4 Тогда
		//	СтрокаДляВывода.Присоединить(ОбластьЯрлык);
		//	ТабДок.Вывести(СтрокаДляВывода);
		//	СтрокаДляВывода = Неопределено;
		//	СЧ = 0;
		//КонецЕсли;
		//СЧ = СЧ + 1;
	КонецЦикла;
	//Если СтрокаДляВывода <> Неопределено Тогда
	//	ТабДок.Вывести(СтрокаДляВывода);
	//КонецЕсли;
	
	//Бондаренко 20151118 ++
	ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
 	ТабДок.АвтоМасштаб=Истина;
  	ТабДок.ПолеСверху=0;
	ТабДок.ПолеСлева=0;
	ТабДок.ПолеСнизу=0;
	ТабДок.ПолеСправа=0;
	ТабДок.ВерхнийКолонтитул.Выводить=Ложь;
	ТабДок.НижнийКолонтитул.Выводить=Ложь;
 	//Бондаренко 20151118 --
	
	ТабДок.Показать();
КонецПроцедуры

Функция ПривестиИдентификатор(Идентификатор)
	Попытка
		Возврат Число(СокрЛП(Идентификатор));
	Исключение
		Возврат СокрЛП(Идентификатор);
	КонецПопытки
КонецФункции

Процедура ЗаполнитьСекции(Показатель) Экспорт
	
	Если ТипЗнч(Показатель) = Тип("Строка") Тогда
		Возврат;
	ИначеЕсли ТипЗнч(Показатель) = Тип("СправочникСсылка.ЯчейкиХранения") Тогда
		Если ЗначениеЗаполнено(Показатель.Зона) Тогда
			СтрокаСекции = СекцииДляПечати.Добавить();
			СтрокаСекции.Ячейка = Показатель;
		Иначе
			Возврат;
		КонецЕсли;
	Иначе
		ЗапросЯчеек = Новый Запрос();
		ТекстЗапроса =  "ВЫБРАТЬ
		                |	ЯчейкиХранения.Ссылка КАК Ячейка
		                |ИЗ
		                |	Справочник.ЯчейкиХранения КАК ЯчейкиХранения
		                |ГДЕ
						| %ОтборПоВладельцу% = &Показатель
		                |УПОРЯДОЧИТЬ ПО
		                |	ЯчейкиХранения.Код";
						
		Если ТипЗнч(Показатель) = Тип("СправочникСсылка.Полки") Тогда
			ТекстОтбораПоВладельцу = "ЯчейкиХранения.Полка";
		ИначеЕсли ТипЗнч(Показатель) = Тип("СправочникСсылка.Стеллажи") Тогда
			ТекстОтбораПоВладельцу = "ЯчейкиХранения.Стеллаж";
		ИначеЕсли ТипЗнч(Показатель) = Тип("СправочникСсылка.Ряды") Тогда
			ТекстОтбораПоВладельцу = "ЯчейкиХранения.Ряд";
		ИначеЕсли ТипЗнч(Показатель) = Тип("СправочникСсылка.Зоны") Тогда
			ТекстОтбораПоВладельцу = "ЯчейкиХранения.Зона";
		Иначе
			Возврат;
		КонецЕсли;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ОтборПоВладельцу%", ТекстОтбораПоВладельцу);
		ЗапросЯчеек.Текст = ТекстЗапроса;
		ЗапросЯчеек.УстановитьПараметр("Показатель", Показатель);
						
		СекцииДляПечати.Загрузить(ЗапросЯчеек.Выполнить().Выгрузить());
	КонецЕсли;
КонецПроцедуры