
Процедура ПоискИЗаполнениеПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	Опции.Ссылка КАК Опция 
	               |ИЗ
	               |	Справочник.Опции КАК Опции
	               |ГДЕ
	               |	(Опции.Наименование ПОДОБНО &Конд
	               |			ИЛИ Опции.Наименование ПОДОБНО &Клим)";
				   
				   
	Запрос.УстановитьПараметр("Конд", "%конд%");
	Запрос.УстановитьПараметр("Клим", "%клим%");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись = РегистрыСведений.Renault_ОпцииКондиционера.СоздатьМенеджерЗаписи();
		Запись.Опция = Выборка.Опция;
		
		Запись.Записать();
		
	КонецЦикла;

КонецПроцедуры
