
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Вызов из форм DMS
	Если Параметры.Свойство("VIN") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ТекДата",ТекущаяДата());	
		Список.Параметры.УстановитьЗначениеПараметра("Год",Параметры.Год);
		Список.Параметры.УстановитьЗначениеПараметра("ДилерскийЦентр",Параметры.ДилерскийЦентр);
		
		//Список.Параметры.УстановитьЗначениеПараметра("Кредит",Параметры.Кредит);
		Список.Параметры.УстановитьЗначениеПараметра("TradeIn",Параметры.TradeIn);
		Список.Параметры.УстановитьЗначениеПараметра("Утилизация",Параметры.Утилизация);
		
		Если Параметры.Свойство("ВариантКомплектации") Тогда
			Список.Параметры.УстановитьЗначениеПараметра("БезОтбора",Ложь);
			Список.Параметры.УстановитьЗначениеПараметра("ВариантКомплектации",Параметры.ВариантКомплектации);
			Список.Параметры.УстановитьЗначениеПараметра("Модель",Параметры.Модель);
			Список.Параметры.УстановитьЗначениеПараметра("VIN",Параметры.VIN);
		Иначе
			Список.Параметры.УстановитьЗначениеПараметра("БезОтбора",Истина);
			Список.Параметры.УстановитьЗначениеПараметра("ВариантКомплектации",NULL);
			Список.Параметры.УстановитьЗначениеПараметра("Модель",NULL);
			Список.Параметры.УстановитьЗначениеПараметра("VIN",NULL);
		КонецЕсли;
	Иначе //Вызов из внешних обработок
		Элементы.Список.Доступность = Ложь;
		Элементы.Список.Видимость = Ложь;
		Элементы.СписокПоУмолчанию.Доступность = Истина;
		Элементы.СписокПоУмолчанию.Видимость = Истина;
		Элементы.кнОК.Доступность = Ложь;
		Элементы.кнОК.Видимость = Ложь;
		Элементы.кнВыбратьПоУмолчанию.Доступность = Истина;
		Элементы.кнВыбратьПоУмолчанию.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока="", Поле="", СтандартнаяОбработка="")
	СтандартнаяОбработка=Ложь;
	Данные=Элементы.Список.ТекущиеДанные;
	//	Закрыть(Новый Структура("КоммерческаяАкция,ВариантСкидки,ЗначениеСкидки",Элементы.Список.ТекущаяСтрока,Данные.ВариантСкидки,Данные.ЗначениеСкидки))
	Если Данные <> Неопределено Тогда
		Закрыть(Новый Структура("КоммерческаяАкция,ВариантСкидки,ЗначениеСкидки,ЗначениеСкидкиУчастиеДилера",Данные.Ссылка,Данные.ВариантСкидки,Данные.ЗначениеСкидки, Данные.ЗначениеСкидкиУчастиеДилера))
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура кнОК2(Команда)
	
	Если ЗначениеЗаполнено(Элементы.СписокПоУмолчанию.ТекущиеДанные) Тогда
		ОповеститьОВыборе(Элементы.СписокПоУмолчанию.ТекущиеДанные.Ссылка)
	Иначе
		ОповеститьОВыборе(Справочники.DMS_КоммерческиеАкции.ПустаяСсылка())
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПоУмолчаниюВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОповеститьОВыборе(Элементы.СписокПоУмолчанию.ТекущиеДанные.Ссылка)
КонецПроцедуры
