////////////////////////////////////////////
//НАЧАЛО  		СОБЫТИЯ ФОРМЫ  		НАЧАЛО//
////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = ПараметрыСеанса.Пользователь;
	
	Право_ИзменениеПарковочногоМеста = ПараметрыСеанса.Renault_ПраваПользователя.ИзменениеПарковочногоМеста;
	
	Если НЕ Право_ИзменениеПарковочногоМеста Тогда
		Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет прав на изменение парковочного места!", Неопределено, "", Отказ);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ПараметрыОтбора") И ТипЗнч(Параметры.ПараметрыОтбора) = Тип("Структура") Тогда
		
		ПараметрыОтбора = Параметры.ПараметрыОтбора;
		
		ПараметрыОтбора.Свойство("Склад",		Отбор_Склад);
		ПараметрыОтбора.Свойство("Автомобиль",	Отбор_Автомобиль);
		Отбор_ТолькоСвободные = ?(ПараметрыОтбора.Свойство("ТолькоСвободные"), ПараметрыОтбора.ТолькоСвободные, Истина);
		
		Если Отбор_Автомобиль.Пустая() Тогда
			Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Некорректный автомобиль", Неопределено, "", Отказ);
			Возврат;
		КонецЕсли;
		
		ТекущееМесто			= РегистрыСведений.Renault_РазмещениеАвтомобилей.ПолучитьПарковочноеМестоАвтомобиля(Отбор_Автомобиль);
		ТекущийСклад			= ТекущееМесто.Территория;
		ТекущееПарковочноеМесто = ТекущееМесто.ПарковочноеМесто;
		
		НаборПоСкладу = РегистрыСведений.Renault_РазмещениеАвтомобилей.СоздатьНаборЗаписей();
		НаборПоСкладу.Отбор.Склад.Установить(Отбор_Склад);
		НаборПоСкладу.Прочитать();
		
		Если НаборПоСкладу.Количество() =0 Тогда
			Отбор_Склад = Отбор_Склад.Renault_Территория;
		КонецЕсли;
		
		ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("Склад", 		Отбор_Склад);
		ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("Автомобиль",	Отбор_Автомобиль);
		ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("Свободные",	Отбор_ТолькоСвободные);
		
	Иначе
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьПредставлениеЭлементов();
	
КонецПроцедуры

////////////////////////////////////////////
//КОНЕЦ 		СОБЫТИЯ ФОРМЫ       КОНЕЦ///
////////////////////////////////////////////


//////////////////////////////////////////
//НАЧАЛО	СОБЫТИЯ ЭЛЕМЕНТОВ	  НАЧАЛО//
//////////////////////////////////////////

&НаКлиенте
Процедура Отбор_ТолькоСвободныеПриИзменении(Элемент)
	
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("Свободные", Отбор_ТолькоСвободные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДинамическийСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеСтроки = Элементы.ДинамическийСписок.ДанныеСтроки(ВыбраннаяСтрока);
	
	НовоеПарковочноеМесто = ?(ДанныеСтроки.Автомобиль.Пустая(), ДанныеСтроки.ПарковочноеМесто, НовоеПарковочноеМесто);
	
	ОбновитьПредставлениеЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура Запарковать(Команда)
	
	Если НовоеПарковочноеМесто Тогда 
		Если ЗанятьМесто(Отбор_Склад, НовоеПарковочноеМесто, Отбор_Автомобиль) Тогда
			Оповестить("ВыбраноПарковочноеМесто");
			Закрыть(Истина);
		КонецЕсли;
	Иначе
		Предупреждение("Не указано новое парковочное место!", 8);
	КонецЕсли;
	
КонецПроцедуры


//////////////////////////////////////////
//КОНЕЦ		СОБЫТИЯ ЭЛЕМЕНТОВ	   КОНЕЦ//
//////////////////////////////////////////

&НаКлиенте
Процедура ОбновитьПредставлениеЭлементов()
	
	текЗаголовок = "Новое:";
	текЗаголовок = текЗаголовок + ?(НовоеПарковочноеМесто, НовоеПарковочноеМесто, "<не указано>");
	текЗаголовок = текЗаголовок + ?(НЕ Отбор_Склад.Пустая(), " (" + Отбор_Склад + ")", "");
	
	Элементы.ПредставлениеНовоеПарковочноеМесто.Заголовок = текЗаголовок;
	
	текЗаголовок = "Текущее: ";
	текЗаголовок = текЗаголовок + ?(ТекущееПарковочноеМесто, ТекущееПарковочноеМесто, "<не установлено>");
	текЗаголовок = текЗаголовок + ?(НЕ ТекущийСклад.Пустая(), " (" + ТекущийСклад + ")", "");
	Элементы.ПредставлениеТекущееПарковочноеМесто.Заголовок = текЗаголовок;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗанятьМесто(Склад, НовоеПарковочноеМесто, Автомобиль)
	
	Возврат РегистрыСведений.Renault_РазмещениеАвтомобилей.ЗанятьМестоАвтомобилем(Склад, НовоеПарковочноеМесто, Автомобиль);
	
КонецФункции
