
#Область ПеременныеМодуля

&НаКлиенте
Перем ДокументПервогоБраузера;

&НаКлиенте
Перем ОкноПервогоБраузера;

&НаКлиенте
Перем МассивКнопокПервогоБраузера;

&НаКлиенте
Перем ПеременнаяМодуля Экспорт;

#КонецОбласти


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолеБраузера = Обработки.DMS_WebSocket_Клиент.ПолучитьМакет(
	"МакетСкрипта").ПолучитьТекст();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеБраузераДокументСформирован(Элемент)
	// Исключение обработки дубля события "ДокументСформирован"
	Если НЕ ПервыйБраузерЗагрузкаОбработана Тогда
		ПервыйБраузерЗагрузкаОбработана = Истина;
		
		// Сохранение элементов document и window в переменных формы,
		// для последующего быстрого доступа к элементам и функциям.
		ДокументПервогоБраузера = Элемент.Документ;
		ОкноПервогоБраузера 	= ДокументПервогоБраузера.parentWindow;
		Если ОкноПервогоБраузера = Неопределено Тогда
			ОкноПервогоБраузера = ДокументПервогоБраузера.defaultView;	
		КонецЕсли;
		
		ОкноПервогоБраузера.externalForm = ЭтаФорма;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолеБраузераПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)

	ИмяОперации = ДанныеСобытия.Element.id;
	ДанныеОперации = ДанныеСобытия.Element.innerText;
	Если Не ЗначениеЗаполнено(ИмяОперации) Тогда //не наше событие
		Возврат;                       
	КонецЕсли;
	
	ПолучитьДанныеКЗ(ДанныеОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

&НаКлиенте
Процедура ТестКоманд(Команда)
	//ОкноПервогоБраузера.createButtons("Нажата клиентская кнопка 1с");
	ПолучитьДанныеКЗ("");	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКЗ(Команда)
	
	Структура = Новый Структура;
	ПараметрыВызова = Новый Структура;
	ЭлементыОтбора = Новый Структура("VIN","X7LHSRHGN60065324");
	ПараметрыВызова = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	Структура.Вставить("form","Документ.DMS_КлиентскиеЗаявки.Форма.ФормаДокумента");	
	Структура.Вставить("params",ПараметрыВызова);	
    ОкноПервогоБраузера.postOnWeb(СериализоватьВСтрокуJSON(Структура));
КонецПроцедуры

&НаКлиенте
Функция СериализоватьВСтрокуJSON(Данные) Экспорт
	
	Запись = новый ЗаписьJSON;
    Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Данные);
	
	Возврат Запись.Закрыть();
 
КонецФункции

&НаКлиенте
функция ДесериализоватьСтрокуJSON(СтрокаJSON) Экспорт
	
	Чтение = новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	
	Результат = ПрочитатьJSON(Чтение);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьДанныеКЗ(ГУИД)
	
	Соединение = Новый HTTPСоединение("84.201.169.9", 8080,"Администратор",""); 
    Запрос = Новый HTTPЗапрос("/zenin_webdms_dev/odata/standard.odata/Document_DMS_КлиентскиеЗаявки(Ref_Key=guid'a7615727-f372-11ea-80d3-d383ef98ae60')?$format=json");
    Результат = Соединение.Получить(Запрос);
	JSON = Результат.ПолучитьТелоКакСтроку();
	
КонецПроцедуры

