                                                            
#Область ПрограммныйИнтерфейс

Функция Печать(МассивОбъектов, ТабДок, ПроцентСкидки = 0, ТипыАвтомобилей = Неопределено) Экспорт
	
	Док = МассивОбъектов[0];
	ИмяМакета = ИмяМакетаКП(Док);
	
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_CRM_КоммерческоеПредложение_КоммерческоеПредложение" + ИмяМакета;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабДок.ПолеСверху = 10;
	ТабДок.ПолеСнизу = 10;
	ТабДок.ПолеСлева = 10;
	ТабДок.ПолеСправа = 10;
	
	ТабДок.АвтоМасштаб = Истина;
	
	// {
	Если ИмяМакета = "LADA_ПФ_MXL_КП" Тогда
		ПечатьКПЛада(МассивОбъектов, ТабДок, ПроцентСкидки, ТипыАвтомобилей = Неопределено);
		Возврат ТабДок;
	КонецЕсли;
	// }
	
	Макет = ПолучитьМакет(ИмяМакета);
	Область_ПодвалСтр1 = Макет.ПолучитьОбласть("ПодвалСтр1");
	
	ДополнительныеПараметры = Новый Структура("ДанныеКонфигурации, ТекущаяКонфигурация, Тариф, ДилЦентр, СуммаДопИтого, ЦенаВерсии, ЦенаВыкупа, СуммаСкидки, СрокДействия");
	ДанныеШапки = ПолучитьДанныеШапки(Док);
	
	ПервыйДокумент = Истина;
	Для Каждого СтрСостав Из Док.Состав Цикл
		Если НЕ ПервыйДокумент Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		ВывестиДанныеШапки(Док, Макет, ДанныеШапки, ТабДок, СтрСостав, ДополнительныеПараметры);
		ВывестиТТХ(Док, Макет, ДанныеШапки, ТабДок, СтрСостав, ИмяМакета, ДополнительныеПараметры);
		ВывестиБазовыеОпции(Док, Макет, ТабДок, СтрСостав, ИмяМакета, ДополнительныеПараметры);
		ВывестиДополнительныеОпции(Док, Макет, ТабДок, СтрСостав, ИмяМакета, ПроцентСкидки, ДополнительныеПараметры);
		
		//Для корп. клиента не выводим нежеследующие
		Если ИмяМакета = "ПФ_MXL_КП_КОРП" Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИмяМакета = "ПФ_MXL_КП" Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			
			Область = Макет.ПолучитьОбласть("МультимедиаОтличия");
			ТабДок.Вывести(Область);
			
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ТабДок.Вывести(Область_ПодвалСтр1);
		КонецЕсли;
		
		ВывестиФинансовыеПродукты(Док, Макет, ТабДок, ИмяМакета, ДополнительныеПараметры);
		
		ТабДок.Вывести(Область_ПодвалСтр1);
		
		МассивОбластей = Новый Массив();
		
		Если ИмяМакета = "ПФ_MXL_КП_LADA" Тогда
			Обл = Макет.ПолучитьОбласть("ПодвалСтр2");
			МассивОбластей.Добавить(Обл);
		ИначеЕсли ИмяМакета = "ПФ_MXL_КП" Тогда
			Обл = Макет.ПолучитьОбласть("ПодвалСтр2");
			Обл.Параметры.СрокДействия = ДополнительныеПараметры.СрокДействия;
			МассивОбластей.Добавить(Обл);
			
			Обл = Макет.ПолучитьОбласть("ПодвалСтр3");
			Обл.Параметры.НаименованиеОрганизации = ДанныеШапки.НаименованиеОрганизации;
			Обл.Параметры.АдресДилера             = ДанныеШапки.АдресОрганизации;
			МассивОбластей.Добавить(Обл);
		Иначе
			Обл = Макет.ПолучитьОбласть("ПодвалСтр2");
			Обл.Параметры.СрокДействия = ДополнительныеПараметры.СрокДействия;
			Обл.Параметры.НаименованиеОрганизации = ДанныеШапки.НаименованиеОрганизации;
			Обл.Параметры.АдресДилера             = ДанныеШапки.АдресОрганизации;
			МассивОбластей.Добавить(Обл);
		КонецЕсли;
		
		Если НЕ ТабДок.ПроверитьВывод(МассивОбластей) Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Для Каждого ЭлементМассиваОбласть Из МассивОбластей Цикл
			ТабДок.Вывести(ЭлементМассиваОбласть);
		КонецЦикла;
	КонецЦикла;
		
	Возврат ТабДок;
	
КонецФункции

#КонецОбласти

#Область Печать

Функция ИмяМакетаКП(КП) Экспорт
	
	Если ПараметрыСеанса.DMS_Бренд = Справочники.CRM_МаркаАвтомобиля.LADA Тогда
		Возврат "ПФ_MXL_КП_LADA";
	Иначе
		Возврат ?(ЭтоКорпоративныйРабочийЛист(КП), "ПФ_MXL_КП_КОРП", "ПФ_MXL_КП");
	КонецЕсли;
	
КонецФункции

Процедура ВывестиДанныеШапки(Док, Макет, ДанныеШапки, ТабДок, СтрСостав, ДополнительныеПараметры)
	
	ДополнительныеПараметры.ТекущаяКонфигурация = СтрСостав.Конфигурация.ПолучитьОбъект();
	Если Не ЗначениеЗаполнено(Док.Тариф) Тогда
		ДополнительныеПараметры.Тариф = Renault_CRM.ПолучитьПоследнийТарифНаАвтомобиль(ДополнительныеПараметры.ТекущаяКонфигурация.Версия);
	Иначе
		ДополнительныеПараметры.Тариф = Док.Тариф;
	КонецЕсли;
	
	Обл = Макет.ПолучитьОбласть("Шапка");
	
	Запрос = Новый Запрос("Выбрать Город Из РегистрСведений.CRM_КлиентскиеДанные ГДЕ Клиент=&Клиент");
	Запрос.УстановитьПараметр("Клиент", Док.Клиент);
	Выборка = Запрос.Выполнить().Выбрать();
	Обл.Параметры.Город = "Город: " + ?(Выборка.Следующий(), Выборка.Город, "---");
	
	ДополнительныеПараметры.ДилЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
	//Логотип = Неопределено;
	//Если ЗначениеЗаполнено(ДилЦентр) Тогда
	//	Логотип = ДилЦентр.ЛоготипДЦ.Получить();
	//	Если ТипЗнч(Логотип)= тип("Картинка") Тогда
	//		обл.Рисунки.D1.Картинка = Логотип;
	//	КонецЕсли;
	//КонецЕсли;
	ДополнительныеПараметры.ДанныеКонфигурации = ПолучитьДанныеКонфигурации(СтрСостав.Конфигурация, ДополнительныеПараметры.Тариф);
	
	//Если ЗначениеЗаполнено(ДанныеКонфигурации.VIN) Тогда
	//	//URL = СтрШаблон("", ДанныеКонфигурации.VIN);			
	//	URL = "https://yandex.ru/";
	//	ДвоичныеДанныеQRКода = Renault_ОбщийМодульСервер.ДанныеQRКода(URL, 0, 300);
	//	КартинкаQRКод = Новый Картинка(ДвоичныеДанныеQRКода);
	//	Обл.Рисунки.ИзображениеQRКод.Картинка = КартинкаQRКод;
	//КонецЕсли;
	
	Если ДанныеШапки <> Неопределено Тогда
		Обл.Параметры.Заполнить(ДанныеШапки);
		
		ТелефонКлиента = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(ДанныеШапки.Клиент);
		ТелефонКлиента = Renault_УправлениеКонтактнойИнформацией.НормализацияНомераТелефона(ТелефонКлиента, ДополнительныеПараметры.ДилЦентр);
		Обл.Параметры.ТелефонКлиента = ?(ЗначениеЗаполнено(ТелефонКлиента), "Тел. " + ТелефонКлиента, "<Телефон не указан>");
		
		Обл.Параметры.ТелефонДилера = "Тел. " + ДанныеШапки.ТелефонОрганизации;
		
		ПочтаКлиента = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(ДанныеШапки.Клиент);
		Обл.Параметры.ПочтаКлиента = ?(ЗначениеЗаполнено(ПочтаКлиента), "Email: " + ПочтаКлиента, "<Email не указан>");
		
		Обл.Параметры.ПочтаДилера = "Email: " + ДанныеШапки.EmailОрганизации;
		
		Обл.Параметры.АдресДилера = "Адрес: " + ДанныеШапки.АдресОрганизации;
		
	КонецЕсли;
	ТабДок.Вывести(Обл);
	
	Обл = Макет.ПолучитьОбласть("ОбластьВашМенеджер");
	ТелефонМенеджера = ПолучитьКонтакт(ДанныеШапки.КонтактноеЛицо, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	ПочтаМенеджера = ПолучитьКонтакт(ДанныеШапки.КонтактноеЛицо, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
	Обл.Параметры.ТекстВашМенеджер = "Ваш менеджер: " + ДанныеШапки.КонтактноеЛицо 
	+ ?(ЗначениеЗаполнено(ТелефонМенеджера), ", тел." + ТелефонМенеджера, "") 
	+ ?(ЗначениеЗаполнено(ПочтаМенеджера), ", email: " + ПочтаМенеджера, "");
	
	ДополнительныеПараметры.СрокДействия = Формат(ДанныеШапки.СрокДействия, "Л=ru_RU; ДЛФ=ДД");
	Обл.Параметры.СрокДействия = ДополнительныеПараметры.СрокДействия;
	
	ТабДок.Вывести(Обл);
	
КонецПроцедуры

Процедура ВывестиТТХ(Док, Макет, ДанныеШапки, ТабДок, СтрСостав, ИмяМакета, ДополнительныеПараметры)
	
	ДанныеКонфигурации = ДополнительныеПараметры.ДанныеКонфигурации;
	
	Обл = Макет.ПолучитьОбласть("ТТХ");
	
	Если ДанныеКонфигурации <> Неопределено Тогда
		
		Обл.Параметры.Модель = ?(ЗначениеЗаполнено(ДанныеКонфигурации.Модель), ДанныеКонфигурации.Модель, "<Не указана>"); 
		Обл.Параметры.Версия = ?(ЗначениеЗаполнено(ДанныеКонфигурации.Версия), ДанныеКонфигурации.Версия, "<Не указана>"); 
		Обл.Параметры.Цвет = ?(ЗначениеЗаполнено(ДанныеКонфигурации.Цвет), ДанныеКонфигурации.Цвет, "<Не указан>"); 
		Обл.Параметры.Объем = ?(ЗначениеЗаполнено(ДанныеКонфигурации.Объем), Строка(ДанныеКонфигурации.Объем) + " см3", "<Не указан>"); 
		
		Двигатель_КВТ = ?(ЗначениеЗаполнено(ДанныеКонфигурации.Двигатель_КВТ), Строка(ДанныеКонфигурации.Двигатель_КВТ), "<Не указана>");
		ДвигательЛС = ?(ЗначениеЗаполнено(ДанныеКонфигурации.ДвигательЛС), Строка(ДанныеКонфигурации.ДвигательЛС), "<Не указана>");
		Обл.Параметры.Двигатель = ДвигательЛС + " (" + Двигатель_КВТ + ") л.с.(кВт)";
		
		Если ЗначениеЗаполнено(ДанныеКонфигурации.VIN) Тогда
			Обл.Параметры.Автомобиль = "VIN: " + Строка(ДанныеКонфигурации.VIN);
		КонецЕсли;
		
	КонецЕсли;
	
	// ++ Ковалев ЕС от 23.08.2018
	Если ДанныеШапки <> Неопределено Тогда
		Если ИмяМакета = "ПФ_MXL_КП" тогда
			Обл.Параметры.ОриентировочныйПериодПередачи = Формат(ДанныеШапки.ДатаНачалаПередачиАвто, "ДЛФ=Д") + " - " + Формат(ДанныеШапки.ДатаОкончанияПередачиАвто, "ДЛФ=Д");
		КонецЕсли;
	КонецЕсли;
	// -- Ковалев ЕС от 23.08.2018
	
	МенеджерИдентификатор = РегистрыСведений.CRM_ИдентификаторыКартинок.СоздатьМенеджерЗаписи();
	МенеджерИдентификатор.Модель = СтрСостав.Конфигурация.Модель;
	МенеджерИдентификатор.Цвет = СтрСостав.Конфигурация.Цвет;
	МенеджерИдентификатор.ВариантКомплектации = СтрСостав.Конфигурация.Версия;
	МенеджерИдентификатор.Прочитать();
	Если НЕ МенеджерИдентификатор.Выбран() Тогда
		МенеджерИдентификатор.Модель = СтрСостав.Конфигурация.Модель;
		МенеджерИдентификатор.ВариантКомплектации = СтрСостав.Конфигурация.Версия;
		МенеджерИдентификатор.Прочитать();
	КонецЕсли;
	Если НЕ МенеджерИдентификатор.Выбран() Тогда
		МенеджерИдентификатор.Модель = СтрСостав.Конфигурация.Модель;
		МенеджерИдентификатор.Цвет = СтрСостав.Конфигурация.Цвет;
		МенеджерИдентификатор.Прочитать();
	КонецЕсли;
	Если НЕ МенеджерИдентификатор.Выбран() Тогда
		МенеджерИдентификатор.Модель = СтрСостав.Конфигурация.Модель;
		МенеджерИдентификатор.Прочитать();
	КонецЕсли;
	Если МенеджерИдентификатор.Выбран() Тогда
		МенеджерКартинка = РегистрыСведений.КартинкиИФайлы.СоздатьМенеджерЗаписи();
		МенеджерКартинка.Объект = СтрСостав.Конфигурация.Модель;
		МенеджерКартинка.Идентификатор = МенеджерИдентификатор.Идентификатор;
		МенеджерКартинка.Прочитать();
		Картинка = МенеджерКартинка.Данные.Получить();
		Если ТипЗнч(Картинка) = Тип("Картинка") Тогда
			Обл.Рисунки.ИзображениеАвто.Картинка = МенеджерКартинка.Данные.Получить();
		КонецЕсли;
	КонецЕсли;
	
	ТабДок.Вывести(Обл);
	
КонецПроцедуры

Процедура ВывестиБазовыеОпции(Док, Макет, ТабДок, СтрСостав, ИмяМакета, ДополнительныеПараметры)
	
	Обл = Макет.ПолучитьОбласть("БазовыеОпцииШапка");
	ТабДок.Вывести(Обл);
	
	ДополнительныеПараметры.ЦенаВыкупа = 0;
	
	Если ЗначениеЗаполнено(Док.ЗаявкаНаТрейдИн) Тогда
		// начало изменения Зеленчук
		// ЦенаВыкупа = Док.ЗаявкаНаТрейдИн.ЦенаВыкупа;
		Ошибки = "";
		Поступление = Renault_СПробегомКлиент.ОформитьПокупкуАвтомобиля(Док.ЗаявкаНаТрейдИн, Ошибки);
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеАвтомобилейАвтомобили.Цена
		|ИЗ
		|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
		|ГДЕ
		|	ПоступлениеАвтомобилейАвтомобили.Ссылка = &Ссылка
		|	И ПоступлениеАвтомобилейАвтомобили.Автомобиль = &Автомобиль";
		Запрос.УстановитьПараметр("Ссылка", Поступление.Ссылка);
		Запрос.УстановитьПараметр("Автомобиль", Док.ЗаявкаНаТрейдИН.Автомобиль); 
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		Если РезультатЗапроса.Следующий() Тогда
			ДополнительныеПараметры.ЦенаВыкупа = РезультатЗапроса.Цена
		Иначе
			ДополнительныеПараметры.ЦенаВыкупа = ?(Док.ЗаявкаНаТрейдИн.ЦенаВыкупа = 0, Док.ЗаявкаНаТрейдИн.ОриентировочнаяЦена, Док.ЗаявкаНаТрейдИн.ЦенаВыкупа);
		КонецЕсли; 
		// окончание изменения Зеленчук
	КонецЕсли;
	
	Если Док.ТрейдИн Тогда
		БазовыеОпции = ПолучитьБазовыеОпцииТрейдИн (СтрСостав.Конфигурация.Автомобиль.VIN);
	Иначе
		БрендLADA = (ИмяМакета = "ПФ_MXL_КП_LADA");
		БазовыеОпции = ПолучитьБазовыеОпции(СтрСостав.Конфигурация.Модель, СтрСостав.Конфигурация.Версия, ДополнительныеПараметры.Тариф, БрендLADA);
	КонецЕсли;
	
	БазовыеОпцииСп = Новый СписокЗначений;
	БазовыеОпцииСп.ЗагрузитьЗначения(БазовыеОпции);
	БазовыеОпцииСп.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	
	БазовыеОпции = Новый Массив;
	БазовыеОпции = БазовыеОпцииСп.ВыгрузитьЗначения();
	
	Обл = Макет.ПолучитьОбласть("БазоваяОпция");
	Если НЕ БазовыеОпции = Неопределено Тогда
		ВсегоБазовыхОпций = БазовыеОпции.Количество();
	Иначе
		ВсегоБазовыхОпций = 0;
	КонецЕсли;
	
	Если ИмяМакета = "ПФ_MXL_КП_LADA" Тогда
		Для Каждого Стр из БазовыеОпции Цикл
			Обл.Параметры.БазоваяОпция1 = Стр;
			ТабДок.Вывести(Обл);
		КонецЦикла;
	Иначе
		Номер = 0;
		
		Влезает = 50;
		Индекс = 0;
		СледующуюСтрокуПропускаем = Ложь;
		
		Пока Индекс <> БазовыеОпции.Количество() Цикл
			
			СтрокаЭлемента = БазовыеОпции[Индекс];
			ДлинаСтроки = СтрДлина(СтрокаЭлемента);
			
			Если ДлинаСтроки > Влезает Тогда
				
				//Нужно делить строку
				
				//Ищем пробел с конца строки
				НайденныйСимвол = "";
				Инд1 = ДлинаСтроки - Влезает; //индекс пробела по которому делим строки
				Пока НайденныйСимвол <> " " Цикл
					НайденныйСимвол = Сред(СтрокаЭлемента, СтрДлина(СтрокаЭлемента)- Инд1, 1);
					Инд1 = Инд1 + 1;
				КонецЦикла;
				
				//Получим левую часть и запишем ее в массив
				
				Если СледующуюСтрокуПропускаем Тогда
					ЛеваяЧасть = "   " + СокрЛП(Лев(СтрокаЭлемента, ДлинаСтроки - Инд1));
				Иначе
					ЛеваяЧасть = "- " + СокрЛП(Лев(СтрокаЭлемента, ДлинаСтроки - Инд1));
				КонецЕсли;
				
				БазовыеОпции[Индекс] = ЛеваяЧасть;
				
				//Получим правую часть и запишем ее в массив
				
				ПраваяЧасть = " " + СокрЛП(Сред(СтрокаЭлемента, СтрДлина(СтрокаЭлемента) - Инд1 + 1));
				БазовыеОпции.Вставить(Индекс+1, "  " + ПраваяЧасть);
				СледующуюСтрокуПропускаем = Истина;
				
			Иначе
				Если СледующуюСтрокуПропускаем Тогда
					СледующуюСтрокуПропускаем = Ложь; //Эта строка - права часть предыдущей строки
				Иначе
					БазовыеОпции[Индекс] = "- " + БазовыеОпции[Индекс];
				КонецЕсли;
			КонецЕсли;
			Индекс = Индекс + 1;
		КонецЦикла;
		
		//разделим опции на 2 массива
		ПервыйМассив = Новый Массив;
		ВторойМассив = Новый Массив;
		Для Индекс = 0 По БазовыеОпции.Количество() - 1 Цикл
			Если Индекс < Окр((БазовыеОпции.Количество()) / 2) Тогда
				ПервыйМассив.Добавить(БазовыеОпции[Индекс]);
			Иначе
				ВторойМассив.Добавить(БазовыеОпции[Индекс]);
			КонецЕсли;
		КонецЦикла;
		
		Если ПервыйМассив.Количество() >= ВторойМассив.Количество() Тогда
			БольшийИндекс = ПервыйМассив.ВГраница();
		Иначе
			БольшийИндекс = ВторойМассив.ВГраница();
		КонецЕсли;
		
		Для Индекс = 0 По БольшийИндекс Цикл
			
			Если Индекс+1 <= ПервыйМассив.Количество() Тогда
				Обл.Параметры.БазоваяОпция1 = ПервыйМассив[Индекс];
			Иначе
				Обл.Параметры.БазоваяОпция1 = "";
			КонецЕсли;
			
			Если Индекс+1 <= ВторойМассив.Количество() Тогда
				Обл.Параметры.БазоваяОпция2 = ВторойМассив[Индекс];
			Иначе
				Обл.Параметры.БазоваяОпция2 = "";
			КонецЕсли;
			
			ТабДок.Вывести(Обл);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиДополнительныеОпции(Док, Макет, ТабДок, СтрСостав, ИмяМакета, ПроцентСкидки, ДополнительныеПараметры)
	
	ДополнительныеПараметры.СуммаСкидки = Док.Состав.Итог("СуммаСкидки");
	ДополнительныеПараметры.ЦенаВерсии = СтрСостав.Конфигурация.ЦенаВерсии + СтрСостав.Конфигурация.СуммаДоставки;
	ДанныеКонфигурации = ДополнительныеПараметры.ДанныеКонфигурации;
	
	МассивОбластей = Новый Массив();
	
	//Доп.опции
	
	ДополнительныеПараметры.СуммаДопИтого = 0;
	
	Если СтрСостав.Конфигурация.Опции.Количество() > 0 ИЛИ СтрСостав.Конфигурация.Оборудование.Количество() > 0 Тогда
		Обл = Макет.ПолучитьОбласть("ДопОпцииШапка");
		Если НЕ Неопределено = ДанныеКонфигурации Тогда
			Обл.Параметры.Заполнить(ДанныеКонфигурации);
		КонецЕсли;
		ДополнительныеПараметры.СуммаДопИтого = СтрСостав.Конфигурация.Оборудование.Итог("Сумма") + СтрСостав.Конфигурация.Опции.Итог("Цена");
		
		//Обл.Параметры.ЦенаДопОборудования = "Сумма с НДС: " + Строка(СуммаДопИтого) + " руб.";
		МассивОбластей.Добавить(Обл);
		
		Если Не Док.ТрейдИн Тогда
			Для Каждого ДопОпция Из СтрСостав.Конфигурация.Опции Цикл
				Обл = Макет.ПолучитьОбласть("ДопОпция");
				Обл.Параметры.Заполнить(ДопОпция);
				//DMSREN-870
				//Обл.Параметры.Опция = "- " + ДопОпция.Опция.НаименованиеПолное;
				Обл.Параметры.Опция = "- " + ДопОпция.НаименованиеОпции;
				Если ДопОпция.Цена = 0 Тогда
					Обл.Параметры.Цена = "0";
				КонецЕсли;
				МассивОбластей.Добавить(Обл);
			КонецЦикла;
		КонецЕсли;
		
		Для Каждого ДопОпция Из СтрСостав.Конфигурация.Оборудование Цикл
			Обл = Макет.ПолучитьОбласть("ДопОпция");
			Обл.Параметры.Опция = "- " + ДопОпция.Номенклатура;
			Обл.Параметры.Цена = ДопОпция.Сумма;
			Если ДопОпция.Сумма = 0 Тогда
				Обл.Параметры.Цена = "0";
			КонецЕсли;
			МассивОбластей.Добавить(Обл);
		КонецЦикла;
	КонецЕсли;
	
	
	
	Если ИмяМакета = "ПФ_MXL_КП_КОРП" Тогда
		
		//Итого
		СуммаИтого = ДополнительныеПараметры.ЦенаВерсии + ДополнительныеПараметры.СуммаДопИтого;
		Обл = Макет.ПолучитьОбласть("Итого");
		Обл.Параметры.ИтогоЗаголовок = "Итого коммерческое предложение";
		Обл.Параметры.ЦенаИтого = Строка(СуммаИтого) + " руб. (с НДС)";
		МассивОбластей.Добавить(Обл); 
		
		Обл = Макет.ПолучитьОбласть("СкидкаПроцент");
		
		Если ПроцентСкидки <> 0 ИЛИ ДополнительныеПараметры.СуммаСкидки <> 0 Тогда
			
			СуммаИтогоСоСкидкой = СуммаИтого - СтрСостав.Конфигурация.СуммаСкидки;
			
			// Зате добавляем скидку введенную пользователем
			СуммаИтогоСоСкидкой = СуммаИтогоСоСкидкой - СуммаИтогоСоСкидкой * (ПроцентСкидки) / 100;
			
			ПроцентСкидки = (1 - СуммаИтогоСоСкидкой / СуммаИтого) * 100;
			СуммаСкидка = СуммаИтого - СуммаИтогоСоСкидкой;
			
			Обл.Параметры.СуммаСкидка = "Скидка " + Формат(ПроцентСкидки, "ЧДЦ=2") + "%: " + Формат(СуммаСкидка, "ЧДЦ=2; ЧГ=3,0") + " руб.";
			МассивОбластей.Добавить(Обл);
			
			Обл = Макет.ПолучитьОбласть("Скидка");
			Обл.Параметры.СкидкаЗаголовок = "Итого коммерческое предложение со скидкой " + Формат(ПроцентСкидки, "ЧДЦ=2") + "%";
			Обл.Параметры.ЦенаСкидка = Формат(СуммаИтогоСоСкидкой, "ЧДЦ=2; ЧГ=3,0") + " руб. (с НДС)";
			МассивОбластей.Добавить(Обл);
			
		КонецЕсли;
		
	Иначе
		
		Если ДополнительныеПараметры.СуммаСкидки <> 0 Тогда
			//Предворительный Итог
			СуммаИтого = ДополнительныеПараметры.ЦенаВерсии + ДополнительныеПараметры.СуммаДопИтого;
			Обл = Макет.ПолучитьОбласть("Итого");
			Обл.Параметры.ИтогоЗаголовок = "Итого коммерческое предложение (без скидок)";
			Обл.Параметры.ЦенаИтого = Строка(СуммаИтого) + " руб. (с НДС)";
			МассивОбластей.Добавить(Обл);
		КонецЕсли;  
		
		АкцииВСкидке = Новый Массив;
		
		ПрименятьКоммерческиеАкцииRenault = ДополнительныеПараметры.ДилЦентр.ПрименятьКоммерческиеАкцииRenault;
				
		УИДКонфигурации = Строка(СтрСостав.Конфигурация.УникальныйИдентификатор());					
		Отбор = Новый Структура("ИдентификаторКонфигурации", УИДКонфигурации);					
		КПСкидки = Док.СкидкиКонфигурации.НайтиСтроки(Отбор);
		
		Если КПСкидки.Количество() > 0 Тогда
			ОблСкидкиЗаголовок = Макет.ПолучитьОбласть("СкидкиЗаголовок");
			ОблСкидкиСтрока = Макет.ПолучитьОбласть("СкидкиСтрока");
			ОблСкидкиАкции = Макет.ПолучитьОбласть("СкидкиАкции");
			
			ОблСкидкиЗаголовок.Параметры.СкидкаИтого = "" + ?(ЗначениеЗаполнено(ДополнительныеПараметры.СуммаСкидки), Формат(ДополнительныеПараметры.СуммаСкидки, "ЧЦ=15; ЧДЦ=0"), "0") + " руб.";
			МассивОбластей.Добавить(ОблСкидкиЗаголовок);
			
			ТипСкидки_Renault = Справочники.ТипыСкидок.НайтиПоКоду("RenltCA");
			
			Для Каждого СтрокаСкидки Из КПСкидки Цикл
				Если ПрименятьКоммерческиеАкцииRenault
					И СтрокаСкидки.ТипСкидки = ТипСкидки_Renault Тогда	
					ОблСкидкиСтрока.Параметры.СкидкаНаименование = СтрокаСкидки.Акция.Наименование + " - " + ?(ЗначениеЗаполнено(СтрокаСкидки.СуммаСкидки), Формат(СтрокаСкидки.СуммаСкидки, "ЧЦ=15; ЧДЦ=0"), "0") + " руб.";
					МассивОбластей.Добавить(ОблСкидкиСтрока);								
				Иначе	
					ОблСкидкиСтрока.Параметры.СкидкаНаименование = СтрокаСкидки.ТипСкидки.Наименование + " - " + ?(ЗначениеЗаполнено(СтрокаСкидки.СуммаСкидки), Формат(СтрокаСкидки.СуммаСкидки, "ЧЦ=15; ЧДЦ=0"), "0") + " руб.";
					МассивОбластей.Добавить(ОблСкидкиСтрока);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;					
		
		
		//Итого
		СуммаИтого = ДополнительныеПараметры.ЦенаВерсии + ДополнительныеПараметры.СуммаДопИтого - ДополнительныеПараметры.СуммаСкидки;
		Обл = Макет.ПолучитьОбласть("Итого");
		Обл.Параметры.ИтогоЗаголовок = "Итого коммерческое предложение";
		Обл.Параметры.ЦенаИтого = Строка(СуммаИтого) + " руб. (с НДС)";
		МассивОбластей.Добавить(Обл);
	КонецЕсли;
	
	
	//Подвал
	
	//Если НЕ ТабДок.ПроверитьВывод(МассивОбластей) Тогда
	//	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	//КонецЕсли;
	
	Для Каждого ЭлементМассиваОбласть Из МассивОбластей Цикл
		ТабДок.Вывести(ЭлементМассиваОбласть);
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиФинансовыеПродукты(Док, Макет, ТабДок, ИмяМакета, ДополнительныеПараметры)
	
	ТекущаяКонфигурация = ДополнительныеПараметры.ТекущаяКонфигурация;
	
	Область_ПодвалСтр4 = Макет.ПолучитьОбласть("ПодвалСтр4");
	
	Область_ПодвалСтр4_Выведен = Ложь;
	
	Область_Итого = Макет.ПолучитьОбласть("Итого");
	Область_Итого.Параметры.ИтогоЗаголовок = "Итого коммерческое предложение, вкл. доп. продукты";
	
	МассивОбластей = Новый Массив();
	
	ЦенаГарантии = 0;
	
	Если Док.ТипКП = Перечисления.Renault_ТипКП.НовыйАвтомобиль Тогда
		//Продленная гарантия
		
		Если ИмяМакета = "ПФ_MXL_КП_LADA" Тогда
			Если ЗначениеЗаполнено(ТекущаяКонфигурация.ПродленнаяГарантия) Тогда
				ЦенаГарантии = ТекущаяКонфигурация.ГарантияСумма;
			КонецЕсли;
		Иначе
			Обл = Макет.ПолучитьОбласть("ПродленнаяГарантия");
			Если ЗначениеЗаполнено(ТекущаяКонфигурация.ПродленнаяГарантия) Тогда
				Обл.Параметры.ЦенаИтого = Строка(ТекущаяКонфигурация.ГарантияСумма) + " руб. (с НДС)";
				Обл.Параметры.ПродленнаяГарантияЗаголовок = "Renault EXTRA (Рено Экстра)"+Символы.ПС+"Постгарантийное сервисное обслуживание";
				Обл.Параметры.ГарантияТекст = "Простое решение для комфортного вождения";
				ЦенаГарантии = ТекущаяКонфигурация.ГарантияСумма;
			Иначе 
				Обл.Параметры.ЦенаИтого = "Обратитесь к вашему менеджеру";
				Обл.Параметры.ПродленнаяГарантияЗаголовок = "Renault EXTRA (Рено Экстра)"+Символы.ПС+"Постгарантийное сервисное обслуживание";
				Обл.Параметры.ГарантияТекст = "Простое решение для комфортного вождения";
			КонецЕсли;
			
			Если НЕ Область_ПодвалСтр4_Выведен Тогда
				МассивОбластей.Добавить(Область_ПодвалСтр4);
			КонецЕсли;
			МассивОбластей.Добавить(Обл);
			МассивОбластей.Добавить(Область_Итого);
			Если НЕ ТабДок.ПроверитьВывод(МассивОбластей) Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			МассивОбластей.Очистить();
			Если НЕ Область_ПодвалСтр4_Выведен Тогда
				ТабДок.Вывести(Область_ПодвалСтр4);
				Область_ПодвалСтр4_Выведен = Истина;
			КонецЕсли;
			
			ТабДок.Вывести(Обл);
		КонецЕсли;
		
		// --- DMSREN-1156
		Если ИмяМакета = "ПФ_MXL_КП" тогда
			Обл = Макет.ПолучитьОбласть("СервисныйКонтракт");
			если ЗначениеЗаполнено(ТекущаяКонфигурация.СервисныеКонтрактыСумма) тогда
				Обл.Параметры.ЦенаИтого = строка(ТекущаяКонфигурация.СервисныеКонтрактыСумма) + " руб. (с НДС)";
			иначе
				Обл.Параметры.ЦенаИтого = "Обратитесь к вашему менеджеру";
			КонецЕсли;
			
			Если НЕ Область_ПодвалСтр4_Выведен Тогда
				МассивОбластей.Добавить(Область_ПодвалСтр4);
			КонецЕсли;
			МассивОбластей.Добавить(Обл);
			МассивОбластей.Добавить(Область_Итого);
			Если НЕ ТабДок.ПроверитьВывод(МассивОбластей) Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			МассивОбластей.Очистить();
			Если НЕ Область_ПодвалСтр4_Выведен Тогда
				ТабДок.Вывести(Область_ПодвалСтр4);
				Область_ПодвалСтр4_Выведен = Истина;
			КонецЕсли;
			
			ТабДок.Вывести(Обл);
			
			Обл = Макет.ПолучитьОбласть("ПомощьНаДорогах");
			если ЗначениеЗаполнено(ТекущаяКонфигурация.ПомощьНаДорогахСумма) тогда
				Обл.Параметры.ЦенаИтого = строка(ТекущаяКонфигурация.ПомощьНаДорогахСумма) + " руб. (с НДС)";
			иначе
				Обл.Параметры.ЦенаИтого = "Обратитесь к вашему менеджеру";
			КонецЕсли;
			
			Если НЕ Область_ПодвалСтр4_Выведен Тогда
				МассивОбластей.Добавить(Область_ПодвалСтр4);
			КонецЕсли;
			МассивОбластей.Добавить(Обл);
			МассивОбластей.Добавить(Область_Итого);
			Если НЕ ТабДок.ПроверитьВывод(МассивОбластей) Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			МассивОбластей.Очистить();
			Если НЕ Область_ПодвалСтр4_Выведен Тогда
				ТабДок.Вывести(Область_ПодвалСтр4);
				Область_ПодвалСтр4_Выведен = Истина;
			КонецЕсли;
			
			ТабДок.Вывести(Обл);
		КонецЕсли;
		// DMSREN-1156 ---
		
		Требуется_ФинансовыеСервисыРеклама = Ложь;
		
		//Кредит
		ДанныеПоКредиту = ПолучитьДанныеПоКредиту(Док.РабочийЛист);
		Если ДанныеПоКредиту.Следующий() Тогда
			Обл = Макет.ПолучитьОбласть("Кредит");
			ЗаполнитьЗначенияСвойств(Обл.Параметры, ДанныеПоКредиту);
			Обл.Параметры.КредитЗаголовок = "Предварительный расчет кредита";
			
			Если НЕ Область_ПодвалСтр4_Выведен Тогда
				МассивОбластей.Добавить(Область_ПодвалСтр4);
			КонецЕсли;
			МассивОбластей.Добавить(Обл);
			МассивОбластей.Добавить(Область_Итого);
			Если НЕ ТабДок.ПроверитьВывод(МассивОбластей) Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			МассивОбластей.Очистить();
			Если НЕ Область_ПодвалСтр4_Выведен Тогда
				ТабДок.Вывести(Область_ПодвалСтр4);
				Область_ПодвалСтр4_Выведен = Истина;
			КонецЕсли;
			
			ТабДок.Вывести(Обл);
			//ИначеЕсли ИмяМакета = "ПФ_MXL_КП" Тогда
			//	Обл = Макет.ПолучитьОбласть("RCIРеклама");
			//	ТабДокумент.Вывести(Обл);
		Иначе
			Требуется_ФинансовыеСервисыРеклама = Истина;
		КонецЕсли;
		
		//Страхование
		Если ТекущаяКонфигурация.СтраховкаСумма > 0 Тогда
			Обл = Макет.ПолучитьОбласть("Страхование");
			ЗаполнитьЗначенияСвойств(Обл.Параметры, ТекущаяКонфигурация);
			Обл.Параметры.СтрахованиеЗаголовок = "Предварительный расчет страхования автомобиля";
			
			Если НЕ Область_ПодвалСтр4_Выведен Тогда
				МассивОбластей.Добавить(Область_ПодвалСтр4);
			КонецЕсли;
			МассивОбластей.Добавить(Обл);
			МассивОбластей.Добавить(Область_Итого);
			Если НЕ ТабДок.ПроверитьВывод(МассивОбластей) Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			МассивОбластей.Очистить();
			Если НЕ Область_ПодвалСтр4_Выведен Тогда
				ТабДок.Вывести(Область_ПодвалСтр4);
				Область_ПодвалСтр4_Выведен = Истина;
			КонецЕсли;
			
			ТабДок.Вывести(Обл);
			//Иначе
			//	Обл = Макет.ПолучитьОбласть("КаскоРеклама");
			//	ТабДокумент.Вывести(Обл);
		Иначе
			Требуется_ФинансовыеСервисыРеклама = Истина;
		КонецЕсли;
		
		Если ИмяМакета = "ПФ_MXL_КП" И Требуется_ФинансовыеСервисыРеклама Тогда
			Обл = Макет.ПолучитьОбласть("ФинансовыеСервисыРеклама");
			
			Если НЕ Область_ПодвалСтр4_Выведен Тогда
				МассивОбластей.Добавить(Область_ПодвалСтр4);
			КонецЕсли;
			МассивОбластей.Добавить(Обл);
			МассивОбластей.Добавить(Область_Итого);
			Если НЕ ТабДок.ПроверитьВывод(МассивОбластей) Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			МассивОбластей.Очистить();
			Если НЕ Область_ПодвалСтр4_Выведен Тогда
				ТабДок.Вывести(Область_ПодвалСтр4);
				Область_ПодвалСтр4_Выведен = Истина;
			КонецЕсли;
			
			ТабДок.Вывести(Обл);
		КонецЕсли;
	КонецЕсли;
	
	//ТрейдИн
	ЗаявкаНаТрейдИн = Док.ЗаявкаНаТрейдИн;
	Если ЗначениеЗаполнено(ЗаявкаНаТрейдин) Тогда
		Обл = Макет.ПолучитьОбласть("ТрейдИн");
		Обл.Параметры.ТрейдИнМодель = "" + ЗаявкаНаТрейдин.ПроизводительКод + " " + ЗаявкаНаТрейдин.МодельКод;
		Обл.Параметры.ТрейдИнВерсия = ЗаявкаНаТрейдин.МодификацияКод;
		Обл.Параметры.ТрейдИнЦвет = ЗаявкаНаТрейдин.Цвет;
		Обл.Параметры.ТрейдИнГодВыпуска = ЗаявкаНаТрейдин.ГодВыпуска;
		Обл.Параметры.ТрейдИнСумма = ДополнительныеПараметры.ЦенаВыкупа;
		Обл.Параметры.ТрейдИнЗаголовок = "Предварительный расчет условий трейд-ин";
		
		Если НЕ Область_ПодвалСтр4_Выведен Тогда
			МассивОбластей.Добавить(Область_ПодвалСтр4);
		КонецЕсли;
		МассивОбластей.Добавить(Обл);
		МассивОбластей.Добавить(Область_Итого);
		Если НЕ ТабДок.ПроверитьВывод(МассивОбластей) Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		МассивОбластей.Очистить();
		Если НЕ Область_ПодвалСтр4_Выведен Тогда
			ТабДок.Вывести(Область_ПодвалСтр4);
			Область_ПодвалСтр4_Выведен = Истина;
		КонецЕсли;
		
		ТабДок.Вывести(Обл);
	КонецЕсли;
	
	//Итого
	СуммаИтого = 
		ДополнительныеПараметры.ЦенаВерсии + ДополнительныеПараметры.СуммаДопИтого + ЦенаГарантии + ТекущаяКонфигурация.СтраховкаСумма - 
		ДополнительныеПараметры.СуммаСкидки - ДополнительныеПараметры.ЦенаВыкупа + ТекущаяКонфигурация.СервисныеКонтрактыСумма + ТекущаяКонфигурация.ПомощьНаДорогахСумма;
		
	Область_Итого.Параметры.ЦенаИтого = Строка(СуммаИтого) + " руб. (с НДС)";
	ТабДок.Вывести(Область_Итого);
		
КонецПроцедуры

#Область ПечатьКПЛада

Процедура ПечатьКПЛада(МассивОбъектов, ТабДокумент, ПроцентСкидки = 0, ТипыАвтомобилей = Неопределено)
	
	ДокКП = МассивОбъектов[0];
	СуммаСкидки = ДокКП.Состав.Итог("СуммаСкидки");
	ИмяМакета = "LADA_ПФ_MXL_КП";
	Макет = ПолучитьМакет(ИмяМакета);
	
	Для Каждого Док Из МассивОбъектов Цикл	
		
		ДанныеШапки = ПолучитьДанныеШапки(Док);
		Для Каждого СтрСостав Из Док.Состав Цикл
			
			ТекущаяКонфигурация = СтрСостав.Конфигурация.ПолучитьОбъект();
			Если Не ЗначениеЗаполнено(Док.Тариф) Тогда
				Тариф = Renault_CRM.ПолучитьПоследнийТарифНаАвтомобиль(ТекущаяКонфигурация.Версия);
			Иначе
				Тариф = Док.Тариф;
			КонецЕсли;
			
			//Шапка
			Обл = Макет.ПолучитьОбласть("Шапка");
			
			Запрос = Новый Запрос("Выбрать Город Из РегистрСведений.CRM_КлиентскиеДанные ГДЕ Клиент=&Клиент");
			Запрос.УстановитьПараметр("Клиент",Док.Клиент);
			Выборка = Запрос.Выполнить().Выбрать();
			
			ДилЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
			Обл.Параметры.НаименованиеДЦ = ДилЦентр;
			
			Если НЕ Неопределено = ДанныеШапки Тогда
				Обл.Параметры.Заполнить(ДанныеШапки);
				Обл.Параметры.кФамилия = ДанныеШапки.НаименованиеКлиента;
				Обл.Параметры.НаименованиеДЦ = ДанныеШапки.НаименованиеОрганизации;
				
				ТелефонКлиента = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(ДанныеШапки.Клиент);
				Обл.Параметры.кТелефон = ?(ЗначениеЗаполнено(ТелефонКлиента), "Тел. " + ТелефонКлиента, "<Телефон не указан>");
				
				Обл.Параметры.дТелефон = "Тел. " + ДанныеШапки.ТелефонОрганизации;
				
				ПочтаКлиента = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(ДанныеШапки.Клиент);
				Обл.Параметры.кЕмайл = ?(ЗначениеЗаполнено(ТелефонКлиента), "Email: " + ПочтаКлиента, "<Email не указан>");
				
				Обл.Параметры.АдресДЦ = ДанныеШапки.АдресОрганизации;
				
			КонецЕсли;
			
			ТелефонМенеджера = ПолучитьКонтакт(ДанныеШапки.КонтактноеЛицо, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
			ПочтаМенеджера = ПолучитьКонтакт(ДанныеШапки.КонтактноеЛицо, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
			
			Обл.Параметры.мФамилия = ДанныеШапки.КонтактноеЛицо;
			Обл.Параметры.мТелефон = ТелефонМенеджера;
			Обл.Параметры.мЕмайл = ПочтаМенеджера;
			
			ТабДокумент.Вывести(Обл);
			
			//Коммерческое предложение
			ДанныеКонфигурации = ПолучитьДанныеКонфигурации(СтрСостав.Конфигурация, Тариф);
			Обл = Макет.ПолучитьОбласть("КП");
			
			Если НЕ Неопределено = ДанныеКонфигурации Тогда
				
				Обл.Параметры.Модель = ?(ЗначениеЗаполнено(ДанныеКонфигурации.Модель), ДанныеКонфигурации.Модель, "<Не указана>"); 
				Обл.Параметры.Версия = ?(ЗначениеЗаполнено(ДанныеКонфигурации.Версия), ДанныеКонфигурации.Версия, "<Не указана>"); 
				Обл.Параметры.Цвет = ?(ЗначениеЗаполнено(ДанныеКонфигурации.Цвет), ДанныеКонфигурации.Цвет + " (" + ДанныеКонфигурации.КодЦвета + ")", "<Не указан>"); 
				Обл.Параметры.Объем = ?(ЗначениеЗаполнено(ДанныеКонфигурации.Объем), Строка(ДанныеКонфигурации.Объем) + " см3", "<Не указан>"); 
				
				Двигатель_КВТ = ?(ЗначениеЗаполнено(ДанныеКонфигурации.Двигатель_КВТ), Строка(ДанныеКонфигурации.Двигатель_КВТ), "<Не указана>");
				ДвигательЛС = ?(ЗначениеЗаполнено(ДанныеКонфигурации.ДвигательЛС), Строка(ДанныеКонфигурации.ДвигательЛС), "<Не указана>");
				Обл.Параметры.Мощность = ДвигательЛС + " (" + Двигатель_КВТ + ") л.с.(кВт)";
				
			КонецЕсли;
			
			Обл.Параметры.ДатаКП = Формат(Док.Дата, "ДФ=dd.MM.yyyy");
			
			МенеджерИдентификатор = РегистрыСведений.CRM_ИдентификаторыКартинок.СоздатьМенеджерЗаписи();
			МенеджерИдентификатор.Модель = СтрСостав.Конфигурация.Модель;
			МенеджерИдентификатор.Цвет = СтрСостав.Конфигурация.Цвет;
			МенеджерИдентификатор.ВариантКомплектации = СтрСостав.Конфигурация.Версия;
			МенеджерИдентификатор.Прочитать();
			Если НЕ МенеджерИдентификатор.Выбран() Тогда
				МенеджерИдентификатор.Модель = СтрСостав.Конфигурация.Модель;
				МенеджерИдентификатор.ВариантКомплектации = СтрСостав.Конфигурация.Версия;
				МенеджерИдентификатор.Прочитать();
			КонецЕсли;
			Если НЕ МенеджерИдентификатор.Выбран() Тогда
				МенеджерИдентификатор.Модель = СтрСостав.Конфигурация.Модель;
				МенеджерИдентификатор.Цвет = СтрСостав.Конфигурация.Цвет;
				МенеджерИдентификатор.Прочитать();
			КонецЕсли;
			Если НЕ МенеджерИдентификатор.Выбран() Тогда
				МенеджерИдентификатор.Модель = СтрСостав.Конфигурация.Модель;
				МенеджерИдентификатор.Прочитать();
			КонецЕсли;
			Если МенеджерИдентификатор.Выбран() Тогда
				МенеджерКартинка = РегистрыСведений.КартинкиИФайлы.СоздатьМенеджерЗаписи();
				МенеджерКартинка.Объект = СтрСостав.Конфигурация.Модель;
				МенеджерКартинка.Идентификатор = МенеджерИдентификатор.Идентификатор;
				МенеджерКартинка.Прочитать();
				Картинка = МенеджерКартинка.Данные.Получить();
				Если ТипЗнч(Картинка) = Тип("Картинка") Тогда
					Обл.Рисунки.D1.Картинка = МенеджерКартинка.Данные.Получить();
				КонецЕсли;
			КонецЕсли;
			ТабДокумент.Вывести(Обл);
			
			//Состав комплектации
			Обл = Макет.ПолучитьОбласть("СоставКомплектацииШапка");
			Обл.Параметры.СоставКомплектации = ДанныеКонфигурации.Версия + " / " + ДанныеКонфигурации.КодМодели + "-" + ДанныеКонфигурации.КодВерсии; 
			
			Массив = Новый Массив;
			Массив.Добавить(Обл);
			ПроверитьВывестиПодвалСтраницыLADA(ТабДокумент, Макет, Массив);
			
			ТабДокумент.Вывести(Обл);
			
			ЦенаВерсии = СтрСостав.Конфигурация.ЦенаВерсии + СтрСостав.Конфигурация.СуммаДоставки;
			
			ЦенаВыкупа = 0;
			
			Если ЗначениеЗаполнено(Док.ЗаявкаНаТрейдИн) Тогда
				ЦенаВыкупа = ?(Док.ЗаявкаНаТрейдИн.ЦенаВыкупа = 0, Док.ЗаявкаНаТрейдИн.ОриентировочнаяЦена, Док.ЗаявкаНаТрейдИн.ЦенаВыкупа);
			КонецЕсли;
			
			Если Док.ТрейдИн Тогда
				БазовыеОпции = ПолучитьБазовыеОпцииТрейдИн (СтрСостав.Конфигурация.Автомобиль.VIN);
			Иначе
				БазовыеОпции = ПолучитьБазовыеОпции(СтрСостав.Конфигурация.Модель, СтрСостав.Конфигурация.Версия, Тариф, Истина);
			КонецЕсли;
			
			БазовыеОпцииСп = Новый СписокЗначений;
			БазовыеОпцииСп.ЗагрузитьЗначения(БазовыеОпции);
			БазовыеОпцииСп.СортироватьПоЗначению(НаправлениеСортировки.Возр);
			
			БазовыеОпции = Новый Массив;
			БазовыеОпции = БазовыеОпцииСп.ВыгрузитьЗначения();
			
			Обл = Макет.ПолучитьОбласть("СтрокаСоставКомплектация");
			Если НЕ БазовыеОпции = Неопределено Тогда
				ВсегоБазовыхОпций = БазовыеОпции.Количество();
			Иначе
				ВсегоБазовыхОпций = 0;
			КонецЕсли;
			
			Номер = 0;
			
			Влезает = 50;
			Индекс = 0;
			СледующуюСтрокуПропускаем = Ложь;
			
			Пока Индекс <> БазовыеОпции.Количество() Цикл
				
				СтрокаЭлемента = БазовыеОпции[Индекс];
				ДлинаСтроки = СтрДлина(СтрокаЭлемента);
				
				Если ДлинаСтроки > Влезает Тогда
					
					//Нужно делить строку
					
					//Ищем пробел с конца строки
					НайденныйСимвол = "";
					Инд1 = ДлинаСтроки - Влезает; //индекс пробела по которому делим строки
					Пока НайденныйСимвол <> " " Цикл
						НайденныйСимвол = Сред(СтрокаЭлемента, СтрДлина(СтрокаЭлемента)- Инд1, 1);
						Инд1 = Инд1 + 1;
					КонецЦикла;
					
					//Получим левую часть и запишем ее в массив
					ЛеваяЧасть = "• " + СокрЛП(Лев(СтрокаЭлемента, ДлинаСтроки - Инд1));
					БазовыеОпции[Индекс] = ЛеваяЧасть;
					
					//Получим правую часть и запишем ее в массив
					ПраваяЧасть = " " + СокрЛП(Сред(СтрокаЭлемента, СтрДлина(СтрокаЭлемента) - Инд1 + 1));
					БазовыеОпции.Вставить(Индекс+1, "  " + ПраваяЧасть);
					СледующуюСтрокуПропускаем = Истина;
					
				Иначе
					Если СледующуюСтрокуПропускаем Тогда
						СледующуюСтрокуПропускаем = Ложь; //Эта строка - правая часть предыдущей строки
					Иначе
						БазовыеОпции[Индекс] = "• " + БазовыеОпции[Индекс];
					КонецЕсли;
				КонецЕсли;
				Индекс = Индекс + 1;
			КонецЦикла;
			
			//разделим опции на 2 массива
			ПервыйМассив = Новый Массив;
			ВторойМассив = Новый Массив;
			Для Индекс = 0 По БазовыеОпции.Количество() - 1 Цикл
				Если Индекс < Окр((БазовыеОпции.Количество()) / 2) Тогда
					ПервыйМассив.Добавить(БазовыеОпции[Индекс]);
				Иначе
					ВторойМассив.Добавить(БазовыеОпции[Индекс]);
				КонецЕсли;
			КонецЦикла;
			
			Если ПервыйМассив.Количество() >= ВторойМассив.Количество() Тогда
				БольшийИндекс = ПервыйМассив.Количество();
			Иначе
				БольшийИндекс = ВторойМассив.Количество();
			КонецЕсли;
			
			Для Индекс = 0 По БольшийИндекс-1 Цикл
				
				Если Индекс+1 <= ПервыйМассив.Количество() Тогда
					Обл.Параметры.СоставГруппы = ПервыйМассив[Индекс];
				Иначе
					Обл.Параметры.СоставГруппы = "";
				КонецЕсли;
				
				Если Индекс+1 <= ВторойМассив.Количество() Тогда
					Обл.Параметры.СоставГруппы2 = ВторойМассив[Индекс];
				Иначе
					Обл.Параметры.СоставГруппы2 = "";
				КонецЕсли;
				
				Массив = Новый Массив;
				Массив.Добавить(Обл);
				ПроверитьВывестиПодвалСтраницыLADA(ТабДокумент, Макет, Массив);
				
				ТабДокумент.Вывести(Обл);
			КонецЦикла;
			
			СуммаДопИтого = 0;
			//Дополнительное оборудование
			Если СтрСостав.Конфигурация.Опции.Количество() > 0 ИЛИ СтрСостав.Конфигурация.Оборудование.Количество() > 0 Тогда
				
				Обл = Макет.ПолучитьОбласть("ШапкаДопОборудования");
				Массив = Новый Массив;
				Массив.Добавить(Обл);
				ПроверитьВывестиПодвалСтраницыLADA(ТабДокумент, Макет, Массив);
				ТабДокумент.Вывести(Обл);
				
				Если НЕ Неопределено = ДанныеКонфигурации Тогда
					Обл.Параметры.Заполнить(ДанныеКонфигурации);
				КонецЕсли;
				СуммаДопИтого = СтрСостав.Конфигурация.Оборудование.Итог("Сумма");
				
				Обл = Макет.ПолучитьОбласть("СтрокаДопОборудования");
				//Если Не Док.ТрейдИн Тогда
				//	Для Каждого ДопОпция Из СтрСостав.Конфигурация.Опции Цикл
				//		Обл.Параметры.Заполнить(ДопОпция);
				//		Обл.Параметры.ДополнительноеОборудование = ДопОпция.Опция.НаименованиеПолное;
				//		Если ДопОпция.Цена = 0 Тогда
				//			Обл.Параметры.ЦенаДО = "0"
				//		Иначе Обл.Параметры.ЦенаДО = Строка(ДопОпция.Цена) + " руб.";
				//		КонецЕсли;
				//		ТабДокумент.Вывести(Обл);
				//	КонецЦикла;
				//КонецЕсли;
				Для Каждого ДопОборудование Из СтрСостав.Конфигурация.Оборудование Цикл
					Обл.Параметры.ДополнительноеОборудование = ДопОборудование.Номенклатура;
					Обл.Параметры.ЦенаДО = Строка(ДопОборудование.Сумма) + " руб.";
					//Если ДопОпция.Сумма = 0 Тогда
					//	Обл.Параметры.ЦенаДО = "0 руб.";
					//КонецЕсли;
					Массив = Новый Массив;
					Массив.Добавить(Обл);
					ПроверитьВывестиПодвалСтраницыLADA(ТабДокумент, Макет, Массив);
					ТабДокумент.Вывести(Обл);
				КонецЦикла;
				
			КонецЕсли; 
			
			Массив = Новый Массив;
			
			Обл = Макет.ПолучитьОбласть("ШапкаВДопОборудования");
			Массив.Добавить(Обл);
			
			Обл = Макет.ПолучитьОбласть("СтрокаВДопОборудования");
			Обл.Параметры.ТекстВДО = "Рекомендованная стоимость";
			РекомендованнаяСтоимость = СтрСостав.Конфигурация.ЦенаВерсии + СтрСостав.Конфигурация.Опции.Итог("Цена") + СтрСостав.Конфигурация.СуммаДоставки;
			Обл.Параметры.ЦенаВДО = Строка(РекомендованнаяСтоимость) + " руб.";
			Массив.Добавить(Обл);
			
			////////
			ДоплатаЗаЦвет = 0;
			//Если ДоплатаЗаЦвет > 0 Тогда
			//	Обл = Макет.ПолучитьОбласть("СтрокаВДопОборудования");
			//	Обл.Параметры.ТекстВДО = "Доплата за цвет";
			//	Обл.Параметры.ЦенаВДО = ДоплатаЗаЦвет + " руб.";
			//	Массив.Добавить(Обл);
			//КонецЕсли;
			
			Если СуммаСкидки > 0 Тогда
				Обл = Макет.ПолучитьОбласть("СтрокаВДопОборудования");
				Обл.Параметры.ТекстВДО = "Скидка дилера";
				Обл.Параметры.ЦенаВДО = "" + СуммаСкидки + " руб.";
				Массив.Добавить(Обл);
			КонецЕсли;
			
			Если СуммаДопИтого > 0 Тогда
				Обл = Макет.ПолучитьОбласть("СтрокаВДопОборудования");
				Обл.Параметры.ТекстВДО = "Дополнительное оборудование";
				Обл.Параметры.ЦенаВДО = Строка(СуммаДопИтого) + " руб.";
				Массив.Добавить(Обл);
			КонецЕсли;
			
			Стоимость = РекомендованнаяСтоимость + ДоплатаЗаЦвет - СуммаСкидки + СуммаДопИтого;
			
			Обл = Макет.ПолучитьОбласть("ПодвалВДопОборудования");
			Обл.Параметры.Стоимость = Строка(Стоимость) + " руб.";
			
			Массив.Добавить(Обл);
			
			ПроверитьВывестиПодвалСтраницыLADA(ТабДокумент, Макет, Массив);
			
			Для Н = 0 По Массив.Количество() - 1 Цикл
				ТабДокумент.Вывести(Массив[Н]);
			КонецЦикла;
			
			//Программа трейд-ин
			Если ЗначениеЗаполнено(Док.ЗаявкаНаТрейдИН) Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	Renault_ЗаявкаНаТрейдИн.МодельКод КАК МодельКод,
				|	Renault_ЗаявкаНаТрейдИн.МодификацияКод КАК МодификацияКод,
				|	Renault_ЗаявкаНаТрейдИн.ДвигательКод КАК ДвигательКод,
				|	Renault_ЗаявкаНаТрейдИн.КППКод КАК КППКод,
				|	Renault_ЗаявкаНаТрейдИн.Цвет КАК Цвет,
				|	Renault_ЗаявкаНаТрейдИн.ГодВыпуска КАК ГодВыпуска,
				|	Renault_ЗаявкаНаТрейдИн.VIN КАК VIN
				|ИЗ
				|	Документ.Renault_ЗаявкаНаТрейдИн КАК Renault_ЗаявкаНаТрейдИн
				|ГДЕ
				|	Renault_ЗаявкаНаТрейдИн.Ссылка = &Ссылка";
				
				Запрос.Параметры.Вставить("Ссылка", Док.ЗаявкаНаТрейдИН);
				
				Выборка = Запрос.Выполнить().Выбрать();
				
				Если Выборка.Следующий() Тогда
					
					Обл = Макет.ПолучитьОбласть("ТрейдИн");
					
					Обл.Параметры.МодельТИ = Выборка.МодельКод;
					Обл.Параметры.КомплектацияТИ = Выборка.МодификацияКод;
					Обл.Параметры.ДвигательТИ = Выборка.ДвигательКод;
					Обл.Параметры.ТрансмиссияТИ = Выборка.КППКод;
					Обл.Параметры.ЦветТИ = Выборка.Цвет;
					Обл.Параметры.ГодВыпускаТИ = Выборка.ГодВыпуска;
					Обл.Параметры.ВинТИ = Выборка.VIN;
					
					Обл.Параметры.СуммаДоплатыТИ = Строка(СтрСостав.Сумма) + " руб.";
					Массив = Новый Массив;
					Массив.Добавить(Обл);
					ПроверитьВывестиПодвалСтраницыLADA(ТабДокумент, Макет, Массив);
					ТабДокумент.Вывести(Обл);
					
				КонецЕсли;
				
			КонецЕсли;
			
			//Кредитное предложение
			ДанныеПоКредиту = ПолучитьДанныеПоКредиту(ДокКП.РабочийЛист);
			Если ДанныеПоКредиту.Следующий() Тогда
				Обл = Макет.ПолучитьОбласть("Кредит");
				ЗаполнитьЗначенияСвойств(Обл.Параметры, ДанныеПоКредиту);
				Обл.Параметры.НаименованиеБанка = ДанныеПоКредиту.КредитноеПредложение.Владелец;
				Обл.Параметры.ПрограммаБанка = ДанныеПоКредиту.КредитноеПредложение;
				Обл.Параметры.ГодПТС = СтрСостав.Конфигурация.ГодВыпуска;
				Обл.Параметры.ИтоговаяСтоимостьКредита = Строка(Стоимость) + " руб.";
				Обл.Параметры.ПервоначальныйВзнос = "" + ДанныеПоКредиту.ПервоначальныйВзнос + " руб. (" + ДанныеПоКредиту.ПервоначальныйВзносПроцент + "%)";
				Обл.Параметры.СуммаКредита = ДанныеПоКредиту.СуммаКредита;
				Массив = Новый Массив;
				Массив.Добавить(Обл);
				ПроверитьВывестиПодвалСтраницыLADA(ТабДокумент, Макет, Массив);
				ТабДокумент.Вывести(Обл);
			КонецЕсли;
			
			//Продленная гарантия
			Обл = Макет.ПолучитьОбласть("Подвал");
			Массив = Новый Массив;
			Массив.Добавить(Обл);
			ПроверитьВывестиПодвалСтраницыLADA(ТабДокумент, Макет, Массив);
			ТабДокумент.Вывести(Обл);
			
			Обл = Макет.ПолучитьОбласть("ОбластьПустаяСтрока");
			Массив = Новый Массив;
			Массив.Добавить(Обл);
			ПроверитьВывестиПодвалСтраницыLADA(ТабДокумент, Макет, Массив, Истина);
			
			ТабДокумент.ВерхнийКолонтитул.НачальнаяСтраница = 1;
			ТабДокумент.ВерхнийКолонтитул.ТекстСлева = Формат(Док.Дата, "ДФ=dd.MM.yyyy");
			ТабДокумент.ВерхнийКолонтитул.ТекстВЦентре = "[&НомерСтраницы]/[&PagesTotal]";
			ТабДокумент.ВерхнийКолонтитул.ТекстСправа = "Персональное коммерческое предложение";
			ТабДокумент.ВерхнийКолонтитул.Выводить = Истина;
			
			ТабДокумент.ЧередованиеРасположенияСтраниц = ЧередованиеРасположенияСтраниц.НеИспользовать;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

//Процедура выводит нижний колонтитул
// Массив - массив проверяемых областей
// ПоследняяСтраница - булево, признак последней страницы
Процедура ПроверитьВывестиПодвалСтраницыLADA(ТабДокумент, Макет, Массив, ПоследняяСтраница = Ложь)
	
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ОбластьПустаяСтрока");
	ОбластьПодвал = Макет.ПолучитьОбласть("ПодвалСтраницы");
	
	Массив.Добавить(ОбластьПодвал);
	
	Если Не ПоследняяСтраница Тогда
		//Если вмещается проверяемая область + область колонтитула на страницу - ничего не делаем
		Если ТабДокумент.ПроверитьВывод(Массив) Тогда
			Массив.Удалить(Массив.ВГраница());
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	//Иначе дозаполним страницу пустыми строками вплоть до размера колонтитула
	пМассив = Новый Массив;
	пМассив.Добавить(ОбластьПустаяСтрока);
	пМассив.Добавить(ОбластьПодвал);
	
	Пока ТабДокумент.ПроверитьВывод(пМассив) Цикл
		ТабДокумент.Вывести(ОбластьПустаяСтрока);    
	КонецЦикла;
	ТабДокумент.Вывести(ОбластьПодвал);
	Массив.Удалить(Массив.ВГраница());
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭтоКорпоративныйРабочийЛист(КоммПредложение) Экспорт
	
	Запрос = Новый Запрос("Выбрать ТипКлиента Из РегистрСведений.Renault_РабочиеЛисты ГДЕ IDK=&IDK");
	Запрос.УстановитьПараметр("IDK", КоммПредложение.РабочийЛист);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ТипКлиента = Перечисления.Renault_ТипыКлиентов.КорпоративныйКлиент;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДанныеШапки(Док)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	CRM_КоммерческоеПредложение.Клиент.Наименование КАК НаименованиеКлиента,
	|	CRM_КоммерческоеПредложение.ДилерскийЦентр.НаименованиеДляПечати КАК НаименованиеОрганизации,
	|	CRM_КоммерческоеПредложение.ДилерскийЦентр.ОсновнойАдрес КАК АдресОрганизации,
	|	CRM_КоммерческоеПредложение.ДилерскийЦентр.ОсновнойТелефон КАК ТелефонОрганизации,
	|	CRM_КоммерческоеПредложение.ДилерскийЦентр.ОсновнойEmail КАК EmailОрганизации,
	|	CRM_КоммерческоеПредложение.Клиент,
	|	CRM_КоммерческоеПредложение.ДилерскийЦентр КАК Организация,
	|	CRM_КоммерческоеПредложение.Автор.Сотрудник КАК КонтактноеЛицо,
	|	CRM_КоммерческоеПредложение.СрокДействия,
	|	CRM_КоммерческоеПредложение.ДатаНачалаПередачиАвто,
	|	CRM_КоммерческоеПредложение.ДатаОкончанияПередачиАвто
	|ИЗ
	|	Документ.CRM_КоммерческоеПредложение КАК CRM_КоммерческоеПредложение
	|ГДЕ
	|	CRM_КоммерческоеПредложение.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Док);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДанныеКонфигурации(Конфигурация, Тариф)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	CRM_КонфигурацииАвтомобилей.Модель.Наименование КАК Модель,
	|	CRM_КонфигурацииАвтомобилей.Версия.Наименование КАК Версия,
	|	CRM_КонфигурацииАвтомобилей.Цвет.Наименование КАК Цвет,
	|	Renault_ДопИнформацияПоВерсиям.ОбъемДвигателя КАК Объем,
	|	Renault_ДопИнформацияПоВерсиям.МощностьЛС КАК ДвигательЛС,
	|	Renault_ДопИнформацияПоВерсиям.МощностьКВТ КАК Двигатель_КВТ,
	|	CRM_КонфигурацииАвтомобилей.VIN КАК VIN,
	|	CRM_КонфигурацииАвтомобилей.Автомобиль КАК Автомобиль,
	|	CRM_КонфигурацииАвтомобилей.Модель.Артикул КАК КодМодели,
	|	CRM_КонфигурацииАвтомобилей.Версия.Артикул КАК КодВерсии,
	|	CRM_КонфигурацииАвтомобилей.Цвет.Артикул КАК КодЦвета
	|ИЗ
	|	Справочник.CRM_КонфигурацииАвтомобилей КАК CRM_КонфигурацииАвтомобилей
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ДопИнформацияПоВерсиям КАК Renault_ДопИнформацияПоВерсиям
	|		ПО CRM_КонфигурацииАвтомобилей.Версия = Renault_ДопИнформацияПоВерсиям.ВариантКомплектации
	|ГДЕ
	|	CRM_КонфигурацииАвтомобилей.Ссылка = &Конфигурация";
	Запрос.УстановитьПараметр("Конфигурация", Конфигурация);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции

Функция ПолучитьБазовыеОпцииТрейдИн(VIN)
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ОпцииАвтомобилей.Наименование КАК НаименованиеОпции
	|ИЗ
	|	РегистрСведений.Renault_ОпцииАвтомобилей КАК Renault_ОпцииАвтомобилей
	|ГДЕ
	|	Renault_ОпцииАвтомобилей.VIN = &VIN";
	Запрос.УстановитьПараметр("VIN", VIN);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Новый Массив;
	Иначе
		Возврат Результат.Выгрузить().ВыгрузитьКолонку("НаименованиеОпции");
	КонецЕсли;
	
КонецФункции

Функция ПолучитьБазовыеОпции(Модель, ВариантКомплектации, Тариф, БрендLADA)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ "
	+?(БрендLADA=Истина, " ПЕРВЫЕ 15 ","")
	+
	"
	|	ВЫРАЗИТЬ(Renault_ТарифНаОпцииАвтомобилей.НаименованиеОпции КАК СТРОКА(150)) КАК НаименованиеОпции
	|ИЗ
	|	РегистрСведений.Renault_ТарифНаОпцииАвтомобилей.СрезПоследних(
	|			,
	|			Тариф = &Тариф
	|				И Модель = &Модель
	|				И ВариантКомплектации = &ВариантКомплектации
	|				И Базовая = ИСТИНА) КАК Renault_ТарифНаОпцииАвтомобилей";
	
	Запрос.УстановитьПараметр("Модель", Модель);
	Запрос.УстановитьПараметр("ВариантКомплектации", ВариантКомплектации);
	Запрос.УстановитьПараметр("Тариф", Тариф);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Новый Массив;
	Иначе
		Возврат Результат.Выгрузить().ВыгрузитьКолонку("НаименованиеОпции");
	КонецЕсли;
	
КонецФункции

Функция ПолучитьКонтакт(Объект, ВидКонтакта)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Вид = &Вид";
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Вид", ВидКонтакта);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Представление;
	Иначе
		Возврат ""
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДанныеПоКредиту(РабЛист)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Renault_РабочийЛистОФУРасчетКредита.КредитноеПредложение КАК КредитноеПредложение,
	|	Renault_РабочийЛистОФУРасчетКредита.ПервоначальныйВзнос КАК ПервоначальныйВзнос,
	|	Renault_РабочийЛистОФУРасчетКредита.ПервоначальныйВзносПроцент КАК ПервоначальныйВзносПроцент,
	|	Renault_РабочийЛистОФУРасчетКредита.СрокКредита КАК СрокКредита,
	|	Renault_РабочийЛистОФУРасчетКредита.СуммаКредита КАК СуммаКредита,
	|	Renault_РабочийЛистОФУРасчетКредита.СтавкаБанка КАК СтавкаБанка,
	|	Renault_РабочийЛистОФУРасчетКредита.ЕжемесячныйПлатеж КАК ЕжемесячныйПлатеж
	|ИЗ
	|	Документ.Renault_РабочийЛистОФУ.РасчетКредита КАК Renault_РабочийЛистОФУРасчетКредита
	|ГДЕ
	|	Renault_РабочийЛистОФУРасчетКредита.Основной
	|	И Renault_РабочийЛистОФУРасчетКредита.Ссылка.РабочийЛист = &РабочийЛист
	|	И НЕ Renault_РабочийЛистОФУРасчетКредита.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("РабочийЛист", РабЛист);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Выборка.Сбросить();
		Возврат Выборка;
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	Renault_РабочийЛистОФУРасчетКредита.КредитноеПредложение КАК КредитноеПредложение,
		|	Renault_РабочийЛистОФУРасчетКредита.ПервоначальныйВзнос КАК ПервоначальныйВзнос,
		|	Renault_РабочийЛистОФУРасчетКредита.ПервоначальныйВзносПроцент КАК ПервоначальныйВзносПроцент,
		|	Renault_РабочийЛистОФУРасчетКредита.СрокКредита КАК СрокКредита,
		|	Renault_РабочийЛистОФУРасчетКредита.СуммаКредита КАК СуммаКредита,
		|	Renault_РабочийЛистОФУРасчетКредита.СтавкаБанка КАК СтавкаБанка,
		|	Renault_РабочийЛистОФУРасчетКредита.ЕжемесячныйПлатеж КАК ЕжемесячныйПлатеж
		|ИЗ
		|	Документ.Renault_РабочийЛистОФУ.РасчетКредита КАК Renault_РабочийЛистОФУРасчетКредита
		|ГДЕ
		|	Renault_РабочийЛистОФУРасчетКредита.Ссылка.РабочийЛист = &РабочийЛист
		|	И НЕ Renault_РабочийЛистОФУРасчетКредита.Ссылка.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("РабочийЛист", РабЛист);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Возврат Выборка;
		
	КонецЕсли;
	
КонецФункции


&НаКлиенте
Процедура Открыть(РабочийЛист, Клиент, КоммерческоеПредложение=Неопределено) Экспорт
	
	ФормаКП = Обработки.CRM_АРМ_Конфигуратор.ПолучитьФорму("Форма");
	ФормаКП.ТекущийРабочийЛист = РабочийЛист;
	ФормаКП.ТекущийКлиент = Клиент;
	Если КоммерческоеПредложение <> Неопределено И НЕ КоммерческоеПредложение.Пустая() Тогда
		ФормаКП.ТекущееКП = КоммерческоеПредложение;
		ФормаКП.ЭтоТрейдИН = КоммерческоеПредложение.ТрейдИн;
	КонецЕсли;
	ФормаКП.Открыть();
	
КонецПроцедуры

#КонецОбласти















