Процедура СформироватьОтчет(ТабличныйДокумент, АдресТаблицыДанных, URLСхемы, НастройкиКомпоновкиДанных, Период, СписокВыбранныхДопПолей) Экспорт 
	Если Не Renault_РаботаСПравамиПользователя.ЕстьПравоОткрытияОтчетапродаж(ПараметрыСеанса.Пользователь,"Renault_ТрафикПоПериодам") тогда
		Сообщить("Недостаточно прав доступа.");
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	ТабличныйДокумент.Очистить();
	
	СхемаКомпоновки = ПолучитьИзВременногоХранилища(URLСхемы);
	
	URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновки, Новый УникальныйИдентификатор);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ДанныеРасшифроки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	// Применим настройки к схеме и получим результат
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, НастройкиКомпоновкиДанных, ДанныеРасшифроки);
	
	ВнешниеНаборыДанных = Новый Структура;
	
	ТаблицаДанных = ПолучитьТаблицуДанных(Период, НастройкиКомпоновкиДанных.Отбор.Элементы, СписокВыбранныхДопПолей);
	АдресТаблицыДанных = ПоместитьВоВременноеХранилище(ТаблицаДанных, Новый УникальныйИдентификатор);
	
	ВнешниеНаборыДанных.Вставить("ТаблицаДанных", ТаблицаДанных);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифроки, Истина);
	
	ПроцессорВыводаРезультата = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаРезультата.УстановитьДокумент(ТабличныйДокумент);
	
	ПроцессорВыводаРезультата.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры

Функция ПолучитьТаблицуДанных(Период, СписокОтбораСКД, СписокВыбранныхОтборов)
	
	Запрос = Новый Запрос;
	
	СтрокаВыбранныхПолей = "";
	СтрокаСоединений = "";
	СтрокаСинонимовВыбранныхПолей = "";
	
	Сч = 1;
	Для Каждого ВыбранныйОтбор Из СписокВыбранныхОтборов Цикл
		
		ПредставлениеДопПоля = ПроеобразоватьПредставление(ВыбранныйОтбор.Представление);
		
		СтрокаВыбранныхПолей = СтрокаВыбранныхПолей + Символы.ПС + "	CRM_ЗначенияРеквизитовТрафика" + ПредставлениеДопПоля + ".ЗначениеРеквизита КАК " + ПредставлениеДопПоля + ",";
		
		СтрокаСинонимовВыбранныхПолей = СтрокаСинонимовВыбранныхПолей + Символы.ПС + ПредставлениеДопПоля + ",";
		
		СтрокаСоединений = СтрокаСоединений + Символы.ПС + "ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ЗначенияРеквизитовТрафика КАК CRM_ЗначенияРеквизитовТрафика" + ПредставлениеДопПоля + "
		|		ПО (Renault_Трафик.Идентификатор = CRM_ЗначенияРеквизитовТрафика" + ПредставлениеДопПоля + ".ИдентификаторТрафика
		|				И CRM_ЗначенияРеквизитовТрафика" + ПредставлениеДопПоля + ".РеквизитТрафика = &" + ПредставлениеДопПоля + ")";

		Запрос.УстановитьПараметр(ПредставлениеДопПоля, ВыбранныйОтбор.Значение);
		
		Сч = Сч + 1;
		
	КонецЦикла;
	            
	СтрокаУсловий = "";
	Для Каждого ОтборСКД Из СписокОтбораСКД Цикл 
		
		Если ОтборСКД.Использование Тогда
			ИмяПоля = Строка(ОтборСКД.ЛевоеЗначение);
			СимволСлеваОтЗначения = "";
			СимволСправаОтЗначения = "";
			ВидСравненияВЗапросе = ПолучитьВидСравненияДляЗапроса(ОтборСКД.ВидСравнения, СимволСлеваОтЗначения, СимволСправаОтЗначения);
			СтрокаУсловий = СтрокаУсловий + Символы.ПС + " И ТаблицаДанных." + ИмяПоля + " " + ВидСравненияВЗапросе 
														+ " " + СимволСлеваОтЗначения + "&Отбор" + ИмяПоля + СимволСправаОтЗначения;
			Запрос.УстановитьПараметр("Отбор" + ИмяПоля, ОтборСКД.ПравоеЗначение);
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_Трафик.ТипТрафика,
	|	Renault_Трафик.Обработан,
	|	Renault_Трафик.Отдел,
	|	Renault_Трафик.Менеджер,
	|	Renault_Трафик.Администратор,
	|	Renault_Трафик.Клиент,
	//+++ Зенин DMSREN-700
	|	Renault_Трафик.Город,
	//---
	|	Renault_Трафик.ПервичныйПовторный,
	|	Renault_Трафик.ПервичныйИнтерес,
	|	Renault_Трафик.ИсточникИнформации,
	|	Renault_Трафик.Отдел.ДилерскийЦентр КАК ДилерскийЦентр,
	|	ЧАС(Renault_Трафик.Период) КАК Час,
	|	ДЕНЬ(Renault_Трафик.Период) КАК День,
	|	ДЕНЬНЕДЕЛИ(Renault_Трафик.Период) КАК ДеньНедели,
	|	ДЕНЬГОДА(Renault_Трафик.Период) КАК ДеньГода,
	|	НЕДЕЛЯ(Renault_Трафик.Период) КАК Неделя,
	|	МЕСЯЦ(Renault_Трафик.Период) КАК Месяц,
	|	КВАРТАЛ(Renault_Трафик.Период) КАК Квартал,
	|	ГОД(Renault_Трафик.Период) КАК Год,
	|	Renault_Трафик.Период КАК Период,
	|	" + СтрокаВыбранныхПолей + "
	|	1 КАК Количество
	|ПОМЕСТИТЬ ТаблицаДанных
	|ИЗ
	|	РегистрСведений.Renault_Трафик КАК Renault_Трафик
	|	" + СтрокаСоединений + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанных.ТипТрафика,
	|	ТаблицаДанных.Обработан,
	|	ТаблицаДанных.Отдел,
	|	ТаблицаДанных.Менеджер,
	|	ТаблицаДанных.Администратор,
	|	ТаблицаДанных.ПервичныйИнтерес,
	|	ТаблицаДанных.ИсточникИнформации,
	|	ТаблицаДанных.ДилерскийЦентр,
	|	ТаблицаДанных.Клиент,
	//+++ Зенин DMSREN-700
	|	ТаблицаДанных.Город,
	//---
	|	ТаблицаДанных.ПервичныйПовторный,
	|	ТаблицаДанных.Час,
	|	ТаблицаДанных.День,
	|	ТаблицаДанных.ДеньНедели,
	|	ТаблицаДанных.ДеньГода,
	|	ТаблицаДанных.Неделя,
	|	ТаблицаДанных.Месяц,
	|	ТаблицаДанных.Квартал,
	|	ТаблицаДанных.Год,
	|	ТаблицаДанных.Период,
	|	" + СтрокаСинонимовВыбранныхПолей + "
	|	ТаблицаДанных.Количество
	|ИЗ
	|	ТаблицаДанных КАК ТаблицаДанных
	|ГДЕ
	|	ТаблицаДанных.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	" + СтрокаУсловий + "
	|	";
	
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(?(Не ЗначениеЗаполнено(Период.ДатаОкончания), Дата("39990101"), Период.ДатаОкончания)));
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьВидСравненияДляЗапроса(ВидСравненияСКД, СимволСлеваОтЗначения = "", СимволСправаОтЗначения = "")
	
	ВидСравненияДляЗапроса = "";
	
	Если ВидСравненияСКД = ВидСравненияКомпоновкиДанных.Больше Тогда 
		ВидСравненияДляЗапроса = ">";
	ИначеЕсли ВидСравненияСКД = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда 
		ВидСравненияДляЗапроса = ">=";
	ИначеЕсли ВидСравненияСКД = ВидСравненияКомпоновкиДанных.ВИерархии Тогда 
		ВидСравненияДляЗапроса = "В Иерархии";
		СимволСлеваОтЗначения = "(";
		СимволСправаОтЗначения = ")";
	ИначеЕсли ВидСравненияСКД = ВидСравненияКомпоновкиДанных.ВСписке Тогда 
		ВидСравненияДляЗапроса = "В";
		СимволСлеваОтЗначения = "(";
		СимволСправаОтЗначения = ")";
	ИначеЕсли ВидСравненияСКД = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда 
		ВидСравненияДляЗапроса = "В Иерархии";
		СимволСлеваОтЗначения = "(";
		СимволСправаОтЗначения = ")";
	ИначеЕсли ВидСравненияСКД = ВидСравненияКомпоновкиДанных.Меньше Тогда 
		ВидСравненияДляЗапроса = "<";
	ИначеЕсли ВидСравненияСКД = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда 
		ВидСравненияДляЗапроса = "<=";
	ИначеЕсли ВидСравненияСКД = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда 
		ВидСравненияДляЗапроса = "Не В Иерархии";
		СимволСлеваОтЗначения = "(";
		СимволСправаОтЗначения = ")";
	ИначеЕсли ВидСравненияСКД = ВидСравненияКомпоновкиДанных.НеВСписке Тогда 
		ВидСравненияДляЗапроса = "Не В";
		СимволСлеваОтЗначения = "(";
		СимволСправаОтЗначения = ")";
	ИначеЕсли ВидСравненияСКД = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда 
		ВидСравненияДляЗапроса = "Не В Иерархии";
		СимволСлеваОтЗначения = "(";
		СимволСправаОтЗначения = ")";
	ИначеЕсли ВидСравненияСКД = ВидСравненияКомпоновкиДанных.НеРавно Тогда 
		ВидСравненияДляЗапроса = "<>";
	ИначеЕсли ВидСравненияСКД = ВидСравненияКомпоновкиДанных.Равно Тогда 
		ВидСравненияДляЗапроса = "=";
	ИначеЕсли ВидСравненияСКД = ВидСравненияКомпоновкиДанных.НеСодержит Тогда 
		ВидСравненияДляЗапроса = "Не Подобно";
		СимволСлеваОтЗначения = "%";
		СимволСправаОтЗначения = "%";
	ИначеЕсли ВидСравненияСКД = ВидСравненияКомпоновкиДанных.Содержит Тогда 
		ВидСравненияДляЗапроса = "Подобно";
		СимволСлеваОтЗначения = "%";
		СимволСправаОтЗначения = "%";
	КонецЕсли;
	
	Возврат ВидСравненияДляЗапроса;
	
КонецФункции

Функция ПолучитьСхемуКД() Экспорт 
	
	Схема = ПолучитьМакет("СхемаКД");
	
	Возврат Схема;
	
КонецФункции

Функция ПроеобразоватьПредставление(Знач Представление)
	
	МассивПодстрок = РазложитьСтрокуВМассивПодстрок(Представление, " ");
	
	Представление = "";
	Для Каждого Подстрока Из МассивПодстрок Цикл 
		Представление = Представление + ТРег(СокрЛП(Подстрока));
	КонецЦикла;
	
	Возврат Представление
	
КонецФункции

Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",") Экспорт
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
КонецФункции // РазложитьСтрокуВМассивПодстрок

Функция ПолучитьСписокДополнительныеПоля() Экспорт
	
	СписокДопСвойств = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_РеквизитыТрафика.Ссылка,
	|	CRM_РеквизитыТрафика.Наименование,
	|	CRM_РеквизитыТрафика.Представление
	|ИЗ
	|	ПланВидовХарактеристик.CRM_РеквизитыТрафика КАК CRM_РеквизитыТрафика
	|ГДЕ
	|	НЕ CRM_РеквизитыТрафика.ЭтоГруппа
	|	И НЕ CRM_РеквизитыТрафика.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		НовЭлементСписка = СписокДопСвойств.Добавить();			
		
		НовЭлементСписка.Значение = Выборка.Ссылка;
		НовЭлементСписка.Представление = Выборка.Наименование;
		
	КонецЦикла;
	
	Возврат СписокДопСвойств;
	
КонецФункции
