
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ОповеститьОВыборе(Значение);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Отбор") Тогда
		
		Если Параметры.Отбор = "ПрямаяПоставка" Тогда
			Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "// УСЛОВИЯ ОТБОРА", "ГДЕ Renault_КаталогРеферансов.ПрямаяПоставка ");
		ИначеЕсли Параметры.Отбор = "КодоваяЗапчасть" Тогда
			Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "// УСЛОВИЯ ОТБОРА", "ГДЕ Renault_КаталогРеферансов.КодоваяЗапчасть ");
		ИначеЕсли Параметры.Отбор = "PVI" Тогда
			Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "// УСЛОВИЯ ОТБОРА", "ГДЕ Renault_КаталогРеферансов.PVI <> Значение(Перечисление.Renault_ТипыPVI.НеPVI) 
																							| И не Renault_КаталогРеферансов.ПрямаяПоставка
																							| И не Renault_КаталогРеферансов.КодоваяЗапчасть");
		КонецЕсли;
	Иначе
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "// УСЛОВИЯ ОТБОРА", "ГДЕ не Renault_КаталогРеферансов.ПрямаяПоставка
																					| И не Renault_КаталогРеферансов.КодоваяЗапчасть");
	КонецЕсли;
	
КонецПроцедуры
