Функция НайтиКалькуляциюПоЗаявкеНаТрейдИн(Заявка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_Калькуляция.Ссылка
	|ИЗ
	|	Документ.Renault_Калькуляция КАК Renault_Калькуляция
	|ГДЕ
	|	Renault_Калькуляция.ДокументОснование В
	|			(ВЫБРАТЬ
	|				Renault_CRM_ЗаявкаНаСервис.Ссылка
	|			ИЗ
	|				Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
	|			ГДЕ
	|				Renault_CRM_ЗаявкаНаСервис.Обращение В
	|					(ВЫБРАТЬ
	|						Renault_CRM_ОбращениеВАвтоСервис.Ссылка КАК Документ
	|					ИЗ
	|						Документ.Renault_CRM_ОбращениеВАвтоСервис КАК Renault_CRM_ОбращениеВАвтоСервис
	|							ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Renault_ЗаявкаНаТрейдИн КАК Renault_ЗаявкаНаТрейдИн
	|							ПО
	|								Renault_CRM_ОбращениеВАвтоСервис.Клиент = Renault_ЗаявкаНаТрейдИн.Клиент
	|									И Renault_CRM_ОбращениеВАвтоСервис.Автомобиль = Renault_ЗаявкаНаТрейдИн.Автомобиль
	|					ГДЕ
	|						Renault_ЗаявкаНаТрейдИн.Ссылка = &Ссылка
	|						И Renault_CRM_ОбращениеВАвтоСервис.ВидОбращения = &ВидОбращения
	|						И Renault_CRM_ОбращениеВАвтоСервис.ПометкаУдаления = ЛОЖЬ
	|						И Renault_ЗаявкаНаТрейдИн.ПометкаУдаления = ЛОЖЬ))
	|	И Renault_Калькуляция.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ВидОбращения", Справочники.Renault_ВидыОбращенийВАвтосервис.ДиагностикаТрейдИн);
	Запрос.УстановитьПараметр("Ссылка", Заявка.Ссылка);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьИтого(Калькуляция) Экспорт
	
	Итого = 0;
	
	Для Каждого СтрокаРаботы Из Калькуляция.Работы Цикл
		//Для Каждого СтрокаОписание Из Калькуляция.ПроизвольноеОписание Цикл
		//	Если СтрокаОписание.ДаноСогласие И СтрокаОписание.ИД = СтрокаРаботы.ИД Тогда
				Итого = Итого + СтрокаРаботы.Сумма;
			//КонецЕсли;
		//КонецЦикла;
	КонецЦикла;
	
	Для Каждого СтрокаТовары Из Калькуляция.Товары Цикл
		//Для Каждого СтрокаОписание Из Калькуляция.ПроизвольноеОписание Цикл
		//	Если СтрокаОписание.ДаноСогласие И СтрокаОписание.ИД = СтрокаТовары.ИД Тогда
				Итого = Итого + СтрокаТовары.Сумма;
			//КонецЕсли;
		//КонецЦикла;
	КонецЦикла;
	
	Возврат Итого;
	
КонецФункции