//Бондаренко++ 20180928
Процедура РазослатьРегламентированныеОтчеты(Параметры = Неопределено)  Экспорт
 
	 Обработки.РазослатьРегламентированныеОтчеты.Создать().Сформировать();	
 	
КонецПроцедуры
//Бондаренко-- 20180928

//Бондаренко++ 20200911
Процедура РазослатьПисьмаОПредстоящихПлатежахОптовиков(Параметры = Неопределено)  Экспорт
	
	ТекстПисьма = "";
	
	СписокОптовиков = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	
	//Бондаренко++ 20201105
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Контрагенты.Ссылка,
	//	|	Контрагенты.ЭтоГруппа,
	//	|	Контрагенты.ОптовыйПокупатель,
	//	|	Контрагенты.ПометкаУдаления
	//	|ИЗ
	//	|	Справочник.Контрагенты КАК Контрагенты
	//	|ГДЕ
	//	|	Контрагенты.ПометкаУдаления = ЛОЖЬ
	//	|	И Контрагенты.ЭтоГруппа = ЛОЖЬ
	//	|	И Контрагенты.ОптовыйПокупатель = ИСТИНА";
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваров.Контрагент КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваров КАК РеализацияТоваров
	|ГДЕ
	|	РеализацияТоваров.Проведен = ИСТИНА
	|	И РеализацияТоваров.ПодразделениеКомпании = &ПодразделениеКомпании
	|	И РеализацияТоваров.ОптоваяПродажа = ИСТИНА
	|	И РеализацияТоваров.Контрагент.НашаФирма = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеализацияТоваров.Контрагент.Наименование";
	
	Запрос.УстановитьПараметр("",Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000121")); 
	//Бондаренко-- 20201105
    	
	СписокОптовиков.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	ДатаРасчета = КонецДня(ТекущаяДата())+5*86400;
 
	Для каждого Стр Из СписокОптовиков Цикл
		
		Контрагент = Стр.Значение;
		
		Если Не обЗначениеНеЗаполнено(Контрагент) Тогда
			
  				СтруктураОтбора = Новый Структура("Контрагент",Контрагент);
				
			 	МоментВремени = КонецДня(ДатаРасчета);
  
				тзОбщДолгиПоДоговорам = РегистрыНакопления.ВзаиморасчетыКомпании.Остатки(МоментВремени,СтруктураОтбора,,"Сумма");
				тзОбщДолгиПоДоговорам.Свернуть("ДоговорВзаиморасчетов","Сумма"); 
 				
 				Запрос = Новый Запрос;
				
 				СпРодителей = Новый СписокЗначений;
				СпРодителей.Добавить(Справочники.ХозОперации.ОтгрузкаТМЦ);
				СпРодителей.Добавить(Справочники.ХозОперации.ОтгрузкаАвтомобилей);
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ВзаиморасчетыКомпанииОстатки.Контрагент,
				|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов,
				|	ВзаиморасчетыКомпанииОстатки.Сделка,
				|	ВзаиморасчетыКомпанииОстатки.СуммаОстаток КАК Сумма,
				|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.СрокОплатыЗадолженности КАК СрокОплатыЗадолженности,
				|	ВзаиморасчетыКомпанииОстатки.Сделка.Дата КАК ДатаСделки,
				|	ВзаиморасчетыКомпанииОстатки.Сделка.ХозОперация.Родитель,
				|	ДОБАВИТЬКДАТЕ(ВзаиморасчетыКомпанииОстатки.Сделка.Дата, ДЕНЬ, ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.СрокОплатыЗадолженности) КАК ОплатитьДо
				|ИЗ
				|	РегистрНакопления.ВзаиморасчетыКомпании.Остатки(&ДатаРасчета, ) КАК ВзаиморасчетыКомпанииОстатки
				|ГДЕ
				|	ВзаиморасчетыКомпанииОстатки.Контрагент = &Контрагент
				|	И ВзаиморасчетыКомпанииОстатки.Сделка.ХозОперация.Родитель В(&СпРодителей)
				|
				|УПОРЯДОЧИТЬ ПО
				|	ОплатитьДо УБЫВ,
				|	ДатаСделки УБЫВ";
				
				  				
				Если обЗначениеНеЗаполнено(ДатаРасчета) Тогда
					ДатаРасчета = КонецДня(ТекущаяДата());
				Иначе
					ДатаРасчета = КонецДня(ДатаРасчета);
				КонецЕсли;

				Запрос.УстановитьПараметр("Контрагент",    Контрагент);
				Запрос.УстановитьПараметр("СпРодителей",   СпРодителей);
 				Запрос.УстановитьПараметр("ДатаРасчета", КонецДня(ДатаРасчета));
				тзОбщДолги = Запрос.Выполнить().Выгрузить();
 
 				//тзОбщДолги.ВыбратьСтроку(тзОбщДолги.Количество());
				
				Для каждого Стр Из тзОбщДолги Цикл
 					СтрОстатокЧисло = 0;
					НайдСтрокаОбщДолга = тзОбщДолгиПоДоговорам.Найти(Стр.ДоговорВзаиморасчетов,"ДоговорВзаиморасчетов");
					Если НайдСтрокаОбщДолга <> Неопределено Тогда
						СтрОстатокЧисло = НайдСтрокаОбщДолга.Сумма;	 
					КонецЕсли;
					Если СтрОстатокЧисло > 0 Тогда
						СтрОстатокЧисло = СтрОстатокЧисло - Стр.Сделка.СуммаДокумента; 
						НайдСтрокаОбщДолга.Сумма = СтрОстатокЧисло;
						Если Стр.ОплатитьДо < ДатаРасчета Тогда
  							ТекстПисьма = СокрЛП(ТекстПисьма)+Символы.ПС+"Для контагента "+Контрагент+" по договору "+Стр.ДоговорВзаиморасчетов+" и сделки "+Стр.Сделка+" на сумму "+Стр.Сделка.СуммаДокумента+" руб., отсрочка платежа составляет "+Стр.СрокОплатыЗадолженности+" дней и дата платежа "+Формат(Стр.ОплатитьДо,"ДЛФ=DD=D")+" просрочена.";
 						КонецЕсли; 
					КонецЕсли;
 				КонецЦикла; 
 			
		КонецЕсли; 		
		
	КонецЦикла;
	
	Если НЕ обЗначениеНеЗаполнено(ТекстПисьма) Тогда
 		мТипыРассылок =  Новый Массив;
		мТипыРассылок.Добавить(Перечисления.ТипыРассылок.ОптовыеПродажи);
 		мКому = г_Функции.ПолучитьПользователейДляРассылки(Справочники.ПодразделенияКомпании.ОсновноеПодразделение,мТипыРассылок,Перечисления.ИсточникиРассылки.ПредстоящиеОплатыПокупателей);
		Если мКому.Количество() > 0 тогда
			г_Функции.СоздатьИОтпраитьЭлПисьмо(мКому,Новый Массив,"Предстоящие оплаты оптовиков от "+Формат(ТекущаяДата(),"ДЛФ=DDT"),ТекстПисьма);
		КонецЕсли;			
	КонецЕсли; 
	   	
КонецПроцедуры
//Бондаренко-- 20200911

 Процедура РассылкаОтчетаПоУРВ(Параметры = Неопределено) Экспорт
	СтрокаСоединения = НРег(СтрокаСоединенияИнформационнойБазы());
	ЭтоРабочаяБаза = Найти(СтрокаСоединения, "1cserver") > 0 И Найти(СтрокаСоединения, "alfaauto") > 0;
	Если Не ЭтоРабочаяБаза Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяДата = НачалоДня(ТекущаяДата()) - 3600; // отчёт за вчерашний день
	Если Параметры <> Неопределено И Параметры.Количество() > 0 И ТипЗнч(Параметры[0]) = Тип("ПеречислениеСсылка.ИсточникиРассылки") Тогда
		ИсточникРассылки = Параметры[0];
		ТолькоОпоздавшие = Истина;
	Иначе
		ИсточникРассылки = Перечисления.ИсточникиРассылки.УРВ;
		ТолькоОпоздавшие = Ложь;
	КонецЕсли;
	
	НаборДляРассылки = РегистрыСведений.РассылкаПочты.СоздатьНаборЗаписей();
	НаборДляРассылки.Отбор.ТипРассылки.Установить(Перечисления.ТипыРассылок.ОтчетПоУРВ);
	НаборДляРассылки.Отбор.ИсточникРассылки.Установить(ИсточникРассылки);
	НаборДляРассылки.Прочитать();
	
	НаборДляВсехДЦ = РегистрыСведений.РассылкаПочты.СоздатьНаборЗаписей();
	НаборДляВсехДЦ.Отбор.ТипРассылки.Установить(Перечисления.ТипыРассылок.ВсеОтчетыПоУРВ);
	НаборДляВсехДЦ.Отбор.ИсточникРассылки.Установить(ИсточникРассылки);
	НаборДляВсехДЦ.Прочитать();
	
	Если НаборДляРассылки.Количество() + НаборДляВсехДЦ.Количество() = 0 Тогда
		ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаОтчетаПоУРВ", 
		        УровеньЖурналаРегистрации.Предупреждение, , ,
		        "Список адресатов рассылки пуст!"); 
		Возврат;
	КонецЕсли;
	
	обрФормироватьОтчет = Обработки.ФормированиеОтчетаУРВ.Создать();
	обрФормироватьОтчет.Дата = ТекущаяДата;
	обрФормироватьОтчет.СформироватьОтчет(ТолькоОпоздавшие);
	
	// цикл по ТЧ ОтчетыПоДЦ
	Для Каждого СтрокаОтчет Из обрФормироватьОтчет.ОтчетыПоДЦ Цикл
		ЭлПисьмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();	 
		Для Каждого Рассылка из НаборДляВсехДЦ Цикл
			АдресЭлПочты = киПолучитьПредставлениеКИ(Рассылка.Сотрудники, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
			Если ЗначениеЗаполнено(АдресЭлПочты) Тогда
				СтрокаПолучатели = ЭлПисьмо.Получатели.Добавить();
				СтрокаПолучатели.АдресЭлектроннойПочты = АдресЭлПочты;
				СтрокаПолучатели.Представление = АдресЭлПочты;
				СтрокаПолучатели.КодГруппыАдреса = Перечисления.КодГруппыАдресаЭлектронногоПисьма.Кому;
		        ЭлПисьмо.ПолучателиПредставление = ЭлПисьмо.ПолучателиПредставление +?(ЭлПисьмо.ПолучателиПредставление = "", АдресЭлПочты, ";" + АдресЭлПочты);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Рассылка из НаборДляРассылки Цикл
			// проверка на принадлежность текущему ДЦ
			Подразделение = Рассылка.Сотрудники.Подразделение;
			Если ЗначениеЗаполнено(Рассылка.Подразделение) Тогда
				ДЦРассылка = Рассылка.Подразделение.ДилерскийЦентр;
			Иначе
				ДЦРассылка = Справочники.ДилерскиеЦентры.ПустаяСсылка();
			КонецЕсли;
			Если СтрокаОтчет.ДЦ = Подразделение.ДилерскийЦентр Или СтрокаОтчет.ДЦ = ДЦРассылка Тогда
				АдресЭлПочты = киПолучитьПредставлениеКИ(Рассылка.Сотрудники, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
				Если ЗначениеЗаполнено(АдресЭлПочты) Тогда
					СтрокаПолучатели = ЭлПисьмо.Получатели.Добавить();
					СтрокаПолучатели.АдресЭлектроннойПочты = АдресЭлПочты;
					СтрокаПолучатели.Представление = АдресЭлПочты;
					СтрокаПолучатели.КодГруппыАдреса = Перечисления.КодГруппыАдресаЭлектронногоПисьма.Кому;
			        ЭлПисьмо.ПолучателиПредставление = ЭлПисьмо.ПолучателиПредставление +?(ЭлПисьмо.ПолучателиПредставление = "", АдресЭлПочты, ";" + АдресЭлПочты);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если ЭлПисьмо.Получатели.Количество() = 0 Тогда
			ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаОтчетаПоУРВ", 
			        УровеньЖурналаРегистрации.Предупреждение, , ,
			        "Ни у одного из адресатов рассылки не указан e-mail!"); 
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаОтчет.ИмяФайла) Тогда
			// добавить вложение
			Попытка
				ДвДанные = Новый ДвоичныеДанные(СтрокаОтчет.ИмяФайла);
				ВыбранныйФайл = Новый Файл(СтрокаОтчет.ИмяФайла);
				ФайлВложение = ЭлПисьмо.ПрикрепленныеФайлы.Добавить();
				ФайлВложение.Файл = Новый ХранилищеЗначения(ДвДанные);
				ФайлВложение.Размер = ВыбранныйФайл.Размер();
				ФайлВложение.Имя = Строка(СтрокаОтчет.ДЦ) + "_ОтчетПоУРВ_" + Формат(ТекущаяДата, "ДЛФ=Д") + ВыбранныйФайл.Расширение;
				ЭлПисьмо.ЕстьВложения = Истина;
			Исключение
				ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаОтчетаПоУРВ", 
				        УровеньЖурналаРегистрации.Ошибка, , ,
				        "Ошибка при обработке файла-отчета: " + ОписаниеОшибки()); 
				Возврат;
			КонецПопытки;		
			// Удаление использованного файла-отчета
			Попытка
			    УдалитьФайлы(СтрокаОтчет.ИмяФайла);  
			Исключение
				ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаОтчетаПоУРВ", 
				        УровеньЖурналаРегистрации.Ошибка, , ,
				        "Ошибка при удалении файла-отчета: " + ОписаниеОшибки()); 
			КонецПопытки;
			ЭлПисьмо.ТекстПисьма= "Во вложении - отчёт по УРВ для ДЦ """ + Строка(СтрокаОтчет.ДЦ) + """.";
		Иначе
			ЭлПисьмо.ТекстПисьма= "По ДЦ """ + Строка(СтрокаОтчет.ДЦ) + """ нарушений нет.";
		КонецЕсли;
		
		ЭлПисьмо.Тема = "ДЦ """ + Строка(СтрокаОтчет.ДЦ) + """: отчет по УРВ от " + Формат(ТекущаяДата, "ДЛФ=ДД");
		ЭлПисьмо.УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.Альфа;	
		ЭлПисьмо.Организация =   ПараметрыСеанса.Пользователь.Организация;
		ЭлПисьмо.ПодразделениеКомпании = ПараметрыСеанса.Пользователь.Подразделение;
		ЭлПисьмо.Автор   = ПараметрыСеанса.Пользователь;
		
		СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	    СтрокаСоединения = СтрЗаменить(СтрокаСоединения, ";", Символы.ПС);
		Если Найти(ВРег(СтрокаСоединения), "FILE=") = 1  Тогда
			// файловая
	        ИмяИБ = СтрПолучитьСтроку(СтрокаСоединения, 1);
	    Иначе
			// клиент-сервер
	        ИмяИБ = СтрПолучитьСтроку(СтрокаСоединения, 2);
		КонецЕсли;	
	    Если НЕ Пустаястрока(ИмяИБ) Тогда
			ИмяИБ = Сред(ИмяИБ, Найти(ИмяИБ, """") + 1);
		КонецЕсли;		
		ЭлПисьмо.ОтправительПредставление = "Альфа-Авто" + " (" + Лев(ИмяИБ, СтрДлина(ИмяИБ) - 1) + ") <1c@sokolmotors.ru>";
		
		ЭлПисьмо.ГруппаПисем = Справочники.ГруппыПисемЭлектроннойПочты.НайтиПоНаименованию("Исходящие");
		ЭлПисьмо.Важность = Перечисления.Важность.Средняя;
		ЭлПисьмо.ДатаОтправления = ТекущаяДата;
		ЭлПисьмо.Дата = ТекущаяДата;
		ЭлПисьмо.ХозОперация = Справочники.ХозОперации.ЭлектронноеПисьмо;
		ЭлПисьмо.ФорматТекста = Перечисления.ФорматТекста.ПростойТекст; 
		ЭлПисьмо.Записать();
		
		СтруктураРежимовОбмена = Новый Структура("Получить, Отправить", Ложь, Истина);
		СоединениеСПочтовымСервером = эпПодключитьсяКПочтовомуСерверу(ЭлПисьмо.УчетнаяЗапись, СтруктураРежимовОбмена);
		Если СоединениеСПочтовымСервером <> Неопределено Тогда
			Если эпОтправитьПисьмо(ЭлПисьмо.ЭтотОбъект, СоединениеСПочтовымСервером) Тогда
				эпОтключитьсяОтПочтовогоСервера(СоединениеСПочтовымСервером);
			Иначе
				эпОтключитьсяОтПочтовогоСервера(СоединениеСПочтовымСервером);
			КонецЕсли;	
		КонецЕсли;
    КонецЦикла;

КонецПроцедуры

Процедура РассылкаОтчетаПоУРВОпоздания(Параметры = Неопределено) Экспорт
	Параметры = Новый Массив();
	Параметры.Добавить(Перечисления.ИсточникиРассылки.УРВОпоздавшие);
	РассылкаОтчетаПоУРВ(Параметры);
КонецПроцедуры

 Процедура РассылкаАвтомобилиБУСтарыеЗапасы(Параметры = Неопределено) Экспорт
	ТекущаяДата = ТекущаяДата();
	
	НаборДляРассылки = РегистрыСведений.РассылкаПочты.СоздатьНаборЗаписей();
	НаборДляРассылки.Отбор.ИсточникРассылки.Установить(Перечисления.ИсточникиРассылки.СкладАвтомобилей);
	НаборДляРассылки.Отбор.ТипРассылки.Установить(Перечисления.ТипыРассылок.СтарыеЗапасы);
	НаборДляРассылки.Прочитать();
	ЭлПисьмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();	 
	Для Каждого Рассылка из НаборДляРассылки Цикл
		АдресЭлПочты = киПолучитьПредставлениеКИ(Рассылка.Сотрудники, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
		Если ЗначениеЗаполнено(АдресЭлПочты) Тогда
			СтрокаПолучатели = ЭлПисьмо.Получатели.Добавить();
			СтрокаПолучатели.АдресЭлектроннойПочты = АдресЭлПочты;
			СтрокаПолучатели.Представление = АдресЭлПочты;
			СтрокаПолучатели.КодГруппыАдреса = Перечисления.КодГруппыАдресаЭлектронногоПисьма.Кому;
	        ЭлПисьмо.ПолучателиПредставление = ЭлПисьмо.ПолучателиПредставление +?(ЭлПисьмо.ПолучателиПредставление = "", АдресЭлПочты, ";" + АдресЭлПочты);
		КонецЕсли;
	КонецЦикла;
		
	Если ЭлПисьмо.Получатели.Количество() = 0 Тогда
		ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаАвтомобилиБУСтарыеЗапасы", 
		        УровеньЖурналаРегистрации.Предупреждение, , ,
		        "Ни у одного из адресатов рассылки не указан e-mail!"); 
		Возврат;
	КонецЕсли;
	
	ЭлПисьмо.Тема = "Старые запасы автомобилей с пробегом на " + Формат(ТекущаяДата, "ДЛФ=ДД");
	ЭлПисьмо.УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.Альфа;	
	ЭлПисьмо.ОтправительПредставление = "Альфа-Авто <" + ЭлПисьмо.УчетнаяЗапись.АдресЭлектроннойПочты + ">";
	ЭлПисьмо.Организация =   ПараметрыСеанса.Пользователь.Организация;
	ЭлПисьмо.ПодразделениеКомпании = ПараметрыСеанса.Пользователь.Подразделение;
	ЭлПисьмо.Автор   = ПараметрыСеанса.Пользователь;	
	ЭлПисьмо.ГруппаПисем = Справочники.ГруппыПисемЭлектроннойПочты.НайтиПоНаименованию("Исходящие");
	ЭлПисьмо.Важность = Перечисления.Важность.Средняя;
	ЭлПисьмо.ДатаОтправления = ТекущаяДата;
	ЭлПисьмо.Дата = ТекущаяДата;
	ЭлПисьмо.ХозОперация = Справочники.ХозОперации.ЭлектронноеПисьмо;
	ЭлПисьмо.ФорматТекста = Перечисления.ФорматТекста.ПростойТекст;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	АвтомобилиСрезПоследних.Автомобиль
	               |ПОМЕСТИТЬ ПоступившиеАвтомобилиБУ
	               |ИЗ
	               |	РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	               |ГДЕ
	               |	АвтомобилиСрезПоследних.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.АвтомобильСПробегом)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОстаткиАвтомобилейОстатки.Автомобиль.Наименование КАК Автомобиль,
	               |	ОстаткиАвтомобилейОстатки.СкладКомпании.Наименование КАК Склад,
	               |	РАЗНОСТЬДАТ(ОстаткиАвтомобилейОстатки.Партия.Дата, &ТекущаяДата, ДЕНЬ) КАК ДнейНаСкладе
	               |ИЗ
	               |	РегистрНакопления.ОстаткиАвтомобилей.Остатки(
	               |			,
	               |			СкладКомпании.Подразделение.ДилерскийЦентр = &ДилерскийЦентр
	               |				И Партия.Дата < &ДатаПоступления) КАК ОстаткиАвтомобилейОстатки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоступившиеАвтомобилиБУ КАК ПоступившиеАвтомобилиБУ
	               |		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ПоступившиеАвтомобилиБУ.Автомобиль";
				   
	ДатаПоступления = НачалоДня(ТекущаяДата) - 49 * 24 * 3600; // за 49 суток
	Запрос.УстановитьПараметр("ДатаПоступления", ДатаПоступления);			   
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата));			   
				   
	ТекстСообщения = "";
	ВыборкаДЦ = Справочники.ДилерскиеЦентры.Выбрать(,,, "Наименование");
	Пока ВыборкаДЦ.Следующий() Цикл
		Запрос.УстановитьПараметр("ДилерскийЦентр", ВыборкаДЦ.Ссылка);
		Результат = Запрос.Выполнить().Выгрузить();
		Если Результат.Количество() = 0 Тогда
			Продолжить;
		Иначе
			ТекстСообщения = ТекстСообщения + Символы.ПС + "     Дилерский центр: " + ВыборкаДЦ.Наименование + Символы.ПС + Символы.ПС;
			сч = 0;
			Для Каждого АвтоБУ Из Результат Цикл
				сч = сч + 1;
				ТекстСообщения = ТекстСообщения + сч + ". " + АвтоБУ.Автомобиль + ", дней на складе: " + АвтоБУ.ДнейНаСкладе + Символы.ПС;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Если ПустаяСтрока(ТекстСообщения) Тогда
		ТекстСообщения = "На складах компании нет б/у автомобилей, поступивших до " + Формат(ДатаПоступления, "ДЛФ=ДД");
	КонецЕсли;
	ЭлПисьмо.ТекстПисьма = ТекстСообщения;
	ЭлПисьмо.Записать();
	
	СтруктураРежимовОбмена = Новый Структура("Получить, Отправить", Ложь, Истина);
	СоединениеСПочтовымСервером = эпПодключитьсяКПочтовомуСерверу(ЭлПисьмо.УчетнаяЗапись, СтруктураРежимовОбмена);
	Если СоединениеСПочтовымСервером <> Неопределено Тогда
		Если Не эпОтправитьПисьмо(ЭлПисьмо.ЭтотОбъект, СоединениеСПочтовымСервером) Тогда
			ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаАвтомобилиБУСтарыеЗапасы", 
			        УровеньЖурналаРегистрации.Ошибка, , , "Не удалось отправить письмо!"); 
		КонецЕсли;	
		эпОтключитьсяОтПочтовогоСервера(СоединениеСПочтовымСервером);
	КонецЕсли;		
КонецПроцедуры

// Семенихин 24.04.2019 +++++
Процедура РазослатьОповещенияОБрошенныхРЛ(Параметры = Неопределено)  Экспорт
	ДатаНачала = Дата(2019, 05, 01);
	ДатаОкончания = НачалоДня(ТекущаяДата());
	
	ЗапросПриглашения = Новый Запрос();
	ЗапросПриглашения.УстановитьПараметр("ДатаНачала", ДатаНачала);
	ЗапросПриглашения.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	ЗапросПриглашения.УстановитьПараметр("Создан", Справочники.СтатусыРабочегоЛиста.Создан);
	ЗапросПриглашения.УстановитьПараметр("ПустойРезультат", Справочники.РезультатКонтакта.ПустаяСсылка());
	ЗапросПриглашения.Текст = "ВЫБРАТЬ
	                          |	РабочийЛистСервиса.Номер,
	                          |	РабочийЛистСервиса.ДатаКонтакта,
	                          |	РабочийЛистСервиса.Менеджер КАК Сотрудник,
	                          |	РабочийЛистСервиса.ПодразделениеКомпании КАК ПодразделениеКомпании
	                          |ИЗ
	                          |	Документ.РабочийЛистСервиса КАК РабочийЛистСервиса
	                          |ГДЕ
	                          |	РабочийЛистСервиса.ДатаКонтакта МЕЖДУ &ДатаНачала И &ДатаОкончания
	                          |	И (РабочийЛистСервиса.Статус = &Создан
	                          |			ИЛИ РабочийЛистСервиса.РезультатКонтакта = &ПустойРезультат)
	                          |ИТОГИ ПО
	                          |	ПодразделениеКомпании";
	
	РассылкаПоПодразделениям = ЗапросПриглашения.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДисконтЗапчастьООО = Справочники.Организации.НайтиПоКоду("ЦБ000015");
	Пока РассылкаПоПодразделениям.Следующий() Цикл
		Подразделение = РассылкаПоПодразделениям.ПодразделениеКомпании;
		Если обЗначениеНеЗаполнено(Подразделение) Тогда
			Продолжить;
		//ИначеЕсли Подразделение.Организация = ДисконтЗапчастьООО Тогда
		//	Продолжить;
		КонецЕсли;
		
		мКому = Новый Массив();
		Если ЗначениеЗаполнено(Подразделение.EmailСервисБюро) Тогда
			мКому.Добавить(Подразделение.EmailСервисБюро);
		Иначе
			АдресЭлПочты = киПолучитьПредставлениеКИ(Подразделение, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
			Если ЗначениеЗаполнено(АдресЭлПочты) Тогда
				мКому.Добавить(АдресЭлПочты);
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(Подразделение.РуководительСервиса) Тогда
			Руководитель = Подразделение.РуководительСервиса.Сотрудник;
		Иначе
			Руководитель = Справочники.Сотрудники.ПустаяСсылка();
		КонецЕсли;
		Если ЗначениеЗаполнено(Руководитель) Тогда
			Если ЗначениеЗаполнено(Руководитель.РабочийEmail) Тогда
				мКому.Добавить(Руководитель.РабочийEmail);
			Иначе
				АдресЭлПочты = киПолучитьПредставлениеКИ(Руководитель, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
				Если ЗначениеЗаполнено(АдресЭлПочты) Тогда
					мКому.Добавить(АдресЭлПочты);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если мКому.Количество() > 0 Тогда
			ТемаПисьма = "Уведомление о брошенных рабочих листах сервиса";
			ТелоПисьма = "По подразделению " + Подразделение + " имеются брошенные рабочие листы сервиса:" + Символы.ПС + Символы.ПС;
			РассылкаПоРабочимЛистам = РассылкаПоПодразделениям.Выбрать();
			Пока РассылкаПоРабочимЛистам.Следующий() Цикл
				ТелоПисьма = ТелоПисьма + РассылкаПоРабочимЛистам.Номер + ", дата контакта " + Формат(РассылкаПоРабочимЛистам.ДатаКонтакта, "ДЛФ=Д");
				ТелоПисьма = ТелоПисьма + ", менеджер " + РассылкаПоРабочимЛистам.Сотрудник + ";" + Символы.ПС;
			КонецЦикла;		
			мКопии = Новый Массив();
			г_Функции.СоздатьИОтпраитьЭлПисьмо(мКому, мКопии, ТемаПисьма, ТелоПисьма, Документы.ЗаказНаряд.ПустаяСсылка());
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
// Семенихин 08.12.2021 -----

// Семенихин 22.04.2022 +++++
Процедура ОповещениеОЗацикленныхЦепочкахОснований(Параметры = Неопределено)  Экспорт
	xmlЗапись = Новый ЗаписьXML;
	xmlЗапись.УстановитьСтроку();
	
	HelpDeskУзел = ПланыОбмена.ЗацикленныеЦепочкиОснований.НайтиПоКоду("HelpDesk");
	Если обЗначениеНеЗаполнено(HelpDeskУзел) Тогда
		Возврат;
	КонецЕсли;
	
	
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	ЗаписьСообщения.НачатьЗапись(xmlЗапись, HelpDeskУзел);
	
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(ЗаписьСообщения.Получатель, ЗаписьСообщения.НомерСообщения);
	Пока ВыборкаИзменений.Следующий() Цикл
	    ДокументСсылка = ВыборкаИзменений.Получить();
		Если ТипЗнч(ДокументСсылка) = Тип("УдалениеОбъекта") Тогда
			Продолжить;
		ИначеЕсли ДокументСсылка = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
	    //ЗаписатьXML(xmlЗапись, ДокументСсылка);
	КонецЦикла;
	
	ЗаписьСообщения.ЗакончитьЗапись();
КонецПроцедуры
// Семенихин 22.04.2022 ----- 

//Бондаренко++ 20240518
Процедура РассылкаОтчетаПоНеоплаченнымЗН(Параметры = Неопределено) Экспорт
	
	СтрокаСоединения = НРег(СтрокаСоединенияИнформационнойБазы());
	
	ЭтоРабочаяБаза = Найти(СтрокаСоединения, "1cserver") > 0 И Найти(СтрокаСоединения, "alfaauto") > 0;
	
	Если Не ЭтоРабочаяБаза Тогда
		Возврат;
	КонецЕсли;
  	
	обрФормироватьОтчет = Обработки.ЗакрытыеНоНеоплаченныеЗаказНаряды.Создать();
	обрФормироватьОтчет.Дата = НачалоДня(ТекущаяДата());
	обрФормироватьОтчет.СформироватьОтчет();
	обрФормироватьОтчет.РассылкаОтчетаПоНеоплаченнымЗН();
	
 
КонецПроцедуры  //РассылкаОтчетаПоНеоплаченнымЗН()
//Бондаренко-- 20240518

//Бондаренко++ 20240615
Процедура РассылкаОтчетаПоНезакрытымЗН(Параметры = Неопределено) Экспорт
	
	СтрокаСоединения = НРег(СтрокаСоединенияИнформационнойБазы());
	
	ЭтоРабочаяБаза = Найти(СтрокаСоединения, "1cserver") > 0 И Найти(СтрокаСоединения, "alfaauto") > 0;
	
	Если Не ЭтоРабочаяБаза Тогда
		Возврат;
	КонецЕсли;
  	
	обрФормироватьОтчет = Обработки.НезакрытыеЗаказНаряды.Создать();
	обрФормироватьОтчет.Дата = НачалоДня(ТекущаяДата());
	обрФормироватьОтчет.СформироватьОтчет();
	обрФормироватьОтчет.РассылкаОтчетаПоНезакрытымЗН();
  
КонецПроцедуры  //РассылкаОтчетаПоНезакрытымЗН()
//Бондаренко-- 20240615




 