
Процедура ЗаполнитьТаблицу(Автомобиль, VIN) Экспорт
	
	//Авто = Автомобиль;
	
	Результат.Очистить();
	ЗакрытьФорму = Ложь;
		
	Если НЕ ВнешнийЗапрос Тогда
	
		Если (НЕ ЗначениеЗаполнено(VIN)) Тогда
			
			#Если Клиент Тогда
				Вопрос("Необходимо ввести VIN для поиска.", РежимДиалогаВопрос.ОК,,,"Внимание!");
			#КонецЕсли
			Возврат;
			
		КонецЕсли;
	
	КонецЕсли;
	
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	Renault_ПоврежденияАвтомобилейСрезПоследних.Автомобиль.Ссылка КАК Ссылка,
		               |	Renault_ПоврежденияАвтомобилейСрезПоследних.Автомобиль.VIN КАК VIN,
		               |	Renault_ПоврежденияАвтомобилейСрезПоследних.Работа.Ссылка КАК Работа,
		               |	Renault_ПоврежденияАвтомобилейСрезПоследних.РаботаАктуальна,
		               |	Renault_ПоврежденияАвтомобилейСрезПоследних.Цвет,
		               |	Renault_ПоврежденияАвтомобилейСрезПоследних.Комментарий,
		               |	Renault_ПоврежденияАвтомобилейСрезПоследних.Период,
		               |	Renault_ПоврежденияАвтомобилейСрезПоследних.Регистратор.Клиент.Ссылка КАК Клиент,
		               |	Renault_ПоврежденияАвтомобилейСрезПоследних.Регистратор.Дата КАК Дата,
		               |	Renault_ПоврежденияАвтомобилейСрезПоследних.ПроцентИзноса КАК ПроцентИзноса
		               |ИЗ
		               |	РегистрСведений.Renault_ПоврежденияАвтомобилей.СрезПоследних КАК Renault_ПоврежденияАвтомобилейСрезПоследних";
					   
		Если ЗначениеЗаполнено(VIN) Тогда
						   
			Запрос.Текст = Запрос.Текст + Символы.ПС + "ГДЕ
		               		|	Renault_ПоврежденияАвтомобилейСрезПоследних.Автомобиль.VIN Подобно &VIN";
			Запрос.УстановитьПараметр("VIN", "%" + VIN + "%");
			
		ИначеЕсли Автомобиль <> Неопределено Тогда
							
			Запрос.Текст = Запрос.Текст + Символы.ПС + "ГДЕ
		               		|	Renault_ПоврежденияАвтомобилейСрезПоследних.Автомобиль = &Авто";
			Запрос.УстановитьПараметр("Авто", Автомобиль);  
		
		КонецЕсли;
		
			Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Количество() = 0 Тогда
			
			#Если Клиент Тогда
				Вопрос("По данному автомобилю история обслуживания не найдена.", РежимДиалогаВопрос.ОК,,,"Внимание!");
			#КонецЕсли
			
			Если ВнешнийЗапрос Тогда
				
				ЗакрытьФорму = ИСТИНА;
				
			КонецЕсли;
			
			Возврат;
			
		Иначе 
			
			//Авто = Выборка.Ссылка;
			
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = Результат.Добавить();
			НоваяСтрока.Владелец = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Выборка.Ссылка, Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин);
			НоваяСтрока.ГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Выборка.Ссылка, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
			НоваяСтрока.VIN = Выборка.VIN;
			НоваяСтрока.Заявитель = Выборка.Клиент;
			НоваяСтрока.ДатаРекомендации = Выборка.Дата;
			НоваяСтрока.Автомобиль = Выборка.Ссылка;
			Цвет = Выборка.Цвет;
			
			НоваяСтрока.Цвет = Цвет;
						
			НоваяСтрока.Рекоммендация = Выборка.Работа;
			НоваяСтрока.Актуальна = Выборка.РаботаАктуальна;
			
			НоваяСтрока.ПроцентИзноса = Выборка.ПроцентИзноса;
			
			
		КонецЦикла;
	
КонецПроцедуры


