
Функция Renault_НайтиКарточку(Контрагент) Экспорт	
	
	Если обЗначениеНеЗаполнено(Контрагент) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст = "ВЫБРАТЬ
	|	Карточки.Ссылка КАК Карточка
	|ИЗ
	|	Справочник.Карточки КАК Карточки
	|ГДЕ
	|	Карточки.Объект = &Контрагент
	|	И Карточки.КарточкаЗаблокирована = ЛОЖЬ";
	НайденныеКарточки = Запрос.Выполнить().Выгрузить();
	Если НайденныеКарточки.Количество() = 0 Тогда
		Возврат Неопределено;
	ИначеЕсли НайденныеКарточки.Количество() = 1 Тогда
		Возврат НайденныеКарточки[0].Карточка;
	Иначе
		Сообщить("По контрагенту " + Контрагент + " найдено несколько карточек! Выберите карточку вручную!");
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция Renault_ПодобратьСкидкуБезДокумента(Контрагент, ОбработкаРасчетСкидокАвторабот, ОбщееКоличествоАвтомобилей) Экспорт
	
	//// 1. Вызываем отраслевую функцию.
	//РезультатРаботы = орПолучитьСкидкуШапки(ДокументОбъект, ЭтотОбъект);
	//Если РезультатРаботы<>Неопределено Тогда
	//	Возврат РезультатРаботы;
	//КонецЕсли;
	
	//Если Не ОбработкаРасчетСкидокАвторабот.КэшИнициализирован Тогда
	//	// Запоминаем текущее значение права.
	//	СпособВыбораСкидки = обПраво("СпособВыбораСкидки", ДокументОбъект.Права,,ДокументОбъект);
	//	КэшИнициализирован = Истина;
	//КонецЕсли;
	//
	//Если СпособВыбораСкидки=Перечисления.СкидкиСпособыВыбора.СкидкиЗапрещены Тогда
	//	// Сразу возвращаемся. Пересчет ТЧ не делаем.
	//	Возврат Ложь;  		
	//КонецЕсли;
	
	//// 2. Инициализация "кэшеобразующих" реквизитов обработки.
	//ПодразделениеКомпании = ДокументОбъект[ИмяРеквизитаПодразделениеКомпании];
	//СкидкаНаценка         = ДокументОбъект[ИмяРеквизитаСкидкаНаценка];
	//Дата                  = ДокументОбъект.Дата;
	
	//// Склада и карточки может и не быть.
	//Попытка 
	//	Если ТипЗнч(ДокументОбъект[ИмяРеквизитаСкладКомпании]) = Тип("СправочникСсылка.Цеха") Тогда
	//		СкладКомпании = ДокументОбъект[ИмяРеквизитаСкладКомпании].СкладКомпании;
	//	Иначе
	//		СкладКомпании = ДокументОбъект[ИмяРеквизитаСкладКомпании];
	//	КонецЕсли;
	//Исключение
	//КонецПопытки;
	
	//Попытка
	//	Карточка = ДокументОбъект[ИмяРеквизитаКарточка];
	//Исключение КонецПопытки;
	
	ОбновитьКэшСтрочныхСкидок = Истина;
	ОбновитьКэшСкидок         = Истина;
	
	// 4. Определим, нужно ли выполнять пересчет кэша, как для шапочных скидок, так и для товарных (строчных).	
	Если (ОбработкаРасчетСкидокАвторабот.ПодразделениеКомпании<>ОбработкаРасчетСкидокАвторабот.ПодразделениеКомпанииСтароеЗначение) Или
		(ОбработкаРасчетСкидокАвторабот.СкладКомпании<>ОбработкаРасчетСкидокАвторабот.СкладКомпанииСтароеЗначение) Или
		(ОбработкаРасчетСкидокАвторабот.Дата<>ОбработкаРасчетСкидокАвторабот.ДатаСтароеЗначение) Или
		(ОбработкаРасчетСкидокАвторабот.Карточка<>ОбработкаРасчетСкидокАвторабот.КарточкаСтароеЗначение) Тогда
		
		ОбновитьКэшСкидок         = Истина; 
		ОбновитьКэшСтрочныхСкидок = Истина;
		
	ИначеЕсли (ОбработкаРасчетСкидокАвторабот.СкидкаНаценка<>ОбработкаРасчетСкидокАвторабот.СкидкаНаценкаСтароеЗначение) Тогда  		
		ОбновитьКэшСкидок         = Истина;
		ОбновитьКэшСтрочныхСкидок = Ложь;
	Иначе
		ОбновитьКэшСкидок         = Ложь;
		ОбновитьКэшСтрочныхСкидок = Ложь;
	КонецЕсли;
	
	// Один из "кэшеобразующих" реквизитов изменился, значит сохраняем новое значение реквизита.
	Если ОбновитьКэшСкидок Или ОбновитьКэшСтрочныхСкидок Тогда
		ОбработкаРасчетСкидокАвторабот.ПодразделениеКомпанииСтароеЗначение = ОбработкаРасчетСкидокАвторабот.ПодразделениеКомпании;
		ОбработкаРасчетСкидокАвторабот.СкладКомпанииСтароеЗначение         = ОбработкаРасчетСкидокАвторабот.СкладКомпании;
		ОбработкаРасчетСкидокАвторабот.СкидкаНаценкаСтароеЗначение         = ОбработкаРасчетСкидокАвторабот.СкидкаНаценка;
		ОбработкаРасчетСкидокАвторабот.ДатаСтароеЗначение                  = ОбработкаРасчетСкидокАвторабот.Дата;
		ОбработкаРасчетСкидокАвторабот.КарточкаСтароеЗначение              = ОбработкаРасчетСкидокАвторабот.Карточка;
	КонецЕсли;
	
	//// 5. Если прав у пользователя хватает только на ручные скидки,
	//// но при этом скидка не выбрана, то кэш будет пустой и скидка не подберется.
	//Если (СпособВыбораСкидки=Перечисления.СкидкиСпособыВыбора.РучныеСкидки) Или (СпособВыбораСкидки=Перечисления.СкидкиСпособыВыбора.РучныеСкидкиИРедактированиеПроцентов) Тогда
	//	// Обязательно должна быть задана ручная скидка в "кэшеобразующем" реквизите.
	//	Если СкидкаНаценка.Пустая() Тогда
	//		ОбновитьКэшСкидок = Ложь;
	//		КэшСкидок.Очистить();
	//	КонецЕсли;
	//КонецЕсли;
	
	//// Признак пересчета табличной части документа, после подбора скидки.
	//ТребуетсяПересчет = Ложь;
	
	// 6.1 Пересчитываем кэш, если нужно.
	Если ОбновитьКэшСкидок Тогда
		//ОбновитьКэшСкидок();
		//+++
		УчитыватьНакоплениеСуммПоКонтрагенту = Ложь;
		//Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ЗаказНаряд") ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ЗаявкаНаРемонт")  Тогда
		УчитыватьНакоплениеСуммПоКонтрагенту = Истина;
		//КонецЕсли;	
		ОбработкаРасчетСкидокАвторабот.ОбновитьКэшСкидок(УчитыватьНакоплениеСуммПоКонтрагенту, ?(обЗначениеНеЗаполнено(ОбработкаРасчетСкидокАвторабот.Карточка),Истина,Ложь), Контрагент, ОбщееКоличествоАвтомобилей,);
		//---
	КонецЕсли;
	
	// 6.2 Пересчитываем кэш строчных скидок.
	Если ОбновитьКэшСтрочныхСкидок И (Не ОбработкаРасчетСкидокАвторабот.НеРассчитыватьСтрочныеСкидки) Тогда
		ОбработкаРасчетСкидокАвторабот.ОбновитьКэшСтрочныхСкидок();
		//ТребуетсяПересчет = Истина; // Если изменились реквизиты, отвечающие за кэш строчных скидок, то придется пересчитать ТЧ.
	КонецЕсли;
	
	// 7. Получаем текущий тип скидки и текущее значение скидки, а также базу для расчета скидки.
	ТекущаяСкидкаНаценка  = Справочники.ТипыСкидок.ПустаяСсылка(); //ДокументОбъект[ИмяРеквизитаСкидкаНаценка];
	ТекущееЗначениеСкидки = 0; //ДокументОбъект[ИмяРеквизитаЗначениеСкидкиНаценки];
	
	//Если скидку принудительно отменили, то новую подбирать не надо
	//НеЗаменятьПустуюСкидку=Ложь;
	//Если обЗначениеНеЗаполнено(ТекущаяСкидкаНаценка) Тогда
	//	Если НЕ ДокументОбъект.ДополнительныеСвойства.Свойство("НеЗаменятьПустуюСкидку",НеЗаменятьПустуюСкидку) Тогда
	//		НеЗаменятьПустуюСкидку=Ложь;
	//	КонецЕсли; 
	//КонецЕсли;
	//Если НеЗаменятьПустуюСкидку Тогда
	ТекущееЗначениеСкидки = 0;
	ТекущаяСуммаСкидки    = 0; 
	//	ТребуетсяПересчет     = Истина;
	//	Возврат ТребуетсяПересчет;
	//КонецЕсли; 
	
	БазаДляРасчетаСкидкиСтароеЗначение = ОбработкаРасчетСкидокАвторабот.СуммаДляРасчетаШапочнойСкидки;
	
	//Попытка
	//	БазаДляРасчетаСкидкиТЧ		= ДокументОбъект.ПолучитьБазуДляРасчетаСкидки(ЭтотОбъект);
	//	Если БазаДляРасчетаСкидкиТЧ = Неопределено Тогда
	//		БазаДляРасчетаСкидки	= ПолучитьСуммуДокументаБезСкидки(ДокументОбъект, ДокументОбъект[ИмяТабличнойЧасти],,ИмяТабличнойЧасти);
	//	Иначе
	//		БазаДляРасчетаСкидки	= БазаДляРасчетаСкидкиТЧ;
	//	КонецЕсли;
	//Исключение
	//	БазаДляРасчетаСкидки		= ПолучитьСуммуДокументаБезСкидки(ДокументОбъект, ДокументОбъект[ИмяТабличнойЧасти],,ИмяТабличнойЧасти);
	//КонецПопытки;
	ОбработкаРасчетСкидокАвторабот.БазаДляРасчетаСкидки = 0;
	
	//Если ОбработкаРасчетСкидокАвторабот.НеРассчитыватьСтрочныеСкидки Тогда
	//	СуммаДляРасчетаШапочнойСкидки = БазаДляРасчетаСкидки;
	//Иначе
	//	МассивСтрокСВытеснением = Новый Массив;
	//	Попытка
	//		ТабличнаяЧасть = ДокументОбъект[ИмяТабличнойЧасти];
	//		Для Каждого ТекСтрока Из ТабличнаяЧасть Цикл
	//			Если ВСтрокеВытесняющаяСкидка(ДокументОбъект, ТекСтрока) Тогда
	//				МассивСтрокСВытеснением.Добавить(ТабличнаяЧасть.Индекс(ТекСтрока));
	//			КонецЕсли;
	//		КонецЦикла;
	//	Исключение
	//	КонецПопытки;
	//	
	//	Если МассивСтрокСВытеснением.Количество() = 0 Тогда
	//		СуммаДляРасчетаШапочнойСкидки = БазаДляРасчетаСкидки;
	//	Иначе
	//		Попытка
	//			БазаДляРасчетаСкидкиТЧ      = ДокументОбъект.ПолучитьБазуДляРасчетаСкидки(ЭтотОбъект);
	//			Если БазаДляРасчетаСкидкиТЧ = Неопределено Тогда
	//				СуммаДляРасчетаШапочнойСкидки = ПолучитьСуммуДокументаБезСкидки(ДокументОбъект, ДокументОбъект[ИмяТабличнойЧасти], МассивСтрокСВытеснением,ИмяТабличнойЧасти);
	//			Иначе
	//				СуммаДляРасчетаШапочнойСкидки = БазаДляРасчетаСкидкиТЧ;
	//			КонецЕсли;
	//		Исключение
	//			СуммаДляРасчетаШапочнойСкидки     = ПолучитьСуммуДокументаБезСкидки(ДокументОбъект, ДокументОбъект[ИмяТабличнойЧасти], МассивСтрокСВытеснением,ИмяТабличнойЧасти);
	//		КонецПопытки;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	ОбработкаРасчетСкидокАвторабот.СуммаДляРасчетаШапочнойСкидки = 0;
	
	БазаДляРасчетаСкидкиИзменилась  = (БазаДляРасчетаСкидкиСтароеЗначение<>ОбработкаРасчетСкидокАвторабот.СуммаДляРасчетаШапочнойСкидки);
	ТекущаяСкидкаРучная             = Ложь; //ТекущаяСкидкаНаценка.РучнаяСкидка;
	
	// 8. Если кэш пуст... 
	Если ОбработкаРасчетСкидокАвторабот.КэшСкидок.Количество()=0 Тогда
		Если Не ТекущаяСкидкаРучная Тогда
			ТекущаяСкидкаНаценка = Справочники.ТипыСкидок.ПустаяСсылка();
		КонецЕсли;			
		//Если ТекущееЗначениеСкидки<>0 Тогда
		//	ТребуетсяПересчет     = Истина;
		//	ТекущееЗначениеСкидки = 0;
		//	ТекущаяСуммаСкидки    = 0; 
		//КонецЕсли;
		//
		//Возврат ТребуетсяПересчет; 
	КонецЕсли;
	
	// 9. Поиск подходящей скидки. Если скидок в кэше несколько, то подберем скидку дающую наибольшую сумму скидки.
	// Не забываем отсеять скидки, сумма чека которых превышает текущую базу для расчета (сумму документа).
	КоэффициентПересчетаВВалютуДокумента = 1; //?((ДокументОбъект.КурсДокумента=0) ИЛИ (ДокументОбъект.ВалютаДокумента=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить()), 1, ДокументОбъект.КурсДокумента);
	
	//Попытка
	//	ЭтотНовыйДокумент = ДокументОбъект.ЭтоНовый();
	//Исключение
	ЭтотНовыйДокумент = Истина;
	//КонецПопытки;
	//СсылкаДокумент = ДокументОбъект.Ссылка;
	СтруктураВыборки = Новый Структура("Объект, Свойство", Неопределено, Неопределено);
	
	Для Каждого ТекСтрокаКэша Из ОбработкаРасчетСкидокАвторабот.КэшСкидок Цикл
		ОтказПоНесовпадениюСвойства = Ложь;
		Если ЗначениеЗаполнено(ТекСтрокаКэша.ВидСвойства) И ЗначениеЗаполнено(ТекСтрокаКэша.Свойство) Тогда
			Если ТекСтрокаКэша.ПоДатеГарантии Тогда
				ОтказПоНесовпадениюСвойства = Истина;
			КонецЕсли;
			//Если ЭтотНовыйДокумент Тогда
			//	ОтказПоНесовпадениюСвойства = Истина;
			//Иначе
			//	СтруктураВыборки.Объект = СсылкаДокумент;
			//	СтруктураВыборки.Свойство = ТекСтрокаКэша.ВидСвойства;
			//	СтрСвойств = РегистрыСведений.ЗначенияСвойствОбъектов.Получить(СтруктураВыборки);
			//	Если СтрСвойств.Значение <> ТекСтрокаКэша.Свойство Тогда
			//		ОтказПоНесовпадениюСвойства = Истина
			//	КонецЕсли;
			//КонецЕсли;
			
			////+++
			////Если ДокументОбъект.Метаданные().Реквизиты.Найти("Автомобиль") <> Неопределено И 
			////	 ДокументОбъект.Метаданные().Реквизиты.Найти("Контрагент") <> Неопределено Тогда
			//	 
			//	ОтказПоНесовпадениюСвойства = Истина;
			//	Если ЗначениеЗаполнено(Контрагент) Тогда
			//		Если ТипЗнч(ДокументОбъект.Автомобиль) = Тип("СправочникСсылка.Автомобили") Тогда
			//			Если ТипЗнч(ТекСтрокаКэша.ВидСвойства) = Тип("ПланВидовХарактеристикСсылка.СвойстваОбъектов") И ТекСтрокаКэша.ВидСвойства = ПланыВидовХарактеристик.СвойстваОбъектов._МодельРено Тогда
			//				ЗначениеСвойства = ЧтениеЗначенияСвойства(ДокументОбъект.Автомобиль.Модель, ПланыВидовХарактеристик.СвойстваОбъектов._МодельРено);
			//			Иначе	
			//				ЗначениеСвойства = ДокументОбъект.Автомобиль.Модель;
			//			КонецЕсли;	
			//		Иначе
			//			ЗначениеСвойства = Неопределено;
			//		КонецЕсли;
			//		Если ЗначениеСвойства = ТекСтрокаКэша.Свойство Тогда
			//			ОтказПоНесовпадениюСвойства = Ложь;
			//		//Иначе
			//		//	Если ЗначениеЗаполнено(ДокументОбъект.Автомобиль.ДатаНачалаГарантии) И
			//		//		(НачалоДня(ДокументОбъект.Дата) - НачалоДня(ДокументОбъект.Автомобиль.ДатаНачалаГарантии) >= 94608000)Тогда
			//		//		ОтказПоНесовпадениюСвойства = Ложь;
			//		//	КонецЕсли;
			//		КонецЕсли;
			//	КонецЕсли;
			////КонецЕсли;
			////---
			
		КонецЕсли;
		
		//+++
		ОтказПоНесовпадениюФормыСобственнности = Ложь;
		Если ЗначениеЗаполнено(ТекСтрокаКэша.ФормаСобственности) Тогда //И ДокументОбъект.Метаданные().Реквизиты.Найти("Контрагент") <> Неопределено Тогда
			Если ЗначениеЗаполнено(Контрагент) Тогда 
				Если ТекСтрокаКэша.ФормаСобственности <> Контрагент.ФормаСобственности Тогда
					ОтказПоНесовпадениюФормыСобственнности = ИСтина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ОтказПоДатеГарантии = Ложь;
		//Если ТекСтрокаКэша.ПоДатеГарантии И ДокументОбъект.Метаданные().Реквизиты.Найти("Автомобиль") <> Неопределено Тогда
		//	Если ЗначениеЗаполнено(ДокументОбъект.Автомобиль) Тогда 
		//		Если ТипЗнч(ДокументОбъект.Автомобиль) = Тип("СправочникСсылка.Автомобили") И ЗначениеЗаполнено(ДокументОбъект.Автомобиль.ДатаНачалаГарантии) Тогда
		//			Если (НачалоДня(ДокументОбъект.Дата) - НачалоДня(ДокументОбъект.Автомобиль.ДатаНачалаГарантии) <= 94608000) Тогда //3 года
		//				Пробег = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ДокументОбъект.Автомобиль,Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег,ДокументОбъект.Дата);
		//				Если ЗначениеЗаполнено(Пробег) И Пробег <= 100000 Тогда
		//					ОтказПоДатеГарантии = Истина;
		//				КонецЕсли;	
		//			КонецЕсли;
		//		Иначе	
		//			ОтказПоДатеГарантии = Истина;
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;
		//---
		
		ОтСуммыЧекаВВалютеДокумента = ТекСтрокаКэша.ОтСуммыЧека / КоэффициентПересчетаВВалютуДокумента;
		
		Если ОтСуммыЧекаВВалютеДокумента>ОбработкаРасчетСкидокАвторабот.БазаДляРасчетаСкидки Тогда // Сумма документа недостаточна для скидки
			ТекСтрокаКэша.РассчитаннаяСуммаСкидки = 0;
			ТекСтрокаКэша.НеПодходит             = Истина;
			//ИначеЕсли ОтказПоНесовпадениюСвойства Тогда
			//+++
		ИначеЕсли ОтказПоНесовпадениюСвойства ИЛИ ОтказПоНесовпадениюФормыСобственнности ИЛИ ОтказПоДатеГарантии Тогда
			//---
			ТекСтрокаКэша.РассчитаннаяСуммаСкидки = 0;
			ТекСтрокаКэша.НеПодходит             = Истина;
		Иначе
			ТекСтрокаКэша.НеПодходит = Ложь;
			// Раcсчитываем сумму скидки.
			Если ТекСтрокаКэша.СпособВычисления = Перечисления.СкидкиСпособВычисления.Относительная Тогда
				ТекСтрокаКэша.РассчитаннаяСуммаСкидки = ОбработкаРасчетСкидокАвторабот.СуммаДляРасчетаШапочнойСкидки * ТекСтрокаКэша.ЗначениеСкидки / 100;
			Иначе
				// Если скидка абсолютная, то ее значение - это сумма в валюте рег. учета.
				// Выполним пересчет в валюту документа.
				ТекСтрокаКэша.РассчитаннаяСуммаСкидки = ТекСтрокаКэша.ЗначениеСкидки / КоэффициентПересчетаВВалютуДокумента;
				
				// Если сумма абсолютной скидки превышает значение базы для расчета скидки (т.е больше суммы документа), 
				// то итоговая сумма уйдет в минус, поэтому такая скидка не подойдет.
				Если ТекСтрокаКэша.РассчитаннаяСуммаСкидки>ОбработкаРасчетСкидокАвторабот.СуммаДляРасчетаШапочнойСкидки Тогда
					ТекСтрокаКэша.НеПодходит = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Сортируем по убыванию.
	ОбработкаРасчетСкидокАвторабот.КэшСкидок.Сортировать("НеПодходит ВОЗР, ЭтоПодарок УБЫВ, ФлагВытеснения УБЫВ, РассчитаннаяСуммаСкидки УБЫВ, ЗначениеСкидки УБЫВ");
	
	Если Не ОбработкаРасчетСкидокАвторабот.КэшСкидок[0].НеПодходит Тогда
		// Подходящая скидка найдена, сразу заполним итоговую сумму скидки на документ.
		НайденноеЗначениеСкидки = ?(ОбработкаРасчетСкидокАвторабот.КэшСкидок[0].СпособВычисления = Перечисления.СкидкиСпособВычисления.Абсолютная, ОбработкаРасчетСкидокАвторабот.КэшСкидок[0].РассчитаннаяСуммаСкидки, ОбработкаРасчетСкидокАвторабот.КэшСкидок[0].ЗначениеСкидки);
		ТекущаяСуммаСкидки = ОбработкаРасчетСкидокАвторабот.КэшСкидок[0].РассчитаннаяСуммаСкидки;
		Если (ТекущаяСкидкаНаценка<>ОбработкаРасчетСкидокАвторабот.КэшСкидок[0].Скидка) ИЛИ (ТекущееЗначениеСкидки<>НайденноеЗначениеСкидки) Тогда
			ОбработкаРасчетСкидокАвторабот.ТекущаяСкидкаНаценка  = ОбработкаРасчетСкидокАвторабот.КэшСкидок[0].Скидка;
			ОбработкаРасчетСкидокАвторабот.ТекущееЗначениеСкидки = НайденноеЗначениеСкидки;
			//ТребуетсяПересчет     = Истина;
			
		ИначеЕсли БазаДляРасчетаСкидкиИзменилась И (ТекущаяСкидкаНаценка.СпособВычисления=Перечисления.СкидкиСпособВычисления.Абсолютная) Тогда
			// Если тип и значение скидки не изменились, но произошло изменение суммовой базы для расчета абсолютной скидки, то
			// придется пересчитать табличную часть.
			//ТребуетсяПересчет = Истина;
		КонецЕсли;
	Иначе 
		Если Не ТекущаяСкидкаРучная Тогда
			ОбработкаРасчетСкидокАвторабот.ТекущаяСкидкаНаценка = Справочники.ТипыСкидок.ПустаяСсылка();
		КонецЕсли;
		Если ТекущееЗначениеСкидки<>0 Тогда
			//ТребуетсяПересчет     = Истина;
			ОбработкаРасчетСкидокАвторабот.ТекущееЗначениеСкидки = 0;
			ОбработкаРасчетСкидокАвторабот.ТекущаяСуммаСкидки    = 0; 
		КонецЕсли;
	КонецЕсли;
	
	Выполнить("ОбработкаРасчетСкидокАвторабот.ТекущаяСуммаСкидки=дкОкруглитьСуммуСкидки(ОбработкаРасчетСкидокАвторабот.ТекущаяСуммаСкидки,ОбработкаРасчетСкидокАвторабот.ТекущаяСкидкаНаценка)");
	
	//Возврат ТребуетсяПересчет;
	Возврат Истина;
	
КонецФункции // ПолучитьСкидкуШапки() 

//Наши собственные скидки. Получаем все.
Функция НайтиДоступныеСкидкиПоКлиенту(Контрагент) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	//Если Контрагент.ФормаСобственности <> Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
	//	
	//	Возврат Неопределено;
	//	
	//КонецЕсли;
	
	
	Запрос = Новый Запрос;
	
	ЮрФизЛицо = КонтрагентЮрФизЛицо(Контрагент,Renault_CRM.ПолучитьДилерскийЦентрПользователя());//DMS
	Запрос.УстановитьПараметр("ЮрФизЛицо",ЮрФизЛицо);//DMS
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	КартыЛояльности.Ссылка КАК Карта,
	               |	КартыЛояльности.ПрограммаЛояльности.Ссылка КАК ПрограммаЛояльности,
	               |	ЕСТЬNULL(КартыЛояльности.ПрограммаЛояльности.ЗапчастиСкидкаВнутренняя, 0) КАК Процент_Отчисления_Баллов_Запчасти,
	               |	ЕСТЬNULL(КартыЛояльности.ПрограммаЛояльности.ЗапчастиСкидкаВнешняя, 0) КАК Скидка_На_Запчасти,
	               |	ЕСТЬNULL(КартыЛояльности.ПрограммаЛояльности.ЗапчастиКурсБаллов, 0) КАК Коэффициент_Баллов_Запчасти,
	               |	ЕСТЬNULL(КартыЛояльности.ПрограммаЛояльности.ЗапчастиМаксимумБалловОплата, 0) КАК Максимум_Оплаты_Баллами_Запчасти,
	               |	ЕСТЬNULL(КартыЛояльности.ПрограммаЛояльности.ЗапчастиМаксимумБалловОплатаПроцент, 0) КАК Максимальный_Процент_Оплаты_Баллами_Запчасти,
	               |	ЕСТЬNULL(КартыЛояльности.ПрограммаЛояльности.РаботыСкидкаВнутренняя, 0) КАК Процент_Отчисления_Баллов_Работы,
	               |	ЕСТЬNULL(КартыЛояльности.ПрограммаЛояльности.РаботыСкидкаВнешняя, 0) КАК Скидка_На_Работы,
	               |	ЕСТЬNULL(КартыЛояльности.ПрограммаЛояльности.РаботыКурсБаллов, 0) КАК Коэффициент_Баллов_Работы,
	               |	ЕСТЬNULL(КартыЛояльности.ПрограммаЛояльности.РаботыМаксимумБалловОплата, 0) КАК Максимум_Оплаты_Баллами_Работы,
	               |	ЕСТЬNULL(КартыЛояльности.ПрограммаЛояльности.РаботыМаксимумБалловОплатаПроцент, 0) КАК Максимальный_Процент_Оплаты_Баллами_Работы,
	               |	ЕСТЬNULL(ОстаткиБаллов.КоличествоБалловОстаток, 0) КАК Остаток_Баллов,
	               |	КартыЛояльности.Код КАК Номер_Карты
	               |ИЗ
	               |	Справочник.Renault_КартыЛояльности КАК КартыЛояльности
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Renault_ОстаткиБаллов.Остатки(
	               |				&ТекущаяДата,
	               |				ПогаситьДо >= &ТекущаяДата
	               |					ИЛИ ПогаситьДо = &ПустаяДата) КАК ОстаткиБаллов
	               |		ПО (ОстаткиБаллов.КартаЛояльности = КартыЛояльности.Ссылка)
	               |ГДЕ
	               |	КартыЛояльности.Контрагент = &Контрагент
	               |	И КартыЛояльности.Недействительна = ЛОЖЬ
	               |	И КартыЛояльности.ПометкаУдаления = ЛОЖЬ
	               |	И (ЕСТЬNULL(КартыЛояльности.ПрограммаЛояльности.DMS_ЮрФизЛицо, ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.ПустаяСсылка)) = &ЮрФизЛицо
	               |			ИЛИ ЕСТЬNULL(КартыЛояльности.ПрограммаЛояльности.DMS_ЮрФизЛицо, ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.ПустаяСсылка))";
		
	
	Запрос.УстановитьПараметр("ТекущаяДата", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101")); 
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Процедура Renault_СписатьНачислитьБаллы(Контрагент, ЗаказНаряд = Неопределено) Экспорт
	
	//Если Контрагент.ФормаСобственности <> Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
	//	Возврат;
	//КонецЕсли;
	
	//DMS +
	
	Карта_ПрограммаЛояльности = Справочники.Renault_КартыЛояльности.ПустаяСсылка();
	
	КартаЛояльностиКлиента = ПолучитьКартуЛояльностиКлиента(Контрагент);
	
	НоваяКарта = Ложь;
	
	Если ЗначениеЗаполнено(КартаЛояльностиКлиента) Тогда
		
		Карта_ПрограммаЛояльности = Renault_ПредложитьКлиентуКарту(Контрагент, КартаЛояльностиКлиента, ЗаказНаряд);
		
		Если Не ЗначениеЗаполнено(Карта_ПрограммаЛояльности) Тогда
			Карта_ПрограммаЛояльности = КартаЛояльностиКлиента;
		КонецЕсли; 
		
	Иначе 

		ТекущаяДата = НачалоДня(ТекущаяДата());
		
		мОрганизация = ?(ЗаказНаряд = Неопределено,Справочники.Организации.ПустаяСсылка(),ЗаказНаряд.Организация);
		
		Карта_ПрограммаЛояльности = ПроверитьВозможностьВыдачиКартыБонусной(мОрганизация,Контрагент,ТекущаяДата,ЗаказНаряд);

		Если Не ЗначениеЗаполнено(Карта_ПрограммаЛояльности) Тогда
			Карта_ПрограммаЛояльности = Renault_ПредложитьКлиентуКарту(Контрагент, , ЗаказНаряд);
		КонецЕсли; 
		
		НоваяКарта = ЗначениеЗаполнено(Карта_ПрограммаЛояльности);
		
	КонецЕсли; 
	
	Если НоваяКарта Тогда
		Возврат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Карта_ПрограммаЛояльности) 
		И ЗначениеЗаполнено(ЗаказНаряд) Тогда
		
		ДанныеПоСкидкамИБаллам = Renault_АвтосервисСкидки.ПолучитьИнформациюПоСкидкамИБонусамПоКонтрагенту(Контрагент,Карта_ПрограммаЛояльности);
		
		ВсегоБаллов = 0;
		
		Если ДанныеПоСкидкамИБаллам.ПроцентОтчисленияБалловЗапчасти > 0 Тогда
			
			НачислитьБаллыЗапчасти = ДанныеПоСкидкамИБаллам.ПроцентОтчисленияБалловЗапчасти * ЗаказНаряд.СуммаНоменклатурыДокумента /100;
			
			ВсегоБаллов = НачислитьБаллыЗапчасти; 
			
			Если ЗаказНаряд.Заказчик <> ЗаказНаряд.Контрагент Тогда
				
				ВсегоБаллов = 0;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ДанныеПоСкидкамИБаллам.ПроцентОтчисленияБалловРаботы > 0 Тогда
			
			НачислитьБаллыРаботы = ДанныеПоСкидкамИБаллам.ПроцентОтчисленияБалловРаботы * ЗаказНаряд.СуммаРаботДокумента / 100;	
			
			ВсегоБаллов = ВсегоБаллов + НачислитьБаллыРаботы;
			
			Если ЗаказНаряд.Заказчик <> ЗаказНаряд.Контрагент Тогда
				
				ВсегоБаллов = 0;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ВсегоБаллов > 0 Тогда
			
			ВсегоБалловНачислено = Окр(ВсегоБаллов, 2);
			
			Если ТипЗнч(Карта_ПрограммаЛояльности) = Тип("СправочникСсылка.Renault_КартыЛояльности")//DMS
				И ЗначениеЗаполнено(Карта_ПрограммаЛояльности) Тогда
				Renault_ЗаписатьОстатокБаллов(Контрагент, Карта_ПрограммаЛояльности, 0, ВсегоБалловНачислено, ЗаказНаряд);
			КонецЕсли; 
			
		КонецЕсли;
				
	КонецЕсли; 
	
	//DMS -
	
	//
	//ДоступныеСкидки = НайтиДоступныеСкидкиПоКлиенту(Контрагент);
	//
	//Если НЕ ЗначениеЗаполнено(ДоступныеСкидки) Тогда
	//	//DMS +

	//	ТекущаяДата = НачалоДня(ТекущаяДата());
	//	
	//	мОрганизация = ?(ЗаказНаряд = Неопределено,Справочники.Организации.ПустаяСсылка(),ЗаказНаряд.Организация);
	//	
	//	Карта_ПрограммаЛояльности = ПроверитьВозможностьВыдачиКартыБонусной(мОрганизация,Контрагент,ТекущаяДата);
	//	//DMS -

	//	Если Не ЗначениеЗаполнено(Карта_ПрограммаЛояльности) Тогда
	//		Карта_ПрограммаЛояльности = Renault_ПредложитьКлиентуКарту(Контрагент, , ЗаказНаряд);
	//	КонецЕсли; 
	//	
	//	Возврат;
	//	
	//Иначе
	//	
	//	Карта_ПрограммаЛояльности = Renault_ПредложитьКлиентуКарту(Контрагент, ДоступныеСкидки[0].Карта, ЗаказНаряд)
	//	
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(ЗаказНаряд) Тогда
	//	
	//	ВсегоБаллов = 0;
	//	
	//	Если ДоступныеСкидки[0].Процент_Отчисления_Баллов_Запчасти > 0 Тогда
	//		
	//		НачислитьБаллыЗапчасти = ДоступныеСкидки[0].Процент_Отчисления_Баллов_Запчасти * ЗаказНаряд.СуммаНоменклатурыДокумента /100;
	//		
	//		ВсегоБаллов = НачислитьБаллыЗапчасти; 
	//		
	//		Если ЗаказНаряд.Заказчик <> ЗаказНаряд.Контрагент Тогда
	//			
	//			ВсегоБаллов = 0;
	//			
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	
	//	Если ДоступныеСкидки[0].Процент_Отчисления_Баллов_Работы > 0 Тогда
	//		
	//		НачислитьБаллыРаботы = ДоступныеСкидки[0].Процент_Отчисления_Баллов_Работы * ЗаказНаряд.СуммаРаботДокумента / 100;	
	//		
	//		ВсегоБаллов = ВсегоБаллов + НачислитьБаллыРаботы;
	//		
	//		Если ЗаказНаряд.Заказчик <> ЗаказНаряд.Контрагент Тогда
	//			
	//			ВсегоБаллов = 0;
	//			
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	
	//	Если ВсегоБаллов > 0 Тогда
	//		
	//		ВсегоБалловНачислено = Окр(ВсегоБаллов, 2);
	//		
	//		Если ТипЗнч(Карта_ПрограммаЛояльности) = Тип("СправочникСсылка.Renault_КартыЛояльности")//DMS
	//			И ЗначениеЗаполнено(Карта_ПрограммаЛояльности) Тогда
	//			Renault_ЗаписатьОстатокБаллов(Контрагент, Карта_ПрограммаЛояльности, 0, ВсегоБалловНачислено, ЗаказНаряд);
	//		Иначе 
	//			Renault_ЗаписатьОстатокБаллов(Контрагент, ДоступныеСкидки[0].Карта, 0, ВсегоБалловНачислено, ЗаказНаряд);
	//		КонецЕсли; 
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
КонецПроцедуры

Процедура Renault_ЗаписатьОстатокБаллов(Контрагент, КартаЛояльности, КоличествоБалловСписано, КоличествоБалловНачислено, ЗаказНаряд = Неопределено, ЗаявкаНаСервис = Неопределено, Предварительно = Ложь) Экспорт
	
	Если ЗначениеЗаполнено(ЗаявкаНаСервис) Тогда
		
		ДокументСсылка = Документы.Renault_СписаниеНачислениеБаллов.НайтиПоРеквизиту("ЗаявкаНаСервис", ЗаявкаНаСервис);
		
		Если ЗначениеЗаполнено(ДокументСсылка) Тогда
			
			Документ = ДокументСсылка.Ссылка.ПолучитьОбъект();
			
		Иначе
			
			Документ = Документы.Renault_СписаниеНачислениеБаллов.СоздатьДокумент();
			Документ.Ответственный = ПараметрыСеанса.Пользователь;
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(ЗаказНаряд) Тогда
			
			ДокументСсылка = Документы.Renault_СписаниеНачислениеБаллов.НайтиПоРеквизиту("ЗаказНаряд", ЗаказНаряд);
			
			Если Не ЗначениеЗаполнено(ДокументСсылка) 
				И ЕстьВыдачаИлиЗаменаНаОснованииЗаказНаряда(ЗаказНаряд) Тогда
				Возврат;
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(ДокументСсылка) Тогда
				
				Документ = ДокументСсылка.Ссылка.ПолучитьОбъект();
				Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				
			Иначе
				
				Документ = Документы.Renault_СписаниеНачислениеБаллов.СоздатьДокумент();
				Документ.Ответственный = ПараметрыСеанса.Пользователь;
				
			КонецЕсли;
			
		Иначе
			
			Документ = Документы.Renault_СписаниеНачислениеБаллов.СоздатьДокумент();
			Документ.Ответственный = ПараметрыСеанса.Пользователь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КоличествоБалловСписано) Тогда
		
		Документ.КоличествоБалловСписано = КоличествоБалловСписано;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КоличествоБалловНачислено) Тогда
		
		Документ.КоличествоБалловНачислено = КоличествоБалловНачислено;
		
		Если ЗначениеЗаполнено(КартаЛояльности.ПрограммаЛояльности.СрокДействияБаллов) Тогда
			
			Документ.ПогаситьДо = КонецДня(ТекущаяДата() + КартаЛояльности.ПрограммаЛояльности.СрокДействияБаллов * 60 * 60 * 24);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Документ.Дата = ТекущаяДата();
	Документ.КартаЛояльности = КартаЛояльности;
	Документ.Контрагент = Контрагент;
	
	Если Документ.ЭтоНовый() Тогда //DMS+
		Документ.УстановитьНовыйНомер();
		Документ.Ответственный = ПараметрыСеанса.Пользователь;
	КонецЕсли; //DMS- 
	
	Документ.ЗаказНаряд = ЗаказНаряд;
	
	Если ЗначениеЗаполнено(ЗаявкаНаСервис) Тогда
		
		Документ.ЗаявкаНаСервис = ЗаявкаНаСервис;
		Документ.Обращение = ЗаявкаНаСервис.Обращение;
		
	КонецЕсли;
	
	Если Предварительно Тогда
		
		Документ.Записать(РежимЗаписиДокумента.Запись);
		
	Иначе
		
		Если Документ.ПометкаУдаления Тогда
			Документ.ПометкаУдаления = Ложь;
		КонецЕсли; 
		
		Документ.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЕсли;
	
КонецПроцедуры

Функция Renault_ПредложитьКлиентуКарту(Контрагент, СуществующаяКарта = Неопределено, ЗаказНаряд) Экспорт
	
	//DMS +
	
	Если ЗначениеЗаполнено(СуществующаяКарта) Тогда
		
		ТекущаяДата = НачалоДня(ТекущаяДата());
		
		мОрганизация = ?(ЗаказНаряд = Неопределено,Справочники.Организации.ПустаяСсылка(),ЗаказНаряд.Организация);
		
		Возврат ПроверитьКартуНаВозможностьЗамены(мОрганизация,Контрагент,СуществующаяКарта,ТекущаяДата,ЗаказНаряд);
	
	КонецЕсли;
	
	//DMS -
	
	СписокПрограмм = Новый СписокЗначений();
	
	ЮрФизЛицо = КонтрагентЮрФизЛицо(Контрагент,Renault_CRM.ПолучитьДилерскийЦентрПользователя());//DMS
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ЮрФизЛицо",ЮрФизЛицо); //DMS
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПравилаУчастия.Ссылка,
		|	ПравилаУчастия.СуммаВсегоРаботОт КАК СуммаВсегоРаботОт,
		|	ПравилаУчастия.СуммаВсегоЗапчастейОт КАК СуммаВсегоЗапчастейОт,
		|	ПравилаУчастия.ПрограммаЛояльности КАК ПрограммаЛояльности,
		|	ПравилаУчастия.ПериодПроверкиРабот,
		|	ПравилаУчастия.ПериодПроверкиЗапчастей,
		|	ПравилаУчастия.СуммаВсегоЗаказНарядОт,
		|	ПравилаУчастия.СуммаВсегоРаботДо,
		|	ПравилаУчастия.СуммаВсегоЗапчастейДо,
		|	ПравилаУчастия.СуммаВсегоЗаказНарядДо,
		|	ПравилаУчастия.ПериодПроверкиСуммыДокумента,
		|	ЕСТЬNULL(ПравилаУчастия.ПрограммаЛояльности.Уровень, 0) КАК УровеньПрограммы,
		|	ПравилаУчастия.ДействуетДляОрганизации
		|ИЗ
		|	Справочник.Renault_ПравилаУчастияВПрограммеЛояльности КАК ПравилаУчастия
		|ГДЕ
		|	(ЕСТЬNULL(ПравилаУчастия.ПрограммаЛояльности.DMS_ЮрФизЛицо, ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.ПустаяСсылка)) = &ЮрФизЛицо
		|			ИЛИ ЕСТЬNULL(ПравилаУчастия.ПрограммаЛояльности.DMS_ЮрФизЛицо, ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.ПустаяСсылка))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПравилаУчастия.СуммаВсегоРаботДо УБЫВ,
		|	ПравилаУчастия.СуммаВсегоЗапчастейДо УБЫВ";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(СуществующаяКарта) Тогда
			
			Если Выборка.ПрограммаЛояльности = СуществующаяКарта.ПрограммаЛояльности Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Если Выборка.УровеньПрограммы <= СуществующаяКарта.ПрограммаЛояльности.Уровень Тогда
				
				Продолжить;
				
			КонецЕсли;
			
		КонецЕсли;
		
		//проверяем сумму по работам		
		Если ЗначениеЗаполнено(Выборка.СуммаВсегоРаботОт) ИЛИ ЗначениеЗаполнено(Выборка.СуммаВсегоРаботДо) Тогда 
			
			ЗапросСуммаРабот = Новый Запрос;
			
			ЗапросСуммаРабот.Текст = "ВЫБРАТЬ
			                         |	ЕСТЬNULL(СУММА(ЗаказНаряд.СуммаРаботДокумента), 0) КАК СуммаРаботДокумента
			                         |ИЗ
			                         |	Документ.ЗаказНаряд КАК ЗаказНаряд
			                         |ГДЕ
			                         |	ЗаказНаряд.ДатаЗакрытия МЕЖДУ &Период И &ТекущаяДата
			                         |	И ЗаказНаряд.Заказчик = &Заказчик
			                         |	И ЗаказНаряд.Организация = &Организация
			                         |	И (НЕ ЗаказНаряд.ВидРемонта В(&ВидРемонта))";
									 
			ЗапросСуммаРабот.УстановитьПараметр("Организация", Выборка.ДействуетДляОрганизации);
			ЗапросСуммаРабот.УстановитьПараметр("ВидРемонта", Выборка.Ссылка.ИключаемыеВидыРемонта.ВыгрузитьКолонку("ВидРемонта"));
			
			ТекущаяДата = НачалоДня(ТекущаяДата());
			
			ЗапросСуммаРабот.УстановитьПараметр("Заказчик", Контрагент);
			ЗапросСуммаРабот.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
			ЗапросСуммаРабот.УстановитьПараметр("Период", ТекущаяДата - Выборка.ПериодПроверкиРабот*3600*24);
			
			ВыборкаСуммыРабот = ЗапросСуммаРабот.Выполнить().Выбрать();
			
			Если ВыборкаСуммыРабот.Следующий() Тогда
				
				Если (ВыборкаСуммыРабот.СуммаРаботДокумента >= Выборка.СуммаВсегоРаботОт 
					И ВыборкаСуммыРабот.СуммаРаботДокумента <= Выборка.СуммаВсегоРаботДо) Тогда
					
					Если СписокПрограмм.НайтиПоЗначению(Выборка.ПрограммаЛояльности) = Неопределено Тогда
						
						НоваяПрограмма = СписокПрограмм.Добавить();
						НоваяПрограмма.Значение = Выборка.ПрограммаЛояльности;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		//проверяем сумму по запчастям
		Если ЗначениеЗаполнено(Выборка.СуммаВсегоЗапчастейОт) ИЛИ ЗначениеЗаполнено(Выборка.СуммаВсегоЗапчастейДо) Тогда
			
			ЗапросЗЧ = Новый Запрос;
			
			ЗапросЗЧ.Текст = "ВЫБРАТЬ
			                 |	ЕСТЬNULL(СУММА(ЗаказНаряд.СуммаНоменклатурыДокумента), 0) КАК СуммаНоменклатурыДокумента
			                 |ИЗ
			                 |	Документ.ЗаказНаряд КАК ЗаказНаряд
			                 |ГДЕ
			                 |	ЗаказНаряд.ДатаЗакрытия МЕЖДУ &Период И &ТекущаяДата
			                 |	И ЗаказНаряд.Заказчик = &Заказчик
			                 |	И ЗаказНаряд.Организация = &Организация
			                 |	И (НЕ ЗаказНаряд.ВидРемонта В(&ВидРемонта))";
			
			ТекущаяДата = НачалоДня(ТекущаяДата());
			
			ЗапросЗЧ.УстановитьПараметр("Заказчик", Контрагент);
			ЗапросЗЧ.УстановитьПараметр("ВидРемонта", Выборка.Ссылка.ИключаемыеВидыРемонта.ВыгрузитьКолонку("ВидРемонта"));
			ЗапросЗЧ.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
			ЗапросЗЧ.УстановитьПараметр("Период", ТекущаяДата - Выборка.ПериодПроверкиЗапчастей*3600*24);
			ЗапросЗЧ.УстановитьПараметр("Организация", Выборка.ДействуетДляОрганизации);
			
			ВыборкаЗЧ = ЗапросЗЧ.Выполнить().Выбрать();
			
			Если ВыборкаЗЧ.Следующий() Тогда
				
				Если (ВыборкаЗЧ.СуммаНоменклатурыДокумента >= Выборка.СуммаВсегоЗапчастейОт 
					И ВыборкаЗЧ.СуммаНоменклатурыДокумента <= Выборка.СуммаВсегоЗапчастейДо) Тогда
					
					Если СписокПрограмм.НайтиПоЗначению(Выборка.ПрограммаЛояльности) = Неопределено Тогда
						
						НоваяПрограмма = СписокПрограмм.Добавить();
						НоваяПрограмма.Значение = Выборка.ПрограммаЛояльности;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		//проверяем сумму всего по документу
		Если ЗначениеЗаполнено(Выборка.СуммаВсегоЗаказНарядОт) ИЛИ ЗначениеЗаполнено(Выборка.СуммаВсегоЗаказНарядДо) Тогда
			
			ЗапросСуммаДокумента = Новый Запрос;
			
			ЗапросСуммаДокумента.Текст = "ВЫБРАТЬ
			                             |	ЕСТЬNULL(СУММА(ЗаказНаряд.СуммаДокумента), 0) КАК СуммаДокумента
			                             |ИЗ
			                             |	Документ.ЗаказНаряд КАК ЗаказНаряд
			                             |ГДЕ
			                             |	ЗаказНаряд.ДатаЗакрытия МЕЖДУ &Период И &ТекущаяДата
			                             |	И ЗаказНаряд.Заказчик = &Заказчик
			                             |	И ЗаказНаряд.Организация = &Организация
			                             |	И (НЕ ЗаказНаряд.ВидРемонта В(&ВидРемонта))";
			
			ТекущаяДата = НачалоДня(ТекущаяДата());
			
			ЗапросСуммаДокумента.УстановитьПараметр("Заказчик", Контрагент);
			ЗапросСуммаДокумента.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
			ЗапросСуммаДокумента.УстановитьПараметр("Период", ТекущаяДата - Выборка.ПериодПроверкиСуммыДокумента*3600*24);
			ЗапросСуммаДокумента.УстановитьПараметр("Организация", Выборка.ДействуетДляОрганизации);
            ЗапросСуммаДокумента.УстановитьПараметр("ВидРемонта", Выборка.Ссылка.ИключаемыеВидыРемонта.ВыгрузитьКолонку("ВидРемонта"));
			
			ВыборкаСуммыДокумента = ЗапросСуммаДокумента.Выполнить().Выбрать();
			
			Если ВыборкаСуммыДокумента.Следующий() Тогда
				
				Если (ВыборкаСуммыДокумента.СуммаДокумента >= Выборка.СуммаВсегоЗаказНарядОт 
					И ВыборкаСуммыДокумента.СуммаДокумента <= Выборка.СуммаВсегоЗаказНарядДо) Тогда
					
					Если СписокПрограмм.НайтиПоЗначению(Выборка.ПрограммаЛояльности) = Неопределено Тогда
						
						НоваяПрограмма = СписокПрограмм.Добавить();
						НоваяПрограмма.Значение = Выборка.ПрограммаЛояльности;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			
		КонецЕсли;		
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СписокПрограмм) Тогда
		
		#Если Клиент Тогда
			
			// Сергеев В.Н. DMSREN-905
			//убираем диалог и возможность создать карту
			Возврат Неопределено;
			
			Если Вопрос("Выдать клиенту новую дисконтную карту?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
				
				Сообщить("Клиенту можно выдать карту.");
				
				Возврат Неопределено;
				
			КонецЕсли;
						
			Если СписокПрограмм.Количество() = 1 Тогда
				
				//Если ЗначениеЗаполнено(СуществующаяКарта) Тогда
				//	
				//	Карта = СуществующаяКарта.Ссылка.ПолучитьОбъект();
				//	Карта.Недействительна = Истина;
				//	Карта.ПометкаУдаления = Истина;
				//	Карта.Записать();
				//	
				//КонецЕсли;
				
				НоваяКарта = Справочники.Renault_КартыЛояльности.СоздатьЭлемент();
				НоваяКарта.УстановитьНовыйКод();
				НоваяКарта.Контрагент = Контрагент;
				НоваяКарта.Наименование = "Карта: " + Строка(Контрагент);
				НоваяКарта.Примечание = "";
				НоваяКарта.ДатаВыдачи = ТекущаяДата;
				НоваяКарта.ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
				НоваяКарта.ПрограммаЛояльности = СписокПрограмм[0].Значение;
				НоваяКарта.КемВыдана = ПараметрыСеанса.Пользователь.Сотрудник;
				НоваяКарта.Записать();
				
				Если ЗначениеЗаполнено(СуществующаяКарта) Тогда
					
					ПеренестиБаллыНаНовуюКарту(СуществующаяКарта, НоваяКарта, НоваяКарта.ПрограммаЛояльности);
					
				КонецЕсли;
				
				//Предупреждение("Клиенту сгенерирована новая карта: " + Строка(НоваяКарта.Код));
				
				Форма = НоваяКарта.ПолучитьФорму();
				Ответ = Форма.ОткрытьМодально();
				
				Если ЗначениеЗаполнено(Ответ) Тогда //DMS+
					Возврат Ответ;	
				КонецЕсли;//DMS- 
				
				//Renault_ЗаписатьОстатокБаллов(Контрагент, НоваяКарта.Ссылка, 0, ЗаказНаряд);
				
				
			ИначеЕсли СписокПрограмм.Количество() > 1 Тогда
				
				Форма = ПолучитьОбщуюФорму("Renault_ФормаВыбораПлиткой");
				Форма.Заголовок = "Какую программу лояльности выдаем?";
				Форма.СписокВыбора = СписокПрограмм;
				
				Ответ = Форма.ОткрытьМодально();
				
				Если ЗначениеЗаполнено(Ответ) Тогда
					
					//Если ЗначениеЗаполнено(СуществующаяКарта) Тогда
					//	
					//	Карта = СуществующаяКарта.Ссылка.ПолучитьОбъект();
					//	Карта.Недействительна = Истина;
					//	Карта.ПометкаУдаления = Истина;
					//	Карта.Записать();
					//	
					//КонецЕсли;
					
					НоваяКарта = Справочники.Renault_КартыЛояльности.СоздатьЭлемент();
					НоваяКарта.УстановитьНовыйКод();
					НоваяКарта.Контрагент = Контрагент;
					НоваяКарта.Наименование = "Карта: " + Строка(Контрагент);
					НоваяКарта.Примечание = "";
					НоваяКарта.ДатаВыдачи = ТекущаяДата;
					НоваяКарта.ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
					НоваяКарта.ПрограммаЛояльности = Ответ;
					НоваяКарта.КемВыдана = ПараметрыСеанса.Пользователь.Сотрудник;
					НоваяКарта.Записать();
					
					//Предупреждение("Клиенту сгенерирована новая карта: " + Строка(НоваяКарта.Код));
					
					Форма = НоваяКарта.ПолучитьФорму();
					мОтвет = Форма.ОткрытьМодально();
					
					Если ЗначениеЗаполнено(мОтвет) Тогда
						Возврат мОтвет;
					КонецЕсли; 
					
				КонецЕсли;
				
			КонецЕсли;			
			
		#КонецЕсли
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	
КонецФункции

Процедура ПеренестиБаллыНаНовуюКарту(СтараяКарта, НоваяКарта, ПрограммаЛояльности)
	
	//Спишем старые баллы
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Renault_ОстаткиБалловОстатки.КоличествоБалловОстаток
	|ИЗ
	|	РегистрНакопления.Renault_ОстаткиБаллов.Остатки(&ТекущаяДата, ПогаситьДо >= &ТекущаяДата) КАК Renault_ОстаткиБалловОстатки";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОстатокБаллов = 0;
	
	Если Выборка.Следующий() Тогда
		
		ОстатокБаллов = Выборка.КоличествоБалловОстаток;
		
	КонецЕсли;
	
	Документ = Документы.Renault_СписаниеНачислениеБаллов.СоздатьДокумент();
	
	Документ.КартаЛояльности = СтараяКарта.Ссылка;
	Документ.КоличествоБалловСписано = ОстатокБаллов;
	Документ.Контрагент = СтараяКарта.Контрагент;
	Документ.Дата = ТекущаяДата();
	Документ.Записать(РежимЗаписиДокумента.Проведение);
	
	//Начислим баллы на новую карту
	Документ = Документы.Renault_СписаниеНачислениеБаллов.СоздатьДокумент();
	Документ.КоличествоБалловНачислено = ОстатокБаллов;
	Документ.Контрагент = НоваяКарта.Контрагент;
	Документ.Дата = ТекущаяДата();
	Документ.ПогаситьДо = НачалоДня(ТекущаяДата() + ПрограммаЛояльности.СрокДействияБаллов * 60 * 60 * 24);
	Документ.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура Renault_ЗаказНаряд_ПередЗаписью_НачислениеСписаниеБалловПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	#Если Клиент Тогда
	
		Если Отказ = Истина Тогда
			
			Возврат;
			
		КонецЕсли;
		
		Если НЕ ПараметрыСеанса.Renault_ПраваПользователя.РазрешитьВыдачуКартыВручную Тогда
			
			Возврат;
			
		КонецЕсли;
				
		Гарантия = РегистрыСведений.Renault_ВидыРемонтаДопРеквизиты.ПолучитьГарантиюЗавода(Источник.ВидРемонта);
			
		Если Гарантия = Истина Тогда
				
			Возврат;
				
		КонецЕсли;
		
		ДЦ = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
		
		Если ЗначениеЗаполнено(ДЦ) И ДЦ.ИспользуетПрограммуЛояльностиRenault Тогда
			
			Статус = Источник.Состояние;
			
			Если Статус = ДЦ.Автосервис_СтатусЗаказНарядаДляВыдачиКарты Тогда
		
				Renault_АвтосервисСкидки.Renault_СписатьНачислитьБаллы(Источник.Заказчик, Источник.Ссылка);	
			
			КонецЕсли;
			
		КонецЕсли;
	
	#КонецЕсли
	
КонецПроцедуры

Процедура Renault_СписатьНачислитьБаллыПриВыдаче(ЗаказНаряд, КоличествоБаллов)
	
	Если ЗначениеЗаполнено(ЗаказНаряд) Тогда
	
		Источник = ЗаказНаряд;
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	Гарантия = РегистрыСведений.Renault_ВидыРемонтаДопРеквизиты.ПолучитьГарантиюЗавода(Источник.ВидРемонта);
			
	Если Гарантия = Истина Тогда
			
		Возврат;
			
	КонецЕсли;
	
	ДЦ = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
	
	Если ЗначениеЗаполнено(ДЦ) И ДЦ.ИспользуетПрограммуЛояльностиRenault Тогда
	
		Renault_АвтосервисСкидки.Renault_СписатьНачислитьБаллы(Источник.Заказчик, Источник.Ссылка);	
	
	КонецЕсли;
	
	
КонецПроцедуры

Функция Reanult_НайтиСоздатьТиповуюСкидку () Экспорт
	
	Код = "RENAULTDMSDISCOUNT";
	
	Скидка = Справочники.ТипыСкидок.НайтиПоКоду(Код);
	
	Если НЕ ЗначениеЗаполнено(Скидка) Тогда
		
		Скидка = Справочники.ТипыСкидок.СоздатьЭлемент();
		Скидка.Код = Код;
		Скидка.Наименование = "Скидка Renault DMS";
		Скидка.ВидСкидки = Перечисления.ВидыСкидок.НаСтрокуДокумента;
		Скидка.РучнаяСкидка = Истина;
		Скидка.СпособВычисления = Перечисления.СкидкиСпособВычисления.Абсолютная;
		
		Попытка
			
			Скидка.Записать();
			
			Возврат Скидка.Ссылка;
			
		Исключение
			
			ЗаписьЖурналаРегистрации("Ошибка при создании скидки DMS", УровеньЖурналаРегистрации.Ошибка,
			,,Строка(ОписаниеОшибки()));
			Возврат Справочники.ТипыСкидок.ПустаяСсылка();
			
		КонецПопытки;
		
	Иначе
		
		Возврат Скидка;
		
	КонецЕсли;
	
КонецФункции

Функция Renault_ВычислитьВсеСкидкиПоДокументу(ЗаявкаНаСервис, ЗаказНарядОбъект) Экспорт
	
	Попытка
	
		Скидка = Renault_АвтосервисСкидки.Reanult_НайтиСоздатьТиповуюСкидку();
	
	Исключение
		
		Скидка = Справочники.ТипыСкидок.ПустаяСсылка();
		
	КонецПопытки;
		
	ДокументСписание = Документы.Renault_СписаниеНачислениеБаллов.НайтиПоРеквизиту("ЗаявкаНаСервис", ЗаявкаНаСервис);
	
	//Если ЗначениеЗаполнено(ЗаказНаряд.Комментарий) И Найти(ЗаказНаряд.Комментарий, "Оплачено баллами: ") > 0 Тогда
	//	
	//Иначе
	//	
	//	ЗаказНаряд.Комментарий = ЗаказНаряд.Комментарий + "      " + "Оплачено баллами: " + Строка(ЗаявкаНаСервис.ЗапчастиОплатаБаллами + ЗаявкаНаСервис.РаботыОплатаБаллами);
	//	
	//КонецЕсли;
		
	СуммаСкидкиПоБалламРаботы = ЗаявкаНаСервис.РаботыОплатаБаллами;
	СуммаСкидкиПоБалламЗЧ = ЗаявкаНаСервис.ЗапчастиОплатаБаллами;

КонецФункции

//DMS+

Функция ПолучитьИнформациюПоСкидкамИБонусамПоКонтрагенту(Контрагент,КартаЛояльности = Неопределено, Отказ = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Отказ = Истина;
		Возврат Новый Структура("БонуснаяКарта,КартаЛояльностиКлиента,МаксимумПроцентЗапчасти,ПроцентОтчисленияБалловЗапчасти,Коэффициент_Баллов_Работы,ПроцентОтчисленияБалловРаботы,МаксимумПроцентРаботы,ОстатокБаллов,ПрограммаЛояльности,СкидкаЗапчасти,СкидкаРаботы,МаксимумБалламиЗапчасти,МаксимумБалламиРаботы",Неопределено,Неопределено,0,0,0,0,0,0,Неопределено,0,0,0,0);
	КонецЕсли; 
	
	ЮрФизЛицо = КонтрагентЮрФизЛицо(Контрагент,Renault_CRM.ПолучитьДилерскийЦентрПользователя());//DMS
	
	//Если ЗначениеЗаполнено(ЮрФизЛицо) И Контрагент.ФормаСобственности <> Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
	//	Отказ = Истина;
	//	Возврат Новый Структура("КартаЛояльностиКлиента,МаксимумПроцентЗапчасти,ПроцентОтчисленияБалловЗапчасти,Коэффициент_Баллов_Работы,ПроцентОтчисленияБалловРаботы,МаксимумПроцентРаботы,ОстатокБаллов,ПрограммаЛояльности,СкидкаЗапчасти,СкидкаРаботы,МаксимумБалламиЗапчасти,МаксимумБалламиРаботы",Неопределено,0,0,0,0,0,0,Неопределено,0,0,0,0);
	//КонецЕсли; 
	
	ПараметрыГраницы = Новый Массив(2);
	ПараметрыГраницы[0] = КонецДня(ТекущаяДата());
	ПараметрыГраницы[1] = ВидГраницы.Включая;
	ГраницаПериод = Новый(Тип("Граница"),ПараметрыГраницы);
	                                                    
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", 	 Контрагент);
	Запрос.УстановитьПараметр("Период", 		 ГраницаПериод);
	Запрос.УстановитьПараметр("КартаЛояльности", ?(КартаЛояльности = Неопределено,Справочники.Renault_КартыЛояльности.ПустаяСсылка(),КартаЛояльности));
	Запрос.УстановитьПараметр("ЮрФизЛицо",		 ЮрФизЛицо);//DMS	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	КартыЛояльности.Ссылка КАК КартаЛояльности,
		|	КартыЛояльности.ПрограммаЛояльности КАК ПрограммаЛояльности,
		|	КартыЛояльности.DMS_ВидКартыЛояльности КАК ВидКарты,
		|	ЕСТЬNULL(БонусныеБаллы.НачисленоОстаток, 0) КАК КоличествоБаллов
		|ПОМЕСТИТЬ КартаЛояльностиКлиента
		|ИЗ
		|	Справочник.Renault_КартыЛояльности КАК КартыЛояльности
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.DMS_БонусныеБаллы.Остатки(&Период, ) КАК БонусныеБаллы
		|		ПО (БонусныеБаллы.КартаЛояльности = КартыЛояльности.Ссылка)
		|			И (ЕСТЬNULL(БонусныеБаллы.НачисленоОстаток, 0) + ЕСТЬNULL(БонусныеБаллы.КСписаниюОстаток, 0) > 0)
		|ГДЕ
		|	КартыЛояльности.Контрагент = &Контрагент
		|	И НЕ КартыЛояльности.ПометкаУдаления
		|	И НЕ КартыЛояльности.Недействительна
		|	И (КартыЛояльности.Ссылка = &КартаЛояльности
		|			ИЛИ &КартаЛояльности = ЗНАЧЕНИЕ(Справочник.Renault_КартыЛояльности.ПустаяСсылка))
		|	И (ЕСТЬNULL(КартыЛояльности.ПрограммаЛояльности.DMS_ЮрФизЛицо, ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.пустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.пустаяСсылка)
		|			ИЛИ ЕСТЬNULL(КартыЛояльности.ПрограммаЛояльности.DMS_ЮрФизЛицо, ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.пустаяСсылка)) = &ЮрФизЛицо)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КартаЛояльностиКлиента.КартаЛояльности КАК КартаЛояльности,
		|	КартаЛояльностиКлиента.ВидКарты КАК ВидКарты,
		|	КартаЛояльностиКлиента.КоличествоБаллов КАК КоличествоБаллов,
		|	ШкалаНачисленияБаллов.ПроцентСуммы КАК ПроцентОтЧека
		|ПОМЕСТИТЬ ПроцентОтЧекаПоКарте
		|ИЗ
		|	КартаЛояльностиКлиента КАК КартаЛояльностиКлиента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.DMS_ВидыКартЛояльности.ШкалаНачисленияБаллов КАК ШкалаНачисленияБаллов
		|		ПО КартаЛояльностиКлиента.ВидКарты = ШкалаНачисленияБаллов.Ссылка
		|			И КартаЛояльностиКлиента.КоличествоБаллов >= ШкалаНачисленияБаллов.БалансОт
		|			И (КартаЛояльностиКлиента.КоличествоБаллов <= ШкалаНачисленияБаллов.БалансДо
		|				ИЛИ ШкалаНачисленияБаллов.БалансДо = 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КартаЛояльностиКлиента.КартаЛояльности КАК КартаЛояльности,
		|	КартаЛояльностиКлиента.ПрограммаЛояльности КАК ПрограммаЛояльности,
		|	КартаЛояльностиКлиента.ВидКарты КАК ВидКарты,
		|	КартаЛояльностиКлиента.КоличествоБаллов КАК КоличествоБаллов,
		|	ЕСТЬNULL(ПроцентОтЧекаПоКарте.ПроцентОтЧека, 0) КАК ПроцентОтЧека
		|ПОМЕСТИТЬ ДанныеПоКарте
		|ИЗ
		|	КартаЛояльностиКлиента КАК КартаЛояльностиКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПроцентОтЧекаПоКарте КАК ПроцентОтЧекаПоКарте
		|		ПО КартаЛояльностиКлиента.КартаЛояльности = ПроцентОтЧекаПоКарте.КартаЛояльности
		|			И КартаЛояльностиКлиента.ВидКарты = ПроцентОтЧекаПоКарте.ВидКарты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеПоКарте.КартаЛояльности КАК КартаЛояльностиКлиента,
		|	ДанныеПоКарте.КартаЛояльности.Код КАК Номер_Карты,
		|	ДанныеПоКарте.ПрограммаЛояльности КАК ПрограммаЛояльности,
		|	ВЫБОР
		|		КОГДА ДанныеПоКарте.ПроцентОтЧека = 0
		|			ТОГДА ЕСТЬNULL(ДанныеПоКарте.ПрограммаЛояльности.ЗапчастиСкидкаВнутренняя, 0)
		|		ИНАЧЕ ДанныеПоКарте.ПроцентОтЧека
		|	КОНЕЦ КАК ПроцентОтчисленияБалловЗапчасти,
		|	ЕСТЬNULL(ДанныеПоКарте.ПрограммаЛояльности.ЗапчастиСкидкаВнешняя, 0) КАК СкидкаЗапчасти,
		|	ЕСТЬNULL(ДанныеПоКарте.ПрограммаЛояльности.ЗапчастиКурсБаллов, 0) КАК Коэффициент_Баллов_Запчасти,
		|	ЕСТЬNULL(ДанныеПоКарте.ПрограммаЛояльности.ЗапчастиМаксимумБалловОплата, 0) КАК МаксимумБалламиЗапчасти,
		|	ЕСТЬNULL(ДанныеПоКарте.ПрограммаЛояльности.ЗапчастиМаксимумБалловОплатаПроцент, 0) КАК МаксимумПроцентЗапчасти,
		|	ВЫБОР
		|		КОГДА ДанныеПоКарте.ПроцентОтЧека = 0
		|			ТОГДА ЕСТЬNULL(ДанныеПоКарте.ПрограммаЛояльности.РаботыСкидкаВнутренняя, 0)
		|		ИНАЧЕ ДанныеПоКарте.ПроцентОтЧека
		|	КОНЕЦ КАК ПроцентОтчисленияБалловРаботы,
		|	ЕСТЬNULL(ДанныеПоКарте.ПрограммаЛояльности.РаботыСкидкаВнешняя, 0) КАК СкидкаРаботы,
		|	ЕСТЬNULL(ДанныеПоКарте.ПрограммаЛояльности.РаботыКурсБаллов, 0) КАК Коэффициент_Баллов_Работы,
		|	ЕСТЬNULL(ДанныеПоКарте.ПрограммаЛояльности.РаботыМаксимумБалловОплата, 0) КАК МаксимумБалламиРаботы,
		|	ЕСТЬNULL(ДанныеПоКарте.ПрограммаЛояльности.РаботыМаксимумБалловОплатаПроцент, 0) КАК МаксимумПроцентРаботы,
		|	ЕСТЬNULL(ДанныеПоКарте.КоличествоБаллов, 0) КАК ОстатокБаллов,
		|	ДанныеПоКарте.КартаЛояльности КАК БонуснаяКарта,
		|	ДанныеПоКарте.ВидКарты КАК ВидКарты
		|ИЗ
		|	ДанныеПоКарте КАК ДанныеПоКарте";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеПоСкидкамИБаллам = Новый Структура;
	
	Для каждого ТекущаяКолонка Из РезультатЗапроса.Колонки Цикл
		ДанныеПоСкидкамИБаллам.Вставить(ТекущаяКолонка.Имя);
	КонецЦикла; 
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеПоСкидкамИБаллам,ВыборкаДетальныеЗаписи);
	Иначе 
		Возврат Новый Структура("БонуснаяКарта,КартаЛояльностиКлиента,МаксимумПроцентЗапчасти,ПроцентОтчисленияБалловЗапчасти,Коэффициент_Баллов_Работы,ПроцентОтчисленияБалловРаботы,МаксимумПроцентРаботы,ОстатокБаллов,ПрограммаЛояльности,СкидкаЗапчасти,СкидкаРаботы,МаксимумБалламиЗапчасти,МаксимумБалламиРаботы",Неопределено,Неопределено,0,0,0,0,0,0,Неопределено,0,0,0,0);
	КонецЕсли; 
	
	Возврат ДанныеПоСкидкамИБаллам;
	
КонецФункции // ПолучитьИнформациюПоСкидкамИБонусамПоКонтрагенту()

Процедура DMS_СписаниеНачислениеБаллов(КодВидаКарт) Экспорт
	
	Период = ТекущаяДатаСеанса();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Код", 	КодВидаКарт);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыКартЛояльности.Ссылка КАК ВидКарты,
		|	Карты.Ссылка КАК КартаЛояльности
		|ПОМЕСТИТЬ КартыЛояльности
		|ИЗ
		|	Справочник.Renault_КартыЛояльности КАК Карты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.DMS_ВидыКартЛояльности КАК ВидыКартЛояльности
		|		ПО Карты.DMS_ВидКартыЛояльности = ВидыКартЛояльности.Ссылка
		|ГДЕ
		|	ВидыКартЛояльности.Код = &Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Период КАК Дата,
		|	КартыЛояльности.КартаЛояльности КАК КартаЛояльности,
		|	БонусныеБаллыОстатки.КартаЛояльности.Контрагент КАК Контрагент,
		|	-БонусныеБаллыОстатки.КСписаниюОстаток КАК БаллыКСписанию
		|ИЗ
		|	КартыЛояльности КАК КартыЛояльности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.DMS_БонусныеБаллы.Остатки(&Период, ) КАК БонусныеБаллыОстатки
		|		ПО КартыЛояльности.КартаЛояльности = БонусныеБаллыОстатки.КартаЛояльности
		|			И (НЕ КартыЛояльности.КартаЛояльности.ПрограммаЛояльности.DMS_Недействительна)
		|ГДЕ
		|	БонусныеБаллыОстатки.КСписаниюОстаток < 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	КартыЛояльности.КартаЛояльности,
		|	БонусныеБаллыОстатки.КартаЛояльности.Контрагент,
		|	БонусныеБаллыОстатки.НачисленоОстаток
		|ИЗ
		|	КартыЛояльности КАК КартыЛояльности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.DMS_БонусныеБаллы.Остатки(&Период, ) КАК БонусныеБаллыОстатки
		|		ПО КартыЛояльности.КартаЛояльности = БонусныеБаллыОстатки.КартаЛояльности
		|			И (КартыЛояльности.КартаЛояльности.ПрограммаЛояльности.DMS_Недействительна)
		|ГДЕ
		|	БонусныеБаллыОстатки.НачисленоОстаток > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	КартаЛояльности
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ДокументСписания = Документы.Renault_СписаниеНачислениеБаллов.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(ДокументСписания,ВыборкаДетальныеЗаписи);
		ДокументСписания.УстановитьНовыйНомер();
		
		Попытка
			ДокументСписания.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ЗаписьЖурналаРегистрации("Регламентное списание баллов",УровеньЖурналаРегистрации.Ошибка,,,КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));	
		КонецПопытки;
		
	КонецЦикла;
	
	НачислитьБаллыВДеньРожденияКлиента(Период,КодВидаКарт);
	
	РегистрыСведений.DMS_МониторингРегламентныхЗаданий.ЗавершениеЗадания(
	ПредопределенноеЗначение("Справочник.DMS_НастройкаРегламентныхЗаданий.СписаниеНачислениеБаллов"),
	ТекущаяДатаСеанса());
	
КонецПроцедуры

Процедура НачислитьБаллыВДеньРожденияКлиента(Период,КодВидаКарт)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", 	 Период);
	Запрос.УстановитьПараметр("КодВидаКарт", КодВидаКарт);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Привилегии.Ссылка,
		|	СУММА(Привилегии.Привилегия.СуммаБонуса) КАК ПривилегияСуммаБонуса
		|ПОМЕСТИТЬ ВидыКарт
		|ИЗ
		|	Справочник.DMS_ВидыКартЛояльности.Привилегии КАК Привилегии
		|ГДЕ
		|	НЕ Привилегии.Ссылка.ПометкаУдаления
		|	И Привилегии.Ссылка.ТипКарты = ЗНАЧЕНИЕ(Перечисление.DMS_ТипыКартЛояльности.Бонусная)
		|	И Привилегии.Привилегия.НачисляютсяБонусыВДеньРожденияКлиента
		|	И Привилегии.Ссылка.Код = &КодВидаКарт
		|
		|СГРУППИРОВАТЬ ПО
		|	Привилегии.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) КАК Период,
		|	КартыЛояльности.Ссылка КАК КартаЛояльности,
		|	КартыЛояльности.Контрагент КАК Контрагент,
		|	ВидыКарт.ПривилегияСуммаБонуса КАК БаллыКНачислению
		|ПОМЕСТИТЬ мБаллыКНачислению
		|ИЗ
		|	Справочник.Renault_КартыЛояльности КАК КартыЛояльности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВидыКарт КАК ВидыКарт
		|		ПО КартыЛояльности.DMS_ВидКартыЛояльности = ВидыКарт.Ссылка
		|			И (НЕ КартыЛояльности.Недействительна)
		|			И (НЕ КартыЛояльности.ПометкаУдаления)
		|ГДЕ
		|	ДЕНЬ(КартыЛояльности.Контрагент.ДатаРождения) = ДЕНЬ(&Период)
		|	И МЕСЯЦ(КартыЛояльности.Контрагент.ДатаРождения) = МЕСЯЦ(&Период)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	мБаллыКНачислению.Период КАК Дата,
		|	мБаллыКНачислению.КартаЛояльности,
		|	мБаллыКНачислению.Контрагент,
		|	мБаллыКНачислению.БаллыКНачислению
		|ИЗ
		|	мБаллыКНачислению КАК мБаллыКНачислению
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.DMS_БонусныеБаллы КАК БонусныеБаллы
		|		ПО (мБаллыКНачислению.Период = НАЧАЛОПЕРИОДА(БонусныеБаллы.Период, ДЕНЬ))
		|			И мБаллыКНачислению.КартаЛояльности = БонусныеБаллы.КартаЛояльности
		|			И (БонусныеБаллы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.DMS_ВидыОперацийКартЛояльности.НачислениеБалловРегламентно))
		|			И мБаллыКНачислению.Контрагент = БонусныеБаллы.Контрагент
		|ГДЕ
		|	БонусныеБаллы.КартаЛояльности ЕСТЬ NULL ";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДанных = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДанных.Следующий() Цикл
		
		Попытка
			ДокументНачисления = Документы.Renault_СписаниеНачислениеБаллов.СоздатьДокумент();
			ЗаполнитьЗначенияСвойств(ДокументНачисления,ВыборкаДанных);
			
			ДокументНачисления.Ответственный = ПараметрыСеанса.Пользователь;
			ДокументНачисления.Комментарий   = "#Начислено в день рождение клиента регламетно.";
			
			ЗаполнитьДатуПогашения(ДокументНачисления);
			
			ДокументНачисления.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ЗаписьЖурналаРегистрации("Создание документа начисления баллов регламентно",УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДатуПогашения(мОбъект)
	
	ВидКартыЛояльности  = мОбъект.КартаЛояльности.DMS_ВидКартыЛояльности;
	ПрограммаЛояльности = мОбъект.КартаЛояльности.ПрограммаЛояльности;
	
	Если ЗначениеЗаполнено(ВидКартыЛояльности)
		И ВидКартыЛояльности.ИспользоватьСрокДействияБаллов Тогда
		
		мОбъект.ПогаситьДо = ДобавитьКДате(мОбъект.Дата,Формат(ВидКартыЛояльности.СрокДействияБаллов,"ЧЦ=10; ЧН=0; ЧГ="),СокрЛП(ВидКартыЛояльности.ПериодичностьДействияБаллов)); 
		
	ИначеЕсли ЗначениеЗаполнено(ПрограммаЛояльности) 
		И ПрограммаЛояльности.СрокДействияБаллов <> 0 Тогда  
		
		мОбъект.ПогаситьДо = ДобавитьКДате(НачалоДня(мОбъект.Дата),Формат(ПрограммаЛояльности.СрокДействияБаллов,"ЧЦ=10; ЧН=0; ЧГ=")); 
	
	КонецЕсли; 	

КонецПроцедуры

Функция ДобавитьКДате(мДата,Количество,Тип = "День")
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("мДата", мДата);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДОБАВИТЬКДАТЕ(&мДата, "+Тип+", "+Количество+") КАК НоваяДата";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НоваяДата = мДата;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяДата = ВыборкаДетальныеЗаписи.НоваяДата;
	КонецЦикла;
	
	Возврат НоваяДата;
	
КонецФункции // ДобавитьКДате()

Функция ПолучитьСозданнуюНовуюКарту(ПараметрыЗапроса)
	
	Запрос = Новый Запрос;
	
	Для каждого ТекущийПараметр Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(ТекущийПараметр.Ключ,ТекущийПараметр.Значение);
	КонецЦикла; 
	ЮрФизЛицо = КонтрагентЮрФизЛицо(ПараметрыЗапроса.Контрагент,Renault_CRM.ПолучитьДилерскийЦентрПользователя());//DMS
	Запрос.УстановитьПараметр("ЮрФизЛицо",ЮрФизЛицо);//DMS	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КартыПокупателей.КартаПриемник,
		|	КартыПокупателей.Ссылка
		|ИЗ
		|	Документ.DMS_ЗаменаКартЛояльности.КартыПокупателей КАК КартыПокупателей
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(КартыПокупателей.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
		|	И КартыПокупателей.Ссылка.Проведен
		|	И КартыПокупателей.Ссылка.ВидОперации = &ВидОперации
		|	И КартыПокупателей.КартаИсточник = &КартаИсточник
		|	И КартыПокупателей.КартаИсточник.Недействительна
		|	И НЕ ЕСТЬNULL(КартыПокупателей.КартаПриемник.Недействительна, ИСТИНА)
		|	И КартыПокупателей.КартаПриемник.Контрагент = &Контрагент
		|	И КартыПокупателей.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.DMS_СтатусЗаменыКарт.Согласован)
		|	И КартыПокупателей.КартаИсточник <> ЗНАЧЕНИЕ(Справочник.Renault_КартыЛояльности.пустаяСсылка)
		|	И КартыПокупателей.КартаПриемник <> ЗНАЧЕНИЕ(Справочник.Renault_КартыЛояльности.пустаяСсылка)
		|	И КартыПокупателей.КартаИсточник.DMS_КартаЗамены = КартыПокупателей.КартаПриемник
		|	И (ЕСТЬNULL(КартыПокупателей.КартаПриемник.ПрограммаЛояльности.DMS_ЮрФизЛицо, ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.пустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.пустаяСсылка)
		|			ИЛИ ЕСТЬNULL(КартыПокупателей.КартаПриемник.ПрограммаЛояльности.DMS_ЮрФизЛицо, ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.пустаяСсылка)) = &ЮрФизЛицо)
		|	И КартыПокупателей.Ссылка.ЗаказНаряд = &ЗаказНаряд";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДанных = РезультатЗапроса.Выбрать();

	Если ВыборкаДанных.Следующий() Тогда
		Возврат ВыборкаДанных.КартаПриемник;	
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции // ПолучитьСозданнуюНовуюКарту()

Функция ПолучитьРаннееСозданнуюЗаменуКарт(ВидОперации,Дата,Контрагент,КартаИсточник)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидОперации",	ВидОперации);
	Запрос.УстановитьПараметр("Дата", 			Дата);
	Запрос.УстановитьПараметр("КартаИсточник",  КартаИсточник);
	Запрос.УстановитьПараметр("Контрагент", 	Контрагент);
	
	ЮрФизЛицо = КонтрагентЮрФизЛицо(Контрагент,Renault_CRM.ПолучитьДилерскийЦентрПользователя());//DMS
	Запрос.УстановитьПараметр("ЮрФизЛицо",ЮрФизЛицо);//DMS
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КартыПокупателей.КартаПриемник,
		|	КартыПокупателей.Ссылка
		|ИЗ
		|	Документ.DMS_ЗаменаКартЛояльности.КартыПокупателей КАК КартыПокупателей
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(КартыПокупателей.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
		|	И КартыПокупателей.Ссылка.ВидОперации = &ВидОперации
		|	И КартыПокупателей.КартаИсточник = &КартаИсточник
		|	И КартыПокупателей.КартаИсточник.Недействительна
		|	И НЕ ЕСТЬNULL(КартыПокупателей.КартаПриемник.Недействительна, ИСТИНА)
		|	И КартыПокупателей.КартаПриемник.Контрагент = &Контрагент
		|	И КартыПокупателей.КартаИсточник <> ЗНАЧЕНИЕ(Справочник.Renault_КартыЛояльности.пустаяСсылка)
		|	И КартыПокупателей.КартаПриемник <> ЗНАЧЕНИЕ(Справочник.Renault_КартыЛояльности.пустаяСсылка)
		|	И (ЕСТЬNULL(КартыПокупателей.КартаПриемник.ПрограммаЛояльности.DMS_ЮрФизЛицо, ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.пустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.пустаяСсылка)
		|			ИЛИ ЕСТЬNULL(КартыПокупателей.КартаПриемник.ПрограммаЛояльности.DMS_ЮрФизЛицо, ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.пустаяСсылка)) = &ЮрФизЛицо)
		|	И КартыПокупателей.Ссылка.ЗаказНаряд = &ЗаказНаряд";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДанных = РезультатЗапроса.Выбрать();

	Если ВыборкаДанных.Следующий() Тогда
	
		Возврат ВыборкаДанных.Ссылка;	
	
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции // ПолучитьРаннееСозданнуюЗаменуКарт()

Функция ПроверитьКартуНаВозможностьЗамены(Организация,Заказчик,КартаЛояльности,Период,ЗаказНаряд = Неопределено) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заказчик", 		 Заказчик);
	Запрос.УстановитьПараметр("КартаЛояльности", КартаЛояльности);
	Запрос.УстановитьПараметр("Организация", 	 Организация);
	Запрос.УстановитьПараметр("Период",		     Период);
	Запрос.УстановитьПараметр("ТекущаяДата",     ТекущаяДата());
	Запрос.УстановитьПараметр("ЗаказНаряд",      ?(ЗаказНаряд = Неопределено,Документы.ЗаказНаряд.ПустаяСсылка(),ЗаказНаряд));
	
	ЮрФизЛицо = КонтрагентЮрФизЛицо(Заказчик,Renault_CRM.ПолучитьДилерскийЦентрПользователя());//DMS
	Запрос.УстановитьПараметр("ЮрФизЛицо",ЮрФизЛицо);//DMS
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПравилаУчастия.Ссылка,
		|	ПравилаУчастия.СуммаВсегоРаботОт КАК СуммаВсегоРаботОт,
		|	ПравилаУчастия.СуммаВсегоЗапчастейОт КАК СуммаВсегоЗапчастейОт,
		|	ПравилаУчастия.ПрограммаЛояльности КАК ПрограммаЛояльности,
		|	ПравилаУчастия.ПериодПроверкиРабот,
		|	ПравилаУчастия.ПериодПроверкиЗапчастей,
		|	ПравилаУчастия.СуммаВсегоЗаказНарядОт,
		|	ПравилаУчастия.СуммаВсегоРаботДо,
		|	ПравилаУчастия.СуммаВсегоЗапчастейДо,
		|	ПравилаУчастия.СуммаВсегоЗаказНарядДо,
		|	ПравилаУчастия.ПериодПроверкиСуммыДокумента,
		|	ЕСТЬNULL(ПравилаУчастия.ПрограммаЛояльности.Уровень, 0) КАК УровеньПрограммы,
		|	ПравилаУчастия.ДействуетДляОрганизации,
		|	ВЫРАЗИТЬ(&КартаЛояльности КАК Справочник.Renault_КартыЛояльности) КАК ТекущаяКартаЛольности
		|ПОМЕСТИТЬ ТаблицаПравил
		|ИЗ
		|	Справочник.Renault_ПравилаУчастияВПрограммеЛояльности КАК ПравилаУчастия
		|ГДЕ
		|	НЕ ПравилаУчастия.ПометкаУдаления
		|	И ПравилаУчастия.ПрограммаЛояльности <> ВЫРАЗИТЬ(&КартаЛояльности КАК Справочник.Renault_КартыЛояльности).ПрограммаЛояльности
		|	И ЕСТЬNULL(ВЫРАЗИТЬ(&КартаЛояльности КАК Справочник.Renault_КартыЛояльности).ПрограммаЛояльности.Уровень, 0) < ЕСТЬNULL(ПравилаУчастия.ПрограммаЛояльности.Уровень, 0)
		|	И ВЫРАЗИТЬ(&КартаЛояльности КАК Справочник.Renault_КартыЛояльности).DMS_ТипКарты <> ЗНАЧЕНИЕ(Перечисление.DMS_ТипыКартЛояльности.Бонусная)
		|	И (ПравилаУчастия.ДействуетДляОрганизации = &Организация
		|			ИЛИ ПравилаУчастия.ДействуетДляОрганизации = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
		|	И (ЕСТЬNULL(ПравилаУчастия.ПрограммаЛояльности.DMS_ЮрФизЛицо, ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.ПустаяСсылка)) = &ЮрФизЛицо
		|			ИЛИ ЕСТЬNULL(ПравилаУчастия.ПрограммаЛояльности.DMS_ЮрФизЛицо, ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(ИключаемыеВидыРемонта.ВидРемонта, ЗНАЧЕНИЕ(Справочник.ВидыРемонта.пустаяСсылка)) КАК ВидРемонта,
		|	ТаблицаПравил.Ссылка КАК ПравилоУчастия
		|ПОМЕСТИТЬ ИсключенныеПравилаОбмена
		|ИЗ
		|	ТаблицаПравил КАК ТаблицаПравил
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_ПравилаУчастияВПрограммеЛояльности.ИключаемыеВидыРемонта КАК ИключаемыеВидыРемонта
		|		ПО ТаблицаПравил.Ссылка = ИключаемыеВидыРемонта.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(ИключаемыеВидыРемонта.ВидРемонта, ЗНАЧЕНИЕ(Справочник.ВидыРемонта.пустаяСсылка)),
		|	ТаблицаПравил.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказНаряд.Ссылка КАК ЗаказНаряд,
		|	ИсключенныеПравилаОбмена.ПравилоУчастия КАК ПравилоУчастия,
		|	МАКСИМУМ(ЗаказНаряд.СуммаДокумента) КАК СуммаДокумента,
		|	МАКСИМУМ(0) КАК СуммаЗапчастей,
		|	МАКСИМУМ(0) КАК СуммаРабот
		|ПОМЕСТИТЬ мЗаказНаряды
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИсключенныеПравилаОбмена КАК ИсключенныеПравилаОбмена
		|		ПО (ЗаказНаряд.ВидРемонта <> ЕСТЬNULL(ИсключенныеПравилаОбмена.ВидРемонта, ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)))
		|ГДЕ
		|	ЗаказНаряд.ДатаЗакрытия МЕЖДУ ДОБАВИТЬКДАТЕ(&Период, ДЕНЬ, -ИсключенныеПравилаОбмена.ПравилоУчастия.ПериодПроверкиСуммыДокумента) И &Период
		|	И ЗаказНаряд.Заказчик = &Заказчик
		|	И ЗаказНаряд.Организация = &Организация
		|	И НЕ ИсключенныеПравилаОбмена.ПравилоУчастия ЕСТЬ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНаряд.Ссылка,
		|	ИсключенныеПравилаОбмена.ПравилоУчастия
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНаряд.Ссылка,
		|	ИсключенныеПравилаОбмена.ПравилоУчастия,
		|	МАКСИМУМ(0),
		|	МАКСИМУМ(0),
		|	МАКСИМУМ(ЗаказНаряд.СуммаРаботДокумента)
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИсключенныеПравилаОбмена КАК ИсключенныеПравилаОбмена
		|		ПО (ЗаказНаряд.ВидРемонта <> ЕСТЬNULL(ИсключенныеПравилаОбмена.ВидРемонта, ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)))
		|ГДЕ
		|	ЗаказНаряд.ДатаЗакрытия МЕЖДУ ДОБАВИТЬКДАТЕ(&Период, ДЕНЬ, -ИсключенныеПравилаОбмена.ПравилоУчастия.ПериодПроверкиРабот) И &Период
		|	И ЗаказНаряд.Заказчик = &Заказчик
		|	И ЗаказНаряд.Организация = &Организация
		|	И НЕ ИсключенныеПравилаОбмена.ПравилоУчастия ЕСТЬ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНаряд.Ссылка,
		|	ИсключенныеПравилаОбмена.ПравилоУчастия
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНаряд.Ссылка,
		|	ИсключенныеПравилаОбмена.ПравилоУчастия,
		|	МАКСИМУМ(0),
		|	МАКСИМУМ(ЗаказНаряд.СуммаНоменклатурыДокумента),
		|	МАКСИМУМ(0)
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИсключенныеПравилаОбмена КАК ИсключенныеПравилаОбмена
		|		ПО (ЗаказНаряд.ВидРемонта <> ЕСТЬNULL(ИсключенныеПравилаОбмена.ВидРемонта, ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)))
		|ГДЕ
		|	ЗаказНаряд.ДатаЗакрытия МЕЖДУ ДОБАВИТЬКДАТЕ(&Период, ДЕНЬ, -ИсключенныеПравилаОбмена.ПравилоУчастия.ПериодПроверкиЗапчастей) И &Период
		|	И ЗаказНаряд.Заказчик = &Заказчик
		|	И ЗаказНаряд.Организация = &Организация
		|	И НЕ ИсключенныеПравилаОбмена.ПравилоУчастия ЕСТЬ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНаряд.Ссылка,
		|	ИсключенныеПравилаОбмена.ПравилоУчастия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	мЗаказНаряды.ПравилоУчастия,
		|	СУММА(мЗаказНаряды.СуммаДокумента) КАК СуммаДокумента,
		|	СУММА(мЗаказНаряды.СуммаЗапчастей) КАК СуммаЗапчастей,
		|	СУММА(мЗаказНаряды.СуммаРабот) КАК СуммаРабот
		|ПОМЕСТИТЬ СуммыПоПравилам
		|ИЗ
		|	мЗаказНаряды КАК мЗаказНаряды
		|
		|СГРУППИРОВАТЬ ПО
		|	мЗаказНаряды.ПравилоУчастия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СуммыПоПравилам.ПравилоУчастия,
		|	СуммыПоПравилам.СуммаДокумента,
		|	СуммыПоПравилам.СуммаЗапчастей,
		|	СуммыПоПравилам.СуммаРабот,
		|	ТаблицаПравил.ПрограммаЛояльности,
		|	ТаблицаПравил.ТекущаяКартаЛольности,
		|	ВЫБОР
		|		КОГДА ТаблицаПравил.СуммаВсегоЗаказНарядОт >= СуммыПоПравилам.СуммаДокумента
		|				ИЛИ ТаблицаПравил.СуммаВсегоЗаказНарядДо <= СуммыПоПравилам.СуммаДокумента
		|			ТОГДА ИСТИНА
		|		КОГДА ТаблицаПравил.СуммаВсегоРаботОт >= СуммыПоПравилам.СуммаРабот
		|				ИЛИ ТаблицаПравил.СуммаВсегоРаботДо <= СуммыПоПравилам.СуммаРабот
		|			ТОГДА ИСТИНА
		|		КОГДА ТаблицаПравил.СуммаВсегоЗапчастейОт >= СуммыПоПравилам.СуммаЗапчастей
		|				ИЛИ ТаблицаПравил.СуммаВсегоЗапчастейДо <= СуммыПоПравилам.СуммаЗапчастей
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Подходит
		|ПОМЕСТИТЬ мПрограммыЛояльности
		|ИЗ
		|	СуммыПоПравилам КАК СуммыПоПравилам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПравил КАК ТаблицаПравил
		|		ПО СуммыПоПравилам.ПравилоУчастия = ТаблицаПравил.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(&КартаЛояльности КАК Справочник.Renault_КартыЛояльности) КАК КартаЛояльности,
		|	ПравилаЗаменыБонусныхКарт.ВидБонуснойКарты КАК ВидБонуснойКарты,
		|	ПравилаЗаменыБонусныхКарт.Ссылка КАК ВидКарты,
		|	ПравилаЗаменыБонусныхКарт.СуммаБалловОт КАК СуммаБалловОт
		|ПОМЕСТИТЬ ВидыКартБонусныхКарт
		|ИЗ
		|	Справочник.DMS_ВидыКартЛояльности.ПравилаЗаменыБонусныхКарт КАК ПравилаЗаменыБонусныхКарт
		|ГДЕ
		|	НЕ ПравилаЗаменыБонусныхКарт.Ссылка.ПометкаУдаления
		|	И ВЫРАЗИТЬ(&КартаЛояльности КАК Справочник.Renault_КартыЛояльности).DMS_ВидКартыЛояльности <> ЗНАЧЕНИЕ(Справочник.DMS_ВидыКартЛояльности.пустаяСсылка)
		|	И ВЫРАЗИТЬ(&КартаЛояльности КАК Справочник.Renault_КартыЛояльности).DMS_ТипКарты = ЗНАЧЕНИЕ(Перечисление.DMS_ТипыКартЛояльности.Бонусная)
		|	И ПравилаЗаменыБонусныхКарт.ВидБонуснойКарты = ВЫРАЗИТЬ(&КартаЛояльности КАК Справочник.Renault_КартыЛояльности).DMS_ВидКартыЛояльности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БонусныеБаллы.КартаЛояльности КАК КартаЛояльности,
		|	БонусныеБаллы.ПрограммаЛояльности КАК ПрограммаЛояльности,
		|	БонусныеБаллы.НачисленоОстаток КАК Остаток
		|ПОМЕСТИТЬ ОстаткиПоКарте
		|ИЗ
		|	РегистрНакопления.DMS_БонусныеБаллы.Остатки(
		|			&ТекущаяДата,
		|			КартаЛояльности = (ВЫРАЗИТЬ(&КартаЛояльности КАК Справочник.Renault_КартыЛояльности))
		|					И ЕСТЬNULL(ПрограммаЛояльности.DMS_ЮрФизЛицо, ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.ПустаяСсылка)) = &ЮрФизЛицо
		|				ИЛИ ЕСТЬNULL(ПрограммаЛояльности.DMS_ЮрФизЛицо, ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.ПустаяСсылка)) КАК БонусныеБаллы
		|ГДЕ
		|	БонусныеБаллы.НачисленоОстаток + БонусныеБаллы.КСписаниюОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Заказчик КАК Контрагент,
		|	ОстаткиПоКарте.КартаЛояльности КАК КартаЛояльности,
		|	ОстаткиПоКарте.ПрограммаЛояльности КАК ПрограммаЛояльности,
		|	ВидыКартБонусныхКарт.ВидКарты КАК ВидКарты,
		|	ОстаткиПоКарте.Остаток КАК Номинал
		|ПОМЕСТИТЬ ЗаменаБонуснойНаНовую
		|ИЗ
		|	ВидыКартБонусныхКарт КАК ВидыКартБонусныхКарт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстаткиПоКарте КАК ОстаткиПоКарте
		|		ПО ВидыКартБонусныхКарт.КартаЛояльности = ОстаткиПоКарте.КартаЛояльности
		|			И ВидыКартБонусныхКарт.СуммаБалловОт <= ОстаткиПоКарте.Остаток
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаменаБонуснойНаНовую.ВидКарты,
		|	МАКСИМУМ(ЗаменаБонуснойНаНовую.Номинал) КАК Номинал
		|ПОМЕСТИТЬ МаксимальноеЗначениеВидаКарт
		|ИЗ
		|	ЗаменаБонуснойНаНовую КАК ЗаменаБонуснойНаНовую
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаменаБонуснойНаНовую.ВидКарты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПравилаЗаменыДисконтныхКарт.Ссылка КАК ВидКарты,
		|	ПравилаЗаменыДисконтныхКарт.Номинал КАК Номинал,
		|	&Заказчик КАК Контрагент,
		|	ВЫРАЗИТЬ(&КартаЛояльности КАК Справочник.Renault_КартыЛояльности) КАК КартаИсточник,
		|	ЗНАЧЕНИЕ(Перечисление.DMS_ВидыОперацийКартЛояльности.ЗаменаДисконтнойКарты) КАК ВидОперации,
		|	&ТекущаяДата КАК Дата,
		|	ВЫРАЗИТЬ(&КартаЛояльности КАК Справочник.Renault_КартыЛояльности).DMS_КартаЗамены КАК КартаПриемник,
		|	&ЗаказНаряд
		|ИЗ
		|	Справочник.DMS_ВидыКартЛояльности.ПравилаЗаменыДисконтныхКарт КАК ПравилаЗаменыДисконтныхКарт
		|ГДЕ
		|	НЕ ПравилаЗаменыДисконтныхКарт.Ссылка.ПометкаУдаления
		|	И ВЫРАЗИТЬ(&КартаЛояльности КАК Справочник.Renault_КартыЛояльности).DMS_ВидКартыЛояльности <> ЗНАЧЕНИЕ(Справочник.DMS_ВидыКартЛояльности.пустаяСсылка)
		|	И ПравилаЗаменыДисконтныхКарт.ВидДисконтнойКарты = ВЫРАЗИТЬ(&КартаЛояльности КАК Справочник.Renault_КартыЛояльности).DMS_ВидКартыЛояльности
		|	И ВЫРАЗИТЬ(&КартаЛояльности КАК Справочник.Renault_КартыЛояльности).DMS_ТипКарты = ЗНАЧЕНИЕ(Перечисление.DMS_ТипыКартЛояльности.Дисконтная)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	мПрограммыЛояльности.ПрограммаЛояльности КАК ПрограммаЛояльности,
		|	&Заказчик КАК Контрагент,
		|	&ЗаказНаряд
		|ИЗ
		|	мПрограммыЛояльности КАК мПрограммыЛояльности
		|ГДЕ
		|	мПрограммыЛояльности.Подходит
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПрограммаЛояльности
		|АВТОУПОРЯДОЧИВАНИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаменаБонуснойНаНовую.Контрагент,
		|	ЗаменаБонуснойНаНовую.КартаЛояльности КАК КартаИсточник,
		|	ЗаменаБонуснойНаНовую.ПрограммаЛояльности,
		|	ЗаменаБонуснойНаНовую.ВидКарты,
		|	ЗаменаБонуснойНаНовую.Номинал,
		|	ЗНАЧЕНИЕ(Перечисление.DMS_ВидыОперацийКартЛояльности.ЗаменаБонуснойКарты) КАК ВидОперации,
		|	&ТекущаяДата КАК Дата,
		|	ВЫРАЗИТЬ(&КартаЛояльности КАК Справочник.Renault_КартыЛояльности).DMS_КартаЗамены КАК КартаПриемник,
		|	&ЗаказНаряд
		|ИЗ
		|	ЗаменаБонуснойНаНовую КАК ЗаменаБонуснойНаНовую
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксимальноеЗначениеВидаКарт КАК МаксимальноеЗначениеВидаКарт
		|		ПО ЗаменаБонуснойНаНовую.ВидКарты = МаксимальноеЗначениеВидаКарт.ВидКарты
		|			И ЗаменаБонуснойНаНовую.Номинал = МаксимальноеЗначениеВидаКарт.Номинал";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаЗаменыДисконтнойНаБонусную = РезультатЗапроса[9].Выбрать();
	
	МассивВидовЗамен = Новый Массив;
	
	Пока ВыборкаЗаменыДисконтнойНаБонусную.Следующий() Цикл
		
		СтруктураДаннных = Новый Структура("Контрагент,ВидОперации,Дата,КартаИсточник,КартаПриемник,ВидКарты,Номинал,ЗаказНаряд");
		
		ЗаполнитьЗначенияСвойств(СтруктураДаннных,ВыборкаЗаменыДисконтнойНаБонусную);
		
		МассивВидовЗамен.Добавить(СтруктураДаннных);
				
	КонецЦикла;                                     
	
	Если МассивВидовЗамен.Количество() > 0 Тогда
		
		#Если Клиент Тогда
			
			Если Вопрос("Заменить клиенту дисконтную карту на бонусную?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
				
				Сообщить("Клиенту можно заменить карту.");
				
				Возврат Неопределено;
				
			КонецЕсли;
			
			ПараметрыФормы = Новый Структура("МассивВариантовЗамены",МассивВидовЗамен);
			
			ОткрытьФормуМодально("Документ.DMS_ЗаменаКартЛояльности.Форма.ФормаВыбораПрограммЛояльности",ПараметрыФормы);
			
			Для каждого ТекущаяСтруктураПоиска Из МассивВидовЗамен Цикл
				
				мКарта = ПолучитьСозданнуюНовуюКарту(ТекущаяСтруктураПоиска);
				
				Если ЗначениеЗаполнено(мКарта) Тогда
					Возврат мКарта;
				КонецЕсли; 	
			
			КонецЦикла; 
			
			Возврат Неопределено;
			
		#КонецЕсли
		
	КонецЕсли; 	
	
	ВыборкаПредложенияДисконтнойКарты = РезультатЗапроса[10].Выбрать();
	
	СписокПрограмм = Новый СписокЗначений;
	
	Пока ВыборкаПредложенияДисконтнойКарты.Следующий() Цикл
		СписокПрограмм.Добавить(ВыборкаПредложенияДисконтнойКарты.ПрограммаЛояльности);	
	КонецЦикла; 
	
	Если СписокПрограмм.Количество() > 0 Тогда
		Возврат ПредложитьДисконтнуюКарту(СписокПрограмм,Заказчик,Организация,КартаЛояльности,Период);	
	КонецЕсли; 
	
	ВыборкаЗаменыНаНовуюБонускнуюКарту = РезультатЗапроса[11].Выбрать();
	
	Если ВыборкаЗаменыНаНовуюБонускнуюКарту.Следующий() Тогда
		
		#Если Клиент Тогда
			
			Если Вопрос("Заменить клиенту бонусную карту на новую?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
				
				Сообщить("Клиенту можно заменить карту.");
				
				Возврат Неопределено;
				
			КонецЕсли;
			
			ДанныеЗаменыКарты = Новый Структура("Контрагент,ВидОперации,Дата,КартаИсточник,КартаПриемник,ВидКарты,Номинал,ЗаказНаряд");
			
			ЗаполнитьЗначенияСвойств(ДанныеЗаменыКарты,ВыборкаЗаменыНаНовуюБонускнуюКарту);		
			
			ПараметрыФормы = Новый Структура("ДанныеЗаменыКарты",ДанныеЗаменыКарты);
			
			ОткрытьФормуМодально("Документ.DMS_ЗаменаКартЛояльности.Форма.ФормаДокумента",ПараметрыФормы);
			
			Возврат ПолучитьСозданнуюНовуюКарту(ДанныеЗаменыКарты);
			
		#КонецЕсли
		
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции

Функция ПроверитьВозможностьВыдачиКартыБонусной(Организация,Заказчик,Период,ЗаказНаряд = Неопределено) Экспорт 
	
	ЮрФизЛицо = КонтрагентЮрФизЛицо(Заказчик,Renault_CRM.ПолучитьДилерскийЦентрПользователя());//DMS
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заказчик", 		 Заказчик);
	Запрос.УстановитьПараметр("Организация", 	 Организация);
	Запрос.УстановитьПараметр("Период",		     Период);
	Запрос.УстановитьПараметр("ТекущаяДата",     ТекущаяДата());
	Запрос.УстановитьПараметр("ЮрФизЛицо",       ЮрФизЛицо);//DMS
	Запрос.УстановитьПараметр("ЗаказНаряд",      ?(ЗаказНаряд = Неопределено,Документы.ЗаказНаряд.ПустаяСсылка(),ЗаказНаряд));//DMS
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПравилаУчастия.Ссылка,
		|	ПравилаУчастия.СуммаВсегоРаботОт КАК СуммаВсегоРаботОт,
		|	ПравилаУчастия.СуммаВсегоЗапчастейОт КАК СуммаВсегоЗапчастейОт,
		|	ПравилаУчастия.ПрограммаЛояльности КАК ПрограммаЛояльности,
		|	ПравилаУчастия.ПериодПроверкиРабот,
		|	ПравилаУчастия.ПериодПроверкиЗапчастей,
		|	ПравилаУчастия.СуммаВсегоЗаказНарядОт,
		|	ПравилаУчастия.СуммаВсегоРаботДо,
		|	ПравилаУчастия.СуммаВсегоЗапчастейДо,
		|	ПравилаУчастия.СуммаВсегоЗаказНарядДо,
		|	ПравилаУчастия.ПериодПроверкиСуммыДокумента,
		|	ЕСТЬNULL(ПравилаУчастия.ПрограммаЛояльности.Уровень, 0) КАК УровеньПрограммы,
		|	ПравилаУчастия.ДействуетДляОрганизации
		|ПОМЕСТИТЬ ТаблицаПравил
		|ИЗ
		|	Справочник.Renault_ПравилаУчастияВПрограммеЛояльности КАК ПравилаУчастия
		|ГДЕ
		|	НЕ ПравилаУчастия.ПометкаУдаления
		|	И (ПравилаУчастия.ДействуетДляОрганизации <> &Организация
		|			ИЛИ ПравилаУчастия.ДействуетДляОрганизации = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
		|	И (ЕСТЬNULL(ПравилаУчастия.ПрограммаЛояльности.DMS_ЮрФизЛицо, ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.ПустаяСсылка)) = &ЮрФизЛицо
		|			ИЛИ ЕСТЬNULL(ПравилаУчастия.ПрограммаЛояльности.DMS_ЮрФизЛицо, ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(ИключаемыеВидыРемонта.ВидРемонта, ЗНАЧЕНИЕ(Справочник.ВидыРемонта.пустаяСсылка)) КАК ВидРемонта,
		|	ТаблицаПравил.Ссылка КАК ПравилоУчастия
		|ПОМЕСТИТЬ ИсключенныеПравилаОбмена
		|ИЗ
		|	ТаблицаПравил КАК ТаблицаПравил
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_ПравилаУчастияВПрограммеЛояльности.ИключаемыеВидыРемонта КАК ИключаемыеВидыРемонта
		|		ПО ТаблицаПравил.Ссылка = ИключаемыеВидыРемонта.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(ИключаемыеВидыРемонта.ВидРемонта, ЗНАЧЕНИЕ(Справочник.ВидыРемонта.пустаяСсылка)),
		|	ТаблицаПравил.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказНаряд.Ссылка КАК ЗаказНаряд,
		|	ИсключенныеПравилаОбмена.ПравилоУчастия КАК ПравилоУчастия,
		|	МАКСИМУМ(ЗаказНаряд.СуммаДокумента) КАК СуммаДокумента,
		|	МАКСИМУМ(0) КАК СуммаЗапчастей,
		|	МАКСИМУМ(0) КАК СуммаРабот
		|ПОМЕСТИТЬ мЗаказНаряды
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИсключенныеПравилаОбмена КАК ИсключенныеПравилаОбмена
		|		ПО (ЗаказНаряд.ВидРемонта <> ЕСТЬNULL(ИсключенныеПравилаОбмена.ВидРемонта, ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)))
		|ГДЕ
		|	ЗаказНаряд.ДатаЗакрытия МЕЖДУ ДОБАВИТЬКДАТЕ(&Период, ДЕНЬ, -ИсключенныеПравилаОбмена.ПравилоУчастия.ПериодПроверкиСуммыДокумента) И &Период
		|	И ЗаказНаряд.Заказчик = &Заказчик
		|	И ЗаказНаряд.Организация = &Организация
		|	И НЕ ИсключенныеПравилаОбмена.ПравилоУчастия ЕСТЬ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНаряд.Ссылка,
		|	ИсключенныеПравилаОбмена.ПравилоУчастия
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНаряд.Ссылка,
		|	ИсключенныеПравилаОбмена.ПравилоУчастия,
		|	МАКСИМУМ(0),
		|	МАКСИМУМ(0),
		|	МАКСИМУМ(ЗаказНаряд.СуммаРаботДокумента)
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИсключенныеПравилаОбмена КАК ИсключенныеПравилаОбмена
		|		ПО (ЗаказНаряд.ВидРемонта <> ЕСТЬNULL(ИсключенныеПравилаОбмена.ВидРемонта, ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)))
		|ГДЕ
		|	ЗаказНаряд.ДатаЗакрытия МЕЖДУ ДОБАВИТЬКДАТЕ(&Период, ДЕНЬ, -ИсключенныеПравилаОбмена.ПравилоУчастия.ПериодПроверкиРабот) И &Период
		|	И ЗаказНаряд.Заказчик = &Заказчик
		|	И ЗаказНаряд.Организация = &Организация
		|	И НЕ ИсключенныеПравилаОбмена.ПравилоУчастия ЕСТЬ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНаряд.Ссылка,
		|	ИсключенныеПравилаОбмена.ПравилоУчастия
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНаряд.Ссылка,
		|	ИсключенныеПравилаОбмена.ПравилоУчастия,
		|	МАКСИМУМ(0),
		|	МАКСИМУМ(ЗаказНаряд.СуммаНоменклатурыДокумента),
		|	МАКСИМУМ(0)
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИсключенныеПравилаОбмена КАК ИсключенныеПравилаОбмена
		|		ПО (ЗаказНаряд.ВидРемонта <> ЕСТЬNULL(ИсключенныеПравилаОбмена.ВидРемонта, ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)))
		|ГДЕ
		|	ЗаказНаряд.ДатаЗакрытия МЕЖДУ ДОБАВИТЬКДАТЕ(&Период, ДЕНЬ, -ИсключенныеПравилаОбмена.ПравилоУчастия.ПериодПроверкиЗапчастей) И &Период
		|	И ЗаказНаряд.Заказчик = &Заказчик
		|	И ЗаказНаряд.Организация = &Организация
		|	И НЕ ИсключенныеПравилаОбмена.ПравилоУчастия ЕСТЬ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНаряд.Ссылка,
		|	ИсключенныеПравилаОбмена.ПравилоУчастия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	мЗаказНаряды.ПравилоУчастия,
		|	СУММА(мЗаказНаряды.СуммаДокумента) КАК СуммаДокумента,
		|	СУММА(мЗаказНаряды.СуммаЗапчастей) КАК СуммаЗапчастей,
		|	СУММА(мЗаказНаряды.СуммаРабот) КАК СуммаРабот
		|ПОМЕСТИТЬ СуммыПоПравилам
		|ИЗ
		|	мЗаказНаряды КАК мЗаказНаряды
		|
		|СГРУППИРОВАТЬ ПО
		|	мЗаказНаряды.ПравилоУчастия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СуммыПоПравилам.ПравилоУчастия,
		|	СуммыПоПравилам.СуммаДокумента,
		|	СуммыПоПравилам.СуммаЗапчастей,
		|	СуммыПоПравилам.СуммаРабот,
		|	ТаблицаПравил.ПрограммаЛояльности,
		|	ВЫБОР
		|		КОГДА ТаблицаПравил.СуммаВсегоЗаказНарядОт >= СуммыПоПравилам.СуммаДокумента
		|				ИЛИ ТаблицаПравил.СуммаВсегоЗаказНарядДо <= СуммыПоПравилам.СуммаДокумента
		|			ТОГДА ИСТИНА
		|		КОГДА ТаблицаПравил.СуммаВсегоРаботОт >= СуммыПоПравилам.СуммаРабот
		|				ИЛИ ТаблицаПравил.СуммаВсегоРаботДо <= СуммыПоПравилам.СуммаРабот
		|			ТОГДА ИСТИНА
		|		КОГДА ТаблицаПравил.СуммаВсегоЗапчастейОт >= СуммыПоПравилам.СуммаЗапчастей
		|				ИЛИ ТаблицаПравил.СуммаВсегоЗапчастейДо <= СуммыПоПравилам.СуммаЗапчастей
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Подходит
		|ПОМЕСТИТЬ мПрограммыЛояльности
		|ИЗ
		|	СуммыПоПравилам КАК СуммыПоПравилам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПравил КАК ТаблицаПравил
		|		ПО СуммыПоПравилам.ПравилоУчастия = ТаблицаПравил.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	мПрограммыЛояльности.ПрограммаЛояльности КАК ПрограммаЛояльности,
		|	МАКСИМУМ(&Заказчик) КАК Контрагент,
		|	ПравилаВыдачиКарт.Ссылка КАК ВидКарты,
		|	СУММА(ПравилаВыдачиКарт.Номинал) КАК Номинал,
		|	ЗНАЧЕНИЕ(перечисление.DMS_ВидыОперацийКартЛояльности.ВыдачаБонуснойКарты) КАК ВидОперации,
		|	ЗНАЧЕНИЕ(Перечисление.DMS_СтатусЗаменыКарт.НаОзнакомлении) КАК Статус,
		|	&ТекущаяДата КАК Дата,
		|	&ЗаказНаряд КАК ЗаказНаряд
		|ИЗ
		|	мПрограммыЛояльности КАК мПрограммыЛояльности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.DMS_ВидыКартЛояльности.ПравилаВыдачиКарт КАК ПравилаВыдачиКарт
		|		ПО мПрограммыЛояльности.ПрограммаЛояльности = ПравилаВыдачиКарт.ПрограммаЛояльности
		|ГДЕ
		|	мПрограммыЛояльности.Подходит
		|
		|СГРУППИРОВАТЬ ПО
		|	ПравилаВыдачиКарт.Ссылка,
		|	мПрограммыЛояльности.ПрограммаЛояльности
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДанных = РезультатЗапроса.Выбрать();
	
	МассивВариантов = Новый Массив;
	
	Пока ВыборкаДанных.Следующий() Цикл
	
		СтруктураВариантов = Новый Структура;
		
		Для каждого ТекущаяКолонка Из РезультатЗапроса.Колонки Цикл
			СтруктураВариантов.Вставить(ТекущаяКолонка.Имя,ВыборкаДанных[ТекущаяКолонка.Имя]);
		КонецЦикла; 
		
		МассивВариантов.Добавить(СтруктураВариантов);
		
	КонецЦикла; 
	
	Если МассивВариантов.Количество() > 0 Тогда
		
		#Если Клиент Тогда
			
			Если Вопрос("Выдать клиенту новую бонусную карту?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
				
				Сообщить("Клиенту можно выдать бонусную карту.");
				
				Возврат Неопределено;
				
			КонецЕсли;
			
			ПараметрыФормы = Новый Структура("МассивВариантов",МассивВариантов);
			
			ОткрытьФормуМодально("Документ.DMS_ВыдачаКартыЛояльности.Форма.ФормаВыбораВариантов",ПараметрыФормы);
			
			Для каждого ТекущаяСтруктураПоиска Из МассивВариантов Цикл
				
				мКарта = ПолучитьРаннееСозданнуюНовуюБонуснуюКарт(ТекущаяСтруктураПоиска);
				
				Если ЗначениеЗаполнено(мКарта) Тогда
					Возврат мКарта;
				КонецЕсли; 	
				
			КонецЦикла; 
			
		#КонецЕсли
		
		Возврат Неопределено;
		
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции

Функция ПредложитьДисконтнуюКарту(СписокПрограмм,Контрагент,Организация,СуществующаяКарта,ТекущаяДата)
	
	Если ЗначениеЗаполнено(СписокПрограмм) Тогда
		
		#Если Клиент Тогда
			
			Если Вопрос("Выдать клиенту новую дисконтную карту?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
				
				Сообщить("Клиенту можно выдать карту.");
				
				Возврат Неопределено;
				
			КонецЕсли;
						
			Если СписокПрограмм.Количество() = 1 Тогда
								
				НоваяКарта = Справочники.Renault_КартыЛояльности.СоздатьЭлемент();
				НоваяКарта.УстановитьНовыйКод();
				НоваяКарта.Контрагент = Контрагент;
				НоваяКарта.Наименование = "Карта: " + Строка(Контрагент);
				НоваяКарта.Примечание = "";
				НоваяКарта.ДатаВыдачи = ТекущаяДата;
				НоваяКарта.ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
				НоваяКарта.ПрограммаЛояльности = СписокПрограмм[0].Значение;
				НоваяКарта.КемВыдана = ПараметрыСеанса.Пользователь.Сотрудник;
				НоваяКарта.Записать();
				
				Если ЗначениеЗаполнено(СуществующаяКарта) Тогда
					
					ПеренестиБаллыНаНовуюКарту(СуществующаяКарта, НоваяКарта, НоваяКарта.ПрограммаЛояльности);
					
				КонецЕсли;
				
				Форма = НоваяКарта.ПолучитьФорму();
				Форма.ОткрытьМодально();
				
			ИначеЕсли СписокПрограмм.Количество() > 1 Тогда
				
				Форма = ПолучитьОбщуюФорму("Renault_ФормаВыбораПлиткой");
				Форма.Заголовок = "Какую программу лояльности выдаем?";
				Форма.СписокВыбора = СписокПрограмм;
				
				Ответ = Форма.ОткрытьМодально();
				
				Если ЗначениеЗаполнено(Ответ) Тогда
										
					НоваяКарта = Справочники.Renault_КартыЛояльности.СоздатьЭлемент();
					НоваяКарта.УстановитьНовыйКод();
					НоваяКарта.Контрагент = Контрагент;
					НоваяКарта.Наименование = "Карта: " + Строка(Контрагент);
					НоваяКарта.Примечание = "";
					НоваяКарта.ДатаВыдачи = ТекущаяДата;
					НоваяКарта.ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
					НоваяКарта.ПрограммаЛояльности = Ответ;
					НоваяКарта.КемВыдана = ПараметрыСеанса.Пользователь.Сотрудник;
					НоваяКарта.Записать();
										
					Форма = НоваяКарта.ПолучитьФорму();
					Форма.ОткрытьМодально();
					
				КонецЕсли;
				
			КонецЕсли;			
			
		#КонецЕсли
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции // ПредложитьДисконтнуюКарту()

Функция ПолучитьРаннееСозданнуюНовуюБонуснуюКарт(ПараметрыЗапроса)
	
	Запрос = Новый Запрос;
	
	Для каждого ТекущийПараметр Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(ТекущийПараметр.Ключ,ТекущийПараметр.Значение);
	КонецЦикла; 
	
	ЮрФизЛицо = КонтрагентЮрФизЛицо(ПараметрыЗапроса.Контрагент,Renault_CRM.ПолучитьДилерскийЦентрПользователя());//DMS
	Запрос.УстановитьПараметр("ЮрФизЛицо",ЮрФизЛицо);//DMS	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КартыПокупателей.КартаЛояльности,
		|	КартыПокупателей.Ссылка
		|ИЗ
		|	Документ.DMS_ВыдачаКартыЛояльности.КартыПокупателей КАК КартыПокупателей
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(КартыПокупателей.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
		|	И КартыПокупателей.Ссылка.ВидОперации = &ВидОперации
		|	И НЕ ЕСТЬNULL(КартыПокупателей.КартаЛояльности.Недействительна, ИСТИНА)
		|	И КартыПокупателей.КартаЛояльности.Контрагент = &Контрагент
		|	И КартыПокупателей.КартаЛояльности <> ЗНАЧЕНИЕ(Справочник.Renault_КартыЛояльности.пустаяСсылка)
		|	И КартыПокупателей.ВидКарты = &ВидКарты
		|	И КартыПокупателей.Ссылка.ПрограммаЛояльности = &ПрограммаЛояльности
		|	И (ЕСТЬNULL(КартыПокупателей.Ссылка.ПрограммаЛояльности.DMS_ЮрФизЛицо, ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.ПустаяСсылка)) = &ЮрФизЛицо
		|			ИЛИ ЕСТЬNULL(КартыПокупателей.Ссылка.ПрограммаЛояльности.DMS_ЮрФизЛицо, ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.ПустаяСсылка))
		|	И КартыПокупателей.Ссылка.ЗаказНаряд = &ЗаказНаряд";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДанных = РезультатЗапроса.Выбрать();

	Если ВыборкаДанных.Следующий() Тогда
		Возврат ВыборкаДанных.КартаЛояльности;	
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции // ПолучитьРаннееСозданнуюЗаменуКарт()

Функция ПолучитьКартуЛояльностиКлиента(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	ЮрФизЛицо = КонтрагентЮрФизЛицо(Контрагент,Renault_CRM.ПолучитьДилерскийЦентрПользователя());//DMS
	Запрос.УстановитьПараметр("ЮрФизЛицо",ЮрФизЛицо);//DMS	
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	КартыЛояльности.Ссылка
		|ИЗ
		|	Справочник.Renault_КартыЛояльности КАК КартыЛояльности
		|ГДЕ
		|	КартыЛояльности.Контрагент = &Контрагент
		|	И НЕ КартыЛояльности.ПометкаУдаления
		|	И НЕ КартыЛояльности.Недействительна
		|	И (ЕСТЬNULL(КартыЛояльности.ПрограммаЛояльности.DMS_ЮрФизЛицо, ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.ПустаяСсылка)) = &ЮрФизЛицо
		|			ИЛИ ЕСТЬNULL(КартыЛояльности.ПрограммаЛояльности.DMS_ЮрФизЛицо, ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.DMS_ЮридическоеФизическоеЛицо.ПустаяСсылка))";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	КартаЛояльности = Справочники.Renault_КартыЛояльности.ПустаяСсылка();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		КартаЛояльности = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли; 
	
	Возврат КартаЛояльности;

КонецФункции // ПолучитьКартуЛояльностиКлиента()

Функция Renault_ЕстьПривилегии(Контрагент = Неопределено, КартаЛояльности = Неопределено) Экспорт
	
			
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", 	 ?(Контрагент <> Неопределено, Контрагент,Справочники.Контрагенты.ПустаяСсылка()));
	Запрос.УстановитьПараметр("КартаЛояльности", ?(КартаЛояльности<>Неопределено,КартаЛояльности,Справочники.Renault_КартыЛояльности.ПустаяСсылка()));
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	КартыЛояльности.Контрагент КАК Контрагент,
		|	КартыЛояльности.Ссылка КАК КартаЛояльности
		|ПОМЕСТИТЬ ДанныеПоКонтрагенту
		|ИЗ
		|	Справочник.Renault_КартыЛояльности КАК КартыЛояльности
		|ГДЕ
		|	(КартыЛояльности.Ссылка = &КартаЛояльности
		|			ИЛИ &КартаЛояльности = ЗНАЧЕНИЕ(Справочник.Renault_КартыЛояльности.ПустаяСсылка))
		|	И (КартыЛояльности.Контрагент = &Контрагент
		|			ИЛИ &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.пустаяСсылка))
		|	И НЕ КартыЛояльности.ПометкаУдаления
		|	И НЕ КартыЛояльности.Недействительна
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеПоКонтрагенту.Контрагент,
		|	ДанныеПоКонтрагенту.КартаЛояльности
		|ИЗ
		|	ДанныеПоКонтрагенту КАК ДанныеПоКонтрагенту
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПривилегииПоКарте.Привилегия КАК Привилегия
		|ИЗ
		|	ДанныеПоКонтрагенту КАК ДанныеПоКонтрагенту
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.DMS_ВидыКартЛояльности.Привилегии КАК ПривилегииПоКарте
		|		ПО ДанныеПоКонтрагенту.КартаЛояльности.DMS_ВидКартыЛояльности = ПривилегииПоКарте.Ссылка";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Если РезультатЗапроса[1].Пустой() Тогда
		
		Возврат Ложь;
		
	КонецЕсли; 
		
	ДанныеПоПривилегиям = РезультатЗапроса[2].Выбрать();
	
	Если ДанныеПоПривилегиям.Количество() = 0 Тогда
				
		Возврат Ложь;
		
	КонецЕсли; 
		
    Возврат Истина;
	
КонецФункции

Функция ПечатьПривилегийКартыКлиента(Контрагент = Неопределено,КартаЛояльности = Неопределено) Экспорт 
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
		
	ТабличныйДокумент.ТолькоПросмотр  = Истина;
	ТабличныйДокумент.АвтоМасштаб     = Истина;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	
	Макет = ПолучитьОбщийМакет("DMS_МакетПривилегии");
	
	ОбластьШапка 	  = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьПривилегии = Макет.ПолучитьОбласть("ОбластьПривилегии");
	ОбластьНетДанных  = Макет.ПолучитьОбласть("ОбластьНетДанных");
	
	Если Контрагент = Неопределено 
		И КартаЛояльности = Неопределено Тогда
		
		ТабличныйДокумент.Вывести(ОбластьНетДанных);
		
		Возврат ТабличныйДокумент;
		
	КонецЕсли; 
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", 	 ?(Контрагент <> Неопределено, Контрагент,Справочники.Контрагенты.ПустаяСсылка()));
	Запрос.УстановитьПараметр("КартаЛояльности", ?(КартаЛояльности<>Неопределено,КартаЛояльности,Справочники.Renault_КартыЛояльности.ПустаяСсылка()));
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	КартыЛояльности.Контрагент КАК Контрагент,
		|	КартыЛояльности.Ссылка КАК КартаЛояльности
		|ПОМЕСТИТЬ ДанныеПоКонтрагенту
		|ИЗ
		|	Справочник.Renault_КартыЛояльности КАК КартыЛояльности
		|ГДЕ
		|	(КартыЛояльности.Ссылка = &КартаЛояльности
		|			ИЛИ &КартаЛояльности = ЗНАЧЕНИЕ(Справочник.Renault_КартыЛояльности.ПустаяСсылка))
		|	И (КартыЛояльности.Контрагент = &Контрагент
		|			ИЛИ &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.пустаяСсылка))
		|	И НЕ КартыЛояльности.ПометкаУдаления
		|	И НЕ КартыЛояльности.Недействительна
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеПоКонтрагенту.Контрагент,
		|	ДанныеПоКонтрагенту.КартаЛояльности
		|ИЗ
		|	ДанныеПоКонтрагенту КАК ДанныеПоКонтрагенту
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПривилегииПоКарте.Привилегия КАК Привилегия
		|ИЗ
		|	ДанныеПоКонтрагенту КАК ДанныеПоКонтрагенту
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.DMS_ВидыКартЛояльности.Привилегии КАК ПривилегииПоКарте
		|		ПО ДанныеПоКонтрагенту.КартаЛояльности.DMS_ВидКартыЛояльности = ПривилегииПоКарте.Ссылка";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Если РезультатЗапроса[1].Пустой() Тогда
		
		ТабличныйДокумент.Вывести(ОбластьНетДанных);
		
		Возврат ТабличныйДокумент;
		
	КонецЕсли; 
	
	ШапкаВывода = РезультатЗапроса[1].Выбрать();
	
	Если ШапкаВывода.Следующий() Тогда
		
		ОбластьШапка.Параметры.Заполнить(ШапкаВывода);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
	КонецЕсли;
	
	ДанныеПоПривилегиям = РезультатЗапроса[2].Выбрать();
	
	Если ДанныеПоПривилегиям.Количество() = 0 Тогда
		
		ТабличныйДокумент.Вывести(ОбластьНетДанных);
		
		Возврат ТабличныйДокумент;
		
	КонецЕсли; 
	
	Пока ДанныеПоПривилегиям.Следующий() Цикл
		
		ОбластьПривилегии.Параметры.Заполнить(ДанныеПоПривилегиям);
		ТабличныйДокумент.Вывести(ОбластьПривилегии);
		
	КонецЦикла; 
	
    Возврат ТабличныйДокумент;
	
КонецФункции // ПечатьПривилегийКартыКлиента()

Функция КонтрагентЮрФизЛицо(Контрагент,ДилерскийЦентр)
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Перечисления.DMS_ЮридическоеФизическоеЛицо.ПустаяСсылка();
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДилерскийЦентр", 	ДилерскийЦентр);
	Запрос.УстановитьПараметр("ФормаСобственности", Контрагент.ФормаСобственности);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	СопоставлениеФормСобственности.ЮрФизЛицо
		|ИЗ
		|	Справочник.CRM_ДилерскиеЦентры.DMS_СопоставлениеФормСобственности КАК СопоставлениеФормСобственности
		|ГДЕ
		|	СопоставлениеФормСобственности.ФормаСобственности = &ФормаСобственности
		|	И СопоставлениеФормСобственности.Ссылка = &ДилерскийЦентр";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Значение = Перечисления.DMS_ЮридическоеФизическоеЛицо.ПустаяСсылка();
	
	Если Выборка.Следующий() Тогда
		Значение = Выборка.ЮрФизЛицо;
	КонецЕсли; 
	
	Возврат Значение;
	
КонецФункции // КонтрагентЮрФизЛицо()

Функция ЕстьВыдачаИлиЗаменаНаОснованииЗаказНаряда(ЗаказНаряд)
	
	Если Не ЗначениеЗаполнено(ЗаказНаряд) Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказНаряд", ЗаказНаряд);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	ЗаменаКартЛояльности.ЗаказНаряд
		|ИЗ
		|	Документ.DMS_ЗаменаКартЛояльности КАК ЗаменаКартЛояльности
		|ГДЕ
		|	ЗаменаКартЛояльности.ЗаказНаряд = &ЗаказНаряд
		|	И НЕ ЗаменаКартЛояльности.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	ВыдачаКартыЛояльности.ЗаказНаряд
		|ИЗ
		|	Документ.DMS_ВыдачаКартыЛояльности КАК ВыдачаКартыЛояльности
		|ГДЕ
		|	ВыдачаКартыЛояльности.ЗаказНаряд = &ЗаказНаряд
		|	И НЕ ВыдачаКартыЛояльности.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();

КонецФункции // ЕстьВыдачаИлиЗаменаНаОснованииЗаказНаряда()
 

//DMS-

 