Функция НайтиЗадачуОФУ(Объект,ВидСобытия) Экспорт
	//Запрос=Новый Запрос("Выбрать Ссылка Из Задача.Renault_События ГДЕ Объект=&Объект И ВидСобытия=&ВидСобытия И Не ПометкаУдаления");
	//Запрос.УстановитьПараметр("ВидСобытия",ВидСобытия);
	Запрос=Новый Запрос("
	|Выбрать Ссылка Из Задача.Renault_События 
	|ГДЕ Объект=&Объект И Не ПометкаУдаления
	|	И (ВидСобытия=Значение(Справочник.CRM_ВидыСобытий.Кредит) ИЛИ ВидСобытия=Значение(Справочник.CRM_ВидыСобытий.КонсультацияОФУ))
	|");
	Запрос.УстановитьПараметр("Объект",Объект);
	Выборка=Запрос.Выполнить().Выбрать();
	//Выборка.Следующий();
	//Возврат Выборка.Ссылка

	//поменять вид задачи	
	Если Выборка.Следующий() Тогда
		Если Выборка.Ссылка.ВидСобытия = ВидСобытия Тогда
			Возврат Выборка.Ссылка;
		Иначе
			Задача = Выборка.Ссылка.ПолучитьОбъект();
			Задача.ВидСобытия = ВидСобытия;
			УстановитьНаименованиеЗадачи(Задача,ВидСобытия);
			Задача.Записать();
			Возврат Задача.Ссылка;
		КонецЕсли;
	Иначе
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции

Функция СоздатьНовую(Объект,ВидСобытия,Наименование="",ДилерскийЦентр="",Подразделение="",Отдел="",Сотрудник="",Контрагент="") Экспорт
	
	Задача = Задачи.Renault_События.СоздатьЗадачу();
	Задача.Дата = ТекущаяДата();
	Задача.ВидСобытия = ВидСобытия;
	
	УстановитьНаименованиеЗадачи(Задача,ВидСобытия,Наименование);
	Задача.Объект = Объект;
	
	//контрагент
	Если Контрагент<>"" Тогда
		Задача.Контрагент = Контрагент;
	Иначе
		Попытка
			Задача.Контрагент = Объект.Контрагент;
		Исключение
			Попытка
				Задача.Контрагент = Объект.Клиент;
			Исключение
			КонецПопытки;
		КонецПопытки
	КонецЕсли;
	//Задача.Состояние=Перечисления.Renault_CRM_СтатусЗаявокНаСтраховку.Черновик;
	
	Задача.Автор = ПараметрыСеанса.Пользователь;
	Задача.Сотрудник = ?(Сотрудник="",ПараметрыСеанса.Пользователь.Сотрудник, Сотрудник);
	Задача.ДилерскийЦентр = ?(ДилерскийЦентр="",Renault_CRM.ПолучитьДилерскийЦентрПользователя(Задача.Сотрудник),ДилерскийЦентр);
	Задача.Подразделение = ?(Подразделение="",Задача.Сотрудник.Подразделение,Подразделение);
	Задача.Отдел = ?(Отдел="",Renault_РаботаСПравамиПользователя.ОтделпоУмолчанию(Задача.Сотрудник),Отдел);
	Попытка
	Задача.Записать();
	Исключение
	КонецПопытки;
	Возврат Задача.Ссылка;
	
КонецФункции

Процедура УстановитьНаименованиеЗадачи(Задача,ВидСобытия="",Наименование="") Экспорт
	
	Если Наименование<>"" Тогда
		Задача.Наименование=Наименование;
	ИначеЕсли ВидСобытия=Справочники.CRM_ВидыСобытий.Страховка Тогда 
		Задача.Наименование="Создать заявку на СТРАХОВКУ";
	ИначеЕсли ВидСобытия=Справочники.CRM_ВидыСобытий.Кредит Тогда 
		Задача.Наименование="Создать заявку на КРЕДИТ";
	ИначеЕсли ВидСобытия=Справочники.CRM_ВидыСобытий.Лизинг Тогда
		Задача.Наименование="Создать заявку на ЛИЗИНГ";
	ИначеЕсли ВидСобытия=Справочники.CRM_ВидыСобытий.КонсультацияОФУ Тогда 
		Задача.Наименование="Консультация по ФИНАНСОВЫМ УСЛУГАМ";
	Иначе
		Задача.Наименование=ВидСобытия;
	КонецЕсли;
	
КонецПроцедуры

Функция ПринятьКИсполнению(Задача,Пользователь) Экспорт
	//Если ТипЗнч(Задача)<>Тип("ЗадачаОбъект.Renault_События") И ТипЗнч(Задача)<>Тип("ЗадачаСсылка.Renault_События") Тогда Возврат Ложь КонецЕсли; 
	
	Если Задача.Выполнена Тогда
		Сообщить("Задача выполнена",СтатусСообщения.Информация);
		Возврат Ложь;
	КонецЕсли;
	Если ТипЗнч(Задача)=Тип("ЗадачаОбъект.Renault_События") Тогда
		ЗадачаОбъект = Задача;
	Иначе
		ЗадачаОбъект = Задача.ПолучитьОбъект();
	КонецЕсли;
	ЗадачаОбъект.Исполнитель = Пользователь;
	//ЗадачаОбъект.ДатаПринятияКИсполнению=ТекущаяДата();
	ЗадачаОбъект.Состояние = Справочники.Renault_Состояния.ПринятКИсполнению;
	ЗадачаОбъект.Отдел = Renault_ОбщиеФункции.ПраваПользователя(Пользователь).Отдел;
	Попытка
		ЗадачаОбъект.Записать();
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Функция ОтменитьПринятиеКИсполнению(Задача,Пользователь) Экспорт
	
	//Если ТипЗнч(Задача)<>Тип("ЗадачаОбъект.Renault_События") И ТипЗнч(Задача)<>Тип("ЗадачаСсылка.Renault_События") Тогда Возврат Ложь КонецЕсли; 
	Если Задача.Исполнитель.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	Если Задача.Выполнена Тогда
		Сообщить("Задача выполнена",СтатусСообщения.Информация);
		Возврат Ложь;
	КонецЕсли;
	Если Задача.Исполнитель<>Пользователь Тогда 
		Сообщить("Задача принята другим пользователем",СтатусСообщения.Внимание);
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(Задача)=Тип("ЗадачаОбъект.Renault_События") Тогда
		ЗадачаОбъект = Задача;
	Иначе
		ЗадачаОбъект = Задача.ПолучитьОбъект();
	КонецЕсли;
	ЗадачаОбъект.Исполнитель="";
	//ЗадачаОбъект.ДатаПринятияКИсполнению="";
	//ЗадачаОбъект.СостояниеЗадачи=Перечисления.Renault_CRM_СтатусЗаявокНаСтраховку.Черновик;
	//ЗадачаОбъект.Отдел
	Попытка
		ЗадачаОбъект.Записать();
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Функция ВыполнитьЗадачу(Задача,Пользователь) Экспорт //записывает задачу как выполненную
	Если НЕ ЗначениеЗаполнено(Задача) Тогда Возврат Неопределено КонецЕсли;
	
	Если ТипЗнч(Задача)=Тип("ЗадачаОбъект.Renault_События") Тогда
		ЗадачаОбъект = Задача;
	Иначе
		ЗадачаОбъект = Задача.ПолучитьОбъект();
	КонецЕсли;
	Если ЦельЗадачиВыполнена(Задача.Ссылка) = Ложь Тогда
		Возврат Ложь;
	КонецЕсли;
	ЗадачаОбъект.ДатаЗакрытия = ТекущаяДата();
	ЗадачаОбъект.Исполнитель = Пользователь;
	ЗадачаОбъект.Состояние = Справочники.Renault_Состояния.ЗавершеноУспешно;
	ЗадачаОбъект.Выполнена = Истина;
	ЗадачаОбъект.Записать();
	Возврат Истина;
	
КонецФункции

Функция ОтменитьВыполнениеЗадачи(Задача) Экспорт
	//Если ТипЗнч(Задача)<>Тип("ЗадачаОбъект.Renault_События") И ТипЗнч(Задача)<>Тип("ЗадачаСсылка.Renault_События") Тогда Возврат Ложь КонецЕсли; 
	
	Если ТипЗнч(Задача) = Тип("ЗадачаОбъект.Renault_События") Тогда
		ЗадачаОбъект = Задача;
	Иначе
		ЗадачаОбъект = Задача.ПолучитьОбъект();
	КонецЕсли;
	ЗадачаОбъект.Исполнитель="";
	ЗадачаОбъект.ДатаЗакрытия="";
	ЗадачаОбъект.Состояние=Справочники.Renault_Состояния.ОтмененоВыполнение;
	ЗадачаОбъект.Выполнена=Ложь;
	Попытка
		ЗадачаОбъект.Записать();
		Возврат Истина;
	Исключение Сообщить("Не удалось отменить выполнение задачи:"+Символы.ПС+Символы.Таб+ОписаниеОшибки(),СтатусСообщения.Внимание);
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Функция ЦельЗадачиВыполнена(Задача)
	
	Если Задача.ВидСобытия = Справочники.CRM_ВидыСобытий.Кредит Тогда
		Запрос = Новый Запрос("Выбрать 1 Из Документ.Renault_РабочийЛистОФУ ГДЕ Проведен И Задача=&Задача И Состояние В(&СостоянияВыполнения)");
	ИначеЕсли Задача.ВидСобытия = Справочники.CRM_ВидыСобытий.Страховка или Задача.ВидСобытия=Справочники.CRM_ВидыСобытий.КонсультацияОФУ Тогда
		Запрос = Новый Запрос("Выбрать 1 Из Документ.Renault_РабочийЛистОФУ ГДЕ Проведен И Задача=&Задача И Состояние В(&СостоянияВыполнения)");
	ИначеЕсли Задача.ВидСобытия = Справочники.CRM_ВидыСобытий.Страховка или Задача.ВидСобытия=Справочники.CRM_ВидыСобытий.ПлановаяПролонгация 
				или Задача.ВидСобытия=Справочники.CRM_ВидыСобытий.КлиентыСервиса
				или Задача.ВидСобытия=Справочники.CRM_ВидыСобытий.УтеряннаяБаза
				или Задача.ВидСобытия=Справочники.CRM_ВидыСобытий.НапоминаниеОВзносе Тогда
				
		Если ТипЗнч(Задача.ОБъект) = Тип("СправочникСсылка.Renault_CommunicationCenter_СхемыОбзвона") и ЗначениеЗаполнено(Задача.Контрагент) Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
			                      |	Renault_CommunicationCenter_Обзвон.Ссылка
			                      |ИЗ
			                      |	Документ.Renault_CommunicationCenter_Обзвон КАК Renault_CommunicationCenter_Обзвон
			                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_CommunicationCenter_Обзвон.РезультатКоммуникации КАК Renault_CommunicationCenter_ОбзвонРезультатКоммуникации
			                      |		ПО Renault_CommunicationCenter_Обзвон.Ссылка = Renault_CommunicationCenter_ОбзвонРезультатКоммуникации.Ссылка
			                      |			И (Renault_CommunicationCenter_ОбзвонРезультатКоммуникации.Результат.ТипРезультата = &ПерезвонитьПозже)
			                      |ГДЕ
			                      |	Renault_CommunicationCenter_Обзвон.СхемаОбзвона = &СхемаОбзвона
			                      |	И Renault_CommunicationCenter_Обзвон.Клиент = &Клиент
			                      |	И Renault_CommunicationCenter_Обзвон.Проведен
			                      |	И НЕ Renault_CommunicationCenter_Обзвон.Недозвон
			                      |	И Renault_CommunicationCenter_ОбзвонРезультатКоммуникации.НомерСтроки ЕСТЬ NULL
			                      |	И Renault_CommunicationCenter_Обзвон.Дата <= &ДатаЗадачи
			                      |
			                      |УПОРЯДОЧИТЬ ПО
			                      |	Renault_CommunicationCenter_Обзвон.Дата УБЫВ");
			Запрос.УстановитьПараметр("СхемаОбзвона", Задача.Объект);
			Запрос.УстановитьПараметр("Клиент", Задача.Контрагент);
			Запрос.УстановитьПараметр("ДатаЗадачи", ТекущаяДата());
			Запрос.УстановитьПараметр("ПерезвонитьПозже", Перечисления.Renault_ДействияРезультатов.ПерезвонитьПозже);
			Результат = Запрос.Выполнить();
			Если Результат.Пустой() Тогда
				Возврат Ложь;
			Иначе
				Возврат Истина;
			КонецЕсли;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	
	Иначе
		Возврат Неопределено
	КонецЕсли;
	Запрос.УстановитьПараметр("Задача",Задача);
	
	Массив = Новый Массив;
	Массив.Добавить(Перечисления.Renault_CRM_СтатусЗаявокНаКредит.Выполнена);
	Массив.Добавить(Перечисления.Renault_CRM_СтатусЗаявокНаКредит.Одобрена);
	Массив.Добавить(Перечисления.Renault_CRM_СтатусЗаявокНаКредит.Отказ);
	Массив.Добавить(Перечисления.Renault_CRM_СтатусЗаявокНаКредит.Отменена);
	
	Массив.Добавить(Перечисления.Renault_CRM_СтатусЗаявокНаСтраховку.Выполнена);
	Массив.Добавить(Перечисления.Renault_CRM_СтатусЗаявокНаСтраховку.Закрыта);
	Массив.Добавить(Перечисления.Renault_CRM_СтатусЗаявокНаСтраховку.Отменена);
	
	Запрос.УстановитьПараметр("СостоянияВыполнения",Массив);
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Функция УстановитьАдресацию(Задача,Сотрудник="",Отдел="") Экспорт
	
	Объект=Задача.ПолучитьОбъект();
	Если Сотрудник<>"" Тогда
		Объект.Сотрудник=Сотрудник;
	КонецЕсли;
	Если Отдел<>"" Тогда
		Объект.Отдел=Отдел;
	КонецЕсли;
	
	Попытка 
		Объект.Записать();
		Возврат Истина
	Исключение
		Сообщить("Не удалось установить адресацию задачи. "+ОписаниеОшибки(),СтатусСообщения.Внимание);
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Функция УдалитьЗадачу(Задача) Экспорт
	
	Объект = Задача.ПолучитьОбъект();
	Попытка 
		Объект.УстановитьПометкуУдаления(Истина);
		Возврат Истина;
	Исключение
		Сообщить("Не удалось удалить задачу. "+ОписаниеОшибки(),СтатусСообщения.Внимание);
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Процедура СоздатьОткрытьЗадачуОФУ(Задача,КП,ЭтаФорма,ВидСобытия,Отдел="",Сотрудник="") Экспорт // создать новую или открыть существующую задачу (страховки / кредита)
	
	//если задача существует - открываем
	Если ЗначениеЗаполнено(Задача) Тогда 
		ОбластиПрименения=Новый Массив;
		ОбластиПрименения.Добавить(Перечисления.Renault_ОбластиПрименения.ОФУ);
		ОбластиПрименения.Добавить(Перечисления.Renault_ОбластиПрименения.Общие);
		
		ОткрытьЗадачу(Задача,ЭтаФорма,ОбластиПрименения); 
		Возврат 
	КонецЕсли;
	
	//иначе создаем новую
	Если Не ЗначениеЗаполнено(Отдел) Тогда
		Отдел=Renault_ОбщиеФункции.ПолучитьОтделОФУ(ЭтаФорма);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Отдел) Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(Отдел)=Тип("СправочникСсылка.CRM_Отделы") Тогда
		Задача=Задачи.Renault_События.СоздатьНовую(КП,ВидСобытия,,,,Отдел,Сотрудник);
		Сообщить("Создана задача ОФУ",СтатусСообщения.Важное);
	Иначе
		Сообщить("Не выбран отдел ОФУ, задача не создана", СтатусСообщения.Важное);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьЗадачу(Ссылка,ЭтаФорма,ОбластиПрименения="") Экспорт
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	Парам = Новый Структура("Ключ",Ссылка);
	Если ОбластиПрименения<>"" Тогда
		Парам.Вставить("ОбластиПрименения",ОбластиПрименения);
	КонецЕсли;
	//Если Renault_ОбщиеФункции.СтараяПлатформа() Тогда...
	Форма = ПолучитьФорму("Задача.Renault_События.ФормаОбъекта", Парам);
	Форма.Открыть();
	
КонецПроцедуры
