#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если Не ЗначениеЗаполнено(Объект.ГруппаКонтрагентовФизическиеЛица) Тогда
		Сообщить("Необходимо указать группу контрагентов для создания новых элементов справочника!");
		Отказ = Истина;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ГруппаКонтрагентовЮридическиеЛица) Тогда
		Сообщить("Необходимо указать группу контрагентов для создания новых элементов справочника!");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ТолькоПросмотр = Не РольДоступна("ПолныеПрава");
КонецПроцедуры

#КонецОбласти
