Функция ЗаписьЗНСуществует(СсылкаНаЗН, ТОлькоПризнак = Ложь) Экспорт
	
	Результат = Ложь;
	
	НЗ = СоздатьНаборЗаписей();
	НЗ.Отбор.ЗаказНаряд.Установить(СсылкаНаЗН);
	НЗ.Прочитать();
	
	Если ТолькоПризнак Тогда //Возвращять булево значение или строку набора
		Если НЗ.Количество() > 0 тогда 
			Результат = Истина; 
		КонецЕсли;
	Иначе
		Если НЗ.Количество() > 0 тогда 
			Результат = НЗ;
		Иначе
			Результат = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	НЗ = Неопределено;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьНовыйЗаказНарядВРегистр(Параметры) Экспорт
	
	МЗ = СоздатьМенеджерЗаписи();
	МЗ.ЗаказНаряд = Параметры["ЗаказНаряд"];
	МЗ.Прочитать();
	
	ЗаполнитьЗначенияСвойств(МЗ, Параметры);
	МЗ.Записать();
	
КонецПроцедуры

Процедура ОбновиитьЗаказНарядВРегистре(Параметры) Экспорт
	
	НЗ = СоздатьНаборЗаписей();
	НЗ.Отбор.ЗаказНаряд.Установить(Параметры["ЗаказНаряд"]);
	НЗ.Прочитать();
	
	НЗ.Очистить();
	
	Стр = НЗ.Добавить();
	ЗаполнитьЗначенияСвойств(стр, Параметры);
	
	НЗ.Записать();
	
КонецПроцедуры

Процедура УдалитьЗаписиПоЗаказНаряду(ЗаказНаряд) Экспорт
	
	НЗ = СоздатьНаборЗаписей();
	НЗ.Отбор.ЗаказНаряд.Установить(ЗаказНаряд);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 тогда
		
		НЗ.Очистить();
		НЗ.Записать();
		
	КонецЕсли;
	
КонецПроцедуры