
Функция ПолучитьИсполнителя(КодИсполнителя) Экспорт
	Если обЗначениеНеЗаполнено(КодИсполнителя) Тогда
		ФормаВыбора = ПолучитьФорму("ФормаВзятьВРаботу");
		ФормаВыбора.Заголовок = "Закрыть лид в LMS Автодилер";
		КодИсполнителя = ФормаВыбора.ОткрытьМодально();
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(КодИсполнителя) Тогда
		Сообщить("Для данного лида не указан исполнитель, закрытие лида невозможно!", СтатусСообщения.Внимание);
		Возврат Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
	ЗапросСотрудники = Новый Запрос();
	ЗапросСотрудники.УстановитьПараметр("КодИсполнителя", КодИсполнителя);
	
	МаркаАвтомобиля = УзелОбмена.МаркаАвтомобиля;
	Если МаркаАвтомобиля = Справочники.Марка.EXEED Тогда
		ИмяРесурса = "ExeedDSF_id";
		
	ИначеЕсли МаркаАвтомобиля = Справочники.Марка.JAECOO Тогда
		ИмяРесурса = "JaecooDSF_id";
		
	ИначеЕсли МаркаАвтомобиля = Справочники.Марка.OMODA Тогда
		ИмяРесурса = "OmodaJaecooDSF_id";
		
	ИначеЕсли (МаркаАвтомобиля = Справочники.Марка.CHERY Или МаркаАвтомобиля = Справочники.Марка.TENET) Тогда
		ИмяРесурса = "CheryDSF_id";
		
	ИначеЕсли МаркаАвтомобиля = Справочники.Марка.HAVAL Тогда
		ИмяРесурса = "HavalDSF_id";
		
	ИначеЕсли МаркаАвтомобиля = Справочники.Марка.GAC Тогда
		ИмяРесурса = "GAC_DSF_id";
	
	Иначе
		Сообщить("Не удалось найти сотрудника для бренда " + МаркаАвтомобиля, СтатусСообщения.Внимание);
		Возврат Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
	ЗапросСотрудники.Текст =
	"ВЫБРАТЬ
	|	УАЗDSFИдентификаторы.ОбъектАльфаАвто КАК Исполнитель
	|ИЗ
	|	РегистрСведений.УАЗDSFИдентификаторы КАК УАЗDSFИдентификаторы
	|ГДЕ
	|	УАЗDSFИдентификаторы.ОбъектАльфаАвто ССЫЛКА Справочник.Сотрудники
	|	И УАЗDSFИдентификаторы." + ИмяРесурса + " = &КодИсполнителя";
	
	ВыборкаСотрудники = ЗапросСотрудники.Выполнить().Выбрать();
	Если ВыборкаСотрудники.Следующий() Тогда
		Возврат ВыборкаСотрудники.Исполнитель;
		
	Иначе
		Сообщить("Не удалось найти сотрудника с кодом " + КодИсполнителя, СтатусСообщения.Внимание);
		Возврат Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
КонецФункции

Функция ПолучитьМодель(КодМодели) Экспорт
	Если КодМодели <= 0 Тогда
		Сообщить("Лид содержит Кода модели автомобиля (vehicleModel.id=" + КодМодели + ")!", СтатусСообщения.Информация);
		Возврат Справочники.Модели.ПустаяСсылка();
	КонецЕсли;
	
	ЗапросМодели = Новый Запрос();
	ЗапросМодели.УстановитьПараметр("КодМодели", КодМодели);
	ЗапросМодели.Текст =
	"ВЫБРАТЬ
	|	УАЗDSFИдентификаторы.ОбъектАльфаАвто КАК Модель
	|ИЗ
	|	РегистрСведений.УАЗDSFИдентификаторы КАК УАЗDSFИдентификаторы
	|ГДЕ
	|	УАЗDSFИдентификаторы.ОбъектАльфаАвто ССЫЛКА Справочник.Модели
	|	И УАЗDSFИдентификаторы.DSF_id = &КодМодели";
	
	ВыборкаМодели = ЗапросМодели.Выполнить().Выбрать();
	Если ВыборкаМодели.Следующий() Тогда
		Возврат ВыборкаМодели.Модель;
		
	Иначе
		Сообщить("Не удалось найти модель с кодом " + КодМодели, СтатусСообщения.Внимание);
		Возврат Справочники.Модели.ПустаяСсылка();
	КонецЕсли;
КонецФункции


