
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Функция ПолучитьТекущиеНастройкиКопмоновки(СтруктураНастроек)
	
	Если Не ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		СКД = ОбработкаОбъект.ПолучитьСхемуКД();
		СтруктураНастроек = Новый Структура("НастройкиКомпоновки", СКД.НастройкиПоУмолчанию);
	КонецЕсли;
	
	Возврат СтруктураНастроек.НастройкиКомпоновки;
	
КонецФункции

&НаСервере
Процедура ДобавитьПорядокКомпоновкиДанных(НастройкиКомпоновки, ИмяПоляПорядка)
	
	ПолеПорядок = НастройкиКомпоновки.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ПолеПорядок.Поле = Новый ПолеКомпоновкиДанных(ИмяПоляПорядка);
	ПолеПорядок.Использование = Истина;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьГруппировкуСКДПоПолям(КоллекцияЭлементовСтруктуры, СтрокаПолей)
	
	Если ТипЗнч(КоллекцияЭлементовСтруктуры) = Тип("КоллекцияЭлементовСтруктурыТаблицыКомпоновкиДанных") Или ТипЗнч(КоллекцияЭлементовСтруктуры) = Тип("ГруппировкаТаблицыКомпоновкиДанных") Тогда 
		ГруппировкаКД = КоллекцияЭлементовСтруктуры.Добавить();
	Иначе 
		Группировка = КоллекцияЭлементовСтруктуры.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	КонецЕсли;
	
	ГруппировкаКД.Использование = Истина;
	
	МассивПолей = РазложитьСтрокуВМассивПодстрок(СтрокаПолей);
	Для Каждого ЭлементПоле Из МассивПолей Цикл 
		
		Поле = ГруппировкаКД.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		Поле.Использование = Истина;
		Поле.Поле = Новый ПолеКомпоновкиДанных(ЭлементПоле);
	
	КонецЦикла;
	
	ВыбранныеПоляГруппировки = ГруппировкаКД.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	ВыбранныеПоляГруппировки.Использование = Истина;
	
	Возврат ГруппировкаКД;
	
КонецФункции

Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",") Экспорт
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
КонецФункции // РазложитьСтрокуВМассивПодстрок

&НаСервере
Функция ПроеобразоватьПредставление(Знач Представление)
	
	МассивПодстрок = РазложитьСтрокуВМассивПодстрок(Представление, " ");
	
	Представление = "";
	Для Каждого Подстрока Из МассивПодстрок Цикл 
		Представление = Представление + ТРег(СокрЛП(Подстрока));
	КонецЦикла;
	
	Возврат Представление
	
КонецФункции

&НаСервере
Функция НетПомеченныхЗначенийВСпискеЗначений(СписокЗначений)
	
	ЕстьПомеченные = Ложь;
	
	Для Каждого ЗначениеСписка Из СписокЗначений Цикл 
		Если ЗначениеСписка.Пометка Тогда 
			ЕстьПомеченные = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Не ЕстьПомеченные;
	
КонецФункции

&НаСервере
Функция ПолучитьЗначениеРеквизита(СсылкаНаОбъект, ИмяРеквзита)
	
	Возврат СсылкаНаОбъект[ИмяРеквзита];
	
КонецФункции

&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	НастройкиКомпоновки = ПолучитьТекущиеНастройкиКопмоновки(СтруктураНастроек);
	
	ЗаполнитьНастройкиСКДПоНастройкамПользователя(НастройкиКомпоновки);
	
	ОбработкаОбъект.СформироватьОтчет(Результат, АдресТаблицыДанных, URLСхемы, НастройкиКомпоновки, Период, СписокВыбранныхДопПолей);
	
	ЗначенияВыводимыеНаДиаграмму.ЗаполнитьПометки(Ложь);
	
	ПостроитьДиаграммуПоНастройкамНаСервере();
	
	Если ЗначениеЗаполнено(ИзмерениеДиаграммы) Тогда 
		ЗаполнитьСписокВозможныхЗначенийНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриОкончанииРедактированияНастроекКДНаСервере()
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("НастройкиКомпоновки", НастройкиКД.ПолучитьНастройки());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначениямиПоУмолчанию()
	
	Период.Вариант = ВариантСтандартногоПериода.ЭтотМесяц;
	
	НастройкиГруппировкиПоСтрокам.Добавить("Год");
	НастройкиГруппировкиПоСтрокам.Добавить("Квартал");
	НастройкиГруппировкиПоСтрокам.Добавить("Месяц");
	НастройкиГруппировкиПоСтрокам.Добавить("Неделя");
	НастройкиГруппировкиПоСтрокам.Добавить("ДеньНедели", "День недели");
	НастройкиГруппировкиПоСтрокам.Добавить("День");
	НастройкиГруппировкиПоСтрокам.Добавить("Час");
	
	НастройкиГруппировкиПоСтрокам.Добавить("ПервичныйПовторный", "Первичный/повторный", Ложь);
	НастройкиГруппировкиПоСтрокам.Добавить("ТипТрафика", "Тип трафика", Ложь);
	НастройкиГруппировкиПоСтрокам.Добавить("Отдел",, Ложь);
	НастройкиГруппировкиПоСтрокам.Добавить("Менеджер",, Ложь);
	НастройкиГруппировкиПоСтрокам.Добавить("Администратор",, Ложь);
	НастройкиГруппировкиПоСтрокам.Добавить("ПервичныйИнтерес", "Первичный интерес", Ложь);
	НастройкиГруппировкиПоСтрокам.Добавить("ИсточникИнформации", "Источник информации", Ложь);
	НастройкиГруппировкиПоСтрокам.Добавить("ДилерскийЦентр", "Дилерский центр", Ложь);
	НастройкиГруппировкиПоСтрокам.Добавить("Период",, Ложь);
	
	Элементы.Периодичность.СписокВыбора.Добавить("Год");
	Элементы.Периодичность.СписокВыбора.Добавить("Квартал");
	Элементы.Периодичность.СписокВыбора.Добавить("Месяц");
	Элементы.Периодичность.СписокВыбора.Добавить("Неделя");
	Элементы.Периодичность.СписокВыбора.Добавить("ДеньНедели", "День недели");
	Элементы.Периодичность.СписокВыбора.Добавить("День");
	Элементы.Периодичность.СписокВыбора.Добавить("Час");
	
	Элементы.ПериодичностьДиаграмма.СписокВыбора.Добавить("Год");
	Элементы.ПериодичностьДиаграмма.СписокВыбора.Добавить("Квартал");
	Элементы.ПериодичностьДиаграмма.СписокВыбора.Добавить("Месяц");
	Элементы.ПериодичностьДиаграмма.СписокВыбора.Добавить("Неделя");
	Элементы.ПериодичностьДиаграмма.СписокВыбора.Добавить("ДеньНедели", "День недели");
	Элементы.ПериодичностьДиаграмма.СписокВыбора.Добавить("День");
	Элементы.ПериодичностьДиаграмма.СписокВыбора.Добавить("Час");
	
	Периодичность = "Час";
	//Элементы.Периодичность.СписокВыбора.Добавить("Период");
	
	Элементы.ИзмерениеДиаграммы.СписокВыбора.Добавить("ПервичныйПовторный", "Первичный/повторный");
	Элементы.ИзмерениеДиаграммы.СписокВыбора.Добавить("ТипТрафика", "Тип трафика");
	Элементы.ИзмерениеДиаграммы.СписокВыбора.Добавить("Отдел");
	Элементы.ИзмерениеДиаграммы.СписокВыбора.Добавить("Менеджер");
	Элементы.ИзмерениеДиаграммы.СписокВыбора.Добавить("Администратор");
	Элементы.ИзмерениеДиаграммы.СписокВыбора.Добавить("ПервичныйИнтерес", "Первичный интерес");
	Элементы.ИзмерениеДиаграммы.СписокВыбора.Добавить("ИсточникИнформации", "Источник информации");
	Элементы.ИзмерениеДиаграммы.СписокВыбора.Добавить("ДилерскийЦентр", "Дилерский центр");
	Элементы.ИзмерениеДиаграммы.СписокВыбора.Добавить("Год");
	Элементы.ИзмерениеДиаграммы.СписокВыбора.Добавить("Квартал");
	Элементы.ИзмерениеДиаграммы.СписокВыбора.Добавить("Месяц");
	Элементы.ИзмерениеДиаграммы.СписокВыбора.Добавить("Неделя");
	Элементы.ИзмерениеДиаграммы.СписокВыбора.Добавить("ДеньНедели", "День недели");
	Элементы.ИзмерениеДиаграммы.СписокВыбора.Добавить("День");
	Элементы.ИзмерениеДиаграммы.СписокВыбора.Добавить("Час");
	
	ВыбранныеПоля.Добавить("ПервичныйПовторный", "Первичный/повторный", Ложь);
	ВыбранныеПоля.Добавить("ТипТрафика", "Тип трафика", Ложь);
	ВыбранныеПоля.Добавить("Отдел",, Ложь);
	ВыбранныеПоля.Добавить("Менеджер",, Ложь);
	ВыбранныеПоля.Добавить("Администратор",, Ложь);
	ВыбранныеПоля.Добавить("ПервичныйИнтерес", "Первичный интерес", Ложь);
	ВыбранныеПоля.Добавить("ИсточникИнформации", "Источник информации", Ложь);
	ВыбранныеПоля.Добавить("ДилерскийЦентр", "Дилерский центр", Ложь);
	ВыбранныеПоля.Добавить("Период",, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВозможныхЗначенийНаСервере()
	
	Если ЗначениеЗаполнено(АдресТаблицыДанных) Тогда 
		
		Если ЗначениеЗаполнено(ИзмерениеДиаграммы) Тогда 
			
			ТаблицаДанных = ПолучитьИзВременногоХранилища(АдресТаблицыДанных);
			ВремТаблицаДанных = ТаблицаДанных.Скопировать();
			Если ВремТаблицаДанных.Колонки.Найти(ИзмерениеДиаграммы) <> Неопределено Тогда 
				ВремТаблицаДанных.Свернуть(ИзмерениеДиаграммы);
			Иначе 
				Возврат;
			КонецЕсли;
			
			ЗначенияВыводимыеНаДиаграмму.ЗагрузитьЗначения(ВремТаблицаДанных.ВыгрузитьКолонку(ИзмерениеДиаграммы));
			
			Для Каждого ВыводимоеЗначение Из ЗначенияВыводимыеНаДиаграмму Цикл 
				
				Если Не ЗначениеЗаполнено(ВыводимоеЗначение.Значение)  Тогда 
					
					ВыводимоеЗначение.Представление = "<не заполнено>";
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе 
		сфСообщитьОбОшибке("Нет данных для заполнения значений...");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиСКДПоНастройкамПользователя(НастройкиКомпоновки)
	
	НастройкиКомпоновки.Структура.Очистить();
	
	ТаблицаКомпоновки = НастройкиКомпоновки.Структура.Добавить(Тип("ТаблицаКомпоновкиДанных"));
	
	НастройкиКомпоновки.Порядок.Элементы.Очистить();
	
	ТекущаяГруппировкаПоСтрокам = Неопределено;
	Для Каждого ГруппировкаПоСтрокам Из НастройкиГруппировкиПоСтрокам Цикл 
		Если ГруппировкаПоСтрокам.Пометка Тогда 
			Если ТекущаяГруппировкаПоСтрокам = Неопределено Тогда 
				ТекущаяГруппировкаПоСтрокам = ДобавитьГруппировкуСКДПоПолям(ТаблицаКомпоновки.Строки, ГруппировкаПоСтрокам.Значение);
			Иначе 
				ТекущаяГруппировкаПоСтрокам = ДобавитьГруппировкуСКДПоПолям(ТекущаяГруппировкаПоСтрокам.Структура, ГруппировкаПоСтрокам.Значение);
			КонецЕсли;
			ДобавитьПорядокКомпоновкиДанных(НастройкиКомпоновки, ГруппировкаПоСтрокам.Значение);


		КонецЕсли;
	КонецЦикла;
	
	СтрокаВыбранныхПолей = "";
	Для Каждого ВыбранноеПоле Из ВыбранныеПоля Цикл 
		Если ВыбранноеПоле.Пометка Тогда 
			СтрокаВыбранныхПолей = СтрокаВыбранныхПолей + ?(ЗначениеЗаполнено(СтрокаВыбранныхПолей), ",", "") + ПроеобразоватьПредставление(Строка(ВыбранноеПоле.Значение));
		КонецЕсли;
	КонецЦикла;
	
	Если ТекущаяГруппировкаПоСтрокам = Неопределено Тогда 
		ДобавитьГруппировкуСКДПоПолям(ТаблицаКомпоновки.Строки, СтрокаВыбранныхПолей);
	Иначе 
		ДобавитьГруппировкуСКДПоПолям(ТекущаяГруппировкаПоСтрокам.Структура, СтрокаВыбранныхПолей);
	КонецЕсли;
	
	ДобавитьГруппировкуСКДПоПолям(ТаблицаКомпоновки.Колонки, Периодичность);
	
	ДобавитьПорядокКомпоновкиДанных(НастройкиКомпоновки, Периодичность);
	
	
	
КонецПроцедуры

&НаСервере
Процедура ПостроитьДиаграммуПоНастройкамНаСервере()
	
	Если ЗначениеЗаполнено(АдресТаблицыДанных) И ЗначениеЗаполнено(Периодичность) Тогда 
		
		ТаблицаДанных = ПолучитьИзВременногоХранилища(АдресТаблицыДанных);
		
		ТаблицаДиаграммы = Новый ТаблицаЗначений;
		ТаблицаДиаграммы.Колонки.Добавить("ИмяТочки");
		
		Сч = 1;
		
		ВремТаблицаДанных = ТаблицаДанных.Скопировать();
		
		Если Не ЗначениеЗаполнено(ИзмерениеДиаграммы) Или НетПомеченныхЗначенийВСпискеЗначений(ЗначенияВыводимыеНаДиаграмму) Тогда 
			ВремТаблицаДанных.Свернуть(Периодичность, "Количество");
		ИначеЕсли ВремТаблицаДанных.Колонки.Найти(ИзмерениеДиаграммы) <> Неопределено Тогда 
			ВремТаблицаДанных.Свернуть(ИзмерениеДиаграммы + ", " + Периодичность, "Количество");
		Иначе 
			Возврат;
		КонецЕсли;
		
		Для Каждого ЗначениеДляДиаграммы Из ЗначенияВыводимыеНаДиаграмму Цикл 
			
			Если ЗначениеДляДиаграммы.Пометка Тогда 
				
				НайденныеСтроки = ВремТаблицаДанных.НайтиСтроки(Новый Структура(ИзмерениеДиаграммы, ЗначениеДляДиаграммы.Значение));
				
				КолонкаСерии = ТаблицаДиаграммы.Колонки.Добавить("Колонка" + Сч, , Строка(?(ЗначениеЗаполнено(ЗначениеДляДиаграммы.Значение), ЗначениеДляДиаграммы.Значение, ЗначениеДляДиаграммы.Представление)));
				
				Сч = Сч + 1;
				Для Каждого СтрокаДанных Из НайденныеСтроки Цикл 
					
					СуществующаяСтрока = ТаблицаДиаграммы.Найти(СтрокаДанных[Периодичность], "ИмяТочки");
					Если СуществующаяСтрока = Неопределено Тогда 
						НовСтрока = ТаблицаДиаграммы.Добавить();
					Иначе 
						НовСтрока = СуществующаяСтрока;
					КонецЕсли;
					НовСтрока.ИмяТочки = СтрокаДанных[Периодичность];
					НовСтрока[КолонкаСерии.Имя] = СтрокаДанных.Количество;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		// Если никаких данных не выбрано просто выведем все данные в один график
		Если ВремТаблицаДанных.Колонки.Количество() = 2 Тогда 
			
			КолонкаСерии = ТаблицаДиаграммы.Колонки.Добавить("Колонка" + Сч, , "Весь трафик");
			
			Для Каждого СтрокаДанных Из ВремТаблицаДанных Цикл 
				
				СуществующаяСтрока = ТаблицаДиаграммы.Найти(СтрокаДанных[Периодичность], "ИмяТочки");
				Если СуществующаяСтрока = Неопределено Тогда 
					НовСтрока = ТаблицаДиаграммы.Добавить();
				Иначе 
					НовСтрока = СуществующаяСтрока;
				КонецЕсли;
				НовСтрока.ИмяТочки = СтрокаДанных[Периодичность];
				НовСтрока[КолонкаСерии.Имя] = СтрокаДанных.Количество;
				
			КонецЦикла;
			
		КонецЕсли;
		
		ТаблицаДиаграммы.Сортировать("ИмяТочки");
		
		Диаграмма.СерииВСтроках = Ложь;
		Диаграмма.ТипДиаграммы = ТипДиаграммы.График;
		Диаграмма.ИсточникДанных = ТаблицаДиаграммы;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДополнительноеПоле()
	
	Если СписокВыбранныхДопПолей.Количество() > 0 Тогда 
		
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		СКД = ОбработкаОбъект.ПолучитьСхемуКД();
		// Поместим схему во временное хранилище
		
		Для Каждого ВыбранноеПоле Из СписокВыбранныхДопПолей Цикл 
			
			ИмяНовогоПоля = ПроеобразоватьПредставление(ВыбранноеПоле.Представление);
			
			НовоеПолеСКД = СКД.НаборыДанных.ВнешнийИсточник.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
			
			НовоеПолеСКД.Поле = ИмяНовогоПоля;
			НовоеПолеСКД.Заголовок = ВыбранноеПоле.Представление;
			НовоеПолеСКД.ПутьКДанным = ИмяНовогоПоля;
			НовоеПолеСКД.ТипЗначения = ВыбранноеПоле.Значение.ТипЗначения;
					
			НовОтбор = СКД.НастройкиПоУмолчанию.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			
			НовОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяНовогоПоля);	
			НовОтбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
			НовОтбор.Использование = Ложь;
			НовОтбор.ИдентификаторПользовательскойНастройки = Строка(Новый УникальныйИдентификатор);
	
			Если ВыбранныеПоля.НайтиПоЗначению(ВыбранноеПоле.Значение) = Неопределено Тогда 
				НовВыбранноеПоле = ВыбранныеПоля.Добавить();
				НовВыбранноеПоле.Значение = ВыбранноеПоле.Значение;
				НовВыбранноеПоле.Представление = ВыбранноеПоле.Представление;
				НовВыбранноеПоле.Пометка = Истина;
			КонецЕсли;
			
		КонецЦикла;
	
		URLСхемы = ПоместитьВоВременноеХранилище(СКД, Новый УникальныйИдентификатор);
		
		// Создадим источник
		ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
		НастройкиКД.Инициализировать(ИсточникДоступныхНастроек);
		//НастройкиКД.ЗагрузитьНастройки(ПолучитьТекущиеНастройкиКопмоновки(СтруктураНастроек)); 	
		НастройкиКД.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначениямиПоУмолчанию();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	СКД = ОбработкаОбъект.ПолучитьСхемуКД();
	
	СтруктураДополнительныхСвойств = ОбработкаОбъект.ПолучитьСписокДополнительныеПоля();
	
	// Поместим схему во временное хранилище
	URLСхемы = ПоместитьВоВременноеХранилище(СКД, Новый УникальныйИдентификатор);
	
	// Создадим источник
	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
	НастройкиКД.Инициализировать(ИсточникДоступныхНастроек);
	НастройкиКД.ЗагрузитьНастройки(ПолучитьТекущиеНастройкиКопмоновки(СтруктураНастроек)); 
	ТекущаяНастройка = "Последняя использованная настройка с городом"; 
	ЗагрузитьНастройкиИзХранилищаСервер(ТекущаяНастройка);
	

	//+++ DMSREN-700
	Если ВыбранныеПоля.НайтиПоЗначению("Город")= Неопределено Тогда 
		НастройкиГруппировкиПоСтрокам.Добавить("Город",, Ложь);
		Элементы.ИзмерениеДиаграммы.СписокВыбора.Добавить("Город");
		ВыбранныеПоля.Добавить("Город",, Ложь);
	КонецЕсли;
	
	Если Не ПараметрыСеанса.Renault_ПраваПользователя.ДилерскийЦентр.ИспользоватьГородВТрафике Тогда 
		НастройкиГруппировкиПоСтрокам.Удалить(НастройкиГруппировкиПоСтрокам.НайтиПоЗначению("Город"));
		Элементы.ИзмерениеДиаграммы.СписокВыбора.Удалить(Элементы.ИзмерениеДиаграммы.СписокВыбора.НайтиПоЗначению("Город"));
		ВыбранныеПоля.Удалить(ВыбранныеПоля.НайтиПоЗначению("Город"));
	КонецЕсли;
	//---	
КонецПроцедуры

&НаСервере
процедура ЗагрузитьНастройкиИзХранилищаСервер(КлючНастроек ="Последняя использованная настройка с городом")
	
	Настр  = ХранилищеПользовательскихНастроекОтчетов.Загрузить("Отчеты.Renault_ТрафикПоПериодам.ПоУмолчанию",КлючНастроек);
	ТекущаяНастройка = КлючНастроек;
	Если не (настр = Неопределено) Тогда
		Поля = новый СписокЗначений();
		Если Настр.свойство("ВыбранныеПоля",Поля)Тогда 
			////Поля = Настр.поля;
			ВыбранныеПоля = Поля;
			//Для каждого Поле из Поля Цикл
			//	ТекПоле = ВыбранныеПоля.НайтиПоЗначению(Поле.Значение);
			//	Если НЕ(ТекПоле = неопределено)Тогда
			//		ТекПоле.Пометка = Поле.пометка;
			//	КонецЕсли;
			//
			//КонецЦикла;
		КонецЕсли;
		
		Если Настр.свойство("НастройкиГруппировкиПоСтрокам",Поля)Тогда 
			//Поля = Настр.НастройкиГруппировкиПоСтрокам;
			НастройкиГруппировкиПоСтрокам = Поля;
			//Для каждого Поле из Поля Цикл
			//	ТекПоле = НастройкиГруппировкиПоСтрокам.НайтиПоЗначению(Поле.Значение);
			//	Если НЕ(ТекПоле = неопределено)Тогда
			//		ТекПоле.Пометка = Поле.пометка;
			//	КонецЕсли;
			//
			//КонецЦикла;
        КонецЕсли;

		Если Настр.свойство("Периодичность")Тогда
        	Периодичность = Настр.Периодичность;
		КонецЕсли;
		Если Настр.свойство("Период")Тогда
        	Период = Настр.Период;
		КонецЕсли;

		Если Настр.свойство("ИзмерениеДиаграммы")Тогда
           ИзмерениеДиаграммы = Настр.ИзмерениеДиаграммы;
	   КонецЕсли;
	   Если Настр.Свойство("НастройкиКДПользовательскиеНастройки")Тогда
		   НастройкиКД.ЗагрузитьПользовательскиеНастройки(Настр.НастройкиКДПользовательскиеНастройки);
	   КонецЕсли;
	   
		
		//ЗначенияВыводимыеНаДиаграмму.ЗагрузитьЗначения(МассивДиа);
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере	
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	СтруктураНастроек = Настройки["СтруктураНастроек"];
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	СКД = ОбработкаОбъект.ПолучитьСхемуКД();
	
	// Поместим схему во временное хранилище
	URLСхемы = ПоместитьВоВременноеХранилище(СКД, Новый УникальныйИдентификатор);
	
	// Создадим источник
	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
	НастройкиКД.Инициализировать(ИсточникДоступныхНастроек);
	НастройкиКД.ЗагрузитьНастройки(ПолучитьТекущиеНастройкиКопмоновки(СтруктураНастроек)); 	
	
	ДобавитьДополнительноеПоле();
	
	

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьОтчетНаСервере();	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОтбор(Команда)
	
	ФормаВыбора = ПолучитьФорму("ПланВидовХарактеристик.CRM_РеквизитыТрафика.ФормаВыбора");
	РезультатВыбора = ФормаВыбора.ОткрытьМодально();
	
	Если РезультатВыбора <> Неопределено Тогда 
		
		Если СписокВыбранныхДопПолей.НайтиПоЗначению(РезультатВыбора) = Неопределено Тогда 
			НовВыбранноеЗначение = СписокВыбранныхДопПолей.Добавить();
			НовВыбранноеЗначение.Значение = РезультатВыбора;
			НовВыбранноеЗначение.Представление = ПолучитьЗначениеРеквизита(РезультатВыбора, "Наименование");
		КонецЕсли;
		
		ДобавитьДополнительноеПоле();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВыбранноеПоле(Команда)
	
	ФормаВыбора = ПолучитьФорму("ПланВидовХарактеристик.CRM_РеквизитыТрафика.ФормаВыбора");
	РезультатВыбора = ФормаВыбора.ОткрытьМодально();
	
	Если РезультатВыбора <> Неопределено Тогда 
		
		Если СписокВыбранныхДопПолей.НайтиПоЗначению(РезультатВыбора) = Неопределено Тогда 
			НовВыбранноеЗначение = СписокВыбранныхДопПолей.Добавить();
			НовВыбранноеЗначение.Значение = РезультатВыбора;
			НовВыбранноеЗначение.Представление = ПолучитьЗначениеРеквизита(РезультатВыбора, "Наименование");
		КонецЕсли;
		
		ДобавитьДополнительноеПоле();	
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ИзмерениеДиаграммыПриИзменении(Элемент)

	ЗаполнитьСписокВозможныхЗначенийНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	
	ПостроитьДиаграммуПоНастройкамНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмерениеДиаграммыНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Для Каждого ВыбранноеДопПоле Из СписокВыбранныхДопПолей Цикл 
		Если Элементы.ИзмерениеДиаграммы.СписокВыбора.НайтиПоЗначению(ПроеобразоватьПредставление(ВыбранноеДопПоле.Представление)) = Неопределено Тогда 
			Элементы.ИзмерениеДиаграммы.СписокВыбора.Добавить(ПроеобразоватьПредставление(ВыбранноеДопПоле.Представление), ВыбранноеДопПоле.Представление);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ НастройкиКДПользовательскиеНастройки

&НаКлиенте
Процедура НастройкиКДПользовательскиеНастройкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ПриОкончанииРедактированияНастроекКДНаСервере();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ ЗначенияВыводимыеНаДиаграмму

&НаКлиенте
Процедура ЗначенияВыводимыеНаДиаграммуПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ПостроитьДиаграммуПоНастройкамНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаРезультатовСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если Элементы.ГруппаРезультатовСтраницы.ТекущаяСтраница = Элементы.ГруппаРезультатовСтраницы.ПодчиненныеЭлементы.ГруппаДиаграмма Тогда
		Элементы.ГруппаНастроекСтраницы.ТекущаяСтраница = Элементы.ГруппаНастроекСтраницы.ПодчиненныеЭлементы.ГруппаНастройкиДиаграмма;
	Иначе
		Элементы.ГруппаНастроекСтраницы.ТекущаяСтраница = Элементы.ГруппаНастроекСтраницы.ПодчиненныеЭлементы.ГруппаНастройкиОсновное;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаНастроекСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если Элементы.ГруппаНастроекСтраницы.ТекущаяСтраница = Элементы.ГруппаНастроекСтраницы.ПодчиненныеЭлементы.ГруппаНастройкиДиаграмма Тогда
		Элементы.ГруппаРезультатовСтраницы.ТекущаяСтраница = Элементы.ГруппаРезультатовСтраницы.ПодчиненныеЭлементы.ГруппаДиаграмма;
	ИначеЕсли Элементы.ГруппаНастроекСтраницы.ТекущаяСтраница = Элементы.ГруппаНастроекСтраницы.ПодчиненныеЭлементы.ГруппаНастройкиОсновное Тогда
		Элементы.ГруппаРезультатовСтраницы.ТекущаяСтраница = Элементы.ГруппаРезультатовСтраницы.ПодчиненныеЭлементы.ГруппаТаблица;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
		
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДиаграмму(Команда)

	График = Диаграмма.ПолучитьКартинку( 500, 300, ФорматКартинки.PNG );
	//График.Записать( "C:\TEMP\Диаграмма.png" );
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ПередЗакрытиемСервер();
КонецПроцедуры

&НаСервере
Процедура ПередЗакрытиемСервер(ИмяНастройки ="Последняя использованная настройка с городом")
	//МассивПолей = ВыбранныеПоля.ВыгрузитьЗначения();
	//МассивНастроекДиаграмы = ЗначенияВыводимыеНаДиаграмму.ВыгрузитьЗначения();
	//ПН = НастройкиКД.ПользовательскиеНастройки;
	ст = Новый Структура();
	ст.Вставить("ВыбранныеПоля",ВыбранныеПоля);
	//ст.Вставить("ЗначенияВыводимыеНаДиаграмму",ЗначенияВыводимыеНаДиаграмму);
	
	Ст.Вставить("НастройкиГруппировкиПоСтрокам",НастройкиГруппировкиПоСтрокам);
	Ст.Вставить("Периодичность",Периодичность);
	Ст.Вставить("Период",Период);
	Ст.Вставить("ИзмерениеДиаграммы",ИзмерениеДиаграммы);
	ст.Вставить("НастройкиКДПользовательскиеНастройки",НастройкиКД.ПользовательскиеНастройки);
	ХранилищеПользовательскихНастроекОтчетов.Сохранить("Отчеты.Renault_ТрафикПоПериодам.ПоУмолчанию",ИмяНастройки,ст);
	ТекущаяНастройка = ИмяНастройки;
	
КонецПроцедуры



&НаКлиенте
Процедура ЗначенияВыводимыеНаДиаграммуПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ПостроитьДиаграммуПоНастройкамНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	// Вставить содержимое обработчика.
	//Форма = ПолучитьФорму("ФормаСохраненияВариантовОтчетов");
	//Итог = Форма.ОткрытьМодально();
	
	Форма = ПолучитьФорму("Отчет.Renault_ТрафикПоПериодам.Форма.ФормаСохраненияНастроек");
	Форма.СохраненыеРанееНастройки = ХранилищеПользовательскихНастроекОтчетов.ПолучитьСписок("Отчеты.Renault_ТрафикПоПериодам.ПоУмолчанию");
	Форма.ВыбранноеЗначение = ТекущаяНастройка;
	Если Форма.ОткрытьМодально() = Истина Тогда
		Если СтрДлина(СокрЛП(Форма.ВыбранноеЗначение))>0 Тогда
		//ИмяКлюча = SaveSettingsName;
			ПередЗакрытиемСервер(СокрЛП(Форма.ВыбранноеЗначение));
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройки(Команда)
	// Вставить содержимое обработчика.
	СписокВариантов = ХранилищеПользовательскихНастроекОтчетов.ПолучитьСписок("Отчеты.Renault_ТрафикПоПериодам.ПоУмолчанию");
	Итог = СписокВариантов.ВыбратьЭлемент("Выберите нужные настройки",СписокВариантов.НайтиПоЗначению(ТекущаяНастройка));
	Если Итог = Неопределено Тогда
		
		ЗагрузитьНастройкиИзХранилищаСервер("Последняя использованная настройка с городом");
		
	Иначе
		
		ЗагрузитьНастройкиИзХранилищаСервер(Итог.Значение);
		
	КонецЕсли;
	ПриОкончанииРедактированияНастроекКДНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не Renault_РаботаСПравамиПользователя.ЕстьПравоОткрытияОтчетапродаж(ПараметрыСеанса.Пользователь,"Renault_ТрафикПоПериодам") тогда
		Сообщить("Недостаточно прав доступа.");
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ





