
// Получение таблицы для заполнения данными об операции
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Структура таблицы для заполнения
//
Функция ИнициализацияТаблицыОпераций() Экспорт
	
	ТаблицаОперации = Новый ТаблицаЗначений;
	ТаблицаОперации.Колонки.Добавить("Организация");
	ТаблицаОперации.Колонки.Добавить("ПериодОтчета");
	ТаблицаОперации.Колонки.Добавить("ОтчетностьОперации");
	ТаблицаОперации.Колонки.Добавить("КодОперации");
	ТаблицаОперации.Колонки.Добавить("Документ");
	ТаблицаОперации.Колонки.Добавить("Номенклатура");
	ТаблицаОперации.Колонки.Добавить("РНПТ");
	ТаблицаОперации.Колонки.Добавить("КоличествоПрослеживаемости");
	ТаблицаОперации.Колонки.Добавить("СуммаБезНДС");
	ТаблицаОперации.Колонки.Добавить("ВидДокумента");
	ТаблицаОперации.Колонки.Добавить("НомерДокумента");
	ТаблицаОперации.Колонки.Добавить("ДатаДокумента");
	ТаблицаОперации.Колонки.Добавить("Контрагент");
	
	Возврат ТаблицаОперации;
	
КонецФункции

// Возвращает Истина, если страна - участник ЕАЭС и не Россия.
//
// Параметры:
//  Страна - СправочникСсылка.КлассификаторСтранМира - приверяемая страна.
//
// Возвращаемое значение:
//  Булево - Истина, если страна - участник ЕАЭС и не Россия.
//
Функция СтранаУчастникЕАЭС(Страна) Экспорт
	
	// код России по классификатору - 643.
	Возврат Страна.УчастникЕАЭС И Страна.Код <> "643";
	
КонецФункции