Процедура ур_СформироватьЗаголовокАвторизации(ФайлОтправки, Boundary)
	
	Настройки=Справочники.ур_НастройкиDMS.ОсновнаяНастройка;
	ЛогинДилера=Настройки.ЛогинДилера;
	ПарольДилера=Настройки.ПарольДилера;
	
	ФайлОтправки.ЗаписатьСтроку("--" + Boundary);
	ФайлОтправки.ЗаписатьСтроку("Content-Type: application/x-octet-stream" + Символы.ПС + Символы.ПС);

	ФайлОтправки.ЗаписатьСтроку("--" + Boundary);
	ФайлОтправки.ЗаписатьСтроку("Content-disposition: form-data; name=""LOGIN"""+Символы.ПС);
	ФайлОтправки.ЗаписатьСтроку(СокрЛП(ЛогинДилера));
	ФайлОтправки.ЗаписатьСтроку("--" + Boundary);
	ФайлОтправки.ЗаписатьСтроку("Content-disposition: form-data; name=""PASSWORD"""+Символы.ПС);
	ФайлОтправки.ЗаписатьСтроку(СокрЛП(ПарольДилера));
	ФайлОтправки.ЗаписатьСтроку("--" + Boundary);
	
КонецПроцедуры

Функция ур_ОтправкаДанныхИОбработкаРезультата(ИмяФайлаОтправки, Boundary, Кодировка)
	ИмяФайлаОтвета = КаталогВременныхФайлов() + "answer.xml";
	
	ЗаголовокHTTP = Новый Соответствие();
	//При необходимости зададим Referer, например таким образом
	//СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	//СерверИсточник = НСтр(СтрокаСоединения, "Srvr") + НСтр(СтрокаСоединения, "Ref");
	//ЗаголовокHTTP.Вставить("Referer", СерверИсточник);
	
	//Укажем формат данных Content-Type
	ЗаголовокHTTP.Вставить("Content-Type", "multipart/form-data; boundary=" + Boundary);
	
	////Укажем длину POST-запроса Content-Length
	//ФайлОтправки = Новый Файл(ИмяФайлаОтправки);
	//РазмерФайлаОтправки = XMLСтрока(ФайлОтправки.Размер());
	//ЗаголовокHTTP.Вставить("Content-Length", РазмерФайлаОтправки);
	
	//Укажем длину POST-запроса Content-Length
	ФайлОтправки = Новый Файл(ИмяФайлаОтправки);
	РазмерФайлаОтправки = XMLСтрока(ФайлОтправки.Размер());
	ЗаголовокHTTP.Вставить("Content-Length", РазмерФайлаОтправки);
	
	//Инициализируем HTTPСоединение. При необходимости задаём параметры прокси.
	
	Настройки=Справочники.ур_НастройкиDMS.ОсновнаяНастройка;
	Сервер=Настройки.АдресСервера;
	Порт=Настройки.Порт;

	АдресСкрипта =Настройки.АдресСкрипта;
	
	Текст = Новый ЧтениеТекста(ИмяФайлаОтправки, КодировкаТекста.UTF8);
	Стр = Текст.ПрочитатьСтроку();
	Пока Стр <> Неопределено Цикл // строки читаются до символа перевода строки
		//Сообщить(Стр);
		Стр = Текст.ПрочитатьСтроку();
	КонецЦикла;
	Текст.Закрыть();

	//ИспользоватьПрокси - какая-то логическая переменная, может быть значение флажка на форме или переключатель
	//Если ИспользоватьПрокси Тогда
	//	Прокси = Новый ИнтернетПрокси;
	//	Прокси.НеИспользоватьПроксиДляЛокальныхАдресов = Истина;
	//	Прокси.Пароль = "ПарольПрокси"; // укажите своё значение
	//	Прокси.Пользователь = "ПользовательПрокси"; // укажите своё значение
	//	НТТР = Новый HTTPСоединение(Сервер, Порт, , , Прокси);
	//Иначе
	//НТТР = Новый HTTPСоединение(Сервер, Порт,,,Истина);
	НТТР = Новый HTTPСоединение(Сервер,Порт,,,,Истина);
	//   КонецЕсли;                                   
	
	//Собственно, отправка данных серверу.
	//  АдресСкрипта = "some_script.php"; //Естественно, следует указать имя своего скрипта.
	Попытка
		НТТР.ОтправитьДляОбработки(ИмяФайлаОтправки, АдресСкрипта, ИмяФайлаОтвета, ЗаголовокHTTP);
	Исключение
		//Пример обработки ошибки соединения.
		ОтветСервера="";
		ФайлОтвета = Новый Файл(ИмяФайлаОтвета);
		Если ФайлОтвета.Существует() Тогда
			//КопироватьФайл(ИмяФайлаОтвета,"c:\response.txt");
			ТекстОтвета = Новый ТекстовыйДокумент();
			ТекстОтвета.Прочитать(ИмяФайлаОтвета,Кодировка);
			Если ТекстОтвета.КоличествоСтрок() > 0 Тогда
				ОтветСервера = ТекстОтвета.ПолучитьТекст();
				//Сообщить(ОтветСервера);
			КонецЕсли;
		КонецЕсли;
		//#Если Клиент Тогда
		//	Если Найти(ОтветСервера, "The requested item does not exist")>0 Тогда
		//		// не найден артикул на сайте
		//		Сообщить("Запрашиваемый элемент не существует");
		//	КонецЕсли;
		//	//Сообщить("Неудачная попытка соединения: " + ОписаниеОшибки()+ОтветСервера);
		//#Иначе
			ЗаписьЖурналаРегистрации("HTTPСоединение", УровеньЖурналаРегистрации.Ошибка, , , "Неудачная попытка соединения: " + ОписаниеОшибки()+ОтветСервера);
		//#КонецЕсли
		Возврат "ошибка обмена";
	КонецПопытки;
	
	//   Удалим файл отправки POST-запроса. Больше он нам не нужен.
	УдалитьФайлы(ИмяФайлаОтправки);
	
	//Отправили данные, анализируем ответ сервера.
	ФайлОтвета = Новый Файл(ИмяФайлаОтвета);
	Если ФайлОтвета.Существует() Тогда
		//КопироватьФайл(ИмяФайлаОтвета,"c:\response.txt");
		ТекстОтвета = Новый ТекстовыйДокумент();
		ТекстОтвета.Прочитать(ИмяФайлаОтвета,Кодировка);
		Если ТекстОтвета.КоличествоСтрок() > 0 Тогда
			ОтветСервера = ТекстОтвета.ПолучитьТекст();
			//	#Если Клиент Тогда
			//		Сообщить(ОтветСервера);
			Возврат ОтветСервера;
			//	#КонецЕсли
		Иначе
			Возврат "нет изменений";
			//#Если Клиент Тогда
			//	Сообщить("Отправка файла на сервер: Получен пустой ответ сервера.");
			//#Иначе
			//	ЗаписьЖурналаРегистрации("HTTPСоединение", УровеньЖурналаРегистрации.Ошибка, , , "Получен пустой ответ сервера.");
			//#КонецЕсли
			УдалитьФайлы(ИмяФайлаОтвета);
			Возврат "ошибка обмена";
		КонецЕсли;
		
		УдалитьФайлы(ИмяФайлаОтвета);
	Иначе
		//#Если Клиент Тогда
		//	Сообщить("Отправка файла на сервер: Ответ сервера не получен.");
		//#Иначе
			ЗаписьЖурналаРегистрации("HTTPСоединение", УровеньЖурналаРегистрации.Ошибка, , , "Ответ сервера не получен.");
		//#КонецЕсли
		Возврат "ошибка обмена";
	КонецЕсли;
	
	
КонецФункции

Функция ур_ПолучитьАктуальныеКаталожныеНомера(ДатаОбмена)
	
	//Подготовка переменных
	Boundary = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
	
		//	Создаём файл отправки или содержимое POST-запроса.
	ИмяФайлаОтправки = КаталогВременныхФайлов() + "post.txt";
	ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки, КодировкаТекста.UTF8, Символы.ПС, ЛОЖЬ);
	
	ур_СформироватьЗаголовокАвторизации(ФайлОтправки,Boundary);
		ФайлОтправки.ЗаписатьСтроку("Content-disposition: form-data; name=""QUERY"""+Символы.ПС);
	ФайлОтправки.ЗаписатьСтроку("item-and-replacement");
	ФайлОтправки.ЗаписатьСтроку("--" + Boundary);
	ФайлОтправки.ЗаписатьСтроку("Content-disposition: form-data; name=""DATE"""+Символы.ПС);
	
	ФайлОтправки.ЗаписатьСтроку(ДатаОбмена);
	ФайлОтправки.ЗаписатьСтроку("--" + Boundary);
	
	ФайлОтправки.Закрыть();
  	Результат=ур_ОтправкаДанныхИОбработкаРезультата(ИмяФайлаОтправки, Boundary,);
	Возврат Результат;
КонецФункции

Функция ур_ПолучитьИнформациюОДетали(КаталожныйНомер)
	Boundary = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
	
	ИмяФайлаОтправки = КаталогВременныхФайлов() + "post.txt";
	ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки, КодировкаТекста.UTF8, Символы.ПС, ЛОЖЬ);
	
	ур_СформироватьЗаголовокАвторизации(ФайлОтправки,Boundary);
	ФайлОтправки.ЗаписатьСтроку("Content-disposition: form-data; name=""QUERY"""+Символы.ПС);
	ФайлОтправки.ЗаписатьСтроку("item-info");
	ФайлОтправки.ЗаписатьСтроку("--" + Boundary);
	ФайлОтправки.ЗаписатьСтроку("Content-disposition: form-data; name=""ITEM"""+Символы.ПС);
	ФайлОтправки.ЗаписатьСтроку(КаталожныйНомер);
	ФайлОтправки.ЗаписатьСтроку("--" + Boundary);
	ФайлОтправки.Закрыть();
	Результат=ур_ОтправкаДанныхИОбработкаРезультата(ИмяФайлаОтправки, Boundary,КодировкаТекста.UTF8);
	Возврат Результат;
	
КонецФункции

Функция ур_ПолучитьИнформациюОДеталиРасширенная(КаталожныйНомер)
	Boundary = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
	
	ИмяФайлаОтправки = КаталогВременныхФайлов() + "post.txt";
	ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки, КодировкаТекста.UTF8, Символы.ПС, ЛОЖЬ);
	
	ур_СформироватьЗаголовокАвторизации(ФайлОтправки,Boundary);
	ФайлОтправки.ЗаписатьСтроку("Content-disposition: form-data; name=""QUERY"""+Символы.ПС);
	ФайлОтправки.ЗаписатьСтроку("get-item-info");
	ФайлОтправки.ЗаписатьСтроку("--" + Boundary);
	ФайлОтправки.ЗаписатьСтроку("Content-disposition: form-data; name=""ITEM"""+Символы.ПС);
	ФайлОтправки.ЗаписатьСтроку(КаталожныйНомер);
	ФайлОтправки.ЗаписатьСтроку("--" + Boundary);
	ФайлОтправки.Закрыть();
	Результат=ур_ОтправкаДанныхИОбработкаРезультата(ИмяФайлаОтправки, Boundary,КодировкаТекста.UTF8);
	Возврат Результат;
	
КонецФункции

Функция ур_ВыслатьСтатистическиеДанные(ЗначенияОбмена)
	
		//
	////таблица location
	//ТЗСклады = Новый ТаблицаЗначений;
	//ТЗСклады.Колонки.Добавить("ИдентификаторСкладаДилера", Новый ОписаниеТипов("Строка"));
	//ТЗСклады.Колонки.Добавить("НазваниеСкладаДилера", Новый ОписаниеТипов("Строка"));
	//ТЗСклады.Колонки.Добавить("Город", Новый ОписаниеТипов("Строка"));
	//ТЗСклады.Колонки.Добавить("Адрес", Новый ОписаниеТипов("Строка"));
	//ТЗСклады.Колонки.Добавить("Телефон", Новый ОписаниеТипов("Строка"));
	//
	///таблица user-price
	//ТЗЦены = Новый ТаблицаЗначений;
	//ТЗЦены.Колонки.Добавить("ИдентификаторСкладаДилера", Новый ОписаниеТипов("Строка"));
	//ТЗЦены.Колонки.Добавить("АртикулЗЧ", Новый ОписаниеТипов("Строка"));
	//ТЗЦены.Колонки.Добавить("СтоимостьДляКонечногоПокупателяВРублях", Новый ОписаниеТипов("Число"));
	//ТЗЦены.Колонки.Добавить("ДатаНачалаДействияЦены", Новый ОписаниеТипов("Строка"));
	//
		//
	////таблица vendor
	//ТЗПоставщики = Новый ТаблицаЗначений;
	//ТЗПоставщики.Колонки.Добавить("ПоставщикКод", Новый ОписаниеТипов("Строка"));
	//ТЗПоставщики.Колонки.Добавить("ПоставщикИмя", Новый ОписаниеТипов("Строка"));
	//
	////таблица remained-item
	//ТЗОстатки = Новый ТаблицаЗначений;
	//ТЗОстатки.Колонки.Добавить("ИдентификаторСкладаДилера", Новый ОписаниеТипов("Строка"));
	//ТЗОстатки.Колонки.Добавить("ПоставщикКод", Новый ОписаниеТипов("Строка"));
	//ТЗОстатки.Колонки.Добавить("АртикулЗЧ", Новый ОписаниеТипов("Строка"));
	//ТЗОстатки.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	//ТЗОстатки.Колонки.Добавить("ДатаПоступления", Новый ОписаниеТипов("Строка"));
	//
		////таблица item-ledger
	//ТЗДвижения = Новый ТаблицаЗначений;
	//ТЗДвижения.Колонки.Добавить("ТипОперации", Новый ОписаниеТипов("Строка"));
	//ТЗДвижения.Колонки.Добавить("ИдентификаторСкладаДилера", Новый ОписаниеТипов("Строка"));
	//ТЗДвижения.Колонки.Добавить("Дата", Новый ОписаниеТипов("Строка"));
	//ТЗДвижения.Колонки.Добавить("АртикулЗЧ", Новый ОписаниеТипов("Строка"));
	//ТЗДвижения.Колонки.Добавить("СтоимостьЕдВРублях", Новый ОписаниеТипов("Число"));
	//ТЗДвижения.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	//ТЗДвижения.Колонки.Добавить("СтоимостьИтого", Новый ОписаниеТипов("Число"));
	//ТЗДвижения.Колонки.Добавить("ЗаказНарядНомер", Новый ОписаниеТипов("Строка"));
	//
	
	
	Boundary = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
	
	МассивФайловДляОбъединения = Новый Массив;    
	
	
	//Формируем конечный фрагмент файла POST-запроса 
	ИмяФайлаОтправкиКонец = ПолучитьИмяВременногоФайла("txt"); 
	ФайлОтправкиКонец = Новый ЗаписьТекста(ИмяФайлаОтправкиКонец, КодировкаТекста.UTF8, Символы.ПС, Ложь); 
	
	//   ФайлОтправкиКонец.ЗаписатьСтроку("--" + Boundary); 
	ур_СформироватьЗаголовокАвторизации(ФайлОтправкиКонец,Boundary);
	ФайлОтправкиКонец.ЗаписатьСтроку("Content-disposition: form-data; name=""QUERY"""+Символы.ПС);
	ФайлОтправкиКонец.ЗаписатьСтроку("send-item-ledger");
	ФайлОтправкиКонец.ЗаписатьСтроку("--" + Boundary);
	
	//location
	ФайлОтправкиКонец.ЗаписатьСтроку("Content-Disposition: form-data; name=""location""; filename=""" + "location.csv" + """"); 
	ФайлОтправкиКонец.ЗаписатьСтроку("Content-Type: application/vnd.ms-excel" + Символы.ПС); 
	
	Данные="";
	ТЗЛокейшн=ЗначенияОбмена.Получить(0);
	Для Каждого ТекСтрока ИЗ ТЗЛокейшн Цикл
		Данные=СокрЛП(ТекСтрока.ИдентификаторСкладаДилера)+";"+СокрЛП(ТекСтрока.НазваниеСкладаДилера)+";"+СокрЛП(ТекСтрока.Город)+";"+СокрЛП(ТекСтрока.Адрес)+";"+СокрЛП(ТекСтрока.Телефон)+";"+СокрЛП(ТекСтрока.Исключение);
		ФайлОтправкиКонец.ЗаписатьСтроку(Данные);
	КонецЦикла;
	
	Если Данные="" Тогда
		ФайлОтправкиКонец.ЗаписатьСтроку(Символы.ПС);
	КонецЕсли;
	
    ФайлОтправкиКонец.ЗаписатьСтроку("--" + Boundary);
	
	//user-price
	ФайлОтправкиКонец.ЗаписатьСтроку("Content-Disposition: form-data; name=""user-price""; filename=""" + "user-price.csv" + """"); 
	ФайлОтправкиКонец.ЗаписатьСтроку("Content-Type: application/vnd.ms-excel" + Символы.ПС); 
	
	Данные="";

	ТЗЦен=ЗначенияОбмена.Получить(1);
	Для Каждого ТекСтрока ИЗ ТЗЦен Цикл
		Данные=СокрЛП(ТекСтрока.ИдентификаторСкладаДилера)+";"+СокрЛП(ТекСтрока.АртикулЗЧ)+";"+СокрЛП(ТекСтрока.СтоимостьДляКонечногоПокупателяВРублях)+";"+СокрЛП(ТекСтрока.ДатаНачалаДействияЦены);
		ФайлОтправкиКонец.ЗаписатьСтроку(Данные);
	КонецЦикла;
	Если Данные="" Тогда
		ФайлОтправкиКонец.ЗаписатьСтроку(Символы.ПС);
	КонецЕсли;
	ФайлОтправкиКонец.ЗаписатьСтроку("--" + Boundary);
	
	////таблица vendor
	ФайлОтправкиКонец.ЗаписатьСтроку("Content-Disposition: form-data; name=""vendor""; filename=""" + "vendor.csv" + """"); 
	ФайлОтправкиКонец.ЗаписатьСтроку("Content-Type: application/vnd.ms-excel" + Символы.ПС); 
	Данные="";

	ТЗПоставщиков=ЗначенияОбмена.Получить(2);
	Для Каждого ТекСтрока ИЗ ТЗПоставщиков Цикл
		Данные=СокрЛП(ТекСтрока.ПоставщикКод)+";"+СокрЛП(ТекСтрока.ПоставщикИмя);
		ФайлОтправкиКонец.ЗаписатьСтроку(Данные);
	КонецЦикла;
	Если Данные="" Тогда
		ФайлОтправкиКонец.ЗаписатьСтроку(Символы.ПС);
	КонецЕсли;
	ФайлОтправкиКонец.ЗаписатьСтроку("--" + Boundary);
	
	//таблица remained-item
	ФайлОтправкиКонец.ЗаписатьСтроку("Content-Disposition: form-data; name=""remained-item""; filename=""" + "remained-item.csv" + """"); 
	ФайлОтправкиКонец.ЗаписатьСтроку("Content-Type: application/vnd.ms-excel" + Символы.ПС); 
	Данные="";
	
	ТЗПоступлений=ЗначенияОбмена.Получить(3);
	Для Каждого ТекСтрока ИЗ ТЗПоступлений Цикл
		Данные=СокрЛП(ТекСтрока.ИдентификаторСкладаДилера)+";"+СокрЛП(ТекСтрока.ПоставщикКод)+";"+СокрЛП(ТекСтрока.АртикулЗЧ)+";"+СокрЛП(ТекСтрока.Количество)+";"+СокрЛП(ТекСтрока.ДатаПоступления);
		ФайлОтправкиКонец.ЗаписатьСтроку(Данные);
	КонецЦикла;
	Если Данные="" Тогда
		ФайлОтправкиКонец.ЗаписатьСтроку(Символы.ПС);
	КонецЕсли;
	ФайлОтправкиКонец.ЗаписатьСтроку("--" + Boundary);
	
	//таблица item-ledger
	ФайлОтправкиКонец.ЗаписатьСтроку("Content-Disposition: form-data; name=""item-ledger""; filename=""" + "item-ledger" + """"); 
	ФайлОтправкиКонец.ЗаписатьСтроку("Content-Type: application/vnd.ms-excel" + Символы.ПС); 
	Данные="";

	ТЗОпераций=ЗначенияОбмена.Получить(4);
	Для Каждого ТекСтрока ИЗ ТЗОпераций Цикл
		Данные=СокрЛП(ТекСтрока.ТипОперации)+";"+СокрЛП(ТекСтрока.ИдентификаторСкладаДилера)+";"+СокрЛП(ТекСтрока.Дата)+";"+СокрЛП(ТекСтрока.АртикулЗЧ)+";"
		+СокрЛП(ТекСтрока.СтоимостьЕдВРублях)+";"+СокрЛП(ТекСтрока.Количество)+";"+СокрЛП(ТекСтрока.СтоимостьИтого)+";"+СокрЛП(ТекСтрока.ПоставщикКод)+";"+СокрЛП(ТекСтрока.ЗаказНарядНомер);
		ФайлОтправкиКонец.ЗаписатьСтроку(Данные);
	КонецЦикла;
	ФайлОтправкиКонец.ЗаписатьСтроку(Символы.ПС);

	Если Данные="" Тогда
		ФайлОтправкиКонец.ЗаписатьСтроку(Символы.ПС);
	КонецЕсли;
	ФайлОтправкиКонец.ЗаписатьСтроку("--" + Boundary);
	
	//++ПП
	//таблица lost-sales
	ФайлОтправкиКонец.ЗаписатьСтроку("Content-Disposition: form-data; name=""lost-sales""; filename=""" + "lost-sales" + """"); 
	ФайлОтправкиКонец.ЗаписатьСтроку("Content-Type: application/vnd.ms-excel" + Символы.ПС); 
	Данные="";

	ТЗОпераций=ЗначенияОбмена.Получить(5);
	Для Каждого ТекСтрока ИЗ ТЗОпераций Цикл
		Данные=СокрЛП(ТекСтрока.Артикул)+";"+СокрЛП(ТекСтрока.Дата)+";"+СокрЛП(ТекСтрока.Количество);
		ФайлОтправкиКонец.ЗаписатьСтроку(Данные);
	КонецЦикла;
	
	Если Данные="" Тогда
		ФайлОтправкиКонец.ЗаписатьСтроку(Символы.ПС);
	КонецЕсли;
	ФайлОтправкиКонец.ЗаписатьСтроку("--" + Boundary);

	
	ФайлОтправкиКонец.Закрыть(); 
	
	ИмяФайлаОтправки=ИмяФайлаОтправкиКонец;
	Результат=ур_ОтправкаДанныхИОбработкаРезультата(ИмяФайлаОтправки, Boundary,);
	Возврат Результат;
КонецФункции

Функция ур_ПроверкаНаличияФайлаСертификата()
	//нет файла, пишем новый
	Настройки=Справочники.ур_НастройкиDMS.ОсновнаяНастройка;
	Если НЕ ЗначениеЗаполнено(Настройки.ПутьКФайлуСертификата) Тогда
		//Пример обработки ошибки соединения.
		//#Если Клиент Тогда
		//	Сообщить("Не указан путь к файлу корневого сертификата, обмен данными с Соллерс невозможен!");
		//#Иначе
			ЗаписьЖурналаРегистрации("HTTPСоединение", УровеньЖурналаРегистрации.Ошибка, , , "Не указан путь к файлу корневого сертификата, обмен данными с Соллерс невозможен!");
		//#КонецЕсли
		Возврат Ложь;
	Иначе   //настройка есть, проверим на наличие файла
		СертификатУзла = Новый Файл(Настройки.ПутьКФайлуСертификата);
		Если НЕ СертификатУзла.Существует() Тогда
			//#Если Клиент Тогда
			//	Сообщить("По указанному пути отсутствует файл корневого сертификата, обмен данными с Соллерс невозможен!");
			//#Иначе
				ЗаписьЖурналаРегистрации("HTTPСоединение", УровеньЖурналаРегистрации.Ошибка, , , "По указанному пути отсутствует файл корневого сертификата, обмен данными с Соллерс невозможен!");
			//#КонецЕсли
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ур_ИнициализацияСертификата()
	//КаталогБин=КаталогПрограммы();
	//Настройки=Справочники.ур_НастройкиDMS.ОсновнаяНастройка;
	//ФайлСертификатов1С = Новый Файл(КаталогБин+"cacert.pem");
	//Если ФайлСертификатов1С.Существует() Тогда
	//	//файл с сертифкатами есть, проверим на наличие нашего сертификата
	//	Результат=ур_ПроверкаНаличияФайлаСертификата();
	//	//Результат=Истина;

	//	Если Результат=Истина Тогда
	//		////найдем MD5 отпечаток сертификата в нашем файле и сравним с файлом сертификата
	//		Отпечаток="";
	//		Текст = Новый ЧтениеТекста(Настройки.ПутьКФайлуСертификата, КодировкаТекста.ANSI);
	//		Стр = Текст.ПрочитатьСтроку();
	//		Пока Стр <> Неопределено Цикл // строки читаются до символа перевода строки
	//			Если СтрЧислоВхождений(Стр,"MD5 Fingerprint")>0 Тогда
	//				Отпечаток=Стр;
	//				Текст.Закрыть();
	//				Прервать;
	//			КонецЕсли;
	//			Стр = Текст.ПрочитатьСтроку();
	//		КонецЦикла;
	//		
	//		Текст.Закрыть();
	//		
	//		Если Отпечаток="" Тогда //битый файл сертификата
	//			//#Если Клиент Тогда
	//			//	Сообщить("В файле сертификата отсутствует отпечаток");
	//			//#Иначе
	//				ЗаписьЖурналаРегистрации("HTTPСоединение", УровеньЖурналаРегистрации.Ошибка, , , "В файле сертификата отсутствует отпечаток");
	//			//#КонецЕсли
	//			Возврат Ложь;
	//		КонецЕсли;
	//		
	//		НайденОтпечатокВФайле=ложь;
	//		Текст = Новый ЧтениеТекста(КаталогБин+"cacert.pem", КодировкаТекста.ANSI);
	//		Стр = Текст.ПрочитатьСтроку();
	//		Пока Стр <> Неопределено Цикл // строки читаются до символа перевода строки
	//			Если СтрЧислоВхождений(Стр,"MD5 Fingerprint")>0 Тогда
	//				Если СтрЧислоВхождений(Стр,Отпечаток)>0 Тогда
	//					//нашли запись, все ОК
	//					Текст.Закрыть();
	//					Возврат Истина;
	//				КонецЕсли;
	//			КонецЕсли;
	//			Стр = Текст.ПрочитатьСтроку();
	//		КонецЦикла;
	//		Текст.Закрыть();
	//		
	//		Если НайденОтпечатокВФайле=Ложь Тогда
	//			//в файле сертификатов 1С нет нашего корневого сертификата, дописываем
	//			МассивИмен = Новый Массив;
	//			МассивИмен.Добавить(КаталогБин+"cacert.pem");
	//			МассивИмен.Добавить(Настройки.ПутьКФайлуСертификата);
	//			Попытка
	//				Текст.Закрыть();
	//				ОбъединитьФайлы(МассивИмен,КаталогБин+"cacert_tmp.pem");
	//				КопироватьФайл(КаталогБин+"cacert_tmp.pem",КаталогБин+"cacert.pem");
	//				УдалитьФайлы(КаталогБин+"cacert_tmp.pem");
	//			Исключение
	//				//#Если Клиент Тогда
	//				//	Сообщить("Неудачная попытка записи файла сертификата: " + ОписаниеОшибки());
	//				//#Иначе
	//					ЗаписьЖурналаРегистрации("HTTPСоединение", УровеньЖурналаРегистрации.Ошибка, , , "Неудачная попытка записи файла сертификата: " + ОписаниеОшибки());
	//				//#КонецЕсли
	//				Возврат Ложь; //не смогли дописать файл
	//			КонецПопытки;
	//			
	//			Возврат Истина;  //дописали файл сертификатов, все ОК
	//			
	//		КонецЕсли;
	//		
	//	Иначе 
	//		Возврат Ложь;       //проблемы с файлами сертификатов
	//	КонецЕсли;
	//Иначе
	//	Результат=ур_ПроверкаНаличияФайлаСертификата();
	//	Если Результат=Истина Тогда
	//		ИмяФайлСертификатов=КаталогБин+"cacert.pem";
	//		ФайлСертификатов = Новый ЗаписьТекста(ИмяФайлСертификатов, КодировкаТекста.ANSI, Символы.ПС, Ложь);
	//		Попытка
	//			ФайлСертификатов.Записать();
	//			КопироватьФайл(ИмяФайлСертификатов,Настройки.ПутьКФайлуСертификата);
	//		Исключение
	//			//#Если Клиент Тогда
	//			//	Сообщить("Неудачная попытка создания файла сертификата: " + ОписаниеОшибки());
	//			//#Иначе
	//				ЗаписьЖурналаРегистрации("HTTPСоединение", УровеньЖурналаРегистрации.Ошибка, , , "Неудачная попытка создания файла сертификата: " + ОписаниеОшибки());
	//			//#КонецЕсли
	//			Возврат Ложь;
	//		КонецПопытки;
	//		
	//	КонецЕсли;
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ур_ОтправкаПолучениеДанных(ПараметрОбмена, ЗначенияОбмена) Экспорт
	
	//для начала убедимся, что сертификат корневого узла установлен
	Результат=ур_ИнициализацияСертификата();
	Если Результат=Истина Тогда
		
		Если ПараметрОбмена="item-and-replacement" Тогда
			Возврат ур_ПолучитьАктуальныеКаталожныеНомера(ЗначенияОбмена);
		ИначеЕсли ПараметрОбмена="send-item-ledger" Тогда
			Возврат ур_ВыслатьСтатистическиеДанные(ЗначенияОбмена);
		ИначеЕсли ПараметрОбмена="item-info" Тогда
			Возврат ур_ПолучитьИнформациюОДетали(ЗначенияОбмена);
		ИначеЕсли ПараметрОбмена="send-order" Тогда
			Возврат ур_ПолучитьИнформациюОЗаказах(ЗначенияОбмена);
		ИначеЕсли ПараметрОбмена="get-order-status" Тогда
			Возврат ур_ПолучитьИнформациюОСтатусахЗаказов(ЗначенияОбмена);
		ИначеЕсли ПараметрОбмена="get-ship-to-address" Тогда
			Возврат ур_ПолучитьИнформациюОбАдресах(ЗначенияОбмена);
		ИначеЕсли ПараметрОбмена="get-credit-limit" Тогда
			Возврат ур_ПолучитьИнформациюОКредитномЛемите(ЗначенияОбмена);
		ИначеЕсли ПараметрОбмена="get-item-info" Тогда
			Возврат ур_ПолучитьИнформациюОДеталиРасширенная(ЗначенияОбмена);
		КонецЕсли;
	КонецЕсли;
КонецФункции

// { VIV 31.07.2013
//
Функция ур_ПолучитьИнформациюОЗаказах(ЗначенияОбмена)
	
	//ЗначенияОбмена - это структура
	
	//Подготовка переменных
	Boundary = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
	
	//	Создаём файл отправки или содержимое POST-запроса.
	ИмяФайлаОтправки = КаталогВременныхФайлов() + "post.txt";
	ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки, КодировкаТекста.UTF8, Символы.ПС, ЛОЖЬ);
	
	ур_СформироватьЗаголовокАвторизации(ФайлОтправки,Boundary);
	ФайлОтправки.ЗаписатьСтроку("Content-disposition: form-data; name=""QUERY"""+Символы.ПС);
	ФайлОтправки.ЗаписатьСтроку("send-order");
	ФайлОтправки.ЗаписатьСтроку("--" + Boundary);
	
	//-- пишем файл с заказом
	ФайлОтправки.ЗаписатьСтроку("Content-Disposition: form-data; name=""orders""; filename=""" + "orders.csv" + """"); 
	ФайлОтправки.ЗаписатьСтроку("Content-Type: application/vnd.ms-excel" + Символы.ПС); 
	ФайлОтправки.ЗаписатьСтроку("Код Поставки;"+ЗначенияОбмена.АдресПоставки); 
	ФайлОтправки.ЗаписатьСтроку("Тип заявки;"+?(ЗначенияОбмена.ТипЗаявки="Срочная","U", "S")); 
	ФайлОтправки.ЗаписатьСтроку("Номер заявки;"+ЗначенияОбмена.Заказ.Номер); 
	ФайлОтправки.ЗаписатьСтроку("Доставка;"+?(ЗначенияОбмена.ТребуетсяДоставка=1,"Y", "N"));  
	ФайлОтправки.ЗаписатьСтроку("Заказ (Fill/Kill);"+?(ЗначенияОбмена.ЗаказТолькоИзНаличия=1,"Y", "N")); 
	ФайлОтправки.ЗаписатьСтроку("Номер;Количество"); 


	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Номенклатура.Артикул КАК Артикул,
	|	СУММА(ЗаказПоставщикуТовары.Количество) КАК Количество
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ "+?(ЗначенияОбмена=Неопределено, "
	|	ЗаказПоставщикуТовары.Ссылка.Проведен = ИСТИНА
	|	И ЗаказПоставщикуТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон", " ЗаказПоставщикуТовары.Ссылка = &Ссылка ")+"
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПоставщикуТовары.Номенклатура.Артикул";
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Ссылка", ЗначенияОбмена.Заказ);
	
	Результат=Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Данные=СокрЛП(Выборка.Артикул)+";"+СокрЛП(Выборка.Количество)+";";
		ФайлОтправки.ЗаписатьСтроку(Данные);
		
	КонецЦикла;
	ФайлОтправки.ЗаписатьСтроку("--" + Boundary);
	ФайлОтправки.Закрыть();
	Результат=ур_ОтправкаДанныхИОбработкаРезультата(ИмяФайлаОтправки, Boundary,КодировкаТекста.UTF8);
	Возврат Результат;
	
КонецФункции
  
// { VIV 31.07.2013
//
Функция ур_ПолучитьИнформациюОСтатусахЗаказов(ЗначенияОбмена)
	
	//Подготовка переменных
	Boundary = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
	
	//	Создаём файл отправки или содержимое POST-запроса.
	ИмяФайлаОтправки = КаталогВременныхФайлов() + "post.txt";
	ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки, КодировкаТекста.UTF8, Символы.ПС, ЛОЖЬ);
	
	ур_СформироватьЗаголовокАвторизации(ФайлОтправки,Boundary);
	ФайлОтправки.ЗаписатьСтроку("Content-disposition: form-data; name=""QUERY"""+Символы.ПС);
	ФайлОтправки.ЗаписатьСтроку("get-order-status");
	ФайлОтправки.ЗаписатьСтроку("--" + Boundary);
	ФайлОтправки.ЗаписатьСтроку("Content-disposition: form-data; name=""DEALER-QUOTE"""+Символы.ПС);
	ФайлОтправки.ЗаписатьСтроку(ЗначенияОбмена.DEALER);
	ФайлОтправки.ЗаписатьСтроку("--" + Boundary);
	Если ЗначениеЗаполнено(ЗначенияОбмена.DISTRIBUTOR) Тогда
		ФайлОтправки.ЗаписатьСтроку("Content-disposition: form-data; name=""DISTRIBUTOR-QUOTE"""+Символы.ПС);
		ФайлОтправки.ЗаписатьСтроку(ЗначенияОбмена.DISTRIBUTOR);
		ФайлОтправки.ЗаписатьСтроку("--" + Boundary);
	КонецЕсли;
	ФайлОтправки.Закрыть();
	Результат=ур_ОтправкаДанныхИОбработкаРезультата(ИмяФайлаОтправки, Boundary,КодировкаТекста.UTF8);
	Возврат Результат;
	
КонецФункции

// { VIV 18.08.2013
//
Функция ур_ПолучитьИнформациюОбАдресах(ЗначенияОбмена)
	
	//Подготовка переменных
	Boundary = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
	
	//	Создаём файл отправки или содержимое POST-запроса.
	ИмяФайлаОтправки = КаталогВременныхФайлов() + "post.txt";
	ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки, КодировкаТекста.UTF8, Символы.ПС, ЛОЖЬ);
	
	ур_СформироватьЗаголовокАвторизации(ФайлОтправки,Boundary);
	ФайлОтправки.ЗаписатьСтроку("Content-disposition: form-data; name=""QUERY"""+Символы.ПС);
	ФайлОтправки.ЗаписатьСтроку("get-ship-to-address");
	ФайлОтправки.ЗаписатьСтроку("--" + Boundary);
	ФайлОтправки.ЗаписатьСтроку("Content-disposition: form-data; name=""DEALER-QUOTE"""+Символы.ПС);
	ФайлОтправки.ЗаписатьСтроку(ЗначенияОбмена);
	ФайлОтправки.ЗаписатьСтроку("--" + Boundary);
	ФайлОтправки.Закрыть();
	Результат=ур_ОтправкаДанныхИОбработкаРезультата(ИмяФайлаОтправки, Boundary,КодировкаТекста.UTF8);
	Возврат Результат;
	
КонецФункции

// { VIV 18.08.2013
//
Функция ур_ПолучитьИнформациюОКредитномЛемите(ЗначенияОбмена)
	
	//Подготовка переменных
	Boundary = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
	
	//	Создаём файл отправки или содержимое POST-запроса.
	ИмяФайлаОтправки = КаталогВременныхФайлов() + "post.txt";
	ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки, КодировкаТекста.UTF8, Символы.ПС, ЛОЖЬ);
	
	ур_СформироватьЗаголовокАвторизации(ФайлОтправки,Boundary);
	ФайлОтправки.ЗаписатьСтроку("Content-disposition: form-data; name=""QUERY"""+Символы.ПС);
	ФайлОтправки.ЗаписатьСтроку("get-credit-limit");
	ФайлОтправки.ЗаписатьСтроку("--" + Boundary);
	ФайлОтправки.ЗаписатьСтроку("Content-disposition: form-data; name=""DEALER-QUOTE"""+Символы.ПС);
	ФайлОтправки.ЗаписатьСтроку(ЗначенияОбмена);
	ФайлОтправки.ЗаписатьСтроку("--" + Boundary);
	ФайлОтправки.Закрыть();
	Результат=ур_ОтправкаДанныхИОбработкаРезультата(ИмяФайлаОтправки, Boundary,КодировкаТекста.UTF8);
	Возврат Результат;
	
КонецФункции




