
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Код = Объект.Код;
		
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Код = Код;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ТекущийОбъект.Ссылка = ПланыОбмена.DMS_ВыгрузкаEDR.ЭтотУзел() Тогда
	
		Элементы.ГруппаНомераСообщений.ТолькоПросмотр 	 = Истина;
		Элементы.СтраницаОрганизации.Видимость 			 = Ложь;
		Элементы.СтраницаСостоянияЗаказНарядов.Видимость = Ложь;
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КодПриИзменении(Элемент)
	Объект.Код = Код;
	Модифицированность = Истина;
КонецПроцедуры
