
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВыборДаты = Параметры.ВыборДаты;
	Интервал = Параметры.Интервал;
	Начало = Параметры.Начало;
	Конец = Параметры.Конец;
	Дата = Параметры.Дата;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	//ОповеститьОВыборе(Дата + 60*60*Часы + Минуты*60);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Группа2.Видимость = ВыборДаты;
	
	Если НЕ ВыборДаты Тогда
		
		Высота = Элементы.Группа1.Высота * 1.1;
		
	КонецЕсли;
	
	Если Интервал = 0 Тогда
		
		Интервал = 1;
		
	КонецЕсли;
	
	НачалоИнтервала = 0;
	
	Элементы.Минуты.СписокВыбора.Добавить(Формат(НачалоИнтервала, "ЧЦ=2; ЧН=00; ЧВН="), НачалоИнтервала);
	
	Пока НачалоИнтервала < 60 Цикл
		
		НачалоИнтервала = НачалоИнтервала + Интервал;
		
		Элементы.Минуты.СписокВыбора.Добавить(Формат(НачалоИнтервала, "ЧЦ=2; ЧН=00; ЧВН="), НачалоИнтервала);
		
	КонецЦикла;
	
	НачалоИнтервала = Час(Начало);
	
	Часы = НачалоИнтервала;
	
	Элементы.Часы.СписокВыбора.Добавить(Формат(НачалоИнтервала, "ЧЦ=2; ЧН=00; ЧВН="), НачалоИнтервала);
	
	Пока НачалоИнтервала < Час(Конец) Цикл
		
		НачалоИнтервала = НачалоИнтервала + 1;
		
		Элементы.Часы.СписокВыбора.Добавить(Формат(НачалоИнтервала, "ЧЦ=2; ЧН=00; ЧВН="), НачалоИнтервала);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Реквизит1Выбор(Элемент, ВыбраннаяДата)
	
	Закрыть(Дата + 60*60*Часы + Минуты*60);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборВремени(Команда)
	
	Закрыть(Дата + 60*60*Часы + Минуты*60);
	
КонецПроцедуры

&НаКлиенте
Процедура МинутыРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НовоеЗначение = (Цел(Минуты / Интервал) + ?(Направление = 1, 1, ?(Минуты % Интервал = 0, -1, 0))) * Интервал;
	Если НовоеЗначение < 0 Тогда
		НовоеЗначение = 60 - Интервал;
	ИначеЕсли НовоеЗначение >= 60 Тогда
		НовоеЗначение = 0;
	КонецЕсли;
	
	Минуты = НовоеЗначение;
	
КонецПроцедуры


