
Функция WebhookPOST(Запрос)
	КодДилера = Запрос.ПараметрыURL["DealerCode"];
	стрАутентификации = СМ_ПроцедурыДляNissanAftersales.СтрокаАутентификации(КодДилера);
	
	Если обЗначениеНеЗаполнено(стрАутентификации) Тогда
		Ответ = Новый HTTPСервисОтвет(404);
		Ответ.УстановитьТелоИзСтроки("Некорректный параметр URL " + КодДилера + "!", "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
		Возврат Ответ;
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	ЧтениеJSON.УстановитьСтроку(ТелоЗапроса);
	Попытка
		стЗапрос = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Некорректный JSON в теле запроса!", "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
		Возврат Ответ;
	КонецПопытки;
	
	Если стЗапрос.action = "new_lead" Тогда // передан новый лид	
		стДанныеЛида = СМ_ПроцедурыДляNissanAftersales.ПолучитьДанныеЛида(стЗапрос.lead_id, стрАутентификации);
		Если ЗначениеЗаполнено(стДанныеЛида.error) Тогда
			Ответ = Новый HTTPСервисОтвет(500);
			Ответ.УстановитьТелоИзСтроки(стДанныеЛида.error, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
			Возврат Ответ;
		КонецЕсли;
		
		стрОшибка = ОбработатьНовыйЛид(КодДилера, стДанныеЛида.lead_info);
		Если ЗначениеЗаполнено(стрОшибка) Тогда
			Ответ = Новый HTTPСервисОтвет(500);
			Ответ.УстановитьТелоИзСтроки(стрОшибка, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
			Возврат Ответ;
		КонецЕсли;
		
	ИначеЕсли стЗапрос.action = "lead_data_updated" Тогда // было изменение в данных лида
		стДанныеЛида = СМ_ПроцедурыДляNissanAftersales.ПолучитьДанныеЛида(стЗапрос.lead_id, стрАутентификации);
		Если ЗначениеЗаполнено(стДанныеЛида.error) Тогда
			Ответ = Новый HTTPСервисОтвет(500);
			Ответ.УстановитьТелоИзСтроки(стДанныеЛида.error, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
			Возврат Ответ;
		КонецЕсли;
		
		стрОшибка = ОбработатьИзменениеДанныхЛида(стДанныеЛида.lead_info);
		Если ЗначениеЗаполнено(стрОшибка) Тогда
			Ответ = Новый HTTPСервисОтвет(500);
			Ответ.УстановитьТелоИзСтроки(стрОшибка, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
			Возврат Ответ;
		КонецЕсли;
		
	ИначеЕсли стЗапрос.action = "lead_status_updated" Тогда // было изменение статуса лида
		стрОшибка = ОбработатьИзменениеСтатусаЛида(стЗапрос.lead_id, стЗапрос.payload, стрАутентификации); 
		Если ЗначениеЗаполнено(стрОшибка) Тогда
			Ответ = Новый HTTPСервисОтвет(500);
			Ответ.УстановитьТелоИзСтроки(стрОшибка, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
			Возврат Ответ;
		КонецЕсли;
		
	ИначеЕсли стЗапрос.action = "lead_overdue" Тогда // лид был просрочен в процессе обработки
		ОбработатьПросроченныйЛид(стЗапрос.lead_id);
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("ok", "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ;
КонецФункции

Функция ОбработатьНовыйЛид(КодДилера, ДанныеЛида)
	стрОшибка = "";	
	нзКонтакты = РегистрыСведений.КонтактыCustomer360.СоздатьНаборЗаписей();
	нзКонтакты.Отбор.ЛидИД.Значение = ДанныеЛида.lead_id;
	нзКонтакты.Отбор.ЛидИД.Использование = Истина;
	нзКонтакты.Прочитать();	
	Если нзКонтакты.Количество() > 0 Тогда
		Возврат стрОшибка;
	КонецЕсли;
		
	Если КодДилера = "21112401" Тогда
		Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001160"); //Олимп Моторс (Шахты)
	ИначеЕсли КодДилера = "21409201" Тогда
		Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001160"); //Олимп Моторс (Шахты)
	ИначеЕсли КодДилера = "21115701" Тогда
		Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000190"); //Волгодонск Ниссан
	КонецЕсли;
	
	РабочийЛистСсылка = СоздатьРабочийЛист(Подразделение, ДанныеЛида);		
	Если ЗначениеЗаполнено(РабочийЛистСсылка) Тогда
		мзКонтакты = РегистрыСведений.КонтактыCustomer360.СоздатьМенеджерЗаписи();
		мзКонтакты.СсылкаНаОбъект = РабочийЛистСсылка;
		мзКонтакты.ЛидИД = ДанныеЛида.lead_id;
		мзКонтакты.КодДилера = КодДилера;
		мзКонтакты.КодТипаЛида = ДанныеЛида.type_id;
		мзКонтакты.ЛидЗакрыт = Ложь;
		мзКонтакты.ДатаИзменения = ТекущаяДата();
		мзКонтакты.Записать();
		
	Иначе
		стрОшибка = "Обработать новый лид: не удалось записать рабочий лист сервиса!";
	КонецЕсли;
	
	Возврат стрОшибка;
КонецФункции

Функция СоздатьРабочийЛист(Подразделение, ДанныеЛида)
	РабочийЛистОбъект = Документы.РабочийЛистСервиса.СоздатьДокумент();		
	РабочийЛистОбъект.ХозОперация = Справочники.ХозОперации.РабочийЛистСервиса;
	РабочийЛистОбъект.Дата = ТекущаяДата();
	РабочийЛистОбъект.Организация = Подразделение.Организация;
	РабочийЛистОбъект.ПодразделениеКомпании = Подразделение;
	РабочийЛистОбъект.УстановитьНовыйНомер();	
	
	РабочийЛистОбъект.Автор = Подразделение.РуководительСервиса;
	Если обЗначениеНеЗаполнено(РабочийЛистОбъект.Автор) Тогда
		РабочийЛистОбъект.Автор = РабочийЛистОбъект.Организация.РуководительСервиса;
	КонецЕсли;
	Если обЗначениеНеЗаполнено(РабочийЛистОбъект.Автор) Тогда
		РабочийЛистОбъект.Автор = ПараметрыСеанса.Пользователь;
	КонецЕсли;
	
	СтрокаПользователь = РабочийЛистОбъект.Пользователи.Добавить();
	СтрокаПользователь.Пользователь	= РабочийЛистОбъект.Автор; 			
	РабочийЛистОбъект.РуководительМенеджера = РабочийЛистОбъект.Автор.Сотрудник;
		
	КонецРабочегоДня = Дата(Год(РабочийЛистОбъект.Дата), Месяц(РабочийЛистОбъект.Дата), День(РабочийЛистОбъект.Дата), 19, 0, 0);
	ДатаНачала = РабочийЛистОбъект.Дата + 7200;
	Если ДатаНачала > КонецРабочегоДня Тогда
		ДатаНачала = РабочийЛистОбъект.Дата + 54000; // через 15 часов
	КонецЕсли;	
	РабочийЛистОбъект.Менеджер = СМ_ФормированиеНовыхОбъектов.СлучайныйВыборСотрудника(Подразделение, Справочники.Должности.ОператорСервисБюро, ДатаНачала);
	
	Если обЗначениеНеЗаполнено(РабочийЛистОбъект.Менеджер) Тогда
		РабочийЛистОбъект.Менеджер = РабочийЛистОбъект.РуководительМенеджера;
	КонецЕсли;

	РабочийЛистОбъект.Реклама = Справочники.ИсточникиИнформации.ЛичныйВизит;
	РабочийЛистОбъект.Статус = Справочники.СтатусыРабочегоЛиста.Создан;
	РабочийЛистОбъект.Пол = Перечисления.ПолФизическихЛиц.НеУказан;
	РабочийЛистОбъект.ВидКонтакта = Перечисления.ВидыСобытий.ЗаявкаССайта;
	РабочийЛистОбъект.ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
	РабочийЛистОбъект.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду("643");
	
	РабочийЛистОбъект.Комментарий = "Создан автоматически контактом с Customer360: " + ДанныеЛида.source_name;
	РабочийЛистОбъект.ПричинаОбращения = "Customer360: " + ДанныеЛида.type_name;

	стКонтакт = ДанныеЛида.contact;
	РабочийЛистОбъект.Контрагент = СтрШаблон("%1 %2", стКонтакт.last_name, стКонтакт.first_name);
	Если стКонтакт.middle_name <> Неопределено И ЗначениеЗаполнено(стКонтакт.middle_name) Тогда
		РабочийЛистОбъект.Контрагент = СтрШаблон("%1 %2", РабочийЛистОбъект.Контрагент, стКонтакт.middle_name);
	КонецЕсли;
	
	Если стКонтакт.vin <> Неопределено И ЗначениеЗаполнено(стКонтакт.vin) Тогда
		РабочийЛистОбъект.VIN = стКонтакт.vin;
		
		АвтомобильЛида = Справочники.Автомобили.НайтиПоРеквизиту("VIN", стКонтакт.vin);
		Если ЗначениеЗаполнено(АвтомобильЛида) Тогда
			РабочийЛистОбъект.Автомобиль = АвтомобильЛида;
		ИначеЕсли стКонтакт.car_model <> Неопределено И ЗначениеЗаполнено(стКонтакт.car_model) Тогда
			МодельЛида = Справочники.Модели.НайтиПоНаименованию(стКонтакт.car_model);
			Если ЗначениеЗаполнено(МодельЛида) Тогда
				РабочийЛистОбъект.Модель = МодельЛида;
			Иначе
				РабочийЛистОбъект.Автомобиль = стКонтакт.car_model;			
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	
	РабочийЛистОбъект.КодРегиона = "+7";
	РабочийЛистОбъект.КодГорода = Лев(стКонтакт.contect_phone, 3);
	РабочийЛистОбъект.НомерТелефона = Сред(стКонтакт.contect_phone, 4, 7);
	РабочийЛистОбъект.ПредставлениеТелефона = РабочийЛистОбъект.КодРегиона + ", " + стКонтакт.contect_phone;	
	
	Если ДанныеЛида.type_id = 3 Или ДанныеЛида.type_id = 15 Или ДанныеЛида.type_id = 23 Тогда
		РабочийЛистОбъект.ВидРемонта = Справочники.ВидыРемонта.ТехническоеОбслуживание;
	Иначе
		РабочийЛистОбъект.ВидРемонта = Справочники.ВидыРемонта.КоммерческийРемонт;
	КонецЕсли;
	
	Попытка
		РабочийЛистОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		РабочийЛистОбъект.ОбменДанными.Загрузка = Истина;
		РабочийЛистОбъект.Записать();
	КонецПопытки;
	
	Возврат РабочийЛистОбъект.Ссылка;
КонецФункции

Функция СоздатьСобытие(РабочийЛистСсылка, ДанныеЛида)
	стрОшибка = "";
	СобытиеОбъект = Документы.Событие.СоздатьДокумент();
	СобытиеОбъект.Заполнить(РабочийЛистСсылка);
	
	СобытиеОбъект.ХозОперация = Справочники.ХозОперации.Событие;
	СобытиеОбъект.ДокументОснование = РабочийЛистСсылка;
	СобытиеОбъект.Автор = РабочийЛистСсылка.Автор;
	СобытиеОбъект.Приоритет = Перечисления.Важность.Высокая;
	СобытиеОбъект.ВидСобытия = Перечисления.ВидыСобытий.ТелефонныйЗвонок;
	СобытиеОбъект.ТипСообщения = Перечисления.ТипыСообщений.Исходящее;
	СобытиеОбъект.Состояние = Перечисления.СостоянияСобытий.Запланировано;
	СобытиеОбъект.Содержание = "Контакт Customer360: " + ДанныеЛида.type_name + Символы.ПС
		+ "Источник: " + ДанныеЛида.source_name;
		
	КонецРабочегоДня = Дата(Год(СобытиеОбъект.Дата), Месяц(СобытиеОбъект.Дата), День(СобытиеОбъект.Дата), 19, 0, 0);
	ДатаНачала = СобытиеОбъект.Дата + 7200;
	Если ДатаНачала < КонецРабочегоДня Тогда
		СобытиеОбъект.ДатаНачала = ДатаНачала;
	Иначе
		СобытиеОбъект.ДатаНачала = СобытиеОбъект.Дата + 54000; // через 15 часов
	КонецЕсли;
	СобытиеОбъект.ДатаОкончания = СобытиеОбъект.ДатаНачала + 900;
		
	Попытка
		СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		СобытиеОбъект.ОбменДанными.Загрузка = Истина;
		СобытиеОбъект.Записать();
	КонецПопытки;
	Если обЗначениеНеЗаполнено(СобытиеОбъект.Ссылка) Тогда
		стрОшибка = "Обработать новый лид: не удалось записать событие!";
	КонецЕсли;
	
	Возврат стрОшибка;
КонецФункции

Функция ОбработатьИзменениеДанныхЛида(ДанныеЛида)
	нзКонтакты = РегистрыСведений.КонтактыCustomer360.СоздатьНаборЗаписей();
	нзКонтакты.Отбор.ЛидИД.Значение = ДанныеЛида.lead_id;
	нзКонтакты.Отбор.ЛидИД.Использование = Истина;
	нзКонтакты.Прочитать();	
	Если нзКонтакты.Количество() = 0 Тогда
		Возврат "Обновить данные лида: лид не найден!";
	КонецЕсли;
	
	мзКонтакт = РегистрыСведений.КонтактыCustomer360.СоздатьМенеджерЗаписи();
	мзКонтакт.СсылкаНаОбъект = нзКонтакты[0].СсылкаНаОбъект;
	мзКонтакт.ЛидИД = ДанныеЛида.lead_id;
	мзКонтакт.Прочитать();
	Если Не мзКонтакт.Выбран() Тогда
		Возврат "Обновить данные лида: лид не найден!";
	КонецЕсли;
	
	Если мзКонтакт.ЛидЗакрыт Тогда
		Возврат "";
	КонецЕсли;

	РабочийЛистОбъект = мзКонтакт.СсылкаНаОбъект.ПолучитьОбъект();
	стКонтакт = ДанныеЛида.contact;
	РабочийЛистОбъект.Контрагент = СтрШаблон("%1 %2", стКонтакт.last_name, стКонтакт.first_name);
	Если стКонтакт.middle_name <> Неопределено И ЗначениеЗаполнено(стКонтакт.middle_name) Тогда
		РабочийЛистОбъект.Контрагент = СтрШаблон("%1 %2", РабочийЛистОбъект.Контрагент, стКонтакт.middle_name);
	КонецЕсли;
	
	Если стКонтакт.vin <> Неопределено И ЗначениеЗаполнено(стКонтакт.vin) Тогда
		РабочийЛистОбъект.VIN = стКонтакт.vin;
		
		АвтомобильЛида = Справочники.Автомобили.НайтиПоРеквизиту("VIN", стКонтакт.vin);
		Если ЗначениеЗаполнено(АвтомобильЛида) Тогда
			РабочийЛистОбъект.Автомобиль = АвтомобильЛида;
		ИначеЕсли стКонтакт.car_model <> Неопределено И ЗначениеЗаполнено(стКонтакт.car_model) Тогда
			МодельЛида = Справочники.Модели.НайтиПоНаименованию(стКонтакт.car_model);
			Если ЗначениеЗаполнено(МодельЛида) Тогда
				РабочийЛистОбъект.Модель = МодельЛида;
			Иначе
				РабочийЛистОбъект.Автомобиль = стКонтакт.car_model;			
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	
	РабочийЛистОбъект.КодРегиона = "+7";
	РабочийЛистОбъект.КодГорода = Лев(стКонтакт.contect_phone, 3);
	РабочийЛистОбъект.НомерТелефона = Сред(стКонтакт.contect_phone, 4, 7);
	РабочийЛистОбъект.ПредставлениеТелефона = РабочийЛистОбъект.КодРегиона + ", " + стКонтакт.contect_phone;	
		
	Попытка
		РабочийЛистОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		РабочийЛистОбъект.ОбменДанными.Загрузка = Истина;
		РабочийЛистОбъект.Записать();
	КонецПопытки;
	мзКонтакт.ДатаИзменения = ТекущаяДата();
	мзКонтакт.Записать();
	
	Возврат "";
КонецФункции

Функция ОбработатьИзменениеСтатусаЛида(ЛидИД, НовыйСтатус, стрАутентификации)
	нзКонтакты = РегистрыСведений.КонтактыCustomer360.СоздатьНаборЗаписей();
	нзКонтакты.Отбор.ЛидИД.Значение = ЛидИД;
	нзКонтакты.Отбор.ЛидИД.Использование = Истина;
	нзКонтакты.Прочитать();	
	Если нзКонтакты.Количество() = 0 Тогда
		Возврат "Изменить статус лида: лид не найден!";
	КонецЕсли;
	
	мзКонтакт = РегистрыСведений.КонтактыCustomer360.СоздатьМенеджерЗаписи();
	мзКонтакт.СсылкаНаОбъект = нзКонтакты[0].СсылкаНаОбъект;
	мзКонтакт.ЛидИД = ЛидИД;
	мзКонтакт.Прочитать();
	Если Не мзКонтакт.Выбран() Тогда
		Возврат "Изменить статус лида: лид не найден!";
	КонецЕсли;
	
	Если мзКонтакт.ЛидЗакрыт Тогда
		Возврат "";
	КонецЕсли;
	
	ПричинаОтказа = Справочники.ВозраженияИПричиныОтказов.ПустаяСсылка();
	Если НовыйСтатус = "refuse" Тогда
		СтатусРабочегоЛиста = Справочники.СтатусыРабочегоЛиста.Отказ;
		стДанныеЛида = СМ_ПроцедурыДляNissanAftersales.ПолучитьДанныеЛида(ЛидИД, стрАутентификации);
		Если обЗначениеНеЗаполнено(стДанныеЛида.error) Тогда
			КодПричиныОтказа = стДанныеЛида.lead_info.dealer_refuse_reason_id;
			ПричинаОтказа = Справочники.ВозраженияИПричиныОтказов.НайтиПоРеквизиту("КодCustomer360", КодПричиныОтказа);
		КонецЕсли;
		
	ИначеЕсли НовыйСтатус = "served" Или НовыйСтатус = "planned" Тогда
		СтатусРабочегоЛиста = Справочники.СтатусыРабочегоЛиста.Продажа;
	ИначеЕсли НовыйСтатус = "bad_phone" Или НовыйСтатус = "not_available" Тогда
		СтатусРабочегоЛиста = Справочники.СтатусыРабочегоЛиста.ОшибочныйНомер;
	Иначе
		Возврат "";
	КонецЕсли;
	
	РабочийЛистОбъект = мзКонтакт.СсылкаНаОбъект.ПолучитьОбъект();
	РабочийЛистОбъект.Статус = СтатусРабочегоЛиста;
	РабочийЛистОбъект.ПричинаОтказа = ПричинаОтказа;
	РабочийЛистОбъект.Комментарий = РабочийЛистОбъект.Комментарий + Символы.ПС + "Лид закрыт на портале Customer360.";
	Попытка
		РабочийЛистОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		РабочийЛистОбъект.ОбменДанными.Загрузка = Истина;
		РабочийЛистОбъект.Записать();
	КонецПопытки;
	
	мзКонтакт.ЛидЗакрыт = Истина;
	мзКонтакт.ДатаИзменения = ТекущаяДата();
	мзКонтакт.Записать();
	
	Возврат "";
КонецФункции

Процедура ОбработатьПросроченныйЛид(ДанныеЛида)
КонецПроцедуры
