// Модуль документа Рабочий лист кредитного отдела

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем ИмяРеквизитаКода Экспорт;     // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/атрикула в ТЧ
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования
Перем СписокСтатусов Экспорт;					// Список статусов рабочего листа
Перем МассивТребований Экспорт;					// Массив требований

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА


// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Автор",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	ОбязательныеРеквизиты.Вставить("Организация",1);	
	ОбязательныеРеквизиты.Вставить("МенеджерКредитногоОтдела",1);
	ОбязательныеРеквизиты.Вставить("Клиент",1);
	ОбязательныеРеквизиты.Вставить("ПредставлениеТелефона",1);
	//Бондаренко++ 20240810
	//ОбязательныеРеквизиты.Вставить("Банк",1);
	//Бондаренко-- 20240810
	ОбязательныеРеквизиты.Вставить("ВалютаДокумента",1);
	ОбязательныеРеквизиты.Вставить("СтоимостьАвтомобиля",1);
	
	//Бондаренко++ 20250802
	//ОбязательныеРеквизиты.Вставить("ПервоначальныйВзнос",1);
	Если НЕ БезПервоначальногоВзноса Тогда
		ОбязательныеРеквизиты.Вставить("ПервоначальныйВзнос",1);
	КонецЕсли;
	//Бондаренко-- 20250802
	
 	ОбязательныеРеквизиты.Вставить("СуммаКредита",1);
	ОбязательныеРеквизиты.Вставить("СрокКредита",1);
	//Бондаренко++ 20240810
	//ОбязательныеРеквизиты.Вставить("ПроцентнаяСтавка",1);
	//Бондаренко-- 20240810
	//Бондаренко++ 20260707
	//ОбязательныеРеквизиты.Вставить("ЗаявленныйДоход",1);
	//Бондаренко++ 20260707
	ОбязательныеРеквизиты.Вставить("ВалютаЗаявленногоДохода",1);
	ОбязательныеРеквизиты.Вставить("ТребованиеКПодтверждениюДохода",1);
	ОбязательныеРеквизиты.Вставить("Статус",1);
	
	//Бондаренко++ 20260724
	Если СтраховыеПродукты.Количество() > 0 Тогда
		Если Дата > Дата(2026,7,23) Тогда
			ОбязательныеСтраховыеПродукты=Новый Структура();
			ОбязательныеСтраховыеПродукты.Вставить("ВариантОплаты",1);
	 		ОбязательныеРеквизиты.Вставить("СтраховыеПродукты",ОбязательныеСтраховыеПродукты);
		КонецЕсли;
 	КонецЕсли;
	//Бондаренко-- 20260724
	
	Возврат ОбязательныеРеквизиты;
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Проверяет корректность заполнения объекта.
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры:
//  Ошибки       - строка, в случае некорректного заполнения содержит описанием возникших ошибок, 
//  ДопРеквизиты - структура, на вход может быть передана структура с дополнительными реквизитами для проверки,
//  Заполнение   - булево, флаг проверки, 
//  Уникальность - булево, флаг проверки.
//
// Возвращаемое значение:
//  Булево - Возвращает Истина если все заполнено корректно и Ложь иначе.
// 
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	Возврат Результат;	
КонецФункции // ПроверитьКорректность()
 
// Функция проверяет, допустимо ли изменение объекта
//
// Параметры:
//  БлокироватьРеквизиты - структура, структура блокируемых на изменение реквизитов.
//
// Возвращаемое значение:
// Булево - Возвращает Истина, если изменения возможны, ложь иначе
//          Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
//
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции // ДоступностьИзменения()

// Возвращает список возможных хозяйственных операций документа
// Вовращаемое значение: 
//  СписокЗначений. 
//  Строка списка: Значение - имя предопределенного элемента; 
//				   Представление - красивое его представление
// 				   "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;               
	СписокХозОпераций.Добавить("РабочийЛистКредитногоОтдела","Рабочий лист кредитного отдела",Истина);
	//Бондаренко++ 20260615
	СписокХозОпераций.Добавить("РабочийЛистКредитногоОтделаДосрочноеПогашение","Рабочий лист кредитного отдела Досрочное погашение",Истина);
 	//Бондаренко-- 20260615
	Возврат СписокХозОпераций;
КонецФункции // ПолучитьСписокХозОпераций()

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка			– Имя реквизита документа с полным путем (например Тавары.Номенклатура).
//  ЭтаФорма	– Форма				– Ссылка на форму документа. Если значение неопределено, производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Стркутура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	
	Если Имя="Клиент" Тогда
		Результат	= дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		
		#Если Клиент Тогда
		КодРегиона = "";
		КодГорода = "";
		НомерТелефона = "";
		ВнутреннийНомер = "";
		ПредставлениеТелефона = "";
		ВидТелефона = Неопределено;
		Если ЗначениеЗаполнено(Клиент) Тогда
			Телефоны = киПолучитьСписокТелефоновОбъекта(Клиент);
			Если Телефоны<>Неопределено И Телефоны.Количество()>0 Тогда
				ЗаполнитьЗначенияСвойств(ЭтотОбъект,Телефоны[0].Значение);
			КонецЕсли;
		КонецЕсли; 
		#КонецЕсли
		
		Возврат Результат;
	//Бондаренко++ 20260613	
	ИначеЕсли Имя="ИспользоватьКалькулятор"	 Тогда
		// 
	//Бондаренко++ 20260721	
	ИначеЕсли Имя="Госпрограмма" Тогда
	    //Бондаренко++ 20260722
	    Если Госпрограмма Тогда
			Если СемейнаяГосПрограмма Тогда
 				СемейнаяГосПрограмма = Ложь;
			КонецЕсли;
 		КонецЕсли;
		//Бондаренко-- 20260722
		Для каждого СтрКредит Из Программы Цикл
			Если СтрКредит.Статус = Справочники.СтатусыРабочегоЛиста.КредитВыдан ИЛИ СтрКредит.Статус = Справочники.СтатусыРабочегоЛиста.Одобрен Тогда	
				ОбработкаРеквизита("Статус",СтрКредит,ЭтаФорма,);	
			КонецЕсли;
		КонецЦикла;
	//Бондаренко-- 20260721
	//Бондаренко++ 20260722
	ИначеЕсли Имя="СемейнаяГоспрограмма" Тогда
	    Если СемейнаяГосПрограмма Тогда
			Если ГосПрограмма Тогда
 				ГосПрограмма = Ложь;
			КонецЕсли;
 		КонецЕсли;
		Для каждого СтрКредит Из Программы Цикл
			Если СтрКредит.Статус = Справочники.СтатусыРабочегоЛиста.КредитВыдан ИЛИ СтрКредит.Статус = Справочники.СтатусыРабочегоЛиста.Одобрен Тогда	
				ОбработкаРеквизита("Статус",СтрКредит,ЭтаФорма,);	
			КонецЕсли;
		КонецЦикла;
	//Бондаренко-- 20260722
	//Бондаренко++ 20260613		
	ИначеЕсли Имя="КредитнаяПрограмма" Тогда
		//Бондаренко++ 20260620
		Если Не обЗначениеНеЗаполнено(ТекСтрока.КредитнаяПрограмма) Тогда
			ТекСтрока.БанкКонтрагентНаименование = ТекСтрока.КредитнаяПрограмма.БанкПартнер.Наименование;
			ТекСтрока.Директовая = ТекСтрока.КредитнаяПрограмма.Директовая;
		Иначе	
		    ТекСтрока.БанкКонтрагентНаименование = "";
			ТекСтрока.Директовая = Ложь;
		КонецЕсли;
		//Бондаренко-- 20260620
  		ОбработкаРеквизита("Статус",ТекСтрока,ЭтаФорма,);
 	ИначеЕсли Имя="Банк" Тогда
		Если НЕ обЗначениеНеЗаполнено(Банк) И
			НЕ обЗначениеНеЗаполнено(КредитнаяПрограмма) И
			Банк<>КредитнаяПрограмма.Банк Тогда
			КредитнаяПрограмма	= Справочники.КредитныеПрограммы.ПустаяСсылка();
		КонецЕсли;
	//Бондаренко++ 20260620	
	ИначеЕсли Имя="Программы.УменьшениеПроцентаКВ" Тогда
		Если ТекСтрока.УменьшениеПроцентаКВ > ТекСтрока.КредитнаяПрограмма.ПроцентКВ Тогда
			ТекСтрока.УменьшениеПроцентаКВ = ТекСтрока.КредитнаяПрограмма.ПроцентКВ;	
 		КонецЕсли;
 		ОбработкаРеквизита("Статус",ТекСтрока,ЭтаФорма);
 	//Бондаренко-- 20260620
	//Бондаренко++ 20260819
	ИначеЕсли Имя = "ДатаВыдачиКредита" Тогда
		Если НЕ ( ТекСтрока.Статус = Справочники.СтатусыРабочегоЛиста.КредитВыдан ИЛИ ТекСтрока.Статус = Справочники.СтатусыРабочегоЛиста.Одобрен ) Тогда
  			ТекСтрока.ДатаВыдачиКредита = Дата(1,1,1);
 		КонецЕсли;		
		ДатаВыдачиКредита = ТекСтрока.ДатаВыдачиКредита ;
 	//Бондаренко-- 20260819	
	ИначеЕсли Имя="Статус" Тогда	
 		Если ТекСтрока.Статус = Справочники.СтатусыРабочегоЛиста.КредитВыдан ИЛИ ТекСтрока.Статус = Справочники.СтатусыРабочегоЛиста.Одобрен Тогда	
		//Бондаренко++ 20250905	
			ТекСтрока.КВ = РассчитатьКВ(ТекСтрока.КредитнаяПрограмма,ТекСтрока.УменьшениеПроцентаКВ);
			//Бондаренко++ 20250806
			КредитнаяПрограмма = ТекСтрока.КредитнаяПрограмма;
			//Бондаренко-- 20250806
			//Бондаренко++ 20260819
			ТекСтрока.ДатаВыдачиКредита = ТекущаяДата();
			//Бондаренко-- 20260819
		Иначе
			ТекСтрока.КВ = 0;	
			//Бондаренко++ 20250806
			КредитнаяПрограмма = "";
			//Бондаренко-- 20250806
			//Бондаренко++ 20260819
			ТекСтрока.ДатаВыдачиКредита = "";
			//Бондаренко-- 20260819
		КонецЕсли;
	//Бондаренко-- 20250503 
	//Бондаренко++ 20260425	
 	ИначеЕсли Имя="СтраховыеПродукты.ПрограммаСтрахования" Тогда
	    Если ТекСтрока.СтраховаяКомпания <> ТекСтрока.ПрограммаСтрахования.Партнер Тогда
			ТекСтрока.СтраховаяКомпания = ТекСтрока.ПрограммаСтрахования.Партнер;
		КонецЕсли;
		//Бондаренко++ 20260615
		//Бондаренко++ 20260620
		Если ТекСтрока.ПроцентКВ <> ТекСтрока.ПрограммаСтрахования.Вознаграждение Тогда
			ТекСтрока.ПроцентКВ = ТекСтрока.ПрограммаСтрахования.Вознаграждение;
		КонецЕсли;
		Если Не обЗначениеНеЗаполнено(ТекСтрока.Тариф) Тогда
			ТекСтрока.Тариф = "";
 		КонецЕсли;
 		//Бондаренко-- 20260620
		ОбработкаРеквизита("СтраховыеПродукты.СуммаСтрахования",ТекСтрока,ЭтаФорма,ДопПараметры);
		//Бондаренко-- 20260615
 	//Бондаренко-- 20260425
	ИначеЕсли Имя = "СтраховыеПродукты.АгентПодразделение" Тогда
		Если Не обЗначениеНеЗаполнено(ТекСтрока.АгентПодразделение) Тогда
			ЕстьПодчиненные = Справочники.ПодразделенияКомпании.СМГ_ЕстьПодчиненныеПодразделения(ТекСтрока.АгентПодразделение);
			Если ЕстьПодчиненные Тогда
				СМГ_Сообщить("ОШИБКА! Запрещено использовать подразделение """+СокрЛП(ТекСтрока.АгентПодразделение)+""" из группы """+СокрЛП(ТекСтрока.АгентПодразделение.Родитель)+""".",СтатусСообщения.ОченьВажное);
				ТекСтрока.АгентПодразделение = "";
			КонецЕсли;
			//Бондаренко++ 20250712
			//Если обЗначениеНеЗаполнено(ТекСтрока.СтраховаяКомпания) Тогда
			//	ТекСтрока.СтраховаяКомпания = Справочники.БанкиЛкПартнеры.НайтиПоРеквизиту("БанкКонтрагент",ТекСтрока.ПрограммаСтрахование.СтраховаяКомпания);
			//КонецЕсли;
			//Если НЕ обЗначениеНеЗаполнено(ТекСтрока.АгентПодразделение) Тогда 
			//	Если НЕ обЗначениеНеЗаполнено(ТекСтрока.СтраховаяКомпания) Тогда	
			//	ТекСтрока.ДоговорКв = НайтиСоздатьДоговорПрочий(ТекСтрока.АгентПодразделение,ТекСтрока.СтраховаяКомпания.БанкКонтрагент);
			//КонецЕсли;
			//КонецЕсли;
			//Бондаренко++ 20250712
		КонецЕсли;	
		//Бондаренко++ 20250821	
	ИначеЕсли Имя = "ПрограммаБрокерФинанс" Тогда
		Если Не обЗначениеНеЗаполнено(ПрограммаБрокерФинанс) Тогда  
			Если Не обЗначениеНеЗаполнено(ДокументОснование.Автомобиль) Тогда  
				Если Не обЗначениеНеЗаполнено(ДокументОснование.Автомобиль.Модель) Тогда
					КомпенсацияБрокерФинанс = ПолучитьКомпенсациюБрокерФинанс(ДокументОснование.Автомобиль.Модель,ПрограммаБрокерФинанс);
					ВариантБрокерФинанс = Перечисления.ВариантыОтветов.Да;
				КонецЕсли;	
			КонецЕсли;	
		Иначе
			ВариантБрокерФинанс = Перечисления.ВариантыОтветов.Нет;
			КомпенсацияБрокерФинанс = 0;
		КонецЕсли;
		//Бондаренко-- 20250821
		//Бондаренко++ 20260424
	ИначеЕсли Имя = "СтраховыеПродукты.Тариф" Тогда
		Если ТекСтрока.Тариф > 0 Тогда
			ТекСтрока.ПроцентКВ = НайтиПроцентКВ(ТекСтрока.ПрограммаСтрахования,ДокументОснование.Автомобиль.Модель.Марка,ТекСтрока.Тариф);
		Иначе	
			//Бондаренко++ 20260620
			ТекСтрока.ПроцентКВ = 0;
			Если НЕ обЗначениеНеЗаполнено(ТекСтрока.ПрограммаСтрахования) Тогда
				ТекСтрока.ПроцентКВ = ТекСтрока.ПрограммаСтрахования.Вознаграждение;
			Иначе
				ТекСтрока.ПроцентКВ = 0;
			//	Если ТекСтрока.УменьшениеПроцентаКВ > 0 Тогда
			//		ТекСтрока.УменьшениеПроцентаКВ = 0;
			//КонецЕсли;
  			КонецЕсли;
 			//Бондаренко-- 20260620
		КонецЕсли;
		ОбработкаРеквизита("СтраховыеПродукты.СуммаСтрахования",ТекСтрока,ЭтаФорма);
	ИначеЕсли Имя = "СтраховыеПродукты.СуммаСтрахования" Тогда	
		Если ТекСтрока.ПроцентКВ > 0 Тогда
			//Бондаренко++ 20260616
			//ТекСтрока.КВ = ТекСтрока.СуммаСтрахования * ТекСтрока.ПроцентКВ / 100;
			ТекСтрока.КВ = ТекСтрока.СуммаСтрахования * ( ТекСтрока.ПроцентКВ - ТекСтрока.УменьшениеПроцентаКВ ) / 100;
		Иначе	
			//ТекСтрока.КВ = ТекСтрока.СуммаСтрахования * ТекСтрока.ПрограммаСтрахования.Вознаграждение / 100; 
			ТекСтрока.КВ = ТекСтрока.СуммаСтрахования * ( ТекСтрока.ПрограммаСтрахования.Вознаграждение - ТекСтрока.УменьшениеПроцентаКВ )  / 100; 
			//Бондаренко-- 20260616
		КонецЕсли; 
		//Бондаренко++ 20260724
		Пересчет();
		//Бондаренко-- 20260724
  		//Бондаренко++ 20260616
	ИначеЕсли Имя = "СтраховыеПродукты.УменьшениеПроцентаКВ" Тогда	        
		Если ТекСтрока.ПроцентКВ > 0 Тогда
 			ТекСтрока.КВ = ТекСтрока.СуммаСтрахования * (ТекСтрока.ПроцентКВ - ТекСтрока.УменьшениеПроцентаКВ) / 100;
  		Иначе	
			ТекСтрока.КВ = ТекСтрока.СуммаСтрахования * ТекСтрока.ПрограммаСтрахования.Вознаграждение / 100; 
		КонецЕсли;
		//Бондаренко-- 20260616
	//Бондаренко++ 20260724
	ИначеЕсли Имя = "СтраховыеПродукты.ВариантОплаты" Тогда	        
		Если ТекСтрока.ВариантОплаты = Перечисления.ВариантыОплатыСтраховыхПрограмм.ВКредит Тогда
 			ТекСтрока.Наличные = Ложь;
			ТекСтрока.НапрямуюВСК = Ложь;
		ИначеЕсли ТекСтрока.ВариантОплаты = Перечисления.ВариантыОплатыСтраховыхПрограмм.Наличные Тогда	
 			ТекСтрока.Наличные = Истина;
			ТекСтрока.НапрямуюВСК = Ложь;
		ИначеЕсли ТекСтрока.ВариантОплаты = Перечисления.ВариантыОплатыСтраховыхПрограмм.НапрямуюВСК Тогда		
 			ТекСтрока.Наличные = Ложь;
			ТекСтрока.НапрямуюВСК = Истина;
		КонецЕсли;    
		Пересчет();
		//Бондаренко-- 20260724
	Иначе	
		Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;		
	
КонецФункции // ОбработкаРеквизита()

//Бондаренко++ 20260424
Функция НайтиПроцентКВ(ПрограммаСтрах,МаркаАвто,ТарифТек)
	
	Рез_ = 0;
	
  	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоказателиПрограммСтрахованияСрезПоследних.ПрограммаСтрахования КАК ПрограммаСтрахования,
		|	ПоказателиПрограммСтрахованияСрезПоследних.Марка КАК Марка,
		|	ПоказателиПрограммСтрахованияСрезПоследних.Тариф КАК Тариф,
		|	ПоказателиПрограммСтрахованияСрезПоследних.КВ КАК ПроцентКВ
		|ИЗ
		|	РегистрСведений.ПоказателиПрограммСтрахования.СрезПоследних(&Дата, ) КАК ПоказателиПрограммСтрахованияСрезПоследних
		|ГДЕ
		|	ПоказателиПрограммСтрахованияСрезПоследних.ПрограммаСтрахования = &ПрограммаСтрахования
		|	И ПоказателиПрограммСтрахованияСрезПоследних.Марка = &Марка
		|	И ПоказателиПрограммСтрахованияСрезПоследних.Тариф = &Тариф";
	
	Запрос.УстановитьПараметр("Марка", МаркаАвто);
	Запрос.УстановитьПараметр("ПрограммаСтрахования", ПрограммаСтрах);
	Запрос.УстановитьПараметр("Тариф", ТарифТек);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если ТЗ.Количество() > 0 Тогда
		Рез_ = ТЗ[0].ПроцентКВ;
 	КонецЕсли;
  	
 	Возврат Рез_;

КонецФункции // НайтиПроцентКВ()
//Бондаренко-- 20260424


// Функция возвращает сотрудника на основании переданного пользователя
//
Функция ПолучитьСотрудникаПоПользователю(ТекущийПользователь) Экспорт
	ТекущийСотрудник	= Справочники.Сотрудники.ПустаяСсылка();
	
	Если НЕ обЗначениеНеЗаполнено(ТекущийПользователь) И НЕ ПустаяСтрока(ТекущийПользователь.Наименование) Тогда
		Если обЗначениеНеЗаполнено(ТекущийПользователь.Сотрудник) Тогда
			ТекущийСотрудник	= Справочники.Сотрудники.НайтиПоНаименованию(ТекущийПользователь.Наименование, Истина);
			Если обЗначениеНеЗаполнено(ТекущийСотрудник) Тогда
				// Создадим нового сотрудника
				СотрудникОбъект	= Справочники.Сотрудники.СоздатьЭлемент();
				СотрудникОбъект.УстановитьНовыйКод();
				СотрудникОбъект.Наименование	= ТекущийПользователь.Наименование;
				СотрудникОбъект.Организация= ПараметрыСеанса.Организация;
				СотрудникОбъект.Подразделение	= ПараметрыСеанса.ПодразделениеКомпании;
				СотрудникОбъект.Должность		= Справочники.Должности.Неопределена;
				Попытка
					СотрудникОбъект.Записать();
					ТекущийСотрудник	= СотрудникОбъект.Ссылка;
				Исключение КонецПопытки;
			КонецЕсли;
		Иначе
			ТекущийСотрудник	= ТекущийПользователь.Сотрудник;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекущийСотрудник;
КонецФункции

#Если Клиент Тогда
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

// Функция осуществляет печать произвольного документа.
// Можно направить печать на экран или принтер, а также распечатать необходмое количество копий.
//
// Параметры:
//	ЭтотОбъект							- ДокументОбъект	- Документ для печати
//	НазваниеПечатнойФормы 				- Строка			- Название печатной формы, если пусто, то по умолчанию
//	КоличествоЭкземпляров				- Число				- Количество экземпляров документа
//	НаПринтер							- Булево			- Признак отправки документа на принтер без отображения его на экране
//  Документ 	  						- ТабличныйДокумент	- Макет печатной формы
//
// Возвращаемое значение:
//   ТабличныйДокумент	- Сформированная печатная форма
//
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции // Печать()

// Возвращает доступные варианты печати документа
// Вовращаемое значение: 
//  Струткура, каждая строка которой
//  соответствует одному из вариантов печати
//  Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм() Экспорт
	СтруктураМакетов=Новый Структура();
	Возврат СтруктураМакетов;
КонецФункции // ПолучитьСписокПечатныхФорм()

#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события при установке новго номера
//
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Обработчик события заполнения
//
Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	ХозОперация	= Справочники.ХозОперации.РабочийЛистКредитногоОтдела;	
	
	Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
	 
	Если ТипЗнч(Основание)=Тип("ДокументСсылка.РабочийЛист") Тогда
		ДокументОснование			= Основание;
		Статус						= Основание.Статус;
		ВалютаДокумента				= Основание.ВалютаДокумента;
		ДатаСделки					= Основание.Дата;
		Клиент						= Основание.Контрагент;
		
		ВидТелефона 				= Основание.ВидТелефона;
		КодРегиона					= Основание.КодРегиона;
		КодГорода					= Основание.КодГорода;	
		НомерТелефона				= Основание.НомерТелефона;
		ВнутреннийНомер				= Основание.ВнутреннийНомер;
		ПредставлениеТелефона		= Основание.ПредставлениеТелефона;	
		
		//Бондаренко++ 20260630
		//МенеджерКредитногоОтдела	= Основание.Менеджер;
		МенеджерКредитногоОтдела	= ПараметрыСеанса.Пользователь.Сотрудник;
		//Бондаренко-- 20260630
		СтоимостьАвтомобиля			= Основание.СуммаПродажи;
 		
		//Бондаренко++ 20240821
  		ТребованиеКПодтверждениюДохода = Перечисления.ТребованияКПодтверждениюДохода.СвободнаяФорма;
		СуммаКредита = СтоимостьАвтомобиля;
		
		//Бондаренко++ 20260728
		Если Не ИспользоватьКалькулятор Тогда
			СуммаСчетаНаАвто = СтоимостьАвтомобиля;
 		КонецЕсли;
		//Бондаренко++ 20260728 
		
		//Бондаренко++ 20260728
		Если Не ИспользоватьКалькулятор Тогда
	 		Если Не обЗначениеНеЗаполнено(ЧистаяСтоимостьАвтомобиля) Тогда
				СуммаСчетаНаАвто = ЧистаяСтоимостьАвтомобиля-ПервоначальныйВзнос; 
	 		КонецЕсли;
		КонецЕсли;
  		//Бондаренко-- 20260728
 		
		ПервоначальныйВзнос = 0;
		СрокКредита = 36;
		ЗаявленныйДоход = 0;
		Статус = Справочники.СтатусыРабочегоЛиста.Консультация;
		
		РублиРФ = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		
		ВалютаДокумента = РублиРФ ;
		КурсДокумента = 1;
		ВалютаУпр = РублиРФ;
		ВалютаЗаявленногоДохода = РублиРФ;
 		 
		Программы.Очистить();
		
		ТЗ = ПолучитьТаблицуКредитныхПрограмм(Основание.Автомобиль,Основание.Модель);
		
		Программы.Загрузить(ТЗ);
		
		Для каждого Стр Из Программы Цикл
			Стр.Статус = Справочники.СтатусыРабочегоЛиста.Заявка; 
 		КонецЦикла;
  		//Бондаренко-- 20240821
	//Бондаренко++ 20260615	
	ИначеЕсли ТипЗнч(Основание)=Тип("ДокументСсылка.РабочийЛистКредитногоОтдела") Тогда	
		ХозОперация = Справочники.ХозОперации.РабочийЛистКредитногоОтделаДосрочноеПогашение;
		Для каждого Стр Из Программы Цикл
			Стр.КВ = -Стр.КВ;
			Стр.УменьшениеПроцентаКВ = Стр.КредитнаяПрограмма.ПроцентКВ;
		КонецЦикла;
		Для каждого Стр Из СтраховыеПродукты Цикл
		    Стр.КВ = -Стр.КВ;
			Стр.УменьшениеПроцентаКВ = Стр.ПроцентКВ;
 		КонецЦикла;
	//Бондаренко-- 20260615		
	КонецЕсли;
		
КонецПроцедуры // ОбработкаЗаполнения()

Функция ПолучитьТаблицуКредитныхПрограмм(Авто, Модель) Экспорт
	
	    ТЗ = Новый ТаблицаЗначений();
	
		Запрос = Новый Запрос;
		
		Если НЕ обЗначениеНеЗаполнено(Авто) Тогда
			Если АвтомобильСПробегом(Авто) Тогда
 				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	КредитныеПрограммы.Ссылка КАК КредитнаяПрограмма,
				               |	КредитныеПрограммы.ПометкаУдаления КАК ПометкаУдаления,
				               |	КредитныеПрограммы.БуВсе КАК БуВсе,
				               |	КредитныеПрограммы.ЭтоГруппа КАК ЭтоГруппа,
				               |	КредитныеПрограммы.Недействующая КАК Недействующая,
				               |	КредитныеПрограммы.Директовая КАК Директовая
				               |ИЗ
				               |	Справочник.КредитныеПрограммы КАК КредитныеПрограммы
				               |ГДЕ
				               |	НЕ КредитныеПрограммы.ПометкаУдаления
				               |	И НЕ КредитныеПрограммы.ЭтоГруппа
				               |	И НЕ КредитныеПрограммы.Недействующая
				               |	И КредитныеПрограммы.БуВсе
				               |
				               |УПОРЯДОЧИТЬ ПО
				               |	Директовая УБЫВ";
				
					ТЗ = Запрос.Выполнить().Выгрузить();
			Иначе
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	КредитныеПрограммыМарки.Ссылка КАК КредитнаяПрограмма,
					               |	КредитныеПрограммыМарки.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
					               |	КредитныеПрограммыМарки.Ссылка.ЭтоГруппа КАК ЭтоГруппа,
					               |	КредитныеПрограммыМарки.Ссылка.Недействующая КАК Недействующая,
					               |	КредитныеПрограммыМарки.Ссылка.НовыеОпределенныхМарок КАК Крыж,
					               |	КредитныеПрограммыМарки.МаркаАвтомобиля.Ссылка КАК Марка,
					               |	КредитныеПрограммыМарки.Ссылка.Директовая КАК Директовая
					               |ИЗ
					               |	Справочник.КредитныеПрограммы.Марки КАК КредитныеПрограммыМарки
					               |ГДЕ
					               |	НЕ КредитныеПрограммыМарки.Ссылка.ПометкаУдаления
					               |	И НЕ КредитныеПрограммыМарки.Ссылка.ЭтоГруппа
					               |	И НЕ КредитныеПрограммыМарки.Ссылка.Недействующая
					               |	И КредитныеПрограммыМарки.Ссылка.НовыеОпределенныхМарок
					               |	И КредитныеПрограммыМарки.МаркаАвтомобиля.Ссылка = &Марка
					               |
					               |ОБЪЕДИНИТЬ ВСЕ
					               |
					               |ВЫБРАТЬ
					               |	КредитныеПрограммыМаркиВсе.Ссылка,
					               |	КредитныеПрограммыМаркиВсе.Ссылка.ПометкаУдаления,
					               |	КредитныеПрограммыМаркиВсе.Ссылка.ЭтоГруппа,
					               |	КредитныеПрограммыМаркиВсе.Ссылка.Недействующая,
					               |	КредитныеПрограммыМаркиВсе.Ссылка.НовыеВсе,
					               |	NULL,
					               |	КредитныеПрограммыМаркиВсе.Директовая
					               |ИЗ
					               |	Справочник.КредитныеПрограммы КАК КредитныеПрограммыМаркиВсе
					               |ГДЕ
					               |	НЕ КредитныеПрограммыМаркиВсе.Ссылка.ПометкаУдаления
					               |	И НЕ КредитныеПрограммыМаркиВсе.Ссылка.ЭтоГруппа
					               |	И НЕ КредитныеПрограммыМаркиВсе.Ссылка.Недействующая
					               |	И КредитныеПрограммыМаркиВсе.Ссылка.НовыеВсе
					               |
					               |УПОРЯДОЧИТЬ ПО
					               |	Директовая УБЫВ";
					
					Запрос.УстановитьПараметр("Марка",Модель.Марка);
				
					ТЗ = Запрос.Выполнить().Выгрузить();
 					
			КонецЕсли;
		Иначе
			Если НЕ обЗначениеНеЗаполнено(Модель) Тогда
				Если Модель = Справочники.Модели.АвтоСПробегом Тогда
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	КредитныеПрограммы.Ссылка КАК КредитнаяПрограмма,
					               |	КредитныеПрограммы.ПометкаУдаления КАК ПометкаУдаления,
					               |	КредитныеПрограммы.БуВсе КАК БуВсе,
					               |	КредитныеПрограммы.ЭтоГруппа КАК ЭтоГруппа,
					               |	КредитныеПрограммы.Недействующая КАК Недействующая,
					               |	КредитныеПрограммы.Директовая КАК Директовая
					               |ИЗ
					               |	Справочник.КредитныеПрограммы КАК КредитныеПрограммы
					               |ГДЕ
					               |	НЕ КредитныеПрограммы.ПометкаУдаления
					               |	И НЕ КредитныеПрограммы.ЭтоГруппа
					               |	И НЕ КредитныеПрограммы.Недействующая
					               |	И КредитныеПрограммы.БуВсе
					               |
					               |УПОРЯДОЧИТЬ ПО
					               |	Директовая УБЫВ";
					
					ТЗ = Запрос.Выполнить().Выгрузить();
				Иначе		
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	КредитныеПрограммыМарки.Ссылка КАК КредитнаяПрограмма,
					               |	КредитныеПрограммыМарки.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
					               |	КредитныеПрограммыМарки.Ссылка.ЭтоГруппа КАК ЭтоГруппа,
					               |	КредитныеПрограммыМарки.Ссылка.Недействующая КАК Недействующая,
					               |	КредитныеПрограммыМарки.Ссылка.НовыеОпределенныхМарок КАК Крыж,
					               |	КредитныеПрограммыМарки.МаркаАвтомобиля.Ссылка КАК Марка,
					               |	КредитныеПрограммыМарки.Ссылка.Директовая КАК Директовая
					               |ИЗ
					               |	Справочник.КредитныеПрограммы.Марки КАК КредитныеПрограммыМарки
					               |ГДЕ
					               |	НЕ КредитныеПрограммыМарки.Ссылка.ПометкаУдаления
					               |	И НЕ КредитныеПрограммыМарки.Ссылка.ЭтоГруппа
					               |	И НЕ КредитныеПрограммыМарки.Ссылка.Недействующая
					               |	И КредитныеПрограммыМарки.Ссылка.НовыеОпределенныхМарок
					               |	И КредитныеПрограммыМарки.МаркаАвтомобиля.Ссылка = &Марка
					               |
					               |ОБЪЕДИНИТЬ ВСЕ
					               |
					               |ВЫБРАТЬ
					               |	КредитныеПрограммыМаркиВсе.Ссылка,
					               |	КредитныеПрограммыМаркиВсе.Ссылка.ПометкаУдаления,
					               |	КредитныеПрограммыМаркиВсе.Ссылка.ЭтоГруппа,
					               |	КредитныеПрограммыМаркиВсе.Ссылка.Недействующая,
					               |	КредитныеПрограммыМаркиВсе.Ссылка.НовыеВсе,
					               |	NULL,
					               |	КредитныеПрограммыМаркиВсе.Директовая
					               |ИЗ
					               |	Справочник.КредитныеПрограммы КАК КредитныеПрограммыМаркиВсе
					               |ГДЕ
					               |	НЕ КредитныеПрограммыМаркиВсе.Ссылка.ПометкаУдаления
					               |	И НЕ КредитныеПрограммыМаркиВсе.Ссылка.ЭтоГруппа
					               |	И НЕ КредитныеПрограммыМаркиВсе.Ссылка.Недействующая
					               |	И КредитныеПрограммыМаркиВсе.Ссылка.НовыеВсе
					               |
					               |УПОРЯДОЧИТЬ ПО
					               |	Директовая УБЫВ";
					
					Запрос.УстановитьПараметр("Марка",Модель.Марка);
				
					ТЗ = Запрос.Выполнить().Выгрузить();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
		
		ТЗ.Колонки.Добавить("БанкКонтрагентНаименование");
		
 		Для каждого Стр Из ТЗ Цикл
			Стр.БанкКонтрагентНаименование = Стр.КредитнаяПрограмма.БанкПартнер.Наименование;
		КонецЦикла;            
		//Бондаренко++ 20260620
		ТЗ.Сортировать("Директовая, БанкКонтрагентНаименование");
		//Бондаренко-- 20260620
   		
		Возврат ТЗ;
 
	КонецФункции // ПолучитьТаблицуКредитныхПрограмм() 
	
Функция АвтомобильСПробегом(Автомобиль)
	ВидАвтомобиля = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля, ТекущаяДата());
	Возврат ЗначениеЗаполнено(ВидАвтомобиля) И ВидАвтомобиля = Перечисления.ВидАвтомобиля.АвтомобильСПробегом;
КонецФункции
//Бондаренко++ 20241122

 
// Обработчик события при копировании
//
Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриКопировании()

// Обработчик события перед записью
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда Возврат; КонецЕсли;
	
	//Бондаренко++ 20250503
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Возврат;		
	КонецЕсли;
	//Бондаренко-- 20250503 
	
	//Бондаренко++ 20250925
	Если РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда
		//Бондаренко++ 20260623
		Если НЕ обЗначениеНеЗаполнено(ДокументОснование) Тогда
			Если ТипЗНЧ(ДокументОснование) = Тип("ДокументСсылка.РабочийЛист") Тогда
				ЕстьДублиРЛКО = ПроверитьНаДублиРЛКО(ДокументОснование);
				Если ЕстьДублиРЛКО Тогда
 					СМГ_Сообщить("Ошибка! Есть дубли РЛКО. Текущий документ не может быть записан.",СтатусСообщения.ОченьВажное);
					Если НЕ РольДоступна("ПолныеПрава") Тогда	
						Отказ = Истина;
						Возврат;
 					КонецЕсли;
				КонецЕсли;
				//Бондаренко++ 20260820
				Если НЕ обЗначениеНеЗаполнено(ДокументОснование.Автомобиль) Тогда
					Если НЕ обЗначениеНеЗаполнено(КредитнаяПрограмма) Тогда
						Если КредитнаяПрограмма.Директовая Тогда
							Если ДокументОснование.Автомобиль.ДиректовыеПрограммыЗапрещены Тогда
								СМГ_Сообщить("Ошибка! У автомобиля установлен флаг <Директовые программы запрещены>.",СтатусСообщения.ОченьВажное);
								Если НЕ РольДоступна("ПолныеПрава") Тогда	
									Отказ = Истина;
									Возврат;
								КонецЕсли;
							КонецЕсли;
							ДиректоваяПрограммаДо_ = ДокументОснование.Автомобиль.ДиректоваяПрограммаДо;
							Если ДиректоваяПрограммаДо_ <> Дата(1,1,1) Тогда
								Если ДатаВыдачиКредита >= ДиректоваяПрограммаДо_ Тогда
									ДатаВыдачиКредита_стр     = СокрЛП(Формат(ДатаВыдачиКредита,"ДЛФ=DD"));
									ДиректоваяПрограммаДо_стр = СокрЛП(Формат(ДиректоваяПрограммаДо_,"ДЛФ=DD"));
									СМГ_Сообщить("Ошибка! <Дата выдачи кредита> = "+
												 ДатаВыдачиКредита_стр+
												 " и больше (либо равна) реквизиту <Директовая программа до> = "+
												 ДиректоваяПрограммаДо_стр+", это недопустимо.",СтатусСообщения.ОченьВажное);
									Если НЕ РольДоступна("ПолныеПрава") Тогда	
										Отказ = Истина;
										Возврат;
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				//Бондаренко-- 20260820
			КонецЕсли;
		КонецЕсли;
		//Бондаренко-- 20260623
	КонецЕсли;
	//Бондаренко-- 20250925
	
	//Бондаренко++ 20250805
	Для каждого Стр Из СтраховыеПродукты Цикл
	    Если Стр.Наличные Тогда
			Если Стр.НапрямуюВСК Тогда
			    СМГ_Сообщить("Ошибка! В строке "+Стр.НомерСтроки+" включены флаги ""Наличные"" и ""Напрямую в СК"".",СтатусСообщения.ОченьВажное);
				Отказ = Истина;
				Возврат;
			КонецЕсли;
 		КонецЕсли;
	КонецЦикла;
	//Бондаренко-- 20250805
	
	//Бондаренко++ 20241221
	КредитОдобрен = Справочники.СтатусыРабочегоЛиста.Одобрен;
	КредитВыдан = Справочники.СтатусыРабочегоЛиста.КредитВыдан;
	Если Статус = КредитОдобрен ИЛИ Статус = КредитВыдан Тогда 
		//Бондаренко++ 20260623
		Если ИспользоватьКалькулятор Тогда
 			//Бондаренко-- 20260623
			Если ЕжемесячныйПлатеж = 0 Тогда
				СМГ_Сообщить("Ошибка! Не заполнен ежемесячный платеж!",СтатусСообщения.ОченьВажное);
				Отказ = Истина;
			КонецЕсли;
			Если ПроцентнаяСтавка = 0 Тогда
				СМГ_Сообщить("Ошибка! Не заполнена процентная ставка!",СтатусСообщения.ОченьВажное);
				Отказ = Истина;
			КонецЕсли;
			Если СрокКредита = 0 Тогда
				СМГ_Сообщить("Ошибка! Не заполнен срок кредита!",СтатусСообщения.ОченьВажное);
				Отказ = Истина;
			КонецЕсли;
			//Бондаренко++ 20260623
 		КонецЕсли;	
		//Бондаренко-- 20260623
	КонецЕсли;	
	//Бондаренко-- 20241221
	
	//Бондаренко++ 20250503
	СчетчикОшибок = 0;
	СтрОшибок = "";
	
	Для каждого Стр Из Программы Цикл
		//Бондаренко++ 20250905
		//Если Стр.Статус <> Справочники.СтатусыРабочегоЛиста.КредитВыдан Тогда
		Если Стр.Статус <> Справочники.СтатусыРабочегоЛиста.КредитВыдан Тогда 
			Если Стр.Статус <> Справочники.СтатусыРабочегоЛиста.Одобрен Тогда	
		//Бондаренко++ 20250905		
				Продолжить;
			КонецЕсли; 
		КонецЕсли;
 		СчетчикОшибок = СчетчикОшибок + 1;
		Если СтрОшибок = "" Тогда
			СтрОшибок = СокрЛП(Стр.НомерСтроки);
  		Иначе
			СтрОшибок = СокрЛП(СтрОшибок)+","+Стр.НомерСтроки;
		КонецЕсли;
	КонецЦикла;
	
	Если СчетчикОшибок >= 2 Тогда
	    СМГ_Сообщить("ОШИБКА! Кредит выдан и/или одобрен в строках "+СтрОшибок,СтатусСообщения.ОченьВажное);
		Отказ = Истина;
 	КонецЕсли;
	//Бондаренко-- 20250503
	
		
	//Бондаренко++ 20250807
	Если Не Отказ Тогда
		СМГ_ПередЗаписью();
 	КонецЕсли;
 	//Бондаренко-- 20250807
 	
КонецПроцедуры // ПередЗаписью()

//Бондаренко-- 20250807
Процедура СМГ_ПередЗаписью()	
	Если Не обЗначениеНеЗаполнено(КредитнаяПрограмма) Тогда
		КредитнаяПрограмма = "";
 	КонецЕсли;

	Если Не обЗначениеНеЗаполнено(Банк) Тогда
		Банк = "";
	КонецЕсли;
	
	Если Не обЗначениеНеЗаполнено(БанкПартнер) Тогда
		БанкПартнер = "";
	КонецЕсли;
	
	Для каждого Стр Из Программы Цикл
		
		//Бондаренко++ 20250905
		//Если Стр.Статус <> Справочники.СтатусыРабочегоЛиста.КредитВыдан Тогда
		Если (Стр.Статус <> Справочники.СтатусыРабочегоЛиста.КредитВыдан) И ( Стр.Статус <> Справочники.СтатусыРабочегоЛиста.Одобрен ) Тогда	
		//Бондаренко-- 20250905	
			Продолжить;
		КонецЕсли; 	
		
		Если Статус <> Стр.Статус Тогда
			Статус = Стр.Статус;
		КонецЕсли;
		Если КредитнаяПрограмма <> Стр.КредитнаяПрограмма Тогда
			КредитнаяПрограмма = Стр.КредитнаяПрограмма;
		КонецЕсли;
		Если Банк <> Стр.КредитнаяПрограмма.Банк Тогда
			Банк = Стр.КредитнаяПрограмма.Банк;
		КонецЕсли;
		Если БанкПартнер <> Стр.КредитнаяПрограмма.БанкПартнер Тогда
			БанкПартнер = Стр.КредитнаяПрограмма.БанкПартнер;
		КонецЕсли;
		
		Прервать;
		
	КонецЦикла;
	
	//Бондаренко++ 20260429
	Если обЗначениеНеЗаполнено(ЭтотОбъект.СМ_Создатель) Тогда
 		Попытка ЭтотОбъект.СМ_Создатель = ПараметрыСеанса.Пользователь;	Исключение КонецПопытки;	
  	КонецЕсли;
	Если обЗначениеНеЗаполнено(ЭтотОбъект.СМ_ДатаСоздания) Тогда
		Попытка ЭтотОбъект.СМ_ДатаСоздания = ТекущаяДата();	Исключение КонецПопытки; 
	КонецЕсли;
	Если НЕ обЗначениеНеЗаполнено(ЭтотОбъект.ДокументОснование) Тогда
		Если ТипЗНЧ(ЭтотОбъект.ДокументОснование) = Тип("ДокументСсылка.РабочийЛист") Тогда
			Попытка ЭтотОбъект.Марка = ЭтотОбъект.ДокументОснование.Автомобиль.Модель.Марка;	Исключение КонецПопытки;	
			Попытка ЭтотОбъект.Марка = ЭтотОбъект.ДокументОснование.Модель.Марка;	Исключение КонецПопытки;
		Иначе
			ЭтотОбъект.Марка = "";
		КонецЕсли;
 	Иначе
		ЭтотОбъект.Марка = "";
 	КонецЕсли;
    //Бондаренко-- 20260429
  
КонецПроцедуры //СМГ_ПередЗаписью()
//Бондаренко-- 20250807
 
// Обработчик события при записи
//
Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	СМГ_ПриЗаписи();
КонецПроцедуры // ПриЗаписи()

// Обработчик события перед удалением
//
Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()

// Обработчик события удаления проведения
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события проведения
//
Процедура ОбработкаПроведенияСтарая(Отказ, Режим)
 	
	Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда Возврат; КонецЕсли;
	
	// Проведение по регистру сведений Журнал событий
	Если НЕ Отказ Тогда
		Если НЕ орЖурналСостояний(Ссылка, Статус) Тогда
			Отказ=Истина;
			Возврат;
		КонецЕсли; 
	КонецЕсли;	
	
	// выведем сообщения об ошибках и предупреждениях
	дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
	
КонецПроцедуры // ОбработкаПроведения()

//Бондаренко++ 20241121
Процедура СМГ_ПриЗаписи()
	
	//Бондаренко++ 20250806
	КредитВыданПоДанномуРЛКО = Ложь;
	//Бондаренко-- 20250806
	РабочийЛистОткорректирован = Ложь;
	
	Если Не обЗначениеНеЗаполнено(ДокументОснование) Тогда
		Если ТипЗНЧ(ДокументОснование) = Тип("ДокументСсылка.РабочийЛист") Тогда
			ДокОснОбъект = ДокументОснование.ПолучитьОбъект();
			Если ТипЗНЧ(Клиент) = Тип("СправочникСсылка.Контрагенты") Тогда
				Если ТипЗНЧ(ДокументОснование.Контрагент) <> Тип("СправочникСсылка.Контрагенты") Тогда
 					ДокОснОбъект.Контрагент = Клиент;
  	 				ДокОснОбъект.Лид = Клиент;
                    РабочийЛистОткорректирован = Истина;
 				КонецЕсли;			
			КонецЕсли;			
			Если СокрЛП(ДокументОснование.КонтактныйТелефон) <> СокрЛП(ПредставлениеТелефона) Тогда
 				ДокОснОбъект.КонтактныйТелефон = СокрЛП(ПредставлениеТелефона);
				ДокОснОбъект.ПредставлениеТелефонаЛида = СокрЛП(ПредставлениеТелефона);
                РабочийЛистОткорректирован = Истина;
			КонецЕсли;
			//Бондаренко++ 20250504 
			
			//Бондаренко++ 20251127
			Если ЕстьДиректоваяПрограмма = Перечисления.ВариантыОтветов.Да Тогда
				Если Не обЗначениеНеЗаполнено(ДокОснОбъект.Автомобиль) Тогда
					Если ДокОснОбъект.Автомобиль.Модель.Марка = Справочники.Марка.CHERY ИЛИ
						ДокОснОбъект.Автомобиль.Модель.Марка = Справочники.Марка.TENET  ИЛИ
						ДокОснОбъект.Автомобиль.Модель.Марка = Справочники.Марка.EXEED ИЛИ
						ДокОснОбъект.Автомобиль.Модель.Марка = Справочники.Марка.OMODA ИЛИ
						ДокОснОбъект.Автомобиль.Модель.Марка = Справочники.Марка.JAECOO Тогда
						Если ДокОснОбъект.ЕстьДиректоваяПрограмма=Ложь Тогда
							ДокОснОбъект.ЕстьДиректоваяПрограмма=Истина;
							РабочийЛистОткорректирован = Истина;
						КонецЕсли;
					Иначе	
						Если ДокОснОбъект.ЕстьДиректоваяПрограмма=Истина Тогда
							ДокОснОбъект.ЕстьДиректоваяПрограмма=Ложь;
							РабочийЛистОткорректирован = Истина;
						КонецЕсли;					
					КонецЕсли;
				Иначе	
					Если ДокОснОбъект.ЕстьДиректоваяПрограмма=Истина Тогда
						ДокОснОбъект.ЕстьДиректоваяПрограмма=Ложь;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;				
				КонецЕсли;	
			Иначе	
				Если ДокОснОбъект.ЕстьДиректоваяПрограмма=Истина Тогда
					ДокОснОбъект.ЕстьДиректоваяПрограмма=Ложь;
					РабочийЛистОткорректирован = Истина;
				КонецЕсли;
			КонецЕсли;
			//Бондаренко-- 20251127 
  			
			//Бондаренко++ 20250806
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Статус",Справочники.СтатусыРабочегоЛиста.КредитВыдан);
			НайдСтроки = Программы.НайтиСтроки(ПараметрыОтбора);
			Если НайдСтроки.Количество() = 1 Тогда
 				КредитВыданПоДанномуРЛКО = Истина;
 			КонецЕсли;
 			//Бондаренко-- 20250806
			
			//Бондаренко++ 20250806
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Статус",Справочники.СтатусыРабочегоЛиста.Одобрен);
			НайдСтроки = Программы.НайтиСтроки(ПараметрыОтбора);
			Если НайдСтроки.Количество() = 1 Тогда
 				КредитВыданПоДанномуРЛКО = Истина;
 			КонецЕсли;
 			//Бондаренко-- 20250806
			
			Если КредитВыданПоДанномуРЛКО Тогда
				Для каждого Стр Из Программы Цикл
					//Бондаренко++ 20250905
					//Если Стр.Статус <> Справочники.СтатусыРабочегоЛиста.КредитВыдан Тогда
					Если Стр.Статус <> Справочники.СтатусыРабочегоЛиста.КредитВыдан И Стр.Статус <> Справочники.СтатусыРабочегоЛиста.Одобрен Тогда	
					//Бондаренко-- 20250905	
 						Продолжить;
					КонецЕсли;
 					Если ДокОснОбъект.КредитнаяПрограмма <> Стр.КредитнаяПрограмма Тогда
				    	ДокОснОбъект.КредитнаяПрограмма = Стр.КредитнаяПрограмма;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
 					Если ДокОснОбъект.ПроцентАВЛизинг <> Стр.КредитнаяПрограмма.ПроцентКВ Тогда
				    	ДокОснОбъект.ПроцентАВЛизинг = Стр.КредитнаяПрограмма.ПроцентКВ;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
  					Если ДокОснОбъект.Партнер <> Стр.КредитнаяПрограмма.БанкПартнер Тогда
						ДокОснОбъект.Партнер = Стр.КредитнаяПрограмма.БанкПартнер;
						РабочийЛистОткорректирован = Истина;
 					КонецЕсли;
					Если ДокОснОбъект.БанкЛК <> Стр.КредитнаяПрограмма.БанкПартнер.БанкКонтрагент Тогда 
						ДокОснОбъект.БанкЛК = Стр.КредитнаяПрограмма.БанкПартнер.БанкКонтрагент;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					Если ДокОснОбъект.СуммаПредоплаты <> ПервоначальныйВзнос Тогда 
						ДокОснОбъект.СуммаПредоплаты = ПервоначальныйВзнос; 
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					Если ДокОснОбъект.ДатаПервоначальногоВзноса <> ДатаПервоначальногоВзноса Тогда 
						ДокОснОбъект.ДатаПервоначальногоВзноса = ДатаПервоначальногоВзноса;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					//Бондаренко++ 20241220
					Если ДокОснОбъект.ВидОплаты <> Перечисления.ВидыОплаты.Кредит Тогда
						ДокОснОбъект.ВидОплаты = Перечисления.ВидыОплаты.Кредит;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					
					//Бондаренко++ 20260718
					Если Стр.КредитнаяПрограмма.ВариантРассчетаКВ = Перечисления.ВариантыРассчетаКВ.ОтСуммыКредита Тогда
					//Бондаренко-- 20260718
						Если ДокОснОбъект.СчетИлиАвтоВКредит <> СуммаКредита Тогда
							ДокОснОбъект.СчетИлиАвтоВКредит = СуммаКредита;
							РабочийЛистОткорректирован = Истина;
						КонецЕсли;
 					//Бондаренко++ 20260718
					Иначе
						Если ДокОснОбъект.СчетИлиАвтоВКредит <> СуммаСчетаНаАвто Тогда
							ДокОснОбъект.СчетИлиАвтоВКредит = СуммаСчетаНаАвто;
							РабочийЛистОткорректирован = Истина;
						КонецЕсли;
					КонецЕсли;
 					//Бондаренко-- 20260718
					
					////Бондаренко++ 20260722
					//Если ДокОснОбъект.КВКредит <> Стр.КредитнаяПрограмма.ПроцентКВ * ДокОснОбъект.СчетИлиАвтоВКредит / 100 Тогда
					//	ДокОснОбъект.КВКредит = Стр.КредитнаяПрограмма.ПроцентКВ * ДокОснОбъект.СчетИлиАвтоВКредит / 100;
					//	РабочийЛистОткорректирован = Истина;
					//КонецЕсли;
					Если ДокОснОбъект.КВКредит <> Стр.КВ Тогда
						ДокОснОбъект.КВКредит = Стр.КВ;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					Если ДокОснОбъект.ХранимаяБазаРасчета <> ХранимаяБазаРасчета Тогда
						ДокОснОбъект.ХранимаяБазаРасчета = ХранимаяБазаРасчета;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					//Бондаренко-- 20260722
					
  					Если ДокОснОбъект.ЕжемесячныйПлатеж <> ЕжемесячныйПлатеж Тогда
						ДокОснОбъект.ЕжемесячныйПлатеж = ЕжемесячныйПлатеж;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					Если ДокОснОбъект.СуммаПредоплаты <> ПервоначальныйВзнос Тогда
						ДокОснОбъект.СуммаПредоплаты = ПервоначальныйВзнос;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					Если ДокОснОбъект.ГодоваяСтавка <> ПроцентнаяСтавка Тогда
						ДокОснОбъект.ГодоваяСтавка = ПроцентнаяСтавка;
						РабочийЛистОткорректирован = Истина;
					КонецЕсли;
					Если ДокОснОбъект.СрокКредита <> СрокКредита Тогда
						ДокОснОбъект.СрокКредита = СрокКредита;
						РабочийЛистОткорректирован = Истина;
 					КонецЕсли;
					//Бондаренко-- 20241220
				КонецЦикла;
				//Бондаренко++ 20250513
				Если НЕ обЗначениеНеЗаполнено(ДокОснОбъект.ПрограммаКАСКО) Тогда
					ДокОснОбъект.КАСКО = Ложь;
					ДокОснОбъект.ПрограммаКАСКО="";
					ДокОснОбъект.СуммаКаско=0;
					ДокОснОбъект.НаличныеПрограммаКАСКО=Ложь;
					ДокОснОбъект.КВКаско=0;
					ДокОснОбъект.СвязанСКредитКАСКО=Ложь;
					//Бондаренко++ 20250724
 					ДокОснОбъект.СтраховаяКомпанияКАСКО = "";
 					ДокОснОбъект.АгентПодразделениеКАСКО = "";
 					//Бондаренко-- 20250724
					РабочийЛистОткорректирован=Истина;
 				КонецЕсли;
				Если НЕ обЗначениеНеЗаполнено(ДокОснОбъект.ПрограммаОСАГО) Тогда
 					ДокОснОбъект.ПрограммаОСАГО="";
					ДокОснОбъект.СуммаОСАГО=0;
					ДокОснОбъект.НаличныеПрограммаОСАГО=Ложь;
					ДокОснОбъект.КВосаго=0;
					ДокОснОбъект.СвязанСКредитОСАГО=Ложь;
					//Бондаренко++ 20250724
 					ДокОснОбъект.СтраховаяКомпанияОСАГО = "";
 					ДокОснОбъект.АгентПодразделениеОСАГО = "";
 					//Бондаренко-- 20250724
					РабочийЛистОткорректирован=Истина;
				КонецЕсли;
				Если НЕ обЗначениеНеЗаполнено(ДокОснОбъект.ПрограммаСтрахованиеЖизни) Тогда
					ДокОснОбъект.ПрограммаСтрахованиеЖизни = "";
 					ДокОснОбъект.СуммаСтрахованиеЖизни=0;
					ДокОснОбъект.НаличныеПрограммаСЖ=Ложь;
					ДокОснОбъект.КВСЖ=0;
					ДокОснОбъект.СвязанСКредитСЖ=Ложь;
					//Бондаренко++ 20250724
 					ДокОснОбъект.СтраховаяКомпанияСЖ = "";
 					ДокОснОбъект.СтраховаяКомпанияСЖ = "";
 					//Бондаренко-- 20250724
					РабочийЛистОткорректирован=Истина;
 				КонецЕсли;
 				Если ДокОснОбъект.ИныеСтраховыеПродукты.Количество() > 0 Тогда
					ДокОснОбъект.ИныеСтраховыеПродукты.Очистить();
				КонецЕсли;
				//Бондаренко-- 20250513
				
				//Бондаренко++ 20260701
				ЭтоПервоеКаско = Истина;
				//Бондаренко-- 20260701
				
				Для каждого Стр Из СтраховыеПродукты Цикл
					Если обЗначениеНеЗаполнено(Стр.ПрограммаСтрахования) Тогда
						Продолжить;
					КонецЕсли;
					
					//Бондаренко++ 20260701
					//Если Стр.ПрограммаСтрахования.ВидСтрахования = Перечисления.ВидыСтрахования.КАСКО Тогда
					Если Стр.ПрограммаСтрахования.ВидСтрахования = Перечисления.ВидыСтрахования.КАСКО И ЭтоПервоеКаско Тогда	
						ЭтоПервоеКаско = Ложь;
						//Бондаренко-- 20260701
						
						Если НЕ ДокОснОбъект.КАСКО Тогда
							ДокОснОбъект.КАСКО = Истина;
 							РабочийЛистОткорректирован = Истина;						
						КонецЕсли;
 						Если ДокОснОбъект.ПрограммаКАСКО <> Стр.ПрограммаСтрахования Тогда
							ДокОснОбъект.ПрограммаКАСКО = Стр.ПрограммаСтрахования;
							РабочийЛистОткорректирован = Истина;
						КонецЕсли;	
						Если ДокОснОбъект.СуммаКаско <> Стр.СуммаСтрахования Тогда
 							ДокОснОбъект.СуммаКаско = Стр.СуммаСтрахования;
							РабочийЛистОткорректирован = Истина;
						КонецЕсли;
						Если ДокОснОбъект.НаличныеПрограммаКАСКО <> Стр.Наличные Тогда
							ДокОснОбъект.НаличныеПрограммаКАСКО = Стр.Наличные;
							РабочийЛистОткорректирован = Истина;
						КонецЕсли;
						Если ДокОснОбъект.КВКаско <> Стр.КВ Тогда
							ДокОснОбъект.КВКаско = Стр.КВ;
							РабочийЛистОткорректирован = Истина;
						КонецЕсли;
						Если НЕ ДокОснОбъект.СвязанСКредитКАСКО Тогда
							ДокОснОбъект.СвязанСКредитКАСКО = Истина;
							РабочийЛистОткорректирован = Истина;
						КонецЕсли;
						//Бондаренко++ 20250724
						Если ДокОснОбъект.СтраховаяКомпанияКАСКО <> Стр.СтраховаяКомпания Тогда
							ДокОснОбъект.СтраховаяКомпанияКАСКО = Стр.СтраховаяКомпания;
							РабочийЛистОткорректирован = Истина;
 						КонецЕсли;
						Если ДокОснОбъект.АгентПодразделениеКАСКО <> Стр.АгентПодразделение Тогда 
							ДокОснОбъект.АгентПодразделениеКАСКО = Стр.АгентПодразделение;
							РабочийЛистОткорректирован = Истина;
						КонецЕсли;
						Попытка
							  ДокОснОбъект.ДоговорКвКАСКО = ДокОснОбъект.НайтиСоздатьДоговорПрочий(ДокОснОбъект.АгентПодразделениеКАСКО,ДокОснОбъект.СтраховаяКомпанияКАСКО.БанкКонтрагент);
							  РабочийЛистОткорректирован = Истина;
 						Исключение
 						КонецПопытки;
						//Бондаренко-- 20250724	
					ИначеЕсли Стр.ПрограммаСтрахования.ВидСтрахования = Перечисления.ВидыСтрахования.ОСАГО Тогда
						Если НЕ ДокОснОбъект.ОСАГО Тогда
							ДокОснОбъект.ОСАГО = Истина;
							РабочийЛистОткорректирован = Истина;
						КонецЕсли;
						Если ДокОснОбъект.ПрограммаОСАГО <> Стр.ПрограммаСтрахования Тогда
 							ДокОснОбъект.ПрограммаОСАГО = Стр.ПрограммаСтрахования;
							РабочийЛистОткорректирован = Истина;
						КонецЕсли;
						Если ДокОснОбъект.СуммаОсаго <> Стр.СуммаСтрахования Тогда
							ДокОснОбъект.СуммаОсаго = Стр.СуммаСтрахования;
							РабочийЛистОткорректирован = Истина;
						КонецЕсли;
						Если ДокОснОбъект.НаличныеПрограммаОСАГО <> Стр.Наличные Тогда
							ДокОснОбъект.НаличныеПрограммаОСАГО = Стр.Наличные;
							РабочийЛистОткорректирован = Истина;
						КонецЕсли;
						Если ДокОснОбъект.КВОсаго <> Стр.КВ Тогда
							ДокОснОбъект.КВОсаго = Стр.КВ;
							РабочийЛистОткорректирован = Истина;
						КонецЕсли;
						Если НЕ ДокОснОбъект.СвязанСКредитОСАГО Тогда
							ДокОснОбъект.СвязанСКредитОСАГО = Истина;
							РабочийЛистОткорректирован = Истина;
						КонецЕсли;
						//Бондаренко++ 20250724
						Если ДокОснОбъект.СтраховаяКомпанияОСАГО <> Стр.СтраховаяКомпания Тогда
							ДокОснОбъект.СтраховаяКомпанияОСАГО = Стр.СтраховаяКомпания;
							РабочийЛистОткорректирован = Истина;
 						КонецЕсли;
						Если ДокОснОбъект.АгентПодразделениеОСАГО <> Стр.АгентПодразделение Тогда 
							ДокОснОбъект.АгентПодразделениеОСАГО = Стр.АгентПодразделение;
							РабочийЛистОткорректирован = Истина;
						КонецЕсли;
						Попытка
							  ДокОснОбъект.ДоговорКвОСАГО = ДокОснОбъект.НайтиСоздатьДоговорПрочий(ДокОснОбъект.АгентПодразделениеОСАГО,ДокОснОбъект.СтраховаяКомпанияОСАГО.БанкКонтрагент);
							  РабочийЛистОткорректирован = Истина;
 						Исключение
 						КонецПопытки;
						//Бондаренко-- 20250724	
					ИначеЕсли Стр.ПрограммаСтрахования.ВидСтрахования = Перечисления.ВидыСтрахования.СтрахованиеЖизни Тогда  
						Если ДокОснОбъект.ПрограммаСтрахованиеЖизни <> Стр.ПрограммаСтрахования Тогда
	 						ДокОснОбъект.ПрограммаСтрахованиеЖизни = Стр.ПрограммаСтрахования;
							РабочийЛистОткорректирован = Истина;
						КонецЕсли;
						Если ДокОснОбъект.СуммаСтрахованиеЖизни <> Стр.СуммаСтрахования Тогда
 							ДокОснОбъект.СуммаСтрахованиеЖизни = Стр.СуммаСтрахования;
							РабочийЛистОткорректирован = Истина;
						КонецЕсли;
						Если ДокОснОбъект.НаличныеПрограммаСЖ <> Стр.Наличные Тогда
 							ДокОснОбъект.НаличныеПрограммаСЖ = Стр.Наличные;
							РабочийЛистОткорректирован = Истина;
						КонецЕсли;
                        Если ДокОснОбъект.КВСЖ <> Стр.КВ Тогда
							ДокОснОбъект.КВСЖ = Стр.КВ;
							РабочийЛистОткорректирован = Истина;
						КонецЕсли;
						Если НЕ ДокОснОбъект.СвязанСКредитСЖ Тогда
							ДокОснОбъект.СвязанСКредитСЖ = Истина;
							РабочийЛистОткорректирован = Истина;
						КонецЕсли;
						//Бондаренко++ 20250724
						Если ДокОснОбъект.СтраховаяКомпанияСЖ <> Стр.СтраховаяКомпания Тогда
							ДокОснОбъект.СтраховаяКомпанияСЖ = Стр.СтраховаяКомпания;
							РабочийЛистОткорректирован = Истина;
 						КонецЕсли;
						Если ДокОснОбъект.АгентПодразделениеСЖ <> Стр.АгентПодразделение Тогда 
							ДокОснОбъект.АгентПодразделениеСЖ = Стр.АгентПодразделение;
							РабочийЛистОткорректирован = Истина;
						КонецЕсли;
						Попытка
							  ДокОснОбъект.ДоговорКвСЖ = ДокОснОбъект.НайтиСоздатьДоговорПрочий(ДокОснОбъект.АгентПодразделениеСЖ,ДокОснОбъект.СтраховаяКомпанияСЖ.БанкКонтрагент);
							  РабочийЛистОткорректирован = Истина;
 						Исключение
 						КонецПопытки;
						//Бондаренко-- 20250724	
					Иначе
						ИнойСтрахПродукт = ДокОснОбъект.ИныеСтраховыеПродукты.Добавить();
						ИнойСтрахПродукт.ПрограммаСтрахования = Стр.ПрограммаСтрахования;
						ИнойСтрахПродукт.СуммаСтрахования = Стр.СуммаСтрахования;
						ИнойСтрахПродукт.Наличные = Стр.Наличные;
						ИнойСтрахПродукт.КВ = Стр.КВ;
						ИнойСтрахПродукт.СвязанСКредитом = Истина;
						//Бондаренко++ 20250724	
						ИнойСтрахПродукт.СтраховаяКомпания = Стр.СтраховаяКомпания;
						ИнойСтрахПродукт.АгентПодразделение = Стр.АгентПодразделение;
						Попытка
							ИнойСтрахПродукт.ДоговорКв = ДокОснОбъект.НайтиСоздатьДоговорПрочий(Стр.АгентПодразделение,Стр.СтраховаяКомпания.БанкКонтрагент);
 						Исключение
 						КонецПопытки;
  						//Бондаренко-- 20250724	
						РабочийЛистОткорректирован = Истина;
 					КонецЕсли;
				КонецЦикла;

				//Бондаренко++ 20250827
				Если ВариантБрокерФинанс = Перечисления.ВариантыОтветов.Да Тогда
					Если ДокОснОбъект.ВариантБрокерФинанс <> Перечисления.ВариантыОтветов.Да Тогда
					     ДокОснОбъект.ВариантБрокерФинанс = Перечисления.ВариантыОтветов.Да;
						 РабочийЛистОткорректирован = Истина;
					 КонецЕсли;
					 Если ДокОснОбъект.ПрограммаБрокерФинанс <> ПрограммаБрокерФинанс  Тогда
						 ДокОснОбъект.ПрограммаБрокерФинанс = ПрограммаБрокерФинанс;
						 РабочийЛистОткорректирован = Истина;
					 КонецЕсли;
					 Если ДокОснОбъект.КомпенсацияБрокерФинанс <> КомпенсацияБрокерФинанс  Тогда
						 ДокОснОбъект.КомпенсацияБрокерФинанс = КомпенсацияБрокерФинанс;
						 РабочийЛистОткорректирован = Истина;
					 КонецЕсли;
				ИначеЕсли ВариантБрокерФинанс = Перечисления.ВариантыОтветов.Нет Тогда
					Если ДокОснОбъект.ВариантБрокерФинанс <> Перечисления.ВариантыОтветов.Нет Тогда
					     ДокОснОбъект.ВариантБрокерФинанс = Перечисления.ВариантыОтветов.Нет;
						 РабочийЛистОткорректирован = Истина;
					 КонецЕсли;
					 Если Не обЗначениеНеЗаполнено(ДокОснОбъект.ПрограммаБрокерФинанс)  Тогда
						 ДокОснОбъект.ПрограммаБрокерФинанс = "";
						 РабочийЛистОткорректирован = Истина;
					 КонецЕсли;
					 Если ДокОснОбъект.КомпенсацияБрокерФинанс <> 0 Тогда
						 ДокОснОбъект.КомпенсацияБрокерФинанс = 0;
						 РабочийЛистОткорректирован = Истина;
					 КонецЕсли;
 				КонецЕсли;
 				//Бондаренко-- 20250827
				
 			КонецЕсли;
			//Бондаренко-- 20241218
  		КонецЕсли;
	КонецЕсли;
	
	//Бондаренко++ 20260805
  	Если ДокОснОбъект.ВидОплаты = Перечисления.ВидыОплаты.Кредит Тогда
		Если ДокОснОбъект.СчетИлиАвтоВКредит <>  ( ДокОснОбъект.СуммаПродажи - ДокОснОбъект.СуммаПредоплаты ) Тогда
			ДокОснОбъект.СчетИлиАвтоВКредит = ДокОснОбъект.СуммаПродажи - ДокОснОбъект.СуммаПредоплаты;	
			РабочийЛистОткорректирован = Истина;
		КонецЕсли;		   
		Если Не ДокОснОбъект.Кредит Тогда
			ДокОснОбъект.Кредит = Истина;
			РабочийЛистОткорректирован = Истина;
		КонецЕсли;
	Иначе	
		Если ДокОснОбъект.СчетИлиАвтоВКредит <> 0 Тогда
			ДокОснОбъект.СчетИлиАвтоВКредит = 0;
			РабочийЛистОткорректирован = Истина;
		КонецЕсли;
		Если ДокОснОбъект.Кредит Тогда
			ДокОснОбъект.Кредит = Ложь;
			РабочийЛистОткорректирован = Истина;
		КонецЕсли;	
	КонецЕсли;
	//Бондаренко++ 20260805
  	
	Если РабочийЛистОткорректирован Тогда
 			Попытка
				ДокОснОбъект.Записать(РежимЗаписиДокумента.Запись);
				
				//Бондаренко++ 20250724	
				Если СообщатьОбИзмененииРЛ Тогда	
				//Бондаренко-- 20250806		
					СМГ_Сообщить("Внимание! Откорректирован <<"+ДокОснОбъект+">>",СтатусСообщения.Информация);
				//Бондаренко++ 20250806	
				КонецЕсли;
				//Бондаренко-- 20250724
 				 
			Исключение
				СМГ_Сообщить("ОШИБКА! Не удалось откорректировать <<"+ДокОснОбъект+">>",СтатусСообщения.ОченьВажное);
			КонецПопытки;
 	
	КонецЕсли;
	
КонецПроцедуры
//Бондаренко-- 20241121

//Бондаренко++ 20241127
Процедура ОбработкаПроведения(Отказ, Режим)
 	
	Движения.КомиссионныеВознаграждения.Очистить();
	
	ДосрочноеПогашение = Ложь;
	
	Если ХозОперация = Справочники.ХозОперации.РабочийЛистКредитногоОтдела Тогда
		Попытка
			АвтоТек = ДокументОснование.Автомобиль;
 		Исключение
			АвтоТек = "";
		КонецПопытки; 
	ИначеЕсли ХозОперация = Справочники.ХозОперации.РабочийЛистКредитногоОтделаДосрочноеПогашение Тогда	
		Попытка
			АвтоТек = ДокументОснование.ДокументОснование.Автомобиль;
 		Исключение
			АвтоТек = "";
		КонецПопытки;
 		ДосрочноеПогашение = Истина;
	Иначе
		АвтоТек = "";
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(АвтоТек) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Стр Из Программы Цикл
		
		Если Стр.Статус <> Справочники.СтатусыРабочегоЛиста.Одобрен Тогда
			Если Стр.Статус <> Справочники.СтатусыРабочегоЛиста.КредитВыдан Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Движение = Движения.КомиссионныеВознаграждения.Добавить();
  		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
 		Движение.Период = Дата;
		Движение.Контрагент = Стр.КредитнаяПрограмма.БанкПартнер.БанкКонтрагент;
		Движение.Автомобиль = АвтоТек;
		Движение.Клиент = Клиент;
		Движение.КредитнаяПрограмма = Стр.КредитнаяПрограмма;
		Движение.Сумма = Стр.КВ;
		
		//Бондаренко++ 20240527
		Прервать;
		//Бондаренко-- 20240527
		
	КонецЦикла;
   
КонецПроцедуры
//Бондаренко++ 20241127

//Бондаренко++ 20250507
Функция РассчитатьКВ(КредитнаяПрограмма,УменьшениеПроцентаКВ) Экспорт
	
	КВ = 0;
	
	Если КредитнаяПрограмма.ВариантРассчетаКВ = Перечисления.ВариантыРассчетаКВ.ОтСуммыКредита Тогда
		БазаРасчета = СуммаКредита;
 		Если СообщатьОрасчетеКВ Тогда
			СМГ_Сообщить("1). Расчёт от суммы кредита -> СуммаКредита ("+СуммаКредита+"). БазаРасчета = "+БазаРасчета);
		КонецЕсли;
 		КВ = БазаРасчета * ( КредитнаяПрограмма.ПроцентКВ - УменьшениеПроцентаКВ) / 100;
	ИначеЕсли КредитнаяПрограмма.ВариантРассчетаКВ = Перечисления.ВариантыРассчетаКВ.ОтСтоимостиАвтомобиля Тогда
		Если Госпрограмма Тогда
			БазаРасчета = ЧистаяСтоимостьАвтомобиля * 0.8  - ПервоначальныйВзнос;
 			Если СообщатьОрасчетеКВ Тогда
 				СМГ_Сообщить("2б). Расчёт от чистой стоимости автомобиля * 0.8 => ЧистаяСтоимостьАвтомобиля ("+ЧистаяСтоимостьАвтомобиля+" / ЧистаяСтоимостьАвтомобиля * 0.8 ("+СокрЛП(ЧистаяСтоимостьАвтомобиля*0.8)+") - ПервоначальныйВзнос("+ПервоначальныйВзнос+"). БазаРасчета = "+БазаРасчета);
			КонецЕсли;
 		ИначеЕсли СемейнаяГоспрограмма Тогда
			БазаРасчета = ЧистаяСтоимостьАвтомобиля * 0.9  - ПервоначальныйВзнос;
 			Если СообщатьОрасчетеКВ Тогда
				СМГ_Сообщить("2в). Расчёт от чистой стоимости автомобиля * 0.9 => ЧистаяСтоимостьАвтомобиля ("+ЧистаяСтоимостьАвтомобиля+" / ЧистаяСтоимостьАвтомобиля * 0.9 ("+СокрЛП(ЧистаяСтоимостьАвтомобиля*0.9)+") - ПервоначальныйВзнос("+ПервоначальныйВзнос+"). БазаРасчета = "+БазаРасчета);
			КонецЕсли;
  		Иначе
			БазаРасчета = ЧистаяСтоимостьАвтомобиля  - ПервоначальныйВзнос;
 			Если СообщатьОрасчетеКВ Тогда
				СМГ_Сообщить("2а). Расчёт от чистой стоимости автомобиля => ЧистаяСтоимостьАвтомобиля ("+ЧистаяСтоимостьАвтомобиля+") - ПервоначальныйВзнос("+ПервоначальныйВзнос+"). БазаРасчета = "+БазаРасчета);
			КонецЕсли;
		КонецЕсли;
		КВ = БазаРасчета * ( КредитнаяПрограмма.ПроцентКВ - УменьшениеПроцентаКВ) / 100;
	Иначе
		КВ = 0;
	КонецЕсли;
	
	//Бондаренко++ 20260722
	Если ХранимаяБазаРасчета <> БазаРасчета Тогда
		ХранимаяБазаРасчета = БазаРасчета;
 	КонецЕсли;
	//Бондаренко-- 20260722
	
	Возврат КВ;

КонецФункции // РассчитатьКВ(КредитнаяПрограмма)

Процедура Пересчет() Экспорт
	//БылПеречет = Ложь;
	СуммаСтраховок_ = 0;
	Для каждого Стр Из СтраховыеПродукты Цикл
		Если Стр.Наличные Тогда
			Продолжить;
		КонецЕсли;
		//Бондаренко++ 20250805
		Если Стр.НапрямуюВСК Тогда
			Продолжить;
		КонецЕсли;
		//Бондаренко-- 20250805
		СуммаСтраховок_ =    СуммаСтраховок_ + Стр.СуммаСтрахования;
	КонецЦикла;
	Если СуммаСтраховыхПродуктовВКредит <> СуммаСтраховок_ Тогда
		СуммаСтраховыхПродуктовВКредит = СуммаСтраховок_;
		//БылПеречет = Истина;
	КонецЕсли;
	//Бондаренко++ 20260619
	//СтоимостьАвтомобиля_ = ЧистаяСтоимостьАвтомобиля + СуммаПродуктовБанка + СуммаСтраховыхПродуктовВКредит;
	СтоимостьАвтомобиля_ = ЧистаяСтоимостьАвтомобиля + СуммаПродуктовБанка + СуммаСтраховыхПродуктовВКредит + СуммаДопоборудования;
	//Бондаренко-- 20260619
	Если СтоимостьАвтомобиля <> СтоимостьАвтомобиля_ Тогда
		СтоимостьАвтомобиля = СтоимостьАвтомобиля_;
	КонецЕсли;
	//Бондаренко++ 20260724
	//Бондаренко++ 20260725
	Если ИспользоватьКалькулятор Тогда
		СуммаКредита = 0;		
		ЕжемесячныйПлатеж = 0;
	Иначе
		СуммаКредита = СтоимостьАвтомобиля-ПервоначальныйВзнос;			
		ЕжемесячныйПлатеж = 0;
	КонецЕсли;
	
	//Бондаренко++ 20260728
	Если Не ИспользоватьКалькулятор Тогда
		Если Не обЗначениеНеЗаполнено(ЧистаяСтоимостьАвтомобиля) Тогда
			СуммаСчетаНаАвто = ЧистаяСтоимостьАвтомобиля-ПервоначальныйВзнос; 
		КонецЕсли;
	КонецЕсли;
  		//Бондаренко-- 20260728
	
  	Для каждого Стр Из Программы Цикл
	    Если Стр.Статус <> Справочники.СтатусыРабочегоЛиста.Одобрен Тогда
			Если Стр.Статус <> Справочники.СтатусыРабочегоЛиста.КредитВыдан Тогда
				Продолжить;
		    КонецЕсли;
		КонецЕсли;
		ОбработкаРеквизита("Статус",Стр,,);	
	КонецЦикла;	
	//Бондаренко-- 20260725
КонецПроцедуры
//Бондаренко-- 20250507 

//Бондаренко++ 20250821 
Функция ПолучитьКомпенсациюБрокерФинанс(Модель,ПрограммаБФ)
	
	КомпБФ_ = 0; 
 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоказателиМаркетинговыхПрограммСрезПоследних.МаркетинговаяПрограмма КАК МаркетинговаяПрограмма,
		|	ПоказателиМаркетинговыхПрограммСрезПоследних.Модель КАК Модель,
		|	ПоказателиМаркетинговыхПрограммСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
		|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерБонуса+ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерБонусаРетро КАК СуммаБонуса
   		|ИЗ
		|	РегистрСведений.ПоказателиМаркетинговыхПрограмм.СрезПоследних КАК ПоказателиМаркетинговыхПрограммСрезПоследних
		|ГДЕ
		|	ПоказателиМаркетинговыхПрограммСрезПоследних.МаркетинговаяПрограмма = &МаркетинговаяПрограмма
		|	И ПоказателиМаркетинговыхПрограммСрезПоследних.Модель = &Модель";
	
 	Запрос.УстановитьПараметр("МаркетинговаяПрограмма", ПрограммаБФ);
	Запрос.УстановитьПараметр("Модель", Модель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		КомпБФ_ = ВыборкаДетальныеЗаписи.СуммаБонуса;
 	КонецЦикла;
	
	Возврат КомпБФ_;
    
КонецФункции
//Бондаренко-- 20250821  

//Бондаренко++ 20250925
Функция ПроверитьНаДублиРЛКО(ДокОсн)

	Фл_ = Ложь;

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РабочийЛистКредитногоОтдела.Ссылка КАК РЛКО,
	               |	РабочийЛистКредитногоОтдела.ДокументОснование КАК ДокументОснование,
	               |	РабочийЛистКредитногоОтдела.ПометкаУдаления КАК ПометкаУдаления
	               |ИЗ
	               |	Документ.РабочийЛистКредитногоОтдела КАК РабочийЛистКредитногоОтдела
	               |ГДЕ
	               |	РабочийЛистКредитногоОтдела.ДокументОснование = &ДокументОснование
	               |	И НЕ РабочийЛистКредитногоОтдела.Ссылка = &Ссылка
	               |	И НЕ РабочийЛистКредитногоОтдела.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДокументОснование",ДокОсн);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для каждого Стр Из ТЗ Цикл
		СМГ_Сообщить("ОШИБКА! Есть подчиненный не помеченный на удаление документ "+Стр.РЛКО,СтатусСообщения.ОченьВажное);
		Фл_ = Истина;
 	КонецЦикла;
	
	Возврат Фл_;
 		 
КонецФункции // ПроверитьНаДублиРЛКО(ДокОсн)
//Бондаренко-- 20250925		


Функция ПолучитьТаблицуКредитныхПрограммПоПартнеру(Авто, Модель, БанкПартнер) Экспорт
	
	    ТЗ = Новый ТаблицаЗначений();
	                                                     
		Запрос = Новый Запрос;
		
		Если НЕ обЗначениеНеЗаполнено(Авто) Тогда
			Если АвтомобильСПробегом(Авто) Тогда
 				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	КредитныеПрограммы.Ссылка КАК КредитнаяПрограмма,
				               |	КредитныеПрограммы.ПометкаУдаления КАК ПометкаУдаления,
				               |	КредитныеПрограммы.БуВсе КАК БуВсе,
				               |	КредитныеПрограммы.ЭтоГруппа КАК ЭтоГруппа,
				               |	КредитныеПрограммы.Недействующая КАК Недействующая,
				               |	КредитныеПрограммы.БанкПартнер КАК БанкПартнер,
				               |	КредитныеПрограммы.Директовая КАК Директовая
				               |ИЗ
				               |	Справочник.КредитныеПрограммы КАК КредитныеПрограммы
				               |ГДЕ
				               |	НЕ КредитныеПрограммы.ПометкаУдаления
				               |	И НЕ КредитныеПрограммы.ЭтоГруппа
				               |	И НЕ КредитныеПрограммы.Недействующая
				               |	И КредитныеПрограммы.БуВсе
				               |	И КредитныеПрограммы.БанкПартнер = &БанкПартнер";
				
					Запрос.УстановитьПараметр("БанкПартнер",БанкПартнер);
				
					ТЗ = Запрос.Выполнить().Выгрузить();
			Иначе
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	КредитныеПрограммыМарки.Ссылка КАК КредитнаяПрограмма,
					               |	КредитныеПрограммыМарки.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
					               |	КредитныеПрограммыМарки.Ссылка.ЭтоГруппа КАК ЭтоГруппа,
					               |	КредитныеПрограммыМарки.Ссылка.Недействующая КАК Недействующая,
					               |	КредитныеПрограммыМарки.Ссылка.НовыеОпределенныхМарок КАК Крыж,
					               |	КредитныеПрограммыМарки.МаркаАвтомобиля.Ссылка КАК Марка,
					               |	КредитныеПрограммыМарки.Ссылка.БанкПартнер КАК БанкПартнер,
					               |	КредитныеПрограммыМарки.Ссылка.Директовая КАК Директовая
					               |ИЗ
					               |	Справочник.КредитныеПрограммы.Марки КАК КредитныеПрограммыМарки
					               |ГДЕ
					               |	НЕ КредитныеПрограммыМарки.Ссылка.ПометкаУдаления
					               |	И НЕ КредитныеПрограммыМарки.Ссылка.ЭтоГруппа
					               |	И НЕ КредитныеПрограммыМарки.Ссылка.Недействующая
					               |	И КредитныеПрограммыМарки.Ссылка.НовыеОпределенныхМарок
					               |	И КредитныеПрограммыМарки.МаркаАвтомобиля.Ссылка = &Марка
					               |	И КредитныеПрограммыМарки.Ссылка.БанкПартнер = &БанкПартнер
					               |
					               |ОБЪЕДИНИТЬ ВСЕ
					               |
					               |ВЫБРАТЬ
					               |	КредитныеПрограммыМаркиВсе.Ссылка,
					               |	КредитныеПрограммыМаркиВсе.Ссылка.ПометкаУдаления,
					               |	КредитныеПрограммыМаркиВсе.Ссылка.ЭтоГруппа,
					               |	КредитныеПрограммыМаркиВсе.Ссылка.Недействующая,
					               |	КредитныеПрограммыМаркиВсе.Ссылка.НовыеВсе,
					               |	NULL,
					               |	КредитныеПрограммыМаркиВсе.БанкПартнер,
					               |	КредитныеПрограммыМаркиВсе.Директовая
					               |ИЗ
					               |	Справочник.КредитныеПрограммы КАК КредитныеПрограммыМаркиВсе
					               |ГДЕ
					               |	НЕ КредитныеПрограммыМаркиВсе.Ссылка.ПометкаУдаления
					               |	И НЕ КредитныеПрограммыМаркиВсе.Ссылка.ЭтоГруппа
					               |	И НЕ КредитныеПрограммыМаркиВсе.Ссылка.Недействующая
					               |	И КредитныеПрограммыМаркиВсе.Ссылка.НовыеВсе
					               |	И КредитныеПрограммыМаркиВсе.БанкПартнер = &БанкПартнер";
					
					Запрос.УстановитьПараметр("Марка",Модель.Марка);
					Запрос.УстановитьПараметр("БанкПартнер",БанкПартнер);
				
					ТЗ = Запрос.Выполнить().Выгрузить();
 					
			КонецЕсли;
		Иначе
			Если НЕ обЗначениеНеЗаполнено(Модель) Тогда
				Если Модель = Справочники.Модели.АвтоСПробегом Тогда
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	КредитныеПрограммы.Ссылка КАК КредитнаяПрограмма,
					               |	КредитныеПрограммы.ПометкаУдаления КАК ПометкаУдаления,
					               |	КредитныеПрограммы.БуВсе КАК БуВсе,
					               |	КредитныеПрограммы.ЭтоГруппа КАК ЭтоГруппа,
					               |	КредитныеПрограммы.Недействующая КАК Недействующая,
					               |	КредитныеПрограммы.БанкПартнер КАК БанкПартнер,
					               |	КредитныеПрограммы.Директовая КАК Директовая
					               |ИЗ
					               |	Справочник.КредитныеПрограммы КАК КредитныеПрограммы
					               |ГДЕ
					               |	НЕ КредитныеПрограммы.ПометкаУдаления
					               |	И НЕ КредитныеПрограммы.ЭтоГруппа
					               |	И НЕ КредитныеПрограммы.Недействующая
					               |	И КредитныеПрограммы.БуВсе
					               |	И КредитныеПрограммы.БанкПартнер = &БанкПартнер";
					
					Запрос.УстановитьПараметр("БанкПартнер",БанкПартнер);
					
					ТЗ = Запрос.Выполнить().Выгрузить();
				Иначе		
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	КредитныеПрограммыМарки.Ссылка КАК КредитнаяПрограмма,
					               |	КредитныеПрограммыМарки.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
					               |	КредитныеПрограммыМарки.Ссылка.ЭтоГруппа КАК ЭтоГруппа,
					               |	КредитныеПрограммыМарки.Ссылка.Недействующая КАК Недействующая,
					               |	КредитныеПрограммыМарки.Ссылка.НовыеОпределенныхМарок КАК Крыж,
					               |	КредитныеПрограммыМарки.МаркаАвтомобиля.Ссылка КАК Марка,
					               |	КредитныеПрограммыМарки.Ссылка.БанкПартнер КАК БанкПартнер,
					               |	КредитныеПрограммыМарки.Ссылка.Директовая КАК Директовая
					               |ИЗ
					               |	Справочник.КредитныеПрограммы.Марки КАК КредитныеПрограммыМарки
					               |ГДЕ
					               |	НЕ КредитныеПрограммыМарки.Ссылка.ПометкаУдаления
					               |	И НЕ КредитныеПрограммыМарки.Ссылка.ЭтоГруппа
					               |	И НЕ КредитныеПрограммыМарки.Ссылка.Недействующая
					               |	И КредитныеПрограммыМарки.Ссылка.НовыеОпределенныхМарок
					               |	И КредитныеПрограммыМарки.МаркаАвтомобиля.Ссылка = &Марка
					               |	И КредитныеПрограммыМарки.Ссылка.БанкПартнер = &БанкПартнер
					               |
					               |ОБЪЕДИНИТЬ ВСЕ
					               |
					               |ВЫБРАТЬ
					               |	КредитныеПрограммыМаркиВсе.Ссылка,
					               |	КредитныеПрограммыМаркиВсе.Ссылка.ПометкаУдаления,
					               |	КредитныеПрограммыМаркиВсе.Ссылка.ЭтоГруппа,
					               |	КредитныеПрограммыМаркиВсе.Ссылка.Недействующая,
					               |	КредитныеПрограммыМаркиВсе.Ссылка.НовыеВсе,
					               |	NULL,
					               |	КредитныеПрограммыМаркиВсе.БанкПартнер,
					               |	КредитныеПрограммыМаркиВсе.Директовая
					               |ИЗ
					               |	Справочник.КредитныеПрограммы КАК КредитныеПрограммыМаркиВсе
					               |ГДЕ
					               |	НЕ КредитныеПрограммыМаркиВсе.Ссылка.ПометкаУдаления
					               |	И НЕ КредитныеПрограммыМаркиВсе.Ссылка.ЭтоГруппа
					               |	И НЕ КредитныеПрограммыМаркиВсе.Ссылка.Недействующая
					               |	И КредитныеПрограммыМаркиВсе.Ссылка.НовыеВсе
					               |	И КредитныеПрограммыМаркиВсе.БанкПартнер = &БанкПартнер";
					
					Запрос.УстановитьПараметр("Марка",Модель.Марка);
					Запрос.УстановитьПараметр("БанкПартнер",БанкПартнер);
				
					ТЗ = Запрос.Выполнить().Выгрузить();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
		
		ТЗ.Колонки.Добавить("БанкКонтрагентНаименование");
		
		//Бондаренко++ 20260505
		Для каждого Стр Из ТЗ Цикл
			Стр.БанкКонтрагентНаименование = Стр.КредитнаяПрограмма.БанкПартнер.Наименование;
		КонецЦикла;
		ТЗ.Сортировать("Директовая Убыв, БанкКонтрагентНаименование");
		//Бондаренко-- 20260505
   		
		Возврат ТЗ;
 
	КонецФункции // ПолучитьТаблицуКредитныхПрограммПоПартнеру() 
	

 
////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права                 = Неопределено;
#Если Клиент Тогда
Права = глПрава;

// Список статусов рабочего листа
СписокСтатусов	= Новый СписокЗначений;
ЗапросСтатусов		= Новый Запрос();
ЗапросСтатусов.Текст= "ВЫБРАТЬ
                      |	СтатусыРабочегоЛиста.Ссылка КАК Ссылка,
                      |	СтатусыРабочегоЛиста.Наименование КАК Наименование
                      |ИЗ
                      |	Справочник.СтатусыРабочегоЛиста КАК СтатусыРабочегоЛиста
                      |ГДЕ
                      |	СтатусыРабочегоЛиста.ИспользоватьВРабочемЛистеКредитногоОтдела
                      |	И НЕ СтатусыРабочегоЛиста.ПометкаУдаления
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	СтатусыРабочегоЛиста.ПорядокВОтчете УБЫВ";
ВыборкаСтатусов	= ЗапросСтатусов.Выполнить().Выбрать();
Пока ВыборкаСтатусов.Следующий() Цикл
	СписокСтатусов.Добавить(ВыборкаСтатусов.Ссылка);	
КонецЦикла;

МассивТребований	= Новый Массив();
МассивТребований.Добавить(Перечисления.ТребованияКПодтверждениюДохода._2НДФЛНаВесьДоход);
МассивТребований.Добавить(Перечисления.ТребованияКПодтверждениюДохода._2НДФЛНаОфициальнуюЧасть);
МассивТребований.Добавить(Перечисления.ТребованияКПодтверждениюДохода.БезПодтверждения);
МассивТребований.Добавить(Перечисления.ТребованияКПодтверждениюДохода.ЗаявлениеЗаемщика);
МассивТребований.Добавить(Перечисления.ТребованияКПодтверждениюДохода.Прочее);
МассивТребований.Добавить(Перечисления.ТребованияКПодтверждениюДохода.СвободнаяФорма);

#КонецЕсли
