// Модуль документа ПриходныйКассовыйОрдер

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем СообщениеОбОшибке Экспорт;	// Переменная для накопления сообщений. Если равна "Неопределено", то сообщения выводятся на экран, иначе накапливаются в переменной
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования
Перем ОтключитьПроверкиПередЗаписью Экспорт; // Флаг отключения проверок (используется при программном формировании документа)
Перем ОбработкаРасчетСкидок Экспорт;              // Переменная для хранения ссылки на обработку "Расчет скидок". Данная обработка содержит необходимые
Перем ЗначениеСкидкиНаценки Экспорт;
Перем СуммаСкидкиНаценки Экспорт;
 
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("КассаКомпании",1);
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	ОбязательныеРеквизиты.Вставить("Автор",1);
	ОбязательныеРеквизиты.Вставить("ВалютаДокумента",1);
	ОбязательныеРеквизиты.Вставить("КурсДокумента",1);
	ОбязательныеРеквизиты.Вставить("Контрагент",1);
	ОбязательныеРеквизиты.Вставить("ХозОперация",1);
	ОбязательныеРеквизиты.Вставить("ДоговорВзаиморасчетов",1);
	ОбязательныеРеквизиты.Вставить("СуммаДокумента",1);
	ОбязательныеРеквизиты.Вставить("СтатьяДДС",1);
	Если ДляПробитияНаФР Тогда
		ОбязательныеРеквизиты.Вставить("ТипСпособаРасчетаККТ",1);
		ОбязательныеРеквизиты.Вставить("ТипРасчета", 1);
	КонецЕсли; 
	Возврат ОбязательныеРеквизиты;
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Проверяет корректность заполнения объекта.
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры:
//  Ошибки       - строка, в случае некорректного заполнения содержит описанием возникших ошибок, 
//  ДопРеквизиты - структура, на вход может быть передана структура с дополнительными реквизитами для проверки,
//  Заполнение   - булево, флаг проверки, 
//  Уникальность - булево, флаг проверки.
//
// Возвращаемое значение:
//  Булево - Возвращает Истина если все заполнено корректно и Ложь иначе.
// 
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	// Здесь могут быть определены дополнительные к стандартным обязательным реквизитам условия проверки
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	
	// Проведем проверку соответствия организации документа организациям некоторых реквизитов документа.
	// Такую проверку необходимо осуществлять, если баланс в системе ведется по организации,
	// или если установлен способ контроля корректности
	// договора и склада документа. Причем, если способ контроля выбран "Контроль по организации и подразделению", то
	// дополнительно осуществляется проверка соответствия подразделений.
	Если Результат Тогда
		СпособКонтроляКорректности = обПраво("КонтрольКорректностиДоговораИСкладаДокумента", Права,,ЭтотОбъект);	
		КонтрольОтсутствует        = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольОтсутствует);
		БалансВедетсяПоОрганизации = (Константы.СпособВеденияБаланса.Получить()=Перечисления.СпособВеденияБаланса.ПоОрганизации);

		Если БалансВедетсяПоОрганизации ИЛИ НЕ КонтрольОтсутствует Тогда
			КонтрольПоПодразделению = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольПоОрганизацииИПодразделению);
						
			КонтролируемыеРеквизиты = Новый Структура();
			
			КонтролируемыеРеквизитыШапки = Новый Структура();
			КонтролируемыеРеквизитыШапки.Вставить("ДоговорВзаиморасчетов", КонтрольПоПодразделению);
			Если БалансВедетсяПоОрганизации Тогда
				КонтролируемыеРеквизитыШапки.Вставить("КассаКомпании", Ложь);
			КонецЕсли;
			КонтролируемыеРеквизиты.Вставить("КонтролируемыеРеквизитыШапки",КонтролируемыеРеквизитыШапки);		
			
			Результат = дкПроверитьКорректностьПоОрганизации(ЭтотОбъект,КонтролируемыеРеквизиты,Ошибки) И Результат;
		КонецЕсли;  		
	КонецЕсли;
	
	Если Товары.Количество() > 0 И ДляПробитияНаФР Тогда
		
		Если СуммаДокумента > 0 И Товары.Итог("СуммаОплаты") = 0 Тогда
			Результат=Ложь;
			дкДобавитьОшибку(Ошибки, "Необходимо произвести пропорциональное распределение суммы вносимой оплаты между предметами платежа");
		ИначеЕсли СуммаДокумента <> Товары.Итог("СуммаОплаты") Тогда
			Результат=Ложь;
			дкДобавитьОшибку(Ошибки, "Неверно заполнена колонка ""Сумма оплаты"" в табличной части товары, необходимо распределить сумму оплаты");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // ПроверитьКорректность()

// Проверяет корректность заполнения табличных частей объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
Функция ПроверитьЗаполненностьТЧ(Ошибки="", ДопРеквизиты=Неопределено) Экспорт
	Результат = Истина;
	Возврат Результат;
КонецФункции

// Функция проверяет, допустимо ли изменение объекта
//
// Параметры:
//  БлокироватьРеквизиты - структура, структура блокируемых на изменение реквизитов.
//
// Возвращаемое значение:
// Булево - Возвращает Истина, если изменения возможны, ложь иначе
//          Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
//
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции // ДоступностьИзменения()

// Возвращает список возможных хозяйственных операций документа
// Возвращаемое значение: 
//  СписокЗначений. 
//  Строка списка: Значение - имя предопределенного элемента; 
//				   Представление - красивое его представление
// 				   "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("ПриходныйКассовыйОрдер","Приходный кассовый ордер",Истина);
	СписокХозОпераций.Добавить("ВозвратДенежныхСредствОтПодотчетника","Возврат денежных средств от подотчетника",Ложь);
	Возврат СписокХозОпераций;
КонецФункции // ПолучитьСписокХозОпераций()

// Расчет суммы документа
//
Функция РассчитатьСуммуВсего()Экспорт
	Возврат СуммаДокумента;
КонецФункции // РассчитатьСуммуВсего()

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка – Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	– Форма	 – Ссылка на форму документа. Если значение неопределено,
//                         производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	// ОБРАБОТКА РЕКВИЗИТОВ ОБЪЕКТА
	Если Имя="ВалютаДокумента" ИЛИ Имя="КурсДокумента" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		#Если Клиент Тогда
		Если ЭтаФорма<>Неопределено Тогда
			ЭтаФорма.ОтображениеВалютыДокумента();
		КонецЕсли; 
		#КонецЕсли
		Возврат Рез;
		//Бондаренко++ 20260508
	ИначеЕсли Имя="КассаКомпании" Тогда
		Если НЕ ЗначениеЗаполнено(КассаКомпании) Тогда
			Возврат Истина;
		КонецЕсли;
		Если НЕ обПраво("ЗаменаНомераПКОиРКОПоПодразделениюКассыКомпании") Тогда
			Возврат Истина;
		КонецЕсли;
		Если Дата <= Дата(2026,5,6) Тогда		
			Возврат Истина;
		КонецЕсли;
		#Если Клиент Тогда
			Рез=Истина;
			Если ЭтаФорма<>Неопределено Тогда
				Если КассаКомпании.Организация<>Организация Тогда
					Организация=КассаКомпании.Организация;
					Рез=ОбработкаРеквизита("Организация",,ЭтаФорма) И Рез;
				КонецЕсли; 
				Если КассаКомпании.Подразделение<>ПодразделениеКомпании Тогда
					ПодразделениеКомпании=КассаКомпании.Подразделение;
					Рез=ОбработкаРеквизита("ПодразделениеКомпании",,ЭтаФорма) И Рез;
				КонецЕсли; 
			Иначе
				//Организация=КассаКомпании.Организация;
				//Рез=ОбработкаРеквизита("Организация",,ЭтаФорма) И Рез;
				//ПодразделениеКомпании=КассаКомпании.Подразделение;
				//Рез=ОбработкаРеквизита("ПодразделениеКомпании",,ЭтаФорма) И Рез;
			КонецЕсли; 
		#Иначе
			//Организация=КассаКомпании.Организация;
			//Рез=ОбработкаРеквизита("Организация",,ЭтаФорма) И Рез;
			//ПодразделениеКомпании=КассаКомпании.Подразделение;
			//Рез=ОбработкаРеквизита("ПодразделениеКомпании",,ЭтаФорма) И Рез;
		#КонецЕсли
		Возврат Рез;	
		//Бондаренко-- 20260508
	ИначеЕсли Имя="Сделка" Тогда
		Если ТипЗнч(Сделка) = Тип("ДокументСсылка.СчетНаОплату") Тогда
			ДоговорВзаиморасчетов = Сделка.ДоговорВзаиморасчетов;
			СуммаДокументаПересчитанная = обПересчет(Сделка.СуммаДокумента,Сделка.ВалютаДокумента,Дата,ВалютаДокумента,КурсДокумента);
			СуммаДокумента = СуммаДокументаПересчитанная;
		КонецЕсли;
		Если ЗначениеЗаполнено(Сделка) Тогда
			//Бондаренко++ 20231202
			//Основание = Сделка;  
			//Бондаренко-- 20231202
		КонецЕсли;
		дкСформироватьСуммуНДСДокументаОтгрузки(ЭтотОбъект, Сделка, СуммаДокумента);
		Возврат Рез;
		
	ИначеЕсли Имя="Контрагент" Тогда
		//Параметры для подстановки или создания договора контрагента
		Если ДопПараметры=Неопределено Тогда ДопПараметры=Новый Структура; КонецЕсли; 
		Если (ХозОперация=Справочники.ХозОперации.ВозвратДенежныхСредствОтПодотчетника) Тогда
			ВидДоговора	= Перечисления.ВидыДоговоров.Подотчет;
		ИначеЕсли ХозОперация=Справочники.ХозОперации.ПриходныйКассовыйОрдер Тогда
			ВидДоговора	= Перечисления.ВидыДоговоров.Продажа;
		Иначе
			ВидДоговора	= Перечисления.ВидыДоговоров.Прочее;	
		КонецЕсли;	
		ДопПараметры.Вставить("ВидДоговора", ВидДоговора);
		ДопПараметры.Вставить("ВалютаВзаиморасчетов", ВалютаДокумента);
		
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Если НЕ обЗначениеНеЗаполнено(Контрагент) Тогда
			ПринятоОТ=СокрЛП(Контрагент.НаименованиеПолное);
			//ПодтверждающийДокумент=спПолучитьПодтверждающийДокументОбъектаПоВиду(Контрагент,Перечисления.ВидыДокументов.Паспорт);
			//Если НЕ ПодтверждающийДокумент.Пустая() Тогда
			//	Основание=ПодтверждающийДокумент.Наименование;
			//КонецЕсли; 
		КонецЕсли; 
		Возврат Рез;
		
	ИначеЕсли Имя="СуммаДокумента" ИЛИ Имя="СтавкаНДС" Тогда
		Если НЕ СтавкаНДС.Пустая() Тогда
			СуммаНДС = Окр((СуммаДокумента * СтавкаНДС.Ставка)/(100 + СтавкаНДС.Ставка),2);
		КонецЕсли;
		Возврат Истина;
		
	ИначеЕсли Имя="КассаККМ" Тогда
		Если НЕ ЗначениеЗаполнено(КассаККМ) Тогда
			Возврат Истина;
		КонецЕсли;
		#Если Клиент Тогда
		Рез=Истина;
		Если ЭтаФорма<>Неопределено Тогда
			Если КассаККМ.Организация<>Организация Тогда
				Если Вопрос("Организация кассы отлична от текущей организации документа. Установить организацию документа в соответствие с организацией кассы?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да) = КодВозвратаДиалога.Да Тогда
					Организация=КассаККМ.Организация;
					Рез=ОбработкаРеквизита("Организация",,ЭтаФорма) И Рез;
				КонецЕсли; 
			КонецЕсли; 
			Если КассаККМ.Подразделение<>ПодразделениеКомпании Тогда
				Если Вопрос("Подразделение кассы отлично от текущего подразделения документа. Установить подразделение документа в соответствии с подразделением кассы?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да) = КодВозвратаДиалога.Да Тогда
					ПодразделениеКомпании=КассаККМ.Подразделение;
					Рез=ОбработкаРеквизита("ПодразделениеКомпании",,ЭтаФорма) И Рез;
				КонецЕсли; 
			КонецЕсли; 
			Если КассаККМ.ВалютаДенежныхСредств<>ВалютаДокумента Тогда
				Если Вопрос("Валюта кассы отлична от текущей валюты документа. Установить валюту документа в соответствие с валютой кассы?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да) = КодВозвратаДиалога.Да Тогда
					ВалютаДокумента=КассаККМ.ВалютаДенежныхСредств;
					Если ТипЗнч(ДопПараметры)<>Тип("Структура") Тогда
						ДопПараметры=Новый Структура;
					КонецЕсли;
					Рез=ОбработкаРеквизита("ВалютаДокумента",,ЭтаФорма,ДопПараметры) И Рез;
				КонецЕсли; 
			КонецЕсли; 
		Иначе
			Организация=КассаККМ.Организация;
			Рез=ОбработкаРеквизита("Организация",,ЭтаФорма) И Рез;
			ПодразделениеКомпании=КассаККМ.Подразделение;
			Рез=ОбработкаРеквизита("ПодразделениеКомпании",,ЭтаФорма) И Рез;
			ВалютаДокумента=КассаККМ.ВалютаДенежныхСредств;
			Рез=ОбработкаРеквизита("ВалютаДокумента",,ЭтаФорма) И Рез;
		КонецЕсли; 
		#Иначе
		Организация=КассаККМ.Организация;
		Рез=ОбработкаРеквизита("Организация",,ЭтаФорма) И Рез;
		ПодразделениеКомпании=КассаККМ.Подразделение;
		Рез=ОбработкаРеквизита("ПодразделениеКомпании",,ЭтаФорма) И Рез;
		ВалютаДокумента=КассаККМ.ВалютаДенежныхСредств;
		Рез=ОбработкаРеквизита("ВалютаДокумента",,ЭтаФорма) И Рез;
		#КонецЕсли
		Возврат Рез;
		
	ИначеЕсли Имя="ФР" Тогда
		Если НЕ обЗначениеНеЗаполнено(ФР) Тогда
			Если ФР.КлассОборудования<>Перечисления.КлассыОборудования.ФР Тогда
				#Если Клиент Тогда
				Если ЭтаФорма<>Неопределено Тогда
					Предупреждение("Выбранное оборудование: " + ФР + " не является фискальным регистратором!
					|Выберите фискальный регистратор",10);
				КонецЕсли; 
				#КонецЕсли
				ФР=Неопределено;
				Возврат ОбработкаРеквизита("ФР",ТекСтрока,ЭтаФорма,ДопПараметры);
			КонецЕсли; 
		КонецЕсли; 
		Возврат Истина;
		
	ИначеЕсли Имя = "ДляПробитияНаФР" Тогда
		Рез = Истина;
		
		Если ДляПробитияНаФР И НЕ ЗначениеЗаполнено(ТипРасчета) Тогда
			ТипРасчета = дкТипРасчетаДокумента(ЭтотОбъект);
		КонецЕсли;
		
		Возврат Рез;
		
	Иначе Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()

// заполнение свойств из документа основания
Процедура ЗаполнитьСвойстваНаОсновании(Основание) Экспорт
 //зарезервировано для описания заполнения свойств из свойств основания
КонецПроцедуры


#Если Клиент Тогда
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

// Формирует печатную форму "ПриходныйКассовыйОрдер"
// 
// Параметры:
//  ТабДокумент - табличный документ.
//
// Возвращаемое значение:
//  ТабДокумент - возвращает сформированный табличный документ.
//
Функция ПечатьПриходныйКассовыйОрдер(ТабДокумент) Экспорт
	Макет = ПолучитьМакет("ПриходныйКассовыйОрдер");
	
	ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
	//Получаем область шапки документа
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);

	ОбластьМакета.Параметры.СуммаДокумента = Формат(СуммаДокумента,ФорматВыводаСуммы);
	ОбластьМакета.Параметры.ОрганизацияПоОКПО = ЭтотОбъект.Организация.КодПоОКПО;
	ОбластьМакета.Параметры.КодПодразделения = ЭтотОбъект.ПодразделениеКомпании.Код;
	Если обЗначениеНеЗаполнено(Основание) Тогда
		ОбластьМакета.Параметры.Основание = ЭтотОбъект.ХозОперация;
	КонецЕсли;
	ОбластьМакета.Параметры.ДебетСубСчет = ?(ЭтотОбъект.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(),"50.1","50.2");
	ОбластьМакета.Параметры.КредитСубСчет = ЭтотОбъект.СтатьяДДС.КоррСчет.Код;
	
	ГлавныйБухгалтер = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер);
	ОбластьМакета.Параметры.Заполнить(ГлавныйБухгалтер);
	Кассир = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.Кассир);
	ОбластьМакета.Параметры.Заполнить(Кассир);

	ОбластьМакета.Параметры.СуммаПрописью = обЧислоПрописью(ЭтотОбъект.СуммаДокумента,ЭтотОбъект.ВалютаДокумента);
	ОбластьМакета.Параметры.ВТомЧисле = "НДС (" + дкПолучитьПредставлениеСтавкиНДС(СтавкаНДС) + ") " 
										  + Формат(СуммаНДС, ФорматВыводаСуммы)+" "+ЭтотОбъект.ВалютаДокумента;
										  
	ОбластьМакета.Параметры.Номер = дкПолучитьНомерДляПечати(ЭтотОбъект);
	ОбластьМакета.Параметры.Подразделение = ПодразделениеКомпании;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабДокумент;
КонецФункции // ПечатьПриходныйКассовыйОрдер()

// Функция осуществляет печать произвольного документа.
// Можно направить печать на экран или принтер, а также распечатать необходимое количество копий.
//
// Параметры:
//	ЭтотОбъект							- ДокументОбъект	- Документ для печати
//	НазваниеПечатнойФормы 				- Строка			- Название печатной формы, если пусто, то по умолчанию
//	КоличествоЭкземпляров				- Число				- Количество экземпляров документа
//	НаПринтер							- Булево			- Признак отправки документа на принтер без отображения его на экране
//  Документ 	  						- ТабличныйДокумент	- Макет печатной формы
//
// Возвращаемое значение:
//   ТабличныйДокумент	- Сформированная печатная форма
//
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции // Печать()

#КонецЕсли
// Если Клиент Тогда - завершена клиентская часть

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Процедура - обработчик ввода на основании
Процедура ОбработкаЗаполнения(Основание)
	
	Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание,, Ложь) Тогда
		Возврат; 
	КонецЕсли;
	
	//Производится заполнение реквизитов документа в зависимости от типа документа основания
	//ХозОперация=Справочники.ХозОперации.ПриходныйКассовыйОрдер;
	Если Основание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОснование    = Основание;
	Сделка               = ДокументОснование;
	ЭтотОбъект.Основание = Сделка;
	
	Если ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.ЗаказПокупателя") ИЛИ
		ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
		
		ВремКомментарий = "";
		
		ДокументОбъектСтруктура=Новый Структура();
		ДокументОбъектСтруктура.Вставить("Дата",          ТекущаяДата());
		ДокументОбъектСтруктура.Вставить("МоментВремени", ЭтотОбъект.МоментВремени());
		ДокументОбъектСтруктура.Вставить("Проведен",      ЭтотОбъект.Проведен);
		
		ТаблицаРасчетов = зфЗащищенныеФункцииСервер.ПолучитьТаблицуРасчетовПоЗаказам(ДокументОбъектСтруктура, ДокументОснование);
		
		ДолгПоПредоплате = 0;
		Долг = 0;
		Для Каждого ТекСтрока Из ТаблицаРасчетов Цикл
			ДолгПоПредоплате = ДолгПоПредоплате + ТекСтрока.ДолгПоПредоплате;
			Долг = Долг + ТекСтрока.Долг;
		КонецЦикла;
		
		Если ДолгПоПредоплате>0 Тогда
			СуммаДокумента = ДолгПоПредоплате;
			ВремКомментарий = "Предоплата по документу <"+дкПолучитьПредставление(ДокументОснование)+">";
		Иначе
			СуммаДокумента = Долг;
		КонецЕсли;
		
		Если НЕ ДоговорВзаиморасчетов.ВалютаВзаиморасчетов = ВалютаДокумента Тогда
			СуммаДокумента = обПересчет(СуммаДокумента, ДокументОснование.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов, Дата, ВалютаДокумента, Дата, РежимОкругления.Окр15как20);
		КонецЕсли;
		
		//Статья ДДС - Оплата от покупателя
		СтатьяДДС=Справочники.СтатьиДДС.ОплатаОтПокупателя;
		Если НЕ ПустаяСтрока(ВремКомментарий) Тогда
			Комментарий=ВремКомментарий;
		КонецЕсли;
		
		//Бондаренко++ 20230309
		Если ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
			Если ДокументОснование.СуммаПредоплаты > 0 Тогда	
				СуммаДокумента = ДокументОснование.СуммаПредоплаты;	
			КонецЕсли;
		КонецЕсли;	
		//Бондаренко-- 20230309
		
	ИначеЕсли ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.СчетНаОплату") ИЛИ
		ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.СчетНаОплатуЗаАвтомобили") Тогда
		
		//Проверим сумму предоплаты
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВзаиморасчетыКомпанииОстаткиИОбороты.СуммаРасход КАК Сумма,
		|	ВзаиморасчетыКомпанииОстаткиИОбороты.СуммаУпрРасход КАК СуммаУпр
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыКомпании.Обороты(,,,
		|		Контрагент = &Контрагент И
		|		ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов И
		|		(Сделка = &Сделка ИЛИ Сделка.ДокументОснование = &Сделка)
		|	) КАК ВзаиморасчетыКомпанииОстаткиИОбороты
		|";
		Запрос.УстановитьПараметр("Контрагент",            ДокументОснование.Контрагент);
		Запрос.УстановитьПараметр("ДоговорВзаиморасчетов", ДокументОснование.ДоговорВзаиморасчетов);
		Запрос.УстановитьПараметр("Сделка",                ДокументОснование);
		тзОплаты=Запрос.Выполнить().Выгрузить();
		
		ДокументОснованиеСуммаДокумента = ДокументОснование.СуммаДокумента;
		
		Если ДоговорВзаиморасчетов.ВалютаВзаиморасчетов=ВалютаДокумента Тогда
			Оплачено = обПересчет(тзОплаты.Итог("Сумма"), ДоговорВзаиморасчетов.ВалютаВзаиморасчетов, Дата, ВалютаДокумента, Дата, РежимОкругления.Окр15как20);
		Иначе
			Оплачено = обПересчет(тзОплаты.Итог("СуммаУпр"), Константы.ВалютаУправленческогоУчетаКомпании.Получить(), Дата, ВалютаДокумента, ?(обЗначениеНеЗаполнено(ЭтотОбъект.КурсДокумента), Дата, ЭтотОбъект.КурсДокумента), РежимОкругления.Окр15как20);
		КонецЕсли;
		
		СуммаДокумента = ДокументОснованиеСуммаДокумента - Оплачено;
		
		//Статья ДДС - Оплата от покупателя
		СтатьяДДС = Справочники.СтатьиДДС.ОплатаОтПокупателя;
		
	ИначеЕсли ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.АвансовыйОтчет") ИЛИ
			ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
			
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
			ХозОперация = Справочники.ХозОперации.ВозвратДенежныхСредствОтПодотчетника;
		КонецЕсли;
		СтруктураОтбора = Новый Структура();
		СтруктураОтбора.Вставить("Контрагент",ДокументОснование.Контрагент);
		СтруктураОтбора.Вставить("ДоговорВзаиморасчетов", ДокументОснование.ДоговорВзаиморасчетов);
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") И ЗначениеЗаполнено(ДокументОснование.Сделка) Тогда
			СтруктураОтбора.Вставить("Сделка", ДокументОснование.Сделка);
			Сделка = ДокументОснование.Сделка;
		КонецЕсли;
		
		тзДолги=РегистрыНакопления.ВзаиморасчетыКомпании.Остатки(,СтруктураОтбора,,"Сумма,СуммаУпр,СуммаБаз");
		Если ВалютаДокумента=ДокументОснование.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов Тогда
			Долг=обПересчет(тзДолги.Итог("Сумма"),ДокументОснование.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов,ДокументОснование.Дата,ВалютаДокумента,ДокументОснование.Дата,РежимОкругления.Окр15как20);
		ИначеЕсли ВалютаДокумента=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить() Тогда
			Долг=тзДолги.Итог("СуммаБаз");
		Иначе
			Долг=обПересчет(тзДолги.Итог("СуммаУпр"),Константы.ВалютаУправленческогоУчетаКомпании.Получить(),ДокументОснование.Дата,ВалютаДокумента,ДокументОснование.Дата,РежимОкругления.Окр15как20);
		КонецЕсли;
		СуммаДокумента=Макс(Долг,0);
		
		//Статья ДДС - Возврат из подотчета
		СтатьяДДС=Справочники.СтатьиДДС.ВозвратИзПодОтчета;
		
		Если ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
			ТипРасчета = Неопределено;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.Инкассация") Тогда
		
		ИзменилсяКонтрагент = (Контрагент <> Основание.Инкассатор);
		ИзменилсяДоговор    = (ДоговорВзаиморасчетов <> Основание.ДоговорВзаиморасчетовИнкассатор);
		
		Контрагент=Основание.Инкассатор;
		ДоговорВзаиморасчетов=Основание.ДоговорВзаиморасчетовИнкассатор;
		
		Если ИзменилсяКонтрагент Тогда
			ОбработкаРеквизита("Контрагент");
		КонецЕсли;
		
		Если ИзменилсяДоговор Тогда
			ОбработкаРеквизита("ДоговорВзаиморасчетов");
		КонецЕсли;
		
		СуммаДокумента=0;
		Оплаты=Основание.Оплаты.Выгрузить();
		Оплаты.Свернуть("ТипОплаты","Сумма,СуммаВозврат");
		СтрокаОплатНаличными=Оплаты.Найти(Справочники.ТипыОплат.Наличные,"ТипОплаты");
		Если СтрокаОплатНаличными<>Неопределено Тогда
			СуммаДокумента=СтрокаОплатНаличными.Сумма+СтрокаОплатНаличными.СуммаВозврат;
		КонецЕсли; 
		
		КурсВалютыВзаиморасчетов = дкПолучитьКурсВалютыВзаиморасчетов(ЭтотОбъект, ДоговорВзаиморасчетов, Основание);

	ИначеЕсли ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.РеализацияАктивов") Тогда
		Контрагент=Основание.Контрагент;
		//вычислим сумму к оплате
		СуммаДок=Основание.Активы.Итог("Сумма");
		СуммаДокумента=обПересчет(СуммаДок,ДокументОснование.ВалютаДокумента,ДокументОснование.КурсДокумента,ВалютаДокумента,Дата);
		СуммаНДС=Основание.Активы.Итог("СуммаНДС");
		СуммаНДС=обПересчет(СуммаНДС,ДокументОснование.ВалютаДокумента,ДокументОснование.КурсДокумента,ВалютаДокумента,Дата);
		СтатьяДДС=Справочники.СтатьиДДС.ОплатаОтПокупателя;

	ИначеЕсли ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.Инвентаризация") Тогда
		Если ДокументОснование.ХозОперация = Справочники.ХозОперации.ИнвентаризацияТоваровОтданныхНаКомиссию Тогда
			Запрос = Новый Запрос("
			|ВЫБРАТЬ
			|	СУММА(ИнвентаризацияТовары.Сумма) КАК Сумма
			|ИЗ
			|	Документ.Инвентаризация.Товары КАК ИнвентаризацияТовары
			|ГДЕ
			|	 ИнвентаризацияТовары.Ссылка = &ДокументОснование И ИнвентаризацияТовары.Количество < 0
			|");
			Запрос.УстановитьПараметр("ДокументОснование",ДокументОснование);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() И НЕ обЗначениеНеЗаполнено(Выборка.Сумма) Тогда
				СуммаДокумента = обПересчет(-Выборка.Сумма,Основание.ВалютаДокумента,Основание.КурсДокумента,ВалютаДокумента,Дата);
			КонецЕсли;
			СтатьяДДС=Справочники.СтатьиДДС.ОплатаОтПокупателя;
		Иначе
			#Если Клиент Тогда
				Предупреждение("Можно вводить только на основании инвентаризации товаров отданных на комиссию!");
			#КонецЕсли
			
			дкОтменаВводаДокумента(ЭтотОбъект);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПланПоступленияДС") Тогда
		СуммаДокумента = ДокументОснование.СуммаДокумента;
		// В зависимости от хоз операции документа основания будем подставлять Кассу или нет
		Если ДокументОснование.ХозОперация = Справочники.ХозОперации.ПланПоступленияВКассу Тогда
			КассаКомпании = ДокументОснование.СтруктурнаяЕдиница;
		КонецЕсли;
		
		Сделка               = Основание.ДокументОснование;
		ДокументПланирования = Основание;
		
	ИначеЕсли ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.ЗаказНаряд") Тогда
		//При вводе от заказ-наряда ничего более делать не надо,
		//т.к. все уже сделано в обработке заполнения в отраслевых решениях
		
	ИначеЕсли ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.РеализацияАвтомобилей") Тогда
		//При вводе от заказа на автомобиль ничего более делать не надо,
		//т.к. все уже сделано в обработке заполнения в отраслевых решениях
		
	Иначе
		//Вычислим сумму
		СтруктураОтбора=Новый Структура(); 
		СтруктураОтбора.Вставить("Контрагент",Контрагент);
		СтруктураОтбора.Вставить("ДоговорВзаиморасчетов",ДоговорВзаиморасчетов);
		СтруктураОтбора.Вставить("Сделка",ДокументОснование);
		тзДолги=РегистрыНакопления.ВзаиморасчетыКомпании.Остатки(ТекущаяДата(),СтруктураОтбора,,"Сумма,СуммаУпр,СуммаБаз");
		Если ДокументОснование.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов=ВалютаДокумента Тогда
			ОстатокПоСделке=обПересчет(тзДолги.Итог("Сумма"),ДокументОснование.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов,ДокументОснование.КурсДокумента,ВалютаДокумента,КурсДокумента);
		ИначеЕсли ВалютаДокумента=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить() Тогда
			ОстатокПоСделке=тзДолги.Итог("СуммаБаз");
		Иначе
			ОстатокПоСделке=обПересчет(тзДолги.Итог("СуммаУпр"),Константы.ВалютаУправленческогоУчетаКомпании.Получить(),ДокументОснование.КурсВалютыУпр,ВалютаДокумента,КурсДокумента);
		КонецЕсли;
		СуммаДокумента=ОстатокПоСделке;
		//Статья ДДС - Оплата от покупателя
		СтатьяДДС=Справочники.СтатьиДДС.ОплатаОтПокупателя;
		
	КонецЕсли;
	
	// Для нового документа нельзя заполнять данные ФР
	Если ЭтоНовый() Тогда
		Документы.ПриходныйКассовыйОрдер.ОчиститьРеквизитыФискальногоРегистратора(ЭтотОбъект);
	КонецЕсли;
	
	дкСформироватьСуммуНДСДокументаОтгрузки(ЭтотОбъект, ЭтотОбъект.ДокументОснование, СуммаДокумента);
	
	КурсВалютыВзаиморасчетов = дкПолучитьКурсВалютыВзаиморасчетов(ЭтотОбъект, ?(обЗначениеНеЗаполнено(ЭтотОбъект.ДоговорВзаиморасчетов), Неопределено, ЭтотОбъект.ДоговорВзаиморасчетов), ?(обЗначениеНеЗаполнено(ЭтотОбъект.ДокументОснование), Неопределено, ЭтотОбъект.ДокументОснование));
	ОбработкаРеквизита("КассаКомпании",,,Новый Структура("ЗадаватьВопрос",Ложь));
	ОбработкаРеквизита("Контрагент");
	
	Если НЕ ЗначениеЗаполнено(ТипРасчета) Тогда
		ТипРасчета = дкТипРасчетаДокумента(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
	
	Документы.ПриходныйКассовыйОрдер.ОчиститьРеквизитыФискальногоРегистратора(ЭтотОбъект);
	
	Товары.Очистить();
	КодыМаркировки.Очистить();
	
КонецПроцедуры // ПриКопировании()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОтключитьПроверкиПередЗаписью Тогда Возврат; КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ДоговорВзаиморасчетовБыл");
	ДополнительныеСвойства.Вставить("МоментВремениБыл");
	
	//снимем проверку на запись документа раньше чем документ основание
	МаскаПроверки = "10111";
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения,,,,МаскаПроверки) Тогда Возврат; КонецЕсли;
	
	Если НЕ обПраво("ВводОплатыПоЗаказНаряду",Права,,ЭтотОбъект) Тогда
		ОтказНаВводДокумента=Ложь;
		Если НЕ обЗначениеНеЗаполнено(Сделка) Тогда
			Если ТипЗнч(Сделка)=Тип("ДокументСсылка.ЗаказНаряд") Тогда
				ОтказНаВводДокумента=Истина;
			//Иначе
			//	Попытка
			//		Если ТипЗнч(Сделка.ДокументОснование)=Тип("ДокументСсылка.ЗаказНаряд") Тогда
			//			ОтказНаВводДокумента=Истина;
			//		КонецЕсли;
			//	Исключение КонецПопытки; 
			КонецЕсли; 
		КонецЕсли;
		Если ОтказНаВводДокумента Тогда
			Сообщить("Формирование приходного кассового ордера на основании заказ-наряда запрещено!",СтатусСообщения.Важное);
			Отказ=Истина;
			дкУстановитьЗначениеДополнительногоСвойства(ЭтотОбъект,Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// получим старые значения, влияющие на границы последовательности
	Если НЕ Отказ И Проведен И РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		
		БылиДвижения = Ложь;
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		// взаиморасчеты
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ДоговорВзаиморасчетов ИЗ РегистрНакопления.ВзаиморасчетыКомпании ГДЕ Регистратор=&Ссылка";
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			БылиДвижения = Истина;
			ДополнительныеСвойства.Вставить("ДоговорВзаиморасчетовБыл", Результат.Выгрузить().ВыгрузитьКолонку("ДоговорВзаиморасчетов"));
		КонецЕсли;
		
		// прошлый момент времени
		Если БылиДвижения Тогда
			Запрос.Текст = "ВЫБРАТЬ МоментВремени ИЗ Документ."+Метаданные().Имя+" ГДЕ Ссылка=&Ссылка";
			ДополнительныеСвойства.Вставить("МоментВремениБыл",Запрос.Выполнить().Выгрузить().Получить(0).МоментВремени);
		КонецЕсли;
		
	КонецЕсли;
	
	//Бондаренко++ 20241012
	Если Дата >= Дата(2024,10,15)Тогда
		Если Не обЗначениеНеЗаполнено(СтатьяДДС) Тогда
			ГруппаПоступлениеДС = Справочники.СтатьиДДС.ПоступлениеДС;
			Если СтатьяДДС.Родитель <> ГруппаПоступлениеДС Тогда
				#Если Клиент Тогда
					СМГ_Сообщить("ОШИБКА! Статья движения денежных средств должна быть выбрана из группы <<"+ГруппаПоступлениеДС+">>.",СтатусСообщения.ОченьВажное); 			 
				#КонецЕсли
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Бондаренко-- 20241012

	//Бондаренко++ 20241012
	Если Дата >= Дата(2024,10,15) Тогда
		Если Не обЗначениеНеЗаполнено(КассаКомпании) Тогда
			КассаКомпанииОрганизация = КассаКомпании.Организация;
 			Если КассаКомпанииОрганизация <> Организация Тогда
				#Если Клиент Тогда
					СМГ_Сообщить("ОШИБКА! Организация кассы компании <<"+СокрЛП(КассаКомпанииОрганизация)+">>, а организация документа <<"+СокрЛП(Организация)+">>.",СтатусСообщения.ОченьВажное); 			 
				#КонецЕсли
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Бондаренко-- 20241012
	
	//Бондаренко++ 20260507
	//Если обПраво("ЗаменаНомераПКОиРКОПоПодразделениюКассыКомпании") Тогда
	//	Если Дата >= Дата(2026,5,6) Тогда    
	//		Если НЕ обЗначениеНеЗаполнено(КассаКомпании) Тогда
	//			КассаКомпанииПодразделение_ = КассаКомпании.Подразделение;
	//			Если ПодразделениеКомпании <> КассаКомпанииПодразделение_ Тогда
	//				ПодразделениеКомпании = КассаКомпанииПодразделение_;
	//				Попытка
	//					ЭтотОбъект.УстановитьНовыйНомер();
	//					#Если Клиент Тогда
	//						СМГ_Сообщить("Установлен новый номер <<"+СокрЛП(Номер)+">>.",СтатусСообщения.Информация); 			 
	//					#КонецЕсли
	//				Исключение
	//					#Если Клиент Тогда
	//						СМГ_Сообщить("ОШИБКА! Не удалось установить новый номер.",СтатусСообщения.ОченьВажное); 			 
	//					#КонецЕсли
	//				КонецПопытки; 
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	//Бондаренко-- 20260507

	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	//Бондаренко++ 20260123
	СМГ_ПриЗаписи()
	//Бондаренко-- 20260123
КонецПроцедуры // ПриЗаписи()

//Бондаренко++ 20260123
Процедура СМГ_ПриЗаписи()
	Если обПраво("ФормироватьСФнаАвансПриЗаписиПКО") Тогда
		СМГ_СоздатьИлиОбновитьСФВыданный();
 	КонецЕсли;
КонецПроцедуры  //СМГ_ПриЗаписи()
	
Процедура СМГ_СоздатьИлиОбновитьСФВыданный()
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Дата < Дата(2026,1,1) Тогда
		Возврат;
	КонецЕсли; 

	//Иванченко 20260216 ++                                  
	ОтменитьПроведениеСФнаАванс(); 
	//Иванченко 20260216 --                                  
	
	//Иванченко 20260216 ++                                  
	Если ЭтотОбъект.Контрагент.НашаФирма Тогда
		Возврат;
	КонецЕсли;  
	
	Структура_ОтборДолг = Новый Структура("Контрагент, ДоговорВзаиморасчетов", ЭтотОбъект.Контрагент, ЭтотОбъект.ДоговорВзаиморасчетов);
	ТЗ_Долг = РегистрыНакопления.ВзаиморасчетыКомпании.Остатки(, Структура_ОтборДолг,, "Сумма,СуммаУпр");   
	Долг = ТЗ_Долг.Итог("Сумма");
	
	Если Долг < 0 Тогда
		Возврат;
	КонецЕсли;  
	
	//Иванченко 20260320 ++
	//Попытка
	//	Структура_ОтборОстаток = Новый Структура("Автомобиль", ЭтотОбъект.ДокументОснование.Сделка.Автомобиль);
	//	ТЗ_Остаток = РегистрыНакопления.ОстаткиАвтомобилей.Остатки(ЭтотОбъект.Дата, Структура_ОтборОстаток,, "Количество");
	//	Остаток = ТЗ_Остаток.Итог("Количество");
	//	
	//	Если Остаток = 0 Тогда
	//		Возврат;
	//	КонецЕсли; 
	//	
	//Исключение
	//КонецПопытки;
	////Иванченко 20260216 -- 
	//Иванченко 20260320 --	
	
	//Иванченко 20260324 ++
	//Если ТипЗнч(ЭтотОбъект.Сделка) = Тип("ДокументСсылка.РеализацияАвтомобилей") Тогда
	//	Структура_ОтборРеализация = Новый Структура("ДокументПродажи", ЭтотОбъект.Сделка); 
	//	ТЗ_Реализация = РегистрыНакопления.ПродажиАвтомобилей.Обороты(,, Структура_ОтборРеализация, "ДокументПродажи", "Количество");
	//	ТЗ_Реализация.Сортировать("ДокументПродажи Убыв");     
	//	Массив_ДатаРеализации = ТЗ_Реализация.ВыгрузитьКолонку("ДокументПродажи");
	//Иначе 
	//	Структура_ОтборРеализация = Новый Структура("ДокументПередачи", ЭтотОбъект.Сделка);
	//	ТЗ_Реализация = РегистрыНакопления.РеализованныеТовары.Обороты(,, Структура_ОтборРеализация, "ДокументПередачи", "Количество"); 
	//	ТЗ_Реализация.Сортировать("ДокументПередачи Убыв");       
	//	Массив_ДатаРеализации = ТЗ_Реализация.ВыгрузитьКолонку("ДокументПередачи");
	//КонецЕсли;
	//	
	//Если Массив_ДатаРеализации.Количество() <> 0 Тогда
	//	ДатаРеализации = Массив_ДатаРеализации[0].Дата;	
	//	
	//	Если НачалоДня(ЭтотОбъект.Дата) = НачалоДня(ДатаРеализации) Тогда   
	//		Возврат;
	//	КонецЕсли;
	//	
	//КонецЕсли;	
	//Иванченко 20260324 --	
 	
	СФ_НаАвансВыданный = Неопределено;    
	СФ_НаАвансВыданныйТребуется = Ложь;
	
	Если ЭтотОбъект.СтатьяДДС.КоррСчет=ПланыСчетов.Регламентированный.РасчетыПоАвансамПолученным Тогда
		СФ_НаАвансВыданный = Документы.СчетФактураВыданный.СоздатьДокумент(); 
		СФ_НаАвансВыданный.Комментарий = "Счет-фактура на аванс был автоматически создан "+СокрЛП(ТекущаяДата())+" пользователем "+СокрЛП(ПараметрыСеанса.Пользователь);
		СФ_НаАвансВыданный.НаАванс = Истина;
		СФ_НаАвансВыданныйТребуется = Истина;
 	КонецЕсли;
	
	Если Не СФ_НаАвансВыданныйТребуется Тогда
		Возврат;
	КонецЕсли;	
 	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка КАК СФ,
	|	СчетФактураВыданный.ДокументОснование,
	|	СчетФактураВыданный.Проведен
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ЭтотОбъект.Ссылка);
     	
	Результат = Запрос.Выполнить();		
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СФ_НаАвансВыданный = ВыборкаДетальныеЗаписи.СФ.ПолучитьОбъект(); 
		Прервать;
	КонецЦикла; 
	
	Если СФ_НаАвансВыданный = Неопределено Тогда
		// Так как условие <<ЭтотОбъектСтатьяДДС.КоррСчет="60.02">> не выполнено и старый счет-фактура выданный на аванс не найден
		Возврат;
 	КонецЕсли;
	 
	СФ_НаАвансВыданный.Заполнить(ЭтотОбъект.Ссылка);
	
	Если Не СФ_НаАвансВыданный.НаАванс Тогда
		СФ_НаАвансВыданный.НаАванс = Истина;
  	КонецЕсли;
	
	 
	СФ_НаАвансВыданный.УстановитьНовыйНомер("");
	
 	СФ_НаАвансВыданный.Дата = ЭтотОбъект.Дата; 
	СФ_НаАвансВыданный.Комментарий = "Документ был автоматически обновлен "+СокрЛП(ТекущаяДата());
	СФ_НаАвансВыданный.ХозОперация = Справочники.ХозОперации.СчетФактураВыданный;
   	
	ФлЭтотОбъектПроведен = ЭтотОбъект.Проведен;
	ФлЭтотОбъектПометкаУдаления = ЭтотОбъект.ПометкаУдаления;
	
	СФ_НаАвансВыданный.Проведен = ФлЭтотОбъектПроведен;			
	СФ_НаАвансВыданный.ПометкаУдаления = ФлЭтотОбъектПометкаУдаления;
	
	БылиОшибки = Ложь;
  	
	Если ФлЭтотОбъектПометкаУдаления Тогда
		РежимЗаписиДокумента_ = РежимЗаписиДокумента.Запись;
	Иначе                                                           
		Если ФлЭтотОбъектПроведен Тогда
			РежимЗаписиДокумента_ = РежимЗаписиДокумента.Проведение; 
		Иначе
			РежимЗаписиДокумента_ = РежимЗаписиДокумента.ОтменаПроведения; 
		КонецЕсли;
	КонецЕсли;
	
	Попытка 
		СФ_НаАвансВыданный.Записать(РежимЗаписиДокумента_); 
	Исключение  
		Попытка
			НачатьТранзакцию();
			СФ_НаАвансВыданный.УстановитьНовыйНомер("");
			СФ_НаАвансВыданный.Записать(РежимЗаписиДокумента_);
			ЗафиксироватьТранзакцию(); 
		Исключение
			ОтменитьТранзакцию();
			БылиОшибки = Истина;
		КонецПопытки;
	КонецПопытки; 
	
	Если БылиОшибки Тогда
		СМГ_Сообщить("ОШИБКА! На аванс -> "+СокрЛП(СФ_НаАвансВыданный),СтатусСообщения.ОченьВажное);
		#Если Клиент Тогда
			Если РольДоступна("ПолныеПрава") Тогда
				Если НЕ РежимЗаписиДокумента_ = РежимЗаписиДокумента.Проведение Тогда
					Форма = СФ_НаАвансВыданный.ПолучитьФорму("ФормаДокумента");
					Если Не Форма.Открыта() Тогда
						Форма.ОткрытьМодально();
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		#КонецЕсли
	КонецЕсли;
      	
КонецПроцедуры //СМГ_СоздатьИлиОбновитьСФВыданный()
//Бондаренко-- 20260123

//Иванченко 20260320 ++
Процедура ОтменитьПроведениеСФнаАванс()
	
	СпЗн = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка КАК СФ,
	|	СчетФактураВыданный.ДокументОснование КАК ДокументОснование,
	|	СчетФактураВыданный.Проведен КАК Проведен
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.ДокументОснование = &ДокументОснование
	|	И СчетФактураВыданный.Проведен";
	Запрос.УстановитьПараметр("ДокументОснование", ЭтотОбъект.Ссылка);
      	
	Результат = Запрос.Выполнить();		
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СФ_НаАвансВыданный = ВыборкаДетальныеЗаписи.СФ.ПолучитьОбъект(); 
		
		Попытка
			СФ_НаАвансВыданный.Записать(РежимЗаписиДокумента.ОтменаПроведения); 
			#Если Клиент Тогда
				//Если ЭтотОбъект.Комментировать Тогда
					СМГ_Сообщить("Снят с проведения авансовый "+СФ_НаАвансВыданный); 
				//КонецЕсли;	
			#КонецЕсли
		Исключение
			#Если Клиент Тогда
				//Если ЭтотОбъект.Комментировать Тогда
					СМГ_Сообщить("ОШИБКА! Не удалось снять с проведения авансовый "+СФ_НаАвансВыданный,СтатусСообщения.ОченьВажное); 
				//КонецЕсли;	
			#КонецЕсли
		КонецПопытки;
		
	КонецЦикла;	

КонецПроцедуры
//Иванченко 20260320 --

Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ОбработкаПроведения(Отказ, Режим)
	Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда Возврат; КонецЕсли;
	
	ВедетсяБалансПоПодразделению = (Константы.СпособВеденияБаланса.Получить() = Перечисления.СпособВеденияБаланса.ПоПодразделению);
	
	// приходуем деньги в кассу
	НаборЗаписейДС=Движения.ДенежныеСредстваКомпании;
	НаборЗаписейДС.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейДС.РежимПроведения=Режим;
	НаборЗаписейДС.СтруктурнаяЕдиница=КассаКомпании;
	НаборЗаписейДС.СтатьяДДС=СтатьяДДС;
	НаборЗаписейДС.Валюта=Неопределено;
	НаборЗаписейДС.Сумма=СуммаДокумента;
	Отказ=НЕ НаборЗаписейДС.Приход() ИЛИ Отказ;
	// проводим взаиморасчеты
	НаборЗаписейВзаиморасчеты=Движения.ВзаиморасчетыКомпании;
	НаборЗаписейВзаиморасчеты.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейВзаиморасчеты.РежимПроведения=Режим;
	НаборЗаписейВзаиморасчеты.Контрагент=Контрагент;
	НаборЗаписейВзаиморасчеты.ДоговорВзаиморасчетов=ДоговорВзаиморасчетов;
	Если ЗначениеЗаполнено(Сделка)Тогда
		НаборЗаписейВзаиморасчеты.Сделка = Сделка;
		ТипСделка=ТипЗнч(Сделка);
		Если орПолучитьТипыСделок(Ложь).СодержитТип(ТипСделка) Тогда
			 НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем=Ложь;
		ИначеЕсли орПолучитьТипыСделок(Истина).СодержитТип(ТипСделка) Тогда
			 НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем=Истина;
		Иначе
			 НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем=Неопределено;
		КонецЕсли; 
	Иначе
		НаборЗаписейВзаиморасчеты.Сделка=Неопределено;
	КонецЕсли; 
	НаборЗаписейВзаиморасчеты.АвтоЗакрытиеСделок=АвтоЗакрытиеСделок;
	НаборЗаписейВзаиморасчеты.Сумма=СуммаДокумента;
	НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц=0;
	Отказ=НЕ НаборЗаписейВзаиморасчеты.Расход() ИЛИ Отказ;
	// доходы и расходы по суммовым разницам
	СуммаДоходаРасходаСуммовыхРазниц=НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц;
	Если СуммаДоходаРасходаСуммовыхРазниц<>0 Тогда
		НаборЗаписейДиР = Движения.ДоходыИРасходы;
		НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
		Если ВедетсяБалансПоПодразделению Тогда
			НаборЗаписейДиР.Подразделение = ДоговорВзаиморасчетов.Подразделение;
		КонецЕсли;
		НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СуммовыеРазницы;
		НаборЗаписейДиР.ВУпрВалюте = Истина;
		Если СуммаДоходаРасходаСуммовыхРазниц<0 Тогда
			НаборЗаписейДиР.Расход = -СуммаДоходаРасходаСуммовыхРазниц;
		Иначе
			НаборЗаписейДиР.Доход = СуммаДоходаРасходаСуммовыхРазниц;
		КонецЕсли;
		Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
	КонецЕсли;
	
	// определим необходимость формирования корректирующих проводок
	ПодразделениеКасса = обПолучитьБалансовоеПодразделение(КассаКомпании.Подразделение);
	ПодразделениеДоговорВзаиморасчетов = обПолучитьБалансовоеПодразделение(ДоговорВзаиморасчетов.Подразделение);
	БалансовыеПодразделенияНеРавны = (ПодразделениеДоговорВзаиморасчетов<>ПодразделениеКасса);
	Если ВедетсяБалансПоПодразделению И БалансовыеПодразделенияНеРавны Тогда
		НаборЗаписейДиР = Движения.ДоходыИРасходы;
		
		НаборЗаписейДиР.ДокументОбъект			= ЭтотОбъект;
		НаборЗаписейДиР.Подразделение			= КассаКомпании.Подразделение;
		НаборЗаписейДиР.СтатьяДоходовИРасходов	= Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
		НаборЗаписейДиР.ВУпрВалюте				= Ложь;
		НаборЗаписейДиР.Доход					= СуммаДокумента;
		Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		
		НаборЗаписейДиР.ДокументОбъект			= ЭтотОбъект;
		НаборЗаписейДиР.Подразделение			= ДоговорВзаиморасчетов.Подразделение;
		НаборЗаписейДиР.СтатьяДоходовИРасходов	= Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
		НаборЗаписейДиР.ВУпрВалюте				= Ложь;
		НаборЗаписейДиР.Расход					= СуммаДокумента;
		Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
	КонецЕсли;	
	
	// Возможно расхождение баланса на "копейки" из-за округления. Возникшую разницу
	// необходимо списать на доходы и расходы.
	Отказ = НЕ дкСписаниеКопейкиПриОкругленииВалютныхСчетов(ЭтотОбъект) ИЛИ Отказ;
	
	// двигаем границу последовательности взаиморасчетов
	ДвигаемГраницу = (Режим<>РежимПроведенияДокумента.Оперативный И Движения.ВзаиморасчетыКомпании.Количество()>0);
	Если ДвигаемГраницу ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.ДоговорВзаиморасчетовБыл) Тогда
		НаборЗаписейГраницыВзаиморасчетов = РегистрыСведений.ГраницыВзаиморасчетов.СоздатьНаборЗаписей();
		Если ДвигаемГраницу Тогда
			ТаблицаДоговоров = Движения.ВзаиморасчетыКомпании.Выгрузить();
			ТаблицаДоговоров.Свернуть("ДоговорВзаиморасчетов","");
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетов = ТаблицаДоговоров.ВыгрузитьКолонку("ДоговорВзаиморасчетов");
			НаборЗаписейГраницыВзаиморасчетов.МоментВремени = Дата;
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетовБыл = ДополнительныеСвойства.ДоговорВзаиморасчетовБыл;
			НаборЗаписейГраницыВзаиморасчетов.МоментВремениБыл = ДополнительныеСвойства.МоментВремениБыл;
		Иначе
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетов = ДополнительныеСвойства.ДоговорВзаиморасчетовБыл;
			НаборЗаписейГраницыВзаиморасчетов.МоментВремени = ДополнительныеСвойства.МоментВремениБыл;
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетовБыл = Неопределено;
			НаборЗаписейГраницыВзаиморасчетов.МоментВремениБыл = Неопределено;
		КонецЕсли;
		НаборЗаписейГраницыВзаиморасчетов.ДокументСсылка = Ссылка;
		НаборЗаписейГраницыВзаиморасчетов.ИзменитьГраницу();
	КонецЕсли;
	
	Если ДляПробитияНаФР=Истина И ЗначениеЗаполнено(КассаККМ) Тогда
		СуммаОплаты=обПересчет(СуммаДокумента,ВалютаДокумента,КурсДокумента,Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(),Дата);
		НаборЗаписейКассыККМ=Движения.КассыККМ;
		НаборЗаписейКассыККМ.ДокументОбъект 	= ЭтотОбъект;
		НаборЗаписейКассыККМ.РежимПроведения 	= Режим;
		НаборЗаписейКассыККМ.КассаККМ 			= КассаККМ;
		НаборЗаписейКассыККМ.СпособОплаты 		= Справочники.ТипыОплат.Наличные;
		НаборЗаписейКассыККМ.Сумма				= СуммаОплаты;	
		Отказ=НЕ НаборЗаписейКассыККМ.Приход() ИЛИ Отказ;
		Если НЕ Отказ Тогда
			НаборЗаписейКассыККМ.ДокументОбъект = ЭтотОбъект;
			НаборЗаписейКассыККМ.РежимПроведения= Режим;
			НаборЗаписейКассыККМ.КассаККМ 		= КассаККМ;
			НаборЗаписейКассыККМ.СпособОплаты 	= Справочники.ТипыОплат.Наличные;
			НаборЗаписейКассыККМ.Сумма			= СуммаОплаты;	
			Отказ=НЕ НаборЗаписейКассыККМ.Расход() ИЛИ Отказ;
		КонецЕсли; 
	КонецЕсли; 
	
	Если НЕ Отказ Тогда
		//проведение в Платежный календарь
		НаборЗаписей = Движения.ПлатежныйКалендарь;
		НаборЗаписей.ДокументОбъект = Ссылка;
		НаборЗаписей.Поступление    = Истина;
		
		Отказ = Не НаборЗаписей.Факт();
	КонецЕсли;
	
	// если модифицировали документ, то запишем его
	Если НЕ Отказ И Модифицированность() Тогда
		Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
	// выведем сообщения об ошибках и предупреждениях
	Если СообщениеОбОшибке=Неопределено Тогда
		дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
	Иначе
		Если ТипЗнч(РезультатОбработки)=Тип("Строка") Тогда
			СообщениеОбОшибке=РезультатОбработки;
		Иначе
			Для каждого СтрокаОшибки Из РезультатОбработки.Сообщения Цикл
				СообщениеОбОшибке=СообщениеОбОшибке+СтрокаОшибки.Сообщение+"
				|";
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
ОбработкаРасчетСкидок = Неопределено;
#Если Клиент Тогда
Права = глПрава;
ОбработкаРасчетСкидок = Обработки.РасчетСкидок.Создать();
ОбработкаРасчетСкидок.НеРассчитыватьАвтоматическиеСкидки = Истина;
#КонецЕсли
ОтключитьПроверкиПередЗаписью = ЛОЖЬ;
СообщениеОбОшибке = Неопределено;
 